{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"23": "Commercial Transactions (Kitab Al-Buyu)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3326,
			"arabicnumber": 3326,
			"text": "Narrated Qays ibn AbuGharazah: In the time of the Messenger of Allah (ﷺ) we used to be called brokers, but the Prophet (ﷺ) came upon us one day, and called us by a better name than that, saying: O company of merchants, unprofitable speech and swearing takes place in business dealings, so mix it with sadaqah (alms)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3327,
			"arabicnumber": 3327,
			"text": "The tradition mentioned above has also been transmitted by Qais b. Abi Gharazah through a different chain of narrators to the same effect. This version has:\"Lying and swearing have a place on i.\" 'Abd Allah al-Zuhri said: \"Unprofitable speech and lying",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3328,
			"arabicnumber": 3328,
			"text": "Narrated Abdullah ibn Abbas: A man seized his debtor who owed ten dinars to him. He said to him: I swear by Allah, I shall not leave you until you pay off (my debt) to me or bring a surety. The Prophet (ﷺ) stood as a surety for him. He then brought as much (money) as he promised. The Prophet (ﷺ) asked: From where did you acquire this gold? He replied: From a mine. He said: We have no need of it; there is no good in it. Then the Messenger of Allah (ﷺ) paid (the debt) on his behalf",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3329,
			"arabicnumber": 3329,
			"text": "Narrated Al-Nu'man b. Bashir:I heard the Messenger of Allah (ﷺ) say: What is lawful is clear and what is unlawful is clear, but between them are certain doubtful things. I give you an example for this. Allah has a preserve, and Allah's preserve is the things He has declared unlawful. He who pastures (his animals) round the preserve will soon fall into it. He who falls into doubtful things will soon be courageous",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3330,
			"arabicnumber": 3330,
			"text": "Narrated Al-Nu'man b. Bashir:I heard Messenger of Allah (ﷺ) say: But between them are certain doubtful things which many people do not recognize. He who guards against doubtful things keeps his religion and his honor blameless, but he who falls into doubtful things falls into what is unlawful",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3331,
			"arabicnumber": 3331,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: A time is certainly coming to mankind when only the receiver of usury will remain, and if he does not receive it, some of its vapour will reach him. Ibn Isa said: Some of its dust will reach him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3332,
			"arabicnumber": 3332,
			"text": "Asim ibn Kulayb quoted his father's authority for the following statement by one of the Ansar:We went out with the Messenger of Allah (ﷺ) to a funeral, and I saw the Messenger of Allah (ﷺ) at the grave giving this instruction to the grave-digger: Make it wide on the side of his feet, and make it wide on the side of his head. When he came back, he was received by a man who conveyed an invitation from a woman. So he came (to her), to it food was brought, and he put his hand (i.e. took a morsel in his hand); the people did the same and they ate. Our fathers noticed that the Messenger of Allah (ﷺ) was moving a morsel around his mouth. He then said: I find the flesh of a sheep which has been taken without its owner's permission. The woman sent a message to say: Messenger of Allah, I sent (someone) to an-Naqi' to have a sheep bought for me, but there was none; so I sent (a message) to my neighbour who had bought a sheep, asking him to send it to me for the price (he had paid), but he could not be found. I, therefore, sent (a message) to his wife and she sent it to me. The Messenger of Allah (ﷺ) said: Give this food to the prisoners",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3333,
			"arabicnumber": 3333,
			"text": "Narrated Abdullah ibn Mas'ud: The Messenger of Allah (ﷺ) cursed the one who accepted usury, the one who paid it, the witness to it, and the one who recorded it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3334,
			"arabicnumber": 3334,
			"text": "Narrated Sulaiman b. 'Amr: On the authority of his father: I heard the Messenger of Allah (ﷺ) say in the Farewell Pilgrimage: \"Lo, all claims to usury of the pre-Islamic period have been abolished. You shall have your capital sums, deal not unjustly and you shall not be dealt with unjustly. Lo, all claims for blood-vengeance belonging to the pre-Islamic period have been abolished. The first of those murdered among us whose blood-vengeance I remit is al-Harith ibn AbdulMuttalib, who suckled among Banu Layth and killed by Hudhayl.\" He then said: O Allah, have I conveyed the message? They said: Yes, saying it three times. He then said: O Allah, be witness, saying it three times",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3335,
			"arabicnumber": 3335,
			"text": "Narrated Abu Hurairah:I heard Messenger of Allah (ﷺ) say: Swearing produces a ready sale for a commodity but blots out the blessing. The narrator Ibn al-Sarh said: \"for earning\". He also narrated this tradition from Sa'id b. al-Musayyab on the authority of Abu Hurairah from the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3336,
			"arabicnumber": 3336,
			"text": "Narrated Suwayd ibn Qays: I and Makhrafah al-Abdi imported some garments from Hajar, and brought them to Mecca. The Messenger of Allah (ﷺ) came to us walking, and after he had bargained with us for some trousers, we sold them to him. There was a man who was weighing for payment. The Messenger of Allah (ﷺ) said to him: Weigh out and give overweight",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3337,
			"arabicnumber": 3337,
			"text": "The tradition mentioned above (No. 3330) has also been transmitted by AbuSafwan ibn Umayrah through a different chain of narrators. This version has:Abu Safwan said: I came to the Messenger of Allah (ﷺ) at Mecca before his immigration. He then narrated the rest of the tradition, but he did not mention the words \"who was weighing for payment\". Abu Dawud sad: Qais also transmitted it as Sufyan said: The version of Sufyan is authoritative",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3338,
			"arabicnumber": 3338,
			"text": "Narrated Ibn Abi Rizmah:I heard my father say: A man said to Shu'bah: Sufyan opposed you (i.e. narrated a tradition which differs from your version). He replied: You racked my mind. I have been told that Yahya b. Ma'in said: If anyone opposes Sufyan, the version of Sufyan will be acceptable",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3339,
			"arabicnumber": 3339,
			"text": "Shu'bah said:The memory of Sufyan was stronger than mine",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3340,
			"arabicnumber": 3340,
			"text": "Narrated Abdullah ibn Umar: The Prophet (ﷺ) said: (The standard) weight is the weight of the people of Mecca, and the (standard) measure is the measure of the people of Medina. Abu Dawud said: Al-Firyabi and Abu Ahmad have also transmitted from Sufyan in a similar way, and he (Ibn Dukain) agreed with them on the text. The version of Abu Ahmad has: \"from Ibn 'Abbas\" instead of Ibn 'Umar. It has also been transmitted by al-Walid b. Muslim from Hanzalah. This version has: \"the weight of Medina and the measure of Mecca.\" Abu Dawud said: There is a variation in the text of the version of this tradition narrated by Malik b. Dinar from 'Ata' from the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3341,
			"arabicnumber": 3341,
			"text": "Narrated Samurah: The Messenger of Allah (ﷺ) addressed us and said: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe? Then a man stood and said: I am (here), Messenger of Allah. He said: What prevented you from replying the first two times? I wish to tell you something good. Your companion has been detained (from entering Paradise) on account of his debt. Then I saw him that he paid off all his debt on his behalf and there remained no one to demand from him anything. Abu Dawud said: The name of the narrator Sam'an is Sam'an b. Mushannaj",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3342,
			"arabicnumber": 3342,
			"text": "Narrated AbuMusa al-Ash'ari: The Prophet (ﷺ) said: After the grave sins which Allah has prohibited the greatest sin is that a man dies while he has debt due from him and does not leave anything to pay it off, and meets Him with it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3343,
			"arabicnumber": 3343,
			"text": "Narrated Jabir ibn Abdullah: The Messenger of Allah (ﷺ) would not say funeral prayer over a person who died while the debt was due from him. A dead Muslim was brought to him and he asked: Is there any debt due from him? They (the people) said: Yes, two dirhams. He said: Pray yourselves over your companion. Then AbuQatadah al-Ansari said: I shall pay them, Messenger of Allah. The Messenger of Allah (ﷺ) then prayed over him. When Allah granted conquests to the Messenger of Allah (ﷺ), he said: I am nearer to every believer than himself, so if anyone (dies and) leaves a debt, I shall be responsible for paying it; and if anyone leaves property, it goes to his heirs",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3344,
			"arabicnumber": 3344,
			"text": "A similar tradition has also been transmitted by Ibn 'Abbas though a different chain of narrators. This version says:\"He (the Prophet) purchased a calf from a caravan, but he had no money with him. He then sold it with some profit and gave the profit in charity to the poor and widows of Banu 'Abd al-Muttalib. He then said: I shall not buy anything after this but only when I have money with me",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3345,
			"arabicnumber": 3345,
			"text": "Narrated Abu Hurairah:The Messenger of Allah (ﷺ) as saying: Delay in payment (of debt) by a rich man is injunctive, but when one of you is referred to a wealthy man, he should accept the reference",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3346,
			"arabicnumber": 3346,
			"text": "Narrated Abu Rafi':The Messenger of Allah (ﷺ) borrowed a young camel, and when the camels of the sadaqah (alms) came to him, he ordered me to pay the man his young camel. I said: I find only an excellent camel in its seventh year. So the Prophet (ﷺ) said: Give it to him, for the best person is he who discharges his debt in the best manner",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3347,
			"arabicnumber": 3347,
			"text": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) owed me a debt and gave me something extra when he paid it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3348,
			"arabicnumber": 3348,
			"text": "Narrated 'Umar:The Messenger of Allah (ﷺ) as saying: Gold for gold is interest unless both hand over on the spot ; wheat for wheat is interest unless both hand over on the spot ; dates for dates is interest unless both hand over on the spot ; barley for barley is interest unless both hand over on the spot",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3349,
			"arabicnumber": 3349,
			"text": "Narrated Ubadah ibn as-Samit: The Messenger of Allah (ﷺ) said: Gold is to be paid for with gold, raw and coined, silver with silver, raw and coined (in equal weight), wheat with wheat in equal measure, barley with barley in equal measure, dates with dates in equal measure, salt by salt with equal measure; if anyone gives more or asks more, he has dealt in usury. But there is no harm in selling gold for silver and silver (for gold), in unequal weight, payment being made on the spot. Do not sell them if they are to be paid for later. There is no harm in selling wheat for barley and barley (for wheat) in unequal measure, payment being made on the spot. If the payment is to be made later, then do not sell them. Abu Dawud said: This tradition has also been transmitted by Sa'id b. Abi 'Arubah, Hisham al-Dastawa'i and Qatadah from Muslim b. Yasar through his chain",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3350,
			"arabicnumber": 3350,
			"text": "The tradition mentioned above has also been transmitted by 'Ubadah b. al-Samit through a different chain of transmitters with some alternation. This version adds:\"He said: If these classes differ, sell as you wish if payment is made on the spot",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3351,
			"arabicnumber": 3351,
			"text": "Narrated Fudalah ibn Ubayd: The Prophet (ﷺ) was brought a necklace in which there were gold and pearls. (The narrators AbuBakr and (Ahmad) Ibn Mani' said: The pearls were set with gold in it, and a man bought it for nine or seven dinars.) The Prophet (ﷺ) said: (It must not be sold) till the contents are considered separately. The narrator said: He returned it till the contents were considered separately. The narrator Ibn Asa said: By this I intended trade. Abu Dawud said: The word hijarah (stone) was recorded in his note-book before, but he changed it and narrated tijarah (trade)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3352,
			"arabicnumber": 3352,
			"text": "Narrated Fudalah bin 'Ubaid:At the battle of Khaibar I bought a necklace in which there were gold and pearls for twelve dinars. I separated them and found that its worth was more than twelve dinars. So I mentioned that to the Prophet (ﷺ) who said: It must not be sold till the contents are considered separately",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3353,
			"arabicnumber": 3353,
			"text": "Narrated Fudalah bin 'Ubaid:We were with the Messenger of Allah (ﷺ) at the battle of Khaibar. We were selling to the Jews one uqiyah of gold for one dinar. The narrators other than Qutaibah said: \"for two or three dinars.\" Then both the versions agreed. The Messenger of Allah (ﷺ) said: Do not sell gold except with equal weight",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3354,
			"arabicnumber": 3354,
			"text": "Narrated Abdullah ibn Umar: I used to sell camels at al-Baqi for dinars and take dirhams for them, and sell for dirhams and take dinars for them. I would take these for these and give these for these. I went to the Messenger of Allah (ﷺ) who was in the house of Hafsah. I said: Messenger of Allah , take it easy, I shall ask you (a question): I sell camels at al-Baqi'. I sell (them) for dinars and take dirhams and I sell for dirhams and take dinars. I take these for these, and give these for these. The Messenger of Allah (ﷺ) then said: There is no harm in taking them at the current rate so long as you do not separate leaving something to be settled",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3355,
			"arabicnumber": 3355,
			"text": "The tradition mentioned above has also been transmitted by Simak (b. Harb) with a different chain of narrators and to the same effect. The first version is more perfect. It does not mention the words \"at the current rate",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3356,
			"arabicnumber": 3356,
			"text": "Narrated Samurah (ibn Jundub): The Prophet (ﷺ) forbade selling animals for animals when payment was to be made at a later date",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3357,
			"arabicnumber": 3357,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Messenger of Allah (ﷺ) commanded him to equip an army, but the camels were insufficient. So he commanded him to keep back the young camels of sadaqah, and he was taking a camel to be replaced by two when the camels of sadaqah came",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3358,
			"arabicnumber": 3358,
			"text": "Narrated Jabir:The Prophet (ﷺ) bought a slave for two slaves",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3359,
			"arabicnumber": 3359,
			"text": "Zayd Abu 'Ayyash asked Sa'd ibn Abi Waqqas about the sale of the soft and white kind of wheat for barley. Sa'd said:Which of them is better? He replied: Soft and white kind of wheat. So he forbade him from it and said: I heard the Messenger of Allah (sawa) say, when he was asked about buying dry dates for fresh. The Messenger of Allah (sawa) said: Are fresh dates diminished when they become dry? The (the people) replied: Yes. So the Messenger of Allah (ﷺ) forbade that. Abu Dawud said: A similar tradition has also been transmitted by Isma'il b. Umayyah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3360,
			"arabicnumber": 3360,
			"text": "Narrated Sa'd ibn Abi Waqqas: The Messenger of Allah (ﷺ) forbade to sell fresh dates for dry dates when payment is made at a later date. Abu Dawud said: The tradition mentioned above has also been transmitted by Sa'd (b. Abi Waqqas) from the Prophet (ﷺ) through a different chain of narrators in a similar way",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3361,
			"arabicnumber": 3361,
			"text": "Narrated Ibn 'Umar:The Prophet (ﷺ) forbade the sale of fruits on the tree for fruits by measure, and sale of grapes for raisins by measure, and sale of harvest for wheat by measure",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3362,
			"arabicnumber": 3362,
			"text": "Narrated Zaid b. Thabit:The Prophet (ﷺ) gave license for the sale of 'araya for dried dates and fresh dates",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3363,
			"arabicnumber": 3363,
			"text": "Narrated Sahl b. Abi Khathmah:The Messenger of Allah (ﷺ) forbade the sale of fruits for dried dates, but gave license regarding the 'araya for its sale on the basis of a calculation of their amount. But those who buy them can eat them when fresh",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3364,
			"arabicnumber": 3364,
			"text": "Narrated Abu Hurairah: The Messenger of Allah (ﷺ) gave license regarding the sale of 'araya when the amount was less then five wasqs or five wasqs. Dawud b. al-Husain was doubtful. Abu Dawud said: The tradition by Jabir indicates up to four wasqs",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3365,
			"arabicnumber": 3365,
			"text": "Abd Rabbihi b. Sa'id al-Ansari said:'Ariyyah means that a man gives another man a palm-tree on loan, or it means that reserves one or two palm-trees from his property for his personal use, then he sells for dried dates",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3366,
			"arabicnumber": 3366,
			"text": "Ibn Ishaq said:'Araya means that a man lends another man some palm-trees, but he (the owner) feels inconvenient that the man looks after the trees (by frequent visits). He (the borrower) sells them (to the owner) by calculation",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3367,
			"arabicnumber": 3367,
			"text": "Narrated 'Abdullah bin 'Umar:The Messenger of Allah (ﷺ) forbade the sale of fruits till they were clearly in good condition, forbidding it both to the seller and to the buyer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3368,
			"arabicnumber": 3368,
			"text": "Narrated Ibn 'Umar:The Messenger of Allah (ﷺ) forbade selling palm-trees till the dates began to ripen, and ears of corn till they were white and were safe from blight, forbidding it both to the buyer and to the seller",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3369,
			"arabicnumber": 3369,
			"text": "Narrated AbuHurayrah: The Messenger of Allah (ﷺ) forbade to sell spoils of war till they are appointed, and to sell palm trees till they are safe from every blight, and a man praying without tying belt",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3370,
			"arabicnumber": 3370,
			"text": "Narrated Jabir bin ‘Abdullah :The Messenger of Allah (ﷺ) forbade the sale of fruits until they are ripened (tushqihah). He was asked: What do you mean by their ripening (ishqah)? He replied: They become red or yellow, and they are eaten",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3371,
			"arabicnumber": 3371,
			"text": "Narrated Anas ibn Malik: The Prophet (ﷺ) forbade the sale of grapes till they became black and the sale of grain till it had become hard",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3372,
			"arabicnumber": 3372,
			"text": "Yunus said:I asked Abu Zinad about the sale of fruits before they were clearly in good condition, and what was said about it. He replied: Urwah ibn az-Zubayr reports a tradition from Sahl ibn Abi Hathmah on the authority of Zayd ibn Thabit who said: The people used to sell fruits before they were clearly in good condition. When the people cut off the fruits, and were demanded to pay the price, the buyer said: The fruits have been smitten by duman, qusham and murad fruit diseases on which they used to dispute. When their disputes which were brought to the Prophet (ﷺ) increased, the Messenger of Allah (ﷺ) said to them as an advice: No, do not sell fruits till they are in good condition, due to a large number of their disputes and differences",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Hadith"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3373,
			"arabicnumber": 3373,
			"text": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) forbade the sale of fruits till they were clearly in good condition , and (ordered that) they should not be sold but for dinar or dirham except Araya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3374,
			"arabicnumber": 3374,
			"text": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) forbade selling fruits years ahead, and commanded that unforeseen loss be remitted in respect of what is affected by blight. Abu Dawud said: The attribution of the tradition regarding the effect of blight is one-third of the produce to the Prophet (ﷺ) is not correct. This is the opinion of the people of Medina",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3375,
			"arabicnumber": 3375,
			"text": "Narrated Jabir bin ‘Abdullah :The Prophet (ﷺ) forbade sale of fruits for a number of years. One of the two narrators (Abu al-Zubair and Sa'id b. Mina') mentioned the words \"sale for years\" (bai' al-sinin instead of al-mu'awamah)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3376,
			"arabicnumber": 3376,
			"text": "Narrated Abu Hurairah:The Prophet (ﷺ) forbade the type of sale which involves risk (or uncertainty) and a transaction determined by throwing stones",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3377,
			"arabicnumber": 3377,
			"text": "Narrated Abu Sa’id Al Khudri :The Prophet (ﷺ) forbade two types of business transactions and two ways of dressing. The two types of business transactions are mulamasah and munabadhah. As regards the two ways of dressing, they are the wrapping of the samma', and that when a man wraps himself up in a single garment while sitting in such a way that he does not cover his private parts or there is no garment on his private parts",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3378,
			"arabicnumber": 3378,
			"text": "The tradition mentioned above has also been reported by Abu Sa'id al-Khudri from the Prophet (ﷺ) through a different chain of narrators. This version adds:\"Wearing the samma' means that a man puts his garment over his left shoulder and keeps his right side uncovered. Munabadhah means that a man says (to another): If I throw this garment to you, the sale will be certain. Mulamasah means that a man touches it (another's garment) with his hand and neither he unfolds it nor turns it over. When he touched it, the sale becomes binding",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3379,
			"arabicnumber": 3379,
			"text": "The tradition mentioned above has also been transmitted by Abu Said al-Khudri through a different chain of narrators from the Messenger of Allah (ﷺ) to the same effect as narrated by both Sufyan and 'Abd al-Razzaq",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3380,
			"arabicnumber": 3380,
			"text": "Narrated Ibn 'Umar:The Messenger of Allah (ﷺ) forbade the transaction called habal al-habalah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3381,
			"arabicnumber": 3381,
			"text": "A similar tradition has also been narrated by Ibn 'Umar from the Prophet (ﷺ) through a different chain of transmitters. He said:Habal al-habalah means that a she-camel delivers an offspring and then the offspring which it delivers becomes pregnant",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3382,
			"arabicnumber": 3382,
			"text": "Narrated Ali ibn AbuTalib: A time is certainly coming to mankind when people will bite each other and a rich man will hold fast, what he has in his possession (i.e. his property), though he was not commanded for that. Allah, Most High, said: \"And do not forget liberality between yourselves.\" The men who are forced will contract sale while the Prophet (ﷺ) forbade forced contract, one which involves some uncertainty, and the sale of fruit before it is ripe",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3383,
			"arabicnumber": 3383,
			"text": "Narrated AbuHurayrah: The Messenger of Allah (ﷺ) having said: Allah, Most High, says: \"I make a third with two partners as long as one of them does not cheat the other, but when he cheats him, I depart from them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3384,
			"arabicnumber": 3384,
			"text": "Narrated Urwah ibn AbulJa'd al-Bariqi: The Prophet (ﷺ) gave him a dinar to buy a sacrificial animal or a sheep. He bought two sheep, sold one of them for a dinar, and brought him a sheep and dinar. So he invoked a blessing on him in his business dealing, and he was such that if had he bought dust he would have made a profit from it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3385,
			"arabicnumber": 3385,
			"text": "The tradition mentioned above has also been transmitted by 'Urwat al-Bariqi through a different chain of narrators. The wordings of this version are different from those of the previous one",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3386,
			"arabicnumber": 3386,
			"text": "Narrated Hakim ibn Hizam: The Messenger of Allah (ﷺ) sent with him a dinar to buy a sacrificial animal for him. He bought a sheep for a dinar, sold it for two and then returned and bought a sacrificial animal for a dinar for him and brought the (extra) dinar to the Prophet (ﷺ). The Prophet (ﷺ) gave it as alms (sadaqah) and invoked blessing on him in his trading",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3387,
			"arabicnumber": 3387,
			"text": "Narrated 'Abd Allah b. 'Umar: I heard the Messenger of Allah (ﷺ) say: If any of you can become like the man who had a faraq of rice, he should become like him. They (the people) asked: Who is the man who had a faraq of rice with him, Messenger of Allah ? Thereupon he narrated the story of the cave when a hillock fell on them (three persons), each of them said: Mention any best work of yours. The narrator said: The third of them said: O Allah, you know that I took a hireling for a faraq of rice. When the evening came, I presented to him his due (i.e. his wages). But he refused to take it and went away. I then cultivated it until I amassed cows and their herdsmen for him. He then met me and said: Give me my dues. I said (to him): Go to those cows and their herdsmen and take them all. He went and drove them away",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3388,
			"arabicnumber": 3388,
			"text": "Narrated Abdullah ibn Mas'ud: I Ammar, and Sa'd became partners in what we would receive on the day of Badr. Sa'd then brought two prisoners, but I and Ammar did not bring anything",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3389,
			"arabicnumber": 3389,
			"text": "Amr ibn Dinar said:I heard Ibn Umar say: We did not see any harm in sharecropping till I heard Rafi' ibn Khadij say: The Messenger of Allah (ﷺ) has forbidden it. So I mentioned it to Tawus. He said: Ibn Abbas told me that the Messenger of Allah (ﷺ) had not forbidden it, but said: It is better for one of you to lend to his brother than to take a prescribed sum from him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3390,
			"arabicnumber": 3390,
			"text": "Narrated 'Urwah b. al-Zubair: That Zayd ibn Thabit said: May Allah forgive Rafi' ibn Khadij. I swear by Allah, I have more knowledge of Hadith than him. Two persons of the Ansar (according to the version of Musaddad) came to him who were disputing with each other. The Messenger of Allah (ﷺ) said: If this is your position, then do not lease the agricultural land. The version of Musaddad has: So he (Rafi' ibn Khadij) heard his statement: Do not lease agricultural lands",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3391,
			"arabicnumber": 3391,
			"text": "Narrated Sa'd: We used to lease land for what grew by the streamlets and for what was watered from them. The Messenger of Allah (ﷺ) forbade us to do that, and commanded us to lease if for gold or silver",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3392,
			"arabicnumber": 3392,
			"text": "Narrated Hanzlah b. Qais al-Ansari: I asked Rafi' b. Khadij about the lease of land for gold and silver (i.e. for dinars and dirhams). There is no harm in it, for the people used to let out land in the time of the Messenger of Allah (ﷺ) for what grew by the current of water and at the banks of streamlets and at the places of cultivation. So sometimes this (portion) perished and that (portion) was saved, and sometimes this remained intact and that perished. There was no (form of) lease among the people except this. Therefore, he forbade it. But if there is something which is secure and known, then there is no harm in it. The tradition of Ibrahim is more perfect. Qutaibah said: \"from Hanzalah on the authority of Rafi' \". Abu Dawud said: A similar tradition has been transmitted by Yahya b. Sa'id from Hanzalah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3393,
			"arabicnumber": 3393,
			"text": "Hanzalah ibn Qays said that he asked Rafi' ibn Khadij about the lease of land. He replied:The Messenger of Allah (ﷺ) forbade the leasing of land. I asked: (Did he forbid) for gold and silver (i.e. dinars and dirhams)? He replied: If it is against gold and silver, then there is no harm in it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "Narrated Salim bin 'Abdullah b. 'Umar: Ibn 'Umar used to let out his land till it reached him that Rafi' b. Khadij al-Ansari narrated that the Messenger of Allah (ﷺ) forbade let out land. So 'Abd Allah (b. 'Umar) said: Ibn Khadij, what do you narrate from the Messenger of Allah (ﷺ) about leasing the land? Rafi' replied to 'Abd Allah b. 'Umar: I heard both of my uncles were present in the battle of Badr say, and they narrated it to the members of the family, that the Messenger of Allah (ﷺ) forbade leasing land. 'Abd Allah said: I swear by Allah, I knew that land was leased in the time of the Messenger of Allah (ﷺ). 'Abd Allah then feared that the Messenger of Allah (ﷺ) might have created something new in that matter, so he gave up leasing land. Abu Dawud said: This tradition has also been transmitted by Ayyub, 'Ubaid Allah, Kathir b. Farqad, Malik from Nafi' on the authority of Rafi' from the Prophet (ﷺ). It has also been transmitted by al-Auzai' from Hafs b. 'Inan al-Hanafi from Nafi' from Rafi' who said: I heard the Messenger of Allah (ﷺ) say: Similarly, it has been transmitted by Zaid b. Abi Unaisah from al-Hakkam from Nafi' from Ibn 'Umar that he went to Rafi' and asked: Have you heard the Messenger of Allah (ﷺ) say? He replied: Yes. Similarly, it has also been transmitted by 'Ikrimah b. 'Ammar from Abu al-Najashi, from Rafi' b. Khadij who said: I heard the Prophet (ﷺ) say. It has also been transmitted by al-Auza'i from Abu al-Najashi from Rafi' b. Khadij from his uncle Zuhair b. Rafi' from the Prophet (ﷺ). Abu Dawud said: The name of Abu al-Najashi is 'Ata b. Suhaib",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3395,
			"arabicnumber": 3395,
			"text": "Narrated Rafi' b. Khadij:We used to employ people to till land for a share of it produce. He then maintained that, one of his uncles came to him and said: The Messenger of Allah (ﷺ) forbade us from a work which beneficial to us. But obedience to Allah and His Apostle (ﷺ) is more beneficial to us. We asked : What is that ? He said: The Messenger of Allah (ﷺ) said: If anyone has land, he should cultivate it, or lend it to his brother for cultivation. He should not rent it for a third or a quarter (of the produce) or for specified among of produce",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3396,
			"arabicnumber": 3396,
			"text": "Ayyub said:Ya'la b. Hakim wrote to me: I heard Sulaiman b. Yasar narrating the tradition to the same effect as narrated by 'Ubaid Allah and through the same chain",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3397,
			"arabicnumber": 3397,
			"text": "Narrated Rafi' ibn Khadij: AbuRafi' came to us from the Messenger of Allah (ﷺ) said: The Messenger of Allah (ﷺ) forbade us from a work which benefited us; but obedience to Allah and His Apostle (ﷺ) is more beneficial to us. He forbade that one of us cultivates land except the one which he owns or the land which a man lends him (to cultivate)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3398,
			"arabicnumber": 3398,
			"text": "Narrated Usaid b. Zuhair: Rafi' b. Khadij came to us and said: The Messenger of Allah (ﷺ) forbids you from a work which is beneficial to you ; and obedience to Allah and His Prophet (ﷺ) is more beneficial to you. The Messenger of Allah (ﷺ) forbids you from renting land for share of its produce and he said: If anyone if not in need of his land he should lend it to his brother or leave it. Abu Dawud said: Shu'bah and Mufaddal b. Muhalhal have narrated it from Mansur in similar way. Shu'bah said (in his version): Usaid, nephew of Rafi' b, Khadij",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3399,
			"arabicnumber": 3399,
			"text": "AbuJa'far al-Khatmi said:My uncle sent me and his slave to Sa'id ibn al-Musayyab. We said to him, there is something which has reached us about sharecropping. He replied: Ibn Umar did not see any harm in it until a tradition reached him from Rafi' ibn Khadij. He then came to him and Rafi' told him that the Messenger of Allah (ﷺ) came to Banu Harithah and saw crop in the land of Zuhayr. He said: What an excellent crop of Zuhayr is! They said: It does not belong to Zuhayr. He asked: Is this not the land of Zuhayr? They said: Yes, but the crop belongs to so-and-so. He said: Take your crop and give him the wages. Rafi' said: We took our crop and gave him the wages. Sa'id (ibn al-Musayyab) said: Lend your brother or employ him for dirhams",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3400,
			"arabicnumber": 3400,
			"text": "Narrated Rafi' ibn Khadij: The Messenger of Allah (ﷺ) forbade muhaqalah and muzabanah. Those who cultivate land are three: a man who has (his own) land and he tills it: a man who has been lent land and he tills the one lent to him; a man who employs another man to till land against gold (dinars) or silver (dirhams)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3401,
			"arabicnumber": 3401,
			"text": "Abu Dawud said:I read out (this tradition) to Sa'id b. Ya'qub al-Taliqini, and I said to him: Ibn al-Mubarak transmitted (this tradition) to you from Sa'id Abi Shuja' who said: 'Uthman b. Sahl b. Rafi' b. Khadij narrated it to me saying: I was an orphan being nourished under the guardianship of Rafi' b. Khadij and I performed Hajj with him. My brother 'Imran b. Sahl then came to me and said: We rented out land to so-and-so for two hundred dirhams. He said: Leave it, for the Prophet (ﷺ) forbade renting land",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3402,
			"arabicnumber": 3402,
			"text": "Narrated Rafi' ibn Khadij: Rafi' had cultivated a land. The Prophet (ﷺ) passed him when he was watering it. So he asked him: To whom does the crop belong, and to whom does the land belong? He replied: The crop is mine for my seed and labour. The half (of the crop) is mine and the half for so-and-so. He said: You conducted usurious transaction. Return the land to its owner and take your wages and cost",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3403,
			"arabicnumber": 3403,
			"text": "Narrated Rafi' ibn Khadij: The Prophet (ﷺ) said: If anyone sows in other people's land without their permission, he has no right to any of the crop, but he may have what it cost him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3404,
			"arabicnumber": 3404,
			"text": "Narrated Jabir b. 'Abd Allah :The Messenger of Allah (ﷺ) forbade muhaqalah, muzabanah, mukhabarah, and mu'awanah. One of the two narrators from Hammad said the word mu'awamah, and other said: \"selling many years ahead\". The agreed version then goes: and thunya, but gave license for 'araya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3405,
			"arabicnumber": 3405,
			"text": "Narrated Jabir b. 'Abd Allah :The Messenger of Allah (ﷺ) forbade muzabanah, muhaqalah and thunya except it is known",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3406,
			"arabicnumber": 3406,
			"text": "Narrated Jabir b. 'Abd Allah :I heard the Messenger of Allah (ﷺ) say: If any of you does not leave mukhabarah, he should take notice of war from Allah and His Apostle (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3407,
			"arabicnumber": 3407,
			"text": "Narrated Zaid b. Thabit:The Messenger of Allah (ﷺ) forbade mukhabarah. I asked: What is mukhabarah ? He replied: That you have the land (for cultivation) for half, a third, or a quarter (of the produce)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3408,
			"arabicnumber": 3408,
			"text": "Narrated Ibn 'Umar:The Messenger of Allah (ﷺ) made an agreement with the people of Khaibar to work and cultivate in return for half of the fruits or produce",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3409,
			"arabicnumber": 3409,
			"text": "Narrated Ibn 'Umar:The Prophet (ﷺ) handed over the Jews of Khaibar the palm trees and the land of Khaibar on condition that they should employ what belonged to them in working on them, and that he should have half of the fruits",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3410,
			"arabicnumber": 3410,
			"text": "Narrated Ibn 'Abbas:The Messenger of Allah (ﷺ) conquered Khaibar, and stipulated that all the land, gold and silver would belong to him. The people of Khaibar said: we know the land more than you ; so give it to us on condition that you should have half of the produce and we would have the half. He then gave it to them on that condition. When the time of picking the fruits of the palm-trees came, he sent 'Abd Allah b. Rawahah to them, and he assessed the among of the fruits of the palm-trees. This is what the people of Medina call khars (assessment). He used to say: In these palm-trees there is such-and-such amount (of produce). They would say: You assessed more to us, Ibn Rawahah (than the real amount). He would say: I first take the responsibility of assessing the fruits of the palm-trees and give you half of (the amount) I said. They would say: This is true, and on this (equity) stand the heavens and the earth. We agreed that we should take (the amount which) you said",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3411,
			"arabicnumber": 3411,
			"text": "The tradition mentioned above has also been narrated by Ja'far b. Burqan through his chain and to the same effect. This version has:He said: He assessed, and after the words of kull safara' wa baida', he said: that is, gold and silver will belong to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3412,
			"arabicnumber": 3412,
			"text": "Narrated Miqsam:When the Prophet (ﷺ) conquered Khaibar. He then narrated it like the tradition of Zaid (b. Abu al-Zarqa'). This version has: He then assessed the produce of the palm-trees and said: I take the job of picking the fruit myself, and I shall give you half of (the amount) I said",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3413,
			"arabicnumber": 3413,
			"text": "Narrated Aisha, Ummul Mu'minin: The Prophet (ﷺ) used to send Abdullah ibn Rawahah (to Khaybar), and he would assess the amount of dates when they began to ripen before they were eaten (by the Jews). He would then give choice to the Jews that they have them (on their possession) by that assessment or could assign to them (Muslims) by that assignment, so that the (amount of) zakat could be calculated before the fruit became eatable and distributed (among the people)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3414,
			"arabicnumber": 3414,
			"text": "Narrated Jabir ibn Abdullah: When Allah bestowed Khaybar on His Prophet (ﷺ) as fay' (as a result of conquest without fighting), the Messenger of Allah (ﷺ) allowed (them) to remain there as they were before, and apportioned it between him and them. He then sent Abdullah ibn Rawahah who assessed (the amount of dates) upon them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3415,
			"arabicnumber": 3415,
			"text": "Narrated Jabir ibn Abdullah: Ibn Rawahah assessed them (the amount of dates) at forty thousand wasqs, and when Ibn Rawahah gave them option, the Jews took the fruits in their possession and twenty thousand wasqs of dates were due from them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 90
			}
		}
	]
}