{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"25": "The Office of the Judge (Kitab Al-Aqdiyah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3571,
			"arabicnumber": 3571,
			"text": "Narrated Abu Hurayrah: The Prophet (ﷺ) said: He who has been appointed a judge has been killed without a knife",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3572,
			"arabicnumber": 3572,
			"text": "Narrated Abu Hurayrah: The Prophet (ﷺ) said: He who has been appointed a judge among the people has been killed without a knife",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3573,
			"arabicnumber": 3573,
			"text": "Narrated Buraydah ibn al-Hasib: The Prophet (ﷺ) said: Judges are of three types, one of whom will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgment accordingly; but a man who knows what is right and acts tyrannically in his judgment will go to Hell; and a man who gives judgment for people when he is ignorant will go to Hell. Abu Dawud said: On this subject this is the soundest tradition, that is, the tradition of Ibn Buraidah: Judges are of three types",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3574,
			"arabicnumber": 3574,
			"text": "It was narrated that `Amr bin Al-`As said \"The Messenger of Allah said:'If a judge passes a judgment having exerted himself to arrive at what is correct, and he is indeed correct, he will have two rewards. If he passes judgment having exerted himself to arrive at what is correct, but it is incorrect, he will have one reward.'\" I narrated it to Abu Bakr bin Hazm and he said: \"This is what Abu Salamah narrated to me from Abu Hurairah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3575,
			"arabicnumber": 3575,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: If anyone seeks the office of judge among Muslims till he gets it and his justice prevails over his tyranny, he will go to Paradise; but the man whose tyranny prevails over his justice will go to Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3576,
			"arabicnumber": 3576,
			"text": "Ibn 'Abbas said:\"If any do fail to judge (by the light of) what Allah has revealed, they are (no better than) unbelievers\" up to \"wrongdoers.\" These three verses were revealed about the Jews, particularly about Quraizah and al-Nadir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3577,
			"arabicnumber": 3577,
			"text": "AbdurRahman ibn Bishr al-Ansari al-Azraq said:Two men from the locality of Kindah came while AbuMas'ud al-Ansari was sitting n a circle. They said: Is there any man who decides between us. A man from the circle said: I, AbuMas'ud took a handful of pebbles and threw at him, saying: Hush! It is disapproved to make haste in decision",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3578,
			"arabicnumber": 3578,
			"text": "Narrated Anas ibn Malik: The Prophet (ﷺ) said: If anyone desires the office of Judge and seeks help for it, he will be left to his own devices; if anyone does not desire it, nor does he seek help for it, Allah will send down an angel who will direct him aright. Waki' said: (This tradition has also been transmitted) by Isra'il, from 'Abd al-A'la, from Bilal bin Abi Musa, from Anas, from the Prophet (ﷺ). Abu 'Awanah said: from 'Abd al-A'la, from Bilal bin Mirdas al-Fazari, from Khaithamah al-Basri from Anas",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3579,
			"arabicnumber": 3579,
			"text": "Abu Buradah reported the Prophet (ﷺ) as saying:\"We will never employ or we shall not employ (the narrator is doubtful) in our work one who wants it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3580,
			"arabicnumber": 3580,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes bribe",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3581,
			"arabicnumber": 3581,
			"text": "Narrated Adi ibn Umayrah al-Kindi: The Prophet (ﷺ) said: O people, if any of you is put in an administrative post on our behalf and conceals from us a needle or more, he is acting unfaithfully, and will bring it on the Day of Resurrection. A black man from the Ansar, as if I am seeing him, stood and said: Messenger of Allah, take back from me my post. He asked: What is that? He replied: I heard you say such and such. He said: And I say that. If we appoint anyone to an office, he must bring what is connected with it, both little and much. What he is given, he may take, and he must refrain from what is kept away from him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3582,
			"arabicnumber": 3582,
			"text": "Narrated Ali ibn AbuTalib: The Messenger of Allah (ﷺ) sent me to the Yemen as judge, and I asked: Messenger of Allah, are you sending me when I am young and have no knowledge of the duties of a judge? He replied: Allah will guide your heart and keep your tongue true. When two litigants sit in front of you, do not decide till you hear what the other has to say as you heard what the first had to say; for it is best that you should have a clear idea of the best decision. He said: I had been a judge (for long); or he said (the narrator is doubtful): I have no doubts about a decision afterwards",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3583,
			"arabicnumber": 3583,
			"text": "Umm Salamah reported the Messenger of Allah (ﷺ) as saying:\"I am only a human being, and you bring your disputes to me, some perhaps being more eloquent in their plea than others, so that I give judgement on their behalf according to what I hear from them. Therefore, whatever I decide for anyone which by right belongs to his brother, he must not take anything, for I am granting him only a portion of Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3584,
			"arabicnumber": 3584,
			"text": "Umm Salamah said:Two men came to the Messenger of Allah (ﷺ) who were disputing over their inheritance. They had no evidence except their claim. The Prophet (ﷺ) then said in a similar way. Thereupon both the men wept and each of them said: This right of mine go to you. The Prophet (ﷺ) then said: Now you have done whatever you have done ; do divide it up, aiming at what is right, then drew lots, and let each of you consider the other to have what is legitimately his",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3585,
			"arabicnumber": 3585,
			"text": "Umm Salamah reported the Prophet (ﷺ) as saying when two men were disputing over inheritance and old things:I decide between you on the basis of my opinion in cases about which no revelation has been sent down to me",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3586,
			"arabicnumber": 3586,
			"text": "Narrated Umar ibn al-Khattab: Umar said while he was (sitting) on the pulpit: O people, the opinion from the Messenger of Allah (ﷺ) was right, because Allah showed (i.e. inspired) him; but from us it is sheer conjecture and artifice",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3587,
			"arabicnumber": 3587,
			"text": "Mu'adh bin Mu'adh said:Abu 'Uthman al-Shami, whose name is Hariz bin 'Uthman, told me. I think I did not see anyone from Syria better than him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3588,
			"arabicnumber": 3588,
			"text": "Narrated Abdullah ibn az-Zubayr: The Messenger of Allah (ﷺ) gave the decision that the two adversaries should be made to sit in front of the judge",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3589,
			"arabicnumber": 3589,
			"text": "Abd al-Rahman bin Abi Bakrah reported on the authority of his father that he wrote to his son:The Messenger of Allah (ﷺ) said: A judge should not decide between the two while he is in anger",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3590,
			"arabicnumber": 3590,
			"text": "Ibn 'Abbas said:The Qur'anic verse: \"If they do come to thee, either judge between them, or decline to interfere\" was abrogated by the verse: \"So judge between them by what Allah hath revealed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3591,
			"arabicnumber": 3591,
			"text": "Narrated Abdullah ibn Abbas: When this verse was revealed: \"If they do come to thee, either judge between them, or decline to interfere....If thou judge, judge in equity between them.\" Banu an-Nadir used to pay half blood-money if they killed any-one from Banu Qurayzah. When Banu Qurayzah killed anyone from Banu an-Nadir, they would pay full blood-money. So the Messenger of Allah (ﷺ) made it equal between them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3592,
			"arabicnumber": 3592,
			"text": "Some companions of Mu'adh ibn Jabal said:When the Messenger of Allah (ﷺ) intended to send Mu'adh ibn Jabal to the Yemen, he asked: How will you judge when the occasion of deciding a case arises? He replied: I shall judge in accordance with Allah's Book. He asked: (What will you do) if you do not find any guidance in Allah's Book? He replied: (I shall act) in accordance with the Sunnah of the Messenger of Allah (ﷺ). He asked: (What will you do) if you do not find any guidance in the Sunnah of the Messenger of Allah (ﷺ) and in Allah's Book? He replied: I shall do my best to form an opinion and I shall spare no effort. The Messenger of Allah (ﷺ) then patted him on the breast and said: Praise be to Allah Who has helped the messenger of the Messenger of Allah to find something which pleases the Messenger of Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3593,
			"arabicnumber": 3593,
			"text": "Mu'adh bin Jabal said that when the Messenger of Allah (ﷺ) sent him to the Yemen... He then narrated the rest of the tradition to the same effect",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3594,
			"arabicnumber": 3594,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: Conciliation between Muslims is permissible. The narrator Ahmad added in his version: \"except the conciliation which makes lawful unlawful and unlawful lawful.\" Sulayman ibn Dawud added: The Messenger of Allah (ﷺ) said: Muslims are on (i.e. stick to) their conditions",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3595,
			"arabicnumber": 3595,
			"text": "Ka'b bin Malik said that in the time of the Messenger of Allah (ﷺ) he made demand in the mosque for payment of a debt due to him from Ibn Abi Hadrad, and their voices rose till the Messenger of Allah (ﷺ), who was in his house, heard them. The Messenger of Allah (ﷺ) then went out to them and, removing the curtain of his apartment, he called to Ka'b bin Malik, addressing:\"Ka'b!\" He said: \"At your service, Messenger of Allah.\" Thereupon he made a gesture with is hand indicating: Remit half the debt due to you. Ka'b said: \"I shall do so, Messenger of Allah.\" The Prophet (ﷺ) then said: \"Get up and discharge",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3596,
			"arabicnumber": 3596,
			"text": "Zaid bin Khalid al-Juhani reported the Messenger of Allah (ﷺ) as saying:\"Shall I not tell you of the best witnesses ? He is the one who produces his deposition or gives his evidence (the narrator is doubtful) before he is asked for it.\" 'Abd Allah bin Abi Bakr dobted which of them he said. Abu Dawud said: Malis said: This refers to a man gives his evidence, but he does not know for whom it is meant. Al-Hamdani said: \"He should inform the authorities. Ibn al-Sarh said: \"He should give it to the ruler. The work ikhbar (inform) occurs in the version of al-Hamdani.\" Ibn al-Sarh said: \"Ibn Abi 'Amrah and not 'Abd al-Rahman",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3597,
			"arabicnumber": 3597,
			"text": "Yahya ibn Rashid said:We were sitting waiting for Abdullah ibn Umar who came out to us and sat. He then said: I heard the Messenger of Allah (ﷺ) as saying: If anyone's intercession intervenes as an obstacle to one of the punishments prescribed by Allah, he has opposed Allah; if anyone disputes knowingly about something which is false, he remains in the displeasure of Allah till he desists, and if anyone makes an untruthful accusation against a Muslim, he will be made by Allah to dwell in the corrupt fluid flowing from the inhabitants of Hell till he retracts his statement",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3598,
			"arabicnumber": 3598,
			"text": "The tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) through different chain of narrators to the same effect. In this version he also said:\"He who assits in a dispute unjustly deserves the anger of Allah, Most High",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3599,
			"arabicnumber": 3599,
			"text": "Narrated Khuraym Ibn Fatik: The Messenger of Allah (ﷺ) offered the morning prayer. When he finished it, he stood up and said three times: False witness has been made equivalent to attributing a partner to Allah. He then recited: \"So avoid the abomination of idols and avoid speaking falsehood as people pure of faith to Allah, not associating anything with Him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3600,
			"arabicnumber": 3600,
			"text": "Amr bin Shu'aib on his father's authority told that his grandfather said:The Messenger of Allah (ﷺ) rejected the testimony of a deceitful man and woman, of one who harbours rancour against his brother, and he rejected the testimony of one who is dependent on a family, and he allowed his testimony for other. Abu Dawud said: Ghimr means malice and enimity ; qani (dependant), a subordinate servant like a special servant",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3601,
			"arabicnumber": 3601,
			"text": "The tradition mentioned above (No. 3593) has also been transmitted by Sulayman ibn Musa through a different chain of narrators. This version has:The Messenger of Allah (ﷺ) said: The testimony of a deceitful man or woman, of an adulterer and adulteress, and of one who harbours rancour against his brother is not allowable",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3602,
			"arabicnumber": 3602,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: The testimony of a nomad Arab against a townsman is not allowable",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3603,
			"arabicnumber": 3603,
			"text": "Uqbah bin al-Harith said:\"I married Umm Yahya daughter of Abu Ihab. A black woman entered upon us. She said that she had suckled both of us. So I came to the Prophet (ﷺ), and amentioned it to him. He turned away from me. I said (to him): Messenger of Allah! she is a liar. He said: What do you know? She has said what she has said. Separate yourself from her (wife)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3604,
			"arabicnumber": 3604,
			"text": "The tradition mentioned above has also been transmitted by 'Uqbah bin al-Harith to the same effect through a different chain of narrators. Abu Dawud said:Hammad bin Zaid looked at al-Harith bin 'Umair and said: He is from reliable narrators from Ayyub",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3605,
			"arabicnumber": 3605,
			"text": "Ash-Sha'bi said:A Muslim was about to die at Daquqa', but he did not find any Muslim to call him for witness to his will. So he called two men of the people of the Book for witness. Then they came to Kufah, and approaching AbuMusa al-Ash'ari they informed him (about his) will. They brought his inheritance and will. Al-Ash'ari said: This is an incident (like) which happened in the time of the Messenger of Allah (ﷺ) and never occurred after him. So he made them to swear by Allah after the afternoon prayer to the effect that they had not misappropriated, nor told a lie, nor changed, nor concealed, nor altered, and that it was the will of the man and his inheritance. He then executed their witness",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3606,
			"arabicnumber": 3606,
			"text": "Narrated Abdullah Ibn Abbas: A man from Banu Sahm went out with Tamim ad-Dari and Adi ibn Badda'. The man of Banu Sahm died in the land where no Muslim was present. When they returned with his inheritance, they (the heirs) did not find a silver cup with lines of gold (in his property). The Messenger of Allah (ﷺ) administered on oath to them. The cup was then found (with someone) at Mecca. They said: We have bought it from Tamim and Adi. Then two men from the heirs of the man of Banu Sahm got up and swore saying: Our witness is more reliable than their witness. They said that the cup belonged to their man. He (Ibn Abbas) said: The following verse was revealed about them: \"O ye who believe! when death approaches any of you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3607,
			"arabicnumber": 3607,
			"text": "Narrated Uncle of Umarah ibn Khuzaymah: The Prophet (ﷺ) bought a horse from a Bedouin. The Prophet (ﷺ) took him with him to pay him the price of his horse. The Messenger of Allah (ﷺ) walked quickly and the Bedouin walked slowly. The people stopped the Bedouin and began to bargain with him for the horse as and they did not know that the Prophet (ﷺ) had bought it. The Bedouin called the Messenger of Allah (ﷺ) saying: If you want this horse, (then buy it), otherwise I shall sell it. The Prophet (ﷺ) stopped when he heard the call of the Bedouin, and said: Have I not bought it from you? The Bedouin said: I swear by Allah, I have not sold it to you. The Prophet (ﷺ) said: Yes, I have bought it from you. The Bedouin began to say: Bring a witness. Khuzaymah ibn Thabit then said: I bear witness that you have bought it. The Prophet (ﷺ) turned to Khuzaymah and said: On what (grounds) do you bear witness? He said: By considering you trustworthy, Messenger of Allah (ﷺ)! The Prophet (ﷺ) made the witness of Khuzaymah equivalent to the witness of two people",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3608,
			"arabicnumber": 3608,
			"text": "Ibn 'Abbas said:The Messenger of Allah (ﷺ) gave a decision on the basis of an oath and a single witness",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3609,
			"arabicnumber": 3609,
			"text": "The tradition mentioned above has also been transmitted by 'Amr bin Dinar through a different chain of narrators and to the same effect. Salamah has in his version:'Amr said: In the rights (of the people)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3610,
			"arabicnumber": 3610,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) gave a decision on the basis of an oath and a single witness. Abu Dawud said: Al-Rabi' bin Sulaiman al-Mu'adhdhin told me some additional words in this tradition: Al-Shafi'i told me from 'Abd al-'Aziz. I then mentioned it fo Suhail who said: Rabi'ah told me - and he is reliable in my opinion - that I told him this (tradition) and I do not remember it. 'Abd al-'Aziz said: Suhail suffered from some disease which caused him to lose a little of his intelligence, and he forgot some of his traditions. Thereafter Suhail would narrate traditions from Rabi'ah on the authority of his father",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3611,
			"arabicnumber": 3611,
			"text": "The tradition mentioned above has also been transmitted by Rabi'ah through the chain of Abu Mus'ab and to the same effect. Sulaiman said:I then met Suhail and asked him about this tradition. He said: I do not know it. I said to him: Rabi'ah transmitted it to me from you. He said: If Rabi'ah transmitted it to you from me, then retransmit it from Rabi'ah on my authority",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3612,
			"arabicnumber": 3612,
			"text": "Narrated Zubayb ibn Tha'labah al-Anbari: The Messenger of Allah (ﷺ) sent an army to Banu al-Anbar. They captured them at Rukbah in the suburbs of at-Ta'if and drove them to the Holy Prophet (ﷺ). I rode hurriedly to the Holy Prophet (ﷺ) and said: Peace be on you, Messenger of Allah, and the mercy of Allah and His blessings. Your contingent came to us and arrested us, but we had already embraced Islam and cut the sides of the ears of our cattle. When Banu al-Anbar arrived, the Holy Prophet (ﷺ) said to me: Have you any evidence that you had embraced Islam before you were captured today? I said: Yes. He said: Who is your witness? I said: Samurah, a man from Banu al-Anbar, and another man whom he named. The man testified but Samurah refused to testify. The Holy Prophet (ﷺ) said: He (Samurah) has refused to testify for you, so take an oath with your other witness. I said: Yes. He then dictated an oath to me and I swore to the effect that we had embraced Islam on a certain day, and that we had cut the sides of the ears of the cattle. The Holy Prophet (ﷺ) said: Go and divide half of their property, but do not touch their children. Had Allah not disliked the wastage of action, we should not have taxed you even a rope. Zubayb said: My mother called me and said: This man has taken my mattress. I then went to the Holy Prophet (ﷺ) and informed him. He said to me: Detain him. So I caught him with a garment around his neck, and stood there with him . Then the Holy Prophet (ﷺ) looked at us standing there. He asked: What do you intend (doing) with your captive? I said: I shall let him go free if he returns to this (man) the mattress of his mother which he has taken from her. He said: Prophet of Allah (ﷺ), I no longer have it. He said: The Holy Prophet (ﷺ) took the sword of the man and gave it to me, and said to him: Go and give him some sa's of cereal. So he gave me some sa's of barley",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3613,
			"arabicnumber": 3613,
			"text": "Narrated AbuMusa al-Ash'ari: Two men claimed a camel or an animal and brought the case to the Holy Prophet (ﷺ). But as neither of them produced any proof, the Holy Prophet (ﷺ) declared that they should share it equally",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3614,
			"arabicnumber": 3614,
			"text": "The tradition mentioned above has also been transmitted by Sa'id through a different chain of narrators to the same effect",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3615,
			"arabicnumber": 3615,
			"text": "The tradition mentioned above has also been transmitted by Qatadah through a different chain of narrators to the effect that two men laid claim camel and both of them produced witness so the prophet (peace be upon him) divided it in halves between them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3616,
			"arabicnumber": 3616,
			"text": "Narrated AbuHurayrah: Two men disputed about some property and brought the case to the Holy Prophet (ﷺ), but neither of them could produce any proof. So the Holy Prophet (ﷺ) said: Cast lots about the oath whatever it may be, whether they like it or dislike it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3617,
			"arabicnumber": 3617,
			"text": "Abu hurairah reported the holy prophet (peace be upon him) as saying:When two men dislike the oath or like it,lots will be cost about it. Salamah said on the authority of Ma’mar who said: when the two are compelled to take an oath",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3618,
			"arabicnumber": 3618,
			"text": "The tradition mentioned above has also been transmitted by sa’id b. ‘Urubah through the chain as narrated by Ibn Minhal. This version has :About an animal and they had no proof. So the Messenger of Allah (ﷺ) ordered to cast lots about the oath",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3619,
			"arabicnumber": 3619,
			"text": "Ibn Abi Mulaikah said:Ibn ‘Abbas wrote to me that the Messenger of Allah (ﷺ)had defendant should take an oath",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3620,
			"arabicnumber": 3620,
			"text": "Narrated Abdullah ibn Abbas: The Holy Prophet (ﷺ) said to a man whom he asked to take an oath: Swear by Allah except whom there is no god that you have nothing belonging to him, i.e. the plaintiff",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3621,
			"arabicnumber": 3621,
			"text": "Al-Ash’ath b. Qais said:A Jew and I shared some land and he denied my right, so I took him to the holy prophet (ﷺ). The holy prophet (ﷺ) said to me: Have you have proof. I said: No. He then said to the Jew: Swear an oath I said Messenger of Allah,he will swear an oath and go off my property. So Allah sent down: “Those who barter for a small price Allah’s covenant and their oaths....\" to the end of the verse",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3622,
			"arabicnumber": 3622,
			"text": "Al-Ash’ath b. Qais said:A men from Kindah and a men from Hadramawt came to the Holy Prophet(ﷺ)with their dispute about a land in the Yemen. The Hadrami said: Messenger of Allah, the this (man)had usurped land belonging to me, and it is his possession. He asked: Have you any proof ?He replied:No, but I can have him swear on oath. Allah knows that it is my land, and father seized it from me. The Kindi was prepared to take oath. He then narrated the rest of the tradition",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3623,
			"arabicnumber": 3623,
			"text": "‘Alqamah b. Wa’il b. Hujr al-Hadrami said on the authority of the father:A man from Hadramaw and a man from kindah came to the Messenger of Allah (ﷺ). The hadrami said: Messenger of Allah, this (man) has seized land which belonged to my father. Al-Kindi said: That is my land in my possession and I cultivate it; he has no right to it. The Holy prophet (may be peace upon him) said to the Hadrami: Have you any proof? We said : No. he (the Prophet)said: Then he will swear an oath for you . He said: Messenger of Allah, he is a reprobate and he would not care to swear to anything and stick at nothing. He said: That is only your recourse",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3624,
			"arabicnumber": 3624,
			"text": "Abu Hurairah said:The holy Prophet (ﷺ) said to the Jew : I adjure you by Allah Who sent down the Torah to Moses ! do you not find in the Torah(a rule about a man) who commits adultery. He then narrated the rest of the tradition relating to the stoning",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3625,
			"arabicnumber": 3625,
			"text": "The tradition mentioned above has also been transmitted by al-Zuhri through a different chain of narrator. This version has:A man from Muzainah who followed the knowledge and memorized it to me that sa’id b.al-Musayyab transmitted it. He then mentioned the rest of the tradition to the same effect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3626,
			"arabicnumber": 3626,
			"text": "Narrated Ikrimah: The Holy Prophet (ﷺ) said to Ibn Suriya': I remind you by Allah Who saved you from the people of Pharaoh, made you cover the sea, gave you the shade of clouds, sent down to you manna and quails, sent down you Torah to Moses, do you find stoning (for adultery) in your Book? He said: You have reminded me by the Great. It is not possible for me to belie you. He then transmitted the rest of the tradition",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3627,
			"arabicnumber": 3627,
			"text": "Narrated Awf ibn Malik: The Holy Prophet (ﷺ) gave a decision between two men, and the one against whom the decision was given turned away and said: For me Allah sufficeth, and He is the best dispenser of affairs. The Holy Prophet (ﷺ) said: Allah, Most High, blames for falling short, but apply intelligence, and when the matter gets the better of you, say; For me Allah sufficeth, and He is the best disposer of affairs",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3628,
			"arabicnumber": 3628,
			"text": "Narrated Ash-Sharid: The Prophet (ﷺ) said: Delay in payment on the part of one who possesses means makes it lawful to dishonour and punish him. Ibn al-Mubarak said that \"dishonour\" means that he may be spoken to roughly and \"punish\" means he may be imprisoned for it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3629,
			"arabicnumber": 3629,
			"text": "Narrated Grandfather of Hirmas ibn Habib: I brought my debtor to the Holy Prophet (ﷺ). He said to me: Stick to him. He again said to me: O brother of Banu Tamim, what do you want to do with your prisoner",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3630,
			"arabicnumber": 3630,
			"text": "Bahz bin Hakim, on his father's authority, said that his grandfather told that the Prophet (ﷺ) imprisoned a man on suspicion",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3631,
			"arabicnumber": 3631,
			"text": "Bahz ibn Hakim reported from his grandfather:(Ibn Qudamah's version has: His grandfather's brother or uncle reported:) - the narrator Mu'ammal said: - He (his grandfather Mu'awiyah) got up before the Holy Prophet (ﷺ) who was giving sermon: and he said: Why have your companions arrested my neighbours? He turned away from him twice. He (his grandfather Mu'awiyah) then mentioned something. The Holy Prophet (ﷺ) then said: Let his neighbours go. (Mu'ammal did not mention the words \"He was giving sermon)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3632,
			"arabicnumber": 3632,
			"text": "Narrated Jabir ibn Abdullah: I intended to go (on expedition) to Khaybar. So I came to the Holy Prophet (ﷺ), greeted him and said: I am intending to go to Khaybar. He said: When you come to my agent, you should take from him fifteen wasqs (of dates). If he asks you for a sign, then place your hand on his collar-bone",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3633,
			"arabicnumber": 3633,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: If you dispute over a pathway, leave the margin of seven yards",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3634,
			"arabicnumber": 3634,
			"text": "Abu Hurairah reported the Holy Prophet(ﷺ) as saying:When one of you asks permission for inserting a wooden peg in his wall, he should not prevent him. So they (the people) lowered down their heads. Then he (Abu Hurairah) said: What is the matter ? I am seeing you are neglecting (to hear this tradition), I shall spread it among you. Abu Dawud said:This is the tradition of Ibn Abi Khalaf is more perfect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3635,
			"arabicnumber": 3635,
			"text": "Narrated AbuSirmah: The Prophet (ﷺ) said: If anyone harms (others), Allah will harm him, and if anyone shows hostility to others, Allah will show hostility to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3636,
			"arabicnumber": 3636,
			"text": "Abu Ja'far Muhammad bin 'Ali reported from Samurah ibn Jundub that he had a row of palm-trees in the garden of a man of the Ansar. The man had his family with him. Samurah used to visit his palm-trees, and the man was annoyed by that and felt it keenly. So he asked him (Samurah) to sell them to him, but he refused. He then asked him to take something else in exchange, but he refused. So he came to the Holy Prophet (ﷺ) and mentioned it to him. The Holy Prophet (ﷺ) asked him to sell it to him, but he refused. He asked him to take something else in exchange, but he refused. He then said:Give it to him and you can have such and such, mentioning something with which he tried to please him, but he refused. He then said: You are a nuisance. The Messenger of Allah (ﷺ) then said to the Ansari: Go and uproot his palm-trees",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3637,
			"arabicnumber": 3637,
			"text": "Narrated Abdullah ibn az-Zubayr: A man disputed with az-Zubayr about streamlets in the lava plain which was irrigated by them. The Ansari said: Release the water and let it run, but az-Zubayr refused. The Holy Prophet (ﷺ) said to az-Zubayr: Water (your ground), Zubayr, then let the water run to your neighbour. The Ansari then became angry and said: Messenger of Allah! it is because he is your cousin! Thereupon the face of the Messenger of Allah (ﷺ) changed colour and he said: Water (your ground), then keep back the water till it returns to the embankment. Az-Zubayr said: By Allah! I think this verse came down about that: \"But no , by thy Lord! they can have no (real) faith, until they make thee judge",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3638,
			"arabicnumber": 3638,
			"text": "Narrated Tha'labah ibn AbuMalik: Tha'labah heard his elders say that a man from the Quraysh had his share with Banu Qurayzah (in water). He brought the dispute to the Messenger of Allah (ﷺ) about al-Mahzur, a stream whose water they shared together. The Messenger of Allah (ﷺ) then decided that when water reached the ankles waters should not be held back to flow to the lower",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3639,
			"arabicnumber": 3639,
			"text": "Amr bin Shu'aib on his father's authority said that his grandfather told that the Messenger of Allah (ﷺ) decided regarding the stream al-Mahzur that its water should be held back till it reached the ankles, and that the upper waters should then be allowed to flow to the lower",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3640,
			"arabicnumber": 3640,
			"text": "Narrated AbuSa'id al-Khudri: Two men brought their dispute about the precincts of a palm-tree to the Messenger of Allah (ﷺ). According to a version of this tradition, he ordered to measure and it was measured. It was found seven yards. According to another version, it was found five yards. He made a decision according to that. AbdulAziz said: He ordered to measure with a branch of its branches. It was then measured",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 70
			}
		}
	]
}