{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4596,
			"arabicnumber": 4596,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: The Jews were split up into seventy-one or seventy-two sects; and the Christians were split up into seventy one or seventy-two sects; and my community will be split up into seventy-three sects",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4597,
			"arabicnumber": 4597,
			"text": "Abu `Amir al-Hawdhani said:Mu`awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of Allah (ﷺ) stood among us and said: Beware! The people of the Book before were split up into seventy two sects, and this community will be split into seventy three: seventy two of them will go to Hell and one of them will go to Paradise, and it is the majority group. Ibn Yahya and `Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, `Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4598,
			"arabicnumber": 4598,
			"text": "‘A’ishah said:The Messenger of Allah (ﷺ) recited this verse: “He it is who has sent down to thee the Book: in it are verses basic or fundamental . . . .” Up to “men of understanding”. She said: The Messenger of Allah (ﷺ) then said: When you see those people who follow that which is allegorical in the Quran, those are the people whom Allah has named (in the Quran). So avoid them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4599,
			"arabicnumber": 4599,
			"text": "Narrated AbuDharr: The Prophet (ﷺ) said: The best of the actions is to love for the sake of Allah and to hate for the sake of Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4600,
			"arabicnumber": 4600,
			"text": "‘Abd Allah b. Ka`b b. Malik who used to lead his father from among his sons when he became blind, said:I heard Ka`b b. Malik - the transmitter Ibn al-Sarh then narrated the story of his remaining behind from the Prophet (ﷺ) during the campaign of Tabuk - say: The Messenger of Allah (ﷺ) forbade the Muslims to speak to any of us three. When (in this state) abundant time passed on me, I ascended the wall of the garden of Abu Qatadah who was my cousin. I saluted him, but, I swear by Allah, he did not return salute to me. He then narrated the story of the revelation of the Qur’anic verses relating to his repentance",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4601,
			"arabicnumber": 4601,
			"text": "‘Ammar b. Yasir said:I came to my family when my hands had cracks. They dyed me with saffron. I then went to Prophet (ﷺ) and saluted him, but he did not return me salutation. He said: Go and wash it away from you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4602,
			"arabicnumber": 4602,
			"text": "‘A’ishah said:The camel of Safiyyah daughter of Huyayy was fatigued, and Zainab had a surplus mount. The Messenger of Allah (ﷺ) said to Zainab : Give her the camel. She said: Should I give to that Jewess? Thereupon the Messenger of Allah (ﷺ) became angry and kept away from her during Dhu al-Hijjah, Muharram, and a part of Safar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4603,
			"arabicnumber": 4603,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: Controverting about the Qur'an is disbelief",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4604,
			"arabicnumber": 4604,
			"text": "Narrated Al-Miqdam ibn Ma'dikarib: The Prophet (ﷺ) said: Beware! I have been given the Qur'an and something like it, yet the time is coming when a man replete on his couch will say: Keep to the Qur'an; what you find in it to be permissible treat as permissible, and what you find in it to be prohibited treat as prohibited. Beware! The domestic ass, beasts of prey with fangs, a find belonging to confederate, unless its owner does not want it, are not permissible to you If anyone comes to some people, they must entertain him, but if they do not, he has a right to mulct them to an amount equivalent to his entertainment",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4605,
			"arabicnumber": 4605,
			"text": "Narrated AbuRafi': The Prophet (ﷺ) said: Let me not find one of you reclining on his couch when he hears something regarding me which I have commanded or forbidden and saying: We do not know. What we found in Allah's Book we have followed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4606,
			"arabicnumber": 4606,
			"text": "A'ishah reported the Messenger of Allah (ﷺ) as saying:If any one introduces into this affair of ours anything which does not belong to it, it is rejected. Ibn `Isa said: The Prophet (ﷺ) said: If anyone practices any action in a way other than our practice, it is rejected",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4607,
			"arabicnumber": 4607,
			"text": "Narrated Irbad ibn Sariyah: AbdurRahman ibn Amr as-Sulami and Hujr ibn Hujr said: We came to Irbad ibn Sariyah who was among those about whom the following verse was revealed: \"Nor (is there blame) on those who come to thee to be provided with mounts, and when thou saidst: \"I can find no mounts for you.\" We greeted him and said: We have come to see you to give healing and obtain benefit from you. Al-Irbad said: One day the Messenger of Allah (ﷺ) led us in prayer, then faced us and gave us a lengthy exhortation at which the eyes shed tears and the hearts were afraid. A man said: Messenger of Allah! It seems as if it were a farewell exhortation, so what injunction do you give us? He then said: I enjoin you to fear Allah, and to hear and obey even if it be an Abyssinian slave, for those of you who live after me will see great disagreement. You must then follow my sunnah and that of the rightly-guided caliphs. Hold to it and stick fast to it. Avoid novelties, for every novelty is an innovation, and every innovation is an error",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4608,
			"arabicnumber": 4608,
			"text": "‘Abd Allah b. Mas’ud reported the Prophet (ﷺ) as saying:\"Beware! The extremists perished,\" saying it three times",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4609,
			"arabicnumber": 4609,
			"text": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:If anyone summons other to follow right guidance, his reward will be equivalent to that of the people who follow him, without their rewards being diminished in any respect on that account; and if anyone summons others to follow error the sin of which sins being diminished in any respect on that account",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4610,
			"arabicnumber": 4610,
			"text": "‘Amir b. sa’id on his father’s authority reported the Messenger of Allah (ﷺ) as saying:The Muslim who offends most against the Muslims is he who enquires about something which has not been forbidden to men, and it is declared forbidden because of his enquiry",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4611,
			"arabicnumber": 4611,
			"text": "Yazid b. ‘Umairah, who was one of the companions of Mu’adh b. Jabal said:Whenever he (mu’adh b. jabal) sat in a meeting for preaching, he would say: Allah is a just arbiter; those who doubt would perish. One day Mu’adh b. jabal said: In the times after you there would be trails in which riches would be abundant. During these trails the Quran would be easy so much so that every believer, hypocrite, man, woman, young, grown up, slave and free man will learn it. Then a man might say: What happened with the people that they do not follow me while I read the Quran? They are not going to follow me until I introduce a novelty for them other than it. So avoid that which is innovated (in religion), for whichever is innovated is an error. I warn you of the deviation of a scholar from right guidance, for sometimes Satan utters a word of error through the tongue of a scholar; and sometimes a hypocrites may speak a word of truth. I said to Mu’adh b. jabal: I am at a loss to understand may Allah have mercy on you that a learned man sometimes may speak a word of error and a hypocrite may speak a word of truth. He replied: Yes, avoid the speech of a learned man on distract you from him (the learned), for it is possible that he may withdraw (from these well-known things), and you get the truth when you hear it, for truth has light. Abu Dawud said: In this tradition Ma’mar on the authority of al-Zuhrl said: The words “wa la yun iyannaka” instead of “wa la yuthniyannaka,” with the same meaning: “it may not distract you” salih b. Kaisan on the authority of al-Zurhrl said in this tradition the words “al-mushtaharat” (well-know things). He also said the word “La yuthniyannaka” as ‘Uqail mentioned. Ibn ishaq, on the authority of al-Zuhri, said: Yes, if you are doubtful about the speech of a scholar until you say: WHAT did he mean by this word?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4612,
			"arabicnumber": 4612,
			"text": "Sufyan said (according to one chain), and Abu al-Salit said (according to another chain):A man wrote to 'Umar b. 'Abd al-Aziz asking him about Divine decree. He wrote to him: To begin with, I enjoin upon you to fear Allah, to be moderate in (obeying) His Command, to follow the sunnah (practice) of His Prophet (ﷺ) and to abandon the novelties which the innovators introduced after his Sunnah has been established and they were saved from its trouble (i.e. novelty or innovation) ; so stick to Sunnah, for it is for you, if Allah chooses, a protection ; then you should know that any innovation which the people introduced was refuted long before it on the basis of some authority or there was some lesson in it, for the Sunnah was introduced by the people who were conscious of the error, slip, foolishness, and extremism in case of (the sunnah) was opposed. So accept for yourself what the people (in the past) had accepted for themselves, for they had complete knowledge of whatever they were informed, and by penetrating insight they forbade (to do prohibited acts); they had more strength (than us) to disclose the matters (of religion), and they were far better (than us) by virtue of their merits. If right guidance is what you are following, then you outstriped them to it. And if you say whatever the novelty occurred after them was introduced by those who followed the way other then theirs and disliked them. It is they who actually outstripped, and talked about it sufficiently, and gave a satisfactory explanation for it. Below them there is no place for exhaustiveness, and above them there is no place for elaborating things. Some people shortened the matter more than they had done, and thus they turned away (from them), and some people raised the matter more than they had done, and thus they exaggerated. They were on right guidance between that. You have written (to me) asking about confession of Divine decree, you have indeed approached a person who is well informed of it, with the will of Allah. I know what whatever novelty people have brought in, and whatever innovation people have introduced are not more manifest and more established than confession of Divine decree. The ignorant people (i.e. the Arabs before Islam) in pre-Islamic times have mentioned it ; they talked about it in their speeches and in their poetry. They would console themselves for what they lost, and Islam then strengthened it (i.e. belief in Divine decree). The Messenger of Allah (ﷺ) did not mention it in one or two traditions, but the Muslims heard it from him, and they talked of it from him, and they talked of it during his lifetime and after his death. They did so out of belief and submission to their Lord and thinking themselves weak. There is nothing which is not surrounded by His knowledge, and not counted by His register and not destined by His decree. Despite that, it has been strongly mentioned in His Book: from it they have derived it, and from it they have and so ? they also read in it what you read, and they knew its interpretation of which you are ignorant. After that they said: All this is by writing and decreeing. Distress has been written down, and what has been destined will occur ; what Allah wills will surely happen, and what He does not will will not happen. We have no power to harm or benefit ourselves. Then after that they showed interest (in good works) and were afraid (of bad deeds)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4613,
			"arabicnumber": 4613,
			"text": "Nafi said:Ibn ‘Umar had a friend from the people of Syria who used to correspond with him. ‘Abd Allah b. ‘Umar wrote to him: I have been informed that you have talked something about Divine decree. You should write it to me, for I heard the Messenger of Allah (ﷺ) say: Among my community there will be people who will falsify Divine decree",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4614,
			"arabicnumber": 4614,
			"text": "Khalid al-Hadhdha said:I said to al-Hasan: Abu Sa’id, tell me about Adam. Was he created for the heaven or the earth? He said: No, for the earth. I said: It was unavoidable for him. I said: Tell me about the following verse of the Quran: ”can lead (any) into temptation concerning Allah, except such as are (themselves) going to blazing fire.” He said: The devils do not lead anyone astray by their temptation except the one whom Allah destined to go to Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4615,
			"arabicnumber": 4615,
			"text": "Khalid al-Hadhdha, asked al-Hasan about the Quranic verse:“And for this did He create them.” He said: He created these for this and those for that",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4616,
			"arabicnumber": 4616,
			"text": "Khalid al-Hadhdha asked al-Hasan about the Quranic verse:“Can lead (any) into temptation concerning Allah, except such as are (themselves) going to the blazing fire.” He said: Except the one whom Allah destined that he should go to Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4617,
			"arabicnumber": 4617,
			"text": "Humaid said:Al-Hasan used to say that his fall from the heaven on the earth is dearer to him than uttering: The matter is in my hand",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4618,
			"arabicnumber": 4618,
			"text": "Humaid said:Al-Hasan came to us. The jurists of Mecca told me that I should speak to him that some day he should hold a meeting for them and preach to them. He said: Yes. So they gathered and he addressed them. I did not see anyone on orator greater than him. A man said: Abu Sa’id, who created Satan? He replied: Glory be to Allah! Is there any creator other than Allah? Allah created Satan, and he created good and created evil. The man said: May Allah ruin them! How do they lie to this old man",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4619,
			"arabicnumber": 4619,
			"text": "Humaid al-Tawil asked al-Hasan about the verse:“Even so do We let it creep into the hearts of the sinners.” He said: Polytheism",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4620,
			"arabicnumber": 4620,
			"text": "Explaining the Quranic verse; “And between them and their desire is placed a barrier.” Al-Hasan said:Between them and their faith",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4621,
			"arabicnumber": 4621,
			"text": "Ibn ‘Awn said:I was a prisoner in Syria. A man called me from behind. I turned towards him and suddenly found that it was Raja b. Haiwah. He said: Abu ‘Awn, what is this that the people are telling about al-Hasan? I said: They are much lying to al-Hasan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4622,
			"arabicnumber": 4622,
			"text": "Hammad said:I heard Ayyub say: Two kinds of people have lied to al-Hasan: people who believed in free will and they intended that they publicise their belief by it; and people who had enmity with and hostility (for al-Hasan), saying: Did he not say so and so? Did he not say so and so?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4623,
			"arabicnumber": 4623,
			"text": "Yahya b. Kathir al-‘Anbari said:Qurrah b. Khalid used to tell us: O young people! Do not think that al-Hasan denied predestination, for his opinion (i.e., belief) was sunnah and sight",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4624,
			"arabicnumber": 4624,
			"text": "Ibn ‘Awn said:If we learnt that the remark of al-Hasan would reach the extent that it has reached, we would write a book for his withdrawal and call witnesses to him; but we said: This is a remark that surprisingly came out (from him) and it will not be transmitted to others",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4625,
			"arabicnumber": 4625,
			"text": "Ayyub said:Al-Hasan said: I will never return to it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4626,
			"arabicnumber": 4626,
			"text": "‘Uthman al-Batti said:Al-Hasan never interpreted any Quranic verse but to establish (Divine decree)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4627,
			"arabicnumber": 4627,
			"text": "Ibn ‘Umar said:We used to say in the times of the Prophet (ﷺ): We do not compare anyone with Abu Bakr. ’Umar came next and then ‘Uthman. We then would leave (rest of) the companions of the Prophet (ﷺ) without treating any as superior to other",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4628,
			"arabicnumber": 4628,
			"text": "Ibn ‘Umar said:When the Messenger of Allah (ﷺ) was alive, we used to say: The most excellent member of the community of the Prophet (ﷺ) after himself is Abu Bakr, then ‘Umar, then 'Uthman",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4629,
			"arabicnumber": 4629,
			"text": "Muhammad b. al-Hanafiyyah said:I said to my father: Which of the people after the Messenger of Allah (ﷺ) is best? He replied: Abu Bakr. I then asked: Who comes next? He said: ‘Umar. I was then afraid of asking him who came next, and he might mention ‘Uthman, so I said: You came next, O my father? He said: I am only a man among the Muslims",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4630,
			"arabicnumber": 4630,
			"text": "Muhammad al-Firyabl said:I heard Sufyan say: If anyone thinks that ‘All (Allah be pleased with him) was more deserving for the Caliphate than both of them, he imputed error to Abu Bakr, ‘Umar, the Muhajirun (Immigrants), and the Ansar (Helpers) Allah be pleased with all of them. I think that with this (belief) none of his action will rise to the heaven",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4631,
			"arabicnumber": 4631,
			"text": "Sufyan al-Thawri said:The Caliphs are five: Abu Bakr, ‘Umar, ‘Uthman, ‘All and ‘Umar b. ‘Abd al-Aziz",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4632,
			"arabicnumber": 4632,
			"text": "Ibn 'Abbas said:Abu Hurairah said that a man came to the Messenger of Allah (ﷺ) and said: I saw (in my dream) a piece of cloud from which ghee and honey were dropping. I saw the people spreading their hands. Some of them took much and some a little. I also saw a rope hanging from Heaven to Earth. I saw, Messenger of Allah, that you caught hold of it and ascended by it. Then another man caught hold of it and ascended it. Then another man caught hold of it and ascended it. Then another man caught hold of it, but it broke, and then it was joined and he ascended it. AbuBakr said: May my parents be sacrificed for you, if you allow, I shall interpret it. He said: Interpret it. He said: The piece of cloud is the cloud of Islam; the ghee and honey that were dropping from it are the Qur'an, which contains softness and sweetness. Those who received much or little of it are those who learn much or little of the Qur'an. The rope hanging from Heaven to Earth is the truth which you are following. You catch hold of it and then Allah will raise you to Him. Then another man will catch hold of it and ascend it, Then another man will catch hold of it and it will break. But it will be joined and he will ascend it. Tell me. Messenger of Allah, whether I am right or wrong. He said: You are partly right and partly wrong. He said: I adjure you by Allah, you should tell me where I am wrong. The Prophet (ﷺ) said: Do not take an oath",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4633,
			"arabicnumber": 4633,
			"text": "The tradition mentioned above has also been transmitted by Ibn ‘abbas through a different chain of narrators. This version adds:He refused to tell him (his mistake)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4634,
			"arabicnumber": 4634,
			"text": "Narrated AbuBakrah: One day the Prophet (ﷺ) said: Which of you had dream? A man said: It is I. I saw as though a scale descended from the sky. You and AbuBakr were weighed and you were heavier; AbuBakr and Umar were weighed and AbuBakr was heavier: Umar and Uthman were weighed and Umar was heavier; than the scale was taken up. we saw signs of dislike on the face of the Messenger of Allah (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4635,
			"arabicnumber": 4635,
			"text": "Abu Bakrah said:One day the Prophet (ﷺ) asked: Which of you had a dream? He then mentioned the rest of the tradition to the same effect, but he did not mention the word “disliked”. Instead, he said: The Messenger of Allah (ﷺ) was grieved about that. He then said: There will be a caliphate on the model of prophecy, then Allah will give the kingdom to whom he wills",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4636,
			"arabicnumber": 4636,
			"text": "Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as saying:Last night a good man had a vision in which Abu Bakr seemed to be joined to the Messenger of Allah (ﷺ). ‘Umar to Abu Bakr, and ‘Uthman to ‘Umar. Jabir said: When we got up and left the Messenger of Allah (ﷺ), we said: The good man is the Messenger of Allah (ﷺ), and that their being joined together means that they are the rulers over this matter with which Allah has sent His Prophet (ﷺ). Abu Dawud said: It has been transmitted by Yunus and Shu’aib, but they did not mention ‘Amr b. Aban",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4637,
			"arabicnumber": 4637,
			"text": "Samurah b. Jundub told that a man said:Messenger of Allah (ﷺ)! I saw (in a dream) that a bucket was hung from the sky. Abu Bakr came, caught hold of both ends of its wooden handle, and drank a little of it. Next came ‘Umar who caught hold of both ends of its wooden handle and drank of it to his fill. Next came ‘Uthman who caught hold of both ends of its handle and drank of it to his fill. Next came ‘All. He caught hold of both ends of its handle, but it became upset and some (water) from it was sprinkled on him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4638,
			"arabicnumber": 4638,
			"text": "Makhul said:The Romans will enter the Levant and stay there for forty days, and no place will be saved from them but Damascus and 'Uman",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4639,
			"arabicnumber": 4639,
			"text": "Abu al-A’yas ‘Abd al-Rahman b. Salam said:A king of the foreigners will come and prevail over all the cities except Damascus",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4640,
			"arabicnumber": 4640,
			"text": "Makhul reported the Messenger of Allah (ﷺ) as saying:The place of the assembly of Muslims at the time of war will be in a land called al-Ghutah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4641,
			"arabicnumber": 4641,
			"text": "‘Awf said:I heard al-Hajjaj addressing the people say: The similitude of ‘Uthman with Allah is like the similitude of Jesus son of Mary. He then recited the following verse and explained it: “Behold! Allah said: O Jesus! I will take thee and raise thee to Myself and clear thee (of the falsehood) of those who blaspheme.” He was making a sign with his hand to us and to the people of Syria",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4642,
			"arabicnumber": 4642,
			"text": "Al-Rabi’ b. Khalid al-Dabbi said:I heard al-Hajjaj say in his address: Is the messenger of one of you sent for some need is more respectable with him or his successor among his people? I thought in my mind: I make a vow for Allah that I shall never pray behind you. If I find people who fight against you, I shall fight against you along with them. Ishaq added in his version: He fought in the battle of al-Jamajim until he was killed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4643,
			"arabicnumber": 4643,
			"text": "‘Asim said:I heard al-Hajjaj say on the pulpit: Fear Allah as much as possible; there is no exception in it. Hear and obey the Commander of the Faithful ‘Abd al-Malik; there is no exception in it. I swear by Allah, if order people to come but from a certain gate of the mosque, and they come out from another gate, their blood and their properties will be lawful for me. I swear by Allah, if I seize the tribe of Rabi’ah for the tribe of Mudar, it is lawful for me from Allah. Who will apologies to me for the slave of Hudhail (i.e. ‘Abd Allah b. Mas’ud) who thinks that his reading of the Quran is from Allah. I swear by Allah, it is a rhymed prose of the Bedouins. Allah did not reveal it to his Prophet (ﷺ). Who will apologies to me for these clients (non-Arab). One of them thinks that he will throw a stone and when it falls (on the ground) he says: Something new has happened. I swear by Allah, I shall leave them (ruined and perished) like the day that passes away. He said: I mentioned it to al-A’mash. He said: I swear by Allah, I heard it from him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4644,
			"arabicnumber": 4644,
			"text": "Al-A’mash said:These clients (i.e., non-Arabs) are to be struck and cut off. I swear by Allah, if I strike a stick with a stick, I would annihilate them like the day that passed away. Al-hamra means clients or non-Arabs",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4645,
			"arabicnumber": 4645,
			"text": "Sulaiman al-A’mash said:I prayed the Friday prayer with al-Hajjaj and he addressed. He then transmitted the tradition of Abu Bakr b. ‘Ayyash. He said in it: Hear and obey the caliph of Allah and his select ‘Abd al-Malik bin Marwan. He then transmitted the rest of the tradition, and said: If I seized Rabi’ah for Mudar. But he did not mention the story of the clients (i.e. non Arabs)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4646,
			"arabicnumber": 4646,
			"text": "Narrated Safinah: The Prophet (ﷺ) said: The Caliphate of Prophecy will last thirty years; then Allah will give the Kingdom of His Kingdom to anyone He wills. Sa'id told that Safinah said to him: Calculate Abu Bakr's caliphate as two years, 'Umar's as ten, 'Uthman's as twelve and 'Ali so and so. Sa'id said: I said to Safinah: They conceive that 'Ali was not a caliph. He replied: The buttocks of Marwan told a lie",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4647,
			"arabicnumber": 4647,
			"text": "Safinah reported the Messenger of Allah (ﷺ) as saying:The caliphate of Prophecy will last thirty years; then Allah will give the Kingdom to whom he wishes; or his kingdom to whom he wishes",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4648,
			"arabicnumber": 4648,
			"text": "Narrated Sa'id ibn Zayd ibn Amr ibn Nufayl: Abdullah ibn Zalim al-Mazini said: I heard Sa'id ibn Zayd ibn Amr ibn Nufayl say: When so and so came to Kufah, and made so and so stand to address the people, Sa'id ibn Zayd caught hold of my hand and said: Are you seeing this tyrant? I bear witness to the nine people that they will go to Paradise. If I testify to the tenth too, I shall not be sinful. I asked: Who are the nine? He said: The Messenger of Allah (ﷺ) said when he was on Hira': Be still, Hira', for only a Prophet, or an ever-truthful, or a martyr is on you. I asked: Who are those nine? He said: The Messenger of Allah, AbuBakr, Umar, Uthman, Ali, Talhah, az-Zubayr, Sa'd ibn AbuWaqqas and AbdurRahman ibn Awf. I asked: Who is the tenth? He paused a moment and said: it is I. Abu Dawud said: This tradition has been transmitted by al-Ashja'i, from Sufyan, from Mansur, from Hilal b. Yasaf, from Ibn Hayyan on the authority of 'Abd Allah b. Zalim through his different chain of narrators in a a similar manner",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4649,
			"arabicnumber": 4649,
			"text": "Narrated Sa'id ibn Zayd: AbdurRahman ibn al-Akhnas said that when he was in the mosque, a man mentioned Ali (may Allah be pleased with him). So Sa'id ibn Zayd got up and said: I bear witness to the Messenger of Allah (ﷺ) that I heard him say: Ten persons will go to Paradise: The Prophet (ﷺ) will go to Paradise, AbuBakr will go to Paradise, Umar will go to Paradise, Uthman will go to Paradise, Ali will go to Paradise, Talhah will go to Paradise: az-Zubayr ibn al-Awwam will go to paradise, Sa'd ibn Malik will go to Paradise, and AbdurRahman ibn Awf will go to Paradise. If I wish, I can mention the tenth. The People asked: Who is he: So he kept silence. The again asked: Who is he: He replied: He is Sa'id ibn Zayd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4650,
			"arabicnumber": 4650,
			"text": "Rabah ibn al-Harith said:I was sitting with someone in the mosque of Kufah while the people of Kufah were with him. Then Sa'id ibn Zayd ibn Amr ibn Nufayl came and he welcomed him, greeted him, and seated him near his foot on the throne. Then a man of the inhabitants of Kufah, called Qays ibn Alqamah, came. He received him and began to abuse him. Sa'id asked: Whom is this man abusing? He replied: He is abusing Ali. He said: Don't I see that the companions of the Messenger of Allah (ﷺ) are being abused, but you neither stop it nor do anything about it? I heard the Messenger of Allah (ﷺ) say--and I need not say for him anything which he did not say, and then he would ask me tomorrow when I see him --AbuBakr will go to Paradise and Umar will go to Paradise. He then mentioned the rest of the tradition to the same effect (as in No. 4632). He then said: The company of one of their man whose face has been covered with dust by the Messenger of Allah (ﷺ) is better than the actions of one of you for a whole life time even if he is granted the life-span of Noah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4651,
			"arabicnumber": 4651,
			"text": "Anas b. malik said:The prophet of Allah (ﷺ) ascended Uhud, and Abu Bakr, ’Umar and 'Uthman followed him. It began to shake with them. The prophet of Allah (ﷺ) struck it with his foot and said: Be still, for only a prophet, an ever-truthful and two martyrs are on you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4652,
			"arabicnumber": 4652,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: Gabriel came and taking me by the hand showed the gate of Paradise by which my people will enter. AbuBakr then said: Messenger of Allah! I wish I had been with you so that I might have looked at it. The Messenger of Allah (ﷺ) then said: You, AbuBakr, will be the first of my people to enter Paradise",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4653,
			"arabicnumber": 4653,
			"text": "Jabir reported the Messenger of Allah (ﷺ) as saying:No one of those who took the oath of allegiance under the tree will go to hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4654,
			"arabicnumber": 4654,
			"text": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying – will be according to the version of Musa :Perhaps Allah, and Ibn Sinan’s version has : Allah looked at the participants of the battle of Badr (with mercy) and said : Do whatever you wish ; I have forgiven you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4655,
			"arabicnumber": 4655,
			"text": "Al-Miswar b. Makhramah said :The prophet (ﷺ) went out during the time of (treaty of) al-Hudaibiyyah. He then mentioned the rest of the tradition. He said : ‘Urwah b. Mas’ud then came to him and began to speak to the Prophet (ﷺ). Whenever he talk to him, he caught his beard ; and al-Mughirah b. Shu’bah was standing near the head of the Prophet (ﷺ) with a sword with him and a helmet on him. He then struck his hand with the handle of the sword, saying : Keep away your hand from his beard. ‘Urwah then raised his head and said : Who is this ? The prophet said : Al-Mughirah b. Shu’bah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4656,
			"arabicnumber": 4656,
			"text": "Narrated Umar ibn al-Khattab: Al-Aqra', the mu'adhdhin (announcer) of Umar ibn al-Khattab said: Umar sent me to a bishop and I called him. Umar said to him: Do you find me in the Book? He said: Yes. He asked: How do you find me? He said: I find you (like a) castle. Then he raised a whip to him, saying: What do you mean by castle? He replied: An iron castle and severely trustworthy. He asked: How do you find the one who will come after me? He said: I find him a pious caliph, except that he will prefer his relatives. Umar said: May Allah have mercy on Uthman: He said it three times. He then asked: How do you find the one who will come after him? He replied: I find him like rusty iron. Umar then put his hand on his head, and said: O filthy! O filthy! He said: Commander of the Faithful! He is a pious caliph, but when he is made caliph, the sword will be unsheathed and blood will be shed. Abu Dawud said: Al-dafr means filth or evil smell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4657,
			"arabicnumber": 4657,
			"text": "‘Imran b. Husain reported the Messenger of Allah (ﷺ) as saying :the best of my people is the generation in which I have been sent, then their immediate followers, then their immediate followers. Allah knows best whether he mentioned the third or not. After them will be people who will give testimony without being asked, who will make vows which they do not fulfill, who will be treacherous and not to be trusted, among whom fatness will appear",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4658,
			"arabicnumber": 4658,
			"text": "Abu Sa’id (al-Khudri) reported the Messenger of Allah (May peace be upon him) as saying :Do not revile my Companions; by him in whose hand my soul is, if one of you contributed the amount of gold equivalent to Uhud, it would not amount to as much as the mudd of one of them, or half of it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4659,
			"arabicnumber": 4659,
			"text": "‘Amr b. Abl Qurrah said :Hudhaifah was in al-Mada’in. He used to mention things which the Messenger of Allah (May peace be upon him) said to some people from among his Companions in anger. The people who heard from Hudhaifah would go to Salman and tell him what Hudhaifah said. Salman would say: Hudhaifah knows best what he says. Then they would come to Hudhaifah and tell him: We mentioned Salman what you said, but he neither testified you nor falsified you. So Hudhaifah came to salman who was in his vegetable farm, and said : Salman, what prevents you from testifying me of what I heard from the Messenger of Allah (May peace be upon him) ? Salman said: The Messenger of Allah (May peace be upon him) sometimes would be angry, and said in anger something to some of his Companions; he would be sometimes pleased and said in pleasure something to some of his Companions. Would you not stop until you create love of some people in the hearts of some people, and hatred of some people in the hearts of some people, and until you generate disagreement and dissension? You know that the Messenger of Allah (May peace be upon him) addressed, saying : If I abused any person of my people, or cursed him in my anger. I am one of the children of Adam : I become angry as they become angry. He (Allah) has sent me as a mercy for all worlds. (O Allah!) make them (Abuse or curse) blessing for them on the day of judgment! I swear by Allah. You should stop (mentioning these traditions), otherwise I shall writ to ‘Umar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4660,
			"arabicnumber": 4660,
			"text": "Narrated Abdullah ibn Zam'ah: When the illness of the Messenger of Allah (ﷺ) became serious while I was with him among a group of people, Bilal called him for prayer. He said: Ask someone to lead the people in prayer. So Abdullah ibn Zam'ah went out and found that Umar was present among the people and AbuBakr was not there. I said: Umar, get up and lead the people in prayer. So he came forward and uttered \"Allah is Most Great\". When the Messenger of Allah (ﷺ) heard his voice, as Umar had a loud voice, he said: Where is AbuBakr? Allah does not allow that, and the Muslims too; Allah does not allow that, and the Muslims too. So he sent for AbuBakr. He came after Umar had led the people in that prayer. He then led the people in prayer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4661,
			"arabicnumber": 4661,
			"text": "The tradition mentioned above has also been transmitted by ‘Abd Allah b. Zam’ah through a different chain. He said:When the Prophet (May peace be upon him) heard ‘Umar’s voice, Ibn Zam’ah said: The Prophet (May peace be upon him) came out until he took out his head of his apartment. He then said : No, no, no; the son of Abu Quhafah should lead the people in prayer. He said it angrily",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4662,
			"arabicnumber": 4662,
			"text": "Narrated AbuBakrah: The Messenger of Allah (ﷺ) said to al-Hasan ibn Ali. This son of mine is a Sayyid (chief), and I hope Allah may reconcile two parties of my community by means of him. Hammad's version has: And perhaps Allah may reconcile two large parties of Muslims by means of him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4663,
			"arabicnumber": 4663,
			"text": "Narrated Hudhayfah: There is no one who will be overtaken by trial regarding whom I do not fear except Muhammad ibn Maslamah, for I heard the Messenger of Allah (ﷺ) say: Trial will not harm you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4664,
			"arabicnumber": 4664,
			"text": "Tha’labah b. Dubai’ah said:We entered upon Hudhaifah. He said: I know a man whom the trails will not harm. We came out and found that a tent was pitched. We entered and found in it Muhammad b. Maslamah. We asked him about it. He said : I do not intent that any place of your towns should occupy me until that which is prevailing is removed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4665,
			"arabicnumber": 4665,
			"text": "The tradition mentioned above has also been transmitted by Dubai’ah b. Husain al-Tha’labi through a different chain of narrators to the same effect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4666,
			"arabicnumber": 4666,
			"text": "Qais b. ‘Abbad said :I said to ‘All (Allah be pleased with him) : Tell me about this march of yours. Is this an order that the Messenger of Allah (May peace be upon him) had given you, or is this your opinion that you have? He said: The Messenger of Allah (May peace be upon him) did not give me any order; but this is an opinion that I have",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4667,
			"arabicnumber": 4667,
			"text": "Abu Sa’id reported the Messenger of Allah (May peace be upon him) as saying:In the event of the dissension among Muslims an emerging sect will emerge ; one of the two parties that is nearer to the truth will kill it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4668,
			"arabicnumber": 4668,
			"text": "Abu Sa’id al-Khudri reported the Messenger of Allah (May peace be upon him) as saying :Do not distinguish between the Prophets",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4669,
			"arabicnumber": 4669,
			"text": "Ibn ‘Abbas reported the Prophet (May peace be upon him) as saying :It is not fitting for a servent to say that I (The Prophet) is better than Jonah son of Matta",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4670,
			"arabicnumber": 4670,
			"text": "‘Abd Allah b. Ja’far reported the Messenger of Allah (May peace be upon him) as saying:It is not fitting for a prophet to say : I am better than Jonah son of matta",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4671,
			"arabicnumber": 4671,
			"text": "‘Abu Hurairah said :A man from among the Jews said : By him who chose Moses above the universe. So a Muslim raised his hand and slapped the Jew on his face. The Jew went to the Messenger of Allah (May peace be upon him) and informed him. The Prophet (May peace be upon him) said: Do not make me superior to Moses, for mankind (on the Day of Resurrection) will swoon and I will be the know whether he was among those who swooned and had recovered before me, or he was among those of whom Allah had made an exception. Abu Dawud said : The tradition of Ibn yahya is more perfect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4672,
			"arabicnumber": 4672,
			"text": "Anas said:A man said to the Messenger of Allah (May peace be upon him): O best of all creatures! The Messenger of Allah (May peace be upon him) said : That was Abraham (peace be upon him)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4673,
			"arabicnumber": 4673,
			"text": "Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :I shall be pre-eminent among the descendants of Adam, the first from whom the earth will be cleft open the first intercessor, and the first whose intercession will be accepted",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4674,
			"arabicnumber": 4674,
			"text": "Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :I do not know whether Tubba was accursed or not, and ‘Uzair (Azra was a prophet or not)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4675,
			"arabicnumber": 4675,
			"text": "Abu Hurairah said :I heard the Messenger of Allah (May peace be upon him) say : I am the nearest of kin among the people to (Jesus) son of Mary. The Prophet are brothers, sons of one father by co-wives. There is no Prophet between me and him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4676,
			"arabicnumber": 4676,
			"text": "Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :Faith has over seventy branches, the most excellent of which is the declaration that there is no god but Allah, and the humblest of which is the removal of a bone from the road. And modesty is a branch of faith",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4677,
			"arabicnumber": 4677,
			"text": "Ibn ‘Abbas said :When the deputation of ‘Abd al-Qais came to the Messenger of Allah (May peace be upon him), he commanded them to believe in Allah. He asked : Do you know what faith in Allah is? They replied : Allah and his Apostle know best. He said: It includes the testimony that there is no god but Allah, and that Muhammad is Allah’s Apostle, the observance of the prayer, the payment of zakat, the fasts of Ramadan, and your giving a fifth of the booty",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4678,
			"arabicnumber": 4678,
			"text": "Jabir reported the Messenger of Allah (May peace be upon him) as saying :Between a servant and unbelief there is the abandonment of prayer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4679,
			"arabicnumber": 4679,
			"text": "Abd Allah b. 'Umar reported the Messenger of Allah (ﷺ) as saying:I did not see more defective in respect of reason and religion than the wise of you (women). A woman asked: What is the defect of reason and religion ? He replied: The defect of reason is the testimony of two women for one man, and the defect of faith is that one of you does not fast during Ramadan (when one is menstruating), and keep away from prayer for some days",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4680,
			"arabicnumber": 4680,
			"text": "Ibn ‘Abbas said:when the Prophet (May peace be upon him) turned towards the Ka’bah (in prayer), the people asked : Messenger of Allah (May peace be upon him)! what will happen with those who died while they prayed with their faces towards Jerusalem ? Allah the Exalted, then revealed : “And never would Allah make your faith of no effect.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4681,
			"arabicnumber": 4681,
			"text": "Narrated AbuUmamah: The Prophet (ﷺ) said: If anyone loves for Allah's sake, hates for Allah's sake, gives for Allah's sake and withholds for Allah's sake, he will have perfect faith",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4682,
			"arabicnumber": 4682,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: The most perfect believer in respect of faith is he who is best of them in manners",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4683,
			"arabicnumber": 4683,
			"text": "Sa’d b. Abi Waqqas said :The Prophet (May peace be upon him) gave some people and did not give anything to a man of them. Sa’d said : Messenger of Allah! You gave so and so, so and so, but did not give anything to so and so while he is a believer. The Prophet (May peace be upon him) said : Or he is a Muslim. Sa’d repeated it thrice and the Prophet (May peace be upon him) then said : I give some people and leave him who is dearer to me than them. I do not give him anything fearing lest he should fall into Hell on his face",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4684,
			"arabicnumber": 4684,
			"text": "Explaining the verse, “say ; You have no faith, but you only say :We have submitted our wills to Allah”, Al-Zuhri said : We think that ISLAM is a word, and faith is an action",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4685,
			"arabicnumber": 4685,
			"text": "Sa’d said :The Prophet (May peace be upon him) distributed (spoils) among the people I said to him : Give so and so for he is a believer. He said : Or he is a Muslim. I give a man something while another man is dearer to me than him, fearing that he may fall into Hell on his face",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4686,
			"arabicnumber": 4686,
			"text": "Ibn ‘Umar reported the Prophet (May peace be upon him) as saying :Do not turn unbelievers after me ; one of you may strike the neck of the other",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4687,
			"arabicnumber": 4687,
			"text": "Ibn ‘Umar reported the Messenger of Allah (May peace be upon him) as saying :If any believing man calls another believing man an unbeliever, if he is actually an infidel, it is all right ; if not, he will become an infidel",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4688,
			"arabicnumber": 4688,
			"text": "‘Abd Allah b. ‘Amr reported the Messenger of Allah (May peace be upon him) as saying:Four characteristics constitute anyone who possesses them a sheer hypocrite, and anyone who possesses one of them possesses a characteristics of hypocrisy till he abandons it : when he talks he lies, when he makes a promise he violates it, when he makes a covenant he acts treacherously, and when he quarrels, he deviates from the Truth",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4689,
			"arabicnumber": 4689,
			"text": "Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :When one commits fornication, one is not a believer ; when one steals, one is not a believer ; when one drinks, one is not a believer ; and repentance is placed before him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4690,
			"arabicnumber": 4690,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: When a man commits fornication, faith departs from him and there is something like a canvas roof over his head; and when he quits that action, faith returns to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4691,
			"arabicnumber": 4691,
			"text": "Narrated Abdullah ibn Umar: The Prophet (ﷺ) said: The Qadariyyah are the Magians of this community. If they are ill, do not pay a sick visit to them, and if they die, do not attend their funerals",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4692,
			"arabicnumber": 4692,
			"text": "Hudhaifah reported the Messenger of Allah (ﷺ) as saying:Every people have Magians, and the Magians of this community are those who declare that there is no destination by Allah. If any one of them dies, do not attend his funeral, and if any one of them is ill, do not pay a sick visit to him. They are the partisans of the Antichrist (Dajjal), and Allah will surely join them with the Antichrist",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4693,
			"arabicnumber": 4693,
			"text": "Abu Musa al-Ash’ari reported the Messenger of Allah (May peace be upon him) as saying :Allah created Adam from a handful which he took from the whole of the earth ; so the children of Adam are in accordance with the earth : some red, some white, some black, some a mixture, also smooth and rough, bad and good",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4694,
			"arabicnumber": 4694,
			"text": "‘Ali said:We attended a funeral at Baql’ al-Gharqad which was also attended by the Messenger of Allah (May peace be upon him). The Messenger of Allah (May peace be upon him) came and sat down. He had a stick (in his hand) by which he began to scratch up the ground. He then raised his head and said : The place which every one of you and every soul of you will occupy in Hell or in Paradise has been recorded, and destined wicked or blesses. A man from among the people asked : Prophet of Allah! Should we not then trust simply in what has been recorded for us and abandon (doing good) deeds? Those who are among the number of the blessed will be inclined to blessing, and those of us who are among the number of the wicked will be inclined to wickedness. He replied : Go on doing good actions, for everyone is helped to do that for which he was created. Those who are among the number of wicked will be helped to do wicked deeds. The Prophet of Allah (May peace be upon him) then recited: “So he who gives (in charity) and fears (Allah), and in all sincerity testifies to the best, we will indeed make smooth for him the path to bliss. But he who is a greedy miser and thinks himself self-sufficient, and gives the lie to the best, We will indeed make smooth for him the path of misery.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4695,
			"arabicnumber": 4695,
			"text": "Yahya b. Ya`mur said :The first to speak on Divine decree in al-Basrah was Ma`bad al Juhani. I and Humaid b. `Abd al-Rahman al-Himyari proceeded to perform Hajj or `Umrah. We said : would that we meet any of the Companions of the Messenger of Allah (ﷺ) so that we could ask him about what they say with regard to divine decree. So Allah helped us to meet `Abd Allah b. `Umar who was entering the mosque. So I and my companion surrounded him, and I thought that my companion would entrust me the task of speaking to him. Then I said : Abu ‘Abd al-Rahman, there appeared on our side some people who recite the Qur'an and are engaged in the hair-splitting of knowledge. They conceive that there is no Divine decree and everything happens freely without predestination. He said : When you meet those people, tell them that I am free from them, and they are free from me. By Him by Whom swears ‘Abd Allah b. ‘Umar, if one of them has gold equivalent to Uhud and he spends it, Allah will not accept it from him until he believes in Divine decree. He then said : ‘Umar b. Khattab transmitted to me a tradition, saying : One day when we were with the Messenger of Allah (ﷺ) a man with very white clothing and very black hair came up to us. No mark of travel was visible on him, and we did not recognize him. Sitting down beside the Messenger of Allah (ﷺ), leaning his knees against his and placing his hands on his thighs, he said : tell me, Muhammad, about Islam. The Messenger of Allah (ﷺ) said : Islam means that you should testify that there is no god but Allah, and Muhammad is Allah’s Apostle, that you should observe prayer, pay Zakat, fast during Ramadan, and perform Hajj to the house (i.e., Ka`bah), If you have the means to go. He said : You have spoken the truth. We were surprised at his questioning him and then declaring that he spoke the truth. He said : Now tell me about faith. He replied : It means that you should believe in Allah, his angels, his Books, his Apostles and the last day, and that you should believe in the decreeing both of good and evil. He said : You have spoken the truth. He said : now tell me about doing good (ihsan). He replied: It means that you should worship Allah as though you are seeing him; if you are not seeing him, he is seeing you. He said: Now tell me about the hour. He replied : The one who is asked about it is no better informed than the one who is asking. He said : Then tell me about its signs. He replied : That a maidservant should beget her mistress, and that you should see barefooted, naked, poor men and shepherds exalting themselves in buildings. ‘Umar said : He then went away, and I waited for three days, then he said : Do you know who the questioner was, `Umar? I replied : Allah and his Apostle know best. He said : He was Gabriel who came to you to teach you your religion",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4696,
			"arabicnumber": 4696,
			"text": "The tradition mentioned above has also been transmitted by Yahya b. Yamur and Humaid b. ‘Abd al-Rahman through a different chain of narrators. This version has :we met ‘Abd Allah b. ‘Umar. We told him about divine decree and what they said about it. He then mentioned something similar to it. He added : A man of Muzainah or juhainah asked : What is the good in doing anything, Messenger of Allah ? should we think that a thing has passed and gone or a thing that has happened now (without predestination)? He replied : About a thing that has passed and gone (i.e. predestined). A man or some people asked: Then, why action? He replied: Those who are among the number of those who go to Paradise will be helped to do the deeds of the people who will go to Paradise, and those who are among the number of those who go to Hell will be helped to do the deeds of those who will go to Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4697,
			"arabicnumber": 4697,
			"text": "The tradition mentioned above has also been transmitted by Ibn Ya’mur, with additions and omissions, through a different chain of narrators. This version adds; He asked :What is Islam? He replied : It means saying prayer, payment of zakat, performing HAJJ, fasting during RAMADAN, and taking a bath on account of sexual defilement. Abu Dawud said: 'Alqamah was a Murji'i",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4698,
			"arabicnumber": 4698,
			"text": "Narrated AbuDharr and AbuHurayrah: The Messenger of Allah (ﷺ) used to sit among his Companions. A stranger would come and not recognize him (the Prophet) until he asked (about him). So we asked the Messenger of Allah (ﷺ) to make a place where he might take his seat so that when a stranger came, he might recognise him. So we built a terrace of soil on which he would take his seat, and we would sit beside him. He then mentioned something similar to this Hadith saying: A man came, and he described his appearance. He saluted from the side of the assembly, saying: Peace be upon you, Muhammad. The Prophet (ﷺ) then responded to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4699,
			"arabicnumber": 4699,
			"text": "Ibn al-Dailami said :I went to Ubayy b. Ka’b and said him : I am confused about Divine decree, so tell me something by means of which Allah may remove the confusion from my mind. He replied : were Allah to punish everyone in the heavens and in the earth. He would do so without being unjust to them, and were he to show mercy to them his mercy would be much better than their actions merited. Were you to spend in support of Allah’s cause an amount of gold equivalent to Uhud, Allah would not accept it from you till you believed in divine decree and knew that what has come to you could not miss you and that what has missed you could not come to you. Were you to die believing anything else you would enter Hell. He said : I then went to ‘Abd Allah b. MAs’ud and he said something to the same effect. I next went to Hudhaifah b. al-Yaman and he said something to the same effect. I next went to Zaid b. Thabit who told me something from the Prophet (May peace be upon him) to the same effect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4700,
			"arabicnumber": 4700,
			"text": "Ubadah b. al Samit said to his son :Son! You will not get the taste of the reality of faith until you know that what has come to you could not miss you, and that what has missed you could not come to you. I heard the Messenger of Allah (ﷺ) say: The first thing Allah created was the pen. He said to it: Write. It asked: What should I write, my Lord? He said: Write what was decreed about everything till the Last Hour comes. Son! I heard the Messenger of Allah (ﷺ) say : He who dies on something other than this does not belong to me",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4701,
			"arabicnumber": 4701,
			"text": "Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :Adam and Moses held a disputation. Moses said : Adam you are our father. You deprived us and caused us to come out from Paradise. Adam said : You are Moses Allah chose you for his speech and wrote the Torah for you with his hand. Do you blame me for doing a deed which Allah had decreed that I should do forty year before he created me? So Adam got the better of Moses in argument. Ahmad b. Salih said from 'Amr from Tawus who heard Abu Hurairah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4702,
			"arabicnumber": 4702,
			"text": "‘Umar b. al-Khattab reported the Messenger of Allah (May peace be upon him) as saying :Moses said : My lord, show us Adam who caused us and himself to come out from Paradise. So Allah showed him Adam. He asked : Are you our father, Adam? Adam said to him : Yes. He said : Are you the one into whom Allah breathed of his spirit, taught you all the names, and commanded angels (to prostrate) and they prostrated to you? He replied : Yes. He asked : Then what moved you to cause us and yourself to come out from paradise? Adam asked him : And who are you? He said : Yes. He asked : Did you not find that was decreed in the book (records) of Allah before I was created? He replied : Yes. He asked : Then why do you blame me about a thing for which Divine decree had already passed before me ? The Messenger of Allah (May peace be upon him) said : So Adam got the better of Moses in argument (peace be upon him)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4703,
			"arabicnumber": 4703,
			"text": "Narrated Umar ibn al-Khattab: Muslim ibn Yasar al-Juhani said: When Umar ibn al-Khattab was asked about the verse \"When your Lord took their offspring from the backs of the children of Adam\" - al-Qa'nabi recited the verse--he said: I heard the Messenger of Allah (ﷺ) say when he was questioned about it: Allah created Adam, then passed His right hand over his back, and brought forth from it his offspring, saying: I have these for Paradise and these will do the deeds of those who go to Paradise. He then passed His hand over his back and brought forth from it his offspring, saying: I have created these for Hell, and they will do the deeds of those who go to Hell. A man asked: What is the good of doing anything, Messenger of Allah? The Messenger of Allah (ﷺ) said: When Allah creates a servant for Paradise, He employs him in doing the deeds of those who will go to Paradise, so that his final action before death is one of the deeds of those who go to Paradise, for which He will bring him into Paradise. But when He creates a servant for Hell, He employs him in doing the deeds of those who will go to Hell, so that his final action before death is one of the deeds of those who go to Hell, for which He will bring him into Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4704,
			"arabicnumber": 4704,
			"text": "Nu’aim b. Rabl’ah said :I was with ‘Umar b. al-Khattab when he transmitted this tradition. The tradition of Malik is more perfect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4705,
			"arabicnumber": 4705,
			"text": "Ubayy b. Ka’b said :The boy whom al-Khidr had killed was created an infidel. Had he lived, he would have moved his parents to rebellion and unbelief",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4706,
			"arabicnumber": 4706,
			"text": "Ubayy b. Ka’b said :I heard the Messenger of Allah (May peace be upon him) explaining the verse “As for the youth his parents were people of Faith,” he was created infidel the day when he was created",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4707,
			"arabicnumber": 4707,
			"text": "Ibn ‘Abbas said :Ubayy b. Ka’b told me that the Messenger of Allah (May peace be upon him) said : Al-khidr saw a youth playing with boys. He took him by his head and uprooted it. Moses then said : Hast thou slain an innocent person who had slain none",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4708,
			"arabicnumber": 4708,
			"text": "‘Abd Allah b. Mas’ud said :The Messenger of Allah (May peace be upon him) who spoke the truth and whose word was belief told us the following : The constituents of one of you are collected for forty days in his mother’s womb, then they become a piece of congealed blood for a similar period, then they become a lump of flesh for a similar period. Then Allah sends to him an angel with four words who records his provision the period of his life, his deeds, and whether he will be miserable or blessed ; thereafter he breathes the spirit into him. One of you will do the deeds of those who go to Paradise so that there will be only a cubit between him and it or will be within a cubit, then what is decreed will overcome him so that he will do the deeds of those who go to Hell and will enter it; and one of you will do the deeds of those who go to hell, so that there will be only a cubit between him and it or will be within a cubit, then what is decreed will overcome him, so that he will do the deeds of those who go to Paradise and will enter it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4709,
			"arabicnumber": 4709,
			"text": "‘Imran b. Husain said :The Messenger of Allah (May peace be upon him) was asked : Is it known who are those who will go to paradise and those who will go to hell? He said : Yes. He asked : Then what is the good of doing anything by those who act? He replied : Everyone is helped to do for which he has been created",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4710,
			"arabicnumber": 4710,
			"text": "‘Umar reported the Prophet (May peace be upon him) was asked :Do not sit which those who believe in free will and do not address them before they address you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4711,
			"arabicnumber": 4711,
			"text": "Ibn ‘Abbas reported that when the Prophet (May peace be upon him) was questioned about the offspring of polytheists, he said :Allah knows best about what they were doing",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4712,
			"arabicnumber": 4712,
			"text": "‘A’ishah said :I said : Messenger of Allah (May peace be upon him) what happens to the offspring of believers ? He replied : They are joined to their parents. I asked : Messenger of Allah! Although they have done nothing ? He replied : Allah knows best what they were doing. I asked : what happens to the offspring of polytheists, Messenger of Allah ? he replied! They are joined to their parents. I asked : Although they have done nothing? He replied : Allah knows best what they were doing",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4713,
			"arabicnumber": 4713,
			"text": "‘A’ishah, mother of the believers, said :The Prophet (May peace be upon him) was invited to the funeral of a boy who belonged to the ANSAR and I said; Messenger of Allah! This one is blessed, for he has done no evil, nor has he known it. He replied : It may be otherwise, ‘A’ishah, for Allah created Paradise and created those who will go to it, and He created it for them when they were still in their father’s loins; and he created hell and created those who will go to it, and created it for them when they were still in their father’s loins",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4714,
			"arabicnumber": 4714,
			"text": "Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :Every child is born on Islam, but his parents make him a Jew and a Christian, just as a beast is born whole. Do you find some among them (born) maimed? The people asked : Messenger of Allah! What do you think about the one who died while he was young? He replied : Allah knows best what he was going to do",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4715,
			"arabicnumber": 4715,
			"text": "Abu Dawud said :Malik was asked : The heretics argue from this tradition against us. Malik said : Argue against them from its last part which goes. The people asked : What do you think about the one who died while he was young? He replied : Allah knows best what he was going to do",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4716,
			"arabicnumber": 4716,
			"text": "Explaining the tradition “Every child is a born on Islam”, Hammad b. Salamah said :In our opinion it means that covenant which Allah had taken in the loins of their fathers when He said : “Am I not your Lord? They said: Yes",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4717,
			"arabicnumber": 4717,
			"text": "‘Amir reported the Messenger of Allah (May peace be upon him) as saying :The woman who buries alive her new-born girl and the girl who is buried alive both will go to Hell. This tradition has also been transmitted by Ibn Mas’ud from the Prophet (May peace be upon him) to the same effect through a different chain of narrators",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4718,
			"arabicnumber": 4718,
			"text": "Anas said :A man asked : where is my father, Messenger of Allah? He replied! Your father is in Hell. When he turned his back, he said : My father and your father are in Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4719,
			"arabicnumber": 4719,
			"text": "Anas b. Malik reported the Messenger of Allah (May peace be upon him) as saying :The devil flows in a man like his blood",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4720,
			"arabicnumber": 4720,
			"text": "‘Umar b. al-Khattab reported the Messenger of Allah (May peace be upon him) as saying :Do not sit with those who believe in free will and do not address them before they address you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4721,
			"arabicnumber": 4721,
			"text": "Abu Hurairah reported to the Messenger of Allah( may peace be upon him) as sayings:People will continue to ask one another(questions) till this is pronounced: Allah created all things, but who created Allah ? Whoever comes across anything of that, he should say: I believe in Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4722,
			"arabicnumber": 4722,
			"text": "Narrated AbuHurayrah: I heard the Messenger of Allah (ﷺ) say: He then mentioned a tradition like it. This version adds: When they propound that, say: \"Say Allah is one. Allah is He to Whom men repair. He has not begotten and He has not been begotten, and no one is equal to Him.\" Then one should spit three times on his left side and seek refuge in Allah from Satan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4723,
			"arabicnumber": 4723,
			"text": "Narrated Al-Abbas ibn AbdulMuttalib: I was sitting in al-Batha with a company among whom the Messenger of Allah (ﷺ) was sitting, when a cloud passed above them. The Messenger of Allah (ﷺ) looked at it and said: What do you call this? They said: Sahab. He said: And muzn? They said: And muzn. He said: And anan? They said: And anan. AbuDawud said: I am not quite confident about the word anan. He asked: Do you know the distance between Heaven and Earth? They replied: We do not know. He then said: The distance between them is seventy-one, seventy-two, or seventy-three years. The heaven which is above it is at a similar distance (going on till he counted seven heavens). Above the seventh heaven there is a sea, the distance between whose surface and bottom is like that between one heaven and the next. Above that there are eight mountain goats the distance between whose hoofs and haunches is like the distance between one heaven and the next. Then Allah, the Blessed and the Exalted, is above that",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4724,
			"arabicnumber": 4724,
			"text": "The tradition mentioned above has also been transmitted by Simak through a different chain of narrators to the same effect",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4725,
			"arabicnumber": 4725,
			"text": "The tradition mentioned above has again been transmitted by Simak through a different chain of narrators and to the same effect as this lengthy tradition",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "Muhammad b. Jubair b. Mut’im said from his father on the authority of his grandfather:An A’rab(a nomadic Arab) came to the Messenger of Allah(ﷺ) and said: People suffering distress, the children are hungry, the crops are withered, and the animals are perished, so ask Allah to grant us rain, for we seek you as our intercessor with Allah, and Allah as intercessor with you. The Messenger of Allah(ﷺ) said: Woe to you: Do you know what you are saying? Then the Messenger of Allah(ﷺ) declared Allah’s glory and he continued declaring His glory till the effect of that was apparent in the faces of his Companions. He then said: Woe to you: Allah is not to be sought as intercessor with anyone. Allah’s state is greater than that. Woe to you! Do you know how great Allah is? His throne is above the heavens thus(indicating with his fingers like a dome over him), and it groans on account of Him as a saddle does because of the rider. Ibn Bashshar said in his version: Allah is above the throne, and the throne is above the heavens. He then mentioned the rest of the tradition. ‘Abd al-A’la, Ibn al- Muthana and Ibn Bashshar transmitted it from Ya’qub b. ‘Utbah and Jubair b. Muhammad b. Jubair from his father on the authority of his grandfather. Abu Dawud said: This tradition with the chain of Ahmad b. Sa’ad is sound. It has been approved by the body (of traditionists) , which includes Yahya b. Ma’in and ‘Ali b. al-Madani, and a group has transmitted it from Ibn Ishaq, as Ahmad also said. And so far as I have been informed ‘Abd al-A’la, Ibn al-Muthanna, and Ibn Bashshar had heard from the same copy(of the collection of tradition)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4727,
			"arabicnumber": 4727,
			"text": "Jabir b. ‘Abd Allah reported the Prophet (May peace be upon him) as saying :I have been permitted to tell about one of Allah’s angels who bears the throne that the distance between the lobe of his ear and his shoulder is a journey of seven hundred years",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4728,
			"arabicnumber": 4728,
			"text": "Abu Yunus Sulaim b. Jubair, client of Abu Hurairah, said :I heard Abu Hurairah recite this verse : “Allah doth command you to render back your trusts to those to whom they are due” up to “For Allah is he who heareth and seeth all things”. He said : I saw the Messenger of Allah (May peace be upon him) putting his thumb on his ear and finger on his eye. Abu Hurairah said : I saw the Messenger of Allah (May peace be upon him) reciting this verse and putting his fingers. Ibn Yunus said that al-Muqri said. “Allah hears and sees” means that Allah has the power of hearing and seeing. Abu Dawud said: This is a refutation of the Jahmiyyah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4729,
			"arabicnumber": 4729,
			"text": "Jarir b. ‘Abd Allah said :When we are were sitting with the Messenger of Allah (May peace be upon him) he looked at the moon on the night when it was full, that is, fourteenth, and said : You will see your Lord as you see this (moon) and have no doubts about seeing him. If, therefore, you can keep from being prevented from prayer before the sun rises and before it sets, do so. He then recited :”Celebrate the praise of your Lord before the rising of the sun and before its setting”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4730,
			"arabicnumber": 4730,
			"text": "Abu Hurairah said :The people asked : Messenger of Allah! Shall we see our lord, the Exalted, on the Day of resurrection? He replied : Do you feel any trouble in seeing the sun at noon when it is not in the cloud? They said: No. He asked : Do you feel any trouble in seeing the moon on the night when it is full and not in the cloud? They replied: No. He said: By him in whose hand my soul is, you will not feel any trouble in seeing him except as much as you feel in seeing any of them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4731,
			"arabicnumber": 4731,
			"text": "Narrated AbuRazin al-Uqayli: I asked: Messenger of Allah! will each one of us see his Lord? Ibn Mu'adh's version has: \"being alone with Him, on the Day of Resurrection? And what sign is there is His creation?\" He replied: AbuRazin! does each one of you not see the moon? Ibn Mu'adh's version has: \"on the night when it is full, being alone with it?\" Then the agreed version goes: I said: Yes. He said: Allah is more great. Ibn Mu'adh's version has: It is only part of Allah's creation, but Allah is more glorious and greater",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4732,
			"arabicnumber": 4732,
			"text": "‘Abd Allah b. ‘Umar reported the Messenger of Allah (May peace be upon him) as saying:Allah will fold the heavens an the day of Resurrection, then seizing them in His right hand he will say: I am the king. Where are the mighty men? Where are the proud men? He will then fold the earths and take them in his other hand (According to the version of Ibn al-Ala), and then say ; I am the King. Where are the mighty men? Where are the proud men?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4733,
			"arabicnumber": 4733,
			"text": "Abu Hurairah reported the Prophet (May peace be upon him) as saying; Our lord gets down every night to the heaven of this world when a third night remains and says :(Is there anyone) who prays to Me so that I may accept his prayer? (Is there anyone) who asks of Me so that I may give him? (Is there anyone) who asks for my forgiveness so that I may forgive him?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4734,
			"arabicnumber": 4734,
			"text": "Narrated Jabir ibn Abdullah: The Messenger of Allah (ﷺ) presented himself to the people at Arafat, saying: Is there any man who takes me to his people? The Quraysh have prevented me from preaching the word of my Lord",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4735,
			"arabicnumber": 4735,
			"text": "‘A’ishah said:I thought in my mind that my affair was far inferior to the speaking of Allah about me with a command that will be recited",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4736,
			"arabicnumber": 4736,
			"text": "‘Amir b. Shahr said :I was with the Negus when his son recited a verse of the Gospel. So I laughed. Thereupon he said : Do you laugh at the word of Allah, the Exalted?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4737,
			"arabicnumber": 4737,
			"text": "Ibn ‘abbas said :The Prophet (May peace be upon him) used to seek refuge in Allah for al-Hasan and al-husain, saying ; I seek refuge for both of you in the perfect words of Allah from every devil and every poisonous thing and from the evil eye which influences. He would then say; your father sought refuge in Allah by them for Ismail and Ishaq. Abu Dawud said; this is a proof of the fact that the Quran is not created",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4738,
			"arabicnumber": 4738,
			"text": "‘Abd Allah (b. Mas’ud) reported the Messenger of Allah (ﷺ) as saying:\"When Allah, the exalted, speaks to send revelation, the inhabitants of heaven hear the clanging of a bell from the heavens like a chain being dragged across a rock, and they swoon. They continue to remain like that until Jibril comes to them. When he comes to them, they recover and say: 'O Jibril, what did your Lord say?' He would say: 'The truth,' and they would say: 'The truth, the truth",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4739,
			"arabicnumber": 4739,
			"text": "Narrated Anas ibn Malik: The Prophet (ﷺ) said: My intercession will be for those of my people who have committed major sins",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4740,
			"arabicnumber": 4740,
			"text": "‘Imran b. Husain reported the Prophet(ﷺ) as saying:People will come forth from Hell by Muhammad’s intercession, will enter paradise and be named Jahannamis",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4741,
			"arabicnumber": 4741,
			"text": "Jabir said:I heard the Prophet(ﷺ) say: Those who go to Paradise will eat in it and drink",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4742,
			"arabicnumber": 4742,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Prophet (ﷺ) said: The trumpet (sur) which will be blown",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4743,
			"arabicnumber": 4743,
			"text": "Abu Hurairah reported the Apostle of AllSah(ﷺ) as saying:Every son of Adam will be devoured by the earth with the exception of the tail-bone from which he was created and from which he will be reconstituted",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4744,
			"arabicnumber": 4744,
			"text": "Narrated AbuHurayrah: The Messenger of Allah (ﷺ) said: When Allah created Paradise, He said to Gabriel: Go and look at it. He went and looked at it, then came and said: O my Lord! By Thy might, no one who hears of it will fail to enter it. He then surrounded it with disagreeable things, and said: Go and look at it, Gabriel. He went and looked at it, then came and said: O my Lord! By Thy might, I am afraid that no one will enter it. When Allah created Hell, He said: Go and look at it, Gabriel. He went and looked at it, then came and said: O my Lord! By Thy might, no one who hears of it will enter it. He then surrounded it with desirable things and said: Go and look at it, Gabriel. He went, looked at it, then came and said: O my Lord! By Thy might and power, I am afraid that no one will remain who does not enter it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4745,
			"arabicnumber": 4745,
			"text": "Ibn ‘Umar reported the Messenger of Allah(ﷺ) as saying:Before you there will be a pond the distance between whose sides is like that between Jarbah and Adhruh",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4746,
			"arabicnumber": 4746,
			"text": "Narrated Zayd ibn Arqam: We were with the Messenger of Allah (ﷺ). He said when we arrived at a halting place: You are not a hundred thousandth part of those who will come down to me at the pond. I (the narrator AbuHamzah) asked: What was your number that day? He replied: Seven or eight hundred",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4747,
			"arabicnumber": 4747,
			"text": "Anas b. Malik said:The Messenger of Allah(ﷺ) dozed for a short while and raised his smiling. He either said to them(people) or they said to him: Messenger of Allah! Why did you laugh? He said: A surah has been revealed to me just now, and then he recited: “In the name of Allah, Most Gracious. Most Merciful. To thee We have granted the fount (of abundance)” up to the end. When he recited, he asked: Do you know what al-kauthar is? They replied: Allah and his Apostle know best. He said: It is a river which my Lord, the Exalted, has promised me( to grant) in Paradise: there is abundance of good and upon it there is a pond which my people will approach on the Day of Resurrection. There are vessels as numerous as stars(in the sky)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4748,
			"arabicnumber": 4748,
			"text": "Narrated Anas ibn Malik: When the Prophet of Allah (ﷺ) was lifted to the heavens (for travelling) in Paradise, or as he said, a river whose banks were of transparent or hollowed pearls was presented to him. The angel who was with him struck it with his hand and took out musk. Muhammad (ﷺ) then asked the angel who was with him: What is this? He replied: It is al-Kawthar which Allah has given you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4749,
			"arabicnumber": 4749,
			"text": "AbdusSalam ibn AbuHazim AbuTalut said:I saw AbuBarzah who came to visit Ubaydullah ibn Ziyad. Then a man named Muslim who was there in the company mentioned it to me. When Ubaydullah saw him, he said: This Muhammadan [i.e. Companion of Muhammad (ﷺ)] of yours is short and fat. The old man (i.e. AbuBarzah) understood it. So he said: I did not think I would remain amongst a people who would criticize me for having had the company of Muhammad (ﷺ). Thereupon Ubaydullah said to him: The company of Muhammad (ﷺ) is a honour for you, not a disgrace. He added: I called for you to ask about the Haud (reservoir or cistern). Did you hear the Messenger of Allah (ﷺ) say anything about it? AbuBarzah said: Yes, not once, twice, thrice, four times or five times. Whoever disbelieves in it, may Allah not supply him with water from it. He then went away angrily",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4750,
			"arabicnumber": 4750,
			"text": "Al-Bara’ b. ‘Azib reported the Messenger of Allah(ﷺ) as saying:When a Muslim is questioned in the grave he testifies that there is no god but Allah and that Muhammad is Allah’s Apostle. That is verified by Allah’s words: “Allah establishes those who believe with the word that stands firm.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4751,
			"arabicnumber": 4751,
			"text": "Anas b. Malik said:The Messenger of Allah(ﷺ) entered the garden of the palm trees of Banu al-Najjar. He heard a voice and was terrified. He asked: Who are the people buried in these graves? The people replied: Messenger of Allah! These are some people who died in the pre-Islamic times. He said: Seek refuge in Allah from the punishment of the fire, and the trail of Antichrist. They asked: Why is it that, Messenger of Allah? He said: When a man is placed in his grave, an angel comes to him and says to him: Whom did you worship? Allah then guides him and he says: I worshiped Allah. He is then asked: What was your opinion of this man? He replies: He is Allah’s servant and His Apostle. He will not then be asked about anything else. He will then be taken to his abode in Hell and will be told: This was your abode in Hell, but Allah protected you and had mercy on you substituted for you an abode in Paradise for it. He will say: Leave me so that I may go and give glad tidings to my family. He will be told: Dwell. When an infidel is placed in his grave, an angel comes to him, reprimands him and asks him: Whom did you worship? He replies: I do not know. He will be told: You neither knew nor did you follow(the believers). He is then asked: What was your opinion on this man? He replies: I held the opinion that the other people held. He will then give him a blow between his ears with an iron hammer and will utter a shout which will be heard by all the creatures(near him) with the exception of men and jinn",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4752,
			"arabicnumber": 4752,
			"text": "The tradition mentioned above has also transmitted by ‘Abd al-Wahhab through a different chain of narrators in a similar manner. This version has :When a man is placed in his grave and his friends leave him, he hears the beat of their sandals. Then two angles come and speak to him. He then mentioned the rest of the tradition nearly similar to the previous one. It goes : As for the infidel and hypocrite they say to them. This version adds the word “hypocrite”. And he said : those who are near him will hear (his shout) with the exception of men and jinn",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4753,
			"arabicnumber": 4753,
			"text": "Narrated Al-Bara' ibn Azib: We went out with the Messenger of Allah (ﷺ) accompanying the bier of a man of the Ansar. When we reached his grave, it was not yet dug. So the Messenger of Allah (ﷺ) sat down and we also sat down around him as if birds were over our heads. He had in his hand a stick with which he was scratching the ground. He then raised his head and said: Seek refuge with Allah from the punishment in the grave. He said it twice or thrice. The version of Jabir adds here: He hears the beat of their sandals when they go back, and at that moment he is asked: O so and so! Who is your Lord, what is your religion, and who is your Prophet? Hannad's version says: Two angels will come to him, make him sit up and ask him: Who is your Lord? He will reply: My Lord is Allah. They will ask him: What is your religion? He will reply: My religion is Islam. They will ask him: What is your opinion about the man who was sent on a mission among you? He will reply: He is the Messenger of Allah (ﷺ). They will ask: Who made you aware of this? He will reply: I read Allah's Book, believed in it, and considered it true; which is verified by Allah's words: \"Allah's Book, believed in it, and considered it true, which is verified by Allah's words: \"Allah establishes those who believe with the word that stands firm in this world and the next.\" The agreed version reads: Then a crier will call from Heaven: My servant has spoken the truth, so spread a bed for him from Paradise, clothe him from Paradise, and open a door for him into Paradise. So some of its air and perfume will come to him, and a space will be made for him as far as the eye can see. He also mentioned the death of the infidel, saying: His spirit will be restored to his body, two angels will come to him, make him sit up and ask him: Who is your Lord? He will reply: Alas, alas! I do not know. They will ask him: What is your religion? He will reply: Alas, alas! I do not know. They will ask: Who was the man who was sent on a mission among you? He will reply: Alas, alas! I do not know. Then a crier will call from Heaven: He has lied, so spread a bed for him from Hell, clothe him from Hell, and open for him a door into Hell. Then some of its heat and pestilential wind will come to him, and his grave will be compressed, so that his ribs will be crushed together. Jabir's version adds: One who is blind and dumb will then be placed in charge of him, having a sledge-hammer such that if a mountain were struck with it, it would become dust. He will give him a blow with it which will be heard by everything between the east and the west except by men and jinn, and he will become dust. Then his spirit will be restored to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4754,
			"arabicnumber": 4754,
			"text": "The tradition mentioned above has also been transmitted by Al-Bara’ (b. ‘Azib) from the prophet (May peace be upon him) through a different chain of narrators is a similar way",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4755,
			"arabicnumber": 4755,
			"text": "‘A’ishah said that she thought of Hell and wept. The Messenger of Allah (May peace be upon him) asked her :What makes you weep ? She replied : I thought of Hell and wept. Will you remember your family on the 4th Day of resurrection ? the Messenger of Allah (May peace be upon him) said : There are three places where no one will remember anyone: at the scale until one knows whether his weight is light or heavy; at (the examination of) the book when one is commanded : Take and read Allah’s record, until he knows whether his book will be put into his right hand, or into his left hand, or behind his back ; and the path when it is placed across JAHANNAM",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4756,
			"arabicnumber": 4756,
			"text": "Narrated AbuUbaydah ibn al-Jarrah: I heard the Prophet (ﷺ) say: There has been no Prophet after Noah who has not warned his people about the antichrist (Dajjal), and I warn you of him. The Messenger of Allah (ﷺ) described him to us, saying: Perhaps some who have seen me and heard my words will live till his time. The people asked: Messenger of Allah! what will be the condition of our hearts on that day? Like what we are today? He replied: Or better",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4757,
			"arabicnumber": 4757,
			"text": "Ibn Umar reported:The Messenger of Allah (May peace be upon him) stood among the people and praised Allah in a way which is worthy of him, and mentioned the Antichrist (Dajjal), saying : I warn you of him, and there has been no prophet who has not warned his people about him, and Noah also warned his people about him. But I tell you about him a word which no Prophet had told his people : you should know that he will be blind in one eye, and Allah is not blind is one eye",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4758,
			"arabicnumber": 4758,
			"text": "Narrated AbuDharr: The Prophet (ﷺ) said: He who separates from the community within a span takes off the noose of Islam from his neck",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4759,
			"arabicnumber": 4759,
			"text": "Abu Dharr reported the Messenger of Allah (May peace be upon him) as saying :How will you deal with the rulers (imams) who appropriate to themselves this booty? I said : I swear by him who sent you with the truth that at that time I shall put my sword on my shoulder and smite with it till I meet you, or I join you. He said: shall I not guide you to something better than that? You must show endurance till you meet me",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4760,
			"arabicnumber": 4760,
			"text": "Umm Salamah, wife of the Prophet (May peace be upon him) is reported to have said:The Messenger of Allah (May peace be upon him) said: You will have commanders some of whom you will approve and some of whom you will disapprove. He who expresses disapproval with his tongue (Abu Dawud said : This is Hisham’s version) is guiltless; and he who feels disapproval in his heart, is safe, but he who is pleased and follows them. He was asked; shall we not kill them, Messenger of Allah? Abu Dawud’s version has : Shall we not fight with them? He replied : No, so long as they pray",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4761,
			"arabicnumber": 4761,
			"text": "The tradition mentioned above has also been transmitted by Umm Salamah through a different chain of narrators to the same effect. This version has :He who disapproves is guiltless, and he who disapproves is safe. Qatadah said : it means one who feels its disapproval in his heart, and one who expresses disapproval in his heart",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4762,
			"arabicnumber": 4762,
			"text": "‘Arfajah told that he heard the Messenger of Allah (May peace be upon him) as saying :various corruptions will arise in my community, so strike with sword the one who tries to cause separation in the matter of Muslims when they are united, whoever he be",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4763,
			"arabicnumber": 4763,
			"text": "‘Ubaidah (al-salman) said :‘Ali mentioned about the people of al Nahrawan, saying: Among them there will be a man with a defective hand or with a small hand. if you were not to overjoy. I would inform you of what Allah has promised (the reward for) those who will kill them at the tongue of Muhammad (May peace be upon him). I asked : Have you heard this from him? He replied : Yes, by the lord of the Ka’bah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4764,
			"arabicnumber": 4764,
			"text": "Abu sa’id al-khudri said :‘Ali sent some gold-mixed dust to the prophet (May peace be upon him). He divided it among the four : al-Aqra b. Habis al-Hanzall and then al-Mujashi, uyainah b. Badr al-fazari, zaid al-khail al-Ta’l, next to one of Banu nabhan, and ‘Alqamah b. ‘Ulathat al-Amiri (in general), next to one of Banu kulaib. The Quraish and the ansar became angry and said : He is giving to the chiefs of the people of Najd and leaving us. He said : I am giving them for reconciliation of their hearts. Then a man with deep-seated eyes, high cheek-bones, a projecting brow, a thick beard and a shaven head came forward and said: For Allah, Muhammad! He said : Who will obey Allah if I disobey Him? Allah entrusts me with power over the inhabitants of the earth, but you do not. A man asked to be allowed to kill him and I think he was Khalid b. al-Walid but he prevented him. Then when the man turned away, he said: From this one’s stock there will be people who recite the Quran, but it will not pass down their throats. They will sever from Islam and leave the worshippers of Idols alone; but if I live up to their time I shall certainly kill them as 'Ad were killed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4765,
			"arabicnumber": 4765,
			"text": "Narrated AbuSa'id al-Khudri ; Anas ibn Malik: The Prophet (ﷺ) said: Soon there will appear disagreement and dissension in my people; there will be people who will be good in speech and bad in work. They recite the Qur'an, but it does not pass their collar-bones. They will swerve from the religion as an animal goes through the animal shot at. They will not return to it till the arrow comes back to its notch. They are worst of the people and animals. Happy is the one who kills them and they kill him. They call to the book of Allah, but they have nothing to do with it. He who fights against them will be nearer to Allah than them (the rest of the people). The people asked: What is their sign? He replied: They shave the head",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4766,
			"arabicnumber": 4766,
			"text": "The tradition mentioned above has also been transmitted by Anas through a different chain of narrators in a similar manner. This version adds; Their sign is shaving the head and eliminating the hair. If you see them, kill them. Abu Dawud said:Tasmid means uprooting the hair",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4767,
			"arabicnumber": 4767,
			"text": "‘Ali said:When I mention a tradition to you from the Messenger of Allah (May peace be upon him), it is dearer to me that I fall from the heaven than I lie on him. But when I talk to you about matters between me and you, then war is a deception. I heard the Messenger of Allah (May peace be upon him) say: Towards the end of the time there will be people who are young in age and from Islam as an arrow goes through the animal aimed at, and their faith will not pass their throats. Wherever you meet them kill them, for their killing will bring a reward for him who kills them on the day of Resurrection",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4768,
			"arabicnumber": 4768,
			"text": "Salamah b. Kuhail said:Zaid b. Wahb al-Juhani told us that he was in the army which proceeded to (fight with) the Khawarij in the company of `Ali. `Ali then said: O people! I heard the Messenger of Allah (ﷺ) say: there will appear from among my community people who recite the Qur'an, and your recitation has no comparison with their recitation, and your prayer has no comparison with their prayer, and your fasts have no comparison with their fasts. They will recite the Qur'an thinking that it is beneficial for them, while it is harmful for them. Their prayer will not pass their collar-bones. They will swerve from Islam as an arrow goes through the animal shot at. If the army that is approaching them knows what (reward) has been decided for them at the tongue of their Prophet (ﷺ), they would leave (other good) activities. The sign of that is that among them there will be a man who has an upper arm, but not hand; on his upper arm there will be something like the nipple of a female breast, having white hair thereon. Will you go to Mu`awiyah and the people of Syria, and leave them behind among your children and property? I swear by Allah, I hope these are the same people, for they shed the blood unlawfully, and attacked the cattle of the people so go on in the name of Allah. Salamah b. Kuhail said: Zaid b. Wahb then informed me of all the halting places one by one, (saying): Until we passed a bridge. When we fought with each other, `Abd Allah b. Wahb al-Rasibi, who was the leader of the Khawarij, said to them: Throw away the lances and pull out the swords from their sheaths, for I am afraid they will adjure you as they had adjured on the day of Harura. So they threw away their lances and pulled out their swords, and the people pierced them with their lances. They were killed (lying one on the other). On that day only two persons of the partisans (of `Ali) were afflicted. `Ali said: Search for the man with the crippled hand. But they could not find him. Then `Ali got up himself and went to the people who had been killed and were lying on one another. He said: Take them out. They found him just near the ground. So he shouted: Allah is Most Great! He said: Allah spoke the truth, and His Apostle has conveyed. `Ubaidat al-Salmani stood up to him, saying: Commander of the Faithful! Have you heard it from the Messenger of Allah (ﷺ)? He said: Yes, by him, there is no God but He. He put to swear thrice and he swore",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4769,
			"arabicnumber": 4769,
			"text": "‘Ali said:Search for the man with crippled hand. He then mentioned the rest of the tradition. This version has: They took him out from beneath the slain in the dust. Abu al-wadi said: As if I am looking at an Abyssinian with a shirt on him. He had one of his hands like the nipple of the female breast, having hair on it like the hair on the tail of the jerboa",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4770,
			"arabicnumber": 4770,
			"text": "Abu Maryam said:This man with the crippled hand was on that day with us in the mosque. We would sit with him by day and by night, and he was a poor man. I saw him attending the meals of ‘Ali (ra) which he took with the people, and I clothed him with a cloak of mine. Abu Maryam said: The man with the crippled hand was called Nafi` Dhu al-Thadyah (Nafi`, man of nipple). He had in his hand something like a female breast with a nipple at it ends like the nipple of the female breast. If had some hair on it like the whiskers of cat. Abu Dawud said: He was known among the people by the name of Harqus",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4771,
			"arabicnumber": 4771,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Prophet (ﷺ) said: If the property of anyone is designed to be taken away without any right and he fights and is killed, he is a martyr",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4772,
			"arabicnumber": 4772,
			"text": "Narrated Sa'id ibn Zayd: The Prophet (ﷺ) said: He who is killed while protecting his property is a martyr, and he who is killed while defending his family, or his blood, or his religion is a martyr",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 177
			}
		}
	]
}