{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"8": "Prayer (Kitab Al-Salat): Detailed Injunctions about Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "Narrated Ali ibn AbuTalib: The Prophet (ﷺ) said: Allah is single (witr) and loves what is single, so observe the witr, you who follow the Qur'an",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "The above mentioned tradition has also been narrated by 'Abd Allah (b. Mas'ud) through a different chain of narrators to the same effect. This version adds:A bedouin said: What are you saying ? He replied: This is neither for you, nor for your companions",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "Narrated Kharijah ibn Hudhafah al-Adawi: The Messenger of Allah (ﷺ) came out to us and said: Allah the Exalted has given you an extra prayer which is better for you then the red camels (i.e. high breed camels). This is the witr which Allah has appointed for you between the night prayer and the daybreak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "Narrated Buraydah ibn al-Hasib: I heard the Messenger of Allah (ﷺ) say: The witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "Narrated Ubadah ibn as-Samit: Ibn Muhayriz said: A man from Banu Kinanah, named al-Makhdaji, heard a person called AbuMuhammad in Syria, saying: The witr is a duty (wajib). Al-Makhdaji said: So I went to Ubadah ibn as-Samit and informed him. Ubadah said: AbuMuhammad told a lie. I heard the Messenger of Allah (ﷺ) say: There are five prayers which Allah has prescribed on His servants. If anyone offers them, not losing any of them, and not treating them lightly, Allah guarantees that He will admit him to Paradise. If anyone does not offer them, Allah does not take any responsibility for such a person. He may either punish him or admit him to Paradise",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "Ibn 'Umar said:A man who lived in the desert asked the Messenger of Allah (ﷺ) about the prayer at night. He made a sign with his two fingers-in this way in pairs. The witr consists of one rak'ah towards the end in night",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "Narrated AbuAyyub al-Ansari: The Prophet (ﷺ) said: The witr is a duty for every Muslim so if anyone wishes to observe it with five rak'ahs, he may do so; if anyone wishes to observe it with three, he may do so, and if anyone wishes to observe it with one, he may do so",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "Narrated Ubayy ibn Ka'b: The Messenger of Allah (ﷺ) used to observe witr with (reciting) \"Glorify the name of thy Lord, the most High\" (Surah 87), \"Say O disbelievers\" (Surah 109), and \"Say, He is Allah, the One, Allah, the eternally besought of all\" (112)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "Narrated Aisha, Ummul Mu'minin: AbdulAziz ibn Jurayj said: I asked Aisha, mother of the believers: With which (surah) the Messenger of Allah (ﷺ) used to observe witr? (She reported same as in the Hadith of Ubayy ibn Ka'b, No. 1418) This version adds: In the third rak'ah he would recite: \"Say, He is Allah, the One\" (Surah 112), and \"Say, I seek refuge in the Lord of daybreak\" (Surah 113), and \"Say, I seek refuge in the Lord of mankind\" (Surah 114)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "Narrated Al-Hasan ibn Ali: The Messenger of Allah (ﷺ) taught me some words that I say during the witr. (The version of Ibn Jawwas has: I say them in the supplication of the witr.) They were: \"O Allah, guide me among those Thou hast guided, grant me security among those Thou hast granted security, take me into Thy charge among those Thou hast taken into Thy charge, bless me in what Thou hast given, guard me from the evil of what Thou hast decreed, for Thou dost decree, and nothing is decreed for Thee. He whom Thou befriendest is not humbled. Blessed and Exalted art Thou, our Lord",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "The aforesaid tradition has been transmitted by Abu Ishaq with the same chain and to the same effect. In the last of this tradition he said:The version has the words: \"He would recite the supplication of the witr.\" He did not mention the words: \"I say them in the witr.\" Abu Dawud said: The name of Abu al-Hawra' is Rabi'ah b. Shaiban",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "Narrated Ali ibn AbuTalib: The Messenger of Allah (ﷺ) used to say at the end of his witr: \"O Allah, I seek refuge in Thy good pleasure from Thy anger, and in Thy forgiveness from Thy punishment, and I seek refuge in Thy mercy from Thy wrath. I cannot reckon the praise due to Thee. Thou art as Thou hast praised Thyself.\" Abu Dawud said: Hisham is the earliest teacher of Hammad. Yahya b. Ma'in said: No one is reported to have narrated traditions form him except Hammad b. Salamah. Abu Dawud said: Ubayy b. Ka'b said: The Messenger of Allah (ﷺ) recited supplication in the witr before bowing. Abu Dawud said: This tradition has also been narrated by 'Isa b. Yunus through a different chain of narrators from Ubayy b. Ka'b. He also narrated it through a different chain of narrators on the authority of Ubayy b. Ka'b that the Messenger of Allah (ﷺ) recited the supplication in the witr before bowing. Abu Dawud said: The chain of narrators of the tradition of Sa'id from Qatadah goes: Yazid b. Zurai' narrated from Sa'id, from Qatadah, from 'Azrah, from Sa'id b. 'Abd al-Rahman b. Abza, on the authority of his father, from the Prophet (ﷺ). This version does not mention the supplication and the name of Ubayy. This tradition has also been narrated by 'Abd al-A'la and Muhammad b. Bishr al-'Abdi. He heard the traditions from 'Isa b. Yunus at Kufah. They did not mention the supplication in their version. This tradition has also been narrated by Hisham al-Dastuwa'i and Shu'bah from Qatadah. They did not mention the supplication in their version. The tradition of Zubaid has been narrated by Sulaiman al-A'mash, Shu'bah, 'Abd al-Malik b. Abi Sulaiman, and Jarir b. Hazim; all of them narrated on the authority of Zubaid. None of them mention the supplication in his version, except in the tradition transmitted by Hafs b. Ghiyath from Mis'ar from Zubaid; he narrated in his version that he (the Prophet) recited supplication before bowing. Abu Dawud said: This version of tradition is not well know. There is doubt that Hafs might have narrated this tradition from some other narrator than Mis'ar. Abu Dawud said: It is reported that Ubayy (b. Ka'b) used to recited the supplication )in the witr) in the second half of Ramadan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "Muhammad reported on the authority of some of his teachers that Ubayy b. Ka'b led them in prayer during Ramadan. He used to recite the supplication (in the witr) during the second half of Ramadan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "Narrated Ubayy ibn Ka'b: Al-Hasan reported: Umar ibn al-Khattab gathered the people (in tarawih prayer) behind Ubayy ibn Ka'b (who led them). He used to lead them for twenty days (during Ramadan, and would not recite the supplication except in the second half of it (i.e. Ramadan). When the last ten days remained, he kept away from them, and prayed in his house. They used to say: Ubayy ran away. Abu Dawud said: This tradition shows that whatever has been reported about the recitation of the supplication is not tenable. Moreover, these two traditions from Ubayy b. Ka'b indicate that another tradition which tells that the Prophet (ﷺ) recited the supplication in the witr is weak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "Narrated Ubayy ibn Ka'b: When the Messenger of Allah (ﷺ) offered salutation in the witr prayer, he said: Glorify be to the king most holy",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "Narrated AbuSa'id al-Khudri: The Prophet (ﷺ) said: If anyone oversleeps and misses the witr, or forgets it, he should pray when he remembers",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "Abu Hurairah said:My friend (i.e. the Prophet) instructed me to observe three practices that I do not leave while traveling nor while resident, to pray two rak`ahs in the forenoon, to fast three days every month and not to sleep but after observing the witr",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "Abu Al-Darda' said:My friend (i.e. the Prophet) instructed me to observe three practices which I never leave: he instructed me to fast three days every month, and not to sleep but after observing the witr, and to observe supererogatory prayer in the forenoon while traveling and while resident",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "Narrated AbuQatadah: The Prophet (ﷺ) asked AbuBakr: When do you observe the witr? He replied: I observe the witr prayer in the early hours of the night. The Prophet (ﷺ) asked Umar: When do you observe the witr? He replied: At the end of the night. He then said to AbuBakr: This has followed it with care; and he said to Umar: He has followed it with strength",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "Masruq said:I asked 'Aishah: When would the Messenger of Allah (ﷺ) observe the witr prayer ? She replied: Any time he observed the witr, sometimes in the early hours of the night, sometimes at midnight and sometimes towards the end of it. But he used to observe the witr just before the dawn when he died",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "Ibn 'Umar reported the Prophet (ﷺ) as saying:Make haste to observe the witr prayer before morning",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "Abd Allah b. Abu Qais said:I asked 'Aishah about the witr observes by the Messenger of Allah (ﷺ). She replied: Sometime he observed the witr prayer in the early hours of the night, sometimes he observed it at the end of it. I asked: How did he recite the Qur'an ? Did he recite the Qur'an quietly or loudly ? She replied: He did it in any way. Sometimes he recited quietly and sometimes loudly, sometimes he took bath and then slept and sometimes he performed ablution and then slept. Abu Dawud said: The narrators other than Qutaibah said: This refer to his bath due to sexual defilement",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "Ibn 'Umar reported the Prophet (ﷺ) as suing:Make the last of your prayer at night a witr",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "Narrated Talq ibn Ali: Qays ibn Talq said: Talq ibn Ali visited us on a certain day during Ramadan. He remained with us till evening and broke fast with us. He then stood up and led us in the witr prayer. He then went to his mosque and led them in prayer. When the witr remained, he put forward another man and said: Lead your companions in the witr prayer, for I heard the Messenger of Allah (ﷺ) as saying: There are no two witrs during one night",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "Abu Hurairah said:By Allah, I shall offer prayer like that of the Messenger of Allah (ﷺ). The narrator said: Abu Hurairah used to recite the supplication in the last rak'ah of the noon, night and dawn prayers. He would supplicate for the believers and curse the disbelievers",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "Al-Bara' said:The Prophet (ﷺ) used to recite the supplication in the dawn prayer. The version of Ibn Mu'adh has the words: \"sunset prayer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "Abu Hurairah said:The Messenger of Allah (ﷺ) recited the supplication in the night prayer for a month. He said (in his supplication): O Allah, rescue al-Walid b. al-Walid, rescue Salamah b. Hisham, rescue the weak believers; O Allah, trample severely on Mudar; O Allah, cause them a famine like that of Joseph. Abu Hurairah said: One morning the Messenger of Allah (ﷺ) id not make supplication for them. So I told him about it. He said: You dod not see that they have come (back)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) recited the supplication (Qunut) daily for a month at the noon, afternoon, sunset, night and morning prayers. When he said: \"Allah listens to him who praises Him\" in the last rak'ah, invoking a curse on some clans of Banu Sulaym, Ri'l, Dhakwan and Usayyah, and those who were standing behind him said: Amen",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "Muhammad reported:Anas b. Malik was asked whether the Messenger of Allah (ﷺ) had recited supplication in the dawn prayer. He replied: Yes. He was again asked whether before bowing or after bowing. He said after bowing. This version of Musaddad adds the words: \"For a short period",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "Anas b. Malik said:The Prophet (ﷺ) recited the supplication for a month (in prayer) and then gave it up",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "Narrated Someone who prayed with the Prophet: Muhammad ibn Sirin said: Someone who prayed the morning prayer along with the Prophet (ﷺ) narrated to me: When he raised his head after the second rak'ah, he remained standing for a short while",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "Zaid b. Thabit said:The Messenger of Allah (ﷺ) built a chamber in the mosque. He used to come out at night and pray there. They (the people) also prayed along with him. They would come (to prayer) every night. If on any night the Messenger of Allah (ﷺ) did not come out, they would cough, raise their voices and throw pebbles and sand on his door. The Messenger of Allah (ﷺ) came out to time in anger and said: O People, you kept on doing this till I thought that it will be prescribed for you. Offer your prayers in your houses, for a man's prayer is better in his house except obligatory prayer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "Ibn 'Umar reported the Messenger of Allah (ﷺ) as saying:Some offer prayer in your houses; do not make them graves",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "Abd Allah b. Habshi al-Khath'ami said:The Prophet (ﷺ) was asked: Which of the actions is better ? He replied: Standing for long time (in prayer). He was again asked: Which alms is better ? He replied: The alms given by a man possessing small property acquired by his labour",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: May Allah show mercy to a man who gets up during the night and prays, who wakens his wife and she prays; if she refuses, he sprinkles water on her face. May Allah show mercy to a woman who gets up during the night and prays, who wakens her husband and he prays; if he refuses she sprinkles water on his face",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "Narrated AbuSa'id ; AbuHurayrah: The Prophet (ﷺ) said: When a man himself wakes at night and wakens his wife and they pray two rak'ahs together, they are recorded among the men and women who make much mention of Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "Uthman reported the Prophet (ﷺ) as saying:The best among you is he who learns and teaches the Qur'an",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "Mu'adh al-Juhani reported the Messenger of Allah (ﷺ) as saying:If anyone recites the Qur'an and acts according to its content, on the Day of Judgement his parents will be given to wear a crown whose light is better than the light of the sun in the dwellings of this world if it were among you. So what do you think of him who acts according to this ?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "Aishah reported the Prophet (ﷺ) as saying:One who is skilled in the Qur'an is associated with the noble, upright recording angels, and he who falters when he recites the Qur'an and finds it difficult for him will have a double reward",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": 1455,
			"text": "Abu Hurairah reported the Prophet (ﷺ) as saying:No people get together in a house of the houses of Allah (i.e. a mosque), reciting the Book of Allah, and learning it together among themselves, but calmness (sakinah) comes down to them, (Divine) mercy covers them (from above), and the angels surround them, and Allah makes a mention of them among those who are with Him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1456,
			"arabicnumber": 1456,
			"text": "Uqbah b. 'Amir al-Juhani said:When we were in the Suffah, the Messenger of Allah (ﷺ) asked: Which of you would like to go out every morning to Buthan or Al-'Aqiq and bring two large humped and fat she-camels without being guilty of sin and severing ties of relationship ? They (the people) said: Messenger of Allah, we would all like that. He said: If any one of you goes out in the morning to the mosque and learns two verses of the Book of Allah, the Exalted, it is better for him than two she-camels, and three verses are better for him than three she-camels, and so on than their numbers in camels",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": 1457,
			"text": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:All praise be to Allah, the Lord of the Universe\" (1) is the epitome or basis of the Qur'an, the epitome or basis of the Book, and the seven oft-repeated verses",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": 1458,
			"text": "Abu Sa'id b. al-Mu'alla said that when he was praying the Prophet (ﷺ) passed by him and he called him. He said:I prayed ant then I came to him. He asked: What prevented you from answering me ? He replied: I was praying. He said: Has not Allah said: \"O you who believe, respond to Allah and the Apostle when he calls you to that which gives you life ? (8:24) Let me teach you the greatest surah from the Qur'an or in the Qur'an (the narrator Khalid doubted) before I leave the mosque. I said: (I shall memorize) your saying. He said: It is: \"Praise be to Allah, the Lord of the Universe\" which is the seven oft-repeated verses, and the mighty Qur'an",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) was given seven repeated long surahs, while Moses was given six, When he threw the tablets, two of them were withdrawn and four remained",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "Ubayy b. Ka'b said:The Messenger of Allah (ﷺ) said: Abu al-Mundhir, which verse of Allah's Book that you have is creates ? I replied: Allah and His Apostle know best. He said: Abu al-Mundhir, which verse of Allah's that you have is greatest ? I said: Allah, there is no god but He, the Living, the Eternal. Thereupon he struck me on the beast and said: May knowledge be pleasant for you, Abu al-Mundhir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "Abu Sa'id al-Khudri said:A man heard another man reciting \"Say, He is Allah, One\" He was repeating it. When the next morning came, he went to the Messenger of Allah (ﷺ) and mentioned to him. The man tool it (this surah) as a small one. The Prophet (ﷺ) said: By Him in Whose Hand is my life, it is equivalent to a third of the Qur'an",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "Narrated Uqbah ibn Amir: I was driving the she-camel of the Messenger of Allah (ﷺ) during a journey. He said to me: Uqbah, should I not teach you two best surahs ever recited? He then taught me: \"Say, I seek refuge in the Lord of the dawn,\" and \"Say, I seek refuge in the Lord of men.\" He did not see me much pleased (by these two surahs). When he alighted for prayer, he led the people in the morning prayer and recited them in prayer. When the Messenger of Allah (ﷺ) finished his prayer, he turned to me and said: O Uqbah, how did you see",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "Narrated Uqbah ibn Amir: White I was travelling with the Messenger of Allah (ﷺ) between al-Juhfah and al-Abwa', a wind and intense darkness enveloped us, whereupon the Messenger of Allah (ﷺ) began to seek refuge in Allah, reciting: \"I seek refuge in the Lord of the dawn,\" and \"I seek refuge in the Lord of men.\" He then said: Uqbah, use them when seeking refuge in Allah, for no one can use anything to compare with them for the purpose. Uqbah added: I heard him reciting them when he led the people in prayer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Messenger of Allah (ﷺ) said: One who was devoted to the Qur'an will be told to recite, ascend and recite carefully as he recited carefully when he was in the world, for he will reach his abode when he comes to the last verse he recites",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "Qatadah said:I asked Anas about the recitation of the Qur'an by the Prophet (ﷺ). He said: He used to express all the long accents clearly",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "Narrated Umm Salamah, Ummul Mu'minin: Ya'la ibn Mumallak said that he asked Umm Salamah about the recitation and prayer of the Messenger of Allah (ﷺ). She said: What have you to do with his prayer? He would pray, then sleep as long as he had prayed, till morning. She then described his recitation and did so with an exposition word by word",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "Abd Allah b. Mughaffal said:On the day of the Conquest of Mecca I saw the Messenger of Allah (ﷺ) riding his she-camel reciting Surah al-Fath repeating each verse several times",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "Narrated Al-Bara' ibn Azib: The Prophet (ﷺ) said: Beautify the Qur'an with your voices",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "Narrated Sa'd ibn AbuWaqqas: (The narrator Qutaibah said: This tradition has been narrated by Sa'id b. Abu Sa'id in my collection): The Messenger of Allah (ﷺ) said: He who does not chant the Qur'an is not one of us",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "This tradition has also been transmitted by Sa'd (b. Abi Waqqas) from the Prophet (ﷺ) in a similar manner through a different chain of narrators",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "Narrated AbuLubabah: Ubaydullah ibn Yazid said: AbuLubabah passed by us and we followed him till he entered his house, and we also entered it. There was a man in a rusty house and in shabby condition. I heard him say: I heard the Messenger of Allah (ﷺ) say: He is not one of us who does not chant the Qur'an. I (the narrator AbdulJabbar) said to Ibn AbuMulaykah: AbuMuhammad, what do you think if a person does not have pleasant voice? He said: He should recite with pleasant voice as much as possible",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "Waki' and Ibn 'Uyainah said (explaining the meaning of taghanni):This means that the Qur'an makes a man neglect all other things, and be content with it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:Allah has not listened to anything as He does to a Prophet chanting the Qur'an with a loud voice",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "Narrated Sa'd ibn Ubadah: The Prophet (ﷺ) said: No man recites the Qur'an, then forgets it, but will meet Allah on the Day of Judgment in a maimed condition (or empty-handed, or with no excuse)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "Umar b. al-Khattab said:I heard Hisham b. Hakim (b. Hizam) reciting Surah al-Furqan in a different manner from my way of reciting, and the Messenger of Allah (ﷺ) had taught me to recite it. I nearly spoke sharply to him, but I delayed till he had finished. Then I caught his cloak at the neck, and I brought him to the Messenger of Allah (ﷺ). I said: Messenger of Allah, I heard this man reciting Surah al-Furqan in a manner different from that in which you taught me to recite it. The Messenger of Allah (ﷺ) the told him to recite it. He then recited in the manner I heard him recite. The Messenger of Allah (ﷺ) said: Thus was it sent down. He then said to me: Recite, I recited (it). He then said: Thus was it sent down. He said: The Qur'an was sent down in seven modes of reading, so recite according to what comes most easily",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "Al-Zuhri said:These modes of reading aimed at the same point, not different in respect of lawful and unlawful",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "Ubayy b. Ka'b reported:The Prophet (ﷺ) said: \"Ubayy, I was asked to recite the Qur'an and I was asked: 'In one mode or two modes?' The angel that accompanied me said: 'Say, in two modes', I said: 'In two modes', I was asked again: 'In two or three modes'. The matter reached up to seven modes. He then said: 'Each mode is sufficiently health-giving, whether you utter 'all-hearing and all-knowing' or instead 'all-powerful and all-wise'. This is valid until you finish the verse indicating punishment on mercy and finish the verse indicating mercy on punishment",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "Ubayy b. Ka'b said:The Prophet (ﷺ) was present at the pool of Banu Ghifar, Gabriel came to him and said: \"Allah has commanded you to make your community read (the Qur'an) in one harf. He (the Prophet) said: 'I beg Allah His pardon and forgiveness; my community has not strength to do so'. He then came for the second time and told him the same thing till he reached up to seven harfs. Finally, he said: 'Allah has commanded you to make your community read (the Qur'an) in seven harfs; in whichever mode they read, that will be correct",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "Narrated An-Nu'man ibn Bashir: The Prophet (ﷺ) said: Supplication (du'a') is itself the worship. (He then recited:) \"And your Lord said: Call on Me, I will answer you\" (xI.60)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "Narrated Sa'd ibn AbuWaqqas: Ibn Sa'd said: My father (Sa'd ibn AbuWaqqas) heard me say: O Allah, I ask Thee for Paradise, its blessings, its pleasure and such-and-such, and such-and-such; I seek refuge in Thee from Hell, from its chains, from its collars, and from such-and-such, and from such-and-such. He said: I heard the Messenger of Allah (ﷺ) say: There will be people who will exaggerate in supplication. You should not be one of them. If you are granted Paradise, you will be granted all what is good therein; if you are protected from Hell, you will be protected from what is evil therein",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "Narrated Fudalah ibn Ubayd,: The Messenger of Allah (ﷺ) heard a person supplicating during prayer. He did not mention the greatness of Allah, nor did he invoke blessings on the Prophet (ﷺ). The Messenger of Allah (ﷺ) said: He made haste. He then called him and said either to him or to any other person: If any of you prays, he should mention the exaltation of his Lord in the beginning and praise Him; he should then invoke blessings on the Prophet (ﷺ); thereafter he should supplicate Allah for anything he wishes",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "Aishah said:The Messenger of Allah (ﷺ) liked comprehensive supplication and abandoned other kinds",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:\"One of you should not say (in his supplication): O Allah, forgive me if You please, show mercy to me if You please.' Rather, be firm in your asking, for no one can force Him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:\"One of you is granted an answer (to his supplication) provided he does not say: 'I prayed but I was not granted an answer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "Narrated Abdullah ibn Abbas: The Prophet (ﷺ) said: Do not cover the walls. He who sees the letter of his brother without his permission, sees Hell-fire. Supplicate Allah with the palms of your hands; do not supplicate Him with their backs upwards. When you finish supplication, wipe your faces with them. Abu Dawud said: This tradition has been transmitted through a different chains by Muhammad b. Ka'b; all of them are weak. The chain I have narrated is best of them; but it is also weak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "Narrated Malik ibn Yasar as-Sakuni, al-Awfi: The Prophet (ﷺ) said: When you make requests to Allah, do so with the palms of your hands, and not backs, upwards. Abu Dawud said: The narrator Sulaiman b. 'Abd al-Hamid said: according to us Malik b. Yasar was a Companion of the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "Narrated Anas ibn Malik: I saw the Messenger of Allah (ﷺ) supplicating Allah in this manner with the palms of his hands and also with their backs upwards",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "Narrated Salman al-Farsi: The Prophet (ﷺ) said: Your Lord is munificent and generous, and is ashamed to turn away empty the hands of His servant when he raises them to Him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": 1489,
			"text": "Narrated Abdullah ibn Abbas: Ikrimah quoted Ibn Abbas as saying: When asking for something you should raise your hands opposite to your shoulders; when asking for forgiveness you should point with one finger; and when making an earnest supplication you should spread out both your hands",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": 1490,
			"text": "In another version Ibn 'Abbas said:Earnest supplication should be made like this: he raised his hand and made his palms in the direction of his face",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "The above mentioned tradition has also been transmitted in a similar manner by Ibn 'Abbas from the Messenger of Allah (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": 1492,
			"text": "Narrated Yazid ibn Sa'id al-Kindi: When the Prophet (ﷺ) made supplication (to Allah) he would raise his hands and wipe his face with his hands",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "Narrated Buraydah ibn al-Hasib: The Messenger of Allah (ﷺ) heard a man saying: O Allah, I ask Thee, I bear witness that there is no god but Thou, the One, He to Whom men repair, Who has not begotten, and has not been begotten, and to Whom no one is equal, and he said: You have supplicated Allah using His Greatest Name, when asked with this name He gives, and when supplicated by this name he answers",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "The aforesaid tradition has been transmitted through a different chain of narrators by Malik b. Mighwal. This verso adds:\"He has asked Allah using His Greatest Name",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "Narrated Anas ibn Malik: I was sitting with the Messenger of Allah (ﷺ) and a man was offering prayer. He then made supplication: O Allah, I ask Thee by virtue of the fact that praise is due to Thee, there is no deity but Thou, Who showest favour and beneficence, the Originator of the Heavens and the earth, O Lord of Majesty and Splendour, O Living One, O Eternal One. The Prophet (ﷺ) then said: He has supplicated Allah using His Greatest Name, when supplicated by this name, He answers, and when asked by this name He gives",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": 1496,
			"text": "Asma daughter of Yazid reported the Prophet (ﷺ) as saying:\"Allah's Greatest Names is in these two verses: \"And your Ilaah (God) is One Ilaah (God), none has the right to be worshipped but He, the Ever-Merciful, the Mercy-Giving' and the beginning of Surah Al 'Imran, \"A.L.M Allah, there is no deity but He, the Living, the Eternal",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "Narrated Aisha, Ummul Mu'minin: Ata' said: The quilt of Aisha was stolen. She began to curse the person who had stolen it. The Prophet (ﷺ) began to tell her: Do not lighten him. Abu Dawud said: The meaning of the Arabic words la tasbikhi 'anhu means \"do not lessen him or lighten him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "Narrated Umar ibn al-Khattab: I sought permission of the Prophet (ﷺ) to perform umrah. He gave me permission and said: My younger brother, do not forget me in your supplication. He (Umar) said: He told me a word that pleased me so much so that I would not have been pleased if I were given the whole world. The narrator Shu'bah said: I then met Asim at Medina. He narrated to me this tradition and reported the wordings: \"My younger brother, share me in your supplication",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "Narrated Sa'd ibn AbuWaqqas: The Prophet (ﷺ) passed by me while I was supplicating by pointing with two fingers of mine. He said: Point with one finger; point with one finger. He then himself pointed with the forefinger",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "Narrated Sa'd ibn AbuWaqqas: Once Sa'd, with the Messenger of Allah (ﷺ), visited a woman in front of whom were some date-stones or pebbles which she was using as a rosary to glorify Allah. He (the Prophet) said: I tell you something which would be easier (or more excellent) for you than that. He said (it consisted of saying): \"Glory be to Allah\" as many times as the number of that which He has created in Heaven; \"Glory be to Allah\" as many times as the number of that which He has created on Earth; \"Glory be to Allah\" as many times as the number of that which He has created between them; \"Glory be to Allah\" as many times as the number of that which He is creating; \"Allah is most great\" a similar number of times; \"Praise (be to Allah)\" a similar number of times; and \"There is no god but Allah\" a similar number of times; \"There is no might and no power except in Allah\" a similar number of times",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "Narrated Yusayrah, mother of Yasir: The Prophet (ﷺ) commanded them (the women emigrants) to be regular (in remembering Allah by saying): \"Allah is most great\"; \"Glory be to the King, the Holy\"; \"there is no god but Allah\"; and that they should count them on fingers, for they (the fingers) will be questioned and asked to speak",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: I saw the Messenger of Allah (ﷺ) counting the glorification of Allah on fingers. Ibn Qudamah said (in his version: \"With his right hands)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "Narrated Abdullah Ibn Abbas: The Messenger of Allah (ﷺ) went out from Juwayriyyah (wife of the Prophet). Earlier her name was Barrah, and he changed it. When he went out she was in her place of worship, and when he returned she was in her place of worship. He asked: Have you been in your place of worship continuously? She said: Yes. He then said: Since leaving you I have said three times four phrases which, if weighed against all that you have said (during this period), would prove to be heavier: \"Glory be to Allah, and I begin with praise of Him to the number of His creatures, in accordance with His good pleasure, to the weight of His throne and to the ink (extent) of His words",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "Narrated AbuHurayrah: AbuDharr said: Prophet of Allah. The wealthy people have all the rewards; they pray as we pray; they fast as we fast; and they have surplus wealth which they give in charity; but we have no wealth which we may give in charity. The Messenger of Allah (ﷺ) said: AbuDharr, should I not teach you phrases by which you acquire the rank of those who excel you? No one can acquire your rank except one who acts like you. He said: Why not, Messenger of Allah? He said: Exalt Allah (say: Allah is Most Great) after each prayer thirty-three times; and praise Him (say: Praise be to Allah) thirty-three times; and glorify Him (say: Glory be to Allah) thirty-three times, and end it by saying, \"There is no god but Allah alone, there is no partner, to Him belongs the Kingdom, to Him praise is due and He has power over everything\". His sins will be forgiven, even if they are like the foam of the sea",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "Al-Mughirah b. Shu'bah reported:\"Mu'awiyah wrote to al-Mughirah b. Shu'bah: 'What would the the Messenger of Allah (ﷺ) recite when he gave Taslim (salutation) in the prayer ?' Al-Mughirah dictated and wrote to Mu'awiyah: 'The Messenger of Allah (ﷺ) used to say (at the end of the prayer after taslim): 'There is no God but Allah, Alone, Who has no partner, to Him belongs the dominion, to Him praise is due, and He is Omnipotent. O Allah no one cane withhold what You give and give what You withhold, and none benefits the fortunate person, for from You is the fortune",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "Abu Zubair said:\"I heard 'Abd Allah b. al-Zubair saying on the pulpit: When the Prophet (ﷺ) finished the prayer, he used to say (at the end of the prayer): 'There is no God but Allah, Alone, Who has no partner, to Him belongs the Kingdom, to Him praise is due, and He is Omnipotent. There is no God but Allah to Whom we are sincere in devotion, even though the infidels should disapprove. To Him belongs wealth, to Him belongs grace and to Him is worthy accorded. There is no got but Allah to Whom we are sincere in devotion, even though infidels should disapprove",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "Abu al-Zubair said:'Abd Allah b. al-Zubair used to recite this supplication after each (prescribed) prayer. He then narrated a similar supplication and added to it: \"There is no might and no power except in Allah; there is no god but Allah Whom alone we worship. To Him belongs wealth.\" The narrator then transmitted the rest of tradition",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "Narrated Zayd ibn Arqam: I heard the Messenger of Allah (ﷺ) saying (the version of Sulayman has: The Messenger of Allah (ﷺ) used to say) after his prayer:- \"O Allah, our Lord and Lord of everything, I bear witness that Thou art the Lord alone Who hast no partner; O Allah, Our Lord and Lord of everything, I bear witness that Muhammad is Thy servant and Thy apostle ; O Allah, our Lord and Lord of everything, I bear witness that all the servants are brethren; O Allah, our Lord and Lord of everything make me sincere to Thee, and my family too at every moment, in this world and in the world hereafter, O Possessor of glory and honour, listen to me and answer. Allah is incomparably great. O Allah, Light of the heavens and of the earth\". The narrator Sulaiman b. Dawud said: \"Lord of the heavens and of the earth, Allah is incomparably great. Allah is sufficient for me; and the excellent guardian is He; Allah is incomparably great",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "Ali b. Abi Talib said:When the Prophet (ﷺ) uttered salutation at the end of the prayer, he used to say: \"O Allah, forgive me my former and latter sins, what I have kept secret and what I have done openly, and what I have done extravagance; and what You know better than I do. You are the Advancer, the Delayer, there is no god but You",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "Narrated Abdullah ibn Abbas: The Prophet (ﷺ) used to supplicate Allah: \"My Lord, help me and do not give help against me; grant me victory, and do not grant victory over me; plan on my behalf and do not plan against me; guide me, and made my right guidance easy for me; grant me victory over those who act wrongfully towards me; O Allah, make me grateful to Thee, mindful of Thee, full of fear towards Thee, devoted to Thy obedience, humble before Thee, or penitent. My Lord, accept my repentance, wash away my sin, answer my supplication, clearly establish my evidence, guide my heart, make true my tongue and draw out malice in my breast",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "The aforesaid tradition has also been transmitted by 'Amr b. Murrah through a different chain of narrators to the same effect. This version adds:\"And make right guidance easy for me.\" The narrator did not say: \"my right guidance\". Abu Dawud said: Sufyan heard eighteen traditions from 'Amr b. Murrah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "Aishah said:When the Prophet (ﷺ) uttered taslim, he used to say: \"O Allah, You are As-Salam, and from you is As-Salam. You are blessed, O One of Magnificence and Generosity",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "Thawban, the client of Messenger of Allah (ﷺ) said:When the Prophet (ﷺ) finished the prayer, he asked forgiveness three times and said: \"O Allah .....\" The narrator then narrated the tradition like that of 'Aishah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "Narrated AbuBakr as-Siddiq: The Prophet (ﷺ) said: He who asks pardon is not a confirmed sinner, even if he returns to his sin seventy times a day",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "Al-Agharr al-Muzani said (Musaddad in his version of this tradition said that he was a Companion of the Prophet):The Messenger of Allah (ﷺ) said: My heart is invaded by unmindfulness, and I ask Allah's pardon a hundred times in the day",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "Narrated Abdullah ibn Umar: We counted that the Messenger of Allah (ﷺ) would say a hundred times during a meeting: \"My Lord, forgive me and pardon me; Thou art the Pardoning and forgiving One",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "Narrated Zayd, the client of the Prophet: The Prophet (ﷺ) said: If anyone says: \"I ask pardon of Allah than Whom there is no deity, the Living, the eternal, and I turn to Him in repentance,\" he will be pardoned, even if he has fled in time of battle",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "Narrated Abdullah ibn Abbas: The Prophet (ﷺ) said: If anyone continually asks pardon, Allah will appoint for him a way out of every distress, and a relief from every anxiety, and will provide for him from where he did not reckon",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": 1519,
			"text": "Qatadah asked Anas:Which Supplication would the Prophet (ﷺ) often make ? He replied: The supplication he would usually recite was: \"O Allah, give us in this world what is good and in the next what is good, and protect us from the punishment of Hell-fire\". The version of Ziyad adds: When Anas wished to supplicate, he uttered this supplication. When he uttered some other supplication, he combined it with this supplication",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "Sahl b. Hunaif reported:The Messenger of Allah (ﷺ) said: If anyone asks Allah for martyrdom sincerely, Allah will make him reach the ranks of martyrs even if he died on his bed",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "Narrated AbuBakr as-Siddiq: Asma' bint al-Hakam said: I heard Ali say: I was a man; when I heard a tradition from the Messenger of Allah (ﷺ), Allah benefited me with it as much as He willed. But when some one of his companions narrated a tradition to me I adjured him. When he took an oath, I testified him. AbuBakr narrated to me a tradition, and AbuBakr narrated truthfully. He said: I heard the apostle of Allah (ﷺ) saying: When a servant (of Allah) commits a sin, and he performs ablution well, and then stands and prays two rak'ahs, and asks pardon of Allah, Allah pardons him. He then recited this verse: \"And those who, when they commit indecency or wrong their souls, remember Allah\" (Al-Qur'an 3:135)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "Mu'adh b. Jabal reported that the Messenger of Allah (ﷺ) caught his hand and said:By Allah, I love you, Mu'adh. I give some instruction to you. Never leave to recite this supplication after every (prescribed) prayer: \"O Allah, help me in remembering You, in giving You thanks, and worshipping You well.\" Mu'adh willed this supplication to the narrator al-Sunabihi and al-Sunabihi to 'Abu Abd al-Rahman",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "Narrated Uqbah ibn Amir: The Messenger of Allah (ﷺ) commanded me to recite Mu'awwidhatan (the last two surahs of the Qur'an) after every prayer",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "Narrated Abdullah ibn Mas'ud: The Messenger of Allah (ﷺ) liked to supplicate three times and to ask pardon (of Allah) three times",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "Narrated Asma' daughter of Umays: The Messenger of Allah (ﷺ) said to me: May I not teach you phrases which you utter in distress? (These are:) \"Allah , Allah is my Lord, I do not associate anything as partner with Him.\" Abu Dawud said: The narrator Hilal is a client of 'Umar b. 'Abd al-Aziz. The name of Ja'far, a narrator, is 'Abd Allah b. Ja'far",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "Narrated AbuMusa al-Ash'ari: Once we accompanied the Messenger of Allah (ﷺ) on a journey. When we reached near Medina, the people began to say aloud: \"Allah is most great,\" and they raised their voice. The Messenger of Allah (ﷺ) said: O people, you are not supplicating one who is deaf and absent, but you are supplicating One Who is nearer to you than the neck of your riding beast. The Messenger of Allah (ﷺ) then said: AbuMusa, should I not point out to you one of the treasures of Paradise? I asked: What is that? He replied: \"There is no might and there is no power except in Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "Abu Musa Al-Ash'ari said:They (the Companions) accompanied the Prophet (ﷺ) while they were climbing the turning of a hill. A man uttered loudly: \"There is no god but Allah, and Allah is most great\" when he ascended the hill.\tThe Prophet of Allah (ﷺ) said: You are not supplicating one who is deaf or absent. He then said: 'Abd Allah b. Qais. The narrator then transmitted the tradition to the same effect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "The aforesaid tradition has also been transmitted by Abu Musa al-Ash'ari through a different chain of narrators. This version adds:Be lenient to yourselves, O people",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "Abu Sa'id al-Khudri reported the Messenger of Allah (ﷺ) as saying:If anyone says \"I am pleased with Allah as Lord, with Islam as religion and with Muhammad (ﷺ) as Apostle\" Paradise will be his due",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: If anyone invokes blessings on me once, Allah will bless him ten times",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "Aws b. Aws reported the Messenger of Allah (ﷺ) as saying:Among the most excellent of your days is Friday; so invoke many blessings on me on that day, for your blessing will be submitted to me. They (the Companions) asked: Messenger of Allah, how can our blessings be submitted to you, when your body has decayed? He (ﷺ) said: Allah has prohibited the earth from consuming the bodies of Prophets",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "Jabir b. 'Abd Allah reported the Messenger of Allah (ﷺ) as saying:Do not invoke curse on yourselves, and do not invoke curse on your children, and do not invoke curse on your servants, and do not invoke curse on your property, lest you happen to do it at a time when Allah is asked for something and grants your request. Abu Dawud said: This Hadith has a continuous chain of narrators, 'Ubadah bin Al-Walid bin 'Ubadah (did) met Jabir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "Narrated Jabir ibn Abdullah: A woman said to the Prophet (ﷺ): Invoke blessing on me as well as on my husband. The Prophet (ﷺ) said: May Allah send blessing on you and your husband",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "Abu Al-Darda' said:I heard the Messenger of Allah (ﷺ) say: When a Muslim supplicates for his absent brother the angels say: Amin, and may you receive the like",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Prophet (ﷺ) said: The supplication which gets the quickest answer is that made by one distant Muslim for another",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) said: Three supplications are answered, there being no doubt about them; that of a father, that of a traveller and that of one who has been wronged",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "Narrated AbuMusa al-Ash'ari: When the Prophet (ﷺ) feared a (group of) people, he would say: \"O Allah, we make Thee our shield against them, and take refuge in Thee from their evils",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "Jabir b. 'Abd Allah said:The Messenger of Allah (ﷺ) used to teach us the supplication for isthikharah (seeking what us beneficial from Allah) as he would teach us a surah (chapter) from the Qur'an. He would tell us: When one of you intends to do a work, he should offer two supererogatory rak'ahs of prayer, and then say (at the end of the prayer): \"O Allah, I seek Your choice on the better (of the two matters) based upon Your knowledge, and I seek Your decree based upon Your power, and I ask You for Your great bounties. For Indeed, You are the One Who Decrees, and I do not decree, and You know, and I do not know, and You are the Knower of the Unseen. O Allah, if you know this, and You are the Knower of the Unseen. O Allah, if you know this - here he should name exactly what he wishes - is better for me with regard to my religion, and my life, and my afterlife, and the end result of my affairs, then decree it to me, and make it easy for me, and bless me on it. O Allah, and if You know this to be evil for me - and he says just as he said the first time - then avert it for me, and avert me from it. And decree for me good wherever it might be, the make me content with it.\" A version goes: \"If the work is good immediately or subsequently.\" Ibn Maslamah and Ibn 'Isa reported from Muhammad b. al-Munkadir on the authority of Jabir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "Narrated Umar ibn al-Khattab: The Prophet (ﷺ) used to seek refuge in Allah from five things; cowardliness, niggardliness, the evils of old age, evil thoughts, and punishment in the grave",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "Anas b. Malik said:The Messenger of Allah (ﷺ) used to say: \"O Allah, I seek refuge in You from weakness, and laziness, and cowardice, and old age, and I seek refuge in You from the punishment of the grave, and I seek refuge in You from the trails of the life and death",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "Anas b. Malik said:I used to serve the Prophet (ﷺ) and often hear him say: \"O Allah, I seek refuge in You from grief and anxiety, from the hardships of debt, and from being overpowered by men",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "Abd Allah b. 'Abbas said:The Messenger of Allah (ﷺ) used to teach us this supplication as he taught us the surah from the Qur'an. He would say: O Allah! I seek refuge in You from the punishment of Hell and I seek refuge in You from the punishment of the grave, and I seek refuge from You from the trails of Al-Masihid-Dajjal, and I seek refuge in You from the trials of life and death",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "Aishah narrated that the Prophet (ﷺ) would supplicate with the following words:\"O Allah! I seek refuge in You from the trials of the Fire, and the punishment of the Fire, and from the evils of richness and poverty",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "Narrated AbuHurayrah: The Prophet (ﷺ) used to say: \"O Allah, I seek refuge in Thee from poverty\", lack and abasement, and I seek refuge in Thee lest I cause or suffer wrong",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "Abd Allah b. 'Umar said that one of the supplications of the Messenger of Allah (ﷺ) was:\"O Allah, I seek refuge in You that Your blessings are lifted, and Your protection (of me) is changed, and in the suddenness of Your punishment, and from all Your anger",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "Narrated AbuHurayrah: The Messenger of Allah (ﷺ) used to supplicate by saying: \"O Allah, I seek refuge in Thee from divisiveness, hypocrisy, and evil character",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "Narrated AbuHurayrah: The Messenger of Allah (ﷺ) used to say: \"O Allah, I seek refuge in Thee from hunger, for it is an evil bed-fellow; and I seek refuge in Thee from treachery, for it is an evil hidden trait",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "Narrated AbuHurayrah: The Messenger of Allah (ﷺ) used to say: \"O Allah, I seek refuge in Thee from four things: Knowledge which does not profit, a heart which is not submissive, a soul which has an insatiable appetite, and a supplication which is not heard",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "Anas bin Malik narrated that the Prophet (ﷺ) would say:\"O Allah, I seek refuge in You from a prayer that is of no benefit",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "Farwah b. Nawfal Al-Ashja'i asked 'Aishah the Mother of the Believers, about the supplication of the Messenger of Allah (ﷺ). She replied:\"He would say: 'O Allah, I seek refuge in You from the evil of what I have done, and from the evil of what I have not done",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "Narrated Shakl ibn Humayd: I said: Messenger of Allah, teach me a supplication. He said: Say: \"O Allah, I seek refuge in Thee from the evil of what I hear, from the evil of what I see, from the evil of what I speak, from the evil of what I think, and from the evil of my semen\" (i.e. sexual passion)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": 1552,
			"text": "Narrated AbulYusr: The Messenger of Allah (ﷺ) used to supplicate: \"O Allah, I seek refuge in Thee from my house falling on me, I seek refuge in Thee from falling into an abyss, I seek refuge in Thee from drowning burning and decrepitude. I seek refuge in Thee from the devil harming me at the time of my death, I seek refuge in Thee from dying in Thy path while retreating, and I seek refuge in Thee from dying of the sting of a poisonous creature",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": 1553,
			"text": "The aforesaid tradition has also been transmitted by Abu al-Yusr through a different chain of narrators. This version adds:\"and from sorrow",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": 1554,
			"text": "Narrated Anas ibn Malik: The Prophet (ﷺ) used to say: \"O Allah, I seek refuge in Thee from leprosy, madness, elephantiasis, and evil diseases",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": 1555,
			"text": "Narrated AbuSa'id al-Khudri: One day the Messenger of Allah (ﷺ) entered the mosque. He saw there a man from the Ansar called AbuUmamah. He said: What is the matter that I am seeing you sitting in the mosque when there is no time of prayer? He said: I am entangled in cares and debts, Messenger of Allah. He replied: Shall I not teach you words by which, when you say them, Allah will remove your care, and settle your debt? He said: Why not, Messenger of Allah? He said: Say in the morning and evening: \"O Allah, I seek refuge in Thee from care and grief, I seek refuge in Thee from incapacity and slackness, I seek refuge in Thee from cowardice and niggardliness, and I seek in Thee from being overcome by debt and being put in subjection by men.\" He said: When I did that Allah removed my care and settled my debt",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 140
			}
		}
	]
}