{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "Abu Hurairah said When the Messenger of Allah(ﷺ) died and Abu Bakr was made his successor after him and certain Arab clans apostatized. Umar bin Al Khattab said to Abu Bakr How can you fight with the people until they say “There is no God but Allah” so whoever says “There is no God but Allah”, he has protected his property and his person from me except for what is due from him, and his reckoning is left to allah. Abu Bak replied I swear by Allah that I will certainly fight with those who make a distinction between prayer and zakat, for zakat is what is due from property. I swear by Allah that if they were to refuse me a rope of camel (or a female kid, according to another version)which they used to pay the Messenger of Allah, I will fight with them over the refusal of it. Umar bin Al Khattab said I swear by Allah, I clearly saw Allah had made Abu Bakr feel justified in tighting and I recognized that it was right. Abu Dawud said This tradition has been transmitted by Rabah bin Zaid from Ma’mar and Al Zaubaidi from Al Zuhri has “If they were to refuse me a female kid.” The version transmitted by ‘Anbasah from Yunus on the authority of Al Zuhri has “a female kid”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "This tradition has also been transmitted by Al Zuhri through a different chain of narrators. This version has “Abu Bakr said its due is the payment of zakat.” He used the word “a rope of a Camel”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "Abu Sa’id Al Khudri reported:That the Apostle of Allaah(ﷺ) as saying No sadaqah(zakat) is payable on less than five camels, on less than five ounces of silver and on less than five camel loads(wasq)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "Narrated AbuSa'id al-Khudri: The Prophet (ﷺ) said: There is no zakat payable (on grain or dates) on less than five camel-loads. The wasq (one camel-load) measures sixty sa' in weight",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "Ibrahim said The wasq contained sixty sa’s stamped with the stamp of Al Hajjaj",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "Habib al-Maliki said:A man said to Imran ibn Husayn: AbuNujayd, you narrate to us traditions whose basis we do not find in the Qur'an. Thereupon, Imran got angry and said to the man: Do you find in the Qur'an that one dirham is due on forty dirhams (as Zakat), and one goat is due on such-and-such number of goats, and one camel will be due on such-and-such number of camels? He replied: No. He said: From whom did you take it? You took it from us, from the Messenger of Allah (ﷺ). He mentioned many similar things",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "Narrated Samurah ibn Jundub: The Messenger of Allah (ﷺ) used to order us to pay the sadaqah (zakat) on what we prepared for trade",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "Amr bin Shu'aib on his father's authority said that his grandfather reported: A woman came to the Messenger of Allah (ﷺ) and she was accompanied by her daughter who wore two heavy gold bangles in her hands. He said to her: Do you pay zakat on them? She said: No. He then said: Are you pleased that Allah may put two bangles of fire on your hands? Thereupon she took them off and placed them before the Prophet (ﷺ) saying: They are for Allah and His Apostle",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "Narrated Umm Salamah, Ummul Mu'minin: I used to wear gold ornaments. I asked: Is that a treasure (kanz), Messenger of Allah? He replied: whatever reaches a quantity on which zakat is payable is not a treasure (kanz) when the zakat is paid",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "Narrated ‘Abdallah bin Shaddad bin Al Had :We entered upon A’ishah, wife of the Prophet (ﷺ). She said The Apostle of Allaah (ﷺ) entered upon me and saw two silver rings in my hand. He asked What is this, Aishah? I said I have made two ornaments myself for you, Messenger of Allah (ﷺ). He asked Do you pay zakat on them? I said No or I said Whatever Allah willed. He said this is sufficient for you (to take you) to the Hell fire",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "The aforesaid tradition has also been narrated by ‘Umar bin Ya’la through a different chain of narrators, like the tradition of ring. Sufyan, a narrator, was asked How do you pay zakat on it. He said You may combine it with other (ornaments)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "Narrated Hammad : I took a letter from Thumamah bin ‘Abd Allah bin Anas. He presumed that Abu Bakr had written it for Anas when he sent him (to Al Bahrain) as a collector of zakat. This (letter) was stamped with the stamp of the Messenger of Allah(ﷺ) and was written by Abu Bakr for him(Anas). This letter goes “This is the obligatory sadaqah(zakat) which the Messenger of Allah(ﷺ) imposed on Muslims which Allah commanded his Prophet(ﷺ) to impose. Those Muslims who are asked for the proper amount must give it, but those who are asked for more than that must not give it. For less than twenty five Camels a goat is to be given for every five Camels. When they reach twenty five to thirty five, a she Camel in her second year is to be given. If there is no she Camel in her second year, a male Camel in its third year is to be given. When they reach thirty six to forty five, a she Camel in her third year is to be given. When they reach forty six to sixty , a she Camel in her fourth year which is ready to be covered by a stallion is to be given. When they reach sixty one to seventy five, a she Camel in her fifth year is to be given. When they reach seventy six to ninety, two she Camel in their third year are to be given. When they reach ninety one to a hundred and twenty, two she Camels in their fourth year are ready to be covered by a stallion are to be given. When they exceed a hundred and twenty, a she Camel in her third year is to be given for every forty and a she Camel in her fourth year for every fifty(Camels). In case the ages of the Camel vary in the payment of obligatory sadaqah(zakat) If anyone whose Camels reach the number on which a she Camel in her fifth year is payable does not possess one but possess one in her fourth year, that will be accepted from him along with two goats if he can conveniently give them, or else twenty dirhams. If anyone whose Camels reach the number on which a she Camel in her fourth year is payable does not possess but possesses one in her fifth year, that will be accepted from him, and the collector must give him twenty dirhams or two goats. If anyone whose Camels reach the number on which a she Camel in her fourth year is payable possesses only one in her third year, that will be accepted from him.” Abu Dawud said From here I could not retain accurately from Musa as I liked “And he must give along with it two goats if he can conveniently give them, or else twenty dirhams. If anyone whose Camels reach the number on which a she Camel in her third year is payable possesses only one in her fourth year, that will be accepted from him.” Abu Dawud said (I was doubtful) up to here, and retained correctly onward “and the collector must give him twenty dirhams or two goats. If anyone whose Camels reach the number on which a she Camel in her third year is payable does not possess one but possesses one in her second year, that will be accepted from him, but he must give two goats or twenty dirhams. Anyone whose Camels reach the number on which a she Camel in her second year is payable does not possess one but possesses a male Camel in its third year, that will be accepted from him, and nothing extra will be demanded along with it. If anyone possesses only four Camels, no zakat will be payable on them unless their owner wishes. If the numbers of the pasturing goats reach forty to one hundred and twenty, one goat is to be given. Over one hundred and twenty up to two hundred, two goats are to be given. If they exceed two hundred reaching three hundred, three goats are to be given. If they exceed three hundred, a goat is to be for every hundred. An old sheep, one with a defect in the eye, or a male goat is not to be accepted as sadaqah (zakat) unless the collector wishes. Those which are in separate flocks are not to be brought together and those which are in one flock are not to be separated from fear of sadaqah(zakat). Regarding what belongs to two partners, they can make claims for restitution from one another with equity, If a man’s pasturing animals are less than forty, no sadaqah(zakat) is due on them unless their owner wishes. On sliver dirhams a fortieth is payable, but if there are only a hundred and ninety, nothing is payable unless their owner wishes.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "Narrated Abdullah ibn Umar: The Messenger of Allah (ﷺ) wrote a letter about sadaqah (zakat) but he died before he could send it to his governors. He had kept it with his sword. So AbuBakr acted upon it till he died, and then Umar acted upon it till he died. It contained: \"For five camels one goat is to be given; for ten camels two goats are to be given; for fifteen camels three goats are to be given; for twenty camels four goats are to be given; for twenty-five to thirty-five camels a she-camel in her second year is to be given. If the number exceeds by one up to seventy camels, a she-camel in her fourth year is to be given; if they exceed by one up to seventy-five camels, a she-camel in her fifth year is to be given; if they exceed by one up to ninety camels, two she-camels in their third year are to be given; if they exceed by one up to one hundred and twenty, two she-camels in their fourth year are to be given. If the camels are more than this, a she-camel in her fourth year is to be given for every fifty camels, and a she-camel in her third year is to be given for every forty camels. For forty to one hundred and twenty goats one goat is to be given; if they exceed by one up to two hundred, two goats are to be given. If they exceed by one up to three hundred, three goats are to be given; if the goats are more than this, one goat for every hundred goats is to be given. Nothing is payable until they reach one hundred. Those which are in one flock are not to be separated, and those which are in separate flocks are not be brought together from fear of sadaqah (zakat). Regarding that which belongs to two partners, they can make claims for restitution from each other with equity. An old goat and a defective one are not to be accepted as sadaqah (zakat).\" Az-Zuhri said: When the collector comes, the goats will be apportioned into three flocks: one containing bad, the second good, and the third moderate. The collector will take zakat from the moderate. Az-Zuhri did not mention the cows (to be apportioned in three flocks)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "Therefore said tradition has also been transmitted by Sufyan bin Husain through a different chain of narrators and to the same effect. This version adds “If there is no she Camel in her second year, a she Camel in her third year is to be given.” This does not mention the words of Al Zuhri",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "Ibn Shihab (Al Zuhri) said This is the copy of the letter of the Messenger of Allah(ﷺ), which he had written about sadaqah(zakat). This was in the custody of the descendants of ‘Umar bin Al Khattab. Ibn Shihab said Salim bin Abdallah bin Umar read it to me and I memorized it properly. Umar bin Abdul Aziz got it copied from ‘Abdallah, ‘Abdallah bin Umar and Salim bin ‘Abdallah bin ‘Umar. He (Ibn Shihab) then narrated the tradition like the former(i.e., up to one hundred and twenty camels). He further said if they (the camels) reach one hundred and twenty one to one hundred and twenty nine, three she camels in their third year are to be given. When they reach one hundred and thirty to one hundred and thirty nine, two she camels in their third year and one she Camel in her fourth year are to be given. When they reach one hundred and forty to one hundred and forty nine, two she camels in their fourth year and one she Camel in her third year are to be given. When they reach one hundred and fifty to one hundred and fifty nine, three she camels in their fourth year are to be given. When they reach one hundred and sixty to one hundred and sixty nine four she camels in their fourth year are to be given. When they reach one hundred and seventy to one hundred and seventy nine, three she camels in their third year and one she Camel in her fourth year are to be given. When they reach one hundred and eighty to one hundred and eighty nine, two she camels in their fourth year and two she Camel in their third year are to be given. When they reach one hundred and ninety to one hundred and ninety nine, three she camels in their fourth year and one she Camel in her third year are to be given. When they reach two hundred, four she camels in their fourth year or five she Camels in their third year, camels of whichever age are available, are to be accepted. For the pasturing goats, he narrated the tradition similar to that transmitted by Sufyan bin Husain. This version adds “An old goat, one with defect in the eye or a male goat is not to be accepted in sadaqah(zakat) unless the collector wishes.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "Narrated Malik:The statement of Umar bin Al Khattab “Those which are in separate flocks are not to be brought together and those which are in one flock are not to be separated” means Two persons had forty goats each ; when the collector came they brought them together in one flock so that only one goat could be given. The phrase “those which are in one flock are not to be separated” means If two partners possessed one hundred and one goats each, three goats were to be given by each of them. When the collector came they separated their goats. Thus only one goat was to be given by each of them. This is what I heard on this subject",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "Al-Harith al-A'war reported from Ali. Zuhayr said:I think, the Prophet (ﷺ) said: \"Pay a fortieth. A dirham is payable on every forty, but you are not liable for payment until you have accumulated two hundred dirhams. When you have two hundred dirhams, five dirhams are payable, and that proportion is applicable to larger amounts. \"Regarding sheep, for every forty sheep up to one hundred and twenty, one sheep is due. But if you possess only thirty-nine, nothing is payable on them.\" He further narrated the tradition about the sadaqah (zakat) on sheep like that of az-Zuhri. \"Regarding cattle, a yearling bull calf is payable for every thirty, and a cow in her third year for forty, and nothing is payable on working animals. Regarding (the zakat on) camels, he mentioned the rates that az-Zuhri mentioned in his tradition. He said: \"For twenty-five camels, five sheep are to be paid. If they exceed by one, a she-camel in her second year is to be given. If there is no she-camel in her second year, a male camel in its third year is to be given, up to thirty-five. If they exceed by one a she-camel in her third year is to be given, up to forty-five. If they exceed by one, a she-camel in her fourth year which is ready to be covered by a bull-camel is to be given.\" He then transmitted the rest of the tradition like that of az-Zuhri. He continued: If they exceed by one, i.e. they are ninety-one to hundred and twenty, two she-camels in their fourth year, which are ready to be covered by a bull-camel, are to be given. If there are more camels than that, a she-camel in her fourth year is to be given for every fifty. Those which are in one flock are not to be separated, and those which are separate are not to be brought together. An old sheep, one with a defect in the eye, or a billy goat is not to be accepted as a sadaqah unless the collector is willing. As regards agricultural produce, a tenth is payable on that which is watered by rivers or rain, and a twentieth on that which is watered by draught camels.\" The version of Asim and al-Harith says: \"Sadaqah (zakat) is payable every year.\" Zuhayr said: I think he said \"Once a year\". The version of Asim has the words: \"If a she-camel in her second year is not available among the camels, nor is there a bull-camel in its third year, ten dirhams or two goats are to be given",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "Narrated Ali ibn AbuTalib: The Prophet (ﷺ) said: \"When you possess two hundred dirhams and one year passes on them, five dirhams are payable. Nothing is incumbent on you, that is, on gold, till it reaches twenty dinars. When you possess twenty dinars and one year passes on them, half a dinar is payable. Whatever exceeds, that will be reckoned properly.\" (The narrator said: I do not remember whether the words \"that will be reckoned properly\" were uttered by All himself or he attributed them to the Prophet (ﷺ). No zakat is payable on property till a year passes on it. But Jarir said: Ibn Wahb (sub-narrator) added to this tradition from the Prophet (ﷺ): \"No zakat is payable on property until a year passes away on it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "Narrated Ali ibn AbuTalib: The Prophet (ﷺ) said: I have given exemption regarding horses and slaves; with regard to coins, however, you must pay a dirham for every forty (dirhams), but nothing is payable on one hundred and ninety. When the total reaches two hundred, five dirhams are payable. Abu Dawud said: Al-A'mash transmitted this tradition from Abu Ishaq like the one transmitted by Abu 'Awanah. This tradition has also been narrated by Shaiban, Abu Mu'awiyah and Ibrahim b. Tahman from Abu Ishaq from al-Harith on the authority of 'Ali from the Prophet (ﷺ) to the same effect. The tradition reported by al-Nufail has also been narrated by Shu'bah, Sufyan, and others from Abu Ishaq from 'Asim from 'Ali, But they did not attribute it to the Prophet (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "Bahz b Hakim reported from his grandfather:The Messenger of Allah (ﷺ) said: For forty pasturing camels, one she-camel in her third year is to be given. The camels are not to be separated from reckoning. He who pays zakat with the intention of getting reward will be rewarded. If anyone evades zakat, we shall take half the property from him as a due from the dues of our Lord, the Exalted. There is no share in it (zakat) of the descendants of Muhammad (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "Narrated Mu'adh ibn Jabal: When the Prophet (ﷺ) sent him to the Yemen, he ordered him to take a male or a female calf a year old for every thirty cattle and a cow in its third year for every forty, and one dinar for every adult (unbeliever as a poll-tax) or cloths of equivalent value manufactured in the Yemen",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "This tradition has also been transmitted by Mu’adh through a different chain of narrators to the same effect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "Narrated Mu’adh bin Jabal :that the Prophet (ﷺ) sent him to Yemen. He then narrated the tradition something similar. He did not mention in this version cloths made in the Yemen nor did he refer to adult (unbelievers). Abu Dawud said This tradition has been transmitted by Jarir, Ya’la, Ma’mar, Abu ‘Awanahand Yahya bin Sa’id from Al A’mash, from Abu Wa’il, on the authority of Masruq, and from Ya’la and Ma’mar on the authority of Mu’adh to the same effect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "Suwayd ibn Ghaflah said:I went myself or someone who accompanied the collector of the Prophet (ﷺ) told me: It was recorded in the document written by the Messenger of Allah (ﷺ) not to accept a milking goat or she-camel or a (suckling) baby (as zakat on animals); and those which are in separate flocks are not to be brought together, and those which are in one flock are not to be separated. The collector used to visit the water-hole when the sheep went there and say: Pay the sadaqah (zakat) on your property. The narrator said: A man wanted to give him his high-humped camel (kawma'). The narrator (Hilal) asked: What is kawma', AbuSalih? He said: A camel a high hump. The narrator continued: He (the collector) refused to accept it. He said: I wish you could take the best of my camels. He refused to accept it. He then brought another camel lower in quality than the previous one. He refused to accept it too. He then brought another camel lower in quality than the previous one. He accepted it, saying: I shall take it, but I am afraid the Messenger of Allah (ﷺ) might be angry with me, saying to me: You have purposely taken from a man a camel of your choice. Abu Dawud said: This tradition has also been narrated by Hushaim from Hilal bin Khabbab to the same effect. But he said: Those which are in one flock are not to be separated",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "Suwaid bin Ghaflah reported The collector of the Prophet (ﷺ) came to us. I caught hold of his hand and read in the document that the goods were not to be combined nor were they to be separated for fear of zakat. There is no mention of milch animals in this tradition",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "Muslim ibn Shu'bah said:Nafi' ibn Alqamah appointed my father as charge d'affaires of his tribe, and commanded him to collect sadaqah (zakat) from them. My father sent me to a group of them; so I came to an aged man called Sa'r ibn Disam I said: My father has sent me to you to collect zakat from you. He asked: What kind of animals will you take, my nephew? I replied: We shall select the sheep and examine their udders. He said: My nephew, I shall narrate a tradition to you. I lived on one of these steppes during the time of the Messenger of Allah (ﷺ) along with my sheep. Two people riding a camel came to me. They said to me: We are messengers of the Messenger of Allah (ﷺ), sent to you so that you may pay the sadaqah (zakat) on your sheep. I asked: What is due from me for them? They said: One goat. I went to a goat which I knew was full of milk and fat, and I brought it to them. They said: This is a pregnant goat. The Messenger of Allah (ﷺ) prohibited us to accept a pregnant goat. I asked: What will you take then? They said: A goat in its second year or a goat in its third year. I then went to a goat which had not given birth to any kid, but it was going to do so. I brought it to them. They said: Give it to us. They took it on the camel and went away. Abu Dawud said: Abu 'Asim transmitted this tradition from Zakariyya. He said: Muslim bin Shu'bah is a narrator in the chain of this tradition as reported by the narrator Rawh",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "This tradition has also been narrated by Zakariyya bin Ishaq through his chain of narrators. In this version Mulsim bin Shu'bah said:Shafi' means a goat which has a baby in its womb. Abu Dawud said: I read in a document possessed by Abdullah ibn Salim at Hims: Abdullah ibn Mu'awiyah al-Ghadiri reported the Prophet (ﷺ) as saying: He who performs three things will have the taste of the faith. (They are:) One who worships Allah alone and one believes that there is no god but Allah; and one who pays the zakat on his property agreeably every year. One should not give an aged animal, nor one suffering from itch or ailing, and one most condemned, but one should give animals of medium quality, for Allah did not demand from you the best of your animals, nor did He command you to give the animals of worst quality",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "Narrated Ubayy ibn Ka'b: The Messenger of Allah (ﷺ) commissioned me as a collector of zakat. I visited a man. When he had collected his property of camels, I found that a she-camel in her second year was due from him. I said to him: Pay a she-camel in her second year, for she is to be paid as sadaqah (zakat) by you. He said: That one is not worthy of milking and riding. Here is another she-camel which is young, grand and fat. So take it. I said to him: I shall not take an animal for which I have not been commanded. The Messenger of Allah (ﷺ) is here near to you. If you like, go to him, and present to him what you presented to me. Do that; if he accepts it from you, I shall accept it; if he rejects it, I shall reject it. He said: I shall do it. He accompanied me and took with him the she-camel which he had presented to me. We came to the Messenger of Allah (ﷺ). He said to him: Prophet of Allah, your messenger came to me to collect zakat on my property. By Allah, neither the Messenger of Allah nor his messenger has ever seen my property before. I gathered my property (camels), and he estimated that a she-camel in her second year would be payable by me. But that has neither milk nor is it worth riding. So I presented to him a grand young she-camel for acceptance as zakat. But he has refused to take her. Look, she is here; I have brought her to you, Messenger of Allah. Take her. The Messenger of Allah (ﷺ) said: That is what is due from you. If you give voluntarily a better (animal) Allah will give a reward to you for it. We accept her from you. She is here, Messenger of Allah; I have brought her to you. So take her. The Messenger of Allah (ﷺ) then ordered me to take possession of it, and he prayed for a blessing on his property",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "Narrated Ibn 'Abbas:said When the Messenger of Allah(ﷺ) sent Mu’adh to Yemen, he said to him You are going to a people who are people of the book. So call them to bear witness that there is no diety but Allah, and that I am the Messenger of Allah. If they obey you in this respect, tell them that Allah has prescribed five prayers on them every day and night. If they obey you in this regard tell them that Allah has prescribed sadaqah(zakat) on their property and returned it to their poor. If they obey you in this respect, do not take the best of their property. Beware of the curse of the oppressed, for there is no curtain between it and Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "Narrated Anas ibn Malik: The Prophet (ﷺ) said: He who collects more sadaqah than is due is like him who refuses to pay it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "Narrated Bashir ibn al-Khasasiyyah: (Ibn Ubayd said in the version of his tradition that his name was not Bashir, but (it was) the Messenger of Allah (ﷺ) (who had) named him Bashir) We said: (to the Messenger of Allah): The collectors of sadaqah collect more than is due; can we hide our property to that proportion? He replied: \"No",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "The aforesaid tradition has also been narrated by Ayyub through a different chain of narrators to the same effect. This version adds We said Messenger of Allah(ﷺ) the collectors of sadaqah collect more than is due from us. Abu Dawud said ‘Abd Al Razzaq narrated this tradition from Ma’mar attributing it to the Prophet(ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "Narrated Jabir ibn Atik: The Prophet (ﷺ) said: Riders who are objects of dislike to you will come to you, but you must welcome them when they come to you, and give them a free hand regarding what they desire. If they are just, they will receive credit for it, but if they are unjust, they will be held responsible. Please them, for the perfection of your zakat consists in their good pleasure, and let them ask a blessing for you . Abu Dawud said: The name of the narrator Abu al-Ghusn is Thabit bin Qais bin Ghusn",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "Jabir bin ‘Abdallah told of some people, meaning nomadic Arabs, who came to the Messenger of Allah (ﷺ) and said Collectors of zakat come to us and act unjustly. He said please those who collect the sadaqah from you. They asked Even if they wrong us, Messenger of Allah? He replied Please those who collect sadaqah from you. The version of ‘Uthman adds “Even if you are wronged”. Abu Kamil said in this version “Jarir said No collector of zakat returned from me since I heard this from the Messenger of Allah(ﷺ), but he was pleased with me.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "Narrated ‘Abdallah bin Abi Awfa :My father was one of those Companions who took the oath of allegiance at the hand of the Prophet (ﷺ) beneath the tree. The Prophet (ﷺ) said when the people brought him their sadaqah : O Allah, bless the family of so and so. When my father brought him his sadaqah he said O Allah bless the family of Abu Awfa",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "Amr bin Shu'aib, on his father's authority, said that his grandfather reported the Prophet (ﷺ) as saying:There is to be no collecting of sadaqah (zakat) from a distance, nor must people who own property remove it far away, and their sadaqahs are to be received in their dwelling",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "Explaining the meaning of Jalab and janab Muhammad bin Ishaq said The meaning of jalab said is that the zakat of animals should be collected at their places (dwellings), and they (animals) should not be pulled to the collector of zakat. The meaning of janab is that the animals are removed at a distance (from the collector). The owners of the animals should do so. The collector of zakat should not stay at a distance from the places of the people who bring their animals to him. The zakat should be collected in its place",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "Narrated ‘Abdallah bin Umar :‘Umar bin Al Khattab gave a horse as alms in the way of Allah. He then found it being sold, and intended to buy it. So he asked the Messenger of Allah (ﷺ) about this. He said Do not buy it, and do not take back your sadaqah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "Narrated Abu Hurairah: The Prophet (ﷺ) said: No sadaqah is due on a horse or a slave except that given at the breaking of the fast (at the end of Ramadan)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "Narrated Abu Hurairah :The Messenger of Allah(ﷺ) as saying No sadaqah is due from a Muslim on his slave or his horse",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "Narrated ‘Abdallah bin Umar :The Messenger of Allah(ﷺ) as saying A tenth is payable on what is watered by rain or rivers or brooks or from underground moisture and a twentieth on what is watered by draught camels",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "Narrated Jabir bin ‘Abdallah :The Messenger of Allah(ﷺ) as saying A tenth is payable on what is watered by rivers and brooks or from underground moisture and a twentieth on what is watered by draught camels",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "Waki’ said Ba’l means the agricultural crop which grows by the rain water. Ibn Al Aswad said and Yahya, that is, Ibn Adam said I asked Abu Iyas al Asadi (about this word ba’l). He replied What is watered by rain",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "Narrated Mu'adh ibn Jabal: When the Messenger of Allah (ﷺ) sent him to the Yemen, he said (to him): Collect corn from the corn, sheep from the sheep, camel from the camels, and cow from the cows. Abu Dawud said: In Egypt I saw a cucumber thirteen spans in length and a citron cut into two pieces loaded on a camel like two loads",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "Amr bin Shu'aib, on his father's authority, said that his grandfather reported:Hilal, a man from the tribe of Banu Mat'an brought a tenth of honey which he possessed in beehives to the Messenger of Allah (ﷺ). He asked him (the apostle of Allah) to give the wood known as Salabah as a protected (or restricted) land. The Messenger of Allah (ﷺ) gave him that wood as a protected land. When Umar ibn al-Khattab succeeded, Sufyan ibn Wahb wrote to Umar asking him about this wood. Umar ibn al-Khattab wrote to him: If he (Hilal) pays you the tithe on honey what he used to pay to the Messenger of Allah (ﷺ), leave the protected land of Salabah in his possession; otherwise those bees are like those of any wood; anyone can take the honey as he likes",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "Amr bin Shu'aib, on his father's authority, said that his grandfather reported:That was Banu Shababah, a sub-clan of the tribe Fahm. The narrator then transmitted the tradition something similar. He added:(They used to pay) one bag (of honey) out of ten bags. Sufyan ibn Abdullah ath-Thaqafi gave them two woods as protected lands. They used to give as much honey (as zakat) as they gave to the Messenger of Allah (ﷺ). He (Sufyan) used to protect their woods",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "‘Amr bin Shu’aib said on the authority of his father that his grandfather reported a sub clan of Fahm. He then narrated the tradition like that of the narrator Al Mughirah. This version has “(They used to give) sadaqah out of ten bags (of honey).” He also added “Two woods of theirs”",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "Narrated Attab ibn Usayd: The Messenger of Allah (ﷺ) commanded to estimate vines (for collecting zakat) as palm-trees are estimated. The zakat is to be paid in raisins as the zakat on palm trees is paid in dried dates",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "The Above-mentioned tradition has also been narrated by Ibn Shihab through a different chain of narrators to the same effects",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "AbdurRahman ibn Mas'ud said:Sahl ibn Abu Hathmah came to our gathering. He said: The Messenger of Allah (ﷺ) commanding us said: When you estimate take them leaving a third, and if you do not leave or find a third, leave a quarter",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "Narrated Aisha, Ummul Mu'minin: Describing the conquest of Khaybar Aisha said: The Prophet (ﷺ) used to send Abdullah ibn Rawahah to the Jews of Khaybar, and he would make an estimate of the palm trees when the fruit was in good condition before any of it was eaten",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "Abu Umamah bin Sahl reported on the authority of his father:The Messenger of Allah (ﷺ) prohibited to accept ja'rur and habiq dates as zakat. Az-Zuhri said: These are two kinds of the dates of Medina. Abu Dawud said: This has also been transmited by Abu al-Walid from Sulaiman bin Kathir from Az-Zuhri",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "Narrated Awf ibn Malik: The Messenger of Allah (ﷺ) entered upon us in the mosque, and he had a stick in his hand. A man hung there a bunch of hashaf. He struck the bunch with the stick, and said: If the owner of this sadaqah (alms) wishes to give a better one than it, he would give. The owner of this sadaqah will eat hashaf on the Day of Judgment",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "Narrated Abdullah ibn Abbas: The Messenger of Allah (ﷺ) prescribed the sadaqah (alms) relating to the breaking of the fast as a purification of the fasting from empty and obscene talk and as food for the poor. If anyone pays it before the prayer (of 'Id), it will be accepted as zakat. If anyone pays it after the prayer, that will be a sadaqah like other sadaqahs (alms)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "Ibn ‘Umar said :The Messenger of Allah(ﷺ) commanded us that the end of Ramadan when the fasting is closed sadaqah(alms) should be paid before the people went to prayer. ‘Abd Allah b. ‘Umar used to pay it one or two days before",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "Ibn ‘Umar said :The Messenger of Allah(ﷺ) prescribed as zakat payable by slave and freeman, male and female, among the muslims on closing the fast of Ramadan one sa of dried dates or one sa’ of barley. (This tradition was read out byu ‘Abd Allah b. Maslamah to Malik)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "Abd’ Allah b. Umar said :The Messenger of Allah(ﷺ)prescribed the sadaqah at the end of Ramadan one sa’. The narrator then transmitted the tradition like the one narrated by Malik. This version adds : “Young and old. He gave command that this should be paid before the people went out to prayers.” Abu Dawud said : ‘Abd Allah al-‘Umari narrated it from Nafi’ through his chain : “on every Muslim.” The version of Sa’id al-Jumahi has : “Among the Muslims.” The well-known version transmitted by ‘Ubaid Allah does not mention the words “among the Muslims”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "Ibn ‘Umar said :The Messenger of Allah(ﷺ) prescribed sadaqah at the end of Ramadan one sa’ of barley and dried dates, payable by young and old freeman and slave. The version of Musa adds : “ male and female”. Abu Dawud said : the words “male and female” narrated, by Ayyub and ‘Abd Allah al Umar were narrated in their version on the authority of Nafi’",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "Narrated Abdullah ibn Umar: The people during the lifetime of the Messenger of Allah (ﷺ) used to bring forth the sadaqah at the end of Ramadan when closing the fast one sa' of barley whose straw is removed, or of raisins. Abdullah said: When Umar (Allah be pleased with him) succeeded, and the wheat became abundant, Umar prescribed half a sa' of wheat instead of all these things",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "Abd’ Allah(b. 'Umar) said “The people then began to pay half a sa’ of wheat later on. The narrator said :'Abd Allah (b. Umar) use to pay dried dates as sadaqah one year the people of Medina lacked dried dates, hence he paid barley",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "Abu sa’id al-khudri said :When the Messenger of Allah(May peace be upon him) lived among us, we use to bring forth zakat, on closing the fast of Ramadan one sa’ of grain or of cheese, or of barley, or of dried dates, or of raisens, payable by every young and old freeman and slave. We continued to pay this till mu-awayah came to perform Haj or Umra and he spoke to the people on the pulpit. What he said to the people was : I think that Mudds of the wheat of syrria is equivalent to one sa’ of dried dates. So the people adopted it. Abu sa’id said : But I continued to pay one sa’ of wheat as long as I lived on. Abu Dawud said : this tradition has also been transmitted by Abu sa’id through a different chain of narrators to the same effect. A man has narrated in this version from Ibn-Ulayyah one sa’ of wheat. But this version is not guarded",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "The aforesaid tradition has also been transmitted by Abu Sa’id through a different chain of narrators. This version adds :“Half a sa’ of wheat “. But this is a misunderstanding on the part of muawayah b. Hisham and of those who narrated from him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "Narrated Abu Sa'id al-Khudri: I shall always pay one sa'. We used to pay during the lifetime of the Messenger of Allah (ﷺ) one sa' of dried dates or of barley, or of cheese, or of raisins. This is the version of Yahya. Sufyan added in his version: \"or one sa' of flour.\" The narrator Hamid (ibn Yahya) said: The people objected to this (addition); Sufyan then left it. Abu Dawud said: This addition is a misunderstanding on the part of Ibn Uyainah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "Abd Allah b. Tha'labah or Tha'labah bin 'Abd Allah bin Abu Su'air reported on his father's authority that the Messenger of Allah (ﷺ) said:One sa' of wheat is to be taken from every two, young or old, freeman or slave, male or female. Those of you who are rich will be purified by Allah, and those of you who are poor will have more than they gave returned by Him to them. Sulayman added in his version: \"rich or poor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "Abd Allah bin Tha'labah ibn Su'ayr reported on the authority of his father:The Messenger of Allah (ﷺ) stood and gave a sermon; he commanded to give sadaqah, at the end of Ramadan when the fasting is closed, one sa' of dried dates or of barley payable by every person. The narrator Ali added in his version: \"or one sa' of wheat to be taken from every two.\" Both the chains of narrators are then agreed upon the version: \"payable by young and old, freeman and slave",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "Abd Allah b. Tha’labah said (the narrator Ahmad b. salih said :He, i.e “Abd al-Razzaq, said : He is ‘Adawl. Abu Dawud said : Ahmed b. Salih said : He is ‘Adhri): The Messenger of Allah (May peace be upon him) delivered a speech before the closing fast (‘Id) by two days. He then transmitted the tradition like that of al Muqri (‘Abd Allah b. Yazid)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "Al-Hasan said:Ibn Abbas preached towards the end of Ramadan on the pulpit (in the mosque) of al-Basrah. He said: Bring forth the sadaqah relating to your fast. The people, as it were, could not understand. Which of the people of Medina are present here? Stand for your brethren, and teach them, for they do not know. The Messenger of Allah (ﷺ) prescribed this sadaqah as one sa' of dried dates or barley, or half a sa' of wheat payable by every freeman or slave, male or female, young or old. When Ali came (to Basrah), he found that price had come down. He said: Allah has given prosperity to you, so give one sa' of everything (as sadaqah). The narrator Humayd said: Al-Hasan maintained that the sadaqah at the end of Ramadan was due on a person who fasted",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "Abu Hurairah said :The Prophet(ﷺ) sent Umar b. al-Khattab to collect sadaqa (All the people paid the zakat but ibn-jamil, Khalid b. al-walid and al-abbas refused. So the Messenger of Allah(ﷺ) said : Ibn-jamil is not (so much) objecting, but he was poor and Allah enriched him. As for Khalid b. Walid, you are wronging him, for he has kept back his courts of mail and weapons to use them in Allah’s path. As for al-Abbas, the uncle of the Messenger of Allah(May peace be upon him), I shall be responsible for it and an equal amount along with it. Then he said did you not know(Umar) that a man’s paternal uncle is of the same stock as the father or his father?",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "Narrated Ali ibn AbuTalib: Al-Abbas asked the Prophet (ﷺ) about paying the sadaqah (his zakat) in advance before it became due, and he gave permission to do that. Abu Dawud said: This tradition has also been transmitted by Hushaim through a different chain of narrators. The version of Hushaim is more sound",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "Ibrahim ibn Ata, the client of Imran ibn Husayn, reported on the authority of his father:Ziyad, or some other governor, sent Imran ibn Husayn to collect sadaqah (i.e. zakat). When he returned, he asked Imran: Where is the property? He replied: Did you send me to bring the property? We collected it from where we used to collect in the lifetime of the Messenger of Allah (ﷺ), and we spent it where we used to spend during the time of the Messenger of Allah (ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "Narrated Abdullah ibn Mas'ud: The Prophet (ﷺ) said: He who begs (from people) when he is affluent will come on the Day of Resurrection with scrapes, scratchings, or lacerations on his face. He was asked: What constitutes affluence, Messenger of Allah? He replied:It is fifty dirhams or its value in gold. The narrator Yahya said: Abdullah ibn Sufyan said to Sufyan: I remember that Shu'bah does not narrate from Hakim ibn Jubayr. Sufyan said: Zubayr transmitted to us this tradition from Muhammad ibn AbdurRahman ibn Yazid",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "‘Ata’ b. Yasar said :A man from Banu Asad said : I and my family alighted at Baqi al-Gharqad. My wife said to me : Go the Messenger of Allah(ﷺ) and beg something from him for our eating, and made a mention of there need. So I went to the Messenger of Allah(May peace be upon him). I found with a man who was begging from him and he was saying to him: I have nothing to give you. The man turned away from him in anger while he was saying: By my life, you give anyone you wish. The Messenger of Allah(May peace be upon him) said : He’s anger with me, for I have nothing to give him. If any of you begs when he has an Uqiyah or its equivalent, he has begged immoderately. The man of Banu Asad said : So I said : The she camel of ours is better than an uqiyah, while an uqiyah is equivalent to 40 Dirhams. I therefore returned and did not beg from him. Afterwards some barley and raisins where brought to the Messenger of Allah (May peace be upon him). He gave us a share from them (or as he reported)till Allah, the Exalted, made us self-sufficient(i.e well off). Abu Dawud said: Al-Thawri narrated it as Malik narrated",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "Narrated AbuSa'id al-Khudri: The Prophet (ﷺ) said: If anyone begs when he has something equivalent to an uqiyah in value, he has begged immoderately. So I said: My she-camel, Yaqutah, is better than an uqiyah. The version of Hisham goes: \"better than forty dirhams. So I returned and did not beg anything from him.\" Hisham added in his version: \"An uqiyah during the time of the Messenger of Allah (ﷺ) was equivalent to forty dirhams",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "Narrated Sahl ibn Hanzaliyyah: Uyaynah ibn Hisn and Aqra' ibn Habis came to the Messenger of Allah (ﷺ). They begged from him. He commanded to give them what they begged. He ordered Mu'awiyah to write a document to give what they begged. Aqra' took his document, wrapped it in his turban, and went away. As for Uyaynah, he took his document and came to the Prophet (ﷺ) at his home, and said to him: Muhammad, do you see me? I am taking a document to my people, but I do not know what it contains, just like the document of al-Mutalammis. Mu'awiyah informed the Messenger of Allah (ﷺ) of his statement. Thereupon the Messenger of Allah (ﷺ) said: He who begs (from people) when he has sufficient is simply asking for a large amount of Hell-fire. (An-Nufayl (a transmitter) said elsewhere: \"embers of Hell\".) They asked: Messenger of Allah, what is a sufficiency? (Elsewhere an-Nufayl said: What is a sufficiency which makes begging unfitting?) He replied: It is that which would provide a morning and an evening meal. (Elsewhere an-Nufayl said: It is when one has enough for a day and night, or for a night and a day.) He (an-Nufayl) narrated to us this tradition briefly in the words that I have mentioned",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "Narrated Ziyad ibn al-Harith as-Suda'i: I came to the Messenger of Allah (ﷺ) and swore allegiance to him, and after telling a long story he said: Then a man came to him and said: Give me some of the sadaqah (alms). The Messenger of Allah (ﷺ) said: Allah is not pleased with a Prophet's or anyone else's decision about sadaqat till He has given a decision about them Himself. He has divided those entitled to them into eight categories, so if you come within those categories, I shall give you what you desire",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "Abu Hurairah reported Messenger of Allah (May peace be upon him) as saying :The poor man(miskin) is not one who is admitted (by the people) with one or two dates or with one or two morsels but is one, who does not beg anything from his people and is not taken notice of so that alms may be given to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "Narrated AbuHurayrah: The Messenger of Allah (ﷺ) said something similar as mentioned in the preceding tradition. This version adds: But the poor man (miskin) who abstains from begging from the people is one (according to the version of Musaddad who does not get enough so that he may not beg from the people, nor is his need known to the people, so that alms be given to him. This is the one who has been deprived. Musaddad did not mention the words \"one who avoids begging from the people.\" Abu Dawud said: This tradition has been transmitted by Muhammad bin Thawr and 'Abd al-Razzaq on the authority of Ma'mar. They mentioned that the word \"deprived\" is the statement of al-Zuhri, and this is more sound)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "Narrated Ubaydullah ibn Adl ibn al-Khiyar: Two men informed me that they went to the Prophet (ﷺ) when he was at the Farewell Pilgrimage while he was distributing the sadaqah and asked him for some of it. He looked us up and down, and seeing that we were robust, he said: If you wish, I shall give you something, but there is nothing spare in it for a rich man or for one who is strong and able to earn a living",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "Narrated Abdullah ibn Amr : The Prophet (ﷺ) said: Sadaqah may not be given to a rich man or to one who has strength and is sound in limbs. Abu Dawud said: This tradition has been transmitted by Sufyan from Sa'd bin Ibrahim like the tradition narrated by Ibrahim. The version of Shu'bah from Sa'd has: \"for a man who has strength and is robust.\" The other version of this tradition from the Prophet (ﷺ) have the words \"for a man who has strength and is robust.\" Others have \"for a man who has strength and is sound in limbs.\" 'Ata bin Zuhair said that he had met 'Abd Allah bin 'Amr who said: \"Sadaqah is not lawful for a strong man nor for a man who has strength and is sound in limbs",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "Narrated Ata ibn Yasar: The Prophet (ﷺ) said: Sadaqah may not be given to rich man, with the exception of five classes: One who fights in Allah's path, or who collects it, or a debtor, or a man who buys it with his money, or a man who has a poor neighbour who has been given sadaqah and gives a present to the rich man",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "The aforesaid tradition has also been transmitted by abu-Said al-Khudri to the same effect to a different chain of narrators, attributing it to the Messenger of Allah (May peace be upon him). Abu-Dawud said :Ibn ‘Uyainah reported from Zaid, from whom Malik narrated and Thwari narrated from Zaid that an authentic narrator reported from the Messenger of Allah (May peace be upon him)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "Abu-Said reported :Messenger of Allah (May peace be upon him) said : Sadaqah is not lawful for a rich person except what comes as a result of Jihad or what a poor neighbor gifts you out of the sadaqah given to him, or he entertains you in a feast. Abu-Dawud said : This has been transmitted by Abu- Said through a different chain of narrators in a similar way",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "Basheer b. Yasar said that a man from the Ansar called Sahi b. abu-Hatmah told him that Messenger of Allah (May peace be upon him) gave one Hundred camels to him a blood-wit from among the camels of sadaqah, i.e a blood-wit for the Ansari who was killed at Khaibar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "Narrated Samurah ibn Jundub: The Prophet (ﷺ) said: Acts of begging are lacerations with which a man disfigures his face, so he who wishes may preserve his self-respect, and he who wishes may abandon it; but this does not apply to one who begs from a ruler, or in a situation which makes it necessary",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "Qabisah b. Mukhiriq al-Hilali said :I became a guarantor for a payment, and I came to Messenger of Allah (May peace be upon him). He said: Wait till I receive the sadaqah and I shall order it to be given to you. He then said : Begging, Qabisah, is allowable only to one of three classes: a man who has become a guarantor for a payment to whom begging is allowed till he gets it, after which he must stop (begging); a man who has been stricken by a calamity and it destroys his property to whom begging is allowed till he gets what will support life (or he said, what will provide a reasonable subsistence); and a man who has been smitten by poverty, about whom three intelligent members of his people confirm by saying: So and so has been smitten by poverty, to such a person begging is allowed till be gets what will support life (or he said, what will provide a reasonable subsistence), after which he must stop (begging). Any other reason for begging, Qabisah, is forbidden, and one who engages in such consumes it as a thing which is forbidden",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "Narrated Anas ibn Malik: A man of the Ansar came to the Prophet (ﷺ) and begged from him. He (the Prophet) asked: Have you nothing in your house? He replied: Yes, a piece of cloth, a part of which we wear and a part of which we spread (on the ground), and a wooden bowl from which we drink water. He said: Bring them to me. He then brought these articles to him and he (the Prophet) took them in his hands and asked: Who will buy these? A man said: I shall buy them for one dirham. He said twice or thrice: Who will offer more than one dirham? A man said: I shall buy them for two dirhams. He gave these to him and took the two dirhams and, giving them to the Ansari, he said: Buy food with one of them and hand it to your family, and buy an axe and bring it to me. He then brought it to him. The Messenger of Allah (ﷺ) fixed a handle on it with his own hands and said: Go, gather firewood and sell it, and do not let me see you for a fortnight. The man went away and gathered firewood and sold it. When he had earned ten dirhams, he came to him and bought a garment with some of them and food with the others. The Messenger of Allah (ﷺ) then said: This is better for you than that begging should come as a spot on your face on the Day of Judgment. Begging is right only for three people: one who is in grinding poverty, one who is seriously in debt, or one who is responsible for compensation and finds it difficult to pay",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "Awf b. Malik said :We were with Messenger of Allah (May peace be upon him), seven or eight or nine. He said : Do you take the oath of allegiance to the Messenger of Allah (May peace be upon him), and we shortly took the oath of allegiance. We said: we have already taken the oath of allegiance to you. He repeated the same words three times. We then stretched our hands and took the oath of allegiance to him. A man (or us) said : We took the oath of allegiance to you; now on what should we take the oath of allegiance, Messenger of Allah ? He replied: That you should worship Allah, do not associate anything with Him, offer five times prayer, listen and obey. He uttered a word quietly : And do not beg from the people. When the whip fell on the ground, none of that group asked anyone to pick up the whip for him. Abu Dawud said : The version of Hisham was not narrated by anyone except Sa'id",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "Thawban, the client of the Messenger of Allah (May peace be upon him), reported him as saying :If anyone guarantees me that he will not beg from people, I will guarantee him Paradise. Thawban said : I (will not beg). He never asked anyone for anything",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "Abu Said al-Khudri said :Some of the Ansar begged from the Messenger of Allah (May peace be upon him) and he gave them something. They later begged from him again and he gave them something so that what he had was exhausted. He then said :What I have I shall never store away from you but Allah will strengthen the abstinence of him who abstains, will give a satisfaction to him who wants to be satisfied, and will strengthen the endurance of him who shows endurance. No one has been given a more ample gift than endurance",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "Narrated Abdullah ibn Mas'ud: The Prophet (ﷺ) said: If one who is afflicted with poverty refers it to me, his poverty will not be brought to an end; but if one refers it to Allah, He will soon give him sufficiency, either by a speedy death or by a sufficiency which comes later",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "Narrated Ibn al-Firasi: Al-Firasi asked the Messenger of Allah (ﷺ): May I beg, Messenger of Allah? The Prophet (ﷺ) said: No, but if there is no escape from it, beg from the upright",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "Ibn al-Saidi said :Umar employed me to collect the sadaqah. When I finished doing so and gave it to him, he ordered payment to be given to me. I said: I did only for Allah’s sake, and my reward will come from Allah. He said: Take what you are given, for I acted (as a collector) during the time of the Messenger of Allah (May peace be upon him) and he assigned me a payment. Thereupon, I said the same kind of thing as you have said, to which Messenger of Allah (May peace be upon him) said: When you are given something without asking for it, you should use it for your own purpose and as sadaqah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "Abd Allah b. ‘Umar reported that the Messenger of Allah (May peace be upon him) said when he was on the pulpit speaking of sadaqah and abstention from it and begging :the upper hand is better than the lower one, the upper being the one which bestows and the lower which begs. Abu Dawud said : The version of this tradition narrated by Ayyub from Nafi is disputed. The narrator `Abd al-Warith said in his version : `The upper hand is the one which abstains from begging;” but most of the narrators have narrated from Hammad b. Zaid from Ayyub the words “ The upper hand is the one which bestows.” A narrator from Hammad said in his version “the one which abstains from begging.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "Narrated Malik ibn Nadlah: The Prophet (ﷺ) said: Hands are of three types: Allah's hand is the upper one; the bestower's hand is the one near it; the beggar's hand is the lower one. So bestow what is surplus, and do not submit yourself to the demand of your soul",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "Narrated AbuRafi': The Prophet (ﷺ) sent a man of the Banu Makhzum to collect sadaqah. He said to AbuRafi': Accompany me so that you may get some of it. He said: (I cannot take it) until I go to the Prophet (ﷺ) and ask him. Then he went to him and asked him. He said: The sadaqah is not lawful for us, and the client of a people is treated as one of them",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "Anas said :The Messenger of Allah (May peace be upon him) came upon a date on the road; he would not take it for fear of being a part of the sadaqah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "Anas said:Messenger of Allah (May peace be upon him) found a date and said: Were it not that I fear it may be part of the sadaqah, I would eat it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "Narrated Abdullah ibn Abbas: My father sent me to the Prophet (ﷺ) to take the camels which he had given him from among those of sadaqah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "The aforesaid tradition has also been transmitted by Ibn Abbas through a different chain of narrators in a similar manner. This version adds :“My father exchanged them for him”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "Anas said when some meat was brought to the Prophet (SAWS), he asked What is this? He was told this is a thing (meat), which was given as sadaqah to Barirah. Thereupon, he said it is sadaqah for her and a gift to us",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "Buraidah said A woman came to the Messenger of Allah (SAWS) and said I gave a slave girl as sadaqah to my mother who has now died and has left that slave girl. He said your reward is sure and the inheritance has given her back to you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "Narrated Abdullah ibn Mas'ud: During the time of the Messenger of Allah (ﷺ) we used to consider ma'un (this of daily use) lending a bucket and cooking-pot",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "Abu Hurairah reported that Messenger of Allah (SWAS) as saying If any owner of treasure (gold and silver) does not pay what is due on it, Allah will make it heated in the Hell fire on the Day of Judgment, and his side, forehead and back will be cauterized with it until Allah gives His Judgment among mankind during a day whose extent will be fifty thousand years of your count and he sees whether his path is to take him to Paradise or to Hell. If any owner does not pay zakat on them, the sheep wilkl appear on the Day or Judgment most strong and in great number, a soft sandy plain will be spread out for them ; they will gore him with their horns and trample him with their hoofs; there will be none of them with twisted horns or without horns. As often as the last of them passes him, the first of them will be brought back to him, until Allah pronounces His Judgment among mankind during a day whose extent will be fifty thousand years that you count, and he sees whether his path is to take him to Paradise or to Hell. If any owner of camels does not pay what is due on them, they will appear in on the Day or Judgment most strong and in great number, a soft sandy plain will be spread out for them ; they will gore him with their horns and trample him with their hoofs; there will be none of them with twisted horns or without horns. As often as the last of them passes him, the first of them will be brought back to him, until Allah pronounces His Judgment among mankind during a day whose extent will be fifty thousand years that you count, and he sees whether his path is to take him to Paradise or to Hell",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "The above mentioned tradition has also been transmitted by Abu Hurairah through a different chain of narrators in a similar manner from the Prophet (SAWS). This version adds after the words “does not pay what is due on them” in the description of the camels the words “ One thing which is due being to milk them when they come down to drink water.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "Narrated Abu Hurayrah: I heard the Messenger of Allah (ﷺ) as saying something similar to this tradition. He (the narrator) said to AbuHurayrah: What is due on camels? He replied: That you should give the best of your camels (in the path of Allah), that you lend a milch she-camel, you lend your mount for riding, that you lend the stallion for covering, and that you give the milk (to the people) for drinking",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "The aforesaid tradition has also been transmitted by ‘Ubaid bin ‘ Umair through a different chain of narrators. This version goes:A man asked: Messenger of Allah (ﷺ), what is due on camels? He replied in a similar way. This version adds \"and to lend its udders.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "Jabir bin ‘Abdallah said The bProphet (SWAS) commanded that he who plucks ten wasqs of dates from date palms should hang a bunch of dates in the mosque for the poor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "Abu Sa’id al-Khudri said While we were traveling along with the Messenger of Allah (ﷺ) a man came to him on his she camel, and began to drive her right and left. The Messenger of Allah (ﷺ) said he who has a spare riding beast should give it to him who has no riding beast; and he who has surplus equipment should give it to who has no equipment. We thought that none of us had a right in surplus property",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "Narrated Abdullah ibn Abbas: When this verse was revealed: \"And those who hoard gold and silver,\" the Muslims were grieved about it. Umar said: I shall dispel your care. He, therefore, went and said: Prophet of Allah, your Companions were grieved by this verse. The Messenger of Allah (ﷺ) said: Allah has made zakat obligatory simply to purify your remaining property, and He made inheritances obligatory that they might come to those who survive you. Umar then said: Allah is most great. He then said to him: Let me inform you about the best a man hoards; it is a virtuous woman who pleases him when he looks at her, obeys him when he gives her a command, and guards his interests when he is away from her",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "Narrated Ali ibn Abu Talib: The Prophet (ﷺ) said: A beggar has the right though he may be riding (a horse)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "The above mentioned tradition has also been transmitted by 'Ali through a different chain of narrators in a similar manner from the Prophet(ﷺ)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "Narrated Umm Bujayd: She took the oath of allegiance to the Messenger of Allah (ﷺ) and said to him: Messenger of Allah, a poor man stands at my door, but I find nothing to give him. The Messenger of Allah (ﷺ) said to her: If you do not find anything to give him, put something in his hand, even though it should be a burnt hoof",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "Asma‘ said My mother came to me seeking some act of kindness from me during the treaty of the Quraish (at Hudaibiyyah). While she hated Islam and she was a polytheist. I said Messenger of Allah (ﷺ), my mother has come to me while she hates Islam and she is a disbeliever. May I do an act of kindness to her? He replied Yes, do an act of kindness to her",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "Buhaysah reported on the authority of his father:My father sought permission from the Prophet (ﷺ). (When permission was granted and he came near him) he lifted his shirt, and began to kiss him and embrace him (out of love for him). He asked: Messenger of Allah, what is the thing which it is unlawful to refuse? He replied: Water. He again asked: Prophet of Allah, what is the thing which it is unlawful to refuse? He replied: Salt. He again asked: Prophet of Allah, what is the thing which it is unlawful to refuse? He said: To do good is better for you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "‘Abd al-Rahman bin Abu Bakr (may Allah be pleased with him) said The Messenger of Allah (ﷺ) asked Is there anyone of you who provided food to a poor man today? Abu Bakr said I entered the mosque where a beggar was begging ; I found a piece of bread in the hand of ‘Abdal-Rahman which I took and gave it to him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "Narrated Jabir ibn Abdullah: The Prophet (ﷺ) said: Nothing but Paradise must be begged for Allah's sake",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "Narrated Abdullah ibn Umar: The Prophet (ﷺ) said: If anyone seeks protection in Allah's name, grant him protection; if anyone begs in Allah's name, give him something; if anyone gives you an invitation, accept it; and if anyone does you a kindness, recompense him; but if you have not the means to do so, pray for him until you feel that you have compensated him",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "Narrated Jabir ibn Abdullah Al-Ansari: While we were sitting with the Messenger of Allah (ﷺ) a man brought him some gold equal in weight to an egg, and said: Messenger of Allah, I have got this from a mine; take it; it is sadaqah. I have no more than this. The Messenger of Allah (ﷺ) turned his attention from him. Then he came to him from his right side and repeated the same words. But he (the Prophet) turned his attention from him. He then came to him from his left side and repeated the same words. But he (again) turned his attention from him. He then came to him from behind. The Messenger of Allah (ﷺ) took it and threw it away. Had it hit him, it would have hurt him or wounded him. The Messenger of Allah (ﷺ) said: One of you brings all that he possesses and says: This is sadaqah. Then he sits down and spreads his hand before the people. The best sadaqah is that which leaves a competence",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "The above mentioned tradition has also been transmitted by Ibn Ishaq through a different chain of narrators to the same effect. This version adds \"have your property with you from us. We have no need of it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "Narrated Abu Sa'id al-Khudri: A man entered the mosque. The Prophet (ﷺ) commanded the people to throw their clothes as sadaqah. Thereupon they threw their clothes (as sadaqah). He then asked him to take two clothes from them. He reprimanded him and said: Take your clothe",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "Abu Hurairah reported the Messenger of Allah (ﷺ) as saying The best sadaqah is that which leaves a competence ; and begin with those for whom you are responsible",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "Abu Hurairah reported I asked Messenger of Allah (ﷺ), What kind of sadaqah is most excellent? He replied What a man with little property can afford to give; and begin with those for whom you are responsible",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "Narrated Umar ibn al-Khattab: The Messenger of Allah (ﷺ) commanded us one day to give sadaqah. At that time I had some property. I said: Today I shall surpass AbuBakr if I surpass him any day. I, therefore, brought half my property. The Messenger of Allah (ﷺ) asked: What did you leave for your family? I replied: The same amount. AbuBakr brought all that he had with him. The Messenger of Allah (ﷺ) asked him: What did you leave for your family? He replied: I left Allah and His Apostle for them. I said: I shall never compete you in anything",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "Sa’id reported Sa’d came to the Prophet (SWAS) and asked him Which sadaqah do you like most? He replied Water",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "The above mentioned tradition has also been narrated by Sa’d bin ‘Ubadah from the Prophet (ﷺ) in the same manner",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "Narrated Sa'd ibn Ubadah: Sa'd asked: Messenger of Allah, Umm Sa'd has died; what form of sadaqah is best? He replied: Water (is best). He dug a well and said: It is for Umm Sa'd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "Narrated Abu Sa'id (al-Khudri): The Prophet (ﷺ) said: If any Muslim clothes a Muslim when he is naked, Allah will clothe him with some green garments of Paradise; if any Muslim feeds a Muslim when he is hungry, Allah will feed him with some of the fruits of Paradise; and if any Muslim gives a Muslim drink when he is thirsty, Allah will give him some of the pure wine which is sealed to drink",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Batil"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Prophet (ﷺ) said: There are forty characteristics; the highest of them is to give a goat on loan (for benefiting from its milk). If any man carries out any of those characteristics with the hope of getting a reward and testifying to the promise for it, Allah will admit him to Paradise for it. Abu Dawud said: In the version of Musaddad, Hassan said: So we counted other characteristics than lending the goat: to return the greeting, to respond to sneezing, and remove things which cause annoyance to the people from their path, and similar other things. We could not reach fifteen characteristics",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "Abu Musa reported The Messenger of Allah (ﷺ) as saying The faithful trustee who gives what he is commanded completely and in full with a good will, and delivers it to the one whom he was told to give it, is one of the two who gives sadaqah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "A’ishah reported The Messenger of Allah (ﷺ) as saying When a woman gives (some of the property) from her husband’s house, not wasting it, she will have her reward for what she has spent, and her husband will have his for what he earned. The said applies to a trustee. In no respect does the one diminish the reward of the other",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "Sa’d said When the Messenger of Allah (SWAS) took the oath of allegiance from woman, a woman of high rank, who seemed to be one of the women of Mudar, rose and said Prophet of Allah (SWAS), we are dependant on our parents, our sons. (Abu Dawud said I think (this version) has the word “ and our husbands”. ) So what part of their property can be spent lawfully? He said Fresh food which you eat and give as a present. Abu Dawud said The Arabic word ratb means bread, vegetables and fresh dates. Abu Dawud said Al-Thawri transmitted from Yunus in a similar manner",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "Abu Hurairah reported The Messenger of Allah (ﷺ) as saying When a woman gives something her husband has earned without being commanded by him to do so, she has half his reward",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "‘Ata said Abu Hurairah was asked Whether a woman could give sadaqah from the house (property) of her husband. He replied `No’. She can give it from her maintenance. The reward will be divided between them. It is not lawful for her to give sadaqah from her husband’s property without his permission. Abu Dawud said This version weakens the version narrated by Hammam (bin Munabbih)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "Anas said When the verse “You will never attain righteousness until you give freely of what you love\" came down, Abu Talhah said Messenger of Allah (ﷺ), I think our Lord asks us for our property. I call you as witness that I dedicate my land at Ariha ‘to Him’. The Messenger of Allah (ﷺ) said to him Divide it among your nearest relatives. So he divided it among Hassan bin Thabit and Ubayy bin Ka’b. Abu Dawud said I have been gold by an Ansari Muhammad bin ‘Abdallah that the name of Abu Talhah is Zaid bin Sahal bin al-Aswad bin Haram bin ‘Amar bin Zaid bin Manat bin ‘Adi bin ‘Amr bin Malik bin al-Najjar; and Hassan bin Tabit is son of al-Mundhir in al-Haram. Thus both of them (Abu Talhah and Hassan) have their common link in Haram who is the third great grandfather. Ubbay bin Ka’b is son of Qais bin ‘Atik bin Zaid bin Mu’awiyah bin ‘Amr bin Malik bin al-Najjar. Thus the common tie between Hassan, Abu Talhah and Ubbay is ‘Amr (bin Malik). The Ansari said between Ubbay and Abi Talhah there are six great grandfathers",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "Maimunah, wife of the Probhet (ﷺ) said :I had a slave girl and I set her free. When the Prophet (ﷺ) entered upon me, I informed him (of this). He said : May Allah give reward for it; if you had given her to your maternal uncles, it would have increased your reward",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "Narrated Abu Hurayrah: The Prophet (ﷺ) commanded to give sadaqah. A man said: Messenger of Allah, I have a dinar. He said: Spend it on yourself. He again said: I have another. He said: Spend it on your children. He again said: I have another. He said: Spend it on your wife. He again said: I have another. He said: Spend it on your servant. He finally said: I have another. He replied: You know best (what to do with it)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "Abd Allah bin ‘Amr reported the Messenger of Allah (ﷺ) as saying :It is sufficient sin for a man that he neglects him whom he maintains",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "Anas reported the Messenger of Allah (ﷺ) as saying :Anyone who is pleased that his sustenance is expanded and his age extended should do kindness to his near relatives",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "Narrated AbdurRahman ibn Awf: I heard the Messenger of Allah (ﷺ) say: Allah the Exalted has said: I am Compassionate, and this has been derived from mercy. I have derived its name from My name. If anyone joins it, I shall join him, and if anyone cuts it off, I shall cut him off",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "The above mentioned tradition has also been narrated by `Abd al-Rahman bin ‘Awf from the Messenger of Allah (SWAS) through a different chain of narrators to the same effect",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "Jubair bin Mut’im reported on the authority of his father:The Prophet(ﷺ) said: Anyone who cuts off relationship from his nearest relatives will not enter Paradise",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "Abd Allah bin `Amr said :(Sufyan said : The version of the narrator Sulaiman does not go back to The Prophet (SAWS). Fitr and al-Hasan reported from him ) : The Messenger of Allah (SAWS) said : One who compensates is not a man who unites relationship : but the man who unites relationship is the one who joins it when the relationship is cut off",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "Narrated Abdullah ibn Amr ibn al-'As: The Messenger of Allah (ﷺ) preached and said: Abstain from avarice, for those who had been before you were annihilated due to avarice. It (avarice) commanded them to show niggardliness; it commanded them to cut off their relationship with their nearest relatives, so they cut off. It commanded them to show profligacy, so they showed it",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "Asma, daughter of Abu Bakr, said :I said : Messenger of Allah(SAWS), I have nothing of my own except what al-Zubair (her husband) brings to me in his house: should I spend out of it? He said : Give and do not hoard so your sustenance will be hoarded",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "Abu Mulaykah reported:Aisha counted a number of indigents. AbuDawud said: The other version has: She counted a number of sadaqahs. The Messenger of Allah (ﷺ) said: Give and do not calculate, so calculation will be made against you",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		}
	]
}