{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"12": "The Book on Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "১১৬৯। আবু সাঈদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ আল্লাহ ও আখিরাতের উপর যে সকল মহিলা ঈমান রাখে, তার সাথে তার পিতা অথবা তার ভাই অথবা তার স্বামী অথবা তার ছেলে অথবা তার কোন মাহরাম আত্মীয় না থাকলে সে সকল মহিলার জন্য তিন দিন বা তার বেশি সময় (একাকী) সফর করা বৈধ নয়। — সহীহ, ইবনু মাজাহ (২৮৯৮), বুখারী, মুসলিম আবু হুরাইরা, ইবনু আব্বাস ও ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। আবু ঈসা বলেন, হাদীসটি হাসান সহীহ। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে আরো বর্ণিত আছে যে, তিনি বলেছেনঃ “কোন মহিলা যেন এক দিন ও এক রাতের পথও অতিক্রম না করে তার সাথে কোন মাহরাম আত্মীয় না নিয়ে (একাকী)\"। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। কোন মাহরাম আত্মীয় ব্যতীত কোন মহিলার একাকী ভ্রমণকে তারা মাকরূহ বলেছেন। কোন মহিলার ধন-সম্পদ আছে কিন্তু কোন মাহরাম আত্মীয় নেই, সে মহিলা এরকম পরিস্থিতিতে হাজের সফরে বের হতে পারবে কি-না এই বিষয়ে আলিমদের মধ্যে দ্বিমত আছে। একদল আলিম বলেন, হাজ্জ আদায় করা সে মহিলার জন্য ফরজ নয়। কেননা, রাস্তা অতিক্রমের যোগ্যতা থাকার শর্তের মধ্যে মাহরাম আত্মীয় সাথে থাকার শর্ত অন্তর্ভুক্ত আছে। আল্লাহ তা'আলা বলেনঃ “এই ঘরে পৌছানো পর্যন্ত যে লোকের সামর্থ্য আছে”। অতএব, তারা বলেন, যখন তার কোন মাহরাম আত্মীয় নেই তখন এই ঘর (কাবা) পর্যন্ত পৌছার সামর্থ্যও তার নেই। এই মত সুফিয়ান সাওরী ও কুফাবাসী আলিমদের। আর একদল আলিম বলেছেন, যাতায়াতের রাস্তা যদি বিপদ মুক্ত হয় তবে সে ভিন্ন লোকের সাথে হাজ্জ আদায়ের উদ্দেশ্যে যেতে পারে। এই মত দিয়েছেন ইমাম মালিক ও শাফিঈ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		}
	]
}