{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"13": "The Book on Divorce and Li'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "১২০৪। যাইনাব বিনতু কাব ইবনু উজরা (রাঃ) হতে বর্ণিত আছে, তাকে মালিক ইবনু সিনান (রাঃ)-এর মেয়ে এবং আবু সাঈদ আল-খুদরী (রাঃ)-এর বোন ফুরাইআ (রাঃ) জানিয়েছেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে আসেন একটা প্রশ্ন করার উদ্দেশ্যে যে, ইন্দাতের জন্য তার নিজের বংশ খুদরা গোত্রে যেতে পারেন কি-না। তার স্বামী তার কয়েকটি পলাতক গোলামের খোজে গিয়েছিলেন। তিনি যখন পত্যাবর্তন করতেছিলেন তখন তাদের সাথে সাক্ষাৎ ঘটে এবং তারা সেখানে তাকে মেরে ফেলে। ফুরাইআ (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট আমার বাবার বাড়ী যাওয়ার উদ্দেশ্যে আবেদন করলাম। কেননা, আমার জন্য আমার স্বামী তার নিজস্ব কোন ঘর রেখে যাননি, এমনকি ভরণ-পোষণের খরচপাতিও নয়। ফুরাইআ (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হ্যাঁ বললেন। তিনি বলেন, তারপর আমি ফিরে চললাম। আমি শুধু (তার) হুজরা অথবা মসজিদের নিকটে পৌছলাম, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে আবার ডাকলেন বা আমাকে ডাকার নির্দেশ দিলেন। আমাকে তিনি প্রশ্ন করলেনঃ তুমি কি বলেছিলে? ফুরাইআ (রাঃ) বলেন, আমার স্বামী সম্পর্কে পূর্বে আমি যে ঘটনা বলেছিলাম তার নিকট তা আবার বললাম। তিনি বললেনঃ তুমি তোমার ঘরেই থাক ইদ্দাত পূর্ণ না হওয়া পর্যন্ত। ফুরাইআ (রাঃ) বলেন, আমি এখানে ইদ্দাত পালন করলাম চার মাস দশদিন। তিনি বলেন, তারপর উসমান (রাঃ) খালীফা হওয়ার পর তিনি আমার কাছে লোক পাঠিয়ে এ বিষয়টি জানতে চাইলেন। আমি এ প্রসঙ্গে তাকে জানালাম। তিনি এর অনুসরণ করেছেন এবং সে অনুযায়ী ফায়সালা দিয়েছেন। — সহীহ, ইবনু মাজাহ (২০৩১) এ হাদীসটি কাব ইবনু উজরা (রাঃ) হতে অন্য একটি সূত্রেও বর্ণিত হয়েছে। এ হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের বেশিরভাগ বিশেষজ্ঞ সাহাবী ও অপরাপর আলিমগণ মত দিয়েছেন। তাদের মতে, ইদ্দাতের সময় পূর্ণ না হওয়া পর্যন্ত ইদ্দাত পালনকারী স্বামীর ঘর হতে যাবে না। এই মত দিয়েছেন সুফিয়ান সাওরী, শাফিঈ, আহমাদ ও ইসহাক। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামে অপর একদল বিশেষজ্ঞ সাহাবী ও তৎপরবর্তী আলিমগণ বলেন, মহিলা তার ইচ্ছামত যে কোন জায়গায় ইদ্দাত পালন করতে পারে। স্বামীর ঘরে ইদ্দাত পালন না করলেও কোন সমস্য নেই। আবু ঈসা বলেন, কিন্তু প্রথমোক্ত মতই অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		}
	]
}