{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"14": "The Book on Business"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "১২৪৪৷ সালিম (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (পিতা) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি বলতে শুনেছিঃ তাবীরের পর কোন লোক খেজুর বাগান কিনলে এর ফলের মালিক হবে বিক্রেতা, যদি ক্রয়কারীর জন্য (মালিকানা) শর্ত করা না হয়। যদি কোন লোক সম্পদশালী গোলাম কিনে তবে ঐ সম্পদের অধিকারী হবে বিক্রেতা, ক্রেতার জন্য ঐ সম্পদের যদি কোনরূপ শর্ত করা না হয়। সহীহ, ইবনু মা-জাহ (২২১০, ২২১২), নাসা-ঈ জাবির (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। ইবনু উমার (রাঃ) হতে বর্ণিত হাদীসটি হাসান সহীহ। একইভাবে একাধিক সূত্রে যুহরী হতে, তিনি সালিমের সূত্রে, তিনি ইবনু উমারের সূত্রে বর্ণনা করেছেন, রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেনঃ কোন লোক তাবীরের পর খেজুর গাছ কিনলে বিক্রেতাই তার ফল ভোগ করবে, যদি ক্রয়কারী এর মালিকানার কোন শর্ত না করে থাকে। একইভাবে কোন লোক যদি সম্পদশালী গোলাম কিনে তবে বিক্রেতা তার সম্পদের অধিকারী হবে, যদি ক্রেতার জন্য কোন শর্ত নির্ধারণ করা না হয়। ইবনু উমার (রাঃ)-এর সূত্রে নাফি (রাঃ) বর্ণনা করেছেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তাবীরের কাজ পূর্ণ হওয়ার পর কোন শর্ত করা হলে তা সে পাবে। নাফি হতে ইবনু উমারের সূত্রে বর্ণিত আছে, তিনি উমার হতে বর্ণনা করেছেন, তিনি বলেছেন, যদি কোন লোক সম্পদশালী গোলাম কিনে তবে বিক্রেতাই এই সম্পদের মালিক হবে, কিন্তু ক্রেতার জন্য শর্ত করা হলে তা সে পাবে। একইরকম হাদীস আরো কয়েকটি সূত্রে বর্ণিত আছে। এ হাদীস অনুযায়ী একদল আলিম আমল করেছেন। একই কথা বলেছেন ইমাম শাফিঈ, আহমাদ ও ইসহাকও। ইমাম বুখারী বলেছেন, সালিমের সূত্রে যুহরী হতে বর্ণিত ইবনু উমারের হাদীসটি এ অনুচ্ছেদে সর্বাধিক সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 44
			}
		}
	]
}