{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"15": "The Chapters On Judgements From The Messenger of Allah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "১৩৬১। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাকে কোন এক সামরিক অভিযানে যাওয়ার সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে হাযির করা হয়। তখন আমার বয়স ছিল চৌদ বছর। তিনি আমাকে (সৈনিক হিসাবে) গ্রহণ করেননি। এর পরের বছর এক সামরিক অভিযানে যাওয়ার সময় আমাকে আবার তার সামনে হাযির করা হয়। তখন আমার বয়স ছিল পনের বছর। এবার তিনি আমাকে সেনাবাহিনীতে নিয়ে নিলেন। নাফি (রাহঃ) বলেন, আমি এ হাদীসটি উমার ইবনু আবদুল আযীয (রহঃ)-এর নিকট বর্ণনা করলে তিনি বলেনঃ এটাই হল নাবালেগ ও বালেগের মধ্যকার বয়সসীমা। তারপর তিনি লিখিত নির্দেশ প্রদান করলেন- যে পনের বছর বয়সে পৌছেছে তার ভাতা নির্ধারণের জন্য। সহীহ, বুখারী (২৬৬৪, ৬/৩০) ইবনু উমার হতে, তিনি নাফি হতে এই সূত্রেও ইবনু উমর (রাঃ) হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের উপরের হাদীসের মত হাদীস বর্ণিত হয়েছে। কিন্তু এ কথাটুকু এই সূত্রে উল্লেখ নেইঃ উমার ইবনু আবদুল আযীয (রহঃ) লিখে পাঠালেন, এটাই বালেগ ও নাবালেগের মধ্যকার বয়সসীমা। একথাই ইবনু উআইনা তার হাদীসের মধ্যে উল্লেখ করেছেনঃ আমি এ হাদীসটিকে উমার ইবনু আবদুল আযীযের সামনে বর্ণনা করলে তিনি বলেন, এটাই হচ্ছে নাবালেগ ও সৈনিকের মধ্যে বয়সসীমা।এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস অনুযায়ী বিশেষজ্ঞ আলিমগণ আমল করেছেন। এরকম মতই সুফিয়ান সাওরী, ইবনুল মুবারাক, শাফিঈ, আহমাদ ও ইসহাক (রাহঃ)-এর। তাদের মতে, নাবালেগ সন্তান পনের বছরে পৌছার সাথে সাথে বালেগদের মধ্যে গণ্য হবে। পনের বছরের পূর্বেই যদি স্বপ্লদোষ হয় তবে সে বলেগ বলে গণ্য হবে। আহমাদ ও ইসহাক বলেছেন, বালেগ হওয়ার জন্য তিনটি বিকল্প নিদর্শন রয়েছে, পনের বছর বয়স হওয়া; ইহতিলাম (বীর্যপাত) হওয়া; যদি এরকম হয় যে, বয়সও অনুমান করা যাচ্ছে না আবার ইহতিলামও হয় না এক্ষেত্রে লজ্জাস্থানে লোম গজানোকে ধরে নিতে হবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 41
			}
		}
	]
}