{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"15": "The Chapters On Judgements From The Messenger of Allah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "১৩৬৩। উরওয়া (রহঃ) হতে বর্ণিত আছে, আবদুল্লাহ ইবনুয যুবাইর (রাঃ) তাকে বলেছেন, হাররা হতে বয়ে আসা নালার পানির বণ্টনকে কেন্দ্র করে যুবাইর (রাঃ)-এর বিরুদ্ধে একজন আনসার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট অভিযোগ উত্থাপন করে। এ নালার পানি তারা খেজুর বাগানেও সিঞ্চন করতেন। আনসারী দাবি করল, পানি প্রবাহিত হতে দাও। কিন্তু যুবাইর (রাঃ) তা অস্বীকার করেন। তারা এই বিবাদকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সামনে উপস্থাপন করল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুবাইর (রাঃ)-কে বললেনঃ হে যুবাইর! তোমার ক্ষেতে পানি প্রবাহিত কর, তারপর তোমার প্রতিবেশীর ক্ষেতের দিকে তা প্রবাহিত হতে দাও। আনসারী এতে ক্রোধান্বিত হয়ে বলল, আপনার ফুফাত ভাই তো! এ কথায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মুখমণ্ডল রক্তিমবর্ণ ধারণ করল। তিনি বললেনঃ হে যুবাইর তোমার ক্ষেতে পানি প্রবাহিত কর, তারপর তা আটক করে রাখ-যাতে তা আইল পর্যন্ত উঠতে পারে। যুবাইর (রাঃ) বলেন, আল্লাহর শপথ! আমার মনে হয় এ প্রসঙ্গেই নিম্নোক্ত আয়াত অবতীর্ণ হয়েছেঃ “না, হে মুহাম্মাদ! তোমার প্রতিপালকের শপথ! এরা কোন অবস্থাতেই ঈমানদার হতে পারে না, যে পর্যন্ত না তাদের পারস্পরিক মতভেদের ব্যাপারসমূহে তোমাকে বিচারকরূপে মেনে না নিবে। তারপর তুমি যে ফায়সালাই করবে তার প্রসঙ্গে তারা নিজেদের মনে কিছুমাত্র কুষ্ঠাবোধ করবে না; বরং নিজেদেরকে এর সামনে সম্পূর্ণভাবে সমর্পণ করবে” (সূরাঃ নিসা-৬৫)। সহীহ, নাসা-ঈ এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এই হাদীসটি শুআইব ইবনু আবূ হামযা-যুহরী হতে, তিনি উরওয়া হতে, তিনি যুবাইর (রাঃ) হতে এ সনদেও বর্ণিত আছে। তাতে আবদুল্লাহ ইবনুয যুবাইর (রাঃ)-এর উল্লেখ নেই। পূর্বোক্ত হাদীসের মত আবদুল্লাহ ইবনু ওয়াহব-লাইস হতে ও ইউনুস-যুহরী হতে, তিনি উরওয়া হতে, তিনি আবদুল্লাহ ইবনু যুবাইর (রাঃ)হতে এ সূত্রেও বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 43
			}
		}
	]
}