{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"15": "The Chapters On Judgements From The Messenger of Allah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "১৩৭৩। যাইদ ইবনু খালিদ আল-জুহানী (রাঃ) হতে বর্ণিত আছে, কোন হারানো জিনিস প্রাপ্তি প্রসঙ্গে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে প্রশ্ন করা হলে তিনি বললেনঃ এক বছর না হওয়া পর্যন্ত এর ঘোষণা দিতে থাক। যদি সনাক্তকারী কোন লোক পাওয়া যায় তাহলে তাকে তা ফিরত দাও। এর ব্যতিক্রম হলে তুমি এর থলে ও থলের বন্ধনী সঠিকভাবে চিনে রাখ এবং এর মধ্যকার জিনিস গণনা করার পর কাজে ব্যবহার কর। তারপর মালিক এসে গেলে এটা তাকে ফিরিয়ে দিও। সহীহ, ইবনু মা-জাহ (২৫০৭), নাসা-ঈ আবূ ঈসা বলেন, উবাই ইবনু কাব, আবদুল্লাহ ইবনু উমার, জারূদ ইবনুল মুআল্লা, ইয়ায ইবনু হিমার ও জারীর ইবনু আবদুল্লাহ (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। যাইদ ইবনু খালিদ (রাঃ) হতে বর্ণিত হাদীসটি উল্লেখিত সনদসূত্রে হাসান, সহীহ এবং গারীব। আহমাদ ইবনু হাম্বল (রাহঃ) এ অনুচ্ছেদে এ হাদীসটিকেই অনেক বেশি সহীহ বলেছেন। হাদীসটি যাইদ (রাঃ) হতে একাধিক সূত্রে বর্ণিত হয়েছে। এ হাদীস মোতাবিক নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল সাহাবী ও তৎপরবর্তী আলিমগণ আমল করেছেন। তারা মনে করেন রাস্তায় কুড়িয়ে পাওয়া জিনিসের ক্ষেত্রে এক বছর পর্যন্ত ঘোষণার পরও মালিকের সন্ধান পাওয়া না গেলে তা নিজের কাজে প্রয়োগ করা যায় এই মত প্রকাশ করেছেন ইমাম শাফিঈ, আহমাদ ও ইসহাক। অন্য একদল সাহাবী ও তৎপরবর্তী আলিমগণ বলেছেন, কুড়িয়ে পাওয়া বস্তুর জন্য এক বছর পর্যন্ত ঘোষণা প্রদান করতে হবে। এর মধ্যে মালিক এসে গেলে তাকে তা ফিরত দিতে হবে অন্যথায় সাদকা (দান) করে দিতে হবে। এই মত প্রদান করেছেন সুফিয়ান সাওরী, আবদুল্লাহ ইবনুল মুবারাক ও কূফাবাসী আলিমগণও। তারা মনে করেন, যে লোক হারিয়ে যাওয়া জিনিস কুড়িয়ে পেয়েছে সে যদি সম্পদশালী হয় তবে এটাকে তার কাজে লাগানো বৈধ হবে না। ইমাম শাফিঈ মনে করেন, কুড়িয়ে পাওয়া লোকটি সম্পদশালী হলেও এটা তার কাজে লাগানো বৈধ। কেননা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের জীবদ্দশায় উবাই ইবনু কা'ব (রাঃ) এক শত দীনারের একটি থলে পেয়েছিলেন। তিনি তাকে নির্দিষ্ট মেয়াদকাল ধরে ঘোষণা দেওয়ার পরে এটা কাজে লাগানোর অনুমতি প্রদান করেন। অথচ তিনি একজন সম্পদশালী লোক ছিলেন। আলী (রাঃ)-ও একইভাবে একটি দীনার পেয়েছিলেন। এক বছর পর্যন্ত তিনি এর ঘোষণা করতে থাকেন, কিন্তু কোন লোকই এটার খোজ করল না। এটা কাজে ব্যবহারের জন্য রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে সম্মতি দেন। রাস্তায় কুড়িয়ে পাওয়া জিনিস শুধুমাত্র সাদকা ভোগকারী ব্যতীত অন্য কারো জন্য হালাল না হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী (রাঃ)-কে এটা কাজে ব্যবহারের জন্য সম্মতি প্রদান করতেন না। কেননা আলী (রাঃ)-এর জন্য সাদকার মাল ভোগ করা হারাম ছিল। কুড়িয়ে পাওয়া জিনিস সামান্য হলে তবে ঘোষণা ব্যতীতই তা ভোগ করাকে একদল আলিম জায়িয বলেছেন। আর অন্য একদল আলিম বলেছেন, এক দীনারের কম পরিমাণ সম্পদ কুড়িয়ে পেলে তবে এক সপ্তাহ পর্যন্ত ঘোষণা করতে হবে। এই মতামতটি প্রদান করেছেন ইসহাক ইবনু ইবরাহীমও।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 54
			}
		}
	]
}