{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"15": "The Chapters On Judgements From The Messenger of Allah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "১৩৭৫। ইবনু উমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, উমার (রাঃ) খাইবারের (গানীমাত হতে) এক খণ্ড জমি পেয়েছিলেন। তিনি বললেন, হে আল্লাহর রাসূল! আমি খাইবার এলাকাতে এমন এক খণ্ড জমি পেয়েছি যার তুলনায় উত্তম সম্পদ আমি আর কখনো লাভ করিনি। (এ প্রসঙ্গে) আমাকে আপনি কি আদেশ করেন? তিনি বললেনঃ তুমি চাইলে মূল অংশ ঠিক রেখে লাভের অংশ দান-খাইরাত করতে পার। সুতরাং উমর (রাঃ) বমিটা এভাবে ওয়াকফ করলেনঃ মূল জমিখণ্ড বিক্রয় করা যাবে না, হেবাও করা যাবে না এবং উত্তরাধিকারদের মধ্যেও ভাগ-বাটোয়ারা হবে না। সেটার আয় হতে ফকীর-মিসকীন, আত্মীয়-স্বজন, ক্রীতদাস মুক্তকরণ, আল্লাহর রাস্তায় (জিহাদে), পথিক-মুসাফির এবং মেহমানদের খরচের জন্য ব্যয় করা হবে। যে লোক এর মুতাওয়াল্লী হবে সে ন্যায্যভাবে এর আয় হতে ভোগ করতে পারবে এবং বন্ধু-বান্ধবদেরকেও খাওয়াতে পারবে, কিন্তু জমা করে রাখতে পারবে না। (অধঃস্তন) বর্ণনাকারী বলেন, আমি মুহাম্মাদ ইবনু সীরনের নিকট এ হাদীসটি উল্লেখ করলে তিনি বলেন, মুতাওয়াল্লী সম্পদশালী হওয়ার লক্ষ্যে এই ওয়াকফ মালের আয় জমা করে রাখতে পারবে না। সহীহ, ইবনু মা-জাহ (২৩৯৬), নাসা-ঈ ইবনু আওন বলেন, অন্য এক লোক আমাকে জানিয়েছেন যে, তিনি এই ওয়াকফনামা লাল রঙ-এর চামড়ায় লিখিত আকারে পড়েছেন। তাতে এও লিখা ছিলঃ এ সম্পত্তিকে সম্পদশালী হওয়ার মাধ্যম বানানো যাবে না। ইসমাঈল বলেন, আমি ইবনু উবাইদুল্লাহ ইবনু উমারের নিকট উক্ত ওয়াকফনামা পড়লাম। তাতেও লিখা ছিল, সম্পদশালী হওয়ার লক্ষ্যে তা হতে জমা করা যাবে না। এ হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। এ হাদীস মোতাবিক সাহাবাই কিরাম এবং অপরাপর আলিমগণ আমল করেছেন। জমিজমা বা অন্য কোন সম্পদ ওয়াকফ করা জায়িয। এ ব্যাপারে পূর্ববর্তী আলিমদের মধ্যে কোন রকম দ্বিমত আছে বলে আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 56
			}
		}
	]
}