{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "১৪২। হিশাম ইবনু উরওয়া (রাহঃ) হতে তার পিতার সূত্রে আব্দুল্লাহ ইবনু আল-আরকাম সম্পর্কে বর্ণিত আছে, তিনি (উরওয়া) বলেন, একদা নামাযের ইকামাত হয়ে গেল। তিনি (আবদুল্লাহ) এক ব্যক্তির হাত ধরে তাকে সামনে ঠেলে দিলেন। তিনি (আব্দুল্লাহ ইবনু আরকাম) স্বীয় গোত্রের ইমাম ছিলেন (নামায শেষে)। তিনি বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ “নামাযের ইকামাত হয়ে যাওয়ার পর তোমাদের কারো মলত্যাগের প্রয়োজন হলে প্রথমে সে মলত্যাগ করে নেবে।” —সহীহ। ইবনু মাজাহ– (৬১৬)। এ অনুচ্ছেদে আয়িশাহ, আবু হুরাইরা, সাওবান ও আবু উমামা (রাঃ) হতে বর্ণনাকৃত হাদীসও রয়েছে। আবু ঈসা বলেন, আবদুল্লাহ ইবনু আরকাম (রাঃ)-এর হাদীসটি হাসান সহীহ। আবদুল্লাহ ইবনু আরকাম (রাঃ)-এর হাদীসটি মালিক ইবনু আনাস ইয়াহইয়া ইবনু সাঈদ আল কাত্তান আরো অনেকে হিশাম ইবনু উরওয়া হতে তিনি তার পিতা উরওয়া হতে তিনি আব্দুল্লাহ ইবনু আরকাম হতে বর্ণনা করেছেন। ওহাইব এবং অন্যরা হিশাম ইবনু উরওয়া হতে তিনি তার পিতা হতে তিনি জনৈক ব্যক্তি হতে তিনি আব্দুল্লাহ ইবনু আরকাম হতে বর্ণনা করেছেন। নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের কয়েকজন সাহাবা ও তাবিঈর এটাই ফাতোয়া (মলত্যাগের প্রয়োজন আগে সেরে নেবে)। ইমাম আহমাদ ও ইসহাক এই মত সমর্থন করেছেন এবং বলেছেন, প্রাকৃতিক প্রয়োজন অনুভূত হলে তা না সেরে নামাযে দাড়াবে না। হ্যাঁ যদি নামায শুরু করার পর প্রাকৃতিক প্রয়োজন অনুভূত হয় তবে নামায আদায় করতে থাকবে যতক্ষণ পর্যন্ত গোলমাল ও বাধাবিয়ের সৃষ্টি না হয়। কিছু আলিম বলেছেন, প্রাকৃতিক প্রয়োজনের কারণে যে পর্যন্ত নামাযের মধ্যে অসুবিধা সৃষ্টি না হয়, ততক্ষণ পায়খানা-পেশাবের বেগ নিয়ে নামায আদায় করতে কোন সমস্যা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 142
			}
		}
	]
}