{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"21": "The Book on Military Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "১৫৪৮। আবূল বাখতারী (রহঃ) হতে বর্ণিত আছে, মুসলিমদের কোন এক সেনাবাহিনী পারস্যের একটি দুর্গ অবরোধ করে। সালমান ফারসী (রাঃ) এই বাহিনীর সেনাপতি ছিলেন। সেনাবাহিনীর মুজাহিদগণ বললেন, হে আবদুল্লাহর পিতা! আমরা কি তাদের উপর ঝাপিয়ে পড়ব না? তিনি বললেন, আমি যেভাবে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে তাদের (ইসলাম গ্রহণের) দাওয়াত দিতে শুনেছি, তোমরা আমাকেও সেভাবে দাওয়াত দিতে দাও। সালমান (রাঃ) তাদের নিকটে এসে বললেন, আমি তোমাদের মাঝেরই একজন পারস্যবাসী। তোমরা দেখতে পাচ্ছ, আরবরা আমার আনুগত্য করছে। তোমরা যদি ইসলাম গ্রহণ কর তবে তোমরাও আমাদের মতই অধিকার পাবে এবং আমাদের উপর যে দায় আসে তোমাদের উপরও সেরকম দায় আসবে। তোমরা যদি এ দাওয়াত কুবুল করতে অসম্মত হও এবং তোমাদের ধর্মের উপর অবিচল থাকতে চাও, তবে আমরা তোমাদেরকে তোমাদের ধর্মের উপর ছেড়ে দিব। কিন্তু এক্ষেত্রে তোমরা আমাদের অনুগত্য স্বীকার করে আমাদেরকে জিযইয়া দিবে। রাবী বলেন, তিনি তাদেরকে এ কথাগুলো ফারসী ভাষায় বলেন। (তিনি আরো বলেন) এই অবস্থায় তোমরা প্রশংসিত হবে না। তোমরা যদি এটাও (জিযইয়া প্রদান) অস্বীকার কর তবে আমরা তোমাদের বিরুদ্ধে সমানভাবে লড়বো। তারা বলল, আমরাজিযইয়া প্রদানে সম্মত নই, বরং আমরা তোমাদের বিরুদ্ধে যুদ্ধ করব। মুসলিম সেনানীগণ বললেন, হে আবদুল্লাহর পিতা! আমরা কি তাদেরকে আক্রমণ করব না? তিনি বললেন, না। রাবী বলেন, তিনি এভাবে তাদেরকে তিন দিন যাবত আহবান করতে থাকেন। তারপর তিনি মুসলিম বাহিনীকে নির্দেশ দিলেন, প্রস্তুত হও এবং তাদের উপর ঝাপিয়ে পড়। রাবী বলেন, আমরা তাদেরকে আক্রমণ করে সেই দুর্গ দখল করলাম। যঈফ, ইরওয়া (৫৮৭) এ অনুচ্ছেদে বুরাইদা, নুমান ইবনু মুকাররিন, ইবনু উমার ও ইবনু আব্বাস (রাঃ) হতেও হাদীস বর্ণিত আছে। সালমান (রাঃ)-এর হাদীসটি হাসান। আমরা শুধু আতা ইবনুস সায়িবের সূত্রেই এ হাদীসটি জেনেছি। আমি মুহাম্মাদ (বুখারী)-কে বলতে শুনেছি, আবূল বাখতার সালমান (রাঃ)-এর দেখা পাননি। কেননা তিনি আলী (রাঃ)-এর দেখা পাননি। আর সালমান (রাঃ) আলী (রাঃ)-এর পূর্বে মারা যান। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও তার পরবর্তীগণ এ হাদীসের মতই মত দিয়েছেন। তাদের মতে, যুদ্ধ শুরু করার পূর্বে ইসলামের দাওয়াত দিতে হবে। ইসহাক ইবনু ইবরাহীমেরও এই মত। তিনি বলেন, যদি আক্রমণ করার পূর্বে শত্রুবাহিনীকে ইসলামের দাওয়াত দেয়া হয় তবে তা উত্তম এবং তা তাদের মনে প্রভাব ও ভীতির সঞ্চার করবে। কিছু বিশেষজ্ঞ আলিম বলেন, আজকাল আর এরূপ দাওয়াত দেয়ার প্রয়োজন নেই। ইমাম আহমাদ বলেন, বর্তমানে এ ধরনের আহবান করার কোন প্রয়োজনীয়তা দেখছি না। ইমাম শাফিঈ বলেন, শত্রুকে ইসলামের দাওয়াত না দেয়া পর্যন্ত যুদ্ধ শুরু করা যাবে না। কিন্তু তাদেরকে তাড়াতাড়ি দাওয়াত গ্রহণ করার জন্য বলতে হবে। অবশ্য দাওয়াত না দিলেও কোন সমস্যা নেই। কেননা তাদের কাছে ইতিপূর্বেই ইসলামের দাওয়াত পৌছেছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		}
	]
}