{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 157,
			"arabicnumber": 157,
			"text": "১৫৭। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন (সূর্যের) উত্তাপ বেড়ে যায়, তখন তোমরা ঠাণ্ডা করে নামায আদায় কর (বিলম্ব করে নামায আদায় কর)। কেননা প্রচণ্ড উত্তাপ জাহান্নামের নিঃশ্বাস হতে হয়। —সহীহ। ইবনু মাজাহ– (৬৭৮), বুখারী ও মুসলিম। এ অনুচ্ছেদে আবু সাঈদ, আবু যার, ইবনু উমার, মুগীরা, কাসিম ইবনু সাফওয়ান তার পিতার সূত্রে, আবু মূসা, ইবনু আব্বাস ও আনাস (রাঃ) হতে বর্ণিত হাদীসও রয়েছে। নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের নিকট হতে উমর (রাঃ)-এর একটি বর্ণনাও রয়েছে। কিন্তু এ বর্ণনাটি সহীহ নয়। আবু ঈসা বলেনঃ আবু হুরাইরা বর্ণিত হাদীসটি হাসান সহীহ। বিশেষজ্ঞদের একদল গরমের মওসুমে যুহরের নামায বিলম্বে আদায় করা পছন্দ করেছেন। ইবনুল মুবারাক, আহমাদ ও ইসহাক এই মতের সমর্থক। ইমাম শাফিঈ বলেন, লোকেরা যখন দূরদূরান্ত হতে মসজিদে আসে তখন যুহরের নামায ঠাণ্ডার সময় আদায় করার নির্দেশ রয়েছে। কিন্তু যে ব্যক্তি একাকি নামায আদায় করে অথবা নিজের গোত্রের মসজিদে নামায আদায় করে- খুব গরমের সময়েও আমি তার জন্য প্রথম ওয়াক্তে নামায আদায় করা উত্তম মনে করি। আবু ঈসা বলেনঃ অত্যধিক গরমের সময়ে যারা বিলম্বে যুহরের নামায আদায়ের কথা বলেন, তাদের মত অনুসরণযোগ্য। কিন্তু আবু যার (রাঃ)-এর হাদীস ইমাম শাফিঈর বক্তব্যের (দূর হতে আসা মুসল্লীর কারণে যুহরের নামায ঠাণ্ডার সময়ে আদায়ের নির্দেশ রয়েছে, কেননা তাতে তাদের কষ্ট কম হবে) পরিপন্থী। আবু যার (রাঃ) বলেনঃ “আমরা কোন এক সফরে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সাথে ছিলাম। বিলাল (রাঃ) যুহরের নামাযের আযান দিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে বিলাল! শীতল কর (গরমের তীব্রতা কমতে দাও)। তারপর শীতল করা হল (বিলম্বে নামায আদায় করা হল)।” ইমাম শাফিঈর বক্তব্য অনুযায়ী শীতল করার অর্থ যদি তাই হত তবে এ সময়ে শীতল করার কোন অর্থই হয় না। কেননা সফরের অবস্থায় সবাই একই স্থানে সমবেত ছিল, দূর হতে কারো আসার কোন প্রশ্নই ছিল না।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 9
			}
		}
	]
}