{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "২। আবু হুরাইরা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন কোন মু'মিন অথবা মুসলিম বান্দা ওযু করে এবং মুখমণ্ডল ধোয়, তার মুখমণ্ডল হতে তার চোখের দ্বারা কৃত সকল গুনাহ পানির সাথে অথবা পানির শেষ বিন্দুর সাথে দূর হয়ে যায়। যখন সে তার দু'হাত ধোয়, তার দুহাতে কৃত সকল গুনাহ তার হাত হতে পানির সাথে অথবা পানির অবশিষ্ট বিন্দুর সাথে দূরীভূত হয়ে যায়। অতঃপর সে সকল গুনাহ হতে পবিত্র হয়ে যায়। — সহীহ। আত্তা’লীকুর রাগীব- (১/৯৫) আবু ঈসা বলেন, হাদীসটি হাসান সহীহ। এ হাদীসটি মালিক সুহাইল হতে, তিনি তার পিতার সূত্রে এবং তিনি আবু হুরাইরা (রাঃ)-এর সূত্রে বর্ণনা করেছেন। আবু সালিহ হচ্ছেন সুহাইলের পিতা। তার নাম যাকওয়ান। আবু হুরাইরা (রাঃ)-এর আসল নাম নিয়ে মতবিরোধ আছে। কেউ বলেছেন, তার নাম আবদুশ শামস, আবার কেউ বলেছেন তার নাম আবদুল্লাহ ইবনু আমর। মুহাম্মাদ ইবনু ইসমাঈল (ইমাম বুখারী) এ ধরনের কথাই বলেছেন এবং এটাই সবচাইতে সহীহ। এ অনুচ্ছেদে উসমান, সাওবান, সুনাবিহী, আমর ইবনু আবাসা, সালমান ও আবদুল্লাহ ইবনু আমর (রাঃ) প্রমুখ সাহাবীদের বর্ণিত হাদীস রয়েছে। সুনাবিহী যিনি আবু বাকর (রাঃ)-এর নিকট হতে হাদীস বর্ণনা করেছেন। তিনি রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম-এর কাছ থেকে কোন হাদীস শুনেননি। তার নাম আবদুর রাহমান ইবনু উসাইলা এবং ডাকনাম ছিল আবু আবদুল্লাহ। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে দেখা করার জন্যে বের হয়েছিলেন, কিন্তু রাস্তায় থাকাকালীন সময়েই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মারা যান। তিনি রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম-এর বহু হাদীস বর্ণনা করেছেন। আরেক সুনাবিহী ইবনুল আসার আল-আহমাসী নামে পরিচিত। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাহাবী। তার বর্ণিত হাদীস হলঃ আমি রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ ‘পূর্ববতী উন্মাতদের নিকট আমি তোমাদের সংখ্যাধিক্যের গৌরব করব। অতএব আমি মারা যাবার পর তোমরা যেন একে অপরের সাথে ফিতনা-ফ্যাসাদে জড়িয়ে না পড়’।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		}
	]
}