{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"27": "Chapters on Righteousness And Maintaining Good Relations With Relatives"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2035,
			"arabicnumber": 2035,
			"text": "২০৩৫। উসামা ইবনু যাইদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কাউকে অনুগ্রহ করা হলে সে যদি অনুগ্রহকারীকে বলে, “তোমাকে আল্লাহ তা'আলা কল্যাণকর প্রতিদান দিন\" তবে সে উপযুক্ত ও পরিপূর্ণ প্রশংসা করল। সহীহ, মিশকাত (৩০২৪), তা’লীকুর রাগীব (২/৫৫), রাওযুন নায়ীর (৮)। আবূ ঈসা বলেন, এ হাদীসটি হাসান, জায়্যিদ (উত্তম) গারীব। এটিকে শুধুমাত্র উক্ত সনদে উসামা ইবনু যাইদ (রাঃ)-এর হাদীস বলে আমরা জানি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অনুরূপ হাদীস আবূ হুরাইরা (রাঃ) হতেও বর্ণিত হয়েছে। আমি মুহাম্মাদ (বুখারীকে) কে এ প্রসঙ্গে প্রশ্ন করলে তিনি এটি জানেন না বলেছেন। আব্দুর রহিম ইবনু হাযিম আল বালখী হতে বর্ণিত, তিনি বলেন, আমি মাক্কী ইবনু ইবরাহীমকে বলতে শুনেছি, আমরা ইবনু জুরাইজ আল-মাক্কীর নিকট উপস্থিত ছিলাম এমতাবস্থায় এক ব্যক্তি এসে তার নিকট কিছু চাইল। ইবনু জুরাইজ তার অর্থ সচিবকে বললেন তাকে একটি দীনার দিন। সে বলল, আমার নিকট একটি দীনার ব্যতীত আর কিছু নেই। এটি তাকে দান করলে আমার আপনার পরিবারের সবাইকে উপোস করতে হবে। একথা শুনে তিনি রাগান্বিত হলেন এবং বললেনঃ তাকে সেটা দাও। মাক্কী বলেন, আমরা ইবনু জুরাইজের নিকট থাকাবস্থায়ই এক ব্যক্তি একটি চিঠি এবং একটি থলে নিয়ে উপস্থিত হলেন। যাহা তার কোন ভাই তার নিকট পাঠিয়েছে। চিঠিতে লিখাছিল আমি পঞ্চাশটি দীনার পাঠাইলাম। বর্ণনাকারী বলেন, ইবনু জুরাইজ থলেটি খুলে দীনার গননা করলেন। তাতে তিনি (৫১) একান্নটি দীনার পেলেন। এতে ইবনু জুরাইজ তার অর্থ সচীবকে বললেনঃ তুমি এক দীনার দান করেছ, আল্লাহ সেটা তোমাকে ফেরত দিয়েছেন তার সাথে অতিরিক্ত আরো পঞ্চাশটি দিয়েছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 141
			}
		}
	]
}