{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"28": "Chapters on Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2037,
			"arabicnumber": 2037,
			"text": "২০৩৭। উম্মুল মুনযির (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার বাসায় আসলেন। আলী (রাঃ)-ও তার সাথে ছিলেন। আমাদের খেজুরের ছড়া ঝুলিয়ে রাখা ছিল। বর্ণনাকারী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তা থেকে খেতে আরম্ভ করলেন। তার সাথে আলী (রাঃ)-ও খেতে লাগলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আলী (রাঃ)-কে বললেনঃ হে আলী! থাম, থাম, তুমি তো অসুস্থতাজনিত দুর্বল। বর্ণনাকারী বলেন, আলী (রাঃ) বসে গেলেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খেতে থাকলেন। আমি (উন্মুল মুনযির) তাদের জন্য বীট এবং বার্লি বানিয়ে আনলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে আলী! তুমি এটা খেতে পার, তোমার জন্য এটা বেশি উপযোগী। হাসান, দেখুন পরবর্তী হাদীস। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীসটি শুধুমাত্র ফুলাইহ-এর সূত্রেই জেনেছি। এটি ফুলাইহু হতে আইয়ুব ইবনু আবদুর রাহমানের সূত্রেও বর্ণিত আছে। উন্মুল মুনযির আল-আনসারিয়া (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বাড়ীতে আসলেন... উপরের হাদীসের অনুরূপ। এই বর্ণনার শেষে আছেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার জন্য এটা বেশি উপকারী। হাসান, ইবনু মা-জাহ (৩৪৪২)। আবু ঈসা বলেন, এ হাদিসটি হাসান গারীব। আমরা এ হাদিসটি শুধুমাত্র ফুলাইহ এর সুত্রে জেনেছি। এটি ফুলাইহ হতে আইয়ুব ইবনু আব্দুর রাহমানের সুত্রে বর্ণিত আছে। উম্মুল মুনযির আল আনসারিয়া (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের বাড়ীতে আসলেন ... উপরের হাদিসের অনুরূপ। এই বর্ণনার শেষে আছেঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার জন্য এটা বেশি উপকারী। হাসান, ইবনু মাজাহ (৩৪৪২) মুহাম্মদ ইবনু বাশশার বলেন, এ হাদীসটি আইয়ুব ইবনু আবদুর রাহমান আমার নিকট বর্ণনা করেছেন। এ হাদীসটি উত্তম গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 2
			}
		}
	]
}