{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2137,
			"arabicnumber": 2137,
			"text": "২১৩৭। আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বলেছেন, আর তিনি তো সত্যবাদী ও সত্যবাদী বলে স্বীকৃতঃ তোমাদের সকলেই তার মায়ের গর্ভে সৃষ্টির চল্লিশদিন পর্যন্ত (জমাট বাঁধা) শুক্ররূপে সমন্বিত হতে থাকে, তারপর রক্তপিণ্ডরূপে চল্লিশদিন বিদ্যমান থাকে, তারপর অনুরূপ দিনে গোশতপিণ্ডের রূপ ধারণ করে। তারপর আল্লাহ তা'আলা তার নিকট একজন ফিরিশতা প্রেরণ করেন এবং তার মধ্যে রূহ সঞ্চার করেন। আর চারটি বিষয়ে তাকে আদেশ করা হয়। সুতরাং তার রিযিক, মৃত্যু, তার কার্যক্রম এবং সে সৌভাগ্যবান না দুর্ভাগ্যবান এই বিষয়গুলো সেই ফিরিশতা লিখে দেন। সেই সত্তার শপথ, যিনি ব্যতীত আর কোন মাবুদ নেই! তোমাদের মধ্যে কোন ব্যক্তি জান্নাতীদের আমল করতে থাকে, এমনকি তার ও জান্নাতের মাঝে মাত্র একহাত ব্যবধান থাকে। এমতাবস্থায় তার সেই ভাগ্যের লেখা তার সামনে উপস্থাপন করা হয়, তখন জাহান্নামীদের আমলের উপর তার পরিসমাপ্তি ঘটে, ফলে সে জাহান্নামেই চলে যায়। আর তোমাদের কোন ব্যক্তি জাহান্নামীদের কর্ম সম্পাদন করতে থাকে, এমনকি তার ও জাহান্নামের মাঝে মাত্র একহাত পরিমাণ দূরত্ব থাকে। এমতাবস্থায় তার সামনে ভাগ্যের সেই লেখা এসে। হাযির হয় এবং জান্নাতীদের আমলের উপর তার পরিসমাপ্তি ঘটে, ফলে সে জান্নাতে চলে যায়। সহীহ, ইবনু মা-জাহ (৭৬), বুখারী, মুসলিম। আবূ ঈসা বলেন, এই হাদীসটি হাসান সহীহ। মুহাম্মাদ ইবনু ইবনু ওয়াহব হতে, তিনি আবদুল্লাহ ইবনু মাসউদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বলেছেন...... পূর্বোক্ত হাদীসের অনুরূপ। আবূ ঈসা বলেন, আবূ হুরাইরা ও আনাস (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। বর্ণনাকারী বলেন, আহমাদ ইবনুল হাসানকে আমি বলতে শুনেছি, আমি আহমাদ ইবনু হাম্বলকে বলতে শুনেছিঃ আমি আমার চোখে ইয়াহইয়া ইবনু সাঈদ আল-কাত্তানের মতো ব্যক্তিত্ব আর দেখিনি। এই সনদসূত্রে বর্ণিত হাদীসটি হাসান সহীহ। আমাশের সূত্রে শুবা ও সাওরীও একইরকম হাদীস বর্ণনা করেছেন। মুহাম্মাদ ইবনু আলা ওয়াকী হতে, তিনি আমাশ হতে, তিনি যাইদ হতে অনুরূপ বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		}
	]
}