{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "২১৪১। আবদুল্লাহ ইবনু আমর (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুটি গ্রন্থ তার দুই হাতে নিয়ে আমাদের নিকট এসে বললেনঃ তোমরা এই দুটি গ্রন্থের ব্যাপারে কি জান? আমরা বললাম, না, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। তবে যদি আপনি আমাদেরকে জানিয়ে দিন। তিনি তার ডানহাতের গ্রন্থের দিকে ইশারা করে বললেনঃ এটা রাব্বুল আলামীনের পক্ষ হতে একটি কিতাব। এতে জান্নাতী সকল ব্যক্তির নাম, তাদের বাপ-দাদার নাম ও তাদের গোত্রের নাম লিখা আছে। আর শেষে এর যোগফল রয়েছে এবং এতে কম-বেশি করা হবে না। তারপর তিনি তার বামহাতের গ্রন্থের দিকে ইশারা করে বললেনঃ এটাও আল্লাহ রাব্বুল আলামীনের পক্ষ হতে একটি গ্রন্থ। এতে জাহান্নামী সকল ব্যক্তির নাম, তাদের বাপ-দাদার নাম ও গোত্রের নাম লিখা আছে। এর শেষেও যোগফল রয়েছে। এতে কখনো কমানো-বাড়ানো হবে না। তার সাহাবীগণ বলেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। বিষয়টি এরূপভাবেই চূড়ান্ত হয়ে থাকলে তবে আর আমলের কি প্রয়োজন? তিনি বললেনঃ তোমরা সঠিক পথে থেকে সঠিকভাবে কাজ করতে থাক এবং আল্লাহ তা'আলার নৈকট্য হাসিলে চেষ্টা কর। কেননা, জান্নাতী লোকের শেষ মুহুর্তের আমল জান্নাতীদের আমলই হবে, সে পূর্বে যে আমলই করুক না কেন। আবার জাহান্নামীর শেষ মুহুর্তের কাজ জাহান্নামীদের আমলই হবে, সে পূর্বে যে আমলই করুক না কেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দুইহাতে ইশারা করেন এবং কিতাব দুটি ফেলে দিয়ে বলেনঃ তোমাদের প্রভু তার বান্দাহদের আমল চূড়ান্ত করে ফেলেছেন। একদল জান্নাতে প্রবেশ করবে আর অন্যদল জাহান্নামে প্রবেশ করবে। হাসান, মিশকাত (৯৬), সহীহাহ (৮৪৮), আযযিলা-ল (৩৪৮)। কুতাইবা-বাকর ইবনু মুযার হতে, তিনি আবূ কাবীল (রাহঃ) হতে এই সূত্রে উপরোক্ত হাদীসের মতো হাদীস বর্ণিত আছে। আবূ ঈসা বলেন, ইবনু উমার (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ গারীব। আর আবূ কবীলের নাম হুয়াই ইবনু হানী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		}
	]
}