{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2179,
			"arabicnumber": 2179,
			"text": "২১৭৯। হুযাইফা ইবনুল ইয়ামান (রাঃ) হতে বর্ণিত, তিন বলেন, কোন একদিন আমাদের সামনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুটি হাদীস বর্ণনা করেন। আমি এ দুটির মধ্যে একটিকে প্রকাশিত হতে দেখেছি এবং অপরটির অপেক্ষায় আছি। তিনি বলেনঃ নিশ্চয়ই মানুষের হৃদয়মূলে আমানাত অবতীর্ণ হয়। তারপর কুরআন অবতীর্ণ হয়। সুতরাং তারা কুরআনের শিক্ষা অর্জন করে এবং সুন্নাহ (হাদীস) সম্বন্ধেও শিক্ষা অর্জন করে। তারপর আমানাত তুলে নেয়া প্রসঙ্গে তিনি বলেন, মানুষ ঘুমিয়ে যাবে এবং এই অবস্থায় তার হৃদয় হতে আমানাত তুলে নেয়া হবে। আর এর চিহ্নটা হবে কালো বিন্দুর মতো। তারপর সে নিদ্রামগ্ন হবে এবং আমানাত তুলে নেয়া হবে। এতে ফোসকার ন্যায় চিহ্ন পড়বে, যেমন জ্বলন্ত অঙ্গার তোমার পায়ে রাখা হলে ফোসকা পড়ে। তুমি তা স্ফীত অবস্থায় দেখতে পাও কিন্তু তার ভিতরে কিছুই নেই। তারপর তিনি তার পায়ে একটি শিলাখণ্ড রেখে দেখান। তিনি আরো বলেন, মানুষেরা ব্যবসা-বাণিজ্য ও কেনা-বেচা করবে কিন্তু কেউই আমানাত রক্ষা করবে না। এমনকি বলা হবে অমুক গোত্রে একজন বিশ্বস্ত ও আমানতদার লোক আছে। এরকম পরিস্থিতি দাড়াবে যে, কারো প্রসঙ্গে বলা হবে, সে কত বড় জ্ঞানী, সে কত হুশিয়ার এবং সে কত সাহসী। অথচ তার অন্তরে সরিষা পরিমাণ ঈমানও থাকবে না। হুযাইফা (রাঃ) বলেন, আমার উপর দিয়ে এমন একটি সময় অতিবাহিত হয়েছে যখন আমি তোমাদের কারো সাথে বেচা-কেনার চিন্তা করতাম না। কেননা, সে ব্যক্তি মুসলিম হলে তার দ্বীনদারিই তাকে আমার প্রাপ্য ফিরত দিতে বাধ্য করত। আর সে ইয়াহুদী বা খৃস্টান হলে তার শাসকই তাকে আমার প্রাপ্য আদায় করে দিত। কিন্তু এখন আমি অমুক অমুক লোক ব্যতীত তোমাদের কারো সাথে কেনা-বেচা ও ব্যবসা-বাণিজ্য করি না। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 22
			}
		}
	]
}