{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2183,
			"arabicnumber": 2183,
			"text": "২১৮৩। হুযাইফা ইবনু উসাইদ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কোন একদিন কিয়ামত প্রসঙ্গে আমরা কথা-বার্তা বলছিলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরকম সময় তার ঘর হতে বেরিয়ে আমাদের সামনে এলেন। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা দশটি নিদর্শন না দেখা পর্যন্ত কিয়ামত সংঘটিত হবে নাঃ (১) পশ্চিম প্রান্ত হতে সূর্য উঠবে, (২) ইয়াজুজ ও মাজুজের আত্মপ্রকাশ ঘটবে, (৩) দাব্বাতুল আরদ নামক প্রাণীর আত্মপ্রকাশ ঘটবে, তিনটি ভুমি ধস হবেঃ (৪) একটি প্রাচ্যে (৫) একটি পাশ্চাত্যে এবং (৬) একটি আরব উপদ্বীপে, (৭) ইয়ামানের অন্তর্গত আদন (এডেন)-এর একটি গভীর কূপ হতে অগ্লুৎপাত হবে, যা মানুষকে তাড়িয়ে নেবে বা একত্র করবে, তারা যেখানে রাত্রি যাপন করবে আগুনও সেখানে রাত্রি কাটাবে এবং তারা যেখানে দিনের বেলায় বিশ্রাম করবে, আগুনও সেখানেই বিশ্রাম করবে। সহীহ, মুসলিম (৮/১৭৮-১৭৯)। উপরোক্ত হাদীসের মতো হাদীস মাহমূদ ইবনু গাইলান-ওয়াকী হতে, তিনি সুফিয়ান (রাহঃ) হতে এই সনদসূত্রে বর্ণিত আছে। তাতে আছেঃ আদ-দুখান অর্থাৎ ধোয়া নির্গত হবে। এ বর্ণনাটিও সহীহ। হান্নাদ-আবূল আহওয়াস হতে, তিনি ফুরাত আল-কাযযায (রহঃ)-এর সূত্রেও সুফিয়ান হতে ওয়াকী (রাহঃ)-এর সূত্রে বর্ণিত হাদীসের ন্যায় বর্ণিত আছে। মাহমূদ ইবনু গাইলান-আবূ দাউদ আত-তাইয়ালিসী হতে, তিনি শুবা ও মাসউদী-ফুরাত আল-কাযযায (রহঃ) হতে ফুরাতের সূত্রে সুফিয়ান বর্ণিত পূর্বোক্ত হাদীসের মতো হাদীস বর্ণিত আছে। এই বর্ণনায় দাজ্জাল ও ধোয়ার উল্লেখ আছে। এ বর্ণনাটিও সহীহ। আবূ মূসা মুহাম্মাদ ইবনুল মুসান্না-আবূন নুমান আল-হাকাম ইবনু আবদুল্লাহ আল-ইজলী হতে, তিনি শুবা হতে, তিনি ফুরাত (রাহঃ)-এর সূত্রে আবূ দাউদ-শুবা (রাহঃ)-এর সূত্রে বর্ণিত হাদীসের অনুরূপ বর্ণিত হয়েছে। তবে এ সূত্রে আরো আছেঃ “কিয়ামতের দশম নিদর্শন হলো এমন প্রবল বাতাস যা তাদেরকে সমুদ্রে নিক্ষেপ করবে অথবা ঈসা ইবনু মারইয়াম (আঃ)-এর অবতরণ\"। সহীহ, প্রাগুক্ত। আবূ ঈসা বলেন, এ অনুচ্ছেদে আলী, আবূ হুরাইরা, উম্মু সালামা ও সাফিয়্যা (রাঃ) হতেও হাদীস বর্ণিত আছে। এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 26
			}
		}
	]
}