{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "২১৯১। আবূ সাঈদ আল-খুদরী (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, এক সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের নিয়ে একটু বেশী বেলা থাকতেই আসরের নামায আদায় করেন, তারপর ভাষণ দিতে দাঁড়ান। উক্ত ভাষণে কিয়ামত পর্যন্ত যেসব ঘটনা ঘটবে সেই প্রসঙ্গেই তিনি আমাদেরকে জানিয়েদেন। কেউ সেগুলো মনে রেখেছে এবং কেউ আবার তা ভুলে গেছে। তার ভাষণে তিনি যা বলেছিলেন তার মধ্যে ছিলঃ দুনিয়াটা সবুজ-শ্যামল ও সুমিষ্ট (আকর্ষণীয়), আর আল্লাহ তা'আলা তোমাদেরকে এর উত্তোরাধিকার বানিয়েছেন। সুতরাং তোমরা কি করছ তা তিনি লক্ষ্য রাখছেন। শোন! দুনিয়া ও নারীদের ব্যাপারে সাবধান। তিনি আরো বলেনঃ সাবধান! কেউ যখন কোন সত্য কথা জানবে, তখন তাকে মানুষের ভয় যেন সেই সত্য বলা থেকে বিরত না রাখে। রাবী বলেন, এই কথা বলে আবূ সাঈদ (রাঃ) কেঁদে ফেলেন এবং বলেন, আল্লাহ তা'আলার কসম! আমরা এরকম কত কাজ হতে দেখেছি কিন্তু তা বলতে মানুষকে ভয় করেছি। তিনি আরো বলেনঃ জেনে রাখ! কিয়ামতের দিন প্রত্যেক বিশ্বাসঘাতকের জন্য তার বিশ্বাসঘাতকতার পরিমাণ অনুযায়ী একটি করে পতাকা স্থাপন করা হবে। মুসলিম রাষ্ট্রনায়কের বিশ্বাসঘাতকতার চাইতে ভীষণ কোন বিশ্বাসঘাতকতা নেই। তার এই পতাকা তার নিতম্বের কাছে স্থাপন করা হবে। সেদিনের আরও যেসব কথা আমরা মনে রেখেছি তার মধ্যে ছিলঃ শুনে রাখ! আদম-সন্তানদেরকে বিভিন্ন শ্রেণীতে সৃষ্টি করা হয়েছে। তাদের এক দল তো মু'মিন অবস্থায় জন্মগ্রহণ করেছে, মুমিন অবস্থায় জীবন যাপন করেছে এবং মু'মিন অবস্থাতেই মারা গেছে। তাদের অপর দল কাফির অবস্থায় জনগ্রহণ করেছেন, কাফির অবস্থায় জীবন কাটিয়েছে এবং কাফির অবস্থায়ই মারা গেছে। অপর দল মু'মিন অবস্থায় জন্মগ্রহণ করেছেন, মু'মিন অবস্থায় জীবন যাপন করেছে এবং কাফির অবস্থায় মারা গেছে। অপর দল আবার কাফির অবস্থায় জন্মগ্রহণ করেছে, কাফির অবস্থায় জীবন যাপন করেছে এবং মু’মিন অবস্থায় মারা গেছে। জেনে রাখ! মানুষের মধ্যে কারো রাগ আসে দেরিতে এবং চলে যায় খুব তাড়াতাড়ি। আবার কারো রাগ আসে তাড়াতাড়ি এবং চলেও যায় তাড়াতাড়ি। সুতরাং এর জন্য এই। জেনে রাখ! তাদের মধ্যে কারো রাগ আসে খুব তাড়াতাড়ি কিন্তু চলে যায় খুব দেরিতে। জেনে রাখ! তাদের মধ্যে উত্তম হল যাদের রাগ আসে দেরিতে এবং চলে যায় খুব তাড়াতাড়ি। আর তারাই খুব নিকৃষ্ট, যাদের রাগ আসে খুব তাড়াতাড়ি কিন্তু চলে যায় দেরিতে। জেনে রাখ! মানুষের মধ্যে কেউ পাওনা পরিশোধের বেলায়ও ভালো আবার পাওনা আদায়ের ক্ষেত্রেও ভদ্র। আবার কেউ পাওনা পরিশোধের ক্ষেত্রে নিকৃষ্ট কিন্তু পাওনা আদায়ের ক্ষেত্রে ভদ্র। আবার কেউ পাওনা পরিশোধের ক্ষেত্রে ভদ্র কিন্তু আদায়ের ক্ষেত্রে অভদ্র। এক্ষেত্রে একটি অপরটির পরিপূরক হয়ে যায়। জেনে রাখ! তাদের মধ্যে কারো পাওনা পরিশোধ নিকৃষ্ট এবং সে তাগাদা প্রদানের ক্ষেত্রে অভদ্র। জেনে রেখ সেই সবচেয়ে ভাল, যে পাওনা পরিশোধের বেলায় ভাল এবং পাওনা আদায়ের ক্ষেত্রেও ভদ্র। জেনে রাখ! তাদের মধ্যে সেই ব্যক্তি খুবই খারাপ যার পাওনা পরিশোধও নিকৃষ্ট এবং যে তাগাদা প্রদানেও অভদ্র। জেনে রাখা রাগ মানুষের অন্তরের অগ্নিস্ফুলিংগর মত। তোমরা কি লক্ষ্য করনি যে, রাগাৱিত ব্যক্তির চক্ষুদ্বয় রক্তিম বর্ণ ধারণ করে এবং তার ঘাড়ের শিরাগুলো ফুলে উঠে। সুতরাং তোমাদের কেউ এরূপ অনুভব করলে সে যেন মাটিতে লুটিয়ে যায় (তাহলে রাগ কমে যাবে)। রাবী বলেন, আমরা সূর্যের দিকে তাকাতে লাগলাম যে, তা এখনো অবশিষ্ট আছে কি না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জেনে রাখ! তোমাদের এই দুনিয়ার যতটুকু অতীত হয়ে গেছে, সেই হিসাবে এতটুকুও আর অবশিষ্ট নেই যতটুকু আজকে এই দিনের অতিবাহিত হয়েছে তার তুলনায় যতটুকু অবশিষ্ট আছে। যঈফ, রাদুন আল বালিক (৮৬), কিন্তু এই হাদীসের কিছু অংশ সহীহ দেখুন হাদীস নং(৪০০০), এবং মুসলিম (৮/১৭২-১৭৩) এ অনুচ্ছেদে হুযইফা, আবূ মারইয়াম (রাঃ) আবূ যাইদ ইবনু আখতাব, মুগীরা ইবনু শুবা, হতেও হাদীস বর্ণিত আছে। তারা বর্ণনা করেন যে, কিয়ামোট পর্যন্ত যেসব ঘটনা সংঘটিত হবে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এগুলো তাদের নিকট বলেছেন। আবূ ঈসা বলেন, এ হাদীসটি হাসান ও সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		}
	]
}