{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2249,
			"arabicnumber": 2249,
			"text": "২২৪৯। ইবনু উমার (রাঃ) হতে বর্ণিত আছে, কোন একদিন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম একদল সাহাবী নিয়ে ইবনু সাইয়্যাদের পাশ দিয়ে যাচ্ছিলেন। তাদের মধ্যে উমার ইবনুল খাত্তাব (রাঃ)-ও ছিলেন। সে তখন মাগালা’ গোত্রের দুর্গের পাশে বালকদের সাথে খেলা করছিল। সেও তখন কিশোর ছিল। সে সাড়া পাওয়ার আগেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গিয়ে তার পিঠে হাত চাপড় দিয়ে প্রশ্ন করলেনঃ তুমি কি সাক্ষ্য দাও যে, আমি আল্লাহর রাসূল? ইবনু সাইয়্যাদ তার দিকে দৃষ্টিপাত করে বলল, আমি সাক্ষ্য দিচ্ছি যে, আপনি নিরক্ষরদের রাসূল! বর্ণনাকারী বলেন, এরপর সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলল, আপনি কি সাক্ষ্য দিচ্ছেন যে, আমিও আল্লাহর রাসূল? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি তো আল্লাহ ও তার রাসূলদের প্রতি ঈমান এনেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আবার প্রশ্ন করলেনঃ তোমার নিকট কী আসে? ইবনু সাইয়্যাদ বলল, আমার নিকট সত্যবাদীও আসে মিথ্যাবাদীও আসে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমার বিষয়টা তালগোল পাকিয়ে গেছে। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি একটি বিষয় তোমার জন্য ঠিক করে রেখেছি। বলতো তা কি? এই বলে তিনি মনে মনে পাঠ করলেনঃ “আকাশ সেদিন স্পষ্ট ধোয়ায় ছেয়ে যাবে\" (সূরাঃ আদ-দুখান— ১০)। উত্তরে ইবনু সাইয়্যাদ বলল, সেটা তো “আদ-দুখ” (ধোঁয়া)। একথা শুনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দূর হও! তুই কখনো তোর ভাগ্যকে অতিক্রম করতে পারবি না। উমার (রাঃ) বললেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আমাকে সম্মতি দিন, একে মেরে ফেলি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে যদি সত্যিই (দাজ্জাল) হয়ে থাকে তাহলে তার উপর তুমি জয়লাভ করতে পারবে না। আর সে তা না হয়ে থাকলে তবে তাকে মেরে ফেলায় তোমার কোন কল্যাণ নেই। আবদুর রাযযাক বলেন, শব্দটিতে দাজ্জাল বুঝান হয়েছে। সহীহ, সহীহ আদাবুল মুফরাদ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 92
			}
		}
	]
}