{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 230,
			"arabicnumber": 230,
			"text": "২৩০। হিলাল ইবনু ইয়াসাফ (রাহঃ) হতে বর্ণিত আছে, তিনি বলেন, যিয়াদ ইবনু আবুল যাদ আমার হাত ধরলেন। এ সময়ে আমরা রাক্কা নামক জায়গায় ছিলাম। তিনি আমাকে এক মুরুব্বির নিকট নিয়ে গেলেন। তিনি ছিলেন আসাদ গোত্রের ওয়াবিসা ইবনু মা'বাদ (রাঃ)। যিয়াদ বললেন, আমাকে এই মুরুব্বি বলেছেন, এক ব্যক্তি কাতারের পেছনে একাকি দাঁড়িয়ে নামায আদায় করছিল। মুরুবিব লোকটি শুনছিলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আবার নামায আদায়ের নির্দেশ দিলেন। —সহীহ। ইবনু মাজাহ– (১০০৪)। এ অনুচ্ছেদে আলী ইবনু শাইবান ও ইবনু আব্বাস (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ ওয়াবিসার হাদীসটি হাসান। কিছু বিশেষজ্ঞ আলিম কাতারের পেছনে একাকি দাঁড়িয়ে নামায আদায় করা মাকরূহ বলেছেন। তারা আরো বলেছেন, কেউ এভাবে নামায আদায় করলে তাকে আবার নামায আদায় করতে হবে। ইমাম আহমাদ ও ইসহাক এ মত গ্রহণ করেছেন। অপর দল বলেছেন, নামায হয়ে যাবে। সুফিয়ান সাওরী, ইবনুল মুবারাক ও শাফিঈ এমত গ্রহণ করেছেন। কৃফাবাসীদের একদল ওয়াবিসার হাদীসের ভিত্তিতে বলেছেন, সারির পেছনে একাকি দাড়িয়ে নামায আদায় করলে তা আবার আদায় করতে হবে। এদের মধ্যে রয়েছেন হাম্মাদ, ইবনু আবু লাইলা ও ওয়াকী\"। হিলাল ইবনু ইয়াসাফের নিকট হতে প্রাপ্ত হুসাইনের হাদীসটি বিভিন্ন সূত্রে বর্ণিত হয়েছে। যেমন আবুল আহওয়াস যিয়াদ ইবনু আবুল যাদ হতে, তিনি ওয়াবিসা হতে বর্ণনা করেছেন। হুসাইনের হাদীস হতে জানা যায়, হিলাল ওয়াবিসার সাক্ষাত পেয়েছেন। এ ব্যাপারে হাদীস বিশারদদের মধ্যে মতের অমিল রয়েছে। কিছু লোক বলেছেন, হিলালের নিকট হতে আমর ইবনু মুররা হতে বর্ণিত হাদীসটি বেশি সহীহ। আবার কিছু লোক বলেছেন, হিলালের নিকট হতে হুসাইনের বর্ণিত হাদীসটি অধিক সহীহ। আবু ঈসা বলেনঃ শেষের বর্ণনাটিই বেশি সহীহ। কেননা এই বর্ণনাটি হিলাল ছাড়াও অন্য সূত্রে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 82
			}
		}
	]
}