{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "২৪৪৬। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিরাজের রাত্রিতে যখন উর্ধারোহণ করলেন, তখন তিনি নবী ও নবীগণের দলের পাশ দিয়ে যান। তিনি তখন দেখতে পেলেন তাদের সাথে আছে তাদের উম্মাতগণ। কোথাও বা একজন নবী ও তার সাথে আছে ছোট একটি দল। আর কোন কোন নবীর সাথে কেউ নেই। অবশেষে তিনি একটি বিরাট দলের পাশদিয়ে এগিয়ে গেলেন। তিনি বলেন, আমি প্রশ্ন করলাম, এ বিরাট দলটি কারা? বলা হলো, মূসা (আঃ) ও তার উন্মাতগণ। আপনি আপনার মাথা তুলে দেখুন। তিনি বলেন, তখন আমি মাথা তুলে দেখলাম, অসংখ্য মানুষের একদল যারা আকাশের এই দিগন্ত ও সেই দিগন্ত পূর্ণ করে আছে। বলা হলো, এরা আপনার উম্মাত। আপনার উম্মাতের মধ্যে এরা ছাড়াও সত্তরহাজার লোক বিনা হিসাবে জান্নাতে প্রবেশ করবে। একথা বলার পর তিনি ঘরের ভিতর ঢুকলেন, কিন্তু এ ব্যাপারে তারা তাকে প্রশ্ন করেনি এবং তিনিও এর ব্যাখ্যা করে বলেননি। তারা নিজেদের মধ্যে বলাবলি শুরু করলেন। কেউ বলেন, আমরাই সেই দলের, যারা বিনা হিসাবে জান্নাতে প্রবেশ করবে। কেউ বলেন, তারা আমাদের সন্তান যারা ইসলামী ফিতরাতে জন্মগ্রহণ করেছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইতোমধ্যে বেরিয়ে এসে বলেন, যারা গায়ে গরম লোহার দাগ দেয় না, ঝাড়ফুঁক করে না, ফাল অর্থাৎ শুভাশুভ লক্ষণ নির্ণয় করে না এবং তাদের প্রভুর উপর পূর্ণ নির্ভরশীল থাকে, তারা হবে বিনা হিসাবে জান্নাতে প্রবেশকারী দল। একথা শুনার পর উক্কাশা ইবনু মিহসান (রাঃ) দাড়িয়ে বলেন, হে আল্লাহর রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)। আমি কি সেই দলের অন্তর্ভুক্ত? তিনি বললেন, হ্যাঁ। তারপর আরেকজন এসে বলল, আমিও কি সেই দলের অন্তর্ভুক্ত? তিনি বললেন, উক্কাশা তোমার অগ্রবর্তী হয়ে গেছে। সহীহ, বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইবনু মাসউদ ও আবূ হুরাইরা (রাঃ) হতেও এ অনুচ্ছেদে হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 32
			}
		}
	]
}