{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2526,
			"arabicnumber": 2526,
			"text": "২৫২৬। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত। তিনি বলেন, আমরা বললামঃ হে আল্লাহর রাসূল আমাদের কি হলো যে, আমরা দুনিয়ার প্রতি উদাসীন হয়ে যাই এবং আমাদেরকে পরকালবাসীদের অন্তর্ভুক্ত মনে করতে থাকি। তারপর আপনার কাছ থেকে সরে গিয়ে পরিবার-পরিজনের নিকট ফিরে গিয়ে দুনিয়াবী কাজে জড়িয়ে পড়ি এবং সন্তানাদির সুগন্ধ পেতে থাকি, তখন আমাদের অবস্থা সম্পূর্ণ উল্টো হয়ে যায়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা যে অবস্থায় আমার নিকট হতে বেরিয়ে যাও, সবসময় যদি সেই অবস্থায় থাকতে তাহলে ফেরেশতারা তোমাদের বাড়ীতে গিয়ে তোমাদের সাথে সাক্ষাৎ করতো। আর তোমরা অপরাধ না করলে আল্লাহ তা'আলা নতুন প্রাণী সৃষ্টি করতেন। যাতে তারা অপরাধ করে আর তিনি তাদেরকে ক্ষমা করেন। আবূ হুরাইরাহ (রাযিঃ) বলেন, আমি প্রশ্ন করলামঃ হে আল্লাহর রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম! কি দিয়ে প্রাণী সৃষ্টি করা হয়েছে? তিনি বললেনঃ পানি দিয়ে। আমি আবার জিজ্ঞেস করলাম, কি দিয়ে জান্নাত তৈরি করা হয়েছে? তিনি বললেনঃ সোনা-রুপার ইট দিয়ে। একটি রূপার ইট, তারপর একটি সোনার ইট, এভাবে গাথা হয়েছে। এর গাথুনির উপকরণ (চুন-সুরকি-সিমেন্ট) সুগন্ধি মৃগনাভি এবং কংকরসমূহ মণি-মুক্তার ও মাটি হলো জাফরান। জান্নাতে প্রবেশকারী লোক অত্যন্ত সুখ-স্বাচ্ছন্দে থাকবে, কোন দুঃখ-কষ্ট ও অভাব-অনটন তাকে স্পর্শ করবে না। সে অনন্তকাল এতে অবস্থান করবে আর মৃত্যুবরণ করবে না। না তার পরনের পোশাক পুরাতন হবে আর না তার যৌবনকাল শেষ হবে (অনন্তযৌবনা হবে)। তিনি পুনরায় বললেনঃ তিনজনের দু’আ ফিরিয়ে দেয়া হয়নাঃ ন্যায়পরায়ণ শাসকের দু’আ, রোযাদারের ইফতারের সময়কালীন দু’আ এবং মাযলুমের দু'আ আল্লাহ তা'আলা একে (মায়ালুমের দু'আ) মেঘমালার উপর তুলে নেন, তার জন্য আকাশের দরজাসমূহ উন্মুক্ত হয়ে যায় এবং আল্লাহ তা'আলা বলেনঃ আমার ইজ্জাত ও সম্মানের শপথ! কিছু দেরিতে হলেও আমি তোমাকে সাহায্য করবো। “কি দিয়ে প্রাণী সৃষ্টি করা হয়েছে\" অংশটুকু ব্যতীত হাদীসটি সহীহ, সহীহাহ (২/৬৯২-৬৯৩), গাইয়াতুল মারাম (৩৭৩)। আবূ ঈসা বলেন, এই হাদীসের সনদ খুব একটা মজবুত নয়। আর আমার মতে এর সনদসূত্র মুত্তাসিল (পরস্পর সংযুক্ত) নয়। এই হাদীসটি অন্য সনদেও আবূ হুরাইরাহ (রাযিঃ)-এর সূত্রে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		}
	]
}