{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "২৭। সালামা ইবনু কাইস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ যখন তুমি ওযু কর নাকে পানি দিয়ে ঝেড়ে ফেল এবং যখন (পায়খানায়) ঢিলা ব্যবহার কর বেজোড় সংখ্যায় ব্যবহার কর। -সহীহ। ইবনু মাজাহ– (৪০৬)। এ অনুচ্ছেদে উসমান, লাকীত ইবনু সাবিরাহ, ইবনু আব্বাস, মিকদাম ইবনু মাদিকারিব, ওয়াইল ইবনু হুজর ও আবু হুরাইরা (রাঃ) হতে বর্ণিত হাদীসও রয়েছে। আবু ঈসা বলেনঃ সালামা ইবনু কাইসের হাদীস হাসান সহীহ। যে ব্যক্তি কুলি করেনি ও নাকে পানি দেয়নি তার ওযুর পূর্ণতা সম্পর্কে মনীষীদের মধ্যে মতভেদ রয়েছে। তাদের মধ্যে এক দলের বক্তব্য হল, যে ব্যক্তি ওযুর সময় কুলি করেনি ও নাকে পানি দেয়নি এ অবস্থায় সে নামায আদায় করলে তাকে দ্বিতীয়বার তা আদায় করতে হবে। তারা ওযু এবং (ওয়াযিব) গোসলের সময় কুলি করা ও নাকে পানি দেয়া অত্যাবশ্যকীয় মনে করেছেন। এ দলে রয়েছেন ইবনু আবী লাইলা, আবদুল্লাহ ইবনুল মুবারক, ইমাম আহমাদ ইবনু হাম্বল ও ইসহাক। ইমাম আহমাদ আরো বলেছেন, নাক পরিষ্কার করা কুলি করার চেয়ে বেশী জরুরী। আবু ঈসা বলেনঃ অন্য এক দল বলেছেন, যদি নাপাকির গোসলে কুলি করা ও নাকে পানি দেওয়া না হয় তবে আবার নামায আদায় করতে হবে; আর যদি ওযুর সময় এটা ছাড়া হয় তাহলে নতুন করে নামায আদায় করতে হবে না। এটা সুফিয়ান সাওরী ও কুফার কিছু লোকের (ইমাম আবু হানীফা ও তার মতানুসারী) বক্তব্য। অপর এক দলের মতে, গোসল অথবা ওযুর সময় এ দুটি কাজ বাদ দিলে নামায নতুন করে আদায় করতে হবে না। কেননা এটা নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামের সুন্নাত। অতএব কেউ যদি ফরয গোসলে বা ওযুর সময় কুলি না করে এবং নাকে পানি না দেয় আর এই ওযু দিয়ে নামায আদায় করে নেয় তাহলে পুনরায় নামায আদায় করতে হবে না। ইমাম মালিক ও শাফিঈ সর্বশেষ এই অভিমত প্রকাশ করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		}
	]
}