{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2824,
			"arabicnumber": 2824,
			"text": "২৮২৪। ‘আবদুল্লাহ ইবনু উমর (রাযিঃ) হতে বর্ণিত আছে যে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ (কুলক্ষণ বলতে কিছু থাকলে) এ তিনটিতে থাকতোঃ (১) নারী, (২) ঘর ও (৩) জন্তু। “কোন বস্তুতে কুলক্ষণ থাকলে\" অংশসহ হাদীসটি সহীহঃ বুখারী ও মুসলিম। ঐ অংশ ব্যতীত হাদীসটি শাযঃ সহীহাহ (৪৪৩, ৭৯৯, ১৮৯৭) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইমাম যুহরীর কিছু শিষ্য অত্র হাদীসের সনদে বর্ণনাকারী হামযার উল্লেখ করেননি। তারা এভাবে বর্ণনা করেছেনঃ সালিম-তার বাবা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। একইভাবে ইবনু আবী উমারও এ হাদীসটি বর্ণনা করেছেনঃ সুফইয়ান ইবনু উয়াইনাহ্ হতে, তারা যুহরী হতে, তিনি ইবনু উমর (রাযিঃ)-এর পুত্রদ্বয় সালিম ও হামযা-তাদের বাবা হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে। সাঈদ ইবনু আবদুর রাহমান-সুফইয়ান হতে, তিনি যুহরী হতে, তিনি সালিম (রহঃ) হতে তার বাবার সূত্রে উপরে বর্ণিত হাদীসের সমার্থক হাদীস বর্ণনা করেছেন। এ সূত্রে সাঈদ ইবনু আবদুর রাহমান-হামযা হতে এভাবে উল্লেখ করেননি। সাঈদের রিওয়ায়াত অধিকতর সহীহ। কেননা ‘আলী ইবনুল মাদীনী ও হুমাইদী (রহঃ) সুফইয়ানের সূত্রে বর্ণনা করেছেন। যুহরী আমাদের নিকট এ হাদীস শুধুমাত্র সালিম-ইবনু উমর (রাযিঃ)-এর সূত্রেই বর্ণনা করেছেন। মালিক ইবনু আনাস (রহঃ) এ হাদীসটি যুহরীর সূত্রে বর্ণনা করেছেন এবং বলেছেনঃ আবদুল্লাহ ইবনু উমার (রাযিঃ)-এর পুত্রদ্বয় সালিম ও হামযা হতে-তাদের বাবার সূত্রে। এ অনুচ্ছেদে সাহল ইবনু সাদ, আয়িশাহ ও আনাস (রাযিঃ) হতেও হাদীস বর্ণিত রয়েছে। অধিকন্তু নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে আরো বর্ণিত আছে যে, তিনি বলেছেনঃ “কোন কিছুতে কুলক্ষণ বলতে কিছু থাকলে, নারী, জন্তু ও ঘরের মধ্যেই থাকত।” তাছাড়া হাকীম ইবনু মু'আবিয়াহ (রাযিঃ) বলেন, আমি রাসূলুল্লাহু সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ “কুলক্ষণ বলতে কিছু নেই। তবে কখনো কখনো ঘর, নারী ও ঘোড়ার মধ্যে শুভ লক্ষণ (বারকাত) দেখা যায়।” সহীহঃ ইবনু মাজাহ (১৯৩০)। ‘আলী ইবনু হুজর-ইসমাঈল ইবনু আইয়্যাশ হতে, তিনি সুলাইমান মু'আবিয়াহ ইবনু হাকীম হতে, তিনি তার চাচা হাকীম ইবনু মু'আবিয়াহ (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে, এই সূত্রে উক্ত হাদীসটি বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}