{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "২৯০৮। উসমান (রাযিঃ) হতে বর্ণিত, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ সে লোকই তোমাদের মধ্যে শ্রেষ্ঠ বা উত্তম যে নিজে কুরআন শিখে এবং তা অন্যকে শিখায়। সহীহঃ দেখুন পূর্বের হাদীস। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। আবদুর রাহমান ইবনু মাহদী প্রমুখ সুফইয়ান সাওরী হতে, তিনি আলকামাহ্ ইবনু মারসাদ হতে, তিনি আবূ আবদুর রাহমান হতে, তিনি উসমান (রাযিঃ) হতে, তিনি নবীসাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সুত্রে একই রকম বর্ণনা করেছেন। সুফিয়ান উক্ত হাদিসের সনদে সা'দ ইবনু উবাইদার উল্লেখ করেননি। ইয়াহইয়া ইবনু সাঈদ আল-কাত্তান এ হাদীস সুফইয়ান ও শুবাহ হতে, তিনি আলকামাহ হতে, তিনি ইবনু মারসাদ হতে, তিনি সা'দ ইবনু উবাইদাহ হতে, তিনি আবূ 'আবদুর রাহমান হতে, তিনি উসমান (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে বর্ণনা করেছেন। ইয়াহইয়া ইবনু সাঈদ-সুফইয়ান ও শুবাহুর সূত্রে মুহাম্মাদ ইবনু বাশশার উক্ত হাদীস আমাদের নিকট বর্ণনা করেছেন। মুহাম্মাদ ইবনু বাশশার বলেন, ইয়াহইয়া ইবনু সাঈদ উক্ত হাদীস সুফইয়ান ও শুবাহ-একাধিকবার আলকামাহ ইবনু মারসাদের সূত্রে-সা'দ ইবনু উবাইদাহ্ হতে তিনি আবূ আবদুর রহমান হতে, তিনি উসমান (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সূত্রে একই রকম বর্ণনা করেছেন। মুহাম্মাদ ইবনু বাশশার বলেন, সুফইয়ানের শাগরিদগণ এর সনদে \"সুফইয়ান-সা'দ ইবনু উবাইদাহ হতে\" এভাবে উল্লেখ করেননি এবং এটাই সহীহ। আবূ ঈসা বলেন, শুবাহ এ হাদীসের সনদে সা'দ ইবনু উবাইদার নাম অতিরিক্ত উল্লেখ করেছেন। সুফইয়ানের রিওয়ায়াতই যেন অধিক সহীহ। আলী ইবনু আবদুল্লাহ বলেন, ইয়াহইয়া ইবনু সাঈদ বলেছেন, আমার মতে শুবাহুর সমতুল্য কেউ নেই। কোন রিওয়ায়াতের বেলায় সুফইয়ানের সাথে তার মতের অমিল হলে সেই ক্ষেত্রে আমি সুফইয়ানের বক্তব্য গ্রহণ করি। আবূ ঈসা বলেন, আমি আবূ আম্মারকে ওয়াকীর সূত্রে উল্লেখ করতে শুনেছি, তিনি বলেন, শুবাহ বলেছেন, সুফইয়ান আমার চাইতে অনেক বেশী স্মৃতিশক্তির অধিকারী। সুফইয়ান কারো বরাতে আমার নিকট কিছু বর্ণনা করলে আমি সেই প্রসঙ্গে উক্ত ব্যক্তিকে প্রশ্ন করলে তিনি হুবহু তাই বলেন যা সুফইয়ান আমাকে বলেছেন। এ অনুচ্ছেদে আলী ও সা'দ (রাযিঃ) হতেও হাদীস বর্ণিত আছে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		}
	]
}