{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2965,
			"arabicnumber": 2965,
			"text": "২৯৬৫। উরওয়া (রহঃ) হতে বর্ণিত, তিনি বলেন, আমি আয়িশাহ (রাযিঃ)-কে বললাম, যে ব্যক্তি সাফা ও মারওয়ার তাওয়াফ (সাঈ) করেনি আমি তাতে সমস্যা মনে করি না। আমি নিজেও এ দুই পাহাড়ের মাঝে তাওয়াফ না করতে কোন পরোয়া করি না। আয়িশাহ্ (রাযিঃ) বললেন, হে আমার বোন পুত্র! তুমি যা বললে তা খুবই অন্যায় কথা। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নিজে এই দুই পাহাড়ের মাঝে তাওয়াফ করেছেন, মুসলিমরাও এর তাওয়াফ করেছেন। তবে মুশাল্লাল’ নামক স্থানে স্থাপিত মানাত নামক প্রতিমার নামে যেসব কাফির ইহরাম বাধতো তারা সাফা ও মারওয়ার তাওয়াফ করত না। অতঃপর বারকাতময় আল্লাহ তা’আলা অবতীর্ণ করেনঃ “যে লোক বাইতুল্লাহর হজ্জ করে বা উমরা করে এই পাহাড়দ্বয়ের মাঝে তাওয়াফ করায় তার কোন সমস্যা নেই”- (সূরা আল-বাকারাহ ১৫৮)। তোমাদের কথাই যদি সঠিক হত, তাহলে এভাবে বলা হতঃ “ফালা জুনাহা আলাইহি আল-লা ইয়াত্তাওয়াফা বিহিমা” (এই পাহাড়দ্বয়ের মাঝে তাওয়াফ না করাতে কোন সমস্যা নেই)। যুহরী (রাহঃ) বলেন, আমি আবূ বাকর ইবনু আবদুর রাহমান ইবনুল হারিস ইবনু হিশামের নিকট এটি বর্ণনা করলে তিনি খুবই আনন্দিত হন এবং বলেন, এটা তো হল ইলমের (জ্ঞানের) কথা! আমি বহু আলিমকে বলতে শুনেছি, যেসব আরববাসী সাফা-মারওয়ার তাওয়াফ করে না তারা বলে, এ দুটি পাহাড়ের মাঝে তাওয়াফ করা জাহিলী যুগের প্রথা। অপর দিকে কিছু সংখ্যক আনসারী বলত, আমাদেরকে বাইতুল্লাহর তাওয়াফ করার আদেশ করা হয়েছে এবং সাফা-মারওয়ার মাঝে তাওয়াফের আদেশ দেয়া হয়নি। এ প্রসঙ্গেই আল্লাহ তা'আলা অবতীর্ণ করলেনঃ “নিশ্চয়ই সাফা ও মারওয়া আল্লাহ তা'আলার নির্দেশনসমূহের অন্তর্ভুক্ত”– (সূরা আল-বাকারাহ ১৫৮)। আবূ বাকর ইবনু আবদুর রাহমান বলেন, আমার মতে উপরোক্ত উভয় দলের প্রসঙ্গেই এ আয়াত অবতীর্ণ হয়েছে। সহীহঃ ইবনু মা-জাহ (২৯৮৬), বুখারী (৪৪৯৫), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		}
	]
}