{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "২৯৭২। আসলাম আবূ ইমরান আত-তুজীবী (রহঃ) হতে বর্ণিত, তিনি বলেন, আমরা রোম সাম্রাজ্যের কোন এক শহরে অবস্থানরত ছিলাম। তখন আমাদেরকে মুকাবিলা করার উদ্দেশ্যে রোমের এক বিশাল বাহিনী যাত্রা শুরু করল। মুসলিমদের পক্ষ হতেও একই রকম বা আরো বিশাল একটি বাহিনী যাত্রা শুরু করল। তখন মিসরবাসীর শাসক ছিলেন উকবাহ ইবনু আমির (রাযিঃ) এবং বাহিনীর সেনাপতি ছিলেন ফাযালাহ ইবনু উবাইদ (রাযিঃ)। একজন মুসলিম সেনা রোমীয়দের উপর প্রচণ্ড আক্রমণ করেন। এমনকি বুহ্য ভেদ করে তিনি তাদের ভেতরে ঢুকে পড়েন। তখন মুসলিমগণ সশব্দে চিৎকার করেন এবং বলেন, সুবহানাল্লাহ! লোকটি নিজেকে ধ্বংসের মধ্যে নিক্ষেপ করেছে। তখন আবূ আইয়ুব আল-আনসারী (রাযিঃ) দাঁড়িয়ে বললেন, হে জনমণ্ডলী! তোমরা এ আয়াতের এরূপ ব্যাখ্যা করছ? অথচ এ আয়াতটি আমাদের তথা আনসারদের ব্যাপারে অবতীর্ণ হয়েছে। আল্লাহ তা'আলা যখন ইসলামকে বিজয় দান করলেন এবং ইসলামের বিপুল সংখ্যক সাহায্যকারী হয়ে গেল, তখন আমাদের মধ্যে কেউ কেউ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে না শুনিয়ে চুপে চুপে বলল, আমাদের মাল-সম্পদ তো নষ্ট হয়ে যাচ্ছে। আল্লাহ তা'আলা ইসলামকে এখন শক্তিশালী করেছেন। তার সাহায্যকারীর সংখ্যাও অনেক বৃদ্ধি পেয়েছে। এখন যদি আমরা আমাদের মাল-সম্পদ রক্ষাণাবেক্ষণের জন্য অবস্থান করতে এবং বিনষ্ট হয়ে যাওয়া সম্পদের পুনর্গঠনের কাজে আত্মনিয়োগ করতাম (তাহলে ভাল হতো)। এ প্রসঙ্গেই আল্লাহ তা'আলা আমাদের ধারণাকে প্রত্যাখ্যান করে তার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর প্রতি নিম্নোক্ত আয়াত অবতীর্ণ করেনঃ “তোমরা আল্লাহ তা'আলার পথে ব্যয় কর এবং নিজেদের হাতে নিজেদেরকে ধ্বংসের মধ্যে নিক্ষেপ করো না” (সূরা আল-বাক্কারাহ ১৯৫)। কাজেই মাল-সম্পদের তত্ত্বাবধান ও তার পুনর্গঠনে আত্মনিয়োগ করা এবং জিহাদ ত্যাগ করাই হচ্ছে ধ্বংস। অতএব আবূ আইয়ুব আল-আনসারী (রাযিঃ) বাড়িঘর ছেড়ে সব সময় আল্লাহ তা'আলার রাস্তায় জিহাদে ব্যাপৃত থাকতেন। অবশেষে তিনি রোমে (তৎকালীন এশিয়া মাইনর, বর্তমানে তুরস্ক) ইন্তিকাল করেন এবং সেখানেই তাকে দাফন করা হয়। সহীহঃ সহীহাহ (১৩)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ গারীব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		}
	]
}