{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "২৯৮১। মা'কিল ইবনু ইয়াসার (রাযিঃ) হতে বর্ণিত, তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর যামানায় তার বোনকে এক মুসলিমের নিকট বিবাহ দেন। এ মহিলা তার নিকট যত দিন জীবন অতিবাহিত করার করলো। তারপর তার স্বামী তাকে এক তালাক দেয়। ইদ্দাত শেষ হয়ে যাওয়ার পূর্বে সে তাকে আবার স্ত্রীত্বে ফিরিয়ে আনার ব্যবস্থা করেনি। এমতাবস্থায় ইদ্দাত শেষ হয়ে যাওয়ার পর লোকটি তার স্ত্রীর প্রতি এবং স্ত্রী স্বামীর প্রতি আকৃষ্ট হল। তাই সেও এক প্রস্তাবকের মাধ্যমে তাকে পুনর্বিবাহের প্রস্তাব পাঠায়। কিন্তু তার ভাই (মাকিল) বলেন, হে ইতর প্রাণী! আমি তোমার সাথে আমার বোনের বিবাহ দিয়ে তোমাকে সম্মানিত করেছিলাম, কিন্তু তুমি তাকে তালাক দিয়েছ। আল্লাহর কসম! সে আর কখনো তোমার নিকট ফিরে যাবে না। এই তোমার সাথে শেষ কথা। বর্ণনাকারী বলেন, আল্লাহ তা'আলা জানতেন ঐ নারীর প্রতি লোকটির আকর্ষণ এবং লোকটির প্রতি নারীর আকর্ষণের কথা। তখন বারকাতময় আল্লাহ তা'আলা অবতীর্ণ করেনঃ “তোমরা যখন স্ত্রীদের তালাক দাও এবং তারা তাদের ইদ্দাত কাল পূর্ণ করে, তখন তারা চাইলে তোমরা তাদের বাধা দিও না। তোমাদের মধ্যে যে কেউ আল্লাহ তা'আলা ও পরকালে বিশ্বাস করে, তাকে এর দ্বারা উপদেশ দেয়া হচ্ছে। এটা তোমাদের জন্য শুদ্ধতম ও পবিত্রতম। আল্লাহ তা'আলা জানেন, তোমরা জান না”— (সূরা আল-বাকরাহ ২৩২)। বর্ণনাকারী বলেন, মাকিল (রাযিঃ) এ আয়াত শোনার পর বললেন, আমার প্রভুর আদেশ সর্বোপরি শিরোধার্য। আমি শুনলাম এবং আনুগত্যের শির অবনত করলাম। তিনি ঐ লোককে ডেকে পাঠালেন এবং বললেন, (চলো) তোমার সাথে তাকে বিবাহ দিয়ে দিচ্ছি এবং তোমার খাতির সম্মান বহাল করছি। সহীহঃ ইরওয়াহ (১৮৪৩), সহীহ আবূ দাউদ (১৮২০), বুখারী (৪৫২৯)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। হাসান (রহঃ) হতে এটি অন্যান্য সূত্রেও বর্ণিত হয়েছে। হাসান (রহঃ) সূত্রে হাদীসটি গারীব। এ হাদীস হতে জানা গেল যে, ওয়ালী অর্থাৎ অভিবাবক ব্যতীত বিবাহ বৈধ হয় না। কারণ মাকিল ইবনু ইয়াসার (রাযিঃ)-এর বোন প্রাপ্তবয়স্কা তালাকপ্রাপ্তা ছিলেন। ওয়ালী ব্যতীত নিজের বিবাহ করার এখতিয়ার থাকলে তিনি নিজেই বিবাহ সূত্রে আবদ্ধ হয়ে যেতে পারতেন এবং তার ওয়ালী মাকিল ইবনু ইয়াসার (রাযিঃ)-এর প্রয়োজন বোধ করতেন না। আল্লাহ তা'আলাও এ আয়াতে ওয়ালী অর্থাৎ অভিভাবকদেরই সম্বোধন করেছেন। যেমন তিনি বলেছেনঃ “তারা যদি বিধিমত পরস্পর সম্মত হয় তাবে স্ত্রীগণ নিজেদের স্বামীদের বিবাহ করতে চাইলে তোমরা তাদের বাধা দিও না”। এ আয়াত দ্বারা প্রমানিত হয় যে, বিবাহের ব্যাপারটি নারীদের সম্মতি সাপেক্ষে ওয়ালীর উপর ন্যস্ত করা হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 33
			}
		}
	]
}