{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2987,
			"arabicnumber": 2987,
			"text": "২৯৮৭। আল-বারাআ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, “তোমরা নিকৃষ্ট বস্তু দান করার ইচ্ছা করবে না”— (সূরা আল-বাকারাহ ২৬৭) আয়াতটি আমাদের আনসারদের প্রসঙ্গে অবতীর্ণ হয়েছে। তিনি বলেন, আমরা ছিলাম খেজুর বাগানের মালিক। লোকেরা তাদের খেজুর বাগান হতে বেশী বা স্বল্প পরিমাণ অনুসারে খেজুর নিয়ে আসতো। কেউ বা এক-দুই ছড়া খেজুর এনে মসজিদে ঝুলিয়ে রাখতো। সুফফাবাসী সাহাবীগণের খাদ্য সংস্থানের বিশেষ কোন নির্দিষ্ট উৎস ছিল না। তাদের কারো ক্ষুধা পেলে তিনি উক্ত খেজুরের ছড়ার নিকট এসে তাতে লাঠি দ্বার আঘাত করতেন। ফলে কাচা-পাকা খেজুর ঝরে পড়ত এবং তিনি তা খেতেন। কিন্তু কিছু সংখ্যক লোকের কল্যাণকর কাজের প্রতি খুব একট আগ্রহ ছিল না। তাদের কেউ নিকৃষ্ট ও পচা খেজুরের ছড়াও নিয়ে আসতো, আবার কেউ ভেঙ্গে পড়া ছড়াও নিয়ে আসতো এবং তা (মসজিদে) বুলিয়ে রাখতো। কল্যাণময় আল্লাহ তা’আলা এ প্রসঙ্গে আয়াত অবতীর্ণ করেন (অনুবাদ) “হে ঈমানদারগণ! তোমরা যা উপার্জন কর এবং আমি যা জমিন হতে তোমাদের জন্য উৎপাদন করি, তন্মধ্যে যা উৎকৃষ্ট তা ব্যয় কর এবং তা হতে নিকৃষ্ট বস্তু ব্যয় করার সংকল্প করো না, অথচ তোমরা তা গ্রহণ করবে না, যদি না তোমরা চক্ষু বন্ধ করে থাক” (সূরা আল-বাকারাহ ২৬৭)। তিনি বলেন, অর্থাৎ দাতা যেরূপ দান করেছে, অনুরূপই যদি তাকে উপহারস্বরূপ দেয়া হয়, তাহলে সে কখনো তা গ্রহণ করবে না, চক্ষুর লজ্জায় পড়া বা দৃষ্টি এড়িয়ে রাখা ব্যতীত। বর্ণনাকারী বলেন, এরপর হতে আমাদের কেউ কিছু আনলে তার নিকট যা আছে তার মধ্যকার সর্বোৎকৃষ্টগুলো নিয়ে আসতো। সহীহঃ ইবনু মা-জাহ (১৮২২)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব সহীহ। আবূ মালিক হচ্ছেন আবূ মালিক আল-গিফারী। তার নাম গাযওয়ান বলেও কথিত আছে। সাওরী (রহঃ) সুদীর সূত্রে উক্ত হাদীসের অংশবিশেষ রিওয়ায়াত করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 39
			}
		}
	]
}