{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "৩০০৬। আসমা ইবনুল হাকাম আল-ফাযারী (রহঃ) হতে বর্ণিত, তিনি বলেন, আমি আলী (রাযিঃ)-কে বলতে শুনেছিঃ আমি এমন লোক ছিলাম যে, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট কোন হাদীস শুনলে আল্লাহ তা'আলার ইচ্ছায় আমি তার দ্বারা প্রভূত উপকৃত হতাম। আর আমার নিকট তার কোন সাহাবী হাদীস বর্ণনা করলে আমি তাকে শপথ করতে বলতাম। আমার কথায় তিনি শপথ করলে, আমি তার সত্যতা স্বীকার করতাম। অতএব আবূ বাকর (রাযিঃ) আমার নিকট হাদীস বর্ণনা করেন। বলা বাহুল্য, আবূ বাকর (রাযিঃ) সত্য কথাই বলেছেন। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ কোন লোক যদি গুনাহ করার পর পবিত্রতা অর্জন করে নামায আদায় করে, তারপর আল্লাহ তা'আলার নিকট ক্ষমা প্রার্থনা করে তবে তাকে আল্লাহ তা'আল। অবশ্যই ক্ষমা করে দেন। তারপর তিনি এ আয়াত পড়েন (অনুবাদ) “যাদের অবস্থা এমন যে, তারা কখনো অশ্লীল কর্ম করে ফেললে অথবা নিজেদের প্রতি যুলুম করলে পরে আল্লাহ তা'আলাকে স্মরণ করে এবং নিজেদের গুনাহের জন্য ক্ষমা প্রার্থনা করে (তাদেরকে ক্ষমা করা হয়)। আল্লাহ তা'আলা ব্যতীত কে গুনাহ মাফ করতে পারে? আর তারা যা করে ফেলেছে জ্ঞাতসারে তার পুনরাবৃত্তি করে না”— (সূরা আলি ইমরান-১৩৫)। হাসানঃ ইবনু মা-জাহ (১৩৯৫)। আবূ ঈসা বলেন, এ হাদীসটি উসমান ইবনুল মুগীরাহ্ (রহঃ)-এর সূত্রে শুবাহ প্রমুখ বর্ণনাকারীগণ মারফুরূপে বর্ণনা করেছেন। মিস'আর ও সুফইয়ানও উসমান ইবনুল মুগীরার সূত্রে এটি রিওয়ায়াত করেছেন, তবে মারফু হিসেবে নয়। কিছু বর্ণনাকারী এই হাদীসটি মিস’আর হতে মাওকুফ হিসেবে বর্ণনা করেছেন, আর কিছু বর্ণনাকারী মারফু’ হিসেবে বর্ণনা করেছেন। সুফইয়ান সাওরী তা উসমান ইবনুল মুগীরাহ হতে মাওকুফ হিসেবে বর্ণনা করেছেন। উক্ত হাদীস ব্যতীত আসমা ইবনুল হাকাম কর্তৃক বর্ণিত আর কোন হাদীস আমাদের জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 58
			}
		}
	]
}