{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3012,
			"arabicnumber": 3012,
			"text": "৩০১২। আবদুল্লাহ ইবনু মাসউদ (রাযিঃ) হতে বর্ণিত আছে যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যে লোক তার সম্পদের যাকাত প্রদান করে না, আল্লাহ তা'আলা কিয়ামতের দিন তার (মালকে তার) ঘাড়ে বিষধর অজগর সাপরূপে স্থাপন করবেন। তারপর তিনি এই কথার সত্যতা প্রমাণে আল্লাহ তা'আলার কিতাবের এ আয়াত আমাদেরকে শুনান (অনুবাদ) “তাদেরকে আল্লাহ তা'আলা নিজ অনুগ্রহে যা দান করেছেন তাতে যারা কৃপণতা করে তারা যেন মনে না করে যে, এটা তাদের পক্ষে কল্যাণকর। না, এটা তাদের পক্ষে অকল্যাণকর। যাতে তারা কৃপণতা করে কিয়ামতের দিন তাই তাদের গলার বেড়ি হবে। আসমান ও যমীনের স্বত্বাধিকার একমাত্র আল্লাহ তা'আলার জন্য। তোমরা যা কর আল্লাহ তা'আলা তা বিশেষভাবে অবহিত”– (সূরা আ-লি ইমরান ১৮০)। বর্ণনাকার কখনো বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সমর্থনে এ আয়াতাংশ পাঠ করেন (অনুবাদ) “যাতে তারা কৃপণতা করে কিয়ামতের দিন তা তাদের গলায় বেড়ী হবে।” তিনি আরো বলেনঃ যে ব্যক্তি মিথ্যা শপথের মধ্যেমে তার মুসলিম ভাইয়ের মাল আত্মসাৎ করে, সে আল্লাহ তা'আলার সাথে এরূপ অবস্থায় মিলিত হবে যে, আল্লাহ তা'আলা তার প্রতি অসন্তুষ্ট। এর সত্যতার সমর্থনে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহ তা'আলার কিতাবের এ আয়াত পাঠ করেন (অনুবাদ) “যারা আল্লাহ তা'আলার সাথে কৃত প্রতিশ্রুতি এবং নিজেদের শপথসমূহকে তুচ্ছ মূল্যে বিক্রয় করে, পরকালে তাদের জন্য কোন অংশ নেই। কিয়ামতের দিন আল্লাহ তা'আলা না তাদের সাথে কথা বলবেন, না তাদের প্রতি তাকাবেন, আর না তাদেরকে পবিত্র করবেন। তাদের জন্য রয়েছে উৎপীড়ক শাস্তি”— (সূরা আ-লি ইমরান ৭৭)। সহীহঃ মুশকিলাতুল ফাকর (৬০), তা’লীকুর রাগীব (১/৬৮) হাদীসের ২য় অংশ বুখারী (৭৪৪৫), মুসলিম (১/৮৬)। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। “শুজা'আন আকরাআ” অর্থ সাপ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 64
			}
		}
	]
}