{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "৩০৩৬। কাতাদাহ্ ইবনুন নুমান (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমাদের মধ্যে বানু উবাইরিক নামে একটি পরিবার ছিল। ঐ পরিবারে বিশর, বুশাইর ও মুবাশশির নামে তিনজন লোক ছিল। বুশাইর ছিল মুনাফিক। সে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গী সাথীদের কুৎসা বর্ণনামূলক কবিতা রচনা করত, তারপর অপরাপর আরবদের প্রতি সেগুলো আরোপ করে বলত, অমুকে এরূপ এরূপ কথা বলেছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সাহাবীগণ যখন তা শুনতেন তখন বলতেন, আল্লাহর শপথ। ঐ অপদার্থ (খবীস) লোকটি ব্যতীত আর কেউ এ কবিতা রচনা করেনি বা একই রকম কোন মন্তব্য করতেন। যাই হোক তারা বলতেন, এটা ইবনুল উবাইরকেরই (বুশাইর) কবিতা। বর্ণনাকারী বলেন, জাহিলী ও ইসলামী উভয় যুগে এ পরিবারটি ছিল অভাবগ্রস্ত ও দুর্ভিক্ষ পীড়িত। মদীনায় লোকদের প্রধান খাদ্য ছিল খেজুর ও আটা। কেউ সম্পদশালী হলে সিরিয়া হতে কোন খাদ্যদ্রব্যের ব্যবসায়ী সাদা আটা বা ময়দা নিয়ে এলে সে ঐ (ব্যবসায়ী) কাফিলা হতে ময়দা কিনে নিয়ে সঞ্চয় করে রাখত নিজের ব্যবহারের জন্য। অবশিষ্ট পরিবার-পরিজনের জন্য থাকতো খেজুর ও গম। একবারের ঘটনা, সিরিয়া হতে একটি খাদ্য ব্যবসায়ী কাফিলা এলো। আমার চাচা রিফা'আহ ইবনু যাইদ (তাদের হতে) এক বস্তা ময়দা কিনলেন এবং ভাড়ার ঘরে রেখে দিলেন। একই জায়গায় অস্ত্রশস্ত্র, বর্ম ও তলোয়ারও ছিল। এদিকে ঘরের নিচ দিয়ে তার মাল আসবাব চুরি হয়ে গেল। গোপনে সিদ কেটে উক্ত ঘরে রক্ষিত ময়দা ও অস্ত্রশস্ত্র লাপাত্তা হয়ে গেল। ভোরবেলা আমার চাচা রিফা'আহ আমার নিকট আসলেন এবং বললেন, হে ভাতিজা! আমার উপর তো এ রাতে যুলুম হয়ে গেল। আমার ভাড়ারের ঘরে সিদ কেটে খাবার (ময়দা) ও অস্ত্রশস্ত্র চুরি করে নিয়ে যাওয়া হয়েছে। মহল্লায় অনুসন্ধান চালিয়ে দেখলাম ও জিজ্ঞাসাবাদ করলাম। আমাদের বলা হল, আমরা আজ রাতে বানু উবাইরিকদের ঘরে আলো জ্বালাতে দেখেছি। আমাদের ধারণা মতে তারা তোমাদের খাদ্যাদির তালাশেই আলো জ্বালিয়েছিল। রিফা'আহ বললেন, আমরা যখন এ ব্যাপারে জিজ্ঞাসাবাদ করছিলাম তখন উবাইরিকের লোকেরা বলল, আল্লাহর শপথ আমরা মনে করি তোমাদের এই চোর লাবীদ ইবনু সাহল ব্যতীত আর কেউ নয়। আমরা আগেই মহল্লাবাসীদের এ বিষয়ে জিজ্ঞাসাবাদ করেছি। লাবীদ ছিলেন আমাদেরই মধ্যকার একজন সৎ ও ভালো মুসলিম। লাবীদ এ কথা শুনামাত্র খাপ হতে তলোয়ার বের করে বললেন, আমি চুরি করি? আল্লাহর কসম! হয় আমার এ তলোয়ারের সাথে তোমার সাক্ষাত হবে অথবা তোমরা এ চুরির সাক্ষ্য-প্রমাণ হাযির করবে। তখন লোকেরা বলল, যাও তুমি আমাদের সামনে থেকে সরে দাড়াও। তুমি এ কাজ করোনি। এরপরও আমরা এ ব্যাপারে মহল্লায় জিজ্ঞাসাবাদ করে নিশ্চিত হলাম যে, বানু উবাইরিকই এ কাণ্ড ঘটিয়েছে। অবশেষে আমার চাচা আমাকে বললেন, হে ভাতিজা! তুমি ঘটনার বৃত্তান্ত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট জানালে ভালো হত। কাতাদাহ (রাযিঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে তাকে বললাম, আমাদের মহল্লায় একটি যালিম পরিবার আছে এবং তারা আমার চাচা রিফা'আহ ইবনু যাইদের ভাণ্ডার কক্ষে সিঁদ কেটে তার অস্ত্রশস্ত্র ও খাদ্যাদি চুরি করে নিয়ে গেছে। আমাদের অস্ত্রশস্ত্র ফিরিয়ে দেয়ার ব্যবস্থা করুন, খাদ্যদ্রব্যাদির প্রয়োজন নেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ আমি শীঘ্রই এ ব্যাপারে একটা ফাইসালা করে দিচ্ছি। বনু উবাইরিক এ কথা শুনার পর তাদের নিজেদের এক লোকের নিকট এলো, যার নাম ছিল উসাইর ইবনু ‘উরওয়াহ। তারা তার সাথে এ বিষয়ে আলাপ-আলোচনা করল। এ বাড়ির কিছু লোক একত্র হয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, হে আল্লাহর রাসূল! কাতাদাহ ইবনুন নুমান ও তার চাচা আমাদের এক সৎ ও মুসলিম পরিবারের পেছনে লেগেছে এবং কোন প্রমাণ ব্যতীতই তারা তাদের বিরুদ্ধে চুরির অভিযোগ করছে। কাতাদাহ (রাযিঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে (বিষয়টি নিয়ে) তার সাথে কথা বললাম। তিনি বললেনঃ তুমি এমন এক পরিবারের বিরুদ্ধে বিনা প্রমাণে চুরির অপবাদ দিচ্ছ, যাদের সততা ও ইসলাম সম্পর্কে সুনাম আছে। কাতাদাহ (রাযিঃ) বলেন, আমি ফিরে আসলাম। আমি মনে মনে বললাম, আমার এ সামান্য মাল হাতছাড়া হয়ে যাওয়া সত্ত্বেও আমি যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে এ বিষয়ে আলাপ না করতাম। এরপর আমার চাচা রিফা'আহ আমার নিকট এসে বললেন, হে ভাতিজা! (আমার ব্যাপারে) কি করেছ? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে যা কিছু বলেছেন, আমি তাকে তা জানালাম। তিনি বললেন, আল্লাহ তা'আলাই প্রকৃত সাহায্যকারী। এরপর কিছু সময় না যেতেই কুরআনের আয়াত অবতীর্ণ হয় (ব্যাখ্যাসহ অনুবাদ) “নিশ্চয়ই আমি এ কিতাব সত্য সহকারে তোমার প্রতি অবতীর্ণ করেছি, যেন আল্লাহ তা'আলা তোমাকে যা জ্ঞাত করেছেন তদনুসারে লোকদের মধ্যে মীমাংসা করতে পার। তুমি খিয়ানাতকারীদের পক্ষে (যেমন বনু উবাইরিকের সমর্থনে) বিতর্ককারী হয়ো না। আর তুমি আল্লাহ তা'আলার নিকট ক্ষমা প্রার্থনা কর (কাতাদাহকে যা বলেছ তার জন্য)। নিশ্চয় আল্লাহ তা'আলা বড়ই ক্ষমাশীল ও দয়াবান। যারা নিজেদেরকে প্রতারিত করে তুমি তাদের সাহায্য করো না। আল্লাহ তা'আলা খিয়ানাতকারী পাপিষ্ঠদেরকে পছন্দ করেন না। এরা মানুষের হতে লুকাতে পারে, কিন্তু আল্লাহ তা'আলা হতে গোপন হতে পারে না, কেননা তিনি তাদের সঙ্গেই থাকেন, যখন তারা রাতের বেলা গোপনে গোপনে তার মর্জি বিরুদ্ধ পরামর্শ করে। এদের সমস্ত কাজই আল্লাহ তা'আলা জ্ঞাত। আহা! তোমরাই এসব অপরাধীর পক্ষ সমর্থনে পার্থিব জীবনে বিতর্ক করছ, কিন্তু কিয়ামতের দিন আল্লাহ তা'আলার সামনে এদের পক্ষে কে ঝগড়া করবে অথবা কে তাদের উকিল হবে? কেউ কোন পাপকৰ্ম করলে বা নিজের উপর যুলুম করলে তারপর আল্লাহ তা'আলার নিকট ক্ষমা প্রার্থনা করলে সে আল্লাহ তা'আলাকে ক্ষমাকারী ও অনুগ্রহশীল পাবে (অর্থাৎ তারা আল্লাহ তা'আলার নিকট ক্ষমা প্রার্থনা করলে আল্লাহ তা'আলা তাদেরকে ক্ষমা করে দিবেন)। কেউ গুনাহের কাজ করলে সে তা নিজের ক্ষতির জন্যই করে। আল্লাহ তা'আলা সর্বজ্ঞ, প্রজ্ঞাময়। কেউ কোন সমস্যা বা পাপকৰ্ম করে তারপর তা কোন নির্দোষ ব্যক্তির প্রতি আরোপ করলে (যেমন লাবীদ প্রসঙ্গে তাদের বক্তব্য) সে তো সাংঘাতিক মিথ্যা অপবাদ ও প্রকাশ্য পাপের বোঝা বহন করে। তোমার প্রতি আল্লাহ তা'আলার অনুগ্রহ ও দয়া না থাকলে তাদের একটি দল তোমাকে পথভ্রষ্ট করতে চাইত। কিন্তু তারা নিজেদের ব্যতীত অন্য কাউকে পথভ্রষ্ট করতে পারে না এবং তোমার কোন ক্ষতিও করতে পারে না। আল্লাহ তা'আলা তোমার প্রতি কিতাব ও হিকমাত অবতীর্ণ করেছেন এবং তোমাকে এমন জ্ঞান জানিয়ে দিয়েছেন যা তুমি জানতে না। তোমার প্রতি আল্লাহ তা'আলার বিরাট অনুগ্রহ আছে। তাদের বেশির ভাগ গোপন সলা-পরামর্শে কোন কল্যাণ নেই। অবশ্য কেউ কাউকে দান-খাইরাতের কিংবা কোন ভালো কাজের জন্য অথবা লোকদের মাঝে শান্তি স্থাপনের উপদেশ দিলে তাতে কল্যাণ আছে। আল্লাহ তা'আলার সন্তুষ্টি লাভের জন্য যে কেউ এরূপ করলে তাকে অবশ্যই আমি মহাপুরস্কার দিব।” (সূরা আন-নিসা ১০৫-১১৪) কুরআনের আয়াত অবতীর্ণ হওয়ার পর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট অপহৃত অস্ত্র ফেরত আনা হল। তিনি তা রিফা'আহ (রাযিঃ)-কে ফিরিয়ে দিলেন। কাতাদাহ (রাযিঃ) বলেন, আমার চাচা ছিলেন বৃদ্ধ। জাহিলিয়াতের যুগে তার রাতকানা রোগ হয়েছিল, অথবা বলেছেন, জাহিলিয়াতের আমলেই বৃদ্ধ হয়ে গিয়েছিলেন (আবূ ঈসার সন্দেহ)। আমার ধারণা ছিল যে, তিনি ইসলামে দাখিল ছিলেন। আমি তার নিকট অস্ত্র ফেরত নিয়ে আসলে তিনি বললেন, হে ভাতিজা এটা আমি আল্লাহ তা'আলার রাস্তায় দান করে দিলাম। এবার আমার প্রত্যয় জন্মালো যে, নিঃসন্দেহে তিনি একজন খাঁটি মুসলিম। কুরআনের উক্ত আয়াতসমূহ অবতীর্ণ হওয়ার পর বুশাইর মুশরিকদের সাথে গিয়ে মিলিত হয় এবং সা'দ ইবনু সুমাইয়্যার কন্যা সুলাফার নিকট অবস্থান গ্রহণ করে। তখন আল্লাহ তা'আলা অবতীর্ণ করেনঃ কারো নিকট সৎপথ প্রকাশিত হওয়ার পর সে যদি রাসূলের বিরুদ্ধাচরণ করে এবং মুমিনদের পথ ব্যতীত অন্য পথের অনুসরণ করে, তবে যে দিকে সে ফিরে যায় আমরা সেদিকেই তাকে ফিরিয়ে দিব এবং জাহান্নামে তাকে দগ্ধ করব। আর তা কত মন্দ আবাস। নিশ্চয়ই আল্লাহ তা’আলা তার সাথে শারীক করাকে ক্ষমা করেন না, তা ব্যতীত সবকিছু যাকে ইচ্ছা ক্ষমা করেন এবং কেউ আল্লাহ তা'আলার সাথে শরীক করলে সে ভীষণভাবে পথভ্রষ্ট হয়\"- (সূরা আন-নিসা ১১৫-১১৬)। বুশাইর যখন সুলাফার নিকট আশ্রয় নিল, তখন হাসসান ইবনু সাবিত (রাযিঃ) কিছু কবিতার চরণ দ্বারা সুলাফার নিন্দাবাদ করেন। এতে সুলাফা বুশাইরের মালপত্র নিজ মাথায় তুলে নিয়ে তা আবতাহ নামক স্থানে গিয়ে ফেলে দিল। সে আরো বলল, তুমি আমার জন্য হাসসানের (নিন্দাসূচক) কবিতা উপহার নিয়ে এলে, আমার জন্য উত্তম কিছু নিয়ে আসতে পারলে না হাসান। আবূ ঈসা বলেন, এ হাদীসটি গারীব। মুহাম্মাদ ইবনু সালামাহ আল-হাররানী ব্যতীত আর কেউ এটিকে মুসনাদরূপে রিওয়ায়াত করেছেন বলে আমাদের জানা নেই। এ হাদীসটি মুহাম্মাদ ইবনু ইসহাক-আসিম ইবনু উমার ইবনু কাতাদাহ সূত্রে ইউনুস ইবনু বুকাইর প্রমুখ মুরসালরূপে বর্ণনা করেছেন। তাতে তার বাবা-তার দাদা সূত্রের উল্লেখ নেই। কাতাদাহ্ ইবনুন নুমান মাতার দিক হতে আবূ সাঈদ আল-খুদরী (রাযিঃ)-এর ভাই। আবূ সাঈদ (রাযিঃ)-এর নাম সাদ ইবনু মালিক ইবনু সিনান।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 88
			}
		}
	]
}