{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3049,
			"arabicnumber": 3049,
			"text": "৩০৪৯। উমার ইবনুল খাত্তাব (রাযিঃ) হতে বর্ণিত, তিনি বলেন, হে আল্লাহ! শরাবের ব্যাপারে আমাদের জন্য পরিপূর্ণ ও সুস্পষ্ট বর্ণনা দিন। এ প্রসঙ্গেই সূরা আল-বাকারার নিম্নোক্ত আয়াত অবতীর্ণ হয় (অনুবাদ) “লোকে তোমাকে মদ ও জুয়া প্রসঙ্গে প্রশ্ন করে। বল, উভয়ের মধ্যে আছে মহাপাপ এবং মানুষের জন্য উপকারও। কিন্তু এগুলোর পাপ এগুলোর উপকার অপেক্ষা বেশি” (সূরা আল-বাকারাহ ২১৯)। উমার (রাযিঃ)-কে ডেকে এনে তাকে উক্ত আয়াত তিলাওয়াত করে শুনানো হল। তিনি বললেন, হে আল্লাহ! শরাবের ব্যাপারে আমাদের আরও সুস্পষ্ট ও পূর্ণাঙ্গ বিবরণ দিন। তখন সূরা আন-নিসার নিম্নোক্ত আয়াত অবতীর্ণ হয় (অনুবাদ) “হে ঈমানদারগণ! তোমরা নেশাগ্রস্ত অবস্থায় নামাযের নিকটেও যেও না, যতক্ষণ না তোমরা যা বল তা বুঝতে পার”— (সূরা আন-নিসা ৪৩)। উমার (রাযিঃ)-কে ডেকে এনে তাকে উক্ত আয়াত পাঠ করে শুনানো হল। উমার (রাযিঃ) আবারো বললেন, হে আল্লাহ! শরাবের ব্যাপারে আমাদের সুস্পষ্ট ও পূর্ণ বিবরণ দিন। তারপর সূরা আল-মাইদার এ আয়াত অবতীর্ণ হয় (অনুবাদ) শাইতান তো শরাব ও জুয়ার মাধ্যমে তোমাদের মধ্যে শত্রুতা ও বিদ্বেষ ঘটাতে চায় এবং তোমাদেরকে আল্লাহ তা'আলার স্মরণে ও নামাযে বাধা দিতে চায়। তবে কি তোমরা নিবৃত্ত হবে না?”— (সূরা আল-মায়িদাহ ৯১) উমর (রাযিঃ)-কে ডেকে এনে তাকে এ আয়াত পাঠ করে শুনানো হল। তিনি বললেন, আমরা নিবৃত হলাম, আমরা নিবৃত হলাম। সহীহঃ সহীহাহ (২৩৪৮)। আবূ ঈসা বলেন, ইসরাঈলের সূত্রে এটি মুরসালরূপে বর্ণিত হয়েছে। মুহাম্মাদ ইবনুল আলা-ওয়াকী হতে, তিনি ইসরাঈল হতে, তিনি আবূ ইসহাক হতে, তিনি আবূ মাইসারাহ (রহঃ) হতে এই সূত্রে বর্ণিত, তিনি বলেন, উমার ইবনুল খাত্তাব (রাযিঃ) বললেন, হে আল্লাহ! শরাব ও মাদক দ্রব্য প্রসঙ্গে আমাদের জন্য সুস্পষ্ট ও পূর্ণাঙ্গ বিবরণ দিন ..... তারপর তিনি পূর্বোক্ত হাদীসের একই রকম বর্ণনা করেছেন। এটি মুহাম্মাদ ইবনু ইউসুফের হাদীসের চাইতে অনেক বেশি সহীহ।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 101
			}
		}
	]
}