{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "৩০৫৯। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, তামীম আদ-দারী (রাঃ) নিম্নোক্ত আয়াত প্রসঙ্গে বলেছেন, আমি ও আদী ইবনু বাদ্দা ব্যতীত অপর কারো সাথে তা সম্পর্কিত নয়ঃ “হে ঈমানদারগণ! যখন তোমাদের মধ্যে.কারো মৃত্যু হাযির হয় তখন ওসিয়াত করার সময় তোমাদের মধ্য হতে ন্যায়নিষ্ঠ দু'জনকে সাক্ষী রাখবে” (সূরাঃ আল-মাইদা- ১০৬)। তারা দু’জনই ছিলেন নাসারা। ইসলাম কবুলের পূর্বে বাণিজ্যের উদ্দশ্যে তাদের সিরিয়ায় আসা যাওয়া ছিল। কোন এক সময় তারা ব্যবসার উদ্দেশ্যে সিরিয়া যান। বানু সাহমের গোলাম বুদাইল ইবনু আবূ মারইয়ামও ব্যবসায়ের উদ্দেশ্যে তাদের নিকট আসলো। তার নিকট একটি রূপার পানপাত্র ছিল। তিনি এটি বাদশার নিকট বিক্রয়ের উদ্দেশ্যে এনেছিলেন। তার ব্যবসায় পণ্যের মধ্যে এটিই ছিল সর্বোৎকৃষ্ট। হঠাৎ তিনি অসুস্থ হয়ে পড়েন। তিনি তাদের (তামীমুদ দারী ও আদী ইবনু বাদ্দা) উভয়কে ওসিয়াত করেন যে, (তার মারা যাবার পর) তার রেখে যাওয়া মালামাল যেন তারা তার পরিজনকে পৌছে দেয়। তামীম (রাঃ) বলেনঃ তিনি মারা গেলে আমরা পানপত্রটি নিয়ে গিয়ে এক হাজার দিরহামে বিক্রয় করি এবং বিক্রয়লব্ধ টাকা আমি ও আদী ইবনু বাদা নিজেদের মধ্যে ভাগ করে নেই। আমরা তার পরিবার-পরিজনের নিকট পৌছে, আমাদের নিকট যা কিছু সঞ্চিত ছিল তা তাদের ফিরিয়ে দিলাম। কিন্তু তারা পানপাত্রটি না পেয়ে আমাদেরকে সেটি প্রসঙ্গে প্রশ্ন করে। আমরা বললাম, সে তো আমাদের নিকট ইহা ব্যতীত আর কিছু রেখে যায়নি। তামীম (রাঃ) বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মদীনায় পদার্পণের পর যখন আমি ইসলাম কুবুল করি, তখন আমি আমার এ অপকর্মের জন্য নিজেকে দোষী মনে করলাম (এবং এ হতে মুক্ত হতে চাইলাম)। তাই আমি তার পরিজনের নিকট এসে তাদের আসল ঘটনা খুলে বললাম এবং তাদের পাঁচ শত দিরহাম দিয়ে দিলাম। আমি তাদের এও বললাম, আমার সংগীর (আদী ইবনু বাদা) নিকটও সমপরিমাণ (দিরহাম) রয়েছে। তারা তখন বিষয়টি নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কাছে এলো। তিনি তাদের নিকট প্রমাণ চাইলে তারা তা পেশ করতে অক্ষম হয়। তিনি তাদের নির্দেশ দিলেন যে, তারা আদী ইবনু বাদ্দাকে এমনভাবে কসম করতে বলবে যেভাবে কসম করলে তার ধর্মের দৃষ্টিতে তা গুরুত্বপূর্ণ হয়। তারপর আদী শপথ করল (নিজেকে নির্দোষ প্রমাণের জন্য)। তখন আল্লাহ তা'আলা এ আয়াত অবতীর্ণ করেনঃ “হে মু’মিনগণ! তোমাদের কারও যখন মৃত্যু হাযির হয় তখন ওসিয়াত করার সময় তোমাদের মধ্য হতে দু'জন ন্যায়পরায়ণ লোককে সাক্ষী রাখবে... আল্লাহ তা'আলা সত্যত্যাগী সম্প্রদায়কে সৎপথে পরিচালিত করেন না” (সূরাঃ আল-মায়িদাহ১০৬-১০৮)। তারপর আমর ইবনুল আস (রাঃ) ও অপর এক ব্যক্তি সাক্ষ্য দিতে উঠলেন এবং শপথ করলেন। অবশেষে আদী ইবনু বাদ্দার নিকট হতে পাঁচ শত দিরহাম আদায় করা হয়। সনদ অত্যন্ত দুর্বল আবূ ঈসা বলেনঃ এ হাদীসটি গারীব। এটির সনদ সহীহ নয়। আর যে আবূন নাযরের নিকট হতে মুহাম্মাদ ইবনু ইসহাক এ হাদীসটি বর্ণনা করেছেন, আমার মতে তিনি হচ্ছেন মুহাম্মাদ ইবনুস সাইব আল-কালবী। আবূন নাদর হল তার ডাকনাম। মুহাদ্দীসগণ তাকে বর্জন করেছেন। তিনি একজন তাফসীরকারও। আমি মুহাম্মাদ ইবনু ইসমাঈলকে বলতে শুনেছি যে, মুহাম্মাদ ইবনুস সাইব আল-কালবীর ডাকনাম আবূন নাযর। উম্মু হানী (রাঃ)-এর মুক্তগোলাম আবূ সালিহ হতে সালিম আবূন নাযর আল-মাদীনীর কোন বর্ণনা আছে বলে আমাদের জানা নেই। ইবনু আব্বাস (রাঃ) হতেও এ বিষয়ে সংক্ষেপিত আকারে ভিন্নরূপে হাদীস বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 111
			}
		}
	]
}