{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "৩০৮৬। ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত, তিনি বলেন, আমি উসমান ইবনু আফফান (রাযিঃ)-কে বললাম, শত আয়াতের চাইতে ক্ষুদ্রতম সূরা আল-আনফালকে শত আয়াত সম্বলিত সূরা বারাআতের পূর্বে স্থাপন করতে কিসে আপনাদেরকে উদ্বুদ্ধ করল? যার ফলে আপনারা এই দুটি সূরাকে একত্রে মিলিয়ে দিলেন, অথচ উভয়ের মাঝখানে বিসমিল্লাহির রাহমানির রাহীম' বাক্যটি লিখেননি এবং এটিকে সপ্ত দীর্ঘ সূরার মধ্যে রেখে দিয়েছেন। আপনাদের এরূপ করার কারণ কি? উসমান (রাযিঃ) বললেন, একই সময়কালে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর উপর অনেকগুলো সূরা অবতীর্ণ হত। অতএব তার উপর কোন আয়াত অবতীর্ণ হলে তিনি লেখকদের কাউকে ডেকে বলতেন, এ আয়াতগুলো অমুক সূরায় যোগ কর যাতে এই এই বিষয়ের বর্ণনা রয়েছে। অতএব তার উপর আয়াত অবতীর্ণ হলে তিনি বলতেন, ঐ সূরাতে এ আয়াতটি শামিল কর যাতে এই এই বিষয়ের বর্ণনা রয়েছে। সূরা আল-আনফাল ছিল মদীনায় অবতীর্ণ প্রাথমিক সূরাসমূহের অন্তর্ভুক্ত। আর বারাআত ছিল (নাযিলের দিক হতে) কুরআনের শেষ দিকের সূরা। সূরা বারাআতের আলোচ্য বিষয় সূরা আল-আনফালের আলোচ্য বিষয়ের সাথে সাদৃশ্যপূর্ণ ছিল। তাই আমার ধারণা হল, এটি (বারাআত) তার অন্তর্ভুক্ত। এদিকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মৃত্যুবরণ করেন। অথচ তিনি আমাদের স্পষ্ট করে বলে যাননি যে, এ সূরা (বারাআত) আনফালের অন্তর্ভুক্ত কি না। তাই আমি উভয় সূরাকে একত্রে মিলিয়ে দিয়েছি এবং সূরাদুটাের মাঝখানে বিসমিল্লাহির রাহমাননির রাহীম বাক্যও লিখিনি, আর এটিকে সপ্ত দীর্ঘ সূরাসমূহের অন্তর্ভুক্ত করেছি। হাসান। আবূ ঈসা বলেন, এ হাদীসটি হাসান। আমরা এ হাদীস শুধু ‘আওফ হতে, তিনি ইয়াযীদ আল-ফারিসী হতে, তিনি ইবনু আব্বাস (রাযিঃ) হতে এই সূত্রেই জেনেছি। ইয়াযীদ আল-ফারেসী বসরাবাসী তাবিঈগণের অন্তর্ভুক্ত। আর ইয়াযীদ ইবনু আবান আর-রাকাশীও বাসরাবাসী তাবিঈগণের অন্তর্ভুক্ত। তবে তিনি পূর্বোক্ত জনের চাইতে কনিষ্ঠ। ইয়াযীদ আর-রাকাশী (রাহঃ) আনাস ইবনু মালিক (রাযিঃ) হতে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 138
			}
		}
	]
}