{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3153,
			"arabicnumber": 3153,
			"text": "৩১৫৩। আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত, তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (ইয়াজুয-মাজুযের) প্রাচীর প্রসঙ্গে বলেনঃ এরা প্রত্যেকদিন বাধার প্রাচীর খনন করতে থাকে। যখন তারা এটাকে চৌচির করে ভেদ করার কাছাকাছি এসে যায়, তখন তাদের সরদার বলে, ফিরে চলো, কাল সকালে এটাকে সম্পূর্ণরূপে ভেঙ্গে ফেলব। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ তা'আলা প্রাচীরটিকে পূর্বের ন্যায় পূর্ণাঙ্গ করে দেন। তারা প্রতিদিন এভাবে এই প্রাচীর খুঁড়তে থাকে। অবশেষে যখন তাদের বন্দীত্বের মেয়াদ শেষ হয়ে যাবে এবং আল্লাহ তা'আলা তাদেরকে জনবসতিতে পাঠানোর ইচ্ছা করবেন তখন ইয়াজুয-মাজু্যদের সরদার বলবে, আজ চলো। আল্লাহ তা'আলা চাইলে আগামী কাল সকালে আমরা এই দেয়াল ভেঙ্গে ফেলব। সে তার কথার সাথে ইনশাআল্লাহ বলবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তারা ফিরে যাবে। গতকাল দেয়ালটিকে তারা যে অবস্থায় ছেড়ে গিয়েছিল, এবার ফিরে এসে ঠিক সেই অবস্থায়ই পাবে। এরা দেয়াল ভেদ করে জনপদে ছড়িয়ে পড়বে এবং সমস্ত পানি পান করে শেষ করে ফেলবে। মানুষজন এদের ভয়ে ভীতসন্ত্রস্ত হয়ে পালিয়ে যাবে। এরা আকাশের দিকে নিজেদের তীর ছুড়বে। তাদের তীরগুলোকে রক্ত-রঞ্জিত করে ফিরিয়ে দেয়া হবে। এরা বলবে, পৃথিবীর বাসিন্দাদের উপর আমরা প্রতিশোধ নিয়েছি এবং আকাশবাসীদের উপরও আধিপত্য বিস্তার করে তাদেরকে অধীনস্ত করে নিয়েছি। আল্লাহ তা'আলা এদের গলদেশে কীট সৃষ্টি করবেন। ফলে এরা ধ্বংসপ্রাপ্ত হবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ সেই সত্তার শপথ, যার হাতে মুহাম্মাদের প্রাণ! যমীনের কীট-পতঙ্গ ও জীব-জন্তু এদের গোশত খেয়ে খুব মোটাতাজা হবে, খুব পরিতৃপ্ত হবে এবং এগুলোর দেহে বেশ চর্বি জমবে। সহীহঃ ইবনু মা-জাহ (৪০৮০) আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। আমরা এ হাদীসটি শুধু উপর্যুক্ত সনদেই অনুরূপভাবে জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 205
			}
		}
	]
}