{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3168,
			"arabicnumber": 3168,
			"text": "৩১৬৮। ইমরান ইবনু হুসাইন (রাঃ) হতে বর্ণিত আছে, “হে লোকেরা! তোমাদের প্রভুর গযব হতে নিজকে রক্ষা কর। কিয়ামতের কম্পন বড়ই ভয়াবহ ব্যপার। যেদিন তোমরা তা দেখতে পাবে সেদিনের অবস্থা এমন হবে যে, প্রত্যেক স্তন্যদাত্রী নিজের দুধের শিশুকে দুধ পান করাতে ভুলে যাবে। প্রত্যেক গর্ভবতী গর্ভপাত করবে এবং লোকদেরকে তোমরা মাতালের মতো দেখতে পাবে, অথচ তারা নেশাগ্রস্ত নয়। বরং আল্লাহ্ তা'আলার শাস্তিই এতদূর কঠোর হবে\" (সূরাঃ আল-হাজ্জ১-২)। রাবী বলেন, এ আয়াত যখন অবতীর্ণ হয়, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সফরে ছিলেন। তিনি বললেনঃ তোমরা কি জান এটা কোন দিন? সাহাবীগণ বললেনঃ আল্লাহ তা'আলা ও তার রাসূলই সবচাইতে ভাল জানেন। তিনি বললেনঃ এটা সেই দিন, যখন আল্লাহ তা'আলা আদম (আঃ)-কে বলবেনঃ জাহান্নামের বাহিনী প্রস্তুত কর। আদম (আঃ) বলবেনঃ হে প্ৰভু! জাহান্নামের বাহিনীর সংখ্যা কত? তিনি বলবেনঃ (হাজারকে) নয় শত নিরানব্বই জন জাহান্নামের এবং একজন জান্নাতের বাহিনী। একথা শুনে মুসলিমরা কান্নায় ভেংগে পড়েন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সমতল পথে চলো, আল্লাহ তা'আলার নৈকট্য খোজ কর, সোজা পথ ধর। প্রত্যেক নাবূয়াতের পূর্বেই রয়েছে জাহিলিয়াত। তিনি আরো বললেনঃ জাহিলিয়াত হতেই বেশি সংখ্যক নেয়া হবে। যদি এতে সংখ্যা পূর্ণ হয় তো ভালো, অন্যথায় মুনাফিকদের দিয়ে সংখ্যা পূর্ণ করা হবে। অপরাপর উম্মাতের ও তোমাদের উদাহরণ হচ্ছে, যেমন পশুর বাহুর দাগ অথবা উটের পার্শ্বদেশের তিলক (অর্থাৎ তোমাদের সংখ্যা বেশি হবে)। তিনি আবার বললেনঃ আমি আশা করি তোমরাই হবে জান্নাতের এক-চতুর্থাংশ অধিবাসী। একথা শুনে তারা তাকবীর ধ্বনি উচ্চারণ করেন। তারপর তিনি বললেনঃ আমি আশা করি তোমরাই হবে জান্নাতের এক-তৃতীয়াংশ অধিবাসী। একথা শুনে তারা তাকবীর ধ্বনি দেন। তিনি আবার বললেনঃ আমি আশা করি তোমরাই হবে জান্নাতের অর্ধেক অধিবাসী। তারা এবারও তাকবীর ধ্বনি দেন। রাবী বলেন, তিনি দুই-তৃতীয়াংশের কথা বলেছেন কি-না তা আমার মনে নেই সনদ দুর্বল, তা’লীকুর রাগীব (৪/২২৯)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 220
			}
		}
	]
}