{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3179,
			"arabicnumber": 3179,
			"text": "৩১৭৯। ইবনু আব্বাস (রাযিঃ) কর্তৃক বর্ণিত আছে, তিনি বলেন, হিলাল ইবনু উমাইয়্যাহ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট শারীক ইবনু সাহমার সাথে তার স্ত্রীর যিনার অভিযোগ দায়ের করেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ প্রমাণ হাযির কর, অন্যথায় তোমার পিঠে চাবুক পড়বে। বর্ণনাকারী বলেন, হিলাল (রাযিঃ) বললেন, হে আল্লাহর রাসূল! আমাদের কেউ যদি তার স্ত্রীর সাথে কোন পুরুষ লোককে গৰ্হিত কাজে লিপ্ত দেখে, তখন সে কি সাক্ষী খুঁজে বেড়াবে? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতে থাকেনঃ প্রমাণ দাও, অন্যথায় তোমার পিঠে শাস্তির চাবুক পড়বে। বর্ণনাকারী বলেন, হিলাল (রাযিঃ) বললেন, সেই সত্তার কসম যিনি আপনাকে সত্য দ্বীনসহ পাঠিয়েছেন! অবশ্যই আমি সত্যবাদী। আমার দৃঢ় বিশ্বাস, আমার বিষয়ে ওয়াহী অবতীর্ণ হবে যা আমার পিঠকে কষ্ট হতে রেহাই দিবে। তারপর অবতীর্ণ হলঃ “যারা নিজেদের স্ত্রীদের বিরুদ্ধে (যিনার) অভিযোগ আনে, অথচ নিজেরা ব্যতীত তাদের কোন সাক্ষী নেই তাদের প্রত্যেকের সাক্ষ্য এই হবে যে, সে চারবার আল্লাহ তা'আলার নামে কসম করে সাক্ষ্য দিবে যে, সে (তার আনীত অভিযোগে) অবশ্যই সত্যবাদী এবং পঞ্চম বারে বলবে, সে মিথ্যাবাদী হলে তার উপর আল্লাহ তা'আলার অভিসম্পাত হোক। আর স্ত্রীলোকটির কষ্ট রহিত হবে যদি সে চারবার আল্লাহ তা'আলার নামে কসম করে সাক্ষ্য দেয় যে, এ লোক (তার উত্থাপিত অভিযোগে) মিথ্যাবাদী। সে পঞ্চম বারে বলবে, সে (অভিযোগকারী স্বামী) সত্যবাদী হলে তার (স্ত্রীর) উপর আল্লাহ তা'আলার গযব পতিত হোক\"- (সূরা আন-নূর ৬-৯)। বর্ণনাকারী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অবসর হয়ে তাদের (স্বামী-স্ত্রী) উভয়কে ডেকে পাঠান। তারা উভয়ে হাযির হলে হিলাল (রাযিঃ) দাড়িয়ে সাক্ষ্য দিলেন। এ সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলতে থাকেন? নিশ্চয়ই আল্লাহ তা'আলা অবগত আছেন যে, তোমাদের একজন মিথ্যাবাদী, তোমাদের মধ্যে কে তওবা করতে প্রস্তুতঃ তারপর মেয়েলোকটি দাড়িয়ে সাক্ষ্য দিল। সে যখন পঞ্চম বারে বলতে যাচ্ছিল যে, সে (স্বামী) যদি সত্যবাদী হয়, তাহলে তার (স্ত্রীর) উপর আল্লাহ তা'আলার গযব নিপতিত হোক, তখন লোকেরা তাকে বলল, এ কথা (শাস্তিকে) অবশ্যম্ভাবী করে তুলবে। ইবনু আব্বাস (রাযিঃ) বলেন, এ কথা শুনে সে থেমে গেল এবং পিছনে সরে আসল। আমরা ধারণা করলাম যে, সে তার কথা হতে ফিরে আসবে। অতঃপর মেয়েলোকটি বলল, আমি চিরকালের জন্য আমার গোত্রে কালিমা লেপন করতে পারি না। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ তোমরা এই স্ত্রীলোকটির উপর নজর রেখ। সে যদি কাজল বর্ণের চোখ, প্রশস্ত নিতম্ব ও পায়ের গোশত গোছাযুক্ত সন্তান প্রসব করে তবে সে সন্তান শারীক ইবনু সাহমারই। পরবর্তীতে মহিলাটি ঐ রূপ সন্তানই প্রসব করলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ যদি আগেই আল্লাহ তা'আলার হুকুম (লি'আনের বিধান) না এসে যেত, তাহলে আমাদের এবং তার মধ্যে একটা বিরাট কিছু ঘটে যেত (তাকে শাস্তি দেয়া হত)। সহীহঃ ইবনু মা-জাহ, (২০৬৭) বুখারী (৪৭৪৭)। আবূ ঈসা বলেন, হিশাম ইবনু হাসসানের বর্ণনা হিসেবে এ হাদীসটি হাসান গারীব। আব্বাদ ইবনু মানসূর-ইকরিমাহ হতে, তিনি ইবনু আব্বাস (রাযিঃ) হতে, তিনি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে এই সনদে পূর্বোক্ত হাদীসের একই রকম বর্ণনা করেছেন। আইয়ূব এ হাদীস ইকরিমার সনদে মুরসাল হিসেবে বর্ণনা করেছেন এবং তাতে ইবনু আব্বাসের উল্লেখ করেননি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 231
			}
		}
	]
}