{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "৩১৮০। আয়িশাহ (রাযিঃ) কর্তৃক বর্ণিত আছে, তিনি বলেন, যখন আমার বিষয়ে চর্চা হচ্ছিল যে বিষয়ে আমি কিছুই জানতাম না, তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার প্রসঙ্গে বক্তব্য দিতে দাঁড়ালেন। তিনি তাশাহহুদ পড়ে আল্লাহ তা'আলার যথোপযুক্ত সুনাম ও গুণগান করার পর বলেনঃ তারপর তোমরা আমাকে ঐ সব ব্যক্তির বিষয়ে বুদ্ধি দাও, যারা আমার সহধর্মিণীর ব্যাপারে অপবাদ দিয়েছে। আল্লাহর কসম! আমি আমার পরিবারের (স্ত্রীর) মধ্যে কখনো কোন দোষ দেখিনি। এসব ব্যক্তি যার ব্যাপারে বদনাম রটিয়ে বেড়াচ্ছে। আল্লাহর কসম! আমি এ ধরনের কোন দুষ্কর্ম তার মধ্যে কখনো দেখিনি। সে (সাফওয়ান) আমার অনুপস্থিতিতে কখনো আমার ঘরে ঢুকেনি। আমি যখন উপস্থিত থাকতাম তখনই সে আমার ঘরে ঢুকত। আমি যখন সফরের কারণে ঘরে অনুপস্থিত থাকতাম, তখন সেও আমার সঙ্গেই থাকত। সা'দ ইবনু মুআয (রাযিঃ) উঠে দাঁড়িয়ে বললেন, হে আল্লাহর রাসূল! আমাকে অনুমতি দিন, আমি এদের ঘাড় উড়িয়ে দেই। তখন খাযরাজ বংশের এক লোক উঠে দাঁড়ালো। হাসসান ইবনু সাবিতের মা এই বংশের সন্তান। লোকটি বলল, তুমি মিথ্যাবাদী। আল্লাহর কসম! এরা যদি আওস গোত্রের লোক হত, তাহলে তুমি তাদের ঘাড় উড়িয়ে দেয়া কখনো পছন্দ করতে না। তর্ক-বিতর্ক এমন পর্যায়ে পৌছে গেল যে, আওস ও খাযরাজ বংশদ্বয়ের মধ্যে মসজিদের ভিতরেই মারামারি লেগে যাওয়ার উপক্রম হল। অথচ এ (অপবাদ) বিষয়ে আমি কিছুই জানতাম না। ঐ দিন সন্ধ্যা রাতে আমি প্রাকৃতিক প্রয়োজনে বাইরে গেলাম। আমার সাথে মিসতাহর মা ও ছিল। সে হোচট খেয়ে পড়ে গিয়ে বলল, মিসতাহ শেষ হোক। আমি তাকে বললাম, হে! তুমি মা হয়ে তোমার ছেলের অমঙ্গল কামনা করছ? সে চুপ হয়ে গেল। সে আবার হোচট খেল এবং বলল, মিসতাহ শেষ হোক। আমি তাকে তিরস্কার করে বললাম, হে! তুমি কেমন মা, নিজের ছেলের অমঙ্গল ডাকছ। সে চুপ হয়ে গেল। সে তৃতীয়বার হোচট খেল এবং বলল, মিসতাহর সর্বনাশ হোক। আমি তাকে কঠোরভাবে বললাম, তুমি কেমন মা, নিজের ছেলের অমঙ্গল চাচ্ছ! সে বলল, আল্লাহর কসম! আমি তোমার জন্যই তাকে গালমন্দ করছি। আমি প্রশ্ন করলাম, আমার কারণে কিভাবে? আয়িশাহ (রাযিঃ) বলেন, সে আমার নিকট সমস্ত ব্যাপার বর্ণনা করল। আমি (তা শুনে) বললাম, এই সব কথা রটেছে নাকি? সে বলল, হ্যাঁ। [\"আয়িশাহ (রাযিঃ) বলেন, আমি বাড়িতে ফিরে আসলাম। আল্লাহর কসম! আমার এমন অবস্থা হল যে, যেজন্য এসেছিলাম সে প্রয়োজনের কথা ভুলেই গেলাম। আমার গায়ে জ্বর এসে গেল। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বললাম, আমাকে আমার বাপের বাড়ি পাঠিয়ে দিন। তিনি আমার সাথে একটি বালককে দিয়ে আমাকে পাঠিয়ে দিলেন। আমি ঘরে ঢুকে উম্মু রুমানকে (মাকে) ঘরের নীচের অংশে দেখতে পেলাম। আর আবূ বাকর (রাযিঃ) ঘরের উপরি তলে কুরআন পড়ছিলেন। মা প্রশ্ন করলেন, কন্যা! তুমি কেন এসেছ? আয়িশাহ (রাযিঃ) বলেন, আমি মাকে বিষয়টি সম্পূর্ণ খুলে বললাম। কিন্তু আমি যেভাবে ভেঙ্গে পড়েছি সে তুলনায় তিনি ততটা ভারাক্রান্ত নন। তিনি বললেন, কন্যা! ব্যাপারটিকে হালকাভাবে নাও। আল্লাহর কসম! কোন পুরুষের সুন্দরী স্ত্রী থাকলে, সে তার প্রিয়পাত্রী হলে এবং তার সতীন থাকলে তারা তার সাথে হিংসা করবে না, তার বিষয়ে কিছু রটাবে না এরূপ কমই হয়ে থাকে। মোটকথা আমি যতটা দুঃখ পেলাম মা ততটা পেলেন না। আমি মাকে প্রশ্ন করলাম, আব্বাও কি ব্যাপারটি জানেন? তিনি বললেন, হ্যাঁ। আমি আবার প্রশ্ন করলাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও কি? তিনি বললেন, হ্যাঁ। আমি ভারাক্রান্ত হয়ে কান্নায় ভেঙ্গে পড়লাম। আবূ বকর (রাযিঃ) আমার কান্নার শব্দ শুনতে পেলেন। তিনি ঘরের উপরি তলে কুরআন পাঠ করছিলেন। তিনি নেমে এসে মাকে বললেন, ওর কি হয়েছে? মা বললেন, ওর বিষয়ে যেসব মিথ্যা বলা হচ্ছে, এ সংবাদ সে শুনে ফেলেছে। এ কথা জেনে বাবার দু'চোখে পানি এলো। তিনি বললেন, কন্যা! তোমাকে আল্লাহ তা'আলার নামে কসম করে বলছি, তুমি তোমার ঘরে ফিরে যাও। আমি ঘরে ফিরে এলাম। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার ঘরে এসে আমার কাজের মেয়েকে আমার বিষয়ে প্রশ্ন করলেন। সে বলল, আল্লাহর কসম! আমি তার মধ্যে কোন দোষ দেখিনি, তবে এতটুকু যে, সে ঘুমিয়ে পড়ত, আর বকরী এসে তার পেষা আটা খেয়ে যেত। তার কিছু সাহাবী মেয়েটিকে ধমক দিয়ে বললেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট সত্য কথা বল। তারা তাকে অনেক দাবালেন এবং ধমকালেন। সে বলল, সুবহানাল্লাহ আল্লাহর কসম! আমি তার ব্যাপারে তা-ই জানি স্বর্ণকার খাটি রঙ্গিন সোনা প্রসঙ্গে যা জানে। যে ব্যক্তিকে এই অপবাদের সাথে জড়ানো হয়েছিল তার কানেও এ খবর পৌছল। সে বলল, সুবহানাল্লাহ আল্লাহর কসম! আমি কখনো কোন নারীর সতর খুলিনি। আয়িশাহ (রাযিঃ) বলেন, সে আল্লাহ তা'আলার রাস্তায় শহীদ হওয়ার সৌভাগ্য অর্জন করে। তিনি বলেন, আমার পিতা-মাতা খুব ভোরে আমার নিকট এলেন। আমার ঘরে এলেন। আমার পিতা-মাতা ডান দিক-বা দিক হতে আমাকে ঘিরে বসেছিলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কালিমা শাহাদাত পাঠ করলেন, আল্লাহ তা'আলার যথোপযুক্ত সম্মান ও গুণগান করলেন, তারপর বলেনঃ হে আয়িশাহ! তুমি যদি কোন মন্দ কাজ করে থাক অথবা নিজের উপর যুলুম করে থাক, তবে আল্লাহ তা'আলার নিকট ক্ষমা চাও। কেননা আল্লাহ তা'আলা তার বান্দাদের তওবা কবুল করেন। আয়িশাহ (রাযিঃ) বলেন, এ সময় আনসার বংশের একটি স্ত্রীলোক আসে। সে দরজার নিকট বসে ছিল। আমি বললাম, আপনি কি এ মহিলাটির সামনে এ কথা বলতে লজ্জাবোধ করছেন না? মোটকথা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ওয়াজ-নাসীহাত করলেন। আমি আমার পিতার দৃষ্টি আকর্ষণ করে বললাম, আপনি তার কথার উত্তর দিন। তিনি বললেন, আমি তাকে কি উত্তর দিব? আমি আমার মায়ের দৃষ্টি আকর্ষণ করে বললাম, আপনি তাকে এর উত্তর দিন। তিনিও বলেন, আমি তাকে কি বলব? তাদের কেউই যখন উত্তর দেননি, তখন আমি কলেমা শাহাদাত তিলাওয়াত করলাম, আল্লাহ তা'আলার যথোপযুক্ত সুনাম ও প্রশংসা করলাম, তারপর বললাম, আল্লাহর কসম! আমি যদি আপনাদের বলি, আমি কখনো তা করিনি এবং আল্লাহ তা'আলা সাক্ষী আছেন, আমি সত্যবাদিনী, তা আপনাদের নিকট আমার কোন উপকারে আসবে না। কেননা আপনারা তা আলোচনা করেছেন এবং তাতে আপনাদের মন রঞ্জিত হয়েছে। আর আমি যদি বলি, আমি করেছি এবং আল্লাহ তা'আলা জানেন আমি তা করিনি, তখন আপনারা বলবেন, সে নিজেই নিজের অপরাধ স্বীকার করেছে। আল্লাহর কসম! আমি আপনাদের এবং আমার জন্য কোন উদাহরণ খুঁজে পাচ্ছি না। আয়িশাহ (রাযিঃ) বলেন, আমি ইয়াকুব (আঃ)-এর নাম স্মরণ করতে চেষ্টা করলাম, কিন্তু পারলাম না। শুধু \"ইউসুফের বাবা” স্মরণে আসছিল। তিনি যখন বলেছিলেনঃ “পূর্ণ ধৈর্যই শ্রেয়, তোমরা যা বলছ সে প্রসঙ্গে আল্লাহ তা'আলা আমার সাহায্য স্থল”- (সূরা ইউসুফ ১৮)। আয়িশাহ্ (রাযিঃ) বলেন, ঠিক সে সময় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর উপর ওয়াহী অবতীর্ণ হতে লাগল। আমরা চুপ থাকলাম। তার উপর হতে ওয়াহীর অবস্থা দূর হলে আমি তার মুখমণ্ডলে আনন্দের ছাপ দেখতে পেলাম। তিনি তার মুখমণ্ডলের ঘাম মুছছেন আর বলছেনঃ হে আয়িশাহ! তোমার জন্য সুসংবাদ। আল্লাহ তা'আলা তোমাকে নির্দোষ ঘোষণা করেছেন। আয়িশাহ (রাযিঃ) বলেন, আমি তখন উত্তেজিত অবস্থায় ছিলাম। আমার পিতা-মাতা আমাকে বললেনঃ উঠে তার নিকট যাও। আমি বললাম, আল্লাহর কসম! আমি তার নিকট উঠে যাব না, তার সুনামও করব না এবং আপনাদের প্রশংসাও করব না। বরং আমি সেই আল্লাহ তা'আলার সুনাম করব যিনি আমার নির্দোষিতার ওয়াহী অবতীর্ণ করেছেন। আপনারা এ অপবাদ শুনেছেন, কিন্তু তা প্রত্যাখ্যানও করেননি বা প্রতিহতও করেননি। ‘আয়িশাহ (রাযিঃ) বলেন, জাহাশ-কন্যা যাইনাবের দীনদারীর জন্য আল্লাহ তা'আলা তাকে হিফাযাত করেছেন। সে ভাল ব্যতীত কখনো অন্য কিছু বলেনি। কিন্তু তার বোন হামনা ক্ষতিগ্রস্তদের সাথে ক্ষতিগ্রস্ত হয়েছে। যারা এ অপবাদ রটায় তাদের মধ্যে ছিলঃ মিসতাহ, হাসসান ইবনু সাবিত ও মুনাফিক সরদার আবদুল্লাহ ইবনু উবাই। সে অপবাদ রটাত এবং তা ছড়িয়ে বেড়াত। সে ও হামনা ছিল এই আপত্তিকর অপবাদ ছড়ানোর বড় হোতা। আয়িশাহ (রাযিঃ) বলেন, আবূ বাকর (রাযিঃ) কসম করেন যে, তিনি আর কখনো মিসতাহর কোনভাবে উপকার করবেন না (ভরণ-পোষণ বহন করবেন না)। এ প্রেক্ষিতে আল্লাহ তা'আলা আয়াত অবতীর্ণ করেনঃ “তোমাদের মধ্যে যারা (আবূ বাকরকে লক্ষ্য করে বলা হচ্ছে) ঐশ্বর্য ও প্রাচুর্যের অধিকারী তারা যেন কসম না করে যে, তারা আত্মীয়, গারীব ও আল্লাহ তা'আলার পথের মুহাজিরদের (মিসতাহকে লক্ষ্য করে বলা হচ্ছে) কিছুই দিবে না.....তোমরা কি চাও না যে, আল্লাহ তা'আলা তোমাদের মাফ করুনঃ আল্লাহ তা'আলা বড়ই ক্ষমাশীল, পরম করুণাময়\"- (সূরা আন-নূর ২২)। আবূ বাকর (রাযিঃ) বলেন, হে আমাদের প্রতিপালক! হ্যাঁ, আমরা অবশ্যই আপনার ক্ষমাপ্রার্থী। তিনি আগের মতো মিসতাহর ভরণ-পোষণের ভার বহন করেন। সহীহঃ বুখারী (৪৭৫৭), মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান, সহীহ হিশাম ইবনু উরওয়াহর রিওয়ায়াত হিসেবে গারীব। ইউনুস ইবনু ইয়াযীদ, মা'মার প্রমুখ-যুহরী হতে, তিনি উরওয়াহ ইবনুয যুবাইর হতে, তিনি সাঈদ ইবনুল মুসাইয়্যাব হতে, তিনি \"আলকামাহ্ ইবনু ওয়াক্কাস আল-লাইসী ও উবাইদুল্লাহ ইবনু আবদুল্লাহ হতে, তিনি আয়িশাহ্ (রাযিঃ) হতে এই সূত্রে উপর্যুক্ত হাদীসের মত বর্ণনা করেছেন। হিশাম ইবনু উরওয়াহর রিওয়ায়াতের তুলনায় এই রিওয়ায়াতটি পূর্ণাঙ্গ ও দীর্ঘতর।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 232
			}
		}
	]
}