{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3218,
			"arabicnumber": 3218,
			"text": "৩২১৮। আনাস ইবনু মালিক (রাযিঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বিয়ে করলেন এবং নিজের ঘরে গেলেন। বর্ণনাকারী বলেন, আমার মা উম্মু সুলাইম (রাযিঃ) হাইস (খেজুর, ঘি ও ছাতু সহযোগে এক প্রকার মিষ্টান্ন) বানালেন। তিনি একটি ছোট পাত্রে তা রেখে বললেন, হে আনাস! এটা নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট যাও। তাকে বল, এটা আমার মা আপনার জন্য পাঠিয়েছেন, আর তিনি আপনাকে সালাম জানিয়েছেন এবং বলেছেন, হে আল্লাহর রাসূল! এটা আমাদের দিক হতে আপনার জন্য একটি নগণ্য উপহার। বর্ণনাকারী বলেন, আমি এই হাইস’ নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট গেলাম এবং বললাম, আমার মা আপনাকে সালাম জানিয়েছেন এবং তিনি বলেছেন, এটা আমাদের দিক হতে আপনার জন্য খুব সামান্য উপহার। তিনি বললেনঃ এটা রাখ। তারপর তিনি বললেনঃ তুমি গিয়ে অমুক, অমুক ও অমুক লোককে এবং পথিমধ্যে যাদের সঙ্গে তোমার কথা হবে তাদেরকেও দা'ওয়াত দিয়ে নিয়ে আস। তিনি কয়েক লোকের নামও বলে দিলেন। আনাস (রাযিঃ) বলেন, তিনি যাদের নাম উল্লেখ করে বলে দিয়েছেন এবং পথিমধ্যে আমার সঙ্গে যাদের দেখা হয়েছে আমি তাদের সবাইকে দাওয়াত করে নিয়ে এলাম। অধঃস্তন বর্ণনাকারী (জা'দ আবূ উসমান) বলেন, আমি আনাস (রাযিঃ)-কে প্রশ্ন করলাম, তাদের মোট সংখ্যা কত ছিল? তিনি বললেন, প্রায় তিন শত। আনাস (রাযিঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বললেনঃ হে আনাস! ছোট পাত্রটি নিয়ে এসো। আনাস (রাযিঃ) বলেন, দাওয়াতকৃত ব্যক্তিরা এলে তাদের ভীড়ে চত্বর ও হুজরাহ ভরে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ দশ দশজন করে গোলাকারে বসে যাও এবং প্রতিটি লোক যেন নিজের নিকটের দিকে থেকে খায়। বর্ণনাকারী বলেন, লোকেরা পরিতৃপ্তি সহকারে খেল। একদল খেয়ে চলে গেলে অপর দল খেতে বসত। এভাবে সবাই আহার করল। বর্ণনাকারী বলেন, তিনি আমাকে বললেনঃ হে আনাস! পাত্রটি তুলে নিয়ে যাও। আনাস (রাযিঃ) বলেন, আমি তা উঠিয়ে নিলাম, কিন্তু বলতে পারব না, যখন আমি হাইসের পাত্র রেখে ছিলাম তখন কি তাতে অনেক হাইস ছিল না যখন তুলে নিলাম তখন বেশী ছিল! আনাস (রাযিঃ) বলেন, দাওয়াতকৃতদের গল্পে রত কিছু লোক রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর ঘরে বসে আলাপে রত রইল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাদের বিদায় হওয়ার অপেক্ষায় বসে রইলেন। তার স্ত্রী দেয়ালের দিকে মুখ করে বসে রইলেন। তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর জন্য একটি বিরক্তিকর বোঝা হল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উঠে গিয়ে তার স্ত্রীদের সালাম করলেন, তারপর আবার ফিরে এলেন। তারা যখন দেখল যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ফিরে আসছেন, তখন তারা অনুভব করল যে, তারা তার জন্য বিরক্তির বিষয় হয়ে পড়েছে। অতএব তারা সকলে উঠে দরজা দিয়ে বের হয়ে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসে পর্দা ছেড়ে দিয়ে হুজরায় প্রবেশ করলেন। আমি হুজরার মধ্যে (পর্দার এ পাশে) বসে থাকলাম। কিছু সময় পর তিনি বের হয়ে আমার নিকট এলেন। তখন নিম্নের আয়াতগুলো অবতীর্ণ হয়। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বাইরে বের হয়ে গিয়ে লোকদের সামনে তা পড়লেনঃ (অনুবাদ) “হে ঈমানদারগণ! তোমরা বিনা অনুমতিতে নবীর ঘরের মধ্যে প্রবেশ করো না এবং আহারের জন্য এসে অপেক্ষায় বসে থেকো না। যদি তোমাদের আহারের জন্য দাওয়াত দেয়া হয় তবে অবশ্যই আসবে, কিন্তু খাওয়া-দাওয়া শেষ করার সাথে সাথে সরে পড়বে এবং কথাবার্তায় মাশগুল হবে না। তোমাদের এ ধরনের আচরণ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে দুঃখ দেয় কিন্তু সে লজ্জায় কিছুই বলে না। আর আল্লাহ তা'আলা সত্য কথা বলতে লজ্জা বোধ করেন না। নবীর স্ত্রীদের নিকট তোমাদের কিছু চাওয়ার প্রয়োজন হলে পর্দার আড়াল হতেই তাদের নিকট তা চাও। তোমাদের এবং তাদের অন্তরের পবিত্রতা রক্ষার জন্য এটাই ভাল কাজ। আল্লাহ তা'আলার রাসূলকে কষ্ট দেয়া এবং তার ইন্‌তিকালের পর তার স্ত্রীদের বিয়ে করা তোমাদের জন্য কখনো জায়িয নয়। এটা আল্লাহ তা'আলার নিকট অতি বড় গুনাহ।” (সূরা আহযাব ৫৩) জা'দ (রহঃ) বলেন, আনাস (রাযিঃ) বলেছেন, আমিই সকলের আগে এ আয়াত প্রসঙ্গে অবগত হই এবং সেদিন হতেই রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর স্ত্রীগণ পর্দা করেন। সহীহঃ বুখারী, মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। জা'দ হলেন উসমানের পুত্র। তাকে দীনারের ছেলেও বলা হয়। তার উপনাম আবূ উসমান আল-বসরী। হাদীস বিশারদদের মতে তিনি সিকাহ বর্ণনাকারী। ইউনুস ইবনু উবাইদ, শুবাহ ও হাম্মাদ ইবনু যাইদ (রাহঃ) তার সনদে হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 270
			}
		}
	]
}