{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3221,
			"arabicnumber": 3221,
			"text": "৩২২১। আবূ হুরাইরাহ (রাযিঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেনঃ মূসা (আঃ) খুবই লজ্জাশীল লোক ছিলেন। তিনি নিজের শরীর ভালভাবেই ঢেকে রাখতেন। লজ্জার কারণে তার গায়ের কোন অংশই প্রকাশ পেত না। বনী ইসরাঈলের মন্দ প্রকৃতির কয়েক লোক তাকে বিভিন্নভাবে দুঃখ দিত। এরা বলত, তার এভাবে দেহ ঢেকে রাখার কারণ তার গায়ের কোন সমস্যা আছে অথবা তার গায়ে ধবল রোগ আছে অথবা তার অণ্ডকোষ খুব বড় অথবা অন্য কোন সমস্যা আছে। আল্লাহ তা'আলা তাদের এসব অপবাদ হতে তাকে মুক্ত করার ইচ্ছা করলেন। মূসা (আঃ) এক দিন একাকী নিজের পোশাক খুলে তা একটি পাথরের উপর রেখে গোসল করতে নামলেন। গোসল শেষে তিনি কাপড় নেয়ার জন্য উঠে এলে পাথরটি তার কাপড়সহ দৌড়াতে থাকে। মূসা (আঃ) নিজের লাঠি তুলে নিয়ে পাথরের পিছে পিছে ছোটেন এবং বলতে থাকেনঃ হে পাথর! আমার কাপড় (ফিরিয়ে দাও), হে পাথর! আমার কাপড় (ফিরিয়ে দাও)। এই বলে পাথরের পিছু ধাওয়া করতে করতে তিনি বনী ইসরাঈলের একটি দলের নিকট পৌছে গেলেন। তারা তাকে বস্ত্রহীন অবস্থায় দেখতে পেল। তারা তার সমস্ত অঙ্গ-প্রত্যঙ্গ সুষ্ঠ সুন্দর দেখল। আল্লাহ তাকে তাদের অপবাদ হতে সম্পূর্ণ মুক্ত করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ পাথর থেমে গেল এবং তিনি তার বস্ত্র নিয়ে পরিধান করলেন। তিনি নিজের লাঠি দিয়ে পাথরটিকে আঘাত করতে লাগলেন। আল্লাহর কসম! পাথরের উপর তার লাঠির আঘাতের তিন, চার অথবা পাঁচটি দাগ পড়ে গেল। এ প্রসঙ্গেই আল্লাহ তা'আলা ফরমানঃ “হে ঈমানদারগণ যেসব ব্যক্তি মূসাকে দুঃখ দিয়েছিল তোমরা তাদের মত হয়ো না। আল্লাহ তা'আলা তাদের বানানো কথাবার্তা হতে তার নির্দোষিতা প্রমাণ করেছেন। তিনি আল্লাহ তা'আলার নিকট সম্মানের পাত্র ছিলেন\"- (সূরা আহযাব ৬৯)। সহীহঃ বুখারী ও মুসলিম আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ হাদীসটি আবূ হুরাইরাহ (রাযিঃ)-এর বরাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে একাধিক সূত্রে বর্ণিত হয়েছে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 273
			}
		}
	]
}