{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3224,
			"arabicnumber": 3224,
			"text": "৩২২৪। ইবনু আব্বাস (রাযিঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার এক দল সাহাবীর সঙ্গে বসা ছিলেন। এমন সময একটি উল্কা পতিত হল এবং আলোকিত হয়ে গেল। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ এরূপ উল্কাপাত হতে দেখলে তোমরা জাহিলী যুগে কি বলতে? তারা বলল, আমরা বলতাম, কোন মহান লোকের মৃত্যু হবে অথবা কোন মহান লোকের জন্ম হবে (এটা তারই আলামাত)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কোন লোকের মৃত্যু অথবা জন্মগ্রহণের আলামাত হিসেবে এটা পতিত হয় না, বরং মহা বারাকাতময় ও মহিমান্বিত নামের অধিকারী আমাদের প্রতিপালক যখন কোন আদেশ জারী করেন তখন আরশ বহনকারী ফেরেশতারা তার পবিত্রতা ও মহিমা ঘোষণা করেন। তারপর তাদের নিকটতম আসমানের অধিবাসীরা তাসবীহ পড়তে থাকে। এভাবে তাসবীহ ও মহিমা ঘোষণার ধারা এই নিম্নবর্তী আসমানে এসে পৌছে যায়। তারপর ষষ্ঠ আসমানের অধিবাসীরা সপ্তম আসমানের অধিবাসীদের প্রশ্ন করেন, তোমাদের প্রতিপালক কি বলেছেন? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তারা তাদেরকে ব্যাপারটি জানান। এভাবে প্রত্যেক আসমানের অধিবাসীরা তাদের উপরের আসমানের অধিবাসীদের একইভাবে প্রশ্ন করেন। এভাবে পৃথিবীর নিকটবর্তী আসমানে এ খবর পৌছে যায়। শাইতানেরা এ তথ্য শুনবার জন্য ওঁৎ পেতে থাকে। তখন এদের উপর উল্কা ছুড়ে মারা হয়। এরা কিছু তথ্য এদের সহগামীদের নিকট পাচার করে। এরা যা সংগ্রহ করে তা তো সত্য, কিন্তু তারা এতে কিছু পরিবর্তন ও কিছু বৃদ্ধি ঘটায়। সহীহঃ মুসলিম (৭/৩৬-৩৭) আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। ইমাম যুহরী (রহঃ) এ হাদীস আলী ইবনু হুসাইনের সূত্রে ইবনু আব্বাস হতে তিনি একদল আনসার সাহাবীর সনদে বর্ণনা করেছেন। তারা বলেছেন, আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট উপস্থিত ছিলাম.... হাদীসের শেষ অবধি। এটি আমাদের নিকট বর্ণনা করেছেন আল-হুসাইন ইবনু হুরাইস-ওয়ালীদ ইবনু মুসলিম হতে, তিনি আওযাঈ হতে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 276
			}
		}
	]
}