{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3256,
			"arabicnumber": 3256,
			"text": "৩২৫৬। আবদুল্লাহ ইবনু সালাম (রাঃ)-এর ভাতিজা বলেনঃ লোকেরা যখন উসমান (রাঃ)-কে (খুনের) ইচ্ছা করল তখন আবদুল্লাহ ইবনু সালাম (রাঃ) তার নিকটে আসলেন। উসমান (রাঃ) বললেন, আপনি কেন এসেছেন? তিনি বললেন, আপনার সাহায্যের জন্য। তিনি বলেন, আপনি ঘেরাওকারীদের নিকটে গিয়ে তাদেরকে আমার থেকে দূরে সরিয়ে দিন এবং আপনার ভেতরে থাকার চাইতে বাইরে থাকা আমার জন্য বেশি উপকারী। রাবী বলেন, তারপর আবদুল্লাহ ইবনু সালাম (রাঃ) লোকদের নিকটে এসে বললেন, হে জনমণ্ডলী জাহিলিয়া যুগে আমার অমুক নাম (হুসাইন) ছিল। তারপর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নাম রাখেন আবদুল্লাহ। আর আমার সম্পর্কে আল্লাহ তা'আলার কিভাবে কয়েকটি আয়াত অবতীর্ণ হয়। তার মধ্যে আমার সম্পর্কে এ আয়াত অবতীর্ণ হয়ঃ আর বানু ইসরাঈলের একজন এর মতই কিতাব প্রসঙ্গে সাক্ষ্য দিয়েছে এবং এর প্রতি ঈমান এনেছে। অথচ তোমরা অহংকার প্রকাশ কর। আল্লাহ তা'আলা যালিমদেরকে হিদায়াত করেন না\" (সূরাঃ আল-আহুকাফ- ১০)। তিনি আরো বলেন, আমার সম্পর্কে এ আয়াতও অবতীর্ণ হয়েছেঃ “আমার ও তোমাদের মাঝে সাক্ষী হিসেবে আল্লাহ তা'আলাই যথেষ্ট এবং সেই ব্যক্তি যার নিকটে কিতাবের জ্ঞান আছে\" (সূরাঃ আর-রা’দ- ৪৩)। আল্লাহ্ তা'আলার একটি তরবারি আছে যা তোমাদের হতে গোপন আছে। আর এ শহরেই ফিরিশতারা তোমাদের প্রতিবেশী যেখানে তোমাদের রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এসেছেন। অতএব এ লোকটিকে হত্যা সংঘটনে তোমরা আল্লাহ তা'আলাকে ভয় কর। আল্লাহ্ তা'আলার শপথ! তোমরা তাকে মেরে ফেললে তোমাদের প্রতিবেশী ফিরিশতারা এখান হতে দূরে চলে যাবে এবং আল্লাহ্ তা'আলার যে তরবারি তোমাদের হতে লুকায়িত আছে তা তোমাদের উপর আঘাত হানবে, তারপর কিয়ামত পর্যন্ত আর কোষবদ্ধ হবে না। রাবী বলেনঃ তার এ কথা শুনে ঘেরাওকারীদের একজন বলল, এই ইয়াহুদীকেও (আবদুল্লাহ ইবনু সালাম) মেরে ফেল এবং উসমানকেও মেরে ফেল। সনদ দুর্বল আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। শুআইব ইবনু সফওয়ান-আবদুল মালিক ইবনু উমাইর হতে তিনি, ইবনু মুহাম্মাদ ইবনু আবদুল্লাহ ইবনু সালাম হতে তিনি নিজ দাদা আবদুল্লাহ ইবনু সালাম (রাঃ) সূত্রেও এ হাদীস বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 308
			}
		}
	]
}