{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3278,
			"arabicnumber": 3278,
			"text": "৩২৭৮। আশ-শাবী (রহঃ) হতে বর্ণিত আছে, তিনি বলেনঃ ইবনু আব্বাস (রাঃ) আরাফাতের মায়দানে কা'ব (রাঃ)-এর সাথে দেখা করে একটি কথা (আল্লাহ তা'আলার দেখা প্রসঙ্গে) জিজ্ঞেস করেন। এতে তিনি এত উচ্চ স্বরে তাকবীর ধ্বনি দিলেন যে, পাহাড় পর্যন্ত উচ্চ গম্ভীর আওয়াজ করে উঠল (প্রতিশব্দ ভেসে এলো)। ইবনু আব্বাস (রাঃ) বলেনঃ আমরা হাশিম গোত্রীয়। কাব (রাঃ) বলেনঃ আল্লাহ তা'আলা তার দীদার (দর্শন) ও কালাম (সরাসরি সংলাপ) মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও মূসা আলাইহিস সালামের মাঝে বাটোয়ারা করেছেন। সুতরাং মূসা আলাইহিস সালাম আল্লাহ তা'আলার সাথে দু’বার কথা বলেছেন এবং মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দু’বার তার দেখা পেয়েছেন। মাসরূক (রহঃ) বলেনঃ এ কথা শুনে আমি আইশা (রাঃ)-এর নিকটে গিয়ে তাকে প্রশ্ন করলাম, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি আল্লাহ তা'আলাকে দেখেছেন? তিনি বললেনঃ তুমি এমন একটি বিষয়ে কথা বললে যার ফলে আমার শরীরের লোম পর্যন্ত খাড়া হয়ে গেছে। আমি বললাম, একটু অপেক্ষা করুন। তারপর আমি এ আয়াত তিলাওয়াত করলামঃ “তিনি তো স্বীয় রবের মহান নিদর্শনসমূহ দৰ্শন করেছেন। (সূরাঃ আন-নাজম- ১৮)। তিনি বললেনঃ তোমার বুদ্ধি তোমাকে কোথায় নিয়ে গেছে। তিনি হলেন জিবরীল (যাকে তিনি দেখেছেন)। যে ব্যক্তি তোমাকে বলেছে যে, মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার রবকে দেখেছেন বা এমন কোন বিষয় তিনি লুকায়িত করেছেন যার (প্রচারের) হুকুম তাকে দেয়া হয়েছে অথবা সেই পাঁচটি বিষয়ে তার জ্ঞান আছে, যে প্রসঙ্গে আল্লাহ তা'আলা বলেনঃ “কিয়ামতের জ্ঞান শুধু আল্লাহ তা'আলার নিকট আছে, তিনিই বৃষ্টি বর্ষণ করেন.... ” (সূরাঃ লুকমান- ৩৪), তাহলে সে একটি সাংঘাতিক অসত্য রটনা করেছে। বরং তিনি জিবরীল (আঃ)-কে তার আসল চেহারায় দু’বার দেখেছেনঃ একবার সিদরাতুল মুন্তাহার সামনে, আর একবার জিয়াদ নামক জায়গায় (মক্কার একটি জায়গা)। তার ছয় শত ডানা আকাশের দিগন্ত ঢেকে ফেলেছিল। সনদ দুর্বল, হাদীসটি কা'ব ইবনু আব্বাসের ঘটনা ব্যতীত নাসাঈ সংক্ষিপ্তভাবে বর্ণনা করেছেন। আবূ ঈসা বলেন, দাউদ ইবনু আবূ হিন্দ (রহঃ) শাবী হতে তিনি মাসরুক হতে তিনি আইশা (রাঃ) হতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রে উপরোক্ত হাদীসের মতই বর্ণনা করেছেন। দাউদের রিওয়ায়াত মুজালিদের রিওয়ায়াতের তুলনায় সংক্ষিপ্ততর।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 330
			}
		}
	]
}