{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3305,
			"arabicnumber": 3305,
			"text": "৩৩০৫। উবাইদুল্লাহ ইবনু আবূ রাফি (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি আবূ তলিব-এর পুত্র ‘আলী (রাযিঃ)-কে বলতে শুনেছি, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে অর্থাৎ আমাকে, যুবাইরকে ও মিক্‌দাদ ইবনুল আসওয়াদকে (চিঠি উদ্ধারের জন্য) পাঠিয়ে বললেনঃ তোমরা রাওনা হয়ে রাওযা খাখ’ নামক জায়গায় পৌছে যাও, সেখানে (মক্কার লক্ষ্যে) গমনরত এক নারীকে পাওয়া যাবে। তার নিকট একটি পত্র আছে। তোমরা তার নিকট হতে সেই পত্র উদ্ধার করে তা সরাসরি আমার নিকট নিয়ে আসবে। অতঃপর আমরা রাওনা হয়ে গেলাম। আমাদেরকে নিয়ে আমাদের ঘোড়া অতীব দ্রুত গতিতে এগিয়ে গেল এবং আমরা সেই রাওযা খাখ’ নামক জায়গায় গিয়ে পৌছলাম। আমরা সেই নারীকে সেখানে পেয়ে গেলাম। আমরা তাকে বললাম, পত্রটি বের করে দাও। সে বলল, আমার সঙ্গে কোন পত্র নেই। আমরা বললাম, অবশ্যই তুমি পত্রটি বের করে দাও, তা না হলে তোমার পরিধেয় পোশাক ত্যাগ কর। আলী (রাযিঃ) বলেন, সে তার চুলের খোপা হতে অবশেষে পত্রটি বের করে দিল এবং তা নিয়ে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আমরা হাযির হলাম। দেখা গেল যে, এটি মক্কার কিছু সংখ্যক মুশরিকের লক্ষ্যে লিখিত হাতিব ইবনু আবী বালতা'আর পত্র। তিনি এই পত্রের মাধ্যমে তাদেরকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর কিছু পদক্ষেপ প্রসঙ্গে জানিয়েছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ হে হাতিব! এ কি? হাতিব (রাযিঃ) বললেন, হে আল্লাহর রাসূল! আমার সম্পর্কে তাড়াতাড়ি করে কোন পদক্ষেপ নিবেন না। আমি কুরাইশদের সঙ্গে বসবাস করতাম, কিন্তু আমি তাদের সম্প্রদায়ের লোক নই। যে সকল মুহাজির আপনার সঙ্গে রয়েছেন মক্কায় পরিবার-পরিজন ও ধন-সম্পদের রক্ষণাবেক্ষণ করতে পারে। আমি চিন্তা করলাম, মক্কায় আমার কোন আত্মীয়-স্বজন নেই। যদি আমি তাদের প্রতি কোন রকম উপকার করতে পারি তবে তার বিনিময়ে তারা আমার আত্মীয়-স্বজনকে সাহায্য-সহযোগিতা করবে। আমি কাফির হয়ে কিংবা আমার ধর্ম ছেড়ে দিয়ে বা কুফরীর প্রতি খুশী হয়ে এ কাজ করিনি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে সত্য কথা বলেছে। উমার ইবনুল খাত্তাব (রাযিঃ) বললেন, হে আল্লাহর রাসূল! আমাকে অনুমতি দিন, আমি এ মুনাফিকের ঘাড় উড়িয়ে দেই। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ সে বদরের যুদ্ধে অংশগ্রহণ করেছে। তুমি কি জান! নিশ্চয়ই আল্লাহ তা'আলা বদরের মুজাহিদদের প্রতি উকি মেরেছেন এবং বলেছেনঃ “তোমরা যা চাও কর, আমি তোমাদেরকে মাফ করে দিয়েছি”। আলী (রাযিঃ) বলেন, উক্ত বিষয়েই এই সূরা অবতীর্ণ হয়েছেঃ “হে মু’মিনগণ! তোমরা আমার শত্রু ও তোমাদের শত্রুকে বন্ধুর মতো করে গ্রহণ করো না। তোমরা তাদের নিকট বন্ধুত্বের বার্তা পাঠাও; অথচ তারা তোমাদের নিকট যে সত্য এসেছে তা স্বীকার করেনি....”। আমর (রহঃ) বলেন, আমি উবাইদুল্লাহ ইবনু আবী রাফি'কে দেখেছি। তিনি আলী (রাযিঃ)-এর সচিব ছিলেন। সহীহঃ সহীহ আবূ দাউদ (হাঃ ২৩৮১), বুখারী ও মুসলিম। আবূ ঈসা বলেন, এ হাদীসটি হাসান সহীহ। এ অনুচ্ছেদে উমার ও জাবির ইবনু আবদুল্লাহ (রাযিঃ) হতেও হাদীস বর্ণিত আছে। সুফইয়ান ইবনু উয়াইনাহ হতেও একাধিক বর্ণনাকারী একই অর্থে হাদীসটি রিওয়ায়াত করেছেন। তাতে এ কথা রয়েছেঃ “তোমাকে পত্র বের করে দিতে হবে, তা না হলে তোমার বস্ত্র ত্যাগ করতে হবে\"। এ হাদীসটি 'আবদুর রাহমান আস-সুলামীর সূত্রে ‘আলী (রাযিঃ) হতে একই রকম বর্ণিত হয়েছে। কেউ কেউ এ কথাগুলো উল্লেখ করেছেনঃ “তোমাকে অবশ্যই পত্রটি বের করে দিতে হবে, নতুবা তোমাকে আমরা উলঙ্গ করব।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 357
			}
		}
	]
}