{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3313,
			"arabicnumber": 3313,
			"text": "৩৩১৩। যাইদ ইবনু আরকাম (রাযিঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে যুদ্ধে গেলাম। কিছু সংখ্যক বেদুঈনও আমাদের সঙ্গে ছিল। আমরা পানির উৎসের দিকে যাচ্ছিলাম। কিন্তু আমাদের পূর্বেই বেদুঈনরা পানির উৎসে গিয়ে পৌছায়। এক বেদুঈন তার সঙ্গীদের পূর্বে পৌছে। সে হাউয (চৌবাচ্চা) সম্পূর্ণ করে তার চতুর্দিকে পাথর রেখে দিত এবং তার উপর চামড়া বিছিয়ে দিয়ে তা ঢেকে দিত, যাতে তার সাথী এসে যায় (এবং অন্যরা পানি নিতে না পারে)। উক্ত বেদুঈনের কাছে এসে এক আনসারী লোক তার উটকে পানি পান করানোর জন্য এর লাগাম (নাসারন্দ্রের দড়ি) হালকা করে ছেড়ে দিল, কিন্তু বেদুঈন তার উটকে পানি পান করতে বাধা দেয়। এতে আনসারী ব্যক্তি (ক্রুদ্ধ হয়ে) পানির উৎসগুলো সরিয়ে ফেলে। সে সময় একটি কাষ্ঠ খণ্ড তুলে নিয়ে বেদুঈন আনসারীর মাথায় জোরে আঘাত করে এবং এর ফলে তার মাথা ফেটে যায়। উক্ত আনসারী মুনাফিক্ সরদার আবদুল্লাহ ইবনু উবাইর নিকট গিয়ে তাকে ঘটনা সম্পর্কে জানায়। আনসারী তার দলেরই লোক ছিল। ‘আবদুল্লাহ ইবনু উবাই ক্ষিপ্ত হয়ে বলে, যে বেদুঈনরা আল্লাহ তা'আলার রাসূলের সঙ্গে রয়েছে তাদেরকে সহায়তাদান বন্ধ করে দাও। তবেই তার চারপাশ হতে তারা আলাদা হয়ে যাবে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর আহার করার সময় তার নিকট বেদুঈনরা হাজির হত (এবং তার সঙ্গে আহার করত)। তাই আবদুল্লাহ বলল, যে সময় বেদুঈনরা মুহাম্মাদের নিকট হতে অন্যত্র চলে যাবে তার নিকট তখন খাবার উপস্থিত করবে; যাতে তিনি ও তার নিকট উপস্থিত (অন্যরা) তা আহার করেন। তারপর আবদুল্লাহ তার সাথীদেরকে আরো বলল, আমরা যদি মদীনায় ফিরে যেতে পারি তবে সম্মানিতরা তোমাদের মাঝের হীনদেরকে তাড়িয়ে দিবে। যাইদ ইবনু আরকাম (রাযিঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর পিছনে একই সওয়ারীতে ছিলাম। আবদুল্লাহর কথা আমি শুনে ফেললাম এবং আমার চাচাকে জানালাম। তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে গিয়ে তা অবহিত করলেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে (আবদুল্লাহ ইবনু উবাই-কে) ডেকে পাঠান। সে শপথ করে এবং অস্বীকার করে। বর্ণনাকারী বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বিশ্বাস করলেন এবং আমাকে অবিশ্বাস করলেন। বর্ণনাকারী বলেন, আমার চাচা আমার নিকট এসে বললেন, এটাই তো তুমি চেয়েছিলে যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমার প্রতি অসন্তুষ্ট হোন এবং তিনি ও মুসলিমগণ তোমাকে মিথ্যুক বলে আখ্যায়িত করুন। বর্ণনাকারী বলেন, আমি এতটাই ভারাক্রান্ত হলাম যতটা কখনো কেউ হয়নি। তিনি আরো বলেন, তারপর আমি ভারাক্রান্ত হয়ে মাথা নত করে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গেই সফর অব্যাহত রাখলাম। এ পরিস্থিতিতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমার নিকট এসে আমার কান মললেন এবং আমার সম্মুখে হেসে দিলেন। যদি আমি চিরস্থায়ী জীবন (বা জান্নাত) লাভ করতাম তবুও এতটা খুশী হতাম না। তারপর আবূ বাকর (রাযিঃ) এসে আমার সঙ্গে দেখা করে প্রশ্ন করলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তোমাকে কি বলেছেন? আমি বললাম, আমাকে তিনি কিছুই বলেননি; তিনি কেবল আমার কান মলেছেন এবং আমার দিকে তাকিয়ে হেসেছেন। আবূ বাকর (রাযিঃ) বললেন, তোমার জন্য সুখবর। অতঃপর আমার সঙ্গে উমার (রাযিঃ) এসে দেখা করেন। যে কথা আমি আবূ বাকর (রাযিঃ)-কে বলেছিলাম তাকেও তাই বললাম। অতঃপর আমরা ভোরে উপনিত হলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূরা আল-মুনাফিকূন পাঠ করলেন। হাদীসটির সানাদ সহীহ। আবূ ঈসা বলেন, এটি হাসান সহীহ হাদীস।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 365
			}
		}
	]
}