{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3430,
			"arabicnumber": 3430,
			"text": "৩৪৩০। আবূ সাঈদ ও আবূ হুরাইরাহ (রাযিঃ) হতে বর্ণিত আছে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন লোক “লা-ইলা-হা ইল্লাল্লাহু ওয়াল্লাহু আকবার” বললে সে সময় তার প্রভু তার কথাটি সত্য বলে অনুমোদন দেন এবং বলেনঃ আমি ছাড়া কোন ইলাহ নেই, আমিই মহান। আর যখন বান্দা বলে, “লা-ইলা-হা ইল্লাল্লাহু ওয়াহদাহু” (আল্লাহ তা'আলা ব্যতীত কোন মা’বুদ নেই, তিনি এক), তখন বলেনঃ আমি ব্যতীত কোন ইলাহ নেই এবং আমি এক। যখন বান্দা বলে, “লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকা লাহু” (আল্লাহ তা'আলা ছাড়া কোন মা'বূদ নেই, তিনি এক, তার কোন অংশীদার নেই), তখন আল্লাহ তা'আলা বলেনঃ আমি ব্যতীত কোন মা'বূদ নেই, আমি এক, আমার কোন অংশীদার নেই। যখন বান্দা বলে, “লা-ইলা-হা ইল্লাল্লাহু লাহুল মুলকু ওয়ালাহুল হামদু” (আল্লাহ তা'আলা ছাড়া কোন মা’বুদ নেই, তারই রাজত্ব, সমস্ত প্রশংসাও তার), তখন আল্লাহ তা'আলা বলেনঃ আমি ব্যতীত কোন মা'বূদ নেই, রাজত্ব আমারই এবং সকল প্রশংসা আমার জন্যই। যখন বান্দা বলে, “লা-ইলা-হা ইল্লাল্লাহু ওয়ালা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ্” (আল্লাহ তা'আলা ছাড়া কোন মা'বূদ নেই। আল্লাহ তা'আলা ব্যতীত কোন অনিষ্ট বা উপকার করার ক্ষমতা কারো নেই), তক্ষনি আল্লাহ তা'আলা বলেনঃ আমি ব্যতীত কোন মা'বূদ নেই, আমি ছাড়া (আমার সহযোগিতা ব্যতীত) অকল্যাণ দূর করা ও মঙ্গল লাভ করার সামর্থ্য কারো নেই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আরো বলতেনঃ যে লোক রোগাক্রান্ত অবস্থায় এই বাক্যগুলো পাঠ করল, তারপর মৃত্যুবরণ করল, জাহান্নামের আগুন তাকে ভক্ষণ করবে না। সহীহঃ ইবনু মাজাহ (হাঃ ৩৭৯৪)। আবূ ঈসা বলেন, হাদীসটি হাসান গারীব। এ হাদীসটি শুবাহ (রহঃ) আবূ ইসহাক হতে, তিনি আল-আগারর আবূ মুসলিম হতে, তিনি আবূ হুরাইরাহ (রাযিঃ) ও আবূ সাঈদ (রাযিঃ) হতে এই সনদে উক্ত হাদীসের মতই রিওয়ায়াত করেছেন। তবে হাদীসটি শুবাহ (রাহঃ) মারফুরূপে রিওয়ায়াত করেননি। মুহাম্মাদ ইবনু বাশশার-মুহাম্মাদ ইবনু জাফার হতে, তিনি শুবাহ (রহঃ) হতে উক্ত সূত্রের মতই বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 61
			}
		}
	]
}