{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3535,
			"arabicnumber": 3535,
			"text": "৩৫৩৫। যির ইবনু হুবাইশ (রাহঃ) হতে বর্ণিত আছে। তিনি বলেন, মোজাদ্বয়ের উপর মসিহ করা প্রসঙ্গে প্রশ্ন করার উদ্দেশে আমি সাফওয়ান ইবনু আসসাল আল-মুরাদী (রাযিঃ)-এর কাছে আগমন করলাম। তিনি বললেন, হে যির! তোমাকে কিসে নিয়ে এসেছে? আমি বললাম, জ্ঞানের অন্বেষা! তিনি বললেন, নিশ্চয় আল্লাহ তা'আলার ফেরেশতাগণ জ্ঞানের অন্বেষায় খুশি হয়ে জ্ঞান অন্বেষণকারীর জন্য তাদের পাখা বিছিয়ে দেন। আমি বললাম, আমার মনে একটা দ্বিধাদ্বন্ধ সৃষ্টি হয়েছে মলমূত্র ত্যাগের পর মোজার উপর মাসেহ করা প্রসঙ্গে। আর আপনি হলেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর একজন সাহাবী। তাই আপনাকে আমি প্রশ্ন করতে এসেছি যে, এ প্রসঙ্গে আপনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে কিছু আলোচনা করতে শুনেছেন কি? তিনি বললেন, হ্যাঁ। আমাদেরকে তিনি নির্দেশ দিতেন যে, আমরা সফররত অবস্থায় থাকলে এবং নাপাকির গোসলের প্রয়োজন না হলে তিন দিন ও তিন রাত পর্যন্ত যেন আমাদের মোজাদ্বয় না খুলি। মলমূত্র ত্যাগ এবং ঘুমানোর কারণে তা খোলার দরকার নেই, বরং শুধু তার উপর মাসেহ করলেই চলবে। যির (রাহঃ) বলেন, আমি বললাম, মহব্বত (ভালবাসা) প্রসঙ্গে আপনি কি তাকে কিছু আলোচনা করতে শুনেছেন? তিনি বললেন, হ্যাঁ। এক সফরে আমরা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে ছিলাম। একদিন আমরা তার নিকটেই ছিলাম, এমন সময় এক বেদুঈন উচ্চস্বরে তাকে ডাক দিয়ে বলে, হে মুহাম্মাদ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তার ন্যায় একই রকম উচ্চ শব্দে তার ডাকে জবাব দিলেনঃ আস। সেই বেদুঈনকে আমরা বললাম, তোমার অমঙ্গল হোক, তোমার কণ্ঠস্বর নীচু কর। কেননা তুমি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সম্মুখে আছ। নবীর সম্মুখে তোমাকে উচ্চস্বরে কথা বলতে বারণ করা হয়েছে (কুরআনে)। লোকটি বলল, আল্লাহর শপথ! আমি নীচু স্বরে কথা বলতে পারি না। এবার সে বলল, এক লোক এক গোত্রকে ভালবাসে, কিন্তু তাদের সঙ্গে সে মিলিত হতে পারেনি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ কোন লোক যাকে ভালবাসে কিয়ামতের দিন সে তার সঙ্গেই থাকবে। তারপর তিনি আমাদের সঙ্গে কথাবার্তা বলতে থাকলেন। অবশেষে তিনি পাশ্চাত্যে অবস্থিত একটি দরজার কথা উল্লেখ করলেন যা এত দীর্ঘ যে, একটি সওয়ারীর সেই দরজার এক প্রান্ত হতে অন্য প্রান্ত পর্যন্ত পার করতে চল্লিশ কিংবা সত্তর বছর সময় লাগবে। সুফইয়ান (রাহঃ) বলেন, পাশ্চাত্যের সেই দরজা সিরিয়ার দিকে অবস্থিত। যে দিন আল্লাহ তা'আলা আকাশসমূহ ও যামীন সৃষ্টি করেছেন সেদিন ঐ দরজাও সৃষ্টি করেছেন। তা তাওবার জন্য খোলা রয়েছে। পশ্চিম দিক হতে সূর্য উদিত না হওয়া পর্যন্ত তা রুদ্ধ করা হবে না। হাসানঃ তা’লীকুর রাগীব (৪/৭৩), ৯৬ নং হাদীসে এর অংশ বিশেষ বর্ণিত হয়েছে। আবূ ঈসা বলেন, হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 166
			}
		}
	]
}