{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3570,
			"arabicnumber": 3570,
			"text": "৩৫৭০। ইবনু আব্বাস (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, কোন এক সময় আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট ছিলাম। তখন আলী ইবনু আবূ তালিব (রাঃ) এসে বলেন, আমার পিতা-মাতা আপনার জন্য কুরবান হোক! এই কুরআন আমার হৃদয় হতে বেরিয়ে যায় (মুখস্ত থাকে না)। আমি তা নিজের মধ্যে ধরে রাখতে সক্ষম নই। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেনঃ হে আবূল হাসান! আমি কি তোমাকে এমন কথা শিখাব না যার দ্বারা আল্লাহ তা'আলা তোমাকে উপকৃত করবেন, তুমি যাকে তা শিখাবে তাকেও উপকৃত করবেন এবং যা তুমি শিখবে তাও তোমার হৃদয়ের মধ্যে গেথে থাকবে? তিনি বলেন, হ্যাঁ, হে আল্লাহর রাসূল! তা আমাকে শিখিয়ে দিন। তিনি বলেনঃ জুমু'আর রাত আসার পর তোমার পক্ষে সম্ভব হলে রাতের শেষ তৃতীয়াংশে (নামাযে) দাড়িয়ে যাও।এ সময় আল্লাহ্ তা'আলার ফিরিশতা হাযির হয় এবং তখন দু’আ কুবুল হয়। আমার ভাই ইয়াকুব (আঃ) তার সন্তানদের বলেছিলেনঃ আমি তোমাদের জন্য আমার রবের নিকটে ক্ষমা প্রার্থনা করব। পরিশেষে তিনি জুমুআর রাতেই তাদের জন্য ক্ষমা প্রার্থনা করেন। যদি তুমি (তখন নামায আদায় করতে) সক্ষম না হও তাহলে মধ্য রাতে দাঁড়াও এবং তখনও সম্ভব না হলে রাতের প্রথম তৃতীয়াংশে দাড়াও এবং চার রাকাআত (নফল) নামায আদায় কর। প্রথম রাকাআতে সূরা আল-ফাতিহার পর সূরা ইয়াসীন, দ্বিতীয় রাকাআতে সূরা আল-ফাতিহার পর সূরা হা-মীম আদ-দুখান, তৃতীয় রাকাআতে সূরা আল-ফাতিহার পর সূরা আলিফ-লাম-মীম তানযীলুস সাজদা এবং চতুর্থ রাকাআতে সূরা আল-ফাতিহার পর সূরা তাবারাকা আল-মুফাসসাল (সূরা আল-মুলক) পাঠ করবে। তুমি তাশাহহুদ পাঠ শেষ করে আল্লাহ তা'আলার প্রশংসা করবে এবং ভালভাবে তার গুণকীর্তন করবে, তারপর আমার উপর দরূদ পাঠ করবে এবং সকল নবী-রাসূলের প্রতি ভালভাবে দুরূদ ও সালাম পাঠ করবে, তারপর সকল মু'মিন পুরুষ ও মু'মিন নারীদের জন্য এবং তোমার যে সকল ভাই ঈমানের সাথে অতীতে ইন্তিকাল করেছে তাদের জন্য ক্ষমা প্রার্থনা করবে। সবশেষে তুমি বলবেঃ “হে আল্লাহ! পাপাচার ছেড়ে দিতে আমাকে অনুগ্রহ কর যাবত তুমি আমাকে বাচিয়ে রাখ, আমার প্রতি দয়া কর যেন আমি নিষ্ফল আচরণে জড়িয়ে না পড়ি এবং তোমার পছন্দনীয় বিষয়ে আমাকে ভালভাবে ভাববার তাওফীক দাও। হে আল্লাহ আকাশমণ্ডলী ও পৃথিবীর স্রষ্টা, মর্যাদা ও মহত্বের অধিকারী এবং এমন মৰ্যদার অধিকারী যার আকাংখা করা যায় না, আমি তোমার নিকটে প্রার্থনা করি, হে আল্লাহ, হে রহমান, তোমার অসীম মহত্ব ও চেহারার নূরের উসীলায় আমি প্রার্থনা করি যে, আমার অন্তরে তোমার কিতাবকে বদ্ধমূল করে দাও যেমন তুমি আমাকে শিখিয়েছ, যে ভাবে পাঠ করলে তুমি সন্তুষ্ট হও সেইভাবে পাঠ করতে আমাকে তাওফীক দান কর, হে আল্লাহ, আকাশ ও জমীনের সৃষ্টিকর্তা মর্যাদা ও মহত্বের অধিকারী এবং মর্যাদার অধিকারী যার আকাংখা করা যায় না। হে দয়াময়, তোমার মহত্ব ও নুরের উসীলায় আমি প্রার্থনা করছি। তুমি তোমার কিতাবের উসীলায় আমার চক্ষুকে উজ্জ্বল করে দাও, তা দিয়ে আমার যবান (জিহ্বা) খুলে দাও এবং তা দিয়ে আমার অন্তরকে উম্মুক্ত কর, আর তা দিয়ে আমার বক্ষকে প্রসারিত, আমার দেহটিকে তা দিয়ে ধুয়ে ফেল। সত্যের উপর তুমি ব্যতীত অন্য কেউই আমার সাহায্য করতে পারে না এবং তুমি ব্যতীত কেউই আমাকে তা দিতে পারে না। সুউচ্চ ও সুমহান আল্লাহ ছাড়া অনিষ্ট রোধ করার এবং কল্যাণ অর্জনের আর কোন শক্তি নেই।” হে আবূল হাসান! তুমি তিন অথবা পাঁচ অথবা সাত জুমুআ পর্যন্ত এ আমল করতে থাক। আল্লাহ্ তা'আলার ইচ্ছায় তোমার দু'আ কুবুল হবে। সেই মহান সত্তার কসম, যিনি আমাকে সত্য সহকারে পাঠিয়েছেন! কোন মু'মিনই (এ দু’আ পাঠ করে) কখনও বঞ্চিত হবে না। ইবনু আব্বাস (রাঃ) বলেন, আল্লাহ্ তা'আলার শপথ আলী (রাঃ) পাঁচ অথবা সাত জুমুআ পর্যন্ত এই আমল করে একদিন এরকম এক আসরে এসে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলেন, হে আল্লাহ্র রাসূল! আগে আমি চার আয়াত পাঠ করতাম আর তা আমার হৃদয় হতে চলে যেত। আর এখন আমি চল্লিশ আয়াত অথবা এরকম পরিমাণ মুখস্ত করে যখন পাঠ করি তখন মনে হয় যেন আল্লাহ্ তা'আলার কিতাব আমার চোখের সামনে উম্মুক্ত আছে। একইভাবে আমি হাদীস শুনতাম এবং পরে তা পুনঃপাঠ করতে গিয়ে দেখতাম যে, তা আমার অন্তর থেকে চলে গেছে। আর এখন আমি হাদীসসমূহ শুনি এবং পরে তা পুনঃপাঠ করি এবং তা হতে একটি শব্দও বাদ পড়ে না। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বলেনঃ হে হাসানের পিতা, কা'বার প্রভুর কসম! অবশ্যই তুমি একজন মু'মিন। মাওযু, তা’লীকুর রাগীব (২/২১৪), যঈফা (৩৩৭৪) আবূ ঈসা বলেনঃ এ হাদীসটি হাসান গারীব। ওয়ালীদ ইবনু মুসলিমের রিওয়ায়াত হিসেবেই শুধু আমরা এ হাদীস জেনেছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 201
			}
		}
	]
}