{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3706,
			"arabicnumber": 3706,
			"text": "৩৭০৬। উসমান ইবনু আবদুল্লাহ ইবনু মাওহিব (রহঃ) হতে বর্ণিত আছে যে, এক মিসরবাসী বাইতুল্লাহর হাজ্জ আদায় করে। সে একদল লোককে বসা দেখে বলে, এরা কারা? লোকেরা বলল, এরা কুরাইশ বংশীয়। সে পুনরায় বলে, এই বয়স্ক (শায়খ) লোকটি কে? লোকেরা বলল, ইবনু উমর (রাযিঃ)। সে সময় সে তার নিকটে এসে বলল, আপনাকে আমি কয়েকটি বিষয় প্রশ্ন করব। অতএব আপনি আমাকে (তা) বলুন। আমি এ বাইতুল্লাহর মর্যাদার শপথ দিয়ে আপনাকে প্রশ্ন করছি, আপনি কি অবহিত আছেন যে, উসমান (রাযিঃ) উহুদ যুদ্ধের দিন (যুদ্ধক্ষেত্র হতে) পলায়ন করেছেন? তিনি বললেন, হ্যাঁ। সে আবার বলল, আপনি কি জানেন, তিনি (হুদাইবিয়ায় অনুষ্ঠিত) বাই’আতুর রিযওয়ানে অনুপস্থিত ছিলেন? তিনি বললেন, হ্যাঁ। সে পুনরায়ও বলল, আপনি কি অবহিত আছেন যে, তিনি বদরের যুদ্ধে অনুপস্থিত ছিলেন এবং তাতে উপস্থিত হননি? তিনি বললেন, হ্যাঁ। সে বলল, আল্লাহু আকবার। তারপর ইবনু উমার (রাযিঃ) তাকে বললেন, এবার এসো। যেসব বিষয়ে তুমি প্রশ্ন করেছ তা তোমাকে আমি সুস্পষ্টভাবে বুঝিয়ে দেই। উহুদের দিন তার পলায়নের ঘটনা প্রসঙ্গে আমি সাক্ষ্য দিচ্ছি যে, তার ঐ ব্যাপারটা ইতোমধ্যেই আল্লাহ তা’আলা ক্ষমা করে দিয়েছেন, সম্পূর্ণভাবে মাফ করেছেন। তারপর বদরের যুদ্ধে তার অনুপস্থিতির কারণ এই যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর মেয়ে (রুকাইয়াহ্) তার সহধর্মিণী ছিলেন (এবং সে সময় তিনি মারাত্মক অসুস্থ ছিলেন)। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে বললেনঃ যে লোক বদরের যুদ্ধে যোগদান করেছে তার সমপরিমাণ সাওয়াব ও গানীমাত তুমি পাবে। আর তিনি রুকাইয়ার দেখাশুনা করার জন্য তাকে মদীনাতে থাকারই নির্দেশ দিলেন। আর বাই’আতে রিদওয়ানে তার অনুপস্থিতির কারণ এই যে, মক্কাবাসীদের কাছে উসমান (রাযিঃ)-এর চাইতে বেশি মর্যাদাবান কোন মুসলিম লোক (হুদাইবিয়ায়) উপস্থিত থাকলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম (তার পরিবর্তে) তাকেই প্রেরণ করতেন। তা না থাকাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম উসমান (রাযিঃ)-কেই (মক্কায়) প্রেরণ করলেন। আর উসমান (রাযিঃ)-এর মক্কার অভিমুখে রওয়ানা হয়ে যাওয়ার পর বাই’আতুর রিযওয়ান অনুষ্ঠিত হয়। বর্ণনাকারী বলেন, (বাই’আতঅনুষ্ঠানকালে)রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার ডান হাতের দিকে ইশারা করে বললেনঃ এটা উসমানের হাত। তারপর তিনি ঐ হাতটি তার অন্য হাতের উপর স্থাপন করে বললেনঃ এটি উসমানের (বাই’আত) তারপর ইবনু উমার (রাযিঃ) লোকটিকে বললেন, এবার তুমি এ ব্যাখ্যা সঙ্গে নিয়ে যাও। সহীহঃ বুখারী (৯৬৯৮)। আবূ ঈসা বলেন, হাদীসটি হাসান সহীহ।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 102
			}
		}
	]
}