{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3712,
			"arabicnumber": 3712,
			"text": "৩৭১২। ইমরান ইবনু হুসাইন (রাযিঃ) হতে বর্ণিত আছে, তিনি আবী তলিব (রাযিঃ)-কে তাদের সেনাপতি নিযুক্ত করেন। তিনি সেনাদলের একটি খণ্ডাংশের (সারিয়্যা) পরিদর্শনে যান এবং এক যুদ্ধবন্দিনীর সঙ্গে মিলিত হন। কিন্তু তার সাথীরা তার এ কাজ পছন্দ করলেন না। অতএব রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর চারজন সাহাবী শপথ করে বললেন, যখন আমরা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর দেখা পাব, তাকে তখন আলীর কার্যকলাপ প্রসঙ্গে জানাব। মুসলিমদের নিয়ম ছিল যে, তারা কোন সফর বা অভিযান শেষে ফিরে এসে সর্বপ্রথম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সঙ্গে সাক্ষাৎ করে তাকে সালাম করতেন, তারপর নিজ নিজ গৃহে ফিরে যেতেন। সুতরাং উক্ত সেনাদল ফিরে এসে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে সালাম জানায় এবং চার সাহাবীর একজন দাঁড়িয়ে বললেন, হে আল্লাহর রাসূল! লক্ষ্য করুন, আলী ইবনু আবী তলিব এই এই করেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার দিক হতে মুখ ফিরিয়ে নিলেন। তারপর দ্বিতীয় ব্যক্তি দাঁড়িয়ে পূর্বোক্ত ব্যক্তির মতো বক্তব্য পেশ করেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হতেও মুখ ফিরিয়ে নিলেন। এবার তৃতীয়জন দাঁড়িয়ে পূর্বোক্তজনের একই রকম বক্তব্য পেশ করেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার হতেও মুখ ফিরিয়ে নেন। অবশেষে চতুৰ্থজন দাড়িয়ে পূর্বোক্তদের একই রকম বক্তব্য পেশ করেন। এবার রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তার চেহারায় অসন্তুষ্টির ভাব নিয়ে তাদের দিকে মনোনিবেশ করে বললেনঃ কি বলতে চাও? তোমরা ‘আলী প্রসঙ্গে কি বলতে চাও? ‘আলী প্রসঙ্গে তোমরা কি বলতে চাও? (বংশ, বৈবাহিক সম্পর্ক, অগ্রগণ্যতা, ভালবাসা ইত্যাদি প্রসঙ্গে) আলী আমার হতে এবং আমি আলী হতে। আমার পরে সে-ই হবে সমস্ত মুমিনের সঙ্গী ও পৃষ্ঠপোষক। সহীহঃ সহীহাহ (২২২৩)। আবূ ঈসা বলেন, এ হাদীসটি হাসান গারীব। এ হাদীস আমরা শুধুমাত্র জাফর ইবনু সুলাইমানের সনদে অবগত হয়েছি।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 108
			}
		}
	]
}