{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 391,
			"arabicnumber": 391,
			"text": "৩৯১। আবদুল্লাহ ইবনু বুহাইনা আল-আসাদী (রাঃ) হতে বর্ণিত আছে, একদা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম যুহরের নামাযে (দ্বিতীয় রাকাআতে) বসার পরিবর্তে দাড়িয়ে গেলেন। নামায শেষ করার পর সালাম ফিরানোর আগে তিনি বসা অবস্থায় তাকবীরসহকারে দুটি সিজদা করলেন। তার সাথের লোকেরাও সিজদা করলো। ভুলে বর্জিত বসার পরিবর্তে এ সিজদা। —সহীহ। ইবনু মাজাহ– (১২০৬, ১২০৭), বুখারী ও মুসলিম। এ অনুচ্ছেদে ‘আবদুর রহমান ইবনু আওফ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু হুরাইরা ও আব্দুল্লাহ ইবনু সায়িব (রাঃ) হতে বর্ণিত আছে, তারা উভয়েই সালামের পূর্বে সাহু সিজদা করতেন। সনদ সহীহ। সায়িব তিনি ইবনু উমাইর। আবু ঈসা বলেনঃ বুহাইনার হাদীসটি হাসান সহীহ। কিছু বিদ্বান এই হাদীসের উপর আমল করেন। ইমাম শাফিঈ এই মত পোষণ করেন। তার মতে সকল সাহু সিজদা্ই সালামের পূর্বে। তিনি আরো বলেন, এই হাদীস অন্যান্য হাদীসের নাসিখ। কেননা এটাই রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সর্বশেষ আমল। ইমাম আহমাদ ও ইসহাক বলেন, কোন ব্যক্তি যদি দ্বিতীয় রাকাআতের পর দাড়িয়ে যায় তাহলে ইবনু বুহাইনার হাদিস অনুযায়ী সালামের পূর্বেই সাহু সিজদা করবে। আব্দুল্লাহ ইবনু বুহাইনা তিনি আব্দুল্লাহ ইবনু মালিক। তার মাতার নাম বুহাইনা। ইসহাক ইবনু মানসুর আলী ইবনু আবদিল্লাহ আল-মাদানী হতে এরূপই বর্ণনা করেছেন। আবু ঈসা বলেনঃ সাহু সিজদা কখন করবে এ ব্যাপারে বিদ্বানগণের মধ্যে মতের অমিল রয়েছে। কতক বিদ্বানের মতে সালামের পরে সাহু সিজদা করতে হবে। সুফইয়ান সাওরী ও কুফাবাসীর মত এটাই। কতক বিদ্বানের মতে সালামের পূর্বেই সাহু সিজদা করবে। এটাই অধিকাংশ মদীনাবাসী ফুকাহদের অভিমত। যেমন- ইয়াহইয়া ইবনু সাঈদ, রাবীয়া এবং অন্যান্য ইমামগণ। শাফিঈরও মত এটাই। আবার কেউ কেউ বলেন, নামাযে যদি অতিরিক্ত করে ফেলে তাহলে সালামের পরে, আর যদি নামাযে স্বল্পতা থাকে তবে সালামের পূর্বে। মালিক ইবনু আনাসের মত এটাই। ইমাম আহমাদ বলেন, সাহু সিজদা সম্পর্কে হাদীসসমূহে রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যে নিয়ম বর্ণিত হয়েছে সে নিয়ম অনুযায়ীই আমল করতে হবে। যদি দুই রাকাআত শেষে দাঁড়িয়ে যায় তাহলে বুহাইনার হাদিস অনুযায়ী সালামের পূর্বে সাহু সিজদা করবে। আর যদি যুহরের নামায পাঁচ রাকআত পড়ে ফেলে তাহলে সালামের পরে সাহু সিজদা করবে। যদি যুহর বা আসরে দুই রাকাতের পর সালাম ফেরায় তাহলে সালামের পর সাহু সিজদা করবে। আর যে সমস্ত ভুলের ব্যাপারে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে কোন বিবরণ নেই তাতে সালামের পূর্বেই সাহু সিজদা্ করবে। ইসহাকও আহমাদ অনুরূপ মত পোষণ করেন। তবে তিনি বলেন, যে সমস্ত ভুলের বিবরণ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত হয়নি তা যদি নামাযে অতিরিক্ত হয় তবে সালামের পরে সাহু সিজদা করবে, আর যদি নামাযে স্বল্পতা হয় তবে সালামের পূর্বেই সাহু সিজদা করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 243
			}
		}
	]
}