{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 406,
			"arabicnumber": 406,
			"text": "৪০৬। আসমা ইবনু হাকাম আল-ফাযারী (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি ‘আলী (রাঃ)-কে বলতে শুনেছিঃ আমি এমন এক ব্যক্তি ছিলাম যখন আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের কোন হাদীস শুনতাম, আল্লাহ তা'আলা যতটুকু চাইতেন আমি তা হতে ফায়দা উঠাতাম। যখন তার কোন সাহাবী আমার নিকট হাদীস বলতেন আমি তাকে শপথ করাতাম। সে যখন শপথ করে বলত আমি তাকে বিশ্বাস করতাম। আবু বাকর (রাঃ) আমাকেও হাদীস বলেছেন, আর তিনি সত্যিই বলেছেন। তিনি বলেছেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলতে শুনেছিঃ যে কোন ব্যক্তি যদি গুনাহ করে ফেলে, তা'আলার নিকট তাওবা করে আল্লাহ তা'আলা তার গুনাহ মাফ করে দিবেন। তারপর তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) এ আয়াত পাঠ করলেনঃ “যাদের অবস্থা এরূপ যে, তাদের দ্বারা যদি কোন অশ্লীল কাজ সংঘটিত হয় অথবা তারা কোন গুনাহ করে নিজেদের উপর যুলুম করে বসে, তবে সংগে সংগেই তারা আল্লাহ তা'আলার কথা মনে করে এবং তাদের গুনাহের ক্ষমা প্রার্থনা করে। আল্লাহ তা'আলা ছাড়া গুনাহ মাফ করতে পারে এমন কে আছে? এ লোকেরা জেনে বুঝে নিজেদের অন্যায় কাজ বারবার করে না”— (সূরাঃ আলে ইমরান-১৩৫)। -হাসান, ইবনু মাজাহ– (১৩৯৫)। উসমান ইবনু মুগীরার সূত্রেই আমরা হাদীসটি জেনেছি। এ অনুচ্ছেদে ইবনু মাসউদ, আবু দারদা, আনাস, আবু উমামা, মুআয, ওয়াসিলা এবং আবুল ইয়াসার (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ আলীর হাদীসটি হাসান। আমরা হাদীসটি শুধুমাত্র উসমান ইবনু মুগীরার সূত্রেই জেনেছ। উল্লেখিত হাদীসটি শুবা মারফু হিসাবে বর্ণনা করেছেন, সুফিয়ান সাওরী ও মিসআর মাওকুফ হিসাবে বর্ণনা করেছেন। মিসআর অবশ্য মারফু হিসাবেও এ হাদীসটি বর্ণনা করেছেন। আসমা ইবনুল হাকাম হতে এই হাদীসটি ছাড়া আমাদের অন্য কোন মারফু হাদীস জানা নেই।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 259
			}
		}
	]
}