{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"3": "The Book on Al-Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"text": "৪৮০। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম আমাদেরকে যেভাবে কুরআনের সুরা শিক্ষা দিতেন, ঠিক সেভাবে প্রতিটি কাজে আমাদেরকে ইস্তিখারা (কল্যাণ প্রার্থনা) শিক্ষা দিতেন। তিনি বলতেনঃ যখন তোমাদের কেউ কোন কাজের ইচ্ছা করে তখন সে যেন ফরয ছাড়া দুই রাকাআত নামায আদায় করে নেয়, অতঃপর বলেঃ “আল্লাহুম্মা ইন্নী আস্তাখীরুকা..... সুম্মা আরফিনী বিহি।\" হে আল্লাহ! আমি তোমার জ্ঞানের সাহায্য চাইছি, তোমার শক্তির সাহায্য চাইছি এবং তোমার মহান অনুগ্রহ চাইছি। তুমিই শক্তি ও ক্ষমতার অধিকারী, আমার কোন ক্ষমতা নেই। তুমি অফুরন্ত জ্ঞানের অধিকারী, আমার কোন জ্ঞান নেই। তুমি অদৃশ্যবিষয়ে সম্পূর্ণরূপে ও সম্যকভাবে জানো। হে আল্লাহ! তুমি যদি এ কাজটি আমার জন্য, আমার দীনের দৃষ্টিকোণ হতে, আমার জীবন যাপনের ব্যাপারে এবং আমার কাজের পরিণামের দিক হতে অথবা (রাবীর সন্দেহ) তিনি বলেছেনঃ আমার দুনিয়া ও আখিরাতের ব্যাপারে ভাল মনে কর তবে তা আমার জন্য নির্দিষ্ট করে দাও এবং আমার জন্য সহজ করে দাও। পক্ষান্তরে তুমি যদি এ কাজটি আমার জন্য আমার দীনের দৃষ্টিকোণ হতে, আমার জীবন যাপনের ব্যাপারে এবং আমার কাজকর্মের পরিণামের দিক হতে, অথবা (রাবীর সন্দেহ) তিনি বলেছেনঃ আমার ইহকাল-পরকালের ব্যাপারে ক্ষতিকর মনে কর, তবে তুমি সে কাজটি আমার থেকে দূরে সরিয়ে দাও। এবং আমাকে তা থেকে বিরত রাখ। যেখান হতে হোক তুমি আমার জন্য কল্যাণ নির্ধারণ করে দাও।” অতঃপর তিনি (রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম) অথবা রাবী বলেন, (এ কাজটির স্থলে) প্রার্থনাকারী যেন নিজের উদ্দিষ্ট কাজের নাম করে। -সহীহ। ইবনু মাজাহ– (১৩৮০)। এ অনুচ্ছেদে আবদুল্লাহ ইবনু মাসউদ ও আবু আইয়ূব (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেনঃ জাবিরের হাদীসটি হাসান সহীহ গারীব। উল্লেখিত হাদীসটি আমরা শুধুমাত্র আবদুর রহমান ইবনু আবুল মাওয়ালীর সূত্রেই জেনেছি। তিনি মদীনার একজন শাইখ এবং সিকাহ (নির্ভরযোগ্য) রাবী। তার নিকট হতে সুফিয়ান একটি হাদীস বর্ণনা করেছেন। আব্দুর রহমানের নিকট হতে অনেক ইমামই হাদীস বর্ণনা করেছেন। আর তিনি হলেন, আব্দুর রহমান ইবনু যাইদ ইবনু আবীল মাওয়ালী।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		}
	]
}