{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"4": "The Book on the Day of Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"text": "৫১১। আবদুল্লাহ ইবনু আবু সারহ (রাঃ) হতে বর্ণিত আছে, আবু সাঈদ আল-খুদরী (রাঃ) জুমুআর দিন (মসজিদে) ঢুকলেন। মারওয়ান তখন খুতবা দিচ্ছিল। তিনি নামায আদায় করতে দাড়ালেন। মারওয়ানের চৌকিদার তাকে বসিয়ে দেওয়ার (নামায হতে বিরত রাখার) জন্য আসল। কিন্তু তিনি তা মানলেন না এবং নামায আদায় করলেন। তিনি অবসর হলে আমরা তার নিকট আসলাম। আমরা বললাম, আল্লাহ তা'আলা আপনার উপর দয়া করুন, তারা আপনাকে পরাজিত করার জন্য এসেছিল। তিনি বললেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লামকে এটা করতে দেখেছি। এরপর আমি এ দুই রাকাআত কখনও ছাড়তে পারি না। তারপর তিনি উল্লেখ করলেন, জুমু'আর দিন এক ব্যক্তি তাড়াহুড়া করে উস্ক খুস্ক অবস্থায় মসজিদে আসল। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তখন জুমু'আর খুতবা দিচ্ছিলেন। তিনি তাকে নির্দেশ দিলে সে দুই রাকাআত নামায আদায় করল। আর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম খুতবা দিতে থাকলেন। —হাসান সহীহ। ইবনু মাজাহ– (১১১৩)। আবু ঈসা বলেনঃ হাদীসটি হাসান সহীহ। এ হাদীসের এক রাবী ইবনু আবী উমার বলেন, ইবনু উআইনা মসজিদে এসে দুই রাকাআত নামায আদায় করতেন; ইমাম তখন খুতবা দিতে থাকতেন। তিনি এটা আদায় করার নির্দেশও দিতেন। আবু আবদুর রহমান আল-মাকবুরীও তাকে এরকম করতে দেখেছেন। মুহাম্মাদ ইবনু আজলান একজন সিকাহ রাবী এবং হাদীসশাস্ত্রে তিনি নির্ভরযোগ্য ছিলেন। এ অনুচ্ছেদে আবু হুরাইরা, জাবির এবং সাহল ইবনু সা'দ (রাঃ) হতেও হাদীস বর্ণিত আছে। একদল আলিম এ হাদীস অনুযায়ী আমল করেছেন। ইমাম শাফিঈ, আহমাদ ও ইসহাক একই রকম মত দিয়েছেন। অপর একদল বিদ্বান বলেছেন, ইমাম যখন খুতবা দিতে থাকেন তখন কোন লোক আসলে সে বসে যাবে এবং নামায আদায় করবে না। সুফিয়ান সাওরী ও কুফাবাসীগণ এই মত পালন করেন। কিন্তু প্রথম মতই বেশি সহীহ। ‘আলী ইবনু খালিদ আল-কুরাশী (রহঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি হাসান আল-বাসরীকে জুমুআর দিন মসজিদে ঢুকতে দেখলাম, ইমাম তখন খুতবা দিচ্ছিলেন। তিনি দুই রাকাআত নামায আদায় করলেন, তারপর বসলেন। হাদীসের অনুসরণ করার জন্যই হাসান এরকমটি করলেন। তিনি এ সম্পর্কিত হাদীস জাবির (রাঃ)-এর মাধ্যমে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট হতে বর্ণনা করেছেন।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 24
			}
		}
	]
}