{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "৫৬১। আয়িশাহ (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের যুগে সূর্যগ্রহণ হল। রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম লোকদের নিয়ে (জামা'আতে) নামায আদায় করলেন। তিনি অধিক সময় ধরে কিরাআত পাঠ করলেন, তারপর রুকু করলেন এবং দীর্ঘসময় রুকূতে থাকলেন, তারপর মাথা তুললেন (রুকূ’ হতে উঠলেন)। তিনি আবার দীর্ঘ কিরা'আত পাঠ করলেন কিন্তু প্রথমবারের চেয়ে কম লম্বা করলেন, তারপর রুকূতে গেলেন এবং দীর্ঘ সময় রুকূতে থাকলেন, কিন্তু আগের চেয়ে সংক্ষেপে করলেন। তারপর তিনি রুকূ থেকে মাথা তুলে সিজদাতে গেলেন। তিনি দ্বিতীয় রাক'আতও উল্লেখিত পদ্ধতিতে আদায় করলেন। —সহীহ। সহীহ আবু দাউদ- (১০৭১), বুখারী ও মুসলিম। আবু ঈসা বলেনঃ এ হাদীসটি হাসান সহীহ্! এ হাদীসের পরিপ্রেক্ষিতে ইমাম শাফিঈ, আহমাদ ও ইসহাক বলেছেন, সূর্যগ্রহণের নামায চার রুকু ও চার সিজদায় আদায় করবে। শাফিঈ আরো বলেছেন, প্রথম রাকাআতে সূরা ফাতিহার পর সূরা আল-বাকারার মতো যে কোন লম্বা সূরা পাঠ করবে। দিনে হলে নীরবে কিরা'আত পাঠ করবে। তারপর রুকূতে গিয়ে কিরা'আত পাঠের পরিমাণ সময় রুকূতে থাকবে। তারপর আল্লাহু আকবার বলে মাথা তুলে দাড়াবে এবং সূরা ফাতিহার পর সূরা আলে-ইমরানের মতো লম্বা সূরা পাঠ করবে। তারপর রুকূতে গিয়ে কিরা'আত পাঠের পরিমাণ সময় রুকূতে থাকবে। তারপর সামিআল্লাহু লিমান হামিদাহ' বলে মাথা তুলবে। তারপর দুটি পূর্ণাঙ্গ সিজদা করবে এবং প্রত্যেক সিজদা্তে রুকূর পরিমাণ সময় থাকবে। অতঃপর দাড়িয়ে সূরা ফাতিহার পর সূরা আন-নিসার মতো লম্বা সূরা পাঠ করবে, তারপর কিরাআতের মতো লম্বা রুকূ করবে। তারপর আল্লাহু আকবার বলে মাথা তুলে দাড়াবে। তারপর সূরা মায়িদার মতো লম্বা সূরা পাঠ করবে, রুকূও কিরাআতের মতো লম্বা করবে। অতঃপর মাথা তুলবে এবং সামিআল্লাহু লিমান হামিদাহ বলবে। অতঃপর দুটি সিজদা করে, তাশাহহুদ পাঠ করে সালাম ফিরিয়ে নামায সমাপ্ত করবে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		}
	]
}