{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 61,
			"arabicnumber": 61,
			"text": "৬১। সুলাইমান ইবনু বুরাইদা (রহঃ) হতে তার পিতার সূত্রে বর্ণিত আছে, তিনি (বুরাইদা) বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রতি ওয়াক্তের নামাযের জন্য নতুনভাবে ওযু করতেন। তিনি মক্কা বিজয়ের দিন একই ওযু দিয়ে সব ওয়াক্তের নামায আদায় করলেন এবং মোজার উপর মসিহ করলেন। উমার (রাঃ) বললেনঃ আপনি এমন একটি কাজ করলেন যা ইতোপূর্বে কখনও করেননি। তিনি (রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেন, আমি ইচ্ছা করেই এটা করলাম। -সহীহ। ইবনু মাজাহ– (৫১০), মুসলিম। আবু ঈসা বলেনঃ হাদীসটি হাসান সহীহ। এ হাদীসটি আলী ইবনু কাদিম— সুফিয়ান সাওরীর সূত্রে বর্ণনা করেছেন। তাতে এ কথাটুকুও আছে, “তিনি একবার একবার ওযু করেছেন।” সুফিয়ান সাওরী তার সনদ পরম্পরায় বুরাইদার সূত্রে বর্ণনা করেছেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম প্রত্যেক ওয়াক্তের নামাযের জন্যই নতুনভাবে ওযু করতেন। ওরাকীও তার সনদ পরম্পরায় বুরাইদার এ হাদীসটি বর্ণনা করেছেন। আবদুর রহমান ইবনুল মাহদী ও অন্যরা অপর এক সনদ পরম্পরায় এ হাদীসটি মুরসাল হিসেবে বর্ণনা করেছেন। এ বর্ণনাটি ওয়াকীর বর্ণনার তুলনায় বেশি সহীহ। বিদ্বানদের মতামত হল ওযু যে পর্যন্ত নষ্ট না হবে, সে পর্যন্ত একই ওযুতে একাধিক ওয়াক্তের নামায আদায় করা যাবে। তাদের কেউ কেউ ফযিলত লাভের আশায় প্রত্যেক নামাযের জন্য নতুনভাবে ওযু করাটা মুস্তাহাব মনে করেছেন। আফরীকী হতে বর্ণিত আছে, তিনি গুতাইফ হতে তিনি ইবনু উমার হতে তিনি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণনা করেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ \"যে ব্যক্তি ওযু থাকা অবস্থায় ওযু করে আল্লাহ তার জন্য দশটি সাওয়াব লিখেন।\" -এর সনদ যঈফ। এ অনুচ্ছেদে জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত একটি হাদীস রয়েছেঃ “নবী সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম একই ওযুতে যুহর এবং আসরের নামায আদায় করেছেন।”",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 61
			}
		}
	]
}