{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"7": "The Book on Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 617,
			"arabicnumber": 617,
			"text": "৬১৭। আবু যার (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে এলাম। তিনি সে সময় কা'বার ছায়াতে বসে ছিলেন। বর্ণনাকারী বলেন, তিনি আমাকে সম্মুখে আসতে দেখে বলেনঃ কা'বার প্রভুর শপথ! তারা কিয়ামতের দিবসে অত্যন্ত ক্ষতিগ্রস্ত অবস্থায় হাযির হবে। বর্ণনাকারী বলেন, আমি মনে মনে বললাম, আমার কি হল, মনে হয় আমার প্রসঙ্গে তার উপর কোন কিছু নাযিল হয়েছে। আমি বললাম, আপনার জন্য আমার পিতা-মাতা নিবেদিত হোক! এধরণের লোক কারা? রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ অধিক ধনদৌলত আত্মসাৎকারী, কিন্তু যে সব লোক এই, এই ও এই পরিমাণ দিয়েছে সে সব লোক ছাড়া। তিনি সামনে, ডানে ও বামে হাতের ইশারা করলেন। তারপর তিনি বললেনঃ সেই সত্তার শপথ, যার হাতে আমার জীবন! যে লোক এধরণের উট অথবা গরু রেখে মৃত্যুবরণ করল যার যাকাত সে দেয়নি, কিয়ামতের দিন সেগুলো পূর্বাবস্থা হতে বেশি মোটাতাজা হয়ে তার নিকটে আসবে এবং নিজেদের পায়ের ক্ষুর দ্বারা তাকে দলিত করবে এবং শিং দ্বারা গুতো মারবে। সবশেষের জন্তুটি চলে যাওয়ার পর আবার প্রথম জন্তুটি ফিরে আসবে। মানুষের সম্পূর্ণ বিচার শেষ না হওয়া পর্যন্ত শাস্তির এ ধারা চলতে থাকবে। — সহীহ তা’লীকুর রাগীব (১/২৬৭) আবু হুরাইরা (রাঃ) হতেও একই রকম হাদীস বর্ণিত আছে। আলী (রাঃ) বলেন, যাকাত অমান্যকারীকে অভিসম্পাত করা হয়েছে। কাবীসা ইবনু হুলব তার পিতা থেকে, জাবির ইবনু আব্দুল্লাহ, আব্দুল্লাহ ইবনু মাসউদ (রাঃ) হতেও হাদীস বর্ণিত আছে। আবু ঈসা বলেন, আবূ যারের হাদীসটি হাসান সহীহ্! আবু যার (রাঃ)-এর নাম জুনদাব ইবনুস সাকান, কারো মতে ইবনু জুনাদা। দাহহাক ইবনু মুযাহিম বলেন, যার দশ হাজার (দিরহাম) রয়েছে সেই অধিক সম্পদশালী। — সহীহ মাকতু অর্থাৎ যাহহাকের উপর মাওকৃফ এই হাদীসের এক রাবী আবদুল্লাহ ইবনু মুনীর মারওয়ায়ী একজন নিষ্ঠাবান লোক।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 1
			}
		}
	]
}