{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "৭১০। জাবির ইবনু আবদুল্লাহ (রাঃ) হতে বর্ণিত আছে, মক্কা বিজয়ের বছর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মক্কার উদ্দেশ্যে রাওয়ানা হন। তিনি রোযা রাখেন এবং লোকেরাও তার সাথে রোযা রাখে। কুরাউল গামীমে পৌছানোর পর তাকে বলা হল, রোযা রাখা লোকদের জন্য কষ্টকর হয়ে পড়েছে। আপনি কি করেন তারা সেই অপেক্ষায় আছে। আসরের নামায আদায়ের পর তিনি এক পেয়ালা পানি চেয়ে আনালেন এবং তা পান করলেন। তখন লোকেরা তার দিকে তাকিয়ে দেখছিল। ফলে তাদের মধ্যেকার কিছু লোক রোযা ভাঙ্গলো এবং কিছু লোক রোযা থাকল। তখনও কিছু লোক রোযা অবস্থায় আছে এ কথা তার নিকটে পৌছলে তিনি বললেনঃ এরী হচ্ছে অবাধ্য নাফরমান। — সহীহ, ইরওয়া (৪/৫৭), মুসলিম কাব ইবনু আসিম, ইবনু আব্বাস ও আবু হুরাইরা (রাঃ) হতেও এই অনুচ্ছেদে হাদীস বর্ণিত আছে। জাবির (রাঃ) হতে বর্ণিত হাদীসটিকে আবূ ঈসা হাসান সহীহ বলেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছে যে, তিনি বলেছেনঃ “সফরের মাঝে রোযা পালন করাটা সাওয়াবের কাজ নয়”। আলিমদের মধ্যে সফরে থাকাবস্থায় রোযা পালন করা প্রসঙ্গে মতবিরোধ আছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের একদল বিশেষজ্ঞ সাহাবী ও অন্যান্যদের মতানুযায়ী সফরে থাকা অবস্থায় রোযা পালন না করাই উত্তম। এমনকি কারো কারো মতানুযায়ী সফরে থাকাবস্থায় কোন লোক রোযা পালন করলে তাকে আবার সে রোযা কাযা করতে হবে। সফরে রোযা না পালনের পক্ষে ইমাম আহমাদ ও ইসহাক অভিমত দিয়েছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের অন্য আরেকদল বিশেষজ্ঞ সাহাবী ও আলিম বলেছেন শক্তি-সামর্থ্যবান লোকে যদি সফরে রোযা পালন করে তাহলে তা ভাল এবং তাই উত্তম, রোযা আদায় না করলে তাকেও ভাল বলেছেন। সুফিয়ান সাওরী, মালিক ইবনু আনাস ও আবদুল্লাহ ইবনুল মুবারাকের.এই মত। ইমাম শাফিঈ বলেন, “সফরে থাকাবস্থায় রোযা পালন করা সাওয়াবের কাজ নয়” এবং “এরা নাফরমান” এই কথার তাৎপর্য হচ্ছে, যে লোকের অন্তর আল্লাহর দেয়া অবকাশ (রুখসাত) গ্রহণ করতে প্রস্তুত নয় সে লোকের ক্ষেত্রে ঐ কথা প্রযোজ্য। কিন্তু সফরে রোযা ভেঙ্গে ফেলাকে যে লোক জায়িয মনে করে এবং রোযা রাখার সামর্থ্য থাকায় রোযা পালন করে, তা আমার নিকটে পছন্দনীয়।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		}
	]
}