{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "৯৭৭৷ উম্মু সালামা (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, আমাদেরকে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ কোন অসুস্থ বা মৃত লোকের নিকটে তোমরা হাযির হলে তার সম্বন্ধে ভাল কথা বলবে। কেননা, তোমরা যেসব কথা বল সে প্রসঙ্গে ফেরেশতাগণ আমীন বলে থাকেন। উম্মু সালামা (রাঃ) বলেন, আবু সালামা (রাঃ) মারা যাবার পর আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে এসে বললাম, হে আল্লাহর রাসূল! আবু সালামা মারা গিয়েছে। তিনি বললেনঃ তুমি বল, “হে আল্লাহ! আমাকে এবং তাকে ক্ষমা করে দিন এবং তার পরে আমাকে তার চেয়ে আরও উত্তম পরিণতি দান করুন। উম্মু সালামা (রাঃ) বলেন, আমি বুঝতে পারলাম যে, আল্লাহ্ তা'আলা তার পরবর্তীতে আমাকে তার চাইতে উত্তম ব্যক্তি দান করেছেন। তিনি হচ্ছেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম। — সহীহ, ইবনু মা-জাহ (১৪৪৭), মুসলিম শাকীক হচ্ছেন ইবনু সালামা আবু ওয়াইল আসাদী। উম্মু সালামা (রাঃ) বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। মুমূর্ষ রোগীকে লা ইলাহা ইল্লাল্লাহ-এর তালকীন করা মুস্তাহাব। একদল আলিম বলেন, এই কালিমা যদি সে একবার পাঠ করে নেয় তবে পরে অন্যকথা না বললে পুনরায় তাকে তালকীন করা অনুচিত এবং বারবার এই বিষয়ে তাকে চাপ প্রয়োগ করা উচিত নয়। ইবনুল মুবারাকের মৃত্যুর সময় হাযির হলে তাকে কোন এক লোক লা ইলাহা ইল্লাল্লাহ-এর তালকীন করতে থাকে এবং এই বিষয়ে বারবার তাকে তাকিদ করতে থাকে। তখন তিনি বললেন, আমি একবার তা বলেছি পরে অন্য কোন কথা না বলা পর্যন্ত আমি এই কথার উপরই প্রতিষ্ঠিত আছি। আবদুল্লাহ ইবনুল মুবারাক (রাহঃ)-এর এই কথার তাৎপর্য এটাই যা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হতে বর্ণিত আছেঃ “যে লোকের শেষ কথা \"লা ইলাহা ইল্লাল্লাহ হবে সে লোক জান্নাতে যাবে”।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 13
			}
		}
	]
}