{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"10": "The Book on Jana''iz (Funerals)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "৯৯০। উম্মু আতিয়া (রাঃ) হতে বর্ণিত আছে, তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের এক কন্যা (যাইনাব) মারা গেলে তিনি বললেনঃ তোমরা বেজোড় সংখ্যায় তিন বার বা পাঁচ বার অথবা প্রয়োজনে এর চেয়েও অধিক বার তাকে গোসল দিতে পার। বরই পাতা মিশ্রিত পানি দিয়ে গোসল দাও। আর শেষবার পানিতে কর্পূর বা কিছু পরিমাণ কর্পূর ঢেলে দাও। তোমাদের গোসল করানো শেষ হয়ে গেলে আমাকে জানিয়ে দিও। অতএব, তার গোসল শেষ করে আমরা তাকে জানালাম। তিনি তার লুঙ্গি আমাদের দিকে ছুড়ে দিলেন এবং বললেনঃ তার শরীরে এটিকে জড়িয়ে দাও। হুশাইম বলেন, এদের (খালিদ, মানসূর) ব্যতীত অন্যদের, হয়ত হিশামও তাদের একজন, বর্ণনায় আছে যে, উম্মু আতিয়া (রাঃ) বলেন, আমরা তার চুলকে তিন ভাগে বিন্যস্ত করলাম। হুশাইম বলেন, আমার ধারণায় তিনি এও বলেছেনঃ তার চুলগুলোকে আমরা তার পিছন দিকে ছেড়ে দিলাম। হুশাইম বলেন, এদের মধ্যে খালিদ আমাকে হাফসা ও মুহাম্মাদ-উম্মু আতিয়া (রাঃ)-এর সূত্রে বর্ণনা করেছেন, তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদেরকে বললেনঃ তার ডান পাশ দিযে তার ওযুর স্থানসমূহ হতে গোসল শুরু কর। — সহীহ, ইবনু মা-জাহ (১৪৫৮); বুখারী, মুসলিম। উম্মু সুলাইম (রাঃ) হতেও এই অনুচ্ছেদে হাদীস বর্ণিত আছে। উম্মু আতিয়া (রাঃ) হতে বর্ণিত হাদীসটিকে আবু ঈসা হাসান সহীহ বলেছেন। এই হাদীস অনুযায়ী আলিমগণ আমল করেছেন। ইবরাহীম নাখঈ (রহঃ) বলেন, নাপাক ব্যক্তির গোসলের নিয়মের মতই মৃতের গোসল করানোর নিয়ম। ইমাম মালিক (রহঃ) বলেন, আমাদের মতে মৃত ব্যক্তির গোসল করানোর ধরাবাধা কোন নিয়ম নেই। আসল কাজ হচ্ছে তাকে পাকসাফ করা। ইমাম শাফিঈ (রাহঃ) বলেন, মালিক (রাহঃ) একটি অস্পষ্ট কথা বলেছেন যে, মৃত ব্যক্তিকে পরিষ্কার পানি বা অন্য কোন পানি দ্বারা গোসল করিয়ে তার দেহ হতে ময়লা দূর করে দিলেই যুথেষ্ট। কিন্তু আমার মতে মৃত ব্যক্তিকে তিন বা ততোধিক বার বেজোড় সংখ্যায় গোসল করানো মুস্তাহাব। তবে যেন তিন হতে কম না হয়। কেননা, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ তাকে তোমরা তিনবার অথবা পাঁচবার গোসল করাও। যদি তিনবারের কমেই পরিষ্কার-পরিচ্ছন্ন হয়ে যায় এবং তাই যথেষ্ট হয়। তবে তার এই বক্তব্য তিন বার বা পাঁচ বার-এর কোন অর্থ হয়না। এই বিষয়ে তিনি কোন নির্দিষ্ট সংখ্যা নির্ধারিত করে দেননি একথা বলা যায়না। ফকীহগণও এরকম কথা বলেছেন। হাদীসের প্রকৃত মর্ম তারাই হৃদয়ংগম করতে পারেন। ইমাম আহমাদ ও ইসহাক (রাহঃ) বলেন, বরই পাতা মিশ্রিত পানি দিয়ে গোসল করাতে হবে এবং শেষবারে কর্পূর মিশ্রিত পানি দিয়ে।",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		}
	]
}