{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4351,
			"arabicnumber": 4351,
			"text": "حدثنا أحمد بن محمد بن حنبل، حدثنا إسماعيل بن إبراهيم، أخبرنا أيوب، عن عكرمة، أن عليا، عليه السلام أحرق ناسا ارتدوا عن الإسلام فبلغ ذلك ابن عباس فقال لم أكن لأحرقهم بالنار إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تعذبوا بعذاب الله ‏\"‏ ‏.‏ وكنت قاتلهم بقول رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من بدل دينه فاقتلوه ‏\"‏ ‏.‏ فبلغ ذلك عليا عليه السلام فقال ويح ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4352,
			"arabicnumber": 4352,
			"text": "حدثنا عمرو بن عون، أخبرنا أبو معاوية، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يحل دم رجل مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث الثيب الزاني والنفس بالنفس والتارك لدينه المفارق للجماعة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4353,
			"arabicnumber": 4353,
			"text": "حدثنا محمد بن سنان الباهلي، حدثنا إبراهيم بن طهمان، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأن محمدا رسول الله إلا بإحدى ثلاث رجل زنى بعد إحصان فإنه يرجم ورجل خرج محاربا لله ورسوله فإنه يقتل أو يصلب أو ينفى من الأرض أو يقتل نفسا فيقتل بها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4354,
			"arabicnumber": 4354,
			"text": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى بن سعيد، - قال مسدد - حدثنا قرة بن خالد، قال حدثنا حميد بن هلال، حدثنا أبو بردة، قال قال أبو موسى أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين أحدهما عن يميني والآخر عن يساري فكلاهما سأل العمل والنبي صلى الله عليه وسلم ساكت فقال ‏\"‏ ما تقول يا أبا موسى ‏\"‏ ‏.‏ أو ‏\"‏ يا عبد الله بن قيس ‏\"‏ ‏.‏ قلت والذي بعثك بالحق ما أطلعاني على ما في أنفسهما وما شعرت أنهما يطلبان العمل ‏.‏ قال وكأني أنظر إلى سواكه تحت شفته قلصت قال ‏\"‏ لن نستعمل - أو لا نستعمل - على عملنا من أراده ولكن اذهب أنت يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ فبعثه على اليمن ثم أتبعه معاذ بن جبل قال فلما قدم عليه معاذ قال انزل ‏.‏ وألقى له وسادة فإذا رجل عنده موثق قال ما هذا قال هذا كان يهوديا فأسلم ثم راجع دينه دين السوء ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ‏.‏ قال اجلس نعم ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ‏.‏ ثلاث مرات فأمر به فقتل ثم تذاكرا قيام الليل فقال أحدهما معاذ بن جبل أما أنا فأنام وأقوم - أو أقوم وأنام - وأرجو في نومتي ما أرجو في قومتي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4355,
			"arabicnumber": 4355,
			"text": "حدثنا الحسن بن علي، حدثنا الحماني، - يعني عبد الحميد بن عبد الرحمن - عن طلحة بن يحيى، وبريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، قال قدم على معاذ وأنا باليمن، ورجل، كان يهوديا فأسلم فارتد عن الإسلام، فلما قدم معاذ قال لا أنزل عن دابتي حتى يقتل ‏.‏ فقتل ‏.‏ قال أحدهما وكان قد استتيب قبل ذلك ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4356,
			"arabicnumber": 4356,
			"text": "حدثنا محمد بن العلاء، حدثنا حفص، حدثنا الشيباني، عن أبي بردة، بهذه القصة قال فأتي أبو موسى برجل قد ارتد عن الإسلام، فدعاه عشرين ليلة أو قريبا منها فجاء معاذ فدعاه فأبى فضرب عنقه ‏.‏ قال أبو داود ورواه عبد الملك بن عمير عن أبي بردة لم يذكر الاستتابة ورواه ابن فضيل عن الشيباني عن سعيد بن أبي بردة عن أبيه عن أبي موسى ولم يذكر فيه الاستتابة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4357,
			"arabicnumber": 4357,
			"text": "حدثنا ابن معاذ، حدثنا أبي، حدثنا المسعودي، عن القاسم، بهذه القصة قال فلم ينزل حتى ضرب عنقه وما استتابه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4358,
			"arabicnumber": 4358,
			"text": "حدثنا أحمد بن محمد المروزي، حدثنا علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال كان عبد الله بن سعد بن أبي سرح يكتب لرسول الله صلى الله عليه وسلم فأزله الشيطان فلحق بالكفار فأمر به رسول الله صلى الله عليه وسلم أن يقتل يوم الفتح فاستجار له عثمان بن عفان فأجاره رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4359,
			"arabicnumber": 4359,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا أحمد بن المفضل، حدثنا أسباط بن نصر، قال زعم السدي عن مصعب بن سعد، عن سعد، قال لما كان يوم فتح مكة اختبأ عبد الله بن سعد بن أبي سرح عند عثمان بن عفان فجاء به حتى أوقفه على النبي صلى الله عليه وسلم فقال يا رسول الله بايع عبد الله ‏.‏ فرفع رأسه فنظر إليه ثلاثا كل ذلك يأبى فبايعه بعد ثلاث ثم أقبل على أصحابه فقال ‏\"‏ أما كان فيكم رجل رشيد يقوم إلى هذا حيث رآني كففت يدي عن بيعته فيقتله ‏\"‏ ‏.‏ فقالوا ما ندري يا رسول الله ما في نفسك ألا أومأت إلينا بعينك قال ‏\"‏ إنه لا ينبغي لنبي أن تكون له خائنة الأعين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4360,
			"arabicnumber": 4360,
			"text": "حدثنا قتيبة بن سعيد، حدثنا حميد بن عبد الرحمن، عن أبيه، عن أبي إسحاق، عن الشعبي، عن جرير، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إذا أبق العبد إلى الشرك فقد حل دمه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4361,
			"arabicnumber": 4361,
			"text": "حدثنا عباد بن موسى الختلي، أخبرنا إسماعيل بن جعفر المدني، عن إسرائيل، عن عثمان الشحام، عن عكرمة، قال حدثنا ابن عباس، أن أعمى، كانت له أم ولد تشتم النبي صلى الله عليه وسلم وتقع فيه فينهاها فلا تنتهي ويزجرها فلا تنزجر - قال - فلما كانت ذات ليلة جعلت تقع في النبي صلى الله عليه وسلم وتشتمه فأخذ المغول فوضعه في بطنها واتكأ عليها فقتلها فوقع بين رجليها طفل فلطخت ما هناك بالدم فلما أصبح ذكر ذلك لرسول الله صلى الله عليه وسلم فجمع الناس فقال ‏\"‏ أنشد الله رجلا فعل ما فعل لي عليه حق إلا قام ‏\"‏ ‏.‏ فقام الأعمى يتخطى الناس وهو يتزلزل حتى قعد بين يدى النبي صلى الله عليه وسلم فقال يا رسول الله أنا صاحبها كانت تشتمك وتقع فيك فأنهاها فلا تنتهي وأزجرها فلا تنزجر ولي منها ابنان مثل اللؤلؤتين وكانت بي رفيقة فلما كانت البارحة جعلت تشتمك وتقع فيك فأخذت المغول فوضعته في بطنها واتكأت عليها حتى قتلتها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا اشهدوا أن دمها هدر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4362,
			"arabicnumber": 4362,
			"text": "حدثنا عثمان بن أبي شيبة، وعبد الله بن الجراح، عن جرير، عن مغيرة، عن الشعبي، عن علي، رضي الله عنه أن يهودية، كانت تشتم النبي صلى الله عليه وسلم وتقع فيه فخنقها رجل حتى ماتت فأبطل رسول الله صلى الله عليه وسلم دمها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4363,
			"arabicnumber": 4363,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن يونس، عن حميد بن هلال، عن النبي صلى الله عليه وسلم ح وحدثنا هارون بن عبد الله، ونصير بن الفرج، قالا حدثنا أبو أسامة، عن يزيد بن زريع، عن يونس بن عبيد، عن حميد بن هلال، عن عبد الله بن مطرف، عن أبي برزة، قال كنت عند أبي بكر رضي الله عنه فتغيظ على رجل فاشتد عليه فقلت تأذن لي يا خليفة رسول الله صلى الله عليه وسلم أضرب عنقه قال فأذهبت كلمتي غضبه فقام فدخل فأرسل إلى فقال ما الذي قلت آنفا قلت ائذن لي أضرب عنقه ‏.‏ قال أكنت فاعلا لو أمرتك قلت نعم ‏.‏ قال لا والله ما كانت لبشر بعد محمد صلى الله عليه وسلم ‏.‏ قال أبو داود هذا لفظ يزيد قال أحمد بن حنبل أى لم يكن لأبي بكر أن يقتل رجلا إلا بإحدى الثلاث التي قالها رسول الله صلى الله عليه وسلم كفر بعد إيمان أو زنا بعد إحصان أو قتل نفس بغير نفس وكان للنبي صلى الله عليه وسلم أن يقتل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4364,
			"arabicnumber": 4364,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي قلابة، عن أنس بن مالك، أن قوما، من عكل - أو قال من عرينة - قدموا على رسول الله صلى الله عليه وسلم فاجتووا المدينة فأمر لهم رسول الله صلى الله عليه وسلم بلقاح وأمرهم أن يشربوا من أبوالها وألبانها فانطلقوا فلما صحوا قتلوا راعي رسول الله صلى الله عليه وسلم واستاقوا النعم فبلغ النبي صلى الله عليه وسلم خبرهم من أول النهار فأرسل النبي صلى الله عليه وسلم في آثارهم فما ارتفع النهار حتى جيء بهم فأمر بهم فقطعت أيديهم وأرجلهم وسمر أعينهم وألقوا في الحرة يستسقون فلا يسقون ‏.‏ قال أبو قلابة فهؤلاء قوم سرقوا وقتلوا وكفروا بعد إيمانهم وحاربوا الله ورسوله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4365,
			"arabicnumber": 4365,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن أيوب، بإسناده بهذا الحديث قال فيه فأمر بمسامير فأحميت فكحلهم وقطع أيديهم وأرجلهم وما حسمهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4366,
			"arabicnumber": 4366,
			"text": "حدثنا محمد بن الصباح بن سفيان، قال أخبرنا ح، وحدثنا عمرو بن عثمان، حدثنا الوليد، عن الأوزاعي، عن يحيى، - يعني ابن أبي كثير - عن أبي قلابة، عن أنس بن مالك، بهذا الحديث قال فيه فبعث رسول الله صلى الله عليه وسلم في طلبهم قافة فأتي بهم ‏.‏ قال فأنزل الله تبارك وتعالى في ذلك ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا ‏}‏ الآية ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4367,
			"arabicnumber": 4367,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا ثابت، وقتادة، وحميد، عن أنس بن مالك، ذكر هذا الحديث قال أنس فلقد رأيت أحدهم يكدم الأرض بفيه عطشا حتى ماتوا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4368,
			"arabicnumber": 4368,
			"text": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن هشام، عن قتادة، عن أنس بن مالك، بهذا الحديث نحوه زاد ثم نهى عن المثلة ولم يذكر من خلاف ‏.‏ ورواه شعبة عن قتادة وسلام بن مسكين عن ثابت جميعا عن أنس لم يذكرا من خلاف ‏.‏ ولم أجد في حديث أحد قطع أيديهم وأرجلهم من خلاف ‏.‏ إلا في حديث حماد بن سلمة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4369,
			"arabicnumber": 4369,
			"text": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن سعيد بن أبي هلال، عن أبي الزناد، عن عبد الله بن عبيد الله، - قال أحمد هو يعني عبد الله بن عبيد الله بن عمر بن الخطاب - عن ابن عمر أن ناسا أغاروا على إبل النبي صلى الله عليه وسلم فاستاقوها وارتدوا عن الإسلام وقتلوا راعي رسول الله صلى الله عليه وسلم مؤمنا فبعث في آثارهم فأخذوا فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏ قال ونزلت فيهم آية المحاربة وهم الذين أخبر عنهم أنس بن مالك الحجاج حين سأله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4370,
			"arabicnumber": 4370,
			"text": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني الليث بن سعد، عن محمد بن العجلان، عن أبي الزناد، أن رسول الله صلى الله عليه وسلم لما قطع الذين سرقوا لقاحه وسمل أعينهم بالنار عاتبه الله تعالى في ذلك فأنزل الله تعالى ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا ‏}‏ الآية ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4371,
			"arabicnumber": 4371,
			"text": "حدثنا محمد بن كثير، قال أخبرنا ح، وحدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، عن محمد بن سيرين، قال كان هذا قبل أن تنزل الحدود يعني حديث أنس ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4372,
			"arabicnumber": 4372,
			"text": "حدثنا أحمد بن محمد بن ثابت، حدثنا علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا أو تقطع أيديهم وأرجلهم من خلاف أو ينفوا من الأرض ‏}‏ إلى قوله ‏{‏ غفور رحيم ‏}‏ نزلت هذه الآية في المشركين فمن تاب منهم قبل أن يقدر عليه لم يمنعه ذلك أن يقام فيه الحد الذي أصابه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4373,
			"arabicnumber": 4373,
			"text": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، قال حدثني ح، وحدثنا قتيبة بن سعيد الثقفي، حدثنا الليث، عن ابن شهاب، عن عروة، عن عائشة، رضى الله عنها أن قريشا، أهمهم شأن المرأة المخزومية التي سرقت فقالوا من يكلم فيها تعني رسول الله صلى الله عليه وسلم ‏.‏ قالوا ومن يجترئ إلا أسامة بن زيد حب رسول الله صلى الله عليه وسلم فكلمه أسامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أسامة أتشفع في حد من حدود الله ‏\"‏ ‏.‏ ثم قام فاختطب فقال ‏\"‏ إنما هلك الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه وإذا سرق فيهم الضعيف أقاموا عليه الحد وايم الله لو أن فاطمة بنت محمد سرقت لقطعت يدها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4374,
			"arabicnumber": 4374,
			"text": "حدثنا عباس بن عبد العظيم، ومحمد بن يحيى، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، رضى الله عنها قالت كانت امرأة مخزومية تستعير المتاع وتجحده فأمر النبي صلى الله عليه وسلم بقطع يدها وقص نحو حديث الليث قال فقطع النبي صلى الله عليه وسلم يدها ‏.‏ قال أبو داود روى ابن وهب هذا الحديث عن يونس عن الزهري وقال فيه كما قال الليث إن امرأة سرقت في عهد النبي صلى الله عليه وسلم في غزوة الفتح ‏.‏ ورواه الليث عن يونس عن ابن شهاب بإسناده فقال استعارت امرأة ‏.‏ وروى مسعود بن الأسود عن النبي صلى الله عليه وسلم نحو هذا الخبر قال سرقت قطيفة من بيت رسول الله صلى الله عليه وسلم ‏.‏ قال أبو داود ورواه أبو الزبير عن جابر أن امرأة سرقت فعاذت بزينب بنت رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4375,
			"arabicnumber": 4375,
			"text": "حدثنا جعفر بن مسافر، ومحمد بن سليمان الأنباري، قالا أخبرنا ابن أبي فديك، عن عبد الملك بن زيد، - نسبه جعفر إلى سعيد بن زيد بن عمرو بن نفيل - عن محمد بن أبي بكر، عن عمرة، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ أقيلوا ذوي الهيئات عثراتهم إلا الحدود ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4376,
			"arabicnumber": 4376,
			"text": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، قال سمعت ابن جريج، يحدث عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تعافوا الحدود فيما بينكم فما بلغني من حد فقد وجب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4377,
			"arabicnumber": 4377,
			"text": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن زيد بن أسلم، عن يزيد بن نعيم، عن أبيه، أن ماعزا، أتى النبي صلى الله عليه وسلم فأقر عنده أربع مرات فأمر برجمه وقال لهزال ‏ \"‏ لو سترته بثوبك كان خيرا لك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4378,
			"arabicnumber": 4378,
			"text": "حدثنا محمد بن عبيد، حدثنا حماد بن زيد، حدثنا يحيى، عن ابن المنكدر، أن هزالا، أمر ماعزا أن يأتي النبي صلى الله عليه وسلم فيخبره ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4379,
			"arabicnumber": 4379,
			"text": "حدثنا محمد بن يحيى بن فارس، حدثنا الفريابي، حدثنا إسرائيل، حدثنا سماك بن حرب، عن علقمة بن وائل، عن أبيه، أن امرأة، خرجت على عهد النبي صلى الله عليه وسلم تريد الصلاة فتلقاها رجل فتجللها فقضى حاجته منها فصاحت وانطلق فمر عليها رجل فقالت إن ذاك فعل بي كذا وكذا ومرت عصابة من المهاجرين فقالت إن ذلك الرجل فعل بي كذا وكذا ‏.‏ فانطلقوا فأخذوا الرجل الذي ظنت أنه وقع عليها فأتوها به فقالت نعم هو هذا ‏.‏ فأتوا به النبي صلى الله عليه وسلم فلما أمر به قام صاحبها الذي وقع عليها فقال يا رسول الله أنا صاحبها ‏.‏ فقال ‏\"‏ اذهبي فقد غفر الله لك ‏\"‏ ‏.‏ وقال للرجل قولا حسنا ‏.‏ قال أبو داود يعني الرجل المأخوذ وقال للرجل الذي وقع عليها ‏\"‏ ارجموه ‏\"‏ ‏.‏ فقال ‏\"‏ لقد تاب توبة لو تابها أهل المدينة لقبل منهم ‏\"‏ ‏.‏ قال أبو داود رواه أسباط بن نصر أيضا عن سماك ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4380,
			"arabicnumber": 4380,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن إسحاق بن عبد الله بن أبي طلحة، عن أبي المنذر، مولى أبي ذر عن أبي أمية المخزومي، أن النبي صلى الله عليه وسلم أتي بلص قد اعترف اعترافا ولم يوجد معه متاع فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما إخالك سرقت ‏\"‏ ‏.‏ قال بلى ‏.‏ فأعاد عليه مرتين أو ثلاثا فأمر به فقطع وجيء به فقال ‏\"‏ استغفر الله وتب إليه ‏\"‏ ‏.‏ فقال أستغفر الله وأتوب إليه فقال ‏\"‏ اللهم تب عليه ‏\"‏ ‏.‏ ثلاثا ‏.‏ قال أبو داود رواه عمرو بن عاصم عن همام عن إسحاق بن عبد الله قال عن أبي أمية رجل من الأنصار عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4381,
			"arabicnumber": 4381,
			"text": "حدثنا محمود بن خالد، حدثنا عمر بن عبد الواحد، عن الأوزاعي، قال حدثني أبو عمار، حدثني أبو أمامة، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إني أصبت حدا فأقمه على ‏.‏ قال ‏\"‏ توضأت حين أقبلت ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ هل صليت معنا حين صلينا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب فإن الله تعالى قد عفا عنك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4382,
			"arabicnumber": 4382,
			"text": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان، حدثنا أزهر بن عبد الله الحرازي، أن قوما، من الكلاعيين سرق لهم متاع فاتهموا أناسا من الحاكة فأتوا النعمان بن بشير صاحب النبي صلى الله عليه وسلم فحبسهم أياما ثم خلى سبيلهم فأتوا النعمان فقالوا خليت سبيلهم بغير ضرب ولا امتحان ‏.‏ فقال النعمان ما شئتم إن شئتم أن أضربهم فإن خرج متاعكم فذاك وإلا أخذت من ظهوركم مثل ما أخذت من ظهورهم ‏.‏ فقالوا هذا حكمك فقال هذا حكم الله وحكم رسوله صلى الله عليه وسلم ‏.‏ قال أبو داود إنما أرهبهم بهذا القول أى لا يجب الضرب إلا بعد الاعتراف ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4383,
			"arabicnumber": 4383,
			"text": "حدثنا أحمد بن محمد بن حنبل، حدثنا سفيان، عن الزهري، قال سمعته منه، عن عمرة، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم كان يقطع في ربع دينار فصاعدا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4384,
			"arabicnumber": 4384,
			"text": "حدثنا أحمد بن صالح، ووهب بن بيان، قالا حدثنا ح، وحدثنا ابن السرح، قال أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، وعمرة، عن عائشة، رضى الله عنها عن النبي صلى الله عليه وسلم قال ‏ \"‏ تقطع يد السارق في ربع دينار فصاعدا ‏\"‏ ‏.‏ قال أحمد بن صالح القطع في ربع دينار فصاعدا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4385,
			"arabicnumber": 4385,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قطع في مجن ثمنه ثلاثة دراهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4386,
			"arabicnumber": 4386,
			"text": "حدثنا أحمد بن حنبل، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني إسماعيل بن أمية، أن نافعا، مولى عبد الله بن عمر حدثه أن عبد الله بن عمر حدثهم أن النبي صلى الله عليه وسلم قطع يد رجل سرق ترسا من صفة النساء ثمنه ثلاثة دراهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4387,
			"arabicnumber": 4387,
			"text": "حدثنا عثمان بن أبي شيبة، ومحمد بن أبي السري العسقلاني، - وهذا لفظه وهو أتم - قالا حدثنا ابن نمير عن محمد بن إسحاق عن أيوب بن موسى عن عطاء عن ابن عباس قال قطع رسول الله صلى الله عليه وسلم يد رجل في مجن قيمته دينار أو عشرة دراهم ‏.‏ قال أبو داود رواه محمد بن سلمة وسعدان بن يحيى عن ابن إسحاق بإسناده ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4388,
			"arabicnumber": 4388,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، أن عبدا، سرق وديا من حائط رجل فغرسه في حائط سيده فخرج صاحب الودي يلتمس وديه فوجده فاستعدى على العبد مروان بن الحكم وهو أمير المدينة يومئذ فسجن مروان العبد وأراد قطع يده فانطلق سيد العبد إلى رافع بن خديج فسأله عن ذلك فأخبره أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ فقال الرجل إن مروان أخذ غلامي وهو يريد قطع يده وأنا أحب أن تمشي معي إليه فتخبره بالذي سمعت من رسول الله صلى الله عليه وسلم فمشى معه رافع بن خديج حتى أتى مروان بن الحكم فقال له رافع سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ فأمر مروان بالعبد فأرسل ‏.‏ قال أبو داود الكثر الجمار ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4389,
			"arabicnumber": 4389,
			"text": "حدثنا محمد بن عبيد، حدثنا حماد، حدثنا يحيى، عن محمد بن يحيى بن حبان، بهذا الحديث قال فجلده مروان جلدات وخلى سبيله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4390,
			"arabicnumber": 4390,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو بن العاص، عن رسول الله صلى الله عليه وسلم أنه سئل عن الثمر المعلق فقال ‏ \"‏ من أصاب بفيه من ذي حاجة غير متخذ خبنة فلا شىء عليه ومن خرج بشىء منه فعليه غرامة مثليه والعقوبة ومن سرق منه شيئا بعد أن يئويه الجرين فبلغ ثمن المجن فعليه القطع ومن سرق دون ذلك فعليه غرامة مثليه والعقوبة ‏\"‏ ‏.‏ قال أبو داود الجرين الجوخان ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4391,
			"arabicnumber": 4391,
			"text": "حدثنا نصر بن علي، أخبرنا محمد بن بكر، حدثنا ابن جريج، قال قال أبو الزبير قال جابر بن عبد الله قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس على المنتهب قطع ومن انتهب نهبة مشهورة فليس منا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4392,
			"arabicnumber": 4392,
			"text": "وبهذا الإسناد قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس على الخائن قطع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4393,
			"arabicnumber": 4393,
			"text": "حدثنا نصر بن علي، أخبرنا عيسى بن يونس، عن ابن جريج، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم بمثله زاد ‏ \"‏ ولا على المختلس قطع ‏\"‏ ‏.‏ قال أبو داود هذان الحديثان لم يسمعهما ابن جريج من أبي الزبير وبلغني عن أحمد بن حنبل أنه قال إنما سمعهما ابن جريج من ياسين الزيات ‏.‏ قال أبو داود وقد رواهما المغيرة بن مسلم عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4394,
			"arabicnumber": 4394,
			"text": "حدثنا محمد بن يحيى بن فارس، حدثنا عمرو بن حماد بن طلحة، حدثنا أسباط، عن سماك بن حرب، عن حميد ابن أخت، صفوان عن صفوان بن أمية، قال كنت نائما في المسجد على خميصة لي ثمن ثلاثين درهما فجاء رجل فاختلسها مني فأخذ الرجل فأتي به رسول الله صلى الله عليه وسلم فأمر به ليقطع ‏.‏ قال فأتيته فقلت أنقطعه من أجل ثلاثين درهما أنا أبيعه وأنسئه ثمنها قال ‏ \"‏ فهلا كان هذا قبل أن تأتيني به ‏\"‏ ‏.‏ قال أبو داود ورواه زائدة عن سماك عن جعيد بن جحير قال نام صفوان ‏.‏ ورواه مجاهد وطاوس أنه كان نائما فجاء سارق فسرق خميصة من تحت رأسه ‏.‏ ورواه أبو سلمة بن عبد الرحمن قال فاستله من تحت رأسه فاستيقظ فصاح به فأخذ ‏.‏ ورواه الزهري عن صفوان بن عبد الله قال فنام في المسجد وتوسد رداءه فجاءه سارق فأخذ رداءه فأخذ السارق فجيء به إلى النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4395,
			"arabicnumber": 4395,
			"text": "حدثنا الحسن بن علي، ومخلد بن خالد، - المعنى - قالا حدثنا عبد الرزاق، أخبرنا معمر، - قال مخلد عن معمر، - عن أيوب، عن نافع، عن ابن عمر، أن امرأة، مخزومية كانت تستعير المتاع وتجحده فأمر النبي صلى الله عليه وسلم بها فقطعت يدها ‏.‏ قال أبو داود رواه جويرية عن نافع عن ابن عمر أو عن صفية بنت أبي عبيد زاد فيه وأن النبي صلى الله عليه وسلم قام خطيبا فقال ‏ \"‏ هل من امرأة تائبة إلى الله عز وجل ورسوله ‏\"‏ ‏.‏ ثلاث مرات وتلك شاهدة فلم تقم ولم تتكلم ‏.‏ قال أبو داود ورواه ابن غنج عن نافع عن صفية بنت أبي عبيد قال فيه فشهد عليها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4396,
			"arabicnumber": 4396,
			"text": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو صالح، عن الليث، قال حدثني يونس، عن ابن شهاب، قال كان عروة يحدث أن عائشة رضى الله عنها قالت استعارت امرأة - تعني - حليا على ألسنة أناس يعرفون ولا تعرف هي فباعته فأخذت فأتي بها النبي صلى الله عليه وسلم فأمر بقطع يدها وهي التي شفع فيها أسامة بن زيد وقال فيها رسول الله صلى الله عليه وسلم ما قال ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4397,
			"arabicnumber": 4397,
			"text": "حدثنا عباس بن عبد العظيم، ومحمد بن يحيى، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، قالت كانت امرأة مخزومية تستعير المتاع وتجحده فأمر النبي صلى الله عليه وسلم بقطع يدها وقص نحو حديث قتيبة عن الليث عن ابن شهاب زاد فقطع النبي صلى الله عليه وسلم يدها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4398,
			"arabicnumber": 4398,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن حماد، عن إبراهيم، عن الأسود، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ رفع القلم عن ثلاثة عن النائم حتى يستيقظ وعن المبتلى حتى يبرأ وعن الصبي حتى يكبر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4399,
			"arabicnumber": 4399,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي ظبيان، عن ابن عباس، قال أتي عمر بمجنونة قد زنت فاستشار فيها أناسا فأمر بها عمر أن ترجم فمر بها على علي بن أبي طالب رضوان الله عليه فقال ما شأن هذه قالوا مجنونة بني فلان زنت فأمر بها عمر أن ترجم ‏.‏ قال فقال ارجعوا بها ثم أتاه فقال يا أمير المؤمنين أما علمت أن القلم قد رفع عن ثلاثة عن المجنون حتى يبرأ وعن النائم حتى يستيقظ وعن الصبي حتى يعقل قال بلى ‏.‏ قال فما بال هذه ترجم قال لا شىء ‏.‏ قال فأرسلها ‏.‏ قال فأرسلها ‏.‏ قال فجعل يكبر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4400,
			"arabicnumber": 4400,
			"text": "حدثنا يوسف بن موسى، حدثنا وكيع، عن الأعمش، نحوه وقال أيضا حتى يعقل ‏.‏ وقال وعن المجنون حتى يفيق ‏.‏ قال فجعل عمر يكبر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4401,
			"arabicnumber": 4401,
			"text": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن سليمان بن مهران، عن أبي ظبيان، عن ابن عباس، قال مر على علي بن أبي طالب رضى الله عنه بمعنى عثمان ‏.‏ قال أوما تذكر أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ رفع القلم عن ثلاثة عن المجنون المغلوب على عقله حتى يفيق وعن النائم حتى يستيقظ وعن الصبي حتى يحتلم ‏\"‏ ‏.‏ قال صدقت قال فخلى عنها سبيلها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4402,
			"arabicnumber": 4402,
			"text": "حدثنا هناد، عن أبي الأحوص، ح وحدثنا عثمان بن أبي شيبة، حدثنا جرير، - المعنى - عن عطاء بن السائب، عن أبي ظبيان، - قال هناد - الجنبي قال أتي عمر بامرأة قد فجرت فأمر برجمها فمر علي رضى الله عنه فأخذها فخلى سبيلها فأخبر عمر قال ادعوا لي عليا ‏.‏ فجاء علي رضى الله عنه فقال يا أمير المؤمنين لقد علمت أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ رفع القلم عن ثلاثة عن الصبي حتى يبلغ وعن النائم حتى يستيقظ وعن المعتوه حتى يبرأ ‏\"‏ ‏.‏ وإن هذه معتوهة بني فلان لعل الذي أتاها أتاها وهي في بلائها ‏.‏ قال فقال عمر لا أدري ‏.‏ فقال علي عليه السلام وأنا لا أدري ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4403,
			"arabicnumber": 4403,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن خالد، عن أبي الضحى، عن علي، عليه السلام عن النبي صلى الله عليه وسلم قال ‏\"‏ رفع القلم عن ثلاثة عن النائم حتى يستيقظ وعن الصبي حتى يحتلم وعن المجنون حتى يعقل ‏\"‏ ‏.‏ قال أبو داود رواه ابن جريج عن القاسم بن يزيد عن علي رضى الله عنه عن النبي صلى الله عليه وسلم زاد فيه ‏\"‏ والخرف ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4404,
			"arabicnumber": 4404,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، أخبرنا عبد الملك بن عمير، حدثني عطية القرظي، قال كنت من سبى بني قريظة فكانوا ينظرون فمن أنبت الشعر قتل ومن لم ينبت لم يقتل فكنت فيمن لم ينبت ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4405,
			"arabicnumber": 4405,
			"text": "حدثنا مسدد، حدثنا أبو عوانة، عن عبد الملك بن عمير، بهذا الحديث قال فكشفوا عانتي فوجدوها لم تنبت فجعلوني في السبى ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4406,
			"arabicnumber": 4406,
			"text": "حدثنا أحمد بن حنبل، حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم عرضه يوم أحد وهو ابن أربع عشرة سنة فلم يجزه وعرضه يوم الخندق وهو ابن خمس عشرة سنة فأجازه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4407,
			"arabicnumber": 4407,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، عن عبيد الله بن عمر، قال قال نافع حدثت بهذا الحديث، عمر بن عبد العزيز فقال إن هذا الحد بين الصغير والكبير ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4408,
			"arabicnumber": 4408,
			"text": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني حيوة بن شريح، عن عياش بن عباس القتباني، عن شييم بن بيتان، ويزيد بن صبح الأصبحي، عن جنادة بن أبي أمية، قال كنا مع بسر بن أرطاة في البحر فأتي بسارق يقال له مصدر قد سرق بختية فقال قد سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏ ولولا ذلك لقطعته ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4409,
			"arabicnumber": 4409,
			"text": "حدثنا مسدد، حدثنا حماد بن زيد، عن أبي عمران، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر ‏\"‏ ‏.‏ قلت لبيك يا رسول الله وسعديك ‏.‏ فقال ‏\"‏ كيف أنت إذا أصاب الناس موت يكون البيت فيه بالوصيف ‏\"‏ ‏.‏ يعني القبر ‏.‏ قلت الله ورسوله أعلم أو ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ عليك بالصبر ‏\"‏ ‏.‏ أو قال ‏\"‏ تصبر ‏\"‏ ‏.‏ قال أبو داود قال حماد بن أبي سليمان يقطع النباش لأنه دخل على الميت بيته ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4410,
			"arabicnumber": 4410,
			"text": "حدثنا محمد بن عبد الله بن عبيد بن عقيل الهلالي، حدثنا جدي، عن مصعب بن ثابت بن عبد الله بن الزبير، عن محمد بن المنكدر، عن جابر بن عبد الله، قال جيء بسارق إلى النبي صلى الله عليه وسلم فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ فقال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ قال فقطع ثم جيء به الثانية فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ فقال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ قال فقطع ثم جيء به الثالثة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ قال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ ثم أتي به الرابعة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ فقالوا يا رسول الله إنما سرق ‏.‏ قال ‏\"‏ اقطعوه ‏\"‏ ‏.‏ فأتي به الخامسة فقال ‏\"‏ اقتلوه ‏\"‏ ‏.‏ قال جابر فانطلقنا به فقتلناه ثم اجتررناه فألقيناه في بئر ورمينا عليه الحجارة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4411,
			"arabicnumber": 4411,
			"text": "حدثنا قتيبة بن سعيد، حدثنا عمر بن علي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألنا فضالة بن عبيد عن تعليق اليد، في العنق للسارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4412,
			"arabicnumber": 4412,
			"text": "حدثنا موسى، - يعني ابن إسماعيل - حدثنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا سرق المملوك فبعه ولو بنش ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4413,
			"arabicnumber": 4413,
			"text": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن الحسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ واللاتي يأتين الفاحشة من نسائكم فاستشهدوا عليهن أربعة منكم فإن شهدوا فأمسكوهن في البيوت حتى يتوفاهن الموت أو يجعل الله لهن سبيلا ‏}‏ وذكر الرجل بعد المرأة ثم جمعهما فقال ‏{‏ واللذان يأتيانها منكم فآذوهما فإن تابا وأصلحا فأعرضوا عنهما ‏}‏ فنسخ ذلك بآية الجلد فقال ‏{‏ الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4414,
			"arabicnumber": 4414,
			"text": "حدثنا أحمد بن محمد بن ثابت، حدثنا موسى، - يعني ابن مسعود - عن شبل، عن ابن أبي نجيح، عن مجاهد، قال السبيل الحد قال سفيان ‏{‏ فآذوهما ‏}‏ البكران ‏{‏ فأمسكوهن في البيوت ‏}‏ الثيبات ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4415,
			"arabicnumber": 4415,
			"text": "حدثنا مسدد، حدثنا يحيى، عن سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن حطان بن عبد الله الرقاشي، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خذوا عني خذوا عني قد جعل الله لهن سبيلا الثيب بالثيب جلد مائة ورمى بالحجارة والبكر بالبكر جلد مائة ونفى سنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4416,
			"arabicnumber": 4416,
			"text": "حدثنا وهب بن بقية، ومحمد بن الصباح بن سفيان، قالا حدثنا هشيم، عن منصور، عن الحسن، بإسناد يحيى ومعناه قالا ‏ \"‏ جلد مائة والرجم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4417,
			"arabicnumber": 4417,
			"text": "حدثنا محمد بن عوف الطائي، حدثنا الربيع بن روح بن خليد، حدثنا محمد بن خالد، - يعني الوهبي - حدثنا الفضل بن دلهم، عن الحسن، عن سلمة بن المحبق، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم بهذا الحديث فقال ناس لسعد بن عبادة يا أبا ثابت قد نزلت الحدود لو أنك وجدت مع امرأتك رجلا كيف كنت صانعا قال كنت ضاربهما بالسيف حتى يسكتا أفأنا أذهب فأجمع أربعة شهداء فإلى ذلك قد قضى الحاجة ‏.‏ فانطلقوا فاجتمعوا عند رسول الله صلى الله عليه وسلم فقالوا يا رسول الله ألم تر إلى أبي ثابت قال كذا وكذا فقال رسول الله صلى الله عليه وسلم ‏\"‏ كفى بالسيف شاهدا ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا لا أخاف أن يتتايع فيها السكران والغيران ‏\"‏ ‏.‏ قال أبو داود روى وكيع أول هذا الحديث عن الفضل بن دلهم عن الحسن عن قبيصة بن حريث عن سلمة بن المحبق عن النبي صلى الله عليه وسلم ‏.‏ وإنما هذا إسناد حديث ابن المحبق أن رجلا وقع على جارية امرأته ‏.‏ قال أبو داود الفضل بن دلهم ليس بالحافظ كان قصابا بواسط ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4418,
			"arabicnumber": 4418,
			"text": "حدثنا عبد الله بن محمد النفيلي، حدثنا هشيم، حدثنا الزهري، عن عبيد الله بن عبد الله بن عتبة، عن عبد الله بن عباس، أن عمر، - يعني ابن الخطاب - رضى الله عنه خطب فقال إن الله بعث محمدا صلى الله عليه وسلم بالحق وأنزل عليه الكتاب فكان فيما أنزل عليه آية الرجم فقرأناها ووعيناها ورجم رسول الله صلى الله عليه وسلم ورجمنا من بعده وإني خشيت - إن طال بالناس الزمان - أن يقول قائل ما نجد آية الرجم في كتاب الله فيضلوا بترك فريضة أنزلها الله تعالى فالرجم حق على من زنى من الرجال والنساء إذا كان محصنا إذا قامت البينة أو كان حمل أو اعتراف وايم الله لولا أن يقول الناس زاد عمر في كتاب الله عز وجل لكتبتها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4419,
			"arabicnumber": 4419,
			"text": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن هشام بن سعد، قال حدثني يزيد بن نعيم بن هزال، عن أبيه، قال كان ماعز بن مالك يتيما في حجر أبي ‏.‏ فأصاب جارية من الحى فقال له أبي ائت رسول الله صلى الله عليه وسلم فأخبره بما صنعت لعله يستغفر لك وإنما يريد بذلك رجاء أن يكون له مخرجا فأتاه فقال يا رسول الله إني زنيت فأقم على كتاب الله ‏.‏ فأعرض عنه فعاد فقال يا رسول الله إني زنيت فأقم على كتاب الله ‏.‏ حتى قالها أربع مرار ‏.‏ قال صلى الله عليه وسلم ‏\"‏ إنك قد قلتها أربع مرات فبمن ‏\"‏ ‏.‏ قال بفلانة ‏.‏ قال ‏\"‏ هل ضاجعتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ هل باشرتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ هل جامعتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال فأمر به أن يرجم فأخرج به إلى الحرة ‏.‏ فلما رجم فوجد مس الحجارة جزع فخرج يشتد فلقيه عبد الله بن أنيس وقد عجز أصحابه فنزع له بوظيف بعير فرماه به فقتله ثم أتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ هلا تركتموه لعله أن يتوب فيتوب الله عليه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4420,
			"arabicnumber": 4420,
			"text": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا يزيد بن زريع، عن محمد بن إسحاق، قال ذكرت لعاصم بن عمر بن قتادة قصة ماعز بن مالك فقال لي حدثني حسن بن محمد بن علي بن أبي طالب، قال حدثني ذلك، من قول رسول الله صلى الله عليه وسلم ‏\"‏ فهلا تركتموه ‏\"‏ ‏.‏ من شئتم من رجال أسلم ممن لا أتهم ‏.‏ قال ولم أعرف هذا الحديث قال فجئت جابر بن عبد الله فقلت إن رجالا من أسلم يحدثون أن رسول الله صلى الله عليه وسلم قال لهم حين ذكروا له جزع ماعز من الحجارة حين أصابته ‏\"‏ ألا تركتموه ‏\"‏ ‏.‏ وما أعرف الحديث قال يا ابن أخي أنا أعلم الناس بهذا الحديث كنت فيمن رجم الرجل إنا لما خرجنا به فرجمناه فوجد مس الحجارة صرخ بنا يا قوم ردوني إلى رسول الله صلى الله عليه وسلم فإن قومي قتلوني وغروني من نفسي وأخبروني أن رسول الله صلى الله عليه وسلم غير قاتلي فلم ننزع عنه حتى قتلناه فلما رجعنا إلى رسول الله صلى الله عليه وسلم وأخبرناه قال ‏\"‏ فهلا تركتموه وجئتموني به ‏\"‏ ‏.‏ ليستثبت رسول الله صلى الله عليه وسلم منه فأما لترك حد فلا قال فعرفت وجه الحديث ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4421,
			"arabicnumber": 4421,
			"text": "حدثنا أبو كامل، حدثنا يزيد بن زريع، حدثنا خالد، - يعني الحذاء - عن عكرمة، عن ابن عباس، أن ماعز بن مالك، أتى النبي صلى الله عليه وسلم فقال إنه زنى ‏.‏ فأعرض عنه فأعاد عليه مرارا فأعرض عنه فسأل قومه ‏\"‏ أمجنون هو ‏\"‏ ‏.‏ قالوا ليس به بأس ‏.‏ قال ‏\"‏ أفعلت بها ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمر به أن يرجم فانطلق به فرجم ولم يصل عليه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4422,
			"arabicnumber": 4422,
			"text": "حدثنا مسدد، حدثنا أبو عوانة، عن سماك، عن جابر بن سمرة، قال رأيت ماعز بن مالك حين جيء به إلى النبي صلى الله عليه وسلم رجلا قصيرا أعضل ليس عليه رداء فشهد على نفسه أربع مرات أنه قد زنى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلعلك قبلتها ‏\"‏ ‏.‏ قال لا والله إنه قد زنى الآخر ‏.‏ قال فرجمه ثم خطب فقال ‏\"‏ ألا كلما نفرنا في سبيل الله عز وجل خلف أحدهم له نبيب كنبيب التيس يمنح إحداهن الكثبة أما إن الله إن يمكني من أحد منهم إلا نكلته عنهن ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4423,
			"arabicnumber": 4423,
			"text": "حدثنا محمد بن المثنى، عن محمد بن جعفر، عن شعبة، عن سماك، قال سمعت جابر بن سمرة، بهذا الحديث والأول أتم قال فرده مرتين ‏.‏ قال سماك فحدثت به سعيد بن جبير فقال إنه رده أربع مرات ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4424,
			"arabicnumber": 4424,
			"text": "حدثنا عبد الغني بن أبي عقيل المصري، حدثنا خالد، - يعني ابن عبد الرحمن - قال قال شعبة فسألت سماكا عن الكثبة فقال اللبن القليل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4425,
			"arabicnumber": 4425,
			"text": "حدثنا مسدد، حدثنا أبو عوانة، عن سماك بن حرب، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لماعز بن مالك ‏\"‏ أحق ما بلغني عنك ‏\"‏ ‏.‏ قال وما بلغك عني قال ‏\"‏ بلغني عنك أنك وقعت على جارية بني فلان ‏\"‏ ‏.‏ قال نعم ‏.‏ فشهد أربع شهادات فأمر به فرجم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4426,
			"arabicnumber": 4426,
			"text": "حدثنا نصر بن علي، أخبرنا أبو أحمد، أخبرنا إسرائيل، عن سماك بن حرب، عن سعيد بن جبير، عن ابن عباس، قال جاء ماعز بن مالك إلى النبي صلى الله عليه وسلم فاعترف بالزنا مرتين فطرده ثم جاء فاعترف بالزنا مرتين فقال ‏ \"‏ شهدت على نفسك أربع مرات اذهبوا به فارجموه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4427,
			"arabicnumber": 4427,
			"text": "حدثنا موسى بن إسماعيل، حدثنا جرير، حدثني يعلى، عن عكرمة، أن النبي صلى الله عليه وسلم ح وحدثنا زهير بن حرب وعقبة بن مكرم قالا حدثنا وهب بن جرير حدثنا أبي قال سمعت يعلى بن حكيم يحدث عن عكرمة عن ابن عباس أن النبي صلى الله عليه وسلم قال لماعز بن مالك ‏\"‏ لعلك قبلت أو غمزت أو نظرت ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفنكتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال فعند ذلك أمر برجمه ‏.‏ ولم يذكر موسى عن ابن عباس وهذا لفظ وهب ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4428,
			"arabicnumber": 4428,
			"text": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، عن ابن جريج، قال أخبرني أبو الزبير، أن عبد الرحمن بن الصامت ابن عم أبي هريرة، أخبره أنه، سمع أبا هريرة، يقول جاء الأسلمي إلى نبي الله صلى الله عليه وسلم فشهد على نفسه أنه أصاب امرأة حراما أربع مرات كل ذلك يعرض عنه النبي صلى الله عليه وسلم فأقبل في الخامسة فقال ‏\"‏ أنكتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ حتى غاب ذلك منك في ذلك منها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ كما يغيب المرود في المكحلة والرشاء في البئر ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فهل تدري ما الزنا ‏\"‏ ‏.‏ قال نعم أتيت منها حراما ما يأتي الرجل من امرأته حلالا ‏.‏ قال ‏\"‏ فما تريد بهذا القول ‏\"‏ ‏.‏ قال أريد أن تطهرني ‏.‏ فأمر به فرجم فسمع النبي صلى الله عليه وسلم رجلين من أصحابه يقول أحدهما لصاحبه انظر إلى هذا الذي ستر الله عليه فلم تدعه نفسه حتى رجم رجم الكلب ‏.‏ فسكت عنهما ثم سار ساعة حتى مر بجيفة حمار شائل برجله فقال ‏\"‏ أين فلان وفلان ‏\"‏ ‏.‏ فقالا نحن ذان يا رسول الله ‏.‏ قال ‏\"‏ انزلا فكلا من جيفة هذا الحمار ‏\"‏ ‏.‏ فقالا يا نبي الله من يأكل من هذا قال ‏\"‏ فما نلتما من عرض أخيكما آنفا أشد من أكل منه والذي نفسي بيده إنه الآن لفي أنهار الجنة ينقمس فيها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4429,
			"arabicnumber": 4429,
			"text": "حدثنا الحسن بن علي، حدثنا أبو عاصم، حدثنا ابن جريج، قال أخبرنا أبو الزبير، عن ابن عم أبي هريرة، عن أبي هريرة، بنحوه زاد واختلفوا فقال بعضهم ربط إلى شجرة وقال بعضهم وقف ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4430,
			"arabicnumber": 4430,
			"text": "حدثنا محمد بن المتوكل العسقلاني، والحسن بن علي، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن جابر بن عبد الله، أن رجلا، من أسلم جاء إلى رسول الله صلى الله عليه وسلم فاعترف بالزنا فأعرض عنه ثم اعترف فأعرض عنه حتى شهد على نفسه أربع شهادات فقال له النبي صلى الله عليه وسلم ‏\"‏ أبك جنون ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أحصنت ‏\"‏ ‏.‏ قال نعم ‏.‏ قال فأمر به النبي صلى الله عليه وسلم فرجم في المصلى فلما أذلقته الحجارة فر فأدرك فرجم حتى مات فقال له النبي صلى الله عليه وسلم خيرا ولم يصل عليه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4431,
			"arabicnumber": 4431,
			"text": "حدثنا أبو كامل، حدثنا يزيد، - يعني ابن زريع - ح وحدثنا أحمد بن منيع، عن يحيى بن زكريا، - وهذا لفظه - عن داود، عن أبي نضرة، عن أبي سعيد، قال لما أمر النبي صلى الله عليه وسلم برجم ماعز بن مالك خرجنا به إلى البقيع فوالله ما أوثقناه ولا حفرنا له ولكنه قام لنا ‏.‏ - قال أبو كامل قال - فرميناه بالعظام والمدر والخزف فاشتد واشتددنا خلفه حتى أتى عرض الحرة فانتصب لنا فرميناه بجلاميد الحرة حتى سكت - قال - فما استغفر له ولا سبه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4432,
			"arabicnumber": 4432,
			"text": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن الجريري، عن أبي نضرة، قال جاء رجل إلى النبي صلى الله عليه وسلم نحوه وليس بتمامه قال ذهبوا يسبونه فنهاهم قال ذهبوا يستغفرون له فنهاهم قال ‏ \"‏ هو رجل أصاب ذنبا حسيبه الله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4433,
			"arabicnumber": 4433,
			"text": "حدثنا محمد بن أبي بكر بن أبي شيبة، حدثنا يحيى بن يعلى بن الحارث، حدثنا أبي، عن غيلان، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم استنكه ماعزا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4434,
			"arabicnumber": 4434,
			"text": "حدثنا أحمد بن إسحاق الأهوازي، حدثنا أبو أحمد، حدثنا بشير بن المهاجر، حدثني عبد الله بن بريدة، عن أبيه، قال كنا أصحاب رسول الله نتحدث أن الغامدية وماعز بن مالك لو رجعا بعد اعترافهما أو قال لو لم يرجعا بعد اعترافهما لم يطلبهما وإنما رجمهما عند الرابعة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4435,
			"arabicnumber": 4435,
			"text": "حدثنا عبدة بن عبد الله، ومحمد بن داود بن صبيح، قال عبدة أخبرنا حرمي بن حفص، قال حدثنا محمد بن عبد الله بن علاثة، حدثنا عبد العزيز بن عمر بن عبد العزيز، أن خالد بن اللجلاج، حدثه أن اللجلاج أباه أخبره أنه، كان قاعدا يعتمل في السوق فمرت امرأة تحمل صبيا فثار الناس معها وثرت فيمن ثار فانتهيت إلى النبي صلى الله عليه وسلم وهو يقول ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ فسكتت فقال شاب حذوها أنا أبوه يا رسول الله ‏.‏ فأقبل عليها فقال ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ قال الفتى أنا أبوه يا رسول الله ‏.‏ فنظر رسول الله صلى الله عليه وسلم إلى بعض من حوله يسألهم عنه فقالوا ما علمنا إلا خيرا ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أحصنت ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمر به فرجم ‏.‏ قال فخرجنا به فحفرنا له حتى أمكنا ثم رميناه بالحجارة حتى هدأ فجاء رجل يسأل عن المرجوم فانطلقنا به إلى النبي صلى الله عليه وسلم فقلنا هذا جاء يسأل عن الخبيث ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لهو أطيب عند الله من ريح المسك ‏\"‏ ‏.‏ فإذا هو أبوه فأعناه على غسله وتكفينه ودفنه وما أدري قال والصلاة عليه أم لا ‏.‏ وهذا حديث عبدة وهو أتم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4436,
			"arabicnumber": 4436,
			"text": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، ح وحدثنا نصر بن عاصم الأنطاكي، حدثنا الوليد، جميعا قالا حدثنا محمد، - قال هشام محمد بن عبد الله الشعيثي - عن مسلمة بن عبد الله الجهني، عن خالد بن اللجلاج، عن أبيه، عن النبي صلى الله عليه وسلم ببعض هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4437,
			"arabicnumber": 4437,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا طلق بن غنام، حدثنا عبد السلام بن حفص، حدثنا أبو حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم أن رجلا أتاه فأقر عنده أنه زنى بامرأة سماها له فبعث رسول الله صلى الله عليه وسلم إلى المرأة فسألها عن ذلك فأنكرت أن تكون زنت فجلده الحد وتركها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4438,
			"arabicnumber": 4438,
			"text": "حدثنا قتيبة بن سعيد، قال حدثنا ح، وحدثنا ابن السرح، - المعنى - قال أخبرنا عبد الله بن وهب، عن ابن جريج، عن أبي الزبير، عن جابر، أن رجلا، زنى بامرأة فأمر به النبي صلى الله عليه وسلم فجلد الحد ثم أخبر أنه محصن فأمر به فرجم ‏.‏ قال أبو داود روى هذا الحديث محمد بن بكر البرساني عن ابن جريج موقوفا على جابر ‏.‏ ورواه أبو عاصم عن ابن جريج بنحو ابن وهب لم يذكر النبي صلى الله عليه وسلم قال إن رجلا زنى فلم يعلم بإحصانه فجلد ثم علم بإحصانه فرجم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4439,
			"arabicnumber": 4439,
			"text": "حدثنا محمد بن عبد الرحيم أبو يحيى البزاز، أخبرنا أبو عاصم، عن ابن جريج، عن أبي الزبير، عن جابر، أن رجلا، زنى بامرأة فلم يعلم بإحصانه فجلد ثم علم بإحصانه فرجم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4440,
			"arabicnumber": 4440,
			"text": "حدثنا مسلم بن إبراهيم، أن هشاما الدستوائي، وأبان بن يزيد، حدثاهم - المعنى، - عن يحيى، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن امرأة، - قال في حديث أبان من جهينة - أتت النبي صلى الله عليه وسلم فقالت إنها زنت وهي حبلى ‏.‏ فدعا النبي صلى الله عليه وسلم وليا لها فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أحسن إليها فإذا وضعت فجئ بها ‏\"‏ ‏.‏ فلما أن وضعت جاء بها فأمر بها النبي صلى الله عليه وسلم فشكت عليها ثيابها ثم أمر بها فرجمت ثم أمرهم فصلوا عليها فقال عمر يا رسول الله تصلي عليها وقد زنت قال ‏\"‏ والذي نفسي بيده لقد تابت توبة لو قسمت بين سبعين من أهل المدينة لوسعتهم وهل وجدت أفضل من أن جادت بنفسها ‏\"‏ ‏.‏ لم يقل عن أبان فشكت عليها ثيابها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4441,
			"arabicnumber": 4441,
			"text": "حدثنا محمد بن الوزير الدمشقي، حدثنا الوليد، عن الأوزاعي، قال فشكت عليها ثيابها ‏.‏ يعني فشدت ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4442,
			"arabicnumber": 4442,
			"text": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى بن يونس، عن بشير بن المهاجر، حدثنا عبد الله بن بريدة، عن أبيه، أن امرأة، - يعني من غامد - أتت النبي صلى الله عليه وسلم فقالت إني قد فجرت ‏.‏ فقال ‏\"‏ ارجعي ‏\"‏ ‏.‏ فرجعت فلما كان الغد أتته فقالت لعلك أن تردني كما رددت ماعز بن مالك فوالله إني لحبلى ‏.‏ فقال لها ‏\"‏ ارجعي ‏\"‏ ‏.‏ فرجعت فلما كان الغد أتته فقال لها ‏\"‏ ارجعي حتى تلدي ‏\"‏ ‏.‏ فرجعت فلما ولدت أتته بالصبي فقالت هذا قد ولدته ‏.‏ فقال لها ‏\"‏ ارجعي فأرضعيه حتى تفطميه ‏\"‏ ‏.‏ فجاءت به وقد فطمته وفي يده شىء يأكله فأمر بالصبي فدفع إلى رجل من المسلمين وأمر بها فحفر لها وأمر بها فرجمت وكان خالد فيمن يرجمها فرجمها بحجر فوقعت قطرة من دمها على وجنته فسبها فقال له النبي صلى الله عليه وسلم ‏\"‏ مهلا يا خالد فوالذي نفسي بيده لقد تابت توبة لو تابها صاحب مكس لغفر له ‏\"‏ ‏.‏ وأمر بها فصلي عليها فدفنت ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4443,
			"arabicnumber": 4443,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع بن الجراح، عن زكريا أبي عمران، قال سمعت شيخا، يحدث عن ابن أبي بكرة، عن أبيه، أن النبي صلى الله عليه وسلم رجم امرأة فحفر لها إلى الثندوة ‏.‏ قال أبو داود أفهمني رجل عن عثمان ‏.‏ قال أبو داود قال الغساني جهينة وغامد وبارق واحد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4444,
			"arabicnumber": 4444,
			"text": "قال أبو داود حدثت عن عبد الصمد بن عبد الوارث، قال حدثنا زكريا بن سليم، بإسناده نحوه زاد ثم رماها بحصاة مثل الحمصة ثم قال ‏ \"‏ ارموا واتقوا الوجه ‏\"‏ ‏.‏ فلما طفئت أخرجها فصلى عليها وقال في التوبة نحو حديث بريدة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4445,
			"arabicnumber": 4445,
			"text": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد الجهني، أنهما أخبراه أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما يا رسول الله اقض بيننا بكتاب الله ‏.‏ وقال الآخر وكان أفقههما أجل يا رسول الله فاقض بيننا بكتاب الله وائذن لي أن أتكلم ‏.‏ قال ‏\"‏ تكلم ‏\"‏ ‏.‏ قال إن ابني كان عسيفا على هذا - والعسيف الأجير - فزنى بامرأته فأخبروني أنما على ابني الرجم فافتديت منه بمائة شاة وبجارية لي ثم إني سألت أهل العلم فأخبروني أنما على ابني جلد مائة وتغريب عام وإنما الرجم على امرأته ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والذي نفسي بيده لأقضين بينكما بكتاب الله أما غنمك وجاريتك فرد إليك ‏\"‏ ‏.‏ وجلد ابنه مائة وغربه عاما وأمر أنيسا الأسلمي أن يأتي امرأة الآخر فإن اعترفت رجمها فاعترفت فرجمها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4446,
			"arabicnumber": 4446,
			"text": "حدثنا عبد الله بن مسلمة، قال قرأت على مالك بن أنس عن نافع، عن ابن عمر، أنه قال إن اليهود جاءوا إلى النبي صلى الله عليه وسلم فذكروا له أن رجلا منهم وامرأة زنيا فقال لهم رسول الله صلى الله عليه وسلم ‏ \"‏ ما تجدون في التوراة في شأن الزنا ‏\"‏ ‏.‏ فقالوا نفضحهم ويجلدون ‏.‏ فقال عبد الله بن سلام كذبتم إن فيها الرجم ‏.‏ فأتوا بالتوراة فنشروها فجعل أحدهم يده على آية الرجم ثم جعل يقرأ ما قبلها وما بعدها فقال له عبد الله بن سلام ارفع يدك ‏.‏ فرفعها فإذا فيها آية الرجم فقالوا صدق يا محمد فيها آية الرجم ‏.‏ فأمر بهما رسول الله صلى الله عليه وسلم فرجما ‏.‏ قال عبد الله بن عمر فرأيت الرجل يحني على المرأة يقيها الحجارة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4447,
			"arabicnumber": 4447,
			"text": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، عن الأعمش، عن عبد الله بن مرة، عن البراء بن عازب، قال مروا على رسول الله صلى الله عليه وسلم بيهودي قد حمم وجهه وهو يطاف به فناشدهم ما حد الزاني في كتابهم قال فأحالوه على رجل منهم فنشده النبي صلى الله عليه وسلم ‏\"‏ ما حد الزاني في كتابكم ‏\"‏ ‏.‏ فقال الرجم ولكن ظهر الزنا في أشرافنا فكرهنا أن يترك الشريف ويقام على من دونه فوضعنا هذا عنا ‏.‏ فأمر به رسول الله صلى الله عليه وسلم فرجم ثم قال ‏\"‏ اللهم إني أول من أحيا ما أماتوا من كتابك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4448,
			"arabicnumber": 4448,
			"text": "حدثنا محمد بن العلاء، حدثنا أبو معاوية، عن الأعمش، عن عبد الله بن مرة، عن البراء بن عازب، قال مر على رسول الله صلى الله عليه وسلم بيهودي محمم مجلود فدعاهم فقال ‏\"‏ هكذا تجدون حد الزاني ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ فدعا رجلا من علمائهم قال له ‏\"‏ نشدتك بالله الذي أنزل التوراة على موسى هكذا تجدون حد الزاني في كتابكم ‏\"‏ ‏.‏ فقال اللهم لا ولولا أنك نشدتني بهذا لم أخبرك نجد حد الزاني في كتابنا الرجم ولكنه كثر في أشرافنا فكنا إذا أخذنا الرجل الشريف تركناه وإذا أخذنا الرجل الضعيف أقمنا عليه الحد فقلنا تعالوا فنجتمع على شىء نقيمه على الشريف والوضيع فاجتمعنا على التحميم والجلد وتركنا الرجم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم إني أول من أحيا أمرك إذ أماتوه ‏\"‏ ‏.‏ فأمر به فرجم فأنزل الله عز وجل ‏{‏ يا أيها الرسول لا يحزنك الذين يسارعون في الكفر ‏}‏ إلى قوله ‏{‏ يقولون إن أوتيتم هذا فخذوه وإن لم تؤتوه فاحذروا ‏}‏ إلى قوله ‏{‏ ومن لم يحكم بما أنزل الله فأولئك هم الكافرون ‏}‏ في اليهود إلى قوله ‏{‏ ومن لم يحكم بما أنزل الله فأولئك هم الظالمون ‏}‏ في اليهود إلى قوله ‏{‏ ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون ‏}‏ قال هي في الكفار كلها يعني هذه الآية ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4449,
			"arabicnumber": 4449,
			"text": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، حدثني هشام بن سعد، أن زيد بن أسلم، حدثه عن ابن عمر، قال أتى نفر من يهود فدعوا رسول الله صلى الله عليه وسلم إلى القف فأتاهم في بيت المدراس فقالوا يا أبا القاسم إن رجلا منا زنى بامرأة فاحكم بينهم فوضعوا لرسول الله صلى الله عليه وسلم وسادة فجلس عليها ثم قال ‏\"‏ ائتوني بالتوراة ‏\"‏ ‏.‏ فأتي بها فنزع الوسادة من تحته فوضع التوراة عليها ثم قال ‏\"‏ آمنت بك وبمن أنزلك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ائتوني بأعلمكم ‏\"‏ ‏.‏ فأتي بفتى شاب ثم ذكر قصة الرجم نحو حديث مالك عن نافع ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4450,
			"arabicnumber": 4450,
			"text": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال حدثنا رجل، من مزينة ح وحدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، قال قال محمد بن مسلم سمعت رجلا، من مزينة ممن يتبع العلم ويعيه - ثم اتفقا - ونحن عند سعيد بن المسيب فحدثنا عن أبي هريرة - وهذا حديث معمر وهو أتم - قال زنى رجل من اليهود وامرأة فقال بعضهم لبعض اذهبوا بنا إلى هذا النبي فإنه نبي بعث بالتخفيف فإن أفتانا بفتيا دون الرجم قبلناها واحتججنا بها عند الله قلنا فتيا نبي من أنبيائك - قال - فأتوا النبي صلى الله عليه وسلم وهو جالس في المسجد في أصحابه فقالوا يا أبا القاسم ما ترى في رجل وامرأة زنيا فلم يكلمهم كلمة حتى أتى بيت مدراسهم فقام على الباب فقال ‏\"‏ أنشدكم بالله الذي أنزل التوراة على موسى ما تجدون في التوراة على من زنى إذا أحصن ‏\"‏ ‏.‏ قالوا يحمم ويجبه ويجلد - والتجبية أن يحمل الزانيان على حمار وتقابل أقفيتهما ويطاف بهما - قال وسكت شاب منهم فلما رآه النبي صلى الله عليه وسلم سكت ألظ به النشدة فقال اللهم إذ نشدتنا فإنا نجد في التوراة الرجم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فما أول ما ارتخصتم أمر الله ‏\"‏ ‏.‏ قال زنى ذو قرابة مع ملك من ملوكنا فأخر عنه الرجم ثم زنى رجل في أسرة من الناس فأراد رجمه فحال قومه دونه وقالوا لا يرجم صاحبنا حتى تجيء بصاحبك فترجمه فاصطلحوا على هذه العقوبة بينهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فإني أحكم بما في التوراة ‏\"‏ ‏.‏ فأمر بهما فرجما ‏.‏ قال الزهري فبلغنا أن هذه الآية نزلت فيهم ‏{‏ إنا أنزلنا التوراة فيها هدى ونور يحكم بها النبيون الذين أسلموا ‏}‏ كان النبي صلى الله عليه وسلم منهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4451,
			"arabicnumber": 4451,
			"text": "حدثنا عبد العزيز بن يحيى أبو الأصبغ الحراني، قال حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن الزهري، قال سمعت رجلا، من مزينة يحدث سعيد بن المسيب عن أبي هريرة، قال زنى رجل وامرأة من اليهود وقد أحصنا حين قدم رسول الله صلى الله عليه وسلم المدينة وقد كان الرجم مكتوبا عليهم في التوراة فتركوه وأخذوا بالتجبية يضرب مائة بحبل مطلي بقار ويحمل على حمار وجهه مما يلي دبر الحمار فاجتمع أحبار من أحبارهم فبعثوا قوما آخرين إلى رسول الله صلى الله عليه وسلم فقالوا سلوه عن حد الزاني ‏.‏ وساق الحديث قال فيه قال ولم يكونوا من أهل دينه فيحكم بينهم فخير في ذلك قال ‏{‏ فإن جاءوك فاحكم بينهم أو أعرض عنهم ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4452,
			"arabicnumber": 4452,
			"text": "حدثنا يحيى بن موسى البلخي، حدثنا أبو أسامة، قال مجالد أخبرنا عن عامر، عن جابر بن عبد الله، قال جاءت اليهود برجل وامرأة منهم زنيا فقال ائتوني بأعلم رجلين منكم فأتوه بابنى صوريا فنشدهما ‏\"‏ كيف تجدان أمر هذين في التوراة ‏\"‏ ‏.‏ قالا نجد في التوراة إذا شهد أربعة أنهم رأوا ذكره في فرجها مثل الميل في المكحلة رجما ‏.‏ قال ‏\"‏ فما يمنعكما أن ترجموهما ‏\"‏ ‏.‏ قالا ذهب سلطاننا فكرهنا القتل فدعا رسول الله صلى الله عليه وسلم بالشهود فجاءوا بأربعة فشهدوا أنهم رأوا ذكره في فرجها مثل الميل في المكحلة فأمر رسول الله صلى الله عليه وسلم برجمهما ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4453,
			"arabicnumber": 4453,
			"text": "حدثنا وهب بن بقية، عن هشيم، عن مغيرة، عن إبراهيم، والشعبي، عن النبي صلى الله عليه وسلم نحوه لم يذكر فدعا بالشهود فشهدوا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4454,
			"arabicnumber": 4454,
			"text": "حدثنا وهب بن بقية، عن هشيم، عن ابن شبرمة، عن الشعبي، بنحو منه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4455,
			"arabicnumber": 4455,
			"text": "حدثنا إبراهيم بن حسن المصيصي، حدثنا حجاج بن محمد، قال حدثنا ابن جريج، أنه سمع أبا الزبير، سمع جابر بن عبد الله، يقول رجم النبي صلى الله عليه وسلم رجلا من اليهود وامرأة زنيا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4456,
			"arabicnumber": 4456,
			"text": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا مطرف، عن أبي الجهم، عن البراء بن عازب، قال بينا أنا أطوف، على إبل لي ضلت إذ أقبل ركب أو فوارس معهم لواء فجعل الأعراب يطيفون بي لمنزلتي من النبي صلى الله عليه وسلم إذ أتوا قبة فاستخرجوا منها رجلا فضربوا عنقه فسألت عنه فذكروا أنه أعرس بامرأة أبيه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4457,
			"arabicnumber": 4457,
			"text": "حدثنا عمرو بن قسيط الرقي، حدثنا عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عدي بن ثابت، عن يزيد بن البراء، عن أبيه، قال لقيت عمي ومعه راية فقلت له أين تريد قال بعثني رسول الله صلى الله عليه وسلم إلى رجل نكح امرأة أبيه فأمرني أن أضرب عنقه وآخذ ماله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4458,
			"arabicnumber": 4458,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبان، حدثنا قتادة، عن خالد بن عرفطة، عن حبيب بن سالم، أن رجلا، يقال له عبد الرحمن بن حنين وقع على جارية امرأته فرفع إلى النعمان بن بشير وهو أمير على الكوفة فقال لأقضين فيك بقضية رسول الله صلى الله عليه وسلم إن كانت أحلتها لك جلدتك مائة وإن لم تكن أحلتها لك رجمتك بالحجارة ‏.‏ فوجدوه قد أحلتها له فجلده مائة ‏.‏ قال قتادة كتبت إلى حبيب بن سالم فكتب إلى بهذا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4459,
			"arabicnumber": 4459,
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن أبي بشر، عن خالد بن عرفطة، عن حبيب بن سالم، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم في الرجل يأتي جارية امرأته قال ‏ \"‏ إن كانت أحلتها له جلد مائة وإن لم تكن أحلتها له رجمته ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4460,
			"arabicnumber": 4460,
			"text": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا معمر، عن قتادة، عن الحسن، عن قبيصة بن حريث، عن سلمة بن المحبق، أن رسول الله صلى الله عليه وسلم قضى في رجل وقع على جارية امرأته إن كان استكرهها فهي حرة وعليه لسيدتها مثلها فإن كانت طاوعته فهي له وعليه لسيدتها مثلها ‏.‏ قال أبو داود رواه يونس بن عبيد وعمرو بن دينار ومنصور بن زاذان وسلام عن الحسن هذا الحديث بمعناه لم يذكر يونس ومنصور قبيصة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4461,
			"arabicnumber": 4461,
			"text": "حدثنا علي بن الحسن الدرهمي، حدثنا عبد الأعلى، عن سعيد، عن قتادة، عن الحسن، عن سلمة بن المحبق، عن النبي صلى الله عليه وسلم نحوه إلا أنه قال وإن كانت طاوعته فهي حرة ومثلها من ماله لسيدتها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4462,
			"arabicnumber": 4462,
			"text": "حدثنا عبد الله بن محمد بن علي النفيلي، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من وجدتموه يعمل عمل قوم لوط فاقتلوا الفاعل والمفعول به ‏\"‏ ‏.‏ قال أبو داود رواه سليمان بن بلال عن عمرو بن أبي عمرو مثله ورواه عباد بن منصور عن عكرمة عن ابن عباس رفعه ورواه ابن جريج عن إبراهيم عن داود بن الحصين عن عكرمة عن ابن عباس رفعه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4463,
			"arabicnumber": 4463,
			"text": "حدثنا إسحاق بن إبراهيم بن راهويه، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن خثيم، قال سمعت سعيد بن جبير، ومجاهدا، يحدثان عن ابن عباس، في البكر يوجد على اللوطية قال يرجم ‏.‏ قال أبو داود حديث عاصم يضعف حديث عمرو بن أبي عمرو ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4464,
			"arabicnumber": 4464,
			"text": "حدثنا عبد الله بن محمد النفيلي، حدثنا عبد العزيز بن محمد، حدثني عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أتى بهيمة فاقتلوه واقتلوها معه ‏\"‏ ‏.‏ قال قلت له ما شأن البهيمة قال ما أراه إلا قال ذلك أنه كره أن يؤكل لحمها وقد عمل بها ذلك العمل ‏.‏ قال أبو داود ليس هذا بالقوي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4465,
			"arabicnumber": 4465,
			"text": "حدثنا أحمد بن يونس، أن شريكا، وأبا الأحوص، وأبا، بكر بن عياش حدثوهم عن عاصم، عن أبي رزين، عن ابن عباس، قال ليس على الذي يأتي البهيمة حد ‏.‏ قال أبو داود كذا قال عطاء وقال الحكم أرى أن يجلد ولا يبلغ به الحد ‏.‏ وقال الحسن هو بمنزلة الزاني ‏.‏ قال أبو داود حديث عاصم يضعف حديث عمرو بن أبي عمرو ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4466,
			"arabicnumber": 4466,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا طلق بن غنام، حدثنا عبد السلام بن حفص، حدثنا أبو حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم أن رجلا أتاه فأقر عنده أنه زنى بامرأة سماها له فبعث رسول الله صلى الله عليه وسلم إلى المرأة فسألها عن ذلك فأنكرت أن تكون زنت فجلده الحد وتركها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4467,
			"arabicnumber": 4467,
			"text": "حدثنا محمد بن يحيى بن فارس، حدثنا موسى بن هارون البردي، حدثنا هشام بن يوسف، عن القاسم بن فياض الأبناوي، عن خلاد بن عبد الرحمن، عن ابن المسيب، عن ابن عباس، أن رجلا، من بكر بن ليث أتى النبي صلى الله عليه وسلم فأقر أنه زنى بامرأة أربع مرات فجلده مائة وكان بكرا ثم سأله البينة على المرأة فقالت كذب والله يا رسول الله فجلده حد الفرية ثمانين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4468,
			"arabicnumber": 4468,
			"text": "حدثنا مسدد بن مسرهد، حدثنا أبو الأحوص، حدثنا سماك، عن إبراهيم، عن علقمة، والأسود، قالا قال عبد الله جاء رجل إلى النبي صلى الله عليه وسلم فقال إني عالجت امرأة من أقصى المدينة فأصبت منها ما دون أن أمسها فأنا هذا فأقم على ما شئت ‏.‏ فقال عمر قد ستر الله عليك لو سترت على نفسك ‏.‏ فلم يرد عليه النبي صلى الله عليه وسلم شيئا فانطلق الرجل فأتبعه النبي صلى الله عليه وسلم رجلا فدعاه فتلا عليه ‏{‏ وأقم الصلاة طرفى النهار وزلفا من الليل ‏}‏ إلى آخر الآية فقال رجل من القوم يا رسول الله أله خاصة أم للناس كافة فقال ‏\"‏ بل للناس كافة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4469,
			"arabicnumber": 4469,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، وزيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن الأمة إذا زنت ولم تحصن قال ‏ \"‏ إن زنت فاجلدوها ثم إن زنت فاجلدوها ثم إن زنت فاجلدوها ثم إن زنت فبيعوها ولو بضفير ‏\"‏ ‏.‏ قال ابن شهاب لا أدري في الثالثة أو الرابعة والضفير الحبل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4470,
			"arabicnumber": 4470,
			"text": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، حدثني سعيد بن أبي سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا زنت أمة أحدكم فليحدها ولا يعيرها ثلاث مرار فإن عادت في الرابعة فليجلدها وليبعها بضفير أو بحبل من شعر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4471,
			"arabicnumber": 4471,
			"text": "حدثنا ابن نفيل، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا الحديث قال في كل مرة ‏\"‏ فليضربها كتاب الله ولا يثرب عليها ‏\"‏ ‏.‏ وقال في الرابعة ‏\"‏ فإن عادت فليضربها كتاب الله ثم ليبعها ولو بحبل من شعر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4472,
			"arabicnumber": 4472,
			"text": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني أبو أمامة بن سهل بن حنيف، أنه أخبره بعض، أصحاب رسول الله صلى الله عليه وسلم من الأنصار أنه اشتكى رجل منهم حتى أضني فعاد جلدة على عظم فدخلت عليه جارية لبعضهم فهش لها فوقع عليها فلما دخل عليه رجال قومه يعودونه أخبرهم بذلك وقال استفتوا لي رسول الله صلى الله عليه وسلم فإني قد وقعت على جارية دخلت على ‏.‏ فذكروا ذلك لرسول الله صلى الله عليه وسلم وقالوا ما رأينا بأحد من الناس من الضر مثل الذي هو به لو حملناه إليك لتفسخت عظامه ما هو إلا جلد على عظم فأمر رسول الله صلى الله عليه وسلم أن يأخذوا له مائة شمراخ فيضربوه بها ضربة واحدة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4473,
			"arabicnumber": 4473,
			"text": "حدثنا محمد بن كثير، أخبرنا إسرائيل، حدثنا عبد الأعلى، عن أبي جميلة، عن علي، رضى الله عنه قال فجرت جارية لآل رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا علي انطلق فأقم عليها الحد ‏\"‏ ‏.‏ فانطلقت فإذا بها دم يسيل لم ينقطع فأتيته فقال ‏\"‏ يا علي أفرغت ‏\"‏ ‏.‏ قلت أتيتها ودمها يسيل ‏.‏ فقال ‏\"‏ دعها حتى ينقطع دمها ثم أقم عليها الحد وأقيموا الحدود على ما ملكت أيمانكم ‏\"‏ ‏.‏ قال أبو داود وكذلك رواه أبو الأحوص عن عبد الأعلى ورواه شعبة عن عبد الأعلى فقال فيه ‏\"‏ لا تضربها حتى تضع ‏\"‏ ‏.‏ والأول أصح ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4474,
			"arabicnumber": 4474,
			"text": "حدثنا قتيبة بن سعيد الثقفي، ومالك بن عبد الواحد المسمعي، - وهذا حديثه - أن ابن أبي عدي، حدثهم عن محمد بن إسحاق، عن عبد الله بن أبي بكر، عن عمرة، عن عائشة، رضى الله عنها قالت لما نزل عذري قام النبي صلى الله عليه وسلم على المنبر فذكر ذاك وتلا - تعني القرآن - فلما نزل من المنبر أمر بالرجلين والمرأة فضربوا حدهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4475,
			"arabicnumber": 4475,
			"text": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، بهذا الحديث لم يذكر عائشة قال فأمر برجلين وامرأة ممن تكلم بالفاحشة حسان بن ثابت ومسطح بن أثاثة ‏.‏ قال النفيلي ويقولون المرأة حمنة بنت جحش ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4476,
			"arabicnumber": 4476,
			"text": "حدثنا الحسن بن علي، ومحمد بن المثنى، - وهذا حديثه - قالا حدثنا أبو عاصم، عن ابن جريج، عن محمد بن علي بن ركانة، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لم يقت في الخمر حدا ‏.‏ وقال ابن عباس شرب رجل فسكر فلقي يميل في الفج فانطلق به إلى النبي صلى الله عليه وسلم فلما حاذى بدار العباس انفلت فدخل على العباس فالتزمه فذكر ذلك للنبي صلى الله عليه وسلم فضحك وقال ‏ \"‏ أفعلها ‏\"‏ ‏.‏ ولم يأمر فيه بشىء ‏.‏ قال أبو داود هذا مما تفرد به أهل المدينة حديث الحسن بن علي هذا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4477,
			"arabicnumber": 4477,
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو ضمرة، عن يزيد بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم أتي برجل قد شرب فقال ‏\"‏ اضربوه ‏\"‏ ‏.‏ قال أبو هريرة فمنا الضارب بيده والضارب بنعله والضارب بثوبه فلما انصرف قال بعض القوم أخزاك الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقولوا هكذا لا تعينوا عليه الشيطان ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4478,
			"arabicnumber": 4478,
			"text": "حدثنا محمد بن داود بن أبي ناجية الإسكندراني، حدثنا ابن وهب، أخبرني يحيى بن أيوب، وحيوة بن شريح، وابن، لهيعة عن ابن الهاد، بإسناده ومعناه قال فيه بعد الضرب ثم قال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ بكتوه ‏\"‏ ‏.‏ فأقبلوا عليه يقولون ما اتقيت الله ما خشيت الله وما استحيت من رسول الله صلى الله عليه وسلم ثم أرسلوه وقال في آخره ‏\"‏ ولكن قولوا اللهم اغفر له اللهم ارحمه ‏\"‏ ‏.‏ وبعضهم يزيد الكلمة ونحوها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4479,
			"arabicnumber": 4479,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا هشام، ح وحدثنا مسدد، حدثنا يحيى، عن هشام، - المعنى - عن قتادة، عن أنس بن مالك، أن النبي صلى الله عليه وسلم جلد في الخمر بالجريد والنعال وجلد أبو بكر رضى الله عنه أربعين فلما ولي عمر دعا الناس فقال لهم إن الناس قد دنوا من الريف - وقال مسدد من القرى والريف - فما ترون في حد الخمر فقال له عبد الرحمن بن عوف نرى أن تجعله كأخف الحدود ‏.‏ فجلد فيه ثمانين ‏.‏ قال أبو داود رواه ابن أبي عروبة عن قتادة عن النبي صلى الله عليه وسلم أنه جلد بالجريد والنعال أربعين ‏.‏ ورواه شعبة عن قتادة عن أنس عن النبي صلى الله عليه وسلم قال ضرب بجريدتين نحو الأربعين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4480,
			"arabicnumber": 4480,
			"text": "حدثنا مسدد بن مسرهد، وموسى بن إسماعيل، - المعنى - قالا حدثنا عبد العزيز بن المختار، حدثنا عبد الله الداناج، حدثني حضين بن المنذر الرقاشي، - هو أبو ساسان - قال شهدت عثمان بن عفان وأتي بالوليد بن عقبة فشهد عليه حمران ورجل آخر فشهد أحدهما أنه رآه شربها - يعني الخمر - وشهد الآخر أنه رآه يتقيأها فقال عثمان إنه لم يتقيأها حتى شربها ‏.‏ فقال لعلي رضى الله عنه أقم عليه الحد ‏.‏ فقال علي للحسن أقم عليه الحد ‏.‏ فقال الحسن ول حارها من تولى قارها ‏.‏ فقال علي لعبد الله بن جعفر أقم عليه الحد ‏.‏ قال فأخذ السوط فجلده وعلي يعد فلما بلغ أربعين قال حسبك جلد النبي صلى الله عليه وسلم أربعين - أحسبه قال - وجلد أبو بكر أربعين وعمر ثمانين وكل سنة وهذا أحب إلى ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4481,
			"arabicnumber": 4481,
			"text": "حدثنا مسدد، حدثنا يحيى، عن ابن أبي عروبة، عن الداناج، عن حضين بن المنذر، عن علي، رضى الله عنه قال جلد رسول الله صلى الله عليه وسلم في الخمر وأبو بكر أربعين وكملها عمر ثمانين وكل سنة ‏.‏ قال أبو داود وقال الأصمعي ول حارها من تولى قارها ول شديدها من تولى هينها ‏.‏ قال أبو داود هذا كان سيد قومه حضين بن المنذر أبو ساسان ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4482,
			"arabicnumber": 4482,
			"text": "حدثنا موسى بن إسماعيل، حدثنا أبان، عن عاصم، عن أبي صالح، ذكوان عن معاوية بن أبي سفيان، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا شربوا الخمر فاجلدوهم ثم إن شربوا فاجلدوهم ثم إن شربوا فاجلدوهم ثم إن شربوا فاقتلوهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4483,
			"arabicnumber": 4483,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حميد بن يزيد، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال بهذا المعنى قال وأحسبه قال في الخامسة ‏ \"‏ إن شربها فاقتلوه ‏\"‏ ‏.‏ قال أبو داود وكذا في حديث أبي غطيف في الخامسة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4484,
			"arabicnumber": 4484,
			"text": "حدثنا نصر بن عاصم الأنطاكي، حدثنا يزيد بن هارون الواسطي، حدثنا ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سكر فاجلدوه ثم إن سكر فاجلدوه ثم إن سكر فاجلدوه فإن عاد الرابعة فاقتلوه ‏\"‏ ‏.‏ قال أبو داود وكذا حديث عمر بن أبي سلمة عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إذا شرب الخمر فاجلدوه فإن عاد الرابعة فاقتلوه ‏\"‏ ‏.‏ قال أبو داود وكذا حديث سهيل عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إن شربوا الرابعة فاقتلوهم ‏\"‏ ‏.‏ وكذا حديث ابن أبي نعم عن ابن عمر عن النبي صلى الله عليه وسلم وكذا حديث عبد الله بن عمرو عن النبي صلى الله عليه وسلم والشريد عن النبي صلى الله عليه وسلم وفي حديث الجدلي عن معاوية أن النبي صلى الله عليه وسلم قال ‏\"‏ فإن عاد في الثالثة أو الرابعة فاقتلوه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4485,
			"arabicnumber": 4485,
			"text": "حدثنا أحمد بن عبدة الضبي، حدثنا سفيان، قال الزهري أخبرنا عن قبيصة بن ذؤيب، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من شرب الخمر فاجلدوه فإن عاد فاجلدوه فإن عاد فاجلدوه فإن عاد في الثالثة أو الرابعة فاقتلوه ‏\"‏ ‏.‏ فأتي برجل قد شرب فجلده ثم أتي به فجلده ثم أتي به فجلده ثم أتي به فجلده ورفع القتل فكانت رخصة ‏.‏ قال سفيان حدث الزهري بهذا الحديث وعنده منصور بن المعتمر ومخول بن راشد فقال لهما كونا وافدى أهل العراق بهذا الحديث ‏.‏ قال أبو داود روى هذا الحديث الشريد بن سويد وشرحبيل بن أوس وعبد الله بن عمرو وعبد الله بن عمر وأبو غطيف الكندي وأبو سلمة بن عبد الرحمن عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4486,
			"arabicnumber": 4486,
			"text": "حدثنا إسماعيل بن موسى الفزاري، حدثنا شريك، عن أبي حصين، عن عمير بن سعيد، عن علي، رضى الله عنه قال لا أدي - أو ما كنت لأدي - من أقمت عليه حدا إلا شارب الخمر فإن رسول الله صلى الله عليه وسلم لم يسن فيه شيئا إنما هو شىء قلناه نحن ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4487,
			"arabicnumber": 4487,
			"text": "حدثنا سليمان بن داود المهري المصري ابن أخي، رشدين بن سعد أخبرنا ابن وهب، أخبرنا أسامة بن زيد، أن ابن شهاب، حدثه عن عبد الرحمن بن أزهر، قال كأني أنظر إلى رسول الله صلى الله عليه وسلم الآن وهو في الرحال يلتمس رحل خالد بن الوليد فبينما هو كذلك إذ أتي برجل قد شرب الخمر فقال للناس ‏ \"‏ اضربوه ‏\"‏ ‏.‏ فمنهم من ضربه بالنعال ومنهم من ضربه بالعصا ومنهم من ضربه بالميتخة - قال ابن وهب الجريدة الرطبة - ثم أخذ رسول الله صلى الله عليه وسلم ترابا من الأرض فرمى به في وجهه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4488,
			"arabicnumber": 4488,
			"text": "حدثنا ابن السرح، قال وجدت في كتاب خالي عبد الرحمن بن عبد الحميد عن عقيل أن ابن شهاب أخبره أن عبد الله بن عبد الرحمن بن الأزهر أخبره عن أبيه قال أتي النبي صلى الله عليه وسلم بشارب وهو بحنين فحثى في وجهه التراب ثم أمر أصحابه فضربوه بنعالهم وما كان في أيديهم حتى قال لهم ‏ \"‏ ارفعوا ‏\"‏ ‏.‏ فرفعوا فتوفي رسول الله صلى الله عليه وسلم ثم جلد أبو بكر في الخمر أربعين ثم جلد عمر أربعين صدرا من إمارته ثم جلد ثمانين في آخر خلافته ثم جلد عثمان الحدين كليهما ثمانين وأربعين ثم أثبت معاوية الحد ثمانين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4489,
			"arabicnumber": 4489,
			"text": "حدثنا الحسن بن علي، حدثنا عثمان بن عمر، حدثنا أسامة بن زيد، عن الزهري، عن عبد الرحمن بن أزهر، قال رأيت رسول الله صلى الله عليه وسلم غداة الفتح وأنا غلام شاب يتخلل الناس يسأل عن منزل خالد بن الوليد فأتي بشارب فأمرهم فضربوه بما في أيديهم فمنهم من ضربه بالسوط ومنهم من ضربه بعصا ومنهم من ضربه بنعله وحثى رسول الله صلى الله عليه وسلم التراب فلما كان أبو بكر أتي بشارب فسألهم عن ضرب النبي صلى الله عليه وسلم الذي ضربه فحزروه أربعين فضرب أبو بكر أربعين فلما كان عمر كتب إليه خالد بن الوليد إن الناس قد انهمكوا في الشرب وتحاقروا الحد والعقوبة ‏.‏ قال هم عندك فسلهم ‏.‏ وعنده المهاجرون الأولون فسألهم فأجمعوا على أن يضرب ثمانين ‏.‏ قال وقال علي إن الرجل إذا شرب افترى فأرى أن يجعله كحد الفرية ‏.‏ قال أبو داود أدخل عقيل بن خالد بين الزهري وبين ابن الأزهر في هذا الحديث عبد الله بن عبد الرحمن بن الأزهر عن أبيه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4490,
			"arabicnumber": 4490,
			"text": "حدثنا هشام بن عمار، حدثنا صدقة، - يعني ابن خالد - حدثنا الشعيثي، عن زفر بن وثيمة، عن حكيم بن حزام، أنه قال نهى رسول الله صلى الله عليه وسلم أن يستقاد في المسجد وأن تنشد فيه الأشعار وأن تقام فيه الحدود ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4491,
			"arabicnumber": 4491,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن عبد الرحمن بن جابر بن عبد الله، عن أبي بردة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يجلد فوق عشر جلدات إلا في حد من حدود الله عز وجل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4492,
			"arabicnumber": 4492,
			"text": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، أن بكير بن الأشج، حدثه عن سليمان بن يسار، قال حدثني عبد الرحمن بن جابر، أن أباه، حدثه أنه، سمع أبا بردة الأنصاري، يقول سمعت رسول الله صلى الله عليه وسلم يقول فذكر معناه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4493,
			"arabicnumber": 4493,
			"text": "حدثنا أبو كامل، حدثنا أبو عوانة، عن عمر، - يعني ابن أبي سلمة - عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا ضرب أحدكم فليتق الوجه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 143
			}
		}
	]
}