{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4494,
			"arabicnumber": 4494,
			"text": "حدثنا محمد بن العلاء، حدثنا عبيد الله، - يعني ابن موسى - عن علي بن صالح، عن سماك بن حرب، عن عكرمة، عن ابن عباس، قال كان قريظة والنضير - وكان النضير أشرف من قريظة - فكان إذا قتل رجل من قريظة رجلا من النضير قتل به وإذا قتل رجل من النضير رجلا من قريظة فودي بمائة وسق من تمر فلما بعث النبي صلى الله عليه وسلم قتل رجل من النضير رجلا من قريظة فقالوا ادفعوه إلينا نقتله ‏.‏ فقالوا بيننا وبينكم النبي صلى الله عليه وسلم فأتوه فنزلت ‏{‏ وإن حكمت فاحكم بينهم بالقسط ‏}‏ والقسط النفس بالنفس ثم نزلت ‏{‏ أفحكم الجاهلية يبغون ‏}‏ ‏.‏ قال أبو داود قريظة والنضير جميعا من ولد هارون النبي عليه السلام ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4495,
			"arabicnumber": 4495,
			"text": "حدثنا أحمد بن يونس، حدثنا عبيد الله، - يعني ابن إياد - حدثنا إياد، عن أبي رمثة، قال انطلقت مع أبي نحو النبي صلى الله عليه وسلم ثم إن رسول الله صلى الله عليه وسلم قال لأبي ‏\"‏ ابنك هذا ‏\"‏ ‏.‏ قال إي ورب الكعبة قال ‏\"‏ حقا ‏\"‏ ‏.‏ قال أشهد به ‏.‏ قال فتبسم رسول الله صلى الله عليه وسلم ضاحكا من ثبت شبهي في أبي ومن حلف أبي على ‏.‏ ثم قال ‏\"‏ أما إنه لا يجني عليك ولا تجني عليه ‏\"‏ ‏.‏ وقرأ رسول الله صلى الله عليه وسلم ‏{‏ ولا تزر وازرة وزر أخرى ‏}‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4496,
			"arabicnumber": 4496,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا محمد بن إسحاق، عن الحارث بن فضيل، عن سفيان بن أبي العوجاء، عن أبي شريح الخزاعي، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من أصيب بقتل أو خبل فإنه يختار إحدى ثلاث إما أن يقتص وإما أن يعفو وإما أن يأخذ الدية فإن أراد الرابعة فخذوا على يديه ومن اعتدى بعد ذلك فله عذاب أليم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4497,
			"arabicnumber": 4497,
			"text": "حدثنا موسى بن إسماعيل، حدثنا عبد الله بن بكر بن عبد الله المزني، عن عطاء بن أبي ميمونة، عن أنس بن مالك، قال ما رأيت النبي صلى الله عليه وسلم رفع إليه شىء فيه قصاص إلا أمر فيه بالعفو ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4498,
			"arabicnumber": 4498,
			"text": "حدثنا عثمان بن أبي شيبة، أخبرنا أبو معاوية، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قتل رجل على عهد النبي صلى الله عليه وسلم فرفع ذلك إلى النبي صلى الله عليه وسلم فدفعه إلى ولي المقتول فقال القاتل يا رسول الله والله ما أردت قتله ‏.‏ قال فقال رسول الله صلى الله عليه وسلم للولي ‏ \"‏ أما إنه إن كان صادقا ثم قتلته دخلت النار ‏\"‏ ‏.‏ قال فخلى سبيله ‏.‏ قال وكان مكتوفا بنسعة فخرج يجر نسعته فسمي ذا النسعة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4499,
			"arabicnumber": 4499,
			"text": "حدثنا عبيد الله بن عمر بن ميسرة الجشمي، حدثنا يحيى بن سعيد، عن عوف، حدثنا حمزة أبو عمر العائذي، حدثني علقمة بن وائل، حدثني وائل بن حجر، قال كنت عند النبي صلى الله عليه وسلم إذ جيء برجل قاتل في عنقه النسعة قال فدعا ولي المقتول فقال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما ولى قال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب به ‏\"‏ ‏.‏ فلما كان في الرابعة قال ‏\"‏ أما إنك إن عفوت عنه يبوء بإثمه وإثم صاحبه ‏\"‏ ‏.‏ قال فعفا عنه ‏.‏ قال فأنا رأيته يجر النسعة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4500,
			"arabicnumber": 4500,
			"text": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا يحيى بن سعيد، قال حدثني جامع بن مطر، حدثني علقمة بن وائل، بإسناده ومعناه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4501,
			"arabicnumber": 4501,
			"text": "حدثنا محمد بن عوف الطائي، حدثنا عبد القدوس بن الحجاج، حدثنا يزيد بن عطاء الواسطي، عن سماك، عن علقمة بن وائل، عن أبيه، قال جاء رجل إلى النبي صلى الله عليه وسلم بحبشي فقال إن هذا قتل ابن أخي ‏.‏ قال ‏\"‏ كيف قتلته ‏\"‏ ‏.‏ قال ضربت رأسه بالفأس ولم أرد قتله ‏.‏ قال ‏\"‏ هل لك مال تؤدي ديته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أفرأيت إن أرسلتك تسأل الناس تجمع ديته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فمواليك يعطونك ديته ‏\"‏ ‏.‏ قال لا ‏.‏ قال للرجل ‏\"‏ خذه ‏\"‏ ‏.‏ فخرج به ليقتله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنه إن قتله كان مثله ‏\"‏ ‏.‏ فبلغ به الرجل حيث يسمع قوله فقال هو ذا فمر فيه ما شئت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله - وقال مرة دعه - يبوء بإثم صاحبه وإثمه فيكون من أصحاب النار ‏\"‏ ‏.‏ قال فأرسله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4502,
			"arabicnumber": 4502,
			"text": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن أبي أمامة بن سهل، قال كنا مع عثمان وهو محصور في الدار وكان في الدار مدخل من دخله سمع كلام من على البلاط فدخله عثمان فخرج إلينا وهو متغير لونه فقال إنهم ليتواعدونني بالقتل آنفا ‏.‏ قلنا يكفيكهم الله يا أمير المؤمنين ‏.‏ قال ولم يقتلونني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث كفر بعد إسلام أو زنا بعد إحصان أو قتل نفس بغير نفس ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا إسلام قط ولا أحببت أن لي بديني بدلا منذ هداني الله ولا قتلت نفسا فبم يقتلونني قال أبو داود عثمان وأبو بكر رضى الله عنهما تركا الخمر في الجاهلية ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4503,
			"arabicnumber": 4503,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، قال حدثنا محمد بن إسحاق، فحدثني محمد بن جعفر بن الزبير، قال سمعت زياد بن ضميرة الضمري، ح وحدثنا وهب بن بيان، وأحمد بن سعيد الهمداني، قالا حدثنا ابن وهب، أخبرني عبد الرحمن بن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر، أنه سمع زياد بن سعد بن ضميرة السلمي، - وهذا حديث وهب وهو أتم - يحدث عروة بن الزبير عن أبيه - قال موسى - وجده وكانا شهدا مع رسول الله صلى الله عليه وسلم حنينا - ثم رجعنا إلى حديث وهب - أن محلم بن جثامة الليثي قتل رجلا من أشجع في الإسلام وذلك أول غير قضى به رسول الله صلى الله عليه وسلم فتكلم عيينة في قتل الأشجعي لأنه من غطفان وتكلم الأقرع بن حابس دون محلم لأنه من خندف فارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة لا والله حتى أدخل على نسائه من الحرب والحزن ما أدخل على نسائي ‏.‏ قال ثم ارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة مثل ذلك أيضا إلى أن قام رجل من بني ليث يقال له مكيتل عليه شكة وفي يده درقة فقال يا رسول الله إني لم أجد لما فعل هذا في غرة الإسلام مثلا إلا غنما وردت فرمي أولها فنفر آخرها اسنن اليوم وغير غدا فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمسون في فورنا هذا وخمسون إذا رجعنا إلى المدينة ‏\"‏ ‏.‏ وذلك في بعض أسفاره ومحلم رجل طويل آدم وهو في طرف الناس فلم يزالوا حتى تخلص فجلس بين يدى رسول الله صلى الله عليه وسلم وعيناه تدمعان فقال يا رسول الله إني قد فعلت الذي بلغك وإني أتوب إلى الله تبارك وتعالى فاستغفر الله عز وجل لي يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته بسلاحك في غرة الإسلام اللهم لا تغفر لمحلم ‏\"‏ ‏.‏ بصوت عال زاد أبو سلمة فقام وإنه ليتلقى دموعه بطرف ردائه قال ابن إسحاق فزعم قومه أن رسول الله صلى الله عليه وسلم استغفر له بعد ذلك ‏.‏ قال أبو داود قال النضر بن شميل الغير الدية ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4504,
			"arabicnumber": 4504,
			"text": "حدثنا مسدد بن مسرهد، حدثنا يحيى بن سعيد، حدثنا ابن أبي ذئب، قال حدثني سعيد بن أبي سعيد، قال سمعت أبا شريح الكعبي، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ألا إنكم يا معشر خزاعة قتلتم هذا القتيل من هذيل وإني عاقله فمن قتل له بعد مقالتي هذه قتيل فأهله بين خيرتين أن يأخذوا العقل أو يقتلوا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4505,
			"arabicnumber": 4505,
			"text": "حدثنا عباس بن الوليد بن مزيد، أخبرنا أبي، حدثنا الأوزاعي، حدثني يحيى، ح وحدثنا أحمد بن إبراهيم، حدثني أبو داود، حدثنا حرب بن شداد، حدثنا يحيى بن أبي كثير، حدثني أبو سلمة بن عبد الرحمن، حدثنا أبو هريرة، قال لما فتحت مكة قام رسول الله صلى الله عليه وسلم فقال ‏\"‏ من قتل له قتيل فهو بخير النظرين إما أن يودى أو يقاد ‏\"‏ ‏.‏ فقام رجل من أهل اليمن يقال له أبو شاه فقال يا رسول الله اكتب لي - قال العباس اكتبوا لي - فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏ ‏.‏ وهذا لفظ حديث أحمد ‏.‏ قال أبو داود اكتبوا لي يعني خطبة النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4506,
			"arabicnumber": 4506,
			"text": "حدثنا مسلم، حدثنا محمد بن راشد، حدثنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يقتل مؤمن بكافر ومن قتل مؤمنا متعمدا دفع إلى أولياء المقتول فإن شاءوا قتلوه وإن شاءوا أخذوا الدية ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4507,
			"arabicnumber": 4507,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا مطر الوراق، - وأحسبه - عن الحسن، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا أعفي من قتل بعد أخذه الدية ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4508,
			"arabicnumber": 4508,
			"text": "حدثنا يحيى بن حبيب بن عربي، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، يهودية أتت رسول الله صلى الله عليه وسلم بشاة مسمومة فأكل منها فجيء بها إلى رسول الله صلى الله عليه وسلم فسألها عن ذلك فقالت أردت لأقتلك ‏.‏ فقال ‏\"‏ ما كان الله ليسلطك على ذلك ‏\"‏ ‏.‏ أو قال ‏\"‏ على ‏\"‏ ‏.‏ قال فقالوا ألا نقتلها قال ‏\"‏ لا ‏\"‏ ‏.‏ فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4509,
			"arabicnumber": 4509,
			"text": "حدثنا داود بن رشيد، حدثنا عباد بن العوام، ح وحدثنا هارون بن عبد الله، حدثنا سعيد بن سليمان، حدثنا عباد، عن سفيان بن حسين، عن الزهري، عن سعيد، وأبي، سلمة - قال هارون - عن أبي هريرة، أن امرأة، من اليهود أهدت إلى النبي صلى الله عليه وسلم شاة مسمومة - قال - فما عرض لها النبي صلى الله عليه وسلم ‏.‏ قال أبو داود هذه أخت مرحب اليهودية التي سمت النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4510,
			"arabicnumber": 4510,
			"text": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال كان جابر بن عبد الله يحدث أن يهودية، من أهل خيبر سمت شاة مصلية ثم أهدتها لرسول الله صلى الله عليه وسلم فأخذ رسول الله صلى الله عليه وسلم الذراع فأكل منها وأكل رهط من أصحابه معه ثم قال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ارفعوا أيديكم ‏\"‏ ‏.‏ وأرسل رسول الله صلى الله عليه وسلم إلى اليهودية فدعاها فقال لها ‏\"‏ أسممت هذه الشاة ‏\"‏ ‏.‏ قالت اليهودية من أخبرك قال ‏\"‏ أخبرتني هذه في يدي ‏\"‏ ‏.‏ للذراع ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ فما أردت إلى ذلك ‏\"‏ ‏.‏ قالت قلت إن كان نبيا فلن يضره وإن لم يكن استرحنا منه ‏.‏ فعفا عنها رسول الله صلى الله عليه وسلم ولم يعاقبها وتوفي بعض أصحابه الذين أكلوا من الشاة واحتجم رسول الله صلى الله عليه وسلم على كاهله من أجل الذي أكل من الشاة حجمه أبو هند بالقرن والشفرة وهو مولى لبني بياضة من الأنصار ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4511,
			"arabicnumber": 4511,
			"text": "حدثنا وهب بن بقية، حدثنا خالد، عن محمد بن عمرو، عن أبي سلمة، أن رسول الله صلى الله عليه وسلم أهدت له يهودية بخيبر شاة مصلية نحو حديث جابر قال فمات بشر بن البراء بن معرور الأنصاري فأرسل إلى اليهودية ‏ \"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ فذكر نحو حديث جابر فأمر بها رسول الله صلى الله عليه وسلم فقتلت ولم يذكر أمر الحجامة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4512,
			"arabicnumber": 4512,
			"text": "حدثنا وهب بن بقية، عن خالد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يقبل الهدية ولا يأكل الصدقة ‏.‏ وحدثنا وهب بن بقية في موضع آخر عن خالد عن محمد بن عمرو عن أبي سلمة ولم يذكر أبا هريرة قال كان رسول الله صلى الله عليه وسلم يقبل الهدية ولا يأكل الصدقة ‏.‏ زاد فأهدت له يهودية بخيبر شاة مصلية سمتها فأكل رسول الله صلى الله عليه وسلم منها وأكل القوم فقال ‏\"‏ ارفعوا أيديكم فإنها أخبرتني أنها مسمومة ‏\"‏ ‏.‏ فمات بشر بن البراء بن معرور الأنصاري فأرسل إلى اليهودية ‏\"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ قالت إن كنت نبيا لم يضرك الذي صنعت وإن كنت ملكا أرحت الناس منك ‏.‏ فأمر بها رسول الله صلى الله عليه وسلم فقتلت ثم قال في وجعه الذي مات فيه ‏\"‏ ما زلت أجد من الأكلة التي أكلت بخيبر فهذا أوان قطعت أبهري ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": 4513,
			"text": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن ابن كعب بن مالك، عن أبيه، أن أم مبشر، قالت للنبي صلى الله عليه وسلم في مرضه الذي مات فيه ما يتهم بك يا رسول الله فإني لا أتهم بابني شيئا إلا الشاة المسمومة التي أكل معك بخيبر ‏.‏ وقال النبي صلى الله عليه وسلم ‏ \"‏ وأنا لا أتهم بنفسي إلا ذلك فهذا أوان قطعت أبهري ‏\"‏ ‏.‏ قال أبو داود وربما حدث عبد الرزاق بهذا الحديث مرسلا عن معمر عن الزهري عن النبي صلى الله عليه وسلم وربما حدث به عن الزهري عن عبد الرحمن بن كعب بن مالك وذكر عبد الرزاق أن معمرا كان يحدثهم بالحديث مرة مرسلا فيكتبونه ويحدثهم مرة به فيسنده فيكتبونه وكل صحيح عندنا قال عبد الرزاق فلما قدم ابن المبارك على معمر أسند له معمر أحاديث كان يوقفها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": 4514,
			"text": "حدثنا أحمد بن حنبل، حدثنا إبراهيم بن خالد، حدثنا رباح، عن معمر، عن الزهري، عن عبد الرحمن بن عبد الله بن كعب بن مالك، عن أمه، أن أم مبشر، - قال أبو سعيد بن الأعرابي كذا قال عن أمه، والصواب، عن أبيه، عن أم مبشر، - دخلت على النبي صلى الله عليه وسلم فذكر معنى حديث مخلد بن خالد نحو حديث جابر قال فمات بشر بن البراء بن معرور فأرسل إلى اليهودية فقال ‏ \"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ فذكر نحو حديث جابر فأمر بها رسول الله صلى الله عليه وسلم فقتلت ولم يذكر الحجامة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4515,
			"arabicnumber": 4515,
			"text": "حدثنا علي بن الجعد، حدثنا شعبة، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، عن قتادة، عن الحسن، عن سمرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من قتل عبده قتلناه ومن جدع عبده جدعناه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4516,
			"arabicnumber": 4516,
			"text": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، بإسناده مثله قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من خصى عبده خصيناه ‏\"‏ ‏.‏ ثم ذكر مثل حديث شعبة وحماد ‏.‏ قال أبو داود ورواه أبو داود الطيالسي عن هشام مثل حديث معاذ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 4517,
			"arabicnumber": 4517,
			"text": "حدثنا الحسن بن علي، حدثنا سعيد بن عامر، عن ابن أبي عروبة، عن قتادة، بإسناد شعبة مثله زاد ثم إن الحسن نسي هذا الحديث فكان يقول ‏ \"‏ لا يقتل حر بعبد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 4518,
			"arabicnumber": 4518,
			"text": "حدثنا مسلم بن إبراهيم، حدثنا هشام، عن قتادة، عن الحسن، قال لا يقاد الحر بالعبد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 4519,
			"arabicnumber": 4519,
			"text": "حدثنا محمد بن الحسن بن تسنيم العتكي، حدثنا محمد بن بكر، أخبرنا سوار أبو حمزة، حدثنا عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل مستصرخ إلى النبي صلى الله عليه وسلم فقال جارية له يا رسول الله ‏.‏ فقال ‏\"‏ ويحك ما لك ‏\"‏ ‏.‏ قال شرا أبصر لسيده جارية له فغار فجب مذاكيره ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ على بالرجل ‏\"‏ ‏.‏ فطلب فلم يقدر عليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ اذهب فأنت حر ‏\"‏ ‏.‏ فقال يا رسول الله على من نصرتي قال ‏\"‏ على كل مؤمن ‏\"‏ ‏.‏ أو قال ‏\"‏ كل مسلم ‏\"‏ ‏.‏ قال أبو داود الذي عتق كان اسمه روح بن دينار ‏.‏ قال أبو داود الذي جبه زنباع ‏.‏ قال أبو داود هذا زنباع أبو روح كان مولى العبد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 4520,
			"arabicnumber": 4520,
			"text": "حدثنا عبيد الله بن عمر بن ميسرة، ومحمد بن عبيد، - المعنى - قالا حدثنا حماد بن زيد، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد الله بن سهل، انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن بن سهل وابنا عمه حويصة ومحيصة فأتوا النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغرهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ أو قال ‏\"‏ ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال قال سهل دخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏ قال أبو داود رواه بشر بن المفضل ومالك عن يحيى بن سعيد قال فيه ‏\"‏ أتحلفون خمسين يمينا وتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ولم يذكر بشر دما وقال عبدة عن يحيى كما قال حماد ورواه ابن عيينة عن يحيى فبدأ بقوله ‏\"‏ تبرئكم يهود بخمسين يمينا يحلفون ‏\"‏ ‏.‏ ولم يذكر الاستحقاق قال أبو داود وهذا وهم من ابن عيينة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 4521,
			"arabicnumber": 4521,
			"text": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني مالك، عن أبي ليلى بن عبد الله بن عبد الرحمن بن سهل، عن سهل بن أبي حثمة، أنه أخبره هو، ورجال، من كبراء قومه أن عبد الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في فقير أو عين فأتى يهود فقال أنتم والله قتلتموه ‏.‏ قالوا والله ما قتلناه ‏.‏ فأقبل حتى قدم على قومه فذكر لهم ذلك ثم أقبل هو وأخوه حويصة - وهو أكبر منه - وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر كبر ‏\"‏ ‏.‏ يريد السن فتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب إليهم رسول الله صلى الله عليه وسلم بذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ أتحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا مسلمين فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم مائة ناقة حتى أدخلت عليهم الدار ‏.‏ قال سهل لقد ركضتني منها ناقة حمراء ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 4522,
			"arabicnumber": 4522,
			"text": "حدثنا محمود بن خالد، وكثير بن عبيد، قالا حدثنا ح، وحدثنا محمد بن الصباح بن سفيان، أخبرنا الوليد، عن أبي عمرو، عن عمرو بن شعيب، عن رسول الله صلى الله عليه وسلم أنه قتل بالقسامة رجلا من بني نصر بن مالك ببحرة الرغاء على شط لية البحرة قال القاتل والمقتول منهم ‏.‏ وهذا لفظ محمود ببحرة أقامه محمود وحده على شط لية البحرة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 4523,
			"arabicnumber": 4523,
			"text": "حدثنا الحسن بن محمد بن الصباح الزعفراني، حدثنا أبو نعيم، حدثنا سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا فقالوا للذين وجدوه عندهم قتلتم صاحبنا فقالوا ما قتلناه ولا علمنا قاتلا ‏.‏ فانطلقنا إلى نبي الله صلى الله عليه وسلم قال فقال لهم ‏\"‏ تأتوني بالبينة على من قتل هذا ‏\"‏ ‏.‏ قالوا ما لنا بينة ‏.‏ قال ‏\"‏ فيحلفون لكم ‏\"‏ ‏.‏ قالوا لا نرضى بأيمان اليهود ‏.‏ فكره نبي الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 4524,
			"arabicnumber": 4524,
			"text": "حدثنا الحسن بن علي بن راشد، أخبرنا هشيم، عن أبي حيان التيمي، حدثنا عباية بن رفاعة، عن رافع بن خديج، قال أصبح رجل من الأنصار مقتولا بخيبر فانطلق أولياؤه إلى النبي صلى الله عليه وسلم فذكروا ذلك له فقال ‏\"‏ لكم شاهدان يشهدان على قتل صاحبكم ‏\"‏ ‏.‏ قالوا يا رسول الله لم يكن ثم أحد من المسلمين وإنما هم يهود وقد يجترئون على أعظم من هذا ‏.‏ قال ‏\"‏ فاختاروا منهم خمسين فاستحلفوهم ‏\"‏ ‏.‏ فأبوا فوداه النبي صلى الله عليه وسلم من عنده ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 4525,
			"arabicnumber": 4525,
			"text": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم بن الحارث، عن عبد الرحمن بن بجيد، قال إن سهلا والله أوهم الحديث إن رسول الله صلى الله عليه وسلم كتب إلى يهود ‏ \"‏ أنه قد وجد بين أظهركم قتيل فدوه ‏\"‏ ‏.‏ فكتبوا يحلفون بالله خمسين يمينا ما قتلناه ولا علمنا قاتلا ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من عنده مائة ناقة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Munqar"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 4526,
			"arabicnumber": 4526,
			"text": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، وسليمان بن يسار، عن رجال، من الأنصار أن النبي صلى الله عليه وسلم قال لليهود وبدأ بهم ‏\"‏ يحلف منكم خمسون رجلا ‏\"‏ ‏.‏ فأبوا فقال للأنصار ‏\"‏ استحقوا ‏\"‏ ‏.‏ قالوا نحلف على الغيب يا رسول الله فجعلها رسول الله صلى الله عليه وسلم دية على يهود لأنه وجد بين أظهرهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 4527,
			"arabicnumber": 4527,
			"text": "حدثنا محمد بن كثير، أخبرنا همام، عن قتادة، عن أنس، أن جارية، وجدت، قد رض رأسها بين حجرين فقيل لها من فعل بك هذا أفلان أفلان حتى سمي اليهودي فأومت برأسها فأخذ اليهودي فاعترف فأمر رسول الله صلى الله عليه وسلم أن يرض رأسه بالحجارة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 4528,
			"arabicnumber": 4528,
			"text": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، عن معمر، عن أيوب، عن أبي قلابة، عن أنس، أن يهوديا، قتل جارية من الأنصار على حلي لها ثم ألقاها في قليب ورضخ رأسها بالحجارة فأخذ فأتي به النبي صلى الله عليه وسلم فأمر به أن يرجم حتى يموت فرجم حتى مات ‏.‏ قال أبو داود رواه ابن جريج عن أيوب نحوه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 4529,
			"arabicnumber": 4529,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، عن شعبة، عن هشام بن زيد، عن جده، أنس أن جارية، كان عليها أوضاح لها فرضخ رأسها يهودي بحجر فدخل عليها رسول الله صلى الله عليه وسلم وبها رمق فقال لها ‏\"‏ من قتلك فلان قتلك ‏\"‏ ‏.‏ فقالت لا ‏.‏ برأسها ‏.‏ قال ‏\"‏ من قتلك فلان قتلك ‏\"‏ ‏.‏ قالت لا ‏.‏ برأسها ‏.‏ قال ‏\"‏ فلان قتلك ‏\"‏ ‏.‏ قالت نعم ‏.‏ برأسها فأمر به رسول الله صلى الله عليه وسلم فقتل بين حجرين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 4530,
			"arabicnumber": 4530,
			"text": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى بن سعيد، أخبرنا سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن قيس بن عباد، قال انطلقت أنا والأشتر، إلى علي عليه السلام فقلنا هل عهد إليك رسول الله صلى الله عليه وسلم شيئا لم يعهده إلى الناس عامة قال لا إلا ما في كتابي هذا - قال مسدد قال - فأخرج كتابا - وقال أحمد كتابا من قراب سيفه - فإذا فيه ‏ \"‏ المؤمنون تكافأ دماؤهم وهم يد على من سواهم ويسعى بذمتهم أدناهم ألا لا يقتل مؤمن بكافر ولا ذو عهد في عهده من أحدث حدثا فعلى نفسه ومن أحدث حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏ قال مسدد عن ابن أبي عروبة فأخرج كتابا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 4531,
			"arabicnumber": 4531,
			"text": "حدثنا عبيد الله بن عمر، حدثنا هشيم، عن يحيى بن سعيد، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ذكر نحو حديث علي زاد فيه ‏ \"‏ ويجير عليهم أقصاهم ويرد مشدهم على مضعفهم ومتسريهم على قاعدهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4532,
			"arabicnumber": 4532,
			"text": "حدثنا قتيبة بن سعيد، وعبد الوهاب بن نجدة الحوطي، - المعنى واحد - قالا حدثنا عبد العزيز بن محمد، عن سهيل، عن أبيه، عن أبي هريرة، أن سعد بن عبادة، قال يا رسول الله الرجل يجد مع امرأته رجلا أيقتله قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ قال سعد بلى والذي أكرمك بالحق ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ اسمعوا إلى ما يقول سيدكم ‏\"‏ ‏.‏ قال عبد الوهاب ‏\"‏ إلى ما يقول سعد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4533,
			"arabicnumber": 4533,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن سعد بن عبادة، قال لرسول الله صلى الله عليه وسلم أرأيت لو وجدت مع امرأتي رجلا أمهله حتى آتي بأربعة شهداء قال ‏ \"‏ نعم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4534,
			"arabicnumber": 4534,
			"text": "حدثنا محمد بن داود بن سفيان، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم بعث أبا جهم بن حذيفة مصدقا فلاجه رجل في صدقته فضربه أبو جهم فشجه فأتوا النبي صلى الله عليه وسلم فقالوا القود يا رسول الله ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لكم كذا وكذا ‏\"‏ ‏.‏ فلم يرضوا فقال ‏\"‏ لكم كذا وكذا ‏\"‏ ‏.‏ فلم يرضوا فقال ‏\"‏ لكم كذا وكذا ‏\"‏ ‏.‏ فرضوا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إني خاطب العشية على الناس ومخبرهم برضاكم ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ فخطب رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن هؤلاء الليثيين أتوني يريدون القود فعرضت عليهم كذا وكذا فرضوا أرضيتم ‏\"‏ ‏.‏ قالوا لا ‏.‏ فهم المهاجرون بهم فأمرهم رسول الله صلى الله عليه وسلم أن يكفوا عنهم فكفوا ثم دعاهم فزادهم فقال ‏\"‏ أرضيتم ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ قال ‏\"‏ إني خاطب على الناس ومخبرهم برضاكم ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فخطب النبي صلى الله عليه وسلم فقال ‏\"‏ أرضيتم ‏\"‏ ‏.‏ قالوا نعم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4535,
			"arabicnumber": 4535,
			"text": "حدثنا محمد بن كثير، حدثنا همام، عن قتادة، عن أنس، أن جارية، وجدت، قد رض رأسها بين حجرين فقيل لها من فعل بك هذا أفلان أفلان حتى سمي اليهودي فأومت برأسها فأخذ اليهودي فاعترف فأمر النبي صلى الله عليه وسلم أن يرض رأسه بالحجارة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4536,
			"arabicnumber": 4536,
			"text": "حدثنا أحمد بن صالح، حدثنا ابن وهب، عن عمرو، - يعني ابن الحارث - عن بكير بن الأشج، عن عبيدة بن مسافع، عن أبي سعيد الخدري، قال بينما رسول الله صلى الله عليه وسلم يقسم قسما أقبل رجل فأكب عليه فطعنه رسول الله صلى الله عليه وسلم بعرجون كان معه فجرح بوجهه فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ تعال فاستقد ‏\"‏ ‏.‏ فقال بل عفوت يا رسول الله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4537,
			"arabicnumber": 4537,
			"text": "حدثنا أبو صالح، أخبرنا أبو إسحاق الفزاري، عن الجريري، عن أبي نضرة، عن أبي فراس، قال خطبنا عمر بن الخطاب رضى الله عنه فقال إني لم أبعث عمالي ليضربوا أبشاركم ولا ليأخذوا أموالكم فمن فعل به ذلك فليرفعه إلى أقصه منه قال عمرو بن العاص لو أن رجلا أدب بعض رعيته أتقصه منه قال إي والذي نفسي بيده أقصه وقد رأيت رسول الله صلى الله عليه وسلم أقص من نفسه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4538,
			"arabicnumber": 4538,
			"text": "حدثنا داود بن رشيد، حدثنا الوليد، عن الأوزاعي، أنه سمع حصنا، أنه سمع أبا سلمة، يخبر عن عائشة، رضى الله عنها عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ على المقتتلين أن ينحجزوا الأول فالأول وإن كانت امرأة ‏\"‏ ‏.‏ قال أبو داود بلغني أن عفو النساء في القتل جائز إذا كانت إحدى الأولياء وبلغني عن أبي عبيد في قوله ‏\"‏ ينحجزوا ‏\"‏ ‏.‏ يكفوا عن القود ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4539,
			"arabicnumber": 4539,
			"text": "حدثنا محمد بن عبيد، حدثنا حماد، ح وحدثنا ابن السرح، حدثنا سفيان، - وهذا حديثه - عن عمرو، عن طاوس، قال من قتل ‏.‏ وقال ابن عبيد قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل في عميا في رمى يكون بينهم بحجارة أو ضرب بالسياط أو ضرب بعصا فهو خطأ وعقله عقل الخطإ ومن قتل عمدا فهو قود ‏\"‏ ‏.‏ وقال ابن عبيد ‏\"‏ قود يد ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ ومن حال دونه فعليه لعنة الله وغضبه لا يقبل منه صرف ولا عدل ‏\"‏ ‏.‏ وحديث سفيان أتم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4540,
			"arabicnumber": 4540,
			"text": "حدثنا محمد بن أبي غالب، حدثنا سعيد بن سليمان، عن سليمان بن كثير، حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم فذكر معنى حديث سفيان ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4541,
			"arabicnumber": 4541,
			"text": "حدثنا مسلم بن إبراهيم، قال حدثنا محمد بن راشد، ح وحدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى أن من قتل خطأ فديته مائة من الإبل ثلاثون بنت مخاض وثلاثون بنت لبون وثلاثون حقة وعشرة بني لبون ذكر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4542,
			"arabicnumber": 4542,
			"text": "حدثنا يحيى بن حكيم، حدثنا عبد الرحمن بن عثمان، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال كانت قيمة الدية على عهد رسول الله صلى الله عليه وسلم ثمانمائة دينار أو ثمانية آلاف درهم ودية أهل الكتاب يومئذ النصف من دية المسلمين قال فكان ذلك كذلك حتى استخلف عمر رحمه الله فقام خطيبا فقال ألا إن الإبل قد غلت ‏.‏ قال ففرضها عمر على أهل الذهب ألف دينار وعلى أهل الورق اثنى عشر ألفا وعلى أهل البقر مائتى بقرة وعلى أهل الشاء ألفى شاة وعلى أهل الحلل مائتى حلة ‏.‏ قال وترك دية أهل الذمة لم يرفعها فيما رفع من الدية ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4543,
			"arabicnumber": 4543,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا محمد بن إسحاق، عن عطاء بن أبي رباح، أن رسول الله صلى الله عليه وسلم قضى في الدية على أهل الإبل مائة من الإبل وعلى أهل البقر مائتى بقرة وعلى أهل الشاء ألفى شاة وعلى أهل الحلل مائتى حلة وعلى أهل القمح شيئا لم يحفظه محمد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4544,
			"arabicnumber": 4544,
			"text": "قال أبو داود قرأت على سعيد بن يعقوب الطالقاني قال حدثنا أبو تميلة، حدثنا محمد بن إسحاق، قال ذكر عطاء عن جابر بن عبد الله، قال فرض رسول الله صلى الله عليه وسلم فذكر مثل حديث موسى ‏.‏ قال وعلى أهل الطعام شيئا لا أحفظه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4545,
			"arabicnumber": 4545,
			"text": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الحجاج، عن زيد بن جبير، عن خشف بن مالك الطائي، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ في دية الخطإ عشرون حقة وعشرون جذعة وعشرون بنت مخاض وعشرون بنت لبون وعشرون بني مخاض ذكر ‏\"‏ ‏.‏ وهو قول عبد الله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4546,
			"arabicnumber": 4546,
			"text": "حدثنا محمد بن سليمان الأنباري، حدثنا زيد بن الحباب، عن محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، من بني عدي قتل فجعل النبي صلى الله عليه وسلم ديته اثنى عشر ألفا ‏.‏ قال أبو داود رواه ابن عيينة عن عمرو عن عكرمة عن النبي صلى الله عليه وسلم لم يذكر ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4547,
			"arabicnumber": 4547,
			"text": "حدثنا سليمان بن حرب، ومسدد، - المعنى - قالا حدثنا حماد، عن خالد، عن القاسم بن ربيعة، عن عقبة بن أوس، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم خطب يوم الفتح بمكة فكبر ثلاثا ثم قال ‏\"‏ لا إله إلا الله وحده صدق وعده ونصر عبده وهزم الأحزاب وحده ‏\"‏ ‏.‏ إلى ها هنا حفظته عن مسدد ثم اتفقا ‏\"‏ ألا إن كل مأثرة كانت في الجاهلية تذكر وتدعى من دم أو مال تحت قدمى إلا ما كان من سقاية الحاج وسدانة البيت ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا إن دية الخطإ شبه العمد ما كان بالسوط والعصا مائة من الإبل منها أربعون في بطونها أولادها ‏\"‏ ‏.‏ وحديث مسدد أتم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4548,
			"arabicnumber": 4548,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن خالد، بهذا الإسناد نحو معناه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4549,
			"arabicnumber": 4549,
			"text": "حدثنا مسدد، حدثنا عبد الوارث، عن علي بن زيد، عن القاسم بن ربيعة، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعناه قال خطب رسول الله صلى الله عليه وسلم يوم الفتح أو فتح مكة على درجة البيت أو الكعبة ‏.‏ قال أبو داود كذا رواه ابن عيينة أيضا عن علي بن زيد عن القاسم بن ربيعة عن ابن عمر عن النبي صلى الله عليه وسلم ورواه أيوب السختياني عن القاسم بن ربيعة عن عبد الله بن عمرو مثل حديث خالد ورواه حماد بن سلمة عن علي بن زيد عن يعقوب السدوسي عن عبد الله بن عمرو عن النبي صلى الله عليه وسلم وقول زيد وأبي موسى مثل حديث النبي صلى الله عليه وسلم وحديث عمر رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4550,
			"arabicnumber": 4550,
			"text": "حدثنا النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، قال قضى عمر في شبه العمد ثلاثين حقة وثلاثين جذعة وأربعين خلفة ما بين ثنية إلى بازل عامها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4551,
			"arabicnumber": 4551,
			"text": "حدثنا هناد، حدثنا أبو الأحوص، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، رضى الله عنه أنه قال في شبه العمد أثلاث ثلاث وثلاثون حقة وثلاث وثلاثون جذعة وأربع وثلاثون ثنية إلى بازل عامها كلها خلفة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4552,
			"arabicnumber": 4552,
			"text": "وبه عن أبي إسحاق، عن علقمة، والأسود، قال عبد الله في شبه العمد خمس وعشرون حقة وخمس وعشرون جذعة وخمس وعشرون بنات لبون وخمس وعشرون بنات مخاض ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4553,
			"arabicnumber": 4553,
			"text": "حدثنا هناد، حدثنا أبو الأحوص، عن سفيان، عن أبي إسحاق، عن عاصم بن ضمرة، قال قال علي رضى الله عنه في الخطإ أرباعا خمس وعشرون حقة وخمس وعشرون جذعة وخمس وعشرون بنات لبون وخمس وعشرون بنات مخاض ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4554,
			"arabicnumber": 4554,
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن عبد الله، حدثنا سعيد، عن قتادة، عن عبد ربه، عن أبي عياض، عن عثمان بن عفان، وزيد بن ثابت، في المغلظة أربعون جذعة خلفة وثلاثون حقة وثلاثون بنات لبون وفي الخطإ ثلاثون حقة وثلاثون بنات لبون وعشرون بنو لبون ذكور وعشرون بنات مخاض ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4555,
			"arabicnumber": 4555,
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن عبد الله، حدثنا سعيد، عن قتادة، عن سعيد بن المسيب، عن زيد بن ثابت، في الدية المغلظة فذكر مثله سواء ‏.‏ قال أبو داود قال أبو عبيد وعن غير واحد إذا دخلت الناقة في السنة الرابعة فهو حق والأنثى حقة لأنه يستحق أن يحمل عليه ويركب فإذا دخل في الخامسة فهو جذع وجذعة فإذا دخل في السادسة وألقى ثنيته فهو ثني وثنية فإذا دخل في السابعة فهو رباع ورباعية فإذا دخل في الثامنة وألقى السن الذي بعد الرباعية فهو سديس وسدس فإذا دخل في التاسعة وفطر نابه وطلع فهو بازل فإذا دخل في العاشرة فهو مخلف ثم ليس له اسم ولكن يقال بازل عام وبازل عامين ومخلف عام ومخلف عامين إلى ما زاد ‏.‏ وقال النضر بن شميل بنت مخاض لسنة وبنت لبون لسنتين وحقة لثلاث وجذعة لأربع والثني لخمس ورباع لست وسديس لسبع وبازل لثمان ‏.‏ قال أبو داود قال أبو حاتم والأصمعي والجذوعة وقت وليس بسن ‏.‏ قال أبو حاتم قال بعضهم فإذا ألقى رباعيته فهو رباع وإذا ألقى ثنيته فهو ثني وقال أبو عبيد إذا ألقحت فهي خلفة فلا تزال خلفة إلى عشرة أشهر فإذا بلغت عشرة أشهر فهي عشراء ‏.‏ قال أبو حاتم إذا ألقى ثنيته فهو ثني وإذا ألقى رباعيته فهو رباع ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4556,
			"arabicnumber": 4556,
			"text": "حدثنا إسحاق بن إسماعيل، حدثنا عبدة، - يعني ابن سليمان - حدثنا سعيد بن أبي عروبة، عن غالب التمار، عن حميد بن هلال، عن مسروق بن أوس، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الأصابع سواء عشر عشر من الإبل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4557,
			"arabicnumber": 4557,
			"text": "حدثنا أبو الوليد، حدثنا شعبة، عن غالب التمار، عن مسروق بن أوس، عن الأشعري، عن النبي صلى الله عليه وسلم قال ‏\"‏ الأصابع سواء ‏\"‏ ‏.‏ قلت عشر عشر قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال أبو داود رواه محمد بن جعفر عن شعبة عن غالب قال سمعت مسروق بن أوس ورواه إسماعيل قال حدثني غالب التمار بإسناد أبي الوليد ورواه حنظلة بن أبي صفية عن غالب بإسناد إسماعيل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4558,
			"arabicnumber": 4558,
			"text": "حدثنا مسدد، حدثنا يحيى، ح وحدثنا ابن معاذ، حدثنا أبي ح، وحدثنا نصر بن علي، أخبرنا يزيد بن زريع، كلهم عن شعبة، عن قتادة، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ هذه وهذه سواء ‏\"‏ ‏.‏ قال يعني الإبهام والخنصر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4559,
			"arabicnumber": 4559,
			"text": "حدثنا عباس العنبري، حدثنا عبد الصمد بن عبد الوارث، حدثني شعبة، عن قتادة، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الأصابع سواء والأسنان سواء الثنية والضرس سواء هذه وهذه سواء ‏\"‏ ‏.‏ قال أبو داود ورواه النضر بن شميل عن شعبة بمعنى عبد الصمد ‏.‏ قال أبو داود حدثناه الدارمي عن النضر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4560,
			"arabicnumber": 4560,
			"text": "حدثنا محمد بن حاتم بن بزيع، حدثنا علي بن الحسن، أخبرنا أبو حمزة، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الأسنان سواء والأصابع سواء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4561,
			"arabicnumber": 4561,
			"text": "حدثنا عبد الله بن عمر بن محمد بن أبان، حدثنا أبو تميلة، عن حسين المعلم، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال جعل رسول الله صلى الله عليه وسلم أصابع اليدين والرجلين سواء ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4562,
			"arabicnumber": 4562,
			"text": "حدثنا هدبة بن خالد، حدثنا همام، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في خطبته وهو مسند ظهره إلى الكعبة ‏ \"‏ في الأصابع عشر عشر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4563,
			"arabicnumber": 4563,
			"text": "حدثنا زهير بن حرب أبو خيثمة، حدثنا يزيد بن هارون، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏ \"‏ في الأسنان خمس خمس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4564,
			"arabicnumber": 4564,
			"text": "قال أبو داود وجدت في كتابي عن شيبان، - ولم أسمعه منه - فحدثناه أبو بكر، - صاحب لنا ثقة - قال حدثنا شيبان، حدثنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، قال كان رسول الله صلى الله عليه وسلم يقوم دية الخطإ على أهل القرى أربعمائة دينار أو عدلها من الورق يقومها على أثمان الإبل فإذا غلت رفع في قيمتها وإذا هاجت رخصا نقص من قيمتها وبلغت على عهد رسول الله صلى الله عليه وسلم ما بين أربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ثمانية آلاف درهم وقضى رسول الله صلى الله عليه وسلم على أهل البقر مائتى بقرة ومن كان دية عقله في الشاء فألفى شاة قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن العقل ميراث بين ورثة القتيل على قرابتهم فما فضل فللعصبة ‏\"‏ ‏.‏ قال وقضى رسول الله صلى الله عليه وسلم في الأنف إذا جدع الدية كاملة وإن جدعت ثندوته فنصف العقل خمسون من الإبل أو عدلها من الذهب أو الورق أو مائة بقرة أو ألف شاة وفي اليد إذا قطعت نصف العقل وفي الرجل نصف العقل وفي المأمومة ثلث العقل ثلاث وثلاثون من الإبل وثلث أو قيمتها من الذهب أو الورق أو البقر أو الشاء والجائفة مثل ذلك وفي الأصابع في كل أصبع عشر من الإبل وفي الأسنان في كل سن خمس من الإبل وقضى رسول الله صلى الله عليه وسلم أن عقل المرأة بين عصبتها من كانوا لا يرثون منها شيئا إلا ما فضل عن ورثتها فإن قتلت فعقلها بين ورثتها وهم يقتلون قاتلهم وقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس للقاتل شىء وإن لم يكن له وارث فوارثه أقرب الناس إليه ولا يرث القاتل شيئا ‏\"‏ ‏.‏ قال محمد هذا كله حدثني به سليمان بن موسى عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود محمد بن راشد من أهل دمشق هرب إلى البصرة من القتل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4565,
			"arabicnumber": 4565,
			"text": "حدثنا محمد بن يحيى بن فارس، حدثنا محمد بن بكار بن بلال العاملي، أخبرنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ عقل شبه العمد مغلظ مثل عقل العمد ولا يقتل صاحبه ‏\"‏ ‏.‏ قال وزادنا خليل عن ابن راشد ‏\"‏ وذلك أن ينزو الشيطان بين الناس فتكون دماء في عميا في غير ضغينة ولا حمل سلاح ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4566,
			"arabicnumber": 4566,
			"text": "حدثنا أبو كامل، فضيل بن حسين أن خالد بن الحارث، حدثهم قال أخبرنا حسين، - يعني المعلم - عن عمرو بن شعيب، أن أباه، أخبره عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ في المواضح خمس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4567,
			"arabicnumber": 4567,
			"text": "حدثنا محمود بن خالد السلمي، حدثنا مروان، - يعني ابن محمد - حدثنا الهيثم بن حميد، حدثني العلاء بن الحارث، حدثني عمرو بن شعيب، عن أبيه، عن جده، قال قضى رسول الله صلى الله عليه وسلم في العين القائمة السادة لمكانها بثلث الدية ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4568,
			"arabicnumber": 4568,
			"text": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن منصور، عن إبراهيم، عن عبيد بن نضلة، عن المغيرة بن شعبة، أن امرأتين، كانتا تحت رجل من هذيل فضربت إحداهما الأخرى بعمود فقتلتها وجنينها فاختصموا إلى النبي صلى الله عليه وسلم فقال أحد الرجلين كيف ندي من لا صاح ولا أكل ولا شرب ولا استهل ‏.‏ فقال ‏ \"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏ وقضى فيه بغرة وجعله على عاقلة المرأة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4569,
			"arabicnumber": 4569,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، بإسناده ومعناه ‏.‏ وزاد فجعل النبي صلى الله عليه وسلم دية المقتولة على عصبة القاتلة وغرة لما في بطنها ‏.‏ قال أبو داود وكذلك رواه الحكم عن مجاهد عن المغيرة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4570,
			"arabicnumber": 4570,
			"text": "حدثنا عثمان بن أبي شيبة، وهارون بن عباد الأزدي، - المعنى - قالا حدثنا وكيع، عن هشام، عن عروة، عن المسور بن مخرمة، أن عمر، استشار الناس في إملاص المرأة فقال المغيرة بن شعبة شهدت رسول الله صلى الله عليه وسلم قضى فيها بغرة عبد أو أمة ‏.‏ فقال ائتني بمن يشهد معك ‏.‏ فأتاه بمحمد بن مسلمة - زاد هارون - فشهد له يعني ضرب الرجل بطن امرأته ‏.‏ قال أبو داود بلغني عن أبي عبيد إنما سمي إملاصا لأن المرأة تزلقه قبل وقت الولادة وكذلك كل ما زلق من اليد وغيره فقد ملص ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4571,
			"arabicnumber": 4571,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن هشام، عن أبيه، عن المغيرة، عن عمر، بمعناه ‏.‏ قال أبو داود رواه حماد بن زيد وحماد بن سلمة عن هشام بن عروة، عن أبيه، أن عمر، قال ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4572,
			"arabicnumber": 4572,
			"text": "حدثنا محمد بن مسعود المصيصي، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عمرو بن دينار، أنه سمع طاوسا، عن ابن عباس، عن عمر، أنه سأل عن قضية النبي، صلى الله عليه وسلم في ذلك فقام إليه حمل بن مالك بن النابغة فقال كنت بين امرأتين فضربت إحداهما الأخرى بمسطح فقتلتها وجنينها فقضى رسول الله صلى الله عليه وسلم في جنينها بغرة وأن تقتل ‏.‏ قال أبو داود قال النضر بن شميل المسطح هو الصوبج ‏.‏ قال أبو داود وقال أبو عبيد المسطح عود من أعواد الخباء ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4573,
			"arabicnumber": 4573,
			"text": "حدثنا عبد الله بن محمد الزهري، حدثنا سفيان، عن عمرو، عن طاوس، قال قام عمر رضى الله عنه على المنبر فذكر معناه لم يذكر وأن تقتل ‏.‏ زاد بغرة عبد أو أمة ‏.‏ قال فقال عمر الله أكبر لو لم أسمع بهذا لقضينا بغير هذا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4574,
			"arabicnumber": 4574,
			"text": "حدثنا سليمان بن عبد الرحمن التمار، أن عمرو بن طلحة، حدثهم قال حدثنا أسباط، عن سماك، عن عكرمة، عن ابن عباس، في قصة حمل بن مالك قال فأسقطت غلاما قد نبت شعره ميتا وماتت المرأة فقضى على العاقلة الدية ‏.‏ فقال عمها إنها قد أسقطت يا نبي الله غلاما قد نبت شعره ‏.‏ فقال أبو القاتلة إنه كاذب إنه والله ما استهل ولا شرب ولا أكل فمثله يطل ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ أسجع الجاهلية وكهانتها أد في الصبي غرة ‏\"‏ ‏.‏ قال ابن عباس كان اسم إحداهما مليكة والأخرى أم غطيف ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4575,
			"arabicnumber": 4575,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا يونس بن محمد، حدثنا عبد الواحد بن زياد، حدثنا مجالد، قال حدثنا الشعبي، عن جابر بن عبد الله، أن امرأتين، من هذيل قتلت إحداهما الأخرى ولكل واحدة منهما زوج وولد فجعل رسول الله صلى الله عليه وسلم دية المقتولة على عاقلة القاتلة وبرأ زوجها وولدها ‏.‏ قال فقال عاقلة المقتولة ميراثها لنا قال فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا ميراثها لزوجها وولدها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4576,
			"arabicnumber": 4576,
			"text": "حدثنا وهب بن بيان، وابن السرح، قالا حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، قال اقتتلت امرأتان من هذيل فرمت إحداهما الأخرى بحجر فقتلتها فاختصموا إلى رسول الله صلى الله عليه وسلم فقضى رسول الله صلى الله عليه وسلم دية جنينها غرة عبد أو وليدة وقضى بدية المرأة على عاقلتها وورثها ولدها ومن معهم فقال حمل بن مالك بن النابغة الهذلي يا رسول الله كيف أغرم دية من لا شرب ولا أكل ولا نطق ولا استهل فمثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إنما هذا من إخوان الكهان ‏\"‏ ‏.‏ من أجل سجعه الذي سجع ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4577,
			"arabicnumber": 4577,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، في هذه القصة قال ثم إن المرأة التي قضى عليها بالغرة توفيت فقضى رسول الله صلى الله عليه وسلم بأن ميراثها لبنيها وأن العقل على عصبتها ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4578,
			"arabicnumber": 4578,
			"text": "حدثنا عباس بن عبد العظيم، حدثنا عبيد الله بن موسى، حدثنا يوسف بن صهيب، عن عبد الله بن بريدة، عن أبيه، أن امرأة، حذفت امرأة فأسقطت فرفع ذلك إلى رسول الله صلى الله عليه وسلم فجعل في ولدها خمسمائة شاة ونهى يومئذ عن الحذف ‏.‏ قال أبو داود كذا الحديث خمسمائة شاة ‏.‏ والصواب مائة شاة ‏.‏ قال أبو داود هكذا قال عباس وهو وهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4579,
			"arabicnumber": 4579,
			"text": "حدثنا إبراهيم بن موسى الرازي، حدثنا عيسى، عن محمد، - يعني ابن عمرو - عن أبي سلمة، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد أو أمة أو فرس أو بغل ‏.‏ قال أبو داود روى هذا الحديث حماد بن سلمة وخالد بن عبد الله عن محمد بن عمرو لم يذكرا أو فرس أو بغل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4580,
			"arabicnumber": 4580,
			"text": "حدثنا محمد بن سنان العوقي، حدثنا شريك، عن مغيرة، عن إبراهيم، وجابر، عن الشعبي، قال الغرة خمسمائة درهم ‏.‏ قال أبو داود قال ربيعة الغرة خمسون دينارا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4581,
			"arabicnumber": 4581,
			"text": "حدثنا مسدد، حدثنا يحيى بن سعيد، وحدثنا إسماعيل، عن هشام، وحدثنا عثمان بن أبي شيبة، حدثنا يعلى بن عبيد، حدثنا حجاج الصواف، جميعا عن يحيى بن أبي كثير، عن عكرمة، عن ابن عباس، قال قضى رسول الله صلى الله عليه وسلم في دية المكاتب يقتل يودى ما أدى من مكاتبته دية الحر وما بقي دية المملوك ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4582,
			"arabicnumber": 4582,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد بن سلمة، عن أيوب، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا أصاب المكاتب حدا أو ورث ميراثا يرث على قدر ما عتق منه ‏\"‏ ‏.‏ قال أبو داود رواه وهيب عن أيوب عن عكرمة عن علي عن النبي صلى الله عليه وسلم وأرسله حماد بن زيد وإسماعيل عن أيوب عن عكرمة عن النبي صلى الله عليه وسلم وجعله إسماعيل ابن علية قول عكرمة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4583,
			"arabicnumber": 4583,
			"text": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا عيسى بن يونس، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏ \"‏ دية المعاهد نصف دية الحر ‏\"‏ ‏.‏ قال أبو داود رواه أسامة بن زيد الليثي وعبد الرحمن بن الحارث عن عمرو بن شعيب مثله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4584,
			"arabicnumber": 4584,
			"text": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، قال أخبرني عطاء، عن صفوان بن يعلى، عن أبيه، قال قاتل أجير لي رجلا فعض يده فانتزعها فندرت ثنيته فأتى النبي صلى الله عليه وسلم فأهدرها وقال ‏ \"‏ أتريد أن يضع يده في فيك تقضمها كالفحل ‏\"‏ ‏.‏ قال وأخبرني ابن أبي مليكة عن جده أن أبا بكر رضي الله عنه أهدرها وقال بعدت سنه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4585,
			"arabicnumber": 4585,
			"text": "حدثنا زياد بن أيوب، أخبرنا هشيم، حدثنا حجاج، وعبد الملك، عن عطاء، عن يعلى بن أمية، بهذا زاد ثم قال يعني النبي صلى الله عليه وسلم للعاض ‏ \"‏ إن شئت أن تمكنه من يدك فيعضها ثم تنزعها من فيه ‏\"‏ ‏.‏ وأبطل دية أسنانه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4586,
			"arabicnumber": 4586,
			"text": "حدثنا نصر بن عاصم الأنطاكي، ومحمد بن الصباح بن سفيان، أن الوليد بن مسلم، أخبرهم عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من تطبب ولا يعلم منه طب فهو ضامن ‏\"‏ ‏.‏ قال نصر قال حدثني ابن جريج ‏.‏ قال أبو داود هذا لم يروه إلا الوليد لا ندري هو صحيح أم لا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4587,
			"arabicnumber": 4587,
			"text": "حدثنا محمد بن العلاء، حدثنا حفص، حدثنا عبد العزيز بن عمر بن عبد العزيز، حدثني بعض الوفد الذين، قدموا على أبي قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أيما طبيب تطبب على قوم لا يعرف له تطبب قبل ذلك فأعنت فهو ضامن ‏\"‏ ‏.‏ قال عبد العزيز أما إنه ليس بالنعت إنما هو قطع العروق والبط والكى ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4588,
			"arabicnumber": 4588,
			"text": "حدثنا سليمان بن حرب، ومسدد، - المعنى - قالا حدثنا حماد، عن خالد، عن القاسم بن ربيعة، عن عقبة بن أوس، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم - قال مسدد - خطب يوم الفتح - ثم اتفقا - فقال ‏\"‏ ألا إن كل مأثرة كانت في الجاهلية من دم أو مال تذكر وتدعى تحت قدمى إلا ما كان من سقاية الحاج وسدانة البيت ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا إن دية الخطإ شبه العمد ما كان بالسوط والعصا مائة من الإبل منها أربعون في بطونها أولادها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4589,
			"arabicnumber": 4589,
			"text": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن خالد، بهذا الإسناد نحو معناه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4590,
			"arabicnumber": 4590,
			"text": "حدثنا أحمد بن حنبل، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي نضرة، عن عمران بن حصين، أن غلاما، لأناس فقراء قطع أذن غلام لأناس أغنياء فأتى أهله النبي صلى الله عليه وسلم فقالوا يا رسول الله إنا أناس فقراء ‏.‏ فلم يجعل عليه شيئا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4591,
			"arabicnumber": 4591,
			"text": "قال أبو داود حدثت عن سعيد بن سليمان، عن سليمان بن كثير، حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قتل في عميا أو رميا يكون بينهم بحجر أو بسوط فعقله عقل خطإ ومن قتل عمدا فقود يديه فمن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4592,
			"arabicnumber": 4592,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن يزيد، حدثنا سفيان بن حسين، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الرجل جبار ‏\"‏ ‏.‏ قال أبو داود الدابة تضرب برجلها وهو راكب ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4593,
			"arabicnumber": 4593,
			"text": "حدثنا مسدد، حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، وأبي، سلمة سمعا أبا هريرة، يحدث عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ العجماء جرحها جبار والمعدن جبار والبئر جبار وفي الركاز الخمس ‏\"‏ ‏.‏ قال أبو داود العجماء المنفلتة التي لا يكون معها أحد وتكون بالنهار ولا تكون بالليل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4594,
			"arabicnumber": 4594,
			"text": "حدثنا محمد بن المتوكل العسقلاني، حدثنا عبد الرزاق، ح وحدثنا جعفر بن مسافر التنيسي، حدثنا زيد بن المبارك، حدثنا عبد الملك الصنعاني، كلاهما عن معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ النار جبار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4595,
			"arabicnumber": 4595,
			"text": "حدثنا مسدد، حدثنا المعتمر، عن حميد الطويل، عن أنس بن مالك، قال كسرت الربيع أخت أنس بن النضر ثنية امرأة فأتوا النبي صلى الله عليه وسلم فقضى بكتاب الله القصاص فقال أنس بن النضر والذي بعثك بالحق لا تكسر ثنيتها اليوم ‏.‏ قال ‏\"‏ يا أنس كتاب الله القصاص ‏\"‏ ‏.‏ فرضوا بأرش أخذوه فعجب نبي الله صلى الله عليه وسلم وقال ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏ ‏.‏ قال أبو داود سمعت أحمد بن حنبل قيل له كيف يقتص من السن قال تبرد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 102
			}
		}
	]
}