{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "حدثنا قتيبة بن سعيد الثقفي، حدثنا الليث، عن عقيل، عن الزهري، أخبرني عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، قال لما توفي رسول الله صلى الله عليه وسلم واستخلف أبو بكر بعده وكفر من كفر من العرب قال عمر بن الخطاب لأبي بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله عز وجل ‏\"‏ ‏.‏ فقال أبو بكر والله لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عقالا كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعه ‏.‏ فقال عمر بن الخطاب فوالله ما هو إلا أن رأيت الله عز وجل قد شرح صدر أبي بكر للقتال - قال - فعرفت أنه الحق ‏.‏ قال أبو داود قال أبو عبيدة معمر بن المثنى العقال صدقة سنة والعقالان صدقة سنتين ‏.‏ قال أبو داود ورواه رباح بن زيد وعبد الرزاق عن معمر عن الزهري بإسناده وقال بعضهم عقالا ‏.‏ ورواه ابن وهب عن يونس قال عناقا ‏.‏ قال أبو داود وقال شعيب بن أبي حمزة ومعمر والزبيدي عن الزهري في هذا الحديث لو منعوني عناقا ‏.‏ وروى عنبسة عن يونس عن الزهري في هذا الحديث قال عناقا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": 1557,
			"text": "حدثنا ابن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، أخبرني يونس، عن الزهري، قال قال أبو بكر إن حقه أداء الزكاة وقال عقالا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": 1558,
			"text": "حدثنا عبد الله بن مسلمة، قال قرأت على مالك بن أنس عن عمرو بن يحيى المازني، عن أبيه، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس فيما دون خمس ذود صدقة وليس فيما دون خمس أواق صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": 1559,
			"text": "حدثنا أيوب بن محمد الرقي، حدثنا محمد بن عبيد، حدثنا إدريس بن يزيد الأودي، عن عمرو بن مرة الجملي، عن أبي البختري الطائي، عن أبي سعيد الخدري، يرفعه إلى النبي صلى الله عليه وسلم قال ‏ \"‏ ليس فيما دون خمسة أوسق زكاة ‏\"‏ ‏.‏ والوسق ستون مختوما ‏.‏ قال أبو داود أبو البختري لم يسمع من أبي سعيد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن المغيرة، عن إبراهيم، قال الوسق ستون صاعا مختوما بالحجاجي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": 1561,
			"text": "حدثنا محمد بن بشار، حدثني محمد بن عبد الله الأنصاري، حدثنا صرد بن أبي المنازل، قال سمعت حبيبا المالكي، قال قال رجل لعمران بن حصين يا أبا نجيد إنكم لتحدثوننا بأحاديث ما نجد لها أصلا في القرآن ‏.‏ فغضب عمران وقال للرجل أوجدتم في كل أربعين درهما درهم ومن كل كذا وكذا شاة شاة ومن كل كذا وكذا بعيرا كذا وكذا أوجدتم هذا في القرآن قال لا ‏.‏ قال فعن من أخذتم هذا أخذتموه عنا وأخذناه عن نبي الله صلى الله عليه وسلم وذكر أشياء نحو هذا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": 1562,
			"text": "حدثنا محمد بن داود بن سفيان، حدثنا يحيى بن حسان، حدثنا سليمان بن موسى أبو داود، حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان عن سمرة بن جندب، قال أما بعد فإن رسول الله صلى الله عليه وسلم كان يأمرنا أن نخرج الصدقة من الذي نعد للبيع ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "حدثنا أبو كامل، وحميد بن مسعدة، - المعنى - أن خالد بن الحارث، حدثهم حدثنا حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، أتت رسول الله صلى الله عليه وسلم ومعها ابنة لها وفي يد ابنتها مسكتان غليظتان من ذهب فقال لها ‏\"‏ أتعطين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى النبي صلى الله عليه وسلم وقالت هما لله عز وجل ولرسوله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": 1564,
			"text": "حدثنا محمد بن عيسى، حدثنا عتاب، - يعني ابن بشير - عن ثابت بن عجلان، عن عطاء، عن أم سلمة، قالت كنت ألبس أوضاحا من ذهب فقلت يا رسول الله أكنز هو فقال ‏ \"‏ ما بلغ أن تؤدى زكاته فزكي فليس بكنز ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": 1565,
			"text": "حدثنا محمد بن إدريس الرازي، حدثنا عمرو بن الربيع بن طارق، حدثنا يحيى بن أيوب، عن عبيد الله بن أبي جعفر، أن محمد بن عمرو بن عطاء، أخبره عن عبد الله بن شداد بن الهاد، أنه قال دخلنا على عائشة زوج النبي صلى الله عليه وسلم فقالت دخل على رسول الله صلى الله عليه وسلم فرأى في يدي فتخات من ورق فقال ‏\"‏ ما هذا يا عائشة ‏\"‏ ‏.‏ فقلت صنعتهن أتزين لك يا رسول الله ‏.‏ قال ‏\"‏ أتؤدين زكاتهن ‏\"‏ ‏.‏ قلت لا أو ما شاء الله ‏.‏ قال ‏\"‏ هو حسبك من النار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": 1566,
			"text": "حدثنا صفوان بن صالح، حدثنا الوليد بن مسلم، حدثنا سفيان، عن عمر بن يعلى، فذكر الحديث نحو حديث الخاتم ‏.‏ قيل لسفيان كيف تزكيه قال تضمه إلى غيره ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، قال أخذت من ثمامة بن عبد الله بن أنس كتابا زعم أن أبا بكر، كتبه لأنس وعليه خاتم رسول الله صلى الله عليه وسلم حين بعثه مصدقا وكتبه له فإذا فيه ‏\"‏ هذه فريضة الصدقة التي فرضها رسول الله صلى الله عليه وسلم على المسلمين التي أمر الله عز وجل بها نبيه صلى الله عليه وسلم فمن سئلها من المسلمين على وجهها فليعطها ومن سئل فوقها فلا يعطه فيما دون خمس وعشرين من الإبل الغنم في كل خمس ذود شاة ‏.‏ فإذا بلغت خمسا وعشرين ففيها بنت مخاض إلى أن تبلغ خمسا وثلاثين فإن لم يكن فيها بنت مخاض فابن لبون ذكر فإذا بلغت ستا وثلاثين ففيها بنت لبون إلى خمس وأربعين فإذا بلغت ستا وأربعين ففيها حقة طروقة الفحل إلى ستين فإذا بلغت إحدى وستين ففيها جذعة إلى خمس وسبعين فإذا بلغت ستا وسبعين ففيها ابنتا لبون إلى تسعين فإذا بلغت إحدى وتسعين ففيها حقتان طروقتا الفحل إلى عشرين ومائة فإذا زادت على عشرين ومائة ففي كل أربعين بنت لبون وفي كل خمسين حقة فإذا تباين أسنان الإبل في فرائض الصدقات فمن بلغت عنده صدقة الجذعة وليست عنده جذعة وعنده حقة فإنها تقبل منه وأن يجعل معها شاتين - إن استيسرتا له - أو عشرين درهما ومن بلغت عنده صدقة الحقة وليست عنده حقة وعنده جذعة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة الحقة وليس عنده حقة وعنده ابنة لبون فإنها تقبل منه ‏\"‏ ‏.‏ قال أبو داود من ها هنا لم أضبطه عن موسى كما أحب ‏\"‏ ويجعل معها شاتين - إن استيسرتا له - أو عشرين درهما ومن بلغت عنده صدقة بنت لبون وليس عنده إلا حقة فإنها تقبل منه ‏\"‏ ‏.‏ قال أبو داود إلى ها هنا ثم أتقنته ‏\"‏ ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة ابنة لبون وليس عنده إلا بنت مخاض فإنها تقبل منه وشاتين أو عشرين درهما ومن بلغت عنده صدقة ابنة مخاض وليس عنده إلا ابن لبون ذكر فإنه يقبل منه وليس معه شىء ومن لم يكن عنده إلا أربع فليس فيها شىء إلا أن يشاء ربها وفي سائمة الغنم إذا كانت أربعين ففيها شاة إلى عشرين ومائة فإذا زادت على عشرين ومائة ففيها شاتان إلى أن تبلغ مائتين فإذا زادت على مائتين ففيها ثلاث شياه إلى أن تبلغ ثلاثمائة فإذا زادت على ثلاثمائة ففي كل مائة شاة شاة ولا يؤخذ في الصدقة هرمة ولا ذات عوار من الغنم ولا تيس الغنم إلا أن يشاء المصدق ولا يجمع بين مفترق ولا يفرق بين مجتمع خشية الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية فإن لم تبلغ سائمة الرجل أربعين فليس فيها شىء إلا أن يشاء ربها وفي الرقة ربع العشر فإن لم يكن المال إلا تسعين ومائة فليس فيها شىء إلا أن يشاء ربها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "حدثنا عبد الله بن محمد النفيلي، حدثنا عباد بن العوام، عن سفيان بن حسين، عن الزهري، عن سالم، عن أبيه، قال كتب رسول الله صلى الله عليه وسلم كتاب الصدقة فلم يخرجه إلى عماله حتى قبض فقرنه بسيفه فعمل به أبو بكر حتى قبض ثم عمل به عمر حتى قبض فكان فيه ‏ \"‏ في خمس من الإبل شاة وفي عشر شاتان وفي خمس عشرة ثلاث شياه وفي عشرين أربع شياه وفي خمس وعشرين ابنة مخاض إلى خمس وثلاثين فإن زادت واحدة ففيها ابنة لبون إلى خمس وأربعين فإذا زادت واحدة ففيها حقة إلى ستين فإذا زادت واحدة ففيها جذعة إلى خمس وسبعين فإذا زادت واحدة ففيها ابنتا لبون إلى تسعين فإذا زادت واحدة ففيها حقتان إلى عشرين ومائة فإن كانت الإبل أكثر من ذلك ففي كل خمسين حقة وفي كل أربعين ابنة لبون وفي الغنم في كل أربعين شاة شاة إلى عشرين ومائة فإن زادت واحدة فشاتان إلى مائتين فإن زادت واحدة على المائتين ففيها ثلاث شياه إلى ثلاثمائة فإن كانت الغنم أكثر من ذلك ففي كل مائة شاة شاة وليس فيها شىء حتى تبلغ المائة ولا يفرق بين مجتمع ولا يجمع بين متفرق مخافة الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ولا يؤخذ في الصدقة هرمة ولا ذات عيب ‏\"‏ ‏.‏ قال وقال الزهري إذا جاء المصدق قسمت الشاء أثلاثا ثلثا شرارا وثلثا خيارا وثلثا وسطا فأخذ المصدق من الوسط ولم يذكر الزهري البقر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": 1569,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن يزيد الواسطي، أخبرنا سفيان بن حسين، بإسناده ومعناه قال ‏ \"‏ فإن لم تكن ابنة مخاض فابن لبون ‏\"‏ ‏.‏ ولم يذكر كلام الزهري ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1570,
			"arabicnumber": 1570,
			"text": "حدثنا محمد بن العلاء، أخبرنا ابن المبارك، عن يونس بن يزيد، عن ابن شهاب، قال هذه نسخة كتاب رسول الله صلى الله عليه وسلم الذي كتبه في الصدقة وهي عند آل عمر بن الخطاب قال ابن شهاب أقرأنيها سالم بن عبد الله بن عمر فوعيتها على وجهها وهي التي انتسخ عمر بن عبد العزيز من عبد الله بن عبد الله بن عمر وسالم بن عبد الله بن عمر فذكر الحديث قال ‏\"‏ فإذا كانت إحدى وعشرين ومائة ففيها ثلاث بنات لبون حتى تبلغ تسعا وعشرين ومائة فإذا كانت ثلاثين ومائة ففيها بنتا لبون وحقة حتى تبلغ تسعا وثلاثين ومائة فإذا كانت أربعين ومائة ففيها حقتان وبنت لبون حتى تبلغ تسعا وأربعين ومائة فإذا كانت خمسين ومائة ففيها ثلاث حقاق حتى تبلغ تسعا وخمسين ومائة فإذا كانت ستين ومائة ففيها أربع بنات لبون حتى تبلغ تسعا وستين ومائة فإذا كانت سبعين ومائة ففيها ثلاث بنات لبون وحقة حتى تبلغ تسعا وسبعين ومائة فإذا كانت ثمانين ومائة ففيها حقتان وابنتا لبون حتى تبلغ تسعا وثمانين ومائة فإذا كانت تسعين ومائة ففيها ثلاث حقاق وبنت لبون حتى تبلغ تسعا وتسعين ومائة فإذا كانت مائتين ففيها أربع حقاق أو خمس بنات لبون أى السنين وجدت أخذت وفي سائمة الغنم ‏\"‏ ‏.‏ فذكر نحو حديث سفيان بن حسين وفيه ‏\"‏ ولا يؤخذ في الصدقة هرمة ولا ذات عوار من الغنم ولا تيس الغنم إلا أن يشاء المصدق ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": 1571,
			"text": "حدثنا عبد الله بن مسلمة، قال قال مالك وقول عمر بن الخطاب - رضى الله عنه لا يجمع بين متفرق ولا يفرق بين مجتمع ‏.‏ هو أن يكون لكل رجل أربعون شاة فإذا أظلهم المصدق جمعوها لئلا يكون فيها إلا شاة ولا يفرق بين مجتمع ‏.‏ أن الخليطين إذا كان لكل واحد منهما مائة شاة وشاة فيكون عليهما فيها ثلاث شياه فإذا أظلهما المصدق فرقا غنمهما فلم يكن على كل واحد منهما إلا شاة فهذا الذي سمعت في ذلك ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": 1572,
			"text": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو إسحاق، عن عاصم بن ضمرة، وعن الحارث الأعور، عن علي، - رضى الله عنه - قال زهير أحسبه عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ هاتوا ربع العشور من كل أربعين درهما درهم وليس عليكم شىء حتى تتم مائتى درهم فإذا كانت مائتى درهم ففيها خمسة دراهم فما زاد فعلى حساب ذلك وفي الغنم في كل أربعين شاة شاة فإن لم يكن إلا تسعا وثلاثين فليس عليك فيها شىء ‏\"‏ ‏.‏ وساق صدقة الغنم مثل الزهري قال ‏\"‏ وفي البقر في كل ثلاثين تبيع وفي الأربعين مسنة وليس على العوامل شىء وفي الإبل ‏\"‏ ‏.‏ فذكر صدقتها كما ذكر الزهري قال ‏\"‏ وفي خمس وعشرين خمسة من الغنم فإذا زادت واحدة ففيها ابنة مخاض فإن لم تكن بنت مخاض فابن لبون ذكر إلى خمس وثلاثين فإذا زادت واحدة ففيها بنت لبون إلى خمس وأربعين فإذا زادت واحدة ففيها حقة طروقة الجمل إلى ستين ‏\"‏ ‏.‏ ثم ساق مثل حديث الزهري قال ‏\"‏ فإذا زادت واحدة - يعني واحدة وتسعين - ففيها حقتان طروقتا الجمل إلى عشرين ومائة فإن كانت الإبل أكثر من ذلك ففي كل خمسين حقة ولا يفرق بين مجتمع ولا يجمع بين مفترق خشية الصدقة ولا تؤخذ في الصدقة هرمة ولا ذات عوار ولا تيس إلا أن يشاء المصدق وفي النبات ما سقته الأنهار أو سقت السماء العشر وما سقى الغرب ففيه نصف العشر ‏\"‏ ‏.‏ وفي حديث عاصم والحارث ‏\"‏ الصدقة في كل عام ‏\"‏ ‏.‏ قال زهير أحسبه قال ‏\"‏ مرة ‏\"‏ ‏.‏ وفي حديث عاصم ‏\"‏ إذا لم يكن في الإبل ابنة مخاض ولا ابن لبون فعشرة دراهم أو شاتان ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": 1573,
			"text": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني جرير بن حازم، وسمى، آخر عن أبي إسحاق، عن عاصم بن ضمرة، والحارث الأعور، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم ببعض أول هذا الحديث قال ‏\"‏ فإذا كانت لك مائتا درهم وحال عليها الحول ففيها خمسة دراهم وليس عليك شىء - يعني في الذهب - حتى يكون لك عشرون دينارا فإذا كان لك عشرون دينارا وحال عليها الحول ففيها نصف دينار فما زاد فبحساب ذلك ‏\"‏ ‏.‏ قال فلا أدري أعلي يقول فبحساب ذلك ‏.‏ أو رفعه إلى النبي صلى الله عليه وسلم ‏\"‏ وليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏ إلا أن جريرا قال ابن وهب يزيد في الحديث عن النبي صلى الله عليه وسلم ‏\"‏ ليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": 1574,
			"text": "حدثنا عمرو بن عون، أخبرنا أبو عوانة، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، عليه السلام قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قد عفوت عن الخيل والرقيق فهاتوا صدقة الرقة من كل أربعين درهما درهم وليس في تسعين ومائة شىء فإذا بلغت مائتين ففيها خمسة دراهم ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث الأعمش عن أبي إسحاق كما قال أبو عوانة ورواه شيبان أبو معاوية وإبراهيم بن طهمان عن أبي إسحاق عن الحارث عن علي عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو داود وروى حديث النفيلي شعبة وسفيان وغيرهما عن أبي إسحاق عن عاصم عن علي لم يرفعوه أوقفوه على علي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": 1575,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا بهز بن حكيم، ح وحدثنا محمد بن العلاء، أخبرنا أبو أسامة، عن بهز بن حكيم، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في كل سائمة إبل في أربعين بنت لبون ولا يفرق إبل عن حسابها من أعطاها مؤتجرا ‏\"‏ ‏.‏ قال ابن العلاء ‏\"‏ مؤتجرا بها ‏\"‏ ‏.‏ ‏\"‏ فله أجرها ومن منعها فإنا آخذوها وشطر ماله عزمة من عزمات ربنا عز وجل ليس لآل محمد منها شىء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "حدثنا النفيلي، حدثنا أبو معاوية، عن الأعمش، عن أبي وائل، عن معاذ، أن النبي صلى الله عليه وسلم لما وجهه إلى اليمن أمره أن يأخذ من البقر من كل ثلاثين تبيعا أو تبيعة ومن كل أربعين مسنة ومن كل حالم - يعني محتلما - دينارا أو عدله من المعافر ثياب تكون باليمن ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": 1577,
			"text": "حدثنا عثمان بن أبي شيبة، والنفيلي، وابن المثنى، قالوا حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، عن مسروق، عن معاذ، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، عن سفيان، عن الأعمش، عن أبي وائل، عن مسروق، عن معاذ بن جبل، قال بعثه النبي صلى الله عليه وسلم إلى اليمن فذكر مثله لم يذكر ثيابا تكون باليمن ‏.‏ ولا ذكر يعني محتلما ‏.‏ قال أبو داود ورواه جرير ويعلى ومعمر وشعبة وأبو عوانة ويحيى بن سعيد عن الأعمش عن أبي وائل عن مسروق - قال يعلى ومعمر - عن معاذ مثله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": 1579,
			"text": "حدثنا مسدد، حدثنا أبو عوانة، عن هلال بن خباب، عن ميسرة أبي صالح، عن سويد بن غفلة، قال سرت أو قال أخبرني من، سار مع مصدق النبي صلى الله عليه وسلم فإذا في عهد رسول الله صلى الله عليه وسلم ‏\"‏ أن لا تأخذ من راضع لبن ولا تجمع بين مفترق ولا تفرق بين مجتمع ‏\"‏ ‏.‏ وكان إنما يأتي المياه حين ترد الغنم فيقول أدوا صدقات أموالكم ‏.‏ قال فعمد رجل منهم إلى ناقة كوماء - قال - قلت يا أبا صالح ما الكوماء قال عظيمة السنام - قال - فأبى أن يقبلها قال إني أحب أن تأخذ خير إبلي ‏.‏ قال فأبى أن يقبلها قال فخطم له أخرى دونها فأبى أن يقبلها ثم خطم له أخرى دونها فقبلها وقال إني آخذها وأخاف أن يجد على رسول الله صلى الله عليه وسلم يقول لي عمدت إلى رجل فتخيرت عليه إبله ‏.‏ قال أبو داود ورواه هشيم عن هلال بن خباب نحوه إلا أنه قال ‏\"‏ لا يفرق ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": 1580,
			"text": "حدثنا محمد بن الصباح البزاز، حدثنا شريك، عن عثمان بن أبي زرعة، عن أبي ليلى الكندي، عن سويد بن غفلة، قال أتانا مصدق النبي صلى الله عليه وسلم فأخذت بيده وقرأت في عهده ‏\"‏ لا يجمع بين مفترق ولا يفرق بين مجتمع خشية الصدقة ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ راضع لبن ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": 1581,
			"text": "حدثنا الحسن بن علي، حدثنا وكيع، عن زكريا بن إسحاق المكي، عن عمرو بن أبي سفيان الجمحي، عن مسلم بن ثفنة اليشكري، - قال الحسن روح يقول مسلم بن شعبة - قال استعمل نافع بن علقمة أبي على عرافة قومه فأمره أن يصدقهم قال فبعثني أبي في طائفة منهم فأتيت شيخا كبيرا يقال له سعر بن ديسم فقلت إن أبي بعثني إليك - يعني لأصدقك - قال ابن أخي وأى نحو تأخذون قلت نختار حتى إنا نتبين ضروع الغنم ‏.‏ قال ابن أخي فإني أحدثك أني كنت في شعب من هذه الشعاب على عهد رسول الله صلى الله عليه وسلم في غنم لي فجاءني رجلان على بعير فقالا لي إنا رسولا رسول الله صلى الله عليه وسلم إليك لتؤدي صدقة غنمك ‏.‏ فقلت ما على فيها فقالا شاة ‏.‏ فأعمد إلى شاة قد عرفت مكانها ممتلئة محضا وشحما فأخرجتها إليهما ‏.‏ فقالا هذه شاة الشافع وقد نهانا رسول الله صلى الله عليه وسلم أن نأخذ شافعا ‏.‏ قلت فأى شىء تأخذان قالا عناقا جذعة أو ثنية ‏.‏ قال فأعمد إلى عناق معتاط ‏.‏ والمعتاط التي لم تلد ولدا وقد حان ولادها فأخرجتها إليهما فقالا ناولناها ‏.‏ فجعلاها معهما على بعيرهما ثم انطلقا ‏.‏ قال أبو داود رواه أبو عاصم عن زكرياء قال أيضا مسلم بن شعبة ‏.‏ كما قال روح ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": 1582,
			"text": "حدثنا محمد بن يونس النسائي، حدثنا روح، حدثنا زكرياء بن إسحاق، بإسناده بهذا الحديث قال مسلم بن شعبة ‏.‏ قال فيه والشافع التي في بطنها الولد ‏.‏ قال أبو داود وقرأت في كتاب عبد الله بن سالم بحمص عند آل عمرو بن الحارث الحمصي عن الزبيدي قال وأخبرني يحيى بن جابر عن جبير بن نفير عن عبد الله بن معاوية الغاضري - من غاضرة قيس - قال قال النبي صلى الله عليه وسلم ‏ \"‏ ثلاث من فعلهن فقد طعم طعم الإيمان من عبد الله وحده وأنه لا إله إلا الله وأعطى زكاة ماله طيبة بها نفسه رافدة عليه كل عام ولا يعطي الهرمة ولا الدرنة ولا المريضة ولا الشرط اللئيمة ولكن من وسط أموالكم فإن الله لم يسألكم خيره ولم يأمركم بشره ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": 1583,
			"text": "حدثنا محمد بن منصور، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، قال حدثني عبد الله بن أبي بكر، عن يحيى بن عبد الله بن عبد الرحمن بن سعد بن زرارة، عن عمارة بن عمرو بن حزم، عن أبى بن كعب، قال بعثني النبي صلى الله عليه وسلم مصدقا فمررت برجل فلما جمع لي ماله لم أجد عليه فيه إلا ابنة مخاض فقلت له أد ابنة مخاض فإنها صدقتك ‏.‏ فقال ذاك ما لا لبن فيه ولا ظهر ولكن هذه ناقة فتية عظيمة سمينة فخذها ‏.‏ فقلت له ما أنا بآخذ ما لم أومر به وهذا رسول الله صلى الله عليه وسلم منك قريب فإن أحببت أن تأتيه فتعرض عليه ما عرضت على فافعل فإن قبله منك قبلته وإن رده عليك رددته ‏.‏ قال فإني فاعل فخرج معي وخرج بالناقة التي عرض على حتى قدمنا على رسول الله صلى الله عليه وسلم فقال له يا نبي الله أتاني رسولك ليأخذ مني صدقة مالي وايم الله ما قام في مالي رسول الله صلى الله عليه وسلم ولا رسوله قط قبله فجمعت له مالي فزعم أن ما على فيه ابنة مخاض وذلك ما لا لبن فيه ولا ظهر وقد عرضت عليه ناقة فتية عظيمة ليأخذها فأبى على وها هي ذه قد جئتك بها يا رسول الله ‏.‏ خذها فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ ذاك الذي عليك فإن تطوعت بخير آجرك الله فيه وقبلناه منك ‏\"‏ ‏.‏ قال فها هي ذه يا رسول الله قد جئتك بها فخذها ‏.‏ قال فأمر رسول الله صلى الله عليه وسلم بقبضها ودعا له في ماله بالبركة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": 1584,
			"text": "حدثنا أحمد بن حنبل، حدثنا وكيع، حدثنا زكريا بن إسحاق المكي، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏ \"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوك لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم وترد في فقرائهم فإن هم أطاعوك لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": 1585,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن سعد بن سنان، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ المعتدي في الصدقة كمانعها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": 1586,
			"text": "حدثنا مهدي بن حفص، ومحمد بن عبيد، - المعنى - قالا حدثنا حماد، عن أيوب، عن رجل، يقال له ديسم - وقال ابن عبيد من بني سدوس - عن بشير بن الخصاصية، - قال ابن عبيد في حديثه وما كان اسمه بشيرا - ولكن رسول الله صلى الله عليه وسلم سماه بشيرا قال قلنا إن أهل الصدقة يعتدون علينا أفنكتم من أموالنا بقدر ما يعتدون علينا فقال ‏ \"‏ لا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": 1587,
			"text": "حدثنا الحسن بن علي، ويحيى بن موسى، قالا حدثنا عبد الرزاق، عن معمر، عن أيوب، بإسناده ومعناه إلا أنه قال قلنا يا رسول الله إن أصحاب الصدقة يعتدون ‏.‏ قال أبو داود رفعه عبد الرزاق عن معمر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": 1588,
			"text": "حدثنا عباس بن عبد العظيم، ومحمد بن المثنى، قالا حدثنا بشر بن عمر، عن أبي الغصن، عن صخر بن إسحاق، عن عبد الرحمن بن جابر بن عتيك، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ سيأتيكم ركب مبغضون فإذا جاءوكم فرحبوا بهم وخلوا بينهم وبين ما يبتغون فإن عدلوا فلأنفسهم وإن ظلموا فعليها وأرضوهم فإن تمام زكاتكم رضاهم وليدعوا لكم ‏\"‏ ‏.‏ قال أبو داود أبو الغصن هو ثابت بن قيس بن غصن ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": 1589,
			"text": "حدثنا أبو كامل، حدثنا عبد الواحد يعني ابن زياد، ح وحدثنا عثمان بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، - وهذا حديث أبي كامل - عن محمد بن أبي إسماعيل، حدثنا عبد الرحمن بن هلال العبسي، عن جرير بن عبد الله، قال جاء ناس - يعني من الأعراب - إلى رسول الله صلى الله عليه وسلم فقالوا إن ناسا من المصدقين يأتونا فيظلمونا ‏.‏ قال فقال ‏\"‏ أرضوا مصدقيكم ‏\"‏ ‏.‏ قالوا يا رسول الله وإن ظلمونا قال ‏\"‏ أرضوا مصدقيكم ‏\"‏ ‏.‏ زاد عثمان ‏\"‏ وإن ظلمتم ‏\"‏ ‏.‏ قال أبو كامل في حديثه قال جرير ما صدر عني مصدق بعد ما سمعت هذا من رسول الله صلى الله عليه وسلم إلا وهو عني راض ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "حدثنا حفص بن عمر النمري، وأبو الوليد الطيالسي، - المعنى - قالا أخبرنا شعبة، عن عمرو بن مرة، عن عبد الله بن أبي أوفى، قال كان أبي من أصحاب الشجرة وكان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏ ‏.‏ قال فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": 1591,
			"text": "حدثنا قتيبة بن سعيد، حدثنا ابن أبي عدي، عن ابن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا جلب ولا جنب ولا تؤخذ صدقاتهم إلا في دورهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": 1592,
			"text": "حدثنا الحسن بن علي، حدثنا يعقوب بن إبراهيم، قال سمعت أبي يقول، عن محمد بن إسحاق، في قوله ‏ \"‏ لا جلب ولا جنب ‏\"‏ ‏.‏ قال أن تصدق الماشية في مواضعها ولا تجلب إلى المصدق والجنب عن غير هذه الفريضة أيضا لا يجنب أصحابها يقول ولا يكون الرجل بأقصى مواضع أصحاب الصدقة فتجنب إليه ولكن تؤخذ في موضعه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": 1593,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن عبد الله بن عمر، أن عمر بن الخطاب، - رضى الله عنه - حمل على فرس في سبيل الله فوجده يباع فأراد أن يبتاعه فسأل رسول الله صلى الله عليه وسلم عن ذلك فقال ‏ \"‏ لا تبتعه ولا تعد في صدقتك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": 1594,
			"text": "حدثنا محمد بن المثنى، ومحمد بن يحيى بن فياض، قالا حدثنا عبد الوهاب، حدثنا عبيد الله، عن رجل، عن مكحول، عن عراك بن مالك، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس في الخيل والرقيق زكاة إلا زكاة الفطر في الرقيق ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": 1595,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "حدثنا هارون بن سعيد بن الهيثم الأيلي، حدثنا عبد الله بن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ فيما سقت السماء والأنهار والعيون أو كان بعلا العشر وفيما سقي بالسواني أو النضح نصف العشر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": 1597,
			"text": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عمرو، عن أبي الزبير، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ فيما سقت الأنهار والعيون العشر وما سقي بالسواني ففيه نصف العشر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "حدثنا الهيثم بن خالد الجهني، وحسين بن الأسود العجلي، قالا قال وكيع البعل الكبوس الذي ينبت من ماء السماء ‏.‏ قال ابن الأسود وقال يحيى يعني ابن آدم سألت أبا إياس الأسدي عن البعل فقال الذي يسقى بماء السماء ‏.‏ وقال النضر بن شميل البعل ماء المطر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "حدثنا الربيع بن سليمان، حدثنا ابن وهب، عن سليمان، - يعني ابن بلال - عن شريك بن عبد الله بن أبي نمر، عن عطاء بن يسار، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم بعثه إلى اليمن فقال ‏ \"‏ خذ الحب من الحب والشاة من الغنم والبعير من الإبل والبقرة من البقر ‏\"‏ ‏.‏ قال أبو داود شبرت قثاءة بمصر ثلاثة عشر شبرا ورأيت أترجة على بعير بقطعتين قطعت وصيرت على مثل عدلين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا موسى بن أعين، عن عمرو بن الحارث المصري، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال - أحد بني متعان - إلى رسول الله صلى الله عليه وسلم بعشور نحل له وكان سأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب - رضى الله عنه - كتب سفيان بن وهب إلى عمر بن الخطاب يسأله عن ذلك فكتب عمر رضى الله عنه إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشور نحله له فاحم له سلبة وإلا فإنما هو ذباب غيث يأكله من يشاء ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "حدثنا أحمد بن عبدة الضبي، حدثنا المغيرة، - ونسبه إلى عبد الرحمن بن الحارث المخزومي - قال حدثني أبي، عن عمرو بن شعيب، عن أبيه، عن جده، أن شبابة، - بطن من فهم - فذكر نحوه قال من كل عشر قرب قربة وقال سفيان بن عبد الله الثقفي قال وكان يحمي لهم واديين زاد فأدوا إليه ما كانوا يؤدون إلى رسول الله صلى الله عليه وسلم وحمى لهم وادييهم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "حدثنا الربيع بن سليمان المؤذن، حدثنا ابن وهب، أخبرني أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن جده، أن بطنا، من فهم بمعنى المغيرة قال من عشر قرب قربة ‏.‏ وقال واديين لهم ‏.‏",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "حدثنا عبد العزيز بن السري الناقط، حدثنا بشر بن منصور، عن عبد الرحمن بن إسحاق، عن الزهري، عن سعيد بن المسيب، عن عتاب بن أسيد، قال أمر رسول الله صلى الله عليه وسلم أن يخرص العنب كما يخرص النخل وتؤخذ زكاته زبيبا كما تؤخذ زكاة النخل تمرا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "حدثنا محمد بن إسحاق المسيبي، حدثنا عبد الله بن نافع، عن محمد بن صالح التمار، عن ابن شهاب، بإسناده ومعناه ‏.‏ قال أبو داود وسعيد لم يسمع من عتاب شيئا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن خبيب بن عبد الرحمن، عن عبد الرحمن بن مسعود، قال جاء سهل بن أبي حثمة إلى مجلسنا قال أمرنا رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا خرصتم فخذوا ودعوا الثلث فإن لم تدعوا أو تجدوا الثلث فدعوا الربع ‏\"‏ ‏.‏ قال أبو داود الخارص يدع الثلث للحرفة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "حدثنا يحيى بن معين، حدثنا حجاج، عن ابن جريج، قال أخبرت عن ابن شهاب، عن عروة، عن عائشة، - رضى الله عنها - أنها قالت وهي تذكر شأن خيبر كان النبي صلى الله عليه وسلم يبعث عبد الله بن رواحة إلى يهود خيبر فيخرص النخل حين يطيب قبل أن يؤكل منه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "حدثنا محمد بن يحيى بن فارس، حدثنا سعيد بن سليمان، حدثنا عباد، عن سفيان بن حسين، عن الزهري، عن أبي أمامة بن سهل، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن الجعرور ولون الحبيق أن يؤخذا في الصدقة ‏.‏ قال الزهري لونين من تمر المدينة ‏.‏ قال أبو داود وأسنده أيضا أبو الوليد عن سليمان بن كثير عن الزهري ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "حدثنا نصر بن عاصم الأنطاكي، حدثنا يحيى، - يعني القطان - عن عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة، عن عوف بن مالك، قال دخل علينا رسول الله صلى الله عليه وسلم المسجد وبيده عصا وقد علق رجل منا قنا حشفا فطعن بالعصا في ذلك القنو وقال ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب منها ‏\"‏ ‏.‏ وقال ‏\"‏ إن رب هذه الصدقة يأكل الحشف يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "حدثنا محمود بن خالد الدمشقي، وعبد الله بن عبد الرحمن السمرقندي، قالا حدثنا مروان، قال عبد الله حدثنا أبو يزيد الخولاني، - وكان شيخ صدق وكان ابن وهب يروي عنه - حدثنا سيار بن عبد الرحمن، - قال محمود الصدفي - عن عكرمة، عن ابن عباس، قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر طهرة للصائم من اللغو والرفث وطعمة للمساكين من أداها قبل الصلاة فهي زكاة مقبولة ومن أداها بعد الصلاة فهي صدقة من الصدقات ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، قال أمرنا رسول الله صلى الله عليه وسلم بزكاة الفطر أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏ قال فكان ابن عمر يؤديها قبل ذلك باليوم واليومين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا مالك، - وقرأه على مالك أيضا - عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر - قال فيه فيما قرأه على مالك - زكاة الفطر من رمضان صاع من تمر أو صاع من شعير على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "حدثنا يحيى بن محمد بن السكن، حدثنا محمد بن جهضم، حدثنا إسماعيل بن جعفر، عن عمر بن نافع، عن أبيه، عن عبد الله بن عمر، قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر صاعا فذكر بمعنى مالك زاد والصغير والكبير وأمر بها أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏ قال أبو داود رواه عبد الله العمري عن نافع بإسناده قال على كل مسلم ورواه سعيد الجمحي عن عبيد الله عن نافع قال فيه من المسلمين والمشهور عن عبيد الله ليس فيه من المسلمين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "حدثنا مسدد، أن يحيى بن سعيد، وبشر بن المفضل، حدثاهم عن عبيد الله، ح وحدثنا موسى بن إسماعيل، حدثنا أبان، عن عبيد الله، عن نافع، عن عبد الله، عن النبي صلى الله عليه وسلم أنه فرض صدقة الفطر صاعا من شعير أو تمر على الصغير والكبير والحر والمملوك زاد موسى والذكر والأنثى ‏.‏ قال أبو داود قال فيه أيوب وعبد الله - يعني العمري - في حديثهما عن نافع ذكر أو أنثى ‏.‏ أيضا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "حدثنا الهيثم بن خالد الجهني، حدثنا حسين بن علي الجعفي، عن زائدة، حدثنا عبد العزيز بن أبي رواد، عن نافع، عن عبد الله بن عمر، قال كان الناس يخرجون صدقة الفطر على عهد رسول الله صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏ قال قال عبد الله فلما كان عمر - رضى الله عنه - وكثرت الحنطة جعل عمر نصف صاع حنطة مكان صاع من تلك الأشياء ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "حدثنا مسدد، وسليمان بن داود العتكي، قالا حدثنا حماد، عن أيوب، عن نافع، قال قال عبد الله فعدل الناس بعد نصف صاع من بر ‏.‏ قال وكان عبد الله يعطي التمر فأعوز أهل المدينة التمر عاما فأعطى الشعير ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا داود، - يعني ابن قيس - عن عياض بن عبد الله، عن أبي سعيد الخدري، قال كنا نخرج إذ كان فينا رسول الله صلى الله عليه وسلم زكاة الفطر عن كل صغير وكبير حر أو مملوك صاعا من طعام أو صاعا من أقط أو صاعا من شعير أو صاعا من تمر أو صاعا من زبيب فلم نزل نخرجه حتى قدم معاوية حاجا أو معتمرا فكلم الناس على المنبر فكان فيما كلم به الناس أن قال إني أرى أن مدين من سمراء الشام تعدل صاعا من تمر فأخذ الناس بذلك ‏.‏ فقال أبو سعيد فأما أنا فلا أزال أخرجه أبدا ما عشت ‏.‏ قال أبو داود رواه ابن علية وعبدة وغيرهما عن ابن إسحاق عن عبد الله بن عبد الله بن عثمان بن حكيم بن حزام عن عياض عن أبي سعيد بمعناه وذكر رجل واحد فيه عن ابن علية أو صاع حنطة ‏.‏ وليس بمحفوظ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "حدثنا مسدد، أخبرنا إسماعيل، ليس فيه ذكر الحنطة ‏.‏ قال أبو داود وقد ذكر معاوية بن هشام في هذا الحديث عن الثوري، عن زيد بن أسلم، عن عياض، عن أبي سعيد، ‏ \"‏ نصف صاع من بر ‏\"‏ ‏.‏ وهو وهم من معاوية بن هشام أو ممن رواه عنه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "حدثنا حامد بن يحيى، أخبرنا سفيان، ح وحدثنا مسدد، حدثنا يحيى، عن ابن عجلان، سمع عياضا، قال سمعت أبا سعيد الخدري، يقول لا أخرج أبدا إلا صاعا إنا كنا نخرج على عهد رسول الله صلى الله عليه وسلم صاع تمر أو شعير أو أقط أو زبيب هذا حديث يحيى زاد سفيان أو صاعا من دقيق قال حامد فأنكروا عليه فتركه سفيان ‏.‏ قال أبو داود فهذه الزيادة وهم من ابن عيينة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "حدثنا مسدد، وسليمان بن داود العتكي، قالا حدثنا حماد بن زيد، عن النعمان بن راشد، عن الزهري، - قال مسدد عن ثعلبة بن عبد الله بن أبي صعير، - عن أبيه، - وقال سليمان بن داود عبد الله بن ثعلبة أو ثعلبة بن عبد الله بن أبي صعير عن أبيه، - قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ صاع من بر أو قمح على كل اثنين صغير أو كبير حر أو عبد ذكر أو أنثى أما غنيكم فيزكيه الله وأما فقيركم فيرد الله عليه أكثر مما أعطاه ‏\"‏ ‏.‏ زاد سليمان في حديثه غني أو فقير ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "حدثنا علي بن الحسن الدرابجردي، حدثنا عبد الله بن يزيد، حدثنا همام، حدثنا بكر، - هو ابن وائل - عن الزهري، عن ثعلبة بن عبد الله، أو قال عبد الله بن ثعلبة عن النبي صلى الله عليه وسلم ح وحدثنا محمد بن يحيى النيسابوري، حدثنا موسى بن إسماعيل، حدثنا همام، عن بكر الكوفي، قال محمد بن يحيى هو بكر بن وائل بن داود أن الزهري، حدثهم عن عبد الله بن ثعلبة بن صعير، عن أبيه، قال قام رسول الله صلى الله عليه وسلم خطيبا فأمر بصدقة الفطر صاع تمر أو صاع شعير عن كل رأس زاد علي في حديثه أو صاع بر أو قمح بين اثنين - ثم اتفقا - عن الصغير والكبير والحر والعبد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "حدثنا أحمد بن صالح، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال وقال ابن شهاب قال عبد الله بن ثعلبة قال ابن صالح قال العدوي وإنما هو العذري خطب رسول الله صلى الله عليه وسلم الناس قبل الفطر بيومين بمعنى حديث المقرئ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "حدثنا محمد بن المثنى، حدثنا سهل بن يوسف، قال حميد أخبرنا عن الحسن، قال خطب ابن عباس رحمه الله في آخر رمضان على منبر البصرة فقال أخرجوا صدقة صومكم فكأن الناس لم يعلموا فقال من ها هنا من أهل المدينة قوموا إلى إخوانكم فعلموهم فإنهم لا يعلمون فرض رسول الله صلى الله عليه وسلم هذه الصدقة صاعا من تمر أو شعير أو نصف صاع من قمح على كل حر أو مملوك ذكر أو أنثى صغير أو كبير فلما قدم علي - رضى الله عنه - رأى رخص السعر قال قد أوسع الله عليكم فلو جعلتموه صاعا من كل شىء ‏.‏ قال حميد وكان الحسن يرى صدقة رمضان على من صام ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "حدثنا الحسن بن الصباح، حدثنا شبابة، عن ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال بعث النبي صلى الله عليه وسلم عمر بن الخطاب على الصدقة فمنع ابن جميل وخالد بن الوليد والعباس فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما ينقم ابن جميل إلا أن كان فقيرا فأغناه الله وأما خالد بن الوليد فإنكم تظلمون خالدا فقد احتبس أدراعه وأعتده في سبيل الله وأما العباس عم رسول الله صلى الله عليه وسلم فهي على ومثلها ‏\"‏ ‏.‏ ثم قال ‏\"‏ أما شعرت أن عم الرجل صنو الأب ‏\"‏ ‏.‏ أو ‏\"‏ صنو أبيه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "حدثنا سعيد بن منصور، حدثنا إسماعيل بن زكريا، عن الحجاج بن دينار، عن الحكم، عن حجية، عن علي، أن العباس، سأل النبي صلى الله عليه وسلم في تعجيل صدقته قبل أن تحل فرخص له في ذلك ‏.‏ قال مرة فأذن له في ذلك ‏.‏ قال أبو داود وروى هذا الحديث هشيم عن منصور بن زاذان عن الحكم عن الحسن بن مسلم عن النبي صلى الله عليه وسلم وحديث هشيم أصح ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "حدثنا نصر بن علي، أخبرنا أبي، أخبرنا إبراهيم بن عطاء، مولى عمران بن حصين عن أبيه، أن زيادا، أو بعض الأمراء بعث عمران بن حصين على الصدقة فلما رجع قال لعمران أين المال قال وللمال أرسلتني أخذناها من حيث كنا نأخذها على عهد رسول الله صلى الله عليه وسلم ووضعناها حيث كنا نضعها على عهد رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "حدثنا الحسن بن علي، حدثنا يحيى بن آدم، حدثنا سفيان، عن حكيم بن جبير، عن محمد بن عبد الرحمن بن يزيد، عن أبيه، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وله ما يغنيه جاءت يوم القيامة خموش - أو خدوش - أو كدوح - في وجهه ‏\"‏ ‏.‏ فقيل يا رسول الله وما الغنى قال ‏\"‏ خمسون درهما أو قيمتها من الذهب ‏\"‏ ‏.‏ قال يحيى فقال عبد الله بن عثمان لسفيان حفظي أن شعبة لا يروي عن حكيم بن جبير فقال سفيان فقد حدثناه زبيد عن محمد بن عبد الرحمن بن يزيد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن رجل، من بني أسد أنه قال نزلت أنا وأهلي، ببقيع الغرقد فقال لي أهلي اذهب إلى رسول الله صلى الله عليه وسلم فسله لنا شيئا نأكله فجعلوا يذكرون من حاجتهم فذهبت إلى رسول الله صلى الله عليه وسلم فوجدت عنده رجلا يسأله ورسول الله صلى الله عليه وسلم يقول ‏\"‏ لا أجد ما أعطيك ‏\"‏ ‏.‏ فتولى الرجل عنه وهو مغضب وهو يقول لعمري إنك لتعطي من شئت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يغضب على أن لا أجد ما أعطيه من سأل منكم وله أوقية أو عدلها فقد سأل إلحافا ‏\"‏ ‏.‏ قال الأسدي فقلت للقحة لنا خير من أوقية والأوقية أربعون درهما ‏.‏ قال فرجعت ولم أسأله فقدم على رسول الله صلى الله عليه وسلم بعد ذلك شعير أو زبيب فقسم لنا منه - أو كما قال - حتى أغنانا الله ‏.‏ قال أبو داود هكذا رواه الثوري كما قال مالك ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "حدثنا قتيبة بن سعيد، وهشام بن عمار، قالا حدثنا عبد الرحمن بن أبي الرجال، عن عمارة بن غزية، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه أبي سعيد، قال قال رسول الله ‏ \"‏ من سأل وله قيمة أوقية فقد ألحف ‏\"‏ ‏.‏ فقلت ناقتي الياقوتة هي خير من أوقية ‏.‏ قال هشام خير من أربعين درهما فرجعت فلم أسأله شيئا زاد هشام في حديثه وكانت الأوقية على عهد رسول الله صلى الله عليه وسلم أربعين درهما ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "حدثنا عبد الله بن محمد النفيلي، حدثنا مسكين، حدثنا محمد بن المهاجر، عن ربيعة بن يزيد، عن أبي كبشة السلولي، حدثنا سهل ابن الحنظلية، قال قدم على رسول الله عيينة بن حصن والأقرع بن حابس فسألاه فأمر لهما بما سألا وأمر معاوية فكتب لهما بما سألا فأما الأقرع فأخذ كتابه فلفه في عمامته وانطلق وأما عيينة فأخذ كتابه وأتى النبي صلى الله عليه وسلم مكانه فقال يا محمد أتراني حاملا إلى قومي كتابا لا أدري ما فيه كصحيفة المتلمس ‏.‏ فأخبر معاوية بقوله رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وعنده ما يغنيه فإنما يستكثر من النار ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ من جمر جهنم ‏\"‏ ‏.‏ فقالوا يا رسول الله وما يغنيه وقال النفيلي في موضع آخر وما الغنى الذي لا تنبغي معه المسألة قال ‏\"‏ قدر ما يغديه ويعشيه ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ أن يكون له شبع يوم وليلة أو ليلة ويوم ‏\"‏ ‏.‏ وكان حدثنا به مختصرا على هذه الألفاظ التي ذكرت ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "حدثنا عبد الله بن مسلمة، حدثنا عبد الله، - يعني ابن عمر بن غانم - عن عبد الرحمن بن زياد، أنه سمع زياد بن نعيم الحضرمي، أنه سمع زياد بن الحارث الصدائي، قال أتيت رسول الله صلى الله عليه وسلم فبايعته فذكر حديثا طويلا قال فأتاه رجل فقال أعطني من الصدقة ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله تعالى لم يرض بحكم نبي ولا غيره في الصدقات حتى حكم فيها هو فجزأها ثمانية أجزاء فإن كنت من تلك الأجزاء أعطيتك حقك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "حدثنا عثمان بن أبي شيبة، وزهير بن حرب، قالا حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس المسكين الذي ترده التمرة والتمرتان والأكلة والأكلتان ولكن المسكين الذي لا يسأل الناس شيئا ولا يفطنون به فيعطونه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "حدثنا مسدد، وعبيد الله بن عمر، وأبو كامل - المعنى - قالوا حدثنا عبد الواحد بن زياد، حدثنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم مثله قال ‏\"‏ ولكن المسكين المتعفف ‏\"‏ ‏.‏ زاد مسدد في حديثه ‏\"‏ ليس له ما يستغني به الذي لا يسأل ولا يعلم بحاجته فيتصدق عليه فذاك المحروم ‏\"‏ ‏.‏ ولم يذكر مسدد ‏\"‏ المتعفف الذي لا يسأل ‏\"‏ ‏.‏ قال أبو داود روى هذا محمد بن ثور وعبد الرزاق عن معمر جعلا المحروم من كلام الزهري وهذا أصح ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا هشام بن عروة، عن أبيه، عن عبيد الله بن عدي بن الخيار، قال أخبرني رجلان، أنهما أتيا النبي صلى الله عليه وسلم في حجة الوداع وهو يقسم الصدقة فسألاه منها فرفع فينا البصر وخفضه فرآنا جلدين فقال ‏ \"‏ إن شئتما أعطيتكما ولا حظ فيها لغني ولا لقوي مكتسب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "حدثنا عباد بن موسى الأنباري الختلي، حدثنا إبراهيم، - يعني ابن سعد - قال أخبرني أبي، عن ريحان بن يزيد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ قال أبو داود رواه سفيان عن سعد بن إبراهيم كما قال إبراهيم ورواه شعبة عن سعد قال ‏\"‏ لذي مرة قوي ‏\"‏ ‏.‏ والأحاديث الأخر عن النبي صلى الله عليه وسلم بعضها ‏\"‏ لذي مرة قوي ‏\"‏ ‏.‏ وبعضها ‏\"‏ لذي مرة سوي ‏\"‏ ‏.‏ وقال عطاء بن زهير إنه لقي عبد الله بن عمرو فقال إن الصدقة لا تحل لقوي ولا لذي مرة سوي ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تحل الصدقة لغني إلا لخمسة لغاز في سبيل الله أو لعامل عليها أو لغارم أو لرجل اشتراها بماله أو لرجل كان له جار مسكين فتصدق على المسكين فأهداها المسكين للغني ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، أخبرنا معمر، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم بمعناه ‏.‏ قال أبو داود ورواه ابن عيينة عن زيد كما قال مالك ورواه الثوري عن زيد قال حدثني الثبت عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "حدثنا محمد بن عوف الطائي، حدثنا الفريابي، حدثنا سفيان، عن عمران البارقي، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تحل الصدقة لغني إلا في سبيل الله أو ابن السبيل أو جار فقير يتصدق عليه فيهدي لك أو يدعوك ‏\"‏ ‏.‏ قال أبو داود ورواه فراس وابن أبي ليلى عن عطية عن أبي سعيد عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "حدثنا الحسن بن محمد بن الصباح، حدثنا أبو نعيم، حدثني سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن النبي صلى الله عليه وسلم وداه بمائة من إبل الصدقة - يعني دية الأنصاري الذي قتل بخيبر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن عبد الملك بن عمير، عن زيد بن عقبة الفزاري، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ المسائل كدوح يكدح بها الرجل وجهه فمن شاء أبقى على وجهه ومن شاء ترك إلا أن يسأل الرجل ذا سلطان أو في أمر لا يجد منه بدا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "حدثنا مسدد، حدثنا حماد بن زيد، عن هارون بن رياب، قال حدثني كنانة بن نعيم العدوي، عن قبيصة بن مخارق الهلالي، قال تحملت حمالة فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ أقم يا قبيصة حتى تأتينا الصدقة فنأمر لك بها ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا قبيصة إن المسألة لا تحل إلا لأحد ثلاثة رجل تحمل حمالة فحلت له المسألة فسأل حتى يصيبها ثم يمسك ورجل أصابته جائحة فاجتاحت ماله فحلت له المسألة فسأل حتى يصيب قواما من عيش ‏\"‏ ‏.‏ أو قال ‏\"‏ سدادا من عيش ‏\"‏ ‏.‏ ‏\"‏ ورجل أصابته فاقة حتى يقول ثلاثة من ذوي الحجا من قومه قد أصابت فلانا الفاقة فحلت له المسألة فسأل حتى يصيب قواما من عيش - أو سدادا من عيش - ثم يمسك وما سواهن من المسألة يا قبيصة سحت يأكلها صاحبها سحتا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "حدثنا عبد الله بن مسلمة، أخبرنا عيسى بن يونس، عن الأخضر بن عجلان، عن أبي بكر الحنفي، عن أنس بن مالك، أن رجلا، من الأنصار أتى النبي صلى الله عليه وسلم يسأله فقال ‏\"‏ أما في بيتك شىء ‏\"‏ ‏.‏ قال بلى حلس نلبس بعضه ونبسط بعضه وقعب نشرب فيه من الماء ‏.‏ قال ‏\"‏ ائتني بهما ‏\"‏ ‏.‏ فأتاه بهما فأخذهما رسول الله صلى الله عليه وسلم بيده وقال ‏\"‏ من يشتري هذين ‏\"‏ ‏.‏ قال رجل أنا آخذهما بدرهم ‏.‏ قال ‏\"‏ من يزيد على درهم ‏\"‏ ‏.‏ مرتين أو ثلاثا قال رجل أنا آخذهما بدرهمين ‏.‏ فأعطاهما إياه وأخذ الدرهمين وأعطاهما الأنصاري وقال ‏\"‏ اشتر بأحدهما طعاما فانبذه إلى أهلك واشتر بالآخر قدوما فأتني به ‏\"‏ ‏.‏ فأتاه به فشد فيه رسول الله صلى الله عليه وسلم عودا بيده ثم قال له ‏\"‏ اذهب فاحتطب وبع ولا أرينك خمسة عشر يوما ‏\"‏ ‏.‏ فذهب الرجل يحتطب ويبيع فجاء وقد أصاب عشرة دراهم فاشترى ببعضها ثوبا وببعضها طعاما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا خير لك من أن تجيء المسألة نكتة في وجهك يوم القيامة إن المسألة لا تصلح إلا لثلاثة لذي فقر مدقع أو لذي غرم مفظع أو لذي دم موجع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "حدثنا هشام بن عمار، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو إلى فحبيب وأما هو عندي فأمين عوف بن مالك قال كنا عند رسول الله صلى الله عليه وسلم سبعة أو ثمانية أو تسعة فقال ‏\"‏ ألا تبايعون رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ وكنا حديث عهد ببيعة قلنا قد بايعناك حتى قالها ثلاثا فبسطنا أيدينا فبايعناه فقال قائل يا رسول الله إنا قد بايعناك فعلام نبايعك قال ‏\"‏ أن تعبدوا الله ولا تشركوا به شيئا وتصلوا الصلوات الخمس وتسمعوا وتطيعوا ‏\"‏ ‏.‏ وأسر كلمة خفية قال ‏\"‏ ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ قال فلقد كان بعض أولئك النفر يسقط سوطه فما يسأل أحدا أن يناوله إياه ‏.‏ قال أبو داود حديث هشام لم يروه إلا سعيد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عاصم، عن أبي العالية، عن ثوبان، قال وكان ثوبان مولى رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من تكفل لي أن لا يسأل الناس شيئا وأتكفل له بالجنة ‏\"‏ ‏.‏ فقال ثوبان أنا ‏.‏ فكان لا يسأل أحدا شيئا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري، أن ناسا، من الأنصار سألوا رسول الله صلى الله عليه وسلم فأعطاهم ثم سألوه فأعطاهم حتى إذا نفد ما عنده قال ‏ \"‏ ما يكون عندي من خير فلن أدخره عنكم ومن يستعفف يعفه الله ومن يستغن يغنه الله ومن يتصبر يصبره الله وما أعطى الله أحدا من عطاء أوسع من الصبر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "حدثنا مسدد، حدثنا عبد الله بن داود، ح حدثنا عبد الملك بن حبيب أبو مروان، حدثنا ابن المبارك، - وهذا حديثه - عن بشير بن سلمان، عن سيار أبي حمزة، عن طارق، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أصابته فاقة فأنزلها بالناس لم تسد فاقته ومن أنزلها بالله أوشك الله له بالغنى إما بموت عاجل أو غنى عاجل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن جعفر بن ربيعة، عن بكر بن سوادة، عن مسلم بن مخشي، عن ابن الفراسي، أن الفراسي، قال لرسول الله صلى الله عليه وسلم أسأل يا رسول الله فقال النبي صلى الله عليه وسلم ‏ \"‏ لا وإن كنت سائلا لا بد فاسأل الصالحين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "حدثنا أبو الوليد الطيالسي، حدثنا الليث، عن بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن ابن الساعدي، قال استعملني عمر - رضى الله عنه - على الصدقة فلما فرغت منها وأديتها إليه أمر لي بعمالة فقلت إنما عملت لله وأجري على الله ‏.‏ قال خذ ما أعطيت فإني قد عملت على عهد رسول الله صلى الله عليه وسلم فعملني فقلت مثل قولك فقال لي رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أعطيت شيئا من غير أن تسأله فكل وتصدق ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "حدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال وهو على المنبر وهو يذكر الصدقة والتعفف منها والمسألة ‏\"‏ اليد العليا خير من اليد السفلى واليد العليا المنفقة والسفلى السائلة ‏\"‏ ‏.‏ قال أبو داود اختلف على أيوب عن نافع في هذا الحديث قال عبد الوارث ‏\"‏ اليد العليا المتعففة ‏\"‏ ‏.‏ وقال أكثرهم عن حماد بن زيد عن أيوب ‏\"‏ اليد العليا المنفقة ‏\"‏ ‏.‏ وقال واحد عن حماد ‏\"‏ المتعففة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "حدثنا أحمد بن حنبل، حدثنا عبيدة بن حميد التيمي، حدثني أبو الزعراء، عن أبي الأحوص، عن أبيه، مالك بن نضلة قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الأيدي ثلاثة فيد الله العليا ويد المعطي التي تليها ويد السائل السفلى فأعط الفضل ولا تعجز عن نفسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "حدثنا محمد بن كثير، أخبرنا شعبة، عن الحكم، عن ابن أبي رافع، عن أبي رافع، أن النبي صلى الله عليه وسلم بعث رجلا على الصدقة من بني مخزوم فقال لأبي رافع اصحبني فإنك تصيب منها ‏.‏ قال حتى آتي النبي صلى الله عليه وسلم فأسأله فأتاه فسأله فقال ‏ \"‏ مولى القوم من أنفسهم وإنا لا تحل لنا الصدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "حدثنا موسى بن إسماعيل، ومسلم بن إبراهيم، - المعنى - قالا حدثنا حماد، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم كان يمر بالتمرة العائرة فما يمنعه من أخذها إلا مخافة أن تكون صدقة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "حدثنا نصر بن علي، أخبرنا أبي، عن خالد بن قيس، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم وجد تمرة فقال ‏ \"‏ لولا أني أخاف أن تكون صدقة لأكلتها ‏\"‏ ‏.‏ قال أبو داود رواه هشام عن قتادة هكذا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "حدثنا محمد بن عبيد المحاربي، حدثنا محمد بن فضيل، عن الأعمش، عن حبيب بن أبي ثابت، عن كريب، مولى ابن عباس عن ابن عباس، قال بعثني أبي إلى النبي صلى الله عليه وسلم في إبل أعطاها إياه من الصدقة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "حدثنا محمد بن العلاء، وعثمان بن أبي شيبة، قالا حدثنا محمد، - هو ابن أبي عبيدة - عن أبيه، عن الأعمش، عن سالم، عن كريب، مولى ابن عباس عن ابن عباس، نحوه زاد أبي يبدلها له ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "حدثنا عمرو بن مرزوق، قال أخبرنا شعبة، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم أتي بلحم قال ‏\"‏ ما هذا ‏\"‏ ‏.‏ قالوا شىء تصدق به على بريرة فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، بريدة أن امرأة، أتت رسول الله صلى الله عليه وسلم فقالت كنت تصدقت على أمي بوليدة وإنها ماتت وتركت تلك الوليدة ‏.‏ قال ‏ \"‏ قد وجب أجرك ورجعت إليك في الميراث ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "حدثنا قتيبة بن سعيد، حدثنا أبو عوانة، عن عاصم بن أبي النجود، عن شقيق، عن عبد الله، قال كنا نعد الماعون على عهد رسول الله صلى الله عليه وسلم عارية الدلو والقدر ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما من صاحب كنز لا يؤدي حقه إلا جعله الله يوم القيامة يحمى عليها في نار جهنم فتكوى بها جبهته وجنبه وظهره حتى يقضي الله تعالى بين عباده في يوم كان مقداره خمسين ألف سنة مما تعدون ثم يرى سبيله إما إلى الجنة وإما إلى النار وما من صاحب غنم لا يؤدي حقها إلا جاءت يوم القيامة أوفر ما كانت فيبطح لها بقاع قرقر فتنطحه بقرونها وتطؤه بأظلافها ليس فيها عقصاء ولا جلحاء كلما مضت أخراها ردت عليه أولاها حتى يحكم الله بين عباده في يوم كان مقداره خمسين ألف سنة مما تعدون ثم يرى سبيله إما إلى الجنة وإما إلى النار وما من صاحب إبل لا يؤدي حقها إلا جاءت يوم القيامة أوفر ما كانت فيبطح لها بقاع قرقر فتطؤه بأخفافها كلما مضت عليه أخراها ردت عليه أولاها حتى يحكم الله تعالى بين عباده في يوم كان مقداره خمسين ألف سنة مما تعدون ثم يرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "حدثنا جعفر بن مسافر، حدثنا ابن أبي فديك، عن هشام بن سعد، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال في قصة الإبل بعد قوله ‏\"‏ لا يؤدي حقها ‏\"‏ ‏.‏ قال ‏\"‏ ومن حقها حلبها يوم وردها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "حدثنا الحسن بن علي، حدثنا يزيد بن هارون، أخبرنا شعبة، عن قتادة، عن أبي عمر الغداني، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم نحو هذه القصة فقال له - يعني لأبي هريرة - فما حق الإبل قال تعطي الكريمة وتمنح الغزيرة وتفقر الظهر وتطرق الفحل وتسقي اللبن ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال قال أبو الزبير سمعت عبيد بن عمير، قال قال رجل يا رسول الله ما حق الإبل فذكر نحوه زاد ‏ \"‏ وإعارة دلوها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد بن سلمة، عن محمد بن إسحاق، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم أمر من كل جاد عشرة أوسق من التمر بقنو يعلق في المسجد للمساكين ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "حدثنا محمد بن عبد الله الخزاعي، وموسى بن إسماعيل، قالا حدثنا أبو الأشهب، عن أبي نضرة، عن أبي سعيد الخدري، قال بينما نحن مع رسول الله صلى الله عليه وسلم في سفر إذ جاء رجل على ناقة له فجعل يصرفها يمينا وشمالا فقال رسول الله صلى الله عليه وسلم ‏ \"‏ من كان عنده فضل ظهر فليعد به على من لا ظهر له ومن كان عنده فضل زاد فليعد به على من لا زاد له ‏\"‏ ‏.‏ حتى ظننا أنه لا حق لأحد منا في الفضل ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا يحيى بن يعلى المحاربي، حدثنا أبي، حدثنا غيلان، عن جعفر بن إياس، عن مجاهد، عن ابن عباس، قال لما نزلت هذه الآية ‏{‏ والذين يكنزون الذهب والفضة ‏}‏ قال كبر ذلك على المسلمين فقال عمر - رضى الله عنه أنا أفرج عنكم ‏.‏ فانطلق فقال يا نبي الله إنه كبر على أصحابك هذه الآية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله لم يفرض الزكاة إلا ليطيب ما بقي من أموالكم وإنما فرض المواريث لتكون لمن بعدكم ‏\"‏ ‏.‏ فكبر عمر ثم قال له ‏\"‏ ألا أخبرك بخير ما يكنز المرء المرأة الصالحة إذا نظر إليها سرته وإذا أمرها أطاعته وإذا غاب عنها حفظته ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا مصعب بن محمد بن شرحبيل، حدثني يعلى بن أبي يحيى، عن فاطمة بنت حسين، عن حسين بن علي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ للسائل حق وإن جاء على فرس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "حدثنا محمد بن رافع، حدثنا يحيى بن آدم، حدثنا زهير، عن شيخ، قال رأيت سفيان عنده عن فاطمة بنت حسين، عن أبيها، عن علي، عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن سعيد بن أبي سعيد، عن عبد الرحمن بن بجيد، عن جدته أم بجيد، وكانت، ممن بايع رسول الله صلى الله عليه وسلم أنها قالت له يا رسول الله صلى الله عليك إن المسكين ليقوم على بابي فما أجد له شيئا أعطيه إياه ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏ \"‏ إن لم تجدي له شيئا تعطينه إياه إلا ظلفا محرقا فادفعيه إليه في يده ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا عيسى بن يونس، حدثنا هشام بن عروة، عن أبيه، عن أسماء، قالت قدمت على أمي راغبة في عهد قريش وهي راغمة مشركة فقلت يا رسول الله إن أمي قدمت على وهي راغمة مشركة أفأصلها قال ‏ \"‏ نعم فصلي أمك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "حدثنا عبيد الله بن معاذ، حدثنا كهمس، عن سيار بن منظور، - رجل من بني فزارة - عن أبيه، عن امرأة، يقال لها بهيسة عن أبيها، قالت استأذن أبي النبي صلى الله عليه وسلم فدخل بينه وبين قميصه فجعل يقبل ويلتزم ثم قال يا رسول الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الماء ‏\"‏ ‏.‏ قال يا نبي الله ما الشىء الذي لا يحل منعه قال ‏\"‏ الملح ‏\"‏ ‏.‏ قال يا رسول الله ما الشىء الذي لا يحل منعه قال ‏\"‏ أن تفعل الخير خير لك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "حدثنا بشر بن آدم، حدثنا عبد الله بن بكر السهمي، حدثنا مبارك بن فضالة، عن ثابت البناني، عن عبد الرحمن بن أبي ليلى، عن عبد الرحمن بن أبي بكر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ هل منكم أحد أطعم اليوم مسكينا ‏\"‏ ‏.‏ فقال أبو بكر رضى الله عنه - دخلت المسجد فإذا أنا بسائل يسأل فوجدت كسرة خبز في يد عبد الرحمن فأخذتها منه فدفعتها إليه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "حدثنا أبو العباس القلوري، حدثنا يعقوب بن إسحاق الحضرمي، عن سليمان بن معاذ التيمي، حدثنا ابن المنكدر، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يسأل بوجه الله إلا الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن مجاهد، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من استعاذ بالله فأعيذوه ومن سأل بالله فأعطوه ومن دعاكم فأجيبوه ومن صنع إليكم معروفا فكافئوه فإن لم تجدوا ما تكافئونه فادعوا له حتى تروا أنكم قد كافأتموه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن جابر بن عبد الله الأنصاري، قال كنا عند رسول الله صلى الله عليه وسلم إذ جاء رجل بمثل بيضة من ذهب فقال يا رسول الله أصبت هذه من معدن فخذها فهي صدقة ما أملك غيرها ‏.‏ فأعرض عنه رسول الله صلى الله عليه وسلم ثم أتاه من قبل ركنه الأيمن فقال مثل ذلك فأعرض عنه ثم أتاه من قبل ركنه الأيسر فأعرض عنه رسول الله صلى الله عليه وسلم ثم أتاه من خلفه فأخذها رسول الله صلى الله عليه وسلم فحذفه بها فلو أصابته لأوجعته أو لعقرته فقال رسول الله صلى الله عليه وسلم ‏ \"‏ يأتي أحدكم بما يملك فيقول هذه صدقة ثم يقعد يستكف الناس خير الصدقة ما كان عن ظهر غنى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، عن ابن إسحاق، بإسناده ومعناه زاد ‏ \"‏ خذ عنا مالك لا حاجة لنا به ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن عجلان، عن عياض بن عبد الله بن سعد، سمع أبا سعيد الخدري، يقول دخل رجل المسجد فأمر النبي صلى الله عليه وسلم الناس أن يطرحوا ثيابا فطرحوا فأمر له منها بثوبين ثم حث على الصدقة فجاء فطرح أحد الثوبين فصاح به وقال ‏ \"‏ خذ ثوبك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن خير الصدقة ما ترك غنى أو تصدق به عن ظهر غنى وابدأ بمن تعول ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن موهب الرملي، قالا حدثنا الليث، عن أبي الزبير، عن يحيى بن جعدة، عن أبي هريرة، أنه قال يا رسول الله أى الصدقة أفضل قال ‏ \"‏ جهد المقل وابدأ بمن تعول ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "حدثنا أحمد بن صالح، وعثمان بن أبي شيبة، - وهذا حديثه - قالا حدثنا الفضل بن دكين، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، - رضى الله عنه - يقول أمرنا رسول الله صلى الله عليه وسلم يوما أن نتصدق فوافق ذلك مالا عندي فقلت اليوم أسبق أبا بكر إن سبقته يوما فجئت بنصف مالي فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قلت مثله ‏.‏ قال وأتى أبو بكر - رضى الله عنه - بكل ما عنده فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قال أبقيت لهم الله ورسوله ‏.‏ قلت لا أسابقك إلى شىء أبدا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "حدثنا محمد بن كثير، أخبرنا همام، عن قتادة، عن سعيد، أن سعدا، أتى النبي صلى الله عليه وسلم فقال أى الصدقة أعجب إليك قال ‏ \"‏ الماء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "حدثنا محمد بن عبد الرحيم، حدثنا محمد بن عرعرة، عن شعبة، عن قتادة، عن سعيد بن المسيب، والحسن، عن سعد بن عبادة، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "حدثنا محمد بن كثير، أخبرنا إسرائيل، عن أبي إسحاق، عن رجل، عن سعد بن عبادة، أنه قال يا رسول الله إن أم سعد ماتت فأى الصدقة أفضل قال ‏ \"‏ الماء ‏\"‏ ‏.‏ قال فحفر بئرا وقال هذه لأم سعد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "حدثنا علي بن الحسين بن إبراهيم بن إشكاب، حدثنا أبو بدر، حدثنا أبو خالد، - الذي كان ينزل في بني دالان - عن نبيح، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أيما مسلم كسا مسلما ثوبا على عرى كساه الله من خضر الجنة وأيما مسلم أطعم مسلما على جوع أطعمه الله من ثمار الجنة وأيما مسلم سقى مسلما على ظمإ سقاه الله من الرحيق المختوم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Batil"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "حدثنا إبراهيم بن موسى، قال أخبرنا إسرائيل، ح وحدثنا مسدد، حدثنا عيسى، - وهذا حديث مسدد وهو أتم - عن الأوزاعي، عن حسان بن عطية، عن أبي كبشة السلولي، قال سمعت عبد الله بن عمرو، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ أربعون خصلة أعلاهن منيحة العنز ما يعمل رجل بخصلة منها رجاء ثوابها وتصديق موعودها إلا أدخله الله بها الجنة ‏\"‏ ‏.‏ قال أبو داود في حديث مسدد قال حسان فعددنا ما دون منيحة العنز من رد السلام وتشميت العاطس وإماطة الأذى عن الطريق ونحوه فما استطعنا أن نبلغ خمس عشرة خصلة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "حدثنا عثمان بن أبي شيبة، ومحمد بن العلاء، - المعنى - قالا حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الخازن الأمين - الذي يعطي ما أمر به كاملا موفرا طيبة به نفسه حتى يدفعه إلى الذي أمر له به - أحد المتصدقين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "حدثنا مسدد، حدثنا أبو عوانة، عن منصور، عن شقيق، عن مسروق، عن عائشة، - رضى الله عنها - قالت قال النبي صلى الله عليه وسلم ‏ \"‏ إذا أنفقت المرأة من بيت زوجها غير مفسدة كان لها أجر ما أنفقت ولزوجها أجر ما اكتسب ولخازنه مثل ذلك لا ينقص بعضهم أجر بعض ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "حدثنا محمد بن سوار المصري، حدثنا عبد السلام بن حرب، عن يونس بن عبيد، عن زياد بن جبير، عن سعد، قال لما بايع رسول الله صلى الله عليه وسلم النساء قامت امرأة جليلة كأنها من نساء مضر فقالت يا نبي الله إنا كل على آبائنا وأبنائنا - قال أبو داود وأرى فيه وأزواجنا - فما يحل لنا من أموالهم فقال ‏ \"‏ الرطب تأكلنه وتهدينه ‏\"‏ ‏.‏ قال أبو داود الرطب الخبز والبقل والرطب ‏.‏ قال أبو داود وكذا رواه الثوري عن يونس ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أنفقت المرأة من كسب زوجها من غير أمره فلها نصف أجره ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "حدثنا محمد بن سوار المصري، حدثنا عبدة، عن عبد الملك، عن عطاء، عن أبي هريرة، في المرأة تصدق من بيت زوجها قال لا إلا من قوتها والأجر بينهما ولا يحل لها أن تصدق من مال زوجها إلا بإذنه ‏.‏ قال أبو داود هذا يضعف حديث همام ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن ثابت، عن أنس، قال لما نزلت ‏{‏ لن تنالوا البر حتى تنفقوا مما تحبون ‏}‏ قال أبو طلحة يا رسول الله أرى ربنا يسألنا من أموالنا فإني أشهدك أني قد جعلت أرضي بأريحاء له فقال له رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها في قرابتك ‏\"‏ ‏.‏ فقسمها بين حسان بن ثابت وأبى بن كعب ‏.‏ قال أبو داود بلغني عن الأنصاري محمد بن عبد الله قال أبو طلحة زيد بن سهل بن الأسود بن حرام بن عمرو بن زيد مناة بن عدي بن عمرو بن مالك بن النجار وحسان بن ثابت بن المنذر بن حرام يجتمعان إلى حرام وهو الأب الثالث وأبى بن كعب بن قيس بن عتيك بن زيد بن معاوية بن عمرو بن مالك بن النجار فعمرو يجمع حسان وأبا طلحة وأبيا ‏.‏ قال الأنصاري بين أبى وأبي طلحة ستة آباء ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "حدثنا هناد بن السري، عن عبدة، عن محمد بن إسحاق، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن ميمونة، زوج النبي صلى الله عليه وسلم قالت كانت لي جارية فأعتقتها فدخل على النبي صلى الله عليه وسلم فأخبرته فقال ‏ \"‏ آجرك الله أما إنك لو كنت أعطيتها أخوالك كان أعظم لأجرك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، عن محمد بن عجلان، عن المقبري، عن أبي هريرة، قال أمر النبي صلى الله عليه وسلم بالصدقة فقال رجل يا رسول الله عندي دينار ‏.‏ فقال ‏\"‏ تصدق به على نفسك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على ولدك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على زوجتك ‏\"‏ ‏.‏ أو قال ‏\"‏ زوجك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على خادمك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ أنت أبصر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا أبو إسحاق، عن وهب بن جابر الخيواني، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كفى بالمرء إثما أن يضيع من يقوت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "حدثنا أحمد بن صالح، ويعقوب بن كعب، - وهذا حديثه - قالا حدثنا ابن وهب، قال أخبرني يونس، عن الزهري، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من سره أن يبسط له في رزقه وينسأ له في أثره فليصل رحمه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "حدثنا مسدد، وأبو بكر بن أبي شيبة قالا حدثنا سفيان، عن الزهري، عن أبي سلمة، عن عبد الرحمن بن عوف، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ قال الله أنا الرحمن وهي الرحم شققت لها اسما من اسمي من وصلها وصلته ومن قطعها بتته ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "حدثنا محمد بن المتوكل العسقلاني، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، حدثني أبو سلمة، أن الرداد الليثي، أخبره عن عبد الرحمن بن عوف، أنه سمع رسول الله صلى الله عليه وسلم بمعناه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "حدثنا مسدد، حدثنا سفيان، عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه، يبلغ به النبي صلى الله عليه وسلم قال ‏ \"‏ لا يدخل الجنة قاطع رحم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "حدثنا ابن كثير، أخبرنا سفيان، عن الأعمش، والحسن بن عمرو، وفطر، عن مجاهد، عن عبد الله بن عمرو، - قال سفيان ولم يرفعه سليمان إلى النبي صلى الله عليه وسلم ورفعه فطر والحسن - قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس الواصل بالمكافئ ولكن الواصل هو الذي إذا قطعت رحمه وصلها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن الحارث، عن أبي كثير، عن عبد الله بن عمرو، قال خطب رسول الله صلى الله عليه وسلم فقال ‏ \"‏ إياكم والشح فإنما هلك من كان قبلكم بالشح أمرهم بالبخل فبخلوا وأمرهم بالقطيعة فقطعوا وأمرهم بالفجور ففجروا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "حدثنا مسدد، حدثنا إسماعيل، أخبرنا أيوب، حدثنا عبد الله بن أبي مليكة، حدثتني أسماء بنت أبي بكر، قالت قلت يا رسول الله ما لي شىء إلا ما أدخل على الزبير بيته أفأعطي منه قال ‏ \"‏ أعطي ولا توكي فيوكي عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "حدثنا مسدد، حدثنا إسماعيل، أخبرنا أيوب، عن عبد الله بن أبي مليكة، عن عائشة، أنها ذكرت عدة من مساكين - قال أبو داود وقال غيره أو عدة من صدقة - فقال لها رسول الله صلى الله عليه وسلم ‏ \"‏ أعطي ولا تحصي فيحصي عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		}
	]
}