{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس عورت نے اپنے ولی کی اجازت کے بغیر نکاح کیا تو اس کا نکاح باطل ہے، اس کا نکاح باطل ہے، اس کا نکاح باطل ہے، اگر اس نے اس سے دخول کر لیا ہے تو اس کی شرمگاہ حلال کر لینے کے عوض اس کے لیے مہر ہے، اور اگر اولیاء میں جھگڑا ہو جائے تو جس کا کوئی ولی نہ ہو اس کا ولی حاکم ہو گا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یحییٰ بن سعید انصاری، یحییٰ بن ایوب، سفیان ثوری، اور کئی حفاظ حدیث نے اسی طرح ابن جریج سے روایت کی ہے، ۳- ابوموسیٰ اشعری رضی الله عنہ کی ( پچھلی ) حدیث میں اختلاف ہے، اسے اسرائیل، شریک بن عبداللہ، ابو عوانہ، زہیر بن معاویہ اور قیس بن ربیع نے بسند «أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے، ۴- اور اسباط بن محمد اور زید بن حباب نے بسند «يونس بن أبي إسحق عن أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے، ۵- اور ابوعبیدہ حداد نے بسند «يونس بن أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» اسی طرح روایت کی ہے، اس میں انہوں نے ابواسحاق کے واسطے کا ذکر نہیں کیا ہے، ۶- نیز یہ حدیث یونس بن ابی اسحاق سے بھی روایت کی گئی ہے انہوں نے بسند «أبي إسحق عن أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے، ۷- اور شعبہ اور سفیان ثوری بسند «أبي إسحق عن أبي بردة عن النبي صلى الله عليه وسلم» روایت کی ہے کہ ”ولی کے بغیر نکاح نہیں ہے“، اور سفیان ثوری کے بعض تلامذہ نے بسند «سفيان عن أبي إسحق عن أبي بردة عن أبي موسى» روایت کی ہے، لیکن یہ صحیح نہیں ہے۔ ان لوگوں کی روایت، جنہوں نے بطریق: «أبي إسحق عن أبي بردة عن أبي موسى عن النبي صلى الله عليه وسلم» روایت کی ہے کہ ”ولی کے بغیر نکاح نہیں“ میرے نزدیک زیادہ صحیح ہے، کیونکہ ابواسحاق سبیعی سے ان لوگوں کا سماع مختلف اوقات میں ہے اگرچہ شعبہ اور ثوری ابواسحاق سے روایت کرنے والے تمام لوگوں سے زیادہ پختہ اور مضبوط حافظہ والے ہیں پھر بھی ان لوگوں ( یعنی شعبہ و ثوری کے علاوہ دوسرے رواۃ ) کی روایت اشبہ ( قریب تر ) ہے۔ اس لیے کہ شعبہ اور ثوری دونوں نے یہ حدیث ابواسحاق سے ایک ہی مجلس میں سنی ہے، ( اور ان کے علاوہ رواۃ نے مختلف اوقات میں ) اس کی دلیل شعبہ کا یہ بیان ہے کہ میں نے سفیان ثوری کو ابواسحاق سے پوچھتے سنا کہ کیا آپ نے ابوبردہ کو کہتے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ولی کے بغیر نکاح نہیں؟“ تو انہوں نے کہا: ہاں ( سنا ہے ) ۔ یہ اس بات کی دلیل ہے کہ شعبہ اور ثوری کا مکحول سے اس حدیث کا سماع ایک ہی وقت میں ہے۔ اور ابواسحاق سبیعی سے روایت کرنے میں اسرائیل بہت ہی ثقہ راوی ہیں۔ عبدالرحمٰن بن مہدی کہتے ہیں کہ مجھ سے ثوری کی روایتوں میں سے جنہیں وہ ابواسحاق سے روایت کرتے ہیں، کوئی روایت نہیں چھوٹی، مگر جو چھوٹی ہیں وہ صرف اس لیے چھوٹی ہیں کہ میں نے اس سلسلے میں اسرائیل پر بھروسہ کر لیا تھا، اس لیے کہ وہ ابواسحاق کی حدیثوں کو بطریق اتم بیان کرتے تھے۔ اور اس باب میں عائشہ رضی اللہ عنہا کی نبی اکرم صلی اللہ علیہ وسلم سے حدیث: ”بغیر ولی کے نکاح نہیں“ میرے نزدیک حسن ہے۔ یہ حدیث ابن جریج نے بطریق: «سليمان بن موسى، عن الزهري، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم»،‏‏‏‏ نیز اسے حجاج بن ارطاۃ اور جعفر بن ربیعہ نے بھی بطریق: «الزهري، عن عروة، عن النبي صلى الله عليه وسلم» روایت کی ہے۔ نیز زہری نے بطریق: «هشام بن عروة، عن أبيه عروة، عن عائشة، عن النبي صلى الله عليه وسلم» اسی کے مثل روایت کی ہے۔ بعض محدثین نے زہری کی روایت میں ( جسے انہوں نے بطریق: «عروة عن عائشة عن النبي صلى الله عليه وسلم» روایت کی ہے ) کلام کیا ہے، ابن جریج کہتے ہیں: پھر میں زہری سے ملا اور میں نے ان سے پوچھا تو انہوں نے اس کا انکار کیا اس کی وجہ سے ان لوگوں نے اس حدیث کو ضعیف قرار دیا۔ یحییٰ بن معین کہتے ہیں کہ ابن جریج سے اس بات کو اسماعیل بن ابراہیم بن علیہ کے علاوہ کسی اور نے نہیں نقل کیا ہے، یحییٰ بن معین کہتے ہیں: اسماعیل بن ابراہیم بن علیہ کا سماع ابن جریج سے نہیں ہے، انہوں نے اپنی کتابوں کی تصحیح عبدالمجید بن عبدالعزیز بن ابی رواد کی ان کتابوں سے کی ہے جنہیں عبدالمجید نے ابن جریج سے سنی ہیں۔ یحییٰ بن معین نے اسماعیل بن ابراہیم بن علیہ کی روایت کو جسے انہوں نے ابن جریج سے روایت کی ہے ضعیف قرار دیا ہے۔ ۸- صحابہ کرام میں سے اہل علم کا عمل اس باب میں نبی اکرم صلی اللہ علیہ وسلم کی حدیث «لا نكاح إلا بولي» ”ولی کے بغیر نکاح نہیں ”پر ہے جن میں عمر، علی، عبداللہ بن عباس اور ابوہریرہ رضی الله عنہم وغیرہ بھی شامل ہیں، اسی طرح بعض فقہائے تابعین سے مروی ہے کہ ولی کے بغیر نکاح درست نہیں۔ ان میں سعید بن مسیب، حسن بصری، شریح، ابراہیم نخعی اور عمر بن عبدالعزیز وغیرہ ہیں۔ یہی سفیان ثوری، اوزاعی، عبداللہ بن مبارک، شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		}
	]
}