{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"11": "The Book on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نماز کے تشہد اور حاجت کے تشہد کو ( الگ الگ ) سکھایا، وہ کہتے ہیں صلاۃ کا تشہد یہ ہے: «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» ”تمام زبانی، بدنی اور مالی عبادتیں اللہ ہی کے لیے ہیں۔ اے نبی: سلامتی ہو آپ پر اور اللہ کی رحمت اور اس کی برکتیں ہوں۔ سلامتی ہو ہم پر اور اللہ کے نیک بندوں پر۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں اور میں گواہی دیتا ہوں کہ محمد اللہ کے بندے اور اس کے رسول ہیں“، اور حاجت کا تشہد یہ ہے: «إن الحمد لله نستعينه ونستغفره ونعوذ بالله من شرور أنفسنا وسيئات أعمالنا فمن يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» ”سب تعریفیں اللہ ہی کے لیے ہیں، ہم اسی سے مدد چاہتے ہیں اور اسی سے مغفرت طلب کرتے ہیں، ہم اپنے دلوں کی شرارتوں اور برے اعمال سے اللہ کی پناہ مانگتے ہیں، جسے اللہ ہدایت دیدے اسے کوئی گمراہ کرنے والا نہیں اور جسے گمراہ کر دے، اسے کوئی ہدایت دینے والا نہیں۔ میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں۔ میں گواہی دیتا ہوں کہ محمد اللہ کے بندے اور اس کے رسول ہیں“۔ اور پھر آپ تین آیتیں پڑھتے۔ عبثر ( راوی حدیث ) کہتے ہیں: تو ہمیں سفیان ثوری نے بتایا کہ وہ تینوں آیتیں یہ تھی: «يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون» ”اے ایمان والو! اللہ سے ڈرو جیسا ڈرنے کا حق ہے اور حالت اسلام ہی میں مرو“ ( آل عمران: ۱۰۲ ) ، «واتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا» ”اللہ سے ڈرو، جس کے نام سے تم سوال کرتے ہو اور جس کے واسطے سے ناطے جوڑتے ہو، بلاشبہ اللہ تمہارا نگہبان ہے“ ( النساء: ۱ ) ، «يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا» ”اے ایمان والو! اللہ سے ڈرو، اور راست اور پکی بات کہو“ ( الأحزاب: ۷۰ ) ۔ امام ترمذی کہتے ہیں: ۱- عبداللہ بن مسعود رضی الله عنہ کی حدیث حسن ہے، ۲- اسے اعمش نے بطریق: «أبي إسحق عن أبي الأحوص عن عبد الله عن النبي صلى الله عليه وسلم» روایت کیا ہے۔ نیز اسے شعبہ نے بطریق: «أبي إسحق عن أبي عبيدة عن عبد الله عن النبي صلى الله عليه وسلم» روایت کیا ہے، اور یہ دونوں طریق صحیح ہیں، اس لیے کہ اسرائیل نے دونوں کو جمع کر دیا ہے، یعنی «عن أبي إسحق عن أبي الأحوص وأبي عبيدة عن عبد الله بن مسعود عن النبي صلى الله عليه وسلم»،‏‏‏‏ ۳- اس باب میں عدی بن حاتم رضی الله عنہ سے بھی روایت ہے، ۴- اہل علم نے کہا ہے کہ نکاح بغیر خطبے کے بھی جائز ہے۔ اہل علم میں سے سفیان ثوری وغیرہ کا یہی قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		}
	]
}