{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"12": "The Book on Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "عقبہ بن حارث رضی الله عنہ کہتے ہیں کہ نے ایک عورت سے شادی کی تو ایک کالی کلوٹی عورت نے ہمارے پاس آ کر کہا: میں نے تم دونوں کو دودھ پلایا ہے، میں نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا کہ میں نے فلاں کی بیٹی فلاں سے شادی کی ہے، اب ایک کالی کلوٹی عورت نے آ کر کہا کہ میں نے تم دونوں کو دودھ پلایا ہے، وہ جھوٹ کہہ رہی ہے۔ آپ نے اپنا چہرہ مجھ سے پھیر لیا تو میں آپ کے چہرے کی طرف سے آیا، آپ نے ( پھر ) اپنا چہرہ پھیر لیا۔ میں نے عرض کیا: وہ جھوٹی ہے۔ آپ نے فرمایا: ”یہ کیسے ہو سکتا ہے جب کہ وہ کہہ چکی ہے کہ اس نے تم دونوں کو دودھ پلایا ہے۔ اپنی بیوی اپنے سے علاحدہ کر دو“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- عقبہ بن حارث رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس حدیث کو کئی اور بھی لوگوں نے ابن ابی ملیکہ سے روایت کیا ہے اور ابن ابی ملیکہ نے عقبہ بن حارث سے روایت کی ہے اور ان لوگوں نے اس میں عبید بن ابی مریم کے واسطے کا ذکر نہیں کیا ہے، نیز اس میں «دعها عنك» ”اسے اپنے سے علاحدہ کر دو“، کا ذکر بھی نہیں ہے۔ اس باب میں ابن عمر رضی الله عنہما سے بھی روایت ہے، ۳- صحابہ کرام وغیرہم میں سے بعض اہل علم کا اسی حدیث پر عمل ہے۔ انہوں نے رضاعت کے سلسلے میں ایک عورت کی شہادت کو درست قرار دیا ہے، ۴- ابن عباس رضی الله عنہما کہتے ہیں: رضاعت کے سلسلے میں ایک عورت کی شہادت جائز ہے۔ لیکن اس سے قسم بھی لی جائے گی۔ احمد اور اسحاق بن راہویہ اسی کے قائل ہیں، ۵- اور بعض اہل علم نے کہا ہے کہ ایک عورت کی گواہی درست نہیں جب تک کہ وہ ایک سے زائد نہ ہوں۔ یہ شافعی کا قول ہے، ۶- وکیع کہتے ہیں: ایک عورت کی گواہی فیصلے میں درست نہیں۔ اور اگر ایک عورت کی گواہی سن کر وہ بیوی سے علاحدگی اختیار کر لے تو یہ عین تقویٰ ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		}
	]
}