{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"13": "The Book on Divorce and Li'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1202,
			"arabicnumber": 1202,
			"text": "سعید بن جبیر کہتے ہیں کہ مصعب بن زبیر کے زمانہ امارت میں مجھ سے لعان ۱؎ کرنے والوں کے بارے میں پوچھا گیا کہ کیا ان کے درمیان تفریق کر دی جائے؟ تو میں نہیں جان سکا کہ میں انہیں کیا جواب دوں؟ چنانچہ میں اپنی جگہ سے اٹھ کر عبداللہ بن عمر رضی الله عنہما کے گھر آیا اور اندر آنے کی اجازت مانگی، بتایا گیا کہ وہ قیلولہ کر رہے ہیں، لیکن انہوں نے میری بات سن لی، اور کہا: ابن جبیر! آ جاؤ تمہیں کوئی ضرورت ہی لے کر آئی ہو گی۔ سعید بن جبیر کہتے ہیں: میں ان کے پاس گیا تو کیا دیکھتا ہوں کہ پالان پر بچھائے جانے والے کمبل پر لیٹے ہیں۔ میں نے کہا: ابوعبدالرحمٰن! کیا لعان کرنے والوں کے درمیان تفریق کر دی جائے گی؟ کہا: سبحان اللہ! ہاں، سب سے پہلے اس بارے میں فلاں بن فلاں نے پوچھا۔ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور اس نے عرض کیا: اللہ کے رسول! اگر ہم میں سے کوئی اپنی بیوی کو برائی کرتے دیکھے تو کیا کرے؟ اگر کچھ کہتا ہے تو بڑی بات کہتا ہے، اور اگر خاموش رہتا ہے تو وہ سنگین معاملہ پر خاموش رہتا ہے۔ ابن عمر رضی الله عنہما کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم خاموش رہے اور آپ نے انہیں کوئی جواب نہیں دیا۔ پھر جب کچھ دن گزرے تو وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ( دوبارہ ) آیا اور اس نے عرض کیا: میں نے آپ سے جو مسئلہ پوچھا تھا میں اس میں خود مبتلا کر دیا گیا ہوں۔ تب اللہ تعالیٰ نے سورۃ النور کی یہ آیتیں نازل فرمائیں «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم» ”یعنی جو لوگ اپنی بیویوں پر تہمت زنا لگاتے ہیں اور ان کے پاس خود اپنی ذات کے علاوہ کوئی گواہ نہیں ہیں“ ( سورۃ النور: 6 ) ۔ یہاں تک کہ یہ آیتیں ختم کیں، پھر آپ نے اس آدمی کو بلایا اور اسے یہ آیتیں پڑھ کر سنائیں، اور اسے نصیحت کی اور اس کی تذکیر کی اور بتایا کہ دنیا کا عذاب آخرت کے عذاب سے آسان ہے۔ اس پر اس نے کہا: نہیں، اس ذات کی قسم! جس نے آپ کو حق کے ساتھ بھیجا ہے، میں نے اس پر جھوٹا الزام نہیں لگایا ہے۔ پھر آپ نے وہ آیتیں عورت کے سامنے دہرائیں، اس کو نصیحت کی، اور اس کی تذکیر کی اور بتایا کہ دنیا کا عذاب آخرت کے عذاب سے آسان ہے۔ اس پر اس عورت نے کہا: نہیں، اس ذات کی قسم! جس نے آپ کو حق کے ساتھ بھیجا، وہ سچ نہیں بول رہا ہے۔ ابن عمر رضی الله عنہما کہتے ہیں: آپ نے مرد سے ابتداء کی، اس نے اللہ کا نام لے کر چار مرتبہ گواہی دی کہ وہ سچا ہے اور پانچویں مرتبہ گواہی دی کہ اگر وہ جھوٹا ہو تو اس پر اللہ کی لعنت ہو۔ پھر دوبارہ آپ نے عورت سے یہی باتیں کہلوائیں، اس نے اللہ کا نام لے کر چار مرتبہ گواہی دی کہ اس کا شوہر جھوٹا ہے، اور پانچویں مرتبہ اس نے گواہی دی کہ اگر اس کا شوہر سچا ہو تو اس پر اللہ کا غضب نازل ہو۔ پھر آپ نے ان دونوں میں تفریق کر دی۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن صحیح ہے، ۲- اس باب میں سہل بن سعد، ابن عباس، ابن مسعود اور حذیفہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اسی حدیث پر عمل ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		}
	]
}