{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"14": "The Book on Business"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1244,
			"arabicnumber": 1244,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جس نے «تأبیر» ۱؎ ( پیوند کاری ) کے بعد کھجور کا درخت خریدا تو اس کا پھل بیچنے والے ہی کا ہو گا ۲؎ الا یہ کہ خریدنے والا ( خریدتے وقت پھل کی ) شرط لگا لے۔ اور جس نے کوئی ایسا غلام خریدا جس کے پاس مال ہو تو اس کا مال بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( خریدتے وقت مال کی ) شرط لگا لے“۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اسی طرح اور بھی طرق سے بسند «عن الزهري عن سالم عن ابن عمر عن النبي صلى الله عليه وسلم» سے روایت ہے آپ نے فرمایا: ”جس نے پیوند کاری کے بعد کھجور کا درخت خریدا تو اس کا پھل بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( درخت کے ساتھ پھل کی بھی ) شرط لگا لے اور جس نے کوئی ایسا غلام خریدا جس کے پاس مال ہو تو اس کا مال بیچنے والے کا ہو گا الا یہ کہ خریدنے والا ( غلام کے ساتھ مال کی بھی ) شرط لگا لے“، ۳- یہ نافع سے بھی مروی ہے انہوں نے ابن عمر سے اور ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ نے فرمایا: ”جس نے کھجور کا کوئی درخت خریدا جس کی پیوند کاری کی جا چکی ہو تو اس کا پھل بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( درخت کے ساتھ پھل کی بھی ) شرط لگا لے“، ۴- نافع سے مروی ہے وہ ابن عمر سے روایت کرتے ہیں، وہ کہتے ہیں کہ جس نے کوئی غلام بیچا جس کے پاس مال ہو تو اس کا مال بیچنے والے ہی کا ہو گا الا یہ کہ خریدنے والا ( غلام کے ساتھ مال کی بھی ) شرط لگا لے، ۵- اسی طرح عبیداللہ بن عمر وغیرہ نے نافع سے دونوں حدیثیں روایت کی ہیں، ۶- نیز بعض لوگوں نے یہ حدیث نافع سے، نافع نے ابن عمر سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، ۷- عکرمہ بن خالد نے ابن عمر سے ابن عمر نے نبی اکرم صلی اللہ علیہ وسلم سے سالم کی حدیث کی طرح روایت کی ہے۔ ۸- محمد بن اسماعیل بخاری کہتے ہیں کہ زہری کی حدیث جسے انہوں نے بطریق: «عن سالم عن أبيه عن النبي صلى الله عليه وسلم» روایت کی ہے اس باب میں سب سے زیادہ صحیح ہے، ۹- بعض اہل علم کا اسی حدیث پر عمل ہے۔ اور یہی شافعی، احمد اور اسحاق بن راہویہ کا بھی قول ہے، ۱۰- اس باب میں جابر رضی الله عنہ سے بھی روایت ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 44
			}
		}
	]
}