{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 128,
			"arabicnumber": 128,
			"text": "حمنہ بنت جحش رضی الله عنہا کہتی ہیں کہ میں سخت قسم کے استحاضہ میں مبتلا رہتی تھی، میں نبی اکرم صلی الله علیہ وسلم کی خدمت میں مسئلہ پوچھنے اور آپ کو اس کی خبر دینے کے لیے حاضر ہوئی، میں نے آپ صلی الله علیہ وسلم کو اپنی بہن زینب بنت حجش کے گھر پایا تو عرض کیا: اللہ کے رسول! میں سخت قسم کے استحاضہ میں مبتلا رہتی ہوں، اس سلسلہ میں آپ مجھے کیا حکم دیتے ہیں، اس نے تو مجھے صوم و صلاۃ دونوں سے روک دیا ہے؟ آپ نے فرمایا: ”میں تجھے روئی رکھنے کا حکم دے رہا ہوں اس سے خون بند ہو جائے گا“، انہوں نے عرض کیا: وہ اس سے زیادہ ہے ( روئی رکھنے سے نہیں رکے گا ) آپ نے فرمایا: ”تو لنگوٹ باندھ لیا کرو“، کہا: خون اس سے بھی زیادہ آ رہا ہے، تو آپ نے فرمایا: ”تم لنگوٹ کے نیچے ایک کپڑا رکھ لیا کرو“، کہا: یہ اس سے بھی زیادہ ہے، مجھے بہت تیزی سے خون بہتا ہے، تو نبی اکرم صلی الله علیہ وسلم نے فرمایا: ”تو میں تجھے دو باتوں کا حکم دیتا ہوں ان دونوں میں سے تم جو بھی کر لو تمہارے لیے کافی ہو گا اور اگر تم دونوں پر قدرت رکھ سکو تو تم زیادہ بہتر جانتی ہو“، آپ نے فرمایا: ”یہ تو صرف شیطان کی چوٹ ( مار ) ہے تو چھ یا سات دن جو اللہ کے علم میں ہیں انہیں تو حیض کے شمار کر پھر غسل کر لے اور جب تو سمجھ لے کہ تو پاک و صاف ہو گئی ہو تو چوبیس یا تئیس دن نماز پڑھ اور روزے رکھ، یہ تمہارے لیے کافی ہے، اور اسی طرح کرتی رہو جیسا کہ حیض والی عورتیں کرتی ہیں: حیض کے اوقات میں حائضہ اور پاکی کے وقتوں میں پاک رہتی ہیں، اور اگر تم اس بات پر قادر ہو کہ ظہر کو کچھ دیر سے پڑھو اور عصر کو قدرے جلدی پڑھ لو تو غسل کر کے پاک صاف ہو جا اور ظہر اور عصر کو ایک ساتھ پڑھ لیا کرو، پھر مغرب کو ذرا دیر کر کے اور عشاء کو کچھ پہلے کر کے پھر غسل کر کے یہ دونوں نمازیں ایک ساتھ پڑھ لے تو ایسا کر لیا کرو، اور صبح کے لیے الگ غسل کر کے فجر پڑھو، اگر تم قادر ہو تو اس طرح کرو اور روزے رکھو“، پھر رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”ان دونوں باتوں ۱؎ میں سے یہ دوسری صورت ۲؎ مجھے زیادہ پسند ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- محمد بن اسماعیل بخاری نے اس حدیث کو حسن صحیح کہا ہے اور اسی طرح احمد بن حنبل نے بھی کہا ہے کہ یہ حدیث حسن صحیح ہے، ۳- احمد اور اسحاق بن راہویہ مستحاضہ کے بارے میں کہتے ہیں کہ عورت جب اپنے حیض کے آنے اور جانے کو جانتی ہو، اور آنا یہ ہے کہ خون کالا ہو اور جانا یہ ہے کہ وہ زردی میں بدل جائے تو اس کا حکم فاطمہ بن ابی حبیش رضی الله عنہا کی حدیث کے مطابق ہو گا ۳؎ اور اگر مستحاضہ کے لیے استحاضہ سے پہلے ( حیض کے ) ایام معروف ہیں تو وہ اپنے حیض کے دنوں میں نماز چھوڑ دے گی پھر غسل کرے گی اور ہر نماز کے لیے وضو کرے گی۔ اور جب خون جاری رہے اور ( حیض کے ) ایام معلوم نہ ہوں اور نہ ہی وہ حیض کے آنے جانے کو جانتی ہو تو اس کا حکم حمنہ بنت جحش رضی الله عنہا کی حدیث کے مطابق ہو گا ۴؎ اسی طرح ابو عبید نے کہا ہے۔ شافعی کہتے ہیں: جب مستحاضہ کو پہلی بار جب اس نے خون دیکھا تبھی سے برابر خون جاری رہے تو وہ خون شروع ہونے سے لے کر پندرہ دن تک نماز چھوڑے رہے گی، پھر اگر وہ پندرہ دن میں یا اس سے پہلے پاک ہو جاتی ہے تو گویا یہی اس کے حیض کے دن ہیں اور اگر وہ پندرہ دن سے زیادہ خون دیکھے، تو وہ چودہ دن کی نماز قضاء کرے گی اور اس کے بعد عورتوں کے حیض کی اقل مدت جو ایک دن اور ایک رات ہے، کی نماز چھوڑ دے گی، ۴- حیض کی کم سے کم مدت اور سب سے زیادہ مدت میں اہل علم کے درمیان اختلاف ہے، بعض اہل علم کہتے ہیں: حیض کی سب سے کم مدت تین دن اور سب سے زیادہ مدت دس دن ہے، یہی سفیان ثوری، اور اہل کوفہ کا قول ہے اور اسی کو ابن مبارک بھی اختیار کرتے ہیں۔ ان سے اس کے خلاف بھی مروی ہے، بعض اہل علم جن میں عطا بن ابی رباح بھی ہیں، کہتے ہیں کہ حیض کی کم سے کم مدت ایک دن اور ایک رات ہے اور اس کی زیادہ سے زیادہ مدت پندرہ دن ہے، اور یہی مالک، اوزاعی، شافعی، احمد، اسحاق بن راہویہ اور ابو عبید کا قول ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 128
			}
		}
	]
}