{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"21": "The Book on Military Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "ابوالبختری سعید بن فیروز سے روایت ہے کہ مسلمانوں کے ایک لشکر نے جس کے امیر سلمان فارسی تھے، فارس کے ایک قلعہ کا محاصرہ کیا، لوگوں نے کہا: ابوعبداللہ! کیا ہم ان پر حملہ نہ کر دیں؟، انہوں نے کہا: مجھے چھوڑ دو میں ان کافروں کو اسلام کی دعوت اسی طرح دوں جیسا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو انہیں دعوت دیتے ہوئے سنا ہے ۱؎، چنانچہ سلمان فارسی رضی الله عنہ ان کے پاس گئے، اور کافروں سے کہا: میں تمہاری ہی قوم فارس کا رہنے والا ایک آدمی ہوں، تم دیکھ رہے ہو عرب میری اطاعت کرتے ہیں، اگر تم اسلام قبول کرو گے تو تمہارے لیے وہی حقوق ہوں گے جو ہمارے لیے ہیں، اور تمہارے اوپر وہی ذمہ داریاں عائد ہوں گی جو ہمارے اوپر ہیں، اور اگر تم اپنے دین ہی پر قائم رہنا چاہتے ہو تو ہم اسی پر تم کو چھوڑ دیں گے، اور تم ذلیل و خوار ہو کر اپنے ہاتھ سے جزیہ ادا کرو ۲؎، سلمان فارسی رضی الله عنہ نے اس بات کو فارسی زبان میں بھی بیان کیا، اور یہ بھی کہا: تم قابل تعریف لوگ نہیں ہو، اور اگر تم نے انکار کیا تو ہم تم سے ( حق پر ) جنگ کریں گے، ان لوگوں نے جواب دیا: ہم وہ نہیں ہیں کہ جزیہ دیں، بلکہ تم سے جنگ کریں گے، مسلمانوں نے کہا: ابوعبداللہ! کیا ہم ان پر حملہ نہ کر دیں؟ انہوں نے کہا: نہیں، پھر انہوں نے تین دن تک اسی طرح ان کو اسلام کی دعوت دی، پھر مسلمانوں سے کہا: ان پر حملہ کرو، ہم لوگوں نے ان پر حملہ کیا اور اس قلعہ کو فتح کر لیا۔ امام ترمذی کہتے ہیں: ۱- سلمان فارسی رضی الله عنہ کی حدیث حسن ہے، ہم اس کو صرف عطاء بن سائب ہی کی روایت سے جانتے ہیں، ۲- میں نے محمد بن اسماعیل ( امام بخاری ) کو کہتے ہوئے سنا: ابوالبختری نے سلمان کو نہیں پایا ہے، اس لیے کہ انہوں نے علی کو نہیں پایا ہے، اور سلمان کی وفات علی سے پہلے ہوئی ہے، ۲- اس باب میں بریدہ، نعمان بن مقرن، ابن عمر اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- بعض اہل علم صحابہ اور دوسرے لوگوں کی یہی رائے ہے کہ قتال سے پہلے کافروں کو دعوت دی جائے گی، اسحاق بن ابراہیم بن راہویہ کا بھی یہی قول ہے کہ اگر ان کو پہلے اسلام کی دعوت دے دی جائے تو بہتر ہے، یہ ان کے لیے خوف کا باعث ہو گا، ۴- بعض اہل علم کہتے ہیں کہ اس دور میں دعوت کی ضرورت نہیں ہے، امام احمد کہتے ہیں: میں اس زمانے میں کسی کو دعوت دئیے جانے کے لائق نہیں سمجھتا، ۵- امام شافعی کہتے ہیں: دعوت سے پہلے دشمنوں سے جنگ نہ شروع کی جائے، ہاں اگر کفار خود جنگ میں پہل کر بیٹھیں تو اس صورت میں اگر دعوت نہ دی گئی تو کوئی حرج نہیں کیونکہ اسلام کی دعوت ان تک پہنچ چکی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		}
	]
}