{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 157,
			"arabicnumber": 157,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی الله علیہ وسلم نے فرمایا: ”جب گرمی سخت ہو تو نماز ٹھنڈا ہونے پر پڑھو ۱؎ کیونکہ گرمی کی تیزی جہنم کی بھاپ سے ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوسعید، ابوذر، ابن عمر، مغیرہ، اور قاسم بن صفوان کے باپ ابوموسیٰ، ابن عباس اور انس رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اس سلسلے میں عمر رضی الله عنہ سے بھی روایت ہے جسے انہوں نے نبی اکرم صلی الله علیہ وسلم سے روایت کی ہے، لیکن یہ صحیح نہیں، ۴- اہل علم میں کچھ لوگوں نے سخت گرمی میں ظہر تاخیر سے پڑھنے کو پسند کیا ہے۔ یہی ابن مبارک، احمد اور اسحاق بن راہویہ کا قول ہے۔ شافعی کہتے ہیں: ظہر ٹھنڈا کر کے پڑھنے کی بات اس وقت کی ہے جب مسجد والے دور سے آتے ہوں، رہا اکیلے نماز پڑھنے والا اور وہ شخص جو اپنے ہی لوگوں کی مسجد میں نماز پڑھتا ہو تو میں اس کے لیے یہی پسند کرتا ہوں کہ وہ سخت گرمی میں بھی نماز کو دیر سے نہ پڑھے، ۵- جو لوگ گرمی کی شدت میں ظہر کو دیر سے پڑھنے کی طرف گئے ہیں ان کا مذہب زیادہ بہتر اور اتباع کے زیادہ لائق ہے، رہی وہ بات جس کی طرف شافعی کا رجحان ہے کہ یہ رخصت اس کے لیے ہے جو دور سے آتا ہوتا کہ لوگوں کو پریشانی نہ ہو تو ابوذر رضی الله عنہ کی حدیث میں کچھ ایسی باتیں ہیں جو اس چیز پر دلالت کرتی ہیں جو امام شافعی کے قول کے خلاف ہیں۔ ابوذر رضی الله عنہ کہتے ہیں: ہم لوگ ایک سفر میں نبی اکرم صلی الله علیہ وسلم کے ساتھ تھے، بلال رضی اللہ عنہ نے نماز ظہر کے لیے اذان دی، تو نبی اکرم صلی الله علیہ وسلم نے فرمایا: ”بلال! ٹھنڈا ہو جانے دو، ٹھنڈا ہو جانے دو“ ( یہ حدیث آگے آ رہی ہے ) ، اب اگر بات ایسی ہوتی جس کی طرف شافعی گئے ہیں، تو اس وقت ٹھنڈا کرنے کا کوئی مطلب نہ ہوتا، اس لیے کہ سفر میں سب لوگ اکٹھا تھے، انہیں دور سے آنے کی ضرورت نہ تھی۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 9
			}
		}
	]
}