{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"22": "The Book on Virtues of Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ام حرام بنت ملحان کے گھر جب بھی جاتے، وہ آپ کو کھانا کھلاتیں، ام حرام رضی الله عنہا عبادہ بن صامت رضی الله عنہ کے عقد میں تھیں، ایک دن رسول اللہ صلی اللہ علیہ وسلم ان کے پاس گئے تو انہوں نے آپ کو کھانا کھلایا اور آپ کے سر میں جوئیں دیکھنے بیٹھ گئیں، آپ سو گئے، پھر آپ صلی اللہ علیہ وسلم بیدار ہوئے تو ہنس رہے تھے، ام حرام رضی الله عنہا کہتی ہیں: میں نے پوچھا: اللہ کے رسول! آپ کو کیا چیز ہنسا رہی ہے؟ آپ نے ( جواب میں ) فرمایا: ”میرے سامنے میری امت کے کچھ مجاہدین پیش کئے گئے، وہ اس سمندر کے سینہ پر سوار تھے، تختوں پر بیٹھے ہوئے بادشاہ لگتے تھے“۔ راوی کو شک ہے کہ آپ نے «ملوك على الأسرة» کہا، یا «مثل الملوك على الأسرة» میں نے عرض کیا: اللہ کے رسول! اللہ سے دعا کر دیجئیے کہ اللہ مجھے بھی ان لوگوں میں کر دے، چنانچہ آپ نے ان کے لیے دعا فرمائی، آپ پھر اپنا سر رکھ کر سو گئے، پھر ہنستے ہوئے بیدار ہوئے، میں نے عرض کیا: اللہ کے رسول! آپ کو کیا چیز ہنسا رہی ہے؟ فرمایا: ”میرے سامنے میری امت کے کچھ لوگ اللہ کے راستے میں جہاد کرتے ہوئے پیش کئے گئے“، آپ نے اسی طرح فرمایا جیسے اس سے پہلے فرمایا تھا، میں نے عرض کیا: اللہ کے رسول! اللہ سے دعا کر دیجئیے کہ مجھے ان لوگوں میں کر دے، آپ نے فرمایا: ”تم ( سمندر میں ) پہلے ( جہاد کرنے ) والے لوگوں میں سے ہو“۔ انس رضی الله عنہ کہتے ہیں: معاویہ بن ابی سفیان رضی الله عنہما کے زمانہ میں ام حرام رضی الله عنہا سمندری سفر پر ( ایک جہاد میں ) نکلیں تو وہ سمندر سے نکلتے وقت اپنی سواری سے گر گئیں اور ہلاک ہو گئیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ام حرام بنت ملحان، ام سلیم کی بہن اور انس بن مالک کی خالہ ہیں، ( اور نبی اکرم صلی اللہ علیہ وسلم کے ننہال میں سے قریبی رشتہ دار تھیں ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 28
			}
		}
	]
}