{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"30": "Chapters On Wasaya (Wills and Testament)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2120,
			"arabicnumber": 2120,
			"text": "ابوامامہ باہلی رضی الله عنہ کہتے ہیں کہ میں نے حجۃ الوداع کے سال خطبہ میں رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”اللہ تعالیٰ نے ہر حق والے کو اس کا حق دے دیا ہے، لہٰذا کسی وارث کے لیے وصیت جائز نہیں، لڑکا ( ولدالزنا ) بستر والے کی طرف منسوب ہو گا ( نہ کہ زانی کی طرف ) ، اور زانی رجم کا مستحق ہے اور ان کا حساب اللہ کے سپرد ہے۔ جس نے اپنے باپ کے علاوہ کسی دوسری طرف نسبت کی یا اپنے موالی کے علاوہ کی طرف اپنے آپ کو منسوب کیا اس پر قیامت کے دن تک جاری رہنے والی لعنت ہو، کوئی عورت اپنے شوہر کے گھر سے اس کی اجازت کے بغیر خرچ نہ کرے“، عرض کیا گیا: اللہ کے رسول! کھانا بھی نہیں؟ آپ نے فرمایا: ”یہ ہمارے مالوں میں سب سے بہتر ہے“۔ ( یعنی اس کی زیادہ حفاظت ہونی چاہیئے ) پھر آپ نے فرمایا: ” «عارية» ( منگنی ) لی ہوئی چیز واپس لوٹائی جائے گی، «منحة» ۱؎ واپس کی جائے گی، قرض ادا کیا جائے گا، اور ضامن ذمہ دار ہے“ ۲؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- ابوامامہ کے واسطہ سے نبی اکرم صلی اللہ علیہ وسلم سے یہ حدیث دوسری سند سے بھی آئی ہے، ۳- اسماعیل بن عیاش کی وہ روایت جسے وہ اہل عراق اور اہل شام سے روایت کرنے میں منفرد ہیں، قوی نہیں ہے۔ اس لیے کہ انہوں نے ان سے منکر حدیثیں روایت کی ہیں، اہل شام سے ان کی روایت زیادہ صحیح ہے۔ اسی طرح محمد بن اسماعیل بخاری نے کہا: ۴- احمد بن حنبل کہتے ہیں: اسماعیل بن عیاش حدیث روایت کرنے کے اعتبار سے بقیہ سے زیادہ صحیح ہیں، بقیہ نے ثقہ راویوں سے بہت سی منکر حدیثیں روایت کی ہیں، ۵- ابواسحاق فزاری کہتے ہیں: ثقہ راویوں کے سے بقیہ جو حدیثیں بیان کریں اسے لے لو اور اسماعیل بن عیاش کی حدیثیں مت لو، خواہ وہ ثقہ سے روایت کریں یا غیر ثقہ سے، ۶- اس باب میں عمرو بن خارجہ اور انس رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 5
			}
		}
	]
}