{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم نے ہمیں عصر کچھ پہلے پڑھائی پھر خطبہ دینے کھڑے ہوئے، اور آپ نے قیامت تک ہونے والی تمام چیزوں کے بارے میں ہمیں خبر دی، یاد رکھنے والوں نے اسے یاد رکھا اور بھولنے والے بھول گئے، آپ نے جو باتیں بیان فرمائیں اس میں سے ایک بات یہ بھی تھی: ”دنیا میٹھی اور سرسبز ہے، اللہ تعالیٰ تمہیں اس میں خلیفہ بنائے گا ۱؎، پھر دیکھے گا کہ تم کیسا عمل کرتے ہو؟ خبردار! دنیا سے اور عورتوں سے بچ کے رہو“ ۲؎، آپ نے یہ بھی فرمایا: ”خبردار! حق جان لینے کے بعد کسی آدمی کو لوگوں کا خوف اسے بیان کرنے سے نہ روک دے“، ابو سعید خدری رضی الله عنہ نے روتے ہوئے کہا: اللہ کی قسم! ہم نے بہت ساری چیزیں دیکھی ہیں اور ( بیان کرنے سے ) ڈر گئے آپ نے یہ بھی بیان فرمایا: ”خبردار! قیامت کے دن ہر عہد توڑنے والے کے لیے اس کے عہد توڑنے کے مطابق ایک جھنڈا ہو گا اور امام عام کے عہد توڑنے سے بڑھ کر کوئی عہد توڑنا نہیں، اس عہد کے توڑنے والے کا جھنڈا اس کے سرین کے پاس نصب کیا جائے گا“، اس دن کی جو باتیں ہمیں یاد رہیں ان میں سے ایک یہ بھی تھی: ”جان لو! انسان مختلف درجہ کے پیدا کیے گئے ہیں کچھ لوگ پیدائشی مومن ہوتے ہیں، مومن بن کر زندگی گزارتے ہیں اور ایمان کی حالت میں دنیا سے رخصت ہوتے ہیں، کچھ لوگ کافر پیدا ہوتے ہیں، کافر بن کر زندگی گزارتے ہیں اور کفر کی حالت میں مرتے ہیں، کچھ لوگ مومن پیدا ہوتے ہیں، مومن بن کر زندگی گزارتے ہیں اور کفر کی حالت میں ان کی موت آتی ہے، کچھ لوگ کافر پیدا ہوتے ہیں، کافر بن کر زندہ رہتے ہیں، اور ایمان کی حالت میں ان کی موت آتی ہے، کچھ لوگوں کو غصہ دیر سے آتا ہے اور جلد ٹھنڈا ہو جاتا ہے، کچھ لوگوں کو غصہ جلد آتا ہے اور دیر سے ٹھنڈا ہوتا ہے، یہ دونوں برابر ہیں، جان لو! کچھ لوگ ایسے ہیں جنہیں جلد غصہ آتا ہے اور دیر سے ٹھنڈا ہوتا ہے، جان لو! ان میں سب سے بہتر وہ ہیں جو دیر سے غصہ ہوتے ہیں اور جلد ٹھنڈے ہو جاتے ہیں، اور سب سے برے وہ ہیں جو جلد غصہ ہوتے ہیں اور دیر سے ٹھنڈے ہوتے ہیں، جان لو! کچھ لوگ اچھے ڈھنگ سے قرض ادا کرتے ہیں اور اچھے ڈھنگ سے قرض وصول کرتے ہیں، کچھ لوگ بدسلوکی سے قرض ادا کرتے ہیں، اور بدسلوکی سے وصول کرتے ہیں، جان لو! ان میں سب سے اچھا وہ ہے جو اچھے ڈھنگ سے قرض ادا کرتا ہے اور اچھے ڈھنگ سے وصول کرتا ہے، اور سب سے برا وہ ہے جو برے ڈھنگ سے ادا کرتا ہے، اور بدسلوکی سے وصول کرتا ہے، جان لو! غصہ انسان کے دل میں ایک چنگاری ہے کیا تم غصہ ہونے والے کی آنکھوں کی سرخی اور اس کی گردن کی رگوں کو پھولتے ہوئے نہیں دیکھتے ہو؟ لہٰذا جس شخص کو غصہ کا احساس ہو وہ زمین سے چپک جائے“، ابو سعید خدری کہتے ہیں: ہم لوگ سورج کی طرف مڑ کر دیکھنے لگے کہ کیا ابھی ڈوبنے میں کچھ باقی ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جان لو! دنیا کے گزرے ہوئے حصہ کی بہ نسبت اب جو حصہ باقی ہے وہ اتنا ہی ہے جتنا حصہ آج کا تمہارے گزرے ہوئے دن کی بہ نسبت باقی ہے“ ۳؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں حذیفہ، ابومریم، ابوزید بن اخطب اور مغیرہ بن شعبہ رضی الله عنہم سے بھی احادیث آئی ہیں، ان لوگوں نے بیان کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے ان سے قیامت تک ہونے والی چیزوں کو بیان فرمایا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		}
	]
}