{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2240,
			"arabicnumber": 2240,
			"text": "نواس بن سمعان کلابی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک صبح دجال کا ذکر کیا، تو آپ نے ( اس کی حقارت اور اس کے فتنے کی سنگینی بیان کرتے ہوئے دوران گفتگو ) آواز کو بلند اور پست کیا ۱؎ حتیٰ کہ ہم نے گمان کیا کہ وہ ( مدینہ کی ) کھجوروں کے جھنڈ میں ہے، پھر ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس سے واپس آ گئے، ( جب بعد میں ) پھر آپ کے پاس گئے تو آپ نے ہم پر دجال کے خوف کا اثر جان لیا اور فرمایا: ”کیا معاملہ ہے؟“ ہم نے عرض کیا: اللہ کے رسول! آپ نے صبح دجال کا ذکر کرتے ہوئے ( اس کی حقارت اور سنگینی بیان کرتے ہوئے ) اپنی آواز کو بلند اور پست کیا یہاں تک کہ ہمیں گمان ہونے لگا کہ وہ کھجوروں کے درمیان ہے۔ آپ نے فرمایا: ”دجال کے علاوہ دوسری چیزوں سے میں تم پر زیادہ ڈرتا ہوں، اگر وہ نکلے اور میں تمہارے بیچ موجود ہوں تو میں تمہاری جگہ خود اس سے نمٹ لوں گا، اور اگر وہ نکلے اور میں تمہارے بیچ موجود نہ رہوں تو ہر آدمی خود اپنے نفس کا دفاع کرے گا، اور اللہ ہر مسلمان پر میرا خلیفہ ( جانشیں ) ہے ۲؎، دجال گھونگھریالے بالوں والا جوان ہو گا، اس کی ایک آنکھ انگور کی طرح ابھری ہوئی ہو گی تو ان میں اسے عبدالعزیٰ بن قطن سے تشبیہ دیتا ہوں، پس تم میں سے جو شخص اسے پا لے اسے چاہیئے کہ وہ سورۃ الکہف کی ابتدائی آیات پڑھے، وہ شام اور عراق کے درمیان سے نکلے گا اور دائیں بائیں فساد پھیلائے گا، اللہ کے بندو! ثابت قدم رہنا“۔ ہم نے عرض کیا: اللہ کے رسول! روئے زمین پر ٹھہرنے کی اس کی مدت کیا ہو گی؟ آپ نے فرمایا: ”چالیس دن، ایک دن ایک سال کے برابر ہو گا، ایک دن ایک مہینہ کے برابر ہو گا، ایک دن ہفتہ کے برابر ہو گا اور باقی دن تمہارے دنوں کی طرح ہوں گے“، ہم نے عرض کیا: اللہ کے رسول! بتائیے وہ ایک دن جو ایک سال کے برابر ہو گا کیا اس میں ایک دن کی نماز کافی ہو گی؟ آپ نے فرمایا: ”نہیں بلکہ اس کا اندازہ کر کے پڑھنا“۔ ہم نے عرض کیا: اللہ کے رسول! زمین میں وہ کتنی تیزی سے اپنا کام کرے گا؟ آپ نے فرمایا: ”اس بارش کی طرح کہ جس کے پیچھے ہوا لگی ہوتی ہے ( اور وہ بارش کو نہایت تیزی سے پورے علاقے میں پھیلا دیتی ہے ) ، وہ کچھ لوگوں کے پاس آئے گا، انہیں دعوت دے گا تو وہ اس کو جھٹلائیں گے اور اس کی بات رد کر دیں گے، لہٰذا وہ ان کے پاس سے چلا جائے گا مگر اس کے پیچھے پیچھے ان ( انکار کرنے والوں ) کے مال بھی چلے جائیں گے، ان کا حال یہ ہو گا کہ ان کے پاس کچھ بھی نہیں رہے، پھر وہ کچھ دوسرے لوگوں کے پاس جائے گا، انہیں دعوت دے گا، اور اس کی دعوت قبول کریں گے اور اس کی تصدیق کریں گے، تب وہ آسمان کو بارش برسانے کا حکم دے گا۔ آسمان بارش برسائے گا، وہ زمین کو غلہ اگانے کا حکم دے گا، زمین غلہ اگائے گی، ان کے چرنے والے جانور شام کو جب ( چراگاہ سے ) واپس آئیں گے، تو ان کے کوہان پہلے سے کہیں زیادہ لمبے ہوں گے، ان کی کوکھیں زیادہ کشادہ ہوں گی اور ان کے تھن کامل طور پر ( دودھ سے ) بھرے ہوں گے، پھر وہ کسی ویران جگہ میں آئے گا اور اس سے کہے گا: اپنا خزانہ نکال، پھر وہاں سے واپس ہو گا تو اس زمین کے خزانے شہد کی مکھیوں کے سرداروں کی طرح اس کے پیچھے لگ جائیں گے، پھر وہ ایک بھرپور اور مکمل جوان کو بلائے گا اور تلوار سے مار کر اس کے دو ٹکڑے کر دے گا۔ پھر اسے بلائے گا اور وہ روشن چہرے کے ساتھ ہنستا ہوا آ جائے گا، پس دجال اسی حالت میں ہو گا کہ اسی دوران عیسیٰ بن مریم علیہما السلام دمشق کی مشرقی جانب سفید مینار پر زرد کپڑوں میں ملبوس دو فرشتوں کے بازو پر ہاتھ رکھے ہوئے اتریں گے، جب وہ اپنا سر جھکائیں گے تو پانی ٹپکے گا اور جب اٹھائیں گے تو اس سے موتی کی طرح چاندی کی بوندیں گریں گی، ان کی سانس کی بھاپ جس کافر کو بھی پہنچے گی وہ مر جائے گا اور ان کی سانس کی بھاپ ان کی حد نگاہ تک محسوس کی جائے گی، وہ دجال کو ڈھونڈیں گے یہاں تک کہ اسے باب لد ۳؎ کے پاس پا لیں گے اور اسے قتل کر دیں گے۔ اسی حالت میں اللہ تعالیٰ جتنا چاہے گا عیسیٰ علیہ السلام ٹھہریں گے، پھر اللہ تعالیٰ ان کے پاس وحی بھیجے گا کہ میرے بندوں کو طور کی طرف لے جاؤ، اس لیے کہ میں نے کچھ ایسے بندے اتارے ہیں جن سے لڑنے کی کسی میں تاب نہیں ہے، ”اللہ تعالیٰ یاجوج ماجوج کو بھیجے گا اور وہ ویسے ہی ہوں گے جیسا اللہ تعالیٰ نے کہا ہے: «من كل حدب ينسلون» ”ہر بلندی سے پھیل پڑیں گے“ ( الأنبياء: ۹۶ ) ان کا پہلا گروہ ( شام کی ) بحیرہ طبریہ ( نامی جھیل ) سے گزرے گا اور اس کا تمام پانی پی جائے گا، پھر اس سے ان کا دوسرا گروہ گزرے گا تو کہے گا: اس میں کبھی پانی تھا ہی نہیں، پھر وہ لوگ چلتے رہیں گے یہاں تک کہ جبل بیت المقدس تک پہنچیں گے تو کہیں گے: ہم نے زمین والوں کو قتل کر دیا اب آؤ آسمان والوں کو قتل کریں، چنانچہ وہ لوگ آسمان کی طرف اپنے تیر چلائیں گے چنانچہ اللہ تعالیٰ ان کو خون سے سرخ کر کے ان کے پاس واپس کر دے گا، ( اس عرصے میں ) عیسیٰ بن مریم علیہما السلام اور ان کے ساتھی گھرے رہیں گے، یہاں تک کہ ( شدید قحط سالی کی وجہ سے ) اس وقت بیل کی ایک سری ان کے لیے تمہارے سو دینار سے بہتر معلوم ہو گی ( چیزیں اس قدر مہنگی ہوں گی ) ، پھر عیسیٰ بن مریم اور ان کے ساتھی اللہ کی طرف متوجہ ہوں گے، تو اللہ تعالیٰ یاجوج و ماجوج کی گردنوں میں ایک کیڑا پیدا کر دے گا، جس سے وہ سب دفعتاً ایک جان کی طرح مر جائیں گے، عیسیٰ اور ان کے ساتھی ( پہاڑ سے ) اتریں گے تو ایک بالشت بھی ایسی جگہ نہ ہو گی جو ان کی لاشوں کی گندگی، سخت بدبو اور خون سے بھری ہوئی نہ ہو، پھر عیسیٰ علیہ السلام اور ان کے ساتھی اللہ کی طرف متوجہ ہوں گے اور اللہ تعالیٰ ایسے بڑے پرندوں کو بھیجے گا جن کی گردنیں بختی اونٹوں کی گردنوں کی طرح ہوں گی، وہ لاشوں کو اٹھا کر گڈھوں میں پھینک دیں گے، مسلمان ان کے کمان، تیر اور ترکش سے سات سال تک ایندھن جلائیں گے ۴؎۔ پھر اللہ تعالیٰ ان پر ایسی بارش برسائے گا جسے کوئی کچا اور پکا گھر نہیں روک پائے گا، یہ بارش زمین کو دھو دے گی اور اسے آئینہ کی طرح صاف شفاف کر دے گی، پھر زمین سے کہا جائے گا: اپنا پھل نکال اور اپنی برکت واپس لا، چنانچہ اس وقت ایک انار ایک جماعت کے لیے کافی ہو گا، اس کے چھلکے سے یہ جماعت سایہ حاصل کرے گی، اور دودھ میں ایسی برکت ہو گی کہ لوگوں کی ایک بڑی جماعت کے لیے ایک دودھ دینے والی اونٹنی کافی ہو گی، اور دودھ دینے والی ایک گائے لوگوں کے ایک قبیلے کو کافی ہو گی اور دودھ دینے والی ایک بکری لوگوں میں سے ایک گھرانے کو کافی ہو گی، لوگ اسی حال میں ( کئی سالوں تک ) رہیں گے کہ اللہ تعالیٰ ایک ہوا بھیجے گا جو سارے مومنوں کی روح قبض کر لے گی اور باقی لوگ گدھوں کی طرح کھلے عام زنا کریں گے، پھر انہیں لوگوں پر قیامت ہو گی“ ۵؎۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ۲- ہم اسے صرف عبدالرحمٰن یزید بن جابر کی روایت سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 83
			}
		}
	]
}