{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2253,
			"arabicnumber": 2253,
			"text": "فاطمہ بنت قیس رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم منبر پر چڑھے، ہنسے پھر فرمایا: ”تمیم داری نے مجھ سے ایک بات بیان کی ہے جس سے میں بےحد خوش ہوں اور چاہتا ہوں کہ تم سے بھی بیان کروں، انہوں نے مجھ سے بیان کیا کہ فلسطین کے کچھ لوگ سمندر میں ایک کشتی پر سوار ہوئے، وہ کشتی ( طوفان میں پڑنے کی وجہ سے ) کسی اور طرف چلی گئی حتیٰ کہ انہیں سمندر کے کسی جزیرہ میں ڈال دیا، اچانک ان لوگوں نے بہت کپڑے پہنے ایک رینگنے والی چیز کو دیکھا جس کے بال بکھرے ہوئے تھے، ان لوگوں نے پوچھا: تم کیا ہو؟ اس نے کہا: میں جساسہ ( جاسوسی کرنے والی ) ہوں، ان لوگوں نے کہا: ہمیں ( اپنے بارے میں ) بتاؤ، اس نے کہا: نہ میں تم لوگوں کو کچھ بتاؤں گی اور نہ ہی تم لوگوں سے کچھ پوچھوں گی، البتہ تم لوگ بستی کے آخر میں جاؤ وہاں ایک آدمی ہے، جو تم کو بتائے گا اور تم سے پوچھے گا، چنانچہ ہم لوگ بستی کے آخر میں آئے تو وہاں ایک آدمی زنجیر میں بندھا ہوا تھا اس نے کہا: مجھے زغر ( ملک شام کی ایک بستی کا نام ہے ) کے چشمہ کے بارے میں بتاؤ، ہم نے کہا: بھرا ہوا ہے اور چھلک رہا ہے، اس نے کہا: مجھے بیسان کی کھجوروں کے بارے میں بتاؤ جو اردن اور فلسطین کے درمیان ہے، کیا اس میں پھل آیا؟ ہم نے کہا: ہاں، اس نے کہا: مجھے نبی ( آخرالزماں صلی اللہ علیہ وسلم ) کے بارے میں بتاؤ کیا وہ مبعوث ہوئے؟ ہم نے کہا: ہاں، اس نے کہا: بتاؤ لوگ ان کی طرف کیسے جاتے ہیں؟ ہم نے کہا: تیزی سے، اس نے زور سے چھلانگ لگائی حتیٰ کہ آزاد ہونے کے قریب ہو گیا، ہم نے پوچھا: تم کون ہو؟ اس نے کہا کہ وہ دجال ہے اور طیبہ کے علاوہ تمام شہروں میں داخل ہو گا، طیبہ سے مراد مدینہ ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث شعبہ کے واسطہ سے قتادہ کی روایت سے حسن صحیح غریب ہے، ۲- اسے کئی لوگوں نے شعبی کے واسطہ سے فاطمہ بنت قیس سے روایت کیا ہے ۱؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 96
			}
		}
	]
}