{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2298,
			"arabicnumber": 2298,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”خیانت کرنے والے مرد اور عورت کی گواہی درست اور مقبول نہیں ہے، اور نہ ان مردوں اور عورتوں کی گواہی مقبول ہے جن پر حد نافذ ہو چکی ہے، نہ اپنے بھائی سے دشمنی رکھنے والے کی گواہی مقبول ہے، نہ اس آدمی کی جس کی ایک بار جھوٹی گواہی آزمائی جا چکی ہو، نہ اس شخص کی گواہی جو کسی کے زیر کفالت ہو اس کفیل خاندان کے حق میں ( جیسے مزدور وغیرہ ) اور نہ اس شخص کی جو ولاء یا رشتہ داری کی نسبت میں متہم ہو“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ۲- ہم اسے صرف یزید بن زیاد دمشقی کی روایت سے جانتے ہیں، اور یزید ضعیف الحدیث ہیں، نیز یہ حدیث زہری کی روایت سے صرف اسی طریق سے جانی جاتی ہے، ۳- اس باب میں عبداللہ بن عمرو سے بھی حدیث مروی ہے، ۴- فزازی کہتے ہیں: «قانع» سے مراد «تابع» ہے، ۵- اس حدیث کا مطلب ہم نہیں سمجھتے اور نہ ہی سند کے اعتبار سے یہ میرے نزدیک صحیح ہے، ۶- اس بارے میں اہل علم کا عمل ہے کہ رشتہ دار کے لیے رشتہ کی گواہی درست ہے، البتہ بیٹے کے حق میں باپ کی گواہی یا باپ کے حق میں بیٹے کی گواہی کے بارے میں اہل علم کا اختلاف ہے، اکثر اہل علم بیٹے کے حق میں باپ کی گواہی یا باپ کے حق میں بیٹے کی گواہی کو درست نہیں سمجھتے، ۷- بعض اہل علم کہتے ہیں: جب گواہی دینے والا عادل ہو تو باپ کی گواہی بیٹے کے حق میں اسی طرح باپ کے حق میں بیٹے کی گواہی درست ہے، ۸- بھائی کی گواہی کے جواز کے بارے میں اختلاف نہیں ہے، ۹- اسی طرح رشتہ دار کے لیے رشتہ دار کی گواہی میں بھی اختلاف نہیں ہے، ۱۰- امام شافعی کہتے ہیں: جب دو آدمیوں میں دشمنی ہو تو ایک کے خلاف دوسرے کی گواہی درست نہ ہو گی، گرچہ گواہی دینے والا عادل ہو، انہوں نے عبدالرحمٰن اعرج کی حدیث سے استدلال کیا ہے جو نبی اکرم صلی اللہ علیہ وسلم سے مرسلاً مروی ہے کہ دشمنی رکھنے والے کی گواہی درست نہیں ہے، اسی طرح اس ( مذکورہ ) حدیث کا بھی مفہوم یہی ہے، ( جس میں ) آپ نے فرمایا: ”اپنے بھائی کے لیے دشمنی رکھنے والے کی گواہی درست نہیں ہے“۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		}
	]
}