{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اپنے مصلی پر تشریف لائے اور دیکھا کہ لوگ ہنس رہے ہیں، آپ نے فرمایا: ”آگاہ رہو! اگر تم لوگ لذتوں کو ختم کر دینے والی چیز کو یاد رکھتے تو تم اپنی ان حرکتوں سے باز رہتے، سو لذتوں کو ختم کر دینے والی موت کا ذکر کثرت سے کرو، اس لیے کہ قبر روزانہ بولتی ہے اور کہتی ہے: میں غربت کا گھر ہوں، میں تنہائی کا گھر ہوں، میں مٹی کا گھر ہوں، اور میں کیڑے مکوڑوں کا گھر ہوں، پھر جب مومن بندے کو دفن کیا جاتا ہے تو قبر اسے مرحبا ( خوش آمدید ) کہتی ہے اور مبارک باد دیتی ہے اور کہتی ہے: بیشک تو میرے نزدیک ان میں سب سے زیادہ محبوب تھا جو میرے پیٹھ پر چلتے ہیں، پھر اب جب کہ میں تیرے کام کی نگراں ہو گئی اور تو میری طرف آ گیا تو اب دیکھ لے گا کہ میں تیرے ساتھ کیسا حسن سلوک کروں گی، پھر اس کی نظر پہنچنے تک قبر کشادہ کر دی جائے گی اور اس کے لیے جنت کا ایک دروازہ کھول دیا جائے گا، اور جب فاجر یا کافر دفن کیا جاتا ہے تو قبر اسے نہ ہی مرحبا کہتی ہے اور نہ ہی مبارک باد دیتی ہے بلکہ کہتی ہے: بیشک تو میرے نزدیک ان میں سب سے زیادہ قابل نفرت تھا جو میری پیٹھ پر چلتے ہیں، پھر اب جب کہ میں تیرے کام کی نگراں ہوں اور تو میری طرف آ گیا سو آج تو اپنے ساتھ میری بدسلوکیاں دیکھ لے گا، پھر وہ اس کو دباتی ہے، اور ہر طرف سے اس پر زور ڈالتی ہے یہاں تک کہ اس کی پسلیاں ایک طرف سے دوسری طرف مل جاتی ہیں، رسول اللہ صلی اللہ علیہ وسلم نے اپنی انگلیوں سے اشارہ کیا اور ایک دوسرے کو آپس میں داخل کر کے فرمایا: ”اللہ اس پر ستر اژدہے مقرر کر دے گا، اگر ان میں سے کوئی ایک بار بھی زمین پر پھونک مار دے تو اس پر رہتی دنیا تک کبھی گھاس نہ اگے، پھر وہ اژدہے اسے حساب و کتاب لیے جانے تک دانتوں سے کاٹیں گے اور نوچیں گے“، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بیشک قبر جنت کے باغوں میں سے ایک باغ ہے یا جہنم کے گڑھوں میں سے ایک گڑھا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے، اسے ہم صرف اسی سند سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 46
			}
		}
	]
}