{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "سعید بن مسیب سے روایت ہے وہ ابوہریرہ رضی الله عنہ سے ملے تو ابوہریرہ رضی الله عنہ نے کہا: میں اللہ سے دعا کرتا ہوں کہ وہ مجھے اور تم کو جنت کے بازار میں اکٹھا کرے۔ سعید بن مسیب نے کہا: کیا اس میں بازار بھی ہے؟ ابوہریرہ رضی الله عنہ نے کہا: ہاں، مجھے رسول اللہ صلی اللہ علیہ وسلم نے خبر دی کہ جب جنتی جنت میں داخل ہوں گے تو وہ اس میں اپنے اعمال کے مطابق اتریں گے، پھر دنیا کے دنوں میں سے جمعہ کے دن کے برابر انہیں اجازت دی جائے گی تو وہ اپنے رب کی زیارت کریں گے، ان کے لیے عرش ظاہر ہو گا اور جنت کے ایک باغ میں نظر آئے گا، پھر ان کے لیے نور کے منبر، موتی کے منبر، یاقوت کے منبر، زمرد کے منبر، سونے کے منبر، اور چاندی کے منبر رکھے جائیں گے، ان کے ادنیٰ درجہ والے حالانکہ ان میں کوئی بھی ادنیٰ نہیں ہو گا مشک اور کافور کے ٹیلے پر بیٹھیں گے اور دوسرے منبر والوں کے بارے میں یہ نہیں خیال کریں گے کہ وہ ان سے اچھی جگہ بیٹھے ہیں۔ ابوہریرہ رضی الله عنہ کہتے ہیں: میں نے عرض کیا: اللہ کے رسول! کیا ہم اپنے رب کو دیکھیں گے؟ آپ نے فرمایا: ”ہاں، کیا تم سورج اور چودہویں رات کے چاند دیکھنے میں دھکم پیل کیے جاتے ہو؟“ ہم نے کہا: نہیں، آپ نے فرمایا: ”اسی طرح تم اپنے رب کا دیدار کرنے میں دھکم پیل نہیں کرو گے، اور اس مجلس میں کوئی ایسا آدمی نہیں ہو گا جس کے روبرو اللہ تعالیٰ گفتگو نہ کرے، حتیٰ کہ ان میں سے ایک آدمی سے کہے گا: اے فلاں بن فلاں! کیا تمہیں وہ دن یاد ہے جب تم نے ایسا ایسا کیا تھا؟ پھر اسے اس کے بعض گناہ یاد دلائے گا جو دنیا میں اس نے کیے تھے تو وہ آدمی کہے گا: اے میرے رب! کیا تو نے مجھے معاف نہیں کر دیا؟ اللہ تعالیٰ کہے گا: کیوں نہیں؟ میری مغفرت کے سبب ہی تم اس مقام پر ہو۔ وہ سب اسی حال میں ہوں گے کہ اوپر سے انہیں ایک بدلی ڈھانپ لے گی اور ان پر ایسی خوشبو برسائے گی کہ اس طرح کی خوشبو انہیں کبھی نہیں ملی ہو گی اور ہمارا رب تبارک و تعالیٰ کہے گا: اس کرامت اور انعام کی طرف جاؤ جو ہم نے تمہارے لیے تیار کر رکھی ہے، اور اس میں سے جو چاہو لو، چنانچہ ہم ایک ایسے بازار میں آئیں گے جسے فرشتے گھیرے ہوں گے اس میں ایسی چیزیں ہوں گی کہ اس طرح نہ کبھی آنکھوں نے دیکھی ہو گی نہ کانوں نے سنا ہو گا اور نہ کبھی دلوں میں اس کا خیال آیا ہو گا، ہم جو چاہیں گے ہمارے پاس لایا جائے گا، اس میں خرید و فروخت نہیں ہو گی اور اسی بازار میں جنتی ایک دوسرے سے ملاقات کریں گے“، آپ نے فرمایا: ”ایک بلند مرتبہ والا آدمی اپنے سے کم رتبہ والے کی طرف متوجہ ہو گا اور اس سے ملاقات کرے گا ( حالانکہ حقیقت میں اس میں سے کوئی بھی کم مرتبے والا نہیں ہو گا ) تو اسے ( ادنیٰ مرتبے والے کو ) اس کا لباس دیکھ کر عجیب سا لگے گا پھر اس کی آخری گفتگو ختم بھی نہیں ہو گی کہ اسے محسوس ہو گا کہ اس کا لباس اس سے بھی اچھا ہے اور یہ اس وجہ سے ہو گا کہ جنت میں کسی کا مغموم ہونا مناسب نہیں ہے۔ پھر ہم ( جنتی ) اپنے گھروں کی طرف واپس جائیں گے اور اپنی بیویوں سے ملیں گے تو وہ کہیں گی: خوش آمدید! آپ ایسا حسن و جمال لے کر آئے ہیں جو اس سے کہیں بہتر ہے جب آپ ہم سے جدا ہوئے تھے، تو وہ آدمی کہے گا: آج ہم اپنے رب جبار کے ساتھ بیٹھے تھے اور ہمارا حق ہے کہ ہم اسی طرح لوٹیں جس طرح لوٹے ہیں“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث غریب ہے، ہم اسے صرف اسی سند سے جانتے ہیں، ۲- ـ سوید بن عمرو نے بھی اوزاعی سے اس حدیث کا بعض حصہ روایت کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 27
			}
		}
	]
}