{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ قیامت کے دن تمام لوگوں کو ایک وسیع اور ہموار زمین میں جمع کرے گا، پھر اللہ رب العالمین ان کے سامنے اچانک آئے گا اور کہے گا: کیوں نہیں ہر آدمی اس چیز کے پیچھے چلا جاتا ہے جس کی وہ عبادت کرتا تھا؟ چنانچہ صلیب پوجنے والوں کے سامنے ان کی صلیب کی صورت بن جائے گی، بت پوجنے والوں کے سامنے بتوں کی صورت بن جائے گی اور آگ پوجنے والوں کے سامنے آگ کی صورت بن جائے گی، پھر وہ لوگ اپنے اپنے معبودوں کے پیچھے لگ جائیں گے اور مسلمان ٹھہرے رہیں گے، پھر رب العالمین ان کے پاس آئے گا اور کہے گا: تم بھی لوگوں کے ساتھ کیوں نہیں چلے جاتے؟ وہ کہیں گے: ہم تجھ سے اللہ کی پناہ مانگتے ہیں، ہم تجھ سے اللہ کی پناہ مانگتے ہیں، ہمارا رب اللہ تعالیٰ ہے، ہم یہیں رہیں گے یہاں تک کہ ہم اپنے رب کو دیکھ لیں۔ اللہ تعالیٰ انہیں حکم دے گا اور ان کو ثابت قدم رکھے گا اور چھپ جائے گا، پھر آئے گا اور کہے گا: تم بھی لوگوں کے ساتھ کیوں نہیں چلے جاتے؟ وہ کہیں گے: ہم تجھ سے اللہ کی پناہ مانگتے ہیں، ہم تجھ سے اللہ کی پناہ مانگتے ہیں، ہمارا رب اللہ ہے اور ہماری جگہ یہی ہے یہاں تک کہ ہم اپنے رب کو دیکھ لیں، اللہ تعالیٰ انہیں حکم دے گا اور انہیں ثابت قدم رکھے گا، صحابہ نے عرض کیا: اللہ کے رسول! کیا ہم اللہ تعالیٰ کو دیکھیں گے؟ آپ نے فرمایا: ”کیا چودہویں رات کے چاند دیکھنے میں تمہیں کوئی مزاحمت اور دھکم پیل ہوتی ہے؟“ صحابہ نے عرض کیا: نہیں، اے اللہ کے رسول! آپ نے فرمایا: ”تم اللہ تعالیٰ کے دیکھنے میں اس وقت کوئی مزاحمت اور دھکم پیل نہیں کرو گے۔ پھر اللہ تعالیٰ چھپ جائے گا پھر جھانکے گا اور ان سے اپنی شناخت کرائے گا، پھر کہے گا: میں تمہارا رب ہوں، میرے پیچھے آؤ، چنانچہ مسلمان کھڑے ہوں گے اور پل صراط قائم کیا جائے گا، اس پر سے مسلمان تیز رفتار گھوڑے اور سوار کی طرح گزریں گے اور گزرتے ہوئے ان سے یہ کلمات ادا ہوں گے «سلم سلم» ”سلامت رکھ، سلامت رکھ“، صرف جہنمی باقی رہ جائیں گے تو ان میں سے ایک گروہ کو جہنم میں پھینک دیا جائے گا، پھر پوچھا جائے گا: کیا تو بھر گئی؟ جہنم کہے گی: «هل من مزيد» اور زیادہ، پھر اس میں دوسرا گروہ پھینکا جائے گا اور پوچھا جائے گا: کیا تو بھر گئی؟ وہ کہے گی: «هل من مزيد» اور زیادہ، یہاں تک کہ جب تمام لوگ پھینک دیے جائیں گے تو رحمن اس میں اپنا پیر ڈالے گا اور جہنم کا ایک حصہ دوسرے میں سمٹ جائے گا، پھر اللہ تعالیٰ کہے گا: بس۔ جہنم کہے گی: «قط قط» بس، بس۔ جب اللہ تعالیٰ جنتیوں کو جنت میں اور جہنمیوں کو جہنم میں داخل کر دے گا، تو موت کو کھینچتے ہوئے اس دیوار تک لایا جائے گا جو جنت اور جہنم کے درمیان ہے، پھر کہا جائے گا: اے جنتیو! تو وہ ڈرتے ہوئے جھانکیں گے، پھر کہا جائے گا: اے جہنمیو! تو وہ شفاعت کی امید میں خوش ہو کر جھانکیں گے، پھر جنتیوں اور جہنمیوں سے کہا جائے گا: کیا تم اسے جانتے ہو؟ تو یہ بھی کہیں گے اور وہ بھی کہیں گے: ہم نے اسے پہچان لیا، یہ وہی موت ہے جو ہمارے اوپر وکیل تھی، پھر وہ جنت اور جہنم کی بیچ والی دیوار پر لٹا کر یکبارگی ذبح کر دی جائے گی، پھر کہا جائے گا: اے جنتیو! ہمیشہ ( جنت میں ) رہنا ہے موت نہیں آئے گی۔ اے جہنمیو! ہمیشہ ( جہنم میں ) رہنا ہے موت نہیں آئے گی“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- نبی اکرم صلی اللہ علیہ وسلم سے اسی جیسی بہت سی احادیث مروی ہیں جس میں دیدار الٰہی کا ذکر ہے کہ لوگ اپنے رب کو دیکھیں گے، قدم اور اسی طرح کی چیزوں کا بھی ذکر ہے، ۳- اس سلسلے میں ائمہ اہل علم جیسے سفیان ثوری، مالک بن انس، ابن مبارک، ابن عیینہ اور وکیع وغیرہ کا مسلک یہ ہے کہ وہ ان چیزوں کی روایت کرتے ہیں اور کہتے ہیں: یہ حدیثیں آئی ہیں اور ہم اس پر ایمان لاتے ہیں، لیکن صفات باری تعالیٰ کی کیفیت کے بارے میں کچھ نہیں کہا جائے گا، محدثین کا مسلک یہ یہی کہ یہ چیزیں ویسی ہی روایت کی جائیں گی جیسی وارد ہوئی ہیں، ان کی نہ ( باطل ) تفسیر کی جائے گی نہ اس میں کوئی وہم پیدا کیا جائے گا، اور نہ ان کی کیفیت وکنہ کے بارے میں پوچھا جائے گا، اہل علم نے اسی مسلک کو اختیار کیا ہے اور لوگ اسی کی طرف گئے ہیں، ۴- حدیث کے اندر «فيعرفهم نفسه» کا مفہوم یہ ہے کہ اللہ تعالیٰ ان کے لیے تجلی فرمائے گا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		}
	]
}