{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"41": "Chapters on Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2682,
			"arabicnumber": 2682,
			"text": "قیس بن کثیر کہتے ہیں کہ ایک شخص مدینہ سے ابو الدرداء رضی الله عنہ کے پاس دمشق آیا، ابوالدرداء رضی الله عنہ نے اس سے کہا: میرے بھائی! تمہیں یہاں کیا چیز لے کر آئی ہے، اس نے کہا: مجھے یہ بات معلوم ہوئی ہے کہ آپ رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث بیان کرتے ہیں، ابو الدرداء نے کہا: کیا تم کسی اور ضرورت سے تو نہیں آئے ہو؟ اس نے کہا: نہیں، انہوں نے کہا: کیا تم تجارت کی غرض سے تو نہیں آئے ہو؟ اس نے کہا: نہیں۔ میں تو صرف اس حدیث کی طلب و تلاش میں آیا ہوں، ابو الدرداء نے کہا: ( اچھا تو سنو ) میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”جو شخص علم دین کی تلاش میں کسی راستہ پر چلے، تو اللہ تعالیٰ اس کے ذریعہ اسے جنت کے راستہ پر لگا دیتا ہے۔ بیشک فرشتے طالب ( علم ) کی خوشی کے لیے اپنے پر بچھا دیتے ہیں، اور عالم کے لیے آسمان و زمین کی ساری مخلوقات مغفرت طلب کرتی ہیں۔ یہاں تک کہ پانی کے اندر کی مچھلیاں بھی، اور عالم کی فضیلت عابد پر ایسی ہی ہے جیسے چاند کی فضیلت سارے ستاروں پر، بیشک علماء انبیاء کے وارث ہیں اور انبیاء نے کسی کو دینار و درہم کا وارث نہیں بنایا، بلکہ انہوں نے علم کا وارث بنایا ہے۔ اس لیے جس نے اس علم کو حاصل کر لیا، اس نے ( علم نبوی اور وراثت نبوی سے ) پورا پورا حصہ لیا“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ہم عاصم بن رجاء بن حیوہ کی روایت کے سوا کسی اور طریقہ سے اس حدیث کو نہیں جانتے، اور اس حدیث کی سند میرے نزدیک متصل نہیں ہے۔ اسی طرح انہیں اسناد سے محمود بن خداش نے بھی ہم سے بیان کی ہے، ۲- یہ حدیث عاصم بن رجاء بن حیوہ نے بسند «داود بن جميل عن كثير بن قيس عن أبي الدرداء عن النبي صلى الله عليه وسلم» روایت کی ہے۔ اور یہ حدیث محمود بن خداش کی حدیث سے زیادہ صحیح ہے، اور محمد بن اسماعیل بخاری کی رائے ہے کہ یہ زیادہ صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 38
			}
		}
	]
}