{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ابی بن کعب رضی الله عنہ کے پاس سے گزرے وہ نماز پڑھ رہے تھے، آپ نے فرمایا: ”اے ابی ( سنو ) وہ ( آواز سن کر ) متوجہ ہوئے لیکن جواب نہ دیا، نماز جلدی جلدی پوری کی، پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا: السلام علیک یا رسول اللہ! ( اللہ کے رسول آپ پر سلامتی نازل ہو ) ، رسول اللہ صلی اللہ علیہ وسلم نے کہا: وعلیک السلام ( تم پر بھی سلامتی ہو ) ابی! جب میں نے تمہیں بلایا تو تم میرے پاس کیوں نہ حاضر ہوئے؟ انہوں نے کہا: اللہ کے رسول! میں نماز پڑھ رہا تھا۔ آپ نے فرمایا: ” ( اب تک ) جو وحی مجھ پر نازل ہوئی ہے اس میں تجھے کیا یہ آیت نہیں ملی «استجيبوا لله وللرسول إذا دعاكم لما يحييكم» ”اے ایمان والو! تم اللہ اور رسول کے کہنے کو بجا لاؤ، جب کہ رسول تم کو تمہاری زندگی بخش چیز کی طرف بلاتے ہوں“ ( انفال ۲۴ ) ، انہوں نے کہا: جی ہاں، اور آئندہ إن شاء اللہ ایسی بات نہ ہو گی۔ آپ نے فرمایا: ”کیا تمہیں پسند ہے کہ میں تمہیں ایسی سورت سکھاؤں جیسی سورت نہ تو رات میں نازل ہوئی نہ انجیل میں اور نہ زبور میں اور نہ ہی قرآن میں؟“ انہوں نے کہا: اللہ کے رسول! ( ضرور سکھائیے ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”نماز میں تم ( قرآن ) کیسے پڑھتے ہو؟“ تو انہوں نے ام القرآن ( سورۃ فاتحہ ) پڑھی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قسم ہے اس ذات کی جس کے قبضے میں میری جان ہے۔ تورات میں، انجیل میں، زبور میں ( حتیٰ کہ ) قرآن اس جیسی سورت نازل نہیں ہوئی ہے۔ یہی سبع مثانی ۲؎ ( سات آیتیں ) ہیں اور یہی وہ قرآن عظیم ہے جو مجھے عطا کیا گیا ہے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اس باب میں انس بن مالک اور ابوسعید بن معلی رضی الله عنہ سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		}
	]
}