{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"46": "Chapters on Recitation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2946,
			"arabicnumber": 2946,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ میں نے کہا: اللہ کے رسول! میں کتنے دنوں میں قرآن پڑھ ڈالوں؟ آپ نے فرمایا: ”مہینے میں ایک بار ختم کرو“، میں نے کہا میں اس سے بڑھ کر ( یعنی کم مدت میں ) ختم کرنے کی طاقت رکھتا ہوں۔ آپ نے فرمایا: ”تو بیس دن میں ختم کرو“۔ میں نے کہا: میں اس سے زیادہ کی یعنی اور بھی کم مدت میں ختم کرنے کی طاقت رکھتا ہوں۔ آپ نے فرمایا: ”پندرہ دن میں ختم کر لیا کرو“۔ میں نے کہا: میں اس سے بھی زیادہ کی طاقت رکھتا ہوں۔ آپ نے فرمایا: ”دس دن میں ختم کر لیا کرو“۔ میں نے کہا: میں اس سے بھی زیادہ کی طاقت رکھتا ہوں، آپ نے فرمایا: ”پانچ دن میں ختم کر لیا کرو“۔ میں نے کہا: میں اس سے بھی زیادہ کی طاقت رکھتا ہوں۔ تو آپ نے مجھے پانچ دن سے کم مدت میں قرآن ختم کرنے کی اجازت نہیں دی۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث اس سند سے حسن صحیح غریب ہے، ۲- یہ حدیث بطریق: «أبي بردة عن عبد الله بن عمرو» غریب سمجھی گئی ہے، ۳- یہ حدیث کئی سندوں سے عبداللہ بن عمرو سے مروی ہے۔ عبداللہ بن عمرو سے مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس نے قرآن تین دن سے کم مدت میں پڑھا، اس نے قرآن کو نہیں سمجھا“، ۴- عبداللہ بن عمرو سے ( یہ بھی ) مروی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: ”قرآن چالیس دن میں پڑھ ڈالا کرو“، ۵- اسحاق بن ابراہیم بن راہویہ کہتے ہیں: ہم اس حدیث کی بنا پر کسی آدمی کے لیے یہ پسند نہیں کرتے کہ اس پر چالیس دن سے زیادہ گزر جائیں اور وہ قرآن پاک ختم نہ کر چکا ہو، ۶- اس حدیث کی بنا پر جو نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے بعض اہل علم کہتے ہیں کہ تین دن سے کم مدت میں قرآن پڑھ کر نہ ختم کیا جائے، ۷- اور بعض اہل علم نے اس کی رخصت دی ہے، ۸- اور عثمان بن عفان سے متعلق ہے مروی ہے کہ وہ وتر کی ایک رکعت میں پورا قرآن پڑھ ڈالتے تھے، ۹- سعید بن جبیر سے مروی ہے کہ انہوں نے کعبہ کے اندر ایک رکعت میں پورا قرآن پڑھا، ۱۰- قرأت میں ترتیل ( ٹھہر ٹھہر کر پڑھنا ) اہل علم کے نزدیک پسندیدہ ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		}
	]
}