{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "اسلم ابوعمران تجیبی کہتے ہیں کہ ہم روم شہر میں تھے، رومیوں کی ایک بڑی جماعت ہم پر حملہ آور ہونے کے لیے نکلی تو مسلمان بھی انہی جیسی بلکہ ان سے بھی زیادہ تعداد میں ان کے مقابلے میں نکلے، عقبہ بن عامر رضی الله عنہ اہل مصر کے گورنر تھے اور فضالہ بن عبید رضی الله عنہ فوج کے سپہ سالار تھے۔ ایک مسلمان رومی صف پر حملہ آور ہو گیا اور اتنا زبردست حملہ کیا کہ ان کے اندر گھس گیا۔ لوگ چیخ پڑے، کہنے لگے: سبحان اللہ! اللہ پاک و برتر ہے اس نے تو خود ہی اپنے آپ کو ہلاکت میں جھونک دیا ہے۔ ( یہ سن کر ) ابوایوب انصاری رضی الله عنہ کھڑے ہوئے اور کہا: لوگو! تم اس آیت کی یہ تاویل کرتے ہو، یہ آیت تو ہم انصار کے بارے میں اتری ہے، جب اللہ نے اسلام کو طاقت بخشی اور اس کے مددگار بڑھ گئے تو ہم میں سے بعض لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے چھپا کر رازداری سے آپس میں کہا کہ ہمارے مال برباد ہو گئے ہیں ( یعنی ہماری کھیتی باڑیاں تباہ ہو گئی ہیں ) اللہ نے اسلام کو قوت و طاقت بخش دی۔ اس کے ( حمایتی ) و مددگار بڑھ گئے، اب اگر ہم اپنے کاروبار اور کھیتی باڑی کی طرف متوجہ ہو جاتے تو جو نقصان ہو گیا ہے اس کمی کو پورا کر لیتے، چنانچہ ہم میں سے جن لوگوں نے یہ بات کہی تھی اس کے رد میں اللہ تعالیٰ نے اپنے نبی پر یہ آیت نازل فرمائی۔ اللہ نے فرمایا: «وأنفقوا في سبيل الله ولا تلقوا بأيديكم إلى التهلكة» ”اللہ تعالیٰ کی راہ میں خرچ کرو اور اپنے ہاتھوں کو ہلاکت میں نہ ڈالو“ ( البقرہ: ۱۹۵ ) ، تو ہلاکت یہ تھی کہ مالی حالت کو سدھار نے کی جدوجہد میں لگا جائے، اور جہاد کو چھوڑ دیا جائے ( یہی وجہ تھی کہ ) ابوایوب انصاری رضی الله عنہ ہمیشہ اللہ کی راہ میں جہاد کی ایک علامت و ہدف کی حیثیت اختیار کر گئے تھے یہاں تک کہ سر زمین روم میں مدفون ہوئے۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		}
	]
}