{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2981,
			"arabicnumber": 2981,
			"text": "معقل بن یسار رضی الله عنہ کہتے ہیں کہ انہوں نے نبی اکرم کے زمانے میں اپنی بہن کی شادی ایک مسلمان شخص سے کر دی۔ وہ اس کے یہاں کچھ عرصے تک رہیں، پھر اس نے انہیں ایسی طلاق دی کہ اس کے بعد ان سے رجوع نہ کیا یہاں تک کہ عدت کی مدت ختم ہو گئی۔ پھر دونوں کے دلوں میں ایک دوسرے کی خواہش و چاہت پیدا ہوئی اور ( دوسرے ) پیغام نکاح دینے والوں کے ساتھ اس نے بھی پیغام نکاح دیا۔ معقل رضی الله عنہ نے اس سے کہا: بیوقوف! میں نے تمہاری شادی اس سے کر کے تیری عزت افزائی کی تھی پھر بھی تو اسے طلاق دے بیٹھا، قسم اللہ کی! اب وہ تمہاری طرف زندگی بھر کبھی بھی لوٹ نہیں سکتی، اور اللہ معلوم تھا کہ اس شخص کو اس عورت کی حاجت و خواہش ہے اور اس عورت کو اس شخص کی حاجت و چاہت ہے۔ تو اللہ تبارک وتعالیٰ نے یہ آیت: «وإذا طلقتم النساء فبلغن أجلهن» سے «وأنتم لا تعلمون» ۱؎ تک نازل فرمائی۔ جب معقل رضی الله عنہ نے یہ آیت سنی تو کہا: اب اپنے رب کی بات سنتا ہوں اور اطاعت کرتا ہوں ( یہ کہہ کر ) بلایا اور کہا: میں تمہاری شادی ( دوبارہ ) کیے دیتا ہوں اور تجھے عزت بخشتا ہوں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- یہ کئی سندوں سے حسن بصری سے مروی ہے۔ حسن بصری کے واسطہ سے یہ غریب ہے، ۳- اس حدیث میں اس بات کا ثبوت ہے کہ بغیر ولی کے نکاح جائز نہیں ہے۔ اس لیے کہ معقل بن یسار کی بہن ثیبہ تھیں۔ اگر ولی کی بجائے معاملہ ان کے ہاتھ میں ہوتا تو وہ اپنی شادی آپ کر سکتی تھیں اور وہ اپنے ولی معقل بن یسار کی محتاج نہ ہوتیں۔ آیت میں اللہ تعالیٰ نے اولیاء کو خطاب کیا ہے اور کہا ہے کہ انہیں اپنے ( سابق ) شوہروں سے نکاح کرنے سے نہ روکو۔ تو اس آیت میں اس بات کا ثبوت ہے کہ نکاح کا معاملہ عورتوں کی رضا مندی کے ساتھ اولیاء کے ہاتھ میں ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 33
			}
		}
	]
}