{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3068,
			"arabicnumber": 3068,
			"text": "مسروق کہتے ہیں کہ میں ام المؤمنین عائشہ رضی الله عنہا کے پاس ٹیک لگا کر بیٹھا ہوا تھا، انہوں نے کہا: اے ابوعائشہ! تین چیزیں ایسی ہیں کہ ان میں سے کسی نے ایک بھی کیا تو وہ اللہ پر بڑی بہتان لگائے گا: ( ۱ ) جس نے خیال کیا کہ محمد صلی اللہ علیہ وسلم نے ( معراج کی رات میں ) اللہ کو دیکھا ہے تو اس نے اللہ کی ذات کے بارے میں بڑی بہتان لگائی۔ کیونکہ اللہ اپنی ذات کے بارے میں کہتا ہے «لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير» ”کہ اسے انسانی نگاہیں نہیں پا سکتی ہیں، اور وہ نگاہوں کو پا لیتا ہے ( یعنی اسے کوئی نہیں دیکھ سکتا اور وہ سبھی کو دیکھ لیتا ہے ) اور اس کی ذات لطیف و خبیر ہے“، «وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب» ”کسی انسان کو بھی یہ مقام و درجہ حاصل نہیں ہے کہ اللہ اس سے بغیر وحی کے یا بغیر پردے کے براہ راست اس سے بات چیت کرے“، ( وہ کہتے ہیں ) میں ٹیک لگائے ہوئے تھا اور اٹھ بیٹھا، میں نے کہا: ام المؤمنین! مجھے بولنے کا موقع دیجئیے اور میرے بارے میں حکم لگانے میں جلدی نہ کیجئے گا، کیا اللہ تعالیٰ نے یہ نہیں فرمایا: «ولقد رآه نزلة أخرى» ”بیشک محمد نے اسے تو ایک مرتبہ اور بھی دیکھا تھا“ ( النجم: ۱۳ ) «ولقد رآه بالأفق المبين» ”بیشک انہوں نے اسے آسمان کے روشن کنارے پر دیکھا“ ( التکویر: ۲۳ ) تب عائشہ رضی الله عنہا نے کہا: قسم اللہ کی! میں وہ پہلی ذات ہوں جس نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں پوچھا۔ آپ نے فرمایا: ”وہ تو جبرائیل علیہ السلام تھے ( ان آیتوں میں میرے دیکھنے سے مراد جبرائیل علیہ السلام کو دیکھنا تھا، اللہ کو نہیں ) ان دو مواقع کے سوا اور کوئی موقع ایسا نہیں ہے جس میں جبرائیل علیہ السلام کو میں نے ان کی اپنی اصل صورت میں دیکھا ہو۔ جس پر ان کی تخلیق ہوئی ہے، میں نے ان کو آسمان سے اترتے ہوئے دیکھا ہے، ان کی بناوٹ کی بڑائی یعنی بھاری بھر کم جسامت نے آسمان و زمین کے درمیان جگہ کو گھیر رکھا تھا“، ( ۲ ) : اور دوسرا وہ شخص کہ جو اللہ پر جھوٹا الزام لگانے کا بڑا مجرم ہے جس نے یہ خیال کیا کہ اللہ نے محمد صلی اللہ علیہ وسلم پر جو چیزیں اتاری ہیں ان میں سے کچھ چیزیں محمد صلی اللہ علیہ وسلم نے چھپا لی ہیں۔ جب کہ اللہ کہتا ہے «يا أيها الرسول بلغ ما أنزل إليك من ربك» ”جو چیز اللہ کی جانب سے تم پر اتاری گئی ہے اسے لوگوں تک پہنچا دو“ ( النساء: ۶۷ ) ، ( ۳ ) : وہ شخص بھی اللہ پر جھوٹا الزام لگانے والا ہے جو یہ سمجھے کہ کل کیا ہونے والا ہے، محمد اسے جانتے ہیں، جب کہ اللہ خود کہتا ہے «قل لا يعلم من في السموات والأرض الغيب إلا الله» ”کہ آسمان و زمین میں غیب اللہ کے سوا کوئی نہیں جانتا ہے“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 120
			}
		}
	]
}