{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3086,
			"arabicnumber": 3086,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ میں نے عثمان بن عفان رضی الله عنہ سے کہا کہ کس چیز نے آپ کو آمادہ کیا کہ سورۃ الانفال کو جو «مثانی» میں سے ہے اور سورۃ برأۃ کو جو «مئین» میں سے ہے دونوں کو ایک ساتھ ملا دیا، اور ان دونوں سورتوں کے بیچ میں «بسم الله الرحمن الرحيم» کی سطر بھی نہ لکھی۔ اور ان دونوں کو «سبع طوال» ( سات لمبی سورتوں ) میں شامل کر دیا۔ کس سبب سے آپ نے ایسا کیا؟ عثمان رضی الله عنہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم پر زمانہ آتا جا رہا تھا اور آپ پر متعدد سورتیں نازل ہو رہی تھیں، تو جب آپ پر کوئی آیت نازل ہوتی تو وحی لکھنے والوں میں سے آپ کسی کو بلاتے اور کہتے کہ ان آیات کو اس سورۃ میں شامل کر دو جس میں ایسا ایسا مذکور ہے۔ اور پھر جب آپ پر کوئی آیت اترتی تو آپ فرماتے اس آیت کو اس سورۃ میں رکھ دو جس میں اس اس طرح کا ذکر ہے۔ سورۃ الانفال ان سورتوں میں سے ہے جو مدینہ میں آنے کے بعد شروع شروع میں نازل ہوئی ہیں۔ اور سورۃ برأت قرآن کے آخر میں نازل ہوئی ہے۔ اور دونوں کے قصوں میں ایک دوسرے سے مشابہت تھی تو ہمیں خیال ہوا کہ یہ اس کا ایک حصہ ( و تکملہ ) ہے۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں یہ بتائے بغیر کہ یہ سورۃ اسی سورۃ کا جزو حصہ ہے اس دنیا سے رحلت فرما گئے۔ اس سبب سے ہم نے ان دونوں سورتوں کو ایک ساتھ ملا دیا اور ان دونوں سورتوں کے درمیان ہم نے «بسم الله الرحمن الرحيم» نہیں لکھا اور ہم نے اسے «سبع طوال» میں رکھ دیا ( شامل کر دیا ) ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسے ہم صرف عوف کی روایت سے جانتے ہیں، جسے وہ یزید فارسی کے واسطہ سے ابن عباس سے روایت کرتے ہیں، اور یزید فارسی تابعین میں سے ہیں، انہوں نے ابن عباس سے کئی حدیثیں روایت کی ہیں۔ اور کہا جاتا ہے کہ وہ یزید بن ہرمز ہیں۔ اور یزید رقاشی یہ یزید بن ابان رقاشی ہیں، یہ تابعین میں سے ہیں اور ان کی ملاقات ابن عباس سے نہیں ہے۔ انہوں نے صرف انس بن مالک سے روایت کی ہے، اور یہ دونوں ہی بصرہ والوں میں سے ہیں۔ اور یزید فارسی، یزید رقاشی سے متقدم ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 138
			}
		}
	]
}