{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3097,
			"arabicnumber": 3097,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ میں نے عمر بن خطاب رضی الله عنہ کو کہتے ہوئے سنا کہ جب عبداللہ بن ابی ( منافقوں کا سردار ) مرا تو رسول اللہ صلی اللہ علیہ وسلم اس کی نماز جنازہ پڑھنے کے لیے بلائے گئے، آپ کھڑے ہو کر اس کی طرف بڑھے اور اس کے سامنے کھڑے ہو کر نماز پڑھانے کا ارادہ کر ہی رہے تھے کہ میں لپک کر آپ کے سینے کے سامنے جا کھڑا ہوا، میں نے کہا: اللہ کے رسول! کیا آپ اللہ کے دشمن عبداللہ بن ابی کی نماز پڑھنے جا رہے ہیں جس نے فلاں فلاں دن ایسا اور ایسا کہا تھا؟ وہ اس کے بےادبی و بدتمیزی کے دن گن گن کر بیان کرنے لگے، رسول اللہ صلی اللہ علیہ وسلم مسکراتے رہے یہاں تک کہ جب میں بہت کچھ کہہ گیا ( حد سے تجاوز کر گیا ) تو آپ نے فرمایا: ” ( بس بس ) مجھ سے ذرا پرے جاؤ عمر! مجھے اختیار دیا گیا ہے تو میں نے اس کے لیے مغفرت طلبی کو ترجیح دی ہے۔ کیونکہ مجھ سے کہا گیا ہے: «استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة فلن يغفر الله لهم» ”ان ( منافقوں ) کے لیے مغفرت طلب کرو یا نہ کرو اگر تم ان کے لیے ستر بار بھی مغفرت طلب کرو گے تو بھی وہ انہیں معاف نہ کرے گا“ ( التوبہ: ۸۰ ) ، اگر میں جانتا کہ ستر بار سے زیادہ مغفرت طلب کرنے سے وہ معاف کر دیا جائے گا تو ستر بار سے بھی زیادہ میں اس کے لیے مغفرت مانگتا۔ پھر آپ نے عبداللہ بن ابی کی نماز جنازہ پڑھی اور جنازہ کے ساتھ چلے اور اس کی قبر پر کھڑے رہے، یہاں تک کہ اس کے کفن دفن سے فارغ ہو گئے۔ رسول اللہ صلی اللہ علیہ وسلم کی شان میں اپنی جرات و جسارت پر مجھے حیرت ہوئی۔ اللہ اور اس کے رسول زیادہ بہتر جانتے ہیں ۱؎، قسم اللہ کی! بس تھوڑی ہی دیر ہوئی تھی کہ یہ دونوں آیتیں نازل ہوئیں۔ «ولا تصل على أحد منهم مات أبدا ولا تقم على قبره» ”ان میں سے کسی ( منافق ) کی جو مر جائے نماز جنازہ کبھی بھی نہ پڑھو، اور نہ اس کی قبر پر کھڑے ہو“ ( التوبہ: ۸۴ ) ، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے اپنے مرنے تک کبھی بھی کسی منافق کی نماز جنازہ نہیں پڑھی، اور نہ ہی اس کی قبر پر کھڑے ہو کر دعا فرمائی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 149
			}
		}
	]
}