{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3103,
			"arabicnumber": 3103,
			"text": "زید بن ثابت رضی الله عنہ کہتے ہیں کہ جنگ یمامہ کے موقع پر ابوبکر صدیق رضی الله عنہ نے انہیں بلا بھیجا، اتفاق کی بات کہ عمر بن خطاب رضی الله عنہ بھی وہاں موجود تھے، ابوبکر رضی الله عنہ نے کہا: عمر بن خطاب میرے پاس آئے ہیں کہتے ہیں کہ جنگ یمامہ میں قرآن کے بہت سے قراء ( حافظوں ) کی ہلاکت ہوئی ہے، اور میں ڈرتا ہوں کہ اگر ان تمام جگہوں میں جہاں جنگیں چل رہی ہیں قراء قرآن کا قتل بڑھتا رہا تو بہت سارا قرآن ضائع ہو سکتا ہے، اس لیے میں مناسب سمجھتا ہوں کہ آپ مکمل قرآن اکٹھا کرنے کا حکم فرمائیں۔ ابوبکر رضی الله عنہ نے عمر رضی الله عنہ سے کہا: میں کوئی ایسی چیز کیسے کروں جسے رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا ہے۔ عمر رضی الله عنہ نے کہا: اللہ کی قسم! یہ بہتر کام ہے۔ وہ مجھ سے یہ بات باربار کہتے رہے یہاں تک کہ اللہ نے مجھے بھی اس کام کے لیے شرح صدر عطا کر دیا جس کام کے لیے اللہ نے عمر کو شرح صدر عطا فرمایا تھا۔ اور میں نے بھی اس سلسلہ میں وہی بات مناسب سمجھی جو انہوں نے سمجھی۔ زید کہتے ہیں: ابوبکر رضی الله عنہ نے ( مجھ سے ) کہا: تم جوان ہو، عقلمند ہو، ہم تمہیں ( کسی معاملے میں بھی ) متہم نہیں کرتے۔ اور تم رسول اللہ صلی اللہ علیہ وسلم پر نازل ہونے والی وحی لکھتے بھی تھے، تو ایسا کرو کہ پورا قرآن تلاش کر کے لکھ ڈالو، ( یکجا کر دو ) زید کہتے ہیں: قسم اللہ کی! اگر مجھ سے پہاڑوں میں سے کسی پہاڑ کو ایک جگہ سے دوسری جگہ منتقل کرنے کے لیے کہتے تو یہ کام مجھے اس کام سے زیادہ بھاری نہ لگتا، میں نے کہا: آپ لوگ کوئی ایسا کام جسے رسول اللہ صلی اللہ علیہ وسلم نے نہیں کیا ہے کیسے ( کرنے کی جرات ) کرتے ہیں؟ ابوبکر رضی الله عنہ نے کہا: اللہ کی قسم! تمہارے لیے بہتر ہے۔ اور ابوبکر و عمر رضی الله عنہما دونوں مجھ سے باربار یہی دہراتے رہے یہاں تک کہ اللہ نے میرے سینے کو بھی اس حق کے لیے کھول دیا جس کے لیے ابوبکر و عمر رضی الله عنہما کے سینے کو اس نے کھولا تھا، تو میں نے پورے قرآن کی تلاش و جستجو شروع کر دی، میں پرزوں، کھجور کے پتوں، نرم پتھروں اور لوگوں کے سینوں سے لے کر نقل کر کر کے یکجا کرنے لگا، تو سورۃ برأۃ کی آخری آیات «لقد جاءكم رسول من أنفسكم عزيز عليه ما عنتم حريص عليكم بالمؤمنين رءوف رحيم فإن تولوا فقل حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم» ”تمہارے پاس تم ہی میں سے ایک رسول آیا ہے، اس پر تمہاری تکلیف شاق گزرتی ہے، وہ تمہاری بھلائی کا حریص ہے اور ایمان داروں کے حال پر نہایت درجہ شفیق اور مہربان ہے۔ پھر بھی اگر وہ منہ پھیر لیں تو اللہ مجھ کو کافی ہے اور اس کے سوا کوئی معبود نہیں۔ اسی پر میں نے بھروسہ کیا ہے اور وہی عرش عظیم کا مالک ہے“ ( التوبہ: ۱۲۸ ) ۔ مجھے خزیمہ بن ثابت رضی الله عنہ کے پاس ملیں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 155
			}
		}
	]
}