{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 312,
			"arabicnumber": 312,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی الله علیہ وسلم نے اس نماز سے فارغ ہونے کے بعد جس میں آپ نے بلند آواز سے قرأت کی تھی تو فرمایا: ”کیا تم میں سے ابھی کسی نے میرے ساتھ قرأت کی ہے؟“ ایک شخص نے عرض کیا: جی ہاں اللہ کے رسول! ( میں نے کی ہے ) آپ نے فرمایا: ”تبھی تو میں یہ کہہ رہا تھا: آخر کیا بات ہے کہ قرآن کی قرأت میں میری آواز سے آواز ٹکرائی جا رہی ہے اور مجھ پر غالب ہونے کی کوشش کی جاری ہے“، وہ ( زہری ) کہتے ہیں: تو جب لوگوں نے رسول اللہ صلی الله علیہ وسلم سے یہ بات سنی تو لوگ رسول اللہ صلی الله علیہ وسلم کے ان نمازوں میں قرأت کرنے سے رک گئے جن میں آپ بلند آواز سے قرأت کرتے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- ابن اکیمہ لیثی کا نام عمارہ ہے انہیں عمرو بن اکیمہ بھی کہا جاتا ہے، زہری کے دیگر تلامذہ نے بھی یہ حدیث روایت کی ہے لیکن ان لوگوں نے اسے ان الفاظ کے ساتھ ذکر کیا ہے «قال الزهري فانتهى الناس عن القراءة حين سمعوا ذلك من رسول الله صلى الله عليه وسلم» ”زہری نے کہا کہ لوگ قرأت سے رک گئے جس وقت ان لوگوں نے اسے رسول اللہ صلی الله علیہ وسلم سے سنا“ ۳- اس باب میں ابن مسعود، عمران بن حصین اور جابر بن عبداللہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- اس حدیث میں ایسی کوئی چیز نہیں ہے جو ان لوگوں کے لیے رکاوٹ کا سبب بنے جن کی رائے امام کے پیچھے بھی قرأت کی ہے، اس لیے کہ ابوہریرہ رضی الله عنہ ہی ہیں جنہوں نے یہ حدیث روایت کی ہے اور انہوں نے ہی نبی اکرم صلی الله علیہ وسلم سے یہ حدیث بھی روایت کی ہے کہ آپ نے فرمایا ”جس نے کوئی نماز پڑھی اور اس میں سورۃ فاتحہ نہیں پڑھی تو وہ ناقص ہے، ناقص ہے، ناتمام ہے“ تو ان سے ایک شخص نے جس نے ان سے یہ حدیث اخذ کی تھی پوچھا کہ میں کبھی امام کے پیچھے ہوتا ہوں ( تو کیا کروں؟ ) تو انہوں نے کہا: تم اسے اپنے دل میں پڑھ لیا کر۔ ابوعثمان نہدی سے روایت ہے کہ ابوہریرہ رضی الله عنہ کا بیان ہے کہ مجھے نبی اکرم صلی الله علیہ وسلم نے یہ حکم دیا کہ میں اعلان کر دوں کہ سورۃ فاتحہ کے بغیر نماز نہیں ہوتی، ۵- اکثر محدثین نے اس بات کو پسند کیا ہے کہ جب امام بلند آواز سے قرأت کرے تو مقتدی قرأت نہ کرے، اور کہا ہے کہ وہ امام کے سکتوں کا «تتبع» کرتا رہے، ”یعنی وہ امام کے سکتوں کے درمیان پڑھ لیا کرے“، ۶- امام کے پیچھے قرأت کے سلسلہ میں اہل علم کا اختلاف ہے، صحابہ و تابعین اور ان کے بعد کے لوگوں میں سے اکثر اہل علم امام کے پیچھے قرأت کے قائل ہیں، مالک بن انس، عبداللہ بن مبارک شافعی، احمد اور اسحاق بن راہویہ بھی یہی کہتے ہیں، عبداللہ بن مبارک کہتے ہیں کہ امام کے پیچھے قرأت کرتا ہوں اور لوگ بھی کرتے ہیں سوائے کوفیوں میں سے چند لوگوں کے، اور میرا خیال ہے کہ جو نہ پڑھے اس کی بھی نماز درست ہے، ۷- اور اہل علم میں سے کچھ لوگوں نے اس سلسلہ میں سختی برتی ہے، ان لوگوں کا کہنا ہے کہ سورۃ فاتحہ کا چھوڑنا جائز نہیں اگرچہ وہ امام کے پیچھے ہو، یہ لوگ کہتے ہیں کہ بغیر سورۃ فاتحہ کے نماز کفایت نہیں کرتی، یہ لوگ اس حدیث کی طرف گئے ہیں جسے عبادہ بن صامت نے نبی اکرم صلی الله علیہ وسلم سے روایت کی ہے۔ اور خود عبادہ بن صامت رضی الله عنہ نے بھی نبی اکرم صلی الله علیہ وسلم کے بعد امام کے پیچھے قرأت کی ہے، ان کا عمل نبی اکرم صلی الله علیہ وسلم کے اسی قول پر رہا ہے کہ سورۃ فاتحہ کے بغیر نماز نہیں، یہی شافعی اور اسحاق بن راہویہ وغیرہ کا بھی قول ہے، ۸- رہے احمد بن حنبل تو وہ کہتے ہیں کہ نبی اکرم صلی الله علیہ وسلم کے فرمان ”سورۃ فاتحہ کے بغیر نماز نہیں ہوتی“ کا مطلب یہ ہے کہ جب وہ اکیلے نماز پڑھ رہا ہو تب سورۃ فاتحہ کے بغیر نماز نہیں ہو گی۔ انہوں نے جابر بن عبداللہ رضی الله عنہما کی حدیث سے یہ استدلال کیا ہے جس میں ہے کہ ”جس نے کوئی رکعت پڑھی اور اس میں سورۃ فاتحہ نہیں پڑھی تو اس کی نماز نہیں ہوئی سوائے اس کے کہ وہ امام کے پیچھے ہو ۱؎“۔ احمد بن حنبل کہتے ہیں کہ یہ نبی اکرم صلی الله علیہ وسلم کے صحابہ میں ایک شخص ہیں اور انہوں نے نبی اکرم صلی الله علیہ وسلم کے فرمان ”سورۃ فاتحہ کے بغیر نماز نہیں ہوتی“ کی تفسیر یہ کی ہے کہ یہ حکم اس شخص کے لیے ہے جو اکیلے پڑھ رہا ہو۔ ان سب کے باوجود احمد بن حنبل نے امام کے پیچھے سورۃ فاتحہ پڑھنے ہی کو پسند کیا ہے اور کہا ہے کہ آدمی سورۃ فاتحہ کو نہ چھوڑے اگرچہ امام کے پیچھے ہو۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 164
			}
		}
	]
}