{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3169,
			"arabicnumber": 3169,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر میں تھے، اور چلنے میں ایک دوسرے سے آگے پیچھے ہو گئے تھے، آپ نے بآواز بلند یہ دونوں آیتیں: «يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم» سے لے کر «عذاب الله شديد» تک تلاوت فرمائی، جب صحابہ نے یہ سنا تو اپنی سواریوں کو ابھار کر ان کی رفتار بڑھا دی، اور یہ جان لیا کہ کوئی بات ہے جسے آپ فرمانے والے ہیں، آپ نے فرمایا: ”کیا تم جانتے ہو یہ کون سا دن ہے؟“، صحابہ نے کہا: اللہ اور اس کے رسول زیادہ بہتر جانتے ہیں، آپ نے فرمایا: ”یہ وہ دن ہے جس دن اللہ تعالیٰ آدم علیہ السلام کو پکاریں گے اور وہ اپنے رب کو جواب دیں گے، اللہ تعالیٰ ان سے فرمائے گا: «ابعث بعث النار» ”بھیجو جہنم میں جانے والی جماعت کو“، آدم علیہ السلام کہیں گے: اے ہمارے رب! «بعث النار» ”کیا ہے ( یعنی کتنے ) ؟“ اللہ کہے گا: ایک ہزار افراد میں سے نو سو ننانوے جہنم میں جائیں گے اور ایک جنت میں جائے گا، یہ سن کر لوگ مایوس ہو گئے، ایسا لگا کہ اب یہ زندگی بھر کبھی ہنسیں گے نہیں، پھر جب رسول اللہ صلی اللہ علیہ وسلم نے صحابہ کی یہ ( مایوسانہ ) کیفیت و گھبراہٹ دیکھی تو فرمایا: ”اچھے بھلے کام کرو اور خوش ہو جاؤ ( اچھے اعمال کے صلے میں جنت پاؤ گے ) قسم ہے اس ذات کی جس کے ہاتھ میں محمد کی جان ہے! تم ایسی دو مخلوق کے ساتھ ہو کہ وہ جس کے بھی ساتھ ہو جائیں اس کی تعداد بڑھا دیں، ایک یاجوج و ماجوج اور دوسرے وہ جو اولاد آدم اور اولاد ابلیس میں سے ( حالت کفر میں ) مر چکے ہیں، آپ کی اس بات سے لوگوں کے رنج و فکر کی اس کیفیت میں کچھ کمی آئی جسے لوگ شدت سے محسوس کر رہے تھے اور اپنے دلوں میں موجود پا رہے تھے۔“ آپ نے فرمایا: ”نیکی کا عمل جاری رکھو، اور ایک دوسرے کو خوشخبری دو، قسم ہے اس ذات کی جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جان ہے! تم تو لوگوں میں بس ایسے ہو جیسے اونٹ ( جیسے بڑے جانور ) کے پہلو ( پسلی ) میں کوئی داغ یا نشان ہو، یا چوپائے کی اگلی دست میں کوئی تل ہو“ ۱؎۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 221
			}
		}
	]
}