{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3177,
			"arabicnumber": 3177,
			"text": "عبداللہ بن عمرو بن عاص رضی الله عنہما کہتے ہیں کہ مرثد بن مرثد نامی صحابی وہ ایسے ( جی دار و بہادر ) شخص تھے جو ( مسلمان ) قیدیوں کو مکہ سے نکال کر مدینہ لے آیا کرتے تھے، اور مکہ میں عناق نامی ایک زانیہ، بدکار عورت تھی، وہ عورت اس صحابی کی ( ان کے اسلام لانے سے پہلے کی ) دوست تھی، انہوں نے مکہ کے قیدیوں میں سے ایک قیدی شخص سے وعدہ کر رکھا تھا کہ وہ اسے قید سے نکال کر لے جائیں گے، کہتے ہیں کہ میں ( اسے قید سے نکال کر مدینہ لے جانے کے لیے ) آ گیا، میں ایک چاندنی رات میں مکہ کی دیواروں میں سے ایک دیوار کے سایہ میں جا کر کھڑا ہوا ہی تھا کہ عناق آ گئی۔ دیوار کے اوٹ میں میری سیاہ پرچھائیں اس نے دیکھ لی، جب میرے قریب پہنچی تو مجھے پہچان کر پوچھا: مرثد ہونا؟ میں نے کہا: ہاں، مرثد ہوں، اس نے خوش آمدید کہا، ( اور کہا: ) آؤ، رات ہمارے پاس گزارو، میں نے کہا: عناق! اللہ نے زنا کو حرام قرار دیا ہے، اس نے شور مچا دیا، اے خیمہ والو ( دوڑو ) یہ شخص تمہارے قیدیوں کو اٹھائے لیے جا رہا ہے، پھر میرے پیچھے آٹھ آدمی دوڑ پڑے، میں خندمہ ( نامی پہاڑ ) کی طرف بھاگا اور ایک غار یا کھوہ کے پاس پہنچ کر اس میں گھس کر چھپ گیا، وہ لوگ بھی اوپر چڑھ آئے اور میرے سر کے قریب ہی کھڑے ہو کر۔ انہوں نے پیشاب کیا تو ان کے پیشاب کی بوندیں ہمارے سر پر ٹپکیں، لیکن اللہ نے انہیں اندھا بنا دیا، وہ ہمیں نہ دیکھ سکے، وہ لوٹے تو میں بھی لوٹ کر اپنے ساتھی کے پاس ( جسے اٹھا کر مجھے لے جانا تھا ) آ گیا، وہ بھاری بھر کم آدمی تھے، میں نے انہیں اٹھا کر ( پیٹھ پر ) لاد لیا، اذخر ( کی جھاڑیوں میں ) پہنچ کر میں نے ان کی بیڑیاں توڑ ڈالیں اور پھر اٹھا کر چل پڑا، کبھی کبھی اس نے بھی میری مدد کی ( وہ بھی بیڑیاں لے کر چلتا ) اس طرح میں مدینہ آ گیا۔ رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچ کر میں نے عرض کیا: اللہ کے رسول! میں عناق سے شادی کر لوں؟ ( یہ سن کر ) رسول اللہ صلی اللہ علیہ وسلم خاموش رہے مجھے کوئی جواب نہیں دیا، پھر یہ آیت «الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين» ”زانی زانیہ یا مشرکہ ہی سے نکاح کرے اور زانیہ سے زانی یا مشرک ہی نکاح کرے، مسلمانوں پر یہ نکاح حرام ہے“ ( النور: ۳ ) ، نازل ہوئی آپ نے ( اس آیت کے نزول کے بعد مرثد بن ابی مرثد سے ) فرمایا: ”اس سے نکاح نہ کرو“۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے، اور ہم اسے صرف اسی سند سے جانتے ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 229
			}
		}
	]
}