{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ جب میرے بارے میں افواہیں پھیلائی جانے لگیں جو پھیلائی گئیں، میں ان سے بےخبر تھی، رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور میرے تعلق سے ایک خطبہ دیا، آپ نے شہادتین پڑھیں، اللہ کے شایان شان تعریف و ثنا کی، اور حمد و صلاۃ کے بعد فرمایا: ”لوگو! ہمیں ان لوگوں کے بارے میں مشورہ دو جنہوں نے میری گھر والی پر تہمت لگائی ہے، قسم اللہ کی! میں نے اپنی بیوی میں کبھی کوئی برائی نہیں دیکھی، انہوں نے میری بیوی کو اس شخص کے ساتھ متہم کیا ہے جس کے بارے میں اللہ کی قسم! میں نے کبھی کوئی برائی نہیں جانی، وہ میرے گھر میں کبھی بھی میری غیر موجودگی میں داخل نہیں ہوا، وہ جب بھی میرے گھر میں آیا ہے میں موجود رہا ہوں، اور جب بھی میں گھر سے غائب ہوا، سفر میں رہا وہ بھی میرے ساتھ گھر سے دور سفر میں رہا ہے“، ( یہ سن کر ) سعد بن معاذ رضی الله عنہ نے کھڑے ہو کر، عرض کیا: اللہ کے رسول! مجھے اجازت دیجئیے میں ان کی گردنیں اڑا دوں، ( یہ سن کر ) خزرج قبیلے کا ایک اور شخص جس کے قبیلے سے حسان بن ثابت کی ماں تھیں کھڑا ہوا اس نے ( سعد بن معاذ سے مخاطب ہو کر ) کہا: آپ جھوٹ اور غلط بات کہہ رہے ہیں، سنئیے، اللہ کی قسم! اگر یہ ( تہمت لگانے والے آپ کے قبیلے ) اوس کے ہوتے تو یہ پسند نہ کرتے کہ آپ ان کی گردنیں اڑا دیں، یہ بحث و تکرار اتنی بڑھی کہ اوس و خزرج کے درمیان مسجد ہی میں فساد عظیم برپا ہو جانے کا خطرہ پیدا ہو گیا، ( عائشہ رضی الله عنہا کہتی ہیں ) مجھے اس کی بھی خبر نہ ہوئی، جب اس دن کی شام ہوئی تو میں اپنی ( قضائے حاجت کی ) ضرورت سے گھر سے باہر نکلی، میرے ساتھ مسطح کی ماں بھی تھیں، وہ ( راستہ میں ) ٹھوکر کھائی تو کہہ اٹھیں: مسطح تباہ برباد ہو! میں نے ان سے کہا: آپ کیسی ماں ہیں بیٹے کو گالی دیتی ہیں؟ تو وہ چپ رہیں، پھر دوبارہ ٹھوکر کھائی تو پھر وہی لفظ دہرایا، مسطح ہلاک ہو، میں نے پھر ( ٹوکا ) میں نے کہا: آپ کیسی ماں ہیں؟ اپنے بیٹے کو گالی ( بد دعا ) دیتی ہیں؟ وہ پھر خاموش رہیں، پھر جب تیسری بار ٹھوکر کھائی تو پھر یہی لفظ دہرایا تو میں نے ڈانٹا ( اور جھڑک دیا ) کیسی ( خراب ) ماں ہیں آپ؟ اپنے ہی بیٹے کو برا بھلا کہہ رہی ہیں، وہ بولیں: ( بیٹی ) قسم اللہ کی میں اسے صرف تیرے معاملے میں برا بھلا کہہ رہی ہوں، میں نے پوچھا: میرے کس معاملے میں؟ تب انہوں نے مجھے ساری باتیں کھول کھول کر بتائیں، میں نے ان سے پوچھا: کیا ایسا ہوا؟ ( یہ ساری باتیں پھیل گئیں؟ ) انہوں نے کہا: ہاں، قسم اللہ کی! یہ سن کر میں گھر لوٹ آئی، تو ان میں جس کام کے لیے نکلی تھی، نکلی ہی نہیں، مجھے اس قضائے حاجت کی تھوڑی یا زیادہ کچھ بھی ضرورت محسوس نہ ہوئی، ( بلکہ ) مجھے تیز بخار چڑھ آیا، میں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا: مجھے میرے ابا کے گھر بھیج دیجئیے، رسول اللہ صلی اللہ علیہ وسلم نے میرے ساتھ ایک لڑکا کر دیا، ( اور میں اپنے ابا کے گھر آ گئی ) میں گھر میں داخل ہوئی تو ( اپنی ماں ) ام رومان کو نیچے پایا اور ( اپنے ابا ) ابوبکر کو گھر کے اوپر پڑھتے ہوئے پایا، میری ماں نے کہا: بیٹی! کیسے آئیں؟ عائشہ رضی اللہ عنہا کہتی ہیں: میں نے انہیں بتا دیا اور انہیں ساری باتیں ( اور سارا قصہ ) سنا دیا، مگر انہیں یہ باتیں سن کر وہ اذیت نہ پہنچی جو مجھے پہنچی، انہوں نے کہا: بیٹی! اپنے آپ کو سنبھالو، کیونکہ اللہ کی قسم! بہت کم ایسا ہوتا ہے کہ کسی مرد کی کوئی حسین و جمیل عورت ہو جس سے وہ مرد ( بے انتہا ) محبت کرتا ہو، اس سے اس کی سوکنیں حسد نہ کرتی ( اور جلن نہ رکھتی ) ہوں اور اس کے بارے میں لگائی بجھائی نہ کرتی ہوں، غرضیکہ انہیں اتنا صدمہ نہ پہنچا جتنا مجھے پہنچا، میں نے پوچھا: کیا میرے ابو جان کو بھی یہ بات معلوم ہو چکی ہے؟ انہوں نے کہا: ہاں، میں نے ( پھر ) پوچھا کیا رسول اللہ صلی اللہ علیہ وسلم بھی ان باتوں سے واقف ہو چکے ہیں؟ انہوں نے کہا: ہاں، ( یہ سن کر ) میں غم سے نڈھال ہو گئی اور رو پڑی، ابوبکر رضی الله عنہ چھت پر قرآن پڑھ رہے تھے، میرے رونے کی آواز سن کر نیچے اتر آئے، میری ماں سے پوچھا، اسے کیا ہوا؟ ( یہ کیوں رو رہی ہے؟ ) انہوں نے کہا: اس کے متعلق جو باتیں کہی گئیں ( اور افواہیں پھیلائی گئی ہیں ) وہ اسے بھی معلوم ہو گئی ہیں، ( یہ سن کر ) ان کی بھی آنکھیں بہہ پڑیں، ( مگر ) انہوں نے کہا: اے میری ( لاڈلی ) بیٹی! میں تمہیں قسم دلا کر کہتا ہوں تو اپنے گھر لوٹ جا، میں اپنے گھر واپس ہو گئی، رسول اللہ صلی اللہ علیہ وسلم میرے گھر تشریف لائے اور میری لونڈی ( بریرہ ) سے میرے متعلق پوچھ تاچھ کی، اس نے کہا: نہیں، قسم اللہ کی! میں ان میں کوئی عیب نہیں جانتی، ہاں، بس یہ بات ہے کہ ( کام کرتے کرتے تھک کر ) سو جاتی ہیں اور بکری آ کر گندھا ہوا آٹا کھا جاتی ہے، بعض صحابہ نے اسے ڈانٹا، ( باتیں نہ بنا ) رسول اللہ صلی اللہ علیہ وسلم کو سچ سچ بتا ( اس سے اس پوچھ تاچھ میں ) وہ ( اپنے مقام و مرتبہ سے ) نیچے اتر آئے، اس نے کہا: سبحان اللہ! پاک و برتر ہے اللہ کی ذات، قسم اللہ کی! میں انہیں بس ایسی ہی جانتی ہوں جیسے سنار سرخ سونے کے ڈلے کو جانتا پہچانتا ہے، پھر اس معاملے کی خبر اس شخص کو بھی ہو گئی جس پر تہمت لگائی گئی تھی۔ اس نے کہا: سبحان اللہ! قسم اللہ کی، میں نے اپنی پوری زندگی میں کبھی کسی کا سینہ اور پہلو نہیں کھولا ہے ۱؎، عائشہ رضی اللہ عنہا کہتی ہیں: وہ اللہ کی راہ میں شہید ہو کر مرے، میرے ماں باپ صبح ہی میرے پاس آ گئے اور ہمارے ہی پاس رہے۔ عصر پڑھ کر رسول اللہ صلی اللہ علیہ وسلم ہمارے یہاں تشریف لے آئے، اور ہمارے پاس پہنچے، میرے ماں باپ ہمارے دائیں اور بائیں بیٹھے ہوئے تھے، رسول اللہ صلی اللہ علیہ وسلم نے شہادتین پڑھی، اللہ کی شایان شان حمد و ثنا بیان کی، پھر فرمایا: ”حمد و صلاۃ کے بعد: ”عائشہ! اگر تو برائی کی مرتکب ہو گئی یا اپنے نفس پر ظلم کر بیٹھی ہے تو اللہ سے توبہ کر، اللہ اپنے بندوں کی توبہ قبول کرتا ہے“، اسی دوران انصار کی ایک عورت آ کر دروازے میں بیٹھ گئی تھی، میں نے عرض کیا: اس عورت کے سامنے ( اس طرح کی ) کوئی بات کرتے ہوئے کیا آپ کو شرم محسوس نہیں ہوئی؟ بہرحال رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نصیحت فرمائی، میں اپنے باپ کی طرف متوجہ ہوئی، ان سے کہا: آپ رسول اللہ صلی اللہ علیہ وسلم کی بات کا جواب دیں، انہوں نے کہا: میں کیا جواب دوں؟ میں اپنی ماں کی طرف پلٹی، میں نے ان سے کہا: رسول اللہ صلی اللہ علیہ وسلم نے جو بات کہی ہے اس بارے میں ( میری طرف سے ) صفائی دیجئیے، انہوں نے کہا: کیا کہوں میں؟ جب میرے ماں باپ نے کچھ جواب نہ دیا، تو میں نے کلمہ شہادت ادا کیا، اللہ کے شایان شان اس کی حمد و ثنا بیان کی، پھر میں نے کہا: سنئیے، قسم اللہ کی! اگر میں آپ لوگوں سے کہتی ہوں کہ میں نے ایسا کچھ نہیں کیا اور اللہ گواہ ہے کہ میں سچی ( بےگناہ ) ہوں تب بھی مجھے آپ کے سامنے اس سے فائدہ حاصل نہیں ہو سکتا کیونکہ آپ ہی یہ بات کہنے والے ہیں اور آپ کے دلوں میں یہ بات بیٹھ گئی ہے اور اگر میں یہ کہہ دوں کہ میں نے ایسا کیا ہے اور اللہ خوب جانتا ہے کہ میں نے نہیں کیا، تو آپ ضرور کہیں گے کہ اس نے تو اعتراف جرم کر لیا ہے، اور میں قسم اللہ کی! اپنے اور آپ کے لیے اس سے زیادہ مناسب حال کوئی مثال نہیں پاتی ( میں نے مثال دینے کے لیے ) یعقوب علیہ السلام کا نام ڈھونڈا اور یاد کیا، مگر میں اس پر قادر نہ ہو سکی، ( مجھے ان کا نام یاد نہ آ سکا تو میں نے ابویوسف کہہ دیا ) مگر یوسف علیہ السلام کے باپ کی مثال جب کہ انہوں نے «فصبر جميل والله المستعان على ما تصفون» کہا ۲؎۔ اسی وقت رسول اللہ صلی اللہ علیہ وسلم پر وحی نازل ہونے لگی تو ہم سب خاموش ہو گئے، پھر آپ پر سے وحی کے آثار ختم ہوئے تو میں نے آپ کے چہرے سے خوشی پھوٹتی ہوئی دیکھی، آپ اپنی پیشانی سے پسینہ پونچھتے ہوئے فرمانے لگے: ”اے عائشہ! خوش ہو جاؤ اللہ نے تمہاری براۃ میں آیت نازل فرما دی ہے“، مجھے اس وقت سخت غصہ آیا جب میرے ماں باپ نے مجھ سے کہا: کھڑی ہو کر آپ کا شکریہ ادا کر، میں نے کہا: نہیں، قسم اللہ کی! میں آپ کا شکریہ ادا کرنے کے لیے کھڑی نہ ہوں گی، نہ میں ان کی تعریف کروں گی اور نہ آپ دونوں کی، نہ میں ان کی احسان مند ہوں گی اور نہ آپ دونوں کا بلکہ میں اس اللہ کا احسان مند اور شکر گزار ہوں گی جس نے میری براۃ میں آیت نازل فرمائی، آپ لوگوں نے تو میری غیبت و تہمت سنی، لیکن اس پر تردید و انکار نہ کیا، اور نہ اسے روک دینے اور بدل دینے کی کوشش کی، عائشہ رضی اللہ عنہا کہا کرتی تھیں: رہی زینب بن حجش تو اللہ نے انہیں ان کی نیکی و دینداری کی وجہ سے بچا لیا، انہوں نے اس قضیہ میں جب بھی کہا، اچھی و بھلی بات ہی کہی، البتہ ان کی بہن حمنہ ( شریک بہتان ہو کر ) ہلاک ہونے والوں کے ساتھ ہلاک ہو گئی، اور جو لوگ اس بہتان بازی اور پروپیگنڈے میں لگے ہوئے تھے وہ مسطح، حسان بن ثابت اور منافق عبداللہ بن ابی بن سلول تھے، اور یہی منافق ( فتنہ پردازوں کا سردار و سرغنہ ) ہی اس معاملہ میں اپنی سیاست چلاتا اور اپنے ہم خیال لوگوں کو یکجا رکھتا تھا، یہی وہ شخص تھا اور اس کے ساتھ حمنہ بھی تھی، جو اس فتنہ انگیزی میں پیش پیش تھی، ابوبکر رضی الله عنہ نے قسم کھا لی کہ اب وہ ( اس احسان فراموش و بدگو ) مسطح کو کبھی کوئی فائدہ نہ پہنچائیں گے، اس پر آیت «ولا يأتل أولوا الفضل منكم والسعة» ۳؎ نازل ہوئی، اس سے یہاں مراد ابوبکر ہیں، «أن يؤتوا أولي القربى والمساكين والمهاجرين في سبيل الله» ۴؎ اس سے اشارہ مسطح کی طرف ہے۔ «ألا تحبون أن يغفر الله لكم والله غفور رحيم» ۵؎ ( یہ آیت سن کر ) ابوبکر رضی الله عنہ نے کہا: کیوں نہیں، قسم اللہ کی! ہمارے رب! ہم پسند کرتے ہیں کہ تو ہمیں بخش دے، پھر مسطح کو دینے لگے جو پہلے دیتے تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث ہشام بن عروہ کی روایت سے حسن صحیح غریب ہے، ۲- اس حدیث کو یونس بن یزید، معمر اور کئی دوسرے لوگوں نے عروہ بن زبیر، سعید بن مسیب، علقمہ بن وقاص لیثی اور عبیداللہ بن عبداللہ سے اور ان سبھوں نے عائشہ سے روایت کی ہے، یہ حدیث ہشام بن عروہ کی حدیث سے لمبی بھی ہے اور مکمل بھی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 232
			}
		}
	]
}