{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3207,
			"arabicnumber": 3207,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ اگر رسول اللہ صلی اللہ علیہ وسلم وحی کی کوئی چیز چھپا لینے والے ہوتے تو یہ آیت «وإذ تقول للذي أنعم الله عليه» ”جب آپ اس شخص سے جس پر اللہ نے اسلام کے ذریعہ انعام کیے تھے اور آپ نے بھی ( اسے آزاد کر کے ) اس پر انعام و احسان کیے تھے کہہ رہے تھے کہ اپنی بیوی کو اپنے پاس رہنے دو ( طلاق نہ دو ) اور اللہ سے ڈرو، اور تم اپنے دل میں وہ بات چھپا رہے تھے جسے اللہ ظاہر کرنا چاہتا تھا تم لوگوں کے ( لعن طعن ) سے ڈرتے تھے اور اللہ اس کا زیادہ سزاوار ہے کہ تم اس سے ڈرو“، سے لے کر «وكان أمر الله مفعولا» تک چھپا لیتے، رسول اللہ صلی اللہ علیہ وسلم نے جب ان سے ( زینب سے ) شادی کر لی تو لوگوں نے کہا: آپ نے اپنے ( لے پالک ) بیٹے کی بیوی سے شادی کر لی، اس پر اللہ تعالیٰ نے آیت «ما كان محمد أبا أحد من رجالكم ولكن رسول الله وخاتم النبيين» ”محمد ( صلی اللہ علیہ وسلم ) تم لوگوں میں سے کسی کے باپ نہیں ہیں بلکہ وہ اللہ کے رسول اور خاتم النبین ( آخری نبی ) ہیں“، نازل فرمائی، زید چھوٹے تھے تبھی رسول اللہ صلی اللہ علیہ وسلم نے انہیں منہ بولا بیٹا بنا لیا تھا، وہ برابر آپ کے پاس رہے یہاں تک کہ جوان ہو گئے، اور ان کو زید بن محمد کہا جانے لگا، اس پر اللہ تعالیٰ نے یہ آیت نازل فرمائی: «ادعوهم لآبائهم هو أقسط عند الله فإن لم تعلموا آباءهم فإخوانكم في الدين ومواليكم» ”انہیں ان کے ( اصلی باپ کی طرف ) منسوب کر کے پکارو ( جن کے نطفے سے وہ پیدا ہوئے ہیں ) یہ اللہ کے نزدیک زیادہ مبنی بر انصاف بات ہے، لیکن اگر تم ان کے باپوں کو نہ جانتے ہو ( کہ وہ کون ہیں ) تو وہ تمہارے دینی بھائی اور دوست ہیں“، فلاں فلاں کا دوست ہے اور فلاں فلاں کا دینی بھائی ہے ۴؎، «هو أقسط عند الله» یہ اللہ کے نزدیک زیادہ انصاف پر مبنی کا مفہوم یہ ہے کہ پورا انصاف ہے۔ امام ترمذی کہتے ہیں: یہ حدیث غریب ہے۔ اس سند سے مسروق نے عائشہ سے روایت کی ہے، وہ کہتی ہیں: اگر نبی اکرم صلی اللہ علیہ وسلم وحی میں سے کچھ چھپانے والے ہوتے تو آپ یہ آیت «وإذ تقول للذي أنعم الله عليه وأنعمت عليه» چھپاتے، ( اس روایت میں ) یہ حدیث کی پوری روایت نہیں کی گئی ہے ۵؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 259
			}
		}
	]
}