{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3222,
			"arabicnumber": 3222,
			"text": "فروہ بن مسیک مرادی رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور عرض کیا: اللہ کے رسول! کیا میں اپنی قوم کے ان لوگوں کے ساتھ مل کر جو ایمان لے آئے ہیں ان لوگوں سے نہ لڑوں جو ایمان نہیں لائے ہیں، تو آپ نے مجھے ان سے لڑنے کی اجازت دے دی، اور مجھے میری قوم کا امیر بنا دیا، جب میں آپ کے پاس سے اٹھ کر چلا گیا تو آپ نے میرے متعلق پوچھا کہ غطیفی نے کیا کیا؟ آپ کو بتایا گیا کہ میں تو جا چکا ہوں، مجھے لوٹا لانے کے لیے میرے پیچھے آپ نے آدمی دوڑائے، تو میں آپ کے پاس آ گیا، آپ اس وقت اپنے کچھ صحابہ کے درمیان تشریف فرما تھے، آپ نے فرمایا: ”لوگوں کو تم دعوت دو، تو ان میں سے جو اسلام لے آئے اس کے اسلام و ایمان کو قبول کر لو، اور جو اسلام نہ لائے تو اس کے معاملے میں جلدی نہ کرو، یہاں تک کہ میں تمہیں نیا ( و تازہ ) حکم نہ بھیجوں“۔ راوی کہتے ہیں: سبا کے متعلق ( کلام پاک میں ) جو نازل ہوا سو ہوا ( اسی مجلس کے ) ایک شخص نے پوچھا: اللہ کے رسول! سبا کیا ہے، سبا کوئی سر زمین ہے، یا کسی عورت کا نام ہے؟ آپ نے فرمایا: ”وہ نہ کوئی ملک ہے اور نہ ہی وہ کسی عورت کا نام بلکہ سبا نام کا ایک عربی شخص تھا جس کے دس بچے تھے، جن میں سے چھ کو اس نے باعث خیر و برکت جانا اور چار سے بدشگونی لی ( انہیں منحوس جانا ) تو جنہیں اس نے منحوس سمجھا وہ: لخم، جذام، غسان اور عاملہ ہیں، اور جنہیں مبارک سمجھا وہ ازد، اشعری، حمیر، مذحج، انمار اور کندہ ہیں“، ایک شخص نے کہا: اللہ کے رسول! انمار کون سا قبیلہ ہے؟ آپ نے فرمایا: ”اسی قبیلہ کی شاخیں خشعم اور بجیلہ ہیں“۔ یہ حدیث ابن عباس سے مروی ہے، وہ اسے نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں۔ امام ترمذی کہتے ہیں: یہ حدیث حسن غریب ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 274
			}
		}
	]
}