{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3232,
			"arabicnumber": 3232,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ ابوطالب بیمار پڑے، تو قریش ان کے پاس آئے، اور نبی اکرم صلی اللہ علیہ وسلم بھی آئے، ابوطالب کے پاس صرف ایک آدمی کے بیٹھنے کی جگہ تھی، ابوجہل اٹھا کہ وہ آپ کو وہاں بیٹھنے سے روک دے، اور ان سب نے ابوطالب سے آپ کی شکایت کی، ابوطالب نے آپ سے کہا: بھتیجے! تم اپنی قوم سے کیا چاہتے ہو؟ آپ نے فرمایا: ”میں ان سے صرف ایک ایسا کلمہ تسلیم کرانا چاہتا ہوں جسے یہ قبول کر لیں تو اس کلمہ کے ذریعہ پورا عرب مطیع و فرماں بردار ہو جائے گا اور عجم کے لوگ انہیں جزیہ ادا کریں گے، انہوں نے کہا: ایک ہی کلمہ؟ آپ نے فرمایا: ”ہاں، ایک ہی کلمہ“، آپ نے فرمایا: ”چچا جان! آپ لوگ «لا إلہ الا اللہ» کہہ دیجئیے، انہوں نے کہا: ایک معبود کو تسلیم کر لیں؟ یہ بات تو ہم نے اگلے لوگوں میں نہیں سنی ہے، یہ تو صرف بناوٹی اور ( تمہاری ) گھڑی ہوئی بات ہے، ( ہم یہ بات تسلیم نہیں کر سکتے ) ابن عباس کہتے ہیں: اسی پر ان ہی لوگوں سے متعلق سورۃ ”ص“ کی آیات «ص والقرآن ذي الذكر بل الذين كفروا في عزة وشقاق ) إلى قوله ( ما سمعنا بهذا في الملة الآخرة إن هذا إلا اختلاق» ”صٓ، اس نصیحت والے قرآن کی قسم، بلکہ کفار غرور و مخالفت میں پڑے ہوئے ہیں، ہم نے ان سے پہلے بھی بہت سی امتوں کو تباہ کر ڈالا، انہوں نے ہر چند چیخ و پکار کی لیکن وہ چھٹکارے کا نہ تھا اور کافروں کو اس بات پر تعجب ہوا کہ انہیں میں سے ایک انہیں ڈرانے والا آ گیا اور کہنے لگے کہ یہ تو جادوگر اور جھوٹا ہے، کیا اس نے سارے معبودوں کا ایک ہی معبود کر دیا، واقعی یہ تو بہت ہی عجیب بات ہے، ان کے سردار یہ کہتے ہوئے چلے کہ چلو جی اور اپنے معبودوں پر جمے رہو یقیناً اس بات میں تو کوئی غرض ہے، ہم نے تو یہ بات پچھلے دین میں بھی نہیں سنی، کچھ نہیں یہ تو صرف گھڑنت ہے“ ( ص: ۱-۷ ) ، تک نازل ہوئیں۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- یحییٰ بن سعید نے بھی سفیان سے، سفیان نے اعمش سے اسی حدیث کے مثل حدیث بیان کی، اور یحییٰ بن سعید نے یحییٰ بن عباد کے بجائے ”یحییٰ بن عمارہ“ کہا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 284
			}
		}
	]
}