{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3256,
			"arabicnumber": 3256,
			"text": "عبداللہ بن سلام رضی الله عنہ کے بھتیجے کہتے ہیں کہ جب عثمان غنی رضی الله عنہ کو جان سے مار ڈالنے کا ارادہ کر لیا گیا تو عبداللہ بن سلام رضی الله عنہ ان کے پاس آئے، عثمان رضی الله عنہ نے ان سے کہا: تم کس مقصد سے یہاں آئے ہو؟ انہوں نے کہا: میں آپ کی مدد میں ( آپ کو بچانے کے لیے ) آیا ہوں، انہوں نے کہا: تم لوگوں کے پاس جاؤ اور انہیں مجھ سے دور ہٹا دو، تمہارا میرے پاس رہنے سے باہر رہنا زیادہ بہتر ہے، چنانچہ عبداللہ بن سلام لوگوں کے پاس آئے اور انہیں مخاطب کر کے کہا: لوگو! میرا نام جاہلیت میں فلاں تھا ( یعنی حصین ) پھر رسول اللہ صلی اللہ علیہ وسلم نے میرا نام عبداللہ رکھا، میرے بارے میں کتاب اللہ کی کئی آیات نازل ہوئیں، میرے بارے میں آیت: «وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين» ”بنی اسرائیل میں سے گواہی دینے والے نے اس کے مثل گواہی دی ( یعنی اس بات پر گواہی دی کہ قرآن اللہ کے پاس سے آیا ہوا ہے ) اور ایمان لایا اور تم نے تکبر کیا، اور اللہ ظالموں کو ہدایت نہیں دیتا“ ( الاحقاف: ۱۰ ) ، اور میرے ہی حق میں «قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب» ”اے نبی کہہ دو! اللہ میرے اور تمہارے درمیان گواہ ہے اور وہ بھی گواہ ہے جس کے پاس کتاب کا علم ہے ( اس سے مراد عبداللہ بن سلام ہیں کہ حق کیا ہے اور کس کے پاس ہے ) “ ( الرعد: ۴۳ ) ، آیت اتری ہے، بیشک اللہ کے پاس ایسی تلوار ہے جو تمہیں نظر نہیں آتی، بیشک تمہارے اس شہر میں جس میں تمہارے نبی بھیجے گئے، فرشتے تمہارے پڑوسی ہیں، تو ڈرو اللہ سے، ڈرو اللہ سے اس شخص ( عثمان ) کے قتل کر دینے سے، قسم ہے اللہ کی اگر تم لوگوں نے انہیں قتل کر ڈالا تو تم اپنے پڑوسی فرشتوں کو اپنے سے دور کر دو گے ( بھگا دو گے ) اور اللہ کی وہ تلوار جو تمہاری نظروں سے پوشیدہ ہے تمہارے خلاف سونت دی جائے گی، پھر وہ قیامت تک میان میں ڈالی نہ جا سکے گی، راوی کہتے ہیں: لوگوں نے ( عبداللہ بن مسعود رضی الله عنہ کی بات سن کر ) کہا: اس یہودی کو قتل کر دو، اور عثمان رضی الله عنہ کو بھی مار ڈالو قتل کر دو۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، ۲- اس حدیث کو شعیب بن صفوان نے عبدالملک بن عمیر سے اور عبدالملک بن عمیر نے ابن محمد بن عبداللہ بن سلام سے اور ابن محمد نے اپنے دادا عبداللہ بن سلام رضی الله عنہ سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 308
			}
		}
	]
}