{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3273,
			"arabicnumber": 3273,
			"text": "ابووائل شقیق بن سلمہ کہتے ہیں کہ قبیلہ بنی ربیعہ کے ایک شخص نے کہا: میں مدینہ آیا اور رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا، وہاں آپ کے پاس ( دوران گفتگو ) میں نے قوم عاد کے قاصد کا ذکر کیا، اور میں نے کہا: میں اللہ کی پناہ مانگتا ہوں اس بات سے کہ میں عاد کے قاصد جیسابن جاؤں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عاد کے قاصد کا قصہ کیا ہے؟“ میں نے کہا: ( اچھا ہوا ) آپ نے واقف کار سے پوچھا ( میں آپ کو بتاتا ہوں ) قوم عاد جب قحط سے دوچار ہوئی تو اس نے قیل ( نامی شخص ) کو ( امداد و تعاون حاصل کرنے کے لیے مکہ ) بھیجا، وہ ( آ کر ) بکر بن معاویہ کے پاس ٹھہرا، بکر نے اسے شراب پلائی، اور دو مشہور مغنیاں اسے اپنے نغموں سے محظوظ کرتی رہیں، پھر قیل نے وہاں سے نکل کر مہرہ کے پہاڑوں کا رخ کیا ( مہرہ ایک قبیلہ کے دادا کا نام ہے ) اس نے ( دعا مانگی ) کہا: اے اللہ! میں تیرے پاس کوئی مریض لے کر نہیں آیا کہ اس کا علاج کراؤں، اور نہ کسی قیدی کے لیے آیا اسے آزاد کرا لوں، تو اپنے بندے کو پلا ( یعنی مجھے ) جو تجھے پلانا ہے اور اس کے ساتھ بکر بن معاویہ کو بھی پلا ( اس نے یہ دعا کر کے ) اس شراب کا شکریہ ادا کیا، جو بکر بن معاویہ نے اسے پلائی تھی، ( انجام کار ) اس کے لیے ( آسمان پر ) کئی بدلیاں چھائیں اور اس سے کہا گیا کہ تم ان میں سے کسی ایک کو اپنے لیے چن لو، اس نے ان میں سے کالی رنگ کی بدلی کو پسند کر لیا، کہا گیا: اسے لے لو اپنی ہلاکت و بربادی کی صورت میں، عاد قوم کے کسی فرد کو بھی نہ باقی چھوڑے گی، اور یہ بھی ذکر کیا گیا ہے کہ عاد پر ہوا ( آندھی ) اس حلقہ یعنی انگوٹھی کے حلقہ کے برابر ہی چھوڑی گئی۔ پھر آپ نے آیت «إذ أرسلنا عليهم الريح العقيم ما تذر من شيء أتت عليه إلا جعلته كالرميم» ”یاد کرو اس وقت کو جب ہم نے ان پر بانجھ ہوا بھیجی جس چیز کو بھی وہ ہوا چھو جاتی اسے چورا چورا کر دیتی“ ( الذاریات: ۴۲ ) ، پڑھی ۱؎۔ امام ترمذی کہتے ہیں: ۱- اس حدیث کو کئی لوگوں نے سلام ابومنذر سے، سلام نے عاصم بن ابی النجود سے، عاصم نے ابووائل سے اور ابووائل نے ( «عن رجل من ربیعة» کی جگہ ) حارث بن حسان سے روایت کیا ہے۔ ( یہ روایت آگے آ رہی ہے ) ۲- حارث بن حسان کو حارث بن یزید بھی کہا جاتا ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}