{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3278,
			"arabicnumber": 3278,
			"text": "عامر شراحیل شعبی کہتے ہیں کہ ابن عباس رضی الله عنہما کی ملاقات کعب الاحبار سے عرفہ میں ہوئی، انہوں نے کعب سے کسی چیز کے بارے میں پوچھا تو انہوں نے تکبیرات پڑھیں جن کی صدائے بازگشت پہاڑوں میں گونجنے لگی، ابن عباس رضی الله عنہما نے کہا: ہم بنو ہاشم سے تعلق رکھتے ہیں، کعب نے کہا: اللہ تعالیٰ نے اپنی رویت و دیدار کو اور اپنے کلام کو محمد صلی اللہ علیہ وسلم اور موسیٰ ( علیہ السلام ) کے درمیان تقسیم کر دیا ہے۔ اللہ نے موسیٰ سے دو بار بات کی، اور محمد صلی اللہ علیہ وسلم نے اللہ کو دو بار دیکھا۔ مسروق کہتے ہیں: میں ام المؤمنین عائشہ رضی الله عنہا کے پاس پہنچا، میں نے ان سے پوچھا: کیا محمد صلی اللہ علیہ وسلم نے اپنے رب کو دیکھا ہے؟ انہوں نے کہا: تم نے تو ایسی بات کہی ہے جسے سن کر میرے رونگٹے کھڑے ہو گئے ہیں، میں نے کہا: ٹھہریئے، جلدی نہ کیجئے ( پوری بات سن لیجئے ) پھر میں نے آیت «لقد رأى من آيات ربه الكبرى» ”پھر آپ نے اللہ کی بڑی آیات و نشانیاں دیکھیں“ ( النجم: ۱۸ ) ، تلاوت کی ام المؤمنین عائشہ رضی الله عنہا نے فرمایا: ”تمہیں کہاں لے جایا گیا ہے؟ ( کہاں بہکا دیے گئے ہو؟ ) یہ دیکھے جانے والے تو جبرائیل تھے، تمہیں جو یہ خبر دے کہ محمد صلی اللہ علیہ وسلم نے اپنے رب کو دیکھا ہے؟ یا جن باتوں کا آپ کو حکم دیا گیا ہے ان میں سے آپ نے کچھ چھپا لیا ہے، یا وہ پانچ چیزیں جانتے ہیں جن کے بارے میں اللہ تعالیٰ نے فرمایا ہے۔ «إن الله عنده علم الساعة وينزل الغيث» ”اللہ ہی کے پاس قیامت کا علم ہے اور اللہ ہی جانتا ہے کہ بارش کب اور کہاں نازل ہو گی“ ( سورۃ لقمان: ۳۴ ) ، اس نے بڑا جھوٹ بولا، لیکن یہ حقیقت ہے کہ آپ نے جبرائیل علیہ السلام کو دیکھا، جبرائیل علیہ السلام کو آپ نے ان کی اپنی اصل صورت میں صرف دو مرتبہ دیکھا ہے، ( ایک بار ) سدرۃ المنتہیٰ کے پاس اور ایک بار جیاد میں ( جیاد نشیبی مکہ کا ایک محلہ ہے ) جبرائیل علیہ السلام کے چھ سو بازو تھے، انہوں نے سارے افق کو اپنے پروں سے ڈھانپ رکھا تھا“۔ امام ترمذی کہتے ہیں: داود بن ابی ہند نے شعبی سے، شعبی نے مسروق سے اور مسروق نے عائشہ رضی الله عنہا کے واسطہ سے، نبی اکرم صلی اللہ علیہ وسلم سے اس جیسی حدیث روایت کی، داود کی حدیث مجالد کی حدیث سے چھوٹی ہے ( لیکن وہی صحیح ہے ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 330
			}
		}
	]
}