{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3299,
			"arabicnumber": 3299,
			"text": "سلمہ بن صخر انصاری رضی الله عنہ کہتے ہیں کہ مجھے عورت سے جماع کی جتنی شہوت و قوت ملی تھی ( میں سمجھتا ہوں ) اتنی کسی کو بھی نہ ملی ہو گی، جب رمضان کا مہینہ آیا تو میں نے اس ڈر سے کہ کہیں میں رمضان کی رات میں بیوی سے ملوں ( صحبت کر بیٹھوں ) اور پے در پے جماع کئے ہی جاؤں کہ اتنے میں صبح ہو جائے اور میں اسے چھوڑ کر علیحدہ نہ ہو پاؤں، میں نے رمضان کے ختم ہونے تک کے لیے بیوی سے ظہار ۱؎ کر لیا، پھر ایسا ہوا کہ ایک رات میری بیوی میری خدمت کر رہی تھی کہ اچانک مجھے اس کی ایک چیز دکھائی پڑ گئی تو میں ( اپنے آپ پر قابو نہ رکھ سکا ) اسے دھر دبوچا، جب صبح ہوئی تو میں اپنی قوم کے پاس آیا اور انہیں اپنے حال سے باخبر کیا، میں نے ان سے کہا کہ میرے ساتھ رسول اللہ صلی اللہ علیہ وسلم کے پاس چلو تاکہ میں آپ کو اپنے معاملے سے باخبر کر دوں، ان لوگوں نے کہا: نہیں، اللہ کی قسم! ہم نہ جائیں گے، ہمیں ڈر ہے کہ کہیں ہمارے متعلق قرآن ( کوئی آیت ) نازل نہ ہو جائے، یا رسول اللہ صلی اللہ علیہ وسلم کوئی بات نہ کہہ دیں جس کی شرمندگی برقرار رہے، البتہ تم خود ہی جاؤ اور جو مناسب ہو کرو، تو میں گھر سے نکلا اور رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچا اور آپ کو اپنی بات بتائی، آپ نے فرمایا: ”تم نے یہ کام کیا ہے؟“ میں نے کہا: جی ہاں، میں نے ایسا کیا ہے، آپ نے فرمایا: ”تم نے ایسا کیا ہے؟“ میں نے کہا: جی ہاں، میں نے ایسا کیا ہے آپ نے ( تیسری بار بھی یہی ) پوچھا: ”تو نے یہ بات کی ہے“، میں نے کہا: جی ہاں، مجھ سے ہی ایسی بات ہوئی ہے، مجھ پر اللہ کا حکم جاری و نافذ فرمائیے، میں اپنی اس بات پر ثابت و قائم رہنے والا ہوں، آپ نے فرمایا: ”ایک غلام آزاد کرو“، میں نے اپنی گردن پر ہاتھ مار کر کہا: قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے! میں اپنی اس گردن کے سوا کسی اور گردن کا مالک نہیں ہوں ( غلام کیسے آزاد کروں ) آپ نے فرمایا: ”پھر دو مہینے کے روزے رکھو“، میں نے کہا: اللہ کے رسول! مجھے جو پریشانی و مصیبت لاحق ہوئی ہے وہ اسی روزے ہی کی وجہ سے تو لاحق ہوئی ہے، آپ نے فرمایا: ”تو پھر ساٹھ مسکینوں کو کھانا کھلا دو“، میں نے کہا: قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے! ہم نے یہ رات بھوکے رہ کر گزاری ہے، ہمارے پاس رات کا بھی کھانا نہ تھا، آپ نے فرمایا: ”بنو زریق کے صدقہ دینے والوں کے پاس جاؤ اور اس سے کہو کہ وہ تمہیں صدقہ کا مال دے دیں اور اس میں سے تم ایک وسق ساٹھ مسکینوں کو اپنے کفارہ کے طور پر کھلا دو اور باقی جو کچھ بچے وہ اپنے اوپر اور اپنے بال بچوں پر خرچ کرو، وہ کہتے ہیں: پھر میں لوٹ کر اپنی قوم کے پاس آیا، میں نے کہا: میں نے تمہارے پاس تنگی، بدخیالی اور بری رائے و تجویز پائی، جب کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس کشادگی اور برکت پائی، رسول اللہ صلی اللہ علیہ وسلم نے مجھے تمہارا صدقہ لینے کا حکم دیا ہے تو تم لوگ اسے مجھے دے دو، چنانچہ ان لوگوں نے مجھے دے دیا۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- محمد بن اسماعیل بخاری کہتے ہیں: سلیمان بن یسار نے میرے نزدیک سلمہ بن صخر سے نہیں سنا ہے، سلمہ بن صخر کو سلمان بن صخر بھی کہتے ہیں، ۳- اس باب میں خولہ بنت ثعلبہ سے بھی روایت ہے، اور یہ اوس بن صامت کی بیوی ہیں ( رضی الله عنہما ) ۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 351
			}
		}
	]
}