{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3305,
			"arabicnumber": 3305,
			"text": "عبیداللہ بن ابورافع کہتے ہیں کہ میں نے علی رضی الله عنہ کو کہتے ہوئے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے زبیر اور مقداد بن اسود کو بھیجا، فرمایا: جاؤ، روضہ خاخ ۱؎ پر پہنچو وہاں ایک ھودج سوار عورت ہے، اس کے پاس ایک خط ہے، وہ خط جا کر اس سے لے لو، اور میرے پاس لے آؤ، چنانچہ ہم نکل پڑے، ہمارے گھوڑے ہمیں لیے لیے دوڑ میں ایک دوسرے سے آگے بڑھ جانے کی کوشش کر رہے تھے، ہم روضہ پہنچے، ہمیں ہودج سوار عورت مل گئی، ہم نے اس سے کہا: خط نکال، اس نے کہا: ہمارے پاس کوئی خط نہیں ہے، ہم نے کہا: خط نکالتی ہے یا پھر اپنے کپڑے اتارتی ہے؟ ( یہ سن کر ) اپنی چوٹی ( جوڑے ) سے اس نے خط نکالا، ہم اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آ گئے، وہ خط حاطب بن ابی بلتعہ رضی الله عنہ کی جانب سے تھا، مکہ کے کچھ مشرکین کے پاس بھیجا گیا تھا، نبی اکرم صلی اللہ علیہ وسلم کے بعض اقدامات کی انہیں خبر دی گئی تھی، آپ نے فرمایا: ”حاطب! یہ کیا ہے؟“ انہوں نے کہا: اللہ کے رسول! ہمارے خلاف حکم فرمانے میں جلدی نہ کریں، میں ایک ایسا شخص تھا جو قریش کے ساتھ مل جل کر رہتا تھا، لیکن ( خاندانی طور پر ) قریشی نہ تھا، باقی جو مہاجرین آپ کے ساتھ تھے ان کی وہاں رشتہ داریاں تھیں جس کی وجہ سے وہ رشتہ دار مکہ میں ان کے گھر والوں اور ان کے مالوں کی حفاظت و حمایت کرتے تھے، میں نے مناسب سمجھا کہ جب ہمارا ان سے کوئی خاندانی و نسبی تعلق نہیں ہے تو میں ان پر احسان کر کے کسی کا ہاتھ پکڑ لوں جس کی وجہ سے یہ اہل مکہ ہمارے گھر اور رشتہ داروں کی حفاظت و حمایت کریں، میں نے ایسا کفر اختیار کر لینے یا اپنے دین سے مرتد ہو جانے یا کفر کو پسند کر لینے کی وجہ سے نہیں کیا ہے، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”حاطب نے سچ اور ( صحیح ) بات کہی ہے“، عمر بن خطاب رضی الله عنہ نے کہا: اللہ کے رسول! مجھے اجازت دیجئیے، میں اس منافق کی گردن مار دوں، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”یہ جنگ بدر میں موجود رہے ہیں، تمہیں معلوم نہیں، یقیناً اللہ نے بدر والوں کی حالت ( یعنی ان کے جذبہ جاں فروشی ) کو دیکھ کر کہہ دیا ہے: جو چاہو کرو ہم نے تمہارے گناہ بخش دیئے ہیں“، اسی سلسلے میں یہ پوری سورۃ «يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء» ”اے لوگو! جو ایمان لائے ہو، میرے اور اپنے دشمنوں کو دوست نہ بناؤ، تم انہیں دوستی کا پیغام بھیجتے ہو“ ( الممتحنۃ: ۱ ) ، آخر تک نازل ہوئی۔ عمرو ( راوی حدیث ) کہتے ہیں: میں نے عبیداللہ بن ابی رافع کو دیکھا ہے، وہ علی رضی الله عنہ کے کاتب ( محرر ) تھے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح ہے، ۲- اسی طرح کئی ایک نے یہ حدیث سفیان بن عیینہ سے روایت کی ہے، اور ان سبھوں نے بھی یہی لفظ ذکر کیا ہے کہ علی اور زبیر رضی الله عنہما وغیرہ نے کہا: تمہیں خط نکال کر دینا ہو گا، ورنہ پھر تمہیں کپڑے اتارنے پڑیں گے، ۳- ابوعبدالرحمٰن السلمی سے بھی یہ حدیث مروی ہوئی ہے، انہوں نے علی رضی الله عنہ سے اسی حدیث کے مانند روایت کیا ہے، ۴- اس باب میں عمر اور جابر بن عبداللہ رضی الله عنہم سے بھی احادیث آئی ہیں۔ اور بعضوں نے ذکر کیا کہ انہوں نے کہا کہ تو خط نکال دے ورنہ ہم تجھے ننگا کر دیں گے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 357
			}
		}
	]
}