{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3313,
			"arabicnumber": 3313,
			"text": "زید بن ارقم رضی الله عنہ کہتے ہیں کہ ہم نبی اکرم صلی اللہ علیہ وسلم کے ساتھ ( غزوہ بنی مصطلق میں ) جہاد کے لیے نکلے، ہمارے ساتھ کچھ اعرابی بھی تھے ( جب کہیں پانی نظر آتا ) تو ہم ایک دوسرے سے پہلے پہنچ کر حاصل کر لینے کی کوشش کرتے، اعرابی پانی تک پہنچنے میں ہم سے آگے بڑھ جاتے ( اس وقت ایسا ہوا ) ایک دیہاتی اپنے ساتھیوں سے آگے نکل گیا، جب آگے نکلتا تو حوض کو بھرتا اور اس کے اردگرد پتھر رکھتا، اس پر چمڑے کی چٹائی ڈال دیتا، پھر اس کے ساتھی آتے، اسی موقع پر انصاریوں میں سے ایک اعرابی کے پاس آیا، اور اپنی اونٹنی کی مہار ڈھیلی کر دی تاکہ وہ پانی پی لے، مگر اس اعرابی شخص نے پانی پینے نہ دیا، انصاری نے باندھ توڑ دیا اعرابی نے لٹھ اٹھائی اور انصاری کے سر پر مار کر اس کا سر توڑ دیا، وہ انصاری منافقین کے سردار عبداللہ بن ابی کے پاس آیا، وہ اس کے ( ہم خیال ) ساتھیوں میں سے تھا، اس نے اسے واقعہ کی اطلاع دی، عبداللہ بن ابی یہ خبر سن کر بھڑک اٹھا، غصہ میں آ گیا، کہا: ان لوگوں پر تم لوگ خرچ نہ کرو جو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہیں جب تک کہ وہ ( یعنی اعرابی ) ہٹ نہ جائیں جب کہ ان کا معمول یہ تھا کہ کھانے کے وقت وہ لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس اکٹھا اور موجود ہوتے تھے، عبداللہ بن ابی نے کہا: جب وہ لوگ محمد کے پاس سے چلے جائیں تو محمد کے پاس کھانا لے کر آؤ تاکہ محمد ( صلی اللہ علیہ وسلم ) اور ان کے ساتھ ( خاص ) موجود لوگ کھا لیں، پھر اس نے اپنے ساتھیوں سے کہا: اگر ہم مدینہ ( بسلامت ) پہنچ گئے تو تم میں جو عزت والے ہیں انہیں ذلت والوں ( اعرابیوں ) کو مدینہ سے ضرور نکال بھگا دینا چاہیئے، زید کہتے ہیں: میں سواری پر رسول اللہ صلی اللہ علیہ وسلم کے پیچھے بیٹھا ہوا تھا، میں نے عبداللہ بن ابی کی بات سن لی، تو اپنے چچا کو بتا دی، چچا گئے، انہوں نے جا کر رسول اللہ صلی اللہ علیہ وسلم کو خبر دیدی، رسول اللہ صلی اللہ علیہ وسلم نے کسی کو بھیج کر اسے بلوایا، اس نے آ کر قسمیں کھائیں اور انکار کیا ( کہ میں نے ایسی باتیں نہیں کہی ہیں ) تو رسول اللہ صلی اللہ علیہ وسلم نے اسے سچا مان لیا اور مجھے جھوٹا ٹھہرا دیا، پھر میرے چچا میرے پاس آئے، بولے ( بیٹے ) تو نے کیا سوچا تھا کہ رسول اللہ صلی اللہ علیہ وسلم تجھ پر غصہ ہوں اور رسول اللہ صلی اللہ علیہ وسلم اور مسلمانوں نے تجھے جھوٹا ٹھہرا دیا، ( یہ سن کر ) مجھے اتنا غم اور صدمہ ہوا کہ شاید اتنا غم اور صدمہ کسی اور کو نہ ہوا ہو گا، میں غم سے اپنا سر جھکائے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سفر میں چلا ہی جا رہا تھا کہ یکایک آپ میرے قریب آئے میرے کان کو جھٹکا دیا اور میرے سامنے مسکرا دیئے مجھے اس سے اتنی خوشی ہوئی کہ اس کے بدلے میں اگر مجھے دنیا میں جنت مل جاتی تو بھی اتنی خوشی نہ ہوتی، پھر مجھے ابوبکر رضی الله عنہ ملے، مجھ سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم نے تم سے کیا کہا؟ میں نے کہا: مجھ سے آپ نے کچھ نہیں کہا: البتہ میرے کان پکڑ کر آپ نے ہلائے اور مجھے دیکھ کر ہنسے، ابوبکر رضی الله عنہ نے کہا: خوش ہو جاؤ، پھر مجھے عمر رضی الله عنہ ملے، میں نے انہیں بھی وہی بات بتائی، جو میں نے ابوبکر رضی الله عنہ سے کہی تھی، پھر صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے ( نماز فجر میں ) سورۃ منافقین پڑھی۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 365
			}
		}
	]
}