{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3318,
			"arabicnumber": 3318,
			"text": "عبیداللہ بن عبداللہ بن ابی ثور کہتے ہیں کہ میں نے ابن عباس رضی الله عنہما کو کہتے ہوئے سنا: میری برابر یہ خواہش رہی کہ میں عمر رضی الله عنہ سے نبی اکرم صلی اللہ علیہ وسلم کی ان دو بیویوں کے بارے میں پوچھوں جن کے بارے میں اللہ تعالیٰ نے فرمایا ہے «إن تتوبا إلى الله فقد صغت قلوبكما» ”اے نبی کی دونوں بیویو! اگر تم دونوں اللہ کے سامنے توبہ کر لو ( تو بہت بہتر ہے ) یقیناً تمہارے دل جھک پڑے ہیں ( یعنی حق سے ہٹ گئے ہیں“ ( التحریم: ۴ ) ، ( مگر مجھے موقع اس وقت ملا ) جب عمر رضی الله عنہ نے حج کیا اور میں نے بھی ان کے ساتھ حج کیا، میں نے ڈول سے پانی ڈال کر انہیں وضو کرایا، ( اسی دوران ) میں نے ان سے پوچھا: امیر المؤمنین! نبی اکرم صلی اللہ علیہ وسلم کی وہ دو بیویاں کون ہیں جن کے بارے میں اللہ نے کہا ہے «إن تتوبا إلى الله فقد صغت قلوبكما وإن تظاهرا عليه فإن الله هو مولاه» عمر رضی الله عنہ نے مجھ سے حیرت سے کہا: ہائے تعجب! اے ابن عباس ( تمہیں اتنی سی بات معلوم نہیں ) ( زہری کہتے ہیں قسم اللہ کی ابن عباس رضی الله عنہما نے جو بات پوچھی وہ انہیں بری لگی مگر انہوں نے حقیقت چھپائی نہیں بتا دی ) انہوں نے مجھے بتایا: وہ عائشہ اور حفصہ رضی الله عنہما ہیں، پھر وہ مجھے پوری بات بتانے لگے کہا: ہم قریش والے عورتوں پر حاوی رہتے اور انہیں دبا کر رکھتے تھے، مگر جب مدینہ آئے تو یہاں ایسے لوگ ملے جن پر ان کی بیویاں غالب اور حاوی ہوتی تھیں، تو ہماری عورتیں ان کی عورتوں سے ان کے رنگ ڈھنگ سیکھنے لگیں، ایک دن ایسا ہوا کہ میں اپنی بیوی پر غصہ ہو گیا، کیا دیکھتا ہوں کہ وہ بھی مجھے پلٹ کر جواب دینے لگی، مجھے ( سخت ) ناگوار ہوا کہ وہ مجھے پلٹ کر جواب دے، اس نے کہا: آپ کو یہ بات کیوں ناگوار لگ رہی ہے؟ قسم اللہ کی نبی اکرم صلی اللہ علیہ وسلم کی بعض بیویاں بھی آپ صلی اللہ علیہ وسلم کو پلٹ کر جواب دے رہی ہیں اور دن سے رات تک آپ کو چھوڑے رہتی ہیں ( روٹھی اور اینٹھی رہتی ) ہیں، میں نے اپنے جی میں کہا: آپ کی بیویوں میں سے جس نے بھی ایسا کیا وہ ناکام ہوئی اور گھاٹے میں رہی، میرا گھر مدینہ کے بنی امیہ نامی محلہ میں عوالی کے علاقہ میں تھا، اور میرا ایک انصاری پڑوسی تھا، ہم باری باری رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا کرتے تھے، ایک دن وہ آتا اور جو کچھ ہوا ہوتا وہ واپس جا کر مجھے بتاتا، اور ایسے ہی ایک دن میں آپ کے پاس آتا اور وحی وغیرہ کی جو بھی خبر ہوتی میں جا کر اسے بتاتا، ہم ( اس وقت ) باتیں کیا کرتے تھے کہ اہل غسان ہم سے لڑائی کرنے کے لیے اپنے گھوڑوں کے پیروں میں نعلیں ٹھونک رہے ہیں، ایک دن عشاء کے وقت ہمارے پڑوسی انصاری نے آ کر، دروازہ کھٹکھٹایا، میں دروازہ کھول کر اس کے پاس گیا، اس نے کہا: ایک بڑی بات ہو گئی ہے، میں نے پوچھا: کیا اہل غسان ہم پر چڑھائی کر آئے ہیں؟ اس نے کہا: اس سے بھی بڑا معاملہ پیش آ گیا ہے، رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کو طلاق دے دی ہے، میں نے اپنے جی میں کہا: حفصہ ناکام رہی گھاٹے میں پڑی، میں سوچا کرتا تھا کہ ایسا ہونے والا ہے، جب میں نے فجر پڑھی تو اپنے کپڑے پہنے اور چل پڑا، حفصہ کے پاس پہنچا تو وہ ( بیٹھی ) رو رہی تھی، میں نے پوچھا: کیا تم سب بیویوں کو رسول اللہ صلی اللہ علیہ وسلم نے طلاق دے دی ہے؟ انہوں نے کہا: مجھے نہیں معلوم ہے، البتہ آپ اس بالاخانے پر الگ تھلگ بیٹھے ہیں، عمر رضی الله عنہ کہتے ہیں: میں ( اٹھ کر آپ سے ملنے ) چلا، میں ایک کالے رنگ کے ( دربان ) لڑکے کے پاس آیا اور اس سے کہا: جاؤ، آپ صلی اللہ علیہ وسلم سے عمر کے آنے کی اجازت مانگو، عمر رضی الله عنہ کہتے ہیں: وہ لڑکا آپ کے پاس گیا پھر نکل کر میرے پاس آیا اور کہا: میں نے آپ کے آنے کی خبر کی مگر آپ نے کچھ نہ کہا، میں مسجد چلا گیا ( دیکھا ) منبر کے آس پاس کچھ لوگ بیٹھے رو رہے تھے، میں بھی انہیں لوگوں کے پاس بیٹھ گیا، ( مجھے سکون نہ ملا ) میری فکرو تشویش بڑھتی گئی، میں اٹھ کر دوبارہ لڑکے کے پاس چلا آیا، میں نے کہا: جاؤ آپ سے عمر کے اندر آنے کی اجازت مانگو، تو وہ اندر گیا پھر میرے پاس واپس آیا، اس نے کہا: میں نے آپ کا ذکر نبی اکرم صلی اللہ علیہ وسلم سے کیا، لیکن آپ نے کوئی جواب نہ دیا، عمر رضی الله عنہ کہتے ہیں: میں دوبارہ مسجد میں آ کر بیٹھ گیا، مگر مجھ پر پھر وہی فکر سوار ہو گئی، میں ( سہ بارہ ) لڑکے کے پاس آ گیا اور اس سے کہا: جاؤ اور آپ سے عمر کے اندر آنے کی اجازت مانگو، وہ لڑکا اندر گیا پھر میرے پاس واپس آیا، کہا: میں نے آپ سے آپ کے آنے کا ذکر کیا مگر آپ نے کوئی جواب نہ دیا، ( یہ سن کر ) میں پلٹ پڑا، یکایک لڑکا مجھے پکارنے لگا، ( آ جائیے آ جائیے ) اندر تشریف لے جائیے، رسول اللہ صلی اللہ علیہ وسلم نے آپ کو اجازت دے دی ہے، میں اندر چلا گیا، میں نے دیکھا آپ بوریئے پر ٹیک لگائے ہوئے ہیں اور اس کا اثر و نشان آپ کے پہلوؤں میں دیکھا، میں نے پوچھا: اللہ کے رسول! کیا آپ نے اپنی بیویوں کو طلاق دے دی ہے؟ آپ نے فرمایا: ”نہیں“، میں نے کہا: اللہ اکبر، آپ نے دیکھا ہو گا اللہ کے رسول! ہم قریشی لوگ اپنی بیویوں پر کنٹرول رکھتے تھے، لیکن جب ہم مدینہ آ گئے تو ہمارا سابقہ ایک ایسی قوم سے پڑ گیا ہے جن پر ان کی بیویاں حاوی اور غالب رہتی ہیں، ہماری عورتیں ان کی عورتوں سے ( ان کے طور طریقے ) سیکھنے لگیں، ایک دن اپنی بیوی پر غصہ ہوا تو وہ مجھے پلٹ کر جواب دینے لگی، مجھے یہ سخت برا لگا، کہنے لگی آپ کو کیوں اتنا برا لگ رہا ہے، قسم اللہ کی نبی اکرم صلی اللہ علیہ وسلم کی بعض بیویاں بھی آپ کو پلٹ کر جواب دے رہی ہیں اور کوئی بھی عورت دن سے رات تک آپ کو چھوڑ کر ( روٹھی و اینٹھی ) رہتی ہے، میں نے حفصہ سے کہا: کیا تم پلٹ کر رسول اللہ صلی اللہ علیہ وسلم کو جواب دیتی ہو؟ اس نے کہا: ہاں، ہم میں کوئی بھی آپ سے ( خفا ہو کر ) دن سے رات تک آپ سے علیحدہ رہتی ہے، میں نے کہا: تم میں سے جس نے بھی ایسا کیا وہ گھاٹے میں رہی اور ناکام ہوئی، کیا تم میں سے ہر کوئی اس بات سے مطمئن ہے کہ اللہ اپنے رسول کی ناراضگی کے سبب اس سے ناراض و ناخوش ہو جائے اور وہ ہلاک و برباد ہو جائے؟ ( یہ سن کر ) آپ صلی اللہ علیہ وسلم مسکرا پڑے، عمر رضی الله عنہ نے کہا: میں نے حفصہ سے کہا: رسول اللہ صلی اللہ علیہ وسلم کو پلٹ کر جواب نہ دو اور نہ آپ سے کسی چیز کا مطالبہ کرو، جس چیز کی تمہیں حاجت ہو وہ مجھ سے مانگ لیا کرو، اور تم بھروسے میں نہ رہو تمہاری سوکن تو تم سے زیادہ خوبصورت اور رسول اللہ صلی اللہ علیہ وسلم کی چہیتی ہے ۱؎ ( یہ سن کر ) رسول اللہ صلی اللہ علیہ وسلم پھر مسکرا دیئے، میں نے کہا: اللہ کے رسول! کیا میں دل بستگی کی بات کروں؟ آپ نے فرمایا: ”ہاں“، عمر کہتے ہیں: میں نے سر اٹھایا تو گھر میں تین کچی کھالوں کے سوا کوئی اور چیز دکھائی نہ دی، میں نے عرض کیا، اللہ کے رسول! اللہ سے دعا فرمایئے کہ وہ آپ کی امت کو وہ کشادگی و فراوانی دے جو اس نے روم و فارس کو دی ہے، جب کہ وہ اس کی عبادت و بندگی بھی نہیں کرتے ہیں، ( یہ سن کر ) آپ جم کر بیٹھ گئے، فرمایا: ”خطاب کے بیٹے! کیا تم ابھی تک اسلام کی حقانیت کے بارے میں شک و شبہہ میں پڑے ہوئے ہو؟ یہ ایسے لوگ ہیں جنہیں ان کے حصہ کی اچھی چیزیں پہلے ہی دنیا میں دے دی گئی ہیں“، عمر رضی اللہ عنہ کہتے ہیں: آپ نے قسم کھائی تھی کہ آپ ایک مہینہ تک اپنی بیویوں کے پاس نہ جائیں گے، اس پر اللہ تعالیٰ نے فہمائش کی اور آپ کو کفارہ یمین ( قسم کا کفارہ ) ادا کرنے کا حکم دیا۔ زہری کہتے ہیں: عروہ نے عائشہ رضی الله عنہا سے روایت کرتے ہوئے کہا کہ عائشہ رضی الله عنہا نے بتایا کہ جب مہینے کے ۲۹ دن گزر گئے تو نبی اکرم صلی اللہ علیہ وسلم سب سے پہلے میرے پاس تشریف لائے، آپ نے فرمایا: ”میں تم سے ایک بات کا ذکر کرنے والا ہوں، اپنے والدین سے مشورہ کئے بغیر جواب دینے میں جلدی نہ کرنا“، پھر آپ نے یہ آیت پڑھی «يا أيها النبي قل لأزواجك» ( آخر آیت تک ) ”اے نبی! اپنی بیویوں سے کہہ دیجئیے کہ اگر تمہیں دنیا کی زندگی اور اس کی خوش رنگینیاں چاہیئے، تو آؤ میں تمہیں کچھ دے دوں، اور خوش اسلوبی سے تم کو رخصت کر دوں، اور اگر تمہیں اللہ اور اس کا رسول چاہیں اور آخرت کی بھلائی چاہیں تو بیشک اللہ تعالیٰ نے تم میں سے نیک عمل کرنے والیوں کے لیے اجر عظیم تیار کر رکھا ہے“ ( الاحزاب: ۲۸، ۲۹ ) ، عائشہ رضی اللہ عنہا کہتی ہیں: آپ جانتے تھے، قسم اللہ کی میرے والدین مجھے آپ سے علیحدگی اختیار کر لینے کا ہرگز حکم نہ دیں گے، میں نے کہا: کیا میں اس معاملے میں والدین سے مشورہ کروں؟ میں تو اللہ اور اس کے رسول اور آخرت کے گھر کو چاہتی اور پسند کرتی ہوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 370
			}
		}
	]
}