{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3323,
			"arabicnumber": 3323,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے نہ قرآن جنوں کو پڑھ کر سنایا ہے اور نہ انہیں دیکھا ہے ۱؎ ( ہوا یہ ہے ) کہ رسول اللہ صلی اللہ علیہ وسلم اپنے صحابہ کی جماعت کے ساتھ عکاظ بازار جا رہے تھے، ( بعثت محمدی کے تھوڑے عرصہ بعد ) شیطانوں اور ان کے آسمانی خبریں حاصل کرنے کے درمیان رکاوٹ ڈال دی گئی تھی اور ان پر شعلے برسائے جانے لگے تھے، تو وہ اپنی قوم کے پاس لوٹ گئے، ان کی قوم نے کہا: کیا بات ہے؟ کیسے لوٹ آئے؟ انہوں نے کہا: ہمارے اور آسمان کی خبر کے درمیان دخل اندازی کر دی گئی ہے، آسمانی خبریں سننے سے روکنے کے لیے ہم پر تارے پھینکے گئے ہیں، قوم نے کہا: لگتا ہے ( دنیا میں ) کوئی نئی چیز ظہور پذیر ہوئی ہے جس کی وجہ سے ہمارے اور آسمان کی خبر کے درمیان رکاوٹ کھڑی ہوئی ہے، تم زمین کے مشرق و مغرب میں چاروں طرف پھیل جاؤ اور دیکھو کہ وہ کون سی چیز ہے جو ہمارے اور ہمارے آسمان سے خبریں حاصل کرنے کے درمیان حائل ہوئی ( اور رکاوٹ بنی ) ہے چنانچہ وہ زمین کے چاروں کونے مغربین و مشرقین میں تلاش کرنے نکل کھڑے ہوئے، شیاطین کا جو گروہ تہامہ کی طرف نکلا تھا وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے گزرا ( اس وقت ) آپ سوق عکاظ جاتے ہوئے مقام نخلہ میں تھے، اور اپنے صحابہ کے ساتھ فجر کی نماز پڑھ رہے تھے، جب انہوں نے قرآن سنا تو پوری توجہ سے کان لگا کر سننے لگے، ( سن چکے تو ) انہوں نے کہا: یہ ہے قسم اللہ کی! وہ چیز جو تمہارے اور آسمان کی خبر کے درمیان حائل ہوئی ہے، ابن عباس رضی الله عنہما کہتے ہیں: یہیں سے وہ لوگ اپنی قوم کی طرف لوٹ گئے، ( وہاں جا کر ) کہا: اے میری قوم! «إنا سمعنا قرآنا عجبا يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدا» ”ہم نے عجیب و غریب قرآن سنا ہے جو راہ راست کی طرف رہنمائی کرتا ہے ہم اس پر ایمان لا چکے ( اب ) ہم کسی کو بھی اپنے رب کا شریک نہ بنائیں گے“ ( الجن: ۱-۲ ) ، اسی موقع پر اللہ تعالیٰ نے اپنے نبی اکرم صلی اللہ علیہ وسلم پر آیت «قل أوحي إلي أنه استمع نفر من الجن» نازل فرمائی، اور آپ پر جن کا قول وحی کیا گیا ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 375
			}
		}
	]
}