{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3536,
			"arabicnumber": 3536,
			"text": "زر بن حبیش کہتے ہیں کہ میں صفوان بن عسال مرادی رضی الله عنہ کے پاس آیا، انہوں نے پوچھا: تمہیں کیا چیز یہاں لے کر آئی ہے؟ میں نے کہا: علم حاصل کرنے آیا ہوں، انہوں نے کہا: مجھے یہ حدیث پہنچی ہے کہ ”فرشتے طالب علم کے کام ( و مقصد ) سے خوش ہو کر طالب علم کے لیے اپنے پر بچھا دیتے ہیں“، وہ کہتے ہیں: میں نے کہا: میرے جی میں یہ خیال گزرا یا میرے دل میں موزوں پر مسح کے بارے میں کچھ بات کھٹکی، تو کیا اس بارے میں آپ کو رسول اللہ صلی اللہ علیہ وسلم کی کوئی بات یاد ہے؟ انہوں نے کہا: جی ہاں، ہم جب سفر میں ہوں ( یا سفر کرنے والے ہوں ) تو ہمیں حکم دیا گیا کہ ”ہم تین دن تک اپنے موزے پیروں سے نہ نکالیں، سوائے جنابت کی صورت میں، پاخانہ کر کے آئے ہوں یا پیشاب کر کے، یا سو کر اٹھے ہوں تو موزے نہ نکالیں“۔ پھر میں نے ان سے پوچھا: کیا آپ کو محبت و چاہت کے سلسلے میں بھی رسول اللہ صلی اللہ علیہ وسلم کی کوئی بات یا دہے؟ انہوں نے کہا: ہاں، ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ کسی سفر میں تھے تو آپ کو ایک آدمی نے جو لوگوں میں سب سے پیچھے چل رہا تھا اور گنوار، بیوقوف اور سخت مزاج تھا، بلند آواز سے پکارا، کہا: یا محمد! یا محمد! لوگوں نے اس سے کہا: ٹھہر، ٹھہر، اس طرح پکارنے سے تمہیں روکا گیا ہے، رسول اللہ صلی اللہ علیہ وسلم نے اسے اسی کی طرح بھاری اور بلند آواز میں جواب دیا: ”بڑھ آ، بڑھ آ، آ جا آ جا“ ( وہ جب قریب آ گیا ) تو بولا: آدمی کچھ لوگوں سے محبت کرتا ہے لیکن ان کے درجے تک نہیں پہنچا ہوتا ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو انسان جس سے محبت کرتا ہے اسی کے ساتھ اٹھایا جائے گا“۔ زر کہتے ہیں: وہ مجھ سے حدیث بیان کرتے رہے یہاں تک کہ انہوں نے مجھ سے بیان کیا کہ ”اللہ نے مغرب میں توبہ کا ایک دروازہ بنایا ہے جس کی چوڑائی ستر سال کی مسافت ہے، وہ بند نہ کیا جائے گا یہاں تک کہ سورج ادھر سے نکلنے لگے ( یعنی قیامت تک ) اور اسی سلسلے میں اللہ تعالیٰ کا یہ قول ہے: «يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها» ”جس دن کہ تیرے رب کی بعض آیات کا ظہور ہو گا اس وقت کسی شخص کو اس کا ایمان کام نہ دے گا“ ( الأنعام: ۱۵۸ ) ۔ امام ترمذی کہتے ہیں: یہ حدیث حسن صحیح ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 167
			}
		}
	]
}