{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3638,
			"arabicnumber": 3638,
			"text": "ابراہیم بن محمد جو علی بن ابی طالب رضی الله عنہ کی اولاد میں سے ہیں ان سے روایت ہے کہ علی رضی الله عنہ جب نبی اکرم صلی اللہ علیہ وسلم کا حلیہ بیان کرتے تو کہتے: نہ آپ بہت لمبے تھے نہ بہت پستہ قد، بلکہ لوگوں میں درمیانی قد کے تھے، آپ کے بال نہ بہت گھونگھریالے تھے نہ بالکل سیدھے، بلکہ ان دونوں کے بیچ میں تھے، نہ آپ بہت موٹے تھے اور نہ چہرہ بالکل گول تھا، ہاں اس میں کچھ گولائی ضرور تھی، آپ گورے سفید سرخی مائل، سیاہ چشم، لمبی پلکوں والے، بڑے جوڑوں والے اور بڑے شانہ والے تھے، آپ کے جسم پر زیادہ بال نہیں تھے، صرف بالوں کا ایک خط سینہ سے ناف تک کھنچا ہوا تھا، دونوں ہتھیلیاں اور دونوں قدم گوشت سے پُر تھے جب چلتے زمین پر پیر جما کر چلتے، پلٹتے تو پورے بدن کے ساتھ پلٹتے، آپ کے دونوں شانوں کے بیچ میں مہر نبوت تھی، آپ خاتم النبیین تھے، لوگوں میں آپ سب سے زیادہ سخی تھے، آپ کھلے دل کے تھے، یعنی آپ کا سینہ بغض و حسد سے آئینہ کے مانند پاک و صاف ہوتا تھا، اور سب سے زیادہ سچ بولنے والے، نرم مزاج اور سب سے بہتر رہن سہن والے تھے، جو آپ کو یکایک دیکھتا ڈر جاتا اور جو آپ کو جان اور سمجھ کر آپ سے گھل مل جاتا وہ آپ سے محبت کرنے لگتا، آپ کی توصیف کرنے والا کہتا: نہ آپ سے پہلے میں نے کسی کو آپ جیسا دیکھا ہے اور نہ آپ کے بعد۔ صلی اللہ علیہ وسلم ۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن غریب ہے، اس کی سند متصل نہیں ہے، ۲- ( نسائی کے شیخ ) ابو جعفر کہتے ہیں: میں نے نبی اکرم صلی اللہ علیہ وسلم کے حلیہ مبارک کی تفسیر میں اصمعی کو کہتے ہوئے سنا کہ «الممغط» کے معنی لمبائی میں جانے والے کے ہیں، میں نے ایک اعرابی کو سنا وہ کہہ رہا تھا «تمغط فی نشابة» یعنی اس نے اپنا تیر بہت زیادہ کھینچا اور «متردد» ایسا شخص ہے جس کا بدن ٹھنگنے پن کی وجہ سے بعض بعض میں گھسا ہوا ہو اور «قطط» سخت گھونگھریالے بال کو کہتے ہیں، اور «رَجِل» اس آدمی کو کہتے ہیں جس کے بالوں میں تھوڑی خمید گی ہو اور «مطہم» ایسے جسم والے کو کہتے ہیں جو موٹا اور زیادہ گوشت والا ہو اور «مکلثم» جس کا چہرہ گول ہو اور «مشدب» وہ شخص ہے جس کی پیشانی میں سرخی ہو اور «ادعج» وہ شخص ہے جس کے آنکھوں کی سیاہی خوب کالی ہو اور «اہدب» وہ ہے جس کی پلکیں لمبی ہوں اور «کتد» دونوں شانوں کے ملنے کی جگہ کو کہتے ہیں اور «مسربة» وہ باریک بال ہیں جو ایک خط کی طرح سینہ سے ناف تک چلے گئے ہوں اور «شثن» وہ شخص ہے جس کے ہتھیلیوں اور پیروں کی انگلیاں موٹی ہوں، اور «تقلع» سے مراد پیر جما جما کر طاقت سے چلنا ہے اور «صبب» اترنے کے معنی میں ہے، عرب کہتے ہیں «انحدر نافی صبوب وصبب» یعنی ہم بلندی سے اترے «جلیل المشاش» سے مراد شانوں کے سرے ہیں، یعنی آپ بلند شانہ والے تھے، اور «عشرة» سے مراد رہن سہن ہے اور «عشیرہ» کے معنیٰ رہن سہن والے کے ہیں اور «بدیھة» کے معنی یکایک اور یکبارگی کے ہیں، عرب کہتے ہیں «بَدَهْتُهُ بِأَمْرٍ» میں ایک معاملہ کو لے کر اس کے پاس اچانک آیا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 34
			}
		}
	]
}