{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3715,
			"arabicnumber": 3715,
			"text": "ربعی بن حراش کہتے ہیں کہ ہم سے علی بن ابوطالب رضی الله عنہ نے «رحبیہ» ( مخصوص بیٹھک ) میں بیان کیا، حدیبیہ کے دن مشرکین میں سے کچھ لوگ ہماری طرف نکلے، ان میں سہیل بن عمرو اور مشرکین کے کچھ اور سردار بھی تھے یہ سب آ کر کہنے لگے: اللہ کے رسول! ہمارے بیٹوں، بھائیوں اور غلاموں میں سے کچھ آپ کی طرف نکل کر آ گئے ہیں، انہیں دین کی سمجھ نہیں وہ ہمارے مال اور سامانوں کے درمیان سے بھاگ آئے ہیں، آپ انہیں واپس کر دیجئیے اگر انہیں دین کی سمجھ نہیں تو ہم انہیں سمجھا دیں گے، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اے گروہ قریش! تم اپنی نفسیانیت سے باز آ جاؤ ورنہ اللہ تعالیٰ تمہارے اوپر ایسے شخص کو بھیجے گا جو تمہاری گردنیں اسی دین کی خاطر تلوار سے اڑائے گا، اللہ نے اس کے دل کو ایمان کے لیے جانچ لیا ہے، لوگوں نے عرض کیا: وہ کون شخص ہے؟ اللہ کے رسول! اور آپ سے ابوبکر رضی الله عنہ نے بھی پوچھا: وہ کون ہے اللہ کے رسول؟ اور عمر رضی الله عنہ نے بھی کہ وہ کون ہے اللہ کے رسول؟ آپ نے فرمایا: ”وہ جوتی ٹانکنے والا ہے، اور آپ نے علی رضی الله عنہ کو اپنا جوتا دے رکھا تھا، وہ اسے ٹانک رہے تھے، ( راوی کہتے ہیں ) پھر علی رضی الله عنہ ہماری جانب متوجہ ہوئے اور کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ”جو میرے اوپر جھوٹ باندھے اسے چاہیئے کہ اپنا ٹھکانہ جہنم کو بنا لے“۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن صحیح غریب ہے، ہم اسے اس سند سے صرف ربعی ہی کی روایت سے جانتے ہیں جسے وہ علی رضی الله عنہ سے روایت کرتے ہیں، ۲- میں نے جارود سے سنا وہ کہہ رہے تھے: میں نے وکیع کو کہتے ہوئے سنا کہ ربعی بن حراش نے اسلام میں کبھی کوئی جھوٹ نہیں بولا، ۳- اور مجھے محمد بن اسماعیل بخاری نے خبر دی اور وہ عبداللہ بن ابی اسود سے روایت کر رہے تھے، وہ کہتے ہیں: میں نے عبدالرحمٰن بن مہدی کو کہتے سنا: منصور بن معتمر اہل کوفہ میں سب سے ثقہ آدمی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 111
			}
		}
	]
}