{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 391,
			"arabicnumber": 391,
			"text": "عبداللہ ابن بحینہ اسدی رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نماز ظہر میں کھڑے ہو گئے جب کہ آپ کو بیٹھنا تھا، چنانچہ جب نماز پوری کر چکے تو سلام پھیرنے سے پہلے آپ نے اسی جگہ بیٹھے بیٹھے دو سجدے کئے، آپ نے ہر سجدے میں اللہ اکبر کہا، اور آپ کے ساتھ لوگوں نے بھی سجدہ سہو کیے۔ امام ترمذی کہتے ہیں: ۱- ابن بحینہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبدالرحمٰن بن عوف رضی الله عنہ سے بھی حدیث آئی ہے، ۳- محمد بن ابراہیم سے روایت کی ہے کہ ابوہریرہ اور عبداللہ بن سائب قاری رضی الله عنہما دونوں سہو کے دونوں سجدے سلام سے پہلے کرتے تھے، ۴- اور اسی پر بعض اہل علم کا عمل ہے اور شافعی کا بھی یہی قول ہے، ان کی رائے ہے کہ سجدہ سہو ہر صورت میں سلام سے پہلے ہے، اور یہ حدیث دوسری حدیثوں کی ناسخ ہے کیونکہ نبی اکرم صلی اللہ علیہ وسلم کا عمل آخر میں اسی پر رہا ہے، ۵- اور احمد اور اسحاق بن راہویہ کہتے ہیں کہ جب آدمی دو رکعت کے بعد کھڑا ہو جائے تو وہ ابن بحینہ رضی الله عنہ کی حدیث پر عمل کرتے ہوئے سجدہ سہو سلام سے پہلے کرے، ۶- علی بن مدینی کہتے ہیں کہ عبداللہ ابن بحینہ ہی عبداللہ بن مالک ہیں، ابن بحینہ کے باپ مالک ہیں اور بحینہ ان کی ماں ہیں، ۷- سجدہ سہو کے بارے میں اہل علم کے مابین اختلاف ہے کہ اسے آدمی سلام سے پہلے کرے یا سلام کے بعد۔ بعض لوگوں کی رائے ہے کہ اسے سلام کے بعد کرے، یہ قول سفیان ثوری اور اہل کوفہ کا ہے، ۸- اور بعض لوگوں نے کہا ہے کہ اسے سلام سے پہلے کرے یہی قول اکثر فقہاء مدینہ کا ہے، مثلاً یحییٰ بن سعید، ربیعہ وغیرہ کا اور یہی قول شافعی کا بھی ہے، ۹- اور بعض لوگ کہتے ہیں کہ جب نماز میں زیادتی ہوئی ہو تو سلام کے بعد کرے اور جب کمی رہ گئی ہو تو سلام سے پہلے کرے، یہی قول مالک بن انس کا ہے، ۱۰- اور احمد کہتے ہیں کہ جس صورت میں جس طرح پر سجدہ سہو نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے اس صورت میں اسی طرح سجدہ سہو کرنا چاہیئے، وہ کہتے ہیں کہ جب دو رکعت کے بعد کھڑا ہو جائے تو ابن بحینہ رضی الله عنہ کی حدیث کے مطابق سلام سے پہلے سجدہ کرے اور جب ظہر پانچ رکعت پڑھ لے تو وہ سجدہ سہو سلام کے بعد کرے، اور اگر ظہر اور عصر میں دو ہی رکعت میں سلام پھیر دے تو ایسی صورت میں سلام کے بعد سجدہ سہو کرے، اسی طرح جس جس صورت میں جیسے جیسے رسول اللہ صلی اللہ علیہ وسلم کا فعل موجود ہے، اس پر اسی طرح عمل کرے، اور سہو کی جس صورت میں رسول اللہ صلی اللہ علیہ وسلم سے کوئی فعل مروی نہ ہو تو اس میں سجدہ سہو سلام سے پہلے کرے۔ ۱۱- اسحاق بن راہویہ بھی احمد کے موافق کہتے ہیں۔ مگر فرق اتنا ہے کہ وہ کہتے ہیں کہ سہو کی جس صورت میں رسول اللہ صلی اللہ علیہ وسلم سے کوئی فعل موجود نہ ہو تو اس میں اگر نماز میں زیادتی ہوئی ہو تو سلام کے بعد سجدہ سہو کرے اور اگر کمی ہوئی ہو تو سلام سے پہلے کرے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 243
			}
		}
	]
}