{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ( ظہر یا عصر کی ) دو رکعت پڑھ کر ( مقتدیوں کی طرف ) پلٹے تو ذوالیدین نے آپ سے پوچھا: اللہ کے رسول! کیا نماز کم کر دی گئی ہے یا آپ بھول گئے ہیں؟ تو آپ صلی اللہ علیہ وسلم نے پوچھا: ”کیا ذوالیدین سچ کہہ رہے ہیں؟“ لوگوں نے عرض کیا: ہاں ( آپ نے دو ہی رکعت پڑھی ہیں ) تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور آخری دونوں رکعتیں پڑھیں پھر سلام پھیرا، پھر اللہ اکبر کہا، پھر اپنے پہلے سجدہ کی طرح یا اس سے کچھ لمبا سجدہ کیا، پھر اللہ اکبر کہا اور سر اٹھایا، پھر اپنے اسی سجدہ کی طرح یا اس سے کچھ لمبا سجدہ کیا۔ ( یعنی سجدہ سہو کیا ) امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عمران بن حصین، ابن عمر، ذوالیدین رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اس حدیث کے بارے میں اہل علم کے مابین اختلاف ہے۔ بعض اہل کوفہ کہتے ہیں کہ جب کوئی نماز میں بھول کر یا لاعلمی میں یا کسی بھی وجہ سے بات کر بیٹھے تو اسے نئے سرے سے نماز دہرانی ہو گی۔ وہ اس حدیث میں مذکور واقعہ کی تاویل یہ کرتے ہیں کہ یہ واقعہ نماز میں بات چیت کرنے کی حرمت سے پہلے کا ہے ۱؎، ۴- رہے امام شافعی تو انہوں نے اس حدیث کو صحیح جانا ہے اور اسی کے مطابق انہوں نے فتویٰ دیا ہے، ان کا کہنا ہے کہ یہ حدیث اُس حدیث سے زیادہ صحیح ہے جو روزہ دار کے سلسلے میں مروی ہے کہ جب وہ بھول کر کھا لے تو اس پر روزہ کی قضاء نہیں، کیونکہ وہ اللہ کا دیا ہوا رزق ہے۔ شافعی کہتے ہیں کہ ان لوگوں نے روزہ دار کے قصداً اور بھول کر کھانے میں جو تفریق کی ہے وہ ابوہریرہ رضی الله عنہ کی حدیث کی وجہ سے ہے، ۵- امام احمد ابوہریرہ رضی الله عنہ کی حدیث کے متعلق کہتے ہیں کہ اگر امام یہ سمجھ کر کہ اس کی نماز پوری ہو چکی ہے کوئی بات کر لے پھر اسے معلوم ہو کہ اس کی نماز پوری نہیں ہوئی ہے تو وہ اپنی نماز پوری کر لے، اور جو امام کے پیچھے مقتدی ہو اور بات کر لے اور یہ جانتا ہو کہ ابھی کچھ نماز اس کے ذمہ باقی ہے تو اس پر لازم ہے کہ وہ اسے دوبارہ پڑھے، انہوں نے اس بات سے دلیل پکڑی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں فرائض کم یا زیادہ کئے جا سکتے تھے۔ اور ذوالیدین رضی الله عنہ نے جو بات کی تھی تو وہ محض اس وجہ سے کہ انہیں یقین تھا کہ نماز کامل ہو چکی ہے اور اب کسی کے لیے اس طرح بات کرنا جائز نہیں جو ذوالیدین کے لیے جائز ہو گیا تھا، کیونکہ اب فرائض میں کمی بیشی نہیں ہو سکتی ۱؎، ۶- احمد کا قول بھی کچھ اسی سے ملتا جلتا ہے، اسحاق بن راہویہ نے بھی اس باب میں احمد جیسی بات کہی ہے۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 252
			}
		}
	]
}