{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"3": "The Book on Al-Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 481,
			"arabicnumber": 481,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ ام سلیم رضی الله عنہا نے نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر عرض کیا کہ مجھے کچھ ایسے کلمات سکھا دیجئیے جنہیں میں نماز ۱؎ میں کہا کروں، آپ نے فرمایا: ”دس بار «الله أكبر» کہو، دس بار «سبحان الله» کہو، دس بار «الحمد لله» کہو، پھر جو چاہو مانگو، وہ ( اللہ ) ہر چیز پر ہاں، ہاں کہتا ہے“، ( یعنی قبول کرتا ہے ) ۔ امام ترمذی کہتے ہیں: ۱- انس رضی الله عنہ کی حدیث حسن غریب ہے، ۲- اس باب میں ابن عباس، عبداللہ بن عمرو، فضل بن عباس اور ابورافع رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- صلاۃ التسبیح کے سلسلے میں نبی اکرم صلی اللہ علیہ وسلم سے اور بھی کئی حدیثیں مروی ہیں لیکن کوئی زیادہ صحیح نہیں ہیں، ۴- ابن مبارک اور دیگر کئی اہل علم صلاۃ التسبیح کے قائل ہیں اور انہوں نے اس کی فضیلت کا ذکر کیا ہے، ۵- ابو وہب محمد بن مزاحم العامری نے بیان کیا کہ میں نے عبداللہ بن مبارک سے صلاۃ التسبیح کے بارے میں پوچھا کہ جس میں تسبیح پڑھی جاتی ہے، تو انہوں نے کہا: پہلے تکبیر تحریمہ کہے، پھر «سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك» ”اے اللہ! تیری ذات پاک ہے، اے اللہ تو ہر عیب اور ہر نقص سے پاک ہے سب تعریفیں تیرے ہی لیے ہیں، بابرکت ہے تیرا نام، بلند ہے تیری شان اور تیرے سوا کوئی معبود برحق نہیں“ کہے، پھر پندرہ مرتبہ «سبحان الله والحمد لله ولا إله إلا الله والله أكبر» کہے، پھر «أعوذ بالله من الشيطان الرجيم» ”اور «بسم الله الرحمن الرحيم» کہے، پھر سورۃ فاتحہ اور کوئی سورۃ پڑھے، پھر دس مرتبہ «سبحان الله والحمد لله ولا إله إلا الله والله أكبر» کہے، پھر رکوع میں جائے اور دس مرتبہ یہی کلمات کہے، پھر سر اٹھائے اور دس مرتبہ یہی کلمات کہے، پھر سجدہ کرے دس بار یہی کلمات کہے پھر سجدے سے اپنا سر اٹھائے اور دس بار یہی کلمات کہے، پھر دوسرا سجدہ کرے اور دس بار یہی کلمات کہے، اس طرح سے وہ چاروں رکعتیں پڑھے، تو ہر رکعت میں یہ کل ۷۵ تسبیحات ہوں گی۔ ہر رکعت کے شروع میں پندرہ تسبیحیں کہے گا، پھر دس دس کہے گا، اور اگر وہ رات کو نماز پڑھ رہا ہو تو میرے نزدیک مستحب ہے کہ وہ ہر دو رکعت کے بعد سلام پھیرے اور اگر دن میں پڑھے تو چاہے تو ( دو رکعت کے بعد ) سلام پھیرے اور چاہے تو نہ پھیرے۔ ابو وہب وہب بن زمعہ سے روایت ہے کہ عبدالعزیز بن ابی رزمہ کہتے ہیں کہ عبداللہ بن مبارک نے کہا: رکوع میں پہلے «سبحان ربي العظيم» اور سجدہ میں پہلے «سبحان ربي الأعلى» تین تین بار کہے، پھر تسبیحات پڑھے۔ عبدالعزیز ہی ابن ابی رزمہ کہتے ہیں کہ میں نے عبداللہ بن مبارک سے پوچھا: اگر اس نماز میں سہو ہو جائے تو کیا وہ سجدہ سہو میں دس دس تسبیحیں کہے گا؟ انہوں نے کہا: نہیں یہ صرف تین سو تسبیحات ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		}
	]
}