{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ ہم نبی اکرم صلی اللہ علیہ وسلم کے ساتھ مدینہ سے مکہ کے لیے نکلے۔ آپ نے دو رکعتیں پڑھیں، یحییٰ بن ابی اسحاق کہتے ہیں کہ میں نے انس رضی الله عنہ سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم مکہ میں کتنے دن رہے، انہوں نے کہا دس دن ۱؎۔ امام ترمذی کہتے ہیں: ۱- انس رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عباس اور جابر رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اور ابن عباس رضی الله عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے کہ آپ اپنے سفر میں انیس دن ٹھہرے اور دو رکعتیں ادا کرتے رہے۔ ابن عباس کہتے ہیں، چنانچہ جب ہم انیس دن یا اس سے کم ٹھہرتے تو دو رکعتیں پڑھتے۔ اور اگر اس سے زیادہ ٹھہرتے تو پوری پڑھتے، ۴- علی رضی الله عنہ سے مروی ہے کہ انہوں نے کہا: جو دس دن ٹھہرے وہ پوری نماز پڑھے، ۵- ابن عمر رضی الله عنہما سے مروی ہے کہ انہوں نے کہا: جو پندرہ دن قیام کرے وہ پوری نماز پڑھے۔ اور ان سے بارہ دن کا قول بھی مروی ہے، ۶- سعید بن مسیب سے مروی ہے کہ انہوں نے کہا: جب چار دن قیام کرے تو چار رکعت پڑھے۔ ان سے اسے قتادہ اور عطا خراسانی نے روایت کیا ہے، اور داود بن ابی ہند نے ان سے اس کے خلاف روایت کیا ہے، ۷- اس کے بعد اس مسئلہ میں اہل علم میں اختلاف ہو گیا۔ سفیان ثوری اور اہل کوفہ پندرہ دن کی تحدید کی طرف گئے اور ان لوگوں نے کہا کہ جب وہ پندرہ دن ٹھہرنے کی نیت کر لے تو پوری نماز پڑھے، ۸- اوزاعی کہتے ہیں: جب وہ بارہ دن ٹھہرنے کی نیت کرے تو نماز پوری پڑھے، ۹- مالک بن انس، شافعی، اور احمد کہتے ہیں: جب چار دن ٹھہرنے کی نیت کرے تو نماز پوری پڑھے، ۱۰- اور اسحاق بن راہویہ کی رائے ہے کہ سب سے قوی مذہب ابن عباس کی حدیث ہے، اس لیے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے، پھر یہ کہ نبی اکرم صلی اللہ علیہ وسلم کے بعد وہ اس پر عمل پیرا رہے جب وہ انیس دن ٹھہرتے تو نماز پوری پڑھتے۔ پھر اہل علم کا اجماع اس بات پر ہو گیا کہ مسافر جب تک قیام کی نیت نہ کرے وہ قصر کرتا رہے، اگرچہ اس پر کئی سال گزر جائیں ۲؎۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		}
	]
}