{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے سورج گرہن کی نماز پڑھی تو آپ نے قرأت کی، پھر رکوع کیا، پھر قرأت کی پھر رکوع کیا، پھر قرأت کی پھر رکوع کیا، تین بار قرأت کی اور تین بار رکوع کیا، پھر دو سجدے کئے، اور دوسری رکعت بھی اسی طرح تھی۔ امام ترمذی کہتے ہیں: ۱- ابن عباس رضی الله عنہما کی حدیث حسن صحیح ہے، ۲- اس باب میں علی، عائشہ، عبداللہ بن عمرو، نعمان بن بشیر، مغیرہ بن شعبہ، ابومسعود، ابوبکرہ، سمرہ، ابوموسیٰ اشعری، ابن مسعود، اسماء بنت ابی بکر صدیق، ابن عمر، قبیصہ ہلالی، جابر بن عبداللہ، عبدالرحمٰن بن سمرہ، اور ابی بن کعب رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- ابن عباس رضی الله عنہما نے نبی اکرم صلی اللہ علیہ وسلم سے یوں بھی روایت کی ہے کہ آپ نے سورج گرہن کی نماز میں چار سجدوں میں چار رکوع کیے، شافعی، احمد اور اسحاق بن راہویہ اسی کے قائل ہیں، ۴- سورج گرہن کی نماز میں اہل علم کا اختلاف ہے: بعض اہل علم کی رائے ہے کہ دن میں قرأت سری کرے گا۔ بعض کی رائے ہے کہ عیدین اور جمعہ کی طرح اس میں بھی جہری قرأت کرے گا۔ یہی مالک، احمد اور اسحاق بن راہویہ بھی کہتے ہیں کہ اس میں جہری قرأت کرے۔ اور شافعی کہتے ہیں کہ جہر نہیں کرے گا۔ اور نبی اکرم صلی اللہ علیہ وسلم سے دونوں ہی قسم کی احادیث آئی ثابت ہیں۔ آپ سے یہ بھی ثابت ہے کہ آپ نے چار سجدوں میں چار رکوع کیے۔ اور یہ بھی ثابت ہے کہ آپ نے چار سجدوں میں چھ رکوع کیے۔ اور یہ اہل علم کے نزدیک گرہن کی مقدار کے مطابق ہے اگر گرہن لمبا ہو جائے تو چار سجدوں میں چھ رکوع کرے، یہ بھی جائز ہے، اور اگر چار سجدوں میں چار ہی رکوع کرے اور قرأت لمبی کر دے تو بھی جائز ہے، ہمارے اصحاب الحدیث کا خیال ہے کہ گرہن کی نماز جماعت کے ساتھ پڑھے خواہ گرہن سورج کا ہو یا چاند کا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		}
	]
}