{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"7": "The Book on Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 621,
			"arabicnumber": 621,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ کی دستاویز تحریر کرائی، ابھی اسے عمال کے پاس روانہ بھی نہیں کر سکے تھے کہ آپ کی وفات ہو گئی، اور اسے آپ نے اپنی تلوار کے پاس رکھ دیا ۱؎، آپ وفات فرما گئے تو ابوبکر رضی الله عنہ اس پر عمل پیرا رہے یہاں تک کہ وہ بھی فوت ہو گئے، ان کے بعد عمر رضی الله عنہ بھی اسی پر عمل پیرا رہے، یہاں تک کہ وہ بھی فوت ہو گئے، اس کتاب میں تحریر تھا: ”پانچ اونٹوں میں، ایک بکری زکاۃ ہے۔ دس میں دو بکریاں، پندرہ میں تین بکریاں اور بیس میں چار بکریاں ہیں۔ پچیس سے لے کر پینتیس تک میں ایک سال کی اونٹنی کی زکاۃ ہے، جب اس سے زیادہ ہو جائیں تو پینتالیس تک میں دو سال کی اونٹنی کی زکاۃ ہے۔ اور جب اس سے زیادہ ہو جائیں تو ساٹھ تک میں تین سال کی ایک اونٹنی کی زکاۃ ہے۔ اور جب اس سے زیادہ ہو جائیں تو پچہتر تک میں چار سال کی ایک اونٹنی کی زکاۃ ہے اور جب اس سے زیادہ ہو جائیں تو نوے تک میں دو سال کی دو اونٹوں کی زکاۃ ہے۔ اور جب اس سے زیادہ ہو جائیں تو ان میں ایک سو بیس تک تین سال کی دو اونٹوں کی زکاۃ ہے۔ جب ایک سو بیس سے زائد ہو جائیں تو ہر پچاس میں تین سال کی ایک اونٹنی اور ہر چالیس میں دو سال کی ایک اونٹنی زکاۃ میں دینی ہو گی۔ اور بکریوں کے سلسلہ میں اس طرح تھا: چالیس بکریوں میں ایک بکری کی زکاۃ ہے، ایک سو بیس تک، اور جب اس سے زیادہ ہو جائیں تو دو سو تک میں دو بکریوں کی زکاۃ ہے، اور جب اس سے زیادہ ہو جائیں تو تین سو تک میں تین بکریوں کی زکاۃ ہے۔ اور جب تین سو سے زیادہ ہو جائیں تو پھر ہر سو پر ایک بکری کی زکاۃ ہے۔ پھر اس میں کچھ نہیں یہاں تک کہ وہ چار سو کو پہنچ جائیں، اور ( زکاۃ والے ) متفرق ( مال ) کو جمع نہیں کیا جائے گا ۲؎ اور جو مال جمع ہو اسے صدقے کے خوف سے متفرق نہیں کیا جائے گا ۳؎ اور جن میں دو ساجھی دار ہوں ۴؎ تو وہ اپنے اپنے حصہ کی شراکت کے حساب سے دیں گے۔ صدقے میں کوئی بوڑھا اور عیب دار جانور نہیں لیا جائے گا“۔ زہری کہتے ہیں: جب صدقہ وصول کرنے والا آئے تو وہ بکریوں کو تین حصوں میں تقسیم کرے، پہلی تہائی بہتر قسم کی ہو گی، دوسری تہائی اوسط درجے کی اور تیسری تہائی خراب قسم کی ہو گی، پھر صدقہ وصول کرنے والا اوسط درجے والی بکریوں میں سے لے۔ زہری نے گائے کا ذکر نہیں کیا۔ امام ترمذی کہتے ہیں: ۱- ابن عمر کی حدیث حسن ہے، ۲- یونس بن یزید اور دیگر کئی لوگوں نے بھی یہ حدیث زہری سے، اور زہری نے سالم سے روایت کی ہے، اور ان لوگوں نے اسے مرفوع بیان نہیں کیا۔ صرف سفیان بن حسین ہی نے اسے مرفوعاً روایت کیا ہے، ۳- اور اسی پر عام فقہاء کا عمل ہے، ۴- اس باب میں ابوبکر صدیق بہز بن حکیم عن أبیہ عن جدہ معاویۃ بن حیدۃ قشیری ہے ابوذر اور انس رضی الله عنہما سے بھی احادیث آئی ہیں۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 5
			}
		}
	]
}