{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص نے آ کر کہا: اللہ کے رسول! میں ہلاک ہو گیا، آپ نے پوچھا: ”تمہیں کس چیز نے ہلاک کر دیا؟“ اس نے عرض کیا: میں رمضان میں اپنی بیوی سے صحبت کر بیٹھا۔ آپ نے پوچھا: ”کیا تم ایک غلام یا لونڈی آزاد کر سکتے ہو؟“ اس نے کہا: نہیں، آپ نے پوچھا: ”کیا مسلسل دو ماہ کے روزے رکھ سکتے ہو؟“ اس نے کہا: نہیں، تو آپ نے پوچھا: ”کیا ساٹھ مسکین کو کھانا کھلا سکتے ہو؟“ اس نے کہا: نہیں، تو آپ نے فرمایا: ”بیٹھ جاؤ“ تو وہ بیٹھ گیا۔ اتنے میں آپ صلی اللہ علیہ وسلم کے پاس ایک بڑا ٹوکرہ لایا گیا جس میں کھجوریں تھیں، آپ نے فرمایا: ”اسے لے جا کر صدقہ کر دو“، اس نے عرض کیا: ان دونوں ملے ہوئے علاقوں کے درمیان کی بستی ( یعنی مدینہ میں ) مجھ سے زیادہ محتاج کوئی نہیں ہے۔ نبی اکرم صلی اللہ علیہ وسلم ہنس پڑے، یہاں تک کہ آپ کے سامنے کے ساتھ والے دانت دکھائی دینے لگے۔ آپ نے فرمایا: ”اسے لے لو اور لے جا کر اپنے گھر والوں ہی کو کھلا دو“۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابن عمر، عائشہ اور عبداللہ بن عمرو رضی الله عنہم سے بھی احادیث آئی ہیں، ۳- اہل علم کا اس شخص کے بارے میں جو رمضان میں جان بوجھ کر بیوی سے جماع کر کے روزہ توڑ دے، اسی حدیث پر عمل ہے، ۴- اور جو جان بوجھ کر کھا پی کر روزہ توڑے، تو اس کے بارے میں اہل علم میں اختلاف ہے۔ بعض کہتے ہیں: اس پر روزے کی قضاء اور کفارہ دونوں لازم ہے، ان لوگوں نے کھانے پینے کو جماع کے مشابہ قرار دیا ہے۔ سفیان ثوری، ابن مبارک اور اسحاق بن راہویہ اسی کے قائل ہیں۔ بعض کہتے ہیں: اس پر صرف روزے کی قضاء لازم ہے، کفارہ نہیں۔ اس لیے کہ نبی اکرم صلی اللہ علیہ وسلم سے جو کفارہ مذکور ہے وہ جماع سے متعلق ہے، کھانے پینے کے بارے میں آپ سے کفارہ مذکور نہیں ہے، ان لوگوں نے کہا ہے کہ کھانا پینا جماع کے مشابہ نہیں ہے۔ یہ شافعی اور احمد کا قول ہے۔ شافعی کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم کا اس شخص سے جس نے روزہ توڑ دیا، اور آپ نے اس پر صدقہ کیا یہ کہنا کہ ”اسے لے لو اور لے جا کر اپنے گھر والوں ہی کو کھلا دو“، کئی باتوں کا احتمال رکھتا ہے: ایک احتمال یہ بھی ہے کہ کفارہ اس شخص پر ہو گا جو اس پر قادر ہو، اور یہ ایسا شخص تھا جسے کفارہ دینے کی قدرت نہیں تھی، تو جب نبی اکرم صلی اللہ علیہ وسلم نے اسے کچھ دیا اور وہ اس کا مالک ہو گیا تو اس آدمی نے عرض کیا: ہم سے زیادہ اس کا کوئی محتاج نہیں۔ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اسے لے لو اور جا کر اپنے گھر والوں ہی کو کھلا دو“، اس لیے کہ روزانہ کی خوراک سے بچنے کے بعد ہی کفارہ لازم آتا ہے، تو جو اس طرح کی صورت حال سے گزر رہا ہو اس کے لیے شافعی نے اسی بات کو پسند کیا ہے کہ وہی اسے کھا لے اور کفارہ اس پر فرض رہے گا، جب کبھی وہ مالدار ہو گا تو کفارہ ادا کرے گا۔",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		}
	]
}