{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"10": "The Book of Leading the Prayer (Al-Imamah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 777,
			"arabicnumber": 777,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو انصار کہنے لگے: ایک امیر ہم ( انصار ) میں سے ہو گا اور ایک امیر تم ( مہاجرین ) میں سے، تو عمر رضی اللہ عنہ ان کے پاس آئے، اور کہا: کیا تم لوگوں کو معلوم نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ کو لوگوں کو نماز پڑھانے کا حکم دیا ہے ۱؎، تو اب بتاؤ ابوبکر رضی اللہ عنہ سے آگے بڑھنے پر تم میں سے کس کا جی خوش ہو گا؟ ۲؎ تو لوگوں نے کہا: ہم ابوبکر رضی اللہ عنہ سے آگے بڑھنے پر اللہ کی پناہ مانگتے ہیں ۳؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": 778,
			"text": "ابوالعالیہ البراء کہتے ہیں کہ زیاد نے نماز میں دیر کر دی تو میرے پاس ( عبداللہ ابن صامت ) ابن صامت آئے میں نے ان کے لیے ایک کرسی لا کر رکھی، وہ اس پہ بیٹھے، میں نے ان سے زیاد کی کارستانیوں کا ذکر کیا، تو انہوں نے اپنے دونوں ہونٹوں کو بھینچا ۱؎ اور میری ران پر ہاتھ مارا، اور کہا: میں نے بھی ابوذر رضی اللہ عنہ سے اسی طرح پوچھا جس طرح تم نے مجھ سے پوچھا ہے، تو انہوں نے میری ران پہ ہاتھ مارا جس طرح میں نے تیری ران پہ مارا ہے، اور کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم سے اسی طرح پوچھا ہے، جس طرح تم نے مجھ سے پوچھا ہے تو آپ نے تمہاری ران پہ ہاتھ مارا جس طرح میں نے تمہاری ران پہ مارا ہے، اور فرمایا: نماز اس کے وقت پر پڑھ لیا کرو، اور اگر تم ان کے ساتھ نماز کا وقت پاؤ تو ان کے ساتھ بھی پڑھ لو، اور یہ نہ کہو کہ میں نے نماز پڑھ لی ہے، لہٰذا اب نہیں پڑھوں گا ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": 779,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عنقریب تم کچھ ایسے لوگوں کو پاؤ گے جو نماز کو بے وقت کر کے پڑھیں گے، تو اگر تم ایسے لوگوں کو پاؤ تو تم اپنی نماز وقت پر پڑھ لیا کرو، اور ان کے ساتھ بھی پڑھ لیا کرو ۱؎ اور اسے سنت ( نفل ) بنا لو ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": 780,
			"text": "ابومسعود (عقبہ بن عمرو) رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگوں کی امامت وہ کرے جسے اللہ کی کتاب ( قرآن مجید ) سب سے زیادہ یاد ہو، اور سب سے اچھا پڑھتا ہو ۱؎، اور اگر قرآن پڑھنے میں سب برابر ہوں تو جس نے ان میں سے سب پہلے ہجرت کی ہے وہ امامت کرے، اور اگر ہجرت میں بھی سب برابر ہوں تو جو سنت کا زیادہ جاننے والا ہو وہ امامت کرے ۲؎، اور اگر سنت ( کے جاننے ) میں بھی برابر ہوں تو جو ان میں عمر میں سب سے بڑا ہو وہ امامت کرے، اور تم ایسی جگہ آدمی کی امامت نہ کرو جہاں اس کی سیادت و حکمرانی ہو، اور نہ تم اس کی مخصوص جگہ ۳؎ پر بیٹھو، إلا یہ کہ وہ تمہیں اجازت دیدے ۴؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": 781,
			"text": "مالک بن حویرث رضی اللہ عنہ کہتے ہیں کہ میں اور میرے ایک چچازاد بھائی ( اور کبھی انہوں ) نے کہا: میں اور میرے ایک ساتھی، دونوں رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم دونوں سفر کرو تو تم دونوں اذان اور اقامت کہو، اور تم میں سے جو بڑا ہو وہ امامت کرے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": 782,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تین شخص ہوں تو ان میں سے ایک کو امامت کرنی چاہیئے، اور ان میں امامت کا زیادہ حقدار وہ ہے جسے قرآن زیادہ یاد ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": 783,
			"text": "ابومسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: آدمی کی امامت ایسی جگہ نہ کی جائے جہاں اس کی سیادت و حکمرانی ہو، اور بغیر اجازت اس کی مخصوص نشست گاہ پر نہ بیٹھا جائے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": 784,
			"text": "سہل بن سعد رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو یہ بات پہنچی کہ بنی عمرو بن عوف کے لوگوں میں کچھ اختلاف ہو گیا ہے تو رسول اللہ صلی اللہ علیہ وسلم اپنے ساتھ کچھ لوگوں کو لے کر نکلے تاکہ آپ ان میں صلح کرا دیں، تو رسول اللہ صلی اللہ علیہ وسلم اسی معاملہ میں مشغول رہے یہاں تک کہ ظہر کا وقت آپ پہنچا ۱؎ تو بلال رضی اللہ عنہ ابوبکر رضی اللہ عنہ کے پاس آئے، اور کہنے لگے: ابوبکر! رسول اللہ صلی اللہ علیہ وسلم ( ابھی تک ) نہیں آ سکے ہیں، اور نماز کا وقت ہو چکا ہے تو کیا آپ لوگوں کی امامت کر دیں گے؟ انہوں نے کہا: ہاں کر دوں گا اگر تم چاہو، چنانچہ بلال رضی اللہ عنہ نے تکبیر کہی تو ابوبکر رضی اللہ عنہ آگے بڑھے، اور اللہ اکبر کہہ کر لوگوں کو نماز پڑھانی شروع کر دی، اسی دوران رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے، اور آپ صفوں میں چلتے ہوئے آئے یہاں تک کہ ( پہلی ) صف میں آ کر کھڑے ہو گئے، اور ( رسول اللہ صلی اللہ علیہ وسلم کو دیکھ کر ) لوگ تالیاں بجانے لگے، اور ابوبکر رضی اللہ عنہ اپنی نماز میں ادھر ادھر متوجہ نہیں ہوتے تھے، تو جب لوگوں نے کثرت سے تالیاں بجائیں تو وہ متوجہ ہوئے، تو کیا دیکھتے ہیں کہ آپ صلی اللہ علیہ وسلم موجود ہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں اشارے سے حکم دیا کہ وہ نماز پڑھائیں، اس پر ابوبکر رضی اللہ عنہ نے اپنے ہاتھوں کو اٹھا کر اللہ تعالیٰ کا شکر ادا کیا، پھر وہ الٹے پاؤں اپنے پیچھے لوٹ کر صف میں کھڑے ہو گئے، تو رسول اللہ صلی اللہ علیہ وسلم آگے بڑھے اور جا کر لوگوں کو نماز پڑھائی، اور جب آپ نماز سے فارغ ہوئے تو لوگوں کو مخاطب کر کے فرمایا: لوگو! تمہیں کیا ہو گیا ہے؟ جب تمہیں نماز میں کوئی بات پیش آتی ہے تو تالیاں بجانے لگتے ہو حالانکہ تالی بجانا عورتوں کے لیے مخصوص ہے، جسے اس کی نماز میں کوئی بات پیش آئے وہ سبحان اللہ کہے، کیونکہ جب کوئی سبحان اللہ کہے گا تو جو بھی اسے سنے گا اس کی طرف ضرور متوجہ ہو گا ( پھر آپ ابوبکر رضی اللہ عنہ کی طرف متوجہ ہوئے ) اور فرمایا: ابوبکر! جب میں نے تمہیں اشارہ کر دیا تھا تو تم نے لوگوں کو نماز کیوں نہیں پڑھائی؟ ، تو ابوبکر رضی اللہ عنہ نے جواب دیا؟ ابوقحافہ کے بیٹے کو یہ زیب نہیں دیتا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے نماز پڑھائے ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": 785,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ لوگوں کے ساتھ رسول اللہ صلی اللہ علیہ وسلم کی آخری نماز وہ تھی جسے آپ نے ابوبکر رضی اللہ عنہ کے پیچھے ایک کپڑے میں اس حال میں پڑھی تھی کہ اس کے دونوں کنارے بغل سے نکال کر آپ کندھے پر ڈالے ہوئے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": 786,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ ابوبکر رضی اللہ عنہ نے لوگوں کو نماز پڑھائی، اور رسول اللہ صلی اللہ علیہ وسلم صف میں تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": 787,
			"text": "مالک بن حویرث رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے سنا ہے: جب تم میں سے کوئی کسی قوم کی زیارت کے لیے جائے تو وہ انہیں ہرگز نماز نہ پڑھائے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": 788,
			"text": "محمود بن ربیع سے روایت ہے کہ عتبان بن مالک رضی اللہ عنہ اپنے قبیلہ کی امامت کرتے تھے اور وہ نابینا تھے، تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا: رات میں تاریکی ہوتی ہے اور کبھی بارش ہوتی ہے اور راستے پانی میں بھر جاتا ہے، اور میں آنکھوں کا اندھا آدمی ہوں، تو اللہ کے رسول! آپ میرے گھر میں کسی جگہ نماز پڑھ دیجئیے تاکہ میں اسے مصلیٰ بنا لوں! تو رسول اللہ صلی اللہ علیہ وسلم آئے، اور آپ نے پوچھا: تم کہاں نماز پڑھوانی چاہتے ہو؟ انہوں نے گھر میں ایک جگہ کی طرف اشارہ کیا، تو رسول اللہ صلی اللہ علیہ وسلم نے اس جگہ میں نماز پڑھی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": 789,
			"text": "عمرو بن سلمہ جرمی رضی اللہ عنہ کہتے ہیں کہ ہمارے پاس سے قافلے گزرتے تھے تو ہم ان سے قرآن سیکھتے تھے ( جب ) میرے والد نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے امامت وہ آدمی کرے جسے قرآن زیادہ یاد ہو ، تو جب میرے والد لوٹ کر آئے تو انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: تم میں سے امامت وہ آدمی کرے جسے قرآن زیادہ یاد ہو ، تو لوگوں نے نگاہ دوڑائی تو ان میں سب سے بڑا قاری میں ہی تھا، چنانچہ میں ہی ان کی امامت کرتا تھا، اور اس وقت میں آٹھ سال کا بچہ تھا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": 790,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب نماز کے لیے اذان دی جائے، تو جب تک مجھے دیکھ نہ لو کھڑے نہ ہوا کرو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": 791,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ نماز کے لیے اقامت کہی جا چکی تھی، اور رسول اللہ صلی اللہ علیہ وسلم ایک شخص سے راز داری کی باتیں کر رہے تھے، تو آپ نماز کے لیے کھڑے نہیں ہوئے یہاں تک کہ لوگ سونے لگے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": 792,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نماز کے لیے اقامت کہی گئی، تو لوگوں نے اپنی صفیں درست کیں، اور رسول اللہ صلی اللہ علیہ وسلم حجرے سے نکل کر نماز پڑھنے کی جگہ پر آ کر کھڑے ہوئے، پھر آپ کو یاد آیا کہ غسل نہیں کیا ہے ۱؎ تو آپ نے لوگوں سے فرمایا: تم اپنی جگہوں پر رہو ، پھر آپ واپس اپنے گھر گئے پھر نکل کر ہمارے پاس آئے، اور آپ کے سر سے پانی ٹپک رہا تھا، اور ہم صف باندھے کھڑے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": 793,
			"text": "سہل بن سعد رضی اللہ عنہ کہتے ہیں کہ قبیلہ بنی عمرو بن عوف میں آپس میں لڑائی ہوئی، یہ خبر نبی اکرم صلی اللہ علیہ وسلم کے پاس پہنچی تو آپ نے ظہر پڑھی، پھر ان کے پاس آئے تاکہ ان میں صلح کرا دیں، اور بلال رضی اللہ عنہ سے فرمایا: بلال! جب عصر کا وقت آ جائے اور میں نہ آ سکوں تو ابوبکر سے کہنا کہ وہ لوگوں کو نماز پڑھا دیں ، چنانچہ جب عصر کا وقت آیا، تو بلال رضی اللہ عنہ نے اذان دی، پھر اقامت کہی، اور ابوبکر رضی اللہ عنہ سے کہا: آگے بڑھیے، تو ابوبکر رضی اللہ عنہ آگے بڑھے، اور نماز پڑھانے لگے، اتنے میں رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے، اور لوگوں کو چیرتے ہوئے آگے آئے ۱؎ یہاں تک کہ ابوبکر رضی اللہ عنہ کے پیچھے آ کر کھڑے ہو گئے، تو لوگوں نے تالیاں بجانی شروع کر دیں، اور ابوبکر رضی اللہ عنہ کا حال یہ تھا کہ جب وہ نماز شروع کر دیتے تو کسی اور طرف متوجہ نہیں ہوتے، مگر جب انہوں نے دیکھا کہ برابر تالی بج رہی ہے تو وہ متوجہ ہوئے، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کی طرف اپنے ہاتھ سے اشارہ کیا کہ تم نماز جاری رکھو ، تو اس بات پر انہوں نے اللہ تعالیٰ کا شکر ادا کیا، پھر وہ اپنی ایڑیوں کے بل الٹے چل کر پیچھے آ گئے، جب رسول اللہ صلی اللہ علیہ وسلم نے یہ دیکھا تو آپ نے آگے بڑھ کر لوگوں کو نماز پڑھائی، پھر جب اپنی نماز پوری کر چکے تو آپ نے فرمایا: ابوبکر! جب میں نے تمہیں اشارہ کر دیا تھا تو تم نے نماز کیوں نہیں پڑھائی؟ تو انہوں نے عرض کیا: ابوقحافہ کے بیٹے کو یہ بات زیب نہیں دیتی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی امامت کرے، پھر آپ صلی اللہ علیہ وسلم نے لوگوں سے فرمایا: جب تمہیں نماز کے اندر کوئی بات پیش آ جائے، تو مرد سبحان اللہ کہیں، اور عورتیں تالی بجائیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 794,
			"arabicnumber": 794,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم گھوڑے سے اپنے داہنے پہلو پر گر پڑے، تو لوگ آپ کی عیادت کرنے آئے، اور نماز کا وقت آپ پہنچا، جب آپ نے نماز پوری کر لی تو فرمایا: امام بنایا ہی اس لیے گیا ہے کہ اس کی اقتداء کی جائے، جب وہ رکوع کرے تو تم بھی رکوع کرو، اور جب وہ سر اٹھائے تو تم بھی سر اٹھاؤ، اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو، اور جب وہ «سمع اللہ لمن حمده» کہے تو تم «ربنا لك الحمد» کہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": 795,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنے صحابہ میں پیچھے رہنے کا عمل دیکھا تو آپ نے فرمایا: تم لوگ آگے آؤ اور میری اقتداء کرو، اور جو تمہارے بعد ہیں وہ تمہاری اقتداء کریں، یاد رکھو کچھ لوگ برابر ( اگلی صفوں سے ) پیچھے رہتے ہیں یہاں تک کہ اللہ تعالیٰ بھی انہیں ( اپنی رحمت سے یا اپنی جنت سے ) پیچھے کر دیتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": 796,
			"text": "اس سند سے بھی ابونضرہ سے اسی جیسی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": 797,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ کو حکم دیا کہ وہ لوگوں کو نماز پڑھائیں، نبی اکرم صلی اللہ علیہ وسلم ابوبکر رضی اللہ عنہ کے آگے تھے، تو آپ صلی اللہ علیہ وسلم نے بیٹھ کر نماز پڑھائی، اور ابوبکر رضی اللہ عنہ لوگوں کو نماز پڑھا رہے تھے، اور لوگ ابوبکر رضی اللہ عنہ کے پیچھے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": 798,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ظہر کی نماز پڑھائی، اور ابوبکر رضی اللہ عنہ آپ کے پیچھے تھے، جب رسول اللہ صلی اللہ علیہ وسلم اللہ اکبر کہتے، تو ابوبکر رضی اللہ عنہ بھی اللہ اکبر کہتے، وہ ہمیں ( آپ کی تکبیر ) سنا رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": 799,
			"text": "اسود اور علقمہ دونوں کہتے ہیں کہ ہم دوپہر میں عبداللہ بن مسعود رضی اللہ عنہ کے پاس آئے، تو انہوں نے کہا: عنقریب امراء نماز کے وقت سے غافل ہو جائیں گے، تو تم لوگ نمازوں کو ان کے وقت پر ادا کرنا، پھر وہ اٹھے اور میرے اور ان کے درمیان کھڑے ہو کر نماز پڑھائی، پھر کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح کرتے ہوئے دیکھا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": 800,
			"text": "فروہ اسلمی کے غلام مسعود بن ھبیرۃ رضی اللہ عنہ کہتے ہیں کہ میرے پاس سے رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ گزرے، تو ابوبکر رضی اللہ عنہ نے مجھ سے کہا: مسعود! تم ابوتمیم یعنی اپنے مالک کے پاس جاؤ، اور ان سے کہو کہ وہ ہمیں سواری کے لیے ایک اونٹ دے دیں، اور ہمارے لیے کچھ زاد راہ اور ایک رہبر بھیج دیں جو ہماری رہنمائی کرے، تو میں نے اپنے مالک کے پاس آ کر انہیں یہ بات بتائی تو انہوں نے میرے ساتھ ایک اونٹ اور ایک کُپّا دودھ بھیجا، میں انہیں لے کر خفیہ راستوں سے چھپ چھپا کر چلا تاکہ کافروں کو پتہ نہ چل سکے، جب نماز کا وقت آیا تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہو کر نماز پڑھنے لگے، اور ابوبکر رضی اللہ عنہ آپ کے دائیں طرف کھڑے ہوئے، ان دونوں کے ساتھ رہ کر میں نے اسلام سیکھ لیا تھا، تو میں آ کر ان دونوں کے پیچھے کھڑا ہو گیا، رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ کے سینے پر ہاتھ رکھ کر انہیں پیچھے کی طرف ہٹایا، تو ( وہ آ کر ہم سے مل گئے اور ) ہم دونوں آپ کے پیچھے کھڑے ہو گئے۔ ابوعبدالرحمٰن نسائی کہتے ہیں: یہ بریدہ بن سفیان حدیث میں قوی نہیں ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": 801,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ان کی دادی ملیکہ نے رسول اللہ صلی اللہ علیہ وسلم کو کھانے پر مدعو کیا جسے انہوں نے آپ کے لیے تیار کیا تھا، تو آپ صلی اللہ علیہ وسلم نے اس میں سے کچھ کھایا، پھر فرمایا: اٹھو تاکہ میں تمہیں نماز پڑھاؤں ، انس رضی اللہ عنہ کہتے ہیں: تو میں اٹھ کر اپنی ایک چٹائی کی طرف بڑھا جو کافی دنوں سے پڑی رہنے کی وجہ سے کالی ہو گئی تھی، میں نے اس پر پانی چھڑکا، اور اسے آپ کے پاس لا کر بچھایا تو آپ صلی اللہ علیہ وسلم کھڑے ہوئے، اور میں نے اور ایک یتیم نے آپ کے پیچھے صف باندھی، اور بڑھیا ہمارے پیچھے تھی، آپ صلی اللہ علیہ وسلم نے ہمیں دو رکعت نماز پڑھائی پھر واپس تشریف لے گئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": 802,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے، اور اس وقت وہاں صرف میں، میری ماں، ایک یتیم، اور میری خالہ ام حرام تھیں، آپ صلی اللہ علیہ وسلم نے فرمایا: اٹھو تاکہ میں تمہیں نماز پڑھاؤں ، ( یہ کسی نماز کا وقت نہ تھا ) تو آپ صلی اللہ علیہ وسلم نے ہمیں نماز پڑھائی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": 803,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ وہ اور رسول اللہ صلی اللہ علیہ وسلم تھے، اور ان کی ماں اور ان کی خالہ تھیں، تو رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھائی، آپ نے انس رضی اللہ عنہ کو اپنی دائیں جانب کھڑا کیا، اور ان کی ماں اور خالہ دونوں کو اپنے اور انس رضی اللہ عنہ کے پیچھے کھڑا کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے بغل میں نماز پڑھی، ام المؤمنین عائشہ رضی اللہ عنہا ہمارے ساتھ ہمارے پیچھے نماز پڑھ رہی تھیں، اور میں نبی اکرم صلی اللہ علیہ وسلم کے بغل میں آپ کے ساتھ نماز پڑھ رہا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": 805,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے اور میرے گھر کی ایک عورت کو نماز پڑھائی، تو آپ نے مجھے اپنی داہنی جانب کھڑا کیا، اور عورت ہمارے پیچھے تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": 806,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ میں نے اپنی خالہ میمونہ رضی اللہ عنہا کے گھر رات گزاری، رسول اللہ صلی اللہ علیہ وسلم رات میں اٹھ کر نماز پڑھنے لگے تو میں بھی آپ کے بائیں جانب کھڑا ہو گیا، تو آپ صلی اللہ علیہ وسلم نے میرے ساتھ اس طرح کیا یعنی آپ نے میرا سر پکڑ کر مجھے اپنی داہنی جانب کھڑا کر لیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": 807,
			"text": "ابومسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز میں ( صف بندی کے وقت ) ہمارے کندھوں پر ہاتھ پھیرتے، اور فرماتے: تم آگے پیچھے نہ کھڑے ہو کہ تمہارے دلوں میں پھوٹ پڑ جائے، اور تم میں سے ہوش مند اور باشعور لوگ مجھ سے قریب رہیں، پھر وہ جو ان سے قریب ہوں، پھر وہ جو ( اس وصف میں ) ان سے قریب ہو ، ابومسعود رضی اللہ عنہ کہتے ہیں: اسی بنا پر تم میں آج اختلافات زیادہ ہیں۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: ابومعمر کا نام عبداللہ بن سخبرہ ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": 808,
			"text": "قیس بن عباد کہتے ہیں کہ میں مسجد میں اگلی صف میں تھا کہ اسی دوران مجھے میرے پیچھے سے ایک شخص نے زور سے کھینچا، اور مجھے ہٹا کر میری جگہ خود کھڑا ہو گیا، تو قسم اللہ کی غصہ کے مارے مجھے اپنی نماز کا ہوش نہیں رہا، جب وہ ( سلام پھیر کر ) پلٹا تو کیا دیکھتا ہوں کہ وہ ابی بن کعب رضی اللہ عنہ ہیں تو انہوں نے مجھے مخاطب کر کے کہا: اے نوجوان! اللہ تجھے رنج و مصیبت سے بچائے! حقیقت میں نبی اکرم صلی اللہ علیہ وسلم سے ہمارا میثاق ( عہد ) ہے کہ ہم ان سے قریب رہیں، پھر وہ قبلہ رخ ہوئے، اور انہوں نے تین بار کہا: رب کعبہ کی قسم! تباہ ہو گئے اہل عقد، پھر انہوں نے کہا: لیکن ہمیں ان پر غم نہیں ہے، بلکہ غم ان پر ہے جو بھٹک گئے ہیں، میں نے پوچھا: اے ابو یعقوب! اہل عقد سے آپ کا کیا مطلب؟ تو انہوں نے کہا: امراء ( حکام ) مراد ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 809,
			"arabicnumber": 809,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نماز کے لیے اقامت کہی گئی تو ہم کھڑے ہوئے، اور صفیں اس سے پہلے کہ رسول اللہ صلی اللہ علیہ وسلم ہماری طرف نکلیں درست کر لی گئیں، پھر رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے یہاں تک کہ جب آپ اپنی نماز پڑھانے کی جگہ پر آ کر کھڑے ہو گئے تو اس سے پہلے کہ کے آپ تکبیر ( تکبیر تحریمہ ) کہیں ہماری طرف پلٹے، اور فرمایا: تم لوگ اپنی جگہوں پہ رہو ، تو ہم برابر کھڑے آپ کا انتظار کرتے رہے یہاں تک کہ آپ ہماری طرف آئے، آپ غسل کئے ہوئے تھے، اور آپ کے سر سے پانی ٹپک رہا تھا، تو آپ نے تکبیر ( تحریمہ ) کہی، اور صلاۃ پڑھائی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": 810,
			"text": "نعمان بن بشیر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم صفیں درست فرماتے تھے جیسے تیر درست کئے جاتے ہیں، آپ نے ایک شخص کو دیکھا جس کا سینہ صف سے باہر نکلا ہوا تھا، تو میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: تم اپنی صفیں ضرور درست کر لیا کرو ورنہ اللہ تعالیٰ تمہارے چہروں کے درمیان اختلاف پیدا فر مادے گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": 811,
			"text": "براء بن عازب رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے کندھوں اور سینوں پر ہاتھ پھیرتے ہوئے ۱؎ صفوں کے بیچ میں سے ایک کنارے سے دوسرے کنارے تک جاتے، اور فرماتے: اختلاف نہ کرو ۲؎ ورنہ تمہارے دل مختلف ہو جائیں ۳؎ نیز فرماتے: اللہ تعالیٰ اگلی صفوں پر اپنی رحمتیں نازل فرماتا ہے، اور اس کے فرشتے اس کے لیے دعائیں کرتے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": 812,
			"text": "ابومسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے مونڈھوں پہ ہاتھ پھیرتے ۱؎ اور فرماتے: صفیں سیدھی رکھو، اختلاف نہ کرو ۲؎ ورنہ تمہارے دلوں میں بھی اختلاف پیدا ہو جائے گا، اور تم میں سے جو ہوش مند اور باشعور ہوں مجھ سے قریب رہیں، پھر ( اس وصف میں ) وہ جو ان سے قریب ہوں، پھر وہ جو ان سے قریب ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": 813,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم فرماتے تھے: برابر ہو جاؤ، برابر ہو جاؤ، برابر ہو جاؤ، قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، میں تمہیں اپنے پیچھے سے بھی اسی طرح دیکھتا ہوں جس طرح تمہیں اپنے سامنے سے دیکھتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": 814,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز کے لیے کھڑے ہوتے تو ہماری طرف متوجہ ہوتے، اور اللہ اکبر کہنے سے پہلے فرماتے: تم اپنی صفیں درست کر لو، اور سیسہ پلائی دیوار کی مانند ہو جاؤ، ۱؎ کیونکہ میں تمہیں اپنی پیٹھ کے پیچھے سے بھی دیکھتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": 815,
			"text": "قتادہ کہتے ہیں کہ ہم سے انس رضی اللہ عنہ نے بیان کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم اپنی صفیں سیسہ پلائی دیوار کی طرح درست کر لو، اور انہیں ایک دوسرے کے نزدیک رکھو، اور گردنیں ایک دوسرے کے بالمقابل رکھو کیونکہ قسم ہے اس ذات کی جس کے ہاتھ میں محمد کی جان ہے، میں شیاطین کو صف کے درمیان ۱؎ گھستے ہوئے دیکھتا ہوں جیسے وہ بکری کے کالے بچے ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": 816,
			"text": "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے اور فرمایا: کیا تم لوگ صف نہیں باندھو گے جس طرح فرشتے اپنے رب کے پاس باندھتے ہیں ، لوگوں نے پوچھا: فرشتے اپنے رب کے پاس کیسے صف باندھتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: وہ پہلے اگلی صف پوری کرتے ہیں، پھر وہ سیسہ پلائی ہوئی دیوار کی طرح صف میں مل کر کھڑے ہوتے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": 817,
			"text": "عرباض بن ساریہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم پہلی صف کے لیے تین بار اور دوسری صف کے لیے ایک بار دعا فرماتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": 818,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پہلے اگلی صف پوری کرو، پھر جو اس سے قریب ہو، اور اگر کچھ کمی رہے تو پچھلی صف میں رہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": 819,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو صف کو جوڑے گا اللہ تعالیٰ اسے جوڑے گا، اور جو صف کو کاٹے گا اللہ تعالیٰ اسے کاٹے گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": 820,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مردوں کی سب سے بہتر صف پہلی صف ہے ۱؎، اور بد تر صف آخری صف ہے ۲؎، اور عورتوں کی سب سے بہتر صف آخری صف ہے ۳؎، اور ان کی سب سے بدتر صف پہلی صف ہے ۴؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": 821,
			"text": "عبدالحمید بن محمود کہتے ہیں کہ ہم انس رضی اللہ عنہ کے ساتھ تھے کہ ہم نے حکام میں سے ایک حاکم کے ساتھ نماز پڑھی، لوگوں نے ہمیں ( بھیڑ کی وجہ سے ) دھکیلا یہاں تک کہ ہم نے دو ستونوں کے درمیان کھڑے ہو کر نماز پڑھی، تو انس رضی اللہ عنہ پیچھے ہٹ گئے اور کہنے لگے: ہم رسول اللہ صلی اللہ علیہ وسلم کے عہد میں اس سے بچتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": 822,
			"text": "براء رضی اللہ عنہ کہتے ہیں کہ جب ہم رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھتے تو میں آپ کے دائیں کھڑا ہونے کو پسند کرتا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": 823,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی لوگوں کو نماز پڑھائے تو ہلکی پڑھائے، کیونکہ ان میں بیمار، کمزور اور بوڑھے لوگ بھی ہوتے ہیں، اور جب کوئی تنہا نماز پڑھے تو جتنی چاہے لمبی کرے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم لوگوں میں سب سے ہلکی اور کامل نماز پڑھتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": 825,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میں نماز میں کھڑا ہوتا ہوں اور بچوں کا رونا سنتا ہوں تو اپنی نماز ہلکی کر دیتا ہوں، اس ڈر سے کہ میں اس کی ماں کو مشقت میں نہ ڈال دوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": 826,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہلکی نماز پڑھانے کا حکم دیتے، اور آپ ہماری امامت سورۃ الصافات سے کرتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": 827,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو لوگوں کی امامت کرتے ہوئے دیکھا، آپ ( اپنی نواسی ) امامہ بنت ابی العاص رضی اللہ عنہا کو اپنے کندھے پر اٹھائے ہوئے تھے، جب آپ رکوع میں جاتے تو اسے اتار دیتے، اور جب سجدہ سے اٹھتے تو اسے دوبارہ اٹھا لیتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": 828,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ محمد صلی اللہ علیہ وسلم نے فرمایا: جو شخص اپنا سر امام سے پہلے اٹھا لیتا ہے کیا وہ ( اس بات سے ) نہیں ڈرتا کہ ۱؎ اللہ اس کا سر گدھے کے سر میں تبدیل نہ کر دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": 829,
			"text": "براء رضی اللہ عنہ (جو جھوٹے نہ تھے ۱؎) سے روایت ہے کہ صحابہ کرام رضی اللہ عنہم جب رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے، اور آپ رکوع سے اپنا سر اٹھاتے تو وہ سیدھے کھڑے رہتے یہاں تک کہ وہ دیکھ لیتے کہ آپ سجدہ میں جا چکے ہیں، پھر وہ سجدہ میں جاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": 830,
			"text": "حطان بن عبداللہ کہتے ہیں کہ ابوموسیٰ اشعری رضی اللہ عنہ نے ہمیں نماز پڑھائی تو جب وہ قعدہ میں گئے تو قوم کا ایک آدمی اندر آیا اور کہنے لگا کہ نماز نیکی اور زکاۃ کے ساتھ ملا دی گئی ہے ۱؎، تو جب ابوموسیٰ اشعری رضی اللہ عنہ سلام پھیر کر لوگوں کی طرف متوجہ ہوئے تو انہوں نے پوچھا: تم میں سے کس نے یہ بات کہی ہے؟ تو سبھی لوگ خاموش رہے کسی نے کوئی جواب نہیں دیا، تو انہوں نے کہا: اے حطان! شاید تم نے ہی یہ بات کہی ہے! تو انہوں نے کہا: نہیں میں نے نہیں کہی ہے، اور مجھے ڈر ہے کہ کہیں آپ مجھ ہی کو اس پر سرزنش نہ کرنے لگ جائیں، تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم ہمیں ہماری نماز اور ہمارے طریقے سکھاتے تھے، تو آپ فرماتے: امام اس لیے ہے کہ اس کی اقتداء کی جائے، تو جب وہ اللہ اکبر کہے تو تم بھی اللہ اکبر کہو، اور جب وہ «غير المغضوب عليهم ولا الضالين»کہے تو تم لوگ آمین کہو، تو اللہ تعالیٰ تمہاری ( دعا ) قبول فرمائے گا، اور جب وہ رکوع کرے تو تم بھی رکوع کرو، اور جب وہ ( رکوع ) سے سر اٹھائے اور «سمع اللہ لمن حمده» کہے تو تم «ربنا لك الحمد» کہو، تو اللہ تعالیٰ تمہاری سنے گا، اور جب وہ سجدہ کرے تو تم بھی سجدہ کرو، اور جب وہ سجدہ سے سر اٹھائے تو تم بھی سر اٹھاؤ، کیونکہ امام تم سے پہلے سجدہ کرتا ہے، اور تم سے پہلے سر بھی اٹھاتا ہے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ادھر کی کسر ادھر پوری ہو جائے گی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": 831,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ انصار کا ایک شخص آیا اور نماز کھڑی ہو چکی تھی تو وہ مسجد میں داخل ہوا، اور جا کر معاذ رضی اللہ عنہ کے پیچھے نماز پڑھنے لگا، انہوں نے رکعت لمبی کر دی، تو وہ شخص ( نماز توڑ کر ) الگ ہو گیا، اور مسجد کے ایک گوشے میں جا کر ( تنہا ) نماز پڑھ لی، پھر چلا گیا، جب معاذ رضی اللہ عنہ نے نماز پوری کر لی تو ان سے کہا گیا کہ فلاں شخص نے ایسا ایسا کیا ہے، تو معاذ رضی اللہ عنہ نے کہا: اگر میں نے صبح کر لی تو اسے رسول اللہ صلی اللہ علیہ وسلم سے ضرور بیان کروں گا ؛ چنانچہ معاذ رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، اور آپ سے اس کا ذکر کیا، تو رسول اللہ صلی اللہ علیہ وسلم نے اس شخص کو بلا بھیجا، وہ آیا تو آپ صلی اللہ علیہ وسلم نے پوچھا: تمہیں کس چیز نے ایسا کرنے پر ابھارا؟ تو اس نے جواب دیا: اللہ کے رسول! میں نے دن بھر ( کھیت کی ) سینچائی کی تھی، میں آیا، تو جماعت کھڑی ہو چکی تھی، تو میں مسجد میں داخل ہوا، اور ان کے ساتھ نماز میں شامل ہو گیا، انہوں نے فلاں فلاں سورت پڑھنی شروع کر دی، اور ( قرآت ) لمبی کر دی، تو میں نے نماز توڑ کر جا کر الگ ایک کونے میں نماز پڑھ لی، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: معاذ! کیا تم لوگوں کو فتنہ میں ڈالنے والے ہو؟ معاذ! کیا تم لوگوں کو فتنہ میں ڈالنے والے ہو؟ معاذ! کیا تم لوگوں کو فتنہ میں ڈالنے والے ہو؟ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": 832,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ایک گھوڑے پر سوار ہوئے تو آپ اس سے گر گئے اور آپ کے داہنے پہلو میں خراش آ گئی، تو آپ نے کچھ نمازیں بیٹھ کر پڑھیں، ہم نے بھی آپ کے پیچھے بیٹھ کر نماز پڑھی، جب آپ سلام پھیر کر پلٹے تو فرمایا: امام بنایا ہی اس لیے گیا ہے کہ اس کی اقتداء کی جائے، تو جب وہ کھڑے ہو کر نماز پڑھے تو تم بھی کھڑے ہو کر پڑھو، اور جب وہ رکوع کرے تو تم بھی رکوع کرو، اور جب وہ «سمع اللہ لمن حمده» کہے تو تم«ربنا لك الحمد» کہو، اور جب وہ بیٹھ کر نماز پڑھے تو تم سب بھی بیٹھ کر پڑھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": 833,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم کی بیماری بڑھ گئی، بلال رضی اللہ عنہ آپ کو نماز کی خبر دینے آئے، آپ صلی اللہ علیہ وسلم نے فرمایا: ابوبکر کو حکم دو کہ وہ لوگوں کو نماز پڑھائیں ، میں نے عرض کیا: اللہ کے رسول! ابوبکر نرم دل آدمی ہیں، وہ جب آپ کی جگہ کھڑے ہوں گے تو لوگوں کو ( قرآن ) نہیں سنا سکیں گے ۱؎ اگر آپ عمر کو حکم دیتے تو زیادہ بہتر ہوتا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ابوبکر کو حکم دو کہ لوگوں کو صلاۃ پڑھائیں ، تو میں نے ام المؤمنین حفصہ رضی اللہ عنہا سے کہا تم نبی اکرم صلی اللہ علیہ وسلم سے کہو، تو حفصہ نے ( بھی ) آپ سے کہا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم یوسف علیہ السلام کی ساتھ والیاں ہو ۲؎، ابوبکر کو حکم دو کہ لوگوں کو نماز پڑھائیں ، ( بالآخر ) لوگوں نے ابوبکر رضی اللہ عنہ کو حکم دیا، تو جب انہوں نے نماز شروع کی تو رسول اللہ صلی اللہ علیہ وسلم نے اپنی طبیعت میں کچھ ہلکا پن محسوس کیا، تو آپ اٹھے اور دو آدمیوں کے سہارے چل کر نماز میں آئے، آپ کے دونوں پاؤں زمین سے گھسٹ رہے تھے، جب آپ مسجد میں داخل ہوئے تو ابوبکر رضی اللہ عنہ نے آپ کے آنے کی آہٹ محسوس کی، اور وہ پیچھے ہٹنے لگے تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں اشارہ کیا کہ جس طرح ہو اسی طرح کھڑے رہو ، ام المؤمنین کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم آ کر ابوبکر رضی اللہ عنہ کے بائیں بیٹھ گئے، آپ صلی اللہ علیہ وسلم لوگوں کو بیٹھ کر نماز پڑھا رہے تھے، اور ابوبکر رضی اللہ عنہ کھڑے تھے، ابوبکر رسول اللہ صلی اللہ علیہ وسلم کی اقتداء کر رہے تھے، اور لوگ ابوبکر رضی اللہ عنہ کی نماز کی اقتداء کر رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": 834,
			"text": "عبیداللہ بن عبداللہ کہتے ہیں کہ میں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس گیا، اور میں نے ان سے کہا: کیا آپ مجھے رسول اللہ صلی اللہ علیہ وسلم کے مرض الموت کا حال نہیں بتائیں گی؟ انہوں نے کہا: جب رسول اللہ صلی اللہ علیہ وسلم کی بیماری کی شدت بڑھ گئی، تو آپ نے پوچھا: کیا لوگوں نے نماز پڑھ لی؟ تو ہم نے عرض کیا: نہیں، اللہ کے رسول! وہ آپ کا انتظار کر رہے ہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: میرے لیے ٹب میں پانی رکھو ؛ چنانچہ ہم نے رکھا، تو آپ نے غسل کیا، پھر اٹھنے چلے تو آپ پر بے ہوشی طاری ہو گئی، پھر افاقہ ہوا تو آپ صلی اللہ علیہ وسلم نے پوچھا: کیا لوگوں نے نماز پڑھ لی؟ تو ہم نے عرض کیا: نہیں، اللہ کے رسول! وہ آپ کا انتظار کر رہے ہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: میرے لیے ٹب میں پانی رکھو ؛ چنانچہ ہم نے رکھا، تو آپ نے غسل کیا، پھر آپ اٹھنے چلے تو پھر بیہوش ہو گئے، پھر تیسری بار بھی آپ نے ایسا ہی فرمایا، لوگ مسجد میں جمع تھے، اور عشاء کی نماز کے لیے رسول اللہ صلی اللہ علیہ وسلم کا انتظار کر رہے تھے، بالآخر رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ کو کہلوا بھیجا کہ وہ لوگوں کو نماز پڑھائیں، تو قاصد ان کے پاس آیا، اور اس نے کہا: رسول اللہ صلی اللہ علیہ وسلم آپ کو حکم دے رہے ہیں کہ آپ لوگوں کو نماز پڑھائیں، ابوبکر رضی اللہ عنہ نرم دل آدمی تھے، تو انہوں نے ( عمر رضی اللہ عنہ سے ) کہا: عمر! تم لوگوں کو نماز پڑھا دو، تو انہوں نے کہا: آپ اس کے زیادہ حقدار ہیں؛ چنانچہ ان ایام میں ابوبکر رضی اللہ عنہ نے لوگوں کو نماز پڑھائی، پھر رسول اللہ صلی اللہ علیہ وسلم نے اپنے اندر ہلکا پن محسوس کیا، تو دو آدمیوں کے سہارے ( ان دونوں میں سے ایک عباس رضی اللہ عنہ تھے ) نماز ظہر کے لیے آئے، تو جب ابوبکر رضی اللہ عنہ نے آپ کو دیکھا تو وہ پیچھے ہٹنے لگے، رسول اللہ صلی اللہ علیہ وسلم نے انہیں اشارہ کیا کہ وہ پیچھے نہ ہٹیں، اور ان دونوں کو حکم دیا کہ وہ آپ کو ان کے بغل میں بٹھا دیں، ابوبکر رضی اللہ عنہ کھڑے ہو کر نماز پڑھا رہے تھے، لوگ ابوبکر رضی اللہ عنہ کی صلاۃ کی اقتداء کر رہے تھے، اور رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر نماز پڑھا رہے تھے۔ ( عبیداللہ کہتے ہیں ) میں ابن عباس رضی اللہ عنہم کے پاس آیا، اور میں نے ان سے کہا: کیا میں آپ سے وہ چیزیں بیان نہ کر دوں جو مجھ سے ام المؤمنین عائشہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کی بیماری کے متعلق بیان کیا ہے؟ تو انہوں نے کہا: ہاں! ضرور بیان کرو، تو میں نے ان سے سارا واقعہ بیان کیا، تو انہوں نے اس میں سے کسی بھی چیز کا انکار نہیں کیا، البتہ اتنا پوچھا: کیا انہوں نے اس شخص کا نام لیا جو عباس رضی اللہ عنہ کے ساتھ تھے؟ میں نے کہا: نہیں، تو انہوں نے کہا: وہ علی ( کرم اللہ وجہہ ) تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": 835,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ معاذ رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے، پھر اپنی قوم میں واپس جا کر ان کی امامت کرتے، ایک رات انہوں نے نماز لمبی کر دی، نبی اکرم صلی اللہ علیہ وسلم کے ساتھ انہوں نے نماز پڑھی، پھر وہ اپنی قوم کے پاس آ کر ان کی امامت کرنے لگے، تو انہوں نے سورۃ البقرہ کی قرآت شروع کر دی، جب مقتدیوں میں سے ایک شخص نے قرآت سنی تو نماز توڑ کر پیچھے جا کر الگ سے نماز پڑھ لی، پھر وہ ( مسجد سے ) نکل گیا، تو لوگوں نے پوچھا، فلاں! تو منافق ہو گیا ہے؟ تو اس نے کہا: اللہ کی قسم میں نے منافقت نہیں کی ہے، اور میں نبی اکرم صلی اللہ علیہ وسلم کے پاس جاؤں گا، اور آپ کو اس سے باخبر کروں گا ؛ چنانچہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور اس نے آپ سے عرض کیا: اللہ کے رسول! معاذ آپ کے ساتھ نماز پڑھتے ہیں، پھر ہمارے پاس آتے ہیں، اور ہماری امامت کرتے ہیں، پچھلی رات انہوں نے نماز بڑی لمبی کر دی، انہوں نے آپ کے ساتھ نماز پڑھی، پھر واپس آ کر انہوں نے ہماری امامت کی، تو سورۃ البقرہ پڑھنا شروع کر دی، جب میں نے ان کی قرآت سنی تو پیچھے جا کر میں نے ( تنہا ) نماز پڑھ لی، ہم پانی ڈھونے والے لوگ ہیں، دن بھر اپنے ہاتھوں سے کام کرتے ہیں، نبی اکرم صلی اللہ علیہ وسلم نے ان سے کہا: معاذ! کیا تم لوگوں کو فتنہ میں ڈالنے والے ہو تم ( نماز میں ) فلاں، فلاں سورت پڑھا کرو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": 836,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے خوف کی نماز پڑھائی، تو اپنے پیچھے والوں کو دو رکعت پڑھائی، ( پھر وہ چلے گئے ) اور جو ان کی جگہ آئے انہیں بھی دو رکعت پڑھائی، تو اس طرح نبی کریم صلی اللہ علیہ وسلم کی چار رکعتیں ہوئیں، اور لوگوں کی دو دو رکعتیں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 837,
			"arabicnumber": 837,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جماعت کی نماز تنہا نماز پر ستائیس درجہ فضیلت رکھتی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 838,
			"arabicnumber": 838,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جماعت کی نماز تم میں سے کسی کی تنہا نماز سے پچیس گنا افضل ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 839,
			"arabicnumber": 839,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جماعت کی نماز تنہا نماز سے پچیس درجہ بڑھی ہوتی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 840,
			"arabicnumber": 840,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تین آدمی ہوں تو ان میں سے ایک ان کی امامت کرے، اور امامت کا زیادہ حقدار ان میں وہ ہے جسے قرآن زیادہ یاد ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 841,
			"arabicnumber": 841,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے بغل میں نماز پڑھی، ام المؤمنین عائشہ رضی اللہ عنہا ہمارے ساتھ ہمارے پیچھے نماز پڑھ رہیں تھیں، اور میں نبی اکرم صلی اللہ علیہ وسلم کے بغل میں آپ کے ساتھ نماز پڑھ رہا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 842,
			"arabicnumber": 842,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی تو میں آپ کے بائیں کھڑا ہوا، تو آپ نے مجھے اپنے بائیں ہاتھ سے پکڑا، اور ( پیچھے سے لا کر ) اپنے دائیں کھڑا کر لیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 843,
			"arabicnumber": 843,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم نے صبح کی نماز پڑھی تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا فلاں نماز میں موجود ہے؟ لوگوں نے کہا: نہیں، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اور فلاں؟ لوگوں نے کہا: نہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ دونوں نمازیں ( عشاء اور فجر ) منافقین پر سب سے بھاری ہیں، اگر لوگ جان لیں کہ ان دونوں نمازوں میں کیا اجر و ثواب ہے، تو وہ ان دونوں میں ضرور آئیں خواہ چوتڑوں کے بل انہیں گھسٹ کر آنا پڑے، اور پہلی صف فرشتوں کی صف کی طرح ہے، اگر تم اس کی فضیلت جان لو تو تم اس میں شرکت کے لیے ایک دوسرے سے سبقت لے جانے کی کوشش کرو گے، کسی آدمی کا کسی آدمی کے ساتھ مل کر جماعت سے نماز پڑھنا تنہا نماز پڑھنے سے بہتر ہے ۱؎، اور ایک شخص کا دو آدمیوں کے ساتھ نماز پڑھنا اس کے ایک آدمی کے ساتھ نماز پڑھنے سے بہتر ہے، اور لوگ جتنا زیادہ ہوں گے اتنا ہی وہ نماز اللہ تعالیٰ کو زیادہ محبوب ہو گی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 844,
			"arabicnumber": 844,
			"text": "عتبان بن مالک رضی اللہ عنہ سے روایت ہے کہ انہوں نے عرض کیا: اللہ کے رسول! میرے اور میرے قبیلہ کی مسجد کے درمیان ( برسات میں ) سیلاب حائل ہو جاتا ہے، میں چاہتا ہوں کہ آپ میرے گھر تشریف لاتے، اور میرے گھر میں ایک جگہ نماز پڑھ دیتے جسے میں مصلیٰ بنا لیتا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اچھا ہم آئیں گے ، جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو آپ نے پوچھا: تم کہاں چاہتے ہو؟ تو میں نے گھر کے ایک گوشہ کی جانب اشارہ کیا، تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے، اور ہم نے آپ کے پیچھے صف بندی کی، پھر آپ نے ہمیں دو رکعت نماز پڑھائی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 845,
			"arabicnumber": 845,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جس وقت نماز کے لیے کھڑے ہوئے تو تکبیر ( تکبیر تحریمہ ) کہنے سے پہلے آپ ہماری طرف متوجہ ہوئے، اور آپ صلی اللہ علیہ وسلم نے فرمایا: تم اپنی صفوں کو درست کر لیا کرو، اور باہم مل کر کھڑے ہوا کرو، کیونکہ میں تمہیں اپنی پیٹھ کے پیچھے سے بھی دیکھتا ہوں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 846,
			"arabicnumber": 846,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ ہم ( سفر میں ) رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ لوگ کہنے لگے: اللہ کے رسول! کاش آپ آرام کے لیے پڑاؤ ڈالتے، آپ صلی اللہ علیہ وسلم نے فرمایا: مجھے ڈر ہے کہ تم کہیں نماز سے سو نہ جاؤ ، اس پر بلال رضی اللہ عنہ نے کہا: میں آپ سب کی نگرانی کروں گا، چنانچہ سب لوگ لیٹے، اور سب سو گئے، بلال رضی اللہ عنہ نے اپنی پیٹھ اپنی سواری سے ٹیک لی، ( اور وہ بھی سو گئے ) رسول اللہ صلی اللہ علیہ وسلم بیدار ہوئے تو سورج نکل چکا تھا، آپ صلی اللہ علیہ وسلم نے بلال رضی اللہ عنہ سے فرمایا: بلال! کہاں گئی وہ بات جو تم نے کہی تھی؟ بلال رضی اللہ عنہ نے عرض کیا: مجھ پر ایسی نیند جیسی اس بار ہوئی کبھی طاری نہیں ہوئی تھی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بیشک اللہ تعالیٰ جب چاہتا ہے تمہاری روحیں قبض کر لیتا ہے، اور جب چاہتا ہے اسے لوٹا دیتا ہے، بلال اٹھو! اور لوگوں میں نماز کا اعلان کرو ؛ چنانچہ بلال کھڑے ہوئے، اور انہوں نے اذان دی، پھر لوگوں نے وضو کیا، اس وقت سورج بلند ہو چکا تھا، تو آپ کھڑے ہوئے اور آپ صلی اللہ علیہ وسلم نے لوگوں کو نماز پڑھائی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 847,
			"arabicnumber": 847,
			"text": "معدان بن ابی طلحہ یعمری کہتے ہیں کہ مجھ سے ابودرداء رضی اللہ عنہ نے پوچھا: تمہارا گھر کہاں ہے؟ میں نے کہا: حمص کے دُوَین نامی بستی میں، اس پر ابودرداء رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جب کسی بستی یا بادیہ میں تین افراد موجود ہوں، اور اس میں نماز نہ قائم کی جاتی ہوتی ہو تو ان پر شیطان مسلط ہو جاتا ہے، لہٰذا تم جماعت کو لازم پکڑو کیونکہ بھیڑ یا ریوڑ سے الگ ہونے والی بکری ہی کو کھاتا ہے ۔ سائب کہتے ہیں: جماعت سے مراد نماز کی جماعت ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 848,
			"arabicnumber": 848,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس ذات کی قسم جس کے ہاتھ میں میری جان ہے میں نے ارادہ کیا کہ لکڑیاں جمع کرنے کا حکم دوں، تو وہ جمع کی جائے، پھر میں حکم دوں کہ نماز کے لیے اذان کہی جائے، پھر ایک شخص کو حکم دوں کہ وہ لوگوں کی امامت کرے، پھر میں لوگوں کے پاس جاؤں اور ان کے سمیت ان کے گھروں میں آگ لگا دوں، قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، اگر ان میں سے کوئی یہ جانتا کہ اسے ( مسجد میں ) ایک موٹی ہڈی یا دو اچھے کھر ملیں گے تو وہ عشاء کی نماز میں ضرور حاضر ہوتا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 849,
			"arabicnumber": 849,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے تھے کہ جس شخص کو اس بات کی خوشی ہو کہ وہ کل قیامت کے دن اللہ عزوجل سے اس حال میں ملے کہ وہ مسلمان ہو، تو وہ ان پانچوں نمازوں کی محافظت کرے ۱؎، جب ان کی اذان دی جائے، کیونکہ اللہ عزوجل نے اپنے نبی صلی اللہ علیہ وسلم کے لیے ہدایت کے راستے مقرر کر دئیے ہیں، اور یہ نمازیں ہدایت کے راستوں میں سے ایک راستہ ہے، اور میں سمجھتا ہوں کہ تم میں کوئی بھی ایسا نہ ہو گا جس کی ایک مسجد اس کے گھر میں نہ ہو جس میں وہ نماز پڑھتا ہو، اگر تم اپنے گھروں ہی میں نماز پڑھو گے اور اپنی مسجدوں کو چھوڑ دو گے تو تم اپنے نبی کا طریقہ چھوڑ دو گے، اور اگر تم اپنے نبی کا طریقہ چھوڑ دو گے تو گمراہ ہو جاؤ گے، اور جو مسلمان بندہ اچھی طرح وضو کرتا ہے، پھر نماز کے لیے ( اپنے گھر سے ) چلتا ہے، تو اللہ تعالیٰ ہر قدم کے عوض جسے وہ اٹھاتا ہے اس کے لیے ایک نیکی لکھ دیتا ہے، یا اس کا ایک درجہ بلند کر دیتا ہے، یا اس کے عوض اس کا ایک گناہ مٹا دیتا ہے، میں نے اپنے لوگوں ( صحابہ کرام ) کو دیکھا ہے جب ہم نماز کو جاتے تو قریب قریب قدم رکھتے، ( تاکہ نیکیاں زیادہ ملیں ) اور میں نے دیکھا کہ نماز سے وہی پیچھے رہتا جو منافق ہوتا، اور جس کا منافق ہونا لوگوں کو معلوم ہوتا، اور میں نے ( عہدرسالت میں ) دیکھا کہ آدمی کو دو آدمیوں کے درمیان سہارا دے کر ( مسجد ) لایا جاتا یہاں تک کہ لا کر صف میں کھڑا کر دیا جاتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 850,
			"arabicnumber": 850,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ایک نابینا شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ۱؎، اور اس نے عرض کیا: میرا کوئی راہبر ( گائیڈ ) نہیں ہے جو مجھے مسجد تک لائے، اس نے آپ سے درخواست کی کہ آپ اسے اس کے گھر میں نماز پڑھنے کی اجازت دے دیں، آپ صلی اللہ علیہ وسلم نے اسے اجازت دے دی، پھر جب وہ پیٹھ پھیر کر جانے لگا، تو آپ صلی اللہ علیہ وسلم نے اسے بلایا، اور اس سے پوچھا: کیا تم اذان سنتے ہو؟ اس نے جواب دیا: جی ہاں، ( سنتا ہوں ) تو آپ صلی اللہ علیہ وسلم نے فرمایا: تو ( مؤذن کی پکار پر ) لبیک کہو ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 851,
			"arabicnumber": 851,
			"text": "عبداللہ بن ام مکتوم رضی اللہ عنہ سے روایت ہے کہ انہوں نے عرض کیا: اللہ کے رسول! مدینہ میں کیڑے مکوڑے ( سانپ بچھو وغیرہ ) اور درندے بہت ہیں، ( تو کیا میں گھر میں نماز پڑھ لیا کروں ) آپ صلی اللہ علیہ وسلم نے پوچھا: کیا تم «حى على الصلاة»، اور «حى على الفلاح» کی آواز سنتے ہو؟ انہوں نے کہا: جی ہاں، ( سنتا ہوں ) تو آپ صلی اللہ علیہ وسلم نے فرمایا: پھر تو آؤ ، اور آپ نے انہیں جماعت سے غیر حاضر رہنے کی اجازت نہیں دی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 852,
			"arabicnumber": 852,
			"text": "عروہ روایت کرتے ہیں کہ عبداللہ بن ارقم رضی اللہ عنہ اپنے لوگوں کی امامت کرتے تھے، ایک دن نماز کا وقت آیا، تو وہ اپنی حاجت کے لیے چلے گئے، پھر واپس آئے اور کہنے لگے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا ہے: جب تم میں سے کوئی پاخانہ کی حاجت محسوس کرے، تو نماز سے پہلے اس سے فارغ ہو لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 853,
			"arabicnumber": 853,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب شام کا کھانا حاضر ہو، اور نماز ( جماعت ) کھڑی کر دی گئی ہو، تو پہلے کھانا کھاؤ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 854,
			"arabicnumber": 854,
			"text": "اسامہ بن عمیر رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حنین میں تھے کہ ہم پر بارش ہونے لگی، تو رسول اللہ صلی اللہ علیہ وسلم کے مؤذن نے آواز لگائی: ( لوگو! ) اپنے ڈیروں میں نماز پڑھ لو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 855,
			"arabicnumber": 855,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے اچھی طرح وضو کیا، پھر وہ مسجد کا ارادہ کر کے نکلا، ( اور مسجد آیا ) تو لوگوں کو دیکھا کہ وہ نماز پڑھ چکے ہیں، تو اللہ تعالیٰ اس کے لیے اتنا ہی ثواب لکھے گا جتنا اس شخص کو ملا ہے جو جماعت میں موجود تھا، اور یہ ان کے ثواب میں کوئی کمی نہیں کرے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 856,
			"arabicnumber": 856,
			"text": "عثمان بن عفان رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جس نے نماز کے لیے وضو کیا، اور کامل وضو کیا، پھر فرض نماز کے لیے چلا، اور آ کر لوگوں کے ساتھ نماز پڑھی یا جماعت کے ساتھ، یا مسجد میں ( تنہا ) نماز پڑھی، تو اللہ تعالیٰ اس کے گناہوں ۱؎ کو بخش دے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 857,
			"arabicnumber": 857,
			"text": "محجن رضی اللہ عنہ سے روایت ہے کہ وہ ایک مجلس میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ مؤذن نے نماز کے لیے اذان دی، تو رسول اللہ صلی اللہ علیہ وسلم اٹھے ( اور جا کر نماز پڑھی ) ، پھر ( نماز پڑھ کر ) لوٹے، اور محجن اپنی مجلس ہی میں بیٹھے رہے، تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا: تم نے نماز کیوں نہیں پڑھی؟ کیا تم مسلمان نہیں ہو؟ انہوں نے جواب دیا: کیوں نہیں! لیکن میں نے اپنے گھر میں نماز پڑھ لی تھی، تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: جب تم آؤ ( اور لوگ نماز پڑھ رہے ہوں ) تو لوگوں کے ساتھ تم بھی نماز پڑھ لیا کرو، اگرچہ تم پڑھ چکے ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 858,
			"arabicnumber": 858,
			"text": "یزید بن اسود عامری رضی اللہ عنہ کہتے ہیں کہ میں مسجد خیف میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ فجر کی نماز میں موجود تھا، جب آپ اپنی نماز پوری کر چکے تو آپ نے دیکھا کہ لوگوں کے آخر میں دو آدمی ہیں جنہوں نے آپ کے ساتھ نماز نہیں پڑھی ہے، آپ نے فرمایا: ان دونوں کو میرے پاس لاؤ ، چنانچہ ان دونوں کو لایا گیا، ان کے مونڈھے ( گھبراہٹ سے ) کانپ رہے تھے وہ گھبرائے ہوئے تھے، آپ صلی اللہ علیہ وسلم نے پوچھا: تم دونوں نے ہمارے ساتھ نماز کیوں نہیں پڑھی؟ تو ان دونوں نے عرض کیا: اللہ کے رسول! ہم اپنے ٹھکانوں میں نماز پڑھ چکے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ایسا نہ کرو، جب تم اپنے ٹھکانوں میں نماز پڑھ چکو، پھر مسجد میں آؤ جہاں جماعت ہو رہی ہو تو تم ان کے ساتھ دوبارہ نماز پڑھ لیا کرو، یہ تمہارے لیے نفل ( سنت ) ہو جائے گی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 859,
			"arabicnumber": 859,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ رسول اکرم صلی اللہ علیہ وسلم نے میری ران پہ ہاتھ مار کر مجھ سے فرمایا: جب تم ایسے لوگوں میں رہ جاؤ گے جو نماز کو اس کے وقت سے دیر کر کے پڑھیں گے تو کیسے کرو گے؟ انہوں نے کہا: آپ جیسا حکم دیں، آپ صلی اللہ علیہ وسلم نے فرمایا: نماز اول وقت پر پڑھ لینا، پھر تم اپنی ضرورت کے لیے چلے جانا، اور اگر جماعت کھڑی ہو چکی ہو اور تم ( ابھی ) مسجد ہی میں ہو تو پھر نماز پڑھ لینا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 860,
			"arabicnumber": 860,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا کے آزاد کردہ غلام سلیمان کہتے ہیں کہ میں نے ابن عمر رضی اللہ عنہم کو بلاط ( ایک جگہ کا نام ) پر بیٹھے ہوئے دیکھا، اور لوگ نماز پڑھ رہے تھے، میں نے کہا: ابوعبدالرحمٰن! کیا بات ہے آپ کیوں نہیں نماز پڑھ رہے ہیں؟ تو انہوں نے کہا: دراصل میں نماز پڑھ چکا ہوں، اور میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ ایک دن میں دو بار نماز نہ لوٹائی جائے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 861,
			"arabicnumber": 861,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم نماز کے لیے آؤ تو دوڑتے ہوئے نہ آؤ، بلکہ چلتے ہوئے آؤ، اور تم پر ( وقار ) سکینت طاری ہو، نماز جتنی پاؤ اسے پڑھ لو، اور جو چھوٹ جائے اسے پوری کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 862,
			"arabicnumber": 862,
			"text": "ابورافع رضی اللہ عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم عصر کی نماز پڑھ چکتے تو بنی عبدالاشہل کے لوگوں میں جاتے اور ان سے گفتگو کرتے یہاں تک کہ مغرب کی نماز کے لیے اترتے، نبی اکرم صلی اللہ علیہ وسلم مغرب کی نماز کے لیے تیزی سے جا رہے تھے کہ ہم بقیع سے گزرے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: افسوس ہے تم پر، افسوس ہے تم پر آپ صلی اللہ علیہ وسلم کی یہ بات مجھے گراں لگی، اور یہ سمجھ کر کہ آپ مجھ سے مخاطب ہیں، میں پیچھے ہٹ گیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں کیا ہوا؟ چلو ، تو میں نے عرض کیا: اللہ کے رسول! کیا کوئی بات ہو گئی ہے؟ آپ صلی اللہ علیہ وسلم نے پوچھا: وہ کیا؟ ، تو میں نے عرض کیا: آپ نے مجھ پر اف کہا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں! ( تم پر نہیں ) البتہ اس شخص پر ( اظہار اف ) کیا ہے جسے میں نے فلاں قبیلے میں صدقہ وصول کرنے کے لیے بھیجا تھا، تو اس نے ایک دھاری دار چادر چرا لی ہے ؛ چنانچہ اب اسے ویسی ہی آگ کی چادر پہنا دی گئی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 863,
			"arabicnumber": 863,
			"text": "اس سند سے بھی ابورافع رضی اللہ عنہ سے اسی جیسی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 864,
			"arabicnumber": 864,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اول وقت میں نماز کے لیے جانے والے کی مثال اس شخص کی سی ہے جو اونٹ کی قربانی کرتا ہے، پھر جو اس کے بعد آئے وہ اس شخص کی طرح ہے جو گائے کی قربانی کرتا ہے، پھر جو اس کے بعد آئے وہ اس شخص کی طرح ہے جو بھیڑ کی قربانی کرتا ہے، پھر جو اس کے بعد آئے وہ اس شخص کی طرح ہے جو مرغی کی قربانی کرتا ہے، پھر جو اس کے بعد آئے وہ اس شخص کی طرح ہے جو انڈے کی قربانی کرتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 865,
			"arabicnumber": 865,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب نماز کے لیے اقامت کہہ دی جائے تو سوائے فرض نماز کے اور کوئی نماز نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 866,
			"arabicnumber": 866,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب نماز کے لیے اقامت کہہ دی جائے تو سوائے فرض نماز کے اور کوئی نماز نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 867,
			"arabicnumber": 867,
			"text": "ابن بحینہ (عبداللہ بن مالک ازدی) رضی اللہ عنہ کہتے ہیں کہ نماز فجر کے لیے اقامت کہی گئی تو رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو نماز پڑھتے ہوئے دیکھا، اور مؤذن اقامت کہہ رہا تھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم فجر کی نماز چار رکعت پڑھتے ہو؟ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 868,
			"arabicnumber": 868,
			"text": "عبداللہ بن سرجس رضی اللہ عنہ کہتے ہیں کہ ایک شخص آیا، اور رسول اللہ صلی اللہ علیہ وسلم فجر کی نماز میں تھے، اس نے دو رکعت سنت پڑھی، پھر آپ کے ساتھ نماز میں شریک ہوا، جب رسول اللہ صلی اللہ علیہ وسلم اپنی نماز پوری کر چکے تو فرمایا: اے فلاں! ان دونوں میں سے تمہاری نماز کون سی تھی، جو تم نے ہمارے ساتھ پڑھی ہے؟ یا جو خود سے پڑھی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 869,
			"arabicnumber": 869,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے گھر آئے تو میں نے اور ایک یتیم نے آپ کے پیچھے نماز پڑھی، اور ام سلیم رضی اللہ عنہا نے ہمارے پیچھے تنہا نماز پڑھی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 870,
			"arabicnumber": 870,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھتی تھی، جو لوگوں میں سب سے زیادہ خوبصورت تھی، تو بعض لوگ پہلی صف میں چلے جاتے تاکہ وہ اسے نہ دیکھ سکیں، اور بعض لوگ پیچھے ہو جاتے یہاں تک کہ بالکل پچھلی صف میں چلے جاتے ۱؎، تو جب وہ رکوع میں جاتے تو وہ اپنے بغل سے جھانک کر دیکھتے، تو اللہ تعالیٰ نے یہ آیت نازل فرمائی: «ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين» ( الحجر: ۲۴ ) ہم تم میں سے آگے رہنے والوں کو بھی خوب جانتے ہیں، اور پیچھے رہنے والوں کو بھی خوب جانتے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 871,
			"arabicnumber": 871,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ وہ مسجد میں داخل ہوئے، نبی اکرم صلی اللہ علیہ وسلم رکوع میں تھے، تو انہوں نے صف میں شامل ہونے سے پہلے ہی رکوع کر لیا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اللہ آپ کی حرص میں اضافہ فرمائے، پھر ایسا نہ کرنا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 872,
			"arabicnumber": 872,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھائی، پھر سلام پھیر کر پلٹے تو آپ صلی اللہ علیہ وسلم نے فرمایا: اے فلاں! تم اپنی نماز درست کیوں نہیں کرتے؟ کیا نمازی دیکھتا نہیں کہ اسے اپنی نماز کیسی پڑھنی چاہیئے، ( سن لو ) میں اپنے پیچھے سے بھی ایسے ہی دیکھتا ہوں جیسے اپنے سامنے سے دیکھتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 873,
			"arabicnumber": 873,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ظہر سے پہلے دو رکعت سنت پڑھتے تھے، اور اس کے بعد بھی دو رکعت پڑھتے تھے، اور مغرب کے بعد دو رکعت اپنے گھر میں پڑھتے، اور عشاء کے بعد بھی دو رکعت پڑھتے، اور جمعہ کے بعد مسجد میں کچھ نہیں پڑھتے یہاں تک کہ جب گھر لوٹ آتے تو دو رکعت پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 874,
			"arabicnumber": 874,
			"text": "عاصم بن ضمرہ کہتے ہیں کہ ہم نے علی رضی اللہ عنہ سے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے متعلق سوال کیا تو انہوں نے کہا: تم میں سے کون اس کی طاقت رکھتا ہے؟ ہم نے کہا: گرچہ ہم اس کی طاقت نہیں رکھتے مگر سن تو لیں، تو انہوں نے کہا: جب سورج یہاں ہوتا ۱؎ جس طرح عصر کے وقت یہاں ہوتا ہے ۲؎ تو آپ دو رکعت ( سنت ) پڑھتے ۳؎، اور جب سورج یہاں ہوتا جس طرح ظہر کے وقت ہوتا ہے تو آپ چار رکعت ( سنت ) پڑھتے ۴؎، اور ظہر سے پہلے چار رکعت پڑھتے ۵؎، اور اس کے بعد دو رکعت پڑھتے، اور عصر سے پہلے چار رکعت ( سنت ) پڑھتے، ہر دو رکعت کے درمیان مقرب فرشتوں اور نبیوں پر اور ان کے پیروکار مومنوں اور مسلمانوں پر سلام کے ذریعہ ۶؎ فصل کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 875,
			"arabicnumber": 875,
			"text": "عاصم بن ضمرہ کہتے ہیں کہ میں نے علی بن ابی طالب رضی اللہ عنہ سے رسول اللہ صلی اللہ علیہ وسلم کی اس نماز کے بارے میں پوچھا جسے آپ دن میں فرض سے پہلے پڑھتے تھے، تو انہوں نے کہا: کون اس کی طاقت رکھتا ہے؟ پھر انہوں نے ہمیں بتایا، اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم جس وقت سورج ڈھل جاتا دو رکعت پڑھتے، اور نصف النہار ہونے سے پہلے چار رکعت پڑھتے، اور اس کے آخر میں سلام پھیرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 99
			}
		}
	]
}