{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"11": "The Book of the Commencement of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 876,
			"arabicnumber": 876,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ نماز میں تکبیر تحریمہ شروع کرتے تو جس وقت اللہ اکبر کہتے اپنے دونوں ہاتھ یہاں تک اٹھاتے کہ انہیں اپنے دونوں مونڈھوں کے بالمقابل کر لیتے، اور جب رکوع کے لیے اللہ اکبر کہتے تو بھی اسی طرح کرتے، پھر جب «سمع اللہ لمن حمده» کہتے تو بھی اسی طرح کرتے ۱؎، اور «ربنا ولك الحمد» کہتے اور سجدہ میں جاتے وقت اور سجدہ سے سر اٹھاتے وقت ایسا نہیں کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 877,
			"arabicnumber": 877,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ نماز کے لیے کھڑے ہوتے تو اپنے دونوں ہاتھ یہاں تک اٹھاتے کہ وہ آپ کے دونوں مونڈھوں کے بالمقابل ہو جاتے، پھر اللہ اکبر کہتے، اور جب رکوع کے لیے اللہ اکبر کہتے تو بھی ایسا ہی کرتے، اور جب رکوع سے سر اٹھاتے تو بھی ایسا ہی کرتے، اور «سمع اللہ لمن حمده‏» کہتے، اور سجدہ کرتے وقت ایسا نہیں کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 878,
			"arabicnumber": 878,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز شروع کرتے تو اپنے دونوں ہاتھ اپنے دونوں مونڈھوں کے بالمقابل اٹھاتے، اور جب رکوع کرتے، اور رکوع سے سر اٹھاتے تو بھی ان دونوں کو اسی طرح اٹھاتے، اور «سمع اللہ لمن حمده‏»، «ربنا ولك الحمد‏» کہتے، اور سجدہ کرتے وقت ایسا نہیں کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 879,
			"arabicnumber": 879,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی، جب آپ نے نماز شروع کی تو اللہ اکبر کہا، اپنے دونوں ہاتھ یہاں تک اٹھائے کہ انہیں اپنے کانوں کے بالمقابل کیا، پھر سورۃ فاتحہ پڑھنے لگے، جب اس سے فارغ ہوئے تو بآواز بلند آمین کہی اے اللہ اسے قبول فرما ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 880,
			"arabicnumber": 880,
			"text": "مالک بن حویرث رضی اللہ عنہ سے روایت ہے (اور یہ نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے تھے) کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز پڑھتے تو جس وقت آپ اللہ اکبر کہتے تو اپنے دونوں ہاتھوں کو اپنے کانوں کے بالمقابل اٹھاتے، اور جب رکوع کرنے اور رکوع سے اپنا سر اٹھانے کا ارادہ کرتے ( تب بھی اپنے دونوں ہاتھ اپنے دونوں کانوں کے بالمقابل اٹھاتے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 881,
			"arabicnumber": 881,
			"text": "مالک بن حویرث رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جس وقت آپ نماز میں داخل ہوئے تو اپنے دونوں ہاتھ اٹھائے، اور جس وقت آپ نے رکوع کیا اور جس وقت رکوع سے اپنا سر اٹھایا ( تو بھی انہیں آپ نے اٹھایا ) یہاں تک کہ وہ دونوں آپ کی کانوں کی لو کے بالمقابل ہو گئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 882,
			"arabicnumber": 882,
			"text": "وائل بن حجر رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ نماز شروع کرتے تو اپنے دونوں ہاتھوں کو یہاں تک اٹھاتے کہ آپ کے دونوں انگوٹھے آپ کے کانوں کی لو کے بالمقابل ہو جاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 883,
			"arabicnumber": 883,
			"text": "سعید بن سمعان کہتے ہیں کہ ابوہریرہ رضی اللہ عنہ قبیلہ زریق کی مسجد میں آئے، اور کہنے لگے: تین کام ایسے ہیں جنہیں رسول اللہ صلی اللہ علیہ وسلم کرتے تھے اور لوگوں نے انہیں چھوڑ دیا ہے ۱؎، آپ نماز میں اپنے دونوں ہاتھ بڑھا کر اٹھاتے تھے، اور تھوڑی دیر چپ رہتے تھے ۲؎ اور جب سجدہ کرتے اور سجدہ سے سر اٹھاتے تو اللہ اکبر کہتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 884,
			"arabicnumber": 884,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم مسجد میں داخل ہوئے، اور ایک اور شخص داخل ہوا، اس نے آ کر نماز پڑھی، پھر وہ آیا اور رسول اللہ صلی اللہ علیہ وسلم کو سلام کیا، رسول اللہ صلی اللہ علیہ وسلم نے اس کے سلام کا جواب دیا، اور فرمایا: واپس جاؤ اور پھر سے نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی تو وہ لوٹ گئے اور جا کر پھر سے نماز پڑھی جس طرح پہلی بار پڑھی تھی، پھر نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے اور آپ کو سلام کئے، رسول اللہ صلی اللہ علیہ وسلم نے ان سے ( پھر ) فرمایا: وعلیک السلام، واپس جاؤ اور پھر سے نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی ، ایسا انہوں نے تین مرتبہ کیا، پھر عرض کیا: اس ذات کی قسم جس نے حق کے ساتھ آپ کو مبعوث فرمایا ہے، میں اس سے بہتر نماز نہیں پڑھ سکتا، آپ مجھے ( نماز پڑھنا ) سکھا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: جب آپ نماز کے لیے کھڑے ہوں تو اللہ اکبر کہیں ۱؎ پھر قرآن میں سے جو آسان ہو پڑھو، پھر رکوع کرو یہاں تک کہ رکوع کی حالت میں آپ کو اطمینان ہو جائے، پھر رکوع سے سر اٹھاؤ یہاں تک کہ اطمینان سے سیدھے کھڑے ہو جاؤ، پھر سجدہ کرو یہاں تک کہ اطمینان سے سجدہ کر لو، پھر سجدہ سے سر اٹھاؤ یہاں تک کہ اطمینان سے بیٹھ جاؤ پھر اسی طرح اپنی پوری نماز میں کرو ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ ایک شخص نے نبی اکرم صلی اللہ علیہ وسلم کے پیچھے کھڑے ہو کر پڑھا: «اللہ أكبر كبيرا والحمد لله كثيرا وسبحان اللہ بكرة وأصيلا‏» اللہ بہت بڑا ہے، اور میں اسی کی بڑائی بیان کرتا ہوں، تمام تعریفیں اللہ کے لیے ہیں اور میں اسی کی خوب تعریف کرتا ہوں، اللہ کی ذات پاک ہے، اور میں صبح و شام اس کی ذات کی پاکی بیان کرتا ہوں تو نبی اکرم صلی اللہ علیہ وسلم نے پوچھا: یہ کلمے کس نے کہے ہیں؟ تو اس آدمی نے عرض کیا: اللہ کے نبی! میں نے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں نے بارہ فرشتوں کو اس پر جھپٹتے دیکھا ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 886,
			"arabicnumber": 886,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھ رہے تھے کہ اسی دوران لوگوں میں سے ایک شخص نے: «اللہ أكبر كبيرا والحمد لله كثيرا وسبحان اللہ بكرة وأصيلا» اللہ بہت بڑا ہے، اور میں اسی کی بڑائی بیان کرتا ہوں، تمام تعریفیں اللہ کے لیے ہیں اور میں اسی کی خوب تعریف کرتا ہوں، اللہ کی ذات پاک ہے، اور میں صبح و شام اس کی ذات کی پاکی بیان کرتا ہوں کہا، تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا: یہ کلمے کس نے کہے ہیں؟ تو لوگوں میں سے ایک شخص نے عرض کیا: اللہ کے رسول! میں نے کہے ہیں، تو آپ نے فرمایا: مجھے اس کلمہ پر حیرت ہوئی ، اور آپ نے ایک ایسی بات ذکر کی جس کا مفہوم یہ ہے کہ اس کے لیے آسمان کے دروازے کھول دیئے گئے، ابن عمر رضی اللہ عنہم کہتے ہیں کہ جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ کہتے سنا ہے میں نے اسے کبھی نہیں چھوڑا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 887,
			"arabicnumber": 887,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ نماز میں کھڑے ہوتے تو اپنے داہنے ہاتھ سے اپنا بایاں ہاتھ پکڑتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 888,
			"arabicnumber": 888,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے مجھے دیکھا کہ میں نماز میں اپنا بایاں ہاتھ اپنے داہنے ہاتھ پر رکھے ہوئے تھا، تو آپ صلی اللہ علیہ وسلم نے میرا داہنا ہاتھ پکڑا اور اسے میرے بائیں ہاتھ پر رکھ دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 889,
			"arabicnumber": 889,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نے ( اپنے جی میں ) کہا کہ میں یہ ضرور دیکھوں گا کہ رسول اللہ صلی اللہ علیہ وسلم نماز کیسے پڑھتے ہیں ؛ چنانچہ میں نے آپ کو دیکھا کہ آپ کھڑے ہوئے تو اللہ اکبر کہا، اور اپنے دونوں ہاتھ یہاں تک اٹھائے کہ انہیں اپنے کانوں کے بالمقابل لے گئے، پھر آپ نے اپنا داہنا ہاتھ اپنی بائیں ہتھیلی ( کی پشت ) ، کلائی اور بازو پر رکھا ۱؎، پھر جب رکوع کرنے کا ارادہ کیا تو پھر اسی طرح اپنے دونوں ہاتھوں کو اٹھایا، پھر آپ صلی اللہ علیہ وسلم نے اپنے دونوں ہاتھوں کو اپنے دونوں گھٹنوں پر رکھا، پھر جب آپ نے رکوع سے اپنا سر اٹھایا تو پھر اسی طرح اپنے دونوں ہاتھوں کو اٹھایا، پھر آپ نے سجدہ کیا، اور اپنی دونوں ہتھیلیوں کو اپنے دونوں کانوں کے بالمقابل رکھا، پھر آپ نے قعدہ کیا، اور اپنے بائیں پیر کو بچھا لیا، اور اپنی بائیں ہتھیلی کو اپنی بائیں ران اور گھٹنے پر رکھا، اور اپنی داہنی کہنی کا سرا اپنی داہنی ران کے اوپر اٹھائے رکھا، پھر آپ نے اپنی انگلیوں میں سے دو کو بند ۲؎ کر لیا، اور ( بیچ کی انگلی اور انگوٹھے سے ) حلقہ ( دائرہ ) بنا لیا، پھر آپ صلی اللہ علیہ وسلم نے اپنی شہادت کی انگلی اٹھائی، تو میں نے آپ کو دیکھا کہ آپ اسے حرکت دے رہے تھے اور اس سے دعا کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 890,
			"arabicnumber": 890,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اس بات سے منع کیا ہے کہ کوئی شخص کوکھ ( کمر ) پر ہاتھ رکھ کر نماز پڑھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 891,
			"arabicnumber": 891,
			"text": "زیاد بن صبیح کہتے ہیں کہ میں نے ابن عمر رضی اللہ عنہم کے بغل میں نماز پڑھی تو میں نے اپنا ہاتھ اپنی کوکھ ( کمر ) پر رکھ لیا، تو انہوں نے اس طرح اپنے ہاتھ سے مارا، جب میں نے نماز پڑھ لی تو ایک شخص سے ( پوچھا ) یہ کون ہیں؟ انہوں نے کہا: عبداللہ بن عمر رضی اللہ عنہم ہیں، میں نے ان سے پوچھا: ابوعبدالرحمٰن! میری کیا چیز آپ کو ناگوار لگی؟ تو انہوں نے کہا: یہ صلیب کی ہیئت ہے، رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اس سے روکا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 892,
			"arabicnumber": 892,
			"text": "ابوعبیدہ سے روایت ہے کہ عبداللہ بن مسعود رضی اللہ عنہ نے ایک شخص کو دیکھا کہ وہ اپنے دونوں قدم ملا کر نماز پڑھ رہا ہے، تو انہوں نے کہا: اس نے سنت کی مخالفت کی ہے، اگر یہ ان دونوں کو ایک دوسرے سے جدا رکھتا تو بہتر ہوتا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 893,
			"arabicnumber": 893,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ انہوں نے ایک شخص کو نماز پڑھتے ہوئے دیکھا، اس نے اپنے دونوں قدم ملا رکھا تھا تو انہوں نے کہا: یہ سنت سے چوک گیا، اگر وہ ان دونوں کو ایک دوسرے سے جدا رکھتا تو میرے نزدیک زیادہ اچھا ہوتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 894,
			"arabicnumber": 894,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز شروع کرتے تو تھوڑی دیر چپ رہتے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 895,
			"arabicnumber": 895,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز شروع کرتے تو تھوڑی دیر چپ رہتے، تو میں نے آپ سے پوچھا: اللہ کے رسول! میرے ماں باپ آپ پر قربان ہوں، آپ تکبیر تحریمہ اور قرأت کے درمیان اپنی خاموشی میں کیا پڑھتے ہیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں کہتا ہوں: «اللہم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللہم نقني من خطاياى كما ينقى الثوب الأبيض من الدنس اللہم اغسلني من خطاياى بالماء والثلج والبرد» اے اللہ! تو میرے اور میرے گناہوں کے درمیان اتنی دوری کر دے جتنی تو نے مشرق و مغرب کے درمیان کر رکھی ہے، اے اللہ! تو مجھے میرے گناہوں سے پاک صاف کر دے جس طرح میل کچیل سے سفید کپڑا صاف کیا جاتا ہے، اے اللہ! تو میرے گناہوں کو پانی، برف اور اولے سے دھو دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 896,
			"arabicnumber": 896,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب نماز شروع کرتے تو اللہ اکبر کہتے، پھر یہ دعا پڑھتے: «إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللہم اهدني لأحسن الأعمال وأحسن الأخلاق لا يهدي لأحسنها إلا أنت وقني سيئ الأعمال وسيئ الأخلاق لا يقي سيئها إلا أنت» بلاشبہ میری نماز، میری قربانی، میرا جینا اور میرا مرنا اللہ ہی تعالیٰ کے لیے ہے جو تمام جہانوں کا رب ہے، اس کا کوئی شریک نہیں، اور مجھے اسی کا حکم دیا گیا ہے، اور میں فرمانبرداروں میں سے ہوں، اے اللہ! مجھے حسن اعمال اور حسن اخلاق کی توفیق دے، تیرے سوا کوئی اس کی توفیق نہیں دے سکتا، اور مجھے برے اعمال اور قبیح اخلاق سے بچا، تیرے سوا کوئی ان برائیوں سے بچا نہیں سکتا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 897,
			"arabicnumber": 897,
			"text": "علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز شروع کرتے تو اللہ اکبر کہتے، پھر یہ دعا پڑھتے: «وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللہم أنت الملك لا إله إلا أنت أنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك أنا بك وإليك تباركت وتعاليت أستغفرك وأتوب إليك» میں نے اپنا رخ یکسو ہو کر اس ذات کی جانب کر لیا ہے جس نے آسمانوں اور زمین کو پیدا کیا، اور میں اللہ تعالیٰ کے ساتھ ساجھی بنانے والوں میں سے نہیں ہوں، یقیناً میری صلاۃ، میری قربانی، میری زندگی اور میری موت سب اللہ کے لیے ہے، جو تمام جہاں کا رب ہے، اس کا کوئی شریک نہیں، مجھے اسی کا حکم دیا گیا ہے، اور میں فرمانبرداروں میں سے ہوں، اے اللہ! تو صاحب قوت و اقتدار ہے، تیرے سوا کوئی معبود برحق نہیں، میں تیرا غلام ہوں، میں نے اپنی جان پر ظلم کیا ہے، اور میں اپنے گناہوں کا اعتراف کرتا ہوں، تو میرے تمام گناہوں کو بخش دے، تیرے سوا گناہوں کی مغفرت کوئی نہیں کر سکتا، اور مجھے حسن اخلاق کی توفیق دے، تیرے سوا کوئی اس کی توفیق نہیں دے سکتا، اور مجھ سے برے اخلاق پھیر دے، تیرے سوا اس کی برائی مجھ سے کوئی پھیر نہیں سکتا، میں تیری تابعداری کے لیے باربار حاضر ہوں، اور ہر طرح کی خیر تیرے ہاتھ میں ہے، اور شر سے تیرا کوئی علاقہ نہیں ۲؎، میں تیری وجہ سے ہوں، اور مجھے تیری ہی طرف پلٹنا ہے، تو صاحب برکت اور صاحب علو ہے، میں تجھ سے مغفرت کی درخواست کرتا ہوں، اور تجھ سے اپنے گناہوں کی توبہ کرتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 898,
			"arabicnumber": 898,
			"text": "محمد بن مسلمہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نفل نماز پڑھنے کے لیے کھڑے ہوتے تو کہتے: «اللہ أكبر وجهت وجهي للذي فطر السموات والأرض حنيفا مسلما وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين اللہم أنت الملك لا إله إلا أنت سبحانك وبحمدك» اللہ بہت بڑا ہے، میں نے اپنا رخ یکسو ہو کر اس ذات کی جانب کر لیا جس نے آسمانوں اور زمین کو پیدا کیا، اور میں اللہ کے ساتھ ساجھی بنانے والوں میں سے نہیں ہوں، یقیناً میری نماز، میری قربانی، میری زندگی اور میری موت سب اللہ کے لیے ہے، جو تمام جہانوں کا رب ( پالنہار ) ہے جس کا کوئی ساجھی نہیں، مجھے اسی کا حکم دیا گیا ہے، اور میں پہلا مسلمان ہوں، اے اللہ! تو صاحب قدرت و اقتدار ہے، تیرے سوا کوئی معبود برحق نہیں، تیری ذات تمام عیوب سے پاک ہے، اور تو لائق حمد وثناء ہے ) ، پھر قرآت فرماتے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 899,
			"arabicnumber": 899,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب نماز شروع کرتے تو کہتے: «سبحانك اللہم وبحمدك تبارك اسمك وتعالى جدك ولا إله غيرك» اے اللہ! تو ( شرک اور تمام عیبوں سے ) پاک ہے، اور لائق حمد ہے، تیرا نام بابرکت ہے، اور تیری شان بلند و بالا ہے، اور تیرے سوا کوئی حقیقی معبود نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 900,
			"arabicnumber": 900,
			"text": "ابوسعید رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز شروع کرتے تو کہتے: «سبحانك اللہم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك» اے اللہ! تو ( تمام عیبوں سے ) پاک ہے، اور لائق حمد تو ہی ہے، اور بابرکت ہے تیرا نام، اور بلند ہے تیری شان، اور تیرے سوا کوئی حقیقی معبود نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 901,
			"arabicnumber": 901,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں نماز پڑھا رہے تھے کہ اتنے میں ایک شخص آیا، اور مسجد میں داخل ہوا اس کی سانس پھول گئی تھی، تو اس نے «اللہ أكبر الحمد لله حمدا كثيرا طيبا مباركا فيه» اللہ بہت بڑا ہے، اللہ کے لیے بہت زیادہ تعریفیں ہیں ایسی تعریف جو پاکیزہ بابرکت ہو کہا، تو جب رسول اللہ صلی اللہ علیہ وسلم نے اپنی نماز پوری کر لی تو پوچھا: یہ کلمے کس نے کہے تھے؟ لوگ خاموش رہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس نے کوئی قابل حرج بات نہیں کہی ، تو اس شخص نے کہا: میں نے اے اللہ کے رسول! میں آیا اور میری سانس پھول رہی تھی تو میں نے یہ کلمات کہے، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میں نے بارہ فرشتوں کو دیکھا سب جھپٹ رہے تھے کہ اسے کون اوپر لے جائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 902,
			"arabicnumber": 902,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم، ابوبکر اور عمر رضی اللہ عنہم «الحمد لله رب العالمين» سے قرآت شروع کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 903,
			"arabicnumber": 903,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ اور ابوبکر اور عمر رضی اللہ عنہم کے ساتھ نماز پڑھی تو ان لوگوں نے «الحمد لله رب العالمين» سے قرآت شروع کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 904,
			"arabicnumber": 904,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ ایک دن آپ یعنی نبی اکرم صلی اللہ علیہ وسلم ہمارے درمیان تشریف فرما تھے کہ یکایک آپ کو جھپکی سی آئی، پھر مسکراتے ہوئے نے اپنا سر اٹھایا، تو ہم نے آپ سے پوچھا: اللہ کے رسول! آپ کو کس چیز نے ہنسایا؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: مجھ پر ابھی ابھی ایک سورت اتری ہے«‏‏‏‏بسم اللہ الرحمن الرحيم ‏* إنا أعطيناك الكوثر * فصل لربك وانحر * إن شانئك هو الأبتر» شروع کرتا ہوں اللہ کے نام سے جو بڑا مہربان، نہایت رحم والا ہے، یقیناً ہم نے آپ کو کوثر عطا فرمائی، تو آپ اپنے رب کے لیے صلاۃ پڑھیں، اور قربانی کریں، یقیناً آپ کا دشمن ہی لاوارث اور بے نام و نشان ہے ، پھر آپ صلی اللہ علیہ وسلم نے پوچھا: کیا تم جانتے ہو کہ کوثر کیا ہے؟ ہم نے عرض کیا: اللہ اور اس کے رسول بہتر جانتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: وہ جنت کی ایک نہر ہے جس کا میرے رب نے وعدہ کیا ہے، جس کے آبخورے تاروں کی تعداد سے بھی زیادہ ہیں، میری امت اس حوض پر میرے پاس آئے گی، ان میں سے ایک شخص کھینچ لیا جائے گا تو میں کہوں گا: میرے رب! یہ تو میری امت میں سے ہے؟ تو اللہ تعالیٰ مجھ سے فرمائے گا: تمہیں نہیں معلوم کہ اس نے تمہارے بعد کیا کیا بدعتیں ایجاد کی ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 905,
			"arabicnumber": 905,
			"text": "نعیم المجمر کہتے ہیں کہ میں نے ابوہریرہ رضی اللہ عنہ کے پیچھے نماز پڑھی، تو انہوں نے «بسم اللہ الرحمن الرحيم» کہا، پھر سورۃ فاتحہ پڑھی، اور جب «غير المغضوب عليهم ولا الضالين» پر پہنچے آمین کہی، لوگوں نے بھی آمین کہی ۱؎، اور جب جب وہ سجدہ کرتے تو اللہ اکبر کہتے، اور جب دوسری رکعت میں بیٹھنے کے بعد کھڑے ہوئے تو اللہ اکبر کہا، اور جب سلام پھیرا تو کہا: اس ذات کی قسم ہے جس کے ہاتھ میں میری جان ہے، میں تم میں نماز کے اعتبار سے رسول اللہ صلی اللہ علیہ وسلم سے سب سے زیادہ مشابہ ہوں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 906,
			"arabicnumber": 906,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نماز پڑھائی، تو آپ نے ہمیں «بسم اللہ الرحمن الرحيم» کی قرآت نہیں سنائی، اور ہمیں ابوبکر و عمر رضی اللہ عنہم نے بھی نماز پڑھائی، تو ہم نے ان دونوں سے بھی اسے نہیں سنا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 907,
			"arabicnumber": 907,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم، ابوبکر، عمر اور عثمان رضی اللہ عنہم کے پیچھے نماز پڑھی لیکن میں نے ان میں سے کسی ایک کو بھی«بسم اللہ الرحمن الرحيم» زور سے پڑھتے نہیں سنا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 908,
			"arabicnumber": 908,
			"text": "عبداللہ بن مغفل کے بیٹے کہتے ہیں کہ عبداللہ بن مغفل رضی اللہ عنہ جب ہم میں سے کسی سے «‏بسم اللہ الرحمن الرحيم» پڑھتے ہوئے سنتے تو کہتے: میں نے رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی، ابوبکر رضی اللہ عنہ کے پیچھے نماز پڑھی، اور عمر رضی اللہ عنہ کے پیچھے بھی نماز پڑھی لیکن میں نے ان میں سے کسی کو بھی «‏بسم اللہ الرحمن الرحيم» پڑھتے نہیں سنا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 909,
			"arabicnumber": 909,
			"text": "ابوسائب مولی ہشام بن زہرہ کہتے ہیں کہ میں نے ابوہریرہ رضی اللہ عنہ کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے نماز پڑھی اور اس میں سورۃ فاتحہ نہیں پڑھی تو وہ نماز ناقص ہے، ناقص ہے، ناقص ہے، پوری نہیں ، میں نے پوچھا: ابوہریرہ! کبھی میں امام کے پیچھے ہوتا ہوں تو ( کیسے پڑھوں؟ ) تو انہوں نے میرا ہاتھ دبایا، اور کہا: اے فارسی! اسے اپنے جی میں پڑھ لیا کرو کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا ہے کہ اللہ تعالیٰ فرماتا ہے: میں نے نماز ۱؎ کو اپنے اور اپنے بندے کے درمیان دو حصوں میں بانٹ دیا ہے، تو آدھی میرے لیے ہے اور آدھی میرے بندے کے لیے، اور میرے بندے کے لیے وہ ہے جو وہ مانگے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم سورۃ فاتحہ پڑھو، جب بندہ «الحمد لله رب العالمين» کہتا ہے ۲؎ تو اللہ تعالیٰ فرماتا ہے: میرے بندے نے میری حمد ( تعریف ) کی، اسی طرح جب بندہ «‏الرحمن الرحيم» کہتا ہے تو اللہ تعالیٰ فرماتا ہے: میرے بندے نے میری ثنا بیان کی، جب بندہ «مالك يوم الدين» کہتا ہے تو اللہ تعالیٰ فرماتا ہے: میرے بندے نے میری تعظیم و تمجید کی، اور جب بندہ «إياك نعبد وإياك نستعين» کہتا ہے تو اللہ تعالیٰ کہتا ہے: یہ آیت میرے اور میرے بندے دونوں کے درمیان مشترک ہے، اور جب بندہ «‏اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين» کہتا ہے تو اللہ تعالیٰ فرماتا ہے: یہ تینوں آیتیں میرے بندے کے لیے ہیں، اور میرے بندے کے لیے وہ ہے جو وہ مانگے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 910,
			"arabicnumber": 910,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس شخص کی نماز نہیں جو سورۃ فاتحہ نہ پڑھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 911,
			"arabicnumber": 911,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اس شخص کی نماز نہیں جو سورۃ فاتحہ اور اس کے ساتھ کچھ مزید نہ پڑھے ۱؎ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 912,
			"arabicnumber": 912,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اور جبرائیل علیہ السلام ایک ساتھ ہی تھے کہ اچانک جبرائیل علیہ السلام نے آسمان کے اوپر دروازہ کھلنے کی آواز سنی، تو نگاہ آسمان کی طرف اٹھائی اور کہا: یہ آسمان کا ایک دروازہ کھلا ہے جو اس سے پہلے کبھی نہیں کھلا تھا، پھر اس سے ایک فرشتہ اترا، اور نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور اس نے کہا: مبارک ہو! آپ کو دو نور دیا گیا ہے جو آپ سے پہلے کسی نبی کو نہیں دیا گیا، سورۃ فاتحہ اور سورۃ البقرہ کی آخری آیتیں، ان دونوں میں سے ایک حرف بھی تم پڑھو گے تو ( اس کا ثواب ) تمہیں ضرور دیا جائے گا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "ابوسعید بن معلی رضی اللہ عنہ کہتے ہیں کہ وہ نماز پڑھ رہے تھے کہ نبی اکرم صلی اللہ علیہ وسلم ان کے پاس سے گزرے، اور انہیں بلایا، تو میں نے نماز پڑھی، پھر آپ کے پاس آیا، تو آپ صلی اللہ علیہ وسلم نے پوچھا: ابوسعید تمہیں مجھے جواب دینے سے کس چیز نے روکا؟ کہا: میں نماز پڑھ رہا تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا اللہ تعالیٰ نے نہیں فرمایا ہے!: «يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم» اے ایمان والو! اللہ اور اس کے رسول کی پکار پر لبیک کہو جب وہ تمہیں ایسی چیز کی طرف بلائیں جو تمہارے لیے حیات بخش ہو ( الحجر: ۸۷ ) کیا تم کو مسجد سے نکلنے سے پہلے میں ایک عظیم ترین سورت نہ سکھاؤں؟ آپ مسجد سے نکلنے لگے تو میں نے عرض کیا: اللہ کے رسول! آپ نے جو کہا تھا بتا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: وہ سورت«‏الحمد لله رب العالمين» ہے، اور یہی «سبع المثاني» ۱؎ ہے جو مجھے دی گئی ہے، یہی قرآن عظیم ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 914,
			"arabicnumber": 914,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے سورۃ فاتحہ جیسی کوئی سورت نہ تو رات میں اتاری ہے اور نہ انجیل میں، یہی «سبع المثاني» ہے، یہ میرے اور میرے بندے کے بیچ بٹی ہوئی ہے، اور میرے بندے کے لیے وہ ہے جو وہ مانگے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 915,
			"arabicnumber": 915,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کو «سبع المثاني» یعنی سات لمبی سورتیں ۱؎ عطا کی گئی ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 916,
			"arabicnumber": 916,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے اللہ عزوجل کے قول: «سبعا من المثاني» کی تفسیر میں مروی ہے کہ اس سے مراد سات لمبی سورتیں ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 917,
			"arabicnumber": 917,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم نے ظہر پڑھائی تو ایک آدمی نے آپ کے پیچھے سورۃ «سبح اسم ربك الأعلى» پڑھی، جب آپ صلی اللہ علیہ وسلم نے نماز پڑھ لی تو پوچھا: سورۃ «سبح اسم ربك الأعلى» کس نے پڑھی؟ تو اس آدمی نے عرض کیا: میں نے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: مجھے ایسا لگا کہ تم میں سے کسی نے مجھے خلجان میں ڈال دیا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 918,
			"arabicnumber": 918,
			"text": "عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ظہر یا عصر پڑھائی، اور ایک آدمی آپ کے پیچھے قرآت کر رہا تھا، تو جب آپ نے سلام پھیرا تو پوچھا: تم میں سے سورۃ «سبح اسم ربك الأعلى» کس نے پڑھی ہے؟ لوگوں میں سے ایک شخص نے کہا: میں نے، اور میری نیت صرف خیر کی تھی، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مجھے ایسا لگا کہ تم میں سے بعض نے مجھ سے سورۃ پڑھنے میں خلجان میں دال دیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 919,
			"arabicnumber": 919,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نماز سے جس میں آپ نے زور سے قرآت فرمائی تھی سلام پھیر کر پلٹے تو پوچھا: کیا تم میں سے کسی نے ابھی میرے ساتھ قرآت کی ہے؟ تو ایک شخص نے کہا: جی ہاں! اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے فرمایا: آج بھی میں کہہ رہا تھا کہ کیا بات ہے کہ مجھ سے قرآن چھینا جا رہا ہے ۔ زہری کہتے ہیں: جب لوگوں نے یہ بات سنی تو جن نمازوں میں رسول اللہ صلی اللہ علیہ وسلم زور سے قرآت فرماتے تھے ان میں قرآت سے رک گئے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 920,
			"arabicnumber": 920,
			"text": "عبادہ بن صامت رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں کچھ نمازیں پڑھائیں جن میں قرآت بلند آواز سے کی جاتی ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب میں بآواز بلند قرآت کروں تو تم میں سے کوئی بھی سورۃ فاتحہ کے علاوہ کچھ نہ پڑھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 921,
			"arabicnumber": 921,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: امام تو بنایا ہی اس لیے گیا ہے کہ اس کی اقتداء کی جائے، تو جب وہ اللہ اکبر کہے تو تم بھی اللہ اکبر کہو، اور جب قرآت کرے تو تم خاموش رہو ۱؎، اور جب «سمع اللہ لمن حمده» کہے تو تم «اللہم ربنا لك الحمد» کہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 922,
			"arabicnumber": 922,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: امام بنایا ہی اس لیے گیا ہے کہ اس کی اقتداء کی جائے، تو جب وہ اللہ اکبر کہے تو تم بھی اللہ اکبر کہو، اور جب وہ قرآت کرے تو تم خاموش رہو ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: مخرمی کہتے تھے: وہ یعنی محمد بن سعد الانصاری ثقہ ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 923,
			"arabicnumber": 923,
			"text": "ابو الدرداء رضی اللہ عنہ سے روایت ہے کہ انہوں نے یہ کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا: کیا ہر نماز میں قرآت ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں! ( اس پر ) انصار کے ایک شخص نے کہا: یہ ( قرآت ) واجب ہو گئی، تو ابو الدرداء رضی اللہ عنہ میری طرف متوجہ ہوئے اور حال یہ تھا کہ میں ان سے سب سے زیادہ قریب تھا، تو انہوں نے کہا: میں سمجھتا ہوں کہ امام جب لوگوں کی امامت کرے تو ( امام کی قرآت ) انہیں بھی کافی ہے۔ ابوعبدالرحمٰن ( امام نسائی ) کہتے ہیں: اسے رسول اللہ صلی اللہ علیہ وسلم سے روایت کرنا غلط ہے، یہ تو صرف ابو الدرداء رضی اللہ عنہ کا قول ہے، اور اسے اس کتاب کے ساتھ انہوں نے نہیں پڑھا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 924,
			"arabicnumber": 924,
			"text": "ابن ابی اوفی رضی اللہ عنہ کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور اس نے عرض کیا: میں قرآن کچھ بھی نہیں پڑھ سکتا، تو مجھے کوئی ایسی چیز سکھا دیجئیے جو میرے لیے قرآن کے بدلے کافی ہو، آپ صلی اللہ علیہ وسلم نے فرمایا: «سبحان اللہ والحمد لله ولا إله إلا اللہ واللہ أكبر ولا حول ولا قوة إلا باللہ» اللہ پاک ہے اور اللہ ہی کے لیے حمد ہے، اور اللہ کے سوا کوئی معبود ( برحق ) نہیں، اور اللہ سب سے بڑا ہے، اور طاقت و قوت صرف اللہ ہی کی توفیق سے ہے پڑھ لیا کرو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 925,
			"arabicnumber": 925,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب قاری ( امام ) آمین کہے، تو تم بھی آمین کہو کیونکہ فرشتے بھی آمین کہتے ہیں، جس کا آمین کہنا فرشتوں کے آمین کہنے کے موافق ہو جائے ۱؎ گا تو اللہ تعالیٰ اس کے سابقہ گناہ بخش دے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 926,
			"arabicnumber": 926,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب قاری ( امام ) آمین کہے تو تم بھی آمین کہو، کیونکہ فرشتے بھی آمین کہتے ہیں، جس کا آمین کہنا فرشتوں کے آمین کہنے کے موافق ہو جائے گا، اس کے تمام سابقہ گناہ بخش دیئے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 927,
			"arabicnumber": 927,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب امام «غير المغضوب عليهم ولا الضالين» کہے تو تم آمين کہو، کیونکہ فرشتے آمین کہتے ہیں اور امام آمین کہتا ہے تو جس کا آمین کہنا فرشتوں کے آمین کہنے کے موافق ہو جائے گا اس کے تمام سابقہ گناہ بخش دیئے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 928,
			"arabicnumber": 928,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب امام آمین کہے تو تم بھی آمین کہو، کیونکہ جس کا آمین کہنا فرشتوں کے آمین کہنے کے موافق ہو جائے گا، اس کے تمام سابقہ گناہ بخش دیئے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 929,
			"arabicnumber": 929,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب امام «غير المغضوب عليهم ولا الضالين» کہے تو تم لوگ آمین کہو، کیونکہ جس کا آمین کہنا فرشتوں کے آمین کہنے کے موافق ہو جائے گا اس کے تمام سابقہ گناہ بخش دیئے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی آمین کہے اور فرشتے بھی آسمان پر آمین کہیں اور ان دونوں میں سے ایک کی آمین دوسرے کے موافق ہو جائے تو اس کے سابقہ گناہ بخش دیئے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "رفاعہ بن رافع رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی، تو مجھے چھینک آ گئی، تو میں نے «الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى» اللہ کے لیے بہت زیادہ تعریفیں ہیں، جو پاکیزہ و بابرکت ہوں، جیسا ہمارا رب چاہتا اور پسند کرتا ہے کہا، تو جب رسول اللہ صلی اللہ علیہ وسلم نماز پڑھ چکے، اور سلام پھیر کر پلٹے تو آپ نے پوچھا: نماز میں کون بول رہا تھا؟ تو کسی نے جواب نہیں دیا، پھر آپ نے دوسری بار پوچھا: نماز میں کون بول رہا تھا؟ تو رفاعہ بن رافع بن عفراء رضی اللہ عنہ نے کہا: اللہ کے رسول! میں تھا، آپ صلی اللہ علیہ وسلم نے پوچھا: تم نے کیسے کہا تھا؟ انہوں نے کہا: میں نے یوں کہا تھا: «الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى» اللہ کے لیے بہت زیادہ تعریفیں ہیں، جو پاکیزہ و بابرکت ہوں، جیسا ہمارا رب چاہتا اور پسند کرتا ہے تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، تیس سے زائد فرشتے اس پر جھپٹے کہ اسے لے کر کون اوپر چڑھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 932,
			"arabicnumber": 932,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی، جب آپ نے اللہ اکبر کہا تو اپنے دونوں ہاتھوں کو اپنے دونوں کانوں کے نیچے تک اٹھایا، پھر جب آپ نے «غير المغضوب عليهم ولا الضالين» کہا تو آپ نے آمین کہی جسے میں نے سنا، اور میں آپ کے پیچھے تھا ۱؎، پھر رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو «الحمد لله حمدا كثيرا طيبا مباركا فيه» کہتے سنا، تو جب آپ اپنی نماز سے سلام پھیر لیا تو پوچھا: نماز میں کس نے یہ کلمہ کہا تھا؟ تو اس شخص نے کہا: میں نے اللہ کے رسول! اور اس سے میں نے کسی برائی کا ارادہ نہیں کیا تھا، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اس پر بارہ فرشتے جھپٹے تو اسے عرش تک پہنچنے سے کوئی چیز روک نہیں سکی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 933,
			"arabicnumber": 933,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ حارث بن ہشام رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا: آپ پر وحی کیسے آتی ہے؟ تو آپ نے جواب دیا: گھنٹی کی آواز کی طرح، پھر وہ بند ہو جاتی ہے اور میں اسے یاد کر لیتا ہوں، اور یہ قسم میرے اوپر سب سے زیادہ سخت ہوتی ہے، اور کبھی وحی کا فرشتہ میرے پاس نوجوان آدمی کی شکل میں آتا ہے، اور وہ مجھ سے کہہ جاتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 934,
			"arabicnumber": 934,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ حارث بن ہشام رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا: آپ پر وحی کیسے آتی ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کبھی میرے پاس گھنٹی کی آواز کی شکل میں آتی ہے، اور یہ قسم میرے اوپر سب سے زیادہ سخت ہوتی ہے، پھر وہ بند ہو جاتی ہے اور جو وہ کہتا ہے میں اسے یاد کر لیتا ہوں، اور کبھی میرے پاس فرشتہ آدمی کی شکل میں آتا ہے ۱؎ اور مجھ سے باتیں کرتا ہے، اور جو کچھ وہ کہتا ہے میں اسے یاد کر لیتا ہوں ، ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے کڑکڑاتے جاڑے میں آپ پر وحی اترتے دیکھا، پھر وہ بند ہوتی اور حال یہ ہوتا کہ آپ کی پیشانی سے پسینہ بہہ رہا ہوتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 935,
			"arabicnumber": 935,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے اللہ تعالیٰ کے قول: «لا تحرك به لسانك لتعجل به * إن علينا جمعه وقرآنه» ( القیامۃ: ۱۶- ۱۷ ) کی تفسیر میں مروی ہے، کہ نبی اکرم صلی اللہ علیہ وسلم وحی اترتے وقت بڑی تکلیف برداشت کرتے تھے، اپنے ہونٹ ہلاتے رہتے تھے، تو اللہ تعالیٰ نے فرمایا: اے نبی! آپ قرآن کو جلدی یاد کرنے کے لیے اپنی زبان کو حرکت نہ دیں، کیونکہ اس کا جمع کرنا اور پڑھانا ہمارے ذمہ ہے ۱؎، ابن عباس رضی اللہ عنہم کہتے ہیں کہ «جمعه» کے معنی: اس کا آپ صلی اللہ علیہ وسلم کے سینہ میں بیٹھا دینا ہے، اور «قرآنه» کے معنی اسے اس طرح پڑھوا دینا ہے کہ جب آپ چاہیں اسے پڑھنے لگ جائیں «فإذا قرأناه فاتبع قرآنه» میں «فاتبع قرآنه» کے معنی ہیں: آپ اسے غور سے سنیں، اور چپ رہیں، چنانچہ جب جبرائیل علیہ السلام آپ کے پاس وحی لے کر آتے تو آپ بغور سنتے تھے، اور جب روانہ ہو جاتے تو آپ اسے پڑھتے جس طرح انہوں نے پڑھایا ہوتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 936,
			"arabicnumber": 936,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ میں نے ہشام بن حکیم بن حزام رضی اللہ عنہ کو سورۃ الفرقان پڑھتے سنا، انہوں نے اس میں کچھ الفاظ اس طرح پڑھے کہ نبی کریم صلی اللہ علیہ وسلم نے مجھے اس طرح نہیں پڑھائے تھے تو میں نے پوچھا: یہ سورت آپ کو کس نے پڑھائی ہے؟ انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے، میں نے کہا: آپ غلط کہتے ہیں، رسول اللہ صلی اللہ علیہ وسلم نے آپ کو اس طرح کبھی نہیں پڑھائی ہو گی! چنانچہ میں نے ان کا ہاتھ پکڑا، اور انہیں کھینچ کر رسول اللہ صلی اللہ علیہ وسلم کے پاس لے گیا، اور عرض کیا: اللہ کے رسول! آپ نے مجھے سورۃ الفرقان پڑھائی ہے، اور میں نے انہیں اس میں کچھ ایسے الفاظ پڑھتے سنا ہے جو آپ نے مجھے نہیں پڑھائے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ہشام! ذرا پڑھو تو ، تو انہوں نے ویسے ہی پڑھا جس طرح پہلے پڑھا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ سورت اسی طرح اتری ہے ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: عمر! اب تم پڑھو تو ، تو میں نے پڑھا، تب بھی آپ صلی اللہ علیہ وسلم نے فرمایا: اسی طرح اتری ہے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قرآن سات حرفوں پر نازل کیا گیا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 937,
			"arabicnumber": 937,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ میں نے ہشام بن حکیم رضی اللہ عنہ کو سورۃ الفرقان پڑھتے سنا، جس طرح میں پڑھ رہا تھا وہ اس کے خلاف پڑھ رہے تھے، جبکہ مجھے خود رسول اللہ صلی اللہ علیہ وسلم نے پڑھایا تھا، تو قریب تھا کہ میں ان کے خلاف جلد بازی میں کچھ کر بیٹھوں ۱؎، لیکن میں نے انہیں مہلت دی یہاں تک کہ وہ پڑھ کر فارغ ہو گئے، پھر میں نے ان کی چادر سمیت ان کا گریبان پکڑ کر انہیں کھینچا، اور رسول اللہ صلی اللہ علیہ وسلم کے پاس لے کر آیا، اور عرض کیا: اللہ کے رسول! میں نے انہیں سورۃ الفرقان ایسے طریقہ پر پڑھتے سنا ہے جو اس طریقہ کے خلاف ہے جس طریقہ پر آپ نے مجھے یہ سورت پڑھائی ہے، رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: ( اچھا ) تم پڑھو! ، انہوں نے اسی طریقہ پر پڑھا جس پر میں نے ان کو پڑھتے ہوئے سنا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ اسی طرح نازل کی گئی ہے ، پھر مجھ سے فرمایا: تم پڑھو! تو میں نے بھی پڑھی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ اسی طرح نازل کی گئی ہے، یہ قرآن سات حرفوں پر نازل کیا گیا ہے، ان میں سے جو آسان ہو تم اسی طرح پڑھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 938,
			"arabicnumber": 938,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں ہشام بن حکیم رضی اللہ عنہ کو سورۃ الفرقان پڑھتے سنا تو میں ان کی قرآت غور سے سننے لگا، تو کیا دیکھتا ہوں کہ وہ کچھ الفاظ ایسے طریقے پر پڑھ رہے ہیں جس پر رسول اللہ صلی اللہ علیہ وسلم نے مجھے نہیں پڑھایا تھا، چنانچہ قریب تھا کہ میں ان پر نماز میں ہی جھپٹ پڑوں لیکن میں نے صبر سے کام لیا، یہاں تک کہ انہوں نے سلام پھیر دیا، جب وہ سلام پھیر چکے تو میں نے ان کی چادر سمیت ان کا گریبان پکڑا، اور پوچھا: یہ سورت جو میں نے آپ کو پڑھتے ہوئے سنی ہے آپ کو کس نے پڑھائی ہے؟ انہوں نے جواب دیا: مجھے رسول اللہ صلی اللہ علیہ وسلم نے پڑھائی ہے، میں نے کہا: تم جھوٹ کہہ رہے ہو: اللہ کی قسم یہی سورت جو میں نے آپ کو پڑھتے ہوئے سنی ہے رسول اللہ صلی اللہ علیہ وسلم نے بذات خود مجھے پڑھائی ہے، بالآخر میں انہیں کھینچ کر رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا، اور میں نے عرض کیا: اللہ کے رسول! میں نے انہیں سورۃ الفرقان کے کچھ الفاظ پڑھتے سنا ہے کہ اس طرح آپ نے مجھے نہیں پڑھایا ہے، حالانکہ سورۃ الفرقان آپ نے ہی مجھ کو پڑھائی ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عمر! انہیں چھوڑ دو، اور ہشام! تم پڑھو! تو انہوں نے اسے اسی طرح پر پڑھا جس طرح میں نے انہیں پڑھتے سنا تھا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ اسی طرح نازل کی گئی ہے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عمر! اب تم پڑھو! تو میں نے اس طرح پڑھا جیسے آپ نے مجھے پڑھایا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ اسی طرح نازل کی گئی ہے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ قرآن سات حرفوں پر نازل کیا گیا ہے، ان میں سے جو آسان ہو اسی پر پڑھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 939,
			"arabicnumber": 939,
			"text": "ابی بن کعب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم قبیلہ غفار کے تالاب کے پاس تھے کہ جبرائیل علیہ السلام آپ کے پاس تشریف لائے، اور کہنے لگے کہ اللہ تعالیٰ نے آپ کو حکم دیا ہے کہ آپ اپنی امت کو ایک ہی حرف پر قرآن پڑھائیں، آپ صلی اللہ علیہ وسلم نے فرمایا: میں اللہ تعالیٰ سے عفو و مغفرت کی درخواست کرتا ہوں، اور میری امت اس کی طاقت نہیں رکھتی ، پھر دوسری بار جبرائیل علیہ السلام آپ کے پاس آئے، اور انہوں نے کہا: اللہ تعالیٰ نے آپ کو حکم دیا ہے کہ آپ اپنی امت کو دو حرفوں پر قرآن پڑھائیں، آپ صلی اللہ علیہ وسلم نے فرمایا: میں اللہ سے عفو و مغفرت کا طلب گار ہوں، اور میری امت اس کی طاقت نہیں رکھتی ، پھر جبرائیل علیہ السلام تیسری بار آپ کے پاس آئے اور انہوں کہا: اللہ تعالیٰ آپ کو حکم دیتا ہے کہ آپ اپنی امت کو قرآن تین حرفوں پر قرآن پڑھائیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں اپنے رب سے عفو و مغفرت کی درخواست کرتا ہوں، اور میری امت اس کی طاقت نہیں رکھتی ہے ، پھر وہ آپ کے پاس چوتھی بار آئے، اور انہوں نے کہا: اللہ تعالیٰ آپ کو حکم دے رہا ہے کہ آپ اپنی امت کو سات حرفوں پر قرآن پڑھائیں، تو وہ جس حرف پر بھی پڑھیں گے صحیح پڑھیں گے۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: اس حدیث میں حکم کی مخالفت کی گئی ہے، منصور بن معتمر نے ان کی مخالفت کی ہے، اسے «مجاهد عن عبيد بن عمير» کے طریق سے مرسلاً روایت کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 940,
			"arabicnumber": 940,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے ایک سورت پڑھائی تھی، میں مسجد میں بیٹھا ہوا تھا کہ میں نے ایک شخص کو دیکھا کہ وہ اسی سورت کو پڑھ رہا ہے، اور میری قرآت کے خلاف پڑھ رہا ہے، تو میں نے اس سے پوچھا: تمہیں یہ سورت کس نے سکھائی ہے؟ اس نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے، میں نے کہا: تم مجھ سے جدا نہ ہونا جب تک کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس نہ آ جائیں، میں آپ کے پاس آیا، اور میں نے عرض کیا: اللہ کے رسول! یہ شخص وہ سورت جسے آپ نے مجھے سکھائی ہے میرے طریقے کے خلاف پڑھ رہا ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابی! تم پڑھو تو میں نے وہ سورت پڑھی، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بہت خوب ، پھر آپ صلی اللہ علیہ وسلم نے اس شخص سے فرمایا: تم پڑھو! تو اس نے اسے میری قرآت کے خلاف پڑھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بہت خوب ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ابی! قرآن سات حرفوں پر نازل کیا گیا ہے، اور ہر ایک درست اور کافی ہے ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: معقل بن عبیداللہ ( زیادہ ) قوی نہیں ہیں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 941,
			"arabicnumber": 941,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ جب سے میں نے اسلام قبول کیا تو میرے دل میں کوئی خلش پیدا نہیں ہوئی سوائے اس کے کہ میں نے ایک آیت پڑھی، اور دوسرے شخص نے اسے میری قرآت کے خلاف پڑھا، تو میں نے کہا: مجھے یہ آیت خود رسول اللہ صلی اللہ علیہ وسلم نے پڑھائی ہے، تو دوسرے نے بھی کہا: مجھے بھی یہ آیت رسول اللہ صلی اللہ علیہ وسلم نے ہی پڑھائی ہے، بالآخر میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور میں نے عرض کیا: اللہ کے نبی! آپ نے مجھے یہ آیت اس اس طرح پڑھائی ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں ، اور دوسرے شخص نے کہا: کیا آپ نے مجھے ایسے ایسے نہیں پڑھایا تھا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں! جبرائیل اور میکائیل علیہما السلام دونوں میرے پاس آئے، جبرائیل میرے داہنے اور میکائیل میرے بائیں طرف بیٹھے، جبرائیل علیہ السلام نے کہا: آپ قرآن ایک حرف پر پڑھا کریں، تو میکائیل نے کہا: آپ اسے ( اللہ سے ) زیادہ کرا دیجئیے یہاں تک کہ وہ سات حرفوں تک پہنچے، ( اور کہا کہ ) ہر حرف شافی و کافی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 942,
			"arabicnumber": 942,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: صاحب قرآن ۱؎ کی مثال اس شخص کی سی ہے جس کے اونٹ رسی سے بندھے ہوں، جب تک وہ ان کی نگرانی کرتا رہتا ہے تو وہ بندھے رہتے ہیں، اور جب انہیں چھوڑ دیتا ہے تو وہ بھاگ جاتے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 943,
			"arabicnumber": 943,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: یہ کتنی بری بات ہے کہ کوئی کہے: میں فلاں فلاں آیت بھول گیا ۱؎، بلکہ اسے کہنا چاہیئے کہ وہ بھلا دیا گیا، تم لوگ قرآن یاد کرتے رہو کیونکہ وہ لوگوں کے سینوں سے رسی سے کھل جانے والے اونٹ سے بھی زیادہ جلدی نکل جاتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 944,
			"arabicnumber": 944,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم فجر کی دونوں رکعتوں میں سے پہلی رکعت میں آیت کریمہ: «قولوا آمنا باللہ وما أنزل إلينا» ( البقرہ: ۱۳۶ ) اخیر آیت تک، اور دوسری رکعت میں «آمنا باللہ واشهد بأنا مسلمون» ( آل عمران: ۵۲ ) پڑھتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 945,
			"arabicnumber": 945,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فجر کی دونوں رکعتوں میں «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏»پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 946,
			"arabicnumber": 946,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کو فجر کی سنتیں پڑھتے دیکھتی، آپ انہیں اتنی ہلکی پڑھتے کہ میں ( اپنے جی میں ) کہتی تھی: کیا آپ صلی اللہ علیہ وسلم نے ان دونوں میں سورۃ فاتحہ پڑھی ہے ( یا نہیں ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 947,
			"arabicnumber": 947,
			"text": "نبی اکرم صلی اللہ علیہ وسلم کے ایک صحابی روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے نماز فجر پڑھائی، اس میں آپ نے سورۃ الروم کی تلاوت فرمائی، تو آپ کو شک ہو گیا، جب نماز پڑھ چکے تو آپ نے فرمایا: لوگوں کو کیا ہو گیا ہے کہ ہمارے ساتھ نماز پڑھتے ہیں، اور ٹھیک سے طہارت حاصل نہیں کرتے، یہی لوگ ہمیں قرآت میں شک میں ڈال دیتے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 948,
			"arabicnumber": 948,
			"text": "ابوبرزہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم فجر میں ساٹھ سے سو آیتوں تک پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 949,
			"arabicnumber": 949,
			"text": "ام ہشام بنت حارثہ بن نعمان رضی اللہ عنہا کہتی ہیں کہ میں نے «ق، والقرآن المجيد» کو رسول اللہ صلی اللہ علیہ وسلم کے پیچھے ( سن سن کر ) یاد کیا ہے، آپ اسے فجر میں ( بکثرت ) پڑھا کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 950,
			"arabicnumber": 950,
			"text": "زیاد بن علاقہ کے چچا قطبہ بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز فجر پڑھی، تو آپ نے ایک رکعت میں «والنخل باسقات لها طلع نضيد» پڑھی ۱؎، شعبہ کہتے ہیں: میں نے زیاد سے پر ہجوم بازار میں ملاقات کی تو انہوں نے کہا: سورۃ «ق» پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 951,
			"arabicnumber": 951,
			"text": "عمرو بن حریث رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو فجر میں «إذا الشمس كورت» پڑھتے سنا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 952,
			"arabicnumber": 952,
			"text": "عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے معوذتین کے متعلق پوچھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فجر میں انہیں دونوں سورتوں کے ذریعہ ہماری امامت فرمائی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 953,
			"arabicnumber": 953,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پیچھے چلا، اور آپ سوار تھے تو میں نے آپ کے پاؤں پہ اپنا ہاتھ رکھا، اور آپ سے عرض کیا: اللہ کے رسول! آپ مجھے سورۃ هود اور سورۃ یوسف پڑھا دیجئیے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ کے نزدیک «قل أعوذ برب الفلق‏» اور «قل أعوذ برب الناس» سے زیادہ بلیغ سورت تم کوئی اور نہیں پڑھو گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 954,
			"arabicnumber": 954,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: آج رات میرے اوپر کچھ ایسی آیتیں اتریں ہیں جن کی طرح ( کوئی اور آیتیں ) نہیں دیکھی گئیں، وہ ہیں { «قل أعوذ برب الفلق‏» اور «قل أعوذ برب الناس» ۔}",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 955,
			"arabicnumber": 955,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ جمعہ کے دن فجر میں رسول اللہ صلی اللہ علیہ وسلم «الم تنزیل» ( سورۃ الم سجدہ ) اور «ھل أتی» ( سورۃ الدہر ) پڑھتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 956,
			"arabicnumber": 956,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جمعہ کے دن فجر میں «تنزیل سجدہ» ( سورۃ السجدہ ) اور «ھل أتی علی الإنسان» ( سورۃ دھر ) پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 957,
			"arabicnumber": 957,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے سورۃ «ص» میں سجدہ کیا، اور فرمایا: داود علیہ السلام نے یہ سجدہ توبہ کے لیے کیا تھا، اور ہم یہ سجدہ ( توبہ کی قبولیت پر ) شکر ادا کرنے کے لیے کر رہے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 958,
			"arabicnumber": 958,
			"text": "مطلب بن ابی وداعہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مکہ میں سورۃ النجم پڑھی، تو آپ نے سجدہ کیا، اور جو لوگ آپ کے پاس تھے انہوں نے بھی سجدہ کیا، لیکن میں نے اپنا سر اٹھائے رکھا، اور سجدہ کرنے سے انکار کیا، ( راوی کہتے ہیں ) ان دنوں مطلب نے اسلام قبول نہیں کیا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے سورۃ النجم پڑھی، تو اس میں آپ نے سجدہ کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "عطاء بن یسار سے روایت ہے کہ انہوں نے زید بن ثابت رضی اللہ عنہ سے امام کے ساتھ قرآت کرنے کے بارے میں پوچھا، تو انہوں نے کہا: امام کے ساتھ قرآت نہیں ہے ۱؎، اور انہوں نے کہا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو «والنجم اذا ھوی» پڑھ کر سنایا، تو آپ صلی اللہ علیہ وسلم نے سجدہ نہیں کیا ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "ابوسلمہ بن عبدالرحمٰن سے روایت ہے کہ ابوہریرہ رضی اللہ عنہ نے «إذا السماء انشقت» پڑھ کر سنایا تو انہوں نے اس میں سجدہ کیا، جب وہ سجدہ سے فارغ ہوئے تو انہوں نے لوگوں کو بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس میں سجدہ کیا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے «إذا السماء انشقت» میں سجدہ کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ہم نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ «إذا السماء انشقت» اور «اقرأ باسم ربك» میں سجدہ کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "اس سند سے بھی ابوہریرہ رضی اللہ عنہ سے اسی جیسی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ابوبکر اور عمر رضی اللہ عنہم نے «إذا السماء انشقت» میں سجدہ کیا، اور جو ان دونوں سے بہتر تھے انہوں نے بھی ( یعنی نبی اکرم صلی اللہ علیہ وسلم نے بھی ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ابوبکر و عمر رضی اللہ عنہم نے اور جو ان دونوں سے بہتر تھے، انہوں نے یعنی نبی اکرم صلی اللہ علیہ وسلم نے «إذا السماء انشقت» اور «اقرأ باسم ربك» میں سجدہ کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ «إذا السماء انشقت» اور «اقرأ باسم ربك» میں سجدہ کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "ابورافع کہتے ہیں کہ میں نے ابوہریرہ رضی اللہ عنہ کے پیچھے عشاء یعنی عتمہ کی نماز پڑھی، تو انہوں نے سورۃ «إذا السماء انشقت» پڑھی، اور اس میں سجدہ کیا، تو میں نے کہا: ابوہریرہ! اسے تو ہم کبھی نہیں کرتے تھے، انہوں نے کہا: اسے ابوالقاسم صلی اللہ علیہ وسلم نے کیا ہے، اور میں آپ کے پیچھے تھا، میں یہ سجدہ برابر کرتا رہوں گا یہاں تک کہ ابوالقاسم صلی اللہ علیہ وسلم سے جا ملوں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "عطاء کہتے ہیں کہ ابوہریرہ رضی اللہ عنہ نے کہا: ہر نماز میں قرآت کی جاتی ہے تو جسے رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سنایا ہم تمہیں سنا رہے ہیں، اور جسے آپ نے ہم سے چھپایا ہم بھی تم سے چھپا رہے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ہر نماز میں قرآت ہے، تو جسے رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سنایا ہم تمہیں سنا رہے ہیں، اور جسے آپ نے ہم سے چھپایا ہم تم سے چھپا رہے ہیں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "براء رضی اللہ عنہ کہتے ہیں کہ ہم نبی اکرم صلی اللہ علیہ وسلم کے پیچھے ظہر پڑھتے تھے، تو ہم آپ سے سورۃ لقمان اور سورۃ والذاریات کی ایک آدھ آیت کئی آیتوں کے بعد سن لیتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "عبداللہ بن عبید کہتے ہیں کہ میں نے ابوبکر بن نضر کو کہتے سنا کہ ہم طف میں انس رضی اللہ عنہ کے پاس تھے تو انہوں نے لوگوں کو ظہر پڑھائی، جب وہ فارغ ہوئے تو کہنے لگے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ظہر پڑھی، تو آپ نے ( ظہر کی ) دونوں رکعتوں میں یہی دونوں سورتیں یعنی «سبح اسم ربك الأعلى» اور «هل أتاك حديث الغاشية» پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ نماز ظہر کھڑی کی جاتی تھی، پھر جانے والا بقیع جاتا اور اپنی حاجت پوری کرتا، پھر وضو کرتا اور واپس آتا، اور رسول اللہ صلی اللہ علیہ وسلم پہلی رکعت میں ہوتے، ( کیونکہ ) آپ اسے خوب لمبی کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "ابوقتادہ رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم کہتے ہیں کہ آپ ہمیں ظہر پڑھاتے تھے تو آپ پہلی دونوں رکعتوں میں قرآت کرتے، اور یونہی کبھی ایک آدھ آیت ہمیں سنا دیتے، اور ظہر اور فجر کی پہلی رکعت بہ نسبت دوسری رکعت کے لمبی کرتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ظہر و عصر میں پہلی دونوں رکعتوں میں سورۃ فاتحہ اور دو سورتیں پڑھتے تھے، اور کبھی کبھار ہمیں ایک آدھ آیت سنا دیتے، اور پہلی رکعت میں دوسری رکعت کے بہ نسبت قرآت لمبی کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہم پر ظہر کی پہلی دو رکعتوں میں قرآت کرتے، اور کبھی کبھار آپ ہمیں ایک آدھ آیت سنا دیتے، پہلی رکعت میں لمبی قرآت کرتے اور دوسری رکعت میں اس سے کم، اور فجر میں بھی ایسے ہی کرتے تھے پہلی میں لمبی قرآت کرتے اور دوسری میں اس سے کم کرتے، اور عصر میں بھی پہلی دونوں رکعتوں میں ہم پر قرآت کرتے، پہلی میں لمبی کرتے اور دوسری میں اس سے کم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ظہر اور عصر کی پہلی دونوں رکعتوں میں سورۃ فاتحہ اور ایک ایک سورت پڑھتے تھے، اور آخری دونوں رکعتوں میں صرف سورۃ فاتحہ پڑھتے، اور کبھی کبھار ہمیں ایک آدھ آیت سنا دیتے تھے، اور ظہر کی پہلی رکعت لمبی کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ظہر اور عصر کی پہلی دونوں رکعتوں میں سورۃ فاتحہ اور ایک ایک سورت پڑھتے تھے، اور کبھی کبھار ہمیں ایک آدھ آیت سنا دیتے، اور ظہر میں پہلی رکعت لمبی کرتے، اور دوسری رکعت ( پہلی کی بہ نسبت ) مختصر کرتے تھے، نیز فجر میں بھی ایسا ہی کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "جابر بن سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ظہر اور عصر میں «والسماء ذات البروج» اور «والسماء والطارق» اور اسی جیسی سورتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ظہر میں «والليل إذا يغشى» پڑھتے تھے، اور عصر میں اسی جیسی سورت پڑھتے، اور صبح میں اس سے زیادہ لمبی سورت پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "زید بن اسلم کہتے ہیں کہ ہم انس بن مالک رضی اللہ عنہ کے پاس آئے تو انہوں نے پوچھا: تم لوگوں نے نماز پڑھ لی؟ ہم نے کہا: جی ہاں! تو انہوں نے کہا: بیٹی! میرے لیے وضو کا پانی لاؤ، میں نے کسی امام کے پیچھے نماز نہیں پڑھی جس کی نماز تمہارے اس امام ۱؎ کی نماز سے بڑھ کر رسول اللہ صلی اللہ علیہ وسلم کی نماز سے مشابہت رکھتی ہو، زید کہتے ہیں: عمر بن عبدالعزیز رکوع اور سجدے مکمل کرتے اور قیام و قعود ہلکا کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں نے کسی کے پیچھے ایسی نماز نہیں پڑھی جو فلاں ۱؎ کی نماز سے بڑھ کر رسول اللہ صلی اللہ علیہ وسلم کی نماز کے مشابہ ہو، سلیمان کہتے ہیں: وہ ظہر کی پہلی دو رکعتیں لمبی کرتے اور آخری دونوں رکعتیں ہلکی کرتے، اور عصر کو ہلکی کرتے، اور مغرب میں «قصارِ» مفصل پڑھتے تھے، اور عشاء میں«وساطِ» مفصل پڑھتے تھے، اور فجر میں «طوالِ» مفصل پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں نے فلاں سے بڑھ کر کسی کے پیچھے رسول اللہ صلی اللہ علیہ وسلم کی نماز سے مشابہ نماز نہیں پڑھی ( سلیمان کہتے ہیں ) ہم نے اس شخص کے پیچھے نماز پڑھی، وہ ظہر کی پہلی دونوں رکعتیں لمبی کرتے تھے، اور آخری دونوں ( رکعتیں ) ہلکی کرتے، اور عصر بھی ہلکی کرتے، اور مغرب میں قصار مفصل پڑھتے، اور عشاء میں «والشمس وضحاها» اور اسی طرح کی سورتیں پڑھتے، اور فجر میں دو لمبی دو سورتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "جابر رضی اللہ عنہ کہتے ہیں: انصار کا ایک شخص دو اونٹوں کے ساتھ جن پر سنچائی کے لیے پانی ڈھویا جاتا ہے معاذ رضی اللہ عنہ کے پاس سے گزرا، اور وہ مغرب ۱؎ پڑھ رہے تھے، تو انہوں نے سورۃ البقرہ شروع کر دی، تو اس شخص نے ( الگ جا کر ) نماز پڑھی، پھر وہ چلا گیا تو یہ بات نبی اکرم صلی اللہ علیہ وسلم کے پاس پہنچی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: معاذ! کیا تم فتنہ پرداز ہو؟ معاذ کیا تم فتنہ پرداز ہو؟ «‏سبح اسم ربك الأعلى» اور «‏والشمس وضحاها» اور اس طرح کی سورتیں کیوں نہیں پڑھتے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "ام فضل بنت حارث رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اپنے گھر میں مغرب پڑھائی، تو آپ نے سورۃ المرسلات پڑھی، اس کے بعد آپ نے کوئی بھی نماز نہیں پڑھائی یہاں تک کہ آپ کی وفات ہو گئی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "عبداللہ بن عباس رضی اللہ عنہم اپنی ماں (ام الفضل بنت حارث رضی اللہ عنہا) سے روایت کرتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو مغرب میں سورۃ المرسلات پڑھتے سنا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "جبیر بن مطعم رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو مغرب میں سورۃ الطور پڑھتے سنا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "عبداللہ بن عتبہ بن مسعود رضی اللہ عنہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم نے مغرب میں سورۃ «حم» الدخان پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "زید بن ثابت رضی اللہ عنہ سے روایت ہے کہ انہوں نے مروان سے پوچھا: اے ابوعبدالملک! کیا تم مغرب میں «قل هو اللہ أحد‏» اور «إنا أعطيناك الكوثر» پڑھتے ہو؟ تو انہوں نے کہا: جی ہاں! تو انہوں نے کہا: اللہ کی قسم! میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس میں ‏ «المص» جو دو لمبی سورتوں ( انعام اور اعراف ) میں زیادہ لمبی ہے ( سورۃ الاعراف ) پڑھتے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "عروہ بن زبیر کہتے ہیں کہ مروان بن حکم نے انہیں خبر دی کہ زید بن ثابت رضی اللہ عنہ کہنے لگے کہ کیا بات ہے کہ میں مغرب میں تمہیں چھوٹی سورتیں پڑھتے دیکھتا ہوں، حالانکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس نماز میں دو بڑی سورتوں میں جو زیادہ بڑی سورت ہے اسے پڑھتے دیکھا ہے، میں نے پوچھا: اے ابوعبداللہ! دو بڑی سورتوں میں سے زیادہ بڑی سورت کون سی ہے؟ انہوں نے کہا: اعراف۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مغرب میں سورۃ الاعراف پڑھی، آپ نے اسے دونوں رکعتوں میں بانٹ دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو بیس مرتبہ مغرب کے بعد کی اور فجر کے پہلے کی دونوں رکعتوں میں «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو لشکر کی ایک ٹکری کا امیر بنا کر بھیجا، وہ اپنے ساتھیوں کو نماز پڑھایا کرتا تھا، اور قرأت «‏قل هو اللہ أحد» پر ختم کرتا تھا، جب لوگ لوٹ کر واپس آئے، تو لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا، آپ صلی اللہ علیہ وسلم نے فرمایا: ان سے پوچھو، وہ ایسا کیوں کرتے تھے؟ ان لوگوں نے ان سے پوچھا: انہوں نے کہا: یہ رحمن عزوجل کی صفت ہے، اس لیے میں اسے پڑھنا پسند کرتا ہوں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم لوگ اسے بتا دو کہ اللہ عزوجل بھی اسے پسند کرتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "عبید بن حنین مولی آل زید بن خطاب کہتے ہیں کہ میں نے ابوہریرہ رضی اللہ عنہ کو سنا وہ کہہ رہے تھے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آیا، تو آپ نے ایک شخص کو «قل هو اللہ أحد * اللہ الصمد * لم يلد ولم يولد * ولم يكن له كفوا أحد‏» پڑھتے سنا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: واجب ہو گئی ، میں نے آپ سے پوچھا: اللہ کے رسول! کیا چیز واجب ہو گئی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جنت ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے ایک شخص کو «قل هو اللہ أحد» پڑھتے سنا، وہ اسے باربار دہرا رہا تھا، جب صبح ہوئی تو وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور اس نے آپ سے اس کا ذکر کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، یہ تہائی قرآن کے برابر ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "ابوایوب خالد بن زید انصاری رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ صلی اللہ علیہ وسلم نے فرمایا: «قل هو اللہ أحد» تہائی قرآن ہے ۔ ابوعبدالرحمٰن ( امام نسائی ) کہتے ہیں: میں کسی حدیث کی اس سے زیادہ بڑی سند نہیں جانتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ معاذ رضی اللہ عنہ کھڑے ہوئے اور انہوں نے عشاء پڑھائی، تو انہوں نے قرأت لمبی کر دی، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: معاذ! کیا تم فتنہ پرداز ہو؟ معاذ! کیا تم فتنہ پرداز ہو؟ «سبح اسم ربك الأعلى‏»، «والضحى» اور «إذا السماء انفطرت» کیوں نہیں پڑھتے؟ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ معاذ بن جبل رضی اللہ عنہ نے اپنے اصحاب کو عشاء پڑھائی تو انہوں نے قرأت ان پر طویل کر دی، تو ہم میں سے ایک شخص نے نماز توڑ دی ( اور الگ نماز پڑھ لی ) معاذ رضی اللہ عنہ کو اس کے متعلق بتایا گیا تو انہوں نے کہا: وہ منافق ہے، جب یہ بات اس شخص کو معلوم ہوئی، تو وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور معاذ رضی اللہ عنہ نے جو کچھ کہا تھا آپ کو اس کی خبر دی، تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: معاذ! کیا تم فتنہ بپا کرنا چاہتے ہو؟ جب تم لوگوں کی امامت کرو تو «والشمس وضحاها»، «سبح اسم ربك الأعلى»، «والليل إذا يغشى» اور «اقرأ باسم ربك‏» پڑھا کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز عشاء میں «والشمس وضحاها» اور اسی جیسی سورتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "براء بن عازب رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ عشاء پڑھی، تو آپ صلی اللہ علیہ وسلم نے اس میں «والتین والزیتون»پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "براء بن عازب رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک سفر میں تھے، تو آپ صلی اللہ علیہ وسلم نے عشاء کی پہلی رکعت میں «والتین والزیتون» پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "ابو عون کہتے ہیں کہ میں نے جابر بن سمرہ رضی اللہ عنہ کو کہتے سنا کہ عمر رضی اللہ عنہ نے سعد رضی اللہ عنہ سے کہا: لوگ ہر بات میں تمہاری شکایت کرتے ہیں یہاں تک کہ نماز میں بھی، سعد رضی اللہ عنہ نے کہا: میں پہلی دونوں رکعتوں میں جلد بازی نہیں کرتا ۱؎ اور پچھلی دونوں رکعتوں میں قرأت ہلکی کرتا ہوں، میں رسول اللہ صلی اللہ علیہ وسلم کی نماز کی پیروی میں کوئی کوتاہی نہیں کرتا، عمر رضی اللہ عنہ نے کہا: تم سے مجھے یہی توقع ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ کوفہ کے چند لوگ عمر رضی اللہ عنہ کے پاس سعد رضی اللہ عنہ کی شکایت لے کر آئے، اور کہنے لگے: اللہ کی قسم! یہ اچھی طرح نماز نہیں پڑھاتے، ( عمر رضی اللہ عنہ کے پوچھنے پر ) سعد رضی اللہ عنہ نے کہا: میں تو انہیں رسول اللہ صلی اللہ علیہ وسلم کی سی نماز پڑھاتا ہوں، اس میں ذرا بھی کمی نہیں کرتا، پہلی دونوں رکعتوں میں قرأت لمبی کرتا ہوں، اور پچھلی دونوں رکعتوں میں ہلکی کرتا ہوں، عمر رضی اللہ عنہ نے کہا: تم سے یہی توقع ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ میں ان سورتوں کو جانتا ہوں جو ایک دوسرے کے مشابہ ہیں، وہ بیس سورتیں ہیں جنہیں رسول اللہ صلی اللہ علیہ وسلم دس رکعتوں میں پڑھتے تھے، پھر انہوں نے علقمہ رضی اللہ عنہ کا ہاتھ پکڑا، اور اندر لے گئے، پھر علقمہ رضی اللہ عنہ نکل کر باہر ہمارے پاس آئے، تو ہم نے ان سے پوچھا، تو انہوں نے ہمیں وہ سورتیں بتائیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "ابووائل شفیق بن سلمہ کہتے ہیں کہ ایک شخص عبداللہ بن مسعود رضی اللہ عنہ کے پاس آ کر کہنے لگا: میں نے پوری مفصل ایک ہی رکعت میں پڑھ لی، تو انہوں نے کہا: یہ تو شعر کی طرح جلدی جلدی پڑھنا ہوا، مجھے وہ سورتیں معلوم ہیں جو ایک دوسرے کے مشابہ ہیں، اور جنہیں رسول اللہ صلی اللہ علیہ وسلم ملا کر پڑھا کرتے تھے، تو انہوں نے مفصل کی بیس سورتوں کا ذکر کیا جن میں آپ دو دو سورتیں ایک رکعت میں ملا کر پڑھا کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ ایک شخص ان کے پاس آیا اور کہنے لگا: میں نے آج رات ایک رکعت میں پوری مفصل پڑھ ڈالی، تو انہوں نے کہا: یہ تو شعر کی طرح جلدی جلدی پڑھنا ہوا، لیکن رسول اللہ صلی اللہ علیہ وسلم «حمٓ» سے اخیر قرآن تک مفصل کی صرف بیس ہم مثل سورتیں ملا کر پڑھتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "عبداللہ بن سائب رضی اللہ عنہ کہتے ہیں کہ میں فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، تو آپ نے کعبہ کے سامنے نماز پڑھی، اپنے جوتے اتار کر انہیں اپنی بائیں طرف رکھا، اور سورۃ مومنون سے قرأت شروع کی، جب موسیٰ یا عیسیٰ علیہما السلام کا ذکر آیا ۱؎ تو آپ کو کھانسی آ گئی، تو آپ رکوع میں چلے گئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "حذیفہ رضی اللہ عنہ سے روایت ہے کہ ایک رات انہوں نے نبی اکرم صلی اللہ علیہ وسلم کے پہلو میں نماز پڑھی، تو آپ نے قرأت کی، آپ جب کسی عذاب کی آیت سے گزرتے تو تھوڑی دیر ٹھہرتے، اور پناہ مانگتے، اور جب کسی رحمت کی آیت سے گزرتے تو دعا کرتے ۱؎، اور رکوع میں «سبحان ربي العظيم» کہتے، اور سجدے میں «سبحان ربي الأعلى» کہتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"text": "حذیفہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک ہی رکعت میں تین سورتیں: بقرہ، آل عمران اور نساء پڑھیں، آپ جب بھی رحمت کی آیت سے گزرتے تو ( اللہ سے ) رحمت کی درخواست کرتے، اور عذاب کی آیت سے گزرتے تو ( عذاب سے ) اللہ کی پناہ مانگتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نماز میں کھڑے ہوئے یہاں تک کہ آپ نے ایک ہی آیت میں صبح کر دی، وہ آیت یہ تھی: «إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم» یعنی اگر تو ان کو سزا دے تو یہ تیرے بندے ہیں، اور اگر تو انہیں معاف فرما دے تو تو ( غالب و زبردست ) ہے، اور حکیم ( حکمت والا ) ہے ( المائدہ: ۱۱۸ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "عبداللہ بن عباس رضی اللہ عنہم آیت کریمہ: «ولا تجهر بصلاتك ولا تخافت بها‏» کے سلسلے میں کہتے ہیں کہ جب یہ آیت نازل ہوئی تو اس وقت رسول اللہ صلی اللہ علیہ وسلم مکہ میں چھپے رہتے تھے، جب رسول اللہ صلی اللہ علیہ وسلم صحابہ کرام ( رضی اللہ عنہم ) کو نماز پڑھاتے تو اپنی آواز بلند کرتے، ( ابن منیع کی روایت میں ہے: قرآن زور سے پڑھتے ) جب مشرکین آپ کی آواز سنتے تو قرآن کو اور جس نے اسے نازل کیا ہے اسے، اور جو لے کر آیا ہے اسے سب کو برا بھلا کہتے، تو اللہ تعالیٰ نے اپنے نبی کریم صلی اللہ علیہ وسلم سے کہا: اے محمد! اپنی نماز یعنی اپنی قرأت کو بلند نہ کریں کہ مشرکین سنیں تو قرآن کو برا بھلا کہیں، اور نہ اسے اتنی پست آواز میں پڑھیں کہ آپ کے ساتھی سن ہی نہ سکیں، بلکہ ان دونوں کے بیچ کا راستہ اختیار کریں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم قرآن بلند آواز سے پڑھتے تھے، تو جب مشرک آپ کی آواز سنتے تو وہ قرآن کو اور اسے لے کر آنے والے کو برا بھلا کہتے، تو نبی اکرم صلی اللہ علیہ وسلم قرآن کو اتنی پست آواز سے پڑھنے لگے کہ آپ کے ساتھی بھی نہیں سن پاتے، تو اللہ تعالیٰ نے یہ آیت نازل فرمائی: «ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا» یعنی اے محمد! نہ اپنی نماز بہت بلند آواز سے پڑھیں، اور نہ بہت پست آواز سے بلکہ ان کے بیچ کا راستہ اختیار کریں ( بنی اسرائیل: ۱۱۰ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "ام ہانی رضی اللہ عنہا کہتی ہیں کہ میں مسجد میں نبی اکرم صلی اللہ علیہ وسلم کی قرأت سنتی تھی، اور میں اپنی چھت پر ہوتی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "قتادہ کہتے ہیں کہ میں نے انس رضی اللہ عنہ سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم کی قرأت کیسی ہوتی تھی؟ تو انہوں نے کہا: آپ اپنی آواز خوب کھینچتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "براء رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: قرآن کو اپنی آوازوں سے زینت بخشو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "براء بن عازب رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم قرآن کو اپنی آواز سے مزین کرو ۔ عبدالرحمٰن بن عوسجہ کہتے ہیں: میں اس جملے «زينوا القرآن» کو بھول گیا تھا یہاں تک کہ مجھے ضحاک بن مزاحم نے یاد دلایا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: اللہ تعالیٰ کوئی چیز اتنی پسندیدگی سے نہیں سنتا جتنی خوش الحان نبی کی زبان سے قرآن سنتا ہے، جو اسے خوش الحانی کے ساتھ بلند آواز سے پڑھتا ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: نبی کے خوش الحانی سے قرآن پڑھنے کو اللہ تعالیٰ جس طرح سنتا ہے اس طرح کسی اور چیز کو نہیں سنتا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "ابوہریرہ رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوموسیٰ اشعری رضی اللہ عنہ کی قرأت سنی تو فرمایا: انہیں آل داود کے لحن ( سُر ) میں سے ایک لحن عطا کیا گیا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ابوموسیٰ رضی اللہ عنہ کی قرأت سنی تو فرمایا: یقیناً انہیں آل داود کے لحن ( سُر ) میں سے ایک لحن عطا کیا گیا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوموسیٰ رضی اللہ عنہ کی قرأت سنی تو فرمایا: انہیں داود کے لحن ( سُر ) میں سے ایک لحن عطا کیا گیا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "یعلیٰ بن مملک سے روایت ہے کہ انہوں نے ام المؤمنین ام سلمہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی قرأت اور نماز کے متعلق پوچھا، تو انہوں نے کہا: تم کہاں اور آپ کی نماز کہاں! پھر انہوں نے آپ کی قرأت بیان کی جس کا ایک ایک حرف بالکل واضح تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "ابوسلمہ بن عبدالرحمٰن سے روایت ہے کہ جس وقت مروان نے ابوہریرہ رضی اللہ عنہ کو مدینہ میں اپنا نائب مقرر کیا تھا، وہ فرض نماز کے لیے کھڑے ہوتے تو اللہ اکبر کہتے، پھر جب وہ رکوع کرتے تو اللہ اکبر کہتے، اور جب رکوع سے اپنا سر اٹھاتے تو «سمع اللہ لمن حمده»، «ربنا ولك الحمد» کہتے، پھر جب سجدہ کے لیے جھکتے تو اللہ اکبر کہتے، پھر جب تشہد کے بعد دوسری رکعت سے اٹھتے تو اللہ اکبر کہتے، ( ہر رکعت میں ) اسی طرح کرتے یہاں تک کہ اپنی نماز پوری کر لیتے، ( ایک بار ) جب انہوں نے اپنی نماز پوری کر لی اور سلام پھیرا تو لوگوں کی طرف متوجہ ہوئے، اور کہنے لگے: قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے میں تم میں سب سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی نماز سے مشابہت رکھتا ہوں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "مالک بن حویرث رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ اللہ اکبر کہتے، اور جب رکوع کرتے، اور جب رکوع سے سر اٹھاتے، تو اپنے دونوں ہاتھ اٹھاتے یہاں تک کہ آپ کے دونوں ہاتھ آپ کی کانوں کی لو تک پہنچ جاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ نماز شروع کرتے تو اپنے دونوں ہاتھ اٹھاتے، یہاں تک کہ آپ انہیں اپنے مونڈھوں کے بالمقابل لے جاتے ۱؎، اور جب رکوع کرتے، اور جب رکوع سے سر اٹھاتے تو بھی ایسا ہی کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ کیا میں تمہیں رسول اللہ صلی اللہ علیہ وسلم کی نماز نہ بتاؤں؟ چنانچہ وہ کھڑے ہوئے اور پہلی بار اپنے دونوں ہاتھوں کو اٹھایا، پھر انہوں نے دوبارہ ایسا نہیں کیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "ابومسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ایسی نماز کافی نہیں ہوتی جس میں آدمی رکوع و سجود میں اپنی پیٹھ برابر نہ رکھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1028,
			"arabicnumber": 1028,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: رکوع اور سجدے میں سیدھے رہو ۱؎ اور تم میں سے کوئی بھی اپنے دونوں بازو کتے کی طرح نہ بچھائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 153
			}
		}
	]
}