{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"12": "The Book of The At-Tatbiq (Clasping One's Hands Together)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1029,
			"arabicnumber": 1029,
			"text": "علقمہ اور اسود سے روایت ہے کہ وہ دونوں عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ ان کے گھر میں تھے، تو انہوں نے پوچھا: کیا ان لوگوں نے نماز پڑھ لی؟ ہم نے کہا: ہاں! تو انہوں نے بغیر اذان و اقامت کے دونوں کی امامت کی، اور ان دونوں کے درمیان میں کھڑے ہوئے، اور کہنے لگے: جب تم تین ہو تو ایسے ہی کرو، اور جب تم اس سے زیادہ ہو تو تم میں کا ایک شخص تمہاری امامت کرے، اور اپنی دونوں ہتھیلیوں کو اپنی دونوں رانوں پر بچھا لے، گویا میں رسول اللہ صلی اللہ علیہ وسلم کی انگلیوں کو ایک دوسرے میں پیوست دیکھ رہا ہوں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1030,
			"arabicnumber": 1030,
			"text": "اسود اور علقمہ کہتے ہیں کہ ہم نے عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ ان کے گھر میں نماز پڑھی، وہ ہمارے درمیان کھڑے ہوئے، ہم نے اپنے ہاتھوں کو اپنے گھٹنوں پر رکھ لیا، تو انہوں نے اسے وہاں سے ہٹا دیا اور ہمارے دونوں ہاتھوں کی انگلیوں کو ایک دوسرے میں پیوست کر دیں، اور کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسا کرتے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1031,
			"arabicnumber": 1031,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نماز سکھائی، آپ کھڑے ہوئے اور آپ نے اللہ اکبر کہا، تو جب آپ نے رکوع کرنا چاہا تو اپنے ہاتھوں کو ملا کر اپنے دونوں گھٹنوں کے بیچ کر لیا، اور رکوع کیا، یہ بات سعد رضی اللہ عنہ کو معلوم ہوئی تو انہوں نے کہا: میرے بھائی نے سچ کہا، ہم پہلے ایسا ہی کرتے تھے، پھر ہمیں اس کا یعنی ہاتھوں سے گھٹنوں کو پکڑنے کا حکم دیا گیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1032,
			"arabicnumber": 1032,
			"text": "مصعب بن سعد کہتے ہیں کہ میں نے اپنے والد ( سعد بن ابی وقاص رضی اللہ عنہ ) کے پہلو میں نماز پڑھی، میں نے رکوع میں اپنے دونوں ہاتھوں کو دونوں گھٹنوں کے درمیان کر لیا، تو انہوں نے مجھ سے کہا: اپنی ہتھیلیاں اپنے دونوں گھٹنوں پہ رکھو، پھر میں نے دوسری بار بھی ایسا ہی کیا، تو انہوں نے میرے ہاتھ پر مارا اور کہا: ہمیں اس سے روک دیا گیا ہے، اور ہاتھوں کو گھٹنوں پہ رکھنے کا حکم دیا گیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1033,
			"arabicnumber": 1033,
			"text": "مصعب بن سعد کہتے ہیں کہ میں نے رکوع کیا، تو اپنے دونوں ہاتھوں کی انگلیوں کو ایک دوسرے میں پیوست کر کے اپنے دونوں گھٹنوں کے درمیان کر لیا، تو میرے والد نے کہا: پہلے ہم ایسا ہی کرتے تھے، پھر ہم اسے اٹھا کر گھٹنوں پر رکھنے لگے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1034,
			"arabicnumber": 1034,
			"text": "عمر رضی اللہ عنہ کہتے ہیں کہ ہتھیلیوں سے گھٹنوں کو پکڑے رکھنا تمہارے لیے مسنون قرار دیا گیا ہے، لہٰذا تم رکوع میں گھٹنوں کو پکڑے رہو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1035,
			"arabicnumber": 1035,
			"text": "ابوعبدالرحمٰن سلمی کہتے ہیں کہ عمر رضی اللہ عنہ نے کہا: سنت تو گھٹنوں کو پکڑنا ہی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1036,
			"arabicnumber": 1036,
			"text": "سالم البراد کہتے ہیں کہ ہم ابومسعود ( عقبہ بن عمرو ) کے پاس آئے تو ہم نے ان سے کہا: آپ ہم سے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں بیان کیجئے تو وہ ہمارے سامنے کھڑے ہوئے، اور اللہ اکبر کہا، اور جب انہوں نے رکوع کیا تو اپنی ہتھیلیوں کو اپنے دونوں گھٹنوں پہ رکھا، اور انگلیوں کو اس سے نیچے، اور اپنی دونوں کہنیوں کو پہلو سے جدا رکھا یہاں تک کہ ان کی ہر چیز سیدھی ہو گئی، پھر انہوں نے «سمع اللہ لمن حمدہ» کہا، اور کھڑے ہو گئے یہاں تک کہ ان کی ہر چیز سیدھی ہو گئی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1037,
			"arabicnumber": 1037,
			"text": "ابوعبداللہ سالم بن البرد سے روایت ہے کہ عقبہ بن عمرو رضی اللہ عنہ کہتے ہیں کہ کیا میں تمہارے سامنے ایسی نماز نہ پڑھوں جیسی میں نے رسول اللہ صلی اللہ علیہ وسلم کو پڑھتے دیکھا ہے؟ تو ہم نے کہا: کیوں نہیں! ضرور پڑھیئے، تو وہ کھڑے ہوئے، جب انہوں نے رکوع کیا تو اپنی ہتھیلیوں کو اپنے دونوں گھٹنوں پہ، اور اپنی انگلیوں کو گھٹنوں کے نیچے رکھا، اور اپنے بغلوں کو جدا رکھا یہاں تک کہ ان کی ہر چیز اپنی جگہ پر آ گئی، پھر انہوں نے اپنا سر اٹھایا اور کھڑے ہو گئے، پھر سجدہ کیا اور اپنے بغلوں کو جدا رکھا یہاں تک ان کی ہر چیز اپنی جگہ جم گئی، پھر وہ بیٹھے یہاں تک کہ جسم کا ہر عضو اپنی جگہ پر آ گیا، پھر انہوں نے سجدہ کیا یہاں تک کہ جسم کا ہر ہر عضو اپنی جگہ پر آ گیا، چاروں رکعتیں اسی طرح ادا کیں، پھر انہوں نے کہا: میں نے اسی طرح رسول اللہ صلی اللہ علیہ وسلم کو نماز پڑھتے دیکھا ہے، اور آپ ہمیں اسی طرح پڑھاتے بھی تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1038,
			"arabicnumber": 1038,
			"text": "ابوعبداللہ سالم براد کہتے ہیں کہ ابومسعود ( عقبہ بن عمرو ) رضی اللہ عنہ کہنے لگے کہ کیا میں تمہیں نہ دکھاؤں کہ رسول اللہ صلی اللہ علیہ وسلم کیسے نماز پڑھتے تھے؟ تو ہم نے کہا: کیوں نہیں، ضرور دکھایئے، چنانچہ وہ کھڑے ہوئے، اور اللہ اکبر کہا، اور جب رکوع کیا تو اپنے دونوں ہاتھوں کو اپنے دونوں بغلوں سے جدا رکھا، یہاں تک کہ جب ان کی ہر چیز اپنی جگہ پر آ گئی تو انہوں نے اپنا سر اٹھایا، اسی طرح انہوں نے چار رکعتیں پڑھیں، اور کہا: میں نے اسی طرح رسول اللہ صلی اللہ علیہ وسلم کو نماز پڑھتے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1039,
			"arabicnumber": 1039,
			"text": "ابو حمید ساعدی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب رکوع کرتے تو پیٹھ اور سر کو برابر رکھتے، نہ تو سر کو بہت اونچا رکھتے اور نہ اسے جھکا کر رکھتے، اور اپنے ہاتھوں کو اپنے دونوں گھٹنوں پہ رکھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1040,
			"arabicnumber": 1040,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ مجھے نبی اکرم صلی اللہ علیہ وسلم نے قسی ۱؎ اور حریر ۲؎ اور سونے کی انگوٹھی پہننے سے روکا ہے، اور اس بات سے بھی کہ میں رکوع کی حالت میں قرآن پڑھوں۔ دوسری بار راوی نے «أن أقرأ وأنا راكع» کے بجائے «أن أقرأ راكعا» کہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1041,
			"arabicnumber": 1041,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے مجھے سونے کی انگوٹھی پہننے سے، رکوع کی حالت میں قرآن پڑھنے سے، قسی کے بنے ہوئے ریشمی کپڑے اور کسم میں رنگے ہوئے کپڑے پہننے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1042,
			"arabicnumber": 1042,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے سونے کی انگوٹھی پہننے سے، قسی کے بنے ہوئے ریشمی کپڑے پہننے سے، انتہائی سرخ کپڑے اور کسم میں رنگے ہوئے کپڑے پہننے سے، اور رکوع میں قرآن پڑھنے سے منع کیا ہے، میں یہ نہیں کہتا کہ تمہیں منع کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1043,
			"arabicnumber": 1043,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے سونے کی انگوٹھی سے اور قسی کے بنے ریشمی کپڑے، کسم میں رنگے کپڑے پہننے سے، اور رکوع کی حالت میں قرآن پڑھنے سے منع کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1044,
			"arabicnumber": 1044,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے قسی کے بنے ریشمی کپڑے، اور کسم میں رنگے کپڑے پہننے سے، اور سونے کی انگوٹھی پہننے سے، اور رکوع میں قرآن پڑھنے سے منع کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1045,
			"arabicnumber": 1045,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اپنے حجرے کا پردہ اٹھایا، اور لوگ ابوبکر رضی اللہ عنہ کے پیچھے صف باندھے کھڑے تھے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: لوگو! نبوت کی خوشخبری سنانے والی چیزوں میں سے کوئی چیز باقی نہیں بچی ہے سوائے سچے خواب کے جسے مسلمان دیکھے یا اس کے لیے کسی اور کو دکھایا جائے ، پھر فرمایا: سنو! مجھے رکوع و سجود میں قرآن پڑھنے سے روکا گیا ہے، رہا رکوع تو اس میں اپنے رب کی بڑائی بیان کرو، اور رہا سجدہ تو اس میں دعا کی کوشش کرو کیونکہ اس میں تمہاری دعا قبول کئے جانے کے لائق ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1046,
			"arabicnumber": 1046,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی، آپ نے رکوع کیا تو اپنے رکوع میں «سبحان ربي العظيم» اور سجدے میں «سبحان ربي الأعلى» کہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1047,
			"arabicnumber": 1047,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم رکوع اور سجدے میں «‏سبحانك ربنا وبحمدك اللہم اغفر لي‏» اے ہمارے رب تیری ذات پاک ہے، اور تیری حمد کے ساتھ ہم تیری تسبیح بیان کرتے ہیں، اے اللہ تو مجھے بخش دے کثرت سے پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1048,
			"arabicnumber": 1048,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رکوع میں «سبوح قدوس رب الملائكة والروح» فرشتوں اور جبرائیل امین کا رب ہر نقص و عیب سے پاک اور تمام آلائشوں سے منزہ ہے ، پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1049,
			"arabicnumber": 1049,
			"text": "عوف بن مالک رضی اللہ عنہ کہتے ہیں کہ میں ایک رات رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( نماز کے لیے ) کھڑا ہوا تو جب آپ صلی اللہ علیہ وسلم نے رکوع کیا، تو سورۃ البقرہ پڑھنے کے بقدر رکوع میں ٹھہرے، آپ اپنے رکوع میں «سبحان ذي الجبروت والملكوت والكبرياء والعظمة» میں صاحب قدرت و بادشاہت اور صاحب بزرگی و عظمت کی پاکی بیان کرتا ہوں پڑھ رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1050,
			"arabicnumber": 1050,
			"text": "علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب رکوع کرتے تو «اللہم لك ركعت ولك أسلمت وبك آمنت خشع لك سمعي وبصري وعظامي ومخي وعصبي» اے اللہ! میں نے تیرے لیے اپنی پیٹھ جھکا دی، اور اپنے آپ کو تیرے حوالے کر دیا، اور میں تجھ پر ایمان لایا، میرے کان، میری آنکھیں، میری ہڈیاں، میرے بھیجے اور میرے پٹھوں نے تیرے لیے عاجزی کا اظہار کیا پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "جابر بن عبداللہ رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب رکوع کرتے تو اس میں «اللہم لك ركعت وبك آمنت ولك أسلمت وعليك توكلت أنت ربي خشع سمعي وبصري ودمي ولحمي وعظمي وعصبي لله رب العالمين» اے اللہ! میں نے تیرے لیے ہی اپنا سر جھکا دیا، تیرے اوپر ہی ایمان لایا، میں نے اپنے آپ کو تیرے ہی حوالے کر دیا، تیرے ہی اوپر بھروسہ کیا، تو میرا رب ہے، میرے کان، میری آنکھ، میرا خون، میرا گوشت، میری ہڈیاں اور میرے پٹھے نے اللہ کے لیے جو سارے جہانوں کا رب ہے عاجزی کا اظہار کیا ہے پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "محمد بن مسلمہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نفل پڑھنے کھڑے ہوتے تو جب رکوع میں جاتے تو «اللہم لك ركعت وبك آمنت ولك أسلمت وعليك توكلت أنت ربي خشع سمعي وبصري ولحمي ودمي ومخي وعصبي لله رب العالمين» اے اللہ! میں نے تیرے لیے اپنی پیٹھ جھکا دی، تیرے اوپر ایمان لایا، میں نے اپنے آپ کو تیرے سپرد کر دیا، اور تجھ پر بھروسہ کیا، تو میرا رب ہے، میرا کان، میری آنکھ، میرا گوشت، میرا خون، میرا دماغ اور میرے پٹھے نے اللہ رب العالمین کے لیے عاجزی کا اظہار کیا ہے پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "رفاعہ بن رافع رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ایک شخص مسجد میں داخل ہوا، اور اس نے نماز پڑھی، رسول اللہ صلی اللہ علیہ وسلم اسے دیکھ رہے تھے لیکن وہ جان نہیں رہا تھا، وہ نماز سے فارغ ہوا، تو رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، اور آپ کو سلام کیا، تو آپ نے سلام کا جواب دیا، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: جاؤ تم پھر سے نماز پڑھو کیونکہ تم نے نماز نہیں پڑھی ، میں نہیں جان سکا کہ اس نے دوسری بار میں یا تیسری بار میں کہا کہ قسم ہے اس ذات کی جس نے آپ پر قرآن نازل کیا ہے، میں اپنی کوشش کر چکا، آپ مجھے نماز پڑھنا سکھا دیں، اور پڑھ کر دکھا دیں کہ کیسے پڑھوں، آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم نماز کا ارادہ کرو تو وضو کرو اور اچھی طرح وضو کرو، پھر قبلہ رخ کھڑے ہو، پھر اللہ اکبر کہو، پھر قرأت کرو، پھر رکوع کرو یہاں تک کہ تم رکوع کی حالت میں مطمئن ہو جاؤ، پھر اٹھو یہاں تک کہ سیدھے کھڑے ہو جاؤ، پھر سجدہ کرو یہاں تک کہ سجدہ کی حالت میں مطمئن ہو جاؤ، پھر اپنا سر اٹھاؤ یہاں تک کہ اطمینان سے بیٹھ جاؤ، پھر سجدہ کرو یہاں تک کہ سجدہ کی حالت میں مطمئن ہو جاؤ، جب تم ایسا کرو گے تو اپنی نماز پوری کر لو گے، اور اس میں جو کمی کرو گے تو اپنی نماز ہی میں کمی کرو گے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تم رکوع اور سجدہ کرو تو انہیں اچھی طرح کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی، تو دیکھا کہ جب آپ نماز شروع کرتے تو رفع یدین کرتے، اور جب رکوع کرتے، اور «سمع اللہ لمن حمده» کہتے تو بھی اسی طرح کرتے۔ قیس بن سلیم ( راوی حدیث ) نے دونوں کانوں تک اشارہ کر کے دکھایا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ رکوع کرتے، اور رکوع سے سر اٹھاتے، تو اپنے دونوں ہاتھ اٹھاتے یہاں تک کہ انہیں اپنے کانوں کی لو کے برابر کر لیتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز شروع کرتے تو اپنے ہاتھ اپنے کندھوں کے بالمقابل اٹھاتے، اور جب رکوع سے سر اٹھاتے تو بھی اسی طرح کرتے، اور جب «سمع اللہ لمن حمده» کہتے تو «ربنا لك الحمد» کہتے، اور دونوں سجدوں کے درمیان اپنے ہاتھ نہیں اٹھاتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ کیا میں تمہیں رسول اللہ صلی اللہ علیہ وسلم کی نماز نہ پڑھاؤں؟ چنانچہ انہوں نے ہمیں نماز پڑھائی، تو انہوں نے صرف ایک بار رفع یدین کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز شروع کرتے تو اپنے دونوں ہاتھ اپنے کندھوں کے بالمقابل اٹھاتے، اور جب رکوع کے لیے اللہ اکبر کہتے، اور جب رکوع سے اپنا سر اٹھاتے تب بھی اسی طرح اپنے دونوں ہاتھ اٹھاتے، اور «سمع اللہ لمن حمده ربنا ولك الحمد»کہتے، اور سجدے میں رفع یدین نہیں کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب رکوع سے اپنا سر اٹھاتے تو «اللہم ربنا ولك الحمد» کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم گھوڑے سے اپنے داہنے پہلو پر گر پڑے، تو لوگ آپ کی عیادت کرنے آپ کے پاس آئے کہ ( اسی دوران ) نماز کا وقت ہو گیا، ( تو آپ نے انہیں نماز پڑھائی ) جب آپ نے نماز پوری کر لی تو فرمایا: امام بنایا ہی اس لیے گیا ہے کہ اس کی اقتداء کی جائے، تو جب وہ رکوع کرے تو تم بھی رکوع کرو، اور جب وہ سر اٹھائے تو تم بھی سر اٹھاؤ، اور جب وہ «سمع اللہ لمن حمده» کہے، تو تم «ربنا ولك الحمد» کہو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "رفاعہ بن رافع رضی اللہ عنہ کہتے ہیں کہ ایک دن ہم رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھ رہے تھے، جب آپ نے رکوع سے اپنا سر اٹھایا تو «سمع اللہ لمن حمده‏» کہا، تو آپ کے پیچھے ایک شخص نے «ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه» اللہ کے لیے بہت زیادہ تعریفیں ہیں جو پاکیزہ و بابرکت ہیں کہا، جب رسول اللہ صلی اللہ علیہ وسلم نے سلام پھیرا تو آپ صلی اللہ علیہ وسلم نے پوچھا: ابھی ابھی ( نماز میں ) کون بول رہا تھا؟ تو اس شخص نے عرض کیا: میں تھا اللہ کے رسول! تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نے تیس سے زائد فرشتوں کو دیکھا ان میں سے ہر ایک سبقت لے جانے کی کوشش کر رہا تھا کہ اسے کون پہلے لکھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب امام «سمع اللہ لمن حمده» کہے، تو تم «ربنا ولك الحمد» کہو کیونکہ جس کا کہنا فرشتوں کے کہنے کے موافق ہو گا، اس کے پچھلے تمام گناہ بخش دیئے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ہمیں خطبہ دیا، اور ہمیں ہمارے طریقے بتائے، اور ہماری نماز سکھائی، آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم نماز پڑھو تو اپنی صفیں سیدھی کرو، پھر تم میں سے کوئی ایک امامت کرے، اور جب امام اللہ اکبر کہے تو تم بھی اللہ اکبر کہو، اور جب وہ «غير المغضوب عليهم ولا الضالين» کہے، تو تم آمین کہو، اللہ تمہاری دعا قبول کرے گا، اور جب وہ اللہ اکبر کہے، اور رکوع کرے تو تم بھی اللہ اکبر کہو اور رکوع کرو، امام تم سے پہلے رکوع کرے گا، اور تم سے پہلے رکوع سے سر بھی اٹھائے گا، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تو ادھر کی کمی ادھر پوری ہو جائے گی ، اور جب وہ«سمع اللہ لمن حمده» کہے، تو تم «اللہم ربنا ولك الحمد» کہو، اللہ تعالیٰ تمہاری پکار سن لے گا ؛ کیونکہ اللہ نے اپنے بنی کی زبان سے فرمایا ہے: اللہ نے اس کی سن لی جس نے اس کی حمد بیان کی، تو جب وہ اللہ اکبر کہے اور سجدہ کرے تو تم بھی اللہ اکبر کہو اور سجدہ کرو، امام تم سے پہلے سجدہ کرے گا، اور تم سے پہلے سجدہ سے سر بھی اٹھائے گا، نبی کریم صلی اللہ علیہ وسلم نے فرمایا: تو ادھر کی کمی ادھر پوری ہو جائے گی، جب وہ قعدے میں ہو تو تم میں سے ہر ایک کی پہلی دعا یہ ہو:«التحيات الطيبات الصلوات لله سلام عليك أيها النبي ورحمة اللہ وبركاته سلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» آداب بندگیاں، پاکیزہ خیراتیں، اور صلاتیں اللہ ہی کے لیے ہیں، اے رسول! آپ پر سلام اور اللہ کی رحمت اور اس کی برکتیں نازل ہوں، اور سلام ہو ہم پر اور اللہ کے تمام نیک و صالح بندوں پر، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، اور میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اس کے بندے اور رسول ہیں یہ سات کلمے ۱؎ ہیں اور یہ نماز کا سلام ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1065,
			"arabicnumber": 1065,
			"text": "براء بن عازب رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کا رکوع کرنا، اور رکوع سے سر اٹھانا اور سجدہ کرنا، اور دونوں سجدوں کے درمیان ٹھہرنا، تقریباً برابر برابر ہوتا تھا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب «سمع اللہ لمن حمده‏» کہتے، تو «‏اللہم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد» اے اللہ! تیری تعریف ہے، آسمانوں بھر، زمین بھر اور اس کے بعد تو جس چیز بھر چاہے کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1067,
			"arabicnumber": 1067,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب رکوع کے بعد سجدے کا ارادہ کرتے تو «‏اللہم ربنا ولك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد» اے ہمارے رب! تیری تعریف ہے، تیرا شکر ہے آسمان و زمین بھر اور اس کے بعد تو جس چیز بھر چاہے کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1068,
			"arabicnumber": 1068,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب «سمع اللہ لمن حمده» کہتے، تو «ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد خير ما قال العبد وكلنا لك عبد لا مانع لما أعطيت ولا ينفع ذا الجد منك الجد» اے اللہ، ہمارے رب! تیرا شکر ہے آسمان و زمین بھر، اور اس کے بعد تو جس چیز بھر چاہے، اے لائق تعریف و لائق مجد و شرف! بہتر ہے جو بندے نے کہا، اور ہم سب تیرے بندے ہیں، کوئی روکنے والا نہیں جسے تو دیدے، تیرے مقابلے میں مالداروں کی مالداری کچھ بھی فائدہ نہیں پہنچائے گی کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1069,
			"arabicnumber": 1069,
			"text": "حذیفہ رضی اللہ عنہ سے روایت ہے کہ ایک رات انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی، جب آپ نے تکبیر کہی تو انہوں نے آپ کو کہتے سنا:«اللہ أكبر ذا الجبروت والملكوت والكبرياء والعظمة‏» اللہ سب سے بڑا صاحب قدرت و سطوت اور صاحب بزرگی و عظمت ہے ، اور آپ رکوع میں «سبحان ربي العظيم» کہتے، اور جب رکوع سے اپنا سر اٹھاتے تو: «لربي الحمد لربي الحمد»، شکر میرے رب کے لیے، شکر میرے رب کے لیے کہتے، اور سجدے میں «سبحان ربي الأعلى» کہتے، اور دونوں سجدوں کے درمیان «رب اغفر لي رب اغفر لي» اے میرے رب! میری مغفرت فرما، اے میرے رب! میری مغفرت فرما کہتے، اور آپ کا قیام کرنا، رکوع کرنا، اور رکوع سے سر اٹھانا، اور آپ کا سجدہ کرنا، اور دونوں سجدوں کے درمیان ٹھہرنا، تقریباً سب برابر برابر ہوتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1070,
			"arabicnumber": 1070,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک مہینے تک رکوع کے بعد دعائے قنوت پڑھی، آپ اس میں رعل، ذکوان اور عصیہ نامی قبائل ۱؎ پر جنہوں نے اللہ اور اس کے رسول کی نافرمانی کی تھی، بد دعا کرتے رہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1071,
			"arabicnumber": 1071,
			"text": "ابن سیرین سے روایت ہے کہ انس بن مالک رضی اللہ عنہ سے پوچھا گیا، کیا رسول اللہ صلی اللہ علیہ وسلم نے نماز فجر میں قنوت پڑھی ہے؟ انہوں نے کہا: جی ہاں! ( پڑھی ہے ) پھر ان سے پوچھا گیا، رکوع سے پہلے یا رکوع کے بعد؟ رکوع کے بعد ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1072,
			"arabicnumber": 1072,
			"text": "ابن سیرین کہتے ہیں کہ مجھ سے ایک ایسے شخص نے جس نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز فجر پڑھی تھی، بیان کیا کہ جب آپ صلی اللہ علیہ وسلم نے دوسری رکعت میں «سمع اللہ لمن حمده» کہا تو آپ تھوڑی دیر کھڑے رہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1073,
			"arabicnumber": 1073,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم نے فجر میں دوسری رکعت سے اپنا سر اٹھایا تو آپ نے دعا کی: اے اللہ! ولید بن ولید، سلمہ بن ہشام، عیاش بن ابی ربیعہ اور مکہ کے کمزور لوگوں کو دشمنوں کے چنگل سے نجات دے، اے اللہ! قبیلہ مضر پر اپنی پکڑ سخت کر دے، اور ان کے اوپر یوسف علیہ السلام ( کی قوم ) جیسا سا قحط مسلط کر دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1074,
			"arabicnumber": 1074,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز میں جس وقت «سمع اللہ لمن حمده ربنا ولك الحمد» کہتے تو دعا کرتے، سجدہ میں جانے سے پہلے کھڑے ہو کر، کہتے: «اللہم أنج الوليد بن الوليد وسلمة بن هشام وعياش بن أبي ربيعة والمستضعفين من المؤمنين اللہم اشدد وطأتك على مضر واجعلها عليهم كسني يوسف» اے اللہ! ولید بن ولید، سلمہ بن ہشام، عیاش بن ابی ربیعہ اور کمزور مسلمانوں کو دشمنوں کے چنگل سے نجات دے، اے اللہ! قبیلہ مضر پر اپنی پکڑ سخت کر دے، اور ان پر یوسف سا قحط مسلط کر دے ، پھر آپ اللہ اکبر کہتے اور سجدہ کرتے، ان دنوں قبیلہ مضر رسول اللہ صلی اللہ علیہ وسلم کا مخالف تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1075,
			"arabicnumber": 1075,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ انہوں نے کہا کہ میں تمہیں رسول اللہ صلی اللہ علیہ وسلم کی نماز قریب تر کر کے دکھاؤں گا، چنانچہ ابوہریرہ رضی اللہ عنہ «سمع اللہ لمن حمده» کہنے کے بعد ظہر کی آخری رکعت میں اور عشاء میں، اور فجر میں دعائے قنوت پڑھتے، تو مومنوں کے لیے دعا کرتے اور کافروں پر لعنت بھیجتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "براء بن عازب رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم فجر میں اور مغرب میں دعائے قنوت پڑھتے تھے۔ عبیداللہ بن سعید کی روایت میں «أن النبي صلى اللہ عليه وسلم» کے بجائے «أن رسول اللہ صلى اللہ عليه وسلم» ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1077,
			"arabicnumber": 1077,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک مہینہ تک دعائے قنوت پڑھی۔ شعبہ کی روایت میں ہے آپ نے چند لوگوں پر لعنت بھیجی، اور ہشام کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم عرب کے کچھ قبیلوں پر رکوع کے بعد بد دعا فرماتے تھے، پھر آپ نے اسے چھوڑ دیا، یہ قول ہشام کا ہے، اور شعبہ قتادہ سے اور قتادہ انس رضی اللہ عنہ سے بیان کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک مہینہ تک قنوت پڑھی، آپ رعل، ذکوان اور لحیان قبائل پر لعنت بھیج رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1078,
			"arabicnumber": 1078,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو جس وقت آپ نے فجر کی نماز میں آخری رکعت سے اپنا سر اٹھایا کچھ منافقوں پر لعنت بھیجتے ہوئے سنا، آپ کہہ رہے تھے: «اللہم العن فلانا وفلانا» اے اللہ! تو فلاں فلاں کو رسوا کر ، تو اللہ تعالیٰ نے یہ آیت نازل فرمائی: «‏ليس لك من الأمر شىء أو يتوب عليهم أو يعذبهم فإنهم ظالمون‏» اے محمد! آپ کے اختیار میں کچھ نہیں، اللہ چاہے تو ان کی توبہ قبول کرے یا عذاب دے، کیونکہ وہ ظالم ہیں ( آل عمران: ۱۲۸ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1079,
			"arabicnumber": 1079,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک مہینہ تک دعائے قنوت پڑھی، آپ عرب کے ایک قبیلے پر بد دعا کر رہے تھے، پھر آپ نے اسے ترک کر دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "ابو مالک اشجعی (سعد) اپنے والد (طارق بن اشیم) سے کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی تو آپ نے دعائے قنوت نہیں پڑھی، ابوبکر رضی اللہ عنہ کے پیچھے نماز پڑھی تو انہوں نے بھی دعائے قنوت نہیں پڑھی، عمر رضی اللہ عنہ کے پیچھے نماز پڑھی تو انہوں نے بھی دعائے قنوت نہیں پڑھی، عثمان رضی اللہ عنہ کے پیچھے نماز پڑھی تو انہوں نے بھی دعائے قنوت نہیں پڑھی، اور علی رضی اللہ عنہ کے پیچھے نماز پڑھی تو انہوں نے بھی دعائے قنوت نہیں پڑھی، پھر انہوں نے کہا: میرے بیٹے! یہ ( یعنی: مداومت ) بدعت ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ ہم ظہر کی نماز رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پڑھتے تھے، میں نماز میں ہی ایک مٹھی کنکری اپنے ہاتھ میں لے لیتا، اسے ٹھنڈا کرتا، پھر اسے دوسرے ہاتھ میں پلٹ دیتا، تو جب سجدہ کرتا تو اسے اپنی پیشانی کے نیچے رکھ لیتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "مطرف کہتے ہیں کہ میں نے اور عمران بن حصین رضی اللہ عنہما دونوں نے علی بن ابی طالب رضی اللہ عنہ کے پیچھے نماز پڑھی، جب وہ سجدہ کرتے تو اللہ اکبر کہتے، اور جب سجدہ سے اپنا سر اٹھاتے تو اللہ اکبر کہتے، اور جب دو رکعتیں پڑھ کر اٹھتے تو اللہ اکبر کہتے، جب وہ نماز پڑھ چکے تو عمران رضی اللہ عنہ نے میرا ہاتھ پکڑا اور کہا: انہوں نے مجھے محمد صلی اللہ علیہ وسلم کی نماز یاد دلا دی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہر جھکنے اور اٹھنے میں اللہ اکبر کہتے تھے ۱؎، اور آپ اپنے دائیں اور بائیں دونوں طرف سلام پھیرتے، ابوبکر و عمر رضی اللہ عنہم بھی ایسا ہی کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "حکیم رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس بات پر بیعت کی کہ میں کھڑے کھڑے ہی سجدے میں گروں گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو نماز میں جب آپ رکوع کرتے، اور جب رکوع سے اپنا سر اٹھاتے، اور جب سجدہ کرتے، اور جب سجدہ سے اپنا سر اٹھاتے ۱؎ رفع یدین کرتے دیکھا، یہاں تک کہ آپ اپنے دونوں ہاتھوں کو اپنے دونوں کانوں کی لو کے بالمقابل کر لیتے ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو اپنے دونوں ہاتھ اٹھاتے ہوئے دیکھا، انہوں نے اسی کے مثل روایت ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب نماز میں داخل ہو جاتے …. پھر آگے انہوں نے اسی طرح کی حدیث ذکر کی، اس میں انہوں نے یہ اضافہ کیا ہے کہ جب آپ صلی اللہ علیہ وسلم رکوع کرتے تو بھی ایسا ہی کرتے، اور جب رکوع سے سر اٹھاتے تو بھی، اور جب سجدہ سے سر اٹھاتے تو بھی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز شروع کرتے، اور جب رکوع کرتے، اور جب رکوع سے اپنا سر اٹھاتے، تو اپنے دونوں ہاتھ اٹھاتے اور سجدہ کرنے میں ایسا نہیں کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ سجدہ کرتے تو اپنے ہاتھوں سے پہلے اپنے گھٹنے رکھتے، اور جب اٹھتے تو اپنے گھٹنوں سے پہلے اپنے ہاتھ اٹھاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1090,
			"arabicnumber": 1090,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا تم میں سے کوئی اپنی نماز کا قصد کرتا ہے تو وہ بیٹھتا ہے جیسے اونٹ بیٹھتا ہے؟ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی سجدہ کرے تو اپنے گھٹنوں سے پہلے اپنا ہاتھ زمین پر رکھے، اور وہ اونٹ کے بیٹھنے کی طرح نہ بیٹھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دونوں ہاتھ سجدہ کرتے ہیں جس طرح چہرہ سجدہ کرتا ہے، لہٰذا جب تم میں کا کوئی اپنا چہرہ زمین پر رکھے تو اپنے دونوں ہاتھ بھی رکھے، اور جب اسے اٹھائے تو ان دونوں کو بھی اٹھائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کو حکم دیا گیا کہ آپ سات اعضاء ۱؎ پر سجدہ کریں، اور اپنے بال اور کپڑے نہ سمیٹیں ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "عباس بن عبدالمطلب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب بندہ سجدہ کرتا ہے تو اس کے ساتوں اعضاء: اس کا چہرہ، اس کے دونوں ہاتھ، دونوں گھٹنے، اور دونوں پیر بھی سجدہ کرتے ہیں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ میری آنکھوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ ( رمضان کی ) اکیسویں رات کی صبح کو آپ کی پیشانی اور ناک پر پانی اور مٹی کا نشان تھا، یہ ایک لمبی حدیث کا اختصار ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مجھے حکم دیا گیا ہے کہ سات اعضاء: پیشانی اور ناک، دونوں ہتھیلی، دونوں گھٹنے، اور دونوں پیر پر سجدہ کروں، اور بال اور کپڑے نہ سمیٹوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: مجھے سات ہڈیوں پر سجدہ کرنے کا حکم دیا گیا ہے: پیشانی پر، اور آپ نے اپنے ہاتھ سے ناک پر کا اشارہ کیا، اور دونوں ہتھیلیوں، دونوں گھٹنے، اور دونوں پیر کے کناروں یعنی انگلیوں پر۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کو سات اعضاء پر سجدہ کرنے کا حکم دیا گیا، اور بالوں اور کپڑوں کو سمیٹنے سے روکا گیا: اپنی دونوں ہتھیلیوں، دونوں گھٹنے اور انگلیوں کے سروں پر۔ سفیان کہتے ہیں: ابن طاؤس نے اپنے دونوں ہاتھ پیشانی پر رکھے، اور انہیں اپنی ناک پر گزارا، اور کہا: یہ سب ایک ہے۔ امام نسائی کہتے ہیں: یہ الفاظ محمد بن منصور کے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "عباس بن عبدالمطلب رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جب بندہ سجدہ کرتا ہے تو اس کے ساتھ اس کے ساتوں اعضاء یعنی اس کا چہرہ، دونوں ہتھیلی، دونوں گھٹنے اور دونوں پیر سجدہ کرتے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ایک رات مجھے رسول اللہ صلی اللہ علیہ وسلم بستر پہ نہیں ملے تو میں تلاش کرتی ہوئی آپ تک پہنچی، آپ سجدے میں تھے، آپ کے دونوں قدم کھڑے تھے، اور آپ یہ دعا پڑھ رہے تھے: «اللہم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وبك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك» اے اللہ! میں پناہ مانگتا ہوں تیری رضا مندی کی تیری ناراضگی سے، تیرے عفو و درگزر کی تیری سزا اور عقوبت سے، اور تیری پناہ چاہتا ہوں تیرے غضب سے، میں تیری تعریف کی طاقت نہیں رکھتا، تو ویسے ہی ہے جیسے تو نے اپنی تعریف بیان کی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "ابو حمید ساعدی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب سجدہ کرنے کے لیے زمین کی طرف جھکتے تو اپنے بازوؤں کو اپنی بغل سے الگ رکھتے، اور اپنے پیر کی انگلیوں کو کھلا رکھتے – یہ ایک لمبی حدیث کا اختصار ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں مدینہ آیا تو میں نے ( اپنے جی میں ) کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم کی نماز ضرور دیکھوں گا ( کہ آپ کیسے نماز پڑھتے ہیں تو میں نے دیکھا ) آپ صلی اللہ علیہ وسلم نے اللہ اکبر کہا، اور اپنے دونوں ہاتھ اٹھائے یہاں تک کہ میں نے آپ کے دونوں انگوٹھوں کو آپ کی دونوں کانوں کے قریب دیکھا، اور جب آپ نے رکوع کرنے کا ارادہ کیا تو اللہ اکبر کہا، اور اپنے دونوں ہاتھ اٹھائے، پھر آپ نے رکوع سے اپنا سر اٹھایا، اور «سمع اللہ لمن حمده» کہا، پھر آپ نے اللہ اکبر کہا، اور سجدہ کیا، آپ کے دونوں ہاتھ آپ کی دونوں کانوں کی اس جگہ تک اٹھے جہاں تک آپ نے شروع نماز میں انہیں اٹھایا تھا ( یعنی انہیں دونوں کانوں کے بالمقابل اٹھایا ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں کوئی شخص سجدے میں اپنے دونوں بازو ( زمین پر ) کتے کے بچھانے کی طرف نہ بچھائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "ابواسحاق سبیعی کہتے ہیں کہ براء رضی اللہ عنہ نے ہمیں سجدہ کر کے دکھایا تو انہوں نے اپنے دونوں ہاتھ زمین پر رکھے، اور اپنی سرین اٹھائے رکھی، اور کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسے ہی کرتے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "براء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز پڑھتے تو اپنے دونوں بازو کھلا رکھتے، اور انہیں اپنے پہلوؤں سے دور رکھتے، اور اپنا پیٹ زمین سے اٹھائے رکھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "عبداللہ بن مالک ابن بحینہ رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز پڑھتے تو اپنے دونوں ہاتھوں کے بیچ کشادگی رکھتے، یہاں تک کہ آپ کے بغل کی سفیدی ظاہر ہو جاتی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ اگر میں رسول اللہ صلی اللہ علیہ وسلم کے سامنے ہوتا تو میں آپ کی دونوں بغل ضرور دیکھتا ہوتا ۱؎۔ ابومجلز کہتے ہیں کہ گویا انہوں نے یہ بات اس وجہ سے کہی ہے کیونکہ وہ نماز میں موجود تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "عبداللہ بن اقرم رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی، جب آپ سجدہ کرتے تو مجھے آپ کی دونوں بغل کی سفیدی نظر آتی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب سجدہ کرتے تو اپنے ہاتھ اپنے پہلو سے جدا رکھتے یہاں تک کہ اگر کوئی بکری کا بچہ آپ کے ہاتھوں کے نیچے سے گزرنا چاہتا تو گزر جاتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سجدے میں اپنی ہیئت درمیانی رکھو ۱؎ اور تم میں سے کوئی اپنے دونوں ہاتھوں کو کتے کی طرح نہ پھیلائے – یہ الفاظ اسحاق بن راہویہ کے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "ابومسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وہ نماز کفایت نہیں کرتی جس میں آدمی رکوع اور سجدے میں اپنی پیٹھ سیدھی نہ رکھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "عبدالرحمٰن بن شبل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے تین باتوں سے منع کیا ہے: ایک کوے کی طرح ٹھونگ مارنے سے، دوسری درندوں کی طرح ہاتھ بچھانے سے، اور تیسری یہ کہ آدمی نماز کے لیے ایک جگہ خاص کر لے جیسے اونٹ اپنے بیٹھنے کی جگہ کو خاص کر لیتا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مجھے حکم دیا گیا ہے کہ میں سات اعضاء پر سجدہ کروں، اور بال اور کپڑے نہ سمیٹوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ انہوں نے عبداللہ بن حارث رضی اللہ عنہ کو اس حالت میں نماز پڑھتے دیکھا کہ ان کے سر میں پیچھے جوڑا بندھا ہوا تھا، تو وہ کھڑے ہو کر اسے کھولنے لگے، جب عبداللہ بن حارث رضی اللہ عنہ سلام پھیر چکے تو ابن عباس رضی اللہ عنہم کے پاس آئے، اور کہنے لگے: آپ کو میرے سر سے کیا مطلب تھا؟ تو انہوں نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: اس کی مثال اس آدمی جیسی ہے جو نماز پڑھ رہا ہو اور اس کے ہاتھ بندھے ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کو سات ہڈیوں پر سجدہ کرنے کا حکم دیا گیا ہے، اور بال اور کپڑے سمیٹنے سے منع کیا گیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ جب ہم رسول اللہ صلی اللہ علیہ وسلم کے پیچھے ظہر کی نماز پڑھتے تو گرمی سے بچنے کے لیے اپنے کپڑوں پر سجدہ کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم رکوع اور سجدہ پوری طرح کرو، اللہ کی قسم! میں اپنی پیٹھ کے پیچھے سے تمہیں رکوع اور سجدہ کی حالت میں دیکھتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ مجھے میرے محبوب صلی اللہ علیہ وسلم نے تین باتوں سے منع کیا ہے، میں نہیں کہتا کہ لوگوں کو بھی منع کیا ہے، مجھے سونے کی انگوٹھی پہننے سے، قسی کے بنے ہوئے ریشمی کپڑے پہننے سے، اور کُسم میں رنگے ہوئے گہرے سرخ کپڑے پہننے سے منع کیا ہے، اور میں رکوع اور سجدے کی حالت میں قرآن نہیں پڑھتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے رکوع اور سجدے کی حالت میں قرآن پڑھنے سے منع کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی اس بیماری میں جس میں آپ کی وفات ہوئی پردہ ہٹایا، آپ کا سر مبارک کپڑے سے بندھا ہوا تھا، آپ صلی اللہ علیہ وسلم نے تین بار فرمایا: اے اللہ! میں نے پہنچا دیا ( پھر فرمایا: ) نبوت کی خوش خبریوں میں سے سوائے سچے خواب کے جسے بندہ خود دیکھتا ہے یا اس کے لیے کوئی اور دیکھتا ہے کوئی اور چیز باقی نہیں رہ گئی ہے، سنو! مجھے رکوع اور سجدے میں قرآن پڑھنے سے منع کیا گیا ہے، تو جب تم رکوع کرو تو اپنے رب کی عظمت بیان کرو، اور جب سجدہ کرو تو دعا میں کوشش کرو کیونکہ یہ حالت اس لائق ہے کہ تمہاری دعا قبول کی جائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ میں نے اپنی خالہ ام المؤمنین میمونہ بنت حارث رضی اللہ عنہا کے پاس رات گزاری، اور رسول اللہ صلی اللہ علیہ وسلم بھی اس رات کو ان ہی کے پاس رہے، میں نے آپ کو دیکھا کہ آپ اپنی حاجت کے لیے اٹھے، مشک کے پاس آئے، اور اس کا بندھن کھولا، پھر وضو کیا جو دو وضوؤں کے درمیان تھا، ( یعنی شرعی وضو نہیں تھا ) ، پھر آپ اپنے بستر پہ آئے، اور سو گئے، پھر دوسری بار اٹھے، مشک کے پاس آئے، اور اس کا بندھن کھولا، پھر وضو کیا یہ ( شرعی ) وضو تھا، پھر آپ صلی اللہ علیہ وسلم اٹھ کر نماز پڑھنے لگے، آپ اپنے سجدے میں یہ دعا پڑھ رہے تھے: «اللہم اجعل في قلبي نورا واجعل في سمعي نورا واجعل في بصري نورا واجعل من تحتي نورا واجعل من فوقي نورا وعن يميني نورا وعن يساري نورا واجعل أمامي نورا واجعل خلفي نورا وأعظم لي نورا» اے اللہ! میرے دل کو منور کر دے، میرے کانوں کو نور ( روشنی ) سے بھر دے، میری آنکھوں کو روشن کر دے، میرے نیچے نور کر دے، میرے اوپر نور کر دے، میرے دائیں نور کر دے، میرے بائیں نور کر دے، میرے آگے نور کر دے، میرے پیچھے نور کر دے، اور میرے لیے نور کو عظیم کر دے ، پھر آپ سو گئے یہاں تک کہ خراٹے لینے لگے، پھر بلال رضی اللہ عنہ آئے، اور آپ صلی اللہ علیہ وسلم کو نماز کے لیے جگایا۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اپنے رکوع اور سجدے میں «سبحانك اللہم ربنا وبحمدك اللہم اغفر لي اے اللہ! ہمارے رب! تو پاک ہے اور ہم تیری تعریف کے ساتھ تیری تسبیح بیان کرتے ہیں، اے اللہ تو مجھے بخش دے کہہ رہے تھے، آپ قرآن کی عملی تفسیر فرما رہے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رکوع اور سجدے میں «سبحانك اللہم ربنا وبحمدك اللہم اغفر لي» اے اللہ ہمارے رب! تو پاک ہے اور ہم تیری تعریف کے ساتھ تیری تسبیح بیان کرتے ہیں، اے اللہ تو مجھے بخش دے کہہ رہے تھے، آپ صلی اللہ علیہ وسلم قرآن کی عملی تفسیر فر مار ہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ایک رات رسول اللہ صلی اللہ علیہ وسلم مجھے اپنی خواب گاہ میں نہیں ملے، تو میں آپ کو تلاش کرنے لگی، اور مجھے گمان ہوا کہ شاید آپ اپنی کسی لونڈی کے پاس چلے گئے ہیں کہ اچانک میرا ہاتھ آپ پر پڑا، آپ سجدے میں تھے، اور کہہ رہے تھے: «اللہم اغفر لي ما أسررت وما أعلنت» اے اللہ! بخش دے میرے ان گناہوں کو جنہیں میں نے چھپا کر کیا ہے اور جنہیں میں نے اعلانیہ کیا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے ایک رات رسول اللہ صلی اللہ علیہ وسلم کو اپنے بستر پر موجود نہیں پایا، میں نے گمان کیا کہ شاید آپ اپنی کسی لونڈی کے پاس چلے گئے ہیں، چنانچہ میں نے آپ کو تلاش کیا، تو کیا دیکھتی ہوں کہ آپ سجدہ میں ہیں اور کہہ رہے ہیں: «رب اغفر لي ما أسررت وما أعلنت» اے میرے رب! میرے تمام گناہوں کو جو میں نے چھپے اور کھلے کئے ہیں بخش دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "علی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب سجدہ کرتے تو کہتے: «اللہم لك سجدت ولك أسلمت وبك آمنت سجد وجهي للذي خلقه وصوره فأحسن صورته وشق سمعه وبصره تبارك اللہ أحسن الخالقين» اے اللہ! میں نے تیرے لیے اپنی پیشانی زمین سے ٹیک دی، اور تیرے ہی لیے میں اسلام لایا، اور تجھی پر میں ایمان لایا، میرے چہرے نے سجدہ کیا، اس ذات کے لیے جس نے اسے پیدا کیا، اور اس کی صورت گری کی، اور اچھی صورت گری کی، اور جس نے اس کے کان اور اس کی آنکھیں پھاڑیں، اللہ بڑی برکت والا ہے، اور سب سے بہترین پیدا کرنے والا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "(جابربن عبداللہ رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم اپنے سجدے میں کہتے تھے: «اللہم لك سجدت وبك آمنت ولك أسلمت وأنت ربي سجد وجهي للذي خلقه وصوره وشق سمعه وبصره تبارك اللہ أحسن الخالقين» اے اللہ! میں نے تیرے لیے اپنی پیشانی زمین پر ٹیک دی، تیرے ہی اوپر ایمان لایا، تیرے ہی لیے میں مسلمان ہوا، تو ہی میرا رب ہے، میرے چہرہ نے اس ذات کے لیے سجدہ کیا جس نے اسے پیدا کیا، اور اس کی صورت گری کی، اور جس نے اس کے کان اور اس کی آنکھیں بنائیں، بڑی برکتوں والا ہے، اللہ سب سے بہترین پیدا کرنے والا ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "محمد بن مسلمہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب رات میں اٹھتے تو نفل پڑھتے، اور جب سجدہ کرتے تو کہتے: «اللہم لك سجدت وبك آمنت ولك أسلمت اللہم أنت ربي سجد وجهي للذي خلقه وصوره وشق سمعه وبصره تبارك اللہ أحسن الخالقين» اے اللہ! میں نے تیرے ہی لیے سجدہ کیا، تجھی پر میں ایمان لایا، تیرے لیے میں مسلمان ہوا، اے اللہ! تو ہی میرا رب ہے، میرے چہرہ نے اس ذات کے لیے سجدہ کیا جس نے اسے پیدا کیا، اور اس کی صورت گری کی، اور اس کے کان اور اس کی آنکھیں بنائیں، اللہ بڑی برکتوں والا، سب سے بہترین پیدا کرنے والا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم رات کو تلاوت قرآن کے سجدوں میں کہتے: «سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته» میرے چہرہ نے سجدہ کیا اس ذات کے لیے جس نے اسے پیدا کیا، اور اس کے کان اور اس کی آنکھیں اپنی قوت و طاقت سے بنائیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ایک رات میں نے رسول اللہ صلی اللہ علیہ وسلم کو ( بستر پر ) موجود نہیں پایا، تو دیکھا کہ آپ سجدے کی حالت میں ہیں، اور آپ کے دونوں قدموں کے پنجے قبلہ رخ ہیں، تو میں نے آپ کو سجدہ میں کہتے سنا: «أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك» میں پناہ مانگتا ہوں تیری رضا مندی کی تیری ناراضگی سے، میں پناہ مانگتا ہوں تیری معافی کی تیری سزا سے، اور میں پناہ مانگتا ہوں تیری تجھ سے، میں تیری حمد و ثنا کا حق نہیں ادا کر سکتا، تو ایسے ہی ہے جیسے تو نے اپنی تعریف خود کی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایک رات ( بستر پر ) موجود نہیں پایا، تو میں نے گمان کیا کہ آپ اپنی کسی دوسری بیوی کے پاس چلے گئے ہیں، پھر میں نے آپ کو تلاش کیا تو اچانک کیا دیکھتی ہوں کہ آپ رکوع یا سجدہ کی حالت میں کہہ رہے ہیں: «سبحانك اللہم وبحمدك لا إله إلا أنت» اے اللہ! تو پاک ہے، میں تیری تعریف کے ساتھ تیری تسبیح بیان کرتا ہوں، نہیں ہے کوئی معبود برحق مگر تو ہی ، تو وہ کہنے لگیں: میرے ماں باپ آپ پر فدا ہوں! میں کس خیال میں تھی اور آپ کس حال میں ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "عوف بن مالک رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ اٹھا، پہلے آپ نے مسواک کی، پھر وضو کیا، پھر کھڑے ہوئے اور نماز پڑھنے لگے، تو آپ نے سورۃ البقرہ شروع کی، آپ جب بھی کسی رحمت کی آیت سے گزرتے تو ٹھہرتے اور اللہ تعالیٰ سے اس پر رحمت کا سوال کرتے، اور جب بھی عذاب کی کسی آیت سے گزرتے تو ٹھہرتے، اور اس کے عذاب سے اس کی پناہ مانگتے، پھر آپ نے رکوع کیا، تو رکوع میں اپنے قیام کے بقدر ٹھہرے رہے، آپ اپنے رکوع میں کہہ رہے تھے: «سبحان ذي الجبروت والملكوت والكبرياء والعظمة» پھر آپ نے اپنے رکوع کے بقدر سجدہ کیا، اور اپنے سجدے میں آپ کہہ رہے تھے: «سبحان ذي الجبروت والملكوت والكبرياء والعظمة»، پھر آپ نے دوسری رکعت میں سورۃ آل عمران پڑھی، پھر ایک اور سورۃ پڑھی، پھر ایک اور سورۃ پڑھی، آپ نے اسی طرح کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ میں نے ایک رات رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی، تو آپ نے سورۃ البقرہ شروع کر دی، آپ نے سو آیتیں پڑھ لیں لیکن رکوع نہیں کیا، اور آگے بڑھ گئے، میں نے اپنے جی میں کہا: لگتا ہے کہ آپ اسے دونوں رکعتوں میں ختم کر دیں گے، لیکن آپ برابر آگے بڑھتے رہے، تو میں نے اپنے جی میں کہا کہ آپ اسے ختم کر کے ہی پھر رکوع کریں گے، لیکن آپ سورت ختم کر کے آگے بڑھ گئے یہاں تک کہ پوری سورۃ نساء آپ نے پڑھ ڈالی، پھر سورۃ اٰل عمران بھی پڑھ ڈالی، پھر تقریباً اپنے قیام ہی کے برابر رکوع میں رہے، اپنے رکوع میں کہہ رہے تھے: «سبحان ربي العظيم سبحان ربي العظيم سبحان ربي العظيم» پھر آپ نے اپنا سر اٹھایا، اور «سمع اللہ لمن حمده ربنا لك الحمد» کہا، اور دیر تک کھڑے رہے، پھر آپ نے سجدہ کیا تو دیر تک سجدہ میں رہے، آپ سجدے میں کہہ رہے تھے: «سبحان ربي الأعلى سبحان ربي الأعلى سبحان ربي الأعلى» جب آپ کسی خوف کی یا اللہ تعالیٰ کی بڑائی کی آیت پر سے گزرتے، تو اللہ کا ذکر کرتے یعنی اس کی حمد و ثنا کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اپنے رکوع اور سجدے میں «سبوح قدوس رب الملائكة والروح» تمام فرشتے اور جبرائیل کا رب ہر نقص و عیب سے پاک ہے کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "سعید بن جبیر کہتے ہیں کہ میں نے انس بن مالک رضی اللہ عنہ کو کہتے سنا کہ میں نے اس نوجوان یعنی عمر بن عبدالعزیز سے بڑھ کر رسول اللہ صلی اللہ علیہ وسلم کی نماز کے مشابہ نماز کسی کی نہیں دیکھی، تو ہم نے ان کے رکوع میں دس تسبیحوں کا، اور سجدے میں بھی دس تسبیحوں کا اندازہ لگایا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "رفاعہ بن رافع رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم بیٹھے تھے، اور ہم لوگ آپ کے اردگرد تھے، اتنے میں ایک شخص آیا اور وہ قبلہ رخ ہو کر نماز پڑھنے لگا، جب وہ اپنی نماز پوری کر چکا تو آیا، اور رسول اللہ صلی اللہ علیہ وسلم اور لوگوں کو سلام کیا، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: تم پر بھی سلامتی ہو، جاؤ پھر سے نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی ، تو وہ گیا، اور اس نے جا کر پھر سے نماز پڑھی، اور رسول اللہ صلی اللہ علیہ وسلم اس کی نماز کو کنکھیوں سے دیکھ رہے تھے لیکن وہ یہ جان نہیں رہا تھا کہ اس میں وہ کیا غلطی کر رہا ہے؟ تو جب وہ اپنی نماز پوری کر چکا تو آیا، اور اس نے رسول اللہ صلی اللہ علیہ وسلم اور لوگوں کو سلام کیا، رسول اللہ صلی اللہ علیہ وسلم نے پھر اس سے فرمایا: تم پر بھی سلامتی ہو، جاؤ پھر سے نماز پڑھو، کیونکہ تم نے نماز نہیں پڑھی ، چنانچہ اس نے دو یا تین بار نماز دہرائی، پھر اس شخص نے پوچھا: اللہ کے رسول! میری نماز میں آپ نے کیا خامی پائی ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کسی کی نماز پوری نہیں ہوتی جب تک کہ وہ اچھی طرح وضو نہ کر لے جس طرح اللہ تعالیٰ نے اس کے کرنے کا حکم دیا ہے، وہ اپنا چہرہ دھوئے، اپنے دونوں ہاتھ کہنیوں سمیت دھوئے، اپنے سر کا مسح کرے، اور اپنے دونوں پیر ٹخنوں سمیت دھوئے، پھر اللہ تعالیٰ کی بڑائی کرے ( یعنی تکبیر تحریمہ کہے ) اور اس کی حمد و ثناء اور بزرگی بیان کرے ( یعنی دعائے ثناء پڑھے ) ۔ ہمام کہتے ہیں: میں نے اسحاق کو «ويحمد اللہ ويمجده ويكبره» بھی کہتے سنا ہے، وہ کہتے ہیں: میں نے دونوں طرح سے انہیں کہتے سنا ہے۔ آگے آپ صلی اللہ علیہ وسلم نے فرمایا: اور قرآن میں سے حسب توفیق اور مرضی الٰہی جو آسان ہو پڑھے، پھر اللہ اکبر کہے، اور رکوع کرے یہاں تک کہ اس کے تمام جوڑ اپنی جگہ آ جائیں، اور ڈھیلے پڑ جائیں، پھر «سمع اللہ لمن حمده» کہے، پھر سیدھا کھڑا ہو جائے یہاں تک اس کی پیٹھ برابر ہو جائے، پھر اللہ اکبر کہے، اور سجدہ کرے یہاں تک کہ وہ اپنا چہرہ زمین پر ٹکا دے ، ( میں نے اسحاق کو اپنی پیشانی بھی کہتے سنا ہے ) ، اور تمام جوڑ اپنی جگہ آ جائیں اور ڈھیلے پڑ جائیں، پھر اللہ اکبر کہے، اور اپنا سر اٹھائے یہاں تک کہ اپنی سرین پر سیدھا ہو کر بیٹھ جائے، اور اپنی پیٹھ سیدھی کر لے، پھر اللہ اکبر کہے، اور سجدہ کرے یہاں تک کہ وہ اپنا چہرہ زمین سے اچھی طرح ٹکا دے، اور ڈھیلا پڑ جائے، اگر اس نے اس طرح نہیں کیا تو اس کی نماز پوری نہیں ہوئی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بندہ اپنے رب سے سب سے زیادہ قریب سجدہ کی حالت میں ہوتا ہے، لہٰذا ( سجدے میں ) تم لوگ بکثرت دعا کیا کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "ربیعہ بن کعب اسلمی رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آپ کے وضو اور آپ کی حاجت کا پانی لے کر آتا تھا، تو ایک بار آپ صلی اللہ علیہ وسلم نے فرمایا: جو مانگنا ہو مجھ سے مانگو ، میں نے کہا: میں جنت میں آپ کی رفاقت چاہتا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: اس کے علاوہ اور بھی کچھ؟ میں نے عرض کیا: بس یہی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: تو اپنے اوپر کثرت سجدہ کو لازم کر کے میری مدد کرو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "معدان بن طلحہ یعمری کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے غلام ثوبان رضی اللہ عنہ سے ملاقات کی، تو میں نے کہا: مجھے کوئی ایسا عمل بتائیے جو مجھے فائدہ پہنچائے، یا مجھے جنت میں داخل کرے، وہ تھوڑی دیر خاموش رہے پھر میری طرف متوجہ ہوئے، اور کہنے لگے: تم سجدوں کو لازم پکڑو کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جب بندہ اللہ تعالیٰ کے لیے ایک سجدہ کرتا ہے تو اللہ عزوجل اس کے بدلے، اس کا ایک درجہ بلند کرتا ہے، اور ایک گناہ مٹا دیتا ہے ۔ معدان کہتے ہیں: پھر میں ابو الدرداء رضی اللہ عنہ سے ملا اور میں نے ان سے وہی سوال کیا جو ثوبان رضی اللہ عنہ سے کر چکا تھا، تو انہوں نے بھی مجھ سے یہی کہا: تم سجدوں کو لازم پکڑو کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ جب بندہ اللہ تعالیٰ کے لیے ایک سجدہ کرتا ہے، تو اللہ تعالیٰ اس کے بدلے اس کا ایک درجہ بلند کرتا ہے، اور ایک گناہ مٹا دیتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "عطاء بن یزید کہتے ہیں کہ میں ابوہریرہ رضی اللہ عنہ اور ابوسعید کے پاس بیٹھا ہوا تھا، تو ان دونوں میں سے ایک نے شفاعت کی حدیث بیان کی، اور دوسرے خاموش رہے، انہوں نے کہا: فرشتے آئیں گے، شفاعت کریں گے، اور انبیاء و رسل بھی شفاعت کریں گے، نیز انہوں نے پل صراط کا ذکر کیا، اور کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: پل صراط پار کرنے والا سب سے پہلا شخص میں ہوں گا جب اللہ تعالیٰ اپنی مخلوق کے فیصلوں سے فارغ ہو گا، اور جہنم سے جسے نکالنا چاہے گا نکال لے گا، تو اللہ فرشتوں کو اور رسولوں کو حکم دے گا کہ وہ شفاعت کریں، قابل شفاعت لوگ اپنی نشانیوں سے پہچان لیئے جائیں گے، آگ ابن آدم کی ہر چیز کھا جائے گی سوائے سجدہ کی جگہ کے، پھر ان پر چشمہ حیات کا پانی انڈیلا جائے گا، تو وہ اگنے لگیں گے جیسے سیلاب کے خش و خاشاک میں دانہ اگتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "شداد رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مغرب اور عشاء کی دونوں نمازوں میں سے کسی ایک نماز کے لیے نکلے، اور حسن یا حسین کو اٹھائے ہوئے تھے، جب آپ نماز پڑھانے کے لیے آگے بڑھے تو انہیں ( زمین پر ) بٹھا دیا، پھر آپ نے نماز کے لیے تکبیر تحریمہ کہی، اور نماز شروع کر دی، اور اپنی نماز کے دوران آپ نے ایک سجدہ لمبا کر دیا، تو میں نے اپنا سر اٹھایا تو کیا دیکھتا ہوں کہ بچہ رسول اللہ صلی اللہ علیہ وسلم کی پیٹھ پر ہے، اور آپ سجدے میں ہیں، پھر میں اپنے سجدے کی طرف دوبارہ پلٹ گیا، جب رسول اللہ صلی اللہ علیہ وسلم نے نماز پوری کر لی تو لوگوں نے عرض کیا: اللہ کے رسول! آپ نے نماز کے درمیان ایک سجدہ اتنا لمبا کر دیا کہ ہم نے سمجھا کوئی معاملہ پیش آ گیا ہے، یا آپ پر وحی نازل ہونے لگی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: ان میں سے کوئی بات نہیں ہوئی تھی، البتہ میرے بیٹے نے مجھے سواری بنا لی تھی تو مجھے ناگوار لگا کہ میں جلدی کروں یہاں تک کہ وہ اپنی خواہش پوری کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ہر جھکنے، اٹھنے، کھڑے ہونے اور بیٹھنے میں اللہ اکبر کہتے دیکھا، اور آپ اپنے دائیں اور بائیں السلام علیکم ورحمۃ اللہ وبرکاتہ کہتے ہوئے سلام پھیرتے یہاں تک کہ آپ کے گال کی سفیدی دکھائی دیتی، اور میں نے ابوبکر و عمر رضی اللہ عنہم کو بھی ایسے ہی کرتے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "مالک بن حویرث رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب نماز شروع کرتے تو اپنے دونوں ہاتھ اٹھاتے، اور جب رکوع کرتے تو بھی ایسا ہی کرتے، اور جب رکوع سے سر اٹھاتے تو بھی ایسا ہی کرتے، اور جب سجدہ سے سر اٹھاتے تو بھی ایسا ہی کرتے یعنی اپنے دونوں ہاتھ اٹھاتے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب نماز شروع کرتے تو اللہ اکبر کہتے، اور اپنے دونوں ہاتھ اٹھاتے تھے، اور جب رکوع کرتے تو بھی، اور رکوع کے بعد بھی، اور دونوں سجدوں کے درمیان نہیں اٹھاتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس پہنچے اور آپ کے پہلو میں جا کر کھڑے ہو گئے، آپ نے «اللہ أكبر ذو الملكوت والجبروت والكبرياء والعظمة» کہا، پھر آپ نے سورۃ البقرہ پڑھی، پھر رکوع کیا، آپ کا رکوع تقریباً آپ کے قیام کے برابر رہا، اور آپ نے رکوع میں:«سبحان ربي العظيم سبحان ربي العظيم‏» کہا، اور جب آپ صلی اللہ علیہ وسلم نے اپنا سر اٹھایا تو: «لربي الحمد لربي الحمد» کہا، اور آپ اپنے سجدہ میں «سبحان ربي الأعلى سبحان ربي الأعلى» اور دونوں سجدوں کے درمیان «رب اغفر لي رب اغفر لي‏» کہتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "نضر بن کثیر ابوسہل ازدی کہتے ہیں کہ عبداللہ بن طاؤس نے منیٰ میں مسجد خیف میں میرے پہلو میں نماز پڑھی، تو انہوں نے جب پہلا سجدہ کیا، اور سجدے سے اپنا سر اٹھایا تو اپنے دونوں ہاتھوں کو چہرے کے بالمقابل اٹھایا، مجھے یہ بات عجیب لگی تو میں نے وہیب بن خالد سے کہا کہ یہ ایسا کام کر رہے ہیں جو میں نے کبھی کسی کو کرتے نہیں دیکھا؟، تو وہیب نے ان سے کہا: آپ ایسا کام کرتے ہیں جسے ہم نے کسی کو کرتے نہیں دیکھا؟ اس پر عبداللہ بن طاؤس نے کہا: میں نے اپنے والد کو ایسا کرتے دیکھا ہے، اور میرے والد نے کہا: میں نے عبداللہ بن عباس رضی اللہ عنہم کو ایسا کرتے دیکھا ہے، اور عبداللہ بن عباس رضی اللہ عنہم نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسا کرتے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب سجدہ کرتے تو اپنے دونوں ہاتھ اپنے پہلو سے جدا رکھتے یہاں تک کہ آپ کے پیچھے آپ کے بغل کی سفیدی نظر آتی، اور جب بیٹھتے تو اپنی بائیں ران زمین پر لگا کر بیٹھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "براء رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی نماز یعنی آپ کا رکوع، سجدہ، رکوع سے سر اٹھانے کے بعد کا قیام اور دونوں سجدوں کے درمیان کا بیٹھنا تقریباً سب برابر برابر ہوتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہر اٹھتے، جھکتے، کھڑے ہوتے اور بیٹھتے وقت اللہ اکبر کہتے، اور ابوبکر و عمر اور عثمان رضی اللہ عنہم بھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1150,
			"arabicnumber": 1150,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب نماز کے لیے اٹھتے تو جس وقت کھڑے ہوتے «اللہ اکبر» کہتے، پھر جب رکوع کرتے تو«اللہ اکبر» کہتے، پھر جس وقت اپنی پیٹھ رکوع سے اٹھاتے تو «سمع اللہ لمن حمده» کہتے، پھر کھڑے ہو کر کہتے: «ربنا لك الحمد» پھر جب سجدہ کے لیے جھکتے تو «اللہ اکبر» کہتے، پھر جب سجدہ سے سر اٹھاتے تو «اللہ اکبر» کہتے، پھر جب ( دوسرا ) سجدہ کرتے تو «اللہ اکبر» کہتے، پھر جب سجدہ سے سر اٹھاتے تو «اللہ اکبر» کہتے، پھر پوری نماز میں ایسا ہی کرتے یہاں تک کہ آپ اسے پوری کر لیتے، اور جس وقت دوسری رکعت سے بیٹھنے کے بعد اٹھتے تو ( بھی ) «اللہ اکبر» کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1151,
			"arabicnumber": 1151,
			"text": "ابوقلابہ کہتے ہیں کہ ابوسلیمان مالک بن حویرث رضی اللہ عنہ ہماری مسجد میں آئے اور کہنے لگے: میں تمہیں دکھانا چاہتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کیسے نماز پڑھتے دیکھا ہے، تو وہ پہلی رکعت میں آخری سجدہ سے اپنا سر اٹھاتے وقت بیٹھے ( جلسہ استراحت کرتے ) ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1152,
			"arabicnumber": 1152,
			"text": "مالک بن حویرث رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو نماز پڑھتے دیکھا، جب آپ اپنی نماز کی طاق رکعتوں میں ہوتے تو جب تک بیٹھ کر سیدھے نہیں ہو جاتے نہیں اٹھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1153,
			"arabicnumber": 1153,
			"text": "ابوقلابہ کہتے ہیں کہ مالک بن حویرث رضی اللہ عنہ ہمارے پاس آتے تو کہتے: کیا میں تمہیں رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں نہ بتاؤں؟ تو وہ بغیر وقت کے نماز پڑھتے، جب وہ پہلی رکعت میں دوسرے سجدے سے اپنا سر اٹھاتے تو بیٹھ کر سیدھے ہو جاتے، پھر کھڑے ہوتے تو زمین پر اپنا ہاتھ ٹیکتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1154,
			"arabicnumber": 1154,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ سجدہ کرتے تو گھٹنوں کو ہاتھ سے پہلے زمین پر رکھتے، اور جب اٹھتے تو اپنے ہاتھوں کو گھٹنوں سے پہلے اٹھاتے۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: اسے شریک سے یزید بن ہارون کے علاوہ کسی اور نے روایت نہیں کیا ہے، واللہ تعالیٰ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1155,
			"arabicnumber": 1155,
			"text": "ابوسلمہ کہتے ہیں کہ ابوہریرہ رضی اللہ عنہ انہیں نماز پڑھاتے تھے، تو جب جب جھکتے اور اٹھتے «اللہ اکبر» کہتے، پھر جب وہ سلام پھیر کر پلٹتے تو کہتے: قسم اللہ کی، میں تم میں نماز کے اعتبار سے رسول اللہ صلی اللہ علیہ وسلم سے سب سے زیادہ مشابہت رکھتا ہوں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1156,
			"arabicnumber": 1156,
			"text": "ابوبکر بن عبدالرحمٰن اور ابوسلمہ بن عبدالرحمٰن سے روایت ہے کہ ان دونوں نے ابوہریرہ رضی اللہ عنہ کے پیچھے نماز پڑھی، جب انہوں نے رکوع کیا تو اللہ اکبر کہا، پھر رکوع سے اپنا سر اٹھایا تو «سمع اللہ لمن حمده ربنا ولك الحمد» کہا، پھر سجدہ کیا تو «اللہ اکبر» کہا، اور سجدہ سے اپنا سر اٹھایا تو «اللہ اکبر» کہا، پھر جس وقت رکعت پوری کر کے کھڑے ہوئے تو «اللہ اکبر» کہا، پھر کہا: اس ذات کی قسم جس کے ہاتھ میں میری جان ہے، میں نماز میں ازروئے مشابہت تم میں رسول اللہ صلی اللہ علیہ وسلم سے سب سے زیادہ قریب ہوں، برابر آپ کی نماز ایسے رہی یہاں تک کہ آپ دنیا سے رخصت ہو گئے، یہ الفاظ «سّوار» کے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1157,
			"arabicnumber": 1157,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ نماز کی سنت میں سے یہ بات ہے کہ تم اپنے بائیں پیر کو بچھاؤ اور دائیں کو کھڑا رکھو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1158,
			"arabicnumber": 1158,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ نماز کی سنت میں سے دائیں پیر کو کھڑا رکھنا، اور اس کی انگلیوں کو قبلہ رخ رکھنا اور بائیں پیر پر بیٹھنا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1159,
			"arabicnumber": 1159,
			"text": "وائل بن حجر رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو میں نے آپ کو دیکھا کہ جب آپ نماز شروع کرتے تو اپنے دونوں ہاتھ اٹھاتے یہاں تک کہ اپنے دونوں کندھوں کے بالمقابل کر لیتے، اور جب رکوع کرنے کا ارادہ کرتے تو بھی ایسے ہی اٹھاتے، اور جب دو رکعت پڑھ کر بیٹھتے تو بائیں پیر کو بچھا دیتے، اور دائیں کو کھڑا رکھتے، اور اپنے دائیں ہاتھ کو دائیں ران پر رکھتے، اور ( شہادت کی ) انگلی دعا کے لیے کھڑی رکھتے، اور اپنے بائیں ہاتھ کو اپنی بائیں ران پر رکھتے۔ وائل رضی اللہ عنہ کہتے ہیں: پھر میں آئندہ سال ان لوگوں کے پاس آیا، تو میں نے لوگوں کو جبوں کے اندر اپنے ہاتھ اٹھاتے ہوئے دیکھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1160,
			"arabicnumber": 1160,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ انہوں نے ایک شخص کو دیکھا کہ وہ نماز کی حالت میں اپنے ہاتھ سے کنکریاں ہٹا رہا ہے، تو جب وہ سلام پھیر چکا تو عبداللہ بن عمر رضی اللہ عنہم نے اس سے کہا: جب تم نماز میں رہو تو کنکریوں کو ادھر ادھر مت کرو کیونکہ یہ شیطان کی طرف سے ہے، البتہ اس طرح کرو جیسے رسول اللہ صلی اللہ علیہ وسلم کرتے تھے، اس نے پوچھا: آپ کیسے کرتے تھے؟ تو انہوں نے اپنا داہنا ہاتھ اپنی دائیں ران پر رکھا، اور اپنی اس انگلی سے جو انگوٹھے سے متصل ہے قبلہ کی طرف اشارہ کیا، اور اپنی نگاہ اسی انگلی پر رکھی، پھر کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح کرتے دیکھا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1161,
			"arabicnumber": 1161,
			"text": "عبداللہ بن زبیر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب دوسری یا چوتھی رکعت میں بیٹھتے تو اپنے دونوں ہاتھ اپنے گھٹنوں پہ رکھتے پھر اپنی ( شہادت کی ) انگلی سے اشارہ کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": 1162,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سکھایا کہ جب ہم دوسری رکعت میں بیٹھیں تو «‏التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» تمام بزرگیاں اللہ تعالیٰ کے لیے ہیں، تمام دعائیں اور صلاتیں اور تمام پاک چیزیں بھی، اے نبی! آپ پر سلامتی ہو، اور اللہ کی رحمت اور اس کی برکتیں نازل ہوں، اور سلامتی ہو ہم پر اور اللہ کے نیک بندوں پر، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی حقیقی معبود نہیں، اور میں گواہی دیتا ہوں کہ محمد اس کے بندے اور اس کے رسول ہیں کہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": 1163,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ ہم نہیں جانتے تھے کہ ہر دو رکعت ( کے بعد قعدہ ) میں کیا کہیں، سوائے اس کے کہ ہم اپنے رب کی پاکی بیان کریں، اور اس کی بڑائی اور حمد و ثنا کریں، حالانکہ محمد صلی اللہ علیہ وسلم نے خیر کے فواتح اور خواتم سکھا دئیے ہیں ( یعنی وہ ساری باتیں سکھا دی ہیں جن میں خیر و بھلائی ہیں ) آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم ہر دو رکعت کے بعد بیٹھو تو کہو: «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» تم میں سے ہر ایک کو چاہیئے کہ اسے جو دعا بھی اچھی لگے اختیار کرے، اور اللہ عزوجل سے دعا کرے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": 1164,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں صلاۃ کا تشہد اور حاجت کا تشہد دونوں سکھایا، رہا صلاۃ کا تشہد تو وہ «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": 1165,
			"text": "یحییٰ بن آدم کہتے ہیں کہ میں نے سفیان ( سفیان ثوری ) کو یہی تشہد فرض اور نفل دونوں میں پڑھتے سنا، اور وہ کہتے تھے کہ ہم سے اسحاق نے بیان کیا انہوں نے ابو احوص سے انہوں نے عبداللہ بن مسعود رضی اللہ عنہ سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے، نیز اسے ہم سے منصور اور حماد نے بیان کیا اور ان دونوں نے ابووائل سے روایت کیا اور انہوں نے عبداللہ ابن مسعود سے اور ابن مسعود رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے، ہم کچھ نہیں جانتے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا: تم ہر جلسہ میں «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» کہو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": 1167,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ ہم نہیں جانتے تھے کہ جب ہم صلاۃ پڑھیں تو کیا کہیں، تو نبی اکرم صلی اللہ علیہ وسلم نے ہمیں جامع کلمات سکھائے، آپ نے ہم سے فرمایا: کہو: «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» علقمہ کہتے ہیں کہ میں نے ابن مسعود رضی اللہ عنہ کو دیکھا کہ وہ ہمیں یہ کلمات اسی طرح سکھاتے تھے جیسے وہ ہمیں قرآن سکھاتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": 1168,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ جب ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تو کہتے: «السلام على اللہ السلام على جبريل السلام على ميكائيل» تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «السلام على اللہ» نہ کہو کیونکہ اللہ تعالیٰ سراپا سلام ہے بلکہ یوں کہو: «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وحده لا شريك له وأشهد أن محمدا عبده ورسوله»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": 1169,
			"text": "ابن مسعود رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تو کہتے: «السلام على اللہ السلام على جبريل السلام على ميكائيل» تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: «السلام على اللہ» نہ کہو کیونکہ اللہ تعالیٰ سراپا سلام ہے بلکہ یوں کہو: «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": 1170,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم تشہد میں «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": 1171,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں تشہد سکھاتے جیسے ہمیں قرآن کی سورۃ سکھاتے تھے اور میری ہتھیلی آپ کی دونوں ہتھیلیوں کے درمیان ہوتی ( آپ فرماتے: کہو ) «التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": 1172,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے خطاب کیا، تو اس میں آپ نے ہمیں ہمارا طریقہ سکھایا، اور ہم سے ہماری صلاۃ کی تشریح فرمائی، اور فرمایا: اپنی صفیں درست کرو، پھر تم میں کا کوئی امامت کرے، تو جب وہ «اللہ اکبر» کہے تو تم بھی «اللہ اکبر» کہو، اور وہ «ولا الضالين» کہے تو تم «آمین» کہو، اللہ تعالیٰ تمہاری یہ دعا قبول کرے گا، اور جب امام «اللہ اکبر» کہے، اور رکوع کرے تو تم بھی «اللہ اکبر» کہو اور رکوع کرو، امام تم سے پہلے رکوع کرے گا، اور تم سے پہلے رکوع سے اپنا سر اٹھائے گا، ادھر کی تاخیر ادھر پوری ہو جائے گی، اور جب وہ «سمع اللہ لمن حمده» کہے تو تم«ربنا لك الحمد» کہو، اللہ تعالیٰ تمہاری سنے گا، اللہ تعالیٰ نے نبی اکرم صلی اللہ علیہ وسلم کی زبان پر فرمایا ہے: اللہ نے اس کی سن لی جس نے اس کی تعریف کی، پھر جب امام «اللہ اکبر» کہے، اور سجدہ کرے تو تم بھی «اللہ اکبر» کہو اور سجدہ کرو، امام تم سے پہلے سجدہ کرے گا، اور تم سے پہلے سجدے سے سر اٹھائے گا، ادھر کی تاخیر ادھر پوری ہو جائے گی ۱؎ اور جب امام قاعدے میں ہو تو تم میں سے ہر ایک کی زبان پہ پہلی دعا یہ ہو: «التحيات الطيبات الصلوات لله السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "حطان بن عبداللہ سے روایت ہے کہ ان لوگوں نے ابوموسیٰ اشعری رضی اللہ عنہ کے ساتھ نماز پڑھی، تو انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ جب امام قاعدے میں ہو تو تم میں سے ہر ایک کی زبان پہ پہلی دعا یہ ہو: «التحيات لله الطيبات الصلوات لله السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وحده لا شريك له وأشهد أن محمدا عبده ورسوله» ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں تشہد سکھاتے جیسے ہمیں قرآن پڑھنا سکھاتے تھے، آپ کہتے تھے: «التحيات المباركات الصلوات الطيبات لله سلام عليك أيها النبي ورحمة اللہ وبركاته سلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں تشہد پڑھنا سکھاتے جیسے ہمیں قرآن کی سورۃ پڑھنا سکھاتے، فرماتے: «بسم اللہ وباللہ التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة اللہ وبركاته السلام علينا وعلى عباد اللہ الصالحين أشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله أسأل اللہ الجنة وأعوذ باللہ من النار»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": 1176,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم دوسری رکعت میں ایسا بیٹھتے جیسے گرم پتھر پر بیٹھے ہوں، راوی نے کہا: میں نے کہا: اٹھنے تک؟ تو انہوں نے ( استاد نے ) کہا: ہاں! یہی مراد ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "ابن بحینہ (عبداللہ بن مالک) رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے نماز پڑھائی، تو دوسری رکعت میں جس میں آپ بیٹھنا چاہتے تھے کھڑے ہو گئے، اور اپنی نماز جاری رکھی، یہاں تک کہ نماز کے آخر میں سلام پھیرنے سے پہلے آپ صلی اللہ علیہ وسلم نے دو سجدہ کیا، پھر سلام پھیرا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "ابن بحینہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے نماز پڑھائی، تو دوسری رکعت میں کھڑے ہو گئے، لوگوں نے سبحان اللہ کہا، لیکن آپ نے نماز جاری رکھی، اور جب نماز سے فارغ ہوئے تو دو سجدہ کیا، پھر سلام پھیرا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 150
			}
		}
	]
}