{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"14": "The Book of Jumu'ah (Friday Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( دنیا میں ) ہم پیچھے آنے والے ہیں اور ( قیامت میں ) آگے ہوں گے، صرف اتنی بات ہے کہ انہیں ( یعنی یہود و نصاریٰ کو ) کتاب ہم سے پہلے دی گئی ہے، اور ہمیں ان کے بعد دی گئی ہے، یہ ( جمعہ کا دن ) وہ دن ہے جس دن اللہ نے ان پر عبادت فرض کی تھی مگر انہوں نے اس میں اختلاف کیا ۱؎، تو اللہ تعالیٰ نے اس سے ( یعنی جمعہ کے دن سے ) ہمیں نواز دیا، تو لوگ اس میں ہمارے تابع ہیں ۲؎، یہود کل کی یعنی ہفتہ ( سنیچر ) کی تعظیم کرتے ہیں، اور نصاریٰ پرسوں کی ( یعنی اتوار کی ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "ابوہریرہ اور حذیفہ رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے ہم سے پہلے والوں کو جمعہ سے بھٹکا دیا، یہود کے لیے ہفتہ ( سنیچر ) کا دن مقرر ہوا، اور نصرانیوں کے لیے اتوار کا، پھر اللہ تعالیٰ ہمیں لایا تو اس نے ہمیں جمعہ کے دن سے نوازا، تو اب ( پہلے ) جمعہ ہے، پھر ہفتہ ( سنیچر ) پھر اتوار، اس طرح یہ لوگ قیامت تک ہمارے تابع ہوں گے، ہم دنیا میں بعد میں آئے ہیں مگر قیامت کے دن پہلے ہوں گے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "ابوجعد ضمری رضی اللہ عنہ (جنہیں صحابی ہونے کا شرف حاصل ہے) کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے تین جمعہ سستی سے چھوڑ دیا، اللہ تعالیٰ اس کے دل پر مہر لگا دے گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "عبداللہ بن عباس اور ابن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے منبر کے زینے سے فرمایا: لوگ جمعہ چھوڑنے سے باز آ جائیں، ورنہ اللہ تعالیٰ ان کے دلوں پر مہر لگا دے گا ۱؎ اور وہ غافلوں میں سے ہو جائیں گے ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جمعہ کے لیے ( مسجد ) جانا ہر بالغ مرد پر فرض ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "سمرہ بن جندب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص بنا کسی عذر کے جمعہ چھوڑ دے تو وہ ایک دینار صدقہ کرے، اور اگر ایک دینار نہ ہو تو آدھا دینار ہی کرے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بہترین دن جس میں سورج نکلا جمعہ کا دن ہے، اسی دن آدم علیہ السلام پیدا کیے گئے، اسی دن انہیں جنت میں داخل کیا گیا، اور اسی دن انہیں جنت سے نکالا گیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "اوس بن اوس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تمہارے دنوں میں سب سے افضل ( بہترین ) جمعہ کا دن ہے، اسی دن آدم علیہ السلام پیدا ہوئے، اسی میں ان کی روح قبض کی گئی، اور اسی دن صور پھونکا جائے گا، اور اسی دن بیہوشی طاری ہو گی، لہٰذا تم مجھ پر زیادہ سے زیادہ صلاۃ ( درود و رحمت ) بھیجو کیونکہ تمہاری صلاۃ ( درود و رحمت ) مجھ پر پیش کیے جائیں گے ۱؎ لوگوں نے عرض کیا: اللہ کے رسول! ہماری صلاۃ ( درود و رحمت ) آپ پر کس طرح پیش کی جائیں گی حالانکہ آپ ریزہ ریزہ ہو چکے ہوں گے یعنی وہ کہنا چاہ رہے تھے، کہ آپ بوسیدہ ہو چکے ہوں گے، آپ نے فرمایا: اللہ تعالیٰ نے زمین پر حرام کر دیا ہے کہ وہ انبیاء علیہم السلام کے جسم کو کھائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جمعہ کے دن ہر بالغ شخص پر غسل کرنا واجب ہے، مسواک کرنا بھی، اور خوشبو جس پروہ قادر ہو لگانا بھی ۱؎ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی جمعہ ( کی نماز ) کے لیے آئے تو اسے چاہیئے کہ غسل کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جمعہ کے دن کا غسل ہر بالغ شخص پر واجب ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہر مسلمان شخص پر ہر سات دن میں ایک دن کا غسل ہے، اور وہ جمعہ کا دن ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "قاسم بن محمد ابن ابی بکر کہتے ہیں کہ لوگوں نے ام المؤمنین عائشہ رضی اللہ عنہا کے پاس جمعہ کے دن کے غسل کا ذکر کیا، تو انہوں نے کہا: لوگ «عالیہ» میں رہتے تھے، تو وہ وہاں سے جمعہ میں آتے تھے، اور ان کا حال یہ ہوتا کہ وہ میلے کچیلے ہوتے، جب ہوا ان پر سے ہوتے ہوئے گزرتی تو ان کی بو پھیلتی، تو لوگوں کو تکلیف ہوتی، رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: کیا یہ لوگ غسل کر کے نہیں آ سکتے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "سمرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے جمعہ کے دن وضو کیا، تو اس نے رخصت کو اختیار کیا، اور یہ خوب ہے ۱؎ اور جس نے غسل کیا تو غسل افضل ہے ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: حسن بصری نے سمرہ رضی اللہ عنہ سے اس حدیث کو ان کی کتاب سے روایت کیا ہے، کیونکہ حسن نے سمرہ سے سوائے عقیقہ والی حدیث کے کوئی اور حدیث نہیں سنی ہے ۲؎ واللہ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "اوس بن اوس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو غسل کرائے ۱؎ غسل کرے، سویرے سویرے ( مسجد ) جائے، شروع خطبہ سے موجود رہے، اور امام سے قریب بیٹھے، اور کوئی لغو کام نہ کرے، تو اس کو اس کے ہر قدم کے بدلے ایک سال کے روزے اور قیام کا ثواب ملے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ عمر بن خطاب رضی اللہ عنہ نے ( ریشم کا ) ایک جوڑا ( بکتے ) دیکھا، تو عرض کیا: اللہ کے رسول! کاش آپ اسے خرید لیتے، اور جمعہ کے دن، اور باہر کے وفود کے لیے جب وہ آپ سے ملنے آئیں پہنتے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسے تو وہی پہنے گا جس کا آخرت میں کوئی حصہ نہ ہو ، پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس اس طرح کے کچھ جوڑے آئے، آپ نے ان میں سے ایک جوڑا عمر رضی اللہ عنہ کو دیا، تو انہوں نے عرض کیا: اللہ کے رسول! آپ نے مجھے اسے پہننے کے لیے دیا ہے حالانکہ عطارد کے جوڑے کے بارے میں آپ نے ایسا ایسا کہا تھا؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں نے یہ جوڑا تمہیں اس لیے نہیں دیا ہے کہ اسے تم خود پہنو ، تو عمر رضی اللہ عنہ نے اسے اپنے مشرک بھائی کو دے دیا جو مکہ میں تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جمعہ کے دن غسل کرنا، مسواک کرنا، اور خوشبو لگانا جس پر وہ قادر ہو، ہر بالغ شخص پر واجب ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "اوس بن اوس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص جمعہ کے دن غسل کرے، اپنی بیوی کو غسل کرائے، صبح سویرے ہی جمعہ کے لیے نکلے، شروع خطبہ ہی سے موجود رہے، پیدل چل کر مسجد جائے، سواری نہ کرے، امام سے قریب بیٹھے، اور خاموش رہے کوئی لغو کام نہ کرے، تو اس کے ہر قدم پر ایک سال کے عمل کا ثواب ملے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب جمعہ کا دن آتا ہے تو فرشتے ( اس دن ) مسجد کے دروازوں پر بیٹھ جاتے ہیں، اور جو جمعہ کے لیے آتا ہے اسے لکھتے ہیں، اور جب امام ( خطبہ دینے کے لیے ) نکلتا ہے تو فرشتے رجسٹر لپیٹ دیتے ہیں ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جمعہ کے لیے سب سے پہلے آنے والا ایک اونٹ کی قربانی کرنے والے کی طرح ہے، پھر اس کے بعد والا ایک گائے کی قربانی کرنے والے کی طرح ہے، پھر اس کے بعد والا ایک بکری کی قربانی کرنے والے کی طرح ہے، پھر اس کے بعد والا ایک بطخ کی قربانی کرنے والے کی طرح ہے، پھر اس کے بعد والا ایک مرغی کی قربانی کرنے والے کی طرح ہے، پھر اس کے بعد والا ایک انڈے کی قربانی کرنے والے کی طرح ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب جمعہ کا دن آتا ہے تو مسجد کے دروازوں میں سے ہر دروازے پر فرشتے لوگوں کو ان کے درجات و مراتب کے مطابق یعنی ترتیب وار لکھتے ہیں، جو پہلے آتا ہے اسے پہلے لکھتے ہیں، جب امام خطبہ دینے کے لیے نکلتا ہے تو رجسٹر لپیٹ دیے جاتے ہیں، اور فرشتے خطبہ سننے لگتے ہیں، جمعہ کے لیے سب سے پہلے آنے والا ایک اونٹ قربان کرنے والے کی طرح ہے، پھر جو اس کے بعد آئے وہ ایک گائے قربان کرنے والے کی طرح ہے، پھر جو اس کے بعد آئے وہ ایک مینڈھا قربان کرنے والے کی طرح ہے ، یہاں تک کہ آپ نے مرغی اور انڈے کا ( بھی ) ذکر کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": 1387,
			"text": "ابوہریرہ رضی اللہ عنہ سے مروی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جمعۃ المبارک کے دن فرشتے مسجد کے دروازوں پر بیٹھ جاتے ہیں اور لوگوں کے نام ان کے آنے کی ترتیب کے مطابق لکھتے ہیں۔ ان میں سے کوئی تو اس آدمی کی طرح ہوں گے جس نے اعلیٰ درجے کا اونٹ صدقہ کیا، کچھ اس آدمی کی طرح جس نے کم درجے کا اونٹ صدقہ کیا، کچھ اس آدمی کی طرح جس نے اعلیٰ درجے کی گائے صدقہ کی، کچھ اس آدمی کی طرح جس نے کم درجے کی گائے صدقہ کی، کچھ اس آدمی کی طرح جس نے اعلیٰ درجے کی بکری صدقہ کی، کچھ اس آدمی کی طرح جس نے کم درجے کی بکری صدقہ کی، کچھ اس آدمی کی طرح جس نے بہترین مرغی صدقہ کی اور کچھ اس آدمی کی طرح جس نے کم درجے کی مرغی صدقہ کی، کچھ اس آدمی کی طرح جس نے قیمتی چڑیا صدقہ کی اور کچھ اس آدمی کی طرح جس نے عام چڑیا صدقہ کی، کچھ اس آدمی کی طرح جس نے بہترین انڈہ صدقہ کیا اور کچھ اس آدمی کی طرح جس نے عام انڈہ صدقہ کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": 1388,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے جمعہ کے دن غسل جنابت کے مانند ( خوب اہتمام سے ) غسل کیا، پھر وہ ( جمعہ میں شریک ہونے کے لیے ) پہلی ساعت ( گھڑی ) میں مسجد گیا، تو گویا اس نے ایک اونٹ اللہ کی راہ میں پیش کیا، اور جو شخص اس کے بعد والی گھڑی میں گیا، تو گویا اس نے ایک گائے پیش کی، اور جو تیسری گھڑی میں گیا، تو گویا اس نے ایک مینڈھا پیش کیا، اور جو چوتھی گھڑی میں گیا، تو گویا اس نے ایک مرغی پیش کی، اور جو پانچویں گھڑی میں گیا، تو گویا اس نے ایک انڈا پیش کیا، اور جب امام ( خطبہ دینے کے لیے ) نکل آتا ہے تو فرشتے مسجد کے اندر آ جاتے ہیں، اور خطبہ سننے لگتے ہیں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": 1389,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جمعہ کا دن بارہ ساعتوں ( گھڑیوں ) پر مشتمل ہے، اس کی ایک ساعت ایسی ہے کہ اس میں جو بھی مسلمان بندہ اللہ تعالیٰ سے کچھ مانگتے ہوئے پایا جاتا ہے، تو اسے وہ دیتا ہے، تو تم اسے آخری گھڑی میں عصر کے بعد تلاش کرو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": 1390,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے تھے، پھر ہم لوٹتے تو اپنے اونٹوں کو آرام دیتے، میں نے کہا: وہ کون سا وقت ہوتا؟، انہوں نے کہا: سورج ڈھلنے کا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": 1391,
			"text": "سلمہ بن الاکوع رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ کی نماز پڑھتے تھے، پھر ہم اس حال میں لوٹتے کہ دیواروں کا سایہ نہ ہوتا جس سے سایہ حاصل کیا جا سکے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": 1392,
			"text": "سائب بن یزید رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر و عمر رضی اللہ عنہم کے زمانے میں جمعہ کے دن پہلی اذان اس وقت ہوتی تھی جس وقت امام منبر پر بیٹھتا، پھر جب عثمان رضی اللہ عنہ کا دور خلافت آیا، اور لوگ بڑھ گئے تو انہوں نے جمعہ کے دن تیسری اذان کا حکم دیا ۱؎، وہ اذان مقام زوراء پر دی گئی، پھر اسی پر معاملہ قائم رہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": 1393,
			"text": "سائب بن یزید رضی اللہ عنہ کہتے ہیں کہ تو تیسری اذان کا حکم عثمان رضی اللہ عنہ نے دیا تھا جب اہل مدینہ زیادہ ہو گئے تھے، حالانکہ رسول اللہ صلی اللہ علیہ وسلم کا صرف ایک ہی مؤذن تھا، اور جمعہ کے دن اذان اس وقت ہوتی تھی جب امام ( منبر پر ) بیٹھ جاتا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": 1394,
			"text": "سائب بن یزید رضی اللہ عنہ کہتے ہیں کہ بلال رضی اللہ عنہ اس وقت اذان دیتے جب رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن منبر پر بیٹھ جاتے، پھر جب آپ اترتے تو وہ اقامت کہتے، اسی طرح ابوبکر اور عمر رضی اللہ عنہم کے زمانے میں بھی ہوتا رہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1395,
			"arabicnumber": 1395,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی ( مسجد ) آئے اور امام ( خطبہ کے لیے ) نکل چکا ہو ۱؎ تو چاہیئے کہ وہ دو رکعت پڑھ لے ۔ شعبہ کی روایت میں ہے: جب تم میں سے کوئی جمعہ کے دن آئے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": 1396,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب خطبہ دیتے تو مسجد کے ستونوں میں سے کھجور کے ایک تنا سے آپ ٹیک لگاتے تھے، پھر جب منبر بنایا گیا، اور آپ اس پر کھڑے ہوئے تو وہ ستون ( جس سے آپ سہارا لیتے تھے ) بیقرار ہو کر رونے لگا جس طرح اونٹنی روتی ہے، یہاں تک کہ اسے مسجد والوں نے بھی سنا، یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم اتر کر اس کے پاس گئے، اور اسے گلے سے لگایا تو وہ چپ ہوا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "کعب بن عجرہ رضی اللہ عنہ کہتے ہیں کہ وہ مسجد میں آئے اور عبدالرحمٰن بن ام الحکم بیٹھ کر خطبہ دے رہے تھے تو انہوں نے کہا: اس شخص کو دیکھو بیٹھ کر خطبہ دے رہا ہے، حالانکہ اللہ تعالیٰ نے فرمایا ہے: «وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما» اور جب وہ کوئی سودا بکتا دیکھیں یا کوئی تماشا نظر آ جائے تو اس کی طرف دوڑ جاتے ہیں اور آپ کو کھڑا ہی چھوڑ دیتے ہیں ( الجمعہ: ۱۱ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "اوس بن اوس ثقفی رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص غسل کرائے اور خود بھی غسل کرے، اور مسجد کے لیے سویرے نکل جائے، اور امام سے قریب رہے، اور خاموشی سے خطبہ سنے، پھر کوئی لغو کام نہ کرے، تو اسے ہر قدم کے عوض ایک سال کے روزے، اور قیام کا ثواب ملے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "ابوالزاہریہ کہتے ہیں کہ میں جمعہ کے روز عبداللہ بن بسر رضی اللہ عنہ کے بغل میں بیٹھا تھا تو انہوں نے کہا: ایک آدمی لوگوں کی گردنیں پھلانگتا ہوا آیا، تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: اے فلان! بیٹھ جاؤ تم نے ( لوگوں کو ) تکلیف دی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جمعہ کے دن منبر پر تھے، ایک آدمی ( مسجد میں ) آیا تو آپ نے اس سے پوچھا: کیا تم نے دو رکعتیں پڑھ لیں؟ اس نے کہا: نہیں، تو آپ نے فرمایا: تو پڑھ لو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس شخص نے جمعہ کے دن اپنے ساتھی سے کہا: خاموش رہو اور امام خطبہ دے رہا ہو تو اس نے لغو حرکت کی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جب تم اپنے ساتھ والے سے جمعہ کے دن کہو: خاموش رہو اور امام خطبہ دے رہا ہو تو تم نے لغو کام کیا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "سلمان رضی اللہ عنہ کہتے ہیں کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو بھی آدمی پاکی حاصل کرتا ہے جیسا کہ اسے حکم دیا گیا، پھر وہ اپنے گھر سے نکلتا ہے یہاں تک کہ وہ جمعہ میں آتا ہے، اور خاموش رہتا ہے یہاں تک کہ وہ اپنی نماز ختم کر لے، تو ( اس کا یہ عمل ) اس کے ان گناہوں کے لیے کفارہ ہو گا جو اس سے پہلے کے جمعہ سے اس جمعہ تک ہوئے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ہمیں خطبہ حاجة ۱؎ سکھایا، اور وہ یہ ہے: «الحمد لله نستعينه ونستغفره ونعوذ باللہ من شرور أنفسنا وسيئات أعمالنا من يهده اللہ فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا اللہ وأشهد أن محمدا عبده ورسوله» تمام تعریفیں اللہ کے لیے ہیں، ہم اسی سے مدد اور گناہوں کی بخشش چاہتے ہیں، اور ہم اپنے نفسوں کی شر انگیزیوں اور اپنے اعمال کی برائیوں سے اللہ تعالیٰ کی پناہ چاہتے ہیں، جسے اللہ تعالیٰ ہدایت دیدے اسے کوئی گمراہ نہیں کر سکتا، اور جسے وہ گمراہ کر دے اسے کوئی ہدایت نہیں دے سکتا، اور میں گواہی دیتا ہوں کہ نہیں ہے کوئی حقیقی معبود سوائے اللہ کے، اور میں گواہی دیتا ہوں کہ محمد اس کے بندے اور رسول ہیں ، پھر آپ یہ تین آیتیں پڑھتے: «يا أيها الذين آمنوا اتقوا اللہ حق تقاته ولا تموتن إلا وأنتم مسلمون» اے ایمان والو! اللہ تعالیٰ سے اتنا ڈرو جتنا کہ اس سے ڈرنا چاہیئے، اور دیکھو مرتے دم تک مسلمان ہی رہنا ( آل عمران: ۱۰۲ ) ۔ «يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا اللہ الذي تساءلون به والأرحام إن اللہ كان عليكم رقيبا‏» اے لوگو! اپنے رب سے ڈرو جس نے تمہیں ایک جان سے پیدا کیا، اور اسی سے اس کا جوڑا پیدا کیا، اور ان دونوں سے بہت سے مرد اور عورتیں پھیلا دیں، اور اس اللہ سے ڈرو جس کے نام پر تم ایک دوسرے سے مانگتے ہو، اور رشتے ناطے توڑنے سے بھی بچو، بیشک اللہ تعالیٰ تم پر نگہبان ہے ( الاحزاب: ۷۰ ) «يا أيها الذين آمنوا اتقوا اللہ وقولوا قولا سديدا» اے ایمان والو! اللہ سے ڈرو اور صحیح و درست بات کہو ( النساء: ۱ ) ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: ابوعبیدہ نے اپنے والد عبداللہ بن مسعود رضی اللہ عنہ سے نہیں سنا ہے، نہ ہی عبدالرحمٰن بن عبداللہ ابن مسعود نے، اور نہ ہی عبدالجبار بن وائل بن حجر نے، ( یعنی ان تینوں کا اپنے والد سے سماع نہیں ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے خطبہ دیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی جمعہ کے لیے جائے تو اسے چاہیئے کہ غسل کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "ابراہیم بن نشیط سے روایت ہے کہ انہوں نے ابن شہاب زہری سے جمعہ کے دن کے غسل کے بارے میں سوال کیا تو انہوں نے کہا: سنت ہے، اور اسے مجھ سے سالم بن عبداللہ نے بیان کیا ہے، اور انہوں نے اپنے والد ( عبداللہ بن عمر رضی اللہ عنہم ) سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے منبر پر بیان کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے منبر پر کھڑے کھڑے فرمایا: جو شخص تم میں سے جمعہ کے لیے آئے تو چاہیئے کہ وہ غسل کر لے ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: میں کسی کو نہیں جانتا جس نے اس سند پر لیث کی متابعت کی ہو سوائے ابن جریج کے، اور زہری کے دیگر تلامذہ «عن عبداللہ بن عبداللہ بن عمر» کے بدلے «سالم بن عبداللہ عن أبيه» کہتے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ جمعہ کے دن جب نبی اکرم صلی اللہ علیہ وسلم خطبہ دے رہے تھے، تو ایک آدمی خستہ حالت میں ( مسجد میں ) آیا اس سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا تم نے نماز پڑھی؟ اس نے عرض کیا: نہیں، آپ نے فرمایا: دو رکعتیں پڑھ لو ، اور آپ نے ( دوران خطبہ ) لوگوں کو صدقہ پر ابھارا، لوگوں نے صدقہ میں کپڑے دیئے، تو آپ صلی اللہ علیہ وسلم نے ان میں سے دو کپڑے اس شخص کو دیے، پھر جب دوسرا جمعہ آیا تو وہ شخص پھر آیا، اس وقت بھی رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے، آپ نے لوگوں کو پھر صدقہ پر ابھارا، تو اس شخص نے بھی اپنے کپڑوں میں سے ایک کپڑا ڈال دیا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ شخص ( پچھلے ) جمعہ کو بڑی خستہ حالت میں آیا، تو میں نے لوگوں کو صدقے پر ابھارا، تو انہوں نے صدقے میں کپڑے دیئے، میں نے اس میں سے دو کپڑے اس شخص کو دینے کا حکم دیا، اب وہ پھر آیا تو میں نے پھر لوگوں کو صدقے کا حکم دیا تو اس نے بھی اپنے دو کپڑوں میں سے ایک کپڑا صدقہ میں دے دیا ، پھر آپ نے اسے ڈانٹا اور فرمایا: اپنا کپڑا اٹھا لو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ جمعہ کے دن نبی اکرم صلی اللہ علیہ وسلم خطبہ دے رہے تھے کہ اسی دوران ایک آدمی آیا ۱؎ ( اور بیٹھ گیا ) تو آپ صلی اللہ علیہ وسلم نے اس سے کہا: تم نے سنت پڑھ لی؟ ، اس نے کہا: نہیں، آپ نے فرمایا: کھڑے ہو جاؤ اور ( سنت ) پڑھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر دیکھا، حسن رضی اللہ عنہ آپ کے ساتھ تھے، آپ کبھی لوگوں کی طرف متوجہ ہوتے، تو کبھی ان کی طرف، اور آپ فرما رہے تھے: میرا یہ بچہ سردار ہے، اور شاید اللہ تعالیٰ اس کے ذریعہ سے مسلمانوں کے دو بڑے گروہوں میں صلح کرا دے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "حارثہ بن نعمان رضی اللہ عنہ کی بیٹی (ام ہشام) کہتی ہیں کہ میں نے «ق والقرآن المجيد» کو جمعہ کے دن منبر پر رسول اللہ صلی اللہ علیہ وسلم کے منہ سے سن سن کر یاد کیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "حصین سے روایت ہے کہ بشر بن مروان نے جمعہ کے دن منبر پر ( خطبہ دیتے ہوئے ) اپنے دونوں ہاتھوں کو اٹھایا، تو اس پر عمارہ بن رویبہ ثقفی رضی اللہ عنہ نے انہیں برا بھلا کہا، اور کہا: رسول اللہ صلی اللہ علیہ وسلم نے اس سے زیادہ نہیں کیا، اور انہوں نے اپنی شہادت کی انگلی سے اشارہ کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم خطبہ دے رہے تھے اتنے میں حسن اور حسین رضی اللہ عنہم لال رنگ کی قمیص پہنے گرتے پڑتے آئے، آپ صلی اللہ علیہ وسلم ( منبر سے ) اتر پڑے، اور اپنی بات بیچ ہی میں کاٹ دی، اور ان دونوں کو گود میں اٹھا لیا، پھر منبر پر واپس آ گئے، پھر فرمایا: اللہ تعالیٰ نے سچ کہا ہے «إنما أموالكم وأولادكم فتنة» تمہارے مال اور اولاد فتنہ ہیں میں نے ان دونوں کو ان کی قمیصوں میں گرتے پڑتے آتے دیکھا تو میں صبر نہ کر سکا یہاں تک کہ میں نے اپنی گفتگو بیچ ہی میں کاٹ دی، اور ان دونوں کو اٹھا لیا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "عبداللہ بن ابی اوفی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ذکرو اذکار زیادہ کرتے، لایعنی باتوں سے گریز کرتے، نماز لمبی پڑھتے، اور خطبہ مختصر دیتے تھے، اور بیواؤں اور مسکینوں کے ساتھ جانے میں کہ ان کی ضرورت پوری کریں، عار محسوس نہیں کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کی ہم نشینی کی، تو میں نے آپ کو کھڑے ہو کر ہی خطبہ دیتے دیکھا، آپ بیچ میں بیٹھتے، پھر کھڑے ہوتے، اور دوسرا خطبہ دیتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہو کر دو خطبے دیتے تھے، ان دونوں کے بیچ میں بیٹھ کر فصل کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو جمعہ کے دن کھڑے ہو کر خطبہ دیتے دیکھا، پھر آپ کچھ دیر چپ چاپ بیٹھتے پھر کھڑے ہوتے اور دوسرا خطبہ دیتے، جو تم سے بیان کرے کہ رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر خطبہ دیتے تھے تو وہ غلط گو جھوٹا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "جابر بن سمرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کھڑے ہو کر خطبہ دیتے تھے، پھر آپ بیچ میں بیٹھتے، پھر کھڑے ہوتے، اور کچھ آیتیں پڑھتے، اور اللہ تعالیٰ کا ذکر کرتے ۱؎ اور آپ کا خطبہ درمیانی ہوتا تھا، اور نماز بھی درمیانی ہوتی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم منبر سے اترتے پھر کوئی آدمی آپ کے سامنے آ جاتا تو آپ اس سے گفتگو کرتے، اور نبی اکرم صلی اللہ علیہ وسلم اس کے ساتھ کھڑے رہتے جب تک کہ وہ اپنی ضرورت پوری نہ کر لیتا یعنی اپنی بات ختم نہ کر لیتا، پھر آپ اپنی جائے نماز کی طرف بڑھتے، اور نماز پڑھاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "عبدالرحمٰن بن ابی لیلیٰ کہتے ہیں کہ عمر رضی اللہ عنہ نے کہا کہ جمعہ کی نماز، عید الفطر کی نماز، اور عید الاضحی کی نماز، اور سفر کی نماز، دو دو رکعتیں ہیں، اور یہ بزبان محمد صلی اللہ علیہ وسلم پوری ہیں، ان میں کوئی کمی نہیں ہے۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں کہ عبدالرحمٰن بن ابی لیلیٰ نے عمر رضی اللہ عنہ سے نہیں سنا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے روز نماز فجر میں «‏الم * تنزيل» اور «هل أتى على الإنسان»پڑھتے، اور جمعہ کی صلاۃ میں سورۃ جمعہ اور سورۃ منافقون پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "سمرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ میں «سبح اسم ربك الأعلى» اور «هل أتاك حديث الغاشية» پڑھتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "عبیداللہ بن عبداللہ سے روایت ہے کہ ضحاک بن قیس نے نعمان بن بشیر رضی اللہ عنہم سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم جمعہ کے دن سورۃ الجمعہ کے بعد کون سی سورۃ پڑھتے تھے؟ تو انہوں نے کہا: آپ «‏هل أتاك حديث الغاشية‏» پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "حبیب بن سالم نعمان بن بشیر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ میں «سبح اسم ربك الأعلى» اور «‏هل أتاك حديث الغاشية‏» پڑھتے تھے اور جب کبھی عید اور جمعہ دونوں جمع ہو جاتے تو ان دونوں میں بھی آپ انہی دونوں سورتوں کو پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے جمعہ کی نماز میں سے ایک رکعت پا لی تو اس نے ( جمعہ کی نماز ) پا لی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی جمعہ پڑھے تو اسے چاہیئے کہ اس کے بعد چار رکعتیں پڑھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے بعد نماز نہیں پڑھتے تھے یہاں تک کہ گھر لوٹ آتے، پھر دو رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جمعہ کے بعد دو رکعت اپنے گھر میں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ وہ جمعہ کے بعد دو رکعتیں پڑھتے تھے، اور ان کو لمبی کرتے تھے اور کہتے: رسول اللہ صلی اللہ علیہ وسلم ایسا ہی کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں طور پہاڑی پر آیا تو وہاں مجھے کعب ( کعب احبار ) رضی اللہ عنہ ملے تو میں اور وہ دونوں ایک دن تک ساتھ رہے، میں ان سے رسول اللہ صلی اللہ علیہ وسلم کی حدیثیں بیان کرتا تھا، اور وہ مجھ سے تورات کی باتیں بیان کرتے تھے، میں نے ان سے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: بہترین دن جس میں سورج نکلا جمعہ کا دن ہے، اسی میں آدم پیدا کئے گئے، اسی میں ( دنیا میں ) اتارے گئے، اسی میں ان کی توبہ قبول کی گئی، اسی میں ان کی روح نکالی گئی، اور اسی دن قیامت قائم ہو گی، زمین پر رہنے والی کوئی مخلوق ایسی نہیں ہے جو جمعہ کے دن قیامت کے ڈر سے صبح کو سورج نکلنے تک کان نہ لگائے رہے، سوائے ابن آدم کے، اور اس دن میں ایک گھڑی ایسی ہے کہ کسی مومن کو یہ گھڑی مل جائے اور نماز کی حالت میں ہو اور وہ اللہ سے اس ساعت میں کچھ مانگے تو وہ اسے ضرور دے گا ، کعب نے کہا: یہ ہر سال میں ایک دن ہے، میں نے کہا: نہیں، بلکہ یہ گھڑی ہر جمعہ میں ہوتی ہے، تو کعب نے تورات پڑھ کر دیکھا تو کہنے لگے: رسول اللہ صلی اللہ علیہ وسلم نے سچ فرمایا ہے، یہ ہر جمعہ میں ہے۔ پھر میں ( وہاں سے ) نکلا، تو میری ملاقات بصرہ بن ابی بصرہ غفاری رضی اللہ عنہ سے ہوئی، تو انہوں نے پوچھا: آپ کہاں سے آ رہے ہیں؟ میں نے کہا: طور سے، انہوں نے کہا: کاش کہ میں آپ سے وہاں جانے سے پہلے ملا ہوتا، تو آپ وہاں نہ جاتے، میں نے ان سے کہا: کیوں؟ میں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا، آپ فرما رہے تھے: سواریاں استعمال نہ کی جائیں یعنی سفر نہ کیا جائے مگر تین مسجدوں کی طرف: ایک مسجد الحرام کی طرف، دوسری میری مسجد یعنی مسجد نبوی کی طرف، اور تیسری مسجد بیت المقدس ۱؎ کی طرف۔ پھر میں عبداللہ بن سلام رضی اللہ عنہ سے ملا تو میں نے کہا: کاش آپ نے مجھے دیکھا ہوتا، میں طور گیا تو میری ملاقات کعب سے ہوئی، پھر میں اور وہ دونوں پورے دن ساتھ رہے، میں ان سے رسول اللہ صلی اللہ علیہ وسلم کی حدیثیں بیان کرتا تھا، اور وہ مجھ سے تورات کی باتیں بیان کرتے تھے، میں نے ان سے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: دنوں میں بہترین دن جمعہ کا دن ہے جس میں سورج نکلا، اسی میں آدم پیدا کئے گئے، اسی میں دنیا میں اتارے گئے، اسی میں ان کی توبہ قبول ہوئی، اسی میں ان کی روح نکالی گئی، اور اسی میں قیامت قائم ہو گی، زمین پر کوئی ایسی مخلوق نہیں ہے جو قیامت کے ڈر سے جمعہ کے دن صبح سے سورج نکلنے تک کان نہ لگائے رہے سوائے ابن آدم کے، اور اس دن میں ایک گھڑی ایسی ہے کہ جس مسلمان کو وہ گھڑی نماز کی حالت میں مل جائے، اور وہ اللہ سے کچھ مانگے تو اللہ تعالیٰ اس کو وہ چیز ضرور دے گا، اس پر کعب نے کہا: ایسا دن ہر سال میں ایک ہے، تو عبداللہ بن سلام رضی اللہ عنہ نے کہا: کعب نے غلط کہا، میں نے کہا: پھر کعب نے ( تورات ) پڑھی اور کہا: رسول اللہ صلی اللہ علیہ وسلم نے سچ فرمایا ہے، وہ ہر جمعہ میں ہے، تو عبداللہ بن سلام رضی اللہ عنہ نے کہا: کعب نے سچ کہا، پھر انہوں نے کہا: میں اس گھڑی کو جانتا ہوں، تو میں نے کہا: اے بھائی! مجھے وہ گھڑی بتا دیں، انہوں نے کہا: وہ گھڑی جمعہ کے دن سورج ڈوبنے سے پہلے کی آخری گھڑی ہے، تو میں نے کہا: کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ نہیں سنا کہ آپ نے فرمایا: جو مومن اس گھڑی کو پائے اور وہ نماز میں ہو جبکہ اس گھڑی میں کوئی نماز نہیں ہے، تو انہوں نے کہا: کیا آپ نے نہیں سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: جو شخص نماز پڑھے پھر بیٹھ کر دوسری نماز کا انتظار کرتا رہے، تو وہ نماز ہی میں ہوتا ہے ، میں نے کہا: کیوں نہیں سنا ہے؟ اس پر انہوں نے کہا: تو وہ اسی طرح ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جمعہ میں ایک گھڑی ایسی ہے کہ اگر کوئی مسلمان بندہ اس گھڑی کو پا لے، اور اس میں اللہ تعالیٰ سے کچھ مانگے تو اللہ تعالیٰ اس کو ضرور دے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ابوالقاسم صلی اللہ علیہ وسلم نے فرمایا: جمعہ والے دن ایک گھڑی ایسی ہے کہ کوئی مسلمان بندہ اسے نماز میں کھڑا پا لے، پھر اللہ تعالیٰ سے کچھ مانگے، تو اللہ تعالیٰ اسے ضرور دے گا ، اور آپ اسے ہاتھ کے اشارے سے کم کر کے بتا رہے تھے۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: ہم کسی کون ہیں جانتے جس نے اس حدیث کو عن معمر، عن الزهري، عن سعيد ( المقبري ) کے طریق سے روایت کیا ہو، سوائے رباح کے، البتہ ایوب بن سوید نے اس کو عن يونس، عن الزهري، عن سعيد وأبي سلمة کے طریق سے روایت کیا ہے، لیکن ایوب بن سوید متروک الحدیث ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 69
			}
		}
	]
}