{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"16": "The Book of Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، ان دونوں کو کسی کے مرنے اور کسی کے پیدا ہونے سے گرہن نہیں لگتا، بلکہ اللہ تعالیٰ ان کے ذریعہ اپنے بندوں کو ڈراتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "عبدالرحمٰن بن سمرہ رضی اللہ عنہ کہتے ہیں کہ میں مدینہ میں تیر اندازی میں مشغول تھا، اتنے میں سورج کو گرہن لگ گیا، میں نے اپنے تیروں کو سمیٹا اور دل میں ارادہ کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے سورج گرہن کے موقع پر کیا نئی بات کی ہے، اسے چل کر ضرور دیکھوں گا، میں آپ کے پیچھے کی جانب سے آپ کے پاس آیا، آپ مسجد میں تھے، تسبیح و تکبیر اور دعا میں لگے رہے، یہاں تک کہ سورج صاف ہو گیا، پھر آپ کھڑے ہوئے، اور دو رکعت نماز پڑھی، اور چار سجدے کیے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سورج اور چاند گرہن کسی کے مرنے اور کسی کے پیدا ہونے سے نہیں لگتا ہے، بلکہ یہ اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، تو جب تم انہیں دیکھو تو نماز پڑھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "ابومسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سورج گرہن اور چاند گرہن کسی کے مرنے سے نہیں لگتا، بلکہ یہ اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، جب تم انہیں دیکھو تو نماز پڑھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، ان دونوں کو نہ تو کسی کے مرنے سے گرہن لگتا ہے نہ کسی کے پیدا ہونے سے، جب تم ان دونوں کو گرہن لگا ہوا دیکھو تو نماز پڑھو یہاں تک کہ یہ صاف ہو جائیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ ہم لوگ نبی اکرم صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے کہ سورج کو گرہن لگ گیا، تو آپ اپنا کپڑا گھسیٹتے ہوئے جلدی سے اٹھے، اور دو رکعت نماز پڑھی یہاں تک کہ وہ چھٹ گیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو نبی آپ صلی اللہ علیہ وسلم نے ایک منادی کو حکم دیا، تو اس نے ندا دی کہ نماز کے لیے جمع ہو جاؤ، تو سب جمع ہو گئے، اور انہوں نے صف بندی کی تو آپ نے انہیں چار رکوع، اور چار سجدوں کے ساتھ، دو رکعت نماز پڑھائی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم مسجد کی طرف نکلے، اور نماز کے لیے کھڑے ہوئے، آپ نے اللہ اکبر ، کہا اور لوگوں نے آپ کے پیچھے صف بندی کی، پھر آپ نے چار رکوع اور چار سجدے مکمل کئے، سورج آپ کے فارغ ہونے سے پہلے ہی صاف ہو گیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے سورج گرہن لگنے پر آٹھ رکوع، اور چار سجدوں کے ساتھ نماز پڑھی اور عطاء نے بھی ابن عباس رضی اللہ عنہم سے اسی کے مثل روایت کی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے گرہن لگنے پر نماز پڑھی، آپ نے قرآت کی، پھر رکوع کیا، پھر قرآت کی، پھر رکوع کیا، پھر قرآت کی، پھر رکوع کیا، پھر قرآت کی، پھر رکوع کیا، پھر سجدہ کیا، اور دوسری رکعت بھی ایسے ہی پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جس دن سورج گرہن لگا، دو رکعت نماز پڑھی، تو چار رکوع اور چار سجدے کیے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "عبید بن عمیر کہتے ہیں کہ مجھ سے اس شخص نے بیان کیا ہے جسے میں سچا سمجھتا ہوں، میرا گمان ہے کہ ان کی مراد ام المؤمنین عائشہ رضی اللہ عنہا تھیں، وہ کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا، تو آپ نے لوگوں کے ساتھ بڑی دیر تک نماز میں قیام کیا، آپ لوگوں کے ساتھ قیام کرتے، پھر رکوع کرتے، پھر قیام کرتے، پھر رکوع کرتے، پھر قیام کرتے پھر رکوع کرتے، اس طرح آپ نے دو رکعت پڑھی، ہر رکعت میں آپ نے تین رکوع کیا، تیسرے رکوع سے اٹھنے کے بعد آپ نے سجدہ کیا یہاں تک کہ اس دن آدمیوں پر غشی طاری ہو گئی تھی جس کی وجہ سے ان کے اوپر پانی کے ڈول انڈیلنے پڑ گئے تھے، آپ جب رکوع کرتے تو «اللہ اکبر» کہتے، اور جب سر اٹھاتے تو «سمع اللہ لمن حمده» کہتے، آپ فارغ نہیں ہوئے جب تک کہ سورج صاف نہیں ہو گیا، پھر آپ کھڑے ہوئے، اور آپ نے اللہ کی حمد و ثنا بیان کی، اور فرمایا: سورج اور چاند کو نہ تو کسی کے مرنے سے گرہن لگتا ہے، اور نہ ہی کسی کے پیدا ہونے سے، لیکن یہ دونوں اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں جن کے ذریعہ وہ تمہیں ڈراتا ہے، تو جب ان میں گرہن لگے تو اللہ تعالیٰ کے ذکر کی طرف دوڑ پڑو، اور ذکر الٰہی میں لگے رہو جب تک کہ وہ صاف نہ ہو جائیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے چار سجدوں میں چھ رکوع کئے۔ اسحاق بن ابراہیم کہتے ہیں میں نے معاذ بن ہشام سے پوچھا: نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے نا، انہوں نے کہا: اس میں کوئی شک و شبہ نہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی زندگی میں سورج گرہن لگا تو آپ ( نماز کے لیے ) کھڑے ہوئے، اور تکبیر کہی، اور لوگوں نے آپ کے پیچھے صفیں باندھیں، پھر رسول اللہ صلی اللہ علیہ وسلم نے بڑی لمبی قرآت کی، پھر «اللہ اکبر» کہا، اور ایک لمبا رکوع کیا، پھر اپنا سر اٹھایا، تو«سمع اللہ لمن حمده ربنا لك الحمد» کہا، پھر آپ کھڑے رہے، اور ایک لمبی قرآت کی مگر پہلی قرآت سے کم، پھر تکبیر کہی، اور ایک لمبا رکوع کیا، مگر پہلے رکوع سے چھوٹا، پھر آپ نے «سمع اللہ لمن حمده ربنا لك الحمد» کہا، پھر سجدہ کیا، پھر دوسری رکعت میں بھی آپ نے اسی طرح کیا، اس طرح آپ نے چار رکوع اور چار سجدے پورے کیے، آپ کے نماز سے فارغ ہونے سے پہلے ہی سورج صاف ہو گیا، پھر آپ نے کھڑے ہو کر لوگوں کو خطاب کیا، تو اللہ تعالیٰ کی ثنا بیان کی جو اس کے شایان شان تھی، پھر فرمایا: بلاشبہ سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، انہیں نہ کسی کے مرنے سے گرہن لگتا ہے، نہ کسی کے پیدا ہونے سے، جب تم انہیں دیکھو تو نماز پڑھو، جب تک کہ وہ تم سے چھٹ نہ جائے، نیز رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں نے اپنے اس کھڑے ہونے کی جگہ میں ہر وہ چیز دیکھ لی جس کا تم سے وعدہ کیا گیا ہے، تم نے مجھے آگے بڑھتے ہوئے دیکھا، میں نے چاہا کہ جنت کے پھلوں میں سے ایک گچھا توڑ لوں، جب تم نے مجھے دیکھا میں آگے بڑھا تھا، اور میں نے جہنم کو دیکھا، اس حال میں کہ اس کا ایک حصہ دوسرے کو توڑ رہا تھا جب تم نے مجھے پیچھے ہٹتے ہوئے دیکھا، اور میں نے اس میں ابن لحی کو دیکھا ۱؎، یہی ہے جس نے سب سے پہلے سائبہ چھوڑا ۲؎ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو «الصلاة جامعة» ( صلاۃ باجماعت ہو گی ) کی منادی کرائی گئی، چنانچہ لوگ اکٹھا ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نے ان کے ساتھ دو رکعت میں چار رکوع اور چار سجدے کئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو نماز پڑھائی، آپ نے لمبا قیام کیا، پھر لمبا رکوع کیا، پھر لمبا قیام کیا، اور یہ پہلے قیام سے کم تھا، پھر لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے رکوع سے سر اٹھایا، اور سجدہ کیا، پھر آپ نے دوسری رکعت میں بھی اسی طرح کیا، پھر آپ فارغ ہوئے اس حال میں کہ سورج صاف ہو چکا تھا، تو آپ نے لوگوں کو خطاب کیا، پہلے آپ نے اللہ کی حمد و ثنا کی، پھر فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، ان دونوں کو نہ کسی کے مرنے سے گرہن لگتا ہے، اور نہ ہی کسی کے جینے سے، تو جب تم اسے دیکھو تو اللہ تعالیٰ سے دعا کرو، اور اس کی بڑائی بیان کرو، اور صدقہ کرو ، پھر آپ نے فرمایا: اے امت محمد! اللہ تعالیٰ سے زیادہ کوئی اس بات پر غیرت کرنے والا نہیں کہ اس کا غلام یا لونڈی زنا کرے، اے امت محمد! قسم اللہ کی، اگر تم وہ جانتے جو میں جانتا ہوں، تو تم ہنستے کم اور روتے زیادہ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ایک یہودی عورت ان کے پاس آئی، اور کہنے لگی: اللہ تعالیٰ تمہیں قبر کے عذاب سے بچائے، یہ سنا تو عائشہ نے پوچھا: اللہ کے رسول! لوگوں کو قبر میں بھی عذاب دیا جائے گا؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ کی پناہ ۔ نبی اکرم صلی اللہ علیہ وسلم کہیں جانے کے لیے نکلے اتنے میں سورج گرہن لگ گیا، تو ہم حجرہ میں چلے گئے، یہ دیکھ کر دوسری عورتیں بھی ہمارے پاس جمع ہو گئیں، اور رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے اور یہ چاشت کا وقت تھا، آپ نماز کے لیے کھڑے ہوئے، آپ نے نماز میں لمبا قیام کیا، پھر لمبا رکوع کیا، پھر رکوع سے سر اٹھایا، تو قیام کیا پہلے قیام سے کم، پھر آپ نے رکوع کیا، اپنے پہلے رکوع سے کم، پھر سجدہ کیا، پھر آپ دوسری رکعت کے لیے کھڑے ہوئے، تو اسی طرح کیا مگر دوسری رکعت میں آپ کا رکوع اور قیام پہلی رکعت سے کم تھا، پھر آپ نے سجدہ کیا، اور سورج صاف ہو گیا، تو جب آپ فارغ ہوئے، تو منبر پر بیٹھے، اور جو باتیں کہنی تھیں کہیں، اس میں ایک بات یہ بھی تھی: کہ لوگ اپنی قبروں میں آزمائے جائیں گے، جیسے دجال کے فتنے میں آزمائے جائیں گے ، ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں: اس کے بعد سے برابر ہم آپ کو قبر کے عذاب سے پناہ مانگتے ہوئے سنتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ایک یہودی عورت مجھ سے کچھ پوچھنے آئی تو اس نے کہا: اللہ تعالیٰ تمہیں قبر کے عذاب سے بچائے، تو جب رسول اللہ صلی اللہ علیہ وسلم آئے تو میں نے پوچھا: اللہ کے رسول! کیا لوگ قبروں میں بھی عذاب دیئے جاتے ہیں؟ آپ نے فرمایا: اللہ کی پناہ ، پھر آپ ( کہیں جانے کے لیے ) سواری پر سوار ہوئے کہ ادھر سورج گرہن لگ گیا، اور میں دوسری عورتوں کے ساتھ حجروں کے درمیان بیٹھی تھی کہ رسول اللہ صلی اللہ علیہ وسلم اپنی سواری سے اتر کر آئے، اور اپنے مصلیٰ کی طرف بڑھے، آپ نے لوگوں کو نماز پڑھائی تو لمبا قیام کیا، پھر لمبا رکوع کیا، پھر آپ نے اپنا سر اٹھایا تو لمبا قیام کیا، پھر لمبا رکوع کیا، پھر آپ نے اپنا سر اٹھایا تو لمبا قیام کیا، پھر آپ نے سجدہ کیا تو لمبا سجدہ کیا، پھر آپ ( سجدہ سے کھڑے ہوئے ) اور آپ نے قیام کیا، مگر اپنے پہلے قیام سے کم، پھر رکوع کیا، اپنے پہلے رکوع سے کم، پھر اپنا سر اٹھایا تو قیام کیا اپنے پہلے قیام سے کم، تو یہ چار رکوع اور چار سجدے ہوئے، اور سورج صاف ہو گیا، تو آپ نے فرمایا: تم قبروں میں آزمائے جاؤ گے اسی طرح جس طرح دجال کے فتنے سے آزمائے جاؤ گے ۔ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں: اس کے بعد سے میں نے برابر آپ کو قبر کے عذاب سے پناہ مانگتے ہوئے سنا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے کسوف کی نماز میں زمزم کے چبوترے پر چار چار رکوع اور چار چار سجدے کئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک انتہائی گرم دن میں سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم نے اپنے صحابہ کو نماز پڑھائی، اور لمبا قیام کیا یہاں تک کہ لوگ ( بیہوش ہو ہو کر ) گرنے لگے، پھر آپ نے لمبا رکوع کیا، پھر آپ رکوع سے اٹھے تو آپ نے لمبا قیام کیا، پھر آپ نے لمبا رکوع کیا، پھر آپ رکوع سے اٹھے تو لمبا قیام کیا، پھر دو سجدے کیے، پھر آپ کھڑے ہوئے تو آپ نے پھر اسی طرح کیا، نیز آپ آگے بڑھے پھر پیچھے ہٹنے لگے، تو یہ چار رکوع اور چار سجدے ہوئے، لوگ کہتے تھے کہ سورج اور چاند گرہن ان کے بڑے آدمیوں میں سے کسی بڑے آدمی کی موت کی وجہ سے لگتا ہے، حالانکہ یہ دونوں اللہ کی نشانیوں میں سے دو نشانیاں ہیں جنہیں اللہ تمہیں دکھاتا ہے، تو جب گرہن لگے تو نماز پڑھو جب تک کہ وہ چھٹ نہ جائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا، تو آپ نے ( نماز کا ) حکم دیا تو «الصلاة جامعة» ( نماز باجماعت پڑھی جائے گی ) کی منادی کرائی گئی، تو رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو نماز پڑھائی ( پہلی رکعت میں ) آپ نے دو رکوع اور ایک سجدہ کیا ۱؎، پھر آپ کھڑے ہوئے، پھر آپ نے ( دوسری رکعت میں بھی ) دو رکوع اور ایک سجدہ کیا۔ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں: میں نے کبھی اتنا لمبا رکوع نہیں کیا، اور نہ ہی کبھی اتنا لمبا سجدہ کیا۔ محمد بن حمیر نے مروان کی مخالفت کی ہے ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم کہتے ہیں کہ سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم نے دو رکوع کیے، اور دو سجدے کیے، پھر آپ کھڑے ہوئے، اور دو رکوع اور دو سجدے کیے، پھر سورج سے گرہن چھٹ گیا۔ ام المؤمنین عائشہ رضی اللہ عنہا کہتی تھیں: رسول اللہ صلی اللہ علیہ وسلم نے کوئی سجدہ اور کوئی رکوع ان سے لمبا نہیں کیا۔ علی بن مبارک نے معاویہ بن سلام کی مخالفت کی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو آپ نے وضو کیا، اور حکم دیا تو ندا دی گئی: «الصلاة جامعة» ( نماز باجماعت ہو گی ) ، پھر آپ ( نماز کے لیے ) کھڑے ہوئے، تو آپ نے لمبا قیام کیا، عائشہ رضی اللہ عنہا کہتی ہیں: تو مجھے گمان ہوا کہ آپ نے سورۃ البقرہ پڑھی، پھر آپ نے لمبا رکوع کیا، پھر آپ نے: «سمع اللہ لمن حمده» کہا، پھر آپ نے اسی طرح قیام کیا جیسے پہلے کیا تھا، اور سجدہ نہیں کیا، پھر آپ نے رکوع کیا پھر سجدہ کیا، پھر آپ کھڑے ہوئے اور آپ نے پہلے ہی کی طرح دو رکوع اور ایک سجدہ کیا، پھر آپ بیٹھے، تب سورج سے گرہن چھٹ چکا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم نماز کے لیے کھڑے ہوئے، اور وہ لوگ بھی کھڑے ہوئے جو آپ کے ساتھ تھے، آپ لمبا قیام کیا، پھر لمبا رکوع کیا، پھر رکوع سے اپنا سر اٹھایا، اور لمبا سجدہ کیا، پھر سجدے سے اپنا سر اٹھایا، اور بیٹھے تو دیر تک بیٹھے رہے، پھر آپ سجدہ میں گئے تو لمبا سجدہ کیا، پھر سجدے سے اپنا سر اٹھایا، اور کھڑے ہو گئے، پھر آپ نے دوسری رکعت میں بھی اسی طرح قیام، رکوع، سجدہ اور جلوس کیا جیسے پہلی رکعت میں کیا تھا، پھر دوسری رکعت کے آخری سجدے میں آپ ہانپنے اور رونے لگے، آپ کہہ رہے تھے: تو نے مجھ سے اس کا وعدہ نہیں کیا تھا ۱؎، اور حال یہ ہے کہ میں ان میں موجود ہوں، تو نے مجھ سے اس کا وعدہ نہیں کیا تھا، اور ہم تجھ سے ( اپنے گناہوں کی ) بخشش چاہتے ہیں ، پھر آپ نے اپنا سر اٹھایا تب سورج صاف ہو چکا تھا، پھر رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے، اور آپ نے لوگوں کو خطاب کیا، پہلے اللہ کی حمد و ثنا بیان کی، پھر فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، تو جب تم ان میں سے کسی کو گرہن لگا دیکھو تو اللہ تعالیٰ کے ذکر کی طرف دوڑ پڑو، قسم ہے اس ذات کی جس کے ہاتھ میں محمد کی جان ہے، جنت مجھ سے قریب کر دی گئی یہاں تک کہ اگر میں اپنے ہاتھوں کو پھیلاتا تو میں اس کے کچھ گچھے لے لیتا، اور جہنم مجھ سے قریب کر دی گئی یہاں تک کہ میں اس سے بچاؤ کرنے لگا، اس خوف سے کہ کہیں وہ تمہیں ڈھانپ نہ لے، یہاں تک کہ میں نے اس میں حمیر کی ایک عورت پر ایک بلی کی وجہ سے عذاب ہوتے ہوئے دیکھا جسے اس نے باندھ رکھا تھا، نہ تو اس نے اسے زمین کے کیڑے مکوڑے کھانے کے لیے چھوڑا، اور نہ ہی اس نے اسے خود کچھ کھلایا پلایا یہاں تک کہ وہ مر گئی، میں نے اسے دیکھا وہ اس عورت کو نوچتی تھی جب وہ سامنے آتی، اور جب وہ پیٹھ پھیر کر جاتی تو اس کے سرین کو نوچتی، نیز میں نے اس میں دو چمڑے کی جوتیوں والے کو دیکھا، جو قبیلہ بنی دعدع کا ایک فرد تھا، اسے دو منہ والی لکڑی سے مار کر آگ میں دھکیلا جا رہا تھا، نیز میں نے اس میں خمدار سر والی لکڑی چرانے والے کو دیکھا، جو حاجیوں کا مال چراتا تھا، وہ جہنم میں اپنی لکڑی پر ٹیک لگائے ہوئے کہہ رہا تھا: میں خمدار سر والی لکڑی چرانے والا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو آپ کھڑے ہوئے، اور آپ نے لوگوں کو نماز پڑھائی تو لمبا قیام کیا، پھر رکوع کیا تو لمبا رکوع کیا، پھر قیام کیا تو لمبا قیام کیا، اور یہ پہلے قیام سے کم تھا، پھر رکوع کیا تو لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے سجدہ کیا تو لمبا سجدہ کیا، پھر آپ نے سجدہ سے سر اٹھایا، پھر سجدہ کیا تو لمبا سجدہ کیا، اور یہ پہلے سجدہ سے کم تھا، پھر آپ ( دوسری رکعت کے لیے ) کھڑے ہوئے، تو آپ نے دو رکوع کیے، اور ان میں پہلے جیسا ہی کیا، پھر آپ نے دو سجدے کیے، ان دونوں میں اسی طرح کرتے رہے جیسے پہلے کیا تھا یہاں تک کہ اپنی نماز سے فارغ ہو گئے، پھر آپ نے فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، ان دونوں کو نہ کسی کے مرنے سے گرہن لگتا ہے اور نہ کسی کے پیدا ہونے سے، لہٰذا جب تم انہیں ( گرہن لگا ) دیکھو، تو تم اللہ کے ذکر اور نماز کی طرف دوڑ پڑو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "ثعلبہ بن عباد العبدی بیان کرتے ہیں کہ وہ ایک دن سمرہ بن جندب رضی اللہ عنہ کے خطبہ میں حاضر ہوئے، تو انہوں نے اپنے خطبہ میں رسول اللہ صلی اللہ علیہ وسلم سے مروی ایک حدیث ذکر کی، سمرہ بن جندب رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک دن میں اور ایک انصاری لڑکا دونوں تیر سے نشانہ بازی کر رہے تھے، یہاں تک کہ سورج دیکھنے والے کی نظر میں افق سے دو تین نیزے کے برابر اوپر آ چکا تھا کہ اچانک وہ سیاہ ہو گیا، ہم میں سے ایک نے اپنے دوسرے ساتھی سے کہا: چلو مسجد چلیں، قسم اللہ کی اس سورج کا معاملہ رسول اللہ صلی اللہ علیہ وسلم کے لیے آپ کی امت میں ضرور کوئی نیا واقعہ رونما کرے گا، پھر ہم مسجد گئے تو ہم نے رسول اللہ صلی اللہ علیہ وسلم کو ایسے وقت میں پایا جب آپ لوگوں کی طرف نکلے، پھر آپ آگے بڑھے اور آپ نے نماز پڑھائی، تو اتنا لمبا قیام کیا کہ ایسا قیام آپ نے کبھی کسی نماز میں نہیں کیا تھا، ہم آپ کی آواز سن نہیں رہے تھے، پھر آپ نے رکوع کیا تو اتنا لمبا رکوع کیا کہ ایسا رکوع آپ نے کبھی کسی نماز میں نہیں کیا تھا، ہم آپ کی آواز سن نہیں رہے تھے، پھر آپ نے ہمارے ساتھ سجدہ کیا تو اتنا لمبا سجدہ کیا کہ ایسا سجدہ آپ نے کبھی کسی نماز میں نہیں کیا تھا، ہم آپ کی آواز سن نہیں رہے تھے، پھر آپ نے ایسے ہی دوسری رکعت میں بھی کیا، دوسری رکعت میں آپ کے بیٹھنے کے ساتھ ہی سورج صاف ہو گیا، تو آپ نے سلام پھیرا، اور اللہ کی حمد اور اس کی ثنا بیان کی، اور گواہی دی کہ نہیں ہے کوئی حقیقی معبود سوائے اللہ کے، اور گواہی دی کہ آپ اللہ تعالیٰ کے بندے اور اس کے رسول ہیں، ( یہ حدیث مختصر ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "نعمان بن بشیر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج گرہن لگا تو آپ گھبرائے ہوئے اپنے کپڑے کو گھسیٹتے ہوئے باہر نکلے یہاں تک کہ آپ مسجد آئے، اور ہمیں برابر نماز پڑھاتے رہے یہاں تک کہ سورج صاف ہو گیا، جب سورج صاف ہو گیا تو آپ نے فرمایا: کچھ لوگ سمجھتے ہیں کہ سورج اور چاند گرہن کسی بڑے آدمی کے مرنے پر لگتا ہے، ایسا کچھ نہیں ہے، سورج اور چاند گرہن نہ تو کسی کے مرنے کی وجہ سے لگتا ہے اور نہ ہی کسی کے پیدا ہونے سے، بلکہ یہ دونوں اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، اللہ تعالیٰ جب اپنی کسی مخلوق کے لیے اپنی تجلی ظاہر کرتا ہے، تو وہ اس کے لیے جھک جاتی ہے، تو جب کبھی تم اس صورت حال کو دیکھو تو تم اس تازہ فرض نماز کی طرح نماز پڑھو، جو تم نے ( گرہن لگنے سے پہلے ) پڑھی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "قبیصہ بن مخارق الہلالی رضی اللہ عنہ کہتے ہیں کہ سورج گرہن لگا، ہم لوگ اس وقت رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ میں تھے، آپ گھبرائے ہوئے اپنا کپڑا گھسیٹتے ہوئے باہر نکلے، پھر آپ نے دو رکعت نماز پڑھی، اور اتنا لمبا کیا کہ آپ جب نماز سے فارغ ہوئے تو سورج چھٹ چکا تھا، آپ نے اللہ کی حمد و ثنا بیان کی، پھر آپ نے فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، ان دونوں کو نہ کسی کے مرنے سے گرہن لگتا ہے اور نہ کسی کے پیدا ہونے سے، تو جب تم اس میں سے کچھ دیکھو تو اس تازہ فرض نماز کی طرح نماز پڑھو جو تم نے ( گرہن لگنے پہلے ) پڑھی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"text": "قبیصہ الہلالی رضی اللہ عنہ سے روایت ہے کہ سورج گرہن لگا تو نبی کریم صلی اللہ علیہ وسلم نے دو دو رکعتیں پڑھیں یہاں تک کہ وہ صاف ہو گیا، پھر آپ نے فرمایا: سورج اور چاند کو کسی کے مرنے سے گرہن نہیں لگتا، بلکہ یہ دونوں اللہ تعالیٰ کی مخلوقات میں سے دو مخلوق ہیں، اور اللہ تعالیٰ اپنی مخلوق میں جو چاہتا ہے نئی بات پیدا کرتا ہے، اور اللہ تعالیٰ جب اپنی مخلوق میں سے کسی پر تجلی فرماتا ہے تو وہ اس کے لیے جھک جاتی ہے، لہٰذا جب ان دونوں میں سے کوئی رونما ہو تو تم نماز پڑھو یہاں تک کہ وہ چھٹ جائے، یا اللہ تعالیٰ کوئی نیا معاملہ ظاہر فرما دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "نعمان بن بشیر رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب سورج اور چاند کو گرہن لگے تو نماز پڑھو، اس تازہ نماز کی طرح جو تم نے ( گرہن لگنے سے پہلے ) پڑھی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": 1489,
			"text": "نعمان بن بشیر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جس وقت سورج گرہن لگا ہماری نماز کی طرح نماز پڑھی آپ رکوع کر رہے تھے اور سجدہ کر رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": 1490,
			"text": "نعمان بن بشیر رضی اللہ عنہم کہتے ہیں کہ ایک دن نبی اکرم صلی اللہ علیہ وسلم بڑی جلدی میں گھر سے مسجد کی طرف نکلے، سورج گرہن لگا تھا، آپ نے نماز پڑھی یہاں تک کہ سورج صاف ہو گیا، پھر آپ نے فرمایا: زمانہ جاہلیت کے لوگ کہا کرتے تھے کہ سورج اور چاند گرہن زمین والوں میں بڑے لوگوں میں سے کسی بڑے آدمی کے مر جانے کی وجہ سے لگتا ہے۔ حالانکہ سورج اور چاند نہ تو کسی کے مرنے پر گہناتے ہیں اور نہ ہی کسی کے پیدا ہونے پر، بلکہ یہ دونوں اللہ کی مخلوق میں سے دو مخلوق ہیں، اللہ تعالیٰ اپنی مخلوقات میں جو نیا واقعہ چاہتا ہے رونما کرتا ہے، تو ان میں سے کوئی ( بھی ) گہنائے تو تم نماز پڑھو یہاں تک کہ وہ صاف ہو جائے، یا اللہ کوئی نیا معاملہ ظاہر فرما دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": 1491,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس تھے کہ سورج گرہن لگا، رسول اللہ صلی اللہ علیہ وسلم اپنی چادر گھسیٹتے ہوئے نکلے یہاں تک کہ آپ مسجد پہنچے، اور لوگ ( بھی ) آپ کی طرف لپکے، پھر آپ نے ہمیں دو رکعت نماز پڑھائی، جب سورج صاف ہو گیا تو آپ نے فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں جن کے ذریعہ اللہ تعالیٰ اپنے بندوں کو ڈراتا ہے، اور یہ دونوں نہ تو کسی کے مرنے پر گہناتے ہیں اور نہ ہی کسی کے پیدا ہونے پر، تو جب تم انہیں گہنایا ہوا دیکھو تو نماز پڑھو یہاں تک کہ وہ چیز چھٹ جائے جو تم پر آن پڑی ہے ، اور آپ نے یہ اس لیے فرمایا کہ ( اسی روز ) آپ صلی اللہ علیہ وسلم کے صاحبزادے ابراہیم کا انتقال ہوا تھا، تو کچھ لوگوں نے آپ سے یہ بات کہی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": 1492,
			"text": "ابوبکرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے تمہاری اسی نماز کی طرح دو رکعت نماز پڑھی، اور انہوں نے سورج گرہن لگنے کا ذکر کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": 1493,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم نے اور آپ کے ساتھ لوگوں نے نماز پڑھی، آپ نے قیام کیا تو لمبا قیام کیا، اور سورۃ البقرہ جیسی سورت پڑھی، پھر آپ نے ایک لمبا رکوع کیا، پھر اپنا سر اٹھایا تو لمبا قیام کیا، اور یہ پہلے سے کم تھا، پھر آپ نے ایک لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے سجدہ کیا، پھر ایک لمبا قیام کیا، اور یہ پہلے قیام سے کم تھا، پھر آپ نے ایک لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے رکوع سے اپنا سر اٹھایا، پھر ایک لمبا قیام کیا، اور یہ پہلے قیام سے کم تھا، پھر آپ نے ایک لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے سجدہ کیا، جب آپ نماز سے فارغ ہوئے تو سورج صاف ہو چکا تھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، یہ دونوں کسی کے مرنے سے نہیں گہناتے ہیں، اور نہ کسی کے پیدا ہونے سے، چنانچہ جب تم انہیں گہنایا ہوا دیکھو تو اللہ تعالیٰ کو یاد کرو ، لوگوں نے آپ سے عرض کیا: اللہ کے رسول! ہم نے آپ کو دیکھا کہ آپ اپنی جگہ میں کسی چیز کو آگے بڑھ کر لے رہے تھے، اور پھر ہم نے دیکھا آپ پیچھے ہٹ رہے تھے؟ تو آپ نے فرمایا: میں نے جنت کو دیکھا یا مجھے جنت دکھائی گئی تو میں اس میں سے پھل کا ایک گچھا لینے کے لیے آگے بڑھا، اور اگر میں اسے لے لیتا تو تم اس سے رہتی دنیا تک کھاتے، اور میں نے جہنم کو دیکھا چنانچہ میں نے آج سے پہلے اس بھیانک منظر کی طرح کبھی نہیں دیکھا تھا، اور میں نے اہل جہنم میں زیادہ تر عورتوں کو دیکھا ، انہوں نے پوچھا: اللہ کے رسول! ایسا کیوں ہے؟ تو آپ نے فرمایا: ایسا ان کے کفر کی وجہ سے ہے ، پوچھا گیا: کیا وہ اللہ کے ساتھ کفر کرتی ہیں؟ آپ نے فرمایا: ( نہیں بلکہ ) وہ شوہر کے ساتھ کفر کرتی ہیں ( یعنی اس کی ناشکری کرتی ہیں ) اور ( اس کے ) احسان کا انکار کرتی ہیں، اگر تم ان میں سے کسی کے ساتھ زمانہ بھر احسان کرو، پھر اگر وہ تم سے کوئی چیز دیکھے تو وہ کہے گی: میں نے تم سے کبھی بھی کوئی بھلائی نہیں دیکھی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": 1494,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے چار رکوع اور چار سجدوں کے ساتھ ( گرہن کی ) نماز پڑھی، آپ نے ان میں بلند آواز سے قرآت کی، آپ جب جب رکوع سے سر اٹھاتے تو «سمع اللہ لمن حمده، ربنا ولك الحمد» کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے سورج گرہن کی نماز پڑھائی ( وہ کہتے ہیں ) کہ ہم آپ کی آواز نہیں سن رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": 1496,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد میں سورج گرہن لگا، تو آپ نے نماز پڑھی، تو لمبا قیام کیا، پھر آپ نے رکوع کیا تو لمبا رکوع کیا، پھر ( رکوع سے ) سر اٹھایا تو دیر تک کھڑے رہے ( شعبہ کہتے ہیں: میرا گمان ہے عطاء نے سجدے کے سلسلہ میں بھی یہی بات کہی ہے ) اور آپ سجدے میں رونے اور پھونک مارنے لگے، آپ فرما رہے تھے: میرے رب! تو نے مجھ سے اس کا وعدہ نہیں کیا تھا، میں تجھ سے پناہ طلب کرتا ہوں، تو نے مجھ سے اس کا وعدہ نہیں کیا تھا اور حال یہ ہے کہ میں لوگوں میں موجود ہوں ، جب آپ نماز پڑھ چکے تو فرمایا: مجھ پر جنت پیش کی گئی یہاں تک کہ اگر میں اپنے ہاتھوں کو پھیلاتا تو میں اس کے پھلوں گچھوں میں سے توڑ لیتا، نیز مجھ پر جہنم پیش کی گئی تو میں پھونکنے لگا اس ڈر سے کہ کہیں اس کی گرمی تمہیں نہ ڈھانپ لے، اور میں نے اس میں اس چور کو دیکھا جو رسول اللہ صلی اللہ علیہ وسلم کے اونٹوں کو چرایا تھا، اور میں نے اس میں بنو دعدع کے اس شخص کو دیکھا جو حاجیوں کا مال چرایا کرتا تھا، اور جب وہ پہچان لیا جاتا تو کہتا: یہ ( میری اس ) خمدار لکڑی کا کام ہے، اور میں نے اس میں ایک کالی لمبی عورت کو دیکھا جسے ایک بلی کے سبب عذاب ہو رہا تھا، جسے اس نے باندھ رکھا تھا، نہ تو وہ اسے کھلاتی پلاتی تھی اور نہ ہی اسے آزاد چھوڑتی تھی کہ وہ زمین کے کیڑے مکوڑے کھا لے، یہاں تک کہ وہ مر گئی، اور سورج اور چاند نہ تو کسی کے مرنے کی وجہ سے گہناتے ہیں، اور نہ ہی کسی کے پیدا ہونے سے، بلکہ یہ دونوں اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، لہٰذا جب ان میں سے کوئی گہنا جائے ( یا کہا: ان دونوں میں سے کوئی اس میں سے کچھ کرے، یعنی گہنا جائے ) تو اللہ کے ذکر کی طرف دوڑ پڑو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": 1497,
			"text": "عبدالرحمٰن بن نمر سے روایت ہے کہ انہوں نے زہری سے گرہن کی نماز کے طریقے کے بارے میں پوچھا تو انہوں نے کہا: مجھے عروہ بن زبیر نے خبر دی ہے وہ ام المؤمنین عائشہ رضی اللہ عنہا سے روایت کرتے ہیں کہ سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو حکم دیا، تو اس نے اعلان کیا کہ نماز جماعت سے ہونے والی ہے، تو لوگ جمع ہو گئے، رسول اللہ صلی اللہ علیہ وسلم نے انہیں نماز پڑھائی، آپ نے اللہ اکبر کہا، پھر ایک لمبی قرآت کی، پھر اللہ اکبر کہا، پھر ایک لمبا رکوع کیا، اپنے قیام کی طرح یا اس سے بھی لمبا، پھر اپنا سر اٹھایا، اور «سمع اللہ لمن حمده» کہا، پھر ایک لمبی قرآت کی یہ پہلی قرآت سے کم تھی، پھر «اللہ اکبر»کہا، اور ایک لمبا رکوع کیا یہ پہلے رکوع سے کم تھا، پھر اپنا سر اٹھایا، اور «سمع اللہ لمن حمده» کہا، پھر آپ نے «اللہ اکبر» کہا، اور ایک لمبا سجدہ کیا اپنے رکوع کی طرح یا اس سے بھی لمبا، پھر آپ نے «اللہ اکبر» کہا، اور اپنا سر اٹھایا، پھر آپ نے «اللہ اکبر» کہا اور سجدہ کیا، پھر آپ نے «اللہ اکبر» کہا اور ایک لمبی قرآت کی، یہ پہلی قرآت سے کم تھی، پھر «اللہ اکبر» کہا، پھر ایک لمبا رکوع کیا یہ پہلے رکوع سے کم تھا، پھر اپنا سر اٹھایا، اور «سمع اللہ لمن حمده» کہا، پھر ایک لمبی قرآت کی لیکن یہ پہلی قرآت سے جو دوسری رکعت میں کی تھی کم تھی، پھر آپ نے «اللہ اکبر» کہا، اور ایک لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر«اللہ اکبر» کہا اور اپنا سر اٹھایا، پھر «سمع اللہ لمن حمده» کہا، پھر «اللہ اکبر» کہا، اور سجدہ کیا، اور یہ پہلے سجدہ سے کم تھا، پھر آپ نے تشہد پڑھا، پھر سلام پھیرا، پھر ان کے بیچ میں کھڑے ہوئے، اور اللہ کی حمد و ثنا بیان کی، پھر فرمایا: سورج اور چاند نہ تو کسی کے مرنے سے گہناتے ہیں اور نہ ہی کسی کے پیدا ہونے سے، بلکہ یہ دونوں اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں، تو ان میں سے کسی کو گہن لگ جائے تو نماز کو یاد کر کے اللہ تعالیٰ کی طرف دوڑ پڑو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": 1498,
			"text": "اسماء بنت ابی بکر رضی اللہ عنہم کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے گرہن کی نماز پڑھی، تو آپ نے قیام کیا تو لمبا قیام کیا، پھر رکوع کیا تو لمبا رکوع کیا، پھر ( اپنا سر رکوع سے ) اٹھایا تو لمبا قیام کیا، پھر رکوع کیا تو لمبا رکوع کیا، پھر اپنا سر رکوع سے اٹھایا، پھر سجدہ کیا تو لمبا سجدہ کیا، پھر ( اپنا سر سجدہ سے ) اٹھایا، پھر سجدہ کیا تو لمبا سجدہ کیا، پھر آپ نے قیام کیا تو لمبا قیام کیا، پھر آپ نے رکوع کیا تو لمبا رکوع کیا، پھر اپنا سر اٹھایا تو لمبا قیام کیا، پھر رکوع کیا تو لمبا رکوع کیا، پھر اپنا سر اٹھایا، پھر سجدہ کیا تو لمبا سجدہ کیا، پھر اپنا سر اٹھایا، پھر سجدہ کیا تو لمبا سجدہ کیا، پھر اپنا سر اٹھایا، اور نماز سے فارغ ہو گئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": 1499,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کہیں جانے کے لیے نکلے کہ سورج کو گرہن لگ گیا، تو ہم حجرے کی طرف چلے، اور کچھ اور عورتیں بھی ہمارے پاس جمع ہو گئیں، رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے، اور یہ چاشت کا وقت تھا، ( آپ نماز پڑھنے کے لیے ) کھڑے ہوئے، تو آپ نے ایک لمبا قیام کیا، پھر ایک لمبا رکوع کیا، پھر اپنا سر اٹھایا، پھر قیام کیا پہلے قیام سے کم، پھر رکوع کیا پہلے رکوع سے کم، پھر سجدہ کیا، پھر دوسری رکعت کے لیے کھڑے ہوئے تو بھی ایسے ہی کیا، مگر آپ کا یہ قیام اور رکوع پہلی والی رکعت کے قیام اور رکوع سے کم تھا، پھر آپ نے سجدہ کیا، اور سورج صاف ہو گیا، جب آپ نماز سے فارغ ہو گئے تو منبر پر بیٹھے، اور منبر پر جو باتیں آپ نے کہیں ان میں ایک بات یہ بھی تھی کہ لوگوں کو ان کی قبروں میں دجال کی آزمائش کی طرح آزمایا جائے گا ، یہ حدیث مختصر ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں سورج کو گرہن لگا، تو آپ کھڑے ہوئے اور نماز پڑھائی تو بہت لمبا قیام کیا، پھر رکوع کیا تو بہت لمبا رکوع کیا، پھر ( رکوع سے سر ) اٹھایا، پھر قیام کیا تو بہت لمبا قیام کیا، اور یہ پہلے قیام سے کم تھا، پھر رکوع کیا تو لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے سجدہ کیا، پھر سجدے سے اپنا سر اٹھایا تو لمبا قیام کیا، اور یہ پہلے سے کم تھا، پھر آپ نے رکوع کیا تو لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے ( رکوع سے سر ) اٹھایا تو لمبا قیام کیا، اور یہ پہلے قیام سے کم تھا، پھر آپ نے رکوع کیا تو لمبا رکوع کیا، اور یہ پہلے رکوع سے کم تھا، پھر آپ نے سجدہ کیا یہاں تک کہ جب آپ نماز سے فارغ ہوئے، تو سورج سے گرہن چھٹ چکا تھا، پھر آپ نے لوگوں کو خطبہ دیا، تو اللہ کی حمد اور اس کی ثنا بیان کی، پھر فرمایا: سورج اور چاند کو نہ تو کسی کے مرنے کی وجہ سے گرہن لگتا ہے، اور نہ ہی کسی کے پیدا ہونے سے، لہٰذا جب تم اسے دیکھو تو نماز پڑھو، اور صدقہ خیرات کرو، اور اللہ عزوجل کو یاد کرو ، نیز فرمایا: اے امت محمد! کوئی اللہ تعالیٰ سے زیادہ اس بات پر غیرت والا نہیں کہ اس کا غلام یا اس کی باندی زنا کرے، اے امت محمد! اگر تم لوگ وہ چیز جانتے جو میں جانتا ہوں تو تم ہنستے کم اور روتے زیادہ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے جس وقت سورج گرہن لگا خطبہ دیا تو آپ نے ( حمد و ثنا کے بعد ) «أما بعد» کہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "ابوبکرہ رضی اللہ عنہ کہتے ہیں کہ ہم نبی اکرم صلی اللہ علیہ وسلم کے پاس تھے کہ سورج گرہن لگ گیا، تو آپ جلدی سے اپنی چادر گھسیٹتے ہوئے مسجد کی طرف بڑھے، تو لوگ بھی آپ کے ساتھ ہو لیے، آپ نے دو رکعت نماز پڑھی، اسی طرح جیسے لوگ پڑھتے ہیں، پھر جب سورج صاف ہو گیا تو آپ نے ہمیں خطبہ دیا، آپ صلی اللہ علیہ وسلم نے فرمایا: سورج اور چاند اللہ تعالیٰ کی نشانیوں میں سے دو نشانیاں ہیں جن کے ذریعہ وہ اپنے بندوں کو ڈراتا ہے، اور ان دونوں کو کسی کے مرنے سے گرہن نہیں لگتا، تو جب تم ان دونوں میں سے کسی کو گرہن لگا دیکھو تو نماز پڑھو، اور دعا کرو یہاں تک کہ جو تمہیں لاحق ہوا ہے چھٹ جائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "ابوموسیٰ اشعری رضی اللہ عنہ کہتے ہیں کہ سورج گرہن لگا تو رسول اللہ صلی اللہ علیہ وسلم گھبرا کر کھڑے ہوئے، آپ ڈر رہے تھے کہ کہیں قیامت تو نہیں آ گئی ہے، چنانچہ آپ اٹھے یہاں تک کہ مسجد آئے، پھر نماز پڑھنے کھڑے ہوئے تو آپ نے اتنے لمبے لمبے قیام، رکوع اور سجدے کیے کہ اتنے لمبے میں نے آپ کو کسی نماز میں کرتے نہیں دیکھا، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: یہ وہ نشانیاں ہیں جنہیں اللہ تعالیٰ بھیجتا ہے، یہ نہ کسی کے مرنے سے ہوتے ہیں نہ کسی کے پیدا ہونے سے، بلکہ اللہ تعالیٰ انہیں اپنے بندوں کو ڈرانے کے لیے بھیجتا ہے، تو جب تم ان میں سے کچھ دیکھو تو اللہ کو یاد کرنے اور اس سے دعا اور استغفار کرنے کے لیے دوڑ پڑو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 45
			}
		}
	]
}