{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اپنے گھروں میں نماز پڑھو، انہیں قبرستان نہ بناؤ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "زید بن ثابت رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے مسجد میں چٹائی سے گھیر کر ایک کمرہ بنایا، تو آپ نے اس میں کئی راتیں نمازیں پڑھیں یہاں تک کہ لوگ آپ کے پاس جمع ہونے لگے، پھر ان لوگوں نے ایک رات آپ کی آواز نہیں سنی، وہ سمجھے کہ آپ سو گئے ہیں، تو ان میں سے کچھ لوگ کھکھارنے لگے، تاکہ آپ ان کی طرف نکلیں تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں نے تمہیں اس کام میں برابر لگا دیکھا تو ڈرا کہ کہیں وہ تم پر فرض نہ کر دی جائے، اور اگر وہ تم پر فرض کر دی گئی تو تم اسے ادا نہیں کر سکو گے، تو لوگو! تم اپنے گھروں میں نمازیں پڑھا کرو، کیونکہ آدمی کی سب سے افضل ( بہترین ) نماز وہ ہے جو اس کے گھر میں ہو سوائے فرض نماز کے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "کعب بن عجرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مغرب کی نماز قبیلہ بنی عبدالاشہل کی مسجد میں پڑھی، جب آپ پڑھ چکے تو کچھ لوگ کھڑے ہو کر سنت پڑھنے لگے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس ( سنت ) نماز کو گھروں میں پڑھنے کی پابندی کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "سعد بن ہشام سے روایت ہے کہ وہ ابن عباس رضی اللہ عنہم سے ملے تو ان سے وتر کے متعلق پوچھا، تو انہوں نے کہا: کیا میں تمہیں اہل زمین میں رسول اللہ صلی اللہ علیہ وسلم کی وتر کے بارے میں سب سے زیادہ جاننے والے کے بارے میں نہ بتاؤں؟ سعد نے کہا: کیوں نہیں ( ضرور بتائیے ) تو انہوں نے کہا: وہ ام المؤمنین عائشہ رضی اللہ عنہا ہیں، ان کے پاس جاؤ، اور ان سے سوال کرو، پھر میرے پاس لوٹ کر آؤ، اور وہ تمہیں جو جواب دیں اسے مجھے بتاؤ، چنانچہ میں حکیم بن افلح کے پاس آیا، اور ان سے میں نے اپنے ساتھ ام المؤمنین عائشہ رضی اللہ عنہا کے پاس لے چلنے کے لیے کہا، تو انہوں نے انکار کیا، اور کہنے لگے: میں ان سے نہیں مل سکتا، میں نے انہیں ان دو گروہوں ۱؎ کے متعلق کچھ بولنے سے منع کیا تھا، مگر وہ بولے بغیر نہ رہیں، تو میں نے حکیم بن افلح کو قسم دلائی، تو وہ میرے ساتھ آئے، چنانچہ وہ عائشہ رضی اللہ عنہا کے گھر میں داخل ہوئے، تو انہوں نے حکیم سے کہا: تمہارے ساتھ یہ کون ہیں؟ میں نے کہا: سعد بن ہشام ہیں، تو انہوں نے کہا: کون ہشام؟ میں نے کہا: عامر کے لڑکے، تو انہوں نے ان ( عامر ) کے لیے رحم کی دعا کی، اور کہا: عامر کتنے اچھے آدمی تھے۔ سعد نے کہا: ام المؤمنین! مجھے رسول اللہ صلی اللہ علیہ وسلم کے اخلاق کے بارے میں بتائیے تو انہوں نے کہا: کیا تم قرآن نہیں پڑھتے؟ میں نے کہا: کیوں نہیں، ضرور پڑھتا ہوں، تو انہوں نے کہا: نبی کریم صلی اللہ علیہ وسلم کے اخلاق سراپا قرآن تھے، پھر میں نے اٹھنے کا ارادہ کیا تو مجھے رسول اللہ صلی اللہ علیہ وسلم کے قیام اللیل کے متعلق پوچھنے کا خیال آیا، تو میں نے کہا: ام المؤمنین! مجھے نبی کریم صلی اللہ علیہ وسلم کے قیام اللیل کے متعلق بتائیے، انہوں نے کہا: کیا تم سورۃ «يا أيها المزمل‏» نہیں پڑھتے؟ میں نے کہا: کیوں نہیں، ضرور پڑھتا ہوں، تو انہوں نے کہا: اللہ تعالیٰ نے اس سورۃ کے شروع میں قیام اللیل کو فرض قرار دیا، تو نبی کریم صلی اللہ علیہ وسلم اور آپ کے صحابہ نے ایک سال تک قیام کیا یہاں تک کہ ان کے قدم سوج گئے، اللہ تعالیٰ نے اس سورۃ کی آخر کی آیتوں کو بارہ مہینے تک روکے رکھا، پھر اللہ تعالیٰ نے اس سورۃ کے آخر میں تخفیف نازل فرمائی، اور رات کا قیام اس کے بعد کہ وہ فرض تھا نفل ہو گیا، میں نے پھر اٹھنے کا ارادہ کیا، تو میرے دل میں یہ بات آئی کہ میں رسول اللہ صلی اللہ علیہ وسلم کی وتر کے متعلق بھی پوچھ لوں، تو میں نے کہا: ام المؤمنین! مجھے رسول اللہ صلی اللہ علیہ وسلم کی وتر کے بارے میں بھی بتائیے تو انہوں نے کہا: ہم آپ کے لیے مسواک اور وضو کا پانی رکھ دیتے، تو اللہ تعالیٰ رات میں آپ کو جب اٹھانا چاہتا اٹھا دیتا تو آپ مسواک کرتے، اور وضو کرتے، اور آٹھ رکعتیں پڑھتے ۲؎ جن میں آپ صرف آٹھویں رکعت میں بیٹھتے، ذکر الٰہی کرتے، دعا کرتے، پھر سلام پھیرتے جو ہمیں سنائی دیتا، پھر سلام پھیرنے کے بعد آپ بیٹھے بیٹھے دو رکعتیں پڑھتے، پھر ایک رکعت پڑھتے تو اس طرح کل گیارہ رکعتیں ہوئیں۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم بوڑھے ہو گئے، اور جسم پر گوشت چڑھ گیا تو وتر کی سات رکعتیں پڑھنے لگے، اور سلام پھیرنے کے بعد بیٹھے بیٹھے دو رکعتیں پڑھتے، تو میرے بیٹے! اس طرح کل نو رکعتیں ہوئیں، اور رسول اللہ صلی اللہ علیہ وسلم جب کوئی نماز پڑھتے تو آپ کو یہ پسند ہوتا کہ اس پر مداومت کریں، اور جب آپ نیند، بیماری یا کسی تکلیف کی وجہ سے رات کا قیام نہیں کر پاتے تو آپ ( اس کے بدلہ میں ) دن میں بارہ رکعتیں پڑھتے تھے، اور میں نہیں جانتی کہ نبی اکرم صلی اللہ علیہ وسلم نے پورا قرآن ایک رات میں پڑھا ہو، اور نہ ہی آپ پوری رات صبح تک قیام ہی کرتے، اور نہ ہی کسی مہینے کے پورے روزے رکھتے، سوائے رمضان کے، پھر میں ابن عباس رضی اللہ عنہم کے پاس آیا، اور میں نے ان سے ان کی یہ حدیث بیان کی، تو انہوں نے کہا: عائشہ رضی اللہ عنہا نے سچ کہا، رہا میں تو اگر میں ان کے یہاں جاتا ہوتا تو میں ان کے پاس ضرور جاتا یہاں تک کہ وہ مجھ سے براہ راست بالمشافہ یہ حدیث بیان کرتیں۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: اسی طرح میری کتاب میں ہے، اور میں نہیں جانتا کہ کس شخص سے آپ کی وتر کی جگہ کے بارے میں غلطی ہوئی ہے ۳؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص رمضان میں ایمان کی حالت میں ثواب کی نیت سے ( رات کا ) قیام کرے گا، تو اس کے گناہ جو پہلے ہو چکے ہوں بخش دیے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص رمضان میں ایمان کی حالت میں ثواب کی نیت سے ( رات کا ) قیام کرے گا، تو اس کے اگلے گناہ بخش دیے جائیں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک رات مسجد میں نماز پڑھی، آپ کی نماز کے ساتھ کچھ اور لوگوں نے بھی نماز پڑھی، پھر آپ نے آنے والی رات میں بھی نماز پڑھی اور لوگ بڑھ گئے تھے، پھر تیسری یا چوتھی رات میں لوگ جمع ہوئے تو رسول اللہ صلی اللہ علیہ وسلم ان کی طرف نکلے ہی نہیں، پھر جب صبح ہوئی تو آپ نے فرمایا: تم نے جو دلچسپی دکھائی اسے میں نے دیکھا، تو تمہاری طرف نکلنے سے مجھے صرف اس چیز نے روک دیا کہ میں ڈرا کہ کہیں وہ تمہارے اوپر فرض نہ کر دی جائے ، یہ رمضان کا واقعہ تھا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان میں روزے رکھے، تو آپ ہمارے ساتھ ( تراویح کے لیے ) کھڑے نہیں ہوئے یہاں تک کہ مہینے کی سات راتیں باقی رہ گئیں، تو آپ نے ہمارے ساتھ قیام کیا یہاں تک کہ ایک تہائی رات گزر گئی، پھر چوبیسویں رات کو قیام نہیں کیا، پھر پچیسویں رات کو قیام کیا یہاں تک کہ آدھی رات گزر گئی، میں نے عرض کیا: اللہ کے رسول! کاش آپ ہماری اس رات کے باقی حصہ میں بھی اسی طرح نفلی نماز پڑھاتے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جو شخص امام کے ساتھ قیام کرے یہاں تک کہ وہ فارغ ہو جائے تو اللہ تعالیٰ اس شخص کے حق میں پوری رات کے قیام ( کا ثواب ) لکھے گا ، پھر آپ نے ہمیں نماز نہیں پڑھائی، اور نہ آپ نے قیام کیا یہاں تک کہ مہینے کی تین راتیں باقی رہ گئیں، تو آپ نے ستائیسویں رات میں ہمارے ساتھ قیام کیا، اور اپنے اہل و عیال کو بھی جمع کیا یہاں تک کہ ہمیں ڈر ہوا کہ کہیں ہم سے فلاح چھوٹ نہ جائے، میں نے پوچھا: فلاح کیا ہے؟ کہنے لگے: سحری ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "نعیم بن زیاد ابوطلحہ کہتے ہیں کہ میں نے نعمان بشیر رضی اللہ عنہم کو حمص میں منبر پر بیان کرتے ہوئے سنا، وہ کہہ رہے تھے: ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان کے مہینے میں تیئسویں رات کو تہائی رات تک قیام کیا، پھر پچسویں رات کو آدھی رات تک قیام کیا، پھر ستائیسویں رات کو ہم نے آپ کے ساتھ قیام کیا یہاں تک کہ ہم نے گمان کیا کہ ہم فلاح نہیں پا سکیں گے، وہ لوگ سحری کو فلاح کا نام دیتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی سو جاتا ہے تو شیطان اس کے سر پر تین گرہیں لگا دیتا ہے، اور ہر گرہ پر تھپکی دے کر کہتا ہے: ابھی رات بہت لمبی ہے، پس سوئے رہ، تو اگر وہ بیدار ہو جاتا ہے، اور اللہ کا ذکر کرتا ہے تو ایک گرہ کھل جاتی ہے، پھر اگر وہ وضو بھی کر لے تو دوسری گرہ کھل جاتی ہے، پھر اگر اس نے نماز پڑھی تو تمام گرہیں کھل جاتی ہیں، اور وہ اس حال میں صبح کرتا ہے کہ وہ ہشاس بشاس اور خوش دل ہوتا ہے، ورنہ اس کی صبح اس حال میں ہوتی ہے کہ وہ بد دل اور سست ہوتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک آدمی کا ذکر کیا گیا جو رات بھر سوتا رہا یہاں تک کہ صبح ہو گئی، تو آپ نے فرمایا: یہ ایسا آدمی ہے جس کے کانوں میں شیطان نے پیشاب کر دیا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ ایک آدمی نے عرض کیا: اللہ کے رسول! فلاں شخص کل کی رات نماز سے سویا رہا یہاں تک کہ صبح ہو گئی، تو آپ نے فرمایا: اس کے کانوں میں شیطان نے پیشاب کر دیا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ رحم کرے اس آدمی پر جو رات کو اٹھے اور نماز پڑھے، پھر اپنی بیوی کو بیدار کرے، تو وہ ( بھی ) نماز پڑھے، اگر نہ اٹھے تو اس کے چہرے پر پانی کے چھینٹے مارے، اور اللہ رحم کرے اس عورت پر جو رات کو اٹھے اور تہجد پڑھے، پھر اپنے شوہر کو ( بھی ) بیدار کرے، تو وہ بھی تہجد پڑھے، اور اگر وہ نہ اٹھے تو اس کے چہرے پر پانی کے چھینٹے مارے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے انہیں اور فاطمہ کو ( دروازہ کھٹکھٹا کر ) بیدار کیا، اور فرمایا: کیا تم نماز نہیں پڑھو گے؟ تو میں نے عرض کیا: اللہ کے رسول! ہماری جانیں تو اللہ کے ہاتھ میں ہیں، جب وہ انہیں اٹھانا چاہے گا اٹھا دے گا، جب میں نے آپ سے یہ کہا تو آپ صلی اللہ علیہ وسلم پلٹ پڑے، پھر میں نے آپ کو سنا، آپ پیٹھ پھیر کر جا رہے تھے اور اپنی ران پر ( ہاتھ ) مار کر فرما رہے تھے: «وكان الإنسان أكثر شىء جدلا» انسان بہت حجتی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "علی بن ابی طالب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رات میں میرے اور فاطمہ کے پاس آئے، اور آپ نے ہمیں نماز کے لیے بیدار کیا، پھر آپ اپنے گھر لوٹ گئے، اور جا کر دیر رات تک نماز پڑھتے رہے، جب آپ نے ہماری کوئی آہٹ نہیں سنی تو آپ دوبارہ ہمارے پاس آئے، اور ہمیں بیدار کیا، اور فرمایا: تم دونوں اٹھو، اور نماز پڑھو ، تو میں اٹھ کر بیٹھ گیا، میں اپنی آنکھ مل رہا تھا اور کہہ رہا تھا: قسم اللہ کی، ہم اتنی ہی پڑھیں گے جو اللہ تعالیٰ نے ہمارے لیے لکھ دی ہے، ہماری جانیں اللہ کے ہاتھ میں ہیں، اگر وہ ہمیں بیدار کرنا چاہے گا تو بیدار کر دے گا تو یہ سنا تو رسول اللہ صلی اللہ علیہ وسلم پیٹھ پھیر کر جانے لگے، آپ اپنے ہاتھ سے اپنی ران پر مار رہے تھے، اور کہہ رہے تھے: ہم اتنی ہی پڑھیں گے جو اللہ تعالیٰ نے ہمارے لیے لکھ دی ہے، ۱؎ انسان بہت ہی حجتی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: رمضان کے مہینے کے بعد سب سے افضل روزے اللہ کے مہینے محرم کے روزے ہیں ۱؎، اور فرض نماز کے بعد سب سے افضل نماز قیام اللیل ( تہجد ) ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "حمید بن عبدالرحمٰن کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: فرض نماز کے بعد سب سے افضل نماز قیام اللیل ( تہجد ) ہے، اور رمضان کے بعد سب سے افضل روزے محرم کے روزے ہیں ۔ شعبہ بن حجاج نے اسے مرسلاً روایت کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "ابوذر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تین شخص سے اللہ تعالیٰ محبت رکھتا ہے: ایک وہ شخص جو کسی قوم کے پاس آیا، اور اس نے ان سے اللہ کا واسطہ دے کر مانگا، آپ سی قرابت کا واسطہ دے کر نہیں مانگا، تو انہوں نے اسے نہیں دیا، پھر انہی میں سے ایک آدمی ان کے پیچھے سے آیا، اور چھپا کر چپکے سے اسے دیا، اور اس کے اس صدقہ دینے کو سوائے اللہ تعالیٰ کے اور اس شخص کے جس کو اس نے دیا ہے کوئی نہیں جانتا، اور دوسرا آدمی وہ ہے جس کے ساتھ کے لوگ رات بھر چلتے رہے یہاں تک کہ جب نیند انہیں بھلی معلوم ہونے لگی تو وہ اترے اور سو رہے، لیکن وہ خود کھڑا ہو کر اللہ کے سامنے عاجزی کرتا رہا، اور اس کی آیتیں تلاوت کرتا رہا، اور تیسرا وہ شخص ہے جو ایک لشکر میں تھا، دشمن سے ان کی مڈبھیڑ ہوئی، تو وہ ہار گئے ( جس کی وجہ سے بھاگنے لگے ) لیکن وہ سینہ سپر رہا یہاں تک کہ وہ مارا جائے، یا اللہ اسے فتح دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "مسروق کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم کو سب سے زیادہ محبوب کون سا عمل تھا؟ تو انہوں نے کہا: جس عمل پر مداومت ہو، میں نے پوچھا: رات میں آپ کب اٹھتے تھے؟ تو انہوں نے کہا: جب مرغ کی بانگ سنتے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "عاصم بن حمید کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم رات کے قیام کی شروعات کس سے کرتے تھے؟ تو وہ کہنے لگیں، تو نے مجھ سے ایک ایسی چیز پوچھی ہے جو تم سے پہلے کسی نے نہیں پوچھی، رسول اللہ صلی اللہ علیہ وسلم دس بار «اللہ اکبر»، دس بار «الحمد للہ»، دس بار «سبحان اللہ» اور دس بار «لا الٰہ الا اللہ» اور دس بار «استغفر اللہ» کہتے تھے، اور «اللہم اغفر لي واهدني وارزقني وعافني أعوذ باللہ من ضيق المقام يوم القيامة» اے اللہ! مجھے بخش دے، مجھے راہ دکھا، مجھے رزق عطا فرما، اور میری حفاظت فرما، میں اللہ کی پناہ چاہتا ہوں قیامت کے روز جگہ کی تنگی سے کہتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "ربیعہ بن کعب الاسلمی رضی اللہ عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے کمرے کے پاس رات گزارتا تھا، تو میں آپ کو سنتا جب آپ رات میں اٹھتے، تو دیر تک «سبحان اللہ رب العالمين» کہتے، پھر «سبحان اللہ وبحمده» دیر تک کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب رات کو تہجد پڑھنے کے لیے اٹھتے تو کہتے: «‏اللہم لك الحمد أنت نور السموات والأرض ومن فيهن ولك الحمد أنت قيام السموات والأرض ومن فيهن ولك الحمد أنت ملك السموات والأرض ومن فيهن ولك الحمد أنت حق ووعدك حق والجنة حق والنار حق والساعة حق والنبيون حق ومحمد حق لك أسلمت وعليك توكلت وبك آمنت» اے اللہ! تیرے ہی لیے تمام تعریفیں ہیں، تو آسمانوں اور زمین کا اور جو ان میں ہیں سب کا روشن کرنے والا ہے، تیرے ہی لیے تمام تعریفیں ہیں، تو آسمانوں اور زمین کا اور جو ان میں ہیں سب کا قائم و برقرار رکھنے والا ہے، تیرے ہی لیے تمام تعریفیں ہیں، تو آسمانوں اور زمین اور جوان میں ہیں سب کا بادشاہ ہے، تیرے ہی لیے تمام تعریفیں ہیں، تو حق ہے، تیرا وعدہ حق ہے، جنت حق ہے، جہنم حق ہے، قیامت حق ہے، انبیاء حق ہیں، اور محمد حق ہیں، میں نے تیری ہی فرمانبرداری کی، اور تجھی پر میں نے بھروسہ کیا، اور تجھی پر ایمان لایا ، پھر قتیبہ نے ایک بات ذکر کی اس کا مفہوم ہے ( کہ آپ یہ بھی کہتے: ) «وبك خاصمت وإليك حاكمت اغفر لي ما قدمت وما أخرت وما أعلنت أنت المقدم وأنت المؤخر لا إله إلا أنت ولا حول ولا قوة إلا باللہ» اور تیرے ہی لیے میں نے جھگڑا کیا، تیری ہی طرف میں فیصلہ کے لیے آیا، بخش دے میرے اگلے پچھلے، چھپے اور کھلے گناہ، تو ہی آگے اور پیچھے کرنے والا ہے، نہیں ہے کوئی حقیقی معبود مگر تو ہی، اور نہ ہی کسی میں زور و طاقت ہے سوائے اللہ کے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ انہوں نے ام المؤمنین میمونہ رضی اللہ عنہا کے پاس رات گزاری ( وہ ان کی خالہ تھیں ) تو وہ تکیہ کے چوڑان میں لیٹے اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کی اہلیہ دونوں اس کی لمبان میں، رسول اللہ صلی اللہ علیہ وسلم سوئے رہے یہاں تک کہ جب آدھی رات ہوئی، یا اس سے کچھ پہلے، یا اس کے کچھ بعد تو رسول اللہ صلی اللہ علیہ وسلم بیدار ہوئے، چہرہ سے نیند بھگانے کے لیے اپنے ہاتھ سے آنکھ ملتے ہوئے اٹھ کر بیٹھ گئے، پھر آپ نے سورۃ آل عمران کی آخری دس آیتیں پڑھیں، پھر آپ ایک لٹکے ہوئے مشکیزے کی طرف بڑھے، اور اس سے وضو کیا تو خوب اچھی طرح سے وضو کیا، پھر آپ نماز پڑھنے کے لیے کھڑے ہوئے۔ عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں: میں بھی اٹھا، اور میں نے بھی ویسے ہی کیا جیسے آپ نے کیا، پھر میں گیا، اور آپ کے پہلو میں جا کر کھڑا ہو گیا تو آپ صلی اللہ علیہ وسلم نے اپنا دایاں ہاتھ میرے سر پر رکھا اور میرا داہنا کان پکڑ کر اسے ملنے لگے، آپ نے دو رکعتیں پڑھیں، پھر دو رکعتیں، پھر دو رکعتیں، پھر دو رکعتیں، پھر دو رکعتیں، پھر دو رکعتیں، پھر آپ نے وتر پڑھی ۱؎ پھر آپ لیٹے یہاں تک کہ آپ کے پاس مؤذن آیا تو آپ نے پھر ہلکی دو رکعتیں پڑھیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "حذیفہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب رات میں اٹھتے تو مسواک سے اپنا منہ ملتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب رات میں اٹھتے تو مسواک سے اپنا منہ ملتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "ابوسنان ابوحصین سے وہ ابووائل شقیق بن سلمہ سے روایت کرتے ہیں کہ حذیفہ رضی اللہ عنہ نے کہا: جب ہم رات میں بیدار ہوتے تو ہمیں مسواک کرنے کا حکم دیا جاتا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "اسرائیل ابوحصین سے روایت کرتے ہیں کہ ابووائل شقیق نے کہا: جب ہم رات کو بیدار ہوتے تھے تو ہمیں مسواک سے اپنا منہ ملنے کا حکم دیا جاتا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "ابوسلمہ بن عبدالرحمٰن کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا کہ نبی اکرم صلی اللہ علیہ وسلم اپنی نماز کی شروعات کس چیز سے کرتے تھے؟ تو انہوں نے کہا: آپ جب رات میں اٹھ کر اپنی نماز شروع کرتے تو کہتے: «اللہم رب جبريل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اللہم اهدني لما اختلف فيه من الحق إنك تهدي من تشاء إلى صراط مستقيم» اے اللہ! اے جبرائیل و میکائیل و اسرافیل کے رب، آسمانوں اور زمین کے پیدا کرنے والے، غائب اور حاضر کے جاننے والے! تو ہی اپنے بندوں کے درمیان فیصلہ کرے گا جس میں وہ جھگڑتے تھے، اے اللہ! جس میں اختلاف کیا گیا ہے اس میں تو میری رہنمائی فرما، تو جس کی چاہتا ہے سیدھی راہ کی طرف رہنمائی فرماتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "حمید بن عبدالرحمٰن بن عوف سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے ایک شخص کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھا، میں نے اپنے جی میں کہا کہ اللہ کی قسم! میں نماز کے لیے رسول اللہ صلی اللہ علیہ وسلم کا انتظار کروں گا یہاں تک کہ آپ کے عمل کو دیکھ لوں، تو جب آپ نے عشاء کی نماز پڑھی، اور یہی عتمہ تھی، تو بڑی رات تک سوئے رہے، پھر آپ بیدار ہوئے توافق کی جانب نگاہ اٹھائی، اور فرمایا: «ربنا ما خلقت هذا باطلا» اے ہمارے رب! تو نے اسے بیکار پیدا نہیں کیا ہے ( آل عمران: ۱۹۱ ) یہاں تک کہ آپ «إنك لا تخلف الميعاد» بلاشبہ تو وعدہ خلافی نہیں کرتا ( آل عمران: ۱۹۴ ) تک پہنچے، پھر آپ اپنے بچھونے کی طرف جھکے، اور آپ نے اس میں سے ایک مسواک نکالی، پھر ڈول سے جو آپ کے پاس تھا ایک پیالے میں پانی انڈیلا، اور مسواک کی، پھر آپ کھڑے ہوئے، اور نماز پڑھی یہاں تک کہ میں نے ( اپنے دل میں ) کہا: آپ جتنی دیر تک سوئے تھے اتنی ہی دیر تک آپ نے نماز پڑھی ہے، پھر آپ لیٹ گئے یہاں تک کہ میں نے ( اپنے دل میں ) کہا: آپ اتنی ہی دیر تک سوئے ہیں جتنی دیر تک آپ نے نماز پڑھی تھی، پھر آپ بیدار ہوئے تو آپ نے اسی طرح کیا جس طرح آپ نے پہلی مرتبہ کیا تھا، اور اسی طرح کہا جس طرح پہلے کہا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فجر سے پہلے تین مرتبہ ( اسی طرح ) کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کو رات میں نماز ( تہجد ) پڑھتے ہوئے دیکھنا چاہتے تو دیکھ لیتے، اور آپ کو سوتے ہوئے دیکھنا چاہتے تو دیکھ لیتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "یعلیٰ بن مملک سے روایت ہے کہ انہوں نے ام المؤمنین ام سلمہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں سوال کیا، تو انہوں نے کہا: آپ عتمہ ( عشاء کی نماز ) پڑھتے تھے پھر سنتیں پڑھتے، پھر اس کے بعد رات میں جتنا اللہ چاہتا پڑھتے، پھر آپ واپس جا کر جتنی دیر تک آپ نے نماز پڑھی تھی اسی کے بقدر سوتے، پھر آپ اپنی اس نیند سے بیدار ہوتے تو جتنی دیر تک سوئے تھے اسی کے بقدر نماز پڑھتے، اور آپ کی یہ دوسری مرتبہ والی نماز صبح ( فجر ) تک جاری رہتی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "یعلیٰ بن مملک سے روایت ہے کہ انہوں نے ام المؤمنین ام سلمہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی قرآت اور آپ کی نماز کے متعلق سوال کیا، تو انہوں نے کہا: تمہیں آپ کی نماز سے کیا سروکار؟ ۱؎ آپ نماز پڑھتے تھے، پھر جتنی دیر تک آپ نے نماز پڑھی تھی اسی کے بقدر آپ سوتے، پھر جتنی دیر تک سوئے تھے اسی کے بقدر آپ اٹھ کر نماز پڑھتے، پھر جتنی دیر تک نماز پڑھی تھی اسی کے بقدر آپ سوتے یہاں تک کہ آپ صبح کرتے، پھر انہوں نے ان سے آپ کی قرآت کی کیفیت بیان کی، تو وہ ایک ایک حرف واضح کر کے بیان کر رہی تھیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے نزدیک سب سے محبوب روزے داود علیہ السلام کے روزے ہیں، وہ ایک دن روزہ رکھتے تھے اور ایک دن افطار کرتے تھے، اور اللہ تعالیٰ کے نزدیک بہترین نماز داود علیہ السلام کی نماز ہے، وہ آدھی رات تک سوتے تھے، پھر تہائی رات تک نماز پڑھتے، پھر چھٹے حصہ میں سو جاتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "حماد بن سلمہ سلیمان تیمی سے، سلیمان تیمی ثابت سے اور ثابت انس بن مالک رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس رات مجھے معراج ہوئی میں موسیٰ علیہ السلام کے پاس سرخ ٹیلے کے پاس آیا، اور وہ کھڑے اپنی قبر میں نماز پڑھ رہے تھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "سلیمان تیمی اور ثابت دونوں انس رضی اللہ عنہ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں «الكثيب الأحمر» سرخ ٹیلے کے پاس موسیٰ علیہ السلام کے پاس آیا اور وہ کھڑے نماز پڑھ رہے تھے۔ ابوعبدالرحمٰن نسائی کہتے ہیں: یہ ۱؎ ہمارے نزدیک معاذ بن خالد کی حدیث سے زیادہ درست ہے، واللہ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "حماد بن سلمہ کہتے ہیں ہمیں ثابت اور سلیمان تیمی نے خبر دی ہے وہ دونوں انس رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میں موسیٰ علیہ السلام کی قبر پر سے گزرا اور وہ اپنی قبر میں نماز پڑھ رہے تھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "سلیمان تیمی روایت کرتے ہیں انس بن مالک رضی اللہ عنہ سے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں معراج کی رات میں موسیٰ وضاحت پر سے گزرا اور وہ اپنی قبر میں نماز پڑھ رہے تھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "معتمر بن سلیمان اپنے والد سے اور ان کے والد انس رضی اللہ عنہ سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم معراج کی رات موسیٰ علیہ السلام پر سے گزرے اور وہ اپنی قبر میں نماز پڑھ رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "معتمر بن سلیمان کہتے ہیں کہ میں نے اپنے والد کو سنا وہ کہہ رہے تھے کہ میں نے انس رضی اللہ عنہ کو کہتے سنا ہے کہ مجھے نبی اکرم صلی اللہ علیہ وسلم کے بعض اصحاب نے بتایا کہ نبی اکرم صلی اللہ علیہ وسلم معراج کی رات میں موسیٰ علیہ السلام پر سے گزرے، اور وہ اپنی قبر میں نماز پڑھ رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "سلیمان انس رضی اللہ عنہ سے اور وہ نبی اکرم صلی اللہ علیہ وسلم کے بعض اصحاب سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: معراج کی رات میں میں موسیٰ کے پاس سے گزرا اور وہ اپنی قبر میں نماز پڑھ رہے تھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "خباب بن ارت رضی اللہ عنہ سے روایت ہے (وہ بدر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ حاضر تھے) کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو پوری رات نماز پڑھتے دیکھا یہاں تک کہ فجر ہو گئی، جب رسول اللہ صلی اللہ علیہ وسلم نے اپنی نماز سے سلام پھیرا، تو خباب رضی اللہ عنہ آپ کے پاس آئے، اور عرض کیا: اللہ کے رسول! میرے ماں باپ آپ پر فدا ہوں، آپ نے آج رات ایسی نماز پڑھی کہ اس طرح میں نے آپ کو پڑھتے ہوئے کبھی نہیں دیکھا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ہاں یہ رغبت اور خوف کی نماز تھی، میں نے اپنے رب سے اس میں تین باتوں کی درخواست کی، تو اس نے دو مجھے دے دیں اور ایک نہیں دی، میں نے اپنے رب سے درخواست کی کہ وہ ہمیں اس چیز کے ذریعہ ہلاک نہ کرے جس کے ذریعہ اس نے ہم سے پہلے کی امتوں کو ہلاک کیا، تو اس نے یہ مجھے دے دی، اور میں نے اپنے رب سے درخواست کی کہ وہ کسی دشمن کو جو ہم میں سے نہ ہو ہم پر غالب نہ کرے، تو اسے بھی اس نے مجھے دے دیا، اور میں نے اپنے رب سے درخواست کی کہ وہ ہم میں پھوٹ نہ ڈالے، اور ہم گروہ در گروہ نہ ہوں، تو اس نے میری یہ درخواست قبول نہیں کی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "مسروق کہتے ہیں کہ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جب ( رمضان کا آخری ) عشرہ ہوتا تو رسول اللہ صلی اللہ علیہ وسلم شب بیداری فرماتے، اور اپنے اہل و عیال کو بیدار کرتے، اور ( عبادت کے لیے ) کمر بستہ ہو جاتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "ابواسحاق سبیعی کہتے ہیں کہ میں اسود بن یزید کے پاس آیا، وہ میرے بھائی اور دوست تھے، تو میں نے کہا: اے ابوعمرو! مجھ سے وہ باتیں بیان کریں جن کو ام المؤمنین نے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے متعلق بیان کیا ہے، تو انہوں نے کہا: وہ کہتی ہیں کہ آپ شروع رات میں سوتے تھے، اور اس کے آخر کو زندہ رکھتے تھے۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نہیں جانتی کہ رسول اللہ صلی اللہ علیہ وسلم نے پورا قرآن ایک رات میں پڑھا ہو، یا رات بھر صبح تک عبادت کی ہو، یا پورے مہینے روزے رکھے ہوں، سوائے رمضان کے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ان کے پاس آئے، اور ان کے پاس ایک عورت ( بیٹھی ہوئی ) تھی تو آپ نے پوچھا: یہ کون ہے؟ انہوں نے کہا: فلاں ( عورت ) ہے جو سوتی نہیں ہے، پھر انہوں نے اس کی نماز کا ذکر کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: چپ رہو، تم اتنا ہی کرو جتنے کی تمہیں طاقت ہو، قسم اللہ کی، اللہ نہیں تھکتا ہے یہاں تک کہ تم تھک جاؤ، پسندیدہ دین ( عمل ) اس کے نزدیک وہی ہے جس پر آدمی مداومت کرے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم مسجد میں داخل ہوئے، آپ نے دو ستونوں کے درمیان میں ایک لمبی رسی دیکھی، تو آپ نے پوچھا: یہ رسی کیسی ہے؟ تو لوگوں نے عرض کیا: زینب ( زینب بنت جحش ) کی ہے وہ نماز پڑھتی ہیں، جب کھڑے کھڑے تھک جاتی ہیں تو اس سے لٹک جاتی ہیں، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: کھولو اسے، تم میں سے کوئی بھی ہو جب تک اس کا دل لگے نماز پڑھے، اور جب تھک جائے تو بیٹھ جائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "مغیرہ بن شعبہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم ( نماز میں ) کھڑے رہتے یہاں تک کہ آپ کے دونوں پیر سوج جاتے، تو آپ سے عرض کیا گیا: اللہ تعالیٰ نے آپ کے اگلے اور پچھلے گناہ بخش دیئے ہیں ( پھر آپ اتنی عبادت کیوں کرتے ہیں ) تو آپ نے فرمایا: کیا میں شکر گزار بندہ نہ بنوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نماز پڑھتے تھے یہاں تک کہ آپ کے دونوں پاؤں پھٹ جاتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "بدیل اور ایوب دونوں عبداللہ بن شفیق سے روایت کرتے ہیں، اور وہ ام المؤمنین عائشہ رضی اللہ عنہا سے کہ رسول اللہ صلی اللہ علیہ وسلم رات میں کافی دیر تک نماز پڑھتے، تو جب آپ کھڑے ہو کر نماز پڑھتے تو کھڑے کھڑے ہی رکوع کرتے، اور جب بیٹھ کر پڑھتے تو بیٹھ کر رکوع کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "ابن سیرین عبداللہ بن شفیق سے اور عبداللہ بن شقیق ام المؤمنین عائشہ رضی اللہ عنہا سے روایت کرتے ہیں، وہ کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کبھی کھڑے ہو کر اور کبھی بیٹھ کر نماز پڑھتے، تو جب آپ کھڑے ہو کر نماز شروع کرتے تو کھڑے کھڑے رکوع کرتے، اور جب بیٹھ کر شروع کرتے تو بیٹھے بیٹھے ہی رکوع کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں نبی اکرم صلی اللہ علیہ وسلم نماز پڑھتے اور بیٹھے ہوتے، اور قرآت کرتے اور بیٹھے ہوتے، پھر جب آپ کی قرآت میں تیس یا چالیس آیتوں کے بقدر باقی رہ جاتی تو کھڑے ہو جاتے، اور کھڑے ہو کر قرآت کرتے، پھر رکوع کرتے، پھر سجدہ کرتے، پھر دوسری رکعت میں ( بھی ) ایسے ہی کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں میں نے رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھا کہ آپ نے بیٹھ کر نماز پڑھی ہو یہاں تک کہ آپ بوڑھے ہو گئے، تو ( جب آپ بوڑھے ہو گئے ) تو آپ بیٹھ کر نماز پڑھتے اور بیٹھ کر قرآت کرتے، پھر جب سورۃ میں سے تیس یا چالیس آیتیں باقی رہ جاتیں تو ان کی قرآت کھڑے ہو کر کرتے، پھر رکوع کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم قرآت کرتے اور بیٹھے ہوتے، تو جب آپ رکوع کرنا چاہتے تو آدمی کے چالیس آیتیں پڑھنے کے بقدر ( باقی رہنے پر ) کھڑے ہو جاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "سعد بن ہشام بن عامر کہتے ہیں میں مدینہ آیا تو ام المؤمنین عائشہ رضی اللہ عنہا کے پاس آیا، انہوں نے پوچھا: تم کون ہو؟ میں نے کہا: میں سعد بن ہشام بن عامر ہوں، انہوں نے کہا: اللہ تمہارے باپ پر رحم کرے، میں نے کہا: مجھے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے متعلق کچھ بتائیے، تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم ایسا ایسا کرتے تھے، میں نے کہا: اچھا، انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم رات میں عشاء کی نماز پڑھتے تھے، پھر آپ اپنے بچھونے کی طرف آتے اور سو جاتے، پھر جب آدھی رات ہوتی، تو قضائے حاجت کے لیے اٹھتے اور وضو کے پانی کے پاس آتے، اور وضو کرتے، پھر مسجد آتے اور آٹھ رکعتیں پڑھتے، تو پھر ایسا محسوس ہوتا کہ ان میں قرآت، رکوع اور سجدے سب برابر برابر ہیں، اور ایک رکعت وتر پڑھتے، پھر بیٹھ کر دو رکعت پڑھتے، پھر آپ اپنے پہلو کے بل لیٹ جاتے، تو کبھی اس سے پہلے کہ آپ کی آنکھ لگے بلال رضی اللہ عنہ آپ کے پاس آتے، اور آپ کو نماز کی اطلاع دیتے، اور کبھی آپ کی آنکھ لگ جاتی، اور کبھی مجھے شک ہوتا کہ آپ سوئے یا نہیں سوئے یہاں تک کہ وہ آپ کو نماز کی خبر دیتے، تو یہ رسول اللہ صلی اللہ علیہ وسلم کی نماز تھی، یہاں تک کہ آپ عمردراز ہو گئے، اور جسم پر گوشت چڑھ گیا، پھر انہوں نے آپ کے جسم پر گوشت چڑھنے کا حال بیان کیا جو اللہ نے چاہا، وہ کہتی ہیں: نبی اکرم صلی اللہ علیہ وسلم لوگوں کو عشاء کی نماز پڑھاتے، پھر اپنے بچھونے کی طرف آتے، تو جب آدھی رات ہو جاتی تو آپ اپنی پاکی اور حاجت کے لیے اٹھ کر جاتے، پھر وضو کرتے، پھر مسجد آتے تو چھ رکعتیں پڑھتے، ایسا محسوس ہوتا کہ آپ ان میں قرآت، رکوع اور سجدے میں برابری رکھتے ہیں، پھر آپ ایک رکعت وتر پڑھتے، پھر دو رکعت بیٹھ کر پڑھتے، پھر اپنے پہلو کے بل لیٹتے تو کبھی بلال رضی اللہ عنہ آپ کی آنکھ لگنے سے پہلے ہی آ کر نماز کی اطلاع دیتے، اور کبھی آنکھ لگ جانے پر آتے، اور کبھی مجھے شک ہوتا کہ آپ کی آنکھ لگی یا نہیں یہاں تک کہ وہ آپ کو نماز کی خبر دیتے، وہ کہتی ہیں: تو برابر یہی رسول اللہ صلی اللہ علیہ وسلم کی نماز رہی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم روزے کی حالت میں میرے چہرے سے نہیں بچتے تھے ۱؎ اور آپ کی وفات نہیں ہوئی یہاں تک کہ آپ کی بیشتر نمازیں بیٹھ کر ہونے لگیں، سوائے فرض نماز کے، اور سب سے زیادہ پسندیدہ عمل آپ کے نزدیک وہ تھا جس پر آدمی مداومت کرے اگرچہ وہ تھوڑا ہی ہو۔ یونس نے عمر بن ابی زائدہ کی مخالفت کی ہے یونس نے اسے ابواسحاق سے اور ابواسحاق نے اسود سے اور اسود نے ام سلمہ رضی اللہ عنہا سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا انتقال نہیں ہوا یہاں تک کہ آپ کی بیشتر نمازیں بیٹھ کر ہونے لگیں سوائے فرض نماز کے۔ شعبہ اور سفیان نے یونس بن شریک کی مخالفت کی ہے، ان دونوں نے اسے ابواسحاق سے اور ابواسحاق نے ابوسلمہ سے اور ابوسلمہ نے ام سلمہ سے روایت کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم کا انتقال نہیں ہوا یہاں تک کہ آپ کی اکثر و بیشتر نمازیں بیٹھ کر ہونے لگیں، سوائے فرض نماز کے اور آپ کے نزدیک سب سے زیادہ پسندیدہ عمل وہ تھا جس کو ہمیشہ کیا جائے خواہ وہ تھوڑا ہی ہو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، رسول اللہ صلی اللہ علیہ وسلم کا انتقال نہیں ہوا یہاں تک کہ آپ کی بیشتر نمازیں بیٹھ کر ہونے لگیں سوائے فرض نماز کے، اور آپ کے نزدیک سب سے زیادہ پسندیدہ عمل وہ تھا جس پر مداومت کی جائے اگرچہ وہ تھوڑا ہی ہو۔ عثمان بن ابی سلیمان نے ابواسحاق کی مخالفت کی ہے انہوں نے اسے ابوسلمہ سے اور ابوسلمہ نے عائشہ رضی اللہ عنہا سے روایت کی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "ابن جریج سے روایت ہے کہ مجھے عثمان بن ابی سلیمان نے خبر دی ہے وہ کہتے ہیں کہ ابوسلمہ نے انہیں خبر دی ہے وہ کہتے ہیں کہ عائشہ رضی اللہ عنہا نے انہیں خبر دی ہے کہ نبی اکرم صلی اللہ علیہ وسلم کا انتقال نہیں ہوا یہاں تک کہ آپ اپنی بیشتر نمازیں بیٹھ کر پڑھنے لگے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "عبداللہ بن شفیق کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر نماز پڑھتے تھے؟ تو انہوں نے کہا: ہاں، اس کے بعد کہ لوگوں نے آپ پر ذمہ داریوں کا بوجھ ڈال کر آپ کو کمزور کر دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کبھی بیٹھ کر نفل پڑھتے نہیں دیکھا یہاں تک کہ اپنی وفات سے ایک سال قبل آپ بیٹھ کر نماز پڑھنے لگے تھے، آپ سورت پڑھتے تو اتنا ٹھہر ٹھہر کر پڑھتے کہ وہ طویل سے طویل تر ہو جاتی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو بیٹھ کر نماز پڑھتے دیکھا تو میں نے عرض کیا کہ مجھ سے بیان کیا گیا ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا ہے کہ بیٹھ کر پڑھنے والے کی نماز کھڑے ہو کر پڑھنے والے کی نماز کے آدھی ہوتی ہے، اور آپ خود بیٹھ کر پڑھ رہے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں لیکن میں تم لوگوں کی طرح نہیں ہوں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے بیٹھ کر نماز پڑھنے والے شخص کے بارے میں پوچھا: تو آپ نے فرمایا: جس نے کھڑے ہو کر نماز پڑھی وہ سب سے افضل ہے، اور جس نے بیٹھ کر نماز پڑھی تو اسے کھڑے ہو کر پڑھنے والے کی نماز کا آدھا ثواب ملے گا، اور جس نے لیٹ کر نماز پڑھی تو اسے بیٹھ کر پڑھنے والے کے آدھا ملے گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو پالتی مار کر بیٹھ کر نماز پڑھتے دیکھا۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: مجھے نہیں معلوم کہ ابوداؤد حفری کے علاوہ کسی اور نے بھی یہ حدیث روایت کی ہے، اور ابوداؤد ثقہ ہیں اس کے باوجود میں اس حدیث کو غلط ہی سمجھتا ہوں، واللہ اعلم ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "عبداللہ بن ابی قیس کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رسول اللہ صلی اللہ علیہ وسلم رات میں کس طرح قرآت کرتے تھے، جہری یا سری؟ تو انہوں نے کہا: آپ ہر طرح سے پڑھتے، کبھی جہراً پڑھتے، اور کبھی سرّاً پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "عقبہ بن عامر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو جہر سے قرآن پڑھتا ہے وہ اس شخص کی طرح ہے جو اعلان کر کے صدقہ کرتا ہے، اور جو آہستہ قرآن پڑھتا ہے وہ اس شخص کی طرح ہے جو چھپا کر چپکے سے صدقہ کرتا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "حذیفہ رضی اللہ عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ ایک رات نماز پڑھی تو آپ نے سورۃ البقرہ شروع کر دی، میں نے اپنے جی میں کہا کہ آپ سو آیت پر رکوع کریں گے لیکن آپ بڑھ گئے تو میں نے اپنے جی میں کہا کہ آپ دو سو آیت پر رکوع کریں گے لیکن آپ اس سے بھی آگے بڑھ گئے، تو میں نے اپنے جی میں کہا: آپ ایک ہی رکعت میں پوری سورۃ پڑھ ڈالیں گے، لیکن اس سے بھی آگے بڑھ گئے اور سورۃ نساء شروع کر دی، اور اسے پڑھ چکنے کے بعد سورۃ آل عمران شروع کر دی، اور پوری پڑھ ڈالی، آپ نے یہ پوری قرآت آہستہ آہستہ ٹھہر ٹھہر کر کی، اس طرح کہ جب آپ کسی ایسی آیت سے گزرتے جس میں اللہ تعالیٰ کی تسبیح ( پاکی ) کا ذکر ہوتا تو آپ اس کی پاکی بیان کرتے، اور جب کسی سوال کی آیت سے گزرتے تو اللہ تعالیٰ سے سوال کرتے، اور جب کسی پناہ کی آیت سے گزرتے تو اللہ تعالیٰ کی پناہ مانگتے، پھر آپ نے رکوع کیا، اور «‏ سبحان ربي العظيم» پاک ہے میرا رب جو عظیم ہے کہا، آپ کا رکوع تقریباً آپ کے قیام کے برابر تھا، پھر آپ نے اپنا سر اٹھایا، اور «سمع اللہ لمن حمده» کہا، آپ کا قیام تقریباً آپ کے رکوع کے برابر تھا، پھر آپ نے سجدہ کیا، اور سجدہ میں «سبحان ربي الأعلى» پاک ہے میرا رب جو اعلیٰ ہے پڑھ رہے تھے، اور آپ کا سجدہ تقریباً آپ کے رکوع کے برابر تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "حذیفہ رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان میں نماز پڑھی، تو آپ صلی اللہ علیہ وسلم نے رکوع کیا، اور یہ اتنا ہی لمبا تھا جتنا آپ کا قیام تھا، آپ نے اپنے رکوع میں «سبحان ربي العظيم‏» کہا، پھر آپ اتنی ہی دیر بیٹھے جتنی دیر کھڑے تھے، اور «رب اغفر لي رب اغفر لي» کہتے رہے، پھر آپ صلی اللہ علیہ وسلم نے اتنی دیر تک سجدہ کیا جتنی دیر تک آپ کھڑے تھے، اور «سبحان ربي الأعلى» کہتے رہے تو آپ نے صرف چار رکعتیں پڑھیں یہاں تک کہ بلال رضی اللہ عنہ صبح کی نماز کے لیے بلانے آ گئے۔ ابوعبدالرحمٰن نسائی کہتے ہیں: یہ حدیث میرے نزدیک مرسل ( منقطع ) ہے، میں نہیں جانتا کہ طلحہ بن یزید نے حذیفہ رضی اللہ عنہ سے کچھ سنا ہے، علاء بن مسیب کے علاوہ دوسرے لوگوں نے اس حدیث میں یوں کہا: «عن طلحۃ، عن رجل، عن حذیفۃ»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: رات اور دن کی نماز دو دو رکعت ہے ۱؎۔ ابوعبدالرحمٰن نسائی کہتے ہیں: میرے خیال میں اس حدیث میں غلطی ہوئی ہے ۲؎ واللہ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے رات کی نماز کے بارے میں پوچھا، تو آپ نے فرمایا: دو دو رکعت ہے، اور جب تمہیں خدشہ ہو تو ایک رکعت پڑھ لو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے، اور جب تجھے صبح ہو جانے کا خطرہ لاحق ہو تو ایک رکعت پڑھ کر وتر یعنی طاق کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کو میں نے منبر پر فرماتے سنا: آپ سے رات کی صلاۃ کے بارے میں پوچھا جا رہا تھا تو آپ نے فرمایا: وہ دو دو رکعت ہے، لیکن جب تمہیں صبح ہو جانے کا خطرہ لاحق ہو تو ایک رکعت سے وتر کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے رات کی نماز کے بارے میں پوچھا تو آپ نے فرمایا: دو دو رکعت ہے، لیکن اگر تم میں سے کوئی صبح ہو جانے کا خطرہ محسوس کرے، تو ایک رکعت پڑھ کر وتر کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے، اور جب تمہیں صبح ہو جانے کا اندیشہ ہو تو ایک رکعت پڑھ کر وتر کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ مسلمانوں میں سے ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا: رات کی نماز کیسے پڑھی جائے؟ تو آپ نے فرمایا: رات کی نماز دو دو رکعت ہے، پس جب تمہیں صبح ہو جانے کا خطرہ ہو تو ایک رکعت پڑھ کر وتر کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے رات کی نماز کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے، اور جب تمہیں صبح کا ہو جانے کا خدشہ ہو تو ایک رکعت پڑھ کر وتر کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ ایک شخص نے کھڑے ہو کر پوچھا: اللہ کے رسول! رات کی نماز کیسے پڑھی جائے؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے، اور جب تمہیں صبح ہو جانے کا خدشہ ہو تو ایک رکعت پڑھ کر وتر کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے وتر پڑھی، پھر فرمایا: اے اہل قرآن! وتر پڑھو ۱؎ کیونکہ اللہ تعالیٰ وتر ہے، اور وتر کو محبوب رکھتا ہے ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ وتر فرض نماز کی طرح کوئی حتمی و واجبی چیز نہیں ہے، البتہ وہ رسول اللہ صلی اللہ علیہ وسلم کی سنت ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میرے خلیل صلی اللہ علیہ وسلم نے مجھے تین باتوں کی وصیت کی ہے: وتر پڑھ کر سونے کی، ہر مہینہ تین دن کے روزے رکھنے کی، اور چاشت کی دونوں رکعتیں پڑھنے کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میرے خلیل صلی اللہ علیہ وسلم نے مجھے تین باتوں کی نصیحت کی: شروع رات میں وتر پڑھنے کی، فجر کی رکعت سنت پڑھنے کی ۱؎، اور ہر مہینہ تین دن کے روزے رکھنے کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "قیس بن طلق کہتے ہیں ہمارے والد طلق بن علی رضی اللہ عنہ نے رمضان میں ایک دن ہماری زیارت کی اور ہمارے ساتھ انہوں نے رات گزاری، ہمارے ساتھ اس رات نماز تہجد ادا کی، اور وتر بھی پڑھی، پھر وہ ایک مسجد میں گئے، اور اس مسجد والوں کو انہوں نے نماز پڑھائی یہاں تک کہ وتر باقی رہ گئی، تو انہوں نے ایک شخص کو آگے بڑھایا، اور اس سے کہا: انہیں وتر پڑھاؤ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ایک رات میں دو وتر نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "اسود بن یزید کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں پوچھا، تو انہوں نے کہا: آپ شروع رات میں سو جاتے، پھر اٹھتے اگر سحر ( صبح ) ہونے کو ہوتی تو وتر پڑھتے، پھر اپنے بستر پر آتے، اور اگر آپ کو خواہش ہوتی تو اپنی بیوی کے پاس آتے، پھر جب اذان سنتے تو جھٹ سے اٹھ کر کھڑے ہو جاتے، اگر جنبی ہوتے تو ( اپنے اوپر پانی ڈالتے ) یعنی غسل فرماتے، ورنہ وضو کرتے پھر نماز کو چلے جاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے شروع، اخیر اور بیچ رات سب میں وتر کی نماز پڑھی ہے، اور آخری عمر میں آپ کا وتر سحر ( صبح ) تک پہنچ گیا تھا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ جو رات کو نماز پڑھے تو وہ اپنی آخری نماز وتر کو بنائے، اس لیے کہ رسول اللہ صلی اللہ علیہ وسلم اسی کا حکم دیتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے وتر کے بارے میں پوچھا گیا، تو آپ نے فرمایا: وتر صبح ہونے ( فجر نکلنے ) سے پہلے پڑھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: وتر فجر نکلنے سے پہلے پڑھ لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "محمد بن منتشر کہتے ہیں کہ وہ عمرو بن شرحبیل کی مسجد میں تھے، کہ اتنے میں اقامت ہو گئی، تو لوگ ان کا انتظار کرنے لگے، وہ آئے اور کہا: میں وتر پڑھ رہا تھا، اور کہا: عبداللہ بن مسعود رضی اللہ عنہم سے پوچھا گیا: کیا اذان کے بعد وتر ہے، تو کہا: ہاں، اور اقامت کے بعد بھی ہے، اور انہوں نے بیان کیا کہ نبی اکرم صلی اللہ علیہ وسلم نماز سے سوئے رہ گئے یہاں تک کہ سورج نکل آیا، پھر آپ نے ( اٹھ کر ) نماز پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم سواری پر وتر پڑھ لیتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "نافع سے روایت ہے کہ ابن عمر رضی اللہ عنہم اپنے اونٹ پر وتر پڑھتے تھے، اور ذکر کرتے تھے کہ نبی اکرم صلی اللہ علیہ وسلم ایسا ہی کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "سعید بن یسار کہتے ہیں کہ ابن عمر رضی اللہ عنہم نے مجھ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم اونٹ پر وتر پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: وتر رات کے آخری حصہ میں ایک رکعت ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: وتر رات کے آخری حصہ میں ایک رکعت ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ دیہات والوں میں سے ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے رات کی نماز کے بارے میں پوچھا: تو آپ نے فرمایا: دو دو رکعت ہے، اور وتر رات کے آخری حصہ میں ایک رکعت ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے، پھر جب تم ختم کرنے کا ارادہ کرو تو ایک رکعت اور پڑھ لو، یہ جو تم نے پڑھی ہے سب کو ( طاق ) کر دے گی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز دو دو رکعت ہے، اور وتر ایک رکعت ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے رات کی نماز ( تہجد ) کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: رات کی نماز ( تہجد ) دو دو رکعت ہے، اور تم میں سے کسی کو جب صبح ہو جانے کا خدشہ ہو تو وہ ایک رکعت اور پڑھ لے یہ جو اس نے پڑھی ہے سب کو وتر ( طاق ) کر دے گی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: رات کی نماز ( تہجد ) دو دو رکعت ہے، تو جب تمہیں صبح ہو جانے کا ڈر ہو تو ایک رکعت پڑھ کر اسے وتر کر لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم رات کو گیارہ رکعت پڑھتے تھے، ان میں سے ایک رکعت وتر کی ہوتی تھی، پھر اپنے دائیں پہلو پر لیٹ جاتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "ابوسلمہ بن عبدالرحمٰن سے روایت ہے کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا: رمضان میں رسول اللہ صلی اللہ علیہ وسلم کی نماز کیسی ہوتی تھی؟ تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم رمضان میں اور غیر رمضان میں کسی میں گیارہ رکعت سے زیادہ نہیں پڑھتے تھے، آپ چار رکعت پڑھتے تو ان کا حسن اور ان کی طوالت نہ پوچھو ۱؎، پھر چار رکعت پڑھتے تو تم ان کا ( بھی ) حسن اور ان کی طوالت نہ پوچھو، پھر تین رکعت پڑھتے۔ عائشہ رضی اللہ عنہا کہتی ہیں: میں نے عرض کیا: اللہ کے رسول! کیا آپ وتر پڑھنے سے پہلے سوتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: عائشہ! میری آنکھیں سوتی ہیں، لیکن میرا دل نہیں سوتا ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر کی دو رکعتوں کے بعد سلام نہیں پھیرتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم وتر تین رکعت پڑھتے تھے، پہلی رکعت میں «سبح اسم ربك الأعلى‏» دوسری رکعت میں«قل يا أيها الكافرون» اور تیسری میں «قل هو اللہ أحد» پڑھتے، اور دعائے قنوت رکوع سے پہلے پڑھتے، پھر جب ( وتر سے ) فارغ ہو جاتے تو فراغت کے وقت تین بار: «سبحان الملك القدوس» کہتے، اور ان کے آخر میں کھینچتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم وتر کی پہلی رکعت میں «سبح اسم ربك الأعلى‏» دوسری رکعت میں «قل يا أيها الكافرون» اور تیسری میں «قل هو اللہ أحد» پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم وتر میں ( پہلی رکعت میں ) «سبح اسم ربك الأعلى‏» دوسری رکعت میں «قل يا أيها الكافرون» اور تیسری میں «قل هو اللہ أحد» پڑھتے، اور ان کے بالکل آخر ہی میں سلام پھیرتے، اور تین بار: «سبحان الملك القدوس» کہتے ( یعنی سلام پھیرنے کے بعد ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم تین رکعت وتر پڑھتے، پہلی میں «سبح اسم ربك الأعلى‏» دوسری میں «قل يا أيها الكافرون» اور تیسری میں «قل هو اللہ أحد» پڑھتے۔ زہیر نے اسے موقوفاً روایت کیا ہے، ( ان کی روایت اس کے بعد آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ وہ وتر کی تینوں رکعتوں میں «سبح اسم ربك الأعلى‏»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد» پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم رات کو اٹھے اور مسواک کی، پھر دو رکعت نماز پڑھی، پھر سو گئے، ( دوبارہ ) آپ پھر اٹھے، اور مسواک کی، پھر وضو کیا، اور دو رکعت نماز پڑھی یہاں تک کہ آپ نے چھ رکعتیں پڑھیں، پھر تین رکعتیں وتر کی اور دو رکعتیں ( فجر کی ) پڑھیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس تھا، آپ نیند سے بیدار ہوئے، آپ نے وضو کیا، مسواک کی، آپ یہ آیت پڑھ رہے تھے: «إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب» آسمانوں اور زمین کی پیدائش میں اور رات دن کے ہیر پھیر میں یقیناً عقل مندوں کے لیے نشانیاں ہیں ( آل عمران: ۱۹۰ ) یہاں تک کہ آپ اس سے فارغ ہوئے، پھر آپ نے دو رکعتیں پڑھیں، پھر آپ واپس آئے، اور سو گئے یہاں تک کہ میں نے آپ کے خراٹے کی آواز سنی، پھر آپ اٹھے، اور وضو کیا، مسواک کی، پھر دو رکعت نماز پڑھی، اور تین رکعت وتر پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم بیدار ہوئے تو آپ نے مسواک کی، پھر راوی نے پوری حدیث بیان کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رات کو آٹھ رکعتیں پڑھتے، اور تین رکعت وتر پڑھتے، اور دو رکعت فجر کی نماز سے پہلے پڑھتے۔ عمرو بن مرہ نے حبیب کی مخالفت کی ہے، انہوں نے اسے یحییٰ بن الجزار سے اور یحییٰ جزار نے ام سلمہ رضی اللہ عنہا سے، اور ام سلمہ رضی اللہ عنہا نے رسول صلی اللہ علیہ وسلم سے روایت کی ہے، ( یعنی اس کو مسند ابن عباس رضی اللہ عنہم کے بجائے مسند ام سلمہ رضی اللہ عنہا میں سے قرار دیا ہے۔)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم تیرہ رکعت وتر پڑھتے تھے، پھر جب آپ بوڑھے اور کمزور ہو گئے تو آپ نو رکعت وتر پڑھنے لگے۔ عمارہ بن عمیر نے عمرو کی مخالفت کی ہے، انہوں نے اسے یحییٰ بن جزار سے اور یحییٰ بن جزار نے عائشہ رضی اللہ عنہا سے روایت کی ہے۔ ( یعنی عمارہ بن عمیر نے اس کو مسند ام سلمہ کی بجائے مسند عائشہ رضی اللہ عنہا میں سے قرار دیا ہے۔)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رات کو نو رکعتیں پڑھتے تھے، جب آپ بوڑھے اور ( گوشت چڑھ جانے کی وجہ سے ) بھاری بھر کم ہو گئے تو ( صرف ) سات رکعتیں پڑھنے لگے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "دوید بن نافع نے زہری سے، اور زہری نے عطاء بن یزید سے اور عطاء بن یزید نے ابوایوب رضی اللہ عنہ سے روایت کی ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: وتر حق ہے، جو چاہے سات رکعت پڑھے، جو چاہے پانچ پڑھے، جو چاہے تین پڑھے، اور جو چاہے ایک پڑھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "اوزاعی نے زہری سے اور زہری نے عطاء بن یزید سے اور عطاء نے ابوایوب رضی اللہ عنہ سے روایت کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وتر حق ہے، جو چاہے پانچ پڑھے، جو چاہے تین پڑھے اور جو چاہے ایک پڑھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "ابومعید نے زہری سے اور زہری نے عطاء بن یزید سے روایت کی ہے کہ انہوں نے ابوایوب انصاری رضی اللہ عنہ کو کہتے سنا: وتر حق ہے، جو پانچ رکعت پڑھنا چاہے وہ پانچ پڑھے، جو تین پڑھنا چاہے وہ تین پڑھے، اور جو ایک پڑھنا چاہے ایک پڑھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "سفیان زھری سے روایت کرتے ہیں، اور زہری عطاء بن یزید سے، اور عطاء ابوایوب سے، ابوایوب رضی اللہ عنہ کہتے ہیں جو چاہے وتر سات رکعت پڑھے، جو چاہے پانچ پڑھے، جو چاہے تین پڑھے، اور جو چاہے ایک پڑھے، اور جو اشارے سے پڑھنا چاہے اشارے سے پڑھے ( یعنی بیمار آدمی ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "منصور روایت کرتے ہیں حکم سے، اور وہ مقسم سے اور مقسم ام المؤمنین ام سلمہ رضی اللہ عنہا سے وہ کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم پانچ یا سات رکعت وتر پڑھتے، اور ان کے درمیان آپ سلام کے ذریعہ فصل نہیں کرتے تھے اور نہ کلام کے ذریعہ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "منصور حکم سے روایت کرتے ہیں، اور وہ مقسم سے اور مقسم ابن عباس رضی اللہ عنہم سے اور ابن عباس رضی اللہ عنہم ام سلمہ رضی اللہ عنہا سے وہ کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سات یا پانچ رکعت وتر پڑھتے تھے، اور ان کے درمیان سلام کے ذریعہ فصل نہیں کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "سفیان بن الحسین حکم سے روایت کرتے ہیں، اور وہ مقسم سے، مقسم کہتے ہیں کہ وتر سات رکعت ہے اور پانچ سے کم نہیں، میں نے یہ بات ابراہیم سے ذکر کی، تو انہوں نے کہا: انہوں نے اسے کس کے واسطہ سے ذکر کیا ہے؟ تو میں نے کہا: مجھے نہیں معلوم، حکم کہتے ہیں: پھر میں حج کو گیا تو میں نے مقسم سے ملاقات کی، اور ان سے پوچھا کہ یہ بات آپ نے کس سے سنی ہے؟ تو انہوں نے کہا: ایک ثقہ شخص سے ۱؎، اور اس نے عائشہ رضی اللہ عنہا اور میمونہ رضی اللہ عنہا سے سنی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Maqtu"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم پانچ رکعت وتر پڑھتے تھے، اور ان کے آخر ہی میں بیٹھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم بوڑھے ہو گئے، اور بدن پر گوشت چڑھ گیا، تو آپ سات رکعت پڑھنے لگے، اور صرف ان کے آخر میں قعدہ کرتے تھے، پھر سلام پھیرنے کے بعد بیٹھ کر دو رکعت اور پڑھتے تو میرے بیٹے یہ نو رکعتیں ہوئیں، اور رسول اللہ صلی اللہ علیہ وسلم جب کوئی صلاۃ پڑھتے تو چاہتے کہ اس پر مداومت کریں، ( یہ حدیث مختصر ہے ) ۔ ہشام دستوائی نے شعبہ کی مخالفت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب نو رکعت وتر پڑھتے تو صرف آٹھویں رکعت میں قعدہ کرتے، اللہ کی حمد کرتے، اس کا ذکر کرتے اور دعا کرتے، پھر کھڑے ہو جاتے، اور سلام نہیں پھیرتے، پھر نویں رکعت پڑھتے، پھر بیٹھتے تو اللہ عزوجل کا ذکر کرتے، دعا کرتے، پھر ایک سلام پھیرتے جو ہمیں سناتے، پھر بیٹھ کر دو رکعت پڑھتے، پھر جب آپ بوڑھے اور کمزور ہو گئے تو سات رکعت وتر پڑھنے لگے، صرف چھٹی میں قعدہ کرتے، پھر بغیر سلام پھیرے کھڑے ہو جاتے، اور ساتویں رکعت پڑھتے، پھر ایک سلام پھیرتے، پھر بیٹھے بیٹھے دو رکعت پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے لیے مسواک اور وضو کا پانی تیار کر کے رکھ دیا کرتے تھے، پھر جب اللہ تعالیٰ کو جگانا منظور ہوتا تورات میں آپ کو جگا دیتا، آپ مسواک کرتے ( پھر ) وضو کرتے اور نو رکعتیں پڑھتے، ان میں صرف آٹھویں رکعت پر بیٹھتے، اور اللہ کی حمد کرتے، اور اس کے نبی کریم صلی اللہ علیہ وسلم پر نماز ( درود و رحمت ) بھیجتے، اور ان کے درمیان دعائیں کرتے، اور کوئی سلام نہ پھیرتے، پھر نویں رکعات پڑھتے اور قعدہ کرتے، راوی نے اس طرح کی کوئی بات ذکر کی کہ آپ اللہ کی حمد کرتے، اس کے نبی کریم صلی اللہ علیہ وسلم پر نماز ( درود و رحمت ) بھیجتے، اور دعا کرتے، پھر سلام پھیرتے جسے ہمیں سناتے، پھر بیٹھے بیٹھے دو رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "سعد بن ہشام بن عامر کہتے ہیں کہ وہ ابن عباس رضی اللہ عنہم کے پاس آئے، اور ان سے رسول اللہ صلی اللہ علیہ وسلم کے وتر کے بارے میں سوال کیا، تو انہوں نے کہا: کیا میں تمہیں اس ہستی کو نہ بتاؤں یا اس ہستی کی خبر نہ دوں جو رسول اللہ صلی اللہ علیہ وسلم کے وتر کو زمین والوں میں سب سے زیادہ جانتی ہے؟ میں نے پوچھا: وہ کون ہے؟ انہوں نے کہا: وہ ام المؤمنین عائشہ رضی اللہ عنہا ہیں، تو ہم ان کے پاس آئے، اور ہم نے انہیں سلام کیا، اور ہم اندر گئے، اور اس بارے میں میں نے ان سے پوچھا، میں نے کہا: رسول اللہ صلی اللہ علیہ وسلم کے وتر کے بارے میں بتائیے تو انہوں نے کہا: ہم آپ کے لیے آپ کی مسواک اور آپ کے وضو کا پانی تیار کر کے رکھ دیتے، پھر رات کو جب اللہ تعالیٰ کو جگانا منظور ہوتا آپ کو جگا دیتا، آپ مسواک کرتے اور وضو کرتے، پھر نو رکعتیں پڑھتے، سوائے آٹھویں کے ان میں سے کسی میں قعدہ نہیں کرتے، اللہ کی حمد کرتے اس کا ذکر کرتے، اور دعا مانگتے، پھر بغیر سلام پھیرے کھڑے ہو جاتے، پھر نویں رکعت پڑھتے، پھر بیٹھتے تو اللہ کی حمد اور اس کا ذکر کرتے اور دعا کرتے، پھر سلام پھیرتے جسے آپ ہمیں سناتے، پھر بیٹھے بیٹھے دو رکعتیں پڑھتے، میرے بیٹے! اس طرح یہ گیارہ رکعتیں ہوتی تھیں، لیکن جب آپ بوڑھے ہو گئے اور آپ کے جسم پر گوشت چڑھ گیا تو آپ وتر سات رکعت پڑھنے لگے، پھر سلام پھیرنے کے بعد بیٹھے بیٹھے دو رکعتیں پڑھتے، اس طرح میرے بیٹے! یہ کل نو رکعتیں ہوتی تھیں، اور رسول اللہ صلی اللہ علیہ وسلم جب کوئی نماز پڑھتے تو چاہتے کہ اس پر مداومت کریں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نو رکعت وتر پڑھتے تھے، پھر دو رکعت بیٹھ کر پڑھتے، تو جب آپ کمزور ہو گئے تو سات رکعت وتر پڑھنے لگے، پھر دو رکعت بیٹھ کر پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نو رکعت وتر پڑھتے تھے، اور دو رکعت بیٹھ کر پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "سعد بن ہشام سے روایت ہے کہ وہ ام المؤمنین عائشہ رضی اللہ عنہا کے پاس آئے، اور انہوں نے ان سے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے متعلق پوچھا، تو انہوں نے بتایا: آپ رات کو آٹھ رکعتیں پڑھتے، اور نویں رکعت کے ذریعہ اسے وتر کر لیتے، پھر آپ بیٹھ کر دو رکعت پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رات کو نو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم رات کو گیارہ رکعت پڑھتے، اور آپ ایک کے ذریعہ اسے وتر کر لیتے، پھر آپ اپنے داہنے پہلو پر لیٹ جاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم تیرہ رکعت وتر پڑھتے تھے، پھر جب آپ بوڑھے اور ضعیف ہو گئے تو نو رکعت پڑھنے لگے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "ابومجلز سے روایت ہے کہ ابوموسیٰ اشعری مکہ اور مدینے کے درمیان تھے، کہ انہوں نے عشاء کی نماز دو رکعت پڑھی، پھر وہ کھڑے ہوئے اور انہوں نے ایک رکعت وتر پڑھی، اس میں انہوں نے سورۃ نساء کی سو آیتیں پڑھیں، پھر کہا: میں نے اپنے دونوں قدموں کو اس جگہ رکھنے میں جہاں رسول اللہ صلی اللہ علیہ وسلم نے رکھے تھے، اور ان آیتوں کے پڑھنے میں جنہیں رسول اللہ صلی اللہ علیہ وسلم نے پڑھی تھی کوئی کوتاہی نہیں کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى» اور «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے، پھر جب آپ سلام پھیرتے تو تین بار «سبحان الملك القدوس» کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "ابی بن کعب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى» اور «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے تھے۔ ان دونوں کی یعنی زبید اور طلحہ کی حصین نے مخالفت کی ہے، انہوں نے اسے ذر سے، ذر نے ابن عبدالرحمٰن بن ابزی سے انہوں نے اپنے والد عبدالرحمٰن بن ابزی رضی اللہ عنہ سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى» اور «قل يا أيها الكافرون» اور«قل هو اللہ أحد‏» پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى» اور «قل يا أيها الكافرون» اور«قل هو اللہ أحد‏» پڑھتے تھے، اور جب سلام پھیرتے تھے، تو «سبحان الملك القدوس» تین بار کہتے، اور تیسری بار اپنی آواز بلند کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى» اور «قل يا أيها الكافرون» اور«قل هو اللہ أحد‏» پڑھتے تھے، اور جب سلام پھیرتے، تو «سبحان الملك القدوس» کہتے، اور تیسری بار «سبحان الملك القدوس» کہتے وقت اپنی آواز بلند کرتے تھے۔ منصور نے اسے سلمہ بن کہیل سے روایت کیا ہے، اور اس میں انہوں نے ذر کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "عبدالرحمٰن بن ابزی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے تھے، اور جب سلام پھیر کر فارغ ہو جاتے تو تین بار «سبحان الملك القدوس» کہتے، اور تیسری بار کھینچ کر کہتے تھے۔ نیز اسے عبدالملک بن ابی سلیمان نے زبید سے روایت کیا ہے، اور انہوں نے بھی ذر کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے تھے۔ نیز محمد بن جحادہ نے اسے زبید سے روایت کیا ہے، اور انہوں نے بھی ذر کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "عبدالرحمٰن بن ابزیٰ کہتے ہیں کہ رسول اللہ وتر میں «‏سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے، اور جب نماز سے فارغ ہو جاتے تو تین بار «سبحان الملك القدوس» کہتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "عبدالرحمٰن بن ابزیٰ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏»پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "اس سند سے (سعید بن عبدالرحمٰن) بن ابزیٰ نے یہ حدیث مرسلاً ( یعنی سند میں انقطاع کے ساتھ ) روایت کی ہے، لیکن اسے عطا بن سائب نے سعید بن عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کے واسطے سے عبدالرحمٰن بن ابزیٰ سے متصلاً روایت کی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "عبدالرحمٰن بن ابزیٰ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "سعید بن عبدالرحمٰن بن ابزیٰ اپنے باپ سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے تھے پھر جب فارغ ہو جاتے تو تین بار «سبحان الملك القدوس» کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد‏» پڑھتے تھے، اور جب فارغ ہو جاتے تو تین بار «سبحان الملك القدوس» کہتے، اور تیسری مرتبہ کھینچ کر کہتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «‏سبح اسم ربك الأعلى» پڑھتے تھے۔ شبابہ نے ان دونوں کی یعنی محمد کی اور ابوداؤد کی مخالفت کی ہے ۱؎ انہوں نے اسے شعبہ سے، شعبہ نے قتادہ سے، قتادہ نے زرارہ بن اوفی سے، اور زرارہ نے عمران بن حصین رضی اللہ عنہما سے روایت کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "عمران بن حصین رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے وتر میں «‏سبح اسم ربك الأعلى» پڑھی۔ ابوعبدالرحمٰن نسائی کہتے ہیں: مجھے نہیں معلوم کہ کسی نے اس حدیث میں شبابہ کی متابعت کی ہے، یحییٰ بن سعید نے ان کی مخالفت کی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ظہر کی نماز پڑھی، تو ایک شخص نے سورۃ «‏سبح اسم ربك الأعلى» پڑھی، تو جب آپ نماز پڑھ چکے تو آپ نے پوچھا: «‏سبح اسم ربك الأعلى» کس نے پڑھی ہے؟ تو ایک شخص نے عرض کیا: میں نے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: مجھے ایسا لگا کہ تم میں سے کسی نے مجھے خلجان میں ڈال دیا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "حسن رضی اللہ عنہ کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے کچھ کلمات سکھائے جنہیں میں وتر کی کی قنوت میں کہتا ہوں، وہ یہ ہیں: «اللہم اهدني فيمن هديت وعافني فيمن عافيت وتولني فيمن توليت وبارك لي فيما أعطيت وقني شر ما قضيت إنك تقضي ولا يقضى عليك وإنه لا يذل من واليت تباركت ربنا وتعاليت» اے اللہ! مجھے ہدایت دے، ان لوگوں میں شامل کر کے جنہیں تو نے ہدایت دی ہے، عافیت دے ان لوگوں میں شامل کر کے جنہیں تو نے عافیت دی ہے، میری نگہبانی فرمان لوگوں میں شامل کر کے جن کی تو نے نگہبانی فرمائی، اور جو تو نے دیا ہے اس میں میرے لیے برکت عطا فرما، اور جس کا تو نے فیصلہ فرما دیا ہے اس کی برائی سے مجھے بچا، اس لیے کہ تو ہی فیصلہ کرتا ہے، اور تیرے خلاف کوئی فیصلہ نہیں کیا جا سکتا، اور تو جس سے دوستی کرے وہ ذلیل نہیں ہو سکتا، اے ہمارے رب! تو برکت والا اور بلند و بالا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "حسن بن علی رضی اللہ عنہم کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے وتر کے یہ کلمات سکھائے، آپ نے فرمایا: کہو: «اللہم اهدني فيمن هديت وبارك لي فيما أعطيت وتولني فيمن توليت وقني شر ما قضيت فإنك تقضي ولا يقضى عليك وإنه لا يذل من واليت تباركت ربنا وتعاليت وصلى اللہ على النبي محمد»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "علی بن ابی طالب رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم اپنی وتر کے آخر میں یہ کلمات کہتے تھے: «اللہم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك» اے اللہ! میں تیری خوشی کی تیرے غصے سے پناہ مانگتا ہوں، تیرے بچاؤ کی تیری پکڑ سے پناہ مانگتا ہوں، اور میں تیری پناہ مانگتا ہوں تجھ سے، میں تیری تعریف نہیں کر سکتا تو ویسے ہی ہے جیسے تو نے خود اپنی تعریف کی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": 1748,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم اپنے دونوں ہاتھ استسقاء کے علاوہ کسی دعا میں نہیں اٹھاتے تھے۔ شعبہ کہتے ہیں: میں نے ثابت سے پوچھا: آپ نے اسے انس رضی اللہ عنہ سے سنا ہے؟ تو انہوں نے کہا: سبحان اللہ، میں نے کہا: آپ نے اسے سنا ہے؟ انہوں نے کہا: سبحان اللہ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رات میں عشاء کی نماز سے فارغ ہونے سے لے کر فجر ہونے تک فجر کی دو رکعتوں کے علاوہ گیارہ رکعتیں پڑھتے تھے، اور اتنا لمبا سجدہ کرتے کہ تم میں سے کوئی پچاس آیتوں کے بقدر پڑھ لے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم وتر میں «سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد» پڑھتے تھے، اور سلام پھیرنے کے بعد «سبحان الملك القدوس» تین بار کہتے، اور اس کے ساتھ اپنی آواز بلند کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد» پڑھتے تھے، اور سلام پھیرنے کے بعد «سبحان الملك القدوس» تین بار کہتے، اور اس کے ذریعہ اپنی آواز بلند کرتے۔ ابونعیم نے ان دونوں کی یعنی قاسم اور محمد بن عبید کی مخالفت کی ہے، چنانچہ انہوں نے اسے سفیان سے، اور سفیان نے زبید سے، زبید نے ذر سے، اور ذر نے سعید بن عبدالرحمٰن ابزیٰ سے روایت کیا ہے، ( یعنی سند میں ایک راوی ذر کا اضافہ کیا ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد» پڑھتے تھے، اور جب واپس ہونے کا ارادہ کرتے تو «سبحان الملك القدوس» تین مرتبہ کہتے، اور اس کے ذریعہ اپنی آواز بلند کرتے۔ ابوعبدالرحمٰن نسائی کہتے ہیں: ابونعیم ہمارے نزدیک محمد بن عبید اور قاسم بن یزید سے زیادہ ثقہ ہیں، اور ہمارے نزدیک سفیان ثوری کے تلامذہ میں سب سے زیادہ معتبر یحییٰ بن سعید قطان ہیں، پھر عبداللہ بن مبارک، پھر وکیع بن جراح، پھر عبدالرحمٰن بن مہدی، پھر ابونعیم، پھر اسود ہیں، واللہ اعلم، نیز اسے جریر بن حازم نے زبید سے روایت کیا، تو انہوں نے کہا کہ آپ تیسری بار میں اپنی آواز کھینچتے اور بلند کرتے تھے، ( جریر کی روایت آگے آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد» پڑھتے تھے، اور جب سلام پھیرتے تو تین بار «سبحان الملك القدوس» کہتے، اور تیسری بار میں آواز کھینچتے اور بلند کرتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "عبدالرحمٰن بن ابزیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم وتر میں «سبح اسم ربك الأعلى»، «قل يا أيها الكافرون» اور «قل هو اللہ أحد» پڑھتے تھے، اور جب فارغ ہوتے تو «سبحان الملك القدوس» کہتے۔ ہشام نے اسے مرسلاً روایت کیا، ان کی روایت آگے آ رہی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "سعید بن عبدالرحمٰن بن ابزیٰ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم وتر پڑھتے تھے، پھر راوی نے پوری حدیث بیان کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "یحییٰ بن ابی کثیر کہتے ہیں کہ مجھے ابوسلمہ بن عبدالرحمٰن نے خبر دی ہے کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز کے بارے میں پوچھا، تو انہوں نے کہا: آپ صلی اللہ علیہ وسلم تیرہ رکعت پڑھتے تھے، نو رکعت کھڑے ہو کر، اس میں وتر بھی ہوتی اور دو رکعت بیٹھ کر، تو جب آپ رکوع کرنے کا ارادہ کرتے تو کھڑے ہو جاتے، اور رکوع اور سجدہ کرتے، اور ایسا آپ وتر کے بعد کرتے تھے، پھر جب آپ فجر کی اذان سنتے تو کھڑے ہوتے، اور دو ہلکی ہلکی رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم ظہر سے پہلے کی چار رکعتیں اور فجر سے پہلے کی دو رکعتیں نہیں چھوڑتے تھے۔ شعبہ کے جن تلامذہ نے اس حدیث کو روایت کیا ہے ان میں سے اکثر نے عثمان بن عمر کی مخالفت کی ہے، ان لوگوں نے مسروق کا ذکر نہیں کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "ابراہیم بن محمد سے روایت ہے کہ انہوں نے اپنے والد کو بیان کرتے سنا کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم ظہر سے پہلے کی چار رکعتیں، اور فجر سے پہلے کی دو رکعتیں نہیں چھوڑتے تھے۔ ابو عبدالرحمٰن ( نسائی ) کہتے ہیں: ہمارے نزدیک صحیح یہی ہے، اور عثمان بن عمر کی ( پچھلی ) روایت غلط ہے، واللہ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: فجر کی دونوں رکعتیں دنیا ومافیہا سے بہتر ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ جب صبح کی نماز کی اذان دی جاتی تو رسول اللہ صلی اللہ علیہ وسلم اس سے پہلے کہ نماز کھڑی ہو ہلکی ہلکی دو رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ مجھے ام المؤمنین حفصہ رضی اللہ عنہا نے خبر دی ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب فجر روشن ہو جاتی تو دو رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ جب مؤذن فجر کی پہلی اذان کہہ کر خاموش ہو جاتا تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوتے، اور فجر نمودار ہونے کے بعد فجر کی نماز سے پہلے ہلکی ہلکی دو رکعتیں پڑھتے، پھر اپنے داہنے پہلو پر لیٹ جاتے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم کہتے ہیں کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: فلاں کی طرح مت ہو جانا، وہ رات میں قیام کرتا تھا ( تہجد پڑھتا تھا ) ، پھر اس نے رات کا قیام چھوڑ دیا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اے عبداللہ! فلاں کی طرح مت ہو جانا، پہلے وہ قیام اللیل کرتا تھا ( تہجد پڑھتا تھا ) ، پھر اس نے چھوڑ دیا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم فجر کی دو ہلکی رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ مجھ سے ام المؤمنین حفصہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نماز فجر کی اذان اور اقامت کے درمیان ہلکی ہلکی دو رکعتیں پڑھتے تھے۔ ابوعبدالرحمٰن نسائی کہتے ہیں: دونوں حدیثیں ہمارے نزدیک غلط ہیں ۱؎ واللہ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اذان اور نماز کے درمیان ہلکی ہلکی دو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم اذان اور اقامت کے درمیان ہلکی ہلکی دو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کا بیان ہے کہ ام المؤمنین حفصہ رضی اللہ عنہا نے ان سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم اذان اور اقامت کے درمیان ہلکی ہلکی دو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ مجھے ام المؤمنین حفصہ رضی اللہ عنہا نے خبر دی ہے کہ رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز سے پہلے دو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا سے روایت ہے کہ جب فجر کی اذان کہہ دی جاتی تو رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز سے پہلے دو سجدے کرتے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب مؤذن خاموش ہو جاتا تو دو ہلکی رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب مؤذن صبح کی نماز کی اذان کہہ کر خاموش ہو جاتا، اور صبح نمودار ہو جاتی، تو نماز کھڑی ہونے سے پہلے ہلکی ہلکی دو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ مجھ سے میری بہن حفصہ رضی اللہ عنہا نے بیان کیا کہ آپ فجر سے پہلے دو ہلکی رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب فجر طلوع ہو جاتی تو دو رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ جب فجر طلوع ہو جاتی تو رسول اللہ صلی اللہ علیہ وسلم سوائے دو ہلکی رکعتوں کے کچھ اور نہیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب فجر کی اذان دے دی جاتی تو نماز کے لیے کھڑے ہونے سے پہلے ہلکی ہلکی دو رکعتیں پڑھتے۔ اور سالم نے بھی ابن عمر رضی اللہ عنہم سے، اور انہوں نے حفصہ رضی اللہ عنہا سے روایت کی ہے، ( ان کی روایت آگے آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ ام المؤمنین حفصہ رضی اللہ عنہا نے مجھے خبر دی ہے کہ رسول اللہ صلی اللہ علیہ وسلم فجر سے پہلے دو رکعتیں پڑھتے تھے اور یہ فجر طلوع ہو جانے کے بعد پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "ام المؤمنین حفصہ رضی اللہ عنہا کہتی ہیں کہ جب فجر روشن ہو جاتی تو رسول اللہ صلی اللہ علیہ وسلم دو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم فجر کی اذان اور اقامت کے درمیان ہلکی ہلکی دو رکعتیں پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "ابوسلمہ سے روایت ہے کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز کے بارے میں پوچھا؟ تو انہوں نے کہا: آپ تیرہ رکعتیں پڑھتے، پہلے آٹھ رکعتیں پڑھتے، پھر ( ایک رکعت ) وتر پڑھتے، پھر دو رکعت بیٹھ کر پڑھتے، اور جب رکوع کرنا چاہتے تو کھڑے ہو جاتے، اور رکوع کرتے، اور دو رکعتیں صبح کی نماز کی اذان اور اقامت کے درمیان پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم جب اذان سنتے تو فجر کی دو رکعتیں پڑھتے، اور انہیں ہلکی پڑھتے تھے۔ ابوعبدالرحمٰن نسائی کہتے ہیں: یہ حدیث منکر ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "سائب بن یزید رضی اللہ عنہ کہتے ہیں کہ شریح حضرمی کا ذکر رسول اللہ صلی اللہ علیہ وسلم کے پاس کیا گیا تو آپ نے فرمایا: وہ قرآن کو تکیہ نہیں بناتے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "سعید بن جبیر ایک ایسے شخص سے روایت کرتے ہیں جو ان کے نزدیک پسندیدہ ہے اس نے انہیں خبر دی کہ ام المؤمنین عائشہ رضی اللہ عنہا نے انہیں خبر دی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو بھی آدمی رات کو تہجد پڑھا کرتا ہو، پھر کسی دن نیند کی وجہ سے وہ نہ پڑھ سکے تو اللہ تعالیٰ اس کے لیے اس کی نماز کا اجر لکھ دیتا ہے، اور اس کی نیند اس پر صدقہ ہوتی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی رات میں کسی نماز کا عادی ہو، اور کسی رات وہ نیند کی وجہ سے اسے نہ پڑھ سکے، تو یہ اس پر اللہ کی طرف سے کیا ہوا صدقہ ہو گا، اور وہ اس کے لیے اس کی نماز کا اجر لکھے گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پھر انہوں نے اسی طرح کی حدیث ذکر کی۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: ابو جعفر رازی حدیث میں قوی نہیں ہیں، ( اسی لیے سند میں سے ایک راوی اسود کو ساقط کر دیا ہے ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "ابو الدرداء رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو بستر پر آئے، اور وہ رات میں قیام کی نیت رکھتا ہو، پھر اس کی دونوں آنکھیں اس پر غالب آ جائیں یہاں تک کہ صبح ہو جائے تو اس کے لیے اس کی نیت کا ثواب لکھا جائے گا، اور اس کی نیند اس کے رب عزوجل کی جانب سے اس پر صدقہ ہو گی ۔ سفیان ثوری نے حبیب بن ابی ثابت کی مخالفت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "اور سفیان ثوری (کی حبیب بن ابی ثابت سے مخالفت یہ ہے کہ انہوں) نے اس سند سے یہ حدیث ابوذر اور ابو الدرداء رضی اللہ عنہم سے موقوفاً روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب رات کو نماز نہیں پڑھ پاتے خواہ نیند نے آپ کو اس سے روکا ہو یا کسی تکلیف نے تو دن کو آپ بارہ رکعتیں پڑھتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو کوئی رات کو اپنے وظیفہ سے، یا اس کی کسی چیز سے سو جائے، پھر وہ اسے فجر سے لے کر ظہر تک کے درمیان پڑھ لے، تو اس کے لیے یہی لکھا جائے گا کہ گویا اس نے اسے رات ہی میں پڑھا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں جو کوئی رات کو اپنا وظیفہ پڑھے بغیر سو جائے، پھر وہ صبح سے ظہر تک کے درمیان کسی بھی وقت اسے پڑھ لے، تو گویا اس نے اسے رات ہی میں پڑھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "عمر بن خطاب رضی اللہ عنہ کہتے ہیں جس کا رات کا وظیفہ چھوٹ جائے، اور وہ سورج ڈھلنے سے لے کر نماز ظہر تک کسی بھی وقت اسے پڑھ لے، تو اس کا وظیفہ نہیں چھوٹا، یا گویا اس نے اپنا وظیفہ پا لیا۔ اسے حمید بن عبدالرحمٰن نے موقوفاً ( یعنی: مقطوعا ) روایت کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "حمید بن عبدالرحمٰن کہتے ہیں جس کا رات کا وظیفہ چھوٹ جائے، تو اسے چاہیئے کہ وہ ظہر سے پہلے کسی نماز میں اسے پڑھ لے، کیونکہ یہ رات کی نماز کے برابر ہو گا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو دن رات میں بارہ رکعتوں پر مداومت کرے گا، وہ جنت میں داخل ہو گا: چار رکعتیں ظہر سے پہلے، دو رکعتیں اس کے بعد، دو رکعتیں مغرب کے بعد، دو رکعتیں عشاء کے بعد اور دو رکعتیں فجر سے پہلے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو شخص پابندی سے بارہ رکعتوں پر مداومت کرے گا، اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا: چار رکعتیں ظہر سے پہلے، دو رکعتیں اس کے بعد، دو رکعتیں مغرب کے بعد، دو رکعتیں عشاء کے بعد، اور دو رکعتیں فجر سے پہلے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "ام المؤمنین ام حبیبہ بنت ابی سفیان رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جس نے فرض کے علاوہ دن رات میں بارہ رکعتیں پڑھیں، اللہ تعالیٰ اس کی وجہ سے اس کے لیے جنت میں ایک گھر بنائے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "ابن جریج کہتے ہیں کہ میں نے عطا سے کہا: مجھے یہ بات پہنچی ہے کہ آپ جمعہ سے پہلے بارہ رکعتیں پڑھتے ہیں۔ اس سلسلے میں آپ کو کیا معلوم ہوا ہے؟ انہوں نے کہا: مجھے خبر دی گئی ہے کہ ام حبیبہ رضی اللہ عنہا نے عنبسہ بن ابی سفیان سے بیان کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا ہے: جس نے رات دن میں فرض کے علاوہ بارہ رکعتیں پڑھیں، تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جس نے ایک دن میں بارہ رکعتیں پڑھیں، اللہ عزوجل اس کے لیے جنت میں ایک گھر بنائے گا ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں کہ عطا نے اسے عنبسہ سے نہیں سنا ہے ( اس کی دلیل آگے آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "یعلیٰ بن امیہ کہتے ہیں کہ میں طائف آیا، تو عنبسہ بن ابی سفیان کے پاس گیا، اور وہ مرنے کے قریب تھے، میں نے انہیں دیکھا کہ وہ گھبرائے ہوئے ہیں، میں نے کہا: آپ تو اچھے آدمی ہیں، اس پر انہوں نے کہا مجھے میری بہن ام حبیبہ رضی اللہ عنہا نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے دن یا رات میں بارہ رکعتیں پڑھیں، تو اللہ تعالیٰ اس کے لیے جنت میں گھر بنائے گا ۔ ابویونس قشیری نے ان لوگوں کی جنہوں نے اسے عطا سے روایت کی ہے مخالفت کی ہے، ( ان کی روایت آگے آ رہی ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "ام المؤمنین ام حبیبہ بنت ابی سفیان رضی اللہ عنہم کہتی ہیں کہ جس نے ایک دن میں بارہ رکعتیں ظہر سے پہلے پڑھیں، تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بارہ رکعتیں ہیں، جو انہیں پڑھے گا، اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا: چار رکعتیں ظہر سے پہلے، دو رکعتیں ظہر کے بعد، دو رکعتیں عصر سے پہلے، دو رکعتیں مغرب کے بعد، اور دو رکعتیں نماز فجر سے پہلے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے بارہ رکعتیں پڑھیں، اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا: چار رکعتیں ظہر سے پہلے، دو اس کے بعد، دو عصر سے پہلے، دو مغرب کے بعد اور دو صبح سے پہلے ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: فلیح بن سلیمان زیادہ قوی نہیں ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ جس نے دن اور رات میں فرض کے علاوہ بارہ رکعتیں پڑھیں تو اس کے لیے جنت میں ایک گھر بنایا جائے گا: چار ظہر سے پہلے، اور دو رکعتیں اس کے بعد، دو عصر سے پہلے، دو مغرب کے بعد، اور دو فجر سے پہلے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے دن اور رات میں بارہ رکعتیں پڑھیں، اس کے لیے جنت میں ایک گھر بنایا جائے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں جس نے رات اور دن میں فرض کے علاوہ بارہ رکعتیں پڑھیں، اس کے لیے جنت میں ایک گھر بنایا جائے گا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں جس نے دن اور رات میں فرض کے علاوہ بارہ رکعتیں پڑھیں، تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا۔ حصین نے اسے مرفوع نہیں کیا ہے، اور عنبسہ اور مسیب کے درمیان انہوں نے ذکوان کو داخل کر دیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "ابوصالح ذکوان کہتے ہیں کہ عنبسہ بن ابی سفیان نے مجھ سے بیان کیا کہ ام حبیبہ رضی اللہ عنہا نے ان سے بیان کیا ہے: جس نے ایک دن میں بارہ رکعتیں پڑھیں، اس کے لیے جنت میں ایک گھر بنایا جائے گا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے ایک دن میں فرض کے علاوہ بارہ رکعتیں پڑھیں اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا، یا اس کے لیے جنت میں ایک گھر بنایا جائے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے دن اور رات میں بارہ رکعتیں پڑھیں، تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں جس نے ایک دن میں بارہ رکعتیں پڑھیں، اس کے لیے جنت میں ایک گھر بنایا جائے گا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے ایک دن میں بارہ رکعتیں فرض کے علاوہ پڑھیں، تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: یہ غلط ہے، محمد بن سلیمان ضعیف ہیں، وہ اصبہانی کے بیٹے ہیں، نیز یہ حدیث اس سند کے علاوہ سے بھی ان الفاظ کے علاوہ کے ساتھ جن کا ذکر اوپر ہوا ہے روایت کی گئی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "حسان بن عطیہ کہتے ہیں کہ جب عنبسہ کی موت کا وقت آیا تو وہ تکلیف سے پیچ و تاب کھانے لگے تو ان سے کچھ پوچھا گیا، تو انہوں نے کہا: سنو! میں نے ام المؤمنین ام حبیبہ رضی اللہ عنہا کو سنا وہ نبی اکرم صلی اللہ علیہ وسلم کے واسطہ سے بیان کر رہی تھیں کہ آپ نے فرمایا ہے: جس نے ظہر سے پہلے چار رکعتیں، اور اس کے بعد چار رکعتیں پڑھیں، تو اللہ تعالیٰ اس کا گوشت جہنم کی آگ پر حرام کر دے گا، تو جب سے میں نے انہیں سنا ہے میں نے انہیں چھوڑا نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "عنبسہ بن ابی سفیان کہتے ہیں کہ میری بہن ام المؤمنین ام حبیبہ رضی اللہ عنہا نے مجھے بتایا کہ ان کے محبوب ابوالقاسم صلی اللہ علیہ وسلم نے انہیں بتایا: جو بھی مومن بندہ ظہر کے بعد چار رکعتیں پڑھے گا، تو جہنم کی آگ اس کے چہرے کو کبھی نہیں چھوئے گی، اگر اللہ عزوجل نے چاہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے: جس نے ظہر سے پہلے چار رکعتیں پڑھیں، اور اس کے بعد چار رکعتیں پڑھیں، تو اللہ تعالیٰ اسے جہنم پر حرام کر دے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا سے روایت ہے، مروان بن محمد کہتے ہیں: اور سعید بن عبدالعزیز پر جب پڑھا گیا کہ ام حبیبہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتی ہیں تو انہوں نے اس کا اقرار کیا، اور انکار نہیں کیا حالانکہ جب انہوں نے اسے ہم سے بیان کیا تو انہوں نے اسے مرفوع نہیں کیا، وہ کہتی ہیں: جس نے ظہر سے پہلے چار رکعتیں، اور اس کے بعد چار رکعتیں پڑھیں تو اللہ تعالیٰ اسے جہنم پر حرام کر دے گا۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: مکحول نے عنبسہ سے کچھ نہیں سنا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "محمد بن ابی سفیان کہتے ہیں کہ جب ان کی موت کا وقت قریب ہوا تو ان کی حالت شدید ہو گئی تو انہوں نے کہا: مجھ سے میری بہن ام حبیبہ بنت ابی سفیان رضی اللہ عنہم نے بیان کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس نے ظہر سے پہلے کی چار رکعتوں، اور اس کے بعد کی چار رکعتوں کی محافظت کی، تو اللہ تعالیٰ اسے جہنم پر حرام کر دے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا روایت کرتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے ظہر سے پہلے چار رکعتیں اور اس کے بعد چار پڑھیں، اسے آگ نہیں چھوئے گی۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: یہ غلط ہے ۱؎، صحیح مروان کی حدیث ہے ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 220
			}
		}
	]
}