{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"21": "The Book of Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی ( بھی ) ہرگز موت کی آرزو و تمنا نہ کرے، ( کیونکہ ) یا تو وہ نیک ہو گا تو ہو سکتا ہے زیادہ نیکی کرے، یا برا ہو گا تو ہو سکتا ہے وہ برائی سے توبہ کر لے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں کا کوئی ( بھی ) ہرگز موت کی آرزو و تمنا نہ کرے ( کیونکہ ) اگر وہ نیک ہے تو شاید زندہ رہے ( اور ) زیادہ نیکی کرے، اور یہ اس کے لیے بہتر ہے، اور اگر گناہ گار ہے تو ہو سکتا ہے گنا ہوں سے توبہ کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "انس رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں کا کوئی ( بھی ) ہرگز مصیبت کی وجہ سے جو اسے دنیا میں پہنچتی ہے موت کی تمنا نہ کرے ۱؎، بلکہ یہ کہے: «اللہم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي‏» اے اللہ! اس وقت تک مجھے زندہ رکھ جب تک زندگی میرے لیے بہتر ہو، اور اس وقت موت دیدے جب موت میرے لیے بہتر ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سنو! تم میں کا کوئی ( بھی ) ہرگز موت کی آرزو نہ کرے، اس مصیبت کی وجہ سے جو اسے پہنچی ہے، اگر موت کی آرزو کرنا ضروری ہو تو یہ کہے: «اللہم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي» اے اللہ! اس وقت تک مجھے زندہ رکھ جب تک زندگی میرے لیے بہتر ہو، اور اس وقت موت دیدے جب موت میرے لیے بہتر ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم موت کی دعا نہ کرو، اور نہ ہی اس کی تمنا ( مگر ) جسے دعا کرنا ضروری ہو وہ کہے: «اللہم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي» اے اللہ! مجھے زندہ رکھ جب تک میرے لیے زندہ رہنا بہتر ہو اور موت دیدے جب میرے لیے موت بہتر ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "قیس بن ابی حازم کہتے ہیں میں خباب رضی اللہ عنہ کے پاس آیا، انہوں نے اپنے پیٹ میں سات داغ لگوا رکھے تھے وہ کہنے لگے: اگر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں موت کی دعا سے نہ روکا ہوتا تو میں ( شدت تکلیف سے ) اس کی دعا کرتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لذتوں کو کاٹنے والی ۱؎ کو خوب یاد کیا کرو ۲؎۔ ابوعبدالرحمٰن کہتے ہیں: محمد بن ابراہیم ابوبکر بن ابی شیبہ کے والد ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جب تم مریض کے پاس جاؤ تو اچھی باتیں کرو، کیونکہ تم جو کچھ کہتے ہو فرشتے اس پر آمین کہتے ہیں ۔ چنانچہ جب ابوسلمہ مر گئے، تو میں نے پوچھا: اللہ کے رسول! میں کیا کہوں؟ تو آپ نے فرمایا ـ: تو کہو: «اللہم اغفر لنا وله وأعقبني منه عقبى حسنة» اے اللہ! ہماری اور ان کی مغفرت فرما، اور مجھے ان کا نعم البدل عطا فرما تو اللہ تعالیٰ نے مجھے ان کے بعد محمد صلی اللہ علیہ وسلم کو عطا کیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے قریب المرگ لوگوں کو «لا إله إلا اللہ» کی تلقین کرو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم اپنے قریب المرگ لوگوں کو «لا إله إلا اللہ» کی تلقین کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "بریدہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مومن ایسی حالت میں مرتا ہے کہ اس کی پیشانی پسینہ آلود ہوتی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "بریدہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا: مومن ایسی حالت میں مرتا ہے کہ اس کی پیشانی پسینہ آلود رہتی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی، تو اس وقت آپ کا سر مبارک میری ہنسلی اور ٹھوڑی کے درمیان تھا، آپ صلی اللہ علیہ وسلم کو دیکھنے کے بعد کبھی کسی کی موت کی سختی مجھے ناگوار نہیں لگتی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "انس رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کا آخری دیدار اس وقت کیا تھا ( جب ) آپ نے ( حجرے کا ) پردہ اٹھایا، اور لوگ ابوبکر رضی اللہ عنہ کے پیچھے صف باندھے ( کھڑے تھے ) ، ابوبکر رضی اللہ عنہ نے پیچھے ہٹنا چاہا تو آپ نے اشارہ کیا کہ اپنی جگہ پر رہو، اور پردہ گرا دیا ( پھر ) آپ اسی دن کے آخری ( حصہ میں ) انتقال فرما گئے، اور یہ دوشنبہ کا دن تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ مدینے کا ایک آدمی جو وہیں پیدا ہونے والوں میں سے تھا مر گیا، تو رسول اللہ صلی اللہ علیہ وسلم نے اس ( کے جنازے ) کی نماز پڑھائی، پھر فرمایا: کاش! ( یہ شخص ) اپنے پیدائش کی جگہ کے علاوہ کہیں اور مرا ہوتا ، لوگوں نے عرض کیا: اللہ کے رسول! ایسا کیوں تو آپ نے فرمایا: آدمی جب اپنی جائے پیدائش کے علاوہ کہیں اور مرتا ہے، تو اسے جنت میں اس کی جائے پیدائش سے جائے موت تک جگہ دی جاتی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب مومن کی موت آتی ہے تو اس کے پاس رحمت کے فرشتے سفید ریشمی کپڑا لے کر آتے ہیں، اور ( اس کی روح سے ) کہتے ہیں: نکل، تو اللہ سے راضی ہے، اور اللہ تجھ سے راضی ہے، اللہ کی رحمت اور رزق کی طرف اور ( اپنے ) رب کی طرف جو ناراض نہیں ہے، تو وہ پاکیزہ خوشبودار مشک کی مانند نکل پڑتی، ہے یہاں تک کہ ( فرشتے ) اسے ہاتھوں ہاتھ لیتے ہیں، ( جب ) آسمان کے دروازے پر اسے لے کر آتے ہیں تو ( دربان ) کہتے ہیں: کیا خوب ہے یہ خوشبو جو زمین سے تمہارے پاس آئی ہے، ( پھر ) وہ اسے مومن کی روحوں کے پاس لے کر آتے ہیں، تو انہیں ایسی خوشی ہوتی ہے جو گمشدہ شخص کے لوٹ کر آ جانے سے بڑھ کر ہوتی ہے، وہ روحیں اس سے ان لوگوں کا حال پوچھتی ہیں جنہیں وہ دنیا میں چھوڑ گئے تھے: فلاں کیسے ہے، اور فلاں کیسے ہے؟ وہ کہتی ہیں: انہیں چھوڑو، یہ دنیا کے غم میں مبتلا تھے، تو جب وہ ( نووارد روح ) کہتی ہے: کیا وہ تمہارے پاس نہیں آیا؟ ( وہ تو مر گیا تھا ) تو وہ کہتی ہیں: اسے اس کے ٹھکانہ ہاویہ کی طرف لے جایا گیا ہو گا، اور جب کافر قریب المرگ ہوتا ہے تو عذاب کے فرشتے ایک ٹاٹ کا ٹکڑا لے کر آتے ہیں، ( اور ) کہتے ہیں: اللہ کے عذاب کی طرف نکل، تو اللہ سے ناراض ہے، اور اللہ تجھ سے ناراض ہے، تو وہ نکل پڑتی ہے جیسے سڑے مردار کی بدبو نکلتی ہے یہاں تک کہ اسے زمین کے دروازے پر لاتے ہیں ( پھر ) کہتے ہیں: کتنی خراب بدبو ہے یہاں تک کہ اسے کافروں کی روحوں میں لے جا کر ( چھوڑ دیتے ہیں ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اللہ تعالیٰ سے ملنا چاہے اللہ تعالیٰ ( بھی ) اس سے ملنا چاہے گا، اور جو اللہ تعالیٰ سے ملنا ناپسند کرے اللہ تعالیٰ ( بھی ) اس سے ملنا ناپسند کرے گا ۔ شریح کہتے ہیں: میں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس آیا، اور میں نے کہا: ام المؤمنین! میں نے ابوہریرہ رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کی ایک حدیث ذکر کرتے سنا ہے، اگر ایسا ہے تو ہم ہلاک ہو گئے، انہوں نے پوچھا: وہ کیا ہے؟ انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: جو اللہ سے ملنا چاہے اللہ ( بھی ) اس سے ملنا چاہے گا، اور جو اللہ تعالیٰ سے ملنا ناپسند کرے اللہ تعالیٰ ( بھی ) اس سے ملنا ناپسند کرے گا لیکن ہم میں سے کوئی ( بھی ) ایسا نہیں جو موت کو ناپسند نہ کرتا ہو۔ تو انہوں نے کہا: بیشک یہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے، لیکن اس کا یہ مطلب نہیں جو تم سمجھتے ہو بلکہ اس کا مطلب یہ ہے کہ جب نگاہ پتھرا جائے، سینہ میں دم گھٹنے لگے، اور رونگٹے کھڑے ہو جائیں، اس وقت جو اللہ تعالیٰ سے ملنا چاہے اللہ تعالیٰ ( بھی ) اس سے ملنا چاہے گا، اور جو اللہ تعالیٰ سے ملنا ناپسند کرے اللہ تعالیٰ ( بھی ) اس سے ملنا ناپسند کرے گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ فرماتا ہے: جب میرا بندہ مجھ سے ملنا چاہتا ہے تو میں ( بھی ) اس سے ملنا چاہتا ہوں، اور جب وہ مجھ سے ملنا ناپسند کرتا ہے تو میں ( بھی ) اس سے ملنا ناپسند کرتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "عبادہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو اللہ تعالیٰ سے ملنا چاہے، اللہ تعالیٰ ( بھی ) اس سے ملنا چاہے گا، اور جو اللہ تعالیٰ سے ملنا ناپسند کرے اللہ تعالیٰ ( بھی ) اس سے ملنا ناپسند کرے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "عبادہ بن صامت رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اللہ تعالیٰ سے ملنا چاہتا ہے اللہ تعالیٰ ( بھی ) اس سے ملنا چاہتا ہے، اور جو اللہ تعالیٰ سے ملنا ناپسند کرتا ہے اللہ تعالیٰ ( بھی ) اس سے ملنا ناپسند کرتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اللہ تعالیٰ سے ملنا چاہے گا اللہ تعالیٰ ( بھی ) اس سے ملنا چاہے گا، اور جو اللہ سے ملنا ناپسند کرتا ہے اللہ تعالیٰ ( بھی ) اس سے ملنا ناپسند کرے گا، ( عمرو نے اپنی روایت میں اتنا اضافہ کیا ہے ) اس پر اللہ کے رسول سے عرض کیا گیا: اللہ کے رسول! ( اگر ) اللہ تعالیٰ سے ملنا ناپسند کرنا موت کو ناپسند کرنا ہے، تو ہم سب موت کو ناپسند کرتے ہیں۔ آپ نے فرمایا: یہ اس کے مرنے کے وقت کی بات ہے، جب اسے اللہ کی رحمت اور اس کی مغفرت کی خوشخبری دی جاتی ہے، تو وہ اللہ تعالیٰ سے ( جلد ) ملنا چاہتا ہے اور اللہ تعالیٰ ( بھی ) اس سے ملنا چاہتا ہے، اور جب اسے اللہ تعالیٰ کے عذاب کی دھمکی دی جاتی ہے تو ( ڈر کی وجہ سے ) ملنا ناپسند کرتا ہے، اور وہ بھی اس سے ملنا ناپسند کرتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ ابوبکر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم کی دونوں آنکھوں کے بیچ بوسہ لیا، اور آپ انتقال فرما چکے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"text": "عبداللہ بن عباس اور عائشہ رضی الله عنہم سے روایت ہے کہ ابوبکر رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم کا بوسہ لیا، اور آپ انتقال فرما چکے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "ابوسلمہ کہتے ہیں کہ نے مجھے خبر دی ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا نے انہیں بتایا ہے کہ ابوبکر سُنح میں واقع اپنے مکان سے ایک گھوڑے پر آئے، اور اتر کر ( سیدھے ) مسجد میں گئے، لوگوں سے کوئی بات نہیں کی یہاں تک کہ عائشہ رضی اللہ عنہا کے پاس ( ان کے حجرے میں ) آئے، رسول اللہ صلی اللہ علیہ وسلم کو دھاری دار چادر سے ڈھانپ دیا گیا تھا تو انہوں نے آپ صلی اللہ علیہ وسلم کا چہرہ مبارک کھولا، پھر وہ آپ پر جھکے اور آپ کا بوسہ لیا، اور رو پڑے، پھر کہا: میرے باپ آپ پر فدا ہوں، اللہ کی قسم! اللہ کبھی آپ پر دو موتیں اکٹھی نہیں کرے گا، رہی یہ موت جو اللہ تعالیٰ نے آپ پر لکھ دی تھی تو یہ ہو چکی ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "جابر بن عبداللہ بن حرام رضی الله عنہما کہتے ہیں کہ غزوہ احد کے دن میرے والد کو اس حال میں لایا گیا کہ ان کا مثلہ کیا جا چکا تھا، انہیں رسول اللہ صلی اللہ علیہ وسلم کے سامنے رکھا گیا، اور ایک کپڑے سے ڈھانپ دیا گیا تھا، میں نے ان کے چہرہ سے کپڑا ہٹانا چاہا تو لوگوں نے مجھے روک دیا، ( پھر ) رسول اللہ صلی اللہ علیہ وسلم نے انہیں ( اٹھانے ) کا حکم دیا، انہیں اٹھایا گیا، تو جب وہ اٹھائے گئے تو آپ نے کسی رونے والے کی آواز سنی تو پوچھا: یہ کون ہے؟ تو لوگوں نے کہا: یہ عمرو کی بیٹی یا بہن ہے، آپ نے فرمایا: مت روؤ ، یا فرمایا: کیوں روتی ہو؟ جب تک انہیں اٹھایا نہیں گیا تھا فرشتے انہیں برابر سایہ کئے ہوئے تھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی ایک چھوٹی بچی کے مرنے کا وقت آیا تو آپ صلی اللہ علیہ وسلم نے اسے ( اپنی گود میں ) لے کر اپنے سینے سے چمٹا لیا، پھر اس پر اپنا ہاتھ رکھا، تو وہ آپ صلی اللہ علیہ وسلم کے سامنے ہی مر گئی، ام ایمن رضی اللہ عنہا رونے لگیں، تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا: ام ایمن! تم رو رہی ہو جبکہ اللہ کے رسول صلی اللہ علیہ وسلم تمہارے پاس موجود ہیں؟ تو انہوں نے کہا: میں کیوں نہ روؤں جبکہ اللہ کے رسول صلی اللہ علیہ وسلم ( خود ) رو رہے ہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: میں رو نہیں رہا ہوں، البتہ یہ اللہ کی رحمت ہے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مومن ہر حال میں اچھا ہے، اس کی دونوں پسلیوں کے بیچ سے اس کی جان نکالی جاتی ہے، اور وہ اللہ تعالیٰ کی حمد و ثنا کرتا رہتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "انس رضی الله عنہ سے روایت ہے کہ فاطمہ رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کی وفات پر رونے لگیں، اور کہنے لگیں: ہائے، ابا جان! آپ اپنے رب سے کس قدر قریب ہو گئے، ہائے، ابا جان! مرنے کی خبر ہم جبرائیل علیہ السلام کو دے رہے ہیں، ہائے، ابا جان! آپ کا ٹھکانا جنت الفردوس ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": 1845,
			"text": "جابر بن عبداللہ بن حرام رضی الله عنہما سے روایت ہے کہ ان کے والد غزوہ احد کے دن قتل کر دیئے گئے، میں ان کے چہرہ سے کپڑا ہٹانے اور رونے لگا، لوگ مجھے روک رہے تھے، اور رسول اللہ صلی اللہ علیہ وسلم نہیں روک رہے تھے، میری پھوپھی ( بھی ) ان پر رونے لگیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم ان پر مت روؤ، فرشتے ان پر برابر اپنے پروں سے سایہ کیے رہے یہاں تک کہ تم لوگوں نے اٹھایا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": 1846,
			"text": "جابر بن عتیک انصاری رضی الله عنہ کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم عبداللہ بن ثابت رضی اللہ عنہ کی عیادت ( بیمار پرسی ) کرنے آئے تو دیکھا کہ بیماری ان پر غالب آ گئی ہے، تو آپ نے انہیں زور سے پکارا ( لیکن ) انہوں نے ( کوئی ) جواب نہیں دیا، تو رسول اللہ صلی اللہ علیہ وسلم نے «اناللہ وانا اليہ راجعون»پڑھا، اور فرمایا: اے ابو ربیع! ہم تم پر مغلوب ہو گئے ( یہ سن کر ) عورتیں چیخ پڑیں، اور رونے لگیں، ابن عتیک انہیں چپ کرانے لگے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: انہیں چھوڑ دو لیکن جب واجب ہو جائے تو ہرگز کوئی رونے والی نہ روئے ۔ لوگوں نے پوچھا: اللہ کے رسول! ( یہ ) واجب ہونا کیا ہے؟ آپ نے فرمایا: مر جانا ، ان کی بیٹی نے اپنے باپ کو مخاطب کر کے کہا: مجھے امید تھی کہ آپ شہید ہوں گے ( کیونکہ ) آپ نے اپنا سامان جہاد تیار کر لیا تھا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یقیناً اللہ تعالیٰ ان کی نیت کے حساب سے انہیں اجر و ثواب دے گا، تم لوگ شہادت سے کیا سمجھتے ہو؟ لوگوں نے کہا: اللہ تعالیٰ کے راستے میں مارا جانا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کے راستے میں مارے جانے کے علاوہ شہادت ( کی ) سات ( قسمیں ) ہیں، طاعون سے مرنے والا شہید ہے، پیٹ کی بیماری میں مرنے والا شہید ہے، ڈوب کر مرنے والا شہید ہے، عمارت سے دب کر مرنے والا شہید ہے، نمونیہ میں مرنے والا شہید ہے، جل کر مرنے والا شہید ہے، اور جو عورت جننے کے وقت یا جننے کے بعد مر جائے وہ شہید ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": 1847,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ جب زید بن حارثہ، جعفر بن ابی طالب اور عبداللہ بن رواحہ ( رضی اللہ عنہم ) کے مرنے کی خبر آئی تو رسول اللہ صلی اللہ علیہ وسلم بیٹھے ( اور ) آپ ( کے چہرے ) پر حزن و ملال نمایاں تھا، میں دروازے کے شگاف سے دیکھ رہی تھی ( اتنے میں ) ایک شخص آیا اور کہنے لگا: جعفر ( کے گھر ) کی عورتیں رو رہی ہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے کہا: جاؤ انہیں منع کرو ، چنانچہ وہ گیا ( اور ) پھر ( لوٹ کر ) آیا اور کہنے لگا: میں نے انہیں روکا ( لیکن ) وہ نہیں مانیں، آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں منع کرو ( پھر ) وہ گیا ( اور پھر لوٹ کر آیا، اور کہنے لگا: میں نے انہیں روکا ( لیکن ) وہ نہیں مان رہی ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: جاؤ ان کے منہ میں مٹی ڈال دو ، عائشہ رضی اللہ عنہا نے کہا: میں نے کہا: اللہ تعالیٰ اس شخص کی ناک خاک آلود کرے جو اللہ تعالیٰ کی رحمت سے دور ہے، تو اللہ کی قسم! نہ تو رسول اللہ صلی اللہ علیہ وسلم کو پریشان کرنا چھوڑ رہا ہے، اور نہ تو یہی کر سکتا ہے ( کہ انہیں سختی سے روک دے ) ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "عمر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میت کو اس کے گھر والوں کے رونے کی وجہ سے عذاب دیا جاتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": 1849,
			"text": "محمد بن سیرین کہتے ہیں کہ عمران بن حصین رضی اللہ عنہما کے پاس ذکر کیا گیا کہ میت کو زندوں کے رونے کی وجہ سے عذاب دیا جاتا ہے، تو انہوں نے کہا: اسے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": 1850,
			"text": "عمر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میت کو اس کے گھر والوں کے رونے کی وجہ سے عذاب دیا جاتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": 1851,
			"text": "قیس بن عاصم رضی الله عنہ نے کہا تم میرے اوپر نوحہ مت کرنا کیونکہ رسول اللہ صلی اللہ علیہ وسلم پر نوحہ نہیں کیا گیا۔ یہ لمبی حدیث سے مختصر ہے",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": 1852,
			"text": "انس رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جس وقت عورتوں سے بیعت لی تو ان سے یہ بھی عہد لیا کہ وہ نوحہ نہیں کریں گی، تو عورتوں نے کہا: اللہ کے رسول! کچھ عورتوں نے زمانہ جاہلیت میں ( نوحہ کرنے میں ) ہماری مدد کی ہے، تو کیا ہم ان کی مدد کریں؟ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسلام میں ( نوحہ پر ) کوئی مدد نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": 1853,
			"text": "عمر رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: میت کو اس کی قبر میں اس پر نوحہ کرنے کی وجہ سے عذاب دیا جاتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": 1854,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ انہوں نے کہا کہ میت کو اس کے گھر والوں کے نوحہ کرنے کی وجہ سے عذاب دیا جاتا ہے، اس پر ایک شخص نے ان سے کہا: مجھے بتائیے کہ ایک شخص خراسان میں مرے، اور اس کے گھر والے یہاں اس پر نوحہ کریں تو اس پر اس کے گھر والوں کے نوحہ کرنے کی وجہ سے عذاب دیا جائے گا، ( یہ بات عقل میں آنے والی نہیں ) ؟ تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے سچ فرمایا، اور تو جھوٹا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": 1855,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میت کو اس کے گھر والوں کے رونے کے سبب عذاب دیا جاتا ہے ، اسے ام المؤمنین عائشہ رضی اللہ عنہا سے ذکر کیا گیا تو انہوں نے کہا: انہیں ( ابن عمر کو ) غلط فہمی ہوئی ہے ( اصل واقعہ یوں ہے ) رسول اللہ صلی اللہ علیہ وسلم ایک قبر کے پاس سے گزرے تو کہا: اس قبر والے کو عذاب دیا جا رہا ہے، اور اس کے گھر والے اس پر رو رہے ہیں، پھر انہوں نے یہ آیت پڑھی: «ولا تزر وازرة وزر أخرى» کوئی بوجھ اٹھانے والا کسی دوسرے کا بوجھ نہیں اٹھائے گا ( فاطر: ۱۸ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": 1856,
			"text": "عمرہ سے روایت ہے کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے سنا جب ان کے سامنے اس بات کا ذکر کیا گیا کہ عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں: میت کو زندوں کے رونے کی وجہ سے عذاب دیا جاتا ہے، تو عائشہ رضی اللہ عنہا نے کہا: اللہ تعالیٰ ابوعبدالرحمٰن کی مغفرت کرے، سنو! انہوں نے جھوٹ اور غلط نہیں کہا ہے، بلکہ وہ بھول گئے انہیں غلط فہمی ہوئی ہے ( اصل بات یہ ہے ) رسول اللہ صلی اللہ علیہ وسلم ایک یہودیہ عورت ( کی قبر ) کے پاس سے گزرے جس پر ( اس کے گھر والے ) رو رہے تھے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ لوگ اس پر رو رہے ہیں اور اسے عذاب دیا جا رہا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": 1857,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ کافر کے عذاب کو اس پر اس کے گھر والوں کے رونے کی وجہ سے بڑھا دیتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": 1858,
			"text": "ابن ابی ملیکہ کہتے ہیں کہ جب ام ابان مر گئیں تو میں ( بھی ) لوگوں کے ساتھ ( تعزیت میں ) آیا، اور عبداللہ بن عمر اور عبداللہ بن عباس رضی اللہ عنہم کے بیچ میں بیٹھ گیا، عورتیں رونے لگیں تو ابن عمر رضی اللہ عنہما نے کہا: کیا تم انہیں رونے سے روکو گے نہیں؟ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: میت کو اس کے گھر والوں کے رونے کے سبب عذاب دیا جاتا ہے ، اس پر ابن عباس رضی اللہ عنہما نے کہا: عمر رضی اللہ عنہ بھی ایسا ہی کہتے تھے، ( ایک بار ) میں عمر رضی اللہ عنہ کے ساتھ نکلا یہاں تک کہ ہم بیداء پہنچے، تو انہوں نے ایک درخت کے نیچے کچھ سواروں کو دیکھا تو ( مجھ سے ) کہا: دیکھو ( یہ ) سوار کون ہیں؟ چنانچہ میں گیا تو میں نے دیکھا کہ وہ صہیب رضی اللہ عنہ اور ان کے گھر والے ہیں، لوٹ کر ان کے پاس آیا، اور ان سے کہا: امیر المؤمنین! وہ صہیب رضی اللہ عنہ اور ان کے گھر والے ہیں، تو انہوں نے کہا: صہیب رضی اللہ عنہ کو میرے پاس لاؤ، پھر جب ہم مدینہ آئے تو عمر رضی اللہ عنہ زخمی کر دئیے گئے، صہیب رضی اللہ عنہ ان کے پاس روتے ہوئے بیٹھے ( اور ) وہ کہہ رہے تھے: ہائے میرے بھائی! ہائے میرے بھائی! تو عمر رضی اللہ عنہ نے کہا: صہیب! روؤ مت، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: میت کو اس کے گھر والوں کے رونے کی وجہ سے عذاب دیا جاتا ہے ( ابن عباس ) کہتے ہیں: میں نے اس بات کا ذکر عائشہ رضی اللہ عنہا سے کیا تو انہوں نے کہا: سنو! اللہ کی قسم! تم یہ حدیث نہ جھوٹوں سے روایت کر رہے ہو، اور نہ ایسوں سے جنہیں جھٹلایا گیا ہو، البتہ سننے ( میں ) غلط فہمی ہوئی ہے، اور قرآن میں ( ایسی بات موجود ہے ) جس سے تمہیں تسکین ہو: «ألا تزر وازرة وزر أخرى» کوئی بوجھ اٹھانے والا دوسرے کا بوجھ نہیں اٹھائے گا البتہ رسول اللہ صلی اللہ علیہ وسلم نے ( یوں ) فرمایا تھا: اللہ کافر کا عذاب اس کے گھر والوں کے رونے کی وجہ سے بڑھا دیتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": 1859,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے خاندان میں کسی کا انتقال ہو گیا تو عورتیں اکٹھا ہوئیں ( اور ) میت پر رونے لگیں، تو عمر رضی اللہ عنہ کھڑے ہو کر انہیں روکنے اور بھگانے لگے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عمر! انہیں چھوڑ دو کیونکہ آنکھوں میں آنسو ہے، دل غم میں ڈوبا ہوا ہے، اور موت کا وقت قریب ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": 1860,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وہ شخص ہم میں سے نہیں ۱؎ جو منہ پیٹے، گریباں پھاڑے، اور جاہلیت کی پکار پکارے ( یعنی نوحہ کرے ) ۔ یہ الفاظ علی بن خشرم کے ہیں، اور حسن کی روایت «بدعا الجاہلیۃ» کی جگہ «بدعویٰ الجاہلیۃ» ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1861,
			"arabicnumber": 1861,
			"text": "صفوان بن محرز کہتے ہیں کہ ابوموسیٰ اشعری پر بے ہوشی طاری ہو گئی، لوگ ان پر رونے لگے، تو انہوں نے کہا: میں تم سے اپنی برات کا اظہار کرتا ہوں جیسے رسول اللہ صلی اللہ علیہ وسلم نے ہم سے یہ کہہ کر برات کا اظہار کیا تھا کہ جو سر منڈائے کپڑے پھاڑے، واویلا کرے ہم میں سے نہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": 1862,
			"text": "عبداللہ بن مسعود رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو گال پیٹے، گریباں پھاڑے، اور جاہلیت کی پکار پکارے ہم میں سے نہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": 1863,
			"text": "عبدالرحمٰن بن یزید اور ابوبردہ رضی الله عنہما کہتے ہیں کہ جب ابوموسیٰ اشعری ( کی بیماری ) سخت ہوئی، تو ان کی عورت چلاتی ہوئی آئی۔ ( ان کی بیماری میں کچھ ) افاقہ ہوا، تو انہوں نے کہا: کیا میں تجھے نہ بتاؤں کہ میں ان چیزوں سے بری ہوں جن سے رسول اللہ صلی اللہ علیہ وسلم بری تھے، ان دونوں نے ان کی بیوی سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: میں اس شخص سے بری ہوں جو سر منڈائے، کپڑے پھاڑے اور واویلا کرے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": 1864,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: وہ شخص ہم میں سے نہیں جو گال پیٹے، گریبان پھاڑے، اور جاہلیت کی پکار پکارے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": 1865,
			"text": "ابوموسیٰ اشعری رضی الله عنہ سے روایت ہے کہ ان پر غشی طاری ہوئی، تو ان کی ام ولد رو پڑی، جب ( کچھ ) افاقہ ہوا تو انہوں نے اس سے کہا: کیا تجھے وہ بات نہیں پہنچی ہے جو رسول اللہ صلی اللہ علیہ وسلم نے فرمائی ہے؟ تو ہم نے اس سے پوچھا ( آپ نے کیا فرمایا تھا؟ ) تو اس نے کہا: آپ نے فرمایا: وہ شخص ہم میں سے نہیں جو گال پیٹے، سر منڈائے، اور کپڑے پھاڑے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": 1866,
			"text": "ابوموسیٰ اشعری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وہ شخص ہم میں سے نہیں جو سر منڈائے، واویلا کرے اور کپڑے پھاڑے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1867,
			"arabicnumber": 1867,
			"text": "قرثع کہتے ہیں کہ جب ابوموسیٰ اشعری رضی اللہ عنہ کی بیماری بڑھ گئی تو ان کی بیوی چیخ مار کر رونے لگی، تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے جو فرمایا ہے کیا تجھے معلوم نہیں؟ اس نے کہا: کیوں، نہیں ضرور معلوم ہے، پھر وہ خاموش ہو گئی، تو اس سے اس کے بعد پوچھا گیا کہ رسول اللہ صلی اللہ علیہ وسلم نے کیا فرمایا ہے؟ اس نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے ( ہر اس شخص پر ) لعنت فرمائی ہے جو سر منڈوائے، یا واویلا کرے، یا گریبان پھاڑے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": 1868,
			"text": "اسامہ بن زید رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی بیٹی نے آپ کو صلی اللہ علیہ وسلم کہلا بھیجا کہ میرا بیٹا ۱؎ مرنے کو ہے آپ آ جائیں، تو آپ صلی اللہ علیہ وسلم نے کہلا بھیجا کہ آپ سلام کہتے ہیں، اور کہتے ہیں: اللہ تعالیٰ ہی کے لیے ہے جو ( کچھ ) لے، اور اسی کے لیے ہے جو ( کچھ ) دے، اور اللہ کے نزدیک ہر چیز کا ایک وقت مقرر ہے، تو چاہیئے کہ تم صبر کرو، اور اللہ سے اجر طلب کرو، بیٹی نے ( دوبارہ ) قسم دے کے کہلا بھیجا کہ آپ صلی اللہ علیہ وسلم ضرور آ جائیں، چنانچہ آپ اٹھے، آپ کے ساتھ سعد بن عبادہ، معاذ بن جبل، ابی بن کعب، زید بن ثابت رضی اللہ عنہم اور کچھ اور لوگ تھے، ( بچہ ) رسول اللہ صلی اللہ علیہ وسلم کے پاس اٹھا کر اس حال میں لایا گیا کہ اس کی سانس ٹوٹ رہی تھی، تو آپ کی آنکھوں ( سے ) آنسو بہ پڑے، اس پر سعد رضی اللہ عنہ نے کہا: اللہ کے رسول! یہ کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: یہ رحمت ہے جو اللہ تعالیٰ نے اپنے بندوں کے دلوں میں رکھ رکھا ہے، اور اللہ تعالیٰ اپنے انہیں بندوں پر رحم کرتا ہے جو رحم دل ہوتے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": 1869,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: صبر وہی ہے جو صدمہ ( غم ) پہنچتے ہی ہو ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": 1870,
			"text": "قرہ رضی الله عنہ سے روایت ہے کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اس کے ساتھ اس کا بیٹا ( بھی ) تھا، آپ نے اس سے پوچھا: کیا تم اس سے محبت کرتے ہو؟ تو اس نے جواب دیا: اللہ آپ سے ایسے ہی محبت کرے جیسے میں اس سے کرتا ہوں، پھر وہ ( لڑکا ) مر گیا، تو آپ نے ( کچھ دنوں سے ) اسے نہیں دیکھا تو اس کے بارے میں ( اس کے باپ سے ) پوچھا ( تو انہوں نے بتایا کہ وہ مر گیا ہے ) آپ نے فرمایا: کیا تمہیں اس بات سے خوشی نہیں ہو گی کہ تم جنت کے جس دروازے پر جاؤ گے ( اپنے بچے ) کو اس کے پاس پاؤ گے، وہ تمہارے لیے دوڑ کر دروازہ کھولنے کی کوشش کرے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": 1871,
			"text": "عمرو بن شعیب نے عبداللہ بن عبدالرحمٰن بن ابی حسین کو ان کے بیٹے کی وفات پر تعزیت کا خط لکھا، اور اپنے خط میں ذکر کیا کہ انہوں نے اپنے والد کو بیان کرتے سنا وہ اپنے دادا عبداللہ بن عمرو بن عاص رضی اللہ عنہما سے روایت کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ اپنے مومن بندے کے لیے جب وہ زمین والوں میں سے اس کی سب سے محبوب چیز یعنی بیٹا کو لے لے، اور وہ اس پر صبر کرے، اور اجر چاہے، اور وہی کہے جس کا حکم دیا گیا ہے، جنت سے کم ثواب پر راضی نہیں ہوتا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": 1872,
			"text": "انس رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس شخص کی تین صلبی اولاد مر جائیں ( اور ) وہ اللہ تعالیٰ سے اس کا اجر و ثواب چاہے، تو وہ جنت میں داخل ہو گا ( اتنے میں ) ایک عورت کھڑی ہوئی اور بولی: اور دو اولاد مرنے پر؟ آپ صلی اللہ علیہ وسلم نے فرمایا: دو اولاد کے مرنے پر بھی ، اس عورت نے کہا: کاش! میں ایک ہی کہتی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": 1873,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس مسلمان کے بھی تین نابالغ بچے مر جائیں، تو اللہ تعالیٰ اسے ان پر اپنی رحمت کے فضل سے جنت میں داخل کرے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": 1874,
			"text": "صعصعہ بن معاویہ کہتے ہیں کہ میں ابوذر رضی اللہ عنہ سے ملا تو میں نے کہا: مجھ سے حدیث بیان کیجئے تو انہوں کہا: اچھا سنو، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: جس مسلمان ماں باپ کی بھی تین نابالغ اولاد مر جائیں تو اللہ تعالیٰ ان کو ان پر اپنی رحمت کے فضل سے بخش دیتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": 1875,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمانوں میں سے جس شخص کے بھی تین بچے مر جائیں، تو اسے جہنم کی آگ صرف قسم ۱؎ پوری کرنے ہی کے لیے چھوئے گی ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": 1876,
			"text": "ابوہریرہ رضی الله عنہ روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس مسلمان ماں باپ کے تین نابالغ بچے مر جائیں، تو اللہ تعالیٰ ان کو ان پر اپنی رحمت کے فضل سے جنت میں داخل کرے گا ، آپ صلی اللہ علیہ وسلم فرماتے ہیں: ان سے کہا جائے گا: جنت میں داخل ہو جاؤ، تو وہ کہیں گے ( ہم نہیں داخل ہو سکتے ) جب تک کہ ہمارے والدین داخل نہ ہو جائیں، ( پھر ) کہا جائے گا: ( جاؤ ) اپنے والدین کے ساتھ جنت میں داخل ہو جاؤ ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": 1877,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس اپنا بیٹا لے کر آئی جو بیمار تھا، اور عرض کیا: اللہ کے رسول! میں ڈر رہی ہوں کہ یہ مر نہ جائے، اور ( اس سے پہلے ) تین بچوں کو بھیج چکی ہوں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم نے جہنم کی آگ سے بچاؤ کے لیے زبردست ڈھال بنا لیا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": 1878,
			"text": "انس رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے زید اور جعفر کی موت کی اطلاع ( کسی آدمی کے ذریعہ ) ان کی ( موت ) کی خبر آنے سے پہلے دی، اس وقت آپ کی دونوں آنکھیں اشکبار تھیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": 1879,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں حبشہ کے بادشاہ نجاشی کی موت کی خبر اسی دن دی جس دن وہ مرے، اور فرمایا: اپنے بھائی کے لیے مغفرت کی دعا کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": 1880,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چلے جا رہے تھے کہ اچانک آپ کی نگاہ ایک عورت پہ پڑی، ہم یہی گمان کر رہے تھے کہ آپ نے اسے نہیں پہچانا ہے، تو جب بیچ راستے میں پہنچے تو آپ کھڑے ہو گئے یہاں تک کہ وہ ( عورت ) آپ کے پاس آ گئی، تو کیا دیکھتے ہیں کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی بیٹی فاطمہ رضی اللہ عنہا ہیں، آپ نے ان سے پوچھا: فاطمہ! تم اپنے گھر سے کیوں نکلی ہو؟ انہوں نے جواب دیا: میں اس میت کے گھر والوں کے پاس آئی، میں نے ان کے لیے رحمت کی دعا کی، اور ان کی میت کی وجہ سے ان کی تعزیت کی، آپ نے فرمایا: شاید تم ان کے ساتھ کدیٰ ۱؎ تک گئی تھیں؟ انہوں نے کہا: اللہ کی پناہ! میں وہاں تک کیوں جاتی اس سلسلے میں آپ کو ان باتوں کا ذکر کرتے سن چکی ہوں جن کا آپ ذکر کرتے ہیں، تو آپ نے ان سے فرمایا: اگر تم ان کے ساتھ وہاں جاتی تو تم جنت نہ دیکھ پاتی یہاں تک کہ تمہارے باپ کے دادا ( عبدالمطلب ) اسے دیکھ لیں ۲؎۔ نسائی کہتے ہیں: ربیعہ ضعیف ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": 1881,
			"text": "ام عطیہ انصاریہ رضی الله عنہا کہتی ہیں کہ جس وقت رسول اللہ صلی اللہ علیہ وسلم کی بیٹی ۱؎ کی وفات ہوئی، آپ ہمارے پاس تشریف لائے اور فرمایا: اسے پانی اور بیر ( کے پتوں ) سے دو تین یا پانچ یا اس سے زیادہ بار اگر مناسب سمجھو غسل دو، اور آخری بار میں کچھ کافور یا کافور کی کچھ مقدار ملا لو ( اور ) جب تم ( غسل سے ) فارغ ہو تو مجھے خبر کرو ۔ تو جب ہم فارغ ہوئے تو ہم نے آپ کو خبر دی تو آپ نے ہمیں اپنا تہبند دیا اور فرمایا: اسے ان کے بدن پر لپیٹ دو ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": 1882,
			"text": "ام قیس رضی الله عنہا کہتی ہیں کہ میرا بیٹا مر گیا، تو میں اس پر رونے لگی اور اس شخص سے جو اسے غسل دے رہا تھا کہا: میرے بیٹے کو ٹھنڈے پانی سے غسل نہ دو کہ اس ( مرے کو مزید ) مارو، عکاشہ بن محصن رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس گئے، اور آپ کو ان کی یہ بات بتائی تو آپ مسکرا پڑے، پھر فرمایا: کیا کہا اس نے؟ اس کی عمردراز ہو ، ( راوی کہتے ہیں ) تو ہم نہیں جانتے کہ کسی عورت کو اتنی عمر ملی ہو جتنی انہیں ملی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": 1883,
			"text": "ام عطیہ رضی الله عنہا کہتی ہیں کہ ان عورتوں نے نبی اکرم صلی اللہ علیہ وسلم کی بیٹی کے سر کی تین چوٹیاں بنائیں، میں نے پوچھا: اسے کھول کر انہوں نے تین چوٹیاں کر دیں، تو انہوں نے کہا: جی ہاں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": 1884,
			"text": "ام عطیہ رضی الله عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیٹی کے غسل کے سلسلہ میں فرمایا: ان کے داہنے اعضاء، اور وضو کے مقامات سے نہلانا شروع کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": 1885,
			"text": "ام عطیہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی ایک بیٹی انتقال کر گئیں، تو آپ نے ہمیں بلا بھیجا اور فرمایا: اسے پانی اور بیر کے پتوں سے غسل دینا، اور طاق بار یعنی تین بار، یا پانچ بار غسل دینا، اگر ضرورت سمجھو تو سات بار دینا، اور آخری بار تھوڑا کافور ملا لینا ( اور ) جب تم فارغ ہو چکو تو مجھے خبر کرنا ، تو جب ہم ( نہلا کر ) فارغ ہوئے تو ہم نے آپ کو خبر کیا، آپ صلی اللہ علیہ وسلم نے اپنا تہبند ہماری طرف پھینکا، اور فرمایا: اسے ( ان کے جسم پہ ) لپیٹ دو ، ( پھر ) ہم نے ان کی تین چوٹیاں کیں، اور انہیں ان کے پیچھے ڈال دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": 1886,
			"text": "ام عطیہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے اور ہم آپ کی بیٹی کو نہلا رہے تھے، آپ نے فرمایا: انہیں پانی اور بیر ( کے پتوں ) سے تین یا پانچ بار غسل دو، یا اگر مناسب سمجھو اس سے بھی زیادہ، اور آخری بار کافور یا کافور کی کچھ ( مقدار ) ملا لینا، اور جب تم فارغ ہو جاؤ تو مجھے خبر کرو ۔ چنانچہ جب ہم فارغ ہوئے تو ہم نے آپ کو خبر کی تو آپ نے اپنا تہبند ہماری طرف پھینکا، اور فرمایا: اسے ان کے جسم سے لپیٹ دو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": 1887,
			"text": "ام عطیہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی ایک بیٹی کی وفات ہو گئی، تو آپ نے ہمیں بلوایا ( اور ) فرمایا: اسے پانی اور بیر ( کے پتوں ) سے تین یا پانچ بار غسل دو، یا اس سے زیادہ اگر مناسب سمجھو، اور آخری بار کچھ کافور یا کافور کی کچھ ( مقدار ) ملا لینا، اور جب فارغ ہو جاؤ تو مجھے خبر کرو ۔ تو جب ہم فارغ ہوئے تو ہم نے آپ کو خبر کی، آپ نے ہماری طرف اپنا تہبند پھینکا اور فرمایا: اسے ( اس کے جسم سے ) لپیٹ دو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": 1888,
			"text": "اس سند سے بھی ام عطیہ رضی اللہ عنہا سے اسی جیسی حدیث مروی ہے، مگر ( اس میں یہ الفاظ ہیں ) آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں تین بار یا پانچ بار یا سات بار غسل دو، یا اس سے زیادہ اگر اس کی ضرورت سمجھو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": 1889,
			"text": "ام عطیہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی ایک بیٹی کی وفات ہو گئی، تو آپ نے مجھے انہیں نہلانے کا حکم دیا اور فرمایا: تین بار، یا پانچ بار، یا سات بار غسل دو، یا اس سے زیادہ اگر ضرورت سمجھو ، تو میں نے کہا: طاق بار؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، اور آخری مرتبہ کچھ کافور یا کافور کی کچھ مقدار ملا لو، ( اور ) جب فارغ ہو جاؤ تو مجھے باخبر کرنا ، چنانچہ جب ہم فارغ ہوئے، ہم نے آپ کو خبر کی تو آپ نے ہمیں اپنا تہبند دیا، اور فرمایا: اسے ( اس کے جسم سے ) لپیٹ دو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": 1890,
			"text": "ام عطیہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے، ہم آپ کی بیٹی کو غسل دے رہے تھے، آپ نے فرمایا: انہیں پانی اور بیر ( کے پتوں ) سے تین بار، یا پانچ بار، غسل دو ، یا اس سے زیادہ، اور آخری بار کچھ کافور یا کافور کی مقدار ملا لو ( اور ) جب تم فارغ ہو جاؤ تو مجھے آگاہ کرو ، تو جب ہم فارغ ہوئے تو آپ کو خبر کی، آپ نے ہماری طرف اپنا تہبند پھینکا اور فرمایا: اسے ( اس کے جسم سے ) لپیٹ دو ، راوی کہتے ہیں یا حفصہ بنت سیرین کہتی ہیں: اسے تین، پانچ، یا سات بار غسل دو، راوی کہتے ہیں: ام عطیہ رضی اللہ عنہا کہتی ہیں: ہم نے ان کی تین چوٹیاں کیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1891,
			"arabicnumber": 1891,
			"text": "اس سند سے بھی ام عطیہ رضی الله عنہا کہتی ہیں کہ ہم نے ان کے سر کی تین چوٹیاں کیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": 1892,
			"text": "اس سند سے بھی ام عطیہ رضی الله عنہا سے مروی ہے کہ ہم نے ان کے سر کی تین چوٹیاں کیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": 1893,
			"text": "محمد بن سیرین کہتے ہیں ام عطیہ رضی اللہ عنہا ایک انصاری عورت تھیں، وہ ( بصرہ ) آئیں، اپنے بیٹے سے جلد ملنا چاہ رہی تھیں لیکن وہ اسے نہیں پا سکیں، انہوں نے ہم سے حدیث بیان کی، کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لائے، ہم آپ کی بیٹی کو غسل دے رہے تھے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: انہیں پانی اور بیر ( کی پتیوں ) سے تین بار، یا پانچ بار غسل دو، یا اس سے زیادہ بار اگر ضرورت سمجھو، اور آخر میں کافور یا کافور کی کچھ مقدار ملا لینا ( اور ) جب فارغ ہو جاؤ تو مجھے بتاؤ ، تو جب ہم فارغ ہوئے تو آپ نے ہماری طرف اپنا تہبند پھینکا اور فرمایا: اسے ان کے بدن پر لپیٹ دو ، اور اس سے زیادہ نہیں فرمایا۔ ( ایوب نے ) کہا: میں نہیں جانتا کہ یہ آپ کی کون سی بیٹی تھی ں، راوی کہتے ہیں: میں نے پوچھا اشعار سے کیا مراد ہے؟ کیا ازار ( تہبند ) پہنانا مقصود ہے؟ ایوب نے کہا: میں یہی سمجھتا ہوں کہ اس سے مراد یہ ہے کہ اسے ان کے جسم پر لپیٹ دو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": 1894,
			"text": "ام عطیہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی بیٹیوں میں سے ایک بیٹی کی موت ہو گئی تو آپ نے فرمایا: انہیں تین یا پانچ بار غسل دو، یا اس سے زیادہ اگر ضرورت سمجھو، اور انہیں بیر ( کے پتوں ) اور پانی سے غسل دو، اور کچھ کافور ملا لو، اور جب فارغ ہو جاؤ تو مجھے خبر کرو ، وہ کہتی ہیں: میں نے آپ کو خبر کیا، تو آپ نے ہماری طرف اپنی لنگی پھینکی اور فرمایا: اسے ( ان کے جسم سے ) لپیٹ دو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": 1895,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے خطبہ دیا تو آپ نے اپنے صحابہ میں سے ایک شخص کا ذکر کیا جو مر گیا تھا، اور اسے رات ہی میں دفنا دیا گیا تھا، اور ایک گھٹیا کفن میں اس کی تکفین کی گئی تھی، رسول اللہ صلی اللہ علیہ وسلم نے سختی سے منع فرما دیا کہ کوئی آدمی رات میں دفنایا جائے سوائے اس کے کہ کوئی مجبوری ہو، نیز رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی اپنے بھائی ( کے کفن دفن کا ) ولی ہو تو اسے چاہیئے کہ اسے اچھا کفن دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": 1896,
			"text": "سمرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم کپڑوں میں سے سفید کپڑے پہنا کرو کیونکہ وہ پاکیزہ اور عمدہ ہوتا ہے، نیز اپنے مردوں کو ( بھی ) اسی میں کفنایا کرو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1897,
			"arabicnumber": 1897,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کو تین سفید یمنی کپڑوں میں کفنایا گیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": 1898,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم تین سفید یمنی کپڑوں میں کفنائے گئے جن میں نہ تو قمیص تھی اور نہ عمامہ ( پگڑی ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": 1899,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کو تین سفید یمنی سوتی کپڑوں میں کفنایا گیا جس میں نہ تو قمیص تھی، اور نہ عمامہ ( پگڑی ) ، ام المؤمنین عائشہ رضی اللہ عنہا سے دو کپڑوں اور ایک یمنی چادر کے متعلق لوگوں کی گفتگو کا ذکر کیا گیا، تو انہوں نے کہا: چادر لائی گئی تھی لیکن لوگوں نے اسے لوٹا دیا، اور آپ کو اس میں نہیں کفنایا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": 1900,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ جب عبداللہ بن ابی ( منافق ) مر گیا، تو اس کے بیٹے ( عبداللہ رضی اللہ عنہ ) نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، ( اور ) عرض کیا: ( اللہ کے رسول! ) آپ مجھے اپنی قمیص دے دیجئیے تاکہ میں اس میں انہیں کفنا دوں، اور آپ ان پر نماز ( جنازہ ) پڑھ دیجئیے، اور ان کے لیے مغفرت کی دعا بھی کر دیجئیے، تو آپ صلی اللہ علیہ وسلم نے اپنی قمیص انہیں دے دی، پھر فرمایا: جب تم فارغ ہو لو تو مجھے خبر کرو میں ان کی نماز ( جنازہ ) پڑھوں گا ( اور جب نماز کے لیے کھڑے ہوئے ) تو عمر رضی اللہ عنہ نے آپ کو کھینچا، اور کہا: اللہ تعالیٰ نے آپ کو منافقین پر نماز ( جنازہ ) پڑھنے سے منع فرمایا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: میں دو اختیارات کے درمیان ہوں ( اللہ تعالیٰ نے ) فرمایا: «‏استغفر لهم أو لا تستغفر لهم» تم ان کے لیے مغفرت چاہو یا نہ چاہو دونوں برابر ہے ( التوبہ: ۸۰ ) چنانچہ آپ نے اس کی نماز ( جنازہ ) پڑھی، تو اللہ تعالیٰ نے ( یہ آیت ) نازل فرمائی: «ولا تصل على أحد منهم مات أبدا ولا تقم على قبره» تم ان ( منافقین ) میں سے کسی پر کبھی بھی نماز جنازہ نہ پڑھو، اور نہ ہی ان کی قبر پر کھڑے ہو ( التوبہ: ۸۴ ) تو آپ نے ان کی نماز جنازہ پڑھنا چھوڑ دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": 1901,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم عبداللہ بن ابی کی قبر پر آئے، اور اسے اس کی قبر میں رکھا جا چکا تھا، تو آپ اس پر کھڑے ہوئے، اور اس کے نکالنے کا حکم دیا تو اسے نکالا گیا، تو آپ نے اسے اپنے دونوں گھٹنوں پر رکھا، اور اپنی قمیص پہنائی اور اس پر تھو تھو کیا، واللہ تعالیٰ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": 1902,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ عباس بن عبدالمطلب رضی اللہ عنہ مدینے میں تھے، تو انصار نے ایک کپڑا تلاش کیا جو انہیں پہنائیں، تو عبداللہ بن ابی کی قمیص کے سوا کوئی قمیص نہیں ملی جو ان پر فٹ آتی، تو انہوں نے انہیں وہی پہنا دیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": 1903,
			"text": "خباب رضی الله عنہ بیان کرتے ہیں کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہجرت کی، ہم اللہ تعالیٰ کی رضا چاہ رہے تھے، اللہ تعالیٰ پر ہمارا اجر ثابت ہو گیا، پھر ہم میں سے کچھ لوگ وہ ہیں جو مر گئے ( اور ) اس اجر میں سے ( دنیا میں ) کچھ بھی نہیں چکھا، انہیں میں سے مصعب بن عمیر رضی اللہ عنہ ہیں، جو جنگ احد میں قتل کئے گئے، تو ہم نے سوائے ایک ( چھوٹی ) دھاری دار چادر کے کوئی ایسی چیز نہیں پائی جس میں انہیں کفناتے، جب ہم ان کا سر ڈھکتے تو پیر کھل جاتا، اور جب پیر ڈھکتے تو سر کھل جاتا، تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم ان کا سر ڈھک دیں اور ان کے پیروں پہ اذخر نامی گھاس ڈال دیں، اور ہم میں سے کچھ لوگ وہ ہیں جن کے پھل پکے اور وہ اسے چن رہے ہیں ( یہ الفاظ اسماعیل کے ہیں ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": 1904,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: محرم کو اس کے ان ہی دونوں کپڑوں میں غسل دو جن میں وہ احرام باندھے ہوئے تھا، اور اسے پانی اور بیر ( کے پتوں ) سے نہلاؤ، اور اسے اس کے دونوں کپڑوں ہی میں کفناؤ، نہ اسے خوشبو لگاؤ، اور نہ ہی اس کا سر ڈھکو، کیونکہ وہ قیامت کے دن احرام باندھے ہوئے اٹھے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عمدہ ترین خوشبو مشک ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": 1906,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارے بہترین خوشبوؤں میں سے مشک ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": 1907,
			"text": "ابوامامہ بن سہل بن حنیف رضی الله عنہ کہتے ہیں کہ ایک مسکین عورت بیمار ہو گئی، رسول اللہ صلی اللہ علیہ وسلم کو اس کی بیماری کی خبر دی گئی ( رسول اللہ صلی اللہ علیہ وسلم مسکینوں اور غریبوں کی بیمار پرسی کرتے اور ان کے بارے میں پوچھتے رہتے تھے ) تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب یہ مر جائے تو مجھے خبر کرنا ، رات میں اس کا جنازہ لے جایا گیا ( تو ) لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو بیدار کرنا مناسب نہ جانا، جب رسول اللہ صلی اللہ علیہ وسلم نے صبح کی تو ( رات میں ) جو کچھ ہوا تھا آپ کو اس کی خبر دی گئی، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا میں نے تمہیں حکم نہیں دیا تھا کہ مجھے اس کی خبر کرنا؟ تو انہوں نے کہا: اللہ کے رسول! ہم نے آپ کو رات میں جگانا نا مناسب سمجھا، رسول اللہ صلی اللہ علیہ وسلم ( اپنے صحابہ کے ساتھ ) نکلے یہاں تک کہ اس کی قبر پہ لوگوں کی صف بندی ۱؎ کی اور چار تکبیریں کہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": 1908,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: جب نیک بندہ اپنی چارپائی پہ رکھا جاتا ہے، تو وہ کہتا ہے: مجھے جلدی لے چلو، مجھے جلدی لے چلو، اور جب برا آدمی اپنی چارپائی پہ رکھا جاتا ہے، تو کہتا ہے: ہائے میری تباہی! تم مجھے کہاں لے جا رہے ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": 1909,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب جنازہ ( چارپائی پر ) رکھا جاتا ہے ( اور ) لوگ اسے اپنے کندھوں پہ اٹھاتے ہیں، تو اگر وہ نیکوکار ہوتا ہے تو کہتا ہے: مجھے جلدی لے چلو، مجھے جلدی لے چلو، اور اگر برا ہوتا ہے تو کہتا ہے: ہائے اس کی ہلاکت! تم اسے کہاں لے جا رہے ہو، اس کی آواز ہر چیز سنتی ہے سوائے انسان کے، اگر انسان اسے سن لے تو بیہوش ہو جائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": 1910,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جنازے کو تیز لے چلو کیونکہ اگر وہ نیک ہے تو تم اسے نیکی کی طرف ( جلد ) لے جاؤ گے، اور اگر اس کے علاوہ ہے تو وہ ایک شر ہے جسے تم ( جلد ) اپنی گردنوں سے اتار پھینکو گے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": 1911,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: ”جنازے کو جلدی لے چلو، کیونکہ اگر وہ نیک ہے تو تم اسے خیر کی طرف جلد لے جاؤ گے، اور اگر بد ہے تو شر کو اپنی گردنوں سے ( جلد ) اتار پھینکو گے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": 1912,
			"text": "عبدالرحمٰن بن جوشن کہتے ہیں میں عبدالرحمٰن بن سمرہ رضی اللہ عنہ کے جنازے میں موجود تھا، زیاد نکلے تو وہ چارپائی کے آگے چل رہے تھے، عبدالرحمٰن رضی اللہ عنہ کے گھر والوں میں سے کچھ لوگ اور ان کے غلام چارپائی کو سامنے کر کے اپنی ایڑیوں کے بل چلنے لگے، وہ کہہ رہے تھے: آہستہ چلو، آہستہ چلو، اللہ تمہیں برکت دے، تو وہ لوگ رینگنے کے انداز میں چلنے لگے، یہاں تک کہ جب ہم مربد کے راستے میں تھے تو ابوبکرہ رضی اللہ عنہ ہمیں ایک خچر پر ( سوار ) ملے، جب انہوں نے انہیں ( ایسا ) کرتے دیکھا، تو اپنے خچر پر ( سوار ) ان کے پاس گئے اور کوڑے سے ان کی طرف اشارہ کیا، اور کہا: قسم! اس ذات کی جس نے ابوالقاسم صلی اللہ علیہ وسلم کو عزت بخشی، میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اپنے آپ کو دیکھا کہ ہم جنازے کے ساتھ تقریباً دوڑتے ہوئے چلتے، تو لوگ ( یہ سن کر ) خوش ہوئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": 1913,
			"text": "ابوبکرہ رضی الله عنہ کہتے ہیں کہ میں نے ( صحابہ کرام ) کو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اپنے آپ کو دیکھا ہم جنازے کے ساتھ تقریباً دوڑتے ہوئے چلتے۔ یہ الفاظ ہشیم کی روایت کے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": 1914,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تمہارے ( سامنے ) سے جنازہ گزرے تو کھڑے ہو جاؤ، ( اور ) جو ( جنازے ) کے ساتھ جائے وہ نہ بیٹھے یہاں تک کہ اسے رکھ دیا جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": 1915,
			"text": "عامر بن ربیعہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی جنازہ دیکھے ( اور ) اس کے ساتھ جا نہ رہا ہو تو وہ کھڑا رہے یہاں تک کہ ( جنازہ ) اس سے آگے نکل جائے یا آگے نکلنے سے پہلے رکھ دیا جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": 1916,
			"text": "عامر بن ربیعہ عدوی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم جنازہ دیکھو تو کھڑے ہو جاؤ یہاں تک کہ وہ تم سے آگے نکل جائے، یا رکھ دیا جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": 1917,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم جنازہ دیکھو تو کھڑے ہو جاؤ، ( اور ) جو اس کے پیچھے پیچھے جا رہا ہو جب تک جنازہ رکھ نہ دیا جائے وہ نہ بیٹھے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1918,
			"arabicnumber": 1918,
			"text": "ابوہریرہ اور ابو سعید خدری رضی الله عنہما کہتے ہیں کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کو کبھی نہیں دیکھا کہ آپ جنازے کے ساتھ ہوں، ( اور ) بیٹھ گئے ہوں یہاں تک کہ وہ رکھ دیا جائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": 1919,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ ( لے کر ) گزرے، تو آپ کھڑے ہو گئے، اور عمرو بن علی کی روایت میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ گزرا تو آپ کھڑے ہو گئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": 1920,
			"text": "یزید بن ثابت رضی الله عنہ سے روایت ہے کہ وہ لوگ نبی اکرم صلی اللہ علیہ وسلم کے ساتھ بیٹھے تھے ( اتنے میں ) ایک جنازہ نظر آیا تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہو گئے، اور جو ان کے ساتھ تھے وہ بھی کھڑے ہو گئے، تو وہ لوگ برابر کھڑے رہے یہاں تک کہ وہ نکل گیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": 1921,
			"text": "عبدالرحمٰن بن ابی لیلیٰ کہتے ہیں کہ سہل بن حنیف اور قیس بن سعد بن عبادہ رضی اللہ عنہ قادسیہ میں تھے۔ ان دونوں کے قریب سے ایک جنازہ لے جایا گیا، تو دونوں کھڑے ہو گئے تو ان سے کہا گیا: یہ تو ذمی ہے؟ تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ لے جایا گیا تو آپ کھڑے ہو گئے، تو آپ سے عرض کیا گیا یہ تو یہودی ہے؟ تو آپ صلی اللہ علیہ وسلم نے کہا: ”کیا یہ روح نہیں ہے؟“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": 1922,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ ایک جنازہ ہمارے پاس سے گزرا تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہو گئے، اور آپ کے ساتھ ہم بھی کھڑے ہو گئے، میں نے عرض کیا: اللہ کے رسول! یہ جنازہ ( ایک ) یہودی عورت کا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”موت ایک قسم کی ہیبت ہے، تو جب تم جنازہ دیکھو تو کھڑے ہو جاؤ“، یہ الفاظ خالد کے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": 1923,
			"text": "ابومعمر کہتے ہیں کہ ہم علی رضی اللہ عنہ کے پاس تھے ( اتنے میں ) ایک جنازہ گزرا تو لوگ کھڑے ہو گئے، تو علی رضی اللہ عنہ نے کہا: یہ کیا ہے؟ لوگوں نے کہا: ابوموسیٰ اشعری کا حکم ہے، تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم ایک یہودی عورت کے جنازے کے لیے کھڑے ہوئے تھے، ( پھر ) اس کے بعد آپ کبھی کھڑے نہیں ہوئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": 1924,
			"text": "محمد بن سیرین سے روایت ہے کہ ایک جنازہ حسن بن علی اور ابن عباس رضی اللہ عنہم کے پاس سے گزرا، تو حسن رضی اللہ عنہ کھڑے ہو گئے، اور ابن عباس رضی اللہ عنہما نہیں کھڑے ہوئے، تو حسن رضی اللہ عنہ نے کہا: کیا رسول اللہ صلی اللہ علیہ وسلم ایک یہودی کا جنازہ ( دیکھ کر ) کھڑے نہیں ہوئے تھے؟ تو ابن عباس رضی اللہ عنہما نے کہا: ہاں، پھر بیٹھے رہنے لگے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1925,
			"arabicnumber": 1925,
			"text": "اس سند سے بھی ابن سیرین کہتے ہیں کہ حسن بن علی اور ابن عباس رضی اللہ عنہم کے قریب سے ایک جنازہ گزرا، تو حسن رضی اللہ عنہ کھڑے ہو گئے، اور ابن عباس رضی اللہ عنہما نہیں کھڑے ہوئے، تو حسن رضی اللہ عنہ نے ابن عباس سے کہا: کیا اس کے لیے رسول اللہ صلی اللہ علیہ وسلم کھڑے نہیں ہوئے تھے؟ تو ابن عباس رضی اللہ عنہما نے کہا: کھڑے ہوئے تھے پھر بیٹھے رہنے لگے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": 1926,
			"text": "اس سند سے بھی ابن عباس رضی الله عنہما اور حسن بن علی رضی الله عنہما سے روایت ہے کہ ان دونوں کے پاس سے ایک جنازہ گزرا تو ان میں سے ایک کھڑے ہو گئے، اور دوسرے بیٹھے رہے، تو جو کھڑے ہو گئے تھے انہوں نے کہا: سنو! اللہ کی قسم! مجھے یہی معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے تھے، تو جو بیٹھے رہ گئے تھے انہوں نے کہا: مجھے ( یہ بھی ) معلوم ہو کہ رسول اللہ صلی اللہ علیہ وسلم ( بعد میں ) بیٹھے رہنے لگے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": 1927,
			"text": "محمد بن علی الباقر کہتے ہیں کہ حسن بن علی رضی اللہ عنہما بیٹھے تھے کہ ایک جنازہ گزرا تو لوگ کھڑے ہو گئے یہاں تک کہ جنازہ گزر گیا، تو حسن رضی اللہ عنہ نے کہا: ایک یہودی کا جنازہ گزرا، رسول اللہ صلی اللہ علیہ وسلم اسی راستے میں بیٹھے تھے تو آپ نے ناپسند کیا کہ ایک یہودی کا جنازہ آپ کے سر سے بلند ہو تو آپ کھڑے ہو گئے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": 1928,
			"text": "",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1929,
			"arabicnumber": 1929,
			"text": "انس رضی الله عنہ سے روایت ہے کہ ایک جنازہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے گزرا تو آپ کھڑے ہو گئے، آپ سے کہا گیا: یہ ایک یہودی کا جنازہ ہے تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”ہم فرشتوں ( کی تکریم میں ) کھڑے ہوئے ہیں، ( نہ کہ جنازہ کی ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": 1930,
			"text": "ابوقتادہ بن ربعی رضی الله عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ لے جایا گیا، تو آپ نے فرمایا: ( یہ ) «مستریح» ہے یا «مستراح منہ» ہے، تو لوگوں نے پوچھا: «مستریح» اور «مستراح منہ» سے کیا مراد ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”بندہ مومن ( موت کے بعد ) دنیا کی بلا اور تکلیف سے راحت پا لیتا ہے، اور فاجر ۱؎ بندہ مرتا ہے تو اس سے اللہ کے بندے، بستیاں، پیڑ پودے، اور چوپائے ( سب ) راحت پا لیتے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1931,
			"arabicnumber": 1931,
			"text": "ابوقتادہ رضی الله عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے تھے کہ اتنے میں ایک جنازہ نظر آیا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہ «مستریح» ہے یا «مستراح منہ» ہے، ( کیونکہ ) جب مومن مرتا ہے تو دنیا کی مصیبتوں، بلاؤں اور تکلیفوں سے نجات پا لیتا ہے، اور فاجر مرتا ہے تو اس سے ( اللہ کے ) بندے، ملک و شہر، پیڑ پودے، اور چوپائے ( سب ) راحت پا لیتے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": 1932,
			"text": "انس رضی الله عنہ کہتے ہیں کہ ایک جنازہ لے جایا گیا تو اس کی تعریف کی گئی، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”واجب ہو گئی“، ( پھر ) ایک دوسرا جنازہ لے جایا گیا، تو اس کی مذمت کی گئی تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”واجب ہو گئی“، تو عمر رضی اللہ عنہ نے عرض کیا: میرے ماں باپ آپ پر فدا ہوں، ایک جنازہ لے جایا گیا تو اس کی تعریف کی گئی، تو آپ نے فرمایا: واجب ہو گئی پھر ایک دوسرا جنازہ لے جایا گیا تو اس کی مذمت کی گئی، تو آپ نے فرمایا: واجب ہو گئی؟، تو آپ نے فرمایا: ”تم لوگوں نے جس کی تعریف کی تھی اس کے لیے جنت واجب ہو گئی، اور جس کی مذمت کی تھی اس کے لیے جہنم واجب ہو گئی، تم ۱؎ روئے زمین پر اللہ کے گواہ ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": 1933,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ لوگ نبی اکرم صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ لے کر گزرے، تو لوگوں نے اس کی تعریف کی تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا ”: واجب ہو گئی“، پھر لوگ ایک دوسرا جنازہ لے کر گزرے، تو لوگوں نے اس کی مذمت کی تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”واجب ہو گئی“، لوگوں نے پوچھا: اللہ کے رسول! آپ کے پہلی بار اور دوسری بار «وجبت» کہنے سے کیا مراد ہے؟ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”فرشتے آسمان پر اللہ کے گواہ ہیں، اور تم زمین پر اللہ کے گواہ ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": 1934,
			"text": "ابو اسود دیلی کہتے ہیں کہ میں مدینہ آیا تو عمر بن خطاب رضی اللہ عنہ کے پاس بیٹھا اتنے میں ایک جنازہ لے جایا گیا، تو اس کی تعریف کی گئی تو عمر رضی اللہ عنہ نے کہا: واجب ہو گئی، پھر ایک دوسرا جنازہ لے جایا گیا، تو اس کی ( بھی ) تعریف کی گئی، تو عمر رضی اللہ عنہ نے کہا: واجب ہو گئی، پھر ایک تیسرا جنازہ لے جایا گیا، تو اس کی مذمت کی گئی، تو عمر رضی اللہ عنہ نے کہا: واجب ہو گئی، تو میں نے پوچھا: امیر المؤمنین! کیا واجب ہو گئی؟ انہوں نے کہا: میں نے وہی بات کہی جو رسول اللہ صلی اللہ علیہ وسلم نے فرمائی: ”جس مسلمان کے لیے بھی چار لوگوں نے خیر کی گواہی دی تو اللہ اسے جنت میں داخل کرے گا“، ہم نے پوچھا: ( اگر ) تین گواہی دیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”تین ہی سہی“، ( پھر ) ہم نے پوچھا: ( اگر ) دو گواہی دیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”دو ہی سہی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": 1935,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک مرے ہوئے شخص کا ذکر برائی سے کیا گیا، تو آپ نے فرمایا: ”تم اپنے مردوں کا ذکر صرف بھلائی کے ساتھ کیا کرو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": 1936,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم اپنے مردوں کو برا بھلا نہ کہو کیونکہ انہوں نے جو کچھ آگے بھیجا تھا، اس تک پہنچ چکے ہیں“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": 1937,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مردے ( کے ساتھ ) تین چیزیں ( قبرستان تک ) جاتی ہیں: اس کے گھر والے، اس کا مال، اور اس کا عمل، ( پھر ) دو چیزیں یعنی اس کے گھر والے اور اس کا مال لوٹ آتے ہیں، اور ایک باقی رہ جاتا ہے اور وہ اس کا عمل ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": 1938,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مومن کے مومن پر چھ حقوق ہیں: جب بیمار ہو تو وہ اس کی عیادت کرے، جب مر جائے تو اس کے جنازے میں شریک رہے، جب دعوت کرے تو اسے قبول کرے، جب وہ اس سے ملے تو اسے سلام کرے، جب چھینکے اور «الحمد للہ» کہے تو جواب میں «یرحمک اللہ» کہے، اور اس کی خیر خواہی کرے خواہ اس کے پیٹھ پیچھے ہو یا سامنے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": 1939,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں سات چیزوں کا حکم دیا، اور سات باتوں سے منع فرمایا: ہمیں آپ نے مریض کی عیادت کرنے، چھینکنے والے کے جواب میں «یرحمک اللہ» کہنے، قسم پوری کرانے، مظلوم کی مدد کرنے، سلام کو عام کرنے، دعوت دینے والوں ( کی دعوت ) قبول کرنے، اور جنازے کے ساتھ جانے کا حکم دیا، اور ہمیں آپ نے سونے کی انگوٹھیاں پہننے سے، چاندی کے برتن ( میں کھانے، پینے ) سے، میاثر، قسّیہ، استبرق ۱؎، حریر اور دیباج نامی ریشمی کپڑوں سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": 1940,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص جنازے کے ساتھ گیا، اور اس کے ساتھ رہا یہاں تک کہ اس پر جنازہ کی نماز پڑھی گئی اس کے لیے ایک قیراط کا ثواب ہے، اور جو شخص کسی جنازے کے ساتھ گیا، اور اس کے ساتھ رہا یہاں تک وہ دفن کر دیا گیا، تو اس کے لیے دو قیراط کا ثواب ہے، اور ایک قیراط احد ( پہاڑ ) کے مثل ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": 1941,
			"text": "عبداللہ بن مغفل رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص کسی جنازے کے ساتھ جائے، اور اس کے ساتھ رہے یہاں تک کہ اس سے فارغ ہو لیا جائے، تو اس کے لیے دو قیراط کا ثواب ہے، اور اگر لوٹ آئے قبل اس کے کہ اس سے فارغ ہوا جائے، تو اس کے لیے ایک قیراط کا ثواب ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": 1942,
			"text": "مغیرہ بن شعبہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سوار جنازے کے پیچھے رہے، پیدل چلنے والا جہاں چاہے رہے، اور بچوں پہ نماز جنازہ پڑھی جائے گی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": 1943,
			"text": "مغیرہ بن شعبہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سوار جنازے کے پیچھے رہے، پیدل چلنے والا ( آگے پیچھے دائیں بائیں ) جہاں چاہے رہے، اور بچوں پہ نماز جنازہ پڑھی جائے گی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": 1944,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کو اور ابوبکر و عمر رضی اللہ عنہما کو جنازے کے آگے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": 1945,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم ، ابوبکر، عمر اور عثمان رضی اللہ عنہم کو جنازے کے آگے ( پیدل ) چلتے دیکھا ہے۔ صرف راوی بکر نے عثمان رضی اللہ عنہ کا ذکر نہیں کیا ہے۔ نسائی کہتے ہیں: اس حدیث کا موصول ہونا غلط ہے، اور درست مرسل ہونا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": 1946,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تمہارا بھائی مر گیا ہے، اٹھو اس کی نماز جنازہ پڑھو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": 1947,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ انصار کے بچوں میں سے ایک بچہ رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا گیا، تو آپ نے اس کی جنازے کی نماز پڑھی، میں نے کہا: ( یہ ) خوش بخت جنت کی چڑیوں میں سے ایک چڑیا ہے، نہ تو اس نے کوئی برا کام کیا، اور نہ اس عمر رضی اللہ عنہ کو پہنچا، آپ صلی اللہ علیہ وسلم نے فرمایا: ”یا عائشہ! اس کے علاوہ کچھ اور معاملہ ہے اللہ تعالیٰ نے جنت کی تخلیق فرمائی، اور اس کے لیے لوگ پیدا کئے، جبکہ اپنے باپوں کی پشت میں تھے، اور ( اللہ ) نے جہنم کی تخلیق کی، اور اس کے لیے لوگ پیدا کیے جبکہ وہ اپنے باپوں کی پشت میں تھے“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": 1948,
			"text": "مغیرہ بن شعبہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سوار جنازے کے پیچھے رہے، پیدل چلنے والا اس کے ( آگے پیچھے دائیں بائیں ) جس طرف چاہے رہے، اور شیرخوار بچہ کی نماز جنازہ پڑھی جائے گی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": 1949,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے مشرکوں کی اولاد کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”جو کچھ وہ کرنے والے تھے اللہ تعالیٰ اسے خوب جانتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": 1950,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے پوچھا گیا تو آپ نے فرمایا: ”اللہ تعالیٰ جو وہ کرنے والے تھے اسے خوب جانتا ہے“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1951,
			"arabicnumber": 1951,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”انہیں اللہ تعالیٰ نے پیدا کیا ( اور ) جس وقت انہیں پیدا کیا وہ جانتا تھا ( کہ آئندہ ) وہ کیا کرنے والے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": 1952,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سے مشرکین کی اولاد کے بارے میں پوچھا گیا تو آپ نے فرمایا: ”اللہ تعالیٰ اسے خوب جانتا ہے جو وہ کرنے والے تھے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": 1953,
			"text": "شداد بن ہاد رضی الله عنہ سے روایت ہے کہ ایک بادیہ نشین نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور آپ پر ایمان لے آیا، اور آپ کے ساتھ ہو گیا، پھر اس نے عرض کیا: میں آپ کے ساتھ ہجرت کروں گا، نبی اکرم صلی اللہ علیہ وسلم نے اپنے بعض اصحاب کو اس کا خیال رکھنے کی وصیت کی، جب ایک غزوہ ہوا تو نبی اکرم صلی اللہ علیہ وسلم مال غنیمت میں کچھ لونڈیاں ملیں، تو آپ نے انہیں تقسیم کیا، اور اس کا ( بھی ) حصہ لگایا، چنانچہ اس کا حصہ اپنے ان اصحاب کو دے دیا جن کے سپرد اسے کیا گیا تھا، وہ ان کی سواریاں چراتا تھا، جب وہ آیا تو انہوں نے ( اس کا حصہ ) اس کے حوالے کیا، اس نے پوچھا: یہ کیا ہے؟ تو انہوں نے کہا: یہ حصہ نبی اکرم صلی اللہ علیہ وسلم نے تمہارے لیے لگایا تھا، تو اس نے اسے لے لیا، ( اور ) نبی اکرم صلی اللہ علیہ وسلم کے پاس لے کر آیا، اور عرض کیا: ( اللہ کے رسول! ) یہ کیا ہے؟ آپ نے فرمایا: ”میں نے تمہارا حصہ دیا ہے“، تو اس نے کہا: میں نے اس ( حقیر بدلے ) کے لیے آپ کی پیروی نہیں کی ہے، بلکہ میں نے اس بات پر آپ کی پیروی کی ہے کہ میں تیر سے یہاں مارا جاؤں، ( اس نے اپنے حلق کی طرف اشارہ کیا ) پھر میں مروں اور جنت میں داخل ہو جاؤں، تو آپ نے فرمایا: ”اگر تم سچے ہو تو اللہ تعالیٰ بھی اپنا وعدہ سچ کر دکھائے گا“، پھر وہ لوگ تھوڑی دیر ٹھہرے رہے، پھر دشمنوں سے لڑنے کے لیے اٹھے، تو انہیں ( کچھ دیر کے بعد ) نبی اکرم صلی اللہ علیہ وسلم کے پاس اٹھا کر لایا گیا، اور انہیں ایسی جگہ تیر لگا تھا جہاں انہوں نے اشارہ کیا تھا، نبی اکرم صلی اللہ علیہ وسلم نے پوچھا: ”کیا یہ وہی شخص ہے؟“ لوگوں نے جواب دیا: جی ہاں، آپ نے فرمایا: ”اس نے اللہ تعالیٰ سے اپنا وعدہ سچ کر دکھایا تو ( اللہ تعالیٰ ) نے ( بھی ) اپنا وعدہ اسے سچ کر دکھایا“ ۱؎ پھر نبی اکرم صلی اللہ علیہ وسلم نے اپنے جبّے ( قمیص ) میں اسے کفنایا، پھر اسے اپنے سامنے رکھا، اور اس کی جنازے کی نماز پڑھی ۲؎ آپ کی نماز میں سے جو چیز لوگوں کو سنائی دی وہ یہ دعا تھی: «اللہم هذا عبدك خرج مهاجرا في سبيلك فقتل شهيدا أنا شهيد على ذلك» ”اے اللہ! یہ تیرا بندہ ہے، یہ تیری راہ میں ہجرت کر کے نکلا، اور شہید ہو گیا، میں اس بات پر گواہ ہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": 1954,
			"text": "عقبہ رضی الله عنہ سے روایت ہے کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم ( مدینہ سے باہر ) نکلے، اور غزوہ احد کے شہیدوں پر نماز ( جنازہ ) پڑھی ۱؎ جیسے میت کی نماز جنازہ پڑھتے تھے، پھر منبر کی طرف پلٹے اور فرمایا: ”میں ( قیامت میں ) تمہارا پیش رو ہوں، اور تم پر گواہ ( بھی ) ہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": 1955,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم غزوہ احد کے مقتولین میں سے میں سے دو آدمیوں کو ایک کپڑے میں اکٹھا کرتے، پھر پوچھتے: ”ان دونوں میں کس کو قرآن زیادہ یاد تھا؟“ جب لوگ ان دونوں میں سے ایک کی طرف اشارہ کرتے تو آپ اسے قبر میں پہلے رکھتے، اور فرماتے: ”میں ان پر گواہ ہوں“، آپ نے انہیں ان کے خون سمیت دفن کرنے کا حکم دیا، اور نہ ان کی نماز جنازہ پڑھی گئی ۱؎ اور نہ انہیں غسل دیا گیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": 1956,
			"text": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ قبیلہ اسلم کے ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر زنا کا اعتراف کیا، تو آپ نے اس کی طرف سے ( اپنا منہ ) پھیر لیا، اس نے دوبارہ اعتراف کیا تو آپ نے ( پھر ) اپنا منہ پھیر لیا، اس نے پھر تیسری دفعہ اعتراف کیا، تو آپ نے ( پھر ) اپنا منہ پھیر لیا، یہاں تک کہ اس نے اپنے خلاف چار مرتبہ گواہیاں دیں، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کیا تجھے جنون ہے؟“ اس نے کہا: نہیں، آپ نے پوچھا: ”کیا تو شادی شدہ ہے؟“ اس نے کہا: ہاں، تو نبی اکرم صلی اللہ علیہ وسلم نے حکم دیا تو اس کو رجم کر دیا گیا، جب اسے پتھر لگا تو بھاگ کھڑا ہوا، پھر وہ پکڑا گیا تو پتھروں سے مارا گیا، تو اور مر گیا، نبی اکرم صلی اللہ علیہ وسلم نے اس کے حق میں اچھی بات کہی، اور اس کی نماز جنازہ نہیں پڑھی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": 1957,
			"text": "عمران بن حصین رضی الله عنہ سے روایت ہے کہ قبیلہ جہینہ کی ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی، اور کہنے لگی: میں نے زنا کیا ہے، وہ حاملہ تھی، تو آپ نے اسے اس کے ولی کے سپرد کر دیا اور کہا: ”اسے اچھی طرح رکھو، اور جب بچہ جن دے تو میرے پاس لے کر آنا“، چنانچہ جب اس نے بچہ جن دیا تو ولی اسے لے کر آیا، تو آپ نے اسے حکم دیا، اس کے کپڑے باندھ دیئے گئے، پھر آپ نے اسے رجم کیا، پھر اس کی نماز جنازہ پڑھی، اس پر عمر رضی اللہ عنہ نے آپ سے عرض کیا: آپ اس کی نماز جنازہ پڑھ رہے ہیں؟ حالانکہ وہ زنا کر چکی ہے، تو آپ نے فرمایا: ”اس نے ایسی توبہ کی ہے کہ اگر وہ اہل مدینہ کے ستر لوگوں کے درمیان تقسیم کر دی جائے تو ان سب کو کافی ہو جائے، اور اس سے بہتر توبہ اور کیا ہو گی کہ اس نے اللہ تعالیٰ ( کی شریعت کے پاس و لحاظ میں ) اپنی جان ( تک ) قربان کر دی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": 1958,
			"text": "عمران بن حصین رضی الله عنہ سے روایت ہے کہ ایک شخص نے موت کے وقت اپنے چھ غلام آزاد کر دیئے، اس کے پاس ان کے علاوہ اور کوئی مال ( مال و اسباب ) نہ تھا، یہ بات نبی اکرم صلی اللہ علیہ وسلم کو معلوم ہوئی تو آپ اس سے ناراض ہوئے، اور فرمایا: ”میں نے ارادہ کیا کہ اس کی نماز جنازہ نہ پڑھوں“، پھر آپ نے اس کے غلاموں کو بلایا، اور ان کے تین حصے کیے، پھر ان کے درمیان قرعہ اندازی کی، اور دو کو آزاد کر دیا، اور چار کو رہنے دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": 1959,
			"text": "زید بن خالد رضی الله عنہ کہتے ہیں کہ ایک شخص خیبر میں مر گیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم لوگ اپنے ساتھی کی نماز جنازہ پڑھ لو، اس نے اللہ کی راہ میں چوری کی ہے“، تو ( جب ) ہم نے اس کے اسباب کی تلاشی لی تو ہمیں اس میں یہود کے نگینوں میں سے کچھ نگینے ملے، جو دو درہم کے برابر بھی نہیں تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": 1960,
			"text": "ابوقتادہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس انصار کا ایک شخص لایا گیا تاکہ آپ اس کی نماز جنازہ پڑھ دیں، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم لوگ اپنے ساتھی کی نماز جنازہ پڑھ لو ( میں نہیں پڑھتا ) کیونکہ اس پر قرض ہے“، ابوقتادہ رضی اللہ عنہ نے کہا: یہ میرے ذمہ ہے، نبی اکرم صلی اللہ علیہ وسلم نے پوچھا: ”تم اس کی ادائیگی کرو گے؟“ تو انہوں نے کہا: ہاں میں اس کی ادائیگی کروں گا، تب آپ نے اس کی نماز جنازہ پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": 1961,
			"text": "سلمہ بن الاکوع رضی الله عنہ بیان کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک جنازہ لایا گیا تو لوگوں نے کہا: اللہ کے نبی! اس کی نماز جنازہ پڑھ دیجئیے، آپ نے پوچھا: ”کیا اس نے اپنے اوپر کچھ قرض چھوڑا ہے؟“ لوگوں نے کہا: جی ہاں، آپ نے پوچھا: ”کیا اس نے اس کی ادائیگی کے لیے کوئی چیز چھوڑی ہے؟“ لوگوں نے کہا: نہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”تم اپنے ساتھی کی نماز جنازہ پڑھ لو“، تو ابوقتادہ نامی ایک انصاری نے عرض کیا: آپ اس کی نماز ( جنازہ ) پڑھ دیجئیے، اس کا قرض میرے ذمہ ہے، تو آپ صلی اللہ علیہ وسلم نے اس کی نماز ( جنازہ ) پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": 1962,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم مقروض آدمی کی نماز جنازہ نہیں پڑھتے تھے، چنانچہ ایک جنازہ آپ کے پاس لایا گیا تو آپ نے پوچھا: ”کیا اس پر قرض ہے؟“ لوگوں نے جواب دیا: ہاں، اس پر دو دینار ( کا قرض ) ہے، آپ نے فرمایا: ”تم لوگ اپنے ساتھی پر نماز جنازہ پڑھ لو“، ابوقتادہ رضی اللہ عنہ نے عرض کیا: اللہ کے رسول! یہ دونوں دینار میرے ذمہ ہیں، تو آپ نے اس کی نماز جنازہ پڑھی، پھر جب اللہ تعالیٰ نے اپنے رسول کو فتح و نصرت عطا کی، تو آپ نے فرمایا: ”میں ہر مومن پر اس کی جان سے زیادہ حق رکھتا ہوں، جو قرض چھوڑ کر مرے ( اس کی ادائیگی ) مجھ پر ہے، اور جو مال چھوڑ کر مرے تو وہ اس کے وارثوں کا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": 1963,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ جب کوئی مومن مرتا اور اس پر قرض ہوتا ہے تو رسول اللہ صلی اللہ علیہ وسلم پوچھتے: ”کیا اس نے اپنے قرض کی ادائیگی کے لیے کچھ چھوڑا ہے؟“ اگر لوگ کہتے: جی ہاں، تو آپ اس کی نماز جنازہ پڑھتے، اور اگر کہتے: نہیں، تو آپ کہتے: ”تم اپنے ساتھی پر نماز ( جنازہ ) پڑھ لو“۔ پھر جب اللہ تعالیٰ نے اپنے رسول صلی اللہ علیہ وسلم پر فتح و نصرت کا دروازہ کھولا، تو آپ نے فرمایا: ”میں مومنوں پر ان کی جانوں سے زیادہ حق رکھتا ہوں، تو جو وفات پا جائے اور اس پر قرض ہو، تو ( اس کی ادائیگی ) مجھ پر ہے، اور اگر کوئی مال چھوڑ کر گیا تو وہ اس کے وارثوں کا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": 1964,
			"text": "ابن سمرہ رضی الله عنہ سے روایت ہے کہ ایک شخص نے تیر کی انی سے خودکشی کر لی، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”رہا میں تو میں اس کی نماز جنازہ نہیں پڑھ سکتا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1965,
			"arabicnumber": 1965,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اپنے آپ کو کسی پہاڑ سے گرا کر مار ڈالے، تو وہ جہنم میں ہمیشہ ہمیش اپنے آپ کو اوپر سے نیچے گراتا رہے گا، اور جو زہر پی کر اپنے آپ کو مار ڈالے تو وہ زہر اس کے ہاتھ میں رہے گا اسے وہ ہمیشہ ہمیش جہنم میں پیتا رہے گا، اور جو شخص کسی دھار دار چیز سے اپنے آپ کو مار ڈالے ( راوی کہتے ہیں: پھر کوئی چیز میرے سننے سے رہ گئی ۱؎، خالد کہہ رہے تھے: ) تو اس کا لوہا اس کے ہاتھ میں ہو گا اسے وہ جہنم کی آگ میں اپنے پیٹ میں برابر گھونپتا رہے گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": 1966,
			"text": "عمر بن خطاب رضی الله عنہ کہتے ہیں کہ جب عبداللہ بن ابی ابن سلول ( منافقوں کا سردار ) مر گیا، تو رسول اللہ صلی اللہ علیہ وسلم بلائے گئے، تاکہ آپ اس کی نماز جنازہ پڑھیں، جب رسول اللہ صلی اللہ علیہ وسلم ( نماز پڑھنے کے لیے ) کھڑے ہوئے تو میں تیزی سے آپ کی طرف بڑھا، اور عرض کیا: اللہ کے رسول! آپ ابن ابی پر نماز جنازہ پڑھیں گے؟ حالانکہ فلاں دن وہ ایسا ایسا کہہ رہا تھا، میں اس کی تمام باتیں آپ پر گنانے لگا، تو آپ مسکرائے، اور فرمایا: ”اے عمر! ان باتوں کو جانے دو“۔ جب میں نے کافی اصرار کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”مجھے اختیار ہے ( نماز پڑھوں یا نہ پڑھوں ) تو میں نے پڑھنا پسند کیا، اگر میں یہ جانتا کہ ستر بار سے زیادہ مغفرت چاہنے پر اس کی مغفرت ہو جائے گی تو میں اس سے زیادہ مغفرت کرتا“ ۱؎ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے اس کی نماز جنازہ پڑھی، پھر لوٹے اور ابھی ذرا سا دم ہی لیا تھا کہ سورۃ برأت کی دونوں آیتیں نازل ہوئیں: «ولا تصل على أحد منهم مات أبدا ولا تقم على قبره إنهم كفروا باللہ ورسوله وماتوا وهم فاسقون» ”جب یہ مر جائیں تو تم ان میں سے کسی پر کبھی بھی نماز جنازہ نہ پڑھو، اور نہ اس کی قبر پہ کھڑے ہو، اس لیے کہ انہوں نے اللہ اور اس کے رسول کا انکار کیا ہے، اور گنہگار ہو کر مرے ہیں“، بعد میں مجھے رسول اللہ صلی اللہ علیہ وسلم کے خلاف اپنی اس دن کی اس جرات پر حیرت ہوئی، اور اللہ اور اس کے رسول خوب جانتے ہیں کہ یہ جرات میں نے کیوں کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": 1967,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سہیل بن بیضاء رضی اللہ عنہ کی نماز جنازہ مسجد ہی میں پڑھی تھی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": 1968,
			"text": "ام المؤمنین عائشہ رضی الله عنہا بیان کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے سہیل بن بیضاء ۱؎ کی نماز جنازہ مسجد کے صحن ہی میں پڑھی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": 1969,
			"text": "ابوامامہ بن سہل بن حنیف رضی الله عنہ بیان کرتے ہیں کہ عوالی مدینہ کی ایک غریب عورت ۱؎ بیمار پڑ گئی، نبی اکرم صلی اللہ علیہ وسلم اس کے بارے میں لوگوں سے پوچھتے رہتے تھے، اور کہہ رکھا تھا کہ ”اگر یہ مر جائے تو اسے دفن مت کرنا جب تک کہ میں اس کی نماز جنازہ نہ پڑھ لوں“، چنانچہ وہ مر گئی، تو لوگ اسے عشاء کے بعد مدینہ لے کر آئے، ان لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو سویا ہوا پایا، تو آپ کو جگانا مناسب نہ سمجھا، چنانچہ ان لوگوں نے اس کی نماز جنازہ پڑھ لی، اور اسے لے جا کر مقبرہ بقیع میں دفن کر دیا، جب رسول اللہ صلی اللہ علیہ وسلم نے صبح کی تو لوگ آپ کے پاس آئے، آپ نے ان سے اس کے بارے میں پوچھا تو لوگوں نے کہا: اللہ کے رسول! وہ تو دفنائی جا چکی، ( رات ) ہم آپ کے پاس آئے ( بھی ) تھے، ( لیکن ) ہم نے آپ کو سویا ہوا پایا، تو آپ کو جگانا نامناسب سمجھا، آپ نے فرمایا: ”چلو!“ ( اور ) خود بھی چل پڑے، اور لوگ بھی آپ کے ساتھ گئے یہاں تک کہ ان لوگوں نے آپ کو اس کی قبر دکھائی، رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے، اور لوگوں نے آپ کے پیچھے صف باندھا، آپ نے اس کی نماز ( جنازہ ) پڑھائی اور ( اس میں ) چار تکبیریں کہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": 1970,
			"text": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تمہارے بھائی نجاشی کی موت ہو گئی ہے، تو تم لوگ اٹھو اور ان کی نماز جنازہ پڑھو“، ( پھر ) آپ نے ہماری صف بندی کی جیسے جنازہ پر صف بندی کی جاتی ہے، اور ان کی نماز جنازہ پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": 1971,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے لوگوں کو نجاشی کی موت کی خبر اسی دن دی جس دن وہ مرے، پھر آپ لوگوں کو لے کر صلاۃ گاہ کی طرف نکلے، اور ان کی صف بندی کی، ( پھر ) آپ نے ان کی نماز ( جنازہ ) پڑھائی، اور چار تکبیریں کہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": 1972,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینہ میں اپنے صحابہ کو نجاشی کی موت کی خبر دی، تو انہوں نے آپ کے پیچھے صف بندی کی، آپ نے ان کی نماز ( جنازہ ) پڑھائی، اور چار تکبیریں کہیں۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: ابن مسیب کا نام جیسا میں سننا چاہتا تھا نہیں سن سکا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": 1973,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ کے رسول صلی اللہ علیہ وسلم نے فرمایا: ”تمہارے بھائی ( نجاشی ) مر گئے ہیں تو تم لوگ اٹھو، اور ان کی نماز جنازہ پڑھو“ تو ہم نے ان پر دو صفیں باندھیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": 1974,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ جس دن رسول اللہ صلی اللہ علیہ وسلم نے نجاشی کی نماز ( جنازہ ) پڑھی تھی میں دوسری صف میں تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": 1975,
			"text": "عمران بن حصین رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا: ”تمہارے بھائی نجاشی انتقال کر گئے ہیں تو تم اٹھو اور ان کی نماز جنازہ پڑھو“، تو ہم کھڑے ہوئے ( اور ) ہم نے ان پر اسی طرح صف بندی کی جس طرح میت پر کی جاتی ہے، اور ہم نے ان کی نماز ( جنازہ ) اسی طرح پڑھی جس طرح میت کی پڑھی جاتی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": 1976,
			"text": "سمرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ام کعب رضی اللہ عنہا کی نماز ( جنازہ ) پڑھی، جو اپنی زچگی میں مر گئیں تھیں، تو رسول اللہ صلی اللہ علیہ وسلم نماز میں ان کی کمر کے پاس کھڑے ہوئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": 1977,
			"text": "عمار رضی الله عنہ کہتے ہیں ایک بچہ اور ایک عورت کا جنازہ آیا، تو بچہ لوگوں سے متصل رکھا گیا، اور عورت اس کے پیچھے ( قبلہ کی طرف ) رکھی گئی، پھر ان دونوں کی نماز جنازہ پڑھی گئی، لوگوں میں ابو سعید خدری، ابن عباس، ابوقتادہ اور ابوہریرہ رضی اللہ عنہم ( بھی ) تھے، تو میں نے ان ( لوگوں ) سے اس کے متعلق سوال کیا، تو سبھوں نے کہا: یہی سنت ( نبی کا طریقہ ) ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": 1978,
			"text": "نافع کہتے ہیں کہ ابن عمر رضی اللہ عنہما نے نو جنازوں کی ایک ساتھ نماز پڑھی، تو مرد امام سے قریب رکھے گئے، اور عورتیں قبلہ سے قریب، ان سب عورتوں کی ایک صف بنائی، اور علی رضی اللہ عنہ کی بیٹی اور عمر بن خطاب رضی اللہ عنہ کی بیوی ام کلثوم، اور ان کے بیٹے زید دونوں کا جنازہ ایک ساتھ رکھا گیا، امام اس دن سعید بن العاص تھے، اور لوگوں میں ابن عمر، ابوہریرہ، ابوسعید اور ابوقتادہ رضی اللہ عنہم ( بھی موجود ) تھے، بچہ امام سے قریب رکھا گیا، تو ایک شخص نے کہا: مجھے یہ چیز ناگوار لگی، تو میں نے ابن عباس، ابوہریرہ، ابوسعید اور ابوقتادہ ( رضی اللہ عنہم ) کی طرف ( حیرت سے ) دیکھا، اور پوچھا: یہ کیا ہے؟ تو انہوں نے کہا: یہی سنت ( نبی کا طریقہ ) ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": 1979,
			"text": "سمرہ بن جندب رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فلاں کی ماں کی نماز جنازہ پڑھی جو اپنی زچگی میں مر گئیں تھیں، تو آپ ان کے بیچ میں یعنی کمر کے پاس کھڑے ہوئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": 1980,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو نجاشی کی موت کی خبر دی، اور آپ ان کے ساتھ نکلے تو ان کی صف بندی کی، ( اور ) چار تکبیریں کہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": 1981,
			"text": "ابوامامہ بن سہل رضی الله عنہ کہتے ہیں کہ عوالی والوں ۱؎ میں سے ایک عورت بیمار ہوئی، اور نبی اکرم صلی اللہ علیہ وسلم بیمار کی بیمار پرسی سب سے زیادہ کرتے تھے، تو آپ نے فرمایا: ”جب یہ مر جائے تو مجھے خبر کرنا“ تو وہ رات میں مر گئی، اور لوگوں نے اسے دفنا دیا اور نبی اکرم صلی اللہ علیہ وسلم کو خبر نہیں کیا، جب آپ نے صبح کی تو اس کے بارے میں پوچھا، تو لوگوں نے کہا: اللہ کے رسول! ہم نے آپ کو بیدار کرنا مناسب نہیں سمجھا، آپ اس کی قبر پر آئے، اور اس پر نماز جنازہ پڑھی اور ( اس میں ) چار تکبیریں کہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": 1982,
			"text": "ابن ابی لیلیٰ سے روایت ہے کہ زید بن ارقم رضی اللہ عنہ نے ایک میت کی نماز جنازہ پڑھائی تو ( اس میں ) پانچ تکبیریں کہیں، اور کہا: رسول اللہ صلی اللہ علیہ وسلم نے بھی اتنی ہی تکبیریں کہیں تھیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": 1983,
			"text": "عوف بن مالک رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو سنا کہ آپ ایک جنازے کی نماز میں کہہ رہے تھے: «اللہم اغفر له وارحمه واعف عنه وعافه وأكرم نزله ووسع مدخله واغسله بماء وثلج وبرد ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وقه عذاب القبر وعذاب النار» ”اے اللہ! اس کی مغفرت فرما، اس پر رحم کر، اسے معاف کر دے، اسے عافیت دے، اس کی ( بہترین ) مہمان نوازی فرما، اس کی ( قبر ) کشادہ کر دے، اسے پانی برف اور اولے سے دھو دے، اسے گناہوں سے اس طرح صاف کر دے جیسے سفید کپڑا میل کچیل سے صاف کیا جاتا ہے، اس کو بدلے میں اس کے گھر سے اچھا گھر، اس کے گھر والوں سے بہتر گھر والے، اور اس کی بیوی سے اچھی بیوی عطا کر، اور اسے عذاب قبر اور عذاب جہنم سے بچا“۔ عوف رضی اللہ عنہ کہتے ہیں کہ اس میت کے لیے رسول اللہ صلی اللہ علیہ وسلم کی یہ دعا ( سن کر ) میں نے آرزو کی: کاش! اس کی جگہ میں ہوتا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": 1984,
			"text": "عوف بن مالک رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایک میت پر صلاۃ پڑھتے سنا، تو میں نے سنا کہ آپ اس کے لیے دعا میں یہ کہہ رہے تھے: «اللہم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة ونجه من النار – أو قال – وأعذه من عذاب القبر‏» ”اے اللہ! اس کی مغفرت فرما، اس پر رحم کر، اسے عافیت دے، اسے معاف کر دے، اس کی ( بہترین ) مہمان نوازی فرما، اس کی ( قبر ) کشادہ کر دے، اسے پانی، برف اور اولے سے دھو دے، اسے گناہوں سے اس طرح صاف کر دے جیسے سفید کپڑا میل کچیل سے صاف کیا جاتا ہے، اس کو بدلے میں اس کے گھر سے اچھا گھر، اس کے گھر والوں سے بہتر گھر والے، اور اس کی بیوی سے اچھی بیوی عطا کر، اور اسے جنت میں داخل کر، اور جہنم کے عذاب سے نجات دے، یا فرمایا اسے عذاب قبر سے بچا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": 1985,
			"text": "عبید بن خالد سلمی رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے دو آدمیوں کے درمیان بھائی چارہ کرایا، ان میں سے ایک قتل کر دیا گیا، اور دوسرا ( بھی ) اس کے بعد مر گیا، ہم نے اس کی نماز جنازہ پڑھی، تو نبی اکرم صلی اللہ علیہ وسلم نے پوچھا: ”تم لوگوں نے کیا دعا کی؟“، تو ان لوگوں نے کہا: ہم نے اس کے لیے یہ دعا کی: «اللہم اغفر له اللہم ارحمه اللہم ألحقه بصاحبه» ”اے اللہ! اس کی مغفرت فرما، اے اللہ اس پر رحم فرما، اے اللہ! اسے اپنے ساتھی سے ملا دے“ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اس کی صلاۃ اس کی صلاۃ کے بعد کہاں جائے گی؟ اور اس کا عمل اس کے عمل کے بعد کہاں جائے گا؟ ان دونوں کے درمیان وہی دوری ہے جو آسمان و زمین کے درمیان ہے“۔ عمرو بن میمون کہتے ہیں: مجھے خوشی ہوئی کیونکہ عبداللہ بن ربیعہ سلمی رضی اللہ عنہ نے ( اس حدیث کو ) میرے لیے مسند کر دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": 1986,
			"text": "ابوابراہیم انصاری اشہلی اپنے والد سے روایت کرتے ہیں کہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم کو میت پر نماز جنازہ میں کہتے سنا: «اللہم اغفر لحينا وميتنا وشاهدنا وغائبنا وذكرنا وأنثانا وصغيرنا وكبيرنا» ”اے اللہ! ہمارے زندہ اور مردہ کو، ہمارے حاضر اور غائب، ہمارے نر اور مادہ، ہمارے چھوٹے اور بڑے سب کو بخش دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": 1987,
			"text": "طلحہ بن عبداللہ بن عوف کہتے ہیں کہ میں نے ابن عباس رضی اللہ عنہما کے پیچھے جنازہ کی نماز پڑھی، تو انہوں نے سورۃ فاتحہ اور کوئی ایک سورت پڑھی، اور جہر کیا یہاں تک کہ آپ نے ہمیں سنا دیا، جب فارغ ہوئے تو میں نے ان کا ہاتھ پکڑا اور پوچھا: ( یہ کیا؟ ) تو انہوں نے کہا: ( یہی ) سنت ( نبی کا طریقہ ) ہے، اور ( یہی ) حق ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": 1988,
			"text": "طلحہ بن عبداللہ کہتے ہیں کہ میں نے ابن عباس رضی اللہ عنہما کے پیچھے ایک جنازے کی نماز پڑھی، تو میں نے انہیں سورۃ فاتحہ پڑھتے سنا، تو جب وہ سلام پھیر چکے تو میں نے ان کا ہاتھ پکڑا، اور پوچھا: آپ ( نماز جنازہ میں ) قرآن پڑھتے ہیں؟ تو انہوں نے کہا: جی ہاں، ( یہی ) حق اور سنت ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": 1989,
			"text": "ابوامامہ اسعد بن سہل بن حنیف رضی الله عنہ کہتے ہیں نماز جنازہ میں سنت یہ ہے کہ پہلی تکبیر کے بعد سورۃ فاتحہ آہستہ پڑھی جائے، پھر تین تکبیریں کہی جائیں، اور آخر میں سلام پھیرا جائے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": 1990,
			"text": "ضحاک بن قیس دمشقی رضی الله عنہ سے اسی جیسی حدیث مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1991,
			"arabicnumber": 1991,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس میت پر بھی مسلمانوں کی ایک جماعت نماز جنازہ پڑھے ( جن کی تعداد ) سو تک پہنچتی ہو، ( اور ) وہ ( اللہ کے پاس ) شفاعت ( سفارش ) کریں تو اس کے حق میں ( ان کی ) شفاعت قبول کی جائے گی“۔ سلام کہتے ہیں: میں نے اس حدیث کو شعیب بن حبحاب سے بیان کیا تو انہوں نے کہا: مجھ سے اسے انس بن مالک رضی اللہ عنہ نے بیان کیا ہے، وہ اسے نبی اکرم صلی اللہ علیہ وسلم سے روایت کر رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": 1992,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مسلمانوں میں سے جو بھی اس طرح مرتا ہو کہ لوگوں کی ایک ایسی جماعت اس کی نماز جنازہ پڑھتی ہو، جو سو تک پہنچ جاتی ہو، تو وہ شفاعت کرتے ہیں، تو ان کی شفاعت قبول کی جاتی ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": 1993,
			"text": "ابوبکار حکم بن فروخ کہتے ہیں ہمیں ابوملیح نے ایک جنازے کی نماز پڑھائی تو ہم نے سمجھا کہ وہ تکبیر ( تکبیر اولیٰ ) کہہ چکے ( پھر کیا دیکھتا ہوں کہ ) وہ ہماری طرف متوجہ ہوئے، اور کہا: تم اپنی صفیں درست کرو تاکہ تمہاری سفارش کارگر ہو۔ ابوملیح کہتے ہیں: مجھ سے عبداللہ بن سلیط نے بیان کیا، انہوں نے امہات المؤمنین میں سے ایک سے روایت کی، اور وہ ام المؤمنین میمونہ رضی اللہ عنہا ہیں، وہ کہتی ہیں: مجھے نبی اکرم صلی اللہ علیہ وسلم نے خبر دی، آپ نے فرمایا: ”جس میت کی بھی لوگوں کی ایک جماعت نماز جنازہ پڑھتی ہے تو اس کے حق میں ( ان کی ) شفاعت قبول کر لی جاتی ہے“، تو میں نے ابوملیح سے جماعت ( کی تعداد ) کے متعلق پوچھا تو انہوں نے کہا: چالیس افراد پر مشتمل گروہ امت ( جماعت ) ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": 1994,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس نے کسی کی نماز جنازہ پڑھی، تو اسے ایک قیراط ملے گا، اور جس نے اسے قبر میں رکھے جانے تک انتظار کیا، تو اسے دو قیراط ملے گا، اور دو قیراط دو بڑے پہاڑوں کے مثل ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": 1995,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو کسی جنازے میں شریک رہے یہاں تک کہ اس پر نماز جنازہ پڑھی جائے، تو اسے ایک قیراط ثواب ملے گا، اور جو دفنائے جانے تک رہے تو اسے دو قیراط ملے گا“، پوچھا گیا: اللہ کے رسول! یہ دو قیراط کیا ہے؟ آپ نے فرمایا: ”یہ دو بڑے پہاڑوں کے برابر ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": 1996,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص طلب ثواب کے لیے کسی مسلمان کے جنازے کے ساتھ جائے، اور اس کی نماز جنازہ پڑھے، اور اسے دفنائے تو اس کے لیے دو قیراط ( کا ثواب ) ہے، اور جو ( صرف ) نماز جنازہ پڑھے اور دفنانے جانے سے پہلے لوٹ آئے، تو وہ ایک قیراط ( ثواب ) لے کر لوٹتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1997,
			"arabicnumber": 1997,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو کسی جنازے کے ساتھ جائے ( اور ) اس پر نماز جنازہ پڑھے پھر لوٹ آئے، تو اسے ایک قیراط کا ثواب ہے، اور جو ( جنازہ میں ) شریک ہو، ( اور ) اس پر نماز جنازہ پڑھے پھر بیٹھا رہے یہاں تک کہ اسے دفنا کر فارغ ہو لیا جائے، تو اس کا اجر دو قیراط ہے، ان میں سے ہر ایک قیراط احد ( پہاڑ ) سے زیادہ بڑا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": 1998,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم جنازہ دیکھو تو کھڑے ہو جاؤ، اور جو اس کے ساتھ جائے وہ بھی کھڑا رہے یہاں تک کہ اسے رکھ دیا جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": 1999,
			"text": "علی رضی الله عنہ سے روایت ہے کہ ان سے جنازے کے لیے جب تک رکھ نہ دیا جائے کھڑے رہنے کا ذکر کیا گیا، تو علی رضی اللہ عنہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم ( پہلے ) کھڑے رہتے تھے پھر بیٹھنے لگے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": 2000,
			"text": "علی رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کھڑے دیکھا آپ کھڑے ہوئے تو ہم ( بھی ) کھڑے ہوئے، اور بیٹھتے دیکھا تو ہم ( بھی ) بیٹھنے لگے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": 2001,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک جنازے میں نکلے، جب ہم قبر کے پاس پہنچے تو وہ تیار نہیں ہوئی تھی، چنانچہ آپ بیٹھ گئے تو ہم بھی آپ کے اردگرد بیٹھ گئے، گویا ہمارے سر پر پرندے بیٹھے ہوئے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": 2002,
			"text": "عبداللہ بن ثعلبہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے شہدائے احد کے بارے میں فرمایا: ”انہیں ان کے خون کے ساتھ کپڑوں میں لپیٹ دو کیونکہ جو بھی زخم اللہ کی راہ میں لگا ہو گا وہ قیامت کے روز بہتا ہوا آئے گا، اس کا رنگ خون کا رنگ ہو گا، اور اس کی خوشبو مشک کی خوشبو ہو گی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": 2003,
			"text": "عبیداللہ بن معیہ نامی ایک شخص کہتے ہیں کہ غزوہ طائف کے دن دو مسلمان مارے گئے، تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس اٹھا کر لائے گئے، تو آپ نے انہیں ( اسی جگہ ) دفنانے کا حکم دیا جہاں وہ مارے گئے تھے۔ اس حدیث کے راوی ابن معیہ رسول اللہ صلی اللہ علیہ وسلم کے عہد میں پیدا ہوئے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": 2004,
			"text": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے غزوہ احد کے مقتولین کے بارے حکم دیا کہ انہیں ان کے پچھاڑے جانے کی جگ ہوں پر لوٹا دیا جائے، حالانکہ وہ مدینہ لے آئے گئے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": 2005,
			"text": "جابر بن عبداللہ رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مقتولین کو ان کے گرنے کی جگ ہوں میں دفن کرو“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": 2006,
			"text": "علی رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا: آپ کے بوڑھے گم کردہ راہ چچا ( ابوطالب ) مر گئے ہیں، انہیں کون دفن کرے؟ آپ نے فرمایا: ”تم جاؤ اور اپنے باپ کو دفن کر دو اور کوئی نئی چیز نہ کرنا جب تک میرے پاس لوٹ نہ آنا“، چنانچہ میں انہیں دفن کر آیا، تو آپ نے میرے لیے ( نہانے کا ) حکم دیا، میں نے غسل کیا، اور آپ نے مجھے دعا دی۔ راوی ناجیہ بن کعب کہتے ہیں: اور علی رضی اللہ عنہ نے ایک ایسی دعا کا ذکر کیا جسے میں یاد نہیں رکھ سکا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": 2007,
			"text": "سعد بن ابی وقاص رضی الله عنہ کہتے ہیں کہ میرے لیے بغلی قبر کھودنا، اور ( اینٹیں ) کھڑی کرنا جیسے رسول اللہ صلی اللہ علیہ وسلم کے لیے کی گئی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 2008,
			"arabicnumber": 2008,
			"text": "عامر بن سعد بن ابی وقاص سے روایت ہے کہ سعد رضی اللہ عنہ کی جب وفات ہونے لگی تو انہوں نے کہا: میرے لیے بغلی قبر کھدوانا، اور اینٹیں کھڑی کرنا جیسے رسول اللہ صلی اللہ علیہ وسلم علیہ السلام کے لیے کی گئی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": 2009,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بغلی قبر ہم ( مسلمانوں ) کے لیے ہے، اور صندوقی قبر دوسروں کے لیے ہے“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": 2010,
			"text": "ہشام بن عامر انصاری رضی الله عنہ کہتے ہیں کہ ہم نے ( غزوہ ) احد کے دن رسول اللہ صلی اللہ علیہ وسلم سے شکایت کی، ہم نے عرض کیا: اللہ کے رسول! ہر ایک آدمی کے لیے ( الگ الگ ) قبر کھودنا ہمارے لیے دشوار ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”کھودو اور گہرا کھودو اچھی طرح کھودو، اور دو دو تین تین ( افراد ) کو ایک ہی قبر میں دفن کر دو“، تو لوگوں نے پوچھا: اللہ کے رسول! پہلے ہم کسے رکھیں؟ آپ نے فرمایا: ”پہلے انہیں رکھو جنہیں قرآن زیادہ یاد ہو“۔ ہشام رضی اللہ عنہ کہتے ہیں: ایک ہی قبر میں رکھے جانے والے تین افراد میں سے میرے والد تیسرے فرد تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": 2011,
			"text": "ہشام بن عامر انصاری رضی الله عنہ کہتے ہیں کہ جس دن احد کی لڑائی ہوئی تو جن مسلمانوں کو مارا جانا تھا مارے گئے، اور جسے زخمی ہونا تھا زخمی ہوئے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( قبریں ) کھودو اور چوڑی کھودو، اور ایک ہی قبر میں دو دو تین تین لوگوں کو دفنا دو، اور جنہیں قرآن زیادہ یاد ہو انہیں ( قبر میں ) پہلے رکھو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": 2012,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جس وقت دفنائے گئے آپ کے نیچے ایک سرخ چادر رکھی گئی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": 2013,
			"text": "عقبہ بن عامر جہنی رضی الله عنہ کہتے ہیں کہ تین اوقات ایسے ہیں جن میں رسول اللہ صلی اللہ علیہ وسلم ہمیں نماز پڑھنے ( اور ) اپنے مردوں کو قبر میں دفنانے سے منع فرماتے تھے: ایک جس وقت سورج نکل رہا ہو یہاں تک کہ بلند ہو جائے، اور دوسرے جس وقت ٹھیک دوپہر ہو یہاں تک کہ سورج ڈھل جائے، اور ( تیسرے جس وقت سورج ڈوبنے کے لیے مائل ہو رہا ہو۔)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 2014,
			"arabicnumber": 2014,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ ۔ ( ایک بار ) رسول اللہ صلی اللہ علیہ وسلم نے خطاب فرمایا ( آپ نے اس میں ) اپنے اصحاب میں سے ایک شخص کا ذکر کیا جو مر گیا تھا، اسے رات ہی میں دفنا دیا گیا، اور ایک گھٹیا کفن میں کفنایا گیا، تو رسول اللہ صلی اللہ علیہ وسلم نے سختی سے منع فرما دیا کہ کوئی رات میں دفنایا جائے، سوائے اس کے کہ وہ اس کے لیے مجبور کر دیا جائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": 2015,
			"text": "ہشام بن عامر انصاری رضی الله عنہ کہتے ہیں کہ جب ( غزوہ ) احد کا دن آیا، تو لوگوں کو سخت پریشانی ہوئی، نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”قبریں کھودو اور اسے چوڑی کھودو، اور ایک ہی قبر میں دو دو تین تین دفنا دو“، تو لوگوں نے عرض کیا: اللہ کے رسول! پہلے کسے رکھیں؟ آپ نے فرمایا: ”پہلے اسے رکھو جسے قرآن زیادہ یاد ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 2016,
			"arabicnumber": 2016,
			"text": "ہشام بن عامر انصاری رضی الله عنہ کہتے ہیں کہ ۔ ( غزوہ ) احد کے دن ( لوگ ) شدید زخمی ہوئے ( اور جاں بحق ہو گئے ) تو رسول اللہ صلی اللہ علیہ وسلم سے اس کی شکایت کی گئی ۱؎، آپ نے فرمایا: ” ( قبریں ) کھودو، انہیں کشادہ اور اچھی بناؤ، اور ایک ( ہی ) قبر میں دو دو تین تین کو دفن کرو، اور جسے قرآن زیادہ یاد ہوا سے آگے رکھو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 2017,
			"arabicnumber": 2017,
			"text": "ہشام بن عامر انصاری رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( قبریں ) کھودو، اور انہیں خوبصورت بناؤ، اور دو دو تین تین کو دفن کرو، اور جسے قرآن زیادہ یاد ہو انہیں پہلے رکھو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 2018,
			"arabicnumber": 2018,
			"text": "ہشام بن عامر انصاری رضی الله عنہ کہتے ہیں کہ ۔ ( غزوہ ) احد کے دن میرے والد قتل کئے گئے، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ” ( قبریں ) کھودو اور انہیں کشادہ اور اچھی بناؤ، اور ( ایک ہی ) قبر میں دو دو تین تین کو دفنا دو، اور جنہیں قرآن زیادہ یاد ہو انہیں پہلے رکھو“، چنانچہ میرے والد تین میں کے تیسرے تھے، اور انہیں قرآن زیادہ یاد تھا تو وہ پہلے رکھے گئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 2019,
			"arabicnumber": 2019,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم عبداللہ بن ابی کو قبر میں داخل کر دئیے جانے کے بعد آئے، تو آپ نے اسے ( نکالنے کا ) حکم دیا، چنانچہ وہ نکالا گیا، آپ نے اسے اپنے دونوں گھٹنوں پر بٹھایا، اور اس پر تھو تھو کیا، اور اسے اپنی قمیص پہنائی، واللہ اعلم ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 2020,
			"arabicnumber": 2020,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے عبداللہ بن ابی کو اس کی قبر سے نکلوایا، پھر اس کا سر اپنے دونوں گھٹنوں پر رکھا، اور اس پر تھو تھو کیا، اور اسے اپنی قمیص پہنائی۔ اور اس کی نماز ( جنازہ ) پڑھی، واللہ اعلم۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 2021,
			"arabicnumber": 2021,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ میرے والد کے ساتھ قبر میں ایک شخص اور دفن کیا گیا تھا، میرا دل خوش نہیں ہوا یہاں تک کہ میں نے اسے نکالا، اور انہیں علاحدہ دفن کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 2022,
			"arabicnumber": 2022,
			"text": "یزید بن ثابت رضی الله عنہ سے روایت ہے کہ وہ لوگ ایک دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے، تو آپ نے ایک نئی قبر دیکھی تو فرمایا: ”یہ کیا ہے؟“ لوگوں نے کہا: یہ فلاں قبیلے کی لونڈی ( کی قبر ) ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے اسے پہچان لیا، وہ دوپہر میں مری تھی، اور آپ قیلولہ فرما رہے تھے، تو ہم نے آپ کو اس کی وجہ سے جگانا پسند نہیں کیا، تو رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے، اور اپنے پیچھے لوگوں کی صف بندی کی، اور آپ نے چار تکبیریں کہیں، پھر فرمایا: ”جب تک میں تمہارے درمیان ہوں جو بھی تم میں سے مرے اس کی خبر مجھے ضرور دو، کیونکہ میری نماز اس کے لیے رحمت ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 2023,
			"arabicnumber": 2023,
			"text": "عامر بن شراحیل شعبی کہتے ہیں مجھے اس شخص نے خبر دی ہے جو رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک ایسی قبر کے پاس سے گزرا، جو الگ تھلگ تھی، تو آپ نے ان کی امامت کی، اور اپنے پیچھے ان کی صف بندی کی۔ سلیمان کہتے ہیں میں نے ( شعبی ) پوچھا: ابوعمرو! یہ کون تھے؟ انہوں نے کہا: ابن عباس رضی اللہ عنہما تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 2024,
			"arabicnumber": 2024,
			"text": "عامر بن شراحیل شعبی کہتے ہیں مجھے اس شخص نے خبر دی ہے جس نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا کہ آپ ایک الگ تھلگ قبر کے پاس سے گزرے، تو آپ نے اس کی نماز جنازہ پڑھی، اور اپنے پیچھے اپنے اصحاب کی صف بندی کی، پوچھا گیا: آپ سے کس نے بیان کیا ہے؟ تو انہوں نے کہا: ابن عباس رضی اللہ عنہما نے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 2025,
			"arabicnumber": 2025,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں نبی اکرم صلی اللہ علیہ وسلم نے ایک عورت کی قبر پر اسے دفن کر دئیے جانے کے بعد نماز جنازہ پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 2026,
			"arabicnumber": 2026,
			"text": "جابر بن سمرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ابودحداح رضی اللہ عنہ کے جنازے میں ( شرکت کے لیے ) نکلے، تو جب آپ لوٹنے لگے تو ( آپ کے لیے ) بغیر زین کے ننگی پیٹھ والا ایک گھوڑا لایا گیا، آپ ( اس پر ) سوار ہو گئے، اور ہم آپ کے ہمراہ پیدل چلنے لگے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 2027,
			"arabicnumber": 2027,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا ہے کہ قبر پر قبہ بنایا جائے یا اس کو اونچا کیا جائے، یا اس کو پختہ بنایا جائے، سلیمان بن موسیٰ کی روایت میں ”یا اس پر لکھا جائے“ کا اضافہ ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 2028,
			"arabicnumber": 2028,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے قبروں کو پختہ بنانے ۱؎ یا اس پر عمارت بنانے ۲؎ یا اس پر کسی کے بیٹھنے ۳؎ سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 2029,
			"arabicnumber": 2029,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے قبروں کو پختہ کرنے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 2030,
			"arabicnumber": 2030,
			"text": "ثمامہ بن شفی کہتے ہیں کہ ہم فضالہ بن عبید رضی اللہ عنہ کے ساتھ سر زمین روم میں تھے کہ ہمارا ایک ساتھی وفات پا گیا، تو فضالہ رضی اللہ عنہ نے اس کی قبر ( زمین کے برابر کرنے کا ) حکم دیا، تو وہ برابر کر دی گئی ۱؎ پھر انہوں نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کے برابر کرنے کا حکم دیتے سنا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 2031,
			"arabicnumber": 2031,
			"text": "ابوہیاج (حیان بن حصین اسدی) کہتے ہیں کہ علی رضی اللہ عنہ نے کہا: کیا میں تمہیں اس کام پر نہ بھیجوں جس پر رسول اللہ صلی اللہ علیہ وسلم نے مجھے بھیجا تھا: تم کوئی بھی اونچی قبر نہ چھوڑنا مگر اسے برابر کر دینا، اور نہ کسی گھر میں کوئی مجسمہ ( تصویر ) چھوڑنا مگر اسے مٹا دینا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 2032,
			"arabicnumber": 2032,
			"text": "بریدہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے تمہیں قبروں کی زیارت سے منع کیا تھا تو اب تم اس کی زیارت کیا کرو ۱؎، اور میں نے قربانی کے گوشت کو تین دن سے زیادہ رکھنے سے منع کیا تھا تو اب جب تک جی چاہے رکھو، اور میں نے تمہیں مشک کے علاوہ کسی اور برتن میں نبیذ ( پینے ) سے منع کیا تھا، تو سارے برتنوں میں پیو ( مگر ) کسی نشہ آور چیز کو مت پینا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 2033,
			"arabicnumber": 2033,
			"text": "بریدہ رضی الله عنہ سے روایت ہے کہ وہ ایک مجلس میں تھے جس میں رسول اللہ صلی اللہ علیہ وسلم ( موجود ) تھے، تو آپ نے فرمایا: ”میں نے تمہیں قربانی کا گوشت تین دن سے زیادہ کھانے سے منع کیا تھا ( تو اب تم ) کھاؤ، کھلاؤ اور جب تک جی چاہے رکھ چھوڑو، اور میں نے تم سے ذکر کیا تھا کہ کدو کی تمبی، تار کول ملے ہوئے، اور لکڑی کے اور سبز اونچے گھڑے کے برتنوں میں نبیذ نہ بناؤ، ( مگر اب ) جس میں مناسب سمجھو بناؤ، اور ہر نشہ آور چیز سے پرہیز کرو، اور میں نے تمہیں قبروں کی زیارت سے روکا تھا ( تو اب ) جو بھی زیارت کرنا چاہے کرے، البتہ تم زبان سے بری بات نہ کہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 2034,
			"arabicnumber": 2034,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی ماں کی قبر کی زیارت کی، تو آپ خود رو پڑے اور جو آپ کے اردگرد تھے انہیں بھی رلا دیا، اور فرمایا: ”میں نے اپنے رب سے اجازت چاہی کہ میں ان کے لیے مغفرت طلب کروں تو مجھے اجازت نہیں ملی، ( تو پھر ) میں نے ان کی قبر کی زیارت کرنے کی اجازت مانگی تو مجھے اجازت دے دی گئی، تم لوگ قبروں کی زیارت کیا کرو کیونکہ یہ تمہیں موت کی یاد دلاتی ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 2035,
			"arabicnumber": 2035,
			"text": "مسیب بن حزن رضی الله عنہما کہتے ہیں کہ جب ابوطالب کی وفات کا وقت آیا تو نبی اکرم صلی اللہ علیہ وسلم ان کے پاس آئے، اور ابوجہل اور عبداللہ بن ابی امیہ دونوں ان کے پاس ( پہلے سے موجود ) تھے، تو آپ نے فرمایا: ”چچا جان! آپ «لا إله إلا اللہ» کا کلمہ کہہ دیجئیے، میں اس کے ذریعہ آپ کے لیے اللہ عزوجل کے پاس جھگڑوں گا“، تو ابوجہل اور عبداللہ بن ابی امیہ دونوں نے ان سے کہا: ابوطالب! کیا آپ عبدالمطلب کے دین سے منہ موڑ لو گے؟ پھر وہ دونوں ان سے باتیں کرتے رہے یہاں تک کہ آخری بات جو عبدالمطلب نے ان سے کی وہ یہ تھی کہ ( میں ) عبدالمطلب کے دین پر ہوں، تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے کہا: ”میں آپ کے لیے مغفرت طلب کرتا رہوں گا جب تک مجھے روک نہ دیا جائے“، تو یہ آیت اتری ۱؎: «‏ما كان للنبي والذين آمنوا أن يستغفروا للمشركين» ”نبی اور اہل ایمان کے لیے یہ جائز نہیں کہ مشرکین کے لیے مغفرت طلب کریں“ ( التوبہ: ۱۱۳ ) نیز یہ آیت اتری: «إنك لا تهدي من أحببت» ”آپ جسے چاہیں ہدایت کے راستہ پر نہیں لا سکتے“ ( القص: ۵۶ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 2036,
			"arabicnumber": 2036,
			"text": "علی رضی الله عنہ کہتے ہیں میں نے ایک شخص کو اپنے ماں باپ کے لیے مغفرت طلب کرتے ہوئے سنا حالانکہ وہ دونوں مشرک تھے، تو میں نے کہا: کیا تو ان دونوں کے لیے مغفرت طلب کرتا ہے؟ حالانکہ وہ دونوں مشرک تھے، تو اس نے کہا: کیا ابراہیم ( علیہ السلام ) نے اپنے باپ کے لیے مغفرت طلب نہیں کی تھی؟ تو میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور آپ سے اس بات کا تذکرہ کیا، تو ( یہ آیت ) اتری: «وما كان استغفار إبراهيم لأبيه إلا عن موعدة وعدها إياه» ”ابراہیم کا اپنے باپ کے لیے مغفرت طلب کرنا ایک وعدہ کی وجہ سے تھا“ ( التوبہ: ۱۱۴ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 2037,
			"arabicnumber": 2037,
			"text": "محمد بن قیس بن مخرمہ کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا کو بیان کرتے ہوئے سنا وہ کہہ رہی تھیں: کیا میں تمہیں اپنے اور نبی اکرم صلی اللہ علیہ وسلم کے بارے میں نہ بتاؤں؟ ہم نے کہا کیوں نہیں ضرور بتائیے، تو وہ کہنے لگیں، جب وہ رات آئی جس میں وہ یعنی نبی اکرم صلی اللہ علیہ وسلم میرے پاس تھے تو آپ ( عشاء ) سے پلٹے، اپنے جوتے اپنے پائتانے رکھے، اور اپنے تہبند کا کنارہ اپنے بستر پر بچھایا، آپ صرف اتنی ہی مقدار ٹھہرے جس میں آپ نے محسوس کیا کہ میں سو گئی ہوں، پھر آہستہ سے آپ نے جوتا پہنا اور آہستہ ہی سے اپنی چادر لی، پھر دھیرے سے دروازہ کھولا، اور دھیرے سے نکلے، میں نے بھی اپنا کرتا، اپنے سر میں ڈالا اور اپنی اوڑھنی اوڑھی، اور اپنی تہبند پہنی، اور آپ کے پیچھے چل پڑی، یہاں تک کہ آپ مقبرہ بقیع آئے، اور اپنے ہاتھوں کو تین بار اٹھایا، اور بڑی دیر تک اٹھائے رکھا، پھر آپ پلٹے تو میں بھی پلٹ پڑی، آپ تیز چلنے لگے تو میں بھی تیز چلنے لگی، پھر آپ دوڑنے لگے تو میں بھی دوڑنے لگی، پھر آپ اور تیز دوڑے تو میں بھی اور تیز دوڑی، اور میں آپ سے پہلے آ گئی، اور گھر میں داخل ہو گئی، اور ابھی لیٹی ہی تھی کہ آپ بھی اندر داخل ہو گئے، آپ نے پوچھا: ”عائشہ! تجھے کیا ہو گیا، یہ سانس اور پیٹ کیوں پھول رہے ہیں؟“ میں نے کہا: کچھ تو نہیں ہے، آپ نے فرمایا: ”تو مجھے بتا دے ورنہ وہ ذات جو باریک بین اور ہر چیز کی خبر رکھنے والی ہے مجھے ضرور بتا دے گی“، میں نے عرض کیا: اللہ کے رسول! میرے ماں باپ آپ پر فدا ہوں، پھر میں نے اصل بات بتا دی تو آپ نے فرمایا: ”وہ سایہ جو میں اپنے آگے دیکھ رہا تھا تو ہی تھی“، میں نے عرض کیا: جی ہاں، میں ہی تھی، آپ نے میرے سینہ پر ایک مکا مارا جس سے مجھے تکلیف ہوئی، پھر آپ نے فرمایا: ”کیا تو یہ سمجھتی ہے کہ اللہ اور اس کے رسول صلی اللہ علیہ وسلم تجھ پر ظلم کریں گے“، میں نے کہا: جو بھی لوگ چھپائیں اللہ تعالیٰ تو اس سے واقف ہی ہے، ( وہ آپ کو بتا دے گا ) آپ صلی اللہ علیہ وسلم نے فرمایا: ”جبرائیل میرے پاس آئے جس وقت تو نے دیکھا، مگر وہ میرے پاس اندر نہیں آئے کیونکہ تو اپنے کپڑے اتار چکی تھی، انہوں نے مجھے آواز دی اور انہوں نے تجھ سے چھپایا، میں نے انہیں جواب دیا، اور میں نے بھی اسے تجھ سے چھپایا، پھر میں نے سمجھا کہ تو سو گئی ہے، اور مجھے اچھا نہ لگا کہ میں تجھے جگاؤں، اور میں ڈرا کہ تو اکیلی پریشان نہ ہو، خیر انہوں نے مجھے حکم دیا کہ میں مقبرہ بقیع آؤں، اور وہاں کے لوگوں کے لیے اللہ سے مغفرت کی دعا کروں“، میں نے پوچھا: اللہ کے رسول! میں کیا کہوں ( جب بقیع میں جاؤں ) ، آپ صلی اللہ علیہ وسلم نے فرمایا: کہو «السلام على أهل الديار من المؤمنين والمسلمين يرحم اللہ المستقدمين منا والمستأخرين وإنا إن شاء اللہ بكم لاحقون» ”سلامتی ہو ان گھروں کے مومنوں اور مسلمانوں پر، اللہ تعالیٰ ہم میں سے اگلے اور پچھلے ( دونوں ) پر رحم فرمائے، اور اگر اللہ تعالیٰ نے چاہا تو ہم تم سے ملنے ( ہی ) والے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 2038,
			"arabicnumber": 2038,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں ایک رات رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے، اپنا کپڑا پہنا پھر ( باہر ) نکل گئے، تو میں نے اپنی لونڈی بریرہ کو حکم دیا کہ وہ پیچھے پیچھے جائے، چنانچہ وہ آپ کے پیچھے پیچھے گئی یہاں تک کہ آپ مقبرہ بقیع پہنچے، تو اس کے قریب کھڑے رہے جتنی دیر اللہ تعالیٰ نے کھڑا رکھنا چاہا، پھر آپ پلٹے تو بریرہ آپ سے پہلے پلٹ کر آ گئی، اور اس نے مجھے بتایا، لیکن میں نے آپ سے اس کا کوئی ذکر نہیں کیا یہاں تک کہ صبح کیا، تو میں نے آپ کو ساری باتیں بتائیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ”مجھے اہل بقیع کی طرف بھیجا گیا تھا تاکہ میں ان کے حق میں دعا کروں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 2039,
			"arabicnumber": 2039,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں جب جب رسول اللہ صلی اللہ علیہ وسلم کی باری ان کے یہاں ہوتی تو رات کے آخری ( حصے ) میں مقبرہ بقیع کی طرف نکل جاتے، ( اور ) کہتے: «السلام عليكم دار قوم مؤمنين وإنا وإياكم متواعدون غدا أو مواكلون وإنا إن شاء اللہ بكم لاحقون اللہم اغفر لأهل بقيع الغرقد» ”اے مومن گھر ( قبرستان ) والو! تم پر سلامتی ہو، ہم اور تم آپس میں ایک دوسرے سے کل کی حاضری کا وعدہ کرنے والے ہیں، اور آپس میں ایک دوسرے پر بھروسہ کرنے والے ہیں، اور اگر اللہ تعالیٰ نے چاہا تو ہم تم سے ملنے والے ہیں، اے اللہ! بقیع غرقد والوں کی مغفرت فرما“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 2040,
			"arabicnumber": 2040,
			"text": "بریدہ رضی الله عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب قبرستان آتے تو فرماتے: «‏السلام عليكم أهل الديار من المؤمنين والمسلمين وإنا إن شاء اللہ بكم لاحقون أنتم لنا فرط ونحن لكم تبع أسأل اللہ العافية لنا ولكم» ”اے مومن اور مسلمان گھر والو! تم پر سلامتی ہو، اور اگر اللہ تعالیٰ نے چاہا تو ہم ( عنقریب ) تم سے ملنے والے ہیں، تم ہمارے پیش رو ہو، اور ہم تمہارے بعد آنے والے ہیں۔ میں اللہ سے اپنے اور تمہارے لیے عافیت کی درخواست کرتا ہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 2041,
			"arabicnumber": 2041,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ جب نجاشی ( شاہ حبشہ ) کا انتقال ہوا تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم لوگ ان کی بخشش کی دعا کرو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 2042,
			"arabicnumber": 2042,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں شاہ حبشہ نجاشی کی موت کی خبر اسی دن دی جس دن وہ مرے، آپ صلی اللہ علیہ وسلم نے فرمایا: ”تم اپنے بھائی کے لیے مغفرت طلب کرو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 2043,
			"arabicnumber": 2043,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے قبروں کی زیارت کرنے والیوں پر، اور انہیں سجدہ گاہ بنانے اور ان پر چراغاں کرنے والوں پر لعنت فرمائی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 2044,
			"arabicnumber": 2044,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم میں سے کسی کا انگارے پر بیٹھنا یہاں تک کہ اس کے کپڑے جل جائیں اس کے لیے بہتر ہے اس بات سے کہ وہ کسی قبر پر بیٹھے“",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 2045,
			"arabicnumber": 2045,
			"text": "عمرو بن حزم رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم لوگ قبروں پر نہ بیٹھو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 2046,
			"arabicnumber": 2046,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے ان لوگوں پر لعنت فرمائی ہے جنہوں نے اپنے انبیاء کی قبروں کو مسجد بنا لیا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 2047,
			"arabicnumber": 2047,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ نے یہود و نصاریٰ پر لعنت فرمائی ہے ( کیونکہ ) ان لوگوں نے اپنے انبیاء کی قبروں کو مسجد بنا لیا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": 2048,
			"text": "بشیر بن خصاصیہ رضی الله عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چل رہا تھا کہ آپ مسلمانوں کی قبروں کے پاس سے گزرے تو فرمایا: ”یہ لوگ بڑے شر و فساد سے ( بچ ) کر آگے نکل گئے“، پھر آپ مشرکوں کی قبروں کے پاس سے گزرے تو فرمایا: ”یہ لوگ بڑے خیر سے ( محروم ) ہو کر آگے نکل گئے“، پھر آپ متوجہ ہوئے تو دیکھا کہ ایک شخص اپنی دونوں جوتیوں میں قبروں کے درمیان چل رہا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اے سبتی جوتوں والو! انہیں اتار دو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": 2049,
			"text": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بندہ جب اپنی قبر میں رکھا جاتا ہے، اور اس کے ساتھی لوٹتے ہیں، تو وہ ان کی جوتیوں کی آواز سنتا ہے“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": 2050,
			"text": "انس بن مالک رضی الله عنہ نے بیان کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بندہ جب اپنی قبر میں رکھ دیا جاتا ہے اور اس کے ساتھی لوٹتے ہیں تو وہ ان کے جوتیوں کی آواز سنتا ہے، ( پھر ) اس کے پاس دو فرشتے آتے ہیں، اور اسے بٹھاتے ہیں، ( اور ) اس سے پوچھتے ہیں: تم اس شخص ( محمد ) کے بارے میں کیا کہتے ہو؟ رہا مومن تو وہ کہتا ہے: میں گواہی دیتا ہوں کہ وہ اللہ کے بندے اور اس کے رسول ہیں، تو اس سے کہا جائے گا کہ تم جہنم میں اپنے ٹھکانے کو دیکھ لو، اللہ تعالیٰ نے اس کے بدلے تمہیں جنت میں ٹھکانا دیا ہے“، نبی اکرم صلی اللہ علیہ وسلم فرماتے ہیں: ”تو وہ ان دونوں ( جنت و جہنم ) کو ایک ساتھ دیکھے گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": 2051,
			"text": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بندہ جب اپنی قبر میں رکھ دیا جاتا ہے، اور اس کے ساتھی لوٹتے ہیں تو وہ ان کی جوتیوں کی آواز سنتا ہے، ( پھر ) دو فرشتے آتے ہیں، ( اور ) اسے بٹھاتے ہیں ( پھر ) اس سے پوچھتے ہیں: تم اس شخص محمد صلی اللہ علیہ وسلم کے بارے میں کیا کہتے ہو؟ رہا مومن تو وہ کہتا ہے: میں گواہی دیتا ہوں کہ وہ اللہ کے بندے اور اس کے رسول ہیں، ( پھر ) اس سے کہا جاتا ہے تم جہنم میں اپنے ٹھکانے کو دیکھ لو اللہ تعالیٰ نے تمہیں اس کے بدلے ایک اچھا ٹھکانا دیا ہے۔ رسول اللہ صلی اللہ علیہ وسلم فرماتے ہیں: وہ ان دونوں ( جنت و جہنم ) کو ایک ساتھ دیکھتا ہے، اور رہا کافر یا منافق تو اس سے پوچھا جاتا ہے: اس شخص ( محمد ) کے بارے میں تم کیا کہتے ہو؟، تو وہ کہتا ہے: میں نہیں جانتا، میں وہی کہتا تھا جو لوگ کہتے تھے، تو اس سے کہا جائے گا: نہ تم نے خود جاننے کی کوشش کی، اور نہ جانکار لوگوں کی پیروی کی، پھر اس کے دونوں کانوں کے بیچ ایک ایسی مار ماری جاتی ہے کہ وہ ایسے زور کی چیخ مارتا ہے جسے انسان اور جنات کے علاوہ جو بھی اس کے قریب ہوتے ہیں سبھی سنتے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": 2052,
			"text": "عبداللہ بن یسار کہتے ہیں کہ میں بیٹھا ہوا تھا اور ( وہیں ) سلیمان بن صرد اور خالد بن عرفطہٰ رضی اللہ عنہما ( بھی ) موجود تھے تو لوگوں نے ذکر کیا کہ ایک آدمی اپنے پیٹ کے عارضہ میں وفات پا گیا ہے، تو ان دونوں نے تمنا کی کہ وہ اس کے جنازے میں شریک ہوں، تو ان میں سے ایک نے دوسرے سے کہا: کیا رسول اللہ صلی اللہ علیہ وسلم نے نہیں کہا ہے کہ ”جو پیٹ کے عارضہ میں مرے اسے قبر میں عذاب نہیں دیا جائے گا“، تو دوسرے نے کہا: کیوں نہیں، آپ نے ایسا فرمایا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": 2053,
			"text": "ایک صحابی رضی الله عنہ سے روایت ہے کہ ایک شخص نے عرض کیا: اللہ کے رسول! کیا بات ہے؟ سبھی اہل ایمان اپنی قبروں میں آزمائے جاتے ہیں، سوائے شہید کے؟ آپ نے فرمایا: ”اس کے سروں پر چمکتی تلوار کی آزمائش کافی ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": 2054,
			"text": "صفوان بن امیہ رضی الله عنہ کہتے ہیں طاعون سے مرنے والا، پیٹ کے مرض میں مرنے والا، ڈوب کر مرنے والا، اور زچگی کی وجہ سے مرنے والی عورت شہید ہے۔ وہ ( تیمی ) کہتے ہیں: ہم سے ابوعثمان نے بارہا بیان کیا، ایک مرتبہ انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسے مرفوع بیان کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": 2055,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہی وہ شخص ہے جس کے لیے عرش الٰہی ہل گیا، آسمان کے دروازے کھول دئیے گئے، اور ستر ہزار فرشتے اس کے جنازے میں شریک ہوئے، ( پھر بھی قبر میں ) اسے ایک بار بھینچا گیا، پھر ( یہ عذاب ) اس سے جاتا رہا“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": 2056,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں آیت کریمہ «يثبت اللہ الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة» ”اللہ ایمان والوں کو دنیا اور آخرت میں ٹھیک بات پر قائم رکھے گا“ ( ابراہیم: ۲۷ ) ۔ عذاب قبر کے سلسلے میں نازل ہوئی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 2057,
			"arabicnumber": 2057,
			"text": "براء بن عازب رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”آیت کریمہ «يثبت اللہ الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة‏» ”اللہ ایمان والوں کو دنیا اور آخرت ( دونوں میں ) ٹھیک بات پر قائم رکھے گا“۔ عذاب قبر کے سلسلے میں اتری ہے۔ میت سے پوچھا جائے گا: تیرا رب کون ہے؟ تو وہ کہے گا: میرا رب اللہ ہے، میرا دین محمد صلی اللہ علیہ وسلم کا دین ہے۔ اللہ کے قول: «يثبت اللہ الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة» سے یہی مراد ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 2058,
			"arabicnumber": 2058,
			"text": "انس رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے کسی قبر سے ایک آواز سنی تو پوچھا: ”یہ کب مرا ہے؟“ لوگوں نے کہا: زمانہ جاہلیت میں مرا ہے، آپ اس بات سے خوش ہوئے، اور فرمایا: ”اگر یہ ڈر نہ ہوتا کہ تم ایک دوسرے کو دفن کرنا چھوڑ دو گے، تو میں اللہ تعالیٰ سے دعا کرتا کہ وہ تمہیں عذاب قبر سنا دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": 2059,
			"text": "ابوایوب انصاری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سورج ڈوبنے کے بعد نکلے، تو ایک آواز سنی، آپ نے فرمایا: ”یہود اپنی قبروں میں عذاب دیئے جا رہے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 2060,
			"arabicnumber": 2060,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم دعا کرتے تھے: «اللہم إني أعوذ بك من عذاب القبر وأعوذ بك من عذاب النار وأعوذ بك من فتنة المحيا والممات وأعوذ بك من فتنة المسيح الدجال» ”اے اللہ! میں عذاب قبر سے تیری پناہ مانگتا ہوں، جہنم کے عذاب سے تیری پناہ مانگتا ہوں، زندگی اور موت کی آزمائش سے تیری پناہ مانگتا ہوں، اور مسیح دجال کی آزمائش سے ( بھی ) تیری پناہ مانگتا ہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": 2061,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس کے بعد عذاب قبر سے پناہ مانگتے سنا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "اسماء بنت ابی بکر رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے ( اور ) اس آزمائش کا ذکر کیا جس سے آدمی اپنی قبر میں دوچار ہوتا ہے، تو جب آپ نے اس کا ذکر کیا تو مسلمانوں نے ایک چیخ ماری جو میرے اور رسول اللہ صلی اللہ علیہ وسلم کی بات سمجھنے کے درمیان حائل ہو گئی، جب ان کی چیخ و پکار بند ہوئیں تو میں نے ایک شخص سے جو مجھ سے قریب تھا کہا: اللہ تجھے برکت دے! رسول اللہ صلی اللہ علیہ وسلم نے اپنے خطاب کے آخر میں کیا کہا تھا؟ اس نے کہا: ( آپ نے فرمایا تھا: ) ”مجھ پر وحی کی گئی ہے کہ قبروں میں تمہاری آزمائش ہو گی جو دجال کی آزمائش کے قریب قریب ہو گی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": 2063,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم یہ دعا انہیں اسی طرح سکھاتے تھے جیسے قرآن کی سورت سکھاتے تھے، آپ فرماتے کہو: «اللہم إنا نعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات» ”اے اللہ! ہم تیری پناہ مانگتے ہیں جہنم کے عذاب سے، اور میں تیری پناہ مانگتا ہوں عذاب قبر سے، اور تیری پناہ مانگتا ہوں مسیح دجال کے فتنے سے، اور تیری پناہ مانگتا ہوں موت اور زندگی کی آزمائش سے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": 2064,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے، میرے پاس ایک یہودی عورت تھی، وہ کہہ رہی تھی کہ تم لوگ قبروں میں آزمائے جاؤ گے، ( یہ سن کر ) رسول اللہ صلی اللہ علیہ وسلم گھبرا گئے، اور فرمایا: ”صرف یہودیوں ہی کی آزمائش ہو گی“۔ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں: پھر ہم کئی رات ٹھہرے رہے پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مجھ پر وحی آئی ہے کہ تمہیں ( بھی ) قبروں میں آزمایا جائے گا“، اس کے بعد سے میں رسول اللہ صلی اللہ علیہ وسلم کو عذاب قبر سے پناہ مانگتے سنتی رہی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": 2065,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم قبر کے عذاب، اور دجال کے فتنے سے پناہ طلب کرتے، اور فرماتے: ”تم اپنی قبروں میں آزمائے جاؤ گے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": 2066,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ ایک یہودی عورت ان کے پاس آئی ( اور ) اس نے ان سے کوئی چیز مانگی تو عائشہ رضی اللہ عنہا نے اسے دیا تو اس نے کہا: اللہ تجھے قبر کے عذاب سے بچائے! عائشہ رضی اللہ عنہا کہتی ہیں: تو اس کی یہ بات میرے دل میں بیٹھ گئی یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم آئے تو میں نے آپ سے اس کا ذکر کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”انہیں ان کی قبروں میں عذاب دیا جاتا ہے جسے چوپائے سنتے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": 2067,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں یہود مدینہ کی بوڑھی عورتوں میں سے دو عورتیں میرے پاس آئیں، ( اور ) کہنے لگیں کہ قبر والوں کو ان کی قبروں میں عذاب دیا جاتا ہے، تو میں نے ان کو جھٹلا دیا اور مجھے یہ بات اچھی نہیں لگی کہ میں ان کی تصدیق کروں، وہ دونوں نکل گئیں ( تبھی ) رسول اللہ صلی اللہ علیہ وسلم میرے پاس آئے تو میں نے عرض کیا: اللہ کے رسول! یہود مدینہ کی بوڑھیوں میں سے دو بوڑھیاں کہہ رہی تھیں کہ مردوں کو ان کی قبروں میں عذاب دیا جاتا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”ان دونوں نے سچ کہا، انہیں عذاب دیا جاتا ہے جسے سارے چوپائے سنتے ہیں“، ( پھر ) میں نے دیکھا آپ ہر صلاۃ کے بعد عذاب قبر سے پناہ مانگتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم مکہ یا مدینہ کے باغات میں سے ایک باغ کے پاس سے گزرے، تو آپ نے دو انسانوں کی آوازیں سنیں جنہیں ان کی قبروں میں عذاب دیا جا رہا تھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”ان دونوں کو عذاب دیا جا رہا ہے، اور انہیں کسی بڑے جرم میں عذاب نہیں دیا جا رہا ہے ۱؎، بلکہ ان میں سے ایک اچھی طرح اپنے پیشاب سے پاکی نہیں حاصل کرتا تھا، اور دوسرا چغل خوری ۲؎ کرتا تھا“، پھر آپ نے ایک ٹہنی منگوائی ( اور ) اس کے دو ٹکڑے کئے پھر ان میں سے ہر ایک کی قبر پر ایک ایک ٹکڑا رکھ دیا، تو آپ سے سوال کیا گیا: اللہ کے رسول! آپ نے ایسا کیوں کیا؟ تو آپ نے فرمایا: ”شاید ان کے عذاب میں نرمی کر دی جائے جب تک یہ دونوں ( ٹہنیاں ) خشک نہ ہوں“۔ راوی کو شک ہے کہ آپ نے «ما لم ييبسا أو أن ييبسا» فرمایا، یا «إلى أن ييبسا» فرمایا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": 2069,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم دو قبر کے پاس سے گزرے تو آپ نے فرمایا: ”ان دونوں کو عذاب دیا جا رہا ہے، اور یہ کسی بڑے جرم میں عذاب نہیں دئیے جا رہے ہیں، رہا ان میں سے ایک تو وہ اپنے پیشاب سے اچھی طرح پاکی حاصل نہیں کرتا تھا، اور رہا دوسرا تو وہ چغل خوری کرتا تھا، پھر آپ نے کھجور کی ایک ہری ٹہنی لی ( اور ) اسے آدھا آدھا چیر دیا، پھر ہر ایک کی قبر پہ گاڑ دیا“، تو لوگوں نے پوچھا: اللہ کے رسول! آپ نے ایسا کیوں کیا؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”شاید ان دونوں کا عذاب ہلکا کر دیا جائے جب تک یہ دونوں ( ٹہنیاں ) خشک نہ ہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 2070,
			"arabicnumber": 2070,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سنو! جب تم میں سے کوئی مر جاتا ہے تو اس پر صبح و شام اس کا ٹھکانہ پیش کیا جاتا ہے، اگر جنتی ہے تو جنت میں کا، اور اگر جہنمی ہے تو جہنم میں کا، یہاں تک کہ اللہ تعالیٰ اسے قیامت کے روز اٹھائے“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 2071,
			"arabicnumber": 2071,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی مرتا ہے تو اس پر صبح و شام اس کا ٹھکانا پیش کیا جاتا ہے، چنانچہ اگر وہ جہنمی ہے تو جہنمیوں ( کے ٹھکانوں ) میں سے ( پیش کیا جائے گا ) ، اور کہا جاتا ہے: یہ ہے تمہارا ٹھکانا یہاں تک کہ اللہ تعالیٰ تمہیں قیامت کے روز اٹھائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 2072,
			"arabicnumber": 2072,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم میں سے کوئی مرتا ہے تو اس کا ٹھکانا اس پر صبح و شام پیش کیا جاتا ہے، اگر وہ جنتی ہے تو جنتیوں ( کے ٹھکانوں ) میں سے، اور اگر جہنمی ہے تو جہنمیوں ( کے ٹھکانوں ) میں سے، ( اور اس سے ) کہا جاتا ہے: یہ تمہارا ٹھکانا ہے یہاں تک کہ اللہ عزوجل تمہیں قیامت کے روز اٹھائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 2073,
			"arabicnumber": 2073,
			"text": "کعب بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مومن کی جان جنت کے درختوں پہ اڑتی رہے گی یہاں تک کہ قیامت کے دن اللہ تعالیٰ اسے اس کے جسم کی طرف بھیج دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 2074,
			"arabicnumber": 2074,
			"text": "انس رضی الله عنہ کہتے ہیں کہ ہم عمر رضی اللہ عنہ کے ساتھ مکہ اور مدینہ کے درمیان تھے کہ وہ ہم سے اہل بدر کے سلسلہ میں بیان کرنے لگے، اور کہنے لگے کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ( کافروں کے ) مارے جانے کی جگہیں ایک دن پہلے دکھلا دیں، اور فرمایا: ”اگر اللہ تعالیٰ نے چاہا تو کل فلاں کے پچھاڑ کھا کر گرنے کی جگہ یہاں ہو گی، اور فلاں کی یہاں“، عمر رضی اللہ عنہ کہتے ہیں: قسم اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا! ان جگہوں میں کوئی فرق نہیں آیا، چنانچہ انہیں ایک کنویں میں ڈال دیا گیا، ( پھر ) نبی اکرم صلی اللہ علیہ وسلم ان کے پاس آئے، ( اور ) پکارا: ”اے فلاں، فلاں کے بیٹے! اے فلاں، فلاں کے بیٹے! کیا تم سے تمہارے رب نے جو وعدہ کیا تھا اسے صحیح پایا؟ میں نے تو اللہ نے جو وعدہ مجھ سے کیا تھا اسے صحیح پایا“، اس پر عمر رضی اللہ عنہ نے کہا: آپ ایسے جسموں سے بات کر رہے ہیں جن میں روح نہیں؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”جو میں کہہ رہا ہوں اسے تم ان سے زیادہ نہیں سنتے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 2075,
			"arabicnumber": 2075,
			"text": "انس رضی الله عنہ کہتے ہیں کہ مسلمانوں نے رات کو بدر کے کنویں پر رسول اللہ صلی اللہ علیہ وسلم کو کھڑے آواز لگاتے سنا: ”اے ابوجہل بن ہشام! اے شیبہ بن ربیعہ! اے عتبہ بن ربیعہ! اور اے امیہ بن خلف! کیا تم سے تمہارے رب نے جو وعدہ کیا تھا اسے تم نے صحیح پایا؟، میں نے تو اپنے رب کے وعدہ کو صحیح پایا“، لوگوں نے عرض کیا: اللہ کے رسول! آپ ان لوگوں کو پکارتے ہیں جو محض بدبودار لاش ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”جو میں کہہ رہا ہوں اسے تم ان سے زیادہ نہیں سن سکتے، لیکن ( فرق صرف اتنا ہے کہ ) وہ جواب نہیں دے سکتے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 2076,
			"arabicnumber": 2076,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم بدر کے کنویں پہ کھڑے ہوئے ( اور ) فرمایا: ”کیا تم نے اپنے رب کے وعدہ کو صحیح پایا؟“ ( پھر ) آپ نے فرمایا: ”اس وقت جو کچھ میں ان سے کہہ رہا ہوں اسے یہ لوگ سن رہے ہیں“، تو ام المؤمنین عائشہ رضی اللہ عنہا سے ذکر کیا گیا، تو انہوں نے کہا: ابن عمر رضی اللہ عنہما سے بھول ہوئی ہے، رسول اللہ صلی اللہ علیہ وسلم نے ( یوں ) کہا تھا: ”یہ لوگ اب خوب جان رہے ہیں کہ جو میں ان سے کہتا تھا وہ سچ تھا“، پھر انہوں نے اللہ کا قول پڑھا: «إنك لا تسمع الموتى» ( النمل: ۸۰ ) یہاں تک کہ پوری آیت پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 2077,
			"arabicnumber": 2077,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بنی آدم ( کے جسم کا ہر حصہ ) ، ( مغیرہ والی حدیث میں ہے ) ابن آدم ( کے جسم کے ہر حصہ کو ) مٹی کھا جاتی ہے، سوائے اس کی ریڑھ کی ہڈی کے، اسی سے وہ پیدا کیا گیا ہے، اور اسی سے ( دوبارہ ) جوڑا جائے گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 2078,
			"arabicnumber": 2078,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اللہ تعالیٰ فرماتا ہے ابن آدم نے مجھے جھٹلایا حالانکہ مجھے جھٹلانا اس کے لیے مناسب نہ تھا، ابن آدم نے مجھے گالی دی حالانکہ مجھے گالی دینا اس کے لیے مناسب نہ تھا، رہا اس کا مجھے جھٹلانا تو وہ اس کا ( یہ ) کہنا ہے کہ میں اسے دوبارہ پیدا نہیں کر سکوں گا جیسے پہلی بار کیا تھا، حالانکہ آخری بار پیدا کرنا پہلی بار پیدا کرنے سے زیادہ دشوار مشکل نہیں، اور رہا اس کا مجھے گالی دینا تو وہ اس کا ( یہ ) کہنا ہے کہ اللہ کے بیٹا ہے، حالانکہ میں اللہ اکیلا اور بے نیاز ہوں، نہ میں نے کسی کو جنا، نہ مجھے کسی نے جنا، اور نہ کوئی میرا ہم سر ہے“",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 2079,
			"arabicnumber": 2079,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے سنا: ”ایک بندے نے اپنے اوپر ( بڑا ) ظلم کیا، یہاں تک کہ موت ( کا وقت ) آپ پہنچا، تو اس نے اپنے گھر والوں سے کہا: جب میں مر جاؤں تو مجھے جلا دینا، پھر مجھے پیس ڈالنا، کچھ ہوا میں اڑا دینا اور کچھ سمندر میں ڈال دینا، اس لیے کہ اللہ کی قسم! اگر اللہ تعالیٰ مجھ پر قادر ہوا تو ایسا ( سخت ) عذاب دے گا کہ ویسا عذاب اپنی کسی مخلوق کو نہیں دے گا“، تو اس کے گھر والوں نے ایسا ہی کیا، اللہ تعالیٰ نے ہر چیز کو جس نے اس کا کچھ حصہ لیا تھا حکم دیا کہ حاضر کرو جو کچھ تم نے لیا ہے، تو کیا دیکھتے ہیں کہ وہ سامنے کھڑا ہے، ( تو ) اللہ تعالیٰ نے اس سے پوچھا: تجھے ایسا کرنے پر کس چیز نے اکسایا؟ اس نے کہا: تیرے خوف نے، تو اللہ تعالیٰ نے اسے بخش دیا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 2080,
			"arabicnumber": 2080,
			"text": "حذیفہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تم سے پہلے لوگوں میں کا ایک آدمی اپنے اعمال کے سلسلہ میں بدگمان تھا، چنانچہ جب موت ( کا وقت ) آپ پہنچا، تو اس نے اپنے گھر والوں سے کہا: جب میں مر جاؤں تو مجھے جلا دینا، پھر پیس ڈالنا، پھر مجھے دریا میں اڑا دینا، کیونکہ اگر اللہ تعالیٰ مجھ پر قادر ہو گا تو وہ مجھے بخشے گا نہیں، آپ نے فرمایا: اللہ تعالیٰ نے فرشتوں کو حکم دیا تو وہ اس کی روح کو پکڑ کر لائے، اللہ تعالیٰ نے اس سے پوچھا: تجھے ایسا کرنے پر کس چیز نے ابھارا؟ اس نے کہا: اے میرے رب! میں نے صرف تیرے خوف کی وجہ سے ایسا کیا ہے، تو اللہ تعالیٰ نے اسے بخش دیا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 2081,
			"arabicnumber": 2081,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر خطبہ دیتے سنا آپ فرما رہے تھے: ”تم اللہ تعالیٰ سے ننگے پاؤں، ننگے بدن ( اور ) غیر مختون ملو گے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 2082,
			"arabicnumber": 2082,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”لوگ قیامت کے دن ننگ دھڑنگ، غیر مختون اکٹھا کیے جائیں گے، اور مخلوقات میں سب سے پہلے ابراہیم علیہ السلام کو کپڑا پہنایا جائے گا، پھر آپ نے یہ آیت کریمہ تلاوت فرمائی: «كما بدأنا أول خلق نعيده» ”جیسے ہم نے پہلی دفعہ پیدا کیا تھا ویسے ہی دوبارہ پیدا کریں گے“ ( الانبیاء: ۱۰۴ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 2083,
			"arabicnumber": 2083,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لوگ قیامت کے دن ننگے پاؤں، ننگے بدن ( اور ) غیر مختون اٹھائے جائیں گے“، تو اس پر عائشہ رضی اللہ عنہا نے پوچھا: لوگوں کی شرمگاہوں کا کیا حال ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اس دن ہر ایک کی ایسی حالت ہو گی جو اسے ( ان چیزوں سے ) بے نیاز کر دے گی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 2084,
			"arabicnumber": 2084,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تم لوگ ( قیامت کے دن ) ننگے پاؤں ( اور ) ننگے بدن اکٹھا کیے جاؤ گے“، میں نے پوچھا: مرد عورت سب ایک دوسرے کو دیکھیں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”معاملہ اتنا سنگین ہو گا کہ انہیں اس کی فکر نہیں ہو گی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 2085,
			"arabicnumber": 2085,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لوگ قیامت کے دن تین گروہ میں جمع کیے جائیں گے، کچھ جنت کی رغبت رکھنے والے اور جہنم سے ڈرنے والے ہوں گے ۱؎، اور کچھ لوگ ایک اونٹ پر دو سوار ہوں گے، ایک اونٹ پر تین سوار ہوں گے، ایک اونٹ پر چار سوار ہوں گے، ایک اونٹ پر دس سوار ہوں گے، اور بقیہ لوگوں کو آگ ۱؎ اکٹھا کرے گی، ان کے ساتھ وہ بھی قیلولہ کرے گی جہاں وہ قیلولہ کریں گے، رات گزارے گی جہاں وہ رات گزاریں گے، صبح کرے گی جہاں وہ صبح کریں گے، اور شام کرے گی جہاں وہ شام کریں گے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 2086,
			"arabicnumber": 2086,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ صادق و مصدوق صلی اللہ علیہ وسلم نے مجھ سے بیان کیا کہ لوگ ( قیامت کے دن ) تین گروہ میں جمع کیے جائیں گے: ایک گروپ سوار ہو گا، کھاتے ( اور ) پہنتے اٹھے گا، اور ایک گروہ کو فرشتے اوندھے منہ گھسیٹیں گے، اور انہیں آگ گھیر لے گی، اور ایک گروہ پیدل چلے گا ( بلکہ ) دوڑے گا۔ اللہ تعالیٰ سواریوں پر آفت نازل کر دے گا، چنانچہ کوئی سواری باقی نہ رہے گی، یہاں تک کہ ایک شخص کے پاس باغ ہو گا جسے وہ ایک پالان والے اونٹ کے بدلے میں دیدے گا جس پر وہ قادر نہ ہو سکے گا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 2087,
			"arabicnumber": 2087,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نصیحت کرنے کھڑے ہوئے تو فرمایا: ”لوگو! تم اللہ تعالیٰ کے پاس ننگے جسم جمع کئے جاؤ گے، ( ابوداؤد کی روایت میں ہے ننگے پاؤں اور غیر مختون جمع کئے جاؤ گے، اور وکیع اور وہب کی روایت میں ہے: ننگے جسم اور بلا ختنہ ) جیسے ہم نے پہلی دفعہ پیدا کیا تھا ویسے ہی دوبارہ پیدا کریں گے، آپ صلی اللہ علیہ وسلم نے فرمایا: سب سے پہلے جسے قیامت کے دن کپڑا پہنایا جائے گا ابراہیم علیہ السلام ہوں گے، اور عنقریب میری امت کے کچھ لوگ لائے جائیں گے ( ابوداؤد کی روایت میں «یجائ» ہے اور وہب اور وکیع کی روایت میں «سیؤتی» ہے ) اور وہ پکڑ کر بائیں جانب لے جائے جائیں گے، میں عرض کروں گا: اے میرے رب! یہ میرے اصحاب ( امتی ) ہیں، کہا جائے گا: آپ نہیں جانتے جو آپ کے بعد انہوں نے شریعت میں نئی چیزیں ایجاد کر ڈالی ہیں، تو میں وہی کہوں گا جو نیکوکار بندے ( عیسیٰ علیہ السلام ) نے کہا تھا کہ جب تک میں ان کے درمیان موجود تھا ان پر گواہ تھا جب تو نے مجھے وفات دے دی ( تو تو ہی ان کا نگہبان تھا ) اب اگر تو انہیں سزا دے تو یہ تیرے بندے ہیں، اور اگر انہیں بخش دے تو تو زبردست حکمت والا ہے، تو کہا جائے گا: یہ لوگ برابر پیٹھ پھیرنے والے رہے، ( اور ابوداؤد کی روایت میں ہے: جب سے تم ان سے جدا ہوئے یہ اپنے ایڑیوں کے بل پلٹنے والے رہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 2088,
			"arabicnumber": 2088,
			"text": "قرہ رضی الله عنہ کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم جب بیٹھتے تو آپ کے صحابہ کی ایک جماعت بھی آپ کے پاس بیٹھتی، ان میں ایک ایسے آدمی بھی ہوتے جن کا ایک چھوٹا بچہ ان کی پیٹھ کے پیچھے سے آتا، تو وہ اسے اپنے سامنے ( گود میں ) بٹھا لیتے ( چنانچہ کچھ دنوں بعد ) وہ بچہ مر گیا، تو اس آدمی نے اپنے بچے کی یاد میں محفل میں آنا بند کر دیا، اور رنجیدہ رہنے لگا، تو ( جب ) نبی اکرم صلی اللہ علیہ وسلم نے اسے نہیں پایا تو پوچھا: ”کیا بات ہے؟ میں فلاں کو نہیں دیکھ رہا ہوں؟“ لوگوں نے کہا: اللہ کے رسول! اس کا ننھا بچہ جسے آپ نے دیکھا تھا مر گیا، چنانچہ نبی اکرم صلی اللہ علیہ وسلم نے اس سے ملاقات کی، ( اور ) اس کے بچے کے بارے میں پوچھا، تو اس نے بتایا کہ وہ مر گیا، تو آپ نے اس کی ( موت کی خبر ) پر اس کی تعزیت کی، پھر فرمایا: ”اے فلاں! تجھ کو کون سی بات زیادہ پسند ہے؟ یہ کہ تم اس سے عمر بھر فائدہ اٹھاتے یا یہ کہ ( جب ) تم قیامت کے دن جنت کے کسی دروازے پر جاؤ تو اسے اپنے سے پہلے پہنچا ہوا پائے، وہ تمہارے لیے اسے کھول رہا ہو؟“ تو اس نے کہا: اللہ کے نبی! مجھے یہ بات زیادہ پسند ہے کہ وہ جنت کے دروازے پر مجھ سے پہلے پہنچے، اور میرے لیے دروازہ کھول رہا ہو، آپ نے فرمایا: ”تمہارے لیے ایسا ( ہی ) ہو گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 2089,
			"arabicnumber": 2089,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں موت کا فرشتہ موسیٰ علیہ السلام کے پاس بھیجا گیا، جب وہ ان کے پاس آیا تو انہوں نے اسے ایک طمانچہ رسید کیا، تو اس کی ایک آنکھ پھوٹ کر بہہ گئی، چنانچہ اس نے اپنے رب کے پاس واپس جا کر شکایت کی کہ تو نے مجھے ایسے بندے کے پاس بھیج دیا جو مرنا نہیں چاہتا، اللہ تعالیٰ نے اس کی آنکھ اچھی کر دی، اور کہا: اس کے پاس دوبارہ جاؤ، اور اس سے کہہ: تم اپنا ہاتھ بیل کی پیٹھ پر رکھو اس کے ہاتھ کے نیچے جتنے بال آئیں گے ہر بال کے عوض انہیں ایک سال کی مزید عمر مل جائے گی، تو انہوں نے عرض کیا: اے میرے رب! پھر کیا ہو گا؟ اللہ تعالیٰ نے فرمایا: پھر مرنا ہو گا، ( موسیٰ علیہ السلام ) نے کہا: تب تو ابھی ( مرنا بہتر ہے ) ، تو انہوں نے اللہ تعالیٰ سے درخواست کی کہ وہ انہیں ارض مقدس سے پتھر پھینکنے کی مسافت کے برابر قریب کر دے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر میں اس جگہ ہوتا تو تمہیں راستے کی طرف سرخ ٹیلے کے نیچے ان کی قبر دکھلاتا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 272
			}
		}
	]
}