{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2435,
			"arabicnumber": 2435,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے معاذ بن جبل رضی اللہ عنہ کو یمن بھیجتے وقت فرمایا: ”تم اہل کتاب ( یہود و نصاریٰ ) کے پاس جا رہے ہو، تو جب تم ان کے پاس پہنچو تو انہیں اس بات کی دعوت دو کہ وہ اس بات کی گواہی دیں کہ اللہ کے سوا کوئی معبود برحق نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، پھر اگر وہ تمہاری یہ بات مان لیں تو انہیں بتاؤ کہ اللہ تعالیٰ نے ان پر دن و رات میں پانچ وقت کی نمازیں فرض کی ہیں، پھر اگر وہ تمہاری یہ بات مان لیں تو انہیں بتاؤ کہ اللہ عزوجل نے ان پر ( زکاۃ ) فرض کی ہے، جو ان کے مالداروں سے لی جائے گی اور ان کے محتاجوں میں بانٹ دیا جائے گا، اگر وہ تمہاری یہ بات بھی مان لیں تو پھر مظلوم کی بد دعا سے بچو“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2436,
			"arabicnumber": 2436,
			"text": "بہز بن حکیم کے دادا معاویہ بن حیدہ رضی الله عنہ سے روایت ہے کہ میں نے عرض کیا: اللہ کے نبی! میں آپ کے پاس نہیں آیا یہاں تک کہ میں نے اپنے دونوں ہاتھوں کی انگلیوں کی تعداد سے زیادہ بار یہ قسم کھائی کہ نہ میں آپ کے قریب اور نہ آپ کے دین کے قریب آؤں گا۔ اور اب میں ایک ایسا آدمی ہوں کہ کوئی چیز سمجھتا ہی نہیں ہوں سوائے اس چیز کے جسے اللہ اور اس کے رسول نے مجھے سکھا دی ہے، اور میں اللہ کی وحی کی قسم دے کر آپ سے پوچھتا ہوں کہ اللہ تعالیٰ نے کیا چیز دے کر آپ کو ہمارے پاس بھیجا ہے؟ آپ نے فرمایا: ”اسلام کے ساتھ“، میں نے پوچھا: اسلام کی نشانیاں کیا ہیں؟ آپ نے فرمایا: ”یہ ہیں کہ تم کہو کہ میں نے اپنے آپ کو اللہ تعالیٰ کے حوالے کر دیا، اور شرک اور اس کی تمام آلائشوں سے کٹ کر صرف اللہ کی عبادت کے لیے یکسو ہو گیا، اور نماز قائم کرو، اور زکاۃ دو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2437,
			"arabicnumber": 2437,
			"text": "ابو مالک اشعری رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کامل وضو کرنا آدھا ایمان ہے، الحمدللہ ترازو کو بھر دیتا ہے۔ اور سبحان اللہ اور اللہ اکبر آسمانوں اور زمین کو ( ثواب ) سے بھر دیتے ہیں۔ اور نماز نور ہے، اور زکاۃ دلیل ہے، اور صبر روشنی ہے، اور قرآن حجت ( دلیل ) ہے تیرے حق میں بھی، اور تیرے خلاف بھی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2438,
			"arabicnumber": 2438,
			"text": "ابوہریرہ اور ابوسعید رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ایک دن خطبہ دیا۔ آپ نے تین بار فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے“، پھر آپ نے سر جھکا لیا تو ہم سے ہر شخص سر جھکا کر رونے لگا، ہم نہیں جان سکے آپ نے کس بات پر قسم کھائی ہے، پھر آپ نے اپنا سر اٹھایا، آپ کے چہرے پر بشارت تھی جو ہمیں سرخ اونٹ پانے کی خوشی سے زیادہ محبوب تھی، پھر آپ نے فرمایا: ”جو بندہ بھی پانچوں وقت کی نماز پڑھے، روزے رمضان رکھے، اور زکاۃ ادا کرے، اور ساتوں کبائر ۱؎ سے بچے تو اس کے لیے جنت کے دروازے کھول دیے جائیں گے، اور اس سے کہا جائے گا: سلامتی کے ساتھ جنت میں داخل ہو جاؤ“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2439,
			"arabicnumber": 2439,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا کہ جو شخص اللہ کی راہ میں چیزوں میں سے کسی چیز کے جوڑے دے تو وہ جنت کے دروازے سے یہ کہتے ہوئے بلایا جائے گا کہ اللہ کے بندے! آ جا یہ دروازہ تیرے لیے بہتر ہے، تو جو شخص اہل صلاۃ میں سے ہو گا وہ صلاۃ کے دروازے سے بلایا جائے گا۔ اور جو شخص مجاہدین میں سے ہو گا وہ جہاد کے دروازے سے بلایا جائے گا، اور جو اہل صدقہ ( و زکاۃ ) میں سے ہوں گے تو وہ صدقہ ( زکاۃ ) کے دروازے سے بلایا جائے گا، اور جو روزے رکھنے والوں میں سے ہو گا وہ باب الریان ( ریان کے دروازہ ) سے بلایا جائے گا۔ ابوبکر رضی اللہ عنہ نے عرض کیا: جو کوئی ان دروازوں میں سے کسی ایک دروازے سے بلا لیا جائے اسے مزید کسی اور دروازے سے بلائے جانے کی ضرورت نہیں، لیکن اللہ کے رسول! کیا کوئی ایسا بھی ہے جو ان تمام دروازوں سے بلایا جائے گا؟ آپ نے فرمایا: ”ہاں، اور مجھے امید ہے کہ تم انہیں میں سے ہو گے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2440,
			"arabicnumber": 2440,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، آپ خانہ کعبہ کے سایہ میں بیٹھے ہوئے تھے، جب آپ نے ہمیں آتے دیکھا تو فرمایا: ”وہ بہت خسارے والے لوگ ہیں، رب کعبہ کی قسم“! میں نے ( اپنے جی میں ) کہا: کیا بات ہے؟ شاید میرے بارے میں کوئی آیت نازل ہوئی ہے، میں نے عرض کیا: کون لوگ ہیں میرے ماں باپ آپ پر قربان ہوں؟ آپ نے فرمایا: ”بہت مال والے، مگر جو اس طرح کرے، اس طرح کرے“ یہاں تک کہ آپ اپنے سامنے، اپنے دائیں، اور اپنے بائیں دونوں ہاتھ سے اشارہ کیا، پھر آپ نے فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے جو شخص کوئی اونٹ یا بیل چھوڑ کر مرے گا جس کی اس نے زکاۃ نہ دی ہو گی تو وہ ( اونٹ یا بیل ) ( دنیا میں ) جیسا کچھ وہ تھا قیامت کے دن اس سے بڑا اور موٹا تازہ ہو کر اس کے سامنے آئے گا، اور اسے اپنے کھروں سے روندے گا اور سینگوں سے مارے گا، جب آخری جانور روند اور مار چکے گا تو پھر ان کا پہلا لوٹا دیا جائے گا، اور یہ سلسلہ جاری رہے گا یہاں تک کہ لوگوں کے درمیان فیصلہ کر دیا جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": 2441,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص کے پاس مال ہو اور وہ اپنے مال کا حق ادا نہ کرے ( یعنی زکاۃ نہ دے ) تو وہ مال ایک گنجے زہریلے سانپ کی شکل میں اس کی گردن کا ہار بنا دیا جائے گا، وہ اس سے بھاگے گا، اور وہ ( سانپ ) اس کے ساتھ ہو گا“، پھر اس کی تصدیق کے لیے آپ نے قرآن مجید کی یہ آیت پڑھی «ولا تحسبن الذين يبخلون بما آتاهم اللہ من فضله هو خيرا لهم بل هو شر لهم سيطوقون ما بخلوا به يوم القيامة» ”تم یہ مت سمجھو کہ جو لوگ اس مال میں جو اللہ نے انہیں دیا ہے بخیلی کرتے ہیں ان کے حق میں بہتر ہے، یہ بہت برا ہے ان کے لیے۔ عنقریب جس مال کے ساتھ انہوں نے بخل کیا ہو گا وہ قیامت کے دن ان کے گلے کا ہار بنا دیا جائے گا“ ( آل عمران: ۱۸ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": 2442,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا کہ جس شخص کے پاس اونٹ ہوں اور وہ ان کی تنگی اور خوشحالی میں ان کا حق ادا نہ کرے ( لوگوں نے ) عرض کیا: اللہ کے رسول! «نجدتها ورسلها» سے کیا مراد ہے؟ آپ نے فرمایا: تنگی اور آسانی ۱؎ تو وہ اونٹ جیسے کچھ تھے قیامت کے دن اس سے زیادہ چست، فربہ اور موٹے تازے ہو کر آئیں گے۔ اور یہ ایک کشادہ اور ہموار چٹیل میدان میں اوندھا لٹا دیا جائے گا، وہ اسے اپنے کھروں سے روندیں گے، جب آخری اونٹ روند چکے گا تو پھر پہلا اونٹ روندنے کے لیے لوٹایا جائے گا، ایک ایسے دن میں جس کی مقدار پچاس ہزار سال کے برابر ہو گی، اور یہ سلسلہ برابر اس وقت تک چلتا رہے گا جب تک لوگوں کے درمیان فیصلہ نہ کر دیا جائے گا، اور وہ اپنا راستہ دیکھ نہ لے گا، جن کے پاس گائے بیل ہوں اور وہ ان کا حق ادا نہ کرے یعنی ان کی زکاۃ نہ دے، ان کی تنگی اور ان کی کشادگی کے زمانہ میں، تو وہ گائے بیل قیامت کے دن پہلے سے زیادہ مستی و نشاط میں موٹے تازے اور تیز رفتار ہو کر آئیں گے، اور اسے ایک کشادہ میدان میں اوندھا لٹا دیا جائے گا اور ہر سینگ والا اسے سینگوں سے مارے گا، اور ہر کھر والا اپنی کھروں سے اسے روندے گا، جب آخری جانور روند چکے گا، تو پھر پہلا پھر لوٹا دیا جائے گا، ایک ایسے دن میں جس کی مقدار پچاس ہزار سال کی ہو گی، یہاں تک کہ لوگوں کے درمیان فیصلہ کر دیا جائے اور وہ اپنا راستہ دیکھ لے، اور جس شخص کے پاس بکریاں ہوں اور وہ ان کی تنگی اور آسانی میں ان کا حق ادا نہ کرے تو قیامت کے دن وہ بکریاں اس سے زیادہ چست فربہ اور موٹی تازی ہو کر آئیں گی جتنی وہ ( دنیا میں ) تھیں، پھر وہ ایک کشادہ ہموار میدان میں منہ کے بل لٹا دیا جائے، تو ہر کھر والی اسے اپنے کھر سے روندیں گی، اور ہر سینگ والی اسے اپنی سینگ سے مارے گی، ان میں کوئی مڑی ہوئی اور ٹوٹی ہوئی سینگ کی نہ ہو گی، جب آخری بکری مار چکے گی تو پھر پہلی بکری لوٹا دی جائے گی، ایک ایسے دن میں جس کی مقدار پچاس ہزار سال کے برابر ہو گی، یہاں تک کہ لوگوں کے درمیان فیصلہ کر دیا جائے، اور وہ اپنا راستہ دیکھ لے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": 2443,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی اور آپ کے بعد ابوبکر رضی اللہ عنہ خلیفہ بنائے گئے، اور عربوں میں سے جنہیں کافر مرتد ہونا تھا کافر ہو گئے تو عمر رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے کہا: آپ لوگوں سے کیسے لڑیں گے؟ جب کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ”مجھے حکم دیا گیا ہے کہ میں لوگوں سے لڑوں یہاں تک کہ یہ لا الٰہ الا اللہ کا اقرار کر لیں، تو جس نے لا الٰہ الا اللہ کا اقرار کر لیا، اس نے مجھ سے اپنے مال اور اپنی جان کو سوائے اسلام کے حق ۱؎ کے مجھے سے محفوظ کر لیا۔ اور اس کا حساب اللہ کے سپرد ہے“ ۲؎ اس پر ابوبکر رضی اللہ عنہ نے کہا: میں اس شخص سے ضرور لڑوں گا جو نماز اور زکاۃ میں فرق کرے گا ( یعنی نماز تو پڑھے اور زکاۃ دینے سے منع کرے ) کیونکہ زکاۃ مال کا حق ہے، قسم اللہ کی، اگر یہ اونٹ باندھنے کی رسی بھی جو وہ رسول اللہ صلی اللہ علیہ وسلم کو ادا کیا کرتے تھے مجھ سے روکیں گے، تو میں ان سے ان کے روکنے پر لڑوں گا، عمر رضی اللہ عنہ نے فرمایا: اللہ کی قسم! زیادہ دیر نہیں ہوئی مگر مجھے یقین ہو گیا کہ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کو قتال کے سلسلے میں شرح صدر عطا کر دیا ہے، اور میں نے جان لیا کہ یہ ( یعنی ابوبکر رضی اللہ عنہ کی رائے ) حق ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": 2444,
			"text": "بہز بن حکیم کے دادا معاویہ بن حیدہ رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کو فرماتے سنا: ”چرائے جانے والے ہر چالیس اونٹ میں ایک بنت لبون ۱؎ ہے، اونٹوں کو ( زکاۃ سے بچنے کے لیے ) ان کے حساب ( ریوڑ ) سے جدا نہ کیا جائے۔ جو شخص ثواب کی نیت سے زکاۃ دے گا تو اسے اس کا ثواب ملے گا، اور جو شخص زکاۃ دینے سے انکار کرے گا تو ہم زکاۃ بھی لیں گے اور بطور سزا اس کے آدھے اونٹ بھی لے لیں گے، یہ ہمارے رب کی سزاؤں میں سے ایک سزا ہے۔ اس میں سے محمد صلی اللہ علیہ وسلم کے خاندان کے لیے کوئی چیز جائز نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": 2445,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ وسق سے کم غلے میں زکاۃ نہیں ہے، اور پانچ اونٹ سے کم میں زکاۃ نہیں ہے اور پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "ابوسعید خدری رضی اللہ عنہ سے منقول ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ اونٹ سے کم میں زکاۃ نہیں ہے، اور پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے، اور پانچ وسق سے کم غلے میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ ابوبکر رضی اللہ عنہ نے انہیں ( عاملین صدقہ کو ) یہ لکھا کہ یہ صدقہ کے وہ فرائض ہیں جنہیں رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں پر فرض ٹھہرائے ہیں، جن کا اللہ عزوجل نے اپنے رسول صلی اللہ علیہ وسلم کو حکم دیا ہے، تو جس مسلمان سے اس کے مطابق زکاۃ طلب کی جائے تو وہ دے، اور جس سے اس سے زیادہ مانگا جائے تو وہ نہ دے: پچیس اونٹوں سے کم میں ہر پانچ اونٹ میں ایک بکری ہے، اور جب پچیس اونٹ ہو جائیں تو اس میں پینتیس اونٹوں تک ایک برس کی اونٹنی ہے، اگر ایک برس کی اونٹنی نہ ہو تو دو برس کا اونٹ ( نر ) ہے، اور جب چھتیس اونٹ ہو جائیں تو چھتیس سے پینتالیس تک دو برس کی اونٹنی ہے، اور جب چھیالیس اونٹ ہو جائیں تو چھیالیس سے ساٹھ اونٹ تک میں تین برس کی اونٹنی ( یعنی جو ان اونٹنی جو نر کودانے کے لائق ہو گئی ہو ) ہے، اور جب اکسٹھ اونٹ ہو جائیں تو اکسٹھ سے پچہتر اونٹوں تک میں چار برس کی اونٹنی ہے، اور جب چھہتر اونٹ ہو جائیں تو چھہتر سے نوے اونٹوں تک میں دو دو برس کی دو اونٹنیاں ہیں، اور جب اکیانوے ہو جائیں تو ایک سو بیس اونٹوں تک میں تین تین برس کی دو اونٹنیاں ہیں جو نر کے کودانے کے قابل ہو گئی ہوں۔ اور جب ایک سو بیس سے زیادہ ہو گئی ہوں تو ہر چالیس اونٹ میں دو برس کی ایک اونٹنی۔ اور ہر پچاس اونٹ میں تین برس کی ایک اونٹنی ہے، اگر اونٹوں کی عمروں میں اختلاف ہو ( یعنی زکاۃ کے لائق اونٹ نہ ہو، اس سے بڑا یا چھوٹا ہو ) مثلاً جس شخص پر چار برس کی اونٹنی لازم ہو اور اس کے پاس چار برس کی اونٹنی نہ ہو، تین برس کی اونٹنی ہو۔ تو تین برس کی اونٹنی ہی اس سے قبول کر لی جائے گی اور وہ ساتھ میں دو بکریاں بھی دے۔ اگر اسے بکریاں دینے میں آسانی و سہولت ہو، اور اگر دو بکریاں نہ دے سکتا ہو تو بیس درہم دے۔ اور جس شخص کو تین برس کی اونٹنی دینی پڑ رہی ہو، اور اس کے پاس تین برس کی اونٹنی نہ ہو، چار برس کی اونٹنی ہو تو چار برس کی اونٹنی ہی قبول کر لی جائے گی۔ اور عامل صدقہ ( یعنی زکاۃ وصول کرنے والا ) اسے بیس درہم واپس کرے گا۔ یا اسے بکریاں دینے میں آسانی ہو تو دو بکریاں دے۔ اور جس کو تین برس کی اونٹنی دینی ہو اور تین برس کی اونٹنی اس کے پاس نہ ہو اس کے پاس دو برس کی اونٹنی ہو تو وہ اس سے قبول کر لی جائے، اور وہ اس کے ساتھ دو بکریاں اور دے، اگر یہ اس کے لیے آسان ہو، یا بیس درہم دے، اور جس کو دو برس کی اونٹنی دینی ہو اور وہ اس کے پاس نہ ہو تین برس کی اونٹنی ہو تو وہ اس سے قبول کر لی جائے، اور عامل صدقہ اسے بیس درہم یا دو بکریاں واپس دے، اور جسے دو سال کی اونٹنی زکاۃ میں دینی ہو، اور دو سال کی اونٹنی اس کے پاس نہ ہو ایک سال کی اونٹنی ہو تو وہی اس سے قبول کر لی جائے، اور اس کے ساتھ وہ دو بکریاں دے اگر یہ اس کے لیے آسان ہو، یا بیس درہم دے، اور جس کے اوپر ایک برس کی اونٹنی دینی لازم ہو، اور اس کے پاس ایک برس کی اونٹنی نہ ہو۔ دو برس کا ( نر ) اونٹ ہو، تو دو برس کا اونٹ قبول کر لیا جائے۔ ( اس کے ساتھ کچھ مزید لینا دینا نہیں ہو گا ) اور جس کے پاس صرف چار اونٹ ہوں تو ان میں کوئی زکاۃ نہیں ہے سوائے اس کے کہ ان کا مالک اپنی خوشی سے کچھ دینا چاہے تو دے سکتا ہے، اور جنگل میں چرائی جانے والی بکریاں جب چالیس ہوں تو ان میں ایک سو بیس بکریوں تک میں ایک بکری زکاۃ ہے، اور ایک سو بیس سے جو ایک بکری بھی بڑھ جائے تو دو سو بکریوں تک میں دو بکریاں ہیں۔ اور دو سو سے ایک بکری بھی بڑھ جائے تو دو سو سے تین سو تک میں تین بکریاں ہیں اور جب تین سو سے بھی بڑھ جائیں تو پھر ہر ایک سو میں ایک بکری زکاۃ ہے۔ زکاۃ میں کوئی بوڑھا، کانا اور عیب دار جانور نہیں لیا جائے گا، اور نہ بکریوں کا نر جانور لیا جائے گا مگر یہ کہ صدقہ وصول کرنے والا کوئی ضرورت و مصلحت سے مجھے تو لے سکتا ہے، زکاۃ کے ڈر سے دو جدا مالوں کو یکجا نہیں کیا جا سکتا ۱؎ اور نہ یکجا مال کو جدا جدا ۲؎ اور جب آدمی کی چرائی جانے والی بکریاں چالیس سے ایک بھی کم ہوں تو ان میں کوئی زکاۃ نہیں ہے۔ ہاں ان کا مالک اپنی خوشی سے کچھ دینا چاہے تودے سکتا ہے، اور چاندی میں چالیسواں حصہ زکاۃ ہے، اور اگر ایک سو نوے درہم ہو تو اس میں کوئی زکاۃ نہیں۔ ہاں مالک اپنی خوشی سے کچھ دینا چاہے تو دے سکتا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": 2448,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اونٹ اپنے مالک کے پاس جب اس نے ان میں ان کا حق نہ دیا ہو گا اس سے بہتر حالت میں آئیں گے جس میں وہ ( دنیا میں ) تھے، وہ اسے اپنے کھروں سے روندیں گے، اور بکریاں اپنے مالک کے پاس جب اس نے ان میں ان کا حق نہ دیا ہو گا، اس سے بہتر حالت میں آئیں گی جس حالت میں وہ ( دنیا میں ) تھیں۔ وہ اسے اپنی کھروں سے روندیں گی، اور اپنی سینگوں سے ماریں گی۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”ان کا حق یہ بھی ہے کہ انہیں اسی جگہ دوہا جائے جہاں انہیں پانی پلانے کا نظم ہو ۱؎، سن لو، قیامت کے دن تم میں کا کوئی اپنے اونٹ کو اپنی گردن پر لادے ہوئے نہ لائے وہ بلبلا رہا ہو، پھر وہ کہے: اے محمد! ( بچائیے مجھ کو اس عذاب سے ) کہ میں کہوں: میں تیرے لیے کچھ نہیں کر سکتا، میں تو تجھے بتا چکا تھا، سن لو! قیامت کے دن کوئی اپنی گردن پر بکری کو لادے ہوئے نہ آئے کہ وہ ممیا رہی ہو، پھر وہ کہے: اے محمد! ( مجھے اس عذاب سے بچائیے ) کہ اس وقت میں کہوں: میں تیرے لیے کچھ نہیں کر سکتا، میں تو تجھے پہلے ہی بتا چکا ہوں“۔ آپ نے فرمایا: ”تم میں سے کسی کا خزانہ ۲؎ قیامت کے دن گنجا سانپ بن کر سامنے آئے گا، اس کا مالک اس سے بھاگے گا، اور وہ اس کا برابر پیچھا کرتا رہے گا، اور کہے گا: میں تیرا خزانہ ہوں یہاں تک کہ وہ اس کی انگلی کو اپنے منہ میں داخل کر لے گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": 2449,
			"text": "بہز بن حکیم کے دادا معاویہ بن حیدہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ہر چرنے والے چالیس اونٹوں میں دو برس کی اونٹنی ہے۔ اونٹ اپنے حساب ( ریوڑ ) سے جدا نہ کئے جائیں، جو ثواب کی امید رکھ کر انہیں دے گا تو اسے اس کا اجر ملے گا، اور جو دینے سے انکار کرے گا تو ہم اس سے اسے لے کر رہیں گے، مزید اس کے آدھے اونٹ اور لے لیں گے، یہ ہمارے رب کے تاکیدی حکموں میں سے ایک حکم ہے، محمد کے آل کے لیے اس میں سے کوئی چیز حلال نہیں ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": 2450,
			"text": "معاذ بن جبل رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں یمن بھیجا اور حکم دیا کہ ہر بالغ شخص سے ایک دینار ( جزیہ ) لیں یا اتنی قیمت کی یمنی چادریں، اور ہر تیس گائے بیل میں ایک برس کا بچھوا یا بچھیا لیں، اور ہر چالیس گائے اور بیل میں دو برس کی ایک گائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": 2451,
			"text": "معاذ بن جبل رضی الله عنہ کہتے ہیں کہ مجھے رسول اللہ صلی اللہ علیہ وسلم نے یمن بھیجا، تو مجھے حکم دیا کہ ہر چالیس گائے میں دو برس کی ایک گائے، اور ہر تیس میں ایک سال کا ایک بچھوا لوں۔ اور ہر بالغ سے ( بطور جزیہ ) ایک دینار لوں، یا ایک دینار کے مساوی قیمت کی یمنی چادر۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": 2452,
			"text": "معاذ بن جبل رضی الله عنہ سے روایت ہے کہ جب رسول اللہ صلی اللہ علیہ وسلم نے انہیں یمن بھیجا تو انہیں حکم دیا کہ ہر تیس گائے بیل میں ایک سال کا بچھوا یا بچھیا لیں، اور ہر چالیس گائے میں دو سال کی بچھیا۔ اور ہر بالغ سے ( جزیہ میں ) ایک دینار یا ایک دینار کی قیمت کی یمنی چادر۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": 2453,
			"text": "معاذ بن جبل رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے جس وقت مجھے یمن بھیجا تو حکم دیا کہ میں گائے، بیل سے جب تک وہ تیس کی تعداد کو نہ پہنچ جائیں کچھ نہ لوں، اور جب تیس ہو جائیں تو ان میں گائے کا ایک سال کا بچہ چاہے نر ہو یا مادہ یہاں تک کہ وہ چالیس کو پہنچ جائیں، اور جب چالیس ہو جائیں تو ان میں دو سال کی ایک بچھیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": 2454,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو بھی اونٹ، گائے اور بکری والا ان کا حق ادا نہیں کرے گا، ( یعنی زکاۃ نہیں ادا کرے گا ) تو اسے قیامت کے دن ایک کشادہ ہموار میدان میں کھڑا کیا جائے گا، کھر والے جانور اپنے کھروں سے اسے روندیں گے، اور سینگ والے اسے اپنی سینگوں سے ماریں گے۔ اس دن ان میں کوئی ایسا نہ ہو گا جس کے سینگ ہی نہ ہو اور نہ ہی کسی کی سینگ ٹوٹی ہوئی ہو گی“، ہم نے عرض کیا: اللہ کے رسول! ان کا حق کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ”ان پر نر کودوانا، ان کے ڈول کو منگنی دینا اور اللہ کی راہ میں ان پر بوجھ اور سواری لادنا، اور جو صاحب مال اپنے مال کا حق ادا نہ کرے گا وہ مال قیامت کے دن ایک گنجے ( زہریلے ) سانپ کی شکل میں اسے دکھائی پڑے گا، اس کا مالک اس سے بھاگے گا، اور وہ اس کا پیچھا کرے گا، اور اس سے کہے گا: یہ تو تیرا وہ خزانہ ہے جس کے ساتھ تو بخل کرتا تھا، جب وہ دیکھے گا کہ اس سے بچنے کی کوئی صورت نہیں ہے تو ( لاچار ہو کر ) اپنا ہاتھ اس کے منہ میں ڈال دے گا، اور وہ اس کو اس طرح چبائے گا جس طرح اونٹ چباتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": 2455,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ ابوبکر رضی اللہ عنہ نے انہیں یہ لکھ کر دیا کہ صدقہ ( زکاۃ ) کے یہ وہ فرائض ہیں جنہیں رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں پر فرض ٹھہرائے ہیں جس کا اللہ تعالیٰ نے اپنے رسول کو حکم دیا ہے، تو جس مسلمان سے اس کے مطابق زکاۃ طلب کی جائے تو وہ اسے دے، اور جس سے اس سے زیادہ مانگا جائے تو وہ اسے نہ دے۔ پچیس اونٹوں سے کم میں ہر پانچ اونٹ میں ایک بکری ہے۔ اور جب پچیس اونٹ ہو جائیں تو اس میں پنتیس اونٹوں تک ایک برس کی اونٹنی ہے، اگر ایک برس کی اونٹنی نہ ہو تو دو برس کا اونٹ ( نر ) ہے۔ اور جب چھتیس اونٹ ہو جائیں تو چھتیس سے پینتالیس تک دو برس کی اونٹنی ہے۔ اور جب چھیالیس اونٹ ہو جائیں تو اس میں ساٹھ اونٹ تک تین برس کی اونٹنی ہے، جو نر کودانے کے لائق ہو گئی ہو، اور جب اکسٹھ اونٹ ہو جائیں تو اس میں پچہتر اونٹ تک چار برس کی اونٹنی ہے، اور جب چھہتر اونٹ ہو جائیں تو اس میں نوے تک میں دو دو برس کی دو اونٹنیاں ہیں، اور جب اکیانوے ہو جائیں تو ایک سو بیس تک میں تین تین برس کی دو اونٹنیاں ہیں جو نر کودانے کے قابل ہو گئی ہوں، اور جب ایک سو بیس سے زیادہ ہو گئی ہوں تو ہر چالیس میں دو برس کی ایک اونٹنی ہے، اور ہر پچاس میں تین برس کی ایک اونٹنی ہے۔ اگر اونٹوں کی عمروں میں اختلاف ہو ۱؎ ( مثلاً ) جس شخص پر چار برس کی اونٹنی کی زکاۃ ہو اور اس کے پاس چار برس کی اونٹنی نہ ہو تین برس کی اونٹنی ہو تو اس سے تین برس کی اونٹنی ہی قبول کر لی جائے گی، اور وہ اس کے ساتھ میں دو بکریاں بھی دیدے۔ اگر وہ اسے میسر ہوں ورنہ بیس درہم دے۔ اور جسے زکاۃ میں تین برس کی اونٹنی دینی ہو۔ اور اس کے پاس چار برس کی اونٹنی ہو تو اس سے وہی قبول کر لی جائے گی، اور عامل صدقہ اسے بیس درہم دے یا دو بکریاں واپس دیدے، اور جسے تین برس کی اونٹنی دینی ہو اور یہ اس کے پاس نہ ہو اور اس کے پاس دو برس کی اونٹنی ہو تو وہی اس سے قبول کر لی جائے اور اس کے ساتھ دو بکریاں دے اگر میسر ہوں یا بیس درہم دے، اور جسے زکاۃ میں دو سال کی اونٹنی دینی ہو اور اس کے پاس صرف تین سال کی اونٹنی ہو تو وہی اس سے قبول کر لی جائے گی اور عامل زکاۃ اسے بیس درہم یا دو بکریاں واپس دے، اور جسے دو برس کی اونٹنی دینی ہو، اور اس کے پاس دو برس کی اونٹنی نہ ہو صرف ایک برس کی اونٹنی ہو تو وہی اس سے قبول کر لی جائے اور دو بکریاں دے اگر بکریاں اسے میسر ہوں بیس درہم دے۔ اور جسے ایک برس کی اونٹنی دینی ہو اور اس کے پاس ایک برس کی اونٹنی نہ ہو۔ دو برس کا ( نر ) کا اونٹ ہو، تو وہی اس سے قبول کر لیا جائے۔ اس کے ساتھ کوئی اور چیز لی نہ جائے، اور جس کے پاس صرف چار اونٹ ہوں تو ان میں زکاۃ نہیں ہے الا یہ کہ ان کا مالک اپنی خوشی سے کچھ دینا چاہے تو دے سکتا ہے، اور جنگل میں چرنے والی بکریوں میں جب چالیس ہوں تو ایک سو بیس تک میں ایک بکری زکاۃ ہے، اور ایک سو بیس سے جو ایک بکری بھی بڑھ جائے تو دو سو بکریوں تک میں دو بکریاں ہیں۔ اور دو سو سے ایک بکری بھی بڑھ جائے تو دو سو سے تین سو تک میں تین بکریاں ہیں، اور جب تین سو سے بھی بڑھ جائیں تو پھر ہر سو میں ایک بکری زکاۃ ہے۔ زکاۃ میں بوڑھے کانے اور عیب دار جانور نہیں لیے جائیں گے، اور نہ نر جانور لیا جائے گا الا یہ کہ صدقہ وصول کرنے والا کسی ضرورت و مصلحت سے لینا چاہے۔ زکاۃ کے ڈر سے دو جدا مال یکجا نہ کئے جائیں، اور نہ یکجا مال کو جدا جدا کیا جائے۔ اور جب آدمی کی جنگل میں چرنے والی بکریاں چالیس سے ایک بھی کم ہوں تو ان میں کوئی زکاۃ نہیں ہے، ہاں ان کا مالک اپنی خوشی سے کچھ دینا چاہے تو دے سکتا ہے، چاندی میں چالیسواں حصہ زکاۃ ہے اور اگر مال ایک سو نوے درہم ہی ہو تو ان میں کوئی زکاۃ نہیں ہے۔ ہاں مالک اپنی خوشی سے کچھ دینا چاہے تو دے سکتا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": 2456,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اونٹ گائے اور بکریاں رکھتا ہو اور ان کی زکاۃ نہ دے تو وہ دنیا میں جیسے تھے اس سے بڑے اور موٹے تازے ہو کر آئیں گے، اور وہ اسے اپنی سینگوں سے ماریں گے، اور اپنی کھروں سے روندیں گے، جب آخری جانور مار چکے گا تو پھر پہلا جانور لوٹا دیا جائے گا، اور یہ سلسلہ جاری رہے گا یہاں تک کہ لوگوں کے درمیان فیصلہ کر دیا جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": 2457,
			"text": "سوید بن غفلہ رحمہ اللہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا محصل ( زکاۃ ) ہمارے پاس آیا، میں آ کر اس کے پاس بیٹھا تو میں نے اسے کہتے ہوئے سنا کہ میرے عہد و قرار میں یہ بات شامل ہے کہ ہم دودھ پلانے والے جانور نہ لیں۔ اور نہ الگ الگ مال کو یکجا کریں، اور نہ یکجا مال کو الگ الگ کریں۔ پھر ان کے پاس ایک آدمی اونچی کوہان کی ایک اونٹنی لے کر آیا، اور کہنے لگا: اسے لے لو، تو اس نے انکار کیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": 2458,
			"text": "وائل بن حجر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو زکاۃ کی وصولی پر بھیجا، وہ ایک شخص کے پاس آیا، اس نے اسے اونٹ کا ایک دبلا بچہ دیا۔ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ہم نے اللہ اور اس کے رسول کی طرف سے محصل زکاۃ ( صدقہ وصول کرنے والے ) کو بھیجا، فلاں شخص نے اسے ایک دبلا کمزور، دودھ چھوڑا ہوا بچہ دیا۔ اے اللہ! تو اس میں اور اس کے اونٹوں میں برکت نہ دے“، یہ بات اس آدمی کو معلوم ہوئی تو وہ ایک اچھی اونٹنی لے کر آیا، اور کہنے لگا: میں اللہ عزوجل سے توبہ کرتا ہوں اور اللہ کے نبی اکرم صلی اللہ علیہ وسلم کے سامنے اپنی اطاعت کا اظہار کرتا ہوں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اے اللہ! تو اس میں اور اس کے اونٹوں میں برکت فرما“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": 2459,
			"text": "عبداللہ بن ابی اوفی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس جب کوئی قوم اپنا صدقہ لے کر آتی تو آپ فرماتے: ”اے اللہ! فلاں کے آل ( اولاد ) پر رحمت بھیج“ ( چنانچہ ) جب میرے والد اپنا صدقہ لے کر آپ کے پاس آئے تو آپ نے فرمایا: ”اے اللہ! آل ابی اوفی پر رحمت بھیج“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "جریر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ دیہات کے لوگ آئے، اور انہوں آپ سے عرض کیا: آپ کے بھیجے ہوئے کچھ محصل زکاۃ ہمارے پاس آتے ہیں جو ہم پر ظلم کرتے ہیں، تو آپ نے فرمایا: ”اپنے زکاۃ وصول کرنے والوں کو راضی و مطمئن کرو“، انہوں نے عرض کیا: اگرچہ وہ ظلم کریں۔ آپ نے فرمایا: ”اپنے زکاۃ وصول کرنے والوں کو راضی کرو“، انہوں نے پھر عرض کیا: اگرچہ وہ ظلم کریں؟ آپ نے فرمایا: ”اپنے زکاۃ وصول کرنے والوں کو راضی کرو“۔ جریر رضی اللہ عنہ کہتے ہیں: جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ بات سنی اسی وقت سے کوئی محصل زکاۃ میرے پاس سے راضی ہوئے بغیر نہیں گیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": 2461,
			"text": "جریر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب صدقہ وصول کرنے والا تمہارے پاس آئے تو وہ اس حال میں لوٹے کہ وہ تم سے راضی ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "مسلم بن ثفنہ کہتے ہیں کہ ابن علقمہ نے میرے والد کو اپنی قوم کی عرافت ( نگرانی ) پر مقرر کیا، اور انہیں اس بات کا حکم بھی دیا کہ وہ ان سے زکاۃ وصول کر کے لائیں۔ تو میرے والد نے مجھے ان کے کچھ لوگوں کے پاس بھیجا کہ میں ان سے زکاۃ لے کر آ جاؤں۔ تو میں ( گھر سے ) نکلا یہاں تک کہ ایک بوڑھے بزرگ کے پاس پہنچا انہیں «سعر» کہا جاتا تھا۔ تو میں نے ان سے کہا کہ میرے والد نے مجھے آپ کے پاس آپ کی بکریوں کی زکاۃ لانے کے لیے بھیجا ہے۔ انہوں نے کہا: بھتیجے! تم کس طرح کی زکاۃ لیتے ہو؟ میں نے کہا: ہم چنتے اور چھانٹتے ہیں یہاں تک کہ ہم بکریوں کے تھنوں کو ناپتے و ٹٹولتے ہیں ( یعنی عمدہ مال ڈھونڈ کر لیتے ہیں ) ۔ انہوں نے کہا: بھتیجے! میں تمہیں ایک حدیث سناتا ہوں۔ میں رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں انہیں گھاٹیوں میں سے کسی ایک گھاٹی میں اپنی بکریوں کے ساتھ تھا، میرے پاس ایک اونٹ پر سوار دو شخص آئے، اور انہوں نے کہا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے فرستادہ ہیں۔ ہم آپ کے پاس آئے ہیں کہ آپ ہمیں اپنی بکریوں کی زکاۃ ادا کریں۔ میں نے پوچھا: میرے اوپر ان بکریوں میں کتنی زکاۃ ہے؟ تو ان دونوں نے کہا: ایک بکری، میں نے دودھ اور چربی سے بھری ایک ایک موٹی تازی بکری کا قصد کیا جس کی جگہ مجھے معلوم تھی۔ میں اسے ( ریوڑ میں سے ) نکال کر ان کے پاس لایا تو انہوں نے کہا: «شافع» ہے ( «شافع» گابھن بکری کو کہتے ہیں ) اور رسول اللہ صلی اللہ علیہ وسلم نے ہمیں گابھن جانور لینے سے روکا ہے۔ پھر میں نے ایک اور بکری لا کر پیش کرنے کا ارادہ کیا جو اس سے کمتر تھی جس نے ابھی کوئی بچہ نہیں جنا تھا لیکن حمل کے قابل ہو گئی تھی۔ میں نے اسے ( گلّے سے ) نکال کر ان دونوں کو پیش کیا، انہوں نے کہا: ہاں یہ ہمیں قبول ہے۔ پھر ہم نے اسے اٹھا کر انہیں پکڑا دیا۔ انہوں نے اسے اپنے ساتھ اونٹ پر لاد لیا، پھر لے کر چلے گئے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": 2463,
			"text": "مسلم بن ثفنہ کا بیان ہے کہ ابن علقمہ نے ان کے والد کو اپنی قوم سے زکاۃ وصول کرنے کے کام پر لگایا، اور پوری حدیث بیان کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": 2464,
			"text": "ابوہریرہ رضی الله عنہ بیان کرتے ہیں کہ عمر رضی اللہ عنہ نے فرمایا کہ رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ کا حکم کیا۔ تو آپ سے کہا گیا: ابن جمیل، خالد بن ولید، اور عباس بن عبدالمطلب ( رضی اللہ عنہم ) نے ( زکاۃ ) نہیں دی ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ابن جمیل زکاۃ کا انکار اس وجہ سے کرتا ہے کہ وہ محتاج تھا تو اللہ تعالیٰ نے اسے مالدار بنا دیا۔ اور رہے خالد بن ولید تو تم لوگ خالد پر زیادتی کر رہے ہو، انہوں نے اپنی زرہیں اور اسباب اللہ کی راہ میں وقف کر دی ہیں، اور رہے رسول اللہ صلی اللہ علیہ وسلم کے چچا عباس بن عبدالمطلب، تو یہ زکاۃ تو ان پر ہے ہی۔ مزید اتنا اور بھی دیں گے“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": 2465,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ کا حکم دیا، آگے کی اوپر والی روایت کے مثل مروی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": 2466,
			"text": "عبداللہ بن ہلال ثقفی رحمہ اللہ کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور اس نے عرض کیا: ( لوگ اتنے جھگڑالو اور نادہند ہو گئے ہیں کہ ) قریب ہے کہ میں آپ کے بعد زکاۃ کی بکری کے ایک بچے یا ایک بکری کے لیے قتل کر دیا جاؤں گا، تو آپ نے فرمایا: ”اگر وہ فقراء مہاجرین کو نہ دی جاتی ہوتی تو اسے میں نہ لیتا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": 2467,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان پر اس کے غلام اور گھوڑے میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان پر اس کے غلام اور گھوڑے میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": 2469,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان پر اس کے غلام میں اور اس کے گھوڑے میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": 2470,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”آدمی پر اس کے گھوڑے اور اس کے غلام میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": 2471,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان پر اس کے غلام اور اس کے گھوڑے میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": 2472,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”مسلمان پر اس کے غلام میں زکاۃ نہیں ہے اور نہ ہی اس کے گھوڑے میں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": 2473,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے، اور پانچ اونٹ سے کم میں زکاۃ نہیں ہے۔ اور پانچ وسق غلے سے کم میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": 2474,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ وسق سے کم کھجور میں زکاۃ نہیں ہے، اور پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے، اور پانچ اونٹ سے کم میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": 2475,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”پانچ وسق سے کم کھجور میں زکاۃ نہیں ہے، اور پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے۔ اور نہ پانچ اونٹ سے کم میں زکاۃ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": 2476,
			"text": "ابوسعید خدری رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے، اور پانچ اونٹ سے کم میں زکاۃ نہیں ہے، اور پانچ وسق سے کم غلے میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے گھوڑے اور غلام کی زکاۃ معاف کر دی ہے، تو تم اپنے مالوں کی زکاۃ ہر دو سو میں سے پانچ یعنی چالیسواں حصہ دو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": 2478,
			"text": "علی رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے گھوڑے اور غلام کی زکاۃ معاف کر دی ہے، اور دو سو درہم سے کم میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": 2479,
			"text": "عبداللہ بن عمرو بن العاص رضی الله عنہما سے روایت ہے کہ یمن کی رہنے والی ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی، اس کے ساتھ اس کی ایک بیٹی تھی جس کے ہاتھ میں سونے کے دو موٹے موٹے کنگن تھے۔ آپ نے فرمایا: ”کیا تم اس کی زکاۃ دیتی ہو؟“ اس نے کہا: نہیں، آپ نے فرمایا: ”کیا تجھے اچھا لگے گا کہ اللہ عزوجل ان کے بدلے قیامت کے دن تمہیں آگ کے دو کنگن پہنائے؟“ یہ سن کر اس عورت نے دونوں کنگن ( بچی کے ہاتھ سے ) نکال لیے۔ اور انہیں رسول اللہ صلی اللہ علیہ وسلم کے آگے ڈال دیا، اور کہا: یہ اللہ اور اس کے رسول کے لیے ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": 2480,
			"text": "عمرو بن شعیب کہتے ہیں کہ ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی اور اس کے ساتھ اس کی ایک بچی تھی اور اس کی بچی کے ہاتھ میں دو کنگن تھے، آگے اسی طرح کی روایت ہے جیسے اوپر گزری ہے۔ اور یہ روایت مرسل ہے۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: خالد معتمر سے زیادہ ثقہ راوی ہیں ( اس لیے ان کی متصل روایت معتمر کی مرسل سے زیادہ صحیح ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": 2481,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اپنے مال کی زکاۃ نہیں دیتا ہے، اسے قیامت کے دن اس کا مال ایسے خوفناک سانپ کی صورت میں نظر آئے گا جو گنجا ہو گا، اس کی آنکھوں پر دو سیاہ نقطے ہوں گے، وہ اس سے چمٹ جائے گا، یا اس کے گلے کا ہار بن جائے گا، اور کہے گا: میں تیرا خزانہ ہوں، میں تیرا خزانہ ہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": 2482,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس شخص کو اللہ تعالیٰ مال دے اور وہ اس مال کی زکاۃ ادا نہ کرے، تو قیامت کے دن اس کا مال گنجا سانپ بن جائے گا، اس کی آنکھ کے اوپر دو سیاہ نقطے ہوں گے، وہ قیامت کے دن اس کے دونوں کلّے پکڑے گا، اور اس سے کہے گا: میں تیرا مال ہوں، میں تیرا خزانہ ہوں“۔ پھر آپ نے آیت کریمہ کی تلاوت کی: «ولا يحسبن الذين يبخلون بما آتاهم اللہ من فضله» ”اللہ تعالیٰ نے جنہیں مال دیا ہے وہ بخیلی کر کے یہ نہ سمجھیں کہ یہ ان کے لیے بہتر ہے بلکہ وہی مال قیامت کے دن ان کے گلے کا طوق ہو گا“ ( آل عمران: ۱۸۰ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2483,
			"arabicnumber": 2483,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ وسق سے کم غلے یا کھجور میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": 2484,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”گیہوں اور کھجور میں زکاۃ نہیں یہاں تک کہ وہ پانچ وسق کو پہنچ جائے، اسی طرح چاندی میں زکاۃ نہیں یہاں تک کہ وہ پانچ اوقیہ کو پہنچ جائے۔ اور اونٹ میں زکاۃ نہیں ہے یہاں تک کہ وہ پانچ کی تعداد کو پہنچ جائیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": 2485,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”غلہ میں زکاۃ نہیں ہے اور نہ کھجور میں یہاں تک کہ یہ پانچ وسق ہو جائیں، اور نہ پانچ اونٹ سے کم میں زکاۃ ہے، اور نہ پانچ اوقیہ سے کم چاندی میں زکاۃ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": 2486,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”پانچ اوقیہ سے کم چاندی میں زکاۃ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": 2487,
			"text": "ابو سعید خدری رضی الله عنہ روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”پانچ اوقیہ سے کم ( چاندی ) میں زکاۃ نہیں، اور نہ پانچ اونٹ سے کم میں زکاۃ ہے، اور نہ پانچ وسق سے کم غلہ میں زکاۃ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": 2488,
			"text": "عبداللہ بن عمر رضی الله عنہ روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جسے نہر اور چشمے سینچیں یا جس زمین میں تری رہتی ہو ۱؎ اس میں دسواں حصہ زکاۃ ہے۔ اور جو اونٹوں سے سینچا جائے یا ڈول سے اس میں بیسواں حصہ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": 2489,
			"text": "جابر بن عبداللہ رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو پیداوار آسمان کی بارش اور نہروں کے پانی سے ہو اس میں دسواں حصہ زکاۃ ہے، اور جو پیداوار جانوروں کے ذریعہ سینچائی کر کے ہو اس میں بیسواں حصہ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": 2490,
			"text": "معاذ بن جبل رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے یمن بھیجا تو مجھے حکم دیا کہ جسے آسمان کے پانی نے سینچا ہو اس میں دسواں حصہ زکاۃ لوں، اور جو پیداوار ڈولوں کے پانی سے ( سینچائی کر کے ) ہو اس میں بیسواں حصہ زکاۃ لوں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": 2491,
			"text": "سہل بن ابی حثمہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب تم درختوں پر پھلوں کا تخمینہ لگاؤ تو جو تخمینہ لگاؤ اسے لو، اور اس میں سے ایک تہائی چھوڑ دو ۱؎ اور اگر تم نہ لے سکو یا تہائی نہ چھوڑ سکو ( شعبہ کو شک ہو گیا ہے ) تو تم چوتھائی چھوڑ دو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": 2492,
			"text": "ابن شہاب زہری کہتے ہیں کہ ابوامامہ بن سہیل بن حنیف رضی اللہ عنہ نے اللہ عز و جل کے فرمان: «ولا تيمموا الخبيث منه تنفقون» ”اللہ کی راہ میں برا مال خرچ کرنے کا قصد نہ کرو“ ( البقرہ: ۲۶۷ ) کے متعلق مجھ سے بیان کیا کہ «خبيث» سے مراد «جعرور» اور «لون حبیق» ہیں، رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ میں خراب مال لینے سے منع فرما دیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": 2493,
			"text": "عوف بن مالک رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نکلے اور آپ کے ہاتھ میں ایک چھڑی تھی ( مسجد میں پہنچے ) وہاں ایک شخص نے سوکھی خراب کھجور کا ایک گچھا لٹکا رکھا تھا ۱؎ آپ اس گچھے میں ( لاٹھی سے ) کوچتے جاتے تھے، اور فرماتے جاتے تھے: ”یہ صدقہ دینے والا اگر چاہتا تو اس سے اچھی کھجوریں دے سکتا تھا، یہ صدقہ دینے والا قیامت میں اسی طرح کی سوکھی خراب کھجوریں کھائے گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "عبداللہ بن عمرو بن العاص رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے راستہ میں پڑی ہوئی چیز کے بارے میں سوال کیا گیا تو آپ نے فرمایا: ”جو چیز چالو راستے میں ملے یا آباد بستی میں، تو سال بھر اسے پہنچواتے رہو، اگر اس کا مالک آ جائے ( اور پہچان بتائے ) تو اسے دے دو، ورنہ وہ تمہاری ہے، اور جو کسی چالو راستے یا کسی آباد بستی کے علاوہ میں ملے تو اس میں اور جاہلیت کے دفینوں میں پانچواں حصہ ہے“ ( یعنی: زکاۃ نکال کر خود استعمال کر لے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جانور کا زخمی کرنا رائیگاں ہے، کنوئیں میں گر کر کوئی مر جائے تو وہ بھی رائیگاں ہے، کان میں کوئی دب کر مر جائے تو وہ بھی رائیگاں ہے ۱؎ اور جاہلیت کے دفینے میں پانچواں حصہ ہے“ ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": 2496,
			"text": "اس سند سے بھی ابوہریرہ رضی اللہ عنہ کے واسطے سے رسول اللہ صلی اللہ علیہ وسلم سے اسی کے مثل مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2497,
			"arabicnumber": 2497,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جانور کا زخمی کرنا رائیگاں ہے، کنویں میں گر کر مر جانا رائیگاں ہے، اور کان میں دب کر مر جانا رائیگاں ہے، اور جاہلیت کے دفینہ میں پانچواں حصہ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": 2498,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کنویں میں گر کر مر جانا لغو و رائیگاں ہے۔ جانور کا زخمی کرنا رائیگاں ہے۔ کان میں دب کر مر جانا رائیگاں ہے، اور جاہلیت کے دفینوں میں پانچواں حصہ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": 2499,
			"text": "عبداللہ بن عمرو بن العاص رضی الله عنہما کہتے ہیں کہ ہلال رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس اپنے شہد کا دسواں حصہ لے کر آئے، اور آپ سے درخواست کی کہ آپ اس وادی کو جسے سلبہ کہا جاتا ہے ان کے لیے خاص کر دیں ( اس پر کسی اور کا دعویٰ نہ رہے ) تو رسول اللہ صلی اللہ علیہ وسلم نے یہ مذکورہ وادی ان کے لیے مخصوص فرما دی۔ پھر جب عمر بن خطاب رضی اللہ عنہ خلیفہ ہوئے تو سفیان بن وھب نے عمر بن خطاب رضی اللہ عنہ کو لکھا، وہ ان سے پوچھ رہے تھے ( کہ یہ وادی ہلال رضی اللہ عنہ کے پاس رہنے دی جائے یا نہیں ) تو عمر رضی اللہ عنہ نے جواب لکھا: اگر وہ اپنے شہد کا دسواں حصہ جو وہ رسول اللہ صلی اللہ علیہ وسلم کو دیتے تھے ہمیں دیتے ہیں تو ”سلبہ“ کو انہیں کے پاس رہنے دیں، ورنہ وہ برسات کی مکھیاں ہیں ( پھول و پودوں کا رس چوس کر شہد بناتی ہیں ) جو چاہے اسے کھائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": 2500,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے آزاد، غلام، مرد اور عورت ہر ایک پر رمضان کی زکاۃ ( صدقہ فطر ) ایک صاع کھجور یا ایک صاع جَو فرض کی ہے، پھر اس کے برابر لوگوں نے نصف صاع گیہوں کو قرار دے لیا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر ہر مرد و عورت، آزاد اور غلام پر ایک صاع کھجور یا ایک صاع جَو فرض کیا ہے، پھر لوگوں نے آدھا صاع گیہوں کو اس کے برابر ٹھہرا لیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر ہر چھوٹے، بڑے، آزاد اور غلام اور مرد اور عورت پر ایک صاع کھجور یا ایک صاع جَو مقرر کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے رمضان کا صدقہ فطر مسلمان لوگوں پر ہر آزاد، غلام مرد اور عورت پر ایک صاع کھجور، یا ایک صاع جو فرض ٹھہرایا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ فطر مسلمانوں میں سے ہر آزاد، غلام مرد، عورت چھوٹے اور بڑے پر ایک صاع کھجور یا ایک صاع جو فرض کیا ہے، اور حکم دیا ہے کہ اسے لوگوں کے ( عید کی ) نماز کے لیے ( گھر سے ) نکلنے سے پہلے ادا کر دیا جائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2505,
			"arabicnumber": 2505,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر ایک صاع کھجور یا ایک صاع جو، ہر چھوٹے، بڑے، مرد، عورت، آزاد اور غلام پر فرض کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"text": "قیس بن سعد بن عبادہ رضی الله عنہما کہتے ہیں کہ ہم عاشورہ کا روزہ رکھتے تھے، اور عید الفطر کا صدقہ ادا کرتے تھے، پھر جب رمضان کے روزے فرض ہوئے، اور زکاۃ کی ( فرضیت ) اتری، تو نہ ہمیں ان کا حکم دیا گیا نہ ہی ان کے کرنے سے روکا گیا، اور ہم ( جیسے کرتے تھے ) اسے کرتے رہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "قیس بن سعد رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں زکاۃ کی فرضیت اترنے سے پہلے صدقہ فطر کا حکم دیا تھا، پھر جب زکاۃ کی فرضیت اتری تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں نہ کرنے کا حکم دیا اور نہ ہی روکا، اور ہم اسے کرتے رہے۔ ابوعبدالرحمٰن کہتے ہیں: ابوعمار کا نام عریب بن حمید ہے۔ اور عمرو بن شرحبیل کی کنیت ابومیسرہ ہے، اور سلمہ بن کہیل نے اپنی سند میں حکم کی مخالفت کی ہے اور حکم سلمہ بن کہیل سے زیادہ ثقہ راوی ہیں ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2508,
			"arabicnumber": 2508,
			"text": "حسن بصری کہتے ہیں کہ ابن عباس رضی اللہ عنہما نے رمضان کے مہینے کے آخر میں کہا ( جب وہ بصرہ کے امیر تھے ) : تم اپنے روزوں کی زکاۃ نکالو، تو لوگ ایک دوسرے کو تکنے لگے تو انہوں نے پوچھا: مدینہ والوں میں سے یہاں کون کون ہے ( جو بھی ہو ) اٹھ جاؤ، اور اپنے بھائیوں کو بتاؤ، کیونکہ یہ لوگ نہیں جانتے کہ اس زکاۃ کو رسول اللہ صلی اللہ علیہ وسلم نے ہر مرد، عورت، آزاد اور غلام پر ایک صاع جو یا کھجور، یا آدھا صاع گی ہوں فرض کیا ہے، تو لوگ اٹھے ( اور انہوں نے لوگوں کو بتایا ) ۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: ہشام نے حمید کی مخالفت کی ہے، انہوں نے «عن محمد بن سيرين» کہا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2509,
			"arabicnumber": 2509,
			"text": "ابن سیرین کہتے ہیں کہ ابن عباس رضی اللہ عنہما نے صدقہ فطر کا ذکر کیا۔ تو کہا: گیہوں سے ایک صاع، یا کھجور سے ایک صاع، یا جو سے ایک صاع، یا سلت ( جَو کی ایک قسم ہے ) سے ایک صاع ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2510,
			"arabicnumber": 2510,
			"text": "ابورجاء کہتے ہیں کہ میں نے ابن عباس رضی اللہ عنہما کو تمہارے منبر سے یعنی بصرہ کے منبر سے خطبہ دیتے ہوئے سنا، وہ کہہ رہے تھے: صدقہ فطر گی ہوں سے ایک صاع ہے۔ ابوعبدالرحمٰن ( نسائی ) کہتے ہیں: یہ یعنی ایوب تینوں میں زیادہ ثقہ ہیں ( یعنی: حسن بصری اور ابن سیرین سے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2511,
			"arabicnumber": 2511,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر جَو یا کھجور یا پنیر سے ایک صاع فرض کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2512,
			"arabicnumber": 2512,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب ہمارے درمیان موجود تھے تو ہم صدقہ فطر گی ہوں سے ایک صاع، یا جو سے، یا کھجور سے، یا کشمش سے، یا پنیر سے ایک صاع نکالتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2513,
			"arabicnumber": 2513,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب ہم میں تھے تو ہم صدقہ فطر گی ہوں سے، کھجور سے، یا جو سے، یا پنیر سے ایک صاع نکالتے تھے، اور ہم برابر اسی طرح نکالتے رہے۔ یہاں تک کہ معاویہ رضی اللہ عنہ شام سے آئے، اور انہوں نے جو باتیں لوگوں کو بتائیں ان میں ایک بات یہ بھی تھی کہ شامی گی ہوں کے دو مد ( مدینہ کے ) ایک صاع کے برابر ہیں، تو لوگوں نے اسی کو اختیار کر لیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2514,
			"arabicnumber": 2514,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں صدقہ فطر کھجور سے، یا جو سے، یا کشمش سے، یا آٹا یا پنیر سے، یا بے چھلکے والی جو سے ایک صاع ہی نکالا ہے۔ سفیان کو شک ہوا تو انہوں نے «من دقیق أوسلت» شک کے ساتھ روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2515,
			"arabicnumber": 2515,
			"text": "حسن (حسن بصریٰ) سے روایت ہے کہ ابن عباس رضی اللہ عنہما نے بصرہ میں خطبہ دیا، تو انہوں نے کہا: تم لوگ اپنے روزوں کی زکاۃ دو ( یعنی صدقہ فطر نکالو ) تو لوگ ایک دوسرے کو تکنے لگے۔ تو انہوں نے کہا: یہاں اہل مدینہ میں سے کون کون ہیں؟ تم لوگ اٹھو، اور اپنے بھائیوں کے پاس جاؤ، انہیں بتاؤ، کیونکہ وہ لوگ نہیں جانتے کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر چھوٹے، بڑے، آزاد اور غلام، مذکر اور مونث پر آدھا صاع گی ہوں، یا ایک صاع کھجور، یا جو فرض کیا ہے۔ حسن کہتے ہیں: علی رضی اللہ عنہ نے کہا: رہی بات جب اللہ نے تمہیں وسعت و فراخی دے رکھی ہو تو تم بھی وسعت و فراخی کا مظاہرہ کرو۔ گیہوں وغیرہ ( نصف صاع کے بجائے ) ایک صاع دو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2516,
			"arabicnumber": 2516,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کے زمانہ میں لوگ صدقہ فطر ایک صاع جَو یا کھجور یا سُلت ( بے چھلکے کا جو ) یا کشمش نکالتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2517,
			"arabicnumber": 2517,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں صدقہ فطر ایک صاع جَو یا کھجور یا انگور یا پنیر نکالتے تھے۔ اور ہم برابر ایسا ہی کرتے چلے آ رہے تھے یہاں تک کہ معاویہ رضی اللہ عنہ کا زمانہ آیا۔ تو انہوں نے کہا: میں سمجھتا ہوں کہ شامی گیہوں کے دو مد ( یعنی نصف صاع ) جو کے ایک صاع کے برابر ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2518,
			"arabicnumber": 2518,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ( صدقہ فطر ) کھجور یا جو یا پنیر سے ایک صاع نکالتے تھے۔ اس کے علاوہ کچھ نہ نکالتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2519,
			"arabicnumber": 2519,
			"text": "سائب بن یزید رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ایک صاع تمہارے آج کے مد سے ایک مد اور ایک تہائی مد اور کچھ زائد کا تھا۔ اور ابوعبدالرحمٰن فرماتے ہیں: اس حدیث کو مجھ سے زیاد بن ایوب نے بیان کیا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2520,
			"arabicnumber": 2520,
			"text": "",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2521,
			"arabicnumber": 2521,
			"text": "عبداللہ بن عمر رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ صدقہ فطر نماز کے لیے لوگوں کے نکلنے سے پہلے ادا کر دیا جائے ( ابن بزیع کی روایت میں «بصدقة الفطر» کے بجائے «بزكاة الفطر» ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2522,
			"arabicnumber": 2522,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے معاذ بن جبل رضی اللہ عنہ کو یمن بھیجا تو فرمایا: ”تم ایک ایسی قوم کے پاس جا رہے ہو جو اہل کتاب ہیں، تم انہیں اس بات کی گواہی کی دعوت دو کہ اللہ کے علاوہ کوئی حقیقی معبود نہیں، اور میں اللہ کا رسول ہوں۔ اگر وہ تمہاری یہ بات مان لیں تو انہیں بتاؤ کہ اللہ عزوجل نے ان پر ہر دن اور رات میں پانچ ( وقت کی ) نمازیں فرض کی ہیں، اگر وہ تمہاری یہ بات ( بھی ) مان لیں تو انہیں بتاؤ کہ اللہ عزوجل نے ان کے مالوں میں زکاۃ فرض کی ہے جو ان کے مالداروں سے لی جائے گی، اور ان کے محتاجوں میں تقسیم کر دی جائے گی، اگر وہ تمہاری یہ بات ( بھی ) مان لیں تو ان کے اچھے و عمدہ مال لینے سے بچو، اور مظلوم کی بد دعا سے بچو کیونکہ اس کے اور اللہ کے درمیان کوئی حجاب نہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2523,
			"arabicnumber": 2523,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک شخص نے کہا: میں ضرور صدقہ دوں گا، تو وہ اپنا صدقہ لے کر نکلا اور اس نے اسے ایک چور کے ہاتھ میں رکھ دیا، صبح کو لوگ باتیں کرنے لگے کہ ایک چور کو صدقہ دیا گیا ہے، اس نے کہا: اللہ تیرا شکر ہے چور کے ہاتھ میں چلے جانے پر بھی ۱؎، میں اور بھی صدقہ دوں گا چنانچہ ( دوسرے دن بھی ) وہ اپنا صدقہ لے کر نکلا اور اس نے اسے لے جا کر ایک زانیہ عورت کے ہاتھ پر رکھ دیا۔ صبح کو لوگ باتیں کرنے لگے کہ آج رات ایک زانیہ کو صدقہ دیا گیا ہے۔ تو اس نے پھر کہا: اللہ تیرا شکر ہے زانیہ کے ہاتھ میں چلے جانے پر بھی، میں پھر صدقہ دوں گا، چنانچہ ( تیسرے دن ) پھر وہ صدقہ کا مال لے کر نکلا، اور ایک مالدار شخص کو تھما آیا، پھر صبح کو لوگ باتیں کرنے لگے کہ ایک مالدار شخص کو صدقہ کیا گیا ہے، اس نے کہا: اللہ تیرا شکر ہے، زانیہ، چور اور مالدار کو دے دینے پر بھی۔ تو خواب میں اس کے پاس آ کر کہا گیا: رہا تیرا صدقہ تو وہ قبول کر لیا گیا ہے، رہی زانیہ تو ( صدقہ پا کر ) شاید وہ زناکاری سے باز آ جائے اور رہا چور تو صدقہ پا کر شاید وہ اپنی چوری سے باز آ جائے، اور رہا مالدار آدمی ( تو صدقہ پا کر ) شاید وہ اس سے سبق سیکھے اور اللہ عزوجل نے اسے جو دولت دے رکھی ہے اس میں سے خرچ کرنے لگے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2524,
			"arabicnumber": 2524,
			"text": "ابوالملیح کے والد اسامہ بن عمیر رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”اللہ عزوجل بغیر پاکی کے کوئی نماز قبول نہیں کرتا، اور نہ ہی حرام مال سے کوئی صدقہ قبول کرتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2525,
			"arabicnumber": 2525,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص بھی اپنے پاکیزہ مال سے صدقہ دیتا ہے ( اور اللہ پاکیزہ مال ہی قبول کرتا ہے ) تو رحمن عزوجل اسے اپنے داہنے ہاتھ میں لیتا ہے گو وہ ایک کھجور ہی کیوں نہ ہو، پھر وہ رحمن کے ہاتھ میں بڑھتا رہتا ہے یہاں تک کہ وہ بڑھتے بڑھتے پہاڑ سے بھی بڑا ہو جاتا ہے، جیسے کہ تم میں سے کوئی اپنے گھوڑے کے بچھڑے یا اونٹنی کے چھوٹے بچے کو پالتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2526,
			"arabicnumber": 2526,
			"text": "عبداللہ بن حبشی خثعمی رضی الله عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم سے پوچھا گیا: کون سے کام افضل ہیں؟ آپ نے فرمایا: ”ایسا ایمان جس میں شبہ نہ ہو، جہاد جس میں خیانت نہ ہو، اور حج مبرور“، پوچھا گیا: کون سی نماز افضل ہے؟ آپ نے فرمایا: ”لمبے قیام والی نماز“، پوچھا گیا: کون سا صدقہ افضل ہے؟ آپ نے فرمایا: ”وہ صدقہ جو کم مال والا اپنی محنت کی کمائی سے دے“، پوچھا گیا: کون سی ہجرت افضل ہے؟ آپ نے فرمایا: ”ایسی ہجرت جو اللہ کی حرام کی ہوئی چیزوں کو چھوڑ دے“، پوچھا گیا: کون سا جہاد افضل ہے، آپ نے فرمایا: ”اس شخص کا جہاد جو مشرکین سے اپنی جان و مال کے ساتھ جہاد کرے“، پوچھا گیا: کون سا قتل افضل ہے؟ آپ نے فرمایا: ”جس میں آدمی کا خون بہا دیا گیا ہو، اور اس کا گھوڑا ہلاک کر دیا گیا ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2527,
			"arabicnumber": 2527,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک درہم ایک لاکھ درہم سے بڑھ گیا“، لوگوں نے ( حیرت سے ) پوچھا: یہ کیسے؟ آپ نے فرمایا: ”ایک شخص کے پاس دو درہم تھے، ان دو میں سے اس نے ایک صدقہ کر دیا، اور دوسرا شخص اپنی دولت ( کے انبار کے ) ایک گوشے کی طرف گیا اور اس ( ڈھیر ) میں سے ایک لاکھ درہم لیا، اور اسے صدقہ کر دیا“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": 2528,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک درہم ایک لاکھ درہم سے آگے نکل گیا“، لوگوں نے عرض کیا: اللہ کے رسول! یہ کیسے؟ آپ نے فرمایا: ”ایک شخص کے پاس دو درہم ہیں، اس نے ان دونوں میں سے ایک لیا اور اسے صدقہ کر دیا۔ دوسرا وہ آدمی ہے جس کے پاس بہت زیادہ مال ہے، اس نے اپنے مال ( خزانے ) کے ایک کنارے سے ایک لاکھ درہم نکالے، اور انہیں صدقہ میں دیدے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2529,
			"arabicnumber": 2529,
			"text": "ابومسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ہمیں صدقہ کرنے کا حکم فرماتے تھے، اور ہم میں بعض ایسے ہوتے تھے جن کے پاس صدقہ کرنے کے لیے کچھ نہ ہوتا تھا، یہاں تک کہ وہ بازار جاتا اور اپنی پیٹھ پر بوجھ ڈھوتا، اور ایک مد لے کر آتا اور اسے رسول اللہ صلی اللہ علیہ وسلم کو دے دیتا۔ میں آج ایک ایسے شخص کو جانتا ہوں جس کے پاس ایک لاکھ درہم ہے، اور اس وقت اس کے پاس ایک درہم بھی نہ تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2530,
			"arabicnumber": 2530,
			"text": "ابومسعود رضی الله عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم نے ہمیں صدقہ کا حکم دیا تو ابوعقیل رضی اللہ عنہ نے آدھا صاع صدقہ دیا، اور ایک اور شخص اس سے زیادہ لے کر آیا، تو منافقین اس ( پہلے شخص ) کے صدقہ کے بارے میں کہنے لگے کہ اللہ تعالیٰ ایسے صدقے سے بے نیاز ہے، اور اس دوسرے نے محض دکھاوے کے لیے دیا ہے، تو ( اس موقع پر ) آیت کریمہ: «الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏» ”جو لوگ دل کھول کر خیرات کرنے والے مومنین پر اور ان لوگوں پر جو صرف اپنی محنت و مزدوری سے حاصل کر کے صدقہ دیتے ہیں طعن زنی کرتے ہیں“ ( التوبہ: ۷۹ ) نازل ہوئی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2531,
			"arabicnumber": 2531,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے مانگا تو آپ نے مجھے دیا، پھر مانگا پھر آپ نے دیا، پھر مانگا، تو فرمایا: ”یہ مال سرسبز و شیریں چیز ہے، جو شخص اسے فیاضی نفس کے ساتھ لے گا تو اس میں برکت دی جائے گی، اور جو شخص اسے حرص و طمع کے ساتھ لے گا تو اسے اس میں برکت نہ ملے گی، اور اس شخص کی طرح ہو گا جو کھاتا ہے مگر آسودہ نہیں ہوتا ( یعنی مانگنے والے کا پیٹ نہیں بھرتا ) ۔ اوپر والا ہاتھ، نیچے والے ہاتھ سے بہتر ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2532,
			"arabicnumber": 2532,
			"text": "طارق محاربی رضی الله عنہ کہتے ہیں کہ ہم مدینہ آئے تو کیا دیکھتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم منبر پر کھڑے خطبہ دے رہے ہیں آپ فرما رہے ہیں: دینے والے کا ہاتھ اوپر والا ہے، اور پہلے انہیں دو جن کی کفالت و نگہداشت کی ذمہ داری تم پر ہو: پہلے اپنی ماں کو، پھر اپنے باپ کو، پھر اپنی بہن کو، پھر اپنے بھائی کو، پھر اپنے قریبی کو، پھر اس کے بعد کے قریبی کو۔ یہ حدیث ایک لمبی حدیث کا اختصار ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2533,
			"arabicnumber": 2533,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ( اس وقت آپ صدقہ و خیرات اور مانگنے سے بچنے کا ذکر کر رہے تھے ) : اوپر والا ہاتھ بہتر ہے نیچے والے ہاتھ سے، اور اوپر والا ہاتھ خرچ کرنے والا ہاتھ ہے، اور نیچے والا ہاتھ مانگنے والا ہاتھ ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": 2534,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بہتر صدقہ وہ ہے جو مالداری کی برقراری اور دل کی بے نیازی کے ساتھ ہو، اور اوپر والا ہاتھ بہتر ہے نیچے والے ہاتھ سے۔ اور پہلے صدقہ انہیں دو جن کی کفالت و نگرانی تمہارے ذمہ ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": 2535,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ دو“، ایک آدمی نے عرض کیا: اللہ کے رسول! میرے پاس ایک دینار ہے، آپ نے فرمایا: ”اسے اپنی ذات پر صدقہ کرو“ ۱؎ اس نے کہا: میرے پاس ایک اور ہے۔ آپ نے فرمایا: ”اپنی بیوی پر صدقہ کرو“، اس نے کہا: میرے پاس ایک اور ہے۔ آپ نے فرمایا: ”اسے اپنے بیٹے پر صدقہ کرو“، اس نے کہا: میرے پاس ایک اور بھی ہے۔ آپ نے فرمایا: ”اپنے خادم پر صدقہ کر دو“، اس نے کہا: میرے پاس ایک اور ہے۔ آپ نے فرمایا: آپ بہتر سمجھنے والے ہیں ( جیسی ضرورت سمجھو ویسا کرو“ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": 2536,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ ایک شخص جمعہ کے دن مسجد میں داخل ہوا، رسول اللہ صلی اللہ علیہ وسلم جمعہ کا خطبہ دے رہے تھے، تو آپ نے فرمایا: ”تم دو رکعتیں پڑھو“، پھر وہ شخص دوسرے جمعہ کو بھی آیا اور نبی اکرم صلی اللہ علیہ وسلم خطبہ دے رہے تھے، تو آپ نے فرمایا: ”تم دو رکعتیں پڑھو“، پھر وہ تیسرے جمعہ کو ( بھی ) آیا، آپ نے فرمایا: ”دو رکعتیں پڑھو“، پھر آپ نے لوگوں سے فرمایا: ”صدقہ دو“، تو لوگوں نے صدقہ دیا، تو آپ نے اس شخص کو دو کپڑے دئیے، پھر آپ نے پھر فرمایا: ”لوگو صدقہ دو“، تو اس شخص نے اپنے ان دونوں کپڑوں میں سے ایک کو آپ کے سامنے ڈال دیا، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کیا تم لوگوں نے اس شخص کو نہیں دیکھا؟ یہ خستہ حالت میں مسجد میں آیا، میں نے امید کی کہ تم لوگ اسے دیکھ کر اس کی خستہ حالی کو تاڑ لو گے اور اسے صدقہ دو گے، لیکن تم لوگوں نے ایسا نہیں کیا، تو مجھ ہی کو کہنا پڑا کہ تم صدقہ دو، تو تم لوگوں نے صدقہ دیا تو میں نے اسے دو کپڑے دئیے، پھر لوگوں سے کہا: ”صدقہ دو“، تو اس نے ان کپڑوں میں سے ( جو ہم نے اسے دیے تھے ) ایک ( ہمارے آگے ) ڈال دیا، ( ارے بیوقوف ) تم اپنا کپڑا لے لو، آپ نے اسے ڈانٹا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": 2537,
			"text": "عمیر مولی آبی اللحم کہتے ہیں کہ میرے مالک نے مجھے گوشت بھوننے کا حکم دیا، اتنے میں ایک مسکین آیا، میں نے اس میں سے تھوڑا سا اسے کھلا دیا، میرے مالک کو اس بات کی خبر ہو گئی تو اس نے مجھے مارا، میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ نے اسے بلوایا اور پوچھا: تم نے اسے کیوں مارا ہے؟ اس نے کہا: یہ میرا کھانا ( دوسروں کو ) بغیر اس کے کہ میں اسے حکم دوں کھلا دیتا ہے۔ اور دوسری بار راوی نے کہا: بغیر میرے حکم کے کھلا دیتا ہے، تو آپ نے فرمایا: ”اس کا ثواب تم دونوں ہی کو ملے گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": 2538,
			"text": "ابوموسیٰ اشعری رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ہر مسلمان پر صدقہ ہے“، عرض کیا گیا: اگر کسی کو ایسی چیز نہ ہو جسے صدقہ کر سکے؟ آپ نے فرمایا: ”اپنے ہاتھوں سے کام کرے اور اپنی ذات کو فائدہ پہنچائے، اور صدقہ کرے“، کہا گیا: اگر ایسا بھی نہ کر سکے؟ آپ نے فرمایا: ”محتاج و پریشان حال کی مدد کرے“، کہا گیا: اگر ایسا بھی نہ کر سکے؟ آپ نے فرمایا: ”بھلائی اور نیک باتوں کا حکم کرے“، کہا گیا: اگر یہ بھی نہ کر سکے؟ آپ نے فرمایا: ”برائیوں سے باز رہے“، یہ بھی ایک صدقہ ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2539,
			"arabicnumber": 2539,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب عورت اپنے شوہر کے مال سے صدقہ دے تو اسے ثواب ملے گا، اور اس کے شوہر کو بھی۔ اور خازن کو بھی اتنا ہی ثواب ملے گا، اور ان میں سے کوئی دوسرے کا ثواب کم نہ کرے گا، شوہر کو اس کے کمانے کی وجہ سے ثواب ملے گا، اور بیوی کو اس کے خرچ کرنے کی وجہ سے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": 2540,
			"text": "عبداللہ بن عمرو رضی الله عنہما کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم نے مکہ فتح کر لیا، تو تقریر کے لیے کھڑے ہوئے، آپ نے ( منجملہ اور باتوں کے ) اپنی تقریر میں فرمایا: ”کسی عورت کا اپنے شوہر کی اجازت کے بغیر عطیہ دینا جائز نہیں“، یہ حدیث مختصر ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": 2541,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کی محترم بیویاں ( ازواج مطہرات ) آپ کے پاس اکٹھا ہوئیں، اور پوچھنے لگیں کہ ہم میں کون آپ سے پہلے ملے گی؟ آپ نے فرمایا: ”تم میں سب سے لمبے ہاتھ والی“، ازواج مطہرات ایک بانس کی کھپچی لے کر ایک دوسرے کا ہاتھ ناپنے لگیں، تو وہ ام المؤمنین سودہ رضی اللہ عنہا تھیں جو سب سے پہلے آپ سے ملیں، وہی سب میں لمبے ہاتھ والی تھیں، یہ ان کے بہت زیادہ صدقہ و خیرات کرنے کی وجہ سے تھا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": 2542,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: کون سا صدقہ افضل ہے؟ آپ نے فرمایا: تمہارا اس وقت کا صدقہ دینا افضل ہے جب تم تندرست ہو اور تمہیں دولت کی حرص ہو اور تم عیش و راحت کی آرزو رکھتے ہو اور محتاجی سے ڈرتے ہو۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": 2543,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بہترین صدقہ وہ ہے جو مالداری کی پشت سے ہو ( یعنی مالداری باقی رکھتے ہوئے ہو ) ، اور اوپر والا ہاتھ ( دینے والا ہاتھ ) نیچے والے ہاتھ ( لینے والا ہاتھ ) سے بہتر ہے، اور پہلے صدقہ انہیں دو جن کی تم کفالت کرتے ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": 2544,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ”بہترین صدقہ وہ ہے جو مالداری کی پشت سے ہو ۱؎، اور ان سے شروع کرو جن کی کفالت تمہارے ذمہ ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": 2545,
			"text": "ابومسعود رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جب آدمی اپنی بیوی پر خرچ کرے اور اس سے ثواب کی امید رکھتا ہو تو یہ اس کے لیے صدقہ ہو گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": 2546,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ بنی عذرہ کے ایک شخص نے اپنے غلام کو مدبر کر دیا ۱؎، یہ خبر رسول اللہ صلی اللہ علیہ وسلم کو پہنچی تو آپ نے اس شخص سے پوچھا: ”کیا تمہارے پاس اس غلام کے علاوہ بھی کوئی مال ہے؟“ اس نے کہا: نہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اسے مجھ سے کون خرید رہا ہے؟“ تو نعیم بن عبداللہ عدوی نے اسے آٹھ سو درہم میں خرید لیا، تو رسول اللہ صلی اللہ علیہ وسلم ان درہموں کو لے کر آئے اور انہیں اس کے حوالہ کر دیا، اور فرمایا: ”پہلے خود سے شروع کرو اسے اپنے اوپر صدقہ کرو اگر کچھ بچ رہے تو تمہاری بیوی کے لیے ہے، اور اگر تمہاری بیوی سے بھی بچ رہے تو تمہارے قرابت داروں کے لیے ہے، اور اگر تمہارے قرابت داروں سے بھی بچ رہے تو اس طرح اور اس طرح کرو، اور آپ اپنے سامنے اور اپنے دائیں اور بائیں اشارہ کر رہے تھے“ ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": 2547,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ کرنے والے فیاض اور بخیل کی مثال ان دو آدمیوں کی سی ہے جن پر لوہے کے دو کرتے یا دو ڈھال ان دونوں کی چھاتیوں سے لے کر ان کی ہنسلی کی ہڈیوں تک ہوں، جب فیاض خرچ کرنے کا ارادہ کرتا ہے تو اس کی زرہ اس کے بدن پر کشادہ ہو جاتی ہے، پھیل کر اس کی انگلیوں کے پوروں کو ڈھانپ لیتی ہے، اور اس کے نشان قدم کو مٹا دیتی ہے، اور جب بخیل خرچ کرنے کا ارادہ کرتا ہے تو وہ سکڑ جاتی ہے اور اس کی کڑیاں اپنی جگ ہوں پر چمٹ جاتی ہیں یہاں تک کہ وہ اس کی ہنسلی یا اس کی گردن پکڑ لیتی ہے“۔ ابوہریرہ رضی اللہ عنہ کہتے ہیں: میں گواہی دیتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اسے کشادہ کر رہے تھے، اور وہ کشادہ نہیں ہو رہی تھی۔ طاؤس کہتے ہیں: میں نے ابوہریرہ رضی اللہ عنہ کو کہتے سنا کہ آپ اپنے ہاتھ سے کشادہ کرنے کے لیے اشارہ کر رہے تھے، اور وہ کشادہ نہیں ہو رہی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": 2548,
			"text": "ابوہریرہ رضی الله عنہ روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”بخیل اور صدقہ دینے والے ( سخی ) کی مثال ان دو شخصوں کی ہے جن پر لوہے کی زرہیں ہوں، اور ان کے ہاتھ ان کی ہنسلیوں کے ساتھ چمٹا دیئے گئے ہوں، تو جب جب صدقہ کرنے والا صدقہ کرنے کا ارادہ کرتا ہے تو اس کی زرہ اس کے لیے وسیع و کشادہ ہو جاتی ہے یہاں تک کہ وہ اتنی بڑی ہو جاتی ہے کہ چلتے وقت اس کے پیر کے نشانات کو مٹا دیتی ہے، اور جب بخیل صدقہ کرنے کا ارادہ کرتا ہے تو ہر کڑی دوسرے کے ساتھ پیوست ہو جاتی اور سکڑ جاتی ہے، اور اس کے ہاتھ اس کی ہنسلی سے مل جاتے ہیں“ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: ”وہ ( بخیل ) کوشش کرتا ہے کہ اسے کشادہ کرے لیکن وہ کشادہ نہیں ہوتی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "ابوامامہ بن سہل بن حنیف رضی الله عنہ کہتے ہیں کہ ہم لوگ ایک دن مسجد میں بیٹھے ہوئے تھے ہمارے ساتھ کچھ مہاجرین و انصار بھی تھے، ہم نے ایک شخص کو ام المؤمنین عائشہ رضی اللہ عنہا کے پاس ملاقات کی اجازت حاصل کرنے کے لیے بھیجا، ( انہوں نے اجازت دے دی، ہم ان کے پاس پہنچی تو انہوں نے کہا: ایک بار میرے پاس ایک مانگنے والا آیا اس وقت رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف فرما تھے، میں نے ( خادمہ کو ) اسے کچھ دینے کا حکم دیا، پھر میں نے اسے بلایا اسے دیکھنے لگی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کیا آپ چاہتی ہیں کہ بغیر آپ کے علم میں آئے تمہارے گھر میں کچھ نہ آئے اور تمہارے گھر سے کچھ نہ جائے؟“ میں نے کہا: جی ہاں، آپ نے فرمایا: ”عائشہ! ٹھہر جاؤ، گن کر نہ دو کہ اللہ عزوجل بھی تمہیں بھی گن کر دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": 2550,
			"text": "اسماء بنت ابی بکر رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: ”گن کر نہ دو کہ اللہ عزوجل بھی تمہیں گن کر دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": 2551,
			"text": "اسماء بنت ابی بکر رضی الله عنہا سے روایت ہے کہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس آئیں، اور کہنے لگیں: اللہ کے نبی! میرے پاس تو کچھ ہوتا نہیں ہے سوائے اس کے کہ جو زبیر ( میرے شوہر ) مجھے ( کھانے یا خرچ کرنے کے لیے ) دے دیتے ہیں، تو کیا اس دیے ہوئے میں سے میں کچھ ( فقراء و مساکین کو ) دے دوں تو مجھ پر گناہ ہو گا؟ آپ نے فرمایا: ”تم جو کچھ دے سکو دو، اور روکو نہیں کہ اللہ عزوجل بھی تم سے روک لے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": 2552,
			"text": "عدی بن حاتم رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”آگ سے بچو، اگرچہ کھجور کا ایک ٹکڑا اللہ کی راہ میں دے کر سہی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": 2553,
			"text": "عدی بن حاتم رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے جہنم کا ذکر کیا، اور نفرت سے اپنا منہ پھیر لیا، اور اس سے پناہ مانگی۔ شعبہ نے ذکر کیا کہ آپ نے تین دفعہ ایسا کیا، پھر فرمایا: ”آگ سے بچو اگرچہ کھجور کا ایک ٹکڑا ہی اللہ کی راہ میں دے کر سہی۔ اور اگر اسے نہ پاس کو تو بھلی بات کے ذریعہ معذرت کر کے سہی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"text": "جریر بن عبداللہ رضی الله عنہ کہتے ہیں کہ ہم دن کے ابتدائی حصہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے، کچھ لوگ ننگے بدن، ننگے پیر، تلواریں لٹکائے ہوئے آئے، زیادہ تر لوگ قبیلہ مضر کے تھے، بلکہ سبھی مضر ہی کے تھے۔ ان کی فاقہ مستی دیکھ کر رسول اللہ صلی اللہ علیہ وسلم کے چہرے کا رنگ بدل گیا، آپ اندر گئے، پھر نکلے، تو بلال رضی اللہ عنہ کو حکم دیا، انہوں نے اذان دی، پھر اقامت کہی، آپ نے نماز پڑھائی، پھر آپ نے خطبہ دیا، تو فرمایا: ”لوگو! ڈرو، تم اپنے رب سے جس نے تم کو ایک جان سے پیدا کیا، اور اسی جان سے اس کا جوڑا بنایا۔ اور انہیں دونوں ( میاں بیوی ) سے بہت سے مرد اور عورتیں پھیلا دیئے۔ اور اس اللہ سے ڈرو جس کے واسطے سے تم سب ایک دوسرے سے مانگتے ہو۔ قرابت داریوں کا خیال رکھو کہ وہ ٹوٹنے نہ پائیں، بیشک اللہ تمہارا نگہبان ہے، اور اللہ سے ڈرو، اور تم میں سے ہر شخص یہ ( دھیان رکھے اور ) دیکھتا رہے کہ آنے والے کل کے لیے اس نے کیا آگے بھیجا ہے، آدمی کو چاہیئے کہ اپنے دینار میں سے، اپنے درہم میں سے، اپنے کپڑے میں سے، اپنے گیہوں کے صاع میں سے، اپنے کھجور کے صاع میں سے صدقہ کرے“، یہاں تک کہ آپ نے فرمایا: ”اگرچہ کھجور کا ایک ٹکڑا ہی سہی“، چنانچہ انصار کا ایک شخص ( روپیوں سے بھری ) ایک تھیلی لے کر آیا جو اس کی ہتھیلی سے سنبھل نہیں رہی تھی بلکہ سنبھلی ہی نہیں۔ پھر تو لوگوں کا تانتا بندھ گیا۔ یہاں تک کہ میں نے دیکھا کہ کھانے اور کپڑے کے دو ڈھیر اکٹھے ہو گئے۔ اور میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کا چہرہ انور کھل اٹھا ہے گویا وہ سونے کا پانی دیا ہوا چاندی ہے ( اس موقع پر ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اسلام میں کوئی اچھا طریقہ جاری کرے گا، اس کے لیے دہرا اجر ہو گا: ایک اس کے جاری کرنے کا، دوسرا جو اس پر عمل کریں گے ان کا اجر، بغیر اس کے کہ ان کے اجر میں کوئی کمی کی جائے۔ اور جس نے اسلام میں کوئی برا طریقہ جاری کیا، تو اسے اس کے جاری کرنے کا گناہ ملے گا اور جو اس اس پر عمل کریں گے ان کا گناہ بھی بغیر اس کے کہ ان کے گناہ میں کوئی کمی کی جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": 2555,
			"text": "حارثہ بن وہب رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا کہ صدقہ کرو کیونکہ تم پر ایک زمانہ ایسا آئے گا کہ آدمی اپنا صدقہ لے کر دینے چلے گا تو جس شخص کو وہ دینے جائے گا وہ شخص کہے گا: اگر تم کل لے کر آئے ہوتے تو میں لے لیتا، لیکن آج تو آج نہیں لوں گا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2556,
			"arabicnumber": 2556,
			"text": "ابوموسیٰ اشعری رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سفارش کرو تمہاری سفارش قبول کی جائے گی، اللہ اپنے نبی کریم صلی اللہ علیہ وسلم کی زبان سے جو چاہے فیصلہ فرمائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "معاویہ بن ابی سفیان رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”آدمی کوئی چیز مجھ سے مانگتا ہے تو میں نہیں دیتا، تاکہ تم اس سلسلہ میں سفارش کرو، اور سفارش کرنے کا اجر پاؤ“، نیز رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سفارش کرو تمہیں سفارش کا اجر ( ثواب ) دیا جائے گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "جابر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ایک غیرت وہ ہے جسے اللہ تعالیٰ پسند کرتا ہے، اور ایک غیرت وہ ہے جسے اللہ ناپسند کرتا ہے، ( ایسے ہی ) ایک فخر وہ ہے جسے اللہ تعالیٰ پسند کرتا ہے، اور ایک فخر وہ ہے جسے اللہ تعالیٰ ناپسند کرتا ہے، تو جس غیرت کو اللہ پسند کرتا ہے وہ تہمت کی جگہ کی غیرت ہے، اور وہ غیرت ۱؎ جو اللہ عزوجل کو ناپسند ہے تو وہ غیر تہمت کی جگہ کی غیرت ہے ۲؎ رہا فخر جو اللہ کو پسند ہے تو وہ آدمی کا لڑائی کے وقت یا صدقہ دیتے وقت اپنی ذات پر فخر ہے ۳؎ اور وہ فخر جو اللہ کو ناپسند ہے وہ یہ ہے کہ آدمی لغو اور بیہودہ کاموں پر فخر کرے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": 2559,
			"text": "عبداللہ بن عمرو رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کھاؤ، صدقہ کرو، اور پہنو، لیکن اسراف ( فضول خرچی ) اور غرور ( گھمنڈ و تکبر ) سے بچو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "ابوموسیٰ اشعری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مومن، مومن کے لیے عمارت کی طرح ہے جس کا ایک حصہ دوسرے حصے کو مضبوط کرتا ہے“، نیز فرمایا: ”امانت دار خازن جو خوش دلی سے وہ چیز دے جس کا اسے حکم دیا گیا ہو تو وہ بھی صدقہ دینے والوں میں سے ایک ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2561,
			"arabicnumber": 2561,
			"text": "عقبہ بن عامر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بلند آواز سے قرآن پڑھنے والا اعلانیہ صدقہ کرنے والے کی طرح ہے، اور دھیرے سے قرآن پڑھنے والا چھپا کر صدقہ دینے والے کی طرح ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2562,
			"arabicnumber": 2562,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تین طرح کے لوگ ہیں جن کی طرف اللہ تعالیٰ قیامت کے دن نہ دیکھے گا، ایک ماں باپ کا نافرمان، دوسری وہ عورت جو مردوں کی مشابہت اختیار کرے، تیسرا دیوث ( بے غیرت ) اور تین شخص ایسے ہیں جو جنت میں نہ جائیں گے۔ ایک ماں باپ کا نافرمان، دوسرا عادی شرابی، اور تیسرا دے کر احسان جتانے والا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2563,
			"arabicnumber": 2563,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تین شخص ایسے ہیں جن سے اللہ تعالیٰ قیامت کے دن نہ بات کرے گا، نہ ان کی طرف دیکھے گا، نہ ان کو پاک کرے گا، اور ان کے لیے درد ناک عذاب ہو گا“، پھر رسول اللہ صلی اللہ علیہ وسلم نے یہی آیت پڑھی۔ تو ابوذر رضی اللہ عنہ نے کہا: وہ لوگ نامراد ہوئے، گھاٹے میں رہے، آپ نے فرمایا: ” ( وہ تین یہ ہیں ) اپنا تہبند ٹخنے کے نیچے لٹکانے والا، جھوٹی قسمیں کھا کھا کر اپنے سامان کو رواج دینے والا، اپنے دیے ہوئے کا احسان جتانے والا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2564,
			"arabicnumber": 2564,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تین شخص ایسے ہیں جن سے قیامت کے دن اللہ عزوجل نہ بات کرے گا، نہ ان کی طرف دیکھے گا، نہ انہیں پاک و صاف کرے گا، اور انہیں درد ناک عذاب ہو گا: اپنے دئیے ہوئے کا احسان جتانے والا، اپنے تہبند کو ٹخنوں سے نیچے لٹکانے والا، اپنے سامان کو جھوٹی قسمیں کھا کر رواج دینے والا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2565,
			"arabicnumber": 2565,
			"text": "ابن بجید انصاری اپنی دادی سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مانگنے والے کو کچھ دے کر لوٹایا کرو اگرچہ کھر ہی سہی“۔ ہارون کی روایت میں «محرق» ( جلی ہوئی ) کا اضافہ ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2566,
			"arabicnumber": 2566,
			"text": "بہز بن حکیم اپنے دادا معاویہ بن حیدہ رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا: ”آدمی اپنے مالک کے پاس اس کی ضرورت سے زائد و فاضل چیز مانگنے آئے، اور وہ اسے نہ دے تو اس کے لیے قیامت کے دن ایک گنجا ( زہریلا ) سانپ بلایا جائے گا، جو اس کے فاضل مال کو جسے اس نے دینے سے انکار کر دیا تھا چاٹتا پھرے گا“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2567,
			"arabicnumber": 2567,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اللہ تعالیٰ کی پناہ مانگے اسے پناہ دو، اور جو شخص تم سے اللہ تعالیٰ کے نام پر سوال کرے اسے دو، اور جو شخص اللہ کے نام پر تم سے امان چاہے تو امان دو، اور جو شخص تمہارے ساتھ کوئی بھلائی کرے تو تم اسے اس کا بدلہ دو، اور اگر تم بدلہ نہ دے سکو تو اس کے لیے دعا کرو یہاں تک کہ تم جان لو کہ تم نے اس کا بدلہ چکا دیا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2568,
			"arabicnumber": 2568,
			"text": "معاویہ بن حیدہ رضی الله عنہ کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم سے عرض کیا: اللہ کے نبی! میں اپنے دونوں ہاتھوں کی انگلیوں کی تعداد سے بھی زیادہ بار یہ قسم کھانے کے بعد کہ میں نہ آپ کے پاس آؤں گا اور نہ آپ کا دین قبول کروں گا۔ آپ کے پاس آیا ہوں، میں ایک بے عقل اور ناسمجھ انسان ہوں ( اب بھی کچھ نہیں سمجھتا ) سوائے اس کے جو اللہ اور اس کے رسول نے مجھے سکھا دیا ہے۔ میں اللہ کی ذات کا حوالہ دے کر آپ سے پوچھتا ہوں: اللہ نے آپ کو ہمارے پاس کیا چیزیں دے کر بھیجا ہے؟ آپ نے فرمایا: ”اسلام دے کر“، میں نے عرض کیا: ”اسلام کی نشانیاں کیا ہیں؟“ تو آپ نے فرمایا: ”یہ ہے کہ تم کہو: میں نے اپنی ذات کو اللہ تعالیٰ کے سپرد کر دیا اور اپنے آپ کو کفر و شرک کی آلائشوں سے پاک کر لیا ہے، اور تم نماز قائم کرو، زکاۃ دو۔ ہر مسلمان دوسرے مسلمان پر حرام ہے ۱؎۔ ہر ایک دوسرے کا بھائی و مددگار ہے، اللہ تعالیٰ مشرک کا کوئی عمل اس کے بعد کہ وہ اسلام لے آیا ہو قبول نہیں کرتا، یا وہ مشرکین کو چھوڑ کر مسلمانوں سے آ ملے ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2569,
			"arabicnumber": 2569,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کیا میں تمہیں لوگوں میں مرتبہ کے اعتبار سے بہترین شخص کے بارے میں نہ بتاؤں؟ ہم نے عرض کیا: کیوں نہیں، ضرور بتائیے اللہ کے رسول! آپ نے فرمایا: ”وہ شخص ہے جو اللہ کی راہ میں اپنے گھوڑے کا سر تھامے رہے یہاں تک کہ اسے موت آ جائے، یا وہ قتل کر دیا جائے، اور میں تمہیں اس شخص کے بارے میں بتاؤں جو مرتبہ میں اس سے قریب تر ہے“۔ ہم نے عرض کیا: جی ہاں، اللہ کے رسول! بتائیے، آپ نے فرمایا: ”یہ وہ شخص ہے جو لوگوں سے کٹ کر کسی وادی میں ( گوشہ نشین ہو جائے ) نماز قائم کرے، زکاۃ دے اور لوگوں کے شر سے الگ تھلگ رہے، اور میں تمہیں لوگوں میں برے شخص کے بارے میں بتاؤں؟“، ہم نے عرض کیا: جی ہاں، اللہ کے رسول! ضرور بتائیے، آپ نے فرمایا: ”وہ شخص ہے جس سے اللہ کے نام پر مانگا جائے اور وہ نہ دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2570,
			"arabicnumber": 2570,
			"text": "ابوذر رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”تین آدمی ایسے ہیں جن سے اللہ عزوجل محبت کرتا ہے، اور تین آدمی ایسے ہیں جن سے اللہ عزوجل بغض رکھتا ہے، رہے وہ جن سے اللہ محبت کرتا ہے تو وہ یہ ہیں: ایک شخص کچھ لوگوں کے پاس گیا، اور اس نے ان سے اللہ کے نام پر کچھ مانگا، اور مانگنے میں ان کے اور اپنے درمیان کسی قرابت کا واسطہ نہیں دیا۔ لیکن انہوں نے اسے نہیں دیا۔ تو ایک شخص ان لوگوں کے پیچھے سے مانگنے والے کے پاس آیا۔ اور اسے چپکے سے دیا، اس کے اس عطیہ کو صرف اللہ عزوجل جانتا ہو اور وہ جسے اس نے دیا ہے۔ اور کچھ لوگ رات میں چلے اور جب نیند انہیں اس جیسی اور چیزوں کے مقابل میں بہت بھلی لگنے لگی، تو ایک جگہ اترے اور اپنا سر رکھ کر سو گئے، لیکن ایک شخص اٹھا، اور میرے سامنے گڑگڑانے لگا اور میری آیتیں پڑھنے لگا۔ اور ایک وہ شخص ہے جو ایک فوجی دستہ میں تھا، دشمن سے مڈبھیڑ ہوئی، لوگ شکست کھا کر بھاگنے لگے مگر وہ سینہ تانے ڈٹا رہا یہاں تک کہ وہ مارا گیا، یا اللہ تعالیٰ نے اسے فتح مند کیا۔ اور تین شخص جن سے اللہ تعالیٰ بغض رکھتا ہے یہ ہیں: ایک بوڑھا زنا کار، دوسرا گھمنڈی فقیر، اور تیسرا ظالم مالدار“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2571,
			"arabicnumber": 2571,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسکین وہ نہیں ہے جسے ایک کھجور یا دو کھجور ایک لقمہ یا دو لقمے ( در در ) گھماتے اور ( گھر گھر ) چکر لگواتے ہیں۔ بلکہ مسکین سوال سے بچنے والا ہے ۱؎ اگر تم چاہو تو پڑھو «‏لا يسألون الناس إلحافا‏» ”وہ لوگوں سے گڑگڑا کر نہیں مانگتے“ ( البقرہ: ۲۷۳ ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2572,
			"arabicnumber": 2572,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسکین وہ نہیں ہے جو اس طرح لوگوں کے پاس چکر لگائے کہ ایک لقمہ دو لقمے یا ایک کھجور دو کھجوریں اسے در در پھرائیں“، لوگوں نے پوچھا: پھر مسکین کون ہے؟ فرمایا: ”مسکین وہ ہے جس کے پاس اتنا مال و دولت نہ ہو کہ وہ اپنی ضرورت کی تکمیل کے لیے دوسروں کا محتاج نہ رہے، اور وہ محسوس بھی نہ ہو سکے کہ وہ مسکین ہے کہ اسے ضرورت مند سمجھ کر صدقہ دیا جائے۔ اور نہ ہی وہ لوگوں کے سامنے مانگنے کے لیے ہاتھ پھیلائے کھڑا ہوتا ہے“",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مسکین وہ نہیں ہے جسے ایک لقمے دو لقمے اور ایک کھجور، دو کھجور در در پھرائیں“۔ لوگوں نے کہا: پھر مسکین کون ہے؟ اللہ کے رسول! آپ نے فرمایا: ”مسکین وہ ہے: جو مالدار نہ ہو، اور لوگ اس کی محتاجی و حاجت مندی کو جان بھی نہ سکیں کہ اسے صدقہ دیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "ام بجید رضی الله عنہا (جو ان عورتوں میں سے ہیں جن ہوں نے رسول اللہ صلی اللہ علیہ وسلم سے بیعت کی تھی) کہتی ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: ( کبھی ایسا ہوتا ہے ) کہ مسکین میرے دروازے پر آ کھڑا ہوتا ہے، اور میں اسے دینے کے لیے کوئی چیز موجود نہیں پاتی؟ آپ نے فرمایا: ”اگر تم اسے دینے کے لیے صرف جلی ہوئی کھر ہی پاؤ تو اسے وہی دے دو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”تین طرح کے لوگ ہیں جن سے اللہ عزوجل قیامت کے دن بات نہیں کرے گا: بوڑھا زنا کار، گھمنڈی فقیر، جھوٹا امام“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”چار طرح کے لوگ ہیں جن سے اللہ بغض رکھتا ہے: قسمیں کھا کھا کر بیچنے والا، گھمنڈی فقیر، بوڑھا زنا کار، ظالم امام ( حاکم ) “",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”بیوہ عورت اور مسکین پر خرچ کرنے کے لیے محنت کرنے والا اللہ کی راہ میں جہاد کرنے والے کے مانند ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ علی رضی اللہ عنہ نے یمن سے رسول اللہ صلی اللہ علیہ وسلم کے پاس مٹی ملا ہوا غیر صاف شدہ سونے کا ایک ڈلا بھیجا تو آپ صلی اللہ علیہ وسلم نے اسے چار افراد: اقرع بن حابس حنظلی، عیینہ بن بدر فرازی، اور علقمہ بن علاثہ جو عامری تھے پھر وہ بنی کلاب کے ایک فرد بن گئے، اور زید جو طائی تھے پھر بنی نبہان میں سے ہو گئے، کے درمیان تقسیم کر دیا۔ ( یہ دیکھ کر ) قریش کے لوگ غصہ ہو گئے۔ راوی نے دوسری بار کہا: قریش کے سرکردہ لوگ غصہ ہو گئے، اور کہنے لگے کہ آپ نجد کے سرداروں کو دیتے ہیں اور ہم کو چھوڑ دیتے ہیں؟ آپ نے فرمایا: ”میں نے ایسا اس لیے کیا ہے تاکہ ان کی تالیف قلب کروں ( یعنی انہیں رجھا سکوں ) “، اتنے میں گھنی داڑھی والا، ابھرے گالوں والا دھنسی آنکھوں والا، ابھری پیشانی والا، منڈے سر والا ایک شخص آیا اور کہنے لگا: محمد اللہ سے ڈرو، آپ نے فرمایا: ”اگر میں ہی اللہ تعالیٰ کی نافرمانی کرنے لگوں گا تو پھر اللہ عزوجل کی تابعداری کون کرے گا؟ وہ مجھے سارے زمین والوں میں اپنا امین ( معتمد ) سمجھتا ہے، اور تم مجھے امین نہیں سمجھتے“، پھر وہ شخص پیٹھ پھیر کر چلا تو حاضرین میں سے ایک شخص نے اس کے قتل کی اجازت طلب کی ( لوگوں کا خیال ہے کہ وہ خالد بن ولید رضی اللہ عنہ تھے ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اس کی نسل سے ایسے لوگ پیدا ہوں گے جو قرآن پڑھیں گے لیکن وہ ان کے حلق سے نیچے نہیں اترے گا ۱؎، اہل اسلام کو قتل کریں گے، اور بت پرستوں کو چھوڑ دیں گے۔ یہ لوگ اسلام سے ایسے ہی نکل جائیں گے جیسے تیر شکار کے جسم کو چھیدتا ہوا نکل جاتا ہے۔ اگر میں نے انہیں پایا، تو میں انہیں قوم عاد کی طرح قتل کر دوں گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "قبیصہ بن مخارق رضی الله عنہ کہتے ہیں کہ میں نے ایک قرض اپنے ذمہ لے لیا، تو میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور آپ سے اس سلسلہ میں سوال کیا، تو آپ نے فرمایا: ”مانگنا صرف تین لوگوں کے لیے جائز ہے، ان میں سے ایک وہ شخص ہے جس نے قوم کے کسی شخص کے قرض کی ضمانت لے لی ہو ( پھر وہ ادا نہ کر سکے ) ، تو وہ دوسرے سے مانگے یہاں تک کہ اسے ادا کر دے، پھر رک جائے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "قبیصہ بن مخارق رضی الله عنہ سے روایت ہے کہ میں نے ایک قرض اپنے ذمہ لے لیا، میں رسول اللہ صلی اللہ علیہ وسلم کے پاس ( ادائیگی کے لیے روپے ) مانگنے آیا، تو آپ نے فرمایا: ”اے قبیصہ رکے رہو۔ ( کہیں سے ) صدقہ آ لینے دو، تو ہم تمہیں اس میں سے دلوا دیں گے“، وہ کہتے ہیں ـ: پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اے قبیصہ! صدقہ تین طرح کے لوگوں کے سوا کسی کے لیے جائز نہیں ہے: وہ شخص جو کسی کا بوجھ خود اٹھا لے ۱؎ تو اس کے لیے مانگنا درست ہے، یہاں تک کہ اس سے اس کی ضرورت پوری ہو جائے، اور ( دوسرا ) وہ شخص جو کسی ناگہانی آفت کا شکار ہو جائے، اور وہ اس کا مال تباہ کر دے، تو اس کے لیے مانگنا جائز ہے یہاں تک کہ وہ اسے پا لے، پھر رک جائے، ( تیسرا ) وہ شخص جو فاقہ کا شکار ہو گیا ہو یہاں تک کہ اس کی قوم کے تین سمجھ دار افراد گواہی دیں کہ ہاں واقعی فلاں شخص فاقہ کا مارا ہوا ہے، تو اس کے لیے مانگنا جائز ہے یہاں تک کہ اس کے گزارہ کا انتظام ہو جائے، ان کے علاوہ مانگنے کی جو بھی صورت ہے حرام ہے، اے قبیصہ! اور جو کوئی مانگ کر کھاتا ہے حرام کھاتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "ابو سعید خدری رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم منبر پر بیٹھے، ہم بھی آپ کے اردگرد بیٹھے، آپ نے فرمایا: ”اپنے بعد میں تمہارے متعلق دنیا کی رونق و شادابی جس کی تمہارے اوپر بہتات کر دی جائے گی سے ڈر رہا ہوں“، پھر آپ نے دنیا اور اس کی زینت کا ذکر کیا۔ تو ایک شخص کہنے لگا: کیا خیر شر لے کر آئے گا؟ یہ سن کر رسول اللہ صلی اللہ علیہ وسلم خاموش رہے۔ تو اس سے کہا گیا: تیرا کیا معاملہ ہے کہ تو رسول اللہ صلی اللہ علیہ وسلم سے بات کرتا ہے، اور وہ تجھ سے بات نہیں کرتے؟ اس وقت ہم نے دیکھا کہ آپ پر وحی اتاری جا رہی تھی۔ پھر وحی موقوف ہوئی تو آپ پسینہ پوچھنے لگے، اور فرمایا: ”کیا پوچھنے والا موجود ہے؟ بیشک خیر شر نہیں لاتا ہے، مگر خیر اس سبزہ کی طرح ہے جسے موسم ربیع ( بہار ) اگاتا ہے، ( جانور کو بدہضمی سے ) مار ڈالتا ہے، یا مرنے کے قریب کر دیتا ہے مگر اس گھاس کو کھانے والے کو ( نقصان نہیں پہنچاتا ) جو کھائے یہاں تک کہ جب اس کی دونوں کوکھیں بھر جائیں تو وہ دھوپ میں جا کر سورج کا سامنا کرے، اور پائخانہ پیشاب کرے، پھر ( جب بھوک محسوس کرے تو ) پھر چرے ( اس طرح ) یقیناً یہ مال بھی ایک سرسبز و شیریں چیز ہے۔ وہ مسلمان کا کیا ہی بہترین ساتھی ہے اگر وہ اس سے یتیموں، مسکینوں اور مسافروں کو دے، اور جو شخص ناحق مال حاصل کرتا ہے وہ اس شخص کی طرح ہے جو کھاتا ہے لیکن آسودہ نہیں ہوتا، اور یہ قیامت کے دن اس کے خلاف گواہ ہو گا“ ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "سلمان بن عامر رضی الله عنہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ آپ نے فرمایا: ”مسکین کو صدقہ کرنا صرف صدقہ ہے، اور رشتہ دار مسکین کو صدقہ کرنا صدقہ بھی ہے، اور صلہ رحمی بھی“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "عبداللہ بن مسعود رضی الله عنہ کی بیوی زینب رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عورتوں سے فرمایا: ”تم صدقہ دو اگرچہ اپنے زیوروں ہی سے سہی“، وہ کہتی ہیں: عبداللہ بن مسعود رضی اللہ عنہ ( میرے شوہر ) تنگ دست و مفلس تھے، تو میں نے ان سے پوچھا: کیا میرے لیے یہ گنجائش ہے کہ میں اپنا صدقہ آپ کو اور اپنے یتیم بھتیجوں کو دے دیا کروں؟ عبداللہ بن مسعود رضی اللہ عنہ نے کہا: اس بارے میں تم رسول اللہ صلی اللہ علیہ وسلم سے پوچھو۔ زینب رضی اللہ عنہا کہتی ہیں کہ میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی تو کیا دیکھتی ہوں کہ انصار کی ایک عورت اسے بھی زینب ہی کہا جاتا تھا آپ کے دروازے پر کھڑی ہے، وہ بھی اسی چیز کے بارے میں پوچھنا چاہتی تھی جس کے بارے میں میں پوچھنا چاہتی تھی۔ اتنے میں بلال رضی اللہ عنہ اندر سے نکل کر ہماری طرف آئے، تو ہم نے ان سے کہا: آپ رسول اللہ صلی اللہ علیہ وسلم کے پاس جائیں، اور آپ سے اس کے بارے میں پوچھیں، اور آپ کو یہ نہ بتائیں کہ ہم کون ہیں، چنانچہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس گئے ( اور آپ سے پوچھا ) آپ نے پوچھا: یہ دونوں کون ہیں؟ انہوں نے کہا: زینب، آپ نے فرمایا: کون سی زینب؟ انہوں نے کہا: ایک زینب تو عبداللہ بن مسعود رضی اللہ عنہ کی بیوی، اور ایک زینب انصار میں سے ہیں۔ آپ نے فرمایا: ”ہاں ( درست ہے ) انہیں دوہرا ثواب ملے گا ایک رشتہ داری کا اور دوسرا صدقے کا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم میں سے کوئی لکڑیوں کا ایک گٹھا اپنی پیٹھ پر لاد کر لائے، پھر اسے بیچے تو یہ اس سے بہتر ہے کہ وہ کسی آدمی سے مانگے، تو اسے دے یا نہ دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”آدمی برابر مانگتا رہتا ہے یہاں تک کہ وہ قیامت کے روز ایسی حالت میں آئے گا کہ اس کے چہرے پر کوئی لوتھڑا گوشت نہ ہو گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "عائذ بن عمرو رضی الله عنہ سے روایت ہے کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا، اور اس نے آپ سے مانگا تو آپ نے اسے دیا۔ جب ( وہ لوٹ کر چلا اور ) اس نے اپنا پیر دروازے کے چوکھٹ پر رکھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اگر تم لوگ جان پاتے کہ بھیک مانگنے میں کیا ( برائی ) ہے تو کوئی کسی کے پاس کچھ بھی مانگنے نہ جاتا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "فراسی رضی الله عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا: اللہ کے رسول! میں مانگوں؟ آپ نے فرمایا: ”نہیں، اور اگر تمہیں مانگنا ضروری ہو تو نیکو کاروں سے مانگو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ انصار میں سے کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا، تو آپ نے انہیں دیا، ان لوگوں نے پھر سوال کیا، تو آپ نے انہیں پھر دیا یہاں تک کہ آپ کے پاس جو کچھ تھا ختم ہو گیا، تو آپ نے فرمایا: ”میرے پاس جو ہو گا اسے میں ذخیرہ بنا کر نہیں رکھوں گا، اور جو پاک دامن بننا چاہے گا اللہ تعالیٰ اسے پاک دامن بنا دے گا، اور جو صبر کرے گا اللہ تعالیٰ اسے صبر کی توفیق دے گا، اور صبر سے بہتر اور بڑی چیز کسی کو نہیں دی گئی ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "ابوہریرہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، ایک شخص کا اپنی رسی لے کر لکڑیوں کا گٹھا باندھ کر پیٹھ پر لادنا اس سے بہتر ہے کہ وہ کسی ایسے شخص کے پاس جائے جسے اللہ تعالیٰ نے اپنے فضل ( مال ) سے نوازا ہو، وہ اس سے مانگے، تو وہ اسے دے یا نہ دے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "ثوبان رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص مجھے ایک بات کی ضمانت دے تو اس کے لیے جنت ہے“ ( یحییٰ کہتے ہیں: یہاں ایک لفظ تھا جس کا مفہوم یہ ہے کہ ) ”وہ لوگوں سے کچھ نہ مانگے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2591,
			"arabicnumber": 2591,
			"text": "قبیصہ بن مخارق رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا: تین شخصوں کے علاوہ کسی اور کے لیے سوال کرنا درست نہیں ہے: ایک وہ شخص جس کا مال کسی آفت کا شکار ہو گیا ہو تو وہ مانگ سکتا ہے یہاں تک کہ وہ گزارے کا کوئی ایسا ذریعہ حاصل کر لے جس سے اس کی ضرورتیں پوری ہو سکیں، پھر رک جائے، ( دوسرا ) وہ شخص جو کسی کا قرض اپنے ذمہ لے لے تو وہ قرض لوٹانے تک مانگ سکتا ہے، پھر ( جب قرض ادا ہو جائے ) تو مانگنے سے رک جائے۔ اور ( تیسرا ) وہ شخص جس کی قوم کے تین سمجھدار افراد اللہ کے نام کی قسم کھا کر اس کی محتاجی و تنگ دستی کی گواہی دیں کہ فلاں شخص کے لیے مانگنا جائز ہے تو وہ مانگ سکتا ہے، یہاں تک کہ وہ گزارے کا کوئی ایسا ذریعہ نہ حاصل کر لے جس سے اس کی ضرورتیں پوری ہو سکیں، ان ( تین صورتوں ) کے علاوہ مانگنا حرام ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "عبداللہ بن مسعود رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو مانگے اور اس کے پاس ایسی چیز ہو جو اسے مانگنے سے بے نیاز کرتی ہو، تو وہ قیامت کے دن اپنے چہرے پر خراشیں لے کر آئے گا“، عرض کیا گیا: اللہ کے رسول! کتنا مال ہو تو اسے غنی ( مالدار ) سمجھا جائے گا؟ آپ نے فرمایا: ”پچاس درہم، یا اس کی قیمت کا سونا ہو“۔ یحییٰ بن آدم کہتے ہیں: سفیان ثوری نے کہا کہ میں نے زبید سے بھی سنا ہے، وہ محمد بن عبدالرحمٰن بن یزید کے واسطہ سے ( یہ حدیث ) بیان کر رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "معاویہ رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”چمٹ کر مت مانگو، اور تم میں سے کوئی مجھ سے کوئی چیز اس لیے نہ مانگے کہ میں اسے جو دوں اس میں اسے برکت دی جائے، اور حال یہ ہو کہ میں اسے نہ دینا چاہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "عبداللہ بن عمرو بن العاص رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جس کے پاس چالیس درہم ہوں اور وہ مانگے تو وہ «ملحف» ( چمٹ کر مانگنے والا ) ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "ابو سعید خدری رضی الله عنہ سے روایت ہے کہ میری ماں نے مجھے رسول اللہ صلی اللہ علیہ وسلم کے پاس ( کچھ مانگنے کے لیے ) بھیجا، میں آیا، اور بیٹھ گیا، آپ نے میری طرف منہ کیا، اور فرمایا: ”جو بے نیازی چاہے گا اللہ عزوجل اسے بے نیاز کر دے گا اور جو شخص سوال سے بچنا چاہے گا اللہ تعالیٰ اسے بچا لے گا، اور جو تھوڑے پر قناعت کرے گا اللہ تعالیٰ اسے کافی ہو گا۔ اور جو شخص مانگے اور اس کے پاس ایک اوقیہ ( یعنی چالیس درہم ) کے برابر مال ہو تو گویا اس نے چمٹ کر مانگا“، تو میں نے ( اپنے دل میں ) کہا: میری اونٹنی یاقوتہ ایک اوقیہ سے بہتر ہے، چنانچہ میں آپ سے بغیر کچھ مانگے واپس چلا آیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "قبیلہ بنی اسد کے ایک شخص کہتے ہیں کہ میں اور میری بیوی دونوں بقیع الغرقد میں اترے، میری بیوی نے مجھ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس جا کر ہمارے لیے کھانے کی کوئی چیز مانگ کر لائیے، تو میں رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا۔ مجھے آپ کے پاس ایک شخص ملا جو آپ سے مانگ رہا تھا، اور آپ اس سے فرما رہے تھے: ”میرے پاس ( اس وقت ) تمہیں دینے کے لیے کچھ نہیں ہے“۔ وہ شخص آپ کے پاس سے پیٹھ پھیر کر غصے کی حالت میں یہ کہتا ہوا چلا: قسم ہے میری زندگی کی! آپ تو اسی کو دیتے ہیں جسے چاہتے ہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ” ( خواہ مخواہ ) مجھ پر اس بات پر غصہ ہو رہا ہے کہ میرے پاس اسے دینے کے لیے کچھ نہیں ہے، ( ہوتا تو اسے دیتا ویسے تم لوگ جان لو کہ ) تم میں سے جس کے پاس چالیس درہم ہو یا چالیس درہم کی قیمت کے برابر کا مال ہو، اور اس نے مانگا تو اس نے چمٹ کر مانگا“، اسدی ( جو اس حدیث کے راوی ہیں ) کہتے ہیں: میں نے ( دل میں ) کہا: ہماری دو دھاری اونٹنی ایک اوقیہ سے تو بہتر ہی ہے، اوقیہ چالیس درہم کا ہوتا ہے، چنانچہ میں آپ سے بغیر کچھ مانگے لوٹ آیا۔ پھر آپ کے پاس جَو اور کشمش آئے، تو آپ نے ہم کو بھی اس میں سے حصہ دیا، یہاں تک کہ اللہ عزوجل نے ہم کو مالدار کر دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ کسی مالدار، طاقتور اور صحیح سالم شخص کے لیے درست نہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "عبیداللہ بن عدی بن خیار رضی الله عنہ سے روایت ہے کہ دو شخصوں نے ان سے بیان کیا کہ وہ دونوں رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، دونوں آپ سے صدقہ مانگ رہے تھے، تو آپ نے نگاہ الٹ پلٹ کر انہیں دیکھا ( محمد کی روایت میں ( نگاہ کے بجائے ) اپنی نگاہ ہے تو دونوں کو ہٹا کٹا پایا، تو آپ نے فرمایا: ”اگر چاہو تو لے لو، ( لیکن یہ جان لو ) کہ مالدار اور کما سکنے والے شخص کے لیے اس میں کوئی حصہ نہیں ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "سمرہ بن جندب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مانگنا خراش ( زخم کی ہلکی لکیر ) ہے جسے آدمی اپنے چہرے پر لگاتا ہے، تو جو چاہے اپنے چہرے پر ( مانگ کر ) خراش لگائے، اور جو چاہے نہ لگائے، مگر یہ کہ آدمی حاکم سے مانگے، یا کوئی ایسی چیز مانگے جس سے چارہ نہ ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "سمرہ بن جندب رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”مانگنا خراش ہے جس سے آدمی اپنے چہرے کو زخمی کرتا ہے مگر یہ کہ آدمی حاکم سے مانگے، یا کوئی ایسی چیز مانگے جس کے بغیر چارہ نہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے مانگا تو آپ نے دیا، پھر مانگا تو پھر دیا، پھر آپ نے فرمایا: ”یہ مال ہری بھری اور میٹھی چیز ہے، جو شخص اسے دل کی پاکیزگی کے ساتھ لے گا تو اسے اس میں برکت ملے گی، اور جو شخص اسے نفس کی حرص و طمع سے لے گا تو اس میں اسے برکت نہیں دی جائے گی۔ وہ اس شخص کی طرح ہو گا جو کھائے لیکن اس کا پیٹ نہ بھرے۔ ( جان لو ) اوپر والا ( یعنی دینے والا ) ہاتھ نیچے والے ( یعنی لینے والے ) ہاتھ سے بہتر ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے مانگا تو آپ نے مجھے دیا، پھر مانگا تو آپ نے پھر دیا، پھر مانگا تو آپ نے پھر دیا، پھر آپ نے فرمایا: ”حکیم! یہ مال ہری بھری اور میٹھی چیز ہے۔ جو اسے طبیعت کی فیاضی کے ساتھ لے گا تو اسے اس میں برکت دی جائے گی، اور جو نفس کی حرص و لالچ کے ساتھ لے گا تو اسے اس میں برکت نہیں دی جائے گی۔ اور وہ اس شخص کی طرح ہو گا جو کھاتا ہو لیکن آسودہ نہ ہوتا ہو، اور اوپر والا ہاتھ بہتر ہے نیچے والے ہاتھ سے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "حکیم بن حزام رضی الله عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے مانگا تو آپ نے مجھے دیا، میں نے پھر مانگا تو آپ نے پھر دیا۔ پھر آپ نے فرمایا: ”اے حکیم! یہ مال میٹھی چیز ہے، جو شخص اسے نفس کی فیاضی کے ساتھ لے گا تو اس میں اسے برکت دی جائے گی، اور جو شخص اسے حرص و طمع کے ساتھ لے گا تو اسے اس میں برکت نہیں دی جائے گی۔ اور وہ اس شخص کی طرح ہو گا جو کھائے تو لیکن اس کا پیٹ نہ بھرے۔ اور ( جان لو ) اوپر والا ہاتھ بہتر ہے نیچے والے سے“۔ میں نے کہا: اللہ کے رسول! قسم ہے اس ذات کی جس نے آپ کو حق کے ساتھ بھیجا ہے آپ کے بعد اب کسی سے کچھ نہ لوں گا یہاں تک کہ دنیا سے رخصت ہو جاؤں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "عبداللہ بن ساعدی مالکی کہتے ہیں کہ عمر بن خطاب رضی اللہ عنہ نے مجھے صدقہ پر عامل بنایا، جب میں اس سے فارغ ہوا اور اسے ان کے حوالے کر دیا، تو انہوں نے اس کام کی مجھے اجرت دینے کا حکم دیا، میں نے ان سے عرض کیا کہ میں نے یہ کام صرف اللہ عزوجل کے لیے کیا ہے، اور میرا اجر اللہ ہی کے ذمہ ہے، تو انہوں نے کہا: ـ میں تمہیں جو دیتا ہوں وہ لے لو، کیونکہ میں نے بھی رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں ایک کام کیا تھا، اور میں نے بھی آپ سے ویسے ہی کہا تھا جو تم نے کہا ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: ”جب تمہیں کوئی چیز بغیر مانگے ملے تو ( اسے ) کھاؤ، اور ( اس میں سے ) صدقہ کرو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "عبداللہ بن السعدی القرشی رضی الله عنہ کہتے ہیں کہ وہ شام سے عمر بن خطاب رضی اللہ عنہ کے پاس آئے تو انہوں نے کہا: کیا مجھے یہ خبر نہیں دی گئی ہے کہ تم مسلمانوں کے کاموں میں سے کسی کام پر عامل بنائے جاتے ہو، اور اس پر جو تمہیں اجرت دی جاتی ہے تو اسے تم قبول نہیں کرتے، تو انہوں نے کہا: ہاں یہ صحیح ہے، میرے پاس گھوڑے ہیں، غلام ہیں اور میں ٹھیک ٹھاک ہوں ( اللہ کا شکر ہے کوئی کمی نہیں ہے ) میں چاہتا ہوں کہ میرا کام مسلمانوں پر صدقہ ہو جائے۔ تو عمر رضی اللہ عنہ نے کہا: جو تم چاہتے ہو وہی میں نے بھی چاہا تھا۔ نبی اکرم صلی اللہ علیہ وسلم مجھے مال دیتے تو میں عرض کرتا: اسے آپ اس شخص کو دے دیجئیے جو مجھ سے زیادہ اس کا ضرورت مند ہو، ایک بار آپ نے مجھے مال دیا تو میں نے عرض کیا: آپ اسے اس شخص کو دے دیجئیے جو اس کا مجھ سے زیادہ ضرورت مند ہو، تو آپ نے فرمایا: ”اللہ عزوجل اس مال میں سے جو تمہیں بغیر مانگے اور بغیر لالچ کئے دے، اسے لے لو، چاہو تم ( اسے اپنے مال میں شامل کر کے ) مالدار بن جاؤ، اور چاہو تو اسے صدقہ کر دو۔ اور جو نہ دے اسے لینے کے پیچھے مت پڑو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2606,
			"arabicnumber": 2606,
			"text": "عبداللہ بن السعدی رضی الله عنہ کہتے ہیں کہ وہ عمر بن خطاب رضی اللہ عنہ کے پاس ان کی خلافت کے زمانہ میں آئے، تو عمر رضی اللہ عنہ نے ان سے کہا: کیا مجھے یہ نہیں بتایا گیا ہے کہ تم عوامی کاموں میں سے کسی کام کے ذمہ دار ہوتے ہو اور جب تمہیں مزدوری دی جاتی ہے تو قبول نہیں کرتے لوٹا دیتے ہو؟ میں نے کہا: جی ہاں ( صحیح ہے ) اس پر عمر رضی اللہ عنہ نے کہا: اس سے تم کیا چاہتے ہو؟ میں نے کہا: میرے پاس گھوڑے، غلام ہیں اور میں ٹھیک ٹھاک ہوں ( مجھے کسی چیز کی محتاجی نہیں ہے ) میں چاہتا ہوں کہ میرا کام مسلمانوں پر صدقہ ہو۔ تو عمر رضی اللہ عنہ نے ان سے کہا: ایسا نہ کرو کیونکہ میں بھی یہی چاہتا تھا جو تم چاہتے ہو ( لیکن اس کے باوجود ) رسول اللہ صلی اللہ علیہ وسلم مجھے عطیہ ( بخشش ) دیتے تھے تو میں عرض کرتا تھا: اسے میرے بجائے اس شخص کو دے دیجئیے جو مجھ سے زیادہ اس کا ضرورت مند ہو، تو آپ فرماتے: ”اسے لے کر اپنے مال میں شامل کر لو، یا صدقہ کر دو، سنو! تمہارے پاس اس طرح کا جو بھی مال آئے جس کا نہ تم حرص رکھتے ہو اور نہ تم اس کے طلب گار ہو تو وہ مال لے لو، اور جو اس طرح نہ آئے اس کے پیچھے اپنے آپ کو نہ ڈالو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2607,
			"arabicnumber": 2607,
			"text": "عبداللہ بن السعدی رضی الله عنہ کہتے ہیں کہ وہ عمر بن خطاب رضی اللہ عنہ کے زمانہ خلافت میں ان کے پاس آئے تو عمر رضی اللہ عنہ نے کہا: کیا مجھے یہ خبر نہیں دی گئی ہے کہ تم عوامی کاموں میں سے کسی کام کے والی ہوتے ہو تو جب تمہیں اجرت دی جاتی ہے تو تم اسے ناپسند کرتے ہو؟ وہ کہتے ہیں: میں نے کہا: کیوں نہیں ( ایسا تو ہے ) انہوں نے کہا: اس سے تم کیا چاہتے ہو؟ میں نے کہا: میرے پاس گھوڑے اور غلام ہیں اور میں ٹھیک ٹھاک ہوں، میں چاہتا ہوں کہ میرا کام مسلمانوں پر صدقہ ہو جائے، اس پر عمر رضی اللہ عنہ نے کہا: ایسا نہ کرو، کیونکہ میں بھی وہی چاہتا تھا جو تم چاہتے ہو۔ نبی اکرم صلی اللہ علیہ وسلم مجھے عطایا ( بخشش ) دیتے تھے، تو میں عرض کرتا تھا: آپ اسے دے دیں جو مجھ سے زیادہ اس کا ضرورت مند ہو، یہاں تک کہ ایک بار آپ نے مجھے کچھ مال دیا، میں نے کہا: آپ اسے اس شخص کو دے دیں جو مجھ سے زیادہ اس کا ضرورت مند ہو، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اسے لے کر اپنے مال میں شامل کر لو، نہیں تو صدقہ کر دو۔ ( سنو! ) اس مال میں سے جو بھی تمہیں بغیر کسی لالچ کے اور بغیر مانگے ملے اس کو لے لو، اور جو نہ ملے اس کے پیچھے نہ پڑو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2608,
			"arabicnumber": 2608,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ میں نے عمر رضی اللہ عنہ کو کہتے سنا کہ نبی اکرم صلی اللہ علیہ وسلم مجھے عطیہ دیتے تو میں کہتا: آپ اسے اس شخص کو دے دیجئیے جو مجھ سے زیادہ ضرورت مند ہو۔ یہاں تک کہ ایک بار آپ نے مجھے کچھ مال دیا تو میں نے آپ سے عرض کیا: اسے اس شخص کو دے دیجئیے جو مجھ سے زیادہ اس کا حاجت مند ہو، تو آپ نے فرمایا: ”تم لے لو، اور اس کے مالک بن جاؤ، اور اسے صدقہ کر دو، اور جو مال تمہیں اس طرح ملے کہ تم نے اسے مانگا نہ ہو اور اس کی لالچ کی ہو تو اسے قبول کر لو، اور جو اس طرح نہ ملے اس کے پیچھے اپنے آپ کو نہ ڈالو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2609,
			"arabicnumber": 2609,
			"text": "عبدالمطلب بن ربیعہ رضی الله عنہ سے روایت ہے کہ ان کے والد ربیعہ بن حارث نے عبدالمطلب بن ربیعہ اور فضل بن عباس رضی اللہ عنہم سے کہا کہ تم دونوں رسول اللہ صلی اللہ علیہ وسلم کے پاس جاؤ، اور آپ سے کہو کہ اللہ کے رسول! آپ ہمیں صدقہ پر عامل بنا دیں، ہم اسی حال میں تھے کہ علی رضی اللہ عنہ آ گئے تو انہوں نے ان دونوں سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم تم دونوں میں سے کسی کو بھی صدقہ پر عامل مقرر نہیں فرمائیں گے۔ عبدالمطلب کہتے ہیں: ( ان کے ایسا کہنے کے باوجود بھی ) میں اور فضل دونوں چلے یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے، تو آپ نے ہم سے فرمایا: ”یہ صدقہ جو ہے یہ لوگوں کا میل ہے، یہ محمد صلی اللہ علیہ وسلم کے لیے اور محمد صلی اللہ علیہ وسلم کے آل کے لیے جائز نہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2610,
			"arabicnumber": 2610,
			"text": "شعبہ کہتے ہیں کہ میں نے ابوایاس معاویہ بن قرہ سے پوچھا: کیا آپ نے انس بن مالک رضی اللہ عنہ کو کہتے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لوگوں کا بھانجا بھی انہیں میں سے ہوتا ہے“، انہوں نے کہا: جی ہاں ( میں نے سنا ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2611,
			"arabicnumber": 2611,
			"text": "انس بن مالک رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لوگوں کا بھانجا بھی انہیں میں سے ہوتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "ابورافع رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے بنی مخزوم کے ایک شخص کو صدقہ پر عامل مقرر فرمایا، تو ابورافع نے بھی اس کے ساتھ جانا چاہا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ ہمارے لیے حلال نہیں ہے، لوگوں کا غلام بھی انہیں میں سے شمار ہوتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "بہز بن حکیم کے دادا (معاویہ بن حیدہ) رضی الله عنہ کہتے ہیں کہ جب نبی اکرم صلی اللہ علیہ وسلم کے پاس ( کھانے کی ) کوئی چیز لائی جاتی تو آپ پوچھتے: ”یہ ہدیہ ہے یا صدقہ؟“ اگر کہا جاتا کہ یہ صدقہ ہے تو آپ نہ کھاتے اور اگر کہا جاتا یہ ہدیہ ہے تو آپ ( کھانے کے لیے ) اپنا ہاتھ بڑھاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2614,
			"arabicnumber": 2614,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ انہوں نے بریرہ رضی اللہ عنہا کو خرید کر آزاد کر دینا چاہا، لیکن ان کے مالکان نے ولاء ( ترکہ ) خود لینے کی شرط لگائی۔ تو انہوں نے اس کا تذکرہ رسول اللہ صلی اللہ علیہ وسلم سے کیا، تو آپ نے فرمایا: ”اسے خرید لو، اور آزاد کر دو، ولاء ( ترکہ ) اسی کا ہے جو آزاد کرے“، اور جس وقت وہ آزاد کر دی گئیں تو انہیں اختیار دیا گیا کہ وہ اپنے شوہر کی زوجیت میں رہیں یا نہ رہیں۔ ( اسی درمیان ) رسول اللہ صلی اللہ علیہ وسلم کے پاس گوشت لایا گیا، کہا گیا کہ یہ ان چیزوں میں سے ہے جو بریرہ رضی اللہ عنہا پر صدقہ کیا جاتا ہے، تو آپ نے فرمایا: ”یہ اس کے لیے صدقہ ہے، اور ہمارے لیے ہدیہ ہے“، ان کے شوہر آزاد تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2615,
			"arabicnumber": 2615,
			"text": "اسلم کہتے ہیں کہ میں نے عمر رضی اللہ عنہ کو کہتے سنا کہ میں نے ( ایک آدمی کو ) ایک گھوڑا اللہ کی راہ میں سواری کے لیے دیا تو اسے اس شخص نے برباد کر دیا، تو میں نے سوچا کہ میں اسے خرید لوں، خیال تھا کہ وہ اسے سستا ہی بیچ دے گا، میں نے اس بارے میں رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا، تو آپ نے فرمایا: ”تم اسے مت خریدو گرچہ وہ تمہیں ایک ہی درہم میں دیدے، کیونکہ صدقہ کر کے پھر اسے لینے والا کتے کی طرح ہے جو قے کر کے اسے چاٹتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2616,
			"arabicnumber": 2616,
			"text": "عمر رضی الله عنہ کہتے ہیں کہ انہوں نے ایک گھوڑا اللہ کی راہ میں سواری کے لیے دیا، پھر دیکھا کہ وہ گھوڑا بیچا جا رہا ہے، تو انہوں نے اسے خریدنے کا ارادہ کیا، تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: ”تم اپنے صدقے میں آڑے نہ آؤ“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2617,
			"arabicnumber": 2617,
			"text": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ عمر رضی اللہ عنہ نے ایک گھوڑا اللہ کی راہ میں صدقہ کیا، اس کے بعد انہیں معلوم ہوا کہ وہ بیچا جا رہا ہے۔ تو انہوں نے اسے خریدنے کا ارادہ کیا، وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے، اور آپ سے اس بارے میں اجازت طلب کی تو آپ نے فرمایا: ”اپنا صدقہ واپس نہ لو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2618,
			"arabicnumber": 2618,
			"text": "تابعی سعید بن مسیب سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے عتاب بن اسید کو ( درخت پر لگے ) انگور کا تخمینہ لگانے کا حکم دیا تاکہ اس کی زکاۃ کشمش سے ادا کی جا سکے، جیسے درخت پر لگی کھجوروں کی زکاۃ پکی کھجور سے ادا کی جاتی ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 184
			}
		}
	]
}