{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"32": "The Book of Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3688,
			"arabicnumber": 3688,
			"text": "عبداللہ بن عمرو بن عاص رضی الله عنہما کہتے ہیں کہ جب ہوازن کا وفد رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو ہم آپ کے پاس تھے۔ انہوں نے کہا: اے محمد! ہم ایک ہی اصیل اور خاندانی لوگ ہیں اور ہم پر جو بلا اور مصیبت نازل ہوئی ہے وہ آپ سے پوشیدہ نہیں، آپ ہم پر احسان کیجئے، اللہ آپ پر احسان فرمائے گا۔ آپ نے فرمایا: ”اپنے مال یا اپنی عورتوں اور بچوں میں سے کسی ایک کو چن لو“، تو ان لوگوں نے کہا: آپ نے ہمیں اپنے خاندان والوں اور اپنے مال میں سے کسی ایک کے چن لینے کا اختیار دیا ہے تو ہم اپنی عورتوں اور بچوں کو حاصل کر لینا چاہتے ہیں، اس پر آپ نے فرمایا: ”میرے اور بنی مطلب کے حصے میں جو ہیں انہیں میں تمہیں واپس دے دیتا ہوں اور جب میں ظہر سے فارغ ہو جاؤں تو تم لوگ کھڑے ہو جاؤ اور کہو: ہم رسول اللہ صلی اللہ علیہ وسلم کے واسطہ سے آپ سارے مسلمانوں اور مومنوں سے اپنی عورتوں اور بچوں کے سلسلہ میں مدد کے طلب گار ہیں“۔ چنانچہ جب لوگ ظہر پڑھ چکے تو یہ لوگ کھڑے ہوئے اور انہوں نے یہی بات دہرائی، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جو میرا اور بنی عبدالمطلب کا حصہ ہے وہ تمہارے حوالے ہے“، یہ بات سن کر مہاجرین نے کہا: جو ہمارے حصے میں ہے وہ رسول اللہ صلی اللہ علیہ وسلم کے سپرد، اور انصار نے بھی کہا: جو ہمارے حصہ میں ہے وہ بھی رسول اللہ صلی اللہ علیہ وسلم کے سپرد، اس پر اقرع بن حابس رضی اللہ عنہ نے کہا: میں اور بنو تمیم تو اپنا حصہ واپس نہیں کر سکتے۔ عیینہ بن حصن رضی اللہ عنہ نے بھی کہا کہ میں اور بنو فزارہ بھی اپنا حصہ دینے کے نہیں۔ عباس بن مرداس رضی اللہ عنہ نے کہا: میں اور بنو سلیم بھی اپنا حصہ نہیں لوٹانے کے۔ ( یہ سن کر ) قبیلہ بنو سلیم کے لوگ کھڑے ہوئے اور کہا: تم غلط کہتے ہو، ہمارا حصہ بھی رسول اللہ صلی اللہ علیہ وسلم کے حوالے ہے۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”لوگو! ان کی عورتوں اور بچوں کو انہیں واپس کر دو اور جو کوئی بغیر کسی بدلے نہ دینا چاہے تو اس کے لیے میرا وعدہ ہے کہ مال فیٔ میں سے جو اللہ تعالیٰ پہلے عطا کر دے گا میں اس کے ہر گردن ( غلام ) کے بدلے چھ اونٹ ملیں گے“، یہ فرما کر آپ اپنی سواری پر سوار ہو گئے، اور لوگوں نے آپ کو گھیر لیا ( اور کہنے لگے: ) ہمارے حصہ کا مال غنیمت ہمیں بانٹ دیجئیے، اور آپ کو ایک درخت کا سہارا لینے پر مجبور کر دیا جس سے آپ کی چادر الجھ کر آپ سے الگ ہو گئی تو آپ نے فرمایا: ”لوگو! میری چادر تو واپس لا دو، قسم اللہ کی! اگر تمہارے لیے تہامہ کے درختوں کے برابر اونٹ بھی ہوں تو میں انہیں تم میں تقسیم کر دوں گا، تم لوگ مجھے بخیل، بزدل اور جھوٹا نہیں پاؤ گے، پھر ایک اونٹ کے پاس آئے اور اپنی انگلیوں کے درمیان اس کے کوہان سے بالوں کا ایک گچھا لے کر کہنے لگے: سن لو! فیٔ میں سے میرا کچھ نہیں ہے اور یہ بھی نہیں ہے ( اونٹ کے بالوں کی طرف اشارہ کر کے کہا ) سوائے خمس ( ۱/۵ ) کے اور خمس بھی ( گھوم پھر کر ) تمہیں لوگوں کو لوٹا دیا جاتا ہے“۔ یہ بات سن کر ایک آدمی بالوں کا ایک گچھا لے کر آپ کے پاس آ کھڑا ہوا، اس نے کہا: اللہ کے رسول! میں نے بالوں کا یہ گچھا لیا ہے تاکہ اس سے اپنے اونٹ کی ( پھٹے ہوئے ) پالان ( گدے ) کو درست کر لوں، آپ نے فرمایا: ”میرا اور بنی مطلب کا جو حصہ ہے وہ تمہارے لیے ہے“ اس شخص نے کہا: کیا یہ اس حد تک سنگین اور اہم معاملہ ہے؟ تو مجھے اس سے کچھ نہیں لینا دینا، یہ کہہ کر اس نے بالوں کا گچھا مال فیٔ میں ڈال دیا، اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: لوگو! ”سوئی اور دھاگا بھی لا کر جمع کرو، کیونکہ مال غنیمت میں چوری اور خیانت قیامت کے دن چوری اور خیانت کرنے والے کے لیے شرم و ندامت کا باعث ہو گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3689,
			"arabicnumber": 3689,
			"text": "عبداللہ بن عمرو بن عاص رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کوئی شخص کسی کو کوئی چیز بطور ہبہ دے کر واپس نہیں لے سکتا، سوائے باپ کے کہ وہ اپنے بیٹے کو دے کر پھر واپس لے سکتا ہے، ( سن لو ) ہبہ کر کے واپس لینے والا ایسا ہی ہے جیسے کوئی قے کرے کے چاٹے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3690,
			"arabicnumber": 3690,
			"text": "عبداللہ بن عباس اور عبداللہ بن عمر رضی الله عنہم روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”کسی شخص کے لیے حلال نہیں ہے کہ کسی کو کوئی تحفہ دے پھر اسے واپس لے ۱؎ سوائے باپ کے جسے وہ اپنے بیٹے کو دیتا ہے، اس شخص کی مثال جو کوئی عطیہ دیے کر اسے واپس لے لے اس کتے جیسی ہے جس نے ( خوب ) کھا لیا ہو یہاں تک کہ جب وہ آسودہ ہو جائے تو قے کرے پھر اسے چاٹے“",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3691,
			"arabicnumber": 3691,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہبہ کر کے اسے لینے والا کتے کی طرح ہے، جو قے کرتا ہے پھر اسی کو چاٹتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3692,
			"arabicnumber": 3692,
			"text": "تابعی طاؤس کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی کے لیے حلال نہیں ہے کہ وہ کسی کوئی ہبہ دے پھر اسے واپس لے، سوائے باپ کے کہ وہ اپنے بیٹے کو دے کر اس سے واپس لے سکتا ہے“۔ طاؤس کہتے ہیں: قے کر کے اسے چاٹنے کی بات میں سنتا تھا اور ( اس وقت ) میں چھوٹا تھا۔ میں یہ نہیں جان سکا تھا کہ آپ نے اسے بطور مثال بیان کیا ہے، ( تو اب سنو ) جو شخص ایسا کرے اس کی مثال کتے کی ہے جو قے کرتا ہے، پھر اسے چاٹتا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3693,
			"arabicnumber": 3693,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ دے کر جو شخص واپس لے لیتا ہے اس کی مثال کتے کی طرح ہے، کتا قے کرتا ہے اور پھر دوبارہ اپنے قے کیے ہوئے کو کھا لیتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3694,
			"arabicnumber": 3694,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ دے کر واپس لینے والے کی مثال کتے کی طرح ہے جو قے کرتا ہے اور دوبارہ اسی قے کو کھا لیتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3695,
			"arabicnumber": 3695,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”صدقہ دے کر واپس لینے والے کی مثال کتے کی طرح ہے جو قے کرتا ہے اور دوبارہ اسی قے کو کھا لیتا ہے“۔ اوزاعی کہتے ہیں: میں نے محمد بن علی بن الحسین کو یہ حدیث عطاء بن ابی رباح سے بیان کرتے ہوئے سنا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3696,
			"arabicnumber": 3696,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”ہبہ ( کر کے واپس ) لینے والا قے کر کے چاٹنے والے کی طرح ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3697,
			"arabicnumber": 3697,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہبہ کر کے واپس لینے والا قے کرے چاٹنے والے کی طرح ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3698,
			"arabicnumber": 3698,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہمارے لیے بری مثال ( زیبا ) نہیں ہبہ کر کے واپس لینے والا قے کر کے چاٹنے والے کی طرح ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3699,
			"arabicnumber": 3699,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہمارے لیے بری مثال ( زیبا ) نہیں، ہبہ کر کے واپس لینے والا کتے کی طرح ہے جو قے کر کے اسی کو چاٹ لیتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3700,
			"arabicnumber": 3700,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہمارے لیے بری مثال ( زیبا ) نہیں، ہبہ کر کے واپس لینے والا اس کتے کی طرح ہے جو قے کر کے کھا لیتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3701,
			"arabicnumber": 3701,
			"text": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہبہ کر کے واپس لے لینے والا کتے کی طرح ہے جو قے کرتا اور اپنے قے کو چاٹتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3702,
			"arabicnumber": 3702,
			"text": "عبداللہ بن عباس رضی الله عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”ہبہ کر کے واپس لینے والا قے کر کے چاٹنے والے کی طرح ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3703,
			"arabicnumber": 3703,
			"text": "عبداللہ بن عمر اور عبداللہ بن عباس رضی الله عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی کے لیے جائز نہیں ہے کہ وہ کسی کو کوئی عطیہ ( تحفہ ) دے پھر اسے واپس لے لے۔ سوائے باپ کے، جو وہ اپنی اولاد کو دے، اور اس شخص کی مثال جو کسی کو عطیہ دیتا ہے پھر اسے واپس لے لیتا ہے اس کتے کی ہے جو کھاتا جاتا ہے یہاں تک کہ جب اس کا پیٹ بھر جاتا ہے تو وہ قے کر دیتا ہے پھر اسی کو چاٹ لیتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3704,
			"arabicnumber": 3704,
			"text": "تابعی طاؤس سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”کسی کے لیے جائز نہیں ہے کہ وہ کسی کو کوئی چیز ہبہ کرے پھر اسے واپس لے لے سوائے باپ کے“۔ طاؤس کہتے ہیں کہ میں بچوں کو کہتے ہوئے سنتا تھا «يا عائدا في قيئه» ! اے اپنی قے کے چاٹنے والے، اور نہیں جانتا تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس کی مثال دی ہے یہاں تک کہ مجھے یہ حدیث پہنچی کہ رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے: ”اس شخص کی مثال جو ہبہ دے کر واپس لے لیتا ہے“، اور راوی نے کچھ ایسی بات ذکر کی جس کے معنی یہ تھے کہ اس کی مثال کتے کی ہے جو اپنے قے کو کھا لیتا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3705,
			"arabicnumber": 3705,
			"text": "طاؤس کہتے ہیں کہ مجھ سے ایک ایسے شخص نے خبر دی ہے جس نے رسول اللہ صلی اللہ علیہ وسلم کو پایا تھا ۱؎ کہ آپ صلی اللہ علیہ وسلم نے فرمایا: ”اس شخص کی مثال جو ہبہ کرتا ہے پھر اسے واپس لے لیتا ہے کتے کی مثال ہے۔ کتا کھاتا ہے پھر قے کرتا ہے پھر دوبارہ اسی قے کو کھا لیتا ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 18
			}
		}
	]
}