{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"36": "The Book of the Kind Treatment of Women"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3939,
			"arabicnumber": 3939,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”دنیا کی چیزوں میں سے عورتیں اور خوشبو میرے لیے محبوب بنا دی گئی ہیں اور میری آنکھوں کی ٹھنڈک نماز میں رکھی گئی ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "انس رضی الله عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عورتیں اور خوشبو میرے لیے محبوب بنا دی گئی ہیں اور میری آنکھوں کی ٹھنڈک نماز میں رکھی گئی ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ عورتوں کے بعد گھوڑوں سے زیادہ کوئی چیز رسول اللہ صلی اللہ علیہ وسلم کو محبوب نہ تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”جس کی دو بیویاں ہوں اور وہ ایک کے مقابلے دوسری طرف زیادہ میلان رکھے تو قیامت کے دن وہ اس طرح آئے گا کہ اس کا ایک پہلو جھکا ہوا ہو گا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اپنی بیویوں کے درمیان کچھ تقسیم کرتے تو برابر برابر کرتے، پھر فرماتے: اللہ! میرا یہ کام تو میرے دائرہ اختیار میں ہے، لہٰذا تو مجھے ملامت نہ کر ایسے کام کے سلسلے میں جو تیرے اختیار کا ہے اور مجھے اس میں کوئی اختیار نہیں۔ حماد بن زید نے یہ حدیث مرسل روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی بیویوں نے فاطمہ بنت رسول صلی اللہ علیہ وسلم کو رسول اللہ صلی اللہ علیہ وسلم کے پاس بھیجا، انہوں نے آپ سے اجازت طلب کی، آپ میرے ساتھ چادر میں لیٹے ہوئے تھے، آپ نے انہیں اجازت دی، وہ بولیں: اللہ کے رسول! آپ کی بیویوں نے مجھے آپ کے پاس بھیجا ہے وہ ابوقحافہ کی بیٹی ( عائشہ ) کے سلسلے میں آپ سے ۱؎ عدل کا مطالبہ کر رہی ہیں، اور میں خاموش ہوں، تو رسول اللہ صلی اللہ علیہ وسلم نے فاطمہ رضی اللہ عنہا سے فرمایا: اے میری بیٹی! کیا تم اس سے محبت نہیں کرتیں جس سے مجھے محبت ہے؟ وہ بولیں: کیوں نہیں! آپ نے فرمایا: تو تم بھی ان سے محبت کرو، فاطمہ رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے جب یہ بات سنی تو اٹھیں اور نبی اکرم صلی اللہ علیہ وسلم کی بیویوں کے پاس واپس آ کر انہیں وہ ساری بات بتائی جو انہوں نے آپ صلی اللہ علیہ وسلم سے کہی اور جو آپ نے ان ( فاطمہ ) سے کہی۔ وہ سب بولیں: ہم نہیں سمجھتے کہ تم نے ہمارا کام کر دیا، تم پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس جاؤ اور آپ سے کہو: آپ کی بیویاں آپ سے ابوقحافہ کی بیٹی کے تعلق سے عدل کی اپیل کرتی ہیں۔ فاطمہ رضی اللہ عنہا نے کہا: نہیں، اللہ کی قسم! میں ان کے سلسلے میں آپ سے کبھی کوئی بات نہیں کروں گی۔ عائشہ رضی اللہ عنہا کہتی ہیں: اب نبی اکرم صلی اللہ علیہ وسلم کی ازواج نے رسول اللہ صلی اللہ علیہ وسلم کے پاس زینب بنت جحش کو بھیجا اور زینب ہی ایسی تھیں جو نبی اکرم صلی اللہ علیہ وسلم کی بیویوں میں رسول اللہ صلی اللہ علیہ وسلم کے نزدیک میرے برابر کا درجہ رکھتی تھیں۔ میں نے کبھی بھی دین کے معاملے میں بہتر، اللہ سے ڈرنے والی، سچ بات کہنے والی، صلہ رحمی کرنے والی، بڑے بڑے صدقات کرنے والی، صدقہ و خیرات اور قرب الٰہی کے کاموں میں خود کو سب سے زیادہ کمتر کرنے والی زینب سے بڑھ کر کوئی عورت نہیں دیکھی سوائے اس کے کہ وہ مزاج کی تیز طرار تھیں لیکن ان کا غصہ بہت جلد رفع ہو جاتا تھا۔ چنانچہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اجازت طلب کی، رسول اللہ صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کے ساتھ چادر میں اسی طرح تھے کہ جب فاطمہ رضی اللہ عنہا آپ کے پاس آئی تھیں، رسول اللہ صلی اللہ علیہ وسلم نے انہیں اجازت دے دی، وہ بولیں: اللہ کے رسول! آپ کی بیویوں نے مجھے آپ کے پاس اس لیے بھیجا ہے کہ وہ سب ابوقحافہ کی بیٹی کے تعلق سے آپ سے عدل و انصاف کا مطالبہ کر رہی ہیں اور وہ مجھے برا بھلا کہنے لگیں اور خوب زبان درازی کی، میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہی تھی اور آپ کی نگاہ دیکھ رہی تھی کہ آیا آپ مجھے بھی ان کا جواب دینے کی اجازت دیتے ہیں، زینب رضی اللہ عنہا ابھی وہیں پر تھیں کہ میں نے اندازہ کر لیا کہ اگر میں انہیں جواب دوں تو رسول اللہ صلی اللہ علیہ وسلم کو برا نہیں لگے گا۔ چنانچہ جب میں نے انہیں برا بھلا کہا تو میں نے انہیں ذرا بھی ٹکنے نہیں دیا یہاں تک کہ میں ان سے آگے نکل گئی۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہ ابوبکر کی بیٹی ہے“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "اس سند سے بھی ہے کہ عائشہ رضی اللہ عنہا کہتی ہیں کہ پھر انہوں نے اسی طرح بیان کیا اور وہ اس میں ( صرف اتنا ) کہتی ہیں: نبی اکرم صلی اللہ علیہ وسلم کی بیویوں نے زینب کو بھیجا تو انہوں نے اجازت طلب کی، آپ نے انہیں اجازت دی، پھر وہ اسی طرح آگے کہتی ہیں، معمر نے اس کے برعکس عن الزہری، عن عروۃ، عن عائشہ کہہ کر روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم کی بیویاں اکٹھا ہوئیں اور انہوں نے فاطمہ رضی اللہ عنہا کو نبی اکرم صلی اللہ علیہ وسلم کے پاس بھیجا اور ان سے کہا: آپ کی بیویاں – اور ایسا کلمہ کہا جس کا مفہوم یہ ہے – ابوقحافہ کی بیٹی کے تعلق سے آپ سے مطالبہ کرتی ہیں کہ انصاف سے کام لیجئیے۔ چنانچہ وہ نبی اکرم صلی اللہ علیہ وسلم کے پاس گئیں، آپ عائشہ رضی اللہ عنہا کے ساتھ ان کی چادر میں تھے۔ انہوں نے آپ سے کہا: ( اللہ کے رسول! ) آپ کی بیویوں نے مجھے آپ کے پاس بھیجا ہے وہ ابوقحافہ کی بیٹی ( عائشہ ) کے سلسلے میں آپ سے عدل کا مطالبہ کر رہی ہیں، نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: ”کیا تمہیں مجھ سے محبت ہے؟“ کہا: جی ہاں! آپ نے فرمایا: ”تو تم بھی ان ( عائشہ ) سے محبت کرو“، عائشہ رضی اللہ عنہا کہتی ہیں: فاطمہ رضی اللہ عنہا نے نبی اکرم صلی اللہ علیہ وسلم کی بیویوں کے پاس واپس آ کر انہیں وہ ساری بات بتائی جو آپ نے ( فاطمہ سے ) کہی، وہ سب بولیں: تم نے ہمارے لیے کچھ بھی نہیں کیا، تم پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس جاؤ۔ فاطمہ نے کہا: نہیں، اللہ کی قسم! میں ان کے سلسلے میں آپ کے پاس کبھی نہیں جاؤں گی اور درحقیقت وہ اللہ کے رسول صلی اللہ علیہ وسلم کی بیٹی تھیں ۱؎، اب نبی اکرم صلی اللہ علیہ وسلم کی ازواج مطہرات نے ( رسول اللہ صلی اللہ علیہ وسلم کے پاس ) زینب بنت جحش رضی اللہ عنہا کو بھیجا۔ اور زینب ہی ایسی تھیں جو نبی اکرم صلی اللہ علیہ وسلم کی بیویوں میں ( رسول اللہ صلی اللہ علیہ وسلم کے نزدیک ) میرے برابر کا درجہ رکھتی تھیں۔ وہ بولیں: ( اللہ کے رسول! ) آپ کی بیویوں نے مجھے آپ کے پاس اس لیے بھیجا ہے کہ وہ سب ابوقحافہ کی بیٹی کے تعلق سے آپ سے عدل و انصاف کا مطالبہ کر رہی ہیں اور وہ مجھے برا بھلا کہنے لگیں۔ میں نبی اکرم صلی اللہ علیہ وسلم کو دیکھ رہی تھی اور آپ کی نگاہ دیکھ رہی تھی کہ آیا آپ مجھے بھی ان کا جواب دینے کی اجازت دیتے ہیں؟ زینب رضی اللہ عنہا ابھی وہیں پر تھیں کہ میں نے اندازہ کر لیا کہ اگر میں انہیں جواب دوں تو رسول اللہ صلی اللہ علیہ وسلم کو برا نہیں لگے گا۔ چنانچہ ( جب ) میں نے انہیں برا بھلا کہا ( تو میں نے انہیں ذرا بھی ٹکنے نہیں دیا ) یہاں تک کہ میں ان سے آگے نکل گئی، نبی اکرم صلی اللہ علیہ وسلم نے زینب رضی اللہ عنہا سے فرمایا: ”یہ ابوبکر کی بیٹی ہے“۔ عائشہ رضی اللہ عنہا کہتی ہیں: میں نے کبھی بھی دین کے معاملے میں بہتر، اللہ سے ڈرنے والی، سچ بات کہنے والی اور صلہ رحمی کرنے والی، بڑے بڑے صدقات کرنے والی، صدقہ و خیرات اور قرب الٰہی کے کاموں میں خود کو سب سے زیادہ کمتر کرنے والی زینب رضی اللہ عنہا سے بڑھ کر کوئی عورت نہیں دیکھا سوائے اس کے کہ وہ مزاج کی تیز طرار تھیں لیکن ان کا غصہ بہت جلد رفع ہو جاتا تھا۔ ابوعبدالرحمٰن نسائی کہتے ہیں: اس ( روایت ) میں غلطی ہے صحیح وہی ہے جو اس سے پہلے گزری۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "ابوموسیٰ اشعری رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عورتوں پر عائشہ کی فضیلت ایسے ہی ہے جیسے ثرید کی تمام کھانوں پر“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”عورتوں پر عائشہ کی فضیلت ایسے ہی ہے جیسے ثرید کی سارے کھانوں پر“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3949,
			"arabicnumber": 3949,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اے ام سلمہ! مجھے عائشہ کے تعلق سے ایذا نہ دو، اس لیے کہ اللہ کی قسم! اس کے علاوہ کوئی عورت تم میں سے ایسی نہیں ہے جس کے لحاف میں میرے پاس وحی آئی ہو“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3950,
			"arabicnumber": 3950,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کی بیویوں نے ان سے بات کی کہ وہ نبی اکرم صلی اللہ علیہ وسلم سے بات کریں کہ لوگ عائشہ کی باری کے دن ہدیے اور تحفے بھیجتے ہیں اور آپ سے کہیں کہ ہمیں بھی خیر سے اسی طرح محبت ہے جیسے آپ کو عائشہ سے ہے، چنانچہ انہوں نے آپ سے گفتگو کی لیکن آپ نے انہیں کوئی جواب نہیں دیا، جب ان کی باری کا دن آیا تو انہوں نے پھر بات کی، آپ نے انہیں جواب نہیں دیا۔ انہوں ( بیویوں ) نے کہا: آپ صلی اللہ علیہ وسلم نے تمہیں کوئی جواب دیا؟ وہ بولیں: کوئی جواب نہیں دیا۔ انہوں نے کہا: تم چھوڑنا مت، جب تک کوئی جواب نہ دے دیں۔ ( یا یوں کہا: ) جب تک تم دیکھ نہ لو کہ آپ کیا جواب دیتے ہیں۔ جب پھر ان کی باری آئی تو انہوں نے آپ سے گفتگو کی، آپ صلی اللہ علیہ وسلم نے فرمایا: ”عائشہ کے تعلق سے مجھے اذیت نہ دو، اس لیے کہ عائشہ کے لحاف کے علاوہ تم میں سے کسی عورت کے لحاف میں ہوتے ہوئے میرے پاس وحی نہیں آئی“۔ ابوعبدالرحمٰن نسائی کہتے ہیں: عبدہ سے مروی یہ دونوں حدیثیں صحیح ہیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3951,
			"arabicnumber": 3951,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ لوگ ہدیے اور تحفے بھیجتے جس دن عائشہ کی باری ہوتی، وہ اس طرح رسول اللہ صلی اللہ علیہ وسلم کی خوشی چاہتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ اللہ تعالیٰ نے نبی اکرم صلی اللہ علیہ وسلم پر وحی نازل کی، میں آپ کے ساتھ تھی، میں اٹھی اور اپنے اور آپ کے درمیان دروازہ بند کر دیا، جب وحی ختم ہو گئی تو آپ نے مجھ سے فرمایا: ”عائشہ! جبرائیل تمہیں سلام کہہ رہے ہیں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3953,
			"arabicnumber": 3953,
			"text": "ام المؤمنین عائشہ رضی الله عنہا سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: ”جبرائیل تمہیں سلام کہہ رہے ہیں“، انہوں نے کہا: «وعلیکم السلام ورحمۃ اللہ وبرکاتہ» ( جبرائیل کو عائشہ نے سلام کا جواب دیا اور کہا: ) آپ تو وہ دیکھتے ہیں جو ہم نہیں دیکھتے“ ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3954,
			"arabicnumber": 3954,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”عائشہ! یہ جبرائیل ہیں، تمہیں سلام کہہ رہے ہیں۔ اور آگے ویسے ہی ہے جیسے اوپر گزرا“۔ ابوعبدالرحمٰن نسائی کہتے ہیں: یہ روایت ٹھیک ہے، پہلی والی غلط ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3955,
			"arabicnumber": 3955,
			"text": "انس بن مالک رضی الله عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم امہات المؤمنین میں سے ایک کے پاس تھے، آپ کی کسی دوسری بیوی نے ایک پیالہ کھانا بھیجا، پہلی بیوی نے ( غصہ سے کھانا لانے والے ) کے ہاتھ پر مارا اور پیالہ گر کر ٹوٹ گیا۔ نبی اکرم صلی اللہ علیہ وسلم نے برتن کے دونوں ٹکڑوں کو اٹھا کر ایک کو دوسرے سے جوڑا اور اس میں کھانا اکٹھا کرنے لگے اور فرماتے جاتے تھے: تمہاری ماں کو غیرت آ گئی ہے ( کہ میرے گھر اس نے کھانا کیوں بھیجا ) ، تم لوگ کھانا کھاؤ۔ لوگوں نے کھایا، پھر قاصد کو آپ نے روکے رکھا یہاں تک کہ جن کے گھر میں آپ تھے اپنا پیالہ لائیں تو آپ نے یہ صحیح سالم پیالہ قاصد کو عنایت کر دیا ۱؎ اور ٹوٹا ہوا پیالہ اس بیوی کے گھر میں رکھ چھوڑا جس نے اسے توڑا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3956,
			"arabicnumber": 3956,
			"text": "ام المؤمنین ام سلمہ رضی الله عنہا سے روایت ہے کہ وہ ایک پیالے میں کھانا لے کر رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ کے پاس آئیں۔ اتنے میں عائشہ رضی اللہ عنہا ایک چادر پہنے ہوئے آئیں، ان کے پاس ایک پتھر تھا، جس سے انہوں نے وہ پیالا مار کر دو ٹکرے کر دیا۔ نبی اکرم صلی اللہ علیہ وسلم پیالے کے دونوں ٹکڑے جوڑنے لگے اور کہہ رہے تھے: تم لوگ کھاؤ، تمہاری ماں کو غیرت آ گئی، آپ نے دو بار کہا۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے عائشہ رضی اللہ عنہا کا پیالا لیا اور وہ ام سلمہ رضی اللہ عنہا کو بھجوا دیا اور ام سلمہ رضی اللہ عنہا کا پیالا عائشہ رضی اللہ عنہا کو دے دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3957,
			"arabicnumber": 3957,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ میں نے ام المؤمنین صفیہ رضی اللہ عنہا کے جیسی کھانا بنانے والی کوئی عورت نہیں دیکھی، انہوں نے نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک برتن بھیجا جس میں کھانا تھا، میں اپنے کو قابو میں نہ رکھ سکی اور میں نے برتن توڑ دیا پھر میں نے نبی اکرم صلی اللہ علیہ وسلم سے اس کے کفارے کے متعلق پوچھا تو آپ نے فرمایا: ”برتن کے جیسا برتن اور کھانے کے جیسا کھانا“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3958,
			"arabicnumber": 3958,
			"text": "ام المؤمنین عائشہ رضی الله عنہا بیان کرتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ام المؤمنین زینب بنت جحش رضی اللہ عنہا کے پاس ٹھہرے ہوئے تھے اور ان کے ہاں شہد پی رہے تھے، میں نے اور حفصہ رضی اللہ عنہا نے باہم مشورہ کیا کہ ہم میں سے جس کے پاس نبی اکرم صلی اللہ علیہ وسلم آئیں تو وہ کہے: مجھے آپ سے مغافیر ۱؎ کی بو آ رہی ہے، آپ نے مغافیر کھایا ہے۔ آپ ان میں سے ایک کے پاس گئے تو اس نے یہی کہا، آپ نے فرمایا: ”نہیں، میں نے تو زینب بنت جحش کے پاس شہد پیا ہے اور اب آئندہ نہیں پیوں گا“۔ تو عائشہ اور حفصہ ( رضی اللہ عنہما ) کی وجہ سے یہ آیت «يا أيها النبي لم تحرم ما أحل اللہ لك» ”اے نبی! جس چیز کو اللہ تعالیٰ نے حلال کر دیا ہے اسے آپ کیوں حرام کرتے ہیں“۔ ( التحریم: ۱ ) اور «إن تتوبا إلى اللہ» ” ( اے نبی کی دونوں بیویو! ) اگر تم دونوں اللہ کے سامنے توبہ کر لو ( تو بہت بہتر ہے ) “۔ ( التحریم: ۴ ) نازل ہوئی اور آپ صلی اللہ علیہ وسلم کے اس قول: میں نے تو شہد پیا ہے کی وجہ سے یہ آیت: «وإذ أسر النبي إلى بعض أزواجه حديثا» ”اور یاد کر جب نبی نے اپنی بعض عورتوں سے ایک پوشیدہ بات کہی“ ( التحریم: ۳ ) نازل ہوئی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3959,
			"arabicnumber": 3959,
			"text": "انس رضی الله عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی ایک لونڈی تھی، آپ اس سے مجامعت فرماتے تھے۔ عائشہ اور حفصہ رضی اللہ عنہا ایک دن آپ کے پاس بیٹھی رہیں یہاں تک کہ آپ نے اسے اپنے اوپر حرام کر لی، تو اللہ تعالیٰ نے یہ آیت: «يا أيها النبي لم تحرم ما أحل اللہ لك» إِلَى آخِرِ الآيَةِ ”اے نبی! آپ اس چیز کو اپنے لیے کیوں حرام قرار دے رہے ہیں جسے اللہ تعالیٰ نے آپ کے لیے حلال رکھا ہے“۔ ( التحریم: ۱ ) مکمل آیت نازل فرمائی ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3960,
			"arabicnumber": 3960,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کی تفتیش کر رہی تھی چنانچہ میں نے اپنا ہاتھ آپ کے بالوں میں داخل کیا تو آپ نے فرمایا: ”تمہارے پاس تمہارا شیطان آ گیا ہے“۔ میں نے عرض کیا: کیا آپ کا شیطان نہیں ہے؟ آپ نے فرمایا: ”کیوں نہیں، اللہ کی قسم، لیکن اللہ تعالیٰ نے مجھے اس سے محفوظ رکھا ہے لہٰذا میں اس سے محفوظ رہتا ہوں“۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3961,
			"arabicnumber": 3961,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ ایک رات میں نے رسول اللہ صلی اللہ علیہ وسلم کو غائب پایا، مجھے گمان ہوا کہ آپ کسی بیوی کے پاس گئے ہوں گے۔ میں آپ کو تلاش کرنے لگی، دیکھا کہ آپ رکوع یا سجدہ میں ہیں اور کہہ رہے ہیں: «سبحانك و بحمدك لا إله إلا أنت» ”پاک ہے تیری ذات، تیری ہی تعریف ہے اور تیرے سوا کوئی حقیقی معبود نہیں“۔ میں نے کہا: میرے ماں باپ آپ پر قربان ہوں، آپ کچھ کر رہے ہیں اور میں کچھ اور ہی گمان کر رہی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3962,
			"arabicnumber": 3962,
			"text": "ام المؤمنین عائشہ رضی الله عنہا کہتی ہیں کہ ایک رات میں نے رسول اللہ صلی اللہ علیہ وسلم کو غائب پایا، مجھے گمان ہوا کہ آپ اپنی کسی بیوی کے پاس گئے ہوں گے، میں آپ کو تلاش کرنے لگی پھر میں لوٹی تو دیکھا کہ آپ رکوع یا سجدے میں ہیں، آپ کہہ رہے ہیں: «سبحانك و بحمدك لا إله إلا أنت» میں نے عرض کیا: میرے ماں باپ آپ پر قربان ہوں، آپ کچھ کر رہے ہیں اور میں کچھ اور ہی گمان کر رہی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": 3963,
			"text": "محمد بن قیس سے روایت ہے کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا کو کہتے ہوئے سنا کہ کیا میں تم سے نبی اکرم صلی اللہ علیہ وسلم کا اور اپنا ایک واقعہ نہ بیان کروں؟ ہم نے عرض کیا: کیوں نہیں؟ وہ بولیں: جس رات میری باری تھی، آپ عشاء سے لوٹے اور جوتے اپنے پیروں کے پاس رکھ لیے، اپنی چادر رکھی اور بستر پر اپنا تہبند بچھایا، ابھی تھوڑی ہی دیر ہوئی تھی، جب آپ کو اندازہ ہوا کہ میں سو چکی ہوں، تو آپ نے آہستہ سے جوتے پہنے اور آہستہ سے چادر لی پھر دھیرے سے دروازہ کھولا اور باہر نکل کر دھیرے سے بند کر دیا۔ میں نے بھی اوڑھنی اپنے سر پر ڈالی، چادر اوڑھی اور پھر تہبند پہن کر آپ کے پیچھے پیچھے چل پڑی، یہاں تک کہ آپ مقبرہ بقیع آئے، تو آپ نے اپنے ہاتھ تین بار اٹھائے، قیام کو طویل کیا پھر پلٹے تو میں بھی پلٹی، اور تیزی سے چلے، میں بھی تیزی سے چلی، پھر آپ نے رفتار کچھ اور تیز کر دی تو میں نے بھی تیز کر دی پھر آپ دوڑنے لگے تو میں بھی دوڑنے لگی، میں آپ سے آگے نکل گئی اور اندر داخل ہو گئی اور اب میں لیٹی ہی تھی کہ آپ اندر آ گئے اور فرمایا: ”کیا بات ہے عائشہ! سانس کیوں پھولی ہے؟ ( سلیمان بن داود نے کہا: میرا خیال ہے کہ میرے شیخ نے یوں فرمایا: «حشیا»،‏‏‏‏ یعنی ) تمہاری سانسیں کیوں پھول رہی ہیں؟“ آپ نے فرمایا: ”بتاؤ ورنہ مجھے لطیف و خبیر یعنی اللہ بتا دے گا“۔ میں نے کہا: اللہ کے رسول! میرے ماں باپ آپ پر قربان ہوں، پھر انہوں نے آپ کو پورا واقعہ بتایا، آپ نے فرمایا: ”تو تمہارا ہی سایہ تھا جو میں نے اپنے آگے دیکھا؟“ میں نے کہا: ہاں، پھر آپ نے میرے سینے پر ایک ایسی تھپکی ماری کہ مجھے تکلیف ہوئی اور فرمایا: ”کیا تم سمجھتی ہو کہ اللہ اور اس کا رسول تم پر ظلم کرے گا؟“ عائشہ رضی اللہ عنہا نے کہا: کوئی بات چاہے لوگوں سے کتنی ہی مخفی رہے، لیکن اللہ تعالیٰ تو اسے بخوبی جانتا ہے۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”ہاں، پھر فرمایا: جبرائیل علیہ السلام میرے پاس آئے جب تم نے مجھے دیکھا، لیکن وہ اندر تمہارے سامنے نہیں آ سکتے تھے کہ تم اپنے کپڑے اتار چکی تھیں، انہوں نے مجھے پکارا اور تم سے چھپایا، میں نے انہیں جواب دیا اور میں نے اسے تم سے چھپایا ( یعنی دھیرے سے کہا ) اور میں سمجھا کہ تم سو چکی ہو، تو میں نے مناسب نہیں سمجھا کہ تمہیں جگاؤں۔ اور مجھے ڈر تھا کہ تم تنہائی میں وحشت نہ کھاؤ، تو انہوں ( جبرائیل ) نے مجھے حکم دیا کہ میں اہل بقیع کے پاس جاؤں اور ان کے لیے استغفار کروں“۔ حجاج بن محمد نے سند اس کے برعکس یوں بیان کی «عن ابن جریج، عن ابن ابی ملیکۃ، عن محمد بن قیس» ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": 3964,
			"text": "محمد بن قیس بن مخرمہ کہتے ہیں کہ انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا کو کہتے ہوئے سنا: کیا میں تم سے نبی اکرم صلی اللہ علیہ وسلم کا اور اپنا ایک واقعہ نہ بیان کروں؟ ہم نے عرض کیا: کیوں نہیں؟ وہ بولیں: جس رات میری باری تھی، نبی اکرم صلی اللہ علیہ وسلم میرے یہاں تھے، آپ عشاء سے لوٹے اور جوتے اپنے پیروں کے پاس رکھ لیے، اپنی چادر رکھی اور بستر پر تہبند بچھایا، ابھی تھوڑی ہی دیر ہوئی تھی جب آپ کو اندازہ ہوا کہ میں سو چکی ہوں، آپ نے آہستہ سے جوتے پہنے اور آہستہ سے چادر لی پھر دھیرے سے دروازہ کھولا اور باہر نکل کر دھیرے سے بھیڑ دیا، میں نے بھی اوڑھنی اپنے سر پر ڈالی، چادر اوڑھی، پھر تہبند پہن کر آپ کے پیچھے پیچھے چل پڑی، یہاں تک کہ آپ مقبرہ بقیع آئے، تو آپ نے اپنے ہاتھ تین بار اٹھائے، قیام کو طویل کیا پھر پلٹے تو میں بھی پلٹی، اور تیزی سے چلے، میں بھی تیزی سے چلی، پھر آپ نے رفتار کچھ اور تیز کر دی تو میں نے بھی رفتار تیز کر دی پھر آپ دوڑنے لگے تو میں بھی دوڑنے لگی اور میں آپ سے آگے نکل گئی اور اندر داخل ہو گئی اور اب میں لیٹی ہی تھی کہ آپ اندر آ گئے اور فرمایا: ”کیا بات ہے عائشہ! پیٹ کیسا پھولا ہے، تمہاری سانسیں کیوں پھول رہی ہیں؟ بتاؤ ورنہ مجھے لطیف و خبیر یعنی اللہ تعالیٰ بتا دے گا“۔ میں نے کہا: اللہ کے رسول! میرے ماں باپ آپ پر قربان ہوں، پھر انہوں نے آپ کو پورا واقعہ بتایا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ”تو تمہارا ہی سایہ تھا جو میں نے اپنے آگے دیکھا؟“ میں نے کہا: ہاں، پھر آپ نے میرے سینے پر ایک ایسی تھپکی ماری کہ مجھے تکلیف ہوئی اور فرمایا: ”کیا تم سمجھتی ہو کہ اللہ اور اس کا رسول تم پر ظلم کرے گا؟“ انہوں نے کہا: کوئی بات چاہے لوگوں سے کتنی ہی مخفی رہے، لیکن اللہ تعالیٰ تو اسے جان ہی لے گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں، ( اور ) کہا: جبرائیل میرے پاس آئے جب تم نے مجھے دیکھا، لیکن وہ اندر تمہارے سامنے نہیں آ سکتے تھے کہ تم اپنے کپڑے اتار چکی تھیں۔ انہوں نے مجھے پکارا اور تم سے چھپایا، میں نے انہیں جواب دیا اور میں نے اسے تم سے چھپایا ( یعنی دھیرے سے کہا ) اور میں سمجھا کہ تم سو چکی ہو، اور مجھے ڈر تھا کہ تم تنہائی میں وحشت نہ کھاؤ، تو انہوں ( جبرائیل ) نے مجھے حکم دیا کہ میں اہل بقیع کے پاس جاؤں اور ان کے لیے استغفار کروں۔ عاصم نے یہ حدیث دوسرے الفاظ کے ساتھ عبداللہ بن عامر سے اور انہوں نے عائشہ رضی اللہ عنہا سے روایت کی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": 3965,
			"text": "اس سند سے بھی عائشہ رضی الله عنہا کہتی ہیں کہ رات کو آپ صلی اللہ علیہ وسلم نے مجھے غائب پایا اور پھر پوری حدیث بیان کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		}
	]
}