{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"4": "The Book of Ghusl and Tayammum"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 396,
			"arabicnumber": 396,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی ٹھہرے ہوئے پانی میں غسل نہ کرے، اور وہ جنبی ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 397,
			"arabicnumber": 397,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: آدمی ٹھہرے ہوئے پانی میں ہرگز پیشاب نہ کرے، پھر اسی سے غسل یا وضو کرے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 398,
			"arabicnumber": 398,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ ٹھہرے ہوئے پانی میں پیشاب کیا جائے پھر اس میں جنابت کا غسل کیا جائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے منع فرمایا: ٹھہرے ہوئے پانی میں پیشاب کیا جائے، پھر اسی سے غسل کیا جائے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 400,
			"arabicnumber": 400,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ تم میں سے کوئی ٹھہرے ہوئے پانی میں جو بہتا نہ ہو ہرگز پیشاب نہ کرے، پھر اسی سے غسل بھی کرے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 401,
			"arabicnumber": 401,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو اللہ اور یوم آخرت پر ایمان رکھتا ہو بغیر تہبند کے حمام میں داخل نہ ہو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 402,
			"arabicnumber": 402,
			"text": "عبداللہ بن ابی اوفی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم دعا کرتے تھے کہ اے اللہ! مجھے گناہوں اور خطاؤں سے پاک کر دے، اے اللہ! مجھے اس سے اسی طرح پاک کر دے جیسے سفید کپڑا میل سے پاک کیا جاتا ہے، اے اللہ! مجھے برف، اولے اور ٹھنڈے پانی کے ذریعہ پاک کر دے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 403,
			"arabicnumber": 403,
			"text": "ابن ابی اوفی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم فرماتے تھے: اے اللہ! مجھے برف، اولے اور ٹھنڈے پانی کے ذریعہ پاک کر دے، اے اللہ! مجھے گناہوں سے اسی طرح پاک کر دے جس طرح سفید کپڑے کو میل سے پاک کیا جاتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 404,
			"arabicnumber": 404,
			"text": "عبداللہ بن ابوقیس کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے پوچھا کہ حالت جنابت میں رسول اللہ صلی اللہ علیہ وسلم کیسے سوتے تھے؟ کیا آپ سونے سے پہلے غسل کرتے تھے یا غسل سے پہلے سوتے تھے؟ انہوں نے کہا: آپ صلی اللہ علیہ وسلم یہ سب کرتے تھے، کبھی غسل کر کے سوتے اور کبھی ( صرف ) وضو کر کے سو جاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 405,
			"arabicnumber": 405,
			"text": "غضیف بن حارث کہتے ہیں کہ میں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس آیا، تو میں نے ان سے سوال کیا اور کہا: رسول اللہ صلی اللہ علیہ وسلم رات کے ابتدائی حصہ میں غسل کرتے تھے یا آخری حصے میں؟ تو انہوں نے کہا: دونوں طرح سے ( کرتے تھے ) ، کبھی رات کے ابتدائی حصہ میں غسل کرتے، اور کبھی آخری حصہ میں، اس پر میں نے کہا: اس اللہ کی تعریف ہے جس نے شریعت مطہرہ والے معاملہ کے اندر گنجائش رکھی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 406,
			"arabicnumber": 406,
			"text": "یعلیٰ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو کھلی جگہ غسل کرتے دیکھا تو منبر پر چڑھے، اور اللہ کی حمد و ثنا بیان کی اور فرمایا: بیشک اللہ تعالیٰ «حلیم» بردبار ، «حیی» باحیاء اور «ستر» پردہ پوشی پسند فرمانے والا ہے، حیاء اور پردہ پوشی کو پسند کرتا ہے، تو جب تم میں سے کوئی غسل کرے تو پردہ کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 407,
			"arabicnumber": 407,
			"text": "یعلیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بیشک اللہ عزوجل «ستر» پردہ پوشی کرنے والا ہے، تو جب تم میں سے کوئی غسل کرنا چاہے تو کسی چیز سے پردہ کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 408,
			"arabicnumber": 408,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے لیے پانی رکھا، پھر میں نے آپ کے لیے پردہ کیا، پھر آپ نے غسل کا ذکر کیا، پھر میں آپ کے پاس ایک کپڑا لے کر آئی تو آپ نے اسے نہیں ( لینا ) چاہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 409,
			"arabicnumber": 409,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ایوب علیہ السلام ننگے غسل کر رہے تھے ۱؎ کہ اسی دوران ان کے اوپر سونے کی ٹڈی گری، تو وہ اسے اپنے کپڑے میں سمیٹنے لگے، تو اللہ عزوجل نے انہیں آواز دی: ایوب! کیا میں نے تمہیں بے نیاز نہیں کیا ہے؟ انہوں نے کہا: ہاں، کیوں نہیں میرے رب! لیکن تیری برکتوں سے میں بے نیاز نہیں ہو سکتا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 410,
			"arabicnumber": 410,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ایک برتن سے جس کا نام فرق تھا غسل کرتے تھے، اور میں اور آپ دونوں ایک ہی برتن سے غسل کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 411,
			"arabicnumber": 411,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم اور میں دونوں ایک ہی برتن سے غسل کرتے تھے، ہم اس سے لپ ( بھربھر کر ) لیتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 412,
			"arabicnumber": 412,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں اور رسول اللہ صلی اللہ علیہ وسلم دونوں ایک برتن سے غسل جنابت کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 413,
			"arabicnumber": 413,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے اپنے آپ کو دیکھا کہ میں رسول اللہ صلی اللہ علیہ وسلم سے برتن کے سلسلے میں کھینچا تانی کر رہی ہوں، میں اور آپ دونوں اسی سے غسل کر رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 414,
			"arabicnumber": 414,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں اور رسول اللہ صلی اللہ علیہ وسلم دونوں ایک برتن سے غسل کرتے تھے، میں چاہتی کہ آپ سے پہلے میں نہا لوں اور آپ چاہتے کہ مجھ سے پہلے آپ نہا لیں یہاں تک کہ آپ صلی اللہ علیہ وسلم فرماتے: تم میرے لیے چھوڑ دو ، اور میں کہتی: آپ میرے لیے چھوڑ دیجئیے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 415,
			"arabicnumber": 415,
			"text": "ام ہانی رضی اللہ عنہا کہتی ہیں کہ وہ فتح مکہ کے دن نبی اکرم صلی اللہ علیہ وسلم کے پاس آئیں، آپ ایک ٹب سے غسل کر رہے تھے جس میں گندھا ہوا آٹا لگا تھا، اور آپ کو ( فاطمہ رضی اللہ عنہا ۱؎ ) کپڑا سے پردہ کیے ہوئے تھیں، تو جب آپ غسل کر چکے، تو آپ نے چاشت کی نماز پڑھی، اور میں نہیں جان سکی کہ آپ نے کتنی رکعت پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 416,
			"arabicnumber": 416,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں نے اپنے آپ کو دیکھا ہے کہ میں اور رسول اللہ صلی اللہ علیہ وسلم دونوں اس برتن سے غسل کرتے تھے، تو میں نے نظر اٹھا کر دیکھا تو وہاں ایک ڈول رکھا ہوا تھا جو ایک صاع کے برابر تھا، یا اس سے کچھ کم، ( اور وہ اسی کی طرف اشارہ کر رہی تھیں ) ( وہ کہہ رہی تھیں کہ ) ہم دونوں غسل ایک ساتھ شروع کرتے، تو میں اپنے سر پر اپنے ہاتھوں سے تین مرتبہ پانی بہاتی، اور میں اپنا بال نہیں کھولتی تھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 417,
			"arabicnumber": 417,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ میں ( اپنے جسم پر ) تارکول مل لوں یہ میرے لیے زیادہ پسندیدہ ہے اس بات سے کہ میں اس حال میں احرام باندھوں کہ میرے جسم سے خوشبو پھوٹ رہی ہو، تو ( محمد بن منتشر کہتے ہیں ) میں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس آیا، اور میں نے انہیں عبداللہ بن عمر رضی اللہ عنہم کی یہ بات بتائی تو ام المؤمنین رضی اللہ عنہا نے کہا: میں نے خود رسول اللہ صلی اللہ علیہ وسلم کو خوشبو لگائی تھی، اور آپ نے اپنی بیویوں کا چکر لگایا ۱؎ آپ نے محرم ہو کر صبح کی ( اس وقت آپ کے جسم پر خوشبو کا اثر باقی تھا ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 418,
			"arabicnumber": 418,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی نماز کے وضو کی طرح وضو کیا، البتہ اپنے دونوں پاؤں نہیں دھوئے، اور ( وضو سے پہلے ) آپ نے اپنی شرمگاہ اور اس پر لگی ہوئی گندگی دھوئی، پھر اپنے جسم پر پانی بہایا، پھر اپنے دونوں پاؤں کو ہٹایا اور انہیں دھویا، یہی ( آپ کے ) غسل جنابت کا طریقہ تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 419,
			"arabicnumber": 419,
			"text": "ام المؤمنین میمونہ بنت حارث رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب غسل جنابت کرتے تو پہلے اپنے دونوں ہاتھ دھوتے، پھر اپنے داہنے ہاتھ سے بائیں ہاتھ پر پانی ڈالتے، اور اپنی شرمگاہ دھوتے، پھر زمین پر اپنا ہاتھ مارتے، پھر اسے ملتے، پھر دھوتے، پھر نماز کے وضو کی طرح وضو کرتے، پھر اپنے سر اور باقی جسم پر پانی ڈالتے، پھر وہاں سے ہٹ کر اپنے دونوں پاؤں دھوتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 420,
			"arabicnumber": 420,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب غسل جنابت کرتے تو اپنے دونوں ہاتھ دھوتے، پھر نماز کے وضو کی طرح وضو کرتے، پھر غسل کرتے، پھر ہاتھ سے اپنے بال کا خلال کرتے، یہاں تک کہ جب آپ جان لیتے کہ اپنی کھال تر کر لی ہے تو اس پر تین مرتبہ پانی بہاتے، پھر اپنے تمام جسم کو دھوتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 421,
			"arabicnumber": 421,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم طہارت میں، جوتا پہننے میں، اور کنگھا کرنے میں جہاں تک ہو سکتا تھا داہنے کو پسند فرماتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 422,
			"arabicnumber": 422,
			"text": "ام المؤمنین عائشہ اور ابن عمر رضی اللہ عنہم سے روایت ہے کہ عمر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے غسل جنابت کے متعلق سوال کیا، اس جگہ دونوں احادیث ( عائشہ رضی اللہ عنہا اور ابن عمر رضی اللہ عنہما کی ) متفق ہو جاتی ہیں کہ آپ ( غسل ) شروع کرتے تو پہلے اپنے داہنے ہاتھ پر دو یا تین بار پانی ڈالتے، پھر اپنا داہنا ہاتھ برتن میں داخل کرتے، اس سے اپنی شرمگاہ پر پانی ڈالتے، اور آپ کا بایاں ہاتھ شرمگاہ پر ہوتا، تو جو گندگی وہاں ہوتی دھوتے یہاں تک کہ اسے صاف کر دیتے، پھر اگر چاہتے تو بایاں ہاتھ مٹی پر ملتے، پھر اس پر پانی بہا کر صاف کر لیتے، پھر اپنے دونوں ہاتھ تین بار دھوتے، ناک میں پانی ڈالتے، کلی کرتے اور اپنا چہرہ اور دونوں بازووں تین تین مرتبہ دھوتے، یہاں تک کہ جب اپنے سر کے پاس پہنچتے تو اس کا مسح نہیں کرتے، اس کے اوپر پانی بہا لیتے، تو اسی طرح جیسا کہ ذکر کیا گیا رسول اللہ صلی اللہ علیہ وسلم کا غسل ( جنابت ) ہوتا تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 423,
			"arabicnumber": 423,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب غسل جنابت کرتے تو اپنے دونوں ہاتھ دھوتے، پھر اپنی نماز کے وضو کی طرح وضو کرتے، پھر اپنی انگلیوں کے ذریعہ سر کا خلال کرتے یہاں تک کہ جب آپ کو یہ محسوس ہو جاتا کہ سر کی پوری جلد تک پانی پہنچا لیا ہے، تو اپنے سر پر تین لپ پانی ڈالتے، پھر پورے جسم کو دھوتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 424,
			"arabicnumber": 424,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب غسل جنابت کرتے تو دودھ دوہنے کے برتن ۱؎ کی طرح ایک برتن منگاتے، اور اس سے اپنے لپ سے پانی لیتے اور اپنے سر کے داہنے حصہ سے شروع کرتے، پھر بائیں سے، پھر اپنے دونوں لپ سے پانی لیتے، اور انہیں سے اپنے سر پر ڈالتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"text": "جبیر بن مطعم رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم کے سامنے غسل ( جنابت ) کا ذکر کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: رہا میں تو میں اپنے سر پر تین مرتبہ پانی ڈالتا ہوں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 426,
			"arabicnumber": 426,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم جب غسل کرتے تو اپنے سر پر تین مرتبہ پانی بہاتے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 427,
			"arabicnumber": 427,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ ایک عورت نے نبی اکرم صلی اللہ علیہ وسلم سے سوال کیا: اللہ کے رسول! میں طہارت کے وقت کیسے غسل کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم مشک کا ایک پھاہا لو، اور اس سے پاکی حاصل کرو ، اس نے کہا: میں اس سے کیسے پاکی حاصل کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اس سے پاکی حاصل کرو ، اس نے ( پھر ) عرض کیا: میں اس سے کیسے پاکی حاصل کروں؟ پھر رسول اللہ صلی اللہ علیہ وسلم نے سبحان اللہ کہا، اور اس سے اپنا رخ مبارک پھیر لیا، عائشہ رضی اللہ عنہا اس بات کو سمجھ گئیں جو رسول اللہ صلی اللہ علیہ وسلم بتانا چاہ رہے تھے، آپ کہتی ہیں: تو میں نے اسے پکڑ کر اپنی طرف کھینچ لیا، اور رسول اللہ صلی اللہ علیہ وسلم جو چاہ رہے تھے اسے بتایا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 428,
			"arabicnumber": 428,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے جنابت کا غسل کیا، تو آپ نے اپنی شرمگاہ کو دھویا، اور زمین یا دیوار پر اپنا ہاتھ رگڑا، پھر نماز کے وضو کی طرح وضو کیا، پھر اپنے سر اور پورے جسم پر پانی بہایا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 429,
			"arabicnumber": 429,
			"text": "محمد (باقر) کہتے ہیں: ہم لوگ جابر بن عبداللہ رضی اللہ عنہم کے پاس آئے، اور ہم نے ان سے حجۃ الوداع کے متعلق دریافت کیا، تو انہوں نے ہم سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم پچیس ذی قعدہ کو ( مدینہ سے ) نکلے، ہم آپ کے ساتھ تھے، یہاں تک کہ جب آپ ذوالحلیفہ آئے تو اسماء بنت عمیس رضی اللہ عنہا نے محمد بن ابوبکر کو جنا، تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھوایا کہ میں کیا کروں؟ آپ نے فرمایا: تم غسل کر لو، پھر لنگوٹ باندھ لو، پھر ( احرام باندھ کر ) لبیک پکارو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 430,
			"arabicnumber": 430,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم غسل کے بعد وضو نہیں کرتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 431,
			"arabicnumber": 431,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کو خوشبو لگاتی تھی، پھر آپ اپنی بیویوں کے پاس جاتے ۱؎ پھر آپ محرم ہو کر صبح کرتے، اور آپ کے جسم سے خوشبو پھوٹتی ہوتی ۲؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 432,
			"arabicnumber": 432,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مجھے پانچ چیزیں ایسی دی گئی ہیں جو مجھ سے پہلے کسی کو نہیں دی گئیں ۱؎: ایک مہینہ کی مسافت پر رعب کے ذریعہ میری مدد کی گئی ہے ۲؎، میرے لیے پوری روئے زمین مسجد اور پاکی کا ذریعہ بنا دی گئی ہے، تو میری امت کا کوئی فرد جہاں بھی نماز کا وقت پا لے، نماز پڑھ لے، اور مجھے شفاعت ( عظمیٰ ) عطا کی گئی ہے، یہ چیز مجھ سے پہلے کسی نبی کو نہیں دی گئی، اور میں سارے انسانوں کی طرف ( رسول بنا کر ) بھیجا گیا ہوں، اور ( مجھ سے پہلے ) نبی خاص اپنی قوم کے لیے بھیجے جاتے تھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 433,
			"arabicnumber": 433,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ دو آدمیوں نے تیمم کر کے نماز پڑھ لی، پھر انہیں وقت کے اندر ہی پانی مل گیا، تو ان میں سے ایک شخص نے وضو کر کے وقت کے اندر نماز دوبارہ پڑھ لی، اور دوسرے نے نماز نہیں دہرائی، ان دونوں نے نبی اکرم صلی اللہ علیہ وسلم سے اس کے متعلق سوال کیا، تو آپ نے اس شخص سے جس نے نماز نہیں لوٹائی تھی فرمایا: تم نے سنت کے موافق عمل کیا، اور تمہاری نماز تمہیں کفایت کر گئی ، اور دوسرے سے فرمایا: رہے تم تو تمہارے لیے دوہرا اجر ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 434,
			"arabicnumber": 434,
			"text": "عطا بن یسار سے روایت ہے کہ دو آدمیوں نے ….، پھر یہی حدیث بیان کی۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 435,
			"arabicnumber": 435,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ علی، مقداد اور عمار رضی اللہ عنہم نے آپس میں بات کی، علی رضی اللہ عنہ نے کہا: میں ایک ایسا آدمی ہوں جسے بہت مذی آتی ہے اور میں رسول اللہ صلی اللہ علیہ وسلم سے ( اس کے بارے میں ) پوچھنے سے شرماتا ہوں، اس لیے کہ آپ کی صاحبزادی میرے عقد نکاح میں ہیں، تو تم دونوں میں سے کوئی آپ صلی اللہ علیہ وسلم سے پوچھے ( عطاء کہتے ہیں: ) ابن عباس رضی اللہ عنہا نے مجھ سے ذکر کیا کہ ان دونوں میں سے ایک نے ( میں اس کا نام بھول گیا ) آپ صلی اللہ علیہ وسلم سے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ مذی ہے، جب تم میں سے کوئی اسے پائے تو اسے اپنے جسم سے دھو لے، اور نماز کے وضو کی طرح وضو کرے ، راوی کو شک ہے «وضوئه للصلاة» کہا یا «كوضوء الصلاة» کہا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 436,
			"arabicnumber": 436,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ میں ایک ایسا آدمی تھا جسے بہت مذی آتی تھی، تو میں نے ایک آدمی کو حکم دیا، تو اس نے نبی اکرم صلی اللہ علیہ وسلم سے دریافت کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس میں وضو ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 437,
			"arabicnumber": 437,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ میں مذی کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے پوچھنے میں فاطمہ رضی اللہ عنہا کی وجہ سے شرما رہا تھا، تو میں نے مقداد کو حکم دیا، انہوں نے پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس میں وضو ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 438,
			"arabicnumber": 438,
			"text": "علی رضی اللہ عنہ سے روایت ہے کہ میں نے مقداد کو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجا کہ وہ ( جا کر ) آپ سے مذی کے متعلق پوچھیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: وضو کر لو، اور اپنی شرمگاہ پر پانی چھڑک لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 439,
			"arabicnumber": 439,
			"text": "سلیمان بن یسار کہتے ہیں کہ علی بن ابی طالب رضی اللہ عنہ نے مقداد کو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بھیجا کہ وہ آپ سے اس آدمی کے بارے میں پوچھیں جو مذی پاتا ہو، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: وہ اپنی شرمگاہ دھو لے، پھر وضو کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 440,
			"arabicnumber": 440,
			"text": "مقداد بن اسود رضی اللہ عنہ علی بن ابی طالب رضی اللہ عنہ سے روایت کرتے ہیں کہ علی رضی اللہ عنہ نے انہیں حکم دیا کہ وہ رسول اللہ صلی اللہ علیہ وسلم سے اس آدمی کے متعلق پوچھیں کہ جب وہ عورت سے قریب ہوتا ہو تو اسے مذی نکل آتی ہو، چونکہ میرے عقد نکاح میں آپ کی صاحبزادی ہیں اس لیے میں پوچھنے سے شرما رہا ہوں، تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے متعلق پوچھا، تو آپ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی اسے پائے تو اسے چاہیئے کہ اپنی شرمگاہ پر پانی چھڑک لے، اور اپنی نماز کے وضو کی طرح وضو کر لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 441,
			"arabicnumber": 441,
			"text": "سعید بن مسیب کہتے ہیں: مجھ سے ابوہریرہ رضی اللہ عنہ نے بیان کیا، وہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی رات میں اٹھے تو اپنا ہاتھ برتن میں داخل نہ کرے، یہاں تک کہ دو یا تین مرتبہ اس پر پانی ڈال لے، کیونکہ وہ نہیں جانتا کہ اس کا ہاتھ رات میں کہاں کہاں رہا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 442,
			"arabicnumber": 442,
			"text": "عبداللہ بن عباس رضی اللہ عنہم کہتے ہیں کہ میں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ ایک رات نماز پڑھی تو میں ( جا کر ) آپ کے بائیں جانب کھڑا ہو گیا، تو آپ صلی اللہ علیہ وسلم نے مجھے اپنی داہنی طرف کر لیا، اور نماز ادا کی، پھر لیٹے اور سو گئے اتنے میں مؤذن آپ کے پاس آیا ( اس نے آپ کو جگایا ) تو آپ نے ( جا کر ) نماز پڑھی، اور وضو نہیں کیا روایت مختصر ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 443,
			"arabicnumber": 443,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی اپنی نماز میں اونگھے تو وہ لوٹ جائے، اور ( جا کر ) سو جائے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 444,
			"arabicnumber": 444,
			"text": "بسرۃ رضی اللہ عنہا کہتی ہیں: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو اپنا ذکر ( عضو تناسل ) چھوئے، تو چاہیئے کہ وہ وضو کرے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 445,
			"arabicnumber": 445,
			"text": "بسرہ بنت صفوان رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی اپنا ہاتھ اپنے ذکر ( عضو تناسل ) تک لے جائے ( چھوئے ) تو چاہیئے کہ وہ وضو کرے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "عروہ بن زبیر مروان بن حکم سے روایت کرتے ہیں کہ انہوں نے کہا: شرمگاہ چھونے پر وضو ہے، تو مروان نے کہا: مجھ سے اسے بسرہ بنت صفوان نے بیان کیا ہے، تو عروہ نے بسرہ کے پاس ( اس کی تصدیق کے لیے آدمی ) بھیجا، تو انہوں نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے ان چیزوں کا ذکر کیا جن سے وضو کیا جاتا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ذکر چھونے سے بھی وضو ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 447,
			"arabicnumber": 447,
			"text": "بسرہ بنت صفوان رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو اپنا ذکر ( عضو تناسل ) چھوئے، تو نماز نہ پڑھے یہاں تک کہ وضو کر لے ۔ ابوعبدالرحمٰن ( امام نسائی ) کہتے ہیں: ہشام بن عروہ نے اس حدیث ۱؎ کو اپنے باپ سے نہیں سنا ہے، «واللہ سبحانہ تعالیٰ اعلم»۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 53
			}
		}
	]
}