{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"8": "The Book of the Masjids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 688,
			"arabicnumber": 688,
			"text": "عمرو بن عبسہ رضی اللہ عنہ سے روایت ہے کہ رسول اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے کوئی مسجد بنائی جس میں اللہ تعالیٰ کا ذکر کیا جاتا ہو، تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": 689,
			"text": "انس رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: قیامت کی نشانیوں میں سے یہ ہے کہ لوگ مساجد بنانے میں فخر و مباہات کریں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 690,
			"arabicnumber": 690,
			"text": "ابراہیم تیمی کہتے ہیں کہ گلی میں راستہ چلتے ہوئے میں اپنے والد ( یزید بن شریک ) کو قرآن سنا رہا تھا، جب میں نے آیت سجدہ پڑھی تو انہوں نے سجدہ کیا، میں نے کہا: ابا محترم! کیا آپ راستے میں سجدہ کرتے ہیں؟ کہا: میں نے ابوذر رضی اللہ عنہ سے سنا کہ وہ کہہ رہے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کہ سب سے پہلے کون سی مسجد بنائی گئی؟ تو آپ صلی اللہ علیہ وسلم نے فرمایا: مسجد الحرام ، میں نے عرض کیا: پھر کون سی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: مسجد الاقصیٰ ۱؎ میں نے پوچھا: ان دونوں کے درمیان کتنا فاصلہ ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: چالیس سال کا، اور پوری روئے زمین تمہارے لیے سجدہ گاہ ہے، تو تم جہاں کہیں نماز کا وقت پا جاؤ نماز پڑھ لو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 691,
			"arabicnumber": 691,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا کہتی ہیں کہ جس نے رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں نماز پڑھی تو میں نے اس کے متعلق آپ صلی اللہ علیہ وسلم کو کہتے ہوئے سنا ہے کہ: اس مسجد میں نماز پڑھنا دوسری مسجدوں میں نماز پڑھنے سے ہزار گنا افضل ہے، سوائے خانہ کعبہ کے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 692,
			"arabicnumber": 692,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں: رسول اکرم صلی اللہ علیہ وسلم، اسامہ بن زید، بلال اور عثمان بن طلحہ رضی اللہ عنہم خانہ کعبہ کے اندر داخل ہوئے، اور ان لوگوں نے خانہ کعبہ کا دروازہ بند کر لیا، پھر جب رسول اللہ صلی اللہ علیہ وسلم نے اسے کھولا تو سب سے پہلے اندر جانے والا میں تھا، پھر میں بلال رضی اللہ عنہ سے ملا تو میں نے ان سے پوچھا: کیا رسول اللہ صلی اللہ علیہ وسلم نے اس میں نماز پڑھی ہے؟ تو انہوں نے کہا: ہاں، آپ نے دونوں یمانی ستونوں یعنی رکن یمانی اور حجر اسود کے درمیان نماز پڑھی ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 693,
			"arabicnumber": 693,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: سلیمان بن داود علیہما السلام نے جب بیت المقدس کی تعمیر فرمائی تو اللہ تعالیٰ سے تین چیزیں مانگیں، اللہ عزوجل سے مانگا کہ وہ لوگوں کے مقدمات کے ایسے فیصلے کریں جو اس کے فیصلے کے موافق ہوں، تو انہیں یہ چیز دے دی گئی، نیز انہوں نے اللہ تعالیٰ سے ایسی سلطنت مانگی جو ان کے بعد کسی کو نہ ملی ہو، تو انہیں یہ بھی دے دی گئی، اور جس وقت وہ مسجد کی تعمیر سے فارغ ہوئے تو انہوں نے اللہ تعالیٰ سے دعا کی کہ جو کوئی اس مسجد میں صرف نماز کے لیے آئے تو اسے اس کے گناہوں سے ایسا پاک کر دے جیسے کہ وہ اس دن تھا جس دن اس کی ماں نے اسے جنا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 694,
			"arabicnumber": 694,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں: رسول اللہ صلی اللہ علیہ وسلم کی مسجد میں نماز پڑھنا دوسری مسجدوں میں نماز پڑھنے سے ہزار گنا افضل ہے سوائے خانہ کعبہ کے، کیونکہ رسول اللہ صلی اللہ علیہ وسلم آخری نبی ہیں اور آپ کی مسجد آخری مسجد ہے ۱؎ ابوسلمہ اور ابوعبداللہ کہتے ہیں: ہمیں شک نہیں کہ ابوہریرہ ہمیشہ رسول اللہ صلی اللہ علیہ وسلم کی حدیث ہی بیان کرتے تھے، اسی وجہ سے ہم نے ان سے یہ وضاحت طلب نہیں کی کہ یہ نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے یا خود ان کا قول ہے، یہاں تک کہ جب ابوہریرہ رضی اللہ عنہ وفات پا گئے تو ہم نے اس کا ذکر کیا تو ہم ایک دوسرے کو ملامت کرنے لگے کہ ہم نے اس سلسلے میں ابوہریرہ رضی اللہ عنہ سے کیوں نہیں گفتگو کر لی کہ اگر انہوں نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے تو اسے آپ کی طرف منسوب کریں، ہم اسی تردد میں تھے کہ ہم نے عبداللہ بن ابراہیم بن قارظ کی مجالست اختیار کی، تو ہم نے اس حدیث کا اور ابوہریرہ رضی اللہ عنہ سے حدیث پوچھنے میں جو ہم نے کوتاہی کی تھی دونوں کا ذکر کیا، تو عبداللہ بن ابراہیم نے ہم سے کہا: میں گواہی دیتا ہوں کہ میں نے ابوہریرہ رضی اللہ عنہ کو کہتے ہوئے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے کہ: بلاشبہ میں آخری نبی ہوں، اور یہ ( مسجد نبوی ) آخری مسجد ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 695,
			"arabicnumber": 695,
			"text": "عبداللہ بن زید رضی اللہ عنہ کہتے ہیں کہ رسول اکرم صلی اللہ علیہ وسلم نے فرمایا: جو حصہ میرے گھر ۱؎ اور میرے منبر کے درمیان ہے وہ جنت کی کیاریوں میں سے ایک کیاری ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 696,
			"arabicnumber": 696,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: میرے اس منبر کے پائے جنت میں گڑے ہوئے ہیں ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 697,
			"arabicnumber": 697,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ دو آدمی اس بارے میں لڑ پڑے کہ وہ کون سی مسجد ہے جس کی بنیاد اول دن سے تقویٰ پر رکھی گئی ہے، تو ایک شخص نے کہا: یہ مسجد قباء ہے، اور دوسرے نے کہا: یہ رسول اللہ صلی اللہ علیہ وسلم کی مسجد ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ میری یہ مسجد ہے ( یعنی مسجد نبوی ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 698,
			"arabicnumber": 698,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مسجد قباء ( کبھی ) سوار ہو کر اور ( کبھی ) پیدل جاتے تھے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 699,
			"arabicnumber": 699,
			"text": "سہل بن حنیف رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص ( اپنے گھر سے ) نکلے یہاں تک کہ وہ اس مسجد یعنی مسجد قباء میں آ کر اس میں نماز پڑھے تو اس کے لیے عمرہ کے برابر ثواب ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 700,
			"arabicnumber": 700,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( ثواب کی نیت سے ) صرف تین مسجدوں کے لیے سفر کیا جائے: ایک مسجد الحرام، دوسری میری یہ مسجد ( مسجد نبوی ) ، اور تیسری مسجد اقصی ( بیت المقدس ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 701,
			"arabicnumber": 701,
			"text": "طلق بن علی رضی اللہ عنہ روایت کرتے ہیں کہ ہم نبی اکرم صلی اللہ علیہ وسلم کی طرف وفد کی شکل میں نکلے، ہم نے آ کر آپ سے بیعت کی اور آپ کے ساتھ نماز پڑھی، اور آپ کو بتایا کہ ہماری سر زمین میں ہمارا ایک گرجا گھر ہے، ہم نے آپ سے آپ کے وضو کے بچے ہوئے پانی کی درخواست کی، تو آپ نے پانی منگوایا وضو کیا، اور کلی کی پھر اسے ایک برتن میں انڈیل دیا، اور ہمیں ( جانے ) کا حکم دیا، آپ صلی اللہ علیہ وسلم نے فرمایا: تم لوگ جاؤ اور جب تم لوگ اپنے علاقے میں پہنچنا تو گرجا ( کلیسا ) کو توڑ ڈالنا، اور اس جگہ اس پانی کو چھڑک دینا اور اسے مسجد بنا لینا ، ہم نے کہا: اللہ کے رسول! ہمارا ملک دور ہے، اور گرمی سخت ہے، پانی سوکھ جاتا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس میں اور پانی ملا لیا کرنا کیونکہ تم جس قدر ملاؤ گے اس کی خوشبو بڑھتی جائے گی ؛ چنانچہ ہم نکلے یہاں تک کہ اپنے ملک میں آ گئے، تو ہم نے گرجا کو توڑ ڈالا، پھر ہم نے اس جگہ پر یہ پانی چھڑکا اور اسے مسجد بنا لیا، پھر ہم نے اس میں اذان دی، اس گرجا کا راہب قبیلہ طے کا ایک آدمی تھا، جب اس نے اذان سنی تو کہا: یہ حق کی پکار ہے، پھر اس نے ہمارے ٹیلوں میں ایک ٹیلے کی طرف چلا گیا، اس کے بعد ہم نے اسے کبھی نہیں دیکھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 702,
			"arabicnumber": 702,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم مدینہ آئے تو اس کے ایک کنارے بنی عمرو بن عوف نامی ایک قبیلہ میں اترے، آپ نے ان میں چودہ دن تک قیام کیا، پھر آپ نے بنو نجار کے لوگوں کو بلا بھیجا تو وہ اپنی تلواریں لٹکائے ہوئے آئے، آپ ان کے ساتھ چلے گویا میں آپ صلی اللہ علیہ وسلم کو دیکھ رہا ہوں کہ آپ اپنی سواری پر ہیں، اور ابوبکر رضی اللہ عنہ آپ کے پیچھے سوار ہیں، اور بنی نجار کے لوگ آپ کے اردگرد ہیں، یہاں تک کہ آپ ابوایوب رضی اللہ عنہ کے دروازے پر اترے، جہاں نماز کا وقت ہوتا وہاں آپ نماز پڑھ لیتے، یہاں تک کہ آپ بکریوں کے باڑوں میں بھی نماز پڑھ لیتے، پھر آپ کو مسجد بنانے کا حکم ہوا، تو آپ صلی اللہ علیہ وسلم نے بنی نجار کے لوگوں کو بلوایا، وہ آئے تو آپ نے فرمایا: بنو نجار! تم مجھ سے اپنی اس زمین کی قیمت لے لو ، ان لوگوں نے کہا: اللہ کی قسم ہم اس کی قیمت صرف اللہ تعالیٰ سے طلب کرتے ہیں، انس رضی اللہ عنہ کہتے ہیں: اس میں مشرکین کی قبریں، کھنڈر اور کھجور کے درخت تھے، رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا تو مشرکین کی قبریں کھود ڈالی گئیں، کھجور کے درخت کاٹ دیئے گئے، اور کھنڈرات ہموار کر دیئے گئے، صحابہ کرام رضی اللہ عنہم کھجور کے درختوں کو مسجد کے قبلہ کی جانب لائن میں رکھ دیا، اور چوکھٹ کے دونوں پٹ پتھر کے بنائے، صحابہ کرام رضی اللہ عنہم پتھر ڈھوتے، اور اشعار پڑھتے جاتے تھے، اور رسول اللہ صلی اللہ علیہ وسلم ان کے ساتھ تھے، وہ لوگ کہہ رہے تھے: اے اللہ! بھلائی صرف آخرت کی بھلائی ہے، انصار و مہاجرین کی تو مدد فرما۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 703,
			"arabicnumber": 703,
			"text": "ام المؤمنین عائشہ اور ابن عباس رضی اللہ عنہم کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم کی وفات کا وقت آیا تو آپ اپنی چادر چہرہ مبارک پر ڈالتے، اور جب دم گھٹنے لگتا تو چادر اپنے چہرہ سے ہٹا دیتے، اور اس حالت میں آپ صلی اللہ علیہ وسلم نے فرمایا: یہود و نصاریٰ پر اللہ کی لعنت ہو، انہوں نے اپنے نبیوں کی قبروں کو سجدہ گاہ بنا لیا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 704,
			"arabicnumber": 704,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ ام المؤمنین ام حبیبہ اور ام سلمہ رضی اللہ عنہم دونوں نے ایک کنیسہ ( گرجا گھر ) کا ذکر کیا جسے ان دونوں نے حبشہ میں دیکھا تھا، اس میں تصویریں تھیں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ لوگ ایسے تھے کہ جب ان میں کا کوئی صالح آدمی مرتا تو یہ اس کی قبر کو سجدہ گاہ بنا لیتے، اور اس کی مورتیاں بنا کر رکھ لیتے، یہ لوگ قیامت کے دن اللہ تعالیٰ کے نزدیک بدترین مخلوق ہوں گے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 705,
			"arabicnumber": 705,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس وقت بندہ اپنے گھر سے مسجد کی طرف نکلتا ہے تو ایک قدم پر ایک نیکی لکھی جاتی ہے، اور دوسرے قدم پر ایک برائی مٹا دی جاتی ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ رسول اکرم صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کسی کی بیوی مسجد جانے کی اجازت چاہے تو وہ اسے نہ روکے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": 707,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اکرم صلی اللہ علیہ وسلم نے فرمایا: جو کوئی اس درخت میں سے کھائے، پہلے دن آپ نے فرمایا لہسن میں سے، پھر فرمایا: لہسن، پیاز اور گندنا میں سے، تو وہ ہماری مسجدوں کے قریب نہ آئے، کیونکہ فرشتے بھی ان چیزوں سے اذیت محسوس کرتے ہیں جن سے انسان اذیت و تکلیف محسوس کرتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "عمر بن خطاب رضی اللہ عنہ فرماتے ہیں: لوگو! تم ان دونوں پودوں میں سے کھاتے ہو جنہیں میں خبیث ہی سمجھتا ہوں ۱؎ یعنی اس پیاز اور لہسن سے، میں نے نبی اکرم صلی اللہ علیہ وسلم کو دیکھا کہ جب آپ کسی آدمی سے ان میں سے کسی کی بدبو پاتے تو اسے مسجد سے نکل جانے کا حکم دیتے، تو اسے بقیع کی طرف نکال دیا جاتا، جو ان دونوں کو کھائے تو پکا کر ان کی بو کو مار دے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اکرم صلی اللہ علیہ وسلم جب اعتکاف کا ارادہ فرماتے تو فجر پڑھتے، پھر آپ اس جگہ میں داخل ہو جاتے جہاں آپ اعتکاف کرنے کا ارادہ فرماتے، چنانچہ آپ نے ایک رمضان کے آخری عشرے میں اعتکاف کا ارادہ فرمایا، تو آپ نے ( خیمہ لگانے کا ) حکم دیا تو آپ کے لیے خیمہ لگایا گیا، ام المؤمنین حفصہ رضی اللہ عنہا نے بھی حکم دیا تو ان کے لیے بھی ایک خیمہ لگایا گیا، پھر جب ام المؤمنین زینب رضی اللہ عنہا نے ان کے خیمے دیکھے تو انہوں نے بھی حکم دیا تو ان کے لیے بھی ایک خیمہ لگایا گیا، جب رسول اللہ صلی اللہ علیہ وسلم نے یہ خیمے دیکھے تو فرمایا: کیا تم لوگ اس سے نیکی کا ارادہ رکھتی ہو؟ ۱؎، چنانچہ آپ صلی اللہ علیہ وسلم نے ( اس سال ) رمضان میں اعتکاف نہیں کیا ( اور اس کے بدلے ) شوال میں دس دنوں کا اعتکاف کیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں: غزوہ خندق ( غزوہ احزاب ) کے دن سعد بن معاذ رضی اللہ عنہ زخمی ہو گئے، قبیلہ قریش کے ایک شخص نے ان کے ہاتھ کی رگ ۱؎ میں تیر مارا، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کے لیے مسجد میں ایک خیمہ لگایا تاکہ آپ قریب سے ان کی عیادت کر سکیں۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": 711,
			"text": "ابوقتادہ رضی اللہ عنہ کہتے ہیں: ہم لوگ مسجد میں بیٹھے ہوئے تھے کہ اسی دوران رسول اللہ صلی اللہ علیہ وسلم امامہ بنت ابی العاص بن ربیع رضی اللہ عنہ کو ( گود میں ) اٹھائے ہوئے ہمارے پاس تشریف لائے، ( ان کی ماں رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی زینب رضی اللہ عنہا ہیں ) امامہ ایک ( کمسن ) بچی تھیں، آپ انہیں اٹھائے ہوئے تھے، تو آپ صلی اللہ علیہ وسلم نے انہیں اپنے کندھے پر اٹھائے ہوئے نماز پڑھائی، جب رکوع میں جاتے تو انہیں اتار دیتے، اور جب کھڑے ہوتے تو انہیں پھر گود میں اٹھا لیتے، ۱؎ یہاں تک کہ اسی طرح کرتے ہوئے آپ صلی اللہ علیہ وسلم نے اپنی نماز پوری کی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": 712,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اکرم صلی اللہ علیہ وسلم نے کچھ سواروں کو قبیلہ نجد کی جانب بھیجا، تو وہ قبیلہ بنی حنیفہ کے ثمامہ بن اثال نامی ایک شخص کو ( گرفتار کر کے ) لائے، جو اہل یمامہ کا سردار تھا، اسے مسجد کے کھمبے سے باندھ دیا گیا، یہ ایک لمبی حدیث کا اختصار ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": 713,
			"text": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ رسول اکرم صلی اللہ علیہ وسلم نے حجۃ الوداع میں اونٹ پر بیٹھ کر طواف کیا، آپ ایک چھڑی سے حجر اسود کا استلام کر رہے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": 714,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے جمعہ کے دن نماز سے پہلے حلقہ بنا کر بیٹھنے، اور مسجد میں خرید و فروخت کرنے سے منع فرمایا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": 715,
			"text": "عبداللہ بن عمرو رضی اللہ عنہم سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے مسجد میں اشعار پڑھنے سے منع فرمایا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": 716,
			"text": "سعید بن مسیب کہتے ہیں کہ عمر رضی اللہ عنہ حسان بن ثابت رضی اللہ عنہ کے پاس سے گزرے، وہ مسجد میں اشعار پڑھ رہے تھے، تو عمران رضی اللہ عنہ کی طرف گھورنے لگے، تو انہوں نے کہا: میں نے ( مسجد میں ) شعر پڑھا ہے، اور اس میں ایسی ہستی موجود ہوتی تھی جو آپ سے بہتر تھی، پھر وہ ابوہریرہ رضی اللہ عنہ کی طرف متوجہ ہوئے، اور پوچھا: کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو ( مجھ سے ) یہ کہتے نہیں سنا کہ تم میری طرف سے ( کافروں کو ) جواب دو، اے اللہ! روح القدس کے ذریعہ ان کی تائید فرما! ، تو ابوہریرہ رضی اللہ عنہ نے کہا! ہاں ( سنا ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ ایک آدمی آ کر مسجد میں ایک گمشدہ چیز ڈھونڈنے لگا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ کرے تو نہ پائے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": 718,
			"text": "سفیان ثوری کہتے ہیں کہ میں نے عمرو بن دینار سے پوچھا: کیا آپ نے جابر رضی اللہ عنہ کو کہتے ہوئے سنا ہے کہ ایک شخص مسجد میں کچھ تیر لے کر گزرا تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا: ان کی پیکان پکڑ کر رکھو ، تو عمرو نے کہا: جی ہاں ( سنا ہے ) ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": 719,
			"text": "اسود کہتے ہیں کہ میں اور علقمہ دونوں عبداللہ بن مسعود رضی اللہ عنہ کے پاس گئے، تو آپ نے ہم سے پوچھا: کیا ان لوگوں نے نماز پڑھ لی؟ ہم نے کہا: نہیں، تو آپ نے کہا: اٹھو نماز پڑھو، ہم چلے تاکہ آپ کے پیچھے کھڑے ہوں، تو آپ نے ہم میں سے ایک کو اپنی داہنی طرف، اور دوسرے کو اپنی بائیں طرف کر لیا، پھر بغیر کسی اذان اور اقامت کے نماز پڑھائی، جب آپ رکوع کرتے تو اپنی انگلیوں کو ایک دوسرے میں داخل کر لیتے، اور دونوں ہاتھوں کو دونوں گھٹنوں کے بیچ کر لیتے ۱؎، اور ( نماز کے بعد ) کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو اسی طرح کرتے ہوئے دیکھا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "اس سند سے علقمہ اور اسود نے عبداللہ بن مسعود رضی اللہ عنہ سے اسی جیسی حدیث ذکر کی ہے۔",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": 721,
			"text": "عبداللہ بن زید بن عاصم رضی اللہ عنہ کہتے ہیں کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو مسجد میں اپنے ایک پیر کو دوسرے پیر پر رکھ کر چت لیٹے ہوئے دیکھا ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": 722,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد میں جب وہ نوجوان اور غیر شادی شدہ تھے تو مسجد نبوی میں سوتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": 723,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اکرم صلی اللہ علیہ وسلم نے فرمایا: مسجد میں تھوکنا گناہ ہے، اور اس کا کفارہ اسے مٹی ڈال کر دبا دینا ہے ۱؎۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "عبداللہ بن عمر رضی اللہ عنہم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قبلہ والی دیوار پر تھوک دیکھا تو اسے رگڑ دیا، پھر آپ لوگوں کی طرف متوجہ ہوئے اور فرمایا: جب تم میں سے کوئی شخص نماز پڑھ رہا ہو تو اپنے چہرہ کی جانب ہرگز نہ تھوکے، کیونکہ جب وہ نماز پڑھ رہا ہوتا ہے تو اللہ عزوجل اس کے چہرہ کے سامنے ہوتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "ابو سعید خدری رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے مسجد کی قبلہ ( والی دیوار پر ) بلغم دیکھا تو اسے کنکری سے کھرچ دیا، اور لوگوں کو اپنے سامنے اور دائیں طرف تھوکنے سے روکا، اور فرمایا: ( جنہیں ضرورت ہو ) وہ اپنے بائیں تھوکے یا اپنے بائیں پاؤں کے نیچے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "طارق بن عبداللہ محاربی رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم نماز پڑھ رہے ہو تو اپنے سامنے اور اپنے داہنے ہرگز نہ تھوکو، بلکہ اپنے پیچھے تھوکو، یا اپنے بائیں تھوکو، بشرطیکہ بائیں طرف کوئی نہ ہو، ورنہ اس طرح کرو ، آپ صلی اللہ علیہ وسلم نے اپنے پیر کے نیچے تھوک کر اسے مل دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": 727,
			"text": "شخیر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا، آپ نے کھکھار کر تھوکا، پھر اسے اپنے بائیں پیر سے رگڑ دیا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": 728,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مسجد کے قبلہ میں بلغم دیکھا تو غضبناک ہو گئے یہاں تک کہ آپ کا چہرہ مبارک سرخ ہو گیا، انصار کی ایک عورت نے اٹھ کر اسے کھرچ کر صاف کر دیا، اور اس جگہ پر خلوق خوشبو مل دی، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس نے کیا ہی اچھا کیا ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": 729,
			"text": "ابوحمید اور ابواسید (مالک بن ربیعہ) رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی مسجد میں داخل ہو تو وہ: «اللہم افتح لي أبواب رحمتك» اے اللہ! تو میرے لیے اپنی رحمت کے دروازے کھول دے پڑھے، اور جب نکلے تو: «اللہم إني أسألك من فضلك» اے اللہ! میں تجھ سے تیرا فضل مانگتا ہوں پڑھے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": 730,
			"text": "ابوقتادہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی مسجد میں داخل ہو تو اسے چاہیئے کہ بیٹھنے سے پہلے دو رکعت پڑھ لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "عبداللہ بن کعب کہتے ہیں کہ میں نے کعب بن مالک رضی اللہ عنہ سے سنا، وہ اپنا وہ واقعہ بیان کر رہے تھے جب وہ غزوہ تبوک میں رسول اللہ صلی اللہ علیہ وسلم سے پیچھے رہ گئے تھے کہ رسول اللہ صلی اللہ علیہ وسلم صبح کو تشریف لائے، اور جب آپ صلی اللہ علیہ وسلم سفر سے واپس آتے تو پہلے مسجد جاتے اور اس میں دو رکعت نماز پڑھتے، پھر لوگوں سے ملنے کے لیے بیٹھتے، جب آپ صلی اللہ علیہ وسلم نے ایسا کر لیا تو جنگ سے پیچھے رہ جانے والے لوگ آپ کے پاس آئے، آپ سے معذرت کرنے لگے، اور آپ کے سامنے قسمیں کھانے لگے، وہ اسّی سے کچھ زائد لوگ تھے تو رسول اللہ صلی اللہ علیہ وسلم نے ان کے ظاہری بیان کو قبول کر لیا، اور ان سے بیعت کر لی، اور ان کے لیے مغفرت کی دعا کی، اور ان کے دلوں کے راز کو اللہ عزوجل کے سپرد کر دیا، یہاں تک کہ میں آیا تو جب میں نے سلام کیا، تو آپ صلی اللہ علیہ وسلم مجھے دیکھ کر مسکرائے جیسے کوئی غصہ میں مسکراتا ہے، پھر فرمایا: آ جاؤ! چنانچہ میں آ کر آپ کے سامنے بیٹھ گیا ۱؎، تو آپ نے مجھ سے پوچھا: تم کیوں پیچھے رہ گئے تھے؟ کیا تم نے اپنی سواری خرید نہیں لی تھی؟ میں نے عرض کیا: اللہ کے رسول! اللہ کی قسم اگر میں آپ کے علاوہ کسی اور کے پاس ہوتا تو میں اس کے غصہ سے اپنے آپ کو یقیناً بچا لیتا، مجھے باتیں بنانی خوب آتی ہے لیکن اللہ کی قسم، میں جانتا ہوں کہ اگر آپ کو خوش کرنے کے لیے میں آج آپ سے جھوٹ موٹ کہہ دوں تو قریب ہے کہ جلد ہی اللہ تعالیٰ آپ کو مجھ سے ناراض کر دے، اور اگر میں آپ سے سچ سچ کہہ دوں تو آپ مجھ پر ناراض تو ہوں گے لیکن مجھے امید ہے کہ اللہ مجھے معاف کر دے گا، اللہ کی قسم جب میں آپ سے پیچھے رہ گیا تھا تو اس وقت میں زیادہ طاقتوراور زیادہ مال والا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: رہا یہ شخص تو اس نے سچ کہا، اٹھو چلے جاؤ یہاں تک کہ اللہ آپ کے بارے میں کوئی فیصلہ کر دے ، چنانچہ میں اٹھ کر چلا آیا، یہ حدیث لمبی ہے یہاں مختصراً منقول ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": 732,
			"text": "ابوسعید بن معلی رضی اللہ عنہ کہتے ہیں کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے عہد میں بازار جاتے تو مسجد سے گزرتے، تو اس میں نماز پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": 733,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: فرشتے تمہارے حق میں دعا کرتے رہتے ہیں جب تک آدمی اس جگہ بیٹھا رہے جہاں اس نے نماز پڑھی ہے، اور وضو نہ توڑا ہو، وہ کہتے ہیں: اے اللہ! تو اسے بخش دے، اور اے اللہ! تو اس پر رحم فرما ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": 734,
			"text": "سہل ساعدی رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: جو شخص مسجد میں نماز کا انتظار کرتا ہے، وہ نماز ہی میں رہتا ہے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 735,
			"arabicnumber": 735,
			"text": "عبداللہ بن مغفل رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے اونٹوں کے باڑے میں نماز پڑھنے سے روکا ہے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": 736,
			"text": "جابر بن عبداللہ رضی اللہ عنہم کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پوری روئے زمین ۱؎ میرے لیے سجدہ گاہ اور پاکی کا ذریعہ بنا دی گئی ہے، میری امت کا کوئی بھی آدمی جہاں نماز کا وقت پائے نماز پڑھ لے ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": 737,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ ام سلیم رضی اللہ عنہا نے رسول اللہ صلی اللہ علیہ وسلم سے درخواست کی کہ آپ ان کے پاس تشریف لا کر ان کے گھر میں نماز پڑھ دیں تاکہ وہ اسی کو اپنی نماز گاہ بنا لیں ۱؎، چنانچہ آپ ان کے ہاں تشریف لائے، تو انہوں نے چٹائی لی اور اس پر پانی چھڑکا، پھر آپ نے اس پر نماز پڑھی، اور آپ کے ساتھ گھر والوں نے بھی نماز پڑھی۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": 738,
			"text": "ام المؤمنین میمونہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کھجور کی چھوٹی چٹائی پر نماز پڑھتے تھے۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": 739,
			"text": "ابوحازم بن دینار کہتے ہیں کہ کچھ لوگ سہل بن سعد ساعدی رضی اللہ عنہ کے پاس آئے وہ لوگ منبر کی لکڑی کے بارے میں بحث کر رہے تھے کہ وہ کس چیز کی تھی؟ ان لوگوں نے سہیل رضی اللہ عنہ اس بارے میں پوچھا، تو انہوں نے کہا: اللہ کی قسم میں خوب جانتا ہوں کہ یہ منبر کس لکڑی کا تھا، میں نے اسے پہلے ہی دن دیکھا تھا جس دن وہ رکھا گیا، اور جس دن رسول صلی اللہ علیہ وسلم پہلے پہل اس پر بیٹھے ( ہوا یوں تھا ) کہ رسول اللہ صلی اللہ علیہ وسلم نے فلاں عورت ( سہل رضی اللہ عنہ نے اس کا نام لیا تھا ) کو کہلوا بھیجا کہ آپ اپنے غلام سے جو بڑھئی ہے کہیں کہ وہ میرے لیے کچھ لکڑیوں کو اس طرح بنا دے کہ جب میں لوگوں کو وعظ و نصیحت کروں تو اس پر بیٹھ سکوں، تو اس عورت نے غلام سے منبر بنانے کے لیے کہہ دیا، چنانچہ غلام نے جنگل کے جھاؤ سے اسے تیار کیا، پھر اسے اس عورت کے پاس لے کر آیا تو اس نے اسے رسول اللہ صلی اللہ علیہ وسلم کے پاس بھیج دیا گیا، آپ صلی اللہ علیہ وسلم کے حکم پر اسے یہاں رکھا گیا، پھر میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اس پر چڑھے، اور اس پر نماز پڑھی، آپ نے اللہ اکبر کہا، آپ اسی پر تھے، پھر آپ نے رکوع کیا، اور آپ اسی پر تھے، پھر آپ الٹے پاؤں اترے اور منبر کے پایوں کے پاس سجدہ کیا، پھر آپ نے دوبارہ اسی طرح کیا، تو جب آپ فارغ ہو گئے، تو لوگوں کی طرف متوجہ ہوئے اور فرمایا: لوگو! میں نے یہ کام صرف اس لیے کیا ہے تاکہ تم لوگ میری پیروی کر سکو، اور ( مجھ سے ) میری نماز سیکھ سکو ۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": 740,
			"text": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو گدھے پر نماز پڑھتے ہوئے دیکھا، اور آپ کا رخ خیبر کی طرف تھا۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": 741,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو گدھے پر نماز پڑھتے دیکھا آپ سوار ہو کر خیبر کی طرف جا رہے تھے، اور قبلہ آپ کے پیچھے تھا۔ ابوعبدالرحمٰن ( نسائی ) کہتے کہ ہم کسی ایسے شخص کو نہیں جانتے جس نے عمرو بن یحییٰ کی ان کے قول «يصلي على حمار» میں متابعت کی ہو ۱؎اور یحییٰ بن سعید کی حدیث جو انس رضی اللہ عنہ سے مروی ہے، صحیح یہ ہے کہ وہ موقوف ہے ۲؎ واللہ سبحانہ وتعالیٰ اعلم بالصواب۔",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		}
	]
}