{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"12": "The Eclipse Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 445,
			"arabicnumber": 445,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ گہن لگا سورج کو رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں تو نماز پڑھائی آپ صلی اللہ علیہ وسلم نے ساتھ لوگوں کے پس کھڑے ہوئے بہت دیر تک پھر رکوع کیا بڑی دیر تک پھر کھڑے ہوئے بڑی دیر تک لیکن اول سے کچھ کم پھر رکوع کیا بڑی دیر تک لیکن اول رکوع سے کچھ کم پھر سر اٹھایا یا رکوع کیا پھر سجدہ کیا پھر دوسری رکعت میں بھی ایسا ہی کیا جب نماز سے فارغ ہوئے تو آفتاب روشن ہو گیا تھا پھر خطبہ پڑھا اور حمد و ثناء کی اللہ جل جلالہ کی پھر فرمایا کہ سورج اور چاند دونوں نشانیاں ہیں پروردگار کی نشانیوں سے کسی کی موت یا زیست کے واسطے ان میں گہن نہیں لگتا تو جب دیکھو تو گہن پس دعا کرو اللہ سے اور تکبیر کہو اور صدقہ دو پھر فرمایا آپ صلی اللہ علیہ وسلم نے امت محمد صلی اللہ علیہ وسلم قسم اللہ کی اللہ جل جلالہ سے کسی کو زیادہ غیرت نہیں ہے اس امر میں کہ اس کا بندہ یا اس کی لونڈی زنا کرے اے امت محمد اگر تم جانتے ہوتے جو میں جانتا ہوں تو ہنستے تم تھوڑا اور روتے بہت۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 445
			}
		},
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ گہن لگا سورج میں تو نماز پڑھی رسول اللہ صلی اللہ علیہ وسلم اور لوگوں نے ساتھ آپ صلی اللہ علیہ وسلم کے پھر کھڑے ہوئے آپ صلی اللہ علیہ وسلم دیر تک جیسے سورت بقرہ پڑھنے میں دیر ہوتی ہے پھر رکوع کیا ایک لمبا رکوع پھر سر اٹھایا پھر کھڑے ہوئے آپ صلی اللہ علیہ وسلم بڑی دیر تک لیکن پہلے قیام سے کچھ کم پھر رکوع کیا ایک رکوع لمبا لیکن اول رکوع سے کچھ کم پھر سجدہ کیا پھر کھڑے ہوئے آپ صلی اللہ علیہ وسلم بڑی دیر تک لیکن اول قیام سے کچھ کم پھر رکوع کیا لمبا رکوع لیکن اول رکوع سے کم پھر سر اٹھایا پھر کھڑے ہوئے بڑی دیر تک لیکن اول قیام سے کچھ کم پھر رکوع کیا ایک لمبا رکوع لیکن اول رکوع سے کچھ کم پھر سجدہ کیا تو فارغ ہوئے آپ صلی اللہ علیہ وسلم نماز سے اور آفتاب روشن ہو گیا تھا پس فرمایا آپ صلی اللہ علیہ وسلم نے سورج اور چاند دو نشانیاں ہیں اللہ تعالیٰ کی نشانیوں میں سے، نہیں گہن لگتا ان میں سے کسی کی زندگی اور موت سے جب تم ایسا دیکھو تو ذکر کرو اللہ کا صحابہ نے کہا یا رسول اللہ صلی اللہ علیہ وسلم ہم نے آپ صلی اللہ علیہ وسلم کو دیکھا نماز میں آپ صلی اللہ علیہ وسلم آگے بڑھے کسی چیز کو لینے کے لئے پھر پیچھے ہٹ آئے آپ صلی اللہ علیہ وسلم نے فرمایا پس دیکھا میں نے جنت کو پس لینا چاہا میں نے اس میں سے ایک گچھا اگر میرے ہاتھ لگ جاتا تو تم اس میں سے کھایا کرتے جب تک دنیا باقی رہتی اور میں نے دیکھا جہنم کو ایسی ہو لناک اور ہیبت صورت کہ کبھی میں نے ایس صورت نہ دیکھی ہے نہ دیکھی تھی اور میں نے دیکھا کہ جہنم میں عورتیں زیادہ ہیں صحابہ نے کہا کیوں یا رسول اللہ صلی اللہ علیہ وسلم آپ صلی اللہ علیہ وسلم نے فرمایا کہ عورتوں کی نا شکری نے ان کو جہنم میں ڈالا کہا صحابہ نے کیا کفر کرتی تھیں ساتھ اللہ کے فرمایا آپ صلی اللہ علیہ وسلم نے کفر کرتی ہیں یعنی نا شکری کرتی ہیں خاوند کی اور بھول جاتی ہیں احسان کو اگر کسی عورت کے ساتھ ساری عمر احسان کرو پھر کوئی رنج اس کو پہنچے تو کہنے لگتی ہے خاوند سے مجھے کبھی تجھ سے بھلائی نہیں پہنچی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 446
			}
		},
		{
			"hadithnumber": 447,
			"arabicnumber": 447,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ ایک یہودی عورت آئی ان کے پاس مانگنے کو تو کہا اس نے اللہ بچائے تجھ کو قبر کے عذاب سے پس پوچھا میں نے رسول اللہ صلی اللہ علیہ وسلم سے کیا لوگوں کو عذاب ہوگا قبروں میں فرمایا آپ صلی اللہ علیہ وسلم نے میں پناہ مانگتا ہوں اللہ کے اس عذاب سے پھر سوار ہوئے آپ صلی اللہ علیہ وسلم ایک دن سواری پر سو گہن لگا آفتاب کو اور لوٹے آپ صلی اللہ علیہ وسلم حجروں کے پیچھے سے پھر کھڑے ہو کر نماز پڑھنے لگے اور لوگ آپ صلی اللہ علیہ وسلم کے پیچھے کھڑے ہوئے پھر قیام کیا آپ صلی اللہ علیہ وسلم نے بڑی دیر تک پھر سر اٹھایا اور قیام کیا بڑی دیر تک لیکن پہلے قیام سے کچھ کم پھر رکوع کیا بڑی دیر تک لیکن پہلے رکوع سے کچھ کم پھر سر اٹھا کر سجدہ کیا پھر قیام کیا آپ نے بڑی دیر تک لیکن اول رکعت کے قیام سے کچھ کم پھر رکوع کیا لمبا رکوع لیکن پہلے رکوع سے کچھ کم پھر سر اٹھا کر سجدہ کیا پھر نماز سے فارغ ہو کر جو کچھ اللہ تعالیٰ نے چاہا باتیں کیں پھر حکم کیا ان کو کہ پناہ مانگیں اللہ سے قبر کے عذاب سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 447
			}
		},
		{
			"hadithnumber": 448,
			"arabicnumber": 448,
			"text": "اسما بنت ابی بکر سے روایت ہے کہ میں آئی عائشہ کے پاس جس وقت گہن لگا آفتاب کو تو دیکھا میں نے لوگوں کو نماز پڑھتے ہوئے اور عائشہ بھی کھڑی ہوئی نماز پڑھ رہی تھیں تو میں نے کہا کیا ہوا لوگوں کو تو اشارہ کیا حضرت عائشہ نے اپنے ہاتھ سے آسمان کی طرف اور سبحان اللہ کہا میں نے کہا کوئی نشانی ہے انہوں نے اشارہ سے کہا ہاں کہا اسما نے تو میں کھڑی ہوئی یہاں تک کہ مجھ کو غشی آنے لگی اور میں اپنے سر پر پانی ڈالنے لگی اور رسول اللہ صلی اللہ علیہ وسلم نے تعریف کی اللہ کی اور ثنا کی اس کی پھر فرمایا جو چیز میں نے دیکھی تھی وہ آج میں نے سیکھ لی اس جگہ یہاں تک کہ جنت اور دوزخ کو بھی دیکھا اور مجھے وحی سے معلوم ہوا کہ قبر کے بارے میں تم فتنہ میں پڑ جاؤ گے مثل فتنہ دجال کے یا اس کے قریب معلوم نہیں اسماء نے کیا کہا آئیں گے اس کے پاس فرشتے تو پوچھیں گے اس سے تو کیا سمجھتا ہے اس شخص کو جو ایمان رکھتا ہے یا یقین رکھتا ہے معلوم نہیں کیا کہا اسما نے وہ کہے گا یہ شخص محمد صلی اللہ علیہ وسلم ہیں اللہ جل جلالہ کے بھیجے ہوئے ہمارے پاس کھلی کھلی نشانیاں اور ہدایت یعنی کلام اللہ لے کر پس قبول کیا ہم نے اور ایمان لائے ہم اور پیروی کی ہم نے ان کی تب فرشتے اس سے کہیں گے سو رہ اچھی طرح ہم تو پہلے ہی جانتے تھے کہ تو مومن ہے اور منافق جس کو شک ہے حضرت کی رسالت میں معلوم نہیں کیا کہا اسما نے وہ کہے گا میں نہیں جانتا لوگوں سے میں نے جو سنا وہ کہا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 448
			}
		}
	]
}