{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"15": "The Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 470,
			"arabicnumber": 470,
			"text": "عبداللہ بن ابی بکر بن حزم سے روایت ہے کہ جو کتاب رسول اللہ صلی اللہ علیہ وسلم نے لکھی تھی عمرو بن حزم کے واسطے اس میں یہ بھی تھا کہ قرآن نہ چھوئے مگر جو شخص با وضو ہو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 470
			}
		},
		{
			"hadithnumber": 471,
			"arabicnumber": 471,
			"text": "محمد بن سیرین سے روایت ہے کہ عمر بن خطاب لوگوں میں بیٹھے اور لوگ قرآن پڑھ رہے تھے پس گئے حاجت کو اور پھر آکر قرآن پڑھنے لگے ایک شخص نے کہا آپ کلام اللہ پڑھتے ہیں بغیر وضو کے حضرت عمر نے کہا تجھ سے کس نے کہا کہ یہ منع ہے کیا مسیلمہ نے کہا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 471
			}
		},
		{
			"hadithnumber": 472,
			"arabicnumber": 472,
			"text": "عبداللہ بن عبدالقاری سے روایت ہے کہ حضرت عمر نے فرمایا کہ جس کسی کے ورد کا رات کو ناغہ ہو جائے اور وہ دوسرے دن زوال تک ظہر کی نماز تک پڑھ لے تو گویا فوت نہیں ہوا بلکہ اس نے پا لیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 472
			}
		},
		{
			"hadithnumber": 473,
			"arabicnumber": 473,
			"text": "یحیی بن سعید سے روایت ہے کہ انہوں نے کہا میں اور محمد بن یحیی بن حبان بیٹھے ہوئے تھے سو محمد نے ایک شخص کو بلایا اور کہا تم نے جو اپنے باپ سے سنا ہے اس کو بیان کرو اس شخص نے کہا میرا باپ گیا زیدی بن ثابت کے پاس اور ان سے پوچھا کہ سات روز میں کلام اللہ تمام کرنا کیسا ہے بولے اچھا ہے میرے نزدیک پندرہ روز یا بیس روز میں تمام کرنا بہتر ہے پوچھو مجھ سے کیوں کہا انہوں نے میں نے پوچھا کیوں زید نے کہا تاکہ میں اس کو سمجھتا جاؤں یاد رکھتا جاؤں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 473
			}
		},
		{
			"hadithnumber": 474,
			"arabicnumber": 474,
			"text": "عبدالرحمن بن عبدالقاری سے روایت ہے کہ میں نے سنا عمر بن خطاب سے کہتے تھے میں نے ہشام بن حزام کو پڑھتے سنا سورت فرقان کو اور طرح سوائے اس طریقہ کے جس طرح میں پڑھتا تھا اور مجھے رسول اللہ صلی اللہ علیہ وسلم نے ہی پڑھایا تھا اس سورت کو، قریب ہوا کہ میں جلدی کر کے ان پر غصہ نکالوں لیکن میں چپ رہا یہاں تک کہ وہ فارغ ہوئے نماز سے تب میں انہی کی چادر ان کے گلے میں ڈال کر لے آیا ان کو رسول اللہ صلی اللہ علیہ وسلم کے پاس اور کہا میں نے یا رسول اللہ صلی اللہ علیہ وسلم میں نے ان کو سورت فرقان پڑھتے سنا اور طور پر خلاف اس طور کے جس طرح آپ صلی اللہ علیہ وسلم نے مجھے پڑھایا ہے تب فرمایا آپ صلی اللہ علیہ وسلم نے چھوڑ دو ان کو پھر فرمایا ان سے پڑھو تو پڑھا ہشام نے اسی طور سے جس طرح میں نے ان کو پڑھتے ہوئے سنا تھا تب فرمایا آپ صلی اللہ علیہ وسلم نے اسی طرح اتری ہے یہ سورت پھر ارشاد کیا آپ نے کہا تو پڑھ پھر میں نے پڑھی پھر فرمایا قرآن شریف اترا ہے سات حرف پر تو پڑھو جس طرح سے آسان ہو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 474
			}
		},
		{
			"hadithnumber": 475,
			"arabicnumber": 475,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا حافظ قرآن کی مثال ایسی ہے کہ جیسے اونٹ والے کی جب تک اونٹ کو بندھا رکھے گا وہ رہے گا جب چھوڑ دے گا چلا جائے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 475
			}
		},
		{
			"hadithnumber": 476,
			"arabicnumber": 476,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ حارث بن ہشام نے پوچھا نبی صلی اللہ علیہ وسلم سے کس طرح وحی آتی ہے آپ صلی اللہ علیہ وسلم پر فرمایا آپ صلی اللہ علیہ وسلم نے کبھی آتی ہے جیسے گھنٹے کی آواز اور وہ نہایت سخت ہوتی ہے میرے اوپر پھر جب موقوف ہو جاتی ہے تو میں یاد کر لیتا ہوں جو کہتا ہے فرشتہ جو آدمی کی شکل بن کر مجھ سے باتیں کرتا ہے تو میں یاد کر لیتا ہوں جو کہتا ہے حضرت ام المومنین عائشہ کہتی ہیں کہ جب وحی اترتی تھی آپ صلی اللہ علیہ وسلم سخت جاڑے کے دنوں میں پھر جب موقوف ہوتی تھی تو پیشانی سے آپ کے پسینہ بہتا تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 476
			}
		},
		{
			"hadithnumber": 477,
			"arabicnumber": 477,
			"text": "عروہ بن زبیر سے روایت ہے کہا انہوں نے عبس وتولی اتری ہے عبداللہ بن ام مکتوم میں وہ آئے رسول اللہ صلی اللہ علیہ وسلم کے پاس اور کہنے لگے اے محمد بتاؤ مجھ کو کوئی جگہ قریب اپنے تاکہ بیٹھوں میں وہاں اور آنحضرت صلی اللہ علیہ وسلم کے پاس اس وقت ایک شخص بیٹھا تھا بڑے آدمیوں میں سے مشرکوں کے ابی بن خلف یا عتبہ بن ربیعہ تو آپ صلی اللہ علیہ وسلم توجہ نہ کرتے تھے اے باپ فلاں کے کیا میں جو کہتا ہوں اس میں کچھ حرج ہے وہ کہتا تھا نہیں قسم ہے بتوں کی تمہارے کہنے میں کچھ حرج نہیں ہے تب یہ آیتیں اتریں عبس وتولی",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 477
			}
		},
		{
			"hadithnumber": 478,
			"arabicnumber": 478,
			"text": "اسلم عدوی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم رات کو سفر میں سوار ہو کر چل رہے تھے اور عمر بن خطاب بھی ان کے ساتھ تھے پس حضرت عمر نے ایک بات پوچھی آپ صلی اللہ علیہ وسلم سے تو جواب نہ دیا آنحضرت صلی اللہ علیہ وسلم نے پھر پوچھی جب بھی جواب نہ دیا پھر پوچھی جب بھی جواب نہ دیا اس وقت حضرت عمر نے دل میں کہا کاش تو مر گیا ہوتا اے عمر تین بار تو نے گڑگڑا کر پوچھا رسول اللہ صلی اللہ علیہ وسلم سے اور کسی بارے میں آپ صلی اللہ علیہ وسلم نے جواب نہ دیا عمر کہتے ہیں کہ میں نے اپنے اونٹ کو تیز کیا اور آگے بڑھ گیا لیکن میرے دل میں یہ خوف تھا کہ شاید میرے بارے میں کلام اللہ اترے گا تو تھوڑی دیر میں ٹھہرا تھا اتنے میں میں نے ایک پکارنے والے کو سنا جو مجھ کو پکارتا ہے اس وقت مجھے اور زیادہ خوف ہوا اس بات کا کہ کلام اللہ میرے بارے میں اترا ہوگا سو آیا میں رسول اللہ صلی اللہ علیہ وسلم کے پاس اور سلام کیا میں نے تب آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا کہ رات کو میرے اوپر ایک سورت ایسی اتری ہے جو ساری دنیا کی چیزوں سے مجھ کو زیادہ محبوب ہے پھر پڑھا انا فتحنا لک فتحا مبینا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 478
			}
		},
		{
			"hadithnumber": 479,
			"arabicnumber": 479,
			"text": "ابو سعید خدری سے روایت ہے کہ سنا میں نے رسول اللہ صلی اللہ علیہ وسلم سے فرماتے تھے نکلیں گے تم میں سے کچھ لوگ جو حقیر جانیں گے تمہاری نماز کو اپنی نماز کے مقابلے میں اور تمہارے روزوں کو اپنے روزوں کے مقابلہ میں اور تمہارے اعمال کو اپنے اعمال کے مقابلہ میں پڑھیں گے کلام اللہ کو اور نہ اترے گا ان کے حلقوں کے نیچے نکل جائیں گے دین سے جیسے نکل جاتا ہے تیر اس جانور میں سے جو شکار کیا جائے آر پار ہو کر صاف اگر پیکان کو دیکھے اس میں بھی کچھ نہیں پائے اگر تیر کی لکڑی کو دیکھے اس میں بھی کچھ نہ پائے اگر پر کو دیکھے اس میں بھی کچھ نہ پائے اور سو فار میں شک ہو کہ کچھ لگا ہے یا نہیں۔ امام مالک کو پہنچا کہ عبداللہ بن عمر سورت بقرہ آٹھ برس تک سیکھتے رہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 479
			}
		},
		{
			"hadithnumber": 480,
			"arabicnumber": 480,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 480
			}
		},
		{
			"hadithnumber": 481,
			"arabicnumber": 481,
			"text": "ابو سلمہ بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ ابوہریرہ نے پڑھا سورت اذالسماء انشقت کو تو سجدہ کیا اور جب فارغ ہوئے سجدہ سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے سجدہ کیا اس میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 481
			}
		},
		{
			"hadithnumber": 482,
			"arabicnumber": 482,
			"text": "نافع سے روایت ہے کہ ایک شخص نے مصر والوں میں سے خبر دی مجھ کو کہ عمر بن خطاب نے سورت حج کو پڑھا تو اس میں دو سجدے کئے پھر فرمایا کہ یہ سورت فضیلت دی گئی بسبب دو سجدوں کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 482
			}
		},
		{
			"hadithnumber": 483,
			"arabicnumber": 483,
			"text": "عبداللہ بن دینار سے روایت ہے انہوں نے دیکھا عبداللہ بن عمر کو سورت حج میں دو سجدے کرتے ہوئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 483
			}
		},
		{
			"hadithnumber": 484,
			"arabicnumber": 484,
			"text": "اعرج سے روایت ہے کہ حضرت عمر بن خطاب نے والنجم اذا ہوا پڑھ کر سجدہ کیا پھر سجدہ سے کھڑے ہو کر ایک اور سورت پڑھی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 484
			}
		},
		{
			"hadithnumber": 485,
			"arabicnumber": 485,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 485
			}
		},
		{
			"hadithnumber": 486,
			"arabicnumber": 486,
			"text": "ابوسعید خدری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ میں نے سنا ایک شخص کو قل ھو اللہ احد بار بار پڑھتے ہوئے تو جب صبح ہوئی آئے رسول اللہ صلی اللہ علیہ وسلم کے پاس اور بیان کیا ان سے یہ امر اور ابوسعید رضی اللہ تعالیٰ عنہ اپنی دانست میں کم جانتے تھے اس سورت کو پس فرمایا آنحضرت صلی اللہ علیہ وسلم نے قسم ہے اس ذات کی جس کے قبضہ قدرت میں میری جان ہے کہ یہ سورت برابر ہے تہائی قرآن کے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 486
			}
		},
		{
			"hadithnumber": 487,
			"arabicnumber": 487,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہتے تھے آیا میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ سو سنا آپ صلی اللہ علیہ وسلم نے ایک شخص کو قل ھو اللہ احد پڑھتے ہوئے فرمایا واجب ہوئی پوچھا میں نے کیا چیز فرمایا جنت کہا ابوہریرہ رضی اللہ تعالیٰ عنہ نے میں نے چاہا کہ اس شخص کو جاکر خوشخبری دوں لیکن میں ڈرا کہ ایسا نہ ہو کہ میرا صبح کا کھانا جاتا رہے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تو میں نے پہلے کھانا کھایا۔ پھر گیا میں تو دیکھا کہ وہ شخص چلا گیا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 487
			}
		},
		{
			"hadithnumber": 488,
			"arabicnumber": 488,
			"text": "حمید بن عبدالرحمن بن عوف نے کہا کہ قل ہو اللہ احد برابر ہے تہائی قرآن کے اور تبارک الذی بیدہ الملک لڑے گی اپنے پڑھنے والی کی طرف سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 488
			}
		},
		{
			"hadithnumber": 489,
			"arabicnumber": 489,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جو شخص کہے لا الہ الا اللہ وحدہ لا شریک لہ لہ الملک ولہ الحمد وھو علی کل چیز قدیر ۔ ایک روز میں سو بار تو گویا اس نے دس غلام آزاد کئے اور سو نیکیاں اس کے لئے لکھی جائیں گی اور سو برائیاں اس کی مٹائی جائیں گی اور وہ اس دن پھر شیطان کے شر سے بچا رہے گا یہاں تک کہ شام ہو اور کوئی شخص اس سے بہتر عمل نہ لائے گا مگر اس سے بھی زیادہ عمل کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 489
			}
		},
		{
			"hadithnumber": 490,
			"arabicnumber": 490,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے کہا سبحان اللہ وبحمدہ ایک دن میں سو بار مٹائے جائیں گے گناہ اس کے اگرچہ ہوں مثل سمندر کے پھین کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 490
			}
		},
		{
			"hadithnumber": 491,
			"arabicnumber": 491,
			"text": "ابوہریرہ نے کہا جو شخص ہر نماز کے بعد سبحان اللہ کہے تینتیس بار اور اللہ اکبر کہے تینتیس بار اور الحمد للہ کہے تینتیس بار اور ختم کرے سو کے عددلا الہ الا اللہ وحدہ لا شریک لہ لہ الملک ولہ الحمد وھو علی کل چیز قدیر ۔ پس بخش دیئے جائیں گے گناہ اس کے اگرچہ ہوں مثل سمندر کی جھاگ کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 491
			}
		},
		{
			"hadithnumber": 492,
			"arabicnumber": 492,
			"text": "سعید بن مسیب نے کہا باقیات صالحات یہ کلمے ہیں اللہ اکبر سبحان اللہ والحمدللہ لا الہ الا اللہ ولاحول ولا قوة الا باللہ ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 492
			}
		},
		{
			"hadithnumber": 493,
			"arabicnumber": 493,
			"text": "ابو الدردا نے کہا کیا تم کو نہ بتاؤں وہ کام جو تمہارے سب کاموں سے بہتر ہے تمہارے لئے اور درجہ میں سب سے زیادہ بلند ہے اور تمہارے مالک کے نزدیک سب کاموں سے زیادہ عمدہ ہے اور بہتر ہے سونا اور چاندی خرچ کرنے سے اور بہتر ہے اس سے کہ تم اپنے دشمن سے لڑ کر اس کی گردن مارو اور وہ تمہاری گردن مارے کہا صحابہ نے ہاں بتاؤ کہا انہوں نے ذکر اللہ سبحانہ کا ۔ معاذ بن جبل نے کہا آدمی نے کوئی عمل ایسا نہیں کیا جو زیادہ نجات دینے والا ہو اس کو اللہ کے عذاب سے سوا ذکر الٰہی کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 493
			}
		},
		{
			"hadithnumber": 494,
			"arabicnumber": 494,
			"text": "رفاعہ بن رافع سے روایت ہے کہ ہم ایک روز نماز پڑھ رہے تھے رسول اللہ صلی اللہ علیہ وسلم کے پیچھے تو جب سر اٹھایا آپ صلی اللہ علیہ وسلم نے رکوع سے اور کہا سمع اللہ لمن حمدہ ایک شخص بولا ربنا لک الحمد حمدا کثیرا طیبا مبارکا فیہ پس جب فارغ ہوئے رسول اللہ صلی اللہ علیہ وسلم نماز سے فرمایا کون شخص بولا تھا ابھی اس شخص نے کہا میں تھا یا رسول اللہ صلی اللہ علیہ وسلم تب فرمایا آپ صلی اللہ علیہ وسلم نے میں نے دیکھا کہ تیس سے زیادہ کچھ فرشتے جلدی کر رہے تھے کہ کون پہلے لکھے اس کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 494
			}
		},
		{
			"hadithnumber": 495,
			"arabicnumber": 495,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے ہر نبی کے لئے ایک دعا مقرر ہے جو ضرور قبول ہوتی ہے اور میں چاہتا ہوں کہ اس دعا کو اٹھا رکھوں اپنی امت کی شفاعت کے واسطے دن آخرت کے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 495
			}
		},
		{
			"hadithnumber": 496,
			"arabicnumber": 496,
			"text": "یحیی بن سعید کو پہنچا کہ رسول اللہ صلی اللہ علیہ وسلم دعا مانگتے تھے پس فرماتے تھے اے اللہ پیدا کرنے والے صبح کو اور رات کو راحت بنانے والے اور سورج اور چاند کے حساب سے چلانے والے ادا کر تو قرض میرا اور غنی کر مجھ کو محتاجی سے اور فائدہ دے مجھ کو میرے کان اور آنکھ سے اور میری قوت سے اپنی راہ میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 496
			}
		},
		{
			"hadithnumber": 497,
			"arabicnumber": 497,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ نے فرمایا جب کوئی تم میں سے دعا کرے تو یوں نہ کہے یا اللہ بخش دے مجھ کو اگر چاہے تو اور رحم کر ہم پر اگر چاہے تو بلکہ یوں کہے بخش دے مجھ کو اس لئے کہ اللہ جل جلالہ پر کوئی جبر کرنے والا نہیں ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 497
			}
		},
		{
			"hadithnumber": 498,
			"arabicnumber": 498,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے دعا قبول ہوتی ہے جب تک دعا مانگنے والا جلدی نہ کرے اور یہ کہنے لگے کہ میں نے دعا کی سو دعا میری قبول نہ ہوئی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 498
			}
		},
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے اترتا ہے رب ہمارا ہر رات کو آسمان دنیا تک جب تہائی رات باقی رہتی ہے سو فرماتا ہے کون شخص ہے جو دعا کرے مجھ سے اور قبول کروں میں دعا اس کی، کون شخص ہے مانگے مجھ سے پس دوں میں اس کو، کون شخص ہے جو بخشش چاہے مجھ سے سو بخش دوں اس کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 499
			}
		},
		{
			"hadithnumber": 500,
			"arabicnumber": 500,
			"text": "محمد بن ابراہیم سے روایت ہے کہ ام المومنین نے کہا میں سو رہی تھی رسول اللہ صلی اللہ علیہ وسلم کے پہلو میں سو نہ پایا میں نے ان کو پس چھوا میں نے آپ کو تو رکھا میں نے ہاتھ آپ صلی اللہ علیہ وسلم کے قدموں پر اور آپ صلی اللہ علیہ وسلم سجدہ میں تھے فرماتے تھے پناہ مانگتا ہوں ہو تیری رضامندی کی تیرے غصے سے اور تیری عفو کی تیرے عتاب سے اور تجھ سے میں تیری تعریف نہیں کر سکتا تو ایسا ہے جس طرح تو نے اپنی تعریف خود کی ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 500
			}
		},
		{
			"hadithnumber": 501,
			"arabicnumber": 501,
			"text": "طلحہ بن عبیداللہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا افضل دعاؤں میں دعا عرفہ کے دن کی ہے اور افضل ان سب کلمات میں جو میں نے کہے ہیں اور اگلے پیغمبروں نے لا الہ الا اللہ وحدہ لا شریک لہ ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 501
			}
		},
		{
			"hadithnumber": 502,
			"arabicnumber": 502,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم سکھاتے تھے ان کو یہ دعا جیسے سکھاتے تھے ان کو ایک سورت قرآن کی فرماتے تھے اے اللہ پناہ مانگتا ہوں میں تیری جہنم کے عذاب سے اور پناہ مانگتا ہوں تیری دجال کے فتنہ سے اور پناہ مانگتا ہوں تیری زندگی اور موت کے فتنہ سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 502
			}
		},
		{
			"hadithnumber": 503,
			"arabicnumber": 503,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب کھڑے ہوتے نماز کو عین رات میں فرماتے یا اللہ سب تعریفیں تیرے لئے ہیں، تو نور ہے آسمانوں کا اور زمین کا اور سب تعریفیں تیرے لئے ہیں ، اور تو ہی قائم رکھنے والا ہے آسمانوں اور زمینوں کو ، اور سب تعریفیں تیرے لئے ہیں اور تو ہی پروردگار ہے آسمانوں کا اور زمین کا اور ان کا جو آسمان اور زمین کے بیچ میں ہیں تو حق ہے تیرا قول سچا ہے تیرا وعدہ برحق ہے تجھ سے ملنا حق ہے جنت وجہنم حق ہے قیامت حق ہے اے پروردگار تیرے حکم کا میں تابعدار ہوں اور تجھ پر ایمان لایا اور تجھ ہی پر بھروسہ کیا اور تیری ہی طرف متوجہ ہوا اور تیری مدد سے میں لڑا کفار سے اور تجھ کو میں نے حاکم بنایا جب اختلاف ہوا سو بخش دے میرے اگلے اور پچھلے اور چھپے اور کھلے گناہ تو میرا معبود ہے تیرے سوا کوئی سچا معبود نہیں ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 503
			}
		},
		{
			"hadithnumber": 504,
			"arabicnumber": 504,
			"text": "عبداللہ بن عبداللہ سے روایت ہے کہ عبداللہ بن عمر ہمارے پاس آئے بنی معاویہ میں اور وہ ایک گاؤں ہے انصار کے گاؤں میں سے تو پوچھا مجھ سے تم کو معلوم ہے کس جگہ پر نماز پڑھی رسول اللہ صلی اللہ علیہ وسلم نے میں نے کہا ہاں عبداللہ بن عمر نے کہا بتاؤ مجھ کو میں نے کہا دعا کی آپ صلی اللہ علیہ وسلم نے اس امر کی، کہ مسلمانوں پر کوئی دشمن ان کی غیر قوم کا یعنی کافروں میں سے مسلط نہ کرنا اور ان کو قحط سے ہلاک نہ کرنا تو یہ دونوں دعائیں قبول ہوگئیں تیسری دعا یہ ہے کہ مسلمانوں کی آپس میں خون اور جنگ نہ ہو تو یہ دعا قبول نہ ہوئی عبداللہ بن عمر نے کہا سچ کہا تو نے پھر کہا کہ اب قیامت تک فساد آپس میں چلتا جائے گا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 504
			}
		},
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "زید بن اسلم سے روایت ہے وہ کہتے تھے جو شخص دعا کرتا ہے تو اس کی دعا تین حال سے خالی نہیں ہوتی یا قبول ہو جاتی ہے یا رکھ لی جاتی ہے قیامت کے دن پر یا گناہوں کا کفارہ ہو جاتی ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 505
			}
		},
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "عبداللہ بن دینار سے روایت ہے کہ دیکھا مجھ کو عبداللہ بن عمر نے دعا کرتے ہوئے اور میں دو انگلیوں سے اشارہ کرتا تھا ہر ایک ہاتھ کی ایک ایک انگلی تھی سو منع کیا مجھ کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 506
			}
		},
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "سعید بن مسیب کہتے تھے بے شک آدمی کا درجہ بلند ہو جاتا ہے اس کے لڑکے کے دعا کرنے سے بعد اس کے مر جانے کے اور اشارہ کیا آپ صلی اللہ علیہ وسلم نے دونوں ہاتھوں سے آسمانوں کی طرف پھر اٹھایا ان کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 507
			}
		},
		{
			"hadithnumber": 508,
			"arabicnumber": 508,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 508
			}
		},
		{
			"hadithnumber": 509,
			"arabicnumber": 509,
			"text": "عروہ بن زبیر سے روایت ہے کہ یہ آیت (وَلَا تَجْ هَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذٰلِكَ سَبِيْلًا) 17۔ الاسراء : 110) دعا میں اتری ہے ۔ امام مالک کو پہنچا کہ رسول اللہ صلی اللہ علیہ وسلم دعا مانگتے تھے یا اللہ میں مانگتا ہوں تجھ سے نیک کام کرنا اور برے کاموں کو چھوڑنا اور محبت غریبوں کی اور جب تو کسی مصیبت کو لوگوں میں اتارنا چاہے تو مجھے اپنے پاس بلا لے اس مصیبت سے بچا کر ۔ امام مالک کو پہنچا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص ہدایت کی طرف بلائے اس کو مثل اس کے ثواب ملے گا جو اس کی پیروی کرے کچھ کم نہ ہوگا اس کے ثواب سے اور جو شخص گمراہی کی طرف بلائے اس پر اتنا گناہ ہوگا جتنا پیروی کرنے والے پر ہوگا کچھ کم نہ ہوگا پیروی کرنے والے کے گناہ سے ۔ امام مالک کو پہنچا کہ عبداللہ بن عمر کہتے تھے یا اللہ مجھ کو متقیوں کا پیشوا بنانا ۔ امام مالک کو پہنچا ہے ابودرداء سے جب اٹھتے تھے رات کو کہتے تھے سو گئیں آنکھیں اور غائب ہو گئے تارے اور تو اے پروردگار زندہ ہے بیدار ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 509
			}
		},
		{
			"hadithnumber": 510,
			"arabicnumber": 510,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 510
			}
		},
		{
			"hadithnumber": 511,
			"arabicnumber": 511,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 511
			}
		},
		{
			"hadithnumber": 512,
			"arabicnumber": 512,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 512
			}
		},
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "عبداللہ صنابحی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب آفتاب نکلتا ہے تو شیطان اس کے نزدیک ہوتا ہے اور جب بلند ہو جاتا ہے تو اس سے الگ ہو جاتا ہے پھر جب سر پر آجاتا ہے نزدیک ہو جاتا ہے پھر جب ڈھل جاتا ہے تو الگ ہو جاتا ہے پھر جب ڈوبنے لگتا ہے تو نزدیک ہو جاتا ہے پھر جب ڈوب جاتا ہے الگ ہو جاتا ہے اور منع کیا رسول اللہ صلی اللہ علیہ وسلم نے ان ساعتوں میں نماز پڑھنے سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 513
			}
		},
		{
			"hadithnumber": 514,
			"arabicnumber": 514,
			"text": "عروہ بن زبیر سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب کنارہ آفتاب کا نکلے تو نماز میں تو قف کرو یہاں تک کہ پورا آفتاب نکل آئے اور جب کنارہ آفتاب کا ڈوب جائے تو توقف کرو یہاں تک کہ پورا آفتاب ڈوب جائے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 514
			}
		},
		{
			"hadithnumber": 515,
			"arabicnumber": 515,
			"text": "علاء بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ ہم گئے انس بن مالک کے پاس بعد ظہر کے تو کھڑے ہوئے وہ نماز عصر کے واسطے پس جب فارغ ہوئے نماز سے بیان کیا ہم نے یا انہوں نے نماز جلد پڑھنے کا حال تو کہا انس نے سنا میں نے رسول اللہ صلی اللہ علیہ وسلم سے فرماتے تھے یہ نماز منافق کی ہے کہ بیٹھے رہتا ہیں جب آفتاب زرد ہو جاتا ہے یا اس کے اوپر ہوتا ہے تو کھڑے ہو کر چار ٹھونگے لگا لیتا ہے اس میں، نہیں یاد کرتا اللہ کو مگر تھوڑا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 515
			}
		},
		{
			"hadithnumber": 516,
			"arabicnumber": 516,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کوئی تم میں سے قصد کر کے نماز نہ پڑھے آفتاب کے طلوع اور غروب کے وقت ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 516
			}
		},
		{
			"hadithnumber": 517,
			"arabicnumber": 517,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے منع کیا نماز سے بعد عصر کے یہاں تک کہ ڈوب جائے آفتاب اور بعد صبح کے یہاں تک کہ نکل آئے آفتاب ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 517
			}
		},
		{
			"hadithnumber": 518,
			"arabicnumber": 518,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ عمر بن خطاب فرماتے تھے قصد نہ کرو نماز کا آفتاب کے طلوع اور غروب کے وقت کیونکہ شیطان کے دو جانب سر کے ساتھ نکلتے ہیں آفتاب کے اور ساتھ ہی ڈوبتے ہیں اور عمر مارتے تھے لوگوں کو اس وقت نماز پڑھنے پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 518
			}
		},
		{
			"hadithnumber": 519,
			"arabicnumber": 519,
			"text": "سائب بن یزید نے دیکھا حضرت عمر نے مارا منکدر کو اس لئے کہ انہوں نے نماز پڑھی تھی بعد عصر کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 519
			}
		}
	]
}