{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "ابو سعید خدری سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے پانچ اونٹوں سے کم میں زکوة نہیں ہے اور پانچ اوقیوں سے جو چاندی کم ہو اس میں زکوة نہیں ہے اور پانچ وسق سے جو غلہ کم ہو اس میں زکوة نہیں ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 578
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "ابو سعید خدری سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جو کھجور پانچ وسق سے کم ہو اس میں زکوة نہیں ہے اور جو چاندی پانچ اوقیہ سے کم ہو اس میں زکوة نہیں ہے اور پانچ اونٹوں سے کم میں زکوة نہیں ہے ۔ امام مالک کو پہنچا کہ عمر بن عبدالعزیز نے لکھا اپنے عامل کو دمشق میں کہ زکوة سونے چاندی اور زراعت اور جانوروں میں ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 579
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 580
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "محمد بن عقبہ نے پوچھا قاسم بن محمد بن ابی بکر سے کہ میں نے اپنے مکاتب سے مقاطعت کی ہے ایک مال عظیم پر تو کیا زکوة اس میں واجب ہے قاسم بن محمد نے کہا کہ ابوبکر صدیق کسی مال میں سے زکوة نہ لیتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 581
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": 582,
			"text": "قدامہ بن مظعون سے روایت ہے کہ جب میں عثمان بن عفان کے پاس اپنی سالانہ تنخواہ لینے آیا تو مجھ سے پوچھتے کہ تمہارے پاس کوئی ایسا مال ہے جس پر زکوة واجب ہو اگر میں کہتا ہاں تو تنخواہ میں سے زکوة اس مال کی لے لیتے اور جو کہتا نہیں تو تنخواہ دے دیتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 582
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر کہتے تھے کسی مال میں زکوة واجب نہیں ہوتی جب تک اس پر کوئی سال نہ گزرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 583
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 584
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "کئی ایک لوگوں سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جاگیر کر دی تھیں بلال بن حارث مزنی کو کانیں قبیلہ کی جو فرح کی طرف ہیں تو ان کانوں سے آج تک کچھ نہیں لیا جاتا سوائے زکوة کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 585
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا رکاز میں پانچواں حصہ لیا جائے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 586
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "قاسم بن محمد سے روایت ہے کہ حضرت ام المومنین عائشہ پرورش کرتی تھیں اپنے بھائی محمد بن ابی بکر کی یتیم بیٹیوں کی اور ان کے پاس زیور تھا تو نہیں نکالتی تھیں اس میں سے زکوة ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 587
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر اپنی بیٹیوں اور لونڈیوں کو سونے کا زیور پہناتے تھے اور ان کے زیوروں میں سے زکوة نہیں نکالتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 588
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "امام مالک کو پہنچا کہ عمر بن خطاب نے فرمایا تجارت کرو یتیموں کے مال میں تاکہ زکوة ان کو تمام نہ کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 589
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "قاسم بن محمد سے روایت ہے کہ حضرت ام المومنین عائشہ پرورش کرتی تھیں میری اور میرے بھائی کی دونوں یتیم تھے ان کی گود میں تو نکالتی تھیں ہمارے مالوں میں سے زکوة ۔ ا مام مالک کو پہنچا کہ حضرت ام المومنین عائشہ یتیموں کا مال تاجر کو دیتی تھیں تاکہ وہ اس میں تجارت کریں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 590
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 591
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "یحیی بن سعید سے روایت ہے کہ انہوں نے اپنے بھائی کے یتیم لڑکوں کے واسطے کچھ مال خریدا پھر وہ مال بڑی قیمت کا بکا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 592
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "سائب بن یزید سے روایت ہے کہ عثمان بن عفان فرماتے تھے یہ مہینہ تمہاری زکوة کا ہے تو جس شخص پر کچھ قرض ہو تو چاہئے کہ قرض اپنا ادا کر دے اور باقی جو مال بچ جائے اس کی زکوة ادا کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 593
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "ایوب بن ابی تمیمہ سختیانی سے روایت ہے کہ عمر بن عبدالعزیز نے لکھا ایک مال کے بارے میں (جس کو بعض حکام نے ظلم سے چھین لیا تھا) کہ پھیر دیں اس کو مالک کی طرف اور اس میں سے زکوة ان برسوں کی جو گزر گئے وصول کرلیں اس کے بعد ایک نامہ لکھا کہ زکوة ان برسوں کی نہ لی جائے کیونکہ وہ مال ضمار تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 594
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "یزید بن خصیفہ سے روایت ہے کہ انہوں نے پوچھا سلیمان بن یسار سے ایک شخص کے پاس مال ہے لیکن اس پر اسی قدر قرض ہے کیا زکوة اس پر واجب ہے بولے نہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 595
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "زریق بن حیان سے روایت ہے کہ وہ مقرر تھے مصر کے محصول خانہ پر ولید اور سلیمان بن عبدالملک اور عمر بن عبدالعزیز کے زمانے میں کہ عمر بن عبدالعزیز نے لکھا ان کو جو شخص گزرے اوپر تیرے مسلمانوں میں سے تو جو مال ان کو ظاہر ہو اموال تجارت میں سے تو لے اس میں سے ہر چالیس دینار میں سے ایک دینار یعنی چالیسواں حصہ اور جو چالیس دینار سے کم ہو تو اسی حساب سے بیس دینار تک اگر بیس دینار سے ایک تہائی دینار بھی کم تو اس مال کو چھوڑ دے اس میں سے کچھ نہ لے اور جو تیرے اوپر کوئی ذمی گزرے تو اس کے مال تجارت میں سے ہر بیس دینار میں سے ایک دینار لے جو کم ہو اسی حساب سے دس دینار تک اگر دس دینار سے ایک تہائی دینار بھی کم ہو تو کچھ نہ لے اور جو کچھ تو لے اس کی ایک رسید سال تمام کے واسطے لکھ دے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 596
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "عبداللہ بن دینار سے روایت ہے کہ انہوں نے سنا عبداللہ بن عمر سے کسی نے پوچھا کنز کسے کہتے ہیں جواب دیا کنز وہ مال ہے جس کی زکوة نہ دی جائے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 597
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ کہتے تھے جس شخص کے پاس مال ہو اور وہ اس کی زکوة ادا نہ کرے تو قیامت کے روز وہ مال ایک گنجے سانپ کی صورت بنے گا جس کی دو آنکھوں پر سیاہ داغ ہوں گے اور ڈھونڈے گا اپنے مالک کو یہاں تک کہ پائے گا اس کو پھر کہے گا اس سے میں تیرا مال ہوں جس کی زکوة تو نے نہیں دی تھی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 598
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "امام مالک نے پڑھا حضرت عمر بن خطاب کی کتاب صدقہ اور زکوة کے باب میں اس میں لکھا تھا بسم اللہ الرحمن الرحیم یہ کتاب ہے صدقہ کی چوبیس اونٹنیوں تک ہر پانچ میں ایک بکری لازم ہے جب چوبیس سے زیادہ ہوں پینتیس تک ایک برس کی اونٹنی ہے اگر ایک برس کی اونٹنی نہ ہو تو دو برس کا اونٹ ہے اس سے زیادہ میں پنتالیس اونٹ تک دو برس کی اونٹنی ہے اس سے زیادہ میں ساٹھ اونٹ تک تین برس کی اونٹنی ہے جو قابل ہو جفتی کے اس سے زیادہ میں پچھتر اونٹ تک چار برس کی اونٹنی ہے اس سے زیادہ میں نوے اونٹ تک دو اونٹنیاں ہیں دو دو برس کی اس سے زیادہ میں ایک سو بیس اونٹ تک تین تین برس کی دو اونٹنیاں ہیں جو قابل ہوں جفتی کے اس سے زیادہ میں ہر چالیس اونٹ تک دو برس کی اونٹنی ہے اور ہر پچاس اونٹ میں تین برس کی اونٹنی ہے بکریاں جو جنگل میں چرتی ہوں جب چالیس تک پہنچ جائیں ایک بکری زکوة کی لازم ہوگی اس سے زیادہ میں تین سو بکریوں تک تین بکریاں بعد اس کے ہر سینکڑے میں ایک بکری دینا ہوگی اور زکوة میں بکرا نہ لیا جائے گا اسی طرح بوڑھے اور عیب دار مگر جب زکوۃ لینے والے کی رائے میں مناسب ہو اور جد اجدا اموال ایک نہ کئے جائیں گے اسی طرح ایک مال جدا جدا نہ کیا جائے گا زکوة کے خوف سے اور جو دو آدمی شریک ہوں تو وہ آپس میں رجوع کر لیں برابر کا حصہ لگا کر اور چاندی میں جب پانچ اوقیہ ہو تو چالیسواں حصہ لازم آئے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 599
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "طاؤس یمانی سے روایت ہے کہ معاذ بن جبل نے تیس گایوں میں سے ایک گائے ایک برس کی لی اور چالیس گایوں میں دو برس کی ایک گائے لی اور اس سے کم میں کچھ نہ لیا اور کہا کہ نہیں سنا میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس بارے میں یہاں تک کہ پوچھوں گا آپ صلی اللہ علیہ وسلم سے پس وفات پائی رسول اللہ صلی اللہ علیہ وسلم نے معاذ بن جبل کے آنے سے پہلے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 600
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "سفیان بن عبداللہ کو عمر بن خطاب نے متصدق ( یعنی زکوۃ وصول کرنے والا ) کرکے بھیجا تو وہ بکریوں میں بچوں کو بھی شمار کرتے تھے لوگوں نے کہا تم بچوں کو شمار کرتے ہیں لیکن بچہ لیتے نہیں ہو تو جب آئے وہ عمر بن خطاب کے پاس بیان کیا ان سے یہ امر تو کہا حضرت عمر نے ہاں ہم گنتے ہیں بچوں کو بلکہ اس بچے کو جس کو چرواہا اٹھا کر چلتا ہے لیکن نہیں لیتے اس کو نہ موٹی بکری کو جو کھانے کے واسطے موٹی کی جائے اور نہ اس بکری کو جو اپنے بچے کو پالتی ہو اور نہ حاملہ کو اور نہ نر کو اور لیتے ہیں ہم ایک سال یا دوسال کی بکری ہو جو متوسط ہے نہ بچہ ہے نہ بوڑھی ہے نہ بہت عمدہ ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 601
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ حضرت عمر کے پاس بکریاں آئیں زکوة کی اس میں ایک بکری دیکھی بہت دودھ والی تو پوچھا آپ نے یہ بکری کیسی ہے لوگوں نے کہا زکوة کی بکری ہے حضرت عمر نے فرمایا کہ اس کے مالک نے کبھی اس کو خوشی سے نہ دیا ہوگا لوگوں کو فتنے میں نہ ڈالو ان کے بہترین اموال نہ لو اور باز آؤ ان کا رزق چھین لینے سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 602
			}
		},
		{
			"hadithnumber": 603,
			"arabicnumber": 603,
			"text": "محمد بن یحیی بن حبان سے روایت ہے کہ خبر دی مجھ کو دو شخصوں نے قبیلہ اشجع سے کہ محمد بن مسلمہ انصاری آتے تھے زکوة لینے کو تو کہتے تھے صاحب مال سے لاؤ میرے پاس زکوة اپنے مال کی پھر وہ جو بکری لے کر آتا اگر وہ زکوة کے لائق ہوتی تو قبول کر لیتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 603
			}
		},
		{
			"hadithnumber": 604,
			"arabicnumber": 604,
			"text": "عطاء بن یسار سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا زکوة درست نہیں مالدار کی مگر پانچ آدمیوں کو درست ہے پہلے غازی جو جہاد کرتا ہو اللہ کی راہ میں دوسرے جو عامل ہو زکوة کا یعنی زکوة کو وصول اور تحصیل کرتا ہو تیسرے مدیون یعنی جو قرضدار ہو چوتھے جو زکوة کو خرید لے اپنے مال کے عوض میں پانچویں جو مسکین ہمسایہ کے پاس سے بطور ہدیہ کے آئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 604
			}
		},
		{
			"hadithnumber": 605,
			"arabicnumber": 605,
			"text": "امام مالک سے روایت ہے کہ ابوبکر صدیق نے فرمایا کہ اگر نہ دیں گے رسی بھی اونٹ باندھنے کی تو میں جہاد کروں گا ان پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 605
			}
		},
		{
			"hadithnumber": 606,
			"arabicnumber": 606,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 606
			}
		},
		{
			"hadithnumber": 607,
			"arabicnumber": 607,
			"text": "زید بن اسلم سے روایت ہے کہ حضرت عمربن خطاب نے دودھ پیا تو بھلا معلوم ہوا پوچھا کہ یہ دودھ کہاں سے آیا جو لایا تھا وہ بولا کہ میں ایک پانی پر گیا تھا اور اس کا نام بیان کیا وہاں پر جانور زکوة کے پانی پی رہے تھے لوگوں نے ان کا دودھ نچوڑ کر مجھے دیا میں نے اپنی مشک میں رکھ لیا وہ یہی دودھ تھا جو آپ نے پیا تو حضرت عمر نے اپنا ہاتھ منہ میں ڈال کر قے کی ۔ امام مالک کو پہنچا کہ ایک عامل نے عمر بن عبدالعزیز کو لکھا کہ ایک شخص اپنے مال کی زکوة نہیں دیتا عمر نے جواب میں لکھا کہ چھوڑ دے اس کو اور مسلمانوں کے ساتھ اور زکوة نہ لیا کر اس سے۔ یہ خبر اس شخص کو پہنچی اس کو برا معلوم ہوا اور اپنے مال کی زکوة ادا کر دی بعد اس کے عامل نے حضرت عمر کو اطلاع دی انہوں نے جواب میں لکھا کہ لے لے زکوة کو اس شخص سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 607
			}
		},
		{
			"hadithnumber": 608,
			"arabicnumber": 608,
			"text": "سلیمان بن یسار اور بسر بن سعید سے روایت ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ بارانی اور زیر چشمہ یا تالاب کی زمین میں اور اس کھجور میں جس کو پانی کی حاجت نہ ہو دسواں حصہ زکوۃ ہے اور جو زمین پانی سینچ کر ترکی جائے اس میں بیسواں حصہ زکوة کا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 608
			}
		},
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "ابن شہاب زہری نے کہا کہ کھجور کی زکوۃ میں جعرور (ایک قسم کی خراب کھجور ہے جو سوکھنے سے کوڑا ہو جاتی ہے) اور مصران الفارہ اور عذق بن حبیق(یہ بھی ردی کھجوروں کی قسم ہیں) نہ لی جائیں گی اور مثال ان کی بکریوں کی سی ہے کہ صاحب مال کے مال کے شمار میں سب قسم کی شمار کی جائیں گی لیکن لی نہ جائیں گی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 609
			}
		},
		{
			"hadithnumber": 610,
			"arabicnumber": 610,
			"text": "امام مالک نے پوچھا ابن شہاب سے کہ زیتون میں کیا واجب ہے بولے دسواں حصہ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 610
			}
		},
		{
			"hadithnumber": 611,
			"arabicnumber": 611,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا نہیں ہے مسلمان پر اپنے گھوڑے اور غلام کی زکوة ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 611
			}
		},
		{
			"hadithnumber": 612,
			"arabicnumber": 612,
			"text": "سلیمان بن یسار سے روایت ہے کہ شام کے لوگوں نے ابوعبیدہ بن جراح سے کہا کہ ہمارے گھوڑوں اور غلاموں کی زکوة لیا کرو انہوں نے انکار کیا اور حضرت عمر بن خطاب کو لکھ بھیجا حضرت عمر نے بھی انکار کیا پھر لوگوں نے دوبارہ ابوعبیدہ سے کہا انہوں نے حضرت عمر کو لکھا حضرت عمر نے جواب میں لکھا کہ اگر وہ لوگ ان چیزوں کی زکوة دینا چاہیں تو اسے ان سے لے کر انہی کے فقیروں کو دے دے اور ان کے غلاموں اور لونڈیوں کی خوراک میں صرف کر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 612
			}
		},
		{
			"hadithnumber": 613,
			"arabicnumber": 613,
			"text": "عبداللہ بن ابی حزم سے روایت ہے کہ عمر بن عبدالعزیز کا خط میرے باپ کے پاس آیا جب وہ منی میں تھے کہ شہد اور گھوڑے کی زکوة کچھ نہ لے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 613
			}
		},
		{
			"hadithnumber": 614,
			"arabicnumber": 614,
			"text": "عبداللہ بن دینار سے روایت ہے کہ پوچھا میں نے سعید بن مسیب سے کہ ترکی گھوڑوں میں زکوة کیا ہے انہوں نے جواب دیا کیا گھوڑوں میں بھی زکوة ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 614
			}
		},
		{
			"hadithnumber": 615,
			"arabicnumber": 615,
			"text": "ابن شہاب سے روایت ہے کہ پہنچا مجھ کو کہ رسول اللہ صلی اللہ علیہ وسلم نے جزیہ لیا بحرین کے مجوس سے اور عمر بن خطاب نے جزیہ لیا فارس کے مجوس سے اور عثمان بن عفان نے جزیہ لیا بربر سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 615
			}
		},
		{
			"hadithnumber": 616,
			"arabicnumber": 616,
			"text": "امام محمد بن باقر سے روایت ہے کہ حضرت عمر بن خطاب نے ذکر کیا مجوس کا اور کہا کہ میں نہیں جانتا کیا کروں ان کے بارے میں تو کہا عبدالرحمن بن عوف نے گواہی دیتا ہوں میں کہ سنا میں نے رسول اللہ صلی اللہ علیہ وسلم سے فرماتے تھے آپ صلی اللہ علیہ وسلم ان سے وہ طریقہ برتو جو اہل کتاب سے برتتے ہو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 616
			}
		},
		{
			"hadithnumber": 617,
			"arabicnumber": 617,
			"text": "اسلم جو مولیٰ ہیں عمر بن خطاب کے سے روایت ہے کہ عمر بن خطاب نے مقرر کیا جزیہ کو سونے والوں پر ہر سال میں چار دینار اور چاندی والوں پر ہر سال میں چالیس درہم اور ساتھ اس کے یہ بھی تھا کہ بھوکے مسلمانوں کو کھانا کھلائیں اور جو کوئی مسلمان ان کے یہاں آکر اترے تو اس کی تین روز کی ضیافت کریں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 617
			}
		},
		{
			"hadithnumber": 618,
			"arabicnumber": 618,
			"text": "اسلم بن عدوی سے روایت ہے کہ انہوں نے کہا حضرت عمر بن خطاب سے کہ شتر خانے میں ایک اندھی اونٹنی ہے تو فرمایا حضرت عمر نے وہ اونٹنی کسی گھروالوں کو دے دے تاکہ وہ اس سے نفع اٹھائیں میں نے کہا وہ اندھی ہے حضرت عمر نے کہا اس کو اونٹوں کی قطار میں باندھ دیں گے میں نے کہا وہ چارہ کیسے کھائے گی حضرت عمر نے کہا وہ جزیے کے جانوروں میں سے ہے یا صدقہ کے میں نے کہا وہ جزیے کے حضرت عمر نے کہا و اللہ تم لوگوں نے اس کے کھانے کا ارادہ کیا ہے میں نے کہا نہیں اس پر نشانی جزیہ کی موجود ہے تو حکم کیا حضرت عمر نے اور وہ نحر کی گئی اور حضرت عمر کے پاس نو پیالے تھے جو میوہ یا اچھی چیز آتی آپ ان میں رکھ کر آپ صلی اللہ علیہ وسلم کی بیبیوں کو بھیجا کرتے اور سب سے آخر میں اپنی بیٹی حفصہ کے پاس بھیجتے اگر وہ چیز کم ہوتی تو کمی حفصہ کے حصے میں ہوتی تو پہلے آپ نے گوشت کو پیالوں میں ڈال کر آپ صلی اللہ علیہ وسلم کی بیبیوں کو روانہ کیا بعد اس کے پکانے کا حکم کیا اور سب مہاجرین اور انصار کی دعوت کر دی ۔ امام مالک کو پہنچا کہ عمر بن عبدالعزیز نے لکھ بھیجا اپنے عاملوں کو جو لوگ جزیہ والوں میں سے مسلمان ہوں ان کا جزیہ معاف کریں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 618
			}
		},
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 619
			}
		},
		{
			"hadithnumber": 620,
			"arabicnumber": 620,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت عمر بن خطاب نبط کے کافروں سے گیہوں اور تیل کا بیسواں حصہ لیتے تھے تاکہ مدینہ میں اس کی آمدنی زیادہ ہو اور قطنیہ سے دسواں حصہ لیتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 620
			}
		},
		{
			"hadithnumber": 621,
			"arabicnumber": 621,
			"text": "سائب بن یزید سے روایت ہے کہ میں عامل تھا عبداللہ بن عتبہ کے ساتھ مدینہ منورہ کے بازار میں تو ہم لیتے تھے نبط کے کفار سے دسواں حصہ ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 621
			}
		},
		{
			"hadithnumber": 622,
			"arabicnumber": 622,
			"text": "امام مالک نے پوچھا ابن شہاب سے کہ حضرت عمر کفار نبط سے دسواں حصہ کیسے لیتے تھے تو ابن شہاب نے کہا کہ ایام جاہلیت میں ان لوگوں سے دسواں حصہ لیا جاتا تھا حضرت عمر نے وہی قائم رکھا ان پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 622
			}
		},
		{
			"hadithnumber": 623,
			"arabicnumber": 623,
			"text": "اسلم بن عددی سے روایت ہے کہ سنا میں نے عمر بن خطاب سے کہتے تھے میں نے ایک شخص کو عمدہ گھوڑا دے دیا اللہ کی راہ میں مگر اس شخص نے اس کو تباہ کیا تو میں نے قصد کیا کہ پھر اس سے خرید لوں اور میں یہ سمجھتا ہوں کہ وہ سستا بیچ ڈالے گا سو پوچھا میں نے رسول اللہ صلی اللہ علیہ وسلم سے آپ صلی اللہ علیہ وسلم نے فرمایا مت خرید اس کو اگرچہ وہ ایک درہم کا تجھے دے دے اس لئے کہ صدقہ دے کر پھر اس کو لینے والا ایسا ہے جیسے کتا قے کر کے پھر اس کو کھا لے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 623
			}
		},
		{
			"hadithnumber": 624,
			"arabicnumber": 624,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ عمر بن خطاب نے ایک گھوڑا دیا اللہ کی راہ میں پھر قصد کیا اس کے خرید نے کا تو پوچھا رسول اللہ صلی اللہ علیہ وسلم سے آپ صلی اللہ علیہ وسلم نے فرمایا مت خرید اس کو اور نہ پھیر صدقہ کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 624
			}
		},
		{
			"hadithnumber": 625,
			"arabicnumber": 625,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر صدقہ فطر نکالتے اپنے غلاموں کی طرف سے جو وادی قری اور خیبر میں تھے ۔ کہا مالک نے جو بہتر سنا ہے اس باب میں وہ یہ ہے کہ آدمی اس شخص کی طرف سے صدقہ فطر ادا کرے جس کا نان ونفقہ اس پر واجب ہے اور اس پر خرچ کرنا ضروری ہے اور اپنے غلام اور مکاتب اور مدبر اور سب کی طرف سے صدقہ ادا کرے خواہ یہ غلام حاضر ہوں یا غائب شرط یہ ہے کہ وہ مسلمان ہوں تجارت کے واسطے ہوں یا نہ ہوں اور جو ان میں مسلمان نہ ہو اس کی طرف سے صدقہ فطر نہ دے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 625
			}
		},
		{
			"hadithnumber": 626,
			"arabicnumber": 626,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے صدقہ فطر مقرر کیا لوگوں پر ایک صاع کھجور کا اور ایک صاع جَو کا ہر آزاد اور ہر غلام پر مرد ہو یا عورت مسلمانوں میں سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 626
			}
		},
		{
			"hadithnumber": 627,
			"arabicnumber": 627,
			"text": "عیاض بن عبداللہ نے سنا ابوسعید خدری رضی اللہ تعالیٰ عنہ سے ہم نکالتے تھے صدقہ فطر ایک صاع گیہوں سے یا ایک صاع جَو سے یا ایک صاع کھجور سے یا ایک صاع پنیر سے یا ایک صاع انگور خشک سے نبی صلی اللہ علیہ وسلم کے صاع سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 627
			}
		},
		{
			"hadithnumber": 628,
			"arabicnumber": 628,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر صدقہ فطر میں ہمیشہ کھجور دیا کرتے تھے مگر ایک بار جو دئیے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 628
			}
		},
		{
			"hadithnumber": 629,
			"arabicnumber": 629,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر صدقہ فطر بھیج دیا کرتے تھے عید سے دو تین روز پہلے اس شخص کے پاس جہاں صدقہ فطر جمع ہوا کرتا تھا ۔ کہا مالک نے میں نے دیکھا اہل علم کو وہ مستحب جانتے تھے صدقہ فطر کو نکالنا جب فجر ہو عید کی قبل نماز کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 629
			}
		}
	]
}