{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"18": "Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 630,
			"arabicnumber": 630,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ذکر کیا رمضان کا تو فرمایا نہ روزہ رکھو تم یہاں تک کہ چاند دیکھو رمضان کا اور نہ روزے موقوف کرو یہاں تک کہ چاند دیکھو شوال کا سو اگر چاند چھپ جائے ابر سے پس گن لو دن رمضان کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 630
			}
		},
		{
			"hadithnumber": 631,
			"arabicnumber": 631,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے کبھی مہینہ انتیس روز کا ہوتا ہے تو نہ روزہ رکھو جب تک چاند نہ دیکھو اور نہ روزہ موقوف کرو جب تک چاند نہ دیکھو پس اگر ابر ہو تو شمار کر لو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 631
			}
		},
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے رمضان کا ذکر کر کے نہ روزہ رکھو جب تک چاند نہ دیکھ لو اور نہ روزے موقوف کرو جب تک چاند نہ دیکھ لو اگر ابر ہو تو تیس روزے پور کرلو ۔ امام مالک کو پہنچا کہ حضرت عثمان بن عفان کے زمانے میں چاند دکھائی دیا تیسرے پہر کو تو روزہ نہ توڑا حضرت عثمان نے یہاں تک کہ شام ہوگئی اور آفتاب ڈوب گیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 632
			}
		},
		{
			"hadithnumber": 633,
			"arabicnumber": 633,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 633
			}
		},
		{
			"hadithnumber": 634,
			"arabicnumber": 634,
			"text": "عبداللہ بن عمر نے کہا روزہ کسی شخص کا درست نہیں ہوتا جب تک کہ نیت نہ کرے قبل صبح صادق کے ۔ حضرت ام المومنین عائشہ اور ام المومنین حفصہ رضی اللہ تعالیٰ عنہا نے بھی ایسا ہی فرمایا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 634
			}
		},
		{
			"hadithnumber": 635,
			"arabicnumber": 635,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 635
			}
		},
		{
			"hadithnumber": 636,
			"arabicnumber": 636,
			"text": "سہل بن سعد ساعدی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہمیشہ لوگ اچھے رہیں گے اپنے دین میں جب تک وہ روزہ جلدی افطار کریں گے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 636
			}
		},
		{
			"hadithnumber": 637,
			"arabicnumber": 637,
			"text": "سعید بن مسیب سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہمیشہ لوگ اچھے رہیں گے جب تک روزہ جلدی کھولیں گے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 637
			}
		},
		{
			"hadithnumber": 638,
			"arabicnumber": 638,
			"text": "حمید بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ حضرت عمر بن خطاب اور حضرت عثمان بن عفان نماز پڑھتے تھے مغرب کی رمضان میں جب سیاہی ہوتی تھی پچھان کی طرف پھر بعد نماز کے روزہ کھرلتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 638
			}
		},
		{
			"hadithnumber": 639,
			"arabicnumber": 639,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ ایک شخص بولا رسول اللہ صلی اللہ علیہ وسلم سے اور آپ صلی اللہ علیہ وسلم کھڑے ہوئے تھے دروازہ پر اور میں سن رہی تھی اے رسول اللہ صلی اللہ علیہ وسلم صبح ہو جاتی ہے اور میں جنبی ہوتا ہوں روزہ کی نیت سے تو فرمایا رسول اللہ صلی اللہ علیہ وسلم نے میں بھی جنبی ہوتا ہوں اور صبح ہو جاتی ہے روزہ کی نیت سے تو میں غسل کرتا ہوں اور روزہ رکھتا ہوں بولا وہ شخص یا رسول اللہ صلی اللہ علیہ وسلم آپ صلی اللہ علیہ وسلم کیا کہنا آپ صلی اللہ علیہ وسلم ہم جیسے تھوڑی ہیں اللہ جل جلالہ نے آپ صلی اللہ علیہ وسلم کے اگلے اور پچھلے گناہ سب بخش دیئے تو غصے ہوئے رسول اللہ صلی اللہ علیہ وسلم فرمایا آپ صلی اللہ علیہ وسلم نے میں امید رکھتا ہوں کہ تم سب سے زیادہ اللہ سے ڈرنے والا اور تم سب سے زیادہ جاننے والا پرہیز گاری کی باتوں کو میں ہوں گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 639
			}
		},
		{
			"hadithnumber": 640,
			"arabicnumber": 640,
			"text": "حضرت ام المومنین عائشہ اور ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت ہے ان دونوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم جنبی رہتے تھے جماع سے نہ کہ احتلام سے اور صبح ہو جاتی تھی رمضان میں پھر روزہ رکھتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 640
			}
		},
		{
			"hadithnumber": 641,
			"arabicnumber": 641,
			"text": "ابوبکر بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ میں اور میرے باپ عبدالرحمن دونوں بیٹھے مروان بن حکم کے پاس اور مروان ان دنوں میں حاکم تھے مدینہ کے تو ان سے ذکر کیا گیا کہ ابوہریرہ کہتے ہیں جو شخص جنبی ہو اور صبح ہو جائے تو اس کا روزہ نہ ہوگا مروان نے کہا قسم دیتا ہوں تم اے عبدالرحمن تم جاؤ ام المومنین حضرت عائشہ اور ام المومنین ام سلمہ کے پاس اور پوچھو ان سے یہ مسئلہ تو گئے عبدالرحمن اور گیا میں ساتھ ان کے یہاں تک کہ پہنچے ہم ام المومنین عائشہ کے پاس تو سلام کیا ان کو عبدالرحمن نے پھر کہا اے ام المومنین ہم بیٹھے تھے مروان بن حکم کے پاس ان سے ذکر ہوا کہ ابوہریرہ کہتے ہیں جس شخص کو صبح ہو جائے اور وہ جنبی ہو تو اس کا روزہ نہ ہوگا فرمایا حضرت عائشہ نے ایسا نہیں ہے جیسا کہا ابوہریرہ نے اے عبدالرحمن کیا تو منہ پھیرتا ہے اس کام سے جو رسول اللہ صلی اللہ علیہ وسلم کرتے تھے کہا عبدالرحمن نے نہیں قسم اللہ کی فرمایا حضرت عائشہ نے میں گواہی دیتی ہوں رسول اللہ صلی اللہ علیہ وسلم پر کہ ان کو صبح ہو جاتی تھی اور وہ جنبی ہوتے تھے جماع سے نہ کہ احتلام سے پھر روزہ رکھتے اس دن کا ۔ کہا ابوبکر نے پھر نکلے ہم یہاں تک کہ پہنچے ام المومنین سلمہ کے پاس اور پوچھا ہم نے ان سے اس مسئلہ کو انہوں نے بھی یہ کہا جو حضرت عائشہ نے کہا کہا ابوبکر نے پھر نکلے ہم اور آئے مروان بن حکم کے پاس ان سے عبدالرحمن نے بیان کیا قول حضرت عائشہ اور ام سلمہ کا تو کہا مروان نے قسم دیتا ہوں میں تم کو اے ابومحمد تم سوار ہو کر جاؤ میرے جانور پر جو دروازہ پر ہے ابوہریرہ کے پاس کیونکہ وہ اپنی زمین میں ہے عقیق میں اور اطلاع کرو ان کو اس مسئلہ سے تو سوار ہوئے عبدالرحمن اور میں بھی ان کے ساتھ سوار ہوا یہاں تک کہ آئے ہم ابوہریرہ کے پاس تو ایک ساعت تک باتیں کیں ان سے عبدالرحمن نے پھر بیان کیا ان سے اس مسئلہ کو تو ابوہریرہ نے کہا مجھے علم نہیں تھا اس مسئلہ کا بلکہ ایک شخص نے مجھ سے بیان کیا تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 641
			}
		},
		{
			"hadithnumber": 642,
			"arabicnumber": 642,
			"text": "ام المومنین عائشہ اور ام المومنین سلمہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جنبی ہوتے تھے جماع سے نہ کہ احتلام سے اور صبح ہو جاتی تھی پھر روزہ رکھتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 642
			}
		},
		{
			"hadithnumber": 643,
			"arabicnumber": 643,
			"text": "عطا بن یسار سے روایت ہے کہ ایک شخص نے بوسہ دیا اپنی عورت کو اور وہ روزہ دار تھا رمضان میں سو اس کو بڑا رنج ہوا اور اس نے اپنی عورت کو بھیجا ام المومنین ام سلمہ کے پاس کہ پوچھے ان سے اس مسئلہ کو تو آئی وہ عورت ام سلمہ کے پاس اور بیان کیا ان سے، ام سلمہ نے کہا رسول اللہ صلی اللہ علیہ وسلم بوسہ لیتے ہیں روزے میں تب وہ اپنے خاوند کے پاس گئی اور اس کو خبر دی پس اور زیادہ رنج ہوا اس کے خاوند کو اور کہا اس نے ہم رسول اللہ صلی اللہ علیہ وسلم کے سے نہیں ہیں اللہ اپنے رسول کے لئے جو چاہتا ہے حلال کر دیتا ہے پھر آئی اس کی عورت ام سلمہ کے پاس اور دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم بھی وہیں موجود ہیں سو پوچھا رسول اللہ صلی اللہ علیہ وسلم نے کیا ہوا اس عورت کو تو بیان کیا آپ صلی اللہ علیہ وسلم سے ام سلمہ نے سو فرمایا آپ صلی اللہ علیہ وسلم نے کیوں نہ کہہ دیا اس سے کہ میں بھی یہ کام کرتا ہوں ام سلمہ نے کہا میں نے کہہ دیا لیکن وہ گئی اپنے خاوند کے پاس اور اس کو خبر کی سو اس کو اور زیادہ رنج ہوا اور وہ بولا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے سے نہیں ہیں حلال کرتا ہے اللہ جل جلہ لہ جو چاہتا ہے اپنے رسول کے لئے غصہ ہوئے رسول اللہ صلی اللہ علیہ وسلم اور فرمایا آپ صلی اللہ علیہ وسلم نے قسم اللہ کی تم سب سے زیادہ ڈرتا ہوں اللہ تعالیٰ سے اور تم سب سے زیادہ پہچانتا ہوں اس کی حدوں کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 643
			}
		},
		{
			"hadithnumber": 644,
			"arabicnumber": 644,
			"text": "حضرت ام المومنین عائشہ کہتی تھیں کہ رسول اللہ صلی اللہ علیہ وسلم بوسہ دیتے تھے اپنی بعض بیبیوں کو اور وہ رورزہ دار ہوتے تھے پھر ہنستی تھیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 644
			}
		},
		{
			"hadithnumber": 645,
			"arabicnumber": 645,
			"text": "یحیی بن سعید سے روایت ہے کہ عاتکہ بیوی حضرت عمر کی بوسہ دیتی تھیں سر کو حضرت عمر کے اور حضرت عمر روزہ دار ہوتے تھے لیکن ان کو منع نہیں کرتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 645
			}
		},
		{
			"hadithnumber": 646,
			"arabicnumber": 646,
			"text": "عائشہ بن طلحة سے روایت ہے کہ وہ ام المومنین عائشہ کے پاس بیٹھی تھیں اتنے میں ان کے خاوند عبداللہ بن عبدالرحمن بن ابی بکر صدیق آئے اور وہ روزہ دار تھے تو کہا ان سے حضرت عائشہ نے تم کیوں نہیں جاتے اپنی بی بی کے پاس بوسہ لو ان کا اور کھیلو ان سے تو کہا عبداللہ نے بوسہ لوں میں ان کا اور میں روزہ دار ہوں حضرت عائشہ نے کہا ہاں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 646
			}
		},
		{
			"hadithnumber": 647,
			"arabicnumber": 647,
			"text": "زید بن اسلم سے روایت ہے کہ ابوہریرہ اور سعد بن ابی وقاص روزہ دار کو اجازت دیتے تھے بوسہ کی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 647
			}
		},
		{
			"hadithnumber": 648,
			"arabicnumber": 648,
			"text": "امام مالک کو پہنچا کہ ام المومنین جب بیان کرتیں کہ رسول اللہ صلی اللہ علیہ وسلم بوسہ لیتے تھے روزہ میں تو فرماتیں کہ تم میں سے کون زیادہ قادر ہے اپنے نفس پر رسول اللہ صلی اللہ علیہ وسلم سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 648
			}
		},
		{
			"hadithnumber": 649,
			"arabicnumber": 649,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 649
			}
		},
		{
			"hadithnumber": 650,
			"arabicnumber": 650,
			"text": "عبداللہ بن عباس سے سوال ہوا روزہ دار کو بوسہ لینا کیسا ہے تو اجازت دی بوڑھے کو اور مکروہ رکھا جوان کے لئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 650
			}
		},
		{
			"hadithnumber": 651,
			"arabicnumber": 651,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر منع کرتے تھے روزہ دار کو بوسہ اور مباشرت سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 651
			}
		},
		{
			"hadithnumber": 652,
			"arabicnumber": 652,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نکلے مکہ کو جس سال مکہ فتح ہوا رمضان میں تو روزہ رکھا یہاں تک کہ پہنچے کدید کو پھر افطار کیا تو لوگوں نے بھی افطار کیا اور صحابہ کا یہ قاعدہ تھا کہ نئے کام کو لیتے تھے پھر لیا اس نئے کو رسول اللہ صلی اللہ علیہ وسلم کے کاموں میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 652
			}
		},
		{
			"hadithnumber": 653,
			"arabicnumber": 653,
			"text": "بعض صحابہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم کیا لوگوں کو سفر میں جس سال مکہ فتح ہوا ہے روزہ نہ رکھنے کا فرمایا آپ صلی اللہ علیہ وسلم نے تاکہ تم قوی رہو دشمن کے مقابلہ میں اور روزہ رکھا رسول اللہ صلی اللہ علیہ وسلم نے کہا ابوبکر بن عبدالرحمن نے مجھ سے بیان کیا اس صحابی نے جس نے حدیث بیان کی مجھ سے کہ میں نے دیکھا رسول اللہ صلی اللہ علیہ وسلم کو عرج میں کہ پانی ڈالا جاتا تھا آپ صلی اللہ علیہ وسلم کے سر پر پیاس کی وجہ سے یا گرمی کی وجہ سے پھر کہا گیا رسول اللہ صلی اللہ علیہ وسلم سے کہ بعض لوگوں نے بھی روزہ رکھا ہے آپ صلی اللہ علیہ وسلم کے روزہ رکھنے کے سبب سے تو جب پہنچے رسول اللہ صلی اللہ علیہ وسلم کدید میں ایک پیالہ پانی کا منگا یا اور پانی پیا تب لوگوں نے بھی روزہ کھول ڈالا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 653
			}
		},
		{
			"hadithnumber": 654,
			"arabicnumber": 654,
			"text": "انس بن مالک سے روایت ہے کہ ہم نے سفر کیا رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رمضان میں تو نہ عیب کیا روزہ دار نے روزہ کھولنے والے پر اور نہ بے روزہ دار نے روزہ دار پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 654
			}
		},
		{
			"hadithnumber": 655,
			"arabicnumber": 655,
			"text": "عروہ بن زبیر سے روایت ہے کہ حمزہ بن عمرو اسلمی نے کہا رسول اللہ صلی اللہ علیہ وسلم سے میں روزہ رکھا کرتا ہوں تو کیا روزہ رکھو سفر میں آپ صلی اللہ علیہ وسلم نے فرمایا تیرا جی چاہے تو روزہ رکھ چاہے نہ رکھ ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 655
			}
		},
		{
			"hadithnumber": 656,
			"arabicnumber": 656,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر روزہ نہیں رکھتے تھے سفر میں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 656
			}
		},
		{
			"hadithnumber": 657,
			"arabicnumber": 657,
			"text": "ہشام بن عروہ سے روایت ہے کہ عروہ بن زیبر سفر کرتے تھے رمضان میں اور ہم سفر کرتے تھے ساتھ ان کے تو روزہ رکھتے تھے اور ہم نہ رکھتے تھے سو ہم کو حکم نہیں کرتے تھے روزہ رکھنے کا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 657
			}
		},
		{
			"hadithnumber": 658,
			"arabicnumber": 658,
			"text": "امام مالک سے روایت ہے کہ حضرت عمر بن خطاب جب رمضان میں سفر میں ہوتے پھر ان کو معلوم ہوتا کہ آج کے روز شہر میں داخل ہوں گے دوپہر سے اول تو روزہ رکھ کر داخل ہوتے",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 658
			}
		},
		{
			"hadithnumber": 659,
			"arabicnumber": 659,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ ایک شخص نے روزہ توڑ ڈالا رمضان میں تو حکم کیا اس کو رسول اللہ صلی اللہ علیہ وسلم نے ایک بردہ آزاد کرنے کا یا دو مہینہ روزے رکھنے کا یا ساٹھ مسکینوں کو کھانا کھلانے کا سو اس نے کہا مجھ سے یہ کوئی کام نہیں ہو سکتا اتنے میں ایک ٹوکرا کھجور کا آپ صلی اللہ علیہ وسلم کے پاس آیا تو آپ صلی اللہ علیہ وسلم نے اس کو دیا اور کہا کہ اس کو صدقہ کر دے وہ شخص بولا یا رسول اللہ صلی اللہ علیہ وسلم مجھ سے زیادہ کوئی محتاج نہیں آپ صلی اللہ علیہ وسلم ہنسے یہاں تک کہ آپ صلی اللہ علیہ وسلم کی کچلیاں کھل گئیں پھر فرمایا آپ صلی اللہ علیہ وسلم نے تو ہی کھا لے اس کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 659
			}
		},
		{
			"hadithnumber": 660,
			"arabicnumber": 660,
			"text": "سعید بن مسیب سے روایت ہے کہ ایک اعرابی آیا رسول اللہ صلی اللہ علیہ وسلم کے پاس اپنا سینہ کوٹتا ہوا اور بال نوچتا ہوا اور کہتا تھا ہلاک ہوا وہ شخص جو دور ہے نیکیوں سے تو فرمایا رسول اللہ صلی اللہ علیہ وسلم نے کیا ہوا بولا میں نے صحبت کی اپنی بی بی سے رمضان کے روزہ میں تو فرمایا رسول اللہ صلی اللہ علیہ وسلم نے تو ایک بردہ آزاد کر سکتا ہے بولا نہیں فرمایا آپ صلی اللہ علیہ وسلم نے ایک اونٹ یا گائے ہدی کر سکتا ہے بولا نہیں اتنے میں ایک ٹوکرا کھجور کا آپ صلی اللہ علیہ وسلم کے پاس آیا آپ صلی اللہ علیہ وسلم نے فرمایا اس کو لے اور صدقہ کر وہ بولا مجھ سے زیادہ کوئی محتاج نہیں ہے یا رسول اللہ صلی اللہ علیہ وسلم آپ صلی اللہ علیہ وسلم نے فرمایا کھالے اس کو اور ایک روزہ رکھ لے اس دن کے بدلے میں جس دن تو نے یہ کام کیا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 660
			}
		},
		{
			"hadithnumber": 661,
			"arabicnumber": 661,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ وہ پچھنے لگاتے تھے روزے میں پھر اس کو چھوڑ دیا پھر جب روزہ دار ہوتے پچھنے نہ لگواتے یہاں تک کہ روزہ افطار کر تے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 661
			}
		},
		{
			"hadithnumber": 662,
			"arabicnumber": 662,
			"text": "ابن شہاب سے روایت ہے کہ سعد بن ابی وقاص اور عبداللہ بن عمر پچھنے لگواتے تھے روزے میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 662
			}
		},
		{
			"hadithnumber": 663,
			"arabicnumber": 663,
			"text": "عروہ بن زبیر پچھنے لگاتے تھے روزے میں پھر افطار نہیں کر تے تھے کہا ہشام نے میں نے کبھی نہیں دیکھا عروہ کو پچھنے لگاتے ہوئے مگر وہ روزہ سے ہوتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 663
			}
		},
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے انہوں نے کہا عاشورہ کے دن لوگ روزہ رکھتے تھے جاہلیت میں اور حضرت رسول اللہ صلی اللہ علیہ وسلم بھی اس دن روزہ رکھتے تھے زمانہ جاہلیت میں پھر جب آئے رسول اللہ صلی اللہ علیہ وسلم مدینہ میں تو روزہ رکھا آپ صلی اللہ علیہ وسلم نے اس دن اور لوگوں کو بھی حکم کیا اس دن روزہ رکھنے کا پھر جب فرض ہوا رمضان تو رمضان ہی کے روزے فرض رہ گئے اور عاشورہ کا روزہ چھوڑ دیا گیا سو جس کا جی چاہے اس دن روزہ رکھے اور جس کا جی چاہے نہ رکھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 664
			}
		},
		{
			"hadithnumber": 665,
			"arabicnumber": 665,
			"text": "حمید بن عبدالرحمن بن عوف سے روایت ہے انہوں نے سنا معاویہ بن ابی سفیان سے کہتے تھے جس سال انہوں نے حج کیا اور وہ منبر پر تھے اے اہل مدینہ کہاں ہیں علماء تمہارے سنا میں نے رسول اللہ صلی اللہ علیہ وسلم سے فرماتے تھے اس دن کو یہ دن عاشورہ کا ہے اس دن روزہ تمہارے اوپر فرض نہیں ہے اور میں روزہ دار ہوں سو جس کا جی چاہے روزہ رکھے اور جس کا جی چاہے نہ رکھے ۔ امام مالک کو پہنچا کہ حضرت عمر بن خطاب نے کہلا بھیجا حارث بن ہشام کو کہ کل عاشورے کا روزہ ہے تو روزہ رکھ اور حکم کر اپنے گھر والوں کو وہ روزہ رکھیں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 665
			}
		},
		{
			"hadithnumber": 666,
			"arabicnumber": 666,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 666
			}
		},
		{
			"hadithnumber": 667,
			"arabicnumber": 667,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ منع کیا رسول اللہ صلی اللہ علیہ وسلم نے دو دن روزے رکھنے سے ایک یوم الفطر دوسرے یوم الاضحی میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 667
			}
		},
		{
			"hadithnumber": 668,
			"arabicnumber": 668,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 668
			}
		},
		{
			"hadithnumber": 669,
			"arabicnumber": 669,
			"text": "عبداللہ بن عمر سے ورایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے منع کیا تہہ کے روزے رکھنے سے لوگوں نے کہا یا رسول اللہ صلی اللہ علیہ وسلم آپ صلی اللہ علیہ وسلم رکھتے ہیں فرمایا میں تمہاری طرح نہیں ہوں میں کھلایا جاتا ہوں پلایا جاتا ہوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 669
			}
		},
		{
			"hadithnumber": 670,
			"arabicnumber": 670,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا بچو تم تہہ کے روزے رکھنے سے لوگوں نے کہا آپ رکھتے ہیں یا رسول اللہ صلی اللہ علیہ وسلم، فرمایا میں تمہاری طرح نہیں ہوں مجھے رات کو میرا رب کھلا دیتا ہے اور پلا دیتا ہے ۔ سعید بن مسیب سے سوال ہوا کہ ایک شخص نے نذر کی ایک مہینہ روزے رکھنے کی اب اس کو نفل روزہ رکھنا درست ہے جواب دیا کہ پہلے نذر کے روزے رکھ لے پھر نفل رکھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 670
			}
		},
		{
			"hadithnumber": 671,
			"arabicnumber": 671,
			"text": "امام مالک کو پہنچاہے عبداللہ بن عمر سے پوچھتے کیا کوئی روزہ رکھے کسی کی طرف سے یا نماز پڑھے کسی کی طرف سے بولے نہ کوئی روزہ رکھے کسی کی طرف سے اور نہ کوئی نماز پڑھے کسی کی طرف سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 671
			}
		},
		{
			"hadithnumber": 672,
			"arabicnumber": 672,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 672
			}
		},
		{
			"hadithnumber": 673,
			"arabicnumber": 673,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 673
			}
		},
		{
			"hadithnumber": 674,
			"arabicnumber": 674,
			"text": "خالد بن اسلم سے روایت ہے کہ عمر بن خطاب نے ایک روزہ افطار کیا رمضان میں اور اس دن ابر تھا ان کو یہ معلوم ہوا کہ شام ہوگئی اور آفتاب ڈوب گیا پس ایک شخص آیا اور بولا یا امیر المومنین آفتاب نکل آیا حضرت عمر نے فرمایا اس کا تدارک سہل ہے ہم نے اپنے ظن پر عمل کیا تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 674
			}
		},
		{
			"hadithnumber": 675,
			"arabicnumber": 675,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر کہتے تھے جس شخص کے رمضان کے روزے قضا ہوں بیماری سے یا سفر سے تو ان کی قضا لگاتار رکھے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 675
			}
		},
		{
			"hadithnumber": 676,
			"arabicnumber": 676,
			"text": "ابن شہاب سے روایت ہے کہ عبداللہ بن عباس اور ابوہریرہ نے اختلاف کیا رمضان کی قضا میں ایک نے کہا کہ رمضان کے روزوں کی قضا پے درپے رکھنے ضروری نہیں دوسرے نے کہا پے درپے رکھنا ضروری ہے لیکن مجھے معلوم نہیں کہ کس نے ان دونوں میں سے پے درپے رکھنے کو کہا اور کس نے یہ کہا کہ پے درپے رکھنا ضروری نہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 676
			}
		},
		{
			"hadithnumber": 677,
			"arabicnumber": 677,
			"text": "عبداللہ بن عمر کہتے تھے جو شخص قصدا قے کرے روزے میں تو اس پر قضا واجب ہے اور جس کو خود قے آجائے تو اس پر قضا نہیں ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 677
			}
		},
		{
			"hadithnumber": 678,
			"arabicnumber": 678,
			"text": "یحیی بن سعید نے سنا سعید بن مسیب سے پوچھا گیا ان سے رمضان کی قضا کے بارے میں تو کہا سعید نے میرے نزدیک یہ بات اچھی ہے کہ رمضان کی قضا پے درپے رکھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 678
			}
		},
		{
			"hadithnumber": 679,
			"arabicnumber": 679,
			"text": "حمید بن قیس مکی سے روایت ہے کہ میں ساتھ تھا مجاہد کے اور طواف کر رہے تھے خانہ کعبہ کا اتنے میں ایک آدمی آیا اور پوچھا کہ قسم کے کفارے کے روزے پے درپے ہیں یا جدا جدا حمید نے کہا ہاں جدا جدا بھی رکھ سکتا ہے اگر چاہے مجاہد نے کہا نہیں کیونکہ ابی بن کعب کی قرأت میں ہے ثلثة ایام متتابعات یعنی روزے تین دن کے پے درپے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 679
			}
		},
		{
			"hadithnumber": 680,
			"arabicnumber": 680,
			"text": "ابن شہاب سے روایت ہے کہ حضرت ام المومنین عائشہ اور ام المومنین حفصہ صبح اٹھیں نفل روزہ رکھ کر پھر کھانے کا حصہ آیا تو انہوں نے روزہ کھول ڈالا اتنے میں رسول اللہ صلی اللہ علیہ وسلم تشریف لائے عائشہ فرماتی ہیں کہ حفصہ نے کہا شروع کر دیا مجھے بولنے نہ دیا آخر اپنے باپ کی بیٹی تھیں یا رسول اللہ صلی اللہ علیہ وسلم میں اور عائشہ صبح کو اٹھیں نفل روزہ رکھ کر تو ہمارے پاس حصہ آیا کھانے کا ہم نے روزہ کھول ڈالا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس کے عوض میں ایک روزہ قضا کا رکھو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Munqar"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 680
			}
		},
		{
			"hadithnumber": 681,
			"arabicnumber": 681,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 681
			}
		},
		{
			"hadithnumber": 682,
			"arabicnumber": 682,
			"text": "امام مالک کو پہنچا انس بن مالک بوڑھے ہو گئے تھے یہاں تک کہ روزہ نہ رکھ سکتے تھے تو فدیہ دیتے تھے ۔ امام مالک کو پہنچا کہ عبداللہ بن عمر سے سوال ہوا کہ حاملہ عورت اگر خوف کرے اپنے حمل کا اور روزہ نہ رکھ سکے تو کہا انہوں نے روزہ نہ رکھے اور ہر روزے کے بدلے میں ایک مسکین کو ایک مد گیہوں دے رسول اللہ صلی اللہ علیہ وسلم کے مد سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 682
			}
		},
		{
			"hadithnumber": 683,
			"arabicnumber": 683,
			"text": "قاسم بن محمد سے روایت ہے وہ کہتے تھے جس شخص پر رمضان کی قضا لازم ہو پھر وہ قضا نہ کرے یہاں تک کہ دوسرا رمضان آجائے اور وہ قادر رہا ہو روزے پر تو ہر روزے کے بدلے میں ایک ایک مسکین کو ایک ایک مد گیہوں کا دے اور قضا بھی رکھے ۔ امام مالک کو سعید بن جبیر سے بھی ایسا ہی پہنچا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 683
			}
		},
		{
			"hadithnumber": 685,
			"arabicnumber": 685,
			"text": "ام المومنین عائشہ فرماتی ہیں میرے اوپر روزے ہوتے تھے رمضان کے اور میں قضا رکھ نہیں سکتی تھی یہاں تک کہ شعبان آجاتا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 685
			}
		},
		{
			"hadithnumber": 686,
			"arabicnumber": 686,
			"text": "ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم روزے رکھتے تھے یہاں تک کہ ہم کہتے تھے اب افطار نہ کریں گے اور پھر افطار کرتے تھے یہاں تک کہ ہم کہتے تھے اب روزہ نہ رکھیں گے اور میں نے نہیں دیکھا رسول اللہ صلی اللہ علیہ وسلم کو کہ کسی مہینہ کے پورے روزہ رکھے ہوں سوائے رمضان کے اور کسی مہینے میں شعبان سے زیادہ روزے نہ رکھتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 686
			}
		},
		{
			"hadithnumber": 687,
			"arabicnumber": 687,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا روزہ ڈھال ہے تو جب تم میں سے کوئی روزہ دار ہو تو چاہیے کہ بے ہودہ نہ بکے اور جہالت نہ کرے اگر کوئی شخص اسے گالیاں بکے یا لڑے تو کہہ دے میں روزہ دار ہوں میں روزہ دار ہوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 687
			}
		},
		{
			"hadithnumber": 688,
			"arabicnumber": 688,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا قسم ہے اس ذات کی جس کے قبضے میں میری جان ہے البتہ روزہ دار کے منہ کی بو زیادہ پسند ہے مشک کی بو سے اللہ جل جلالہ کے نزدیک کیونکہ وہ چھوڑ دیتا ہے اپنی خواہشوں کو اور کھانے کو اور پانی کو میرے واسطے تو وہ روزہ میرے واسطے ہے اور میں اس کا بدلہ دوں گا جو نیکی ہے اس کا ثواب دس گنے سے لے کر سات سو گنے تک ملے گا مگر روزہ وہ میرے واسطے ہے اور اس کا ثواب بھی میں ہی دوں گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 688
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": 689,
			"text": "ابوہریرہ نے کہا جب رمضان آتا ہے تو جنت کے دروازے کھول دیئے جاتے ہیں اور جہنم کے دروازے بند کئے جاتے ہیں اور شیطان باندھ دیئے جاتے ہیں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 689
			}
		}
	]
}