{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"22": "Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1009,
			"arabicnumber": 1009,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ سعد بن عبادہ نے پوچھا رسول اللہ صلی اللہ علیہ وسلم سے کہ میری ماں مر گئی اور اس پر ایک نذر واجب تھی اس نے ادا نہیں کی آپ نے فرمایا تو ادا کرو اس کی طرف سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1009
			}
		},
		{
			"hadithnumber": 1010,
			"arabicnumber": 1010,
			"text": "عبداللہ بن ابی بکر سے روایت ہے کہ انہوں نے سنا اپنی پھوپھی سے انہوں نے بیان کیا کہ ان کی دادی نے نذر کی مسجد قبا میں پیدل جانے کی پھر مر گئیں اور اس نذر کو ادا نہیں کیا تو عبداللہ بن عباس نے ان کی بیٹی کو حکم کیا کہ وہ ان کی طرف سے اس نذر کو ادا کریں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1010
			}
		},
		{
			"hadithnumber": 1011,
			"arabicnumber": 1011,
			"text": "عبداللہ بن ابی حبیبہ سے روایت ہے کہ میں نے کہا ایک شخص سے اور میں کمسن تھا کہ اگر کوئی شخص صرف اتنا ہی کہے کہ علی مشئی الی بیت اللہ یعنی میرے اوپر پیدل چلنا ہے بیت اللہ تک اور یہ نہیں کہا کہ میرے اوپر نذر ہے پیدل چلنے کی بیت اللہ تک تو اس پر کچھ لازم نہیں آتا، وہ شخص مجھ سے بولا کہ میرے ہاتھ میں یہ ککڑی ہے تجھے دیتا ہوں تو اتنا کہہ دے کہ میرے اوپر پیدل چلنا ہے بیت اللہ تک میں نے کہا ہاں کہتا ہوں تو میں نے کہہ دیا اور میں کم سن تھا پھر ٹھہر کر تھوڑی دیر میں مجھے عقل آئی اور لوگوں نے مجھ سے کہا کہ تجھ پیدل چلنا بیت اللہ تک واجب ہوا میں سعید بن مسیب کے پاس آیا اور ان سے پوچھا انہوں نے بھی کہا کہ تجھ پر پیدل چلنا واجب ہوا بیت اللہ تک تو میں پیدل چلا بیت اللہ تک ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1011
			}
		},
		{
			"hadithnumber": 1012,
			"arabicnumber": 1012,
			"text": "عروہ بن اذینه لیثی سے روایت ہے کہ کہا میں نکلا اپنی دادی کے ساتھ اور اس نے نذر کی تھی بیت اللہ تک پیدل جانے کی، راستے میں تھک گئیں تو اپنے غلام کو بھیجا عبداللہ بن عمر کے پاس مسئلہ پوچھنے کو میں بھی ساتھ گیا اس نے عبداللہ بن عمر سے پوچھا انہوں نے جواب دیا کہ اب سوار ہو جائے پھر دوبارہ جب آئے جہاں سے سوار ہوئی تھیں وہاں سے پیدل چلے ۔ کہا مالک نے اور باوجود اس کے ایک ہدیہ بھی اس پر واجب ہے ۔ سعید بن مسیب اور ابا سلمہ بن عبدالرحمن کہتے تھے اس مسئلہ میں جیسا عبداللہ بن عمر نے کہا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1012
			}
		},
		{
			"hadithnumber": 1014,
			"arabicnumber": 1014,
			"text": "یحیی بن سعید نے کہا میں نے بیت اللہ تک پیدل چلنے کی نذر کی تھی میری ناف میں درد ہونے لگا میں سوار ہو کر مکے میں آیا اور عطا بن ابی رباح وغیرہ سے پوچھا انہوں نے کہا تجھ کو ہدی لازم ہے جب میں مدینہ آیا وہاں لوگوں سے پوچھا انہوں نے کہا تجھ کو دوبارہ پیدل چلنا چاہئے جہاں سے سوار ہوا تھا تو پیدل چلائیں ۔ کہا مالک نے ہمارے نزدیک جو شخص یہ کہے کہ مجھ پر پیدل چلنا ہے بیت اللہ تک اور چلے پھر عاجز ہو جائے تو سوار ہو جائے پھر دوبارہ جب آئے تو جہاں سے سوار ہوا تھا وہاں سے پیدل چلے اگر چلنے کی طاقت نہ ہو تو جہاں تک ہو سکے چلے پھر سوار ہو جائے اور ہدی میں ایک اونٹ یا گائے دے اگر نہ ہو سکے تو بکری دے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1014
			}
		},
		{
			"hadithnumber": 1015,
			"arabicnumber": 1015,
			"text": "حمید بن قیس اور ثور بن زید سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو دھوپ میں کھڑا ہوا دیکھا آپ صلی اللہ علیہ وسلم نے اس کا باعث پوچھا لوگوں نے کہا اس نے نذر کی ہے کہ میں کسی سے بات نہ کروں گا نہ سایہ لوں گا نہ بیٹھوں گا اور روزہ سے رہوں گا۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کو حکم کرو بات کرے، سایہ میں آئے، بیٹھے، روزہ اپنا پورا کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1015
			}
		},
		{
			"hadithnumber": 1016,
			"arabicnumber": 1016,
			"text": "قاسم بن محمد سے روایت ہے کہ ایک عورت عبداللہ بن عباس کے پاس آئی اور بولی میں نے نذر کی اپنے بیٹے کو ذبح کرنے کی ابن عباس نے کہا مت ذبح کر اپنے بیٹے کو اور کفارہ دے اپنی قسم کا ایک شخص بولا ابن عباس رضی اللہ تعالیٰ عنہما سے اس نذر میں کفارہ کیوں ہوگا ابن عباس نے جواب دیا کہ ظہار بھی ایک معصیت ہے اور اس میں اللہ نے کفارہ مقرر کیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1016
			}
		},
		{
			"hadithnumber": 1017,
			"arabicnumber": 1017,
			"text": "کہا مالک نے رسول اللہ صلی اللہ علیہ وسلم نے جو یہ فرمایا اگر کوئی نذر کرے اللہ کی معصیت کی تو معصیت نہ کرے مراد اس سے یہ ہے کہ مثلا آدمی نذر کرے شام یا مصر یا جدہ یا زبدہ میں جانے کی یا اور کسی کام کی جو ثواب نہیں ہے اگر ایسے امورات میں اس کی قسم ٹوٹے مثلا یوں کہے کہ اگر میں زید سے بات کروں تو مصر جاؤں گا پھر زید سے پات کرے تو اس پر کچھ لازم نہیں آتا بلکہ اس نذر کا پورا کرنا ضرور ہے جس میں ثواب ہو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1017
			}
		},
		{
			"hadithnumber": 1018,
			"arabicnumber": 1018,
			"text": "حضرت ام المومنین عائشہ فرماتی تھیں کہ لغو قسم وہ ہے جو آدمی باتوں میں کہتا ہے نہیں و اللہ ہاں و اللہ ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1018
			}
		},
		{
			"hadithnumber": 1019,
			"arabicnumber": 1019,
			"text": "عبداللہ بن عمر کہتے تھے جو شخص قسم کھائے اللہ کی پھر کہے انشاء اللہ پھر نہ کرے اس کام کو جس پر قسم کھائی تھی تو اس کی قسم نہیں ٹوٹے گی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1019
			}
		},
		{
			"hadithnumber": 1020,
			"arabicnumber": 1020,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص قسم کھائے کسی کام پر پھر اس کے خلاف بہتر معلوم ہو تو کفارہ دے قسم کا اور کرے جو بہتر معلوم ہو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1020
			}
		},
		{
			"hadithnumber": 1021,
			"arabicnumber": 1021,
			"text": "عبداللہ بن عمر کہتے تھے جو شخص قسم کھائے پھر اس کو مکرر سہ کرر کہے پھر قسم توڑے تو اس پر ایک بردے کا آزاد کرنا یا دس مسکینوں کو کپڑا پہنانا لازم آئے گا اگر ایک ہی مرتبہ کہے تو دس مسکینوں کو کھانا دے ہر مسکین کو ایک مد گہیوں کا اگر اس پر قدرت نہ ہو تو تین روزے رکھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1021
			}
		},
		{
			"hadithnumber": 1022,
			"arabicnumber": 1022,
			"text": "عبداللہ بن عمر جب اپنی قسم کا کفارہ دیتے تھے تو دس مسکینوں کو کھانا کھلاتے تھے اور ہر مسکین کو ایک مد گہیوں کا دیتے تھے اور جب ایک قسم کو چند بار کہتے تھے تو اتنے ہی بردے آزاد کرتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1022
			}
		},
		{
			"hadithnumber": 1023,
			"arabicnumber": 1023,
			"text": "سلیمان بن یسار نے کہا کہ میں نے لوگوں کو دیکھا کہ جب کفارہ قسم کا دیتے تھے تو ہر ایک مسکین کو ایک مد گہیوں کا چھوٹے مد سے دیا کرتے تھے اور اس کو کافی سمجھتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1023
			}
		},
		{
			"hadithnumber": 1024,
			"arabicnumber": 1024,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ملے عمر بن خطاب سے اور وہ جا رہے تھے سواروں میں اور قسم کھا رہے تھے اپنے باپ کی فرمایا آپ صلی اللہ علیہ وسلم نے اللہ جل جلالہ منع کرتا ہے تم کو اس بات سے کہ قسم کھاؤ تم اپنے باپو کی جو شخص تم میں سے قسم کھانی چاہے تو اللہ کی قسم کھائے یا چپ رہے ۔ امام مالک کو پہنچا رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے قسم مقلب القلوب کی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1024
			}
		},
		{
			"hadithnumber": 1025,
			"arabicnumber": 1025,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1025
			}
		},
		{
			"hadithnumber": 1026,
			"arabicnumber": 1026,
			"text": "ابن شہاب سے روایت ہے کہ ابولبابہ کی توبہ جب اللہ نے قبول کی تو انہوں نے کہا یا رسول اللہ صلی اللہ علیہ وسلم کیا چھوڑ دوں میں اپنی قوم کے گھر کو جس میں میں نے گناہ کیا اور آپ صلی اللہ علیہ وسلم کے قریب رہوں اور اپنے مال میں سے صدقہ نکالوں اللہ ورسول اللہ صلی اللہ علیہ وسلم کے واسطے تو فرمایا آپ صلی اللہ علیہ وسلم نے تہائی مال تجھ کو اپنے مال میں سے صدقہ نکالنا کافی ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1026
			}
		},
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "حضرت عائشہ سے سوال ہوا ایک شخص نے کہا مال میرا کعبہ کے دروازے پر وقف ہے انہوں نے کہا اس میں کفارہ قسم کا لازم آئے گا ۔ کہا مالک نے جو شخص یہ کہے کہ مال میرا اللہ کی راہ میں ہے تو تہائی مال صدقہ کرے کیونکہ آپ صلی اللہ علیہ وسلم نے ابی لبابہ کو ایسا ہی حکم کیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 1027
			}
		}
	]
}