{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"25": "Game"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "نافع نے کہا میں نے دو چڑیاں ماریں پتھر سے جرف میں ایک مر گئی اس کو پھینک دیا عبداللہ بن عمر نے اور دوسری کو دوڑے ذبح کرنے کو بسولے سے وہ مر گئی ذبح سے پہلے، اس کو بھی پھینک دیا عبداللہ بن عمر نے قاسم بن محمد؛ اس جانور کو کھانا مکروہ جانتے تھے جو لاٹھی یا گولی سے مارا جائے سعید بن مسیب مکروہ جانتے تھے ہلے ہوئے جانور کا مارنا اس طرح جیسے شکار کو مارتے ہیں تیر وغیرہ سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1052
			}
		},
		{
			"hadithnumber": 1053,
			"arabicnumber": 1053,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1053
			}
		},
		{
			"hadithnumber": 1054,
			"arabicnumber": 1054,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1054
			}
		},
		{
			"hadithnumber": 1055,
			"arabicnumber": 1055,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1055
			}
		},
		{
			"hadithnumber": 1056,
			"arabicnumber": 1056,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1056
			}
		},
		{
			"hadithnumber": 1057,
			"arabicnumber": 1057,
			"text": "عبداللہ بن عمر کہتے ہیں اگرچہ وہ کتا اس شکار میں سے کچھ کھالے تب بھی اس کا کھانا درست ہے ۔ سعد بن ابی وقاص سے سوال ہوا کہ سیکھتا ہوا کتا اگر شکار کو مار کر کھالے تو؟ سعد نے کہا کہ تو کھالے جس قدر بچ رہے اگرچہ ایک ہی بوٹی ہو ۔ کہا مالک نے میں نے سنا اہل علم سے کہتے تھے کہ باز اور عقاب اور صقر اور جو جانور ان کے مشابہ ہیں اگر ان کو تعلیم دی جائے اور وہ سمجھدار ہو جائیں جیسے سکھائے ہوئے کتے سمجھدار ہوتے ہیں تو ان کا مارا ہوا جانور بھی درست ہے بشرطیکہ بسم اللہ کہہ کر چھوڑے جائیں ۔۔ کہا مالک نے اگر باز کے پنچے سے یا کتے کے منہ سے شکار چھوٹ کر مر جائے تو اس کا کھانا درست نہیں ۔ کہا مالک نے نے جس جانور کے ذبح کرنے پر آدمی قادر ہو جائے مگر اس کو ذبح نہ کرے اور باز کے پنجے یا کتے کے منہ میں رہنے دے یہاں تک کہ باز یا کتا اس کو مار ڈالے تو اس کا کھانا درست نہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1057
			}
		},
		{
			"hadithnumber": 1058,
			"arabicnumber": 1058,
			"text": "عبدالرحمن بن ابی ہریرہ نے پوچھا عبداللہ بن عمر سے اس جانور کے بارے جس کو دریا پھینک دے، تو منع کیا عبداللہ نے اس کے کھانے سے، پھر عبداللہ گھر گئے اور کلام اللہ کو منگوایا اور پڑھا اس آیت کو \"حلال کیا گیا واسطے تمہارے شکار دریا کا اور طعام دریا کا \" نافع نے کہا پھر عبداللہ بن عمر نے مجھ کو بھیجا عبدالرحمن بن ابی اہریرہ کے پاس یہ کہنے کو کہ اس جانور کا کھانا درست ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1058
			}
		},
		{
			"hadithnumber": 1059,
			"arabicnumber": 1059,
			"text": "سعد جاری مولیٰ عمر بن خطاب نے کہا کہ میں نے پوچھا عبداللہ بن عمر سے جو مچھلیاں ان کو مچھلیاں مار ڈالیں یا سردی سے مر جائیں انہوں نے کہا ان کا کھانا درست ہے پھر میں نے عبداللہ بن عمر سے پوچھا انہوں نے بھی ایسا ہی کہا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1059
			}
		},
		{
			"hadithnumber": 1060,
			"arabicnumber": 1060,
			"text": "ابوہریرہ اور زید بن ثابت اس جانور کا کھانا جس کو دریا پھینک دے درست جانتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1060
			}
		},
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "ابی سلمہ بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ کچھ لوگ جار کے رہنے والے مروان کے پاس آئے اور پوچھا کہ جس جانور کو دریا پیھنک دے اس کا کیا حکم ہے مروان نے کہا اس کا کھانا درست ہے اور تم جاؤ زید بن ثابت اور ابوہریرہ کے پاس اور پوچھو ان سے پھر مجھ کو آن کر خبر کرو کیا کہتے ہیں، انہوں نے پوچھا ان دونوں سے دونوں نے کہا درست ہے ان لوگوں نے پھر آن کر مروان سے کہا مروان نے کہا میں نے تو تم سے پہلے ہی کہہ چکا تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1061
			}
		},
		{
			"hadithnumber": 1062,
			"arabicnumber": 1062,
			"text": "ابو ثعلبہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہر درندے دانت والے کا کھانا حرام ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1062
			}
		},
		{
			"hadithnumber": 1063,
			"arabicnumber": 1063,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر درندے دانت والے کا کھانا حرام ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1063
			}
		},
		{
			"hadithnumber": 1064,
			"arabicnumber": 1064,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم اپنی زوجہ میمونہ کے غلام کی مردار بکری کے پاس سے گزرے ، یہ بکری آپ صلی اللہ علیہ وسلم نے اس غلام کو دی تھی۔ فرمایا آپ صلی اللہ علیہ وسلم نے کیوں کام میں نہ لائے تم کھال اس کی، انہوں نے کہا یا رسول اللہ صلی اللہ علیہ وسلم وہ مردار ہے آپ صلی اللہ علیہ وسلم نے کہا مردار کا کھانا حرام ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1064
			}
		},
		{
			"hadithnumber": 1065,
			"arabicnumber": 1065,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو کھال دباغت کی جائے پاک ہو جائے گی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1065
			}
		},
		{
			"hadithnumber": 1066,
			"arabicnumber": 1066,
			"text": "حضرت عائشہ زوجہ نبی صلی اللہ علیہ وسلم سے روایت ہے کہ کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا مردار کی کھالوں سے نفع اٹھانے کو جب دباغت کرلی جائیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1066
			}
		}
	]
}