{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"3": "Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 146,
			"arabicnumber": 146,
			"text": "یحیی بن سعید انصاری سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے قصد کیا دو لکڑیاں بنانے کا اس لئے کہ جب ان کو ماریں تو آواز پہنچے لوگوں کو اور جمع ہوں لوگ نماز کے لئے پس دکھائے گئے عبداللہ بن زید دو لکڑیاں اور کہا کہ یہ لکڑیاں تو ایسی ہیں جیسی رسول اللہ صلی اللہ علیہ وسلم نے چاہیں پھر کہا گیا ان سے خواب میں کہ تم نماز کے لئے اذان کیوں نہیں دیتے تو جب جاگے تو رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور ان سے خواب بیان کیا تو نبی صلی اللہ علیہ وسلم نے اذان کا حکم دیا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mursal Sahih Isnaad"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 147,
			"arabicnumber": 147,
			"text": "ابو سعید خدری سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب سنو تم اذان کو تو کہو جیسا کہ کہتا جاتا ہے مؤذن ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 148,
			"arabicnumber": 148,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے اگر معلوم ہوتا لوگوں کو جو کچھ اذان دینے میں اور صف اول میں ثواب میں پھر نہ پا سکتے ان کو بغیر قرعہ کے البتہ قرعہ ڈالتے اور اگر معلوم ہوتا لوگوں کو جو کچھ نماز کے اول وقت پڑھنے میں ثواب ہے البتہ جلدی کرتے اس کی طرف اور اگر معلوم ہوتا جو کچھ ثواب ہے عشاء اور صبح کی نماز باجماعت پڑھنے کا البتہ آتے جماعت میں گھٹنوں کے بل گھسٹتے ہوئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 149,
			"arabicnumber": 149,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب تکبیر ہو نماز کی تو نہ دوڑتے ہوئے آؤ تم بلکہ اطمینان اور سہولت سے تو جتنی نماز تم کو ملے پڑھ لو اور جو نہ ملے اس کو پورا کرلو کیونکہ جب کوئی تم میں سے قصد کرتا ہے نماز کا تو وہ نماز ہی میں ہوتا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 150,
			"arabicnumber": 150,
			"text": "عبداللہ بن عبدالرحمن انصاری سے ابوسعید خدری نے کہا کہ تو بکریوں کو اور جنگل کو دوست رکھتا ہے تو جب جنگل میں ہو اپنی بکریوں میں اذان دے نماز کی بلند آواز سے کیونکہ نہیں پہنچتی آواز مؤذن کی نہ جن کو نہ آدمی کو اور نہ کسی شئے کو مگر وہ گواہ ہوتا ہے اس کا قیامت کے روز کہا ابوسعید نے سنا میں نے اس کو رسول اللہ صلی اللہ علیہ وسلم سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 151,
			"arabicnumber": 151,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 152,
			"arabicnumber": 152,
			"text": "سہل بن سعد سے روایت ہے کہا انہوں نے دو وقت کھل جاتے ہیں دراوزے آسمان کے اور کم ہوتا ہے ایسا دعا کر نیوالا کہ نہ قبول ہو دعا اس کی ایک جس وقت اذان ہو نماز کی دوسری جس وقت صف باندھی جائے جہاد کے لئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 153,
			"arabicnumber": 153,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ جب اذان ہوتی ہے نماز کے لئے شیطان پیٹھ موڑ کر پادتا ہوا بھاگتا ہے تاکہ نہ سنے اذان کو پھر جب اذان ہو چکتی ہے چلا آتا ہے پھر جب تکبیر ہوتی ہے بھاگ جاتا ہے پیٹھ موڑ کر پھر جب تکبیر ہو چکتی ہے چلا آتا ہے یہاں تک کہ وسوسہ ڈالتا ہے نمازی کے دل میں اور کہتا ہے اس سے خیال کر فلاں چیز کا خیال کر جس کو خیال نماز کو اول بھی نہ تھا یہاں تک کہ رہ جاتا ہے نماز اور خبر نہیں ہوتی اس کو کہ کتنی رکعتیں پڑھیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 154,
			"arabicnumber": 154,
			"text": "مالک بن ابی عامر اصبحی جو دادا ہیں امام مالک کے کہتے ہیں کہ میں نہیں دیکھتا کسی چیز کو کہ باقی ہو اس طور پر جس پر پایا میں نے صحابہ کو مگر اذان کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 155,
			"arabicnumber": 155,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر نے تکبیر سنی اور وہ بقیع میں تھے تو جلدی جلدی چلے مسجد کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 156,
			"arabicnumber": 156,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر نے اذان دی رات کو جس میں سردی اور ہوا بہت تھی پھر کہا کہ نماز پڑھ لو اپنے اپنے ڈیروں میں پھر کہا ابن عمر نے کہ رسول اللہ صلی اللہ علیہ وسلم حکم کرتے تھے مؤذن کو جب رات ٹھنڈی ہوتی تھی پانی برستا تھا یہ کہ پکارے نماز پڑھ لو اپنے ڈیروں میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 157,
			"arabicnumber": 157,
			"text": "نافع سے روایت ہے عبداللہ بن عمر سفر میں صرف تکبیر کہتے تھے مگر نماز فجر میں اذان بھی کہتے تھے اور عبداللہ بن عمر یہ بھی کہا کرتے تھے کہ اذان اس امام کے لئے ہے جس کے پاس لوگ جمع ہوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 158,
			"arabicnumber": 158,
			"text": "ہشام بن عروہ سے ان کے باپ نے کہا کہ جب تو سفر میں ہو تو تجھے اختیار ہے چاہے اذان یا اقامت دونوں کہہ یا فقط اقامت کہہ اور اذان نہ دے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 159,
			"arabicnumber": 159,
			"text": "سعید بن مسیب نے کہا جو شخص نماز پڑھتا ہے چٹیل میدان میں تو داہنی طرف اس کے ایک فرشتہ اور بائیں طرف اس کے ایک فرشتہ نماز پڑھتا ہے اور اگر اس نے اذان دے کر تکبیر کہہ کر نماز پڑھی تو اس کے پیچھے بہت سے فرشتے نماز پڑھتے ہیں مثل پہاڑوں کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 160,
			"arabicnumber": 160,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے بلال رات رہے سے اذان دے دیتے ہیں تو کھایا پیا کرو جب تک اذان دے عبداللہ بیٹا ام مکتوم کا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 161,
			"arabicnumber": 161,
			"text": "سالم بن عبداللہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے بلال اذان دیتا ہے رات کو تو کھایا پیا کرو جب تک اذان نہ دے بیٹا ام مکتوم کا کہا ابن شہاب نے یا سالم نے یا عبداللہ بن عمر نے کہا تھا بیٹا ام مکتوم کا نابینا اذان نہ دیتا تھا جب تک لوگ اس سے نہ کہتے تھے صبح ہوگئی صبح ہوگئی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 162,
			"arabicnumber": 162,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب شروع کرتے تھے نماز کو اٹھاتے تھے دونوں ہاتھ برابر دونوں مونڈھوں کے اور جب سر اٹھاتے تھے رکوع سے تب بھی دونوں ہاتھوں کو اسی طرح اٹھاتے اور کہتے سمع اللہ لمن حمدہ ربنا ولک الحمد اور سجدوں کے بیچ میں ہاتھ نہ اٹھاتے نہ سجدے کو جاتے وقت ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 163,
			"arabicnumber": 163,
			"text": "امام زین العابدین سے جن کا اسم مبارک علی ہے اور وہ بیٹے ہیں حضرت امام حسین بن علی بن ابی طالب کے روایت کرتے ہیں رسول اللہ صلی اللہ علیہ وسلم تکیبر کہتے نماز میں جب جھکتے اور جب اٹھتے اور ہمیشہ رہے اسی طور سے نماز ان کی یہاں تک کہ مل گئے اللہ جل جلالہ سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 164,
			"arabicnumber": 164,
			"text": "سلیمان بن یسار سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم اٹھاتے تھے ہاتھوں کو نماز میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 165,
			"arabicnumber": 165,
			"text": "ابو سلمہ سے روایت ہے کہ ابوہریرہ امام ہوتے تھے ان کے تو تکبیر کہتے تھے جب جھکتے اور جب اٹھتے اور پھر جب فارغ ہوئے تو کہا قسم اللہ کی میں زیادہ مشابہ ہوں تم سب میں رسول اللہ صلی اللہ علیہ وسلم کی نماز میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 166,
			"arabicnumber": 166,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 168,
			"arabicnumber": 168,
			"text": "وہب بن کیسان سے روایت ہے کہ جابر بن عبداللہ انصاری سکھاتے تھے ان کو تکبیر نماز میں تو حکم کرتے تھے کہ تکیبر کہیں ہم جب جھکیں ہم اور اٹھیں ہم ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 169,
			"arabicnumber": 169,
			"text": "ابن شہاب کہتے تھے جب پا لیا کسی شخص نے رکوع اور تکبیر کہہ لی تو یہ تکبیر کافی ہو جائے کی تکبیر تحریمہ سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 170,
			"arabicnumber": 170,
			"text": "جبیر بن مطعم سے روایت ہے کہ سنا انہوں نے رسول اللہ صلی اللہ علیہ وسلم نے پڑھا سورت طور کو مغرب کی نماز میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 171,
			"arabicnumber": 171,
			"text": "ام فضل نے عبداللہ بن عباس کو سورت المرسلات عرفا پڑھتے سنا تو کہا اے بیٹے میرے! یاد دلا دیا تو نے یہ سورت پڑھ کر اخیر جو سنا میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس سورت کو پڑھا تھا آپ صلی اللہ علیہ وسلم نے مغرب میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 172,
			"arabicnumber": 172,
			"text": "ابو عبداللہ صنابحی سے روایت ہے کہ میں آیا مدینہ میں جب ابوبکر خلیفہ تھے تو پڑھی میں نے پیچھے ان کے مغرب کی نماز تو پہلی دو رکعتوں میں سورت فاتحہ اور ایک سورت مفصل کو چھوٹی سورتوں میں سے پڑھی پھر جب تیسری رکعت کے واسطے کھڑے ہوئے تو میں نزدیک ہو گیا ان کے یہاں تک کہ میرے کپڑے قریب تھے کہ چھو جائیں ان کے کپڑوں سے تو سنا میں نے پڑی انہوں نے سورت فاتحہ اور اس آیت کو ربنا (رَبَّنَا لَا تُزِغْ قُلُوْبَنَا بَعْدَ اِذْ ھَدَيْتَنَا وَھَبْ لَنَا مِنْ لَّدُنْكَ رَحْمَةً اِنَّكَ اَنْتَ الْوَھَّابُ) 3۔ ال عمران : 8)۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 173,
			"arabicnumber": 173,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر جب اکیلے نماز پڑھتے تھے تو چاروں رکعتوں میں سورت فاتحہ اور ایک ایک سورت پڑھتے تھے اور کبھی دو دو تین سورتیں ایک رکعت میں پڑھتے تھے فرض کی نماز میں اور مغرب کی نماز میں دو رکعتوں میں فاتحہ اور سورت پڑھتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 174,
			"arabicnumber": 174,
			"text": "برا بن عازب سے روایت ہے کہ میں نے نماز پڑھی ساتھ رسول اللہ صلی اللہ علیہ وسلم کے عشاء کی تو پڑھی آپ صلی اللہ علیہ وسلم نے اس میں والتین والزیتوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 175,
			"arabicnumber": 175,
			"text": "حضرت علی سے روایت ہے کہ منع کیا حضرت نے ریشمی کپڑا اور سونے کی انگوٹھی پہننے سے اور قرآن کو رکوع میں پڑھنے سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 176,
			"arabicnumber": 176,
			"text": "فروہ بن عمرو سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم آئے لوگوں کے پاس اور وہ نماز پڑھ رہے تھے آوازیں ان کی بلند تھیں کلام اللہ پڑھنے سے تو فرمایا آپ صلی اللہ علیہ وسلم نے نمازی کانا پھوسی کرتا ہے اپنے پروردگار سے تو چاہئے کہ سمجھ کر کانا پھوسی کرے اور نہ پکارے ایک تم میں دوسرے پر قرآن میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 177,
			"arabicnumber": 177,
			"text": "انس بن مالک نے کہا نماز کو کھڑا ہوا میں پیچھے ابوبکر اور عمر اور عثمان کے جب نماز شروع کرتے تو کوئی ان میں سے بسم اللہ الرحمن الرحیم نہ پڑھتا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 178,
			"arabicnumber": 178,
			"text": "مالک بن ابی عامر اصبحی سے روایت ہے کہ ہم سنتے تھے قرأت عمر بن خطاب کی اور وہ ہوتے تھے نزدیک دار ابی جہم کے اور ہم ہوتے تھے بلاط میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 179,
			"arabicnumber": 179,
			"text": "نافع سے روایت ہے عبداللہ بن عمر جب فوت ہو جاتی کچھ نماز ان کی ساتھ امام کے جس میں پکار کر قرأت کی ہوتی تو جب سلام پھیرتا امام، اٹھتے عبداللہ بن عمر اور پڑھتے جو رہ گئی تھی نماز میں پکار کر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 180,
			"arabicnumber": 180,
			"text": "یزید بن رومان سے روایت ہے کہ میں نماز پڑھتا تھا نافع کے ایک جانب تو اشارہ کر دیتے تھے مجھ کو واپس بتا دیتا تھا میں ان کو جہاں وہ بھول جاتے تھے اور ہم نماز میں ہوتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 181,
			"arabicnumber": 181,
			"text": "عروہ بن زبیر سے روایت ہے کہ ابوبکر صدیق نے نماز پڑھائی صبح کی تو پڑھی اس میں سورت بقرہ دو رکعتوں میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 182,
			"arabicnumber": 182,
			"text": "عروہ بن زبیر نے سنا عبداللہ بن عامر بن ربیعہ سے کہتے تھے نماز پڑھی ہم نے پیچھے عمر بن خطاب کے صبح کی تو پڑھی انہوں نے سورت یوسف اور سورت حج ٹھہر ٹھہر کر عروہ نے کہا قسم اللہ کی پس اس وقت کھڑے ہوتے ہوں گے نماز کو جب نکلتی ہے صبح صادق کہا عبداللہ نے ہاں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 183,
			"arabicnumber": 183,
			"text": "قاسم بن محمد سے روایت ہے کہ فرافصہ بن عمیر حنفی نے کہا کہ میں نے سورت یوسف یاد کرلی حضرت عثمان کے پڑھنے سے آپ صبح کی نماز میں اس کو بہت پڑھا کرتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 184,
			"arabicnumber": 184,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر سفر میں مفصل کے پہلی دس سورتوں میں سے ہر ایک رکعت میں سورت فاتحہ اور ایک سورت پڑھا کرتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 185,
			"arabicnumber": 185,
			"text": "ابو سعید سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے پکارا ابی بن کعب کو اور وہ نماز پڑھ رہے تھے تو جب نماز سے فارغ ہوئے مل گئے آپ صلی اللہ علیہ وسلم سے پس رکھا رسول اللہ صلی اللہ علیہ وسلم نے ہاتھ اپنا ابی کے ہاتھ پر اور وہ نکلنا چاہتے تھے مسجد کے دروازے سے سو فرمایا آپ صلی اللہ علیہ وسلم نے میں چاہتا ہوں کہ نہ نکلے تو مسجد کے دروازے سے یہاں تک کہ سیکھ لے ایک سورت ایسی کہ نہیں اتری تورات اور انجیل اور قرآن میں مثل اس کے کہا ابی نے پس ٹھہر ٹھہر کر چلنے لگا میں اسی امید میں پھر کہا میں نے اے اللہ کے رسول وہ سورت جس کا آپ صلی اللہ علیہ وسلم نے وعدہ کیا تھا بتلائیے مجھ کو فرمایا آپ صلی اللہ علیہ وسلم نے کیونکر پڑھتا ہے تو جب شروع کرتا ہے نماز کو کہا ابی نے تو میں پڑھنے لگا الحمد للہ رب العالمین یہاں تک کہ ختم کیا میں نے سورت کو پس فرمایا رسول اللہ صلی اللہ علیہ وسلم نے وہ یہی سورت ہے اور یہ سورت سبع مثانی اور قرآن عظیم ہے جو میں دیا گیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 186,
			"arabicnumber": 186,
			"text": "ابی نعیم وہب بن کیسان سے روایت ہے کہ انہوں نے سنا جابر بن عبداللہ انصاری سے کہتے تھے جس شخص نے ایک رکعت پڑھی اور اس میں سورت فاتحہ نہ پڑھی تو گویا اس نے نماز نہ پڑھی مگر جب امام کے پیچھے ہو",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 187,
			"arabicnumber": 187,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا نبی صلی اللہ علیہ وسلم نے جس شخص نے پڑھی نماز اور نہ پڑھی اس میں سورت فاتحہ تو نماز اس کی ناقص ہے ناقص ہے ہرگز تمام نہیں ہے ابوالسائب نے کہا اے ابوہریرہ کبھی میں امام کے پیچھے ہوتا ہوں تو دبا دیا ابوہریرہ نے میرا بازو اور کہا پڑھ لے اپنے دل میں اے فارس کے رہنے والے کیونکہ میں نے سنا ہے رسول اللہ صلی اللہ علیہ وسلم سے فرماتے تھے فرمایا اللہ تعالیٰ نے بٹ گئی نماز میرے اور میرے بندے کے بیچ میں آدھوں آدھ آدھی میری اور آدھی اس کی اور جو بندہ میرا مانگے اس کو دوں گا فرمایا رسول اللہ صلی اللہ علیہ وسلم نے پڑھو بندہ کہتا ہے کہ سب تعریف اللہ کو ہے جو صاحب ہے سارے جہاں کا پروردگار کہتا ہے میری تعریف کی میرے بندے نے بندہ کہتا ہے بڑی رحمت کرنے والا مہربان پروردگار کہتا ہے خوبی بیان کی میرے بندے نے بندہ کہتا ہے کہ وہ مالک بدلے کے دن کا پروردگار کہتا ہے بڑائی کی میری میرے بندے نے بندہ کہتا ہے خاص تجھ کو پوجتے ہیں ہم اور تجھی سے مدد چاہتے ہیں ہم تو یہ آیت میرے اور میرے بندے کے بیچ میں ہے بندہ کہتا ہے دکھا ہم کو سیدھی راہ ان لوگوں کی راہ جن پر تو نے اپنا کرم کیا نہ دشمنوں کی اور گمراہوں کی تو یہ آیتیں بندہ کے لئے ہیں اور میر ابندہ جو مانگے سو دوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 188,
			"arabicnumber": 188,
			"text": "عروہ بن زبیر سورت فاتحہ پڑھتے تھے امام کے پیچھے سری نماز میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 189,
			"arabicnumber": 189,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 190,
			"arabicnumber": 190,
			"text": "نافع بن جبیر امام کے پیچھے سری نماز میں سورت فاتحہ پڑھتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 191,
			"arabicnumber": 191,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر سے جب کوئی پوچھتا کہ سورت فاتحہ پڑھی جائے امام کے پیچھے تو جواب دیتے کہ جب کوئی تم میں سے نماز پڑھے امام کے پیچھے تو کافی ہے اس کو قرأت امام کی اور جو اکیلے پڑھے تو پڑھ لے کہا نافع نے اور تھے عبداللہ بن عمر نہیں پڑھتے تھے پیچھے امام کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 192,
			"arabicnumber": 192,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم فارغ ہوئے ایک نماز جہری سے پھر فرمایا کیا تم میں سے کسی نے میرے ساتھ کلام اللہ پڑھا تھا ایک شخص بول اٹھا کہ ہاں میں نے یا رسول اللہ صلی اللہ علیہ وسلم فرمایا آپ صلی اللہ علیہ وسلم نے جب ہی میں کہتا تھا اپنے دل میں کیا ہوا ہے مجھ کو چھینا جاتا ہے مجھ سے کلام اللہ کہا ابن شہاب یا ابوہریرہ نے تب لوگوں نے موقوف کیا قرأت کو حضرت کے پیچھے نماز جہری میں جب سے یہ حدیث سنی آپ صلی اللہ علیہ وسلم سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 193,
			"arabicnumber": 193,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب امام کہے آمین تو تم بھی آمین کہو کیونکہ جس کی آمین مل جائے گی ملائکہ کی آمین سے بخش دئیے جائیں گے اگلے گناہ اس کے کہا ابن شہاب نے اور رسول اللہ صلی اللہ علیہ وسلم آمین کہتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 194,
			"arabicnumber": 194,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب امام غیر المغضوب علیہم ولا الضالین کہے تو تم آمین کہو کیونکہ جس کا آمین کہنا برابر ہو جائے گا ملائکہ کے کہنے کے بخش دئیے جائیں گے اگلے گناہ اس کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 195,
			"arabicnumber": 195,
			"text": "ابویرہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب تم میں سے کوئی آمین کہتا ہے فرشتے بھی آسمان میں آمین کہتے ہیں پس اگر برابر ہو جائے ایک آمین دوسری آمین سے تو بخش دئیے جاتے ہیں اگلے گناہ اس کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 196,
			"arabicnumber": 196,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فریاما رسول اللہ صلی اللہ علیہ وسلم نے جب امام سمع اللہ لمن حمدہ کہے تو تم اللہم ربنا لک الحمد کہو کیونکہ جس کا کہنا ملائکہ کے کہنے کے برابر ہو جائے گا اس کے اگلے گناہ بخش دئیے جائیں گے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 197,
			"arabicnumber": 197,
			"text": "علی بن عبدالرحمن کہتے ہیں کہ مجھ کو عبداللہ بن عمر نے نماز میں کنکریوں سے کھیلتا ہوا دیکھا تو جب فارغ ہوا میں نماز سے منع کیا مجھ کو اور کہا کہ کیا کر جیسے کرتے تھے رسول اللہ صلی اللہ علیہ وسلم میں نے کہا کیسے کرتے تھے کہا جب بیٹھتے تھے آپ صلی اللہ علیہ وسلم نماز میں تو داہنی ہتھیلی کو داہنی ران پر رکھتے تو سب انگلیوں کو بند کر لیتے اور کلمہ کی انگلی سے اشارہ کر تے اور بائیں ہتھیلی کو ران پر رکھتے اور کہا کہ اس طرح کرتے تھے آپ صلی اللہ علیہ وسلم ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 198,
			"arabicnumber": 198,
			"text": "عبداللہ بن دینار سے روایت ہے کہ عبداللہ بن عمر کے پہلو میں نماز پڑھی ایک شخص نے تو جب وہ بیٹھا بعد چار رکعت کے چار زانو بیٹھا اور لپیٹ لئے دونوں پاؤں اپنے تو جب فارغ ہوئے عبداللہ بن عمر نماز سے عیب کہا اس بات کو تو اس شخص نے جواب دیا آپ کیوں ایسا کرتے ہیں کہا میں تو بیمار ہوں ،۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 199,
			"arabicnumber": 199,
			"text": "مغیرہ بن سکیم سے روایت ہے کہ انہوں نے دیکھا عبداللہ بن عمر کو کہ بیٹھے تھے درمیان دونوں سجدوں کے دونوں پاؤں کی انگلیوں پر اور پھر سجدہ میں چلے جاتے تھے تو جب فارغ ہوئے نماز سے ذکر ہوا اس کا پس کہا عبداللہ نے کہ اس طرح بیٹھنا نماز میں درست نہیں ہے لیکن میں بیماری کی وجہ سے اس طرح بیٹھتا ہوں ،۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 200,
			"arabicnumber": 200,
			"text": "عبیداللہ بن عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ انہوں نے دیکھا عبداللہ بن عمر کو چار زانوں بیٹھتے ہوئے نماز میں تو وہ بھی چار زانو بیٹھے اور کمسن تھے ان دنوں میں پس منع کیا ان کو عبداللہ نے اور کہا کہ سنت نماز میں یہ ہے کہ داہنے پاؤں کا کھڑا کرے اور بائیں پاؤں کو لٹا دے کہا عبداللہ نے کہ میں نے ان سے کہا تم چار زانو بیٹھتے ہو جواب دیا عبداللہ نے کہ میرے پاؤں میرا بوجھ اٹھا نہیں سکتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 201,
			"arabicnumber": 201,
			"text": "یحیی بن سعید سے روایت ہے کہ قاسم بن محمد نے سکھایا لوگوں کو بیٹھنا تشہد میں تو کھڑا کیا داہنے پاؤں کو اور جھکایا بائیں پاؤں کو اور بیٹھے بائیں سرین پر اور نہ بیٹھے بائیں پاؤں پر کہا قاسم نے کہ بتایا مجھ کو اس طرح بیٹھنا عبیداللہ نے اور کہا کہ میرے باپ عبداللہ بن عمر اسی طرح کرتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 202,
			"arabicnumber": 202,
			"text": "عبدالرحمن بن عبدالقاری نے سنا عمر بن خطاب سے اور وہ منبر پر تھے سکھاتے تھے لوگوں کو تشہد کہتے تھے کہو التحیات للہ الزا کیات لللہ الطیبات الصلوت لللہ الخ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 203,
			"arabicnumber": 203,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر تشہد پڑھتے تھے اس طرح بسم اللہ التحیات لللہ کہتے تھے یہ پہلی دو رکعتوں کے بعد مانگتے تھے بعد تشہد کے جو کچھ جی چاہتا تھا پھر جب اخیر قعدہ کرتے اور اسی طرح پڑھتے مگر پہلے تشہد پڑھتے پھر دعا مانگتے جو چاہتے اور بعد تشہد کے جب سلام پھیرنے لگتے تو کہتے السلام علی البنی ورحمة اللہ وبرکاتہ السلام علینا وعلی عباد الصالحین السلام علیکم داہنی طرف کہتے پھر امام کے سلام کا جواب دیتے پھر اگر کوئی بائیں طرف والا ان کو سلام کرتا تو اس کو بھی جواب دیتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 204,
			"arabicnumber": 204,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 205,
			"arabicnumber": 205,
			"text": "حضرت بی بی عائشہ صدیقہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ کہتیں تشہد میں التحیات الطیبات الصلوت الزکیات۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 206,
			"arabicnumber": 206,
			"text": "امام مالک نے ابن شہاب زہری اور نافع مولیٰ ابن عمر سے پوچھا کہ ایک شخص امام کے ساتھ آکر شریک ہوا جب ایک رکعت ہو چکی تھی اب وہ امام کے ساتھ تشہد پڑھے قعدہ اولی اور قعدہ اخیر میں یا نہ پڑھے کیونکہ اس کی تو ایک رکعت ہوئی قعدہ اولی میں اور تین رکعتیں ہوئیں قعدہ اخیرہ میں تو جواب دیا دونوں نے کہ ہاں تشہد پڑھے امام کے ساتھ امام مالک نے کہا کہ ہمارے نزدیک یہی حکم ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 207,
			"arabicnumber": 207,
			"text": "ابوہریرہ نے کہا کہ جو شخص سر اٹھاتا ہے یا جھکاتا ہے امام کے پیشتر تو اس کا ماتھا شیطان کے ہاتھ میں ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 208,
			"arabicnumber": 208,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 209,
			"arabicnumber": 209,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 210,
			"arabicnumber": 210,
			"text": "ابی بکر بن سلیمان سے روایت ہے کہ پہنچا مجھ کو رسول اللہ صلی اللہ علیہ وسلم نے دو رکعتیں پڑھیں ظہر یا عصر کی پھر سلام پھیر دیا تو کہا ذولشمالین اور وہ ایک شخص تھا بنی زہرہ بن کلاب سے کہ نماز کم ہوگئی یا رسول اللہ صلی اللہ علیہ وسلم یا آپ صلی اللہ علیہ وسلم بھول گئے آپ صلی اللہ علیہ وسلم نے فرمایا نہ نماز کم ہوئی نہ میں بھولا ذوالشمالین نے کہا کچھ تو ہوا یا رسول اللہ صلی اللہ علیہ وسلم پس متوجہ ہوئے آپ صلی اللہ علیہ وسلم لوگوں پر اور کہا کیا ذوالیدین سچ کہتا ہے لوگوں نے کہا ہاں تو تمام کیا رسول اللہ صلی اللہ علیہ وسلم نے باقی نماز کو پھر سلام پھیرا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 211,
			"arabicnumber": 211,
			"text": "سعید بن مسیب اور ابی سلمہ بن عبدالرحمن رضی اللہ تعالیٰ عنہ بھی یہ حدیث اسی طرح مروی ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 212,
			"arabicnumber": 212,
			"text": "عطاء بن یسار سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جب شک ہو تم میں سے کسی کو نماز میں تو نہ یاد رہے اس کہ تین رکعتیں پڑھی ہیں یا چار تو چاہئے کہ ایک رکعت اور پڑھ لے اور دو سجدے کرے قبل سلام کے پھر اگر یہ رکعت جو اس نے پڑھی ہے درحقیقت پانچویں ہوگی تو ان سجدوں سے مل کر ایک دوگانہ ہو جائے گا اگر چوتھی ہوگی تو ان سجدوں سے ذلت ہوگی شیطان کو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 213,
			"arabicnumber": 213,
			"text": "سالم بن عبداللہ سے روایت ہے کہ عبداللہ بن عمر کہتے تھے کہ جب شک کرے کوئی تم میں اپنی نماز کا تو سوچے جو بھول گیا ہے پھر پڑھ لے اس کو اور دو سجدے سہو کے بیٹھ کر کر لے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 214,
			"arabicnumber": 214,
			"text": "عطاء بن یسار سے روایت ہے کہ پوچھا میں نے عبداللہ بن عمرو بن العاص اور کعب احبار سے اس شخص کے بارے میں جو شک کرے اپنی نماز میں تو نہ یاد رہے اس کو کہ تین رکعتیں پڑھی ہیں یا چار پس جواب دیا دونوں نے کہ ایک رکعت اور پڑھ کر دو سجدے سہو کے کر لے بیٹھے بیٹھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 215,
			"arabicnumber": 215,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر سے سوال ہوا نماز میں بھول جانے کا تو کہا سوچ لے جو بھول گیا ہے پھر پڑھ لے اس کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 216,
			"arabicnumber": 216,
			"text": "عبداللہ بن بحینہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم دو رکعتیں پڑھا کر اٹھ کھڑے ہوئے اور نہ بیٹھے تب لوگ بھی آپ صلی اللہ علیہ وسلم کے ساتھ اٹھ کھڑے ہوئے پس جب تمام کیا نماز کو اور انتظار کیا ہم نے سلام کا تکبیر کہی اور آپ صلی اللہ علیہ وسلم نے دو سجدے کئے بیٹھے بیٹھے قبل سلام کے پھر سلام پھیرا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 217,
			"arabicnumber": 217,
			"text": "عبداللہ بن بحینہ سے روایت ہے کہ نماز پڑھائی رسول اللہ صلی اللہ علیہ وسلم نے ظہر کی پھر کھڑے ہوگئے دو رکعتیں پڑھ کر اور نہ بیٹھے تو جب پورا کر چکے نماز کو دو سجدے کئے پھر سلام پھیرا بعد اس کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 218,
			"arabicnumber": 218,
			"text": "مرجانہ سے روایت ہے کہ عائشہ نے فرمایا کہ ابوجہم بن حذیفہ نے تحفہ بھیجی ایک چادر شام کی رسول اللہ صلی اللہ علیہ وسلم کے واسطے جس میں نقش تھے تو نماز کو آئے آپ صلی اللہ علیہ وسلم اس کو اوڑھ کر پھر جب فارغ ہوئے نماز سے فرمایا کہ پھیر دے یہ چادر ابوجہم کو کیونکہ میں نے دیکھا اس کے بیل بوٹوں کو نماز میں پس قریب تھا کہ غافل ہو جاؤں میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 219,
			"arabicnumber": 219,
			"text": "عروہ بن زبیر سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک چادر شام کی بنی ہوئی نقشی بھیجی پھر وہ چادر ابوجہم کو دے دی اور ایک چادر موٹی سادی لے لی تو ابوجہم نے کہا کیوں ایسا یا رسول اللہ صلی اللہ علیہ وسلم؟ فرمایا میں نے نماز میں اس کو نقش ونگار کی طرف دیکھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 220,
			"arabicnumber": 220,
			"text": "عبداللہ بن ابی بکر سے روایت ہے کہ ابوطلحہ انصاری نماز پڑھ رہے تھے باغ میں تو ایک چڑیا اڑی اور ڈھونڈے لگی راہ نکلنے کی کیونکہ باغ اس قدر گنجان تھا اور پیڑ آپس میں ملے ہوئے تھے کہ چڑیا کو جگہ نکلنے کی نہ ملتی تھی پس پسند آیا ان کو یہ امر اور خوش ہوئے اپنے باغ کا یہ حال دیکھ کر تو ایک گھڑی تک اس طرف دیکھتے رہے پھر خیال آیا نماز کا سو بھول گیا کہ کتنی رکعتیں پڑھیں تب کہا مجھے آزمایا اللہ جل جلالہ نے اس مال سے تو آئے رسول اللہ صلی اللہ علیہ وسلم کے پاس اور بیان کیا جو کچھ باغ میں قصہ ہوا تھا اور کہا یا رسول اللہ صلی اللہ علیہ وسلم یہ باغ صدقہ ہے واسطے اللہ کے اور صرف کریں اس کو جہاں آپ صلی اللہ علیہ وسلم چاہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 221,
			"arabicnumber": 221,
			"text": "عبداللہ بن ابی بکر سے روایت ہے کہ ایک شخص انصار میں سے نماز پڑھ رہا تھا اپنے باغ میں اور وہ باغ قف میں تھا جو نام ہے ایک وادی کا جو مدینہ کی وادیوں میں سے ہے ایسے موسم میں کہ کھجور پک کر لٹک رہی تھی گویا پھلوں کے طوق شاکوں کے گلوں میں پڑے تھے تو اس نے نماز میں اس طرف دیکھا اور نہایت پسند کیا پھلوں کو پھر جب خیال کیا نماز کا تو بھول گیا کتنی رکعتیں پڑھیں تو کہا کہ مجھے اس مال میں آزمائش ہوئی اللہ جل جلالہ کی پس آیا حضرت عثمان کے پاس اور وہ ان دنوں خلیفہ تھے رسول اللہ صلی اللہ علیہ وسلم کے اور بیان کیا ان سے یہ قصہ پھر کہا کہ وہ صدقہ ہے تو صرف کرو اس کو نیک راہوں میں پس بیچا اس کو حضرت عثمان نے پچاس ہزار کا اور اس مال کا نام ہو گیا پچاس ہزارہ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 221
			}
		}
	]
}