{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1464,
			"arabicnumber": 1464,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا جو شخص مشترک غلا میں سے اپنا حصہ آزاد کر دے اور اس شخص کے پاس انتا مال کہ غلام کی قیمت دے سکے تو اس غلام کی قیمت لگا کر ہر ایک شریک کو موافق حصہ ادا کرے گا اور غلام اس کی طرف سے آزاد ہو جائے گا اور اگر اس کے پاس مال نہیں ہے تو جس قدر اس غلام میں سے آزاد ہوا ہے اتنا ہی حصہ آزاد رہے گا ۔ کہا مالک نے ہمارے نزدیک یہ حکم اتفاقی ہے کہ مولیٰ اگر اپنے مرنے کے بعد اپنے غالم کا ایک حصہ جیسے ثلث یاربع یا نصف آزاد کر جائے تو بعد مولیٰ کے مرجانے کے اسی قدر حصہ جتنامولیٰ نے آزاد کیا تھا آزاد ہوجائے گا کیونکہ اس حصے کی آزادی بعد مولیٰ کے مرجانے کے لازم ہوئی اور جب تک مولیٰ ازندہ تھا اس کو اختیار تھا جب مر گیا تو موافق اس کی وصیت کے اسی قدر حصہ آزاد ہوگا اور باقی غلام آزاد نہ ہوگا اس واسطے کہ وہ غیر کی ملک ہوگا تو باقی غلام غیر کی طرف سے کیونکر آزاد ہوگا نہ اس نے آزادی شروع کی اور نہ ثابت کی اور نہ اس کے واسطے ولاء ہے بلکہ یہ میت کا فعل ہے اسی نے آزاد کیا اور اسی نے اپنے لئے ولاء ثابت کی تو غیر کے مالک میں کیونکر درست ہوگا البتہ اگر یہ وصیت کر جائے کہ باقی غلام بھی اس کے مال میں سے آزاد کردیا جائے گا اور ثلث مال میں سے وہ غلام آزاد ہوسکتا ہو تو آزاد ہوجائے گا پھر اس کے شریکوں یاوارثوں کو تعرض نہیں پہنچتا کیونکہ ان کا کچھ ضرر نہیں ۔ کہا مالک نے اگر کسی شخص نے اپنی بیماری میں تہائی غلام آزاد کردیا تو وہ ثلث مال میں سے پورا آزاد ہوجائے گا کیونکہ یہ مثل اس شخص کے نہیں ہے جو اپنی تہائی غلام کی آزادی اپنی موت پر معلق کردے اس واسطے کہ اس کی آزادی قطعی نہیں جب تک زندہ ہے رجوع کرسکتا ہے اور جس نے اپنے مرض میں تہائی غلام قطعا آزاد کردیا اگر وہ زندہ رہ گیا تو کل غلام آزاد ہوجائے گا کیونکہ میت کا تہائی مال میں وصیت درست ہے جیسے صحیح سالم کا تصرف کل مالک میں درست ہے۔ کہا مالک نے جس شخص نے اپنا غلام قطعی طور پر آزاد کردیا یہاں تک کہ اس کی شہادت ہوگئی اور اس کی حرمت پوری ہوگئی اور اس کی میراث ثابت ہوگئی اب اس کے مولیٰ کو نہیں پہنچتاکہ اس پر کسی مال یاخدمت کی شرط لگادے یا اس پر کچھ غلامی کا بوجھ ڈالے کیونکہ آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو شخص اپنا حصہ غلام میں سے آزاد کردے تو اس کی قیمت لگا کر ہر ایک شریک کو موافق حصہ کر آزاد کرے اور غلام اس کے اوپر آزاد ہوجائے گا پس جس صورت میں وہ غلام خاص اسی کی ملک ہے تو زیادہ تر اس کی آزادی پوری کرنے کا حقدار ہوگا اور غلامی کا بوجھ اس پر نہ رکھے سکے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1464
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": 1465,
			"text": "حسن بصری اور محمد بن سیرین سے روایت ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں اپنے چھ غلاموں کو آزاد کر دیا آپ صلی اللہ علیہ وسلم نے قرعہ ڈال کر دو کی آزاد قائم رکھی۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1465
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": 1466,
			"text": "ربیعہ بن ابی عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ ایک شخص نے ابان بن عثمان کی خلافت میں اپنے سب غلاموں کو آزاد کر دیا اور سوا ان غلاموں کے اور کچھ مال اس شخص کے پاس نہ تھا تو ابان بن عثمان نے حکم کیا ان غلاموں کے تین حصے کئے گئے پھر جس حصے پر میت کا حصہ نکلا وہ غلام آزاد ہو گئے اور جب حصوں پر وارثوں کا نام نکلا وہ غلام رہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1466
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "شہاب کہتے تھے کہ سنت جاری ہے اس بات پر جب غلام آزاد ہو جائے اس کا مال اسی کو ملے گا ۔ کہا مالک نے اس کی دلیل یہ ہے کہ غلام اور مکاتب جب مفلس ہوجائیں تو ان کے مالک اور ام دلد لے لیں گے مگر اولاد کو نہ لیں گے کیونکہ اولاد غلام کا مالک نہیں ہے۔ کہا مالک نے اس کی دلیل یہ بھی ہے کہ غلام جب بیچا جائے اور خریدار اس کے مالک لینے کی طرف کرلے تو اولاد اس میں داخل نہ ہو گی۔ کہا مالک نے غلام اگر کسی کو زخمی کرے تو اس دیت میں وہ خود اور مال اس کا گرفت کیا جائے گا مگر اس کی اولاد سے مواخذہ نہ ہوگا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1467
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": 1468,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت عمر بن خطاب نے فرمایا جو لونڈی اپنے مالک سے جنے تو مالک اس کے بہ بیچے نہ ہبہ کر نہ وہ مالک کے وارثوں کے ملک میں آسکتی ہے بلکہ جب تک مالک زندہ رہے اس سے مزے لے جب مر جائے وہ آزاد ہو جائے گی ۔ حضرت عمر بن خطاب کے پاس ایک لونڈی آئی جس کو اس کے مولیٰ نے آگ میں جلایا تھا آپ نے اس کو آزاد کر دیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1468
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": 1469,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1469
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": 1470,
			"text": "عمر بن حکم سے روایت ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہا یا رسول اللہ صلی اللہ علیہ وسلم میری ایک لونڈی بکریاں چرا رہی تھی جب میں وہاں گیا دیکھا تو ایک بکری گم ہے پوچھا میں نے ایک بکری کہاں ہے بولی اس کو بھیڑیا کھا گیا ہے مجھے غصہ آیا آخر میں آدمی تھا میں نے ایک طماچہ اس کے منہ پر جڑا میرے ذمے ایک بردہ آزاد کرنا واجب ہے کیا اسی کو آزاد کر دوں آپ صلی اللہ علیہ وسلم نے اس لونڈی سے فرمایا اللہ جل جلالہ کہاں ہے وہ بولی آسمان پر ہے پھر آپ صلی اللہ علیہ وسلم نے فرمایا میں کون ہو بولی آپ صلی اللہ علیہ وسلم اللہ کے رسول پھر آپ صلی اللہ علیہ وسلم نے اس شخص کو فرمایا اس کو آزاد کر دے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1470
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": 1471,
			"text": "عبیداللہ بن عبداللہ بن عتبہ بن مسعود سے روایت ہے کہ ایک شخص انصاری رسول اللہ صلی اللہ علیہ وسلم کے پاس کالی لونڈی لے کر آیا اور کہا یا رسول اللہ صلی اللہ علیہ وسلم میرے اوپر ایک مسلمان بردہ آزاد کرنا واجب ہے کیا میں اس کو آزاد کر دوں اگر آپ کہتے ہیں کہ یہ مومنہ ہے تو میں اسی کو آزاد کر دوں آپ صلی اللہ علیہ وسلم نے اس لونڈی سے فرمایا کیا تو یقین کرتی ہے اس بات کو کہ نہیں ہے کوئی معبود سچا سوائے اللہ کے وہ بولی ہاں پھر آپ صلی اللہ علیہ وسلم نے فرمایا تو یقین کرتی ہے اس بات کو کہ محمد اللہ کے رسول ہیں وہ بولی ہاں آپ صلی اللہ علیہ وسلم نے فرمایا کیا تو یقین کرتی ہے اس بات کر کہ مرنے کے بعد پھر جی اٹھیں گے بولی ہاں تب آپ صلی اللہ علیہ وسلم نے فرمایا اس کو آزاد کر دے ابوہریرہ رضی اللہ تعالیٰ عنہ سوال ہوا کہ جس شخص پر ایک بردہ آزاد کرنا لازم ہو گیا ہو ولد الزنا کو آزاد کر سکتا ہے جواب دیا ہاں کر سکتا ہے ۔ فضالہ بن عبیدانصاری سے روایت ہے کہ ان سے پوچھا جس شخص پر ایک بردہ آزاد کرنا لازم ہو گیا وہ ولدا لزنا کو آزاد کر سکتا ہے جواب دیا ہاں کر سکتا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1471
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": 1472,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1472
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": 1473,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1473
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": 1474,
			"text": "عبداللہ بن عمر سے سوال ہوا کہ جس بردہ کا آزاد کرنا واجبہو وہ شرط لگا کر خرید کیا جائے کہا نہیں ۔ کہا مالک نے جو شخص غلام کو آزاد کرنے کے لئے اور اس پر آزاد کرنا واجب ہو تو اس شرط سے نہ خریدے کہ میں آزاد کردوں گا اس واسطے کہ اگر اس شرط سے خریدے گا تو بائع (بچنے والا) رعایت کرکے اس کی قیمت کم کردے گا اس صورت میں وہ پورارقبہ نہ ہوگا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1474
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": 1475,
			"text": "عبدالرحمن بن ابی عمرہ نے وصیت کرنے کا ارادہ کیا پھر صبح تک دیر کی رات کو مر گئیں اور ان کا قصد بردہ آزاد کرنے کا تھا عبدالرحمن نے کہا میں نے قاسم بن محمد سے پوچھا اگر میں اپنی ماں کی طرف سے آزاد کر دوں تو ان کو کچھ فائدہ ہوگا قاسم نے کہا سعد بن عبادہ نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا کہ میری ماں مر گئی اگر میں اس کی طرف سے آزاد کر دں کیا اس کو فائدہ ہوگا آپ صلی اللہ علیہ وسلم نے فرمایا ہان ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1475
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": 1476,
			"text": "یحییٰ بن سعید نے کہا عبدالرحمن بن ابوبکرسوتے سوتے مر گئے حضرت عائشہ نے ان کی طرف سے بہت سے بردے آزاد کئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1476
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": 1477,
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے سوال ہوا کون سا بررہ آزاد کرنا افضل ہے آپ صلی اللہ علیہ وسلم نے فرمایا جس کی قیمت بھاری ہو اور اس کے مالکون کر بہت مرغوب ہو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1477
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": 1478,
			"text": "عبداللہ بن عمر نے ولد الزنا کو اور اس کی ماں کو آزاد کیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1478
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": 1479,
			"text": "حضرت عائشہ کے پاس بریرہ آئی اور کہا کہ مجھ کو میرے لوگوں نے مکاتب کیا ہے نو اوقیہ پر ہر سال میں ایک اوقیہ تو میری مدد کرو حضرت عائشہ نے کہا اگر تیرے لوگوں کو منظور ہو تو میں ایک دفعہ میں سب سے دیتی ہوں مگر تیری ولا میں لوں گی بریرہ اپنے لوگوں کے پاس گئی ان سے بیان کیا انہوں نے ولا دینے سے انکار کیا پھر بریرہ لوٹ کر آئی حضرت عائشہ کے پاس اور رسول اللہ صلی اللہ علیہ وسلم بھی وہاں بیٹھے ہوئے تھے اور کہا میں نے اپنے لوگوں سے بیان کیا وہ انکار کرتے ہیں اور کہتے ہیں ولا ہم لیں گے رسول اللہ صلی اللہ علیہ وسلم نے یہ سن کر پوچھا کیا حال ہے حضرت عائشہ نے سارا قصہ بیان کیا آپ صلی اللہ علیہ وسلم نے فرمایا تم بریرہ کو لے لو اور ولا کی شرط انہیں لوگوں کے واسطے کر دو کیونکہ ولا اسی کو ملے گی جو آزاد کرے حضرت عائشہ نے ایسا ہی کیا بعد اس کے رسول اللہ صلی اللہ علیہ وسلم لوگوں میں گئے اور کھڑے ہو کر اللہ جل جلالہ کی تعریف کی پھر فرمایا کیا حال ہے لوگوں کا ایسی شرطین لگاتے ہیں جو اللہ کی کربا میں نہیں ہیں جو شرط اللہ کی کتاب میں نہ ہو وہ باطل ہے گو سو بار لگائی جائے اللہ کا حکم سچا اور اس کی شرط مضبوط ہے ولا اسی کو ملے گی جو آزاد کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1479
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": 1480,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت عائشہ نے ایک لونڈی کو خرید کر آزاد کرنا چاہا اس کے لوگوں نے کہا ہم اس شرط سے پیچتے ہیں کہ ولا ہم کو ملے حضرت عائشہ نے یہ امر رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا آپ صلی اللہ علیہ وسلم نے فرمایا تیر کچھ حرج نہیں ولا اسی کو ملے گی جو آزاد کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1480
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "عمرہ بنت عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ بریرہ آئی حضرت عائشہ رضی اللہ تعالیٰ عنہا مدد مانگنے کو حضرت عائشہ نے کہا اگر تیرے لوگوں کو منظور ہو کہ میں یک مشت ان کو تیری قیمت ادا کردوں اور تجھ کو آزاد کر دوں تو میں راضی ہوں بریرہ نے یہ اپنے لوگوں سے بیان کیا انہوں نے کہا ہم نہیں بیچیں گے مگر اس شرط سے کہ ولا ہم کو ملے ۔ عمرہ نے کہا کہ پھر حضرت عائشہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا آپ صلی اللہ علیہ وسلم نے فرمایا تو خرید کر آزاد کر دے کیونکہ ولا اسی کو ملے گی جو آزاد کر دے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1481
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": 1482,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1482
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": 1483,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1483
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "ربیعہ بن ابی عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ زبیر بن عوان نے ایک غلام خریدا کر آزاد کیا اس غلام کی اولاد ایک آزاد عورت سے تھی جب زبیر نے غلام کو آزاد کر دیا تو زبیر نے کہا اس کی اولاد میری مولیٰ ہیں اور ان کی ماں کے لوگوں نے کہا ہمارے مولیٰ ہیں دونوں نے جھگڑا کیا حضرت عثمان کے پاس آئے آپ نے حکم کیا کہ ان کی ولا زبیر کو ملے گی ۔ سعید بن مسیب سے سوال ہوا اگر ایک غلام کا لڑکا آزاد عورت سے ہو تو اس لڑکے کی ولا کس کو ملے گی سعید نے کہا اگر اس لڑکے کا باپ غلامی کی حالت میں مر جائے تو ولا اس کی ماں کے موالی کو ملے گی ۔ کہا مالک نے مثال اس کی یہ ہے ملا عنہ عورت کا لڑکا اپنی ماں کے موالی کی طرف منسوت ہوگا اگر وہ مرجائے گا وہی اس کے وارث ہوں گے اگر جنایت کرے گا وہی دیت دیں گے پھر اس عورت کا خاوند اقرار کرلے کہ یہ میرا لڑکا ہے تو اس کی ولاء باپ کے موالی کو ملے گی وہی وارث ہوں گے وہی دیت دیں گے مگر اس کے باپ پر حد قذف پڑے گی مالک نے اسی طرح کہا اگر عورت ملاعنہ عربی ہو اور خاوند اس کے لڑکے کا اقرار کرلے کا اقرار کرلے کہ میرا لڑکا ہے تو وہ لڑکا اپنے باپ سے ملا دیا جائے گا۔ جب تک خاوند اقرار نہ کرے تو اس لڑکے کا ترکہ اس کی ماں اور اخیافی بھائی کو حصہ دے کر جو بچ رہے گا ۔ مسلمانوں کا حق ہوگا اور ملاعنہ کے لڑکے کی میراث اس کی ماں کے موالی کو اس واسطے ملتی ہے کہ جب تک اس کے خاوند نے اقرار نہیں کیا نہ اس لڑکے کا نسب ہے نہ اس کا کوئی عصبہ ہے جب خاوند نے اقرار کرلیانسب ثابت ہوگیا اپنے عصبہ سے مل جائے گا۔ کہا مالک نے جس غلام کی اولاد آزاد عورت سے ہو اور غلام کا باپ آزاد ہو و (ف) اپنے پوتے یے ولاء کا مالک ہوگا جب تک باپ غلام رہے گا جب باپ آزاد ہو جائے گا تو اس کے موالی کو ملے گی اگر باپ غلامی کی حالت میں مرجائے گا تو میراث اور ولاء دادا کو ملے گی اگر اس غلام کے دو آزاد لڑکوں میں سے ایک لڑکا مرجائے اور باپ ان کا غلام ہو تو ولاء اور میراث اس کے دادا کو ملے گی۔ کہا مالک نے حاملہ لونڈی اگر ازاد ہوجائے اور خاوند اس کا غلام ہو پھر خاوند بھی آزاد ہوجائے وضع حمل سے پہلے یا بعد تو ولاء اس بچہ کی اس کی ماں کے مولیٰ کو ملے گی کیونکہ یہ بچہ قبل آزادی کے اس کا غلام ہوگیا البتہ جو حمل اس عورت کو بعد آزادی کے ٹھہرے گا اس کی ولاء اس کے باپ کو ملے گی جب وہ آزاد کردیا جائے گا کہا مالک نے جو غلام اپنے مولیٰ کے اذن سے اپنے غلام کو آزاد کرے تو اس کی ولاء مولیٰ کو ملے گی غلام کو نہ ملے گی اگرچہ آزاد ہوجائے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1484
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": 1485,
			"text": "عبدالملک بن ابی بکر بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ عاصی بن ہشام مر گئے اور تین بیٹے چھوڑ گئے دو اس میں سے سگے بھائی تھے اور ایک سوتیلا تو سکے بھائیوں میں سے ایک بھائی مر گیا اور ماں اور غلام آزاد کئے ہوئے چھوڑ گیا اس کا وارث سگا بھائی ہوا ماں اور غلاموں کی سب ولا اس نے لی پھر وہ بھائی بھی مر گیا اور ایک بیٹا اور سوتیلا بھائی چھوڑ گیا بیٹے نے کہا میں اپنے باپ کے مال اور ولا کا مالک ہوں بھائی نے کہا بے شک مال کا تو مالک ہے مگر ولا کا مالک نہیں فرض کر کہ اگر پہلا بھائی میرا آج مرتا تو میں اس کا وارث ہوتا تو پھر دونوں نے جھگڑا کیا حضرت عثمان کے پاس آئے آپ نے ولا بھائی کو دلائی",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1485
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": 1486,
			"text": "عبداللہ بن ابی بکر بن حزم کے والد ابن بن عثمان کے پاس بیٹھے ہوئے تھے اتنے میں کچھ لوگ جہنیہ کے اور کچ لوگ بنی الحارث بن خزرج کے لڑتے جھگڑتے آئے مقدمہ یہ تھا کہ ایک جہنیہ کے نکاح میں تھی ایک شخص بنی الحارث بن خزرج میں سے جس کا نام ابرہیم بن کلیب تھا وہ عورت مر گئی اور مال اور غلام آزاد کئے ہوئے چھوڑ گئی اس کا خاوند اور بیٹا وارث ہوا پھر اس کا بیٹا مر گیا اب بیٹے کو وارثوں نے کہا ولا ہم کے ملے گی کیونکہ عورت کا بیٹا اس ولا پر قابض ہو گیا تھا اور جہنیہ کے لوگ یہ کہتے تھے کہ ولا کے مستحق ہم ہیں اس لئے وہ غلام ہمارے کنبے کی عورت کے غلام ہیں جب اس عورت کا لڑکا مر گیا ولا ہم کے ملے گی ابان بن عثما نے جہنیہ کے لوگوں کو ولا دیلائی ۔ عید بن مسیب نے کہا جو شخص مر جائے اور تین بیٹے چھوڑ جائے اور آزاد کئے ہوئے غلام چھوڑ جائے پھر تینوں بیٹوں میں سے دو بیٹے مر جائیں اور اولاد اپنی چھوڑ جائیں تو ولا کا واث تیسر ابھائی ہو گیا جب وہ مرجائے تو اس کی اولاد اور ان دونوں بھائیوں کی اولاد ول کے استحقاق میں برابر ہوگی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1486
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": 1487,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1487
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": 1488,
			"text": "امام مالک نے ابن شہاب سے پوچھا سائبہ کا حکم انہوں نے کہا سائبہ جس شخص سے چاہے عقد موالات کرے اگر مر جائے اور کسی سے موالات نہ کرے تو اس کی میراث مسلمانوں کو ملے گی اگر وہ جنایر کرے گا تو دیب بھی وہی دیں گے ۔ کہا مالک نے میرے نزدیک یہ ہے کہ سائبہ کسی سے عقد موالات نہ کرے اور میراث اس کی مسلمانوں کے ملے گی اور دیت بھی رہی دیں گے ۔ کہا مالک نے اگر یہودی یا نصرانی کا لڑکا مسلمان ہو تو وہ اپنے باپ کے آزاد کئے ہوئے غلام کی ولاء پائے گا جب وہ غلام مسلمان ہو گیا ہو مگر باپ اس کا مسلمان نہ ہوا ہو جس نے آزاد کیا ہے اور اگر وہ غلام آزادی کے وقت بھی مسلمان تھا تو یہودی یا نصانی کے مسلمان لڑکے کو ولاء نہ ہوگی بلکہ وہ مسلمانوں کا حق ہوگی۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1488
			}
		}
	]
}