{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ یہودی رسول اللہ کے پاس آئے اور بیان کیا کہ ہم میں سے ایک مرد اور عورت نے زنا کیا تو رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ تورات میں کیا حکم ہے رجم کا؟ یہودیوں نے کہا ہم میں جو کوئی زنا کرے اس کو ہم رسوا کرتے ہیں اور کوڑے مارتے ہیں عبداللہ بن سلام نے کہا تم جھوٹ بولتے ہو تورات میں رجم ہے لاؤ تم تورات کو پڑھو اس کو ، انہوں نے تورات کو کھولا اور ایک شخص نے ان میں سے اپنا ہاتھ رجم کی آیت پر رکھ لیا اور اس کے اول اور آخر کی آیتیں پڑھیں عبداللہ بن سلام نے اس سے کہا اپنا ہاتھ اٹھا اس نے جو ہاتھ اٹھایا تو رجم کی آیت نکلی تب سب یہودی کہنے لگے کہ سچ کہا عبداللہ بن سلام نے آیت رجم کی موجود ہے پھر رسول اللہ صلی اللہ علیہ وآلہ وسلم نے حکم کیا رجم کا تو وہ مرد اور عورت رجم کئے گئے عبداللہ بن عمر نے کہا کہ میں نے مرد کو دیکھا کہ وہ عورت کی طرف جھکتا تھا اس کو بچانے پتھروں سے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1500
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "سعید بن مسیب سے روایت ہے کہ ایک شخص اسلم کے قبیلے کا ابوبکر صدیق رضی اللہ تعالیٰ عنہ کے پاس آیا اور کہا کہ اس نالائق نے (اپنی طرف اشارہ کرکے) زنا کیا ابوبکر رضی اللہ تعالیٰ عنہ نے کہا تو نے یہ بات اور کسی سے تو بیان نہیں کیا بولا نہیں ابوبکر رضی اللہ تعالیٰ عنہ نے کہا تو توبہ کر اللہ سے اور چھپا رہ اللہ کے پردے میں کیونکہ اللہ جل جلالہ توبہ قبول کرتا ہے اپنے بندوں کی اس کو تسکین نہ ہوئی وہ حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس آیا حضرت عمر سے بھی ایسا ہی کہا جیسا کہ ابوبکر رضی اللہ تعالیٰ عنہ سے کہا تھا حضرت عمر نے بھی وہی جواب دیا پھر بھی اس کو تسکین نہ ہوئی پھر وہ رسول اللہ صلی اللہ علیہ وآلہ وسلم کے پاس آیا اور کہا کہ اس نالائق نے زنا کیا تین بار اس نے کہا اور تینوں بار رسول اللہ صلی اللہ علیہ وآلہ وسلم نے اس کی طرف سے منہ پھیر لیا جب بہت اس نے کہا تو رسول اللہ صلی اللہ علیہ وآلہ وسلم نے لوگوں سے فرمایا کیا یہ بیمار ہوگیا ہے یا اس کو جنون ہے لوگوں نے عرض کیا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم وہ تندرست ہے آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا اس کا نکاح ہوا ہے یا نہیں لوگوں نے کہا ہوا ہے تو آپ صلی اللہ علیہ وآلہ وسلم نے حکم کیا اس کو سنگسار کرنے کا وہ سنگسار کر دیا گیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1501
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "سعید بن مسیب سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہا ایک شخص کو جو اسلم کے قبیلے سے تھا اس کا نام ہزال تھا کہ اے ہزال اگر اس خبر کو تو چھپا لیتا تو تیرے واسطے بہتر ہوتا یحیی بن سعید نے کہا کہ میں نے اس حدیث کو ایک مجلس میں بیان کیا جس میں یزید بن عنیم بن ہزال اسلمی بیٹھے تھے تو یزید نے کہا کہ ہزال میرے دادا تھے اور یہ حدیث سچ ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1502
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "ابن شہاب کہتے تھے کہ ایک شخص نے اقرار کیا زنا کا رسول اللہ صلی اللہ علیہ وآلہ وسلم کے زمانہ میں اور چار بار اقرار کیا تو رسول اللہ صلی اللہ علیہ وآلہ وسلم نے اس کے رجم کرنے کا حکم کیا وہ رجم کیا گیا ابن شہاب نے کہا کہ اسی وجہ سے آدمی اپنے پر جواقرار کرے اس کا مواخذہ ہوتا ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1503
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "عبداللہ بن ابی ملیکہ سے روایت ہے کہ ایک عورت (غامدیہ) آئی رسول اللہ صلی اللہ علیہ وسلم کے پاس اور کہا میں نے زنا کیا اور وہ حاملہ تھی آپ نے فرمایا جب وضع حمل ہو جائے تو آنا جب اس نے (بچہ) جنا تو پھر آئی آپ نے فرمایا جب دودھ چھڑا لینا تو آنا پھر جب وہ دودھ پلاچکی تو آئی آپ نے فرمایا جا لڑکے کو کسی کے سپرد کردے (حفاظت اور پرورش کے واسطے وہ سپرد کرکے پھر آئی تب رسول اللہ صلی اللہ علیہ وسلم نے حکم کیا اور وہ رجم کی گئی ۔)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1504
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "ابوہریرہ اور زید بن خالد جہنی سے روایت ہے کہ دو شخصوں نے جھگڑا کیا رسول اللہ کے پاس ایک بولا یا رسول اللہ آپ فیصلہ کیجیے ہمارا موافق کتاب اللہ کے اور دوسرا شخص جو زیادہ سمجھدار تھا وہ بولا ہاں یا رسول اللہ فیصلہ کیجیے کتاب اللہ کے اور اجازت دیجیے مجھے بات کرنے کی آپ نے فرمایا اچھا بولو اس نے کہا میرا بیٹا اس شخص کے ہاں نوکر تھا اس نے اس کی بیوی سے زنا کیا لوگوں نے مجھ سے کہا کہ تیرے بیٹے پر رجم ہے میں نے سوبکریاں اس کی طرف سے فدیہ دیں اور ایک لونڈی دی پھر میں نے اہل علم سے پوچھا تو انہوں نے کہا کہ میرے بیٹے پر سو کوڑے ہیں اور ایک برس جلاوطنی اور رجم اس کی عورت پر ہے رسول اللہ نے فرمایا تم دنوں کا فیصلہ اللہ کی کتاب کے موافق کرتا ہوں تیری بکریاں اور لونڈی تیرا مال ہے اس کولے لے اور اس کے بیٹے کو سو کوڑے مارنے کا حکم کیا اور ایک برس تک جلاوطن کیا اور حکم کیا انیس اسلمی کو کہ دوسرے شخص کی بیوی کے پاس جا اگر وہ زنا کا اقرار کرے تو اس کو رجم کر اس نے زنا کا اقرار کیا وہ رجم کی گئی۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1505
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ سعد بن عبادہ نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے کہا کہ اگر میں اپنی عورت کے ساتھ کسی مرد کو پاؤں تو کیا میں اس کو مہلت دوں چار گواہ جمع کرنے تک آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا ہاں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1506
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما نے سنا حضرت عمر رضی اللہ تعالیٰ عنہ سے کہا فرماتے تھے کہ رجم اللہ کی کتاب میں ہے سچ ہے جو شخص زنا کرے مرد ہو یا عورت وہ محصن ہو تو وہ رجم کیا جائے گا جب ثابت ہو چار گواہوں سے یا عورت پر حمل سے یا مرد اور عورت دونوں پر اقرار سے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1507
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "ابو واقد لیثی سے روایت ہے کہ حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس ایک شخص آیا جب کہ آپ صلی اللہ علیہ وآلہ وسلم شام میں تھے اس نے بیان کیا کہ میں نے اپنی عورت کے ساتھ ایک مرد کو پایا آپ نے ابوواقد کو بھیجا کہ عورت سے جا کر پوچھے وہ عورت کے پاس گئے اس کے پاس اور عورتیں بیٹھی تھیں انہوں نے کہا وہ جو اس کے خاوند نے حضرت عمر رضی اللہ تعالیٰ عنہ سے بیان کیا تھا اور یہ بھی کہہ دیا کہ خاوند کے کہنے سے تجھے مواخذہ نہ ہوگا اس کو سکھانے بھی لگے اس قسم کی باتیں تاکہ وہ اقرار نہ کرے لیکن اس نے نہ مانا اور اقرار کیا زنا کا حضرت عمر رضی اللہ تعالیٰ عنہ نے اس کو رجم کا حکم کیا اور رجم کی گئی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1508
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1509
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1510
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "زید بن اسلم سے روایت ہے کہ ایک شخص نے اقرار کیا زنا کا رسول اللہ صلی اللہ علیہ وآلہ وسلم کے زمانے میں آپ نے کوڑا منگوایا تو نیا کوڑا آیا جس کا سرا بھی نہیں کٹا تھا آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا اس سے نرم لاؤ پھر ایک کوڑا آیا جو بالکل ٹوٹا ہوا تھا آپ صلی اللہ علیہ وآلہ وسلم نے فرما اس سے سخت لاؤ پھر ایک کوڑا آیا جو سواری میں کام آیا تھا اور نرم ہو گیا تھا آپ صلی اللہ علیہ وآلہ وسلم نے حکم کیا اس کوڑے سے مارنے کا بعد اس کے فرمایا اے لوگوں اب وہ وقت آگیا ہے کہ تم باز رہو اللہ کی حدوں سے جو شخص اس قسم کا کوئی گناہ کرے تو چاہیے کہ چھپا رہے اللہ کے پردے میں اور جو کوئی کھول دے گا اپنے پردے کو تو ہم موافق کتاب اللہ کے اس پر حد قائم کریں گے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1511
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "صفیہ بنت ابی عبید سے روایت ہے کہ لوگ ابوبکر رضی اللہ تعالیٰ عنہ کے پاس ایک شخص کو لائے جس نے ایک باکرہ لونڈی سے زنا کر کے اس کو حاملہ کر دیا تھا بعد اس کے زنا کا اقرار کیا اور وہ محصن نہ تھا حضرت ابوبکر رضی اللہ تعالیٰ عنہ نے حکم کیا اس کو کوڑا مارنے کا اس کو حد پڑی بعد اس کے نکال دیا گیا فدک کی طرف ایک موضع ہے مدینہ سے دو دن کی راہ پر ۔ کہا مالک نے جو شخص زنا کا اقرار کرے بعد اس کے منکر ہوجائے اور کہے میں نے زنا نہیں کیا بلکہ میں نے فلانا کام کیا (جیسے اپنی عورت سے حالت حیض میں جماع کیا اس کو زنا سمجھا) تو اس پر حد نہ پڑے گی کیونکہ حد پڑنے میں یا تو گواہ عادل ہونے چاہئیں یا اقرار ہو جس پر وہ قائم رہے حد پڑنے تک۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1512
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ اور زید بن خالد جہنی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم سے کسی نے پوچھا کہ لونڈی غیر محصنہ جب زنا کرے تو کیا حکم ہے آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ اگر وہ زنا کرے تو اس کو کوڑے مار پھر اگر زنا کرے تو پھر اس کو کوڑے مارو پھر اگر زنا کرے تو پھر اس کو کوڑے مارو بعد اس کے چوتھی مرتبہ یا تیسری مرتبہ کے بعد آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا بیچ ڈالو ایسی لونڈی کو اگرچہ ایک رسی کے عوض میں ہو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1513
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "نافع سے روایت ہے کہ ایک غلام مقرر تھا ان غلام اور لونڈیوں پر جو خمس میں آئی تھیں اس نے انہیں غلام اور لونڈیوں میں سے ایک لونڈی سے زبردستی جماع کیا حضرت عمر بن خطاب نے اس کو کوڑے مارے اور نکال دیا اور لونڈی کو نہ مارا کیونکہ اس پر جبر ہوا تھا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1514
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "عبداللہ بن عیاش سے روایت ہے کہ مجھ کو اور کئی جوانوں کو جو قریش کے تھے حضرت عمر رضی اللہ تعالیٰ عنہ نے حکم کیا حد مارنے کا تو ہم نے لونڈیوں کو پچاس پچاس کوڑے لگائے زنا میں وہ لونڈیاں امارت یعنی بیت المال کی تھیں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1515
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "ابو زناد سے روایت ہے کہ عمر بن عبدالعزیز نے ایک غلام کو حد قذف کے اسی کوڑے لگائے تو میں نے عبداللہ بن عامر سے پوچھا انہوں نے کہا میں نے حضرت عمر رضی اللہ تعالیٰ عنہ اور عثمان اور خلفاء کو ان کے بعد دیکھا کہ کسی نے غلام کو حد قذف میں چالیس کوڑے سے زیادہ نہیں لگائے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1516
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "زریق بن حکیم سے روایت ہے کہ ایک شخص نے جس کا نام مصباح تھا اپنے بیٹے کو کسی کام کے واسطے بلایا اس نے دیر کی جب آیا تو مصباح نے کہا کہ اے زانی، کہا زریق نے اس لڑکے نے میرے پاس فریاد کی میں نے جب اس کے باپ کو حد مارنی چاہی تو وہ لڑکا بولا اگر تم میرے باپ کو کوڑوں سے مارو گے تو میں زنا کا اقرار کر لوں گا میں یہ سن کر حیران ہوا اور اس مقدمے کا فیصلہ کرنا مجھ پر دشوار ہوا تو میں نے عمر بن عبدالعزیز کو لکھا وہ اس زمانے میں حاکم تھے مدینہ کے (سلمان بن عبدالملک کی طرف سے) عمر بن عبدالعزیز نے جواب لکھا کہ لڑکے کے عفو کو جائز رکھ(یعنی بیٹے نے اگر باپ کو حد معاف کردی ہے تو عفو صحیح ہے) زریق نے کہا میں نے عمربن عبدالعزیز کو یہ بھی لکھا تھا کہ اگر کوئی شخص دوسرے پر تہمت زنا کی لگائے یا اس کے ماں باپ کو اور ماں باپ اس کے مر گئے ہوں یا دونوں میں سے ایک مر گیا ہو تو پھر کیا کرے، عمر بن عبدالعزیز نے جواب میں لکھا کہ جس شخص کو تہمت زنا کی لگائے اگر وہ معاف کر دے تو عفو درست ہے لیکن اگر اس کے والدین کو تہمت زنا کی لگائے تو اس کا عفو کر دینا درست نہیں جب کہ والدین مر گئے ہوں یا ان دو میں سے ایک مر گیا ہو بلکہ حد لگا اس کو موافق کتاب اللہ کے مگر جب بیٹا اپنے والدین کا حال چھپانے کے واسطے عفو کر دے تو عفو درست ہے ۔ کہا مالک نے یعنی اس کو خوف ہو اگر میں تہمت لگانے والے کو معاف نہ کروں گا تو والدین کا زنا گواہوں سے ثابت ہوجائے گا اس وجہ سے عفو کردے تو عفو درست ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1517
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1518
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "ربیعہ بن ابو عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ ایک شخص اپنی بیوی کی لونڈی کو سفر میں ساتھ لے کر نکلا وہاں اس سے صحبت کی عورت نے رشک کے مارے حضرت عمر سے کہہ دیا حضرت عمر نے مرد سے پوچھا وہ بولا کہ عورت نے اس لونڈی کو مجھے ہبہ کردیا تھا حضرت عمر نے کہا یا تو تو گواہ لا ہبہ کے نہیں تو تجھے رجم کروں گا۔ اس وقت عورت نے کہہ دیا کہ ہاں میں نے ہبہ کر دیا تھا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1520
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے ہاتھ کاٹا ایک ڈھال کی چوری میں جس کی قیمت تین درہم تھی",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1521
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "عبداللہ بن عبدالرحمن مکی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ جو میوہ درخت پر لٹکتا ہو یا جو بکری پہاڑ پر پھرتی ہو اس کے اٹھا لینے میں ہاتھ نہ کاٹا جائے گا مگر جب وہ بکری اپنے گھر میں آجائے یا میوہ کاٹ کر کھانے کو کہیں رکھا جائے پھر اس کو کوئی چرائے تو ہاتھ کاٹا جائے گا بشرطیکہ قیمت اس کی ڈھال کے برابر ہو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1522
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "حضرت عمرہ بنت عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ ایک شخص نے حضرت عثمان رضی اللہ تعالیٰ عنہ کے زمانے میں ترنج چرایا حضرت عثمان نے اس کی قیمت لگوائی وہ تین درہم کا نکلا بارہ درہم فی دینار کے حساب سے تو حضرت عثمان نے اس کا ہاتھ کاٹا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1523
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا کہ ابھی کچھ زیادہ زمانہ نہیں ہوا اور نہ میں بھولی ہوں کہ چور کا ہاتھ ربع دینا میں یا زیادہ میں کاٹا جائے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1524
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "عمرہ بنت عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا مکہ کو گئیں ان کے ساتھ دو لونڈیاں تھیں ان کی آزاد کی ہوئیں اور ایک غلام تھا عبداللہ بن ابی بکر کی اولاد کا حضرت عائشہ رضی اللہ تعالیٰ عنہا نے مکہ سے ان دو لونڈیوں کے ہاتھ ایک چادر بھیجی جس میں تصویریں بنی ہوئی تھیں مردوں کی۔ ایک سبز کپڑے میں لپیٹ کر سی دیا تھا اس غلام نے کیا کیا کپڑے کی سیون ادھیڑ کر اس میں سے چادر نکال لی اور اس کی جگہ ایک تھیلا پوستین رکھ دی اور پھر سی دیا جب وہ لونڈیاں مدینہ کو آئیں اور وہ امانت جن کو حضرت عائشہ نے کہا تھا کہ سپرد کی انہوں نے اڈھیر کر دیکھا تو نمدہ ہے چادر نہیں ہے لونڈیوں سے پوچھا لونڈیوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا بیان کیا یا ان کولکھ بھیجا اور اپنا گمان غلام پر ظاہر کیا جب غلام سے پوچھا گیا تو اس نے اقرار کیا حضرت عائشہ نے اس کے ہاتھ کاٹنے کا حکم کیا اس کا ہاتھ کاٹا گیا حضرت عائشہ نے فرمایا ربع دینار یا زیادہ میں ہاتھ کاٹا جاتا ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1525
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "نافع سے روایت ہے کہ ایک غلام عبداللہ بن عمر کا بھاگا ہوا تھا اس نے چوری کی عبداللہ بن عمر نے اس غلام کو سعید بن العاص کے پاس بھیجا جو حاکم تھے مدینہ کے ہاتھ کاٹنے کو، سعید بن عاص نے نہ مانا اور کہا جب کوئی بھاگ جائے تو اس کا ہاتھ نہیں کاٹا جاتا عبداللہ بن عمر نے کہا کہ تو نے یہ حکم کس کتاب اللہ میں پایا، پھر عمد اللہ بن عمر نے حکم کیا اس کا ہاتھ کاٹا گیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1526
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "زر یق بن حکیم نے ایک بھاگے ہوئے غلام کو گر فتار کیا جس نے چوری کی تھی پھر ان کو یہ مسئلہ مشکل معلوم ہوا انہوں نے عمر بن عبدالعزیز کو لکھا وہ اس زمانے میں امیرالمو منین تھے اور یہ بھی لکھا کہ میں سنتا تھا جو غلام بھاگ جائے پھر وہ چوری کرے تو اس کا ہاتھ نہ کاٹا جائے عمر بن عبد العز یز نے جواب میں لکھا اور میری تحریر کا حوالہ دیا اور کہا کہ تو نے لکھا ہے کہ تو سنتا تھا جو غلام بھاگا ہوا ہو وہ چوری کرے تو اس کا ہاتھ نہ کاٹا جائے گا حالانکہ اللہ نے فرمایا ہے کہ جو مرد چوری کرے یا عورت چوری کرے تو ان کے ہاتھ کاٹو یہ بدلہ ہے ان کے کام کا اور عذاب ہے اللہ کی طرف سے اللہ غالب ہے حکمت والا پس اگر اس غلام نے ربع دینار کے موافق یا اس سے زیادہ چوری کی ہو اس کا ہاتھ کاٹ ڈال۔ قاسم بن محمد اور سالم بن عبداللہ اور عروہ بن الزبیر کہتے تھے بھاگا ہوا غلام جب اس قدر چرائے جس میں ہاتھ کاٹنا واجب ہوتا ہے تو اس کا ہاتھ کاٹا جائے گا۔ کہا مالک نے ہمارے نزدیک اس میں کچھ اختلاف نہیں ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1527
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "صفوان بن عبداللہ بن صفوان سے روایت ہے کہ صفوان بن امیہ سے کسی نے کہا کہ جس نے ہجرت نہیں کی تو وہ تباہ ہوا تو صفوان مدینہ میں آئے اور مسجد نبوی میں اپنی چادر سر کے تلے رکھ کر سو رہے چور آیا اور چادر ان کی لے گیا صفوان نے اٹھ کر چور کو گرفتار کیا اور رسول اللہ کے پاس لے آئے آپ نے چور سے پوچھا کہ کیا تو نے صفوان کی چادر چرائی وہ بولا ہاں آپ نے اس کا ہاتھ کاٹنے کا حکم کیا صفوان نے کہا میری نیت یہ نہ تھی یا رسول اللہ وہ چادر تو اس پر صدقہ ہے آپ نے فرمایا تجھ کو یہ امر میرے پاس لانے سے پہلے کرنا تھا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1529
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "ربیعہ بن ابی عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ زبیر بن عوام نے ایک شخص کو دیکھا کہ وہ چور کو پکڑے ہوئے حاکم کے پاس لئے جاتا تھا زبیر نے سفارش کی کہا چھوڑ دے وہ بولا کبھی نہیں چھوڑوں گا جب تک کہ حاکم کے پاس نہ لے جاؤں گا زبیر نے کہا جب تو حاکم کے پاس لے گیا تو اللہ کی لعنت سفارش کرنے والے پر اور سفارش ماننے والے پر",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1530
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "قاسم بن محمد سے روایت ہے کہ ایک شخص یمن کا رہنے والا ہاتھ پاؤں کٹا ہوا مدینہ میں آیا اور ابوبکر رضی اللہ تعالیٰ عنہ کے پاس اتر کر بولا کہ یمن کے حاکم نے مجھ پر ظلم کیا اور وہ راتوں کو نماز پڑھتا تھا ابوبکر رضی اللہ تعالیٰ عنہ نے کہا کہ قسم تیرے باپ کی تیری رات چوروں کی رات نہیں ہے۔ اتفاقا ایک ہار اسما بنت عمیس ابوبکر کی بی بی کا گم ہو گیا لوگوں کے ساتھ وہ لنگڑا بھی ڈھونڈتا پھرتا تھا اور کہتا تھا کہ اے پروردگار تباہ کر اس کو جس نے ایسے نیک گھر والوں کے ہاں چوری کی، پھر وہ ہار ایک سنار کے پاس ملا سنار بولا مجھے اس لنگڑے نے دیا ہے اس لنگڑے نے اقرار کیا یا گواہی سے ثابت ہوا حضرت ابوبکر رضی اللہ تعالیٰ عنہ نے حکم کیا تو اس کا بایاں ہاتھ کاٹا گیا حضرت ابوبکر رضی اللہ تعالیٰ عنہ نے کہا قسم اللہ کی مجھے اس کی بدعا جو اپنے اوپر کرتا تھا چوری سے زیادہ سخت معلوم ہوئی ۔ کہا مالک نے اگر ایک شخص نے کئی بار چوری کی بعد اس کے گرفتار ہوا تو سب چوریوں کے بدلے میں صرف اس کا ہاتھ کاٹا جائے گا جب اس کا ہاتھ نہ کٹاہو اور جو ہاتھ کٹنے کے بعد اس نے چوری کی ربع رینار کے موافق تو بایاں پاؤں کاٹا جائے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1531
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "ابو زناد سے روایت ہے کہ حضرت عمر بن عبدالعزیز کے ایک عامل نے چند آدمیوں کو ڈکیتی میں گرفتار کیا پھر انہوں نے کسی کو قتل نہیں کیا تھا عامل نے چاہا کہ ان کے ہاتھ کاٹے یا ان کو قتل کرے پھر عمر بن عبدالعزیز کو اس بارے میں لکھا انہوں نے جواب میں لکھا کہ اگر تو آسان امر کو اختیار کرے تو بہتر ہے ۔ کہا مالک نے ہمارے نزدیک یہ حکم ہے کہ جو شخص بازار کے ان مالوں کو چرائے جن کو مالکوں نے کسی برتن میں محفوظ کرکے رکھاہو ملا کر ایک درسرے سے، ربع دینار کے موافق چرائے تو اس کا ہاتھ کاٹا جائے گا برابر ہے کہ مالک وہاں موجود ہو یا نہ ہو رات کو ہو یا دن کو۔ کہا مالک نے جو شخص ربع دینار کے موافق مال چرائے پھر مال مسروقہ مالک کے حوالے کردے تب بھی اس کا ہاتھ کاٹا جائے گا اس کی مثال یہ ہے کہ ایک شخص نشے کی چیز پی چکا ہو اور اس کی بو آتی ہو اس کے منہ سے لیکن اس کو نشہ نہ ہو تو پھر بھی حد ماریں گے کیونکہ اس نے نشے کے واسطے پیا تھا اگرچہ نشہ نہ ہوا ہو، ایسا ہی چور کا ہاتھ کاٹا جائے گا اگرچہ وہ چیز مالک کو پھیر دے کیونکہ اس نے لے جانے کے واسطے چرایا تھا اگرچہ لے نہ گیا۔ کہا مالک نے اگر کئی آدمی مل کر مال چرانے کے لئے ایک گھر میں گھسے اور وہاں سے ایک صندوق یا لکڑی یا زیور سب ملا کر اٹھا لائے اگر اس کی قیمت ربع دینار ہو تو سب کا ہاتھ کاٹا جائے گا اگر ہر ایک ان میں سے جدا جدا مال لے کر نکلا تو جس کا مال ربع دینار تک پہنچے گا اس کا ہاتھ کاٹا جائے گا۔ اور جس کا اس سے کم ہوگا اس کا ہاتھ نہ کاٹا جائے گا۔ کہا مالک نے ہمارے نزدیک یہ حکم ہے کہ اگر ایک گھر ہو اس میں ایک ہی آدمی رہتا ہو اب کوئی آدمی اس گھر میں سے کوئی شئے چرائے لیکن گھر سے باہر نہ لے جائے (مگراسی گھر میں ایک کوٹھڑی سے دوسری کوٹھڑی میں رکھے یا صحن میں لائے) تو اس کا ہاتھ نہ کاٹا جائے گا جب تک گھر سے باہر نہ لے جائے البتہ اگر ایک گھر میں کئی کوٹھڑیاں الگ الگ ہوں اور ہر کوٹھڑی میں لوگ رہتے ہوں اب کوئی شخص کوٹھڑی والے کا مال چرا کر کوٹھڑی سے باہر نکال لائے لیکن گھر سے باہر نہ نکالے تب ہاتھ کاٹا جائے گا۔ کہا مالک نے جو غلام گھر میں آجاتا ہو یا لونڈی آجاتی ہو اور اس کے مالک کو اس پر اعتبار ہو وہ اگر کوئی چیز چرائے اپنے مالک کی تو اس کا ہاتھ نہ کاٹا جائے گا اسی طرح جو غلام یا لونڈی آمدو رفت نہ رکھتے ہوں نہ ان کا اعتبار ہو وہ بھی اگر اپنے مالک کا مال چرائیں تو ہاتھ نہ کاٹا جائے گا اور جو اپنے مالک کی بیوی کا مال چرائیں یا اپنی مالکہ کے خاوند کا مال چرائیں تو ہاتھ کاٹا جائے گا۔ کہا مالک نے اسی طرح مرد اپنی عورت کے اس مال کو چرائے جو اس گھر میں نہ ہو جہاں وہ دونوں رہتے ہیں بلکہ ایک اور گھر میں محفوظ ہو یا عورت اپنے خاوند کے ایسے مال کو چرائے جو اس گھر میں نہ ہو جہاں وہ دونوں رہتے ہیں بلکہ ایک اور گھر میں بند ہو تو ہاتھ کاٹا جائے گا۔ کہا مالک نے چھوٹا بچہ یا غیر ملک کا آدمی جو بات نہیں کرسکتا ان کو اگر کوئی ان کے گھر سے چرا لے جائے تو ہاتھ کاٹا جائے گا اور جو راہ میں سے لے جائے یا گھرکے باہر سے تو ہاتھ نہ کاٹا جائے گا اور ان کا حکم پہاڑ کی بکری اور درخت پر لگے ہوئے میوے کا ہوگا۔ کہا مالک نے قبر کھود کر اگر ربع دینار کے موافق کفن چرائے تو اس کا ہاتھ کاٹا جائے گا کیونکہ قبر ایک محفوظ جگہ ہے جیسے گھر لیکن جب تک کفن قبر سے باہر نکال نہ لے تب تک ہاتھ نہ کاٹا جائے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1532
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "محمد بن یحیی بن حبان سے روایت ہے کہ ایک غلام نے ایک شخص کے باغ میں سے کھجور کا پودا چرا کر اپنے مولیٰ کے باغ میں لگادیا پودے والا اپنا پودا ڈھونڈنے نکلا اس نے پالیا اور مروان بن حکم کے پاس غلام کی شکایت کی مروان نے غلام کو بلا کر قید کیا اور اس کا ہاتھ کاٹنا چاہا اس غلام کا مولیٰ رافع بن خدیج کے پاس گیا اور ان سے یہ حال کہا رافع نے کہا میں نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے سنا کہ آپ صلی اللہ علیہ وآلہ وسلم فرماتے تھے کہ نہیں کاٹا جائے گا ہاتھ پھل میں نہ پودے میں وہ شخص بولا مروان نے میرے غلام کو پکڑا ہے اور اس کا ہاتھ کاٹنا چاہتا ہے میں چاہتا ہوں کہ آپ میرے ساتھ چلیے اور مروان سے اس حدیث کو بیان کر دیجیے، رافع اس شخص کے ساتھ مران کے پاس گئے اور پوچھا کیا تو نے اس شخص کے غلام کو پکڑا ہے مروان نے کہا ہاں رافع نے پوچھا اس غلام کے ساتھ کیا کرے گا مروان نے کہا ہاتھ کاٹوں گا رافع نے کہا میں نے سنا رسول اللہ صلی اللہ علیہ وآلہ وسلم سے فرماتے تھے کہ پھل اور پودے کی چوری میں ہاتھ نہ کاٹا جائے گا مروان نے یہ سن کر حکم دیا کہ اس غلام کو چھوڑ دو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1533
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "سائب بن یزید سے روایت ہے کہ عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے سامنے اپنے ایک غلام کو لے کر آیا اور کہا میرے اس غلام کا ہاتھ کاٹا جائے اس نے چوری کی ہے حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا کیا چرایا؟ وہ بولا میری بیوی کا آئینہ چرایا جس کی قیمت ساٹھ درہم تھی حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا چھوڑ دو اس کا ہاتھ نہ کا ٹا جائے گا تمہارا خادم تھا تمہارا مال چرایا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1534
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "ابن شہاب سے روایت ہے کہ مروان بن حکم کے پاس ایک شخص آیا جو کسی کا مال اچک لے گیا تھا مروان نے اس کا ہاتھ کاٹنا چاہا پھر زید بن ثابت کے پاس ایک شخص کو بھیجا یہ مسئلہ پوچھنے کو انہوں نے کہا اچکے کا ہاتھ نہ کاٹا جائے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1535
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "ابو بکر بن محمد عمر بن حزم نے ایک نبطی (نبط کا رہنے والا) کو پکڑا جس نے انگوٹھیاں لوہے کی چرائی تھیں اور اس کو قید کیا ہاتھ کا ٹنے کے واسطے عمرہ بنت عبدالرحمن نے اپنی مولاۃ(آزاد لونڈی) کو جس کا نام امیہ تھا ابوبکر کے پاس بھیجا ابوبکر نے کہا وہ مولاۃ میرے پاس چلی آئی اور میں لوگوں میں بٹیھا ہوا تھا، بولی تمہاری خالہ عمرہ نے کہا ہے کہ اے میرے بھانجے تو نے ایک نبطی کو پکڑا ہے تھوڑی چیز کے واسطے اور چاہتا ہے اس کا ہاتھ کاٹنا میں نے کہا ہاں! اس نے کہا عمرہ نے کہا ہے کہ قطع نہیں ہے مگر ربع دینار کی مالیت میں یا زیادہ میں تو میں نے نبطی کو چھوڑ دیا ۔ کہا مالک نے غلام اگر ایسے قصور کا اقرار کرے جس میں اس کے بدن کا نقصان ہو تو درست ہے اس کو تہمت نہ لگائیں گے اس بات کی کہ اس نے مولیٰ کے ضرر کے واسطے جھوٹا اقرار کرلیا۔ کہا مالک نے اگر ایسے قصور کا اقرار کرے جس کا تاوان مولیٰ کو دینار پڑے تو اس کا اقرار صحیح نہ سمجھا جائے گا۔ کہا مالک نے اگر مزدور یا اور کوئی شخص لوگوں میں رہتا ہو اور آتا ہو پھر وہ ان کی کوئی چیز چرائے تو اس پر قطع نہیں ہے کیونکہ وہ مثل خائن کے ہوا اور خائن پر قطع نہیں ہے۔ کہا مالک نے جو شخص کوئی چیز بطور عاریتا کے لے پھر مکر جائے تو اس پر قطع نہیں ہے اس کی مثال ایسی ہے کہ کسی کا قرض کسی پر ہو اور وہ مکر جائے تو قطع نہیں ہے۔ کہا مالک نے ہمارے نزدیک یہ حکم اتفاقی ہے کہ اچک لینے میں قطع نہیں ہے اگرچہ اس شئے کی قیمت ربع دینار یا زیادہ ہو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1536
			}
		}
	]
}