{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"42": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "سائب بن یزید سے روایت ہے کہ حضرت عمر بن خطاب نکلے اور کہا میں نے فلانے کے منہ سے شراب کی بو پائی وہ کہتا ہے میں طلا (انگور کے شیرے کو اتنا پکایا جائے کہ وہ گاڑھا ہو جائے مثلا دو ثلث جل جائے ایک ثلث رہ جائے) پی اور میں پوچھتا ہوں کہ اگر اس میں نشہ ہے تو اس کو حد ماروں گا حضرت عمر نے اس کو پوری حد لگائی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1537
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "ثور بن زید سے روایت ہے کہ حضرت عمر نے صحابہ سے مشورہ لیا خمر کی حد میں (کیونکہ حضور صلی اللہ علیہ وآلہ وسلم نے کوئی حد معین نہیں کی تھی) حضرت علی نے فرمایا میرے نزدیک اسی کوڑے لگانے مناسب ہیں کیونکہ آدمی جب شراب پیے گا مست ہو جائے گا اور جب مست ہو جائے گا واہیات بکے گا اور جب واہیات بکے گا تو کسی کو گالی بھی دے گا ایسا ہی کیا حضرت عمر رضی اللہ تعالیٰ عنہ نے اسی کوڑے مقرر کئے خمر میں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1538
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "ابن شہاب سے پوچھا گیا غلام اگر شراب پیے تو اس کی کیا حد ہے انہوں نے کہا مجھے یہ پہنچا کہ غلام پر آزاد کی نصف حد ہے اور حضرت عمر رضی اللہ تعالیٰ عنہ اور عثمان اور عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے اپنے غلاموں کو آزاد کے نصف حد لگائی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1539
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "سعید بن مسیب رضی اللہ تعالیٰ عنہ کہتے تھے کہ کوئی گناہ نہیں مگر اللہ چاہتا ہے کہ معاف کر دیا جائے سوائے حد کے ۔ کہا مالک نے ہمارے نزدیک یہ حکم ہے کہ جو کوئی ایسی شراب پئے جس میں نشہ ہو تو اس کو حد پڑے گی خواہ اس کو نشہ ہوا ہو یا نہ ہواہو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1540
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کسی غزوے میں خطبہ پڑھا میں بھی آپ صلی اللہ علیہ وآلہ وسلم کی طرف چلا سننے کے واسطے لیکن میرے پہنچنے سے پہلے آپ صلی اللہ علیہ وآلہ وسلم فارغ ہو گئے میں نے لوگوں سے پوچھا کہ آپ صلی اللہ علیہ وآلہ وسلم نے کیا فرمایا لوگوں نے کہا منع کیا آپ صلی اللہ علیہ وآلہ وسلم نے نبیذ بھگونے سے توبنے اور مرتبان میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1541
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے منع کیا میوہ تر کرنے سے توبنے اور مرتبان میں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1542
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "عطا بن یسار رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے منع فرمایا کہ گدر کھجور اور پکی کھجور ملا کر بھگوئی جائیں یا کھجور اور انگور ملا کر بھگوئے جائیں ۔ ابو قتادہ انصاری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ منع کیا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کھجور اور انگور کے ملا کر نیبذ پینے سے اور گدر اور پختہ کھجور کو ملا کر نبیذ پینے سے۔ کہا مالک نے اس امر پر اتفاق کیا ہے ہمارے شہر کے علماء نے کہ یہ مکروہ ہے کیونکہ منع کیا رسول اللہ صلی اللہ علیہ وسلم نے اس سے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1543
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1544
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم سے کسی نے پوچھا بتع ( شہد کی شراب) کا حکم آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا جو شراب نشہ کرے وہ حرام ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1545
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "عطاء بن یسار سے روایت ہے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے سوال ہوا جوار کی شراب کے بارے میں آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا بہتر نہیں ہے اور منع کیا اس سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1546
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا جو شخص دنیا میں شراب پئے گا پھر اس سے توبہ نہ کرے گا تو آخرت میں شراب سے محروم رہے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1547
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": 1548,
			"text": "ایک شخص رسول اللہ صلی اللہ علیہ وآلہ وسلم کے واسطے ایک مشک شراب کی تحفہ لایا آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کیا تو نہیں جانتا کہ اللہ تعالیٰ نے اس کو حرام کیا ہے وہ بولا مجھے خبر نہیں، ایک شخص نے چپکے سے اس کے کان میں کچھ کہا آپ صلی اللہ علیہ وآلہ وسلم نے پوچھا تو نے کیا کہا؟ وہ بولا میں نے بیچ ڈالنے کو کہا، آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا جس نے اس کا پینا حرام کیا اس نے اس کا بیچنا بھی حرام کیا یہ سن کر اس شخص نے مشک کا منہ کھول دیا سب شراب بہہ گئی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1548
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": 1549,
			"text": "انس بن مالک سے روایت ہے کہ میں ابوعیبد بن جراح اور ابی بن کعب کو شراب پلایا کرتا تھا کھجور اور خشک کھجور کی اتنے میں ایک شخص آیا اور بولا شراب حرام ہوگئی، ابوطلحہ نے کہا اے انس اٹھو گھڑے پھوڑ دو میں اٹھا اور موسل سے مار کر سب گھڑوں کو پھوڑ دیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1549
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": 1550,
			"text": "حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ جب شام کی طرف آئے تو لوگوں نے وبا اور آب و ہوا کے بھاری ہونے کا بیان کیا اور کہا بغیر اس شراب کے ہمارا مزاج اچھا نہیں رہتا آپ نے کہاشہد پیو انہوں نے کہا شہد موافق نہیں ایک شخص بولا ہم اسی کو اس طرح تیار کریں جس میں نشہ نہ ہو آپ نے کہا ہاں، انہوں نے اس کو پکایا اتنا کہ ایک تہائی رہ گیا دو تہائی جل گیا اس کو حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس لائے انہوں نے انگلی ڈالی جب وہ چَپ چَپ کرنے لگا آپ نے فرمایا یہ طلا تو اونٹ کے طلا کے مشابہ ہے حضرت عمر رضی اللہ تعالیٰ عنہ نے اس کے پینے کی اجازت دی عبادہ بن صامت نے کہا آپ نے حلال کر دیا حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا نہیں قسم اللہ کی یا اللہ میں نے کبھی اس چیز کو حلال نہیں کیا جس کو تو نے حرام کیا اور نہ حرام کیا جس کو تو نے حلال کیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1550
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": 1551,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ان سے عراق کے لوگوں نے کہا ہم کھجور اور انگور کے پھل خریدتے ہیں پھر اس کی شراب بنا کر بیچتے ہیں عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا میں گواہ کرتا ہوں اللہ کو اور فرشتوں کو اور جو سنتے ہیں جن اور آدمی کہ میں اجازت نہیں دیتا تم کو بیچنے کی نہ خریدنے کی نہ نچوڑنے کی نہ پینے کی نہ پلانے کی کیونکہ شراب پلید ہے شیطان کا کام ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 1551
			}
		}
	]
}