{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"46": "The Decree"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ بحث کی آدم اور موسیٰ نے تو غالب ہوئے آدم موسیٰ پر موسیٰ نے کہا تو وہی آدم ہے کہ گمراہ کیا تو نے لوگوں کو اور نکالا ان کو جنت سے آدم نے کہا کہ تو وہی موسیٰ ہے کہ اللہ نے تجھے علم دیا ہر چیز کا اور برگزیدہ کیا رسالت سے انہوں نے کہا ہاں پھر آدم نے کہا باوجود اس کے تو مجھے ملامت کرتا ہے ایسے کام پر جو میری تقدیر میں لکھا جا چکا تھا قبل میرے پیدا ہونے کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1623
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "مسلم بن یسار جہنی سے روایت ہے کہ حضرت عمر رضی اللہ تعالیٰ عنہ سے سوال ہوا اس آیت کے متعلق یعنی یاد کر اس وقت کو جب تیرے پروردگار نے آدم کی پیٹھ سے ان کی تمام اولاد کو نکالا اور ان کو گواہ کیا ان پر اس بات کا کیا میں نہیں ہوں پروردگار تمہارا، بولے کیوں نہیں تو پروردگار ہے ہمارا، ہم نے اس واسطے گواہ کیا کہ کہیں ایسا نہ کہو تم قیامت کے روز کہ ہم تو اس سے غافل تھے حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم سے بھی اس آیت کی تفسیر کا سوال ہوا آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا اللہ جل جلالہ نے آدم کو پیدا کیا پھر ان میں اپنا داہنا ہاتھ پھیرا اور اولاد نکالی اور فرمایا میں نے ان کو جنت کے لئے پیدا کیا اور یہ لوگ جنیتوں کے کام کریں گے پھر بایاں ہاتھ پھیرا ان کی پیٹھ پر اور اولاد نکالی فرمایا میں نے ان کو جہنم کے لئے پیدا کیا اور یہ جہنموں کے کام کریں گے ایک شخص بولا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم پھر عمل کرنے سے کیا فائدہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا جب پیدا کرتا ہے کسی بندے کو جنت کے واسطے تو اس سے جنیتوں کے کام کراتا ہے اور موت کے وقت بھی وہ نیک عمل کرکے مرتا ہے تو اللہ جل جلالہ اسے جنت میں داخل کرتا ہے اور جب کسی بندے کو جہنم کے لئے پیدا کرتا ہے تو اس سے جہنیموں کے کام کراتا ہے یہاں تک کہ موت بھی اسے برے کام پر آتی ہے تو اسے جہنم میں داخل کرتا ہے ۔ امام مالک کو پہنچا کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ چھوڑے جاتا ہوں میں تم میں دو چیزوں کو نہیں گمراہ ہو گے جب تک پکڑے رہو گے ان کو، کتاب اللہ اور اس کے رسول کی سنت۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1624
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1625
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "طاؤس الیمانی سے روایت ہے کہ انہوں نے کہا میں نے چند صحابہ کو پایا کہتے تھے کہ ہر چیز تقدیر سے ہے طاؤس نے کہا میں نے عبداللہ بن عمر سے سنا کہتے تھے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ ہر چیز تقدیر سے ہے یہاں تک کہ عاجزی اور ہوشیاری بھی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1626
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "عمرو بن دینار سے روایت ہے کہ میں نے عبداللہ بن زبیر سے سنا خطبہ میں فرماتے تھے کہ اللہ ہی ہدایت کرنے والا اور گمراہ کرنے والا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1627
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "ابی سہیل بن مالک عمر بن عبدالعزیز کے ساتھ جا رہے تھے انہوں نے پوچھا ابوسہیل سے کہ تمہاری کیا رائے ہے قدریہ کے بارے میں ابوسہیل نے کہا میری رائے یہ ہے کہ ان سے توبہ کراؤ توبہ کر لیں تو بہتر، نہیں تو قتل کئے جائیں عمر بن عبدالعزیز نے کہا میری رائے بھی یہی ہے مالک نے کہا میری بھی یہی رائے ہے ان لوگوں کے بارے میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1628
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ نہ چاہے کوئی عورت طلاق اپنی بہن کی تاکہ خالی کرے پیالہ اس کا بلکہ نکاح کر لے کیونکہ جو اس کے مقدر میں ہے اس کو ملے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1629
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "محمد بن کعب قرظی سے روایت ہے کہ معاویہ بن ابی سفیان نے منبر پر کہا اے لوگوں جو اللہ جل جلالہ دے اس کو کوئی روکنے والا نہیں ہے اور جو نہ دے اس کو کوئی دینے والا نہیں ہے اور کسی طاقت والے کی طاقت کام نہیں آتی جس شخص کو اللہ بھلائی پہنچانا چاہتا ہے اس کو دین میں سمجھ دیتا ہے اور علم فقہ دیتا ہے پھر کہا معاویہ نے میں نے ان کلمات کو رسول اللہ صلی اللہ علیہ وآلہ وسلم سے سنا انہیں لکڑیوں پر ۔ امام مالک سے روایت ہے کہ پہلے زمانے میں لوگ یوں کہا کرتے تھے کہ سب خوبیاں اس اللہ کی ہیں جس نے پیدا کیا عرش کو جیسے چاہے جو وقت مقرر کر دیا ہے اس سے پہلے کوئی چیز نہیں ہو سکتی کافی ہے مجھ کو اللہ اور کافی ہے ایسا کافی ہے کہ سنتا ہے اللہ جو اس کو پکارے اللہ کے سوا کوئی شخص نہیں جس سے دعا کیا جائے ۔ امام مالک کو پہنچا کہ پہلے زمانے میں یوں کہا جاتا تھا کہ کوئی آدمی نہیں مرے گا جب تک کہ اس کا رزق پورا نہ ہو پس اختصار کرو طلب معاش میں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1630
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1631
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 46,
				"hadith": 1632
			}
		}
	]
}