{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"47": "Good Character"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "معاذ بن جبل سے روایت ہے کہ آخری وصیت جو رسول اللہ صلی اللہ علیہ وآلہ وسلم نے مجھ کو کی جب میں رکاب میں پاؤں رکھنے لگا یہ تھی کہ اے معاذ خوش خلقی کر لوگوں سے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1633
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم کو جب دنیا کے دو کاموں میں اختیار ہوا تو آپ نے آسان امر کو اختیار کیا بشرطیکہ اس میں گناہ نہ ہو اگر گناہ ہوتا تو سب سے زیادہ آپ اس سے پرہیز کرتے اور رسول اللہ صلی اللہ علیہ وآلہ وسلم اپنی ذات کے واسطے کسی سے بدلہ نہیں لیتے تھے مگر جب اللہ کی حرمت میں خلل پڑے تو اس وقت بدلہ لیتے تھے اللہ کے واسطے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1634
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1635
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "علی بن حسین بن علی بن ابی طالب سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے اسلام کی بہتریوں میں سے یہ ہے کہ آدمی بے کار اور فضول چیزوں کو چھوڑ دے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ ایک شخص نے اذن چاہا رسول اللہ صلی اللہ علیہ وآلہ وسلم کے پاس آنے کا اور میں آپ صلی اللہ علیہ وآلہ وسلم کے ساتھ تھی گھر میں آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا برا آدمی ہے یہ پھر آپ صلی اللہ علیہ وآلہ وسلم نے اس کو آنے کی اجازت دی حضرت عائشہ کہتی ہیں کہ تھوڑی دیر نہیں گزری تھی کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم کو میں نے اس کے ساتھ ہنستے ہوئے سنا جب وہ چلا گیا تو میں نے کہا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم ابھی تو آپ صلی اللہ علیہ وآلہ وسلم نے اس کو برا کہا تھا ابھی آپ صلی اللہ علیہ وآلہ وسلم اس سے ہنسنے لگے آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ سب آدمیوں میں برا وہ آدمی ہے جس سے لوگ بچیں یا ڈریں اس کے شر کے سبب سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1636
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "کعب احبار نے کہا کہ جب تم کسی بندہ کا حال جاننا چاہو اس کے پروردگار کے پاس تو دیکھو لوگ اس کو کیسا کہتے ہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1637
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "یحیی بن سعید سے روایت ہے کہ مجھ کو یہ پہنچا کہ آدمی حسن خلق کی وجہ سے رات بھر عبادت کرنے والے اور دن بھر پیاسے رہنے والے کا درجہ حاصل کرتا ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1638
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "سعید بن مسیب نے کہا کیا میں بہ بتاؤں تم کو وہ چیز جو بہت سی نمازوں اور صدقہ سے بہتر ہے لوگوں نے کہا بتاؤ سعید نے کہا ایک دوسرے کے بیچ صلح کرادیں اور بچو تم بغض اور عدوات سے یہ خصلت مونڈنے والی ہے نیکیوں کو ۔ امام مالک کو پہنچا کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا میں اس واسطے بھیجا گیا کہ اخلاق کی خوبیوں کو پورا کردوں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1639
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1640
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "زید بن طلحہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ ہر دین کا ایک خلق ہے اور اسلام کا خلق حیاء ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1641
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے دیکھا ایک شخص کو نصیحت کر رہا تھا اپنے بھائی کو حیاء کے بارے میں آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا جانے دے کیونکہ حیاء ایمان میں سے ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1642
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "حمید بن عبدالرحمن بن عوف سے روایت ہے کہ ایک شخص آیا رسول اللہ صلی اللہ علیہ وآلہ وسلم کے پاس اور بولا کہ یا رسول اللہ صلی اللہ علیہ وآلہ وسلم مجھے چند باتیں بتاد یجئے جن سے میں نفع اٹھاؤں اور بہت باتیں نہ بتانا میں بھول جاؤں گا آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا تو غصہ مت کیا کر۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1643
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ وہ آدمی وزر آور نہیں ہے جو کشتی میں لوگوں کو پچھاڑ دے وزر آور ہے جو اپنے نفس پر قادر ہو غصے کے وقت۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1644
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "ابو ایوب انصاری سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ مسلمان کو درست نہیں کہ اپنے بھائی مسلمان کی ملاقات ترک کرے یعنی اس کو چھوڑ دے تین دن سے زیادہ یا یہ ملے تو وہ نہ دیکھے یا وہ ملے تو نہ دیکھے بہتر ان دونوں میں وہ ہے جو پہلے سلام علیک کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1645
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "انس بن مالک سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ مت بغض کرو مر حسد کرو مت پیٹھ پھیرو ایک دوسرے سے بلکہ ہو جاؤ اللہ کے بندے بھائی بھائی نہیں درست ہے کسی مسلمان کو کہ اپنے بھائی کو چھوڑ دے تین راتوں سے زیادہ ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1646
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ بچو تم بد گمانی سے کیونکہ بد گمانی بڑا جھوٹ ہے اور مت کھوج لگاؤ اور مت تفتیش کرو اور مت حرص کرو دنیا کی اور مت حسد کرو نہ بغض کرو نہ ایک دوسرے سے پیٹھ موڑو بلکہ ہو جاؤ اللہ کے بندے بھائی بھائی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1647
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "عطا بن عبداللہ رضی اللہ تعالیٰ عنہ خراسانی سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہا مصافحہ کرو ایک دوسرے سے دل کا کینہ جاتا رہے گا ہدیہ بھیجو ایک دوسرے کی دوست ہو جاؤ گے اور دشمنی جاتی رہے گی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1648
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "ابوہریرة رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ جنت کے دروازے کھل جائے ہیں پیر اور جمعرات کے روز تو ہر بندہ مسلمان جو اللہ کے ساتھ کسی کو شریک نہیں کرتا وہ بخش دیا جاتا ہے مگر وہ شخص جو اپنے بھائی سے عداوت رکھتا ہو کہا جاتا ہے کہ ان دونوں آدمیوں کے متعلق کہ دیکھتے رہو جب تک وہ مل جائیں ان دونوں آدمیوں کو دیکھتے رہو جب تک وہ مل جائیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1649
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ نے کہا ہر ہفتہ میں دو مرتبہ پیر اور جمعرات کے روز بندوں کے اعمال دیکھے جاتے ہیں پھر ہر مومن بندہ بخش دیا جاتا ہے مگر وہ بندہ جو اپنے بھائی سے عداوت رکھتا ہو تو حکم ہوتا ہے کہ ابھی ان دونوں کو رہنے دو یہاں تک کہ مل جائیں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 1650
			}
		}
	]
}