{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"48": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "جابر بن عبداللہ انصاری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ہم رسول اللہ صلی اللہ علیہ وآلہ وسلم کے ساتھ نکلے غزوہ بن انمار میں تو ہم ایک درخت کے تلے اترے ہوئے تھے اتنے میں رسول اللہ صلی اللہ علیہ وآلہ وسلم دکھائی دئے میں نے کہا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم سائے میں آئے آپ صلی اللہ علیہ وآلہ وسلم آکر اتر میں اپنی زنبیل کو دیکھنے گیا اس میں ڈھونڈنے لگا تو ایک ککڑی ملی میں اس کو توڑ کر رسول اللہ صلی اللہ علیہ وآلہ وسلم کے سامنے لے گیا آپ صلی اللہ علیہ وآلہ وسلم نے پوچھا یہ کہاں سے آئی جابر نے کہا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم مدینہ سے ہم اس کو لے کر نکلے تھے پھر جابر کہتے ہیں ہمارے ساتھ ایک شخص تھا جس کا سامان سفر ہم نے کر دیا تھا وہ ہمارے جانور چراتا تھا جب وہ پیٹھ موڑ کر جانور چرانے جانے لگا تو وہ چادریں اوڑھے ہوئے تھا جو پھٹ کر چندی چندی ہوگئی تھیں رسول اللہ صلی اللہ علیہ وآلہ وسلم نے اس کو دیکھ کر فرمایا کہ کیا اور کپڑے اس کے پاس نہیں ہیں جابر نے کہا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم ہیں گٹھری میں بندھے ہیں میں نے اس کو پہننے کے لئے دئیے ہیں آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ اس سے کہو کہ وہ کپڑے پہن لے میں نے اس کو بلایا اس نے وہ کپڑے گٹھری سے نکال کر پہن لئے جب پھر جانے لگا تو رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ اس کو کیا ہوگیا تھا اللہ اس کی گردن مارے اب کیا اچھا معلوم نہیں ہوتا اس کو اس شخص نے یہ سن کر کہا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم کیا اللہ کی راہ میں میری گردن ماری جائے آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا ہاں اللہ کی راہ میں پھر وہ شخص شہید ہوا اللہ کی راہ میں ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا کہ میں چاہتا ہوں عالم کو اچھے کپڑے پہنے ہوئے دیکھوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1651
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1652
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا کہ جب اللہ تم کو وسعت دے تو اپنے اوپر بھی وسعت کرو اپنے کپڑے بنالو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1653
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1654
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "کہا مالک نے مردوں کو کسم سے رنگی ہوئی چادریں اوڑھنا گھر یا اس کے گرداگرد میں حرام نہیں سمجھتا لیکن نہ پہننا میرے نزدیک بہتر اور اس سوائے اس کے اور لباس پہننا اچھا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1655
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا نے عبداللہ بن زبیر کو ایک کپڑا پہناتا جس میں اون اور ریشم تھا اور حضرت عائشہ بھی اس کو پہنا کرتی تھیَ",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1656
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "مرجانہ سے روایت ہے کہ حفصہ بنت عبدالرحمن بن ابی بکر عائشہ رضی اللہ تعالیٰ عنہا کے پاس گئیں ایک باریک سر بند اوڑھ کر حضرت عائشہ رضی اللہ تعالیٰ عنہا نے اس کو پھار ڈالا اور موٹے کپڑے کا سر بند اوڑھا دیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1657
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ نے فرمایا کہ جو عورتیں کپڑا پہنے ہوئے ہیں لیکن ننگی ہیں خود بھی سیدھی راہ سے ہٹی ہوئی ہیں اور خاوند کو بھی ہٹا دیتی ہیں جنت میں نہ جائیں گی بلکہ جنت کی خوشبو تک نہ سونگھیں گی حالانکہ جنت کی خوشبو پانچ سو برس کی راہ سے آتی ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1658
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "ابن شہاب سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم رات کو بیدار ہوئے اسمان کی طرف دیکھ کر فرمایا کہ رات کو اللہ جل جلالہ نے کتنے ایک خزانے کھولے اور کتنے ایک فتنے واقع ہوئے کتنی عورتیں ایسی ہیں جو دینا میں تو کپڑے پہنے ہوئی ہیں مگر قیامت کے روز ننگی ہوں گی ہوشیار کردو ان کوٹھریوں والیوں کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1659
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ جو شخص اپنا کپڑ لٹکائے گا تکبر کے طور پر تو قیامت کے روز اللہ جل جلالہ اس کی طرف نظر تک نہ کرے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1660
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ نہیں نظر کرے گا اللہ قیامت کے روز اس شخص کی طرف جو اپنا تہ بند لٹکائے تکبر کے طور پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1661
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ نہیں نظر کرے گا اللہ جل جلالہ قیامت کے روز اس شخص کی طرف جو اپنا کپڑا لٹکائے غرور اور گھمنڈ کے طور پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1662
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "عبدالرحمن بن یعقوب سے روایت ہے کہ کہتے ہیں ابوسعید خدری رضی اللہ تعالیٰ عنہ سے پوچھا ازار کا حال انہوں نے کہا مجھے علم ہے میں بتاتا ہوں میں نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے سنا کہ آپ صلی اللہ علیہ وآلہ وسلم فرماتے تھے کہ مومن کی ازار پنڈلیوں تک ہوتی ہے خیر ٹخنوں تک بھی رکھے تو کچھ قباحت نہیں ہے اس سے نیچے جہنم میں جانے کی بات ہے اللہ قیامت کے روز اس شخص کی طرف نظر نہ کرے گا جو اپنی ازار لٹکائے غرو اور گھمنڈ کے طور پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1663
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ نبی صلی اللہ علیہ وآلہ وسلم نے ازار لٹکانے کا ذکر کی تو میں نے پوچھا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم عورت کیا کرے آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا ایک بالشت ازار نیچے رکھے ام سلمہ نے کہا اتنی تو کھل جائے گی آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا ایک ہاتھ نیچے رکھے اس سے زیادہ نہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1664
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ نہ چلے تم میں کوئی ایک جوتی پہن کر چاہئے کہ دونوں جوتیاں پہنے یا دونوں اتار دے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1665
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وآلہ وسلم نے کہ جب جوتا پہنے کوئی تم میں سے چاہے کہ داہنے پیر میں اول پہنے اور جب اتارے تو پہلے بائیں پیر کا اتارے تو داہنا پیر پہنتے وقت شروع میں رہے اور اتارتے وقت اخیر میں رہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1666
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "کعب الاحبار سے روایت ہے کہ ایک شخص نے اپنی جوتی اتاری کعب الاحبار نے کہا تم نے کیوں جوتیاں اتاریں شاید تو نے اس آیت کو دیکھ کر اتاری ہوں گی اللہ جل جلالہ نے حضرت موسیٰ علی نبینا سے جب وہ طور پر جانے لگے فرمایا اتار جوتیاں اپنی مگر تو جانتا ہے موسیٰ علیہ السلام کی جوتیاں کا ہے کی تھیں ۔ کہا مالک نے مجھ معلوم نہیں اس شخص نے کیا جواب دیا کعب نے کہا حضرت موسیٰ کی جوتیاں مردہ گدھے کی کھال کی تھیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1667
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ منع کیا رسول اللہ نے دو لباسوں سے اور دو بیعوں سے ایک بیع ملامسہ اور دوسرے بیع منابذہ سے اور ایک کپڑے اوڑھ کر اختباء کرنے سے جب کہ اس کی شرمگاہ پر کوئی کپڑا نہ ہوا اور ایک کپڑا سارے بدن پر لپیٹ لینے سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1668
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت عمر رضی اللہ تعالیٰ عنہ نے ایک کپڑا ریشمی بکتا ہوا دیکھا مسجد کے دروازے پر انہوں نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے کہا کاش آپ صلی اللہ علیہ وآلہ وسلم اس کو خرید لیتے اور جمعہ کے روز اور جس روز آپ صلی اللہ علیہ وآلہ وسلم کے پاس وفد کے لوگ آیا کرتے ہیں پہنا کرتے رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا اس کپڑے کو وہ شخص پہنے گا جس کا آخرت میں کچھ حصہ نہیں ہے پھر اسی قسم کے چند کپڑے آپ صلی اللہ علیہ وآلہ وسلم کے پاس آئے آپ صلی اللہ علیہ وآلہ وسلم نے ان میں سے ایک کپڑا حضرت عمر رضی اللہ تعالیٰ عنہ کو دیا حضرت عمر رضی اللہ تعالیٰ عنہں نے کہا یا رسول اللہ صلی اللہ علیہ وآلہ وسلم پہلے تو آپ صلی اللہ علیہ وآلہ وسلم نے عطارد کے کپڑے کی بابت فرمایا تھا کہ اس کو وہ شخص پہنے گا جس کا آخرت میں کچھ حصہ نہیں آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا میں نے تجھے یہ کپڑا پہننے کو تھوڑی دیا ہے پھر حضرت عمر رضی اللہ تعالیٰ عنہ نے وہ کپڑا اپنے ایک کافر بھائی کو دے دیا جو مکہ میں تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1669
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "انس بن مالک نے کہا میں نے حضرت عمر رضی اللہ تعالیٰ عنہ کو دیکھا جب کہ وہ امیر المومنی تھے ان کے دونوں مونڈھوں کے بیچ میں کرتے میں تین پیوند لگے تھے ایک کے اوپر ایک ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1670
			}
		}
	]
}