{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"51": "Hair"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1730
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "حمید بن عبدالرحمن بن عوف سے روایت ہے کہ انہوں نے معاویہ بن ابوسفیان سے سنا جس سال انہوں نے حج کیا اور وہ منبر پر تھے انہوں نے ایک بالوں کا چٹلا اپنے خادم کے ہاتھ سے لیا اور کہتے تھے کہ اے مدینہ والو کہاں ہیں علماء تمہارے؟ سنا میں نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے منع کرتے تھے اس سے اور فرماتے تھے کہ تباہ ہوئے بنی اسرائیل جب ان کی عورتوں نے یہ کام شروع کیا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1731
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "ابن شہاب سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم اپنے بال پیشانی کی طرف لٹکاتے رہے ایک مدت تک بعد اس کے مانگ نکالنے لگے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1732
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "عبداللہ بن عمر مکروہ جانتے تھے خصی کرنے کو اور کہتے تھے کہ خصیے رکھنے میں پیدائش کو پورا کرنا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1733
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "صفوان بن سلیم کو پہنچا کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا میں یتیم کا پالنے والا خواہ یتیم کا عزیز ہو یا غیر، بہشت میں ایسے ہیں جیسے یہ دونوں انگلیان جبکہ پرہیزگاری کرے اور آپ صلی اللہ علیہ وآلہ وسلم نے اشارہ کیا کلمہ کی انگلی اور بیچ کی انگی کی طرف ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1734
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "یحیی بن سعید سے روایت ہے کہ ابوقتادہ رضی اللہ تعالیٰ عنہ انصاری نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے کہا میرے بال کندھوں تک ہیں ان میں کنگھی کروں آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا ہاں کنگھی کر اور بالوں کی عزت کر ابوقتادہ کبھی کبھی ایک دن میں دوبار تیل ڈالتے اس وجہ سے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا تھا کہ بالوں کی عزت کر۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1735
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "عطاء بن یسار سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم مسجد میں بیٹھے ہوئے تھے اتنے میں ایک شخص نجس بال سر اور داڑھی کے پریشان تھے آیا آپ صلی اللہ علیہ وآلہ وسلم نے اس کو اشارہ کیا یعنی مسجد سے باہر جا اور بالوں کو درست کر کے آ وہ شخص درست کر کے پھر آیا آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کیا یہ اچھا نہیں اس صورت سے کہ آئے کوئی تم میں سے پریشان سر جیسے شیطان ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1736
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "ابو سلمہ بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ عبدالرحمن بن اسود ان کا ہم صحبت تھا اور اس کے سر اور داڑھی کے بال سب سفید تھے ایک روز صبح کو آیا اپنے بالوں پر سرخ خضاب لگا کر تو لوگوں نے کہا یہ اچھا ہے وہ بولا میری ماں حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہلا بھیجا نخیلہ اپنی لونڈی کے ہاتھ قسم دے کر کہ تو اپنے بالوں پر خضاب لگا اور بیان کیا کہ ابوبکر رضی اللہ تعالیٰ عنہ بھی خضاب لگایا کرتے تھے ۔ کہا مالک نے سیاہ خضاب میں میں نے کوئی حدیث نہیں سنی اور سوائے سیاہ کے اور کوئی رنگ بہتر ہے اور خضاب نہ کرنا بہت بہتر ہے اگر اللہ چاہے، اور لوگوں پر اس بارے میں کچھ تنگی نہیں ہے۔ کہا مالک نے اس حدیث سے معلوم ہوا کہ رسول اللہ صلی اللہ علیہ وسلم نے خضاب نہیں لگایا اگر لگایا ہوتا تو حضرت عائشہ رضی اللہ تعالیٰ عنہا عبدالرحمن کے پاس یہی کہلا بھیجتیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1737
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "خالد بن ولید نے کہا رسول اللہ صلی اللہ علیہ وآلہ وسلم سے کہ میں ڈرتا ہوں سوتے میں۔ آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ یہ پڑھ لیا کر پناہ مانگتا ہوں میں اللہ کے پورے کلمات سے اس کے غصے اور عذاب سے اور اس کے بندوں کے شر سے اور شیطانوں کے وسوسوں سے اور شیطانوں کے میرے پاس آنے سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1738
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "یحیی بن سعید رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم کو جس رات معراج ہوئی ایک دیو نظر آیا گویا اس کے ایک ہاتھ میں ایک شعلہ تھا آگ کا جب رسول اللہ صلی اللہ علیہ وآلہ وسلم نگاہ کرتے تو اس کو دیکھتے آپ صلی اللہ علیہ وآلہ وسلم کی طرف چلا آتا تھا حضرت جبرائیل علیہ السلام نے فرمایا میں آپ صلی اللہ علیہ وآلہ وسلم کو چند کلمات سکھا دوں کہ اگر آپ صلی اللہ علیہ وآلہ وسلم ان کو فرمائیں تو ان کا شعلہ بجھ جائے آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کیوں نہیں سکھاؤ جبرائل نے کہا کہو اعوذ بوجہ اللہ یعنی پناہ مانگتا ہوں میں اللہ کی منہ سے جو بڑا عزت والا ہے اور اس کے کلمات سے جو پورے ہیں جن سے کوئی نیک یا بد آگے نہیں بڑھ سکتا برائی سے اس چیز کی جو آسمان سے اترے اور جو اسمان کی طرف چڑھے اور برائی سے ان چیزوں کی جن کو پیدا کیا ہے اس نے زمین میں اور جو نکلے زمین سے اور رات دن کے فتنوں سے اور شب و روز کی آفتوں سے اور حادثوں سے مگر جو حادثہ بہتر ہے یا رحمن۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1739
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ایک آدمی قبیلہ اسلم کا بولا میں رات کو نہیں سویا، آپ صلی اللہ علیہ وآلہ وسلم نے پوچھا کیوں کس وجہ سے؟ وہ بولا مجھے بچھو نے کاٹا، رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا اگر تو شام کے وقت یہ کہہ لیتا اعوذبکلمات اللہ التامات من شرماخلق (یعنی پناہ مانگتا ہوں میں اللہ کے پورے کلمات سے ان چیزوں کے شر سے جن کو پیدا کیا اس نے) تو بچھو تجھے کچھ ضرر نہ دیتا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1740
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "قعقاع بن حکیم سے روایت ہے کہ کعب الاحبار نے کہا اگر میں چند کلمات نہ پڑھا کرتا تو یہودی مجھے گدھا بنا دیتے لوگوں نے پوچھا وہ کلمات کیا ہیں کعب نے کہا یعنی میں پناہ مانگتا ہوں اللہ کے منہ سے جو بڑی عظمت ولا ہے نہیں ہے کوئی چیز عظمت میں اس سے بڑھ کر اور اس اللہ کے پورے کلمات سے جن سے کوئی نیک یا بد آگے نہیں بڑھ سکتا اور اس اللہ کے تمام اسمائے حسنی سے جن کو میں جانتا ہوں اور جن کو میں نہیں جانتا اس چیز کے شر سے جس کو اس نے بنایا پیدا کیا اور پھیلایا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1741
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا اللہ جل جلالہ ارشاد فرمادے گا دن قیامت کے کہ کہاں ہیں وہ لوگ جو آپس میں دوستی رکھتے تھے میری بزرگی کے واسطے آج کے دن میں ان کو سائے میں رکھوں گا یہ وہ دن ہے جس دن کہیں سایہ نہیں سوائے میرے سائے کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1742
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ سات شخص جن کو اللہ تعالیٰ اپنے سائے میں رکھے گا جس دن اس کے سائے کے سوا اور کوئی سایہ نہ ہوگا ایک تو منصف حاکم دوسرے وہ جوان جو جوانی کی امنگ ہی سے اللہ کی بندگی میں مشغول ہوں تیسرے وہ مرد جس کا دل مسجد میں لگا رہے جب کہ نکلے پھر آنے تک چوتھے وہ دو مرد جو اللہ کے واسطے آپس میں محبت رکھتے ہیں تو اسی پر جدا ہوتے ہیں تو اسی پر ملتے ہیں، پانچویں وہ مرد جس نے اللہ کو یاد کیا تنہائی میں دونوں آنکھوں سے اس کی آنسو بہہ نکلے، چھٹے وہ مرد جس کو شریف خوبصورت عورت نے بد فعلی کے لئے بلایا وہ بولا مجھے خوف ہے اللہ کا جو پالنے والا ہے سارے جہان کا ساتویں وہ مرد جس نے خیرات کی چھپا کر یہاں تک کہ جو داہنے ہاتھ سے دیا بائیں ہاتھ کو اس کی خبر نہیں ہوئی",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1743
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا کہ جب اللہ کسی بندے سے محبت کرتا ہے تو پکارتا ہے جبرائیل کو اور یہ فرماتا ہے کہ بے شک اللہ نے فلانے کو دوست رکھا ہے سو تو بھی اس کو دوست رکھ تو جبرائیل اس سے محبت رکھتا ہے پھر پکار دیتا ہے جبرائیل آسمان والوں میں یعنی فرشتوں میں کہ بے شک اللہ نے فلانے کو دوست رکھا ہے سو تم بھی اس کو دوست رکھو تو آسمان والے اس سے محبت رکھتے ہیں پھر اس محبوب بندے کی زمین میں قبولیت اتاری جاتی ہے یعنی زمین کے نیک لوگ اس کو مقبول جانتے ہیں اور اس سے محبت رکھتے ہیں اور جب اللہ کسی بندہ سے ناراض وغصہ ہوتا ہے ۔ (تو بھی اسی طرح کرتا ہے یعنی اس کا الٹ)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1744
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "ابو ادریس خولانی سے روایت ہے کہ میں دمشق کی مسجد میں گیا وہاں مں نے ایک نوجوان کو دیکھا جو سفید دندان تھا اس کے ساتھ والے لوگ جب کسی بات میں اختلاف کرتے ہیں تو جو وہ کہتا ہے اسی کی سند پکڑتے ہیں اور اس کے قول پر تھم جاتے ہیں میں نے پوچھا یہ نوجوان کون ہے لوگوں نے کہا معاذ بن جبل ہیں جب دوسرا روز ہوا تو میں بہت سویرے گیا دیکھا تو وہ مجھ سے آگے آئے ہیں اور نماز پڑھ رہے ہیں میں ٹھہرا رہا جب نماز پڑھ چکے تو میں ان کے سامنے آیا اور سلام کیا پھر میں نے کہا میں تم کو اللہ جل جلالہ کے واسطے چاہتا ہوں اور محبت کرتا ہوں انہوں نے کہا اللہ کے واسطے؟ میں نے کہا ہاں اللہ کے واسطے انہوں نے پھر کہا اللہ کے واسطے؟ میں کہا ہاں اللہ کے واسطے پھر انہوں نے میری چادر کا کونا پکڑ کے مجھے گھسیٹا اور کہا خوش ہوجا میں نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے سنا آپ صلی اللہ علیہ وآلہ وسلم فرماتے تھے کہ اللہ جل جلالہ فرماتے ہے واجب ہوئی محبت میری ان لوگوں سے جو میرے واسطے دوستی اور محبت رکھتے ہیں اور میرے واسطے مل کر بیٹھتے ہیں اور میرے واسطے اپنی جان اور مال صرف کرتے ہیں اور میرے واسطے ایک دوسرے کی ملاقات کو جاتے ہیں ۔ عبداللہ بن عباس رضی اللہ تعالیٰ عنہما کہتے ہیں میانہ روی اور نرمی اور اچھی سج دھج ایک جز ہے نبوت کے پچیس جزوں میں سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1745
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1746
			}
		}
	]
}