{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"53": "Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "زید بن اسلم سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا سلام کرے سوار پیادے کو اور جب ایک آدمی قوم میں سے سلام کرے تو ان سب سے کافی ہو جائے گا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1756
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "محمد بن عمرو بن عطاء سے روایت ہے کہ میں بیٹھا ہوا تھا عبداللہ بن عباس کے پاس اتنے میں ایک شخص یمن کا رہنے والا آیا اور بولا السلام علیکم ورحمة اللہ وبرکاتہ اور اس پر بھی کچھ زیادہ کیا ابن عباس رضی اللہ تعالیٰ عنہما کی ان دنوں بینائی جاتی رہی تھی انہوں نے کہا یہ کون ہے لوگوں نے کہا یہ وہی یمن کا رہنے والا ہے جو آیا کرتا ہے آپ کے پاس اور پتہ دیا اس کا یہاں تک کہ ابن عباس پہچان گئے اس کو ابن عباس نے کہا سلام ختم ہو گیا وبرکاتہ پر اس سے زیادہ نہ بڑھانا چاہئے کہا یحیی نے سوال ہوا مالک سے مرد سلام کرے عورت پر انہوں نے کہا بڑھیا پر تو کچھ قباحت نہیں لیکن جوان پر اچھا نہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1757
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم نے فرمایا یہودی جب تم کو سلام کرتے ہیں تو السلام علیکم کے بدلے السام علیکم کہتے ہیں تم بھی علیک کہا کرو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1758
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "ابو واقد لیثی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وآلہ وسلم بیٹھے تھے مسجد میں لوگ آپ صلی اللہ علیہ وآلہ وسلم کے ساتھ تھے اتنے میں تین آدمی آئے دو تو آپ صلی اللہ علیہ وآلہ وسلم کے پاس آئے اور ایک چلا گیا جب وہ دونوں رسول اللہ صلی اللہ علیہ وآلہ وسلم کے پاس پہنچے تو سلام کیا اور ایک شخص ان میں سے حلقے میں جگہ پا کر بیٹھ گیا اور ایک پیچھے بیٹھا رہا اور تیسرا تو پہلے ہی چلا گیا تھا جب آپ صلی اللہ علیہ وآلہ وسلم فارغ ہوئے تو آپ صلی اللہ علیہ وآلہ وسلم نے فرمایا کیا میں تم کو ان تینوں آدمیوں کا حال نہ بتلاؤں؟ ایک تو ان میں سے اللہ کے پاس آیا اللہ نے بھی اس کو جگہ دی ایک نے ان میں سے شرم کی اللہ نے بھی اس سے شرم کی اور ایک نے ان میں سے منہ پھیر لیا اللہ نے بھی اس طرف سے منہ پھیر لیا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1759
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "انس بن مالک نے سنا حضرت عمر رضی اللہ تعالیٰ عنہ سے ان کو ایک شخص نے سلام کیا حضرت عمر رضی اللہ تعالیٰ عنہ نے اس کا جواب دیا پھر اس سے مزاج پوچھا اس نے کہا شکر کرتا ہوں اللہ کا حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا میرا یہی مطلب تھا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1760
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "طفیل بن ابی بن کعب عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے پاس آتے اور صبح صبح ان کے ساتھ بازار کو جاتے طفیل کہتے ہیں جب ہم بازار میں پہنچے تو عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ہر ایک ردی ودی بیچنے والے پر اور ہر دکاندار پر اور ہر مسکین پر اور ہر کسی پر سلام کرتے ایک روز میں عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے پاس آیا انہوں نے مجھے بازار لے جانا چاہا میں نے کہا تم بازار میں جا کر کیا کرو گے نہ تم بیچنے والوں کے پاس ٹھہرتے ہو نہ کسی اسباب کو پوچھتے ہو اس سے یہیں بیٹھے رہو ہم تم باتیں کریں گے عبداللہ بن عمر نے کہا اے پیٹ والے بازار میں سلام کرنے کو جاتے ہیں جس سے ملاقات ہوتی ہے اس کو سلام کرتے ہیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1761
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "یحیی بن سعید سے روایت ہے کہ ایک شخص نے سلام کیا عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کو تو کہا السلام علیکم ورحمة اللہ وبرکاتہ والغایات الرائحات عبداللہ بن عمر نے کہا وعلیک الفا اور اس طرح کہا جیسے کہ اس کو برا جانا ۔ امام مالک کو پہنچا کہ جب کوئی آدمی ایسے گھر میں جائے جو خالی پڑا ہو تو کہے السلام علینا وعلی عباد اللہ الصالحیں یعنی سلامتی ہو ہم پر اور اللہ کے نیک بندوں پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1762
			}
		}
	]
}