{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"6": "Prayer in Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 246,
			"arabicnumber": 246,
			"text": "ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھی مسجد میں ایک رات تو نماز پڑھی پیچھے آپ صلی اللہ علیہ وسلم کے لوگوں نے پھر دوسری رات میں اسی طرح پڑھی تو لوگ بہت آئے پھر لوگ تیسری یا چوتھی رات جمع ہوئے لیکن نبی صلی اللہ علیہ وسلم ( تراویح ) کے لئے نہیں نکلے ۔ جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم نے فرمایا میں نے دیکھا جو تم نے کیا لیکن مجھے کسی چیز نے نکلنے سے نہیں روکا سوائے اس خوف سے کہ کہیں یہ ( تراویح ) تم پر فرض نہ ہوجائے اور یہ قصہ رمضان میں تھا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 247,
			"arabicnumber": 247,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم رغبت دلاتے تھے لوگوں کو تراویح پڑھنے کی راتوں کو اور نہ حکم کرتے تھے بطور واجب کے تو فرماتے تھے آپ جس نے ترایح پڑھی رمضان میں اس کو حق سمجھ کر خاص اللہ کے لئے بخشے جائیں گے اگلے گناہ اس کے کہا ابن شہاب نے پس وفات ہوئی رسول اللہ صلی اللہ علیہ وسلم کی اور ایسا ہی حال رہا پھر ایسا ہی حال رہا حضرت ابوبکر کی خلافت میں اور شروع شروع حضرت عمر کی خلافت میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 248,
			"arabicnumber": 248,
			"text": "عبدالر حمن بن عبدالقاری سے روایت ہے کہ میں نکلا عمر بن خطاب کے ساتھ رمضان میں مسجد کو تو دیکھا کہ لوگ جدا جدا متفرق پڑھ رہے ہیں کسی شخص کے ساتھ آٹھ دس آدمی پڑھ رہے ہیں تو کہا عمر نے قسم اللہ کی مجھے معلوم ہوتا ہے کہ اگر ان سب کو ایک قاری کے پیچھے کردوں تو اچھا ہو پھر ان سب کو ابی بن کعب کے پیچھے کر دیا کہا عبدالرحمن نے پھر جب دوسری رات کو میں ان کے ساتھ آیا تو دیکھا کہ سب لوگ ابی بن کعب کے پیچھے نماز پڑھ رہے ہیں تب کہا حضرت عمر نے اچھی ہے یہ بدعت اور جس وقت تم سوتے ہو وہ بہتر ہے اس وقت سے جب نماز پڑھتے ہو یعنی اول رات اور لوگ کھڑے ہوتے تھے اول رات میں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 249,
			"arabicnumber": 249,
			"text": "سائب بن یزید سے روایت ہے کہ حکم کیا حضرت عمر نے ابی بن کعب اور تمیم داری کو گیارہ رکعت پڑھانے کا کہا سائب بن یزید نے کہا امام پڑھتا تھا سو سو آیتیں ایک رکعت میں یہاں تک کہ ہم سہارا لگاتے تھے لکڑی پر اور نہیں فارغ ہوتے تھے ہم مگر قریب فجر کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 250,
			"arabicnumber": 250,
			"text": "یزید بن رومان سے روایت ہے کہ لوگ پڑھتے تھے حضرت عمر کے زمانے میں تیئس رکعتیں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Munqar"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 251,
			"arabicnumber": 251,
			"text": "داؤد بن حصین نے سنا عبدالرحمن بن ہرمز اعرج سے کہتے تھے میں نے پایا لوگوں کو لعنت کرتے تھے کافروں پر رمضان میں اور امام پڑھتا تھا سورت بقرہ آٹھ رکعتوں میں جب بارہ رکعتوں میں پڑھتا تھا تو لوگوں کو معلوم ہوتا تھا کہ تخفیف کی۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 252,
			"arabicnumber": 252,
			"text": "عبداللہ بن ابی بکر سے روایت ہے کہتے تھے سنا میں نے اپنے باپ سے کہتے تھے جب فراغت پاتے تھے تراویح سے رمضان میں تو جلدی مانگتے تھے نوکروں سے کھانے کو فجر ہونے کے ڈر سے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 253,
			"arabicnumber": 253,
			"text": "عروہ بن زبیر سے روایت ہے کہ ذکوان جو غلام تھے حضرت عائشہ کے اور ان کو حضرت عائشہ نے آزاد کر دیا تھا اپنے بعد کھڑے ہوتے تھے اور پڑھاتے تھے نماز ان کی رمضان میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 253
			}
		}
	]
}