{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"9": "Shortening the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 326,
			"arabicnumber": 326,
			"text": "اعرج سے روایت ہے کہ رسول اللہ جمع کرتے تھے ظہر اور عصر کو سفر تبوک میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 327,
			"arabicnumber": 327,
			"text": "معاذ بن جبل سے روایت ہے کہ صحابہ نکلے ساتھ رسول اللہ صلی اللہ علیہ وسلم کے غزوہ تبوک کے سال تو رسول اللہ صلی اللہ علیہ وسلم جمع کرتے ظہر اور عصر اور مغرب اور عشاء کو پس ایک دن تاخیر کی ظہر کی پھر نکل کر ظہر اور عصر کو ایک ساتھ پڑھا پھر داخل ہوئے ایک مقام میں پھر وہاں سے نکل کر مغرب اور عشاء کو ایک ساتھ پڑھا پھر فرمایا کہ کل اگر اللہ چاہے تو تم پہنچ جاؤں گے تبوک کے چشمہ پر سو تم ہرگز نہ پہنچو گے یہاں تک کہ دن چڑھ جائے گا اگر تم میں سے کوئی اس چشمہ پر پہنچے تو اس کا پانی نہ چھوئے جب تک میں نہ آلوں پھر پہنچے ہم اس چشمہ پر اور ہم سے آگے دو شخص وہاں پہنچ چکے تھے اور چشمہ میں کچھ تھوڑا سا پانی چمک رہا تھا پس پوچھا ان دونوں شخصوں سے رسول اللہ صلی اللہ علیہ وسلم نے کیا چھوا تم نے اس کا پانی بولے ہاں سو خفا ہوئے رسول اللہ صلی اللہ علیہ وسلم ان دونوں پر سخت کہا ان کو اور جو منظور تھا اللہ کو وہ کہا ان سے پھر لوگوں نے چلووں سے تھوڑا تھوڑا پانی چشمہ سے نکال کر ایک برتن میں اکٹھا کیا اور رسول اللہ صلی اللہ علیہ وسلم انے اپنے منہ اور ہاتھ دونوں اس میں دھو کر وہ پانی پھر اس چشمہ میں ڈال دیا پس چشمہ خوب بھر کر بہنے لگا سو پیا لوگوں نے پانی اور پلایا جانوروں کو بعد اس کے فرمایا رسول اللہ صلی اللہ علیہ وسلم نے قریب ہے اے معاذ اگر زندگی تیری زیادہ ہو تو دیکھے گا تو یہ پانی بھر دے گا باغوں کو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 328,
			"arabicnumber": 328,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر نے کہا رسول اللہ صلی اللہ علیہ وسلم کو جب جلدی چلنا سفر میں منظور ہوتا تو جمع کر لیتے مغرب اور عشاء کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 329,
			"arabicnumber": 329,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ پڑھیں ہمارے ساتھ رسول اللہ صلی اللہ علیہ وسلم نے ظہر اور عصر ایک ساتھ اور مغرب اور عشاء ایک ساتھ بغیر خوف اور بغیر سفر کے امام مالک نے کہا میرے نزدیک شاید یہ واقعہ بارش کے وقت ہوگا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 330,
			"arabicnumber": 330,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر جمع کر لیتے حاکموں کے ساتھ مغرب اور عشاء بارش کے وقت میں۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 331,
			"arabicnumber": 331,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 332,
			"arabicnumber": 332,
			"text": "ابن شہاب نے پوچھا سالم بن عبداللہ بن عمر سے کیا سفر میں ظہر اور عصر جمع کی جائیں بولے کچھ حرج نہیں ہے کیا تم نے عرفات میں نہیں دیکھا ظہر اور عصر کو جمع کر تے ہیں ۔ امام زین العابدین سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب دن کو چلنا چاہتے ظہر اور عصر کو جمع کر لیتے اور جب رات کو چلنا چاہتے مغرب اور عشاء کو جمع کر لیتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 333,
			"arabicnumber": 333,
			"text": "امیہ بن عبداللہ نے پوچھا عبداللہ بن عمر سے کہ ہم پاتے ہیں خوف کی نماز اور حضرت کی نماز کو قرآن میں اور نہیں پاتے ہیں ہم سفر کی نماز کو قرآن میں عبداللہ بن عمر نے جواب دیا کہ اے بھیتجے میرے اللہ جل جلالہ نے بھیجا ہمارے طرف حضرت محمد صلی اللہ علیہ وسلم کو اس وقت میں کہ ہم کچھ نہ جانتے تھے پس کرتے ہیں ہم جس طرح ہم نے دیکھا حضرت محمد صلی اللہ علیہ وسلم کو کرتے ہوئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 334,
			"arabicnumber": 334,
			"text": "حضرت ام المومنیں حضرت عائشہ رضی اللہ تعالیٰ عنہا روایت ہے کہ کہا انہوں نے نماز دو دو رکعتیں فرض ہوئیں تھیں حضر میں اور سفر میں بعد اس کے سفر میں نماز اپنے حال پر رہی اور حضر کی نماز بڑھا دی گئی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 335,
			"arabicnumber": 335,
			"text": "یحیی بن سعید نے کہا سالم بن عبداللہ سے کہ تم نے اپنے باپ کو کہاں تک دیر کرتے دیکھا مغرب کی نماز میں سفر میں سالم نے کہا آفتاب ڈوب گیا تھا اور ہم اس وقت ذات الجیش میں تھے پھر نماز پڑھی مغرب کی عقیق میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 336,
			"arabicnumber": 336,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر جب مدینہ سے نکلتے مکہ کو حج یا عمرہ کے لئے تو قصر کر تے نماز کو ذوالحلیفہ سے",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 337,
			"arabicnumber": 337,
			"text": "سالم بن عبداللہ سے روایت ہے کہ ان کے باپ عبداللہ بن عمر مدینہ سے سوار ہوئے ریم کو جانے کے لئے تو قصر کیا نماز کو راہ میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 338,
			"arabicnumber": 338,
			"text": "سالم بن عبداللہ سے روایت ہے کہ عبداللہ بن عمر سوار ہوئے مدینہ سے ذات النصب کو تو قصر کیا نماز کو راہ میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 339,
			"arabicnumber": 339,
			"text": "عبداللہ بن عمر سفر کرتے تھے مدینہ سے خیبر کا تو قصر کرتے تھے نماز کو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 340,
			"arabicnumber": 340,
			"text": "سالم بن عبداللہ سے روایت ہے کہ عبداللہ بن عمر قصر کرتے تھے نماز کو پورے ایک دن کی مسافت میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 341,
			"arabicnumber": 341,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 342,
			"arabicnumber": 342,
			"text": "نافع سفر کرتے تھے عبداللہ بن عمر کے ساتھ ایک برید کا تو نہیں قصر کرتے تھے نماز کا ۔ امام مالک کو پہنچا کہ عبداللہ بن عباس قصر کرتے تھے نماز کو اس قدر مسافرت میں جتنی مکہ اور طائف کے بیچ میں ہے اور جتنی مکہ اور عسفان کے بیچ میں ہے اور جتنی مکہ اور جدہ کے بیچ میں ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 343,
			"arabicnumber": 343,
			"text": "سالم بن عبداللہ سے روایت ہے کہ عبداللہ بن عرم کہتے تھے میں نماز قصر کیا کرتا ہوں جب تک نیت نہیں کرتا اقامت کی اگرچہ بارہ راتوں تک پڑا رہوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 344,
			"arabicnumber": 344,
			"text": "نافع سے روایت ہے کہ ابن عمر مکہ میں دس رات تک ٹھہرے رہے اور نماز کا قصر کرتے رہے مگر جب امام کے ساتھ پڑھتے تو پوری پڑھ لیتے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 345,
			"arabicnumber": 345,
			"text": "سعید بن مسیب کہتے تھے جو شخص نیت کرے چار رات کے رہنے کی تو وہ پورا پڑھے نماز کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 346,
			"arabicnumber": 346,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ عمر بن خطاب جب مدینہ سے مکہ آئے تو جماعت کے ساتھ دو رکعتیں پڑھا کر سلام پھیر دیتے پھر کہتے اے مکہ والو تم اپنی نماز پوری پڑھو کیونکہ میں مسافر ہوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 347,
			"arabicnumber": 347,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 348,
			"arabicnumber": 348,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر امام کے پیچھے منی میں چار رکعتیں پڑھتے تھے اور جب اکیلے پڑھتے تھے تو دو رکعتیں پڑھتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 349,
			"arabicnumber": 349,
			"text": "صفوان بن عبداللہ سے روایت ہے کہ عبداللہ بن عمر عیادت کرنے آئے عبداللہ بن صفوان کے پاس تو دو رکعتیں پڑھائیں پھر جب انہوں نے سلام پھیرا ہم اٹھے اور پورا کیا نماز کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 350,
			"arabicnumber": 350,
			"text": "عبداللہ بن عمر سفر میں فرض کے ساتھ نفل نہیں پڑھتے تھے نہ آگے فرض کے نہ بعد فرض کے مگر رات کو زمین پر اتر کے اور کبھی اونٹ ہی پر نفل پڑھتے تھے اگرچہ منہ اونٹ کا قبلہ کی طرف نہ ہوتا ۔ امام مالک کو پہنچا کہ قاسم بن محمد اور عروہ بن زبیر اور ابوبکر بن عبدالرحمن نفل پڑھا کر تے تھے سفر میں ۔ نافع سے روایت ہے کہ عبداللہ بن عمر اپنے بیٹے عبیداللہ کو سفر میں نفل پڑھتے ہوئے دیکھتے تھے پھر کچھ انکار نہ کر تے تھے ان پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 351,
			"arabicnumber": 351,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 352,
			"arabicnumber": 352,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 353,
			"arabicnumber": 353,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ میں نے دیکھا رسول اللہ صلی اللہ علیہ وسلم کو نماز پڑھتے ہوئے گدھے پر اور رخ آپ صلی اللہ علیہ وسلم کا خیبر کی جانب تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 354,
			"arabicnumber": 354,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نماز پڑھتے تھے اونٹ پر سفر میں جس طرف اونٹ کا منہ ہوتا تھا اسی طرف اپنا منہ کرتے تھے عبداللہ بن دینار نے کہا کہ عبداللہ بن عمر بھی ایسا ہی کرتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 355,
			"arabicnumber": 355,
			"text": "یحیی بن سعید سے روایت ہے کہ میں نے دیکھا حضرت انس کو نماز پڑھتے تھے سفر میں گدھے پر اور منہ ان کا قبلہ کی طرف نہ تھا رکوع اور سجدہ اشارہ سے کر لیتے تھے بغیر اس امر کے کہ منہ اپنا کسی چیز پر رکھیں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 356,
			"arabicnumber": 356,
			"text": "ام ہانی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جس سال مکہ فتح ہوا آٹھ رکعتیں چاشت کی پڑھیں ایک کپڑا اوڑھ کر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 357,
			"arabicnumber": 357,
			"text": "ام ہانی سے روایت ہے کہ میں گئی رسول اللہ صلی اللہ علیہ وسلم کے پاس جس سال فتح ہوا مکہ تو پایا میں نے آپ صلی اللہ علیہ وسلم کو غسل کرتے ہوئے فاطمہ بیٹی آپ صلی اللہ علیہ وسلم کی چھپائے ہوئے تھیں آپ صلی اللہ علیہ وسلم کو ایک کپڑے سے کہا ام ہانی نے سلام کیا میں نے آپ صلی اللہ علیہ وسلم کو تو پوچھا آپ صلی اللہ علیہ وسلم نے کون ہے میں نے کہا ام ہانی بیٹی ابوطالب کی تب فرمایا آپ صلی اللہ علیہ وسلم نے خوشی ہو ام ہانی کو پھر جب فارغ ہوئے آپ صلی اللہ علیہ وسلم غسل سے کھڑے ہو کر آٹھ رکعتیں پڑھیں ایک کپڑا پہن کر جب نماز سے فارغ ہوئے تو میں نے کہا یا رسول اللہ صلی اللہ علیہ وسلم میرے بھائی علی کہتے ہیں میں مار ڈالوں گا اس شخص کو جس کو تو نے پناہ دی ہے وہ شخص فلاں بیٹا ہبیرہ کا ہے پس فرمایا رسول اللہ صلی اللہ علیہ وسلم نے ہم نے پناہ دی اس شخص کو جس کو توں نے پناہ دی اے ام ہانی۔ کہا امی ہانی نے اس وقت چاشت کا وقت تھا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 358,
			"arabicnumber": 358,
			"text": "حضرت ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا روایت ہے کہ انہوں نے کہا نہیں دیکھا میں نے رسول اللہ صلی اللہ علیہ وسلم کو نماز چاشت کی پڑھتے ہوئے کبھی بھی مگر میں پڑھتی ہوں اس کو، اور رسول اللہ صلی اللہ علیہ وسلم کا قاعدہ تھا کہ ایک بات کو دوست رکھتے تھے مگر اس کو نہیں کرتے تھے اس خوف سے کہ لوگ بھی اس کو کرنے لگیں اور وہ فرض ہو جائے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 359,
			"arabicnumber": 359,
			"text": "حضرت ام المومنین حضرت عائشہ نماز ضحی کی آٹھ رکعتیں پڑھا کرتیں پھر کہتیں اگر میری ماں اور باپ جی اٹھیں تو بھی میں ان رکعتوں کو نہ چھوڑوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 360,
			"arabicnumber": 360,
			"text": "انس بن مالک سے روایت ہے کہ ان کی نانی ملیکہ نے دعوت کی رسول اللہ صلی اللہ علیہ وسلم کی پس کھایا آپ صلی اللہ علیہ وسلم نے کھانا پھر فرمایا کہ کھڑے ہو تاکہ میں نماز پڑھوں تمہارے واسطے کہا انس نے پس کھڑا ہوا میں ایک بوریا لے کر جو سیاہ ہو گیا تھا بوجہ پرانا ہونے کے تو بھگویا میں نے اس کو پانی سے اور کھڑے ہوئے رسول اللہ صلی اللہ علیہ وسلم اس پر اور صف باندھی میں نے اور یتیم نے پیچھے آپ صلی اللہ علیہ وسلم کے اور بڑھیاں نے پیچھے ہمارے تو پڑھائیں آپ صلی اللہ علیہ وسلم نے دو رکعتیں پھر چلے گئے آپ صلی اللہ علیہ وسلم ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 361,
			"arabicnumber": 361,
			"text": "عبداللہ بن عتبہ سے روایت ہے کہ میں گیا عمر بن خطاب کے پاس گرمی کے وقت تو پایا میں نے ان کو نفل پڑھتے ہوئے پس کھڑا ہونے لگا میں یچھے ان کے سو قریب کر لیا انہوں نے مجھ کو اور کھڑا کیا آپ نے برابر داہنی طرف بعد اس کے جب آیا یرفا تو پیچھے ہٹ گیا میں اور صف باندھی ہم دونوں نے پیچھے حضرت عمر کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 362,
			"arabicnumber": 362,
			"text": "ابو سعید خدری سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب تم میں سے کوئی نماز پڑھتا ہو تو کسی کو اپنے سامنے سے جانے نہ دے اگر کوئی جانا چاہے تو اس کو اشارہ سے منع کرے اگر نہ مانے تو پھر زور سے منع کرے اس لئے کہ وہ شیطان ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 363,
			"arabicnumber": 363,
			"text": "ابو جہیم سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے اگر جانے گزر جانے والا سامنے سے نمازی کے کتنا عذاب ہے اس پر تو چالیس (دن، یا مہنے، یابرس) کھڑا رہے تو بہتر معلوم ہو اس کو گزر جانے سے شک ہے اس روایت میں ابوالنصر کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 364,
			"arabicnumber": 364,
			"text": "عطاء بن یسار سے روایت ہے کہ کعب الاحبار نے کہا جو شخص گزرتا ہے نمازی کے سامنے سے اگر اس کو معلوم ہو عذاب اس فعل کا تو اگر دھنس جائے زمین میں تو اچھا معلوم ہو اس کو سامنے سے گزر جانے سے ۔ امام مالک کو پہنچا کہ تھے عبداللہ بن عمر ناپسند سمجھتے تھے یہ کہ وہ گزرے عورتوں کے آگے سے اور وہ نماز پڑھ رہی ہوں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 365,
			"arabicnumber": 365,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 366,
			"arabicnumber": 366,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر نہیں گزرتے تھے نماز میں کسی کے سامنے سے اور نہ اپنے سامنے سے کسی کو گزرنے دیتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 367,
			"arabicnumber": 367,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ میں گدھی پر سوار ہو کر آیا اور سن میرا قریب بلوغ کے تھا اور رسول اللہ صلی اللہ علیہ وسلم نماز پڑھا رہے تھے منی میں تو گزر گیا میں تھوڑا صف کے سامنے سے پھر اترا میں اور چھوڑ دیا گدھی کو وہ چرتی رہی اور میں صف میں شریک ہو گیا بعد نماز کے کسی نے کچھ برا نہ مانا ۔ امام مالک کو پہنچا سعد بن ابی وقاص صفوں کے سامنے سے گزر جاتے تھے نماز میں ۔ ا امام مالک کو پہنچا حضرت علی رضی اللہ تعالیٰ عنہ سے کہتے تھے نمازی کے سامنے سے کوئی چیز بھی گزر جائے تو نماز اس کی نہیں ٹوٹتی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 368,
			"arabicnumber": 368,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 369,
			"arabicnumber": 369,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 370,
			"arabicnumber": 370,
			"text": "سالم بن عبداللہ سے روایت ہے کہ عبداللہ بن عمر کہتے تھے کہ نمازی کے سامنے سے کوئی چیز بھی گزر جائے مگر اس کی نماز نہیں ٹوٹتی ۔ امام مالک کو پہنچا عبداللہ بن عمر اپنے اونٹ کو سترہ بنا لیتے جب نماز پڑھتے سفر میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 371,
			"arabicnumber": 371,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 372,
			"arabicnumber": 372,
			"text": "ہشام بن عروہ سے روایت ہے کہ ان کے باپ نماز پڑھتے تھے صحرا میں بغیر سترہ کے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 372
			}
		},
		{
			"hadithnumber": 373,
			"arabicnumber": 373,
			"text": "ابو جعفر قاری سے روایت ہے کہ دیکھا میں نے عبداللہ بن عمر کو جب جھکتے تھے سجدہ کرنے کے لئے اور اپنے سجدہ کے مقام سے ہلکا سا کنکریوں کو ہٹا دیتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 374,
			"arabicnumber": 374,
			"text": "یحیی بن سعید سے روایت ہے کہ پہنچا ان کو ابوذر کہتے تھے کنکریوں کا ایک بار ہٹانا درست ہے اور نہ ہٹانا سرخ اونٹوں سے بہتر ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 375,
			"arabicnumber": 375,
			"text": "نافع سے روایت ہے کہ حضرت عمر بن خطاب لوگوں کو صفیں برابر کرنے کا حکم دیتے تھے جب وہ لوگ لوٹ کر خبر دیتے کہ صفیں برابر ہو گئیں اس وقت تکبیر کہتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 376,
			"arabicnumber": 376,
			"text": "مالک بن ابی عامر اصبحی سے روایت ہے کہ تھا میں عثمان بن عفان کے ساتھ اتنے میں تکبیر ہوئی نماز کی اور میں ان سے باتیں کرتا رہا اس لئے کہ میرا کچھ وظیفہ مقرر کریں اور وہ برابر کر رہے تھے کنکریوں کو اپنے جوتوں سے یہاں تک کہ آن پہنچے وہ لوگ جن کو صفیں برابر کرنے کے لئے مقرر کیا تھا اور انہوں نے خبر دی ان کو اس بات کی صفیں برابر ہو گئیں تو کہا مجھ سے کہ شریک ہو جا صف میں پھر تکبیر کہی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 377,
			"arabicnumber": 377,
			"text": "عبدالکریم سے روایت ہے کہ انہوں نے کہا نبوت کی باتوں میں سے یہ بات ہے کہ جب تجھے حیاء نہ ہو تو جو جی چاہے کر اور نماز میں داہنا ہاتھ بائیں ہاتھ پر رکھنا اور روزہ جلدی افطار کرنا اور سحری کھانے میں دیر کرنا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 378,
			"arabicnumber": 378,
			"text": "سہل بن سعد ساعدی سے روایت ہے کہ لوگوں کو حکم کیا جاتا تھا نماز میں داہنا ہاتھ بائیں ہاتھ پر رکھنے کا کہا ابوحازم نے کہا میں سمجھتا ہوں سہل اس حدیث کو مرفوع کہتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 378
			}
		},
		{
			"hadithnumber": 379,
			"arabicnumber": 379,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر قنوت نہیں پڑھتے تھے کسی نماز میں",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 379
			}
		},
		{
			"hadithnumber": 380,
			"arabicnumber": 380,
			"text": "عروہ بن زبیر سے روایت ہے کہ عبداللہ بن ارقم امامت کرتے تھے اپنے لوگوں کی تو ایک دن نماز تیار ہوئی لیکن آپ چلے گئے حاجت کو پھر آئے اور بولے کو سنا میں نے رسول اللہ صلی اللہ علیہ وسلم سے فرماتے تھے جب قصد کرے کوئی تم میں سے پائخانہ کا تو پہلے پائخانہ کر لے پھر نماز پڑھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 380
			}
		},
		{
			"hadithnumber": 381,
			"arabicnumber": 381,
			"text": "حضرت عمر نے فرمایا کہ کوئی تم میں نماز نہ پڑھے جب وہ روکے پیشاب یا پائخانہ کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 381
			}
		},
		{
			"hadithnumber": 382,
			"arabicnumber": 382,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے فرشتے دعا کرتے ہیں کہ اس شخص کے لئے جو بیٹھا رہے اس جگہ میں جہاں وہ نماز پڑھ چکا ہے جب تک اس کو حدث نہ ہو کہتے ہیں اے اللہ بخش دے اس کو رحم کر اس پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 382
			}
		},
		{
			"hadithnumber": 383,
			"arabicnumber": 383,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے نماز ہی میں رہتا ہے وہ شخص جس کو نماز گھر میں جانے سے روکے رہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 383
			}
		},
		{
			"hadithnumber": 384,
			"arabicnumber": 384,
			"text": "ابوبکر بن عبدالرحمن کہتے تھے جو شخص صبح کو یا سہ پہر کو جائے مسجد میں نیک امر سیکھنے کو یا سکھانے کو پھر لوٹ آئے اپنے گھر میں تو گویا جہاد سے غنیمت لے کر لوٹا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 384
			}
		},
		{
			"hadithnumber": 385,
			"arabicnumber": 385,
			"text": "ابوہریرہ کہتے تھے جو شخص تم میں سے نماز پڑھ کر وہیں بیٹھا رہے تو ملائکہ دعا کرتے ہیں اس کے لئے یا اللہ بخش دے اس کو رحم کر اس پر اگر کھڑا ہو گیا اس جگہ سے لیکن بٹیھا رہا مسجد میں نماز کے انتظار میں تو گویا وہ نماز ہی میں ہے جب تک نماز پڑھے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 385
			}
		},
		{
			"hadithnumber": 386,
			"arabicnumber": 386,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے کیا نہ بتاؤں میں تم کو وہ چیزیں جو دور کرتی ہیں گناہوں کو اور بڑھاتی ہیں درجوں کو پورا کرنا وضو کا تکلیف کے وقت اور قدم بہت ہونا مسجد تک اور انتظار کرنا نماز کا بعد ایک نماز کے یہی رباط ہے یہی رباط ہے یہی رباط۔ سعید بن مسیب نے کہا کہتے ہیں مسجد سے بعد اذان کے جو نکل جائے اور پھر آنے کا اردہ نہ ہو تو وہ منافق ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 386
			}
		},
		{
			"hadithnumber": 387,
			"arabicnumber": 387,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 387
			}
		},
		{
			"hadithnumber": 388,
			"arabicnumber": 388,
			"text": "ابو قتادہ انصاری سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب تم میں سے کوئی مسجد میں جائے تو دو رکعتیں پڑھ کر بیٹھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 388
			}
		},
		{
			"hadithnumber": 389,
			"arabicnumber": 389,
			"text": "ابو النضر سے روایت ہے کہ ابوسلمہ بن عبدالرحمن نے کہا مجھ سے میں نہیں دیکھتا تمہارے صاحب یعنی عمر بن عبیداللہ کو تحیةالمسجد پڑھتے ہوئے جب آتے ہیں مسجد کو تو بیٹھ جاتے ہیں بغیر پڑھے ہوئے ابونضر نے کہا کہ ابوسلمہ عیب کرتے تھے اس امر کا عمر بن عبیداللہ پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 389
			}
		},
		{
			"hadithnumber": 390,
			"arabicnumber": 390,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر جب سجدہ کرتے تھے تو جس چیز پر سجدہ کرتے تھے اسی پر ہاتھ رکھتے تھے نافع نے کہا کہ سخت جاڑے کے دن میں نے عبداللہ بن عمر کو دیکھا اپنے ہاتھ نکالتے تھے جبہ سے اور رکھتے تھے ان کر پتھریلی زمین پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 390
			}
		},
		{
			"hadithnumber": 391,
			"arabicnumber": 391,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر کہتے تھے جو شخص پیشانی زمین پر رکھے تو اپنے ہاتھ بھی زمین پر رکھے پھر منہ اٹھائے تو ہاتھ بھی اٹھائے اس لئے کہ ہاتھ بھی سجدہ کرتے ہیں جیسے منہ سجدہ کرتا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 391
			}
		},
		{
			"hadithnumber": 392,
			"arabicnumber": 392,
			"text": "سہل بن سعد سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم گئے بنی عمرو بن عوف کے پاس ان میں صلح کرنے کو اور وقت آگیا نماز کا تو مؤذن ابوبکر صدیق کے پاس آکر بولا اگر تم نماز پڑھاؤ تو میں تکبیر کہوں بولے اچھا پس شروع کی نماز ابوبکر نے اور آگئے رسول اللہ اور لوگ نماز پڑھ رہے تھے سو آپ صلی اللہ علیہ وسلم صفوں کو چیر کر پہلی صف میں آکر کھڑے ہو گئے پس دستک دی لوگوں نے مگر ابوبکر نماز میں کسی طرف دھیان نہیں کرتے تھے یہاں تک کہ لوگوں نے بہت زور سے دستکیں دینا شروع کیں تب دیکھا ابوبکر نے رسول اللہ صلی اللہ علیہ وسلم کو اور ارادہ کیا پیچھے ہٹنے کا پس اشارہ کیا رسول اللہ صلی اللہ علیہ وسلم نے اپنی جگہ پر رہو تو دونوں ہاتھ اٹھا کر ابوبکر نے اللہ کا شکر کیا اس بات پر کہ رسول اللہ صلی اللہ علیہ وسلم نے ان کو امام رہنے کا حکم دیا پھر پیچھے ہٹ آئے ابوبکر اور آگے بڑھ گئے رسول اللہ صلی اللہ علیہ وسلم اور نماز پڑھا کر فارغ ہوئے پھر فرمایا اے ابوبکر تم کیوں اپنی جگہ پر کھڑے نہ رہے جب میں نے تم کو اشارہ کیا تھا ابوبکر نے کہا بھلا ابوقحافہ کے بیٹے کو یہ بات پہنچتی ہے کہ نماز پڑھاۓ رسول اللہ صلی اللہ علیہ وسلم کے ہوتے ہوئے تب فرمایا رسول اللہ صلی اللہ علیہ وسلم نے لوگوں سے تم نے اس قدر دستکیں کیوں بجائیں جس شخص کو نماز میں کچھ حادثہ پیش آئے تو سبحان اللہ کہے لوگ اس طرف دیکھ لیں گے اور دستک دینا عورتوں کے لئے ہے",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 392
			}
		},
		{
			"hadithnumber": 393,
			"arabicnumber": 393,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر نماز میں التفات نہیں کرتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 393
			}
		},
		{
			"hadithnumber": 394,
			"arabicnumber": 394,
			"text": "ابو جعفر قاری سے روایت ہے کہ میں پڑھتا تھا اور عبداللہ بن عمر میرے پیچھے تھے مجھے خبر نہ تھی میں نے ان کو دیکھا تو دباد یا انہوں نے مجھ کو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 394
			}
		},
		{
			"hadithnumber": 395,
			"arabicnumber": 395,
			"text": "ابو امامہ بن سہل سے روایت ہے کہ زید بن ثابت مسجد میں آئے تو امام کو رکوع میں پایا پس رکوع کر لیا پھر آہستہ چل کر صف میں مل گئے ۔ امام مالک کو پہنچا عبداللہ بن مسعود سے کہ وہ رکوع میں آہتسہ چلتے تھے صف میں مل جانے کو۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 395
			}
		},
		{
			"hadithnumber": 396,
			"arabicnumber": 396,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 396
			}
		},
		{
			"hadithnumber": 397,
			"arabicnumber": 397,
			"text": "ابو حمید ساعدی سے روایت ہے کہ صحابہ نے پوچھا آپ صلی اللہ علیہ وسلم سے یا رسول اللہ صلی اللہ علیہ وسلم کیونکر درود بھیجیں آپ صلی اللہ علیہ وسلم پر تو فرمایا آپ صلی اللہ علیہ وسلم نے کہو اے پروردگار رحمت اتار اپنی محمد اور ان کی بیبیوں اور آل پر جیسے رحمت کی تو نے ابراہیم پر اور برکت اتار محمد اور ان کی بیبیوں پر اور آل پر جیسے تو نے برکت اتاری ابراہیم کی اولاد پر بے شک تو تعریف کے لائق اور بڑا ہے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 397
			}
		},
		{
			"hadithnumber": 398,
			"arabicnumber": 398,
			"text": "ابو مسعود انصاری سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم آئے ہمارے پاس سعد بن عبادہ کے مکان میں تو کہا آپ صلی اللہ علیہ وسلم سے بشیر بن سعد نے حکم کیا ہم کو اللہ جل جلالہ نے درود بھیجنے کا آپ صلی اللہ علیہ وسلم پر تو کیوں کر درود بھیجیں آپ صلی اللہ علیہ وسلم پر پس چپ ہو رہے آپ صلی اللہ علیہ وسلم یہاں تک کہ ہم کو تمنا ہوئی کہ کاش نہ پوچھتے آپ صلی اللہ علیہ وسلم سے پھر فرمایا آپ صلی اللہ علیہ وسلم نے کہو اللہم صلی علی محمد وعلی آل محمد کما صلیت علی ابراہیم فی العالمین انک حمید مجید اور سلام بھیجنے کی ترکیب جیسے تم جان چکے ہو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 398
			}
		},
		{
			"hadithnumber": 399,
			"arabicnumber": 399,
			"text": "عبداللہ بن دینار سے روایت ہے کہ میں نے دیکھا عبداللہ بن عمر کو کھڑے ہوتے تھے نبی صلی اللہ علیہ وسلم کی قبر پر درود بھیجتے تھے آپ صلی اللہ علیہ وسلم پر اور ابوبکر اور عمر پر ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 399
			}
		},
		{
			"hadithnumber": 400,
			"arabicnumber": 400,
			"text": "ابن عمر سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم پڑھتے تھے ظہر کی اول دو رکعتیں اور بعد ظہر کے دو رکعتیں اور بعد مغرب کے دو رکعتیں اپنے گھر میں اور بعد عشا کے دو رکعتیں اور نہیں پڑھتے تھے بعد جمعہ کے مسجد میں یہاں تک کہ گھر میں آتے تو دو رکعتیں پرھتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 400
			}
		},
		{
			"hadithnumber": 401,
			"arabicnumber": 401,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے تم دیکھتے ہو میرا منہ قبلہ کی طرف قسم اللہ کی مجھ سے چھپا نہیں ہے خشوع تمہارا نماز میں اور رکوع تمہارا میں دیکھتا ہوں تم کو پیٹھ کے پیچھے سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 401
			}
		},
		{
			"hadithnumber": 402,
			"arabicnumber": 402,
			"text": "عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم آتے تھے قبا میں سوار ہو کر اور پیدل ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 402
			}
		},
		{
			"hadithnumber": 403,
			"arabicnumber": 403,
			"text": "نعمان بن مرہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کیا رائے ہے تمہاری اس شخص میں جو شراب پئے اور چوری کرے اور زنا کرے اور تھا یہ امر قبل اترنے حکم کے ان کے باب میں تو کہا صحابہ نے اللہ اور اس کا رسول خوب جانتا ہے فرمایا آپ صلی اللہ علیہ وسلم نے یہ برے کام ہیں ان میں سزا ضرور ہے اور سب چوریوں میں بری نماز کی چوری ہے پوچھا صحابہ نے نماز کا چور کیونکر ہے فرمایا آپ صلی اللہ علیہ وسلم نے نماز کا چور وہ ہے جو رکوع اور سجدہ کو پورا نہ کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 403
			}
		},
		{
			"hadithnumber": 404,
			"arabicnumber": 404,
			"text": "عروہ بن زبیر سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کچھ ایک حصہ اپنی نماز میں سے اپنے گھروں میں ادا کرو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 404
			}
		},
		{
			"hadithnumber": 405,
			"arabicnumber": 405,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر کہتے تھے بیمار کو اگر سجدہ کرنے کی طاقت نہ ہو تو سر سے اشارہ کرے لیکن کوئی چیز اپنی پیشانی کے سامنے اونچی نہ رکھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 405
			}
		},
		{
			"hadithnumber": 406,
			"arabicnumber": 406,
			"text": "ربیعہ بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ عبداللہ بن عمر جب آتے مسجد میں اور معلوم ہوتا کہ جماعت ہو چکی ہے تو فرض شروع کرتے اور سنتیں نہ پڑھتے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 406
			}
		},
		{
			"hadithnumber": 407,
			"arabicnumber": 407,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر گزرے ایک شخص پر اور وہ نماز پڑھ رہے تھے تو سلام کیا اس کو اس نے جواب دیا زبان سے پھر لوٹے عبداللہ بن عمر اور کہا اس سے جب کوئی سلام کرے تم پر تم نماز پڑھتے ہو تو زبان سے جواب نہ دو بلکہ ہاتھ سے اشارہ کر دو ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 407
			}
		},
		{
			"hadithnumber": 408,
			"arabicnumber": 408,
			"text": "نافع سے روایت ہے کہ عبداللہ بن عمر کہتے تھے جو شخص بھول جائے نماز کو پھر یاد کرے اور وہ دوسری نماز میں امام کے پیچھے ہو تو جب امام سلام پھیرے تو چاہئے کہ اس نماز کو پڑھ کر جو نماز امام کے ساتھ پڑھی ہے اس کا اعادہ کرے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 408
			}
		},
		{
			"hadithnumber": 409,
			"arabicnumber": 409,
			"text": "واسع بن حبان سے روایت ہے کہ میں نماز پڑھ رہا تھا اور عبداللہ بن عمر قبلہ کی طرف پیٹھ کئے ہوئے بیٹھے تھے تو جب نماز سے فارغ ہوا بائیں طرف سے مڑ کر ان کے پاس گیا تو عبداللہ بن عمر نے کہا تو داہنی طرف سے مڑ کر کیوں نہ آیا میں نے کہا کہ آپ کو دیکھ کر بائیں طرف سے مڑ کر چلا آیا عبداللہ نے کہا تو نے اچھا کیا ایک صاحب کہتے ہیں کہ جب نماز پڑھ چکے تو داہنی طرف سے مڑ مگر تو جب نماز پڑھے تو جدھر سے چاہے مڑ کر جا داہنی طرف سے یا بائیں طرف سے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 409
			}
		},
		{
			"hadithnumber": 410,
			"arabicnumber": 410,
			"text": "عبداللہ بن عمر بن العاص سے ایک شخص نے پوچھا کیا نماز پڑھوں میں اونٹوں کے بیٹھنے کی جگہ میں نے کہا نہیں لیکن پڑھ لے بکری کے تھانوں میں ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 410
			}
		},
		{
			"hadithnumber": 411,
			"arabicnumber": 411,
			"text": "سعید بن مسیب نے کہا کہ وہ کون سی نماز ہے جس میں ہر رکعت کے بعد بیٹھنا پڑے پھر خود ہی کہا وہ نماز مغرب کی ہے جب ایک رکعت فوت ہو جائے امام کے ساتھ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 411
			}
		},
		{
			"hadithnumber": 412,
			"arabicnumber": 412,
			"text": "ابو قتادہ انصاری سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نماز پڑھتے تھے اپنی نواسی امامہ کو جو بیٹی زینب کی تھیں ابوالعاص سے اٹھاے ہوئے تو جب سجدہ کرتے آپ صلی اللہ علیہ وسلم بٹھا دیتے ان کو زمین پر جب کھڑے ہوتے اٹھا لیتے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 412
			}
		},
		{
			"hadithnumber": 413,
			"arabicnumber": 413,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے آتے جاتے رہتے ہیں فرشتے تمہارے پاس رات کے جدا ہونے کے وقت اور دن کے جدا ہونے کے وقت اور جمع ہوجاتے ہیں سب عصر کی اور فجر کی نماز میں پھر وہ فرشتے جو رات کو تمہارے ساتھ رہتے ہیں چڑھ جاتے ہیں اور پس پوچھتا ہے ان سے پروردگار ( حالانکہ وہ خوب جانتا ہے) کس حال میں چھوڑا تم نے میرے بندوں کو؟ کہتے ہیں ہم نے چھوڑا ان کو نماز میں، جب ہم گئے تھے جب بھی نماز پڑھتے تھے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 413
			}
		},
		{
			"hadithnumber": 414,
			"arabicnumber": 414,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم کیا مرض موت میں ابوبکر کو نماز پڑھانے کا تو کہا میں نے یا رسول اللہ صلی اللہ علیہ وسلم ابوبکر جب آپ صلی اللہ علیہ وسلم کی جگہ پر کھڑے ہوں گے تو روتے روتے ان کی آواز نہ نکلے گی تو حکم کیجئے عمر کو نماز پڑھانے کا میں نے حفصہ سے کہا تم کہو آپ صلی اللہ علیہ وسلم سے ابوبکر جب آپ صلی اللہ علیہ وسلم کی جگہ میں کھڑے ہوں گے تو روتے روتے ان کی آواز نہ نکلے گی پس حکم کیجئے عمر کو نماز پڑھانے کا سو کہا حضرت نے تب فرمایا رسول اللہ صلی اللہ علیہ وسلم نے تم یوسف کی ساتھی عورتوں کی طرح ہو کہو ابوبکر سے نماز پڑھانے کو پس کہا حفصہ نے عائشہ سے تم سے مجھے بھلائی نہ ہوئی ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 414
			}
		},
		{
			"hadithnumber": 415,
			"arabicnumber": 415,
			"text": "عبیداللہ بن عدی سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم بیٹھے ہوئے تھے لوگوں میں، اتنے میں ایک شخص آیا اور کان میں کچھ بات آپ صلی اللہ علیہ وسلم کے کہنے لگا ہم کو خبر نہیں ہوئی کیا کہتا ہے یہاں تک کہ آپ صلی اللہ علیہ وسلم پکار کر بول اٹھے تب معلوم ہوا وہ شخص حضرت سے ایک منافق کے قتل کی اجازت چاہتا تھا تو جب پکار اٹھے رسول اللہ صلی اللہ علیہ وسلم تو فرمایا کیا وہ شخص گواہی نہیں دیتا اس امر کی کہ کوئی معبود حق نہیں ہے سوا اللہ کے اور محمد صلی اللہ علیہ وسلم بے شک اس کے رسول ہیں اس شخص نے کہا ہاں مگر اس کی گواہی کا کچھ اعتبار نہیں تب فرمایا آپ صلی اللہ علیہ وسلم نے کیا وہ نماز نہیں پڑھتا بولا ہاں پڑھتا ہے لیکن اس کی نماز کا کچھ اعتبار نہیں ہے فرمایا رسول اللہ صلی اللہ علیہ وسلم نے ایسے لوگوں کے قتل سے منع کیا ہے مجھ کو اللہ نے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 415
			}
		},
		{
			"hadithnumber": 416,
			"arabicnumber": 416,
			"text": "عطاء بن یسار سے روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے اے پروردگار مت بنا قبر میری کو بت، کہ لوگ اس کو پوجیں بہت بڑا غضب اللہ کا ان لوگوں پر ہے جہنوں نے اپنے پیغمبروں کی قبروں کو مسجد بنا لیا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 416
			}
		},
		{
			"hadithnumber": 417,
			"arabicnumber": 417,
			"text": "محمود بن لبید انصاری سے روایت ہے کہ عتبان بن مالک امامت کرتے تھے اپنی قوم کی اور ان کی بینائی میں ضعف تھا کہا انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے کبھی اندھیرا یا پانی یا بہاؤ ہوتا ہے اور میری بینائی میں فرق ہے تو آپ صلی اللہ علیہ وسلم میرے گھر میں کسی مقام پر نماز پڑھ دیجئے تاکہ میں اس جگہ کو اپنا مصلی بناؤں پس رسول اللہ صلی اللہ علیہ وسلم تشریف لائے اور کہا کس جگہ تم میری نماز پڑھنا پسند کرتے ہو انہوں نے ایک جگہ بتادی آپ صلی اللہ علیہ وسلم نے وہاں نماز پڑھ دی۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 417
			}
		},
		{
			"hadithnumber": 418,
			"arabicnumber": 418,
			"text": "عبداللہ بن زید رضی اللہ تعالیٰ عنہ سے روایت ہے کہ میں نے دیکھا رسول اللہ صلی اللہ علیہ وسلم کو چپ لیٹے ہوئے تھے مسجد میں ایک پاؤں آپ صلی اللہ علیہ وسلم کا دوسرے پاؤں پر تھا سعید بن مسیب سے روایت ہے کہ عمر بن خطاب اور عثمان بن عفان ایسا کیا کرتے تھے",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 418
			}
		},
		{
			"hadithnumber": 419,
			"arabicnumber": 419,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 419
			}
		},
		{
			"hadithnumber": 420,
			"arabicnumber": 420,
			"text": "یحیی بن سعید سے روایت ہے کہ عبداللہ بن مسعود نے کہا ایک شخص سے تم ایسے زمانے میں ہو کہ عالم اس میں بہت ہیں صرف لفظ پڑھنے والے کم ہیں عمل زیادہ کیا جاتا ہے قرآن کے حکموں پر اور لفظوں کا ایساخیال نہیں کیا جاتا پوچھنے والے کم ہیں جواب دینے والے بہت ہیں یا بھیک مانگنے والے کم ہیں اور دینے والے بہت ہیں لمبا کرتے ہیں نماز کو اور چھوٹا کرتے ہیں خطبہ کو نیک عمل پہلے کرتے ہیں اور نفس کی خواہش کو مقدم نہیں کرتے اور قریب ہے کہ ایک زمانہ ایسا آئے گا کہ کم ہوں گے عالم اس وقت میں الفاظ پڑھنے والے بہت ہوں گے یاد کئے جائیں گے الفاظ قرآن کے اور اس کے حکموں پر عمل نہ کیا جائے گا پوچھنے والے اور مانگنے والے بہت ہوں گے اور جواب دینے والے اور دینے والے بہت کم ہوں گے لمبا کریں گے خطبہ کو اور چھوٹا کریں گے نماز کو اپنی خواہش نفس پر چلیں گے اور عمل نیک نہ کریں گے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 420
			}
		},
		{
			"hadithnumber": 421,
			"arabicnumber": 421,
			"text": "یحیی بن سعید سے روایت ہے کہ پہنچی ان کو حدیث کہ قیامت کے دن پہلے نماز دیکھی جائے گی اگر نماز قبول ہوگئی تو پھر اور عمل اس کے دیکھے جائیں گے ورنہ کوئی عمل پھر نہ دیکھا جائے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 421
			}
		},
		{
			"hadithnumber": 422,
			"arabicnumber": 422,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 422
			}
		},
		{
			"hadithnumber": 423,
			"arabicnumber": 423,
			"text": "حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کو وہ کام بہت پسند تھا جو ہمیشہ آدمی اس کو کرتا رہے ۔ سعد بن ابی وقاص سے روایت ہے کہ دو بھائی تھے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ان میں سے ایک دوسرے سے چالیس دن پہلے مر گیا تو لوگوں نے تعریف کی اس کی جو پہلے مرا تھا تب فرمایا رسول اللہ صلی اللہ علیہ وسلم نے کیا دوسرا بھائی مسلمان نہ تھا بولے ہاں مسلمان تھا وہ بھی کچھ برا نہ تھا تب فرمایا آپ صلی اللہ علیہ وسلم نے تم کیا جانو دوسرے کی نماز نے اس کو کس درجہ پر پہنچایا نماز کی مثال ایسی ہے کہ جیسے ایک نہر میٹھے پانی کی بہت گہری کسی نے دروازے پر بہتی ہو اور وہ اس میں پانچ وقت غوطہ لگایا کرے کیا اس کے بدن پر کچھ میل رہے گی پھر تم کیا جانو کہ نماز نے دوسرے بھائی کے مرتبہ کس درجہ کر پہنچایا ۔ امام مالک کو پہنچا کہ عطاء بن یسار جب دیکھتے کسی شخص کو جو سودا بیچتا ہے مسجد میں پھر بلاتے اس کو پھر پوچھتے اس سے کیا ہے تیرے پاس اور تو کیا چاہتا ہے اگر وہ بولتا کہ میں بیچنا چاہتا ہوں تو کہتے جاؤ دنیا کے بازار میں یہ تو آخرت کا بازار ہے ۔ امام مالک کو پہنچا کہ حضرت عمر نے ایک جگہ بنا دی مسجد کے کونے میں اس کا نام بطیحا تھا اور کہہ دیا تھا کہ جو کوئی بک بک کرنا چاہے یا اشعار پڑھنا چاہے یا پکارنا چاہے تو اس جگہ کو چلا جائے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 423
			}
		},
		{
			"hadithnumber": 424,
			"arabicnumber": 424,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 424
			}
		},
		{
			"hadithnumber": 425,
			"arabicnumber": 425,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 425
			}
		},
		{
			"hadithnumber": 426,
			"arabicnumber": 426,
			"text": "طلحہ بن عبیداللہ سے روایت ہے کہ وہ کہتے تھے کہ آیا ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس نجد کا رہنے والا اس کے سر کے بال بکھرے ہوئے تھے اور اس کی آواز کی بھنبھناہٹ سنائی دیتی تھی لیکن اس کی بات سمجھ میں نہ آتی تھی یہاں تک کہ قریب آیا تو وہ پوچھتا تھا رسول اللہ صلی اللہ علیہ وسلم سے اسلام کے معنی فرمایا آپ صلی اللہ علیہ وسلم نے پانچ نمازیں پڑھنا رات دن میں تب وہ شخص بولا سوا ان کے اور بھی کوئی نماز مجھ پر ہے آپ صلی اللہ علیہ وسلم نے فرمایا نہیں مگر نفل پڑھنا چاہے تو تو پڑھ فرمایا آپ صلی اللہ علیہ وسلم نے اور روزے رمضان کے بولا سوا ان کے اور بھی کوئی روزہ مجھ پر ہے فرمایا آپ صلی اللہ علیہ وسلم نے نہیں مگر نفل رکھے تو پھر ذکر کیا آپ صلی اللہ علیہ وسلم نے زکوة کا وہ شخص بولا اس کے سوا بھی کچھ صدقہ مجھ پر فرض ہے فرمایا نہیں مگر اگر اللہ چاہے تو دے پس پیٹھ موڑ کر چلا وہ شخص تب فرمایا رسول اللہ صلی اللہ علیہ وسلم نے بیڑا اس کا پار ہوا اگر سچ بولا ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 426
			}
		},
		{
			"hadithnumber": 427,
			"arabicnumber": 427,
			"text": "ابوہریرہ رضی اللہ تعالیٰ عنہ روایت ہے کہ فرمایا رسول اللہ صلی اللہ علیہ وسلم نے جب آدمی سو جاتا ہے تو باندھتا ہے شیطان اس کی گدی پر تین گرہیں ہر گرہ مار کر کہتا جاتا ہے کہ ابھی تجھ کو بڑی رات باقی ہے تو سو رہ پھر اگر جاگتا ہے آدمی اور یاد کرتا ہے اللہ جل جلالہ کو کھل جاتی ہے ایک گرہ اگر وضو کرتا ہے کھل جاتی ہے دوسری گرہ پھر اگر نماز پڑھتا ہے صبح کی کھل جاتی ہے تیسری گرہ پس رہتا ہے وہ شخص اس دن خوش دل اور خوش مزاج ورنہ رہتا ہے بدنفس مجہول ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 427
			}
		}
	]
}