{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"30": "Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1284,
			"arabicnumber": 1284,
			"text": "ابن شہاب سے سوال ہوا کہ بڑھ پن میں کوئی آدمی عورت کو دودھ پئے تو اس کا کیا حکم ہے انہوں نے کہا مجھ سے عروہ بن زبیر نے بیان کیا کہ خذیفہ بن عتبہ بن ریبعہ جو رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں سے تھے اور جنگ بدر میں آپ صلی اللہ علیہ وسلم کے ساتھ تھے انہوں نے بیٹا بنایا تھا سالم کو تو سالم مولیٰ کہتے تھے انہوں بی خذیفہ کے جیسے زید کو بیٹا کیا تھا رسول اللہ صلی اللہ علیہ وسلم نے اور ابوخذیفہ نے سالم کا نکاح اپنی بھتجی فاطمہ بنت ولد سے کر دیا تھا جو پہلے ہجرت کرنے والوں میں تھی اور تمام قریش کی ثیبہ عورتوں میں افضل تھی جب اللہ جل جلالہ نے اپنی کتاب میں اتارا زید بن حارثہ کے حق میں کہ ان کو کے باپو کا نام معلوم نہ ہوتا اپنے مالک کی طرف نسبت کئے جانے تو سہلہ بنت سہیل ابوحذیفہ کی جورو جو بنی عامر بن لوی کی اولاد میں سے تھی رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی اور کہا یا رسول اللہ صلی اللہ علیہ وسلم ہم تو حضرت سالم رضی اللہ تعالیٰ عنہ کو اپنا بچہ سمجھتے تھے ہم ننگے کھلے ہوتے تھے وہ اندر چلا آتا تھا اب کیا کرنا چاہئیے دوسرا گھر بھی ہمارے پاس نہیں ہے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اس کو پانچ بار دودھ پلادے تو وہ تیرا محرم ہوجائے گا ۔ پھر حضرت ابوحذیفہ رضی اللہ تعالیٰ عنہ کی بیوی نے ایسا ہی کیا اور سالم کو اپنا رضائی بیٹا سمجھنے لگی حضرت ام المومنین عائشہ رضی اللہ تعالیٰ عنہا اسی حدیث پر عمل کرتیں تھی اور جس مرد کو چاہتیں کہ اپنے پاس آیا جایا کرے تو اپنی بہن ام کلثوم کو حکم کرتیں اور اپنی بھتیجیوں کو کہ اس شخص کو اپنا دودھ پلادیں لیکن رسول اللہ صلی اللہ علیہ وسلم کی اور بیبیاں اس کا انکار کرتی تھیں کہ بڑے پن میں کوئی دودھ پی کر ان کا محرم بن جائے اور ان کے پاس آیا جایا کرے اور وہ یہ کہتی تھیں کہ یہ خاص رخصت تھی رسول اللہ صلی اللہ علیہ وسلم کی طرف سے حضرت سہلہ بنت سہیل رضی اللہ تعالیٰ عنہا کو قسم اللہ کی ایس رضاعت کی وجہ سے ہمارا کوئی محرم نہیں ہوسکتا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 30,
				"hadith": 1284
			}
		}
	]
}