{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "سالم بن عبداللہ سے روایت ہے کہ عبداللہ بن عمر نے ایک غلام بیچا آٹھ سو درہم کو اور مشتری (خریدنے والا) سے شرط کرلی کہ عیب کی جواب دہی سے میں بری ہوا بعد اس کے مشتری (خریدنے والا) نے کہا غلام کو ایک بیماری ہے تم نے مجھ سے اس کا بیان نہیں کیا تھا پھر دونوں میں جھگڑا ہوا اور گئے عثمان بن عفان کے پاس مشتری (خریدنے والا) بولا کہ انہوں نے ایک غلام میرے ہاتھ بیچا اور اس کو ایک بیماری تھی انہوں نے بیان نہیں کیا عبداللہ بن عمر نے کہا کہ میں نے شرط کرلی تھی عیب کی جواب دہی میں نہ کروں گا حضرت عثمان نے حکم کیا کہ عبداللہ بن عمر حلف کریں میں نے یہ غلام بیچا اور میرے علم میں اس کو کوئی بیماری نہ تھی عبداللہ نے قسم کھالے سے انکار کیا تو وہ غلام پھر آیا عبداللہ پاس اور اس بیماری سے اچھا ہو گیا پھر عبداللہ نے اس کو ایک ہزار پانچ سو درہم کا بیچا ۔ کہا مالک نے ہمارے نزدیک یہ مسئلہ اتفاقی ہے کہ جو شخص خریدے ایک لونڈی کو پھر وہ حاملہ ہو جائے خریدار سے یا غلام خرید لے پھر اس کو آزاد کر دے یا کوئی اور امر ایسا کرے جس کے سبب سے اس غلام یا لونڈی کا پھیرنا نہ ہو سکے بعد اس کے گواہ گواہی دیں کہ اس غلام یا لونڈی میں بائع (بچنے والا) کے پاس سے کوئی عیب تھا یا بائع (بچنے والا) خود اقرار کر لے کہ میرے پاس یہ عیب تھا یا اور کسی صورت سے معلوم ہو جائے کہ عیب بائع (بچنے والا) کے پاس ہی تھا تو اس غلام اور لونڈی کی خرید کے روز کے عیب سمیت قیمت لگا کر بے عیب کی بھی قیمت لگا دیں دونوں قیمتوں میں جس قدر فرق ہو اس قدرت مشتری (خریدنے والا) بائع (بچنے والا) سے پھیر لے۔ کہا مالک نے اگر کسی شخص نے ایک غلام خریدا پھر اس میں ایسا عیب پایا جس کی وجہ سے وہ غلام بائع (بچنے والا) کو بھیر سکتا ہے مگر مشتری (خریدنے والا) کے پاس جب وہ غلام آیا اس میں دوسرا عیب ہو گیا مثلا اس کا کوئی عضو کٹ گیا یا کانا ہو گیا تو مشتری (خریدنے والا) کو اختیار ہے چاہے اس غلام کو رکھ لے اور بائع (بچنے والا) سے عیب کا نقصان لے لے چاہے غلام کو واپس کر دے اور عیب کا تاوان دے اگر وہ غلام مشتری (خریدنے والا) کے پاس مر گیا تو عیب سمیت قیمت لگا دیں گے خرید کے روز کی مثلا جس دن خریدا تھا اس روز عیب سمیت اس غلام کی قیمت اسی دینار تھی اور بے عیب سو دینار تو مشتری (خریدنے والا) بیس دینار بائع (بچنے والا) سے مجرا لے گا مگر قیمت اس کی لفائی جائے گی جس دن خریدا تھا۔ کہا مالک نے ہمارے نزدیک یہ حکم اتفاقی ہے کہ اگر ایک شخص نے لونڈی خریدی پھر عیب کی وجہ سے اسے واپس کر دیا مگر اس سے جماع کر چکا تھا تو اگر وہ لونڈی باکرہ تھی تو جس قدر اس کی قیمت میں نقصان ہو گیا مشتری (خریدنے والا) کو دینا ہوگا اور اگر ثییبہ تھی تو مشتری (خریدنے والا) کو کچھ دینا نہ ہو گا۔ کہا مالک نے ہمارے نزدیک اس پر اجماع ہے کہ اگر کوئی شخص غلام یا لونڈی یا اور کوئی جانور بیچے یہ شرط لگا کر کہ اگر کوئی عیب نکلے گا تو میں بری ہوں یا بائع (بچنے والا) عیب کی جواب دہی سے بری ہو جائے گا مگر جب جان بوجھ کر کوئی عیب اس میں ہو اور وہ اس کو چھپائے اگر ایسا کرے گا تو یہ شرط مفید نہ ہوگی اور وہ چیز بائع (بچنے والا) کو واپس کی جائے گی۔ کہا مالک نے اگر ایک لونڈی کو دو لونڈیوں کے بدلے میں بیچا پھر ان دو لونڈیوں میں سے ایک لونڈی میں کچھ عیب نکل جس کی وجہ سے وہ پھر سکتی ہے تو پہلے اس لونڈی کی قیمت لگائی جائے گی جس کے بدلے میں یہ دونوں لونڈیاں آئی ہیں پھر ان دونوں لونڈیوں کی بے عیب سمجھ کر قیمت لگا دیں گے پھر اس لونڈی کے زر ثمن کو ان دونوں لونڈیوں کی قیمت پر تقسیم کریں گے ہر ایک کا حصہ جدا ہوگا بے عیب لونڈی کا اس کے موافق اور عیب دار کا اس کے موافق پھر عیب دار لونڈی اس حصہ ثمن کے بدلے میں واپس کی جائے گی قلیل ہو یا کثیر مگر قیمت دو لونڈیوں کی اسی روز کی نگائی جائے گی جس دن وہ لونڈیاں مشتری (خریدنے والا) کے قبضے میں آئی ہیں ۔ کہا مالک نے اگر ایک شخص نے ایک غلام خریدا اور اس سے مزدوری کرائی اور مزدوری کے دام حاصل کئے قلیل ہوں یا کثیر بعد اس کے اس غلام میں عیب نکلا جس کی وجہ سے وہ غلام پھیر سکتا ہے تو وہ اس غلام کو پھیر دے اور مزدوری کے پیسے رکھ لے اس کا واپس کرنا ضروری نہیں ہمارے نزدیک جماعت علماء کا یہی مذہب ہے اس کی نظیر یہ ہے کہ اگر ایک شخص نے ایک غلام خریدا اور اس کے ہاتھ سے ایک گھر بنوایا جس کی بنوائی اس کی قیمت سے دوچند سہ چند ہے پھر عیب کی وجہ سے اسے واپس کر دیا تو غلام واپس ہو جائے گا اور بائع (بچنے والا) کو یہ اختیار نہ ہوگا کہ مشتری (خریدنے والا) سے گھر بنوانے کی مزدوری لے اسی طرح سے غلام کی کمائی بھی مشتری (خریدنے والا) کی رہے گی۔ کہا ملک نے اگر ایک شخص نے کئی غلام ایک ہی دفعہ (یعنی ایک ہی عقد میں) خریدے اب ان میں سے ایک غلام چوری کا نکلا یا اس میں کچھ عیب نکلا تو اگر وہی غلام سب غلاموں میں عمدہ اور ممتاز ہوگا اور اسی کی وجہ سے باقی غلام خریدے گئے ہوں تو ساری بیع فسخ ہو جائے گی اور سب غلام پھر واپس دیئے جائیں گے ۔ اگر ایسا نہ ہو تو صرف اس غلام کو پھیر دے گا اور زر ثمن میں سے بقدر اس کی قیمت کے حصہ لگا کر بائع (بچنے والا) سے واپس لے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1293
			}
		}
	]
}