{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "قاسم بن محمد سے روایت ہے کہ عبداللہ بن عباس سے ایک شخص نے پوچھا جو کوئی کپڑوں میں سلف کرے پھر قبل قبضے کے ان کو بیچنا چاہے ابن عباس نے کہا یہ چاندی کی بیع ہے چاندی کے بدلے میں اور اس کو مکروہ جانا ۔ کہا مالک نے ہماری دانست میں اس کا مطلب یہ ہے کہ وہ شخص ان کپڑوں کو اسی کے ہاتھ بیچنا چاہے جس سے خریدا ہے پہلی قیمت سے کچھ زیادہ پر کیونکہ اگر وہ کسی اور شخص سے ان کپڑوں کو بیچنا چاہے تو کچھ قباحت نہیں ۔ کہا مالک نے ہمارے نزدیک یہ حکم اتفاقی ہے جو شخص سلف کرے غلام میں یا جانور میں یا کسی اور اسباب میں اور اس کے اوصاف بیان کردے ایک میعاد معین پر جب میعاد گزرے تو مشتری (خریدنے والا) ان چیزوں کو اسی بائع (بچنے والا) کے ہاتھ پہلی قیمت سے زیادہ پر نہ بیچے جب تک کہ ان چیزوں کو اپنے قبضے میں نہ لائے ورنہ ربا ہوجائے گا گویا بائع (بچنے والا) نے ایک مدت تک مشتری (خریدنے والا) کے روپوں سے فائدہ اٹھایا پھر زیادہ دے کر اس کو پھیر دیا تو یہ عین ربا ہے۔ کہا مالک نے جو شخص سلف کرے سونا چاندی دے کر کسی اساب میں یا جانور میں اور اس سے اوصاف بیان کردے ایک میعاد معین پر جب میعاد گزر جائے یا نہ گزرے تو مشتری (خریدنے والا) اس اسباب یا جانور کو بائع (بچنے والا) کے ہاتھ کسی اور اسباب کے بدلے میں بیچ سکتا ہے مگر یہ ضروری ہے کہ اس اسباب کو نقد لے لے اس میں میعاد نہ ہو سوائے غلے کے کہ اس کا بیچنا قبل قبضے کے درست نہیں اور اگر مشتری (خریدنے والا) اس اس اسباب کو سوائے بائع (بچنے والا) کے اور کسی کے ہاتھ بیچے تو سونے چاندی کے بدلے میں بھی بیچ سکتا ہے مگر یہ ضروری ہے کہ دام نقد لے میعاد نہ ہو ورنہ کالئی کی بیع کالئی کے بدلے میں ہوجائے گی یعنی دین کے بدلے میں دین۔ کہا مالک نے جو شخص کسی اسباب میں جو کھانے پینے کا نہیں ہے سلف کرے ایک میعاد پر تو مشتری (خریدنے والا) کو اختیار ہے کہ اس اسباب کو سوائے بائع (بچنے والا) کے اور کسی کے ہاتھ سونا یا چاندی یا اسباب کے بدلے میں فروخت کر ڈالے قبضے سے پیشتر مگر یہ نہیں ہوسکتا کہ بائع (بچنے والا) کے ہاتھ ہی بیچے اگر ایسا کرے تو اسباب کے بدلے میں بید ڈالے تو کچھ قباحت نہیں مگر نقدا نقد بیچے۔ کہا مالک نے جس نے روپے یا اشرفیاں دے کر سلف کی چار کپڑوں میں ایک میعاد پر اور ان کپڑوں کے اوصاف بیان کردیئے ۔ جب مدت گزری تو مشتری (خریدنے والا) نے بائع (بچنے والا) پر ان چیزوں کا تقاضا کیا لیکن بائع (بچنے والا) کے پاس اس قسم کے کپڑے نہ نکلے بلکہ اس سے ہلکے اس وقت بائع (بچنے والا) نے کہا تو ان ہلکے کپڑوں میں سے آٹھ کپڑے لے لے تو مشتری (خریدنے والا) کو لینا درست ہے مگر اسی وقت نقد لینا چاہیے دیر نہ کرے اگر ان آٹھ کپڑوں کی کوئی معیاد نہ کرے گا تو درست نہیں ہے اگر قبل معیاد گزرنے کے دوسرے کپڑے اسی قسم کے ٹھہرائے تو درست نہیں البتہ دوسرے قسم کے کپڑوں سے بدلنا درست ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1358
			}
		}
	]
}