{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "کہا مالک نے ہمارے نزدیک یہ حکم اتفاقی ہے جو شخص ایک شہر سے کپڑا خرید کرکے دوسرے شہر میں لائے پھر مرابحہ کے طور پر بیچنا چاہے تو اصل لاگت میں دلالوں کی دلالی اور تہہ کرنے کی مزدوری اور باندھا بوندھی کی اجرت اور اپنا خرچ اور مکان کا کرایہ شریک نہ کرے البتہ کپڑے کی بار برداری اس میں شریک کرلے مگر اس پر نفع نہ لے مگر جب مشتری (خریدنے والا) کو اطلاع دے اور وہ اس پر بھی نفع دینے کو راضی ہوجائے تو کچھ قباحت نہیں ۔ کہا مالک نے کپڑوں کی دھلائی اور نگوائی اس لاگت میں داخل ہوگی اور اس پر نفع لیا جائے گا۔ جیسے کپڑے پر نفع لیا جاتا ہے۔ اگر کپڑوں کو بیچا اور ان چیزوں کا حال بیان نہ کیا تو ان پر نفع نہ ملے گا اب اگر کپڑا تلف ہوگیا تو کرایہ باربرداری کا محسوب ہوگا مگر اس پر نفع نہ لگایا جائے گا۔ اگر کپڑا موجود ہے تو بیع کو فسخ کردیں گے جب دونوں راضی ہوجائیں کسی امر پر۔ کہا مالک نے اگر کسی شخص نے کوئی اسباب سونے یا چاندی کے بدلے میں خریدا تو اس دن چاندی سونے کا بھاؤ یہ تھا کہ دس درہم کو ایک دینار آتا تھا پھر مشتری (خریدنے والا) اس مال کو لے کر دوسرے شہر میں آیا اور اسی شہر میں مرابحہ کے کے طور پر بیچنا چاہا اسی نرخ پر جو سونے چاندی کا اس دن تھا اگر اس نے دراہم کے بدلے میں خریدا تھا اور دیناروں کے بدلے میں بیچا یا دیناروں کے بدلے میں خریدا تھا اور درہموں کے بدلے میں بیچا اور اسباب موجود ہے۔ تلف نہیں ہوا تو خریدار کو اختیار ہوگا چاہے لے چاہے نہ لے اور اگر وہ اسباب تلف ہوگیا تو مشتری (خریدنے والا) سے وہ ثمن جس کے عوض میں بائع (بچنے والا) نے خریدا تھا نفع حساب کرکے بائع (بچنے والا) کو دلادیں گے۔ کہا مالک نے اگر ایک شخص نے اپنی چیز جو سو دینار کو پڑی تھی دس فی صدی کے نفع پر بیچی پھر معلوم ہوا کہ وہ چیز نوے دینار کو پڑی تھی اور وہ چیز مشتری (خریدنے والا) کے پاس تلف ہوگئی تو اب بائع (بچنے والا) کو اختیار ہوگا چاہے اس چیز کی قیمت بازار کی لے لے اس دم کی قیمت جس دن وہ شئے مشتری (خریدنے والا) کے پاس آئی تھی مگر جس صورت میں قیمت بازار کی اس ثمن سے جو اول میں ٹھہری تھی یعنی ایک سو دس دینار سے زیادہ ہو تو بائع (بچنے والا) کو ایک سو دس دینار سے زیادہ نہ ملیں گے اور اگر چاہے تو نوے دینار پر اسی حساب سے نفع لگا کریعنی ننانوے دینار لے لے مگر جس صورت میں یہ ثمن قیمت سے کم ہو تو بائع (بچنے والا) کا اختیار ہوگا ۔ کہا مالک نے اگر کسی شخص نے ایک چیز مرابحہ پر بیچی اور کہا سو دینار کو مجھ کو پڑی ہے پھر اس کو معلوم ہوا ایک سو بیس دینار کو پڑی تو اب خریدار کو اختیار ہوگا اگر چاہے تو بائع (بچنے والا) کا اس دن کی قیمت بازار کی جس دن وہ شئے لی ہے دے دے اور اگر چاہے تو جس ثمن پر خرید کیا ہے نفع لگا کر جہاں تک پہنچے دے مگر جس صورت میں قیمت بازار کی پہلی ثمن سے (یعنی جو سو دینار پر لگی ہے) کم ہو تو مشتری (خریدنے والا) کو یہ نہیں پہنچتاکہ اس سے کم دے اس واسطے کہ مشتری (خریدنے والا) اس پر راضی ہوچکا ہے مگر بائع (بچنے والا) نے اس سے زیادہ بیان کیا تو خریدار کو اصلی ثمن سے کم کرنے کا اختیار نہ ہوگا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1364
			}
		}
	]
}