{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "موسی بن میسرہ نے سنا ایک شخص پوچھ رہا تھا سعید بن مسیب سے میں قرض کے بدل میں بیچا کرتا ہوں سعید نے کہا تو نہ بیچ مگر اس چیز کو جو تیرے پاس ہو ۔ کہا مالک نے جو شخص کوئی چیز خرید کرے اس شرط پر کہ بائع (بچنے والا) وہ شئے مشتری (خریدنے والا) کو اتنی مدت میں سپرد کردے اس میں مشتری (خریدنے والا) نے کوئی مصلحت رکھی ہو مثلا اس وقت بازار میں اس مال کی نکاسی کی امید ہو یا اور کچھ غرض ہو پھر بائع (بچنے والا) اس وعدے میں خلاف کر اور مشتری (خریدنے والا) چاہے کہ وہ شئے بائع (بچنے والا) کو پھیر دے تو مشتری (خریدنے والا) کو یہ حق نہیں پہنچتا اور بیع لازم رہے گی اگر بائع (بچنے والا) اس شئے کو قبل میعاد کے لئے آیا تو مشتری (خریدنے والا) پر جبر نہ کیا جائے گا اس کے لینے پر۔ کہا مالک نے جو شخص اناج خرید کر اس کو تول لے پھر ایک خریدار آئے جو مشتری (خریدنے والا) سے اس اناج کو خرید کرنا چاہے مشتری (خریدنے والا) اس سے کہے کہ میں اناج تول چکا ہوں اور وہ شخص مشتری (خریدنے والا) کو سچا سمجھ کر اس غلے کو نقد مول لے لے تو کچھ قباحت نہیں مگر وعدے پر لینا مکروہ ہے جب تک وہ خریدار دوبارہ اس کو تول نہ لے۔ کہا مالک نے دین کا خریدنا درست نہیں خواہ غائب پر ہو یا حاضر پر مگر جب شخص حاضر اس کا اقرار کرے اسی طرح جو دین میت پر ہو اس کا بھی خریدنا درست نہیں کیونکہ اس میں دھوکا ہے معلوم نہیں وہ قرض ملتا ہے یا نہیں اس واسطے اگر میت یا غائب پر اور بھی دین نکلا تو اس کے پیسے مفت گئے دوسرے یہ کہ وہ قرض اس کی ضمان میں داخل نہیں ہو اگر نہ پنٹا تو اس کے پیسے مفت گئے۔ کہا مالک نے بیع سلف(قرض) میں اور بیع عینہ میں یہ فرق ہے کہ بیع عینہ والا دس دینار نقد دے کر پندرہ دینار وعدے پر لیتا ہے تو یہ صریح دھوکا ہے اور بالکل فریب ہے۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1370
			}
		},
		{
			"hadithnumber": 1370.5,
			"arabicnumber": 1370.5,
			"text": "کہا مالک نے جس شخص نے کئی قسم کا کپڑا بیچا اور چند رقم کے کپڑے مستثنی کرلینے کی شرط کرلی تو کچھ قباحت نہیں اگر شرط نہیں کی تو وہ ان کپڑوں میں شریک ہو جائے گا ۔ اس لئے کہ ایک رقم کے کپڑوں میں بھی کم وبیش ہوتی ہے۔ کہا مالک نے ہمارے نزدیک یہ حکم ہے کہ شرکت اور تولیہ اور اقالہ کھانے کی چیزوں میں درست ہے ہے خواہ ان پر قبضہ ہوا ہو یا نہ ہوا ہو مگر یہ ضروری ہے کہ نقد ہو میعاد نہ ہو اور کمی بیشی نہ ہوا اگر اس میں کمی بیشی ہوگی یا میعاد ہوگی تو یہ معاملے بیع سمجھے جائیں گے شرکت اور تولیہ اور اقالہ نہ ہوں گے ۔ کہا مالک نے اگر کسی شخص نے کوئی اسباب جیسے کپڑا یا غلام یا لونڈی خرید کیا پھر ایک شخص نے اس سے کہا کہ مجھ کو بھی اس میں شریک کرلو اس نے قبول کیا اور دونوں نے مل کر بائع (بچنے والا) کو قیمت ادا کردی پھر وہ اسباب کسی اور کا نکلا تو جو شخص شریک ہو وہ اپنے دام پہلے مشتری (خریدنے والا) سے لے لے گا۔ اور وہ بائع (بچنے والا) سے لے گا مگر جس صورت میں مشتری (خریدنے والا) نے خریدتے وقت بائع (بچنے والا) کے سامنے اس شریک سے کہہ دیا ہو کہ اگر مبیع میں فتور نکلے تو اس کی جواب وہی بائع (بچنے والا) پر ہوگی تو اس صورت میں وہ شریک اپنا نقصان بائع (بچنے والا) سے لے گا اگر ایسا نہ ہو تو مشتری (خریدنے والا) کی شرط کچھ کام نہ آئے گی اور تاوان کا نقصان اسی پر ہوگا۔ کہا مالک نے زید نے عمرو سے یہ کہا تو اس شئے کو خرید کرلے میرے اور اپنے ساجھے میں بکوادوں گا۔ تو میری طرف سے بھی دام دے دے تو یہ درست نہیں کیونکہ یہ سلف (قرض) ہے بکوادینے کی شرط پر اگر وہ شئے تلف ہوجائے تو عمروزید سے اس کے حصہ کے دام لے لے گا البتہ اگر عمرو ایک شئے خرید کرچکا پھر زید نے کہا مجھے بھی اس میں شریک کرلے نصف کا میں بکوادوں گا تو یہ درست ہے۔",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}