{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"35": "Pre-emption in Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "سعید بن مسیب اور ابی سلمہ بن عبدالرحمن رضی اللہ تعالیٰ عنہ روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حکم کیا شفعہ کا اس چیز میں جوتقسیم نہ ہوئی ہو شریکوں میں جب تقسیم ہو جائے اور حدیں قائم ہو جائیں پھر اس میں شفعہ نہیں ۔ کہا مالک نے ہمارے نزدیک یہی حکم ہے اور اس میں کچھ اختلاف نہیں ہے۔ سعید بن مسیب سے سوال ہوا کہ شفعے میں کیا حکم ہے انہوں نے کہا شفعہ مکان میں اور زمین میں ہوتا ہے اور شفعے کا استحاق صرف شریک کو ہوتا ہے ۔ سلیمان بن یسار نے بھی ایسا ہی کہا ۔ کہا مالک نے اگر ایک شخص نے مشترک زمین کا ایک حصہ کسی جانور یا غلام کے بدلے میں خریدا اب دوسراشریک مشتری (خریدنے والا) سے شفعے کا مدعی ہوا لیکن وہ جانور یا غلام تلف ہوگیا اور اس کی قیمت معلوم نہیں مشتری (خریدنے والا) کہتا ہے اس کی قیمت سو دینار تھی اور شفیع کہتا ہے پچاس دینار تھی تو مشتری (خریدنے والا) سے قسم لیں گے اس امر پر کہ اس جانور یا غلام کی قیمت سو دینار تھی ۔ بعد اس کے شفیع کو اختیار ہوگا چاہے سو دینار دے کر زمین کے اس حصے کو لے لے چاہے چھوڑ دے البتہ اگر شفیع گواہ لائے اس امر پر کہ اس جانور یا غلام کی قیمت پچاس دینار تھی تو اس کا قول معتبر ہوگا ۔ کہا مالک نے جس شخص نے اپنے مشترک گھر یا مشترک زمین کا ایک حصہ کسی کو ہبہ کیا موہوب لہ نے واہب کو اس کے بدلے میں کچھ نقد دیا یا چیز دی تو اور شریک موہوب لہ کو اسی قدر نقد یا اس چیز کی قیمت دے کر شفعہ لے لیں گے۔ کہا مالک نے اگر کسی شخص نے اپنا حصہ مشترک زمین یا مشترک گھر میں ہبہ کیا لیکن موہوب لہ نے اس کا بدلہ نہیں دیا تو شفیع کو شفعہ کا استحقاق نہ ہوگا جب موہوب لہ دے گا تو شفیع موہوب لہ کو اس بدلہ کی قیمت دے کر شفعہ لے لے گا۔ کہا مالک نے اگر بیع کے وقت شفیع غائب ہو تو اس کا شفعہ باطل نہ ہوگا اگرچہ کتنی ہی مدت گزر جائے۔ کہا مالک نے اگر کئی شریکوں کو شفعے کا استحقاق ہو تو ہر ایک ان میں سے اپنے حصے کے موافق مبیع میں سے حصہ لیں گے اگر ایک شخص نے مشترک حصہ خرید کیا اور سب شریکوں نے سفعے کا دعویٰ چھوڑ دیا مگر ایک شریک نے مشتری (خریدنے والا) سے یہ کہا کہ میں اپنے حصے کے موافق تیری زمین سے شفعہ لوں گا۔ مشتری (خریدنے والا) یہ کہے یا تو تو پوری زمین جس قدر میں نے خریدی ہے سب لے لے یا شفعے کا دعویٰ چھوڑے تو شفیع کو لازم ہوگا یا تو پورا حصہ مشتری (خریدنے والا) سے لے لے یا شفعے کا دعویٰ چھوڑ دے۔ کہا مالک نے ایک شخص زمین کو خرید کر اس میں درخت لگادے یا کنواں کھود دے پھر ایک شخص اس زمین کے شفعے کا دعویٰ کرتا ہوا آئے تو اس کو شفعہ نہ ملے گیا جب تک کہ مشتری (خریدنے والا) کے کنوئیں اور درختوں کی بھی قیمت نہ دے ۔ کہا مالک نے جس شخص نے مشترک گھر یا زمین میں سے اپنا حصہ بیچاجب بائع (بچنے والا) کو معلوم ہوا کہ شفیع اپناشفعہ لے تو اس نے بیع کو فسخ کر ڈالا اس صورت میں شفع کا شفعہ ساقط نہ ہوگا بلکہ اس قدر دام دے کر جتنے کو وہ حصہ بکا تھا اس حصے کو لے گا۔ کہا مالک نے اگر ایک شخص نے ایک حصہ مشترک گھر یا زمین کا اور ایک جانور اور کچھ اسباب ایک ہی عقد میں خرید کیا پھر شفیع نے اپنا حصہ یا شفعہ اس زمین یا گھر میں مانگا مشتری (خریدنے والا) کہنے لگا جتنی چیزیں میں نے خریدی ہیں تو ان سب کو لے لے کیونکہ میں نے ان سب کو ایک عقد میں خریدا ہے تو شففیع زمین یا گھر میں اپنا شفعہ لے گا اس طرح پر کہ ان سب چیزوں کی علیحدہ علیحدہ قیمت لگائیں گے اور پھر ثمن کو ہر ایک قیمت پر حصہ رسد تقسیم کریں گے جو حصہ ثمن کا زمین یا مکان کی قیمت پر آئے اس قدر شفیع کو دے کر وہ حصہ زمین یا مکان کا لے لے گا اور یہ ضروری نہیں کہ اس جانور اور اسباب کو بھی لے لے البتہ اگر اپنی خوشی سے لے تو مضائقہ نہیں ۔ کہا مالک نے جس شخص نے مشترک زمین میں سے ایک حصہ خرید کیا اور سب شفیعوں نے شفعے کا عدویٰ چھوڑ دیا مگر ایک شفیع نے شفعہ طلب کیا تو اس شفیع کو چاہیے کہ پورا حصہ مشتری (خریدنے والا) کا لے لے یہ نہیں ہوسکتا کہ اپنے حصے کہ موافق اس میں سے لے لے۔ کہا مالک نے اگر ایک گھر میں چند آدمی شریک ہوں اور ایک آدمی ان میں سے اپنا حصہ بیچے سب شرکاء کی غیبت میں مگر ایک شریک کی موجودگی میں اب جو شریک موجود اس سے کہا جائے تو شفعہ لیتا ہے یا نہیں لیتا۔ وہ کہے بالفعل میں اپنے حصے کے موافق لے لیتا ہوں بعد اس کے جب میرے شریک آئیں گے وہ اپنے حصوں کو خرید کریں گے تو بہتر۔ نہیں تو میں کل شفعہ لے لوں گا تو یہ نہیں ہوسکتا بلکہ جو شریک موجود ہے اس سے صاف کہہ دیا جائے گا یا تو شفعہ کل لے لے یا چھوڑ دے اگر وہ لے لے گا تو بہتر نہیں تو اس کا شفعہ ساقط ہوجائے گا۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1397
			}
		}
	]
}