{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"35": "Pre-emption in Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "حضرت عثمان نے کہا جب زمین میں حدیں پڑجائیں تو اس میں شفعہ نہ ہوگا اور نہیں شفعہ ہے کنوئیں میں اور نہ کھجور کے نر درخت میں۔ کہا مالک نے ہمارے نزدیک یہی حکم ہے۔ کہا مالک نے راستے میں شفعہ نہیں ہے خواہ وہ تقسیم کے لائق ہو یا نہ ہو۔ کہا مالک نے اگر مشتری (خریدنے والا) نے خیار کی شرط سے زمین کے ایک حصے کو خریدا تو شفیع کو شفعے کا حق نہ ہوگا جب تک کہ مشتری (خریدنے والا) کا خیار پورا نہ ہو۔ اور وہ اس کو قطعی طور پر نہ لے۔ کہا مالک نے اگر ایک شخص نے زمین خریدی اور مدت تک اس پر قابض رہابعد اس کے ایک شخص نے اس زمین میں اپنا حق ثابت کیا تو اس کو شفعہ ملے گا اور جو کچھ زمین میں منفعت ہوئی ہے وہ مشتری (خریدنے والا) کی ہوگی جس تاریخ تک اس کا حق ثابت ہوا ہے کیونکہ وہ مشتری (خریدنے والا) اس زمین کا ضامن تھا اگر وہ رتلف ہوجاتی یا اس کے درخت تلف ہوجاتے ۔ اگر بہت مدت گزر گئی یا گواہ مر گئے یا بائع (بچنے والا) اور مشتری (خریدنے والا اور بیچنے والا) مر گئے یا وہ رندہ ہیں مگر بیع کو بھول گئے بہت مدت گزرنے کی وجہ سے اس صورت میں اس شخص کو اس کا حق تو ملے گا مگر شفعے کا دعویٰ نہ پہنچے گا۔ اگر زمانہ بہت نہیں گزرا ہے اور اس شخص کو معلوم ہوا کہ بائع (بچنے والا) نے قصداًشفعہ باطل کرنے کے واسطے بیع کو چھپایا ہے تو اصل زمین کی قیمت اور جو اس میں زیادہ ہوگیا ہے اس کی قیمت وہ شخص ادا کرکے شفعہ لے لے گا۔ کہا مالک نے جیسے زندہ کے مال میں شفعہ ہے ویسے میت کے مال میں بھی شفعہ ہے۔ البتہ اگر میت کے وارث اس کے مال کو تقسیم کرلیں پھر بیچیں تو اس میں شفعہ نہ ہوگا۔ کہا مالک نے ہمارے نزدیک غلام اور لونڈی اور اونٹ اور گائے اور بکری اور جانور اور کپڑے میں شفعہ نہیں ہے نہ اس کنوئیں میں جس کے متعلق زمین نہیں ہے کیونکہ شفعہ اس زمین میں ہوتا ہے جو تقسیم کے قابل ہے اور اس میں حدود ہوتے ہیں زمین کی قسم سے جو چیز ایسی نہیں ہے اس میں شفعہ بھی نہیں ہے۔ کہا مالک نے اگر کسی شخص نے ایسی زمین خریدی جس میں لوگوں کو حق شفعہ پہنچتا ہے تو چاہیے کہ شفیعوں کو حاکم کے پاس لے چائے یا شفعہ لیں یا چھوڑ دیں اگر مشتری (خریدنے والا) شفیعوں کو حاکم کے پاس نہیں لے گیا لیکن ان کو خریدنے کی خبر ہوگئی تھی اور انہوں نے مدت شفعہ کا دعویٰ نہ کیا بعد اس کے دعویٰ کیا تو مسموع نہ ہوگا۔ پوری ہوئی کتاب شفعے کی۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1398
			}
		}
	]
}