{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"45": "Madina"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "عبداللہ بن عباس رضی اللہ تعالیٰ عنہما سے روایت ہے کہ حضرت عمر رضی اللہ تعالیٰ عنہ شام کی طرف نکلے جب سرغ(ایک بستی ہے) میں پہنچے تو لشکر کے بڑے بڑے افسران سے ملے جیسے ابوعیبدہ بن جراح اور ان کے ساتھی انہوں نے کہا شام میں آج کل وباء ہے حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا ابن عباس رضی اللہ تعالیٰ عنہما سے کہ بلاؤ بڑے بڑے مہاجرین کو جنہوں نے پہلے ہجرت کی ہے تو بلایا ان کو حضرت عمر رضی اللہ تعالیٰ عنہ نے ان سے مشورہ کیا اور بیان کیا ان سے کہ شام میں وباء ہو رہی ہے انہوں نے اختلاف کیا بعضوں نے کہا آپ کام کے واسطے نکلے ہیں لوٹنا مناسب نہیں ہے بعضوں نے کہا کہ آپ کے ساتھ اور لوگ بھی ہیں اور صحابہ ہیں مناسب نہیں کہ آپ ان کو اس وبا میں لے جائیں حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا جاؤ اور کہا بلاؤ انصار کو ابن عباس کہتے ہیں میں نے انصار کو بلایا اور وہ آئے ان سے مشورہ کیا انہوں نے بھی مہاجرین کی مثل بیان کی اور اسی طرح اختلاف کیا آپ نے کہا جاؤ۔ پھر کہا قریش کے بوڑھے بوڑھے لوگوں کو جہنوں نے ہجرت کی فتح مکہ کے بعد بلاؤ، میں نے ان کو بلایا ان میں سے دو آدمیوں نے بھی اختلاف نہیں کیا بلکہ سب نے کہا ہمارے نزدیک مناسب یہ ہے کہ آپ لوٹ جائیں اور لوگوں کو اس وباء میں نہ لے جائیے جب حضرت عمر رضی اللہ تعالیٰ عنہ نے لوگوں میں منادی کرادی کہ صبح کو اونٹ پر سوار ہو کر چلے اور اس وقت ابوعیبدہ نے کہا کہ اللہ جل جلالہ کی تقدیر سے بھاگے جاتے ہو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا کاش یہ بات کسی اور نے کہی ہوتی ہاں ہم بھاگتے ہیں اللہ کی تقدیر سے اللہ کی تقدیر کی طرف کیا اگر تمہارے پاس اونٹ ہوں اور تم ایک وادی میں جاؤ جس کے دو کنارے ہوں ایک کنارہ سر سبز اور شاداب ہو اور دوسرا خشک اور خراب ہو اگر تو اپنے اونٹوں کو سر سبز اور شاداب میں چرائے تب بھی تو نے اللہ کی تقدیر سے چرایا اور جو تو نے خشک اور خراب میں چرائے تب بھی تو نے اللہ کی تقدیر سے چرایا اتنے میں عبدالرحمن بن عوف آئے اور وہ کہیں کام کو گئے ہوئے تھے انہوں نے کہا میں اس مسئلے کا عالم ہوں میں نے رسول اللہ صلی اللہ علیہ وآلہ وسلم سے سنا کہ آپ صلی اللہ علیہ وآلہ وسلم فرماتے تھے کہ جب تم سنو کہ کسی سر زمین میں وباء ہے تو وہاں نہ جاؤ اور جب کسی سر زمین میں وبا پڑے اور تم وہاں موجود ہو تو بھاگو بھی نہیں کہا ابن عباس نے کہ اس وقت حضرت عمر رضی اللہ تعالیٰ عنہ نے اللہ جل جلالہ کی حمد بیان کی اور لوٹ کھڑے ہوئے ۔",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1618
			}
		}
	]
}