{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"6": "Chapters Regarding Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "৪/১৬২১। ‘আয়িশাহ্ (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর স্ত্রীগণ সকলে একত্র হলেন, তাদের একজনও বাদ ছিলেন না। এরপর ফাতেমাহ (রাঃ) আসলেন। আর তার হাঁটাচলার ধরন ছিল যেন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর অনুরূপ। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেনঃ খোশ আমদেদ হে আমার প্রিয় কন্যা। তিনি তাকে নিজের বাম পাশে বসান, অতঃপর তাঁর সাথে চুপেচুপে কিছু কথা বলেন। এতে ফাতেমাহ (রাঃ) কাঁদেন। তিনি পুনরায় তার সাথে গোপনে কিছু কথা বলেন। এতে তিনি হাসেন। পরে আমি ফাতেমাহ (রাঃ)-কে জিজ্ঞেস করলাম, তুমি কেন কাঁদলে? তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর গোপন তথ্য প্রকাশ করবো না। আমি বললাম, দুশ্চিন্তার পরে আজকের মত এত খুশী আমি আর কখনো দেখিনি। তার কাঁদার সময় আমি তাঁকে বললাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কি আমাদের বাদ দিয়ে তোমার সঙ্গে বিশেষ কোন আলাপ করেছেন, তারপর তুমি কাঁদলে? আর রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁর সঙ্গে যে বিষয়ে আলাপ করেছিলেন, আমি পুনরায় তা তাকে জিজ্ঞেস করলাম। তিনি বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর গোপন তথ্য ফাঁস করবো না। তিনি [রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম] ইনতিকাল করার পর আমি ফাতেমাহ (রাঃ)-কে সে বিষয়ে জিজ্ঞেস করলাম। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাকে বলেছেন, জিবরীল (আঃ) প্রতি বছর আমাকে একবার কুরআন পড়ে শুনাতেন। এ বছর তিনি তা আমাকে দু’বার পড়ে শুনিয়েছেন। মনে হয় আমার মৃত্যু নিকটবর্তী হয়েছে। তুমিই আমার পরিবারের মধ্যে সবার আগে আমার সঙ্গে মিলিত হবে। আমি তোমার জন্য কত উত্তম পূর্বসূরী। এ কথায় আমি কাঁদলাম। এরপর তিনি আমাকে গোপনে বলেন, তুমি কি এতে সন্তুষ্ট নও যে, তুমি মু’মিন নারীদের বা এ উম্মাতের নারীদের নেত্রী হবে? এতে আমি হেসেছি।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 189
			}
		}
	]
}