{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"6": "Chapters Regarding Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "২/১৬২৮। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, সহাবায়ে কিরাম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কবর খননের সিদ্ধান্ত নিলে, তাঁরা আবূ উবাইদাহ ইবনুল জাররাহ (রাঃ) এর নিকট খবর পাঠান। তিনি মক্কাবাসীদের কবর খননের ন্যায় কবর খনন করতেন। তাঁরা আবূ তালহা (রাঃ)-এর নিকটও খবর পাঠান। তিনি মদ্বীনাবাসীদের জন্য লাহাদ আকৃতির কবর খনন করতেন। তাঁরা তাদের উভয়ের নিকট দু’জন লোক পাঠান। তারা বলেন, হে আল্লাহ্! আপনার রাসূলের জন্য আপনি পছন্দ করুন। তারা আবূ তালহা (রাঃ)-কে পেয়ে গেলেন এবং তাকে নিয়ে আসা হলো, কিন্তু আবূ উবাইদাহ (রাঃ)-কে পাওয়া গেলো না। অতএব আবূ তালহা (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর জন্য লাহ্দ কবর খনন করেন। রাবী বলেন, মঙ্গলবার তারা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর কাফনের কাজ সম্পন্ন করলে তাঁকে তাঁর ঘরে খাটের উপর রাখা হয়। এরপর লোকজন দলে দলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট প্রবেশ করেন এবং তাঁর জন্য দু‘আ করেন। পুরুষদের পালা শেষ হলে মহিলারা প্রবেশ করেন। তাদের পালা শেষ হলে বালকরা প্রবেশ করে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর জানাযায় কেউ ইমামতি করেননি। তাঁর কবর কোথায় খনন করা হবে, এ নিয়ে একদল বলেন, তাঁকে তার মসজিদে দাফন করা হবে। অপরদল বলেন, তাঁকে তাঁর সাহাবীদের সাথে (একই গোরস্থানে) দাফন করা হবে। আবূ বাকর (রাঃ) বলেন, আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-কে বলতে শুনেছিঃ যে স্থানে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইনতিকাল করেন, সেখানেই তাঁকে দাফন করা হয়। রাবী বলেন, যে বিছানায় রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইনতিকাল করেন, তারা তা সরিয়ে নেন এবং তাঁর জন্য সেখানে কবর খনন করেন। অতঃপর তাঁকে বুধবার মধ্যরাতে দাফন করা হয়। ‘আলী ইবনু আবূ তালিব, ফাদল ইবনু ‘আব্বাস, তার ভাই কুসাম এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর মুক্তদাস শুকরান (রাঃ) তাঁর কবরে নামেন। আবূ লাইলা আওস ইবনু খাওলী (রাঃ) ‘আলী ইবনু আবূ তালিব (রাঃ)-কে বলেন, আল্লাহর শপথ! রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ব্যাপারে আমাদেরও অংশ রয়েছে। ‘আলী (রাঃ) তাকে বলেন, তুমিও নামো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর মুক্তদাস শুকরান (রাঃ) রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর পরিহিত চাঁদরটি সাথে নিয়েছিলেন। তিনি তাও কবরে দাফন করেন এবং বলেন, আল্লাহর শপথ! আপনার পরে তা আর কেউ কখনো পরবে না। অতএব তা রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর সঙ্গে দাফন করা হয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 196
			}
		}
	]
}