{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"10": "The Chapters on Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2067,
			"arabicnumber": 2067,
			"text": "২/২০৬৭। ইবনু ‘আব্বাস (রাঃ) থেকে বর্ণিত। হেলাল ইবনু উমাইয়্যা (রাঃ) তার স্ত্রীর বিরুদ্ধে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট শরীক ইবনু সাহ্মার সাথে যেনায় লিপ্ত হওয়ার অভিযোগ দায়ের করেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ প্রমাণ পেশ করো অন্যথায় তোমার পিঠে হদ্দ কার্যকর হবে। হেলাল ইবনু উমাইয়্যা (রাঃ) বলেন, সেই সত্তার শপথ, যিনি আপনাকে সত্য দ্বীনসহ পাঠিয়েছেন! আমি অবশ্যই সত্যবাদী এবং আল্লাহ্ আমার অভিযোগের ব্যাপারে এমন বিধান নাযিল করবেন, যা আমার পিঠকে হদ্দ থেকে রক্ষা করবে। তখন এই আয়াত নাযিল হলো (অনুবাদ) ‘‘আর যারা নিজেদের স্ত্রীর প্রতি যেনার অপবাদ আরোপ করে অথচ নিজেরা ব্যতীত তাদের কোন সাক্ষী নাই, তাদের প্রত্যেকের সাক্ষ্য এই হবে যে, সে আল্লাহর নামে চারবার শপথ করে বলবে যে, সে অবশ্যই সত্যবাদী এবং পঞ্চমবারে বলবে, সে মিথ্যাবাদী হলে তার উপর নেমে আসবে আল্লাহর লানত’’ (সূরা নূরঃ ৬৭)। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মুখ ফিরিয়ে তাদের দু’জনকে ডেকে পাঠান। তারা উপস্থিত হলে প্রথমে হেলাল ইবনু উমাইয়্যা (রাঃ) দাঁড়িয়ে শপথ করেন এবং নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহ্ অবশ্যই জানেন যে, তোমাদের মধ্যে একজন মিথ্যাবাদী। অতএব কেউ তওবা করবে কি? অতঃপর স্ত্রীলোকটি দাঁড়িয়ে সাক্ষ্য দিলো। পঞ্চমবারে সে যখন বলতে যাচ্ছিল যে, সে (স্বামী) সত্যবাদী হলে তার নিজের উপর আল্লাহর গযব পতিত হোক, তখন লোকেরা তাকে বললো, এটি কিন্তু অবধারিতকারী বাক্য। ইবনু ‘আব্বাস (রাঃ) বলেন, সেই নারী তখন আর কিছু না বলে থেমে গিয়ে পিছনে হটে গেলো। শেষে আমরা মনে করলাম, সে হয়তো ফিরে যাবে (বিরত থাকবে)। কিন্তু সে বললো, আল্লাহর শপথ! আমি আমার সম্প্রদায়কে চিরদিনের জন্য কালিমালিপ্ত করতে পারি না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তোমরা তার প্রতি লক্ষ্য রেখো। সে যদি সুরমাদীপ্ত চোখ, গোশতবহুল নিতম্ব ও গোশতবহুল পদযুগলবিশিষ্ট সন্তান প্রসব করে তবে এটি শরীক ইবনু সাহ্মার। অতঃপর সে এই ধরনের সন্তানই প্রসব করলো। তখন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আল্লাহর কিতাবে আগেই যদি (লি‘আনকারীর) বিধান না দেয়া থাকতো, তাহলে তার ও আমার মধ্যে একটা কিছু ঘটে যেত (তাকে শাস্তি দিতাম)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 52
			}
		}
	]
}