{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"12": "The Chapters on Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2156,
			"arabicnumber": 2156,
			"text": "১/২১৫৬। আবূ সাঈদ আল-খুদরী (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আমাদের তিরিশজন অশ্বারোহীকে এক ক্ষুদ্র সামরিক অভিযানে পাঠান। আমরা এক সম্প্রদায়ের নিকট পৌঁছে যাত্রাবিরতি করলাম এবং আমাদের মেহমানদারি করার জন্য তাদের অনুরোধ করলাম, কিন্তু তারা অস্বীকার করলো। ঘটনাক্রমে তাদের নেতা (বিষাক্ত প্রাণীর) হুলবিদ্ধ হলো। তারা আমাদের কাছে এসে বললো, তোমাদের মধ্যে কি এমন কেউ আছে, যে বিছার কামড়ে ঝাড়ফুঁক করতে পারে? আমি বললাম, হ্যাঁ, আমি পারি। তবে তোমরা আমাদেরকে একপাল ছাগল-ভেড়া না দিলে আমি ঝাড়ফুঁক করবো না। তারা বললো, আমরা তোমাদেরকে তিরিশটি বকরী দিবো। আমরা তা গ্রহণ করলাম এবং আমি তার উপর সাতবার ‘আলহামদু’ সূরাটি পাঠ করলাম। সে সুস্থ হয়ে উঠলো এবং আমরা ছাগলগুলো গ্রহণ করলাম। পরে এ ব্যাপারে আমাদের মনে সন্দেহের সৃষ্টি হলে আমরা বললাম, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট আমাদের না পৌঁছা পর্যন্ত তোমরা তাড়াহুড়া করো না। আমরা তাঁর নিকট উপস্থিত হওয়ার পর আমি যা করেছি তা তাঁকে অবহিত করলাম। তিনি বলেনঃ তুমি কিভাবে জানলে যে, এটা দ্বারা ঝাড়ফুঁকও করা যায়! তোমরা সেগুলো বণ্টন করে নাও এবং তোমাদের সাথে আমাকেও একটি ভাগ দাও। ২/২১৫৬ (১)। আবূ কুরাইব-হুমাইম-আবূ বিশর-ইবনে আবিল মুতাওয়াককিল-আবুল মুতাওয়াককিল-আবূ সাঈদ (রাঃ) নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রেও অনুরূপ বর্ণিত হয়েছে। ৩/২১৫৬(২)। মুহাম্মাদ ইবনে বাশশার-মুহাম্মাদ ইবনে জাফর-শোবা-আবূ বিশর-আবুল মুতাওয়াককিল-আবূ সাঈদ (রাঃ)-নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সূত্রেও অনুরূপ বর্ণিত হয়েছে। আবূ আবদুল্লাহ (রাঃ) বলেন, সঠিক নাম হলো আবুল মুতাওয়াককিল (যিনি আবূ সাঈদ (রাঃ) থেকে বর্ণনা করেছেন )।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		}
	]
}