{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"12": "The Chapters on Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2198,
			"arabicnumber": 2198,
			"text": "১/২১৯৮। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। এক আনসারী ব্যক্তি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত হয়ে কিছু চাইলে তিনি বলেনঃ তোমার ঘরে কি কিছু আছে? সে বললো, হ্যাঁ, একটি কম্বল আছে, যার একাংশ আমরা গায়ে দেই এবং অপরাংশ (বিছানা হিসাবে) বিছাই। আর আছে একটি পানপাত্র যাতে করে আমরা পানি পানি করি। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ জিনিস দু’টি আমার নিকট নিয়ে এসো। রাবী বলেন, সে এগুলো তাঁর নিকট নিয়ে আসলে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিনিস দু’টি নিজ হাতে নিয়ে বলেনঃ এই জিনিস দু’টি কে কিনবে? এক ব্যক্তি বললো, আমি এক দিরহামে তা ক্রয় করতে পারি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এর বেশী মূল্য কে দিবে? তিনি কথাটি দু’বার অথবা তিনবার বলেন। তখন এক লোক বললো, আমি দু’ দিরহামে তা কিনতে পারি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিনিস দু’টি তাকে দিয়ে দিরহাম দু’টি গ্রহণ করলেন। তিনি তা আনসারী লোকটিকে দিয়ে বললেনঃ এর একটি দিরহাম দিয়ে খাদ্য কিনে তোমার পরিবার-পরিজনকে দিয়ে আসো এবং অবশিষ্ট দিরহামটি দিয়ে কুঠার কিনে আমার নিকট নিয়ে আসো। লোকটি তাই করলো। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম সেটি নিয়ে তাতে নিজ হাতে কাঠের হাতল লাগিয়ে দিলেন এবং বললেনঃ যাও, জঙ্গল থেকে কাঠ সংগ্রহ করো। আমি যেন পনের দিনের মধ্যে তোমাকে না দেখি। সে কাঠ সংগ্রহ করে বিক্রয় করতে লাগলো। অতঃপর সে যখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট আসলো, তখন তার নিকট দশ দিরহাম সঞ্চিত হয়েছে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এর কিছু দিয়ে খাদ্য কিনে নাও এবং কিছু দিয়ে কাপড়-চোপড় কিনে নাও। তিনি আরো বলেনঃ ভিক্ষার কারণে কিয়ামতের দিন তোমার মুখমন্ডলে অপমানের চিহৃ থাকার চেয়ে এটি তোমার জন্য অধিক উত্তম। চরম দরিদ্রতা, কঠিন ঋণের বোঝা অথবা রক্তপণ আদায়ের মত প্রয়োজন ব্যতীত যাচ্ঞা করা সংগত নয়।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		}
	]
}