{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"20": "The Chapters on Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "১/২৬১৩। সাফওয়ান ইবনে উমায়্যা (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমরা রাসূলুললাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর নিকট উপস্থিত থাকতেই তাঁর নিকট আমর ইবনে মুররা (রাঃ) এসে বললো, ইয়া রাসূলাল্লাহ! আল্লাহ আমার কপালে দুর্ভাগ্য লিখে দিয়েছেন। আমি আমার হাতের এই দফ (এক মুখ খোলা ঢোল) বাজানো ছাড়া আমার রিযিক প্রাপ্তির আর কোন পথ দেখি না। অতএব আপনি আমাকে নির্দোষ সঙ্গীতের অনুমতি দিন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি তোমাকে অনুমতিও দিবো না এবং তোমাকে সম্মানিত করে তোমার চোখও শীতল করবো না। হে আল্লাহর দুশমন! তুমি মিথ্যা বলেছো। আল্লাহ তোমাকে পবিত্র ও হালাল রিযিক দান করেছেন। কিন্তু আল্লাহ তোমাকে যে হালাল রিযিক দিয়েছেন তার পরিবর্তে আল্লাহ তোমার জন্য যে রিযিক হারাম করেছেন তুমি তাই গ্রহণ করেছো। আমি যদি তোমাকে ইতোপূর্বে নিষেধ করে থাকতাম তবে অবশ্যই তোমাকে শাস্তি দিতাম। আমার এখান থেকে উঠে যাও এবং আল্লাহর নিকট তওবা করো। সাবধান! তোমাকে নিষেধ করার পরও যদি তুমি এ কাজ করো তবে আমি অবশ্যই তোমাকে যন্ত্রণাদায়ক শাস্তি দিবো, তোমার মাথা মুন্ডন করিয়ে বিকৃত করে দিবো, তোমার পরিবার থেকে তোমাকে নির্বাসিত করবো এবং তোমার সহায়-সম্পত্তি লুণ্ঠন করা মদীনার যুবকদের জন্য হালাল করে দিবো। এ কথায় আমর উঠে দাঁড়ায় এবং সে নিজেকে এতোটা লাঞ্ছিত ও অপমানিত বোধ করে যা আল্লাহ ছাড়া কেউ জানে না। সে উঠে চলে গেলে নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ এইসব লোক পাপাচারী। এদের কেউ তওবা না করে মারা গেলে আল্লাহ তা‘আলা কিয়ামতের দিন তাকে নপুংসক ও বিবস্ত্র অবস্থায় উত্থিত করবেন, যেরূপ সে দুনিয়াতে ছিল। সে একটুকরা কাপড় দিয়েও মানুষের সামনে নিজের লজ্জা নিবারণ করবে না এবং যখনই সে দাঁড়াবে সাথে সাথে আছাড় খেয়ে পড়ে যাবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		}
	]
}