{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"33": "Etiquette"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3719,
			"arabicnumber": 3719,
			"text": "১/৩৭১৯। উম্মু সালামা (রাঃ) থেকে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর ইনতিকালের এক বছর পূর্বে আবূ বাকর (রাঃ) ব্যবসা উপলক্ষে বুসরা যান। নুআইমান (রাঃ) এবং হারমালার পুত্র সুয়াইবিত তার সাথে ছিলেন। তারা উভয়ে বদর যুদ্ধে অংশগ্রহণ করেছিলেন। নুআইমান (রাঃ) রসদপত্রের দায়িত্বে ছিলেন। সুয়াইবিত (রাঃ) ছিলেন কৌতুক প্রিয়। তিনি নুআইমান (রাঃ) কে বলেন,আমাকে কিছু আহার দিন। তিনি বলেন, আবূ বাকর (রাঃ) আসা পর্যন্ত অপেক্ষা করুন। তিনি বলেন, না, আমি আপনাকে পেরেশান করে ছাড়বো। রাবী বলেন, অতঃপর তারা একদল লোককে অতিক্রম করে যাচ্ছিলেন। সুয়াইবিত (রাঃ) তাদের বলেন, তোমরা কি আমার নিকট থেকে আমার একটি গোলাম খরিদ করবে? তারা বলেন, হাঁ। তিনি বলেন, সে এমন গোলাম যার একটা কথা আছে। সে তোমাদের বলবে, আমি স্বাধীন। তোমরা তার এ কথায় বিশ্বাস করে তাকে ছেড়ে দিয়ে আমাকে কিন্তু আমার এ গোলামের ব্যাপারে ফ্যাসাদে ফেলো না যেন। তারা বললো, না, আমরা বরং তাকে তোমার থেকে ক্রয় করবো। তারা তার থেকে তাকে দশটি উটের বিনিময়ে ক্রয় করে তার নিকট এলো। তারা তার গলায় পাগড়ি অথবা রশি বাঁধলো। নুআইমান (রাঃ) বলেন, এলোক কিন্তু তোমাদের সাথে উপহাস করেছে, সত্যি আমি স্বাধীন, গোলাম নই। তারা বললো, তোমার ব্যাপারটি আমাদের অবহিত করা হয়েছে। তারা তাকে নিয়ে চলে গেল। ইতোমধ্যে আবূ বাকর (রাঃ) এসে গেলে তার সঙ্গীরা তাকে বিষয়টি অবহিত করলেন। রাবী বলেন, অতঃপর তিনি তাদের নিকট গেলেন এবং তাদের উট তাদেরকে ফেরত দিয়ে নুআইমান (রাঃ) কে ছাড়িয়ে আনলেন। রাবী বলেন, তারা নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট ফিরে এসে বিষয়টি তাঁকে অবহিত করেন। রাবী বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ তাকে নিয়ে (এই ঘটনাকে কেন্দ্র করে) প্রায় এক বছর হাসি-তামাশা করেন।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 63
			}
		}
	]
}