{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"35": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "৪/৩৯২০। খারাশা ইবনুল হুর (রাঃ) থেকে বর্ণিত। তিনি বলেন, আমি মদীনায় পৌঁছে মসজিদে নববীতে প্রবীণদের এক মজলিসে বসলাম। একজন প্রবীন লোক তার লাঠিতে ভর দিয়ে আসলেন। লোকেরা বললো, যে ব্যক্তি কোন জান্নাতী লোক দেখে আনন্দিত হতে চায়, সে যেন এই ব্যক্তির দিকে তাকায়। তিনি খুঁটির পেছনে দাঁড়িয়ে দু’ রাক‘আত নামায পড়লেন। আমি উঠে গিয়ে তাকে বললাম, লোকেরা এই এই বলেছে। তিনি বলেন, সমস্ত প্রশংসা আল্লাহর জন্য, জান্নাত আল্লাহর এবং তিনি যাকে ইচ্ছা তাতে প্রবেশ করাবেন। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর যুগে একটি স্বপ্ন দেখেছিলাম। আমি দেখলাম, এক ব্যক্তি যেন আমার নিকট এসে আমাকে বললো, চলুন। আমি তার সাথে গেলাম। সে আমাকে একটি বিরাট প্রশস্ত রাস্তায় পৌঁছে দিলো। আমার বাঁ দিকে একটি পথ দেখানো হলো। আমি সেই পথ ধরে অগ্রসর হতে চাইলাম। সে বললো, তুমি এ পথের উপযুক্ত নও। অতঃপর আমার ডানে একটি রাস্তা দেখানো হলো। আমি সেই রাস্তা দিয়ে অগ্রসর হলাম। আমি একটি পিচ্ছিল পাহাড়ে পৌঁছলে সে আমার হাত ধরে আমাকে ধাক্কা দিলো এবং আমি এর চূড়ায় পৌঁছে গেলাম, কিন্তু আমি সেখানে স্থির হয়ে থাকতে পারলাম না। আমি এর চূড়ায় লোহার একটি খুঁটি দেখতে পেলাম। এর চূড়ায় ছিলো একটি সোনার হাতল। সে (ফেরেশতা) আমার হাত ধরে ধাক্কা দিলে আমি সেই হাতল ধরে ফেললাম। সে বললো, তুমি দৃঢ়ভাবে আঁকড়ে ধরেছ? আমি বললাম, হাঁ। সে তার পা দ্বারা খুঁটিতে আঘাত করলে আমি হাতলটি দৃঢ়ভাবে ধরে ফেললাম। তিনি বললেন, আমি ঘটনাটি নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম কে অবহিত করলাম। তিনি বলেনঃ তুমি উত্তম স্বপ্ন দেখেছো। বিরাট প্রশস্ত রাস্তাটি হলো হাশরের ময়দান। তোমার বাঁ দিকে যে রাস্তাটি চলে গেছে তা হলো জাহান্নামীদের রাস্তা। তুমি জাহান্নামী নও। তোমার ডান দিক দিয়ে যে রাস্তা চলে গেছে তা হলো জান্নাতীদের রাস্তা। পিচ্ছিল পাহাড়টি হলো শহীদদের মনযিল। যে হাতলটি তুমি আঁকড়ে ধরেছিলে, সেটি হলো ইসলামরে হাতল। অতএব তুমি আমৃত্যু এটি আঁকড়ে ধরে রাখবে। আশা করি আমি জান্নাতবাসী হবো। স্বপ্নটি দেখেছিলেন আবদুল্লাহ ইবনে সালাম (রাঃ)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 28
			}
		}
	]
}