{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4075,
			"arabicnumber": 4075,
			"text": "৫/৪০৭৫। নাওয়াস ইবনে সামআন অল-কিলাবী (রাঃ) থেকে বর্ণিত। তিনি বলেন, একদা সকাল বেলা রাসূলুল্লাহ (সা.) দাজ্জাল সম্পর্কে আলোচনা করেন। তিনি তার ভয়াবহতা ও নিকৃষ্টতার কথা তুলে ধরেন। এমনকি আমরা ধারণা করলাম যে, সে হয়তো খেজুর বাগানের ওপাশেই অবস্থান করছে। আমরা বিকেল বেলা পুনরায় তাঁর নিকট উপস্থিত হলাম। তখন তিনি আমাদের মাঝে দাজ্জাল-ভীতির আলামত লক্ষ্য করে বলেনঃ তোমাদের কী হয়েছে? আমরা বললাম, ইয়া রাসূলাল্লাহ! ভোরবেলা আপনি আমাদের সামনে দাজ্জাল সম্পর্কে আলোচনা করেছেন এবং তার ভয়াবহতা ও নিকৃষ্টতার কথা এমন ভাষায় তুলে ধরেছেন যে, আমাদের মনে হলো যে, সে বোধ হয় খেজুর বাগানের পাশেই উপস্থিত আছে। তিনি বলেনঃ আমার কাছে দাজ্জালই তোমাদের জন্য অধিক ভয়ংকর বিপদ। সে যদি আমার জীবদ্দশায় তোমাদের মাঝে আত্ম প্রকাশ করে তবে আমিই তোমাদের পক্ষে তার প্রতিপক্ষ হবো। আর অমার অবর্তমানে যদি সে আত্মপ্রকাশ করে তাহলে তোমরাই হবে তার প্রতিপক্ষ। আর প্রত্যেক মুসলিমের জন্য আল্লাহই আমার পরিবর্তে সহায় হবে। সে (দাজ্জাল) হবে কুঞ্চিত চুলবিশিষ্ট, স্থির দৃষ্টিসম্পন্ন যুবক এবং আবদুল উযযা ইবনে কাতান সদৃশ। তোমাদের কেউ তাকে দেখলে সে যেন তার বিরুদ্ধে সূরা কাহফের প্রাথমিক আয়াতগুলো পাঠ করে। সে সিরিয়া ও ইরাকের মধ্যবর্তী খাল্লা নামক স্থান থেকে আত্মপ্রকাশ করবে। অতঃপর সে ডানে-বামে ফেতনা-ফাসাদ ও বিপর্যয় ছড়িয়ে বেড়াবে। হে আল্লাহর বান্দাগণ! তোমরা দৃঢ়তার সাথে স্থির থাকবে। আমরা জিজ্ঞেস করলাম, হে আল্লাহর রাসূল! সে পৃথিবীতে কতো দিন অবস্থান করবে? তিনি বলেনঃ চল্লিশ দিন। তবে এর এক দিন হবে এক বছরের সমান, এক দিন হবে এক মাসের সমান, এক দিন হবে এক সপ্তাহের সমান এবং অবশিষ্ট দিনগুলো হবে তোমাদের বর্তমান দিনগুলোর সমান। আমরা জিজ্ঞেস করলাম, হে আল্লাহর রাসূল! যে দিনটি এক বছরের সমান হবে তাতে একদিনের নামায পড়লেই কি তা আমাদের জন্য যথেষ্ট হবে? তিনি বলেনঃ তোমরা সে দিনের সঠিক অনুমান করে নিবে এবং তদনুযায়ী নামায পড়বে। রাবী বলেন, আমরা জিজ্ঞেস করলাম, সে পৃথিবীতে কতো দ্রুত গতিতে বিচরণ করবে? তিনি বলেনঃ বায়ু চালিত মেঘমালার গতিতে। অতঃপর সে কোন এক সম্প্রদায়ের নিকট এসে তাদেরকে নিজের দলে ডাকবে। তারা তার ডাকে সাড়া দিবে এবং তার উপর ঈমান আনবে। অতঃপর সে আসমানকে বৃষ্টি বর্ষণের আদেশ দিবে এবং তদনুযায়ী বৃষ্টি বর্ষিত হবে। অতঃপর সে যমীনকে শস্য উৎপাদনের নির্দেশ দিবে এবং তদনুযায়ী ফসল উৎপাদিত হবে। অতঃপর বিকেল বেলা তাদের পশুপাল পূর্বের চেয়ে উচুঁ কুঁজবিশিষ্ট, মাংসল নিতম্ববিশিষ্ট ও দুগ্ধপুষ্ট স্তনবিশিষ্ট হয়ে (খোঁয়াড়ে) ফিরে আসবে। কিন্তু তারা তার আহবান প্রত্যাখ্যান করবে। ফলে সে তাদের কাছ থেকে ফিরে যাবে। পরদিন ভোরবেলা তারা নিজেদেরকে নিঃস্ব অবস্থায় পাবে এবং তাদের হাতে কিছুই থাকবে না। অতঃপর সে এক নির্জন পতিত ভূমিতে গিয়ে বলবে, তোর ভেতরের ভান্ডার বের করে দে। অতঃপর সে যেখান থেকে প্রস্থান করবে এবং তথাকার ধনভান্ডার তার অনুসরণ করবে, যেভাবে মৌমাছিরা রানী মৌমাছির অনুসরণ করে। অতঃপর সে এক পূর্ণ যৌবন তরুণ যুবককে তার দিকে আহবান করবে। তাকে সে তরবারির আঘাতে দ্বিখন্ডিত করে ফেলবে। তার দেহের প্রতিটি টুকরা দু’ ধনুকের ব্যবধানে গিয়ে পড়বে। অতঃপর সে তাকে ডাক দিবে, অমনি সে হাস্যোজ্জল চেহারায় তার কাছে এসে দাঁড়াবে। এমতাবস্থায় আল্লাহ তা‘আলা ঈসা ইবনে মরিয়ম (আ)-কে পাঠাবেন। তিনি হলুদ রং-এর দু’টি কাপড় পরিহিত অবস্থায় দু’জন ফেরেশতার পাখায় ভর করে দামিশকের পূর্ব প্রান্তের এক মসজিদের সাদা মিনারে অবতরণ করবেন। তিনি তাঁর মাথা উত্তোলন করলে বা নোয়ালে ফোঁটায় ফোঁটায় মণি-মুক্তার ন্যায় (ঘাম) পড়তে থাকবে। তার নিঃশ্বাস যে কাফেরকেই স্পর্শ করবে সে তৎক্ষণাৎ মারা যাবে। আর তার ‘‘লুদ্দ’’ নামক স্থানের দ্বারদেশে দাজ্জালকে হত্যা করবেন। অতঃপর আল্লাহর নবী ঈসা (আ) এমন এক সম্প্রদায়ে আসবেন যাদেরকে আল্লাহ তা‘আলা (দাজ্জালের অনিষ্ট থেকে) রক্ষা করেছেন। তিনি তাদের মুখমন্ডলে হাত বুলাবেন এবং জান্নাতে তাদের মর্যাদা সম্পর্কে বর্ণনা করবেন। তাদের এমতাবস্থায় আল্লাহ তা‘আলা তাঁর নিকট ওহী পাঠাবেন, হে ঈসা! আমি আমার এমন বান্দাদের পাঠাবো যাদের বিরুদ্ধে যুদ্ধ করার ক্ষমতা কারো নাই। অতএব তুমি আমার বান্দাদের তূর পাহাড়ে সরিয়ে নাও। অতঃপর আল্লাহ তা‘আলা ইয়াজূজ-মাজূজের দল পাঠাবেন। আল্লাহ তা‘আলার বাণী অনুযায়ী তাদের অবস্থা হলোঃ ‘‘তারা প্রতিটি উচ্চভূমি থেকে ছুটে আসবে ’’ (সূরা আম্বিয়াঃ ৯৬)। এদের প্রথম দলটি (সিরিয়ার) তাবারিয়া হ্রদ অতিক্রমকালে এর সমস্ত পানি পান করে শেষ করে ফেলবে। অতঃপর তাদের পরবর্তী দল এখান দিয়ে অতিক্রমকালে বলবে, নিশ্চয় কোন কালে এতে পানি ছিলো। আল্লাহর নবী ঈসা (আ) তাঁর সংগীগণসহ অবরুদ্ধ হয়ে পড়বেন। তারা (খাদ্যাভাবে) এমন এক কঠিন অবস্থায় পতিত হবেন যে, তখন একটি গরুর মাথা তাদের একজনের জন্য তোমাদের আজকের দিনের একশত স্বর্ণ মুদ্রার চেয়েও মূল্যবান (উত্তম) মনে হবে। তারপর আল্লাহর নবী ঈসা (আ) এবং তাঁর সাথীগণ আল্লাহর দিকে রুজু হয়ে দোয়া করবেন। তখন আল্লাহ তা‘আলা তাদের (ইয়াজূজ-মাজূজ বাহিনীর) ঘাড়ে মহামারীরূপে নাগাফ নামক কীটের সৃষ্টি করবেন। ভোরবেলা তারা এমনভাবে ধ্বংস হবে যেন একটি প্রাণের মৃত্যু হয়েছে। তখন আল্লাহর নবী ঈসা (আ) এবং তাঁর সাথীগণ (পাহাড় থেকে) নেমে আসবেন। তারা সেখানে এমন এক বিঘত জায়গাও পাবেন না, যেখানে সেগুলোর পচা দুর্গন্ধময় রক্ত-মাংস ছড়িয়ে নাই। তারা মহান আল্লাহর নিকট দোয়া করবেন। তখন আল্লাহ তা‘আলা তাদের নিকট উটের ঘাড়ের ন্যায় লম্বা ঘাড়বিশিষ্ট এক প্রকার পাখি পাঠাবেন। সেই পাখিগুলো তাদের মৃতদেহগুলো তুলে নিয়ে আল্লাহর ইচ্ছামত স্থানে নিক্ষেপ করবে। অতঃপর আল্লাহ তা‘আলা তাদের উপর এমন বৃষ্টি বর্ষণ করবেন যা সমস্ত ঘরবাড়ি, স্থলভাগ ও কঠিন মাটির স্তরে গিয়ে পৌঁছবে এবং সমস্ত পৃথিবী ধুয়ে মুছে আয়নার মত ঝকঝকে হয়ে উঠবে। অতঃপর যমীনকে বলা হবে, তোর ফল উৎপন্ন কর এবং তোর বরকত ফিরিয়ে দে। তখন অবস্থা এমন হবে যে, একদল লোকের আহারের জন্য একটি ডালিম যথেষ্ট হবে এবং একদল লোক এর খোসার ছায়াতলে আশ্রয় নিতে পারবে। আল্লাহ তা‘আলা দুধেও এতো বরকত দিবেন যে, একটি দুধেল উষ্ট্রীর দুধ একটি বৃহৎ দলের জন্য যথেষ্ট হবে। একটি গাভীর দুধ একটি গোত্রের লোকেদের জন্য যথেষ্ট হবে। একটি বকরীর দুধ একটি ক্ষুদ্র দলের জন্য যথেষ্ট হবে। তাদের এ অবস্থায় আচানক আল্লাহ তা‘আলা তাদের উপর দিয়ে মৃদুমন্দ বিশুদ্ধ বায়ু প্রবাহিত করবেন। এ বায়ু তাদের বগলের অভ্যন্তরভাগ স্পর্শ করে প্রত্যেক মুসলিমের জান কবয করবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		}
	]
}