{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4081,
			"arabicnumber": 4081,
			"text": "১১/৪০৮১। আবদুল্লাহ ইবনে মাসউদ (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিরাজ গমনের রাতে ইবরাহীম (আ), মূসা ও ঈসা (আ)-এর সাক্ষাত লাভ করেন। তাঁরা পরস্পর কিয়ামত সম্পর্কে আলোচনায় প্রবৃত্ত হন। তাঁরা প্রথমে ইবরাহীম (আ)-এর কাছে বিষয়টি সম্পর্কে জানতে চাইলে কিয়ামত সম্পর্কিত কোন জ্ঞান তাঁর ছিলো না। অতঃপর তাঁরা মূসা (আ)-কে জিজ্ঞেস করলে তাঁরও এ সম্পর্কে কোন জ্ঞান ছিলো না। অতঃপর বিষয়টি ঈসা ইবনে মরিয়ম (আ)-এর নিকট পেশ করা হলে তিনি বলেনঃ আমার থেকে কিয়ামতের নিকটবর্তী সময়ে দুনিয়াতে প্রত্যাবর্তনের প্রতিশ্রুতি নেয়া হয়েছে। কিন্তু কিয়ামতের সঠিক জ্ঞান আল্লাহ ব্যতীত কারো কাছে নেই। অতঃপর তিনি দাজ্জালের আবির্ভাবের কথা উল্লেখ করে বলেনঃ আমি দুনিয়াতে অবতরণ করবো এবং দাজ্জালকে হত্যা করবো। অতঃপর লোকেরা তাদের নিজ নিজ দেশে ফিরে যাবে। ইত্যবসরে তাদের নিকট ইয়াজূজ-মাজূজ আত্মপ্রকাশ করবে। তারা প্রতিটি উঁচু ভূমি থেকে ছুটে আসবে। তারা যে পানির উৎসের নিকট দিয়ে অতিক্রম করবে তা পান করে শেষ করবে। এরা যে বস্ত্তুর নিকট দিয়ে যাবে তা নষ্ট করে ফেলবে। তখন লোকেরা তাদেরকে মেরে ফেলার জন্য আল্লাহর নিকট চীৎকার করে ফরিয়াদ করবে এবং আমিও দোয়া করবো। ফলে পৃথিবী তাদের (গলিত লাশের) গন্ধে দুর্গন্ধময় হয়ে যাবে। ফলে আল্লাহ আসমান থেকে বৃষ্টি বর্ষণ করবেন, যা তাদের ভাসিয়ে নিয়ে সমুদ্রে নিক্ষেপ করবে। অতঃপর পাহাড়-পর্বত উৎপাটিত করা হবে, পৃথিবীকে প্রশস্ত করা হবে, যেমন চামড়া প্রশস্ত করা হয়। তারপর আমাকে বলা হলোঃ যখন এসব বিষয় প্রকাশিত হবে তখন কিয়ামত মানুষের এত নিকটবর্তী হবে যেমন গর্ভবর্তী নারী, যার পরিবারের লোকজন জানে না যে, কোন্ মুহূর্তে সে সন্তান প্রসব করবে। আওয়াম (রাঃ) বলেন, এ ঘটনার সত্যতা আল্লাহর কিতাবে বিদ্যমান আছেঃ ‘‘এমনকি যখন ইয়াজূজ ও মাজূজকে মুক্তি দেয়া হবে এবং এরা প্রতিটি উচ্চভূমি থেকে ছুটে আসবে’’ (সূরা আম্বিয়াঃ ৯৬)।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		}
	]
}