{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "৬/৪৩১২। আনাস ইবনে মালেক (রাঃ) থেকে বর্ণিত। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ কিয়ামতের দিন ঈমানদার বান্দারা সমবেত হবে। তখন তাদের অন্তরে ইলহাম করা হবে এবং তারা বলবে, কেউ যদি আমাদের প্রভুর নিকট আমাদের জন্য শাফাআত করতো তাহলে তিনি আমাদেরকে এ অবস্থা থেকে শান্তি দিতে পারতেন। অতএব তারা আদম আলাইহিস সালামের নিকট এসে বলবে, আপনি আদম, মানবজাতির পিতা। আল্লাহ নিজ হাতে আপনাকে সৃষ্টি করেছেন এবং তাঁর ফেরেশতাদের দ্বারা আপনাকে সিজদা করিয়েছেন। আপনি আমাদের এ অবস্থা থেকে নাজাতের জন্য আপনার প্রতিপালকের নিকট শাফাআত করুন। তিনি বলবেনঃ আমি তোমাদের এ কাজের উপযুক্ত নই। তিনি তাদের নিকট নিজের কৃত গুনাহের কথা উল্লেখ করে আক্ষেপ করবেন এবং এতে লজ্জিত হবেন। বরং তোমরা নূহ আলাইহিস সালামের নিকট যাও। কেননা তিনি ছিলেন পৃথিবীবাসীর প্রতি আল্লাহর প্রেরিত প্রথম রাসূল। অতএব তারা তাঁর নিকট উপস্থিত হবে। তিনি বলবেনঃ আমি তোমাদের এ কাজের উপযুক্ত নই। তিনি অজ্ঞাতে আল্লাহর নিকট যে নিবেদন করেছিলেন, তা স্মরণ করে লজ্জিত হবেন। বরং তোমরা দয়াময় রহমানের প্রিয় বান্দা ইবরাহীম আলাইহিস সালামের নিকট যাও। অতএব তারা তাঁর নিকট আসলে তিনি বলবেনঃ আমি তোমাদের এ কাজের যোগ্য নই। বরং তোমরা মুস আলাইহিস সালামের নিকট যাও। তিনি ছিলেন আল্লাহর প্রিয় বান্দা, তাঁর সাথে আল্লাহ বাক্যালাপ করেছেন এবং তাঁকে তাওরাত কিতাব দান করেছেন। অতএব তারা তাঁর নিকট উপস্থিত হবে। তিনি বলবেনঃ আমি তোমাদের এ কাজের যোগ্য নই। তিনি একটি অন্যায় হত্যাকান্ডের কথা স্মরণ করবেন। তোমরা বরং আল্লাহর বানদা ও রাসূল, তাঁর বাক্য, তাঁর দেয়া রূহ ঈসা আলাইহিস সালামের নিকট যাও। অতএব লোকেরা তাঁর নিকট এসে উপস্থিত হবে। তিনি বলবেনঃ আমি তোমাদের এ কাজের যোগ্য নই। বরং তোমরা মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নিকট যাও, যাঁর পূর্বাপর সমস্ত গুনাহ আল্লাহ ক্ষমা করে দিয়েছেন। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ তখন তারা আমার নিকট আসবে এবং আমি রওয়ানা হবো। রাবী বলেন, হাসান (রাঃ) -এর সনদে এই শব্দাবলী বর্ণিত আছেঃ তিনি বলেন, আমি মুমিনদের দু’টি সারির মাঝখান দিয়ে অগ্রসর হতে থাকবো। কাতাদা (রাঃ) বলেন, তারপর রাবী আনাস (রাঃ) থেকে বর্ণিত হাদীসের শব্দাবলীতে বর্ণনা করেছেন। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেনঃ আমি আমার প্রভুর নিকট (শাফাআতের) অনুমতি প্রার্থনা করবো এবং আমাকে অনুমতি দেয়া হবে। আমি তাঁকে দেখামাত্র সিজদায় লুটিয়ে পড়বো। আল্লাহ যতক্ষণ চাইবেন আমাকে সিজদাবনত অবস্থায় রাখবেন। অতঃপর নির্দেশ দেওয়া হবে, হে মুহাম্মাদ! মাথা উঠাও, বলো, শোনা হবে এবং চাও, দেয়া হবে, শাফাআত করো, কবুল করা হবে। অতএব তিনি যা আমাকে শিখিয়ে দিবেন সেই বাক্যে আমি তাঁর প্রশংসা করবো। অতঃপর আমি শাফাআত করবো। তবে আমার জন্য শাফাআতের একটি সীমা বেঁধে দেয়া হবে। আল্লাহ শাফাআতপ্রাপ্তদের জান্নাতে প্রবেশ করাবেন। আমি পুনরায় আমার প্রভুর নিকট ফিরে আসবো এবং তাঁকে দেখামাত্র সিজদায় লুটিয়ে পড়বো। আল্লাহ যতক্ষণ চাইবেন আমাকে সিজদাবনত রাখবেন। অতঃপর আমাকে বলা হবে, হে মুহাম্মাদ! মাথা উঠাও, বলো শোনা হবে; চাও দেয়া হবে; শাফাআত করো কুবল করা হবে। তিনি আমাকে যে বাক্য শিখিয়ে দিবেন, আমি সেই বাক্যে তাঁর প্রশংসা করবো, অতঃপর শাফাআত করবো। আমাকে একটি সীমা নির্দিষ্ট করে দেয়া হবে। আল্লাহ শাফাআতপ্রাপ্তদের জান্নাতে প্রবেশ করাবেন। আমি তৃতীয় বারের মত ফিরে যাবো এবং আমার প্রভুকে দেখামাত্র সিজদায় পতিত হবো। আল্লাহ যতক্ষণ চাইবেন আমাকে সিজদাবনত রাখবেন। অতঃপর বলা হবে, হে মুহাম্মাদ! মাথা উঠাও; বলো, শোনা হবে; প্রার্থনা করো, কবুল করা হবে; শাফাআত করো, মঞ্জুর করা হবে। আমি আমার মাথা উঠাবো এবং তাঁর শিখানো বাক্যে তাঁর প্রশংসা করবো এবং তারপর আমি শাফাআত করবো এবং আমাকে একটা সীমা বেঁধে দেয়া হবে। আল্লাহ শাফাআতকৃতদের জান্নাতে প্রবেশ করাবেন। আমি চতুর্থবার গিয়ে বলবো, হে প্রভু! কুরআন যাদের আটক করে রেখেছে তারা ব্যতীত আর কেউ অবশিষ্ট নেই। রাবী বলেন, কাতাদা (রাঃ) এই হাদীস বর্ণনা করে বলেছেন, আনাস ইবনে মালেক (রাঃ) আমাদে কাছে বর্ণনা করেছেন যে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ শেষে এমন ব্যক্তিকে জাহান্নাম থেকে রে করা হবে যে শুধু বলেছে, ‘‘লা ইলাহা ইল্লাল্লাহ’’ (আল্লাহ ব্যতীত কোন ইলাহ নেই) এবং যার অন্তরে একটি গমের দানা পরিমাণ নেক আমল থাকবে। আর এমন ব্যক্তিকেও জাহান্নাম থেকে বের করে আনা হবে যে বলেছে, ‘‘লা ইলাহা ইল্লাল্লাহ ’’ এবং যার অন্তরে থাকবে বার্লির দানা পরিমাণ নেক আমল (ঈমান)। এমন ব্যক্তিকেও জাহান্নাম থেকে বের করা হবে যে বলেছেঃ লা ইলাহা ইল্লাল্লাহু এবং যার অন্তরে অণু পরিমাণ নেক আমল থাকবে।",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 213
			}
		}
	]
}