{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"15": "Invoking Allah for Rain (Istisqaa)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1013,
			"arabicnumber": 1013,
			"text": "Enes İbn Malik (r.a.) şöyle demiştir: \"Resul-i Ekrem Sallallahu Aleyhi ve Sellem bir Cuma günü minber üzerinde ayakta hutbe okurken bir bedevî minberin karşısındaki kapıdan mescide girdi ve sonra Nebi Sallallahu Aleyhi ve Sellem'e doğru yönelip ayakta durarak şöyle seslendi: \"Ey Allah'ın Resulü, hayvanlar helak oldu, yollarımız kesildi perişan bir haldeyiz... Allah'a dua et de yağmur yağdırıp bizi bu sıkıntılardan kurtarsın.\" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ellerini kaldırdı ve üç defa: (Allah'ım bize yağmur gönder)\" dedi. Allah'a yemin ederim ki, o sırada gökyüzünde tek bir bulut bile görünmüyordu, bulut namına hiçbir şey yoktu. Hatta Sel' dağı ile aramızda bulutları görmemize engel olacak ne bir ev ne de bir yapı vardı. Bir süre sonra Sel' dağının ardından daire şeklinde bir bulut yükseldi. Bu bulut gökyüzünün tam ortasına gelince dağıldı ve sonra her taraf'a yayıldı. Sonra da yağmur yağmaya başladı. Vallahi bir hafta boyunca güneş yüzü görmedik. Bir sonraki Cuma yine Resul-i Ekrem Sallallahu Aleyhi ve Sellem ayakta hutbe okurken aynı kapıdan birisi girip Nebi Sallallahu Aleyhi ve Sellem'in karşısında durdu ve şöyle dedi: \"Ey Allah'ın Resulü, mallarımız helak oldu, yollarımız kesildi. Allah'a dua et de yağmurlar kesilsin!\" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem ellerini kaldırıp şöyle dua etti: \"Allah'ım, çevremize yağdır, üzerimize değil! Allah'ım, çevremizdeki dağlara, tepelere, vadilere ve bitkilerin - ağaçların yetiştiği yerlere yağdır!\" Resulullah Sallallahu Aleyhi ve Sellem bu şekilde dua edince yağmur kesildi ve biz mescid'den çıkıp güneşin altında yürüdük.\" Hadisin ravilerinden Şerîk Enes İbn Malik'e \"Yağmurun kesilmesi için Resulullah Sallallahu Aleyhi ve Sellem'den dua isteyen ile yağması için dua isteyen aynı kişi miydi?\" diye sormuş ve Enes ona: \"Bilmiyorum\" diye cevap vermiştir",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 8
			}
		}
	]
}