{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"16": "Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1052,
			"arabicnumber": 1052,
			"text": "Abdullah İbn Abbas (r.a.)'ın şöyle dediği nakledilmiştir: \"Resulullah Sallallahu Aleyhi ve Sellem zamanında güneş tutulmuştu. Bunun üzerine Nebi Sallallahu aleyhi ve sellem namaza başladı ve kıyamda Bakara suresi okunacak kadar uzun bir süre bekledi. Sonra rükuya gidip uzun bir müddet rü-kuda bekledi. Ardından doğruldu ve ilk kıyam kadar olmasa da uzun bir süre kıyamda bekledi. Sonra yeniden rükuya gitti ve ilk rüku kadar olmasa da uzun bir süre rükuda durdu. Sonra secde edip kalktı. Bu kıyamda da ilk kıyamdaki kadar olmasa da uzun bir müddet bekledi. Ardından rükuya gitti ve İlk rüku kadar olmasa da uzun bir süre rükuda bekledi. Sonra kalktı ve ilk kıyam kadar olmasa da uzun bir süre kıyamda durdu. Ardından rükuya vardı ve ilk rüku kadar olmasa da uzun bir müddet rükuda bekleyip secdeye gitti. Namazı bitirdiğinde güneş de açılmıştı. Namaz bitince Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Ay ve güneş Allah'ın birer ayetidir. Bunlar ne bir kimsenin ölümü ne de hayatı yüzünden tutulurlar. Eğer ay ve güneşin tutulduğunu görürseniz Allah'ı zikredin!\" Ashab-ı kiram, Nebi Sallallahu Aleyhi ve Sellem'e: \"Ey Allah'ın Resulü, namazda durduğunuz yerde sanki bir şeyi alır gibi uzandığınızı gördük. Fakat sonra geri çekildiniz\" diye sorunca Resulullah Sallallahu Aleyhi ve Sellem şöyle cevap verdi: \"Ben cenneti gördüm ve bir üzüm salkımı almaya uzandım. Eğer onu alsaydım dünya durduğu müddetçe onu yiyecektiniz. Sonra cehennemi de gördüm. Ben bu günde gördüğüm manzara kadar korkunç bir tablo daha önce hiç görmemiştim. Ben cehennemliklerin çoğunun kadın olduğunu gördüm.\" Sahabîler bunun sebebini sorunca Resulullah Sallallahu Aleyhi ve Sellem: \"İnkarları (küfr) sebebiyle\" buyurdu. Ashab: \"Onlar Allah'ı mı inkar (küfr) ediyorlar?\" diye tekrar sorunca Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Kocalarına karşı nankörlük ediyorlar, yapılan iyiliği inkar ediyorlar. Sen onlardan birisine dünyaları bağışlasan fakat daha sonra bu kadın senin bir açığını görse hemen şöyle der; Ben senden şimdiye kadar ne hayır gördüm ki!\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		}
	]
}