{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1166,
			"arabicnumber": 1166,
			"text": "Câbir(radıyallahü anh) şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) bizlere Kur'ân'dan sûre öğretir gibi, işlerin hepsinde îstihâre'yi öğretirdi, \"Her biriniz bir işe kasdettiği zaman, farz olmayarak iki rek'at namaz kılsın, sonra şu duayı söylesin; innî estehîruke bi-ilmike ve estakdiruke bi-kudretike ve es 'eluke min fadlike’l-azîm. Feinneke takdiru velâ akdiru ve ta’lemu velâ a'lemu ve ente allâmu'l-ğuyüb. in kunte ta'lemu enne hâzel-emre hayrun lîfîdînî ve meâşî ve akıbeti emri -yahut da şöyle buyurdu: Âcili emrî ve ecilihi-fakdurhu lî ve yesserhu lî Summe bârik lî fîhî. in kunte ta'lemu enne hâzel-emre şerrun lî fî dînî ve meâşî ve akıbeti emrî -yahut şöyle buyurdu: Fî âcili emrî ve ecilihî- fasrifhu annî vasrifnî anhu, vakdur liye'l-hayra haysu kâne summe ardınî bihî desin\" buyurdu. İstihare eden kimse duanın \"bu iş\" lâfzı yerinde, kendi hacetini adiyle anar, demiştir. Duanın tercemesi şöyledir: \"Yâ Allah, bildiğin için Sen'den hayırlısını dilerim. Gücün yetiştiği için Sen'den beni kudretlendirmeni dilerim. Hayırlı olanın beyân ve takdirini Sen'in o büyük fadlından isterim. Çünkü Sen'in (her şeye) gücün yeter; benim ise gücüm yetmez. Sen (her şeyi) bilirsin; ben ise bilmem. Ve Sen bütün gaybları pek yakından bilensin! Yâ Allah, şu işin dînim, hayâtım ve âhiretim -yahut şöyle der: dünyâ ve âhiret işim hususunda bana hayırlı olduğunu bilmekte isen (yânı; Sen'in ilminde böyle olduğu kararlaşmış ise) bunu bana mukadder kıl ve bunu bana kolaylaştır. Sonra müyesser kıldığın bu işte bana bereketler ihsan eyle! şu işin dînim, yaşayışım ve âhiretim -yahut şöyle der: dünyâ ve âhiret işim hususunda benim için bir şerr olduğunu bilmekte isen, bu işi benden; beni de o işten çevir. Ve hayr her nerede ise, onu benim için makdûr (ve müyesser) kıl. Sonra da beni bu hayrdan râzî kıl",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 45
			}
		}
	]
}