{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"19": "Prayer at Night (Tahajjud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "İbn Şihâb şöyle demiştir: Bana Mahmûd ibnu'r-Rabî' el-Ensârî haber verdi ki, o Rasûlüllah'ı akledip hatırlamış ve kendi yurdlarında bulunan bir kuyudan Rasûlüllah'ın ağzına su alıp kendi yüzüne doğru su püskürttüğünü de hatırlamıştır. bu Mahmûd, Itbân ibn Mâlik el-Ensârî (radıyallahü anh)'den işitmiştir. It-bân Bedr'de Rasûlüllah'ın maiyyetinde hazır bulunmuşlardan idi. Itbân şöyle diyordu: Salim oğulları'nda kendi cemâatime namaz kıldırırdım. Onlarla benim aramda bir dere vardı ki, yağmurlar geldiği zaman aramıza perde oluyor ve onların mescidi tarafına geçmek bana meşakkat veriyordu. Rasûlüllah'a geldim ve O'na şöyle dedim: Ben gözümden hoşnûd değilim. Benimle cemâatim arasında bulunan dere, yağmurlar geldiği zaman akıyor ve bana o dereyi geçmek meşakkatli oluyor. Arzu ettim ki, Sen gelesin de evimden bir yerde namaz kıldırsan; ben de orayı namazgâh edinsem! aleyhi ve sellem): \"Bunu yapacağım\" dedi. Ertesi sabah gündüz şiddetlendikten(yani güneş yükseldikten) sonra Rasûlüllah ile Ebû Bekr bana geldiler.Rasûlüllah içeri girmeye izin istedi. Ben de O'na izin verdim. Eve girdiğinde oturmadı da \"Evinden nerede namaz kılmamı istersin?\" buyurdu. Ben kendisine, içinde namaz kılmasını arzu etmekte olduğum yeri işaret edip gösterdim. Rasûlüllah namaza dikeldi ve tekbîr aldı. Biz de O'nun arkasında saff olduk. İki rek'at kıldırdı, sonra selâm verdi. O selâm verdiği zaman biz de selâm verip, namazdan çıktık. Ben Rasûlüllah için yapılmış olan bir hazîr yemeğini yemesi gayesiyle O'nu alıkoydum. Yurdun ahâlîsi Rasülullah'ın benim evimde bulunduğunu işittiler. Yurd ahâlîsinden birçok kimseler geldiler ve nihayet evde adamlar çok oldu. Onlardan biri: Mâlik (ibnu'd-Duhşun) ne yapıyor, ben onu görmüyorum? dedi. Oradakilerden biri: O Allah ve Rasûlü'nü sevmeyen bir münafıktır, dedi. Rasûlüllah da ona: \"Böyle deme! Görmüyor musun ki, o Lâ ilahe ille’llâh لاَ إِلَهَ إِلاَّ اللَّهُ‏.‏(Muhammed Rasûlüllah) diyor ve bununla Allah'ın rızâsını taleb ediyor\" buyurdu. O söyleyen de: Allah ve Rasûlü en bilendir. Amma bize gelince, Allah'a yemîn ederiz ki, biz O'nun sevgisinin ve sözlerinin (yani nasîhatlerinin) ancak münafıklara olduğunu görüyoruz, dedi. Rasûlüllah da: \"Şübhesiz Allah, Allah'ın rızâsını arayarak Lâ ilahe ille’llâh diyen kimseyi ateşe haram etmiştir\" buyurdu. şöyle demiştir: Ben bu kıssayı bir topluluğa söyledim. İçlerinde Rasülullah'ın sahibi Ebû Eyyûb da vardı. Ebû Eyyûb'un vefat etmiş olduğu Rûm diyârındaki bu gazvede, Muâviye'nin oğlu Yezîd onların üzerinde kumandan bulunuyordu. Ebû-Eyyûb, benim sözümü reddetti ve: Vallahi Rasülullah'ın senin söylediğini söylemiş olduğunu zannetmem, dedi. Bu söz bana çok ağır geldi. Ve: Eğer Allah bana selâmet verir de, bu gazvemden salimen dönersem ve Itbân ibn Mâlik'i kendi kavminin mescidinde hâlâ hayâtta bulursam, bu hadîsi kendisine tekrar sormaklığım üzerimde Allah hakkı olsun demeğe başladım. Nihayet Bizans seferinden döndüm. Hacc yahut umre niyetiyle ihrama girdim. Sonra yürüdüm ve Medine'ye geldim. Salim oğulları yurduna vardım. Baktım ki Itbân gözleri görmez, çok yaşlı bir ihtiyar; hâlâ kavmine namaz kıldırıyor. Namazdan selâm verince ben de ona selâm verdim ve benim kim olduğumu kendisine haber verdim. Akabinde ona bu hadîsi sordum. Bunun üzerine Itbân bana bu hadîsi, ilk defa tahdîs ettiği gibi tekrar tahdîs etti",
			"grades": [],
			"reference": {
				"book": 19,
				"hadith": 62
			}
		}
	]
}