{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"22": "Forgetfulness in Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "(İbn Abbâs'ın kölesi Kureyb şöyle demiştir:) İbn Abbâs, Mısver ibn Mahrame ve Abdurrahmân ibn Ezher -Allah onlardan razı olsun- ben Kureyb'i, Âişe'ye gönderdiler de: Hepimizden Âişe'ye selâm söyle ve ona ikindinin farzından sonraki iki rek'at nafile namazın hükmünden sor; ve ona: \"Bu namazı senin kılmakta olduğundan haberdâr olduğumuzu, Halbuki Peygamber (sallallahü aleyhi ve sellem)'in bu iki rek'at namazdan sahâbîleri men' ettiği haberinin bize ulaştığını\" söyle dediler. İbn Abbâs(ilâve olarak): Ben, Omer ibn Hattâb ile beraber halktan böyle iki rek'at namaz kılan insanları döverdim, demişti. dedi ki: Ben Âişe'nin yanına girdim ve beni gönderenlerin benimle yolladıkları haberi kendisine tebliğ ettim.Âişe bana cevaben: Sen bu mes'eleyi Ümmü Seleme'ye sor, dedi. Ben de yanından çıktım ve o üç zâta gelip, Âişe'nin cevâbını onlara haber verdim. Onlar beni Âişe'ye gönderdikleri gibi, bu defa da Ümmü Seleme'ye gönderdiler. Seleme(radıyallahü anha) şöyle dedi: Ben, Peygamber (sallallahü aleyhi ve sellem)'den, halkı ikindiden sonraki bu namazdan nehyederken işittim. Sonra bir kerre de Peygamber'i, ikindi namazını kıldığı sırada iki rek'at namaz daha kılarken gördüm. Şöyle ki: Rasûlüllah benim odama girmişti. Fakat -o sırada yanımda Ensâr'dan, Haram oğullarından bir takım kadın konuklar bulunuyordu. Rasûlüllah namaz kılmağa başladı. O'nun böyle ikindinin akabinde benim yanıma girmesinden sonra namaz kıldığını görünce kendisine bir kız gönderdim ve kıza: Rasûlüllah'ın yanında dur:\"Yâ Rasûlallah! Sana Ümmü Seleme, şu iki rek'at namazdan nehyettiğini işittim, Halbuki şimdi seni onları kılıyorsun görüyorum\" diye soruyor de! Eğer Rasûlüllah (namazda bulunduğuna) eliyle işaret ederse, yanından geri çekil, dedim. Kız bu emrimi yerine getirdi. Ve hakîkaten Rasûlüllah eliyle işaret etti; kız da O'ndan geri çekildi. namazdan ayrılınca bana hitaben: ''Ey Ebâ Ümeyye kızı! İkindi namazından sonra kıldığım iki rek'at namazdan sormuştun. Bunun sebebi şudur: Bana Abdu’l-Kays kabilesinden bir takım insanlar gelmişti. Bunlar, şu öğle namazından sonraki iki rek'at (nâfile) namazdan beni meşgul edip alıkoymuşlardı. İşte kıldığım iki rek'at namaz, öğlenin o iki rek'at son sünnettidir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		}
	]
}