{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"22": "Forgetfulness in Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1233,
			"arabicnumber": 1233,
			"text": "(İbn Abbas r.a.'ın kölesi Kureyb'den rivayet edilmiştir): İbn Abbas, Misver İbn Mahreme ve Abdurrahman İbn Ezher r.a. (Kureyb'i) Aişe r.anha'ya göndererek şöyle dediler: \"Ona hepimizden selam söyle ve ona ikindi namazından sonra kılınan iki rekatı sor. Ona de ki: Bize senin bunu kıldığın anlatılıyor, oysa bize Nebi'in bunu yasakladığı haberi ulaşmıştı. (İbn Abbas dedi ki: \"Ben, Ömer İbn el-Hattab ile birlikte halk'tan bu iki rekat namazı kılanları döverdim).\" Kureyb dedi ki: Aişe r.anha'nın yanına gittim ve ona bana söyledikleri şeyi ilettim. Aişe: \"Bunları Ümmü Seleme'ye sor\" dedi. Ben onun yanından çıkarak beni gönderenlerin yanına geri döndüm ve Aişe'nin sözünü onlara söyledim. Onlar da beni Aişe r.anha'ya sormamı istedikleri şeyleri Ümmü Seleme r.anha'ya sormam için geri gönderdiler. Ümmü Seleme r.anha şöyle dedi: Nebi Sallallahu Aleyhi ve Sellem'in bunu yasakladığını duydum. Sonra onun ikindiyi kıldıktan sonra bu iki rekat'ı kıldığını da gördüm. Sonra yanımda ensardan Benî Haram kabilesinden kadınlar var iken Nebi s.a.v. odama girdi. Ben cariyemi onun yanına göndererek şöyle dedim: Onun yanında durarak ona şunu söyle: \"Ey Allah'ın Resulü! Ümmü Seleme sana diyor ki: Senin bu iki rekatı kılmayı yasakladığını duydum, oysa sen bunları kılıyorsun.\" Bunu söyledikten sonra eliyle işaret ederse onun gerisinde dur. (Ümmü Seleme dedi ki) Cariye bunları yaptı, Nebi s.a.v. de eliyle işaret etti. Cariye geride durdu. Nebi Sallallahu Aleyhi ve Sellem namazını bitirince şöyle dedi: \"Ey Ebû Ümeyye'nin kızı! İkindiden sonra kıldığım iki rekatı sordun. Bana Abdülkays kabilesinden bazı kimseler geldiler. Ben onlarla meşgul olduğumdan öğle namazından sonra kıldığım iki rekatı kılamadım. İşte (ikindiden sonra kıldığım) o iki rekat bu (öğle namazından sonra kılmam gerektiği halde kılamadığım) iki rekattır. Tekrar: 4370",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		}
	]
}