{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1241,
			"arabicnumber": 1241,
			"text": "… ez-Zuhrî şöyle demiştir: Bana Ebû Seleme haber verdi. Ona da peygamberin zevcesi Âişe(r. anha) haber verip şöyle demiştir:( Peygamberin vefatı üzerine) Ebu Bekr, Sunh’daki meskeninden atına binip geldi. Atından inip mescide girdi. Mesciddeki insanlarla konuşmadı. Doğru Âişe'nin odasına girdi. Hemen Peygamber'e yaklaştı. Peygamber'in yüzü Yemânî bir bürde ile örtülü idi. Yüzünden örtüyü açtı. Sonra üzerine kapandı ve O'nu öptü; sonra ağladı. Bunun ardından: Yâ Nebiyallah! Bâbam sana feda olsun. Allah sana bu ölüm şiddetinden başka ikinci bir ölüm vermeyecektir. Sana yazılmış olan bu mukadder ölüm geçidini ise şimdi geçmiş bulunuyorsun, dedi. Ebû Seleme şöyle dedi: İbn Abbâs da bana şunu haber verdi. Ebû Bekr, Âişe'nin odasından çıktı. O sırada Omer insanlara birşeyler söylüyordu. Ebû Bekr ona: Otur, dedi. Omer(dehşetinden) oturmadı. Ebû Bekr tekrar: Otur, dedi. yine oturmadı. Bunun üzerine Ebû Bekr yüksek sesle şehâdet getirdi. Bu sırada halk Omer'i bırakıp, Ebû Bekr'in yanına geldiler. Ebû Bekr Allah'a hamd ve sena ettikten sonra, şunları söyledi: Amma ba'du: Sizden her kim Muhammed'e ibâdet ediyor idiyse, bilsin ki, Muhammed ölmüştür. Her kim de Allah'a ibâdet ediyorsa, bilsin ki, Allah diridir, ölümsüzdür. Yüce Allah şöyle buyurdu: “Muhammed ancak bir rasûldür. O 'ndan evvel daha nice rasûller gelip geçmiştir. Şimdi O, ölür yahut öldürülürse ökçelerinizin üstünde (gerisin geri) mi döneceksiniz? Kim böyle iki ökçesi üzerinde (ardına) dönerse elbette Allah 'a hiçbir şeyle zarar yapmış olmaz. Allah şükr (ve sebat) edenlere mükâfat verecektir\" (Âl-i İmrân: 144). Abbâs rivayetine devamla: Allah'a yemin ederim ki, Ebû Bekr bu âyeti okuyuncaya kadar sahâbîler hayretlerinden bu âyeti hiç bilmiyorlarmış gibi idiler. Sanki Allah bu âyeti yeni indirmişti de, onlar Ebû Bekr'den yeni duyup öğreniyorlardı. Her işiten sahâbî muhakkak âyeti (hayret içinde) kendi diliyle okuyordu",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}