{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"23": "Funerals (Al-Janaa'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "İbn Şihâb ez-Zuhrî şöyle demiştir: Her ölen çocuğa, zina eden bir kadına âid olsa bile, cenaze namazı kılınır. Çünkü o çocuk İslâm fıtratı üzere yaratılmış olup, o fıtrat üzere doğurulmuştur. Onun anasıyle Bâbası yahut anası gayrı müslim olsa bile, bilhassa Bâbası müslümân olduklarını iddia ederlerse o çocuk doğum sırasında ağlayarak doğmuş ise, ona namaz kılınır. Böyle hayât emaresi izhâr etmeyerek, yani ağlamayarak doğan çocuğa, eksik ve hamil müddeti tamam olmadan düşük bir cenîn olarak doğduğu için namaz kılınmaz. Çünkü Ebû Hureyre (radıyallahü anh) şu hadîsi tahdîs edip durmuştur: aleyhi ve sellem) şöyle buyurdu: \"Her doğan çocuk muhakkak fıtrat üzere doğar. Sonra anasıyle Bâbası onu Yahûdî yahut Nasrânî yahut Mecûsî yaparlar. Nasıl ki, kusursuz doğurulan her hayvan yavrusu, organları tam olarak doğar. Siz hiç o yavrunun burnunda, kulağında eksik, kesik birşey hisseder misiniz?\" sonra Ebû Hureyre: “O hâlde sen yüzünü bir muvahhid olarak dîne, Allah'ın o fıtratına çevir ki, O, insanları bunun üzerine yaratmıştır. Allah’ın yaratışına hiçbir şey bedel olamaz. Bu, dimdik ayakta duran bir dîndir. Fakat insanların çoğu bilmezler”(er-Rûm: 30) âyetini söyler idi.. Şihâb ez-Zuhrî şöyle demiştir: Bana Ebû Seleme ibnu Abdirrahmân haber verdi ki, Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûluilah (sallallahü aleyhi ve sellem) şöyle buyurdu: çocuk ancak fıtrat üzere dünyâya getirilir. Bundan sonra anası Bâbası (Yâhûdî ise) onu Yahûdîyaparlar, (Nasrânî ise) onu Nasrânî yaparlar,(Mecûsî ise) onu Mecûsî yaparlar. Nitekim kusursuz doğan bir hayvan yavrusu içinde siz kulağı, dudağı, burnu, ayağı kesik olanını hiç görüyor musunuz?\" sonra Ebû Hureyre (radıyallahü anh) şu âyeti söylerdi: \"O hâlde sen yüzünü bir muvahhid olarak dîne, Allah'ın o fıtratına çevir ki, O, insanları bunun üzerine yaratmıştır. Allah 'ın yaratışına (hiçbir şey) bedel olamaz. Bu, dimdik ayakta duran bir dîndir. Fakat insanların çoğu bilmezler\" (er-Rûm: 30)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 111
			}
		}
	]
}