{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "Bize Ayyaş ibnu'l-Velîd tahdîs edip şöyle dedi: Bize Abdu'l-A'lâ tahdîs edip şöyle dedi: Bize el-Cuveyrî, Ebu'l-A'lâ'dan tahdîs etti ki, el-Ahnef ibn Kays: Ben bir topluluğun yanına oturdum... demiştir. ve yine bana İshâkibnu Mansûr tahdîs edip şöyle dedi: Bize Abdussamed haber verip şöyle dedi: Bana Bâbam Abdu'l-vâris tahdîs edip şöyle dedi: Bize el-Cuveyrî tahdîs edip şöyle dedi: Bize Ebu'l-A'lâ ibnu'ş-Şıhhîr tahdîs etti. Onlara da el-Ahnef ibn Kays tahdîs edip şöyle demiştir: Ben Kureyş ileri gelenlerinden bir cemâatin yanına oturdum. Bu sırada sert saçlı, sert elbiseli ve sert görünüşlü bir kimse geldi; nihayet o topluluğun yanında dikeldi ve onlara selâm verdi. Sonra: Altın ve gümüşleri biriktirip infâk etmeyenlere, üzeri cehennem ateşinde kızdırılmış taşlardan haber ver. Sonra bu taşlar, onlardan her birinin memesi ortasına konulur, nihayet iki kürek kemiğinden çıkar. Kürek kemikleri üzerine konulur; nihayet memeleri ortasından dışarı çıkar. Böylece kürek kemikleri ile memeleri arasında gider gelir, dedi. Bunları söyledikten sonra o zât geri döndü ve direğin yanına oturdu. Ben de onun arkasından gittim ve yanına oturdum. Ben onun kim olduğunu bilmiyordum. Ona: Ben bu insanların senin söylediğin sözlerden hoşlanmadıklarını sanıyorum, dedim. O cevaben: Onlar hiçbir şeyi akıl etmiyorlar. bana şöyle buyurdu, dedi. Ben: Senin dostun kimdir? Dedim. Peygamber'dir, dedi. Peygamber(sallallahü aleyhi ve sellem): \"Yâ Ebâ Zerr! Uhud Dağı'nı görüyor musun?\" dedi. Ebû Zerr dedi ki: Rasûlüllah bir ihtiyâcı için beni oraya gönderecek zannederek, gündüzden ne kadar zaman kaldı diye güneşe baktım ve evet Uhud'u görüyorum, dedim. Rasûlüllah: \"Uhud Dağı gibi altınım olup, üç dînâr hâriç, bunun hepsini infâk etmek isterim\" buyurdu. Bu insanlar ise akıl etmiyorlar; ancak dünyâ metâ'ı topluyorlar. Allah'a yemîn ederim ki, ben Allah'a kavuşuncaya kadar onlardan hiçbir dünyâ metâ'ı istemem ve onlara dînden bir şey de sormam",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}