{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1481,
			"arabicnumber": 1481,
			"text": "Ebû Humeyd es-Sâidî(radıyallahü anh) şöyle demiştir: Biz, Peygamber'in beraberinde Tebük gazvesine gittik. Peygamber Vâdî'l-Kurâ'ya vardığı zaman, kendi bahçesinde çalışan bir kadına tesadüf etti. Peygamber (sallallahü aleyhi ve sellem) sahâbîlerine: \"Şu bahçedeki hurmayı tahmin ediniz\" buyurdu. tahmîn ettik.) Rasûlüllah da on vesk tahmîn etti. Akabinde bahçe sahibesi olan kadına: \"(Hurma toplarken) buradan ne kadar kîle hurma çıkacağını say!\" buyurdu. geldiğimizde Rasûlüllah: \"Dikkat ediniz! Bu gece muhakkak şiddetli bir rüzgâr esecektir. Sakın kimse bulunduğu yerden ayağa kalkmasın! Beraberinde devesi olan da devesini sıkı bağlasın!\" buyurdu. emir üzerine biz de develerimizi sıkı bağladık. Ve (hakîkaten o gece) şiddetli bir rüzgâr esti. O sırada birisi ayağa kalkmıştı. Rüzgâr onu Tayy Dağı'na sürükleyip attı. Bu sefer sırasında Eyle Meliki, Peygamber'e (Düldül adlı) beyaz bir katır hediye etmiş ve bir bürde giydirmişti. Peygamber de bu Melike deniz kenarındaki beldeleri halkı için bir emir-nâme yazdırmıştı. Vâdî'l-Kurâ'ya gelince, hurmalık sahibesi olan kadına: \"Bahçen ne mıkdâr hurma getirdi?\" diye sordu. O: Allah Elçisi'nin tahmîni veçhile on vesk getirdi, dedi. Nihayet (sefer hey'eti Medîne'ye yaklaşınca) Peygamber: \"Ben Medine'ye (yetişmek için)acele edeceğim. Sizden her kim benim beraberimde bir ân evvel Medîne'ye varmak isterse acele etsin!\" buyurdu. dedi ki:) İbn Bekkâr burada bir söz söyledi ki, ma'nâsı şöyledir: Peygamber Medîne'ye yaklaşıp, uzaktan görünce de (eliyle işaret edip): \"İşte Tâbe!\". buyurdu. görünce de: \"İşte dağcağız! Uhud bizleri sever, biz de onu severiz!\" buyurdu. berâberindekilere:) \"Dikkat edin! Sizlere Ensâr mahallelerinin en hayırlısını haber vereyim!\" buyurdu. Evet, haber ver! dediler. Rasûlüllah: \"(Evvelâ) Neccâr oğulları yurtları, sonra Abdu'l-Eşhel oğulları yurtları, sonra Sâide oğulları yurtları, yahut el-Hâris ibnu 'l-Hazrec oğulları yurtları ve (hulâsa) bütün Ensâr yurtlarında hayır vardır\" buyurdu. Süleyman ibn Bilâl şöyle dedi: Bana Arar: \"Sonra el-Hâris oğulları yurdu, sonra Benû Sâide yurdu\" diye tahdîs etti. yine bu Süleyman ibn Bilâl, Sa'd ibn Saîd'den; o da Umâre-tu'bnu Gaziyye'den; o da Abbâs'tan; o da bâbası Sehl ibn Sa'd'dan şöyle dedi: Peygamber(sallallahü aleyhi ve sellem): \"Uhud öyle bir dağdır ki, o bizi sever, biz de onu severiz\" buyurmuştur. Abdillah el-Buhârî dedi ki: Üzerinde çepçevre ihata duvarı bulunan her bustân hadîkadır. Üzerinde çevreleyen duvar, çit bulunmayana hadîka denilmez",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}