{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "Abdullah ibn Abbâs (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) gerek kendisi, gerek sahâbîleri saçlarını taradıkları, güzel kokular sü­ründükleri, (en güzel) izâr ve ridâlarını giydikten sonra Medine'den (öğle ile ikindi arasında Veda Haccı için) yola çıktılar. Peygamber, giyilmesi âdet olan ridâlar ve izârlardan hiçbirşeyi giymekten kimse­yi men' etmedi. Yalnız(kokusu ve rengi) vücûda bulaşacak derecede zağferânlı libâsın giyilmesini nehyetmişti. Bu büyük hacc topluluğu, gündüzün Zu’l-Huleyfe'ye vardı. (Öğle namazını orada kıldı ve Zu'l-Huleyfe'de geceledi. Sabahleyin) Peygamber devesine bindi. Beydâ Dağı'na yükselince, Peygamber ve sahâbîleri tehlîl ve telbiye ettiler. Peygamber kurbanlık devesine kılâde (yani gerdanlık) takdı ve kur­banlık nişânıyle nişanladı. Bu telbiye ve kılâde işleri Zu'l’ka'de'den beş gün kala (ayın yirmi beşinde) olmuştu. Nihayet Zu’l-hicce'nin dör­düncü günü Peygamber Mekke'ye vardı. Beyt'i tavaf, Safa ile Merve arasında sa'y etti. Kurbanlık develerine nişan taktığı için de artık o hayvanlar kurbanlık bedene olduklarından dolayı, Peygamber ih­ramdan çıkmadı. Tavaf ve sa'ydan sonra Peygamber hacca telbiye edici olarak Mekke'nin yüksek tarafındaki Hacûn mevkiine konak­ladı, Ka'be'yi tavaf ettikten sonra, artık tâ Arafat'tan dönünceye kadar Ka'be'ye bir daha yaklaşmadı. Peygamber sahâbîlerine, Beyt'i tavaf etmelerini, Safa ile Merve arasında sa'y etmelerini, sonra da saçları­nı kısaltmalarını, bundan sonra da ihramdan çıkmalarını emreyledi. Peygamber'in bu emri, beraberinde kılâdelediği bir kurbanlığı bulun­mayan kimseler içindi. Böyle bir kimse ihramdan çıktığında, berabe­rinde zevcesi varsa, artık zevcesi kendisine halâldır(yani onunla cinsî münâsebeti halâldır). Güzel koku sürünmesi, (mu'tâd olan) elbisele­rini giymesi de halâldır",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		}
	]
}