{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1560,
			"arabicnumber": 1560,
			"text": "Aişe (r.anha) şöyle anlatır: \"Hac ayları içinde Resulullah Sallallahu Aleyhi ve Sellem ile yolculuğa çıktık. Serif adlı yere gelip konaklamıştık. Bu sırada Nebi Sallallahu Aleyhi ve Sellem ashabına doğru yönelerek, \"Yanında hedy kurbanı bulunmayanlardan umre yapmak isteyenler yapsın. Hedy kurbanı olanlar ise yapmasın\" buyurdu. Sahabilerden bir kısmı böyle bir kısmı diğer şekilde yaptı. Hz. Nebi ve bir grup sahabi güç kuvvet sahibi idi ve yanlarında hedy kurbanı bulunduğu halde (haccı bozup) umre yapamadılar. Bu sırada Resuİullah Sallallahu Aleyhi ve Sellem yanıma geldi. Ben ağlamaktaydım. \"Ey hanım! neden ağlıyorsun?\" diye sordu. Ben de, \"Sahabilere söylediğin sözleri duydum. Benim umre yapmam yasakmış\" dedim. Nebi Sallallahu Aleyhi ve Sellem bana neden olduğunu sorunca, \"Namaz kılamıyorum\" (adetliyim) diye cevap verdim. Bunun üzerine Resuİullah Sallallahu Aleyhi ve Sellem, \"Zararı yok. Sen de, Allah'ın diğer kadınlar hakkında koymuş olduğu kanun üzere Adem'in kızlarından birisin. Sen haccını yap. Umulur ki Allah seni (bir umre ile) rızıklandırır\" buyurdu. Hac yapmak üzere yola çıktık. Mina'ya geldiğimiz zaman temizlenmiştim. Mina'dan çıktım ve ifada tavafı yaptım. Mina'dan son dönüşte (Zilhicce'nin 13. günü) Resulullah Sallallahu Aleyhi ve Sellem ile birlikte yola çıktım. Muhassab adlı yerde konakladık. Hz. Nebi Abdurrahman İbn Ebû Bekir'i çağırdı ve: \"Kardeşini harem bölgesinden al götür. Umre için ihrama girsin. Umreyi tamamlayın. Daha sonra onu buraya getir. Siz gelinceye kadar burada bekliyorum\" buyurdu. Daha sonra Abdurrahman ile birlikte çıktık. Umreyi ve tavafı tamamladıktan sonra seher vakti Nebi Sallallahu Aleyhi ve Sellem'in yanına geldim. Bize, \"Tamamladınız mı?\" diye sordu. Ben de, \"Evet\" dedim. Bunun üzerine insanlara yola çıkılacağı yönünde duyuru yaptırdı. Sahabiler de yola çıktılar. Nebi Sallallahu Aleyhi ve Sellem de Medine'ye doğru yola koyuldu",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		}
	]
}