{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"25": "Hajj (Pilgrimage)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "Buhârî dedi ki: Bana Amr ibn Alî söyledi: Bize Ebû Âsım en-Nebîl(212) tahdîs etti : İbn Cureyc(150) şöyle dedi: Bana Atâ ibn Ebî Rebâh (114) haber verdi: îbnu Hişâm (Hacc emirliği sırasın­da) kadınların erkeklerin beraberinde tavaf etmelerini men' ettiği za­man bu Atâ, (İbrâhîm ,ibn Hişâm'a veya kardeşi Muhammed ibn Hişâm'a): Peygamber'in kadınları erkeklerin beraberinde tavaf et­miş oldukları hâlde, sen bu kadınları nasıl men' edersin? demiştir. İbn Cureyc dedi ki: Ben Atâ'ya: Kadınların, erkeklerin beraberinde yaptıkları o tavafları, hicâb âyetinin (el-Ahzâb: 35) inişinden sonra mı, yâhud evvel miydi? diye sordum. Atâ: Evet, ömrüme yeminle söylü­yorum, ben hicâb âyetinden sonra o kadınların, erkeklerin berabe­rinde tavaf ettiklerine eriştim, dedi. Cureyc dedi ki: Ben Atâ'ya: Kadınlar erkeklere nasıl karışırlar? diye sordum. Atâ: Kadınlar erkeklere karışmazlardı. Âişe (radıyallahü anha) erkeklerden ayrı bir yerde tavaf eder ve erkeklere karışmazdı. Âişe ile beraber tavaf eden (Dıkre isminde) bir kadın, Âişe'ye: Ey Mü'minlerin Anası! Haydi yürü de Haceri Esved'e el sürüp isti'lâm ede­lim, dedi. Âişe ona: Benden ayrıl, dedi ve (el sürmek suretiyle) isti'lâmdan çekindi. Âişe ve arkadaşları geceleyin tanınmaz hâlde (veya örtülü oldukları hâlde) çıkarlar ve erkeklerin beraberinde tavaf eder­lerdi. Lâkin bu kadınlar Beyt'in içine girdiklerinde, oradan çıkacak­ları zamana kadar, erkekler Beyt'ten çıkarılmış olduğu hâlde içeride ibâdetle kaaim olurlardı, dedi. Atâ: Ben(Peygamber devrinde doğmuş olup Mekke Kaadısı bulunan) Ubeyd ibn Umeyr ile birlikte, Âişe, Muzdelife'deki Sebîr Dağı'nın içinde mücavir, yânı ikaamet edici hâlde iken, Âişe'nin yanına gider idim, dedi. İbn Cureyc dedi ki: Ben Atâ'ya: Âişe'nin o günkü hicabı ne idi? diye sordum. Atâ: Âişe o gün keçeden yapıl­mış bir küçük Türk çadırı içinde idi. Çadırın bir perdesi vardı. Âişe ile bizim aramızda bundan başka birşey yoktu. Ben Âişe'nin üzerin­de gül rengi ile boyanmış bir gömlek gördüm, dedi",
			"grades": [],
			"reference": {
				"book": 25,
				"hadith": 103
			}
		}
	]
}