{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"34": "Sales and Trade"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2215,
			"arabicnumber": 2215,
			"text": "İbn Ömer r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Üç kişi sefere çıkmış yürüyorlardı. Derken yağmura tutuldular Bunun üzerine bir mağaraya sığındılar. Bir kaya gelip mağara'nın ağzını tıkadı. İçlerinden biri, \"Yaptığınız en faziletli amel ile Allah'a dua edin\" dedi. Birincisi, \"Ey Allah'ım' Benim yaşlı annem - babam vardı. Evden çıkar koyunlarımı güder gelir sağardım. Süt'ü, önce ana-babama sonra çocuklarıma,. aileme ve eşime götürür ikram ederdim. Bir gece biraz geç kalmıştım. Geldiğimde annem - babam uyumuşlardı. Onları uyandırmak istemedim. Çocuklar ayak ucumda ağlaşıp duruyordu. Bu durum, fecir doğana kadar devam etti. Allah'ım! Sen biliyorsun ki, bunu senin rızan için yaptım. Bize kapıyı biraz aç ki gökyüzünü görebilelim\" dedi. Kapı biraz açıldı. İkincisi, \"Allah'ım' Bildiğin gibi, ben amca kızlarımdan birine, delicesine aşıktım. Kız bana, \"Yüz dinar getirmedikçe emeline kavuşamazsın\" dedi. Ben de çalıştım çabaladım, yüz dinarı biriktirdim. Kızın yanına gidip emelimi yerine getirmeye kalkıştığım sırada kız, \"Allah'tan kork. Hak yoldan nikah olmadıkça kızlığımı bozma\" dedi. Ben de kalktım ve bırakıp gittim. Allah'ım' Sen biliyorsun ki, bunu senin rızan için yaptım. Bize kapıyı biraz daha aç\" dedi. Kapının üçte biri daha açıldı. Üçüncüsü, \"Allah'ım! Sen biliyorsun ki, ben üç sa' tahıl karşılığında bir işçi tutmuştum. İş sonunda ücretini verdim, fakat o almaktan kaçındı. Ben bunları ektim. MahsuIü ile bir sığır sürüsü ve çoban satın aldım. Daha sonra çıktı geldi ve \"Ey Allah'ın kulu' Hakkımı ver\" dedi. Ben de ona, \"Şu sığır sürüsüne git, çobanı ile birlikte senindir\" dedim. Bana, \"Benimle dalga mı geçiyorsun\" dedi. \"Hayır, onlar senindir\" dedim. Allah'ım' Sen biliyorsun ki ben bunu senin rızan için yapmıştım. Şu kapıyı aç\" diye dua etti. Kapı tamamen açıldı. \" Tekrar: 2272. 2333, 3465, 5974",
			"grades": [],
			"reference": {
				"book": 34,
				"hadith": 162
			}
		}
	]
}