{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"37": "Hiring"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2272,
			"arabicnumber": 2272,
			"text": "İbn Ömer r.a.'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden önceki kavimlerden üç kişi yolculuğa çıkmış gidiyorlarken barınmak için bir mağaraya sığındılar. O anda dağdan bir kaya yuvarlanıp düştü ve mağaranın ağzını tıkadı. İçlerinden biri, \"Bu kayadan, ancak yaptığınız en faziletli ameller ile Allah'a dua etmeniz halinde kurtulabilirsiniz\" dedi. Birincisi, 'Ey Allah'ım' Benim yaşlı annem - babam vardı. Onların akşam sütünü içirmeden önce ne aileme ne de mallarıma bakardım. Bir işle uğraşırken bir gece biraz geç kalmıştım. Süt'ü sağıp götürdüm fakat eve vardığımda annem - babam uyumuşlardı. Annem - babamdan önce ne aileme ne de mallarıma öncelik vermeyi hoş karşılamazdım. Süt bardağı elimde olduğu halde güneş doğana kadar onların uyanmasını bekledim. En sonunda uyandılar ve sütlerini içtiler. \"Allah'ım' Eğer bunu senin rızan için yaptıysam, içinde bulunduğumuz haldeki kayadan bize bir çıkış yolu ver\" diye dua etti. Kapı biraz açıldı. Fakat çıkamadılar. İkincisi, \"Allah'ım! Benim, herkesten çok sevdiğim bir amca kızım vardı. Onu arzuladım fakat o benden kaçındı. Aradan yıllar geçmişti. Bir gün bana geldi, ben de ona, kendisini bana teslim etmesi şartıyla 120 dinar verdim. O da bu şartımı yerine getirdi. Tam üzerine çıktığım sırada bana, \"Hak yol oları (nikah bağı) bulunmadan kızlığımı bozarsan sana hakkımı helal etmem\" dedi. Ben de bırakıp gittim. Oysa insanlar içinde en sevdiğim kişi o kızdı. Verdiğim altınları da ona bağışladım. \"Allah'ım! Eğer bunu senin rızan için yaptıysam, içinde bulunduğumuz haldeki kayadan bize bir çıkış yolu ver\" diye dua etti. Kapı biraz daha açıldı. Fakat çıkamadılar. Üçüncüsü, \"AI/ah'ım' Ben bir grup işçi tutup ücretlerini vermiştim. Fakat bir işçi, ücretini almadan çekip gitti. Ben de onun ücretini kendi malımdan ayrı tutup çalıştırdım, bu ücretten elde edilen karlar çok mala dönüştü, adamın çok malı oldu. Bir süre sonra çıktı geldi ve bana \"Ey Allah'ın kulu! bana ücretimi ver dedi. Ben de şu gördüğün develer, sığırlar, koyunlar ve köleler hepsi senindir, deyince adam bana: \"Benimle alay etme\" dedi. Ben de, \"Hayır, alay etmiyorum\" dedim. Bunun üzerine adam malların hepsini alıp hiçbir şey bırakmadan sürüp gitti. \"Allah'ım! Eğer bunu senin rızan için yaptıysam, içinde bulunduğumuz haldeki kayadan bize bir çıkış yolu ver\" diye dua etti. Bunun üzerine kaya parçalandı ve yürüyerek çıkıp gittiler.\" باب: من آجر نفسه ليحمل على ظهره، ثم تصدق به، وأجرة الحمال. 13. SIRTINDA ODUN TAŞIMAK iÇiN ÇALIŞAN SONRA BUNU SADAKA OLARAK VEREN KiMSE VE HAMMALIN KAZANACAĞI SEVAP",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 12
			}
		}
	]
}