{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"39": "Kafalah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2291,
			"arabicnumber": 2291,
			"text": "Ebû'z-Zinâd, Muhammed ibn Hamza ibn Amr el-Eslemî'den; o da Bâbası Hamza'dan olmak üzere söyledi ki, Omer ibn Hattâb(radıyallahü anh) onu sadaka toplayıcı olarak göndermiş. O bölgede bir adam, kendi karısının cariyesi ile cima' etmiş. Hamza (radıyallahü anh) o adamdan kefîl (yânı hâlinden taahhüt ve zabt) alıp, Ömer'in yanına gelmiş. Omer o adama yüz deynek vurmuştu. O adam zina ettiğini söyleyen topluluğu tasdîk ve suçunu i'tirâf etti. Ancak Omer onu cahillikle özürlü saydı (ve ondan recmi def etti). ibn Abdillah el-Becelî ile el-Eş'as ibn Kays el-Kindî (radıyallahü anh) Abdullah ibn Mes'ûd'a dînden dönenler hakkında: Onların tevbe etmelerini iste ve onlardan kefalet al, dediler. Akabinde mürtedler tevbe ettiler ve aşiretleri onlara kefîl oldular. ibn Ebî Süleyman : Nefisle kefil olup da öldüğünde üzerine bir şey yoktur, dedi. Hakem ibn Uteybe: Zimmette subûtunu kabul ettiği malı Öder, dedi. Abdillah el-Buhârî şöyle dedi: Ve el-Leys ibn Sa'd şöyle dedi: Bana Ca'fer ibn Rabîa, Abdurrahmân ibn Hürmüz'den; o da Ebû Hureyre (radıyallahü anh)'den; o da Rasûlüllah(sallallahü aleyhi ve sellem)'tan tahdîs etti.“Rasûlüllah,İsrâîl oğullarından bir adam zikretti. O adam İsrâîl Oğullarının bâzısından ödünç olarak bin dînâr vermesini istedi. Para vermek isteyen zât: Buna şâhid yapacağım şâhidleri getir, dedi. Ödünç isteyen: “Şâhid olarak Allah yeter\"(el-Muhammed,48/28),dedi. verecek olan bu sefer de: Haydi bana kefil getir, dedi. O adam: Kefil olarak Allah yeter\" dedi (Bu, âyet değildi) sahibi: Hakîkaten doğru söyledin, dedi ve belirlenen bir va'de ile ona bin dînâr verdi. alan müteakiben deniz seferine çıktı. İşlerini gördü. Sonra kendisine ödünç veren zâta gelmek üzere bineceği bir gemi aradı. Belirlenen müddet geliyordu. Fakat bir gemi bulamadı. Bunun üzerine bir odun parçası alıp, onun içini oydu. İçine bin dînârı ve bir de kendisinden o arkadaşına yazdığı bir mektûb sahîfesini koydu. Sonra o oyuk yerin ağzını sıkıca kapatıp düzeltti. Sonra o odun parçasını deniz kenarına getirdi de şöyle duâ etti: Yâ Allah, Sen bilmektesin ki, ben fulan kimseden bin dînâr ödünç istedim. O benden bir kefil istedi. Ben \"Kefîl olarak Allah kâfidir\" dedim. O, Sen'in kefilliğine razı oldu. Bir de benden şâhid istedi. Ben yine \"Şâhid olarak Allah kâfidir\" dedim. O yine Sen'in şâhidliğine de razı oldu (ve bin dînârı verdi. Ben va'desinde borcumu ödemek kaygısına düştüm de) ona bu parayı göndereyim diye bir gemi bulmaya çalıştım. Fakat bulmağa muktedir olmadım. Artık ben şu bin dînâr borcumu Sen'in koruyuculuğuna emânet ediyorum! dedi de o odunu denize attı. denizin içine girdikten sonra kendisi geri döndü. Borçlu bu hususta kendisini beldesine çıkaracak gemi bulmağa çalışırken, alacaklı da onun dönmesini umarak deniz kenarına çıktı da belki bir gemi malını getirmiş olabilir diye gözetliyordu. Bu sırada birdenbire sahilde içinde mal bulunan o odunu gördü. Onu ailesine yakacak bir odun olarak aldı. Evde onu parçalayınca içindeki paraları ve mektûb sahîfesini buldu. Sonra borçlu kimse kendisine borç verene geldi ve ona bin dînârı getirdi de: Allah'a yemîn ederim ki, malını sana getirmem için bir gemi arayıcısı olmakta devam ettim. Fakat sana geldiğim şu zamandan önce bir gemi bulamadım, dedi ve borcunu verdi. Sen bana bir şey gönderdin mi? dedi. Borçlu: İçinde sana geldiğim şu günden önce bir gemi bulamadığımı sana haber veriyorum, dedi. Şüphesiz ki, Allah senin odun içinde göndermiş olduğun borcunu senin adına ödemiştir. Binâenaleyh tekrar vermek için getirdiğin bu bin dînârı, bir râşid olarak sevinçle götür, dedi",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		}
	]
}