{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"39": "Kafalah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2297,
			"arabicnumber": 2297,
			"text": "Bize Yahya ibn Bukeyr tahdîs edip şöyle dedi: Bize el-Leys, Ukayl'den tahdîs etti. İbnu Şihâb dedi ki: Bana Urvetu'bnu'z-Zubeyr haber verdi ki, Peygamber'in zevcesi Âişe (r. anha): Ben Bâbamla anamın İslâm Dîni'ni dîn edinir olmalarından başka hâllerini hatırlamadım, demiştir. Ebû Salih şöyle dedi: Bana Abdullah ibnu'l-Mübârek, Yû-nus'tan; o da ez-Zuhrî'den tahdîs etti. ez-Zuhrî şöyle demiştir: Bana Urvetu'bnu'z-Zubeyr haber verdi ki, Âişe (r.anha) şöyle demiştir: Ben Bâbamla anamın İslâm Dîni'ni dîn edinerek yaşamalarından başka yaşayışlarını hiç bilmedim. O zamanlarda hiçbir günümüz geçmezdi ki, muhakkak o günde, gündüzün iki tarafında, sabah ve akşam vakitlerinde Rasûlüllah bize gelirdi. Müslümanlar(Kureyş müşrikleri tarafından) işkenceye uğratılınca (Rasûlüllah Habeşistan'a göçe izin vermişti), Ebû Bekr de Habeşistan tarafına hicret etmek üzere(Mekke'den) çıkmıştı. Ebû Bekr, Berku'l-Gımâd- mevkîine gelince kendisine İbnu'd-Dağine kavuştu. İbnu'd-Dağine Kaare kabilesinin seyyididir. Ebû Bekr'e: Yâ Ebâ Bekr, nereye gitmek istiyorsun? dedi. Bekr de: Beni kavmin (in ezası) çıkardı. Ben de yeryüzünde seyahat etmek, bir yere çekilmek ve orada Rabb'ime ibâdet etmek istiyorum, dedi. Senin gibi bir zât ne yurdundan çıkar, ne de (başkaları tarafından) çıkarılır. Çünkü şu bir hakikattir ki, sen fakîri kazandırırsın (veya: Bulunmayan bir malı ihsan edersin), hısımlarla ilgiyi devam ettirirsin, âcizlerin yükünü çekersin, konuklara ziyafet verirsin, hakk engellerine karşı hayır işlerine yardım edersin! Şimdi ben senin için bir koruyucuyum. Haydi Mekke'ye dön de kendi memleketinde Rabb'ine ibâdet et! Demiştir. üzerine Ebû Bekr geri dönmüş, İbnu'd-Dağine de kendisi ile beraber yollanmıştır. (Mekke'ye gelince) İbnu'd-Dağine Kureyş şeriflerini dolaşmış ve onlara: Şüphesiz Ebû Bekr gibi kıymetli bir zât memleketinden çıkmaz ve çıkarılmaz. Ey Kureyş, siz şu faziletleri bulunan bir adamı memleketinden çıkarıyor musunuz? O, yok olanı kazanır, hısımlık ilişkilerini devam ettirir, âcizin yükünü taşır, konuklara ziyafet verir, hakk engellerine karşı hayır işlerine yardım eder, dedi ve Ebû Bekr'i himayesine aldı. de İbnu'd-Dağine'nin Ebû Bekr'i emânına almasını infaz etti ve Ebû Bekr'i emniyette kıldılar. İbnu'd-Dağine'ye: Ebû Bekr'e emret. O(bir şeye karışmasın), evinde Rabb'ine ibâdet etsin, evinde namaz kılsın, dilediği şeyi okusun. Fakat okuduğu ile bize ezâ vermesin, okuduğunu yüksek sesle okumasın. Çünkü biz oğullarımızı ve kadınlarımızı fitneye düşürmesinden korkmuşuzdur, dediler. bu sözlerini de İbnu'd-Dağine Ebû Bekr'e söyledi. Ebû Bekr de bu şartlara göre evinde Rabb'ine ibâdet etmeye, evinden başka yerde yüksek sesle namaz kılmamaya ve yüksek sesle okumamaya başladı. Sonra Ebû Bekr için bunun muhalifi bir re'y zahir oldu da, evinin yanına bir mescid bina etti. Oraya çıktı, orada namaz kılıyor ve Kur'ân okuyordu. Bunun üzerine müşriklerin kadınları ve oğulları Ebû Bekr'in ibâdet ve kıraatine taaccüb ederek ve ona bakarak bir izdiham ve sıkışıklık meydana getiriyorlardı. Ebû Bekr ince yürekli, çok ağlayıcı bir adamdı. Kur'ân okurken gözyaşını tutamazdı. Ebû Bekr'in bu hâli Kureyş'in müşrik şeriflerini korkuttu da, onlar İbnu'd-Dağine'ye haber gönderdiler. Akabinde İbnu'd-Dağine onların yanına geldi. Kureyş, İbnu'd-Dağine'ye: Biz, kendi evinde Rabb'ine ibâdet etmek üzere Ebû Bekr'i himaye ve emânına almanı kabul etmiştik. Ebû Bekr ise bu sınırı aşmış, evinin avulusunda bir mescid bina etmiş, içinde yüksek sesle namaz kılmaya ve Kur'ân okumaya başlamıştır. Doğrusu biz oğullarımızı ve kadınlarımızı fitneye düşürmesinden korktuk. Sen ona git. Eğer kendi evinde Rabb'ine ibâdet etmek üzerine kısaltmak isterse bunu yapsın. Eğer bunu kabul etmez de muhakkak namaz ve kıraatini yükseltip i'lân etmek isterse, ona verdiğin ahd ve emânını sana geri vermesini iste. Emîn ol ki, biz sana verdiğimiz sözden caymayı çirkin gördük. Fakat biz Ebû Bekr'in alenî ibâdet etmesini ikrar(ve kabul) ediciler de değiliz, dediler. dedi ki: Bunun üzerine İbnu'd-Dağine, Ebû Bekr'e geldi ve: Benim nasıl bir husus üzerine sana emân ahdi verdiğimi iyi bilmişsindir. Şimdi sen ya o husus üzerine işi kısaltırsın, yahut da emân ahdimi bana geri verirsin. Çünkü ben bir kimse hakkında vermiş olduğum emân ahdimi bozmuş olduğumu Arab milletinin işitmesini istemem, dedi. Bekr de: Ben senin koruma ahdini sana geri veriyorum ve Allah'ın korumasına razı oluyorum, dedi. ise o günlerde Mekke'de bulunuyordu. Rasûlüllah(sallallahü aleyhi ve sellem) şöyle dedi: \"Sizin hicret edeceğiniz yurt bana gösterildi. Ben iki kara taşlık arasında, hurmalıklı çorak bir yer gördüm\" dedi. bunu söylediği zaman Medine tarafıına hicret edenler (dalga dalga) hicret ettiler ve Habeşistan'a hicret etmiş olanların bâzısı da Medine'ye dönüp geldiler. Ebû Bekr de bir muhacir olmaya hazırlandı. Fakat Rasûlüllah ona: \"Yavaş ol(acele etme). Çünkü ben, benim için de izin verilmesini umuyorum\" buyurdu. Bekr: Bâbam sana kurbân olsun, sen bunu umuyor musun? dedi. Rasûlüllah: \"Evet\" buyurdu. üzerine Ebû Bekr, Rasûlüllah'a yol arkadaşlığı etmek için kendini (hicretten men' edip), Rasûlüllah üzerine habsetti ve yanında bulunan iki kuvvetli binek devesini dört ay (dikenli meşe nev'inden büyük) talh ağacı yaprağı ile evinde besledi(dışarıya salıvermedi)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		}
	]
}