{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"40": "Representation, Authorization, Business by Proxy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2309,
			"arabicnumber": 2309,
			"text": "Bize Mekkî ibnu İbrâhîm tahdîs edip şöyle dedi: Bize İbnu Cureyc, Atâ ibn Ebî Rebâh'tan ve bir de bâzısı bâzısı üzerine artırarak ondan başkalarından tahdîs etti. Bu hadîsin tamâmını onların hepsi teblîğ etmedi, fakat onlardan bir tek adam tebliğ etti. Câbir ibn Abdillah(radıyallahü anh) şöyle demiştir: bir seferde Peygamber'in maiyyetinde idim ve ağır hareket eden bir deve üzerinde yolculuk ediyordum.Bu deve ancak insanların sonunda idi. Derken yanıma Peygamber (sallallahü aleyhi ve sellem) uğradı da: \"Bu arkada kalan kimdir?\" dedi. Câbir ibn Abdillah'tır, dedim. Peygamber: \"Neyin var ki (geri kaldın)?' buyurdu. Ben de: Ben yürüyüşü yavaş bir deve üzerindeyim, dedim. Peygamber: \"Beraberinde deve sürecek bir çubuk var mı?\" dedi, Evet, var, dedim. \"Onu bana ver\" buyurdu. çubuğu kendisine verdim. O da bu deynekle deveye vurdu ve azarladı. Artık deve Peygamber'in ona vurduğu bu yerden i'tibâren ordunun önde gidenlerinden oldu. \"Deveyi bana sat\" dedi. Ben de: Fakat o (bedelsiz olarak) senindir yâ Rasûlallah, dedim. \"Onu bana sat. Ben bu deveyi senden dört dînâr karşılığında aldım. Medine'ye kadar onun sırtı (yani binme hakkı) senindir\" buyurdu. yaklaştığımız zaman ben hızlı gitmeye başladım. Peygamber: \"Nereye gitmek istiyorsun?\" diye sordu. Kocası ölmüş dul bir kadınla evlendim, dedim. Peygamber: \"Onun seninle, senin de kendisiyle oynaşacağınız bakire bir kızla evlenseydin yâ!\" buyurdu. Bâbam vefat etti ve bir takım kız çocukları bıraktı. Bu sebeble ben tecrübe kazanmış, kendinden toyluk gitmiş bir kadınla evlenmek istedim, dedim. \"Bu evlilik sana mübarek olsun\" dedi. Medine'ye geldiğimizde: \"Yâ Bilâl, Câbir'e devesinin bedelini öde ve bedeli biraz da artır\" buyurdu. Bilâl, Câbir'e dört dînâr verdi ve bedeli bir kîrât da artırdı. Rasülullah(sallallahü aleyhi ve sellem)'ın bu ziyâdesi artık benden ayrılmasın, dedi. (Râvî Atâ) bu kîrât, Câbir ibn Abdillah'ın kılıcının kılıfı oldu, dedi",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 9
			}
		}
	]
}