{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"40": "Representation, Authorization, Business by Proxy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "Ebu Hureyre r.a. şöyle anlatır: Resulullah Sallallahu Aleyhi ve Sellem, Ramazanda verilen zekatları korumam için bana vekalet vermişti. Bu arada (bir gece) birisi geldi ve hurma'dan avuçlayıp aldı. Hemen onu yakaladım ve \"Vallahi seni Resulullah'a götüreceğim\" dedim. Bana, \"Ben ihtiyaç sahibi bir kimseyim, çoluk çocuğum var, şiddetle bunlara muhtacım\" dedi. Ben de onu bıraktım. Sabah olduğu zaman Resulullah Sallallahu Aleyhi ve Sellem, \"Ey Ebu Hureyre! Dün yakaladığın kimse ne yaptı?\" diye sordu. Ben de, \"Ey Allah'ın Resulü' Bana, çok ihtiyacı olduğunu ve kalabalık bir ailesi bulunduğunu anlatıp halinden şikayette bulundu. Ben de acıdım, salıverdim\" dedim. Nebi Sallallahu Aleyhi ve Sellem, \"O yalan söylemiş, yine gelecek\" buyurdu. Resulullah Sallallahu Aleyhi ve Sellem söylediği için, yine geleceğini anladım ve gözetlemeye koyuldum. Birden gelip yine avuçlamaya başladı. Onu yakaladım ve \"Seni Resulullah'a götüreceğim\" dedim. Bana, \"Beni bırak, ben buna muhtacım ve çoluk çocuğum var, bir daha gelmeyeceğim\" dedi. Acıdım, yine bıraktım. Sabah olunca, Resulullah Sallallahu Aleyhi ve Sellem, \"Ey Ebu Hureyre! Yakaladığın kimse ne yaptı?\" diye sordu. Ben de, \"Ey Allah'ın Resulül Bana, çok ihtiyacı olduğunu ve kalabalık bir ailesi bulunduğunu anlatıp halinden şikayette bulundu. Ben de acıdım, salıverdim\" dedim. Nebi Sallallahu Aleyhi ve Sellem, \"O sana yalan söylemiş, yine gelecek\" buyurdu. Üçüncü kez onu gözetledim. Yine gelip avuçlamaya başladı. Onu yakaladım ve \"Mutlaka seni Resulullah'a götüreceğim. Bu üçüncü ve sonuncusu artık. Sen gelmeyeceğini söylemiştin sonra döndün\" dedim. Bana, \"Beni bırak da, sana, Allah'ın sana bir takım yararlar sağlayacağı bazı kelimeler öğreteyim\" dedi. \"Neymiş onlar?\" dedim. Bana (şöyle dedi), \"Yatağına girdiğin zaman ayete'l-kürsi'yi oku. Allah tarafından sana bir koruyucu gönderilir. Sabaha kadar sana hiçbir şeytan yaklaşamaz\" dedi Ben de onu serbest bıraktım. Sabah olunca, Resulullah Sallallahu Aleyhi ve Sellem, \"Ey Ebu Hureyre! Dün yakaladığın kimse ne yaptı?\" diye sordu. Ben de, \"Ey Allah'ın Resulü! Bana, Allah'ın bana birtakım yararlar sağlayacağı bazı kelimeler öğretti Ben de salıverdim\" dedim. Nebi Sallallahu Aleyhi ve Sellem, \"Nedir onlar\" buyurdu. Ben de, \"Bana, \"Yatağına girdiği n zaman ayete'l-kürsı'yi oku. Allah tarafından sana bir koruyucu gönderilir. Sabaha kadar sana hiçbir şeytan yaklaşamaz\" dedi\" dedim. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem, \"O, çok yalancı bir kimse olduğu halde (bu konuda) doğru söylemiş. Üç gündür kiminle karşılaştığını biliyor musun Ey Ebu Hureyre?\" diye sordu. Ebu Hureyre, \"Hayır\" diye cevap verince Resul-i Ekrem Sallallahu Aleyhi ve Sellem, \"O şeytandı\" buyurdu. Tekrar: 3275, 5010",
			"grades": [],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		}
	]
}