{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"41": "Agriculture"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2333,
			"arabicnumber": 2333,
			"text": "Abdullah İbn Ömer'in naklettiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Üç kişi sefere çıkmış yürüyorlard!. Derken yağmura tutuldular. Bunun üzerine dağda bulunan bir mağaraya sığındılar. Dağdan bir kaya düşüp mağaranın ağzını tıkadı. Biri diğerlerine, \"Allah için yaptığınız salih amellere bir bakıp araştırın ve bu amel ile Allah'a dua edin, umulurki Allah bu sayede kayadan kurtarır\" dedi. Birincisi, \"Ey Allah'ım! Benim bakmakta olduğum yaşlı annem - babam ve küçük çocuklarım vard!. Eve geldiğimde koyunları sağar çocuklarımdan önce anne babamın sütünü içirirdim. Bir gün biraz geç kalmıştım. Akşam vakti geldiğimde annem - babam uyumuşlardı. Her zamanki gibi sütü sağdım. Onları uyandırmak istemedim. Başlarında bekledim. Sütü çocuklara vermek de hoşuma gitmedi. Bundan dolayı çocuklar ayak ucumda ağlaşıp duruyordu. Bu durum, fecir doğana kadar devam etti. Allah'ım' Sen biliyorsun ki, bunu senin rızan için yaptım. Bize kapıyı biraz aç ki gökyüzünü görebileiim\" dedi. Kapı biraz açıldı ve gökyüzünü gördüler. İkincisi, \"Allah'ım' Bildiğin gibi, ben amca kızlarımdan birine, delicesine aşıktım. Kız bana, \"Yüz dinar getirmedikçe emeline kavuşamazsın\" dedi. Ben de çalıştım çabaladım, yüz dinarı biriktirdim. Kızın yanına gidip emelimi yerine getirmeye kalkıştığım sırada kız, \"Ey Allah'ın kulu! Allah'tan kork. Hak yololan nikah olmadıkça kızlığımı bozma\" dedi. Ben de kalktım ve bırakıp gittim. Allah'ım! Sen biliyorsun ki, bunu senin rızan için yaptım. Bize kapıyı biraz daha aç\" dedi. Kapı biraz daha açıldı. Üçüncüsü, \"Allah'ıml Sen biliyorsun ki, ben üç sa' tahıl karşılığında bir işçi tutmuştum. İş sonunda, \"ücretimi ver\" dedi. Ben de ücretini verdim, fakat o almaktan kaçındı. Ben bunları ektim. Mahsulü ile bir sığır sürüsü ve çoban satın aldım. Daha sonra çıktı geldi ve \"Allah'tan kork\" dedi. Ben de ona, \"Şu sığır sürüsüne git, çobanı ile birlikte senindir\" dedim. Bana, \"Allah'tan kork' Benimle dalga geçme\" dedi. \"Hayır dalga geçmiyorum, al\" dedim. O da aldı. Allah'ıml Sen biliyorsun ki ben bunu senin rızan için yapmıştım. Kapının kalan kısmını da aç\" diye dua etti. Ve Allah kapıyı açtı",
			"grades": [],
			"reference": {
				"book": 41,
				"hadith": 14
			}
		}
	]
}