{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"43": "Loans, Payment of Loans, Freezing of Property, Bankruptcy"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2390,
			"arabicnumber": 2390,
			"text": "Ebu Hureyre r.a. şöyle anlatır: Bir adam, Nebi Sallallahu Aleyhi ve Sellem'den alacağını talep etti ve biraz sert ve kaba davrandı. Sahabiler, o adamı (durdurmak) için yöneldiler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem, \"Onu bırakın, hak sahibinin konuşmaya hakkı vardır. Bir deve satın alın da verin ona\" buyurdu. Sahabiler, \"Sadece onun verdiğinden daha değerli olan (yaşı daha büyük) deve bulabildik\" dediler. Efendimiz (Sallallahu aleyhi ve Sellem), \"Onu satın alın ve verin, çünkü sizin en hayırlınız borcu en güzel şekilde ödeyeninizdir\" buyurdu. Hadisten Çıkarılan Sonuçlar Hak sahibinin, hakkını isterken meşru edeb sınırları içinde davranması gerekir. Vadesi gelmiş ise alacağı istemek caizdir. Bu hadiste, Hz. Nebi'in sahip olduğu güzel ahlakı, yumuşak huyluluğu, tevazuyu ve insafını görmekteyiz. Borçlu kimseye, alacaklıya karşı kaba davranması uygun düşmez. Devlet başkanı, kendisine karşı edebe aykırı davranışta bulunanlara tazir cezası vermelidir. Ancak hak sahiplerini bağışlaması gerekir. Deve borç (karz) alınabilir. Bu hükme bütün hayvanlar dahildir. Alimlerin çoğu bu görüştedir. Sevri'ye ve Hanefilere göre hayvanlar karz olarak alınamaz. Bu konudaki delil, hayvan karşılığında hayvanın vadeli olarak satımını yasaklayan hadistir. Bu hadisi, İbn Abbas \"merm\" olarak rivayet etmiştir. İbn Hibban, Darekutnı ve başka bazı alimler de nakletmiştir. Hadiste geçen raviler güvenilirdir. Genelolarak, delil getirmeye elverişli bir hadis olduğu söylenebilir. Karz akdinde şart koşulmadığı sürece, borcu, alınandan daha iyisi ile ödemek caizdir. Eğer şart koşulursa bunun haram olacağında ittifak bulunmaktadır. Alimlerin çoğunluğu bu görüştedir. Malikiler durumu biraz ayrıntılı bir şekilde ele alarak şöyle demişlerdir: Eğer aded olarak fazla ödenirse bu yasaktır. Fakat nitelik olarak daha iyisi ile ödenirse caizdir. İyilik, Allah'a itaat vb. mubah konular için borçlanmak ayıplanacak bir durum değildir. Devlet başkanı, zekat mallarından ödemek üzere, ihtiyaç sahiplerinin ihtiyacını karşılamak amacıyla devlet hazinesi adına borçlanabilir. Şafiiler, zekatın, farz olma zamanından önce ödenebileceğine bu hadisi delil olarak getirmişlerdir. İbn Abdilberr bu şekilde nakletmiştir. Fakat bana bu görüşün dayanağı pek açık gelmedi. Fakat Resulullah'ın Sallallahu Aleyhi ve Sellem borç alması şu şekilde yorumlanabilir: Hz. Nebi, sadaka verilmesi gereken kimseler için borç almıştı. Sadaka malları gelince aldığı borcu, sahiplerine geri verdi. باب: حسن التقاضي. 5. ALACAĞIN GÜZEL BİR ŞEKİLDE İSTENMESİ",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 6
			}
		}
	]
}