{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"4": "Ablutions (Wudu')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 240,
			"arabicnumber": 240,
			"text": "Bize Abdan tahdîs edip şöyle dedi: Bana Babam (Usmân ibn Cebele), Şu'be'den; o da Ebû İshâk'tan; o da Amr ibn Meymûne (75)'den; o da Abdullah ibn Mes'ûd'dan haber verdi. O şöyle demiştir; Rasûlüllah (sallallahü aleyhi ve sellem) secde ettiği sırada... H Buhârî dedi ki: Ve keza bana Ahmed ibn Usmân (260) tahdîs edip şöyle dedi: Bize Şurayh ibn Mesleme (222) tahdîs edip şöyle dedi: Bize İbrâhîm ibn Yûsuf (198), babasından; o da Ebû İshâk'tan tahdîs etti. O şöyle dedi: Bana Amr ibn Meymûn tahdîs etti. Ona da Abdullah ibn Mes'ûd şöyle tahdîs etmiştir: aleyhi ve sellem), Beyt'in yanında namaz kılıyordu. Ebû Cehl ile bâzı arkadaşları da oturuyorlardı. Derken onların biri diğerine: Fulan oğullarının (yeni kesilen) devesinin döl eşini hanginiz getirir de, secdeye vardığında onu Muhammed'in sırtına koyar? dedi. O topluluğun en şakî olanı seğirtip onu getirdi. Bekledi,Peygamber (sallallahü aleyhi ve sellem) secdeye varınca sırtının üzerine iki omuzu arasına koydu. Ben ise hiçbir işe yaramayarak bakıyordum. Keşki benim için men edici kuvvetler olaydı! İbn Mes'ûd dedi ki: Onlar gülmeğe ve birbirine isnâd etmeğe başladılar. Rasûlüllah ise secdeden başını kaldırmıyordu. Nihayet Fâtıma yanına geldi ve onu sırtından attı. Rasûlüllah başını kaldırdı.(Namazı bitirdikten) sonra üç defa: \"Yâ Allah! Kureyş'i sana havale ederim\" dedi. Rasûlüllah onlara beddua edince, bu onlara ağır geldi. İbn Mes'ûd der ki: Çünkü onlar bu şehirde duanın kabul edilecek olduğuna kaail idiler. Ondan sonra Rasûlüllah isim sayarak: \"Yâ Allah Ebû Cehl'i sana havale ederim; Utbe ibn Rabîa'yı, Şeybe ibn Rabîa'yı, Velîd ibn Utbe'yi, Umeyye ibn Halef'i, Ükbe ibn Ebî Muayt'ı sana havale ederim\" dedi. Yedinciyi de saydı, fakat biz onu zabt edemedik. İbn Mes'ûd der ki: Nefsim elinde bulunan Allah'a yemîn ederim ki, Rasûlüllah'ın saydığı isimlerin sahihlerini Kalîb'de, yânı Bedir çukurunda yere serilmiş gördüm",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 106
			}
		}
	]
}