{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"44": "Khusoomaat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2411,
			"arabicnumber": 2411,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Biri müslümanlardan, öbürü Yahûdîler'den olan iki kişi birbiriyle sövüştüler. Müslüman olan zât, Yahudi'ye: Muhammed'i âlemler üzerine süzüp seçen Allah'a yemîn ederim ki, demişti. de müslümana hitaben: Musa'yı âlemler üzerine süzüp seçen Allah'a yemîn ederim ki, demiş. üzerine müslüman elini kaldırıp Yahudi'nin yüzüne bir tokat vurdu. Yahûdî hemen Peygamber'in yanına gitti. Kendisinden ve müslümândan meydana gelen işleri Peygamber'e haber verdi. Peygamber o müslümânı çağırttı ve ona olan işten sordu. Müslümân da olanları kendisine haber verdi. Akabinde Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Bana Mûsâ üzerinde hayırlılık vermeyiniz! Muhakkak ki insanlar kıyâmet gününde (o günün korkunçluğundan yıldırım çarpmış gibi) bayılacaklar. Onlarla beraber ben de bayılacağım. Fakat ilk ayılan ben olacağım. O anda ben Musa'yı Arş'ın bir tarafına sımsıkı tutunmuş duruyor görürüm. Bilmiyorum, Mûsâ da bayılanların içinde idi de benden evvel mi ayıldı, yahut baygınlıktan Allah'ın istisna ettiklerinden mi bulundu?\". Saîd el-Hudrî (radıyallahü anh) şöyle demiştir:Rasûlüllah (sallallahü aleyhi ve sellem) oturmuş olduğu sırada bir Yahûdî geldi ve: Yâ Eba'l-Kaasım! Sahâbîlerinden bir adam yüzüme vurdu, diye şikâyet etti. \"Kim vurdu?\" diye sordu. Ensâr'dan bir adam olduğunu söyledi. Rasûlüllah: \"Onu çağırınız!\" diye emretti. (O adam huzura getirilince:) \"Sen bu Yahudi'yi dövdün mü?\" diye sordu. O zât da: (Evet.) Bunun çarşıda \"Musa'yı bütün beşeriyet üzerine süzüp seçen Allah'a yemin ederim ki\" diye yemîn ettiğini işittim. Ben de: Ey habîs! Muhammed üzerine de mi(tercih etti), dedim. O sırada beni ânî bir öfke tuttu da yüzüne vurdum, dedi. üzerine Peygamber (sallallahü aleyhi ve sellem): \"Peygamberler arasında (birini öbüründen) eksiltme hayırlılığı nisbet etmeyiniz. Çünkü kıyâmet gününde insanlar (o günün şiddetinden) bayılacaklar. (Onların beraberinde ben de bayılacağım.) Fakat yerin kendisinden ilk yarılacağı (yani kabri ilk açılan) kimse ben olacağım. O anda ben Mûsâ ile karşılaşacağım, Mûsâ Arş'ın direklerinden bir direğe tutunmuş bulunacak. Bilmiyorum; Mûsâ da bayılanlar içinde bulundu (da benden evvel) mi (ayıldı) yoksa (Sînâ Dağı'ndaki) ilk bayılma ile mi hesâb olundu?",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 2
			}
		}
	]
}