{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "İbnu Şihâb şöyle demiştir: Bana Ubeydullah ibnu Abdillah ibn Ebî Sevr, Abdullah İbn Abbâs radıyallahü anhüma'tan haber verdi. O şöyle demiştir: Allah'ın haklarında\"Eğer her ikiniz de Allah’a tevbe ederseniz ne iyi, çünkü ikinizin de kalbleriniz eğrildi...\" (et-Tahrîm: 4) buyurduğu, Peygamber'in zevcelerinden ikisinin kim olduğunu Omer'den sormaya hırslanır dururdum. Nihayet onun beraberinde hacc yaptım. Dönerken yolun bir yerinde Omer saptı. Ben de deriden bir su kabı ile onun beraberinde yoldan saptım. Omer halâya gitti, nihayet benim yanıma geldi. Ben de ellerine o su kabından döktüm, o da abdest aldı. Ben: Ey Mü'minlerin Emîri! Peygamber'in zevcelerinden o iki kadın kimdir ki, Allah onlar için “Eğer ikiniz de Allah'a tevbe ederseniz ne iyi, çünkü ikinizin de kaibleriniz eğrildi...\" buyurmuştur? diye sordum. Omer bana: Hayret ederim sana ey Abbâs oğlu!(Onlar) Hafsa ile Âişe'dir, dedi. Omer hadîse yönelip onu sevk ederek şöyle dedi: Ben Ensâr'dan bir komşum ile beraber Benû Umeyye ibn Zeyd yurdunda (oturuyor) idim. Bu yurt Medine'nin Avâlî denilen semtindedir. (Bir şey öğrenmek ümidiyle) Peygamber'in yanına nevbetleşe inerdik. Bir gün o iner, bir gün ben inerdim. Ben indiğim zaman o gün vahiy ve diğer şeylere dâir (ne duyarsam) haberini komşuma getirirdim. O da indiği zaman böyle yapardı. Ve biz Kureyş topluluğu, kadınlara galebe ediyorduk. Medine'ye Ensâr üzerine geldiğimizde bir de gördük ki onlar, kadınları erkeklerine galebe eder bir kavim. Derken bizim kadınlarımız, Ensâr kadınlarının edebinden almaya başladılar. Bir gün ben karıma karşı bağırdım; o da bana cevâb verdi. Ben onun bana söz döndürüp cevâb vermesinden hoşlanmadım; azarladım. Bunun üzerine o, şunları söyledi: Benim sana karşı mırıldanmamı niçin münâsib görmüyorsun? Vallahi Peygamber'in zevceleri bile O'na karşı mırıldanıyorlar ve birisi o gün geceye kadar Peygamber'in yanına uğramıyor! Dedi. bu sözleri beni ürküttü. Ben: Onlardan kim bunu yaparsa perîşân olur; büyük günâh işlemiş olur, dedim. elbisemi üzerime topladım, yâni giyindim ve Hafsa'nın yanına girdim. Ve ona: Ey Hafsa! Sizlerden herhangi biriniz bütün gün tâ geceye kadar Allah Elçisi'ne dargınlık eder mi? dedim. Evet, dedi. O kadın perîşân olmuş ve zarar etmiştir. Her biriniz kendine Allah'ın Rasûlü'nün öfkesinden dolayı öfke etmesinden emîn mi bulunuyor? Bu yüzden helak olursunuz. Sen Allah'ın Resûlüne karşı çok istekte bulunma, O'na karşı herhangi bir şey hususunda söz döndürme yarışma girişme, O'na darılıp O'ndan ayrı durma. Bir ihtiyâcın meydana çıkarsa O'nu benden iste. Ve sakın arkadaşının, Rasûlüllah'a senden daha güzel ve daha sevgili olması da seni aldatmasın (Omer, Âişe'yi kasdediyor). biz o sırada: \"Gassânlılar bize(karşı) gaza etmek için atlarını nallatıyorlarmış\" diye havadis alıyorduk. Arkadaşım kendi nevbetinde Peygamber'in yanına indi ve yatsı vaktinde döndü. Kapıma şiddetli bir vuruşla vurdu ve: O uyuyor mu? dedi. korktum ve hemen onun yanına çıktım. O: Büyük bir iş meydana geldi, dedi. Nedir o; Gassânîler mi geldi? dedim. Hayır, fakat ondan daha büyük ve daha uzun: Rasûlüllah(sallallahü aleyhi ve sellem) kadınlarım boşamış, dedi. dedi ki: Hafsa isteğine ulaşmadı ve ziyana uğradı. Ben bunun yakında olacağını zannediyordum. Elbisemi üzerime topladım ve Peygamber'le beraber sabah namazını kıldım. Peygamber, birkaç basamakla çıkılır, kendisine âid bir meşrubeye (şerbetlik denilen sekili bir hücreye) girdi ve orada yalnız kaldı. Hafsa'nın yanına girdim, gördüm ki ağlıyor. Ben: Seni ağlatan nedir? Ben seni sakındırmış değil miydim? Rasûlüllah sizleri boşadı mı? dedim. Bilmiyorum. O, işte tâ şu meşrubede, dedi. üzerine mescide çıktım ve minberin yanına geldim. Gördüm ki, minber etrafında bir takım kimseler var; bâzıları ağlıyorlar. Yanlarında biraz oturdum. Sonra vicdânımdaki duygum bana galebe etti. Peygamber'in içinde bulunduğu o meşrubeye geldim. Ve Peygamber'in siyah uşağına: Omer için izin iste! Dedim. girdi, Peygamberle konuştu. Sonra çıktı ve: Seni Peygamber'e söyledim; bir şey demedi, dedi. ayrıldım, nihayet mescidde minberin yanındaki topluluğun beraberinde oturdum. Sonra yine vicdanımda hissettiğim şey bana galebe etti. Uşağa geldim. O evvelki gibi söyledi. Ben yine minberin yanındaki topluluğun beraberinde oturdum. Sonra yine vicdanımda hissettiğim şey bana galebe etti. Tekrar uşağa geldim. Ve: Omer için izin iste! Dedim. bir öncekinin benzerini söyledi. Ben de döndüm, giderken baktım, uşak beni çağırıyor: Rasûlüllah sana izin verdi, dedi. üzerine huzuruna girdim. Baktım ki, Rasûlüllah bir hasırın kumları üzerine yan yatmış, kendisiyle hasır arasında bir döşek yok, kumlar vücûdunun yan tarafında iz yapmış; kendisi, içi hurma lîfi doldurulmuş deriden bir yastığa dayanmış idi. Kendisine selâm verdim. Sonra ayakta dikelerek: Kadınlarını boşadın mı? Dedim. Gözünü bana doğru yükseltti de: \"Hayır\", dedi. ben yine ayakta dikelerek(Rasûlüllah hoşnutluğa dönüyor mu, yahut O'nun kalbini hoş edecek veya öfkesini sâkinleştirecek bir söz söyleyeyim mi diye) bakınarak, şöyle dedim: Yâ Rasûlallah! Eğer beni düşünürsen, bilirsin ki, biz Kureyş topluluğu kadınlara galebe ediyor idik. Sonra bir kavim üzerine geldik ki, kadınları onlara galebe ediyorlar. bu sözü söyleyince, Peygamber gülümsedi. Sonra ben şöyle dedim: Eğer beni düşünürsen bilirsin. Ben Hafsa'nın yanına girdim de: Sakın arkadaşının Peygamber'e senden daha güzel ve daha sevgili olması seni aldatmasın -Âişe'yi kastediyor-, dedim. bir daha gülümsedi. Ben O'nun gülümsediğini gördüğüm zaman hemen oturdum ve gözümü kaldırıp evinin içine baktım. Vallahi evin içinde tabaklanmamış üç hayvan derisinden başka gözü döndürecek hiçbir eşya görmedim. Bunun üzerine ben: (Yâ Rasûlallah!) Allah'a duâ et, ümmetine genişlik versin. Farslar ve Romalılar'a genişlik verilmiş ve onlara dünyâ ihsan olunmuş; Halbuki onlar Allah'a ibâdet etmiyorlar, dedim. Bunu söyleyince dayanmış iken doğruldu da: \"Sen bir şekk içinde misin? Ey Hattâb oğlu! Onlar hoşlukları dünyâ hayâtında peşin verilip, geçiştirilen birer kavimdir\" buyurdu. Ben de: Yâ Rasûlallah, benim için istiğfar ediver, dedim. Peygamber Hafsa Âişe'ye açıkladığı zaman o sözden dolayı ayrılıp inzivaya çekilmiş ve kadınlarına küsmüş olduğundan ötürü, bir ay kadınların yanına girmeyeceğim, demişti. Bu zaman içinde Allah, Peygamberini azarladı(et-Tahrîm-. 1-4). Yirmi dokuz gece geçince Rasûlüllah, Âişe'nin yanına girdi ve Âişe ile başladı. Âişe O'na: (Yâ Rasûlallah!) Sen bizim yanımıza bir ay girmemeye yemîn etmiştin. Halbuki biz yirmi dokuz (uncu) gecenin sabahında olduk; ben bu geceleri hakkıyle sayıyorum, dedi. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem): \" (Kendisinde yemîn ettiğim) ay, yirmidokuzdur; işte bu ay da yirmi dokuz oldu\" buyurdu. dedi ki: Müteakiben muhayyer kılma âyeti (el-Ahzâb: 28-29) indirildi. Peygamber ilk kadın olarak benimle başladı ve şöyle dedi: \"Ben sana bir emir anlatacağım. Cevâb hususunda acele etmemenden dolayı sana bir serzeniş yoktur, tâ ki ebeveynine danışasın\". dedi ki: Kat'î biliyorum ki, ebeveynim bana senden ayrılmamı emretmezler. Peygamber şöyle dedi: \"Allah şöyle buyurdu: “Ey Peygamber! Zevcelerine şunu söyle: Eğer siz dünyâ hayâtını ve onun zînetini istiyorsanız» gelin size boşama bedellerini vereyim de, hepinizi güzellikle salıvereyim. Yok eğer Allah’ı ve Resûlü'nü ve âhiret yurdunu istiyorsanız, haberiniz olsun ki Allah içinizden güzel hareket edenlere pek büyük bir mükâfat hazırlamıştır\"(el-Ahzâb: 28-29). de: Ay! Ben bunun hakkında mı ebeveynime danışacağım? Ben elbette Allah'ı ve Rasûlü'nü ve âhiret yurdunu isterim, dedim. Sonra Rasûlüllah, bütün kadınlarını böyle muhayyer kıldı; onlar da hep Âişe'nin dediği gibi söylediler",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		}
	]
}