{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"46": "Oppressions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "Abdullah İbn Abbas r.a.'den rivayet edilmiştir: Allah'ın, haklarında \"Çünkü kalpleriniz sapmıştı\" [Tahrim 4] buyurduğu Hz. Nebi'in iki hanımının hangileri olduğunu Ömer'e sormayı eskiden beri çok arzuluyordum. Onunla birlikte hacca gittim. Yolda bir yöne saptı, ben de ibriği alıp onun tarafına saptım. İhtiyaç giderdi ve geldi. Suyunu döktüm ve abdest aldı. \"Ey mu'minlerim emiri! Allah'ın, haklarında \"Çünkü kalpleriniz sapmıştı\" buyurduğu Hz. Nebi'in iki hanımı hangileriydi?\" diye sordum. \"Abbas'ın oğlu! Sana şaşıyorum. Aişe ve Hafsa'ydı dedi. Sonra Ömer olayı anlatmaya başladı: Ben, ensardan bir komşum la birlikte Ümeyye İbn Zeyd oğullarının mahallesinde oturuyordum. Orası Medine'nin yüksek bir yerindeydi. Nöbetleşe Hz. Nebi'in yanına gidiyorduk. Bir gün o, bir gün ben gidiyordum. Ben indiğimde o gün Hz. Nebi'in buyurduğu emirleri vb. olayları haber veriyordum. O da indiğinde öyle yapıyordu. Biz Kureyşliler kadınlara sözü geçen bir topluluktuk. Medine'ye geldiğimizde onların kadınlarının onlara sözünün geçtiğini gördük. Bizim kadınlarımız da zamanla Medine kadınlarının bu özelliğini almaya başladılar. Bir ara ben hanıma kızdım; bana karşılık verdi. Bu yaptığını yadırgadığımı belli ettim. \"Sana karşılık vermemi niye yadırgıyorsun? Hz. Nebi'in hanımları da ona karşılık veriyorlar. Hatta onlardan biri var ki, bugün Hz. Nebi'in geceye kadar yanına uğramayacak\" dedi. Bu söylediği beni ürküttü ve \"Onlardan hangisi bunu yapacaksa o kendine çok yazık eder\" dedim. Sonra elbisemi giyinip Hafsa'nın yanına giderek: \"İçinizden biri bugün geceye kadar Hz. Nebi'in yanına gitmeyecek mi?\" dedim. O da \"evet\" diye cevap verdi. \"O kendine yazık etmiş, ziyan etmiş. Resulü'nü kızdırdığı için Allah'ın ona kızacağından ve helak olacağından güvencesi var mı? Allah Resulü'ne çok üsteleme ve o sana kızdığında sözüne karşılık verme. Onu yatağında yalnız bırakma ve istediğin şeyi benden iste. Ortağının (yani Aişe'nin) Hz. Nebi'in en çok sevdiği ve onun en gözde hanımı olması sakın ha seni kıskançlıktan dolayı yanlışlığa sürüklemesin\" dedim. Gassan kabilesinin bizimle savaşmak için hazırlık yaptığını konuşuyorduk. Komşum kendi sırası gelince aşağıya indi ve yatsı vakti döndü. Sert bir şekilde kapımı çaldı ve \"kimse yok mu?\" dedi. Telaşla hemen yanına çıktım. \"Çok büyük bir hadise oldu\" dedi. \"Ne oldu? Gassan kabilesi mi geldi?\" dedim. \"Yok\" dedi \"çok daha önemli bir şey. Allah Resulü, hanımlarını boşadı.\" \"Hafsa kendine yazık etti, kötü oldu\" dedim. Bunun olmasını zaten bekliyordum. Hemen üzerimi giyindim ve gidip Nebi (Sallallahu aleyhi ve Sellem) ile birlikte sabah namazını kıldım. Hz. Nebi küçük odasına girip yalnız kaldı. Hafsa yanıma geldi, ağlıyordu. \"Niye ağlıyorsun? Seni uyarmamış mıydım Allah Resulü sizi boşadı mı?\" dedim. \"Bilmiyorum. O şimdi odasında\" dedi. Çıkıp minbere geldim. Minberin çevresinde bir grup insan vardı. Ağlıyorlardı. Onlarla kısa bir süre oturdum. Sonra içimdeki duygu baskın geldi ve Hz. Nebi'in bulunduğu odaya geldim. Hz. Nebi'in siyah! kölesine \"Ömer'in içeri girmesi için izin iste\" dedim. Içeri girdi, Hz. Nebi'le konuştu. Sonra çıkıp \"Senin geldiğini söyledim, ama sustu\" dedi. Ben de oradan ayrıldım ve minberin yanındaki grupla birlikte oturdum. Sonra duygularım yine ağır bastı ve O'nun odasına gittim. Köle yine aynı şeyi söyledi. Ben de minberin yanındaki grupla birlikte oturdum. Sonra yine duygularım ağır bastı ve gelip \"Ömer için izin iste\" dedim. Yine aynı şeyi söyledi. Tam dönmüş ayrılıyordum ki köle arkamdan çağırdı:\"Allah Resulü içeri girmen için izin verdi.\" Yanına girdim. Bir hasır üzerine uzanmış yatıyordu. Altında döşek yoktu. Hasırın yüzeyinin izi vücuduna çıkmıştı. Başında içi hurma yaprağı ile doldurulmuş deri bir yastık vardı. Selam verdim. Sonra oturmadan \"Hanımlarını boşadın mı?\" dedim. Başını bana doğru kaldırdı ve \"hayır\" dedi. Sonra yine oturmadan Hz. Nebi'e (onun kendini nasıl hissettiğini anlayabilmek için) latife yollu \"Ey Allah'ın Resulü! Hatırlar mısın biz Kureyşliler kadınlara sözümüzü geçirirdik. Hanımlarının sözünün geçtiği bir topluluğa gelince (onların sözü geçer oldu)\" dedim. Bu sözüm üzerine Hz. Nebi Sallallahu Aleyhi ve Sellem güıümsedi. Sonra şöyle devam ettim \"Haberin olsun ki ben Hafsa'nın yanına gittim ve ona \"Senin ortağının (Aişe'nin) Hz. Nebi'in en sevdiği ve onun en gözde hanımı olması sakın ha seni kıskançlıktan dolayı yanlışlığa sürüklemesin\" dedim.\" Hz. Nebi bir daha gülümsedi. Onun gülümsediğini görünce oturdum. Sonra odasına şöyle bir göz attım. Allah'a yemin ederim ki odasında üç tane deri’den başka bir şey görmedim. 'Allah'a dua etsen de ümmetinin rızkını artırsa. İranlılar ve Rumlar Allah'a ibadet etmedi~ri halde onların rızkı artırılmış, dünyanın hepsi onlara verilmiş\" dedim. Yaslanmıştı. \"Hattab'ın oğlu! Bir şüphen mi var yoksa? Onlar, nasipleri kendilerine dünya hayatında peşin verilenlerdir\" buyurdu. \"Ey Allah'ın Resulü! Allah'tan benim bağışlanmamı dilesen\" dedim. Hz. Nebi Hafsa'nın Aişe'ye haber verdiği o sözünden dolayı odasına çekilmişti. Hanımlarına kızdığı için \"Bir ay onların yanına girmeyeceğim\" demişti. Bunun üzerine Allah onu azarladı. Aradan 29 gün geçince Aişe'nin yanına girdi, ilk ondan başlamıştı. Aişe ona \"Sen bizim yanımıza bir ay girmemek için yemin etmiştin. Biz tam 29 gün geçirdik. Ben günleri teker teker sayıyorum\" dedi. Hz. Nebi \"Ay yirmi dokuz gündür\" dedi. O ay yirmi dokuz gün çekiyordu. Aişe şöyle demiştir: \"Bu olay üzerine tahyır ayeti (Hz. Nebi'in hanımlarını muhayyer bırakan ayet) indi. Hz. Nebi ilk benden başlamıştı. Bana \"Sana bir şey hatırlatacağım. Ana babana danışmadan acele karar vermen gerekmiyor\" buyurdu. Aişe \"Ben biliyorum ki annem babam bana senden ayrılmamı buyuracak değiller\" dedi. Sonra Hz. Nebi Sallallahu Aleyhi ve Sellem \"Allah (c.c.) \"Ey Nebi! Eşlerine söyle: Eğer dünya dirliğini, süsünü (refahını) istiyorsanız, gelin size boşanma bedellerinizi vereyim de, sizi güzellikle salıvereyim. Eğer Allah'!, Nebi'ini ve ahiret yurdunu diliyorsanız, bilin ki, Allah, içinizden güzel davrananlar için büyük bir mükafat hazırlamıştır\" [el-Ahzab 28,29] buyuruyor\" dedi. Ben \"Ben bu konuda mı anne babama danışacağım. Elbette ki ben Allah'ı, Resulü'nü ve ahiret yurdunu tercih ediyorum\" dedim. Sonra Hz. Nebi diğer hanımlarını muhayyer bıraktı. Onlar da aynen Hz. Aişe'nin söylediğini söylediler",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		}
	]
}