{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"51": "Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "Bana kardeşim Ebû Bekr Abdulhamîd, Süleyman ibn Bilâl'den; o da Hişâm ibn Urve'den; o da Bâbası Urve'den; o da Âişe'den şöyle tahdîs etti (Âişe -r. anha- şöyle demiştir): Rasülullah'ın kadınları iki fırkaya ayrılmışlardı. Bir fırkada Âişe, Hafsa, Safiyye, Sevde vardı. Diğer grupta ise Ümmü Seleme ile Rasûlüllah'ın öteki kadınları bulunuyordu. Müslümanlar, Rasûlüllah'ın Âişe'ye sevgisini pek iyi bildiklerinden, bunlardan birisinin yanında Rasûlüllah'a vermek istediği bir hediyesi bulunursa, o hediyesini Rasûlüllah'ın, Âişe'nin evinde bulunduğu zamana kadar geri bırakır da, hediye sahibi bu hediyesini Rasûlüllah, Âişe'nin evinde iken gönderirdi. Bu sebebden Ümmü Seleme grubu dedikoduya başladı da, bunlar Ümmü Seleme'ye: Sen Rasûlüllah'a, insanlarla konuşup onlara: Her kim Rasûlüllah'a bir hediye vermek isterse, o kimse Rasûlüllah kadınlarından hangisinin evinde bulunursa bulunsun, hediyesini versin! Demesini söyle, demişlerdi. Seleme kadınların kendisine söyledikleri bu sözü Rasûlüllah'a söyledi. Fakat Rasûlüllah ona hiçbir cevâb vermedi. Ümmü Seleme grubundaki kadınlar, Ümmü Seleme'den vaziyeti sorduklarında, o da: Rasûlüllah bana bir şey söylemedi, diye cevap verdi. Onlar da ona: Rasûlüllah'a, dediğimizi bir daha söyle, dediler. da Rasûlüllah'ın nevbeti ona dolaşıp geldiğinde, yukarıda geçtiği gibi mes'eleyi Rasûlüllah'a arz etti. FakatRasûlüllah bu sefer de ona bir şey söylemedi. Ümmü Seleme grubundaki kadınlar vaziyeti Ümmü Seleme'den sorduklarında o da: Rasûlüllah bana birşey söylemedi, dedi. Onlar da Ümmü Seleme'ye: Artık Rasûlüllah sana bir cevâb verinceye kadar bu dileğimizi Rasûlüllah'a söyle, dediler. Hakîkaten Ümmü Seleme de Rasûlüllah'a kendi nevbetinde dönüp geldiğinde söyledi. Bu defa Rasûlüllah, Ümmü Seleme'ye: \"Sakın Âişe hakkında söylenip de bana ezâ verme, bana hiçbir kadının örtüsü altında bulunduğum sırada vahiy gelmez de yalnız Âişe'nin evinde (onun nevbetinde) iken vahiy gelir\" buyurdu. dedi ki: Ümmü Seleme: Yâ Rasûlallah, ben de sana ezâ vermekten Allah'a tevbe ediyorum, dedi. Ümmü Seleme grubundaki kadınlar Rasûlüllah'ın kızı Fâtima'ya müracaat ettiler ve onu Rasûlüllah'a gönderdiler de: Yâ Rasûlüllah! Kadınların Ebû Bekr'in kızı hakkında Allah'tan senin için adalet istiyorlar, demesini rica ettiler. da Rasûlüllah'a bunları söyledi. Rasûlüllah: \"Ey kızcağızım! Benim her sevdiğimi sen sevmez misin?\" buyurdu. da: Evet severim, dedi.(Müslim'in rivayetinde: Öyle ise sen de Âişe'yi sev! buyurdu, ziyâdesi vardır.) Fâtıma kadınlara döndü ve onlara olup biteni haber verdi. Kadınlar Rasûlüllah'a tekrar müracaat etmesini Fâtıma'dan istediler. Fakat Fâtıma tekrar dönmeyi kabul etmedi. Bunun üzerine Ümmü Seleme grubu Zeyneb bintu Cahş'ı gönderdiler. Zeyneb,Rasûlüllah'a geldi ve sertlikle söze başlayıp: Yâ Rasûlallah! Kadınların İbnu Ebî Kuhâfe'nin kızı hakkında Allah'tan senin için adalet istiyorlar, dedi. sesini yükselterek, o sırada oturmakta olan Âişe'ye saldırıya kadar ileri gitti de ona sövdü. Nihayet Rasûlüllah, karşılık verecek mi diye Âişe'ye bakmağa başladı. Urve dedi ki: Bu sırada Âişe söze başladı ve Zeyneb'e sözlerini geriye çevirdi ve neticede onu susturdu. Âişe dedi ki: Bunun üzerine Peygamber(sallallahü aleyhi ve sellem) Âişe'ye baktı da: \"Muhakkak ki o, Ebû Bekr'in kızıdır\" buyurdu şöyle dedi: Fâtıma'nın kıssası olan son kelâm Hişâm ibn Urve'den; o da bir adamdan; o da ez-Zuhrî'den;'o da Muhammed ibn Abdirrahmân'dan senediyle olmak üzere zikrolunuyor. Mervân, Hişârn'dan; o da Urve'den \"İnsanlar hediyelerini Âişe'nin gününde vermeyi kasdediyorlardı\" diye söyledi. Ve yine Hişâm ibn Urve, hem Kureyş'ten bir adamdan, hem de kölelerden bir adamdan; o da Zuhrî'den; o da Muhammed ibn Abdirrahmân ibni'l-Hâris ibn Hişâm'dan senediyle: Âişe: Ben Peygamber'in yanında idim; Fâtıma izin istedi, dedi",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		}
	]
}