{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2711,
			"arabicnumber": 2711,
			"text": "İbn Şihâb şöyle demiştir: Bana Urve ibnu'z-Zubeyr haber verdi; o, Mervân ibnu’l-Hakem ve el-Misver ibn Mahrame(radıyallahü anh)'den işitmiştir. Bu iki sahâbî,Rasûlüllah'ın diğer sahâbîlerinden naklen haber veriyorlardı. Bunlardan herbiri şöyle demiştir: ibn Amr Hudeybiye barışı günü barış metnini yazmaya girişince, Süheyl ibn Amr'ın Peygamber'e şart eylediği şeyler içinde şu da vardı: \"Bizden sana bir adam gelirse, o senin dîninde dahî olsa, onu muhakkak bize geri verirsin ve bizimle onun arasını boşaltırsın\" dedi. Müslümanlar bu şartı beğenmeyip çirkin gördüler ve bu şarttan dolayı öfkelendiler. Kureyş elçisi Süheyl ise bu şartta diretti. Onun bunda dayatması üzerine, Peygamber de barış yazısını bu şart üzere yazdırdı. Peygamber o gün Mekke'den kaçıp gelmiş olan Ebû Cendel'i de, bu şart uyarınca ve Süheyl'in ısrarlı isteği ile babası Süheyl ibn Amr'e geri verdi. Bu barış anlaşması müddeti içinde, müslümân olarak gelmiş olsa da, Mekkeliler'den Peygamber'e gelen her erkeği Peygamber muhakkak geri verdi. sonra mü'min kadınlar da muhacirler olarak geldiler. Ve Ukbe ibn Ebî Muayt'ın kızı Ümmü Kulsüm de kadınlık çağına erişmiş olduğu hâlde, o gün Rasûlüllah'ın yanına çıkıp gelenlerden idi. Müteakiben ailesi gelerek Peygamber'den Ümmü Kulsüm'ü kendilerine geri vermesini istediler. Fakat Peygamber Ümmü Kulsüm'ü ailesine vermemiştir. Çünkü kendisine gelen bu kadınlar hakkında Allah şu âyeti indirmiştir: îmân edenler! (Kendi ifâdelerince) mü'min kadınlar muhacirler olarak geldikleri zaman, onları imtihan edin. Allah onların îmânlarını daha iyi bilir ya. Fakat siz de mü'min kadınlar olduklarına bilgi edinirseniz, onları kâfirlere döndürmeyin. Bunlar onlara halâl değildir. Onlar da bunlara halâl olmazlar. Kâfir zevçlerinin bu kadınlara sarf ettikleri mehri onlara geri verin. Sizin onları nikâhla almanızda, mehirlerini verdiğiniz takdirde, üzerinize bir günâh yoktur. Kâfir zevcelerinizi (nikâhınız altında) tutmayın. (Kâfirler de bu kadınlara) harcadıkları (mehri) istesinler. Bu, Allah’ın hükmüdür. Aranızda O hükmeder. Allah hakkıyla bilen tam hüküm ve hikmet Sahibidir\" (el-Mümtehine: 10)",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}