{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "Sehl İbn Sa'd es-Saidi anlatıyor: \"Resulullah Sallallahu Aleyhi ve Sellem, müşriklerle karşı karşıya geldi ve savaş başladı. Bir ara Resulullah Sallallahu Aleyhi ve Sellem da düşmanlar da karargahlarına döndüler. Nebi Sallallahu Aleyhi ve Sellem'in ashabı içinde bir yiğit vardı; önüne gelen ve ordusundan ayrı düşen düşman askerlerini tek tek takip ediyor ve kılıcıyla vurup yere seriyordu. İnsanlar onun hakkında: \"Bugün içimizden hiç kimse bu adam gibi mükafat almadı\" demeye başladılar. Fakat Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Buna rağmen o cehennemliklerdendir\" buyurdu. Bu o anda orada bulunan herkesi şaşkına çevirmişti. İçimizden birisi: \"Ben bu adamı takip edeceğim\" deyip onun peşine takıldı; onun durduğu yerde duruyor, harekete geçtiği zaman hareket ediyordu. Bir süre sonra kahramanca çarpışan bu adam çok ağır bir yara aldı ve bir an önce ölmek için intihar etti. O kılıcın kabzasnı yere dayadı ve ucunu da tam göğsünün ortasına yerleştirip üzerine yüklenerek kendisini öldürdü. Bu olayı gören adam derhal Nebi Sallallahu Aleyhi ve Sellem'in yanına geldi ve: \"Şehadet ederim ki sen Allah'ın Resulüsün\" dedi. Nebi Sallallahu Aleyhi ve Sellem: \"Ne oldu, niçin bunu söyleme ihtiyacı duydun?\" diye sorunca adam şöyle cevap verdi: \"Biraz önce insanların hayranlıkla bahsettiği ve sizin cehennemlik olduğunu söylediğiniz adam vardı ya ben sizin o sözünüz üzerine onu takip ettim ve her hareketini kontrol etmeye başladım. Adam savaşırken çok ağır bir yara aldı ve bir an önce ölmek istedi. Bunun için de kılıcın kabzasını yere dayadı ve ucunu da tam göğsünün ortasına yerleştirip üzerine yüklenerek kendisini öldürdü.\" Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Bir kimse insanların müşahede edebildiği davranışları bakımından cennetliklerin amelini işler fakat cehennemliklerden olur. Buna karşılık bir kimse insanların müşahede edebildiği davranışları bakımından cehennemliklerin amelini işler fakat cennetliklerden olur. \" Tekrar: 4202, 4207, 6493, 6607",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		}
	]
}