{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "Ebû Hâzım'dan; o da Sehl ibn Sa'd es-Sâidî'den şöyle tahdîs etti: Rasûlüllah(sallallahü aleyhi ve sellem) ve müşrikler karşılaşıp harb ettiler. (O günün harbi sona erip)Rasûlüllah kendi askerinin karargâhına, düşman tarafı da kendi askeri karargâhlarına dönmüşlerdi. Rasûlüllah'ın sahâbîleri içinde bir adam vardı ki, o, düşman ordusundan ayrı düşen yahut orduya katılmamış bulunan her bir düşmanın arkasını bırakmayıp amansız ta'kîb ediyor ve onu kılıcıyla vuruyordu. Bir sözcü: Bu gün bizden hiçbir kişi fulânın gösterdiği kahramanlık derecesinde yeterlilik gösteremedi! Bunun üzerine Rasûlüllah: \"Fakat o, cehennem ehlindendir!\" buyurdu. Sahâbîlerden biri: Ben o kimseyle beraber olup onu gözleyeceğim, dedi , dedi ki: Bu sahâbî o adamın beraberinde harb sahasına çıktı ve harb saffının neresinde durdu ise o da onunla beraber durdu. O, harbde ne derece çeviklik gösterdi ise, o sahâbî de onunla bile çeviklik gösterdi. dedi ki: Nihayet o fulân kimse ağır bir surette yaralandı. (Bu ağır yara acısıyle) ölümü çabuklatmak istedi de kılıcının demirini yere koydu, kılıcın sivri tarafını da iki memesi arasına koydu, sonra kılıcın üstüne meyledip yüklendi. Ve bu suretle kendini öldürdü. Bunun üzerine onu izleyip gözeten sahâbî(Huzâî) Rasûlüllah'ın yanına vardı da: Şehâdet ederim ki, Sen muhakkak Allah'ın Rasûlü'sün, dedi. Rasûlüllah: \"Bu (şehâdetin sebebi) nedir?\" diye sordu. Huzâalı sahâbî şöyle dedi: Biraz evvel şu cehennem ehlinden olduğunu söylediğin kişi; işte onun hakkında verdiğiniz haberi insanlar büyüttü. Ben de: Ben sizin için bu adamı izleyip gözetleyeceğim dedim. Ve hakîkaten arkası sıra çıkıp, onun her hareketini araştırdım. Sonunda bu adam ağır surette yaralandı. Ve ölümün çabuk gelmesini isteyerek kılıcının demirini yere, keskin ağzını da iki memesi arasına koydu. Sonra kılıcının üstüne meyledip yüklendi. Ve bu suretle kendisini öldürdü. Bunun üzerine Rasûlüllah(sallallahü aleyhi ve sellem): \"Şübhesiz bir kısım adam vardır ki, insanlara görünen işlerde cennet ehline-yaraşan hayırlı işler yapar. Halbuki o, cehennem ehlindendir. Ve yine insanlardan öyle kimse vardır ki, insanlara görünen işlerde cehennem ehlinin yapacağı kötü işler yapar. Halbuki o, cennet ehlindendir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 112
			}
		}
	]
}