{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3007,
			"arabicnumber": 3007,
			"text": "Hz. Ali anlatıyor: Resulullah Sallallahu Aleyhi ve Sellem, beni, Zübeyr'i ve Mikdad İbnü'l-Esved'i görevlendirerek şu talimatı verdi: \"Derhal yola çıkın! Tarif ettiğim yönde ilerleyeceksiniz ve bir bahçeye varacaksınız. Orada bir kadın bulacaksınız. Bu kadının yanında bir mektup var. O mektubu ondan alın!\" Biz de hemen yola koyulduk ve atlarımızı dört nala sürdük. Bize tarif edildiği gibi o bahçeye ulaştık ve kadını gördük. Kadına mektubu hemen bize vermesini söyledik. Kadın önce inkar etti ve: \"Bende mektup falan yok!\" dedi. Biz de onu tehdit ederek: \"Ya mektubu verirsin ya da (aramak için) üstünü başını açarız\" dedik. Bunun üzerine kadın mektubu saçlarının arasından çıkarıp bize verdi. Biz de mektubu Resul-i Ekrem Sallallahu Aleyhi ve Sellem'e getirdik. Bu mektubu Hatib İbn Ebi Belte'a Mekke'li müşriklere yazmış ve Resulullah Sallallahu Aleyhi ve Sellem'in planladığı bazı eylemler hakkında bilgiler vermişti. Nebi Sallallahu Aleyhi ve Sellem Hatib'i çağırtıp ona: \"Ey Hatib, bu da neyin nesil?\" diye çıkıştı. Hatib şöyle cevap verdi: \"Ey Allah'ın Resulü, benim durumumu araştırmadan acele ile hemen karar verme! Ben Kureyş kabilesine mensup birisi değilim, onlara sonradan katılan bir insanım. Fakat senin yanındaki bu muhacirlerin her birinin Mekke'de bulunan Kureyşlilerle akrabalık bağları vardır. Bu sayede hem ailelerini hem de mallarını koruyorlar. Ben de Kureyş ile böyle bir akrabalık bağım bulunmadığı için orada bulunan ailemi korumalarını sağlamak üzere bir destek bulmayı istedim. Ben asla küfre sapmadım, dinimden dönmedim ve Müslüman olduktan sonra kesinlikle küfre rıza göstermiş de değilim.\" Resulullah Sallallahu Aleyhi ve Sellem: \"Hdtib size doğruyu söyledi\" buyurdu. Hz. Ömer ise iyice hiddetlendi ve: \"Ey Allah'ın Resulü, müsaade edin şu münafığın boynunu vurayım!\" dedi. Resul-i Ekrem Sallallahu Aleyhi ve Sellem de şöyle buyurdu: \"Fakat o, Bedir savaşına katılmış biri. Hem ne biliyorsun, belki de Allah Tedld Bedir ehlinin / Bedir savaşına katılanlann her haline bakmış ve şöyle buyurmuştur: Dilediğinizi yapın, ben sizleri bağışladım",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 216
			}
		}
	]
}