{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"56": "Fighting for the Cause of Allah (Jihaad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3059,
			"arabicnumber": 3059,
			"text": "Bize İmâm Mâlik, Zeyd ibn Eslem'den; o da Bâbası ve Omer'in âzâdlısı Eslem'den tahdîs etti ki, Omer ibnu'l-Hattâb(radıyallahü anh) Beytu’l-mâle âid bir koruluk üzerine Huneyy denilen bir kölesini me'mûr ta'yîn etti de ona: Yâ Huneyyu! Kollarını müslümânlardan topla(yânı onlara zulümden ellerini çek) ve mazlumun bedduasından da sakın. Çünkü mazlumun duası (Allah tarafından) kabul edilmiştir. Sen az sayılı deve bölüğü sahibini ve az sayılı koyun sürüsü sahibini koruluğa ve mer'aya girdir. Bu az sayılı sürü sahiblerinden önce yahut doğrudan kendilerini tercih ile Abdurrahmân ibn Avf'ın develerini, Usmân ibn Affân'ın develerini koruya girdirmenden seni men' ederim. Çünkü bu son iki zât zengindirler. Eğer bunların sürüleri helak olursa, bu iki zât hurmalara ve ekinlere dönerler. Halbuki küçük deve bölüğü sahibi, küçük koyun sürüsü sahibi, eğer bunların hayvanları helak olursa bunlar oğullarıyle -yahut: evleriyle (zevceleriyle)- gelirler de: \"Ey Mü'minlerin Emîri! (Bizler fakirleriz, bizler Beytu'l-mâl'den almaya daha haklıyız)\" derler. Böyle feryâd eden fakirleri ben hiç muhtaçlar olarak terkeder miyim? Hey Babasız kalası?(Ben fakirleri yardımsız bırakmam). Su ve ot bana altın ve gümüşten (yani Beytu'l-mâl'den bu iki ma'deni harcamaktan) daha kolaydır. Allah'a yemin olsun ki, onlar elbette benim kendilerine zulmettiğimi düşüneceklerdir. Şübhesiz bu arazîler onların beldeleridir. Onlar Câhiliyet devrinde bu arazîleri korumak üzere harb etmişler ve yine bu arazîler üzerinde İslâm Dîni'ne girmişlerdir. Nefsim elinde olan Allah'a yemîn ederim ki, ben Allah yolunda cihâd için binek bulamayanları yükleyeceğim deve ve atlar nev'inden mal mevcûd olmayaydı, onların beldelerinden bir karış yeri onlara karşı himaye edip koruluk yapmazdım",
			"grades": [],
			"reference": {
				"book": 56,
				"hadith": 264
			}
		}
	]
}