{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3092,
			"arabicnumber": 3092,
			"text": "Urve İbnü'z-Zübeyr, Hz. Aişe'nin şöyle dediğini nakletmiştir: \"ResuluIlah Sallallahu Aleyhi ve Sellem vefat ettikten sonra Allah'ın kendisine fey olarak lutfettiği araziler bırakmıştı. Nebi Sallallahu Aleyhi ve Sellem'in kızı Fatima, Hz. Ebu Bekir es-Sıddik'tan bu arazilerden kendisine düşen miras payının verilmesini talep etti.\" Tekrar: 3711, 4035, 4240, 6725 [-3093-] Ebu Bekir r.a. ise ona şöyle cevap verdi: Resulullah Sallallahu Aleyhi ve Sellem \"Biz miras bırakmayız, bize kimse mirasçı olmaz. Bizim geride bıraktığımız ne varsa hepsi sadakadır\" buyurdu. Fatıma bu cevaba çok kızdı ve Ebu Bekir'i terk edip gitti. Ölünceye kadar da bir daha onunla görüşmedi. Fatıma, Resulullah Sallallahu Aleyhi ve Sellem'in vefatından sonra altı ay yaşadı.\" Aişe (r.anha) şöyle demiştir: \"Hz. Fatıma, Resul-i Ekrem Sallallahu Aleyhi ve Sellem'in vefat ettikten sonra bıraktığı Hayber ve Fedek arazileri ile Medine'deki sadakalarından (Nadiroğulları ile Kurayza oğullarından payına düşen arazilerden) kendisine düşen payı Hz. Ebu Bekir'den talep etti. Fakat Hz. Ebu Bekir onun bu isteğini kabul etmedi ve şöyle dedi: \"Ben Resulullah Sallallahu Aleyhi ve Sellem'in uygulamakta olduğu hiçbir şeyi terk edecek değilim; O s.a.v. ne yaptıysa ben de onu yaparım. Ben O'nun s.a.v. emirlerinden birini bile terk edecek olsam doğru yoldan ayrılacağımdan korkarım.\" Ancak daha sonra Hz. Ömer, Resulullah Sallallahu Aleyhi ve Sellem'in Medine'deki tarlalarını Hz. Ali ile Abbas'a verdi. Hayber ve Fedek'teki arazileri ise kimseye vermeyip elinde tuttu. Hz. Ömer şöyle demişti: \"Bu iki yerdeki araziler Nebi Sallallahu Aleyhi ve Sellem'in sadakalarıdır. Bunlar olağanüstü durumlarda gelirlerinden yararlanmak için Resulullah Sallallahu Aleyhi ve Sellem'e ayrılmıştır. Bu bakımdan söz konusu arazilerin idaresi ve sorumluluğu devlet başkanına bırakılmıştır. Zaten bu arazilerle ilgili uygulama günümüze kadar hep böyle olmuştur. \" Tekrar: 3712, 4036, 4241, 6726",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}