{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3131,
			"arabicnumber": 3131,
			"text": "Mervan İbnü'l-Hakem ile Misver İbn Mahreme'den nakledilmiştir: \"Hevazin kabilesi heyeti Müslüman olup mallarının ve esir alınan üyelerinin geri verilmesini talep etmek üzere Nebi Sallallahu Aleyhi ve Sellem'in yanına geldiğinde Resul-i Ekrem Sallallahu Aleyhi ve Sellem onlara şöyle dedi: \"Benim en çok hoşuma giden söz doğru olanıdır. Şimdi ya esirlerinizi seçin ya da mallarınızı!\" Ben bu heyetinizin bu şekilde İslam'a girmiş olarak gelmesini bekledim. Nebi Sallallahu Aleyhi ve Sellem, Taif'ten döndüğünde onların karar vermelerini on günden daha fazla bekledi. Hevazin kabilesi Resulullah Sallallahu Aleyhi ve Sellem'in hem malları hem de esirleri vermek yerine sadece bunlardan birisini vereceğini anlayınca: \"Biz esir alınan üyelerimizi seçiyoruz\" dediler. Nebi Sallallahu Aleyhi ve Sellem O anda kalkıp ve müslümanlara yönelip Allah Teala'yı layık olduğu şekilde övdükten ve hamd-ü senadan sonra şunları söyledi: \"Şimdi asıl konuyu arz ediyorum. İşte sizin şu kardeşleriniz tevbe edip Müslüman olarak bize geldiler. Ben de esirlerini onlara iade etmeyi uygun gördüm. İsteyen gönül rızası ve herhangi bir bedel talep etmeksizin elindeki esiri iade etsin. Buna yanaşmayan ve kendi payını elinde tutmak isteyen varsa yine de iade etsin. Ancak Allah'ın bize lütfedeceği ilk feyden ona bunun karşılığını vereceğiz.\" Bunun üzerine orada bulunanlar: \"Biz gönül rızası içinde esirleri onlara veriyoruz ey Allah'ın Resulü!\" dediler. Nebi Sallallahu Aleyhi ve Sellem de onlara: \"Bu şekilde içinizden kimin buna izin verdiğini kimin vermediğini tam olarak anlayamayız. Bu yüzden dönün ve önde gelenleriniz durumunuzu bize arz etsin\" dedi. Onlar da döndüler ve kabilelerinin ihtiyaçlarını daha iyi bilen liderleriyle konuştuktan sonra Nebi Sallallahu Aleyhi ve Sellem'e gelip esirlerin iade edilmesine razı olduklarını ve buna izin verdiklerini söylediler. Hevazin esirleri hakkında bize ulaşan haber budur",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}