{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3133,
			"arabicnumber": 3133,
			"text": "Zehdem'in şöyle dediği nakledilmiştir: \"Biz Ebu Musa el-Eşa'ri'nin yanında bulunuyorduk. Bize tavuk yemeği getirdi. Ebu Musa'nın yanında Teymullah kabilesinden kızıl tenli olan bir zat vardı. Galiba esir veya kölelerden biri idi. Ebu Musa onu da yemeğe çağırıp şöyle dedi: \"Ben bunun iğrendirici bir şey yediğini görmüştüm. Tiksindiğim için de yemek yemeyeceğim diye yemin etmiştim.\" Ebu Musa daha sonra sözlerine şöyle devam etti: \"Gelin size yeminle ilgili bir olayı anlatayım. Biz Eş'arilerden bir grup halinde Resulullah Sallallahu Aleyhi ve Sellem'e giderek hem binrnek hem de eşyalarımızı yüklemek maksadıyla bize deve vermesini talep ettik. Fakat Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Allah'a yemin ederim ki, size deve veremem. Zira bende sizin bu ihtiyaçlarınızı görecek develer yok!\" dedi. Daha sonra Nebi Sallallahu Aleyhi ve Sellem'e ganimet olarak büyük bir deve sürüsü getirilmiş ve O (s.a.v.) de: \"Nerede o Eş'arılerden gelen grup?\" diyerek bizi sormuş. Biz gelince Nebi Sallallahu Aleyhi ve Sellem bize beş küçük deve sürüsü verilmesini emretti. Hörgüçleri beyaz olan bu develer güçlü ve semiz hayvanlardı. Fakat biz hayvanları alıp gittikten sonra: \"Eyvah biz ne yaptık! Bu develerin hiçbir bereketini göremeyiz ki!\" dedik ve Resulullah Sallallahu Aleyhi ve Sellem'e dönüp: \"Ey Allah'ın Resulü, biz sizden hem binrnek hem de eşyalarımızı taşımak için deve istediğimizde siz yemin ederek bunu yapamayacağınızı söylediniz. Ettiğiniz bu yemini unuttunuz mu?\" diye içimizdeki sıkıntıyı arz ettik. O (s.a.v.) de: \"Bu hayvanları size veren ben değilim ki! Bunları size lütfedip veren Allah'tır. Allah'a yemin ederim ki, ben herhangi bir şey için yemin ettikten sonra başka bir hususun yemin ettiğim bu şeyden daha hayırlı olduğuna kanaat getirirsem hayırlı olanı yaparım ve bozduğum yeminin keffaretini yerine getiririm. \" Tekrar: 4385, 4415, 5517, 5518, 6623, 6649, 6678, 6680, 6718, 6719, 6721, 7555",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 41
			}
		}
	]
}