{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3142,
			"arabicnumber": 3142,
			"text": "Ebû Katâde'nin himayesinde bulunan Ebû Muhammed'den tahdîs etti ki, Ebû Katâde(radıyallahü anh) şöyle demiştir: Biz Huneyn senesi Rasûlüllah'ın maiyyetinde sefere çıktık. Düşmanla karşılaştığımız zaman müslümân ordusu için bir ilerleme ve gerileme olmuştu. Bu sırada müşriklerden birini müslümânlardan bir kimse üzerine çıkmış hâlde gördüm. Hemen o düşman tarafına dolandım, nihayet arkasından onun yanına geldim ve boynu ile kürek kemiği arasından kılıçla onu vurdum. O hemen benden tarafa döndü ve beni öyle bir kucakladı ki, bu sıkı kucaklayıştan ölüm kokusunu hissettim. Sonra ona ölüm yetişti de beni salıverdi. Müteakiben Omer ibnu'l-Hattâb'a rast geldim ve: Bu insanlara ne oluyor? dedim. Omer: Allah'ın işidir, dedi. insanlar (bozulmanın ardından) döndüler, Peygamber de oturdu ve: \"Her kim bir düşmanı öldürür ve öldürdüğüne dâir beyyinesi de olursa, öldürdüğü kimsenin elbise, silâh ve diğer eşyası onundur\" buyurdu. hemen kalktım ve: Benim için kim şâhid olur? dedim, sonra oturdum. Sonra Rasûlüllah yine: \"Her kim bir düşmanı öldürür ve öldürdüğüne dâir beyyinesi de olursa, öldürdüğü kimsenin elbise, silâh ve diğer eşyası onundur\" yine ayağa kalktım ve: Benim için kim şâhid olur? deyip, sonra oturdum. Sonra Rasûlüllah üçüncü kerre bu sözlerin benzerini söyledi. Bunun üzerine bir adam: Yâ Rasûlallah, Ebû Katâde doğru söyledi, o öldürülen düşman askerinin eşyası benim yanımdadır. Artık hakkı olan bu şeyler yerine onu başka şeylerle benden yana razı kıl, dedi. Bekr es-Sıddîk: Allah'a yemîn olsun bu olmaz. Peygamber, Allah ve Rasûlü yolunda mukaatele eden Allah arslanlarından bir arslanın hakkını ibtâle yanaşmaz ve onun selebini sana veremez, dedi. üzerine. Peygamber (sallallahü aleyhi ve sellem): \"Ebû Bekr doğru söyledi\" buyurdu ve akabinde o ölü askerin eşyasını Ebû Katâde'ye verdi. Katâde şöyle dedi: Ben zırhı sattım ve onun bedeline mukaabil Benû Seleme yurdunda bir bustân satın aldım. İşte bu bustân İslâm'da aslına sâhib olduğum ilk maldır",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 50
			}
		}
	]
}