{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"57": "One-fifth of Booty to the Cause of Allah (Khumus)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3147,
			"arabicnumber": 3147,
			"text": "Enes İbn Malik (r.a.)'den nakledilmiştir: \"Allah Teala, Hevazin kabilesinden ele geçirilen malları fey olarak Resulüne lütfedince Nebi Sallallahu Aleyhi ve Sellem Kureyş'ten bazı kimselere yüzlerce deve verdi. Bunun üzerine ensardan bir grup Resulullah Sallallahu Aleyhi ve Sellem hakkında: \"Allah, Resulullah Sallallahu Aleyhi ve Sellem'i affetsin. Baksana Kureyş'e o kadar mal veriyor bizi ise bırakıyor. Halbuki kılıçlarımızdan hala onların kanları damlıyor.\" dediler. Onların bu şekilde ileri geri konuştukları Resul-i Ekrem Sallallahu Aleyhi ve Sellem'e haber verildi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem ensara bir haberci gönderip onları deriden yapılmış bir çadırın altında topladı. İçeride onlardan başka hiç kimseyi bırakmadı. Ensar toplanınca Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Söylediğiniz sözler bana ulaştı, şimdi ne diyeceksiniz?\" diye sordu. Aklı başında olan, bilge kişiler (fukaha) söz alıp şöyle dediler: \"Ey Allah'ın Resulü, içimizdeki aklı başında kimseler kesinlikle bir şey söylemediler. Fakat aramızda bazı toy delikanlılar da var. Onlar: \"Allah, Resulullah Sallallahu Aleyhi ve Sellem'i affetsin. Baksana Kureyş'e o kadar mal veriyor Ensarı ise bırakıyor. Halbuki kılıçlarımızdan hala onların kanları damlıyor\" dediler.\" Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ben küfürden yeni kurtulmuş bazı kimselere böyle mal veriyorum. Bu insanlar malları alıp giderken siz evinize Resulullah (s.a.v.) ile birlikte dönmeyi istemez misiniz? Allah'a yemin ederim ki, sizin yanınıza alıp götüreceğiniz (Nebi) onların yanlarına ahp götürecekleri (mallardan) daha hayırhdır.\" Ensar da: \"İstemez miyiz ey Allah'ın Resulü, tabi ki buna razıyız\" diye cevap verdiler. ResuI-i Ekrem Sallallahu Aleyhi ve Sellem onlara şöyle dedi: \"Siz benden sonra çok aşırı derecede bencillikler göreceksiniz. Siz Allah ile ve havzın başında Resulü ile karşılaşıncaya kadar sabredin!\" Ancak biz sabredemedik",
			"grades": [],
			"reference": {
				"book": 57,
				"hadith": 55
			}
		}
	]
}