{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3159,
			"arabicnumber": 3159,
			"text": "Cübeyr İbn Hayye'nin şöyle dediği nakledilmiştir: \"Hz. Ömer, çeşitli ülkelerdeki müşriklerle savaşmaları için büyük şehirlere ordular göndermişti. Bu savaşlar sonunda Hürmüzan Müslüman oldu. Hz. Ömer ona: \"Ben seninle düşmanlarımız ile yapacağımız savaş konusunda görüş alışverişinde bulunmak istiyorum\" dedi ve o da: \"Hay hay, Sizin düşmanınız olan bu ülkeler ile orada yaşayan ve Müslümanların düşmanı olan halk tek başlı, çift kanatlı ve çift ayaklı bir kuşa benzer. Bu kanatlardan birisi koparılsa bile kuşun iki ayağı, tek kanadı ve başı hayatını sürdürmesine yeter. Diğer kanadı da koparılacak olursa iki ayağı ve başı ile yaşamaya devam eder. Fakat kuşun kafasını gövdesinden ayırırsanız iki ayağı, iki kanadı ve kafayı işlevsiz hale getirirsiniz. Bu kuşun kafası Kisra, kanatlardan biri Kayser diğeri de pers / Fars hükümdarıdır. Sen Müslümanlara emret, Kisra'nın üzerine yürüsünler!\" diye cevap verdi.\" Bekir ve Ziyad, her ikisi de Cübeyr İbn Hayye'nin şöyle dediğini nakletmişlerdir: \"Hz. Ömer bir ordu kurup bizi bu ordu da görevlendirdi. Başımıza da komutan olarak Nu'man İbn Mukarrin'i atadı. Biz sefere çıkıp düşman topraklarına girince Kisra'nın komutanlarından birisi kırk bin kişilik bir ordu ile bizi karşıladı. Bir tercüman kalkıp: \"İçinizden biri bizimle konuşsun!\" dedi. Bunun üzerine Muğıre: \"İstediğini sor bakalım!\" dedi. Tercüman da: \"Siz kimsiniz, burada ne işiniz var?\" dedi. Muğire ona şöyle cevap verdi: \"Bizler Araplarız. Daha önce hiç düşünemeyeceğiniz kadar bedbaht, sıkıntılı ve çaresiz bir durumda idik. Açlıktan (nefesimiz kokuyordu) deriyi ve hurma çekirdeklerini gevip emerdik. Sırtımıza giydiğimiz hayvan postları idi. Üstelik ağaçlara ve taşlara tapan bir topluluktuk. Biz bu durumda iken göklerin ve yerlerin Rabbi - O'nun şanı pek yücedir, azametinin ululuğuna sınır yoktur - bize kendi içimizden, anasını ve babasını bildiğimiz bir Nebi gönderdi. Nebiimiz, Rabbimizin elçisi bize siz sadece Allah'a ibadet eden kullar oluncaya veya kendi ellerinizle cizye verinceye kadar sizinle savaşmamızı emretti. Nebiimiz bize Rabbimizden aldığı vahiy ile, bizden kim öldürülürse onun cennete gideceğini, orada eşi benzeri görülmemiş nimetler içinde olacağını ve sağ kalanların da sizin üzerinize hükümran olacaklarını, söyledi.\" [-3160-] Nu'man Muğire'ye şöyle demiştir: \"Belki de Allah seni Resul-i Ekrem Sallallahu Aleyhi ve Sellem ile birlikte bunun gibi sıkıntılı durumlara da şahit kılmış, O'nunla s.a.v. birlikte katlandığın bu sıkıntılara karşı sana bir yılgınlık / pişmanlık vermemiş ve seni mahrum da bırakmamıştır. Ben de Resulullah Sallallahu Aleyhi ve Sellem ile beraber savaşa çıktım. O s.a.v. günün başında savaşa girişmemişse rüzgarlar esene ve namaz vakitleri girene kadar beklerdi",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}