{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"58": "Jizyah and Mawaada'ah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3169,
			"arabicnumber": 3169,
			"text": "Ebu Hureyre r.a.'in şöyle dediği nakledilmiştir: \"Hayber fethedilince Resulullah Sallallahu Aleyhi ve Sellem'e zehirli koyun eti ikram edilmişti. Bunun üzerine Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Burada bulunan bütün Yahudileri toplayıp yanıma getirin!\" dedi. Yahudiler getirilince Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ben size bir soru soracağım. Bana karşı dürüst olup doğru cevap verecek misiniz?\" Onlar: \"Evet\" deyince Resulullah Sallallahu Aleyhi ve Sellem: \"Sizin babanız / atanız kimdir?\" diye sordu. Orada bulunan Yahudiler: \"Falancadır\" dediler. Fakat Nebi Sallallahu Aleyhi ve Sellem: \"Yalan söylediniz, sizin atanız falandır!\" dedi. Onlar da Resulullah Sallallahu Aleyhi ve Sellem'i tasdik edip yalan söylediklerini kabul ettiler. Resulullah Sallallahu Aleyhi ve Sellem tekrar: \"Size bir soru daha soracak olursam bana karşı dürüst davranıp doğru cevap verir misiniz?\" buyurdu. Onlar da: \"Evet, ey Ebe'l-Kasım. Eğer biz yalan söyleyecek olursak zaten biraz önce atamız hakkında söylediğimiz yalanı bildiğin gibi bunu da bilirsin\" dediler. Resul-i Ekrem Sallallahu Aleyhi ve Sellem: \"Cehennemlik olanlar kimlerdir?\" diye sordu. Onlar da: \"Biz cehennemde çok kısa bir süre kalacağız. Sonra da bizim yerimizi siz alacaksınız\" dediler. Resulullah Sallallahu Aleyhi ve Sellem: \"Orada ebediyen kalacaksınız! Siz cehennemde hor ve hakir bir şekilde kalacaksınız! Biz de asla cehennemde sizin yerinizi almayacağız!\" buyurdu ve tekrar: \"Size bir soru daha soracak olursam bana karşı dürüst davranıp doğru cevap verir misiniz?\" diye sordu. Onlar: \"Evet, ey Ebu'l-Kasım\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: \"Siz bu koyun etine zehir kattınız mı?\" dedi. Onlar zehir kattıklarını kabul edince Resulullah Sallallahu Aleyhi ve Sellem: \"Sizin bunu yapmaktan maksadınız neydi?\" diyerek niçin bunu yaptıklarını sordu. Onlar da şu cevabı verdiler: \"Nebilik iddianda yalancı olduğunu anladığımızda artık rahat edecektik. Fakat eğer bir Nebisen bu zehirli et sana zarar vermeyecekti\" Tekrar: 4249, 5777 Ayrıntılı açıklama için bkz. Kitabü'l-meğazi, Bab, 41. BU ZEHRİN NEBİ S.A.V.’İN VEFATINA SEBEP OLDUĞUNA DAİR HADİS İÇİM TIKLA 8. DEVLET BAŞKANININ (İMAM) SÖZÜNDE DURMAYANLARA BEDDUA ETMESİ",
			"grades": [],
			"reference": {
				"book": 58,
				"hadith": 11
			}
		}
	]
}