{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3342,
			"arabicnumber": 3342,
			"text": "Abdan şöyle dedi: Bize Abdullah ibnu’l-Mubârek haber verdi: Bize Yûnus ibn Yezîd, ez-Zuhrî'den haber verdi. H Bize Ahmed ibn Sâiih tahdîs etti: Bize Anbese tahdîs etti: Bize Yûnus tahdîs etti ki, İbn Şihâb şöyle demiştir: Enes dedi ki, Ebû Zerr (radıyallahü anh) şöyle tahdîs ediyordu: Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Ben Mekke'de iken içinde bulunduğum evin tavanı(ansızın) yarıldı. Cibril indi. Göğsümü yardıktan sonra içini Zemzem suyu ile yıkadı. Sonra hikmet ve îmân ile dolu altın bir leğen getirip içindekini göğsümün içine boşalttı. Ve göğsümü kapadı. Sonra elimden tutup beni semâya doğru çıkardı. Yere en yakın semâya vardığımızda Cibril, o semânın bekçisine: Aç, dedi. Kimdir o? dedi. Bu: Cibril'dir, dedi. Beraberinde kimse var mı? dedi. Muhammed benimle beraberdir, dedi: Ona (gelsin diye) haber gönderildi mi? dedi. Evet gönderildi; aç, dedi. yakın semânın üstüne çıkınca bir de gördüm ki, bir kimse (oturmuş), sağ tarafında bir takım karaltılar, sol tarafında da birtakım karaltılar var. O kimse sağ tarafına baktığında gülüyor, sol tarafına baktığında ağlıyor. O zât: Merhaba, sâlihpeygamber ve sâlih oğul, dedi. Bu kim? diye sordum. Âdem (sallallahü aleyhi ve sellem)'dir, sağında ve solunda olan bu karaltılar da evlâdının ruhlarıdır. Sağında olanları cennet ehli, sol tarafında olan ka-, raltılar da cehennem ehlidir. Sağına baktıkça güler, sol tarafına baktıkça ağlar, dedi. Cibril beni tâ ikinci semâya çıkardı. Bekçisine: dedi. de evvelkinin söylediklerini söyledikten sonra kapıyı açtı\". dedi ki: Ebû Zerr, Rasûlüllah'ın semâlarda Âdem, İdrîs, Mûsâ, İsâ, İbrâhîm Peygamberleri bulduğunu söylediyse de, herbirerlerinin menzillerinin nerelerde olduğunu ayrı ayrı söylemeyip, yalnız Âdem'i en yakın semâda, İbrahim'i altıncı semâda bulmuş olduğunu söyledi. Yine Enes dedi ki : Rasûlüllah ile birlikte İdrîs Peygamber'e uğradıklarında, İdrîs: \"Merhaba sâlihpeygamber ve sâlih kardeş\" demiş. (Peygamber demiş ki:) \"Bu kim? diye sordum. Bu İdrîs'tir, dedi. Musa'ya uğradım. O da: Merhaba sâlihpeygamber ve sâlih kardeş! dedi. Bu kimdir? diye sordum. Cibril: Bu Musa'dır, dedi. Sonra Îsa'ya uğradım. O da: Merhaba sâlihpeygamber ve sâlih kardeş, dedi. Bu kim? dedim. Cibril: Bu Îsa'dır, dedi. İbrahim'e uğradım. O da: Merhaba sâlihpeygamber ve sâlih oğul, dedi. Bu kim? dedim. Cibril: Bu İbrahim'dir, dedi\". ibn Şihâb dedi ki : Ve bana İbn Hazm haber verdi ki, İbn Abbâs ile Ebû Habbe el-Ensârî şöyle diyorlardı: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuştur: Cibril, beni yukarıya götüre götüre nihayet kaza ve takdir kalemlerinin cızırtılarını duyacak yüksek bir yere çıktım\". İbn Hazm ile Enes ibn Mâlik(radıyallahü anh) şöyle demişlerdir: Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: (O zaman) Allah benim üzerime ve ümmetim üzerine elli namaz farz kıldı. Bu farziyeti yüklenerek döndüm. Derken Musa'ya rastgeldim, Mûsâ bana: Ümmetine ne farz edildi? dedi. Ümmetim üzerine elli namaz farz etti, dedim. Mûsâ: Rabb'ine dön (de şefaat et). Çünkü ümmetin buna takat getiremez, dedi. de dönüp Rabb'ime müracaat ettim. Allah bir kısmını indirdi. Ben de Musa'nın yanına dönüp: Bir kısmını indirdi, dedim. yine yukarıdakinin benzerini zikredip: Rabb'ine müracaat et, çünkü ümmetin takat getiremez, dedi. defa da Allah bir kısmını indirdi. Ben yine Musa'ya dönüp bunu kendisine haber verdim. Mûsâ yine: Rabbine müracaat et, çünkü ümmetin buna takat getiremez, dedi. bir daha Rabb'ime müracaat ettim. Allah: Onlar beştir, yine onlar ellidir. Benim nezdimde söz (yani hüküm ve kaza) tebdil olunmaz, buyurdu. yanına döndüm. O yine: Rabb'ine dön, dedi. Ben de: Artık Rabb'imden utanır oldum, dedim. Cibril tâ Sidretu'l-Muntehâ'ya (birlikte varıncaya) kadar gitti. Sidre'yi öyle (acîb ve garîb) birtakım renkler kaplamıştı ki, onlar nedir, bilemem. Sonra cennete girdirildim ki, içinde birçok inci kubbeler vardı, toprağı da misk idi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 17
			}
		}
	]
}