{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3342,
			"arabicnumber": 3342,
			"text": "Ebu Zer' r.a.'dan rivayete göre o, Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet etmiştir: \"Ben Mekke'de iken içinde bulunduğum evin tavanı yarıldı. Cibril indi, göğsümü yardı, sonra onu Zemzem suyu ile yıkadı. Daha sonra hikmet ve iman ile dolu altından bir leğen getirdi. Onu göğsümün içine boşalttıktan sonra göğsümü kapattı. Daha sonra elimden tutarak benim ile semaya yükseldi. Dünya semasına gelince, Cibril semadaki bekçiye: Aç, dedi. Bekçi: O kim, diye sordu, Cibril'im dedi. (Bekçi): Beraberinde kimse var mı, dedi. (Cibril): Beraberimde Muhammed var, dedi. Ona risalet verildi mi, diye sordu. Evet kapıyı aç, dedi. Nihayet biz semaya yükselince sağ tarafında gölgeler, sol tarafında gölgeler bulunan bir adam gördüm. Sağ tarafına baktığında gülüyor, sol tarafına baktığında ağlıyordu. Bu salih Nebi'ye, bu salih evlada merhaba, dedi. Bu kim ey Cibril, diye sordum. (Cebrail): Bu Adem'dir, dedi. Sağında ve solunda gördüğün şu gölgeler ise onun çocuklarının canlarıdır. Bunlardan sağda olanlar cennet ehlidir, solda bulunan gölgeler ise cehennem ehlidir. Bu sebeple o sağ tarafına bakınca güler, sol tarafına bakınca ağlar. Daha sonra Cibril beni alıp ikinci semaya çıkardı. O semanın bekçisine: Aç dedi. Bekçisi birincisinin ona dediklerini söyledi. O da semayı açtı.\" Enes dedi ki: Resulullah semavatta İdris'i, Musa'yı, İsa'yı ve İbrahim'i gördüğünü zikretti. Ancak onların mevkilerinin nasıl olduğunu iyice belleyemedim. Şu kadar var ki onun zikrettiğine göre Adem'i dünya semasında, İbrahim'i de altıncı semada görmüştür. Enes devamla dedi ki: Cibril, İdris'in yanından geçince salih Nebi'ye, salih kardeşe merhaba, dedi. Ben: Bu kimdir diye sordum. O: Bu İdris'tir dedi. Daha sonra Musa'nın yanından geçtim. Salih nebiye, salih kardeşe merhaba, dedi. Bu kim diye sordum. (Cebrail): Bu Musa'dır dedi. Sonra İsa'nın yanından geçtim, salih Nebi'ye, salih kardeşe merhaba, dedi. Bu kim diye sordum. İsa'dır dedi. İbrahim'in yanından geçince, salih Nebi'ye ve salih evlada merhaba dedi. Ben, bu kimdir diye sordum. Bu İbrahim'dir dedi.\" (Senedde zikredilen İbn Şihab) dedi ki: Bana (ensardan) İbn Hazm'ın haber verdiğine göre İbn Abbas ile ensardan Ebu Habbe şöyle diyorlardı: Nebi Sallallahu Aleyhi ve Sellem buyurdu ki: \"Sonra ben (mirac'a) yükseltildim. Nihayet (yazıcı meleklerin) kalem seslerini işiteceğim bir yere kadar vardım.\" İbn Hazm ile Enes b. Malik r.a. dediler ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah bana elli vakit namaz farz kıldı. Ben de bu mükellefiyet ile geri döndüm. Musa'nın yanından geçerken Musa: Ümmetine ne farz kılındı, diye sordu. Ben: (Allah) onlara elli vakit namaz farz kıldı, dedim. Rabbine başvur, dedi. Senin ümmetin bunu kaldıramaz. Ben de dönüp Rabbime müracaat ettim. Ellinin yarısını indirdi. Musa'nın yanına geri dönünce, yine: Rabbine müracaat et dedi. Az önce söylediklerinin benzerini zikretti. Allah da onun da yarısını indirdi. Musa'ya geri dönüp ona haber verdim. Rabbine müracaat et, dedi. Senin ümmetin bunu kaldıramaz. Ben de dönüp Rabbime müracaat ettim. Şöyle buyurdu: Bunlar beştir ve ellidir. Benim nezdimde söz değişmez. Musa'ya geri döndüm, yine Rabbine müracaat et dedi. Ben: Artık Rabbime karşı yüzüm tutmuyor, dedim. Daha sonra es-Sidretu'l-Münteha'ya varıncaya kadar yoluna devam etti. Ne olduklarını bilemediğim renkler onun etrafını bürüdü. Sonra cennete girdirildim. Orada inciden çadırlar bulunduğunu, toprağının da misk olduğunu gördüm",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 17
			}
		}
	]
}