{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3365,
			"arabicnumber": 3365,
			"text": "İbn Abbas r.a. dedi ki: İbrahim ile hanımı arasında olanlar olunca İsmail ile birlikte çıkıp gitti. Beraberlerinde içinde su bulunan, derisi kurumuş bir kırba vardı. İsmail'in annesi kırbadan su içiyordu. Böylelikle çocuğuna süt oluyordu. Nihayet Mekke'ye varınca onu bir ağacın altına bıraktı. Daha sonra İbrahim hanımının yanına geri döndü. İsmail'in annesi arkasından gitti. Nihayet Keda denilen yere vardıklarında arkasından İbrahim'e şöyle seslendi: Ey İbrahim, bizi kime bırakıyorsun? Allah'a dedi. İsmail'in annesi: Bizi Allah'a bırakmana razıyım, dedi. Daha sonra geri döndü. Kırbadan su içiyor, çocuğuna süt oluyordu. Nihayet su bitince gidip de bir baksam; belki bir kimseyi fark ederim, dedi. Gidip Safa tepesine çıktı. Kimseyi görür müyüm diye bakındı, durdu. Hiç kimseyi göremedi. Vadiye gelince, sa'y etti ve Merve'ye kadar geldi. Aynı işi birkaç şavt (tur) tekrarladı. Sonra kendi kendisine şöyle dedi: Gidip de ne yaptığını bir görsem -kastettiği çocuğu idi-o Gidip, baktığında onu, ölüm dolayısıyla hırıltılı soluyor gibi gördü. Nefsi kendisine rahat vermedi. Kendi kendisine gidip bir baksam, belki birilerinin varlığını fark ederim, dedi. Kalkıp Safa'nın üzerine çıktı. Etrafına bakıp durdu, kimseyi göremedi. Nihayet (gidiş gelişini) yediye tamamladı. Arkasından: Gitsem de çocuğun ne yaptığını bir görsem, dedi. Aniden bir ses duydu. Eğer sende bir hayır varsa imdadımıza yetiş, dedi. Cibril ile karşılaşıverdi. Topuğuyla şöyle yaptı ve topuğunu yere vurdu. Oradan su fışkırdı. İsmail'in annesi dehşete kapıldı. O da suyu toplamaya başladı. (İbn Abbas) dedi ki: Ebu'I-Kasım Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Eğer onu bırakmış olsaydı su açıktan akacaktı. Dedi ki: Su içmeye başladı, çocuğa da süt geldi. Cürhümlülerden bir takım kimseler vadinin iç tarafından geçerken bir kuşun uçtuğunu fark ettiler. Bunu garip karşılar gibi oldular ve kuş ancak su olan yerde bulunur, dediler. Bunun üzerine elçilerini gönderdiler, o da duruma baktı. Su olduğunu anladılar. Elçi yanlarına gelip onlara haber verdi. Onlar da İsmail'in annesinin yanına gelip: Ey İsmail'in annesi seninle birlikte kalmamıza yahut seninle beraber yerleşmemize izin verir misin? Oğlu olgunluk yaşına geldi, onlardan bir kadın ile nikahlandı. Daha sonra İbrahim hatırına gelen düşünce ile hanımına: Ben gidip bıraktıklarımın durumunu göreceğim, dedi. Geldi, selam verdi. İsmail nerede, diye sordu. İsmail'in hanımı: Avlanmaya gitti, dedi. İbrahim: Geldiği vakit ona: Kapının eşiğini değiştir, dedi. Hanımı ona durumu haber verince İsmail: O (eşik) dediği sensin. Haydi, ailenin yanına git, dedi. Daha sonra yine İbrahim'in hatırına gelen' bir düşünce üzerine hanımına: Ben geride bıraktıklarıma gidip bakacağım, dedi ve yanlarina geldi. İsmail nerede, diye sordu. Hanımı: Avlanmaya gitti, dedi. Hanımı: İnip bir şey yemez, içmez misin, dedi. İbrahim: Ne yer, ne içersiniz, diye sordu. Hanımı: Biz et yeriz, su içeriz. İbrahim dedi ki: Allah'ım, onların yediklerini de, içtiklerini de onlara mübarek kıL. (İbn Abbas) dedi ki: Ebu'I-Kasım Sallallahu Aleyhi ve Sellem şöyle buyurdu: İşte bu, İbrahim'in duasının bereketidir. (Devamla) dedi ki: Daha sonra yine İbrahim hatırına gelen düşünce üzerine hanımına: Gidip de geride bıraktıklarıma bir bakayım, dedi. Geldiğinde İsmail ile Zemzem'in arka tarafında rastlaştılar. İsmail, oklarını düzeltiyordu. Ey İsmail, dedi, Rabbim bana kendisi için bir ev bina etmemi buyurdu. İsmail: Rabbine itaat et, dedi. O bana bu işte senin de bana yardımcı olmanı emretti, dedi. İsmail: O zaman ben de yardım ederim dedi -ya da bunun gibi bir söz söyledi.- Her ikisi de kalktı, İbrahim bina yapmaya, İsmail de ona taş uzatmaya başladı. Her ikisi de: \"Rabbimiz bizden kabul buyur. Çünkü sen her şeyi işitensin, her şeyi bilensin\" diyorlardı",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 39
			}
		}
	]
}