{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3401,
			"arabicnumber": 3401,
			"text": "Bize Alî ibn Abdillah tahdîs etti: Bize Sufyân ibn Uyeyne tahdîs etti. Bize Amr ibn Dînâr tahdîs edip şöyle dedi: Bize Saîd ibn Cubeyr haber verip şöyle dedi: Ben İbn Abbâs'a: Nevf el-Bekkâî, Hızır'ın sahibi olan Mûsâ, İsrâîl oğulları'nın Musa'sı değildir; o başka bir Musa'dır diye iddia ediyor, dedim. üzerine İbn Abbâs: Allah'ın düşmanı yalan söylemiştir, dedi ve hadîsi şöyle nakletti: Bize Ubeyy ibn Ka'b, Peygamber'den şöyle tahdîs etti : \"Musa Peygamber İsrâîl oğulları içinde hutbeye kalkmıştı. Kendisine: İnsanların en âlimi kimdir? diye soruldu. En âlim benim, diye cevâb verdi. husustaki ilmi Allah en bilendir diyerek Allah'a döndürmediğinden dolayı Allah onu azarladı da: Evet, iki denizin birleştiği yerde benim bir kulum var, işte o senden daha âlimdir, buyurdu. Ey Rabb 'im, onu görmeyi bana kim tekeffül eder? dedi. -Bazen râvî Sufyân: Ey Rabb'im, ona nasıl yol bulayım? şeklinde söyledi.- Bir balık alır ve onu bir zenbil içinde taşırsın. Onu nerede kaybedersen o kulum işte oradadır, dedi. -Bazen de aynı ma'nâya olan \"Semme\" yerine \"Semmeh\" dedi.- bir balık aldı ve onu bir zenbîl içine koydu. Bundan sonra Mûsâ hizmetçi genci Yûşa' ibn Nûn ile birlikte gitti. Nihayet o kayanın yanına varınca başlarını yere koydular. Akabinde Mûsâ uyudu. Bu arada balık debelendi ve zenbîlden çıkıp denize düştü. Ve deniz içinde kendine şaşılacak bir surette su künkü gibi (bir boşluk bırakarak) yolunu açıp gitti. Allah balıktan suyun akışını tuttu da su, tâk gibi oldu. Şöyle kemer takı gibi oldu\" demiştir. \"Uyandıktan sonra o gecenin kalanı ile bütün gün yürüdüler. Nihayet sabah olunca Mûsâ hizmetçisine: Kuşluk yemeğimizi getir, yemin olsun biz bu seferimizden garîb bir yorgunluk duyduk, dedi. Mûsâ, Allah'ın emrettiği o yerin ötesine geçmedikçe yorgunluk duymamıştı. Hizmetçi delikanlısı, Musa'ya: Gördün mü, taşın yanında barındığımız zaman balığı (yani balığın gittiğini haber vermeyi) unutmuşum. Bunu söylemeyi bana unutturan da şeytandan başkası değil, Balık deniz içinde şaşılacak bir surette yolunu tutup gitti. Balığın girmesi için suda bir oyuk meydana geldi. içinde böyle bir yolun açılması Mûsâ ile hizmetçisince hayret edilecek birşey olmuştu. Mûsâ, gence: Zaten aramakta olduğumuz bu idi, dedi. üzerine kendi izleri üzerinde, izlerine baka baka geriye döndüler. Taşın yanına varınca bir de baktılar ki, elbiseye bürünmüş bir adam duruyor. Mûsâ ona selâm verdi. O da selâmı aldı ve: Senin bulunduğun yerde selâm nereden (yani nasıl olur)? dedi. Ben Musa'yım, dedi. O: İsrâiloğulları'nın Musa'sı mı? diye sordu. Evet, dedi. (sonra yine söze başlayıp): Sana öğretilen rüşd ve hidâyetten bana birşey öğretmen için senin yanına geldim, dedi. (Doğrusu sen benim beraberimde asla sabredemezsin.) Yâ Mûsa! Ben, Allah 'ın bana öğrettiği öyle bir ilim üzerindeyim ki, sen onu bilemezsin. Sen de Allah'ın öğrettiği, Allah ilminden öyle bir ilim üzerindesin ki, onu da ben bilemem, cevâbını verdi.\" \"Mûsâ ona: Sana öğretilen ilimden bana da öğretmen için sana tâbi olayım mı? dedi. da: Doğrusu sen benim beraberimde asla sabredemezsin. İçyüzünü kavrayamadığın bir bilgiye nasıl sabredersin? dedi. da: Allah dilerse beni sabredici bulacaksın, sana hiçbir işte karşı gelmeyeceğim, dedi. Eğer bu suretle bana tâbi olacaksan ben sana anıp söyleyinceye kadar sen bana hiçbirşey sorma, dedi”. sonra deniz kıyısında yürüyerek gittiler. Yanlarına bir gemi uğradı. Kendilerini gemiye almaları için gemicilerle konuştular. Gemiciler Hızır'ı tanıdılar ve onları ücretsiz olarak gemiye aldılar. Onlar gemiye bindikleri zaman bir serçe kuşu geldi, geminin kenarına kondu ve denizden bir iki gaga su aldı. Hızır, Musa'ya: Yâ Mûsâ! Benim ilmimle senin ilmin, Allah'ın ilminden bu serçenin gagasıyle denizden aldığı su kadar bile eksiltmez, dedi. Hızır, eline bir balta aldı da gemi tahtalarından birini söktü.\" Mûsâ farkına varmadan Hızır keserle bir tahta sokmuştur, dedi. ona: Sen ne yaptın? Adamlar bizi ücretsiz olarak gemilerine almışlarken sen gemilerine kasdedip içindekileri batırmak için mi deliyorsun? And olsun, sen büyük bir iş yaptın, dedi. Sen beraberimde asla sabredemezsin demedim mi? dedi. Mûsâ: Unuttuğum şeyden dolayı beni muâhaze etme, şu arkadaşlığımızda bana güçlük yükleme, dedi. Musa'nın bu ilk muhalefeti Musa'dan bir unutma eseri olmuştu. Denizden karaya çıktıkları zaman, diğer çocukların beraberinde oynamakta olan bir oğlana uğradılar. Hızır hemen o çocuğun başından tuttu ve onu eliyle şöyle kopardı.\" Sufyân, parmaklarının uçlarıyle sanki birşey koparır gibi işaret edip göstermiştir. ona: Tertemiz, mâsûm bir canı diğer bir can karşılığı olmaksızın öldürdün hâ? And olsun ki sen çok kötü bir şey yaptın, dedi. zât: Ben sana beraberimde asla sabredemezsin demedim mi? dedi. Mûsâ: Eğer bundan sonra sana birşey sorarsam benimle arkadaşlık etme; o takdirde tarafımdan muhakkak özre ulaşmışsındır, dedi. gittiler. Nihayet bir memleket halkına vardılar ki, ora ahâlîsinden yemek istedikleri hâlde kendilerini konuk etmekten çekinmişlerdi. Derken yıkılmak isteyen bir duvar buldular. O, bunu eliyle şöyle doğrultuverdi.\" Sufyân, eliyle birşeyin üstünden mesheder gibi işaret etmiştir. Râvî Alî ibn Abdillah el-Medînî: Ben Sufyân ibn Uyeyne'den ancak bir kerre \"Meyledici\" sözünü söylerken işittim, demiştir. Bunlar, kendilerine geldiğimiz, bizlere yemek yedirmeyen ve bizleri konuklatmayan bir kavimdir. Sen onların yıkılmaya yüz tutmuş olan duvarına geldin de onu doğrulttun. İsteseydin elbet buna karşı bir ücret alırdın, dedi. zât: İşte bu, benimle senin ayrılışımızdır. Sana üzerinde sabredemediğin şeylerin içyüzünü haber vereceğim, dedi. \" aleyhi ve sellem) -kıssayı buraya kadar hikâye ettikten sonra-: \"Ne olurdu sabredeydi de, aralarında geçecek haberlerini Allah bize kıssa yapaydı\" buyurmuştur. Sufyân: Peygamber (sallallahü aleyhi ve sellem): \"Allah, Musa'ya rahmet etsin. Keşke Mûsâ sabretseydi de, Allah onların işlerinden bize anlatsaydı\" buyurdu, demiştir. ibn Cubeyr şöyle demiştir: Ve İbn Abbâs şu âyetleri okudu: \"Gemiye gelince, denizde iş yapan yoksullarındı. Onun için ben onu kusurlu yapmak istedim ki, arkalarında her sağlam gemiyi zorla almakta olan bir hükümdar vardı. Oğlana gelince: Onun anası da, babası da imân etmiş kimselerdi. Bunun için onları bir azgınlık ve kâfirlik bürümesinden endîşe ettik de, istedik ki, onların Rabb’i bunun yerine daha hayırlısını, merhametçe daha yakınını versin. Duvara gelince: Bu, o şehirde iki yetîm oğlancığındı. Altında da onlara âid bir define vardı. Babaları iyi bir adamdı. Binâenaleyh Rabb’in diledi ki, ikisi de rüşdlerine ersinler, definelerini çıkarsınlar.Bu, Rabb 'inden bir merhametti. Ben bunları kendi reyimle yapmadım. İşte üzerinde sabredemediğin şeylerin içyüzü!\"(el-Kehf: 79-82). ibnu'l-Medînî dedi ki: Sonra Sufyân ibn Uyeyne bana: Ben bu hadîsi Amr ibn Dinar'dan iki kerre işittim ve iki kerre ondan ezberledim, dedi. Sufyân'a: Sen bu hadîsi Amr ibn Dînâr'd'an işitmeden önce mi ezberledin yahut bu hadîsi başka bir insandan mı ezberledin? diye soruldu. Bunun üzerine Sufyân: Hadîsi ezberlemekte olduğum kimseden: Sen bu hadîsi benden başka Amr'dan rivayet eden bir kimse işittin mi? Ben bu hadîsi Amr ibn Dînâr'dan iki yahut üç kerre işitmişim ve ondan ezberlemişimdir, dedi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 74
			}
		}
	]
}