{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3429,
			"arabicnumber": 3429,
			"text": "Abdullah r.a. dedi ki: الذين آمنوا ولم يلبسوا إيمانهم بظلم \"İman edenlere ve imanlarına zulüm karıştırmayanlara gelince ... \"[En'am, 82] ayeti nazil olunca bu, Müslümanlara ağır geldi ve: Ey Allah'ın Resulü, bizden kim nefsine zulmetmez ki, dediler. Şöyle buyurdu: \"Kasıt o değildir. Kasıt şirk koşmaktır. Sizler Lukman'ın oğluna öğüt verirken söylediği: \"Oğulcağızım! Allah'a ortak koşma! Çünkü şirk pek büyük bir zuıümdür.\"[Lukman, 13] dediğini hiç duymadınız mı?\" Fethu'l-Bari Açıklaması: Yüce Allah'ın: \"Andolsun biz Lukman'a hikmeti verdik ... Muhakkak şirk pek büyük bir zulümdür\" buyruğunda sözkonusu edilen Lukman hakkında görüş ayrılığı vardır. Onun Habeşistanlı olduğu söylendiği gibi, NObeli (Sudan'ın kuzey kısımları) olduğu da söylenmiştir. Nebi olup olmadığı da ihtilaflrdır. es-Sevrı Tefsir'inde Eş'as'dan, o İkrime'den, o İbn Abbas'tan şöyle dediğini rivayet etmektedir: Lukman Habeşistanlı marangoz bir köle idi. İbn Ebi Şeybe'nin Musannefinde de tabiınden bir kişi olan Halid b. Sabit er-Rib'i'den buna benzer bir rivayet zikredilmiştir. Taberı, Yahya b. Said el-Ensari yoluyla, Said b. el-Müseyyeb 'den, Lukman'ın Mısır'ın siyahilerinden kalın dudaklı birisi olduğunu rivayet etmektedir. Allah ona hikmeti vermiş, ancak Nübuvvet vermemiştir. el-Müstedrek'te de sahih bir sened ile Enes'ten şöyle dediği rivayet edilmektedir: \"Davud zırh dokurken Lukman da onun yanında bulunuyordu. Lukman yaptığı işe hayret ediyor ve ona bu işin faydasını sormak da istiyordu. Ancak hikmeti ona buna dair soru sormasını engelliyordu.\". Bu hadis onun Davud aleyhisselam ile çağdaş olduğunu açıkça ortaya koymaktadır. Şube, el-Hakem'den, o Mücahid'den salih bir kimse olduğunu, ancak nebi olmadığını söylediğini nakletmektedir. Denildiğine göre onun nebi olduğunu sadece İkrime söylemiştir. Said b. Ebi Arube, Katade'den yüce Allah'ın: \"Andolsun biz Lukman'a hikmet; ı;:rdik\" buyruğu hakkında şunları söylediğini rivayet etmektedir: Ona din hususunda derinlemesine bilgi sahibi olmayı (tefakkuh) verdik, fakat o bir nebi değildi. İlim bölümünün baş taraflarında İbn Abbas'ın rivayet ettiği \"Allah'ım, ona hikmeti öğret\" hadisi açıklanırken hikmetten kastın ne olduğuna dair açıklamalar da geçmiş bulunmaktadır. Lukman'ın terzi olduğu söylendiği gibi, marangoz olduğu da söylenmiştir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 100
			}
		}
	]
}