{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3434,
			"arabicnumber": 3434,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resu!ullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Kureyş'in kadınları deve sırtına binmiş kadınların hayırlılarıdır. Çocuklara karşı en şefkatlileri, kocalarının sahip olduğu malı, mülkü en iyi kollayıp gözetenleridir.\" Ebu Hureyre bunun akabinde der ki: İmran'ın kızı Meryem ise asla deve sırtına binmemiştir. Hadis 5082 ve 5365 numara ile gelecektir. Fethu'l-Bari Açıklaması: İbrahim'in bu açıklamadan maksadı, yüce Allah'ın onu mesh ederek, günahlardan temizleyip, arındırdığını ifade etmektir. Bundan dolayı bu kelime meful anlamında fall veznindedir. Derim ki: Ona Mesıh denmesi ile Deccal'e Mesih denilmesi arasında fark vardır. Çünkü ona bu ismin verilişi, fail anlamında fall veznindedir. Denildiğine göre ona bu adın veriliş sebebi, onun yeryüzünü meshetTnesi (aolaşması)dır. Bir başka görüşe göre ona bu adın veriliş sebebi, gözlerinin meshedilmiş olmasıdır. Bu durumda ona Mesih denilmesi de mefCı! anlamındadır. Yine İsa Mesih hakkında açıklandığına göre, bu isim \"yeryüzünü meshetti\" tabirinden türetilmiştir. Çünkü o belli bir yerde karar kılmamıştı. Bir diğer açıklamaya göre ona bu adın veriliş sebebi, hastalığı ve musibeti olan her kime (eliyle) meshederse (sürerse) mutlaka iyileşmesi idi. Oldukça güzelolduğundan ötürü bu adın verildiği de söylenmiştir. Yüce Allah onu güzel bir şekilde yarattı, anlamında \"mesehahullah\" denilir. Arapların, \"Bihi mishatun min cemal: O pek güzeldir\" şeklindeki tabirieri de buradan gelmektedir. \"Mücahid dedi ki: el-Kehl, halım demektir.\" Ebu Cafer en-Nehhas da şöyle demektedir: Bu anlam dilde bilinmemektedir. Araplara göre kehl, kırkına basmış ya da yaklaşmış kimseye denilir. Otuzu aşmış kimseye denileceği de söylenmiştir. Otuzüç de denilmiştir. Görüldüğü kadarıyla Mücahid bu açıklamayı bu adı alan kişide çoğunlukla görülen durumu göz önünde bulundurarak yapmıştır. Çünkü el-kehl denilen kişi çoğunlukla vakarla ve sükunetle hareket eder. \"En şefkatlisi\" (anlamındaki ahnahu), babanın ölümünden sonra çocuğuna bakan kadın hakkında kuııanılır. Kadın çocuğuna şefkat gösterdi (hadanet) tabiri babanın ölümünden sonra evlenmediği takdirde kuııanılır. İbnu't-Tın der ki: Evlenecek olursa o kadına bu vasıf verilmez. \"Bunun sonunda Ebu Hureyre der ki: İmran kızı Meryem ise asla bir deveye binmiş değildir.\" Ebu Hureyre bu sözleriyle Meryem'in hayırlı kadınlar olarak anılan kadınların kapsamına girmediğini kastetmektedir. Çünkü Nebi Sallallahu Aleyhi ve Sellem onları deveye binrnek kaydı ile sözkonusu etmiştir. Meryem ise deveye binenlerden değildi. Bu açık1amasıyla sanki o, Meryem'in kayıtsız ve şartsız olarak en faziletli kadın olduğu görüşünde idi",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 105
			}
		}
	]
}