{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3436,
			"arabicnumber": 3436,
			"text": "Bize Cerîr ibn Hazım, Muhammed ibn Sîrîn'den; o da Ebû Hureyre(radıyallahü anh)'den tahdîs etti ki, Peygamber (sallallahü aleyhi ve sellem) şöyle buyurmuşıur: \"Beşikte yalnız üç çocuk konuşmuştur: Biri isa'dır.(İkincisi de şu kıssadaki çocuktur:) İsrâîl oğulları zamanında Cureyc denilen ruhban bir kişi vardır. Cureyc savmıasında namaz kılarken annesi gelmiş, kendisini çağırmış. Cureyc: Namazı bozup anama cevâb mı vereyim, yoksa namaz mı kılayım? diye düşünmüş. (Anası üç defa çağırdığı hâlde namaza devam etmiş.) üzerine anası: Yâ Allah! Bu oğluma fahişe kadınların yüzlerini göstermedikçe onun canını alma! diye beddua etmiş. savmıasında bulunduğu sırada bir kadın gelip kendisine musallat olmuş ve ona zina teklif etmiş. Fakat Cureyc bundan çekindiği için, bu kızgın kadın bir çobana gitmiş ve kendini ona teslim etmiştir. Kadın bu cinsî münâsebetten bir oğlan doğurmuş. (Kendisinden sorulduğunda) bu çocuğun Cureyc'den olduğunu söylemiş. Bunun üzerine halk rahibe gelmişler, savmıasını(baltalarla, kazmalarla) kırıp yıkmışlar, kendisini de savmıadan aşağı indirip çıkarmışlar ve kendisine küfürler etmişler. Cureyc abdest alıp namaz kıldıktan sonra o piç çocuğun yanına gelmiş ve: Ey oğul, baban kimdir? diye sormuş. Çobandır! diye cevâb vermiş. garîb hâdiseyi gören halk, rahibe: Senin savmıanı, yânı ibâdet verini altından yaparız! demişler. Hayır, eskisi gibi çamurdan yapın, demiştir. de şudur:) İsrâîl oğulları'ndan emzikli bir kadın vardı. Bir gün erkek çocuğunu emzirirken yanından yakışıklı ve haşmetli bir süvârî geçmiş. Bunu gören kadın: Yâ Allah! Oğlumu bunun gibi heybetli kıl! diye dua etmiş. Çocuk hemen anasının memesini bırakıp süvârîye dönmüş ve: Yâ Allah! Beni bunun gibi kılma! diye duâ etmiş. Sonra anasının memesine dönüp yine emmeye koyulmuş\". Ebû Hureyre dedi ki:(Peygamber bunu bize hikâye ederken parmağını ağzına koyarak çocuğun emişini misâllendirmişti; O' nun bu hâli gözümün önündedir.) Şimdi ben Peygamber'in kendi parmağını emişini görür gibiyim. sonra da o emzikli kadının yanından bir câriye geçmiş. Bu defa kadın: Yâ Allah! Benim oğlumu şu câriye gibi (hakîr) yapma! diye duâ etmiş. sefer çocuk yine anasının memesini bırakmış ve: Yâ Allah! Beni bunun gibi kıl! demiş. Bunun üzerine kadın, çocuğuna: Niçin böyle söyledin? diye sormuş. Çocuk da şöyle cevâb vermiştir: O süvârî kibirli zâlimlerden birisi idi. Şu câriye ise (zavallı bir kadındır; insanlar ona): Sen çaldın, sen zina ettin diye söz ederler; Halbuki o bunların hiçbirisini yapmamış (ma'sûm) bir kadındır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 107
			}
		}
	]
}