{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3449,
			"arabicnumber": 3449,
			"text": "Ebu Hureyre r.a. dedi; Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizin imamınız kendinizden olacağı halde, Meryem oğlunun ineceği zamanda haliniz ne olacak?\" Fethu'l-Bari Açıklaması: \"Çok geçmeden\" yani bunun gerçekleşmesi yakındır. Çabucak gerçekleşeceği kaçınılmaz bir şeydir. \"Aranızda inmesi\" bu ümmet arasında inmesi. Çünkü buyruk, onun ineceği zamana yetişmeyecek ümmetin bir kısmına hitaptır. \"Hakem\" hakim demektir. Yani o bu şeriat ile hükmeden birisi olarak inecektir. Çünkü bu şeriat bakidir, nesh olmayacaktır. İsa da bu ümmetin hakimIerinden bir hakim olacaktır. Müslim'de yer alan el-leys'in, İbn Şihab'dan naklettiği rivayetinde\"kıst yapan (adaletle hükmeden) bir hakem\" şeklindedir. Yine Müslim'de İbn Uyeyne'nin, İbn Şihab yoluyla kaydettiği rivayetinde \"kıst yapan bir imam\" yani adalet ile hükmeden bir önder (yönetici) demektir. Ancak \"kaasıt\" kelimesi böyle değildir. O, zalim demektir. \"Haçı kıracak, domuzu öldürecektir.\" Yani o gerçek manada haçı kırmakla Hıristiyanların azametli ve büyük olduklarına inandıkları şeylerin böyle olduğunu ortaya koymakla Nasraniliği (Hıristiyanlığı) iptal edecektir, çürütecektir. Bu hadisten anlaşıldığına göre domuz beslemek, onu yemek haramdır ve domuz necistir. Çünkü kendisinden yararlanılabilen bir şeyin telef edilmesi meşru değildir. BuyCı' (alışverişIer) bahsi sonlarında (2222 no da buna dair kısmi açıklama geçti) buna dair bazı açıklamalar geçmiş bulunmaktadır. Yine bu hadisten münker hususların değiştirilmesi, batıla hizmet eden araçların kırılması gereği de anlaşılmaktadır. Yani din bir tek din olacaktır. Zimmet ehlinden olup, cizyeyi ödeyecek kimse kalmayacaktır. Bir diğer görüşe göre anlamı şudur: Mal o kadar çok artacaktır ki, cizye olmak üzere alınacak malın harcanması mümkün olacak kimse kalmayacaktır. Böylelikle ona ihtiyaç olmayacağından cizye alınmayacaktır. Iyad der ki: \"Cizyenin kaldırılması\"ndan kastın, onun kafirlere hiçbir hatır gözetilmeden konulacağı anlamına gelme ihtimali de vardır. İşte malın çoğalmasının da sebebi bu olacaktır. Ancak Nevevı bunu kabul etmeyerek şunları söylemektedir: Doğrusu ise İsa'nın (kimseden) İslam dinine girmekten başka bir şeyi kabul etmeyeceğidir. Nevevı der ki: İslam şeriatinde cizye meşru' olmakla birlikte İsa'nın cizyeyi kaldırmasının manası şudur: Cizyenin meşruiyeti(nin devamı) İsa'nın nüzulü kaydına bağlıdır. Çünkü bu haber buna delil teşkil etmektedir. Yoksa İsa, cizye hükmünü neshetmeyecektir. Aksine bizim Nebiimiz bu sözü ile böyle bir neshi beyan etmektedir. İbn Battal der ki: İsa'nın nüzulünden önce cizyeyi kabul edişimizin sebebi, mala olan ihtiyacımızdır. Oysa İsa döneminde böyle olmayacaktır. Çünkü onU1'l zamanında mala ihtiyaç duyulmayacaktır. Onun zamanında malokadar çoğalacak ki kimse onu kabul dahi etmeyecektir. Cizyenin Yahudilerle Hıristiyanlardan kabul edilmesinin meşruiyeti ile ilgili olarak şöyle denilebilir: Onların ellerinde (Allah'tan gelmesi hususunda) şüpheli bir kitap bulunmaktadır ve onlar kendi iddialarıııa göre eski bir şeriate bağlıdırlar. İsa aleyhisselam, ineceği vakit onların bu şüpheleri bizzat kendisinin gözle görülmesiyle ortadan kalkmış olacaktır. Böylelikle onlar delil getirernernek. ve durumlarının açığa çıkması bakımından putperestler gibi olacaktır. Onlardan cizyenin kabul edilmemesi şeklinde bir muameleye tabi tutularak putperestlere yapılan muamele gibi onlara da muamele yapılması uygun düşecektir. İşte bunu hocalarımızdan biri, bir ihtimalolarak zikretmiş bulunmaktadır. Doğrusunu en iyi bilen Allah'tır. \"Ve mal çoğalacak.\" Çoğalmasınınnedeni ise, adaletli uygulamalar yapılıp zulüm olmaması sebebiyle bereketierin inmesi, hayırların ardı arkasına gelmesi olacaktır. O vakit yeryüzü, hazinelerini çıkartacak, Kıyametin yaklaştığına da.ir bilgi sahibi olmaları dolayısıyla mal edinmek arzuları da azalacaktır. \"Öyle ki, tek bir secde dahi dünyadan ve içindekilerden hayırlı olacaktır.\" Yani onlar 'o vakit yüce Allah'a mal tasadduk etmekle değil, sadece ibadet etmekle yakınlaşmaya çalışacaklardır. Anlamının şu olduğu da söylenmiştir: İnsanlar dünyaya iltifat etmeyecekler, hatta tek bir secdeyi dünyadan ve dünyadaki her şeyden daha çok seveceklerdir. \"Daha sonra Ebu Hureyre dedi ki: Dilerseniz: \"Kitap ehlinden olup ölümünden önce ona iman etmeyecek kimse yoktur ... \"[Nisa, 159] S.yetini okuyunuz.\" Yani İsa indikten sonra kitap ehli olan Yahudilerle Hıristiyanlardan ona iman etmeyecek kimse kalmayacaktır. \"Bu, Ebu ı;ureyre'nin yüce Allah'ın: \"Ona iman etmeyecek ... \" buyruğu ile: \"Olümüriden önce\" buyruğundaki zamirlerin ait olduğu şahıslar ile ilgili kanaati.nin bir neticesidir. Ona göre bu zamir İsa'ya aittir. Yani İsa ölmeden önce kitap ehfinden olan het:kes İsa'ya mutlaka iman edecektir. İbn Cerir'in, Said b. Cubeyr yoluyla sahih bir serıed ile İbn Abbas'tan naklettiği rivayete göre İbn Abbas da bunu kesin bi.r kanaat: olarak ifadeetmiştir . İlim adamları der ki: Diğer nebiler arasında İsa'nın nuzulündeki hikmet, Yahudilerin onu öldürdükleri şeklindeki iddialarını reddetmektir. Yüce Allah onların yalancı olduklarını beyan edecek ve İsa aleyhisselam Yahudileri öldürecektir. Müslim'in de İbn Ömer yolu ile rivayet ettiği bu hadiste, İsa'nın nüzulünden sonra yeryüzünde kalacağı süre yedi yılalacaktır. İsa aleyhisselam'ın göklere kaldırılmasından önce ölümü hususunda görüş ayrılığı vardır. Bu ayrılığın da asıl sebebi yüce Allah'ın: \"Ben seni vefat ettireceğim ve yükselteceğim. \"[Ali İmran, 55] buyruğudur. Bunun zahirinden ne anlaşılıyorsa onun kastedildiği söylenmiştir. Buna göre İsa yeryüzüne inip de onun için takdir edilen süre geçtikten sonra ikinci defa bir daha ölecektir. \"Seni vefat ettireceğim\" buyruğunun yerden seni vefat ettireceğim (arda kalı süren bittiği zaman seni alacağım) anlamında olduğu da söylenmiştir. Buna göre o, ancak ahir zamanda ölecektir. \"İmamınız sizden iken Meryem oğlu aranıza ine.ceği vakit haliniz ne olacak?\" Ebu'I-Has9.n el-Hasai el-Ebedi, Menakibu'ş-Şafii adlı eserinde şunları söylemektedir: Mehdi'nin bu ümmetten olacağına, İsa'nın da onun arkasında namaz kılacağına dair haberler tevatür derecesine ulaşmıştır. Ebu Zerr el-Herevi dedi ki: Bize el-Cevzaki önceki alimlerden birisinin şöyle dediğini nakletmiştir: \"İmamınız sizden\" ifadesi, onun İncil ile değil Kur'an ile hükmedeceği anlamındadır. İbnu't-Tin der ki: \"İmamınız sizden\" ifadesinin anlamı şudur: Şeriat-i Muhammediyye kıyamet gününe kadar kesintisiz devam edecektir. Her bir nesilde de ilim ehlinden bir kesim bulunacaktır. İşte bu hadis ve bundan önceki hadis, İsa'nın nüzulünden sonra imam yahut me'mum (yani başka bir imama uyan) olacağını beyan etmemektedir. İsa'nın imam olacağı kabul edilecek olursa bunun da anlamı şu olur: O cemaate katılmak ile birlikte bu ümmetten olacaktır. et-Tıybi der ki: Yani İsa sizin dininizden birisi olarak size imam olacaktır. Ancak Müslim'de bulunan bir başka hadis onun bu sözünü anlamsız kılmaktadır: \"Ona: Bize namaz kıldır denilecek, o hayır diyecektir. Çünkü sizin bir kısmınız diğer bir kısmınıza emirdir. -(Bu) bu ümmete bir ikram olarak verilmiştir.-\" İbnu'l-Cevzi der ki: İsa imam olarak öne geçecek olursa insanın içinde çözülmesi gereken bir problem ortaya çıkar ve şöyle denilir: O bir naib olarak mı öne geçip imam olmuştur yoksa yeni bir şeriat getiren birisi olarak mı? Bundan dolayı o cemaatten birisi gibi namaza uyacak, böylelikle Nebi efendimizin: \"Benden sonra hiçbir nebi gelmeyecektir\" buyruğu hiçbir şekilde şüphenin tozundan dahi etkilenmeyecektir. İsa'nın ahir zamanda ve kıyametin kopacağına yakın bir dönemde gelecek olmasına rağmen, bu ümmetten bir adamın arkasında namaz kılmasında, bu husustaki sahih olan görüşün lehine bir delil bulunmaktadır. Söz konusu görüş, Allah için delili ile ortada olacak bir kimsenin, yeryüzünde her zaman var olacağı şeklindedir. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 119
			}
		}
	]
}