{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3465,
			"arabicnumber": 3465,
			"text": "İbn Ömer r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden öncekilerden üç kişi aniden bir yağmura tutuldular. Bunun için bir mağaraya sığındılar. Mağaranın ağzı üzerlerine kapandı. Biri diğerine dedi ki: Allah'a yemin ederim arkadaşlar, sizi ancak sıdk (ihlas, doğruluk, samimiyet) kurtarabilir. Dolayısıyla her biriniz gerçekten sıdk ile yaptığını bildiği bir işi söyleyerek dua etsin, Onlardan birileri dedi ki: Allah'ım, biliyorsun ki, benim ücretle çalıştırdığım birisi vardı. O bana bir ferak pirinç karşılığında bir iş yaptı. Fakat onu almayıp gitti. Ben de o miktardaki pirinci alıp ektim. Sonunda öyle bir hale geldi ki, onun karşılığında bir miktar inek aldım. Daha sonra gelip benden ücretini istedi. Ben de ona: Şu inekleri al, önüne kat git, dedim. Bana: Benim sendeki alacağım bir ferak pirinçtir, dedi. Ben ona: Sen o inekleri al, onlar bu bir feraktan oldu, dedim. O da inekleri önüne katıp gitti. Eğer bunu sana olan haşyetimden ötürü yapmışsam biliyorsan bizi bu halden kurtar. Kaya üzerlerinden bir miktar açıldı. Diğeri dedi ki: Allah'ım, biliyorsun ki, benim oldukça yaşlı annem, babam vardı. Her gece onlara koyunlarımın sütünü getiriyordum. Bir gece yanlarına gelmekte geciktim. Geldiğimde ikisi de uyumuştu. Hanımım ve çocuklarım ise açlıktan sızlanıp ağlıyoriardı. Fakat ben anne babama içi rm eden önce onlara içirmiyordum. Anne babamı da uyandırmak hoşuma gitmedi. Bununla birlikte sütlerini içmeden onları bırakmak da zayıf düşecekleri korkusuyla hoşuma gitmedi. Nihayet tan yeri ağarıncaya kadar onları beklemeye devam ettim. Eğer ben bu işi senin haşyetinden dolayı yapmışsam bizi bu sıkıntıdan kurtar. Kaya bir parça daha açıldı ve nihayet göğü görebildiler. Diğer arkadaşları da dedi ki: Allah'ım, biliyorsun ki, benim bir amca kızım vardı. İnsanlar arasında en sevdiğim kişi idi. Kendisini bana teslim etmesini istedim. Kendisine yüz dinar vermedikçe kabul etmeyeceğini söyledi. Ben de o parayı bulmaya koyuldum. Nihayet toplayabildim. O parayı götürüp ona verdim. O da bana kendisini teslim etti. Bacakları arasına oturunca: Allah'tan kork ve hakkı ile olmadıkça yüzüğü kırma, dedi. Ben de ayağa kalktım ve yüz dinarı da almadım. Ben bu işi senin haşyetinden dolayı yapmışsam bizi kurtar. Allah da onların üzerlerini açtı ve (oradan) çıktılar.\" Fethu'l-Bari Açıklaması: \"Allah'ım biliyorsun ki ... \" Bu buyrukta açıklaması zor bir taraf vardır. Çünkü mümin Aııah'ın bunu bildiğini kat'i olarak bilir. Buna şöyle cevap verilmiştir: Onun ameli hakkındaki bu tereddüdü, Aııah nezdinde muteber olup olmaması ile alakalıdır. Şöyle demiş gibidir: Eğer benim o amelim makbul ise duam! kabul buyur. \"Bir ferak karşılığında ... \" Ferak, üç sa' alan bir ölçektir. \"Açlıktan sızlanıp ağlıyorlardı.\" Aç olmaları sebebiyle yüksek sesle ağlıyorIardı. \"Yüzüğü kırma!\" ifadesindeki yüzük, bakire oluşundan kinayedir. Muhtemelen bakire idi. Kırmayı ilişki kurmanın, yüzüğü de fercin kinayesi olarak kullanmıştır. Hadisten Çıkan Sonuçlar 1- Sıkıntılı zamanlarda dua etmek, salih amelleri anarak yüce Allah'a yakınIaşmaya çalışmak, kullarına vaadini, ona dua ederek gerçekleştirmesini istemek müstehaptır. 2- Bazı fakihler, bunların istiska (yağmur duası) da sözkonusu edilmesini de müstehap görmüşlerdir. Ancak Muhibuddin eteTaberi bunda amellerle riyakarlık sözkonusu olduğundan, istiskada bulunurken de kulun kendisini hakir görmesi daha uygun olduğundan, bunun açıklamasının zor olduğunu belirtmiştir. Çünkü istiska için yapılan dua, yalvarıp yakarma makamıdır. Mağara sahiplerinin kıssası ile ilgili olarak da şu cevabı vermiştir: Onlar amellerini sözkonusu ederek şefaatte bulunmamışlardır. Onlar amellerinin halis ve kabul edilmiş olması halinde Allah'tan buna karşılık olarak kendilerinin sıkıntıdan kurtarılmalarını istemişlerdir. Böylelikle o, verdiği cevabın muhtevasında (salih amelleri zikrederek) dua etmeyi kabul etmekle birlikte, bu kaydı da zikretmiş olmaktadır. Bu da güzel bir kayıttır. 3- Amelin ihlasla yapılması, anne-babaya iyi davranmak, onlara hizmet etmek, onların çoluk-çocuğa tercih edilmeleri, onlar uğrunda meşakkatlere katlanmak fazileti üstün işlerdendir. 4- İffetli olmak ve güç yetirmekle birlikte haramdan uzak durmak, faziletli bir iş olduğu gibi; masiyeti işlemeyi terk etmek de, onu işlemek için öncelikli olarak yapılması gereken işlerin yapılmış olması halinde, günahlarını siler; tevbe de kendisinden önceki günahları siler. 5- Ücretli iş akdi yapan taraflarca belli bir yiyecek karşılığında icare akdi yapmak caizdir. 6- Emaneti sahibine eksiksiz ödemek faziletli bir iştir. 7- Salih kimselerin keramet göstermeleri mümkündür. 8- Fuzuli diye bilinen alışveriş türü caizdir. Buna dair açıklamalar daha önce de alışverişler bölümünde geçmiş bulunmaktadır, (bkz.2272 nolu hadis) 8- Kendisine emanet bırakılmış kişi, emanet bırakılan malı ticaret için kullanacak olursa sağlanacak olan kar emanetin sahibine aittir. Bu İ. Ahmed'in görüşüdür. Hattabi der ki: Çoğunluk ona muhalefet ederek şöyle demışlerdir: Eğer emanet bırakılan mal, yanına emanet bırakılan kişinin zimmetinde sabit olursa aynı şekilde mudarib (sermaye ve kar ortaklığı demek olan mudarebe akdindeki emek tarafının adı), mesela kendisine izin verilmediği halde malda tasarruf ettiği takdirde onun zimmetinde ödenmesi gereken bir borç haline gelir, bu malı ticaret için kullanacak olursa, sağlayacağı kar ona ait olur. Ebu Hanife'den de (maldan zarar olursa) zararın tazminatını vereceği görüşü nakledilmiştir. Kar ise ona aittir, fakat onu tasadduk eder. Şafiı ise konuyu etraflı birşekilde ele alıp şöyle demektedir: Kendisi adına mal satın aldıktan sonra bedelini başkasına ait olan maldan ödeyecek olursa, akit de onun adınadir, kar da ona aittir. Eğer Aynı bedel ile satın alacak olursa kar o ayn'a malik olana aittir. Bu husustaki görüş ayrılıkları da yine alışverişler bahsinde daha önce de nakledilmiş bulunmaktadır. 9- Dinleyenler amelleriyle ibret alsın ve güzelolanları gibi amel etsin, çirkin olanlarını da terk etsinler diye geçmiş ümmetierin başından geçen olaylara dair haber vermek (güzel bir şeydir). Doğrusunu en iyi bilen Allah'tır. 54. BAB",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 132
			}
		}
	]
}