{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"60": "Prophets"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3488,
			"arabicnumber": 3488,
			"text": "Muaviye b. Ebi Süfyan Medine'ye son gelişinde bize bir hutbe verdi. Bir top saç çıkartarak dedi ki: \"Ben bu işi Yahudilerden başka bir kimsenin yapacağı kanaatinde değildim. Nebi Sallallahu Aleyhi ve Sellem ise buna \"ez-zur (yalan)\" adını vermiştir. Kastettiği saça saç eklemektir.\" Bu rivayette ona (Buhari'nin hocası Adem'e) Gunder, Şu'be'den diye rivayet ederek mutabaatta bulunmuştur. Fethu'l-Bari Açıklaması: 3468 - \"Eline bir miktar saç aldı.\" Kasıt perçemden kesilmiş saçtır. \"el-Haresı\" tekil olup, koruma görevlisi demektir. \"Nerede alimlerinjz\" cümlesinde o dönemde aralarındaki alimlerin sayıca azalmış olduklarına işaret vardır. Durum da böyledir. Çünkü Ashabın çoğu o gün vefat etmiş bulunuyorlardı. Sanki o avam arasındaki cahillerin bu işi yapmış olduklarıkanaatine kapılmış, bundan dolayı alimlerine hatırlatarak böyle bir münkere karşı tepki göstermeyi terk ettiklerinden onları uyarmak istemiş gibidir. -- Bu başlıkta zikredilen hadisler sayıca fazla olduklarından yapılan açıklamaların hangi hadise ait olduğunun daha kolay takip edilebilmesi için hadislerin numaralarını açıklamada tekrar etmeyi faydalı gördük. 3470- \"Bir rahibe gitti.\" Bu ifade ile bu hadisenin İsa aleyhisselam'ın yükseltilmesinden sonra cereyan ettiği hissettirilmektedir. Çünkü rahipliği -Kur'an'ın da . açıkça belirttiği gibi- ona tabi olanlar bid'at olarak sonradan uydurmuşlardır. \"Bir adam ona şöyle şöyle olan bir kasabaya git, dedi.\" Hişam'ın naklettiği rivayette şu fazlalık vardır: \"Çünkü o kasabada Allah'a ibadet eden insanlar var-o dır. Sen de onlarla birlikte Allah'a ibadet et. Eski toprağına geri dönme. Çünkü o kötü bir yerdir. O da yoluna koyuldu. Yolun yarısına vardığında ona ölüm meleği geldi.\" \"Yöneldi\" yani gideceği tarafa doğru kendisini daha da yakınlaştırdı. \"Melekler onun hakkında anlaşmazlığa düştü.\" Hişam yoluyla gelen rivayetteki bir fazlalık da şöyledir: \"Rahmet melekleri dedi ki: Bu tevbe ederek, kalbiyle Allah'a yönelmiş olarak geldi. Azap melekleri de: O hayır namına hiçbir şey işlemedi dediler. Onlara insan suretinde bir melek geldi. Onu aralarında (hakem) yaptılar. O da: \"İki yerin arasını ölçünüz, hangisine daha yakın ise oraya aittir.\" \"Bunun üzerine Allah buna\" çıkıp geldiği kasabaya: \"Uzaklaş, diye vahyetti. Öbürüne de\" gitmek istediği kasabaya \"yaklaş diye vahyetti.\" Tercümeye esas aldığımız Muhtasar'da da Fethu'l-Bari'nin Daru'r-Reyyan, Kahire, 1409/1980 baskısında da tekil olarak ölen şahısa ait olmak üzere \"ona geldi\" şeklindedir. Ancak yine Buhari şerhi olan Aynı'de olsun, hadisin yer aldığı diğer kaynaklar olsun hep \"onlara\" şeklinde olduğu gibi mana cihetiyle de böyle olması daha doğrudur. Hadisten Çıkarılan Sonuçlar 1- İnsan öldürmek dahil bütün büyük günahlardan dolayı tevbe etmek şeriatin öngördüğü bir iştir. Yüce Allah katilin tevbesini kabul edecek olursa onun hasmını da razı etmeyi üzerine alır. 2- İnsanın masiyet işlemekle karşı karşıya kaldığı bir yerden başka bir yere gitmesi faziletli bir iştir. Çünkü adeten bu gibi haller insanı daha çok etkiler. Ya bundan önce işlemiş olduğu fiillerini ve onlara tutkunluğunu hatırladığı için yahut da bu hususta ona destek verip onu bu işlere teşvik eden kimseler bulunduğu için böyle bir etki sözkonusudur. Bundan dolayı sonraki zat ona şöyle demiştir: \"Eski topraklarına da dönme. Çünkü o bir kötülük diyarıdır.\" 3- Tevbe eden bir kimsenin, masiyet işlediği zamanlarda alışageldiği hallerden ayrılması ve bütün bunları büsbütün değiştirerek başkalarıyla uğraşması gerekir. 4- Alim, abidden üstündür. Çünkü ona ilkin tevbesinin kabul• edilmeyeceği fetvasını veren kişi, daha çok ibadet eden birisi idi. Katilin bu kadar çok sayıda kimseyi öldürme cesaretini göstermiş olmasını pek büyük bir iş olarak gördü. İkincisi ise daha çok ilimle uğraşan birisi olduğundan ona doğru şekilde fetva verdi ve kendisine kurtuluş yolunu gösterdi. 5- (Kadı) Iyad der ki: Hadisten anlaşıldığına göre tevbenin diğer günahlara faydası olduğu gibi, öldürmeye karşı da faydası vardır. 6- Hadis, meleklerin kendi aralarında anlaşmazlığa düşmeleri halinde Ademoğullarından aralarında hüküm verebilecek durumda olan kimseler bulunduğuna da delil gösterilmiştir. 7- Tahkimin (anlaşmazlıkları çözme işini bir hakerne ,havale etmenin) caiz olduğunu, tahkimi için iki tarafın rıza gösterdiği kimsenin vereceği hükmün, onlar hakkında geçerli olacağını kabul edenlerin görüşlerinin lehine de delil bulunmaktadır. \"Halbuki ikisi orada değillerdi.\" Yani (olayı anlatırken Nebiin) huzurunda bulunmuyorlardı. Bu, rivayeti nakledenin sözlerindendir. 3472- \"Akar\" sözlükte ev ve tarla anlamlarındadır. Bazıları ise sadece hurmalık anlamında olduğunu kabul etmişlerdir. Evin oldukça değerli eşyalarına da akar denilebilir. \"Akarı satın alan kişi o akarında içinde altın bulunan bir testi buldu. Onu satana: Altınını al, çünkü ben senden ancak toprağı satın aldım, altını satın almadım dedi.\" İshak b. Bişr yoluyla gelen rivayete göre müşteri kendisinin bir ev satın aldığını, onu imar ederken içinde bir hazine bulduğunu söyledi. Satıcı da ona bu hazineyi gelip almaya çağırınca şu cevabı vermişti: Ben ne gömdüm, ne de bunu biliyorum. Her ikisi de hakime dedi ki: Sen bunu alacak birisini gönder, nasıl uygun görürsen onu öyle kullan. Ancak hakim bunu kabul etmedi. Buna göre bu malın hükmü, cahiliye döneminde gömülmüş olduğu bilinmesi halinde bizim şeriatimizde rika.zın hükmüdür. Eğer onun Müslümanlar tarafından gömüldüğü bilinecek olursa o takdirde o bir lukatadır. Bilinmeyecek olursa kaybolmuş mal hükmündedir, Beytu'I-Mal'e konulur. Muhtemelen onların şeriatinde böyle bir teferruat bulunmuyordu. Bundan dolayı kadı da belirtilen şekilde hüküm verdi. Kurtubı ise hakimin onlardan herhangi birisi hakkında hüküm vermemiş olduğunu kesin bir dille ifade etmiştir. O, adı geçen malın sadece kaybolmuş mal hükmünde olduğunu görünce aralarında sulh yapmıştır. Onların bu mala başkalarından daha bir hak sahibi olduklarını görmüştür. Çünkü her ikisinin de oldukça vera' sahibi olduklarını, hallerinin de güzelolduğunu görerek onların soylarından güzel bir semere ve salih bir zürriyet çıkacağını ümit ederek böyle hareket etmiştir. 3477 - \"Nebi Sallallahu Aleyhi ve Sellem'i nebilerden bir nebiyi anlatırken görür gibiyim. Kavmi onu vurmuş ve kanatmışlardı.\" Ben bu nebinin isminin ne olduğunu açık bir şekilde tespit edemedim. Nuh aleyhisselam olması ihtimali vardır. Ancak Nevevı diyor ki: Nebi Sallallahu Aleyhi ve Sellem'in bu anlattığı olayın başından geçtiği Nebi, öncekilerden birisidir. Uhud gününde de bizim Nebiimizin başından buna yakın bir olay geçmiştir. 3478- \"Allah'ın kendisine mal verdiği ... \" Malını çoğalttığı bir kimse demektir. 3481- \"Allah'a yemin ederim, Allah bana güç yetirirse (beni sıkıştırırsa)\" ifadesi ile ilgili olarak el-Hattabı şunları söylemektedir: Bu ifadenin açıklanması kimilerine göre zor gelebilir ve: Böyle bir kimse ölümden sonra dirilişi ve ölüleri diriltme kudretini inkar ettiği halde, nasılolur da Allah ona mağfiret edebilir? Cevap şudur: Bu kişi ölümden sonra dirilişi inkar eden birisi değildi. O sadece cahillik etmiş birisi idi. Dolayısıyla kendisine bu uygulama yapılacak olursa diriltilmeyeceğini ve azaba uğratılmayacağını sanmıştı. Onun iman sahibi olduğu, bu işi Allah'ın haşyetinden yaptığını itiraf etmek ile ortaya çıkmıştır. İbn Kuteybe der ki: Bazı sıfatlar hakkında birtakım Müslümanlar hata edebilir ve bundan dolayı da kafir sayılmazlar. Ancak İbnu'l-Cevzı bunu kabul etmeyerek şunu söylemektedir: Bir kimsenin kudret sıfatını inkar etmesi ittifakla küfürdür. Hadisteki: \"Andolsun Allah beni sıkıştırırsa\" sözleri beni sıkıştırıp aleyhime daraltırsa, demektir. Yüce Allah'ın: \"Kime rızkı daraltılırsa\" buyruğuna benzemektedir. \"Belki Allah'ı idlal ederim\" sözlerinin anlamı ise, belki ondan kurtulurum şeklindedir. Nitekim bir şey geçip gidince de onun hakkında \"dalle\" fiili kullanılabilir. Bu da yüce Allah'ın: \"Rabbim kaybolup gitmez de, unutmaz da.\"[Taha, 52] buyruğuna benzemektedir. Muhtemelen bu adam bu sözlerini aşırı derecedeki korkus1:lndan ve çekinmesinden dolayı söylemiştir. Nitekim bir başkası: \"Sen benim kulumsun, ben de senin rabbinim\" dediği rivayet edilmiştir. Yahut da: \"Eğer Rabbim hakkımda takdir ederse\" (anlamında kaddere şeklinde) dal harfi şeddeli söylenmiş de olabilir. Yani eğer beni azaplandırmayı takdir etmişse, elbetteki beni azaplandıracaktır. Yahut da o yaratıcıyı kabul eden birisi olmakla birlikte, fetret zamanında yaşayan birisi idi. İmanın şartlarının ne olduğu ona ulaşmamıştı. Bu konudaki en güçlü görüş, onun bu sözlerini neler söylediğini akledip, kavrayamayacak hale gelecek şekilde korku ve dehşetin baskısı altında bulunduğu bir halde söylemiş olduğudur. Yoksa o bu sözlerini gerçek manasını kastederek söylememiş; aksine o bu sözleri kişinin yaptıklarından sorumlu tutulmayacağı gaflet halinde iken, yanılacak ya da unutacak bir halde iken söylemiştir. 3483- \"Nübuvvet sözlerinden insanların idrak ettikleri arasında ... \" ibaresinde bütün rivayet yollarında (insanlar anlamındaki) \"en-nas\" lafz! merfudur (özne konumundadır.) Bunun nasb ile okunması da caizdir. İnsanlara ulaşanlardan demek olur. \"Nübuvvet kelamından\" enbiyanın ittifakla belirttikleri hususlardan anlamındadır. Yani bütün nebiler bunu teşvik etmiştir ve onların hiçbirisinin şeriatinde bu hüküm nesholmamıştır. Çünkü bu bütün akılların da ittifaklakabul ettikleri bir husustur. \"Dilediğini yapabilirsin\" ibaresi, haber anlamında emirdir ya da tehdit için söylenmiş olabilir. Dilediğini yapabilirsin, şüphesiz Allah da sana yaptığının karşılığını verecektir, demek olur. Yahut şu anlamda olabilir: Yapmak istediğine bak, düşün. Eğer utanç vermeyecek işlerdense yap. Utandıracak işlerdense onu bırak. Şu anlama da gelebilir. Şayet sen din ile ilgili olup, utanmaman gereken bir şey yaptığında Allah'tan da utanmanı gerektirmiyorsa onu yap ve insanlara aldırma. Maksat hayalı olmayı teşvik ve onun faziletine dikkat çekmek de olabilir. Yani senin dilediğin her şeyi yapman caiz olmadığına göre utanmayı, hayalı olmayı terk etmen de caiz değildir",
			"grades": [],
			"reference": {
				"book": 60,
				"hadith": 154
			}
		}
	]
}