{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3522,
			"arabicnumber": 3522,
			"text": "Ebu Cemra dedi ki: \"İbn Abbas bize dedi ki: Size Ebu Zer' 'in Müslüman oluşunu anlatayım mı? Ebu Cemre dedi ki: Anlat, dedik. İbn Abbas da Ebu Zer' dedi ki: Ben Ğıfar'dan bir adam idim. Bize nebi olduğunu iddia eden bir adam'ın Mekke'de ortaya çıktığı haberi ulaştl. Kardeşime: Bu adamın yanına git, onunla konuş ve ona dair ondan bana haber getir, dedim. Kardeşim gitti, onunla karşılaştı, sonra geri döndü: Ne haber, diye sordum. O, Allah'a yemin ederim, ben hayrı emreden, kötülükten de alıkoyan bir adam gördüm dedi. Ben de ona, bu getirdiğin haber beni rahatlatınadı, dedim. Yanıma bir dağarcık ve bir asa aldım. Sonra da Mekke'ye doğru yola koyuldum. Ben onu tanımıyordum. Onun hakkında kimseye soru sormaktan da hoşlanmıyordum. Zemzem suyundan içiyor ve mescidde kalıyordum. (Ebu Zerr devamla) dedi ki: Ali yanımdan geçti. Bu adam sanki bir yabancı, dedi. Ben evet dedim. Haydi gel eve gidelim dedi. Ben de onunla birlikte yola koyuldum. O bana hiçbir şeye dair bir şey sormuyor, ben de ona söylemiyordum. Sabah olunca ona dair soru sormak üzere mescide gittim. Fakat onun hakkında bana haber verecek kimse yoktu. (Ebu Zer') dedi ki: Yine yanıma Ali geldi. Acaba bu adam henüz onun evini kendisine söyleyecek birisini bulamadı mı, dedi. Ben hayır dedim. Haydi benimle beraber yürü, dedi. Sonra bana senin halin ne? Bu şehre gelmenin sebebi ne, dedi. Ben de ona, eğer benim durumumu gizleyecek olursan sana haber veririm dedim. Dediğini yaparım diye cevap verdi. O zaman bende burada kendisinin bir nebi olduğunu iddia eden bir adamın ortaya çıktığına dair bize bir haber ulaştı. Kendisiyle konuşmak üzere kardeşimi gönderdim. Fakat geriye döndüğünde getirdiği haber beni rahatlatınadı. Kendim onunla karşılaşmak istedim, dedim. Ali ona dedi ki: Sen doğru yoldasın. İşte ben de onun yanına gidiyorum, sen de arkamdan gel. Benim gireceğim yere sen de gir, sana zarar vereceğinden korktuğum birisini görecek olursam ayakkabımı düzeltiyormuşum gibi duvarın yanında ayakta duracağım. Sen de yoluna devam et. Nihayet o gitti, ben de onunla birlikte yola koyuldum. O bir yere gitti, ben de onunla birlikte Nebi Sallallahu Aleyhi ve Sellem'in huzuruna girdim. Ona, Bana,İslaml arzet, dedim, o da arzetti. Olduğum yerde Müslüman oldum. Bana: Ey Ebu Zer', bu işi gizle ve şehrine geri dön. Bizim ortaya çıktığımız haberi sana ulaştığı takdirde geri gel, diye buyurdu. Ben dedim ki: Seni hak ile gönderene yemin ederim ki ben bunu onların arasında feryat ederek söyleyeceğim. Daha sonra Ebu Zer' mescide geldi. Kureyş de mescidde idi. Ey Kureyşliler topluluğu, dedi. Şüphesiz ki ben Allah'tan başka hiçbir ilah olmadığına şahitlik ettiğim gibi Muhammed'in de onun kulu ve Resulü olduğuna şahitlik ederim. Kureyşliler: Bu dinini terk edenin üzerine gidiniz, dedi. Hepsi birlikte ayağa kalktılar. Ölesiye bana vurdular. Abbas yetişip ve üzerime kapandı. Sonra da onlara dönerek dedi ki: Vay sizin halinize! Sizle( Ğıfarlılardan birisini öldürecektini. Halbuki sizin ticaret yollarınız ve gidip gelişiniz Ğıfarlıların bulunduğu yerler üzerindendir. Bunun üzerine beni terk ettiler. Ertesi gün sabah olunca yine oraya döndüm, bir gün önce söylediğimin benzerini söyledim. Yine onlar da: Bu dininden dönene kalkınız deyip, bir gün önce bana yapılanların benzeri yapıldı. Yine Abbas bana yetişti, üzerime abandı ve bir gün önce söylediği sözlerin benzerini söyledi. (İbn Abbas) dedi ki: İşte Ebu Zer' 'in -Allah'ın rahmeti üzerine olsun- ilk Müslüman oluşu böyle olmuştu.\" Bu Hadis İleride 3761 numara ile gelecektir. 12. ZEMZEM KISSASI İLE ARAPLARıN CEHALETİ",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 32
			}
		}
	]
}