{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3567,
			"arabicnumber": 3567,
			"text": "Aişe r.anha'nın şöyle dediği rivayet edilmiştir: \"Filan'ın babasının gelip benim odamın yanında oturarak Resulullah Sallallahu Aleyhi ve Sellem hadis nakledip, bana bunu işittirmesi seni şaşırtmıyor mu? Ben o sırada namaz kılıyordum. Namazımı bitirmeden önce kalkıp gitti. Eğer ona yetişmiş olsaydım, ona şu şekilde cevap verirdim: Resulullah Sallallahu Aleyhi ve Sellem hadisi (konuşurken sözleri) sizin bu şekilde alel acele dizdiğiniz gibi birini diğerinin ardı arkasına sıralamazdı.\" Diğer tahric edenler: Tirmizî, Menakıb; Müslim, Fedail-üs Sahabe Tirmizî bu hadisi rivayet etti ve dediki:: Bu hadis hasendir. Bu hadisi sadece Zührî’nin rivâyetiyle bilmekteyiz. Yunus b. Yezîd’te bu hadisi Zührî’den rivâyet etmiştir. Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in nitelikleri\" onun hilkati ve ahlakı (yaratılışı ve huyu) demektir. 3544- \"Saçlarına ak düşmüş, beyaz tenli idi.\" Yani siyah saçına beyaz karışmıştı. \"Bize (verilmesini) emretti\" den kasıt, kendisine ve kavmine demektir. Yani gelen heyete bir çeşit ikram ve ödülolmak üzere bunların verilmesini emretti. \"Katus\" dişi deve demektir. Genç anlamında olduğu da söylenmiştir. Bacakları uzun deve diye de açıklanmıştır. \"Biz bunları kabzetmeden Nebi Sallallahu Aleyhi ve Sellem'in ruhu kabzedildi\" ifadelerinde de bu olayın, Nebi Sallallahu Aleyhi ve Sellem'in vefatına çok yakın olduğu hissettirilmektedir. Ebu Cuhayfe ve kavminden onunla birlikte olanlar, bundan sonraki rivayette de görüldüğü gibi Veda haccında bulunmuşlardı. Görüldüğü kadarıyla Ebu Bekir r.a. diğerlerine yaptığı şekilde onlara verilmiş olan bu sözü gerçekleştirmiştir. Daha sonra bu hususun açıkça nakledilmiş olduğunu gördüm. Kaydedilen senedie el-İsmaili'nin, Muhammed b. Fudayl yoluyla gelen rivayetinde şöyle denilmektedir: \"Biz o develeri almak üzere gittik. Bize bir şey vermeden önce onun ölüm haberi bize ulaştı. Ebu Bekir kalkıp: Her kime Resulullah Sallallahu Aleyhi ve Sellem bir söz verdi ise gelsin deyince, ben de onun huzurunda ayağa kalkarak ona durumu haber verdim, o da bize o develerin verilmesini emretti.\" Bu mesele ile ilgili araştırma daha önce Hibe bahsinde geçmiş bulunmaktadır.(2598 numaralı hadiste) 3547- \"Uzuna yakın, orta boylu idi\" ifadesini sözü geçen hadis, şu ifadelerle açıklamış bulunmaktadır: \"O pek uzun boylu da değildi, kısa da değildi.\" \"Pek uzun boylu\" ile kast edilen, boyun muntazam olmaması ile birlikte aşırı uzun olması demektir. ez-Zühri tarafından \"ez-Zühriyyat\" adlı eserde hasen bir sened ile Ebu Hureyre yoluyla rivayet edilen hadiste de şöyle buyurulmuştur: \"O uzuna daha yakın, orta boylu idi.\" ''Teninin rengi kırmızıya çalan beyazdı.\" Yani onun ten rengi aşırı derecede beyaz değildi. \"Mekke'de on sene kaldı, ona vahiy nazil olmaktaydı.\" Bu ifadeye göre o altmış yıl yaşamış olmaktadır. Ancak Müslim bir başka yoldan Enes'den: \"O sallallahu a1eyhi ve sellem altmış üç yıl yaşadı\" dediğini rivayet etmektedir. Bu da az önce geçen Aişe r.a.a yoluyla gelen hadise uygundur. Cumhur da bu görüştedir. \"Omuzlan arası genişti.\" Yani sırtının üst tarafı enlice idi. İbn Sa'd'da yer alan Ebu Hureyre yoluyla gelen hadiste ise: \"Göğsü genişti\" denilmektedir. 3552- 'iKilıç gibi mi idi? O, hayır, ay gibi idi, dedi.\" Sanki bu soruyu soran kişi uzunluğu itibariyle yüzünün kılıcı andırdığını sormak istemiştir. el-Bera da ona cevap vererek: \"Hayır, onun yüzü ay gibi idi\" demiştir ki, yuvarlaklığı itibariyle ona benzediğini söylemek istemiştir. Soruyu soranın parlaklıkta ve pürüzsüzlükte kılıç gibi mi idi, demek istemiş olması da muhtemeldir. Buna göre el-Bera da: Hayır bundan da daha ileridir, diye cevap vererek yuvarlaklık ve parlaklık niteliklerini kendisinde toplayan aya benzetme cihetini tercih etmiştir. 3556- \"Yüzü nurlanır, bir ay parçasını andırırdı.\" Sevincin görüldüğü yeri kastetmektedir ki o da onun alnı idi. 3558- \"Kitap ehline muvafakati severdi.\" Yani puta tapıcılann çok olduğu o dönemlerde böyle idi. \"Kendisine herhangi bir emir verilmemiş olan hususlarda\" yani onun şeraitine muhalif olmayan hususlarda \"kitap ehline muvafakati severdi.\" Çünkü onun döneminde kitap ehli Resullerin şeriatlanndan geriye kalmış birtakım hükümlere bağlı idiler. Dolayısıyla onlara muvafakat etmeyi, puta tapıcılara muvafakat etmekten daha çok severdi. Puta tapıcılann çoğunluğu İslama girince o vakit de kitap ehline muhalefet etmeyi sevmeye başladı. 3559- \"Ne çirkin konuşan, ne de çirkin konuşmaya kendisini zorlayan birisi idi.\" O çirkin konuşmayan birisi idi. Yani kötü söz söylemekte asla haddi aşmazdı. Çirkin konuşmaya kendisini de zorlamazdı. Bu da çirkin konuşmalann onun yaratılıştan gelen bir huyu olmadığı gibi, böyle bir niteliği sonradan da kazanmamış olduğunu ifade etmektedir. Tirmizi'de Ebu Abdullah el-Cedell'nin şöyle dediği nakledilmektedir: \"Ben Aişe r.a.a'ya Nebi Sallallahu Aleyhi ve Sellem'in ahlakına dair soru sordum. O bana şöyle dedi: O çirkin sözler söyleyerek konuşmadığı gibi, böyle konuşmaya da kendisini zorlamazdı. Çarşı-pazarlarda yüksek sesle bağırıp çağırmazdı. Kötülüğe kötülükle karşılık vermezdi. Aksine affeder, bağışlardı.\" Musannıf (Buhari) Edeb bölümünde Enes r.a.'dan şunu nakletmektedir: \"Resuluilah Sallallahu Aleyhi ve Sellem çok söven, çokça çirkin sözlerle konuşan ve çok lanet okuyan birisi değildi. Bizden herhangi birisine sitem ettiği vakit, ne oluyor ona, alnı toprağa bulansın, derdi.\" Ahmed de Enes r.a.'dan şunu rivayet etmektedir: \"Nebi Sallallahu Aleyhi ve Sellem kimsenin yüzüne karşı hoşuna gitmeyecek bir şey söylemezdi.\" Ebu Davud da Aişe r.a.a'nin şöyle dediğini rivayet etmektedir: \"Resuluilah Sallallahu Aleyhi ve Sellem'e bir adamdan diye bir şey ulaştırıldığı takdirde: Bu cdam ne diye böyle söylüyor demez, bunun yerine: Bazı kimselere ne oluyor ki öyle diyorlar, derdi.\" 3560- \"İki iş\" ten kasıt, dünya işlerinden iki iştir. Buna delil de hadisteki \"güah olmadığı sürece\" ifadesidir. Çünkü dinin öngördüğü işlerde günah olmaz. \"Kendi adına intikam almamıştır.\" Kendisi için özelolarak intikam almamıştır. :<endisine eziyetle bulunmuş olan Ukbe b. Ebi Muayt ile Abdullah b. Hatal'ın ve diğerlerinin öldürülmesini emretmiş olması ileri sürülerek bu kanaat reddedile::-Jez. Çünkü onlar bununla birlikte ayrıca Allah'ın haramlarını da çiğniyorlardl. Şöyle de açıklanmıştır: Aişe r.aa, onun dinden çıkıp küfre girmeyi gerektirmeyen hususlarda kendisine eziyet edilmesi halinde intikam almadığını ri.astetmiştir. Nitekim ona karşı katı davranıp sesini yükselten bedevi arabı affet::ği gibi, omzunda iz bırakıncaya kadar ridasından çekiştiren diğerini de affet::-Jiştir. Hadis-i şerifte zorluk dolayısıyla bir şeyin yapılmamasının ve kolayolan :le yetinilmesinin ve mecbur kalınmadıkça ısrarı terk etmenin teşvik edildiğini anlıyoruz. Bundan hareketle hata olduğu ortaya çıkmadığı sürece ruhsatlar ile am el etmek teşvik edildiği gibi, yüce Allah'ın hakları dışındakileri affetmek de, emr i'l-maruf nehy-i ani'l-münker de teşvik edilmektedir. Bunların yapılacağı yerler se daha zor olana götürmemesi halindedir. Yine hadisten anlaşıldığına göre hüküm ve karar vermeyi nefse bırakmamak erekir. İsterse hakimin, aleyhine hüküm vereceği kimseden intikam almayacağ1ndan, aksine sadece konuyu kesin bir neticeye bağlayacağından yana emin lsun. Doğrusunu en iyi bilen Allah'tır. 3561- \"Atlas (dibac)\" ifadesi hususi olanın umumi olana atfedilmesi kabilindendir. Çünkü atlas da bir ipek çeşididir. 3562- \"Bakire kızdan daha ileri derecede hayalı idi.\" Nebi sallaııahu aleyhi .c sellem'in hayalı olduğu yerler, Allah'ın hadleri dışındaki hususlardadır. 3563- \"ResliluIlah sallal!ahu aleyhi ve sellem asla bir yemeği ayıplamış değildir.\" Bu ileride Yiyecekler bölümünde (5409 numaralı hadiste) yüce Allah'ın izniyle açıklanacağı üzere, mubah lan yiyecekler hakkında anlaşılmıştır. 3567- \"Saymak isteyen kişi sayacak olsa sayabilirdi.\" Yani böyle bir kimse onun kullandığı lafızları, kelimeleri ya da harflerini saymaya kalkışsaydı, buna gücü yeter ve sonuna kadar sayabilirdi. Bundan maksat ise tane tane konuşmakta ve muhatapIarının sözlerini anlamasını sağIamakta ileri derecede dikkatli oIduğunu anIatmaktır. 3568- \"Ben namaz kılıyordum\" nafile namaz kılıyordum, demektir. \"Ona yetişmiş oIsaydım. Ona ... karşılık verirdim.\" Onun yaptığına tepki gösterir ve ona konuşurken ağır ağır konuşmamın, aleIaceIe konuşmaktan daha uygun olduğunu açıkIardım. \"O sözlerini -sizin yaptığınız gibi- aleIacele ardı arkasına slraIamazdı.\" Yani acele ederek biri diğerinin arkasına kelimeIeri dizerek konuşmazdı. Onun böyIe yapmasının sebebi ise dinIeyenin sözIerini karıştırmamasını istemesi idi",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}