{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3577,
			"arabicnumber": 3577,
			"text": "Bera' r.a. dedi ki: \"Hudeybiye günü bindörtyüz kişi idik. Hudeybiye, bir kuyunun adıd1r. O kuyudan su çektik ve nihayet orada tek bir damla dahi su bırakmadık. Nebi Sallallahu Aleyhi ve Sellem kuyunun başında oturdu. Su getirilmesini istedi. Suyu ağzında çalkaladıktan sonra kuyuya püskürttü. Aradan fazla zaman geçmeden kuyudan su çektik. Biz de suya kandık, bineklerimiz de suya kandı.\" Bu Hadis 4150 ve 4151 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"İslam geldikten sonra nübuwet alametleri.\" \"Alametler: el-alamat\" lafzı, \"alamet\"in çoğuludur. Musannıfın bu lafzı kullanmasının sebebi, bu hususta zikredeceği rivayetlerin mucize ve kerametin kapsamından daha geniş oluşundan dolayıdır. Aralarındaki farka gelince, mucize daha özeldir. Çünkü mucizede Nebi Sallallahu Aleyhi ve Sellem'in kendisini yalanlayan kimselere, eğer ben bunu yapacak olursam benim doğru söylediğimi kabul edecek misin diye meydan okuması yahut da kendisine meydan okuyan kimsenin: Sen bunu yapmadıkça seni tasdik etmem, demesi şarttır. Ayrıca kendisi ile meydan okunan hususun sürekli olarak görülen, alışılmış adete göre insanların acze düşecekleri şeylerden olması gerekir. Değişik konumlarda Nebi Sallallahu Aleyhi ve Sellem her iki durum ile de karşılaşmıştır. Mucizeye bu adın veriliş sebebi bu hal ile karşılaşan kimselerin ona karşı çıkamayışlarıdır. Nebi sallalliıhu aleyhi ve sellem'in en ünlü mucizesi ise Kur'an-ı Kerim'dir. Çünkü Nebi salı allah u aleyhi ve sellem Kur'an-ı Kerim'le insanlar arasında diııeri en fasih ve söz söylemeye en ileri derecede muktedir olan Araplara, onun bir suresinin benzerini getirmelerini isteyerek meydan okumuş, onlar da ona aşırı düşmanlıklarına ve başkalarını onu izlemekten alıkoymalarına rağmen bunu yapamamış, aciz düşmüşlerdir. Hatta kimi ilim adamı şöyle demektedir: Kur'an.-ı Kerim'deki en kısa sure \"inna a'taynake'l-kevser\"dir. Bir başka sureden \"inna a'taynake'l-kevser\" suresi kadar bir miktar, ister bir ayet, ister daha fazla sayıda ayet, isterse bir ayetin bir kısmı kadar olsun, bu kadarı da onun onlara karşı kendisi ile meydan okuduğu şeyin kapsamı içerisindedir. Buna göre Kur'an mucizeleri bu yönüyle oldukça çok sayıya ulaşabilmektedir. Kur'an-ı Kerim'in i'caz çeşitleri lafızlarının güzel bir şekilde bir araya gelişinde, sözlerinin uyumunda, fesahatinde, veciz olarak kuııanılması gereken yerlerde veciz oluşunda ortaya çıktığı gibi; onun ne derece belağatli olduğu da oldukça ortadadır. Ayrıca buna söz düzeninin güzelliği ve üslubunun alışılmadık bir üslup . olmasını da eklemek gerekir. Bununla beraber onun bu anlatım tarzı nazım ve nesir ile ilgili kuraııarın da dışındadır. Diğer taraftan Kur'an-ı Kerim, gaybı bir takım hususları haber veren buyrukları da ihtiva etmektedir. Kitap ehlinin tek tek bilmedikleri geçmiş ümmetiere dair haberler bu türdendir. Ayrıca Nebi Sallallahu Aleyhi ve Sellem'in kitap ehlinden herhangi birisiyle bir araya geldiği, onlardan bir şeyler öğrendiği de bilinmemekte idi. Hem Kur'an okunduğunda dinleyen kimseyi bir heybet ve bir haşyet kuşatır. Onu okuyan da, dinleyen de bıkıp usanmaz. Onu öğrenmek isteyenler onu kolaylıkla ezberleyebilirler. Okuyan bir kimse de kolaylıkla ve takılmadan onu okur. Bir cahil ya da inatçı biri olması dışında, kimse bunların herhangi birisini inkar edemez. Bundan dolayı önder ilim adamları Nebi Sallallahu Aleyhi ve Sellem'in mucizelerinin en büyüğünün Kur'an olduğunu söylemişlerdir. Kur'an mucizelerinin en belirgin olanı da i'caz halinin devamı ile birlikte muhafaza edilmiş olmasıdır. Kur'an'ın mucizesinden farklı olarak Nebiimizin parmakları arasından suyun fışkırması, yemeğin çoğaltılması, ayın yarılması, cansız varlıkların konuşması gibi hususlara gelince, bunlardan kimisi meydan okumak amacı ile gerçekleşmiştir, kimisi de herhangi bir meydan okuma sözkonusu olmadan Nebiimizin söylediklerinin doğruluğuna delilolmak üzere gerçekleşmiştir. Bütün bunların toplamı, Nebi sallaııahu aleyhi ve sellem eliyle olağanüstü pek çok olayın meydana geldiğini kat'i olarak ortaya koymaktadır. \"İslam döneminde\" yani Nebi olarak gönderildiği andan itibaren ve Nebiliğin süresi boyunca -daha önce meydana gelenler hariç- meydana gelmiş şeyler demektir. Onun doğumu esnasında ve doğumundan sonra nübuwetinin alametleri olarak ortaya çıkan olaylar arasında Taberani'nin zikrettiği şu rivayette sözü geçenler de bulunmaktadır: Taberani, Osman b. Ebi'l-As es-Sakafi'den, o da annesinden rivayet ettiğine göre annesi, Nebi sallaııahu aleyhi ve sellem'in annesi Amine'nin huzurunda idi. Doğum sancıları tutunca şunları söylemişti: Ben semadaki yıldızlara baktığımda, kesin olarak üzerime düşecekler diyene kadar aşağı sarktıklarını gördüm. Amine doğum yapınca ondan adayı ve evin her tarafını aydınlatan bir nur çıktı. İbn Hibban ve Hakim de Nebi sallaııahu aieyhi ve sellem'in süt emmesi ile ilgili kıssada İbn İshak yoluyla Sa'd oğullarından, Halime'ye kadar ulaşan bir sened ile uzunca bir hadis zikretmektedir. Orada belirtildiğine göre nübuwet alametleri arasında Halime'nin memelerinde sütü n çoğalması, aşırı zayıf bulunan dişi devesinin süt vermeye başlaması, eşeğinin hızlıca yürümesi, bundan sonra koyunlarının sütünün artması, topraklarının ekininin bollaşıp, otunun hızlıca büyümesi, iki meleğin göğsünü yarması gibi hususlar sözkonusu edilmektedir. Ayrıca bu sonuneusunu Müslim, Enes yoluyla gelen bir hadiste de zikretmiş bulunmaktadır. 3571- \"Susamış kırk adam su içti.\" Yani bizler o vakit kırk kişi idik. (Kadı) Iyad dedi ki: Bu kıssayı çok sayıda sika kimseler büyük kalabalıklardan ve herkesten ashab-ı kiram'a kadar muttası! olarak ulaşan bir sened ile rivayet etmişlerdir. Bu olayanların pek çoğunun çeşitli yerlerde bulunduğu ve toplu sayıda askerlerin olduğu yerlerde olmuştur. Onlardan herhangi bir kimsenin bunu rivayet edene karşı çıktığı da varid olmamıştır. İşte bu tür rivayetler ile anlatılanlar, onun kat'i olarak bilinen mucizeleri arasında sayılır. Kurtubi der ki: Nebi sallaııahu aleyhi ve sellem'in parmakları arasından suyun fışkırması hadisesi bir çok yerde ve büyük kalabalıklar karşısında defalarca tekrarlanmıştır. Toplamı manevi tevatür yoluyla elde edilen kat'i bir bilgi ifade edecek şekilde pek çok yolla da rivayet edilmişlerdir. Yine Kurtubi der ki: Bizim Nebiimiz sallaııahu aleyhi ve sellem hakkında nakledilenler dışında böyle bir mucizenin benzerinin başkasından nakl edildiği işitilmemiştir. Çünkü su onun kemikleri, damarları, eti ve kanı arasından fışkırm1ştır. İbn Abdi'l-Berr'in naklettiğine göre el-Müzenı şöyle demiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in parmakları arasından suyun fışkırması, suyun taştan fışkırması mucizesinden daha ileri derecededir. Musa asası ile taşa vurmuş ve ondan sular fışkırmıştı. Ama suyun taştan fışkırması alışılagelmiş bir iştir. Oysa et ve kan arasından suyun fışkırması böyle değildir.'\" 3572- \"ez-Zevra\" Medine'de pazarın yanında bilinen bir Y;1 adıdır. 3576- \"Hudeybiye günü insanlar susadı. Nebi sallallahu tY;i ve sellem'in de önünde küçük bir su kabı vardı.\" Buna dair yeterli açıklamalar, ileride yüce Allah'ın izniyle Hudeybiye gazvesi anlatılırken gelecektir.(Hadis no: 41S2'de)",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 86
			}
		}
	]
}