{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3578,
			"arabicnumber": 3578,
			"text": "Bize İmâm Mâlik, İshâk ibn Abdillah ibn Ebî Talha'dan haber verdi ki, o, Enes ibn Mâlik'ten şöyle derken işitmiştir: Ebû Talha, Ümmü Suleym'e hitaben: Yemîn olsun ben bu defa Rasûlüllah'ın sesini zayıf olarak işittim. Kendisinde açlık olduğunu biliyorum. Yanında yiyecek birşey var mı? dedi. Suleym: Evet var, dedi ve arpadan yapılmış birkaç tane ekmek külçesi çıkardı. bir başörtüsü çıkardı da, onun bir kısmı ile ekmekleri sarıp dürdü. Sonra bohçayı benim elimin altına gizledi, örtünün bir kısmını da benim üstüme dürüp sarmaladı. Sonra beni Rasûlüllah'ın yanına gönderdi. dedi ki: Ben de bunu götürdüm. Rasûlüllah'ı mescidde buldum. Beraberinde insanlar vardı. Ben onların yanına varıp dikeldim. Rasûlüllah (sallallahü aleyhi ve sellem) bana: \"Seni Ebû Talha mı gönderdi?\" diye sordu. Ben: Evet, dedim. Rasûlüllah: \"Yemek sebebiyle mi?\" dedi. Ben: Evet, dedim. üzerine Rasûlüllah beraberinde bulunanlara hitaben: \"Kalkınız\" buyurdu ve yürüdü; ben de önlerinde yürüdüm. Nihayet Ebû Talha'ya geldim ve durumu ona haber verdim. Ebû Talha (annem) Ümmü Suleym'e: Yâ Ümme Suleym! Rasûlüllah insanları getirmiştir. Halbuki onları doyurabileceğimiz birşey yoktur, dedi. Suleym: Allah ve Rasûlü en iyi bilendir, dedi. Ebû Talha gitti, nihayet Rasûlüllah'a kavuştu. Rasûlüllah, Ebû Talha ile beraber geldi. Ve: \"Yâ Ümme Suleym! Yanında ne varsa getir!\" buyurdu. da bu ekmekleri getirdi. Rasûlüllah emretti ve ekmekler parmakla küçük küçük parçalara bölündü. Ümmü Suleym bir yağ tulumundan bu bölünen ekmek parçalarının üzerine yağ sıktı ve onu bulayıp katık yaptı. Sonra Rasûlüllah o katık hakkında Allah'ın, söylemesini istediği şeyleri söyledi. Sonra: \"On kişi için izin ver!\" buyurdu. Talha on kişiye izin verdi. Onlar doyuncaya kadar yediler, sonra dışarı çıktılar. Sonra: \"On kişiye daha izin ver!\" buyurdu. Talha onlara da izin verdi. Onlar da doyuncaya kadar yedikten sonra dışarıya çıktılar. Sonra Rasûlüllah tekrar: \"On kişiye daha izin ver!\" cemâatin hepsi de yediler ve doydular. Halbuki bu topluluk yetmiş yahut seksen kişi idi",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 87
			}
		}
	]
}