{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3595,
			"arabicnumber": 3595,
			"text": "Ad'yy ibn Hatim (radıyallahü anh) şöyle demiştir: Ben Peygamber'in yanında bulunduğum sırada Peygamber'e bir adam gelip, O'na fakirlikten şikâyet etti. Sonra Peygamber'e başka bir kimse geldi ve O'na yol kesilmesinden şikâyet etti. Peygamber(sallallahü aleyhi ve sellem): \"Yâ Adiyyl Sen el-Hîre şehrini gördün mü?\" dedi. Ben: Ben onu görmedim, fakat orası hakkında bana haber verildi, dedim. \"Eğer hayâtın uzun olursa muhakkak sen hevdeci içinde yolculuk eden kadının el-Hîre'den hareket edip Allah'tan başka hiçkimseden korkmayarak tâ Ka'be'yi tavaf edeceğini göreceksin\" buyurdu. buna taaccüb ederek kendi kendime: Beldelerde fitne ve fesâd ateşini tutuşturmuş olan o Tayy kabilesinin yol kesicileri nerede olacak ki (kadın tek başına yolculuk edecek)! dedim. devam edip: \"Yemîn olsun eğer sana hayât uzun olursa, muhakkak Kisrâ'nın hazîneleri fetholunacaktır\" buyurdu. Kisrâ ibn Hürmüz'ün hazîneleri mi? dedim. Peygamber şöyle dedi: \"Kisrâ ibn Hürmüz'ün. Yemîn olsun eğer senin hayâtın uzun olursa, muhakkak sen elinin dolusu altın yahut gümüşü sadaka olarak çıkarıp da bunu kendisinden kabul edecek kimse arayacak, fakat kendisinden bunu kabul edecek hiçbir kimse bulamayacak olan kimseyi göreceksin. Yine yemîn ederim ki, sizden biriniz Allah'a kavuşacağı gün, Allah ile kendi arasında kelâmını terceme edecek bir tercüman bulunmayarak Allah'a kavuşacak, Allah da ona: Ben sana bir Rasûl göndermedim mi ve O sana tebliğ etmiyor muydu? diye soracak. kul da: Evet (gönderdin yâ Rabb)! diye cevâb verecek. Bu sefer Allah: Ben sana mal vermedim mi; bu suretle sana ihsanda bulunmadım mı? diye soracak. Evet (verdin ve ihsanda bulundun) diyecek. hâlde o kimse sağına bakar cehennemden başka birşey göremez. Soluna bakar yine cehennemden başka birşey göremez\". dedi ki: Ben Peygamber (sallallahü aleyhi ve sellem)'den işittim, şöyle buyuruyordu: \"Şimdi sizin herbiriniz bir tek hurmanın yarısı ile; bunu da bulamazsa güzel sözle olsun kendinizi cehennem ateşinden koruyunuz\". şöyle demiştir: Ben el-Hîre'den hevdeci içinde yolculuğa çıkıp, Allah'tan başka hiçkimseden korkmayarak nihayet Ka'be'yi tavaf eden kadını gördüm. Ben kendim Kisrâ ibn Hürmüz'ün hazînelerini fetheden ordunun içinde bulundum. Yemîn olsun eğer sizlere hayât uzun olursa, elbette sizler Peygamber Ebû Kaasım’ın söylediği elinin dolusu altını sadaka olarak çıkaracak olan o kimseleri göreceksiniz",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 102
			}
		}
	]
}