{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"61": "Virtues and Merits of the Prophet (pbuh) and his Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3632,
			"arabicnumber": 3632,
			"text": "Abdullah b. Mes'ud r.a dedi ki: \"Sa'd b. Muaz umre yapmak üzere yola koyuldu. Umeyye b. Halef, Ebu Safvan'ın yanına misafir oldu. Umeyye de Şam'a gittiği vakit yolu Medine'ye uğradığında Sa'd'ın yanına misafir olurdu. Umeyye, Sa'd'a dedi ki: Hele gün ortası gelene kadar ve insanlar seni fark etmeyecekleri vakte kadar bir bekle. O zaman gider tavaf edersin. Sa'd tavaf etmekte iken Ebu Cehil ile karşılaştı. Ka'be'nin etrafında tavaf eden bu kişi kim, dedi. Sa'd: Ben Sa'd'ım dedi. Ebu Cehil: Sizler Muhammed'i ve onun ashabını barındırdığınız halde güvenlik içerisinde Ka'be'nin etrafında tavaf mı ediyorsun deyince, Sa'd: Evet dedi. Kendi aralarında tartıştılar. Umeyye, Sa'd'a: Ebu'I-Hakem'e sesini yükseltme, dedi. Çünkü o bu vadidekilerin efendisidir. Daha sonra Sa'd dedi ki: Allah'a yemin ederim eğer Beyt'in etrafında tavaf etmekten beni engelleyecek olursan andolsun senin Şam ile olan ticaretini keserim. (Abdullah b. Mes'ud) dedi ki: Umeyye, Sa'd'a: Sesini yükseltme, demeye koyuldu ve onu tutmaya çalıştı. Fakat Sa'd kızarak: Beni bırak, çünkü ben Muhammed Sallallahu Aleyhi ve Sellem'i seni öldüreceğini söylerken dinledim, dedi. Beni mi, diye sordu. Sa'd: Evet dedi. Bunun üzerine Umeyye: Allah'a yemin ederim, Muhammed konuştu mu yalan söylemez deyip, hanımının yanına döndü ve dedi ki: Yesribli kardeşimin bana ne söylediğini bilmiyor musun? Hanımı: Ne söyledi diye sordu. Umeyye dedi ki: Onun söylediğine göre o Muhammed'i beni öldüreceğini söylerken dinlemiş. Hanımı dedi ki: Allah'a yemin ederim Muhammed yalan söylemez. (Abdullah b. Mes'ud) dedi ki: (Mekkeliler) Bedir'e gitmek üzere çıkıp da Bedir için savaş çağrısı yapıldığında hanımı ona: Yesribli kardeşinin sana söylediğini hatırlamadın mı, dedi. Umeyye savaşa çıkmak istemedi Fakat Ebu Cehil ona: Sen bu vadinin şereflilerindensin. Bir ya da iki gün yola devam et, dedi. O da onlarla iki gün yola gitti ve Allah canını aldı.\" Bu Hadis 3950 numara ile gelecektir",
			"grades": [],
			"reference": {
				"book": 61,
				"hadith": 136
			}
		}
	]
}