{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3651,
			"arabicnumber": 3651,
			"text": "Abdullah r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İnsanların en hayırlıları benim çağdaşlarımdır. Sonra onlardan sonra gelenler, sonra onlardan sonra gelenler. Bundan sonra herhangi birileri yeminden önce şahit\\ik edecek, şahitliğinden önce yemin edecek kimseler gelecektir.\" İbrahim dedi ki: Bizler henüz küçükken şahitlik ve verilen sözler dolayısıyla bizi dövüyorlardı. Fethu'l-Bari Açıklaması: \"Resulullah ashabının faziletleri\" (Yuniniyye nüshasında Resulullah değil Nebi şeklindedir) Yani önce genel olarak, sonra da etraflı olarak faziletleri ele alınacaktır. Genel olarak faziletlerine dair hadisler onların hepsini kapsar. Fakat Buhari bu hususta kendi şartına uygun bazı rivayetleri kaydetmekle yetinmiştir. Kişiler hakkında kaydettiği etraflı rivayetlerden de kendi şartına uygun olan rivayetleri almıştır. \"Müslüman olarak onun sohbetinde bulunan ya da onu gören kimse onun ashabındandır.\" Yani Nebi Sallallahu Aleyhi ve Sellem'in ashabından olma adı, kendisi ile sohbette bulunan kimselerin hak ettiği bir isimdir. Sözlükte bu isim, asgari süre kadar onunla sohbette bulunanlara verilir. Örfe göre bir süre birliktelik için kullanılsa dahi bu böyledir. Aynı şekilde uzaktan dahi olsa onu gören kimseler hakkında da bu isim kullanılır. Buhari'nin sözkonusu ettiği bu tanım, Ahmed'in ve muhaddislerin cumhurunun kabul ettiği görüştür. Buhari'nin \"Müslüman olarak\" kaydı ile de kafir olarak onun sohbetinde bulunan ya da onu gören kimseleri kapsarnın dışına çıkarmaktadır. Bu durumda olup, onun vefatından sonra Müslüman olanlara gelince, eğer Buhari'nin \"Müslüman olarak\" kaydı hal ifade ediyor ise, bu nitelikte olan kimseler de yine bu kapsarnın dışına çıkmaktadır. Kuwetli görülen görüş de budur. Ancak bu tanıma karşı mu'min olarak onun sohbetinde bulunan ya da onu gören bir kimsenin bundan sonra irtidad etmesi ve bir daha da İslama dönmemesi hali ile itiraz edilmiştir. Çünkü böyle bir kimsenin sahabe olmayacağı ittifakla kabul edilmiştir. O halde bu tarife \"ve bu hal üzere ölen\" kaydının da ilave edilmesi gerekmektedir. 3649- \"İnsanlar üzerine öyle bir zaman gelecek ki insanlardan bir kesim gazaya çıkacaklar ... \" Bu hadisten, son dönemlerde Nebiin ashabından -if olduğunu iddia eden kimselerin iddialarının batı! olduğu anlaşılmaktadır. Çünkü hayırlı oluş, cihadın devamlılığını, kafirlerin yurtlarına askerler göndermeyi de ihtiva etmektedir. Onlar da: Aranızda onun ashabından kimse var mı, diye sorunca hayır diyeceklerdir. Tabii'n hakkında aynı durum sözkonusudur. Tabii'nin tabileri hakkında da. Bütün bunlar geçmişte gerçekleşmiş olaylardır ve bu dönemlerde ise kafirlerin diyarlarına asker göndermek kesintiye uğramış bulunmaktadır. Hatta bu hususta durum aksine dönmüştür. Uzun bir dönemden bu yana bilinen ve görülen budur. Özellikle de Endülüs ülkesinde durum böyledir. Hadis ehli ashab-ı kiram'dan en son vefat edenleri tespit etmişlerdir. Mutlak olarak en son vefat eden sahabi Leys oğullarından Ebu't-Tufeyl Amil b. Vasile'dir. Nitekim Müslim bunu Sahih'inde kat'i bir ifade olarak belirtmiştir. Vefatı h.lOO yılındadır. Vefatının h.l07 ve h.11O olduğu da söylenmiştir. Bu, Nebi sallall€ıhu aleyhl ve sellem'in vefatından bir ay önce söylemiş olduğu: \"Yüz yılın başında bugün yeryüzünde bulunanlardan hiçbir kimse kalmayacaktır\" buyruğuna da uygun düşmektedir. 3650- \"Ümmetin en hayırlıları benim çağdaşlarımdır.\" Hadisteki \"benim karn'ımdır\" ifadesi benim karn'ımda bulunanlar (yani çağdaşlarım) demektir. Çünkü karn, maksat olarak gözetilen hususlardan birisinde ortak nitelikleri bulunan ve birbirine yakın zamanlarda yaşayan aynı zamanın (çağın) insanları demektir. Bunun, çağdaşları belli bir din, bir mezhep ya da bir iş etrafında toplayan bir nebi ya da bir başkan çağında bir araya gelmiş kimseler için özellikle kullanılan bir ad olduğu da söylenmiştir. Karn, aynı zamanda zamanın belli bir süresi hakkında da kullanılır. Fakat bu sürenin sınırının ne olduğu hususunda on yıldan başlayıp, yüzyirmi yıla kadar farklı görüşler ortaya atılmıştır. Bu hadiste Nebi sallall€ıhu aleyhi ve sellem'in karnı (çağdaşları) ile kastedilenler ise ashab-ı kiramdır. Nebisallallfıhualeyhivesellem'in niteliği sözkonusu edilirken: \"Ve ben Ademoğullarının karn'larının en hayırlısında Nebi olarak gönderildi\" buyruğu açıklanırken geçmiş bulunmaktadır. Hadis alimlerinin ittifak ettiğine göre etbau't-tabiinden sözü kabul edilebilir kimseler arasında olup en son vefat eden kişi yaklaşık 220 yılına kadar yaşamıştır. Bu dönemde bid'atler yaygın bir şekilde ortaya çıkmaya başlamış, Mutezile'nin dili çözülmüş, felsefeciler başlarını kaldırmış, ilim ehli Kur'an'ın yaratıldığını söylesinler diye mihnete tabi tutulmuş, durumlarda ileri ölçüde değişiklikler baş göstermiştir. Durum şu ana kadar gerileyip, durmaktadır ve nihayet Nebi sallallfıhu aleyhi ve sellem'in dediği şekilde: \"Yalan bundan sonra yaygınlık kazanacaktır\" sözü, olduğu gibi gerçekleşmiş ve o kadar açık bir yaygınlık kazanmış ki sözleri, fiilleri, inançları kapsayacak dereceye ulaşmıştır. Yardım Allah'tandır. \"Sonra onlardan sonra gelenler.\" Yani onlardan sonra gelecek nesiller demektir ki, bunlar da tabiindir. \"Sonra onlardan so..pra gelenler\" Bunlar da etbau't-tabilndir. Bu hadise göre ashab tabiOndan, tabıOn da etbau't-tabilnden daha faziletlidir. Fakat bu faziletli oluş, genel toplam bakımından mıdır yoksa tek tek fertler hakkında mıdır? Bu da araştırılması gereken bir konudur. Cumhur ikinci görüşe meyletmiştir. Birincisi İbn Abdi'l-Berr'in görüşüdür. Anlaşıldığı kadarıyla Nebi sallallfıhu aleyhi ve selle m ile birlikte ya da onun zamanında onun verdiği emir ile savaşan yahut onun için malından bir şeyler infak etmiş bulunan bir kimseye, kim olursa olsun ondan sonra gelen hiçbir kimse fazilet itibariyle denk olamaz. Bununla birlikte bunların hiçbirisini yapmayan kimseler için durum araştırma konusudur. Bunda asıl dayanak ise yüce Allah'ın: \"Aranızdan fetihten önce infak edip savaşanlar (ile diğerleri) bir olmaz. Onların dereceleri fetih sonrasında infak edip savaşanlardan daha büyüktür.\" (el-Hadid, 10) ayetidir. İbn Abdi'l-Berr şu hadisi de delil göstermiştir: \"Benim ümmetimin misali yağmur gibidir. Onun öncesi mi hayırlıdır, sonrası mı hayırlıdır bilinmez.\" Bu hasen bir hadis olup, çeşitli rivayet yolları vardır ve bu yollar sayesinde hadis sıhhat derecesine dahi ulaşabilir. Yine İbn Abdi'l-Berr şunu delil göstermiştir: İlk karnın (çağın) diğer çağların en hayırlısı olmasının sebebi, onların o dönemde kafirlerin çokluğu sebebiyle imanları bakımından garip oluşlarıdır. Ayrıca kafirlerin eziyetlerine sabretmiş ve dinlerine sımsıkı sarılmışlardır. Onlardan sonrakiler de dini dosdoğru uygulayıp, masiyetlerin ve fitnelerin ortaya çıkması halinde dinlerine sımsıkı sarılıp, itaat üzere sabredecek olurlarsa, onlar da o takdirde garip olurlar. Öbürlerinin (ilk nesildekilerin) amelleri artış gösterdiği gibi, o dönemlerde yaşayacak olanların amelleri de artar ve çoğalır. Buna Müslim'in Ebu Hureyre'den Nebi Efendimize merfu olarak zikrettiği şu hadis tanıklık etmektedir: \"İslam garip olarak başladı ve başladığı gibi garip olarak dönecektir. Garipler ne mutlu!\" Ancak İbn Abdi'I-Berr'in açıklamalarına şu şekilde cevap verilmiştir: Onun bu sözleri ashab-ı kiram'dan sonra gelecekler arasında bazı sahabelerden daha faziletli kimselerin gelmesini de gerektirmektedir. Kurtubi de bunu açıkça ifade etmiştir. Fakat İbn Abdi'l-Berr'in sözleri bütün ashab-ı kiram hakkında mutlak olarak kullanılmış değildir. O bu sözlerinde Bedir ve Hudeybiye'ye katılanların müstesna olduğunu da açıkça ifade etmiştir. Evet, cumhurun benimsemiş olduğu sahabe olma faziletine denk hiçbir am el yoktur. Çünkü sahabe olan, Resulullah sallallahu aıeyhi ve sellern'i görmüştür. Resulullah sallallahu aleyhi ve sellern'e gelecek zararlara karşı onu savunmak, erken dönemde ona hicret etmek yahut ona yardımcı olmak, ondan alınmış olan şeriati bellemek ve ondan sonra gelenlere de tebliğ etmek imkanına sahip olanlara daha sonra gelen hiçbir kimse denk olamaz. Çünkü sözü geçen bu hasletlerin her birisini yerine getiren bir kimseye mutlaka ondan sonra o hasleti yapan kimsenin ecri gibi ecir verilecektir. Böylelikle onların faziletli oldukları açıkça ortaya çıkmış olmaktadır. Tartrşma noktası az önce açıklandığı üzere sadece onu görmek faziletine sahip o!{n ve başka hiçbir üstün-'t lüğü olmayan kimseler hakkındadır. Şüphesiz sözü geçen çeşitli hadislerin arası telif edilirse ... 3651- \"Sonra onlardan sonra bir kavim ... (gelecektir).\"(2651 nolu hadis) Bu hadis, fazilet itibariyle konumları farklı olsa dahi ilk üç karn (nesil)in sınırlandırılmasına delil gösterilmiştir. Bu da çoğunluk görülen hakkında yorumlanmıştır. Ayrıca ashab-ı kiram arasında fazilet farkı gözetmenin caiz oluşuna da delil gösterilmiştir. Bu el-Mazeri'nin görüşü olup, hadisin diğer bölümlerine dair açıklamalar daha önce Şehadetler bölümünde geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 3
			}
		}
	]
}