{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3653,
			"arabicnumber": 3653,
			"text": "Ebu Bekir r.a. dedi ki: \"Ben Nebi ile birlikte mağaradayken ona: Eğer onlardan birisi ayağının ucuna bakacak olsa şüphesiz bizi görecektir, dedim. O da şöyle: Ey Eba Bekr üçüncüleri Allah olan iki kişi hakkındaki kanaatin nedir? diye buyurdu.\" Tekrar: 3922 ve 4663 Fethu'l-Bari Açıklaması: \"Muhacirlerin menkıbeleri ve faziletleri.\" Burada muhacirlerden kasıt, ensarın dışında kalanlar ile Mekke'nin fetih günü Müslüman olanlar ile sonradan Müslüman olanların dışında kalanlardır. Buna göre ashab-ı kiram üç türlüdür. Ensar, Evsliler, Hazrediler, onlarla hilfleri olanlar (kabilelerinden sayılmak üzere antlaşma yapmış olanlar) ile onların mevıalarıdır. (Köle azat etmek yoluyla kendilerine intisap edenlerdir.) \"Ebu Bekir, Abdullah b. Ebi Kuhafe et-Teym'i onlardandır.\" Ebu Bekir'e \"es-Sıdd'ik\" lakabının verilmesi, Nebi sallallShu aleyhi ve sellem'i tasdik etmekteki önceliğinden dolayıdır. Ona ilk olarak bu adın verilişinin İsra gecesinin sabahı olduğu söylenmiştir. \"Yüce Allah'ın: \"Eğer siz ona yardım etmezseniz Allah ona yardım etmiştir\" ayeti\" ile musannıf, Ensarın faziletinin de sabit olduğuna işaret etmektedir. Çünkü onlar Allah Resulüne yardım etmek emrinin gereğini yerine getirmişlerdir. .\\ Medine'ye gidişi esnasında Allah'ın Nebiine yardımı ise, onu maksadından geri döndürmek amacıyla takip eden müşriklerin eziyetine karşı koruması suretiyle olmuştur. Yine ayet-i kerimedeki Ebu Bekir es-Sıddik'in fazileti de dile getirilmektedir. Çünkü bu menkıbe sadece ona ait bir özelliktir. Zira bu yolculukta Resulullah sallallahu aleyhi ve sellem'e arkadaşlık etmiş ve kendi canı ile onu korumuştu. Yüce Allah da bu ayet-i kerim e ile onun Nebiine arkadaşlık ettiğine tanıklık etmektedir. Hadis-i Şeriften Şu Hususlar da Anlaşılmaktadır 1. Tabi olan kimse tabi olduğu zata uyanıkken hizmet ettiği gibi uyuduğu vakit de onu (gelebilecek zararlara karşı) himaye eder. 2. Ebu Bekir r.a.'ın Nebi sallallShu aleyhi ve sellem'e ileri derecedeki sevgisi, ona karşı edebi ve onu kendisine tercih etmesi. 3. Yeme, içme adabı ve yenilen ve içilen şeylerin temizlenmesinin müstehap olduğu• 4. Hadisten anlaşıldığına göre matara, sufra (yiyecek çıkını) gibi araçların beraberinde götürülebileceğine, bunun tevekküle aykırı olmadığına da hadiste delil vardır. İleride Hicret bahsinde (3906 nolu hadis'te) Suraka'nın kıssası yüce Allah'ın izniyle eksiksiz olarak gelecektir. 3. NEBİ S.A.V.'İN: \"EBU BEKİR'İN KAPISI DIŞINDAKİ BÜTÜN KAPILARI KAPATINIZ\" HADİSİ-Kİ BUNU İBN ABBAS (NEBİ S.A.V.'DEN DİYE RİVAYET ETMİŞTİR)",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 5
			}
		}
	]
}