{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3655,
			"arabicnumber": 3655,
			"text": "İbn Ömer r.a. dedi ki: \"Biz insanlar (ashab) arasında Nebi zamanında kimin hayırlı olduğunun sıralamasını yapar, önce Ebu Bekir'in sonra Ömer b. el-Hattab'ın, sonra Osman b. Affan r.a.'in hayırlı olduğunu söylerdik.\" Tekrar: 3697 Fethu'l-Bari Açıklaması: \"Nebi sallallahu aleyhi ve sellern'den sonra Ebu Bekir'in fazileti.\" Kasıt, faziletteki mertebesidir. Yoksa zaman itibariyle sonralık kastedilmemektedir. Ebu Bekir'in fazileti bu başlıktaki hadisin de gösterdiği gibi, Nebi sallallahu aleyhi ve sellern'in hayatında da sabit idi. \"ResuluIlah Sallallahu Aleyhi ve Sellem zamanında insanlar (ashab) arasında hayırlı olanların sıralamasını yapardık.\" Yani filan kişi filandan hayırlıdır derdik. İleride Osman radıyallahuanh'ın Menkıbeleri başlığında gelecek olan UbeyduIlah b. Ömer'in Nafi'den yaptığı rivayette şöyle denilmektedir: \"Kimseyi Ebu Bekir'e denk görmezdik. Ondan sonra Ömer, ondan sonra Osman gelir diyordu k. Sonra da ResuluIlah salı allah u aleyhi ve sellem'in (diğer) ashabını bırakır, aralarında fazilet sıralaması yapmazdık.\" Hadisteki: \"Ebu Bekir'e kimseyi denk görmezdik\" ifadesi kimsenin onun gibi olduğu kanaatini taşımazdık, demektir. Ebu Oavud'da Salim'in İbn Ömer yoluyla yaptığı rivayette şöyle denilmektedir: \"ResuluIlah sallallahu aleyhi ve sellern hayatta iken Nebi sallallahu aleyhi ve sellern'in ümmeti arasında ondan sonra en faziletli kişi Ebu Bekir'dir, sonra Ömer'dir, sonra Osman'dır, derdik.\" Taberani bir rivayette şunu eklemektedir: \"Resulullah Sallallahu Aleyhi ve Sellem bunu işitir fakat buna karşı çıkmaz, reddetmezdL\" Hadisi şerifte Ebu Bekir ve Ömer'den sonra Osman'ın geldiği belirtilmektedir. Nitekim ehl-i sünnetin cumhurunun kabul ettiği meşhur görüş budur. Seleften bazı kimseler Osman'dan önce Ali'nin geldiği kanaatindedir. Bu kanaati kabul edenler arasında Süfyan es-Sevrı de vardır. Onun bu görüşünden döndüğü de söylenir. İbn Huzeyme ile ondan önce ve ondan sonra bir kesim de bu görüştedir. Onların biri diğerinden faziletli değildir de denilmiştir. Bununla birlikte bu başlıktaki hadis cumhurun lehine bir delildir. Beyhaki \"el-İtikad\" adlı eserinde Ebu Sevr'e kadar ulaşan senediyle Şafiı'den şöyle dediğini nakletmektedir: Ashab-ı kiram ve onlara tabi olanlar önce Ebu Bekir'in, sonra Ömer'in, sonra Osman'ın, sonra da Ali'nin daha faziletli olduğu hususu üzerinde icma' etmişlerdir. 5. Nebi S.A.V.'İN: \"EĞER HALİL EDiNECEK OLSAYDıM ... \" SÖZÜ -Kİ BUNU EBU SAİD (AZ ÖNCE GEÇEN 3654. HADİSTE) SÖYLEMİŞTİR",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 7
			}
		}
	]
}