{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3667,
			"arabicnumber": 3667,
			"text": "Nebi s.a.v.'in zevcesi Aişe r.a.a'dan rivayete göre \"Resulullah Sallallahu Aleyhi ve Sellem vefat ettiğinde Ebu Bekir, es-Sunh denilen yerde idi. -(Ravilerden) İsmail: eı-Aliye 'yi kastetmektedir, demiştir.- Ömer ayağa kalkıp: Allah'a yemin ederim, Resulullah ölmedi, demeye koyuldu. Aişe dedi ki: Ve Ömer, Allah'a yemin ederim (o an için) içimde başka bir kanaat doğmamıştı, dedi. (Ömer sözlerine şöyle devam etmişti): Andolsun Allah onu gönderecek ve o bir takım kimselerin ellerini ve ayaklarını kesecektir. Derken Ebu Bekir geldi. Resuluilah Sallallahu Aleyhi ve Sellem'in (yüzünün) üzerini açtı, onu öptü ve: Anam babam sana feda olsun dedi. Hayatta iken de hoştun, vefat etmiş halinle de hoşsun. Nefsim elinde olana yemin ederim ki, Allah ölümü sana iki defa tattırmayacaktır. Daha sonra dışarı çıktı ve: Ey yemin eden kişi yavaş ol, dedi. Ebu Bekir konuşmaya başlayınca Ömer oturdu.\" [-3668-] \"Sonra Ebu Bekir Allah'a hamd-u sena edip dedi ki: Dikkat edin, kim Muhammed Sallallahu Aleyhi ve Sellemle ibadet ediyor idiyse şüphesiz Muhammed ölmüş bulunuyor. Kim de Allah'a ibadet ediyorsa muhakkak Allah haydır, ölmez. Yüce Allah şöyle buyurmaktadır: \"Şüphesiz sen de öleceksin, onlar da öleceklerdir.\"[Zümer, 30] \"Muhammed ancak bir resuldür. Ondan önce resuller gelip geçmiştir. Şimdi eğer o ölür ya da öldürülürse siz ökçelerinizin üzerine gerisin geri mi döneceksiniz.? Kim ökçelerinin üzerine gerisin geri dönerse asla Allahla hiçbir zarar veremez. Allah şükredenleri mükafatlandıracaktır.\"[Al-i İmran, 144] Oradakilerin hepsi içlerini çeke çeke ağlamaya başladılar. Ensar Ben-i Saide Sakifesinde Said b. Ubade'nin etrafında toplanarak: Bizden bir emir, sizden bir emir (olsun) dediler. Yanlarına Ebu Bekir, Ömer b. el-Hattab ve Ebu Ubeyde b. el-Cerrah gitti. Ömer konuşmak istediyse de Ebu Bekir onu susturdu. Ömer (sonraları) şöyle derdi: Allah'a yemin ederim konuşmak isteyişimin tek sebebi uygun görüp beğendiğim bir konuşma tasarlamış olmamdl. Ebu Bekir'in bunu ifade edemeyeceğinden korkmuştum. Daha sonra Ebu Bekir konuşunca insanların en belağatlisi olarak konuştu. Sözleri arasında şunları da söyledi: Bizler emirleriz, sizler de vezirlersiniı. Hubab b. el-Munzir: Hayır, Allah'a yemin ederim böyle yapmayınız. Bizden bir emir, sizden bir emir (olsun), dedi. Ebu Bekir dedi ki: Hayır bizler emirleriz, sizler vezirlersiniz. Çünkü onlar hane olarak Arapların en üstünleri, soy sop olarak Arapların hususiyetlerini kendilerinde en çok toplayanlardır. Bu sebeple ya Ömer'e, ya da Ebu Ubeyde'ye bey'at ediniz. Bunun üzerine Ömer: Hayır, sana bey'at ederiz, sen bizim efendimiz, bizim en hayırlımız, Resulullah Sallallahu Aleyhi ve Sellem'in de aramızda en sevdiği kişisin. Ömer elini yakalayarak ona bey'at etti, arkasından diğer insanlar da ona bey'at etti. Oradakilerden birisi: SaId b. Ubade'yi öldürdünüz deyince, Ömer: Onu öldüren Allahltır ,dedi.\" [-3669-] Aişe r.anha dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'in gözleri yukarı doğru baktı, sonra da -üç defa-: Fi’r-Refiki’l a’la (En yüce dost) la beraber dedi ve (ravilerden el-Kasım b. Muhammed b. Ebi Bekr es-Sıddik) hadisin geri kalan kısmını nakletti. (Aişe) dedi ki: O gün ikisinin söyledikleri her bir sözü Allah mutlaka faydalı kıldı. Ömer aralarında münafıklar da varken insanları korkuttu ve bununla Allah onları geri çevirdi.\" [-3670-] \"Sonra andolsun Ebu Bekir insanlara hidayeti göstermiş, onlara üzerlerindeki hakkın ne olduğunu öğretmişti. Böylelikle onlar onunla birlikte çıktıklarında: \"Muhammed ancak bir resuldür. Ondan önce resuller geçip gitmiştir ... Allah şükredenleri mükafatlandıracaktır.\"[Al-i İmran, 144] ayetini okuyarak çıktılar",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}