{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "Ebu Musa el-Eş'arı'den rivayete göre o evinde abdest aldıktan sonra dışarı çıktı. (Kendi kendime) dedim ki: Andolsun Resulullah Sallallahu Aleyhi ve Sellem'in yanından ayrılmayacağım. Bir gün boyunca onunla beraber olacağım, dedi. Mescide geldi, Nebi Sallallahu Aleyhi ve Sellem'i sordu. Dışarı çıktı, dediler ve şu tarafa doğru gittiğini söylediler. Ben de onun arkasından gittim. Onu sorup durdum. Nihayet Eris kuyusun(un bulunduğu bahçey'e girdi. Ben de kapının yanında oturdum. -Kapısı hurma dallarındandı.- Nihayet Resulullah Sallallahu Aleyhi ve Sellem ihtiyacını gördü, sonra abdest aldı. Yanıbaşında durdum. Onun Eris kuyusunun başında oturduğunu gördüm. Kuyunun ağzının ortasına oturdu ve baldırlarını açarak kuyuya sarkıttı. Ona selam verdikten sonra geri çekildim, kapının yanında oturdum. Andolsun bugün Resulullah Sallallahu Aleyhi ve Sellem'in kapıcısı olacağım, dedim. Ebu Bekir geldi, kapıyı itti. Bu kim, dedim. Ebu Bekir dedi. Biraz bekle, dedim. Sonra gittim. Ey Allah'ın Resulü Ebu Bekir izin istiyor, dedim. O: Ona izin ver ve onu cennetle müjdele, dedi. Ben de yanına geldim ve Ebu Bekir'e: Gir, hem Resulullah Sallallahu Aleyhi ve Sellem seni cennetle müjdeliyor, dedim. Ebu Bekir girdi, Resulullah Sallallahu Aleyhi ve Sellem'in sağ tarafına kuyunun ağzında oturdu ve o da Nebi Sallallahu Aleyhi ve Sellem'in yaptığı gibi ayaklarını kuyuya sarkıttı ve baldırlarını açtı. Daha sonra geri döndüm ve oturdum. (Evden çıkmadan) kardeşimi abdest alsın ve bana yetişsin diye bırakmıştım. (Kendi kendime) dedim ki: Eğer Allah filan hakkında --kardeşini kastediyor-- hayır murad etmişse onun buraya gelmesini sağlar. Bir de baktım ki birisi kapıyı oynatıyor. O kim dedim, Ömer b. el-Hattab dedi. Ben biraz bekle dedim. Sonra Resulullah Sallallahu Aleyhi ve Sellem'in yanına gittim. Ona selam verdim. Ömer geldi, izin istiyor, dedim. Ona izin ver ve onu cennetle müjdele, dedi. Ben de gelip içeri gir, dedim. Resuluilah Sallallahu Aleyhi ve Sellem seni cennetle müjdeledi. O da içeri girdi. Resuluilah Sallallahu Aleyhi ve Sellem ile birlikte kuyunun ağzı başında sol tarafına oturdu ve o da ayaklarını kuyuya sarkıttı. Sonra geri döndüm yine oturdum. (Kendi kendime): Allah filan hakkında hayır murad ettiyse onun buraya gelmesini sağlar, dedim. Birisi gelip kapıyı oynattı. O kim dedim. Osman b. Affan dedi. Biraz bekle dedim. Resuluilah Sallallahu Aleyhi ve Sellem'in yanına gelerek ona haber verince şöyle buyurdu: Ona izin ver ve ona isabet edecek bir bela üzerine onu cennetle müjdele. Ben de yanına geldim ve ona: İçeri gir dedim. Ayrıca Resuluilah Sallallahu Aleyhi ve Sellem sana isabet edecek bir bela üzerine seni cennetle müjdeliyor. O da içeri girdi. Kuyunun ağzının dolmuş olduğunu görünce onun karşısında diğer tarafta oturdu. Şerik b. Abdullah dedi ki, Said b. el-Müseyyeb dedi ki: Ben bunu onların kabideri diye tevil ettim.\" Bu Hadis 3693, 6216, 7079, 7262 numara ile gelecektir. Diğer tahric edenler: Tirmizî, Menakîb; Müslim, Fedail-üs Sahabe Tirmizî dediki: Bu hadis hasen sahihtir. Değişik bir şekilde Ebû Osman en Nehdî tarafından da rivâyet edilmiştir. Bu konuda Câbir ve İbn Ömer’den de hadis rivâyet edilmiştir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 24
			}
		}
	]
}