{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3694,
			"arabicnumber": 3694,
			"text": "Abdullah b. Hişam dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem ile birlikte. idik. O sırada Ömer b. el-Hattab'ın elinden tutmuştu ... \" Bu Hadis 6264 ve 6632 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Ebu Hafs el-Kuraşı el-Adev1.\" Başlıkta ğeçen Ömer b. el-Hattab'ın künyesi olan \"Ebu Hafs\" İbn İshak'ın Sıresi'nde belirtildiğine göre Nebi Sallallahu Aleyhi ve Sellem tarafından kendisine verilmiştir. Hafsa r.a. çocuklarının en büyüğü idi. Ömer r.a. ın lakabı ise ittifakla el-Faruk'dur. Denildiğine göre ilk olarak ona bu lakabı veren Nebi Sallallahu Aleyhi ve Sellem'dir. Bunu Ebu Cafer b. Ebi Şeybe, Tarih'inde İbn Abbas yoluyla Ömer'den diye rivayet etmiş bulunmaktadır. İbn Sa 'd da bunu Aişe r.a.a'nın rivayet ettiği bir hadis olarak zikretmiştir. 3679- \"Sesini\" yani hareketini \"işittim.\" Ebu Ubeyd dedi ki: \"el-Haşefe\" pek şiddetli olmayan ses demektir. Bu hadisteki anlamı ise duyulan ayak sesidir. \"Senin kıskançlığını hatırladım.\" Nikah bölümündeki rivayette ise şöyle denilmektedir: \"İçine girmek istedim ama beni alıkoyan tek sebep senin gayretli (kıskanç) olduğunu bilmemdir\" şeklindedir. Ömer r.a.'ın: \"Ben seni mi kıskanacağım\" ifadesi, maklub ifadelerden sayılmıştır. Aslı: Onu senden mi kıskanacağım, şeklindedir. İbn Battal der ki: Hadisten anlaşıldığına göre her kişi hakkında bilinen huyuna göre ayrı bir hükmü vardır. Ömer'in ağlaması sevincinden olabilir. (Cennete) duyduğu şevk ya da huşu'undan ötürü de ağlamış olabilir. Ayrıca bu hadisten Nebi Sallallahu Aleyhi ve Sellem'in arkadaşlığın hukukuna ne kadar riayet etmiş olduğu anlaşıldığı gibi, Ömer'in açık bir fazileti de bu hadisten anlaşılmaktadır. Hadiste er-Rumeysa'nın fazileti de ifade edilmektedir. 3681- \"Onu ne diye yorumladın, diye sordular. O: İlim diye buyurdu.\" Yani ben bunu ilim ile yorumladım. Hadisten Çıkarılan Sonuçlar 1- Ömer r.a.'ın fazileti, 2- Nebilerin rüyası vahiy türünden olmakla birlikte, rüya zahirine göre yorumlanmamak özelliğine sahiptir. Hatta bazı rüyaların özel bir tabiri gerekir. Kimi rüyalar da zahirine göre yorumlanır. İleride yüce Allah'ın izniyle (Rüya) Tabiri bölümünde buna dair açıklamalar gelecektir. 3- Burada ilimden kasıt, insanları Allah'ın kitabına ve Resulünün sünnetine göre idare etme (siyaset) ilmidir. Ömer'in bu özelliğe sahip olmasının sebebi ise, Ebu Bekir r.a.'a nispetle halifelik süresinin uzun olmasıdır. Osman'a nispetle de insanların ona itaat etmek hususunda ittifak etmiş olmalarıdır. Şüphesiz Ebu Bekir'in halifelik müddeti kısa idi. Ayrılıkların en büyük sebeplerini teşkil eden• fetihler de bu sürede çoğalmamıştı. Bununla birlikte Ömer, halifelik süresinin uzunluğuna rağmen insanları kimse ona muhalefet etmeyecek şekilde idare etti. Osman r.a.'ın halifeliği döneminde fetihler daha da genişledi. Çeşitli görüşler etrafa yayıldı, görüşler arasında farklılıklar ortaya çıktı. İnsanların Ömer'e itaat ettikleri gibi onun etrafında ittifak etmedikleri görüldü. Bundan dolayı fitneler ortaya çıktı ve nihayet iş öldürülmesine kadar vardı. Ali r.a.'ın halifeliğe getirilmesi ile de ancak ihtilaf arttı, fitneler daha da yaygınlaştı. \"İbn Cubeyr dedi ki: e1-Abkar'i, değerli yaygılar demektir.\" Değerli (el-ıtak)den kasıt, güzelolanlardır. \"ez-Zerabi\" de \"zeribe\"nin çoğulu olup oldukça değerli ve enli yaygı anlamındadır. el-Meşarik adlı eserde şöyle denilmektedir: el-Abkari (dahi) ondan üstün hiçbir şeyolmayan ve dediğini gerçekleştiren, yerine getiren demektir. Ebu Ömer der ki: Bir kavmin abkarisi (dehası, dahisi) onların efendileri, işlerini çekip çevirenleri ve büyükleri demektir. 3683- \"Ömer, Resulullah sallaJlahu aleyhi ve seJlem'in huzuruna girmek için izin istedi. Yanında da Kureyş'ten kadınlar vardı.\" Sözkonusu bu hanımlar Nebi efendimizin zevceleri idi. Onlarla birlikte başkalarının da bulunma ihtimali vardır. Fakat \"ondan daha çok şey istiyorlardı\" ifadesi birinci ihtimali desteklemektedir. Daha çok istemelerinden maksat da onlara verdiğinden daha fazlasını istemeleridir. \"Allah seni (hep) güldürsün\" ifadesi ile kastettiği onun çokça gülmesi değildir. Aksine gülmenin gereği olan sevinçli olmaktır. \"Fec\" geniş yol demektir. \"Mutlaka senin gittiği n yoldan başka bir yola gider.\" Bu ifade ile Ömer'in pek büyük bir faziletine dikkat çekilmektedir. Buna göre şeytanın, Ömer'in aleyhine bir yol bulamaması gerekir. Tabi bu onun günahtan korunmuş olmasını gerektirmez. Zira hadiste sadece şeytanın Ömer'in gittiği aynı yoldan gitmeyip, bu birliktelikten kaçtı ğı anlatılmaktadır. Bu ise şeytanın gücünün yettiği ölçülere göre ona vesvese vermesine engel değildir. Şeytanın vesvesesi ile ona musallat olamayacağı mefhum-i muvafakat yolu ile anlaşılmaktadır. Çünkü onunla aynı yolda yürümek istemediğine göre ona vesvese verme imkanını bulamayacak şekilde ondan uzak durup, onunla içli dışlı olmaması öncelikle sözkonusudur. Buna göre Ömer'in şeytandan korunmuş olması da mümkündür, denilse, (şöyle cevap verilebilir): Ama bu da Ömer'in masumiyetinin sabit olmasını gerektirmez. Çünkü masumiyet, Nebi sallallahu aleyhi ve sellern hakkında vacip (zorunlu), başkaları hakkında mümkün olan bir şeydir. 3684- \"Ömer Müslüman olduğundan itibaren hep güçlü kaldık.\" Buna sebep ise Ömer'in Allah'ın emri hususundaki gayreti ve gücüdür. 3685- \"Ömer\" vefat edince \"teneşiri üzerine yerleştirildL\" \"Bir de ne göreyirn ... \" yani hiçbir şey beni ürkütmedL Maksat onu ansızın gördüğüdür. \"Daha çok sevdiğim ... \" Bu ifadelerden anlaşıldığına göre Ali r.a., o zamanda kimsenin, Ömer'in amelinden daha faziletli bir am el işlememiş olduğuna inanıyordu. 3687 - \"Resulullah sallallahu aleyhi ve sellern'den sonra ... \" Bu özel bir zaman için anlaşılır. Bu da onun halifelik süresidir. Böylelikle Nebi sallallahu aleyhi ve sellern ile Ebu Bekir bu genellemenin dışına çıkmış olur. \"Sonuna kadar\" ifadesi, ömrünün sonuna kadar demektir. 3689- \"Muhaddesun\" lafzı \"muhaddes\" kelimesinin çoğuludur. Bunun açıklaması hususunda farklı görüşler vardır. Kendisine ilham olunan kimse diye açıklanmıştır. Çoğunluğun garüşü budur. Özel bir kasıt olmamakla birlikte, dilinden doğru şeyler dökülen kimsedir, diye de açıklanmıştır. \"Şüphesiz Allah hakkı Ömer'in dili ve kalbi üzerine bırakmıştır\" hadisi bunu desteklemektedir. Bu hadisi Tirmizi, İbn Ömer yoluyla rivayet etmiştir. 3691- \"Bunu ne diye yorumladm, diye sordular.\" İleride (Rüya) Tabiri bahsinde bu soruyu soranm Ebu Bekir olduğu gelecektir. Hadisin geri kalan bölümlerinin açıklaması da yüce Allah'ın izniyle orada gelecektir. Ancak bu hadiste şu hususun açıklanmasına ihtiyaç vardır: Bu hadise göre Omer, Ebu Bekir es-Sıddık'tan daha faziletlidir. Buna şöyle cevap verilir: Hadisteki: \"İnsanlar bana sunuldu\" umumi ifadesinden Ebu Bekir tahsis edilir. Muhtemelen ona arzedilenler arasında o sırada Ebu Bekir yoktu. Ömer'in üzerinde yerde sürüklediği bir gömleğinin bulunması, Ebu Bekir'in üzerinde ondan daha uzun ve daha çok bedeni örten bir elbise olmamasını da gerektirmez. (Görülen rüya) muhtemelen de böyle olabilir. Ancak o sırada maksat, Ömer'in faziletinin açıklanması olduğundan ötürü bu kadarını açıklamakla yetinmiştir. Doğrusunu en iyi bilen Allah'tır. 3692- \"Onu teskin etmek istercesine\" ifadesi, sanki acı çektiğini söylüyor ve bundan dolayı bir parça kınarcasına demektir ya da onun ızdırabını azaltmak için bu sözleri söylemiştir, anlamına da gelir. Yüce Allah'ın: \"Nihayet kalplerinden korku giderilince\"[Sebe, 23] buyruğuna benzemektedir ki, onlardan korku giderilince demektir",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 44
			}
		}
	]
}