{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3696,
			"arabicnumber": 3696,
			"text": "(Ubeydullah b. Adiy b. el-Hiyar'ın ona -yani Urve'ye- haber verdiğine göre) Misver b. Mahreme ile Abdurrahman b. Esved b. Abdi Yeğus, (Ubeydullah'a) dediler ki: \"Senin (Osman'ın anne bir) kardeşi Velid hakkında Osman ile konuşmana engel olan nedir? Çünkü insanlar onun hakkında çokça konuşmaya başladılar. Bunun üzerine ben de Osman'a gittim. Onun namaza çıkmasını bekledim. Sana bir ihtiyacım var ve bu aynı zamanda senin için bir nasihattir, dedim. O: Ey adam senden ... -Ma'mer dedi ki: Zannederim senden Allah'a sığınırım,- dedi. Ben de geri dönüp ikisinin yanına gittim. Bu sırada Osman'ın elçisi geldi. Bunun üzerine onun yanına gidince, nasihatin nedir diye sordu. Dedim ki: Şüphesiz şanı yüce Allah-Muhammed Sallallahu Aleyhi ve Sellem'i hak ile göndermiştir. Ona kitabı indirmiştir. Sen de Allah'ın ve Resulünün davetini kabul edenlerden oldun, iki defa hicret ettin. Resulullah Sallallahu Aleyhi ve Sellem'in ashabından oldun. Onun hidayet usulünü gördün. İnsanlar ise Velid hakkında çokça konuşmaya başladılar. Dedi ki: Sen Resulullah Sallallahu Aleyhi ve Sellem'e yetiştin mi? Ben: Hayır, dedim fakat bana örtüleri arkasında bulunan bakire kız'a ulaştığı kadar onun ilminden bir şeyler ulaştı, dedim. Dedi ki: Şüphesiz Allah Muhammed Sallallahu Aleyhi ve Sellem'i hak ile göndermiştir. Ben de Allah'ın ve Resulünün davetini kabul edenlerden oldum. Onunla gönderilenlere iman ettim. Dediğin gibi iki defa hicret ettim, Resulullah Sallallahu Aleyhi ve Sellem'in sohbetinde bulundum, ona beyrat ettim. Allah'a yemin olsun ki ona isyan etmedim. Allah onun ruhunu kabzedinceye kadar onu aldatmadım. Daha sonra Ebu Bekir'e karşı durumum da böyle idi. Sonra Ömer'e karşı durumum da bu oldu. Bundan sonra ben halifeliğe getirildim. Onların sahip oldukları hak kadar benim hakkım yok mu? Ben: Elbette vardır dedim. Dedi ki: O halde sizden bana kadar gelen bu konuşmalar ne oluyor? Velid ile ilgili söylediklerine gelince, inşallah bu hususta hakka uygun ne ise onu yapacağız. Sonra Ali'yi çağırdı, celde vurmasını emretti, o da ona seksen celde vurdu.\" Bu Hadis 3872 ve 3927 numara ile gelecektir. * * *Not: Parantez arasındaki bu ifade Buhari'nin zikrettiği ifadelerden olup, kimin kime ne dediğinin anlaşılması açısından kaydedilmesinin zorunlu olduğunu gördüğümüzden eklemiş bulunuyoruz",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 46
			}
		}
	]
}