{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3700,
			"arabicnumber": 3700,
			"text": "Amr ibnu Meymûn şöyle demiştir: Ben, Omer ibnu'l- Hattâb'ı vurulmasından birkaç gün önce Medine'de görmüştüm: Huzeyfe ibnu'l-Yemân ile Usmân ibn Huneyf'in yanı başlarında durdu da: Nasıl yaptınız? Irak ahâlîsine takat yetiremeyecekleri harâc yüklemiş olmanızdan korkuyor musunuz? dedi. Biz Irak arazîsine onların tâkat yetirebilecekleri, büyük bir fazlalık olmayan bir vergi yükledik, dediler. Arazîye takat yetiremeyecekleri bir harâc yüklemiş olmanızdan iyi düşünüp sakınınız, dedi. ibn Meymûn dedi ki: Huzeyfe ile İbnu Huneyf: Hayır, biz oraya takatlerinin üstünde vergi yüklemedik, dediler. üzerine Omer: Eğer Allah beni selâmette kılarsa, muhakkak ben Irak ahâlîsinin dullarını benden sonra ebediyyen bir erkeğe muhtâc olmayacakları hâlde bırakacağım, dedi. ibn Meymûn şöyle dedi: Omer'in üzerinden sâdece dördüncü gece geçti. Nihayet dördüncü gecenin sabahında Omer vuruldu. Vurulduğu sabah ben Mescid'de saff içinde dikeliyordum. Benimle Omer arasında Abdullah ibn Abbâs bulunuyordu. Omer'in âdeti iki saff arasından geçerken \"Saffları düzeltiniz\" diye emreder, nihayet safflarda imtizâmsızlık görmeyince mihraba geçer, iftitâh tekbîrini alırdı. Cemâatin toplanması için ekseriya ilk rek'atte Yûsuf Sûresi'ni yahut en-Nahl Sûresi'ni yahut da bunlara benzer uzunlukta bir sûre okurdu. O sabah da bu suretle mihraba geçip tekbîr aldı. Müteakiben ben Omer'in: \"Köpek beni öldürdü (yahut köpek beni yedi)\" dediğini işittim. anda (Ebû Lû'lû Fîrûz denilen mecûsî) bir Acem genci Omer'i hançerlemişti ve elinde iki yüzlü bir hançerle kaçmaya ve geçtiği safflarda sağlı sollu râst geldiği kimseleri vurmaya başlamıştı. Nihayet bu suretle onüç kimseyi hançerledi. Bunlardan yedisi öldü. Bu kanlı vaziyeti gören müslümânlardan birisi borus denilen geniş başlığını cânînin boynuna atıp geçirdi. Kâfir köle yakalandığını anlayınca kendini hançerleyerek intihar etti. yaralanınca Abdurrahmân ibn Avf'ın elinden tutup, onu mihraba geçirdi. ibnu Meymûn şöyle dedi: Omer'e yakın bulunan herkes benim görmekte olduğum bu işi (yânı kölenin Omer'i hançerlemesini) muhakkak görmüştür. Amma mescidin kenarlarında bulunan kimselere gelince onlar birşey bilmiyorlardı. Ancak onlar Omer'in namaz içindeki sesini kaybetmişlerdi. Onlar bundan taaccüb ederek: Subhânallah, Subhânallah, diyorlardı. cemâate hafif bir namaz kıldırdı. Namazdan çıkınca Omer, İbn Abbâs'a: Ey Abbâs oğlu! Git gör bakalım, beni kim vurdu? Dedi. Abbâs bir müddet dolaştıktan sonra geldi ve: Mugîre ibn Şu'be'nin kölesidir, dedi. Şu san'atkâr mı? Dedi. Abbâs: Evet, diye tasdîk etti. Allah onun canını alsın! Ben ona iyilik emretmiştim. Allah'a hamd olsun ki, benim ölümümü müslümânlık iddiasında bulunan bir kimsenin eliyle yaptırmadı! dedi. Omer, İbn Abbâs'a hitaben şunları söyledi: Sen ve baban Abbâs, ikiniz Medine'de kâfir kölelerin çok olmasını arzu ediyordunuz. sahâbîler içinde ençok kölesi olan kimse idi. Bunun üzerine İbn Abbâs, Omer'e: İstersen yaparım, yani eğer istersen Medine'deki köleleri öldürürüz, dedi. İbn Abbâs'a: Yanlış söyledin. Onları sizin dilinizle konuşmaları, sizin kıblenize namaz kılmaları ve haccınızı hacc yapmalarından sonra öldürebilir misin? dedi. ibn Meymûn devamla dedi ki: Sonra Omer kendi evine taşındı. Biz de beraberinde gittik. Durum öyle idi ki, sahâbîlere ve Medîne halkına bundan önce bu derece elem verici bir musibet erişmemişti. Bâzı kimse yaralarında tehlike yoktur diyor, bâzı kimse de ben Omer üzerine korkuyorum diyordu. Yaralar tedaviye başlandığı sırada bir'mikdâr nebîz getirildi. Omer onu içti, fakat hemen karnından dışarı çıktı. Sonra süt getirildi. Omer onu da içti, fakat bu da karnındaki yaradan çıkmaya başladı. Bunun üzerine herkes, Omer'in bu yaralardan öleceğini bildiler. Biz de Omer'in yanına girdik. Artık insanlar takım' takım geldiler de Omer'in iyiliklerini söylüyor, onu övüyorlardı. Bu sırada Omer'in yanına Ensâr'dan genç bir insan geldi de: Ey Müzminlerin Emîri! Allah'ın sana olan lutûf ve insaniyle sevin: Rasûlüllah'la sohbetin ve iyice bilmekte olduğun İslâm'daki kıdemin (bunca yüksek hizmetlerin) vardır. Sonra halîfe oldun, hep adalet ettin. Bu beşerî faziletlerden sonra şehîdlik rütbesi vardır! Dedi. Bu halifelik işinin bana bir kefâf olmasını, yani ne aleyhime ikaabi, ne de lehime sevabı olmasını arzu ettim, dedi. genç arkasını dönüp giderken Omer onun izârının uzunluğundan dolayı yerde sürünüyor olduğunu gördü de: Şu genci bana geri getirin, dedi. O genç gelince, ona: Ey kardeşim oğlu! Elbiseni yerden kaldır. Çünkü bu kaldırma elbisen için daha bekaa verici(yahut daha temiz kılıcı), Rabb'ın için de daha takvâlı olur, dedi. sonra Omer oğluna hitaben şunları söyledi: Ey Omer'in oğlu Abdullah! Üzerimde olan borçlara bak! dedi. hesâb ettiler ve borcunu seksen bin yahut buna yakın buldular. Omer şöyle devam etti: Eğer Omer ailesinin malı bu borca yeterse, borcu onların mallarından öde! Eğer Omer'in malı borca yetmezse Adiyy ibn Ka'b oğulları'ndan mal iste. Eğer onların malları da yetmezse Kureyş kabilesinden mal iste ve onlardan öteye, yani daha başkalarına gitme Bu mallarla benim borcumu öde! Mü'minlerin Anası Âişe'ye git de ona: Omer sana selâm söylüyor, de: \"Mü'minlerin Emîri\" ta'bîrini söyleme. Çünkü ben bu gün Mü'minlerin Emîri değilim. Ve Âişe'ye: Omer ibnu'l-Hattâb iki arkadaşının yanına gömülmek için senden izin istiyor, de! dedi. Omer, Âişe'ye gitti, ona selam verip yanına girmeye izin istedi. Sonra Âişe'nin yanına girdi, onu oturmuş(Omer için) ağlıyor buldu. İbn Omer, Âişe'ye: Omer ibnu'l-Hattâb sana selâm ediyor ve iki arkadaşının beraberinde gömülmesi hususunda izin istiyor, dedi. Ben burayı kendim için düşünüyordum. Fakat bu gün elbette Omer'i nefsime üstün tutarım, dedi. dönüp gelince, Omer'e: İşte Abdullah ibn Omer gelmiştir, denildi. Omer: Beni kaldırın, dedi. kimse Omer'i kendisine dayadı. Omer, Abdullah'a: Yanında ne haber var? diye sordu. Abdullah: Ey Mü'minlerin Emîri, yanımda senin arzu etmekte olduğun şey vardır. Âişe (iki arkadaşınla gömülmene) izin verdi, dedi. el-Hamdü lillâh(Allah'a hamd olsun)! Bu gün benim için dostlarımın yanına gömülmekten başka daha ehemmiyetli hiçbir iş ve arzu yoktur. Ben ölünce cenazemi hücreye taşıyınız. Sonra Âişe'ye teslim ediniz. Sen Âişe'ye: Omer ibnu'l-Hattâb senden izin diler, de. Eğer Âişe benim oraya gömülmem için izin verirse, beni oraya girdiriniz. Şayet Âişe beni reddederse, sizler benim cesedimi müslimânlarm kabirlerine götürüp gömünüz, diye vasiyet etti. sırada mü'minlerin anası Hafsa geldi. Beraberinde birtakım kadınlar yürüyordu. Biz onları görünce kalktık. Hafsa babasının huzuruna girdi ve yanında bir müddet ağladı -bir nüshada: Bir müddet eylendi-. Erkekler Omer'in yanına girme izni istediler. Hafsa da kendi ev halkına âid olan bir yere girdi. Biz o içeri mekândan onun ağlamasını işittik. Gelen erkekler Omer'e: Ey Mü'minlerin Emîri, vasiyet et, yerine birini halef seç de onu bize tavsiye et, dediler. Mü'minlerin bu halifelik işine Rasûlüllah'ın kendilerinden razı olarak vefat ettiği şu neferler yahut şu topluluktan daha lâyık bir kimse bulmuyorum, dedi ve Alî, Usmân, ez-Zubeyr, Talha, Sa'd ibn Ebî Vakkaas, Abdurrahmân ibn Avf diye isimlerini saydı. Omer şunu da söyledi: Abdullah ibn Omer de sizlerle hazır bulunup nezâret eder. Fakat ona bu halifelik işinden hiçbirşey yoktur(yani onun re'y hakkı olmayacaktır). -Omer'in, oğlunun re'y hakkı olmamasından kınlan gönlünü, o şûrada hazır bulunmasını söylemesi- ibn Omer'i teselli hey'etinde olmuştur. devamla: Eğer emirlik Sa'd'a isabet ederse, o bu işin ehli ve yeridir. Îsabet etmezse, sizden hanginiz emîr yapılırsa Sa'd'ın yardımını istesin (ondan istifâde etsin). Çünkü ben Sa'd'ı Küfe Valiliğinden ne aczi, ne de hıyanetinden dolayı ayırdım, dedi. devamla şunları söyledi: Benden sonraki halîfeye ilk Muhâcirler'i tavsiye ederim. Bu ilk Muhacirlerin haklarının tanınmasını ve onlara yapılan hürmetin muhafaza edilmesini tavsiye ederim. Ve yine benden sonraki halîfeye Ensâr'a da hayırlı olmasını tavsiye ederim. O Ensâr ki, Peygamber'in ve Muhâcirler'in Medine'ye gelmelerinden önce Medine'yi yurt ve îmân evi edinmiş olan kimselerdir. İşte onların iyilerinin iyilikleri kabul olunmalı, kötülerinin kötülüğü ve kusurları affedilmelidir. Ben yeni halîfeye bütün memleketler halklarına da hayırla muamele etmesini tavsiye ederim. Çünkü onlar İslâm'ın yardımcılarıdır, mal toplayıcılardır, çoklukları ve kuvvetleriyle düşmanı öfkelendirenlerdir. Onlardan ancak kendi nzâlarıyle mallarının fazlası alınmalıdır. Ve yine ben yeni halîfeye, bedevilere de hayırla muamele etmesini tavsiye ederim. Çünkü bedeviler Arab'ın aslı ve İslâm'ın maddesidirler. Onların mallarının(en iyilerinden değil de) etraf olanlarından alınıp fakirlerine verilmesini tavsiye ederim. Ve yeni halîfeye Allah'ın zimmetini ve Rasûlüllah'ın zimmetini tavsiye ederim: Allah'ın ve Rasûlü'nün ahd ve emâmnda olan(Yahûdî, Hristiyan..) her topluluğun ahd ve emânlarmın yerine getirilmesini tavsiye ederim. Bütün ferdlerin ve grupların hakları verilmeli, vazifeleri ve işleri görülmelidir. Onlara bir düşman saldırdığında, onların arkalarından ve önlerinden müdâfaa edilmeleri için harb yapılmalı ve kendileri ancak takat yetirecekleri cizye vergisi ile mükellef kılınmalıdırlar. şöyle devam etti:) Omer vefat edince, onu evinden çıkardık(onun namazını Suheyb kıldırdı). Sonra yürüyerekonu Âişe'nin hücresine getirdik. Abdullah selâm verdikten sonra Âişe'ye: Omer ibnu'l-Hattâb senden izin ister, dedi. Âişe: Onu içeriye girdiriniz, dedi. hücrenin içine girdirildi ve orada iki arkadaşının yanında kabrine konuldu. gömülmesi işi bitirilince, o şûra hey'eti toplandı. Bu toplantıda Abdurrahmân ibn Avf, ihtilâfı azaltacak ve seçimi kolaylaştıracak şu amelî teklifi söyledi: Seçmedeki re'yinizi kendinizden gönül hoşluğu ile üç kişiye veriniz! dedi. teklif üzerine ez-Zubeyr: Ben seçim işimi, yani re'yimi Alî'ye tahsis ettim, dedi. Talha da: Ben seçim işimi Usmân'a tahsis ettim, dedi. Sa'd ibn Ebî Vakkaas: Ben seçim işimi Abdurrahmân ibnAvf'a tahsis ettim, dedi. Bunun üzerine Abdurrahmân, Alî ile Usmân'a da: Arkadaşlar, hanginiz devlet başkanlığı adaylığından feragat ederse bu seçim işiyle meşgul olmayı ona verelim. Allah ve müslümânlar ona murâkıb ve şâhiddir. Onlar işin kendisinde(yahut kendi i'tikaadında) bu işe kimin daha elverişli olduğunu şübhesiz daha iyi görür ve bilirler, dedi. ile Usmân sükût ettiler. Bunun üzerine Abdurrahmân iki arkadaşına: Öyleyse bu seçim işiyle uğraşmayı bana havale ediyor musunuz? (Çünkü ben size rekaabet edecek değilim.) Allah üzerimde şâhiddir ki, ben sizin efdalinizi seçmekte kısaltma, yâni eksiklik yapmayacağım (adaletten ayrılmayacağım), dedi. da: Evet (bu seçim işini sana havale ediyoruz), dediler. (Abdurrahmân üç gün üç gece uyku bile uyumaksızın bütün halk tabakalarıyle temas ederek umûmî arzuyu anladı.) Bunun üzerine son akdedilen toplantıda Alî'nin elini tutarak: Yâ Alî, kat'î bilirsin ki, senin Rasülullah'a hısımlığın ve islâm'da kıdemin vardır. Allah, üzerinde murâkıbdır. Yemîn olsun eğer ben seni emîr seçersem, İslâm ümmeti üzerinde muhakkak adalet edersin. Yine yemîn ederim ki, eğer Usmân'ı seçersem, muhakkak sen onun da sözlerini dinler ve elbette emirlerine itaat edersin, dedi. Abdurrahmân ibn Avf, diğerine yani Usmân'a dönerek, Alî'ye söylediğinin benzerini ona da söyledi. Abdurrahmân onların her ikisinden de bu suretle mîsâk (yani çok sağlam söz ve ahd) aldıktan sonra, Usmân'a: Yâ Usman elini kaldır! Dedi ve Usmân'a bey'at etti. de Usmân'a bey'at etti.(Sonra kapılar açıldı.) Medîne ahâlîsi de girdiler ve Usmân'a bey'at ettiler",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 50
			}
		}
	]
}