{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3707,
			"arabicnumber": 3707,
			"text": "Ali r.a. dedi ki: \"Daha önce nasıl hükmediyorsanız öyle hükmediniz. Çünkü ben ayrılıktan hoşlanmam; ta ki insanların bir cemaati oluncaya ya da ben de arkadaşlarım öldüğü gibi ölünceye kadar.\" İbn Sirin, Ali r.a. nakledilen (ve bu husustaki sahih rivayetlerle bağdaşmayan) rivayetlerin genel olarak yalan olduğu görüşünde idi. Fethu'l-Bari Açıklaması: \"Ali b. Ebi Talib\" b. Abdulmuttalib \"el-Kuraşı el-Haşimı Ebu'l-Hasen'in menkıbeleri.\" Resulullah Sallallahu Aleyhi ve Sellem'in babasının öz kardeşi olan amcasının oğludur. Tercih edilen görüşe göre Nebiliğin verilişiriden on yıl önce dünyaya gelmiştir. Nebi Sallallahu Aleyhi ve Sellem, -Nebevi sırette açıklanmış bir olay sebebiyle- küçüklüğünden beri onu yanına alıp büyütmüştür. Bu sebeple küçüklüğünden beri Nebi efendimizin yanında bulunmuş, vefatına kadar yanından ayrılmamıştır. Annesi Esed b. Haşim'in kızı Fatıma'dır. O da Müslüman olmuş ve Nebiin sahabisi olmuştur. Nebi salı allah u aleyhi ve sellem hayatta iken vefat etmiştir. Ahmed, İsmail el-Kadi, en-Nesai ve Ebu Ali en-Neysaburı'nin dediklerine göre; Ali hakkında ceyyid (güzel, sağlam) senedler ile varid olduğundan daha çok ashab-ı kiram'dan herhangi bir kimse hakkında rivayet varid olmuş değildir. Bunda muhtemelen onun vefatının sonraya kalmış olması, zamanında görüş ayrılıklarının meydana gelmesi ve ona karşı baş kaldıranların ayaklanmasıdır. Bu onunla ile ilgili menkıbelerin yaygınlaşmasına sebep teşkil etmiştir. Bununla birlikte bu menkıbelerin çoğu diğer ashab için de sözkonusu olmuştur. Ancak onun hakkında yaygınlaşmasının sebebi, ona muhalefet edenlerin kanaatlerini reddetmek içindir. Böylelikle insanlar Ali hakkında: Ehl-i sünnet, bid'at ehlinden Haricller ile ona karşı savaşan Umeyye oğulları ve onlara uyanlar olmak üzere üç gruba ayrılmış oldu. Bu sebeple ehl-i sünnet, onun faziletlerinin yaygınlaştırılmasına ihtiyaç duydu. Bundan dolayı bu hususta muhalefet edenlerin çokluğundan ötürü bunları nakledenler de çoğalmış oldu. Yoksa hakikatte olan şudur: Her dört halifenin de, adalet terazisi ile ölçüldüğü takdirde kesinlikle ehl-i sünnet ve'l-cemaatin görüşünün dışına çıkmayan faziletleri bulunmaktadır. Yakub b. Süfyan sahih bir senedIe Urve'den şöyle dediğini rivayet etmektedir: \"Ali henüz sekiz yaşında iken Müslüman oldu.\" İbn İshak ise \"on yaşında iken\" demiştir. Bu husustaki rivayetler arasında en tercihe değer olanı budur. 3704- \"Sonra Ali hakkında ona sordu. Onun da güzel amellerini sözkonusu etti.\" Onun Bedir ve diğer gazvelere katılışını, yüce Allah'ın Hayber'in fethini onun vasıtası ile gerçekleştirmesini, Merhab'ı öldürülüşünü ve buna benzer hususları zikretmiş gibidir. \"Allah burnunu yere sürtsün.\" Yani Allah hoşuna gitmeyecek şeyleri başına getirsin. 3706- \"Harun'un, Musa'ya göre konumu ne ise sen de bana göre o konumda olmaya razı olmaz mısın?\" Yani Harun'un, Musa'nın yanındaki konumu, mevkii ne ise sen de benim yanımda o konumda olmaya razı değil misin? Said b. el-Müseyyeb 'in, Sa'd'dan naklettiği rivayetinde: \"Bunun üzerine Ali: Razı oldum, razı oldum\" dediği nakıdilmektedir. Bunu da Ahmed rivayet etmiştir. , İbn Sa'd da el-Bera ve Zeyd b. Erkam'dan buna yakın bir şekilde olayı naklettikten sonra \"(Ali) dedi ki: Razıyım ey Allah'ın Resulü, dedi. Bunun üzerine Allah Resulü: Şüphesiz ki bu böyledir\" diye buyurdu. Her ikisinin de naklettikleri hadisin baş tarafında belirtildiğine göre Nebi sallallahu aleyhi ve sellem, Ali r.a.'a: \"Mutlak olarak ya benim kalmam ya da senin kalman gerekiyor, dedi. Bunun üzerine Ali kaldı. Bazılarının: Nebi onu hoşuna gitmeyen bir hali dolayısıyla geriye bıraktı, dediklerini işitince Ali arkasından giderek ona bunu zikretti, Allah ResuIü de ona ... dedi\" deyip hadisi zikretmektedirler. Senedi kavidir. Musannıf (Buhari) Ali r.a.'ın menkıbelerine dair bazı rivayetleri başka bir yerde de zikretmiş bulunmaktadır. Bunlardan birisi Ömer r.a.'ın söylediği: \"Ali aramızda en güzel hüküm verenimizdir\" sözüdür. İleride Bakara suresinin tefsirinde gelecektir. Ayrıca bunun Hakim tarafından zikredilmiş, İbn Mes'ud yoluyla gelen sahih bir şahidi de vardır. Bu kabilden rivayetlerden birisi de Ali r.a.'ın bağller ile savaşmış olmasıdır. Ebu Said yoluyla gelen hadiste: \"Ammarlı bağı olan (meşru yöneticiye haksızca baş kaldıran) bir kesim öldürecektir\" denilmektedir. Ammar da Ali r.a. ile birlikte idi. Yine onun menkıbeleriyle ilgili rivayetlerden birisi de Hariciler ile savaşmasıdır. Onun menkıbelerine dair ceyyid hadislerin bir araya getirilerek telif edilmiş en kapsamlı eser Nesai'nin \"el-Hasais\" adlı eseridir. \"Ben kimin mevlası isem, Ali de onun mevlasıdır\" hadisini de Tirmizi ve Nesai rivayet etmiş olup, rivayet yolları gerçekten pek çoktur. İbn Ukbe bunları ayrı bir kitapta bir araya getirmiştir. Bunların senedierinin de bir çoğu sahih ve hasendir. 3707- \"Ali r.a.'dan nakledilen rivayetlerin genelolarak\" yani çoğunluk ile \"uydurma olduğu görüşünde idL\" Bu inanca ve kanaate sahipti, demektir. Bundan maksat ise Rafızilerin Ali'den diye naklettikleri ve Şeyhayn (Ebu Bekir ve Ömer)'e muhalefeti ihtiva eden türden rivayet ettikleri sözlerdir. O bu sözleri ile şer'i ahkama dair gelmiş olan rivayetleri kastetmemiştir. Çünkü İbn Sa'd sahih bir sened ile İbn Abbas'tan şöyle dediğini rivayet etmektedir: \"Sika birisi bize Ali'den bir fetva nakledecek olursa biz onun dışına çıkmayız",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 57
			}
		}
	]
}