{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"8": "Prayers (Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 371,
			"arabicnumber": 371,
			"text": "Enes b. Malik'ten şöyle nakledilmiştir: \"Nebi (Sallallahu aleyhi ve Sellem) Hayber'e sefer düzenledi. Orada gece karanlığının sonlarına doğru sabah namazını kıldık. Allah Resulü (Sallallahu aleyhi ve Sellem) bir bineğe bindi. Peşi sıra Ebu Talha bindi. Onun terkine de ben bindim. Allah Resulü bineğini Hayber sokağında gezdiriyordu. Bu esnada dizim onun uyluğuna değiyordu. Sonra Nebi (Sallallahu aleyhi ve Sellem) uyluğundan izarını kaldırdı. Uyluğunun beyazlığını görebiliyordum. Hayber'e girdiği zaman, üç defa: 'Allahu Ekber! Bir toplumun yurduna girdiğimiz zaman, işte o an uyarılanların sabahı ne kötüdür!' dedi.\" Enes olayı anlatmaya şöyle devam etti: \"İnsanlar işlerine yöneldi. Bu esnada Nebi (Sallallahu aleyhi ve Sellem)'i gören insanlar, 'Muhammed geldi' dediler. (Hadisin ravilerinden Abdülaziz hadisi şu şekilde ilaveli olarak nakletmiştir: Ashabımızdan bazıları \"Muhammed ve beşli ordusu\" geldi dediler.)\" Enes olayı anlatmaya şöyle devam etti: \"Hayber'i savaşarak aldık. Sonra esirler, bir araya toplandı. Bu esnada Dihye gelerek: 'Ey Allah'ın elçisi! Esirlerden bana bir cariye ver' dedi. Nebi (Sallallahu aleyhi ve Sellem) de, 'Git ve birini seç' buyurdu. Dihye Safiyye bintu Huyey'i aldı. Bunun üzerine biri Rasulullah (Sallallahu aleyhi ve Sellem)'e gelip 'Ey Allah'ın elçisi, Dihye'ye Kurayza ve Nadîr kabillerinin hanım efendisi Safiyye bintu Huyey'i verdin. Muhakkak ki, bu kadın ancaksana yakışır.' dedi. Nebi (Sallallahu aleyhi ve Sellem) 'kadınla birlikte Dihye'yi çağırın' buyurdu. Allah Resulü Safiyye'yi görünce Dihye'ye: 'Esirlerden bunun dışında bir cariye al' dedi. Enes olayı anlatmaya şöyle devam etti: \"Nebi s.a.v. Safiyye'yi azat edip onunla evlendi.\" Sabit Enes'e \"Ey ebu Hamza onun mehri ne oldu?\" diye sormuş. O da şöyle cevap vermiştir: \"Mehri kendisi oldu. Allah Resulü mehir olarak onu azat edip sonra da onunla evlendi. Yolda iken Ümmü Süleym onu Nebi s.a.v. için hazırladı ve geceleyin onun yanına yolladı, Böylece Allah Resulü güveyi oldu. Sabah olunca: 'Kimin yanında ne varsa, getirsin!' buyurdu ve deriden yapılma bir örtü açtı. Kimi hurma, kimi yağ, zannımca kimi de sevîk getirdi.\" Enes şöyle devam ederek: \"İnsanlar hurmayı, yağ ve kurutulmuş yoğurtla karıştırdılar. İşte bu, Rasûlullah'ın ziyafeti oldu, dedi. Tekrar: 610, 947, 2228, 2235, 2889, 2893, 2943, 2944, 2945, 2991, 3085, 3086, 3367, 3647, 4083, 4084, 4197, 4198, 4199, 4200, 4201, 4211, 4212, 4213. 5085, 5159, 5387, 5425, 5528, 5968, 6185, 6363, 6369, 7333",
			"grades": [],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		}
	]
}