{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3755,
			"arabicnumber": 3755,
			"text": "Kays'dan rivayete göre; \"Bilal, Ebu Bekir'e dedi ki: Eğer beni kendin için satın almış idiysen beni burada tut ve eğer beni ancak Allah için satın aldı isen beni Allah için yapmak istediklerimle baş başa bırak.\" Fethu'l-Bari Açıklaması: \"Bilal b. Rebah'ın menkıbeleri\" İbn Sa\"d\"ın naklettiğine göre o eşraftan birisinin cariyesinden doğma idi. Annesinin adı Hamame\"dir. Cumah oğullarından birisine aitti. Taberani ve başkalarında yer alan Enes\"den gelen rivayete göre aslen Habeşli idi. Meşhur olan da odur. Nube\"li olduğu da söylenmiştir. \"Ebu Bekir'in mevlası (azatlısı)\" Ebu Bekir b. Ebi Şeybe sahih bir sened ile Kays b. Ebi Hazim'den şöyle dediğini rivayet etmektedir: \"Bilal taşlar altına gömülmüş iken Ebu Bekir onu beş ukiyye karşılığında satın aldı.\" \"Ömer derdi ki: Ebu Bekir bizim seyyidimizdir ve -Bilal'i kastederek- seyyidimizi azad etmiştir.\" İbnu't-TIn der ki: Bununla Bilal'in seyyidlerden (efendilerden) olduğunu kastetmektedir. Yoksa Ömer'den daha faziletli olduğunu kastetmek istememiştir. Başkası da birinci seyyid'i hakikat anlamında, ikincisini ise mecaz yollu ve tevazu olsun diye söylemiştir. Yahut da seyyidlik daha efdal olmayı gerektirmeyebilir. İbn Ömer der ki: \"Ben Muaviye'den daha seyyidini görmedim.\" Halbuki o Ebu Bekir ve Ömer'i de görmüştür. \"Bilal, Ebu Bekir'e dedi ki\" O bu sözlerini Ebu Bekir'e halifeliği sırasında söylemiştir. \"Beni Allah için yapmak istediklerimle baş başa bırak\" ibaresi el-Kuşmthent rivayetinde \"Allah için amelimle baş başa bırak\" şeklinde, Ebu Usame'nin rivayetinde: \"Beni bırak da Allah için am el edeyim\" anlamındadır. İbn Sa'd da Tabakat'ta bu olayı naklederken şu fazlalığı zikretmektedir: \"Ben gördüğüm kadarıyla mu'minin en faziletli ameli cihad etmektir. Bu sebeple Allah yolunda ribat yapmak istedim. Ebu Bekir ise Bilal'e: Allah için ve benim üzerindeki hakkım dolayısıyla, deyince Bilal, (Ebu Bekir) vefat edene kadar onunla birlikte kaldı. Fakat Ebu Bekir vefat ettikten sonra Ömer ona izin verdi. O da cihad etmek üzere Şam'a gitti. Orada Amevas taununda 18 yılında orada vefat etti. 20 yılında vefat ettiği de söylenmiştir.\" Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 100
			}
		}
	]
}