{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"62": "Companions of the Prophet"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3756,
			"arabicnumber": 3756,
			"text": "İbn Abbas'tan dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem beni bağrına basarak: Allah'ım ona hikmeti öğret, diye buyurdu.\" Bize Ebu Ma'mer anlattı, bize Abdu'l-Varis anlattı: \"Ve Allah'ım, ona kitabı öğret, diye buyurdu.\" Bize Musa anlattı, bize Vuheyb, Halid'den anlattı, deyip onun (Ebu Ma'mer) gibi hadisi zikretti. \"Hikmet\" ise nübuvvetin dışındaki hususlarda isabet etmek demektir. Diğer tahric edenler: Tirmizî, Menakîb; Müslim, Fedail Tirmizî: Bu hadis hasen sahihtir. Fethu'l-Bari Açıklaması: \"İbn Abbas\" yani Abdullah b. el-Abbas b. Abdulmuttalib b. Haşim olup, Nebi sallallahu aleyhi ve sellem'in amcasının oğludur. Künyesi, Ebu'I-Abbas'dır. Hicretten üç yıl önce doğmuş, 68 yılında Taif'te vefat etmiştir. Ashab-ı kiram'ın alimlerinden idi. Öyle ki, Ömer genç olduğu halde onu yaşlılar ile birlikte öne geçirirdi. Buhari onun hakkında kendisinin rivayet ettiği şu hadisi zikretmektedir: \"Nebi sallallahu aleyhi ve sellem beni bağrına bastı ve: Allah'ım, ona hikmeti öğret, diye buyurdu.\" Bir başka lafızda \"ona kitabı öğret\" şeklindedir. Burada \"hikmet\" ile neyin kastedildiği hususunda görüş ayrılığı vardır. Söylenen sözde isabetli olmak diye açıklandığı gibi, Allah'tan geleni iyice kavramak, aklın, doğruluğuna tanıklık ettiği husus, ilham ile vesvesenin kendisi vasıtası ile ayırt edilebileceği bir nur, doğru bir şekilde çabucak cevap vermek ve daha başka şekillerde açıklanmıştır. İbn Abbas ashab-ı kiram arasında Kur'an tefsirini en iyi bilen kişilerden idi. Yakup b. Süfyan da Tarih'inde sahih bir senedIe İbn Mes'ud'un şöyle dediğini rivayet etmektedir: \"Eğer İbn Abbas bizim yaşımıza gelmiş olsaydı, bizden hiçbir kimse onunla boy ölçüşemezdi.\" Yine İbn Mes'ud şöyle derdi: \"İbn Abbas Kur'an'ın ne güzel bir tercümanıdır.\" Bu fazlalığı İbn Sa'd da bir başka yoldan Abdullah b. Mes'ud'dan diye rivayet etmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 62,
				"hadith": 101
			}
		}
	]
}