{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3791,
			"arabicnumber": 3791,
			"text": "Ebu Humeyd'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şüphesiz Ensarın evlerinin en hayırlısı Neccar oğullarının evi, sonra Abdu'l-Eşhel, sonra el-Haris oğullarının, sonra Saide oğullarının evleridir. Bununla birlikte Ensarın bütün evlerinde hayır vardır. Biz arkasından Sa'd b. Ubade'ye yetiştik. (Ebu Hammad): Ey Ebu Useyd, Allah'ın Nebi'i Sallallahu Aleyhi ve Sellem'in Ensar arasında hayırlı olanlari sıralarken bizi en sona bıraktığını görmedin mi? dedi. Sa'd, Nebi Sallallahu Aleyhi ve Sellem'in arkasından yetişti ve, ey Allah'ın Resulü, Ensarın evleri arasında hayırlı olanlar söylendi de biz en sona bırakıldık, dedi. Allah Resulü: Hayırlı olanlar arasında olmak size yetmez mi, diye buyurdu.\" . Fethu'l-Bari Açıklaması: \"Ensarın evlerinin fazileti\" onların konakladıkları yerler kastedilmektedir. \"Ebu Useyd\" es-Said! olup, künyesi ile meşhurdur. Adının Malik olduğu söylenmiştir. \"Ensarın evlerinin en hayırlısı Neccar oğullarıdır.\" Bunlar Hazredilerdendir. en-Neccar denilen kişi Teymullah'ın kendisidir. Ona bu adın veriliş sebebi ise bir adama vurduğu bir darbe ile bir tarafını kesmesidir. Bundan dolayı ona en-Neccar denilmiştir. Babasının adı Sa'lebe b. Amr olup, Hazredilerdendir. \"Sonra Abdu'l-Eşhel oğullarıdır.\" Bunlar da Evs'tendir. Adı Abdu'I-Eşhel b. Cuşem b. el-Haris b. el-Hazrec el-Asğar b. Amr b. Malik b. el-Evs b. Harise'dir. \"Sonra da el-Haris b. el-Hazrec oğullarıdır.\" Bu da el-Hazrec el-Ekber olup, İbn Amr b. Malik -sözü geçen- b. el-Evs b. Harise'diY:' \"Sonra Saide oğullarıdır.\" Bunlar da Hazredidir. Saide b. Ka'b b. el-Hazrec el-Ekber'dir. \"Ensar evlerinin en hayırlılarıdır. Bununla birlikte Ensarın bütün evlerinde hayır vardır.\" Birinci \"hayırlıdır\" daha faziletlidir anlamındadır, ikincisi ise bütün Ensar için sözkonusu olan -farklı mertebelerde olsa dahi- fazilettir. \"Said b. Ubade\" dedi. Said da Saide oğullarındandır. O gün için onların ileri gelenleri (büyükleri) idi. \"Hayırlılardan olmak size yetmez mi?\" Faziletlilerden olmak size yetmez mi demektir. Çünkü onlar kendilerine göre daha aşağıda olanlara nisbetle daha faziletlidirler. Aralarındaki bu fazilet mertebesi daha erken İslama girmeye, yüce Allah'ın kelimesini yükseltmek için çalışmaya ve benzeri hususlara göre yapılmış gibidir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 16
			}
		}
	]
}