{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3794,
			"arabicnumber": 3794,
			"text": "Yahya b. Sa'd'dan rivayete göre o, Enes b. Malik r.a. ile eI-Velid'in yanına gittiği zaman (ona) şöyIe dediğini dinlemiştir: \"Nebi Sallallahu Aleyhi ve Sellem Ensarı onIara Bahreyn'i ikta oIarak vermeye davet etti (teklif etti). OnIar ise kardeşIerimiz Muhacirlere onun gibisini ikta oIarak vermedikçe oImaz, dediler. Şöyle buyurdu: Madem kabul etmiyorsunuz, o halde benimle karşılaşacağınız vakte kadar sabrediniz. Gerçek şu ki benden sonra (size) başkalarının tercih edildiğini göreceksiniz.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in Ensara: Havz'ın başında benimIe karşılaşıncaya kadar sabrediniz, diye buyurmas!.\" Yani o Ensara böyIe hitap etmişti. \"Bunu Abdullah b. Zeyd nakletmiştir.\" Ab4ıa-h b. Zeyd b. Asım eI-Mazini'dir. Onun bu hadisini müellif mevsuI bir sened ile bundan daha tam oIarak iIeride yüce Allah'ın izniyIe geIeceği gibi Huneyn gazvesinde zikretmiş buIunmaktadır. \"Bana görev vermez misin?\" Yani beni de sadaka topIamak yahut bir böIgeyi yönetmek üzere görevIendirmez misin? \"Benden sonra başkaIarının (size) tercih edildiğini göreceksiniz.\" BununIa yönetim işinin başkaIarının eline geçeceğine ve Ensar dışarıda tutuIarak malların başkalarının elinde bulunacağına işaret etmektedir. Durum Reso.lullah Sallallahu Aleyhi ve Sellem'in anlattığı gibi olmuştur. Bu da onun gelecekte gerçekleşeceğini haber verip, haber verdiği şekilde meydana gelen haberler arasında sayılmaktadır. İleride Fiten bahsinde buna dair geniş açıklamalar gelecektir. \"Sizinle buluşma yerimiz Havz(ın başıdır.)\" Kıyamet gününde Nebi Sallallahu Aleyhi ve Sellem'in Havzı başında demektir. \"Onunla\" yolculuğa \"gittiği zaman.\" \"el-Velid b. Abdulmelik b. Mervan ... \" Enes, Haccac kendisini rahatsız edince Basra'dan Dımaşk'a onu el-Velid b. Abdulmelik'e şikayet etmek üzere gitmişti. Velid de Enes'in Haccac'dan hakkını almıştı. 9. NEBİ S.A.V.'İN: \"(ALLAH'IM) ENSAR İLE MUHACİRİ ISLAH ET\" DİYE DUA ETMESİ",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 19
			}
		}
	]
}