{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3809,
			"arabicnumber": 3809,
			"text": "Enes b. Malik r.a.: \"Nebi Sallallahu Aleyhi ve Sellem Ubeyy'e dedi ki: Şüphesiz Allah bana: لَمْ يَكُنِ الَّذِينَ \"Kafir Kitap ehlinden ve müşriklerden... ayrılmayacaklardı. \"[Beyyine, 1] suresini sana okumamı emretti. Ubey adımı da söyledi mi, dedi. Allah Resulü: Evet deyince, ağladı.\" Bu Hadis 4959, 4960, 4961 numara ile gelecektir. Diğer tahric edenler: Tirmizî, Menakîb; Müslim, Fedail Fethu'l-Bari Açıklaması: \"Ubeyy b. Ka'b\" b. Kays b. Ubeyd b. Zeyd b. Muaviye b. Amr b. Malik b. en-Neccar \"ın menkıbeleri.\" Ensardan olup, Hazredi ve Neccar oğullarındandır. Künyesi Ebu'I-Munzir ve Ebu't-Tufayl'dır. Ensar arasından erken Müslüman olanlardan idi. Akabe'de, Bedir'de ve onlardan sonraki belli başlı olaylarda bulunmuş birisidir. 30 h. yılında vefat ettiği söylendiği gibi başka tarihler de söylenmiştir. (Buhari) bu başlık altında az önce Abdullah b. Mes'ud'un menkıbeleri arasında zikredilmiş bulunan Abdullah b. Amr'ın rivayet ettiği hadisi zikretmektedir: \"Ubeyy: Benim adımı da verdi mi, dedi.\" Yani ismimi açıkça zikretti mi yoksa ashabımdan herhangi birisine bunu oku, diye buyurdu da beni sen mi seçtin? Allah Resulü ona \"evet\" deyince, ya bundan dolayı sevincinden ötürü ağladı ya da yüce Allah'ın bu nimetine karşı şükretmekte zayıf olabilir korkusu ile ve huşu' ile ağladı. Bu hadisten, insanın ilmi ehli olanlardan öğrenmek hususunda -bu kişiler mertebe itibariyle daha aşağıda olsalar dahi- mütevazı davranmanın fazileti anlaşılmaktadır. Kurtubi der ki: Özellikle bu surenin sözkonusu edilmesi -oldukça veciz (özlü) olmakla birlikte- tevhidi, risaleti, ihlası, diğer nebilere indirilmiş bulunan sahifeleri, kitapları kapsaması, namazdan, zekattan, ölümden sonra dirilişten sözetmesi, cennetIiklerle cehennemlikleri açıklaması dolayısıyladır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 34
			}
		}
	]
}