{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3821,
			"arabicnumber": 3821,
			"text": "Aişe r.anha dedi ki: \"-Hatice'nin kızkardeşi- Huveylid kızı Hale Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna girmek üzere izin istedi. Bu ona Hatice'nin izin isteyişi gibi geldi. Bu sebeple adeta dehşete kapıldı. Allah'ım, Hale bu, dedi. (Aişe) dedi ki: Ben de kıskandım ve dedim ki: Geçmiş zamanda ölüp gitmiş, ağzının etrafı kırmızı, Kureyş'in koca karılarından bir kocakarının nesini hatırlıyorsun ki? Üstelik Allah sana onun yerine ondan hayırlısını vermiş bulunuyor.\" Fethu'l-Bari Açıklaması: \"Hatice\" Nebi efendimizin ilk olarak evlendiği kadındır. Huveylid'in kızı olup, Huveylid'in babası, Esed b. Abdu'l-Uzza b. Kusay'dır. Nesebi Nebi Sallallahu Aleyhi ve Sellem ile birlikte Kusay'da bir araya gelmektedir. Neseb itibariyle hanımları arasında kendisine en yakın olanı odur. Ümmü Habibe dışında ondan başka Kusay'ın soyundan gelen bir kadınla da evlenmemiştir. Hatice ile cumhurun görüşüne göre 25 yaşında iken evlenmiştir. Hatice'yi onunla babası Huveylid evlendirmiştir. Nebiden önce Ebu Hale b. enNebbaş b. ez-Zürare et-Temimı ile evliydi. Bu da Abdu'd-Oarr oğulları ile antlaşmalı idi. Nebi Sallallahu Aleyhi ve Sellem, Hatice ile evlenmeden önce onun malı ile Şam'a ticari ortak olarak yolculuk yapmıştı. Hatice'nin kölesi Meysere Nebide gördüğü haller dolayısıyla Hatice onunla evlenmeyi arzuladı. ez-Zubeyr der ki: Hatice cahiliye döneminde et-Tahire diye çağırılırdı. Sahih kabul edilen görüşe göre Nebi Sallallahu Aleyhi ve Sellem'e nübuvvet verildikten on yıl sonra Ramazan ayında vefat etmiştir. Böylece -sahih görüşe göre- Nebi Sallallahu Aleyhi ve Sellem ile birlikte onbeş yıl kalmış olmaktadır. Bundan önce Vahyin başlangıcı bölümündeki başlıklarda Nebi sallallah u aleyhi ve sellem'i ilk olarak tasdik ettiğine ve onun bu işte sebat gösterdiğine dair açıklamalar geçmiş bulunmaktadır ki, bu da onun yakıninin ne kadar güçlü olduğunu, oldukça akıllı ve sağlam kararlı olduğunu göstermektedir. Şüphesiz o, -tercih edilen görüşe göre- hanımlarının en faziletlisi idi. Daha önce Nebiler ile ilgili hadisler bölümünde Meryem sözkonusu edilmiş ve buna dair bazı açıklamalar da geçmiş bulunmaktadır. 3815- \"Onun kadınlarının en hayırlısı Meryem'dir, onun kadınlarının en hayırlısı Hatice'dir.\" Benim daha kuwetli gördüğüm görüşe göre \"onun kadınlarının en hayırlısı\" ifadesi mukaddem bir haber olup, zamir de Meryem'e aittir. Şöyle buyurmuş gibidir: Meryem onun yani ona çağdaş olan kadınların en hayırlısıdır. Hatice hakkında da aynı şey sözkonusudur. Diğer taraftan şarihlerin pek çoğu da kastedilenin çağdaşı olan kadınlar olduğunu da söylemişlerdir. Nesaı'nin sahih bir sened ile rivayet ettiği, Hakim'in de zikrettiği İbn Abbas yoluyla gelen merfu hadiste şöyle denilmektedir: \"Cennet ehli kadınlarının en faziletiileri Hatice, Fatıma, Meryem ve Asiyeldir.\" Bu, tevil edilme ihtimali bulunmayan apaçık bir nastır. 3816- \" ... Nebi s.a.v.'in hanımlarından kimseyi (bu kadar) kıskanmadım.\" Hadiste (kumalar arası) kıskançlığın olduğu kabul edilmektedir. Bunun reddedilebilecek bir şeyolmadığı, ayrıca daha alt mertebede olanlar bir yana üstün fazilete sahip kadınlar arasında bile görülebileceği tespit edilmektedir. Aynı şekilde Aişe radıyAllahu anha Nebi sallAllahu aıeyhi ve sellem'in diğer hanımlarını da kıskanırdl. Fakat Hatice'yi daha çok kıskanırdl. Bunun sebebini de açıklamış ve Nebi sallAllahu aleyhi ve sellem'in onu çok anmasının buna sebep olduğunu belirtmiştir. 3818- \"O şöyle idi, böyle idi.\" Yani o faziletli bir kadın idi, akıllı idi ve buna benzer. \"Hem benim ondan çocuklarım oldu.\" İbrahim dışında Nebi sallAllahu aleyhi ve sellem'in bütün çocukları Hatice'dendir. İbrahim cariyesi Mariye'den doğmuştu. Nebi sallAllahu aleyhi ve sellem'in Hatice'den doğduğu ittifakla kabul edilmiş çocukları şunlardır: Kendisi ile künyelendiği el-Kasım -Nebiliğin verilmesinden önce ya da sonra küçük yaşta ölmüştür.- dört kızı olan Zeyneb, sonra Rukayye, sonra Ümmü Gülsum, sonra da Fatıma. Denildiğine göre Ümmü Gülsum, Fatıma'dan daha küçük idi. Abdullah ise Nebiliğin verilmesinden sonra doğmuştur. İttifakla kabul edildiğine göre erkekler küçük yaşta vefat etmiştir. Nebi sallAllahu aleyhi ve sellem'in dünya da iken Hatice'ye verdiği mükafatlardan birisi de o hayatta olduğu sürece başkasıyla evlenmemiş olmasıdır. Müslim'in, ez-Zühri'den, onun Urve'den, onun Aişe'den diye rivayet ettiğine göre Aişe şöyle demiştir: \"Nebi s.a.v. Hatice ölünceye kadar başkasıyla evlenmemiştir.\" Bu, haberlere dair ilim sahibi olan kimseler arasında görüş ayrılığı bulunmayan hususlardan birisidir. Hadiste Hatice'nin Nebi nezdindeki değerinin büyüklüğüne,faziletinin oldukça fazla olduğuna delil vardır. Çünkü o kendisinden başka bir hanım ile evlenmesine ihtiyaç bırakmamıştır. Onunla birlikte kalmak hususunda, başkalarının ortaklaşa sahip oldukları sürenin iki katı kadar bir süre boyunca o tek başına onunla birlikte kalmıştır. Çünkü Nebi sallallfıhu aleyhi ve sellem Hatice ile evlendikten sonra 38 yıl yaşamıştır. Hatice bu 38 yılın 25 yılında tek başına Nebi ile birlikte yaşamıştır. Bu ise yaklaşık toplam sürenin üçte ikisi eder. Sürenin uzunluğuna rağmen, onun kalbine kıskançlığın girmesine sebep teşkil edecek bir tutumdan, muhtemelen kendisini dahi rahatsız edebilecek kumaların tartışmalarından onu uzak tutmuştur. İşte bu, ondan başka kimsenin onunla paylaşmadığı bir faziletidir. Hatice'nin sahip olduğu özelliklerden birisi de bu ümmetin hanımları arasında herkesten önce iman etmiş olmasıdır. Böylelikle o kendisinden sonra iman eden bütün hanımlara bu yolu açmış oldu. Bu sebeple onların ecirlerinin bir misli de ona verilecektir. Çünkü \"kim güzel bir yol açarsa ... \" hadisinde sabit olan budur. Bu özellikte erkekler arasında Ebu Bekir es-Sıddık onunla ortaktır. Bu sebeple onların aldıkları sevabın ne kadar olduğunu yüce Allah'tan başkası bilemez. Nevevı der ki: Bu hadislerde güzel geçinmeye, sevginin hakkını korumaya, ölmüş ya da hayatta bulunan arkadaş ın ve birlikte yaşanılan kimsenin hatırasına saygı göstermek gerektiği, o arkadaş ın tanıdıklarına ikramda bulunmanın gereği de dile getirilmektedir. 3819- \"İçi oyulmuş inciden\" İbnu't-Tın der ki: Bundan maksat pek büyük bir köşk (saray) gibi oldukça geniş, içi oyulmuş bir incidir. es-Süheyll der ki: Beyt (köşk)in sözkonusu edilmesinin ince bir anlamı vardır. Çünkü o Nebilikten önce bir ev hanımı idi. Daha sonra İslam gelince de tek başına bir ev hanımı oldu. Nebi sallallfıhu aıeyhi ve sellem'in Nebi olarak gönderildiği ilk günden itibaren yeryüzünde onun evi dışında İslam evi yoktu. Bu ise yine ondan başka kimsenin kendisiyle paylaşmadığı bir fazilettir. (es-Süheyll devamla) der ki: Yapılan bir fiilin karşılığı ondan daha üstün olsa bile çoğunlukla aynı lafızIa sözkonusu edilir. Bundan dolayı hadiste köşk, saray lafzı değil de beyt (ev) lafzı kullanılmıştır. es-Süheyll'nin ifadeleri burada sona ermektedir. \"Beyt\" lafzının zikredilmesinin bir başka anlamı daha vardır. Çünkü Nebi sallallfıhu aıeyhi ve sellem'in Ehl-i Beyti'nin vardığı yer odur. Nitekim yüce Allah'ın: \"Ey Ehl-i Bey tt Allah sizden ancak kir i giderip, tam anlamıyla sizi temizlemek ister.\"[Ahzab,33] buyruğunun tefsiri ile ilgili olarak sabit olduğuna göre Ümmü Seleme şöyle demiştir: \"Bu ayet nazil olunca Nebi sallallfıhu aleyhi ve sellem Fatıma'yı, Ali'yi, el-Hasan'ı ve el-Hüseyn'i çağırdı. Onların üzerini bir elbise ile örterek: Allah'ım, bunlar benim Ehl-i Beytimdir, demiştir.\" Bu hadisi Tirmizi ve başkaları rivayet etmiştir. Bütün bu Ehl-i Beyt'in vardığı yer ise Hatice r.a.a'dır. Çünkü el-Hasan ile el-Hüseyn Fatıma'dandır. Fatıma da onun kızıdır. Ali de Hatice'nin evinde küçük yaştan beri büyümüş, onun vefatından sonra da kızıyla evlenmiştir. Böylelikle Beyt-i Nebevi'nin ehlinin başkasına değil, yalnız Hatice'ye rad olduğu da ortaya çıkmış olmaktadır. \"Gürültünün, patırtının, yorgunluğu n argınlığın olmadığ!.\" Buradaki \"es-sahab (gürültü patırtı)\" yüksek sesle bağırmak, yüksek sesle tartışmak demektir. \"en-Nasab\" de yorgunluk argınlık demektir. 3820- \"Ona Rabbinden ve benden selam söyle.\" Nesaı'de Enes'ten şöyle dediği rivayet edilmektedir: \"Cibril, Nebi Sallallahu Aleyhi ve Sellem'e dedi ki: Şüphesiz Allah Hatice'ye selam söylüyor.\" Yani ona bunu bildir. \"Bunun üzerine Hatice: Şüphesiz Allah es-Selamdır. Cibril'e de selam olsun, sana da ey Allah'ın Reso.lü. Allah'ın rahmeti ve bereketleri de.\" İlim adamları der ki: Bu olayda Hatice'nin oldukça fakih (ince anlayışlı) oluşuna delil vardır. Çünkü o teşehhüdde bazı sahabilerin dedikleri \"es-selam u alallah\" şeklinde karşılık vermemiştir. Nebi sallallahu aleyhi ve selle m de onların böyle demelerini yasaklamış ve: \"Şüphesiz Allah es-Selam'ın kendisidir. Bunun yerine et-tahiyyatu lillahi deyiniz\" diye buyurmuştur. Hatice anlayışının doğruluğu sebebiyle yaratılmışların selamının alındığı gibi, yüce Allah'a da öylece karşılık verilmeyeceğini kavrayıvermişti. Çünkü \"es-Selam\" Allah'ın isimlerinden birisidir. Aynı zamanda bu, esenlik için bir dua mahiyetindedir. Her iki anlamı ile de Allah'a karşılık verilmesi uygun değildir. Sanki şöyle cevap vermiş gibidir: es-Selam onun adı iken esenlik (selamet) ondan istenir ve ondan husule geliyor iken nasıl \"aleyhisselam\" diyebilirim ki! Bu hadisten anlaşıldığına göre şanı yüce Allah'a ancak övgülerde bulunmak yakışır. Bundan dolayı o \"es-selam u aleyhi\" diyecek yerde yüce Allah'a senada bulunmuştur. Daha sonra Allah'a yakışan ile başkasına yakışan ifadeleri birbirinden ayırt etmiş ve farklı tabirler kullanarak: \"Cibril'e de selam olsun\" dedikten sonra \"sana da selam olsun\" demiştir. Bundan anlaşıldığına göre selam gönderenin de, selam getirenin de selamı alınarak karşılık verilir. 3821- \"Hatice'nin izin istemesini hatırlad!.\" Hale'nin sesinin kızkardeşinin sesine benzemesi dolayısıyla izin isteyişinin niteliklerini hatırladı, bu yolla da Hatice'yi hatırlamış oldu. Hadisten anlaşıldığına göre bir şeyi seven bir kimse onun sevdiklerini de, ona benzeyenleri de, onunla ilgili olanları da sever. \"Ağzının etrafı kırmızı\" ilk anda hatıra gelen ağzın iç tarafıdır. O bu sözleri ile dişlerinin dökülmüş olduğunu ve ağzının içinde diş eti ve diğer kırmızı etlerin dışında bir şey kalmamış olduğunu kinayeli olarak anlatmış olmaktadır. Nevevı ve başkaları bunu ifade etmişlerdir. \"Allah sana onun yerine ondan hayırlısını vermiş bulunuyor.\" Vakıa şu ki, Nebi Sallallahu Aleyhi ve Sellem onun bu sözlerine karşılık vermiştir. Ebu Nedh'in Aişe'den yoluyla gelen, Ahmed ve Taberani'de yer alan bu olayı anlatan rivayette şöyle denilmektedir: \"Aişe dedi ki: Ben, Allah sana yaşlı birisinin yerine yaşı küçük birisini vermiş bulunuyor dedim. O buna kızınca ben de seni hak ile gönderene yemin ederim ki bundan sonra ondan ancak hayır ile sözedeceğim, dedim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 46
			}
		}
	]
}