{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3823,
			"arabicnumber": 3823,
			"text": "Cerir b. Abdullah r.a. dedi ki: \"İslam'a girdiğimden beri Resulullah Sallallahu Aleyhi ve Sellem benden saklanmadı ve beni ne zaman gördüyse mutlaka güldü.\" [-3823-] Cerir b. Abdullah dedi ki: \"Cahiliye döneminde Zulhalasa diye anılan bir ev vardı. Ona el-Ka'betu'Piemamiyye yahut el-Ka'betu'ş-Şamiyye denilirdi. Resulullah Sallallahu Aleyhi ve Sellem bana: Zulhalasa'dan yana beni rahata kavuşturur musun, dedi. (Cerir) dedi ki: Ben de Ahneslilerden yüz elli atlı ile onun üzerine gittim. (Dedi ki): Onu kırdık, yanında kimi bulduysak öldürdük. Daha sonra Nebiin yanına geldik. Ona olanı haber verdik. O da hem bize, hem de Ahnes'e dua etti.\" Fethu'l-Bari Açıklaması: \"Cerir b. Abdullah\" b. Cabir b. Malik \"el-Becel!\" Enmar b. Eraş oğullarındandır. Bunlar anneleri Becile'ye nispet edilmişlerdir. Meşhur olan künyesi Ebu Amr'dır. Müslüman oluşu (tarihinde) görüş ayrılığı vardır. Sahih olan onun Elçiler yılı (senetu'l-vüfUd) diye bilinen 9 h. yılında Müslüman olduğudur. Cerir 50 yılında vefat etmiştir. Daha sonra vefat ettiği de söylenmiştir. \"Resulullah Sallallahu Aleyhi ve Sellem benden saklanmadı.\" Yani eğer evinde bulunuyor ise ve ben yanına girmek için izin istedim ise yanına girmeme engel olmadı. \"Ve beni ne zaman gördüyse hep güldü.\" el-Humeydi'nin İsmail'den rivayetinde: \"Mutlaka yüzüme gülümserdi\" şeklindedir. Ahmed ve İbn Hibban'ın ise el-Muğire b. Şubeyl'den, onun Cerir'den rivayetine göre Cerir şöyle demiştir: \"Medine'ye yaklaşınca devemi çöktürdüm. Sonra hullemi giyinip (Medine'ye) girdim. İnsanlar bana bakıp duruyordu. Ben, Resulullah sallallahu aleyhi ve selle m beni sözkonusu etti mi, diye sordum. Evet, senden en güzel şekilde bahsetti ve şunları söyledi dediler: Yanınıza yüzünde melek siması bulunan şu Yemenlilerin en hayırlılarından birisi girecektir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 48
			}
		}
	]
}