{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3825,
			"arabicnumber": 3825,
			"text": "Aişe r.anha dedi ki: \"Utbe'nin kızı Hind gelerek, ey Allah'ın Resulü dedi. Yeryüzünde bulunan bütün hane halkları arasında senin hane halkından daha çok zelil olmalarını istediğim hiçbir hane halkı yoktu. Şimdi ise artık bugün yeryüzündeki bütün hane halkları arasında senin hane halkından daha çok aziz olmalarını istediğim kimse yoktur. (Allah Reso.ıü): Nefsim elinde olana yemin ederim ki yine de, diye buyurdu. Hind dedi ki: Ey Allah'ın Resulü, Ebu Süfyan çok eli sıkı birisidir. Ona ait olan maldan çoluk çocuğumuza bir şeyler yedirmemde benim için bir sakınca olur mu? Allah Resulü: Ma’ruf ile olmak şartıyla olmayacağı kanaatindeyim.\" Fethu'l-Bari Açıklaması: \"Hind bint Utbe\" Hind'in babası, Utbe b. Rabia b. Abdi ŞemsIdir. Hind, Muaviye'nin annesidir. İleride Meğazi bölümünde geleceği üzere babası Bedir'de öldürülmüştür. Kocası Ebu Süfyan ile birlikte Uhud'a katılmıştır. Nebi Sallallahu Aleyhi ve Sellem'in amcası Hamza'nın öldürülmesini teşvik etmiştir. Çünkü Hamza, Hind'in amcası Şeybe'yi öldürmüş, babası Utbe'nin öldürülmesine de iştirak etmişti. Hamza'yı ileride Vahşi ile ilgili hadiste açıklanacağı üzere Vahşi b. Harb öldürmüştür. Daha sonra Hind, Mekke'nin fethedildiği günü Müslüman olmuştur. Kadınların akıllılarından idi. Ebu Süfyan'dan önce Mahzumoğullarından el-Fakih b. el-Muğire ile evli idi. Sonra meydana gelen bir olay dolayısıyla onu boşamıştı. Ebu Süfyan'ın onunla evlendikten sonra ondan çocukları oldu. Kadınlar ile bey'at1eştiğinde hırsızlık yapmayacaklarını, zina etmeyeceklerini şart koştuğunda Nebie: \"Hür kadın hiç zina eder mi?\" diyen odur. Hind, Ömer radıyalIahu anh'ın halifeliği döneminde vefat etmiştir. \"Hiba (tercümede ev)\" kıldan yahut yünden yapılmış çadır demek olmakla birlikte, daha sonraları nasılolursa olsun ev için kullanılır olmuştur. \"Nefsim elinde olana yemin ederim ki, yine de ... buyurdu.\" İbnu't-Tın der ki: Bu sözler ile Hind'in zikrettiklerini tasdik etmektedir. Sanki İbnu't-Tın'in görüşüne göre anlam şudur: Aynı şekilde ben de sana karşı bu durumdayım. Ancak iki taraflı nefret ve sevgi cihetiyle onun bu şekildeki anlayışına karşı çıkılmıştır. Çünkü müşrikler arasında Hind'den de, onun aile halkından da Nebi salIalIahu aleyhi ve selIem'e daha çok eziyet edenler vardı. Hind Müslüman olduktan sonra da Müslümanlar arasında Nebi salIalIahu aleyhi ve selIem'in ondan da, aile halkından da daha çok sevdiği kimseler vardı. Dolayısıyla bu haberin zahirine göre açıklanmasına imkan yoktur. Başkası ise şöyle demektedir: Nebi efendimizin \"yine de\" diye buyurmasının anlamı şudur: İman senin kalbinde daha çok yer ettikçe, senin sevgin . daha da artacaktır ve sözü geçen nefretinden hiçbir izi kalmayıncaya kadar tamamıyla vazgeçeceksin. \"Şüphesiz Ebu Süfyan eli sıkı birisidir.\" İleride buna dair açıklamalar Nafakalar bölümünde (5364 nolu hadiste) inşallah gelecektir. Hadisten Çıkarılan Sonuçlar 1-Hadiste Hind'in oldukça akıllı olduğuna, konuşmada güzel bir üslup kullandığına da delalet vardır. 2-Hadisten anlaşıldığına göre ihtiyaç sahibi olan bir kimsenin özelolarak konuşmaya başlamadan, eğer kendisi ile konuştuğu kimsenin kalbinde ona karşı menfi bir duygu bulunuyor ise, önce mazeretini beyan etmesinin müstehap olduğuna, özür beyan edenin özür beyan ettiği kimse tarafından doğrulanmasını daha bir sağlamak amacıyla önden bir takım şeyler söylemesinin de müstehap olduğuna delil vardır. Çünkü Hind önce daha önceki kin ve nefretini itiraf etti. Böylelikle ileri sürdüğü sevgi iddiasında doğru söylediğinin bilinmesini istedi. 3-Hind, Nebi Sallallahu Aleyhi ve Sellem'in hanımlarının anneleri konumunda idi. Çünkü onun eşlerinden birisi olan Ümmü Habibe kocası Ebu Süfyan'ın kızıdır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 50
			}
		}
	]
}