{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3844,
			"arabicnumber": 3844,
			"text": "Ğaylan b. Cerir'den rivayete göre \"Biz Enes b. Malik'in yanına gider, o da bize Ensara dair hadisler anlatırdı. Bana, senin kavmin de filan filan günü şunu şunu yaptı. Senin kavminde şu şu günü şunları şunları yaptı, derdi.\" Fethu'l-Bari Açıklaması: \"Cahiliye günleri\" yani Nebi saIlaIlahu aleyhi ve seIlem'in doğumu ile bi'seti (Nebi olarak gönderilmesi) arasında meydana gelen olaylar. Burada maksat budur. Çoğunlukla Nebiliğin verilmesinden önceki dönem hakkında kullanılır. Yüce Allah'ın, \"Allah'a karşı cahiliye zannı gibi hakkın dışında bir zan besliyorlardı.\" [Al-i İmran,1S4] buyruğu ile, \"İlk cahiliyenin ki gibi açılıp saçılarak salınıp yürümeyin.\" [Ahzab,33] buyrukları bu kabildendir. Bu başlıktaki hadislerin çoğu da böyledir. 3834- \"Bu\" yani konuşmayı terk etmek \"helal değildir.\" el-İsmail1'nin de bir başka yoldan Ebu Bekir es-Sıddık'tan diye nakledilen rivayete göre kadın ona şöyle demiştir: \"Cahiliye döneminde bizlerle senin kavmin arasında bir şer çıkmıştı. Bu sebeple Allah bizi bundan esenliğe çıkartacak olursa hac yapana kadar hiçbir kimseylekonuşmamaya dair yemin etmiştim. Bunun üzerine Ebu Bekir, şüphesiz İslam böyle bir şeyi yıkar, diye cevap verdi.\" Ebu Bekir radıyaIlahu anh'ın bu sözü, konuşmamak üzere yemin etmiş olan bir kimsenin konuşmasının müstehap olduğuna ve bundan dolayı keffaret yükümlülüğünün de bulunmadığına delil gösterilmiştir. Çünkü Ebu Bekir o kadına keffarette bulunmasını söylememiştir. Bunun kıyas edildiği bir mesele de şudur: Bir kimse konuşmamayı adayacak olursa onun bu adağı adak olmaz. Çünkü Ebu Bekir böyle bir işin helal olmayacağını, böyle bir şeyin cahiliye işlerinden olduğunu, İslamın bunu yıktığını açıkça ifade etmiş bulunmaktadır. Ebu Bekir de böyle bir şeyi ancak bir tevkife (Nebiden aldığı bir habere) bağlı olarak söyler. Dolayısıyla onun bu sözleri merfu' (hadis) hükmündedir. \"Bu salih iş üzere ne kadar kalacağız?\" Kastettiği, İslam dini ile onun kapsadığı adalet, söz birliği, mazluma yardım ve her bir şeyin yerli yerince konulması halidir. \"Sizin imamlarınız (önderleriniz, yöneticileriniz)\" Çünkü insanlar kendilerini yönetenlerin dinleri üzeredirler. Bu sebeple kim gerçek imamların gösterdiği yolun dışına çıkarsa kendisi de sapıtmış olur, başkasını da saptırmış olur. 3835- \"Onun bir hifşi vardı.\" Hifş küçük ve dar ev demektir. Bu olaya dair açıklamalar daha önce Namaz bahsinde Mescidler ile ilgili başlıklarda açıklanmış bulunmaktadır.(439 numaralı hadiste) Bu olaya dair hadisin bu başlıkta yer alması, da cahiliye döneminin hem tiill uygulamalarında, hem de sözlerinde ne kadar kaba ve katı olduklarını ifade etmesi cihetiyledir. 3837- \"Cahiliye dönemi insanları cenaze dolayısıyla ayağa kalkarlard!.\" Bu hadisin zahirinden anlaşıldığına göre Aişe radıyallahu an ha 'ya şariin (Nebi efendimizin) cenaze için ayağa kalkılması emri ulaşmamıştır. Bu sebeple o bu işin cahiliye döneminde yapılan işlerden olduğu ve İslamın da onlara muhalefet ilkesini getirdiği kanaatinde olmuş bulunmaktadır. Cenazeler bölümünde (1310 nolu hadiste) bu mesele ile ilgili ve bu hükmün nesh olup olmadığına dair görüş ayrılıklarını ortaya koyan açıklamalar geçmiş bulunmaktadır. Bunun nesh olduğu kabul edildiği takdirde acaba bu vücubun neshi midir ve geriye müstehap olarak kalmış mıdır, kalmamış mıdır yoksa mutlak olarak cevaz mı neshedilmiştir? Şafiı alimlerinden bazıları sonuncusunu tercih etmiş ve Şafi\\1erin çoğunluğu bunun mekruh olduğu kanaatini benimsemiştir. el-Mehamili ise bu konuda ittifak olduğunu dahi iddia etmiştir. Fakat el-Mütevelli muhalefet ederek müstehaptır demiş, Nevevı de bunu tercih ederek şunları söylemiştir: Bu Aişe'nin ashab-ı kiram ile ilgili onlardan farklı olarak dile getirdiği hükümler arasındadır. Fakat bu hususta ashab-ı kiram'ın görüşü daha bir tercihe şayandır. 3841-'''Şairin söylediği en doğru söz\" ile kast edilen şairin \"Allah'ın dışındaki. .. \" ifcidesidir. Yani onun zati sıfatlarının rahmeti, azabı ve benzeri fiili sıfatların dışındaki her şey batıldır. Bundan dolayı (Allah Resulü) cenneti ve cehennemi sözkonusu etmiştir. Yahut da beyitte \"batıl oluş\"tan kasıt yok oluştur, fani oluştur. Bozukluk ve fesad değildir. Çünkü Allah'ın dışındaki her bir varlığın zatı dolayısıyla fani olduğu aşikardır. Hatta cennet ve cehennem için bile bu sözkonusudur. Fakat onlar yüce Allah'ın onları baki kılması ile ve cennet ile cehennem ehli hakkında devamlılığı yaratması suretiyle baki kalırlar. \"el-Hak\" hakikat anlamı ile hakkında zevalin caiz olmadığı, düşünülemediği şeydir. Nebi efendimizin, \"Sen el-haksın, sözün el-haktır, vaadin el-haktır\" derken başlarına elif lam getirip, bunların dışındakileri sözkonusu ederken elif, lam'ı getirmeyişindeki sır da muhtemelen budur. Doğrusunu en iyi bilen Allah'tır. 3842- \"Ona haraç verirdi.\" Yani kazandıklarını getirip, teslim ederdi. Haraç efendinin kölesinin kazancından getirip teslim etmek üzere tespit ettiği miktara denilir. \"Bana onun karşılığında bunu verdi.\" Yani benim onun için kahinlik yapmam karşılığında bunu verdi. İbnu't-Tın der ki: Ebu Bekir'in kendisini kusturması böyle bir şeyden büsbütün sakınmak, korunmak içindir. Çünkü cahiliye döneminde yapılanların vebali kaldırılmıştır. Eğer böyle bir iş İslam geldikten sonra olmuş olsaydı yediğinin mislini ya da kıymetini tazminat olarak vermesi gerekirdi. Sa'dece kusması da yetmezdi. İbnu't-Tın şöyle demiştir: Fakat görüldüğü kadarıyla Ebu Bekir r.a.'ın kendisini kusturmasının sebebi, kahinin kehaneti karşılığında aldığı ücretin yenilmesini yasaklayan hükmü sabit görmüş olmasındandır. Kahin ise şer'i bir delile dayanmaksızın yakında meydana gelecek şeyleri haber veren kimsedir. Bu cahiliye döneminde, özellikle de Nebi sallallahu aleyhi ve sellem'in Nebiliğinden önce oldukça çoğalmıştı. 3843- (Numaralı hadis) İbn Ömer'in gebe kalmış dişi devenin gebeliği ile ilgili hadisi rivayet ettiği olup buna dair yeterli açıklamalar daha önce Alışverişler (Buyur) bölümünde geçmiş bulunmaktadır.(2143 numaralı hadis) Burada zikredilmesinden maksat ise onların cahiliye döneminde bu şekilde alışveriş yapıyor olmaları idi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 69
			}
		}
	]
}