{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "İbn Abbas r.a. dedi ki: \"Şüphesiz cahiliye dönemindeki ilk kasame şüphesiz bizim aramızda, yani Haşim oğulları arasında görülmüştür. Haşim oğullarından bir adamı, Kureyş'in bir başka boyundan, bir başkası ücretle tutmuştu. Onunla birlikte develeriyle beraber yola koyuldu. Ücretli tuttuğu o işçinin yanından, heybelerinin bağları kopmuş Haşimoğullarından bir başka adam geçti. Heybelerini bağlayabileceğim bir ip getirerek yardıma koş ki develer ürküp kaçmasın, dedi. Ona bir ip verdi, o da heybelerini onunla bağladı. Bir yere inip konakladıklarında bir deve dışında bütyn develer kazığa bağlandı. Onu ücretle tutan kişi, bütün develer arasında şu kazığa bağlanmayan devenin durumu neden böyle, diye sordu. İşçi, onun yuları yok, dedi. Adam, yuları nerde diye sorunca, işçi, onu attı, diye cevap verdi. O (ücretle onu tutan kişi) da ecelinin gelmesine sebep teşkil eden bir sopa ile ona vurdu. Yemenlilerden bir adam yanından geçti. Hac mevsiminde bulunacak mısın, diye sordu. Yemenli, her zaman bulunmam ama bulunduğum da olur, dedi. Adam, peki herhangi bir zamanda benden bir mesaj ulaştırabilir misin, diye sordu. Yemenli, olur dedi. (İbn Abbas) dedi ki: Sen hac mevsiminde bulunduğun takdirde, ey KureyşIiler diye seslen. Sana cevap verdikleri vakit sen de, Ey Haşim oğulları hanedanı diye seslen. Sana karşılık verirlerse, Ebu Talib'i sor ve ona şunu haber ver: Filan kişi beni bir deve yuları dolayısıyla öldürdü. Daha sonra ücretle kiralanan kişi öldü. Onu ücretle tutan kişi (Mekke'ye) gelince Ebu Talib onun yanına giderek, bizim arkadaşımız ne yaptı, diye sordu. O kişi, Sizin adamınız hastalandı, ben de ona güzel bir şekilde baktım. Sonra da kendim onu defnettim, dedi. (Ebu Talib): Sana da böyle yapmak yakışırdı, dedi. Bir süre böylece geçti. Daha sonra kendisine bu vasiyeti kendi adına bildirmesini söylediği kişi hacca geldi. Ey Kureyşliler, diye seslendi. Kureyşliler bizleriz, dediler. Ey Haşim oğulları dedi. Haşim oğulları bizleriz, dediler. Ebu Talib nerede diye sordu. İşte bu Ebu Talib'tir, dediler. Ona dedi ki: Filan kişi bana sana şu haberi bildirmemi emretti, Filan kişi onu bir deve yuları dolayısıyla öldürdü. Ebu Talib o adamın yanına giderek ona, bizden şu üç şeyden birisini seçerek kabul et, dedi. Dilersen yüz deve ödersin. Çünkü bizim arkadaşımızı öldürdün. Dilersen senin kavminden elli kişi onu öldürmediğine dair yemin etsinler. Eğer bunları kabul etmeyecek olursan biz de adamımıza karşılık olarak seni öldürürüz. O kişi kavminin yanına gitti, kavmi yemin ederiz dediler. Onun (Ebu Talib'in) yanına o kavimden bir adamın nikahı altında olup, ondan da çocuğu doğmuş bulunan Haşim oğullarından bir kadın gelerek, ey Ebu Talib dedi. Benim bu oğlumu yemin etmesini istediğin elli adamın dışında tutmanı ve kat'i olarak yemin edilen yerde onu yemin etmekle yükümlü tutmamanı diliyorum. Ebu TaIib onun istediğini yaptı. Onlardan bir adam gelerek: Ey Ebu Talib, yüz deveye karşılık elli adamın yemin etmesini istedin. Buna göre her bir adama iki deve isabet eder. İşte sana iki deve. Benden bunları kabul et ve kesin olarak yeminlerin yapıldığı yerde yemin etmekten beni muaf tut, dedi. Ebu Talib bu iki deveyi de kabul etti. Diğer kırk sekiz kişi gelip yemin ettiler.\" İbn Abbas dedi ki: \"Nefsim elinde olan (Allah)'a yemin ederim ki bir sene bu olayın üzerinden geçmeden o kırk sekiz kişiden gözünü kırpan tek kişi kalmamıştı",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 70
			}
		}
	]
}