{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3850,
			"arabicnumber": 3850,
			"text": "İbn Abbas r.a. dedi ki: \"Bazı•hasletler vardır ki, cahiliye dönemi hasletlerindendir: Neseblere dil uzatmak, ölüler için ağıt yakmak. (Senetteki ravilerden Ubeydullah) üçüncüsünü unuttu. (Yine senetteki ravilerden) Süfyan dedi ki: Derler ki, o, yıldızların konakları vasıtası ile yağmur dilemektir.\" Fethu'l-Bari Açıklaması: 3845- \"İlk kasame\" ilk yemin demektir. Şer'i bir terim olarak, Öldürme itharnı esnasında o itharnı kabul veya nefyetmek amacıyla muayyen bir şekilde yemin etmektir. Bunun yemin edenlere yeminlerin taksim edilmesinden alınmış bir lafız olduğu da söylenmiştir. İleride diyetler bölümünde (6899 numaralı hadiste) yüce Allah'ın izniyle hükmü ile ilgili görüş ayrılığı açıklanacaktır. \"Haşim oğullarından bir adam.\" Bu, Amr b. A1kame b. el-Muttalib b. Abdi Menartır. Sanki İbn Abbas bu rivayeti Haşim oğulları ile Muttalib oğulları arasındaki sevgi, kardeşlik ve yardımlaşma dolayısıyla mecazi olarak Haşim oğullarına nispet etmiş gibidir. \"Yanından\" işçi tutulanın yanından\"geçti.\" \"Heybelerinin bağı\" heybe deriden ve' elbiseden yapılmış olan kaba denilir. Bağ denilen şey de iptir. \"Ecelinin gelmesine sebep olan\" yani onun ölümü neticesini veren, \"öldü\" ifadesi daha sonraki ifadelerin deliliyle ölüm kertesine geldi, demektir. \"Son nefeslerini vermeden önce Yemen halkından bit adam onun yanından geçti.\" * * * \"Öldü\" ifadesi ve ondan sonraki \"Son nefeslerini vermeden önce\" ifadesi Buhari'nin nüshalannda bulunmamaktadır. (Fethu'l-Bari baskısındaki dipnottan, VII, 193) * * * \"Mevsimde\" yani hac mevsiminde \"bulunacak mısın?\" \"Bir yular dolayısıyla beni öldürdü.\" Bir yuları bahane ederek beni öldürdü. \"Onun yanına Haşim oğullarından bir kadıngeldi.\" Bu kadın da öldürülenin kızkardeşi Alkame'nin kızı Zeyneb'tir. \"Yeminlerin kesin olarak yapıldığı yer\" olan Rükün ile Makam arasıdır. \"Nefsim elinde olana yemin ederim.\" İbnu't-Tın der ki: Görüldüğü kadarıyla bu olayı İbn Abbas'a doğru söylediklerinden kesin olarak emin olduğu bir topluluk haber vermiştir. Bu sebeple buna dair yemin edebiimiştir. Derim ki: Şunu demek istiyor, bu Kasame (yemin) sırasında henüz doğmamıştı. Ona bunu haber verenin Nebi Sallallahu Aleyhi ve Sellem olma ihtimali de vardır. Bu hadisin Sahih-i Buhari'nin kapsamına girmesi bakımından bu daha mümkün görünmektedir. \"Sene geçmeden\" yani yemin ettikleri günden itibaren bir sene bitmeden. 3846- \"Buas günü.\" Buna dair açıklamalar Ensarın Menkıbeleri başlığının girişinde (2777 nolu Hadis'te) ve tercih edilen görüşe göre nübuvvetin verilişinden önce olduğuna dair açıklamalar geçmiş bulunmaktadır. 3848- \"Ey insanlar, size söyleyeceklerim e kulak veriniz ve siz de sözünüzü bana işittiriniz.\" Yani sizin söylediğimi bellediğinizi bileyim diye sözümü bana tekrar ediniz. Sanki maksadını anlayamayıp, ondan söylediğinden farklı bir şey haber vereceklerinden çekinmiş gibidir. Bu sebeple şöyle demiş gibidir: Benden sağlam ve iyi bir şekilde bellemek üzere sözümü dinleyiniz ve it ıice bellemeden İbn Abbas dedi, demeye kalkışmayınız. 3849- \"Cahiliye döneminde ... maymunlar gördüm.\" el-İsmail! bu kıssayı bir başka yoldan İsa b. Hittan yoluyla Amr b. Meymun'dan nispeten daha uzun bir şekilde zikretmiş bulunmaktadır. Amr b. Meymun dedi ki: \"Yemen'de yakınlarıma ait koyunlar ile birlikte idim. Yüksekçe bir tepede bulunuyordum. Bir maymun bir başka maymun ile birlikte geldi. Onun eli üzerine yattı. Ondan daha küçük bir maymun geldi, o dişi maymuna işaret etti. Dişi maymun elini ilk maymunun altından yavaşça çekti ve onun arkasından gitti. Gözümün önünde onunla ilişki kurdu. Daha sonra geri döndü, yavaşça elini birinci maymunun yanağı altına sokmaya başlayınca dehşetle uyanıverdi. Onu koklayınca bağırdı. Diğer maymu nlar gelip toplandı. Yine bağırmaya devam ederek eliyle o dişi maymunu işaret etmeye başladı. Maymunlar sağa sola gidip geldi. O benim tanıdığım maymunu getirdiler. Her ikisine bir çukur kazdılar ve iki maymunu da recm ettiler. Andolsun ben Adem oğullarından olmayanlar arasında recmi görmüş oldum.\" İbnu't-Tin der ki: Belki de bunlar daha önce mesh olmuşların soyundan gelmiş ve bu hüküm de aralarında devam etmiş olabilir. Daha sonra da: Mesh olanların nesli devam etmez, demektedir. Derim ki: Mutemet olan görüş budur. Çünkü Müslim'in Sahih'inde sabit olduğuna göre: \"Mesh olanların nesli yoktur.\" Yine Müslim'de İbn Mes'ud tarafından merfu olarak rivayet edilmiş hadiste şöyle denilmektedir: \"Allah, helak etmiş olduğu hiçbir kavmin nesiini devam ettirmemiştir.\" 3850- \"Cahiliye dönemi hasletlerinden: Neseplere dil uzatmak\" yani bazı kimselerin diğer bazılarının nesebine bilgisizce dil uzatmaları. Ölülere \"ağıt yakmak.\" \"Derler ki: O yıldızların konaklamaları vasıtasıyla yağmur dilemektir.\" Yani onlar bu yıldızın doğuşu sebebiyle bize yağmur yağdırıldı, derler. İstiska bölümünde buna dair açıklamalar geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 75
			}
		}
	]
}