{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3856,
			"arabicnumber": 3856,
			"text": "Urve b. Zubeyr'den dedi ki: Ben (Abdullah) b. Amr b. el-As'a sordum: Bana müşriklerin Nebi Sallallahu Aleyhi ve Sellem'e yaptıkları en ağır işkencenin ne olduğunu haber ver, dedim. Dedi ki: Nebi Sallallahu Aleyhi ve Sellem Ka'be'nin Hicr'inde namaz kılmakta iken Ukbe b. Ebi Muayt geldi ve elbisesini onun boynuna dolayıp, boğazını alabildiğine sıkt!. Ebu Bekir gelip, onu omzundan tutarak Nebi Sallallahu Aleyhi ve Sellem'in üzerinden geri itti ve: Sizler bir adamı Rabbim Allah'tır diye öldürür müsünüz?\" [Mu'min, 28] dedi. Fethu'l-Bari Açıklaması: \"Yüzü\" uykunun etkisinden dolayı \"kızarmış olduğu halde oturdu.\" Kızgınlığından ötürü kızarmış olma ihtimali de v.ardır. İbnu't-TIn bunu kesin olarak ifade etmiştir. \"Testere ... konulurdu.\" İbnu't-TIn der ki: Kendilerine bu işkencenin yapıldığı kimseler enbiya ya da onlara tabi olan kimseler idi. Ashab-ı kiram arasında da kendisine bu işkence yapıldığı takdirde sabredecek kimseler vardı. Daha sonra şunları söyler: Ashab-ı kiram'dan olsun, onların peşinden gidenler arasından ve onlardan sonra gelenlerden olsun Allah yolunda eziyet görüp de ruhsat olanı yapacak olsalar da kendileri için uygun bir iş olacak kimseler hala var olagelmiştir. \"Andalsun Allah bu işi tamamlayacaktır.\" İş (emr)den kasıt, İslam'dır. 3855 numaralı İbn Abbas'tan gelen katilin tövbesi ile ilgili hadisin açıklaması ileride yüce Allah'ın izniyle en-Nisa suresinin tefsirinde gelecektir. Burada bundan maksat, müşriklerin Müslümanlara yaptıkları öldürme, işkence ve buna benzer işlerin (günahlarının) Müslüman olmaları halinde üzerlerinden kalkmış olacağına işaret etmektir. \"Muhammed b. Amr, Ebu Selerne dedi ki: Bana Amr b. eı-As anlattı.\" Ebu Ya'la ve el-Bezzar sahih bir senedie Enes'in şöyle dediğini rivayet etmektedirler: \"Bir keresinde Resulullah sallallahu aleyhi ve sellem'i baygın düşünceye kadar dövdüler. Ebu Bekir ayağa kalkarak şöyle seslendi: Veyl olsun sizlere! Siz Rabbim Allah'tır dedi diye birisini öldürecek misiniz? Bunun üzerine onu bırakarak Ebu Bekir'in üzerine yürüdüler.\" Bu, sahabe mürsellerinden bir rivayettir. Bunu Ebu Ya'la hasen bir senedie uzunca, Ebu Bekir'in kızı Esma yoluyla gelen bir hadis olarak rivayet etmektedir: \"Ona: Müşriklerin Resulullah sallallahu aleyhi ve sellem'e yaptıklarını gördüğün en aşırı ve ağır işkence nedir?\" diye sordular. Bundan sonra da az önce kaydettiğimiz İbn İshak'ın anlattığına yakın olarak hadisi zikretmektedir. Bu rivayette şu ifadeler de vardır: \"Haberi Ebu Bekir'e ulaştıran kişi gelip dedi ki: Arkadaşını yetiş! (Esrna) dedi ki: Ebu Bekir yanımızdan -ki dört küçük örüğü de vardı-: Veyl size! Rabbim Allah'tır dedi diye bir adamı öldürür müsünüz diyerek çıktı. Nebii bırakıp, Ebu Bekir'in üzerine yürüdüler. Ebu Bekir yanımıza geri döndüğünde elini örüklerinden hangisine dokundurduysa (saçları) elinde kalıyordu.\" Ebu Bekir'in başından geçen bu olayın Ali yoluyla gelen bir şahidi de vardır. Bunu el-Bezzar, Muhammed b. Ali yoluyla rivayet etmiştir. O da babasından naklettiğine göre Ali irad ettiği hutbesinde dedi ki: \"İnsanların en kahramanı kimdir? Sensin dediler. O dedi ki: Evet, kim benimle teke tek çarpıştıysa mutlaka ben ondan intikamımı almışımdır, fakat en kahraman kişi Ebu Bekir'dir. Andolsun ResuluIlah Sallallahu Aleyhi ve Sellem'i Kureyş'in yakalamış olduğunu gördüm. Birisi onu tekmeliyor, diğeri ona karşı dikiliyor ve ona: Sen bunca ilahı tek bir ilah kabul ediyorsun öyle mi, diyorlardı. Allah'a yemin ederim aramızdan Ebu Bekir dışında kimse (oraya) yaklaşamadı. Kimisine vuruyor, kimisini itiyor ve şöyle diyordu: Veyl olsun size! Rabbim Allah'tır dedi diye bir adamı öldürecek misiniz? Daha sonra Ali ağladı, sonra şöyle devam etti: Allah adına size soruyorum. Firavun hanedanından iman eden kişi mi daha faziletlidir yoksa Ebu Bekir mi? Herkes sustu, sonra Ali dedi ki: Allah'a yemin ederim Ebu Bekir'in bir anı dahi ondan daha hayırlıdır. Çünkü o imanını gizleyen bir adamdı, bu (Ebu Bekir) ise imanını açıkça ilan ediyordu",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 81
			}
		}
	]
}