{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3861,
			"arabicnumber": 3861,
			"text": "İbn Abbas r.a., dedi ki: \"Ebu Zer', Nebi Sallallahu Aleyhi ve Sellem'e Nebilik verildiği haberini alınca kardeşine: (Devene) bin de şu vadiye git. Kendisinin bir Nebi olduğunu, semadan kendisine haber geldiğini iddia eden bu adam ile ilgili bana dair bilgi topla ve onun sözünü bizzat işit, sonra yanıma gel, dedi. Kardeşi gitti, onun yanına vardı, onun sözlerini dinledi. Sonra da Ebu Zerr'in yanına dönerek ona dedi ki: Ben onun ahlakın üstün değerlerini enirettiğini, şiir olmayan bir söz söylediğini gördüm. Ebu Zerr, bana istediğim bilgiyi beni rahatlatacak şekilde getiremedin, dedi. Bunun üzerine kendisi azığını hazırladı, içinde su bulunan kırbasını yüklendi. Nihayet Mekke'ye geldi. Mescide gitti. Nebi Sallallahu Aleyhi ve Sellem'i aradı ama onu tanımıyordu. Ona dair kimseye bir şey sormaktan da hoşlanmadı. Sonunda gece oldu. Ali onu görünce bir yabancı olduğunu anladı. (Ebu Zerr) onu görünce onun (Ali'nin) arkasından gitti. Onlardan biri arkadaşına sabah oluncaya kadar . hiçbir şey sormadı. Daha sonra kırbasını ve azığını taşıyarak mescide gitti. O gün geçip gitti ve akşam oluncaya kadar Nebi onu görmedi. Nihayet akşam olunca yatacağı yere geri döndü. Yine Ali yanından geçerek, bu adamın kalacağı yeri bilme zamanı gelmedi mi, dedi. Sonra onu kaldırdı ve onunla birlikte gitti, ama biri arkadaşına bir şey sormuyordu. Nihayet üçüncü gün oldu, Ali tekrar aynı şeyi yaptı. Yine onunla birlikte kalktı, gitti. Sonra, bana senin buraya neden geldiğini anlatmayacak mısın, dedi. Ebu Zerr, eğer bana mutlaka doğruyu göstereceğine dair bir söz ve bir ant verecek olursan anlatırım, dedi. O da istediğini verdi. Ebu Zerr de ona durumu bildirdi. (Ali) dedi ki: O haktır, o Resuluilah Sallallahu Aleyhi ve Sellem'dir. Sabahı edince benim arkamdan gel. Ben senin için korkulacak bir şey görürsem su döker gibi duracağım. Yoluma devam ettiğim takdirde benim gireceğim yere sen de girene kadar arkamdan gel. O da bunu yaptı. Arkasından onu takip etmeye koyuldu. Nihayet (Ali) Nebi Sallallahu Aleyhi ve Sellem'in huzuruna girdi. O da onunla birlikte girdi, bazı sözlerini dinledi ve hemen o yerde Müslüman oldu. Nebi Sallallahu Aleyhi ve Sellem ona dedi ki: Sen kavminin yanına geri dön ve onlara bildir. Benim emrim (durumum) sana gelinceye kadar (öylece kal.) (Ebu Zer') dedi ki: Nefsim elinde olana yemin ederim ki onların (Kureyş'in) arasında bunu yüksek sesle bağırıp söyleyeceğim. Dışarı çıktı ve mescide gitti. En yüksek sesiyle bağırdı: Şahadet ederim ki Allah'tan başka hiçbir ilah yoktur ve şüphesiz Muhammed Allah'ın Resulüdür. Hemen akabinde orada bulunanlar ayağa kalkıp canını acıtacak şekilde onu dövdüler. Abbas geldi, üzerine abanarak: Yazık size! Siz bunun Gıfar kabilesinden olduğunu bilmiyor musunuz? Sizin Şam'a giden ticaret yolunuzun üzerinde olduklarını bilmiyor musunuz, diyerek onu ellerinden kurtardı. Ertesi gün aynı şeyi yaptı, yine onu dövdüler, üzerine yürüdüler. el-Abbas da üzerine abandı (onu korudu).\" Fethu'l-Bari Açıklaması: \"Ebu Zerr el-Gıfari\" Cundub b. Cunade b. Süfyan b. Ubeyde b. Haram b. Gıfar (el-Gıfari) \"nin Müslüman olması\" Gıfar Kinane oğullarındandır. \"Ona dair soru sormaktan hoşlanmadı.\" Çünkü Nebiin kavminin onun yanına gitmek isteyenlere işkence ettiklerini yahut bizzat yanına gelmek isteyenler dolayısıyla Nebie işkence ettiklerini ya da onun işinin açığa çıkmasından hoşlanmadıkları için hakkında soru soranlara yol göstermediklerini veya onunla bir araya gelmeyi engellediklerini ya da onu bırakıp geri dönsün diye o soranı aldatmak istediklerini anlamıştı. \"Ali b. Ebi Talib onu gördü.\" Bu, Ebu Zerr'in başından geçen bu olayın Nebi sallallahu aleyhi ve sellem'e Nebiliğin verilmesinden iki seneden daha fazla bir süre geçtikten sonra cereyan etmiş olduğunu göstermektedir. Öyle ki Ali bu zaman zarfında tek başına yabancılarla konuşabilecek ve onları misafir olarak ağarlayabilecek bir konuma gelmişti. Çünkü sahih kabul edilen görüşe göre nubuwet verildiği sırada Ali 10 yaşında idi. Bundan daha küçük olduğu da söylenmiştir. Bu haber ise yaşı ile ilgili sahih kabul edilen görüşü daha da pekiştirmektedir. \"Kavminin yanına geri dön, onlara haber ver. Benim emrim sana gelinceye kadar...\" Ebu Kuteybe'nin rivayetinde şöyle denilmektedir: \"Bu durumu gizle ve kavminin yanına geri dönerek onlara haber ver. Bizim üstün geldiğimize (ya da durumumuzun açığa çıktığına) dair haber sana ulaşınca sen de geL\" Abdullah b. es-Samit'in rivayetinde şöyle denilmektedir: \"Benim önümde hurmalıkları olan bir yer bana gösterildi. Sen benden kavmine tebliği götürebilir misin? Belki Allah senin vasıtanla onlara fayda verir.\" Bundan sonra da kardeşi Uneys'in annesinin İslam'a giriş olayını zikretti, onların kavimleri Gıfar'a gittiklerini ve onların yarısının Müslüman olduklarını zikrettiği hadisi aktardı. \"Andalsun bunu yüksek sesle\" yani tevhid kelimesini bağırarak \"söyleyeceğim.\" Maksat onun yüksek sesle bunu müşrikler arasında açıkça söyleyeceğidir. O Nebi sallallahu aleyhi ve sellem'in kendisine gizleme emrini vermesinin vücub ifade etmek üzere değil, kendisine şefkati sebebiyle söylediğini anlamış gibidir. Böylelikle ona kendisinin bu işe gücünün yettiğini anlatmış oldu. Bundan dolayı da Nebi sallallahu aleyhi ve sellem onun bu işi yapmasına itiraz etmemiştir. Bundan hakkı söyleyen kimseye eziyet (ve işkence) yapacağından korkulan kimselerin yanında hakkı söylemenin -susmak caiz olsa bile- caiz olduğu anlaşılmaktadır. Meselenin tahkiki sonucu, bu hususun hükmü durumun ve maksatların farklılığına göre farklı olacağıdır, buna göre ecrin kazanılıp kazanılmayacağıdır. \"Sonra oradakiler kalktl.\" İbn Kuteybe rivayetinde: \"Bu Sabiı (dininden dönen)in üzerine kalkınız (hücum ediniz), dediler.\" \"Onlar da kalktılar.\" Müslüman olan kimseye SaM derlerdi. Çünkü bu kelime bir şeyden bir şeye intikal etmeyi anlatmak üzere kullanılan \"saba, yesbu\" fiilinden gelmektedir. \"Canını acıtacak kadar onu dövdüler.\" Ebu Kuteybe rivayetinde: \"Öleyim diye beni dövdüler.\" Yani beni öyle bir dövdüler ki, dövenler ondan dolayı ölseydim dahi buna aldırmazlardl. \"Bunun üzerine beni bıraktılar\" dövmekten vazgeçtiler. * * * Bu cümle Buhari'deki bu başlıkta bulunmamaktadır. Daha önce 3522 numara ile geçmiş bulunan Ebu Kuteybe rivayetinde yer almaktadır. (Fethu'l-Bari, VII, 214'deki dipnot). * * * \"el-Abbas onun üzerine abandı.\" Ebu Kuteybe yoluyla gelen rivayette: \"Bir önceki gün söylediği sözün aynışını tekrarladı\" şeklindedir. Hadiste el-Abbas'ın güzel tutum sergilediği ne ve onun güzel kavrayışlı olduğuna delil olacak ifadeler bulunmaktadır. Çünkü o, kavminden onları korkutarak Ebu Zerr'i kurtarmak sonucuna ulaşmıştır. Zira onun kavmi ticaret yollarını keserek onları uzaklaştırabilirdi. Mekkelilerin ise geçimleri ticarete bağlı idi. Bundan dolayı hemen onu dövmekten vazgeçtiler. Yine hadiste Ebu Zerr'in erken dönemde Müslüman olduğuna delil bulunmaktadır. Fakat açıkça görüldüğü \\,izere bu, Nebilikten uzun bir süre sonra olmuştur. Zira az önce kaydettiğimiz gibi Ali radıyall€ıhu anh'dan da söz edilmektedir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 86
			}
		}
	]
}