{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "Abdullah b. Ömer dedi ki: \"Ömer'in bir şey için, ben onun böyle olduğunu zannediyorum, dediğini ne kadar işittimse mutlaka o şeyin onun zannettiği gibi olduğunu gördüm. Ömer oturuyorken yanından güzel bir adam geçti. Bunun üzerine Ömer, andolsun bunun hakkındaki zannım doğru çıkmadı, yahut bu cahiliye dönemindeki dini üzere devam etmektedir ya da cahiliye döneminde onların kahini idi, o adamı yanıma getirin, dedi. Adam yanına çağrılınca ona bunları söyledi. O adam dedi ki: Ben bugün gördüğüm şekilde bir Müslüman adamın bir şeyle karşılanmış olduğunu görmedim. Ömer dedi ki: Sana ant vererek söylüyorum ki, mutlaka bana haber vermelisin. Adam: Evet, ben cahiliye döneminde onların kahinleri idim, dedi. Ömer, Peki, sana haber getiren kadın cinnin sana getirdiği en şaşırtıcı neydi, diye sordu. Adam dedi ki: Bir gün ben çarşıda iken halinden korkuya kapılmış olduğunu anladığım bir vaziyette bana geldi ve cinlerin ne kadar ümitsiz olduğunu ve artık baş aşağı geri çevrildikten sonra ne kadar ümitlerini kestiklerini, develerinin yanına ve onların eğerleri altında konulanıara var(ıp sığın)dıklarını görmüyor musun, dedi. Ömer dedi ki: Doğru söylüyor. Ben bir gün onların putlarının yakınlarında bir yerde uyurken bir adam bir buzağı ile geldi ve onu boğazlayıverdi. Ona birisi yüksek sesle bağırdı. .Asla ondan daha yüksek sesle bağıran bir kimseyi işitmiş değilim. Şöyle diyordu: Ey açıkça düşmanlık eden kişi! Başarılı bir iş ortaya çıktı. Fasih bir adam senden başka hiçbir ilah yok, diyor. Bunun üzerine herkes ileri atıldı. Ben de, bunun ötesinde ne olduğunu öğrenmeden durmayacağım dedim. Sonra bir daha seslendi: Ey düşmanlığı açıkça olan bir kimse! Başarılı bir iş ortağı çıktı, fasih bir adam lajlahe illailah diyor. Ben de kalktım, aradan fazla zaman geçmemişti ki bize, bu bir nebidir denildi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 91
			}
		}
	]
}