{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "Urve b. Zubeyr'den rivayete göre; Ubeydullah b. Adiy b. el-Hıyar'ın kendisine Misver b. Mahreme ile Abdurrahman b. el-Esved b. Abdi Yeğus'dan şöyle dediklerini haber vermektedir: Dayın Osman ile (onun anne bir) kardeşi Velid b. Ukbe hakkında konuşmaktan seni alıkoyan nedir? Çünkü herkes Osman'ın ona yaptıkları dolayısı ile çok konuşmaya başlamıştı. Ubeydullah dedi ki: Bunun üzerine ben de Osman namaza çıkıp giderken önüne çıktım ve, seninle görülecek bir işim var. Bu iş bir nasihattir, dedim. Ey adam senden Allah'a sığınınm dedi. Bunun üzerine ben de ayrılıp gittim. Namazı bitirdikten sonra el-Misver ile İbn Abdi Yeğus'un yanına oturdum. Ben de onlara Osman'a söylediğimi, onun da bana verdiği cevabı aktardım. Her ikisi de bana, sen üzerine düşeni yaptın, dediler. Ben onlarla birlikte oturuyorken, Osman'ın elçisi yanıma geldi. Bana: Allah seni sınıyor, dediler. Gittim ve Osman'ın yanına girdim. Bana, az önce sözünü ettiğin nasihatin neydi, dedi. (Ubeydullah) dedi ki: Önce kelime-i şahadet getirdim, sonra şunları söyledim: Şüphesiz Allah Muhammed Sallallahu Aleyhi ve Sellem'i Nebi olarak gönderdi. Üzerine Kitabı indirdi. Sen de Allah'ın ve Resulünün davetini kabul edip, ona iman edenlerden oldun. İlk iki hicrette bulundun. Resulullah Sallallahu Aleyhi ve Sellem'e sahabilik ettin, onun hareket ve tutumlarını gördün. İnsanlar ise Velid b. Ukbe hakkında çokça konuşur oldular. Dolayısıyla senin ona had uygulamak senin üzerinde bir hak oldu. Bana dedi ki: Kardeşimin oğlu, sen Resulullah Sallallahu Aleyhi ve Sellem'e yetiştinmi? Ben: Hayır dedim fakat örtüsünün arkasındaki bakire kıza kadar ulaşan ilmi bana da ulaştı. (Ubeydullah) dedi ki: Osman da kelime-i şahadet getirdikten sonra dedi ki: Şüphesiz Allah Muhammed Sallallahu Aleyhi ve Sellem'i hak ile gönderdi. Üzerine Kitabı indirdi, ben de Allah ve Resulünün davetini kabul edenlerden oldum. Muhammed Sallallahu Aleyhi ve Sellem ile gönderilenlere iman ettim. Senin de dediğin gibi ilk iki hicrette bulundum. Resulullah Sallallahu Aleyhi ve Sellem'e sahabelik ettim, ona bey'at ettim. Allah'a yemin ederim, Allah onun ruhunu kabzedinceye kadar ona itaatsizlik etmedim, onu aldatmadım. Daha sonra yüce Allah Ebu Bekir'e halifelik verdi. Allah'a yemin ederim, ona da karşı gelmedim ve onu da aldatmadım. Sonra Ömer halife oldu. Allah'a yemin ederim ona da karşı gelmedim, onu da aldatmadım. Arkasından ben halifelik makamına getirildim, onların benim üzerimdeki hakları ne idiyse, benim de sizin üzerinizde öyle hakkım yok mudur? (Ubeydullah), evet dedi. (Osman) dedi ki: O halde sizden bana ulaşan bu sözler (dedikodular) ne oluyor? el-Velid b. Ukbe'nin durumu ile ilgili olarak söylediklerine gelince, inşallah bu hususta biz hak olan ne ise onu yapacağız. (Ubeydullah) dedi ki: Velid'e de kırk celde vurdu. Ali'ye celdeyi vurması için emir verdi, ona celde vuran o oldu.\" Yunus ile Zühri'nin kardeşinin oğlu, Zühri'den şöyle dediğini nakletmektedirler: \"(Osman dedi ki): Onların hakı gibi benim de sizin üzerinizde hakkım yok mu?",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 97
			}
		}
	]
}