{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3882,
			"arabicnumber": 3882,
			"text": "Ebu Hureyre r.a. dedi ki: \"Reslilullah Sallallahu Aleyhi ve Sellem Huneyn üzerine yürümek isteyince şöyle buyurdu: İnşailah yarın konaklayacağımız yer onların küfür üzere yeminleştikleri yer olan Kinane oğulları Hayfi olacaktır.\" Fethu'l-Bari Açıklaması: \"Müşriklerin Nebi Sallallahu Aleyhi ve Sellem aleyhine yeminleşmeleri.\" Bu olay Nebiliğin yedinci yılı Muharrem ayının birinci günü olmuştur. Necaşi, Cafer'i ve beraberindekileri (Medine'ye yolcu etmek üzere) hazırlamış bulunuyordu. Geldiklerinde de Nebi Sallallahu Aleyhi ve Sellem Hayber'de idi. Bu olay ise o yılın Safer ayında olmuştur. (Bk. 1318 numaralı hadis) Muhtemelen Necaşi onları yolculamak üzere hazırladıktan sonra vefat etmiştir. Beyhaki'nin Oelailu'n-Nübuwe adlı eserinde Mekke'nin .feth.inden önce olduğu belirtilmektedir ki, doğru olma ihtimali daha yüksektir. ıbn ıshak, Musa b. Ukbe ve diğer Megazi bilginleri der ki: Kureyş ashab-ı kiram'ın em an (güvenlik) altında oldukları bir yere konakladıklarını, Ömer'in İslama girdiğini, İslamın kabileler arasında yayıldığını görünce Resulullah Sallallahu Aleyhi ve Sellem'i öldürmek kararını aldılar. Bu karar Ebu Talib'e ulaşınca o da Haşim oğulları ile Muttalib oğullarını topladı. Resulullah Sallallahu Aleyhi ve Sellem'i kendi mahallelerine aldılar ve onu kendisini öldürmek isteyenlere karşı korudular. Ebu Talib'in bu çağrısını aralarından kafir olanlar dahi kabul etti ve cahiliye adeti üzere hamiyet duygusuyla bu işi yaptılar. Kureyş onların bu davranışlarını görünce bu sefer kendileri ile Haşim ve Muttalib oğulları arasında kendilerine Resulullah Sallallahu Aleyhi ve Sellem'i teslim edecekleri vakte kadar onlarla hiçbir ilişkiye girmemek ve onlara kız alıp vermemek üzere bir belge düzenlemek hususunda ittifak ettiler. Onlar bu kararlarını uygulamaya koydular ve bu belgeyi de Ka'be'nin içine astılar. Bunu yazan kişinin adı Mansur b. İkrime b. Amir b. Haşim b. Abdi Menaf b. Abdu'd-Oarr b. Kusay olup, daha sonra parmakları felç oldu. İbn İshak der ki: Bunun üzerine Haşim oğulları ile Muttalib oğulları Ebu Talib'in yanında yer aldılar. Ancak Ebu Leheb müstesna, o Kureyşlilerle birlikte oldu. Oenildiğine göre onları boykotun başladığı tarih, Nebiliğin yedinci yılı Muharrem ayıdır. İbn İshak der ki: İki ya da üç yıl bu hal üzere devam ettiler. Musa b. Ukbe ise bu sürenin üç yılolduğunu kat'i olarak ifade etmiştir. Nihayet (Nebi ve Beraberindekiler) çok zor duruma düştü. Gizli saklı olması hali dışında onlara yiyecek hiçbir şey gelmiyordu. Hatta bazı akrabaları arasında akrabalık bağını gözetmek amacıyla gizli saklı bir şeyler gönderdiğini tespit ettikleri kimselere dahi işkence ediyorlardı. Bu hal sahifede yazılanları bozmak üzere faaliyete geçen ve bu hususta en gayretli çalışmalarda bulunan Hişam b. Amr b. el-Haris el-Amirı'nin harekete geçtiği vakte kadar devam etmiştir. Onun baba tarafından annesi kendi dedesi onunla evlenmeden önce Haşim b. Abdi Menarın nikahı altında idi. Bu sebeple onlar Ebu Talib şi'binde (mahallesinde) muhasara altında iken onları gözetirdi. Daha sonra Zuheyr b. Ebi Umeyye'nin yanına gitti. Onun da annesi Atike Abdulmuttalib'in kızı idi. Bu hususta onunla konuşunca ona muvafakat etti. Her ikisi kalkıp, Mut'am (Mut'im) b. Adiy'in ve Zem'a b. el-Esved'in yanına gittiler. Hepsi bu hususta görüş birliğine vardı. Hicr'de oturun ca bu hususta söz açtılar ve bunu reddettiler. Ona karşı çıkmak üzere de ittifak ettiler. EbuCehil, bu, geceleyin hazırlanmış bir plandır dedi. Sonunda sahifeyi (Ka'be'den) dışarıya çıkarttılar, yırtıp parçaladılar, hükmünü iptal ettiler. İbn Hişam'ın naklettiğine göre onlar bir kurdun, yüce Allah'ın adı dışında içindeki bütün yazıları yemiş olduğunu gördüler. el-Vakıdl'nin naklettiğine göre onların Şi'b'den dışarı çıkması, Nübuvvetin 10. yılında olmuştur. Bu da hicretten üç yıl önceye rastlar. Ebu Talib de oradan dışarı çıktıktan kısa bir süre sonra vefat etti. İbn İshak der ki: Ebu Talib ve Hatice aynı yılda vefat etmiştir. Bunun üzerine Kureyş Resulullah Sallallahu Aleyhi ve Sellem'e Ebu Talib hayatta iken yapmadıklarını yapmaya koyuldu. Bu anlatılanlardan Buhari'ye göre herhangi bir şey sabit görülmediğinden dolayı o bu hususta kıssanın aslına delalet etmesi için Ebu Hureyre yoluyla gelen hadisi zikretmekle yetinmiştir. İleride yüce Allah'ın izniyle Meğazi bölümünde Mekke'nin Fethi gazvesi ile alakalı hadisin açıklaması gelecektir. (bkz. 4284 nolu hadis)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 107
			}
		}
	]
}