{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3885,
			"arabicnumber": 3885,
			"text": "Ebu Said el-Hudri r.a.'dan rivayete göre \"O (Ebu Talib hakkında huzurunda konuşulunca) Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinlemiştir: Belki Kıyamet gününde şefaatimin ona faydası olur da Kıyamet gününde topuklarına kadar ulaşacak ve bundan dolayı beyni kaynayacak olan hafif bir ateşe konulur.\" Bu Hadis 6564 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Ebu Talib'in kıssası.\" Adının, Abdi Menaf olduğu üzerinde ittifak vardır. Resulullah sallallShu aleyhi ve sellem'in babası Abdullah'ın öz kardeşidir. Bundan dolayı Abdulmuttalib vefat ettiğinde torununu ona vasiyet ederek bırakmış, o da büyüyünceye kadar ona bakmıştı. Nebi olarak gönderildiğinden sonra ölünceye kadar Ebu Talib hep ona yardımını sürdürmüştür. Onun Şi'bden çıkışlarından sonra öldüğünü belirtmiş idik. Bu da Nebiliğin onuncu yılı sonlarında olmuştur. Nebi sallallShu aleyhi ve sellem'i koruyor, onu rahatsız edecek her şeye karşı onu savunuyordu. Bununla birlikte o kavminin dini üzere kalmaya devam ediyordu. Az önce İbn Mes'ud'un rivayet ettiği: \"Resulullah Sallallahu Aleyhi ve Sellem'e gelince, Allah onu amcası vasıtasıyla korumuştu\" şeklindeki hadis geçmiş bulunmaktadır. Ebu Talib'in Nebi Sallallahu Aleyhi ve Sellem'i himaye etmesi, onu savunması bilinen ve meşhur bir husustur. Bu hususta onun meşhur şiirleri arasında şu beyit de vardır: \"Allah'a yemin ederim hep birlik olsalar dahi sana ulaşamayacaklardır Ta ki ben toprağa uzanıp gömülünceye kadar\" \"Seni koruyordu\" seni kollayıp, gözetliyordu. Bu ibarede İbn İshak'ın sözkonusu ettiği şu hususa da bir işaret vardır: Daha sonra Hatice ve Ebu Talib hicretten üç yıl önce aynı yılda vefat ettiler. Hatice, İslam yolunda kendisi ile huzur bulduğu son derece doğru ve samimi bir yardımcı idi. Ebu Talib de kavmine karşı ona bir destek ve bir yardımcıydı. Ebu Talib öldükten sonra Kureyşliler Resuluilah Sallallahu Aleyhi ve Sellem'e Ebu Talib hayatta iken asla ummadıkları bir seviyede rahatsızlık verdiler. Hatta Kureyş'in beyinsizlerinden birisi onun karşısına çıkmış, başının üzerine toprak atmıştı. Bana Hişam b. Urve'nin babasından naklettiğine göre o şöyle demiştir: Bunun üzerine Resulullah sallallahu aleyhi ve selle m evine girerken şöyle diyordu: \"Ebu Talib ölünceye kadar Kureyşliler bana hoşuma gitmeyecek bir şey yapamamışt!.\" \"O topuklarına kadar varan bir ateş içindedir.\" (Topuklarına kadar varan ateş diye tercüme ettiğimiz) 'ed-dahdah' topuğa varan su demektir. Yani onun azabı hafifletilmiş bulunmaktadır. Müslim'de yer alan İbn Abbas'ın rivayet ettiği hadiste şöyle denilmektedir: \"Hiç şüphesiz cehenl1em ehli arasında azabı en hafif olan kişi Ebu Talib'dir. Onun beynini kaynatan ayakkabıları olacaktır.\" Rafızilerden birisinin derlediği ve Ebu Talib'in Müslüman olduğuna delalet eden pek çok vahi (gevşek, senedi sağlam olmayan) hadisi bir araya getirdiği bir cüz gördüm. Bunların hiçbiri sabit değildir. Başarı Allah'tandır. Ben bunları elİsabe adlı eserin Ebu Talib'in hayatını anlatan bölümünde özetledim. \"Ebu Talib'in ölüm vakti gelince\" yani henüz ölüm hırıltısı boğazına ulaşmadan ... \"Senin için tartışayım .. \" Cenazeler bölümünün sonlarında: \"Allah'ın huzurunda onunla senin lehine şahitlik edeyim\" lafzı ile geçmişti. Nebi Sallallahu Aleyhi ve Sellem Ebu Talib'in bu halde iken şahadet kelimesini getirmek istemeyişinden onun şu zanna sahip olduğunu anlamış gibidir: Ona göre böyle bir şey ölüm halinde söylendiğinde kendisine fayda sağlamayacaktır yahut da namaz ve benzeri diğer amelleri işlernek imkanını bulamadığından bu şahadetin faydasının olmayacağını sanmıştı. Bundan dolayı Nebi efendimiz, onun lehine delil getirip tartışmayı sözkonusu etmiştir . \"Şahitlik etme\" lafzına gelince, muhtemelen Ebu Talib bunun kendisine fayda sağlamayacağını zannetmiştir. Çünkü o vakit Nebi sallallahu aleyhi ve selle m ile birlikte mu'minlerden hiçbir kimse yanında bulunmuyordu. Resulullah saIJallahu aleyhi ve sellem de bunu söylemiş olduğuna dair lehine şahadette bulunacağını ve bunun kendisine fayda sağlayacağını belirterek gönlünü hoş etmek istedi. Ebu Hazim'in, Ebu Hureyre'den yaptığı ve İmam Ahmed'in naklettiği rivayette şöyle denilmektedir: \"Ebu Talib dedi ki: Eğer Kureyşliler beni ayıplamayacak ve, ölüm korkusundan başka bir sebeple bunu söylemiş değildir, demeyecek olsalardı bunu söyleyerek senin gönlünü hoş, gözünü aydın ederdim.\" Hadisten, müşrik yakın akrabayı ziyaret etmenin, hasta ise yanına gitmenin caiz olduğuna, ölümün ağır hastalığı halinde bile tevbenin kabul edileceğine delil vardır. Bu tevbe ölüm meleğinin görüleceği ana kadar makbuldür. O noktadan sonra kabul edilmez. Çünkü yüce Allah şöyle buyurmaktadır: \"Bizim azabırnızı gördüklerinde imanlarının onlara faydası olmadL\" Ayrıca kafir, hak olan şehadeti getirecek olursa azaptan kurtulur. Çünkü İslam kendisinden öncekileri yıkar. Kafirlerin azabı farklı farklıdır. Ebu Talib hakkında sözkonusu olan fayda da Nebi Sallallahu Aleyhi ve Sellem'in bereketi ile sahip olduğu özelliklerdendir. Nebi Sallallahu Aleyhi ve Sellem'in ona, la ilah e illailah demeyi teklif etmekle birlikte bu arada Muhammedu'r-Resulullah dememiş olmasının sebebi, her iki sözün artık tek bir söz gibi oluşundan dolayıdır. Muhtemelen Ebu Talib onun Allah'ın Resulü olduğundan emin idi, fakat tevhidi kabul etmiyordu. Bundan dolayı o \"nun\" kafiyeli (Nuniye) beyitlerinden birisinde şöyle demiştir: \"Davet ettin beni ve senin sadık olduğunu bildimben, Andolsun sen doğru söylemişsin ve önceden de emin birisi idin.\" Ek bir bilgi: Hayret verici denk düşmelerden birisi de şudur: Nebi sallallahu aleyhi ve seIJem'in amcaları arasında İslamın gelişine yetişenler dört tanedir. Bunlardan ikisi Müslüman olmadı, ikisi de Müslüman oldu. Müslüman olmayanların adı, Müslümanolanların adı ile aykırılık arzediyordu. Müslüman olmayanların asıl adı, Abdi Menaf olan Ebu Talib ile asıl adı Abdu'l-Uzza olan Ebu Leheb'tir. Oysa Müslüman olanların adları Hamza ile el-Abbas'dır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 110
			}
		}
	]
}