{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3887,
			"arabicnumber": 3887,
			"text": "Enes b. Malik b. Sa'saa r.a.'dan rivayete göre; \"Allah'ın Nebii Sallallahu Aleyhi ve Sellem kendisine İsra'ya götürüldüğü geceyi anlatarak şöyle buyurmuştur: Ben el-Hatim'de -ravi belki de el-Hicr'de demiştir- yatıyordum. Aniden bana birisi geldi. Şurdan şuraya kesti. -Katade dedi ki: Onu (Enes'i) yardı, dediğini de dinlemişimdir.- (Katade dedi ki:) Ben yanımda bulunan el-Carud'a dedim ki: Bununla neyi kastediyor? O, boğazından eteğine kadar -yine onu: \"Göğsünün üst tarafından eteğine kadar (yardı) dediğini de dinlemişimdir- Kalbimi çıkardı. Daha sonra yanıma iman ile dolu altından bir leğen getirildi. Kalbim yıkandı, sonra içi dolduruldu. Sonra da eski haline iade edildi. Arkasından bana beyaz renkli, katırdan alçak, eşekten yüksek bir binek getirildi. -el-Carud ona dedi ki: Ey EbU Hamza o binek Burak mıdır? Enes dedi ki: Evet, o adımını gözüyle gördüğü en son noktaya koyar.- O bineğe bindirildim. Cibril beni alıp götürdü. Nihayet dünya semasına kadar geldi. Açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var, diye soruldu. Muhammed denildi. (Mi'rac için) Ona risalet verildi mi, diye soruldu, o evet dedi. Merhaba ona, onun gelişi ne güzeldir, denildi. Kapı açıldı. İçeri girdikten sonra orada Adem' ile karşı laştı m. Bu senin baban Ademidir, ona selam ver dedi. Ben de ona selam verdim, selamımı aldıktan sonra, salih oğluma ve salih nebiye merhaba, dedi. Sonra beni alıp ikinci semaya çıkardı. Açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona (Mi'rac için) risalet (haber, emir) verildi mi diye soruldu, evet dedi. Merhaba ona, onun gelişi ne güzeldir denildi. Kapı açıldı, içeri girince teyze çocukları olan Yahya ve İsa'yı gördüm. Bu Yahya, bu da İsa'dır, haydi onlara selam ver dedi, ben de selam verdim. Selamımı aldıktan sonra, salih kardeşimize ve salih nebiye merhaba dediler. Sonra beni alıp üçüncü semaya çıkardı, açılmasını istedi. O kim denildi, Cibril dedi. Beraberinde kim var diye soruldu. Muhammed dedi. Ona (Mi'rac için) risalet verildi mi diye soruldu, evet dedi. Merhaba ona, bu geliş ne güzel geliştir denildi, kapı açıldı. İçeri girdiğimde Yusuf ile karşılaştım. Bu Yusuftur, ona selam ver dedi. Ben de ona selam verdim. Selamımı aldıktan sonra salih kardeşime ve salih nebiye merhaba dedi. Sonra beni alıp dördüncü semaya çıkardı, açılmasını istedi. O kim denildi, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed, dedi. Ona risalet verildi mi, diye soruldu. Evet, dedi. Merhaba ona, onun gelişi ne güzeldir, denildi. Kapı açıldı, içeri girdiğimde İdris'i gördüm. Bu İdris'tir, ona selam ver, dedi. Ben de ona selam verdim, selamımı aldıktan sonra salih kardeşime ve salih nebiye merhaba dedi. Daha sonra beni beşinci semaya çıkardı, açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona (Mi'rac için) risalet (haber) gönderildi mi diye sordu, evet dedi. Merhaba ona, onun bu gelişi ne güzel bir geliştir, denildi. İçeri girince Harun ile karşılaştım, bu Harun'dur ona selam ver dedi. Ben de ona selam verdim, selamımı aldıktan sonra, salih kardeşe ve salih nebiye merhaba dedi. Sonra beni alıp altıncı semaya çıkardı. Açılmasını istedi. O kim diye soruldu, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona (Mi'rac için) risalet (haber) gönderildi mi, diye soruldu, evet dedi. Merhaba ona, onun bu gelişi ne güzeldir, dedi. İçeri girdiğimde Musa ile karşılaştı m. Bu Musa'dır, ona selam ver dedi. Ben de ona selam verdim. O da selamımı aldıktan sonra: Salih• kardeşime ve salih nebiye merhaba, dedi. Yanından ayrılıp gidince ağlamaya başladı. Ona niçin ağlıyorsun diye soruldu, şöyle dedi: Ağlayışımın sebebi şu ki, benden sonra Nebi olarak gönderilen bir delikanlının ümmetinden cennete gireceklerin sayısı benim ümmetimden daha fazla olacaktır. Sonra beni yedinci semaya çıkardı. Cibril (kapısının) açılmasını istedi. O kim denildi, Cibril dedi. Beraberinde kim var diye soruldu, Muhammed dedi. Ona bi'set verildi mi (yani semaya gelmesi için haber gönderildi mi) diye soruldu, evet dedi. Merhaba ona, onun gelişi ne güzeldir dedi. Girince İbrahim ile karşılaştım. Bu senin babandır, ona selam ver dedi. Ben de ona selam verdim, selamımı aldıktan sonra, salih oğluma ve salih nebiye merhaba dedi. Daha sonra Sidretu'l-Müntehfı bana yaklaştırıldı. Onun meyvesinin Hecer testilerini, yapraklarının fil kulaklarını andırdığını gördüm. Bu Sidretu'l-Müntehfı'dır dedi. Orada dört de nehir gördüm, ikisi gizli ikisi açıktı. Bu iki nehir ne oluyor ey Cibril, diye sordum. Dedi ki: Gizli olan ikisi cennetteki iki ırmaktır, açıktan akan ikisi ise Nil ile Fırat'tır. Daha sonra bana el-Beytu'l-Ma'mur yakınlaştırıldı. Sonra birinin içinde şarab, birinin içinde süt, birinin içinde bal bulunan kaplar getirildi. Ben süt bulunan kabı aldım. İşte bu senin ve ümmetinin üzerinde olduğun fıtrattır dedi. Sonra bana her gün elli namaz olmak üzere namaz farz kılındı. Geri döndüğümde Musa'nın yanından geçtim. Sana ne emrolundu diye sordu. Ben, her gün elli vakit namaz ile emrolundum dedim. Senin ümmetinin her gün elli vakit namaz kılmaya gücü yetmez, şüphesiz Allah'a yemin ederim ki senden önce ben insanları denedim. İsrailoğulları ile çok uğraştım. Rabbine dön de ondan ümmetinin yükünü hafifletmesini dile, dedi. Ben de döndüm, üzerimden onunu kaldırdı. Musa'nın yanına döndüm. Yine önceki gibi söyledi. Geri döndüm, üzerimden bir onunu daha kaldırdı. Musa'nın yanına geri geldim, bana aynısını söyledi. Tekrar geri döndüm, benden onunu daha kaldırdı. Yine Musa'nın yanına döndüğümde bana aynısını tekrar söyledi. Bir daha geri döndüm, her gün on vakit namaz kılmakla emrolundum. Geri döndüm, yine Musa aynısını söyledi. Tekrar ben de geri döndüm. Her gün beş vakit namaz kılmakla emrolundum. Musa'nın yanına geri döndüğümde, sana ne emrolundu diye sordu. Ben, her gün beş vakit namaz kılmakla emrolundum dedim. Bana: Senin ümmetin her gün beş vakit namaz kılamaz, dedi. Çünkü ben senden önce insanları denedim. İsrailoğullarıyla alabildiğine uğraştım. Haydi Rabbine geri dön, ondan ümmetinin yükünü hafifletmesini dile. (Allah Resulü) buyurdu ki: Rabbimden çok istedim artık utanıyorum, fakat onun emrine rıza gösteriyorum, teslim oluyorum. Ayrılıp gidince bir münadi şöyle buyurdu: Ben farz kıldığımı gerçekleştirdim, kullarımın yükünü de hafiflettim",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 112
			}
		}
	]
}