{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3893,
			"arabicnumber": 3893,
			"text": "Ubade b. es-Samit r.a. şöyle dediği rivayet edilmiştir: \"Ben Resulullah Sallallahu Aleyhi ve Sellem ile bey'atleşen nakiblerden birisiyim. Devamla dedi ki: Biz onunla Allah'a hiçbir şeyi ortak koşmamak, hırsızlık yapmamak, zina etmemek, hak ile olması hali dışında Allah'ın haram kıldığı canı öldürmemek, kimsenin malını haksızca almamak;-bunları yaptığımız takdirde, (onu yapan hakkında) cennetlik olacağına hüküm vermemek üzere bey'atleştik. Eğer bunlardan birisini işleyecek olursak bu işe dair hüküm vermek de Allah'a aittir.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'e Mekke'de Ensarın heyet halinde gelmeleri ve Akabe bey'atL\" İbn İshak ve başkalarının zikrettiklerine göre Nebi Sallallahu Aleyhi ve Sellem, Ebu Talib'in vefatından sonra Taif'te bulunan Sakif kabilesine onları kendisine yardım etmeye davet etmek üzere çıkıp gitmişti. Daha önce Bed'u'I-Halk (yaratmanın başlaması) bölümünde açıklandığı üzere (3231 nolu hadis) onun bu isteğini kabul etmedikleri için o da Mekke'ye geri dönmüştü. Hac mevsimlerinde ise kendisini himaye etmeyi Arap kabilelerine teklif ediyordu. (İbn İshak'ın) farklı senetlerle zikrettiğine göre o Kindelilere, Ka'b oğullarına, Huzeyfe oğullarına, Amir b. Sa'saa oğullarına ve başkalarına gitmiş, fakat bunlardan hiçbirisi onun istediğini olumlu karşılamamışt!. Musa b. Ukbe, ez-Zühri'den naklen der ki: \"Bu yıllarda -yani hicretten önce kendisini (himaye etmeyi) kabileiere teklif ediyor ve her bir kavmin önderleri ile konuşuyordu. Onlardan sadece kendisini barındırmalarını ve korumalarını istiyor ve, sizden hiçbir kimseyi herhangi bir işi yapmaya zorlarnam, diyordu. Bunun yerine sizden beni bana eziyet edenlere karşı korumanızı istiyorum. Böylelikle Rabbimin risaletini tebliğ edebileyim. Fakat kimse onun istediğini kabul etmiyor, hatta şöyle diyorlardı: Bir adamın kendi kavmi onu daha iyi bilirler.\" Hakim, Ebu Nuaym ve Delailu'n-Nubuwe adlı eserinde Beyhaki hasen bir senedie İbn Abbas'tan şöyle dediğini rivayet etmektedirler: \"Ali b. Ebi Talib bana anlattı, dedi ki: Allah nebisine kendisini Arap kabilelerine (korumalarını) teklif etmesini emredince, onunla birlikte ben ve Ebu Bekir, Mina'ya çıktık. Nihayet Arapların meclislerinden bir meclise girdik. Ebu Bekir öne geçtL O iyi bir nesep bilgini idi. Kimlerdensiniz, diye sordu. Onlar, biz Rabia kabilesindeniz dediler. Siz Rabia'nın hangi kolundansınız diye sorunca onlar, biz Zuhl'deniz dediler -ve karşılıklı olarak konuşmalarını anlatan ve sonunda olumlu karşılık vermediklerini belirten uzunca açıklamalar ihtiva eden hadisi zikrettiler.- (Ali devamla) dedi ki: Daha sonra Evslilerle Hazredilerin medisine gittik. Bunlar ise Resulullah sallAllahu aleyhi ve sellem'in kendilerine Ensar adını verdiği kimselerdir. Çünkü bunlar kendisini barındırmak ve ona yardım etmek isteğine olumlu cevap vermişlerdi. (Ali devamla) dedi ki: Resulullah sallAllahu aleyhi ve sellem'e bey'at etmeden yerlerinden kalkmadılar.\" İbn İshak'ın zikrettiğine göre birinci Akabe bey'atinde bulunanlar şu aItı kişi idiler: Ebu Umame, Esa'd b. Zurare en-Neccarı, Rafi' b. Malik b. el-Adan elAdanı, Kutbe b. Amir b. Hadide, Cabir b. Abdullah b. Riab, Ukbe b. Amir -bu (son) üç kişi Seleme oğullarındandır- ile Malik b. en-Neccar oğullarından Avf b. el-Haris b. Rifaa'dır. İbn İshak der ki: \"Bana Asım b. Ömer b. Katade kavminden yaşlı bazı kimselerden naklen anlattı, dedi ki: Nebi sallAllahu aleyhl ve sellem onları görünce siz kimlerdensiniz diye sordu. Onlar, biz Hazredilerdeniz dediler. Peki sizinle konuşmak üzere oturmaz mısınız deyince, onlar olur dediler. Kendilerini Allah'ın yoluna çağırdı. Onlara Müslüman olmayı teklif etti, onlara Kur'an okudu. Allah'ın onların lehine yaptıklarından birisi de şu idi: Yahudiler onların yurtlarında onlarla beraber idi. Kitap ehli kimselerdi. EvsliIer ile Hazrediler de sayıca onlardan fazla idi. Bundan dolayı aralarında bir şeyolduğu zaman şöyle derlerdi: Pek yakında bir Nebi gönderilecek, artık onun gönderilme zamanı geldi. Biz dea Nebie uyacağız, onunla birlikte sizi öldüreceğiz. Nebi sallAllahu aleyhi vesellem onlarla (Hazredilerle) konuşunca bu anlatılanın o olduğunu anladılar. Biri diğerine, Yahudiler bu işte bizim önümüze geçmesin, dediler. Bunun üzerine iman edip onu tasdik ettiler. Kendi kavimlerini de davet etmek üzere yurtlarına geri döndüler. Onlara olanı haber verdiklerinde içinde Resulullah sallAllahu aleyhi ve sellem'in adı anılmadık kavimlerine mensup hiçbir kimsenin evi kalmadı. Ertesi sene hac mevsiminde onlardan oniki kişi Nebi ile bir araya geldi.\" İbn İshak der ki: \"Bana Ma'bed b. Ka'b b. Malik anlattı: Kardeşi Abdullah -ki Ensarın en bilginleri idi- kendisine anlattığına göre babası Ka'b kendisine anlatmıştır. Ka'b de Akabe'de bulunanlardan ve orada bey'atleşenlerden idi. Dedi ki: Kavmimizin müşrikleri ile birlikte haccetmek üzere çıktık. O zamana kadar namaz kılmış, fıkh etmiş (dini öğrenmiş) idik. Beraberimizde efendim,iz ve büyüğümüz olan el-Bera b. Ma'rur da vardı. Onun Ka'be'ye doğru namaz kılışını sözkonusu ederek- dedi ki: Bizler Mekke'ye vardığımı'da daha önceden Resulullah Sallallahu Aleyhi ve Sellem'i görmemiştik. Onu sorduk. O mescidde el-Abbas ile birliktedir, diye cevap verildi. Biz de içeri girdik, yanına oturduk. el-Bera ona kıbleyi sordu. Sonra da hacca gitmek üzere yola çıktık. Onunla Akabe'de buluşmak üzere sözleştik. Beraberimizde Cabir'in babası Abdullah b. Amr vardı ve henüz Müslüman olmamıştı. Ona İslamı anlatınca derhal Müslüman oldu ve Nakiblerden oldu. (Ka'b) dedi ki: Akabe'nin yakınında yetmiş üç adam toplandık. Beraberimizde Mazin oğullarından birisinin hanımı olan Ka'b kızı Ümmü Umare ile Selerne oğullarından birisinin hanımı olan Amr b. Adiy kızı Esma adında iki hanım da vardı. j Nebi beraberinde el-Abbas olduğu halde geldi. Söbayarak dedi ki: Şüphesiz Muhammed'in aramızdaki durumunu biliyorstınuz. Biz onu (ona zarar vermek isteyenlere karşı) koruduk. O güçlü bir ortamda bulunuyor. Eğer sizler onu kendisine davet ettiğiniz hususları ona karşı eksiksiz yerine getirmeyi ve ona muhalefet edenlere karşı onu korumayı istiyor iseniz biz sizi isteğinizle baş başa bırakabiliriz. Aksi takdirde şimdiden bu işten vazgeçiniz. (Ka'b b. Malik) dedi ki: Biz konuş ey Allah'ın Resulü, dedik. Kendin için istediğin sözü aL. O da konuştu. Allah'a davet etti, Kur'an okudu, İslama bağlılığı teşvik etti, sonra şöyle buyurdu: Hanımlannızı, evlatlarınızı neye karşı koruyorsanız beni de öylece korumanız şartıyla sizinle bey'atIeşiyorum. (Ka'b) dedi ki: el-Bera b. Ma'rur onun elini tutarak: Evet dedi\" ve hadisin geri kalanın! zikretti. Bu hadise göre Resulullah sallalli\\hu aleyhi ve selle m onlara dedi ki: \"Siz kiminle barış yaparsanız ben de onunla barış yaparım, kiminle savaşırsanız ben de onunla savaşırım. Sonra da, bana aranızdan on iki nakib gösterin, diye buyurdu.\" İbn İshak nakibleri de zikretmektedir. Nakibler şunlardır: Es'ad b. Zurare, RMi' b. Malik, el-Bera b. Ma'rur, Ubade b. es-Samit, Abdullah b. Amr b. Haram, Sa 'd b. er-Rebi, Abdullah b. Revaha, Sa 'd b. Ubade, el-Münzir b. Amr b. Hubeyş, Useyd b. Hudayr, Sa'd b. Hayseme ve Ebu'I-Heysem b. et-Teyyihan'dır. İbn İshak dedi ki: \"Bana Abdullah b. Ebi Bekr b. Hazm'in anlattığına göre Resulullah sallalli\\hu aleyhi ve sellem nakiblere, sizler havarilerin Meryem oğlu İsa'ya kefil oldukları gibi kavminize karşı kefilsiniz dedi. Onlar da, evet dediler.\" Yine onun zikrettiğine göre Kureyş'e bey'at haberi ulaştı. Ancak onlarla birlikte gelmiş olanlar böyle bir şeyin olmadığını söylediler. Aralarından müşrik olanlar -ki sayıca onlardan fazla idi, beşyüz kişi olduğu söylenmiştir- böyle bir şeyin olmadığına dair yemin ettiler. Çünkü onlar olan bitenden haberdar değillerdi. İbn İshak'ın belirttiğine göre Nebi sallalli\\hu aleyhi ve selle m bu on iki adam ile birlikte Abdu'd-Dar oğullarından Mus'ab b. Umeyr'i de göndermişti. Daha sonra onların kendilerine dini ve Kur'an'ı öğretmek üzere istekte bulunmaları üzerine kendilerine Mus'ab'ı gönderdiği de söylenmiştir. Mus'ab, Es'ad b. Zurare 'ye misafir oldu. Ebu Davud'un, Abdurrahman b. Ka'b b. Malik yoluyla şöyle dediği rivayet edilmektedir: \"Babam Cuma için ezanı işitince Es'ad b. Zurare'ye Allah'tan mağfiret dilerdi. Ona (sebebini) sordum dedi ki: Medine'de Cuma için bizi ilk toplayan kişi o olmuştu.\" Darakutni de İbn Abbas'tan şunu rivayet etmektedir: \"Nebi s.a.v. Mus'ab b. Umeyr'e Cuma için onları topla, diye mektup yazdı.\" Ensar'dan pek çok kimse Es'ad b. Zurare'nin de yardımcı olması suretiyle Mus'ab b. Umeyr vasıtası ile Müslüman oldu ve nihayet İslam Medine'de yayıldı. Bu ise onların bir sonraki sene yola çıkmalarına sebep oldu. Nihayet onlardan yetmiş kişi hatta daha fazla Akabe'de bulundu ve -daha önce geçtiği gibi- bey'atleştiler",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 118
			}
		}
	]
}