{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3904,
			"arabicnumber": 3904,
			"text": "Ebu Said el-Hudri r.a.'dan rivayete göre: Resulullah Sallallahu Aleyhi ve Sellem minber üzerinde oturdu ve şöyle dedi: Bir kulu, Allah, ona dünya güzelliklerinden dilediklerini vermek ile nezdindekileri seçmek hususunda serbest bıraktı. O da Allah nezdinde olanı seçti. Bunun üzerine Ebu Bekir ağladı, babalarımız, annelerimiz sana feda olsun dedi. Biz ona hayret ettik. Herkes, şu yaşlı adama bakınız. Resulullah Sallallahu Aleyhi ve Sellem, Allah'ın bir kulunu ona dünya güzelliklerini vermek ile nezdindekileri seçmekte muhayyer bırakmış olduğunu haber veriyor, o kalkmış babalarımız annelerimiz sana feda olsun, diyor. Meğer muhayyer bırakılan kişi Resulullah Sallallahu Aleyhi ve Sellem imiş. Ebu Bekir de bu işi aramızda en iyi bilen imiş. Resulullah Sallallahu Aleyhi ve Sellem ayrıca şöyle buyurdu: Şüphesiz arkadaşlığı ve malı hususunda insanlar arasında bana en çok fedakarlık etmiş olan kişi EbU Bekir'dir ve eğer ümmetim arasından bir Halil (candan dost) edinecek olsaydım, şüphesiz EbU Bekir'i edinirdim. Ancak İslam Halilliği vardır. EbU Bekir'in gediği müstesna- Mescide açılan hiçbir gedik kalmasın hepsi kapatılsın).\" Fethu'l-Bari Açıklaması: \"Nebi sallallahualeyhivesellem'in ve ashabının Medine'ye hicreti\" Nebi Sallallahu Aleyhi ve Sellem'in hicreti ile ilgili olarak İbn Abbas'tan gelen rivayete göre, ona Medine'ye hicret hususunda yüce Allah'ın şu buyruğu ile izin verilmiştir: \"Ve de ki: Rabbim beni doğruluk girdirişi ile girdir, doğruluk çıkarışı ile çıkar. Tarafından bana destekleyici üstün bir belge ver.\" [İsra, ı 80] Bu hadisi Tirmizi rivayet etmiş olup, o da Hakim de sahih olduğunu belirtmişlerdir. Hakim de Nebi efendimizin Mekke'den Akabe bey'atinden üç ay ya da ona yakın bir süre sonra çıkıp ayrıldığını zikretmektedir. Nebi sallAllahu aleyhi ve sellem'in ashabına gelince, onlardan Ebu Bekir esSıddik ile Amir b. Fuheyre onunla birlikte yola çıkmışlardı. Bundan önce ise iki Akabe arasında aralarında İbn Ümmü Mektum'un da bulunduğu bir topluluk Medine'ye çıkmışlardır. Denildiğine göre Medine'ye ilk hicret eden kişi Üm mü Seleme'nin kocası Mahzum oğullarından Ebu Selerne b. Abdi'l-Eşhel hicret etmiştir. Buna sebep ise onun Habeşistan'dan dönmesinden sonra eziyete maruz kalması idi. Tekrar Habeşistan'a hicret etmek üzere karar vermişken Ensardan oniki kişinin olayı ona ulaşınca Medine'ye yönelmiştir. Daha sonra ise az önce geçtiği gibi Ensardan Müslüman olanları İslam hakkında bilgilendirmek üzere Mus'ab b. Umeyr, Medine'ye gitmek üzere yola çıkmıştır. 3899- \"Bugün\" yani Mekke'nin fethedilmesinden sonra \"hicret yoktur.\" 3900- \"Mürninlerden herhangi bir kimse dinini kurtarmak için ... kaçardı.\" Aişe r.anha hicretin meşruiyetine dair gerekli açıklamalara ve bunun sebebinin dinde fitneye maruz kalma korkusu olduğuna işaret etmiştir. Hüküm illete bağlıdır. Buna göre nerede olursa olsun Allah'a ibadet edebilen bir kimsenin o yerden hicret etmesi icap etmez. Aksi takdirde icap eder. İşte bundan dolayı el-Maverdt şunları söylemektedir: Küfür şehirlerinden herhangi birisinde dinini açıkça ortaya koymaya gücü yeten bir kimse ile artık o şehir (belde), o kimse vasıtası ile Dar-ı İslam olur. Böyle bir yerde ikamet etmek oradan göç etmesinden. daha iyidir. Çünkü bu vesile ile başkasının da İslama girmesi ümit edilir. Cihad bölümünün baş taraflarında \"İslam idarecilerinin savaş çağrısına uymanın vücubu\" ile ilgili başlıkta İbn Abbas'ın: \"Fetihten sonra hicret yoktur\" diye rivayet ettiği hadis ile Abdullah b. es-Sa'dt'nin: \"Hicretin ardı arkası kesilmez\" hadisini birlikte telife işaret edilmiş bulunmaktadır. el-Hattabt de diyor ki: Hicret yani Nebi Sallallahu Aleyhi ve Sellem'in yanına gitmek, İslamın ilk dönemlerinde istenen bir 'şey idi. Daha sonra Nebi Sallallahu Aleyhi ve Sellem Medine'ye hicret ettikten sonra onunla birlikte savaşmak ve dinin şer'i hükümlerini öğrenmek amacıyla Medine'ye hicret etmek farz kılınmıştır. Şam yüce Allah bu hususu birden çok ayet-i keime'de tekitli bir şekilde ifade etmiş ve hatta hicret eden ile etmeyen arasındaki velilik bağını dahi kopartmış ve şöyle buyurmuştur: \"İman edip hicret etmyenıer ise hicret edene kadar sizin onlarla hiçbir velayetiniz yoktur.\"[Enfal, 72] Mekke fethedilip, insanlar bütün kabilelerden İslama girince farz olan hicret kalktı ve müstehap olarak devam etti. el-Beğavt, Şerhu's-Sünne adlı eserinde şunları söylemektedir: Nebi efendimizin \"Fetihten sonra\" yani Mekke'den Medine'ye \"hicret yoktur\" hadisi ile \"hicretin ardı arkası kesilmez\" buyruğunun bir başka yolla telif edilme ihtimali de vardır. Bu da Müslüman olan kimse için Dar-ı Küfür'den, Dar-ı İslam'a hicret etme gereğinin kesilmeyeceği anlamındadır. el-İsmail1'nin şu lafızIa naklettiği rivayette İbn Ömer maksadı açıkça ifade etmiş bulunmaktadır: \"Mekke fethedildikten sonra Reslilullah Sallallahu Aleyhi ve Sellem'in yanına hicret etme emri sona ermiştir fakat kafirlerle savaşıldığı sürece hicretin ardı arkası kesilmeyecektir.\" Yani dünyada küfür diyarı bulunduğu sürece Müslüman olup da dini dolayısıyla fitneye maruz kalmaktan korkan kimseye oradan hicret etmek vaciptir. Bundan anlaşıldığına göre; dünyada Dar-ı Küfr'ün kalmadığı var sayılacak olursa, bunu gerektiren sebebin sona ermesi dolayısıyla hicret te sona erer. Doğrusunu err--iyi bilen Allah'tır. 3903- \"On yıl muhacir kald!.\" Yani muhacir olarak on yıl ikamet etti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 129
			}
		}
	]
}