{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "Suraka b. Malik b. Cu'şum'un kardeşinin oğlu olan Abdurrahmanb. Malik el-Müdlid'den rivayete göre o Suraka b. Cu'şum'u şöyle derken dinlemiştir: \"Kureyş müşriklerinin etrafa saldıkları adamlar bizlere de geldi. Resulullah Sallallahu Aleyhi ve Sellem ile Ebu Bekir'den her birisini öldüren veya esir alan kimse için müşrikler bir diyet miktarını mükafat olarak verceklerini söylemişlerdi. Ben Müdlic oğulları diye bilinen kavmimin meclislerinden birisinde oturmakta iken kavmimden bir adam geldi. Biz oturuyorken kendisi henüz ayakta iken: Ey Suraka dedi. Ben az önce sahilde bazı karartılar gördüm. Kanaatime görebu Muhammed ve arkadaşlarıdır. Suraka dedi ki: Ben onların kim olduklarını anladım, ama ona şunları söyledim: O senin gördüklerin onlar değildir. Senin gördüğün filan kişi ile filan kişidir. Az önce gözümüzün önünden geçip gittiler. Daha sonra o mecliste bir süre daha bekıedim. Sonra ayağa kalkıp eve girdim. Cariyeme atımı çıkarmasını, tepenin arkasında atımla beni beklemesini söyledim. Mızrağımı alıp evin arkasından çıktım. (Parlamasın diye) ucunu yerde sürterek sap kısmını da yukarıda tutarak gittim, Nihayet atıının yanına vardım ve atıma bindim. Beni onlara yaklaştırsın diye onu dört nala koşturdum. Nihayet onlara yaklaştım. Bu sefer atım tökezledi ve ben de üstünden düştüm. Düştüğüm yerden kalktım ve hemen elimi ok torbama uzattım. Oradan faloklarını çıkardım ve onlarla fal açtım, onlara zarar verecek miyim, vermeyecek miyim diye. Hoşuma gitmeyenısonuç çıktı. Ben de fal oklarının gösterdiği neticeye karşı çıkarak atıma bindim, ö beni onlara yaklaştırıp durdu. Nihayet Resulullah sallall€ıhu aleyhi ve sellem'in okumalarını işitmeye başladım. Etrafına dönüp bakmıyordu. Ebu Bekir ise etrafına çokça bakınıyordu. Atımın ön ayakları diz kapaklarına kadar yere gömüldü ve ben de attan düştüm. Daha sonra onu kalkmaya zorladım, o da kalkmaya çalıştı. Henüz ön ayaklarını çıkartamamıştım. Nihayet at güçlükle ayağa kalkmış ve ön ayaklarını battığı yerden çıkartmış idi ki ayakta durur durmaz ön ayaklarının iz bıraktığı yerden dumanı andıran bir gürültü göğe doğru yükseldi. Tekrar fal oklarıyla kısmet aradım, yine hoşuma gitmeyen sonuç çıktı. Bu sefer bana em an vermeleri için onlara seslendim. Onlar da durdular. Atıma binerek yanlarına gittim. Onlara ulaşmamı engelleyen bu hallerle karşılaşınca içimde Resulullah Sallallahu Aleyhi ve Sellem'in emrinin pek yakında üstün geleceği hissi uyandı. Bu sebeple ona dedim ki: Senin kavmin sana karşılık diyet veriyor. Onlara ayrıca insanların (Kureyş kafirlerinin) kendisine neler yapmak istediklerini haber verdim. Onlara azık ve ihtiyaçları olan eşyayı vermeyi teklif ettim, fakat benden bir şeyalmadılar ve hiçbir şey istemediler. Ancak bana şunu dedi(ler): Sen bizim halimizi sakla. Ben de ondan bana bir eman yazısı yazmasını istedim. Amir b. Fuheyre'ye emir verdi, o da bir deri parçasına (istediğim emanı) yazdı. Daha sonra Reso.lullah Sallallahu Aleyhi ve Sellem yoluna devam etti",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 131
			}
		}
	]
}