{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "Enes b. Malik r.a. dedi ki: \"Allah'ın Nebii Sallallahu Aleyhi ve Sellem Medine'ye Ebu Bekir'i terkisine bindirmiş olarak geldi. Ebu Bekir, (görünüşte) yaşlı ve tanınan birisi olduğu halde, Allah'ın Nebii Sallallahu Aleyhi ve Sellem ise genç ve kimse tarafından tanınmayan birisi idi. Herhangi bir adam Ebu Bekir ile karşılaşır ve: Ey Ebu Bekir, şu önündeki adam kimdir, diye sorardı. O da: Bu adam bana doğru yolu gösteriyor, diye cevap verirdi. (Enes) dedi ki: Kişi, Ebu Bekir'in bu sözleriyle yolu kastettiğini zannediyordu. Oysa onun kastettiği hayır yolu idi. Ebu Bekir dönüp baktığında arkalarından kendilerine yetişen bir adam görüverdi. Ey Allah'ın Resulü, işte bir atlı bize yetişti, dedi. Allah'ın Nebii ona doğru dönerek: Allah'ım, onu yere yık, diye dua etti. At onu yere düşürdü. Sonra da kalkıp homurdanmaya başladı. Ey Allah'ın Nebii, bana dilediğin emri ver, dedi. Yerinde dur ve kimsenin bize yetişmesine imkan verme, diye buyurdu. (Enes) dedi ki: Günün başlangıcında Allah'ın Nebi Sallallahu Aleyhi ve Sellem'e karşı mücadele veren birisi iken, günün sonunda onun lehine silah taşıyan birisi oldu. Resulullah Sallallahu Aleyhi ve Sellem el-Harre'nin yanına konakladı. Daha sonra Ensara haber gönderdi. Onlar da Allah'ın Nebii ile Ebu Bekir'in yanına geldiler. Her ikisine de selam vererek: Güvenlik içerisinde ve itaat edilenler olarak bininiz, dediler. Allah'ın Nebii ile Ebu Bekir bindi ve her ikisinin de etrafını silahlarıyla kuşattılar. Medine'de, Allah'ın Nebii geldi, Allah'ın Nebii geldi, diye sesleniidi. Onlar da çıkıp seyretmeye ve Allah'ın Nebii demeye koyuldular. Nebi geldi ve nihayet Ebu Eyyub'un evinin yakınında konakladı. O (Nebi) aile halkıyla konuşurken, Abdullah b. Selam da ailesine ait bir hurma bağında onlar için hurma toplamakta iken onun geldiğini işitti. Elini çabuk tutarak onlar için topladıklarını orada koymaya çalıştı. Fakat topladığı hurmalar(ı bir yere koyamadan) beraberinde olduğu halde geldi. Allah'ın Nebiinden söylediği sözleri dinledikten sonra aile halkının yanına geri döndü. Allah'ın Nebii Sallallahu Aleyhi ve Sellem, bizim akrabalarımızın hangisinin evi daha yakındır diye sordu. Ebu Eyyub: Benim ey Allah'ın Nebii! İşte şu evim, şu da benim kapım dedi. Allah Resulü: O halde kalk git de öğle vakti dinlenelim diye bizim için bir hazırlık yap dedi. Ebu Eyyub: O halde Allah'ın bereketi üzere kalkınız dedi. Allah'ın Nebii sallallahu aleyhi ve selle m gelince Abdullah b. Selam da gelip: Şahadet ederim ki sen Allah'ın Resulüsün ve şüphesiz sen hak ile geldin. Yahudiler de biliyor ki ben onların efendisiyim, efendilerinin oğluyum. Onların en bilgilisiyim, onların en bilgilisinin oğluyum. Onları çağır ve benim Müslüman olduğumu bilmeden önce benim hakkımda onlara soru sor. Çünkü onlar benim Müslüman olduğumu bilecek olurlarsa bende olmayan şeyleri hakkımda söylerler, dedi. Bunun üzerine Allah'ın Nebii (Yahudilere) haber gönderdi. Onlar da gelip huzuruna girdiler. Resulullah Sallallahu Aleyhi ve Sellem onlara: Ey Yahudiler toP-o luluğu! Veyl olsun sizlere! Allah'a karşı takvalı olunuz. Kendisinden başka hiçbir ilah olmayan Allah adına yemin ederim ki şüphesiz sizler benim hak olarak Allah'ın Resulü olduğumu ve benim hakkı getirdiğimi biliyorsunuz. Haydi Müslüman olunuz, dedi. Onlar: Biz bunu bilmiyoruz dediler. Evet, Nebi sallaW\\hu aleyhi ve sellern'e böyle dediler. b da bu sözlerini üç defa tekrarladı. Aranızda Abdullah b. Selam nasıl bir adamdır dedi. Onlar: O bizim efendimizdir, efendimizin oğludur, en alimimizdir, en alimimizin oğludur, dediler. Allah Resulü: Müslüman olmasına ne dersiniz diye sordu. Onlar: Asla, Allah için o, Müslüman olacak birisi değildir. Yine sordu: Müslüman olursa ne dersiniz? Yine onlar: Asla, Allah körusun, o Müslüman olacak birisi değildir. Yine: Ya Müslüman olursa ne dersiniz diye sordu. Onlar: Asla, Allah için o Müslüman olacak değildir, dediler. Allah Resulü: Ey İbn Selam onların yanına çık, diye buyurdu, o da çıktı ve şunları söyledi: Ey Yahudiler, Allah'a karşı takvalı olunuz. Kendisinden başka hiçbir ilah olmayan Allah'a yemin ederim ki şüphesiz sizler onun Allah'ın Resulü olduğunu ve onun hakkı getirdiğini biliyorsunuz. Yahudiler: Yalan söylüyorsun dediler. Resulullah Sallallahu Aleyhi ve Sellem onları dışarı çıkardı.\" Fethu'l-Bari Açıklaması: \"Ebu Bekir (görünüşte) yaşlı idL\" Saçlarının ağarmış olduğunu kastetmektedir. \"Tanınıyordu\" çünkü o ticaret için yaptığı yolculuklarında Medinelilere uğrayıp gidiyordu. Oysa her iki hususta da Nebi sallallahu aleyhi ve sellern'in durumu ondan farklı idi. Uzun bir süreden beri Mekkelden dışarıya yolculuk yapmamıştı. Saçları da ağarmamıştı. Yoksa hakikatte Nebi sallallahu aleyhi ve sellern Ebu Bekir'den yaşça daha büyüktür. \"Allah'ın Nebii ise gençti ve tanınmıyordu.\" Ebu Bekir r.a. ile ilgili olarak Müslim'in Sahihlinde Muaviye'den sabit olan rivayete göre 63 yıl yaşamıştır. Nebi sallallahu aleyhi ve sellerniden sonra ise iki yıl ve birkaç ay yaşamıştır. O halde Ebu Bekir'in yaşı ile ilgili olarak sahih kabul edilen görüşe göre onun Nebi sallallahu aleyhi ve sellerniden iki yaştan daha fazla bir süre küçük olması gerekir. \"Bana yol gösteriyor\" ifadesi ile ilgili olarak bunun sebebini İbn Sa'd zikretmiş olduğu bir rivayetinde şöylece açıklamaktadır: \"Nebi sallallahu aleyhi ve sellern Ebu Bekir'e: İnsanların dikkatini benden başka tarafa çek, demişti. Bundan dolayı ona: Sen kimsin diye sorulduğunda, ben bir ihtiyacın peşindeyim derdi. Bu beraberindeki kim diye sorulunca da, bu bana yolu gösteren bir rehberdir, derdi.\" Bununla dinde doğru yolu, hidayeti kastediyordu. Ona soru soran kişi ise onu kılavuz ve yol gösterici zannediyordu. \"Öğle vakti dinlenelim diye hazırlık yap.\" Yani öğlenleyin dinleneceğimiz (kayllile yapacağımız) bir yer hazırla bize",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 136
			}
		}
	]
}