{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3915,
			"arabicnumber": 3915,
			"text": "Ebi Musa el-Eş'ari'nin oğlu Ebu Burde dedi ki: \"Abdullah b. Ömer bana: Benim babamın senin babana ne dediğini biliyor musun, diye sordu. Ben: Hayır dedim. Dedi ki: Babam (Ömer) baban (Ebu Musa'y)a dedi ki: Ey Ebu Musa, Resulullah sallallahu aleyhi ve selle m ile birlikte Müslüman oluşumuz, onunla beraber hicret edişimiz, onunla beraber cihad edişimiz ve bütün amelimizin bizim için (ecri itibariyle) sabit olması ve devam etmesi seni sevindirir mi? Buna karşılık ondan sonra yapmış olduğumuz her bir amelden lehimize de, aleyhimize de olmaksızın başa baş çıkmamız (hoşuna gider mi?) Bunun üzerine babam dedi ki: Allah'a yemin ederim ki hayır. Biz Resulullah Sallallahu Aleyhi ve Sellem ile sonra da cihad ettik, namaz kıldık, oruç tuttuk, pek çok hayır işledik. Bizim elimizle pek çok insan Müslüman oldu. Şüphesiz bizler bunları (ecirlerini) ümit ederiz. Bunun üzerine babam (Ömer) dedi ki: Bana gelince Ömer'in canı elinde olana yemin ederim ki, o dediklerimizin ecrinin bize baki kılınıp verilmesini, daha sonra yaptığımız her bir işten de vebalsiz başa baş kurtulmuş olmayı çok arzu ederim. (Ebu Musa'nın oğlu Burde der ki): Ben de bunun üzerine: Allah'a yemin ederim şüphesiz senin baban, benim babamdan daha hayırlıdır, dedim.\" Fethu'l-Bari Açıklaması: \"Dedim ki\" diyen kişi (Ebu Musa'nın oğlu) Ebu Burde'dir. Bu sözleriyle İbn Ömer'e hitap ederek Ömer r.a.'ın sözü geçen bu bakımdan babası Ebu Musa r.a.'dan hayırlı olduğunu kastetmiştir. Bununla birlikte kabul edilen şu ki; Ömer bütün kesimlere göre Ebu Musa'dan faziletlidir. Fakat fazilet itibariyle daha alt mertebede olan bazı kimselerin mutlak olarak faziletli olmayı gerektirmeyen bir hasletle daha üstün faziletlilerden o noktada faziletli olmalarına mani yoktur. Bununla birlikte Ömer sözü geçen bu haslet itibariyle de Ebu Musa'dan daha faziletlidir. Çünkü havf makamı, reca makamından daha faziletlidir. İnsanoğlunun yapmak istediği her hayırlı işlerde kusmdan uzak kalamayacağı bilinen bir husustur. Ömer bu sözlerini nefsini bastırmak için söylemiştir. Yoksa onun faziletler ve kemalat bakımından işgal ettiği makam, ayrıca zikretmeye gerek bırakmayacak kadar meşhurdur",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 140
			}
		}
	]
}