{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "Ebu İshak dedi ki: \"Bera'yı şöyle derken dinledim: Ebu Bekir, Azib'den bir eğer satın aldı. Ben de onu onunla birlikte taşıdım. (el-Bera) dedi ki: Azib ona Resulullah Sallallahu Aleyhi ve Sellem'in yol alışı hakkında sordu. Dedi ki: O bizim yolu gözetlememizi söyledi. Geceleyin yola çıktık. O gecemizi ve gündüzümüzü hızlıca yürüyerek geçirdik. Nihayet öğle sıcağı iyice bastırdı. Sonra bir kaya gördük. Onun yanına vardık, bir parça gölgesi vardı. (Ebu Bekir) dedi ki: Resulullah Sallallahu Aleyhi ve Sellem'e beraberimde bulunan bir postu serdim. Daha sonra Nebi Sallallahu Aleyhi ve Sellem üzerine yattı. Ben de etrafında bulunanları silkelemeye (temizlemeye) koyuldum. Derken bir çobanın koyunları ile birlikte bizim kayanın yanına geliş amacımızın aynısıyla geldiğini gördüm. Ona: Ey genç, sen kiminsin diye sordum. Ben filanım dedi. Ona: Koyunlarında süt var mı diye sordum, evet dedi. Ona: Sen süt sağar mısın diye sordum. Evet, dedi. Koyunlarından birisini tuttu. Ona: Memesini iyice temizle, dedim. ' (Ebu Bekir) dedi ki: Bir miktar süt sağdı. Beraberimde ise Resulullah sallall€ıhu aleyhi ve sellem için daha önceden hazırlamış olduğum bir bezin üzerinde bulunduğu bir su matarası vardı. Sütün dibi soğuyuncaya kadar üzerine döktüm. Sonra onu Nebi Sallallahu Aleyhi ve Sellem'e götürdüm. İç ey Allah'ın Resulü dedim. ResuluIlah Sallallahu Aleyhi ve Sellem ben hoşnut oluncaya kadar içti. Sonra da takip edenler peşimizde olduğu halde yolumuza koyulduk.\" [-3918-] Bera’ dedi ki: \"Ebu Bekir ile birlikte ailesinin yanına girdim. Kızı Aişe'nin hummaya tutulmuş olduğu halde yattığını gördüm. Babasının yanağını öptüğünü ve nasılsın kızcağızım dediğini gördüm.\" Fethu'l-Bari Açıklaması: \"Ona babasından önce hicret ettiği söylenince kızıyordu.\" Yani az önce geçtiği gibi, o ancak babasıyla birlikte hicret etmiş idi. \"Ben ve Ömer Resulullah Sallallahu Aleyhi ve Sellem'in huzuruna gittik.\" Bey'at esnasında kastetmektedir. Muhtemelen bu Rıdvan bey'atidir. \"Koşarak\" (hervele) yavaş yürümek ile koşmak arasındaki bir yürüyüştür. \"el-Bera dedi ki: Ebu Bekir ile birlikte ailesinin yanına girdim. Kızı Aişe'nin hummaya tutulmuş olarak yatmış olduğunu gördüm. Babasının yanağını öperek nasılsın kızcağım dediğini gördüm.\" \" . el-Bera'nın Ebu Bekir r.a.'ın ailesinin yanına girmesi kesinlikle hicabın (mu'minlerin annelerinin perde arkasında saklanma emrinin) inişinden önce olmuştur. Aynı sırada o dönemde kendisi de henüz buluğa ermemişti, Aişe r.anha da böyle",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 142
			}
		}
	]
}