{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3923,
			"arabicnumber": 3923,
			"text": "Ebu Said r.a. dedi ki: \"Bir bedevi Nebi Sallallahu Aleyhi ve Sellem'e gelerek ona hicret hakkında sordu. Şöyle buyurdu: Ne oluyor sana, hicretin işi ağırdır. Senin develerin var mı, diye buyurdu. Bedevi: Evet dedi. Peki, onların zekatını veriyor musun diye sordu. Bedevi: Evet dedi. Peki, ondan bağışlarda bulunuyor musun, diye sordu. Evet, dedi. Suya gittikleri gün onları sağıyar musun, diye sordu. Evet, dedi. Allah Resulü şöyle buyurdu: Sen (istersen) denizlerin ötesinden amel et. Şüphesiz Allah senin amelinden hiçbir şeyini eksiitmez.\" Fethu'l-Bari Açıklaması: \"(Ağaran saçlarını) örttü.\" Yani kınaladı. Kasıt da sakalıdır. \"Ketem\" Küçük kayalarda yetişen ve ince iplikleri sarkan. saçı kınalamak için kullanılan ve mersin ağacını andıran bir yapraktır. Toplanması oldukça zordur. Bundan dolayı da pek azdır. \"Ashabının en yaşlısı Ebu Bekir idi.\" Daha önceden de geçtiği üzere, o sırada ve ondan önce Medine'ye gelmiş olanlar arasında demektir. \"Nihayet saçları kırmızılaştı.\" Saçlarının kırmızı rengi oldukça arttı. \"Kureyş kafirleri için mersiye okuyan.\" Bedir günü öldürülüp, Nebi Sallallahu Aleyhi ve Sellem onları suyu kurumuş olan kuyuya attığı vakit bu mersiye söylenmişti. \"eş-Şıza\" İçine tirit yapılan ahşap tencere ve çömleklerin yapıldığı bir ağaçtır. Şair şunu söylemiş gibidir: Deve hörgüçlerinin etleriyle dolup taşan o tencere sahiplerinden kuyuda olanların hali nedir? Çünkü cahiliye Arapları çokça yemek yediren kimseye (tencere anlamındaki) \"cefne\" derlerdi. Buna sebep ise o kap ile insanlara çokça yemek yedirmesi idi. \"Baykuşlar. .. \" Şair bu sözleriyle ölümden sonra dirilişi inkar etmek istemiştir. İnsan böyle bir kuşa benzedikten sonra nasıl bir defa daha insan olarak diriltilebilir, demek istemiştir",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 148
			}
		}
	]
}