{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "Bize Abdullah ibn Mesleme tahdîs etti: Bize Abdulazîz, babası Ebû Hâzim'dan tahdîs etti ki, Sehl ibn Sa'd(radıyallahü anh) şöyle demiştir: İslâm târihine başlangıç ta'yin ederlerken, sahâbîler, bu başlangıcın Peygamber'in peygamber gönderildiği zamandan veya vefatı ânından i'tibâr edilmesi hususunda sayılıp dökülen görüşlerden hiçbirine kıymet vermediler. Yalnız Peygamber'in Medine'ye gelmesi ve hicreti vaktinden başlamasına i'tibâr ettiler. Târîh Başlangıcının Kur'ân'dan Alınışı (581/1185), \"İlkgününden...\" (et-Tevbe: 108) âyeti hakkında şöyle dedi: \"Bu âyette fıkıh, yânı ilim yönünden, Omer (radıyallahü anh) 'nin târîh başlangıcı hususunda kendileriyle istişare ettiği zaman bütün sahâbîlerin Omer ile beraber üzerinde ittifak ettikleri başlangıcın sahîhliği vardır. Onların re'yleri târihin hicret yılından olması(fikri) üzerinde ittifak etti. Çünkü o yıl, İslâm'ın izzet bulduğu, Peygamber'in emniyette (yani korkusuz) olduğu, mescidlerin bina edildiği yıldır. İşte onların bu hicret yılını târîh başlangıcı yapma görüşleri tenzilin zahirine uygun düşmüştür. Şimdi biz onların bu fiilleriyle Yüce Allah'ın \"Min evveli yevmin\" kavlindeki \"İlk gün\"ün, zaman ta'yîni kendisiyle yapılagelen(hicrî) târih günlerinin birincisi olduğunu anladık. Eğer sahâbîler bunu bu âyetten aldılarsa, bu onlardaki bir ilimdir. Çünkü sahâbîler, Kitâbullah'ın te'vîlini en iyi bilen ve Kur'ân'daki işaretleri en iyi anlayan kimselerdir, Şayet bu bir re'y ve ictihâdla olduysa, muhakkak ki Allah onu, yapılmasından önce hissettirip belli etmiş ve doğru olduğuna işaret eylemiştir. Çünkü bilinen bir yıla yahut bilinen bir aya yahut bilinen bir târîhe izafe etmeden \"Ben onu ilk gün yaptım\" diyen bir kimsenin bu sözü ma'kûl olmaz. Halbuki burada ma'nâda o belli târîhe olandan başka hiçbir izafet yoktur. Çünkü ne lâfız, ne de hâl karinesi olarak başkasına delâlet edici karineler yoktur. bunu iyi düşün, iyi anla. Çünkü bunda hatırda tutup ezberleyen için taaccüble ibret ve öğüt alınacak birşey, gönül gözüyle gören ve iyice görüp bilmek isteyen kimse için de bir ilim vardır.\" Günü sonra kamerler doğacak. Her kamerî seneden sonra bir kamerî sene gelecektir. Zaman dâiresi döndükçe, her görünüşünde sanki yeryüzünün tek noktasına işâret edecek, ışıklarını oraya tutup, orayı gösterecektir. Orası Hicret Mağarası'dır! kamer her dönüşünde o günün, Muhammed'in en güzel günü olduğunu gösterecektir. Çünkü \"gün\"ler içinde risâletine en fazla delâlet eden gün, o gün; inancının en mes'ûd günü, kalbinin en fazla ümîdle dolduğu gün, o gündür. o gün, müslümânların tereddüd etmeden, düşünmeden ve kendilerine işaret edilmeden takvimlerinin başlangıcı olarak kabul ettikleri gündür. târih başlangıcı niçin Hicret Günü'dür de da'vete ilk başlandığı gün değildir? Ve niçin Bedir günü veya Hz. Muhammed aleyhi's-selâmm doğum günü veya Veda Hacci günü târih başlangıcı değildir? görünüşe göre ilk bakışta bu günler tebcile ve târîh başlangıcı olmaya, canını ve îmânını kurtarmak için karanlıkların örtüsüne, himayesine sığınarak terki diyar etme gününden daha lâyıktır, diye düşünürüz. târîh başlangıcı olarak Hicret Günü'nü seçen adam, \"Akîde, îmân. ve edebiyat\" mefhûmlarına bütün tarihçilerden ve başka görüşte olan mütefekkirlerden hem daha vâkıftır, hem mes'elenin ruhunu ve hikmetini anlamıştır. Çünkü inançlar, her bakımdan zorluklarla ölçülür, kurtuluş ve gâlibiyyetlerle değil! Çünkü dîn gâlib geldiği, da'vet netice verdiği zaman herkes îmân eder. Fakat hakka, hakîkate bağlanan ve zâtında îmânının zaferi tecellî eden insan, zorluk ânında da îmân edip etrafından başına gelecek belâları da hesaba katarak yola çıkan insandır. Onun için, Hz. Peygamber'in hicret ettiği gün, târîh başlangıcı olmaya başka günlerden daha lâyıktır; âyetin ifâdesine bakınız: O'nu Mekke'den çıkardıkları zaman bizzat Allah O'na yardım etti. O, o zaman ikinin ikincisi idi. Onlar mağarada iken Peygamber arkadaşına: Tasalanma, muhakkak Allah bizimle beraberdir, diyordu. Allah O'nun üzerine sekînetini (ma'nevî kuvvetlerini) indirmiş, O'nu sizin görmediğiniz ordularla te'yîd etmiş, kâfirlerin kelimesini alçaltmıştı. Allah'ın Kelimesi ise: O en yücedir. Allah mutlak gâlibdir, yegâne hüküm ve hikmet sahibidir\" (et-Tevbe: 40). Önceki takvimin, Peygamber zamanında da tabiî olarak takvîm olması gerektiğini söyleyen söylesin, \"Hicretten maksad Medine'ye gitmekti (?). Onun için Medine'ye gidildiği gün târîh başlangıcı olmalıdır, çünkü o gün fevkalâde bir gündür\" desin... Ne denirse denilsin, şu kesindir ki, Kur'ân’ın açıkça belirttiği \"Zafer târihi\", O'nun Mağara'da \"İkinin ikincisi\" olduğu gündür. açık kalbli Hattâb oğlu Omer ki -ister târîh başlangıcını tesbît eden o olsun, ister yapılan tesbîti kabul etmiş bulunsun, müsâvîdir- târîh günü olarak gözlerini \"Sevr\" Mağarası'na dikti ve ayırmadı. Ne Medine'ye giriş gününü, ne Bedir zaferini, ne İran'ın fethi gününü târih başlangıcı olarak seçti! Sabit nazarla baktığı tek nokta \"Görmediğiniz ordular...\" idi. Şimdi onları biz de görüyoruz. ilk da'vet günü de İslâm'ın ilk günü değildir. Çünkü İsâ'nın doğumunun Hristiyânlığın mu'cizesi olduğu gibi, Muhammed'in doğumu İslâm'ın mu'cizesi değildir. Çünkü Muhammed doğumunda da bizim gibi bir beşerdir. Fakat o ilk da'vet gününde de, da'vetin semere verip O'nun efendiliğini izhâr ettiği günde de ve o da'vetin sahibinin ve arkadaşı Sıddîk'ın kalbinde ilk ağır imtihanını geçirdiği gün de, Mağara'da iki kişilerken de Peygamber'in Efendisi idi. ve dînlerin târih başlangıçları böyle tesbît edilir. En zor günü ilk târîh günüdür. Garnîmetlerin alındığı, fetihlerin yapıldığı gün değil. Çünkü bunlar kalblerde basit, küçük sevinçler doğuran şeylerdir. O hâlde bir zaman, sâdece kalblerde gizli iken bir lâhzada güneş gibi zuhur ettiği ânı iyi tesbît etmemiz lâzımdır. Bir zamanlar inkâr edilirken varlığı ortadan kaldırılmağa çalışılırken, artık bugün kalblerin derinliklerinde yerleşmiştir. ve Ümîd Günü: Mağara günü, Rasûlüllah'ın günleri arasında hiç bir zaman unutamadığı, o muazzam sabrını gösterdiği ve özellikle üzüntü, hayret ve bekleyiş günüydü. İmân günü, ümîd günüdür. İçinde bulunduğu anda gönül huzuru olmayan insanın nazarlarını istikbâle çevirdiği gündür. Hiçbir insanını memnun edemeyen âlemin ümîdle beklediği gün... Âlemde hüzün ve hayret (şaşırma) ağır bastığı zaman, mutlakaa uzakta, gözlerden uzak, gizlenmiş birşey var demektir. Evet, mutlakaa gizlenmiş... Çünkü bütün bir kâinat, bütün bir insanlık âlemi ruhunu tatmin edecek bir îmân manzumesi aramaktadır. Bu sebeble îmân, istikbâl. içindir. Bundan dolayı da müstakbel, îmânın olacaktır. Ve ümîdle bekliyoruz: Bütün insanlık, tesellisini \"Mağara Gününün Sâhibi\"nden bulacak, şayet O'nu tanırsa, insanca bir hayâta kavuşacaktır",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 159
			}
		}
	]
}