{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "Aişe r.anha dedi ki: \"Namaz iki rekat olarak farz kılındı. Daha sonra Nebi Sallallahu Aleyhi ve Sellem hicret etti, dört rekat olarak farz kılındı. Sefer (yolcu) namazı ise önceki hali gibi bırakıldl.\" Fethu'l-Bari Açıklaması: \"Tarih\" Cevheri der ki: Tarih, vaktin tarif edilmesi demektir. \"Tarihi nereden başlattılar.\" O bu ibareleriyle bu husustaki görüş ayrılıklarına işaret etmiş gibidir. es-Süheyll'nin belirttiğine göre ashab-ı kiram tarihi yüce Allah'ın şu buyruğundan hareket ederek hicret ile başlatmışlardır: \"İlk gününden temeli takva üzere kurulan mescid içinde (namaza) durman, elbette daha layıktır. \"[Tevbe, 108] Bilindiği gibi buradan kasıt, mutlak olarak ilk gün değildir. Böylelikle bunun zikredilmemiş bir şeye izafe edildiği ortaya çıkmaktadır. Bu ise yüce Allah'ın İslamı aziz kılıp güçlendirdiği, Nebi s.a.v.'in Rabbine güvenlik içerisinde ibadet ettiği ilk zamandır. Bu zamanda mescidi bina etmeye başlamıştır. Bu sebeple ashab-ı kiram da tarihi o günden başlatmayı uygun görmüşlerdir. Onların bu uygulamalarından yüce Allah'ın \"ilk günden\" ibaresinden İslam tarihinin ilk günü ibaresi anlaşılmıştır. (Evet, es-Süheyll) böyle demektedir. Hatıra ilk gelen ise yüce Allah'ın: \"İlk gününden\" buyruğunun Nebi s.a.v.'in ve ashabının Medine'ye ilk girdikleri gün olduğudur. Doğrusunu en iyi bilen Allah'tır. \"Medine'ye gelişinden\" yani geliş zamanından kastettiği, geldiği ay değildir. Çünkü tarih başlangıcı senenin başından itibarendir. Bazıları tarihi hicret ile başlatmanın bir münasebetle olduğunu da açıklayarak şöyle demektedir: Nebi s.a.v. ile ilgili tarihe başlangıç olarak alınması mümkün olan hususlar doğumu, ona Nebiliğin verilmesi, hicreti ve vefatı olmak üzere dört husustur. Onlar tarihi hicretten başlatmanın daha uygun olduğunu gördüler. Çünkü doğum ve Nebilik tarihlerinin yılolarak tayin edilmesi halinde ihtilaftan kurtulmak mümkün değildi. Vefat tarihini kabul etmeyişlerinin sebebi ise, vefatının sözkonusu edilmesiyle birlikte onun için üzüntünün tazeleneceğidir. Bundan dolayı tarihe başlangıç olarak sadece hicretin alınabileceği ortaya çıkmış oldu. Rebiu'l-ewel ayından Muharrem ayına ertelemelerinin sebebine gelince, hicret etme kararının Muharrem ayında verilmiş olmasıdır. Çünkü bey'at Zülhicce'de gerçekleşmiştir. Sözkonusu beyfat (Akabe beyTatil ise hicretin bir mukaddimesi durumundadır. Bu nedenle bey'atten sonraki ilk ay ve hicrete karar verilen ay, Muharrem ayı oldu. Bundan dolayı Muharrem ayının başlangıç kabul edilmesi uygun görülmüştür. Bu, benim Muharrem ayını başlangıç olarak kabul edilmesi ile gördüğüm açıklamaların en güçlü olanıdır. 49. NEBİ S.A.V.'İN: \"ALLAH'IM, ASHABIMIN HİCRETLERİNİ KABUL BUYUR\" DİYE DUASI VE MEKKE'DE ÖLEN KİMSELER İÇİN AĞITTA BULUNMASI)",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 160
			}
		}
	]
}