{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"63": "Merits of the Helpers in Madinah (Ansaar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "Humeyd et-Tavîl şöyle demiştir: Enes ibn Mâlik (radıyallahü anh) bize şöyle tahdîs etti: Peygamber (sallallahü aleyhi ve sellem)'in Medine'ye gelmesi haberi Abdullah ibn Selâm'a erişti de, o hemen Peygamber'e geldi ve O'na birtakım şeyler soruyordu. Abdullah: Ben Sana üç şey soracağım ki, bunların cevâblarını ancak bir peygamber bilebilir: Kıyâmet alâmetlerinin evvelkisi nedir? Cennet ahâlîsi(cennete girdiklerinde) ilk önce hangi yemeği yiyecekler? Çocuğun hâli nedir? Çocuk babasına yahut anasına benziyor (ve onlardan birinin soyuna çekiyor)? Dedi. \"Bu senin sorduğun soruları biraz önce Cibril gelip bana haber verdi\" buyurdu. Cibril, melekler arasında Yahûdîler'in düşmanıdır, dedi. Peygamber cevâba başlayıp: \"a. Kıyâmet alâmetlerinin en öncesi bir ateştir ki, o, insanları doğu taraftan batıya sürüp toplar. Cennet ahâlîsinin yiyeceği ilk yiyecek maddesi ise balık ciğerinin (sarkmış olan) fazlasıdır. Çocuğa gelince, (cinsî münâsebet esnasında) erkeğin suyu, kadının suyu önüne geçerse çocuğu kendi soyuna çeker; eğer kadının suyu erkeğin suyu önüne geçerse kadın çocuğu kendi soyuna çekip benzetir\" buyurdu. Eşhedu en lâ ilahe illallâhu ve ennekeRasûlüllah{ = Ben Allah'tan başka ilâh olmadığına ve Sen'in de muhakkak Allah'ın Rasûlü olduğuna şehâdet ederim), dedi. devamla şöyle dedi: Yâ Rasûlallah! Yahûdîler, insanı hayrette bırakacak surette yalan söyleyen, asılsız isnâd ve iftiralarda bulunan haksız bir millettir. (Benim müslümân olduğumu duyunca, türlü yalanlar uydurup iftirada bulunurlar.) İslâm'a girişimi bilmelerinden önce beni onlardan sorup, mevkiimi tasdik ettir, dedi. Abdullah'ı bir yere gizledi.) Akabinde Yahûdî zümresi geldi. Peygamber onlara: \"İçinizdeki Abdullah ibn Selâm nasıl bir kişidir?\" diye sordu. O bizim hayırlımız ve hayırlımızın oğludur. Yine o bizim en faziletlimiz ve en faziletlimizin oğludur, dediler. tezkiye üzerine Peygamber: \"Abdullah ibn Selâm müslümân olursa ne dersiniz?\" diye sordu. İslâm'a girmekten onu Allah'a sığındırırız, dediler. Peygamber bunu Yahûdîler'e tekrar sordu. Onlar da evvelki gibi cevâb verdiler. Bunun üzerine Abdullah evden onların yanına çıktı da: Eşhedu en lâ ilahe illellahu ve enne Muhammeden Rasûlüllah{ = Allah'tan başka ilâh olmadığına veMuhammed'in Allah'ın Elçisi olduğuna şehâdet ederim), dedi. defa da Yahudiler: bizim şerrlimiz ve şerrlimizin oğludur, dediler ve İbn Selâm'ın kadrini eksiltmeye çalıştılar. Abdullah: Yâ Rasûlallah, işte korkmakta olduğum bu söyledikleri idi, dedi",
			"grades": [],
			"reference": {
				"book": 63,
				"hadith": 163
			}
		}
	]
}