{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3939,
			"arabicnumber": 3939,
			"text": "Abdurrahman b. Mut'im dedi ki: \"Benim bir ortağım pazarda vadeli olarak birkaç dirhem sattı. Ben: Subhanallah, bu uygun mudur dedim. O da: Subhanallah, Allah'a yemin ederim ben bunu pazarda sattım fakat kimse beni ayıplamadı, dedi. Bunun üzerine ben de Bera b. A'zib'e sordum. Şöyle dedi: Biz bu şekilde alışveriş yaptığımız halde iken Nebi Sallallahu Aleyhi ve Sellem (Medine'ye) geldi ve şöyle buyurdu: Elden ele yapılan alışverişIerde bir beis yoktur. Fakat vadeli olanlar uygun olmaz. Sen yine de Zeyd b. Erkam'ın yanına git. Ona sor, çünkü aramızda ticareti en büyük olan o idi. Zeyd b. Erkam'a sordum, bana onun dediği gibi dedi.\" Bir seferinde de Süfyan dedi ki: \"Dedi ki: Nebi Sallallahu Aleyhi ve Sellem biz alışveriş yapıyor iken Medine'ye yanımıza geldi. .. Ayrıca: Mevsime ya da hacca kadar vadeli olarak, demiştir.\" Fethu'l-Bari Açıklaması: \"Kıyametin ilk alameti, onları doğudan batıya doğru toplayacak bir ateş olacaktır.\" İleride Rikak (kalbi yumuşatıcı hadisler) bölümünün sonlarına doğru buna dair yeterli açıklamalar gelecektir. \"Cennetliklerin ilk yiyeceği yemek balığın kara ciğerinin ziyadesi olacaktır.\" Ziyade ciğere asılı fakat ondan bağımsız bir fazlalıktır. Yiyecek olarak çok lezzetlidir. Onun en rahat yenilen ve en güzel sindirilen yemek olduğu da söylenir. \"Çocuk ... a benzer\" Müslim'de Aişe yoluyla gelen hadiste: \"Erkeğin suyu kadının suyundan daha üste çıkarsa amcalarına benzer. Kadının suyu erkeğin suyundan üste çıkarsa dayılarına benzer\" denilmektedir. \"İftiracı bir kavimdirIer.\" (Buhtan edenler anlamındaki \"buht\" kelimesinin tekili), uydurduğu iftira dolayısı ile karşısındaki dinleyeni dehşete düşüren kimse demektir. \"Benim bir ortağım pazarda vadeli olarak bir kaç dirhem sattı.\" Buna dair açıklamalar daha önce Ortaklık bölümünde (2497. hadiste) geçmiş bulunmaktadır. Burada hadisten maksat, sahabenin zikrettiği: \"Biz ... alışveriş yaparken Nebi Sallallahu Aleyhi ve Sellem yanımıza Medine'ye geldi\" sözüdür. Bundan anlaşıldığına göre o istisna ettiği türler dışında onları yapar bulduğu muamelata itiraz etmemiştir. İstisna ettiği hususları da onlara açıklamıştır",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}