{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3953,
			"arabicnumber": 3953,
			"text": "İkrime, İbn Abbas'tan rivayetle dedi ki: Nebi Sallallahu Aleyhi ve Sellem Bedir günü şöyle buyurdu: \"Allah'ım, ben bana olan ahdini ve vadini gerçekleştirmeni diliyorum. Allah'ım dilersen sana ibadet olunmaz. Ebu Bekir elinden tutarak, bu kadarı sana yeter, dedi. Dışarıya, \"Pek yakında bu topluluk bozguna uğrayacak ve arkalarını dönerek kaçacaklardır\"[Kamer, 45] diyerek çıktı.\" Fethu'l-Bari Açıklaması: \"Ona denk görülen\" dünyevi hususlar arasında ağırlığı ile ona denk düşebilecek her şey, demektir. Sevap olarak ona denk görülen şeyler diye açıklandığı gibi, maksadın bundan daha genelolması da mümkündür. Bundan maksat, bu konumun ne kadar büyük olduğunu ileri derecede ifade etmektir. Aynı zamanda eğer kendisi böyle bir konumda bulunmak ile ne olursa olsun buna denk düşecek bir şeyi elde etmek arasında muhayyer bırakılacak olsaydı, böyle bir konumda bulunmuş olmayı tercih edecekti. \"İbn Abbas dedi ki: Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu:\" Bu ashab-ı kiramlın rivayet ettiği mürsellerdendir .. Çünkü İbn Abbas orada bulunmamıştı. Muhtemelen bunu Ömer'den ya da Ebu Bekir 'den rivayet etmiştir. Müslim'deki rivayete göre İbn Abbas dedi ki: Bana Ömer anlattı: \"Bedir günü olunca, Resulullah s.a.v. müşriklere baktı. Onların bin kişi, ashabının ise üçyüz ondokuz kişi olduğunu gördü. Kıbleye yöneldi, sonra ellerini uzattı. Ridası omuzlarından düşünceye kadar Rabbine niyaz edip durdu.\" Said b. Mansur dedi ki: \"Bedir günü Resulullah Sallallahu Aleyhi ve Sellem müşriklere ve onların sayıca çokluklarına bir de Müslümanlara baktı ve onların sayıca az olduklarını gördü. İki rekat namaz kıldı. Ebu Bekir de sağında ayakta durdu. Resulullah sallalli3hu aleyhi ve sellem namazda iken şöyle dua etti: Allah'ım beni bırakma! Allah'ım benden yardımın! esirgeme! Allah'ım beni eksik düşürme! Allah'ım senden bana vadini gerçekleştirmeni niyaz ediyorum.\" İbn İshak'da da Nebi efendimizin şöyle dua ettiği belirtilmektedir: \"Allah'ım, işte Kureyş! Büyüklenişiyle, böbürlenişiyle, Resulünü yalanlayarak ve (hakka karşı) mücadele ederek geldi. Allah'ım, senden bana vaat ettiğin yardımını diliyorum.\" \"Allah'ım senden ... diliyorum.\" Taberanı'de hasen bir senetle İbn Mesud'un şöyle dediğini rivayet etmektedir: \"Bizler Bedir günü Muhammed'in Rabbine: Allah'ım, ben senden bana olan vaadini gerçekleştirmeni niyaz ediyorum, diye seslenişinden, daha ileri derecede kaybettiği bir şeyi yüksek sesle arayan kimsenin seslenişini duymuş değiliz.\" es-Süheyll der ki: Nebi sallalli'ıhu aleyhi ve sellem'in bu kadar ileri derecede yüce Allah'a yalvarıp yakarması ve kendini yormasının sebebi, meleklerin savaşmak için oldukça gayret gösterdiklerini, Ensarın ölüm deryalarına daldıklarını görmüş olmasından dolayıdır. Cihad da kimi zaman silah ile kimi zaman dua etmek ile olur. İmamın, ordunun arkasında olması da sünnetin bir gereğidir.. Çünkü imam onlarla birlikte savaşmayınca kendisi de rahat edemez. Bundan dolayı (Nebi efendimiz) iki işten birisi ile meşgulolmuştur ki, bu da dua etmektir. \"Allah'ım, dilersen sana ibadet edilmez.\" Ömer radıyalli'ıhu anh'ın rivayet ettiği hadiste şöyle denilmektedir: \"Allah'ım, Müslümanlardan şu küçük topluluğu helak edecek olursan yeryüzünde sana ibadet edilmeyecektir.\" Böyle demesinin sebebi, kendisinin nebilerin sonuncusu olduğunu bilmesidir. Eğer o vakit kendisi ve beraberindekiler helak olsaydı, imana davet edecek kimse de Nebi olarak gönderilmeyecektL Müşrikler de Allah'tan başkasına ibadet etmeye devam edeceklerdi. O halde anlam, yeryüzünde bu şeriata göre ona ibadet edilmeyeceği şeklindedir. \"Ebu Bekir elinden tutarak, bu kadarı sana yeter, dedL\" Sözü geçen Müslim'deki rivayette şu fazlalık vardır: \"Ebu Bekir yanına geldi, ridasını alıp onu omuzlarının üzerine bıraktı. Daha sonra arkasından ayrılmayarak dedi ki: Ey Allah'ın Nebisi, Rabbine bu kadar niyaz edişin yeter. Şüphesiz o sana olan vaadini gerçekleştirecektir. Bunun üzerine yüce Allah: \"Hani siz Rabbinizden imdat istiyordunuz da o ... duanıza karşılık vermiştL\" [Enfal,9] buyruğunu indirdi ve Allah melekler ile ona yardım gönderdL\" el-Hattabı der ki: Kimsenin, o durumda Ebu Bekir 'in güveninin, Nebi sallalli'ıhu aleyhi ve sellem'in Rabbine olan güvenir.den daha ileri derecede olduğunu sanması caiz değildir. Aksine Nebi salIalIahu aleyhi ve selIem'i bu derece yalvarıp yakarmaya iten, onun ashabına olan şefkati ve kalplerine metanetin gelmesini aşırı derecede istemesi idi.. Çünkü Bedir onun da bulunduğu ilk savaştır. Bundan dolayı bu konumda ruhlarının yatışması için dua ve niyaza ileri derecede yönelmiş oldu .. Çünkü onlar Nebi salIalIahu aleyhi ve selIem'in yapacağı duanın kabulolunacağını biliyorlardı. Ebu Bekir ona o sözlerini söyledikten sonra duasının kabul edildiğini bildi.. Çünkü Ebu Bekir de kendi ruhunda bir güç ve bir itminan hissetmiş idi. Bundan dolayı bunun akabinde: \"O topluluk yenilgiye uğrayacaktır\" diyerek çıktı. 5. BAB",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 5
			}
		}
	]
}