{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3980,
			"arabicnumber": 3980,
			"text": "İbn Ömer r.a. dedi ki: Nebi Sallallahu Aleyhi ve Sellem Bedir kuyusunun başında durarak dedi ki: Rabbinizin vaat ettiğinin hak olduğunu gördünüz mü? Daha sonra şöyle buyurdu: Şu anda onlar benim söylediklerimi işitiyorlar. Bu Aişe r.anha'ya söylenince dedi ki: Hayır, Nebi Sallallahu Aleyhi ve Sellem sadece şunları söyledi: Onlar şu anda kendilerine daha önce söylediklerimin hakkın kendisi olduğunu biliyorlar. Sonra da Aişe: \"Şüphesiz sen ölülere işittiremezsin. \"[Nemi, 80] ayetini tamamen okudu. Fethu'l-Bari Açıklaması: \"Kureyş'in ileri gelenlerinden yirmi dört adam\" (tekil olan) sındıd, (çoğulu hadisteki gibi: sanadıd olarak gelir) kahraman ve efendi olan kimse anlamındadır. \"Şüphesiz ölüye kabrinde azap edilir.\" Hadisin açıklaması daha önce Cenazeler bahsinde (1288. hadiste) geçmiş bulunmaktadır. \"Ateşteki yerlerini aldıktan sonra demektir.\" Bu sözleri söyleyen kişi Urve'dir. O bu sözleriyle Aişe'nin maksadını açıklamak istemiş ve yüce Allah'ın: \"Sen ölülere işittiremezsin\" buyruğundaki mutlak nefyedici ifadenin, onların ateşte yerlerini almaları ile kayıtlı olduğuna işaret etmiştir. Bu açıklamaya göre Aişe'nin böyle bir şeyi kabul etmeyişi ile İbn Ömer'in bunu kabul etmesi arasında daha önce Cenazeler bölümünde açıklandığı gibi bir çelişki yoktur.. Fakat bundan sonraki rivayet Aişe'nin bunu mutlak olarak kabul etmediğine delil teşkil etmektedir .. Çünkü o, hadis: \"Andolsun onlar biliyorlar\" lafzı iledir, demiştir. İbn Ömer de \"onlar işitiyorlar\" diyerek vehmetmiştir, yanılmıştır demiştir. Beyhaki der ki: Bilmek, işitmeye engel değildir. Delilolarak gösterilen ayet ile ilgili cevaba gelince: Onlar ölü oldukları halde onlara söz işittirilmez. Fakat Allah Katade'nin de dediği gibi, Allah onları diriltti ve söylenenleri işittiler. el-İsmaill dedi ki: Aişe oldukça kavrayışlı, zeki, çok rivayet bilen ve ilmin inceliklerine daha ilerisi düşünülemeyecek derecede dalabilen birisi idi.. Fakat güvenilir (sika) birisinin naklettiği bir rivayet, ancak onun gibi birisinin naklettiği ve neshine, tahsisine yahut da imkansızlığına delil teşkil eden bir başka nas ile reddedilebilir. Durum böyle olduğuna göre ve onun reddettiği ile başkasının olumlu olarak zikrettiği bir husus bir arada telif edilebilirken nasıl reddedilebilir? Çünkü yüce Allah'ın: \"Sen ölülere işittiremezsin.\" [NemI, 80] buyruğu ile Nebi efendimizin: \"Şu anda onlar işitiyorlar\" demesi birbirine aykırı değildir.. Çünkü işittirmek, sesin işittiren tarafından işitenin kulaklarına ulaştırılması demektir. Nebi sallallilhu aleyhi ve sellern'in bu sözlerini onlara ulaştırmak suretiyle onlara işittiren yüce Allah'ın kendisidir. Aişe'nin: Allah Resulü sadece onlar biliyorlar dediği şeklindeki cevabına gelince, eğer o bu sözü bizzat işitmişse bu da \"işitirler, işitiyorlar\" şeklindeki rivayete aykırı değildir, aksine onu teyit etmektedir. es-Süheyll de özetle şu anlama gelecek açıklamalarda bulunmaktadır: Aynı haberde bu yolla Nebi sallallilhu aleyhi ve sellem'in olağanüstü bir iş yaptığının delili vardır.. Çünkü ashab-ı kiram ona: Sen leş haline gelmiş bir takım km-ıseler mi hitap ediyorsun demişler, o da onlara cevap vermişti. (es-Süheyll) der ki: Bu halde iken onların bilen kimseler olmaları mümkün olduğuna göre, işiten kimseler olmaları da mümkündür. Bu da ya çoğunluğun kabul ettiği görüş olan baş kulaklarıyla ya da kalp kulaklarıyla olmuştur. Kabir suali ruh ve bedene yöneliktir, diyenler bu hadise sarılmışlardır. Ancak kabir suali sadece ruha yöneliktir diyen kimseler bu görüşü reddederek işittirmenin baş kulağı hakkında da, kalp kulağı hakkında da sözkonusu olabileceğine dikkat çekmiş ve dolayısıyla bunun delilolacak tarafının kalmadığını söylemişlerdir. Derim ki: O sırada Nebi Sallallahu Aleyhi ve Sellem için gerçekleştirilen olağanüstü halin kabir suali meselesinde esas bir delilolarak alınması güzel bir tutum değildir",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}