{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3989,
			"arabicnumber": 3989,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem on kişiyi düşmana casusluk etmek üzere gönderdi. Başlarına da Ömer b. el-Hattab'ın oğlu Asım'ın dedesi olan Ensardan Asım b. Sabit'i kumandan tayin etti. Nihayet onlar Usfan ile Mekke arasındaki el-Hed'e denilen yerden Lihyan oğulları diye anılan Huzeyl'li bir kabile kolundan onlara söz edildi. Bunlar da yaklaşık yüz okçu adam ile birlikte onların üzerine gitmek üzere yola çıktılar. İzlerini takip ettiler, nihayet onların konaklamış oldukları bir yerde yedikleri hurma çekirdeklerini buldular. Bu Yesrib hurması deyip, izlerini takip ettiler. Asım ve arkadaşları onları fark edince bir yere sığındılar. Onları takip edenler etraftarını kuşatarak onlara: İniniz ve teslim olunuz, sizden kimseyi öldürmeyeceğimize dair de size söz veriyoruz, dediler. Asım b. Sabit: Ey arkadaşlarım, ben hiçbir zaman bir kafir'in verdiği bir himaye üzerine inmem, dedi. Sonra: Allah'ım, sen Nebiin Sallallahu Aleyhi ve Sellem'e bizim durumumuzu bildir, diye ekledi. Onlara ok attılar. Asım'ı öldürdüler. Sonra onlardan üç kişi, verilen yemin ve sözlere güvenerek indi. Bunlar Hubeyb ile Zeyd b. ed-Desine ve bir başka adamdı. Onları tam ele geçirdikten sonra yaylarının kirişlerini çözerek onları o kirişlerle bağladılar. Üçüncü adam: Bu sözde durmamanın başlangıcıdır. Allah'a yemin ederim sizinle birlikte gelmeyeceğim. -Öldürülmüş olan arkadaşlarını kastederek-- bunlar da bana örnektir, dedi. Onu çekiştirmeye ve onunla uğraşmaya koyuldularsa da onlarla beraber gitmeyi kabul etmedi. Hubeyb ile Zeyd b. ed-Desine'yi götürerek Bedir vakasından sonra onları sattılar. el-Haris b. Amir b. Nevfel oğulları Hubeyb'i satın aldı. -Hubeyb ise Bedir günü el-Haris b. Amir'i öldürmüştü.-- Hubeyb onların yanında bir süre esir kaldı. Sonra onu öldürmeyi kararlaştırdılar. el-Haris'in kızlarından birisinden etek traşı olmak üzere bir ustura istedi. O da ona ustura verdi. Haris'in kızının küçük oğlu, o fark etmeksizin sıvışıp Hubeyb'in yanına gidiverdi. Hubeyb'in, elinde ustura bulunduğu halde çocuğu uyluğu üzerine oturtmuş olduğunu görünce (el-Haris'in kızı) dedi ki: Ben öyle bir dehşete kapıldım ki, Hubeyb de benim bu halimi fark edince şunları söyledi: Onu öldüreceğimden mi korktun? Böyle bir şey yapacak değilim. el-Haris'in kızı der ki: Allah'a yemin ederim Hubeyb'den daha hayırlı bir esir asla görmüş değilim. Allah'a yemin ederim bir gün o zincirlere bağlı bulunduğu halde elinde bir üzüm salkımı bulunduğunu ve ondan yemekte olduğunu gördüm. Halbuki Mekke'de meyve namına da bir şey yoktu. (el-Haris'in kızı) şöyle derdi: Şüphesiz ki o, Allah'ın Hubeyb'e verdiği bir rızık idi. Hubeyb'i hill {haremin dışın)da öldürmek üzere alıp haremin dışına çıktıklarında Hubeyb onlara: Beni bırakın da iki rekat namaz kılayım, dedi. Onlar da ona izin verince iki rekat namaz kıldı ve şunları söyledi: Allah'a yemin ederim, eğer benim korktuğumu zannetmeyecek olsaydınız daha da kılardım. Sonra şöyle dua etti: Allah'ım, tek tek onları helak et. Onları paramparça et, onlardan kimseyi sağ bırakma. Daha sonra şu beyitleri söylemeye koyuldu: \"Ne önemi vardır, yere her nasıl yıkıldığım Allah için öldürülmek değil mi aradığım Dilerse mübarek kılar elbet uğrunda Rabbim Parçalanmış bir vücudu olsa da darmadağın.\" Daha sonra Ebu Sirvaa, Ukbe b. el-Haris kalkıp onu öldürdü. Hubeyb bu şekilde davranarak idam edecek müslümanın idamından önce namaz kılması adetini ilk başlatan olmuştur. Nebi Sallallahu Aleyhi ve Sellem de öldürüldükleri günü ashabına onlara dair haberleri bildirdi. Asım b. Sabit'in öldürüldüğü haberi kendilerine anlatılan Kureyşiilerden bazı kimseler, onun tanınmasına yarayacak bir şeyler getirsinler diye bir takım kişileri gönderdiler .. Çünkü Asım onların büyüklerinden birisini öldürmüştü. Allah ise Asım'ı Kureyş'in elçilerine karşı koruyan bulut gibi bir arı sürüsü gönderdi. Ondan hiçbir şey koparma imkanını bulamadılar.\" Ka'b b. Malik dedi ki: \"Bana her ikisi de Bedir'e katılmış salih iki kişi olan Murare b. er-Rabi el-Amrı ile Hilal b. Umeyye el-Vakıfi'nin adını verdiler",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 40
			}
		}
	]
}