{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3991,
			"arabicnumber": 3991,
			"text": "Ubeydullah b. Abdullah b. Utbe'den rivayete göre (babası) Ömer b. Abdullah b. eI-Erkam Zührl'ye mektup yazarak ona EsIemli Haris kızı Subey'a'nın yanına gitmesini ve ona kendisi ile ilgili hadisi ve ResuIullah Sallallahu Aleyhi ve Sellem'den fetva istemesi üzerine kendisine neIer söyIediğini sormasını emretti. Bunun üzerine Ömer b, Abdullah b. eI-Erkam, Abdullah b. Utbe'ye mektup yazarak şunu haber verdi: eI-Haris'in kızı Subey'a'nın kendisine haber verdiğine göre o Sad b. HavIe'nin nikahı aItında idi. -O da Amir b. Luey oğullarından oIup Bedir'e katıIanIardandı.- Veda Haccında kendisi hamile iken kocası vefat etmişti. Vefatının akabinde fazIa zaman geçmeden doğum yaptı. LoğusaIığı bitince kendisine talip oIacakIar için süsIenmeye başIadı. Abdu'd-Dar oğullarından bir adam oIan Ebli's-Senabil b. Ba'kek de onun yanına gitti ve ona: Bu halin ne oIuyor, nikahIanmayı ümit ederek sana talip oIanIara süsIendiğini görüyorum. Şüphesiz sen Allah'a yemin ederim ki üzerinden dört ay on gün geçmedikçe nikahIanamazsın. Subey'a dedi ki: O bana bunIarı söyIeyince, akşam oIur oImaz eIbiseIerimi giyindim, ResliIullah sallallahu aleyhi ve sellern'e gidip ona durumu sordum. O da bana doğum yapınca (evlenmemin) helal olduğunu bana fetva verdi ve uygun gördüğüm takdirde evlenebileceğimi söyledi.\" Bu Hadis 5319 numara ile gelecektir. Fethu'l-Bari Açıklaması: Bu başlıktaki beşinci (3989.) Ebu Hureyre'nin rivayet ettiği Bi'ri Maune'de şehit edilenlerin kıssası ile ilgili hadisin tamamının açıklaması ileride er-Red' gazvesinde gelecektir. Burada bu hadisin zikredilmesinden maksat hadiste geçen: \"Onların büyüklerinden birisini öldürmüştü\" ifadesinin yer almasıdır. İleride bunun Bedir günü olduğuna dair açık ifadeler gelecektir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 42
			}
		}
	]
}