{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4003,
			"arabicnumber": 4003,
			"text": "Ali r.a. dedi ki: \"Bedir günü alınan ganimetierden bana isabet eden yaşlıca bir deve vardı. Ayrıca Nebi Sallallahu Aleyhi ve Sellem da o gün Allah'ın kendisine fey' olarak vermiş olduğu beşte birden de bir şeyler vermişti. Nebi Sallallahu Aleyhi ve Sellem'in kızı Fatıma (aleyhesselam) ile evlenmek isteyince, Kaynuka oğullarından kuyumcu bir adam ile benimle birlikte gelip beraber izhir getirelim diye sözleştim. Onu kuyumculara satarak böylece düğünüm için vereceğim ziyafette onun bir faydası olsun istedim. Ben develerim için eğerler, çuvallar ve ipler toplamakta iken, iki devem de Ensardan bir adamın odasının yakınında çökmüş, toplayacaklarımı toplamışken bir de ne göreyim: İki devemin de hörgüçlerinin kesilmiş olduğunu ve böğürlerinin de delinerek ciğerlerinden bir parça alınmış olduğunu gördüm. Manzarayı görünce göz yaşlarımı tutamadım. Kim bunu yaptı, dedim. Bunu Hamza b. Abdulmuttalib yaptı. O şu anda bu evde Ensardan bazı kimselerle içki içmektedir, dediler. Yanında şarkıcı bir kadın ve arkadaşları vardı. Bu şarkıcı kadın şarkı söylerken: Ey Hamza, yaşlı ve semiz develere koş, diyordu. Hamza bunun üzerine kılıcına atılmış, her iki devenin hörgüçlerini kesmiş, böğürlerini delerek ciğerlerinden kesip -almıştı. Ali dedi ki: Kalktım, Nebi Sallallahu Aleyhi ve Sellem'in huzuruna girdim. Yanımda da Zeyd b. Harise vardı. Nebi sallallahualeyhivesellem ne ile karşılaştığımı anlayarak, ne oluyor dedi. Ben: Ey Allah'ın Resulü, bugün gibisini görmedim. Hamza develerime hücum etti, hörgüçlerini kesti, böğürlerini deldi. İşte şimdi o bir evde içki içtiği arkadaşlarıyla beraber bulunuyor dedim. Nebi Sallallahu Aleyhi ve Sellem ridasının getirilmesini istedi, ridasını giydi. Sonra yürüyerek yola koyuldu. Ben ve Zeyd b. Harise de arkasından gidiyorduk. Nihayet Hamza'nın bulunduğu eve geldi, yanına girmek üzere izin isted ona izin verdi. Nebi Sallallahu Aleyhi ve Sellem yaptığından dolayı Hamza'yı kınamaya koyulurken, Hamza'nın sarhoş olmuş ve gözleri kızarmış bir halde olduğunu gördük. Hamza, Nebi Sallallahu Aleyhi ve Sellem'e baktı. Sonra da aşağıdan yukarıya doğru onu süzdü. Dizine doğru baktı, tekrar başını kaldırarak yüzüne kadar onu süzdü. Sonra Hamza dedi ki: Sizler babamın kölelerinden başka ne olabilirsiniz ki? Nebi Sallallahu Aleyhi ve Sellem onun sarhoş olduğunu anladı. Resuluilah Sallallahu Aleyhi ve Sellem gerisin geri dönüp gitti. Dışarı çıktı, biz de onunla birlikte dışarı çıktık",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 54
			}
		}
	]
}