{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4008,
			"arabicnumber": 4008,
			"text": "Ebu Mes'ud el-Bedri r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bakara suresindeki son iki ayeti bir gecede okuyana bu iki ayet yeterli gelir.\" Abdurrahman dedi ki: Ebu Mes'ud ile o Beyti tavaf ederken karşılaştım ve ona (bu hadisi) sordum. O da bana bu hadisi nakletti.\" Bu Hadis 5008,5009,5040 ve 5051 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Sehl b. Huneyf' el-Ensari \"üzerine (cenaze namazında) tekbir getirdi.\" \"Andolsun Bedir'de bulunmuştur, dedi.\" Said b. Mansur da, İbn Uyeyne'den böylece rivayet etmiş ve \"beş tekbir\" lafzı ile zikretmiştir. Hakim rivayetinde: \"Bize dönerek: O Bedir'e katılanlardandır, dedi\" diye ilave etmiştir. Ali radıyalliıhuanh'ın: \"O Bedir'de bulunmuştur\" sözü ile Bedir'de bulunan kimselerin her hususta diğerlerine göre üstün ve faziletli olduğuna işaret etmektedir. Cenaze namazında getirilen tekbir sayısında bile. Bu ise onlar arasında cenaze namazında dört tekbir getirmenin meşhur olduğuna delil teşkil etmektedir. Ashabın çoğunluğunun görüşü de budur. Bazılarından tekbir sayısının beş olduğu da rivayet edilmiştir. Müslim'in Sahih'inde Zeyd b. Erkam'dan bu hususta merfu bir hadis bulunmaktadır. Cenazeler bölümünde de Enes'in şöyle dediği geçmişti: \"Cenaze üzerine getirilecek tekbir sayısı üçtür. Birincisi istiftah içindir ... \" İbn Ebi Hayseme de bir başka yoldan merfu olarak şunu rivayet etmektedir: \"O (cenaze namazında) dört, beş, altı, yedi ve sekiz tekbir getirirdi. Nihayet Necaşi ölünce onun üzerine dört tekbir getirdi ve vefat edene kadar bu halini sürdürdü.\" Ebu Ömer (İbn Abdilberr) der ki: İcma dört tekbir getirileceği hususunda gerçekleşmiştir. Değişik bölgelerdeki fakihlerden İbn Ebi Leyla dışında beş tekbir getirilir diyeni bilmiyoruz. Hanefilere ait el-Mebsut adlı eserde Ebu Yunus'tan da benzeri bir görüş nakledilmektedir. Nevevi de Şerhu'l-Mühezzeb adlı eserinde der ki: Ashab arasında görüş ayrılığı vardı. Sonra bu görüş ayrılığı ortadan kalktı ve dört tekbir getirileceği üzerinde icma' ettiler .. Fakat imam unutarak beş tekbir getirecek olursa namazı batıl olmaz. Sahih görüşe göre kasten böyle yapsa da durum böyledir .. Fakat sahih kabul edilen görüşe göre cemaat bu hususta ona tabi olmaz. Doğrusunu en iyi bilen AlIah'tır. Ömer r.a.'ın (4005 numaralı) Hafsa'nın duI kalışı ile ilgili hadisine gelince, ileride Nikah böIümünde bu hadisin yeteri kadarıyIa şerhi geIecektir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 59
			}
		}
	]
}