{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4016,
			"arabicnumber": 4016,
			"text": "Nafi'den rivayete göre \"İbn Ömer r.a. bütün yılanları öldürürdü'' [-4017-] Nihayet Bedir'e katılmış bulunan Ebu Lubabe el-Bedrı ona (İbn Omer'e) \"Nebi Sallallahu Aleyhi ve Sellem'in evlerde barınan küçük yılanların öldürülmesini yasakladığını anlatınca, o da onları öldürmekten vazgeçti.\" Fethu'l-Bari Açıklaması: \"Ömer b. el-Hattab, Kudame b. Maz'un\" b. Habib b. Vehb b. Huzafe b. Cumah \"el-Cumahı'yi amil olarak görevlendirdi.\" Kudame İslam'a erken girmiş olanlardan birisi olan Osman b. Maz'un'un kardeşidir. Buhari bu olayı şartına uymayan mevkuf bir rivayet olduğundan dolayı zikretmemiştir .. Çünkü maksadı Bedir'e katılanları kaydetmekten ibarettir. Bu kıssayı Abdurrezzak, Musannefinde Ma'mer'den, o ez-Zühri'den diye rivayet ederek şunu da eklemektedir: \"el-Carud el-Akdı, Ömer'in yanına gelerek dedi ki: Kudame içki içip sarhoş oldu. Ömer: Seninle beraber kim şahitlik eder dedi. el-Carud: Ebu Hureyre dedi. Ebu Hureyre de onun sarhoşken kustuğunu gördüğüne şehadet edince Ömer, Kudame'ye haber gönderdi. el-Carud ona: Ona had uygula deyince, Ömerona: Sen hasım mısın yoksa şahit misin diye sordu. Bu sefer el-Carud sustu. Daha sonra aynı şeyi tekrar edince Ömer dedi ki: Ya susarsın yahut da sana fena yaparım, dedi. El-Carud: Senin amcan oğlu içki içecek, beni de fena yapacaksın. Hak bunun neresinde, dedi. Ömer, Kudame'nin eşi Velid'in kızı Hind'e haber gönderdi, o da kocası aleyhine şahitlik edince, Ömer Kudame'ye: Ben sana had uygulamak istiyorum dedi. Kudame: Sen bunu bana yapamazsın dedi.. Çünkü yüce Allah: \"İman edip, salih amel işleyenlere ... tattıklarından dolayı bir vebal yoktur. \" diye buyurmaktadır. Ömer: Sen ayeti yanlış anlıyorsun dedi.. Çünkü ayetin geri kalan kısmında: \"İttika ettikleri. .. takdirde\" diye buyurulmaktadır. Eğer sen takvalı olsaydın Allah'ın sana haram kıldığı şeylerden uzak kalırdın. Daha sonra emir vererek ona celde vuruldu. Kudame ona kızdı ise de daha sonra birlikte hacca gittiler. (Şöyle ki): Ömer bir seferinde dehşetle uykusundan uyandı ve: Çabucak bana Kudame'yi getirin, (rüyamda) birisi bana gelerek, Kudame ile barış,. Çünkü o senin kardeşindir dedi. Bunun üzerine birbirleriyle barıştılar",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}