{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4027,
			"arabicnumber": 4027,
			"text": "Zübeyr'den dedi ki: \"Bedir günü muhacirlere yüz pay ayrıldl.\" Fethu'l-Bari Açıklaması: \"Bedir'e katılanların (Ömer zamanındaki) atiyyeleri beşer bin idi.\" Atiye, Ömer r.a. döneminden itibaren onların her birisine yıllık verilen miktara denilir. \"Ömer andolsun onları\" daha fazla atiyye vermek suretiyle diğerlerine \"üstün tutacağım, dedi.\" Malik b. Evs'in, Ömer'den rivayetinde \"o muhacirlere beşer bin beşer bin verdi.Ensara dörder bin dörder bin verdi. Nebi sallalli'ıhu aleyhi ve sellem'in hanımlarını üstün tutarak onların her birisine onikişer bin verdi.\" Tirmizi, Nesai, İbn Hibban ve Hakim sahih bir senedie A1i'nin şöyle dediğini rivayet etmektedirler: \"Cibril Bedir günü Nebi sallalli'ıhu aleyhi ve sellem'e gelerek dedi ki: Sen ashabını esirler hususunda muhayyer bırak. İsterlerse onları öldürebilirler, isterlerse de gelecek sene onların sayısı kadar kendilerinden öldürülmek üzere fidyeyi saçabilirler. Ashab fidye alalım ve bizden (o kadar kişi) öldürülsün, dediler.\" Müslim de bu olayı Ömer radıyalli'ıhu anh'ın rivayet ettiği bir hadis olarak uzunca rivayet etmiş bulunmaktadır. Bu rivayetinde sebebi de zikretmiştir. Buna göre Nebi sallalli'ıhu aleyhi ve sellem: Bu esirler hakkındaki görüşünüz nedir diye sormuş. Ebu Bekir: Benim görüşüme göre onlardan bir fidye alalım, bu bizim için bir güç olur. Olur ki Allah da onlara hidayet verir, dedi. Ömer de: Benim görüşüme göre onları bize teslim et. Biz de onların boyunlarını vuralım .. Çünkü bunlar küfrün önderleridir, dedi .. Fakat Ebu Bekir 'in dediği Resulullah sallalli'ıhu aleyhi ve sellem'in deha çok hoşuna gitti...\" Bu rivayette yüce Allah'ın: \"Yeryüzünde çokça savaşıp zaferler kazanıncaya kadar esirler alması hiçbir Nebie yaraşmaz.\"[Enfal, 67] buyruğunun nüzulü de sözkonusu edilmektedir. Kafir esirlerden fidye almanın caiz olup olmaması ile ilgili imamların görüş ayrılıkları da Cihad bölümünün \"sonra ya lütfederek karşılıksız salın yahut fidye alın. Savaş ağırlıklarını bırakıncaya kadar. \" [Muhammed,4] başlığında açıklanmış bulunmaktadır. Selef (Ebu Bekir ile Ömer'in esirler hakkındaki) iki görüşten hangisinin daha doğru olduğu hususunda ihtilaf etmiştir. Bazıları şöyle demiştir: Ebu Bekir'in görüşü daha doğru idi.. Çünkü yüce Allah'ın bu husustaki takdirine uygundu. Hüküm de nihai olarak bu şekilde karar kılmıştır. Ayrıca o esirlerin pek çoğu ya bizzat yahut da bu olaydan sonra doğan zürriyeti vasıtası ile İslam'a girmiştir. Rahmetin gazaba baskın oluşuna da uygundur. Nitekim Allah'ın haklarında rahmet yazdığı kimseler ile ilgili olarak Aııah'ın tespit ettiği hükmün bu olduğu da sabit olmuştur. Fidye almalarından ötürü siterne gelince; bu da az dahi olsun bir dünyalığı ahirete tercih eden kimselerin zem edilmelerine işarettir. Doğrusunu en iyi bilen Allah'tır. \"Birinci fitne\" yani Osman'ın öldürülmesi \"ortaya çıktı.\" Bu fitne Bedir'e katılmış olanlardan kimseyi geride bırakmadı. Yani onlar Osman'ın öldürülmesi ile birlikte çıkan fitneden itibaren Harre vakası ile birlikte diğer fitnenin ortaya çıkışına kadar olan dönemde vefat ettiler. Bedir'e katılanlar arasında en son vefat eden kişi Sad b. Ebi Vakkas'tır. O da Harre vakasından birkaç yıl önce vefat etmiştir. \"Daha sonra ikinci fitne yani Harre vakasl. .. meydana geldi.\" Harre vakası Yezid b. Muaviye'nin son zamanlarında meydana gelmiştir. İleride yüce Allah'ın izniyle Fiten bölümünde buna dair bazı açıklamalar gelecektir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 76
			}
		}
	]
}