{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4039,
			"arabicnumber": 4039,
			"text": "el-Berâ ibnu Âzib (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) Ensâr'dan birtakım kimseleri Yahûdî Ebû Râfi'e (onu öldürmeleri için) gönderdi. Bunlar üzerine Abdullah ibnu Atîk'i bey yaptı. Ebû Râfi',Rasûlüllah'a ezâ eder ve O'nun aleyhinde (ki hareketlere malca) yardım ederdi. Bu (zengin Yahûdî) Hicaz toprağında kendisine âid (kuvvetlendirilmiş) bir kalede otururdu. Abdullah ibnu Atîk ile arkadaşları kaleye yaklaştıklarında güneş batmıştı. Oranın insanları (deve, sığır, koyun gibi) yaylım hayyanlarıyle mer'adan dönmüşlerdi. Bu durum üzerine Abdullah ibnu Atîk arkadaşlarına: Siz yerinizde oturunuz da ben (Ebû Râfi'in kalesine) gideyim. Ve kale kapıcılarına nezaketli bulunayım. Bu suretle kaleye girebileceğimi sanırım, dedi. kapısına doğru yürüdü. Nihayet kapıya yaklaştı. Sonra (kendisini saklamak üzere) maşlahına büründü. Sanki bir ihtiyâcım gideriyordu. Artık insanlar tamâmiyle kaleye girmişti. Bu sırada kale kapıcısı: Ey Allah'ın kulu, kaleye girmek istersen hemen gir! Zîrâ ben kapıyı kapamak istiyorum, dedi. de hemen girdim. Ve (merkeb ahırına) gizlendim. İnsanların kaleye girmesi üzerine kapıcı kapıyı kilitledi ve anahtarları bir direğe astı. Atîk dedi ki: Ben hemen anahtarlara doğru kalktım, onları alıp kapıyı açtım. Ebû Râfi'in yanında akşamdan sonra gece sohbeti yapılırdı ve bu sohbet kalenin üst katlarında yapılırdı. Bu gece sohbeti sona erip, dostları Ebû Râfi'in yanından dağılınca, ben hemen yanına çıktım. Ve her kapıyı açtıkça iç tarafından sürmeliyordum. Düşündüm ki, eğer Ebû Râfi'in adamları beni anlarlarsa onu öldürünceye kadar bu iyi fırsatı bana bırakmazlar. Bu suretle Ebû Râfi'in yattığı odaya kadar vardım. O, karanlık bir oda içinde, ailesinin arasında(yatmış) idi. Odanın neresinde olduğunu kestiremedim. Anlamak için: Yâ Ebâ Râfi'! diye seslendim. Kim o? diye cevâb verdi. hemen sesin tarafına yaklaştım ve kılıcımla ilk darbeyi vurdum. Fakat dehşet içinde idim, bir iş göremedim. Ebû Râfi' haykırdı. Ben hemen odadan dışarı çıktım ve kısa bir zaman eğlenip sonra odaya (tekrar) daldım da(sesimi değiştirerek): Bu feryâd nedir yâ Ebâ Râfi'? dedim. Anan cehenneme! Sen seslenmeden önce birisi beni oda içinde kılıçla vurdu, dedi. ibnu Atîk dedi ki: Ben ona bir darbe daha vurdum, iyice yaraladım. Fakat yine öldüremedim. Sonra kılıcın keskin ucunu onun karnına bastım. Nihayet Ebû Râfi' arkasına devrildi. Bu defa onu öldürdüğümü anladım ve hemen kapıları birer birer açmağa başladım. (Bu suretle savuşup) kale merdiveninin tâ son basamağına varmıştım. Burada yere ulaştığımı sanarak ayağımı yere attım. (Meğer daha sona gelmemiş olduğumdan) mehtâblı bir gecede merdivenden aşağıya düştüm. Baldırım kırıldı. Hemen bir sargı ile bu kırığı sardım, sonra kapının önüne oturdum. Ve kendi kendime: Onu öldürüp öldürmediğimi iyice öğreninceye kadar bu gece kaleden çıkmam, dedim. Ötmeye başlayınca ölü i'lâncısı kale sûrunun üstünde dikeldi ve: Hicaz ahâlîsinin taciri Ebû Râfi'nin ölümünü bildiririm! diye i'lân etti. üzerine ben artık arkadaşlarımın yanına gittim. Onlara: Artık kurtuluş, Allah Ebü Râfi'i öldürdü, dedim. Nihayet Peygamber'in huzuruna vardım, işi O'na anlattım. (Ayağımın kırıldığını duyunca) bana: \"Ayağını uzat\" buyurdu. de ayağımı uzattım. Rasûlüllah ayağımı eliyle sıvazladı. Sanki ayağımdan hiç ağrı duymamışa döndüm",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 86
			}
		}
	]
}