{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4048,
			"arabicnumber": 4048,
			"text": "Enes r.a.'dan rivayete' göre, amcası Bedir'e katılmamıştı. Bu sebeple: Ben Nebi Sallallahu Aleyhi ve Sellem'in ilk savaşına katılamadım. Andolsun eğer Allah, Nebi Sallallahu Aleyhi ve Sellem ile birlikte bulunmarnı nasip ederse, şüphesiz Allah benim nasıl bir gayret göstereceğim i görecektir, dedi. Uhud günü (düşmanla) karşılaştı. Müslümanlar bozguna uğrayınca şunları söyledi: Allah'ım -müslümanları kastederek- bunların yaptıklarından dolayı sana özür beyan ediyorum. Müşriklerin yaptıklarından da uzak olduğumu sana açıklıyorum. Sonra kılıcını alıp ileri atıldı. Sa'd b. Muaz ile karşılaştı. Ona: Nereye ey Sa'd! Şüphesiz ben cennetin kokusunu Uhud'un berisinden alıyorum, dedi. İleri atıldı ve öldürüldü. Kimse onu tanıyamadı. Ancak kızkardeşi onu bir beninden -ya da parmak uçlarından- tanıyabildi. Mızrak yarası, kılıç darbesi ve isabet eden ok yarasından oluşan seksen küsur yara görülmüştü.\" Fethu'l-Bari Açıklaması: \"Şüphesiz Allah görecektir.\" Savaşmakta canı pahasına dahi olsa işi oldukça ileri götüreceğini kastetmektedir. \"Ben cennetin kokusunu Uhud'un berisinden alıyorum.\" Bunun hakikat anlamıyla olması ihtimali vardır. O alışılmışın ötesinde hoş bir ko ku almış ve bunun cennetin kokusu olduğunu anlamış olabilir. Bunu sahip olduğu yakıne göre söylemiş olma ihtimali de vardır. Öyle ki, onun için gayb olan bir husus, kendince fiilen hissedilen bir hal almıştır. Yani, benim bu savaştığım yerde bulunan bir kişi sonunda cennete varır. \"İleri atıldı ve öldürüldü.\" Bu Enes b. en-Nadr'ın oldukça ileri derecede kahraman birisi olduğunu göstermektedir. Öyle ki, Uhud günü gösterdiği sebatına ve mükemmel kahramanlığına rağmen Sa'd b. Muaz dahi Enes b. en-Nadr'ın yaptığını yapma cesaretini gösterememişti. \"Vücudunda mızrak yarası, kılıç darbesi ve ok yarası olmak üzere seksen küsur yara görüldü.\" Enes dedi ki: Biz \"mu'minler arasında Allah'a verdikleri sözd1 içtenlikle sebat gösteren nice yiğitler vardır. Onlardan kimisi adağını yerine getir, di ... \"[Ahzab, 23] ayetinin, onun ve benzeri kimselerin hakkında indiği kanaatinde idik. \\ Hadis-i şerifte cihad esnasında zor olanın üzerine gitmenin caiz olduğuna, kişinin şahadeti elde etmek için canını feda edebileceğine, verilen ahde sadakatla bağlı kalmaya işaret vardır. Bu hadisten çıkartılabilecek diğer sonuçlar daha önceden Cihad bölümünde geçmiş bulunmaktadır.(2805. hadiste)",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 94
			}
		}
	]
}