{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4050,
			"arabicnumber": 4050,
			"text": "Zeyd b. Sabit r.a. dedi ki: ygamber Sallallahu Aleyhi ve Sellem Uhud gazvesine çıktıktan sonra onunla birlikte çıkım kimselerden bir kısmı geri döndü. Nebi Sallallahu Aleyhi ve Sellem'in de ashabı\\iki gruba ayrıldı: Bir kesim, onlarla savaşırız diyor, diğer kesim onlarla savaşmayız, diyordu. Bunun üzerine de: \"Münafıklar hakkında ne diye iki gruba ayrıldınız? Halbuki Allah onları kazandıkları yüzünden baş aşağı yıkıvermiş bulunuyor.\"[Nisa, 88] buyruğu indi ve (Allah Resulü) şöyle buyurdu: O Taybe'dir. Ateşin gümüşün yaramaz kısımlarını silip süpürdüğü gibi, o da günahları siler süpürür.\" Fethu'l-Bari Açıklaması: \"Onunla beraber çıkmış olanlardan bazıları geri döndü.\" Kastettiği Abdullah b. Ubey ile onun arkadaşlarıdır. Bu husus, Meğazı bölümünde Musa b. Ukbe yoluyla gelen rivayette açıkça ifade edilmiş bulunmaktadır. Abdullah b. Ubey'in görüşü Medine'de kalmak hususunda Nebi Sallallahu Aleyhi ve Sellem'in görüşüne uygundu. Başkaları Medine'nin dışına çıkma görüşünü ortaya atıp Nebi Sallallahu Aleyhi ve Sellem da onların görüşlerini kabul edince ve Medine'nin dışına çıkması üzerine Abdullah b. Ubey arkadaşlarına: Onlara itaat etti, bana da karşı geldi. O halde niçin kendimizi ölüme maruz bırakalım ki, dedi ve savaşa çıkanların üçte birini alıp geri döndü. İbn İshak rivayetinde der ki: Abdullah b. Amr b. Haram -ki Cabir'in babasıdır ve o da Abdullah b. Ubey gibi Hazreclidir- arkalarından giderek geri dönmeleri için onlara yalvardı ise de kabul etmediler. Bu sefer: Allah sizi bizden uzak tutsun, dedi. \"Resulullah Sallallahu Aleyhi ve Sellem'in ashabı\" Abdullah b. Ubey ile geri dönen kimseler hakkındaki hükmün ne olduğu hususunda \"ikiye ayrılmışlardL\" \"Bunun üzerine bu ayet indi.\" Bu ayetin nüzul sebebi ile ilgili olarak sahih olan da budur. \"Ve: O Taybe'dir ... günahları siler.\" Buna dair açıklamalar Hac bahsinin sonlarında (1883. hadiste) yeteri kadar geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 96
			}
		}
	]
}