{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4053,
			"arabicnumber": 4053,
			"text": "Cabir b. Abdullah r.a.'dan rivayete göre; babası Uhud günü şehit düştü. Geriye de ödenmesi gereken bir miktar borç ile altı kız çocuğu bıraktı. Hurmaların toplanma zamanı gelince (Cabir) dedi ki: Resulullah Sallallahu Aleyhi ve Sellem'in yanına gittim ve, benim babamın Uhud günü şehit düştüğünü ve geriye çok miktarda borç bıraktığını biliyorsun. Ben alacaklıların da seni görmelerini istiyorum, dedim. Allah Resulü: Git ve her bir hurmayı ayrı bir yerde topla, dedi. Ben de dediğini yaptım. Sonra onu çağırdım. (Alacaklılar) onu görünce o anda sanki bana güvenmediler (alacaklarının hemen ödenmesini istediler). Allah Resulü onların yaptıklarını görünce harman edilmiş en büyük kümenin yanına yaklaşarak etrafında üç defa dolaştı. Sonra onun yanıbaşında oturdu, sonra da bana: Arkadaşlarını çağır, dedi. Babamın emanetini (alacaklarını) ödemeyi Allah nasip edinceye kadar onlara ölçerek verip, durdu. Ben de babamın emanetinin (borçlarının) eksiksiz olarak ödenmesi halinde geriye tek bir meyveyi dahi kızkardeşlerime götürmemeye razı idim .. Fakat yüce Allah harman yerindeki bütün hurma kümelerini esenliğekavuşturdu. Öyle ki ben, Nebi sallall€ıhu aleyhi ve sellem'in yanıbaşında oturduğu hurma kümesine bakıyordum da tek bir hurma tanesi dahi eksilmemiş gibi geldi. Fethu'l-Bari Açıklaması: \"O zaman içinizden iki zümre bozulmaya yüz tutmuştu. Halbuki Allah on-ların velisi idi.\"[Al-i İmran, 122] buyruğundaki \"el-feşl: bozulmak, bozguna uğramak\" korkmak demektir. Bunun görüş belirtmek hakkında kullanıldığı takdirde acze düşmek, bedeni bir hali anlatmak için kullanıldığı takdirde ise, bitkin düşmek, savaş ile ilgili kullanıldığı takdirde korkaklık göstermek anlamına geldiği de söylenmiştir. \"Veli\" de yardımcı demektir. \"Bu ayet bizim hakkımızda inmiştir.\" Yani Hazredilerden olan kendi kavmi Selime oğulları ile onların akrabaları olan Evslilerden bulunan Harise oğulları hakkında :nmiştir. \"Ben bu ayetin nazil olm'amasını arzu etmezdim .. Çünkü yüce Allah: \"Ve Allah onların velisidir\" diye buyurmuştur.\" Ayet-i kerime her ne kadar zahiri anlamı itibariyle onların değerini düşürmekte ise de, sonunda onlar için oldukça büyük bir şeref ifadesi taşımaktadır. İbn İshak der ki: Yüce Allah'ın: \"Halbuki Allah onların velisidir\" buyruğu, onların içlerinden geçirdikleri bozguna uğramak duygularını onlardan uzaklaştırandır, demektir .. Çünkü böyle bir düşünce şeytan ın bir vesvesesi olmakla birlikte onların gevşeklik göstermeleri sözkonusu olmamıştı. Bu husustaki ikinci rivayeti (4053 numaralı hadis) ile ilgili açıklamalar Nübuwetin alametleri başlığında (3580. hadiste) geçmiş bulunmaktadır. Birinci rivayetin (4052 numaralı hadisin) ihtiva ettiği hususlara dair açıklamalar da Nikah bölümünde gelecektir. Bu rivayetin burada kaydedilmesindeki amaç ise Cabir'in babası Abdullah'ın Uhud'da şehit düşmüş kimselerden olduğunun belirtilmesidir. Tirmizi'de, Talha b. Hiraş yoluyla gelen rivayette şöyle denilmektedir: \"Cabir'i şöyle derken dinledim: Nebi sallallShu aleyhi ve sellem benimle karşılaştı ve dedi ki: Ne diye seni böyle gönlü kırık görüyorum? Ben: Ey Allah'ın Resulü, babam Uhud'da şehit düştü, geriye de çok miktarda borç ve bakıma muhtaç çoluk çocuk bıraktı, dedim. Allah Resulü bana: Sana müjde vereyim mi, diye buyurdu. Şüphesiz Allah senin babanı huzuruna aldı ve, benden dilekte bulun, dedi. Senin baban: Tekrar bana hayat ver (beni dünyaya gönder) senin uğrunda bir defa daha öldürüleyim, dedi ve: \"Allah yolunda öldürülenleri sakın ölüler sanrna. Bilakis onlar Rableri katında diridirler ... \"[Al-i İmran, 169] ayeti indirildi",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 99
			}
		}
	]
}