{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4072,
			"arabicnumber": 4072,
			"text": "Amr ibnu Umeyye ed-Damrî'nin oğlu Ca'fer şöyle demiştir: Bir ara ben, Übeydullah ibn Adiyy ibni'l-Hıyâr ile seyahate çıktım. Hımıs'a vardığımızda Übeydullah bana: Vahşî'yi görmek ister misin? Ona Hamza'yı öldürmesini sorarız, dedi. de: Evet, dedim. sırada Vahşî Hımıs'ta oturuyordu. Biz Vahşî'nin nerede bulunduğunu sorduk. Bize şu köşkün gölgesinde oturan Vahşî’dir diye gösterildi. O, büyük bir yağ tulumu gibi semiz(kızıl gözlü) bir kişi idi. Yanına gittik, biraz irkilip selâm verdik, selâmımızı karşıladı. Übeydullah o sırada sarığını yüzüne, başına dolamıştı. Vahşî onun yalnız gözleriyle ayaklarını görüyordu. Ubeydullah ona: Ey Vahşî, beni tanıyor musun? Diye sordu. Ubeydullah'ı şöyle gözüyle süzdükten sonra, şöyle dedi: Hayır, vallahi tanımadım. Yalnız bilmekte olduğum bir husus, şudur: Adiyy ibnu'l-Hıyâr(soran Ubeydullah’ın babası), Ebü'l-I'ys kızı Ümmü Kıtal denilen bir kadınla evlenmişti. Bu kadın Mekke'de Adiyy'e bir oğlan doğurmuştu. Ben de bir sütana arayıp bulmuş ve bu çocuğu anasıyle beraber taşıyıp süt-anaya götürmüştüm (Deve üstünde o çocuğun ayaklarını görmüştüm). Ayakların o çocuğun ayakları gibi olduğu için, ayaklarına dikkatle baktım). birinci râvîsi Ca'fer şöyle dedi: Bunun üzerine Ubeydullah, yüzünden sarığı açtı. Sonra Vahşî'ye: Artık şimdi bize Hamza'nın öldürülmesini anlatır mısın? dedi. Evet, diyerek şöyle anlattı: Hamza, Bedir harbinde Tuayme ibn Adiyy ibni'l-Hıyâr'ı öldürmüştü. Efendim olan Cubeyr ibn Mut'ım bana: Eğer amcam Tuayme'ye karşılık Hamza'yı öldürürsen sen hürrsün, dedi. dedi ki: Ayneyn yılı insanlar Medîne'ye sefere çıkınca -Ayneyn, Uhud Dağı yanında bir dağdır; bununla Uhud arasında bir vâdî vardır- ben de onlarla beraber o harbe çıktım. İnsanlar harb nizâmında saff olup sıralandıkları zaman (Kureyş tarafından) Sibâ' ortaya çıktı ve cenk edecek bir mubâriz istedi. dedi ki: Ona karşı Abduhmıttalib'in oğlu Hamza ortaya çıktı da: Ey Sibâ'! Ey kadın sünnetçisi olan Ümmü Enmâr'ın oğlu! Allah'a ve Rasûlü'ne muhalefet etmek mi istersin? dedi. dedi ki: Sonra Sibâ' üzerine yürüdü. Sibâ' giden dünkü gün gibi yok oldu (yani Hamza onu öldürdü). dedi ki: Bu sırada ben Hamza'yı vurmak için bir taş arkasına gizlendim. Hamza bana yaklaşınca harbemi(kısa mızrağımı) ona attım ve mızrağımı Hamza'nın kasığına yerleştirdim. Mızrak Hamza'nın tâ iki uyluk üstünün arkasından çıkmıştı. İşte bu mızrak Hamza'yı olduğu yere çökertti(yani onu öldürdü). Mekkeliler harbden dönerlerken ben de onlarla beraber geri döndüm. Ve Mekke'de İslâm Dîni yayılıncaya kadar orada oturdum. Sonra (Mekke'nin fethi üzerine) Taife kaçıp gittim. O sırada Tâifliler(toptan İslâm'a girdiklerini arzetmek üzere) Allah'ın Rasûlü'ne elçi gönderdiler. Bana da (korkma git), Rasûlüllah hiçbir elçiyi ürkütmez denildi. Ben de elçi hey'etiyle beraber yola çıktım. Tâ Rasülullah'ın huzuruna kadar vardım. Rasûlüllah beni görünce: \"Sen Vahşî misin?\" buyurdu. Ben: Evet, dedim.Rasûlüllah: \"Hamza'yı sen mi öldürdün?\" buyurdu. Bu iş sana erişen haber şeklinde oldu, dedim. Rasûlüllah: \"Yüzünü benden kaybetmeye (yânı saklamaya) gücün yeter mi?\" buyurdu. Vahşî dedi ki: Ben de hemen huzurdan çıktım. Rasûlüllah vefat edip de (Ebû Bekr zamanında) Museylimetu'l-Kezzâb çıkınca (kendi kendime) tam sırasıdır, muhakkak ben Museylime'ye karşı çıkarım. Umarım ki ben Museylime'yi öldürürüm de bu hizmetimle Hamza'ya karşı işlediğim cinayeti karşılarım, dedim. Ve Museylime üzerine sevk olunan ordu ile hareket ettim. Bu muharebede gâlib ve mağlüb olan oldu. Ben de birden yıkık bir duvarın karaltısında bir kişinin (Museylime'nin) durduğunu gördüm. O sanki esmer bir deve renginde yüzü kül gibiydi, başının saçı da dağınık bir hâlde idi. dedi ki: Ben hemen(Hamza'yı vurduğum) harbemi ona attım ve harbemi onun iki memesi arasına yerleştirdim. Nihayet harbem onun iki küreği arasından çıktı. dedi ki: Bunun üzerine Ensâr'dan bir kişi ona doğru koştu ve başına kılıçla vurdu. ibn Abdillah ibn Ebî Seleme geçen senedle dedi ki: Abdullah ibnu’l-Fadl şöyle dedi: Bana Süleyman ibnu Yesâr haber verdi ki, kendisi Abdullah ibnu Omer'den şöyle derken işitmiştir: Museylime'nin öldürülmesi üzerine bir evin arkasından bir câriye ağlayarak: Vâh Emîru'l-Mü'minîn'e yazık oldu! Onu siyah bir köle (yani Vahşî) öldürdü, diye matem etti",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 117
			}
		}
	]
}