{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4077,
			"arabicnumber": 4077,
			"text": "Aişe r.anha'dan rivayete göre: \"Yaralandıktan sonra yine Allah'ın ve Resulünün davetine icabet edenler, onlardan iyilik yapanlar ve sakınanlar için büyük bir mükfaat vardır.\"[Ali İmran, 172] buyruğu ile ilgili olarak Urve'ye şunları söylemiştir: Kardeşimin oğlu, senin iki baban Zübeyr ve Ebu Bekir bunlar arasında idi. Uhud günü Resulullah Sallallahu Aleyhi ve Sellem'in başına gelenler gelip çatınca müşrikler de onu bırakıp geri dönünce tekrar (Müslümanların üzerine) geri geleceklerinden korktu. Kim onların arkasından gider, diye sordu. Aralarından yetmiş kişi bunun için öne çıktı.\" (Urve) dedi ki: Aralarında Ebu Bekir ve Zübeyr'de vardı. Fethu'l-Bari Açıklaması: \"Allah'ın ve Resulünün davetine icabet edenler[Ali İmran, 172] buyruğu\" Başlık, bu buyruğun nüzuI sebebi ve bunun Uhud ile alakası olduğu anlamındadır. İbn İshak dedi ki: Uhud Şewalin ortası ve cumartesi günü oldu. Ertesi gün Şewalin 16'sına rastlayan Pazar günü Resulullah salı allah u aleyhi ve sellem'in münadisi halk arasında, düşmanın arkasından gidip, düşmanı takip etmek için nida ettirdi ve, bizimle beraber ancak dün Uhud'da bulunanlar çıkabilir, dedi. Cabir b. Abdullah da onunla birlikte çıkmak için izin isteyince ona izin verdi. O Sadece düşmanları korkutmak için ve karşı karşıya kaldıkları musibetlerin kendilerini, düşmanlarını takip etmekten yana acze düşürmediğini anlamalarını sağlamak için çıktı. Hamrau'l-Esed denilen yere ulaşınca Huzaalı Said b. Ebi Mabed onunla karşılaştı. Bana Abdullah b. Ebi Bekr'in anlattığına göre ashabının karşı karşıya kaldığı musibet dolayısıyla ona taziyede bulundu ve Ebu Süfyan ile beraberindekilerle er-Ravha denilen yerde karşılaşmış olduğunu, kendi kendilerini: Muhammed'in ashabının pek çoğunu ve onların ileri gelenlerini öldürdüğümüz halde onları toptan imha etmeden geri döndük diye kınadıklarınr, bunun üzerine Mabed'in onlara Muhammed (Uhud'a) katılmayıp, Medine'de geri kalanlardan oluşan benzerini görmediğim büyük bir toplulukla sizin arkanızdan sizi takip etmek üzere yola koyulduklarını haber verdiğini söyledi. (Abdullah b. Ebi Bekr) dedi ki: Bu onları görüşlerinden vazgeçirdi, bunun üzerine Mekke'ye geri döndüler",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 122
			}
		}
	]
}