{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4086,
			"arabicnumber": 4086,
			"text": "Ebu Hureyre r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem gözcülük yapmak üzere bir seriyye gönderdi. Başlarına da Asım b. Sabit'i -ki bu da Ömer b. el-Hattab'ın oğlu Asım'ın dedesidir- kumandan tayin etti. Onlar da yola koyuldular. Usfan ile Mekke arasında bir yerde iken Huzeyllilere mensup Lihyan oğulları diye anılan bir kola onlardan bahsedildi. Bunlar da yaklaşık yüz okçu ile birlikte onların peşlerine düştüler, izlerini takip ettiler. Nihayet onların konakladıkları bir yere vardılar. Orada Medine'den beraberlerinde azık olarak almış oldukları hurma çekirdeklerini buldular. Bu Yesrib (Medine) hurması(nın çekirdiği)dir, dediler. Onların izlerini takip ettiler ve sonunda onlara yetiştiler. Asım ve arkadaşlarına yaklaştıklarında Fedfed denilen yere sığındılar. Onları takip edenler gelip, etraflarını sardılar ve, eğer yanımıza inip gelecek olursanız sizden hiçbir kimseyi öldürmeyeceğimize dair size söz ve teminat veriyoruz, dediler. Asım: Ben bir kafirin himayesini kabul ederek yerimden inmem. Allah'ım sen bizim durumumuzu Nebiine bildir, dedi. Onlarla aralarında Asım'ın da bulunduğu yedi kişiye atılan oklarla öldürünceye kadar çarpıştılar. Geriye Hubeyb, Zeyd ve bir başka kişi kaldı. Bunlara da söz ve teminat verdiler. Söz ve teminat vermeleri üzerine yanlarına indiler. Onları ellerine geçirince yaylarının kirişlerini çözerek kirişlerle onları bağladılar. Bu ikisiyle birlikte olan o üçüncü şahıs: Bu sözde durmayışın başıdır diyerek, onlarla birlikte gitmek istemedi. Kendileriyle beraber gelsin diye onu sürükleyip uğraştılarsa da o bunu kabul etmeyince onu öldürdüler. Hubeyb ile Zeyd'i alıp Mekke'ye götürüp orada sattılar. Hubeyb'i, el-Haris b. Amir b. Nevfel oğulları satın aldı. Bedir günü el-Haris'i öldüren kişi Hubeyb'in kendisi idi. Bu sebeple onların yanında bir süre esir kaldı. Nihayet onu öldürmek üzere ittifak ettiklerinde o da etek traşı olmak üzere el-Haris'in kızlarından birisinden bir ustura istedi. O da ona verdi. (el-Haris'in kızı) dedi ki: Ben fark etmeden küçük bir çocuğum onun yanına suzülüverdi ve yanına varınca alıp onu uyluğu üzerine oturttu. Onu görünce öyle bir korkuya kapıldım ki Hubeyb de benim korktuğumu anladı. Ustura da elinde idi. Bu çocuğu öldüreceğimden mi korkuyorsun? Ben inşallah böyle bir şey yapmayacağırTı dedi. el-Haris'in kızı şöyle derdi: Ben hiçbir. zaman Hubeyb'den daha hayırlı bir esir görmüş değilim. Andolsun onu bir üzüm salkımından üzüm yerken gördüm. Halbuki o gün Mekke'de meyve namına bir şey yoktu. Üstelik o zincirler de vurulmuştu. Şüphesiz ki o Allah'ın ona ihsan ettiği bir rızıktan başka bir şey değildi. Onu öldürmek üzere alıp Harem'in dışına çıktılar. Hubeyb: Bırakın da iki rekat namaz kılayım dedi. Daha sonra yanlarına döndüğünde şunları söyledi: Şayet benim ölümden korktuğumu zannetmeyecek olsaydınız daha da kılacaktım. Böylelikle Hubeyb öldürülme esnasında iki rekat namaz kılma sünnetini başlatan ilk kişi oldu. Daha sonra: Allah'ım, onları sayılarıyla tek tek biliyorsun. (Hepsini helak eyle), diye dua ettikten sonra şunları söyledi: \"Aldırmam Müslüman olarak öldürülsem Allah için hangi yanım üzere yıkılsam Dilerse mübarek kılar (elbet) uğrunda Rabbim Parçalanmış bir vücudu, olsa da darmadağın\" Daha sonra Ukbe b. el-Haris kalkıp onu öldürdü. Kureyş onu (öldürüldüğünü) tanımak amacıyla cesedinden bir parça getirsinler diye bazılarını gönderdiler. Asım da Bedir günü onların büyüklerinden birisini öldürmüştü. Yüce Allah bulutu andıran bir arı sürüsünü gönderdi ve Kureyşlilerin elçi olarak gönderdikleri kimselere karşı onu korudular. Ondan hiçbir şeyalamadılar",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 130
			}
		}
	]
}