{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4087,
			"arabicnumber": 4087,
			"text": "Amr'dan rivayete göre o Cabir'i şöyle derken dinlemiştir: \"Hubeyb'i öldüren kişi Ebu Sirvaa'dır.\" Fethu'l-Bari Açıklaması: \"er-Radı ... gazvesi\" er-Radı, Huzeyl'liler yurdundan bir yerin adıdır. Vaka ona yakın bir yerde cereyan ettığinden ona bu ad verilmiştir. \"Bi'ri Maune\" de Mekke ile Usfan arasında Huzeyl topraklarından bir yerdir. Bu vaka aynı zamanda Kurra seriyesi diye de bilinir. Sözü geçen Ri'I ve Zekvan oğulları ile meydana gelmiştir. \"Onların yanında esir kaldı. Nihayet onu öldürmeyi kararlaştırdılar.\" İbn Sa'd'ın rivayetinde şöyle denilmektedir: Her ikisihi haram aylar çıkana kadar hapsettiler. Daha sonra onları Ten'im denilen yere çıkartıp, ikisini de orada öldürdüler. Bureyde b. Sufyan'ın rivayetinde: \"Onu esir tuttukları sürece ona kötü muamele ettiler. O da onlara: Şerefli olan insanlar esirlerine böyle muamele etmez dedi. Bundan sonra ona güzel muamele etmeye başladılar. Onu gözetmek üzere bir kadının yanında bıraktılar\" demektedir. İbn Sa'd da Nevfel oğullarının azadlısı olan Mevheb yoluyla şöyle dediğini zikretmektedir: Hubeyb -ki onu yanında bırakmışlardı- bana: Ey Mevheb, senden üç şey istiyorum. Bana tatlı su içir, putlar üzerinde onlar adına kesilmiş olan yiyecekleri benden uzak tut, beni öldürmek istediklerinde de bana bildir, dedi. \"Andolsun onun bir üzüm salkımından yediğini gördüm. O gün Mekke'de meyve namına bir şey yoktu.\" İbn İshak'ın daha önce geçtiği üzere İbn Ebi Necih'ten şöyle denilmektedir: \"Evinde bir adamın başı gibi bir üzüm salkımı vard!.\" \"Bu, ancak Allah'ın ona verdiği bir rlZıkt!.\" İbn Sa'd'ın rivayetinde: \"Allah'ın Hubeyb'e ihsan ettiği bir rızıktı\" denilmektedir. İbn Battal der ki: Yüce Allah'ın bunu kafirlere karşı bir ayet (belge, mucize) ve risaletinin doğruluğunu ispatlamak üzere nebisinin lehine bir burhan (kesin delil) kılmış olması mümkündür. Günümüzde Müslümanlar arasında böyle bir şeyin kendisine verilmiş olduğunu iddia eden kimselerin ise bu sözlerinin açıklanacak bir tarafı yoktur .. Çünkü Müslümanlar dine girmiş, nübuwete kesin olarak inanmış bulunuyorlar. Onların nezdinde böyle bir belgenin (kerametin, mucizenin) izhar edilmesinin anlamı ne olabilir ki? Böyle bir iddiayı kabul etmenin tek sakıncası cahil bir kimsenin kalkıp bu gibi alametlerin nebi olmayan bir kimsenin elinde ortaya çıkması mümkün olduğuna göre, bir Nebi böyle bir şey gösterirse onu nasıl tasdik edebiliriz? Çünkü Nebi olmayanların da bu gibi şeyleri ortaya koydukları kabul edilmektedir, şeklindeki bir itirazdan başkası sözkonusu olmasa dahi, böyle bir yolu kapatmak için bu gibi işlerin gerçekleştiğini kabul etmemek gerekir, der ve nihayet şunları söyler: Ancak bu tür işler harikulade türden olmayıp, herhangi bir eşyanın mahiyetini değiştirmiyar ise kabul edilebilir. Mesela yüce Allah'ın bir kulunun duasını derhal kabul etmesi ve buna benzer fazilet sahibinin faziletini ve velinin kerametini ortaya koyan türden olması hali müstesnadır. Yüce Allah'ın Asım'ı düşmanları onun saygınlığını çiğnemesinler diye korumuş olması da bu kabildendir. İbn Batlal'ın sözleri burada sona ermektedir. Hülasa İbn Battal kerameti kabul edenlerle, etmeyenler arasında orta bir yol izlemiş ve kabul ettiği kerametleri bazen bazı şahıslardan görülen ve harikulade olmayan türden olanları kabul etmiştir. Kabul edilemeyecek olanlar ise mesela eşyanın mahiyetini değiştiren türden gösterilen işlerdir. Ehl-i sünnetin meşhur görüşü ise mutlak olarak kerametin varlığını kabul etmektir .. Fakat Ebu'I-Kasım el-Kuşeyri gibi bazı muhakkikler bazı Nebilerin meydan okumak üzere gösterdikleri halleri istisna ederek şunları söylemektedir: Babasız bir evladı var etmek gibi bir dereceye de asla ulaşamazlar. . Bu görüş bu husustaki görüşlerin en mutedil alanıdır. Anında duanın kabul edilmesi, yemeğin ve suyun arttırılması, gözden uzak hallerin mükaşefe ile bilinmesi, gelecekte olacak bazı şeyleri haber vermek ve benzeri hususlar gerçekten çokça görülür. O kadar ki salih olduğu kabul edilen kimselerin bu gibi şeyleri göstermeleri tabii bir hadise halini almıştır. O halde şu an için olağan üstü hal el-Kuşeyri'nin söylediklerine münhasır kalmış olur ve herhangi bir Nebiin göstermiş olduğu her bir mucizenin bir veli için keramet olarak meydana gelmesi mümkündür, diye mutlak ifade kullananların sözlerine kayıt getirmek de muayyen bir hal alır. Bütün bunların ötesinde avamın kabul ettiği şu kanaat vardır: Olağan üstü bir hadiseyi göstermek o işi yapanın yüce Allah'ın velilerinden olduğunun delilidir. Oysa bu böyle bir şey söyleyenin bir yanlışlığı, bir hatasıdır .. Çünkü olağan üstü bir hal bazen sihirbaz, kahin ve rahip gibi batıl üzere olan bir kimse vasıtasıyla da gösterilebilir. O halde böyle bir olağan üstü hali Allah'ın velisi oluşa delil gösteren kimselerin bu konuda ayırtedici bir özelliği de ortaya koymaları gerekir. Bu hususta söylenenlerin en uygunu ise böyle bir işi gösteren kimsenin halinin sınanmasıdır. Eğer bu kimse şer'i emir ve yasaklara sımsıkı bağlı birisi ise bu onun veli oluşunun bir alameti olur. Aksi takdirde olmaz. Tevfik Allah'tandır. \"Daha sonra Ukbe b. el-Haris kalktı ve onu öldürdü.\" Ebu'l-Esved'in, Urve 'den diye naklettiği rivayette şöyle denilmektedir: \"Kendisi dar ağacında iken silahlarını vücuduna yerleştirdiklerinde ona seslenerek yemin ettirdiler: Muhammed'in senin yerinde olmasını ister misin, diye sordular. O: Vallahi'l-azim hayır, onun ayağına batacak bir diken karşılığında bile kurtulmak istemem.\" Kureyş Asım'ı tanımak üzere vücudundan bir şey getirsinler diye birtakım kimseleri gönderdi. Asım Bedir günü onların büyüklerinden birisini öldürmüştü.\" Muhtemelen sözü edilen büyük kişi Ukbe b. Ebi Muayt'tır. Asım, Bedir'den dönmelerinde n sonra Nebi s.a.v.'in emriyle onu öldürmüştü. \"Bulut gibi bir an sürüsü\" sözü edilen \"ed-deber\"in eşek anı an olduğu söylendiği gibi erkek anlar olduğu da söylenmiştir. \"Onu korudular\" yani onlara karşı onu korudular. \"Ondan hiçbir şeyalmaya güç yetiremediler.\" Şube'nin rivayetinde şöyle denilmektedir: \"Etinden hiçbir şey koparamadılar.\" İbn İshak'ın, Asım b. Ömer'den, onun Katade'den diye naklettiği rivayetinde şöyle denilmektedir: \"Asım b. Sabit Allah'a ebediyyen bir müşriğe dokunmayacağına, bir müşriğin de kendisine dokunmayacağına dair söz vermişti. Ömer bu haber kendisine ulaşınca şöyle derdi: Allah mu'min kulunu hayatta iken koruduğu gibi vefatından sonra da korur.\" Hadisten anlaşıldığına göre, esir alınan bir kimse kendisine verilen emanı kabul etmeyebilir ve öldürülecek dahi olsa kendisine erişilmesine, dokunulmasına izin vermeyebilir. Bu ise kafir bir kimsenin hükmünün kendisi hakkında uygulanmasını kendi gururuna yedirmemesi dolayısıyla yapılır. Elbetteki bu hüküm azimeti uygulamak istediği takdirde sözkonusudur. Şayet ruhsat yönünü seçmek isterse onların emanını kabul edebilir. Hasan-ı Basri der ki: Bunda bir sakınca olmaz. Süfyan es-Sevri ben bunu mekruh görüyorum. demiştir. Hadisten Çıkarılan Sonuçlar 1-Müşriklere verilen söze bağlı kalınır, onların çocuklarını öldürmekten sakınılır, kendisini öldürmek isteyen kimselere karşı da yumuşak davranılır. 2-Evliyanın kerameti kabul edilir. Müşriklere de genelleştirmek suretiyle bed- dua edilebilir. 3-Öldürülmeden önce namaz kılmak meşrudur 4-Öldürülme halinde şiir düzülüp söylenebilir 5-Hadisten Hubeyb'in güçlü bir yakıne sahip olduğu ve dininde oldukça salebetli olduğu anlaşılmaktadır. 6-Yüce Allah,ezeli bilgisine uygun olarak Müslüman kulunu ona daha çok sevap vermek üzere birtakım belalara maruz bırakabilir .. Çünkü yüce Rabbimiz dileseydi, ona bunları yapamazlardı. 7 -Müslümanın duası kabul edilir, o hayatta iken de, ölümünden sonra da ilahı ikrama mazhar olur. Buna benzer dikkatle düşünüldüğü takdirde hadisten daha başka hususlar da anlaşılabilir. Yüce Allah'ın bedenini müşriklerden korumaya dair duasını kabul etmekle birlikte, onu öldürmelerine engelolmayışı, ona şehadeti nasip ederek ikramda bulunmayı murad etmiş olmasından dolayıdır. Etinden bir parçanın koparılmasını engellemek suretiyle onun himaye edilmesi de onun kerametlerindendir. 8-Hadisten Kureyş müşriklerinin Harem bölgesine ve Haram aylara büyük derecede saygı gösterdikleri de anlaşılmaktadır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 131
			}
		}
	]
}