{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4091,
			"arabicnumber": 4091,
			"text": "Bana Enes (radıyallahü anh) şöyle tahdîs etti:Peygamber (sallallahü aleyhi ve sellem), Enes'in dayısı Haram ibn Mılhân'ı -ki o, Enes'in anası Ümmü Suleym'in erkek kardeşidir- yetmiş süvârî içinde Benû Âmir kabîlesine gönderdi. Bu göndermenin sebebi şudur: Müşriklerin başkanı olan Âmir ibnu't-Tufeyl (Benû Amir hey'etiyle beraber Medine'ye)Peygamber'e geldiği zaman, Peygamber'i şu üç teklîf arasında muhayyer kılıp bunlardan birini tercîh etmesini söylemişti: Ya şehirliler senin, köyler ahâlîsi benim olur. Yâhud hepsi senin olur da ben sana halîfe olurum. Yâhud bunlardan hiçbirini kabul etmezsen, ben Gatafân ahâlîsinden bin al at ile bin al kısrak süvârîsini önüme katarak sana hücum ederim, dedi. ham teklifler üzerine Peygamber: \"Yâ Allah! Âmir'in belâsını bana bırakmadan kendin sav \" diye duâ etti. Akabinde Amir, Benû Selûl'den bir kadın olan Ümmü Fulanın evinde tâûn hastalığına tutuldu. Boynunda hıyarcığa benzer bir şiş peyda oldu. Bunu görünce fena hâlde canı sıkılan) Âmir: Deve taununa benzer bir şişlik; hem de Selûl ailesinden bir kadının evinde! İşte bu hiç olmadı! Diye hayıflandı da: Getirin atımı! Dedi; atının sırtında öldü. (Yetmişlerin kumandanı olan Munzir ibn Amr, evvelâ Haram ile iki arkadaşını ileriye gönderdi.) Ümmü Suleym'in erkek kardeşi Haram ibn Mılhân gitti. Onun beraberinde aksak bir adam ve bir de Benû Fulan'dan diğer adam da gittiler. Haram ibn Mılhân iki arkadaşına şu ta’lîmâtı verdi: Ben, Benû Âmir'in yanına varıncaya kadar siz benden uzak durmayın. Eğer onlar bana emân verirlerse, siz bana yakın durumdasınız. Yok, beni öldürürlerse siz hemen diğer arkadaşların yanına koşar haber verirsiniz! ibn Mılhân, Âmir ile cemâatine: Bana emân veriyor musunuz ki, ben Rasûlüllah'ın elçiliğini yerine ulaştırayım? dedi. böyle konuşmada iken düşmanlar içlerinden bir adama işaret verdiler. O da Harâm'ın arkasına geldi ve ona mızrak sapladı. Hemmâm: Zannederim ki, saplayan kişi, bu mızrağı Harâm'ın öbür yanından, yani göğsünden dışarı çıkartmıştır, demiştir. ibn Mılhân bu ölüm darbesini alınca (bedeninden fışkıran kana ellerini bulayıp başına, yüzüne sürmüş ve): Allâhu Ekber, Ka'be'nin Rabbi'ne yemîn ederim ki, ben kazandım! Diye bağırmış. Harâm'ın arkadaşı olan adama da yetişildi (müşrikler onu da öldürdüler). Sonra yalnız bir tepenin başında bulunan o sakat adam müstesna, müşrikler o sahâbîlerin hepsini öldürdüler. sırada Yüce Allah bizim üzerimize şu sözleri indirdi de, sonra bu sözlerin metni, okunması neshedilenlerden oldu: \"Bizler muhakkak Rabb'imize kavuştuk. O bizden hoşnûd oldu, bizi de hoşnûd etti\". fecî' haberi Peygamber'e ulaşınca, Peygamber (sallallahü aleyhi ve sellem), Allah'a ve Rasûlü'ne isyan eden şu Rı'l, Zekvân, Benû Lıhyân ve Usayya kabileleri aleyhine otuz sabah(kunûtta) beddua etti",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 135
			}
		}
	]
}