{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4100,
			"arabicnumber": 4100,
			"text": "Enes r.a. dedi ki: \"Muhacirlerle Ensar Medine'nin etrafında hendeği kazıyor, sırtlarında toprakları taşıyorken diğer taraftan şöyle diyorlardı: 'Bizler Muhammed'e bey'at edenleriz, Kaldığımız sürece ebediyyen İslam üzere.' (Enes) dedi ki: Nebi Sallallahu Aleyhi ve Sellem de onlara cevap olmak üzere şöyle diyordu: Allah'ım, ahiretin hayrı dışında hayır yoktur. Sen Ensarı ve muhadrleri mübarek kıL. (Enes) dedi ki: Onlara iki avuç dolduracak kadar arpa getirilir. Tadı değişmiş bir yağ ile onlara pişirilir, acıkmış oldukları halde önlerine koyulurdu. Yendiğinde de boğazı yakacak kadar kötü bir tadı ve kötü bir kokusu vardı.\" Fethu'l-Bari Açıklaması: \"el-Ahzab gazvesi diye de bilinen Hendek gazvesi\" Bununla bu gazvenin iki adının olduğunu kastetmektedir. Durum dediği gibidir, \"Ahzab\" bir taife, bir kesim anlamına gelen \"hizb\"in çoğuludur. Bu gazveye \"Hendek\" adının veriliş sebebi ise Nebi Sallallahu Aleyhi ve Sellem'in emri ile Medine'nin etrafında kazılan hendektir. Megazi sahiplerinin naklettiklerine göre bu görüşü ortaya atan kişi Selman'dır. Bu görüşü nakledenlerden birisi olan Ebu Ma'şer der ki: \"Selman Peymber sallallahu aleyhi ve sellem'e dedi ki: Bizler Fars ülkesinde muhasara edilecek olursak şehrin etrafında hendek kazardık. Bunun üzerine Nebi sallallahu aleyhi ve'sellem'da Medine'nin etrafında hendeğin kazılmasını emretti. Müslümanları teşvik etmek üzere bizzat kendisi de çalıştı. Bu sebeple Müslümanlar da onu bitirinceye kadar hızlıca çalıştılar. Müşrikler gelip onları muhasara ettiler.\" Bu gazveye \"Ahzab\" adının verilmesine gelince, bu da Müslümanlarla savaşmak üzere çeşitli müşrik taifelerinin bir araya gelip toplanmaları dolayısı iledir. Bunlar Kureyş, Gatafan, Yahudiler ve bunlara tabi olanlardır. Şanı yüce Allah bu kıssa ile ilgili olarak Ahzab sOresinin baş taraflarını indirmiş bulunmaktadır. Musa b. Ukbe, el-Meğazi adlı eserinde şöyle demektedir: \"Nadir oğullarının öldürülmesinden sonra Huyey b. Ahtab, Mekke'ye gidip Kureyşlileri Resulullah Sallallahu Aleyhi ve Sellem ile savaşmaya teşvik edip, kışkırttı. Kinane b. er-Rabi b. Ebi'l-Hukayk da Gatafanlılar arasında bu yolda gayret gösteriyor ve Resulullah s.a.v. ile savaşmaya onları teşvik ediyordu. Buna karşılık da onlara Hayber mahsullerinin yarısını vereceğini vaat ediyorqu. Uyeyne b. Hısn b. Huzeyfe b. Bedr el-Fezari onun bu teklifini kabul etti. Esed oğullarından kendileriyle antlaşmalı olanlara mektup yazmaları üzerine de Talha b. Huveylid kendisine itaat edenlerle birlikte onların yanlarına geldi. Ebu Süfyan b. Harb Kureyşlileri aldı ve Mer ez-Zahran denilen yerde konakladılar. Süleym oğullarından onların çağrılarını kabul edenler onlara yardım etmek üzere yanlarına geldiler. Böylelikle pek büyük bir kalabalık oluşturdular. İşte yüce Allah'ın kendilerine el-Ahzab adını verdiği kimseler bunlardır.\" İbn İshak da kendi senetleriyle sayılarının onbin kişi olduğunu zikredip şunları söylemektedir: Müslümanlar ise üçbin kişi idi. Müşriklerin dörtbin, Müslümanların bin civarında oldukları da söylenmiştir. Musa b. Ukbe'nin söylediğine göre Medine'nin muhasara edildiği süre yirmi gündür. Taraflar arasında karşılıklı ok ve taş atmanın dışında bir savaş olmadı. Sa' d b. Muaz'a bu oklardan birisi isabet etmiş ve ileride geleceği üzere bu da ölümüne sebep olmuştu. Megazi müellifleri Ahzabın geri dönüp gitmelerinin de sebebini zikretmiş bulunmaktadır. Buna göre Eşca'lı Nuaym b. Mes'ud aralarına fitne sokmuş, bu sebeple onlar da birbirleriyle ihtilafa düşmüşlerdi. Bu işi de Nebi Sallallahu Aleyhi ve Sellem'in kendisine bunu emretmesi üzerine yapmıştı. Daha sonra yüce Allah üzerlerine rüzgarı göndermiş ve bunun sonucunda darmadağın olmuşlardı. Yüce Allah da mu'minlerin savaşmalarına ihtiyaç bırakmamış. \"Musa b. Ukbe dedi ki: Bu gazve dördüncü yılın Şewal ayında olmuştur.\" Biz de bunu onun Megazi'sinden böylece rivayet etmiş bulunuyoruz. Derim ki: Bu hususta Malik de Musa'ya mutabaat etmiş ve Ahmed de bunu Musa b. DavOd'dan, o da ondan (Malik'ten) diye rivayet etmiştir. İbn İshak der ki: Hendek hicretin beşinci yıl Şewal ayında olmuştur. Megazi müelliflerinden başkası da bunu böylece ifade etmiştir. Ancak musannıf Musa b. Ukbe'nin görüşüne meyletmiş ve bunu bu başlığın ilk hadisleri arasında yer alan İbn Ömer'in söylediği Uhud günü Nebiin teftiş i esnasında ondört yaşında, Hendek günü ise onbeş yaşında olduğunu belirten ifadesi ile pekiştirmeye çalışmıştır. Bu durumda her iki gawe arasında bir sene geçmiş olmaktadır. Uhud ise üçüncü yılda olmuştur. Buna göre Hendek dördüncü yılda olmuş demektir. \"Uhud günü ona arzedildiğinde ... \" Ordunun arzedilmesi demek savaşa başlamadan önce durumlarını görmek, konumlarını düzenlemek, yerleştirmek ve daha başka maksatlarla savaştan önce ne durumda olduklarını görüp tespit etmek demektir. \"Kabul etti\" savaşması için ona izin verdi. \"Yağ\" ister zeytinyağı, ister tereyağı, isterse de kuyruk yağı olsun katık olarak kullanılan yağa \"ihale\" denilir. \"Kokuşmuş\" tadı ve rengi aradan geçen uzun zaman dolayısıyla değişikliğe uğramış demektir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 144
			}
		}
	]
}