{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4101,
			"arabicnumber": 4101,
			"text": "Bize Hallâd ibn Yahya tahdîs etti: Bize Abdulvâhid ibnu Eymen, babası Eymen el-Habeşî'den -ki bu zât İbn Omer'in âzâdlısı idi- tahdîs etti ki, o şöyle demiştir: Ben Câbir'e geldim; o şöyle dedi: Bizler Hendek günü çukur kazıyorduk. Bir ara çok sert bir yer karşımıza çıktı. Bunun üzerine sahâbîler Peygamber'e geldiler ve: Hendek'te(taş parçası gibi) sert bir damar karşımıza çıktı, dediler. aleyhi ve sellem): \"Ben hendeğe ineyim\" buyurdu. Peygamber karnına(açlıktan) bir taş parçası sarılmış olarak kalktı. Çünkü biz (hendek kazarken) üç gün yiyecek içecek birşey tatmadan orada kalmıştık. Peygamber sivri balyozu eline aldı ve o kayaya vurdu. O sert kaya ince kum gibi dağıldı. Ben: Yâ Rasûlallah, eve gitmeme izin ver, dedim. Evime geldiğimde eşime (Mes'ûd kızı Suheyle'ye): Ben Peygamber'de bir açlık hâli gördüm ki, artık sabrolunur şey değildir. Evinde yiyecek birşey var mı? Diye sordum. Yanımda biraz arpa ile bir keçi oğlağı var, dedi. Hemen keçi oğlağını kestim. Eşim de o arpayı öğüttü. Nihayet eti çömleğe koyduk. Hamur mayalanıp fırına, çömleği de tandıra konulduktan ve bunlar güzel pişmeye başladıktan sonra ben Peygamber'e geldim ve: Yâ Rasûlallah, biraz yiyeceğim var, bir veya iki kişi ile kalk buyur gel, dedim. Rasûlüllah: \"Yiyeceğin ne kadardır?\" diye sordu. Ben de mikdârım bildirdim. \"O! Hem çok, hem de güzel!\" buyurdu. Aynı zamanda: \"Kadınına söyle! Ben evinize gelinceye kadar çömleği tandırdan, ekmeği de fırından ayırmasın!\" diye tenbîh etti. ardındanRasûlüllah orada bulunanlara: \" (Ey hendek ahâlîsi!) Kalkınız(Câbir'in ziyafetine gideceğiz)\" buyurdu. umûmî da'vet üzerine Muhacirler ve Ensâr kalktılar. Câbir karısının yanına girince telâşından: Allah sana iyilik versin! Peygamber Muhâcirler'i, Ensâr'ı ve yanında bulunan kimseleri getiriyor, diye endîşesini belirtti. Peygamber yemeğimizin mikdârım sana sordu mu? dedi. Evet, sordu, dedim. Mademki biz evimizdeki yiyeceği Peygamber'e bildirdik, gerisini Allah ve Rasûlü bilir, dedi.) halkıyle evimizin önüne gelince yanındaki topluluğa): \"Giriniz ve birbirinizi sıkıştırmayarak serbest oturunuz\" buyurdu. bölük bölük oturdular.) Sonra Rasûlüllah kendi eliyle (çömleği ve fırının kapağını açtı), ekmeği fırından alıp parçalamağa ve üzerine et koyup -çömleği ve fırını kapayarak- da'vetlilere sunmaya başladı. Rasûlüllah bu suretle ekmek bölüp üstüne et koymağa ve -her defasında çömleği ve fırını kapayarak- hendek halkına dağıtmağa devam etti. Nihayet da'vetliler doydular. Yemek de arttı kaldı. Rasûlüllah, Câbir'in kadınına: \"Bu geri kalanı sen ye ve başkalarına da hediye et. Çünkü bütün insanlara açlık isabet etmiştir\" buyurdu",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 145
			}
		}
	]
}