{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4108,
			"arabicnumber": 4108,
			"text": "Abdullah ibnu Omer (radıyallahü anh) şöyle demiştir: Siffîn vak'ası sırasında kızkardeşim Hafsa'yı ziyaret edip yanına girdim. O esnada ablam yıkanmıştı da saç örgüleri su damlatır hâldeydi. Alî ile Muâviye'nin hükümet da'vâsı gördüğün hâle girdi. (Mekke'de, Medine'de sağ kalan sahâbîleri bu işi müzâkere etmeye çağırıyorlar.) Fakat benim için emîrlik ve meliklikten birşey takdir edilmemiştir(benim bu işle ilgim yoktur, onun için ben müzâkereye gitmeyeceğim), dedim. Buradan gidecek hey'ete sen de katıl. Çünkü Sufyânîler senin durumuna muhakkak bakıyorlardır. Senin gitmekten çekinmeni, muhalefet sanmalarından korkarım, dedi. Hafsa, kardeşi İbn Omer'i iki hakemin toplanma yerine gönderinceye kadar boş bırakmadı.(Nihayet İbn Omer, hakemlerin bulunduğu yere vardı ve aralarında cereyan eden dolambaçlı vakıada hazır bulundu.) hüküm vermesinden sonra insanlar dağılınca Muâviye kendisini halîfe sayarak bir hutbe yaptı da, hutbenin bir cümlesinde Alî'ye meyl ve mahabbeti olan Abdullah ibn Omer'le babası Omer'e ta'rîz edip: Bu halifelik işi hakkında her kim benimle konuşmak isterse yüzünü bize göstersin! Muhakkak ki, biz halifeliğe hem ondan, hem de babasından (yani Omer'den) daha haklıyız! Demiştir. yaşta bir sahâbî olan râvî Habîb ibn Mesleme, ibn Omer'e: Sen Muâviye'ye cevâb vermedin mi? diye sordu. Abdullah ibn Omer: Hemen maşlahımın bağını çözdüm de ona: Bu halifelik işine senden daha haklı ve daha lâyık olan, Uhud günü, Hendek günü islâm'ı korumak üzere sana ve baban Ebû Sufyân'a karşı harb eden kişidir (yani Alî'dir), demek istedim. Fakat İslâm topluluğunun arasını açacak, kan dökecek ve istemediğim ters bir ma'nâya hamlolunacak bir kelime söylemekten korktum. Ve o anda Allah'ın sabreden kuluna hazırladığı mükâfatını hatırladım(da Muâviye'ye karşılık vermedim), demiştir. ibn Omer'in bu sözlerini dinleyen Habîb ibnu Mesleme -Muâviye tarafdarı olmakla beraber- onun görüşündeki doğruluğu takdir ederek: Sen Allah tarafından bir fitneden korunmuş ve büyük bir fenalıktan muhafaza edilmişsin! Demiştir. şeyhi Mahmûd ibn Gaylân el-Mervezî, Abdurrazzâk'tan gelen bir rivayetinde saç örgüleri ma'nâsında olarak geçen \"Nesvâtuha\" kelimesi yerine vâv'ın sîden öne alınmasıyle \"Nevsâtuha\" şeklinde söylemiştir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 152
			}
		}
	]
}