{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4133,
			"arabicnumber": 4133,
			"text": "Salim b. Abdullah b. Ömer, babasından rivayetle \"Resfılullah Sallallahu Aleyhi ve Sellem iki kesimden birisine namaz kıldırırken diğer kesim düşmana karşı durmuştu. Daha sonra arkasında namaz kılanlar gidip diğer arkadaşlarının yerinde durdular. Öbürleri gelince onlara da bir rekat kıldırdı, sonra onlar arkasında iken selam verdi. Onlar ayağa kalkıp geri kalan rekatlerini kaza ettiler (kıldılar). Öbürleri de kalkıp diğer rekatlerinin kazasını yaptılar.\" Fethu'l-Bari Açıklaması: \"Nebi sallallahu aleyhi ve sellern ile birlikte Nahl denilen mevkide idik deyip, korku namazını nakletti.\" Buhari bu hadisi muhtasar ve muallak olarak zikretmiş bulunmaktadır. Çünkü onun bundan maksadı Cabir yoluyla gelen rivayetlerin ittfakla korku namazının kılındığı gazvenin Zatu'r-Rikal gazvesi olduğunu belirtmektir. Ancak böyle bir iddia su götürür. Zira Hişam'ın Ebfı'z-Zfıbeyr yoluyla gelen bu rivayeti bir başka hadisin bir başka gazvede (korku namazının kılındığını) göstermektedir. Bunu şöyle açıklayabiliriz: Bu hadisin Tayalisi ve başka kaynaklardaki rivayetlerinde \"müşrikler şöyle demişlerdi: Onları bırakın. Onların kendi öz çocuklarından daha çok sevdikleri bir namazıarı vardır. (Cabir) dedi ki: Bunun üzerine Cibril inip ona (durumu) haber verdi. O da ashabına ikindi namazını kıldırdı ve onları iki saf halinde dizdi\" diyerek korku namazının nasıl kılınacağını nakletti. Bu olay ise Usfan gazvesinde cereyan etmiştir. Bu hadisi de Müslim rivayet etmiş bulunmaktadır. \"Bu benim korku namazına dair duyduklarım ın en hasenidir.\" Bu ifade Maliklin korku namazının nasıl kılınacağına dair değişik şekiller ihtiva eden rivayetler duymuş olmasını gerektirmektedir. Durum da böyledir. Nebi sallallahu aleyhi ve sellern'den korku namazının nasıl kılınacağına dair çeşitli şekilleri ihtiva eden rivayetler gelmiş bulunmaktadır. Bazı ilim adamları bu farklı şekilleri durumların farklılığı ile açıklamışlardır. Diğerleri ise bu hususta genişliğin bulunduğu ve herhangi bir şekli alıp ona göre kılmakta muhayyer olduğu şeklinde açıklamışlardır. Bundan önce \"korku namazı\" bahsinde bu hususa işaret edilmiş bulunmaktadır. Şafiı, Ahmed ve Davfıd da bu keyfiyeti tercih hususunda İmam Malik'e muvafakat etmişlerdir. Çünkü bu keyfiyete dair rivayete çokça muhalif rivayet bulunmamaktadır. Ayrıca savaş hali için de daha ihtiyatlı bir şekildir. Bununla birlikte İbn Ömer hadisinde zikredilen keyfiyeti de caiz kabul etmektedirler. İbn Ömer yoluyla gelen hadiste sözü edilen keyfiyetin neshedildiğine dair bir görüş Şafil'den nakledilmiş ise de böyle bir kanaati belirttiği sabit olarak ondan gelmemiştir. Malikilerin ifadelerinin zahirinden anlaşıldığına göre İbn Ömer'in rivayet ettiği hadiste sözkonusu edilen keyfiyet caiz kabul edilmemiştir. \"İbn Ömer r.a. dedi ki: Resulullah s.a.v. ile birlikte Necid taraflarına yaptığı bir gazada bulundum. Düşman ile karşı karşıya geldik.\" Onlarla savaştık demektir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 177
			}
		}
	]
}