{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "Bana Abdulazîz ibnu Abdillah tahdîs etti: Bize İbrahim ibnu Sa'd, Salih ibn Keysân'dan tahdîs etti ki, İbn Şihâb şöyle demiştir: Bana Urve ibnu'z-Zubeyr, Saîd ibnu'l-Müseyyeb, Alkame ibnu Vakkaas ve Ubeydullah ibnu Abdillah ibn Utbe ibn Mes'ûd, Peygamber(sallallahü aleyhi ve sellem)'in zevcesi Âişe(r.anha)'den, iftira sâhiblerinin kendisi için söyledikleri zamanki hadîsini tahdîs ettiler. Bu dört râvîden herbiri bana Âişe hadîsinden bir kısmı tahdîs ettiler. Bunların bâzısı, Âişe hadîsini diğer bâzısından daha iyi muhafaza edici ve hadîsi aynen getirip nakletmekte, daha sağlam tesbît edici idi. İşte ben bu râvîlerin herbirinden, onların Âişe'den bana tahdîs ettikleri bu hadîsi iyice belleyip muhafaza ettim. Bunların bâzısı hernekadar hadîsi diğerinden daha iyi muhafaza edici ise de, bunlardan bâzısının hadîsi diğer bâzısının hadîsini tasdîk etmektedir. Bunlar söylediler ki, Âişe(r.anha) şöyle demiştir: aleyhi ve sellem) bir sefere çıkmak istediği zaman kadınları arasında kur'a çekmek âdetinde idi. Kadınlardan hangisinin kur'ası çıkarsa, Rasûlüllah onu beraberinde sefere çıkarırdı. dedi ki: Rasûlüllah, yapacağı bir gazve hususunda da aramızda kur'a çekti ve bu kur'ada benim ismim çıktı. Bunun üzerine ben, hicâb âyetinin indirilmesinin ardından Rasûlüllah'ın beraberinde sefere çıktım. Ben hevdecimin içinde taşınır ve (konak yerinde) hevdec içinde indirilirdim. Bütün yolculuğumuzda bu şekilde yürüdük. Nihayet Rasûlüllah bu gazvesinden ayrılıp da döndüğü ve bizler de dönücüler olarak Medine'ye yaklaştığımızda(bir konak yerine indi, gecenin bir kısmını orada geçirdi, sonra) hareket edilmesini i'lân etti. Hareket emrini bildirdikleri zaman ben kalkıp (ihtiyâcımı yerine getirmek için yalnız başıma) ordudan öteye yürüdüm. Hacetimi yerine getirdiğim zaman dönüp yerime geldim. Bu sırada göğsümü yokladım. Bir de gördüm ki, Yemen'in gözboncuğundan dizilmiş gerdanlığım kopup düşmüş. Hemen dönüp gerdanlığımı aradım. Fakat onu aramak beni yoldan alıkoydu. dedi ki: Benim yol nakliyâtımı yapmakta olan kimseler gelip hevdecimi yüklenmişler ve onu bindiğim deve üzerine götürmüşlerdi. Onlar beni hevdecin içindeyim sanıyorlarmış. O zaman kadınlar hafif idiler, etlenip yağlanmazlar ve onları et bürümezdi. Çünkü onlar az yemek yerlerdi. Bu sebeble bana hizmet edenler hevdeci yüklemek üzere kaldırıp taşıdıklarında, hevdecin ağırlık derecesinin farkına varmayarak yüklemişler. Bilhassa ben o zaman yaşı küçük, taze bir kadındım. Onlar deveyi kaldırmışlar ve yürüyüp gitmişler. Ordu gittikten sonra ben gerdanlığımı buldum. Akabinde ben ordu birliklerinin konakladıkları yerlere geldim, fakat oralarda ne bir çağıran, ne de cevâb veren kalmıştı. Bunun üzerine ben orada evvelce bulunduğum konak yerime geldim. Ve onlar beni hevdecde bulamazlar da, beni aramak üzere dönüp yanıma gelirler diye düşündüm. Ben bu düşünce ile yerimde otururken, gözlerim bana galebe etmiş de uyumuşum. ibnu'l-Muattal es-Sulemî, sonra ez-Zekvânî ordunun arkasından gelmekle vazifeli idi. Bu zât sabah vakti benim beklediğim yerin yanına gelmiş, uyuyan bir insan karaltısı görmüş. Beni gördüğü zaman tanımış. Zâten o, hicâb(yânı perdelenme) emrinin inmesinden önce beni görmüştü. Ben onun beni tanıdığı sırada söylediği: \"Innâ lillâhi ve innâ ileyhi râciûne (Biz muhakkak Allah'ın mülküyüz ve biz ancak O'na dönücüleriz)”(el-Bakara: 156) istircâ' sözleriyle uyandım. Uyanınca da hemen dış elbisemi bürünüp yüzümü örttüm. Allah'a yemîn ediyorum ki, biz onunla tek kelime konuşmadık ve ben ondan \"înnâ lillâhi ve innâ ileyhi râciûn\" istircâ' sözünden başka bir kelime işitmedim. Çabuk yürüdü, nihayet devesini çöktürdü, binebilmem için devenin ön ayağına bastı. Ben de deveye doğru kalkıp bindim. Safvân, bindiğim deveyi önünden çekerek yürüdü. Nihayet biz öğlenin evvelinde, sıcağın şiddet vaktine girmişler ve hepsi konak yapmışlar hâlde, orduya yetiştik. dedi ki: Bu sırada (hakkımda iftira ederek) helak olan helâk olmuştur. İftiranın büyüğüne ve çoğuna girişen, Selûl kadının oğlu Abdullah ibnu Ubeyy olmuş (ve bu, ordu içinde yayılmış). Bu iftira hadîsinin yayıldığı ve bu söz Abdullah ibn Ubeyy'in yanında konuşulur olup, onun bu sözü söyleyeni ikrar ettirip dinlemek istediği ve bunu açıkça yaymak istediği bana haber verildi, demiştir. yine Urve: İftira sâhiblerinden olan diğer insanlar içinde yalnız Hassan ibn Sabit, Mıstah ibnu Usâse ve Hamme bintu Cahş'ın isimleri söylenmiştir. Benim, Yüce Allah'ın buyurduğu gibi onların bir topluluk olduklarından başka, onların isimleriyle ilgili hiçbir bilgim yoktur. Şübhesiz o günâhın büyüğünü, çoğunu üzerine alan kimse, Abdullah ibnu Ubeyy ibn Selûl'dür denilirdi, demiştir. Urve dedi ki: Âişe kendi huzurunda şâir Hassân'a sövülmesini çirkin görür ve: Çünkü Hassan: inne ebî ve vâlidehû ve ırdî irdi Muhammedin minkum vıkaau benim babam ve babamın babası ile benim şeref ve namusum, Muhammed'in şerefi ve nâmûsu için size karşı mahfazadır) beytini söylemiştir, der idi. dedi ki: Bizler Medine'ye geldik. Geldiğim zaman ben bir ay hasta oldum. Bu sırada insanlar iftira sahiplerinin sözlerine dalmışlar. Ben ise bunlardan hiçbir şeyin farkında olamıyordum. Yalnız hastalığımda beni işkillendiren bir husus vardı: Peygamber'den, hastalandığım başka zamanlarda görmekte olduğum lütuf ve şefkati bu hastalığımda görmüyordum. Sâdece yanıma giriyor, selâm veriyor, sonra da (adımı söylemeden): \"Hastanız nasıl?\" diyordu. bu hâl beni şübhelendirip üzüyordu. Fakat ben şerri hissetmiyordum. Nihayet ben hastalığımdan yeni iyileşip, henüz nekahet devresine girdikten sonra dışarıya çıktım. Benimle beraber Mıstah’ın anası da hacet def etme yerlerimiz olan Menâsi' tarafına doğru çıktı. Oraya biz ancak geceden geceye çıkardık. Bu âdet, evlerimizin yakınında helâlar edinmemizden önce idi. dedi ki: O zamanlar bizim dışarı çıkmaktaki hâlimiz ibtidâî Arablar'ın sahradaki çukurlar yönüne çıkıp temizlenmelerine benziyordu. Biz evlerimizin yakınında helâlar edinmekten eziyetlenip incinirdik. dedi ki: İşte ben Mistah'ın anasıyle dışarı çıkıp gittim. Bu kadın, Ebû Ruhm ibnu'l-Muttalib ibn Abdi Menâf’ın kızıdır. Annesi de Sahr ibn Âmir'in kızıdır ki, bu kadın da Ebû Bekr es-Sıddîk'ın teyzesidir. Ebû Rumh kızının oğlu da Mıstah ibnu Usâsete'bni Abbâd ibn Muttalib'dir. Orada hacetimizi gördükten sonra ben ve Ebû Rumh kızı evimden tarafa dönüp gelirken, Mıstah'ın anasının ayağı yün çarşafı içinde sürçtü. (Arablar arasında felâket zamanında söylenmesi âdet olan \"Düşmanın helak olsun!\" duası yerine) bu kadın: Mıstah helak olsun! diye oğluna beddua etti. Ben de ona: Ne fena söyledin! Bedir'de hazır bulunan bir kimseye mi sövüyorsun? dedim. bana: Âh şu sâf taze! Sen onun söylediği sözü işitmedin mi? dedi. Ben: O ne dedi ki? Diye sordum. üzerine o bana iftira sâhiblerinin sözünü söyleyip haber verdi. dedi ki: Artık hastalığımın üstüne bir hastalık daha arttı. Evime dönünce yanıma Rasûlüllah geldi. Selâm verdikten sonra: \"Hastanız nasıldır?\" diye sordu. Ben de kendisine: Babamla anamın yanına gitmem için bana izin verir misin? Dedim. Ben o sırada bu haberi babamla anam tarafından tahkik etmek istiyordum, demiştir. dedi ki: Rasûlüllah bana izin verdi. Ben de ebeveynimin yanına geldim ve anam (Ümmü Rûmân)'a: Ey anneciğim! İnsanlar ne konuşuyorlar? Dedim. Annem: Ey kızcağızım! Kendini üzme, sen kendini ve sağlığını düşün. Vallahi bir erkeğin yanında sevgili, parlak, güzel bir kadın olsun ve onun birçok ortakları bulunsun da onun aleyhinde çok lâf etmesinler; bu, pek nâdirdir, dedi. de: Subhânallah! İnsanlar bunu mu konuşmaktalarmış? dedim. dedi ki: Ben bunun üzerine bütün gece ağladım. Sabaha kadar gözümün yaşı dinmiyor, gözüme de hiçbir uyku girdiremiyordum. Sonra ağlayarak sabaha ulaştım. dedi ki: Rasûlüllah da o sabah Alî ibn Ebî Tâlib'i ve Usâmetu'bnu Zeyd'i yanına çağırmıştı. Vahy gecikince ailesi ile ayrılması hususunda onlarla istişare ediyordu. dedi ki: Usâme ibmı Zeyd'e gelince, o, Peygamber'in ailesinden bilip durduğu berâeti ve Ehlu Beyt için gönlünde besleyip durduğu sevgiyi Rasûlüllah'a tavsiye ve işaret etti de: Yâ Rasûlallah! Onlar Senin ehlindir. Biz onlar hakkında hayırdan başka birşey bilmeyiz, dedi. ibn Ebî Tâlib'e gelince, o da: Allah Sana dünyâyı dâr etmemiştir. Âişe'den başka kadınlar çoktur. Maamâfîh Âişe'nin cariyesi Berîre'ye de sor, o da Sana doğru söyler, demişti. üzerine Rasûlüllah, Berîre'yi çağırıp: \"Ey Berîre! Âişe'de sana şübhe veren bir hâl gördün mü?\" diye sordu. de: Seni hakk peygamber olarak gönderen Allah'a yemîn ederim ki, ben Âişe'den kendisini ayıplayabileceğim bir kusur olmak üzere kat'iyyen şundan başka birşey görmüş değilim: Âişe yaşı küçük, taze bir kadındı. Ailesinin hamurunu yoğururken uyurdu da evin besi koyunu gelir, hamuru yerdi, demiş. dedi ki: Bunun akabinde Rasûlüllah o gün minber üzerinde ayağa kalktı ve iftirayı en evvel ortaya çıkaran Abdullah ibn Ubeyy'den dolayı söz söylemekte ma'zûr tutulmasını isteyerek, kendisi minber üzerinde olduğu hâlde hitâb edip: \"Ey müslümânlar topluluğu! Ev halkım hususunda bana ezası ulaşan bir şahıstan dolayı bana kim yardım eder? Vallahi ben ehlim hakkında hayırdan başka birşey bilmiş değilim. Bu iftiracılar bir adamın da ismini ortaya koydular ki, bu zât hakkında da ben hayırdan başka birşey bilmiyorum. Bu ismi söyleyen kimse şimdiye kadar benimle beraber olmak müstesna, ailemin yanına girer değil\" demiştir. dedi ki: Bunun üzerine Ensâr'ın Evs kabilesinden Abdu'l-Eşhel oğulları'nın kardeşi Sa'd ibnu Muâz ayağa kalkmış ve : Yâ Rasûlallah! O kimseye karşı Sana ben yardım edeceğim. Eğer bu iftirayı çıkaran Evs'ten ise ben onun boynunu vururum. Eğer Hazrec kardeşlerimizden ise, yapılacak işi Sen bize emredersin, biz de emrini yerine getiririz, demiştir. dedi ki: Bu defa Hazrec kabîlesinden bir adam ayağa kalkmış. Hassan ibn Sâbit'in anası onun soyundan olup, amcasının kızı idi. İşte ayağa kalkan bu zât, Hazrec kabilesinin seyyidi olan Sa'd ibnu Ubâde'dir. dedi ki: Sa'd ibn Ubâde bu vak'adan evvel iyi bir adamdı. bu defa kafaîle asabiyyeti onu Sa'd ibn Muâz'ın sözlerinden dolayı öfkeye sürükledi de, Sa'd ibn Muâz'a karşı: Yalan söyledin. Allah'ın ebedîliğine yemîn ediyorum ki, sen onu(yani Abdullah ibn Ubeyy'i) öldüremezsin ve onu öldürmeğe muktedir olamazsın. O, senin cemâatinden biri olmuş olaydı sen onun öldürülmesini istemezdin, demiş. defa da Sa'd ibnu Muâz'ın amcasının oğlu Useyd ibnu Hudayr ayağa kalkarak, Sa'd ibnu Ubâde'ye karşı: Allah'ın ebedîliğine yemîn ediyorum ki, sen yalan söylüyorsun. Vallahi biz onu elbette öldürürüz. Sen muhakkak münafıksın ki, münafıklar hesabına bizimle mücâdele ediyorsun! Demiş. dedi ki: Bu suretle Evs ve Hazrec kabileleri ayaklanmışlar, hattâ birbirleriyle vuruşmayı kasdetmişler. Rasûlüllah ise minber üzerinde dikiliyormuş. dedi ki: Rasûlüllah (minberden inip) onlar sükûnete varıncaya kadar, onlara yumuşak sözler söylemiş, kendisi de (başka şey söylemeyerek) sükût etmiş. dedi ki:(Bana gelince:) Ben o günümün tamâmında hep ağladım. Ne gözümün yaşı dindi, ne de gözüme bir uyku değdirebildim. Babamla anam benim yanımda sabahladılar. Ben iki gece ve bir gün devamlı ağladım. Gözümün yaşı dinmiyor ve gözüme uyku girdiremiyordum. Hattâ ben ağlamak ciğerimi parçalayacak sanıyordum. Bu şekilde ebeveynim yanımda oturdukları, ben de ağlamakta bulunduğum sırada Ensâr'dan bir kadın benim yanıma girmeye izin istedi. Ben de o kadına izin verdim. O da oturup benimle ağlıyordu. dedi ki: Biz bu hâl üzere iken, Rasûlüllah yanımıza girdi. Selâm verdikten sonra oturdu. dedi ki: Halbuki Rasûİullah, bundan evvel hakkımda dedikodu başladığı günden beri yanımda oturmamıştı. Ve Rasûlüllah bir ay beklediği hâlde kendisine benim hakkımda birşey vahyolunmuyordu. dedi ki: Rasûlüllah oturduğu zaman şehâdet kelimelerini söyledikten sonra:- \"Amma ba'du: Yâ Âişe! Hakkında bana şöyle şöyle sözler erişti. Eğersen bu isnâdlardan berî isen, Allah seni yakında berî kılıp temizliğini i'lân edecektir. Yok, eğer böyle bir günâha yaklaştınsa Allah 'tan mağfiret iste ve tevbe et. Çünkü kul, günâhım i'tirâf ve sonra da tevbe edince Allah da onun tevbesini kabul eder\" dedi. dedi ki: Rasûlüllah bu hutbesini bitirince(musîbetin şiddetli harâretiyle) gözümün yaşı kesildi, hattâ gözyaşımdan bir damla bulamıyordum. Hemen babama: Rasûlüllah'ın söylediği söz hususunda benim tarafımdan cevâb ver, dedim. Vallahi Rasûlüllah'a ne diyeceğimi bilmiyorum, dedi. Sonra anama: Rasûlüllah'ın söylediği söze benim adıma cevâb ver, dedim. O da: Ben Rasûlüllah'a ne diyeceğimi bilmiyorum, dedi. Bunun üzerine ben henüz Kur'ân'dan delîl okuyamayan küçük yaşta bir taze olduğum hâlde, şöyle dedim: Vallahi ben kat'î anladım ki, siz bu dedikoduyu işitmişsiniz. Hattâ bu söz sizin gönüllerinizde yerleşmiş ve siz ona inanmışsınız. Şimdi ben size \"ben ondan beriyim\" desem, benim muhakkak berî olduğumu Allah bilip dururken, sizler benim bu sözümü tasdîk etmiyeceksiniz. Ve eğer benim muhakkak berî olduğumu Allah bilip dururken, ben sizlere fena bir i'tirâfta bulunsam, sizler beni hemen tasdîk edeceksiniz. Vallahi ben bu vaziyette kendim için ve sizin için başka bir mesel bulamıyorum. Ancak Yûsuf'un babası Ya'kûb'un (o sıkıntı içinde) söylediği şu sözünü buluyorum: \"Fe sabrun cemî-lun v 'allahu’l mustaânu alâ mâ tasıfûn(Artık bana düşen) güzel bir sabırdır. Sizin şu söylediklerinize karşı yardımına sığınılacak, ancak Allah'tır)\" (Yûsuf: 18). bu sözü söyledikten sonra dönüp yatağıma yattım. Öyle bir hâlde ki, Allah o zaman benim berî olduğumu biliyordu ve Allah muhakkak benim berî olduğumu ortaya koyacaktı. Lâkin vallahi ben Allah'ın bana âid bir iş için okunacak bir vahiy indireceğini zannetmiyordum. Ve şânım da haddizatında bana âid bir mes'elede Allah'ın bir emirle tekellüm etmesinden çok hakîr idi. Lâkin ben Rasûlüllah'ın uykusunda bir ru'yâ görmesini ve Allah'ın da bu ru'yâ ile benim temizliğimi ortaya koymasını umuyordum. Vallahi Rasûlüllah oturduğu yerden kalkmamıştı. Ev halkından bir kimse de dışarı çıkmamıştı. Nihayet üzerine vahiy indirildi. O'na vahiy inerken olagelen hâl hemen gelip O'nu kaplayıverdi ki kış gününde bile üzerine indirilen sözün ağırlığından dolayı kendisinden inci taneleri gibi terler dökülürdü. dedi ki: Rasûlüllah'tan vahiy hâli gidip de açılınca, kendisi sevincinden gülüyordu. Tekellüm ettiği ilk söz: \"Yâ Âişe! Allah seni kat'î olarak temize çıkarmıştır\" demesi oldu. dedi ki: Bunun üzerine anam bana: Kızım, Rasûlüllah'a doğru kalk da teşekkür et, dedi. Ben: Hayır, vallahi, ben ne O'na doğru kalkarım, ne de berî olduğumu indiren Azîz ve Celîl Allah'tan başkasına hamd ederim, dedim. dedi ki: Yüce Allah: \"O uydurma haberi getirenler içinizden bir zümredir. Onu sizin için bir şerr sanmayın. Bil'akis o sizin için bir hayırdır. Onlardan herkese kazandığı günâh vardır. Onlardan günâhın büyüğünü üzerine alan o adama da büyük bir azâb vardır...\"(en-Nûr:11-12) on âyet indirdi. İşte sonunda Allah bu âyetleri benim temizliğim hakkında indirdi. Ebû Bekr es-Siddîk, akrabalığından ve fakirliğinden dolayı nafaka vermekte bulunduğu Mıstah ibnu Usâse için: Kızım Âişe'ye bu iftirayı söyledikten sonra vallahi ben de Mıstah'a birşey vermem! Diye yemîn etti. üzerine Yüce Allah: \"Sizden fazilet ve servet sahibi olanlar, akrabasına, yoksullara, Allah yolunda hicret edenlere vermelerinde kusur etmesin; affetsin, aldırış etmesin. Allah'in size mağfiret etmesini arzu etmez misiniz? Allah çok mağfiret edici, çok merhamet eyleyicidir\"(en-Nûr: 22) âyetini indirdi. âyetin inmesi üzerine Ebû Bekr es-Sıddîk: Vallahi ben Allah'ın beni mağfiret etmesini elbette severim! dedi ve Mıstah'a veregeldiği nafakayı tekrar vermeye başladı ve: Ben bu nafakayı ondan ebediyyen koparmam, dedi. dedi ki: Rasûlüllah, zevcesi Zeyneb bintu Cahş'a da benim hâlimden: Yâ Zeyneb! Âişe hakkında ne bilirsin ve ne gördün? Diye sormuştu. cevaben: Yâ Rasûlallah! Ben kulağımı, gözümü işitmediğim, görmediğim şeylerden muhafaza ederim. Vallahi Âişe hakkında hayırdan başka birşey bilmem, diye güzel şâhidlik etmiştir. dedi ki: Zeyneb, Peygamber'in kadınları arasında güzelliği ve Peygamber'in yanındaki mevkii i'tibâriyle bana rekaabet eden bir kadındı. Fakat Allah onu verâ ve takvası sebebiyle (iftiracılara katılmaktan) korudu. Kızkardeşi Hamne bintu Cahş ise o iftiraya taassubla tutunmaya ve iftiracıların söylediklerini hikâye etmeye başladı da, bu sebeble helak olanlar içinde helak oldu. İşte bu, o zümrenin işinden bize ulaşmış olan hadîstir, demiştir. Sonra Urve şöyle dedi: Âişe dedi ki: Vallahi hakkında dedikodu yapılan o adam muhakkak: Subhânallah! Nefsim elinde olan Allah'a yemîn ederim ki, ben hayâtımda hiçbir dişinin elbisesini asla açmamışımdır (yânı hiçbir kadınla cinsî yaklaşma yapmamışımdır), der dururdu. o zât(yani Safvân ibn Muattal) bu işlerin ardından Allah yolunda şehîd olarak öldürülmüştür",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 185
			}
		}
	]
}