{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4199,
			"arabicnumber": 4199,
			"text": "Enes b. Malik r.a.'dan rivayete göre \"Resulullah Sallallahu Aleyhi ve Sellem'in yanına birisi gelerek: Eşek (etleri) yenildi, dedi. Allah Resulü sesini çıkarmayıp, sustu. İkinci defa onun yanına geldi ve: Eşek (etleri) yenildi dedi. Yine sesini çıkarmayıp sustu. Sonra üçüncü defa ona gelerek: Eşekler yok edildi, bitirildi, dedi. Bunun üzerine bir münadiye emir verince münadi: Şüphesiz Allah ve Resulü size ehli eşek etlerini yasaklamaktadır, diye seslendi. Bunun üzerine içinde etlerin kaynadığı kazanlar döküldü.\" Fethu'l-Bari Açıklaması: \"Geceleyin Hayber'e vardı.\" Yani oraya yaklaştı. \"Çapalarıyla\" bunlar çiftçilik araçlarındandır. \"Zembilleriyle\" içinde toprak ve başka şeylerin doldurulup taşındığı büyük çe bir kaptır. \"Muhammed ve beşli\" lafzındaki beşliden kasıt ordudur. \"Harap oldu Hayber\" Cihad bölümünde şu ifadeler de yer almaktadır: \"Ellerini kaldırarak: Allahuekber harap oldu Hayber, diye buyurdu.\" es-Süheyll der ki: Bu hadisten tefaül'ün (hayra yormanın) caiz olduğu anlaşılmaktadır .. Çünkü Nebi s.a.v. ellerinde yıkmaya yarayan araçları görünce bu halden şehirlerinin yakında tahrip olacağı neticesine ulaşmıştır. Allah Resulünün: \"Harap oldu Hayber\" demesi, vahye istinaden de olabilir. Bunu da daha sonra hadiste yer alan: \"Şüphesiz biz bir kavmin düzlüğüne indik mi inzar olunanların sabahı pek kötü olur\" şeklindeki sözleri desteklemektedir. \"Sizlere yasaklamaktadırlar.\" Bu ifade yüce Allah'ın adının, başkası ile birlikte aynı zamirde kullanılmasının caiz olduğunun delilidir. Böylelikle Nebi Sallallahu Aleyhi ve Sellem'in hutbe irad eden kimseye: \"Sen kavmin ne kötü hatibisin\" demiş olmasını dayanak gösterenlerin iddiası, buradaki ifade ile reddedilebilmektedir. O hatibe bu sözleri söylemesine sebep ise hatibin: \"İkisine isyan eden de haddini aşmış olur\" demiş olmasıydı. Daha önce bu hususlar ile ilgili çeşitli konulara Namaz bölümünde işaret edilmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 239
			}
		}
	]
}