{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4202,
			"arabicnumber": 4202,
			"text": "Bize Ya'kûb ibn Abdirrahmân el-İskenderânî, Ebû Hâzım'dan; o da Sehl ibn Sa'd es-Sâidî (radıyallahü anh)'den tahdîs etti(ki, o şöyle demiştir): Rasûlüllah (sallallahü aleyhi ve sellem) ile müşrik Yahudiler(Hayber harbinde) karşılaştılar da cenk ettiler. (O günün harbi sona erip) Rasûlüllah kendi askerî karargâhına, öbürleri de kendi askerî karargâhlarına dönmüşlerdi. Fakat Rasûlüllah'ın sahâbîleri içinde bir adam vardı ki, o, düşman ordusundan ayrı düşen, yahut orduya katılmamış bulunan Yahudi'nin arkasını bırakmayıp amansız ta'kîb ediyor ve kılıcıyla ona vuruyordu.(Bu adamın cenkçiliği hakkında) : Bu gün bizden hiçbir kişi Fulân'ın gösterdiği kahramanlık derecesinde yeterlilik göstermedi, denildi. üzerine Rasûlüllah: \"Dikkat, o kişi muhakkak cehennem ehlindendir\" buyurdu. Sahâbîlerden bir kişi(Eksum ibn Ebi’l-Cevn el-Huzâî): Öyleyse ben onunla beraber olup, onu gözetleyeceğim, dedi. Sehl dedi ki: Bu Huzâalı kişi o adamla beraber harb sahasına çıktı ve harb saffının neresinde durduysâ, o da onunla beraber orada durdu. O kişi harbde ne kadar çeviklik gösterdiyse, Huzâalı kişi de onunla birlikte çeviklik gösterdi. Sehl dedi ki: Nihayet o adam ağır şekilde yaralandı. (Bu yaranın acısıyle) ölümün acele gelmesini istedi de kılıcını(yani kılıcın demirini) yere koydu, kılıcın ağzını ise iki memesi arasına koydu ve kılıcın üstüne yüklendi. Bu suretle kendisini öldürdü. Bunun üzerine Huzâalı Eşlem, Rasûlüllah'ın huzuruna çıktı ve: Yâ Rasûlallah, ben şehâdet ederim ki, Sen muhakkak Allah'ın Rasûlü'sün! Dedi. \"Bu şehâdetin sebebi nedir?\" diye sordu. Huzâalı kişi: Biraz önce cehennem ehlinden olduğunu haber verdiğin o kişi, hakîkaten cehennemliklerdendir. Onun cehennemliklerden olduğu hakkındaki sözünüzü insanlar zihinlerinde büyüttüler. Ben de bu adamı sizin için ta'kîb eder gözetlerim demiştim. Ve hakîkaten ardısıra çıkıp, onun her hareketini araştırdım. Nihayet bu adam ağır şekilde yaralandı ve ölümün çabuk gelmesini isteyerek kılıcının demirini yere, keskin ağzını da iki memesi arasına koydu. Sonra kılıcın üstüne yüklendi. Ve bu suretle kendisini öldürdü, dedi. sırada Rasûlüllah: \"İnsanlar arasında bir sınıf kişi vardır ki, halka görünüşe göre cennet ehline yaraşan hayırlı işler yapar; Halbuki o cehennemliklerdendir. Yine insanlardan bir kısım da yardır ki, halka görünüşüne göre cehennemliklere âid kötü işler yapar; Halbuki o cennetliklerdendir!\" buyurdu",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 242
			}
		}
	]
}