{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4205,
			"arabicnumber": 4205,
			"text": "Ebu Musa el-Eş'arı r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem Hayber gazasına gidince -ya da: Resulullah Hayber'e yönelince- askerler bir vadinin tepesine çıktıklarında yüksek sesle tekbir getirerek: Allahuekber Allahuekber la ilahe illallcth demeye koyuldular. Resulullah Sallallahu Aleyhi ve Sellem da: Kendinize acıyınız, sizler ne sağır birisine, ne da gaib olan birisine dua ediyorsunuz. Sizler her şeyi çok iyi işiten, pek yakın olan ve sizinle beraber olan birisine dua ediyorsunuz, diye buyurdu. O sırada ben Resulullah Sallallahu Aleyhi ve Sellem'in bineğinin arkasında idim. Benim: La havle ve la kuwete illa billah dediğimi işitince, bana: Ey Abdullah b. Kays, dedi. Ben: Buyur ey Allah'ın Resulü dedim. Şöyle buyurdu: Ben sana cennet hazinelerinden bir hazine olan bir sözü ağreteyim mi? Ben: Buyur ey Allah'ın Resulü, babam anam sana feda olsun deyince, o: La havle ve kuwete illa billah demektir, diye buyurdu.\" Fethu'l-Bari Açıklaması: \"İnsanlar bir vadinin tepesine çıktı -diye hadisi Ebu Musa'nın sözlerine kadar zikretti.- Benim: La havle ve la kuwete illa billah dediğimi işitti.\" Hadisin bu anlatımı onların Hayber'e giderken bu olayın meydana geldiği izlenimini vermektedir. Oysa durum böyle değildir. Aksine bu onların Hayber'den dönüşleri sırasında olmuştur .. Çünkü bu başlıkta onun nakledilecek hadisinden açıkça anlaşılacağı gibi o Hayber fethedildikten sonra Cafer ile birlikte (Habeşistan'dan) geri gelmişti. Buna göre zikredilen bu hadiste şu anlamda hazfedilmiş ifadeler bulunmaktadır: \"Nebi s.a.v. Hayber'in üzerine gidip, orayı muhasara edip fethettikten sonra fethi bitirip geri döndüğünde askerler bir vadinin tepesine çıktılar ... İleride yüce Allah'ın izniyle Deavat (dualar) bölümünde (6384. hadiste) hadis metninin şerhine dair açıklamalar gelecektir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 245
			}
		}
	]
}