{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4213,
			"arabicnumber": 4213,
			"text": "Enes r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Hayber ile Medine arasında Safiyye ile gerdeğe girmek üzere üç gece kaldı. Ben de Müslümanları onun düğün ziyafetine davet ettim. O ziyafette ekmek ve etten başka bir şey yoktu. Yine o ziyafette Bilal'e emir verdi ve sofraların serilmesini söyledi. Sofralara hurma, keş ve tereyağı bırakıldı. Müslümanlar: Acaba mu'minlerin annelerinden birisi mi yoksa sağ eliyle malik olduğu (cariyeleri)nden mi olacak, dediler. Yine şöyle dediler: Eğer onu h icab ın arkasına alırsa mu'minlerin annelerinden birisi demektir. Eğer onu hicabın arkasına almazsa o sağ elinin sahip olduklarından birisi olacak demektir. Yola koyulunca arkasında ona yer hazırladı ve hicabı gerdL\" Fethu'l-Bari Açıklaması: \"Onu kendisi için ıstıfa etti (seçti).\" Ebu Davud ve Ahmed -sahih olduğunu da belirterek- Aişe'nin şöyle dediğini rivayet etmektedir: \"Safiyye alınan safilerdendi.\" Muhammed b. Slrln bunu Ebu Davud'un ondan sahih bir senetle zikrettiğine göre şöylece açıklamıştır: Nebi Sallallahu Aleyhi ve Sellem'e de Müslümanlarla birlikte bir pay ayrılırdı. Safiye ise onun beşte birdeki payından ve her şeyden önce alınan bir baş (şahıs) idi.\" Katade yoluyla gelen rivayette de şöyle denilmektedir: \"Nebi Sallallahu Aleyhi ve Sellem bir gaza yaptığı vakit onun dilediği yerden alabildiği katıksız bir payı (safiy) oluyordu. İşte Safiyye de bu paydan idi.\" Denildiğine göre Safiyye'nin esir alınmadan önce adı Zeynep idi. O safiy olunca ona Safiyye adı verilmiştir. \"Temizlendi\" ay halinden temizlendi. \"Onunla gerdeğe girdi.\" Buna dair açıklamalar ile birlikte onun Safiyye ile evlenmesiyle ilgili hadisin diğer bölümlerine dair açıklamalar yüce Allah'ın izniyle Nikah bölümünde (5086. hadiste) gelecektir. \"Arkasında bir abayı etrafında dolayarak ona yer hazırladı.\" Yani etrafını örtüyle kapattığı bir yer hazırladı. Bunu \"haviye\" denilen ve binenin etrafında dolanan içi dolgulu bir giyecektir. \"Hayber yolunda Huyey kızı Safiyye'nin yanında üç gün kaldı ve onunla gerdeğe girdL\" Yani Allah Resulünün Safiyye ile gerdeğe girdiği konaklama yerinde üç gün kaldı. Yoksa üç gün yol aldıktan sonra gerdeğe kaldı, demek değildir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 253
			}
		}
	]
}