{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4239,
			"arabicnumber": 4239,
			"text": "Yahya b. Said dedi ki: Bana dedem haber verdi: \"Eban b. Said, Nebi Sallallahu Aleyhi ve Sellem'in huzuruna geldi, ona selam verdi. Ebu Hureyre: Bu İbn Kavkal'ın katilidir dedi. Eban da Ebu Hureyre'ye: Hayret sana ey Kadum-ı Da'n'dan yuvarlanıp gelmiş yabani kedi! Allah'ın ellerimle kendisini şereflendirdiği elleriyle de beni hakir düşürmesine engel olduğu bir adam dolayısıyla mı beni ayıplıyorsun?\" Fethu'l-Bari Açıklaması: \"Da'n Kadumu'ndan sarkıp gelmiş bir dağ kedisi\" Hadisi burada böylece ihtisar etmiş bulunmaktadır. Daha önce Cihad bölümünde (2827. hadiste) geçmiş bulunmaktadır. Bundan sonraki hadisle açıklaması gelecektir. \"Resulullah Sallallahu Aleyhi ve Sellem Eban'ı Medine'den Necid taraflarına gönderdiği bir seriyenin başında kumandan olarak gönderdi.\" Bu seriyenin durumu ile ilgili bir şey bilmiyorum. Eban'a gelince, o Eban b. Said b. el-As b. Umeyye'dir. Ebu Hureyre'nin kendisine hadisi naklettiği Said b. el-As'ın da amcasıdır. Eban Hudeybiye gazvesinden sonra Müslüman olmuştu. Daha önce Hudybiye'nin şartları ile ilgili olayları ve diğer hususları anlatırken burada sözü geçen Eban'ın Hudeybiye'de Osman b. Affan'a himaye verdiğini, böylelikle Mekke'ye girebildiğini ve Resulullah s.a.v.'in mesajını tebliğ etmesini sağladığını belirtmiş idik. Bu gazve ile ilgili anlatılanlarda da Hayber gazvesinin Hudeybiye dönüşünden sonra gerçekleştiğini belirtmiş idik. İşte bu durum Eban'ın Hudeybiye'nin akabinde Müslüman olduğu intibaını vermektedir. Böylelikle Nebi Sallallahu Aleyhi ve Sellem'in de onu bir seriye ile birlikte göndermesi mümkün olmuştur. \"Bunu sen mi söylüyorsun?\" Yani sen aslında onun yakınlarından, kavminden ve şehrinden olmamakla birlikte Resulullah'ın yanında böyle bir konum ve böyle bir mevkide nasılolabilirsin? \"Ey yabani kedi\" Bu yırtıcı ve kediye benzer küçük bir hayvandır. el-Hattabi der ki: Eban bu sözleriyle Ebu Hureyre'yi tahkir etmek istemiştir. Onun Allah Resulüne bir şeyler vermesi ya da vermemesi ile ilgili görüş belirtecek kadar bir değere sahip olmadığını, savaşabilme gücünün de çok az olduğunu anlatmak istemiştir. \"(Dağdan) inip gelmiş.\" Birinci rivayette bu anlamdaki lafız \"tedella\" şeklindedir. (Burada ise tehaddera şeklindedir.) Bu da aynı anlamdadır. Yani o, bizim aramıza aniden hücum edercesine gelmiştir, demektir. \"Dal tepesinden\" Bu rivayette \"Dal\" şeklindedir. Bundan önceki rivayette ise nun (Da'n) şeklindedir. Kadam ise kenar, kıyı demektir. Da'n'ın da bir dağın tepesi olduğu söylenmiştir. Çünkü çoğunlukla koyunların otladığı yerler arasıdır. Ebu Hureyre'nin kavmi olan Devsıilerin bir dağıdır. Hadisin geri kalan kısımlarına dair açıklamalar Cihad bölümünde geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 277
			}
		}
	]
}