{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4240,
			"arabicnumber": 4240,
			"text": "Bize tmâm el-Leys ibn Sa'd, Ukayl (ibn Hâlid el-Eylî)'den; o da Muhammed ibn Şihâb'dan; o da Urve'den; o da Âi-şe (radıyallahü anh)'den (onun şöyle dediğini) tahdîs etti: Peygamber'in kızı Fâtıma aleyhi's-selâm Ebû Bekr'e haber gönderip, ondan Allah'ın, küffâr mallarından kendisine harbsiz olarak verdiği Medîne civarındaki Nadîr oğulları arazîsi Fedek hurmalıkları ve Hayber hurmalıklarının beşte birinin bakıyyesinden isabet eden mallardan Rasûlüllah'ın mîrâsını istiyordu. Ebû Bekr şöyle dedi: Rasûlüllah (sallallahü aleyhi ve sellem): \"Biz(peygamberler) vâris olunmayız. Biz ne mal bırakırsak sadakadır\" buyurdu. Ancak Muhammed ailesi bu maldan yerler (bundan fazla tasarruf hakları yoktur). Vallahi ben Rasûlüllah’ın bu sadaka malları üzerinde kendi hayâtı zamanında yürürlükte olan işlerden hiçbirşeyi değiştirmem. Ben muhakkak Rasûlüllah'ın bu mallar üzerindeki muamelesi gibi muamele yaparım, dedi. Ebû Bekr, o mallardan Fâtıma'ya herhangi birşey vermeyi kabul etmedi. Bunun üzerine Fâtıma bu hususta Ebû Bekr'e darıldı da, ondan ayrılıp gitti. Vefat edinceye kadar Fâtıma, Ebû Bekr'le konuşmadı. Fâtıma, Peygamber'den sonra altı ay yaşadı. Fâtıma vefat edince kocası Alî, onu Ebû Bekr'e bildirmeden geceleyin üzerine cenaze namazı kılıp defnetti. Fâtıma'nın hayâtında insanlar tarafından Alî'ye bir saygı, bir sevgi ciheti vardı (Fâtıma'yı teselli için meşguliyeti, bey'attan geri kalmasına sebeb sayılmıştı). Fâtıma vefat edince Alî, insanlardan bu saygı cihetini bulamadı da Ebû Bekr'le barışmayı ve onunla bey'atlaşmayı aradı. Bundan önceki altı ay içinde Ebû Bekr'e bey'at etmemişti. Alî, Ebû Bekr'e haberci gönderip: Bize gel, -Omer'in gelmesini istemediği için de- fakat yanında başka bir kimse gelmesin! dedi. Omer de (bu Ebû Bekr'e ulaşınca): Hayır, vallahi onların yanına tek başına girmeyeceksin, dedi. Ebû Bekr de: Sen Alî ve beraberindekilerin bana ne yapacaklarını sanıyorsun? Vallahi ben onlara elbette gideceğim, dedi. Ebû Bekr onların yanına girdi. Bunun üzerine Alî, şehâdet kelimelerini telâffuz etti de Ebû Bekr'e şunları söyledi: Bizler senin faziletini tanımış ve Allah'ın sana verip, sana doğru sevkeylediği hiçbir hayırda sana karşı hased etmemişizdir. Lâkin sen bize karşı bu halîfelik içinde istibdâd ettin (yani bizimle istişare etmeyip, kendi bildiğine gittin). Bizler ise Rasûlüllah'a yakınlığımızdan dolayı bu işte müşavereden bir pay görüyorduk! bunları söyleyinceye kadar Ebû Bekr'in iki gözü yaş akıttı. Bu sefer Ebû Bekr konuşunca şöyle dedi: Nefsim elinde bulunan Allah'a yemîn ederim ki, muhakkak Rasûlüllah'ın hısımlarına hizmet etmek bana kendi hısımlarıma hizmet etmemden daha sevimlidir. Amma şu, Peygamber'in geride bıraktığı mallardan dolayı sizinle aramda olan çekişmeye gelince, ben o mallarda hayırdan hicbirşey eksiltmedim ve Rasûlüllah'ın o mallarda yapmakta olduğunu gördüğüm herhangibir işi terketmeyip mutlakaa yapmışımdır, dedi. konuşma akabinde Alî, Ebû Bekr'e: Bey'at için sana va'd zevalden sonradır, dedi. Bekr öğle namazını kılınca minbere çıktı, şehâdet kelimelerini telâffuz etti de Alî'nin durumunu, bey'atten geri kalışını zikretti ve Alî'nin, kendisinden özrünün kabulünü istediği sebeble, Alî'nin özrünü kabul edip gecikmesini bağışladı. Sonra Alî istiğfar ve teşehhüd etti de, Ebû Bekr'in hakkını büyüttü(ve onunla bey'atleşti). Ve kendisinin yapmış olduğu şeye, ne Ebû Bekr'e karşı bir hased ve ne de Allah'ın Ebû Bekr'in üstün kıldığı fazîletini inkâr ve tanımamazlık düşüncesinin sevketmediğini söyledi ve şunu ilâve etti: Lâkin bu devlet başkanlığı içinde kendimiz için istişareden bir pay görüyorduk. Fakat Ebû Bekr bize karşı istibdâd etti, yani bize danışmayıp, kendi bildiğiyle hareket etti. Bu sebebden biz de gönüllerimizde darılmıştık! bu sözleriyle müslümânlar sevindiler de: Îsabet ettin(yâ Alî)! Dediler ve Alî, bey'at işine böyle güzellikle döndüğü zaman, müslümânlar Alî'ye yakın oldular",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}