{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4249,
			"arabicnumber": 4249,
			"text": "Ebu Hureyre r.a. dedi ki: \"Hayber fethedilince ResuluIlah Sallallahu Aleyhi ve Sellem'e zehir katılmış bir koyun hediye edildi.\" Fethu'l-Bari Açıklaması: \"Hayber'de Nebi Sallallahu Aleyhi ve Sellem'e ikram edilen zehirli\" yani içine zehir katılmış \"koyun\" \"Hayber fethedildiğinde Resulullah Sallallahu Aleyhi ve Sellem'e zehir katılmış bir koyun hediye edildi.\" İbn İshak der ki: Hayber fethedildikten sonra Nebi Sallallahu Aleyhi ve Sellem da kendini rahat hissettikten sonra SeIlam b. Mişkem'in hanımı Haris kızı Zeyneb ona kızartılmış bir koyun hediye etti. Daha önce de: O, koyunun en çok hangi azasmı seviyor diye sormuştu. Ona kolunu sevdiği söylenmişti. Bundan dolayı oraya çokça zehir katmıştı. Allah Resulü kolunu alıp ısırdığı bir lokmayı çiğnedi. Fakat yutmadı. Bişr b. Bera da onunla birlikte ondan yedi ve bir lokmasını yuttu ... diyerek kıssayı zikretmektedir. Allah ResLılü kadını affetti. Fakat Bişr b. Bera yediği o lokmadan dolayı vefat etti. Beyhaki, Süfyan b. Huseyn, ez-Zuhrı'den, o Said b. el-Museyyeb ile Ebu Seleme'den, ikisinin Ebu Hureyre yoluyla rivayet ettiklerine göre \"Yahudilerden bir kadın Rest1lullah sallallShu aleyhi ve sellem'e zehir katılmış bir koyun hediye etti. O da (ondan) yedi. Ashabına: Geri durunuz, bu koyun zehirlidir, dedi. Kadına da: Seni bu işi yapmaya iten ne oldu, diye sordu. Kadın: Şunu istedim, eğer sen bir nebi isen Allah seni bundan haberdar edecektir. Eğer yalancı birisi isen böylelikle insanları senden kurtarmış olacaktır, dedi. (Ebu Hureyre) dedi ki: Bunun üzerine kadına ilişmedi.\" Cabir yoluyla da buna yakın rivayet zikredilmiş, fakat: \"Onu cezalandırmadı\" demiştir. Abdurrezzak da Musannerinde Ma'mer'den, o ez-Zühri'den, o Ubey b. Kab'dan bunun benzerini rivayet etmiş ve şu fazlalığı eklemiştir: Daha sonra da omuzundan hacamat yaptırdl. (Ma'mer) dedi ki: ez-Zühri: \"Kadın Müslüman olunca ona ilişmedi\" demektedir. Ma'mer de der ki: Fakat insanlar onu öldürdüğünü söylüyorlar. Beyhaki der ki: Muhtemelen önce ona ilişmeyip bırakmış, daha sonra Bişr b. Bera yediğinden dolayı ölünce onu öldürmüştür. es-Süheyll de buna böylece cevap vermiş ve şunları eklemiştir: O önce kadına ilişmedi. Çünkü Allah Rest1lü kendisi için intikam almazdı. Daha sonra da Bişr'in ölümü üzerine kısas olmak üzere kadını öldürdü. Derim ki: Muhtemelen müslüman olduğundan ötürü ona ilişmemiş ve onu öldürmeyi Bişr'in ölümüne kadar ertelemiştir. Çünkü Bişr'in ölümü ile şartlarına uygun ona kısas uygulamak kap etmiştir. Hadisten Çıkarılan Bazı Sonuçlar 1- Hayber kıssası, pek çok hüküm ihtiva eden bir kıssa'dır: 1- Haram aylarda kafirlerle savaşmak, 2- Kendilerine davetin ulaşmış olduğu kimseleri uyarmadan baskın yapmak caizdir. 3- Ganimet paylara göre taksim edilir. 4- Ganimet paylaştırılmadan önce müşriklerden alınan yenecek şeyleri ihtiyacı olan kimseler saklamamak ve başka bir yere taşımamak şartıyla yiyebilir. 5- Orduya gelen yardımcı kuwetler savaş bitiminden sonra geldikleri takdirde, eğer çoğunluk buna razı olursa onlara da pay verilir. Ca'fer ve Eş'arilere verildiği gibi. Fakat razı olmazlarsa onlara pay verilmez. Eban b. Said ve arkadaşlarına yapıldığı gibi. Böylelikle bu husustaki haberler birbirleriyle telif edilmiş olur. 6- Ehll merkeplerin etleri haramdır. 7- Eti yenmeyen hayvanın şer'i kesim ile tahir olması sözkonusu değildir. 8- Kadınlarla mut'a nikahı haramdır. 9- Müsakat ve müzaraa akitleri caizdir. 10- İtham altında bulunan kimseler tarafından yapılan sulh ve güvenlik akitleri sabittir. 11- Zimmet ehlinden, kabul etmiş olduğu şartlara muhalefet eden kimselerin akitleri bozulmuş olur ve kanı heder olur. 12- Ganimetin paylaştırılmasindan önce ganimetten bir şeyler alan kimse ona malik olmaz. İsterse aldığı o şey hak ettiğinden daha aşağı olsun. 13- Anveten (savaşılarak) alınan araziyi imam paylaştırmak ve olduğu gibi bırakmak arasında muhayyerdir. 14- Zimmet ehline ihtiyaç kalmadığı takdirde onları başka yere sürmek caizdir. 15- Yolculukta iken evlenilen hanım ile gerdeğe girmek caizdir. 16- Kitap ehlinin yiyeceklerindenyemek, hediyelerini kabul etmek caizdir. Bu hükümlerin çoğunluğunu ilgili konularda zikretmiş bulunuyoruz. Doğruya hidayet eyleyen Allah'tır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 284
			}
		}
	]
}