{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4251,
			"arabicnumber": 4251,
			"text": "Bera r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Zilka'de ayında umre yapmak isteyince Mekke halkı onun Mekke'ye girmesine izin vermedi. Nihayet onlarla Mekke'de üç gün ikamet etmek üzere antlaşma yaptı. Taraflar antlaşma metnini yazdıklarında: Bu, Allah'ın Resulü Muhammed'in yaptığı antlaşmadır, diye yazdılar. Ancak onlar: Biz bunu kabul etmiyoruz. Senin Allah'ın Resulü olduğunu bilseydik hiçbir şeyini engellemezdik. Fakat sen Abdullah'ın oğlu Muhammed'sin dediler. Allah Resulü: Ben hem Allah'ın Resulüyüm, hem de Abdullah'ın oğlu Muhammed'im diye buyurduktan sonra Ali'ye: \"Allah'ın Resulü\" ibaresini sil, dedi. Ali: Hayır, Allah'a yemin ederim ebediyyen seni (rasulolduğunu ifade eden ibareyi) silmeyeceğim, dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem belgeyi aldı -güzelce yazı yazamıyordu- ve: Bu Abdullah'ın oğlu Muhammed'in yaptığı antlaşmadır, diye yazdı: Kınlarında olmak şartıyla kılıç dışında Mekke'ye silah sokmayacaktır. Arkasından gelmek istese dahi Mekke halkından kimseyi beraberinde götürmeyecektir. Ashabından herhangi bir kimse Mekke'de kalmak isterse ona engelolmayacaktır. Allah Resulü Mekke'ye girip belirlenen süre geçtikten sonra Ali'ye giderek: Arkadaşına bizi bırakıp çıkmasını söyle. Çünkü süre bitmiş bulunuyor, dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem çıktı. Hamza'nın kızı arkasından: Amca amca diye seslenerek yürüdü. Ali onun elinden tuttu ve Fatıma aleyhesselam'a: Amcanın kızını al ve onu bineğe bindir dedi. Fakat Ali, Zeyd ve Cafer (onu yanlarına almak) hususunda birbirleri ile anlaşmazlığa düştüler. Ali: Onu ben aldım ve o benim amcamın kızıdır, dedi. Ca'fer de: O hem benim amcamın kızıdır, hem de teyzesi benim eşimdir, dedi. Zeyd de: Bu benim kardeşimin kızıdır dedi. Nebi Sallallahu Aleyhi ve Sellem onun teyzesine verilmesine dair hüküm verdi ve: Teyze de anne konumundadır, diye buyurdu. Ali'ye: Sen bendensin, ben de sendenim; Cafer'e: Sen hilkatinle de, ah: 'kınla da bana benzemişsin; Zeyd'e de: Sen hem bizim kardeşimizsin, hem bizim mevlamızsın, dedi. Ali: Hamza'nın kızıyla evlenmez misin, deyince, Allah Resulü: O benim süt kardeşimin kızıdır, diye buyurdu",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 286
			}
		}
	]
}