{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4274,
			"arabicnumber": 4274,
			"text": "UbeydulIah b. Ebi Rafi dedi ki: \"Ali r.a.'i şöyle derken dinIedim: ResululIah Sallallahu Aleyhi ve Sellem beni, Zubeyr'i ve el-Mikdad'ı göndererek dedi ki: Ravzatuhah denilen yere varıncaya kadar gidiniz. Orada beraberinde bir mektup bulunan bir kadın bulacaksınız. O mektubu ondan alınız. (Ali) dedi ki: Atlarımızı hlZlıca koşturarak yola koyulduk ve Ravda'ya vardık. Karşımızda o kadını buluverdik. Ona mektubu çıkart dedik. Beraberimde mektup yok, dedi. Biz ya mektubu çıkartırsın yahut da elbiselerini çıkartırız, dedik. (Ali) dedi ki: Saçlarının örüğünün arasından mektubu çıkardı. Onu alıp Resulullah Sallallahu Aleyhi ve Sellem'e getirdik. Mektupta şunlar yazılıydı: Hatıb b. Ebi Beltaa'dan -Mekke müşriklerinden birkaç kişiye- ResululIah Sallallahu Aleyhi ve Sellem'in durumunu onlara kısmen haber veriyordu. Bunun üzerine ResululIah: Ey Hatıb bu da ne, diye sordu. Hatıb: Ey Allah'ın Resulü bana (ceza vermekte) acele etme. Ben sonradan Kureyş arasına katılmış bir kişi idim -yani ben onlarla antlaşmalı birisi idim, Kureyşli değildim demek istiyor.- Beraberinde bulunan muhacirlerin ise Mekke'de hanımlarını, mallarını koruyacak akrabaları vardı. Ben de onlarla nesep akrabalığın olmazsa dahi bu vesile ile onlara akrabalarımı koruyacaklarına sebep olacak bir iyilikte bulunmak istedim. Ben bu işi ne dinimden irtidad ettiğim için, ne de Müslüman olduktan sonra küfre razı olduğum için yapmış değilim. Resulullah sallalliıhu aleyhi ve sellem: Bu size doğru söylüyor, diye buyurdu. Fakat Ömer: Ey Allah'ın Resulü, bana müsaade et de bu münafığın boynunu vurayım, dedi. Allah Resulü: Ama o Bedir'de bulundu. Allah'ın Bedir'de bulunmuş olanlara muttali olup, dilediğinizi yapınız, size mağfiret buyurdum, dememiş olduğunu nereden bileceksin dedi. Bunun üzerine yüce Allah: \"Ey iman edenler! Benim de düşmanım, sizin de düşmanınız olanlan -kendilerine sevgi ile {haber} ulaştırarak ve onlar size gelmiş olan hakkı inkar etmişken- veliler edinmeyin ... Şüphesiz yolun ta ortasında sapmış olur. \"[Mümtehine, 1] diye başlayan sureyi indirdi",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 308
			}
		}
	]
}