{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4279,
			"arabicnumber": 4279,
			"text": "İbn Abbas dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem Ramazan ayında sefere çıktL Usfan'a varıncaya kadar oruç tuttu. Daha sonra içinde su bulunan bir kap getirilmesini istedi. İnsanlar kendisini görsün diye gündüzün su içti ve Mekke'ye varıncaya kadar oruç açmış haliyle devam etti'.\" (Tavus) İbn Abbas'ın şöyle dediğini rivayet etti: \"Resulullah Sallallahu Aleyhi ve Sellem seferde hem oruç tutmuştur, hem oruç açmıştır. Buna göre isteyen oruç tutar, isteyen oruç açar,\" ,. Fethu'l-Bari Açıklaması: \"Ramazan ayında fetih gazvesi.\" Bu gazve hicretin sekizinci yılı ramazan ayında olmuştur. Buna dair açıklamalar daha önce Oruç bölümünde İbn Abbas'ın bu başlıkta zikredilmiş hadisi açıklanırken yapılmıştır. Orada onların ramazan ayının onuncu günü yola çıktıkları da zikredilmiş bulunmaktadır. İbn İshak, ez-Zührl'den bu senedie şu fazlalığı da zikretmektedir: \"Nebi Sallallahu Aleyhi ve Sellem Medine'de Ebu Ruhm el-Gıfari'yi yerine vekil bırakmışt!.\" Yakub b. Süfyan'ın, İbn İshak yoluyla onun rivayet aldığı bir grup hocalarından naklettiğine göre; Mekke'nin fethi Ramazan'ın kalan on gününde olmuştur. Eğer bunu söylediği sabit ise, bundan son on gün girmeden önceki ortadaki on günde gerçekleştiğini kastettiği şeklinde yorumlanır. İkinci rivayet yolunda zikrdilen \"beraberinde onbin kişi olduğu halde\" ifadesi \"diğer kabilelerden (bu kadar kişi vardı)\" demektir. Çünkü İbn İshak ile İbn Aiz tarafından zikredilen Urve'den gelen mürsel rivayette şöyle denilmektedir: \"Daha sonra Resulullah Sallallahu Aleyhi ve Sellem muhacirlerden, ensardan Eslem, Gıfar, Muzeyne, Cuheyne ve Suleymlilerden onikibin kişi ile birlikte çıktı\" denilmektedir. Bu iki rivayetin arası Medine'den onbin kişi ile birlikte çıktığı daha sonra diğer iki binin de bunlara katıldığı şeklinde telif edilir. \"Bu onun Medine'ye gelişinden sonra sekiz buçuk yıl sonra olmuştu.\" Ma'mer'in rivayetinde bu şekilde olmakla birlikte bu bir yanılmadır. Doğrusu ise yedi buçuk sene sonra olduğudur. Bu yanılmanın sebebi Fetih gazvesinin sekizinci yılda olmasıdır. Rebiu'l-ewel'den, Ramazana kadar ise tam bir yarım senelik süre vardır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 313
			}
		}
	]
}