{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4280,
			"arabicnumber": 4280,
			"text": "Hişam, babasından rivayetle dedi ki: \"Fetih yılı Resulullah Sallallahu Aleyhi ve Sellem yola çıkınca durum Kureyş'e ulaştı. Bu sefer Ebu Süfyan b. Harb ile Hakım b. Hizam ve Budeyl b. Verka, Resulullah Sallallahu Aleyhi ve Sellem'e dair haberleri öğrenmek üzere çıktılar. Yola koyuldular ve nihayet Merru'z-Zahran denilen yere vardılar. Orada Arafafta (hacılar tarafından) yakılan ateşleri andıran ateşler gördüler. Ebu Süfyan: Bunlar da ne? Sanki Arafat'ta yakılan ateşleri andırıyor, dedi. Budeyl b. Verka: Bunlar Amr oğullarının ateşleridir, dedi. Ebu Süfyan: Amr (oğulları) bundan daha azdır, dedi. Resulullah Sallallahu Aleyhi ve Sellem'in nöbetçilerinden bir takım kimseler onları görüp arkalarından yetiştiler ve onları yakalayarak ResuluIlah Sallallahu Aleyhi ve Sellem'in huzuruna getirdiler. Ebu Süfyan Müslüman oldu. Yola çıkınca (Allah Resulü) Abbas'a: Ebu Süfyan'ı dağ geçidinin daraldığı bir yerde alıkoy ki Müslümanları görsün, dedi. Abbas da onu orada alıkoydu. Kabileler Nebi Sallallahu Aleyhi ve Sellem ile birlikte geçmeye başladı. Ebu Süfyan'ın yanından birlikler teker teker geçiyordu. Bir birlik geçince: Ey Abbas, bunlar kim diye sordu. Bunlar Gıfarlılardır dedi. Gıfar'dan bana ne, diye cevap verdi. Daha sonra Cuheyneliler geçti, yine bunun gibisini söyledi. Arkasından Sa'd b. Huzeym geçti, daha önce söylediğini tekrarladı. Suleym geçti, önce dediğini tekrarladı. Nihayet benzerini görmediği bir birlik geçince, bunlar kim dedi. Abbas: Bunlar ensardır. Başlarında da elinde sancağı tutan Sa'd b. Ubade vardır dedi. Sa'd b. Ubade: Ey Ebu Süfyan, bugün savaş günüdür, bugün Kabe('de kan dökmek) helalolacaktır, dedi. Ebu Süfyan: Ey Abbas bugün helak olacağımız gündür desene, dedi. Sonra bir başka birlik geldi. Bu, birliklerin sayıca en az olanıydı. Aralarında Resulullah Sallallahu Aleyhi ve Sellem ve ashabı da bulunuyordu. Nebi Sallallahu Aleyhi ve Sellem'in sancağı da Zubeyr b. el-Awam tarafından taşınıyordu. Resulullah Sallallahu Aleyhi ve Sellem Ebu Süfyan'ın yanından geçince: Sa'd b. Ubade'nin ne dediğini bilmiyor musun, diye sordu. Allah Resulü: Ne dedi diye sorunca, Ebu Süfyan şunları şunları söyledi, dedi. Allah Resulü: Sa'd doğru söylemiyor dedi. Aksine bugün Allah'ın Kabe'yi tazim edeceği bir gündür. Kabe'nin üstünün örtülerle kapatılacağı bir gündür.\" (Urve) dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem sancağının el-Hacun'a dikilmesini emretti.\" Urve dedi ki: \"Bana Nafi' b. Cubeyr b. Mut'im de haber vererek dedi ki:, elAbbas'ın, Zubeyr b. el-Awam'a şöyle dediğini dinledim: Ey Abdullah'ın babası, Resulullah Sallallahu Aleyhi ve Sellem sana sancağı tam buraya mı dikmeni emretti?\" (Urve) dedi ki: \"O gün Resulullah Sallallahu Aleyhi ve Sellem, Halid b. Velid'e Mekke'nin üst tarafından Keda'dan girmesini emretti. Nebi Sallallahu Aleyhi ve Sellem da Kuda'dan girdi. Halid b. Velid r.a.-'ın atlılarından o gün Hubeyş b. el-Eş'ar ile Kurz b. Cabir el-Fihri adında iki adam öldürüldü.\" Fethu'l-Bari Açıklaması: \"Fetih günü Nebi s.a.v. sancağı nereye dikti?\" Yani Nebi s.a.v.'in emriyle sancağın dikildiği yere dair açıklama. \"Arafe'de yakılan ateşler\" ifadesi ile Arapların Arafat'ta vakfe yapılacağı gece çokça ateş yakmak şeklindeki adetlerine işaret edilmektedir. İbn Sa'd'daki rivayete göre, Nebi Sallallahu Aleyhi ve Sellem'in O gece ashabına emir vermesi üzerine onbin tane ateş yaktılar. \"Resulullah'ın Sallallahu Aleyhi ve Sellem gece koruyucularından bazı kimseler onları yetişip, yakaladı.\" İbn Aiz'deki rivayette: Resulullah Sallallahu Aleyhi ve Sellem önünden casusları yakalayacak atlılar göndermişti. Huzaalılar da kimseyi yoldan geçirmiyorlardı. Ebu Süfyan ve arkadaşları Müslümanların karargahına girince gece karanlığında süvariler onları yakaladı, denilmektedir. \"Ebu Süfyan'ı alıkoy.\" Musa b. Ukbe'nin rivayetinde belirtildiğine göre elAbbas, Resulullah Sallallahu Aleyhi ve Sellem'e: Ebu Süfyan'ın geri dönüp de kafir olmayacağından emin değilim. Bu sebeple onu Allah'ın askerlerini görsün diye alıkoy, dedi. Allah Resulü de bunu yaptı. Bunun üzerine Ebu Süfyan dedi ki: Ey Haşim oğulları, ahdi mi bozuyorsunuz? el-Abbas: Hayır. Fakat benim sana bir ihtiyacım var. Sabah olsun, Allah'ın müşrikler üzerine gidecek ordusunu ve Allah'ın müşrikler için neler hazırladığını görmeni istiyorum. Bu sebeple onu sabah oluncaya kadar Erak (denilen misvak ağacı)nın berisindeki dar geçitte tuttu. \"Dağ geçidin yakınında\" yani dağ yolunun daraldığı yerde. Onu orada tutmasının sebebi, bütün askerleri görebileceği ve onlardan görmedik hiçbir kimsenin kalmayacağı bir dar geçit oluşundan dolayıdır. \"Beraberinde\" ensarın \"sancağı vardı.\" \"Sa'd b. Ubade: Ey Ebu Süfyan, bugün savaş günüdür, dedi.\" Yani bugün hiçbir şekilde (kimsenin) kurtulmayacağı bir savaş günüdür. Yani ölüm günüdür. \"Bugün Kabe'nin (hürmeti) helal kılınacak. Bunun üzerine Ebu Süfyan: Ey Abbas, bugün helak olacağımız bir gündür desene, dedi.\" Sa'd'ın \"savaş günü (yevmu'l-melhama)\" demekten kastı pek çok kimsenin öldürüleceği büyük gün olacağıdır. Ebu Süfyan'ın da: Desene bugün helak olacağımız gündür sözlerinden kastettiğiyle ilgili olarak da el-Hattabi şöyle demektedir: Ebu Süfyan bu sözünün kavmini koruyabileceği ve onlara gelecek zararı bertaraf edebileceği bir durumda olmayı temenni etmişti. Bundan kastın: Bugün namus için, aile için öfkelenilecek ve gücü yeten kimse için onlar adına intikam alınacak bir gündür. İbn İshak der ki: Sa'dlın: Bugün savaş günüdür, bugün Kabe'nin hürmetinin helal görüleceği gündür, demesini muhacirIerden birisi işitince: Ey Allah'ın Resulü, Said'in Kureyşlilere hücum etmeyeceğinden emin değilim, dedi. Allah Resulü bunun üzerine Ali'ye: Ona yetiş ve sancağı ondan aL. Sancakla (Mekke'ye) sen gir, diye buyurdu. İbn Hişam der ki: Sözü geçen adam Ömer'dir. Derim ki: Bu uzak bir ihtimaldir. Çünkü zaten Ömer'in de onlara karşı ileri derecede acımasız olduğu bilinen bir husustur. el-Umevl'nin el-Me gazi adlı eserinde rivayet ettiğine göre Ebu Süfyan Nebi s.a.v. hizaasına gelince, ona: Sen kavminin öldürülmesini mi emrettin, diye sordu. Allah Resulü: Hayır deyince, Said b. Ubade'nin söylediklerini ona aktardı. Sonra da Allah'ı ve akrabalıklarını hatırlattı. Allah Resulü: Ey Ebu Süfyan, bugün merhamet günüdür. Bugün Allah'ın Kureyş'i aziz edeceği gündür, diye buyurdu. Sa'd'a haber göndererek ondan sancağı aldı ve sancağı oğlu Kays'a teslim etti. \"Bugün Allah'ın Kabe'yi tazim edeceği bir gündür.\" Bununla İslamın açıkça ilan edilmesine Bilal r.a.'ın Kabe'nin damında ezan okumasına ve buna benzer Kabe'deki putların kaldırılarak içindeki suretlerin silinmesine ve daha başka diğer hususlara işaret etmektedir. \"Kabeiye örtülerin giydirileceği bir gündür.\" Denildiğine göre Kureyşliler Kabe'nin örtülerini Ramazan ayında değiştiriyorIardı. F!Ztih de örtülerin değiştirilme gününe denk geldi yahut da günden kasıt zamandır. \"Fetih günü\" denildiği gibi. Nebi s.a.v. bu sözleriyle bu sene Kabe'yi kendisinin örteceğini işaret etmiş olmaktadır ve nitekim dediği gerçekleşmiştir. \"Resulullah Sallallahu Aleyhi ve Sellem sancağının eI-Hacun denilen yere dikilmesini emretti.\" eI-Hacun Mekke'ye yakın bilinen bir yerdir. \"Nebi s.a.v. O gün Halid b. Velid 'e Mekke'nin üst taraflarından Keda denilen yerden girmesini emretti.\" Nebi s.a.v. da Küda'dan girdLAncak bu ileride gelecek olan sahih hadislere muhaliftir. Çünkü orada belirtildiğine göre Halid, Mekke'nin aşağı tarafından, Nebi s.a.v. de üst tarafından girmiştir. İbn İshak da kesin bir ifade ile Halid'in Mekke'nin alt tarafından, Nebi s.a.v.'in de üst tarafından girdiğini ve orada ona bir çadır kurulmuş olduğunu ifade etmiştir. \"Halid b. Velid radıyaIlilhu anh'ın süvarilerinden o gün iki adam öldürüldü.\" İbn İshak'ın zikrettiğine göre bu iki adam Halid'in askerlerinden ayrılarak tek başlarına ayrı bir yoldan gidince o gün müşrikler onları öldürdü. Yine İbn İshak'ın zikrettiğine göre Halid'in askerleri Kureyş'ten bir takım kimselerle karşılaştılar. Suheyl b. Amr ve Safvan b. Umeyye bunlar arasında idi. Bunlar Mekke'nin alt tarafında Müslümanlarla çarpışmak üzere el-Handeme denilen bir yerde toplanmışlardı. Bunlarla bir parça çarpıştılar ve Halid'in atlılarından Mesleme b. el-Meyla el-Cuhenı öldürüldü. Müşriklerden ise oniki ya da onüç kişi öldürüldükten sonra yenik düştüler. İşte bununla ilgili olarak Hamas b. Kays b. Halid el-Bekri -ki İbn Hişam der ki: Bu beyitler el-Mer'aş el-Huzll'ye aittir, denilmektedir.- Müslümanların önünden kaçışı dolayısıyla onu kınayan hanımına hitaben şöyle demiştir: \"Eğer sen Handerne gününü görmüş olsaydın, O zaman Safvan da kaçmıştı, İkrime de kaçmıştı. ' Karşımıza Müslümanların kılıçları çıkmıştı Her bir kolu ve kelleyi koparıyorlardı Darbeleriyle, geriye sadece bir hırıltı duyuluyordu O vakit bizi kınamak için tek kelime dahi söylemezdin.\" Musa b. Ukbe'de de şöyle denilmektedir: Halid b. Velid yoluna devam etti ve Mekke'nin alt tarafından girdi. Orada Bekr oğulları Haris b. Abdi Menat oğulları ile Huzeylilerden ve Kureyşlilerin yardımlarını istedikleri Ehabiş'den bir takım kimseler toplanmıştı. Bunlar Halid ile çarpışınca o da onlarla çarpıştı. Yenik düşüp geri çekildiler. Bekir oğullarından yirmi kişi kadar, Huzeylilerden üç ya da dört kişi kadar öldürüldü. Nihayet çarpışma neticesinde mescidin kapısına yakın el-Cezura'ya kadar varıldı ve hatta evlerin içine girdiler. Onlardan bazıları da dağlara çıkmıştı. Ebu Süfyan ise yüksek sesle: Kim evinin kapısını kapatır, elini savaştan çekerse o güvenlik altındadır, diye seslendi. Resulullah Sallallahu Aleyhi ve Sellem kılıç parıltılarını görünce: Bu da ne? Ben savaşmayı yasaklamamış mıydım, diye buyutunca, ona şu cevabı verdiler: Zannederiz Halid ile savaşıldı ve onlar tarafından savaş başlatıldı. O da onlarla çarpışmaktan başka bir çare bulamadı, diye cevap verdiler. (Musa b. Ukbe) daha sonra şunları söylemektedir: Resulullah Sallallahu Aleyhi ve Sellem güvenlik büsbütün sağlandıktan sonra Halid b. Velid'e: Ben sana savaşmayı yasakladığım halde niçin savaştın, diye sordu. Halid: Önce onlar bizimle savaşa başladılar ve bize silahları ile hücum ettiler. Ben de elimden geldiği kadarıyla silahlı çarpışmaya girmekten uzak kalmaya çalıştım, dedi. Bunun üzerine Allah Resulü: Allah'ın takdiri hayırlı olandır, diye buyurdu. Mekke Fethi'nde Kanı Heder Edilenler Taberani de İbn Abbas'ın şöyle dediğini rivayet etmektedir: Resulullah s.a.v. kumandanıarına kendileri ile savaşanlar dışında kimseyi öldürmemelerini emretmişti. Ancak o -isimlerini verdiği- bir kaç kişinin de kanını heder etmişti. Ben bu kimselerin isimlerini çeşitli yerlerde dağınık olarak bulunan haberlerden toplayıp bir araya getirdim. Bu kimselerin isimleri şöyledir: Abdurrahman b. Hatal, Abdullah b. Sa'd b. Ebi Serh, İkrime b. Ebi Cehil, el-Huveyris b. Lukayt, Mikyes b. Subabe, Hebbar b. el-Esved, İbn Hatal'a ait Nebi Sallallahu Aleyhi ve Sellem'i hicveden şarkıcı iki cariye, Muttalib oğullarının azatlısı Sare -ki Hatıb b. Ebi Beltea'nın mektubu onunla yakalanmıştı-. İbn Ebi Serh önce Müslüman olmuş, sonra irtidad etmişti. Daha sonra Mekke'nin fethi günü Osman Nebi Sallallahu Aleyhi ve Sellem'in huzurunda ona şefaatte bulunmuş, Allah Resuıü de kanını heder etmeyip, Müslüman oluşunu da kabul etmişti. İkrime Yemen'e kaçıp gitmişti. Hanımı el-Haris b. Hişam'ın kızı Üm mü Ha. kim arkasından giderek Resulullah Sallallahu Aleyhi ve Sellem'in verdiği em an ile hanımıyla geri dönmüştü. Huveyris ise Resulullaha Mekke'de çokça eziyet etmiş birisi idi. Mekke'nin fethedildiği günü onu Ali r.a. öldürdü. Mikyas b. Subabe önce Müslüman olmuş, sonra da ensardan bir adamın üzerine hücum edip onu öldürmüştü. Ensardan olan bu kişi de daha önce kardeşi Hişam'ı hata yoluyla öldürmüştü. Mikyas gelip diyetini aldıktan sonra ensardan olan o zatı öldürmüş, arkasından da irtidad etmişti. Onu Mekke'nin fethi günü Numeyleb. Abdullah kovdurdu. Hebbar da Müslümanlara çokça eziyet etmiş birisi idi. Resulullah Sallallahu Aleyhi ve Sellem'in kızı Zeynep hicret edince onun karşısına çıkmış, devesini dürtmüş, bu sebeple Zeynep de karnındaki cenini düşürmüştü. Vefat edinceye kadar da bu hastalık onun yakasım bırakmamışt!. Mekke fethedilip, Nebi Sallallahu Aleyhi ve Sellem, kanının heder olduğunu bildirdikten sonra o da Müslüman olduğunu ilan etmişti. Allah Resuıü de onun Müslüman olduğunu kabul ederek onu affetti. Şarkıcı iki cariyeninisimleri Ferteni ve Kureyne'dir. Bunlardan birisi için eman istenmiş, o da Müslüman olmuş, diğeri de öldürülmüştü. Sare de Müslüman olmuş ve Ömer r.a.'ın halifeliği dönemine kadar ayakta kalmıştı. Hakim yine kanı heder edilenler arasında Ka'b b. Zuheyr'i de zikretmektedir. Onun başından geçen olay meşhurdur. Bundan sonra (Nebiin huzuruna) gelmiş, Müslüman olmuş ve övücü sözler söylemişti. Vahşi b. Harb'in durumu ise daha önce Uhud gazvesinde geçmiş bulunmaktadır. Ebu Süfyan'ın hanım ı Utbe'nin kızı Hind İslama girmiş idi. İbn Hatal'ın kölesi Erneb ise öldürülmüştü. Ümmü Said da -İbn İshak'ın naklettiğine göreöldürülmüştü. Böylelikle öldürülenlerin sayısı sekiz erkek ve altı kadını bulmuş olmaktadır. Ahmed, Müslim ve Nesai, Abdullah b. Rebah yolunda Ebu Hureyre'nin şöyle dediğini rivayet etmektedirler: \"Resulullah Sallallahu Aleyhi ve Sellem geldi. İki cenahtan birisinin başına Halid b. Velid, diğerinin başına da Zubeyr'i kumandan olarak tayin etmişti. Ebu Ubeyde ise silahsızların başında idi. Bana: Ey Ebu Hureyre, bana ensarı çağır, dedi. Ben de onları çağırdım. Ensar gelip etrafını kuşattılar. Onlara: Bugün Kureyşlilerin çeşitli kabilelerden topladıkları ile onların peşinden gelenler hakkındaki görüşün üz nedir? Daha sonra bir elini diğerinin üzerine koyarak Safa'da benimle buluşuncaya kadar onları ekin kırpanlar gibi biçiniz, diye buyurdu. Ebu Hureyre dedi ki: Biz de yola koyulduk. Onlardan istediğimiz herkesi öldürdük. Ebu Süfyan gelerek: Ey Allah'ın Resulü dedi. KureyşIilerin hayatta alanlarının kanları mubah kılındı. Bu durumda bugünden sonra Kureyş kalmayacak. (Ebu Hureyre) dedi ki: Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem, kapısını kapatan güven altındadır diye buyurdu. Mekke anvetan (savaşılarak) fethedilmiştir diyenler, bu olayı delil göstermişlerdir. Çoğunluğun görüşü de budur. Şafil'den ve Ahmed'den nakledilen bir rivayete göre Mekke böyle bir em an (güvence) verildiğinden ötürü evler de sahiplerine izafe edildiğinden barış yoluyla fethedilmiştir; ayrıca Mekke paylaştırılmamıştır. Bir diğer gerekçe de ganimet alan savaşçılar Mekke'nin evlerine malik olmadılar. Aksi takdirde ev sahiplerinin evlerinden çıkarılması caiz olurdu. Birinci görüşü savunanların delilleri açıkça savaşma emrinin verilmiş olması, Halid b. Velid'in fiilen savaşmış olması, Resulullah Sallallahu Aleyhi ve Sellem'in de açıkça bir günün bir saati kadar bir sürenin helal kılınmış olmasını, bu hususta kendisine uyulmasını da yasaklamış olmasını gösterirler. Mekke'nin evlrinin paylaştırılmamasına da şöyle karşılık verirler: Evlerin paylaştırılmamış olması oranın savaş yoluyla alınmamış olmasını gerektirmez. Çünkü bir şehir fethedilmekle birlikte şehir halkı serbest bırakılır, evleri ve ganimetıeri de onlara terk edilebilir. Çünkü ganimet alınan arazinin paylaştırılması üzerinde ittifak olunmuş bir husus değildir. Hatta ashab-ı kiramın ve onlardan sonra gelenlerin bu hususta farklı görüşlere sahip oldukları sabittir. Şehirlerin bir çoğu savaş yoluyla fethedilmiş olduğu halde şehirler paylaştırılmamıştır. Bu Ömer ve Osman zamanında böyle olmuştur. Üstelik ashab-ı kiramın çoğunluğu da mevcuttu. Diğer taraftan Mekke bundan ayrı olarak diğer şehirler arasından kendisine ait bir özelliğe de sahip kabul edilebilir. Çünkü Mekke hac ibadetinin yapıldığı yer ve insanların ibadet mekanlarıdır. Yüce Allah orayı orada ibadete çekilenler için de, dışarıdan gelenler için de eşit olarak bir harem bölge kılmıştır. Ebu Hureyre'nin Nebi s.a.v.'in savaş emrini vermesine dair hadisi ile Resulullah Sallallahu Aleyhi ve Sellem'in onlara eman vermiş olduğuna dair hadisi şöyle ce telif edilebilir: Verilen eman bir şarta bağlı idi. O da Kureyşlilerin açıkça savaşmaya kalkışrrıamalarıdır. Kureyşliler kendi evlerine dağılınca ve sözü geçen emanı kabul edince, artık bunu kabul etmeyen Kureyşlilerin etrafında çeşitli yerlerden toplanmış olanlar bu emana uymadılar. Şehrin savaş yoluyla fethedilmiş olduğu anlamına gelecek şekilde Halid b. Velid ile ve beraberindekilerle savaşa giriştiler. O da onlarla çarpıştı. Nihayet onları (kimilerini) öldürdü ve onları yenik düşürdü. Ancak asıl muteber olan şehrin asıl halkını teşkil edenlerdir. Onlara uyanlar değildir. Muteber olan çoğunluktur, azınlık değildir. Fakat bununla birlikte Mekke'de ganimet paylaştırmanın ve fiilen savaşa katılan Mekke halkından herhangi bir kimsenin esir alınmadığı ittifakla kabul edilmiştir. İşte bu da Mekke anveten (savaşılarak) fethedilmemiştir diyenlerin görüşlerini destekleyen hususlardandır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 314
			}
		}
	]
}