{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4285,
			"arabicnumber": 4285,
			"text": "Ebu Hureyre r.a. dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem Huneyn'e gitmek isteyince şöyle buyurdu: Yarın inşallah konaklayacağımız yer, küfür üzere yeminleştikleri yer olan Kinane oğullarının Hayri olacaktır.\" Fethu'l-Bari Açıklaması: \"Tercı'\" okuyanın harfi boğazında terdidi demektir. \"Ona Akil ve Talib mirasçı oldu.\" Hac bahsinde ve Yunus'un, ez-Zühri'den naklettiği rivayette şu lafızia geçmişti: \"Akiı, Talib ile birlikte Ebu Talib'e mirasçı olmuştu. Fakat Cafer de, Ali de ondan hiçbir miras almamışlardı. Çünkü onlar Müslüman idiler. Akil ile Talib kafirdiler.\" İşte bu, bu hükmün İslamın ilk dönemlerinde de bulunduğunun delilidir. Çünkü Ebu Talib hicretten önce ölmüştü. Hicret gerçekleştikten sonra Akil ile Talib'in, Ebu Talib'in geriye bıraktığı malları ellerine geçirmiş olması ihtimali de vardır. Ebu Talib Nebi Sallallahu Aleyhi ve Sellem'in babası Abdullah'ın bıraktığı terikeyi de eline almıştı. Çünkü onun öz kardeşi idi, Nebi Sallallahu Aleyhi ve Sellem da dedesi Abdulmuttalib'in ölümünden sonra Ebu Talib'in yanında kalmıştı. Ebu Talib ölüp de arkasından hicret gerçekleşince Talib de Müslüman olmayıp, Akil'in Müslüman oluşu da gecikince her ikisi Ebu Talib'in geriye bıraktığı malı ellerine geçirdiler. Talib Bedir'den önce öldüğü halde Akil daha s.onra yaşadı. İslamın müslümanın kafirden miras almayacağı hükmü de ortaya gelince, bu mallar Akil'in elinde kalmaya devam etti. İşte Nebi Sallallahu Aleyhi ve Sellem buna işaret etmektedir. Akil de bütün bu evleri satmış bulunuyordu. Nebi Sallallahu Aleyhi ve Sellem'in kendisine ait olanları Akil'e bırakmış olması hususunda da görüş ayrılığı vardır. Onun bunları Akil'e bir lütuf olmak üzere Akil'in elinde bıraktığı söylendiği gibi, onu İslama yaklaştırıp kalbini ısındırmak için böyle yaptığı da söylenmiştir. Cahiliye dönemi nikahları sahih kabul edildiği gibi, o dönemin tasarruflarının da sahih kabul edileceği şeklinde de açıklanmıştır. \"Küfür üzere\" Kureyş'in \"yeminleştikleri yer.\" Yani Kureyşliler Haşim oğulları ile alışveriş yapmamaya, onlardan kız alıp vermemeye, onları evlerinde barındırmamaya yeminleşmiş ve Haşim oğullarını Şi'b'e sığınmak zorunda bırakmışlardı. İkinci rivayet yolunda geçen: \"Resulullah Sallallahu Aleyhi ve Sellem Huneyn'e gitmek isteyince ... buyurdu.\" Yani Mekke'nin fethi gazvesinde. Çünkü Huneyn gazvesi Mekke'nin fethi gazvesinin akabinde olmuştu. Nebi Sallallahu Aleyhi ve Sellem'in konaklamak için o yeri seçmesinin sebebi ile ilgili olarak şu açıklama yapılmıştır: Bu vesile ile önceki hallerini hatırlayıp, yüce Allah'ın kendisine vermiş olduğu bu pek büyük fetihle Mekke'ye onu oradan çıkarmak istemiş olanların burunlarının yere sürtülmesine rağmen muzaffer olarak girme imkanını bulma nimetine ve kötülük yapmış olanları affetmekteki ileri mertebesini onları karşılıksız serbest bırakmak ve onlara iyilikte bulunmak ile karşılık verebilme nimetine şükretmesi içindi. Bu ise Allah'ın lutfudur, onu dilediğine verir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 318
			}
		}
	]
}