{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4302,
			"arabicnumber": 4302,
			"text": "Amr b. Selime dedi ki: \"(Eyyub dedi ki): Ebu Kılabe bana: Onunla (yani Amr b. Seleme ile) karşılaşıp da ona sormaz mısın? (Amr) dedi ki: Bizler insanların geçip gittiği bir yerde idik. Binekliler bizim yanımızdan geçer, biz de onlara insanların durumu nedir, bu adam neyin nesidir diye sorar, onlar da: Bu adam Allah'ın kendisine risalet verdiğini, Allah'ın kendisine vahyettiğini yahut da Allah'ın ona bunu vahyettiğini söylüyor, diyorlardı. Ben de o sözleri ezberliyordum. Sanki kalbime iyice yerleştiriliyordu. Araplar ise Müslüman olmayı geciktiriyor ve: Onu kavmiyle baş başa bırakınız, diyorlardı. Eğer onlara karşı muzaffer olursa o doğru sözlü bir nebi demektir. Mekke'nin fethi üzerine Mekkelilerin yaptıkları da ortaya çıkınca her bir kavim Müslüman olmak için elini çabuk tuttu. Benim babam da kavminden önce elini çabuk tutarak Müslüman oldu. Geri döndüğünde dedi ki: Allah'a yemin ederim, yanınıza gerçekten Nebi oIan birisinin yanından geIiyorum.• O (bize) dedi ki: Şu namazı şu vakitte klIınız, şu namazı şu vakitte klIınız. Namaz vakti girdiğinde biriniz ezan okusun, aranızda en çok Kur'an bileniniz de size imam oIsun. Benden daha çok Kur'an bilen kimse yoktu. Çünkü ben gidip geIen kafiIeIer iIe karşılaşıyordum. Bu sebepIe beni önIerine (imam oIarak) geçirdiler. O sırada da altı yahut yedi yaşındaydım. Üzerimde bir eIbise vardı. Fakat secdeye vardığımda kenarları düşüyor, üzerim açılıyordu. Kabileden (cemaate geIen) bir kadın: Şu Kur'an okuyucunuzun edep yerini görmeyelim diye örtmeycek misiniz, dedi. Bunun için bana bir gömIek biçtiler. O gömIeğe sevindiğim kadar hiçbir şey için sevinmiş değilim. Fethu'l-Bari Açıklaması: \"Bu adam neyin nesidir\" sözIeriyIe Nebi Sallallahu Aleyhi ve Sellem'in durumu ile ArapIarın onIara karşı durumunu soruşturuyorlardı. \"Allah ona vahyetti, Allah ona şunu vahyetti.\" Bu sözIeriyIe onIarın işittikIeri Kur'an böIümIerini kendilerine bildirdiklerini nakIetmektedir. \"Kenarları düşüyor, üzerim açılıyordu.\" Yani eIbisem bir araya topIanıyordu. Ebu Oavud'un rivayetinde: \"Üstüm açılıyordu\" şeklindedir. Hadiste farz namaza mümeyyiz küçük çocuğun imam oIabileceği şeklindeki ŞafilIerin görüşünün Iehine bir deliI buIunmaktadır. Bu oIdukça meşhur ihtilaflı bir meseIedir. Şafillerin bunu kendi idihadIarına göre söyIediklerini ve bu bir nefyedici şahitlik oIduğundan ötürü Nebi Sallallahu Aleyhi ve Sellem'in de bundan haberdar oImadığınl söyIeyenIer, insaflı bir iddiada buIunmamaktadırlar. Çünkü vahiy döneminde caiz oImayan bir şey, takriri yolla kabuI edilemez. Nitekim Ebu Said ve Cabir de Nebi s.a.v. döneminde azil yaptıkIarını cevazına deIil göstermişIerdir. Eğer bu, yasak klIınmasl gereken bir şey oIsaydl, mutlaka Kur'an onu nehyederdi. Aynı şekilde namazda avreti örtmenin nan:ıazın sıhhati için şart oImadığınl, aksine bir sünnet oIduğunu ve setr-i avret oImadan da namazın caiz oIacağınl, çünkü bunun haI ile aIakalı bir vakıa oIduğunu, bundan doIayl da bu oIayın onIarın hükmü öğrenmeIerinden sonra oIma ihtimalinin de buIunduğunu söyIeyenIer de insaflı bir iddiada buIunmamaktadırIar",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 335
			}
		}
	]
}