{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4317,
			"arabicnumber": 4317,
			"text": "Ebu İshak, Kayslılardan bir adam Bera'ya: Huneyn günü Resulullah Sallallahu Aleyhi ve Sellem'i bırakıp kaçtınız mı, diye bir soru sorması üzerine, ona şöyle cevap verdiğini işitmiştir: \"Fakat Resulullah Sallallahu Aleyhi ve Sellem kaçmadı. Hevazinliler iyi ok atıyorlardı. Bizler onlara bir hamle yapınca geri çekildiler. Bu sefer biz de ganimet toplamaya koyulduk. Arkasından bize atılan oklarla karşılaştık. Resulullah Sallallahu Aleyhi ve Sellem'i beyaz katırı üzerine gördüm. Ebu Süfyan b. Haris de yularından tutmuştu. Bu arada: Şüphesiz ben Nebiim, diyordu.\" (Ravilerden) İsrail ve Zuheyr: Nebi katınndan indi, dediler. Fethu'l-Bari Açıklaması: \"Ben şahitlik ederim ki Nebi Sallallahu Aleyhi ve Sellem geri dönüp kaçmadı.\" Bera'nın cevabı kendilerinin kaçtıkları konusunda olumlu bir mana taşımakla birlikte, bunun genelolmadığını da ifade etmiş olmaktadır. O bu cevabı ile soru soranın mutlak olarak sormasının, Nebi Sallallahu Aleyhi ve Sellem dahil herkesi kapsadığına işaret etmek istemişti. Çünkü ikinci rivayetin zahiri bunu ifade etmektedir. Nevevı der ki: Bu cevap oldukça edebi bir cevaptır. Çünkü soru hepiniz kaçtınız' anlamındadır. Bunun kapsamına Nebi Sallallahu Aleyhi ve Sellem da girer. Fakat Bera: Hayır, Allah'a yemin ederim Resulullah Sallallahu Aleyhi ve Sellem kaçmadı.Fakat şunlar şunlar oldu, diyerek kaçanların da kaçışlarının sürekli olmadığını, ancak atılan okların etkisi ile geri çekilmiş olduklarını ifade etmektedir. \"Fakat onların aceleci olanları çabuk davrandı. Hevazinliler de onlara ok attı.\" Müellefetu'l-Kulub olmayanlardan kaçanların mazereti düşmanlarının sayıca onlardan kat kat fazla olmalarıdır. \"Ebu Süfyan b. el-Haris\" b. Abdilmuttalib b. Haşim, Nebi Sallallahu Aleyhi ve Sellem'in amcasının oğludur. Mekke fethedilmede.n önce Müslüman olmuştu. Çünkü o Nebi Sallallahu Aleyhi ve Sellem'in yanına gitmek üzere çıkmış, yolda Mekke'yi fethetmek üzere yol aldığını görünce Müslüman olarak İslama güzel bir şekilde bağlanmıştı. Huneyn gazvesine de çıkmıştı, sebat gösterip geri çekilmeyenler arasında idi. İbn Ebi Şeybe tarafından zikredilen el-Hakem b. Uteybe yoluyla gelen mürsel rivayette şöyle denilmektedir: Huneyn günü insanlar kaçınca Nebi Sallallahu Aleyhi ve Sellem: Ben Nebiim bunda bir şüphe yoktur. Ben Abdulmuttalib'in oğlu(nun oğlu)yum, demeye başladı. Onunla beraber sadece dört kişi kalmıştı. Bunların üçü Haşim oğullarındandı, biri de başkalarından idi. Ali ve el-Abbas da onun önünde, Ebu Süfyan b. el-Haris de dizginleri tutuyordu. İbn Mes'ud ise sol tarafta idi. (el-Hakem b. Uteybe) dedi ki: Ona doğru kim gidiyor idiyse mutlaka öldürüldü. Tirmizı de hasen bir senedIe İbn Ömer'in şöyle dediğini rivayet etmektedir: \"Huneyn günü kendimizi şu halde gördüm: İnsanlar yüz çevirip, gerisin geri gidiyorlardı. Resulullah Sallallahu Aleyhi ve Sellem ile beraber ise yüz kişi bile yoktu.\" Bu rivayet benim Huneyn günü sebat gösterip, yerlerinden ayrılmayan kimselerin sayısı ile ilgili tespit ettiğim en yüksek miktardır. Ahmed ve Hakim, Abdurrahman b. Abdullah b. Mes'ud'un, o babasının şöyle dediğini rivayet etmektedir: \"Huneyn günü Nebi Sallallahu Aleyhi ve Sellem ile birlikte idim. Herkes onu bırakıp geri kaçtı. Onunla birlikte muhacirlerle ensardan seksen kişi sebat gösterdi. Bizler piyade idik ve onlara arkamızı çevirmedik. İşte yüce Allah'ın üzerlerine sekinetini (huzur ve sükununu) indirdiği kimseler bunlardır.\" Nevevı'nin Müslim şerhinde zikrettiği \"onunla birlikte oniki kişi sebat gösterdi\" ifadesi İbn İshak'ın zikrettiği hadisten alınmış gibidir. Onun zikrettiği rivayete göre Nebi ile birlikte el-Abbas, oğlu el-Fadl, Ali, Ebu Süfyan b. el-Haris, onun kardeşi Rabia, Usame b. Zeyd, onun anne bir kardeşi Ümmü Eymen'in oğlu Eymen, muhacirlerden Ebu Bekr ve Ömer sebat göstermişlerdir. Bunlar dokuz kişiyi bulmaktadır. İbn Mes'ud'un sebat gösterdiği de el-Hakim 'in zikrettiği mürsel rivayette geçmektedir. Böylece bunların sayısı onu bulmaktadır. el-Abbas b. Abdulmuttalib'in şiirinde ise onunla sebat gösterenlerin sayısının sadece on kişi olduğu zikredilmektedir. Bu da onun şu beyitlerinde dile getirilmiştir: \"Savaşta Resulullaha yardımcı olduk dokuz kişi Kaçanlar kaçmış ve geri çekilmişti. Onuncumuz ise feda etti canını Allah yolunda ona isabet edenlerle acı çekmeden.\" Sağlam olan rivayet de bu olabilir. Bundan fazla sayıyı verenler, dönmekte acelecilik edenlerin dışında kalan kimseleri de büsbütün çekilmeyenler arasında saymlşlardır. Taberi der ki: Yasaklanmış olan kaçmak geri dönmemek niyetiyle yapılan kaçıştır. Düşmanın çokluğu sebebiyle bir süre kaçmak, kuwetli bir birliğe sığınmak üzere çekilmeye benzer. \"Ben Nebiim bunda şüphe yoktur. Ben Abdulmuttalib'in oğlu(nun oğlu)yum.\" Nebi efendimizin kendisini babası Abdullah'a değil de Abdulmuttalib'e nispet etmesi, Abdulmuttalib'in insanlar arasındaki şöhreti dolayısıyla yapılmış gibidir. Çünkü Abdulmutta:l ib'e üstün bir şekilde anılıp hatırlanma ve uzunca bir ömür verilmişti. Oysa Abdullah böyle değildi. O genç olarak vefat etmişti. Bundan dolayı Arapların çoğunluğu Nebi efendimizi Abdulmuttalib'in oğlu diye çağırıyorlardı. Nitekim Dimam b. Sa'lebe geldiğinde: Hanginiz Abdulmuttalib'in oğlusunuz, diye sormuştu. Bir diğer açıklamaya göre insanlar arasında: Abdulmuttalib'in soyundan Al'ah'a davet edecek ve Allah'ın insanlara onun vasıtasıyla hidayet vereceği ve )eygamberlerin sonuncusu olacak bir adamın çıkacağına dair yaygın bir haber Jardı. Böylelikle bilenler bunu hatırlasın diye kendisini Abdulmuttalib'e nispet etmiştir. Bu hususta Araplar arasında yaygın bir hal almıştı. Seyf b. 21 Yezen bunu eskiden beri Abdullah, Amine ile evlenmeden önce Abdulmuttalib'e zikretmiş idi. Nebi Sallallahu Aleyhi ve Sellem da ashabına mutlaka galip geleceğine dikkatlerini çekmek istemiş, güzel akıbtin takvalılara ait olduğu hususunu hatırlatmak, böylelikle onun geri çekilmeyip sebat gösterdiğini bildikleri takdirde kalplerinin güçlenmesini sağlamak istemişti. Nebi efendimizin: \"Şüphesiz\" demesi nübuwet vasfı ile birlikte yalan söylemenin imkansız olduğuna bir işaret taşımaktadır. Böylelikle o: Ben Nebiyim, Nebi de yalan söylemez. Ben söylediklerimi yalan söylemiyorum ki yenileyim. Hem ben yüce Allah'ın bana vaat etmiş olduğu yardım ve zaferin hak olduğuna da kesin olarak inanıyorum. Dolayısıyla benim kaçmam da caiz değildir, demiş gibidir. Onun (şüphesiz) sözü: Ben gerçekten bir Nebiyim. Bunda bir şüphe, bir yalan yoktur demektir, diye de açıklanmıştır. Hadisten Çıkarılan Bazı Sonuçlar 1- Konuşurken güzel bir edeble konuşmak 2- Güzel bir cevap vermek suretiyle sorunun güzel sorulmasına işaret etmek ve kendisini beğenmenin yerilecek bir özellik olduğuna dikkat çekmek. 3- Cahiliye döneminde ölmüş olsalar dahi babalara intisap etmek caizdir. Bunun yasaklanması ise savaşın dışındaki haller için yorumlanır. Böbürlenme ve büyüklenmeye dair ruhsat da bu kabildendir. O da savaşta caizdir, savaş dışında caiz değildir. 4- Allah yolunda ölmek tehlikesine atılmak caizdir. Çünkü \"Nebi Sallallahu Aleyhi ve Sellem yüce Allah'ın vaadi dolayısıyla zafere kavuşacağından kesin olarak emindi. Allah'ın vaadi de haktır\" denilemez. Çünkü Ebu Süfyan b. el-Haris de katırının yularını tutarak onunla birlikte sebat göstermişti. Onun ise Nebi Sallallahu Aleyhi ve Sellem'in bu husustaki yakıni gibi bir yakıne sahip olduğu söylenemez. Yine bu durumda Ümmü Eymen'in oğlu Eymen de daha önce el-Abbas'ın şiirinde işaret olduğu gibi şehit düşmüştü. 5- Katıra binmenin sebatı daha bir arttırıcı olduğuna işaret vardır .. Çünkü erkek hayvanlara binmek kaçmaya ve geri dönmeye hazırlıklı olmak izlenimini verir. Ordunun kumandanı kendisini kaçmamaya hazırlamış ve bunun gerekli sebeplerini de yerine getirmiş ise elbetteki ona uyanların sebat göstermelerini daha çok teşvik edici bir haldir. 6- Kumandanın savaşta kendisini açıkça ortaya koyması kahramanlığı daha da ileri derecede ifade eder ve düşmana aldırış edilmediğini gösterir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 348
			}
		}
	]
}