{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4318,
			"arabicnumber": 4318,
			"text": "Muhammed b. Şihab dedi ki: Urve b. Zubeyr'in dediğine göre Mervan ile Misver b. Mahreme kendisine şunu haber vermişlerdir: Resulullah Sallallahu Aleyhi ve Sellem Hevazin heyeti kendisine Müslümanlar olarak geldiklerinde ayağa kalkmış, kendisinden mallarını ve alınan esirlerinin geri verilmesini istemişlerdi. Resulullah Sallallahu Aleyhi ve Sellem da şöyle buyurmuştu: Benimle beraber gördüğünüz kimseler de vardır. Benim en sevdiğim söz de doğru olanıdır. Şu iki şeyden birisini seçiniz ya esirlerinizi ya da mallarınızı. Çünkü ben size süre tanımış bulunuyorum. -Resulullah Sallallahu Aleyhi ve Sellem Taiften döndükten sonra onlara on küsur gece mühlet vermişti.- Resulullah Sallallahu Aleyhi ve Sellem'in kendilerine ancak iki şeyden birisini geri vereceğini açıkça anlayınca bizler esirlerimizi tercih ediyoruz, dediler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem Müslümanlara hitap etmek üzere ayağa kalktı. Yüce Allah'a layık olduğu şekilde övgülerde bulundu, sonra şöyle buyurdu: İmdi şüphesiz kardeşleriniz bize tevbe edenler olarak geldiler. Ben de onlara esirlerini geri vermeyi uygun gördüm. Aranızdan bunu gönül hoşluğuyla yapmak isteyen yapıversin. Fakat aranızdan hakkını elinde tutmak isteyenler de yüce Allah'ın bize ihsan edeceği ilk fey\"den (ganimetten) ona vermemizi beklemek şartıyla yapıversin. Herkes: Ey Allah'ın Resulü, biz bunu gönül hoşluğuyla verdik, dedi. Fakat Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bizler bu hususta aranızda kimlerin izin verdiğini, kimin vermediğini bilemiyoruz. Bunun için geri dönün de arifleriniz sizin kanaatlerinizi bize bildirsinIer. İnsanlar geri döndü, arifleri de onlarla konuştu. Daha sonra Resulullah Sallallahu Aleyhi ve Sellem'e dönerek gönül hoşluğuyla kabul ettiklerini ve izin verdiklerini ona haber verdiler. İşte Hevazinlilerden alınan esirler ile ilgili olarak bana ulaşan budur.\" Fethu'l-Bari Açıklaması: \"Hevazin heyeti Müslümanlar olarak ona geldiğinde kalkmış.\" ez-Zühri bu olayı bu yolla muhtasar olarak zikretmiş bulunmaktadır. Musa b. Ukbe, el-Megazi'de bunu uzunca zikretmiştir. Onun lafzı ile olay şöylir: \"Daha sonra Resulullah Sallallahu Aleyhi ve Sellem şewal ayında Taif'ten Ci'rane'ye gitti. Orada da Hevazinlilerin esirleri bulunuyordu. Hevazinlilerin heyeti Müslümanlar olarak onun huzuruna geldi. Aralarından eşrafından dokuz kişi de vardı. Müslüman olup, bey'at ettiler. Sonra onunla konuşurak: Ey Allah'ın Resulü, aldığınız esirler arasında annelerimiz, kızkardeşlerimiz, halalarımız, teyzelerimiz vardır. Bunlar sebebiyle ise kavimler rüsvay olur, dediler. Allah Resulü: Ben sizin için talepte bulunacağım. Fakat ganimetler paylaştırılmış bulunuyor. Siz şu ikisinden hangisini daha çok istersiniz, esirleri mi yoksa malları mı, diye buyurdu. Onlar: Ey Allah'ın Resulü, sen bizi şerefe talip olmak ile mal istemek arasında muhayyer bıraktın. Biz elbette şerefi daha çok severiz, biz ne bir koyun ne de bir deve için ağzımızı açarız, dediler. Allah Resulü bunun üzerine: (Bunlardan) Haşimoğullarının payına düşenler size aittir. Sizin için de Müslümanlarla konuşacağım. Siz de onlarla konuşun ve Müslüman olduğunuzu açığa vurun, diye buyurdu. Resulullah Sallallahu Aleyhi ve Sellem öğle namazını kıldıktan sonra onlar da ayağa kalktılar, hatipleri konuşmaya koyuldu. Oldukça beliğ konuştular, Müslümanları da esirlerini kendilerine geri vermek için teşvik ettiler. Onlar konuşmalarını bitirdikten sonra Resulullah Sallallahu Aleyhi ve Sellem ayağa kalktı. Onlar adına iltimasta bulundu, Müslümanları bu işe teşvik etti ve: Ben Haşim oğullarının payına düşenleri onlara geri verdim, diye buyurdu.\" \"Ben sizi beklemiştim.\" Yani gelirsiniz diye esirleri paylaştırmayı geciktirmiştim. Fakat siz daha da geç geldiniz. \"Bunu gönül hoşluğu ile geri vermek isteyen\" yani karşılıksız ve kendi rızasıyla geri vermek isteyen, demektir. \"Herkes: Biz bunları gönül hoşluğuyla geri veriyoruz, dedi.\" Musa b. Ukbe'nin rivayetinde: \"Herkes ellerinde olanı geri verdi. Ancak az sayıda bazı kimseler fidye istediler.\" Sözü geçen Amr b. Şuayb yoluyla gelen rivayette de şöyle denilmektedir: \"Muhacirler: Bize ait olan da Allah'ın Resulüne aittir, dediler. Ensar da aynı şeyi söylediler. Akra b. Habis dedi ki: Ben ve Temim oğulları ise böyle yapmıyoruz. Uyeyne de: Ben ve Fezare oğullarına ait olan için böyle demiyoruz, dediler. elAbbas b. Mirdas da: Bana ve Süleym oğullarına ait olanı da vermiyoruz, dedi. Süleym oğulları: Hayır, bize düşen Allah Resulüne aittir dediler. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Sizden hakkını sımsıkı elinde tutan kimse için her bir kişiye karşılık olarak elde edeceğiniz ilk ganimetten altı pay verilecektir deyince, gelenlere hanımlarını ve çocuklarını geri verdiler",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}