{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "Ebu Musa r.a. dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem Huneyn'deki işlerini bitirince Ebu Amir'i bir orduya kumandan tayin ederek Evtaslıların üzerine gönderdi. (Ebu Amir) Dureyd b. es-Sımme ile karşılaştı. Dureyd öldürüldü ve Allah onunla beraber olanları da bozguna uğrattı. Ebu Musa dedi ki: Beni de Ebu Amir ile birlikte göndermişti. Ebu Amir'e diz kapağına isabet eden bir ok atıldı. Cuşemli birisi ona bir ok atmış ve o oku diz kapağına isabet ettirmişti. Ben onun yanına giderek: Amca, sana kim ok attı, dedim. Ebu Musa'ya işaret ederek: İşte şu benim katilimdir, bana ok atan odur, dedi. Ben de onun üzerine gittim ve ona yetiştim. Beni görünce geri dönüp kaçtı. Arkasından gittim ve ona: Yerinde durup sebat göstermemekten utanmıyor musun deyince, kaçmayı bıraktı. Karşılıklı olarak birbirimize iki (şer) darbe indirdik ve ben onu öldürdüm. Daha sonra Ebu Amir'e: Allah sana ok atan adamı katletti dedim. Ebu Amir: Bu oku çek çıkar dedi. Oku çekip çıkarınca yerinden su boşaldı. Kardeşimin oğlu, benden Nebi Sallallahu Aleyhi ve Sellem'e selam götür ve ona: Bana mağfiret dilemesini söyle, dedi. Ebu Amir de beni yerine askerlere kumandan tayin etti. Kısa bir süre kaldıktan sonra vefat etti. Geri dönüp Nebi Sallallahu Aleyhi ve Sellem'in hanesinde huzuruna girdim. Resulullah hasırdan örülmüş ve üzerine ince bir döşek serilmiş bir taht üzerinde yatıyordu. Bununla birlikte tahtın üzerindeki has ır yanlarında ve sırtında iz bırakmıştl. Ben de ona bizim ve Ebu Amir'in durumu ile ilgili haberleri bildirdim. Ebu Amir'in: Ona bana mağfiret dilemesini söyle, dediğini naklettim. (Allah Resulü) su getirilmesini istedi ve abdest aldı. Sonra ellerini. kaldırarak: Allah'ım, Ebu Amir kulcağıza mağfiret et, dedi ve ben (ellerini yukarıya çokça kaldırdığından) koltuk altlarının beyazını gördüm. Sonra şöyle buyurdu: AlIah'lm kıyamet gününde onu yaratmış olduğun insanların bir çoğunun üstüne çıkar. Ben de: Benim için de mağfiret dile, dedim. Bunun üzerine: Allah'ım, Abdullah b. Kays'ın günahlarını mağfiret et. Kıyamet gününde de onu oldukça üstün ve şerefli bir makama yerleştir, diye buyurdu.\" Ebu Burde dedi ki: \"Onların (mağfiret dileklerinin) biri Ebu Amir'e, diğeri ise Ebu Musa'ya yapıldı.\" Fethu'l-Bari Açıklaması: \"Evtas gazvesi\" Iyad der ki: Evtas, Hevazin• yurdunda bir vadidir. Huneyn savaşının olduğu yerdir. Siyer alimlerinden bazıları da Iyad'ın bu dediğini kabul etmiştir. Fakat tercihe değer olan Evtas vadisinin Huneyn vadisinden farklı olduğudur. Buna İbn İshak'ın zikretmiş olduğu vakanın Huneyn vadisinde cereyan ettiği, Hevazinlilerin de geri çekilmelerinden sonra onlardan bir kesimin Taife, bir diğer kesiminin Becile'ye, bir diğer kesimin ise Evtas'a gitmiş olduğunu belirtmesi açıklık getirmektedir. Nebi s.a.v. ise önlerinden Ebu Amir el-Eş'arl'nin (komutasında) bir askeri birliği Evtaslılara gidenlerin üzerine gönderdi. Nitekim bu hadis de buna delalet etmektedir. Daha sonra kendisi askerleri ile birlikte Taifin üzerine yöneldi. \"Ebu Amir'e dizkapağına isabet eden bir ok atıldı. Onu Cuşemli\" yani Cuşem oğullarından bir adam \"atmıştı.\" \"Ondan su boşaldı.\" Yani okun yerinden sular boşaldı. \"Bir su getirilmesini istedi. Abdest aldıktan sonra ellerini kaldırdı.\" Bu ibareden dua etmek isteği dolayısıyla abdest almanın ve dua ederken elleri kaldırmanın -elleri kaldırmayı sadece istiska (yağmur duası)na mahsus kabul edenlerin görüşlerinin aksine- müstehap olduğu anlaşılmaktadır. İleride bu hususta gelmiş rivayetıere dair açıklamalar Deavat (dualar) bölümünde (6382. hadiste) gelecektir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 353
			}
		}
	]
}