{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4323,
			"arabicnumber": 4323,
			"text": "Ebû Mûsâ (radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Huneyn gazvesini bitirince(amcam) Ebû Âmir'i bir ordu birliği üzerine kumandan yaparak Evtâs'a gönderdi. Ebû Âmir (Huneyn'den buraya kaçmış olanların kumandanı) Dureyd ibn Sımme ile burada karşılaştı. Yapılan muharebede Dureyd öldürüldü, askerlerini de Allah hezîmete uğrattı. Mûsâ devamla dedi ki: Rasûlüllah beni de(amcam) Ebû Âmir ile beraber göndermişti. Bu muharebede Ebû Âmir'in dizine Cuşem kabilesinden birisi tarafından bir ok atıldı. Okçu okunu Ebû Âmir'in dizkapağına yerleştirdi. Ben hemen Ebû Âmir'in yanına koştum ve: Ey amca, sana kim ok attı? diye sordum. O, ben Ebû Musa'ya: İşte ok atan kaatilim şudur! diye gösterdi. hemen kaatile doğru koştum ve ona yetiştim. Kaatil beni görünce dönüp kaçmağa başladı. Ben onun arkasından gittim. Bu sırada ben hem koşuyor, hem: Kaçmaktan utanmaz mısın, yerinde biraz durmaz mısın? diye haykırıyordum. Adam kaçmaktan vazgeçti. Her ikimiz kılıçlarımızla vuruşmaya başladık. Sonunda adamı öldürdüm. Sonra(Ebû Âmir'in yanına geldim) Ebû Âmir'e: Allah senin düşmanını öldürdü, dedim. Amcam bana: Şu oku dizimden çek çıkar, dedi. de hemen çıkardım. Okun çıktığı yerden bir su boşandı. (Amcam hayâtından ümidini kesti.) Bana: Ey kardeşimin oğlu! Peygamber'e selâm söyle ve bana Allah'tan mağfiret istemesini rica et, dedi ve beni kendi yerine mücâhidler üzerine kumandan yaptı. bir zaman yaşadı, sonra vefat etti. Bu seferden dönüp geldiğimde Peygamber'in huzuruna girdim. Peygamber, odasında hasırdan örülmüş ve üzerine ince şilte serilmiş bir sedir üstünde yatıyordu. Hasırın örgüleri vücûdunun arkasına ve iki yanlarına iz yapmıştı. Ben kendisine zafer haberimizi ve Ebû Âmir'in şehîd oluşu haberini ve \"Rasûlüllah benim için mağfiret dilesin\" diye vasiyet ettiğini arzettim. Bunun üzerine Peygamber abdest suyu istedi ve abdest aldı. Sonra ellerini kaldırıp: \"Yâ Allah, kulcağızın Ebû Âmir'e mağfiret eyle!\" diye duâ etti. ederken ben O'nun iki koltuğunun beyazlığını gördüm. Sonra Peygamber: \"Yâ A ilah! Kıyâmet gününde Ebû Âmir kulunu şu yarattığın insanlardan çoğunun üstünde yüksek bir makaamda kıl\" niyazında bulundu. Bunun üzerine ben: Benim için de mağfiret isteyiver, dedim. Peygamber: \"Yâ Allah, Abdullah ibn Kays'ın günâhını mağfiret eyle ve kıyâmet gününde onu kerîm bir makaama girdir\" diye duâ etti. Ebû Burde: Bu İki duanın biri Ebû Âmir için, diğeri de Ebû Mûsâ içindir, demiştir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 353
			}
		}
	]
}