{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4325,
			"arabicnumber": 4325,
			"text": "Abdullah b. Ömer dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem Taifi muhasara ettiği halde onlardan yenildiklerine dair kendisine bir haber ulaşmayınca: İnşailah yarın geri dönüyoruz, -(Ravi) bir seferinde de: Geri döneceğiz, demiştirdemişti. Bu ashaba ağır geldi ve: Taifi fethetmeden mi geri gideceğiz? dediler. Allah Resulü (ertesi gün): Haydi sabah erkenden savaşa gidiniz, diye buyurdu. Onlar da sabahleyin gittiler. Fakat pek çok kimse yara aldı. Bunun üzerine: İnşailah yarın geri dönüyoruz, diye buyurdu. Bu sefer bu hoşlarına gitti. Nebi Sallallahu Aleyhi ve Sellem de (buna) güldü.\" Süfyan bir keresinde de: \"Tebessüm etti\" demiştir. Bu Hadis 6086 ve 7480 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Resulullah Sallallahu Aleyhi ve Sellem Taifi muhasara ettiği halde onlardan (yen ildiklerine dair) bir haber almadı.\" İbn Zubeyr yoluyla gelen İbn Ebi Şeybe'nin zikrettiği mürsel rivayette şöyle denilmektedir: \"Nebi Sallallahu Aleyhi ve Sellem Taifi muhasara edince ashabı: Ey Allah'ın Resulü, Sakiflilerin akları biziyaktı. Onlara beddua et, dediler. Allah Resulü: Allah'ım, Sakiflilere hidayet ver diye buyurdu.\" Megazi alimlerinin zikrettiklerine göre Nebi Sallallahu Aleyhi ve Sellem kaleyi fethetmekte güçlükle karşılaştı. Taifliler de kalelerinde bir yıl süreyle kuşatılsalar dahi kendilerine yetecek şekilde hazırlıklar yapmışlardı. Müslümanların üzerine kızdınlmış demir parçaları fırlattılar, onlara aklar attılar. Pek çok kimseye de isabet ettirdiler. Allah Resulü Nevfel b. Muaviye ed-Diyli ile istişare etti, o da şöyle dedi: Bunlar yuvasına çekilmiş bir tilki gibidirler. Eğer yuvasının başında durursan onu yakalarsın. Fakat bırakıp gidersen de sana zararı olmaz. Bunun üzerine Allah Resulü onları bırakıp gitti.\" Enes'in de Müslim tarafından zikredilen hadisinde belirttiğine göre, onları kırk gün süre ile muhasara etmiştir. \"Yarın dönüyoruz.\" Medine'ye dönüyoruz. \"Bu onlara ağır geldL\" Bunun sebebini: \"Burayı fethetmeden mi geri gideceğiz\" sözleri açıklamaktadır. Bu haberin ifade ettiği anlam şudur: Allah Resulü Taif fethedilmeden geri döneceklerini onlara haber verince bu hoşlarına gitmedi. Onların hoşlanmadıklarını görünce savaşmalarını emretti. Fakat fetih imkanı da olmadı. Üstelik bir takım yaralar aldılar. Çünkü Taifliler surların üstlerinden onlara ok atıyordu. Böylelikle Taiflilerin akları Müslümanlara isabet ettiği halde Müslümanların akları surların üstündekilere isabet etmiyordu. Onlar bu hali görünce geri dönmelerinin isabetli olacağını açıkça görmüş oldular. Allah Resulü de onlara geri dönme teklifini tekrar edince bu sefer bu teklifi beğendiler, ondan dolayı da Allah Resulü hakkında: \"Bunun üzerine güldü, demektedir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 355
			}
		}
	]
}