{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4330,
			"arabicnumber": 4330,
			"text": "Abdullah b. Zeyd b. Asım dedi ki: \"Allah, Resulüne Huneyn günü fey' (ganimet) nasip edince (ganimetieri) insanlar arasındaki müellefetu'l-kulub arasında paylaştırdı. Ensara hiçbir şey vermedi. Diğerlerine isabet eden pay kendilerine de isabet etmediğinden ötürü içten içe rahatsız olmuş gibi idiler. Onlara hutbe irad ederek: Ey ensar topluluğu! Ben sizi yolunuzu şaşırmış bulup da benim sayemde Allah sizi hidayete iletmedi mi? Sizler tefrika içinde iken benimle Allah sizi bir araya getirmedi mi? Fakir iken benimle Allah sizi zengin kılmadı mı, dedi. Allah Resulü her bir şey dedikçe, onlar: Allah'ın ve Resulünün lütuftan daha çoktur, diyorlardı. Allah Resulü: Resulullah Sallallahu Aleyhi ve Sellem'e cevap vermenize engelolan ne, diye sordu. -(Abdullah b. Zeyd) dedi ki: O bir şey dedikçe onlar Allah ve Resulünün lutfu daha çoktur, diyorlardı.- Şöyle buyurdu: Dileseydiniz şöyle diyebilirdiniz: Sen bize şu şu halde geldin. (Şimdi söyleyin) insanlar koyunları ve develeri alıp giderken sizler Nebi Sallallahu Aleyhi ve Sellem ile birlikte evlerinize geri dönmeye razı değil misiniz? Eğer hicret olmasaydı, andolsun ensardan bir kişi olurdum. Eğer bütün insanlar bir vadiden ya da bir dağ yolundan gidecek olsalar şüphesiz ben de ensarın gittiği vadiden ve dağ yolundan giderdim. Ensar doğrudan vücudun üstüne giyilen elbisedir, diğer insanlar ise onun üstüne giyilenlerdir. Şüphesiz sizler benden sonra (sizlere) başkalarının tercih edildiğini göreceksiniz. Havz üzerinde benimle karşılaşıncaya kadar sabrediniz. \" Bu Hadis 7245 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Yüce Allah Huneyn günü Resulüne ... ganimet ihsan edince\" yani Huneyn günü kendileriyle savaştığı kimselerin ganimetIerini ona verince. \"Fey'''in asıl anlamı geri çevirmek ve dönmektir. Zevalden sonraki gölgeye fey\" denilmesi de bu kökten gelmektedir. Çünkü gölge bu vakitte bir taraftan diğer bir tarafa dönmektedir. Kafirlerin malları asıl itibariyle mu'minlere ait olduğundan dolayı mallarına bu isim verilmiş gibidir. Çünkü asılolan imandır, küfür ise daha sonra ortaya çıkar. Kafirler herhangi bir şeye galibiyet sağlayarak ele geçirecek olurlarsa bu bir saldırganlık yolu ile gerçekleşmiş olur. Müslümanlar o malı onlardan ganimet alınca sanki bu yolla daha önce kendilerine ait olanlar tekrar onlara dönmüş gibi olmaktadır. Biraz önce de Nebi Sallallahu Aleyhi ve Sellem'in ganimetIerin Ci'rane mevkiinde alıkonulmasını emretmiş olduğunu belirtmiş bulunuyoruz. Taiften dönüp, Zülkade'nin 15. günü Ci'rane'ye ulaşmıştı. Ganimetieri paylaştırmakta gecikme sebebi el-Misver hadisinde geçtiği üzere onların Müslüman olmaları ümidi idi. Alınan esirlerin sayısı ise kadın ve çocuk olmak üzere altıbin kişiyi bulmuştu. Develer yirmidörtbin, koyunların sayısı ise kırkbin idi. \"İnsanlara paylaştırdı.\" Maksat ganimetieri onlara paylaştırdığıdır. \"Müellefetu'l-kulub arasında\" Müellefetu'l-kulub'dan maksat, Kureyşlilerden Mekke'nin fethedildiği günü pek kuwetli olmayan bir şekilde Müslüman olmuş bir takım kimselerdi. Denildiğine göre aralarında henüz daha Müslüman olmamış Safvan b. Umeyye gibi kimseler de vardı. Zekatta hak sahibi sınıflardan birisini teşkil eden müleefe-i kulub ile kimlerin kastedildiği hususunda görüş ayrılığı vardır. Bir görüşe göre bunlar İslama girmelerini teşvik etmek üzere kendilerine bir şeyler verilen kafirlerdir. Bir başka görüşe göre bunlar kafir etbaı bulunan Müslümanlardır. Bu kafirlerin kalplerinin ısındırılması için bunlara verilir. Bir diğer görüşe göre bunlar İslama yeni girmiş Müslümanlar olup, İslamın kalplerine iyice yer etmesi istenen kimselerdir. Burada müellefetu'l-kulub ile kastedilenler ise bu sonuncularıdır .. Çünkü bu başlıkta ez-Zührı yoluyla gelen rivayette şöyle buyurmaktadır: \"Ben küfürden henüz yeni kurtulmuş bir takım adamlara kalplerini ısındırmak için veririm.\" Daha sonra \"Kureyşiiler arasında ganimetlerin paylaştırılması\" başlığında gelecek olan Enes'in rivayet ettiği hadise göre bunlar ile kastedilenler, kendileri Mekke'de bulunuyorlarken Mekke'nin fethedildiği kimselerdir. Yine ondan gelen bir rivayette: \"Tulaka ve muhacirlere verdi\" denilmektedir. Talik kelimesinin çoğulu olan tulaka'dan maksat ise Nebi Sallallahu Aleyhi ve Sellem'in Mekke'nin fethedildiği günü kendilerini karşılıksız serbest bıraktığı, Kureyşliler ile onlara tabi olanlardır. Muhacirlerden. maksat ise, Mekke fethedilmeden önce Müslüman olup Medine'ye hicret etmiş olanlardır. ibnu'l-Kayyim der ki: Yüce Allah'ın hikmeti gereği Mekke'nin fethedilmesi pek çok Arap kabilesinin islama girmesine sebep olmuştur. Oysa daha önce: Onu kavmiyle baş başa bırakınız, şayet o kavmine galip gelirse dinine gireriz. Eğer onlar ona galip gelirlerse onlar ona karşı gerekeni yapmış olur ve bize ihtiyaç bırakmamış olurlar, diyorlardı. Yüce Allah ona Mekke'yi fethetmeyi nasip edince bir kısmı yine sapıklığı üzere devam etti. Bundan ötürü ona karşı askerler topladılar ve onunla savaşmak için hazırlandılar. Bu hususta hikmetin bir gereği olarak yüce Allah Resulüne yardım ve zaferin dinine giren kabileierin çokluğuyla da, kavminin ona karşı savaşmaktan el çekmesi ile de olmadığını açıkça göstermiş olmaktadır. Dahasonra yüce Allah onlara galip gelmesini takdir buyurunca, düşmanları sayılarının çokluğuna, araç ve gereçlerinin pek güçlü oluşuna rağmen hezimete uğramalarını takdir buyurmuş olmasıydı. Böylelikle gerçek manada zafer ve yardımın ancak onun tarafından geldiğini, onların güçleri ile gerçekleşmediğini onlara açıkça göstermek istedi. Eğer başından beri kafirlere galip gelmemeleri takdir edilmiş olsaydı, aralarından bu dinden dönecek olanlar büyüklenerek, böbürlenerek, burunları havada dinden geri döneceklerdi. Onların yenilgiye uğramalarını takdir buyurduktan sonra akabinde onlara yardım etti, zafer verdi. Böylelikle Mekke'nin fethedildiği günü Nebi Sallallahu Aleyhi ve Sellem'in Mekke'ye alçak gönüllü ve huşu' ile girdiği gibi, onların da girmelerini sağlamak istedi. Yine onun hikmetinin bir gereği olarak kafirlerin ganimetleri ele geçirildikten sonra kalplerine imanın iyice yerleşmemiş olduğu kimselere taksim edilmesi, bu gibi kimselerin kalplerinde henüz beşeri tabiat gereği mala duydukları sevginin bir sonucu idi. Bu malı aralarında taksim ederek kalplerinin yatışmasını ve kalplerinin onun sevgisi etrafında birleşmesini istemiştir. Çünkü kendilerine iyilikte bulunan kimseleri sevmek, kalp leri n mayasında olan bir şeydir. Fakat aynı zamanda o ganimetleri cihadın gerçek ehli büyük muhacirler ile ensarın ileri gelenlerine vermedi. Oysa bunların ganimetlerin tümüne hak kazandıkları da açıkça ortadadır. Çünkü o ganimetleri aralarında paylaştırmış olsaydı, bu ganimetler sadece onlara ait olurdu. Oysa o müellefe-i kulub'e ganimetleri paylaştırmak suretiyle farklı bir iş yapmış oldu. Çünkü böylelikle başkanları hoşnut olduğu takdirde, kendileri de hoşnut olan ve bu ileri gelenlere tabi olan kimselerin kalplerinin de sevgisini kazanmış oluyordu. Bu şekilde bağışlarda bulunmak, onların islama girişlerine ve islama giren kimselerin kalplerinin de kendilerinden daha aşağıda olup, kendilerine tabi olanlara karşı kalplerinin güçlenmesine ve onların da islama girmeleri hususunda kalplerine metanet gelmesine sebep teşkil etmiştir. Böylece bu işte pek büyük bir masıahat ortaya çıkmış oldu. Bundan dolayı askerlerin içinde bulundukları halde kendilerine destek olacak mala çokça muhtaç olmalarına rağmen, Mekke ahalisinin mallarından Mekke'nin fethedilmesi esnasında az ya da çok herhangi bir şeyi paylaştırmadı. Bu sebeple yüce Allah müşriklerin kalplerinde onlara karşı savaşma arzusunu harekete geçirdi. Müşriklerin bir çoğu mallarını, kadınIarını ve çocukIarını beraber aIarak onIara karşı çıkmayı uygun gördü ve bunIarın hepsi de neticede MüsIümanIar tarafından ganimet aIındı. Eğer onIarın başkanIarının kaIpIerine bunIarı beraber getirmenin doğru oIduğu kanaatini yüce AlIah yerleştirmemiş oIsaydl, doğru görüş Dureyd'in danışma esnasında öne sürdüğü görüş oIacaktı.Fakat başkanIarı Dureyd'e muhaIefet edince bu bütün bunların MüsIümanIarın eline ganimet oIarak geçmesine sebep oIdu. Arkasından bu ilahı hikmet bu ganimetierin kaIpIeri İsIama telif edilecek kimseIer arasında payIaştırıImasınl, kaIpIeri iman ile dolu oIan kimseIerin de imanIarı ile baş başa bırakılmasını da gerektirdi. Daha sonra kalpIerin İsIama telif edilmesinin tamamIayıcl bir unsuru olarak onIardan alınan esirler de onIara geri verildi. Böylelikle kalpIerinde İsIaml kabuI etmek arzusu daha etkili bir haI aIdl, itaat ile ve istekle İslama girdiler. Bu durum da Mekkelilerin, kırılmış ve korkuya kapılmış oIan kalplerinin elde ettikleri zafer ve ganimet ile onarılması sonucunu verdi. Böylece onlara komşu olan ve Arapların en güçlü kabilelerinden sayılan Hevazinliler ile Sakiflilerin verebilecekleri kötülükleri bertaraf etmiş oldu. Çünkü onlar böyIe bir yenilgiye uğratIImlş, sonra da İslama girmelerine imkan ve fırsatlar doğmuştu. Şayet bunlar olmamış olsaydı Mekkeliler oIdukça güçlü ve pek kalabalık oIan bu kabileIere karşı direnemezIerdi. Ensarın olayına ve onlardan ileri geri bir şeyler söyleyenlere gelince, ensarın ileri gelenleri bu hareketlerin kendilerine tabi olan bazı kimseler tarafından yapılmış oIduğunu belirterek özür dilemişlerdi. Resulullah Sallallahu Aleyhi ve Sellem yaptığı uygulamada onlar için gizli kaIan hikmeti onIara açıklayınca, itaatle geri döndüler ve en büyük ganimetin kendilerinin elde ettikleri Resulullah Sallallahu Aleyhi ve Sellem ile birlikte üIkelerine geri dönmek olduğunu gördüIer. Böylelikle ganimet olarak aIınan koyun, deve, kadın ve çocuk esirlerin yerine bunları geride bırakan pek büyük mükafat ile teselli buldular. O pek şerefli Nebi, hayatta iken de, ölümünden sonra da onların komşusu oldu. İşte hikmeti pek büyük olanın adeti budur. Herkese kendisine uygun ne ise onu verir. (Özetle aktardığımız İbnu'l-Kayyim'in açıklamaları burada sona ermektedir. ) \"Ben sizIeri daIaIette buImadım mı?\" Burada maksat şirk daıaIetidir. Hidayetten kasıt da imandır. Restitullah Sallallahu Aleyhi ve Sellem yüce AlIah'ın kendi vasıtasıyIa onlara Iutfetmiş oIduğu nimetleri oIdukça beliğ bir şekilde sıralamıştır. Önce dünya işlerinden hiçbir şeyin kendisiyIe boy öIçüşemediği iman nimetini sözkonusu ederek başladı. İkinci oIarak onların kaIpIerini birbirine telif etme nimetin i hatırlattı. Bu da maI nimetinden daha büyüktür. Çünkü mallar bu nimeti eIde etmek için karşılık beklemeden harcanır, bununIa birlikte bu nimet eIde ediIemeyebilir. Hicretten önce ensar -bundan önce hicret ile ilgili açıklamaIarın baş taraflarında geçtiği üzere- araIarında baş göstermiş buIunan Buas savaşı ve daha başka vakıalar dolayısıyla birbirlerinden son derece nefret ediyorlar, aralarındaki bağlar paramparça olup kopmuş bulunuyordu. Bütün bunlar yüce Allah'ın şu buyruğunda dile getirdiği gibi İslam ile ortadan kalktı: \"Sen yeryüzünde olan her şeyi toptan harcasaydm, yine kalplerini birleştiremezdin. Fakat Allah aralarını bulup kalplerini kaynaştırdl. \"[Enfal, 63] \"Dileseydiniz, sen bize şu şu halde geldin ... derdiniz.\" Bu hususu Ebu Said yoluyla rivayet edilen hadiste açıklamış bulunmaktadır. Ordaki lafzıyla şöyledir: \"Allah ResLılü şöyle buyurdu: Ama Allah'a yemin ederim isteseydiniz şöyle diyebilirdiniz ve hem doğru söylemiş olurdunuz, hem de bu söyledikleriniz tasdik edilirdi: Sen bize yalanlanmış birisi olarak geldin, biz seni tasdik ettik. Kimsenin yardımına mazhar olmayan birisi olarak geldin, biz sana yardım ettik. Yurdundan kovulmuştun seni barındırdık, fakirdin seni gözettik.\" Bunu Ahmed de, Enes'ten şu lafızia rivayet etmiştir: \"Niye: Bize korku içinde geldin biz sana güvenlik verdik, kovulmuş olarak geldin biz seni barındırdık. Yardımdan mahrum idin biz sana yardım ettik demiyorsunuz? Onlar: Hayır, Allah'ın ve Resulünün üzerinizdeki lütufJarı daha çoktur, dediler.\" Senedi sahihtir. \"Eğer hicret olmasaydı andolsun ensardan bir kişi olurdum.\" İbnu'l-Cevzi der ki: Resulullah Sallallahu Aleyhi ve Sellem bu sözleriyle nesebini değiştirmeyi de, hicretinin silinmesini de kastetmiş değildir. O bu sözleriyle şunu kastetmiştir: Eğer daha önceden hicret etmemiş olsaydı, Medine'ye ve din e yardımcı olmaya kendisini nispet edecekti. Buna göre ifadenin takdiri şöyledir: Eğer hicret terk edilmesi sözkonusu olmayan dini bir nispet olmasaydı, şüphesiz ben de sizin diyarınıza kendimi nispet ederdim. Kurtubı der ki: Yani sizin adınızı alırdım ve size intisap ederdim. Tıpkı onların daha önce hilf (ahit ve antlaşma) yoluyla intisap ettikleri gibi. Fakat hicretin özelliği ve mertebe olarak öncelikli olması buna engelolmuştur. Çünkü hicret daha üstün ve daha şereflidir. Dolayısıyla başkası ile değiştirilmez. Anlamının şu olduğu da söylenmiştir: O takdirde ben hükümler itibariyle ensardan birisi olurdum ve onlar arasında sayılırdım. İfadenin takdirinin şöyle olduğu da söylenmiştir: Şayet hicretin sevabı daha büyük olmasaydı elbette sevabımın ensar sevabı olmasını tercih edecektim. \"Ensar iç elbisedir, sair insanlar dış elbisedir.\" İç elbise (şi'ar) bedenin tene değenleridir. Dış elbise (disar) ise onun üstünde giyilendir. Bu onların kendisine aşırı yakınlıklarını anlatmak için oldukça incelikli bir istiaredir. Ayrıca bu sözleriyle kendisinin oldukça özel sırdaşları olduklarını, başkalarına nispetle ona daha yakın ve onunla daha çok iç içe olduklarını anlatmak istemiştir. Ebu Said yoluyla gelen hadiste şu fazlalık bulunmaktadır: \"Allah'ım ensara, ensarın oğullarına, ensarın oğullarının oğullarına rahmet et. (Ebu Said) dedi ki: Hepsi sakallarını ıslatıncaya kadar ağladılar ve: Bize payolarak Resuluilah'ın düşmesine razıylZ, dediler.\" \"Şüphesiz benden sonra başkalarının tercih edildiğini göreceksiniz.\" Yani onların ortak olarak hak sahibi oldukları hususlarda başkalarının kendilerine tercih edildiğini göreceklerdir. \"Havz'ın başında benimle karşılaşacağınız vakte kadar sabrediniz.\" Kasıt kıyamet günüdür yani ölene kadar sabrediniz. Sizler beni Havzın yanıbaşında bulacaksınız. O vakit size zulmedenlerden hakkınız alınacak ve sabra karşılık size' pek büyük mükafat verilecektir. Hadisten Çıkarılan Diğer Bazı Sonuçlar Hadis-i şeriften daha önce kaydedilen hususlardan ayrı olarak bir takım sonuçlar daha çıkartılabilmektedir: 1- İhtiyaç duyulduğu takdirde hasma karşı delil ortaya konulabilir ve susturulur. 2- Tartışmayı terk etmek ve ileri derecede hayalı olmak suretiyle ensargüzel bir edebe sahipti. 3- Onlardan söylediler diye aktarılanlar aslında onların gençlerinin söyledikleri sözlerdi, olgun ve yaşlılarının söyledikleri sözler değildi. 4- Ensar için pek büyük bir menkıbe sözkonusudur. Çünkü Resulullah Sallallahu Aleyhi ve Sellem'in onlara ileri derecedeki övgüsünü ihtiva etmektedir. 5- Büyük olan küçük olanın fark etmediği hususa dikkatini çeker ve hakka dönmesi için ona şüphe ve tereddüte düşülen ciheti açıklar. 6- Sitem etmek, sitem edenin kalbini kazanmak ve onun sitemine karşılık vermek için sitem edilen kimse tarafından gerekli delilin ortaya konulması, mazeretini belirtmek ve itiraf etmek (meşru'dur). 7 - Bu hadiste nübuvvet alametlerinden bir alamet bulunmaktadır. Çünkü o: \"Benden sonra başkalarının size tercih edildiğini göreceksiniz\" diye buyurmuş ve dediği gibi olmuştur. ez-Zühri, Enes'ten diye rivayet ettiği hadisin sonlarında şunları söylemektedir: Enes dedi ki: \"Fakat onlar sabretmediler.\" 8- İmam (halife) bazı kimseleri ganimetierin dağıtılması hususunda bazılarına üstün tutabilir. Ayrıca o masıahat dolayısıyla varlıklı olana da ganimetten pay verebilir. 9- Dünyalıktan hakkını isteyen bir kimseye bundan dolayı sitem etmek sözkonusu değildir. 10- İster özel, ister genelolsun ortaya çıkan herhangi bir durum dolayısıyla hutbe vermek meşrudur. 11- Hutbe esnasında bir takım muhatapları özellikle sözkonusu etmek caizdir. 12- Bir miktar dünyalık kaybeden kimsenin ahirette elde edecekleri sevapIarı hatırlatarak tesellide bulunmak, hidayeti, ülfeti ve dünyalığa karşı müstağni davranma yolunu izlemeyi teşvik etmek, uygun bir yoldur. 13- Lütuf ve minnet duygusu kayıtsız ve şartsız olarak Allah'a ve Resulüne karşı duyulmalıdır. 14- Ahiret tarafı dünyaya öncelenir. Elde edilemeyen dünyalığa karşı da sabretmek gerekir ki, bu yolla sabredene ahiretteki ecri saklansın. Ahiret daha hayırlı ve daha kalıcıdır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 359
			}
		}
	]
}