{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "ez-Zuhrî şöyle demiştir: Bana Enes ibn Mâlik (radıyallahü anh) haber verip şöyle dedi: Allah, Hevâzin(harbindeki ganîmet) mallarından kendi Rasûlü'ne fey' olarak verdiğini verdiği ve Peygamber de Kureyş'ten birtakım kimselere (kalblerini İslâm'a alıştırmak için) yüzer deve vermeğe başladığı zaman, Ensâr'dan bâzı insanlar: Allah, Rasûlüllah'a mağfiret eylesin! O, Kureyş'e veriyor da bizleri terkediyor. Halbuki kılıçlarımızdan hâlâ Kureyşliler'in kanları damlıyor, dediler. devamla dedi ki: Ensâr'ın bu sözü Rasûlüllah'a söylendi. Bunun üzerine Rasûlüllah, Ensâr'a haber gönderip onları deriden bir çadır içinde toplattı. Ensâr'ın beraberinde başkalarını çağırmadı. Onlar toplanınca, Peygamber ayağa kalktı da: \"Ey Ensâr! Sizin tarafınızdan söylenip bana ulaşan o söz nedir?\" buyurdu. iyi anlayışlıları: Yâ Rasûlallah! Bizim başkanlarımız (sizi üzecek) hiçbir söz söylememişlerdir. Amma bizden yaşları taze bâzı insanlar: Allah, Rasûlüllah'a mağfiret eylesin! O, Kureyş'e veriyor da bizleri bırakıyor. Halbuki bizim kılıçlarımızdan hâlâ Kureyş kanı damlıyor, demişlerdir, dediler. üzerine Peygamber: \"Ben Kureyş'fen bâzı kimselere dünyalık veriyorum ki, bunlar küfür ve şirk zamanına yakın olan insanlardır. Ben onların gönüllerini İslâm Dîni'ne alıştırmak maksadıyla veriyorum. İnsanlar aldıkları mallarla giderlerken, sizler evlerinize Peygamber'le gitmenizde razı olmuyor musunuz? Allah'a yemin ederim ki, sizin Peygamber'le Medine'ye dönüp gitmeniz, onların ganimet mallarıyle evlerine gitmelerinden şübhesiz daha hayırlıdır\" buyurdu. Yâ Rasûlallah! Bizler Sen'inle Medine'ye gitmekten razı olmuşuzdur! dediler. de onlara: \"Sizler yakın gelecekte şiddetli bir surette başkalarının sizlere tercih olunmasıyle karşılaşacaksınız. Siz bu durumlara Allah'a ve Rasûlü 'ne kavuşuncaya kadar sabrediniz. Çünkü ben havuz başında olacağım\" buyurdu. Fakat sabretmediler, demiştir",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 360
			}
		}
	]
}