{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4331,
			"arabicnumber": 4331,
			"text": "Zühri dedi ki: Bana Enes b. Malik r.a. haber vererek dedi ki: \"Yüce Allah, Resulüne Hevazinlilerin mallarını fey' olarak verip, o da bazı kimselere yüz deveyi vermeye başlayınca ensardan bazıları: Allah Resulullah Sallallahu Aleyhi ve Sellem'e mağfiret et. Kılıçlarımızdan kanları damlıyorken Kureyş'e (bunca mal) veriyor da bizi bırakıyor, dedi. Enes dedi ki: Onların söyledikleri bu sözler Resulullah Sallallahu Aleyhi ve Sellem'e aktarılınca ensara haber gönderdi. Onları deriden yapılmış bir çadırda topladı. Beraberlerinde onlardan olmayan kimseyi de çağırmadı. Ensar bir araya gelince, Nebi Sallallahu Aleyhi ve Sellem ayağa kalkarak şöyle buyurdu: Söylediniz diye hakkınızda bana nakledilen sözler ne oluyor? Ensardan derin bilgi sahibi olanlar: Ey Allah'ın Resulü, bizim ileri gelenlerimiz hiçbir şey söylemiş değildir. Fakat aramızdan yaşı genç bazı kimseler: Allah Resulullah Sallallahu Aleyhi ve Sellem'e mağfiret etsin, onların kanları kılıçlarımızdan damlıyorken Kureyş'e veriyor da, bizi bırakıyor demişler, dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Şüphesiz ben küfürden henüz yeni dönmüş bir takım kimselere kalplerini ısındırmak için bir şeyler veriyorum. Diğer insanların mal alıp giderken sizler evlerinize Nebi s.a.v. ile birlikte gitmeye razı olmaz mısınız? Allah'a yemin ederim, sizin beraberinizde alıp gittiğiniz onların beraberlerinde alıp gittiklerinden daha hayırlıdır. Ensar: Ey Allah'ın Resulü, biz buna razı olduk deyince, Nebi Sallallahu Aleyhi ve Sellem onlara şöyle dedi: Pek yakında başkalarının size oldukça ileri derecede tercih edildiğini göreceksiniz. Allah'a ve Resulüne Sallallahu Aleyhi ve Sellem'e kavuşuncaya kadar sabrediniz. Ben Havz'ın başında olacağım. Enes dedi ki: Fakat sabretmediler",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 360
			}
		}
	]
}