{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4341,
			"arabicnumber": 4341,
			"text": "Ebû Musa'nın oğlu Ebû Burde Âmir şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) Ebû Mûsâ ile Muâz ibn Cebel'i Yemen'e gönderdi. Ebû Burde: Yemen iki mıntıkadır, dedi ve şöyle devam etti: Rasûlüllah bunlardan herbirini bir mıntıka üzerine âmir gönderdi. Sonra (bunlara verdiği emirler cümlesinden olarak): \"İkiniz de insanlara kolaylık gösteriniz; işleri zorlaştırmayınız, müjdeleyiniz; ürkütmeyiniz\" buyurdu. Burde dedi ki: Akabinde bunlardan herbiri kendi me'mûriyet yerine gitti. Burde dedi ki: Bu ikisinden herbirisi kendi vazifeli bulunduğu arazîde gezip dolaştığı ve arkadaşının mıntıkasına yaklaştığı zamân arkadaşını (ziyaretle) dostluğunu yenilemek ve ona selâm verip esenlik dilemek i'tiyâdında idiler. Bir kerresinde Muâz kendi mıntıkasını dolaşıp, arkadaşı Ebû Musa'nın vilâyetine yaklaştığından katırına binerek dostunu ziyarete gitmişti. Ebû Musa'nın bulunduğu yere vardığında, onu bir yere oturmuş, etrafında da insanlar toplanmış vazıyette buldu. Bir de yanında iki eli boynuna bağlanmış birisinin durduğunu gördü. Muâz, Ebû Musa'ya: Yâ Abdallah ibne Kays! Bu ne iştir? diye sordu. Ebû Mûsâ: Bu elleri bağlı duran, İslâm'a girdikten sonra dînden dönmüş bir kişidir, dedi. ibn Cebel de: Bu mürted öldürülmedikçe katırımdan inmem, dedi. Ebû Mûsâ da: Bu kimse ancak bunun için, yânı öldürülmek için getirilmiştir; haydi sen bineğinden aşağı in! dedi. yine: Bu dîninden dönmüş kişi öldürülünceye kadar ben inmiyorum, dedi. ısrar üzerine Ebû Mûsâ onunla ilgili emrini verdi, o da öldürüldü.' Sonra da Muâz, Ebû Musa'ya: Yâ Abdallah! Kur'ân'ı nasıl ve ne zaman okursun? diye sordu. Mûsâ da: Gündüz ve gecenin ayrı ayrı zamanlarına ayırarak okurum, dedi. defa da Ebû Mûsâ: Yâ Muâz! Ya sen nasıl okursun? diye sordu. O da: Ben gecenin ilk kısmında uyurum, sonra uykumdan bir kısmını uyumuş olarak kalkar ve Allah'ın bana takdîr edip yazdığı kadar Kur'ân okurum. İbâdet ve Kur'ân okumak üzere) kalkışımdan sevâb umar olduğum gibi, uykumdan da sevâb umarım, dedi",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}