{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4358,
			"arabicnumber": 4358,
			"text": "Ebu Osman'dan rivayete göre \"Resulullah Sallallahu Aleyhi ve Sellem Amr b. As'ı Zatu's-Selasil('e gönderdiği) ordusuna (kumandan olarak) göndermişti. (Amr b. el-As) dedi ki: Allah Resulünün yanına gittim ve: En çok sevdiğin insan kimdir diye sordum. O: Aişe'dir dedi. Ben: Ya erkeklerden, diye sordum, babasıdır dedi. Sonra kimdir diye sordum. Ömer deyip, daha sonra da başka bir takım kimseleri saydı. Beni en sonuncuları olarak sayar korkusuyla sustum.\" Fethu'l-Bari Açıklaması: \"Zatu's-Selasil gazvesi\" Denildiğine göre buna Zatu's-Selasil denilmesinin sebebi müşriklerin, kaçarlar korkusuyla birbirlerini zincire bağlamalarından dolayıdır. İbn Sa'd'ın naklettiğine göre burası Vadi'l-Kura'nın ötesinde onunla Medine arasında on günlük mesafede bir yerdir. (İbn Sa'd) der ki: Bu gazve hicretin sekizinci yılı cumade'l-ahire ayında olmuştur. \"İbn İshak, Yezid'den, o Urve'den diye rivayet ettiğine göre burası Bem, Uzra ve Benu Kayn'in diyarıdır.\" Burada sözü geçen Yezid, Yezid b. Ruman olup, Medineli meşhur birisidir. Urve, Zubeyr b. el-Awam'ın oğludur. Sözü edilen kabileler ise Kuzaalılardan üç kolun adıdır. İbn Sa'd'ın naklettiğine göre Kuzaahlardan bir topluluk bir araya gelerek Medine'nin yakın çevresine yaklaşmak istediler. Nebi Sallallahu Aleyhi ve Sellem, Amr b. el-As'ı çağırarak ona beyaz bir sancak vermiş ve onu muhacir ve ensarın ileri gelenlerinden üçyüz kişinin başına kumandan tayin etmiştir. Daha sonra ona ikiyüz kişilik bir yardımcı kuwetin başında Ebu Ubeyde b. el-Cerrah'ı da göndermiş, Amr'a yetişmesini ve birbirleriyle herhangi bir anlaşmazlığa düşmemelerini emretmiştir. . İbn İshak'ın naklettiğine göre Amr b. el-As'ın annesi Bem'den idi. Bu sebeple Nebi Sallallahu Aleyhi ve Sellem, Amr'ı insanları İslam için savaşa çıkmaya çağırmak ve bu yolla onların kalplerini İslama ısındırmak istemişti. İshak b. Rahuye (Rahaveyh) ile el-Hakim, Bureyde yoluyla rivayet ettiklerine göre Amr b. el:As onlara bu gazvede onlara (askerlerine) hiçbir ateş yakmamalarını emretmiş idi. Ancak Ömer buna karşı çıkmıştı. Ebu Bekr ise ona: Ona ilişme. Çünkü ResuluIlah Sallallahu Aleyhi ve Sellem'in onu başımıza kumandan olarak göndermesinin tek sebebi savaş ilmini bilmesidir deyince, Ömer susup bir şey söylemekten vazgeçti. İbn Hibban,Kays b. Ebi Hazim yoluyla, onun da Amr b. el-As'tan rivayet ettiğine göre \"Resulullah Sallallahu Aleyhi ve Sellem kendisini Zatu's-Selasil'e (kumandan olarak) gönderdi. Arkadaşları ona ateş yakmak istediklerini söyledilerse de o onlara engeloldu. Bu sefer bu hususta Ebu Bekr ile konuştular. Ebu Bekr de buna dair onunla konuşunca Amr: Onlardan kim bir ateş yakarsa onu o yaktığı ateşin içine atarım, dedi. (Ravi) dedi ki: Sonra düşmanla karşılaştılar. (Amr) onları yendi. Düşmanın peşine takılmak istediler, Amr onlara engeloldu. Geri döndüklerinde bu hususları Nebi Sallallahu Aleyhi ve Sellem'e anlatınca ona sebebini sordu. Amr da şu cevabı verdi: Benim onlara ateş yakmalarına müsaade etmeyişimin sebebi, düşmanlarının onların sayıca az olduklarını görmelerini istemeyişim idi. Arkalarından onları takip etmelerinden hoşlanmayışım ise, o kaçanların yardımcı kuwetlerinin bulunma ihtimalini düşündüğümden idi, diye cevap verince Allah Resulü onun bu yaptıklarını övdü.\" Hadisten Çıkarılan Bazı Sonuçlar 1-faziletçe dahaı,aşağıda olan kimsenin -başına getirildiği o görev ile alakah ayrı bir niteliğe sahip olduğu biliniyor ise- daha faziletli olana amir tayin edilmesi caizdir. 2- Ebu Bekr'in erkekler üzerinde, kızı Aişe'nin de kadınlara göre bir üstünlüğü vardır. Buna daha önce Menkıbeler bölümünde işaret edilmiş bulunmaktadır. 3- Aralarından Ebu Bekr ile Ömer'in bulunduğu bir orduya kumandan tayin edilmesi Amr b. el-As için bir menkıbe değerindedir. Her ne kadar bu onun onlardan daha faziletli olmasını gerektirmiyar ise de belli bir hususta onun bir üstünlüğe sahip olmasını da gerektirmektedir. 64. CERİR'İN YEMEN'E GİDİŞİ",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 384
			}
		}
	]
}