{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4372,
			"arabicnumber": 4372,
			"text": "Ebû Hureyre(radıyallahü anh) şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem) Necd tarafına bir süvârî müfrezesi gönderdi. Bu müfreze Benû Hanîfe kabilesinden Sumâme ibn Usâl denilen bir kişiyi esîr edip getirdiler ve onu mescidin direklerinden birisine bağladılar. AkabindePeygamber mescide çıktı ve ona: \"Yâ Sumâme, yanında ne var (gönlünden ne geçiriyorsun ve benden ne umuyorsun)?\" buyurdu. Gönlümde hayır(ümîdi) var yâ Muhammed!(Çünkü Sen zulmetmezsin; ihsan ve in'âm edersin.) Eğer Sen beni öldürürsen, kanlı bir cânîyi öldürmüş olursun. Eğer bana in'âm edersen ni'mete karşı şükredici bir kişiye in'âm etmiş olursun. Eğer (kurtuluş fidyem için) mal istersen, ne kadar dilersen işte malım, dedi. konuşmadan sonra Sumâme bağlı olarak bırakıldı. Nihayet ertesi gün oldu, sonra Peygamber yine ona hitaben: \"Yâ Sumâme, gönlünde ne var; ne umuyorsun?\" dedi. da: Gönlümde dün Sana söylediğim şey vardır. Eğer in'âm edersen, ni'mete karşı şükredici bir kimseye in'âm etmiş olursun! dedi. onu o gün de bağlı olarak bıraktı. Nihayet üçüncü gün olunca Peygamber yine: \"Yâ Sumâme, yanında ne var?\" buyurdu. de: Yanımda dün Sana söylediğim şey var, dedi. \"Sumâme'yi salıveriniz!\" buyurdu. bağından salıverilince, hemen mescidin yakınındaki bir suya gitti, yıkandı, sonra mescide girdi ve: Eşhedu en lâ ilahe illellâh ve eşhedu enne Muhammeden Rasûlüllah dedi ve şöyle devam etti: Yâ Muhammed! Vallahi şu yeryüzünde bana Sen'in yüzünden daha düşman hiçbir yüz yoktu. Fakat bu sabah Sen'in yüzün, bana yüzlerin en sevimlisi olmuştur. Vallahi dînlerden hiçbir dîn bana Sen'in dîninden ziyâde düşman gelmezdi. Fakat bu sabah Sen'in dînin bana göre dînlerin en sevimlisidir. Vallahi beldelerden hiçbir belde bana Sen'in belden kadar sevimsiz değildi. Fakat bu sabah Sen'in belden bana beldelerin en sevimlisi oldu. Ey Rasûl! Ben umre yapmaya niyet ettiğim sırada Sen'in süvarilerin beni yakalamışlardı. Şimdi Sen ne re'y edersin? dedi. üzerine Rasûlüllah, Sumâme'yi(dünyâ ve âhiret saâdetiyle) müjdeledi ve umre yapmasını emretti. Sumâme umre yapmak için Mekke'ye varınca birisi ona: Dîninden başka bir dîne mi döndün? dedi. O da: Hayır, vallahi ben dînden çıkmadım. Fakat ben Allah'ın Rasûlü olan Muhammed'in beraberinde müslümân oldum. Vallahi ben (sizin dîn dediğiniz müşrikliğe) dönmem ve Peygamber o hususta izin vermedikçe size Yemâme'den bir buğday tanesi gelmeyecektir, dedi",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 398
			}
		}
	]
}