{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4376,
			"arabicnumber": 4376,
			"text": "Ebu Reca el-Utaridi diyor ki: \"Biz taş(lar)a ibadet ederdik. Eğer ibadet ettiğimizden daha hayırlı bir taş bulacak olursak Onu fırlatır, diğerini alırdık. Taş bulmadığımız takdirde bir miktar toprağı bir araya getirip toplar, daha sonra koyunu alıp gelir, o yığdığımız toprağın üzerine sütünü sağardık. Sonra da onun etrafında dönerdik. Receb ayı girdi mi: Mızrakların başındaki sivri uçlarını çıkaralım der ve üzerinde demir bulduğumuz her mızrağın, her okun demiririi çeker çıkarırdık. Receb ayında bunları bir tarafa bırakırdık.\" [-4377-] Ebu Reca'yı şöyle derken dinledim: \"Nebi Sallallahu Aleyhi ve Sellem'e Nebilik verildiği gün ben yakınlarım için deve otIatan bir çocuk idim. Biz onun çıkışını işitince ateşe yani Müseylimetu'l-Kezzab'a kaçıp gittik.\" Fethu'l-Bari Açıklaması: \"Ondan daha hayırlı bir taş\" el-Kuşmihenı rivayetinde: ''-Ondan daha hayırlı\" yerine \"ondan daha güzel\" şeklindedir. Daha hayırlı oluştan kasıt, maddi bakımdan böyle oluşudur. Daha beyaz, daha düzgün ve buna benzer taşlarda güzel görülen diğer sıfatlara sahip olması gibi. \"Nebi Sallallahu Aleyhi ve Sellem'e Nebilik verildiği gün ben ailem için deve otlatan bir çocuk idim. Onun çıkışını işittiğimizde ateşe, yani Müseylimetu'I-Kezzab'a kaçtık.\" Anlaşıldığı kadarıyla onun \"Nebi olarak gönderildiği\" sözleri ile kastettiği onun Nebiliği, aralarında yaygın bir hal aldığı zamandır. Çıkışından maksat ise Mekke'nin fethedilmesi suretiyle kavmi olan Kureyşlilere üstünlük sağlamasıdır. Yoksa kastettiği ne Nebi olarak ortaya çıkışının başlangıç dönemidir, ne de Mekke'den Medine'ye çıkışıdır. Çünkü bu haller arasındaki süre ile Müseylime'nin yalancı Nebi olarak çıkışı arasındaki süre oldukça uzundur. Kıssanın delalet ettiğine göre Ebu Reca kendi kavmi olan Temim oğullarından bir kololan Utarid b. Avf b. Ka'b oğulları arasından, Müseylime'ye bey'at etmiş kimselerden idi. Buna sebep ise yine Temim oğullarından bir kadın olan Secah'ın aynı şekilde nübuvvet iddiasında bulunmuş olması idi. Secah'a da kavminden bir topluluk uymuş, daha sonra Müseylime'nin durumunu haber alınca Müseylime onu ikna edip sonunda onunla evlenmiş ve Secah'ın kavmi ile Utarid'in kavmi Müseylime'ye itaat etrafında birleşmişti",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}