{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4382,
			"arabicnumber": 4382,
			"text": "Enes'ten rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Her ümmetin bir emini vardır. Bu ümmetin emini de Ebu Ubeyde b. el-Cerrah'tır. \" Fethu'l-Bari Açıklaması: \"Necranlılar kıssası\" Necran, Mekke'den Yemen'e doğru yedi merhale uzaklıkta büyükçe bir şehirdir. Bu şehirde 73 kasaba vardır ki hızlıca giden bir atlının bir günde katedeceği bir mesafe boyunca yayılmışlardır. İbn İshak'ın nakletliğine göre Necranlılar Resulullah Sallallahu Aleyhi ve Sellem Mekke'de iken heyet olarak yanına geldiler. O sırada 20 kişi idiler. İbn Sa'd dedi ki: Nebi s.a.v. onlara mektup göndermiş, bunun üzerine ileri gelenlerinden 14 kişilik bir heyet onun huzuruna gitmek üzere çıkmışlardı. \"Necran'ın iki sahibi Seyyid ve el-'Akib geldi.\" Seyyid'in adı el-Eyhem idi, Şurahbil olduğu da söylenmiştir. Onların yük ve eşyalarından toplantılarından sorumlu sahipleri idi ve bu işte onlara başkanlık ederdi. el-'Akıb'ın adı Abdu'l-Mesih olup, onların istişare toplantılarının sahibi (başkanı) idi. Aynı şekilde bunlarla birlikte Ebu'l-Haris b. Alkame de bulunuyordu. O da onların papazları, alimleri ve okullarının sahipleri (yöneticileri) idi. İbn Sa'd dedi ki: Nebi Sallallahu Aleyhi ve Sellem onları Müslüman olmaya çağırdı, onlara Kur'an okudu. Fakat onlar kabul etmediler. Bunun üzerine şöyle buyurdu: Eğer benim söylediklerimi reddediyorsanız haydigelin, sizinle mubahale yapayım (Ianetleşeyim). Onlar da bu halde iken ayrilıp gittiler. \"Onunla lanetleşmek istediler.\" Mubahalede bulunmak istediler. Hadisten Çıkarılan Sonuçlar Necranlıların kıssasından çıkan bir takım sonuçlar vardır: 1- Kafir nubuweti kabul ederse, İslam hükümlerine bağlanmayı da kabul . etmedikçe İslama girmiş sayılmaz. 2- Kitap ehli ile tartışmak caizdir. Eğer bunda bir masıahat kaçınılmaz bir hal alacak olursa vacip dahi olabilir. 3- Muhalif olan bir kimse, delilin açıkça ortaya çıkmasından sonra yine yanlışında ısrar edecek olursa onunla mubahale yapmak meşrudur. Nitekim İbn Abbas, sonra da el-Evzaı böyle bir davette bulunmuştur. Bu iş ilim adamlarından bir topluluk tarafından da fiilen uygulanmıştır. Tecrübe yoluyla bilindiği üzere haksız olduğu halde mübahalede bulunan bir kimse üzerinden mübahale yaptığı günden sonra bir sene geçmez. İnkarcılardan birisine taassubla bağlı bir kişi ile ben de böyle bir mubahale yaptım, o mubahaleden sonra ancak iki ay yaşadı. 4- Zimmet ehli ile imamın uygun gördüğü şekilde çeşitli türden mal almak karşılığında sulh yapılabilir ve bu onlara konulan cizye vergisi hükmündedir. Çünkü her ikisi de kafirlerden her yılonların küçüItülmesi suretiyle alınan bir maldır. 5- İmam, alim ve güvenilir bir kimseyi kendileriyle barış yapıImlş olan kimselere İslamın maslahatına olan bir iş için gönderebilir. 6- Ebu Ubeyde b. el-Cerrah r.a.'a ait açıkça bir menkıbe de bulunmaktadır. 73. UMAN VE BAHREYN KISSASI",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 405
			}
		}
	]
}