{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4415,
			"arabicnumber": 4415,
			"text": "Ebû Mûsâ el-Eş'arî(radıyallahü anh) şöyle demiştir: Arkadaşlarım olan Eş'arîler (Tebûk seferi hazırlığı sırasında) kendilerine binek ve yük hayvanı istemem için beni Rasûlüllah'a gönderdiler. Çünkü bunlar Tebûk gazasında Rasûlüllah ile beraber bu güçlük ordusu içinde bulunmak istiyorlardı. Bunun üzerine ben: Ey Allah'ın Peygamberi! Arkadaşlarım Eş'arîler, kendilerine binek ve yük hayvanı vermeniz için beni size gönderdiler! dedim. \"Vallahi ben sizleri hiçbir hayvana bindirmem\" buyurdu. o sırada Peygamber'i bilmediğim bir sebeble öfkeli bir hâlde bulduğum için, O'nun bu sözü üzerine beni reddetmesinden hüzünlü ve bana karşı gönlünde bir dargınlık bulunmasından endişeli olarak kederli bir hâlde geriye döndüm. Arkadaşlarımın yanına dönüp geldiğimde Peygamber'in söylediği sözü onlara haber verdim. Bunun üzerine çok beklemedim, ancak bir sâatçık kadar bir zaman geçmişti. Birden Bilâl’in: Ey Abdallah ibne Kays! diye nida etmekte olduğunu işittim. hemen ona cevâb verdim. Bilâl: Rasûlüllah seni çağırıyor, hemen icabet et! dedi. Rasûlüllah'ın huzuruna varınca, o sırada Sa'd ibn Ubâde'den satın aldığı altı deveyi bana göstererek: \"Şu çifti al, şu çifti de al! Bunları arkadaşlarının yanına götür. Onlara: Allah -yahut da şöyle buyurdu- Rasûlüllah sizleri bu develer üzerine yükler, artık bunlara bininiz de!\" buyurdu. de bu develerle arkadaşlarımın yanına gittim ve: Peygamber sizleri bu develer üzerine yüklüyor. Lâkin ben vallahi sizin birkaçınız benimle beraber Rasûlüllah'ın bundan önce söylediği sözü işiten bir kimsenin yanına gidinceye ve onun Rasûlüllah'ın öyle söylediğini açıklamasına kadar sizleri bırakmam. Ki sizler, Rasûlüllah'ın söylemediği bir sözü benim size söylemiş olduğumu sanmayasınız, dedim. da bana: Vallahi sen bizim yanımızda elbette doğru sözlü olarak kabul edilmişsindir. Bununla beraber yapmak istediğini de elbette yaparız, dediler. Ebû Mûsâ, Eş'arîler'den birkaç kişi ile gitti. Nihayet bunlar, Rasûlüllah'ın Eş'arîler'i önce deveden men' edip sonra onlara develer vermesine dâir sözlerini işitmiş olan kimselerin yanlarına vardılar. O kimseler de Ebû Musa'nın kendi hemşehrilerine söylediği gibi Peygamber'in sözlerini söylediler",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 437
			}
		}
	]
}