{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4442,
			"arabicnumber": 4442,
			"text": "Nebi Sallallahu Aleyhi ve Sellem'in zevcesi Aişe r.anha dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem'in hastalığı ağırlaşıp, ağrıları çoğalınca diğer zevcelerinden hastalığını benim evimde geçirip, bakımının orada yapılması için izin istedi. Onlar da ona izin verdiler. Ayakları yerde sürüklendiği halde iki kişi onun yanlarından tutmuş olarak çıktı. Onu yanlarından tutanlardan birisi Abbas b. Abdulmuttalib idi. Diğeri de bir başka kişi idi. Ubeydullah dedi ki: Ben Abdullah'a Aişe'nin dediklerini söyleyince, Abdullah b. Abbas bana dedi ki: Aişe'nin adını vermediği diğer adamın kim olduğunu biliyor musun? Ubeydullah dedi ki: Ben hayır dedim. İbn Abbas: O Ali'dir dedi. Nebi Sallallahu Aleyhi ve Sellem'in.zevcesi Aişe radıyallShu anhS şunu anlatırdı: Resulullah Sallallahu Aleyhi ve Sellem benim evime girip, rahatsızlığı ağırlaşınca şöyle buyurdu: Bana ağızları çözülmemiş yedi kırbadan su dökün. Belki insanlara bir tausiyede bulunurum. Bunun üzerine biz de onu Nebi Sallallahu Aleyhi ve Sellem'in eşi Hafsa'ya ait büyükçe bir leğene oturttuk. Sonra da o kırbalardan üzerine su dökmeye koyulduk. Nihayet o bize: Yaptığınız bu kadarı yeter, diye işaret etti. Aişe dedi ki: Sonra insanların (ashabın) yanına çıktı, onlara namaz kıldırdı ve hutbe verdi.\" Fethu'l-Bari Açıklaması: \"Yedi kırbadan\" denildiğine göre bu sayıdaki hikmet, zehir ve sihirin zararlarını defetmekte bir özelliği bulunmasından dolayıdır. Bu başlığın baş taraflarında onun: İşte bu o zehirden ötürü kalp damarımın kesildiği zamandır dediği zikrediImiş idi. Köpeğin artığının necis olmadığını söyleyerek bundan dolayı yedi defa kabın yıkanması emrinin sadece onun tükürüğündeki zehirin etkisinin önlenmesi için olduğunu söyleyen bazı kimseler de delil diye buna tutunmuşlardır. Halbuki \"kim sabahleyin acve türü yedi hurma yiyecek olursa o gün ona ne zehir, ne de sihir zarar verir\" diye buyurduğu da sabittir. Nesai de Fatiha'nın musibete uğramış kimseye yedi defa okunacağına dair rivayet zikretmiş bulunmaktadır. Bunun da senedi sahihtir. Müslim'in Sahih'inde ağrısı bulunan kimseye şöyle denileceği belirtilmektedir: \"Yedi defa euzu bi izzetillahi ve kudretihi min şerri ma ecidu ve uhaziru: Bu hissettiğimin ve bundan dolayı da uğramaktan çekindiğim şeylerin şerrinden Allah'ın izzetine ve kudretine sığınırım, denir.\" Nesai'de de şöyle denilmektedir: \"Her kim henüz eceli gelmemiş bir hastaya yedi defa: Eselullahe'l-azim Rabbe'l-arşi'l-azim en yeşfiyek: Azametli olan Allah'tan, azim Arşın Rabbinden sana şifa vermesini diliyorum ... diyecek olursa\" denilmektedir. İbn Ebi Şeybe tarafından rivayet edilen, Ebu Cafer yoluyla gelen mürsel rivayete göre de Nebi Sallallahu Aleyhi ve Sellem: Yarın nerede olacağım diye ormuş ve bu sorusunu defalarca tekrarlamıştır. Böylelikle zevceleri Aişe'nin yanında olmak istediğini anladılar ve: Ey Allah'ın Resulü, biz günlerimizi kızkardeşimiz Aişe'ye bağışladık, dediler",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 463
			}
		}
	]
}