{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"64": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4458,
			"arabicnumber": 4458,
			"text": "Bize Ali anlattı, bize Yahya anlattı ve şunları ekledi: \"Aişe dedi ki: Hastalığı esnasında ağzına ilaç koymuştuk. O bize ağzıma ilaç koymayın diye işaret etmeye başlayınca, biz de: Bu hastanın ilaçtan hoşlanmayışından dolayıdır, dedik. Kendisine gelince: Ben size ağzıma ilaç koymaktan vazgeçmenizi işaret etmedim mi, dedi. Biz: Ama bu hastanın ilaçtan hoşlanmayışından dolayıdır diye düşünmüştük, dedik. Bunun üzerine: el-Abbas hariç gözümün önünde bu evde ağzına ilaç konulmadık kimse kalmasın. Çünkü el-Abbas bunu yaparken yanınızda değildi, diye buyurdu.\" Bu Hadis 5712, 6886 ve 6897 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Ağzına ilaç koyduk.\" Yani o istemeden ağzının kıyısından ona ilaç içirdik. İşte \"el-Iudud\" diye bilinen şey de odur. Boğaza dökülen ilaca da \"el-vecur\" denilir. \"Evde Abbas'ın dışında gözümün önünde ağzına ilaç konulmadık kimse kalmayacaktır. Çünkü o bunu yaparken yanınızda hazır bulunmadı.\" Denildiğine göre bu ibarelerden bir kimseye kasten yapılan bütün işlerden dolayı kısas yapmanın meşruiyeti anlaşılmaktadır. Ancak böyle bir sonucun çıkartılması tartışılır. ÇÜnkü herkes fiilen bu işi yapmamıştı. Allah Resulünün bunu onlara yapması buna dair yasağına uymayı terk ettiklerinden dolayı onlara bir ceza olması içindi. Fiilen bu işi yapanlara böyle bir cezanın verilmesi açıkça anlaşılır. Ancak fiilen bu işi yapmayanlara bu cezanın sebebi ise, Allah Resulünün onları yapmaktan nehyettikleri işi kendilerinin de yapanları alıkoymayı terk etmiş olmaıçmndan dolayıdır. Bundan anlaşıldığına göre uzak ihtimalli tevilde bulunan kişi mazur değildir. Ancak bu da tartışılır bir sonuçtur. Çünkü yapılan bu hareket nehye karşı durarak yapılmıştır. İbnu'l-Arabı der ki: Allah Resulü kıyamet gününde onun üzerlerinde bir hakkı bulunduğu halde gelmelerini ve böylelikle çok büyük bir zorlukla karşı karşıya kalmamalarını istediğinden böyle yapmıştır. Ancak buna karşı da şu cevap verilmiştir: Onları affetmesi mümkündü. Çünkü o kendi zatı adına intikam almazdı. Kuwetli gördüğümüz görüşe göre o böylelikle tekrar aynı işi yapmamaları için onları tedib etmek istemiştir. Dolayısıyla onun bu şekilde karşılık vermesi kısas ve intikam yoluyla değil, tedib içindi. Bir diğer açıklamaya göre o tedavi olmayı kabul etmekle birlikte ağzına ilaç konulmasından hoşlanmayışının sebebi bu hastalıktan iyileşmeyip, öleceğinin kesinlik kazanmış olmasıydı. Bu noktada kesin kanaate sahip olan bir kimse için ise tedavi olmak mekruhtur. Derim ki: Ancak bu da tartışılır. Çünkü göründüğü kadarıyla bu hareket Allah Resulünün ölüm ile hayat arasinda muhayyer bırakılmasından ve vefat edeceğinin kesinlik kazanmasından önce idi. Onun bu tedaviye karşı çıkmasının sebebi verilen ilacın hastalığına uygun olmayışı idi. Çünkü onlar Nebiimizin zatu'l-çenb hastalığına yakalanmış olduğunu sanıyorlardı. Bundan dolayı ona uygun bir tedavi yaptılar. Oysa görüldüğü gibi hadisin siyakından açıkça da anlaşıldığı üzere onun böyle bir hastalığı yoktu. Doğruyu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 64,
				"hadith": 474
			}
		}
	]
}