{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4487,
			"arabicnumber": 4487,
			"text": "Ebu Saıd el-Hudri'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğu nakledilmiştir: \"Kıyamet günü nuh aleyhisselam çağrılacak. O hemen, 'Ya Rabbi! Emrine icabet edip divanına geldim, fermanına amadeyim,\" diyecek. Bunun üzerine Allah Teala ona, \"Tebliğde bulundun mu?\" diye soracak. Nuh Nebi, 'Evet' diye cevap verecek. Bu defa kavmine, 'Size tebliğ etti mi?' diye soracak. Fakat onlar, 'Bize hiç uyarıcı gelmedL' şeklinde cevap verecekler. Bunun üzerine Allah Teala Nuh Nebi'e 'Sana kim şahitlik edecek?' diye soracak. O da, 'Muhammed, Sallallahu Aleyhi ve Sellem ve ümmeti' şeklinde cevap verecek. Bunun üzerine Muhammed ve ümmeti onun tebliğde bulunduğuna dair şahitlik edecek. Aynı şekilde Muhammed size de şahitlik edecektir. Bu durum şu ayeti kerimede bildirilmektedir: İşte böylece sizin insanlığa şahitler olmanız, Resulün de, size şahit olması için sizi mutedil bir ümmet kıldık. [Bakara 143] Bu ayette geçen ........vasatan kelimesi mutedil manasına gelir.\" Fethu'l-Bari Açıklaması: \"İşte böylece sizin insanlığa şahitler olmanız, Resulün de, size şahit olması için sizi mutedil bir ümmet kıldık.\" Bu ayetin açıklaması \"Kitabu'l-i'tisam\" bölümünde yapılacaktır. وسطا vasata\" Taberı bu kelimenin izahı ile ilgili olarak şöyle demiştir: .....vasata, Arap dilinde \"üstün\" manasına gelir. Mesela birinin değerini yükseltmek istedikleri zaman .....felanun vasata fi kavmihi ve vasıtun denir .. Kanaatime göre bu ayette geçen وسطا kelimesi, \"iki taraf arasında bulunan\" anlamına gelir. Buna göre Muhammed ümmeti, dinde mutedil bir çizgide oldukları için .....vasat olarak isimlendirilmiştir. Çünkü onlar, ne Hıristiyanlar gibi aşırılığa gitmişler, ne de Yahudiler gibi taksirde bulunmuşlardır. Aksine onlar orta yolu takip edip mutedil bir çizgide devam etmişlerdir.\" Kanaatime göre ayette geçen .... kelimesinin \"aracılık etmek\" manasına uygun olması, bu kelimeden başka bir mananın kastedilmediği anlamına gelmez. Nitekim bu hadis, bunu göstermektedir. Dolayısıyla hadis ile ayetin manası arasında herhangi bir çelişki yoktur. Doğrusunu en iyi Allah bilir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 14
			}
		}
	]
}