{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4528,
			"arabicnumber": 4528,
			"text": "{İbnu'l-Münkedir'den Cabir'in şöyle dediği nakledilmiştir: Yahudiler \"Bir erkek kadın ile arka tarafından yaklaşarak ilişkiye girerse, çocuk şaşı dünyaya gelir,\" derdi. Bunun üzerine \"Kadınlarımz sizin için bir tarladır. Tarlamza nasıl dilerseniz öyle varın,\" ayeti nazil oldu. Fethu'l-Bari Açıklaması: Ayette geçen ...enna edatı hakkında farklı görüşler vardır. Bir görüşe göre bu edat, \"nasıl\", bir diğer görüşe göre, \"nereden\", bir başka görüşe göre ise, \"ne zaman\" anlamına gelir. Bu farklılıklara göre ayetin yorumu da farklılık arz etmektedir. Muhammed İbn Yahya İbn Said el-Kattan'ın rivayetini Taberani, \"el-Evsat\"ta Ebu Bekir A'yun, Muhammed İbn Yahya kanalı ile yukarıdaki senetle İbn Ömer'den nakletmiştir. Bu rivayete göre İbn Ömer şöyle demiştir: \"Allah Teala, 'Kadınlar sizin için bir tarladır,' ayetini anal ilişkiye izin vermek için indirmiştir.\" Taberani bu rivayet hakkında şöyle demiştir: \"Bunu, Abdullah İbn Ömer'den sadece Yahya İbn Said nakletmiştir. Ondan da yalnızca oğlu Muhammed aktarmıştır.\" Ancak bunu Abdullah İbn Ömer'den sadece Yahya İbn Said nakletmemiştir. Abdulaziz ed-Deraverdi de Ubeydullah İbn Ömer'den bunu rivayet etmiştir. Ayrıca bu hadisi Nafi'den, bizim isimlerini verdiğimiz ravilerden daha başka bir grup da nakletmiştir. Bu kimselerin rivayetleri, İbn Merdliye'nin tefsirinde bulunmaktadır. İsmam Buharı'nin tasarrufunu eleştirmiştir. Bu konuda şunları söylemiştir: \"İbn Ömer'den naklettiği bütün rivayetler kapalıdır. Herhangi bir yarar taşıma- . maktadır. Biz, Abdulaziz ed-Deraverdi kanalıyla Malik, UbeydulIah İbnÖmer ve İbn Ebı Zi'b'den bu konuda rivayette bulunduk. Her üçü de, bu konudaki tefsiri Nafi\"den aktarmıştır. Malik'ten de çeşitli yollarla bu bilgi aktarılmıştır.\" Bahsi geçen ed-Deraverdı'nin rivayetini Darekutnı, \"Garaibu Malik\" adlı eserinde Nafi\"den nakleden üç farklı ravi kanalıyla aktarmıştır. Bu rivayet İbn Avn'ın ondan aktardığı rivayete benzemektedir. Söz konusu rivayet sözleri şu şekildedir: \"Bu ayet eşi ile arkadan ilişkiye giren ensardan bir adam hakkında nazil oldu. İnsanlar onun bu yaptığını büyüttüler. Bunun üzerine ayet indi.\" Hadisi aktaran ravi, İbn Ömer'e \"O kişi, hanımının arkasından yaklaşıp ön tarafıyla mı ilişkiye girmişti,\" diye sormuş. İbn Ömer de: \"Hayır, onunla sadece anal ilişkiye girmişti,\" cevabını vermiştir. Zeyd İbn Eslem İbn Ömer'den aktardığı rivayet ile, bu konuda Nafi\"ye mutabaatta bulunmuştur. Zeyd'in bu rivayet i sahıh bir senet ile Nesaı tarafından nakledilmiştir. Ezdi bu rivayetin bazı ravilerini eleştirmiştir. Ancak İbn Abdilberr buna karşı çıkmıştır. Gerçekten İbn Abdilberr bu konuda haklıdır. O bu hususta şöyle demiştir: \"Bu konudaki İbn Ömer rivayeti, sahıh ve meşhurdur. Bunu, ondan Nafi' nakletmiştir. Dolayısıyla Zeyd İbn Eslem'in İbn Ömer'den bunu nakletmiş ol!li}sı yadırganamaz.\" Abdullah İbn Ömer'den oğlu Abdullah da bu rivayeti aktarmıştır. Söz konusu bu rivayet de Nesaı tarafından tahriç edilmiştir. Saıd İbn Yesar ile Salim İbn Abdillah İbn Ömer babasından Nafi\"nin sözlerine benzer sözler aktarmıştır. Saıd ve Salim'in rivayetleri de Nesaı ve İbn Cerır et-Taberı tarafından tahriç edilmiştir. Söz konusu rivayet şu şekildedir: \"Abdurrahman İbn Kasım'dan şöyle nakledilmiştir: İmam Malik'e: Bazı insanlar Salim'in, 'Köle babama iftira attı' dediğini haber verdi. Bunun üzerine İmam Malik: 'Şunu kesinlikle ifade edeyim ki, Zeyd ibn Ruman bana, Salim İbn Abdillah İbn Ömer'in babasından Nafi\"nin sözlerine benzer sözler aktardı,' dedi. Ben de şöyle karşılık verdim: 'Haris İbn Yakup, Saıd İbn Yesar kanalıyla İbn Ömer'in şöyle dediğini nakletmiştir: yazıklar olsun! Müslüman biri hiç böyle söyler mi? Malik de şöyle dedi: 'Şunu kesinlikle belirteyim ki, Rabia bana, Saıd İbn Yesar kanalıyla İbn Ömer'in Nafi\"nin sözlerine benzer sözler söyled!ğini haber vermişti.\" Bu rivayeti Darekutnı, Abdurraman ıbn Kasım kanalıyla Imam Malik'ten nakletmiştir. Sonra da şöyle demiştir: Imam Malik'in böyle söylediği kaydedilmiştir. Bu rivayet de sahihtir. Hatıb \"Ruva.tı Ma.lik\" kitabında İsrall İbn Ravh'tan şunu nakletmiştir: İmam Malik'e bunu [kadına arkadan yaklaşma meselesini] sordum. O da şöyle cevap verdi: Siz Arap değil misiniz? Tarla, sadece ekine müsait yer değil midir? Müteahhir Malikller bu olaya dayanmışlardır. Muhtemelen İmam Malik ilk görüşünden vazgeçmiştir. Ya da kendi kuralına gi2re rivayet sahıh olsa bile amelin, İbn Ömer hadisinin zıddına olduğunu düşünmüş ve bu hadisle amel etmemiştir. Bu ayetin arkadan ilişkiye izin verme konusunda indiği hususunda İbn Ömer yalnız değildir. Ebu Ya'la, İbn Merduye, İbn Cerır ve Tahavı, Zeyd İbn Eslem ve Ata İbn Yesar kanalıyla Ebu Saıd el-Hudri'den şöyle nakletmişlerdir: \"Ensardan bir adam hanımıyla anal ilişkiye girdi. İnsanlar bundan dolayı onu kınadılar ve 'Hanımını da ayıplıyoruz,' dediler. Bunun üzerine Allah Teala bu ayeti indirdi.\" Nesaı, Hişam İbn Saıd kanalıyla Zeyd'den bu rivayeti senetsiz olarak zikretmiştir. Ayetin iniş sebebi olarak anlatılan bu olay meşhurdur. Öyle anlaşılıyor ki, Ebu Saıd'den gelen rivayet İbn Abbas'a ulaşmamıştır. Ona, İbn Ömer'den gelen rivayet ulaşmıştır. Bu yüzden İbn Abbas, İbn Ömer'in yanıldığını belirtmiştir. Nitekim Ebu Davud Mücahid kanalıyla İbn Abbas'tan şöyle nakletmiştir: Allah affetsin, İbn Ömer yanılmıştır. Putperest olan ensarın bu kanadı, ehli kitap olan Yahudilerin şu kanadı ile birlikte yaşıyordu. Araplar Yahudilerin bir çok uygulamasını benimsemişlerdi. Onlar, kadınlarla tek bir şekilde ilişki kurarlardı. Onların ilişki tarzı, kadının her tarafının görülmesine müsait değildi. Ensar da bu adeti onlardan alıp uygulamaya başlamıştı. Kureyşliler ise kadınların keyfini çıkarırlardı. Onlarla yüzyüze, arkalarını çevirerek ve sırt üstü yatırarak ilişki kurarlardı. Muhacirlerden biri ensardan bir hanım ile evlenmişti. Adam bu şekilde hanımıyla ilişki kurmak istemiş ama kadın buna razı olmamıştı. İkisi arasında yaşanan bu olay yayılmış ve Nebi Sallallahu Aleyhi ve Sellem'e kadar ulaşmıştı. Bunun üzerine Allah Teala, \"Kadınlarınız sizin için bir tarladır. Tarlanıza nasıl dilerseniz öyle varın,\" ayetini indirdi. Bu ayet, erkeklerin onlarla yüzyüze, arkalarını çevirerek ve sırt üstü yatırarak ilişki kurabileceklerini gösterir. Bu rivayeti Ahmed İbn Hanbel de rivayet etmiştir. Tirmizı de sahıh bir senetle İbn Abbas'tan şu rivayeti nakletmiştir: \"Hz. Ömer gelip: 'Ey Allah'ın Elçisi! Ben bittim. Dün gece yolumu değiştirdim,' dedi. Bunun üzerine; 'Kadınlarınız sizin için bir tarladır. Tarlanıza nasıl dilerseniz öyle varın,' ayeti nazil oldu. Ayet şu anlama gelir: Önden olduğu sürece kadınla ister yüzyüze, ister ters çevirerek ilişki kurabilirsiniz. Yalnız arkadan ve hayızlı durumda her iki taraftan da sakının! Mazirı şöyle demiştir: \"İnsanlar, arkadan ilişki konusunda farklı görüşler benimsemişlerdir. Bunun helal olduğunu söyleyenler bu ayete sarılmışlardır. Haram olduğunu söyleyenler ise ayeti kerıme hakkında şu izahı yapmışlardır: Bu ayet, Cabir hadisinde belirtildiği üzere Yahudileri reddetmek için inmiştir. Bazı Fıkıh Usulü alimlerine göre bir sebeb e binaen gelen umumi hükümler, sadece o sebebi bağlar. Ancak çoğunluğa göre sebebin hususlliği değil, lafzın umumlliği esas alınır. Bu durum, ayetin arkadan ilişkinin caiz oluşu konusunda delilolduğu anlamına gelir. Ancak bunu yasaklayan birçok hadis rivayet edilmiştir. Bu hadisler, ayetin umumlliğini hüküm ifade etmesini tahsis etmiştir. Kur'an'daki umumı ifadelerin ahad haberlerle tahsis edilmesi konusu da ihtilaflıdır.\" Aralarından Buharı, Zühll, Bezzar, Nesaı ve Nısaburı'nin de bulunduğu bazı hadis alimleri, arkadan ilişkiyi yasaklayan sahıh herhangi bir rivayetin olmadığı kanaatindedirler. Kanaatime göre, bu rivayetler çok farklı yollarla nakledildiği için, delil olarak kullanılmaya müsaittir. Arkadan ilişkinin haram olduğuna dair görüşü şu husus da desteklemektedir: Eğer arkadan iliş.kivi caiz kabul eden görüşleri tercih etsek, bu durumda haram kılınan bir şeyin sonradan helal kılınması gerekir. Halbuki aslolan bunun tersidir. Senet bakımından uygun olan hadislerden bazılarını şu şekilde sıralayabiliriz: a) Ahmed İbn Hanbel, Nesaı, İbn Mace ve İbn Hibban'ın Huzeyme İbn Sabit'ten naklettikleri hadis. İbn Hibban bu hadisin sahıh olduğunu belirtmiştir. b) Ahmed İbn Hanbel ile Tirmizı'nin Ebu Hureyre'den rivayet ettikleri hadis. İbn Hibban bu hadisin de sahıh olduğunu belirtmiştir. c) İbn Abbas'tan gelen hadis. Biraz önce buna işaret edilmişti. d) Tirmizı'nin şu rivayeti: \"Allah Teala, bir erkekle veya bir kadınla arkadan ilişki kuran kimseye (rahmet nazarıyla) bakmaz.\" İbn Hibban bu rivayetin de sahıh olduğunu belirtmiştir. Hal böyle olunca, şunu söylemek mümkün olur: Ayetin umumlliği tahsis edilir. Ayette geçen .....enna edatı, \"yer\" anlamına gelirse, bahsi geçen ilişki arkadan ilişkinin dışında anlaşılır. Zaten ayetin akışından da bu mana ortaya çıkmaktadır. Bu da, ayeti anlamını ilk etapta akla gelen mananın dışına çıkarmaya ihtiyaç bırakmamaktadır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 51
			}
		}
	]
}