{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4531,
			"arabicnumber": 4531,
			"text": "Sizden ölüp de (dul) eşler bırakan kimseler. .. \"[Bakara 234] ayeti hakkında Mücahid şöyle demiştir: Kadınlar, ölen kocalarının ailesinin yanında bu iddeti beklerlerdi. Bu şekilde iddet beklemeleri farzdır. Sonra Allah Teala, \"Sizden ölüp de (dul) eşler bırakan kimseler, zevcelerinin, evlerinden çıkarılmadan, bir yıla kadar bıraktıkları maldan faydalanmaları hususunda (sağlıklarında) vasiyet etsinler. Eğer o kadınlar, (kendiliklerinden) çıkıp giderlerse, kendileri hakkında yaptıkları meşru şeylerden size bir günah yoktur,\" ayetini indirdi. Allah Teala, vasiyet olarak iddete yedi ay yirmi gün daha ekleyerek onu, tam bir seneye Çıkardı. Kadın dilerse vasiyete uygun olarak evde kalır, dilerse çıkar. İşte bu, Allah TealS'nın \"Zeveelerinin, evlerinden çıkarılmadan, bir yıla kadar bıraktıkları maldan faydalanmaları hususunda (sağlıklarında) vasiyet etsinler. Eğer o kadınlar, (kendiliklerinden) çıkıp giderlerse, kendileri hakkında yaptıkları meşru şeylerden size bir günah yoktur,\" ifadesinin açıklamasıdır. Dört ay on gün iddet beklemek ise, kadına farzdır. Bu sözleri İbn Ebı Nüceyh Mücahid'den aktarmıştır. Ata, İbn Abbas'ın şöyle dediğini nakletmiştir: Bu ayet, kadının ailesi yanında iddet bekleme hükmünü neshetti. Bundan böyle kadın, dilediği yerde iddetini bekler. Nesheden ise ayetin .......gayra ihracin (evlerinden çıkarılmadan) bölümüdür. ' Ata, İbn Abbas'tan aktardığı bu sözü şu şekilde açıklamıştır: Kadın, dilerse kocasının ailesinin yanında kalır ve kendisi için yapılan vasiyyet çerçevesinde mesken hakkını kullanır. Dilerse evden çıkar. Çünkü Allah Teala \"Kendileri hakkında yaptıkları meşru şeylerden size bir günah yoktur,\" buyurmuştur. Ata son olarak şöyle demiştir: Sonra miras ayeti indi ve boşanmış kadınların mesken hakkını kaldırdı. Bundan böyle kadınlar, diledikleri yerde iddetlerini beklerler. Artık onların mesken hakkı yoktur. Hadisin geçtiği diğer yer: 5344",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 54
			}
		}
	]
}