{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4540,
			"arabicnumber": 4540,
			"text": "Aişe radiyallahu anha'dan rivayet edildiğine göre o şöyIe demiştir: \"Bakara suresinin sonunda buIunan faizIe ilgi ayetIer inince AlIah ResılIü Sallallahu Aleyhi ve Sellem bunIarı insanlar okudu. Sonra şarap ticaretini haram kıIdı.\" Fethu'l-Bari Açıklaması: .....el-messü, cünun anlamına gelir.\" Bu yorum Ferra'ya aittir. O \"Faiz yiyenler (kabirlerinden) şeytan çarpmış kimselerin cinnet nöbetinden kalktığı gibi kalkarlar, \"[Bakara 275] ayeti hakkında şöyle demiştir: \"Faiz yiyenler ahirette bu şekilde kalkacaklardır. .....el-messü, cünun anlamına gelir. Araplar mecnun olan biri için, .....memsusün derler.\" Bu lafzın tefsiri hakkında Ebu Ubeyde de şöyle demiştir: .........el-messü cinlerin çarpması anlamına gelir.\" İbn Ebı Hatim İbn Abbas'ın şöyle dediğini nakletmiştir: \"Faiz yiyen kıyamet günü cin çarpmış şekilde diriltilir.\" Abdullah İbn Mes'ud'un oğlundan, babasının bu ayeti (Bakara 275) şu şekilde okuduğu nakledilmiştir:.........(Faiz yiyeler kıyametgünü (kabirleriden), şeytan çarpmış kimselerin cinnet nöbetinden kalktığı gibi kalkarlar.} Ayet-i kerımede geçen .....ve ehallellahu'l-bey'a ve harreme'r-riba cümlesi, kafirler tarafından dile getirilmiş itirazın bir devamı olabilir. Bu durumda ayete şu anlam verilir: \"Kafirler dediler ki: Alışveriş de faiz gibidir. O halde Allah, neden birini helal, ötekini haram kıldı? Bu cümle kafirlere karşı verilmiş bir cevap da olabilir. Faizi helal kılanlar akıl yolu ile itiraz etmişlerdir. Onlara verilen cevap ise din yoluyla olmuştur. Dinin hükümleri ise değiştirilmez. Müfessirlerin çoğu ikinci görüşü benimsemiştir. Büyük alimler ilk görüşü uzak görmüşlerdir. Bu görüşün pek isabetli görülmemesinin tek haklı gerekçesi ......fe men caehu mev'ızatün min rabbihı şeklinde başlayan cümlenin bu yoruma göre bir takdire ihtiyaç duymasıdır. Halbuki sözde de esas olan takdir yapılmamasıdır. (Sonra şarap ticaretini haram klld1.) Bu kısmın açıklaması \"Alış-veriş - Buyu' Bölümünde\" geçmişti",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 63
			}
		}
	]
}