{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4552,
			"arabicnumber": 4552,
			"text": "İbn Ebı Müleyke'nin anlattığına göre iki kadın bir evde veya bir odada deri dikiyorlardı. Bir gün içlerinden biri eline biz saplanmış şekilde dışarı çıktı. Bizi eline arkadaşının batırdığını iddia etti. Mesele [çözümlemesi için] İbn Abbas'a götürüldü. İbn Abbas olayı kendisine anlatanlara Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: Eğer iddialarına bakılarak insanlara istedikleri verilseydi, toplumun ne can güvenliği, ne de mal güvenliği kalırdı. Sonra onlardan kadına Allah'ı hatırlatmalarını ve ona \"Allah'a karşı verdikleri sözü ve yeminlerini az bir bedelle değiştirenlere gelince, işte bunların ahirette bir payı yoktur,\" ayetini okumalarını istedi. Onlar da gidip kadına bunu hatırlattılar. Kadın hatasını kabul etti. Bunun üzerine İbn Abbas Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletti: Yemin davalıya düşer. Fethu'l-Bari Açıklaması: لا خلاق لهم 'illa halaka lehum.\" Ebu Ubeyde bu ifadeyi \"Onların hayırdan hiç nasipleri yoktur,\" şeklinde tefsır etmiştir. \"Ayetin sonunda bulunan Hhllmün sözcüğü elem kökünden türetilmiş olup \"acı veren, can yakan anlamına gelir.\" Burada if'al babından ism-i iail manasında kullanılmıştır.\" İmam Buharı bu bilgilerden sonra İbn Mes'ud'dan nakledilen hadisi aktardı. Bu hadisin içinde Eş'aslın da sözü bulunmaktadır. O \"Allah'a karşı verdikleri sözü ve yeminlerini az bir bedelle değiştirenlere gelince, işte bunların ahirette bir payı yoktur,\" ayetinin bir kuyu hakkında hasmı ile mahkemeleşmesi üzerine kendisi hakkında indiğini söylemiştir. Abdullah İbn Ebı Evfa'dan nakledilen hadis ise bu ayetin pazara mal çıkaran ve malına verilmediği halde yüksek bir fiyat verildiğini söyleyerek Müslümanları aldatmaya çalışan bir adam hakkında indiğini bildirmektedir. Bu iki rivayetin uzlaştırılması \"Kitabu'ş-şehadat\"ta geçmişti. Doğrusu bu iki rivayet arasında bir çelişki yoktur. Bu ayet iki sebebe binaen inmiştir. Ayrıca ayetin lafzı bu sebeplerden daha genel bir mana taşımaktadır. \"İki kadın bir evde veya bir odada deri dikiyorlard!.\" Bu kadınların isimleri \"Kitabu'l-eyman ve'n-nüzur\"da hadisin şerh i ile birlikte açıklanacaktır. İmam Buharı söz konusu hadise, İbn Abbas'ın kendisine gelenlerden, şikayetçi kadına \"Allah'a karşı verdikleri sözü ve yeminlerini az bir bedelle değiştirenlere gelince, işte bunların ahirette bir payı yoktur,\" ayetini okumalarını istediği için bu başlık altında yer vermiştir. Çünkü bu ifadede ayetin sebebinin hususiliği ile değil de, genel anlamı ile amel etmeye bir işaret vardır. Yine buna göre, yemin etmesi gereken insanlara bu ayet ile nasihatte bulunulur",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 74
			}
		}
	]
}