{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4574,
			"arabicnumber": 4574,
			"text": "Urve İbnü'z-Zübeyr'den rivayet edildiğine göre, o, Hz. Aişe'ye \"(Kendileriyle evlendiğiniz takdirde) yetimlerin haklarına riayet edememekten korkarsanız,\" ayetinin tefsirini sormuş. Hz. Aişe de şöyle cevap vermiş: \"Bak yeğenim!9 Bu ayette bahsi geçen yetim kız, velisinin himayesindedir. Ayrıca onun malına ortaktır. Hem güzelliği, hem de malı velisinin hoşuna gitmektedir. Ancak velisi, onun mehrini adil olarak ya da başkalarının vereceği kadar vermeden onunla evlenmek istemektedir. İşte böylesi velilerin, himayelerindeki yetim kızlarla evlenmeleri yasaklanmıştır. Ancak onlarla, mehirleri konusunda adil davranarak ve emsallerinin aldığı mehirlerin en yükseği üzerinden onların mehirlerini vererek evlenebilirler. Aksi takdirde, kendilerine helalolan diğer kadınlarla evlenmeleri emredilmiştir. \" Urve Hz. Aişe'nin şunları da söylediğini nakletmiştir: \"Bu ayetten sonra insanlar, Hz. Nebi'den kadınlar hakkında fetva istediler. Bunun üzerine Allah Teala\"Senden kadınlar hakkında fetva istiyorlar, '[Nisa 127] ayetini indirdi.\" Hz. Aişe sözlerine şöyle devam etti: \"Bu ikinci ayette bulunan .....ve terğabune en tenkihuhunne ifadesi 'herhangi birinizin, [himayesi altında bulunan] malı az olan ve güzelliği de yerinde olmayan bir yetim ile evlenme arzusunun olmaması' anlamına gelir. Erkeklerin, himayeleri altında bulunan, güzellikten ve maldan nasibi az olan yetim kızlarla evlenme isteği taşımamalarından dolayı, yine himayeleri altında bulunan, güzellikleri ve mallarından etkilendikleri yetim kızlar ile evlenmeleri de yasaklanmıştır. Ancak adaletli olmaları durumunda onlarla evlenmelerine izin verilmiştir.\" Fethu'l-Bari Açıklaması: İmam Buharı'nin ........ ([Kendileriyle evlendiğiniz takdirde] yetimlerin haklarına riayet edememekten korkarsanız,) başlığında kullandığı ayette geçen ...hiftum (korkarsanız) fiili, ,\"zannederseniz,\" ....tuksidu fiili ise \"adaletli davranmak\" anlamına gelir....Tuksidu if'al babından gelir . ......Kaseda \"haksızlık yapmak,\"....akseda \"adaletli olmak\" anlamında kullanılır. Kendilerine helalolan diğer kadınlarla evlenmeleri emredilmiştir, ifadesine göre, erkekler, anlaştıkları bir mehir ile kendilerine helalolan diğer kadınlarla evlenebilirler. Hz. Aişe'nin bu yorumunun bir benzeri İbn Abbas'tan nakledilmiştir. Taberi bu rivayeti tefsirinde zikretmiştir. Mücahid'den de, \"Beğendiğiniz (veya size helalolan) kadınların ikisi, üçü, dördü ile evlenin\" ifadesinin \"(Kendileriyle evlendiğiniz takdirde). yetimlerin haklarına riayet edememekten korkarsanız,\" ifadesine bağlanması konusunda, ayeti şu şekilde yorumladığı nakledilmiştir: \"Ye,timlerin malları konusunda adaletli davranamayacağınızdan çekinir ve bu yüzden onların ve lay etini üstlenmez, bir de zinaya düşmekten korkarsanız, o zaman hoşunuza giden ve size helalolan kadınlarla evlenin!\" Hz. Aişe'nin yorumuna göre, ayette geçen \"korkarsanız\" şartı yetimlerin nikahlanması ile bağlantılıdır. Bu durumda ayetin anlamı \"(Kendileriyle evlendiğiniz takdirde) yetimlerin haklarına riayet edememekten korkarsanız,\" şeklinde olur. Erkeklerin, himayeleri altında bulunan, güzellikten ve maldan nasibi az olan yetim kızlarla evlenine isteği taşımamalarından dolayı, yine himayeleri altında bulunan, güzellikleri ve mallarından etkilendikleri yetim kızlar ile evlenmeleri de yasaklanmıştır. Himayeleri altında bulunan çirkin ve fakir yetim kızlarla evlenmek istemedikleri için, erkeklerin, güzellikleri ve mallarından dolayı onlarla evlenmeleri de yasaklanmıştır. Hem güzel, hem de çirkin yetimlerin nikahlanması ancak adaletle olur. Yukarıdaki hadisten, himaye altında olan yetimler için misli mehrin esas alındığı anlaşılır. Ancak diğer kadınlarla misli mehrin altında tespit edilmiş bir mehirle de evlenilebilir. Bu hadisten anlaşıldığına göre; veliler, himayeleri altında bulunan ve bülCığ çağına ermemiş olan yetim kızlarla evlenebilirler. Çünkü bülCığ çağına ermiş babasız çocuklara yetim denmez. Ancak istishab yoluyla denebilir. Bu konudaki . ayrıntılı açıklamalar \"Kitabu'n-nikah / Nikah Bölümü\"nde yapılacaktır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 96
			}
		}
	]
}