{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4576,
			"arabicnumber": 4576,
			"text": "İbn Abbas'ın şöyle söylediği rivayet edilmiştir: \"(Mirastan payı olmayan) yakınlar, yetimler ve yoksullar miras taksiminde hazır bulunursa ... \" ayeti muhkemdir, neshedilmemiştir. Bu hadisi İbn Abbas'tan nakletmede Saıd İbn Cübeyr İkrime'ye mutabaat etmiştir. Fethu'l-Bari Açıklaması: \"(Mirastan payı olmayan) yakınlar, yetimler ve yoksullar miras taksiminde hazır bulunursa ... \" ayet i muhkemdir, neshedilmemiştir. İsmalll başka bir senetle Eşcaı'den bu rivayeti şu ziyade ile nakletmiştir: İbn Abbas miras paylaştırmaya oturduğu zaman, mirasçı olmayan yakınlara, yetimlere ve yoksullara hediye kabilinden bir şeyler verirdi. Mal az olursa, bu kimselere kendisini mazur görmelerini söylerdi. İşte ayette geçen 'güzel söz'den maksat budur. Bu hadisi İbn Abbas'tan nakletmede Saıd İbn Cübeyr İkrime'ye mutabaat etmiştir. İmam Buhari bu rivayeti, \"Kitabu'l-vasaya\"da senedi ile birlikte şu şekilde zikretmişti: Bazı insanlar bu ayetin mensuh olduğunu iddia ediyor. Kesinlikle böyle bir şey yoktur. Allah'c{ yemin ederimki, bu ayet neshedilmemiştir. Ama bu, insanların içeriği ile amel etme konusunda gevşek davrandığı bir ayettir. Burada iki akraba vardır. Bunlardan biri mirasçı olur ve mirastan payını alır. Diğeri ise mirasçı olmaz. İşte bu tür'akrabalara \"Sana bir şey veremiyoruz\" vb. güzel sözler söylenir. İbn Abbas'tan gelen bu rivayetlerin senetleri sahihtir. Her ikisi de mutemeddir. İbn Ebi Hatim ve İbn Merdliye tarafından yine İbn Abbas'tan zçı.yıf senetlerle çeşitli rivayetler nakledilmiştir. Bunlara göre, söz konusu ayet mensuhtur. Miras ayeti onu neshetmiştir. Bu konuda Said İbn Müseyyeb'den sahih bir rivayet aktarılmıştır. Kasım İbn Muhammed, İkrime ve daha başka alimler de bu görüştedir. Dört mezhep imamı ve onlara tabi olan alimler de bu kanaattedir. Bu konuda İbn Abbas'tan üçüncü bir görüş daha aktarılmıştır. Abdurrezzak İbn Hemmam, Kasım İbn Muhammed kanalıyla ve sahih bir senetle şu rivayeti nakletmiştir: Abdullah İbn Abdirrahman İbn Ebi Bekir, Hz. Aişe hayatta iken, babası Abdurrahman'ın mirasını paylaştırdı. Evdeki yakınlara ve yoksullara babasından kalan mirastan pay vermedEm mirası böıüştürmedi. Sonra da bu ayet i okudu. Kasım olayı anlatmaya şöyle devam etti: \"Bu olayı İbn Abbas'a anlattığım zaman o, şöyle dedi: Hata etmiş. Onun böyle bir yetkisi yoktur. Bu yetki, vasiye aittir. Malın dağıtılması, ölenin erkek akrabalarının görevidir. Çünkü ölen kişinin, erkek akrabalarına vasiyyette bulunması müstehaptır.\" Kanaatime göre bu rivayet yukarıdaki başlık altında zikredilen ve söz konusu ayetin mensuh olmadığını, aksine muhkem olduğunu gösteren hadis ile çelişmez. Bu ayetin anlamı şu şekilde izah edilmiştir: Miras paylaştırılınca, ölünün mirasçı olmayan akrabaları ile yetim ve yoksul kimseler hazır bulunabilirler. Bu insanlar, özellikle de paylaştırılan mal çok ise, mirastan bir payalmayı umarlar. Bu yüzden Allah Teala onlara iyilik yapma ve güzel davranma adına hediye kabili nden bir şeylerin verilmesini emretmiştir. Ancak bu görüşte olanlar da, \"ayetteki emrin vüclib mu, yoksa nedb mi ifade ettiği konusunda\" ihtilafa dÜşmüşlerdir. Mücahid ve bir grup alime göre ayetteki emir, vüclib ifade eder. İbn Hazm da bu kanaattedir. Onlara göre mirasçı kimseler, bu gruplara gönüllerinden koptuğu kadar pay vermek zorundadır. İbnu'l-Cevzi, alimlerin çoğuna göre ayette geçen \"yakınlar\" ifadesi ile mirasçı olmayanların, \"onları da rızıklandırın\" ifadesi ile ise \"onlara verin\" anlamının kastedildiğini nakletmiştir. Başka alimler ise \"onları da rızıklandırın\" ifadesinin \"onlara yedirin\" anlamına geldiğini söylemiştir. Ayetteki emir, bunun mübah olduğunu belirtmek içindir. Güçlü olan görüş de budur. Eğer ayetteki emir bu hükmün farz olduğuna delalet etmiş olsaydı, bu, ayette adı geçen kimseler için miras malında insanlar arasında anlaşmazlığa yol açacak biçimde bir hak doğururdu. İbn Sirin ve bazı alimler şöyle demiştir: \"Bundan, onları da rızıklandırın\" ifadesi ile, \"Miras malından onlara bir yemek yapın,\" anlamı kastediimiştir. Bu ayet, mahcCır ve diğer kimselerin malları hakkında genel bir hüküm taşımaktadır}",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 98
			}
		}
	]
}