{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4579,
			"arabicnumber": 4579,
			"text": "Bize (Ebû İshâk Süleyman ibnu Feyrûz) eş-Şeybânî, İkrime'den; o da İbn Abbâs'tan tahdîs etti. eş-Şeybânî şöyle dedi: Bu hadîsi Ebü'l-Hasen Atâ es-Suvâî de zikretti ki, ben onun bunu muhakkak İbn Abbâs'tan zikrettiğini düşünüyorum: \"Ey îmân edenler, kadınlara zorla mîrâsçı olmanız ve onları -kendilerine verdiğiniz mehirden birazını gider (ip elinize geçire)bilmeniz için- tazyik etmeniz size halâl olmaz. Meğerki arayı açacak bir fuhuş işlemiş olsunlar. Onlarla iyi geçinin. Eğer kendilerinden hoşlanmadınızsa, olabilir ki birşey sizin hoşunuza gitmez de Allah onda birçok hayır takdir etmiş bulunur\"(Âyet: 19). Abbâs dedi ki: Câhiliyet halkının şu âdetleri vardı: Bir adam vefat ettiği zaman, onun velîleri kalan zevcesini de mîrâs almaya herkesten haklı olurlardı. Velîlerden bâzısı isterse ilk mehri ile o kadınla evlenir, isterlerse onu başka birisiyle evlendirip mehrini alırlardı. Yine isterlerse o kadını kimseyle evlendirmezler(fidye vermesi için habsederler, ölünce mîrâsını alırlar)dı. Ölenin velîleri o kadına, kadının ailesinden daha haklı olurlardı. İşte bu âyet, bunlar hakkında (bu kötü âdetleri kaldırmak hususunda) indi. Allah'ın Şu Kavli: (Erkek ve dişiden) herbiri için baba ve ananın, yakın hısımların terîkelerinden de vârisler yaptık. Akd ile yeminlerinizin bağladığı kimselere de hisselerini verin. Allah herşeyin üstünde hakîkî bir şâhiddir\"(Âyet: 33) \"Velîler\", \"Mirasçılar\" demektir. Ma'mer de şöyle demiştir: \"Evliya\", \"Mevâlî'dir, yine \"Evliya\", \"Mirasçılar”dır. karşılıklı muâhade akdettiği kimseler...\"; bu, yemîn mevlâsıdır ki, yeminle bağlanan kişiden ibarettir. \"el-Mevlâ\", yine \"Amcaoğlu\"; \"el-Mevlâ’l-mu'tıku\", \"Kölesine hürriyet veren kişi\"; \"el-Mevlâ’l-mu'taku\", \"Kendisine hürriyet verilen kimse\"; \"el-Mevlâ’l-meliku\", \"İnsanların işlerini(yürütmeyi, idare etmeyi) üzerine alan kimse\", bir de dînde olan \"Mevlâ\" vardır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 101
			}
		}
	]
}