{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4579,
			"arabicnumber": 4579,
			"text": "İbn Abbas'ten rivayet edildiğine göre, o, \"Ey iman edenler! Kadınlara zorla varis olmanız size helal değildir. Onlara verdiğinizin bir kısmını ele geçirmeniz için de kadınları sıkıştırmayın!\" ayeti hakkında şöyle demiştir: İslamıdan önce Arapların adetine göre, biri öldüğü zaman onun velileri hanımı hakkında herkesten daha çok söz sahibi olurdu. İsterse kadınla evlenirler, isterse onu başkasıyla evlendirirler, isterlerse evlendirmezlerdi. Kadının ailesinden çok, onun hakkında söz sahibi idiler. Bunun üzerine bu ayet inmiştir. Hadisin geçtiği diğer yerler: 4579, 6984. Fethu'l-Bari Açıklaması: İbn Abbas'ın ..........1lla ta'dulDhünne ifadesini bu şekilde tefsir ettiğini gösteren rivayet, İmam Taberi ve İbn Ebi HMim tarafından Ali İbn Ebi Talha kanalıyla naklediimiştir. Bu ayet (Nisa 19) o dönemdeki Arapların şu uygulamasını anlatıyor: Bazıları, hoşlanmadığı karısından ayrılmak isterdi. Fakat ona mehir borcu olurdu. Bunu da ödemek istemezdi. Bu yüzden mehirden vazgeçip ayrılması için hanımını rahatsız etmeye başlardı. Mücahid'in şöyle dediği nakledilmiştir: \"Tıpkı Bakara suresinde olduğu gibi,(Bakara 232) bu ayetin muhatabı, kadının ailesidir. Sonra bu görüş zayıflamaya başladı ve diğeri tercih edilir oldu.\" İbn Abbas'ın \"';......huben kelimesini \"günah\" şeklinde tefsır etmesi, İbn Ebı Hatim tarafından Davud İbn Ebı Hind ve İkrime kanalıyla senetli olarak nakledilmiştir. Bu rivayete göre, İbn Abbas bunu ......innehCı kane hCıben kebıra \"Bu, büyük bir günahtır,\" şeklinde tefsır etmiştir. İbn Abbas'ın ....nihleten kelimesini mehir olarak tefsır etmesi ise, İbn Ebı Hatim ve Taberı tarafindan Ali İbn Ebı Talha kanalıyla nakledilmiştir. İsterlerse kadınla evlenirler, isterlerse onu başkasıyla evlendirirler, isterlerse evlendirmezlerdi. Kadının ailesinden çok, onun hakkında söz sahibi idiler. Ali İbn Ebı Talha kanalıyla İbn Abbas'ın şöyle söylediği nakledilmiştir: \"Adamın biri öldüğü zaman geride bir hanım bırakırsa, yakını olan kimse hanımının üstüne bir elbise atardı. Böylece onun diğer insanlarla ilişki kurmasına engelolurdu. Kadın güzelse, onunla evlenirdi. Şayet kadın çirkinse, ölünceye kadar onunla ne evlenir, ne de onu başkasıyla evlendirirdi. Kadın ölünce de ona varis olurdu",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 101
			}
		}
	]
}