{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4581,
			"arabicnumber": 4581,
			"text": "Bana Muhammed ibnu'l-Abdilazîz tahdîs etti. Bize Ebû Omer Hafs ibnu Meysere, Zeyd ibn Eslem'den; o da Atâ ibn Yesâr'dan; o da Ebû Saîd el-Hudrî(radıyallahü anh)'den şöyle tahdîs etti: Peygamber (sallallahü aleyhi ve sellem) zamanında birtakım insanlar: Yâ Rasûlallah! Biz kıyâmet gününde Rabb'imizi görecek miyiz? dediler. \"Evet (kıyâmet gününde Rabb'inizi göreceksiniz); Güneşin ziyâını öğle vakti önünde hiçbir bulut yokken görmek için itişip kakışmaya', birbirinize zahmet vermeye hacet görür müsünüz?\" diye sordu. Hayır görmeyiz, dediler. \"Ayın ondördüncü gecesi önünde hiç bulut yok iken görmek için birbirinize zahmet vermeye hacet görür müsünüz?' dedi. Hayır, görmeyiz, dediler. Peygamber: \"İşte bu iki kürreden herhangi birisinin ziyâını (sıkışmadan, meşakkatsiz, tam bir açıklıkla) gördüğünüz gibi, kıyâmet gününde Aziz ve Celîl olan Allah'ı, birbirinize meşakkat ve zahmet vermeden açıkça göreceksiniz\" buyurdu. şöyle devam etti: \"Kıyâmet günü olduğu zaman bir dellâl: Her ümmet neye ve kime tapıyor idiyse onun ardına düşer (yani düşsün) diye i'lân edecek. Bunun üzerine Allah'tan başka şeylere: Putlara, heykellere, dikili taşlara tapagelen ne kadar müşrik varsa, onlardan hiçbiri geri kalmaksızın cehennemin içine dökülecekler. Artık ortalıkta yalnız Allah 'a ibâdet eden gerek sâlih, gerek fâcir kimselerle (müşrik olmayan) kitâb ehli bakıyyelerinden başka kimse kalmayınca, Yahûdîler'den geri kalanlar çağırılacak ve onlara: Siz kime ibâdet ederdiniz? Diye sorulacak. Onlar: Biz Allah'ın oğlu Uzeyr'e ibâdet ederdik! Diye cevâb verecekler. üzerine onlara: Siz yalan söylüyorsunuz. Allah hiçbir eş ve oğul edinmedi! Denilecek. Şimdi siz ne istersiniz? Diye sorulacak. Onlar da: Ey Rabbimiz, çok susadık, bize su ihsan et! Diyecekler. Bunun üzerine onlara: Haydi, su başına gelmez misiniz? Diye işaret olunacak. onlar bir araya getirilip cehenneme doğru sevk olunacaklar. O cehennem ateşine ki, onların görüşünde yalımları birbirini kırıp geçiren serâb gibi görünecek ve onu su zannedip birbiri ardınca ateşin içine dökülecekler. Sonra Nasrânîler (in bir taifesi) çağrılacak. Onlara da: Siz kime tapardınız? Diye sorulacak. Onlar da: Biz Allah'ın oğlu Îsa'ya ibâdet ederdik, diyecekler. Onlara da: Siz yalan söylüyorsunuz. Allah hiçbir eş ve hiçbir oğul edinmiş değildir, denilecek ve: Ne istiyorsunuz? Diye sorulacak. da kendilerinden evvelki Yahûdîler'in su isteyip cehenneme sevkolunmaları gibi cehenneme sevkolunacaklar. meydanda sâlih veya fâsık olarak Allah'a ibâdet eden mü min muvahhidlerden başka kimse kalmayınca, Âlemlerin Rabbi onlara evvelden bildikleri en yakın bir sıfatta gelecek, yani tecellî edecek ve Allah tarafından bu muvahhidlere. Sizler ne bekliyorsunuz? (Görüyorsunuz) her ümmet ibâdet etmekte bulunduğu şeyin ardına düşüp gidiyor! buyurulacak. da: Ey Rabb'imiz, biz dünyâda iken(seni tanımayan, sana ibâdet etmeyen) şu insanlardan kendilerine en ziyâde muhtâc olmamıza rağmen ayrılıp ayrı yaşadık, Sen'in rızân için bunlarla arkadaşlık yapmadık. Biz şimdi kendisine kulluk edegeldiğimiz Rabb'imizi (O'nun kerem ve inayetini) bekliyoruz! Diyecekler. üzerine Yüce Allah onlara iki yahut üç kerre: Ben sizin Rabb'inizim! Buyuracak. da her seferinde: Biz Allah'a hiçbirşeyi ortak kılmayız! Diyecekler\" ümmetten birer şâhid, onların üzerine de seni bir şâhid olarak getirdiğimiz zaman nice olur?\"(Âyet: 41). ve \"el-Hattâl\" birdir. yüzleri silmemizden önce\", \"Onları enseleri gibi oluncaya kadar dümdüz yapmamızdan önce\" demektir. = Kitabı sildi)\", \"Onu mahvetti\" demektir. \"Saîran\", çok yanıcı ateş demektir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 103
			}
		}
	]
}