{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4583,
			"arabicnumber": 4583,
			"text": "Aişe r.anha'dan rivayet edildiğine göre, o şöyle demiştir: \"[Kendisinden ödünç alarak taktığım kız kardeşim] Esma'nın gerdanlığı kayboldu. Allah Resulü Sallallahu Aleyhi ve Sellem onu bulmak için birilerini gönderdi. Derken namaz vakti girdi. Ancak bu adamların abdesti yoktu, su da bulamamışlardı. Bu yüzden abdestsiz olarak namaz kıldılar. İşte bu olay üzerine Allah Teala teyemmüm ayetini indirdi. Fethu'l-Bari Açıklaması: İmam Buharıinin bab başlığında kullandığı \"Eğer hasta olur veya bir yolculukta bulunursanız yahut sizden biri tuvaletten gelirse ... \" ifadesi, hem el-Ma ide suresindeki ayette,(Maide 6) hem de Nisa suresindeki ayette geçmektedir. İmam Buharı, bu ifadeyi Nisa suresindeki ayetin tefsirinde kullanmak suretiyle, bu ayetin Hz. Aişe'nin olayı hakkında indiğine göndermede bulunmak istemiştir. Söz konusu olay, \"Teyemmüm Bölümü\"nde anlatılmıştı. .....Saıden, yeryüzünün yüzeyi anlamına gelir. Ebu Ubeyde .....feteyemmemu saıden tayyiben ayet i hakkında şu yorumu yapmıştı ....... Fteyemmemu \"yönelin\" anlamına, .....saıden ise \"yeryüzünün yüzeyi \"anlamına gelir.\" Zeccac da şöyle demiştir: .....Salden kelimesinin yeryüzünün yüzeyi anlamına geldiği konusunda dil alimleri arasında bir görüş ayrılığının bulunduğunu bilmiyorum. Yeryüzünün hem üzerinde toprak bulunan, hem de toprak bulunmayan yüzeyine /saıd denir.\" Nitekim şu ayetlerde bu manada kullanılmıştır: ...... (Şüphesiz Biz, yeryüzünde olanları kupkuru bir toprak haline getirebiliriz.),...... (Belki Rabbim bana, senin bağından 'daha iyisini verir; senin bağına ise gökten yıldırımlar gönderir de, bağ kupkuru bir toprak haline gelir). \"(Kehf 40) Yeryüzünün yüzeyi, yerden çıkılan son nokta olduğu için ......sald olarak isimlendirilmiştir. Ayrıca düz araziye de ..w....;,/sald denir. Doğrusu şu ki; ..w....;,/sald üzerinde ağaç, bitki ve bina bulunmayan dümdüz yeryüzü yüzeyi anlamı:ıa gelir. Teyemmüm alırken mutlaka toprağın kullanılmasını gerekli görenler /tayyib kelimesine dayanmışlardır. Çünkü bu kelime, bitki yetişmesine elverişli toprak anlamına gelir. Nitekim Allah Teala şöyle buyurmuştur:..... ........(lyi toprak Rabbinin izniyle bitki verir).(A'raf 58) Abdurrezzak ıbn Hemmam da ıbn Abbas'tan i .....es-saıdü't tayyıb tamlamasının \"ekin\" anlamına geldiğini nakletmiştir. Abd İbn Humeyd, İkrime'nin, ......el-cibt Habeşlilerin dilinde şeytan, .......et-tağut da kahin anlamına geli;' sözünü sahıh bir senetle ondan nak- letmiştir. İmam Taberı de Katade'den buna benzer bir rivayet aktarmıştır. Ancak bu rivayette Habeşistan ifadesi geçmemektedir., Söz konusu rivayet şu şekildedir: Biz, .....el-cibt kelimesinin \"şeytan,\" ......et-tağut kelimesinin de kahin anlamına geldiğini söylerdik. Ali İbn Talha kanalıyla İbn Abbas'tan şu yorum rivayet edilmiştir: .....el-Cibt Huyey İbn Ahtab, .....et-tagtlt da Ka'b İbn Eşref'tir. ' İmam Taberı, ......el-cibt ve ;tkıl/et-tağut kelimelerinin cins isim olduğunu ifade eden görüşü tercih etmiştir. Buna göre; Allah'ın dışında tapılan put, şeytan, cin, insan vs. her ne varsa hepsi bu kavramların kapsamına girer. Dola- . yısıyla büyücü ve kahin de bu kavramın içinde yer alır. Her şeyi en iyi Allah bilir. Kelime açıklamalarından sonra İmam Buharı, Hz. Aişe'nin gerdanlığının kayboluşu ve teyemmüm ayetinin inişi ile ilgili rivayetin bir bölümüne yer verdi. Bu hadisin şerhi ayrıntılı biçimde \"Teyemmüm Bölümü\"nde geçmişti",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 105
			}
		}
	]
}