{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4596,
			"arabicnumber": 4596,
			"text": "Muhammed İbn Abdirrahman Ebu'l-Esved'den rivayet edildiğine göre, o şöyle demiştir: Medine halkının bir ordu çıkarması kesinleşmişti. Ben de bu orduya yazılmıştım. Derken İbn Abbas'ın azatlı kölesi İkrime ile karşılaştım. Ona, orduya yazıldığımı haber verdim. İkrime benim orduya katılmarnı kesin bir dille yasakladı ve İbn Abbas'ın kendisine şöyle dediğini anlattı: Bazı Müslümanlar [imanlarını gizleyerek] müşriklerle birlikte [Mekke'de] kalmıştı. Hz. Nebi döneminde [yapılan Bedir savaşına katılarak] onların çok görünmesine neden olmuşlardı. Savaşta oklar atılıyordu. Bu okı ar müşriklerin içinde bulunan Müslümanlara isabet edip onları öldürüyordu. Bazen de onlar, savrulan kılıç darbeleriyle can veriyorlardı. Bunun üzerine Allah Teala şu ayeti indirdi: \"Kendilerine yazık eden kimselere melekler, canlarını alırken: 'Ne işde idiniz!' diye sordular. Bunlar: 'Biz yeryüzünde çaresizdik,' diye cevap verdiler. Melekler de: 'Allah'ın yeri geniş değil miydi? Hicret etseydiniz ya!' dediler.\" Fethu'l-Bari Açıklaması: Mekke'de kalıp Müslümanlığını gizleyenlerin isimleri Eş'as İbn Sewar'ın İkrime kanalıyla İbn Abbas'tan yaptığı rivayette belirtilmiştir. Buna göre şu kimseler Mekke'de kalıp Müslümanlıklarını gizlemişlerdi: Kays İbn Velid İbn Mughe, Ebu Kays İbnu'l-Fakih İbn İbnu'I-Muğıre, Velıd İbn Utbe İbn Rabıa, Amr İbn Ümeyye İbn Süfyan ve Ali İbn Ümeyye İbn Halef. Anlatıldığına göre bu insanlar, müşriklerle birlikte Bedir'e gelmişlerdi. Müslümanların az olduğunu görünce şüphelenip \"Bu insanları dinleri aldatmış,\" demişlerdi. Sonra Bedir'de öldürülmüşlerdi. Bu rivayeti İbn MerdCıye nakletmiştir. Bu rivayet ayetin sebeb-i nüzCılünü açıklamaktadır. Taberı ve İbn Münzir'de, Amr İbn Dinar'ın İkrime kanalıyla İbn Abbas'tan naklettiği bir rivayet şu şekildedir: Mekke halkından bir grup Müslüman olmuştu. Ancak imanlarını gizliyorlardı. Müşrikler Bedir savaşı için onları da getirmişlerdi. Bu kimselerden bazıları söz konusu savaşta öldürülmüş, bazıları da yaralanmıştı. Bunun üzerine Müslümanlar \"Onlar Müslümandı. Bizimle savaşmaları için onlara baskı yapılmıştı. Bu yüzden onların bağışlanmasını dileyin!\" demişlerdi. Bunun üzerine bu ayet nazil olmuştur. Daha sonra Müslümanlar, bu ayet ile birlikte bir mektup yazıp onlardan Mekke'de kalanlara göndermişlerdi. Ayrıca Mekke'de kalma konusunda bir mazeretierinin kalmadığını da bildirmişlerdi. Bunun üzerine Mekke'deki Müslümanlar Medıne'ye doğru yola çıkmıştı. Müşrikler yolda onlara yetişip baskı uygulamışlardı. Bu yüzden Müslümanlar geri dönmüşlerdi. Bunun üzerine de şu ayet nazil olmuştu: \"İnsanlardan kimi vardır ki: 'Allah'a inandık' der; fakat Allah uğrunda eziyete uğratıldığı zaman, insanların işkencesini Allah'ın azabı gibi tutar. Halbuki Rabbinden bir yardım gelecek olsa, mutlaka, 'Doğrusu biz de sizinle beraberdik' derler. İyi de, Allah, herkesin kalbindekileri en iyi bilen değil midir?\" Müslümanlar bu ayeti de yazıp Mekke'de kalanlara gönderdi. Onlar da yeniden Mekke'den Medıne'ye doğru yola çıktılar. Müşrikler yine onları yakaladı. Bazıları müşriklerden kurtulurken, bazıları da öldürüldü. Meleklerin bu insanlara \"Ne işte idiniz!\" şeklinde soru yöneltmeleri, onları azarlamak ve paylamak içindir. Saıd İbn Cübeyr bu ayetten, Allah'a isyan edilen bölgeden hicret etmenin :arz olduğu sonucunu çıkarmıştır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 118
			}
		}
	]
}