{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4607,
			"arabicnumber": 4607,
			"text": "Sufyân es-Sevrî, Kays ibn Müslim'den; o da Târik ibn Şihâb'dan(bu zât Peygamber'i görmüştür) olmak üzere şöyle tahdîs etmiştir: Yahûdîler, Omer ibnu'l-Hattâb'a: Sizler bir âyet okumaktasınız ki, eğer o âyet biz Yahûdîler'e inmiş olaydı, biz o âyeti, yani indiği günü muhakkak bir bayram edinirdik, dediler. üzerine Omer: Şübhesiz'ben o âyetin nerede indirildiğini, ne zaman indirildiğini ve Rasûlüllah’ın onun indirildiği zaman nerede bulunduğunu kesin olarak bilmekteyim: Bu âyet Arafe gününde ve bizler de Allah'a yemîn olsun Arafe'de (vakfede) bulunurken indirilmiştir, dedi. es-Sevrî: Ben Omer'in \"Cumua günü idi\" deyip demediğinde şübhe ediyorum, demiş(âyeti okumuştur): \"Bu gün sizin dîninizi kemâle erdirdim...\". Allah'ın Şu Kavli: bulamamışsanız, o vakit tertemiz bir toprakla teyemmüm edin., \"(Âyet: 6) \"Kasdediniz\"; \"Âmmîne\", \"Âmidîne\", yani \"Kasdediciler olarak\" demektir. \"Emmemtu\" ve \"Teyemmemtu\" bir ma'nâyadır. Abbâs: Dokundunuz)\", \"Temessûhunne( = Kadınlara dokunursunuz)\"; \"Vellâtî dahaltum bihinne (Kendilerine dâhil olduğunuz kadınlar)' (en-Nisâ: 23) ve \"el-İfdâ\"'(en-Nisâ: 21); bunların hepsi nikâh, yani cinsî münâsebet ma'nâsınadır, demiştir zevcesiÂişe(r. anha) şöyle demiştir: Bizler Rasûlüllah'in yaptığı seferlerin birinde O'nunla birlikte yola çıktık. Nihayet ya el-Beydâ'ya yahut Zâtu'l-Ceyş'e vardığımızda (yanımda ariyet olan) bir gerdanlığım koptu (kayboldu). Aransın diye Rasûlüllah o yerde bekledi. İnsanlar da O'nunla beraber beklediler. Halbuki bir su başında değillerdi, yanlarında da su yoktu, insanlar Ebû Bekr es-Sıddîk'a gelip: Âişe'nin yaptığını görmüyor musun? Rasûlüllah'ı da, insanları da yollarından alıkoydu. Su başında değiller, beraberlerinde de su yok, dediler. üzerine Ebû Bekr (benim yanıma) geldi. Rasûlüllah da başını benim dizimin üstüne koyup uyumuştu. Ebû Bekr bana: Sen Rasûlüllah'ı da, insanları da yollarından alıkoydun. Su başında değiller, beraberlerinde de su yok, dedi. dedi ki: Ebû Bekr beni azarladı ve Allah'ın söylemesini istediği sözleri söyledi. Eli ile de böğrüme vurmaya başladı. Beni kıpırdamaktan, Rasûlüllah'ın dizim üstünde bulunmasından başka hiçbirşey men' etmiyordu (yani başı dizimde olduğu için hiç kıpırdamadım). Sabah olunca Rasûlüllah kalktı, hiç su yoktu. Allah Teyemmüm Ayeti'ni indirdi (herkes teyemmüm etti). ibn Hudayr(radıyallahü anh): Ey Ebâ Bekr hanedanı! Bu sizin ilk bereketiniz değildir, dedi. dedi ki:(Sonra gideceğimiz sırada) üzerine bindiğim deveyi kaldırdık. Bir de gördük ki, gerdanlık onun altında imiş",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 129
			}
		}
	]
}