{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4610,
			"arabicnumber": 4610,
			"text": "Abdullah ibn Avn tahdîs edip şöyle demiştir: Bana Ebû Kılâbe'nin himayesinde bulunan Süleyman Ebû Recâ', Ebû Kılâbe'den tahdîs etti ki, Ebû Kılâbe, Omer ibnu'l-Abdilazîz'in sırtının arkasında oturuyordu. Huzuruna giren insanlar \"Kasâme\"yi zikrettiler. Omer, \"Kasâme\" hakkında istişare yapınca, ona \"Kasâme\"nin şânmı zikredip: Biz kasâme hususunda kısasa kaail oluruz, senden önceki halîfeler de kısasla, yani kaatilin öldürülmesiyle hükmetmişlerdir, dediler. üzerine Omer ibnu'l-Abdüazîz, sırtının arka tarafında bulunan Ebû Kılâbe'ye döndü de: Sen ne dersin yâ Abdallah ibne Zeyd, yahut da: Sen ne dersin yâ Ebâ Kılâbe? Diye sordu. İslâm'da evlendikten sonra zina etmiş yahut bir nefis mukaabilinde olmaksızın bir insan öldürmüş yahut da Allah'a ve Rasülü'ne harb açmış bir adamdan başka, hiçbir nefsin öldürülmesinin halâl olduğunu bilmiş değilim, dedim. üzerine Anbese ibnu Saîd: Bize Enes ibn Mâlik şöyle şöyle (yani Urenîler hadîsini) tahdîs etti, dedi. Kılâbe şöyle dedi: Ben dedim ki: Bana da Enes tahdîs edip şöyle dedi: Bir topluluk Peygamber'in huzuruna geldiler de(İslâm üzere bey'atlaştıktan sonra) kendisiyle kelâm edip konuştular. Akabinde: Bizler bu Medîne toprağını (yani havasını) ağır bulduk, dediler. de: \"Şunlar bize âid birtakım develerdir, (sadaka develeriyle beraber güdülmek için) çıkıyorlar, siz de bunlar içinde çıkın, bunların sütlerinden ve sidiklerinden için\" buyurdu. üzerine o kimseler, o deve sürüsü içinde çıkıp gittiler. Onların sidiklerinden ve sütlerinden içtiler ve eski sağlıklarına kavuştular. Çobanın üzerine hücum edip onu öldürdüler, develeri de sür'atle sürüp götürdüler. Artık bunlardan hangi şey geri bırakılır? Bunlar insan öldürdüler, Allah'a ve Rasûlü'ne harb açtılar ve Allah'ın Rasûlü'nü endişelendirdiler. Anbese, Ebû Kılâbe'den hayret ederek: Subhânallah, dedi. Kılâbe şöyle dedi: Ben de Anbese'ye: Sen benim Enes'ten rivayet ettiğim hadîs hususunda beni ittihâm mı ediyorsun? dedim. de: ittihâm etmiyorum, lâkin sen hadîsi gereği gibi getirdin.) Bize bunu Enes böyle tahdîs etti, dedi. Kılâbe şöyle dedi: Ve Anbese: Yâ buranın ehli (yani: Ey Şâm ehli)! Şübhesiz sizler, Allah içinizde bunu (yani Ebû Kılâbe'yi) ve bunun benzeri olanları bıraktığı müddetçe muhakak hayırla beraber olmakta devam edeceksiniz! Dedi. Allah'ın 'Bütün yaralar birbirine kısastır... (Âyet: 45) Kavli Bâbı",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 132
			}
		}
	]
}