{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4610,
			"arabicnumber": 4610,
			"text": "Ebu Kılabe'den rivayet edildiğine göre, o, Ömer İbn Abdilazız'in arkasında oturuyormuş. [Halife Ömer, kasame hakkında insanların gürüşlerini sormuş.] Onlar da görüşlerini bildirmişler. [Kasame hakkında] bildiklerini anlat\" . mışlar. \"[Kısas gereği öldürülmesine] hükmederiz. Önceki halifeler de [kısas olarak öldürülmesine] hükmetmişti,\" demişler. Bunun üzerine Ömer İbn Abdilaziz, arka tarafında oturan Ebu Kılabe'ye dönerek \"Ey Abdullah İbn Zeyd (veya Ey Ebu Kılabe) senin görüşün nedir?\" diye sormuş. [Ebu Kılabe olayın bundan sonraki kısmını şöyle anlatmıştır:] Ona şu şekilde cevap verdim: Muhsan olduktan sonra zina eden veya haksız yere adam öldüren ya da Allah ve O'nun Nebiine savaş açan kimselerden başkasının İslam'a göre öldürülmesinin helal olduğunu bilmiyorum. Bunun üzerine Anbese \"Bize Enes İbn Malik şunları şunları anlatmıştı,\" dedi. Ben de şu şekilde karşılık verdim: \"Enes, bu olayı bana da haber vermişti. O, söz konusu olayı şu şekilde aktarmıştı: Nebi (Sallallahu aleyhi ve Sellem)'e bir grup insan geldi ve onunla• konuştular. Ona; - Medıne'nin havası bize ağır geldi, dediler. Nebi Sallallahu Alyhi ve Sellem de onlara şöyle dedi: - İşte şunlar bizim develerimiz. Otlamak için meraya gidiyorlar. Siz de onlarla birlikte gidin. Onların sütlerinden ve idrarlarından için. Bu tavsiye üzerine insanlar, develerle birlikte meraya gittiler. Develerin sütlerinden ve idrarlarından içip iyileştiler. Çobanın üzerine yürüyüp onu öldürdüler. Develeri de önlerine katıp götürdüler. Artık onlara karşı yavaş davranılabilir mi? Cana kıymışlar, Allah'a ve O'nun elçisine savaş açmışlar ve Nebi'i sallallahu aleyhi ve sellem endişeye sevk etmişlerdi.\" Bu sözler karşısında Anbese; - Suphanallah! dedi. Ona; - Enes'ten aktardığı m rivayet konusunda beni itham mı ediyorsun? diye sordum. O da şöyle cevap verdi: - Yok hayır! Enes bize bu şekilde anlatmıştı. Sonra Anbese orada bulunan insanlara; - Ey bölge halkı! Aranızda bu adam ve buna benzeyen kimseler olduğu sürece daima hayır içinde olursunuz, dedi. Fethu'l-Bari Açıklaması: Allah'a karşı savaşmanın, O'nu inkar etmek ile tefsır edilmesi, Saıd İbn Cübeyr ile Hasan-ı Basrıiye aittir. İbn Ebı Hatim, bu yorumu senetli olarak onlardan aktarmıştır. Çoğunluk ise, buradaki savaşmayı, Müslüman veya kafir olsun insanların yolunu kesen kimse olarak tefsır etmiştir. Bu ayet in Uranılerden gelen grup hakkında indiği söylenmiştir. Bu konu daha önce geçmişti. İmam Buhari’nin bu başlık altında verdiği hadisin açıklaması \"Kitabu'ddiyet\"te yapılacaktır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 132
			}
		}
	]
}