{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4617,
			"arabicnumber": 4617,
			"text": "Abdullah ibn Mes'ûd (radıyallahü anh) şöyle demiştir: Biz Peygamber(sallallahü aleyhi ve sellem)'in beraberinde gazveye giderdik. Bizim yanımızda kadınlar bulunmazdı. (Cinsî münâsebete şiddetle ihtiyâç duyardık.) Bu durumda biz: Erkeklik yumurtalarımızı çıkartıp hadım olalım mı? Diye sorduk. bizi hadım olmaktan nehyetti. Bundan sonra bize (belli bir müddete kadar) elbise (ve benzeri bir ücret) mukaabilinde kadın eş almamıza ruhsat verdi. Kays ibn Ebî Hazım dedi ki:) Bundan sonra Abdullah ibn Mes'ûd şu âyeti okudu: \"Ey imân edenler, Allah'ın size halâl ettiği o en temiz şeyleri (nefsinize) haram kılmayın. Haddi aşmayın. Çünkü Allah haddi aşanları sevmez” Allah'ın Şu Kavli: îmân edenler, içki, kumar, dikili taşlar, fal okları ancak şeytânın amelinden birer murdardır. Onun için ı bunlardan kaçının ki, muradınıza eresiniz\"(Âyet: 90) İbn Abbâs: \"el-Ezlâm\", (Câhiliye Arabları'nın) ; mühim işlerde kendisiyle fal açıp kısmet istemekte oldukları yelesiz oklardır. \"en-Nusub\" ise müşriklerin ihtiram için diktikleri birtakım dikili taşlardır ki, yanlarında kurban keserler(kanları bu taşlara sürerlerdi), demiştir. Abbâs'tan başkası da: henüz yele geçirilmemiş oktur, bu \"el-Ezlâm\"ın tekilidir.(Yele geçirilirse ona \"Sehm\" denir.) \"el-İstiksâm\", fal oklarını falcının torba içinde döndürmesidir. Eğer ok(çekildiğinde, \"Rabb'im beni nehyetti\" çıkmak suretiyle) o işi nehyederse, kişi o işi terkeder;(\"Rabb'im bana emretti\" çıkmak suretiyle) o işi emrederse, okun emrettiği işi yapar. \"Yucîlu\", \"Döndürür\" demektir. O fâl oklarına, kısmetini istemekte oldukları çeşitli işlerin adlarını üzerlerine yazıp, birçok alâmetlerle alâmet ve nişan yaparlardı. (Kısmet isteme falı çektiğini haber vermek isteyen kişi) \"Faaltu minhu( = Ben bundan yaptım)\" yerine \"Kasemtu\" der. \"Kusûm\" da (üç harfli ve \"Kendisinden haber vermek\" demek olan) masdardır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 139
			}
		}
	]
}