{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4627,
			"arabicnumber": 4627,
			"text": "Salim İbn Abdillah babasından Nebi'in sallallahu aleyhi ve sellem şöyle buyurduğunu rivayet etmiştir: \"Gaybın anahtarları beştir. Kıyamet vakti hakkındaki bilgi ancak Allah'ın katındadır. Yağmuru O yağdırır, rahimlerde olanı O bilir. Hiç kimse yarın ne kazanacağını bilemez. Yine hiç kimse nerede öleceğini bilemez. Şüphesiz Allah, her şeyi bilendir, her şeyden haberdardır. \" (Lukman 34) Fethu'l-Bari Açıklaması: 2ıi;./Mefatih (anahtarlar) kelimesi, /miftah kelimesinin çoğulu olup ism-i alet veznindedir. Kendisi ile birşeyin açıldığı alet anlamına gelir. Vezin bakımından /mincel (tırpan) ve .....menacil'e benzer. Bu vezinde, ism-i alet olarak kullanılan çok az kelime vardır. Daha çok bu kelime ......miftah şeklinde kullanılır. Çoğulu da ......mefatih şeklinde gelir. Şaz kıraatte bu lafız ...... şeklinde okunmuştur. İbnu's-Sumeyfi' bu ayeti &ıi;......ve indehO mefatihu şeklinde okumuştur. ....Mefatih kelimesinin ism-i mekan olarak ...meftah kelimesinin çoğulu oıauğu da ileri sürülmüştür. İmam Taberi'nin SücIai'den naklettiği açıklama da bunu desteklemektedir. Nitekim o, ......ve indehu mefatihu ayetini, \"Gaybın hazineleri O'nun katındadır,\" şeklinde te(sir etmiştir. İmam Taberi, İbn Mes'ud'un şöyle dediğini nakletmiştir: \"Sizin Nebiinize gaybın anahtarları hariç her şey verilmiştir.\" ......Miftah (anahtar) kelimesi, kilit gibi somut olarak kapalı olan nesneleri açan alet için kullanıldığı gibi, soyut olarak kapalılıkları açanlar için de kullanılır. Nitekim bir hadisi şerifte 9öyle geçmektedir: ......İnsanların bir kısmı hayrın anahtarıdır. ıbn Hıbban, Enes'ten gelen bu hadisin sahih olduğunu belirtmiştir. İmam Buhari, bu başlık altında İbn Ömer'den nakledilen \"Gaybın anahtarları beştir ... \" hadisini muhtasar olarak zikretti. Bu rivayet i Lukman suresinin tefsirinde genişçe verecektir. Biz de bunun ayrıntılı açıklamasını orada yapacağız",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 149
			}
		}
	]
}