{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4648,
			"arabicnumber": 4648,
			"text": "Ziyadi'nin arkadaşı Abdulhamid İbn Kürdid'den, Enes İbn Malik'in şöyle söylediği rivayet edilmiştir: Ebu Cehil: \"Ey Allah'ım! Eğer bu kitap senin katından gelmiş bir gerçekse, üzerimize gökten taş yağdır, yahut bize elem verici bir azap getir!\" dedi. Bunun üzerine, \"Oysa sen aralarında bulundukça, Allah onları azaba çarptı rm az. Ayrıca bağışlanma dilerlerken de Allah onlara azab etmez. Allah ne diye onları cezalandırmasm ki, onlar kendileri Mescid-i Haram'r yönetmeye layık olmadıkları halde, üstelik orayı ziyaret etmek isteyen müminleri de geri çeviriyarlar? Oranın hizmet ve yönetimine asıl ehil olanlar, Allah'ı sayıp O'na şirk koşmaktan sakmanlardır. Fakat onların çoğu bunu bilmez, \"(Enfal 33-34) ayetleri nazil oldu. Fethu'l-Bari Açıklaması: Said İbn Abdirrahman Mahzumi'nin rivayet ettiğine göre, Süfyan İbn Uyeyne'nin tefsirinde, Kur'an'da geçen ....matar (yağmur) kelimesi, azab ile açıklanmıştır. Said İbn Abdirrahmaı; onun şöyle söylediğini nakletmiştir: \"Bazı insanlar, Allah Teala'nın Kur'an'da /matar (yağmur) kelimesi ile sadece azabı kastettiğini, Arapların ise yağmura gays dediklerini söylemiştir.\" İbn Uyeyne bu sözü ile Şura suresindeki ......Yunzilu'l-ğayse min ba'di ma kanatu (O, {insanlar} umutlarını kestikten sonra, yağmuru indirendir.)(Şura 28) ayetini kastetmiştir. İbn Uyeyne'nin bu sözü eleştirilmiştir. Çünkü .....matar kelimesi Kur'an-ı Kerim'de .....ğays yağmur anlamında kullanılmıştır. EĞER yağmurdan <:arar görecekseniz ya da hasta iseniz silahlarınızı yere bırakmanızm bir sakmcası yoktur. Bununla birlikte uyanık ve tedbirli olun. l-fiç şüphesiz Allah kafir/er için onur kıncı bir azap hazırlamrştır.(Nisa 102) Bu ayetteki ..... matar kelimesi ile kesinlikle yağmur kastedilmiştir. Yağmurun vereceği zarar ise elbise ve ayakların ıslanması vb. şeylerdir. Ebu Cehil: \"Ey Allah'ım! Eğer bu kitap senin katından gelmiş bir gerçekse, üzerimize gökten taş yağdır, yahut bize elem verici bir azap getiri\" dedi. Her ne kadar ayette çoğul kipi kullanılsa da, bu ifadeden söz konusu sözü söyleyenin Ebu Cehil olduğu anlaşılır. Belki bu sözü ilk olarak Ebu Cehil söylemiş, diğerleri de buna razı olmuştur. Bu yüzden bu söz, onlara nispet edilmiştir. İbn Cerır et-Taberı'nin, Yezid İbn Ruman kanalıyla aktardığı rivayete göre, Mekkeli müşrikler \"Ey Allah'ım! Eğer bu kitap senin katından gelmiş bir gerçekse, üzerimize gökten taş yağdır, yahut bize elem verici bir azap getir!\" demişler. Akşam olunca bu sözden pişman olmuşlar ve \"Allahım! Affına sığınırız ... \" diye bağışlanma dilemişler. Bunun üzerine Allah Teala, \"Bağışlanma dilerlerken de Allah onlara azab etmez,\" ayetini indirmiştir. İbn Ebı Hatim, Ali İbn Ebı Talha kanalı ile İbn Abbas'ın .....ve hum yesteğfirun ayetini, Allah'ın ezell ilmine göre iman edecekleri belli olan kimseler şeklinde açıkladığını nakletmiştir. Bu ifade ile o dönemde müşriklerin arasında bulunan mümin kulların kastedildiği de ileri sürülmüştür. Dahhak ile Ebu Malik bu görüştedir. Taberı'nin İbn Ebza'dan naklettiği şu rivayet de bunu desteklemektedir: Nebi Sallallahu Alyhi ve Sellem Mekke'de iken Allah Teala \"Sen aralarında bulundukça, Allah onları azaba çarptı rm az, \" ayetini; Medıne'ye hicret ettikten sonra ise \"Bağışlanma dilerlerken de Allah onlara azab etmez,\" ayetini indirdi. Çünkü Mekke'de kafirlerin arasında yaşayan ve bağışlanma dileyen müminler vardı. Bu müminler de Mekke'yi terk edip hicret edince Allah Teala, \"Allah ne diye onları cezalandırmasm ki, onlar kendileri Mescid-i Haram'ı yönetmeye layık olmadıkları halde, üstelik orayı ziyaret etmek isteyen müminleri de geri çeviriyoriar?\" ayetini indirdi. Böylece Mekke'nin fethine izin verdi. İşte bu fetih, müşrikler için Allah'ın önceden bildirdiği azabıdır. Tirmizı de, Ebu Musa Eş'arı'den Hz. Nebi'in \"Allah Teala ümmetime iki em an indi rm iştir, \" buyurduğunu, ardından bu ayeti okuduğunu ve şöyle söylediğini nakletmiştir: Ben aralarından ayrıldığım zaman, içlerinde 'bağışlanmayı' bıraktım.\" Bu hadis, ay,etin ilk yorumunu desteklemektedir. Ayeti bu şekilde anlamak daha uygundur. Çünkü müşrikler, yaptıklarından dolayı pişman olmayı bırakıp Müslümanlara karşı çıktıkları, onlarla mücadelede ileri gittikleri ve insanları Mescid-i Haram'dan alıkoydukları. zaman başlarına azab gelmişti",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 170
			}
		}
	]
}