{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4650,
			"arabicnumber": 4650,
			"text": "Bize Hayve ibn Şurayh, Bekr ibn Amr'dan; o da Bukeyr ibn Abdillah'tan; o da Nâfi'den şöyle tahdîs etti: Abdullah ibn Omer(radıyallahü anh) 'e bir adam geldi de: Yâ Ebâ Abdirrahmân! Allah'ın kendi Kitâb'ında zikrettiği şu âyeti işitmiyor musun:\"Eğer mü’minlerden iki zümre birbiriyle döğüşürlerse, aralarını bulup barıştırın. Eğer onlardan biri diğerine karşı hâlâ tecâvüz ediyorsa, siz o tecâvüz edenle, Allah 'ın emrine dönünceye kadar savaşın... \"(d-Hucurât:9) buyuruyor. Allah'ın kendi Kitâb'ında zikrettiği gibi, müslümânlar arasındaki harbe katılıp kıtal yapmandan seni nasıl bir düşünce men' etti? Diye sordu. Omer de: Ey kardeşim oğlu! Okuduğun bu âyeti delîl edinip harbetmektense Yüce Allah'ın, içinde büyük tehdîdler buyurmakta olduğu şu âyeti delîl getirip onunla amel etmem, bana daha sevimlidir: \"Kim bir mü'mini kasden öldürürse cezası, içinde ebedî kalıcı olmak üzere cehennemdir. Allah ona gazâb etmiştir, ona la'net etmiştir ve ona çok büyük bir azâb hazırlamıştır\"(en-Nisâ:92), dedi. Omer'in bu sözü üzerine o Haricî zât: Şübhesiz ki Allah: \"Bir fitne kalmayıncaya ve dîn tamâmıyle Allah'ın oluncaya kadar onlarla muharebe edin...\" buyuruyor, dedi Omer de: Biz Rasûlüllah zamanında müslümânlar henüz az iken o harbi müşriklere karşı yapmışızdır (yoksa müslümânlar birbirlerine karşı değil). O zaman kişi dîni hususunda fitneye, musîbete uğratılır, baskı yapılırdı: Müşrikler ya onu öldürürler yahut da onu sımsıkı bağlarlardı. Nihayet müslümânlar çoğaldı, artık hiçbir fitne kalmadı, dedi. Haricî genç, ibn Omer'in, onun istemekte olduğu kıtal hususunda kendisiyle uyuşmaz olduğunu görünce (konuyu değiştirip): \"Hatâ etti\" dedikleri) Alî ve Usmân hakkındaki görüşün nedir? dedi. Omer: Alî ve Usmân hakkındaki görüşüme gelince: Allah Usmân'ı affetmiştir. Fakat siz onu affetmeyi istemediniz. (Usmân Bedir'de bulunmadı, Uhud'dan kaçtı, Rıdvan Bey'atı'nda yoktu dersiniz. Bedir sırasında Peygamber'in kızı olan eşi hasta idi. Rasûlüllah ona izin verdi; Uhud'da ordunun bozulması sırasında Usmân da bir tarafa çekilmişti; Rıdvan Bey'atı'nda ise Rasûlüllah onu vazîfe ile Mekke'ye göndermişti.) Alî'ye gelince: O,Rasûlüllah'ın amcasının oğlu ve kızının kocasıdır -eliyle Fâtıma'nın mezarına işaret ederek:- ve işte şu, Peygamber'in kızıdır; yahut: O'nun kızı, görüp durduğunuz şu yerdedir, dedi",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 172
			}
		}
	]
}