{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4656,
			"arabicnumber": 4656,
			"text": "Ebu Hureyre'den şöyle söylediği rivayet edilmiştir: Hz. Ebu Bekir, Mina'da Kur'ban Bayramı'nın birinci günü \"Bu yıldan sonra herhangi bir müşrik hac yapamaz ve herhangi bir çıplak Ka'be'yi tavaf edemez!\" şeklinde insanlara. duyuru yapmak üzere gönderdiği tellallarla birlikte o hacda beni de gönderdi. Humeyd şöyle demiştir: Sonra Hz. Nebi [Hz. Ebu Bekir'in] peşinden Ali bin Ebı Tilib'i gönderdi ve ona \"Berae\" suresini insanlara duyurmasını em- Ebu Hureyre şöyle demiştir: Bizimle birlikte Hz. Ali de kurban bayramının birinci günü Mina'daki insanlara Berae suresini duyurdu ve \"Bu yıldan sonra herhangi bir müşrik hac yapamaz ve herhangi bir çıplak Ka'be'yi tavaf edemez!\" diye ilan etti. Fethu'l-Bari Açıklaması: Duyurmaktan maksat bildirmektir. Bu ifade, ....(Allah ve Resulünden insanlara bir bildiridir, )(Tevbe,3) ayetinden alınmıştır.' Hicretin. 9. yılında Hz. Ebu Bekir'in önderliğinde yapılan hacca katılan sahabllerden bir grubun ismini tespit ettim. Onlardan biri Sa 'd İbn Ebı Vakkas'tır. Taberi, Hakem ve Mus'ab İbn Sa'd kanalıyla Sa'd'ın şöyle dediğini rivayet etmiştir: Nebi Sallallahu Alyhi ve Sellem Ebu Bekir'i gönderdi. Dacnan'a vardığımız zaman Hz. Ali'yi onun peşinden gönderdi.\" Bir diğer sahabı de Cabir'dir. Taberi, _-\\bdullah İbn Huseym ve Ebu'z-Zübeyr kanalıyla Cabir'in şöyle dediğini rivayet etmiştir: \"Nebi Sallallahu Alyhi ve Sellem Ebu Bekir'i hacca gönderdi. Biz de onun,a birlikte yola çıktık.\" Saıd İbn Mansur, Tirmizı, Nesaı ve Taberi, Ebu İshak kanalıyla Zeyd İbn Yusey'in şöyle dediğini nakletmişlerdir: Hz. A1i'ye; \"Ne ile gönderildin 7\" diye sordum. O da şöyle cevap verdi: \"[Şunları duyurmak üzere gönderildim:] 1- Cennete ancak mümin kişi girer. 2- Ka'be'yi çıplak hiç kimse tavaf edemez. 3- Bu yıldan sonra Müslümanlarla müşrikler birlikte hac yapamayacak. 4- Müslümanlarla antlaşması bulunan kimselerin antlaşmaları süresi doluncaya kadar devam edecek. 5- Müslümanlarla antlaşması olmayanlara ise dört ay süre tanınmıştır.\" Hz. A1i'nin son sözü, \"(Ey müşrikler!) Yeryüzünde dört ay daha dolaşın, \"(Tevbe 2) ayetinin, bir süre ile belirlenmiş antlaşması bulunmayan veya hiçbir suretle antlaşması olmayan kimselere özelolduğuna delil olarak getirilmiştir. Belirli bir süreye kadar antlaşması bulunan kimselere ise, söz konusu süre doluncaya kadar mühlet verilmiştir. İmam Taberı, İbn İshak'ın şöyle söylediğini nakletmiştir: \"Allah ve Nebi'in ihtarda bulunduğu müşrikler iki gruptu. Bir grubun antlaşması dört aydan daha az bir surede doluyordu. Onlara dört aya kadar süre tanınmıştı. Diğer grubun ise antlaşmasının süresi yoktu. Onların antlaşmaları da dört ay ile sınırlandırılmıştı. \"Bu yıldan sonra herhangi bir müşrik haccedemez,\" ifadesi, \"Bu yıllardan sonra Mescidi Haramla yaklaşmasınlar, \"(Tevbe 28) ayetinden çıkarılmıştır. Bu ayet, hac gayesiyle de olsa, müşriklerin Mescid-i Haram'a girmesini açıkça yasaklamıştır. Çünkü hac büyük bjr gaye olduğu için, Hz. Ali müşriklere hac yapamayacaklarını açıkça belirtmiştir. Hac yapamadıklarına göre, başka bir gaye ile Mescid-i Haram'a hiç giremezler. Mescid-i Haram'dan maksat da Harem bölgesinin tamamıdır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 178
			}
		}
	]
}