{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4679,
			"arabicnumber": 4679,
			"text": "Vahiy katiplerinden Zeyd İbn Sabit'in şöyle söylediği rivayet edilmiştir: \"Ebu Bekir Yemame'de kurraların öldürülmesinin ardından bana haber yollayıp (beni çağırdı). Yanına vardığım zaman, Ömer'in orada olduğunu fark ettim. Ebu Bekir dedi ki: Ömer bana gelip 'Yername Savaşı'nda Kur'an okuyan pek çok kimse şehid oldu. Ben diğer savaşlarda da, kurraların öldürülmesinden ve Kur'an'ın bir çok kısmının kaybolmasından endişe ediyorum. Bu yüzden Kur'an'ın toplanmasını emretmen gerektiğini düşünüyorum' dedi. Ona 'Nebi'in yapmadığı bir şeyi nasıl yaparız?' diye itiraz ettim. Ömer, 'Allah'a andolsun ki, bu hayırlı bir iştir,' dedi. Israrla benden böyle bir şey yapmamı istedi. Nihayet Allah Teala aklıma bu işi yatırdı. Ben de Ömer gibi düşünür oldum.\" Zeyd olayı anlatmaya şöyle devam etti: \"Ömer'in yanında oturduğu bir sırada Ebu Bekir bana 'sen genç ve akıllı birisin. Hiç seni ith am etmedik. Nebi için vahyi yazıyordun. O halde, Kur'an'ı araştırıp topla!' dedi. Allah'a and olsun ki, beni dağlardan birini taşımakla sorumlu tutsaydı, bu görev, bana emrettiği Kur'an'ı toplama görevinden daha ağır gelmezdi. Ebu Bekir'e 'Allah Resulü'nün yapmadığı bir şeyi sizler nasıl yaparsınız?' diyerek itiraz ettim. O da 'Allah'a and olsun ki, bu hayırlı bir iştir' dedi. Ebu Bekir'e itirazlarımı sürdürdüm. Nihayet, Allah Teala, Ebu Bekir ve Ömer'in aklına yatanı, benim de aklıma yatırdı. Sonunda Kur'an'ı bir araya getirmek için, hurma dallarından, yassı taşlardan ve insanların hafızalarından Kur'an'ı araştırdım. \"Andolsun size kendinizden öyle bir Nebi gelmiştir ki, sizin sıkıntıya düşmeniz ona çok ağır gelir, \" ayetinden itibaren Tevbe suresinin sonuna kadar olan kısmı sadece Ebu Huzeyme Ensari'nin yanında buldum. Onun dışında başka birinde bulamadım. Topladığım sahifeler, vefat edinceye kadar Ebu Bekir'in yanında kaldı. Sonra hayatı boyunca Ömer'de kaldı. Daha sonra ise kızı Hafsa'ya geçti.\" Bu rivayetin geniş biçimde açıklaması \"Kitabu fedailu'l-Kur'an\"da yapılacaktır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 201
			}
		}
	]
}