{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4684,
			"arabicnumber": 4684,
			"text": "Bize Ebu'z-Zinâd, el-A'rec'den; o da Ebû Hureyre(radıyallahü anh)'den tahdîs etti ki, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle demiştir: \"Azîz ve Celîl olan Allah: Ey kulum, sen fakirlere nafaka ver ki, ben de sana nafaka vereyim, buyurdu\". devamla dedi ki: \"Allah'ın eli (yani vermekte tükenmeyen hazîneleri) doludur. Harcamak onu eksiltmez, o gece ve gündüz dâima akar\". Rasûlüllah devamla dedi ki:''Allah'ın göğü ve yeri yarattığı günden beri infâk ve in'âm ettiği ni'metlerin mâhiyetini düşündünüz mü? (Bundan bana haber verebilir misiniz?) Şübhesiz ki O'nun elindeki (kerem ve ihsânındaki) ni'metlerden hiçbir şey eksilmemiştir. Çünkü O'nun Arş'ı (tahtı) su üzerindedir (hudûdsuz ni'met denizi üzerinde kurulmuştur). Ve adalet terazisi O'nun elindedir, terazinin gözü (bazen) alçalır, (bazen yukarı) yükselir (bu suretle insanların kimine çok, kimine az rızık verir)\" Seni çarpmış)\", \"Aravtu( = Onu çarptım)\" ma'nâsından İftiâl masdarından iftealtu veznindedir. Ve \"Fulânun ya'rûhu ( = Fulân ona çarpıyor)\" ve \"I’terânî ( = Beni kaplıyor)\" sözleri bu asıldandır. \"Biz: Tanrılarımızdan kimi seni fena çarpmış demekten başka bir söz söylemeyiz”(Âyet: 54). hiçbir mahlûk hâriç olmamak üzere hepsinin alnından tutan odur\"(Âyet: 56), yani hepsi O'nun mülkünde, idaresinde ve tasarrufundadır. \"Anîd\", \"Anûd\", \"Ânid\"; hepsi bir ma'nâya olup \"Çok inadçı\" demektir; bu, tecebbürün, zorbalığın te'kîdidir. 'merakum'”; Allah sizi topraktan meydana getirdi ve sizi orada ömür geçiriciler -yahut da: îmâr ediciler- yaptı\" (Âyet: 60). \"A’martuhu'd-dâra fehye umra\" denilir ki, \"Ben evi ömrü müddetince ona mülk yaptım\" demektir. \"Nekirahum\", \"Enkerahum\", \"Istenkerahum\"; bunların hepsi bir ma'nâya olup \"Onlardan hoşlanmadı. (Âyet: 70) demektir. hamîdun mecîdun”(Şübheyok ki, O, asıl hamde lâyık, hayrı, ihsanı çok olandır) (Âyet: 73), yani \"Mecid\", \"Mâcid\" sığasından Fail veznidir. \"Hamîd\"de \"Hamide (Hamdetti)\" fiilinden olup \"Mahmûd\", yani \"Hamdedilmiş\" ma'nâsınadır. balçıktan pişirilmiş sert ve büyük taşlar; \"Emrimiz geldiği zaman o memleketin üstünü altına getirdik ve tepelerine balçıktan pişirilmiş, istif edilmiş taşlar yağdırdık\" (Âyet: 83). \"Siccîl\" ve \"Siccîn\" bir ma'nâyadır, bunlardaki lâm ile nûn, zâid harflerden olmaları ve herbiri diğerine çevrilebilmeleri bakımından iki kardeştirler. (Câhiliyet ve İslâm devirlerine erişmiş muhadram) Şâir Temîm ibnu Mukbil de buna şâhid olacak şu beyti söyledi: yaya askerler kuşluk vaktinde miğferlerin yerlerine, yani başlara öyle şiddetli darbe indiriyorlar ki, battallar, yiğitler bunu birbirlerine emir ve tavsiye ediyorlar\"; burada \"Siccînen\", \"Şedîden\" demektir. ilâ Medyene ahâhum Şuayben (Medyen’e de kardeşleri Şuayb'ı gönderdik) (Âyet: 84) Medyene\", \"Medyen ahâlîsine\" demektir. Çünkü Medyen, Medyen'in kurduğu ve onun ismiyle isimlendirilmiş bir beldedir. Bu ta'bîrin benzeri \"Ve's'eli'l-karyete\", \"Ve's'eli'l-ıyra\" sözleridir ki, \"Karye ahâlîsine\" ve \"Kervan halkına sor\" demektir (Yûsuf: 82); \"İçinde bulunduğumuz şehre, aralarında geldiğimiz kervana da sor. Biz şekksiz şübhesiz doğru söyleyicileriz''(Yûsuf: 82): Allah hn emrini arkanıza atılmış birşey kıldınız\"(Âyet: 92). Şuayb, bununla \"Siz O'na yönelmediniz\" demektir. Bir adam diğer birinin hacetini yerine getirmediği zaman \"Benim hacetimi sırtının ardına attın ve beni arkaya atılmış birşey kıldın\" denilir. Buradaki \"ez-Zıhrî\"nin bir ma'nâsı da: \"Beraberinde ihtiyâç zamanında kendisiyle yardım sağlayacağın bir binek hayvanı yahut bir kap alman\" demektir. \"Erâzilunâ\", \"Düşüklerimiz, en aşağı tabakalarımız\" demektir (Âyet: 27). (Kur'ân'ı) kendiliğinden uydurdu, derler. De ki: Eğer ben O'nu kendiliğimden uydurduysam günâhı benim üstüme olsun...\"(Âyet: 35). Buradaki \"İcramı\" kelime'si \"Ecremtu\" fiilinden masdardır. Bâzıları sülâsî olan \"Ceremtu\" fiilinden isimdir dediler, ikisi de \"Ben günâh işledim\" ma'nâsınadır. \"el-Fulk\", \"el-Felek\", \"Fuluk\" bir ma'nâyadir. Tekil ve çoğul yerinde kullanılır. Tekil yerinde \"Sefîne\", çoğul yerinde \"Süfün\", yani \"Gemi\" ve \"Gemiler\" ma'nâsınadır (Âyet: 38). mecrâha ve mursâha - Onun akması da durması da Allah'ın adıyledir\" (Âyet: 41). \"Mecrâha\", \"Onun gitmesi\" demektir. Bu \"Cereytu\" fiilinin mimli masdarıdır. \"Mursâha\" da \"Onun durması\" demektir, bu da \"Habsettim\" ma'nâsma olan \"Erseytu\" fiilinin mîmli masdarıdır. Bu \"Durdu\" ma'nâsma olan \"Reset\", sülâsî fiilinden \"Mersâhâ\", \"Aktı\" ma'nâsma olan \"Ceret\" sülâsî fiilinden \"Mecrâha\" şeklinde okunur. Ve yine bu iki kelime fail isim vezninde \"Mucrîhâ\" ve \"Mursîhâ\" olarak da okundu ki, onun akıtıcısı ve durdurucusu, gemiyi yapan yahut yapılmasını emreden Allah tarafındandır, demek olur. \"Kudurin râsiyetin\", \"Sabit sabit kazanlar\" (es-Sebe1: 13) demektir. Bunu \"Mursâha\" nın zikrine istidrâd olarak getirdi. Allah'ın Şu Kavli: \" (Allah'a karşı yalan düzenden daha zâlim kimdir?) Onlar Rabb’lerine arzedilecekler, şâhidler de: 'İşte bunlar Rabb'lerine karşı yalan söyleyenlerdir' diyecekler. Haberiniz olsun ki, Allah'ın la'neti zâlimlerin tepesinedir\" (Âyet: 18) \"Ashâb\"ın tekili olduğu gibi, \"Eşhâd\"ın tekili de \"Şâhid\"dir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 206
			}
		}
	]
}