{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4685,
			"arabicnumber": 4685,
			"text": "Bize Saîd ibnu Ebî Arûbe ile Hişâm ibn Ebî Abdillah tahdîs edip şöyle dediler: Bize Katâde tahdîs etti ki, Safvân ibnu Muhriz şöyle demiştir: Abdullah ibnu Omer, Ka'be'de tavaf ettiği sırada bir adam karşısına geldi ve: Ebâ Abdirrahmân -yahut da: Ey Omer'in oğlu!- Sen Peygamber'den (kıyâmet gününde mü'min ile Allah arasında olacak) \"Necvâ (-Gizli konuşma)\" hakkındaki beyânı işittin mi? diye sordu. Omer de şöyle dedi: Ben Peygamber'den işittim, şöyle buyuruyordu: \"Mü'min Rabb'ine yaklaştırılır -Râvî Hişâm: \"Mü'min Rabb'ine yakınlaşır” demiştir-. Nihayet Rabb 'i onun üzerine şefkat yanını kor da ona günâhlarını şöyle ikrar ettirir: Şu günâhı biliyor musun? Der. Kul: Biliyorum, der: Akabinde iki kerre: Rabb'im, biliyorum, Rabb'im biliyorum, der. Allah da: Ben o günâhlarını dünyâda (insanlardan) gizledim. Bu gün de ben senin lehine bu günâhlarını mağfiret ediyorum, buyurur. Sonra mü'minin hasenat sahîfesi kendisine verilir. Diğerlerine yahut kâfirlere gelince, onlar şâhidlerin huzurunda: îşte bunlar Rabb'lerine karşı yalan söyleyenlerdir! Diye nida olunur.\" ibn Abdirrahmân, Katâde'den: Bize Safvân, İbn Omer'den tahdîs etti, şeklinde söyledi. Allah'ın Şu Kavli: yakalayışı -ahâlîsi zulmeder hâlde bulunan memleketleri yakaladığı zaman- işte böyle olur. Şüphesiz ki, O'nun çarpması pek elemlidir, pek çetindir\"(Âyet: 102). 98) \"Yardım edici yardım\". \"Ona yardım ettim\" demektir. \"Lâ terkenû ile'llezîne zalemû = Zulmedenlere meyletmeyin'' (Âyet: 113). kâne\",(Âyet: 116). \"Fe-hellâ kâne\"(yani \"Olsaydı ya\") demektir. edildiler)\" (Âyet: 116), -yânı teref, helak edilmelerine sebeb oldu-. Abbâs: \"Zefir\", \"Şiddetli ses\"; \"Şehîk\", \"Zaîf ses\"tir(Âyet: 106) demiştir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 207
			}
		}
	]
}