{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4701,
			"arabicnumber": 4701,
			"text": "Bize Alî ibnu Abdillah el-Medînî tahdîs etti. Bize Sufyân ibn Uyeyne, Amr ibn Dinar'dan; o da İkrime'den; o da Ebû Hureyre (radıyallahü anh)'den tahdîs etti. Ebû Hureyre bunu Peygamber'e eriştirir Peygamber (sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah gökyüzündeki meleklere bir işin yerine getirilmesini hükmettiği zaman, düz ve sert bir taş üzerindeki zincir (sesi) gibi olan bu ilâhî hükme melekler tamâmiyle itaat ederek korku ile kanatlarını birbirine vururlar.\" ibnu'l-Medînî şöyle dedi: Sufyân ibn Uyeyne'den başkası bu \"Safvân\" kelimesini \"Safavân\" şeklinde söyledi. bu korku giderilince de melekler (Cebrâîl ve Mîkâîl gibi Mukarrebûn meleklerine): Rabb'iniz ne söyledi? Diye sorarlar. Mukarrebûn melekleri, sorana: Allah hakk sözü söyledi, diye Allah'ın hüküm ve takdirini bildirirler ve: Allah pek yücedir, pek büyüktür! Derler. suretle kulak hırsızı şeytânlar, Allah'ın o emir ve takdirini işitirler. O sırada kulak hırsızı şeytânlar (yerden göğe kadar) birbirinin üstünde zincirleme dizilmiş (ve kulak hırsızlığına hazırlanmış) bulunurlar.\" ibn Uyeyne, dinleyici şeytânların birbirleri üstünde dizilişlerini eliyle şöyle vasıfladı: Sağ elinin parmakları arasını araladı da onların bir kısmını diğerleri üzerine dikti:- bu vaziyette iken bâzı defa meleklerin konuşmalarını işiten en üstteki şeytâna bir ateş parçası yetişir de, altındaki şeytâna o haberi işittirmeden önce, onu yakar. Bâzı defa da ateş ona erişemeyip alt tarafında bulunan şeytâna haberi atıp yetiştirir. O da haberi kendisinden sonra bulunan daha aşağıdaki şeytâna atar ve bu suretle haber tâ yere kadar ulaşır.\" ibn Uyeyne bazen şöyle demiştir: \"Nihayet o haber yere ulaşır ve sihirbazın ağzına atılır. Sihirbaz o haberle beraber yüz yalan uydurup halka söyler. İlâhî emir yeryüzünde gerçekleşince de sihirbaz kişi doğru söylemiş olur. Ve ondan bu haberi işitenler, insanlara: Sihirbaz bize, fulân ve fulan günleri şöyle şöyle olacak diye haber vermedi mi? Gördünüz sihirbazın haber verdiklerini doğru bulduk, derler; bu da sihirbazın gökyüzünden işitildi dediği o sözden dolayı yapılan bir tasdiktir. Artık onun verdiği haberlerin hepsini doğru saymışlardır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 223
			}
		}
	]
}