{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4704,
			"arabicnumber": 4704,
			"text": "Ebu Hureyre'den Nebi Sallallahu Aleyhi ve Sellem'in şöyle söylediği rivayet edilmiştir: Ümmü'l-Kur'an, tekrarlanan yedi ve Yüce Kur'an'dır. Fethu'l-Bari Açıklaması: İmam Buhari bu başlık altında Fatiha hakkında Ebu Saıd İbnu'I-MuaIla'dan nakledilen hadisi verdi. Bu hadisin açıklaması daha önce Kitabu't-tefsır'in başlarında yapılmıştı. Bu rivayetin akabinde de Ebu Hureyre'den aktarılan hadisi verdi. Tirmizı'nin bu kanaldan naklettiği rivayette ise şu şekilde geçmektedir: \"elHamdülilldh, Ümmü'l-Kur'dn, Ümmü'l-Kitdb ve tekrarlanan yedidir.\" Taberi başka bir senedIe, Saıd Makburl vasıtasıyla Ebu Hureyre'den Hz. Nebi'in şöyle buyurduğunu rivayet etmiştir: Kur'an okunmayan her rekat eksiğe benzer. Said Makburı şöyle demiştir: Ebu Hureyre'ye \"Fatihadan başka bir sure bilmiyorsam ne olacak?\" diye sordum. ° da şöyle cevap verdi: Fatiha sana yeter. O, Ümmü'l-kitab'dır. O, Ümmü'l-Kur'an'dır. Hattabı şöyle demiştir: Bu rivayette, \"Fatiha için 'Ümmü'l-Kur'an' denemez. Ona ancak 'Fatihatu'l-kitab' denir. Ümmü'l-Kur'an ise Levh-i mahfı1z'duf,\" diyen İbn Sırın'e bir red söz konusudur. Bir şeyin anası, o şeyin aslıdır. Fatiha'ya Ümmü'l-Kur'an (Kur'arı'ın anası) denmiştir. Çünkü o, Kur'an'ın ashdır.\" Bazıları Fatiha suresinin Kur'an'ın başında bulunduğu için ona bu adın verildiğini ileri sürmüştür. Taberı iki sağlam senetIe Hz. Ömer ve Hz. Ali'nin şöyle söylediklerini nakletmiştir: Tekrarlanan yedi, Fatihatu 'l-Kitab 'dır. Ayrıca Hz. Ömer'den şu ziyadeyi de aktarmıştır: \"0, her re katta tekrarlanır.\" Yine Taberi hasen bir senetle İbn Abbas'ın Fatiha suresini okuduğunu, ardından \"Anda/sun ki, biz sana tekrar/anan yedi dyeti ve yüce Kur'an'! verdik, \"598 ayetini okuyup şöyle dediğini nakletli: \"Tekrarlanan yedi, Fatihatu'l-Kitab'dır. Bismillahirrahmanirrahim onun yedinci ayetidir.\" İmam Taberi bir grup tabiunun da şöyle söylediğini nakletmiştir: \"Tekrarlanan yedi, Fatihatu'l-kitab\"dır. Yine İmam Taberi, Ebu Ca'fer er-Razi ve Rabi' İbn Enes kanalıyla Ebu'lNiye'nin şöyle söylediğini aktarmıştır: \"Tekrarlanan yedi, Fatihatu'l-kitab'dır. Ebu Ca'fer şöyle demiştir: Rabi'a \"tekrarlanan yedinin seb'u't-tıval olduğunu söylüyorlar,\" dedim. O da şöyle dedi: Bu ayet indiği zaman seb'u't-tıval'den hiçbir sure inmemişti. Bu rivayetle işaret edilen bu görüş, seb'u't-tıval hakkında ileri sürülen meşhur bir görüştür. Nesai, Taberi ve Hakim sağlam bir senetle bunu İbn Abbas'tan rivayet etmişlerdir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 226
			}
		}
	]
}