{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4712,
			"arabicnumber": 4712,
			"text": "Ebu Hureyre'den rivayet edildiğine göre, Hz. Peygarnber'e et getirildi. Bir but ona sunuldu. Allah Resulü Sallallahu Aleyhi ve Sellem etin bu kısmını çok severdi. Sonra Hz. Nebi eti bir kez ısırdl. Ardından şöyle buyurdu: Ben, kıyamet günü insanların efendisi olacağım. Peki bunun sebebini biliyor musunuz? Kıyamet günü Allah Teala bir düzlükte ilk ve son insanları bir araya getirir. Bir tellal sesini herkese işittirecek. Herkes göz önünde olacak. Güneş de yaklaşacak. İnsanlar güç yetiremeyecekleri ve kaldıramayacakları üzüntü ve kedere boğulacaklar. Birbirlerine: \"Geldiğiniz şu duruma bir bakın! Rabbinize karşı size şefaat edecek birine baksanıza!\" diyecekler. Bunun üzerine bazı insanlar diğerlerine; \"Hz. Adem'i bulmalısınız\" derler, Bundan dolayı insanlar Hz. Adem'e gidip; \"Sen, insanların atasısın. Allah Teala seni kendi eliyle yarattı, sana ruhundan üfledi ve meleklerin sana secde etmesini emretti. Bu yüzden melekler sana secde etti. [Şimdi] bize Rabbinin huzurunda şefaat et! İçinde bulunduğumuz hali görmüyor musun? Ne hale düştük bir bakmıyor musun?\" derler. O da \"Kuşkusuz Rabbim bugün, daha önce hiç olmadığı kadar çok kızdı. Bundan sonra da bu şekilde bir daha asla kızmayacaktır. O, bana bir ağaca yaklaşmayı yasaklamıştı. Ben de ona isyan etmiştim. [Hal böyleyken nasıl şefaat edebilirim ki! Aslında] Şefaate benim nefsim muhtaç ... Şefaate benim nefsim muhtaç ... Şefaate benim nefsim ... Siz başkasına gidin! Nuh'a gidin!\" şeklinde cevap verir. Bunun üzerine insanlar Nuh Nebie gidip; \"Ey Nuh! Kuşkusuz sen yeryüzüne gönderilmiş ilk Resul! elçisin. Allah Teala sana 'çok şükreden kul' adını verdi. Şimdi bize Rabbinin huzurunda şefaat et! Bak ne hallere düştük,\" diyecekler. O da; \"Kuşkusuz Rabbim bugün, daha önce hiç olmadığı kadar çok kızdı. Bundan sonra da bu şekilde bir daha asla kızmayacaktır. Benim gerçekleşmesi kesin olan bir dua hakkım vardı. Onu da halkıma beddua ederek kullandım ... [Hal böyleyken nasıl şefaat edebilirim ki! Aslında] Şefaate benim nefsim muhtaç ... Şefaate benim nefsim muhtaç ... Siz başkasına gidin! İbrahim'e gidin,\" diye karşılık verecektir. Bunun üzerine insanlar İbrahim Nebie gidip; \"Ey İbrahim! Sen Allah'ın Nebii ve yeryüzünde yaşayan insanlar içerisinde O'nun halilisin. Şimdi bize Rabbinin huzurunda şefaat et! Bak ne hallere düştük,\" diyecekler. O da, \"Kuşkusuz Rabbim bugün, daha önce hiç olmadığı kadar çok kızdı. Bundan sonra da bu şekilde bir daha asla kızmayacaktır. Ben daha önce üç kez yalan söylemiştim. (Ravi Ebu Hayyan hadiste bunları anlatmıştır.) [Hal böyleyken nasıl şefaat edebilirim ki! Aslında] Şefaate benim nefsim muhtaç ... Şefaate benim nefsim muhtaç ... Siz başkasına gidip! Musa'ya gidin!\" diye karşılık verecektir. Bunun üzerine insanlar, Musa Nebie gelip; \"Ey Musa! Sen Allah'ın elçisisin! Allah Teala risaleti ve konuşması ile seni diğer insanlardan üstün kılmıştır. Şimdi bize Rabbinin huzurunda şefaat et! Bak ne hallere düştük,\" diyecekler. O da; \"Kuşkusuz Rabbim bugün, daha önce hiç olmadığı kadar çok kızdı. Bundan sonra da bu şekilde bir daha aslakızmayacaktır. Ben bir adamı öldürdüm. Halbuki onu öldürmem bana emredilmemişti. [Hal böyleyken nasıl şefaat edebilirim ki! Aslında] Şefaate benim nefsim muhtaç ... Şefaate benim nefs im muhtaç ... Siz başkasına gidin! Meryem'in oğlu İsa Nebie gidin,\" diye karşılık verecektir. Bunun üzerine insanlar, İsa Nebie gidip; \"Ey İsa! Sen Allah'ın elçisi, Meryem'e ilka ettiği kelimesi ve O'ndan gelen bir ruhsun. Daha beşikteki bir bebekken insanlarla konuştun. Şimdi bize Rabbinin huzurunda şefaat et! Bak ne hallere düştük,\" diyecekler. O da; \"Kuşkusuz Rabbim bugün, daha önce hıç olmadığı kadar çok kızdı. Bundan sonra da bu şekilde bir daha asla kızmayacaktır,\" diyecek ve herhangi bir günahtan söz etmeden şunları ekleyecektir: \"Şefaate benim nefsim muhtaç ... Şefaate benim nefsim muhtaç ... Siz başkasına gidin! Muhammed'e gidin!\" Bunun üzerine insanlar, Muhammed'e gidip; \"Ey Muhammed! Sen Allah'ın elçisi ve Nebilerin sonuncususun. Hak TeaıCı senin gelmiş geçmiş bütün günahlarını bağışladı. Şimdi bize Rabbinin huzurunda şefaat et! Bak ne hallere düştük,\" diyecekler. Bunun üzerine gidip Arş'ın altına varacağım. Orada hemen Yüce Rabbim için secdeye kapanacağım. Sonra Allah Teala benden önce hiç kimseye nasip etmediği güzel sena ve hamdi bana ilham edecek. Ardından bana şöyle denilecek: \"Ey Muhammed! Başını kaldır! Dile! Ne dilersen sana verilecek. Şefaat et! Şefaatin kabul edilecek.\" Bunun üzerine başımı secden kaldırıp; \"Ey Rabbim! Ümmetim ... Ey Rabbim! Ümmetim ... Ey Rabbim! Ümmetim ... \" diye yalvaracağım. O vakit şöyle denecek: \"Ey Muhammed! Ümmetinden hesabı olmayan kullarını Cennetin sağ kapısından içeri sak! Ayrıca onlar, Cennetin diğer kapılarından girme konusunda diğer insanlarla aynı hakka sahiptirler.\" Sonra Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Canımı elinde bulunduran Allah'a yemin ederim ki; Cennet kapılarının iki kanadının arası, Mekke ile Hımyer veya Mekke ile Busra arasındaki mesafe kadardır.\" Fethu'l-Bari Açıklaması: İmam Buhari bu başlık altında Ebu Hureyre'den Ebu Zur'a İbn Amrkanalıyla şefaat konusunda nakledilen hadisi verdi. Bu hadisin açıklaması \"Kitabu'r-rikak\"ta yapılacaktır. ..........Yenfuzuhum fiili muzaraat harfinin fethası ve fe harfinin dammesi ile rivayet edilmiştir. Bu durumda fiil süıasidir. \"Bakışın orada bulunanlara temas edip geçmesi\" anlamına gelir. Bu fiil muzaraat harfinin dammesi ve fe harfinin kesresi ile de okunmuştur. Bu durumda rubai fiil olur. \"Baklştn onları kuşattığı\" anlamına gelir. Bu iki şekildeki rivayette ....zel harfi noktalıdır. Ebu Hatim esSicistani şöyle demiştir: \"Hadis alimleri bu harfin noktalı olduğunu söylemiştir. Ancak bu harf, noktasızdır. Anlamı ise \"Göz onların ilkini de, sonunu da görür,\" şeklindedir.\" Ona şu şekilde cevap verilmiştir: \"Burada anlam olarak, bakanın, onları tamamen kuşattığı, düzlükte bulunan kimselerin kesinlikle ondan kaçamadığı, kimsenin ondan gizlenemediği kastedilmiştir.\" Bu izah, Ebu Ubeyde'nin \"Rahman'ın bakışı onlara yönelir,\" açıklamasından daha isabetlidir. Çünkü Allah'ın bakışı, ister insanlar o düzlükte olsun, isterse başka yerde bulunsun, her halükarda bütün her şeyi tamamen çepeçevre kuşatır. Arapçada ........nefezehu'l-basaru dendiği vakit \"bakışların o kişiye ulaşıp onun da ötesine geçtiği\" kastedilir. Zaten nefaz, bir şeyden kurtulup geçmek anlamına gelir. Arap dilinde bunun örnekleri mevcuttur. Mesela; Arapların \"okun ava girip çıktığını\" ifade etmek için ....nefeze's-sehmu demeleri bu kabildendir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 234
			}
		}
	]
}