{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4720,
			"arabicnumber": 4720,
			"text": "Abdullah İbn Mes'ud'dan rivayet edildiğine göre, Nebi Sallallahu Aleyhi ve Sellem Mekke'de iken onun yanına gelmişti. O esnada Ka'be'nin etrafında 360 adet put vardı. Allah Resulü Sallallahu Aleyhi ve Sellem elindeki bir çubuk ile onlara dürtüyor ve şu ayetleri okuyordu: \"Hak geldi, batı i yıkılıp gitti. Zaten batı i yıkılmaya mahkumdur. \"(İsra 81) \"Hak geldi, artık batıl ne bir şeyi başlatabilir, ne de geri' getirebilir. \"(Sebe' 49) Fethu'l-Bari Açıklaması: Ebu Ubeyde ........tezheku enfusuhum ve hüm karihCın ifadesi hakkında şöyle demiştir: Buradaki tezhegu fiili, \"çıkar, ölür ve yok olur\" gibi anlamlara gelir. Arapçada ........zeheka ma ındek denildiğide bu, \"Elinde ne varsa tükendi,\" anlamına gelir. İbn Ebi Hatim'in, Ali İbn Ebi Talha kanalıyla İbn Abbas'tan rivayet ettiğine göre, ......inne'l-batile kane zehCıka ayetinde geçen zehCıka kelimesini \"yok olur-gider\" şeklinde izah etmiştir. İmam Müslim'in ve Nesai'nin Ebu Hureyre'den rivayet ettikleri hadise göre, yukarıdaki İbn Mes'ud hadisindeki olay, Mekke'nin fethi esnasında vuku bulmuştur. Bu hadisin baş tarafında Mekke'nin fethi anlatılmakta, sonunda da şu ifadeler yer almaktadır: Nebi Sallallahu Aleyhi ve Sellem geldi ve Ka'be'yi tavaf etti. Ardından o putların yanına gitti ve yayın ucu ile onları itmeye başladı. Bu sırada da \"Hak geldi, batıl yıkılıp gitti,\" ayetini okuyordu. Bu hadis oldukça uzundur. Bunun açıklaması ise, -Allah'a hamd olsun- \"Gazvetu'l-feth\" başlığı altında yapılmıştı. Hadiste geçen .......nusub kelimesi, birçok nüshada sonunda elif olmadan geçmektedir. Said İbn Mansur rivayetinde de bu şekilde geçmiştir. Ama ........ nusub yerine .......sanem kelimesi yer almaktadır. Tercih edilen görüşe göre, bu kelimenin temyiz olarak mansub gelmesi gerekirdi. Eğer bu kelime merfu' okunursa, bu durumda sıfat olur. Ancak tekil bir kelime, çoğul bir kelime için sıfat olarak gelmez. Bu kelimenin, mahzuf bir mübtedEmın haberi olması ihtimali de vardır. Bu durumda sonraki cümle onun sıfatı olur. Ya da bu kelime mansubdur. Ama bazı lehçelere uygun olarak elif olmadan yazılmıştır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 242
			}
		}
	]
}