{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "Said İbn Cübeyr'in şöyle söylediği rivayet edilmiştir: İbn Abbas'ın evinde onunla birlikte idik. Bize; \"Haydi bana sorun\" dedi. Ben de; \"Ey Abbas'ın babası! Allah beni sana feda etsin. Kufe'de Nevf adında bir kıssacı var. [Hızır ile arkadaşlık eden Musa'nın,] İsrailoğullarına gönderilen Musa Nebi olmadığını iddia ediyor. [Ne dersin?]\" diye sordum. [Hadisin ravilerinden İbn Cüreyc,] Amr'ın kendisine İbn Abbas'ın şöyle söylediğini aktardığını belirtmiştir: Allah'ın düşmanı yalan söylemiş! [Hadisin ravilerinden İbn Cüreyc şöyle demiştir:] Ya'la ise bana İbn Abbas'ın şöyle söylediğini aktardı: Übey İbn Ka'b bana Hz. Nebi'in şöyle buyurduğunu anlattı: Allah'ın elçisi olan Musa, bir gün halkına vaaz etti. Vaazın tesirinden dinleyenlerin gözyaşları aktı, kalpler yumuşadı. Sonra dönüp oradan uzaklaştı. Bir adam peşinden yetişti ve \"Ey Allah'ın elçisi! Yeryüzünde senden daha bilgili biri var mı?\" diye sordu. O da; \"Hayır,\" diye cevap verdi. Bunun üzerine Allah Tedld onu uyardı. Çünkü [\"Bunu en iyi Allah bilir,\" diyerek] bilgiyi Allah'a nispet etmemişti. Kendisine \"Evet, [Senden daha bilgilisi var,] denildi. Hz. Musa: \"Yd Rabbi! O nerede?\" diye sordu. Hak Tedld: \"İki denizin birleştiği yerde,\" buyurdu. Sonra Musa: \"Yd Rabbı, benim için orayı sayesinde bileceğim bir aldmet var et,\" dedi. [Hadisin ravilerinden İbn Cüreyc şöyle demiştir:] Amr, Allah'ın şöyle buyurduğunu aktardı: \"O, balığın sizden ayrılacağı yerde.\" Ya'la ise bana Allah Teala'nın Musa'ya şöyle buyurduğunu aktardı: \"Yanına ölü bir balık al! O kişi, balığın seni terk edeceği yerde.\" Bunun üzerine Musa bir balık aldı. Ardından onu bir sepete koydu. Genç yardımcısına da; \"Seni, sadece bu balığın senin yanından ayrıldığı yeri bana bildirmekle görevlendiriyorum!\" dedi. O da; \"Bana çok görev vermedin\" dedi. Bu olaydan Allah'ın kelamında \"Bir vakit Musa genç adamına demişti ki\"(Kehf 60) şeklinde bahsedilmiştir. Musa'nın genç yardımcısı Yuşa' İbn Nun idi. [İbn Cüreyc şöyle demiştir:] Hz. Musa'nın genç yardımcısının ismini söylemek, Saıd İbn Cübeyr'den aktarılmamıştır. Musa bir kayanın gölgesinde serin bir yerde uyuyorken balık birden canlandı. Genç yardımcısı \"Musa uyanana kadar onu uyandırmayayım,\" dedi. Sonra ona durumu bildirmeyi unuttu. Balık sıçramaya başladı ve nihayet denize atladı. Allah Tedld da balığın geçtiği yerlerden suyun akışını kesti. Öyle ki balığın izi, taş üzerinde bırakılmış iz gibi görünüyordu. [İbn Cüreyc şöyle demiştir:] Amr \"İşte böyle sanki balığın izi taşın üstünde idi,\" dedi ve baş parmağı ile onun yanındaki iki parmağı birbirine bitiştirdi. Musa: \"Hakikaten şu yolculuğumuz yüzünden başımıza (epeyce) sıkıntı geldi,\" dedi. Musa'nın genç yardımcısı ise şöyle söyledi: Allah yorgunluğunu gidersin! [İbn Cüreyc] \"Bu ifade Said İbn Cübeyr'den nakledilmemiştir,\" demiştir. Musa'nın genç yardımcısı balığın hareket edip denize sıçradığını ona haber verdi. Bunun üzerine ikisi birdengeri döndüler ve Hızır ile karşılaştılar. [İbn Cüreyc] şöyle demiştir: Osman İbn Ebi Süleyman bana şöyle dedi: Hızır denizin ortasında bir halının üstünde idi. Said İbn Cübeyr ise şöyle dedi: Hızır bir ucunu ayaklarının, diğer ucunu da başının altına aldığı bir elbiseye bürünmüştü. Musa Hızır'a selam verdi. Bunun üzerine Hızır, yüzünü açtı ve \"Benim topraklanmda selam var mı? Sen de kimsin?\" diye sordu. Musa: \"Ben Musa'yım,\" diye cevap verdi. Hızır: \"İsrailoğullarına Nebi olarak gönderilen Musa mı?\" diye sordu. Musa da; \"Evet,\" diye cevap verdi. Hızır: \"Ne istiyorsun?\" diye sordu. Musa: \"Sana öğretilenden, bana, doğruyu bulmama yardım edecek bir bilgi öğretmen için geldim,\" diye cevap verdi. Hızır: \"Ey Musa! Tevnjt'ın elinde olması ve sana vahiy gelmesi yetmiyor mu? Benim bir ilmim var. Onu öğrenmek sana düşmez. Senin de bir ilmin var. Bana da onu öğrenmek düşmez,\" dedi. O esnada bir kuş, gagasıyla denizden bir yudum su içti. Hızır: \"Allah'a yemin ederim ki, benim ve senin ilmin Allah'ın ilmi karşısında ancak şu kuşun gagasıyla denizden su almasına benzer,\" diye ekledi. Nihayet bir gemiye bindiler. Bu sahildeki insanları karşı sahile taşıyan bir çok küçük sandalla karşılaştılar. Gemidekiler onu tanımışlardı. Onun için \"Allah'ın salih kulu\" demişlerdi. [(Muhtemelen) Ya'lar30 Said İbn Cübeyr'e \"Hızır için mi?\" diye sorduk. O da \"Evet,\" cevabını verdi. [Gemidekiler] \"Onu ücret karşılığında, götürmeyiz,\" dediler. Ama Hızır, gemiyi deldi ve o deliğe bir kazık soktu. Musa: \"Gemiyi, içindekileri boğmak için mi deldin? Doğrusu şaşılacak bir şey yaptın,\" dedi. Mücahid [ayette geçen 1.;1****--****imren (şaşılacak bir şey) kelimesini] \"kötü bir şey\" olarak açıklamıştır. Hızır: \"Ben sana, benimle beraberliğe sabredemezsin, _ demedim mi?\" dedi. Hz.'Musa'nın ilk sorusu \"bir unutma,\" ikincisi, \"bir şart cümlesinin\" yansıması, üçüncüsü ise \"kasten\" olmuştur. Musa: \"Unuttuğum şeyden dolayı beni sorumlu tutma ve bu işimden dolayı bana bir güçlük çıkarma,\" dedi. Derken bir çocukla karşılaştılar. Hızır onu öldürdü. Ya'la şöyle söyledi: Said şöyle anlattı: Hızır oynayan çocuklarla karşılaştı. Ağzı laf yapan ve kafir olan bir çocuğu alıp yere yatırdı. Ardından bıçakla onu boğazladı. Bunun üzerine Musa: \"Masum ve günahsız bir canı, kısas hükmü ile bir can karşılığında olmaksızın mı öldürdün?\" dedi. İbn Abbas bu ayeti, Müslüman anlamına gelen ..........zakiyyeten şeklinde okumuştur. Bu kelime .......ğulamen zekiyya sözünde olduğu gibi \"Müslüman\" anlamına gelir. ' Hızır ile Musa yola koyuldu. Derken yıkılmak üzere olan bir duvar gördüler. Hızır, duvarı doğrulttu. Saıd: \"Hızır duvarı eliyle doğrulttu,\" dedi. Sonra elini kaldırıp duvarın dümdüz olduğunu gösterip \"Duvar düzgün hale geldi,\" diye ekledi. Ya'la da şöyle demiştir: Öyle zannediyorum ki Saıd, şunu dedi: Hızır elini duvara sürdü ve duvar düzgün hale geldi. Bunun üzerine Musa: \"Dileseydin buna karşı bir ücret alabilirdin,\" dedi. Saıd [ayette geçen \"ücret\" için] \"yiyeceğimiz bir karşılık\" demiştir. ..............ve kane vraehum \"onların önünde\" anlamına gelir. Nitekim ıbn Abbas, bu ayeti .............emamehum me lik şeklinde okurdu. Said İbn Cübeyr dışındakiler bu hükümdarın adının Hüded İbn Büded, öldürülen çocuğun adının da \"Ceysur\" olduğunu iddia etmişlerdir. Hızır şöyle demiştir: Onların önünde her sağlam gemiye zorla el koyan bir hükümdar vardı. Onların, yanına geldiği zaman, kusurundan dolayı gemiye dokunmamalarını istedim. O zorba hükümdarı geçince gemilerini tamir ettiler. Böylece gemi ellerinde kaldı. Ravilerden biri: \"Gemiciler, deliği şişe ile kapattılar,\" bir diğeri: \"zift ile kapattılar,\" demiştir. Hızır şöyle demiştir: \"Erkek çocuğa gelince; onun anne-babası, mümin kimselerdi. Ama o çocuk kafirdi. Bunun için (çocuğun) onları azgınlık ve nankörlüğe boğmasından ko rktuk. Anne-babanın çocuklarına karşı besledikleri sevgiden dolayı, din konusunda ona tabi olmasından endişe ettik. Böylece istedik ki, Rableri onun yerine kendilerine, ondan daha temizini -Hızır bunu, Musa'nın \"masum ve günahsız bir canı\" sözü üzerine söylemiştir.- ve daha merhametlisini versin. Anne-baba'ya yeni verilecek çocuk, onlara Hızır'ın öldürdüğü ilk çocuktan daha fazla merhamet edecektir.\" Saıd dışındakiler, bu anne-babaya kız çocuğu verildiğini iddia etmişlerdir. Davud İbn Ebı Asım bir çok kimseden bu anne-babaya verilen çocuğun kız olduğu bilgisini nakletmiştir. Fethu'l-Bari Açıklaması: Ebu Ubeyde, ''..............Balık, denizde bir yol tutup gitmişti,\" ayeti hakkında şöyle demiştir: ....Serab kelimesi, tutulan, gidilen ve ilerlenen yol anlamına gelir. Nitekim bir başka ayette de bu manada kullanılmıştır. [Söz konusu ayet şu şekildedir:] \"............ve saribun bi'n-nehar, 'gündüzün yürüyen.'(Ra'd 10) Ebu Ubeyde \"...............ve saribun bi'n-nehar (gündüzün yürüyen)\" ayet! hakkın? dajöyle 'deıTI:işti;: Sarib, \"yolunu tutmuş kimse\" anlamına gelir. \",.............Falanca kişi yürüyüşünde güven içinde oldu,\" cümlesi ile \".........Falnca ilerledi,\" cümlesinde de bu manada kullanılmıştır. İbn Abbas'ın \"Haydi bana sorun!\" sözü, alimlerin bu tür sözleri söylemesinin caiz olduğunu gösterir. Alim kişi, kendini beğenme hastalığından emin olursa ve ilmin unutulma korkusu gibi bir zaruret de söz konusu olursa bu şekilde sözler sarfedebilir. Abdullah İbn Abbas'ın künyesi, Ebu Abbas'tır. Bu yüzden ona \"Ey Abbas'ın babası!\" diye hitap edilmiştir. Saıd İbn Cübeyr'in \"Allah beni sana feda etsin,\" sözü, bu tür ifadeleri yasaklayanların aksine, caiz görenler için bir delil niteliğindedir. Bu konunun enine boyuna araştırılması \"Kitabu'l-edeb\"de yapllacaktır. İnsanlara vaaz edip eskilerin haberlerini anlatan kimselere \"kıssacı\" denir. Rivayette geçen Amr, Amr İbn Dinar'dır. Onun \"Allah'ın düşmanı\" ve \"yalan söylemiş!\" sözleri, kıssacının sözlerini kabul etmekten sakındırmak ve uzaklaştırmak için gösterdiği aşırı hassasiyetinin bir sonucu olarak değerlendirilir. Hızır'a yarenlik eden Musa'nın Hz. Musa olup olmadığı meselesi, daha önce İbn Abbas ile.Hurr İbn Kays Fezzariyy arasında konuşulmuştu. Sonunda ikisi birden bu konuyu Übey İbn Ka'b'a sormuşlardı. Ancak o rivayette İbn Abbas ile Hurr'un tartıştıkları açıkça ifade edilmemiştir. Nitekim bu rivayetin açıklamasi \"Kitabu'lilm\"de yapılmıştı. Hadisin \"Allah'ın elçisi olan Musa, bir gün halkına vaaz etti. Vaazın tesirinden göz yaşları aktı, kalpler yumuşadl. Sonra dönüp oradan uzaklaştı,\" bölümü, dinleyenler üzerinde vaazı etkili olan ve bu yüzden dinleyenlerin boyun büküp ağladıklarını fark eden vaizin, insanların bıkmaması için va azını hafifletmesi gerektiğini gösterir. Hadisin \"O kişi, balığın seni terk edeceği yerde,\" bölümü Süfyan'ın Amr'dan yaptığı rivayette şu şekilde daha açık biçimde nakledilmiştir: \"Yanına bir balık alırsın. Sonra onu bir sepete koyarsın. Balık seni nerede terk ederse, o kul oradadır.\" Benzer şekilde Hurr İbn Kays rivayetinde de bu kısım daha açık olarak rivayet edilmiştir: \"Musa'ya şöyle dendi: Balığı kaybettiği n zaman, geri dön! Kuşkusuz sen, onunla karşılaşacaksın.\" Hadisin \"balık birden canlandı\" bölümünde yer alan ...........tedarrabe (canlandı) \"yeryüzünde dolaşmak\" anlamına gelen '............darabe fiilinden tefa'ul babında türetilmiş bir kelime olup \"hareket etmek\" anlamına gelir. Süfyan rivayetinde ise şu şekilde geçmektedir. \"Balık sepette hareket etti. Ardından oradan Çıktı. Sonra denize sıçradı. \" Süfyan'dan gelen rivayete göre Hz. Musa, Allah'ın kendisine emrettiği yeri geçinceye kadar yorgunluk hissetmemişti. Hadisin \"Bunun üzerine ikisi birden geri döndüler ve Hızır ile karşılaştılar,\" bölümü Süfyan rivayetinde \"İşte aradığımız o idi,\" şeklinde, Nesaı rivayetinde ise \"İhtiyacımız olan, oydu,\" şeklinde geçmektedir. Hz. Musa balık konusunda Allah'ın kendisine söylediklerini hatırlamıştı. Hızır'ın nesebi ve durumu \"Kitabu'l-enbiya\"da açıklanmıştı. Süfyan rivayetinde \"İkisi birden kayaya varınca, bir de ne görsünler! .. Orada bir adam var,\" şeklinde bir ifade bulunmaktadır. Davudı bu rivayette hata bulunduğunu, Musa ile genç yardımcısının Hızır ile denizin ortasında bulunan bir adada karşılaştıklarını söylemiştir. Kanaatime göre bu iki rivayet arasında bir çelişki yoktur. Çünkü ilk kastedilen mana şu şekildedir: Musa ile genç yardımcısı, kayaya varınca onu aramaya koyuldular. Sonunda adada onu buldular. Kitabu'l-enbiya'da Ebu Hureyre'den nakledilen merru' bir hadis yer almıştı. O hadiste Hz. Nebi şöyle buyurmuştu: \"Hızır'a bu ad verilmiştir. Çünkü beyaz bir yere otururdu. O oturur oturmaz yer yeşerip hayat bulurdu.\" Müslim'in Ebu İshak'tan naklettiği rivayete göre Hz. Musa, Hızır'a \"es-Selamu aleyküm\" şeklinde selam vermiş. Bunun üzerine o da yüzünü açıp, \"ve aleyküm selam\" şeklinde karşılık vermiştir. \"Benim topraklarımda selam var mı?\" ifadesi Süfyan rivayetinde \"Senin topraklarında selam var mı?\" şeklinde naklediimiştir: Rivayette geçen .........enna edatı \"nerede\" ve \"nasıl\" anlamına gelir. Buradaki soru cümlesi, istib'ad içindir [Hızır'ın selamın verilip-alınmasını uzak gördüğünü gösterir.] Ayrıca bu soru cümlesi, o bölge sakinlerinin henüz Müslüman olmadığına delalet eder. Hızır'ın, Musa'nın selamını aldıktan sonra ona bu soruyu sorduğunu belirterek bu iki rivayet uzlaştırılır. .....Sana öğretilenden, bana, doğruyu bulmama yardım edecek bir bilgi öğretmen için geldim, \"(Kehf 66) ayetinde geçen .......ruşda kelimesini Ebu Amr iki fethayla .......raşeda şeklinde okumuştur. Diğer kıraat imamlarının tamamı ise, ilk harfini dammeli, ikinci harfini sakin ıjj }ruşda şeklinde ..... okumuşlardır. Çoğunluğa göre, bu iki kelimenin anlamı birdir. Tıpkı .....buhl ve .....bahal (cimrilik) kelimelerinde olduğu gibi. Bir görüşe göre ...........raşeda \"din,\" ........ruşda ise \"düzgün bakış açısı\" anlamına gelir. Hızır'ın \"Benim bir ilmim var. Onu öğrenmek sana düşmez. Senin de bir ilmin var. Bana da onu öğrenmek düşmez,\" sözü şu anlama gelir: \"Benim bir ilmim var. Onun tamamın! öğrenmek sana düşmez. Senin de bir ilmin var. Bana da onun tamamını öğrenmek düşmez.\" Çünkü Hızır, bir mükellefin mutlaka bilmesi gereken zahir hükmü biliyordu. Hz. Musa da vahiy yoluyla kendisine geldiği kadarıyla batın hükmü biliyordu. Süfyan rivayetinde Hızır'ın sözü \"Doğrusu sen benimle beraberliğe sabredemezsin,\" şeklinde, sabredememenin gelecekte de devam edeceğini gösteren bir sıga ile nakledilmiştir. Çünkü Hızır, Allah'ın kendisine bildirmesiyle, Musa Nebiin din'e aykırı bir durum gördüğü zaman sessiz kalmaya sabredemeyeceğini biliyordu. Zira Hz. Musa'nın ismet sıfatı bunu gerektiriyordu. Bundan dolayı Hz. Musa dini konularda Hızır'a herhangi bir soru yöneltmemişti. Bunun yerine sadece ona verilen ilimdeki dereceyi göreceği olaylara şahit olmak üzere onunla birlikte yürümeye başlamıştı. Hızır'ın \"(İç yüzünü) kavrayamadığın bir bilgiye nasıl sabredersin?\"(Kehf 68) sözü, mukadder bir soruya karşı söylenmiştir. O mukadder soru ise şu şekildedir: \"Niçin sabredemeyeceğimi söyledin? Doğrusu bensabır göstereceğim.\" Hz. Musa, Hızır'a; \"İnşailah, sen beni sabreder bulacaksın. Senin emrine de karşı gelmem, \"(Kehf 69) demişti. Onun bu sözü üzerine şu yorum yapılmıştır: Hz. Musa sabretme konusunda \"inşallah\" dedi ve sabır gösterdi. Karşı gelme konusunda ise \"inşallah\" demedi. İşte bu yüzden ona karşı geldi. Ancak bu görüş tartışmaya açıktır. Öyle anlaşılıyor ki, burada sabırdan maksat, Hızır'a tabi olmak ve onunla birlikte yürümeye vs. katlanmaktır. Yoksa, dını hükümlerin zahirine muhalif meselelerde sessiz kalması anlamına gelmez. Kuşun gagasıyla denizden su aldığına dair bilgi \"Kitabu'I-i1m\"de geçmişti. İlk anda bu ifadeden, Hızır'ın, Hz. Musa'ya kendi ilimieri hakkında söylediği sözünün hemen peşinden kuşun gagasını denize daldırdığı anlaşılıyor. Süfyan rivayetinde ise, kuşun gagasını geminin delinmesinden sonra suya batırdığı ortaya çıkıyor. Söz konusu rivayetin lafzı şu şekildedir: \"Bu, Hz. Musa'nın ilk unutmasıydl. Nebi Sallallahu Aleyhi ve Sellem olayı anlatmaya şöyle devam etti: Sonra bir serçe gelip geminin bir kenarına kondu. Ardından denizden bir yudum su içti.\" Kuşun gagasıyla denizden su alması, bu rivayette belirtilmeyen bir olaydan sonra olmuştur. Söz konusu olay, Hızır ile Yunus'un gemiye binmesidir. Çünkü gemi lafzı Süfyan rivayetinde açıkça geçmektedir. Bu şekilde iki rivayet uzlaştırılır. İmam Nesai' ise farklı bir senet ile İbn Abbas'ın şöyle söylediğini aktarmıştır: Hızır Hz. Musa'ya; \"Bu kuş ne demek istiyor, biliyor musun?\" diye sormuş. O: \"Hayır,\" diye cevap verince, şöyle demiştir: \"Sizin ikinizin sahip olduğu ilim, Allah'ın ilmi yanında, ancak benim gagamla aldığım suyun bütün denizlere olan oranı kadardır. Hz. Musa şöyle demiştir: \"Gemiyi, içindekileri boğmak için mi deldin? Doğrusu şaşılacak bir şey yaptın.\" Mücahid [ayette geçen I,:,,;Vimren (şaşılacak bir şey) kelimesini] \"kötü bir şey\" olarak açıklamıştır. Bu konuda İbn Ebi' Hatim, Halid İbn Kays kanalıyla Katade'nin şöyle söylediğini nakletmiştir: J\"Vİmr, \"şaşılacak bir şey\" demektir. İbn Ebi' Hatim'in naklettiği er-Rabi\" İbn Enes rivayetinde olayın bu kısmı şu şekilde anlatılmıştır: Musa, Hızır'ın gemide delik açtığını görünce, çok sinirlendi, sinirinden elbisesini bağladı ve ardından \"Bu insanlann canına mı kastettin? İlk boğulanın sen olacağını pek yakında anlayacaksın!\" Bunun üzerine genç yardımcısı onu; \"Verdiğin sözü hatırlasana ... \" diyerek uyardı. Daha sonra Hızır yanına gelip; \"Ben sana dememiş miydim?\" dedi. İşte o esnada Musa'nın aklı başına geldi ve \"Beni sorumlu tutma!\" dedi. Gemi ve yolculan zorba kraldan kurtulunca Hızır gemi sahibine; \"Ben sadece iyiliği hedefledim,\" dedi. Gemidekiler onun görüşünü takdir ettiler. Allah Teala da Hızır'ın eliyle onlann gemisini onardl. \"Ağzı laf yapan ve kafir olan bir çocuğu alıp yere yatırdı,\" ifadesi Abd İbn Humeyd'in İbn Cüreyc'den naklettiği rivayette \"Parlak yüzlü bir çocuğu yere yatırdı, sonra bıçak ile kafasını kesti,\" şeklinde; Süfyan rivayetinde ise \"Kafasından tuttu ve eliyle kafasını kopardı ve onu öldürdü,\" şeklinde geçmektedir. İmam Buhari\"nin bundan bir başlık sonra gelecek rivayetinde ise \"kesti\" şeklinde aktanlmıştır. Bu rivayetler şu şekilde uzlaştırılır: \"Hızır, ilk önce çocuğu kesmiş, ardından da kafasını koparmıştır.\" Hadisin \"Derken yıkılmak üzere olan bir duvar gördüler,\" bölümü, Süfyan rivayetinde \"Sonunda bir köy halkına varıp\" ve Müslim rivayetinde \"şirret bir köy halkına\" şeklinde geçmektedir. Hadisin \"Onların, yanına geldiği zaman kusurundan dolayı gemiye dokunmamalarını istedim,\" kısmıNesai' rivayetinde şöyle geçmektedir: \"Kralın gemiyi almaması için onu kusurlu hale getirdim.\" Hadisin \"Ravilerden biri: 'Gemiciler, deliği şişe ile kapattılar,' bir diğeri: 'zift ile kapattılar,' demiştir,\" kısmı İmam Müslim'in rivayetinde \"gemiyi tahtalarla onardılar,\" şeklinde geçmektedir. Bunda herhangi bir sorun yoktur. Hadisin \"Onun anne-babası, mümin kimselerdi. Ama o kafirdj,\" kısmı Süfyan rivayetinde şöyle anlatılmıştır: \"Çocuk yaratıldığı gün, kafir olarak yaratılmıştır. Anne-babası ise ona merhamet ediyordu.\" \"Said dışındakiler, bu anne-babaya kız çocuğu verildiğini iddia etmişlerdir,\" sözü İbn Cüreyc'e aittir. Nesai, Ebu İshak ve Said İbn Cübeyr kanalıyla İbn Abbas'ın şöyle söylediğini nakletmiştir: \"Allah Teala onlara, o çocuktan daha hayırlısını verdi. Onlara bir kız evlat bahşetti. Sonra bu kız, Nebilerden. birini doğurdu.\" Hadisten Çıkan Sonuçlar 1- Daha fazla bilgi öğrenmek için hırslı olmak ve bu uğurda yolculuk yapmak müstehaptır. 2- Alimlerle buluşmak, bunun için çeşitli sıkıntılara katlanmak ve bu konuda yardımcılardan destek almak müstehaptır. 3- İnsan kendisine bağlı olan birine \"FetWgenç\" diyebilir. 4- Hür insanlar istihdam edilebilir. 5- Hizmetçi efendisine boyun eğer. 6- Unutan mazur görülür. 7 - Müslüman olmayanlardan hediye kabul edilir. 8- Daha önce işaret edilen bir takım karinelere binaen Hızır'ın Nebi olduğu ileri sürülmüştür. Söz konusu karinelerin bir kaçını şu şekilde sıralayabiliriz: a) Hızır'ın \"Ben bunları kendiliğimden yapmadım, \"(Kehf 82) sözü. b) Allah'm Nebii Hz. Musa'nm kendisine bir şeyler öğretmesi için ona tabi olması. c) Hızır'm mutlak olarak Hz. Musa'dan daha bilgili olduğunun ifade edilmesi. d) Hızır'ın, daha sonra açıkladığı gerekçeler yüzünden, bir cana kıyması vs. 9- Bazı alimler bu rivayete dayanarak şu sonuçlara ulaşmışlardır ki, bunların hepsi doğrudur. a) İki zarardan hafif olanı tercih edip ağır olanı önlemek caizdir. b) Daha büyük kötülüklere yol açmasından korkarak bir takım kötülüklere karşı sessiz kalmabilir. c) Hayvanlar kilo almaları için iğdiş edilebilir. d) Birbirinden ayırt edebilmek için hayvanların kulakları kesilebilir. e) Yönetici, yetimin bütün malının velisi tarafından yok edilmesini önlemek için bir kısmını ona vererek veli ile uzlaşabilir. Bu şekilde bir takım sonuçlara ulaşmak, ancak ayet ve hadislere aykırı olmayan konularda olabilir. 10- Bir çok kimseyi öldürmesinden endişe edilen birinin, birilerini öldürmeden önce katledilmesi caiz değildir. Hızır'ın böyle bir cana kıyması ise, Allah'ın kendisine bildirdiği bir bilgiye göre olmuştur. İbn Battal şöyle demiştir: \"Hızır'ın 'çocuğa gelince, o kafirdi,' sözü, gelecekte çocuğun kafir olacağına binaen söylenmiş bir sözdür. Yani bu söz çocuk bulı1ğ çağına gelseydi, kafir olacaktı, anlamına gelir. Böyle bir cana kıymanın müstehab olması, ancak Allah'ın bildirmesi ile öğrenilir. Hak Teala da kulları hakkında bulı1ğdan önce de, sonra da dilediği gibi hükmetme hakkına sahiptir.\" O dönemin şeriatında bulı1ğa ermemiş ancak mümeyyiz olan çocukların mükellef kabul ediliyor olması da muhtemeldir. Eğer durum böyleyse, ortada bir problem yoktur. 11- Kişinin yorulduğunu söylemesi normaldir. Bunun gibi bir hastalıktan veya başka bir nedenden dolayı acı çektiğini söylemesi de normaldir. Ancak bunları söylerken kadere kızmaması gerekir. 12- Rabbine yönelen insanlar yardıma mazhar olurlar. Bu yüzden yorgunluk ve açlık hissetmeyebilirler. Allah'tan başkasına yönelenler ise yorgunluk ve açlık hissederler. Nitekim Hz. Musa kıssasında böyle olmuştur. Hz. Musa, Rabbi'nin kendisine belirttiği buluşma noktasına yönelirken Allah'a itaat içinde olduğu için ne yorulmuş, ne yemek istemiş, ne de bir başkasının yarenliğine ihtiyaç duymuştur. Ancak Medyen'e yöneldiği zaman, kendi ihtiyacı için yola çıkmıştı. Bu yüzden açlık hissetmişti. Hızır'a yönelirken de kendi ihtiyacı için yola düşmüştü. Bu yüzden yorulmuş ve açıkmıştı. 13- Başkasından yiyecek isternek ve misafir edilmeyi talep etmek caizdir. 14- İlk yanılmada insan mazur görülebilir. İkinci yanılma ise kişinin aleyhine delilolur. 15- Allah'a karşı edepli olmalıyız. Her ne kadar her şey O'nun takdiri ile gerçekleşse de, çirkin ve kötü kabul edilen sözleri ona nispet etmemeliyiz. Nitekim Hızır gemiden bahsederken \"Onu kusurlu kılmak istedim, \"(Kehf 79) duvardan bahsederken de; \"Rabbin istedi ki, o iki çocuk güçlü çağlarına erişsinler ve Rabbinden bir rahmet olarak hazinelerini çıkarsınlar, \"(Kehf 82) demiştir. Nebi Sallallahu Aleyhi ve Sellem de şöyle buyurmuştur: \"Hayır Senin elindedir. Şer ise Sana nispet edilmez",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 248
			}
		}
	]
}