{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4727,
			"arabicnumber": 4727,
			"text": "Said İbn Cübeyr'den rivayet edildiği ne göre, o şöyle demiştir: İbn Abbas'a; \"Nevfen Bekaliy HlZır ile arkadaşlık eden Musa'nın, \"srailoğullarına Nebi olarak gönderilen Musa olmadığını iddia ediyor,\" dedim. Bunun üzerine İbn' Abbas şöyle dedi: Allah'ın düşmanı yalan söylüyor! Zira Übey İbn Ka'b bana Hz. Nebi'in şöyle buyurduğunu anlattı: Hz. Musa ayağa kalkıp İsrailoğullarına hitap etti. O esnada kendisine \"İnsanların en bilgilisi kim?\" diye soruldu. O da \"Benim\" diye cevap verdi. Bunun üzerine Allah Teala onu uyardı. Çünkü [\"Bunu en iyi Allah bilir,\" diyerek] bilgiyi Allah'a nispet etmemişti. Sonra Allah Teala ona; \"Evet, iki denizin birleştiği yerde senden daha bilgili bir kulum var,\" diye vahyetti. Musa Nebi: \"Ya Rabbi ona nasıl ulaşınm?\" diye sordu. Allah Teala da; \"Bir balık alzp sepete koyarsın. Balığı kaybettiği n yerde ona tabi olt\" buyurdu. Bunun üzerine Musa yola koyuldu. Onunla birlikte genç yardımcısı Yuşa' İbn Nun da yola çıktı. Balzkları da yanlarındaydı. Nihayet bir kayanın yanına gelip konakladılar. Musa başını koyup uyudu. Süfyan şöyle söyledi: Amr kanalıyla gelen rivayetin dışındaki hadislere göre Allah Resulü Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: Kayanın dibinde bir su kaynağı vardı. Bu su kaynağına \"hayat\" adı verilmişti. Bu su neye dokunsa o şey canlanıyordu. Balzğa da bu su kaynağından bir miktar sıçramıştı. Bundan dolayı balzk hareket edip sepetten dışarı sıçradı. Akabinde denize atladı. Musa uyanınca genç yardımcısına; \"Kuşluk yemeğimizi getir bize ... \"dedi. Musa kendisine emredilen yeri geçinceye kadar bir yorgunluk hissetmemişti. Musa'nın genç yardımcısı Yuşa' İbn Nun: \"Gördün mü? Kayaya sığındığımız sırada balzğı unuttum,\" dedi. Bunun üzerine ikisi birden geri döndüler ve geldikleri yolu izlemeye başladılar. Derken denizde balığın geçtiği yeri hilali andıran bir şekilde buldular. Bu şekil, Musa'nın genç yardımcısı için hayret vericiydi, balık için ise bir yololmuştu. Musa ile yardımcısı kayanın yanına vardıkları zaman, birde ne görsünler, orada bir elbiseye bürünmüş bir adam var. Musa ona selam verdi. Adam: \"Yaşadığın bölgede selamın aslz astarı nedir?\" diye sordu. Musa: \"Ben Musa'yım,\" dedi. Adam: \"İsrailOğullarının Musa'sı mı?\" diye sordu. Musa: \"Evet,\" dedi ve \"Allah'ın sana öğrettiği bilgiden doğruyu bulmama yardımcı olacak bir şeyleri bana öğretmen için sana tabi olayım mı?\" diye sordu. Bunun üzerine Hızır, ona; \"Ey Musa! Senin Allah'ın ilminden gelen bir ilmin var. Onu sana Allah öğretti. Ben onu bilmem. Ben de Allah'ın ilminden gelen bir ilme sahibim. Onu da bana Allah öğretti. Sen de onu bilemezsin,\" dedi. Hz. Musa: \"Yine de sana tabi olayım,\" diye karşılık verdi. Hızır: \"Eğer bana tabi olursan, sana o konuda bilgi verinceye kadar hiçbir şey hakkında bana soru sorma!\" dedi. İkisi birden sahilde yürümeye başladılar. Derken bir gemi onlara yaklaştı. Hızır'ı tanımışlardı. Herhangi bir ücret almadan onları gemiye aldılar. Onlar da gemiye bindiler. Bir serçe gelip geminin bir kenarına kondu. Sonra gagasını denize batırdı. Bunun üzerine Hızır, Musa'ya, \"Allah'ın ilmi karşısında senin, benim ve tüm insanların ilmi sadece şu serçenin denize batırdığı gagası kadardır, dedi. Musa'nın gemiye binmesinden uzun bir zaman geçmeden Hızır bir keser aldı, yöneldi ve gemiyi deldi. Musa ona; \"Bu insanlar bizi ücretsiz olarak gemiye bindirdiler, sen ise onların gemilerine kastettin ve yolcularını boğmak için onu deldin. Doğrusu şaşılacak bir şey yaptın,\" dedi. İkisi birden yol almaya devam ettiler. Derken arkadaşlarıyla birlikte oynayan bir) çocuk ile karşılaştılar. Hızır, çocuğun boynunu tutup kesti. Hz. Musa: \"Ne yaptın? Masum ve günahsız bir canı, kısas hükmü ile bir can karşılığında olmaksızın mı öldürdün? Doğrusu görülmemiş derecede fena bir iş yaptın!\" dedi. Hızır: \"Ben sana, benimle beraber (alacaklara) sabredemezsin, demedim mi?\" diye karşılık verdi. [Musa: Eğer sana bir daha soracak olursam, bundan böyle benimle hiç arkadaşlık etme! Artık özür dileyemeyecek hale geldim,\" dedi. Tekrar yola devam ettiler. Nihayet bir şehre varıp o şehir halkından yiyecek istediler, ama ahali bunları misafir etmemekte direndi. Bu sırada Hızır orada yıkılmaya yüz tutmuş bir duvar gördü ve onu düzeltiverdi.] Eliyle şöyle yapıp duvarı düzeltti. Musa: \"Bu şehre girdik, insanları bizi ne misafir etti, ne de bize yiyecek verdi. İsteseydin elbette buna karşı iyi bir ücret alabilirdin,\" dedi. Bunun üzerine Hızır şöyle söyledi: \"İşte bu, benimle senin aranda ayrılma (zamanı) mız. Sana, üzerinde sabır göstermeye güç yetiremeyeceğin bir yorumu haber vereceğim.\" Allah Resulü Sallallahu Aleyhi ve Sellem; \"Allah onların durumlarını bize anlatıncaya kadar, Musa'nın sabır göstermesini çok arzu ederdik ... \" buyurmuştur. Ravi şöyle demiştir:",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 249
			}
		}
	]
}