{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4753,
			"arabicnumber": 4753,
			"text": "İbn Ebi Müleyke'nin şöyle söylediği rivayet edilmiştir: İbn Abbas, ölümünden kısa bir süre önce, ölümün emarelerinin görüldüğü bir sırada Hz. Aişe'nin yanına girmek üzere izin istedi. Hz.' Aişe, \"Beni övmelerinden endişe ediyorum,\" diyerek [bu talebi geri çevirdi]. Bunun üzerine ona; \"İzin isteyen Hz. Nebi'in amcasının oğlu ve Müslümanların önde gelenlerinden biri,\" dendi. Hz. Aişe de; \"Öyleyse ona müsaade edin gelsin,\" dedi. İbn Abbas ona; \"Kendini nasıl hissediyorsun?\" diye sordu. Hz. Aişe de; \"Eğer mütlaki isem iyiyim,\" şeklinde cevap verdi. Bunun üzerine İbn Abbas şöyle dedi: \"Allah'ın izni ile iyi olursun. Sen, Allah ResD.ıü'nün sallallahu aleyhi ve sellem eşisin. O senden başka bakire biriyle evlenmedi. Masum olduğunu bildirmek için hakkında ayet indi,\" dedi. İbn Abbas'tan sonra içeri İbnü'z-Zübeyr girdi. Hz. Aişe ona şöyle dedi: \"İbn Abbas yanıma geldi ve beni övdü. Halbuki ben, unutulan biri olmayı dilemiştim.\" [-4754-] Kasım, İbn Abbas'ın Hz. Aişe'nin yanına girmek için izin istediğini ve hadisin geri kalan kısmını nakletli. Ancak Hz. Aişe'nin \"Halbuki ben, unutulan biri olmayı dilemiştim,\" sözünden bahsetmedi. Fethu'l-Bari Açıklaması: İbn Zekvan rivayetine göre, İbn Abbas oturunca Hz. Aişe'ye \"Müjdeler olsun!\" demiş, o da; \"Olsun bakalım,\" şeklinde karşılık vermiş. Sonra ıbn Abbas şöyle demiştir: \"Muhammed'e ve sevdiklerine kavuşman için ruhun bedenden çıkmasından başka bir engel kalmadı.\" Yine İbn Zekvan rivayetinde hadisin \"Allah'ın izni ile iyi olursun. Sen, Allah ResD.ıü'nün sallaılahu aleyhi ve sellem eşisin. O senden başka bakire biriyle evlenmedi,\" kısmı şu şekilde geçmektedir: Sen Allah ResD.ıü'nün sallallahu aleyhi ve sellem en fazla sevdiği eşisin. O ancak iyileri severdi.\" Hz. Aişe de, diğer takvalı insanlar gibi unutulmuş biri olarak ölmeyi istemiştir. Onun bu isteği kendisi hakkında duyduğu büyük endişeden ileri geliyordu. Hadisten Çıkan Sonuçlar 1- İbn Abbas derin ilme sahipti. 2- İbn Abbas, sahabe ve tabiD.n nezdinde önemli bir yere sahipti. 3- Hz. Aişe alçakgönüllü biriydi. 4- Hz. Aişe son derece erdemli bir kadındı. 5- Hz. Aişe dini konularda son derece titizdi. 6- Sahabe müminlerin annelerinin yanına izin almadan girmezdi. 7 - Yaşı küçük olan kimse, evla olanın hilafına, bir yola saptığını görünce kendisinden büyük birine görüşünü belirtir. 8- İlim ehline ve dini bakımdan önder olan kimselere saygı göstermeye özen gösterilmelidir. 9- Alimlerin ve dini önderlerin hak ettiği saygı, masıahat çerçevesine oturmayan bir nedenden dolayı terk edilemez",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 275
			}
		}
	]
}