{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4764,
			"arabicnumber": 4764,
			"text": "Said İbn Cübeyr'in şöyle söylediği rivayet edilmiştir: İbn Abbas'a \"O'nun cezası Cehennemdir, \"(furkan 68) ayetinin ne anlama geldiğini sordum. O da \"Onun asla tevbe hakkı yoktur,\" şeklinde cevap verdi. Yine ona \"Allah ile beraber (tuttuklan) başka bir tannya yalvarmazlar,\" ayetini sordum. O da şöyle cevap verdi: \"Bu durum, Cahiliyye döneminde geçerli idi.\" Fethu'l-Bari Açıklaması: Ebu Ubeyde ......ve men yef'al zalike yelka esamen ayetinde geçen .......esame kelimesin'i \"ukubet/ceza\" olarak tefsır etmiştir. Abdurrezzak İbn Hemmam, Ma'mer kanalıyla Katade'nin bu kelimeyi nekaVceza olarak tefsır ettiğini nakletmiştir. Esam kelimesinin Cehennemde bir vadinin adı olduğu da söylenmiştir. Bu yorum, İbn Ebı Hatim tarafından Abdullah İbn Ömer, İkrime ve daha başkalarından nakledilmiştir. Hz. Nebi'in, \"Seninle birlikte yemesinden endişe ettiğin için çocuğunu öldürmen\" sözü, kişinin maddı sıkıntı çektiği durumlarda kendisini çocuğuna tercih etmesi sonucu onu öldürmesi, maddı bolluk içinde olduğu durumlarda ise cimriliğinden dolayı onu öldürmesi anlamına gelir. \"Öldürme\" ve \"zina\" kavramları yukarıdaki ayette mutlak, hadislerde ise mukayyed olarak geçmiştir. Öldürme, kişinin kendisi ile yemesinden korktuğu için çoçuğu ile; zina da komşusunun karısı ile takyid edilmiştir. Her ne kadar genel . olarak adam öldürme ve zina konusunda inmiş olsa da, söz konusu ayet-i kerimeyi bu iki hususa delil getirmek mümkündür. Şu kadarı var ki, kişinin çocuğunu öldürmesi ve komşusunun karısı ile zina etmesi daha büyük ve daha çirkin bir günahtır. Ahmed İbn Hanbel, Mikdad İbnu'l-fsved'den şu rivayet i nakletmiştir: Nebi Sallallahu Aleyhi ve Sellem: \"Zina hakkında ne düşünüyorsunuz?\" diye sordu. Etrafındaki insanlar: \"Haramdır,\" diye cevap verdiler. Bunun üzerine Allah Reslilü sallall1ihu aleyhi ve sellem şöyle buyurdu: \"Kişinin on kadınla zina etmesi, komşusunun hanımı ile zina etmesinden daha basittir.\" \"Klife ehli, bir müminin öldürülmesi hakkında ihtilafa düştü,\" rivayeti yukarıda muhtasar olarak geçti. Bu rivayet, Nisa suresinde verilen Adem rivayetinde daha da muhtasar olarak geçmişti. Bu rivayeti İmam Müslim ve diğer hadis alimleri Şube ve Gunder kanalıyla şu lafızia nakletmişlerdir: \"Klife ehli, 'Kim bir mümini kasden öldürürse cezası, içinde ebediyyen kalacağı Cehennemdir,'(Nisa 93) ayeti hakkında ihtilaf etti",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 286
			}
		}
	]
}