{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4769,
			"arabicnumber": 4769,
			"text": "Ebu Hureyre'den, Hz. Nebi'in şöyle buyurduğu rivayet edilmiştir: İbrahim aleyhisseldm [ahirette] babası ile karşılaşır. Bunun üzerine \"Ya Rabbi! İnsanların diriltileceği günde beni mahçup etmeyeceğini vaad etmiştin,\" der. Allah Teala da şu şekilde karşılık verir: Ben Cenneti kafirlere haram kıldım. Fethu'l-Bari Açıklaması: İbnu't-Tin şöyle demiştir: \"Toz, siyahIıktan ibarettir,\" açıklamasına göre .........ve vucuhun yevmeizin aleyha ğaberah terhekuha katerah (Abese 40-41) ayetinde geçen ......katera kelimesi te'kıd-i laMdir. Sanki burada şöyle buyurulmuştur: Yüzlerde toz üstüne toz vardır. Başka alimler ise şöyle demişlerdir: ........Katera üzüntünün yüze yansımasıdır. .......Ğabera ise yüzü kaplayan toz temektir. Bunlardan biri somut, diğeri soyuttur. Bir başka yoruma göre ise gatera, gaberanın ileri noktası olup yüzü kapkara kaplayan tozdur. Bir diğer yoruma göre ise, gatera siyah dumandır. Burada istiare sanatı için kullanılmıştır. Hz. İbrahim'in babasını bu halde görmesi, (Abese 40-41);) ............ ayetinin zahirine uygundur. Ağır basan görüşe göre buradaki gabera; -\"toprağın tozu,\" gatera ise \"üzüntü yüzünden yüze yansıyan siyahIık\"tır. [Bu rivayet Buhari'de daha önce şu şekilde geçmişti:] Hz. İbrahim şöyle der: Ey Rabbim! Kuşkusuz Sen, insanların diriltileceği gün beni mahçup etmemeyi vaad etmiştin. Uzak olan bu kimsenin babasından ayrı düşmesinden daha büyük hangi mahcubiyet vardır/Uzak düşen babamdan dolayı duyacağım mahcubiyetten daha büyük hangi mahcubiyet var? Hz. İbrahim, ........ebi'l-eb'ad ifadesindeki ..........eb'ad kelimesi ile kendisini tavsif etmiştir. Babası hakkında yapacağı şefaatin kabul edilmeyeceği takdirine göre, bu kelime ile kendisini vasıflandırmıştır. Bir görüşe göre ise bu kelime, onun babasının sıfatıdır. Yani Hz. İbrahim'in babası Allah'ın rahmetinden çok uzaktadır. Çünkü fasık olan kimse Allah'ın rahmetinden uzak, kafir olan kimse ise daha çok uzaktır. Buradaki ...........eb'ad kelimesinin \"helak olmuş\" anlamına gelen .......baıd manasını ifade ettiği de söylenmiştir. Ancak İbrahim İbn Tahman rivayetinde bulunan şu ifade birinci görüşü desteklemektedir: \"Şayet babamı rezil edersen, kuşkusuz en uzak olanı mahçup etmiş olursun.\" Eyyub rivayetinde ise şöyle bir ifade yer almaktadır: \"Kıyamet günü biri babası ile karşılaşır. Ona; 'Ben senin için nasıl bir evlat oldum?' diye sorar. O da 'Hayırlı bir oğuloldun,' der. Bunun üzerine; 'Bugün bana itaat edecek misin?' diye sorar. Babası: 'Evet,' şeklinde cevap verince, 'Öyleyse elbisemden tut!' der. Sonunda babası oğlunun elbisesinden tutar ve insanları hesaba çeken Allah Teala'nın huzuruna varırlar. Allah Teala ona; 'Ey Kulum! Cennetin hangikapısından dilersen oradan gir!' der. Kul da şöyle söyler: Ya Rabbı! Babam da benimle birlikte. Kuşkusuz Sen, beni mahçup etmemeyi vaad etmiştin.\" Hadisin \"Ben Cenneti kafir/ere haram kıldım,\" bölümü Ebu Said rivayetinde şöyle geçmiştir: O vakit şöyle seslenilir: Hiçbir müşrik Cennete giremez",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 291
			}
		}
	]
}