{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4772,
			"arabicnumber": 4772,
			"text": "ez-Zuhrî şöyle demiştir: Bana Saîd ibnu’l-Müseyyeb haber verdi ki, Bâbası el-Müseyyeb ibn Hazn (radıyallahü anh) şöyle demiştir: Ebû Tâlib'e ölüm (alâmetleri) geldiği zaman ona Rasûlüllah(sallallahü aleyhi ve sellem) geldi. Ve amcasının yanında Ebû Cehl ibn Hişâm ile Abdullah ibn Ebî Umeyye ibni'l- Mugîre'yi buldu. Rasûlüllah, Ebû Tâlib'e: \"Ey amca! La ilahe illellâh kelimesini söyle de bununla Allah katında senin lehine şefaat için hüccet getireyim\" dedi. üzerine Ebû Cehl ile Abdullah ibnu Ebî Umeyye: Ebâ Tâlib!) Abdulmuttalib milletinden yüz mü çeviriyorsun? Diye men' ettiler. da amcasına Tevhîd Kelimesi'ni arza devam ediyordu. O ikisi de devamlı olarak o söyledikleri makaaleyi, yani sözü tekrar ediyorlardı. Nihayet Ebû Tâlib bunlara karşı söylediği son söz olarak: O(yani ben) Abdulmuttalib milleti üzeredir, dedi ve \"La ilahe ille İlâh\" demekten çekindi. dedi ki: Rasûlüllah: \"Yemîn ederim ki, ben hakkında mağfiret dilemekten nehy olunmadıkça muhakkak Allah'tan senin için mağfiret isteyeceğim\" dedi. üzerine Allah: \"Müşriklerin, o çılgın ateşin yaranı oldukları muhakkak meydana çıktıktan sonra artık onların lehine, velev hısım olsunlar, nePeygamberin, ne de mü'min olanların mağfiret istemeleri doğru değildir\"(et-Tevbe: 113) âyetini indirdi. Yine Allah Ebû Tâlib hakkında indirdi de Rasûlü'ne hitaben şöyle buyurdu:\"Hakikat sen her sevdiğini hidâyete erdiremezsin. Fakat Allah 'tır ki, kimi dilerse ona hidâyet verir ve O, hidâyete erecekleri daha iyi bilendir\" (Âyet:56) İbn Abbâs şöyle dedi: \"Hakîkaten Kaarûn, Musa'nın kavminden idi. Fakat onlara karşı serkeşlik etti, Biz ona öyle hazîneler verdik ki, anahtarlarını taşımak bile) güçlü kuvvetli büyük bir cemâate ağır geliyordu. O vakit kavmi ona: 'Şımarma, çünkü Allah şımarıkları sevmez demişti\"(Âyet 76). (Kuvvet sâhibleri)' \"Erkeklerden oluşan kuvvet sahibi bir cemâat onun anahtarlarını kaldırmaz\" ma'nâsınadır. da \"Anahtarlar o cemâate elbette ağır basar\" demektir. 'nın anası, yüreği çocuğundan başka herşeyden bomboş olarak sabahladı. Eğer (Allah'ın va'dine) inananlardan olması için kalbine rabıta vermeseydik az daha onu açıklayacaktı\"(Âyet:10). 76) \"el-Merihîn\", yani \"Şımarıkları sevmez\" demektir. \"Anası Musa'nın kızkardeşine dedi ki: 'Onun izini ta'kîb et\" (Âyet: 11) yani \"Onun haberini öğrenip bildirmem için izinin arkasından git, dedi\". Bazen bu\"el-Kasas\" fiili, bir sözü kıssa etmek, nakletmek, anlatmak ma'nâsına olur: \"Biz sana bu Kur 'ân’ı (bu sûreyi) vahyetmek suretiyle en güzel beyânı kıssa olarak sana anlatacağız. Halbuki sen daha evvel bundan elbet haberdâr olmayanlardandın'' (Yûsuf: 3) âyetinde olduğu gibi. 'nın kızkardeşi de, berikiler farkında olmayarak onu uzaktan gözetledi\"(Âyet: 11); buradaki \"An cunübin\", \"An bu'din\" yani \"Uzaktan\" ma'nâsınadır. \"An cenabetin\" ve \"An ictinâbin\" ta'bîrleri de yine bir şey olup, aynı ma'nâyadır. Mûsâ ikisinin de düşmanı olan birini yakalamak isteyince...\"(Âyet:19); buradaki \"Yebtışu\" ve \"Yebtuşu\" fiilleri, sülâsî ikinci ve birinci bâblardan olup sıkı ve sert şekilde arslan yakalayışı gibi yakalama ma'nâsınadır. öte başından koşarak bir adam geldi. Mûsâ: Memleketin önde gelenleri seni öldürmek için (toplandılar) hakkında müzâkere ediyorlar. Hemen buradan çık git. Şübhesiz ki, ben sana hayır isteyicilerdenim, dedi.\" (Âyet:20), buradaki \"Ye'temirûne\", \"İstişare ediyorlar\" demektir. 28), \"el-Adâu\", \"et-Teaddî\" hepsi bir olup \"Hakkı tecâvüz etmek\" ma'nâsınadır. \"Absara\", yani \"Gördü\"; minel-nâri\"(Âyet: 29), \"Ateşten bir parça\" ma'nâsınadır. kendisinde alev bulunmayan ateşli odundan kalın bir parçadır. 7) ise, kendisinde alev bulunan ateştir. birçok cinstir: \"el-Cânnu\" (Âyer.31), \"el-Efâî\", \"el-Esâvid\"...gibi. \"Yardım edici olarak\"; İbn Abbâs: \"Beni tasdîk edip doğrulayacak bir yardımcı olarak\" şeklinde fiili merfû' okuyup söyledi. Abbâs'tan başkası da şöyle dedi: \"Seneşuddu adudeke biahîke = Senin pazunu kardeşinle şiddetlendirip kuvvetlendireceğiz\"(Âyet:35) buradaki \"Se-nesudduke\", \"Sana yardım edeceğiz\" demektir. Bir şeyi kuvvetlendirdiğin zaman muhakkak sen onu takviye edecek bir pazu yapmış olursun. onları (dünyâda insanları) ateşe da'vet edegelen rehberler yaptık. Kıyâmet gününde ise asla yardıma kavuşturulmayacaklardır. Bununla beraber bu dünyâda biz onların arkalarına la'net de taktık. Kıyâmet gününde onlar çok kötülenmiş olanlardır\"(Âyet: 41-42); buradaki\"Mine'l-makbûhîn\", \"Helak edilmişlerdendirler\" ma'nâsınadır. olsun ki, biz onlar için nasihat kabul etsinler diye sözü birbiri ardınca ekleyip (indirip) durmuşuzdur\" (Âyet:51); buradaki \"Ve le-kad vassalnâ’l-kavle = Yemin olsun biz sözü ekleyip durduk\", \"Yemîn olsun biz sözü beyân ettik ve tamamladık\" ma'nâsınadır. Biz onları tarafımızdan bir rızık olarak her şeyin mahsûllerinin gelip toplanacağı korkusuz bir haremde yerleştirmedik mi?\" (Âyet:57); buradaki \"Yucbâ\", \"Yuclebu\" yani \"Celb edilip toplanır\" ma'nâsınadır. bol geçimi ile şımarmış nice memleketleri helak ettik\" (Âyet:58); buradaki “Batırat” \"Eşiret(Çok sevindi, taşkınlık etti, azdı)\" ma'nâsınadır. Rabb'in memleketlerin ana merkezlerine, karşılarında âyetlerimizi okuyacak bir rasûl gönderinceye kadar o memleketleri helak edici değildir ve biz ahâlîsi zâlim olan memleketlerden başkasını helak edici değiliz\"(Âyet: 59). Buradaki \"Ummihâ\", \"Memleketlerin ana merkezi: Mekke ve etrafında bulunanlar\"dır. neler saklıyorsa, neleri de açıklıyorsa Rabb'in hepsini bilir\"(Âyet:69); buradaki \"Tekinnu\", \"Tuhfî (=: Gizliyor)\" ma'nâsınadır. \"Eknentu'ş-şey'e\", \"Onu gizledim\", \"Kenentuhû\" ise \"Onu gizledim ve onu açığa çıkardım\" demek olup zıd ma'nâlı fiillerdendir. tereenne'llâhe...\"gibidir: \"Vay demek ki, Allah kullarından kimi dilerse onun rızkını yayıyor, daraltıyor...\", yâni \"Ona rızkını bollatıyor ve daraltıyor...\". \"Vay demek ki hakikat şudur: Kâfirler asla felah bulmayacaklar\" (Âyet: 82). O Kur'ân'ı Senin Üzerine Farz Kılan Allah, Seni Dönülecek Yere Döndürecektir\" (Âyet: 85)Bâbı",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 294
			}
		}
	]
}