{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4774,
			"arabicnumber": 4774,
			"text": "Mesruk'tan rivayet edildiğine göre, o şöyle demiştir: \"Adamın biri Kinde'de konuşurken 'Kıyametin kopacağı gün bir duman çıkacak ve münafıkların duyma ve görme duyularını işlevsiz hale getirecek. Müminleri ise nezleye tutulmuş hale dönüştürecek,' dedi. Bu sözler yüzünden korkuya kapıldık. Hemen İbn Mes'ud'un yanına gittim, O esnada arkasına yaslanmış rahatça oturuyordu, (Duyduklarımı ona anlatınca) birden sinirlendi ve ciddi bir biçimde oturdu. Sonra şöyle dedi: Kim biliyorsa, konuşsun. Kim de bilmiyorsa, 'En iyi Allah bilir,' desin. Çünkü kişinin bilmediği bir konuda 'Ben bilmiyorum,' demesi, ilimdir, Allah Teala da Nebiine şöyle buyurmuştur: (Resulüm!) De ki: Buna karşılık ben sizden bir ücret istemiyorum, Ve ben olduğundan başka türlü görünenlerden de değilim. (Sad 86) Kureyş kabilesi İslam dinini kabul etmekte ağırdan almıştı. Bunun üzerine Allah Resulü onlara şu şekilde beddua etmişti: Ey Ulu Alla,hım! Onlara karşı, Yusuf Nebi döneminde uerdiğin yedi kıtlık yılı gibi yedi yıl kıtlık uererek bana yardım et! Bu bedduanın ardından kıtlık başladı. Bazı müşrikler kıt1ıkta helak oldu. Bazıları ölü eti ve kemik yemek zorunda kaldı. İnsanlar gökyüzü ile yeryüzü arasında dumana benzer bir karaltı görmeye başladılar. Bunun üzerine Ebu Süfyan, Hz. Nebi'e gelerek 'Ey Muhammed! Sen, akrabalık bağlarını gözetmemizi emretmek üzere bize geldin. Ama senin kavrnin helak oldu,' dedi. Sonra İbn Mes'ud \"Şimdi sen, göğün, insanlan bürüyecek açık bir duman çıkaracağı günü gözetle! .. \" şeklinde başlayıp \"Ama siz, yine (eski\"halinize) döneceksiniz, \"(Duhan 10-15) kısmına kadar olan ayetleri okudu. Daha sonra şöyle dedi: Hiç ahiret azabı gelip çatınca onlardan kaldırılır da, onlar inkarlarına tekrar dönerler mi? Burada kastedilen şudur: Fakat biz büyük bir şiddetle yakalayacağımız gün, yani Bedir savaşının olacağı gün, intikamımızı alınz.(Duhan 16) (Ey inkarcılar! Size Resul'ün bildirdiklerini) kesinkes yalan saydmız. Onun için azap yakanızı bırakmayacak. (Furkan 77) Yani Bedir savaşının olacağı gün, azaptan kurtulamayacaksınız. Fethu'l-Bari Açıklaması: \"Elif,' Lam, Mfm. Rumlar yenilgiye uğradı. \"(Rum 1-2) Bununla ilgili açıklama daha önce geçmişti. ..........Fela yerbu ifadesinin \"Daha iyisini elde etmek için malını verenler, bundan dolayı herhangi bir ecir kazanamazıar,\" şeklindek, izahını Taberi, senedli olarak İbn Ebı Nedh kanalıyla Mücahid'den şu şekilde nakletmiştir: \"İnsanların mallarında artış olsun diye verdiğiniz herhangi bir riba, Allah katında artmaz.\" Bu tür insanlar mallarını verip ondan daha hayırlısına kavuşmak isterler. Abdurrezzak İbn Hemmam da, Abdulaziz İbn Ebi Ruwad kanalıyla Dahhak'ın bu ayet hakkında şöyle dediğini nakletmiştir: \"Bu ayette bahsi geçen riba, daha iyisini almak için bir şeyin hediye edilmesi şeklinde gerçekleşen helal ribadır. Bunda ne günah vardır, ne de sevap.\" Şa'bı'nin bu ayeti şu şekilde yorumladığı naklediimiştir: \"Biri, başka birine hizmet için onun yanından ayrılmaz, onunla birlikte yolculuğa çıkar, yaptığı ticari seferlerde elde ettiği kardan ona da bir pay verir, bütün bu yaptıklarıyla onun yardımına mazhar olmayı umardı. Allah rızasını gözetmezdi. İşte buradaki ribş'dan maksat budur.\" İbn Abbas, şöyle demiştir: \"Mülkiyetiniz altında bulunan köleler içinde ... \" ayeti, Allah Teala ile müşriklerin ilahları hakkında nazil olmuştur. Bu ayet insanların, birbirlerine varis oldukları gibi, mülkiyetleri altında bulunanların da kendilerine varis olmalarından çekindiklerini ifade eder. İbn Ebı Hatim, Said kanalıyla Katade'den şunları nakletmiştir: \"Bu ayette anlatılanlar, müşriklerin Allah Teala'nın yarattığı herhangi bir şeyi O'na denk tutmaları hususunda getirdiği bir misalden ibarettir. Bu ayette şöyle denmek istenmiştir: Sizden biri kölesiyle yatağını ve karısını paylaşmak ister mi? Elbette istemez. İşte bunun gibi, Allah Teala da, yarattıklarından herhangi birinin kendisine eş tutulmasına asla razı olmaz.\" .........Yessaddeune ifadesi, \"bölük bölük ayrılmak\" manasınagelir. Nitekim r..........fesda' ayeti de bunu destekler. Burada geçen .........fesda' kelimesi, \"Allah'a yapacağın davet ile hakkı batıldan ayırt et, onları \"\"birbirinden ayır;\" anlamına gelir. Kişinin neyi bilip neyi bilmediğini bilmesi, bır tür ilimdir. İbn Mes'ud'un bu sözü, \"Bilmiyorum, demek ilmin yarısıdır,\" atasözüyle uyum halindedir. Çünkü kişinin bilmediği konularda konuşmaya kalkışması, bir tür tekellüftür",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 296
			}
		}
	]
}