{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4784,
			"arabicnumber": 4784,
			"text": "Zeyd İbn Sabit'ten şöyle dediği rivayet edilmiştir: \"Mushafı çoğaltınca, Nebi'in sallallahu aleyhi ve sellem çok sık okuduğunu işittiğim Ahzab suresinden bir ayeti, Ensar'dan Huzeyme'nin dışında hiç kimsenin yanında bulamadım. Rasulullah sallallahu aleyhi ve sellem onun şahitliğini iki kişinin şahitliğine denk tutmuştu. Bahsi geçen ayet şuydu: \"Müminler içinde Allah'a verdikleri sözde duran nice erler var. \"(Ahzab 23) Fethu'l-Bari Açıklaması: Ebu Ubeyde bu ayetin [Ahzab 33/23J tefsiri hakkında şöyle demiştir: .......Nahbehu kelimesi \"adak\" anlamına gelir. Buna göre ayet \"kimileri adağını yerine getirmiştir,\" manası taşır. Ayrıca bu kelime, \"can tehlikesi\" ve \"tehlike\" manalarına da gelir. Başka bir müfessir ise şöyle demiştir: .....Nahbe kelimesi asıl itibariyle \"adak\" anlamına gelir. Ancak daha sonraları herşeyin sonu hakkında kullanılmaya başlanmıştır. Abdurrezzak İbn Hemmam, Ma'mer kanalıyla Hasan-ı Basri'nin \".......kada nahbehu\" ayetini 'imanına ve ahdine vefa gösterip canını verenler,' şeklinde tefsır ettiğini rivayet etmiştir. Bu yorum, diğer müfessirlerin yorumlarına aykırıdır. Hatta Hz. Aişe'den buna aykırı olarak şu rivayet nakledilmiştir: \"Talha, Allah Resulü Sallallahu Aleyhi ve Sellem'in huzuruna geldi. Nebi Sallallahu Aleyhi ve Sellem ona .........ente ya Talha, min men akada nahbehu ('Sen ey Talha! Ahdini yerine getirenlerdensin') buyurdu.\" Bu rivayeti, İbn Mace ve Hakim' tahriç etmiştir. Ancak Hz. Aişe'den nakledilen hadisi mecaı ile izah edebiliriz. Buna göre geçmiş zaman kipinde olan ......kada fiili, geniş zaman\" kipinde olan ........yakdi fiili manasına kullanılmıştır. İbn Ebı Hatim'in tefsirinde Ammar ıbn Yasir; Yahya ıbn Sellam'ın tefsirinde de Hamza ve arkadaşları ah de vefa gösterenler arasında sayılmıştır. Nitekim daha önce Enes İbn Nadr'ın olayı anlatılırken Enes İbn Malik'in onun hakkında söyledikleri aktarılmıştı. Enes İbn Nadr da bu grup içinde yer alır. Hakim'in Ebu Hureyre'den naklettiği hadise göre, Mus'ab İbn Umeyr de bu gruba dahildir. ........Fitnetu le atevha fitne çıkarırlar anlamına gelir. İmam Buhari kelime açıklamasını yaptıktan sonra, daha önce \"Kitabu'l-cihad\" bölümünün başlarında ayrıntılı biçimde açıkladığımız Enes İbn Nadir olayıyla ilgili olarak Enes İbn Malik'in sözünü nakletti. Hz. Nebi'in çok sık okuduğunu işittiğim Ahzab suresinden bir ayeti, Ensar'dan Huzeyme'nin dışında hiç kimsenin yanında bulamadım. Bu rivayet Zeyd'in Kur'an'ı toplarken sadece kendi bilgisine güvenmediğini, sadece kendi ezberi ile yetinmediğini gösterir. Ancak yine de, bu konuda problem olabilecek bir husus vardır. Şöyle ki; bu hadisin zahiri, Zeyd'in söz konusu ayeti Kur'an'dan kabul ederken sadece Huzeyme ile yetindiğini gösterir. Halbuki bir sözün Kur'an olduğu, ancak tevatür yoluyla sabit olur. Bu itiraza en güzel şu şekilde cevap verilir: Zeyd bu sözü ile bu ayetin yazılı olduğu materyali bulamadığım ifade etmek istemiştir. Yoksa onun ezberlerde de olmadığını kastetmemiştir. Zira hem kendisi, hem de başkaları bu ayeti ezbere bilmekteydi. Nitekim \"Kur'an'ın Cem'i\" bahsinde gelecek hadiste geçen \"Kur'an'ı deri parçalarından ve hurma dallarından araştırmaya başladım,\" sözü de bunu destekler niteliktedir. Bu hadis, \"Fezailu'lKur'an\" bölümünde ayrıntılı biçimde ele alınacaktır. Ayrıca yine onun Huzeyme hakkındaki \"Rasulullah sallallahu aleyhi ve sellem onun şahitliğini iki kişinin şahitliğine denk tutmuştu,\" sözü de bunu destekler. Rivayette adı geçen Huzeyme, Huzeyme İbn Sabit'tir. Onun şehadeti ile ilgili hadis, Ebu Davo.d ve Nesaı tarafından şu şekilde tahriç edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bedevinin birinden bir at satın aldı. Bedeviden atın parasını alması için kendisini takip etmesini istedi. Sonra Nebi Sallallahu Aleyhi ve Sellem hızlı, bedevi ise yavaş yürüyerek yola koyuldu. Yolda bazı insanlar bedevinin önünü kesip atın fiyatı konusunda pazarlığa başladılar. [Ancak Hz. Nebi'in atı aldığından haberleri yoktu. Bedevi, onlar alıcı olunca Hz. Nebi'e 'Bu atı alıyor musun? Yoksa onu satacağım,' diye seslendi. Allah Resulü Sallallahu Aleyhi ve Sellem onun sözünü işitir işitmez, 'Ben bunu senden satın almadım mı?' diye çıkıştı. Bedevi, 'Ne münasebet, Allah'a yemin ederim ki, ben atımı sana satmadım,' dedi. Bunun üzerine Hz. Nebi 'Tam tersine! Ben onu senden satın aldım,' dedi.poBo Bu defa Bedevi, 'O halde bu atı sana sattığıma dair bir şahit getir,' demeye başladı. Onun yanına gelen Müslümanlar, 'Yazıklar olsun sana! Allah Resulü Sallallahu Aleyhi ve Sellem hiç doğrudan başka bir şey söyler mi?' diyerek tepkilerini gösteriyorIardı. Nihayet Huzeyme İbn Sabit geldi. Bir müddet konuşulanları dinledi. Sonra 'Ben, senin bu atı ona sattığına şahidim,' dedi. Bunun üzerine Allah Resulü ona 'Ne ile şahitlik edersin?' diye sordu. O da, 'Seni tasdik ederek' diye cevap verdi. Böylece Nebi Sallallahu Aleyhi ve Sellem Huzeyme'nin şahitliğini iki kişinin şahitliğine denk saydı.\" Hattabı şöyle demiştir: \"Birçok kimse bu hadisi yanlış yorumlamıştır. Bid'at ehli bazı çevreler, bu hadisi kullanarak, doğrulukla tanıdıkları kimselerin iddia ettikleri her şeye şahitlik etmelerinin meşru olduğunu ileri sürmüşlerdir. Halbuki Hz. Nebi bedevinin aleyhine hüküm verirken kendi bilgisine dayanmıştır. Huzeyme'nin şahitliği onun sözünü destekler mahiyettedir ve tartıştığı kimseye karşı ona destek olma niteliğindedir. Böylece bu olay, diğer mahkemelik durumlar açısından bakılınca iki kişinin şahiHiği takdirinde olur.\" Bu olayda kıvrak zekalı olmanın kazandırdığı üstünlük ortaya çıkmıştır. Kıvrak zekaya sahip olmak, kişinin derecesini yükseltir. Çünkü burada Huzeyme'nin ileri sürdüğü gerekçe, diğer sahabiler tarafından da biliniyordu. Son derece açık olmasına rağmen sadece o, kıvrak zekasıyla bunu ileri sürmüş ve bundan dolayı ödüllendirilmişti. Artık bu olaydan sonra Huzeyme kimin lehine veya aleyhine şahimk ederse, bu, o kimse hakkında yeterli olacaktı]",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 306
			}
		}
	]
}