{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4787,
			"arabicnumber": 4787,
			"text": "Enes İbn Malik'ten şöyle dediği rivayet edilmiştir: \"Allah'ın ortaya çıkaracağı şeyi, insanlardan çekinerek içinde gizliyordun,\" ayeti Zeyneb bint Cahş ile Zeyd İbn Harise hakkında indi.\" Hadisin geçtiği diğer yer: 7420. Fethu'l-Bari Açıklaması: Bu ayet in Zeyd İbn Harise ile Zeyneb bint Cahş hakkında nazil olduğu husunda rivayetler ittifak halindedir. \"Allah'ın ortaya çıkaracağı şeyi, insanlardan çekinerek içinde gizliyordun,\" ayeti Zeyneb bint Cahş ile Zeyd İbn Harise hakkında indi. Burada İmam Buhari olayın sadece bu kısmını anlatmakla yetindi. Fakat \"Kitabu't-tevhid\"de başka bir kanalla, Hammad İbn Zeyd ve Sabit vasıtasıyla Enes'ten onun şöyle söylediğini nakletmiştir: \"Zeyd İbn Harise Hz. Nebi'e durumunu şikayet için geldi. Allah Resulü Sallallahu Aleyhi ve Sellem ona 'Allah'tan kork! Eşinle eu/iliğini sürdür!' diye öğüt verdi.\" Enes daha sonra şöyle dedi: \"Eğer Hz. Nebi Kur'an'dan bir ayeti gizleyecek olsaydı, kuşkusuz bu ayeti gizlerdi. .. Hz. Zeynep, Allah Resulü Sallallahu Aleyhi ve Sellem'in diğer eşlerine karşı böbürlenirdi ... \" Bu olayı Ahmed İbn Hanbel şöyle nakletmiştir: \"Allah Resulü Sallallahu Aleyhi ve Sellem Zeyd İbn Harise'nin evine geldi. Zeyd onun yanına gelip hanımını ona şikayet etti. Allah Resulü Sallallahu Aleyhi ve Sellem 'Eşinle euliliğini sürdür ue Allah'tan kork!' dedi. Bu olay üzerine '[(Resulüm!) hani Allah'ın nimet uerdiği, senin de kendisine iyilik ettiğin kimseye: Eşini yanında tut! Allah'tan kork! diyordun. Allah'ın açığa çıkaracağı şeyi, insanlardan çekinerek içinde giz/iyordun. Oysa asıl korkmana layık olan Allah'tır. Zeyd o kadından ilişiğini kesince] biz onu sana nikahladık,'(Ahzab 37) ayeti nazil oldu. Burada \"onu\" lafzı ile Zeyneb bint Cahş kastedilmiştir.\" İbn Ebi Hatim, Süddi kanalıyla daha açık ve net lafızlarla bu kıssayı şu şekilde nakletmiştir: \"Belağ yoluyla bana iletildiğine göre, bu ayet, Zeyneb bint Cahş hakkında inmiştir. Zeyneb, Rasulullah'ın sallallahu aleyhi ve selle m halasının kızı Ümeyye bint Abdilmuttalib'in kızıydl. Allah Resulü Sallallahu Aleyhi ve Sellem onu, evlatlık edindiği Zeyd İbn Harise ile evlendirrnek istemişti. Ne var ki Zeyneb, buna rıza göstermedi. Sonra Allah Resulü Sallallahu Aleyhi ve Sellem'in yaptığına razı oldu. Nebi Sallallahu Aleyhi ve Sellem de onu Zeyd ile evlendirdi. Daha sonra Allah Teala, Nebii'ne Zeyneb'in, eşlerinden biri olacağını bildirdi. Ancak Hz. Nebi, Zeyd'e karısını boşamasını emretmekten utanıyordu. Bu esnada Zeyd ile Zeyneb arasında; diğer insanlar arasında görülen bir takım huzursuzluklar çıkmaya devam ediyordu. Bu durum karşısında Allah Resulü Sallallahu Aleyhi ve Sellem Zeyd'e hanımıyla evli kalmasını ve Allah'tan korkmasını emrediyordu. İnsanların, 'Oğlunun hanımı ile evlendi,' diyerek kendisini ayıplamalarından çekiniyordu. Zira o, Zeyd'i evlatlık edinmişti. Özetle ifade edecek olursak; Hz. Nebi'in gizlediği, Allah Teala'nın kendisine, Zeyneb'in, hanımlarından biri olacağına dair verdiği haberdir. \"Oğlunun eşiyle evlendi,\" şeklinde ileri geri konuşmalarından çekinmesi, bu haberi gizlemesine neden olmuştur. Allah Teala Cahiliyye dönemi insanlarının uydukları evlatlık hükümlerini en güçlü şekilde ortadan kaldırmak istemişti. Bu da ancak evlat olarak kabul edilen birinin hanımı ile evlenmekle olurdu. Bu olay, insanların daha kolay kabul etmesini sağlamak için Müslümanların Önderi vasıtasıyla gerçekleşmişti. Hz. Nebi'in neden çekindiğini yorumlayanlar ihtilaf eetmişlerdir. Ahmed İbn Hanbel, Müslim ve Nesaı, Süleyman İbn Mugıra ve Sabit kanalıyla Enes'ten şöyle rivayet etmişlerdir: \"Zeyneb'in iddeti bitince, Nebi Sallallahu Aleyhi ve Sellem Zeyd'e 'Onu bana iste,' dedi. Olayın bundan sonrasını Zeyd şöyle anlattı: Zeyneb'in yanına gittim. Ona 'Ey Zeyneb! Gözün aydın. Resulullah Sallallahu Aleyhi ve Sellem beni sana gönderdi. Niyeti seninle evlenmek,' dedim. O da 'Rabbim'e danışmadan bir şey yapacak değilim,' diye karşılık verdi. Sonra kalkıp secde ettiği yere gitti. Derken ayet indi. Allah Resulü Sallallahu Aleyhi ve Sellem geldi ve izni olmadan onun yanına girdi.\" Bu, söz konusu adetin kaldırılması hakkında olabilecek en etkili yöntem di. Bu olayda Zeyneb'i Hz. Nebi'e (bizzat eski kocası) istemiştir. Böylece Hz. Nebi'in Zeyneb'le, Zeyd'in rızası olmadan, baskı yaparak evlendiği şeklinde meydana gelebilecek zanlara sed çekilmiştir. Aynı zamanda bu uygulamada, Hz. Nebi'in, Zeyd'in gönlünde Hz. Zeyneb'e karşı bir duygunun kalıp kalmadığını test etmesi de söz konusudur. Bu hadisten çıkarılan bir başka sonuç ise, kendisine talip çıkan kadının, cevap vermeden önce istihare yapmasının ve isteme sırasında dua etmesinin müstehap olduğudur. Her kim işini Allah'a havale ederse, Allah Teala dünya ve ahirette kendisi için daha yararlı ve güzel şeyleri onun için kolaylaştırır",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 309
			}
		}
	]
}