{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4789,
			"arabicnumber": 4789,
			"text": "Âsim el-Ahvel, Muâze (bintu Abdillah el-Adeviyye)'den; o da Âişe (r.anha)'den haber verdi ki, Rasûlüllah (sallallahü aleyhi ve sellem) şu \"Onlardan kimi dilersen nevbetinden geri bırakır, kimi de dilersen yanına alabilirsin. Geri bıraktıklarından kimi istersen yanına almakta da sana güçlük yoktur...\" âyeti indikten sonra, biz kadınlarından nevbetinde bulunduğu kadının gününde (öbür kadına yönelmek isteyince) her zaman izin isterdi. dedi ki: Ben Âişe'ye: Sen Rasûlüllah'a ne der idin? diye sordum. Âişe: Ben de O'na: Yâ Rasûlallah, eğer izin vermek bana âid (bir hakk) ise, ben Sen'in üzerine hiçbir kimseyi tercîh etmek istemem! Diye cevâb verirdim, dedi hadîsi Abbâd ibnu Abbâd da Âsim el-Ahvel'den işitmekte Abdullah ibnu’l-Mubârek'e mutâbaat etmiştir. Allah'ın Şu Kavli: îmân edenler, Peygamberin evlerine -yemeğe da'vet olunmaksızın, vaktine de bakmaksızın- girmeyin. Fakat da'vet olunduğunuz zaman girin. Yemeği yiyince dağılın. Söz dinlemek veya sohbet etmek için de (izinsiz) girmeyin. Çünkü bu, Peygamber'e eza vermekte, o sizden utanmaktadır. Allah ise hakkı açıklamaktan çekinmez. Bir de onun zevcelerinden lüzumlu birşey istediğiniz vakit perde ardından isteyin. Bu, hem sizin kalbleriniz, hem onların kalbleri için daha temizdir. Allah'ın Rasûlü'ne eza vermeniz doğru olmaz, kendinden sonra da zevcelerini nikâhla almanız da ebedî caiz değildir. Bu, Allah katında çok büyük bir günâhtır\" (Âyet: 53) ki \"înâhu\", \"İdrâkuhu\" (ve \"Bulûğunu\", yânı \"Erişmek vakti gelmek\") ma'nâsınadır. Yine \"Enâ, Yenî, Enâten\" (\"Fe huve ân\") denilir. tekûnu karîben = Belki de o saat yakındır\" (eŞ-şûrâ: 17) (Kıyâs olan tâ ile \"Karîbeten\" demek idi. Müellif buna şöyle cevâb verdi:) Müennes ismin sıfatını vasıf yaptığın zaman \"tâ-ı merbuta\" ile \"Karîbeten\" dersin. Onu zaman zarfı (yânı zaman ismi) veya sıfattan bedel, yani sıfatın yerine isim yaptığın zaman ve sıfatı kasdetmediğin zaman ise müennesten \"Hâ\"yı (yani yuvarlak tâ'yı) çıkarır, \"Karîben\" dersin. Burada (Şûra Âyeti'nde) zikredilen kelimenin lafzı da böyledir. Onda sıfat irâde etmezsen, erkek ve dişi için lafzında vâhid, tesniye ve cemi' müsâvî olur (tâ'sız, tesniyesiz ve cemi'siz olur)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 311
			}
		}
	]
}