{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4789,
			"arabicnumber": 4789,
			"text": "Aişe r.anha'dan rivayet edildiğine göre, [o şöyle demiştir:] \"On/ardan dilediğini geriye bırakır, dilediğini de yanına alırsın. Bir süre ayrıldığın hanım/arından arzu -etiğini tekrar yanına almanda senin için bir günah yoktur,\" ayeti nazil olduktan sonra Hz. Nebi, hanımlarının birinin sırasında diğer bir hanımına gitmek istediği zaman bizlerden izin isterdi. [Hadisin ravilerinden Muaze'den şöyle nakledilmiştir: Hz. Aişe'ye: 'Senden izin istediği zaman ne derdin?' diye sordum. O da şöyle dedi: Ona 'Ey Allah'ın Elçisi! Eğer bu mesele bana bırakılmışsa, sizi başka birine bırakmayı asla tercih etmem!' derdim.\" Fethu'l-Bari Açıklaması: Vahidi, müfessirlerin bu ayetin [Ahzab 51] tahyir ayetinin akabinde nazil olduğu kanaatinde olduklarını nakletmiştir. Şöyle ki; tahyir olayı meydana gelince, Hz. Nebi'in hanımlarından bazıları Allah Resulü Sallallahu Aleyhi ve Sellem'e kendilerini boşayacağı endişesine kapılıp kasm meselesini ona hava le etmişti. Bunun üzerine \"Onlardan dilediğini geriye bırakır, dilediğini de yanına alırsın. Bir süre ayrıldığın hanımlarından arzu ettiğini tekrar yanma almanda senin için bir günah yoktur, \"(Ahzab 51) ayeti nazil oldu. \"Kendilerini Nebi'e hibe eden\" ifadesine göre, kendisini Hz. Nebi'e hibe eden (mehirsiz olarak evlenme teklifinde bulunan) kadınlar birden fazladır. [Bunu gösteren rivayetleri de şu şekilde sıralayabiliriz:] 1- Nikah Bölümü'nde Sehl İbn Saldıdan nakledilen hadiste, \"Bir kadın 'Ey Allah'ın Elçisi! Ben kendimi sana hibe ettim,' dedi. Yine aynı rivayette, kadına talip [olup fakat mehir olarak verecek bir şey bulamayan] adama Allah Resulü Sallallahu Aleyhi ve Sellem şöyle demiştir: Demir bir yüzük dahi olsa, git bir şeyler ara! 2- Enes'ten nakledilen hadis ise şöyledir: \"Bir kadın Nebi'e sallallahu aleyhi ve selle m gelip 'Benim bir kızım var,' dedi. Sonra kızının güzelliklerini sıraladı ve 'Onu sana verdim,' dedi. Allah Res(dü de 'Ben de onu kabul ettim,' diye karşılık verdi. Kadın kızını övmeye devam etti. Hatta 'Onun hiç başı ağrımadı. [Hiçbir şeyden şikayet etmez (Ahmed İbn Hanbel, Hadis no: 12120) bile dedi. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem 'Benim, kızına ihtiyacım yok,' şeklinde karşılık verdL\" Ahmed İbn Hanbel'in naklettiği bu hadiste bahsi geçen kadın, kuşkusuz önceki hadisteki kadından farklıdır. 3- İbn Ebı Hatim, Hz. Aişe'den, onun şu sözünü nakletmiştir: \"Rasulullah'a kendisini hibe eden kadın, Havle bint Hakım'dir.\" Nikah Bölümü'nde bu rivayet hakkında açıklama yapılacaktır. İmam Buhari bu rivayete ta'likan işarette bulunmuştur. 4- Şa'bı kanalıyla şöyle naklediimiştir: \"Kendisini hibe eden kadınlardan biri de, Ümmü Şerlk'tir.\" 5- Nesaı'nin, Urve kanalıyla yaptığı rivayete ve Ebu Ubeyde Mamer İbnu'lMüsenna'nın tespitine göre, \"Kendisini hibe eden kadınlardan biri de, Fatıma bint Şureyh'tir. 6- Leyla bint Hatım'in de kendisini Resulullah'a hibe eden kadınlardan olduğu ileri sürülmüştür. İkrime kanalıyla İbn Abbas'ın şöyle dediği naklediimiştir: \"Hz. Nebi, kendisini ona hibe eden hiçbir kadınla evlenmemiştir.\" Bu rivayet i Taberi tahriç etmiştir. Rivayetin senedi ise hasendir. Bundan maksat şudur: Hz. Nebi, kendisini ona hibe eden hiçbir kadınla birlikte olmamıştır. Halbuki böyle bir birliktelik onun için mübahtı. Çünkü Allah Tea.!a şöyle buyurmuştur: \"Nebi kendisiyle evlenmek istediği takdirde, kendisini Nebie hibe eden mümin kadını, diğer müminlere değil, sırf sana muhsus olmak üzere helal kıldık. \" (Ahzab 50) Bu hadiste Hz. Aişe \"Onlardan dilediğini geriye bırakır ... \" ayetinin sebeb-i nüzulünü açıklamış ve bir önceki ayette geçen \"kendisini Nebie hibe eden mümin kadın\" ile \"Kuşkusuz biz, hanımlan hakkında müminlere neyi farz kıldığımızı biliriz, \"(Ahzab 50) ifadelerine işaret etmiştir. İbn Merduye, İbn Ömer ve İbn Abbas'tan nakledilen hadislerde şu ifadeyi de rivayet etmiştir: \"Nikah ancak bir veli ve iki şahit ile gerçekleşir.\" Hz. Aişe'nin \"Bakıyorum da Rabbin her daim senin arzularını yerine getirmek için çabalıyor,\" sözü şu anlama gelir: \"Bakıyorum da, allah Teala senin isteklerini geciktirmeden, hemen yerine getiriyor. Dilediğin ve tercih ettiğin hükümleri indiriyor.\" \"Onlardan dilediğini geriye bırakır,\" ayeti şu anlama gelir: Kasma riayet etmeden onların sırasını ertelersin. Bu görüş çoğunluğa aittir. Bu görüşü İmam Taberi, İbn Abbas, Mücahid, Hasan-ı Basrı, Katade, Ebu Rezın ve daha bir çok kişiden nakletmiştir. Ayrıca Şa'bı'den bu ayet hakkında şöyle dediğini rivayet etmiştir: \"Kendisini Hz. Nebi'e hibe eden birçok kadın vardı. allah Resulü Sallallahu Aleyhi ve Sellem bunlardan bir kısmı ile evlendi, bir kısmı ile evlenmedi.\" Bu rivayet şazdır. Doğrusu şu ki, biraz önce de ifade ettiğimiz gibi, allah Resulü Sallallahu Aleyhi ve Sellem kendisini hibe eden kadınlardan hiçbiriyle evlenmemiştir. 'Onlardan dilediğini geriye bırakır' ayeti hakkında şöyle bir yorum da yapılmıştır: Sallallahu Aleyhi ve Sellem hanımlarından bazılarını boşamaya yeltenmişti. Bunun üzerine onlar 'Tek bizi boşama da, dilediğin gibi kas m yap!' teklifinde bulundular. Bunun üzerine allah Resulü Sallallahu Aleyhi ve Sellem bazıları arasında eşit kasm yaptı. İşte, ayette geçen \"dilediğini de yanına alırsın\" ifadesiyle bu hanımlar kastedilmiştir. Diğer eşlerine ise dilediği gibi kasm yaptı. İşte bunlar da, geriye bıraktıklarıdır. Özetle ifade edecek olursak, bu ayet hakkında ileri sürülen tefsirleri şu şekil- de sıralayahiliriz: 1- Dilediğini boşar, dilediğinle evliliğini sürdürürsün. 2- Boşamadan bazılarından uzaklaşır, diğerlerine kasm yaparsın. 3- Kendilerini sana hibe eden hanımlardan dilediğin le evlenir, dilediğini reddedersin. Bu bab da zikredilen hadis, bu görüşü ve bir öncekini destekler niteliktedir. Ayetin lafzı ise üç manayı da taşımaya müsaittir. Hz. Aişe'den nakledilen ve Hz. Nebi'in hanımlarından izin istediğini gösteren rivayetin zahiri, Allah Resulü Sallallahu Aleyhi ve Sellem'in hiçbir eşini kasrnın dışında bırakmadığını, yani onlardan uzaklaşmadığını gösterir. Bu görüş Zührı'ye aittir. O bu konuda şöyle demiştir: \"Hz. Nebi'in hanımlarından birini geriye bıraktığını bilmiyorum.\" Bu rivayeti İbn Ebı Hatim nakletmiştir. Katade ise bu ayeti şöyle yorumlamıştır: \"Allah Teala, Nebiini dilediği gibi kasrnda bulunması hususunda serbest bırakmıştır. Ancak o, hepsine eşit davranmıştır.\" Önemli Açıklama Bu ayetten (Ahzab 33/51) sonra gelen \"Bundan sonra artık başka kadınlarla evlenmen, elinin altında bulunan c.ariyeler hariç, güzellikleri hoşunagitse bile, bunların yerine başka hanımlar alman sana helal değildir, \"(Ahzab 52) ayetinde neyin nefyedildiği konusunda ihtilaf vardır. Acaba Rasulullah'a daha önce belirtilen özelliklerden sonra bazı kadınlar helal, bazı kadınlar haram mı kılındı? Yoksa tahyır esnasında evli olduğu kadınlardan sonra, onun diğer kadınlarla evlenmesi mi haram kılındı? İşte bu hususlar tartışmalıdır. Übey İbn Ka'b ve onu takip edenler birinci görüşü benimsemişlerdir. Abdullah İbn Ahmed, Ziy6datu Müsned'de bu görüşü nakletmiştir. İbn Abbas ve ona tabi olanlara göre ise, Allah Resulü'nün hanımları, onu tercih etmelerinden dolayı (mlara verilmiş bir ödüldür.Gerçekten de Hz. Nebi bu olaydan sonra yeni bir evlilik yapmamıştır. Ancak bu durum, mevcut ihtilafı ortadan kaldırmaz. Nitekim Tirmizı ve Nesaı Hz. Aişe'den şöyle nakletmiştir: \"RasuluIlah sallallahu aleyhi ve sellem vefat ettiği zaman, kadınlarla evlenmesi helaldL\" İbn Ebı Hatim de, Ümmü Selerne validemizden buna benzer bir rivayet nakletmiştir)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 311
			}
		}
	]
}