{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4796,
			"arabicnumber": 4796,
			"text": "Aişe radiyallahu anha'dan rivayet edildiğine göre, o şöyle demiştir: \"Hicab ayeti nazil olduktan sonra Ebu Kuays'ın kardeşi Eflah, yanıma girmek için izin istedi. 'Bu konuda Rasulullah Sallallahu Aleyhi ve Sellem’e sormadan ona izin veremem' dedim. Çünkü kardeşi Ebu Kuays beni emzirmemişti. Beni onun hanımı emzirmişti. Derken Allah Resulü Sallallahu Aleyhi ve Sellem yanıma geldi. Ona 'Ey Allah'ın Elçisi! Ebu Kuays'ın kardeşi Eflah yanıma gelmek için izin istedi. Ben de, sana danışıncaya kadar onun gelmesine izin vermedim,' dedim. Nebi Sallallahu Aleyhi ve Sellem de, \"Neden izin vermedin ki! O senin amcan değil mi?\" dedi. Bu defa ona, 'Adam beni emzirmedi, ki, beni Ebu Kuays'ın hanımı emzirdi,' dedim. O da şöyle buyurdu: Ona izin ver. Zira o, senin amcandır. Allah senin haynnı versin. \" Urve şöyle demiştir: Bundan dolayı Hz. Aişe, \"Nesep bağı dolayısıyla evlenilmelerini haram saydığınız kimselerin, emzirme yoluyla da evlenilmelerini haram sayın,\" derdi. Fethu'l-Bari Açıklaması: Burada İmam Buhar! Ebu Kuays'ın kardeşi hakkında Hz. Aişe'den nakIedilen hadisi zikretti. Bu hadisin ayrıntılı açıklaması, \"Emzirme Bölümü\"nde yapılacaktır. Hadiste geçen \"Ona izin ver. Zira o, senin amcandır,\" ifadesi, bir başka hadiste geçen, \"Amca, baba yansıdİr,\" ifadesiyle yan yana getirilince, hadis ile bab başlığı arasında bir uyum olmadığını iddia edenlerin itirazları geçersiz hale gelir. Öyle anlaşılıyor ki İmam Buhari, bu hadisi zikretmekle, kadının, başörtüsü olmadan amcasının ve dayısının yanına çıkmasını hoş karşılamayanlara cevap vermek istemiştir. Nitekim Taberi'nin Davud İbn Ebı Hind kanalıyla İkrime ve Şa'bı'den naklettiğine göre, onlara, \"Neden bu ayette amca ve dayı zikredilmedi?\" diye sorulmuş. Onlar da \"Çünkü amca ve dayı onu oğullarına tavsif eder,\" şeklinde cevap vermişler ve bundan dolayı bir kadının amcasının ve dayısının yanında başörtüsünü çıkarmasını mekruh görmüşlerdir. Eflah olayını anlatan Hz. Aişe hadisi İkrime ve Şa'bt'nin görüşünü çürütmektedir. Burada İmam Buharl'nin bab başlıklarında sergilediği bir incelik söz konusudur",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 318
			}
		}
	]
}