{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4800,
			"arabicnumber": 4800,
			"text": "Bize Amr ibnu Dînâr tahdîs edip şöyle dedi: Ben İkrime'den işittim, şöyle diyordu: Ben Ebû Hureyre (radıyallahü anh)'den işittim, şöyle diyordu: Şübhesiz Allah'ın Peygamberi (sallallahü aleyhi ve sellem) şöyle buyurdu: ''Allah gökyüzündeki meleklere bir emrin yerine getirilmesini hükmettiği zaman, Allah'ın düz bir taş üstünde (hareket ettirilen) zincir (sesi) gibi mehâbetli olan bu ilâhî hükme melekler tamâmiyle boyun eğerek (korku ile) kanatlarını birbirine vururlar. Gönüllerinden bu korku giderilince de melekler Cebrail ve Mîkâîl gibi mukarreb (yani Allah'a yaklaştırılmış) meleklere: Rabb'iniz ne söyledi? Diye sorarlar. Onlar da sorana: Allah hakkı söyledi, O çok yücedir, çok büyüktür! Derler. suretle kulak hırsızı şeytânlar Allah'ın o emr ve takdirini işitirler. O sırada kulak hırsızı şeytânlar (yerden göğe kadar) birbirinin üstünde zincirleme dizilmiş (ve kulak hırsızlığına hazırlanmış) bulunurlar. -Sufyân ibn Uyeyne avucunu çevirip parmaklarının arasını ayırdı da bu dizilişi avucuyla vasıfladı.- Şeytânlar bu vaziyette iken en üstteki şeytân meleklerin o konuşmasını işitir de hemen onu altındakine atar, sonra diğeri de o sözü kendinden aşağıdakine atar, nihayet en aşağıdaki o sözü sihirbazın yahut kâhinin diline atar. Bâzı defa meleklerin konuşmasını işiten en üstteki şeytâna bir ateş parçası yetişip, altındaki şeytâna o haberi atıp işittirmeden onu yakar. Bazen de ateş kendisine erişmeden önce o haberi altındaki şeytâna atıp ulaştırır. Artık o haberi alan sihirbaz kimse, bu haberin beraberinde yüz yalan daha uydurur (insanlara söyler ve ilâhî emir yeryüzünde gerçekleşince insanlar tarafından): O bize fulan günü, şöyle şöyle ve şöyle demiş değil miydi? Diye söylenir de, böylece şeytânın gökyüzünden işitmiş olduğu o kelime sebebiyle sihirbaz yahut kâhin kişi doğrulanır\" Allah'ın Şu Kavli: “O, çetin bir azâbdan evvel bunu size haber veren (bir peygamberden başkası) değildir\" (Âyet: 46)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 322
			}
		}
	]
}