{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4810,
			"arabicnumber": 4810,
			"text": "İbn Abbas r.a.'den rivayet edildiğine göre, şirk ehlinden bir grup insan, adam öldürmüş, hem de birçok cana kıymış, zina etmiş, zinada da ileri gitmişti. Nihayet Hz. Muhammed (Sallallahu Aleyhi ve Sellem)’e geldiler ve \"Senin söylediklerin ve davet ettiğin yol güzel... Bize bir haber versen ... Şu yaptıklarımızın bir keffareti var mı?\" dediler . Bunun üzerine Allah Teala şu iki ayeti indirdi: \"Yine onlar ki, Allah ile beraber (tuttukları) başka bir ilaha yalvarmazlar, Allah'ın haram kıldığı can’a haksız yere kıymazlar ve zina etmezler, \" \"Ey kendi nefisleri aleyhine haddi aşan kullarım! Allah'ın rahmetinden ümit kesmeyin!\"(Zumer 53) Fethu'l-Bari Açıklaması: İmam Buhari bu başhk altında İbn Abbas'tan rivayet edilen yukarıdaki ha disi verdi. Taberani'nin başka bir senetle İbn Abbas'tan aktardığı rivayete göre, Hz. Nebi'e bu konuda soru soran Hz. Hamza'nın katili Vahşı İbn Harb'dir. Onun sorusu üzerine şu ayet nazil oldu: \"Ancak tevbe ve iman edip iyi davranışta bulunanlar başkadır.\" Vahşı: \"Bu, ağır bir şarttır,\" dedi. Bunun üzürine \"Ey kendi nefisleri aleyhine haddi aşan kullanml\"(Zumer 53) ayeti indi. İbn İshak Siyer adlı eserinde şöyle demiştir: Nafi', İbn Ömer kanalıyla bana Ömer'in şöyle söylediğini nakletti: \"Ben, Ayyaş İbn Ebı Rabıa ve Hişam İbnu'lAss Medıne'ye gitmek üzere hazırlandık.\" Sonra İbn İshak onların hikayelerini ve arkadaşının dönüşüne ilişkin rivayeti zikretti ve bunun üzerine ayetin indiğini belirtti. Rivayete göre Hz. Ömer bu ayeti yazıp Hişam'a göndermiştir. Taberanl'nin rivayetine göre, insanlar Hz. Nebi'e \"Ey Allah'ın Elçisi! Biz de Vahşı'nin yaptıklarını yaptık,\" diyerek durumlaını arz etmişler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuş: \"Bu ayet bütün Müslümanlar hakkında geçerlidir.\" Yine Taberani Mu'cemu'l-evsat adlı eserinde Sevban'dan şu hadisi aktarmıştır: Allah Resulü Sallallahu Aleyhi ve Sellem'i şöyle derken işittim: \"Ey kendi nefisleri aleyhine haddi aşan kullanm!\" (Zumer 53) ayeti, dünya ve içindekilerden bana daha sevimlidir. Bunun üzerine biri \"Ya şirk koşanlar [da bu ayetin hükmüne dahil mi?] ... \" diye sordu. Allah Resulü bir müddet sustu ve üç kez \"şirk koşanlar da\" buyurdu .. Bu ayetin umumiliği, ister kul hakkı olsun, ister olmasın, küçüğüyle büyüğüyle bütün günahların bağışlanacağına delil getirilmiştir. Ehl-i sünnette meşhur olan görüşe göre; günahların tamamı tevbe ile bağışlanır. Allah'ın dilediği kimselerin günahları tevbe etmeden ölseler de affedilir. Ancak her ne kadar bir daha kul hakkına girmeyeceğine dair tevbe eden kimseye, bu tevbesi kul hakkını ihlal etme suçundan dolayı fayda sağlasa da, birinin kul hakkına girmişse, mutlaka o hakkı iade etmesi veya ondan helallik alması gerekir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 332
			}
		}
	]
}