{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4855,
			"arabicnumber": 4855,
			"text": "Mesruk'un şöyle söylediği rivayet edilmiştir: Hz. Aişe'ye \"Ey Anneciğim! Hz. Muhammed Rabbini gördÜ mü?\" diye sordum. O da şöyle cevap verdi: \"Bu sözlerin yüzünden tüylerim diken diken oldu! Şu üç hususu nasıl bilmezsin! Kim sana şu üç konuda bir şeyler anlatırsa, bil ki o yalan söylemiştir. 1- Her kim sana Muhammed Sallallahu Aleyhi ve Sellem'in Rabbini gördüğünü söylerse, bil ki o yalan söylemiştir.\" Sonra Hz. Aişe şu ayetleri okudu: \"Gözler O'nu göremez; halbuki O, gözleri görür. 0, eşyayı pek iyi bilen, her şeyden haberdar olandır, \" \"Allah bir insanla ancak vahiy yoluyla veya perde arkasından konuşur. \" 2- \"Her kim Muhammed Sallallahu Aleyhi ve Sellem'in yarın ne olacağını bildiğini söylerse, bil ki o yalan söylemiştir.\" Sonra Hz. Aişe şu ayeti okudu: \"Hiç kimse yarın ne kazanacağın! bilemez. \"(Lukman 34) 3- \"Her kim Muhammed Sallallahu Aleyhi ve Sellem'in vahiyden bir şey gizlediğini söylerse, bil ki o yalan söylemiştir.\" Sonra Hz. Aişe: \"Ey Resul! Rabbinden sana indirileni tebliğ et, \"(Maide 67) ayetini okudu ve şöyle dedi: Fakat Hz. Nebi aslı suretinde CebralI'i iki kez görmüştür. Fethu'l-Bari Açıklaması: Tirmizı'nin rivayetinde bu hadisin baş tarafında bir ziyade bulunmaktadır. İmam Tirmizi, Mücalid kanalıyla Şa'bı'nin şöyle söylediğini nakletmiştir: \"İbn Abbas Arafat'ta Ka'b ile karşılaştı ve ona bir konu hakkında soru sordu. Birden Ka'b [u'l-ahbar] tekbir getirdi, sesi dağlarda yankılandı. İbn Abbas: 'Biz HaşimoğullarıylZ. (Bilgi ve kültürümüz yerindedir. Bu kadar hayret edilecek bir şeyi sormayız)' dedi. Bunun üzerine Ka'b ona şu şekilde cevap verdi: Allah Teala görülmesini ve kelamını Musa ile Muhammed arasında paylaştırdı ... \" Abdurrezzak İbn Hemmam'ın aynı senetle aktardığı rivayette ise İbn Abbas'ın \"Biz Haşimoğullarıyız. Muhammed'in sallalliihu aleyhi ve sellem iki defa Rabbini gördüğünü söylüyoruz\" dediği, Ka'b'ın da bunun üzerine tekbir getirip şöyle söylediği anlatılmıştır: \"Allah Teala görülmesini ve kelamını Musa ile Muhammed arasında paylaştırmıştır. İki defa Musa ile konuşmuş; iki defa da Muhammed'e sallalliihu aleyhi ve sellem görünmüştür.\" Bu rivayetıere göre, olayın bundan sonraki kısmında Mesrlık şöyle demiştir: \"Hz. Aişe'nin yanına gittim ve ona 'Muhammed sallalliihu aleyhive sellem Rabbinigördü mü?' diye sordum ... \" Hz. Aişe, Allah'ın görülmekten münezzeh olduğuna, böyle bir şeyin gerçekleşmesinin mümkün olmadığına inandığı için ve içinde bulunan Allah saygısından dolayı tüylerinin diken diken olduğunu söylemiştir. İmam Nevevı şöyle demiştir: \"Hz. Aişe merfO' bir hadise dayanarak Hz. Nebi'in Rabbini görmediğini söylememiştir. Şayet böyle bir hadis bilseydi mutlaka onu söylerdi. Kuşkusuz Hz. Aişe, ayetin zahirinden anladıklarından çıkardığı bir yoruma dayanmıştır. Halbuki onun dışındaki sahablIer kendisinden farklı düşünmektedirler. Bir sahabi bir görüş belirtir, diğer sahablIer ona muhalif olurlarsa, onun bu sözü ittifakla delil olmaz. Kaldı ki, ayette geçen .......idrak'ten maksat kuşatmaktır. Kuşatmanın olmayacağının belirtilmesi görmenin olmayacağı anlamınagelmez.\" Nevevi, En'am 103 te geçen .........la tudrikuhu'l-ebsar ifadesini kastetmektedir. İmam Nevevı, İbn Huzeyme'yi takip ederek Hz. Aişe'nin merfu' bir hadise dayanarak Muhammed'in sallalliihu aleyhi ve sellem Rabbini görmediğini söylemediğini kesin bir dille ifade etmiştir. Nitekim İbn Huzeyme \"Sahıh\"inin \"Kitabu't-tevhıd\" bölümünde şöyle demiştir: \"Hz. Aişe'nin Hz. Muhammed'in Rabbini görmediğini söylemesi kesin bir bilgi değildir. Çünkü Hz. Aişe Hz. Nebi'in kendisine Rabbini görmediğini anlattığını söylememiş, sadece ayet i yorumlamıştır.\" Bu sözler son derece hayret uyandırmaktadır. Çünkü Nevevı'nin şerhetti'ği İmam Müslim'in \"Sahıh\"inde Hz. Aişe'nin Allah Restı!ü'nden bunu duyduğu nakledilmiştir. Müslim'in \"Sahıh\"inde Davud İbn Ebı Hind ve Şa'bı kanalıyla MesrCık'un şöyle söylediği rivayet edilmiştir: Yanım üzere yatıyordum. Derken doğruldum ve Hz. Aişe'ye \"Allah Teala 'Andolsun ki; onu bir de diğer inişte görmüştü, '(Necm 13) buyurmuyor mu?\" dedim. ° da şu şekilde cevap verdi: Bu konuyu bu ümmet içinde Nebi'e soran ilk kimse benim. Allah Resulü Sallallahu Aleyhi ve Sellem bu ayette kesinlikle Cebrall'in kastedildiğini söylemişti. Hz. Aişe'nin yukarıdaki ayeti [el-En'am 6/103] delil olarak kullanmasına İbn Abbas muhalefet etmiştir. Tirmizı, Hakem İbn Eban ve İkrime'den şöyle nakIetmiştir: İbn Abbas: \"Hz. Muhammed Rabbini görmüştür,\" dedi. Ben de; \"Allah Teala 'Gözler O'nu göremez; halbuki 0, gözleri görür. o, eşyayı pek iyi bilen, her şeyden haberdar olandır, '(En'am 103) buyurmuyor mu?\" diyerek karşılık verdim. Bunun üzerine o şöyle dedi: \"yazıklar olsun sana ... Bu ayetteki durum, Allah Teala'nın kendi nuru ile tecelli etmesi durumunda geçerlidir. Halbuki Hz. Muhammed iki defa Rabbini görmüştür.\" Özetle ifade edecek olursak; ayette [el-En'am 6/103] Allah Teala'nın hiç görülmeyeceği değil, görüldüğü zaman tam olarak kuşatılmasının mümkün olmayacağı ifade edilmiştir. Kadı lyaz şöyle demiştir: \"Allah Teala'nın görülmesi aklen mümkün olup ahirette müminler tarafında görüleceği konusunda sahıh rivayetler mevcuttur. Allah'ın dünyada görülmesi konusunda ise İmam Malik şöyle demiştir: 'Allah Teala dünyada görülmemiştir. Çünkü 0, bakidir. Baki olanı fani olan göremez .. Müminler ahirete irtihal edip baki gözler ile rızıklandırılınca, baki olan ile Baki olanı göreceklerdir.' İmam Malik'in bu sözü, Allah'ın görülmesinin kudret bakımından imkansız olduğu anlamına gelmez. Allah Teala kullarından kimin görmesini dilerse, o kimse için Allah'ı görmek imkansız olmaz.\" İmam Müslim'in \"Sahıh\"indeki şu ifadelerin yer aldığı merfCı' bir hadis bunu desteklemektedir: \"Bilin ki, ölünceye kadar Rabbinizi göremezsiniz.\" Bu rivayeti İbn Huzeyme Ebu Ümame'den nakletmiştir. Selef Hz. Nebi'in Rabbini görüp görmediği konusunda farklı görüşler ileri sürmüştür. Hz. Aişe ve İbn Mes'ı1d Hz. Nebi'in Rabbini gördüğünü kabul etmemiş, bir grup sahabi ise bunu kabul etmiştir. Abdurrezzak İbn Hemmam, Ma'mer kanalıyla Hasan-ı Basri'nin Hz. Nebi'in Rabbini gördüğüne dair yemin ettiğini nakletmiştir. İbn Huzeyme, Urve İbnü'z-Zübeyr'in Hz. Nebi'in Rabbini gördüğünü kabul ettiğini rivayet etmiştir. O, Hz. Aişe'nin bunu inkar ettiği kendisine söylendiği zaman şiddetli tepki gösterirdi. İbn Abbas'ın öğrencileri de bu görüştedir. Ka'bu'I-Ahbar, Zühri, Ma'mer ve daha başkaları kesin bir dille bu görüşü dile getirmişlerdir. \"Acaba Hz. Nebi Rabbini gözüyle mi gördü, yoksa kalbi ile mi?\" Hz. Nebi'in Rabbini gördüğünü söyleyenler de kendi aralarında bu konuda ihtilafa düşmüşlerdir. Ahmed İbn Hanbel'den her iki görüş de nakledilmiştir. Bu konuda İbn Abbas'tan mutlak ve mukayyed rivayetler nakledilmiştir. Bu rivayetler, mutlak olanlar mukayyed olanlara hamledilerek anlaşılır. Söz konusu rivayetlerden birini Nesai, İkrime kanalıyla İbn Abbas'tan sahih bir senetle nakIetmiş, Hakim de bunun sahih olduğunu ifade etmiştir. Buna göre İbn Abbas şöyle demiştir: \"Halilliğinidostluğun İbrahim'e, konuşmanın Musa'ya ve görülmenin Muhammed'e sallalliihu aleyhi ve sellem ait olmasına hayret mi ediyorsunuz?\" İbn Huzeyme bı' rivayeti şu laflZlarla nakletmiştir: \"Allah Teala'nın İbrahim'i halilliğe seçmesine hayret mi ediyorsunuz ... \" İbn İshak'ın Abdullah İbn Ebi Seleme'den naklettiği rivayete göre, Abdullah İbn Ömer, İbn Abbas'a bir elçi gönderip \"Hz. Muhammed Rabbini gördü mü?\" diye sordurmuş, o da \"evet\" cevabını yollamıştır. Bu konudaki bir başka rivayet ise İmam Müslim tarafından nakledilmiştir. Ebu'l-Niye kanalıyla yapılan bu rivayete göre, İbn Abbas \"Gözünün gördüğünü gönlij yalanlamadı, \"(Necm 10) ayeti hakkında \"Muhammed sallalliihu aleyhi ve sellem kalbi ile Rabbini iki defa görmüştür,\" demiştir. Yine İmam Müslim, Ata kanalıyla İbn Abbas'ın \"Onu kalbiyle gördü,\" dediğini nakletmiştir. Bundan daha açık olan rivayet ise, İbn Merdı1ye'nin Ata kanalıyla İbn Abbas'tan aktardığı şu rivayettir: \"Hz. Nebi Rabbini gözü ile görmedi, O'nu kalbi ile gördü.\" Buna göre, İbn Abbas'ın kabul ettiği, Hz. Aişe'nin ise reddettiği Allah'ın Hz. Nebi tarafından görülmesi hakkındaki görüşleri uzlaştırmak mümkündür. Şöyle ki; Hz. Aişe, Hz. Nebi'in Rabbini görmediğini söylerken, onun göz ile O'nu görmediğini; İbn Abbas da, Hz. Nebi'in Rabbini gördüğünü söylerken, onun kalp ile O'nu gördüğünü kastetmiştir. Allah'ın kalp ile görülmesinden maksat, bizzat kalp ile görülmesidir, sadece bilginin hasıl olması değildir. Çünkü Hz. Nebi her zaman Allah'ı bilen biri idi. Hz. Nebi'in kalbi ile Rabbini gördüğünü söyleyenlere göre bu görme, normal görmenin gözde yaratıldığı gibi, kalpte yaratılmıştır. Her ne kadar görme gözde yaratılsa da, görmenin gerçekleşmesi için belli bir şart ileri sürülmemiştir. İbn Huzeyme kavi bir senetle Enes'in şöyle söylediğini rivayet etmiştir: \"Hz. Muhammed Rabbini gördü.\" İmam Müslim'in rivayetine göre, Ebu Zerr Hz. Nebi'e Rabbini görüp görmediğini sormuş, o da şu şekilde cevap vermiştir: \"O bir nurdur. Nasıl göreyim?.\" Ahmed İbn Hanbel de Ebu Zerr kanalıyla Hz. Nebi'in şöyle buyurduğunu rivayet etmiştir: \"Ben bir nur gördüm.\" İbn Huzeyme de Ebu Zerr'in şöyle söylediğini rivayet etmiştir: \"Hz. Peygmaber Rabbini gözüyle görmedi, kalbi ile gördü.\" Bu söz ile Ebu Zerr'in nur kelimesini kullanmasındaki gaye ortaya çıkmıştır. O, nurun Hz. Nebi'in gözü ile Rabbini görmesine engelolduğunu ifade etmiştir. Kurtubi, \"el-Müfhim\" adlı eserinde bu konuda tevakkuf etme görüşünün daha isabetli olduğunu söylemiş ve bunu büyük alimlerden bir gruba dayandırmış, ayrıca bu konuda kesin bir delil olmadığını belirterek bu görüşü desteklemiştir. Bu konuda iki görüş benimseyen tarafların delil olarak getirdiği naslar, birbirleri ile çatışah ve tevile açık olan lafızların zahirleridir. Kurtubi şöyle demiştir: \"Bu konu ameli bir mesele olmadığı için, burada zanni deliller yeterli olmaz. Bu konu itikadi konulardandır ve burada kesinlikle kat'i delillerin bulunması gerekir.\" İbn Huzeyme \"Kitabu't-tevhid\"inde Hz. Nebi'in Rabbini gördüğünü söyleyenlerin görüşünü tercihe yönelmiştir. Burada yer veremeyeceğimiz kadar uzun bir şekilde bu görüşün delillerini sıralamıştır. İbn Abbas'ın Hz. Nebi'in Rabbini iki defa gördüğü sözünü ise, görme hadisesininden birinin göz ile diğerinin kalp ile gerçekleştiği şeklinde açıklamış ve bu konuda aktardığı bilgilerin ikna edici olduğunu söylemiştir. Hz. Nebi'in Rabbini gördüğünü söyleyen alimlerden biri de Ahmed İbn Hanbel'dir. O \"Kitabu's-sünne\"de bu konunun ihtilaflı olduğunu nakletmiştir. Mervzi'den şöyle rivayet edilmiştir: Ahmed İbn Hanbel'e, Hz. Aişe'nin \"Kim Muhammed'in Sallallahu Aleyhi ve Sellem Rabbini gördüğünü söylerse, bilin ki o, Allah'a karşı en büyük iftirada bulunmuştur,\" dediğini söyledim ve onun bu sözüne nasıl cevap verileceğini sordum. O da; \"Hz. Nebi'in 'Rabbimi gördüm,' sözü ile cevap verilir. Hz. Nebi'in sözü Hz. Aişe'nin sözünden üstündür,\" dedi. \"el-Hedyu\" adlı kitabın yazarı, Ahmed İbn Hanbel'in Hz. Nebi'in Allah'ı gözü ile gördüğünü iddia edenleri reddetmiş ve Ahmed İbn Hanbel'in bir defasında Hz. Muhammed'in Rabbini gözü ile gördüğünü, bir defasında da kalbi ile gördüğünü ifade ettiğini söylemiştir. Daha sonra da şunları eklemiştir: \"Alimlerin İsra olayının uykuda gerçekleştiği görüşü ile Allah Resulü Sallallahu Aleyhi ve Sellem'in bedeni ile değil sadece ruhu ile İsra olayının gerçekleştiği görüşü arasında fark bulunduğunu bilmek gerekir. Çünkü ikisinin arasında bir fark vardır. Şöyle ki; uykudaki birinin, ruhunun semaya yükselmesi ile gördükleri hakikat olabilir. Ukudaki kimse ruhu hiçbir şekilde semaya yükselmeden de bir takım olayları görebilir. Bu bakımdan Hz. Nebi'in ruhuyla İsra olayını yaşadığını, vücudunun ise semaya yükselmediğini söyleyenler muhtemelen bir mucize eseri olarak Hz. Nebi'in ruhunun gerçekten göğe yükseltildiğini, sonra olduğu yerde duran bedenine döndüğünü kastetmişlerdir. Nitekim o gece başka mucizeler demeydana gelmişti. Mesela; Allah Resulü'nün uyanıkken kalbi açılmış ve tekrar birleştirilmişti. Bütün bunlar olurken Hz. Nebi en hafif bir acı bile hissetmemiştir. \" İsra konusunda nakledilen rivayetlerin zahiri bu görüş ile çelişmektedir. Aksine İsra olayı Hz. Nebi'in hem ruhu, hem de bedeni ile birlikte gerçekleşmiştir. O, hem ruhu, hem de bedeni uyurken ya da dalgın iken değil, uyanıkken gerçekten göğe yükseltilmiştir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 376
			}
		}
	]
}