{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4860,
			"arabicnumber": 4860,
			"text": "Ebu Hureyre'den rivayet edildiğine göre, Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim yemin eder ve yemininde 'Lat ve Uzza hakkı için' derse, hemen la ilahe illallah desin. Kim de arkadaşına 'haydi gel, kumar oynayalım' derse, hemen sadaka versin.\" Hadisin geçtiği diğer yerler: 6107, 6301, 6650. Fethu'l-Bari Açıklaması: Hattabı şöyle demiştir: \"Yemin, ancak derin saygı duyulan ma'bud ile yapılır. Şayet biri Lat ve buna benzer putlara yemin ederse kafirlere benzer ve hemen kendisine kelime-i tevhid ile bu hatasını telafi etmesi emredilir.\" İbnu'l-Arabı de şöyle demiştir: \"Kim ciddı olarak putlara yemin ederse, kafir olur. Şayet bilmeden veya gaflet anında onlara yemin ederse, la ilahe illailah demesi gerekir. Bu sözü Allah Teala onun günahına keffaret sayar. O da kalbini gafletten kurtarıp Allah'ı zikre yöneltir, dilini de doğruya alıştırır ve kendisinden sadır olan boş sözlerden kendisini kurtarır.\" Hattabı şöyle demiştir: \"Hadiste geçen 'hemen sadaka versin' ifadesi ile kişinin kumar oynamayı düşündüğü mal kastedilmiştir. Bu ifade ile kişinin ağzından çıkan bu sözüne keffaret olması için herhangi bir sadaka vermesinin kastedildiği de ileri sürülmüştür.\" Hattabı'nin bu son görüşü hakkında Nevevı şöyle demiştir: . \"Bu görüş daha doğrudur. Müslim'in rivayetinde geçen 'Sadaka olarak bir şey versin' ifadesi buna delalet etmektedir.\" Bazı Hanefı alimleri putlara yemin eden kimselerin mutlaka yemin keffareti vermeleri gerektiğini söylemişlerdir ki, bu son derece tartışmaya açıktır. Kadı Iyaz şöyle demiştir: \"Bu hadise göre, akla gelen isyan düşüncelerinin aksine Allah'a isyanı düşünmek, kalbe yerleştiği takdirde günahtır.\" Kadı Iyaz'ın bu onuca nasıl ulaştığını bir türlü idrak edemedim. Kaldı ki, hadiste açıkça sözün telaffuz edildiği ifade edilmiştir. Şöyle ki; kişi arkadaşına \"Haydi gel, kumar oynayalım\" demiştir. Böylece onu Allah'a isyana çağırmıştır. Kumar, ittifakla haramdır. Kumara çağırmak da haramdır. Öyleyse burada sadece bir düşünce ve karar verme yoktur. Bu hadisin geri kalan açıklamaları \"Kitabu'l-eyman ve'n-nüzur\" bahsinde yapllacaktır. (Kitabu'l-eyman ve'n-nüzur 5)",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 381
			}
		}
	]
}