{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4890,
			"arabicnumber": 4890,
			"text": "Hasan İbn Muhammed İbn Ali'nin, Hz. Ali'nin katibi Ubeydullah İbn Ebı Rafi'in şöyle söylediğini işittiği rivayet edilmiştir: Hz. Ali'nin şöyle dediğini duydum: Allah Resulü Sallallahu Aleyhi ve Sellem beni, Zübeyr'i ve Mikdad'ı bir göreve gönderdi ve şöyle dedi: ''Ravza-i hah bölgesine varıncaya kadar yola devam edin. Orada yanında mektup olan ve Medine'den Mekke'ye giden bir kadın olacak. Ondan mektubu alın!\" Bunun üzerine biz yola çıktık, at sırtında ilerledik. Nihayet Ravza bölgesine vardık. Bir de ne görelim, Medıne'den Mekke'ye giden kadın orada ... Hemen ona \"Mektubu çıkart\" dedik. Kadın: \"Bende herhangi bir mektup yok!\" diye karşılık verdi. Ona; \"Allah'a yemin olsun ki, ya sen mektubu çıkartırsın ya da biz elbiselerini çıkartırız,\" dedik. Bunun üzerine kadın saç örgüsünün arasından mektuu çıkartp [bize verdi. Mektubu alıp] ab:r'e :allaııahu aleyhi ve sellem geldık. Bır de ne ile karşılaşalım ... Mektubun başında Hatıb ibn Ebi Beltea'dan Mekke'deki Müşrik insanlara\" yazıyor. Hatıb bu mektup ile Nebi Sallallahu Aleyhi ve Sellem'in bir durumunu müşriklere haber veriya u. Bunun üzerine Hz. Nebi ona; - Ey Hatıb bu nedir? diye sordu. Hatıb: - Ey Allah'ın elçisi! Hakkımda hemen acele karar verme! Ben Kureyş'ten biriydim. Ancak onlar ile soy bağım yoktu. Senin yanında olan muhacirlerin Mekke'de ailelerini ve mallarını koruyacak akrabaları var. Ben de nesep bağı bakımından eksiğimi onlara bir güzellik yaparak telafi etmek istedim ve onların akrabalarımı korumalarını sağlamaya çalıştım. Bunu, inkar ettiğim ve dinimden döndüğüm için yapmadım, dedi. Bunun üzerine Hz. Nebi orada bulunanlara; - O, size karşı doğru söyledi, dedi. Yine de Hz. Ömer: - Ey Allah'ın elçisi! İzin ver de şunun boynunu vurayım! dedi. Bunun üzerine Allah Resulü Sallallahu Aleyhi ve Sellem ona hitaben şöyle buyurdu: - O, Bedir Savaşı'na katılmıştır. Nereden bileceksin, belki de Allah TealCı Bedir mücahidlerinin her hallerine muttali olup \"Dilediğinizi yapın! Sizin günahlarınızı bağışladım,\" buyurmuştur. Amr şöyle demiştir: Onun hakkında \"Ey iman edenler! Eğer benim yolumdu savaşmak ve rızamı kazanmak için çıkmışsanız, benim de düşmanım, sizin de düşmanınız olanlara sevgi göstererek, gizli muhabbet besleyerek onları dost edinmeyin, \"(Mümtehıne 1) ayeti indi. Ravi Süfyan İbn Uyeyne şöyle demiştir: \"Bu ayet, hadisin bir parçası mı yoksa Amr'ın sözü mü? Bunu bilmiyorum.\" Fethu'l-Bari Açıklaması: Hatıb aslen Kureyş kabilesinden değildi, hılf yoluyla bu kabileye katılmıştı. Hz. Nebi'in, mazeret olarak söylediği sözlerinde Hatıb'ın doğru olduğunu belirtmesine rağmen Hz. Ömer'in onun boynunu vurmak için izin istemesi, .onun dini konulardaki hassasiyetinden ve nifaka nispet edilen kimselere olan buğzundan kaynaklanmıştır. Ayrıca Hz. Ömer, Hz. Nebi'e muhalefet edenlerin öldürülmesi gerektiğini düşünüyordu, ancak bu konuda kesin bir kanaata sahip değildi. Bu yüzden Hatıb'ı öldürmek için izin istemiştir. Hatıb dışa yansıttıklarının tersini içinde taşıdığı için Hz. Ömer ona münafık demiştir. Hatib söylediklerini bir mazeret olarak ileri sürmüştü. Zaten bu yaptığını da, herhangi bir zararı olmadığını düşünerek yapmıştı. \"Dilediğinizi yapın! Sizin günahlarınızı bağışladim,\" ifadesi ile Bedir mücahidlerinin günahlarının ahirette bağışlanması kastedilmiştir. Sözgelimi onlardan biri dünyada haddi gerektiren bir suç işleseydi, dünyada cezasız bırakılmazdı. İbnu'l-Cevzı şöyle demiştir: \"Burada geleceğe yönelik bir durum değil, geçmişe yönelik bir durum kastedilmiştir. Bu durumda cümlenin anlamı şu şekilde takdir edilir: 'Ne yaparsanız yapın elbette bağışlandı.' Şayet geleceğe yönelik olsaydı, cümlenin anlamı şu şekilde takdir edilirdi: 'Ne yaparsanız yapın, elbette sizi bağışlayacağım.' Şayet cümle bu anlama gelseydi, bağışlanma bütün zamanlarda işlenen günahları kapsardı ki, bu da doğru değildir. Çünkü birçok sahabi Bedir savaşından sonra cezalandırılmaktan endişe etmişti. Mesela; Hz. Ömer Huzeyfe'ye 'Allah aşkına! Münafıklar listesinde ben de var mıyım?' diye sormuştur.\" Kurtubi onun bu yorumuna şu şekilde itiraz etmiştir: \"Hadiste geçen ..........i'melu (yapın!) ifadesi emir kipindedir. Emir kipi de gelecek zaman için kullanılır. Araplar ister karine ile olsun, isterse karinesiz olsun emir kipini geçmiş zaman için kullanmazlar. Çünkü emirde, bir şeyin yokken yapılması ve başlangıç söz konusudur. Hadiste geçen ...........i'melu ma şi'tum ifadesi, fiilin yapılmasının talep edilmesi şeklinde anlaşılır. Dolayısıyla bunun geçmiş zamana hamledilmesi doğru değildir. Buradaki emir kipi, gereklilik şeklinde anlaşılamaz. Dolayısıyla burada ibaha anlamı kesinlik kazanmıştır. Bu cümlede Bedir mücahidlerine verilen bir değer söz konusudur. Ayrıca bu cümle, onların geçmiş günahlarının bağışlanmasına vesile olan ve gelecekte işleyecekleri günahları açısından kendilerini bağışlanmaya layık hale getiren bir durumlarının olduğu anlamını içermektedir. Bir şeyin uygun olması, o şeyin gerçekleştiği anlamına gelmez. Allah Teala herhangi bir kimse hakkında haber veren Nebiini hep doğru çıkarmıştır. Bedir mücahidleri de son nefeslerine kadar Cennet ehlinin amellerini işlemeye devam etmişlerdir. İçlerinden bazılarının günah işlemesi takdir edildiyse bile hemen o kimseler tevbeye sağınmışlar ve ideal yolda ilerlemeye özen göstermişlerdir. Onların biyografilerine vakıf olanlar bu durumu kesin biçimde bilirler.\" \"Dilediğinizi yapın! Sizin günahlarınızı bağışladım,\" ifadesi ile Bedir Mücahidlerinin günahlarının bağışlandığı kastediimiş olabilir. Yoksa bu ifade ile onların günah işlemedikleri kastedilmemiştir. \\ Mistah, Bedir Savaşı'na katılmıştı. Nur Suresi'nin tefsirinde geçtiği gib.L.tIzI Aişe hakkında günaha girmişti. Öyle anlaşılıyor ki, Allah Teala, Bedir Mücahidlerine verdiği değerden dolayı Nebiinin dili ile onları müjdelemiş, hangi günahı işlerlerse işlesinler bağışlanacaklarını onlara haber vermiştir. Bu konunun bazı bölümleri Kadir Gecesi'nden bahsedilirken Kitabu's-sıyam'ın sonlarında incelenmişti. Hadisin geri kalan kısmı Kitabu'd-diyatbölümünde açıklanacaktır. Hz. Ömer'in Hatıb'ı öldürmek için izin istemesi, Müslüman bile olsa casusun öldürülmesinin meşruiyetine delil olarak getirilmiştir. Bu görüş, İmam Malik ve ona tabi olanlara aittir. Hz. Nebi'in, Hz. Ömer'in Hatıb'ı öldürme arzusu karşısında takrirde bulunması bu olayın söz konusu görüşe delil olmasını sağlamıştır. Ancak burada Hz. Ömer'in Hatıb'ı öldürmesine bir engel vardı, o da Hatıb'ın Bedir Savaşı'na katılması idi. Bu şart Hatıb'ıın dışında düşman tarafına bilgi sızdıran kimselerde yoktu. Şayet Müslümanlık casusun öldürülmesine engel olsaydı, Hz. Nebi bundan daha özel bir nedeni Hfıtıb'ın öldürülmemesi için gerekçe olarak dile getirmezdi",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 410
			}
		}
	]
}