{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4891,
			"arabicnumber": 4891,
			"text": "Urve'den rivayet edildiğine göre, Nebi Sallallahu Aleyhi ve Sellem'in eşi Hz. Aişe ona şunları anlatmıştır: Allah Resulü Sallallahu Aleyhi ve Sellem hicret ederek kendisine gelen mu'min hanımları şu ayet ile imtihan ederdi: Ey Nebi! İnanmış kadınlar, Allah'a hiçbir şeyi ortak koşmamak, hırsızlık yapmamak, zina etmemek, çocuklarını öldürmemek, elleriyle ayakları arasında bir iftira uydurup getirmemek, iyi işi işlemekte sana karşı gelmem ek hususunda sana biat etmeye geldikleri zaman, onları biatlarını kabul et ve onlar için Allah'tan mağfiret dile. Şüphesiz Allah, çok bağışlayandır, çok esirgeyendir. (Mümtehine 12) Urve Hz. Aişe'nin şöyle söylediğini aktardı: Bu şartları kabul eden mu'min kadınların hepsine Allah Resulü Sallallahu Aleyhi ve Sellem \"Sözlü olarak senin biatını kabul ettim\" dedi. Allah'a yemin olsun ki, biat esnasında Allah Resulü'nün eli hiçbir kadıriın eline değmedi. Allah Resulü Sallallahu Aleyhi ve Sellem kadınların biatını, sadece \"Bu esaslar üzerine senin biatını kabul ettim\" sözü ile kabul etti. Fethu'l-Bari Açıklaması: Alimler bu ayetin [Mümtehıne 10] Hudeybiye antlaşmasından sonra indiği hususunda ittifak etmişlerdir. Bu ayetin iniş nedeni Müslümanlar ile Kureyş arasında yapılan bu antlaşmanın şartlarında yer alan şu maddedir: Kureyş kabilesinden biri Müslümanlara gelirse, Müslümanlar onu Kureyş'e iade edecektir. Daha sonra Allah Teala bu iade edilecek kimseler içinden imtihan şartı ile kadınları ayrı tutmuştur. Hz. Nebi kadınların biatını sadece sözlü olarak kabul etmiştir. Erkeklerin biatını kabul ederken yapmış olduğu musafaha gibi onlarla musafaha yapmamıştır. Nesaı ve Taberı, Muhammed İbnu'l-Münkedir'den şu rivayeti nakletmiştir: Ümeyye bintu Rakıka biat eden kadınların arasında bulunuyordu. Kadınlar: \"Ey Allah'ın elçisi! Elini uzat biat edelim ... \"dediler. Allah Resulü Sallallahu Aleyhi ve Sellem de \"Ben kadınlar ile biat etmem. Fakat onlardan söz almm,\" buyurdu. Ardından bizden söz almaya başladı ve en son kadınlar \"İyilik konusunda sana iSY• an tmeyeceğiz\" sözünü söylediler. Allah Resulü Sallallahu Aleyhi ve Sellem de \"Gücünüz y ttiği ve elinizden geldiği sürece ... \" buyurdu. Kadınlar da \"Allah ve O'nun Nebii bize, kendimizden daha merhametlidir\" dediler. Taberı'nin rivayetinde şu ifade de yer almaktadır: \"Yüz kadın için söylediğim söz, bir kadın için söylediğim söz gibidir.\" Bu hadisten anlaşıldığına göre, ayette bahsi geçen imtihandan maksat, ayette geçen esaslar çerçevesinde Hz. Nebi'in kadınların biatını almasıdır. Abdurrezzak İbn Hemmam, Ma'mer ve Katade kanalıyla Hz. Nebi'in hicret eden kadınları şu söz ile imtihan ettiğini nakletmiştir: \"Allah'a yemin ederim ki, sadece İslam'ı arzuladığı m için ve Allah ve Resulü'nü sevdiğim için yurdumu terk ettim",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 411
			}
		}
	]
}