{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4927,
			"arabicnumber": 4927,
			"text": "İbn Abbas r.a.'ın şöyle söylediği rivayet edilmiştir: Nebi Sallallahu Aleyhi ve Sellem kendisine vahiy geldiği zaman dilini kımıldatırdı. --Süfyan bunu tasvir etmiştir.-- Böylece Kur'an'! ezberlemeyi istiyordu. Bunun üzerine Allah Teala \"(Resulüm!) Onu (vahyi) çarçabuk almak için dilini kımıldatma, \"(Kıyame 16) ayetini indirdi. Fethu'l-Bari Açıklaması: Selef alimleri bu ayet ile vahyin inişi meselesinde Hz. Nebi'e hitap edildiği konusunda fikir birliği içindedirler. Nitekim burada zikredilen hadis de bunu göstermektedir. Hz. Nebi'in dilin kımıldatması ile ilgili ayetlerin Kıyame Suresi'nde yer almasının bir takım hikmetleri v<;ırdır. Bunlardan bir kaçını şu şekilde sıralayabiliriz: 1- Allah Teala bu surede kıyametten bahsetti. Kıyamet için gerektiği gibi çalışmayanların özelliklerinden biri de dünya sevgisini taşımaktır. Hayırlı işleri yapmak için koşuşturmanın istenen bir davranış olması dinin temel prensiplerindendir. Bu vesileyle daha önemli olan bir davranışın istenilen bu davranıştan önce geldiğine işaret edilmiştir. Söz konusu daha önemli olan davranış ise vahye kulak verip onu anlamaktır. Vahyi ezberlemekle meşgulolmak, bu amacın gerçekleşmesini engeller. Bu yüzden Hz. Nebi'e vahyi ezberlemek için acele etmemesi emredilmiştir. Çünkü vahyi ona ezberletmek Allah Teala tarafından garanti altına alınmıştı. Hz. Nebi'e düşen ise, kendisine iletilen vahyi sonuna kadar dinlemek ve vahyin gereğini yerine getirmekti. Bu konuyu işleyen ayetler ara cümle konumundadır. Bu ara cümle sona erince ayetlerin akışı insan ve onunla ilgili konulara ilişkin meselelere tekrar döndü. Bu sırada .......kella lafzı kullanıldı. Bu kelime engelleme ifadesidir. Adeta bununla şöyle buyurulmuştur: \"Doğrusu siz ey insanlar! Aceleci yaratıldığınız için her şeyde acele ediyorsunuz. Bundan dolayı da dünyayı/peşin olanı seviyorsunuz.\" 2- Kıyamet günü sunulacak olan ve kulun amellerinin yazılı olduğu defterden bahsedilince, yapılan ve yapılmayan işlerin hesabının kendisine bağlı olduğu dünyaya yönelik dını hükümleri içeren kitaptan bahsetmek Kur'an'ın adetidir. Nitekim Kehf Suresi'nde şu ayetlerde bu durum görülmektedir: \"İşte herkesin hesap defteri önüne konuldu. Mücrimlerin defterdeki kayıt/ardan korktuklarını ve şöyle dediklerini görürsün: 'Eyvah bize! Bu deftere de ne oluyor? Ne küçük komuş, ne büyük, yazılmadık şey bırakmamış!' Böylece yaptıkları her şeyi yanlarında buldular. Şu kesin ki, Rabbin kimseye zulmetmez.\" ... \"Biz bu Kur'anlda, insanlar için her türlü misal ve öğüdü, farklı üsluplarla tekrar tekrar ifade ettik. Fakat birçoğu bunları anlamadı. Zira bütün varlıklar içinde tartışmaya en düşkün olan, insandır. \"(Kehf 49-54) Yine aynı şekilde İsra Suresi'nde Allah Teala şöyle buyurmuştur: \"Her insan topluluğurıu önderleri ile birlikte çağıracağımız o günde kimlerin amel defteri sağından verilirse, onlar, en küçük bir haksızlığa uğramamış olarak amel defterlerini okuyacaklar.\" ... \"Muhakkak ki biz, bu Kur'an'da insanlara her türlü misali çeşitli şekillerde anlattık. Yine de insanların çoğu inkarcılıktan başkasını kabul/enmedi. \"(İsra 71-89) 3- Surenin ...........velev elka meazira ayetine kadar olan baş tarafı indiği sırada Hz. Nebi kendisine inen ayetleri ezberlemek için hemen teşebbüste bulundu. Vahyi unutma endişesi ile acele ederek dilini klpırdatmaya başladı. Bunun üzerine \"(Resulüm!) Onu (vahyi) çarçabuk almak için dilini kımı/datma. Şüphesiz onu toplamak (senin kalbine yerleştirmek) ve onu okutmak bize aittir. O halde, biz onu okuduğumuz zaman, sen onun okunuşunu takip et. Sonra şüphen olmasın ki, onu açıklamak da bize aittir, \"(Kıyame 16-19) ayetleri indi. Daha sonra söz, başladığı gibi tamamlanmak üzere devam etti. 4- Surenin başında nefisten bahsedildikten sonra, söz Hz. Nebi'in nefsine döndü. Adeta burada şöyle buyurulmuştur: İşte nefislerin hali böyledir. Ey Muhammed! Senin nefsin, nefislerin en değerlisidir. Öyleyse en kamil hal sende olsun",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 447
			}
		}
	]
}