{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4942,
			"arabicnumber": 4942,
			"text": "Abdullah İbn Zem'a'dan rivayet edildiğine göre, o, Nebi Sallallahu Aleyhi ve Sellem'in hutbesini dinlemiştir. Bu hutbede Allah Resulü Sallallahu Aleyhi ve Sellem Salih Nebiin devesinden ve bu deveyi kesen kimseden bahsedip şöyle buyurmuştur: \"İçinden en azgını ileri atılınca.\"(Şems 13) Yani onun kavmi içinde ileri gelenlerden, şirret ve arkası güçlü bir adam ileri atıldı. Bu adamın kavmi içindeki durumu Ebu Zem'a'nın Mekke'deki durumuna benziyordu. Nebi Sallallahu Aleyhi ve Sellem bu hutbesinde hanımlardan da bahsetti ve şöyle buyurdu: İçinizden biri hanımını köle döver gibi dövmek ister, belki de günün sonunda onunla birlikte olacaktır. Daha sonra Nebi Sallallahu Aleyhi ve Sellem yellenme karşısında gülen erkeklere nasihat etti ve şöyle buyurdu: Sizden biri neden yellenenin yaptığından dolayı güler ki! Ebu Muaviye'nin rivayetine göre Ebu Zem'a, ZUbeyr İbn Awam'ın amcasıdır. Diğer tahric edenler: Tirmizî, Tefsir-ül Kur’ân; Müslim, Cennet Fethu'l-Bari Açıklaması: Firyabi ...........vela yehafu ukbaha ayeti hakkında Mücahid'in şöyle söylediğini senedi ile birlikte nakletmiştir: \"Allah Teala hiç kimsenin sonundan korkmaz.\" عقباها Ukbaha kelimesinin sonundaki zamir, demdemeyi veya Semo.d kavmini ya da daha önce geçen nefsi gösterebilir. Demdeme bütünüyle yok etmeyi ifade eder. Kadınların. dövülmesiyle ilgili hadisin açıklaması \"Kitabu'n-nikah\"ta yapılacaktır. Yellenme konusunda Hz. Nebi'in nasihati \"Kitabu'l-edeb\"de açıklanacaktır. ZUbeyr İbn Awam, Ebu Zem'a'nın mecazen amcasıdır. Çünkü Ebu Zem'a'nın asıl adı, Esved İbn Muttalib İbn Esed'dir. Awam ise İbn Huveylid İbn Esed'dir. Burada amca çocuğu kardeş muamelesi görmüştür. Bu yüzden amca çocuğuna \"amca\" adı verilmiştir. Dimyati' kesin bir ifade ile Ebu Zem'a'nın ismini bu şekilde açıklamıştır. Mutemed olan görüş de budur. Kurtubi' \"el-Müfhim\" adlı eserinde şöyle demiştir: \"Burada Ebu Zem'a ile Rıdvan biatında ağacın altında biat eden Ubeyd el-Belvi' kastedilmiş olabilir. Ebu Zem'a'nın o azılı kafire benzetilmesi, izzetli ve kavminin desteğini her zaman arkasında hisseden birisi olması hasebiyledir. Burada, Ebu Zem'a ile bu künyeye sahip kafirlerden başka biri de kastediImiş olabilir.\" Kanaatime göre bu ikinci ihtimal daha doğrudur. Başka birinden maksat da hadisin ravilerinden Abdullah İbn Zem'a'nın dedesi Esved'dir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 463
			}
		}
	]
}