{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4966,
			"arabicnumber": 4966,
			"text": "İbn Abbas r.a.'ın Kevser hakkında şöyle söylediği rivayet edilmiştir: Kevser, Allah'ın Hz. Nebi'e verdiği hayırdır. Ebu Bişr de şöyle demiştir: Said İbn Cübeyr'e \"İnsanlar, Kevser'in Cennette bir ırmak olduğunu iddia ediyorlar,\" dedim. Bunun üzerine Said şöyle dedi: Cennetteki ırmak da Allah'ın Hz. Nebi'e verdiği hayrın bir parçasıdır.\" Hadisin geçtiği diğer yer: 6578 Fethu'l-Bari Açıklaması: ......Kevser ........fev'al vezninde ......kesra kökünden türemiş bir kelimedir. Suyunun ve kaplarının çok, değerinin yüce ve hayrının bololmasından dolayı ırmağa bu ad verilmiştir. Hz. Nebi'e kin tutup düşmanlık eden şahsın kim olduğu konusunda rivayet alimleri ihtilaf etmişlerdir. Bir görüşe göre bu kimse, el-Ası İbn Vail; bir başka görüşe göre Ebu Cehil; bir diğer görüşe göre ise Ukbe İbn Ebı Muayt'tır. İmam Buharı bu surenin tefsirinde üç hadise yer verdi. Enes'ten nakledilen ilk hadisin açıklaması İsra olayı analtılırken \"Evailu mebas\" başlığı altında yapılmıştı. Kitabu'r-rikak'ın sonunda da ayrıntılı olarak bunun açıklaması yapılacaktır. İmam Müslim'in \"Sahıh\"inde Muhtar İbn Fülfül kanalıyla Enes'ten gelen rivayet şu şekildedir: Biz Hz. Nebi'in yanında idik. Allah Resıı1ü sallallahu a1eyhi ve sellem hafif uykuya daldı. Sonra tebessüm ederek başını kaldırdı. Biz: \"Ey Allah'ın elçisi! Neden güldünüz?\" diye sorduk. Bunun üzerine \"Bana bir sure indirildi\" dedi ve şu şekilde sureyi okudu: ..........Bismillahirrahmanirrahim inna a'taynake'l-kevser fesalli lirabbike venhar'inne şanieke huve'l-ebter. Sonra \"Kevser nedir biliyor musunuz?\" diye sordu. Biz de \"Allah ve Resulü daha iyi bilir\" dedik. Bunun üzerine şöyle buyurdu: ° Rabbimin bana vaad ettiği, çok hayırlı bir ırmaktır. O, kıyamet günü ümmetimin su içmek için varacakları bir havuzdur.\" Saıd İbn Cübeyr'in sözünün özeti şu şekildedir: İbn Abbas'ın kevseri \"bol hayır\" olarak açıklaması, kevseri \"Cennetteki bir ırmak olarak\" açıklayanların görüşü ile çelişmez. Çünkü bu ırmak, bol hayrın bir parçasıdır. Muhtemelen Saıd İbn Cübeyr, İbn Abbas'ın yorumunun, kapsayıcı olması hasebiyle daha tercih e şayan olduğunu ima etmiştir. Ancak Kevser lafzı bizzat Hz. Nebi tarafından \"ırmak\" ile tahsis edilmiştir. Bunu bırakıp başka görüşe itibar erek doğru olmaz",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 488
			}
		}
	]
}