{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4970,
			"arabicnumber": 4970,
			"text": "İbn Abbas r.a.'dan şöyle dediği rivayet edilmiştir: Hz. Ömer beni, Bedir Savaşı'na katılan ve yaşlanmış olan insanların meclisine alırdı. İçlerinden biri bundan dolayı rahatsız olmuş olacak ki; \"Bunu neden bizim yanımıza getiriyorsun? Bizim onun gibi çocuklarımız var!\" demişti. Bunun üzerine Hz. Ömer ise \"O, sizin bildiğiniz kimsedir,\" demişti. Bir gün onu davet edip yine onların meclisine aldı. [Olayın bundan sonraki kısmını İbn Abbas şöyle anlatmıştır:] O gün beni onlara göstermek için çağırdığını anladım. Hz. Ömer onlara; \"Allah Teala'nın ..........iza cae nasrullahi ve'l-feth' suresinin anlamını sordu. Bazıları 'T3u surede yardıma mazhar olup fetih bize nasip olunca Allah'a hamd etmemiz ve ondan bağışlanma dilememiz bize emrediidi,\" dedi. Bazıları ise sustu ve hiçbir şey söylemedi. Sonra Hz. Ömer bana; \"Ey İbn Abbas! Sen de mi böyle düşünüyorsun?\" diye sordu. Ben de \"Hayır,\" dedim. Hz. Ömer: \"Peki sen ne düşünüyorsun?\" diye sorunca şöyle cevap verdim: Burada Hz. Nebi'in vefatı anlatılmıştır. Allah Teala bunu Nebiine bildirmiştir. Şöyle ki; \"Allah'ın yardım ve zaferi\" -ki bu senin vefatının alametidir- \"Rabbine hamd ile tesbih et ve O'ndan af dile. Çünkü O tevvabdır, tövbeleri çok kabul eder,\" buyurmuştur. Hz. Ömer de \"Ben de bu surenin anlamını sadece söylediğin gibi biliyorum,\" demiştir. Fethu'l-Bari Açıklaması: Hz. Ömer, insanları dinlemek için oturduğu zaman adeti gereği geçmişteki derecelerine göre insanların yanına gelmesini sağladı. Bazen de Medıneli olmayanları eksiklerini telafi eden bir meziyetlerinden dolayı onlarla birlikte dinlerdi. Bu rivayette, İbn Abbas'ın fazileti ile Hz. Nebi'in ona te'vlli öğretmesi ve onu dinde fakıh kılması için yaptığı duanın Allah tarafından kabul edildiği açıkça görülmektedir. Nitekim bu, \"Kitabu'l-ilm\"de geçmişti. Bu örnekte olduğu gibi övünme ve hava atma için değil de Allah'ın kendisine verdiği nimeti göstermek, kendi değerini bilmeyenlere değerini öğretip onların buna göre muamele etmesini sağlamak ve daha başka iyi gayeler için kişi kendisinden bahsedebilir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 492
			}
		}
	]
}