{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4971,
			"arabicnumber": 4971,
			"text": "İbn Abbas r.a.'dan rivayet edildiğine göre, o şöyle demiştir: \"Önce en yakın akrabalarını (onlardan samimiyet sahibi olanları) uyar, \"(Şuara 214) ayeti inince Allah Resulü Sallallahu Aleyhi ve Sellem gitti ve Safa tepesine çıktı. İnsanlara \"Yetişin!\" diye bağırdı. İnsanlar; \"Bu da kim?\" dediler ve onun etrafında toplandılar. Hz. Nebi; \"Şu dağın ardından süvarilerin çıkacağını size söylesem, beni tasdik eder misiniz? Bu konuda ne dersiniz?\" diye sordu. Toplanan insanlar; \"Senin bize yalan söylediğine tanık olmadık\" dediler. Bunun üzerine Hz. Nebi; \"Öyleyse bilin ki, ben, şiddetli bir azab öncesinde size gönderilmiş bir uyarıcıyım!\" dedi. Hemen Ebu Leheb \"Yazıklar olsun sana! Bizi sadece bunun için mi çağırdın?\" dedi ve kalkıp gitti. İşte bunun üzerine .........tebbet yeda Ebi Leheb ve teb (Tebbet 1) ayeti indi. Ebu Leheb'in iki eli gerçekten kurumuştu. Fethu'l-Bari Açıklaması: Ebu Leheb / Alev babası, Abdulmuttalib'in oğludur. Asıl adı Abduluzza'dır. Annesinin isimi ise Huzaıyye'dir. Ebu Leheb künyesini ya \"Leheb\" adlı oğlundan, ya da yanaklarının aşırı kırmızı olmasından dolayı almıştır. Onun bu künyesi en sonunda alevalev yükselen ateşe gireceği gerçeği ile uyum içinde olmuştur. Bundan, künyesi ile daha çok tanınmasından ve isminin bir puta izafe edilmesinden dolayı Kur'an'da kendisinden ismiyle değil, künyesi ile söz edilmiştir. Burada her halükarda müşrik birine künye verilmesinin caiz olduğunu söyleyenler için bir delil yoktur. Şayet bir saygıyı gerektirmediği veya ihtiyaç olduğu sürece müşrik birine künye verilebilir. Vakıdi şöyle demiştir: \"Ebu Leheb, Hz. Nebi'e en fazla düşmanlık yapan kimselerden biriydi.\" Ebu Leheb Bedir Savaşı'ndan sonra ölmüştür. Kendisi bu savaşa katılmamış, yerine adam göndermişti. Bu savaşta Kureyş'in başına gelenler kendisine anlatılınca üzüntüden ölmüştür",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 493
			}
		}
	]
}