{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"65": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh))"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4977,
			"arabicnumber": 4977,
			"text": "Zirr'den şöyle dediği rivayet edilmiştir: Ubey İbn Ka'b'a: \"Ey Ebu'lMünzir! Kardeşin İbn Mes'ud şöyle şöyle diyor. [Ne dersin?] diye sordum. Ubey şöyle cevap verdi: Ben de bunu Rasulullah Sallallahu Aleyhi ve Sellem'e sordum. O da şöyle cevap verdi: Bana böyle okundu. Ben de şöyle dedim: Bundan böyle Allah Resulü Sallallahu Aleyhi ve Sellem'in söylediği gibi okuruz. Fethu'l-Bari Açıklaması: İbn Mes'ud'un söyledikleri \"şöyle şöyle\" şeklinde aktarılmışıtr. Öyle anlaşılıyor ki, ravilerden biri, bu sözleri söylemeyi hoş karşılamadığı için İbn Mes'ud'un söylediklerini mübhem olarak aktarmıştır. Ahmed İbn Hanbel ile İbn Hıbban, Hammad İbn Seleme kanalıyla Asım'dan bu rivayeti şu lafızIa nakletmiştir: Abdullah İbn Mes'ud Muawizeteyn'i Mushafına yazmazdı. Bezzar şöyle demiştir: \"Bu konuda hiçbir sahabi İbn Mes'ud'a uymamıştır. Nebi Sallallahu Aleyhi ve Sellem'in bu iki sureyi Kur'an'da okuduğu sahıh olarak nakledilmiştir.\" Bu, Ukbe İbn Amir kanalıyla Müslim'in \"Sahıh\"inde yer almaktadır. Bu rivayeti İbn Hıbban başka bir senedle Ukbe İbn Amir'den şu ziyade ile nakletmiştir: \"Her namazda bu iki sureyi okuyabiliyorsan bunu yap!\" Ahmed İbn Hanbel, Ebu'l-Ala İbn Şıhhir kanalıyla sahabeden birinden şöyle nakletmiştir: Nebi Sallallahu Aleyhi ve Selem Muawizeteyn'i o sahabiye okutmuş, sonra ona şöyle demiştir: \"Namaz kılarken bu ikisini oku!\" Bu rivayetin senedi sahihtir. Said İbn Mansur'un Muaz İbn Cebel'den naklettiği rivayete göre Hz. Nebi sabah namazını kıldırmış ve bu namazda Muawizeteyn'i okumuştur. İmam Nevevi \"Şerhu'I-Mühezzeb\" adlı eserinde şöyle demiştir: Müslümanlar Fatiha ve Muawizeteyn'in Kur'an'ın bir bölümü olduğu konusunda icma' etmişlerdir. Kim bunu inkar ederse, kafir olur. İbn Mes'ud'dan nakledilen görüş ise batıldır, doğru değildir. Ayrıca bu görüşe karşı dikkatli olunmalıdır. Nevevi'den daha önce Ebu Muhammed İbn Hazm da \"el-Muhalla\" adlı eserinde buna benzer şeyler söylemiştir: \"İbn Mes'ud'dan Muawizeteyn'in Kur'an'dan olmadığına dair nakledilen rivayetler batııdır, asılsızdır.\" Fahruddin Razi de tefsirinin başlarında buna benzer ifadeler kullanmıştır: \"Zanna galib gelen düşünceye göre İbn Mes'ud'dan nakledilen bu görüş, iftira ve batııdır. Sağlam bir senedi olmadan sahıh rivayetleri eleştirmek kabul edilemez. Ancak sahıh rivayetler te'viIe açık olabilir",
			"grades": [],
			"reference": {
				"book": 65,
				"hadith": 499
			}
		}
	]
}