{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4988,
			"arabicnumber": 4988,
			"text": "Harice İbn Zeyd İbn Sabit şöyle söylerken işittiğini rivayet etmiştir: \"Mushafı çoğaltırken Ahzab suresinden bir ayeti bulamadım. Oysa Nebi Sallallahu Aleyhi ve Sellem'in O ayeti okuduğu işitmiştim. Bu yüzden onu aradık. Nihayet o ayeti ensardan Huzeyme İbn Sabit'in yanında bulduk. (Söz konusu ayet şuydu:) \"Mu'minler içinde Allah'a verdikleri sözde duran nice erler var ... \"(Ahzab 23) Sonra bu ayeti, geçtiği surenin içine koyup Mushafa ilave ettik.\" Fethu'l-Bari Açıklaması: Yemame hadisesi ile, Müseylimetü'l-kezzab'la yapılan savaşta sahabilerin öldürülmesi kast edilir. Söz konusu savaş şu şekilde ortaya çıkmıştı: Müseylime Nebilik iddiasında bulunmuştu. Bir çokArap'ın irtidat etmesi ile Hz. Nebi'in sallalIa.hu aleyhi ve sellem vefatından sonra güç kazanmıştı. Bu yüzden Hz. Ebu Bekir Halid ibn Velid kumandasında birçok sahabeyi onunla savaşmak üzere Yemame'ye göndermişti. Ashabı kiram Müseylime'nin adamlarıyla çetin bir savaşa tutuştular. Neticede Allah Teala onun mağlup olmasını diledi ve Müseylime öldürüldü. Ancak bu savaş sırasında 700'e yakın, hatta bazılarına göre daha fazla sahabi de şehit düştü. Yukarıda Süfyan İbn Uyeyne'den nakledilen hadiste Hz. Ömer'in kast ettiği karilerden Ebu Huzeyfe'nin mevlası Salim'in adı zikredilerek öldürüldüğü bildirilmiştir. Rivayet şu şekildedir: \"Ebu Huzeyfe'nin mevlası Salim öldürülünce J-k DmfI J$llIl1n}n Jşııyb9JllfDğ; f.J)9jg.9jJ)g J5apJJrlJ, Bu ylizrlı;:J) Hz_ .Ebu Bekir'in yanına gitti.\" Salim'in, Hz. Nebi'in Sallallahu Aleyhi ve Sellem kendisinden Kur'an öğrenilmesini emrettiği bir sahabi olduğu ileride gelecektir. \"Ben diğer savaşlarda da\" ifadesi \"diğer yerlerde kafirlerle yapılan savaşlarda da\" manasına gelir. Hattabi ve diğerleri şöyle demiştir: \"Muhtemelen Allah Resulü Sallallahu Aleyhi ve Sellem, bazı ayetlerin hükmünü veya tilavetini neshedecek bir vahiy beklentisi içinde olduğu için Kur'an'ı bir kitapta toplamamıştı. Vefatından sonra vahiy kesilince, Allah Teala, raşit halifelere Kur'an'ı bir kitapta toplama düşüncesini ilham etti. Böylece Muhammed ümmeti (Allah şerefini artırsın) için garanti ettiği koruma vaadini gerçekleştirdi. Kur'an'ı toplama faaliyeti Hz. Ömer'in istişaresi sayesinde Hz. Ebu Bekir tarafından başlatılmıştır. Rafizilerden bazıları, Hz. Ebu Bekir'in Kur'an ayetlerini bir mushafta toplama faaliyetine itiraz etmeyi bir meziyet olarak telakki etmiştir: \"O, Rasululah Sallallahu Aleyhi ve Sellem'in yapmadığı bir şeyi nasıl yapar,\" diyerek bu faaliyeti karalamak istemişlerdir. Onlara şu şekilde cevap verilir: Hz. Ebu Bekir, ancak Allah'a, Kitab'ına, Nebiine, Müslümanların ileri gelenlerine ve halka olan samimiyetinden kaynaklanan idihadından hareketle Kur'an'ı toplamıştır. Hz. Nebi sallaııahu aleyhi ve sellem Kur'an'ın yazılmasına müsaade etmiş, onunla birlikte başka bir sözün yazılmasını ise yasaklamıştır. Hz. Ebu Bekir ise, ancak yazılı olan bir vahyin tekrar yazılmasını emretmiştir. Bundan dolayı Zeyd, Tevbe suresinin son kısmında bulunan ayeti yazılı buluncaya kadar onu Mushaf'a yazmaktan geri durdu. Oysa o ve daha başkaları bu ayeti hatırlıyor ve biliyordu. İmam Buhari Ebu Bekir'in bu hizmetini düşününce bunun, onunu faziletlerinden sayılması gerektiğine kesin kanaat getirdi ve onun yüce deQerine dikkat çekti. Çünkü Hz. Nebi Sallallahu Aleyhi ve Sellem şöyle buyrumuştur: \"Kim iyi bir iş baş/atırsa, yaptığı bu işin sevabın! ve bu işi yapacak/arın sevabının [bir benzerini] de alır.\" Hz. Ebu Bekir, kıyamete kadar kendisinden sonra Kur'an'ı bir araya getiren herkesin sevabının bir benzerini alır. Bu rivayette Hz. Ebu Bekir, Zeyd'in dört özelliğini zikretmiştir: a) Genç Olması: Zeyd, genç olduğu için kendisine verilen görevi rahatça yapabilirdi. b)Akıllı Olması: Verilen görevin künhüne vakıf olup layıkı vechile yapardı. c) İtham Edilmemesi: Herhangi bir kötülükle itham edilmemesi, insanların güvenini kazanması için son derece önemliydi. d) Vahiy Katibi Olması: En fazla vahiy yazan katip idi. Zeyd'de toplanan bu özellikler, başkalarında da vardı. Ancak hepsini bir arada başka bir şahısta bulmak mümkün değildi. ......Usub kelimesi, I/as!b kelimesinin çoğuludur ve hurma dalı anlamına gelir. Araplar hurma dallarının kabuğunu sayarak geriye kalan geniş kısma yazı yazarlardı. Zeyd, söz konusu ayeti yazılı olarak Ebu Huzeyme'nin dışında başka birinin yanında bulamamıştır. Çünkü daha önce de ifade ettiğimiz gibi, Kur'an'ı toplarken yazı olmadan sadece ezbere itibar etmiyordu. O vakit bu ayeti sadece onun yanında bulması, bu ayetin Hz. Nebi'den başkasından bu ayeti öğrenenlerin nezdinde mütevatir hale gelmediği anlamına gelmez. Çünkü Zeyd, vasıtasiZ olarak Hz. Nebi'den Kur'an öğrenenleri araştırıp onlardan ayetleri topluyordu. Zeyd bu ayeti Ebu Huzeyme'nin yanında bulunca, muhtemelen diğer sahabiler bu ayeti hatırlamıştır. Nitekim Zeyd'in kendisi de hatırlamıştı. Bu şekildeki bir araştırmanın faydası, Hz. Nebi'in Sallallahu Aleyhi ve Sellem huzurunda ezberlenen ve yazılan ayetleri tespit etmedeki hassasiyeti gösterir. Toplanan Kur'an Hz. Ömer'in hilafetinden sonra Hz. Osman döneminde Hz. Hafsa validemizin yanında kaldı. Hz. Osman'ın istinsah faaliyetine kadar da kalmaya devam etti. Çünkü Mushaf'ın onun yanında kalmasını Hz. Ömer vasiyet etmişti. Bu yüzden kendisinden istenilen zamana kadar, Mushafı muhafaza etmeye devam etti. Hz. Osman'ın sahabilerle istişare ettikten sonra Kur'an'ı çoğalttığı nakledilmiştir. İbn Ebi DavO.d sahih bir senetle Süveyd İbn Gafle'den şu rivayeti aktarmıştır: \"Hz. Ali dedi ki: Osman hakkında ancak iyi sözler sarfedin! Allah'a and olsun ki o, bizden ileri gelenlerle istişare ettikten sonra Mushafları çoğaltmıştı. Bize, 'Kur'an'ın bu şekilde okunması hakkında ne düşünüyorsunuz? Bana anlattıklarına göre, 'bazıları benim kıraatım senin kıraatından daha hayırlıdır' diyor. Bu durum neredeyse küfre neden olacak' dedi. Biz de 'peki ne düşünüyorsunuz?' diye sorduk. Bunun üzerine 'ihtilaf ve ayrılık olmaması için insanları Mushaf etrafında birleştirmek istiyorum' dedi. Biz de 'ne kadar da güzel düşünmüşsün' şeklinde karşılık verdik.\" \"Daha sonra her tarafa çoğalttıkları Mushaflardan birer tane gönderdi.\" ifadesi Şuayb'dan nakledilen rivayette şu şekilde aktarılmıştır: \"Hz. Osman, Müslüman ordularından her birine bir Mushaf gönderdi.\" - Hz. Osman'ın çoğaltıp çeşitli bölgelere gönderdiği Mushaf'ların sayısı hakkında ihtilaf edilmiştir. Ancak meşhur olan görüşe göre, bunlar beş tanedir. İbn Battal şöyle demiştir: \"Bu hadise göre, içerisinde Allah'ın ismi bulunan kitapların yakılması caizdir. Yakmak, bu kitaplara değer verildiğini gösterir. Ayrıca ayak altında kalmasına engelolur. Abdurrezzak TavO.s'un besmele ile başlayan mektupları yaktığını nakletmiştir. Aynı şekilde Urve'nin de böyle yaptığı nakledilmiştir. İbnu't-TIn ve diğerleri şöyle demişlerdir: \"Hz. Ebu Bekir'in cem'i ile Hz. Osman'ın cem'i arasında fark vardır. Hz. Ebu Bekir hafızların ölmesiyle, Kur'an ayetlerinden bazılarının kaybolmasından endişe ettiği için onu toplatmıştı. Çünkü Kur'an'ın tamamı bir yerde derli toplu bulunmuyordu. Bu yüzden Hz. Nebi'in salla11ahu a1eyhi ve sellem öğrettiği şekilde sure ve ayetleri sıralanmış olarak Kur'an'ı toplattı' Hz. Osman ise, ashabı kiramın, sahip oldukları çok değişik lehçelere göre Kur'an'ı farklı farklı okumaya başlamalarıyla ortaya çıkan ihtilafların çoğalması sonucu Kur'an'ı cem ettirmiştir. Çünkü insanların farklı kıraatlere göre Kur'an okumaları, birbirlerini hata ile suçlamalarına neden olmuştu. Hz. Osman bu durumun çok ciddi bir boyuta ulaşmasından endişe duymuştu. Bu nedenle Kur'an'ın yazılı bulunduğu sayfaları bir mu sh afta toplayarak çoğaitmıştır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 10
			}
		}
	]
}