{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4996,
			"arabicnumber": 4996,
			"text": "Şakik'ten rivayet edildiği ne göre, Abdullah [İbn Mes'ud]'dan şöyle nakledilmiştir: \"Allah Resulü Sallallahu Aleyhi ve Sellem'in her rekatta ikişer ikişer okuduğu birbirine benzer sureleri öğrendim\" dedi. Sonra Abdulluh bulunduğu yerden kalkıp evine gitti. Beraberinde Alkame de vardı. Bir müddet sonra Alkame evden çıktı, ona bu surelerin hangileri olduğunu sorduk. O da şöyle cevap verdi: \"İbn Mes'ud'un mushafına göre mufassal surelerden yirmi sure. Hamimler, Duhan ve Amme bu surelerin sonunda yer alır.\" Fethu'l-Bari Açıklaması: \"Kur'an'ın Tertibi\" başlığı, bir surenin ayetlerinin tertibi manasına gelebileceği gibi surelerin mushaftaki sıralanışı manasına da gelebilir. Hadisin \"Ona 'hangi kefen daha hayırlıdır?' diye sordu. Hz. Aişe 'zavallı adam, kefenlenirsen kefenlen, bunun sana bir zararı olur mu?' diye karşılık verdi.\" ifadesinden şunlar anlaşılmaktadır: Iraklı bu adam öyle anlaşılıyor ki, Semura'dan nakledilen şu merru' hadisi işitmiştir: \"Elbiselerinizden beyaz olanlan giyin. Ölülerinizi de beyaz bezle kefenleyin! Çünkü beyaz daha temiz ve daha güzeldir.\" Tirmizl'ye göre bu hadis sahihtir. Ayrıca Tirmizi İbn Abbas'tan da bunu nakletmiştir. Muhtemelen Iraklı adam bu hadisi duymuş ve bunun doğru olup olmadığını Hz. Aişe'den öğrenmek istemiştir. Malum olduğu üzere Iraklılar sorularıyla ortalığı karıştırmakla meşhur olmuşlardır. Bundan dolayı Hz. Aişe adama \"neyle kefenlenirsen kefenlen, bunun sana bir zararı oiur mu?\" diye karşılık vermiştir. Bu ifadesi hangi kefenle gömülürsen gömül, kefenlenmiş olursun manasına gelir. İbn Ömer'in sivrisineğin kanı hakkında soru soran Iraklıya söylediği şu söz çok meşhurdur: \"Irak halkına bakın! Allah Resıılü'nün Sallallahu Aleyhi ve Sellem torununun kanını akıttıkları halde sivrisineğin kanının hükmünü soruyorlar.\" İbn Battal şöyle demiştir: \"Ne namazda iken, ne de namaz dışında Kur'an okurken surelerin tertibine riayetin farz olduğunu söyleyen bir alim bilmiyorum. Aksine kişinin, Bakara'dan önce Kehf suresini, Kehf'ten önce de Hacc suresini okuması caizdir. Seleften Kur'an'ı tersten okumanın yasaklandığına dair gelen haberler ise, bir surenin ayetlerini sondan başa doğru okumak hakkındadır. Çünkü bazıları ezberlemede aşırı çaba gösterdikleri ve dillerinin, yazdıklarını kolayca telaffuz etmesini sağlamak istedikleri için kasidelerde böyle bir yönteme başvurmuşlardl. İşte selef, bu yöntemin Kur'an'a uygulanmasına karşı çıkmıştır. Kur'an'ın bu şekilde okunması haramdır.\" Kadı iyad Hz. Nebi'in gece namazında N-i İmran suresinden önce Nisa suresini okuduğunu gösteren Huzeyfe hadisini şerhederken şöyle demiştir: \"Ubey İbn Kalb'ın mushafında adı geçen sureler bu şekilde dizilmiştL Ayrıca bu hadiste, surelerin ictihada göre tertip edildiğini söyleyenler için bir delil vardır. Sureler tevkifi olarak dizilmemiştir. Nitekim alimlerin çoğu bu kanaattedir. Kadı el-Bakıllani de bunu tercih etmiştir. O, bu konuda şunları söylemiştir: Kur'an okurken surelerin sırasına riayet etmek farz değildir. Namaz kılarken, ders verirken ve Kur'an öğretirken tertibe riayet gerekli değildir. Zaten bu yüzden sahabelerin Mushafları farklılık arzetmiştir. Hz. Osman mushafı yazılınca, sureleri bugün elimizde bulunan tertibe göre sıraladılar.\" Daha sonra İbn Battal'ın söylediklerine benzer sözler sarfetmiş ve sonra şöyle demiştir: \"Bütün surelerin ayetleri, bu- . gün mushafta bulunduğu sıraya göre Allah'ın buyruğu doğrultusunda diziimiştir. Ayetler tevkifi tertibi bozulmadan Hz. Nebilden günümüze kadar nakledilmiştir. \" Hz. Aişe \"haram ve helale ilişkin ayetler indL\" sözüyle, Kur'an ayetlerinin inişi sırasında gözetilen ilahi hikmete işaret etmiştir. Kur'an-ı Kerim'den ilk önce tevhid inancına çağıran, mu'minleri ve itaat edenleri cennetle müjdeleyip kafir ve isyankarları cehennemle korkutan ayetler indi. İnsanlar bu ilkelere gönülden bağlanınca ahkam ayetleri nazil oldu. Bundan dolayı Hz. Aişe, \"Eğer ilk olarak 'şarap içmeyin!' diye bir ayet inseydi, insanlar 'asla şarabı bırakmayız' diyerek karşı çıkarlardı\" demiştir. Çünkü insan tabiatı, alışkanlıklarını bırakmaktan nefret edecek şekilde yaratılmıştır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 18
			}
		}
	]
}