{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5005,
			"arabicnumber": 5005,
			"text": "İbn Abbas'tan şöyle nakledilmiştir: \"Hz. Ömer şöyle dedi: Ubey içimizde en iyi Kur'an okuyandır. Ancak onun lahnini bir kenara bırakırız. Buna karşın Ubey şöyle demiştir: Ömer'in Lahn dediklerini ben Nebi Sallallahu Aleyhi ve Sellem'den öğrendim. Hiçbir şey için bunları bırakmam. Hz. Ömer de şöyle demiştir: Allah Teala buyurdu ki; Biz, bir ayetin hükümünü yürürlükten kaldırır veya onu unutturursak mutlaka daha iyisini veya benzerini getiririz. \"(Bakara 106) Fethu'l-Bari Açıklaması: Hadiste geçen lahndan maksat, tilaveti mensuh ayetlerin okunmasıdır \"Nebi s.a.v.'in Ashabından Kari Olanlar\" başlığı Kur'an ezberleme ve onun öğretme ile meşgul olmakla meşhur olan sahabilere tahsis edilmiştir. Kari' lafzı, selefin literatüründe Kur'an'ın manasına vakıf olan kimseler için de kullanılırdı. \"Kur'an'ı şu dört kişiden öğrenin\" hadisinde zikredilen dört kişiden ikisi muhacirlerden, diğer ikisi ise ensardandır. Bu konudaki hadislerin ilkinde Abdullah İbn Amr'ın yanında İbn Mes'ud'dan bahsedilmiştir. O da onun hakkında \"Onu hala seviyorum. Çünkü Nebi s.a.v.'in Kur'an'z şu dört kişiden öğrenin buyurduğunu işittim\" demiş ve ilk olarak da İbn Mes'ud'u zikretmiştir. Bu hadisten Kur'an'ı güzelokuyana sevgi beslemenin iyi olduğu sonucu çıkar. Kurtubi şöyle demiştir: \"Bu hadiste Hanefiler gibi şarap kokusunun had ce. zasını gerektirdiğini kabul etmeyenıere karşı bir delil söz konusudur. İmam Malik ve öğrencileri ile Hicaz Ehline göre, kendisinden şarap kokusu gelen kimseye had cezası uygulanır. Bu konu meşhur tartışmalı konulardan biridir. Bunu kabul etmeyenler şöyle der: Muhtemelen hadisteki adam şarap içtiğini kabul etmiştir. Bu durumda bu hadis delilolmaktan çıkar. Mufavvak \"Muğni'de sadece şarap kokusu yüzünden had cezasının gerekli olup olmadığı konusundaki ihtilafı zikrettikten sonra, sadece şarap kokusuna dayanarak haddin uygulanamayacağı görüşünü tercih etmiştir. Bununla birlikte kişinin sarhoş olması, kusması gibi başka bir delilin bulunması gerektiğini belirtmiştir. Fısk ile tanınan bir grubun olması, yanlarında şarabın bulunması, içlerinden birinden şarap kokusunun gelmesi gibi hususlar da delil olarak kabul edilmiştir. İbnu'l-Münzir selef alimlerinin birinden şu görüşü nakletmiştir: Şarap kokusu yüzünden had cezasına çarptırılması gereken kimse, şarap müptelası olan kimsedir. \"Enes İbn Malik'e Hz. Nebi Sallallahu Aleyhi ve Sellem döneminde kimlerin hafız olduğunu sordum. O da şöyle cevap verdi: Dört kişi Kur'an'ı ezberlemişti. Hepsi de ensardandı.\" Taberi'nin Said İbn Ebi Arı1be kanalıyla Katade'den naklettiği rivayette bu hadisin baş kısmı şu şekildedir: \"Evs ve Hazreç kabileleri birbirlerine karşı övünmeye başladı. Evsliler 'bizde dört kişi var ki, onlar için arş titrer' dedi. Bunlar Sa'd İbn Muaz, şahitliği iki kişinin yerine geçen Huzeyme İbn Sabit, cenazesini meleklerin yıkadığı Hanıala İbn Ebi Amir ve bal arılarının kendisini ayının saldırısından koruduğu kişi olan Asım İbn Sabit'tir. Buna karşın Hazreçliler, bizde dört kişi var ki, bunlar Kur'an'ı ezberlemiştir. Onların dışında da Kur'an'ı ezberlyen yoktur deyip bu dört kişinin ismini sıralamışlardır. Maziri şöyle demiştir: \"Enes'in 'Hz. Nebi Sallallahu Aleyhi ve Sellem vefat ettiği zaman Kur'an'ı dört kişiden başkası ezberlememişti' sözünden vakıanın bu şekilde olduğu sonucu çıkmaz. Çünkü o, bu dört kişi dışında Kur'an'ı ezberleyen birini bilmiyordu. Yoksa haflZ sahabilerin sayısının çok olduğunu ve çeşitli şehirlere dağıldığını düşünecek olursak onun bu kadar kuşatıcı bir araştırma yapması ' imkansızdır. Onun bu sonuca ulaşması bütün sahabilerin teker teker kendisine gelip Hz. Nebi Sallallahu Aleyhi ve Sellem döneminde Kur'an'ı ezberlemediğini bildirmesiyle mümkün olur. Bunun da gerçekleşmesi son derece zordur.\" Kurtubi, daha önce bahsi geçtiği üzere, Yemame savaşında öldürülen yetmiş kurra ile henüz Allah Resulü Sallallahu Aleyhi ve Sellem hayatta iken Bi'ru Maune faciasında katledilen bir kadar daha kurrayı delil olarak bu gösterip hafızların sayısının dörtten fazla olduğunu savunmuştur. Bu konuda şunu söylemiştir: \"Enes haflZlar arasında sadece bu dördünü, onları diğerlerinden çok sevdiği için zikretmiştir. Ya da aklında haflZ olarak sadece onlar vardı",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 27
			}
		}
	]
}