{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5011,
			"arabicnumber": 5011,
			"text": "Bera'dan rivayet edildiğine göre, o şöyle demiştir: \"Adam'ın biri Kehf suresini okuyormuş. Yan tarafında da iki iple bağlı iyi cins bir at varmış. Derken bir bulut kaplamış. Bulut yaklaştıkça yaklaşmış. Bu esnada atı kaçmaya başlamış. Sabah olunca, adam Allah Resu!ü Sallallahu Aleyhi ve Sellem'e gelip bu durumu haber vermiş. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuş: O Kur'an'la birlikte inen sekinettir.\" Fethu'l-Bari Açıklaması: Hadiste ismi belirtilmeyen kişinin Üseyd İbn Hudayr olduğu söylenmiştir. .......şedaneyn kelimesi /şedan kelimesinin tesniyesidir. Sekinet, hem Kur'an'da, hem de hadislerde geçen bir kavramdır. Taberi ve diğerleri Hz. Ali'nin şöyle dediğini nakletmişlerdir. \"Sekinet, ses çıkararak esen bir rüzgarın adıdır. Onun, insan yüzüne benzer yüzü vardır.\" Söylendiğine göre sekinetin iki başı varmış. Mücahid'den nakledildiğine göre sekinetin kedi başı gibi bir başı varmış. Rabı' İbn Enes'ten, sekinetin ışık saçan bir gözü olduğu nakledilmiştir. Süddı ise şöyle demiştir: \"Sekinet, Cennetten gelen altın bir leğendir. Nebilerin kalpleri bu leğende yıkanır.\" Ebu Malik de şunları spylemiştir: \"Sekinet, Musa'nın levhaları, Tevratı ve asayı içine koyduğu şeyin adıdır.\" Vehb İbn Münebbih \"Sekinet, Allah'tan gelen bir rahatlıktır\" demiştir. Dahhak İbn Müzahim, sekinetin rahmet olduğunu söylemiştir. \"Sekinet, kalbin sukOna ermesidir\" sözü de ondan nakledilmiştir. Sekinetin, gönül huzuru ve ağırbaşlılık olduğu da ileri sürülmüştür. Sekinetin melekler olduğu da ifade edilmiştir. Bu görüşü, Saganı zikretmiştir. Kısaca sekinet geçtiği yere göre anlam kazanır. Bu konudaki hadiste geçen sekinetin uygun açıklaması ilk aktardığımız izahtır. Ancak Vehb'in sözü de göz ardı edilemez. Nevevı şöyle demiştir: \"Tercih edilen görüşe göre sekinet, gönül huzurunu, rahmeti ve melekleri bir araya getiren bir tür canlı yaratıktır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 33
			}
		}
	]
}