{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5030,
			"arabicnumber": 5030,
			"text": "Sehl İbn Sa'd'dan şöyle rivayet edilmiştir: \"Bir kadın Allah Resulü Sallallahu Aleyhi ve Sellem'e gelip 'Ey Allah'ın Elçisi! Kendimi size hediye etmek için geldim' dedi. Nebi Sallallahu Aleyhi ve Sellem ona baktı ve onu baştan aşağı süzdü. Sonra başını öne eğdi. Kadın, onun kendisi hakkında bir karara varmadığını görünce oturdu. Derken ashabın içinden biri çıkıp 'Ey Allah'ın Elçisi! Eğer ona ihtiyacın yoksa, onu benimle evlendir' dedi. Hz. Nebi Sallallahu Aleyhi ve Sellem 'ona (mehir olarak vereceğin) bir şeyin var mı?' diye sordu. Adam, 'Ey Allah'ın Elçisi!' diye cevap verdi. Bu defa Allah Resulü Sallallahu Aleyhi ve Sellem 'ailene git, bak bakalım bir şey bulabilecek misin?' dedi. Adam ailesinin yanına gitti. Bir müddet sonra döndü ve 'Ey Allah'ın Elçisi! Bir şey bulamadım' dedi. Nebi Sallallahu Aleyhi ve Sellem 'bak bakalım, demirden bir yüzük de olsa yeter' dedi. Adam yine gitti. Bir müddet sonra çıkageldi ve 'bulamadım Ey Allah'ın Elçisi! Ancak şu izarım var' dedi. Sehl dedi ki: Adamın ridası bile yoktu. Sadece üzerinde o gün giyilen elbisenin yarısı (izar) vardı. Hz. Nebi 'izarını ne yapacaksın? Eğer izarını sen giyersen o kullanamaz, yok o giyerse, senin üzerinde bir şey kalmaz' dedi. Adamcağız çöktü kaldı. Uzun süre yerinden kımıIdamadı. Sonra kalktı. Nebi Sallallahu Aleyhi ve Sellem onun arkasını dönüp gittiğini fark etti. Emredip onu çağırttı. Adam gelince 'Kur'an'dan ne biliyorsun?' diye sordu. Adam 'şu, şu sureleri' deyip bildiği sureleri saydı. Bu defa Nebi Sallallahu Aleyhi ve Sellem 'onları ezbere biliyor musun?' diye sordu. Adam 'evet' dedi. Son olarak Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Hadi git! Bildiğin sureleri ona öğretmen karşılığında, onu sana verdim, (onunla seni evlendirdim}.\" Fethu'l-Bari Açıklaması: İmam Buhari bu konuda kendisini Allah Resulü Sallallahu Aleyhi ve Sellem'e hediye eden kadına ilişkin Sehl'den rivayet edilen hadisi nakletti. Bu hadisin konu başlığı ile ilişkisi gayet açıktır. Çünkü bu hadiste 'onları ezbere biliyor musun?' ifadesi geçmektedir. Bu da, ezbere Kur'an bilmenin faziletini gösterir. Çünkü, ezbere Kur'an bilmek, başkasına öğretmeye zemin hazırlamıştır. İbn Kesir şöyle der: \"İmam Buhari bu hadis ile ezbere Kur'an okumanın Mushaf'a bakarak okumaktan daha faziletli olduğunu kastediyorsa, bu eleştirilir. Çünkü yüzüne Kur'an okumak görerek yapılan bir ameldir. Belki de, hadisteki sahabi yazmayı bilmeyen biriydi. Nebi Sallallahu Aleyhi ve Sellem de onun bu durumunu bilmekteydi. Dolayısıyla bu durum, ezbere Kur'an okumanın okuryazar olan ve olmayan için efdal olduğunu göstermez.\" İmam Buhari bu tür iddialardan hiç birini reddetmemiştir. Çünkü o \"Kur'an'ı Ezbere Okumak\" başlığı ile bunun din tarafından uygun görüldüğünü ve mü stehap bir am el olduğunu ifade etmek istemiştir. Dolayısıyla hadis, kendisi için konan başlığa uygundur. Bunun için ezbere okumanın, yüzüne bakarak okumaktan daha faziletli olduğu tezinden hareketle bu başlık eleştirilemez. Bir çok alim, açıkça mushafa bakarak okumanın ezbere okumadan daha faziletli olduğunu söylemiştir. Ebu Ubeyd \"Fezailu'l-Kur'an\" adlı eserinde İbn Mes'ud kanalıyla mevkuf olarak şu hadisi nakletmiştir: \"Mushafa bakmaya devam ediniz!\" Bu rivayetin isnadı sahihtir. Mana açısından da Mushaf'a bakarak okumak hataya düşmekten daha çok korur. Ancak ezbere okumak riyadan uzak bir davranıştır. Huşo.ıu olmayı sağlar. Doğrusu hangisinin daha efdal olduğu, kişiden kişiye değişir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 52
			}
		}
	]
}