{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5042,
			"arabicnumber": 5042,
			"text": "Aişe r.anha'dan şöyle söylediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem Mescid'de bir gece Kur'an okuyan birini dinledi. Sonra şöyle buyurdu: Allah ona merhametiyle muamele etsin! Zira falanca sureden unuttuğum şu şu ayeti bana hatırlattı. \" Fethu'l-Bari Açıklaması: İmam Buhar! bu başlık ile sureleri isimleriyle birlikte zikretmeyi iyi karşılamayanlara cevap vermek istemiştir. Bunu iyi karşılamayanlar falanca sure ifadesi yerine, şu şu konuların zikredildiği sure demeyi uygun görmüşlerdir. Hac Bölümü'nde şöyle bir rivayet geçmişti: \"A'meş, Haccac İbn Yusuf'un minberde 'şu, şu konuların zikredildiği sure' dediğini işitmiş ve Ebu Mes'Od hadisi ile ona karşı çıkmıştı.\" Kadı [yaz şöyle demiştir: \"Ebu Mes'Od'dan nakledilen hadis, Bakara suresi örneğinde olduğu gibi, sureleri isimleri ile birlikte söyleyenler için delil teşkil eder. Alimler bu konuda farklı yorumlar yapmışlardır. Bazıları bunu caiz görürken, diğer bazıları ise mekruh kabul demiştir. Bunun yerine şu, şu konuların zikredildiği sure denmesini uygun görmüşlerdir.\" Hac Bölümü'nde re my/şeytan taşlama ile ilgili konularda İbrahim en-Nehaı'nin, Haccac'ın \"Bakara suresi demeyin!\" sözünü reddettiği ve ona itirazda bulunduğu nakledilmişti. Müslim'in rivayetinde ise, böyle demenin sünnet olduğu geçmektedir. Ayrıca o Ebu Mes'ud hadisine de yer vermiştir. Delil bakımından bundan daha güçlü olanı, İmam Buharı'nin bizzat Nebi Sallallahu Aleyhi ve Sellem'den naklettiği ifadelerdir. Nitekim bu konuda birçok sahih hadis nakledilmiştir. İmam Nevevı \"el-Ezkar\" adlı kitabında şöyle demiştir: \"Bakara suresi demek caizdir.\" Bu şekilde Ankebut suresine kadar sure isimlerini sıraladıktan sonra \"diğer sureler hakkında da aynı şey geçerlidir. Bu şekilde bir ifade kesinlikle mekruh değildir. Selef alimlerinden bazıları bunun mekruh olduğunu söylemiştir. Ancak doğrusu bunun mekruh olmadığıdır. Nitekim çoğunluk da bu kanaattedir]",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 66
			}
		}
	]
}