{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5047,
			"arabicnumber": 5047,
			"text": "Abdullah İbn Muğaffel'den şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem'in, devesi üzerinde yolda giderken Kur'an okuduğunu gördüm. Devesiyle ilerlerken Fetih suresini (veya Fetih suresinden bazı ayetleri) yumuşak yumuşak okuyordu. Bu arada terci' yapıyordu.\" Fethu'l-Bari Açıklaması: Terci'; Kur'an okurken hareke türlerinin birbirine yakın olması anlamına gelir. Bu kavramın asıl anlamı, tekrarlamaktır. Sesin terd' edilmesi, boğazda tekrarlanması anlamına gelir. Nitekim ileride Kitabu't-Tevhid'de Abdullah İbn Muğaffel'den nakledilecek hadiste bu şekilde açıklanacaktır. Söz konusu rivayette şöyle geçmektedir: \"Tır önce fethalı hemze, ondan sonra sakin elif, daha sonra ise diğer hemze ... \" Alimler Nebi Sallallahu Aleyhi ve Sellem'in neden böyle okuduğu hakkında iki görüş beyan etmişlerdir: a) Devenin kendisini sarsmasından dolayı böyle okumuştur. b) Meddi yerinde işba' etmiştir. Bu yüzden bu durum meydana gelmiştir. Bu ikinci görüş, hadisin akışına daha uygundur. Çünkü bu hadisin bir rivayetinde \"Eğer insanların başımıza toplanmayacağım bilseydim, size bu şekilde nağmeli okurdum\" şeklinde bir ifade yer almaktadır. Terd' bunun dışındaki yerlerde de sabit olmuştur. Ebu Muhammed İbn Ebı Cemra şöyle demiştir: \"Tercl'; okuyuşu güzelleştirmek demektir, name yaparak şarkı söyler gibi okumak manasına gelmez. Çünkü name yaparak şarkı söyler gibi Kur'an okumak, tilavetin esas gayesi olan huşı.1 ile çelişir.\" Hadisten Çıkarılan Sonuçlar 1- Nebi s.a.v. ibadet halini her zaman sürdürmüştür. Çünkü, deve üzerinde seyir halindeyken bile Kur'an okumakla yapılan ibadetten geri kalmamıştır. 2- Nebi s.a.v.'in açıktan Kur'an okuması, gafilleri uyarmak ve bilmeyenlere öğretmek gayesinin güdüldüğü kimi zamanlarda, ibadetlerin açıktan yapılmasının gizli yapılmasından daha faziletli olduğunu gösterir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 71
			}
		}
	]
}