{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5054,
			"arabicnumber": 5054,
			"text": "Abdullah İbn Amr'dan şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bana 'Kur'an'ı bir ayda hatmet!' dedi. Ben, 'bundan daha fazlasını yapacak güce sahibim' diye karşılık verdim. Nihayet Allah Reslilü şöyle buyurdu: Kur'arı'! yedi günde hatmet! Bundan daha ileri gitme!\" Fethu'l-Bari Açıklaması: \"Evlendik evleneli yatağımıza hiç basmadı\" ifadesi birlikte yatmadık manasına gelir .. \"Bir örtüyü de kaldırmış değil\" ifadesi de, birlikte olmadık anlamınadır. \"Bu durum bu şekilde uzayınca, babam Resulullah Sallallahu Aleyhi ve Sellem'e gidip durumu anlatmış.\" Öyle anlaşılıyor ki, Amr'ın babası, oğlu, hatasını anlayıp telafi eder umuduyla şikayetini geciktirmiştir. Ancak oğlu istikametini değiştirmeyince, eşinin hakkına riayet etmemesi yüzünden günaha düşmesinden endişe ettiği için onu şikayet etmiştir. Bazıları üç günde, bazıları bir haftada, bazıları da bir haftadan daha uzun zamanda Kur'an'ın hatmedilebileceğini söylemiştir. Ebu Davı1d ve Tirmizi sahih olarak Yezid İbn Abdullah İbnü'ş-Şahir kanalıyla Abdullah İbn Amr'dan merfu olarak şu rivayeti nakletmiştir: \"Üç günden daha az bir zamanda Kur'an'ı hatmeden, onu anlayamaz.\" Bu hadisin Said İbn Manslir'un sahih bir senetle İbn Mes'ud'dan nakledilen bir de şahidi vardır: \"Kur'an'ı bir haftada hatmedin! Üç günden daha az bir zamanda onu hatmetmeyin!\" Seleften birçok kimsenin Kur'an'ı bu süreden daha az zamada hatmettikleri bilinmektedir. Bu konuda İmam Nevevı şöyle demiştir: \"Tercih edilen görüşe göre bu durum, kişiden kişiye değişir. Kimin anlayışı yüksek, fikriyatı üst seviyede ise, bu belirtilen sürede Kur'an'ı hatmetmesi müstehap olur. Ancak Kur'an okumanın ana gayesi olan tefekkürü ve bir takım manaları anlamayı ihmal etmemek şartı aranır. Kim de ilim ve diğer dini konularla meşgulse varsa veya Müslümanların genel menfaatiyle ilgileniyorsa, kıraatteki manayı ihlal etmeyeceği sürede Kur'an'ı hatmeder. Bu iki duruma girmeyen kimsenin, bıkkınlığa yol açmayacak derecede mümkün olduğu kadar çok Kur'an okuması müstehaptır. Ancak ne söylediğini bilmeyecek şekilde Kur'an'ı okumamalıdır. Doğrusunu en iyi Allah bilir",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 79
			}
		}
	]
}