{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"66": "Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5062,
			"arabicnumber": 5062,
			"text": "Abdullah'tan rivayet edildiğine göre o, bir adamı bir ayeti okurken işitmiş. Ama Nebi Sallallahu Aleyhi ve Sellem'den O ayetin farklı şekilde okunduğunu öğrenmişti. (Abdullah anlatmaya devam ediyor:) Adamın elinden tuttum ve Resulullah Sallallahu Aleyhi ve Sellem'e götürdüm. (Olayı anlatınca Nebi s.a.v. şöyle) buyurdu: \"İkinizin de okuyuşu güzel. Böyle okuyun!\"556 Bildiğim en büyük hakikat onun şöyle buyurduğudur: [İhtilafa düşmeyin!] Zira sizden önceki toplumları ihtilafa düşmeleri helak etmiştir.\" Fethu'l-Bari Açıklaması: \"İhtilafa düşünce\" ifadesi, Kur'an'ın manası hakkında ayrılığa düşünce anlamına gelir. (Kur'an okumaktan uzuklaşın!) Bu ifade, daha fazla ihtilafın derinleşmemesi için ayrılın manasını taşır. Kadı Iyaz şöyle der: Buradaki ihtilaftan korkup Kur'an okumaktan alıkonma hususundaki nehiy muhtemelen Nebi s.a.v.dönemine özgü bir nehiydir. Zira \"Ey İman Edenler! Size açıklanınca üzüleceğiniz bir takım şeyleri sormayınlZ\" ayetinde ifade edildiği gibi, böyle bir ihtilaf, sonunda onları üzecek daha büyük yasakların veya emirlerin inmesinden korkulduğundandır. Zira böyle olaylardan sonra vahyin inme ihtimali her zaman vardı. Kur'an'ı okuyun ve okuduğunuz ayetlerin delalet ettiği ve sizi ona sürüklediği en kuvvetli anlamı kabul ederek aranızdaki görüş farklılıklarını ve yorumlarınızı telif edin. Fakat ayrılıklara yol açacak ve aranızdaki tartışmaları alevlendirecek bir durum ortaya çıkarsa okumayı kesin. O zaman kalplerinizin ülfet etmesi için, muhkem ve kesin olan görüşü tercih edip sizi ayrılığa götürecek müteşabih görüşleri ise terk edin. Cenab-ı Allah'ın şu ayetinin hükmünde olduğu gibi: \"Ondaki müteşabihlere uymaya meyilli olanları gördüğünüzde onlardan kendinizi sakındırınız.\" Diğer bir ihtimal de farzların edasındaki biçimde bir görüş ayrılığı sözkonusu olursa, o zaman okumayı bırakmak gerekir. Böyle bir ihtilaf anında yan yana durmaktan uzaklaşıp herkes kendi başına okumaya devam etsin anlamında söylemiş olması da muhtemeldir. Yukarıda Abdullah İbn Mes'ud ile iki sahabi arasında eda konusunda söz konusu olan ihtilaftan sonra Rasulullah'ın hakemliğine başvurmaları olayında olduğu gibi Hz. Nebi onlara \"hepiniz isabet ettiniz ve güzel yaptınız\" demişti. Bu ve bundan önceki hadiste cemaate ve Müslümanların birliğine teşvik; ayrılık ve ihtilafa düşmekten de sakındırma vardır",
			"grades": [],
			"reference": {
				"book": 66,
				"hadith": 87
			}
		}
	]
}