{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5076,
			"arabicnumber": 5076,
			"text": "Ebu Hureyre r.a.'dan, dedi ki: \"Ey Allah'ın Rasulü! Ben genç bir erkeğim. Bununla birlikte kendi hakkımda kötü bir iş yapacağımdan da korkuyorum. Kadınlarla evlenmek için de elimde hiçbir -şey bulamıyorum, dedim. Sustu, bana bir cevap vermedi. Daha sonra yine benzeri bir söz söyledim. Yine sustu, bana cevap vermedi. Daha sonra tekrar ona benzeri bir söz söyledim, yine sustu, bana bir cevap vermedi. Sonra bir daha benzeri bir şey söyledim, Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ey Ebu Hureyre, kalem senin ne ile karşılaşacağını yazmış ve mürekkebi kurumuştur. Buna göre ister kendini hadım et, ister vazgeç.\" Fethu'l-Bari Açıklaması: \"Evlenmemenin mekruh oluşu.\" Burada (evlenmeme diye tercüme edilen) 'tebettül'den maksat, evlenmekten ve buna bağlı olan zevklerden uzaklaşıp ibade te yönelmektir. Şanı yüce Allah'ın: \"Ve yalnız ona yöneldikçe yöneı.\"(Müzzemmil, 8) buyruğunda emredilen \"tebettül\"ü Mücahid tefsir edip, şöyle açıklamıştır: Ona tam bir ihlasla bağlan. Bu, anlam yoluyla bir tefsirdir. Yoksa tebettül'ün asıl anlamı, uzak kalmak demektir. Yani sen her şeyden uzaklaşarak ona yöne!. Fakat her şeyden uzaklaşarak Allah'a yönelmenin gerçekleşmesi, ancak yalnızca ona ihlasla ibadet ile sözkonusu olacağından bu şekilde tefsir edilmiştir. \"Hayaları burmak\", aslında erkeklerin yumurtalıklarının üzerini yarıp, onları çıkarmaktır. Onları bu işi yapmaktan men etmesindeki hikmet ise kafirlere karşı cihadın devam etmesi için nesiin çoğalmasının istenmesidir. Yoksa bu hususta izin vermiş olsaydı, muhtemelen peşpeşe bunu çokça yaparlardı. Böylelikle nesil kesilir, Müslümanlar nesiin kesilmesi sonucu azalır, kafirler çoğalırdı. Bu ise Muhammed'in Nebi olarak gönderilmesi maksadına aykırıdır. \"O da bize bunu nehyetti.\" Buradaki nehyin Ademoğulları hakkında -daha önce geçen gerekçeler sebebiyle- haram kılmak anlamıyla bir nehiy olduğunda görüş ayrılığı yoktur. Ayrıca bu uygulamada nefse eziyet vermek, bazen ölüme kadar götürebilecek zarar ile birlikte hilkati değiştirmek gibi fesadlar da bulunmaktadır. Bu uygulama ile erkeklik özelliği ortadan kaldırılmakta, Allah'ın hilkati değiştirilmekte, nimete karşı da nankörlük edilmektedir. Çünkü kişinin erkek olarak yaratılması, pek büyük nimetlerden birisidir. Kişi bunu ortadan kaldıracak olursa, kendisini kadına benzetmeye çalışmış ve mükemmelliktense, eksikliği tercih etmiş olur. Kurtubi dedi ki: Ademoğulları dışında hayvanların da burulması, yasaklanmış bir şeydir. Ancak etin lezzetinin artırılması ya da ona gelecek bir zararın önlenmesi gibi bir menfaatin sağlanması hali müstesnadır. Nevevi ise: Eti yenmeyen hayvanların burulması mutlak olarak haramdır, demektedir. \"Elbise karşılığında kadının nikahlanmasına ... \" Buradaki kasıt, belli bir süreye kadar yapılan mut'a nikahıdır. \"Günaha düşmek (el-anet).\" Burada zina anlamındadır. Günah, hayasızlık, ağır iş, hoşlanılmayan iş hakkında da (bu lafız) kullanılır. \"Ne ile karşılaşacağını yazan kalemin mürekkebi kurumuştur.\" Yani Levh-i Mahfuz'da yazılan ve takdir edilen şeyler yerini bulacaktır. Mukadderatın kendisiyle yazıldığı kalem artık kurumuş, mürekkebi kalmamıştır. Çünkü kendisiyle yazılacak şeyler de bitmiş bulunmaktadır. Iyad dedi ki: Allah'ın yazması, Levhi ve Kalemi, iman ettiğimiz ve ilmini yüce Allah'ın kendisine havale ettiğimiz gayb ilmindendir. \"Artık buna göre ister hayalarını bur, ister bırak.\" Yani sen bunu yapsan da, yapmasan da kader mutlaka yerine gelecektir. İfadede kendini burmanın hükmü sözkonusu edilmemiştir. Cevaptan çıkan anlam şudur: Bütün işler Allah tarafından ezelde takdir edilmiştir. Dolayısıyla hadım olmak da, olmamak da aynı şeydir. Onun takdir ettiği ne ise, mutlaka o gerçekleşecektir. \"Buna göre\" yani sen artık her şeyin Allah'ın kazası ve kaderi ile meydana geldiğini bildiğine göre, istediğini yap. Fakat burada hadım olmaya izin verilmiş değildir. Aksine bunun nehyedildiğine bir işaret bulunmaktadır. Şöyle buyurmuş gibidir: Sen her şeyin Allah'ın kazası ile gerçekleştiğini öğrendiğine göre senin kendini burmanda bir fayda olmaz. Nebi Sallallahu Aleyhi ve Sellem'in Osman İbn Maz'un'un bu hususta kendisine izin vermesini istemesi üzerine bu işi yapmasını yasakladığı geçmiş bulunmaktadır. Osman da Ebu Hureyre'nin hicretinden kısa bir süre önce vefat etmişti. Taberani, İbn Abbas'tan şöyle rivayet etmektedir: \"Bir adam Rasulullah Sallallahu Aleyhi ve Sellem'e bekarlığından şikayette bulunarak: Hayalarımı burayım mı diye sordu. Allah Rasulü: 'Başkasını buran ya da kendisini burduran bizden değildir', diye buyurdu.\" Hadiste hayaları burmak yeriimiş bulunmaktadır. Bunun ne gibi zararları olduğu az önce açıklanmıştır. Ayrıca kader tahakkuk ettikten sonra çeşitli çarelere başvurmanın faydası yoktur. Hadisten Çıkartılan Diğer Sonuçlar 1- Kişinin karşı karşıya bulunduğu sıkıntılı bir hali, büyük birisine şikayet etmesi meşrudur. İsterse bu şikayet konusu, müstehcen ve çirkin görülen hususlardan olsun. 2- Mehir bulamayan bir kimsenin evlenmekten vazgeçmemesi gerektiğine işaret vardır. 3- Bir şikayeti üç defaya kadar tekrarlamak caizdir. Susmakla verilen cevapla yetinmeyene de cevap verilebilir. 4- Sadece susmak suretiyle maksadı anlayacağı sanılan kimseye susup cevap vermemek caizdir. 5- Bir ihtiyacının karşılanmasını isteyen bir kimsenin bunu söylemeden önce böyle bir istekte bulunmaktaki mazeretini önceden dile getirmesi, sevilen (müstehab) bir şeydir",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 14
			}
		}
	]
}