{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5087,
			"arabicnumber": 5087,
			"text": "Sehl İbn Sa'd es-Saidl'den, dedi ki: \"Bir kadın Rasulullah Sallallahu Aleyhi ve Sellem'e: Ey Allah'ın Rasulü, kendimi sana hibe etmek amacı ile geldim,\" dedi. {SehI} dedi ki: Rasulullah ona baktı, onu baştan aşağıya süzdü. Daha sonra başını önüne eğdi. Kadın onun kendisi hakkında bir hüküm vermediğini görünce yerine oturdu. Ashabından bir adam kalkıp dedi ki: Ey Allah'ın Rasulü! Eğer sen onunla evlenmeyi düşünmüyorsan onu benimle evlendir. Allah Rasulü: Peki yanında (mehir olarak verecek) bir şeyin var mı, diye sordu. Adam: Allahla yemin ederim ki hayır, ey Allah'ın Rasulü, dedi. Bunun üzerine şöyle buyurdu: Ailenin yanına git, bak, herhangi bir şey bulabilir misin? Adam gitti, sonra geri döndü. Hayır, Allah'a yemin ederim hiçbir şey bulamadım, dedi. Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bir bak, hiç olmazsa demirden bir yüzük olsun. Adam gitti, sonra geri dönüp şöyle dedi: Hayır, Allah'a yemin ederim ey Allah'ın Rasulü, demirden bir yüzük dahi bulamadım. Fakat şu izarım (belden aşağısını örten peştamal) var. Yarısı onun olsun. -Sehl dedi ki: O sahabinin izarının üzerine giyineceği ridası yoktu.- Rasulullah bunun üzerine şöyle buyurdu: Bu kadın senin izarını ne yapsın? Sen onu giydiğin takdirde o izardan bu kadının üzerinde bir şeyolmaz. Şayet o giyecek olursa, ondan senin giyineceğin bir payın kalmaz. Bunun üzerine adam da oturdu. Oturuşu da uzayıp gitti, sonra kalktı. Rasulullah Sallallahu Aleyhi ve Sellem onun gittiğini görünce, çağırılmasını emir buyurdu, onu çağırdılar. Gelince, Allah Rasulü ona: Kur'an'dan neyi ezbere biliyorsun, diye sordu. Adam: Şu sureyi, şu sureyi ezbere biliyorum deyip, onları saydı. Allah Rasulü: Bunları ezberden okuyabiliyor musun, diye sordu. Adam: Evet deyince, şöyle buyurdu: Git, ezbere bildiğin Kur'an sureleri dolayısıyla seni bu kadına malik kıldım (onunla evlendirdim)",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 25
			}
		}
	]
}