{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5092,
			"arabicnumber": 5092,
			"text": "İbnu Şihâb şöyle demiştir: Bana Urve haber verdi ki, o, Âişe'ye: \"Eğer yetim kızlar hakkında adaleti yerine getiremeyeceğinizden korkarsanız, sizin için halâl olan (diğer) kadınlardan ikişer, üçer, dörder olmak üzere nikâh edin. Şayet (bu suretle de) adalet yapamıyacağınızdan endîşe ederseniz, o zaman bir tane ile, yahut mâlik olduğunuz câriye ile yetinin... \" (en-Nisâ: 3) âyetinin tefsirini sormuş, Âişe de şöyle cevâb vermiştir: Ey kardeşimin oğlu! Âyetteki bu yetime kız, şu öksüz kızdır ki, velîsinin velayet ve vesayeti altında bulunur. Velîsi onun güzelliğine ve malına rağbet eder, fakat o kızın hakkı olan mehrinde eksiltme yapmak ister (onunla böyle evlenmek ister). İşte (bu âyette) o çeşit velîler, velayetleri altındaki yetîme kızları -mehirlerini kemâle ulaştırmak hususunda adalet edinceye kadar- nikâh etmelerinden nehyolundular da bunlardan başka kendilerine halâl olan kadınlardan nikâh etmekle emrolundular. devamla şöyle dedi: Bu âyet indikten sonra insanlar Rasûlüllah'tan fetva istediler. Bunun üzerine Allah şunu indirdi: \"Senden kadınlar hakkında fetva isterler. De ki: Onlara dâir fetvayı size Allah veriyor. Kendileri için yazılmış olanı onlara vermediğiniz ve nikahlamalarını da beğenip istemediğiniz yetim kızlar ve küçük çocuklar hakkında, bir de yetimlere karşı adaleti ayakta tutmanız hususunda işte Kitâb 'da okunup duran âyetler... \"(en-Nisâ: 127) âyetinde Allah onlara şunu indirdi (yani bu âyetin delâlet ettiği ma'nâ şudur): Onlar, yetîm kız güzellik ve mal sahibi olduğu zaman, bu kızın nikâhına, nesebine ve mehrini kemâle ulaştırmaya rağbet etmişlerdir. Kız mal ve güzellik azlığından dolayı rağbet edilmemiş olduğu zaman ise, o kızı terkedip, ondan başka kadınları almışlardır. dedi ki: Kıza rağbet etmedikleri, istemedikleri zaman onu nasıl terkediyorlarsa, rağbet ettikleri zamanda da o kızı nikâh etmelerine hakları yoktur. Ancak kıza adalet etmeleri ve ona mehirde en yüksek hakkını vermeleri hâlinde nikâh edebilirler",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 30
			}
		}
	]
}