{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5096,
			"arabicnumber": 5096,
			"text": "Usame İbn Zeyd r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ben, benden sonra erkekler için kadınlardan daha zararlı bir fitne bırakmış değilim.\" Diğer tahric eden Tirmizi edeb Fethu'l-Bari Açıklaması: \"Kadının uğursuzluğundan sakınılması.\" Burada (uğursuzluk anlamı verilen): \"eş-Şu'm\" uğur anlamına gelen \"el-yumn\"un zıttıdır. \"Ve yüce Allah'ın: \"Muhakkak ki eşleriniz ve evlatlarınızdan size düşman olanlar vardır.\"(Teğabun, 14) buyruğu.\" Bununla (Buhari) uğursuzluğun yalnızca bazı kadınlar hakkında sözkonusu olduğunu, diğer bazıları hakkında da sözkonusu olmadığını işaret etmek istemiş gibidir. Buna da ayet-i kerime'deki kısmllik bildiren ( ... dan anlamındaki) \"min\"in delaletinden hareket ederek işarette bulunmaktadır. Bir hadiste anlatılanlar buna açıklama getirebilir mahiyette olabilir. Sözkonusu bu hadisi Ahmed rivayet ettiği gibi İbn Hibban ve Hakim de sahih olduğunu belirtmişlerdir. Hadisi Said merfu olarak rivayet etmiş bulunmaktadır: \"Şu üç husus Ademoğlu'nun mutluluğundandır: Saliha bir kadın, uygun bir mesken ve uygun bir binek. Şu üç husus da Ademoğlu'nun bedbahtlığındandır: Kötü kadın, kötü mesken ve kötü binek.\" \"Benden sonra erkekler için kadınlardan daha zararlı bir fitne bırakmış değilim.\" Şeyh Takıyyuddin es-Sübki der ki: Buhari'nin bu hadisi, ayet-i kerimeyi bab başlığında zikrettikten sonra İbn Ömer ve Sehl yolu ile gelen iki hadisin akabinde zikretmesi, uğursuzluğun, kendisinden düşmanlık ve fitne görülen kadınlara tahsis edildiğine bir işarettir. Bazı kimselerin anladığı gibi, kadının topuğundan bile uğursuzluğun sözkonusu olduğu yahut kadının bunda bir etkisinin olduğu şeklindeki anlam doğru değildir. Zaten bu, ilim adamlarından hiçbir kimsenin belirtmediği bir görüştür. Kadının bunda bir sebep olduğunu söyleyen kimse de cahildir. Çünkü şeriat koyucu, yağmuru yıldızların doğuşlarına bağlayan kimse hakkında mutlak olarak kafir ifadesini kullanmıştır. O halde kadının herhangi bir dahlinin bulunmadığı bir husus dolayısı ile şerri kadına nispet eden kimsenin durumu ne olabilir? Olsa olsa görülen bir kaza ve kadere uygun bir halin ortaya çıkmasından ibarettir. Bunun sonucunda da nefis bundan nefret eder. Böyle bir hal ile karşı karşıya kalan kimsenin böyle bir kadını terk etmesinin kendisine bir zararı olmaz. Ancak o fiili o kadına nispet etmek gibi bir kanaat taşımaması şarttır. Hadisten Çıkartılan Sonuçlar 1- Kadınlar dolayısıyla fitneye maruz kalmak, başkaları dolayısıyla fitneye maruz kalmaktan daha ağırdır. Buna yüce Allah'ın: \"Kadınlar ... gibi arzulanan şeylere sevgi, insanlara süslü gösterildL\" (Ali İmran, 3/14) buyruğu da buna tanıklık etmektedir. Yüce Allah onları arzulanıp, sevilen şeyler arasında saymış ve diğer türler arasında önce onları zikrederek başlamıştır. Bu da onların bu hususta asılolduklarına bir işarettir. Yine müşahede ile görülen şu ki: Erkeğin, yanında bulunan hanımından olma çocuğuna karşı olan sevgisi, bu durumda olmayan başka bir kadından doğma çocuğuna olan sevgisinden daha fazladır. 2- Hukemadan birisi şöyle demiştir: Kadınlar tamamıyla bir şerdir. Onlardaki en şer olan husus ise onlardan müstağni kalamayıştır. Kadınlar \"akll ve dinı bakımdan eksiklik\" ile nitelendirilmiş olmakla birlikte erkeği aklı ve dinı bakımdan eksiklik gerektiren hususları işlemeye de iterler. Erkeğin dinı hususlar ile uğraşmaktan uzaklaşarak dünyaya talipolmak üzere hırs göstermesi gibi... Bu ise fesadın en ağır halidir. Müslim, Ebu Said yoluyla gelen \"ve kadınlardan sakınınız\" diye bilinen hadisin bir kısmında şunları da zikretmiş bulunmaktadır: \"Çünkü İsrailoğullarının fitneye ilk maruzkalması, kadınlar hususunda olmuştu",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 34
			}
		}
	]
}