{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5130,
			"arabicnumber": 5130,
			"text": "Hasan(-ı Basrl)ldan, dedi ki: \"Nikahlanmalarına engel olmayınız.\"(Bakara, 232) buyruğu hakkında bana Ma'kil İbn Yesar'ın tahdis ettiğine göre, bu buyruk, kendisi hakkında nazil olmuştur. Dedi ki: Bir kız kardeşimi bir adam ile evlendirmiştim. Onu boşadı. Nihayet iddeti bitince tekrar gelip ona talip oldu. Ben de ona: Seni evlendirdim, sana kızkardeşimi verdim. Sana ikramda bulundum, sen de onu boşadın. Şimdi de gelip ona talip oluyorsun. Hayır, Allah'a yemin ederim ki ebediyyen sana geri dönmeyecektir, dedim. Adam kötü tarafı olmayan birisi idi. Kadın da ona dönmek istiyordu. Bunun üzerine yüce Allah: \"Nikahlanmalarına engel almayınız\" buyruğunu indirdi. Bu sefer ben: Şimdi emredileni yapacağım, ey Allah'ın Rasulü dedim.\" (Ravi) dedi ki: Kızkardeşini onunla evlendirdi. Fethu'l-Bari Açıklaması: \"Yüce Allah'ın: \"Kadınları boşayıp da iddetlerini bitirdiler mi. .. nikahlanmalarına engel almayınız. \"(Bakara, 232) buyruğu\", onların evlenmelerini engellemeyiniz, demektir. \"Ay halinden temizlendi mi?\" Sanki buradaki sebep, onun bu adamdan daha çabuk gebe kalmasını sağlamaktır. \"Onunla birlikte olmayı iste.\" İstibda' ve mubadaa, dma' demektir. Yani sen ondan hamile kalmak üzere seninle dma' etmesini iste. Cima' etmek anlamı ile \"mubadaa\", ferc demek olan \"el-bud'''dan türetilmiştir. \"Bunu ancak soylu çocuk sahibi olmak arzusuyla yapardı.\" Yani böyle bir erkeğin soyundan bunu elde etmek istiyordu. Çünkü onlar kahramanlık yahut cömertlik ya da başka hususlarda büyükleri ve ileri gelenleri sayılan kimselerden bu işi yapmalarını istiyorlardı. \"Hepsi de o kadınla dma' ederdL\" Göründüğü kadarıyla bu, kadının rızasıy-. la ve kadının onlarla, onların da kadın ile anlaşması sonucunda oluyordu. \"Kötü bir tarafı bulunmayan birisi idi.\" es-Sa'lebi'nin rivayetinde \"sadakatli, doğru bir adam idi\" şeklindedir. İbnu't-Tin der ki: İyi birisiydi, demektir. Mübarek İbn Fedale'nin el-Hasen'den diye naklettiği Ebu Müslim el-Kecd'deki rivayetinde şöyle denilmektedir: \"el-Hasen dedi ki: Yüce Allah adamın hanımına, hanımının da kocasına ihtiyacı olduğunu bildiğinden, bu ayet-i kerimeyi indirdi.\" Bunun üzerine yüce Allah şu: \"Nikahlanmalarına engel almayınız\" buyruğunu indirdi. Bu ifadeler, ayet-i kerimenin bu olay sebebiyle nazil olduğu hususunda gayet açıktır. Durumun böyle olması, ifadelerdeki hitabın zahirinin bütün kocalara yönelik olmasına mani değildir. Çünkü ayet-i kerimede: \"Kadınları boşadığınızda ... \" diye buyurulmuştur. Fakat ayetin geri kalan bölümlerinde: \"Artık kocalarıyla nikahlanmalarına engelolmayınız\" diye buyurulmaktadır. Bu da bu engellemenin veliler ile ilgili olduğu hususunda açık bir ifadedir. Tefsir bölümünde veliler ile ilgili olan el-'adl (evlenmeyi engelleme}nin açıklaması, yüce Allah'ın: \"Kadınlara zorla mirasçı olmanız size helal değildir. Onları da engellemeyin ... \"(Nisa, 19) buyruğu açıklanırken geçmiş bulunmaktadır. Böylelikle buyruk, her bir yerde kendisine uygun şekilde delil gösterilir. \"Bunun üzerine ben de: Şimdi bunu yapacağım ey Allah'ın Rasulü dedim. (Ravi) dedi ki: Kızkardeşini onunla evlendirdi.\" Yani yeni bir akid ile kızkardeşini ona geri verdi. Ebu Müslim el-Kecci'nin, Mübarek İbn Fedale yoluyla elHasen'den naklettiğine göre \"Ma'kil İbn Yesar bunu işitince: Rabbimin buyruğunu duydum ve hemen itaat edip uydum, dedi. Kızkardeşinin kocasını çağırdı ve onu onunla evlendirdi.\" es-Sa'lebi'nin rivayetinde: \"Şüphesiz ben Allah'a iman ediyorum\" diyerek hemen kızkardeşini ona nikahladı ve yemini dolayısıyla kefarette bulundu.\" İbn Battal dedi ki: Veli hususunda ilim adamları ihtilaf etmişlerdir. Aralarında Malik, es-Sevri, el-leys,• Şafii' ve başkalarının da bulunduğu cumhur şöyle demektedir: Nikahta veliler asabe denilen akrabalardır. Dayının, annenin babasının, anne bir kardeşlerin ve benzerlerinin velayetleri yoktur. Hanefilerden nakledilen rivayete göre ise bunlar veliler arasında sayılırlar. Baba ölüp de çocuklarına bir adamı vas i tayin ederse acaba bu vasi nikah akdi hususunda akraba olan veli gibi mi olur, ondan önce mi gelir, yoksa onun velayeti olmaz mı? Bu hususta görüş ayrılıkları vardır. Rabia, Ebu Hanife ve Malik, vasi önceliklidir, derler. Bunların lehine şu delil gösterilmiştir: Eğer baba hayatta iken muayyen bir adama böyle bir hak verecek olursa, velilerden herhangi bir kimsenin ona itiraz etme yetkisi yoktur. Dolayısıyla ölümünden sonra da aynı şey sözkonusudur. Ancak buna şöyle itiraz edilmiştir: Velilik ölüm sebebiyle intikal etmiş bulunuyor. Dolayısı ile hayattaki hal ile kıyas edilmez. ' ilim adamları nikah hususunda velinin şart olup olmadığı hakkında da ihtilaf etmişlerdir. Cumhur bu kanaatte olup, şöyle demişlerdir: Kadın hiçbir zaman kendi kendisini evlendiremez. Onlar sözü geçen hadisleri delil göstermişlerdir. Bu delillerin en kuvvetlilerinden birisi ise sözü geçen ayetin nüzulü ile ilgili olarak zikredilen bu sebepte anlatılanlardır. Şüphesiz bu, velinin muteber oluşuna dair en açık bir delildir. Aksi takdirde kardeşinin onun nikahını engellemesinin bir anlamı olmazdı. Diğer taraftan kadının kendisini evlendirme yetkisi bulunsaydı, kardeşine ihtiyacı bulunmazdı. Yetkisi elinde bulunan bir kimse hakkında da, başkası onu o yetkisinde kullanmaktan alıkoydu, denilemez. İbnu'l-Munzir'in nakletliğine göre ashab-ı kiramdan herhangi bir kimsenin bundan farklı bir kanaati olduğu bilinmemektedir. Malik'ten gelen bir rivayete göre eğer kadın soylu birisi değilse kendi kendisini evlendirebilir. Ebu Hanife ise velinin hiçbir şekilde şart olmadığı görüşüne sahiptir. Kadın denk birisi ile evlendiği takdirde velisinin izni olmasa dahi kendisini evlendirmesi caizdir. O, buna alışverişe kıyası delil göstermiştir. Kadın tek başına alışveriş yapabilir. Velinin şart olduğuna dair varid olan hadisleri de küçük kız ile ilgili yorumlamış ve bu hadislerin genel ifadelerini de böyle bir kıyas ile özelleştirmiş (tahsis etmiş)tir. Böyle bir şey usul açısından uygun görülmüştür. Bu da umumun kıyas ile tahsis edilmesinin caiz oluşudur. Ancak kaydedilen Ma'kil ile ilgili hadis böyle bir kıyası ortadan kaldırmaktadır. Çünkü Ma'kil'in hadisinden anlaşıldığına göre veli engelolacak olursa, sultan (hakim ve benzeri yetkililer) ona engellemesinden vazgeçmesini emretlikten sonra ancak evlendirme cihetine gider. Eğer o da kabul ederse mesele yok, şayet ısrar ederse hakim ona rağmen evlendir(ebil)ir. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 66
			}
		}
	]
}