{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5140,
			"arabicnumber": 5140,
			"text": "Urve bin Zubeyr r.a.'den rivayete göre; \"O, Aişe r.anha'ya soru sorarak ona dedi ki: Anacığım, \"Eğer yetim kızlara adaletIi davranamayacağınızdan korkarsanız ... yahut sahibi olduğunuz cariye(ler) ile yetinmelisiniz.\"(Nisa, 3) buyruğu (ne demektir, diye sordum). Aişe dedi ki: Kızkardeşimin oğlu! Bu ayet, velisinin himayesinde bulunup, velisinin de güzelliğine, malına raşbet ettiği, fakat mehrini de eksik vermek istediği yetim kız çocukları hakkındadır. Bunlarla mehirlerini eksiksiz vermek suretiyle onlara karşı adalet yapmaları hali dışında, velayetleri altındaki kızları nikahlamaları yasaklandı ve adaletli davranmayacakları takdirde onların dışındaki kadınları nikahlamaları emrolundu. Aişe dedi ki: Bundan sonra insanlar Rasulullah Sallallahu Aleyhi ve Sellem'den fetva isteyince, yüce Allah da: \"Kadınlar hakkında senden fetva isterler. .. Kendilerini nikahlamayı istediğiniz öksüz kızlar ... \"(Nisa, 127) buyruğunu indirdi. Yüce Allah bu ayeti indirerek onlara şunları söyledi: Eğer yetim kız, varlıklı ve güzelolup, onu nikahlamayı arzu eder, nesebini beğenir ve mehrini (emsalinden) daha düşük vermek isterlerdi. Şayet malı ve güzelliği az olduğu için onu beğenmeyecek olurlarsa o yetim kızı bırakır, ondan başka bir kadın alırlardı. Aişe dedi ki: Onunla evlenmek istemedikleri zaman onu bıraktıkları gibi, onunla evlenmek istedikleri takdirde ona karşı adaletli davranarak, hak ettiği mehrini eksiksiz vermedikçe onu nikahlayamazlar.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın: \"Eğer yetim kızlara adaletli davranamayacağınızdankorkarsanız ... nikahlayın.\"(Nisa., 3) buyruğu dolayısı ile yetim kızın evlendirilmesi.\" Buhari bu başlık altında Aişe'nin sözü geçen ayetin tefsirine dair hadisini zikretmektedir. Bu hadise dair açıklamalar daha önce Tefsir bölümünde(4574.hadiste) geçmiş bulunmaktadır. Hadiste babanın dışındaki velinin ister bakire, ister dulolsun, velayeti altındaki kızı evlendireceğine delalet bulunmaktadır. Çünkü yetim kız, buluğdan küçük ve babasız olan kız demektir. Böyle bir kızın evlendirilmesi izni, mehrinin düşük verilmemesi şartına bağlıdır. Bu durumda böyle bir şartı kabul etmeyenlerin de güçlü bir delil ortaya koymala'rı gerekir. Bazı Şafii'ler: \"Yetim kızın emri alınmadıkça nikahı kıyılmaz\" hadisini delil göstererek şöyle demişlerdir. Eğer: Küçük kızın emri istenmez denilecek olursa biz de şöyle deriz: Bunda onu evlendirmenin buluğa erip, emir verme ehliyetine sahip hale gelinceye kadar erteleneceğine işaret vardır. Şayet: Buluğa erdikten sonra da yetim kalmaz, denilecek olursa şöyle deriz: İfadenin takdiri şöyledir: Yetim kız buluğa erip onun emri alınmadıkça nikahlanmaz. Böylelikle deliller bir arada telif edilmiş olur",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 76
			}
		}
	]
}