{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5141,
			"arabicnumber": 5141,
			"text": "Sehl r.a.'dan rivayete göre \"Bir kadın Nebi Sallallahu Aleyhi ve Sellem'e gelerek: Ona kendisini (kendisiyle evlenmeyi) arz etti. Allah Rasulü: Bugün için kadınlara bir ihtiyacım yok, dedi. Bir adam: Ey Allah'ın Rasulü, onu benimle evlendir deyince, neyin var diye sordu. Adam: Hiçbir şeyim yok deyince, Allah Rasulü: Ona demirden bir yüzük dahi olsa bir şey ver, diye buyurdu. Adam: Hiçbir şeyim yok deyince, Allah Rasulü: Kur'an'dan ezberinde ne var, diye sordu. Adam: Şu şu dedi. Allah Rasulü: Ezberindebulunan Kur'an('ı ona öğretmen) karşılığında onu sana mülk verdim, diye buyurdu.\" Fethu'l-Bari Açıklaması: \"Evlenmeye talip olan kişi veliye: Filan hanım ile beni evlendir dese, o da: Şu şu karşılığında seni evlendirdim diyecek olursa, kocaya: Razı oldun mu ya da kabul ettin mi demese dahi nikah caiz olur.\" Bu başlık, şu meseleye cevap olmak üzere açılmıştır: İ1timas (evlendirme talebinde bulunmak), kabul yerine geçer mi ve böylelikle icabcliı önce kabulü n yapılması gibi olur mu? Kabulün icabdan önce oluşuna örnek bir kimsenin: Ben filan ile şu mehir karşılığında evlendim deyip, velinin de: Ben de bu mehir ile onu seninle evlendirdim demesi gibidir. Böyle bir durumda acaba kabulün tekrar edilmesi de kaçınılmaz mı olur? Musannıf (Buhari) kendisini hibe eden kadın ile ilgili kıssadan şunu istinbat etmiştir: Nebi Sallallahu Aleyhi ve Sellem'in: \"Ezberindeki Kur'an(ı ona öğretmen) karşılığında onu seninle evlendirdim\" demesinden sonra adamın: Kabul ettim, dediği nakledilmemiştir. Fakat el-Mühelleb buna itiraz ederek şöyle demektedir: Konuşmanın bu kıssadaki akışı, ayrıca evlenme talebinde bulunanın kabulünü gerektirmemiştir. Çünkü zaten bundan önce geçen konuşmalar, istek ve bu hususta karşılıklı diyalog buna gerek bırakmamıştır. Bu şekilde evlenmek isteği olan bu adamın durumunda ki bir kimsenin daha önce evlenme istediğine dair bilgi dolayısıyla ayrıca kabul ettiğini açıkça ifade etmesine ihtiyaç yoktur. Razı oluşuna dair karinelerin bulunmadığı başka kimselerden durumu farklıdır. el-Mühelleb'in bu itirazının ifade ettiği nihai anlam da şudur: O, Buhari'nin istidlalinin doğru olduğunu kabul etmekle birlikte, bunu bazı talipler için özel olarak kabul etmekte, diğer bazıları için bunun sözkonusu olamayacağını belirtmektedir",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 77
			}
		}
	]
}