{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5143,
			"arabicnumber": 5143,
			"text": "el-A'rec'den, dedi ki: \"Ebu Hureyre, Nebi Sallallahu Aleyhi ve Sellem'den şöyle buyurduğunu nakletmektedir: Zandan çokça sakınınız. Çünkü zan sözün en yalanıdır. İnsanların gizliliklerini araştırmayın, başkalarının gizli konuşmalarını dinlemeye kalkışmayın. Birbirinize buğzetmeyin ve kardeşler 0Iun.\" Bu Hadis 6064, 6066, 6724 numara ile gelecektir [-5144-] \"Ve bir kimse kardeşinin talip olduğuna onu nikahlayıncaya ya da terk edinceye kadar kendisi talip olmasın.\" Fethu'l-Bari Açıklaması: Cumhur, buradaki nehy, haramlık ifade eder demiştir. el-Hattabi der ki: Buradaki nehy tedib içindir. Fukahanın çoğunluğuna göre akdin batıl olmasına sebep teşkil eden, haram kılan bir nehy değildir. Evet, Hattabi böyle demiştir ama, buradaki nehyin haramlık ifade edici olması ile akdin batıl olması arasında cumhura göre bir ayrılmazlık sözkonusu değildir. Aksine onlara göre nehy haramlık ifade eder, ama akdin de batıl olmasını gerektirmez. Hatta Nevevi bu buyruktaki nehyin haramlık ifade ettiği hususunda icma' bulunduğunu nakletmiştir. Ancak fukaha, şartları hususunda ihtilaf halindedirler. Şamlerle, Hanbel1ler şöyle demektedir: Haram olması kendisine talip olunan kadının kabulünü açıkça ifade ettiği yahut izninin icab (teklifi kabul) olarak itibar edileceği yerde izin vermesi halinde sözkonusudur. Eğer teklifi kabul etmediğine dair açık ifade varsa haramlık sözkonusu değildir. Eğer ikinci talip durumu bilmiyorsa,öyle bir talebi bilmemekle birlikte kendisinin de talip olması caizdir. Çünkü aslolan mubahlıktır. Tirmizi'nin, Şafiı'den nakletliğine göre bu başlıktaki hadisin anlamı şudur: Bir adam bir kadına talip olur, o da onunla evlenmeye razı olup bu evliliğe meylinin bulunduğunu ortaya koyarsa, artık onun bu talebinden sonra bir başkasının ona talip olma hakkı yoktur. Eğer kadının razı olduğunu ve meylinin bulunduğunu bilmiyor ise, ona talip olmasında bir sakınca yoktur. Bunu da birinci talip, ikinci talibe evlenmesi için izin verdiği takdirde haramlık hükmünün kalkacağına delil göstermiştir. Fakat bu husus, sadece kendisine izin verilene ait bir özellik mi olur yoksa başkası hakkında da bu haramlık kalkar mı? Çünkü birinci talibin mücerred olarak verdiği izin, artık onun o kadın ile evlenmekten vazgeçtiğini göstermektedir. Onun bu vazgeçmesi ile de başkasının da ona talip olması caiz olur. Kuvvetli görülen ikincisidir. Bu durumda kendisine izin verilen kişi hakkında caiz oluş açıkça onun sözkonusu edilmesi iledir. İzin verilen dışındakiler için de onun gibi değerlendirilmeleri suretiyledir. Şafiilerden er-Ruyanı açıkça şunu ifade etmiştir: Haramlık birinci kişinin talip oluşunun caiz olması halinde sözkonusudur. Eğer iddet beklemekte olan bir kadına talip olmak gibi yasak bir talep ise, iddetin bitişinden sonra ikincisinin ona talip olmasında bir zarar yoktur. Bu da açıkça anlaşılan bir durumdur. Çünkü böyle bir talep ile birincisinin herhangi bir hakkı sabit değildir. Nebi efendimizin: \"Kardeşinin talip olması üzerine\" buyruğu da şuna delil gösterilmiştir: Haramlık, talip olanın Müslüman olması halinde sözkonusudur. Eğer zimmı bir erkek, zimmı bir kadına talip olur, Müslüman da ona talip olmak isterse bu mutlak olarak onun için caizdir. Bu el-Evzaı'nin de görüşü olup, Şafillerden İbnu'l-Münzir, İbn Cuveyriye ve el-Hatlabı de ona muvafakat etmişlerdir. Hadisin Müslim'de yer alan rivayetinde Ukbe İbn Amir'in baş tarafların daki şu sözleri de bunu desteklemektedir: \"mu'min mu'minin kardeşidir. Bu sebeple mu'minin, kardeşinin alışverişi üzerine alışveriş yapması da onun talip olduğuna -vazgeçinceye kadar- talip olması da helal değildir.\" el-Hattabı derki: Yüce Allah kafir ile Müslüman arasında kardeşlik bağını kestiğinden, buradaki yasak Müslümana mahsustur. İbnu'l-Münzir der ki: Bu hususta aslolan, mani delil varid oluncaya kadar mubahlıktır. Men edici delil de Müslüman ile kayıtlı olarak gelmiştir. Dolayısıyla bunun dışında da asılolan mubahlık hali üzere kalmaya devam etmektedir. Bununla birlikte cumhur bu hususta zimmınin Müslüman gibi değerlendirileceği görüşündedir. Burada \"kardeşi\" tabiri ise çoğunlukla görülen hali ifade etmek içindir. Dolayısıyla bunun bir mefhumu (bundan hareketle çıkartılması gereken bir hüküm) yoktur. Yüce Allah'ın: \"Çocuklarınızı öldürmeyiniz\" buyruğu gibidir. Bu hadis bir erkeğe evlenme teklifinde bulunmuş bir kadının bulunması halinde, bir başka kadının da aynı teklifte bulunmasının haram oluşuna delil gösterilmiştir. Böylelikle kadınların hükmü de erkeklerin hükmü gibi kabul edilmiştir. Bunun da şekli şöyle olur: Bir kadın bir erkekle evlenmek ister ve bundan dolayı da ona onunla evlenmek istediğini söyler, erkek de -daha önce geçtiği üzere- onun istediğine olumlu karşılık verir. Bir başka kadın gelerek ona aynı teklifi yapar, kendisi ile evlenmeye teşvik eder ve kendisinden önce teklifte bulunan kadına olan rağbetini de azaltmaya çalışır. Fukaha fazilet sahibi erkeklere talip olmanın müstehab oluşunu açıkça dile getirmişlerdir. Ancak bu hususun kendisine talip olunacak erkeğin, yalnızca onlardan birisi ile evleneceğini kararlaştırmış olması halinde sözkonusu olacağı gayet açıktır. Her ikisi ile de evlenmeyi kararlaştıracak olursa haramlık sözkonusu olmaz",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}