{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5148,
			"arabicnumber": 5148,
			"text": "Enes'ten rivayete göre: \"Abdurrahman İbn Avf, bir kadın ile bir çekirdek ağırlığı (altın mehir) ödemek üzere evlendi. Nebi Sallallahu Aleyhi ve Sellem onda güveyoluşun sevincini görünce, sebebini sordu, o da: Ben bir kadın ile bir çekirdek ağırlığı (altın mehir) ödemek üzere evlendim, dedi.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın: \"Kadınlara mehirlerini hoşnutlukla verin.\"(Nisa, 4) buyruğu, me hrin çokluğu, mehrin caiz olan asgarı miktarı, yüce Allah'ın: \"Onlardan birisine yüklerle (mehir) vermiş olsanız bile ondan bir şeyalmayın. \"(Nisa, 20) buyruğu yine şanı yüce Allah'ın: \"Kendilerine mehir tayin etmemiş olduğunuz hanımları ... \"(Bakara, 236) buyruğu\" Bu başlık, mehrin asgarı miktarının tespit edilmeyeceği amacı ile açılmıştır. Bu hususta muhalefet edenler Malikllerle, Hanemerdir. Buhari'nin zikretmiş olduğu buyrukların delil gösterilme şekli de \"mehirlerini\" ve \"bir mehir\" buyruklarının mutlak olarak zikredilmesi ile Sehl'in hadisindeki: \"Demirden bir yüzük de olsa ... \" ifadeleridir. \"Mehrin çokluğu\" sözleri, lafzan mecrur olup, okumuş olduğu ayet-i kerimedeki yüce Allah'ın buyruğuna atfedilmiştir. Bu da: \"Onlardan birisine yüklerle (mehir) vermiş olsanız bile\"(Nisa, 20) buyruğudur. Bunda mehrin çok olmasının caiz oluşuna işaret bulunmaktadır. Mehrin çokluğunun caiz oluşuna Ömer R.A. ile bu hususta tartışan kadın da bunu delil göstermiştir. Sözkonusu bu rivayeti Abdurrezzak, Ebu Abdurrahman es-Sülemı yoluyla rivayet etmiştir. Ebu Abdurrahman dedi ki: Ömer: Kadınların mehri hususunda aşırıya gitmeyiniz deyince, bir kadın: Buna yetkim yok, ey Ömer dedi. Çünkü yüce Allah: \"Onlardan her birisine bir kantar altın vermiş olsanız dahi\" diye buyurmaktadır. (Ebu Abdurrahman) İbn Mesud'un kıraatinde böyledir, demiştir. Bunun üzerine Ömer: Bir kadın Ömer'le tartıştı ve Ömer'e karşı bağlayıcı delili ortaya koymuş oldu, dedi",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 83
			}
		}
	]
}