{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5163,
			"arabicnumber": 5163,
			"text": "İbrahim İbn Ebi Osman'dan, o Enes İbn Malik r.a.'den naklen dedi ki: \"Biz Rifaa oğulları mescidinde iken (Enes İbn Malik) yanımıza uğradı. Onu şöyle derken dinledim: Nebi Sallallahu Aleyhi ve Sellem Ümmü Suleym'in evinin yakınlarından geçti mi yanına gelir, ona selam verirdi.\" Daha sonra Enes dedi ki: Nebi Sallallahu Aleyhi ve Sellem Zeyneb ile gerdeğe girmiş yeni damat idi. Ümmü Suleym bana: Rasulullah Sallallahu Aleyhi ve Sellem'e bir hediye göndersek, dedi. Ben de: Gönder, dedim. O da bir miktar hurma, yağ ve keş alıp, topraktan bir tencere içerisinde Hayse denilen yemeği yaptı. Benimle bunu gönderdi. Ben de bunu alıp, ona götürdüm. Allah Rasulü bana: Onu koy, dedi. Daha sonra bana emir buyurarak isimlerini verdiği birtakım kişiler için: Onları bana çağır, dedi. Ayrıca kiminle karşılaşırsan onu da çağır, diye buyurdu. (Enes devamla) dedi ki: Bana verdiği emri yaptım. Geri döndüğümde evin içindekilerle dolup taştığını gördüm. Nebi Sallallahu Aleyhi ve Sellem; ellerini o yemeğin üzerine koyup Allah'ın dilediği sözleri söyledi. Daha sonra o yemekten yemek üzere içeriye onar onar çağırdı. Onlara: Allah'ın adını anınız ve her adam önünden yesin, diyordu. Enes dedi ki: Nihayet hepsi yemeğin etrafından çekildiler. Aralarından Çlkanlar çıktı, birkaç kişi kalıp konuşmaya daldı. Enes dedi ki: (Kalanların gitmemeleri sebebiyle) ben de üzülmeye başladım. Daha sonra Nebi Sallallahu Aleyhi ve Sellem mu'minlerin annelerinin odalarına doğru gitmek üzere çıktı. Ben de hemen arkasından çıktım. Onlar gittiler deyince, geri döndü, eve girdi ve perdeyi indirdi. Ben oda içerisinde iken (ve henüz dışarı çıkmadan) o şu buyrukları okuyordu: \"Ey iman edenler! Nebiin evlerine, sizin için yemeğe izin verilmeden girmeyin. Yemek vaktini de beklemeye kalkışmayın Fakat davet olunduğunuzda girin. Yemek yediniz mi dağılın. Söze dalmak için beklemeyin. Çünkü bu, Nebii rahatsız etmekte; ama o sizden utanmaktadır. Allah ise haktan utanmaz ... \"(Ahzab, 53) İbrahim İbn Ebi Osman dedi ki: \"Enes kendisinin Rasulullah Sallallahu Aleyhi ve Sellem'e on yıl süre ile hizmet ettiğini söyledi.\" Fethu'l-Bari Açıklaması: \"Güveye ve geline hediye göndermek.\" Yani güveyin hanımı ile zifafa girdiği sabah hediye göndermek. \"Rasulullah Sallallahu Aleyhi ve Sellem Zeyneb bint Cahş ile zifafa yeni girmiş bir damat idi",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 98
			}
		}
	]
}