{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5171,
			"arabicnumber": 5171,
			"text": "Sabit'ten, dedi ki: \"Enes'in huzurunda Cahş kızı Zeyneb'in evIendirilmesi sözkonusu edilince, dedi ki: Ben Nebi Sallallahu Aleyhi ve Sellem'in onun için verdiği düğün ziyafeti gibi hanımIarından herhangi birisi için verdiğini görmedim. Onun için bir koyun ile ziyafet vermiştL\" Fethu'l-Bari Açıklaması: \"HanımIarından birisi için verdiği düğün ziyafetinden daha fazIasını bir diğeri için veren kimse.\" Bu başlık altında Enes'in Cahş kızı Zeyneb ile evIenmesi doIayısıyIa bir koyun ile düğün ziyafeti vermiş oIduğuna dair hadisini zikretmektedir. Bu hadiste anIatıIanIar doIayısıyla başlıkla arasındaki uygunIuk gayet açıktır. İbn Battal şu hususa işaret etmiştir: Böyle bir fazlalık, hanımlardan birisini diğerine üstün tutmak maksadı ile yapıImamıştır. Aksine o sırada mevcut imkanlara göre böyle olmuştur. Eğer onIarın her birisi ile evIendiği sırada bir koyun bulmuş oIsaydl, hiç şüphesiz onu da ziyafet oIarak verirdi. Çünkü o, insanIarın en cömerdi idi ama dünya işIerinde hoşa gidecek şeyIerIe alakalı hususlarda mübaIağa etmezdi. Başkası, onun bu davranışı, caiz oIuşunu beyan etmek için yapmış olabileceğini de söylemiştir. el-Kermanı dedi ki: Zeyneb için verdiği velimenin diğer hanımIarınınkine göre daha üstün oluşundaki sebebin, şanı yüce AlIah'ın Zeyneb'i onunIa vahiy yoIuyIa evIendirmesi nimetine şükretmek için oIma ihtimali de vardır. Derim ki: Enes'in Zeyneb için verdiği düğün yemeğinden daha fazIasınl başkası için vermemiş olduğunu söylemesi, bu hususta onun sahip olduğu bilgiye göredir ya da onun düğününde meydana gelmiş olan berekete dayanarak böyle söylemiş olabilir. Çünkü bir tek koyun ile ziyafete gelen bütün Müslümanlar doyuncaya kadar ekmek ve et yediler; ama göründüğü kadarıyla Rasulullah Sallallahu Aleyhi ve Sellem Kaza umresinde el-Haris kızı Meymune ile evlenip Mekke halkından da düğün ziyafetine gelmelerini istediği halde, bu teklifi kabul etmediklerinde koyundan daha fazlası ile düğün ziyafeti vermiş olmalıdır. Çünkü o sırada maddi imkanları bakımından bir genişlik sözkonusu olmuştu. Zira bu, Hayber'in fethinden sonra gerçekleşmişti. Yüce Allah da Mekke'nin fethinden itibaren Müslümanlara maddi imkanlar bakımından bir genişlik vermişti",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 106
			}
		}
	]
}