{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5189,
			"arabicnumber": 5189,
			"text": "Bize Süleyman ibnu Abdirrahmân ile Alî ibnu Hucr tahdîs edip şöyle dediler: Bize İsâ ibnu Yûnus haber verdi. Bize Hişâm ibnu Urve (kardeşi) Abdullah ibnu Urve'den; o da babası Urve ibn Zubeyr'den tahdîs etti ki, Âişe(r.anha) şöyle demiştir: zaman onbir kadın bir yerde oturmuşlar ve kocalarının haberlerinden birşey saklamayıp birbirlerine bildireceklerine dâir aralarında taahhüd edip bağlanmışlardı. Bunlardan Birinci Kadın: Benim kocam taşlık bir dağ başındaki arık bir devenin etidir. Kolay değil ki yanına çıkılsın, semiz değil ki insanlar tarafından (evlerine) naklolunsun! demiştir Kadın da: Kocamın hâlini meydana koyup yayamam. Zîrâ ben onları birşey bırakmadan sayamayacağımdan korkarım. Çünkü onun fenalıklarını sayacak olursam, gizli açık her hâlini sayıp dökmek zorunda kalacağım. Bu ise imkânsızdır, demiştir. Kadın da: Benim zevcim upuzun bir beyinsizdir. Ayıplarını söylersem beni boşar; susarsam(aklı başında bir kimse olmadığından sebebsiz) beni kendisinden uzak bırakır, demiştir. Kadın ise: medhederek:) Kocam Tıhâme sahasının gece hayâtı gibidir. Ne sıcaktır, ne soğuk (Orta seciyyede halûk bir kimsedir). Evimizde ne korku vardır, ne kırgınlık! demiştir. Kadın da şöyle medhetmiştir: Benim kocam da evine geldiğinde sanki (avdan gelen) bir parstır. (Avını bana getirir, koynumda mışıl mışıl uyur.) Evden çıkınca dışarıda o bir arslandır. Evdeki masrafımı hiç sormaz Kadın da şöyle kötüler: Kocam oburdur. Yemek yerken siler süpürür, içerken de su kabını kurutur. Yatarken de yorganına bürünür, (evin bir köşesinde tek başına) uyur. Ve benim hüznümü anlamak ve gidermek için elbiseme elini sokmaz! Kadın da: Kocam erlik vazifesini yapmaktan âciz ve işini bilmez, ahmak bir kişidir. Her derd onun derdidir. (Vücûdu hastalık karargâhıdır ve huysuzdur), başımı yarar, vücûdumu yaralar. Herşey onun vurmak ve yarmak âletidir, demiştir. Kadın da kocasını şöyle över: Onun vücûduna dokunurken tavşana dokunur gibi yumuşaktır. O güzel kokulu bir bitki gibi hoş kokar. Kadın da şöyle över: Kocamın evi yüksek direklidir. Kılıcının hamaili uzundur. Ocağının külü çoktur. Evi de insanların toplantı yerine yakındır (yânı evi şahanedir, kendisi uzun boyludur, evi de konuk kabul edecek yerdedir). Kadın da kocasını şöyle övmüştür: Zevcim mâliktir; hem ne kadar mâlik ve sâhibdir? Artık hatır ve hayâlimizden geçen her hayra mâlik ve sâhibdir! Zevcimin bir sürü develeri vardır ki, onların çökecek geniş eylek yerleri vardır. Fakat yaylım yerleri azdır.(Bununla: Develer yayılmaya gönderilmeyip misafire kesilmek için evin yanında eylek yerinde bulundurulur, demek istiyor.) Develer ud sesi duyunca -ki misafiri eğlendirmek üzere saz ve ahenk âletlerinin çalınmasıdır- o zaman develer boğazlanacaklarını anlarlar. Kadın(ki Ümmü Zer'dir ve kocasının güzel muaşereti cihetinden en bahtiyar olanıdır) aile hayâtını şöyle anlatmıştır Kocam Ebû Zer'dir. Bilesiniz Ebû Zer' ne semâhatli ve ne ahlâklı bir kişidir! O, iki kulağımı mücevherlerle hareket ettirir. Pazularım yağdan dolup tombullaştı(vücûdum semirdi) ve beni ferîh, fahur kıldı ve yüceltti. Ben de hemen yüceldim ve ferîh-fahûr oldum. O beni, Şıkk denilen bir dağ kenarında küçük koyun sürücüğü olan bir kabîle içinde buldu. Sonra beni atları kişner, develeri böğürür, ekinleri sürülüp dâneleri samanından ayrılıp müreffeh ve mes'ûd bir cemiyet içine getirdi. Şimdi ben onun yanında ne söylersem reddolunmam, sabaha kadar uyurum, beni kimse uyandırmaz). Bol süt içerim, artık içecek hâlim kalmaz. Bundan sonra Âişe, Ebû Zer' ailesinin ferdlerini birer birer Ümmü Zer'e şöyle anlattırıp rivayet ediyor:- Ümmü Zer' der ki: Ebû Zer'in anası var. Âh bilesiniz, Ümmü Ebî Zer' ne kadındır! Onun zahîre anbarları, eşyasını koyduğu hararları gayet büyüktür. Evi de geniştir. Zer'in oğlu, bilesiniz o ne zarâfetli gençtir! Onun yattığı yer kılıncı çekilmiş kın gibidir, düzgün, boylu poslu olup karnı çıkık değildir. O dört aylık bir kuzunun kol tarafıyle doyar (çok yemez). Zer'in kızı! O ne terbiyeli kızdır! Babasına itaatlidir, anasına da itaatlidir. O dilber kızın vücûdu elbisesini doldurur, güzelliği, edeb ve iffeti ortağının veya akran ve emsalinin kıskançlığını ve hayretini çeker. Zer'in cariyesi! Bilseniz o ne sadakatli câriyedir! Aile sırlarımızı kimseye söylemez. Evimizin azığını asla bozmaz ve israf etmez. Evimizde çer-çöp bırakmaz, temiz tutar. Namusludur, evimize kir getirmez. Zer' anlatmaya devam edip der ki: Bir gün Ebû Zer' evden çıktı. Her tarafta süt tulumları yağ çıkarılmak için çalkanmakta idi(Bolluk bir bahar mevsimi idi). Yolda bir kadına rastgeldi. Kadının yanında pars gibi çevik iki çocuğu vardı. Koltuğunun altından kadının iki nâra benzeyen memeleriyle oynuyorlardı.(Kocam bu kadım sevmiş), beni bıraktı, onu nikâh edip aldı. Ondan sonra ben şeref sahibi bir adamla evlendim. O da fütursuz yürür ve en güze1, ata binerdi. Hatt beldesi (Bahreyn eyâleti sahil kısmı) ma'mûllerinden olan mızrağını alır, akşam üzeri deve ve sığır nev'inden birçok hayvan sürüp bana gelirdi. Getirdiği her çeşit hayvanlardan, kölelerden, cariyelerden bana birer çift verirdi. Bu kocam da bana: Ey Ümmü Zer'! İstediğin gibi ye, iç ve akrabana da ihsan et! derdi. Zer' dedi ki: Bununla beraber ben bu ikinci kocamın bana verdiği şeylerin hepsini bir araya toplasam, Ebû Zer'in en küçük kabını doldurmaz. râvîyesi olan Âişe dedi ki: Rasûlüllah(sallallahü aleyhi ve sellem) -hatırımı hoş ederek-: \"Yâ Âişe! Ben sana Ebû Zer'in Ümmü Zer'e nisbeti gibiyim... (Şu farkla ki, Ebû Zer' Ümmü Zer'i boşamıştır, fakat ben seninle beraber yaşayacağım)\" buyurdu Abdillah el-Buhârî şöyle dedi: Saîd ibnu Seleme, Hişâm'dan yaptığı rivayetinde “Lâ tuaşşışu beytenâ ta'şîşen” şeklinde söylemiştir. Ebû Abdillah el-Buhârî: Râvîlerin bâzıları mîm ile \"Feetekammahu\" şeklinde söylemiştir ki, bu daha sahihtir",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 123
			}
		}
	]
}