{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5197,
			"arabicnumber": 5197,
			"text": "Bize Mâlik, Zeyd ibn Eslem'den; o da Atâ ibn Yesâr'dan haber verdi ki, Abdullah İbn Abbâs radıyallahü anhüma şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) zamanında güneş tutuldu. Bunun üzerine Rasûlüllah, insanlar da kendisiyle beraber olduğu hâlde namaza durdu. Takrîben el-Bakara Sûresi'ni okuyacak kadar uzunlukta bir kıyam yaptı. Sonra rukû'a varıp yine uzun bir rükû' yaptı. Sonra(rukû'dan) kalktı ve birinci kıyamın dûnunda olan uzunca bir kıyam daha yaptı. Sonra rukû'a varıp birinci rukû'un dûnunda olan uzunca bir rükû' daha yaptı. Sonra secde etti. Sonra ilk kıyamından az süren uzun bir kıyam yaptı. Sonra rukû'a varıp, ilk rukû'undan az süren bir rükû' yaptı. Sonra başını kaldırıp ilk kıyamın dûnunda olan uzunca bir kıyam yaptı. Sonra birincisinden az olan uzunca bir rükû' daha yaptı. Sonra başını kaldırdı. Sonra secde etti. Bundan sonra güneş açılmış vaziyette iken namazdan çıkıp şöyle buyurdu: \"Şübhesiz Güneş ile Ay, Allah'ın âyetlerinden iki âyettir. Bunlar hiçbir kimsenin ne ölümü, ne de hayâtı için tutulurlar. Bunların tutulduğunu gördüğünüzde hemen Allah'ı zikrediniz\". Yâ Rasûlallah! Namaz içinde, durduğun şu yerinden bir şeye elinle uzandığını gördük. Sonra Sen'in geri çekildiğini gördük! dediler. cevaben: \" (Evet.) Ben cenneti gördüm -yahut: Cennet bana gösterildi de ondan bir salkıma elimle uzandım. Eğer ben o salkımı ele geçirebilseydim, dünyâ bakî kaldıkça ondan yerdiniz. Ateşi de gördüm. Fakat ömrümde bu gün gördüğüm kadar çirkin, berbâd hiçbir manzara görmemiştim. Cehennemin ahâlîsinin çoğunu kadınlar olarak gördüm\" buyurdu. Yâ Rasûlallah! Ne sebeble (kadınlar buna müstahıkk oluyorlar)? diye sordular. \"Küfürleri sebebiyle\" buyurdu. Allah'ı inkâr mı ediyorlar? denildi. \"Kocalarına karşı ni'meti nankörlük ederler, iyiliğe nankörlük ederler. İçlerinden birine dünyâ oldukça iyilik etsen de sonra senden (memnun olmayacağı) birşey görse (hemen): Senden asla hiçbir hayır görmedim ki! der\" buyurdu",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 131
			}
		}
	]
}