{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5197,
			"arabicnumber": 5197,
			"text": "Abdullah İbn Abbas'tan şöyle dediği rivayet edilmiştir: \"RasuluIlah Sallallahu Aleyhi ve Sellem döneminde güneş tutuldu. Rasulullah Sallallahu Aleyhi ve Sellem, beraberinde insanlar da bulunduğu halde namaz kıl{dır)dı. Bakara slıresi okunacak kadar uzunca bir süre kıyamda durdu. Daha sonra uzunca bir rüklı' yaptı, sonra başını rüklı'dan kaldırdı ve uzun bir süre ayakta durdu; ama bu ilk ayakta duruşundan daha az idi. Sonra bir daha rüklı'a vardı, bu da ilk rüklı'dan daha kısa sürdü. Sonra başını rüklı'dan kaldırdı, secdeye vardı. Daha sonra uzunca bir kıyamda durdu, bu da ilk kıyamdan daha az sürdü. Sonra uzunca bir rüklı' yaptı, bu da ilk rüklı'dan daha az sürdü. Sonra başını kaldırıp uzunca kıyamda kalarak ayakta durdu, ama bu da birinci kıyamdan daha az sürdü. Sonra uzunca bir rüklı' yaptı ve bu da ilk rüklı'dan daha az sürdü. Sonra başını kaldırdı, sonra secde yaptı. Sonra da namazdan Çıktı. Güneş de açılmış bulunuyordu. Allah Rasulü şöyle buyurdu: Şüphesiz güneş ve ay Allah'ın ayetlerinden iki ayettir. Herhangi bir kimsenin ölümü ya da hayatı dolayısıyla tutulmazlar. Böyle bir şey gördüğünüz takdirde hemen Allah'ı zikrediniz. Ey Allah'ın Rasulü, dediler, biz bu esnada ayakta dururken bir şeyalmak üzere elini uzattığını gördük, sonra geriye doğru çekildiğini gördük. Şöyle buyurdu: \"Ben cenneti gördüm -ya da bana cennet gösterildi-, oradan elimi bir salkıma uzattım. Onu almış olsaydım, dünya kaldığı sürece ondan yiyip duracaktımz. Cehennemi de gördüm. Fakat bugün gördüğüm manzara gibisini asla görmüş değilim Cehennem ahalisinin çoğunun da kadınlar olduğunu gördüm. \"Neden ey Allah'ın Rasulü\", diye sordular. O: \"Küfürleri sebebiyle\", diye buyurdu. Ona: \"Allah 'a mı kafir oluyorlar\" diye sorulunca, şöyle buyurdu: \"Hayır, onlar kocalarına karşı kafirlik (nankörlük) ve iyiliğe karşı kafirlik (nankörlük) ediyorlar. Zaman durdukça onlardan birisine ihsan da bulunsan, sonra da senden (hoşlanmadığı) bir şey görecek olursa, senden en ufak bir hayır görmedim, der",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 131
			}
		}
	]
}