{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5204,
			"arabicnumber": 5204,
			"text": "Abdullah İbn Zem'a r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Sizden herhangi bir kimse köleyi dövereesine hanımını dövmesin. Sonra (belki de) günün sonunda onunla cima' etmek isteyebilir.\" Fethu'l-Bari Açıklaması: \"Kadınları dövmenin mekruh oluş sınırı.\" Bu başlıkta onları dövmenin mutlak olarak mubah olmadığına, aksine ileride açıklayacağımız üzere tenzihi' ya da tahrimi' kerahet ile mekruhluk sözkonusu olduğuna işaret vardır. \"Köleyi dövereesine ... \" Müslim'de İbn Numeyr yoluyla gelen iki rivayetten birisinde \"cariyeyi dövereesine\" denilmektedir. Hadisten anlaşıldığına göre köleleri ileri derecede döverek tedib etmek caizdir. Aynı zamanda kadınların bundan daha aşağı bir seviyede dövülmelerinin de caiz oluşunu ima etmektedir. Musannıf: \"İz bırakmayan şekilde\" ifadesiyl buna işaret etmiştir. Ancak hadisin ifadelerinden aklı başında bir kimsenin her iki işi bir arada yapmasının uzak bir ihtimalolduğu anlaşılmaktadır. Yani önce hanımını ileri derecede dövecek, sonra da günün geri kalan kısmında ya da geceleyin onunla cima' edecek. Cima' etmek ve birlikte yatakta bulunmak, ancak nefsin eğiliminin ve birlikte oluş arzusunun bulunması halinde güzel görülür. Oayak yiyen bir kimse ise çoğunlukla kendisini döğenden uzaklaşmak ister. Böylelikle bu işin yerilmiş olduğuna işaret edildiği gibi, eğer dövmek kaçınılmaz bir hal alacaksa o takdirde tedib, hafif dövme ile olmalıdır. Öyle ki bundan dolayı tam bir nefret sözkonusu olmasın. Vurmakta da aşırılığa gitmesin, tedibde de aşırılığa gitmesin. \"Sizin hayırlılarınız ise asla vurmaz\" ifadesine gelince onların genelolarak dövülmesinin mubah olduğuna delil teşkil etmektedir. Ancak bunun sözkonusu olması için kadının kendisine itaat etmesi icab eden hallerde, hoşuna gitmeyen bir husus u gördüğü takdirde onu tedib etmek amacıyla olmalıdır. Eğer sadece tedib ve benzeri şeylerle yetinebilirse, daha da güzelolur. Böyle bir şeyi hissettirmek eğer maksada ulaşmayı mümkün kılıyorsa, fiilen bu işi yapma cihetine gitmez. Çünkü dövme neticesinde, evlilikte istenen güzel beraberliğe ve geçime zıt olan bir nefret ve uzaklaşmak hali sözkonusu olur. Allah'a isyanı ilgilendiren bir hususta olması durumu müstesnadır. Nesai bu husus ile ilgili olarak Aişe'den şu hadisi rivayet etmiş bulunmaktadır: \"Rasulullah Sallallahu Aleyhi ve Sellem ne bir kadını, ne de bir hizmetçiyi kesinlikle dövmüş değildir. Allah yolunda olması yahut Allah'ın haramlarının çiğnenmesi hali dışında da eliyle hiçbir şeye vurmuş değildir. (Böyle bir şeyolduğu takdirde) Allah için intikam alırdL\" İleride yüce Allah'ın izniyle Edeb bölümünde buna dair daha geniş açıklamalar gelecektir",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 138
			}
		}
	]
}