{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5211,
			"arabicnumber": 5211,
			"text": "Aişe r.anha'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem bir sefere çıkmak istediği takdirde hanımları arasında kura çekerdi. (Bir keresinde) kura Aişe ile Hafsa'ya çıktı. Nebi Sallallahu Aleyhi ve Sellem gece oldu mu Aişe ile birlikte yol alır ve konuşurdu. Hafsa bunun üzerine: Bu gece sen benim deveme binsen, ben de senin devene binsem. Sen ne olacağına baksan, ben de ne olacağına baksam olmaz mı, dedi. Aişe: Olur deyince (onun) devesine bindi. Nebi Sallallahu Aleyhi ve Sellem, Hafsa'nın üzerine binmiş olduğu Aişe'nin devesinin yanına geldi. Ona selam verdi, daha sonra yola devam etti. Nihayet konakladılar.' Aişe, Nebi Sallallahu Aleyhi ve Sellem'i yanında bulmamıştı. Bu sebeple konakladıkları vakit ayaklarını izhir otları arasına uzattı ve bu arada: Rabbim, üzerime beni sokacak bir akrep yahut bir yılan gönder de ona hiçbir şey söyleyemeyeyim diye dua ediyordu.\" Fethu'l-Bari Açıklaması: \"Sefere çıkmak istediği takdirde\" Başlıktan anlaşıldığına göre kura çekmek, özelolarak yolculuk hali ile ilgilidir, genel değildir. Kuranın amacı, kendisi ile yolculuk yapılacak olan kadının tayin edilmesidir. Erkek, kurayı hanımları arasında bir paylaştırma yapmayı istediği vakit de uygular. Dolayısıyla o kadınlardan istediğinden başlayamaz. Aksine aralarında kura çeker ve kimin kurası çıkarsa onunla başlar. Herhangi bir suretle razı edilmeleri hali müstesnadır, o vakit, kurasız da caiz olur. \"Hanımları arasında kura çekerdi.\" İbn Sa'd bir başka yoldan, el-Kasım'dan; o da Aişe'den diye naklettiği rivayetinde şu fazlalık da vardır: \"Kura benden başkasına çıkacak olursa hoşlanmadığı anlaşılırdı.\" Bu hadis ortaklar arasında ortak olan malın paylaştırılması ve daha başka hususlarda kura çekilmesinin meşruiyetine delil gösterilmiştir. Daha önce Şehadat (şahadetler) bahsinin sonlarında geçtiği gibi. .. Hanefilerle, Malikilerin meşhur olan görüşü ise kuranın muteber olmadığıdır. Iyad dedi ki: Malik ve onun mezhebine mensup arkadaşlarından meşhur olarak nakledilen görüş budur. Çünkü bu bir çeşit piyango ve kumar türündendir. Hanefilerden ise bunun caiz olduğu nakledilmiştir. Malikilerden kurayı kabul etmeyenler, kimi kadınların yolculukta diğerlerine göre daha faydalı olabileceğini delil göstermişlerdir. Dolayısıyla yolculukta faydası olmayan kimsenin kurası çıkacak olursa bu da erkeğin haline zararlı olur. \"Kura Aişe ile Hafsa'ya Çıktı.\" Maksat çıkılan seferlerden birisidir. \"Ona selam verdi.\" Rivayette onunla konuştuğu sözkonusu edilmemektedir. Olan bitenin ona ilham yoluyla bildirilmiş olması muhtemelolduğu gibi, bunun böyle denk düşmüş olma ihtimali de vardır, onunlevkonuşmuş olmakla birlikte - bunun ayrıca nakledilmemiş olması ihtimali de vardır. \"Aişe, Nebii\" yolda gittikleri esnada \"kaybetmişti.\" Çünkü alışılmışın yitirilmesi insana zor gelir. \"Konakladıkları vakit Aişe ayaklarını izhirin arasına attı.\" Anlaşıldığı kadarıyla Hafsa'nın teklifini kabul ederek böyle bir cinayeti işleyenin kendisi olduğunu bildiğinden, bunu yaptığı için kendisine sitemde bulunmuştur. İzhir, çölde çoğunlukla zararlı haşeratın bulunduğu, bilinen bir ottur",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 144
			}
		}
	]
}