{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"67": "Wedlock, Marriage (Nikaah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5236,
			"arabicnumber": 5236,
			"text": "Aişe r.anha'dan dedi ki: \"Ben mescidde oynayan Habeşlilere bakar iken Nebi Sallallahu Aleyhi ve Sellem'in de beni ridası ile örtüp sakladığını ve nihayet ben bundan usanıncaya kadar bunu sürdürdüğünü görmüşümdür. Artık yaşı küçük, oyuna, eğlenceye düşkün bir kızın bu durumda ne yapabileceğini siz hesap edin.\" Fethu'l-Bari Açıklaması: \"Kadının, kötü bir düşünceye kapılmaksızın Habeşlere ve başkalarına bakmas!.\" Başlığın zahirinden anlaşıldığına göre musannıf, kadının yabancı bir erkeğe bakmasının caiz olduğu ama aksinin böyle olmadığı görüşünde idi. Bu meşhur bir mesele olup, Şafil mezhebinde bu hususta hangisinin tercih edileceği ile ilgili olarak ihtilaf edilmiştir. Ancak bu başlıktaki hadis, bunun caiz olduğunu kabul edenleri desteklemektedir. Daha önce Bayram bahislerinde Nevevıinin buna dair şu cevabı verdiği geçmiş bulunmaktadır: Aişe büluğa ermemiş küçük yaşta idi. Yahut bu hicab emrinden önce idi. O bu görüşünü bu rivayette geçen: \"Yaşı küçk kızın durumunu siz ölçüp biçiniz\" ifadeleri ile pekiştirmektedir. Fakat onun bu delillendirmesinin pek yerinde olmadığını ortaya koyan açıklamalar daha önceden geçtiği gibi, bunun rivayet yollarından birisinden de bu hadisenin Habeşlilerin heyetinin gelişinden sonra olduğu, gelişlerinin de hicretin yedinci yılına rastladığı da ifade edilmektedir. O sırada da Aişe on altı yaşında idi ve büluğa ermiş bulunuyordu. Ayrıca bu, hicab emrinden sonra olmuştu. Bunu kabul etmeyenlerin delili ise Ümmü Seleme yoluyla gelen ve: \"Peki ya siz kör müsünüz?\" ifadelerinin yer aldığı meşhur hadistir. Bu hadisi Sünen sahipleri ez-Zührı'nin Ümmü Seleme'nin mevlası olan Nebhan'dan, Nebhan'ın da Ümmü Seleme'den diye rivayeti ile gelmiştir ki, senedi kavidir. Her iki hadis bir arada şöylece açıklanabilir: Bu olayın daha önce meydana gelmiş olma ihtimali vardır; yahut Nebhan'ın sözünü ettiği hadiste anlatılan olayda kadınları erkeği görmekten men eden bir husus bulunabilir. Çünkü İbn Üm mü Mektum ama birisi idi. Muhtemelen o, kadınların örtünmesi gereken yerlerini belki fark edebiliyor ve karşıdaki bunu hissetmeyebiliyordu. Bunun (kadınların erkeklere bakmasının) caiz oluşunu güçlendiren delillerden birisi de kadınların mescidlere, pazarlara ve yolculuklara erkeklerin kendilerini görmemesi için nikablı (peçeli) olarak çıkmalarının caiz oluşuna dair uygulamanın devam etmesidir. Ayrıca erkeklere, kadınlar kendilerini görmesin diye yüzlerini örtmesi emri kesinlikle verilmemiştir. İşte bu, her iki kesim arasında hükmü n farklı olduğunun delilidir. Gazzal1 de cevaza bunu delil göstererek şunları söylemiştir: Bizler kadının erkeğin yüzüne bakmasının, erkeğin kadının yüzüne bakması gibi aYret olduğunu söylemiyoruz. Aksine erkeğin yüzüne bakmak, erkeğin tüysüzün yüzüne bakması gibidir, diyoruz. Sadece fitneden korkulması halinde ona bakmak haram olur. Eğer fitne yoksa haram değildir. Çünkü çağlar boyunca erkekler hep yüzleri açık dışarı çıkmışlardır, kadınlar da nikablı olarak dışarı çıkmışlardır. Eğer durumları eşit olsaydı, erkeklere de nikab kullanmaları emredilir, yahut kadınlara dışarı çıkmaları yasaklanırdl. (Gazali'den ikitibas (alıntı) burada bitti) Hadis ile ilgili açıklanması gereken diğer hususlar daha önce \"İki Bayram\" ile ilgili başlıklarda geçmiş bulunmaktadır. (988.hadiste)",
			"grades": [],
			"reference": {
				"book": 67,
				"hadith": 169
			}
		}
	]
}