{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5251,
			"arabicnumber": 5251,
			"text": "Abdullah İbn Ömer radiyallahu anh'dan rivayete göre o, hanımını Rasulullah Sallallahu Aleyhi ve Sellem döneminde ay hali iken boşadı. Ömer İbn el-Hattab r.a. Rasulullah Sallallahu Aleyhi ve Sellem'e buna dair soru sorunca Rasulullah Sallallahu Aleyhi ve Sellem: \"Ona emret, ona dönsün. Sonra ay halinden temizleninceye kadar, sonra ay hali oluncaya, sonra bir daha temizleninceye kadar tutsun. Daha sonra da dilerse onu (nikahı altında) tutsun, dilerse de dokunmadan boşasın. İşte yüce Allah'ın kadınların kendisine doğru geldiklerinde (içinde) boşanmalarını emir buyurduğu iddet budur\" dedi. Fethu'l-Bari Açıklaması: Talak (boşama) sözlükte bağı çözmek demektir. Salmak ve terk etmek demek olan ıtlak'tan türemiştir. Şeriatte ise, (terim olarak) evlilik düğümünü çözmekten ibarettir. Talak haram, mekruh, vacib, mendub yahut caiz olabilir. Birinci hal (haram) bid'i (bidat) talak olması durumunda söz konusudur. Bunun da çeşitli şekilleri vardır. İkinci hal (mekruh) ise: Evlilik düzgün bir halde gitmekle birlikte sebepsiz meydana gelmesi halinde söz konusudur. Üçüncü hal (vacib) olması da çeşitli şekillerde söz konusudur. Bunlardan birisi, aralarındaki geçimsizlik dolayısıyla hakemlik yapan iki kişinin, aralarında anlaşmazlığı tespit etmeleri üzerine bunu uygun görmeleridir. Dördüncü hal (mendub) ise kadının iffetli olmaması halidir. Beşincisine (caiz oluşa) gelince, Nevevıbunu kabul etmemektedir. Başkaları ise erkeğin nikahı altındaki hanım ı istememesi, onun eş olarak külfetlerini gönül hoşluğu ile yüklenmemesi ve ondan faydalanma maksadının da hasıl olmaması hali hakkında düşünmüşlerdir. İmam (Şafil) böyle bir durumda talakın mekruh olmayacağını, sarih bir şekilde ifade etmiş bulunmaktadır. Yüce Allah'ın: \"Ey Nebi! Kadınları boşadığınız zaman iddetleri vaktinde boşayın ve o iddeti ihsa edin. \"(Taluk, 1) buyruğuna gelince, buradaki: \"Kadınları boşadığınız zaman\" buyruğu Nebi Sallallahu Aleyhi ve Sellem'e yönelik bir hitap olup, tazim kastıyla yahut ümmetinin de onunla birlikte muhatap alınması kastıyla çoğulolarak zikredilmiştir. Bu durumda ifadenin takdiri: Ey Nebi ve onun ümmeti, şeklindedir. Buyruğun: Ümmetine de söyle, ifadesinin takdiri üzere olduğu söylenmiş ise de ikincisi daha uygundur. \"İddetleri vaktinde\", yani iddete başlamaları halinde demektir. İbn Abbas: İddetlerine doğru diye açıklamıştır. Bunu da Taberi sahih bir senedIe rivayet etmiştir. \"Sünnete uygun talak, cima' olmaksızın temiz iken hanımını boşamasıdır.\" Taberi sahih bir sened ile İbn Mesud'dan yüce Allah'ın: \"İddetleri vaktinde boşayın\" buyruğu ile ilgili olarak şunu söylediğini rivayet etmektedir: Cima' olmamış, temizlik halinde demektir. Ayrıca bunu ashab-ı kiram'dan bir topluluktan, aynı şekilde onlardan sonra gelenlerden de bir topluluktan diye rivayet etmiş bulunmaktadır. \"Ve iki şahit tutması.\" Bu da yüce Allah'ın: \"Aranızdan adalet sahibi iki kişiyi de şahit tutun. \"(Talak, 2) buyruğundan alınmıştır ki bu da açıkça anlaşılan bir husustur. O bu sözleriyle de sanki İbn MerdCıye'nin, İbn Abbas'tan diye naklettiği şu rivayete de işaret etmiş gibidir: \"Muhacirlerden bazıları iddete dikkat etmeksizin hanımlarını boşuyorlar ve şahit tutmaksızın da ric'at yapıyorlar (hanımlarına geri dönüyorlarldı. Bunun üzerine bu ayet nazil oldu.\" Fukaha, talakı Sünnı (sünnete uygun), bid'i (bid'at) ve herhangi bir vasfı olmayan üçüncü bir tür olmak üzere üç kısma ayırmışlardır. Birincisi ile ilgili açıklama geçmiş bulunmaktadır. İkincisi, hanımını ay hali iken yahut cima'da bulunduğu ve hamile olup olmadığı belli olmayan bir halde iken boşamasıdır. Üçüncü tür talak ise, ay hali olmayacak kadar küçük yaşta olan yahut ay halinden kesilmiş ya da doğum yapması yaklaşmış hamile olan eşini boşamasıdır. Ay hali olan kadını boşamanın haram oluşundan şu haller istisna edilir: 1- Eğer kadın hamile olup kan görse -ve biz de hamile olan kadının ay hali olabildiği görüşünü benimsiyor ise ki onu boşamak bid'at talak olmaz. Özellikle de bu gördüğü kan, doğumuna yakın olursa. 2- Hakim, kölenin hanımının boş olduğuna hüküm verse ve verdiği bu hüküm esnasında da kadın ay hali ise. 3- Aynı şekilde hakemler aradaki anlaşmazlığı çözmek için tek yol olarak boşamayı uygun görmüşlerse. 4- Hul'de böyledir. Doğrusunu en iyi bilen Allah'tır. (Ay hali iken boşanmış olan kadına) ric'at yapmanın (talaktan geri dönmenin) vücubu hususunda görüş ayrılığı vardır. Malik ve bir rivayete göre Ahmed bu görüştedir. Ancak ondan meşhur olan görüş -ki bu aynı zamanda cumhurun da görüşüdür- ric'at yapmak müstehabdır. Buna da nikahı akdetmenin vacip 01mayışını delil göstermişlerdir. O halde devamının hükmü de budur derler. Fakat Hanemerden \"el-Hidaye\" müellifi bu durumda ric'atin vacip olduğu görüşünün sahih olduğunu belirtmiştir. Bunun vacip olduğunu söyleyenlerin lehine delil, bunu öngören emrin varid oluşudur. Çünkü talak ay halinde haram olduğuna göre, bu halde nikahın devam ettirilmesi de vacibdir. Eğer ay halinde iken eşini boşamış olan bir kimse hanımı temizleninceye kadar bunu sürdürse, Malik ve mezhebine mensup ilim adamlarının çoğunluğu ona ric'at yapmaya zorlanır, demişlerdir. Ancak iddetin bitmesi halinde ric'atin söz konusu olmayacağı hususu üzerine ittifak ettikleri gibi, zevcesi ile gerdeğe girmeden önce ay hali iken talak vermiş olduğu takdirde -Züfer'den gelen nakil dışında- ric'at yapmakla emrolunmayacağını fukaha ittifakla kabul etmişlerdir. \"Sonra onu tutsun\", yani nikahı altında tutmaya devam etsin. \"Temizleninceye, sonra ay hali oluncaya, sonra tekrar temizleninceye kadar.\" Bundaki hikmetin ne olduğu hususunda ihtilaf vardır. Şafii der ki: Bununla -yani Nafi'in, İbn Ömer'den diye naklettiği belirtilenler ile- önce tam bir temizlik, sonra tam bir ay hali ile rahminin hamilelikten uzak olduğunun ortaya çıkarılıp anlaşılmasını istemiş olması muhtemeldir. Böylelikle hanımını boşadıktan sonra iddetinin, gebe ise doğum yapmakla mı, yoksa değilse ay hali görmekle mi olacağını bilmiş olacaktır. Yahut hanımının hamile olduğunu bildikten sonra ve ne yaptığının da şuurunda olarak boşamasını sağlamak istemiştir. Çünkü hamile olduğu için onu nikahı altında tutmak isteyebilir ya da eğer hanımı hamile değilken (hamile olduğunu bilmiyorken) boşanmayı istemişse (hamile olduğunu anladıktan sonra) bundan vazgeçebilir. Bir diğer görüşe göre bu husustaki hikmet, ric'atin (ric'ı talakta boşamaktan vazgeçmenin) boşamak maksadı ile yapılmamasını sağlamaktır. Eğer o eşini boşaması kendisi için helal olan bir süre tutacak olur.sa ric'atin faydası da ortaya çıkar. Çünkü bu süre zarfında onunla birlikte uzun süre kalabilir. Bu halde iken onunla cima' yapabilir ve böylelikle içinde onu boşamasına sebep teşkil eden husus kaybolup gider ve onu nikahı altında tutmaya devam edebilir. Bir başka açıklama şöyledir: Hanımını içinde boşadığı ay halinden sonraki temizlik, bir kur' (temizlik hali) gibidir. Eğer bu halde iken onu boşayacak olursa ay hali olan hanımını boşamış kimse durumunda olur. Halbuki ay hali iken boşamak yasaklanmıştır. O halde ikinci temizliğe kadar boşamayı ertelemesi gerekir. Boşamanın ve ric'atin yapıldığı ay halinin akabindeki temizlikte hanımını boşamanın cevazı hususunda görüş ayrılığı vardır. Şafii alimlerinin bu hususta iki görüşü bulunmaktadır. Bunların daha sahih olanı bu talakın yapılamayacağıdır. Malikılerin bu husustaki açıklamaları ise boşamayı ertelemesinin müstehap olmasını gerektirmektedir. İbn Teymiye elMuharrar adlı eserinde şunları söylemiştir: Böyle bir ay hali akabindeki temizlikte hanımına talak vermez. Çünkü bu bir bid'attir. Ondan -yani Ahmed'den- bunun caiz olduğu da nakledilmiştir. Hanefı mezhebindeki fıkıh kitaplarında Ebu Hanife'den bunun caiz olduğunu belirttiği nakledilmektedir. Ebu Yusuf ve Muhammed'den ise bunu kabul etmedikleri bildirilmiştir. Bunun caiz oluşu şöyle açıklanır: Talakın haram oluşu, eşinin ay hali olmasından ötürüdür. Eğer temizlenecek olursa haram olmayı gerektiren sebep de ortadan kalkmış olur. Böylelikle bu temizlik halinde onu boşamak, bundan sonraki temizlik halinde caiz olduğu gibi aynı şekilde daha önceki ay halinde talak vermemiş olduğu temizlik halinde onu boşaması caiz olduğu gibi caizdir. Bunu kabul etmeyenlerin delillerini ise zikretmiş bulunmaktayız. Bu delillerden birisi de şudur: Eğer bu ay hali akabinde (temizlik halinde) hanımını boşayacak olursa daha önce ona onu boşamak üzere ric'at yapmış gibi olur. Bu ise ric'atin amacının aksinedir. Çünkü ric'at tekrar kadını nikahın kapsamına geri döndürmek için meşru kılınmıştır. Bundan dolayı da (Allah Rasulü) buna imsak (nikahı altında tutmak) adını vermiş ve bu temizlik halinde onu tutmasını, bu temizlik halinde onu boşamayıp bir daha ay hali olup daha sonra da tekrar temizleninceye kadar beklemesini emir buyurmuştur. Böylelikle ric'atin nikah altında tutmak için ve boşamak amacıyla yapılmamış olmasının sağlanması istenmiştir. \"Daha sonra dilerse (nikahı altında) tutar, dilerse ona dokunmadan talak verir.\" Eyyub yoluyla gelen rivayette şöyle denilmektedir: \"Sonra da ona dokunmadan, onu boşar.\" Muhammed İbn Abdurrahman'ın Salim'den rivayetinde ise \"Sonra ya temiz iken ya da hamile olduğu halde onu boşasın\" denilmektedir. Kadının hamileliğinin ortaya çıkmış olduğu temizlik halinde hanımı ile cima' etmiş kimsenin hanımını boşamasının haramlığından bu hali istisna edenler, buradaki fazlalığı delil göstermişlerdir. Buna göre böyle bir talak haram olmaz. Bundaki hikmet ise şudur: Hamilelik belli olduktan sonra koca artık basiret üzere bu işe kalkışmış demektir. Bundan dolayı da vereceği talaktan ötürü pişman olmaz. Bu fazlalıktaki \"temiz iken\" sözünden maksatdın, ay hali kanının kesilmesi mi yoksa gusül ile temizlenmesi mi olduğu hususunda iki görüş vardır. Her ikisi de Ahmed'den gelmiş iki ayrı rivayettir. Tercihe değer olan ise ikincisidir. Çünkü Nesaı, Mu'temir İbn Süleyman yoluyla, Ubeydullah İbn Ömer'den, o Nafi'den diye bu olayda şunları söylemektedir: \"Abdullah'a emret de ona (hanımına) dönsün. Sonraki ay halinden temizlenip guslettiği takdirde ona dokunmaksızın onu boşasın. Eğer onu nikahı altında tutmak istiyorsa tutsun.\" İşte bu, Nebi efendimizin: \"Temizlendi mi\" buyruğunu tefsir etmekte, açıklamaktadır. O halde ona göre anlaşılmalıdır. Buradan şu fer'ı hüküm de çıkmaktadır: Acaba iddet, kanın kesilmesi ile mi sona erer ve ric'at imkanı ortadan kalkar yoksa gusletmek mutlaka gerekli midir? Bu hususta da görüş ayrılığı vardır. Hülasa ay hali ile ilgili hükümler iki türlüdür: Birincisi kanın kesilmesi ile zeval bulur. (Bundan sonra) guslün ve oruç tutmanın sahih oluşu, namazın zimmette borç oluşu gibi, ikincisi ise ancak gusül ile zail olur. Namazın ve tavafın sıhhati, mescidde kalmanın caiz oluşu gibi. Bu durumda talak (boşama) birinci türden midir, ikinci türden midir? Nebi efendimizin: \"Sonra onu temiz ya da hamile iken boşasınıf buyruğunu hamile olan kadını boşamak Sünnı (sünnete uygun) bir boşamadır, diyenler delil almışlardır. CumhOrun görüşü de budur. Ahmed'den gelen bir rivayete göreise böyle bir talak ne sünnıdir, ne de bid'ıdir (sünnete uymayan, bid'at talaktır). \"İşte yüce Allah'ın, kadınları içinde oldukları halde boşamalarını emir buyurduğu\" yani izin verdiği \"iddet budur.\" Yüce Allah'ın: \"O kadınları iddetleri içinde boşayınız\" buyruğu ise \"iddetlerinin başlangıç vaktinde boşayınız\", demektir",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 1
			}
		}
	]
}