{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5258,
			"arabicnumber": 5258,
			"text": "Ebu Ğallab, Yunus İbn Cübeyr'den dedi ki: \"İbn Ömer'e: Bir adam hanımını ay hali iken boşarsa (ne olur), diye sordum. o: Sen İbn Ömer'i tanıyor musun? İbn Ömer hanımını ay hali iken boşadı. Bunun üzerine Ömer, Nebi Sallallahu Aleyhi ve Sellem'e giderek ona bu durumu anlattı, Allah Rasulü ona İbn Ömer'in hanımına dönmesini emretti. Ay halinden temizlendikten sonra onu boşamak isterse boşamasını söyledi, dedi. Ben: Peki, bunu bir talak olarak saydı mı, diye sordum. O: Ya İbn Ömer acze düşmüş ve ahmaklık etmişse (ne olacak), dedi.\" Fethu'l-Bari Açıklaması: \"el-Cevn'in kızı\" Sahih olan, Nebi efendimizden Allah'a sığınan kadının el-Cevniyye olduğudur. İbn SaId, Said İbn Abdurrahman İbn Ebza yoluyla şöyle dediğini rivayet etmektedir: \"Ondan başka bir kadın Nebiden Allah'a sığınmış değildir.\" Derim ki: Ağırlıklı olarak bizim zannımlZ da böyledir. Çünkü bu şekilde Allah'a Nebiden sığınan kadın, sözü geçen bir tertip dolayısı ile olmuştur. Ondan sonra bu husustaki haberin yayılmasının ardından sonra onun bu aldandığı gibi bir başkasının aldanması uzak bir ihtimaldir. İbn Abdilberr dedi ki: Nebi s.a.v.'in el-Cevniyye ile evlendiği hususunda İcma' etmişlerdir, ama ondan ayrılış sebebi hususunda farklı görüşler vardır. Katade dedi ki: Nebi Sallallahu Aleyhi ve Sellem onun yanına girince, o kadını çağırdı. Kadın: Hayır, sen gel, deyince onu boşadı. Kadında eı-Amiriyye'de olduğu gibi sedef hastalığı bulunduğu da söylenmiştir. (İbn Abdilberr devamla) dedi ki: Bazıları bu kadının: Senden Allah'a sığınırım dediğini, bunun üzerine: Sen sığınılacak pek büyük bir yere sığındın. Allah da seni benden koruyup himayesine almış bulunuyor, deyip onu boşadığını söylemişlerdir. Ancak bu, batııdır. Bu sözleri ona el-Anberoğullarından bir kadın söylemiştir. Bu, güzel bir kadındı. Nebi efendimizin diğer hanımları kendilerini geride bırakacağından korktukları için ona: Nebie, senden Allah'a sığınınm denilmesi hoşuna gider, demeleri üzerine kadın da dediklerini yaptı, bunun üzerine o da o kadını boşadı. Evet, o böyle demiş bulunuyor. Fakat bu hususta varid olmuş rivayetlerin çokluğuna ve bunun Sahih-i Buharı'de Aişe'nin rivayet etmiş olduğu bir hadis olarak Sabit olmasına rağmen bunun batılolduğuna ne diye hüküm verdiğini bilmiyorum. İleride bundan sonraki hadiste buna dair daha fazla açıklamalar gelecektir. \"eş-Şavt denilen bir bahçeye ... \" Bu, Medine'de bilinen bir bahçe idL \"Bir hurmalıktaki bir eve yani en-Numan İbn Şerahil'in kızı Umeyme'nin evine yerleştirildL\" Bazı şarihler izafet bulunduğunu zannederek bundan sonraki rivayette açıklamalarda bulunurken şöyle demişlerdir: Rasulullah Sallallahu Aleyhi ve Sellem Şerahıl kızı Umeyme ile evlendL Evinde konakladığı kadın da muhtemelen onun kardeşinin kızıdır. Ancak bu açıklama reddolunmuştur. Çünkü her iki rivayetin ravisi de aynıdır. Yanılma \"bir evde\" lafzının tekrarlanmasından ileri gelmektedir. Ebu Bekr İbn Ebi Şeybe bunu Müsned'inde Buharı'nin bu rivayetteki şeyh i (hocası) Ebu Nuaym'den rivayet ederek: \"Umeyme hurma bahçesindeki bir evde ... \" demiştir. İbnu'l-Müneyyir der ki: Kadının böyle bir tepki göstermesi, onda cahiliye döneminin hala etkilerinin devam etmiş olmasından dolayıdır. Araplara göre \"esSuka: (Yönetici olmayanlar, hükümdar olmayanlar)\" kim olursa olsun hükümdar olmayan kimselere denilir. 0, sanki hükümdar olan bir kadının, hükümdar olan birisiyle evlenmesinden Allah'a sığınmış gibidir. Nebi Sallallahu Aleyhi ve Sellem de hükümdar bir nebi olmak ile kul bir nebi olmak arasında muhayyer bırakılmış, o da Rabbine tevazu göstererek kul bir nebi olmayı tercih etmiştL Nebi Sallallahu Aleyhi ve Sellem cahiliye döneminden henüz yeni kurtulduğu için bu kadını mazur görerek, söylediği sözler dolayısıyla onu sorgulamamıştır. \"Sonra yanımıza gelerek: Ey Ebu Useyd, ona iki razıkı elbise ver dedL\" Razıkı denilen elbiseler uzun, beyaz, ketenden yapılmış elbiselerdir. Bu açıklamayı Ebu Ubeyde yapmıştır. İbnu't-TIn der ki: O kadına bunları ya vacip olarak yahut kendisi ihsanda bulunarak mut'a olmak üzere vermiştir. İleride Nafakalar bölümünde mut'a vermenin hükmü gelecektir. \"Onu ailesine götür.\" İbn Battal dedi ki: Bu sözlerde yüzüne karşı onu boşadığını söylediği belirtilmemektedir. Ancak İbnu'l-Müneyyir ona itiraz ederek şöyle demiştir: Bu husus bu başlıktaki hadislerin ilkinde sabittir. O halde onun o kadına: Ailenin yanına git, demesine göre yorumlanmalıdır. Daha sonra Ebu Useyd'in yanına çıkınca da, onu ailesinin yanına götür demiştir. Böylelikle her iki hadis arasında bir aykırılık kalmamış olur. Birincisinde o kadını boşamayı, ikincisinde de lafzın hakikat anlamı olan ailesine onu geri iade etmeyi kastetmiştir. Çünkü daha önce açıklandığı üzere onu getiren de Ebu Useyd idi",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 8
			}
		}
	]
}