{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5263,
			"arabicnumber": 5263,
			"text": "Mesruk'tan, dedi ki: \"Aişe r.anha'ya seçmekte serbest bırakılmaları hakkında soru sordum, şu cevabı verdi: (Evet) Nebi Sallallahu Aleyhi ve Sellem bizi seçmekte serbest bıraktı. Fakat bu bir talak oldu mu ki? Mesruk dedi ki: Eşim beni seçtikten sonra ben onu bir defa mı, yüz defa mı muhayyer bırakmış olduğuma aldırmam.\" Fethu'l-Bari Açıklaması: Aişe R.A.a'nın görüşü doğrultusunda ashabın, tabiınin ve bölge fukahasının cumhuru da görüş belirtirler. O da şudur: Bir kimse hanımını (boşanmak ile evliliğinin devamı hususunda) muhayyer bırakacak olsa, o da onu seçecek olursa bununla bir talak verilmiş olmaz. Fakat hanım (kocasını değil de) kendisini tercih edecek olursa, bu ric'ı bir talak mı olur yoksa bain bir talak mı olur yoksa üç talak mı olur hususunda ihtilaf etmişlerdir. Tirmizi'nin nakline göre Ali R.A., eğer kadın kendisini seçecek olursa hain bir talak olur. Şayet kocasını seçerse ric'ı bir talak olur, demiştir. Zeyd İbn Sabit'ten rivayete göre de kendisini seçtiği takdirde üç talak, kocasını seçtiği takdirde ise bain bir talak olur. İbn Ömer ve İbn Mesud'dan rivayete göre kendisini seçtiği takdirde bfÜn bir talak olur. Yine ikisinden, ric'ı bir talak olacağı da nakledilmiştir. Eğer kocasını seçerse hiçbir şeyolmaz. Anlam bakımından cumhurun görüşünü, muhayyer bırakmanın iki şey arasında gidip gelmek olduğu şeklindeki görüş de desteklemektedir. Şayet kadının kocasını seçmesini bir talak olarak değerlendirirsek her ikisi arasında fark kalmaz. Böylelikle onun kendisini seçmesinin ayrılık anlamında, kocasını seçmesinin ise nikahı altında kalmak anlamında olduğu görülmektedir. Kadının kendisini seçmesi halinde bunun bain bir talak olacağı hususunda Ebu Hanife, Ömer ve İbn Mesud'un görüşünü kabul etmiştir. Şafiı de muhayyer bırakmak bir kinayedir, demiştir. Buna göre koca, hanımını muhayyer bıraksa ve bununla kendisinden boş olması ile nikahı altında devam etmesi arasında istediğini -seçmeyi kastetmiş ise, kadın da kendisini seçerse, bu seçimiyle de boşamayı kastederse boş olur. Eğer: Ben kendimi seçmekle boşamayı kastetmemiştim diyecek olursa sözü doğru kabul edilir. Buradan anlaşıldığına göre, muhayyer bırakmakta boşamak açıkça ifade edilecek olursa talak da kesin olarak gerçekleşir. Buna hocamız, çağının haflZı Ebu'l-Fadl el-Irakı, Tirmizi şerhinde dikkat çekmiş bulunmaktadır. el-Hattabı dedi ki: Aişe'nin: \"Biz de onu seçtik ve bu bir talak olmadı\" sözünden şu anlaşılmaktadır: Eğer kendisini seçmiş olsaydı, talak olacaktı. Kurtubı de el-Müfhim adlı eserinde ona muvafakat ederek şöyle demektedir: Hadisten anlaşıldığına göre muhayyer bırakılan kadın, kendi nefsini seçecek olursa bizzat bu seçme ayrıca talaka delalet edecek bir lafzı söylemeye ihtiyaç bırakmaksızın bir talak olur. Bu hüküm de Aişe'nin sözü geçen ifadelerinden anlaşılmaktadır. Derim ki: Ancak ayetin zahiri mücerred olarak bunun talak olmayacağını, aksine kocanın talakı söz konusu etmesinin kaçınılmaz olduğunu göstermektedir. Çünkü ayette muhayyer bırakmak söz konusu edildikten sonra: \"Gelin size bağışta bulunayım ve sİzi güzellikle salıvereyim.\"(Ahzab, 28) diye buyurulmaktadır",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 13
			}
		}
	]
}