{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5267,
			"arabicnumber": 5267,
			"text": "ibn Cureyc şöyle demiştir: Atâ ibn Ebî Rebâh, Ubeyd ibn Umeyr'den şöyle derken işittiğini söyledi: Ben Âişe (r.anha)'den şöyle derken işittim: Peygamber(sallallahü aleyhi ve sellem) Zeyneb ibnetu Cahş'ın yanında eğlenir ve onun yanında bal şerbeti içerdi. Bunun üzerine Hafsa ile ben birbirimizle şöyle tavsiyeleştik: İkimizden hangimizin yanına Peygamber girerse, O'na: Ben Sen'den megâfir kokusu duyuyorum, Sen megâfir mi yedin? desin, dedik. iki kadından birinin yanına girince, o kadın bu sözü Peygamber'e söyledi. Peygamber de: (ben megâfir yemedim). Fakat Zeyneb bintu Cahş'ın yanında bal şerbeti içtim. Artık bir daha onu içmeğe dönmem\" dedi. bunun üzerine şu âyetler indi: \"Ey Peygamber! Sen zevcelerinin hoşnûdluğunu arayarak Allah 'in sana halâl kıldığı şeyi niçin(kendine) haram ediyorsun? (Bununla beraber üzülme) Allah çok mağfiret edici, çok merhamet eyleyicidir. Allah sizin için yeminlerinizin çözümlüğünü farz kılmıştır. Allah sizin yardımcınızdır ve O hakkıyle bilendir, tam hüküm ve hikmet sahibidir. Hani Peygamber, zevcelerinden birine gizli bir söz söylemişti. Bunun üzerine o açıklayınca,(Peygamber) bunun bir kısmını bildirmiş, bir kısmından da vazgeçmişti. Artık bunu kendisine söyleyince, o zevce: 'Bunu sana kim haber verdi?' dedi. (Peygamber de:) 'Bana herşeyi bilen, herşeyden haberdâr olan Allah haber verdi' dedi. Eğer ikiniz de Allah 'a tevbe ederseniz ne iyi, çünkü ikinizin de kalbleriniz eğildi. Yok, onun aleyhinde birbirinize arka verirseniz, hiç şübhesiz Allah bizzat onun yardımcısıdır, Cebrail de, mü 'minlerin sâlih olanları da. Bunların ardından bütün melekler de ona yardımcıdırlar\" (et-Tahrîm: 1-4). âyetteki\"Eğer tevbe ederseniz\" deki tesniye zamiri, Âişe ile Hafsa'ya âiddir. \"Hani Peygamber zevcelerinden birine gizli bir söz söylemişti\" fıkrası da\"Hayır, ben bal şerbeti içtim\" sözüne işarettir",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 17
			}
		}
	]
}