{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5268,
			"arabicnumber": 5268,
			"text": "Âişe (r.anha) şöyle demiştir: Rasûhıllah(sallallahü aleyhi ve sellem) balı ve tatlıyı severdi, ikindi namazından döndüğü zaman kadınlarının yanına girer ve onlardan birinin yanına yaklaşırdı. Bir gün Omer'in kızı Hafsa'nın yanına girdi de, orada kalmakta olduğundan daha çok kaldı. Ben bunu kıskandım (ve bunun sebebini soruşturdum). Bana: Hafsa'ya, kavminden bir kadın küçük bir çömlek bal hediye etti., o da bu baldan Peygamber'e şerbet içirdi, denildi. de kendi kendime: Vallahi biz bunun için muhakkak bir hile yaparız! dedim. Şevde bintu Zem'a'ya şöyle dedim: Biraz sonra Rasûlüllah muhakkak sana yaklaşacaktır. Sana yaklaştığında O'na: Sen megâfîr mi yedin? dersin, O da sana: Hayır, diyecektir. Bunun üzerine sen de O'na: Sen'den hissetmekte olduğum bu koku nedir? dersin. O da sana muhakkak: Hafsa bana bal şerbeti içirmişti! diyecektir. Sen de O'na:. O balın arısı urfut ağacından toplamıştır! dersin. Bana geldiğinde ben de böyle söyleyeceğim. Yâ Safiyye, sen de böyle söyle! dedim bu ta'lîmâtın tatbik suretini şöyle anlatmıştır: Şevde şöyle diyordu: Vallahi çok geçmedi Rasûlüllah kapının önünde durdu. Yâ Âişe, senden korktuğum için bana emrettiğin sözü hemen Rasûlüllah'a oracakta iken söylemek istedim. dedi. ki:) Rasûlüllah ona yaklaşınca, Sevde O'na: Yâ Rasûlallah, sen megâfîr zamkı mı yedin? demiş O da: \"Hayır!\" diye cevâb vermiş. Sevde: Sen'den hissetmekte olduğum bu koku nedir? demiş. Rasûlüllah: \"Hafsa bana bal şerbeti içirmişti!\" buyurmuş. Sevde: O balın arısı urfut ağacında yayılmış! demiş. Rasûlüllah benim odama dönüp geldiğinde ben de bu sözlerin benzerini söyledim. Safiyye'ye gittiğinde o da bunların benzerini söylemişti. Sonra Rasûlüllah dönüp Hafsa'nın nevbetinde yanına vardığında, Hafsa: Yâ Rasûlallah! Sana o bal şerbetinden içireyim mi? diye sorduğunda Rasûlüllah: \"Hayır, benim ona ihtiyâcım yoktur!\" buyurdu. Âişe (rivayetine son vererek) dedi. ki: Şevde bana: Vallahi biz Rasûlüllah'ı bal şerbetinden mahrum ettik, diyordu. de Sevde'ye: Sus! dedim(ve Hafsa hakkındaki hîle ve tedbîrimizin duyulmasını istemedim)",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 18
			}
		}
	]
}