{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5291,
			"arabicnumber": 5291,
			"text": "Nafi'den, o İbn Ömer’den şöyle dediği rivayet edilmiştir: \"Dört ay geçtiği takdirde erkek boşayıncaya kadar durdurulur ve kendisi talak vermedikçe hakkında talaka hüküm verilmez.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın: 'Hanımlanyla cinsi temasta bulunmamaya yemin edenler için dört ay beklemek vardır.'(Bakara, 226) buyruğu.\" Taberl, İbrahim en-Nehai/den şöyle buyurduğunu rivayet etmektedir: Fey' (dönüş) dil ile hanımına dönmek (ric'at yapmak)tir. Benzeri bir açıklama Ebu Kılabe'den de nakledilmiştir. Said İbn el-Müseyyeb, el-Hasen ve İkrime'den de şöyle dedikleri rivayet edilmektedir: Fey' (dönüş), dma' etmesi hususunda engeli bulunan kimse için kalp ve dil ile, başkası için ise cima' ile dönmek demektir. İbn Mesud'un -aralarında Alkame de vardır- ashabından gelen rivayet yoluyla da bunun gibi bir açıklama nakledilmiştir. Yine Said İbn el-Müseyyeb 'den gelen bir rivayete göre: Şayet bir gün yahut bir ay hanımıyla konuşmamaya yemin ederse bu bir 'Hadır. Ancak onunla konuşmaksızın dma' yapıyorsa Ila yapmamış olur. el-Hakem yoluyla Miksem'den, o İbn Abbas'tan şöyle dediği rivayet edilmiştir: Fey' (dönüş), dma' demektir. Mesruk, Said İbn Cubeyr ve eş-Şa'bi'den de bunun gibi bir rivayet gelmiştir. Onlardan gelen bu görüşlerin senedieri güçlü senedIerdir. Taberi der ki: Bu husustaki görüş ayrılıkları ila'nın tarifindeki ayrılıklardan kaynaklanmaktadır. Onu özellikle dma'ı terk etmeye tahsis edenler: Fiilen dma' da bulunmadıkça dönmüş olmaz, derler. ila hanımı ile konuşmamaya yahut onu kızdırmaya, kötülük yapmaya ya da buna benzer bir maksat ile yemin etmektir. Bu şekilde tanımlayanlar ise fey' (dönüş) için dma'ı şart koşmazlar. Aksine bu halde yapmamayı yemin ettiği için yapmakla dönmüş olur .. İbn Şihab'dan şöyle dediği nakledilmiştir: Kişi hanımından ayrı kalmak suretiyle ona zarar vermek istediği husus hakkında Allah adına yemin etmedikçe ila olmaz. Eğer ona zarar vermeyi kastetmemişse bu yemini ıla olmaz. Ali, İbn Abbas, el-Hasen ve bir başka grup yoluyla gelen rivayete göre de kızgınlık hali dışında Ila olmaz. Eğer süt emmekte olan çocuğunun annesinin hamile kalması korkusuyla sütünün bozulacağından endişeienmesi gibi bir sebebe bağlı olarak hanımıyla temasta bulunmamaya yemin edecek olursa bu ıla olmaz. Şa'bi yoluyla da şu rivayet nakledilmiştir: Erkek ile hanımı arasında engel teşkil eden her yemin bir ıladır. el-Kasım 'dan ve Salim'den: Bir sene zarfında seninle konuşacak olursam sen benden boşsun: deyip, dört ay geçtikten sonra onunla konuşmayacak olursa hanımının boş olacağı, eğer bir seneden önce de onunla konuşursa aynı şekilde hanımının ondan boş olacağı belirtilmiştir. Yine ıla'nın cumhur nezdinde kabul edilen hükümleri arasında şunlar da vardır: Yemini dört ay ve daha fazla bir süre için olmalıdır. Eğer daha az bir süre için yemin ederse !La yapmış olmaz. İshak dedi ki: Eğer bir ya da daha fazla gün süresince dma' yapmamak üzere yemin ederse, sonra da dört ay geçinceye kadar onunla dma' etmezse bu bir iladır. Tabilnden birisinden de bunun gibi bir görüş nakledilmiş olmakla birlikte çoğunluk bunu kabul etmemiştir. Buharl'nin daha sonra da Tirmizi'nin, Enes yoluyla gelen hadisi ıla başlığı altında zikretmeleri ise bu hususta İshak'ın da muvafakat etmesini gerektirmektedir. Bunlar yüce Allah'ın: \"Dört ay beklemek vardır\" buyruğunu ıla yapan kimse için tanınacak süre olarak anlamışlardır. Eğer bu süreden sonra dönerse mesele yok, aksi takdirde boşaması emredilir. Abdurrezzak, İbn Cüreyc'den, o Ata'dan şunu rivayet etmektedir: \"Eğer hanımına yaklaşmamak üzere yemin etse, süre belirlemiş olsun ya da olmasın dört ay geçtiği takdirde\" yani ılanın hükmünü yerine getirmesi istenir. Said İbn Mansur da el-Hasen el-Basri'den şunu rivayet etmektedir: \"Koca, karısı için: Allah'a yemin ederim bu gece ona yaklaşmayacağım dese ve o yemini dolayısıyla da dört ay karısını terk etse, bu bir ıladır.\" Taberi de İbn Abbas'tan şu hadisi -rivayet etmektedir: \"Cahiliye döneminde Ilanın süresi bir ve iki yıl idi. Şanı yüce Allah onlar için dört aylık bir süre tayin etti. Her kimin ılası (yaklaşmayacağına dair yemini) dört aydan daha az olursa bu bir ıla değildir.\" \"Dört ay geçtiği takdirde durdurulur.\" el-Küşmıhenı'nin rivayetinde \"onu durdurur\" şeklindedir. \"Talak verinceye kadar ve kendisi talak vermedikçe talak yapmış olmaz.\" Şafil de bunu böylece Malik'ten rivayet etmiş ve ayrıca: ''Ya ıla yaptığı karısını boşar yahut ona döner\" ziyadesi ile zikretmiştir. Said İbn Mansur, AbduITahman İbn Ebi Leyla yoluyla şunu rivayet etmektedir: \"Ben Ali'nin bir adamı dört ay dolunca er-Rahbe'de durdurduğunu ve ya hanımına dönmesini ya da onu boşamasını istediğini gördüm.\" Bunun da senedi aynı şekilde sahihtir. Bunun ashab-ı kiramdan on iki kişiden gelmiş bir rivayet olarak tespitine gelince, Buharı bunu et-Tarih 'inde Abdu Rabbih İbn Said yoluyla, Zeyd İbn Sabit'in azadlısı Sabit İbn Ubeyd'den, o Rasulullah Sallallahu Aleyhi ve Sellem'in ashabından on iki kişiden diye rivayet etmiştir. Bunların hepsi: \"lıa bu hususta (kararını verinceye kadar) durdurulmadıkça talak olmaz\" demişlerdir. Şafii bunu bu yoldan rivayet etmiş ve: \"On küsur kişi\" demiştir. İsmail el-Kadı de Yahya İbn Said el-Ensari yoluyla Süleyman İbn Yesar'dan şöyle dediğini rivayet etmektedir: \"Rasulullah Sallallahu Aleyhi ve Sellem'in ashabından on küsur kişiye yetiştim. Onlar dediler ki: Ila durdurulmadıkça talak olmaz",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 40
			}
		}
	]
}