{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5299,
			"arabicnumber": 5299,
			"text": "Abdullah İbn Hürmüz'den, dedi ki: Ebu Hureyre r.a.'yi şöyle derken dinledim: \"Rasuluilah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Cimrinin misali ile (cömertçe) infak edenin misali memelerinden göğüs kemiklerine kadar üzerlerinde demirden cübbe bulunan iki adamın misaline benzer. İnfak eden kişi bir şeyler infak ettikçe mutlaka o cübbesi teni üzerinden ta parmak uçlarını örtünceye ve (yerdeki) izlerini silinceyekadar uzar durur. Cimri kişi ise infak etmek istedi mi mutlaka her bir halka yerine iyice yerleşir. O onu genişletmek istediği halde bir türlü genişlemez. Bu arada parmağı ile boğazına işaret ediyordu.\" Fethu'l-Bari Açıklaması: \"Talak ve hikmetli çeşitli hususlar hakkında\", yani diğer şeylere dair \"işaret etmek.\" \"Zeyneb dedi ki .. \" Kasıt mu'minlerin annesi Cahş kızı Zeyneb'dir. \"Ve parmak uçlarını orta ve serçe parmağının iç tarafına koydu, biz: Onun azlığına işaret ediyor, dedik.\" Hadiste geçen \"evdah\" ile burada kastedilen, gümüşten süs eşyasıdır. \"Sonra birini diğerinden uzaklaştırd!.\" Müslim'de bu rivayet \"fecir yukarıdan aşağıya görülen değildir. Aksine uzunlamasına yayılandır.\" diye yer alır. Böylelikle sözü geçen işaret ile ne kastedildiği anlaşılmaktadır. İbn Battal dedi ki: Cumhurun kanaatine göre eğer işaret anlşılıyor ise konuşma gibi değerlendirilir. Ancak Hanefiler buna bazı hususlarda muhalefet etmişlerdir. Muhtemelen Buharı, Nebi Sallallahu Aleyhi ve Sellem 'in işareti konuşmak gibi değerlendirdiğini gösteren bu hadislerle onların kanaatini reddetmiştir. İşaret, din ile ilgili çeşitli hükümler hakkında caiz (geçerli) olduğuna göre, konuşma imkanı olmayan kimseler için böyle olması daha da caizdir. İbnu'l-Müneyyir dedi ki: Buharı talak vermek ve diğer hususlara dair konuşamayanın ve daha başkalarının, asıl maksadını ve sayının anlaşılabileceği işaretlerinin, tıpkı lafız gibi geçerli olduğunu kastetmiştir. Gördüğüm kadarıyla Buhar! bu Başlığı ve bu başlık altındaki hadisleri bundan sonraki Başlıkta söz konusu edeceği araştırmaya bir hazırlık olmak üzere zikretmiştir. Ancak bununla birlikte konuşamayan dilsizin lanetleşmesi ile talakı arasında da fark görmüş olanlar bulunmaktadır. Doğrusunu en iyi bilen Allah'tır. İlim adamları anlaşılan işaretin hükmü altında farklı görüşlere sahiptirler. YüceAllah'ın hakları ile ilgili hususlarda, konuşabilen kimsenin dahi olsa işareti yeterlidir, demişlerdir. Fakat akit, ikrar, vasiyet ve buna benzer Ademoğlunun hakları söz konusu ise dili tutulan kimsenin durumu hakkında ilim adamlarının farklı görüşleri vardır. Üçüncü bir görüş de Ebu Hanife'den nakledilmiştir: Eğer konuşabileceğinden yana ümit kesilirse (anlaşılır işareti geçerlidir, demişlerdir), bazı Hanbel1 alimlerinden de eğer hemen akabinde ölüm gelirse (geçerlidir) dedikleri nakledilmiştir. Tahav! de bu görüşü tercih etmiştir. el-Evzai'den de eğer ondan önce söz söylenmiş,ise (geçerlidir) dediği nakledilmiştir. Mekhul'den nakledildiğine göre ise eğer: Filan kişi hürdür dese, sonra konuşmayıp sussa ona da: Filan da mı diye sorulunca işaret etse işareti sahih olur. Konuşabilen kimsenin ise işareti, çoğunluğun kanaatine göre konuşmasının yerini tutmaz. İşaretin niyetin yerini tutup tutmayacağı hususunda ise görüş ayrılığı vardır. Hanımını boşayan kimseye: Kaç defa boşadın diye sorulunca parmağıyla işaret eden kimsenin durumunda olduğu gibi",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 48
			}
		}
	]
}