{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5305,
			"arabicnumber": 5305,
			"text": "Ebu Hureyre r.a.'den rivayete göre \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'e gelerek: Ey Allah'ın Rasulü, benim siyah bir oğlum oldu, diye sorunca, Allah Rasulü: Senin develel'in var mı, diye sordu. Adam: Evet dedi. Allah Rasulü: Renkleri nedir, diye sordu. Adam: Kırmızıdır deyince, Allah Rasulü: Peki aralarında beyazı, siyaha çalar boz renklileri de var mı diye sorunca, adam yine: Evet dedi. Allah Rasulü: Bu nereden geldi, diye sordu. Adam: Belki bir damarıyla soyuna çekmiştir, deyince, Allah Rasulü: Senin bu oğlun da belki bir damarı ile soyuna çekmiştir, diye buyurdu.\" Bu hadis 47 ve 7314 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"çocuğun kendisinden olmadığını tariz (üstü kapalı) bir şekilde ifade etmenin hükmü.\" Tariz bir şeyi zikredip, ondan zikretmediği bir başka şeyin anlaşılması demektir. Şafii, el-Umm adlı eserinde şunları söylemektedir: Bedevinin sÖz.ünün zahirinden karısını itham ettiği anlaşılmaktadır. Fakat onun bu sözü böyle bir iftira ve ithamdan başka bir anlama da geldiğinden ötürü Nebi Sallallahu Aleyhi ve Sellem bu sözü dolayısıyla kazf (zina iftirası) da bulunduğu hükmünü vermemiştir. Bu da tariz türü ifadelerde had olmadığına delildir. Tarizin tasrih (açık ifade) ile aynı hükümde görülmeyeceğinin delillerinden birisi de iddet bekleyen kadına tariz yoluyla (üstü kapalı ifadelerle) talip olmaya izin verilmiş olmasıdır. Ancak açık (sarih) ifadelerle böyle bir teklifte bulunmak caiz değildir. Doğrusunu en iyi bilen Allah'tır. \"Ey Allah'ın Rasuü, benim karım siyah bir çocuk doğurdu, dedi.\" Yunus yolu ile gelen rivayette: \"Ben bunu kabul edemedi m (açıklayamadım)\" fazlalığı da yer almaktadır. Yani kalbimden bunu kabullenemedim. O bu sözleri ile diliyle onun kendi oğlu olmadığını kastetmek istememiştir. Aksi takdirde çocuğun kendisinden olmadığını tariz yolu ile değil, sarih bir şekilde söylemiş olacaktı. Tarizin izahı da şudur: Onun: \"Siyah bir çocuk\" demesinin anlamı şudur: Halbuki ben beyazım, bu çocuk benden nasılolabilir? Bu ifadelerden, tariz yoluyla kazfde (zina isnadında) bulunmanın kazf olmadığı anlaşılmaktadır. Cumhur da bu görüştedir. Şafil de bu hadisi buna delil göstermiştir. Malikilerden nakledildiğine göre ise eğer tarizden bu (zina isnadı) anlaşılabiliyor ise had icab eder. \"Şüphesiz onlar arasında siyaha çalar boz develer vardır.\" el-Evrak (siyaha çalar boz deve) oldukça siyah renkli olmayıp, başka renge de çalan renkli deve demektir. Güvercine \"verka\" denilmesi de bundan dolayıdır. Hadisten Çıkan Sonuçlar 1- Misal göstermek ve bilinmeyeni n bilinen bir şeye, sorahın daha iyi anlamasını sağlamak için benzetmek (uygun bir anlatım tarzıdır). 2- Hadis kıyas ile amel etmenin sahih olduğuna delil gösterilmiştir. el-Hattabi der ki: Bu hadis kıyasu'ş-Şebeh diye bilinen kıyas türü için asli bir dayanaktır. İbnu'l-fuabi der ki: Bu hadiste kıyasın ve benzeri benzerine benzetmenin (ve kıyas yapmanın) sahih oluşuna delil vardır. 3- Kocanın sadece zanna dayanarak çocuğun kendisinden olmadığını söylemesi caiz değildir. Ayrıca çocuğun rengi annesinin rengine uymasa dahi çocuk babasına ilhak edilir. Kurtubi, İbn Rüşd'e uyarak şöyle demiştir: Siyahlık ve esmerlik gibi birbirine yakın renkler arasındaki farklılık dolayısıyla ve eğer cima'da bulunmuş olmayı kabul edip, arada istibra süresi geçmemiş ise beyazlık ve siyahlık sebebiyle çocuğun kendisinden olmadığını söylemenin hela! olmadığı hususunda görüş ayrılığı yoktur. Bu ifadeleriyle durumun kendi mezhebinde (Maliki mezhebinde) böyle olduğunu söylemek istemiş gibidir. Yoksa çeşitli durumlarda farklı hükümlerin bulunduğu Şafii mezhebine mensup alimler nezdinde görüş ayrılığı sabittir. Derler ki: Eğer böyle bir farklılık ile birlikte zina karinesi de yoksa, çocuğu nefyetmek caiz olmaz. Şayet karısını zina ile itham edip, kadın da kocası tarafından itham edildiği erkeğin renginden bir çocuk doğuracak olursa, sahih olan görüşe göre çocuğu kabul etmemek caizdir. İleride gelecek olan İbn Abbas'ın rivayet ettiği li'ana dair hadiste bunu pekiştiren ifadeler vardır. Hanbelilere göre ise mutlak olarak karine ile birlikte çocuğu nefyetmek (kendinden olmadığını söylemek) mutlak olarak caizdir. Görüş ayrılığı, böyle bir karinenin bulunmaması halinde söz konusudur. 4- Firaşın (kadının nikahı altında bulunduğu kocanın nikahının) hükmü, benzerliğin bulunmadığını dile getiren ifadelerden daha önceliklidir. 5- Nesepler lehine ihtiyatlı davranmak ve mümkün olduğu sürece nesepleri olduğu halde bırakmak, kötü zannı (suizannı) tahkik etmeye kalkışmaktan a11koymakuygun bir yoldur. 6- Tariz yoluyla kazf ile kazf hükmü açık ifade kullanılmadıkça -Maliki mezhebinin kanaatine aykırı ölarak- sabit olmaz. Mühelleb şöyle demiştir: Eğer tariz soru sormak şeklinde ise had gerekmez. Tarizde had, yüzyüze bulunmak ve karşılıklı olarak ağır sözler kullanmak halinde olduğu takdirde icab eder. İbnu'I-Müneyyir der ki: Tariz hususunda koca ile yabancı erkek arasındaki fark şudur: Yabancı erkek katıksız olarak eziyet verme maksadını güderken, koca nesebi koruma açısından mazur görülebilir. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 54
			}
		}
	]
}