{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5310,
			"arabicnumber": 5310,
			"text": "İbn Abbas'tan rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem'in huzurunda lanetleşme söz konusu edildi. Asım İbn Adiy bu hususa dair bir şeyler söyledi, sonra gitti. Kavminden bir adam yanına gelerek ona kaosı ile birlikte yabancı bir adam gördüğünü söyleyerek (karısını) şikayet edince, Asım: Benim bu belaya maruz kalmamın tek sebebi, o söylediğim sözlerdir, dedi. Sonra o adamı alıp Nebi Sallallahu Aleyhi ve Sellem'in yanına götürdü, o adam da Nebie karısı ile bulduğu adamı haber verdi. Haberi getiren o adamın benzi sarı, eti az, saçları düz ve sarkık idi. Bu adamın Asımlın karısının yanında bulduğunu iddia ettiği adam ise iri cüsseli, esmer ve çok etli birisi idi. Nebi Sallallahu Aleyhi ve Sellem: Allahlım, beyan buyur, diye dua etti. Kadın, kocasının karısı yanında bulduğunu söylediği adama benzeyen bir çocuk doğurdu. Nebi Sallallahu Aleyhi ve Sellem bu karı koca arasında lanetleşme yapmıştı.' Mecliste bir adam İbn Abbasla: Bu kadın Nebi Sallallahu Aleyhi ve Sellemlin: Eğer bir kimseyi beyyine olmaksızın recmedecek olsaydım, bunu recmederdim dediği kadın mıdır, diye sordu. İbn Abbas: Hayır, o İslam içinde (Müslüman olduğunu göstererek) kötülüğü de açığa vuran bir kadın idi, dedi. Ebu. Salih ve Abdullah İbn Yusuf: \"(İri vücutlu, esmer diye tercüme ettiğimiz) Ademe hadlenli ibaresini ilAdeme hadiienil diye söylemilerdir. Bu Hadis 5316,6855,6856 ve 7238 numara ile gelecektir. Fethu'l-Bari Açıklaması: \"Nebi sallallahu a1eyhi ve seltemlin: Beyyinesiz recmedecek olsaydım ... buy- ruğu. ii Kasıt zina ettiğini inkar eden kimsedir. Yoksa itiraf eden de recmedilir. liSarı tenli\", yani oldukça sarı. \"Hadlen\", bacakları dolgun demektir. liEğer beyyinesiz recmedecek olsaydım ... ii Kadının lanetleşmeyi kabul etmemesi, ona had vurmayı gerektirmez diyen kimseler bunu delil almışlardır. Ayrıca hadlerin yemin etmeyi kabul etmemekle sabit olmayacağını, Nebi efendimizin de: liEğer recmedecek olsaydım .. ii buyruğunu ise sadece lanetleşme sebebi ile sÖylememiş olduğunu da delil göstermişlerdir. Ahmed dedi ki: Kadın lanetleşmeyi kabul etmezse hapsedilir. Recmedileceği ni söylemekten çekinirim. Çünkü açıkça zina ettiğini ikrar etse, sonra bu ikrarından geri dönse dahi recmedilmeyeceğine göre, lanetleşmeyi kabul etmediği için nasıl recmedilebilir?",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 59
			}
		}
	]
}