{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5314,
			"arabicnumber": 5314,
			"text": "İbn Ömer radiyallahu anh'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem ensardan bir erkek ile bir kadın arasında lanetleşme yaptıl'dı ve onları birbirinden ayırdı.\" Fethu'l-Bari Açıklaması: \"Lanetleşen karı-kocayı ayırmak.\" Derim ki: Bu husus daha önce Sehl ile ilgili hadiste İbn Cüreyc yoluyla da şöylece gelmişti: \"Bu, lanetleşen karı-kocanın sünneti oldu. Ebediyyen bir araya gelemezler.\" Ama bu ifadenin zahirinden anlaşıldığına göre bu sözler ez-Zührı'ye aittir. Bu durumda bu ibare mürselolur. Ben bunu kimlerin mevsul sened ile, kimlerin de mürsel sened ile rivayet ettiklerini \"Uan ve Talak Veren Kimse\" ile ilgili başlıkta açıklamış bulunuyorum. ------------ Söz konusu başlık 29 numaralı başlıktır. Ancak ihtisarda İbn Hacer'in işaret ettiği bu açıklamalar kaydedilmemiştir. Bu açıklamalar için bk. Fethu'l-Bari, IX, 361 Bu böyle kabul edildiği takdirde bu lafzın bu yolla sabit olduğu anlaşılır Bundan dolayı da, lanetleşen kimselerin ayrılığı hakim tarafından hüküm verilmedikçe bizzat li'an ile gerçekleşmez, diyenler bunu delil kabul etmişlerdir. İbn Cüreyc'in sözü geçen rivayeti de ayrılığın bizzat li'an ile gerçekleştiğini desteklemektedir. Rivayetin mürselolduğu kabul edilecek olursa, İbn Ömer'den lafzı ile Darakutnı'den rivayet gelmiş bulunmaktadır. Böylelikle bu başlıktaki hadiste sözü edilen ayrılmayı Ii'an ile ayrılığın meydana gelişi şeklinde değil, hükmün beyanını açıklamak şeklinde yorumlayanların görüşleri güçlenmektedir. Bunlar aynı şekilde diğer rivayette: \"Senin onun aleyhine bir yolun yoktur\" şeklindeki ifadeyi de delil göstermişlerdir. Ancak bu sözlerin, adamın karısının kendisinden mehir olarak almış olduğu malın durumunu sormasına cevap olarak söylendiği belirtilerek reddedilmiştir. Buna da, asıl itibar edilen lafzın umumiliğinedir, diye cevap verilmiştir. Lafız da nefyden sonra nekre olarak gelmiştir. Dolayısıyla hem malı, hem bedeni kapsar. Buna göre onun karısı üzerinde herhangi bir şekilde bir hakkının bulunmamasını gerektirir. Ebu Davud'da yer alan İbn Abbas yoluyla gelmiş olan hadisin sonlarında ise şöyle denilmektedir: \"(Allah Rasulü) erkeğin nafaka ve sükna yükümlülüğünün bulunmadığına hüküm verdi. Çünkü o karı koca, talak söz konusu olmaksızın ayrılmış oldular ve ayrıca bu ayrılık, kadının kocası da vefat etmiş olduğu için meydana gelmemiştir.\" Bu ifade, ayrılıklarının bizzat o lanetleşme ile meydana geldiği hususunda açıktır. Bundan anlaşıldığına göre Sehl yoluyla gelen hadisteki: \"Rasuluilah sallall\"hu aleyhi ve sellem ona karısından ayrılmasını emretmeden önce o karısına üç defa talak verdi\" ifadesine göre adamın, bizzat lilan ile ayrılığın gerçekleşeceğini bilmeden önce karısına talak verdiği ve ona aşırı nefretinden ötürü onu boşamakta elini çabuk tuttuğu anlaşılmaktadır. Hadisteki: \"Ebediyyen bir araya gelemezler\" ibaresi de Ii'an yoluyla ayrılığın ebediyyen söz konusu olacağına delil gösterilmiştir. Ayrıca lanetleşen bir erkeğin, yalancı olduğunu söylerse bundan sonra o kadın ile evlenmesinin helal olmayacağına da delil gösterilmiştir",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 63
			}
		}
	]
}