{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5316,
			"arabicnumber": 5316,
			"text": "İbn Abbas'tan, dedi ki: \"Rasuluilah Sallallahu Aleyhi ve Sellem'in huzurunda lanetleşen karı-kocanın durumu söz konusu edilince, Asım İbn Adiy bu hususta bir şeyler $öyledikten sonra ayrılıp gitti. Kavminden bir adam gelerek ona kansı ile bidikte yabancı bir adam gördüğünü aktarınca, Asım: Benim bu hususta belaya maruz kalmamın tek sebebi söylediğim o sözlerdir, dedi. Daha sonra adamı alıp Rasulullah Sallallahu Aleyhi ve Sellem'in yanına gitti ve ona karısının üzerinde bulduğu adamı haber verdi. -Bu haberi getiren adam- sarı tenli, zti az, saçları düz ve sarkık birisi idi. Karısı yanında bulduğunu söylediği kişi ise esmer, dolgun bacaklı, bol etli, saçları da kıvırcık bir kimse idi. Bunun üzerine Rasulullah Sallallahu Aleyhi ve Sellem: Allah'ım, beyan eyle, diye dua etti. Kadın, kocasının karısının yanında bulduğunu söylediği adama benzer bir çocuk doğurdu. Rasulullah Sallallahu Aleyhi ve Sellem de aralarında lanetleşme yaptıl'dı.\" Mecliste bir adam İbn Abbas'a: O kadın Rasulullah Sallallahu Aleyhi ve Sellem'in: \"Eğer bir beyyine olmaksızın birini recmedecek olsaydım, bu kadını recmederdim\" dediği kadın mıdır, diye sordu. İbn Abbas da ona: Hayır, o kadın İslam içinde (Müslüman olduğu bilindiği halde) kötülük izhar eden bir kimse idi, diye cevap verdi. Fethu'l-Bari Açıklaması: \"İmamın: Allah'ım, beyan buyur, demesi.\" İbnu'l-Arabi der ki: Bu duanın anlamı sadece onlardan birisinin doğruluğunun sabit olmasını istemek değildir. Aksine bu dua, benzerliğin ortaya çıkması için kadının doğum yapması anlamını da taşımaktadır. Mesela, çocuğun (annesinin karnında) ölmesi ile gerekli beyanın ortaya çıkmaması gibi bir hal ileri sürülerek bu manaya delalet etmeyeceği söylenemez. Bundaki hikmet, meydana gelen böyle bir olaya katılmaktan, hazır bulunanların uzak kalmaları gerektiğine dikkatleri çekmektir. Çünkü böyle bir iş, had söz konusu olmasa dahi oldukça çirkindir. \"İslam içinde kötülüğü izhar eden bir kadın idi.\" Yani hayasızlığı açıktan iş!erdi. Fakat bu husus onun hakkında bir beyyine ile ya da onun itirafı ile sabit olmamıştı. ed-Davudi dedi ki: Bu hadiste kötü yoldan gidenleri ayıplamanın caiz olduğu anlaşılmaktadır. Ancak buna karşılık İbn Abbas'ın bu kadının adını vermediği belirtilerek cevap verilmiştir. Eğer adı zikredilmeyip, müphem bırakılmak suretiyle açıkça ayıplanacağını kastetmişse, bu ihtimal dahilindedir. Tefsir bölümünde İkrime'nin, İbn Abbas'tan diye naklettiği rivayette: \"Nebi Sallallahu Aleyhi ve Sellem: Eğer Allah'ın Kitabında geçen hüküm olmamış olsaydı, ben ona ne yapacağımı bilirdim, diye buyurdu\" dediği nakledilmiştir. Eğer bu hususta Allah'ın hükmü geçmemiş olsaydı yani lanetleşme sebebi ile kadına had uygulanmaz hükmü bulunmasaydı, doğurduğu çocuk ile kendisiyle zina ettiği isnad olunan adam arasındaki apaçık benzerlikten ötürü bu kadına had uygulardım, demektir. Hadisten anlaşıldığına göre Nebi Sallallahu Aleyhi ve Sellem hakkında özel olarak vahiy inmemiş olan hususlarda ictihada göre hüküm verirdi. O mesele ile ilgili hükme dair vahiy indirildiği takdirde ise ictihad etmeyi bırakır, üzerine indirilen hüküm gereğince uygulama yapar ve zahire göre -zahirin aksini gerektiren bir karine bulunsa dahi- icraatta bulunurdu. Li'an ile ilgili hadislerde, bu sonuçlardan daha başka son uçlar da çıkarılmıştır: 1- Müftiye herhangi bir olay ile ilgili soru sorulup, o da onun hükmünü bilmemekle birlikte buna dair bir nas bulacağını ümit ediyor ise bu hususta ictihad etmekte acele etmemelidir. 2- Meydana gelen bir olay hakkında soru sorup hükmünü öğrenmek için yolculuk yapılır. Çünkü Said İbn Cübeyr lanetleşme meselesi için Irak'tan Mekke'ye yolculuk yapmıştır. 3- Alimin tazim edilmesi ve ona künyesiyle hitap edilmesi uygun alandır. 4- Hayret verici hal görüldüğü vakit tesbih getirilir (subhanallah denilir). 5- Bela, konuşulan şey ile de alakalıdır. Eğer bu belakonuşanın başına gelmese bile onunla bir ilişkisi bulunanın başına gelir. 6- Hakim davacıyı ona öğüt vererek, hatırlatmada bulunarak, sakındırarak, batııda ayak diretip onu sürdürmesinden vazgeçirmeye çalışır, daha etkileyici olması için de bunu tekrar tekrar yapar. 7- İki kötülüğün daha ağır olanı terk edilerek daha hafif olanı işlenir. Çünkü çirkin ve ağır olmakla birlikte kıskançlığın ve gayretin gerektirdiği şeyin aksine sabır gösterip katlanmak, öldürenin kısas ile öldürülmesi sonucunu verecek olan öldürmeye kalkışmaktan daha hafif bir kötülüktür. Üstelik şeriat koyucu, o kadından rahat edip kurtulmak için onu boşamak ya da lanetleşmek yolu ile önünde bir yol açmış bulunmaktadır. 8- Bir kişinin (sika olduğu takdirde) haberi ile (vahid haber ile) amel olunur. 9- Lanetleşecek karı-kocaya lanetleşileceği vakit öğüt vermek, hakim için sünnettir. Beşinci lanet yapılacağı vakit ise bu daha da pekişir. 10- Hükmün açıklanması ile birlikte delil de zikredilir. 11- Müslümanın gizli kabahatlerini açığa çıkartacak yahut herhangi bir sebeple ona eziyet vermek ile sonuçlanacak hususlara dair soru sormak mekruhtur. 12- Ashab-ı kiram, hakkında vahiy inmemiş bulunan meselenin hükmüne dair soru sorarlardı. 13- Alimin bir sorudan hoşlanmaması halinde o soruyu ayıplaması ve çirkin görmesi hakkı vardır. 14- Bir hükmü bilmek ihtiyacında olan bir kimse, alim olan şahsın o sorudan hoşlanmaması, bundan dolayı ona kızması veya katı davranması dolayısıyla o bilgiyi öğrenmekten geri durmamalıdır. Aksine ihtiyacını görünceye kadar onunla güzel ve yumuşak muameleye riayet eder. 15- Din için bilinmesi gerekli olan hususlara dair gizli ya da açıktansoru sormak meşru bir iştir. Bundan dolayı soru soranın kusur ya da ayıp işlemesi söz konusu değildir. İsterse hakkında soru sorulan husus çirkin görülen işlerden olsun. 16- Tevbe teşvik edildiği gibi, gizliliğe riayet ederek amelde bulunmak da teşvik edilmiştir. 17- (Aksi iddialarda) Hak, ancak iki taraftan birisindedir. 18- İmamın zina isnad olunan kimseye, kendisine bu isnadda bulunanın söylediklerini bildirme yükümlülüğü yoktur. 19- Hamile olan kadın doğum yapmadan önce lanetleşir. Çünkü hadiste: \"Bakınız eğer ... doğurursa\" ifadeleri yer almaktadır. Bunu kabul etmeyen Rey ehlinin hılafına cumhur bu kanaattedir. Rey ehlinden bu kanaatte olmayanlar; \"Hamilelik bilinemez. Çünkü bu bir şişkinlik de olabilir\" diye gerekçe göstermişlerdir. Ancak cumhurun delili şudur: Lanetleşmek, erkeğin üzerinden zina iftirası haddini bertaraf etmek için meşru kılınmıştır. Aynı şekilde kadının da recmedilme haddinden kurtulması içindir. Dolayısıyla kadının hamile olması ile olmaması arasında bir fark yoktur. Bundan dolayı laİ'letleşme ay halinden kesilmiş, doğum yapma ihtimali kalmamış olan kadın hakkında da meşru kılınmıştır. Fakat doğum yapamayacak kadar küçük olan hakkında görüş ayrılığı vardır. Cumhura göre erkek eğer buna zina isnad edecek olursa kendisi üzerinden zina isnadı (kazf) haddini kaldırmak için lanetleşir, ama yaşı küçük ise lanetleşmez. 20- Hüküm zahir ile alakalıdır. Gizlilikler ise yüce Allah'a havale edilmiştir. 21- LaneHeşmek, kocanın kendisi ile zifafa girdiği yahut girmediği her kadın hakkında söz konusu olabilir. Hatta bu hususta İbnu'l-Münzir icma' bulunduğunu nakletmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 65
			}
		}
	]
}