{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5325,
			"arabicnumber": 5325,
			"text": "Abdurrahman İbn el-Kasım'dan, o babasından dedi ki: \"Urve İbn ez-Zubeyr, Aişe r.anha'ya dedi ki: el-Hakem'in kızı filan kadını görmez misin? Kocası onu kesin olarak boşadığı halde o hemen dışarı çıktı. Bunun üzerine Aişe: Ne kötü bir iş yaptı, dedi. Urve: Peki, Fatıma'nın söylediklerini işitmedin mi, diye sordu. Bu sefer Aişe: Şunu bil ki bu hadisi zikretmekte bir hayır yoktur, dedi.\" İbn Ebi'z-Zinad, Hişam'dan, o babasından şu fazlalığı zikretmektedir: \"Aişe (Fatıma'nın söz konusu edilmesini) şiddetli bir şekilde ayıpladı ve: Fatıma ıssız bir yerde idi. Bulunduğu yerde onun hakkında endişe edildi. İşte bu sebeple Nebi Sallallahu Aleyhi ve Sellem de ona ruhsat verdi, dedi.\" Fethu'l-Bari Açıklaması: \"Aişe: Fatıma'nın hadisini zikretmemenin sana bir zararı olmaz dedi\" ibaresi şu demektir: Çünkü boşanmış kadının sebepsiz yere evinden bir başka yere intikal etmesinin caiz oluşuna o hadiste bir delil yoktur. \"Mervan İbn el-Hakem: Eğer senin yanında bir şer varsa ... dedi.\" Yani eğer senin yanında Fatıma'nın evinden çıkış sebebi, kendisi ile kocasının akrabaları arasında meydana gelen şer ve kötülük ise, bu sebep bu olayda da mevcuttur. Bundan dolayı: \"Bu ikisi arasındaki şer sana yeter\" demiştir. Bunu ayrıca Müslim, Ma'mer yoluyla ez-Zührı'den diye baştaki ifadeler bulunmaksızın ama şu fazlalıkla rivayet etmiş bulunmaktadır: \"Mervan bu hadis sadece bir kadından işitilmiş bulunuyor. Bu sebeple biz de insanların uyguladıklarını gördüğümüz hale sımsıkı sarılarak onu uygulayacağız, dedi.\" Sanki Mervan mutlak olarak dışarı çıkmayı kabul etmemiş, sonra da ileride geleceği üzere kadına talak verilen evden çıkmasının caiz olmasını gerektirecek arızi bir halin varlığı şartı ile caiz olduğunu kabul etmiş gibidir. \"İbn Ebi'z-Zinad, Hişam'dan, o babasından diyerek şu fazlalığı zikretmektedir: Aişe son derece ağır bir şekilde (Fatıma'nın söz konusu edilmesini) ayıptadı ve: Fatıma ıssız bir yerde idi. Bundan dolayı da ona zarar geleceğinden endişe edildi. İşte bunun için Nebi Sallallahu Aleyhi ve Sellem ona ruhsat vermişti, dedi.\" Bunu Ebu Davud, İbn Vehb yoluyla Abdunahman İbn Ebi'z-Zinad'dan: \"Andolsun ayıpladı\" lafzı ile mevsul olarak rivayet etmiş ve: \"Fatıma bintKays'ı kastederek\" fazlalığını eklemiştir. \"ıssız\" ifadesi ise tenha ve yanında ünsiyet edeceği kimsenin bulunmaması demektir. İbn Ebi'z-Zinad'ın bu rivayetinin EbCt Üsame'nin, Hişam İbn Urve'den diye naklettiği bir şahidi de vardır. Fakat orada şöyle demiştir: \"(Hişam) babasından, o Fatıma bint Kaysıtan dedi ki: Ey Allah'ın Rasulü, kocam beni üç talak ile boşadı. Ben üzerime (bulunduğum yere) zorla girileceğinden korkuyorum, dedi. Allah Rasulü de ona emir verdi, o da bunun üzerine başka bir yere geçti.\" Buhari bab başlığını Fatıma kıssasında varid olmuş rivayetlerin toplamından çıkarmış bulunmaktadır. Dışarı çıkmasının caiz oluşunu da şu iki husustan birisinin varlığına bağlamıştır: Ya onun bulunduğu yere zorla girileceğinden korkulacak yahut kadın tarafından kendisini boşayan erkeğin yakınlarına çirkin sözler söyleyecek. Selef bain talak ile boşanmış kadının nafakası ve sükna hamile kadının hakkı hususunda ihtilaf etmişlerdir. Cumhur nafaka hakkının bulunmadığını, sükna hakkının olduğunu söylemiştir. Sükna hakkının sabit olduğuna da yüce Allah'ın: \"O kadınları gücünüz yettiğince kaldığınız yerin bir kısmında iskan edin.\"(Talak, 6) buyruğunu delil göstermişlerdir. Nafaka hakkının bulunmadığına da yüce Allah'ın: \"Eğer onlar hamile iseler yüklerini bırakıncaya kadar onlara nafaka verin. \"(Talak, 6) buyruğunun mefhumundan hareket etmişlerdir. Çünkü bu buyruğun mefhumundan anlaşıldığına göre, hamile olmayan boşanmış kadının nafaka hakkı yoktur. Aksi takdirde onun özellikle söz konusu edilmesinin bir anlamı olmazdı. Diğer taraftan siyak (ifadelerin akışı), buyruğun ric'i talakla boşanmamış (bfun talakla boşanmış) hakkında olduğu anlamını da vermektedir. Çünkü ric'i talak ile boşanmış kadının nafakası, hamile olmasa dahi vaciptir. Ahmed, İshak ve Ebu Sevr ise Fatıma bi nt Kays'ın hadisinin zahirinden anlaşılana göre nafakasının da, sükna hakkının da olmadığı kanaatinde olup, birinci ayetin bain talak ile boşanmış kadını söz konusu ettiği hususunda da itiraz etmişlerdir",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}