{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"68": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5350,
			"arabicnumber": 5350,
			"text": "İbn Ömer'den rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem lanetleşen karı-kocaya: Hesabınızı görmek Allah'a aittir. Sizden birisi yalancıdır. (Kocasına dönerek): Senin onun aleyhine bir yolun yoktur, diye buyurdu. Kocası: Ey Allah'ın Rasulü, malım (verdiğim mehir) ne olacak deyince, Allah Rasulü: Malın yoktur, eğer senin bu kadın hakkında söylediklerin doğru ise onun fercinin sana helal olması karşılığında malona aittir. Eğer sen o kadına yalan söyleyip iftira ediyorsan, bu daha da uzaktır ve bu malın ondan sana uzaklığı daha fazladır, diye buyurdu.\" Fethu'l-Bari Açıklaması: \"Mehri tayin edilmemiş olan kadına mut'a vermek. Çünkü yüce Allah: \"Kendileriyle temas etmediğiniz yahut kendilerine mehir tayin etmemiş olduğunuz hanımları boşarsanız, üzerinize bir günah yoktur ... Allah işlediğinizi görendir.'' (Bakara, 236-237) diye buyurmuştur.\" Buharl'nin başlıkta \"mehri tayin edilmemiş\" kaydına, ayette geçen, yüce Allah'ın: \"Yahut onlara mehir tayin etmemiş iseniz\" buyruğunu delil getirmiştir. Bu da onun \"ev: yahut\" lafzının farklı tür ve çeşitleri belirtmek için kullanıldığı görüşünde olduğunu göstermektedir. Kendisi ile temas kurulmadan bir kadının boşanmasının vebal olmayacağını belirttiğinde onun mut'ası da yoktur. Çünkü mut'a müsemma mehirden daha azdır. Dolayısı ile temas kurulduğu halde bilinen bir miktar olarak mehri tespit edilmiş olan kadına verilmesi gerekenden fazlası nasıl sabit olabilir? Bu, ilim adamlarının iki görüşünden birisi olduğu gibi, Şafii'nin de bu husustaki iki görüşünden birisidir. Ebu Hanife'den rivayete göre ise mut'a, mehri tespit edilmemiş olan ve kendisi ile zifafa girilmeden önce kocası tarafından boşanan kadına ait bir özelliktir. Seleften bir kesime göre ise istisnasız olarak boşanan her kadına bir mut'a verilir. Şafil'den de benzeri bir görüş nakledilmiş olup, tercihe değer olan da budur. Aynı şekilde kadından kaynaklanan bir sebep dolayısıyla husule gelen ayrılık hali dışında her bir ayrılmada da mut'a vermek icap eder",
			"grades": [],
			"reference": {
				"book": 68,
				"hadith": 95
			}
		}
	]
}