{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"69": "Supporting the Family"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5356,
			"arabicnumber": 5356,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Rasulullah Sallallahu Aleyhi ve Sellem şÖyle buyurdu: \"Sadakanın hayırlısı geriye bir zenginlik bırakandır ve sen (infaka) geçindirmekle yükümlü olduklarından başla.\" Fethu'l-Bari Açıklaması: \"Ehil ve ıyale nafakanın vüco.bu.\" Zahiren anlaşıldığına göre başlıkta geçen \"ehi!\"den kasıt zevcedir. \"Iyal\" de özelden sonra genelin atfedilmesi kabilindendir ya da \"ehil\"den maksat zevce ve akrabafar,' \"ıyal\"den kasıt ise zevce ve hizmetçilerdir. Böylelikle zevcenin hakkı, tekid edilmesi için iki defa zikredilmiş olmaktadır. Zevceye nafakanın vacip oluşunun delili Nafakalar bölümünün baş taraflarında geçmiş bulunmaktadır. Sünnetten delili de Müslim'in zikrettiği Cabir yoluyla gelen şu hadistir: \"Zevcelerinizin de sizin üzerinizde rızıklarını ve giyimlerini maruf bir şekilde sağlamanız hakları vardır.\" Mana cihetiyle deliline gelince, kadın kocasının hakkı dolayısı ile kazanç sağlama yollarına gidememektedir. Kadının nafakasının kocasına ait olduğu üzerinde icma' olmuştur. Fakat bunun miktarını tespit etmekte farklı görüşler vardır. Cumhur bunun yetecek kadar olacağı kanaatindedir. Şafil ve bir kesim de -İbnu'lMünzir'in dediği gibi- bunun miktarının müdlerle belirleneceği ni söylemişlerdir. Şafıllerin cumhuru ise İbn Huzeyme ve İbnu'l-Münzir gibi hadis ashabına uygun kanaat belirtmişlerdir. \"En faziletli sadaka geriye zenginlik bırakandır.\" Buna dair açıklamalar Zekat bölümünün baş taraflarında geçmiş bulunmaktadır. İbnu'l-Münzir der ki: Erkek çocuklardan büluğa erişip, malı ve kazancı olmayan kimselerin nafakası hususunda görüş ayrılığı vardır. Bir kesimin kanaatine göre eğer çocukların kendilerini ihtiyaçtan kurtaracak kadar malları yoksa küçük yahut büluğa ermiş olsunlar erkek ya da dişi olsunlar, hepsine nafaka vaciptir. Cumhurun kanaatine göre ise vacip olan nafaka, erkek için büluğ yaşına ulaşıncaya kadar, dişi için de evleninceye kadardır. Bundan sonra da babanın bunlara nafaka yükümlülüğü -kötürüm olmaları hali dışında- yoktur. Eğer bunların malları varsa babanın nafakalarını vermek vücubu da kalmaz. Şafil bu hususta istediği kadar aşağıya insin çocuğun çocuğunu da buna katmıştır. Sözü geçen, el-İsmam yoluyla gelen rivayette şu ibareler yer almaktadır: \"Ey Ebu Hureyre, sen bunu kendi görüşüne göremi söylüyorsun yoksa Rasulullah Sallallahu Aleyhi ve Sellem'in söylediği sözlerden midir, diye sordular. O: Bu benim kendi çıkarımımdır, diye cevap verdL\" Ebu Hureyre'nin: \"Bu benim çıkarımımdır (min klsl)\" sözü kefin kesresi ile okunur. Yani bu onun çıkardığı bir sonuçtur. Bununla onun merfu hadisten vakıayı da göz önünde bulundurarak anladıklarından Çıkardığı, istinbat ettiği bir sonuçtur. el-Asm yoluyla gelen rivayette ise \"kef' harfi üstün olarak okunmuştur ki, onun zekasından çıkarttığına işarettir. Rivayetteki \"ya bana yedirirsin yahut beni boşarsın\" sözü de erkek, karısının nafakasını karşıiamakta zorlanır, kadın da ondan ayrılmayı seçtiği takdirde erkek ile karısının ayrılmasına hüküm verilir, diyenler tarafından. delil gösterilmiştir. Bu, alimlerin cumhurunun görüşüdür. Kufeli alimler ise: Bu durumda kadının sabretmesi gerekir; ama nafaka da kocanın zimmetinde bir borç olur demişlerdir",
			"grades": [],
			"reference": {
				"book": 69,
				"hadith": 6
			}
		}
	]
}