{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5379,
			"arabicnumber": 5379,
			"text": "Enes b. Malik r.a.'den şöyle dediği rivayet edilmiştir: \"Bir terzi Rasulullah Sallallahu Aleyhi ve Sellem'i hazırladığı bir yemeğe davet etti. Enes dedi ki: Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte gittim. Onun tabağın çeşitli yerlerindeki kabağı araştırdığını gördüm. Enes dedi ki: İşte o günden bu yana kabağı hep sevmişimdir.\" Fethu'l-Bari Açıklaması: \"Arkadaşı ile birlikte yemek yerken tabağın etrafından yemek araştırmak.\" Tabağın etrafı onun kenarları demektir. \"Arkadaşının bundan hoşlanmadığını ortaya koyan bir belirti yoksa.\" Buhari bu başlık altında Enes r.a.'ın rivayet ettiği Nebi Sallallahu Aleyhi ve Sellem'in tabağın çeşitli yerlerindeki kabağı arayıp bulmasına dair hadisini de zikretmektedir. Bu hadis zahiri itibariyle bundan önce geçen, önündekinden yeme emri ile çatışmaktadır. Buhari bu iki hadisi beraberinde yemek yiyen kimsenin buna razı olduğunu bilmesi halinde caiz olduğunu yorumlayarak, iki hadisi bir arada telif etmiş bulunmaktadır. Hadisten Çıkarılan Sonuçlar 1- Şerefli bir kimsenin bir meslek icra eden kimse ile ve daha başkaları gibi kendinden daha aşağı bir kişi ile yemek yemesi, onun davetini kabul etmesi, hizmetçi ile beraber yemek yemek caizdir. 2- Hadisten Nebi Sallallahu Aleyhi ve Sellem'in ashabına karşı ne kadar alçak gönüllü, onlara karşı ne kadar yumuşak olduğu ve zaman zaman onların evlerine gidip geldiği de anlaşılmaktadır. 3-1\\z dahi olsa yemek için yapılan davete icabet edilir. 4- Misafirler önlerine konulan yemekten birbirlerine ikram edebilirler. Yasak olan, başkasının önündekini kendisi ya da başkası için almaktır. 5- Hayırlı kimselere benzeme ve yemek ve diğer hususlarda onlara uymaya özel gayret ve dikkat gösterilmelidir. 6- Hadiste Enes'in açıkça bir fazileti görülmektedir. Çünkü o insan tabiatıyla alakah olan hususlara varıncaya kadar Nebi Sallallahu Aleyhi ve Sellem'in izinde gitmeye çalışmıştır. Ayrıca bu hususlarda ona tabi olmak için nefsirÜ zorladığı dahi olmuştur. Allah ondan razı olsun",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 7
			}
		}
	]
}