{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5389,
			"arabicnumber": 5389,
			"text": "İbn Abbas'tan rivayete göre \"İbn Abbas'ın teyzesi olan el-Haris b. Hazm'in kızı Ümmü Tufeyl, Nebi Sallallahu Aleyhi ve Sellem'e bir miktar tereyağı, keş ve birkaç keler hediye etmişti. O da bunların getirilmesini emir buyurdu. Sofrası üzerinde bunlar yenildi. Nebi Sallallahu Aleyhi ve Sellem. onlardan tiksinmiş gibi o kelerleri yiyemedi. Eğer kelerlerin yenilmesi haram olsaydı, Nebi Sallallahu Aleyhi ve Sellem'in sofrası üzerinde bunlar yenilmez ve yenilmelerini de emretmezdi.\" Fethu'l-Bari Açıklaması: \"İnceltilmiş ekmek ve masa üstünde ve sofrada yemek yemek.\" İnceltilmiş ekmek ile ilgili olarak Iyad şunları söylemektedir: İnceıtilmiş ekmektenmaksat, beyaz ekmek ve benzeri ekmekler gibi yumuşatılmış, güzelleştirilmiş ekmek demektir. İnceltmek (terklk) yumuşatmak anlamındadır. Çünkü o dönemde Araplarda elek yoktu. İnceltilmiş (anlamındaki murakkak) lafzı bazen ince ve geniş ekmek anlamına da gelir. İbnu'l-Cevzl de şöyle demiştir: Bu, hafif olan ekmek anlamındadır. Kendisi ile (hamurun) inceltildiği tahta (merdane) olan er-Rikak'tan alınmış gibidir. Masa, üzerinde yemek bulunmayan, yemek yenilen araçtır. Sofra ise üzerinde yemek konulan örtü hakkında kullanılması meşhurdur, ama asıl anlamı yemeğin kendisidir. \"Enes'in ekmek pişiricisi yanında iken biz de Enes'in yanında idik.\" Taberanı'de Raşid b. Ebi Raşid yoluyla şöyle dediği rivayet edilmiştir: \"Enes'in kendisine bazı kurutmalar yapan, on iki tür yemek pişiren ve ona elenmiş undan ekmek pişirip tereyağı ile yoğuran bir kölesi vard!.\" Elenmiş un (el-huvarı) ardı arkasına defalarca elenen has un demektir. \"Nebi Sallallahu Aleyhi ve Sellem ne inceltilmiş ekmek, ne de közde kızartılıp kebap yapılmış koyun yedi.\" el-Mesmut (közde kızartılıp kebap yapılmış), sıcak su ile tüyleri izale edildikten sonra derisi ile közde pişirilen ya da tencerede haşlanarak pişirilen ete denilir. Bu şekildeki pişirme, körpe ve yaşı küçük olanlar için söz konusudur. Böyle bir iş iki bakımdan mutı'ef (varlıklı ve rahat) yaşayan kimselerin işlerindendir. Birincisi eğer hayatta kalacak olsaydı, değeri artacak olan bir hayvanı erken dönemde kesmektir. İkincisi ise derisi soyulan bir hayvanın postundan giyecek olarak ya da başka bir şekilde yararlanılır. Ancak bu şekilde pişirmek deriyi kullanılmaz hale getirir. İbn Battal el-Masmut'un közde kızartılarak pişirilmiş olduğu kanaatini kabul etmiştir. \"Sukurruce'de\" İbn Mekkl der ki: Sukurruce, içinde yemek yenen küçük kaplara denilir. Hocamız da \"TirmiziŞerhi\" adlı eserinde şunları söylemiştir: Nebi efendimizin sukurruce (denilen küçük tabaklarda) yemek yememesi ya o dönemde onların beldesinde bunların yapılmayışından dolayıdır yahut bu kapları küçük bulduğundan ötürüdür. Çünkü yemek etrafında bir araya gelip toplanmak onların adeti idi. \"Hişam, babasından ve Vehb b. Keysan'dan.\" Buradaki İbnu'z-Zubeyr, Abdullah b. ez-Zubeyr'dir. Şam ehlinden maksat ise Haccac b. Yusufun askerleridir. Onlar Abdulmelik b. Mervan tarafından görevlendirilmişlerdi ve onunla savaşıyorlardı. Yahut daha önce Yezid b. Muaviye'nin emri üzere onunla savaşmış bulunan el-Husayn b. Numeyr'in askerleri de olabilirler. \"Ben kuşağımı ortadan ikiye böldüm ve bir parçası ile kırbasının ağzını bağladım.\" Medine'ye hicret bahsinde Ebu Bekr es-Sıddık'ın Nebi Sallallahu Aleyhi ve Sellem ile birlikte Medine'ye hicret ettiğinde bunu böyle yapmasını em rettiği geçmiş bulunmaktadır. \"Bu ayıbı, senden uzak bir çirkinliktir.\" Buradaki \"şekat (çirkinlik)\" çirkin bir sözü yüksek sesle söylemek demektir. Zahir lafzı ise uzak anlamındadır. el-Hattabı dedi ki: Yani bu, senden kaldırılmış bir çirkinliktir. Dolayısıyla bunun seninle ilgisi yoktur",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 17
			}
		}
	]
}