{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5399,
			"arabicnumber": 5399,
			"text": "Ebu Cuhayfe r.a.'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'in yanında bulunuyordum. Huzurunda bulunan bir adama: Ben bir yanıma yaslanmış olduğum halde yemek yemem, dedL\" Fethu'l-Bari Açıklaması: \"Bir yanı üzere yaslanarak yemek yemek.\" Yani bu şekilde yemek yemenin hükmü nedir? Buhari bu hükmü kat'i bir dille ifade etmemiştir. Çünkü bu hususta açık bir nehy gelmemiştir. \"Şüphesiz ki ben bir yanıma yaslanarak yemek yemem.\" İbnu'l-Cevzı \"yaslanma\"yı açıklarken, kesin olarak yanlarından bir tarafa doğru meyletmek olduğunu açık bir dille ifade etmiştir. İbnu'l-Esir de en-Nihaye adlı eserinde yaslanmayı, yanlarından bir tarafına meyletmek diye açıklayanların bu durumda yemeğin mecralarından kolaylıkla geçemeyeceğini, onu hazmedemeyeceğini hatta ondan rahatsız dahi olabileceğini söyleyerek açıklayan tıbbi görüşlere göre yorumladığını nakletmiş bulunmaktadır. Selef, yaslanarak yemek yemenin hükmü hakkında farklı görüşlere sahiptir. İbn el-Kass'ın iddiasına göre bu (bu şekilde yemek yememek) nebevi hususiyetlerdendir. Ancak el-Beyhakı buna şöyle karşılık vermektedir: Böyle yemek yemek başkası için de mekruh olabilir. Çünkü bu kendisini büyük gösterenlerin yaptığı işlerdendir. Bu da esasen Acem krallarından alınmış bir davranış tarzıdır. Eğer kişinin bir engeli bulunup da ancak yaslanarak yemek yiyebiliyorsa bunda bir kerahet yoktur. İbn Ebi Şeybe, İbn Abbas, Halid b. el-Velid, Abıde es-ı Muhammed b. Slrln, Ata b. Yesar ve ez-Zühri'den bu şekilde yemek yemenin mutlak olarak caiz olduğuna dair rivayetler nakletmiştir. Eğer bunun mekruh ya da evla olanın aksi olduğu sabit ise, yemek için oturmanın müstehap şekli, diz kapaklan ve ayaklarının yüzü üzerine oturması yahut sağ ayağını dikip, sol ayak üzerine oturmasıdır. Mekruhluğun illeti hususunda da görüş ayrılığı vardır. Bu konuda varid olmuş en güçlü rivayet, İbn Ebi Şeybe'nin, İbrahim en-Nehaı yoluyla naklettiği şu sözüdür: \"Selef, göbekleri büyür korkusu ile yaslanarak yemek yemekten hoşlanmazlardJ",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 27
			}
		}
	]
}