{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5432,
			"arabicnumber": 5432,
			"text": "Ebu Hureyre r.a.'den, dedi ki: \"Mayalı ekmek bulamadığım, ipek giyinmediğim, filan erkeğin ve filan cariyenin bana hizmet etmediği zamanlarda karın tokluğu için Nebi Sallallahu Aleyhi ve Sellem'in yanından ayrılmazdım. (Açlıktan) karnımı yere yapl!itırırdım, beni evine alıp götürür ve bana yemek yedirir ümidi ile bildiğim bir ayeti bir başka adamdan bana okumasını (öğretmesini) isterdim. Yoksullara kar!il da insanların en hayııolısı Cafer b. Ebi Talib idi. O bizi alır, götürür ve evinde ne varsa bize yedirirdi. Hatta bize içinde hiçbir şey bulunmayan küçük bir kırbayı çıkartır, biz de onu yarar ve içindeki artıkları yalardık.\" Fethu'l-Bari Açıklaması: \"Helvayı ve balı severdi.\" İbn Battal dedi ki: Helva ve bal yüce Allah 'ın: \"Tayyibattan yiyiniz\" buyruğunda sözü edilen tayyibat (hoş ve güzel !ieyler) arasındadır. Hadis, (tayyibat ile) kendisinden zevk alınan !ieyleri kastetmektedir, diyenıerin görü!ilerini de pekiştirmektedir. Bu hadisin kapsamına daha önceden Et'ıme (yiyecekIer) bölümünün ba!i taraflarında açıkiandığı gibi, çe!iitli lezzetli yiyecek türleri arasında helvaya ve balabenzeyen diğer bütün yiyecekIer de girmektedir. el-Hattabı ve daha sonra arkasından İbnu't-TIn de şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in bunları sevmesi, bunları çokça arzulaması ve nefsinin bunlara ileri derecede meyletmesi sureti ile değildi. O sadece bunlar huzuruna getirildiğinde onlardan uygun olan miktarı alırdı. BöylelikIe onun bunları beğendiği de anla!iılml!i olmaktadır. Yine bu hadisten çeşitli türlerden yemek yemenin caiz olduğu anlaşılmaktadır; ama bazı vera' ehli kimseler bunu hO!i görmez ve hurma ve bal gibi tabiatı itibariyle tatlı olan şeyler dışında tatlı şeyleri yemeye ruhsat vermezdi. Ama bu hadis onların bu kanaatini reddetmektedir. Selef arasında bunlardan vera' yoluyla kaçınanlar, sadece tayyibatı elde etmeyi ahirete erteleyen kimseler olmu!itur. Bununla birlikte bu tayyibatı dünya hayatında da elde edebiliyorlardı, ama cimrilikIerinden dolayı değil de tevazuları sebebiyle bunları yemiyarlardı. \"İnsanlar arasında yoksullara en hayırlı olan ki!ii Cafer ... idi.\" Buna dair açıkIamalar Menakıb bölümünde (3708.hadiste) geçmiş bulunmaktadır. İbnu'l-Müneyyir dedi ki: Ebu Hureyre'nin rivayet ettiği bu hadisin ba!ilığa uygunluğu !iöyle açıkianır: Helva, tatlı olan her şey hakkında kullanılır. Küçük tulumda çoğunlukIa bal bulunduğu için -ki bazı rivayet yollarında bundan açıkça söz edilmiştir- böyle bir ba!ilık da uygundur",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 60
			}
		}
	]
}