{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5443,
			"arabicnumber": 5443,
			"text": "Câbir ibn Abdillah (radıyallahü anh) şöyle demiştir: Medîne'de bir Yahûdî vardı. O Yahûdî bana her sene ağaçlardaki hurmaları kesip toplama zamanına kadar va'de ile borç para verirdi. Câbir'in Rûme Kuyusu yolunda hurmalı arazîsi vardı. Bir sene Câbir'in hurmalığı alışılan derecede mahsûl vermedi. Borcun ödenmesi gecikti. Bunun üzerine Yahûdî hurma kesme vaktinde geldi. Borcumdan birşey veremiyeceğimi düşünerek, gelecek hurma kesimi zamanına kadar mühlet vermesini istedim. Yahûdî kabul etmedi. Bunun üzerine benim bu müşkil durumum Peygamber'e haber verildi. O da bâzı sahâbîlerine: \"Haydi yürüyünüz, gidelim de Câbir için Yahudi'den borcun geri bırakılmasını isteyelim!\" buyurdu. Peygamber'le sahâbîleri benim hurmalığıma geldiler. Peygamber, Yahudi'ye borcu geri bırakmasını söylemeye başladı. Yahûdî: Yâ Eba'l-Kaasım! Ben Câbir'e mühlet veremem! diyordu. Yahûdî'nin ısrarını görünce kalktı ve hurmalıkta şöyle bir dolaştı. Sonra geldi. Yahûdî'ye bir daha va'de vermesini söyledi. O yine kabul etmedi. Ben de kalktım.Peygamber'e biraz yaş hurma getirdim ve bunu Peygamber'in önüne koydum. Peygamber hurmayı yedi. Sonra: \"Yâ Câbir, senin bustân çardağın nerede?\" diye buyurdu. Ben de şurada diye haber verdim. \"Haydi orada bana bir yer döşe!\" buyurdu. de hemen döşedim. Peygamber çardağa girip biraz uyudu. Sonra uyandı. Ben gidip bir avuç daha hurma getirdim. Ondan da yedi. Sonra kalktı ve Yahûdî'ye bir daha borcu geri bırakmasını konuştu. Yahûdî yine kabul etmedi. Sonra Peygamber kalktı ve hurmalığın içinde ikinci bir defa daha dolaştı. Sonra: \"Yâ Câbir, ağaçlardaki hurmaları topla ve Yahudi'ye olan borcunu öde!\" buyurdu. toplayıncaya kadar) hurma harmanının başında durdu. İşte bu topladığım hurmalardan Yahûdî'ye olan borcumu verdim. Borcu verdiğim kadar da arta kaldı. Sonra bustândan çıkıp Peygamber'in huzuruna geldim ve bu bereketli vaziyeti O'na muştuladım. Bunun üzerine: \"Ben Allah 'ın elçisi olduğuma şehâdet ederim\" buyurdu. \"Urûşun\" ve \"Arîşun\", \"Bina\" ma'nâsınadır. İbn Abbâs: \"Cennâtin marûşâtin\"(el-En'âm: 141), üzümlerden ve diğerlerinden çardak yapılan bahçeler demektir. \"Urûşuhâ\" (el-Bakara: 259) denilir ki, bu da \"Binaları\" ma'nâsınadır, demişti",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 72
			}
		}
	]
}