{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5446,
			"arabicnumber": 5446,
			"text": "Cebele b. Suhaym'den, dedi ki: \"İbn ez-Zübeyr ile birlikte iken bize bir kıtlık senesi gelip çattı. o bize geçinmek üzere hurma verdi. Abdullah b. Ömer biz yerken yanımızdan geçiyor ve: Hurmaları ikişer ikişer yemeyiniz. Çünkü Nebi Sallallahu Aleyhi ve Sellem ikişer ikişer yemeği nehyetmişti, diyordu. Sonra da: Kişinin kardeşinden (bu maksatla) izin alması hali müstesnadır, diyordu.\" Şu'be dedi ki: İzin İbn Ömer'in kendi sözlerindendir. Fethu'l-Bari Açıklaması: \"Hurmaları ikişer ikişer yemek\" Yani topluluk ile birlikte yiyen kimseler için bir hurmayı diğer hurma ile birlikte yeme(nin hükmü) demektir. Abdullah \"İbn ez-Zubeyr\"in halifeliği dönemınde onunla \"birlikte iken bize• bir kıtlık senesi isabet etti. Bize geçimimiz için hurma veriyordu.\" Yani maaşlanmızı öderken arada hurma da veriyordu. Buradaki maaş (erzak)dan kasıt, her yılonlara haraç ve daha başka gelirlerden yapılan ödemedir. Nakit karşılığında hurma ödenmesi de, hasıl olan kıtlık sebebiyle o sıradaki nakdin azlığından ötürüidi. Bu meselenin (hurmaları birlikte yemenin) hükmü hususunda görüş ayrılığı vardır. Nevevı şöyle demektedir: Buradaki nehyin haramlık için mi olduğu yoksa mekruhluk mu ifade ettiğihususunda ilim adamları ihtilaf etmişlerdir. Doğrusu ise, hükmün duruma göre farklı olacağıdır. Eğer yiyecek aralarında ortak ise hurmaları ikişer ikişer yemek, onların rızası ileolmadıkça haramdır. Böyle bir izin ise onların ya açıkça ifadeleri ile yahut halin bunun yerine geçen karinesi ile anlaşılır. Böylece buna izin verdikleri kanaati ağır basmalıdır. Eğer yemek başkalarına ait ise bu şekilde yemek haram olur. Eğer onlardan birisine ait olup ondan yemelerine izin vermiş ise yemek sahibinin rızası şarttır. Rıza göstermediği kimselerin yemesi haramdır. Kişinin kendisi için caiz olmakla birlikte kendisiyle beraber yemek yiyenlerden izin alması müstehaptır. Misafir ağırlayan kimsenin ise misafiri ile eşit olması için çifter çifter yememesi güzeldir. Ancak onların, yedikten sonra artıracakları kadar ise müstesna. Bununla birlikte yemek hususunda edeb, mutlak olarak açgözlülüğe delil olan şeyleri terk etmektir. Ama bir başka işe yetişmek için acele etmesi ve bundan dolayı çabuk yemeğe çalışması müstesnadır. el-Hattabı'nin naklettiğine göre böyle bir izin istemenin şart oluşu, onların zamanlarında idi. Çünkü onların elinde bulunan şeyler çok azdı. Günümüzde bolluk söz konusu olduğundan ötürü izin istemeye gerek yoktur. Ancak Nevevi doğru olanın, duruma göre farklı hükmün olduğunu göz önünde bulundurmaktır, diye cevap vermiştir. Çünkü muteber olan, sebebin özelliği değil, lafzın umumi oluşudur. Hem sabit olmamış böyle bir şey nasıl sebep olarak kabul edilebilir ki? İbn Şahin, en-Nasih ve'l-Mensuh adlı eserinde aynı zamanda el-Bezzar'ın Müsned'inde de bulunan İbn Bureyde'nin babası yoluyla merfu olarak zikrettiği şu hadisi kaydetmiştir: \"Ben size daha önceden hurmaları ikişer ikişer yemenizi yasaklamış idim. Şüphesiz Allah artık size bolluk ihsan etmiştir. İkişer ikişer yiyebilirsiniz.\" Muhtemelen Nevev! bu hadise işaret etmiştir. Bu hadisin senedinde bir zayıflık vardır. el-Hazimı şöyle demektedir: Nehy bildiren hadis daha sahih ve daha meşhurdur. Ancak bu hususta mesele basit ve kolaydır. Çünkü bu, ibadetler türünden değildir. Ancak dünyevi masıahatlar kabilinden olduğundan bu hususta yetinilebilir. Diğer taraftan bunun caiz oluşuna ümmetin icma' etmiş olması da bu görüşü desteklemektedir. Evet, el-Hazimi böyle demiştir. Caiz oluşundan kastı ise -Nevevı'nin açıkladığı gibi- şahsın o yenilen şeye -yemek için ona izin verilmiş olması yolu ile dahi olsa- malik olma hali hakkındadır. Yoksa alimlerden hiçbir kimse başkasına ait olan bir malı, sahibinin izni olmaksızın sırf kendisine tahsis etmesini caiz görmüş değildir",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 75
			}
		}
	]
}