{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5449,
			"arabicnumber": 5449,
			"text": "Abdullah b. Cafer r.a.'dan, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem'i olgun taze hurma ile birlikte acur yerken gördüm.\" Fethu'l-Bari Açıklaması: \"Olgun taze hurma ile birlikte acur yerken.\" Nesal sahih bir sened ile Humeyd'den, o Enes'ten şöyle dediğini rivayet etmektedir: \"Resulullah sallallahli a1eyhi vesellem'i olgun taze hurma ile birlikte kavun yerken gördüm.\" Yine Nesai'de sahih bir sened ile Aişe: \"Nebi Sallallahu Aleyhi ve Sellem'in kavunu taze hurma ile birlikte yediği\"ni rivayet etmektedir. İbn Mace de Aişe'den şu rivayeti zikretmektedir: \"Annem, beni Nebi Sallallahu Aleyhi ve Sellem'in hanımı olarak onunla zifafa göndermek üzere kilo alayım diye tedavi etmek istedi. Ben olgun taze hurma ile birlikte acuru yiyinceye kadar bunu bir türlü gerçekleştiremedi. Bunları beraber yiyince en güzel şekilde kilo aldım.\" Nesa! de Aişe'den şu rivayeti zikretmektedir: \"Nebi Sallallahu Aleyhi ve Sellem benimle evlendiğinde çeşitli şeylerle beni tedavi etmek istediler. Bunun için hurma ile birlikte bana acur yedirdiler. Bunları yiyerek en güzel şekilde kilo aldım.\" Nevevi der ki: Bu başlıktaki hadisten anlaşıldığına göre iki tür meyveyi ya da başka bir şeyi birlikte yemek caiz olduğu gibi, iki ayrı yemeği de birlikte yemek caizdir. Buradan da yenecek şeylerde genişliğin caiz olduğu da anlaşılmaktadır. Bunun caiz olduğu konusunda da ilim adamları arasında görüş ayrılığı yoktur. Seleften bundan farklı olarak nakledilmiş olan rivayetler dini bir masıahat gözetmeksizin bolluk, refah ve genişlik içinde yaşamayı itiyat ve alışkanlık haline getirmeyi önlemek amacı ile mekruh oluşayorumlamak gerekir. Kurtubi dedi ki: Bu hadisten, yemeklerin niteliklerini ve tabiatıarını göz önünde bulundurmanın ve tıp kurallarına uygun olarak doğru bir şekilde onları yemenin caiz olduğu da anlaşılmaktadır. Çünkü olgun, taze hurmanın tabiatında hararet, acurun tabiatında ise serinlik vardır. Birlikte yenildikleri takdirde birbirlerini dengelerler. İşte bu, ilaçlardaki terkiplerde göz önünde bulundurulan pek büyük bir esastır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 78
			}
		}
	]
}