{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5450,
			"arabicnumber": 5450,
			"text": "Enes r.a.'den rivayete göre \"Annesi Ümmü Suleym bir mud arpa alarak onu kalınca öğüttü. Onun bir kısmını süt bulamacı yaptı. Yanındaki bir yağ tulumundan bir miktar da yağ sıktı. Sonra beni Nebi Sallallahu Aleyhi ve Sellem'e gönderdi. Onun yanına -ashabı ile birlikte iken- varıp onu davet ettim. Allah Rasulü: Beraberimdekiler de mi diye sordu. Ben de anneme gelip: Beraberimdekiler de mi, diyor dedim. Ebu Talha onu karşılamaya çıktı ve: Ey Allah'ın Rasulü, bu Ümmü Suleym'in yaptığı az bir yemektir, dedi. Allah Rasulü içeri girdi, Ümmü Suleym'in yaptığı yemek getirildi. Allah Rasulü: Yanıma on kişi al, diye buyurdu. O on kişi içeri alındı ve doyuncaya kadar yediler. Daha sonra: Yanıma on kişi al, diye buyurdu, onlar da içeri girip doyuncaya kadar yediler. Tekrar: Yanıma on kişi al, diye buyurdu ve nihayet toplam saydıkları kırk kişiyi buldu. Daha sonra Nebi Sallallahu Aleyhi ve Sellem yedi ve sonra kalktı.\" (Enes dedi ki): \"Ben acaba ondan birşey eksildi mi, diye bakmaya koyuldum.\" Fethu'l-Bari Açıklaması: \"Misafideri içeriye onar kişi onar kişi almak ve yemeğe onarkişi onar kişi oturmak.\" Yemeğin azlı ğı yahutyemeğe oturulacak yerin darlığı dolayısıyla böyle bir şeye ihtiyaç duyulursa demektir. \"Unukalınca öğütlli.\" Kökünü teşkil eden \"el-ceşış\", ince olmayan un demektir. Daha önce ''Nübüvvetin alametleri\" bahsinde Müslim'deki rivayetlerin birisinde bu başlıktaki şekliyle hadisin siyakında bir ihtisar bulunduğunu söylemiş idim. Mesela Yakup b. Abdullah b. Ebi Talha'nın, Enes'ten diye yaptığı rivayette şöyle denilmektedir: Ebu Talha dedi ki: \"Ey Allah'ın Rasulü! Ben Enes'i yalnızca seni davet etsin, diye göndermiştim. Çünkü yanımızda gördüğüm kadar kişiyi doyuracak bir şey yoktu.\" Amr b. Abdullah'ın, Enes'ten diye naklettiği rivayette de şöyle denilmektedir: \"Ebu Talha dedi ki: Bu sadece bir kap yemektir. Allah Rasulü: Şüphesiz Allah ona bereket ihsan edecektir, diye buyurdu.\" İbn Battal dedi ki: Yemek için topluca bir araya gelmek, bereketin sebeplerindendir. Ebu Davud, Vahşi b. Harb yoluyla merfu olarak Nebi'e isnad ettiği hadiste şunu zikretmektedir: \"Yemeğiniz üzerinde toplanıp bir araya gelin ve Allah'ın adını anın. Ona sizin için bereket ihsan olunacaktır.\" (İbn Battal) dedi ki: Nebi Sallallahu Aleyhi ve Sellem'in onları onar kişi, onar kişi olarak içeri alması -doğrusunu en iyi bilen Allah'tır ya- yemeğin tek bir kap içinde oluşu ve büyük bir topluluğun yemeği n azlığı ile birlikte ondan alıp yemeğe imkanlarının olmayacağı dolayısı ile idi. Bundan dolayı sıkışmadan yemek imkanını bulmaları için onları onar onar böldü. Ayrıca şunları söylemektedir: Hadiste yemeğin etrafında on kişiden daha fazla toplanmanın yasaklanışına bir delil bulunmamaktadır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 79
			}
		}
	]
}