{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"70": "Food, Meals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5453,
			"arabicnumber": 5453,
			"text": "Cabir b. Abdullah'tan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem ile birlikte Merru'z-Zahran'da idik. Biz kebas topluyorduk. O bize: Onun kararmış olan meyvesini toplamaya bakınız. Çünkü o ey tab (daha hoş ve lezzetli) dir, diye buyurdu. Sen koyun otlatıyor muydun, diye sorulunca, o: Evet, koyun otlatmamış bir nebi var mıdır ki, diye sordu.\" Fethu'l-Bari Açıklaması: \"Erak yaprağı olan.\" Doğrusu ise erakin meyvesi olduğudur. İbn Battal dedi ki: el-Kebas, erakin taze olan, meyvesidir. el-Berir ise, onun taze ve kuru olan meyvesine denilir. İbnu't-Tin dedi ki: Buharl'nin \"erak ağacının yaprağı olan\" demesi doğru değildir. Sözlükte doğru olan onunerak ağacının meyvesi olduğudur. Onun olgun olanına böyle denildiği de söylenmiştir. \"Merru'z-Zehran\" Mekke'den bir merhale uzaklıkta bulunan bir yerin adıdır. \"O eytab\"dır. Bu atyab (daha hoş ve lezzetli) anlamında bir söyleyiş olup, onun kalb edilmiş (kelimenin söyleyişinde tı ile ya harfinin yeri değiştirilmiş) şeklidir. Nitekim Araplar cezebe ve cebeze'yi böyle kullanmışlardır. \"Koyun otlatır mıydın, diye soruldu.\" Bu soru tarzında ihtisar vardır. İfadenin takdiri şudur: Sen koyun otlatıyor muydun ki kebasın hangisinin daha lezzetli olduğunu biliyorsun? Çünkü çokça koyun otlatan bir kimse, hem koyunlarını otlatmak, hem de altlarında gölgelenmek üzere ağaçların altına çokça gider. Buna dair açıklamalar da Enbiyaya dair hadislerin söz konusu edildiği bölümde, Musa'nın kıssası nakledilirken geçmiş bulunmaktadır. Ayrıca İcare bölümünün baş taraflarında enbiyanın koyun otlatmalarının hikmetine dair açıklamalar da geçmiş bulunmaktadır. İbnu't-Tin, ed-Davudi'den şu bilgiyi nakletmektedir: Koyunların bu özelliğindeki hikmet, sırtlarına binilmediğinden, onların sırtına binilerek kişinin nefsinin büyüklenmeyişidir. Yine İbnu't-Tin der ki: Bu hadiste mülk olmayan ağacın meyvesinin yenilmesinin mubah olduğu anlaşılmaktadır. İbn Battal dedi ki: Bu besleyici gıdaların bulunmadığı, İslam'ın ilk dönemlerinde böyle idi. Şanı yüce Allah artık kullarına buğday ve pek çok tahıllar ile zenginleştirip, onlara geniş rızık verdikten sonra erak ağacının meyvesine ihtiyaçları kalmamıştır. Derim ki: Eğer bu sözleriyle bu gibi mahsulleri almanın mekruh oluşuna işaret etmeyi düşünmüşse bu kabul edilemez. Çünkü sözünü ettiği durumun varlığı, bedelini ödemeden mubah olan şeylerin yasaklanmasını gerektirmez. Aksine vera' ehli pek çok kişi, para ile satın alınanları yemekten çok, bu tür mubah olan şeylere daha çok rağbet ederler. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 70,
				"hadith": 82
			}
		}
	]
}