{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5498,
			"arabicnumber": 5498,
			"text": "Abaye b. Rifaa b. Rafi'den, o dedesi Rafi' b. Hadic'den, dedi ki: \"Zülhuleyfe'de Nebi Sallallahu Aleyhi ve Sellem ile birlikte idik. İnsanlar açlık musibeti ile karşı karşıya kaldılar. Biz de bir miktar deve ve koyun ele geçirdik. -Nebi Sallallahu Aleyhi ve Sellem de orduların arka taraflarında idi.- Ellerini çabuk tutarak tencereleri ocakların üzerine koydular. Nebi Sallallahu Aleyhi ve Sellem onların yanına gelip emir vererek tencereler baş aşağı edildi. Daha sonra ganimetIeri paylaştırdı. On koyunu bir deveye denk kabul etti. Develerden birisi kaçtı. Gazada bulunanlar arasındaki at sayısı pek azdı. Devenin arkasından koştular, koşanları oldukça yordu. Bir adam ona bir ok atıverdi. Allah da o devenin ilerlemesini engelledi. Nebi Sallallahu Aleyhi ve Sellem bunun üzerine şöyle buyurdu: Şüphesiz bu evcil hayvanların da vahşi hayvanların kaçışları gibi bir kaçışları vardır. Bunlar arasından elinizden kaçıp kurtulan olursa onlara bunun yaptığı gibi yapınız. Abaye dedi ki: Dedem dedi ki: Şüphesiz biz yarın düşman ile karşılaşacağımızı ümit ediyoruz -ya da onlarla karşılaşmaktan endişeleniyoruz.- Beraberimizde bıçaklar da bulunmamaktadır. Bu durumda kamışlarla hayvan kesebilir miyiz? Allah Rasulü şöyle buyurdu: Kanı akıtan (aletlerle kesilen) ve üzerine Allah 'ın adı anılmış bulunanları yiyiniz. Ama diş ve tırnak ile (kesilen) değiL. Size buna dair haberi vereyim: Diş bir kemiktir, tırnak ise Habeşlilerin bıçağıdır.\" Fethu'l-Bari Açıklaması: \"Kesilen hayvan üzerine besmele çekmek ve kasten besmeleyi terk eden kimse(nin hükmü).\" Buhari \"kasten\" sözü ile besmele çekmeyi kasten terk eden kimsenin durumunun farklı olduğunu tercih ettiğine işaret etmektedir. Böyle bir kimsenin kestiği hayvanın yenilmesi helal olmaz. Ancak unutarak terk edeninki helaldir. Çünkü Buhari bunaİbn Abbas'ın sözünü delil göstererek daha kuvvetli gördüğüne işaret etmiştir. Ayrıca daha sonra zikretmiş olduğu yüce Allah'ın: \"Üzerlerine Allah'ın ismi anılmayanlardan yemeyin.\"(En'am, 121) buyruğunu da zikrettikten sonra: \"Unutan kimseye ise fasık adı verilmez'I demiştir. Bununla da ayet-i kerimedeki yüce Allah'ın: \"Çünkü o bir fısktır\" buyruğuna işaret etmektedir. İşte bu lafızdan bu niteliğin, bu işi kasten yapan hakkında kuııanılacağı sonucunu çıkarmıştır .. Dolayısıyla hüküm de kasten besmeleyi terk eden hakkında özeııikle söz konusu olur. Kesim hususunda unutan ile kasten terk eden kimse arasında ayrım gözeterek hükümlerinin farklı olduklannı söylemek, İmam Ahmed'in ve bir grup fukahanın görüşüdür. \"Bunun üzerine Allah Rasulü tencerelerin dökülmelerini emir verdi ve içindekiler döküldü.\" Bu yerde iki şey hakkında ihtilM edilmiştir: Birincisi dökmenin sebebidir. İkincisi ise acaba et itiM edildi mi, edilmedi mi hususudur. Birincisi ile ilgili olarak Iyad şöyle demektedir: Askerler, İslam diyarına ve ortak olan ganimet malından ancak paylaştırmadan sonra yemenin caiz olacağı bir yere gelmişlerdi. Paylaştırmadan önce ganimet mallarından yemek ise ancak dar-ı harb'de kaldıkları sürece caizdir. Iyad devamla der ki: Bunun sebebinin, bu etleri bir çeşit talan edercesine almış olmaları ve ihtiyaç kadarı ile mutedil bir şekilde kuııanmamış olmaları ihtimali de vardır. Ayrıca bir başka hadiste buna delil teşkil edecek ifadeler bulunmaktadır. İyad bu sözüyle Ebu Davud'un, Asım b. Kuleyb yoluyla babasından -ki sahabiliği de vardır-, onun da ensardan bir adamdan şöyle dediğine dair naklettiği rivayetine işaret etmektedir: \"İnsanlar çok ileri derecede açlıkla ve kıtlıkla karşı karşıya kaldılar. Derken bir miktar koyun ganimet aldılar, onları adeta talan ettiler. Tencerelerimiz onların etleri içinde olduğu halde kaynıyorken Rasulullah Sallallahu Aleyhi ve Sellem atı üzerinde geldi ve yayı ile tencerelerimizi döktü, sonra da etleri toprağa karıştırmaya koyuldu. Daha sonra: Talan hiçbir şekilde meyteden daha helal değildir, diye buyurdu.\" İşte bu, onlara acelecilik etmeleri dolayısıyla maksatlarının tam zıttı ile kendilerine muamele ettiğini -nitekim miras bırakanı öldüren mirasçı katilin mirastan mahrum edilmesi muamelesine maruz kalışı gibi- göstermektedir. \"Deve hızlıca kaçtı.\" Söz konusu deve paylaştırılmış develerden idi. ''Vahşi hayvanlar gibi kaçarlar.\" Onların da vahşileştiklerini, yabanileştiklerini kastetmektedir. \"Kanı akıtan\", çokça akıp dökülmesini sağlayan ... \"Diş ve tırnak hariç\", yani diş ve tırnak ile kesmek mubah değildir yahut kesimde yeterli değildir. \"Çünkü diş bir kemiktir.\" Beydav! dedi ki: Bu, ikinci önerme söz konusu edilmeden yapılan bir kıyastır. Çünkü bu önerme onlar tarafından iyice bilinen bir şeydir. İfadenin takdiri şöyledir: Diş bir kemiktir. Her bir kemik ile de kesim helal olmaz. NevevI de şöyle demektedir: Hadis: Kemiklerle kesmeyiniz. Çünkü kemikler kan ile necis olurlar. Ben de sizlere onları necasete bulaştırmayı yasaklamış bulunuyorum. Çünkü bu kemikler cinlerden kardeşlerinizin azığıdır, anlamındadır. \"Tırnak ise Habeşlilerin bıçağıdır.\" Yani Habeşliler de kafirdir. Ben de size onlara benzemeyi yasaklamış bulunuyorum. Bu açıklamayı İbnu's-Salah yapmış, sonra Nevev! de ona uymuştur. Bir diğer açıklamaya göre diş ve tırnak ile kesim yapmayı yasaklamasının sebebi, bunlar ile kesim yapılmasının hayvana işkence oluşundan dolayıdır. Bunlar ile çoğunlukla ancak -kesime şekil itibariyle çoğunlukla benzemeyen- boğulmak hadisesi gerçekleşir. Hadisten Çıkan Sonuçlar Az önce kaydedilenler dışında hadisten daha başka birtakım sonuçlar da çıkarılmıştır. 1- Ortak olan mallarda, az da olsa ve onlara ihtiyaç duyulsa dahi izinsiz tasarrufta bulunmak haramdır. 2- Ashab-ı kiram, Nebi Sallallahu Aleyhi ve Sellem'in emrine ileri derecede ihtiyaç duydukları şeyleri terk etmek hususunda dahi kesin itaat ederlerdi. 3- İmamın, yönetimi altında bulunan raiyesini -eğer şer'! masıahat daha ağır basıyor ise- faydalı olan bir şeyi ya da benzerini telef etmek suretiyle cezalandırmak hakkı vardır. 4- Ganimetin paylaştırılması halinde farklı mallar arasında bir miktarını öbürüne denk kabul etmek ve değer biçmek caizdir. Her şeyin başlı başına ayrıca paylaştırılması şartı yoktur. 5- Evcil hayvanlardan olup yabanileşen bir hayvan, yabani hayvan hükmünü alır. Aksi de söz konusudur. 6- Demir olsun yahut olmasın maksadı gerçekleştiren başka şeyler ile de hayvan boğazlamak caizdir. 7- Kaçan bir hayvanın eğer zebhine imkan bulunmayacak olursa karei avı ve evcil olup yabanileşen hayvanlar gibi ayaklarından yaralanması caizdir. Bu durumda bütün çüzleri de kesilmiş olur. Eğer yapılan atış ile isabet eder ve bundan dolayı da ölürse, eti de helal olur. Ama kesilmesine güç yetirilen hayvan ya boğazından kesilmek yahut nahr sureti ile ancak mubah olur ve bu hususta icma' vardır. 8- Meytenin haram kılınış sebebinin, kanının içinde kalışı oluşuna da dikkat çekilmektedir. 9- Diş ve tırnak, hayvanın vücuduna ister bitişik olsun, ister ayrı olsun, ister tahir, isterse necis olsun, onlarla kesim yapmak yasaklanmıştır. Ancak Haı:ıefiler bedene bitişik bulunan diş ve tırnağı farklı kabul etmiş ve yasağın bu iki hale mahsus olduğunu, vücuttan ayrı bulunmaları halinde bunlarla kesim yapmayı caiz kabul etmişlerdir",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 24
			}
		}
	]
}