{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5516,
			"arabicnumber": 5516,
			"text": "Abdullah b. Yezid'den, o Nebi Sallallahu Aleyhi ve Sellem'den rivayete göre Nebi Sallallahu Aleyhi ve Sellem nühbeyi (açıktan ve zorla birisinin malını almayı) ve musleyi nehyetmiştir. Fethu'l-Bari Açıklamaksı: \"Müsle\", hayvanın canlı iken organlarını ya da bir kısmıni kesmek demektir. \"Masbura ve mücesseme\" ise atış yapmak için bağlanıp hedef edinilen hayvandır. Eğer bu sebeple ölürse onu yemek helal olmaz. Kuşlar ve benzerleri hakkında kullanılan \"el-cusum\", develel'in çökerek oturmalarına benzer. \"Bir hayvanın yahut başkasının öldürülmek için hapsedilip bağlanmas!.\" Buna benzer bir rivayet de Ebu Eyyub'un naklettiği bir hadistir. Şöyle demiştir: \"Nefsim elinde olana yemin ederim ki, bir tavuk dahi olsa ben onu canlı olarak hapsetmem. Rasulullah Sallallahu Aleyhi ve Sellem'i canlı olarak öldürmeyi nehyederken işitmişimdir.\" Hadisi Ebu Davud kavi bir sened ile rivayet etmiştir. Bütün bunları genel olarak Müslim'de yer alan Şeddad b. Evs'in merfu olarak (Nebi Sallallahu Aleyhi ve Sellem'e nispet ederek) zikrettiği hadis, bir arada ifade etmektedir: \"Öldürdüğünüz vakit güzelce öldürünüz, zebh ettiğiniz (kestiğiniz) vakit de güzelce kesiniz. Sizden herhangi biriniz (kesim yapacağında) bıçağını iyice bilesin de kestiği hayvanı rahatlatsın.\" Hadisten Çıkan Sonuçlar 1- İbn Ebi Cemra dedi ki: Bu hadiste yüce Allah'ın öldürülme halinde bile kullarına ne kadar merhametli olduğu dile getirilmektedir. O, öldürülmeyi (gerektiğinde) emrettiği gibi, nfk ile öldürmeyide emir buyurmuştur. 2- Bu hadisten Allah'ın bütün kullarını hükmüne tabi tuttuğu da anlaşılmaktadır. Çünkü o, hiçbir kimseye keyfiyet sınırlarını belirlemeksizin istediği gibi tasarruf ta bulunma imkanını vermemiştir. 3- Bu hadislerde insanın hayvana ve başkalarına işkence yapması haram kılınmaktadır. 4- Birinci hadisten Enes'in -sözü geçen emırin oldukça sert olduğunu bilmekle birlikte- iyiliği emredip münkerden alıkoymak hususunda, büyük bir güce ve metanete sahip olduğu anlaşılmaktadır. Ama halife Abdulmelik b. Mervan, Haccac'ın Enes'e karşı sert ve kaba davranışından sonra ona ilişmesini yasaklamıştı. Çünkü Enes, Haccac'ı, Abdulmelik'e şikayet etmiş, Abdulmelik de Haccacıa ağır sözler söyleyerek ona gereken ikramda bulunmasını emretmişti. -------- Hadiste sözü geçen el-Hakem b. Eyyub, Basra'da vali naibi olup şerhte sözü geçen sert emir, zalim Haccac b. Yusufun amcasının oğludur",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 42
			}
		}
	]
}