{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5518,
			"arabicnumber": 5518,
			"text": "Zehdem'den, dedi ki: \"Ebu Musa el-Eş'ari'nin huzurunda idik. Bizimle Cerm oğullarından olan bu kabile arasinda bir kardeşlik akdi vardı. Arasında tavuk eti bulunan bir yemek getirildi. Huzurda bulunanlar arasında da kızıl suratlı bir adam oturuyordu. Onun yemeğine yaklaşmadı. Ebu Musa ona: Yaklaş. Çünkü ben Rasulullah Sallallahu Aleyhi ve Sellem'i bundan (tavuk etinden) yerken görmüşümdür, dedi. Adam: Ben bu tavuğu bir şeyler yerken gördüm ve ondan tiksindim. Bu sebeple de onu yememeye yemin ettim, dedi. Ebu Musa: Yaklaş, dedi. Ben Rasulullah Sallallahu Aleyhi ve Sellem'in huzuruna Eş'arilerden bir topluluk ile birlikte gittim, kızgın olduğu bir zaman'a denk geldim. O sırada da zekat develerinden birtakım develeri paylaştırıyordu. Biz onldan bizi ve yükümüzü taşıyacak binek vermesini istedik. O da bizi taşımak için binek vermeyeceği ne dair yemin ederek: Sizi ve yükünüzü taşıyacak bineğim yok diye buyurdu. Daha sonra Rasulullah Sallallahu Aleyhi ve Sellem'e ganimet alınmış develer getirildi. Eş'ariler nerede, Eş'ariler nerede, diye sordu. (Ebu Musa devamla) dedi ki: Daha sonra bize beyaz tüylü, yüksek hörgüçlü beş deve verdi. Biz fazla uzun olmayan bir süre geçirdikten sonra arkadaşlarıma: Rasulullah Sallallahu Aleyhi ve Sellem yaptığı yemini unuttu. Allah'a yemin olsun ki eğer biz Rasulullahlın yeminini unuttuğu bu gafil anından yararlanacak olursak ebediyen iflah olmayız, dedim ve bunun üzerine Nebi Sallallahu Aleyhi ve Sellem'e geri döndük. Ona: Ey Allah'ın Rasulü, şüphesiz biz senden bizi ve yükümüzü taşıyacak binek vermeni istemiştik. Sen de bize taşımak için binek vermeyeceğine dair yemin etmiştin. Zannederiz sen yaptığın yemiıii unuttun. Bunun üzerine şöyle buyurdu: Şüphesiz sizi taşıyacak bineği ihsan eden Allah'tır. Şüphesiz ben Allah'a yemin ederim -inşallah- herhangi bir hususa dair yemin eder de ondan başkasının ondan hayırlı olduğunu görürsem mutlaka hayırlı olanı yaparım ve yeminimin keffaretinde bulunarak yeminimi çözerim, diye buyurduğunu sana haber vereyim yahut tahdis edeyim, dedi.\" Fethu'l-Bari Açıklaması: \"Ben Rasulullah Sallallahu Aleyhi ve Sellem'in huzuruna vardım ... \" Bu hadise dair açıklamalar Yeminler ve Nezirler bölümünde gelecektir. \"Bize beyaz tüylü, yüksek hörgüçlü beş deve verdi\" ibaresinde geçen \"elğurr\" lafzı, \"eğarr\"ın çoğulu olup o da beyaz demektir. \"ez-Züra\" lafzı da \"zirve\"nin çoğuludur. Her şeyin en yüksek yerine \"zirvesi\" denilir. Burada maksat ise develerin hörgüçleridir. Muhtemelen bu develer gerçek anlamıyla beyaz tüylü idi. Bu sözleri ile onları hastalıksız, yarasız beresiz olmakla nitelendirmek istemiş de olabilir. Hadisten Çıkan Sonuçlar 1- Kişi, arkadaşının huzuruna yemek yediği esnada girebilir, yemek sahibi olan kimse de gelen kişiyi yemeğe davet edip az dahi olsa ona yemekten yemesini söyler. Çünkü topluluğun yemek üzerinde bir araya gelmesi daha önce geçtiği gibi yemeği n bereketlenmesine bir sebeptir. 2- Evcil olanı ile yabani olanı ile tavuk yemek caizdir. Ancak bazı fakihler pislik yiyen tavuğu istisna etmiştir. Ebu Musa'nın uygulamasının zahirinden anlaşıldığına göre o buna aldırış etmemiştir. \"el-Cellale\" pislik, teiek ve hayvan tersi yiyen canlılar hakkında kullanılan bir tabirdir: İbn Ebi Şeybe'nin sahih bir senedile rivayet ettiğine göre İbn Ömer pislik yiyen tavuğu Üç gün dışarı salmazdı. Malik ve el-leys de: İster tavuk, ister diğer hayvan türlerinden olsun pislik yiyen hayvanın yenilmesinde bir sakınca yoktur. Bunların yenilmesine dair yasak, tiksinti dolayısıyla vfuid olmuştur, demişlerdir. Pislik yiyen hayvanın yenilmesinin yas aklı ğı çeşitli rivayet yollarıyla varid olmuştur. Bunların en sahihi sahih olduğunu belirterek Tirmizi, Ebu Davud ve Nesai tarafından Katade yoluyla İkrime'den, o İbn Abbas'tan diye rivayet edilen şu hadistir: \"Nebi Sallallahu Aleyhi ve Sellem canlı olarak hayvanın hedef edinilmesini, pislik yiyen hayvanın sütünün içilmesini ve kırbaların doğrudan ağzından su içilmesi ni nehyetmiştir.\" Hadis, ravileri bakımından Buhari'nin şartına uygundur. İbn Ebi Şeybe de hasen bir sened ile Cabir'den şu rivayeti zikretmiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem pislik yiyen hayvanın etinin yenilmesini yahut sütünün içilmesi ni nehyet. miştir.\" Aynı zamanda Hanbemerin de görüşü olan Şamlerden bir topluluğun kanaatine göre, buradaki nehy haramlık bildirmek içindir. İbn Dakiki'l-'Id de bunu fukahanın görüşü olarak kesin bir şekilde nakletmiştir. Ebu İshak el-Mervezı'nin, el-Kaffal'in, İmamu'l-Harameyn'in, Beğavı'nin ve Gazzalı'nin sahih kabul ettiği görüş de budur. Böyle bir hayvanın yumurtasıni da sütü ve eti gibi değerlendirmişlerdir",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 44
			}
		}
	]
}