{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"72": "Hunting, Slaughtering"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5534,
			"arabicnumber": 5534,
			"text": "Ebu Musa r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"İyi arkadaş ile kötü arkadaşın misali, misk taşıyan ile demirci körüğü üfleyen kimsenin misaline benzer. Misk taşıyan bir kimse ya sana bir miktar ikram eder ya sen ondan satın alırsın yahut ondan sana hoş bir koku gelir. Körük üfleyen kimse ise ya (saçtığı kıvılcımlarla) elbiselerini yakar yahut (ondan) kötü bir koku alırsın.\" Fethu'l-Bari Açıklaması: \"Misk\", bilinen hoş kokudur. el-Kermani der ki: Bunun zebaih (kesilen hayvanlar) bahsinde söz konusu edilmesine uygun düşmesi, ceylandaki bir gudde oluşu dolayısı iledir. Derim ki: Cahız şöyle demiştir: Bu Çin'de yaşayan, kokuları ve göbekleri dolayısı ile avlanan küçük bir hayvandır. Bu hayvan avlandığı takdirde baş aşağı ve içinde kanının toplanmasını sağlayacak şekilde göbeği düğüm lerı e bağlanır. Hayvan kesildikten sonra daha önce bağlanmış olan göbeğinin etrafı oyulur. Boğulmuş ve donmuş olan o kan, daha önce yanaşılamayacak kadar pis kokuyar iken pek hoş ve temiz bir miske dönüşünceye kadar tüyleri ile birlikte gömülür. Bundan dolayı el-Kaffal şöyle demiştir: Bu hayvan içindeki misk ile tabaklanarak temiz olur. Tıpkı diğer başka derilerin tabaklanarak temiz oluşu gibi. Meşhur olan ise misk hayvanının ceylana benzediğidir. Ancak onun rengi siyahtır. Alt çenesinde beyaz, oldukça güzel iki küçük azı dişi vardır. Misk de yılın belli bir zamanında göbeğinde toplanan kandır. Bu kan toplandığı vakit, toplandığı yer şişer ve ceylan, bundan dolayı bu toplanan kan üzerinden düşünceye kadar hastalanır. Denildiğine göre o ülke ahalisi toplanan bu kanın düşmesini sağlamak için hayvanın kaşınacağı kazıkları çöllük yerlerde çakar ve bırakırlar. Nevevi dedi ki: İlim adamları miskin tahir olduğunu, vücutta, elbisede kullanılmasının ve alınıp satılmasının caiz olduğunu icma' ile kabul etmişlerdir. Müslümanlar miskin temiz oluşunu icma' ile kabul etmekle birlikte Ömer radıyallahu anhldan mekruh oluşuna dair nakledilen kanaat istisnadır. İbnu'l-Münzir de aynı şekilde bir topluluktan bu kanaati zikrettikten sonra şunları söylemiştir: Miskin men'i hususunda Ata'dan gelen rivayet dışında sahih bir rivayet yoktur. O da miskin bedenden ayrılan bir parça oluşuna dayanarak bu görüşü ileri sürmüştür. Müslim de, Ebu Said yoluyla gelen hadisin arasında Nebi Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu zikretmektedir: \"Misk, hoş kokuların en hoş alanıdır.\" Bunu Ebu Davud da hadisten sadece bu kadarını kısaltarak zikretm1ş bulunmaktadır. \"Allah yolunda yara almış herkes.\"Bu hadisin açıklamaları daha önce Cihad bölümünde(2803.hadiste) geçmiş bulunmaktadır. Nevevl der ki: Hadisteki: \"Allah yolunda\" buyruğunun zahirinden anlaşıldığına göre bu, kafirlerle savaşırken şehit düşen kimse hakkında özel bir durumdur, ama bağılerle (meşru İslam yönetimine karşı ayaklanan kimselerle), yol kesicilerle savaşırken, iyiliği ayakta tutmak için mücadele ederken öldürülen kimseler de bu kapsama dahildir. Çünkü hepsinin ortak özelliği şehit oluşlarıdır. İbnull-Müneyyir dedi ki: Buharilnin bu hadisi, aynı şekilde bundan sonraki hadisi miskin temiz oluşuna delil göstermesi, şehidin kanının ona benzetilmesi ciheti iledir. Çünkü bu ifade, şehidin mazhar olacağı ikram ve tazim söz konusu edilirken kullanılmıştır. Eğer misk necis olsaydı, pis şeylerden olması gerekirdi ve böyle bir konumda onun misal gösterilmesi güzelolmazdı. Ebu Musa'nın iyi meclis arkadaşına dair rivayet ettiği hadis ile ilgili açıklamalar da Buyu' (alışveriş) bölümünün baş taraflarındal(2101.hadisin şerhinde) geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 72,
				"hadith": 59
			}
		}
	]
}