{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"73": "Al-Adha Festival Sacrifice (Adaahi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5548,
			"arabicnumber": 5548,
			"text": "Aişe r.anha'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem Mekke'ye girmeden önce Serifte iken yanıma girdi. Ay hali olmuş ve ağlıyordum. Allah Rasulü: Neyin var? Yoksa ay hali mi oldun, diye sordu. Aişe: Evet dedi. Allah Rasulü: Şüphesiz ki bu Allah'ın Adem'in kızları üzerine yazmış olduğu bir emirdir. Sen hacıların yaptıklarını yap, ancak Beyt'i tavaf etme. Mina'ya geldiğimiz sırada bana bir miktar inek eti getirildi. Bu da ne diye sordum. Rasulullah Sallallahu Aleyhi ve Sellem hanımları adına kurban kesti, dediler.\" Fethu'l-Bari Açıklaması: \"Yolcu ve kadın için kurban kesmek.\" Bu başlık ile yolcu olanın kurban kesme yükümlülüğü yoktur, diyen kimselerin kanaatinin aksine de işaret vardır. Bu husustaki nakil, birinci başlıkta geçmiş bulunmaktadır. Aynca kadınların kurban kesmek yükümlülüğü yoktur, diyenlerin kanaatinin aksine de işaret vardır. \"Şerif', Mekke'nin dışında bilinen bir yerdir. Hadisten Çıkan Sonuçlar Cumhur erkeğin kestiği kurbanın hem kendisinin, hem de aile halkının adına yeterli olacağına bu hadisi delil göstermiştir. Ancak Hanefiler bu hususta muhalefet etmişlerdir. Kurtubi der ki: Nebi Sallallahu Aleyhi ve Sellem'in kurban kesilen yılların tekrarlanmasına, hanımlarının da birden çok olmasına rağmen her bir hanımına ayrıca kurban kesmesini emrettiği nakledilmiş değildir. Ayrıca bunu Malik, İbn Mace ve sahih olduğunu belirterek Tirmizi'nin Ata b. Yesar yolu ile naklettikleri şu rivayet de desteklemektedir: \"Ben Ebu Eyyub'a: Rasulullah Sallallahu Aleyhi ve Sellem döneminde kurbanlar ne şekilde kesilirdi, diye sordum, o: Adam koyunu hem kendi adına, hem de aile halkı adına kurban olarak keser, kendileri de ondan yer, başkalarına da yedirirlerdi. Bu da gördüğün gibi insanlar bugüne gelinceye kadar böylece devam etti",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 4
			}
		}
	]
}