{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"73": "Al-Adha Festival Sacrifice (Adaahi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5550,
			"arabicnumber": 5550,
			"text": "Bize Eyyûb es-Sahtıyânî, Muhammed ibn Sîrîn'den; o da Abdurrahmân ibn Ebî Bekre'den; o da Ebû Bekre ibnu'l-Hâris (radıyallahü anh)'ten tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) -Minâ'da yaptığı hutbede- şöyle buyurmuştur. \"Zaman, Allah'ın gökleri ve yeri yarattığı günkü ilk vaziyetine dönmüştür. Bir yıl (ay ölçüsü ile) oniki aydır. Bunlardan dördü haram aylardır ki, üçü arka arkaya zu'l-ka'de, zu'l-hicce, muharrem'-dir. (Dördüncü) Mudar kabilesinin ayı olan receb'dir. O, cumâdâ'l-âhire ile şa'bân arasındadır\".Sonra Peygamber: \"Bu ay hangi aydır?\" diye sordu. Biz: Allah ve Rasülü daha iyi bilir! dedik. sükût etti. Biz Rasûlüllah bu aya eski adından başka bir ad verecek sandık. Sonra: \"Zu'l-hicce (ayı) değil midir?\" buyurdu. Biz: Evet zu’l-hicce'dir! dedik. Rasûlüllah: \"Bu içinde bulunduğunuz hangi beldedir?\" buyurdu. Biz: Allah ve Rasûlü daha iyi bilir! dedik.Rasûlüllah sustu. Hattâ biz Rasûlüllah Mekke'ye yeni bir isim verecek sandık. Sonra: \"Bu Belde (yani Mekke) değil midir?\" buyurdu. Biz: Evet Belde'dir! dedik. Rasûlüllah: \"Bu hangi gündür?\" diye sordu. Allah ve Rasûlü en bilendir! dedik. Rasûlüllah sükût etti. Hattâ biz, bu güne eski adından başka bir ad verecek sandık. Rasûlüllah: \"Nahr günü değil midir?\" buyurdu. Biz: Evet nahr günüdür! dedik. mukaddime sorulardan) sonraRasûlüllah şöyle buyurdu: \"Şu hâlde iyi biliniz ki, kanlarınız ve mallarınız -Muhammed ibn Sîrîn: Ben İbn Ebî Bekre'nin şunu da söylediğim sanıyorum: Ve ırzlarınız, bu ayınızda, bu beldenizde, bu gününüzün haram olduğu gibi haramdır(her türlü saldırıdan korunmuştur). Sizler Rabb'inize kavuşacaksınız da Rabb'iniz sizlere bütün amellerinizden soracaktır. Aklınızı başınıza toplayın da benden sonra birbirinizin boyunlarına vuracak sapıklar hâline dönmeyin. Dikkat edin! Bu nasihatlerimi burada hazır bulunanlarınız, burada bulunmayan müstakbel nesillere tebliğ etsin! Olabilir ki, kendisine bu tebliğ ulaşan kimselerin bâzısı, burada bulunup da bizzat işiten bâzı kimselerden daha iyi anlayıp bellemiş olur.\" Muhammed ibn Sîrîn bu hadîsi zikrettiği zaman: Peygamber doğru söyledi, der idi. Bundan sonra Peygamber: \"Dikkat edin! Tebliğ ettim mi? Dikkat edin! Tebliğ ettim mi?\" buyurdu",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 6
			}
		}
	]
}