{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"73": "Al-Adha Festival Sacrifice (Adaahi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5574,
			"arabicnumber": 5574,
			"text": "Abdullah b. Ömer r.a.'dan rivayete göre Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kurbanlık etlerinden üç gün yiyiniz. Abdullah da kurbanlıketlerinden yememek için Mina'dan ayrıldığı vakit (ekmeği) zeytinyağı ileyerdi.\" Fethu'l-Bari Açıklaması: \"Kurbanlık etlerinden yenilmesi.\" Yani üç gün ya da yarısı gibi bir kayıt olmaksızın \"ve ondan azık edinmek.\" Hem yolculuk için, hem hazarda demektir. Üç gün ile kayda dair açıklama ya neshedilmiştir yahut belli bir sebebe aittir. \"Senden sonra bir iş meydana geldi.\" el-leys şu fazlalığı eklemektedir: \"Bu iş üç günden sonra kurbanlık etlerini yemeğe dair kendilerine konulmuş olan yasağı kaldırdı.\" Bunu da Ahmed, Muhammed b. İshak'tan gelen rivayet olarak kaydetmiştir. Muhammed b. İshak dedi ki: \"Banababam ve Muhammed b. Ali b. Huseyn, Abdullah b. Habbab'dan tahdis etti, diyerek hadisi uzunca zikretmektedir. Ebu Said yoluyla hadisin lafzı şöyledir: \"RasÜlullah saJlaJlahu aJeyhi vesellem bizlere kurbanlık etlerimizi üç günden fazla yemeği yasa!\\damıştı. Ben bir yolculuğa çıktıktan sonra geriye aile halkımın yanına döndüm. -Bu dönüşüm de kurban bayramından birkaç gün sonra olmuştu.- Eşim bana içine kurutulmuş et katmış olduğu bir pazı yemeği getirdi. Bu (et) kurbanlıklarımızın etlerindendir, dedi. Ben ona: O (Allah Rasulü) bize bunu nehyetmedi mi, dedim. O: Gerçek şu ki bundan sonra insanlara bu hususta ruhsat verdi, dedi. Ama ben onu tasdik etmedim. Nihayet kardeşim Katade b. en-Numan'a haber gönderdim -diyerek hadisi zikretti. Bu rivayette şunlar da vardır: Rasulullah s.a.v. bu hususta Müslümanlara ruhsat verdi (dedi).\" \"İnsanlar açlık sebebiyle zorluk ile karşı karşıya idiler.\" Kıtlığın zorluk ve SIkıntısına düşmüşlerdi. \"Ancak bu kesin bir yasak değildi. Ama ondan yedirmemizi istemişti.\" Müslimlin kaydettiği Abdullah b. Ebi Bekr b. Hazm'ın, Amre'den naklettiği rivayette şöyle denilmektedir: \"Şüphesiz ben sizlere bunu, gelmiş olan o misafirler dolayısı ile yasaklamıştım. Artık kurban etlerinden tasadduk edebilir, saklayabilirsiniz de.\" Müslim'de hadisin baş tarafları şöyledir: \"Rasulullah Sallallahu Aleyhi ve Sellem döneminde kurban bayramına yakın bir zamanda çöl ahalisinden birtakım insanlar geldi. Allah Rasulü: Üç günlük için et saklayabilirsiniz, geri kalanı da tasadduk ediniz.\" dedi. Daha sonra: Ey Allah'ın Rasulü, insanlar kurbanlıklarından yararlanıyorlardı, denildi. Bunun üzerine o şöyle buyurdu: \"Ben sizlere gelen misafirler dolayısı ile (üç günden fazla) et saklamanızı yasaklamıştım. Artık ondan bir kısmını yiyiniz, tasadduk ediniz ve (bir kısmını da) saklayabilirsiniz.\" el-Hattabi dedi ki: \"ed-Duff\" hızlıca yürümek demektir. \"ed-Daffe\" (hadis tercümesinde: misafirler) aniden gelen muhtaçlar demektir. Bu hadislerin mutlak oluşu, yedirmek için yeterli olacak miktarda bir kayıtlama olmayacağına delil gösterilmiştir. Kurban kesen bir kimsenin kurbanlığından bir miktar yiyip, geri kalanı da sadaka ve hediye olarak başkasına yedirmesi müstehaptır. Şafii'den gelen rivayete göre kurban etlerinin üçe paylaştırılması müstehaptır. Çünkü Allah Rasulü: \"Ondan yiyiniz, tasadduk ediniz ve yediriniz\" diye buyurmuştur. İbn Abdilberr dedi ki: Ondan başkası da şöyle derdi: Yarısını yemesi, yarısını da başkasına yedirmesi müstehaptır. Nevevı dedi ki: Cumhurun görüşüne göre kurbanlıktan yemek vacip değildir. Buradaki emir bu hususta izin içindir. Seleften bazıları da emrin zahirini kabul etmek kanaatindedir. Kurban etinden tasadduk etmeye gelince, sahih olan, kurbanlıktan sadaka denilebilecek miktarın tasadduk edilmesinin vacip olduğudur. Daha kamil olanı ise onun çoğunluğunu tasadduk etmesidir. Şafii der ki: Üç günden sonra kurbanlık etlerinin alıkonulmasının yasaklanışının herhalde ve durumda neshedilmiş olma ihtimali vardır. Derim ki: Bu ikinci kanaati Şamlerin müteahhir olanları benimsemişlerdir. Rafi' dedi ki: Kuvvetli görünen görüş şu ki; bugün kurban etinden sa:klamak, hiçbir şekilde haram değildir. Nevevi de bu hususta onu takip ederek Şerhu'l-Mühezzeb adlı eserinde: Doğru olarak bilinen şu ki: Bugün kurbanlık etlerini saklamak hiç bir şekilde haram değildir, demektedir. Müslim Şerhindede alimlerin cumhurundan bunun sünnetin sünnet ile neshi türünden olduğu nakledilmektedir. Şöyle denmektedir: Doğru olan da nehyin mutlak olarak neshedildiği ve artık haramlığın da, mekruhluğun da kalmadığıdır. Bugün üç günden sonrasına yetecek kadarını saklamak da, dilediği zamana kadar yiyecek miktarını alıkoymak da mubahtır",
			"grades": [],
			"reference": {
				"book": 73,
				"hadith": 30
			}
		}
	]
}