{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"74": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5584,
			"arabicnumber": 5584,
			"text": "Enes b. Malik'ten rivayete göre \"Hamr (içki) haram kılındığında o gün içki busr (denilen taze hurma)dan ve temr (denilen olgun kuru hurma)dan yapılıyordu.\" Fethu'l-Bari Açıklaması: \"İçkinin haram kılınışı nazil olduğunda busr ve temrden idi.\" Yani bunlardan yapılıyor veya ediniliyordu. \"Zehv ve temrin fadlhinden ... \" el-fadıh, hurma koruğu ezilip, yarılıp, nebız yapılan içkinin adıdır. Zehv ise rutab seviyesine gelmeden önce kızaran yahut sararan koruk hurma olan el-busr ile aynı şeydir. \"Onlara birisi geldi.\" İbn Merduye'nin rivayetine göre Enes şöyle demiştir: \"Içki haram kılınıp da ashabından birtakım kimseler içki önlerinde olduğu halde bana and verince, ben de ayağımla içkiyi tekmeledim ve: Artık içkinin haram kılınış hükmü nazil olmuştur, dedim.\" \"İçki haram kılındığında o gün içki busrden yapılıyordu.\" Üzümden yapılmış hamr (şarab)ın azının da, çoğunun da haram kılındığı hususunda icma' gerçek\" leştiği gibi, azının haram kılınışındaki illetin, fazlasını içmeye davet edişi olduğu üzerinde de icma' olmuştur. Ama üzümden yapılan şarap ile başkaşeylerden yapılan şarap arasında hüküm bakımından farklılık gözetenler, üzümden yapılan şarap hakkında, -ileride açıklanacağı üzere- pişirilmesi hali dışında azı da, çoğu da haram olur, ama üzümden başkasından yapılanşarabın ancaksarhoşluk veren miktarı haramdır, daha azı haram değildir, demişlerdir. Böylelikle her ikisinde illetin aynı olmasına rağmen, isimlerin farklılığını ileri sürerek bu tür şaraplar arasında fark gözetmişlerdir. Ama üzümden yapılan şarap hakkında söz konusu olan herbir şey başkasından yapılan şeyler hakkında da söz konusudur. Kurtubi der ki: Bu, kıyas türlerinin en inceliklilerindendir. Çünkü burada fer' (küçük önerme) asla (büyük önermeye) bütün nitelikleri bakımından eşit bulunmaktadır. Üstelik bu hususta kıyas, sahih nasların zahirlerine de uygundur. Doğrusunu en iyi bilen Allah'tır. Daha sonra Beyhaki, nebızin su ile kırılması (etkisinin giderilmesi) hususunda gelmiş olan hadisleri söz konusu etmektedir. Bu hadislerden birisini Hemmam b. el-Haris, Ömer'den rivayet etmiştir. Buna göre \"Ömer bir seferde iken ona bir nebız getirildi, o da ondan içti. Arkasından kaşlarını çatıp suratını ekşitti, sonra da: Taif nebızi şiddetlidir (ağırdır), diyerek su istedi ve üzerine su döktükten sonra içti.\" Hadisin senedi kavidir. Bu hususta varid olmuş en sahih rivayet budur. Ama bu o nebızin sarhoşluk verecek sınıra ulaştığı hususunda da bir nas değildir. Çünkü sarhoşluk verecek sınıra ulaşmış olsaydı, üzerine su dökmek, haramlığını gidermezdi. Tahav! de bunu itiraf ederek şöyle demiştir: Eğer haram olacak sınıra ulaşmış olsaydı, su dökmek ile şiddeti gitse bile helal olmazdı. Böylelikle üzerine su dökmeden önce de onun haram olmadığı sabit olmaktadır. Derim ki: O halde nebız sarhoşluk verecek sınıra ulaşmadığı takdirde, azının da, çoğunun da içilmesinin mubah olduğu hususunda görüş ayrılığı yoktur",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 10
			}
		}
	]
}