{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"74": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5589,
			"arabicnumber": 5589,
			"text": "İbn Ömer'den rivayete göre \"Ömer r.a. dedi ki: Hamr (içki) beş şeyden yapılır: Kuru üzümden, kuru olgun hurmadan, buğdaydan, arpadan ve baldan.\" Fethu'l-Bari Açıklaması: Ömer'in bu dedikleri Nebi Sallallahu Aleyhi ve Sellem'den açık ifadeler halinde rivayet edilmiş bulunmaktadıı:. Dört Sünen sahibi tarafından rivayet edilip İbn Hibban'ın da sahih olduğunu belirttiği eş-Şa'bi'den iki yolla nakledilmiş olan rivayete göre \"en-Numan b. Beşir dedi ki: Rasulullah Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Hamr (içki) sıkılmış meyve suyundan, kuru üzümden, hurmadan, buğdaydan, arpadan ve darıdan yapılır ve ben size sarhoşluk verici her şeyi yasaklıyorum.\" Lafız EbQ Davud'a ait. \"Hamr (içki) aklı örtüp perdeleyen her şeydir.\" (Hamr kökünden gelen ve örtüp perdeleyen anlamı verilen: Hamera lafzı) örten, onunla iç içe olup karışarak onu kendi hali üzere bırakmayan demektir. \"Arzu ederdim\", temenni ederdim. Böyle bir temennide bulunmasının sebebi açıklamanın yapılmış olması halinde ictihadın ihtiva ettiği sakıncalardan uzak kalınmasıdır. Bu sakınca ise düşülmesi ihtimali bulunan hatadır. Her ne kadar idihad dolayısıyla ecir alınsa bile hata yapılması halinde ikinci ecri elde edemez; ama nassın gereğince amel etmek katıksız bir isabettir. \"Bize açıklamayapmadan bizden ayrılmamasını arzu ederdim.\" Müslim'deki rivayette: \"Nihai olarak kendisine başvurulacak bir açıklama\" şeklindedir. Bu ifadeler onun bu konuda Nebi Sallallahu Aleyhi ve Sellem'den gelen bir nass! bilme diğini göstermekte ve diğertaraftan içkiye dair haber verdiği husus dolayısı ile daha başka bir şeye ihtiyaç duymayacak şekilde Nebiden kendisine ulaşmış bir bilgiye sahip olduğu izlenimini vermektedir ki, bu hususta hutbesinde kesin bir kanaatini de belirtmiş oldu. \"Dede ile kelale(nin mirası) ve faize dair bazı bahisler.\" Dededen maksat, mirastan hak ettiği miktarın ne olduğudur. Çünkü ashab-ı kiram bu hususta çok büyük ihtilafa düşmüşlerdir. İleride Feraiz (miras bahisleri) bölümünde(6738.hadiste) Ömer'den bu hususta farklı hükümler verdiğine dair açıklamalar gelecektir. Kelale'ye dair açıklamalar da aynı şekilde Feraiz bölümünde gelecektir. Faiz ile ilgili çeşitli konulara gelince, muhtemelen bu sözüyle riba'l-fadl (denilen fazlalık faizin)e işaret etmektedir. Çünkü nesıe ribası (vade faizi) üzerinde ashab-ı kiram arasında ittifak vardır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 15
			}
		}
	]
}