{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"74": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5632,
			"arabicnumber": 5632,
			"text": "Ebu Leyla'dan, dedi ki: \"Huzeyfe Medain'de bulunuyordu. Kendisine su verilmesini istedi. Bir dihkan (Medain eşrafından birisi) ona gümüş bir kase getirdi. Huzeyfe o kaseyi ona doğru fırlatarak: Benim bunu atmamın tek sebebi, bu işi yapmamasını (defalarca) söylediğim halde bundan vazgeçmeyişidir. Halbuki Nebi Sallallahu Aleyhi ve Sellem de bizlere ipek ve atlas giyinmeyi, altın ve gümüş kaplarda içmeyi yasaklamış ve: Bunlar bu dünyada onlarındır, (kafirlerin) ahirette de sizlerindir diye buyurdu, dedi.\" Fethu'l-Bari Açıklaması: \"Altın kaplarda içmek.\" İbnulI-Münzir altın ve gümüş kaplarda içmenin haram olduğu üzerinde icmal bulunduğunu nakletmiştir. Tabilnden birisi olan Muaviye b. Kurra bundan müstesnadır. Bu husustaki nehiy ona ulaşmamış gibidir. Şafii'nin de kadim görüşüne göre -ki onun kullandığı ifade Harmele'de nakledilmiştir- buradaki nehiy tenzih içindir. Çünkü bu yasağın illeti Acemlere benzemeyi ihtiva etmesidir. Ama yeni mezhebindeki açık ifadesi, haram olduğu şeklindedir. Mezhebine mensup kimi ilim adamı ondan, onun bu hususta kat'i olarak haram olduğunu söylediğini nakletmiştir. Ona yakışan da budur. Çünkü bundan sonraki başlıkta geleceği üzere bunları kullanmaya ka.rşı cehennem ateşinin tehdidi sabittir. Eğer ŞafiiIden diye nakledilen görüş ondan gerçekten sabit olmuş ise sözü geçen hadis ona ulaşmadan önce bu görüşünü belirtmiş olabilir. Diğer taraftan Harmele'de ondan diye yapılan nakilde bir yanılma olduğunu destekleyen husus da şudur: et-Takrib adlı eserin sahibi Zekat bölümünde Harmele'de onun kullandığı ibarelerden altın ya da gümüş kap edinmenin haram kılınışına dair ifadeleri nakletmiş bulunmaktadır. Edinmek haram ise kullanmanın haram oluşu öncelikle söz konusudur. Daha önce değinilen illet ise ittifakla kabul edilmiş bir illet değildir. Aksine ilim adamları bu husustaki nehyin çeşitli illetlerini de söz konusu etmişlerdir. Fakirlerin kalplerini kırmak yahut büyüklenmek ve israf ile iki nakdin (altın ve gümüşÜn) piyasada az bulunmalarına sebep teşkil etmek gibi gerekçeler bunlar arasında sayılmıştır. \"Huzeyfe Medain'de iken ... \" Medain, Dicle kenarında büyük bir şehir olup onunla Bağdat arasında yedi fersah vardır. Medain, Fars krallarının kaldıkları şehir idi. Kisra'nın meşhur Eyvan'ı da oradadır. Medain, Ömer radıyallahu anh'ın halifeliği döneminde h. 16 yılında Sa'd b. Ebi Vakkas'ın kumandanlığında fethedilmiştir. Huzeyfe de önce Ömer radıyallfıhu anh'ın halifeliği döneminde, sOnra da Osman döneminde ve onun şehadetinden sonra, vefat edene kadar Medain valiliği ni yapmıştır. \"Kendisine su getirilmesini istedi. Bir dihkan ona ... getirdi.\" Dihkan Farsça'da kasabanın büyüğü demektir. Yiyecekler bahsinde Seyf yoluyla Mücahid'den o İbn Ebi Leyla'dan \"Huzeyfe'nin huzurunda idiler. O kendisine su getirilmesini istedi. Bir Mecusi ona su getirdi. .. \" diye geçmiş idi. \"Gümüş bir kase ile.\" Müslim'de \"Abdullah b. Ukeym yoluyla Huzeyfe'nin huzurunda idik. Bir dihkan ona gümüş bir kap içerisinde bir içecek getirdi ... \" şeklindedir. \"Ve: Bunlar dünya da onların (kafirlerin)dir ama ahirette de bunlar sizin olacaktır.\" el-İsmaill dedi ki: \"Dünyada\" lafzı onların bu dünya hayatında bunları kullanmalarının mubah kılındığı anlamına gelmez; ama \"onlarındır\" ifadesinden kasıt, Müslümanlara muhalefet olarak onlar bunları kullanırlar, demektir. Aynı şekilde \"ahirette ise sizindir\" yani dünya hayatında bunu terk etmenize kafşılık mükafat olarak siz bunları ahirette kullanacaksınız. Ama bunları kullanmak suretiyle dünyada Allah'a karşı geldiklerinden, ceza olarak bunu ahirette kullanamayacaklardır",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 58
			}
		}
	]
}