{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"74": "Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5638,
			"arabicnumber": 5638,
			"text": "Asım el-Ahvel'den, dedi ki: \"Ben Nebi Sallallahu Aleyhi ve Sellem'in kasesini Enes b. Malik'in yanında gördüm. -Bu kase çatlamıştı da onu gümüş telle bağlamıştı.- Asım dedi ki: O kase nudar ağacından yapılmış, enlice, güzel bir bardak idi. Yine Asım dedi ki: Enes: Andolsun Hasulullah Sallallahu Aleyhi ve Sellem'e bu kas e ile şu kadar şu kadardan fazla defa su içirmişimdir, dedi.\" Asım dedi ki: İbn S1r1n de şöyle dedi: \"Bu kasenin demirden bir halkası vardı. Enes onun yerine altın ya da gümüş bir halka koymakistemişti de Ebu Talha ona: Rasulullah Sallallahu Aleyhi ve Sellem'in yaptığı hiçbir şeyi sakın değiştirme, dedi. Enes de vazgeçti.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in kasesinden ... \" Onun bereketinden istifade etmek üzere \"içmek.\" \"Abdullah b. Selam bana dedi ki.\" Abdullah meşhur sahabidir. Daha sonra Sehl b. Sa'd'ın el-Cevniyye diye bilinen kadının olayını ve bu kadının Nebi Sallallahu Aleyhi ve Sellem'in kendisine talip olmak üzere geldiği sırada ondan Allah'a sığınması hadisesini nakletmektedir. Bu hadiseye dair geniş açıklamalar Talak bölümünün baş taraflarında (5255 ve 5256.hadislerin şerhinde) geçmiş bulunmaktadır. \"Kadın: Demek ki ben çok bedbahtmışım, dedi.\" Bu sözlerinden maksadı Rasulullah Sallallahu Aleyhi ve Sellem ile evlenme fırsatını kaçırdığı için bedbaht olduğunu ifade etmektir. \"Nebi Sallallahu Aleyhi ve Sellem geri dönüp Saide oğulları Sakifesinde (sundurmasının altında) oturdu.\" Sakife, Ebu Bekir es-Sıddık radıyallahu anh'a halifelik için bey'atin gerçekleştiği yerdir. Hadisten çıkan sonuçlar 1- Arkadaşlara karşı teklifsiz olmak ve arkadaşının yanında yiyecek, içecek ne varsa getirmesini istemek, 2- Arkadaşını künyesi ile çağırarak onu tazim etmek, 3- Salihlerin eserlerinin bereketinden yararlanmak istemek, 4- Arkadaşından kendisine ağır gelmeyecek şeyleri hibe etmesini istemek, mümkündür. \"O nudar ağacından enli, güzel bir kase idi.\" Nudar, odunun ve her şeyin katıksız olanına denilir. Bunun aslının neb' denilen Arabistan kirazından olduğu, renginin de sarıya çaldığı söylenir. Ebu Hanife ed-Dıneverı: Bu, kap yapmak için kullanılabilecek en kaliteli kerestedir, demiştir",
			"grades": [],
			"reference": {
				"book": 74,
				"hadith": 64
			}
		}
	]
}