{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5648,
			"arabicnumber": 5648,
			"text": "Abdullah'tan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem'in huzuruna girdim. O sırada hummadan sarsılıyordu. Ey Allah'ın Rasulü, Sen hummadan dolayı çok şiddetli bir şekilde sarsılıyorsun, dedim. O: Evet, ben sizden iki kişinin hummadan çektiği kadarını çekiyorum, diye buyurdu. Ben: Bunun sebebi sana iki kat ecir verilmesi midir, diye sordum. O, evet bu böyledir. Batan bir diken ve daha yukarısı olsun, Müslümana isabet eden herbir eziyet karşılığında mutlaka Allah da onun günahlarını affeder. Tıpkı ağacın yapraklarını döktüğü gibi, diye cevap verdi.\" Fethu'l-Bari Açıklaması: \"İnsanlar arasında belası en ağır olanlar, nebilerdir. Sonra faziletçe onlardan sonra gelenler, !onra onlardan sonra gelenler.\" Bu başlığın birinci kısmı Darimı ve Nesai'nin es-.Sünenull-Kubra'da, İbn Macelnin, sahih olduğunu belirterek TirmiziInin, ıbn Hibban'ın ve Hakim'in rivayet ettikleri hadisin bir bölümündedir. Hepsi de bu hadisi Asım b. Behdele yoluyla Mus'ab b. SaId b. Ebi Vakkas'dan, o babasından diye rivayet etmişlerdir: \"Sa'd b. Ebi Vakkas dedi ki: Ey Allah'ın Resulü, insanlar arasında belası en ağır olanlar kimlerdir, diye sordum. O: Nebilel'dir, sonra sırasıyla onlardan sonra gelenler, sonra sırasıyla onlardan sonra gelenlerdir. Kişi dinine göre belayamaruz kalır, diye buyurdu.\" Hadiste şu ifadeler de yer almaktadır: \"Ve (mu'min) nihayet yeryüzünde üzerinde hiçbir günah bulunmadığı halde yürüyecek seviyeye gelir.\" Bu hadisi Hakim rivayet etmiştir. ''Yaprakların döküldüğü gibi.\" Yaprakların etrafa dağınık bir şekilde dökülmesi gibi. Kısacası hadis, hastalığın ağırlaşması halinde ecrin de kat kat artmasına sebep teşkil ettiğini tespit etmektedir. Bundan sonra da şunu eklemektedir: Ecrin kat kat verilmesi, sonunda günahların tamamının dökülmesine sebep olur. Ya da anlam şu şekildedir: Evet, hastalığın şiddetli olması dereceleri yükseltir, aynı şekilde hiçbir günah kalmayıncaya kadar da günahların dökülmesine sebep olur",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 8
			}
		}
	]
}