{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5653,
			"arabicnumber": 5653,
			"text": "Enes b. Malik r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Yüce Allah: Ben kulumu iki sevgilisi ile belalandırıp (gözünün nurunu alıp) o da sabrederse ona o ikisinin yerine cenneti veririm diye buyurdu.\" İki sevgilisiyle kastettiği, gözleridir. Bu hususta Eş'as b. Cabir ve Ebu Zilaı b. Hilal de Enes'ten, o Nebi Sallallahu Aleyhi ve Sellem'den diye ona (Muttalibin'in azatlısı Amrla) mutabaat etmişlerdir. Fethu'l-Bari Açıklaması: \"Sabrederse ... \" Tirmizi, Enes'ten diye naklettiği rivayetinde \"ve ecrini Allah'tan beklerse\" fazlalığını da eklemektedir. Maksat da Allah'ın sabreden kimselere vaat etmiş olduğu sevabı hatırına getirerek sabretmesidir. Yoksa sadece bu hale katlanıp, tahammül göstermesinden ibaret değildir. Çünkü ameller niyetler iledir. Yüce Allah'ın dünya hayatında kulunu ibtila etmesi (belaya uğı-atması) onun o kuluna gazabından kaynaklanmaz. Aksine bu ya hoş olmayan bir hali önlemek, ya günahlara keffaret olmak ya da makamını, mevkiini yükseltmek için de olabilir. Eğer kul bu hali rıza ile karşılayacak olursa bundan gözetilen maksadı eksiksiz ele geçirmiş olur. Sabretmeyecek olursa durum Selman radıya1lilhu anh'ın rivayet ettiği şu hadisteki gibi olur: \"Allah mu'minin hastalığını ona (günahlarına) bir keffaret kılar ve Allahlın rızasına sebep olur. Günahkarın hastalığı ise sahipleri tarafından önce bağlanmış, sonra da serbest bırakılmış bir deveye benzer. Ne diye bağlandığını da bilmez, ne diye serbest bırakıldığını da.\" \"O ikisinin yerine ona cenneti veririm.\" Ebu Umamelnin rivayeti ile hadiste bir başka kayıt daha zikredilmiştir ki, bunu da Buhari, el-Edebu'l-Müfred adlı eserinde: \"Ben senin iki değerli varlığını alır da o sadme esnasında sabredip ecrini bekleyecek olursan ... \" lafzı ile rivayet etmiştir. Bununla da faydası görülecek olan sabrın, bu belanın gerçekleştiği ilk sıralarda olan sabır olduğuna işaret etmektedir. Bu halde kişi işini Allah'a havale eder ve teslimiyet gösterirse sabrının faydasını görür, aksi takdirde ilk anda eğer tahammül göstermez ve dayanamazsa arkasından ümidini kestikten sonra sabredecek olursa, gözetilen maksadı elde etmişolmaz",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 13
			}
		}
	]
}