{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5663,
			"arabicnumber": 5663,
			"text": "Urve'den rivayete göre Üsame b. Zeyd kendisine şunu haber vermiştir: \"Nebi Sallallahu Aleyhi ve Sellem Bedir vakasından önce palanı üzerine bir Fedek kadifesi konulmuş bir eşeğe binerek, hasta ziyaretinde bulunmak üzere Said b. Ubade'ye gitti. Üsame'yi de terkisine bindirdi. Yolda giderken aralarında Abdullah b. Ubey b. SeluI'ün de bulunduğu bir meclisin yanından geçti. Bu da Abdullah'ın Müslüman olmasından önce idi. Mecliste Müslümanlardan, putlara tapan müşriklerden ve Yahudilerden oluşan kimseler karışık olarak oturuyordu. Aynı mecliste Abdullah b. Revaha da vardı. Hayvanın kaldırdığı toz meclisi kaplayınca Abdullah b. Ubey ridası ile burnunu örttü ve: Üzerimize toz kaldırmayınız, dedi. Nebi Sallallahu Aleyhi ve Sellem, selam verip durdu, sonra bineğinden inip onları Allah'a davet etti. Onlara Kur'an okudu. Abdullah b. Ubey ona: Ey adam, şüphesiz eğer bu söylediklerin hak ise ondan güzeli yoktur. Fakat biz meclislerimizde iken bununla bizi rahatsız etme. Aramızdan yanına gelen olursa o zaman ona anlat, dedi. İbn Revahe: Hayır, ey Allah'ın Rasulü, biz meclislerimizde iken sen bizim yanımıza buyur. Biz yanımıza gelmeni seviyoruz: dedi. Bunun üzerine Müslümanlar, müşrikler ve Yahudiler karşılıklı olarak birbirlerine ağır sözler söylemeye koyuldular. Hatta birbirleri üzerine hücum edeceklerdi neredeyse! Nebi Sallallahu Aleyhi ve Sellem seslerini kesip susuncaya kadar onları teskin edip durdu. Arkasından Nebi Sallallahu Aleyhi ve Sellem bineğine bindi ve nihayet Sa'd b. Ebi Vakkas'ın yanına girdi. Ona: Ey Sa'd, -Abdullah b. Ubey'i kastederek- Ebu. Hubab'ın dediklerini duymadın mı, diye sordu. Sa'd: Ey Allah'ın Rasulü, sen onu affet ve bağışla. Andolsun Allah sana bu verdiği ihsanları bağışladığında, bu belde halkı onun başına taç giydirmek ve ona krallara özel sarık sardırmak üzere toplanıp biraraya gelmişlerdi. Fakat Allah sana ihsan etmiş olduğu hak ile bunu bertaraf edince İbn Ubey'in hevesi kursağında kaldı. İşte sana bu yaptıklarını yapmasına onu iten sebep bunlardır, dedi",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 23
			}
		}
	]
}