{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"75": "Patients"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5669,
			"arabicnumber": 5669,
			"text": "Ubeydullah b. Abdullah b. Abbas radıyallahu anh'dan, dedi ki: \"Rasulullah Sallallahu Aleyhi ve Sellem'in vefatının yaklaşmış olduğu bir sırada, evde aralarında Ömer b. el-Hattab'ın da bulunduğu birtakım adamlar da bulunuyorken Nebi Sallallahu Aleyhi ve Sellem: Haydi, size bir kitap (vasiyetname) yazayım da ondan sonra asla sapmayasınız, diye buyurdu. Bunun üzerine Ömer: Şüphe yok ki Nebi Sallallahu Aleyhi ve Sellem'in hastalığı oldukça ağırlaşmış bulunuyor. Yanınızda da Kur'an-ı Kerim vardır. Bize Allah'ın kitabı yeter, dedi. Akabinde evde bulunanlar görüş ayrılığına düştüler ve birbirleriyle tartıştılar. Aralarından kimi: Haydi (yazı malzemesi) getiriniz, Nebi Sallallahu Aleyhi ve Sellem size sonrasında asla sapıtmayacağınız şekilde bir kitap (vasiyetname) yazsın diyor, kimisi Ömer'in dediği gibi söylüyordu. Nebi Sallallahu Aleyhi ve Sellem'in huzurunda gereksiz sözleri ve görüş ayrılığını çoğaltıp, artırmaları üzerine Rasulullah Sallallahu Aleyhi ve Sellem: Kalkın (ve gidin) diye buyurdu. Ubeydullah dedi ki: İbn Abbas: Huzurunda bulunanların görüş ayrılığına düşmeleri ve sözlerinin birbirlerine karışıp gürültü çıkarmaları Rasulullah Sallallahu Aleyhi ve Sellem'in onlara o kitabı (vasiyetnameyi) yazmalarına engel teşkil etmesi dolayısıyla, karşı karşıya kaldığınız o musibet ne büyük bir musibettir, derdi.\" Fethu'l-Bari Açıklaması: \"Hastanın\" yanında bulunan kimselerin bu sözleri söylemesini gerektirecek işleri yapmaları halinde: 'Yanımdan kalkınız, demesi.\" Hadisten Çıkan Sonuçlar 1- Bu hadisten anlaşıldığına göre hasta ziyaretinde bulunan kimsenin hastayı usandırıncaya kadar ziyaretini uzatmaması, onu rahatsız edecek sözler söylememesi, hasta ziyaretinin adabındandır. 2- Hasta ziyaretinin adabı ondur. Bu adabın bir kısmı yalnızca hasta ziyaretine de mahsus değildir: a- İçeri girmek için izin isterken kapının açılacak kısmının karşısında durmaması b- Kapıyı yumuşak bir şekilde vurması c- \"Kim 07\" diye sorulduğu takdirde, \"benim\" gibi bir karşılıkla kimliğini gizlememesi d- Hastanın ilaç alma vakti gibi hasta ziyaretine uygun olmayan bir vakitte ziyarete gitmemesi e- Az oturması f- Sağa sola değil, önüne bakması g- Az soru sorması h- Rikkate geldiğini dışa yansıtması i- Samimi olarak ihlasla dua etmesi j- Hastanın geleceğe dair ümitli olmasını sağlaması ve pek büyük bir ecri gerektirdiği için de onasabırlı olmayı tavsiye etmesi k- Vebal ihtiva ettiğinden dolayı sabırsızlanmaktan, sızlanmaktan onu sakindırması \"İbn Abbas: Ne büyük bir musibettir, derdL\" Buna dair açıklamalar daha önceden Nebi Sallallahu Aleyhi ve Sellem'in vefatı söz konusu edilirken (4429,4430 nolu hadislerde) geçmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 75,
				"hadith": 29
			}
		}
	]
}