{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5685,
			"arabicnumber": 5685,
			"text": "Enes'ten rivayete göre, \"Bazı kimseler hastalanmışlardı. Ey Allah'ın Rasulü, bizi barındır, bize yiyecek ver, dediler. Bunlar sağlıklarına kavuşunca, Medine'nin havası ağırdır, dediler. Bu sefer onları zekat develerinin bulunduğu el-Harre denilen yerde yerleştirdi ve: Develerin sütlerinden içiniz, buyurdu. Sağlıklarına kavuşunca Nebi Sallallahu Aleyhi ve Sellem'in çobanını öldürdüler ve zekat develerini önlerine katıp götürdüler. Allah Rasulü arkalarından izlerini takip edecek kimseler gönderdi. Sonra ellerini ve ayaklarını (çaprazlama) kesti, gözlerine de mil çektirip oydurdu. Ben onlardan bir adamın, ölünceye kadar yeri ısırıp dili ile yaladığını gördüm.\" Ravilerden Sellam dedi ki: Bana ulaştığına göre el-Haccac, Enes'e: Bana Nebi Sallallahu Aleyhi ve Sellem'in uyguladığı en ağır cezayı tahdis et, dedi. Enes de ona bu hadisi anlattı. Bu olay el-Hasen'e ulaşınca o da: Enes'in bu hadisi Haccac'a tahdis etmemiş olmasını çokça arzu ederdim, dedi.\" Fethu'l-Bari Açıklaması: \"Deve süt1eri ile tedavi.\" Yani böyle bir tedavinin uygun geleceği hastalıklarda kullanılması. \"Bazı insanlar.\" Behz, rivayetinde \"Hicaz ehlinden\" fazlalığını da zikretmiş bulunmaktadır. Hadis daha önce Taharet bölümünde kaydedilmiş ve bunların Ukl yahut Ureynelilerden -bu şekilde şek ile- oldukları belirtilmiş idi. Bunların sekiz kişi oldukları, dört tanesinin Ukl'den, üç tanesinin Ureynelilerden, dörd üncülerinin de onlara tabi olan bir başka kabileden birisi olduğu sabittir. \"Ben onlardan bir adamın ölünceye kadar yeri ısırıp diliyle yaladığını gördüm.\" Behz, rivayetinde: \"Çektiği ağrı ve gamdan ötürü\" fazlalığını da zikretmiştir. EbQ Avane'nin Sahih'inde, burada: \"Duyduğu sıcaklık ve şiddetten ötürü yerin soğuğunu almak üzere yeri ısırdığını gördüm\" denilmektedir. \"el-Hasen\" (b. Ebi'l-Hasen el-Basri'dir)'e ulaşınca Enes'in bu hadisi Haccac'a nakletmemiş olmasını çokça arzu ederdim dedi.\" el-Kuşmiheni: \"Bu\" lafzını eklemiştir. Behz'in rivayetinde de şöyle denilmektedir: \"Allah'a yemin ederim, Haccac minbere kalkıp: Bize Enes tahdis etti deyip, bu hadisi nakletmeden durmad!.\" Dedikten sonra şunları söyledi: Nebi Sallallahu Aleyhi ve Sellem Allah'a isyan sebebiyle elleri, ayakları kesti, gözlere mil çektirdi. Biz Allah'a isyan sebebiyle bunu yapmayacak mıyız, dedi.\" el-İsmaill bir başka yolla Sabit'ten şunu nakletmektedir: Bana Enes tahdis ederek dedi ki: Ben Haccac'a naklettiğim bir hadis dolayısıyla duyduğum pişmanlığı hiçbir şeyden dolayı duymuş değilim.\" Daha sonra hadisi zikretmektedir. Enes'in buna pişman olmasının sebebi ise Haccac'ın ceza vermekte çok aşırı giden birisi olması idi ve en basit bir şüpheyi kabul ederek ağır cezalar verirdi. Uramler ile ilgili bu kıssada onun lehine delil olacak bir taraf yoktur. Çünkü bu hadisin bazı rivayet yollarında irtidad ettikleri açıkça ifade edilmiştir. Ayrıca bundan sonra gelecek olan başlıkta belirtileceği üzere hadler de henüz nazil olmamış ve Meğazi'de geçtiği üzere müsle (organların kesilmesi)nin nehyinden önce olmuştur",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 8
			}
		}
	]
}