{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5690,
			"arabicnumber": 5690,
			"text": "Aişe r.anha'dan rivayete göre \"O, telbine bulamacı yapılmasını emreder ve: O, hoşlanılmayan ama faydalı olan şeydir, derdi.\" Fethu'l-Bari Açıklaması: \"Hasta için telbine bulamacL\" el-Asmaı dedi ki: Telbine, undan yahut kepekten yapılan ve içine bal katılan bir bulamaçtır. Başkası da un yahut süt katılan, demiştir. Ona telbine denilmesinin sebebi, beyazlığı ve inceliği (katı olmayışı) bakımından leben (süt)e benzetilmesi dolayısı iledir. ''Telbineye devam ediniz\", yani onu yiyiniz. \"Çünkü o kalbi rahatlatır.\" Yani hastanın kalbini rahatlatıl' ve (kederlinin) kederini izale ederek onun şevkini yerine getirir. \"O bize telbine bulamacı yapılmasını emreder ve: O hoşa gitmeyen faydalı şeydir, derdi.\" Ahmed ve İbn Mace'de Külsum yoluyla Aişe'den Nebi'e merfu' olarak şöyle dediği rivayet edilmiştir: \"Size hoşa gitmeyen, faydalı olan şeyi yemenizi tavsiye ederim. O et-telbine'dir, yani bulamaçtır.\" Bunu ayrıca Nesai bir başka yolla Aişe'den diye rivayet etmiş olup şu fazlalığı da kaydetmiştir: \"Muhammed'in nefsi elinde olana yemin ederim ki, o bir kimsenin kendi yüzündeki kiri su ile yıkadığı gibi, sizden herhangi birinizin karnını öylece yıkar.\" el-Muvaffak el-Bağdadı dedi ki: Eğer telbine denilen bulamacın faydalarını bilmek istersen arpa suyunun faydalarını bilmelisin. Özellikle kepek halinde ise o, cilalar, hızlıca nüfuz eder ve gayet latif bir besleyicidir. Sıcak içildiği takdirde daha da çok cilalar, daha çok nüfuz eder ve fıtrattaki haraı-eti daha da artırır. Devamla der ki: Hadiste fuad (kalp)den kasıt, midenin üst tarafıdır. Çünkü üzüntülü olan kimsenin kalbi, azalarının ve özellikle de gıdanın azaltılması sebebiyle midesinin üzerinde kuruluğun istilasından ötürü zayıflar. Böyle bir bulamaç ise mideyi nemlendiril', besler ve güçlendirir. Benzeri bir etkiyi de hastanın kalbine yapar. Fakat hastanın çoğunlukla midesinde acı yahut balgam ya da irin karışımları da bulunabilir. İşte bu bulamaç, bütün bunları mideden temizler, parlatır. Hadiste buna \"hoşa gitmeyen faydalı\" adının verilmesinin sebebi ise, hastanın kendisine faydalı olduğu halde bunu istememesi, canının onu çekmemesidir. Oysa çoğunlukla arpa ile beslenen kimseler için bulamaçtan daha faydalı bir şey yoktur. Çoğunlukla buğday ile beslenen kimseler için ise, hastalığı esnasında arpa hisası (çorbası) daha faydalıdır. el-Hüda adlı eserin müellifi ise şöyle demektedir: Telbine (bulamaç), hisadan (çorbadan) daha faydalıdır. Çünkü telbine öğütülmüş olarak pişirilir ve öğütülürken de arpanın hülasası çıkaıotılır. Bu ise daha besleyici, daha çok güçlü etki yapan ve daha çok parlatan, cilalandıran bir şeydir. Doktorların iyice pişmiş olanı tercih etmelerinin sebebi ise daha ince ve latif (yumuşak) oluşundan dolayıdır. Bundan dolayı hastanın tabiatına da ağır gelmez. Çeşitli bölgelerdeki adetlerin farklılığına göre bundan da farklı şekilleriyle faydalanmak gerekir. Muhtemelen hastaya daha uygun olan, tanelel'in bütün olarak pişirilmesi halidir. Üzüntülü olan kimseye ise öğütülmüş olarak pişirilmiş hali iyi gelir. Buna sebep ise, az önce işaret edildiği gibi aralarındaki özellik farkıdır. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 13
			}
		}
	]
}