{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5716,
			"arabicnumber": 5716,
			"text": "Ebu Said'den, dedi ki: \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'e gelerek: Benim kardeşim ishal oldu, dedi. Allah Rasulü: Ona bal içir, buyurdu. O da ona bal içirdi. Daha sonra adam: Ben ona bal içirdim. Ama bu onun ishalini artırmaktan başka bir işe yaramadı, dedi. Bunun üzerine Allah Rasulü: Allah doğru söylemiştir. Senin kardeşinin karnı ise yalan söylemiştir, buyurdu.\" Fethu'l-Bari Açıklaması: \"Karın hastalığına yakalanmış kimsenin tedavisi.\" Karın hastalığına yakalanmış olan (el-mabtCın), aşırı ishalden dolayı karnından rahatsız olan kimse demektir. Bunun birçok sebebi vardır. \"Ona bal içir, buyurdu.\" Kasıt, arı balıdır. Araplarca meşhur olan da budur. Emrin zahirinden anlaşıldığına göre balın katıksız olarak içilmesini istemiştir. Ancak karışım halinde (şerbet olarak) içirilmesini kastetmiş olma ihtimali de vardır. Nebi Sallallahu Aleyhi ve Sellem'in \"kardeşinin karnı yalan söylemiştir\" buyruğuile bu ilacın faydalı olduğuna, hastalığın devam etmesinin ise ilacın özü itibariyle kusurlu olmasından kaynaklanmadığına, ancak hastalığın sebebi olan o bozucu maddenin çok yoğun olduğuna bir işarettir. Bundan dolayı bu bozucu maddenin büsbütün boşaltılması için kardeşine tekrar bal içirmesini emir buyurmuştur. Nitekim böyle olmuş ve Allah'ın izniyle hasta iyileşmişti. \"Kitabu'l-Mieti fı't-Tıb\" adlı eserin müellifi der ki: Bal bazen damarlara hızlıca sirayet eder ve bal ile birlikte gıdaların büyük bir bölümü de kana nüfuz eder. İdrar söktürür ve kabz da yapabilir. Bazen de midede kalarak mideyi harekete geçirip yemeği iter ve ishal yapar. Dolayısı ile ishal olan birisine tedavi için tavsiye edilmesini mutlak olarak kabul etmemek, bunu kabul etmeyenin anlayışsızlığındandır. Başkaları da şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in tıbbının iyileştirid olduğu kesindir. Çünkü o vahiyden sadır olmuştur. Başkasının tıbbının ise çoğunlukla kaynağı, tahmin ya da deneydir. Nebevı tıbbı kullanan bazı kimselerin iyileşmesi gecikebilir. Buna sebep ise o tıbbı kullanan kimsenin o yolla şifa bulacağına dair inancının zayıflığı ve onu kabul ile karşılamasındaki yetersizliğidir. Bunun en açık misali ise kalplerde bulunanlara şifa olan Kur'an-ı Kerim'dir. Bununla birlikte bazı insanların kalplerinde bulunanlara şifa olmayabilir. Buna sebep ise o kimsenin itikadındaki ve onu kabul ile karşılayışındaki eksikliktir. Hatta münafık olan kimsenin murdarlığına murdarlık, hastalığına hastalık katmaktan başka bir şey de yapmaz. O halde Nebevı tıp, ancak hoş ve temiz bedenlere uygundur. Nitekim Kur'an-ı Kerim'in şifası da .ancak iyi kalpler ile uyum arz eder. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 33
			}
		}
	]
}