{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5729,
			"arabicnumber": 5729,
			"text": "Abdullah b. Abbas'tan rivayete göre; \"Ömer b. el-Hattab r.a., Şam (Suriye)'a çıktı. Nihayet Serğ denilen yere varınca orduların kumandanıarı -Ebu Ubeyde b. el-Cerrah ve arkadaşları- onu karşıladılar ve ona Şam topraklarında vebanın ortaya çıkmış olduğunu haber verdiler. İbn Abbas dedi ki: Bunun üzerine Ömer: Bana ilk muhacirleri çağırınız, dedi. Onları çağırttı ve onlarla istişare etti. Onlara Şam'da vebanın baş gösterdiğini haber verdi. Onlar anlaşmazlığa düşerek kimisi: Biz bir iş için çıkmıştık, dolayısıyla onu görmeden geri dönmek görüşünde değiliz, dedi. Kimileri: Seninle beraber bulunanlar, insanların (iyilerinin) geriye kalanları ve Rasulullah Sallallahu Aleyhi ve Sellem'in ashabıdırlar. Bu sebeple onları alıp bu vebanın üzerine götürmeni uygun görmüyoruz, dediler. Ömer: Haydi yanımdan çıkın, dedi. Daha sonra: Bana ensarı çağırın, dedi. Ben de onları çağırdım. Ömer de onlarla istişare etti. Onlar da muhacirlerin gittikleri yoldan gittiler ve onların anlaşmazlıkları gibi anlaşmazlığa düştüler. Yine Ömer: Yanımdan gidiniz, dedi. Daha sonra: Sen bana burada fetih muhacirlerinden olup Kureyş'in yaşlılarından olanları çağır, dedi. Ben de onları çağırdım. Bu hususta ona karşı iki kişi dahi ihtilaf etmeyerek: Biz senin insanları alıp geri dönmen ve onları bu vebanın bulunduğu yere götürmemen görüşündeyiz, dediler. Bunun üzerine Ömer de' ahali arasında: Ben sabahleyin dönmek üzere bineğimin üzerinde olacağım, siz de sabahleyin bineğinizin üzerinde olunuz, diye nida ettirdi. Ebu Ubeyde b. el-Cerrah bunun üzerine: Allah'ın kaderinden kaçış mı bu, dedi. Ömer: Bu sözü keşke senden başkası söylemiş olsaydı ey Ebu Ubeyde. Evet, biz Allah'ın kaderinden yine Allah'ın kaderine kaçıyoruz. Şimdi bana görüşünü söyle. Senin develerin olsa ve birisi merası bol, diğeri kurak olmak üzere iki tarafı birbirinden farklı bir vadiye insen, develerini merası bolalan yerde de otlatsan Allahlın kaderiyle otlatacaksın. Kurak olan yerde de otlatsan Allah'ın kaderiyle otlatacaksın değil mi, dedi. İbn Abbas dediki: Bir süre sonra bazı ihtiyaçlarını görmek üzere huzurda bulunmayan Abdurrahman b. Avf çıkageldi ve: Bu hususta benim bir bilgim vardır. Ben Rasulullah Sallallahu Aleyhi ve Sellem'j şöyle buyururken dinledim, dedi: Sizler onun bir yerde baş gösterdiğini işitirseniz bulunduğu yere gitmeyiniz. Sizin bulunduğunuz bir yerde baş gösterirse ondan kaçmak amacıyla bulunduğunuz yerden çıkmayınız. Abdullah b. Abbas dedi ki: Bunun üzerine Ömer Allah'a hamd etti, sonra da yoluna koyulup gitti.\" Bu Hadis 5730 ve 6973 numara ile de geçiyor",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 44
			}
		}
	]
}