{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5729,
			"arabicnumber": 5729,
			"text": "Abdullah İbn Abbâs radıyallahü anhüma'tan (o, şöyle demiştir): Omer ibn Hattâb, Şam'a doğru yola çıktı. Nihayet (Yermûk yakınında bir köy olan) Serğ'a vardığı zaman ordu kumandanları Ebû Ubeyde ibnu'l-Cerrâh ve arkadaşları kendisini karşıladılar ve Şâm arazîsinde veba hastalığı vuku' bulduğunu ona haber verdiler. Abbâs dedi ki: Omer: İlk Muhacirler'i bana çağır, dedi. çağırdı da onlarla istişare etti ve onlara Şam'da veba vâki' olduğunu haber verdi. Onlar (gitmek veya geri dönmek hususunda) ihtilâf ettiler. Bâzısı: Bir iş için çıkmışsın, o işten geri dönmeni doğru bulmayız. da: İnsanların bakıyyesi ve Rasûlüllah'ın arkadaşları seninle beraberdirler. Onları şu veba üzerine götürmeni doğru görmeyiz, dediler. onlara: Yanımdan çıkın! dedi. Sonra: Ensâr'ı bana çağır, dedi. onları da Omer'in yanına da'vet ettim. Omer onlarla da istişare etti. Onlar da Muhâcirler'in yoluna girdiler ve onların ihtilâfları gibi ihtilâf ettiler. Bunun üzerine Omer onlara da: Yanımdan çıkın! dedi. Sonra: Kureyş ihtiyarlarından, fetih Muhacirler'inden burada bulunanları bana çağır, dedi. onları çağırdım. Onlardan ikisi bile Omer'e karşı ihtilâf etmedi. Onlar: İnsanları geriye döndürmeni ve halkı şu veba üstüne götürmemeni doğru görürüz, dediler. üzerine Omer, insanlar arasında şöyle nida ettirdi: Ben sabahleyin bineğime binip geri döneceğim. Binâenaleyh siz de buna göre (hazırlanıp) sabahlayın, dedi. Ubeyde ibnu'l-Cerrâh: Allah'ın kaderinden mi kaçıyorsun? dedi. Omer: Keski bunu senden başkası söyleseydi yâ Ebâ Ubeyde! Evet Allah'ın kaderinden yine Allah'ın kaderine kaçıyoruz. Şuna ne dersin: Şayet senin develerin olsa, iki yamacı olan bir vâdîye inseler -yahut indirsen- o yamaçlardan biri münbit, diğeri ise otsuz olsa, sen develeri bitek yerde gütsen, Allah'ın kaderi ile gütmüş; otsuz yerde gütsen, yine Allah'ın kaderi ile gütmüş değil misin? dedi. Abbâs dedi ki: Abdurrahmân ibn Avf, bir haceti yüzünden ortalıkta yok iken bu sırada çıkageldi ve şöyle dedi: Bu hususta bende bir ilim vardır ki, ben onu Rasûlüllah(sallallahü aleyhi ve sellem)'tan işittim şöyle buyuruyordu: \"Bu hastalığın bir yerde çıktığını işittiğiniz zaman oraya gitmeyiniz. Hastalık sizin bulunduğunuz yerde vâki' olursa, ondan kaçmak için sakın o yerden dışarı çıkmayınız!\" Bunun üzerine Omer, Allah'a hamdetti, sonra ayrıldı, demiştirtir",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 44
			}
		}
	]
}