{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5736,
			"arabicnumber": 5736,
			"text": "Ebu Said el-Hudrl r.a.'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem'in ashabından bazı kimseler, Arap kabilelerinden bir kabilenin bulunduğu yere gitti. Bu kabile onları misafir etmedi. Onlar bu durumda iken efendileri zehirli bir hayvan tarafından sokuldu. O kabile halkı: Sizinle birlikte buna dair bir ilaç ya da rukye yapacak bir kimse var mı, dediler. Nebiin ashabı:Siz bizi misafir etmediniz. Bu iş için bize bir ücret tayin etmedikçe böyle bir şey yapmayız, dediler. Bunun üzerine onlara bir sürü koyun vaat ettiler. Bir sahabi Ummu'I-Kur'an'l (Fatiha'yı) okumaya koyuldu. Tükürüğünü topluyor, sonra da (hastanın üzerine) tükürüyordu. Bunun sonucunda adam iyileşince onlar da koyun sürüsünü alıp geldiler. Ashab: Nebi Sallallahu Aleyhi ve Sellem'e sormadan onu almayız, dediler. Nebie durumu sorunca, güldü ve: Bunun (Fatiha suresinin) bir rukye olduğunu nereden bildin? O koyunları alınız ve bana da bir pay ayırınız, buyurdu.\" Fethu'l-Bari Açıklaması: \"Fatihatu'l-Kitab ile rukye yapmak. Bu İbn Abbas'tan, o Nebi Sallallahu Aleyhi ve Sellem'den diye zikrolunmaktadır.\" Bu başlıkta Buhari, Ebu Said yoluyla rivayet edilen hadisi zikretmektedir. Buna dair açıklamalar yeterli bir şekilde İcaare bölümünde (2276.hadiste) geçmiş bulunmaktadır. İbnu'l-Kayyim dedi ki: Bazı sözlerin birtakım özellikleri ve faydaları bulunduğu sabit olduğuna göre, alemlerin Rabbinin sözü olduğundan, Kitabın bütün manalarını ihtiva ettiğinden ötürü Kur'an-ı Kerim'de olsun, onun dışındaki diğer kitaplarda olsun, benzeri indirilmemiş bulunan Fatiha hakkında ne düşünülebilir? Bu sure, Allah'ın isimlerinin temelini teşkil eden ve bunları kendilerinde toplayan anaisimleri ihtiva ettiği gibi, ölümden sonra dirilişi, tevhidi, kendisinden yardım ve hidayet istemek hususunda yüce Rabbe ihtiyacı kapsamaktadır. En faziletli duayı da söz konusu etmektedir. Bu en faziletli dua da dosdoğru yola iletilmeyi istemektir. Dosdoğru yol, Allah'ı kemal derecesinde bilmeyi, onu tevhid etmeyi ve kendisine verdiği emirleri işleyip, yasaklarından sakınmak suretiyle ibadet etmeyi, bu yol üzere de dosdoğru yürümeyi ihtiva eder. Diğer taraftan bu sure, yaratılmışların çeşitli türlerini de ihtiva etmiş ve onları hakkı bilip gereğince amel ettiği için nimete mazhar olanlar ile hakkı bildikten sonra ondan saptığı için gazaba uğrayanlar ve hakkı büsbütün bilmediğinden ötürü de dalalete düşenler kısımlarına ayırmaktadır. Bununla birlikte bu sure kaderi, şeriatı, Allah'ın isimlerini, ölümden sonra dirilişi, tevbeyi, nefsin tezkiye edilmesini, kalbin ıslah edilmesini, bütün bid'at ehlinin görüşlerinin reddini de kapsamaktadır. Bazı özellikleri bu olan bir surenin her türlü hastalıktan şifa dilemek için okunması da onun şanındandır, özelliklerindendir. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 51
			}
		}
	]
}