{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5765,
			"arabicnumber": 5765,
			"text": "Aişe r.anha'dan, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem'e büyü yapılmıştı. Öyle ki o, hanımlarına yaklaşmadığı halde onda onlara yaklaştığı izlenimi olurdu. -Ravilerden Süfyan dedi ki: İşte bu böyle olduğu takdirde sihirden dolayı en şiddetli rahatsızlık olur.- Allah Rasulü: Ey Aişe! Allah'ın benim kendisinden hakkında fetva sorduğum hususta bana fetva verdiğini biliyor musun? Banaiki adam geldi. Onlardan birisi başımın yanında, diğeri de ayaklarımın yanında oturdu. Başımın yanında oturan kişi diğerine: Bu adamın hali nedir, diye sordu. O: Ona büyü yapılmıştır, dedi. Öbürü: Peki ona kim büyü yaptı, diye sordu. O: Yahudiler ile antlaşmalı Zureyk oğullarından bir adam olan Lebid b. el-A'sam dedi. -O da münafıktı- Sihri neyin içinde yapmış, diye sordu. O: Bir tarakta ve taranırken dökülen saçlarda, dedi. Bu sihir nerede, diye sordu. O: Zervan kuyusunda büyükçe bir taşın altında, erkek hurma çiçeğinin kurumuş kapçığında, dedi. Aişe dedi ki: Nebi Sallallahu Aleyhi ve Sellem kuyuya gitti ve sonunda onu Çıkardı. Daha sonra: İşte bana gösterilmiş olan kuyu budur. Onun suyu sanki kına ıslatılmış su gibi idi ve sanki etrafındaki hurma ağaçlarının başları da şeytanların başları gibidir, buyurdu.\" Ravilerden Süfyan dedi ki: Ve sihir çıkarıldı. Aişe dedi ki: \"Ben: Sihirden kurtulmak için sana ilaç verilmedi mi, diye sordum. O şöyle dedi: Buna gelince, Allah'a yemin ederek söylüyorum ki Allah bana şifa vermiş bulunuyor ve ben insanlardan herhangi bir kimsenin aleyhine şerri harekete getirmek istemiyorum.\" Fethu'l-Bari Açıklaması: \"Katade dedi ki: Said b. el-Müseyyeb'e ... dedim.\" İbnu'l-Cevzı dedi ki: Nüşra denilen şey, sihrin büyülenmİş kimseden çözülmesi, etkisinin giderilmesidir. Buna hemen hemen sihri bilenden başkasının gücü yetmez. Ahmed'e, büyü yapılmış birisinden büyüyü çözen kimsenin durumu hakkında soru sorulmuş, o da: Bunda bir sakınca yoktur, diye cevap vermiştir. Kabul edilen görüş budur. \"Nüşra (büyüyü çözmek) şeytanın işindendir\" diye gelen rivayete de şöyle cevapverilir: Bununla nüşranın aslına işaret edilmektedir. Hükmü maksada göre değişir. Bunu yapmaktan maksadı hayır olan kimsenin bu yaptığı da hayır olur. Aksi takdirde şer olur. Diğer taraftan el-Hasen'den nakledilen (mekruh olduğuna dair sözü) zahirine göre kabul edilmemelidir. Çünkü bazen rukye, dua ve sığındırıcı dualar ile büyü çözülebilir. Bununla birlikte nüşranın iki tür olma ihtimali de vardır .. \"Hanımına yaklaşamayan\", yani hanımına yaklaşamayıp onunla cima' edemeyen ... \"Ona nüşra yapılabilir mi?\" Bu da büyülendiği zannedil2n ya da cinlerin zarar verdiği zannedilen kimseye yapılan bir tedavi ve bir ilaççeşididir. Said b. el-Müseyyeb'in nakledilen sözüne daha önce Rukye başlığında kaydettiğimiz Müslim'de yer alan Cabir yoluyla gelenmerfu' hadisteki: \"Kim kardeşine faydalı bir şey yapabilirse onu yapsın\" ifedeleri de uygun düşmektedir. Ayrıca daha önce \"nazar değmesi haktır\" Qadisinde geçen nazarı değen kimsenin gusletmesi ile ilgili hadis de nüşranın meşruiyetini desteklemektedir. Nüşranın caiz olduğunu açıkça ifade edenler arasında Şafil'nin arkadaşı el-Müzenı, Ebu Cafer et-Taberı ve başkaları da vardır. \"Ağır bir taşın altında bir hurma çiçeği kapçığında.\" el-Kuşmihenı rivayetinde (ağır taş anlamını verdiğimiz) raCrfe kelimesi ra harfi medli olarak \"raufe\" şeklindedir. Bu da kuyunun ağzına konulan ve su çekenin üzerinde dikildiği, yerinden sökülemeyen taş demektir. Ek Bir Bilgi: İbnu'l-Kayyim der ki: Kötü ruhların tesirlerinden ibaret olan büyüye karşı duran ve büyüyü çözmek için var olan en güçlü ve en faydalı tedavi zikir, dua ve kıraat gibi ilahı ilaçlarla (devalarla) yapılanıdır. Çünkü kalp Allah ile dopdolu, O'nun zikri ile mamur olup, ihmal etmeyip aksatmadığı zikir, dua ve teveccüh türünden virdleri bulunuyor ise, şüphesiz ki bu, o kimseye büyünün isabet etmesini engelleyen en büyük sebepler arasındadır. Büyünün tesir kabiliyeti, zayıf kalpler üzerindedir. Bundan dolayı sihir çoğunlukla kadınlarda, çocuklarda ve cahillerde etki gösterir. Zira kötü ruhlar, ancak kendilerine uygun ve ondan etkilenmeye hazır gördükleri ruhlara karşı faaliyete geçerler.(İbnu'l-Kayyim'den özetle) Ancak bu başlıktakihadis ile makamının azametine, Allah'a yönelmesindeki sadakatine ve virdine ısrarla devam etmesine rağmen, büyünün Nebi Sallallahu Aleyhi ve Sellem'i etkilemesinin mümkün oluşu, bu açıklamaları pek haklı kılmamaktadır. Fakat bundan şöylece kurtulmak mümkündür: Onun söz konusu ettiği bu durum çoğunlukla görülen hal hakkında yorumlanır. Nebi Sallallahu Aleyhi ve Sellem'in karşı karşıya kaldığı hal ise bunun caiz oluşunu beyan etmek içindir. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 79
			}
		}
	]
}