{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"76": "Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5766,
			"arabicnumber": 5766,
			"text": "Aişe'den, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'e büyü yapıldı. Öyle ki, o bir işi yapmadığı halde onu yapmış gibi tahayyül ediyordu. Nihayet bir gün benim yanımda iken, Allah'a ardı arkasına dua edip durdu. Sonra: Ey Aişe! Farkında mısın Allah bana hakkında kendisinden fetva istediğim bir hususta fetva verdi, dedi. Ben: Bu dediğin nedir, ey Allah'ın Rasulü, dedim. Bana dedi ki: Yanıma iki adam geldi. Onlardan biri başımın yanında, diğeri ayaklarımın yanında oturdu. Sonra onlardan biri diğerine: Bu adamın rahatsızlığı nedir, dedi. O: Ona sihir yapıldı, dedi. Ona kim sihir yaptı, diye sordu. Diğeri: Zureyk oğullarından Yahudi Lebid b. el-A'sam, dedi. Bu sihir ne ile yapıldı, diye sordu. O: Bir tarak, taranırken dökülen saç ile erkek hurma çiçek kapçığı içinde, dedi. Peki o nerededir, diye sordu. Diğeri: Zu Ervan kuyusunda, dedi.\" Ravi dedi ki: Nebi Sallallahu Aleyhi ve Sellem ashabından birkaç kişi ile birlikte kuyuya gitti. O kuyuya baktı. Üzerinde bazı hurma ağaçları da vardı. Sonra Aişe'ye döndü ve: Allah'a yemin ederim. Sanki onun suyu ıslatılmış kına gibi idi ve sanki onun hurma ağaçları şeytanların başları gibi idi, dedi. Aişe dedi ki: \"Ey Allah’ın Rasulü! O sihir yapılan şeyleri çikardın mı, diye sordum. O: Hayır, Allah bana afıyet ve şifa vermiş bulunuyor. Ayrıca ben bundan dolayı insanlar aleyhine bir şerri harekete geçirmekten korktum, dedi ve emir vererek kuyu kapatıldı.\" Fethu'l-Bari Açıklaması: \"Sihir.\" Bu hadis, sihirbazın eğer bir ahdi (güvenlik ve teminatı) var ise had uygulanmak suretiyle öldürülmeyeceğine delil gösterilmiştir. İbn Battal dedi ki: İmam Malik ve Zühri'ye göre kitap ehline mensup sihirbaz öldürülmez. Ancak yaptığı sihir ile başkasının ölümüne sebep olursa öldürülür. Bu Ebu Hanife'nin ve Şafii'nin de görüşüdür. Malik'ten rivayete göre eğer yaptığı sihir ile herhangi bir müslümana kendisine verilen ahdin kapsamında olmayan bir zarar verdiği takdirde, bu yaptığı sebebiyle ahdini bozmuş olur ve onu öldürmek de helal olur. Nebi Sallallahu Aleyhi ve Sellemlin Lebid b. el-A'sam'ı öldürmeyişinin sebebi, onun kendi adına kimseden intikam almamasıdır. Ayrıca onu öldürdüğü takdirde bu sebeple Müslümanlar ile Lebid'in antlaşmalı bulunduğu ensar arasında bir fitnenin ortaya çıkmasından korkmuştu. Bu da Nebi Sallallahu Aleyhi ve Sellem'in münafıkları öldürmeyi terk ederken göz önünde bulundurduğu masıahat kabilindendir. Lebid ister Yahudi, ister daha önce bu husustaki görüş ayrılıklarında geçtiği gibi münafık olsun, fark etmez. (İbn Battal) dediki: Malik'e göre sihirbazın hükmü, zındıkın hükmü ile aynıdır. Onun tevbesi kabul edilmez ve bu husus, hakkında sabit olduğu takdirde had olarak öldürülür. Ahmed de böyle demiştir. Şafii ise şöyle demektedir: Sihirbaz, kendi sihri ile öldürdüğünü itiraf etme\" . dikçe öldürülmez. İtiraf halinde bu itirafı dolayısıyla öldürülür. Eğer yaptığısihrin bazen öldürdüğünü, bazen öldürmediğini ve o kişiye sihir yaptığını ve daha sonra öldüğünü itiraf ederse ona kısas uygulamak gerekmez. Ama onun malından diyet almak icab eder, akilesinden değiL. Sihir ile öldürmenin beyyine (delil) ile sabit olması düşünülemez. Nevevi der ki: Eğer sihirde küfrü gerektiren söz yahut fiil bulunuyor ise sihri yapan kişİ kafır olur. Tevbe ettiği takdirde bize göre (Şafii mezhebinde) tevbesi kabul edilir. Eğer sihrinde küfrü gerektiren bir husus yoksa tazir uygulanır ve tevbe etmesi istenir",
			"grades": [],
			"reference": {
				"book": 76,
				"hadith": 80
			}
		}
	]
}