{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5785,
			"arabicnumber": 5785,
			"text": "Ebu Bekre r.a.'dan, dedi ki: \"BizIer Nebi Sallallahu Aleyhi ve Sellem'in huzurunda iken güneş tutuldu. AceIe edip eIbisesini sürükleyerek kalktı ve nihayet mescide geIdi. İnsanIar da mescide döndüIer. İki rekat namaz kII(dır)dı. Güneş tutuIması da geçti. Sonra bize yöneIerek şöyIe buyurdu: Şüphesiz güneş ve ay, AlIah'ın ayetlerinden iki ayettir. OnIarda bu kabiIden bir şey görecek oIursanız, AlIah onu açıp giderinceye kadar namaz kılıp dua ediniz.\" Fethu'l-Bari Açıklaması: \"Kibire kapılmaksızin izarını yerde sürükleyen kimse.\" BöyIe bir kişi sözü geçen tehditle istisna edilmiştir. Ama bu bir mazeret sebebiyIe ise, onun için bir veba! yoktur. Herhangi bir mazeretinin buIunmamasl hali ile ilgili açıklamalar da ileride geIecektir. \"Gevşeyip sarkıyar.\" Gevşeyip sarkmasının sebebi, Ebu Bekr'in bedenen zayıf oIuşu idi. \"Bu hususta ona dikkat etmeyecek oIursam\", yani eğer gerektiği gibi dikkat etmezsem gevşeyip sarkar. Ma'merlin, Zeyd b. EsIem'den diye nakIettiği, Ahmed'de yer alan rivayette: \"Şüphesiz benim izarım bazen gevşeyip sarkıyor\" şeklindedir. Muhtemelen izarını bağladıktan sonra hareket edip yürüdüğünde yahut başka bir sebeple, kendi isteği olmadan çözülüyor; ona gerektiği gibi dikkat ederse çözülmüyormuş. ÇÜnkü gevşemeye yüz tuttukça onu bir daha sıkıştırıp bağlıyormuş. İbn Sa'd, Talha b. Abdullah b. Abdurrahman b. Ebi Bekr yoluyla Aişe'den şöyle dediğini rivayet etmektedir: \"Ebu Bekr oldukça zayıftl. İzarı yerinde durmaz ve onu düğümleyip bağladığı yerden gevşeyip sarkardı.\" \"Sen bunu büyüklenerek yapanlardan değilsin.\" Zeyd b. Eslem yoluyla gelen rivayette: \"Sen bunlardan değilsin\" şeklindedir. Hadisten anlaşıldığına göre mutlak olarak, bir kasıt olmaksızın yerde izarı sürüklenen kimse için bir vebal yoktur. İbn Ebi Şeybe'nin, İbn Ömer'den her durumda izarı yerde sürükleyip çekmeyi mekruh gördüğüne dair rivayeti hakkında İbn Battal: Bu, onun işi oldukça sıkı tuttuğu hususlardan birisidir, diye açıklama yapmıştır. Yoksa bu başlıktaki hadisi bizzat kendisi rivayet etmiş bulunmaktadır. Dolayısıyla bunun hükmü de onun için gizli değildir. Derim ki: Hayır, İbn Ömer'in bunu mekruh görmesi, ister büyüklenmek amacıyla olsun, ister olmasın kasten elbisesini sarkıtan herkes hakkında yorumlanır. Böyle bir açıklama da onun sözü geçen rivayetine uygundur. İbn Ömer'in herhangi bir amacı olmayan kimseyi sorumlu tutacağı zannedilmemelidir. O, bu işin mekruh olduğunu, izarı kendi isteği olmadığı halde yerde sürüklenen, sonra da bu halini devam ettirip bunu telafi etmeyen kimseyi kastederek söylemiştir. Bu hususta da görüş birliği vardır. Bununla birlikte (ilim adamları) buradaki kerahetin tahrimı ya da tenzihı olduğu hususunda ihtilaf etmişlerdir. Hadisten, hükümler hususunda şahısların farklı hallerinin göz önünde bulundurulacağı da anlaşılmaktadır. Bu da çoğunlukla göz önünde bulundurulması gereken bir esastır. \"Bana Muhammed tahdis etti\" diye başlayan (Ebu Bekre'nin rivayet ettiği) hadis, daha önce Küsuf namazı bahsinde açıklamasıyla geçmiş bulunmaktadır. Burada bu hadisin zikredilmesinden maksat, \"acele ederek elbisesini yerde sürükleyerek kalktı\" ibaresidir. Buradan elbisenin yerde sürüklenmesi, acele etme sebebiyle olmuşsa, yasağın kapsamına girmeyeceği anlaşılmaktadır. Böylelikle bu yasağın, sadece büyüklenmek maksadı ile olması haline mahsus olduğu anlaşılmaktadır. Bununla birlikte buradaki yasağın, -ileride yüce Allah'ın izniyle açıklanacağı gibi, uzunluğundan ötürü yerde sürüklenen kamis (entari) ve bu gibi elbiseleri giymenin caiz olduğunu söyleyecek kadar- yalnızca büyüklenmek kastı ile olması haline mahsus olduğunu kabul edenlerin lehine delilolacak bir taraf yoktur. \"İnsanlar döndüler\" ibaresi: mescidden çıkmış olduktan sonra mescide geri döndüler, demektir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 3
			}
		}
	]
}