{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5791,
			"arabicnumber": 5791,
			"text": "Şu'be'den, dedi ki: Muharib b. Disar ile bir atın üzerinde olduğu halde karşılaştım. Hakimlik yaptığı yerine doğru gidiyordu. Ona bu hadisi sordum. Bana tahdis ederek dedi ki: Ben Abdullah b. Ömer r.a.'ı şöyle derken dinledim: Rasulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kim büyüklenerek elbisesini yerde sürüklerse kıyamet gününde Allah ona bakmayacaktır.\" Ben 'Muharib'e: İzarını söz konusu etti mi, diye sordum. Muharib: Özel olarak ne izar, ne kamis söz konusu etti, dedi. Ayrıca Salim'den, o İbn Ömer'den, onun Nebi Sallallahu Aleyhi ve Sellem'den: \"Kim elbisesini büyüklenerek sürüklerse ... \" dediği rivayet edilmiştir. Fethu'l-Bari Açıklaması: \"Büyüklenerek elbisesini yerdesürükleyen kimse.\" Büyüklenmek sebebiyle elbisesini yerde sürükleyen kimse, demektir. \"Allah ona bakmaz.\" Ona merhamet etmez, demektir. Bakmak, yüce Allah'a izafe edildiği vakit mecaz olur. Yaratılmışa izafe edildiğinde ise kinaye olur. Maksad: Allah ona rahmet nazarıyla bakmama ihtimalinin bulunduğudur. Hocamız Tirmizi Şerhi'nde şunları söylemektedir: Burada, bakma esnasında söz konusu olan hali ifade etmektedir. Çünkü bir kimse mütevazi olana bakarsa, ona merhamet eder. Büyüklük taslayana bakarsa ona gazap eder. O halde rahmet ve gazap, bakmak dolayısıyla söz konusu olan sonuçlardır. Bakmayı rahmet ya da gazap olarak yorumlayanların bu açıklamalarını Taberanı'nin rivayet ettiği hadis de desteklemektedir. Bu hadisin aslı Ebu Davud'da, Ebu Curey yoluyla rivayet edilmiştir: \"Sizden öncekilerden bir adam bir burde giyindi ve onunla büyüklenerek, çalımlı çalımlı yürüdü. Allah ona baktı vegazap etti; arza emretti, bunun Üzerine arz da onu içine ald!.\" \"Men: Kimse\" sözü geçen tehditte, o özel fiile karşılık erkekleri de, kadınları da kapsamına. alır. Ümmü Seleme radıyallahu an ha bu anlamı çıkarmış idI. Nesai ve sahih olduğunu belirterek Tirmizi, Eyyub yoluyla Nafi'den, o İbn Ömer'den muttasıl olarak birinci babda zikredilen hadis ile birlikte şunları da söylemektedir: \"Bunun üzerine Ümmü Seleme dedi ki: Peki kadınlar elbiselerinin eteklerini ne yapsın? Allah Rasulü: Bir karış sarkıtırlar, buyurdu. Ümmü Seleme: O takdirde ayakları açılır, dedi. Allah Rasulü: Elbiselerini bir arşın sarkıtırlar ve daha fazlasını sarkı tm azı ar, buyurdu.\" Lafız Tirmizi'ye aittir. Nevevi dedi ki: Hadislerin büyüklenerek sürüklemek kaydı ile zikredilmiş olmalarının zahiri ifadeleri, haram kılmanın sadece büyüklenme haline özel olmasını gerektirir. Ancak ona şöylece itiraz edilmiştir: Eğer durum böyle olsaydı, Üm mü Seleme'nin elbiselerini yerde sürüklemelerine dair kadınların hükmünü sormasının bir anlamı olmazdı. Aksine Ümmü Seleme, büyüklenerek olsun olmasın elbiseleri uzatıp yerde sürüklemenin yasaklandığını anlamış, bundan dolayı bu hususta avretlerini setretmek için elbiselerini sarkıtma ihtiyaçları dolayısı ile kadınların hükmünü sormuştur. Çünkü kadının bütün ayağı avrettir. Nebi Sallallahu Aleyhi ve Sellem de Ümmü Seleme'ye bu hususta onların hüküm itibariyle sadece bu mana çerçevesinde erkeklerin hükmü dışında olduklarını beyan etmiştir. İyad, bu hususta yasağın, kadınlar dışında erkekler hakkında söz konusu olduğunun icma' ile kabul edildiğini nakletmektedir. Onun kastettiği yasak, elbiseleri sarkıtmanın yasaklandığıdır. Çünkü Nebi Sallallahu Aleyhi ve Sellem, Ümmü Seleme'nin o anlayışını takrir etmiş (doğru kabul etmiş)tir. Ancak ona, bu işin hükmü özelleştirilmiş umumi bir hüküm olduğunu beyan etmiştir. Çünkü verdiği cevabında elbise sarkıtmak bakımından erkekler ve kadınlar arasında fark olduğunu beyan etmiştir. Aynı şekilde kadınların daha fazlasını uzatmalarının yasak olduğu miktarı da erkekler hakkındaki miktarı açıkladığı gibi açıklamıştır. Hu/asa, erkeklerin iki hali söz konusudur. Biri müstehaplık halidir, o da izarın baldırların ortasına kadar gelmesidir. Cevaz hali ise topuklara kadar olmasıdır. Kadınların da aynı şekilde iki hali söz konusudur. Müstehaplık hali erkekler için caiz olan miktardan bir karış kadar uzun olmasıdır. Cevaz hali de bir arşın kadar uzatılmasıdır. Hadislerden Çıkan Sonuçlar 1- Elbisenin yerde sürüklenmesi kaydı, çoğunlukla görülen hali anlatmak içindir. 2- Azginlık ve böbürlenmek, isterse elbiselerini çemremiş olsun, yerilen bir şeydir. 3- Delillerin toplamından anlaşıldığına göre güzel elbise giymek suretiyle Allah'ın üzerindeki nimetini göstermek isteyen ve bu nimetini hatırında tutarak ona şükreden,kendisi gibi olmayan kimseyi hakir görmeyen kişiye giydiği mubah şeylerin zararı olmaz. İsterse oldukça nefis elbiseler giyinsin. Çünkü Müslim'in Sahih'inde İbn Mesud'dan şöyle dediği rivayet edilmektedir: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Kalbinde kibir namına zerre ağırlığı kadar bir şey bulunan bir kimse cennete girmeyecektir. Bir adam: Ya kişi elbisesinin güzel, ayakkabısının güzelolmasını severse, diye sordu. Allah Rasulü: Şüphesiz Allah güzeldir, güzelolanı sever. Kibir denilen şey, hakka karşı gelmek ve insanları hakir görmektir, buyurdu.\" \"Elbisesinde (hullesinde) yürürken.\" Hulle denilen şey, biri diğerinin üstünde giyilen iki elbisedir. İzar ve rida olduğu da••söylenmiştir. Daha meşhur olan budur. \"Kendisini beğenerek.\" Kurtubi dedi ki: Kişinin kendisini beğenmesi (ucb), Allah'ın nimetini unutmakla beraber kendisine mükemmel nazarıyla bakmasıdır. Eğer bununla birlikte başkasını da hakir görecek olursa işte bu, yerilen kibirdir. \"O kıyamete kadar içine gömülüp durur.\" İbn Ömer'in hadisinde: \"Kıyamet gününe kadar yerin içinde gömülüp durur\" şeklindedir. İbn Ffuis dedi ki: \"Te celcül (gömülüp durmak)\", şiddetli sarsıntı ile birlikte yerin dibine dalıp gitmek ve bir taraftan öbür tarafa itilmektir. Yani o yerde gömülüp durmaktadır. İtilerek, sarsıntı ile içine doğru inip durmaktadır, demektir. \"Hüküm verdiği yerine.\" Çünkü Muharib, Kufe Hakimliği görevini kabul etmişti. Abdullah b. İdris el-Evdi babasından şöyle dediğini nakletmektedir: \"Ben el-Hakem'i ve Hammad'ı kaza meclisinde gördüm.\" Simak b. Harb da dedi ki: \"Cahiliye dönemi insanları arasında bir kimsede altı özellik bulundu mu onu efendi ve önder kabul ederlerdi. Hilm, akıl, cömertlik, kahramanlık, beyan ve mütevazilik. İslam geldikten sonra bunların kemale ermeleri ise, ancak afif olmakla mümkündür.İşte bütün bunlar bu adamda bir arada toplanmış bulunmaktadır.\" Kasttetiği kişi ise Muharib b. Disar'dır. Bu hadislerden anlaşıldığına göre; büyüklenmek maksadıyla izarı (elbiseyi) yere sarkıtıp sürümek büyük bir günahtır. Ama büyüklenmek kastı olmaksızın sarkıtmak, hadislerin zahirinden anlaşıldığına göre yine haramdır. Fakat bu hadislerde \"büyüklenmek\" kaydının zikredilmesi, sarkıtmanın yerilmesi ile alakalı varid olmuştur, mutlak olarak yasağı belirten hadisler de buradaki kayıtlı olan rivayete göre yorumlanır. Dolayısı ile büyüklenmekten kendisini kurtarabilmesi halinde elbiseleri uzatıp yerde sürüklemek haram olmaz. İbn Abdilberr dedi ki: Hadisin mefhumundan anlaşıldığına göre, büyüklenmek kastı olmaksızın elbisenin sürüklenmesi halinde tehdit söz konusu olmaz. Ancak gömleğin ve daha başka elbiselerin yerde sürüklenmeleri, durum ne olursa olsun yeriimiş bir şeydir. Nevevi der ki: Topukların altına kadar elbiseyi sarkıtmak, büyüklenmek içindir. Eğer başka bir amaçla sarkıtılırsa o mekruhtur. Şafil de büyüklenmek için elbisenin sürüklenmesi ile başka bir amaç için sürüklenmesi arasındaki farkı böylece belirtmiştir. O der ki: Müstehap olan, izarın baldırın yarısına kadar olmasıdır. Kerahet söz konusu olmaksızın caiz olanı ise ondan aşağı topuklara kadar uzanan halidir. Topuklardan aşağı inen ise eğer büyüklenmek amacıyla yapılırsa haram olarak yasaklanmıştır. Aksi takdirde tenzihl anlamıyla yasaktır. Çünkü elbiseleri sarkıtmayı yasaklamaya dair varid olmuş hadisler mutlaktır, bunların büyüklenmek amacı ile sarkıtılmak ile kayıtlandmlmaları gerekmektedir.---Nevevi'nin sözleri burada bitti. --- İbnu'l-Arabl dedi ki: Erkeğin elbiselerini topuktan aşağıya sarkıtması ve ben bunu büyüklenmek için yapmıyorum demesi caiz değildir. Çünkü yasak, lafzı itibariyle bu hali de kapsamına alır. Hüküm itibariyle lafzın kapsamına giren bir kimsenin: Sözü geçen illet bende bulunmadığından ötürü ben bu emre uymuyorum, demesi caiz değildir. Çünkü, bu kabul edilebilecek bir iddia olamaz. Aksine onun elbisesinin eteğini uzatınası, kibirlendiğirÜn bir delilidir. (Özetle) Hulasa, elbiseyi sarkıtınak onu yerde sürüklemeyi de gerektirir. Yerde sürüklenmesi büyüklenmeyi gerektirir. İsterse giyen büyüklenmek kastını gütmesin",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 9
			}
		}
	]
}