{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5807,
			"arabicnumber": 5807,
			"text": "Aişe r.anha'dan, dedi ki: \"Habeşistan'a Müslümanlardan birtakım erkekler hicret etti. Ebu Bekir de hicret etmek üzere hazırlandı. Nebi Sallallahu Aleyhi ve Sellem ona: Acele etme! Çünkü ben bana da (hicret etmek için) izin verileceğini ümit ediyorum, dedi. Bu sefer Ebu Bekir: Onu ben de ümit edebilir miyim, babam sana feda olsun, dedi. Allah Rasulü: Evet, dedi. Bunun üzerine Ebu Bekir de Nebi Sallallahu Aleyhi ve Sellem ile arkadaşlık etmek üzere hicret etmekten vazgeçti. Yanında bulunan iki bineğe de dört ay boyunca semura ağacı yapraklarını yem olarak verdi.\" Urve dedi ki: Aişe dedi ki: \"Bir gün biz öğle sıcağında evimizde oturuyor iken birisi Ebu Bekir'e: İşte Rasulullah Sallallahu Aleyhi ve Sellem başını ve yüzünün büyük bir bölümünü örtmüş olarak geliyor, dedi. Rasulullah'ın o saatte bize gelmek adeti yoktu. Bunun üzerine Ebu Bekir: Babam anam sana feda olsun, Allah'a yemin ederim o bu saatte ancak önemli bir iş için gelmiş olabilir, dedi. Nihayet Nebi Sallallahu Aleyhi ve Sellem gelip izin istedi, Ebu Bekir de ona izin verdi. Nebi içeri girdi, içeri girince Ebu Bekir'e: Yanında kim varsa dışarı çıkar, dedi. O: Burada bulunanlar senin ailendir, babam sana feda olsun ey Allah'ın Rasulü, dedi. Allah Rasulü: Hicret etmek üzere çıkmama izin verildi, dedi. Ebu Bekir: Babam sana feda olsun ey Allah'ın Rasulü, seninle yol arkadaşlığı yapacak mıyım, dedi. Allah Rasulü: Evet, dedi. Ebu Bekir: Babam sana feda olsun, ey Allah'ın Rasulü, bu iki binek devemden birisini al, dedi. Nebi Sallallahu Aleyhi ve Sellem: Ancak bedeli karşılığında (alınm), buyurdu.\" Aişe devamla dedi ki: \"Onları en hızlı bir şekilde yola hazırladık. Azıklarını bir sofra ile bir dağarcık içinde koydu k. Ebu Bekir'in kızı Esma, belindeki kuşağından bir parça koparıp dağarcığın ağzını kapattı. Bundan dolayı o Zatu'nNitakayn diye adlandırılmıştır. Sonra Nebi Sallallahu Aleyhi ve Sellem ile Ebu Bekir Sevr adındaki bir dağda bulunan bir mağaraya gittiler. O mağarada üç gün kaldllar.Abdullah b. Ebi Bekr -ki o genç, anlayışlı ve kavrayışlı birisi idi- geceleyin yanlarında kalıyor, seher vakti yanlarından ayrılıyor, geceyi Mekke'de geçirmiş gibi Kureyş'le birlikte sabahlıyordu. Kureyşlilerin o ikisi hakkında düşündüklerini, duyduğu her bir kötü planı mutlaka beller ve nihayet karanlık bastırınca bunu haber olarak onlara ulaştırırdı. Ebu Bekir'in kölesi Amir b. Fuheyre de onların yakınlarında sağmal bazı koyunlar otlatır ve gece bir süre ilerledikten sonra koyunları yanlarına götürürdü. Böylelikle her ikisi de sabah aydınlığına doğru Amir b. Fuheyre kendilerine seslenineeye kadar rahat bir şekilde geceyi geçirirlerdi. Mağarada bulundukları o üç gecenin üçünde de hep bunu yaptı.\" Fethu'l-Bari Açıklaması: \"Başı ve yüzün büyük bir bölümünü örtmek.\" Tekannu': Başı ve yüzün büyük bir bölümünü rida ya da başka şeyle örtmek demektir. el-İsmail! dedi ki: Hadiste söz konusu edilen başını bağlaması, tekannu' denilen örtünme kısmına girmez. Çünkü tekannu' başı örtmektir. İsabe ise sarığın kuşattığı yer üzerine bir bez bağlayıp çatmak demektir. Derim ki: Her iki şekil arasındaki ortak şey, sarığın üzerinde başa fazladan bir şey koymaktır. Doğrusunu en iyi bilen Allah'tır",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 25
			}
		}
	]
}