{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5825,
			"arabicnumber": 5825,
			"text": "İkrime'den rivayete göre \"Rifaa hanımını boşamıştı. Abdurrahman b. ez-Zubeyı.' el-Kuraz1 onunla evlendi. Aişe dedi ki: Üzerinde yeşil bir başörtüsü vardı. Aişe'ye şikayette bulunarak derisi üzerindeki bir morarmayı da göstermişti. -(İkrime dedi ki) kadınlar birbirlerine destek olurlar.- Aişe dedi ki: Ben mu'min kadınların çektikleri gibisini görmedim. And olsun ki kadının derisi elbisesinden daha yeşildi. (Araplar morarmayı yeşil ile anlatırlar.) İkrime dedi ki: Kocası, karısının Resulullah Sallallahu Aleyhi ve Sellem'e gittiğini işitti. O da bunun üzerine başka bir kadından olma iki oğlunu da beraberinde getirerek geldi. Kadın: Allah'a yemin ederim, benim bunu gerektirecek bir günahım yoktur. Ancak onunla beraber olan şey, benim ihtiyacımı bundan daha fazla giderebilecek durumda değildir, dedi -ve bu arada üzerindeki örtünün bir saçağını tutup gösterdi.- Kocası bunun üzerine: Ey Allah'ın Rasulü, Allah'a yemin ederim ki yalan söyledi. Ben onu deri silkeler gibi silkeliyorum. Fakat o bana karşı koyuyor. Rifaa'yı istiyor, dedi. Rasulullah Sallallahu Aleyhi ve Sellem bu sefer: Eğer böyle bir şey varsa şimdiki kocan senin balcağızını tatmadıkça sen ona helal olmazsın ya da ona varman uygun olamaz, buyurdu. (İkrime) dedi ki: Rasulullah Abdurrahman ile beraber iki oğlunu görünce, bunlar senin oğulların mıdır, dedi. O, evet dedi. Allah Rasulü: Sen bu adam hakkında mı o dediğin iddialarda bulunuyorsun. Allah'a yemin ederim ki bu çocukların babalarına benzemesi, karganın kargaya benzemesinden daha fazladır, buyurdu.\" Fethu'l-Bari Açıklaması: İbn Battal dedi ki: Yeşil elbiseler cennet elbiselerindendir. Şeref olarak da bu onlara yeter. Derim ki: EbU. Davud, EbU. Rimse yoluyla: \"Onun Nebi Sallallahu Aleyhi ve Sellem üzerinde iki yeşil burde görmüş\" olduğuna dair birhadis rivayet etmiştir. \"Ki kadınlar birbirlerine destek olurlar.\" Bu bir ara cümlesi olup İkrime'nin sözüdür. Vuheyb b. Halid, Eyyub'dan diye naklettiği rivayetinde bunu açıkça söylemiştir. Rivayetinde \"derisi, başındaki örtüden daha yeşildi\" ibaresinden sonra bunu ifade etmiştir. el-Kermani dedi ki: Derisinin yeşilliği (moriuğu) kadının zayıflığından yahut da kocasının onu dövmesinden ileri gelmiş olabilir. Ama olayın anlatılışı ikincisinin tercih edilmesini gerektirmektedir. \"Sen ona helal olamazsın ya da ona varman uygun düşmez.\" el-Kermani'nin naklettiğine göre bazı rivayetlerde \"ona helal olamazsın\" ibaresini (cezm edat! geldiğinden nun düşmesi gerektiği halde düşmemiş olarak yazıldığını söz konusu ederek) izah etmeye, açıklamaya koyulmuştur. Allah Rasulü kadına bu cevabı vermekle kadının: \"Onun beraberindeki ancak bu saçak gibidir\" sözü ile Allah Rasulü: \"Sen onun balcağızından tatmadıkça\" sözünün birarada açıklanması özetle şöyledir: Allah Rasulü böylece kadının iddiasım reddetmiş olmaktadır. Evvela kocasının karısını deri silkeler gibi silkelediği şeklindeki iddiasını doğrulamış olmakta, ikinci olarak da beraberinde bulunan iki çocuğunu doğru söylediğine delilolarak göstermektedir. \"Onun hakkında böyle bir iddiada bulunuyorsun\" sözü de kadının kocası hakkındaki kısırlık iddiası ile ilgili bir kinayedir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 42
			}
		}
	]
}