{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5837,
			"arabicnumber": 5837,
			"text": "Huzeyfe r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem, bize altın ve gümüş kaplardan içmeyi, onlarda yemek yemeyi, ayrıca ipek ve atlas giyinmeyi ve bunların üzerine oturmayı yasakladı.\" Fethu'l-Bari Açıklaması: \"İpek yaygı edinme\"nin helal ve haram oluşu bakımından hükmü. \"İpek ve atlas giyinmeyi ve üzerine oturmayı.\" Buradaki \"ve üzerine oturmayı\" fazlalığı, ipeği n üzerine oturmanın yasak olduğunu kabul edenler lehine güçlü bir delildir. Zaten bu, cumhCırun da görüşüdür. Bu hususta İbnu'l-Macişun ile Kufelilerle bazı ŞafiIler muhalefet etmişlerdir. BÇ'lZı Hanefiler \"nehyetti\" lafzının haram kılmak hükmünde açık olmadığını söyleyerek cevap vermişler, bazıları da nehyin hem giymek, hem de oturmak hakkında varid olduğunu, tek başına oturmak için söz konusu olmadığının ihtimal dahilinde olduğunu söylemişlerdir. Bu da İbn Battal'ın hadisin ipek üzerinde oturmanın haram oluşu hususunda nas olduğuna dair iddiasını reddetmektedir. Çünkü bu hususta nas değildir. Sadece zahir olan odur. Ayrıca bu hadis, kadınların ipek yaygı kullanmaktan alıkonulacağına da delil gösterilmiştir. Ancak bu, zayıf bir değerlendirmedir. Çünkü erkeklere yapılan hitap, tercih edilen görüşe göre dişileri kapsamaz. Yasak olduğunu söyleyen kimseler, onların altını süs olarak takınmaları caiz olmakla birlikte, altın kaplan kullanmalarının yasaklandığına kıyası delil göstermiş de olabilirler. O halde kadınların ipek giyinmeleri caiz olmakla birlikte, onu (yaygı ve benzeri şekillerde) kullanmaları yasaklanır. Bu açıklama şeklini er-Ram doğru kabul etmiştir. Nevevı ise caiz oluşunu doğru kabul etmiş ve erkeğin hanımı ile beraber hanımının döşeği üzerinde ipeği yayıp kullanmasını yasakladığını delil göstermiştir. Malikilerden bunun caiz olduğunu kabul edenlerin görüşü ise şöyle açıklanır: Kadın erkeğin firaşı (yatağı)dır. Hanımının üzerinde altın süs eşyası ve ipek bulunduğu halde onunla yatması caiz olduğu gibi, hanımı ile beraber hanımı için mubah olan döşeği üzerinde oturması ve onunla beraber uyuması da caizdir. Bir Uyarı: Üzerine oturması yasak olan şey, giyilmesi yasak olan şeydir. Bu da -daha önce açıklandığı gibi- katıksız ipekten yapılan yahut ipeğin diğer dokumalardan daha çok bulunduğu kumaşlardır",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 54
			}
		}
	]
}