{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5843,
			"arabicnumber": 5843,
			"text": "İbn Abbas r.a.'dan, dedi ki: \"Ben Ömer'e, Nebi Sallallahu Aleyhi ve Sellem'e karşı birbirine yardım eden iki kadının kim olduğunu sormak isteği ile bir sene fırsat kollayıp durdum. Ama ondan çekindiğim için soramadım. Bir gün, bir konaklama yerinde indi ve (ihtiyacını karşılamak üzere) erak ağaçlarının arasına girdi. Ağaçların arasından çıkınca ona sordum. O: Aişe ve Hafsa'dırlar, dedi. Daha sonra şunları anlattı: -Bizler cahiliye döneminde kadınları önemsemezdik. Ama İslam gelip de Allah onları söz konusu edince, bu sebeple onların üzerimizde bir haklarının bulunduğunu gördük. Ama bununla birlikte yine onları herhangi bir işimize de karıştırmıyorduk. Benimle hanımım arasında bir söz alışverişi olmuştu. O bana ağır sözler söyledi. Ben de ona: Sen işi buraya kadar mı vardırdın, diye çıkıştım, bana: Bunu bana mı söylüyorsun? Oysa senin kızın Nebi Sallallahu Aleyhi ve Sellem'e eziyet ediyor, dedi. Bu sefer Hafsa'nın yanına gittim ve ona: Seni Allah'a ve Rasulüne karşı gelmekten sakındırıyorum, dedim. Nebie eziyet verip onu rahatsız etmemek konusunda söyleyeceklerimi ilk olarak ona söyledim. Daha sonra Ümmü Selemelnin yanına gittim ve ona da bunları söyledim. Bu sefer Üm mü Seleme: Sana şaşıyorum ey Ömer, sen bizim işlerimize de müdahale ettin. Kala kala Rasulullah Sallallahu Aleyhi ve Sellem ile onun zevceleri arasına girmen mi kaldı, dedi. Ve bu sözlerini tekrarladı. Ensardan bir adam vardı. O Rasulullah Sallallahu Aleyhi ve Sellem'in huzurunda bulunmayıp ben bulunacak olursam ona gider olanları anlatırdım. Ben Rasulullah Sallallahu Aleyhi ve Sellem'in huzurunda bulunmayıp o bulunmuş ise o yanıma gelir ve Rasulullah Sallallahu Aleyhi ve Sellem'in yaptıklarını bana anlatırdı. Rasulullah Sallallahu Aleyhi ve Sellem'in etrafında bulunanlar (hükümdar ve idareciler) hep ona karşı doğrulmuşlardı (ona boyun eğmişlerdi). Geriye sadece Şam'daki Gassan kralı kalmıştı. Onun bize hücum edeceğinden korkardık. Bir gün ansızın ensardan olan o arkadaşının gelip: Bir iş oldu, dediğini duyuverdim. Ben ona: Olan ne, Gassanlı mı geldi yoksa, diye sordum. O: Bundan daha da büyük. Rasulullah Sallallahu Aleyhi ve Sellem hanımlarını boşadı, dedi. Hemen onun evine gittim. Hepsinin hücrelerinden ağlama sesleri geliyordu. Nebi Sallallahu Aleyhi ve Sellem de birkaç basamakla çıkılan yüksekçe odasına çıkmıştı. Odanın kapısında da onun hizmetçisi vardı. Hizmetçisine gidip: Huzura girme m için bana izin iste, dedim. Bana izin verdi, ben de içeri girdim. Nebi Sallallahu Aleyhi ve Sellem'in bir hasır üzerinde ve hasırın böğründe iz bırakmış olduğunu gördüm. Başı altında içi lifte dolu deriden bir yastık vardı. İçeride tabaklanmamış birkaç hayvan postu ile tabaklamakta kullanılan bir miktar karaz (mazı ağacı yaprağı) vardı. Hafsa'ya ve Ümmü SelemeIye söylediklerimi ona naklettim. Üm mü Seleme'nin de bana ne şekilde cevap verdiğini anlattım. Rasulultah Sallallahu Aleyhi ve Sellem bunun üzerine güldü ve yirmi dokuz gün kalıp sonra indL",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 60
			}
		}
	]
}