{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5848,
			"arabicnumber": 5848,
			"text": "Bera r.a.'dan, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem orta boylu idi. Ben onu kırmızı bir elbise giyinmişken gördüm. Ondan daha güzelini asla görmedim.\" Fethu'l-Bari Açıklaması: \"Kırmızı elbise.\" Kırmızı elbise giymek hususunda selefin görüşlerini yedi ayrı görüş olarak şöylece özetleyebiliriz: 1- Mutlak olarak caizdir. Ali, Talha, Abdullah b. Cafer, el-Bera ve ashab-ı kiram'dan daha başkalarından, tabiinden de Said b. el-Müseyyeb, en-Nehaı, eşŞa'bı, EbQ Kilabe ile EbQ Vail ve kalabalık bir topluluktan rivayet edilmiştir. 2- Mutlak olarak yasaktır. Buna gerekçe ise daha önce kaydedilen Abdullah b. Amr yolu ile gelen hadis ile Beyhaki'nin naklettiği İbn Mace'nin de zikrettiği İbn Ömer'in şu hadisidir: \"Resulullah Sallallahu Aleyhi ve Sellem el-mufeddem denilen uspur ile iyice doyurulmuş (boyanmış) elbise giyinmeyi nehyetmiştir.\" Bunun ne demek olduğunu hadiste zaten açıklamış bulunmaktadır. Ömer'den rivayet edildiği ne göre de o bir adam üzerinde uspurlu bir elbise gördü mü onu hızhca çeker ve: Bunu bırakın da kadınlar giyinsin, derdi.\" Bunu Taberi rivayet etmiş bulunmaktadır. 3- Boyası hafif olanlar değil de kırmızısı iyice doyurulmuş elbise giyinmek mekruhtur. Bu görüş Ata, Taws ve Mücahid'den rivayet edilmiştir. Bu hususta delil de az önce zikrettiğimiz el-müfeddem'i söz konusu eden hadis olabilir. 4- Süslenmek ve gösteriş kastı ile kırmızı elbise giymek, mutlak olarak mekruhtur. Ama evlerde, iş esnasında giyilmesi caizdir. Bu görüş İbn Abbas'tan nakledilmiştir. 5- İpliği boyandıktan sonra dokunmuş olanı giymek caizdir. Ama dokunduktan sonra boyananı giyinmek yasaktır. Bu görüşe el-Hattabı meyletmiş ve Nebi Sallallahu Aleyhi ve Sellem'in kırmızı bir elbise giyindiğine dair varid olmuş haberlerde geçen hullenin Yemen hullelerinden birisi oluşunu delilgöstermiştir. Aynı şekilde kırmızı burdlerin durumu da böyledir. Yemen burdlerinin ipi önce boyanır, sonra dokunurdu. 6- Nehy (yasak) özelolarak uspur ile boyanmış elbiseler hakkındadır. Çünkü nehy ona dair varid olmuştur. Daha başka boyalarla boyanmış olan ise yasak değildir. Ancak daha önce geçmiş olan Muğire hadisi bu iddiayı zayıflatmaktadır. 7 - Yasağın bütünüyle kırmızıya boyanmış olan elbise hakkında has kabul edilmesi. Kırmızı dışında beyaz, siyah ve daha başka renklerin de bulunduğu elbiseler ise yasak değildir. İşte kırmızı hulle hakkında varid olmuş hadisler de buna göre yorumlanır. Çünkü Yemen'den gelen hulleler çoğunlukla kırmızı ve daha başka renkte çizgili yapılırdj. İbnu'l-Kayyim dedi ki: İlim adamlarından kimisi kırmızı boya ile iyice doyurulmuş bir elbise giyer ve onun bununla sünnete uyduğunu iddia ederdi. Ama bu yanlıştır. Çünkü kırmızı hulle Yemen burdlerindendir. Burd ise sadece kırmızı ile boyanmaz. İbnu'l-Kayyim böyle demiştir. et-Taberı ise bu görüşlerin çoğunu zikrettikten sonra şunları söylemektedir: Benim görüşüme göre her renkle boyanmış olan elbiseyi giymek caizdir. Şu kadar var ki ben katıksız kırmızı (kırmızıya doymuş) elbiseyi giymeyi sevmediğim gibi, diğer elbiselerin üzerinde üst elbise olarak kırmızı renkli yi de mutlak olarak giyinmeyi sevmiyarum. Çünkü kırmızı elbise günümüzde mert kimselerin elbise çeşitleri arasında değildir. Şüphesiz ki günah olmadığı sürece zamanın kılık kıyafetine riayet etmek, mertliğin bir gereğidir. Kabul gören kıyafetlere aykırı hareket etmek ise bir tür gösteriştir. Bunun sekizinci bir görüş olarak kabul edilmesi de mümkündür. Bu konuda meselenin tahkikine gelince, kırmızı renkli elbiseyi giymeye dair yasak, kafirlerin giydiği elbise olduğundan ötürü ise bu hususta kabul edilmesi gereken görüş, ileride geleceği üzere kırmızı mısera ile ilgili görüş gibidir. Eğer yasak, onun kadınların kıyafeti olduğundan dolayı ise, o takdirde bu, kadınlara benzemenin yasaklanışı kapsamındadır. Bu durumda onun nehyedilmesi, bizatihı değildir. Eğer gösteriş yahut mertliğe aykırı olmak açısından yasaklanmış ise, böyle bir halalduğu takdirde yasak olur, değilse Malik'in benimsediği görüş olan toplantı yerleri ile evarasında fark gözetmek, daha da pekişir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 65
			}
		}
	]
}