{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5876,
			"arabicnumber": 5876,
			"text": "Cuveyriye'den, onun Nafi'den rivayetine göre, \"Abdullah, Nafi'e şu hadisi nakletmiştir: Nebi Sallallahu Aleyhi ve Sellem altından bir yüzük yaptırdı ve o yüzüğü giydiği vakit kaşını elinin iç tarafına getiriyordu. Sair insanlar da altından yüzükler yaptırdılar. Nebi Sallallahu Aleyhi ve Sellem minbere çıkıp Allah'a hamd u senada bulunduktan sonra: Ben onu yaptırmıştım. Artık ben onu giymeyeceğim deyip yüzüğü attı, insanlar da (yüzüklerini) attılar.\" Cuveyriye dedi ki: \"Onun (Nafi'in), yüzüğü sağ eline takmıştı\" sözünden başka bir şey söylediğini zannetmiyorum. Fethu'l-Bari Açıklaması: \"Cuveyriye dedi ki: Ben (Nafilin) sağ eline taktı, sözünden başkasını söylediğini zannetmiyorum.\" İbn Ebi Hatim dedi ki: Ben Ebu Zür'a'ya bu husustaki hadisler arasında var olan ihtilafı sordum. O bana: Ne bu sabittir, ne de öteki. Fakat sağ eline taktığına dair rivayetler daha çoktur, dedi. Daha önce de Buhari'nin: \"Abdullah b. Cafer'in rivayet ettiği hadis bu hususta varid olmuş rivayetlerin en sahihidir\" şeklindeki sözleri de geçmiş bulunmaktadır. Bunda da yüzüğünü sağ eline taktı ğı açıkça ifade edilmiş bulunmaktadır. Bu meselede Şafiı alimleri arasında görüş ayrılığı vardır. Daha sahih olan, sağ ele konulduğudur. Derim ki: Ben gördüğüm kadarıyla bu, maksadın farklılığına göre değişiklik arz eden bir durumdur. Eğer yüzük takınmaktan maksat, süslenmek ise sağa takılması daha faziletlidir. Eğer onunla mühürlemek için ise sol ele takmak daha uygundur. Çünkü yüzüğünü oraya emanet olarak bırakmış gibi olur. Sağ eliyle de o yüzüğü oradan alır. Yüzüğü sol eline bırakması da böyledir. Ama mutlak olarak yüzük takmanın sağ elde olması daha çok tercih edilir. Çünkü sol el istincada kullanılır. Bu durumda yüzük sağ elde bulunuyor ise ona necasetin bulaşması önlenmiş olur. İşaret ettiğim sağ elle almak sebebi ile de mühür olarak kullanılan yüzüğün sol elde bulunması ağırlık kazanır. Bir kesim ise her iki hususun da birbirine eşit olduğu kanaatine meyletmiş ve böylelikle bu husustaki hadisler arasında görülen ihtilafı da telif etmiş olmaktadırlar. Nitekim Ebu Davud da \"sağ ve sol elde mühür yüzük takmak\" başlığı ile buna işaret etmiş bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 93
			}
		}
	]
}