{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5918,
			"arabicnumber": 5918,
			"text": "Aişe r.anha'dan, dedi ki: \"Ben hala Nebi Sallallahu Aleyhi ve Sellem ihramlı olduğu halde, saçlarını ayırdığı yerlerdeki kokunun parıltısını görüyor gibiyim.\" (Ravilerden) Abdullah (İbn Reca): \"Nebi Sallallahu Aleyhi ve Sellem'in saçlarını ayırdığı yerde\" demiştir. Fethu'l-Bari Açıklaması: \"Başın saçlarını ayırmak,\" yani başın saçlarını ortadan ikiye ayırmak. Bu da mefrak denilen yerde saçları ayırma anlamındadır. Mefrak, başın ortası demektir. Kelime olarak, saçın alın tarafından, başın ortasından ayrılma yerine denilir. \"Müşrikler saçlarını ortadan ayırırlardı.\" Bundaki sır, putperestlerin kitap ehline iman etmekten en uzak olan kimseler olması ve kitap ehlinin genelolarak bir şeriate bağlı bulunmaları olabilir. Bu sebepten Nebi Sallallahu Aleyhi ve Sellem onların kalplerini ısındırmak için onlara uygun hareket etmeyi -putperestlere aykırı hareket etme sonucuna götürse dahi- severdi. Onunla beraber bulunan ve çevresinde yer alan putperestler Müslüman olup, kitap ehli de küfürlerini sürdürüp gidince, artık kitap ehline muhalefet katıksız bir tutum haline geldi. \"Daha sonra saçlarını ayırdı.\" Iyad. dedi ki: Saçları salmak, onları serbest bırakıp salıvermek demektir. Bunu anlatmak üzere kullanılan \"sedele şa'rahu ve esdelehu\" tabiri, saçını salıverip yan taraflarını birbirine bağlamaması halini anlatır. Aynı mı elbise için de bu anlamda kullanılır. Fark (ayırmak) ise, saçın bir kısmını diğerinden ayırıp alnı kapatmamasını sağlamaktır. Saçları ayırmak sünnettir. Çünkü nihai olarak yapılan bu olmuştur. Göründüğü kadarıyla bu husus vahiy ile gerçekleşmiş bulunmaktadır. Çünkü hadisi rivayet eden, hadisin baş tarafında: \"Hakkında kendisine herhangi bir emir verilmemiş hususlarda kitap ehline muvafakat etmeyi severdi\" demektedir. Bundan açıkça anlaşıldığına göre o saçlarını Allah'tan gelen bir emir üzere ortadan ayırdı. Öyle ki bazı ilim adamları bu hususta neshin meydana geldiğini, saçları salıvermenin ve alın üzerinde perçem yapmanın yasak olduğunu iddia dahi etmiştir. Aynışekilde bu görüş Ömer İbn Abdulaziz'den de rivayet edilmiş bulunmaktadır. Ancak Kurtubi, Iyad'a şöylece itiraz etmiştir: Zahir'olan, Nebi Sallallahu Aleyhi ve Sellem'in bu işi ancak onların kalplerini ısındırmak için yaptığıdır. Bunun onlara bir faydası olmayınca, onlara muhalefet etmeyi daha çok benimsedi. Onlara (bu gibi hususlarda) muhalefet etmesi ise onun için vacip değil, müstehap idi. Hadisi rivayet edenin: \"Hakkında kendisine emir verilmemiş olan hususlarda\" ifadesini kullanmış olması, ondan herhangi bir istekte bulunulmadığı hususlarda demektir. İstekte bulunmak (talep) ise hem vacip oluşu, hem de mendub oluşu kapsar. Bu hususta neshin söz konusu olduğu kanaatine gelince, rivayetlerin telif edilmesi mümkün olduğundan ötürü bir değer ifade etmez. Hatta masıahatın gözetilmesi dışında muhalefet ya da muvafakat etmenin şer'! bir hüküm olmaması ihtimali vardır. (Kurtubi devamla) dedi ki: Eğer saçları salıvermek neshedilmiş bir hüküm olsaydı, ashabın ya da onların çoğunluğunun bu şekilde uygulamaya dönmeleri gerekirdi. Onlardan nakledilen rivayetleregöre ise aralarından kimi saçlarını ayırır, kimi sarkıtırdı ve bundan dolayı kimse kimseyi ayıplamazdı. Ayrıca Nebi Sallallahu Aleyhi ve Sellem'in kulaklarının yumuşaklarına kadar ulaşan saçları da vardı. Eğer bu saçları ayırabilirse ayırır, değilse olduğu halde bırakırdı. O halde sahih olan, saçları ortadan ayırmak vacip değil, müstehaptır. Malik'in ve cumhurun görüşü de budur. Nevevi de, saçları salıvermenin de, ortadan ayırmanın da caiz olduğunu belirtmiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 133
			}
		}
	]
}