{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5921,
			"arabicnumber": 5921,
			"text": "Abdullah İbn Dinar'dan, onun İbn Ömer'den rivayetine göre \"Resulullah Sallallahu Aleyhi ve Sellem el-kaza' denilen traş şeklini nehyetmiştir.\" Fethu'l-Bari Açıklaması: \"el-Kaza'\" lafzı kaz'a'nın çoğulu olup bir bulut parçası demektir. Saçın bir kısmını traş edip, bir kısmını bırakmak halinde ona \"kaza'\" adı, dağınık ve parçalı bulutlara benzetilerek verilmiştir. Bu hadisi Ebu Davud ve Nesai de rivayet etmiş olup hadisin siyakl!1da elkaza' tefsirini Nebie merfu' olarak zikredenlerin dayanağına da delil teşkil etmektedir ki, onların lafzı şöyledir: Nebi Sallallahu Aleyhi ve Sellem saçının bir kısmı traş edilmiş, bir kısmı bırakılmış küçük bir çocuk gördü. Allah Rasulü onlara böyle traş yapmayı nehyederek: \"Ya hepsini traş ediniz ya da hepsini bırakınız\" buyurdu. Nevevi der ki: Daha sahih olan, el-kaza' denilen traş şeklinin Nafi'in açıkladığı şekilde olduğudur. O da kayıtsız ve şartsız olarak küçük çocuğun saçlarının bir kısmını traş etmektir. Kimileri de şöyle demiştir: el-Kaza', saçın değişik yerlerini traş etmek demektir. Ama sahih olan birincisidir. Çünkü ravinin tefsir ettiği şekil budur. Bu tefsir (açıklama) de zahir anlama aykırı değildir. O halde onunla amel etmek gerekir. Derim ki: Ancak burada bu şekli \"çocuk\" ile tahsis etmek bir kayıt değildir. Nevevi der ki: Tedavi ve buna benzer bir maksat için olması hali dışında, başın değişik yerlerini traş etmenin mekruh olduğunu, bunun tenzihi bir kerahet olduğunu, bu hususta erkek ile kadın arasında bir fark bulunmadığını ittifakla belirtmişlerdir. Malik küçük kız ve erkek çocuk için böyle bir traşın mekruh oıdUğunu söylemiştir. Bunun nehyediliş illetinin ne olduğu hususunda görüş aynlığı vardır. Hilkati çirkin bir şekilde değiştirmekten dolayı nehyedildiği söylendiği gibi, şeytan ın kılığının böyle olduğu için nehyedildiği de, Yahudilerin kılığının bu şekilde olduğu için nehyedildiği de söylenmiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 136
			}
		}
	]
}