{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5938,
			"arabicnumber": 5938,
			"text": "Said İbn el-Müseyyeb'den, dedi ki: \"Muaviye Medine'ye geldiği son seferinde gelip bize bir hutbe verdi. Bu arada bir top saç çıkartarak: Ben bunu Yahudilerden başka bir kimsenin yapacağını sanmıyordum. Şüphesiz Nebi Sallallahu Aleyhi ve Sellem buna -yani saça saç ekleyen kadına- yalan ve batıl adını vermiştir.\" Fethu'l-Bari Açıklaması: \"Saça\" ondan başka \"bir şeyler eklemek\" suretiyle onu ziyadeleştirmek. \"Muhafızın elindeki bir tutam saçı eline aldı. .. Nerede alimleriniz?\" Daha önce İsrailoğulları ile ilgili bahiste, bu hadiste o gün için Medine'de ilim adamlarının azlığına işaret olduğu belirtilmiş idi. Bu işe gösterdiği tepki hususunda ilim adamlarının yardımını almak yahut bundan önce böyle bir işe tepki göstermeyip susmaları dolayısıyla onların bu yaptıklarının uygun olmadığını söylemek için huzura getirilmelerini de istemiş olabilir. \"Şüphesiz İsrailoğulları ... helak olmuştur.\" Sözü geçen Said İbn elMüseyyeb'in naklettiği rivayette \"Resulullah Sallallahu Aleyhi ve Sellem'in bu saç ekleme işine zur (yalan) adını verdiği haberi ulaşmıştır\" denilmektedir. Katade'nin, Said'den diye naklettiği Müslim'deki rivayette ise \"o zuru (yalanı) nehyetmiştir\" şeklindedir. Hadisin sonlarında da: \"Dikkat edin, işte zur (yalan) denilen şey de budur\" ifadesi yer almaktadır. Katade dedi ki: Bununla kadınların saçlarını bez parçaları ile artırmaların! kastetmektedir. Bu hadis. ister saç, ister başka bir şeyolsun, saça bir şeyler ekletmenin yasaklığı hususunda cumhurun lehine bir delildir. Cabir radıyallahu anh'ın rivayet ettiği: \"Resulullah Sallallahu Aleyhi ve Sellem kadının saçına herhangi bir şeyeklemesini yasaklamıştır\" hadisi de desteklemektedir. Bu hadisi Müslim rivayet etmiştir. el-leys, Ebu Ubeyde'den ve onun da pek çok fakihten naklettiğine göre bu hususta yasaklananın, saça saç ekletme olduğu kanaatindedir. Kadın, saçına bez ve daha başka saçın dışında birşeyler ekleyecek olursa yasağın kapsamına girmez. Ebu Davud sahih bir senedie Said İbn Cubeyr'den şöyle dediğini rivayet etmektedir: el-Karamil'de bir beis yoktur. Ahmed de böyle demiştir: el-Karamil ise \"karmel\"in çoğulu olup dalları uzun, yumuşak bir bitkidir. Burada kastedilen şey ise örükler halinde yapılan ve kadının saçına eklediği ipek ya da yün iplerdir. \"Kadının gereksiz yere saçına saç ekletmesi ve saçlarını traş etmesi.\" Kadının saçına saç ekletmesi suretiyle saçını artırması haram olduğu gibi, zaruret olmadan saçlarını traş ettirmesi de haramdır. Taberi, Süfyan kızı Ümmü Osman yoluyla İbn Abbas'tan şöyle dediğini rivayet etmektedir: \"Nebi Sallallahu Aleyhi ve Sellem kadının saçlarını traş etmesini yasaklamıştır.\" Bu hadis Ebu Davud'da bu yolla \"kadınların (ihramdan çıkarken) saçlarını traş etmek yükümlülükleri yoktur. Onların yükümlülükleri saçlarını kısaitmaktan ibarettir\" lafzı iledir. Doğrusunu en iyi bilen Allah'tır. \"Ağır sözler söyledi.\" Yani diğer rivayette açıkça ifade edildiği gibi lanet okudu. Aişe'nin rivayet ettiği hadiste de ondan saça saç ekletmeye ruhsat verdiğine dair nakledilen rivayetin batıl oluşuna da açık bir delalet vardır. Muaviye'nin rivayet ettiği hadiste ise (dökülen yahut kesilen) saçın olduğu halde bırakılmasının caiz olup onu gömmenin vacip olmadığını göstermektedir. Hadisten Çıkan Diğer Sonuçlar 1- İmam minber üzerinde yasak olan şeyleri ifade eder. Özellikle de yaygın bir hal aldığını gördüğü da açık ve yaygın bir şekilde reddederek bu işin yasaklığını daha bir vurgular ve işlenmesinden sakınılmasını söyler. 2- Bir masiyet işleyen kimseleri, daha önceden aynı masiyeti işleyenlerin helak edilmesini söyleyerek korkutup uyarıro Nitekim yüce Allah: \"Bu, zalimlerden uzak değildir.\" (Hud, 11183) diye buyurmuştur. 3- Hutbe esnasında, dini bir masıahat için daha önce bir şeyi görmemiş olanı göstermek üzere herhangi bir şeyi el uzatıp almak caizdir. 4- İçine düşülen halden sakındırmak maksadıyla İsrailoğullarına ve diğerlerine dair hadisler söz konusu edilebilir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 153
			}
		}
	]
}