{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5939,
			"arabicnumber": 5939,
			"text": "Alkame'den, dedi ki: \"Abdullah (İbn Mes'ud) güzelleşmek ıçın ve Allah'ın yaratmasını değiştirmek için döğme yapan, yüzlerinin tüylerini aldıran ve dişlerini inceltip törpületen kadınlara lanet okudu. Ümmü Yakub adındaki bir kadın: Bu da ne oluyor, dedi. Abdullah: Ben ne diye Resulullah Sallallahu Aleyhi ve Sellem'in lanet ettiği kimseye lanet etmeyeyim ki? Hem bu Allah'ın Kitabında da vardır, dedi. Kadın: Allah'a yemin ederim ki ben mushafın iki kabı arasında bulunanı baştan sona okudum, bunu bulamadım, dedi. Bunun üzerine Abdullah İbn Mesud: Allah'a yemin ederim, eğer gerçekten ser. onu okumuş olsaydın, hiç şüphesiz onu bulurdun, dedi (ve:) \"Rasul size ne verdiyse onu alın, size neyi yasakladıysa ondan uzak durun.\"lo buyruğunu okudu.\" Fethu'l-Bari Açıklaması: \"Yüzlerinin tüylerini yolduranlar.\" (Bu anlamdaki): el-Mütenemmisat lafzı \"mütenemmisa\"nın çoğ\\,.lludur. Bu da tüylerinin yolunmasını isteyen kadın demektir. \"en-Namisa\" ise bu işi bizzat yapan kadına denir. en-Nimas da yüzlerdeki tüylerin cımbız ile alınması demektir. Bu iş için kullanılan alete bundan dolayı \"minmas\" adı verilir. Nimas'ın sadece kaşları inceltmek ya da düzeltmek için kaşların kıllarını izale etmenin özel adı olduğu da söylenmiştir. Ebu Davud, Sünen adlı eserinde şunları söylemektedir: Namisa inceltmek amacı ile kaşın tüylerini, saçlarını cımbızla alan demektir. Bu açıklamayı yaptığı yerde de daha önce \"diş_ lerini törpületip inceltenler\" başlığında geçen İbn Mesud yolu ile rivayet edilen hadisi kaydetmektedir. Taberi der ki: Kadının, Allah'ın kendisini yaratmış olduğu hilkate güzelleşmek amacıyla fazlalıklar eklemesi yahut bir şeyler eksiltmesi yolu ile hilkatini değiştirmeye kalkışması caiz değildir. Bunu ister kocası için yapsın, ister başkası için yapsın, fark etmez. Mesela, kaşları birbirine bitişik olan bir kadının, kaşlarının arasını, kaşlarının birbirinden ayrı olduğu izlenimini vermek için alması ya da aksini yapması gibi ... Nevevi der ki: Kadının sakal, bıyık yahutalt dudağının altında, çenesi üzerinde tüy çıkması hali, bu yasağın dışında, istisna kabul edilir. Bu gibi tüylerini izale etmesi haram değildir. Hatta müstehaptır. Derim ki: Ancak buradaki mutlak ifade, kocanın izin vermesi ve bunu bilmesi kaydına bağlıdır. Aksi takdirde bu durum yoksa gerçeği gizleyip saklama dolayısı ile bu işi yapması yasaklanır. - Bazı Hanbeli alimleri de şöyle demiştir: Eğer kaşların aldırılması kötü kadınların ayırt edildiği en açık belirtilerden ise yasaktır. Aksi takdirde tenzihen mekruhtur. Bir rivayete göre kocanın izniyle caizdir. Ancak bu yolla görenin aldatılması söz konusu ise haram olur. Hanbelı alimleri derler ki: Kocanın izni ile olması şartıyla ağda yapmak, allık kullanmak ve süslenmek caizdir. Çünkü bu da kadının kocasına karşı zınetlenmesi kabilindendir. Nevevi der ki: Sözü geçen işleri yaparak süslenmek caizdir. Ağda (yüzdeki tüyleri yolmak) müstesnadır. Çünkü bu nimas kabilindendir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 154
			}
		}
	]
}