{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"77": "Dress"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5951,
			"arabicnumber": 5951,
			"text": "Nafi'den rivayete göre Abdullah İbn Ömer r.a. kendisine Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu haber vermiştir: \"Şüphesiz bu suretleri yapan kimseler, kıyamet gününde azaba uğratılırlar. Onlara: Haydi yarattıklarımza hayat verin, denilir.\" Bu Hadis 7558 numara ilede var. Fethu'l-Bari Açıklaması: \"Şüphesiz Allah nezdinde insanlar arasında azabı en şiddetli olanlar suret yapanlardır.\" Yüce Allah: \"Firavun hanedanını azabın en şiddetlisine sokun (denilecektir). \"(Mu'min,46) buyruğu ile birlikte suret yapan kimsenin insanlar arasında azabı en şiddetli olacaklardan olması, açıklanması zor görülmüştür. Çünkü bu hadis stiret yapan kimsenin azabının Firavun hanedanından daha ağır olmasını gerektirir. Taberi buna şöyle cevap vermektedir: Burada kastedilen kimse, Allah'ın dışında kendisine ibadet edilen şeylerin suretini bilerek ve bu maksatla yapan kimsedir. Böyle bir kişi, bu işi dolayısıyla kafir olur. Bu sebeple böylesinin Firavun hanedanının girdiği çerçeveye girmesi uzak bir ihtimal değildir. Böyle bir kasıt gütmeye n kimse ise, suret yapmakla sadece isyankar olur. Nevevi der ki: İlim adamları şöyle demiştir: Canlı varlığın (insan ve hayvanın) suretini yapmak, ağır bir haramdır ve bu büyük günahlardandır. Çünkü böyle bir işe bu türden ağır bir tehditte bulunulmuştur. Onun bu sureti ister tahkir edilecek maksatlar için, ister başka bir maksatla yapmış olsun, fark etmez. Her durumda onun bu yaptığı haramdır. Yaptığı bu resim de ister elbise, ister yaygı, ister dirhem, ister dinar, ister bozuk para, ister kap, ister duvar, isterse de başka bir şey üzerinde olsun, yine fark etmez. Kendisinde canlı sureti bulunmayan şeylerin suretini yapmak ise haram değildir. Derim ki: Gölgesi olan ile olmayan suretlerin genelinin kapsam içerisinde olduğu kanaatini İmam Ahmed'in, Ali radıyallahu anh'dan diye rivayet ettiği hadis desteklemektedir. Buna göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden hanginiz Medine'ye gidip, orada kırmadık put ve silmedik bir suret bırakmayacak.\" Başka bir hadiste: \"Her kim bu kabilden bir şeyleri yapmaya tekrar dönerse Muhammed'in üzerine indirilmiş olanı inkar etmiş (kafir olmuş) olur\" buyurulmuştur. el-Hattabı de şöyle demektedir: Suret yapanın cezasının büyüklüğü, suretlere Allah'ın dışında ibadet ediliyor olmasındandır. Diğer taraftan bu suretlere bakan kişi fitneye maruz kalır. Bazı nefisler de suretlere meyleder. Kurtubi'nin zikrettiğine göre de cahiliye dönemi insanları her bir şeyden put yapıyorlardı. Hatta onlardan bazıları kendi putlarını acve denilen hurmadan yapmış, sonra da acıkıp onu yemiştir",
			"grades": [],
			"reference": {
				"book": 77,
				"hadith": 167
			}
		}
	]
}