{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5986,
			"arabicnumber": 5986,
			"text": "Enes İbn Malik r.a.'dan rivayete göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Kim rızkının lehine genişletilmesini, ecelinin de lehine geciktirilmesini seviyor ise akrabalık bağını gözetsin.\" Fethu'l-Bari Açıklaması: \"Akrabalık bağını gözetmesi sebebiyle rızıkta lehine genişlik verilen kimse.\" Yani akrabalık bağını gözettiği için buna mazhar olan kimse. \"Kim rızkında lehine genişlik verilmesine sevinirse ... \" Enes'in rivayet ettiği hadiste ise \"kim severse\" şeklindedir. Tirmizi de hasen olduğunu belirterek bir başka yoldan, Ebu Hureyre'den şunu rivayet etmektedir: \"Şüphesiz akrabalık bağını gözetmek, akrabalar arasında bir sevgi, malda bir bolluk, ecelde bir ertelenmediL\" Ahmed de ravileri sika olan bir sened ile Aişe'den Nebie merfu olarak şu hadisi rivayet etmektedir: \"Akrabalık bağını gözetmek, güzel komşuluk ve güzel ahlak yurtları mamur eder, ömürleri artırır.\" Müellif Buhari de el-Edebu'l-Müfred adlı eserinde İbn Ömer'den şu lafızIa bir hadis rivayet etmektedir: \"Kim Rabbine karşı takvalı olur, akrabalık bağını gözetirse onun ömrü, lehine olmak üzere uzatılır, malı bollaştırılır, akrabaları da onu sever\" İbnu't-Tın der ki: Hadisin zahir anlamı yüce Allah'ın: \"Artık ecelleri geldiği zaman ne bir saat geciktirilirler ve ne de öne geçebilirler. \"(Nahl, 61) buyruğu ile çatışma halindedir. Her ikisini şu iki şekilde telif etmek mümkündür: 1- Böyle bir fazlalık itaate muvaffakiyetin verilmesi ve vaktini ahirette kendisine faydalı olacak şeyler ile değerlendirip başka işlerde onu zayi olmaktan koruması sebebiyle ömürde bereket ihsan edileceğinden bir kinayedir. 2- Artış hakikat anlamı iledir. Bu da ömür ile görevli olan meleğin ilmine nispetle böyledir. Ayet-i kerimenin delalet ettiği birinci ecel ise yüce Allah'ın ilmine nispetle böyledir. Mesela meleğe: Filan kişinin ömrü eğer akrabalık bağını gözetirse yüz yıl, eğer koparırsa altmış yıldır denilir. Yüce Allah'ın ezeli ilminde ise onun akrabalık bağını gözeteceği ya da koparacağı bilinen bir husustur. Allah'ın ilminde sabit olan ecel ne öne alınır, ne de geriye bırakılır. Fakat meleğin bilgisinde olan, artması ve eksilmesi mümkün olan eceldir. İşte yüce Allah'ın: \"Aııah dilediğini siler ve bırakır. Ana Kitap ise onun nezdindedir. (Ra'd, 39) buyruğu ile buna işaret edilmektedir. O halde silmek ve sabit bırakmak meleğin ilmindeki bilgiye nispetledir. Ana Kitap'ta bulunan ise yüce Allah'ın ilminde sabit alandır. Bunda kesinlikle silme sözkonusu olamaz. Buna \"mübrem kaza\" adı verilir, birincisine de \"muallak kaza\" denilir. Ama birinci açıklama şekli başlıkta yer alan hadisin lafzına daha uygundur",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 17
			}
		}
	]
}