{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5990,
			"arabicnumber": 5990,
			"text": "Amr İbn Abbas'tan, o Muhammed İbn Cafer'den, o Şu'be'den, o İsmail İbn Ebi Halid'den, o Kays İbn Ebi Hazim'den diye rivayet ettiğine göre, Amr İbn el-As dedi ki: \"Ben Nebi Sallallahu Aleyhi ve Sellem'i -gizlice değil, açıkça, yüksek sesle- şöyle buyururken dinledim: Ebu ... -Buhari'nin hocası Amr dedi ki: Muhammed İbn Cafer'in kitabında burada bir beyazlık (siliklik) vardır, demiştir- ailesi, benim velilerim değildir. Benim velim ancak Allah ve salih mu'minlerdir.\" Anbese İbn Abdulvahid, Beyan'dan, o Kays İbn Amr İbn el-As 'tan diye şu fazlalığı eklemektedir: Amr İbn As dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem'i şöyle buyururken dinledim: Fakat onların benimle bir akrabalıkları vardır. Onu, onun ıslaklığıyla ıslatınm, yani yakınlığı ile o akrabalık bağını gözetirim.\" Fethu'l-Bari Açıklaması: \"Ebu ... ailesi\". çoğu nüshalarda bu şekilde künye (Ebu) lafzının izafe edildiği isim hazfedilerek zikredilmiştir. el-Müstemli ise rivayetinde bu lafzı tespit etmiş olmakla birlikte ondan kinayeli olarak: \"Ebu filanın ailesi\" demiştir. Müslim ile elİsmaill'nin rivayetlerinde de böyledir. Ebu Bekir İbn el-Arabı, \"Siracu'l-Murıdın\" adlı eserinde şunları söylemektedir: Amr İbn el-As'ın rivayet ettiği hadisin aslı: \"Şüphesiz Ebu Talib'in ailesi\" şeklinde olup daha sonra \"Ebu filanın ailesi\" diye değiştirilmiştir. İbnu'l-Arabi bu şekilde bunu kesin olarak ifade etmiş bulunmaktadır. Ancak bazıları buna itiraz etmiş ve bu hususta onu ayıplamakta ileri gitmiş, Ebu Talib ailesine hücum etmek ile ithama kadar ileri götürmüştür. Ancak onun bu iddiasına karşı çıkanlar da bu ithamlarında isabet etmemişlerdir. Çünkü İbnu'l-Arabı'nin işaret ettiği bu rivayet, Ebu Nuaym'ın Mustahrec'inde el-Fadl İbn el-Muvaffak'ın, Anbese İbn Abdulvahid yoluyla Buhari'nin zikrettiği senedie Beyan İbn Bişr'den, o Kays İbn Ebi Hazim'den, o Amr İbn el-As 'tan diye mevcuttur. Amr İbn el-As hadisi Nebie nispet ederek şöyle zikretmiştir: \"Şüphesiz Ebu Talib oğullarının benimle bir akrabalıkları vardır. Ben de onu ıslaklığı ile ıslatınm. (Bu akrabalık bağını gözetirim.)\" \"Benim velilerim değildirler.\" Buna göre velisi olmadığı söylenenler, bir topluluktur. Hepsi değildir. Çünkü Ebu Talib'in Ali arasında Ali ve Cafer de vardır. Hatta bunlar Nebi Sallallahu Aleyhi ve Sellem'e en özel yakınlığı bulunan kimselerdendirler. Çünkü her ikisinin de erken dönemlerde Müslüman olmak, İslam oluşta öncelik ve din e yardımcı olmak gibi özellikleri vardır. Ebu Talib'in Ali'nden maksadın, bizzat Ebu Talib'in kendisi olma ihtimali de vardır. Bu da yaygın bir mutlak kullanımdır. Ebu Musa el-Eş'arı hakkında: \"Şüphesiz ki ona Davud Alinin mizmarlarından bir mizmar verilmiştir\" demesi gibi, Nebi Sallallahu Aleyhi ve Sellem'in: \"Ebu Evfa'nın ailesi\" deyip, onu özellikle sözkonusu etmesi Müslüman olmayan kimseler arasındaki seçimde bir mübalağadır. Çünkü Ebu Evfa, onun amcası ve babasının anne baba bir kardeşi idi. Onun işini gözeten, ona yardım edip onu himaye eden o idi. Bununla birlikte dini hususunda ona uymayınca, Nebi onun velisi olmadığını ifade etmiş oldu. Kurtubi dedi ki: Hadis, din bakımından Müslüman ile kafir arasındaki velayet bağının, son derece yakın ve candan olsa dahi kopmuş olacağını anlatmaktadır. İbn Battal dedi ki: Bu hadis dinde velayetin vacipliğini ortaya koymakta, eğer kendi dininin mensuplarından değil iseler, akrabaları hakkında sözkonusu olmayacağını belirtmektedir. İşte bu, aralarında nesep akrabalığı bulunan kimseler arasında mirasçılığın gerçekleşebilmesi için velayet bağına ihtiyacı olduğunun delilidir. Şüphesiz ki aynı din üzere değil iseler akrabalar arasında ne mirasçılık, ne de velayet sözkonusu olur. İbn Battal der ki: İşte bundan şu da anlaşılmaktadır: Gözetilmesi emrolunan ve koparılması dolayısıyla tehdidin sözkonusu olduğu akrabalık, kendisi için bu hususun (mirasçılığın ve velayetin) meşru olduğu akrabalıktır. Din sebebi ile koparılması emrolunan ise, bunun bir istisnasıdır ve böyle bir bağı kopartan kimse hakkında tehdit sözkonusu değildir. Çünkü o, Allah'ın koparılmasını emrettiğini kopartmış birisidir. Fakat dünyevı hususlarda mubah olan şeylerde akrabalık bağları gözetilecek olursa, bu bir fazilet olur. Nitekim Nebi Sallallahu Aleyhi ve Sellem de daha önce Kureyş kendisini yalanlamış olduğundan kıtlık musibetine uğramaları için beddua ettikten sonra, ondan kendilerine acımasını isteyince, akrabalık bağı sebebiyle ondan bu istekte bulunduklarından onlara karşı yumuşadı, acıdı ve onlara dua etti. Derim ki: Onun bu açıklamalarına şu iki yerde itiraz olunur: 1- Onun söylediği bu çerçeveye kendisinin zikretmediği başkaları da girer. Çünkü o buradaki olumsuz ifadeyi İslam dini üzere olmayan kimselere hasretmiştir. Oysa hadisin zahirinden anlaşıldığına göre, dinin amelleri bakımından ameli salih olmayan kimseler de bu nefyin (olumsuz ifadenin) kapsamına girmektedir. Çünkü hadiste veli oluşu \"salih müminler\" ile kayıtlamış bulunmaktadır. 2- Katirin akrabalık bağını gözetmenin, küfürden döneceğinden ümit kesilmesi yahut onun sulbünden Müslüman bir kimsenin çıkacağının ümit edilmesi şartı ile kayıtlanması gerekir. Onun delilolarak gösterdiği hususta görüldüğü gibi, o da Nebi Sallallahu Aleyhi ve Sellem'in Kureyş'e bolluk verilmesi için dua etmesi halidir. Buna da buna yakın bir gerekçe göstermiştir. O halde katir olan akrabasını gözetmek ruhsatını kullanmak isteyen kimsenin, bu kabilden bir maksadının da olması gerekir. Dini kabul etmiş olmakla birlikte, -mesela amellerde kusuru bulunan kimse ise- bu konuda katir ile ortak değildir. Nitekim el-Mişkat Şerhi'nde şu ifadeler yer almaktadır: Yani ben hiç kimseyi akrabalık sebebiyle veli edinmem. Ben ancak yüce Allah'ı onun kulları üzerindeki yerine getirmesi gereken hakkı sebebiyle seviyorum. Salih müminleri de yüce Allah için seviyorum. Kimi veli edinirsem ben imanı ve salih olması sebebiyle veli edinirim. Bu kişi ister akraba olsun, ister olmasın, ama akrabalığı olan kimselerin de sıla-i rahim haklarına bu sebeple riayet ederim. Bu, oldukça güzel bir açıklamadır",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 21
			}
		}
	]
}