{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5993,
			"arabicnumber": 5993,
			"text": "Abdullah'tan, o Halid İbn Said'den, o babasından, o Halid İbn Said'in kızı Ümmü Halid'den dedi ki: \"Üzerimde sarı bir gömlek bulunduğu halde babam ile birlikte Resulullah Sallallahu Aleyhi ve Sellem'in yanına gitmiştim. Resulullah Sallallahu Aleyhi ve Sellem: \"Seneh, seneh\" diye buyurdu. Abdullah dedi ki: Bu lafız Habeşçe'de güzel demektir. Ümmü Halid dedi ki: \"Ben nübüvvet mührü ile oynamaya koyuldum. Bu sebeple babam beni azarladı. Resulullah Sallallahu Aleyhi ve Sellem ise: Onu bırak, dedi. Daha sonra Resulullah Sallallahu Aleyhi ve Sellem şöyle dedi: Gömleğini eskit ve parala, sonra yine eskit ve parala, sonra yine eskit ve parala.\" Abdullah: Ümmü Halid uzun bir ömür yaşadı ve nihayet. .. diyerek, onun ne kadar uzun süre hayatta kaldığını anlattı. Fethu'l-Bari Açıklaması: \"Başkasının kız çocuğunun kendisinin bedeninin bazı bölümleri ile oynamasına izin veren kimse yahut onu öpen ya da onunla şakalaşan kimse.\" İbnu't-Tın dedi ki: Bu başlıkta kaydedilen haberde çocuğun öpülmesi sözkonusu edilmemiştir. Ümmü Halid'i bedenine dokunmaktan alıkoymamasını muhtemelen onu öpmesi gibi değerlendirdiğinden dolayı ayrıca bunu belirtmiş olabilir. Nitekim İbn Battal da buna işaret etmiş bulunmaktadır. Ama bence daha güçlü olan şudur: Öpmekten sonra şakalaşmanın sözkonusu edilmesi, özelden sonra genelin sözkonusu edilmesi kabilindendir. Çünkü küçük kız çocuğu ile sözlü ve fiili olarak şakalaşmaktan maksat, onun ısınmasını sağlamaktır. Onu öpmek de bu kabildendir. Başlıktaki bu hadisin açıklaması daha önce Giyim bölümünde, \"siyah hamısa\" başlığında geçmiş bulunmaktadır. \"Gidip nübüvvet mührü ile oynamaya başladım. Babam beni azarladı.\" Bağırarak bu işten vazgeçmemi söyledi. \"Kaldı\". Maksat sözü edilen elbisedir. Bu açıklama hadiste geçen fiilin müenneslik alameti taşımaması haline göredir. Nitekim çoğu nüshalarda böyledir. Ancak EbD. Zerr rivayetinde \"Ümmü Halid kaldı\" anlamını verecek şekildedir. \"Nihayet... zikretti.\" Çoğunluk bunu \"zekera\" şeklinde zel harfi ile rivayet etmiştir. İfade, ravi uzunca bir zaman zikretti, söyledi, takdirindedir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 24
			}
		}
	]
}