{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5999,
			"arabicnumber": 5999,
			"text": "Peygamber'in zevcesi Âişe (r.anha) tahdîs edip şöyle dedi: kerre yanında kendisine âid iki kız çocuğu bulunan bir kadın bana geldi, benden birşey vermemi istiyordu. Fakat o sırada benim yanımda bir tek hurmadan başka birşey bulamadı. Ben o tek hurmayı kadına verdim. Kadın onu iki kızı arasında taksim etti. Sonra kalktı ve çıkıp gitti. Akabinde Peygamber içeri girdi, ben kendisine kadının yaptığını söyledim. Peygamber(sallallahü aleyhi ve sellem):\"Her kim bu kız çocuklarından herhangi birşeye (bakıma, terbiyeye) velayet eder ve onlara iyilik edip güzel muamelede bulunursa, o kız çocukları kendisi için cehennem ateşinden koruyan bir perde olurlar\" buyurdu. Katâde (el-Hâris ibn Rıb'î el-Ensârî -radıyallahü anh) şöyle demiştir: Peygamber(sallallahü aleyhi ve sellem) bizim yanımıza çıktı, omuzu üzerinde damadı Ebû'l-Âs ibnu'r-Rabî' ibn Abdişşems ile kızı Zeyneb'den olma kız torunu Umâme vardı. Peygamber bu Ebû'l-Âs kızı Umâme'yi taşıyarak namaz kıldırdı. Rukû'a vardığı zaman onu yere kor, rukû'dan başını kaldırdığı zaman onu yerden tekrar kaldırır idi Hureyre (radıyallahü anh) şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem) torunu el-Hasen ibn Alî'yi öptü, o sırada yanında el-Akra' ibn Hâbis et-Temîmî oturmakta idi. el-Akra': Benim on tane çocuğum vardır, onlardan hiçbirini öpmedim, dedi. ona doğru baktı, sonra da: \"Merhamet etmeyen merhamet olunmaz\" buyurdu. (r.anha) şöyle dedi: Peygamber'e bedevî bir Arab geldi de: (Yâ Rasûlallah!) Sizler çocukları öper (sever) misiniz? Biz çocuklarımızı öpüp okşamayız, dedi. (sallallahü aleyhi ve sellem): \"Allah senin gönlünden merhamet ve şefkati çekip çıkarmıştır. Ben senin için neye mâlik olabilirim (yani ne yapabilirim)?\"diye cevâb verdi. Zeyd ibn Eslem, babası Eslem'den; o da Omer ibnu'l-Hattâb (radıyallahü anh)'dan şöyle tahdîs etti: Peygamber(sallallahü aleyhi ve sellem)'in huzuruna (Havâzin kabilesinden) birtakım esirler gelmişti. Bunların içinde emzikli bir kadın vardı. (Çocuğunu kaybetmişti.) O kadın göğsüne biriken sütü sağıyor, çocuklara veriyor, emziriyordu. Bu kadın esirler arasında çocuğu (nu) bulunca hemen alıp onu sinesine bastı ve (derin bir şefkatle) çocuğunu emzirmeye başladı. Bu yüksek şefkat levhasını görünce Peygamber bize: \"Şu kadının kendi çocuğunu ateşe atacağını sanır mısınız?\" dedi. de: Hayır, atmamağa muktedir oldukça atmaz! dedik. Peygamber (sallallahü aleyhi ve sellem): \"İşte Yüce Allah kullarına bu kadının çocuğuna şefkatinden daha merhametlidir\"buyurdu",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 30
			}
		}
	]
}