{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6015,
			"arabicnumber": 6015,
			"text": "İbn Ömer r.a.'dan dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Cibril bana komşuyu o kadar tavsiye edip durdu ki, sonunda onu mirasçı kılacağını zannettim.\" Fethu'l-Bari Açıklaması: \"Cibril bana komşuyu o kadar çok tavsiye edip durdu ki, sonunda onu mirasçı kılacağını zannettim.\" Yani Cibril'in, Allah'tan aldığı emir üzere komşuyu komşuya mirasçı kılacağını zannettim. Burada mirasçı kılmaktan maksadın ne olduğu hakkında görüş ayrılığı vardır. Akrabalar ile birlikte ona da verilecek bir pay tayin edilmek suretiyle malda onun ortak edileceği anlamında olduğu söylenmiştir. Bu husustaki haber, böyle bir mirasçı kılmanın gerçekleşmediğini de ortaya koymaktadır. İbn Ebi Cemra dedi ki: Komşu (el-car) lafzı Müslümanı da, kafiri de, abidi de, fasıkı da, arkadaşı da, düşmanı da, yabancıyı da, hemşeriyi de, faydalıyı da, zararlıyı da, yakını da, uzağı da, evi daha yakın olanı da, daha uzak olanı da kapsar. Komşunun, biri diğerinden daha üstün pek çok mertebesi vardır. Bunun en yüksek mertebede olanı, kendisinde ilk olarak sayılan bütün niteliklerin bulunduğu şahıstır. Sonra da daha çok bulunan daha önde gelir ve yalnızca bu niteliklerden sadece birisini taşıyana kadar iner. Abdullah İbn Amr -hadisi rivayet edenlerden birisidir- bunu genel anlamı ile yorumlamıştır. Bu sebeple kendisi için bir koyun kesildiğinde o koyundan Yahudi komşusuna hediye verilmesini emretmiştir. Bu rivayet i Buhari, el-Edebu'lMüfred'de ve hasen olduğunu belirterek Tirmizi rivayet etmiştir. Sözünü ettiğim bu hususlara Taberani'nin rivayet ettiği merfu bir hadiste işaret edilmiş bulunmaktadır: \"Cabir r.a., Nebi Sallallahu Aleyhi ve Sellem'den şöyle buyurduğunu rivayet etmektedir: Komşular üç türlüdür. Bir komşu vardır ki tek bir hakkı vardır, bu da müşrik olandır. Bunun yalnızca komşuluk hakkı vardır. Bir komşu da vardır ki iki hakkı bulunmaktadır. Bu da komşuluk hakkı ile İslam hakkı bulunan kimsedir. Bir komşu da vardır ki üç hakkı vardır. Bu da akrabalık bağı bulunan Müslüman (komşu) kişidir. Bunun komşuluk, Müslüman olmak ve akrabalık hakları vardır.\" Şeyh Ebu Muhammed İbn Ebi Cemra dedi ki: Komşu haklarının korunması, imanın kemalindendir. Cahiliye dönemi insanları da bu hakka dikkat eder ve korurlardı. Komşu hakkına riayet etmeye dair emre uymak hediye, selam, onunla karşılaşıldığı vakit güler yüz göstermek, halini kollamak, ihtiyaç duyduğu hallerde ona yardımcı olmak ve buna benzer güç çerçevesinde ona çeşitli yollarla iyiliklerde bulunmakla gerçekleşir. Aynı şekild maddi ya da manevi türlü eziyetıerin ona ulaşmasına neden olacak sebepleri önlemek de böyledir. Nebi Sallallahu Aleyhi ve Sellem -bir sonraki hadiste geleceği üzere- kötülüklerinden yana komşusu emin olmayan kimsenin imanının olmayacağını söylemiştir. Bu ise komşunun hakkının büyüklüğünü ortaya koyan, mübalağa yollu bir ifade olup ona zarar vermenin büyük günahlardan olduğunu göstermektedir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 46
			}
		}
	]
}