{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"9": "Times of the Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "Bize Ebû Usmân, Ebû Bekr'in oğlu Abdurrahmân'dan tahdîs etti. O şöyle demiştir: Ashâbu's-Suffa bir takım fakır insanlardı. Bir defa Peygamber(sallallahü aleyhi ve sellem):\"Evinde iki kişilik yiyeceği olan, onlardan bir üçüncüsünü, dört kişilik yiyeceği olan bir beşincisini yahut altıncısını alıp birlikte götürsün\" buyurdu. Ebû Bekr bunlardan üçünü eve getirdi. Peygamber de on kişiyi evine götürdü. Bizim ev halkı ben, Bâbam, anam, bir de bizim ev ile Ebû Bekr'in evinde müşterek hizmet eden hizmetçiden ibaretti. (Râvî Ebû Usmân:) Abdurrahmân, bir de benim zevcem dedi mi, demedi mi bilemiyorum, dedi. Yine Abdurrahmân şöyle dedi: Ebû Bekr, Peygamber'in evinde akşam yemeğini yedi, sonra yatsı namazı kılınıncaya kadar orada kaldı. Sonra evine dönüp (müsâfirlerin ağırlanmasını ailesine emrederek) Peygamber akşam yemeğini yiyinceye kadar kaldı. Müteakiben geceden Allah'ın dilediği kadar geçtikten sonra evine geldi. Karısı ona: Seni konukların yanında bulunmaktan alıkoyan nedir? dedi. O da: Onlara hâlâ yemek vermedin mi? dedi. O da: Sen gelmedikçe yemek yemiyeceklerini söylediler, yemek çıkardık; kabul etmediler, dedi. Abdurrahmân dedi ki: Ben gidip saklandım. Ebû Bekr bana: Hey câhil! diye bağırdı. Akabinde oradakilere: Buyurun, yiyiniz, dedi ve: Vallahi ben bu yemekten ebediyyen yemiyeceğim, diye de ilâve etti. Abdurrahmân dedi ki: Allah'a yemîn olsun biz yerken hiçbir lokmaya el uzatmadık ki, altından yemek daha ziyâde çoğalmış olmasın. Nihayet doydular, yemek de yenmezden evvelki mikdârından daha çok olarak duruyordu. Ebû Bekr yemeğe baktı, bir de gördü ki, olduğu gibi duruyor, yahut da daha çoğalmış. Karısına hitaben: Ey Firâs oğulları'nın kız kardeşi! Bu nedir? dedi. O da: Gözümün nuruna yemîn ederim ki, yemek şimdi evvelkinden üç kat daha çoktur, dedi. Bunun üzerine Ebû Bekr o yemekten yedi de, etmiş olduğu yemînini kasdederek: O olan söz şeytandandır, dedi. Sonra o yemekten bir lokma yedi, sonra o yemeği Peygamber'e götürdü. Yemek onun yanında sabaha kadar durdu. Bizimle bir kavm arasında bir ahd vardı. Müddet son bulmuştu. (Bunun için Medine'ye gelmişlerdi). İçlerinden oniki kişi ayırdık. Her biri ile beraber kaç kişi olduğunu Allah bilir; işte onların hepsi o yemekten yediler. ( Râvî Ebû Usmân rivayetini bitirdikten sonra:) Yâhud bu lâfızlara benzer lâfızlarla söyledi, dedi",
			"grades": [],
			"reference": {
				"book": 9,
				"hadith": 77
			}
		}
	]
}