{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6022,
			"arabicnumber": 6022,
			"text": "Said İbn Ebi Burde İbn Ebi Musa el-Eş'arı'den, o babasından, o dedesinden, dedi ki: \"Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Her Müslümana bir sadaka düşer. Ashab: Ya bulamazsa, diye sordu. Allah Rasulü: Eliyle çalışır, hem kendisine faydası dokunur, hem tasadduk eder, buyurdu. Ashab: Eğer gücü yetmezse ya da böyle yapmazsa, diye sordular. Allah Rasulü: Bunaimış derecedeki ihtiyaç sahibi kimseye yardım eder, buyurdu. Ashab: Eğer yapmazsa diye sordular. Allah Rasulü: O halde iyiliği emretsin -yahut: marufu emretsin- buyurdu. Ashab: Eğer bunu da yapmazsa diye sordu. Allah Rasulü: Şer işlemekten kendisini alıkoyar. Şüphesiz ki bu, onun için bir sadakadır, buyurdu.\" Fethu'l-Bari Açıklaması: \"Her bir maruf (bir iyilik) bir sadakadır.\" İbn Battal dedi ki: Bu hadis, kişinin hayır namına yaptığı her bir işin yahut söylediği her bir sözün karşılığında ona bir sadaka yazılacağına delildir. İbn Ebi Cemra dedi ki: \"Maruf\" adı, şeriatin delilleri ile iyiliğin amellerinden olduğu bilinen her şeyin ismidir. Adeten bu işin böyle olup olmaması arasında fark yoktur. Sadakadan maksat ise sevaptır. Eğer bu işle birlikte niyet de olursa sahibi kesin olarak ecir alır, değilse ecir alması ihtimali vardır. (Devamla) dedi ki: İşte bu, sözde sadakanın sadece hissedilir maddi işlere munhasır olmadığına da işaret etmektedir. Mesela, sadaka vermek, sadece varlıklı kimselere ait bir imkan değildir. Aksine herkes çoğu hallerde herhangi bir zorlukla da karşılaşmaksızın onu yapabilecek gücü bulabilir. Hadisteki \"her Müslüman üzerinde bir sadaka vardır\" ifadesi, mekarim-i ahlak hususunda böyle bir yükümlülük vardır, demektir. Yoksa bu, icma' ile bir farz değildir. İbn Battal dedi ki: Sadakanın asıl anlamı, kişinin malından tatawu olmak üzere çıkarıp verdiğidir. Kişinin yaptığı bu işle, sadakati isabet ettirmek üzere vacip (farz) olan hakkında da kullanılır. Kişinin hakkından olmakla birlikte kendisi ile başkasını kollayıp gözettiği her bir şeye sadaka denilir. Çünkü o, bu yolla kendisine tasaddukta bulunmuş olur. İbn Battal dedi ki: Bu hadiste çalışıp kazanmaya da dikkat çekilmektedir. Böylelikle kişi kendisine gerekli harcamaları yapacak ve kazancından tasaddukta bulunacak, dilenmenin zilletinden de kendisini kurtarmış olacak. Hadis ayrıca mümkün olduğu kadar hayır işlemeye ve bu hayırlardan herhangi bir işe yönelip de onda zorlukla karşılaşırsa bir başkasına geçmesine, başkasına yönelmesine de bir teşvik vardır. \"Eğer\" acizliğinden yahut tembelliğinden \"yapamazsa\" demektir. \"Eğer yapamazsa, diye sordular. Allah Rasulü: Şer işlemekten kendisini alıkoysun ... buyurdu.\" İbn Battal dedi ki: Bu hadiste kelamcılar arasından bir işi terk etmek amel değildir, diyenlerin aksine terkin, kul için bir amel ve bir kesb ifade ettiğini kabul eden kimseler lehine bir delil vardır. el-Mühelleblden de diğer hadisin bir benzeri şöylece naklediimiştir: \"Kim bir kötülük yapmak isteyip de onu yapmayacak olursa, ona bir hasene olarak yazılır.\" Derim ki: Bu hadisin şerhine dair açıklamalar ileride Rikak bölümünde gelecektir. Buna göre \"hasene, kötülük işlemeyi kararlaştırıp da, onu yüce Allah için terk edip işlememesi halinde iyilik olarak yazılır.\" İşte o vakit böyle bir terk de amele dönüşür ve bu da kalbin bir fiili demektir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 53
			}
		}
	]
}