{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6051,
			"arabicnumber": 6051,
			"text": "Ebu Hureyre'den şöyle dediği rivayet edilmiştir: \"Nebi Sallallahu Aleyhi ve Sellem bize öğle namazını iki re kat olarak kıldırdıktan sonra selam verdi. Sonra da mescidin ön taraflarındaki bir tahta parçasının yanında ayakta durdu, elini de onun üzerine koydu. -O gün cemaat arasında Ebu Bekir ve Ömer dahi vardı. Her ikisi de onunla (bu hususta) bir şeyler konuşmaktan çekindiler.- Cemaat de alelacele dışarı çıkıp gitti ve kendi aralarında: Namaz kısaldı, diye konuştular. Yine cemaat arasında Nebi Sallallahu Aleyhi ve Sellem'in kendisini zulyedeyn (uzun kollu) diye çağırdığı bir adam da vardı. Bu zat: Ey Allah'ın Nebii, sen mi unuttun yoksa namaz mı kısaldı, diye sordu. Allah Rasulü: Ne ben unuttum, ne de namaz kısaldı, buyurdu. Hazır bulunan cemaat de: Hayır, ey Allah'ın Rasulü unuttun, dediler. Bunun üzerine Allah Rasulü: Zulyedeyn doğru söyledi, deyip kalktı ve iki rekat namaz kıldı, sonra da selam verdi. Sonra da tekbir getirip secdesi gibi ya da daha uzun bir secde yaptı, sonra tekbir getirerek başını kaldırdı, sonra da başını koyarak secdesi gibi ya da daha uzun bir secde yaptı, sonra tekbir getirerek başIni kaldırdı.\" Fethu'l-Bari Açıklaması: \"İnsanlardan\" niteliklerini belirterek \"uzun boylu, kısa boylu gibi nitelemelerle söz etmenin ve kişiyi ayıplama maksadıyla söylenmeyen sözlerin caiz olması -nitekim Nebi Sallallahu Aleyhi ve Sellem da: Zulyedeyn ne diyor diye buyurmuştur-.\" Bu başlık,lakap takmanın ve kişinin kendisinde bulunmakla birlikte öyle nitelendirilmesinden hoşlanmayan kimseden o lakapla söz etmenin hükmünü açıklamak için açılmış bir başlıktır. Bununla ilgili yapılacak açıklamanın hülasası şudur: Eğer lakap, lakap verilen kimsenin hoşuna giden ve bunda şeriatın yasaklamış olduğu aşırı övgü ve tazim ifadesi bulunmayan bir lakap ise caizdir ya da müstehaptır. Eğer o lakap, o kimsenin beğenmediği lakaplardan ise haram yahut mekruhtur. Ama olakapla şöhret kazanıp onu zikretmeksizin başkasından ayırt edilememe halinde olduğu gibi, onu tanıtmak için başka bir yol kalmamış ise (o lakabı kullanmak caizdir.) Buhari'nin bu hususta benimsediği böyle bir ayrımı cumhur da benimsemiştir. Ama bazıları istisna teşkil ederek bu konuda işi sıkı tutmuşlardır. Hatta el-Hasen el-Basrı'den şöyle dediği nakledilmiştir: Ben bizim Humeyd et-Tavıı (uzun boylu Humeyd) dememizin gıybet olacağından korkuyorum. Sanki Buhari burada Zulyedeyn kıssasını hatırlatmakla buna işaret etmiş gibidir. Çünkü bu kıssada: \"Cemaat arasında elleri (kolları) bir parça uzun bir adam da vardı\" ifadesi de geçmektedir. İbnu'l-Müneyyir der ki: Buhari bu gibi sözleri. kullanmanın, açıklamak ve başkalarından ayırt etmek amacıyla zikredilmesi halinde caiz olacağına, eğer o kişinin değerini azaltmak ve küçük düşürmek için ise caiz olmayacağına işaret etmiş bulunmaktadır. (Devamla) dedi ki: Aişe'nin, yanına giren kadın hakkında eliyle kısa olduğuna işaret ettiği belirtilen bir hadiste de, Nebi s.a.v.'in: \"Sen onun gıybetini yapmış oldun\" dediği sabittir. Buna sebep ise Aişe r.a.a'nın bu işi bir açıklamada bulunmak kastıyla yapmamış olmasıdır. O bunu, o kadının niteliğini bildirme kastıyla yapmıştı. Bu sebeple onun bu işi bir çeşit gıybete benzemiş oldu",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 81
			}
		}
	]
}