{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6056,
			"arabicnumber": 6056,
			"text": "Hemmam'dan, dedi ki: \"Biz Huzeyfe ile birlikte idik. Ona: Bir adam var ki Osman'a söz götürüyor, denildi. Huzeyfe: Ben Nebi Sallallahu Aleyhi ve Sellem'i: Cennete koğuculuk yapan hiçbir kimse giremez, buyururken dinledim, dedi.\" Fethu'l-Bari Açıklaması: \"Neml'menin (laf taşıyıcılığın) mekruh oluşu\". Buhari bu başlık ile fesad çıkarmak ciheti ile aktarılan birtakım sözlerin -mesela, hakkında konuşulan kimsenin kafir olması halinde olduğu gibi- caiz olacağına işaret etmiş gibidir. Nitekim kafirler ülkesinde tecessüs ve onlara zarar verecek bilgileri aktarmak da caizdir. \"Yüce Allah'ın: \"Ayıplayıp duran, onun bunu sözünü taşıyan.\"Sl buyruğu\" Rağıb der ki: İnsanı hemzetmek, onun gıybetini yapmaktır. Nemm etmek (neml'me, koğuculuk yapmak) ise sözü taşıyıp götürmek suretiyle açıklamaktır. Neml'menin asıl anlamı sessizce fısıldamak ve hareket etmek demektir. Humeze ise hemz işini (gıybet işini) çokça yapan kimseye denir. Lümeze de böyledir. Çünkü lemz, kusurların peşine düşüp onları açığa çıkarmak için araştırmaktır. el-Gazzall' özetle şunları söyler: Kendisine başkasının söylediği sözler getirilen kimsenin, bu sözü getireni doğrulamaması ve kendisinden bu sözlerin aktarıldığı kimse hakkında bunları söylediğini düşünmemesi, kendisine aktarılanların gerçek olup olmadığını araştırmaması, o sözü getiren kimseye bu işten vazgeçmesini söylemesi, yaptığı işi çirkin görmesi, vazgeçmediği takdirde ona buğzetmesi, laf getiren kimsenin bu yaptığı şeyin bir benzerini kendisi için uygun görmeyip kendisi de o laf getiren hakkında laf taşıyarak nemi me yapan kişi olmaması gerekir. Nevevi der ki: Bütün bu hususlar, o sözün aktarılmasında şer'i bir masIahat bulunmaması halinde böyledir. Aksi takdirde (yani şer'i bir masıahat varsa) nemime müstehap ya da vaciptir. Bir kimsenin, bir başkasının haksız yere bir kişiye eziyet vermek istediğini öğrenip de o kişiyi kendisine eziyet vermek isteyene karşı uyarması gibi ... Aynı şekilde imama yahut kamu sorumluluğu bulunan kimseye onun vekilinin yaptığı uygulamayı haber vermesi gibi hususlar da yasaklanmış değildir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 86
			}
		}
	]
}