{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6061,
			"arabicnumber": 6061,
			"text": "Abdurrahman İbn Ebi Bekre'den, onun babasından rivayetine göre \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'in huzurunda sözkonusu edilince bir başka adam onu hayırla yad edip övdü. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem: Vay sana be adam, sen arkadaşının boynunu kopardın -diye defalarca tekrarladı.- Eğer sizden bir kimse mutlaka (bir başkasını) övecek ise -ve o kimsenin o halde olduğunu görüyor ise- şöyle ve şöyle zannediyorum, desin. Onu hesaba çekecek olan ancak Allah'tır ve Allah'a rağmen, Allah'a karşı kimseyi de temize çıkarmaya kalkmasın, buyurdu.\" Vuheyb, Halid'den naklen \"(Veyhake: vay sana be adam, yerine): veyleke: sana ve yı olsun\" demiştir. Fethu'l-Bari Açıklaması: \"Aşırı övmenin mekruh oluşu.\" Buradaki et-temaduh (aşırı övme) medh'ten tefaul vezninde olup aşırı ve mubalağalı övmek, demektir. Temedduh bu iş için kendisini zorlamak, mümadehe ise iki kişinin karşılıklı olarak birbirlerini övmesi demektir. İbn Battal dedi ki: Nehyden anlaşılan şudur: Bir kimse bir başkasını onda olmayan şeylerle övmekte aşırı giderse, övülen kimsenin kendisini beğenmeyeceğinden yana emin olunamaz. Çünkü o, kendisinin o konumda olduğunu zannetmeye başlayacaktır. Belki de kendisi nitelendirilirken söylenenlere bel bağlayarak iyi ameli bırakır, daha çok hayır işlemeyi terk eder. Bundan dolayı ilim adamları \"(yüzünüze karşı) çokça öven kimselerin yüzlerine toprak saçınız\" şeklindeki diğer hadis ile ilgili olarak şu açıklamayı yapmışlardır: Maksat, insanların yüzlerine karşı batıl bir şekilde onları öven kimselerdir. Ömer dedi ki: Medhetmek, zebhetmenin (övmek, boğazı kesmenin) kendisidir, demiştir. Bir kimseyi taşıdığı bir nitelik dolayısıyla öven kimsenin bu yaptığı ise nehyin kapsamına girmez. Çünkü Nebi Sallallahu Aleyhi ve Sellem şiirlerde, hutbelerde ve onunla yapılan hitaplarda övülmüş, ama kendisini öven kimsenin yüzüne toprak saçmamıştır. --- İbn Battal'dan özetle nakil, burada sona ermektedir. --- İbn Uyeyne dedi ki: Kendisini bilen kimseye medhin zararı olmaz. Seleften kimileri de şöyle demiştir: Kişi yüzüne karşı medhedildiği takdirde: Allah'ım, sen bana onların bilmediklerini mağfiret buyur, onların söyledikleri sebebiyle beni sorumlu tutma ve beni onların sandıklarındari daha hayırlı kıl, demelidir. Bunu Beyhaki, Şuabu'l-İman'da rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 91
			}
		}
	]
}