{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6072,
			"arabicnumber": 6072,
			"text": "Enes İbn Malik'ten, dedi ki: \"Medine halkı cariyelerinden herhangi bir cariye, Resulullah Sallallahu Aleyhi ve Sellem'in elinden tutar ve onu istediği yere götürebilirdi. \" Fethu'l-Bari Açıklaması: \"Kibir\". Rağıb dedi ki: Kibir, tekebbür ve istikbar birbirine yakın anlamdadır. Kibir, insanın kendisini beğenmekten dolayı özel bir halinin adıdır. O da kendisini başkalarından büyük görmesidir. Bunun en ileri hali ise kişinin Rabbine karşı büyüklenerek hakkı kabul etmeyip onu tevhid etmeyi, ona itaat i reddedip boyun eğmemesidir. Tekebbür iki şekilde ortaya çıkar: 1- Güzel fiillerinin, başkalarının güzelliklerinden daha fazla olması halidir. Bundan dolayı şanı yüce Allah \"el-mütekebbir\" diye nitelendirilmiştir. 2- Kendisinde olmayan bir şeyin var olduğunu göstererek, bu işi zorla sahiplenmeye kalkışması. Bu da genelolarak mütekebbir insanların vasfıdır. Yüce Allah'ın: \"Allah büyüklük taslayan her zorbanın kalbini işte böyle mühürler.\"(Mu'min, 35) buyruğunda olduğu gibi ... Müstekbir de buna benzer. \"Onu alıp istediği yere götürebiliyordu.\" Burada \"elinden tutmakıltan maksat, bunun ifade ettiği anlamdır. O da gösterdiği yumuşaklık ve ona uymaktır. Hadis, tevazuu konusunda çeşitli mübalağa ifadelerini de ihtiva etmektedir. Çünkü erkeği değil kadını, hür kadın değil cariyeyi sözkonusu etmiştir. Cariyeler lafzını da genelolarak zikretmiş, herhangi bir cariye için bile bunun sözkonusu olduğunu ifade etmiştir. \"İstediği yere\" ifadesiyle de onu alıp dilediği yere götürebilmesinin mümkün olduğunu anlatmıştır. Bu da Nebi Sallallahu Aleyhi ve Sellem'in ileri derecede alçak gönüllü olduğunu, kibrin her çeşidinden bütünüyle uzak olduğunu göstermektedir. Kibrin yerilmesi ve alçak gönüllü lüğü n övülmesi ile ilgili pek çok hadis varid olmuştur. Bunların en sahihlerinden birisi, Müslim'in Abdullah İbn Mesud'dan rivayet ettiği Nebi Sallallahu Aleyhi ve Sellem'in şu buyruğudur: \"Kalbinde kibir namına zerre ağırlığı kadar bir şey bulunan kimse, cennete girmeyecektir. Ona: Ya adam elbisesinin güzel, ayakkabısının güzelolmasını arzu eder(se), diye soruldu. Allah Rasulü: Kibir, hakka karşı başkaıdırmak ve insanları küçük görmektir, buyurdu.\" Yine Müslim, lyad İbn Himar'dan, Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu rivayet etmektedir: \"Şüphesiz Allah bana, kimse kimseye karşı haksızlık etmeyecek şekilde alçak gönüllü olunuz, diye vahyetmiştir.\" Alçak gönüllülüğün emredilmesi, kibrin yasaklanması demektir. Çünkü kibir, alçak gönüllülüğün zıttıdır. Kibir küfürden ve benzeri hususlardan daha geneldir. Müslüman hakkında tevili hususunda da görüş ayrılığı vardır. Cennete ilk girecekler arasında, kibirli Müslüman cennete giremeyecektir denildiği gibi, cezasını çekmeden giremeyecektir, diye de açıklanmıştır. Onun cezası cennete girmemektir, ama af da edilebilir, demiştir. Bu ifade ( ... cennete girmeyecektir ifadesi), kibirden vazgeçirmek ve vebalinin ağırlığını anlatmak için zikrediimiştir. Zahirinden anlaşılan kastediimiş değildir, diye de açıklanmıştır",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 102
			}
		}
	]
}