{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6098,
			"arabicnumber": 6098,
			"text": "Tarık'tan, dedi ki: \"Abdullah dedi ki: Şüphesiz sözün en güzeli Allah'ın kitabı, hedyin (önderliğin) en güzeli de Muhammed Sallallahu Aleyhi ve Sellem'in gösterdiği yoldur.\" Bu Hadis 7277 numara ilede geçiyor Fethu'l-Bari Açıklaması: \"Dell: Davranış, tutum\". Yürüyüş, konuşma ve başka hallerde güzel hareket etmek demektir. Yol hakkında da kullanılır. \"Semt: Dini hususlarda görünüş\". Din ile ilgili hususlarda görünüşün güzelliği demektir. İşte mutedil olmak, yol ve cihet hakkında da kullanılır. \"Hedy\". Ebu Ubeyd dedi ki: AsIında el-hedy ve ed-dell birbirine yakın anlamIardadır. Sekinet ve vakar, heybet, görünüş ve şe mail (bedeni özellikler) hakkında da kullanılır. Semt genelde güzellik ve süs cihetiyle değil de hayır ve dil bakımından güzel görünüş ve güzel heyet anlamındadır. YOI hakkında da kullanılır. Kişinin İslam ehlinin yolu üzere, hayır ehlinin kılığında olması cihetiyle her ikisi de güzel anlamdır. Hadis-i şerifte İbn Mesud'un pek üstün bir fazileti sözkonusu edilmektedir. Çünkü Huzeyfe onun insanlar arasında bu özellikler bakımından Resulullah Sallallahu Aleyhi ve Sellem'e en ileri derecede benzeyen birisi olduğuna tanıklık etmektedir. Bu ifadelerde kişinin bilmediği şeyler hakkında kanaat belirtmekten sakınmak da dile getirilmektedir. Çünkü Huzeyfe: \"Evinden çıktığı zamandan döndüğü vakte kadar\" demiş ve bu tanıklığında tanıklık etmesi mümkün olan bu kadarı ile yetinmiştir. Diğer taraftan: \"Ailesi ile birlikte başbaşa kaldığında da ne yaptığını bilmiyoruz.\" demiştir. Çünkü ailesi ile başbaşa kaldığı takdirde, ailesi ile hoş geçinip onlarla rahat etmesinin, Resulullah Sallallahu Aleyhi ve Sellem'in hanımları ile birlikteki halinden daha fazla ya da eksik olmasını mümkün görmüştür. Bu sözleri ile Abdullah radıyaııahu anh hakkında eksiltici bir ifade kullanmayı da kastetmiş değildir. Buhari el-Edebu'l-Müfred'de, Zeyd İbn Vehb yoluyla şu rivayeti nakletmektedir: \"Ben İbn Mesud'u şöyle derken dinledim: Şunu bilin ki, ahir zamanda güzel bir yaşayış, bazı amellerden daha hayırlıdır.\" Hadisin senedi sahihtir. Böyle bir ifade de kişinin kendi görüşüne dayanarak söylenemez. Sanki İbn Mesud, bundan dolayı yaşayışının, hal ve hareketlerinin güzelolmasına çokça dikkat eder, gayret gösterirdi",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 125
			}
		}
	]
}