{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6128,
			"arabicnumber": 6128,
			"text": "Ebu Hureyre'den rivayete göre; \"Bir bedevi gelip mescidde küçük abdest bozdu. İnsanlar üzerine atılmak üzere ona doğru kalktılar, ama Resulullah Sallallahu Aleyhi ve Sellem onlara: Ona ilişmeyiniz, onun sidiği üzerine de bir kova su dökünüz. Şüphesiz sizler kolaylaştırıcılar olarak gönderildiniz, zorlaştırıcılar olarak gönderilmediniz, buyurdu.\" Fethu’l-Bari Açıklaması: \"Kolaylaştırın.\" Bu, kolaylaştırma emridir. Bundan maksat kimi zaman teskin etmek, kimi zaman da kolaylık sağlamak yolunu seçmektir. Çünkü nefret ettirip uzaklaştırmak çoğunlukla zorluk ile karşılaşan kişi hakkında sözkonusu olur. Bu da teskinin zıttıdır. Müjdelemek de çoğunlukla sükunet halinde olan için sözkonusudur. Bu da nefret ettirmenin zıttıdır. Ebu Musa ile Muaz İbn Cebel radıyalliihu anh'ın Yemen'e gönderilme zamanlarıyla ilgili açıklamalar, Megazi bölümünün son taraflarında geçmiş bulunmaktadır. Eşribe (içecekler) bölümünde de el-bit' denilen içkiye dair açıklamalar geçmişti. Taberi der ki: Kolaylaştırmanın emredilmesi, ağır gelen nafileler hakkındadır. Böylelikle bu nafileler kişiye usanç verip büsbütün onları terke sebep teşkil etmesin yahut gücü yetmeyen kimsenin farz namazı oturarak kılması, yolcunun ramazanda oruç açması gibi ruhsat verilen hususlarda amelini beğenerek büsbütün ecrinin boşa çıkmasına ve bu halin de kendisi için meşakkat teşkil etmesine sebep olmasın. Başkası ise mutlaka ikisinden birisi kaçınılmaz ise, iki zarardan daha hafif olanın işleneceği hususunu ek olarak açıklamıştır. Mescidde küçük abdest bozan bedevi alayında görüldüğü gibi Üçüncü hadis olan Aişe radıyalliihu anhii'nın dediği şekilde IIResulullah Sallallahu Aleyhi ve Sellem iki işten birisini seçmek hususunda serbest bırakılırsa ... \" hadisi olup buna dair açıklamalar \"Nebi Sallallahu Aleyhi ve Sellem'in niteliği, sıfatı\" bölümünde geçmiş bulunmaktadır. Başlıktaki dördüncü hadis, Ebıl Berze'nin rivayet ettiği hadistir. \"Aramızda kendine has görüşü olan bir adam vardı.\" Bu kişinin adını tespit edemedim. Bu hadis Namaz bölümünün son taraflarında (1211.hadiste) şu lafızia geçmiş bulunmaktadır: \"Haricilerden bir adam şöyle demeye koyuldu ... \" İşte dayanak olarak alınan ifade de budur. \"Görüş\"ten maksat da Haricilerin görüşüdür. Bozuk görüşlü birisi vardı, demektir. Hadisin şerhi de belirtilen yerde geçmiş bulunmaktadır. Başlıktaki beşinci hadis, Ebıl Hureyre'nin mescidde küçük abdestini bozan bedevi arabın olayı ile ilgili hadistir. Bu hadise de daha önce \"Rıfk\" başlığında işaret edilmiş ve şerhinin de Taharet bölümünde geçtiği belirtilmiş idi. Bu hadislerden anlaşıldığına göre, ibadet ve başka şeylerde aşırıya kaçmak ve itidal sınırını aşmak, yerilmiş bir şeydir. Bütün bu hususlarda övülen şey, devamlı yapılabilecek ve kişinin kendisini beğenmekten ve diğer helak edici hallerden yana emin hissettiği kadarıdır",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 155
			}
		}
	]
}