{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6138,
			"arabicnumber": 6138,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Allah'a ve ahiret gününe iman eden bir kimse, misafirine ikram etsin. Allah'a ve ahiret gününe iman eden bir kimse, akrabalık bağını gözetsin. Allah'a ve ahiret gününe iman eden bir kimse, ya hayır söylesin yahut sussun.\" Fethu'l-Bari Açıklaması: \"Misafire ikram etmek, ona bizzat hizmet etmek ve yüce Allah'ın: \"İbrahim'in şerefli kılınmış konuklarının haberi sana geldi mi?\" (Zariyat, 24) buyruğu.\" Bundan sonra Buhari üç hadis sözkonusu etmektedir. Bunların biri Ebu Şureyh'in: \"Allah'a ve ahiret gününe iman eden bir kimse, misafirine ikram etsin\" buyruğudur. Hadisin anlamı şudur: Bir kimse konuşmak istedi mi konuşmadan önce düşünsün. Eğer söyleyeceği bu sözler dolayısıyla kendi aleyhine bir kötülük gelmeyecekse yahut haram ve mekruh olan bir şeye götürmeyecekse konuşsun. Şayet söyleyeceği söz mubah ise mubah olan konuşmanın onu haram ve mekruha sürüklememesi için susmakta esenlik vardır. Ebu Zerrlin rivayet ettiği ve İbn Hibban'ın sahih olduğunu belirttiği uzun hadiste \"sözlerinin amelinden sayıldığını bilen bir kimsenin konuşması, kendisini ilgilendiren hususlar hariç pek az olur.\" buyurulmaktadır. İkinci hadis, Ebu Hureyre'nin rivayet ettiği hadistir. et-Tufi şöyle demektedir: Hadisin zahiri böyle diyen kimse hakkında imanın sözkonusu olmamasını gerektirmektedir. Oysa kasıt bu değildir, aksine bu sözlerle mubalağalı bir anlatım kastediimiştir. Bir kimsenin: Eğer benim oğlumsan bana itaat et, demesine benzer. O bu sözleri ile oğlunun kendisine itaat şevkini uyandırmak istemiştir. Yoksa onun kendisine itaat etmemesi halinde onun oğlunun da olmayacağı anlamında değildir. Üçüncü hadis ise Ukbe İbn Amir'in rivayet ettiği hadistir. \"Ey Allah'ın Rasulü, sen bizleri gönderiyorsun, biz de bir kavmin topraklarına konaklıyoruz. Onlarsa bizi ağırlamıyorlar. .. \" Bu hadisin açıklaması daha önce Mezailm bölümünde (2464.hadiste) geçmiş bulunmaktadır. Ebu Şureyh'in rivayet ettiği hadisteki: \"Misafirin caizesi bir gün ve bir gecedir\" ifadesi, caize olmak üzere ona bir gün ve bir gece ikramda bulunulur, demektir. \"Misafirlik üç gündür. Bundan sonrası ise sadakadır.\" İbn Battal dedi ki: Bu hadise dair Malikle soru soruldu da o şöyle dedi: Bir gün, bir gece ona ikram eder, onu ağırlar. Üç gün de misafir olarak onu ağırlar. Derim ki: Üç gün birinci günün dışında mıdır yoksa bu ilk gün bu üç günden sayılacak mıdır hususunda ilim adamları ihtiiM etmişlerdir. Ebu Ubeyd dedi ki: Birinci günde ona iyilik etmek ve lütufkar davranmak hususunda elinden geleni yapar. İkinci ve üçüncü günde ise hazırda ne varsa ona takdim eder ve adeti üzere yediğinden fazlasını da ona takdim etmez. Sonra da ona bir gün ve bir gecelik mesafede kendisine azık olarak yetecek kadarını verir. Buna da \"el-elze\" adı verilir. Bu ise misafirin, sayesinde bir yerden bir yere kadar gidebileceği miktarın adıdır. Diğer hadiste geçen: \"Gelen heyete benim kendilerine yaptığım ikram gibi ikramda bulunun\" ifadesi de bu kabildendir. \"Onu usandınncaya kadar.\" Dara sokuncaya kadar, ona sıkıntı verinceye kadar, o muayyen yerde ikamet etmesin, demektir. Nevevı, Müslim'in: \"Onu günaha sokuncaya kadar\" rivayetini açıklarken: Onun günaha düşmesine sebep oluncaya kadar demektir, demiştir. Çünkü bu durumda ev sahibi uzun süre ka!ışından dolayı onun gıybetini yapabilir yahut onu rahatsız edecek şeylerle ona karşılık verebilir ya da onun hakkında herhangi bir zan besleyebilir. Bütün bu açıklamalar, kalmanın ev sahibinin tercihi ile olmaması halinde sözkonusudur. Ev sahibi ondan daha çok kalmasını ister ya da zannı galibi ile onun bundan hoşlanmadığı kanaatine ulaşırsa, hüküm böyle olmaz",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 165
			}
		}
	]
}