{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6167,
			"arabicnumber": 6167,
			"text": "Enes'ten rivayete göre; ''Çöl halkından bir adam Nebi Sallallahu Aleyhi ve Sellem'e gelerek: Ey Allah'ın Rasulü, kıyamet ne zaman kopacaktır, diye sordu. Allah Rasulü: Veyl sana! Onun için ne hazırladın, diye sordu. Adam: Ben onun için bir şey hazırlamadım. Şu kadar var ki, gerçekten ben Allah'ı ve Rasulünü seviyorum, dedi. Allah Rasulü: Şüphesiz sen sevdiklerinle berabersin, buyurdu. Bizler: Biz de böyle miyiz, diye sorduk. Allah Rasulü: Evet deyince, o gün çokça sevindik. Daha sonra Muğire'nin benim yaşlarımda olan bir oğlu geçti. Allah Rasulü: Eğer bunun eceli sonraya bırakılacak olursa, kıyamet kopmadıkça yaşlanmayacaktır, buyurdu.\" Fethu'l-Bari Açıklaması: \"Adamın: Veyleke demesi ile ilgili gelen rivayetler.\" Bu lafzın açıklaması daha önce Hac bölümünde, o bölümün ilk hadisleri geçince yapılmış bulunmaktadır. \"Veyı\" kelimesinin aslının \"vey\" olduğu söylenmiştir. Bu kelime ah vah (üzüntü) kelimesidir. Araplar: Filan kişiye vayolsun, sözlerini çokça kullandıklarından bununla birlikte, sonuna bir de lam harfini eklediler ve bu harfi de o kelimedenmiş gibi değerlendirdiler. el-Esmaı'den şöyle dediği nakledilmiştir: \"Veyı\" lafzı, muhatabın yaptığı işin çirkinliğini anlatmak için kullanılır. Rağıb da şöyle demektedir: Bazen hasret ve üzüntü anlamında kullanılır. \"Veyh\" kelimesi ise acı ma iflade eder. Beşinci (6163 nolu) hadis Ebu Said el-Hudri'nin rivayet ettiği Zülhuvaysıra hakkındaki hadistir. Orada belirtildiği üzere Zulhuvaysıra: \"Ey Allah'ın Rasulü, adaletli ol, deyince Allah Rasulü ona: Veyl sana, ben ad aletli olmazsam kim adaletli olacak diye buyurdu.\" Hadisin bazı bölümlerine dair açıklamalar Meğazi bölümünün sonlarında, Nubuwetin alametleri bahsinde (3610.hadiste) geçmiş bulunmaktadır. (6167 nolu hadiste geçen): \"Benim yaşıtlarımdan olan\" ifadesi yaşça benim gibi idi. \"Kıyamet kopuncaya kadar\" ifadesi ile ilgili olarak el-İsmailı, buradaki kıyamet (saat) lafzından kastın, Nebi Sallallahu Aleyhi ve Sellem'in huzurunda bulunanların saati (kıyameti) olduğunu, bununla da onların ölümlerinin kastedildiğini, ölümleri günü hakkında da kendilerini ahirette olup bitecek işler ile karşı karşıya bırakacağı için \"saat\" adını kullandığını, bunu da yüce pek çok ayet ve hadisin delalet ettiği üzere büyük kıyametin kopacağı zamana dair bilgiyi kendisine sakladığına dair buyrukları desteklediğini belirttikten sonra şunları söylemektedir: Nebi Sallallahu Aleyhi ve Sellem'in: \"Kıyamet kopuncaya kadar\" buyruğu ile kıyametin kopacağı zamanı sınırlayıp belirlemek değil de yakınlığını mubalağa yoluyla ifade etmek olması ihtimali de vardır. Nitekim bir başka hadiste: \"Ben ve (kıyamet) saattil bu ikisi gibi gönderildik\" diye buyurmuş olması da buna benzemektedir. Yoksa Nebi Sallallahu Aleyhi ve Sellem, sözü geçen çocuğun ihtiyarlık yaşına erişmesi esnasında kıyametin kopacağını kastetmiş değildir. (el-İsmaill devamla) dedi ki: Bu, Arapların oldukça yaygın bir kullanımıdır. İşin öneminin azameti ve önemsizliği ya da bir şeyin çok yakın yahut çok uzak olduğunu anlatmak için mubalağa maksadıyla kullanılır: Böylelikle sonuç olarak bundan: Kıyametin oldukça yakın bir zamanda kopacağı anlamı çıkar",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 193
			}
		}
	]
}