{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6178,
			"arabicnumber": 6178,
			"text": "Abdullah İbn Ömer r.a. şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem'in şöyle buyurdu: \"Hiç şüphesiz verdiği sözde durmayan kimse için kıyamet gününde hıyaneti ölçüsünde sancak dikilecek ve denecek ki: Bu filan oğlu filanın sözünde durmaması(nın alametildir, denilecektir.\" Hadisin geçtiği diğer yerler: 6177, 6966 ve 7111 Fethu'l-Bari Açıklaması: \"İnsanların babalarının adı ile çağrılmaları.\" İbn Battal dedi ki: Bu hadiste kıyamet gününde insanların babalarının hallerinin örtülüp saklanması amacıyla ancak annelerinin adı ile çağrılacaklarını iddia edenlerin görüşü reddedilmektedir. Derim ki: Bu da Taberani'nin, İbn Abbas'tan diye rivayet ettiği ve senedi oldukça zayıf bir hadistir. İbn Battal dedi ki: Kişinin babasının adı ile çağrılması, daha ileri derecede bir tanıtma ve başkalarından ayırt etmek bakımından da daha beliğ, daha ileri bir derecedir. Hadisten işlerin zahirine göre hüküm vermenin caiz olduğu anlaşılmaktadır. Derim ki: Bu da hadisteki \"babalar\" lafzının dünyada kişinin kendisine nispet edildiği babası hakkında yorumlanmasını, gerçekte babası olduğu kimse hakkında anlaşılmamasını gerektirmektedir ki, kabul edilen görüş de budur. İbn Battal'ın buna dair açıklamaları için bu husustaki şerhine bakılabilir. İbn Ebi Cemra da şöyle demiştir: Gadr etmek (sözünde durmamak) küçük büyük her şey hakkında geneldir. Bundan anlaşıldığına göre yüce Allah'ın açığa çıkarmayı murad ettiği her bir günah işleyen kimse için kendisi ile tanınacağı bir alamet koyacağıdır. Bunu yüce Allah'ın: \"Günahkarlar simalarından (alametlerinden) tanınacaktır ... \"(Rahman,41) buyruğu da desteklemektedir. İbn Ebi Cemra devamla der ki: Hadisin zahirinden anlaşıldığına göre her bir sözde durmayış için bir bayrak dikilecektir. Buna göre aynı kişinin, sözünde durmaması sayısınca birden çok bayrağı olacaktır. Bayrağın dikilmesindeki hikmete gelince, ceza çoğunlukla günahın zıttı iledir. Sözünde durmayış gizli yapılan işlerden olduğu için bunun cezasının da teşhir edilmek suretiyle olması uygundur. Bir bayrağın dikilmesi ise, Araplara göre bir şeyi açıklayıp yaymanın en ileri derecesidir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 202
			}
		}
	]
}