{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6183,
			"arabicnumber": 6183,
			"text": "Ebu Hureyre r.a.'dan, dedi ki: Resulullah Sallallahu Aleyhi ve Sellem: \"Bir de el-kerm diyorlar. Oysa el-kerm, ancak mu'minin kalbidir, buyurdu.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in:' el-Kerm, ancak mu'minin kalbidir buyruğu. Ayrıca Nebi Sallallahu Aleyhi ve Sellem: Müflis kıyamet gününde iflas edendir, buyurmuştur. Bu da: \"Rakibin sırtını yere getirmek, ancak öfkelendiği vakit kendi nefsine hakim olanın yaptığıdır.\" Nebi efendimiz: \"Allah'tan başka melik yoktur\" buyurarak onu, mülkün nihai olarak ona ulaşacağıyla nitelendirmiştir. Daha sonra hükümdarları sözkonusu ederek: \"Şüphesiz hükümdarlar bir şehre girdiklerinde orayı ifsad ederler. \"(NemI, 34) buyurmaktadır.\" Buhari'nin amacı (hadis-i şerifteki) sınırlandırıcı (hasr) ifadenin zahiri üzere olmadığını, \"kerm\" adını daha çok hak edenin mu'minin kalbi olduğunu anlatmaktır. Ondan başkasına kerm adının verilmeyeceğini kastetmemiş olduğuna işaret etmektir. Nitekim Nebi Sallallahu Aleyhi ve Sellem'in: \"Müflis ancak kıyamet gününde iflas eden kimsedir\" buyruğundan maksat da, sözünü ettiği kimsedir. Yoksa dünya hayatında iflas eden kimseye de müflis denilmez, demek istememiştir. Aynı şekilde \"rakibinin sırtını yerine getiren kişi ancak. .. \" ifadesi de böyledir. \"Allah'tan başka melik yoktur\" ifadesi de böyledir. Bu sözlerle başkasına me lik (kral, hükümdar) adının verilmeyeceğini kastetmemiştir. Bununla ancak gerçek anlamdaki hükümdarlığı (malik oluşu) kastetmiştir. Başkasına melik adı verilse de böyledir. Bunun için de yüce Allah'ın: \"Şüphesiz hükümdarlar. .. (melikler)\" buyruğunu delil göstermiştir. İbn Battal şuna da işaret etmiştir: Bu ifadelerden, niteliği sözkonusu edilen kimse o nitelemeleri hak etmiyor ise, nitelendirmede aşırıya gidip ileriye götürmenin terk edilmesi gerektiği de anlaşılmaktadır. el-Hattabi de özetle şunları söylemektedir: Buradaki yasaklamadan maksat, hamrın (sarhoşluk verici içkinin, şarabın) isminin büsbütün silinmesi de dahil olmak üzere, haram kılınışının daha da pekiştirilmesidir. Çünkü onun bu adının bırakılması, yaşatılması, cahiliye dönemi insanlarının vehmettikleri, içki içen kimsenin kerem sahibi olacağı şeklindeki kanaatlerini benimsemek olur. Bundan dolayı üzüme \"kerm\" adının verilmesini nehyederek: \"Kerm ancak mu'minin kalbidir\" diye buyurmuştur. Buna sebep ise mu'minin kalbindeki iman nuru ve İslam hidayetidir. Nevevi der ki: Bu hadiste üzüme \"kerm\" adının verilmesinin, ağacına da aynı şekilde bu ismin verilmesinin nehyedilmesi, mekruhluk ifade etmek içindir. Kurtubi, el-Mazeri'den şunu nakletmektedir: Bu yasağın sebebi şudur: Onlara hamr haram kılınınca, tabiatıarı da onları kerm (cömertlik)e teşvik ettiğinden, Nebi Sallallahu Aleyhi ve Sellem haram kılınan bu içeceği n adının anılması esnasında kendilerinde arzu ve istek uyandıracak bir isimle adlandırılmasını hoş görmedi. Çünkü böyle bir anış onları tahrik edici olabilirdi. Ancak buna şöyle itiraz edilmiştir: Hadiste nehyedilen şey, üzüme kerm adının verilmesidir. Yoksa üzümün kendisi haram değildir. Hamr'a da üzüm denilmez. Aksine üzüme bazen sonunda olacak şeyin adı ile \"hamr\" adı verilebilir. Derim ki: el-Mazeri'nin söylediği, uygun bir açıklamadır. Çünkü içkinin esasını teşkil eden meyveye böyle güzel bir isim vermek, terk edilmek suretiyle o içkinin kökünün kazınması isteğine yorumlanır. Şeyh Ebu Muhammed İbn Ebi Cemra da özetle şunları söylemektedir: \"Kerem\" niteliği \"kerm\"den türetildiği, kerime diye nitelendirilen arazi türünün arazilerin en güzeli olmasından dolayı, bu niteliğin eşyanın en hayırlısı olan mu'minin kalbinden başkasına verilmesi uygun düşmez. Çünkü mu'min, canlı türlerinin en hayırlısıdır. Ondaki en hayırlı şey de onun kalbidir. Zira onun kalbi düzelirse, bedeninin tamamı düzelir. Onun kalbi iman ağacının yeşerdiği topraktır, arazidir. (Devamla) der ki: Bu hadisten şu da anlaşılır: Lafız, mana yahut her ikisi ya da bundan türetilmiş yahut onunla adlandırılmış hayırlı her bir şey, şeriatteki gerçek anlamına izafe edilir. Çünkü iman ve iman ehli olan mu'minler, eğer bundan başkasına izafe edilecek olursa bu mecazi olur. Kermin mu'minin kalbine benzetilmesi de oldukça incelikli bir anlam taşır. Çünkü şeytan Ademoğlunun içerisinde nasıl kan ın aktığı gibi akıyorsa, şeytanın nitelikleri de üzüm ile bu şekilde cereyan eder. Nasıl ki üzümün suyunu koklamadan gaflete düşen bir kimse o suyun şaraba dönüşüp necis olmasına sebep oluyorsa, mu'min de şeytandan yana gaflete düşecek olursa bu, onu emirlere muhalefete iter. Bu benzetmeyi güçlendiren diğer husus da şudur: Hamr (şarap) ya kendiliğinden yahut onu dönüştürmek suretiyle sirke oluverir ve böylelikle (necisken) tahir olur. mu'min de nasCıh bir şekilde tevbe ederse derhal daha önce onlarla nitelendirildiğinden ötürü kendisini kirletmiş bulunan önceki günahların pisliğinden tertemiz oluverir O, bu tevbeye ya öğüt ve buna benzer başkasının etkisi ile yönelir, -bu da şarabı sirkeleştirmeye benzer- yahut kendiliğinden bu yola gider. Bu da şarabın kendiliğinden sirkeye dönüşmesine benzer. O halde aklı başında olan bir kimsenin, yerilen niteliğe sahip halde ölüp gitmemek için kalbini tedaviye yönelmesi gerekir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 207
			}
		}
	]
}