{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6185,
			"arabicnumber": 6185,
			"text": "Enes İbn Malik'ten rivayete göre; \"Kendisi ve Ebu Talha, Nebi Sallallahu Aleyhi ve Sellem ile birlikte (seferden) dönüyorlardı. Nebi Sallallahu Aleyhi ve Sellem ile birlikte Safiyye vardı. Onu kendi devesinin terkisine bindirmişti. Yolun bir yerinde iken deve tökezledi. Nebi Sallallahu Aleyhi ve Sellem ile Safiye r.anha yere düştüler, Ebu Talha, kendisini devesinden aşağı atatcasına Resulullah Sallallahu Aleyhi ve Sellem'in yanına gitti ve: Ey Allah'ın Nebii, Allah beni yoluna feda etsin! Sana bir şeyoldu mu, diye sordu. Allah Rasulü: Hayır, ama kadına dikkat et, buyurdu. EbD. Talha kendi elbisesini yüzüne koyarak Safiyye radıyalliihu anhii'nın bulunduğu yere doğru gitti ve elbisesini onun üzerine bıraktı. Safiyye radıyalliihu anha ayağa kalktı, sonra da EbD. Talha onların eşyalarını develeri üzerinde güzelce bağladı. Her ikisi (Nebi ve Safiyye) deveye binip yola koyuldular. Nihayet Medine sırtına vardıklarında -yahut, Medine'yi yüksekten gördükleri zaman Nebi Sallallahu Aleyhi ve Sellem: AibD.ne, taibD.ne, abidD.ne li Rabbina hamidD.ne: Biz dönücüleriz, tevbe edenleriz, ibadet edenleriz, Rabbimize hamd edenleriz, buyurdu ve Medine'ye girene kadar bu sözlerini tekrarlad!.\" Fethu'l-Bari Açıklaması: \"Kişinin: Allah beni yoluna feda etsin, demesi.\" Yani böyle bir söz mubah mıdır yoksa mekruh mudur? Bu sözü söylemenin caiz olduğuna delil teşkil eden bütün haberleri EbD. Bekir İbn Ebi Asım \"Adabu'l-Hukema\" adlı eserinin baş taraflarında zikretmiş ve bunun caiz olduğunu kesin bir dille söyleyerek şunları ifade etmiştir: Kişinin bunu sultanına, büyüğüne, ilim sahiplerine, kardeşlerinden sevdiği kimselere söylemesi mümkündür ve bunda onun için herhangi bir sakınca yoktur. Hatta o kişiye saygı göstermek, onun kalbini kendisine daha çok meylettirmek için yaparsa sevap dahi kazanır. Eğer bunu söylemek yasak olsaydı, Nebi Sallallahu Aleyhi ve Sellem bu sözü söyleyeni nehyeder ve ona bunun kendisinden başkasına söylenmesinin caiz olmadığını öğretirdi. Daha sonra Buhari Enes'in, Safiyye radıyalliihu anha'yı bineğinin arkasına bindirmiş olması ile ilgili hadisi zikretmektedir. Bu hadise dair açıklamalar Libas (giyim) bölümünün sonlarında (5968.hadiste) geçmiş bulunmaktadır. İbn Ebi Asım da İbn Ömer'den şu hadisi rivayet etmektedir: Nebi Sallallahu Aleyhi ve Sellem Fatıma'ya: \"Baban sana feda olsun\" diye buyurmuştur. İbn Mesud'dan naklettiği rivayete göre de Nebi Sallallahu Aleyhi ve Sellem ashabına: \"Babam anam size feda olsun\" demiştir. Enes'in rivayet etmiş olduğu hadise göre de Nebi Sallallahu Aleyhi ve Sellem, bunun bir benzerini ensar için de söylemiştir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 209
			}
		}
	]
}