{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6186,
			"arabicnumber": 6186,
			"text": "Cabir r.a.'dan, dedi ki: \"Bizden bir adam'ın bir oğlu dünyaya geldi. Ona el-Kasım adını verince, biz de: Biz seni Ebu'l-Kasım künyesi ile çağırmayız ve sana ikram da etmeyiz, dedi. O da Nebi Sallallahu Aleyhi ve Sellem'e durumu haber verince, Allah Rasulü: Oğluna Abdurrahman adını ver, buyurdu.\" Fethu'l-Bari Açıklaması: \"Aziz ve celil olan Allah'ın en sevdiği isimler.\" Bu lafızIa Müslim'in, Naf! yoluyla İbn Ömer'den merfu olarak rivayet ettiği şu hadis varid olmuştur: \"Size verilen isimler arasında Allah'ın en sevdiği isimler Abdullah ve Abdurrahman'dır.\" Kurtubi dedi ki: Bunlara benzeyen Abdurrahim, Abdulmelik ve Abdussamed gibi isimler de bunlar gibi değerlendirilir. Bunların yüce Allah'ın en sevdiği isimler olması, şanı yüce Allah'ın hakkında vacip olan bir sıfat ile insanın sıfatı olan, onun için vacip olan ubCıdiyeti aynı zamanda ihtiva etmeleri, sonra da kulun yüce Rabbe gerçek manada izafe edilmesi dolayısıyladır. Böylelikle bu isimlerin her bir kelimesi bir hakikate karşılık gelmekte ve bu terkib ile bu isimler şeref kazanmaktadır. Bundan dolayı da bu gibi isimler böyle bir fazilete sahip olmuşlardır. Başkası da şöyle demektedir: Sadece bu iki ismin sözkonusu edilmesindeki hikmet, Kur'an-ı Kerim'de şanı yüce Allah'ın isimleri arasında bu iki ismin dışında herhangi bir ismin kula izafe edilerek zikredilmemiş olmasıdır. Nitekim yüce Allah şöyle buyurmaktadır: \"Şu da bir gerçek ki Allah'ın kulu (Abdullah) ona ibadet etmek için ayağa kalktığı zaman ... \"(Cin, 19) diye buyurmaktadır. Bir başka ayette de: \"Rahmanın kulları ... (ibadurrahman -ki ibad, abd'in çoğuludur-)\"(Furkan, 63) diye buyurmaktadır. Yüce Allah'ın: \"İster Allah diye dua edin, ister Rahman diye çağırın ... \"(İsra, 110) buyruğu da bunu desteklemektedir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 210
			}
		}
	]
}