{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6193,
			"arabicnumber": 6193,
			"text": "Abdulhamid İbn Cubeyr İbn Şube'den, dedi ki: \"Said İbn el-Müseyyeb'in yanında oturdum. Bana tahdis ettiğine göre dedesi Hazn, Nebi Sallallahu Aleyhi ve Sellem'in huzuruna gelince, ona: Adın nedir, diye sormuş. Dedesi: Adım Hazn'dır deyince, Allah Rasulü: Hayır, sen Sehl'sin, demiş. Dedesi: Ben babamın bana verdiği adı değiştirmem, demiş. İbnu'l-Müseyyeb dedi ki: İşte ondan sonra bizde hep sertlik olagelmiştir, dedi.\" Fethu'l-Bari Açıklaması: \"el-Münzir İbn Ebi Useyd dünyaya gelince, Nebi Sallallahu Aleyhi ve Sellem'e getirildi.\" Ebu Useyd meşhur bir sahabidir. Ashabın herhangi birisinin bir oğlu dünyaya geldi mi onu tahnik etmesi (damağına hurma gibi tatlı bir şey çalması) ve ona bereket ile dua etmesi için getirilirdi. \"Nebi Sallallahu Aleyhi ve Sellem önündeki bir şeyle uğraşt!.\" Onunla meşgul oldu, oyaland!. Seni bir başka şeyle uğraşmaktan alıkoyan her bir şey hakkında hadisteki tabir kullanılır. İbnu't-Tin dedi ki: Meşguloldu, oyalandı anlamındaki bu \"alime\" vezninde \"lehiye\" diye rivayet edilmiştir ki meşhur olan kullanım budur. Leha şeklindeki fethalı kullanım ise Taylıların ağzıdır. Zeyneb'in adı Berre idi. Amr İbn Merzuk, Şube'den bu senedie Ebu Hureyre'den rivayetle: \"Meymune'nin adı Berre idi\" demiştir. Bunu da musannıf, el-Edebu'l-Müfred'de ondan diye rivayet etmiştir. Ancak birincisim yaşça daha büyüktür. Sözü geçen Zeyneb ise ya Cahş kızı Zeyneb'dir. Yahut da Ebu Seleme'nin kızı Zeyneb'dir. Birincisi Nebi Sallallahu Aleyhi ve Sellem'in zevcesidir, ikincisi ise onun rabibesidir. (Yani Nebi efendimizin hanımı olan Ümmü Seleme'nin ilk kocası Ebu Seleme'den doğma kızıdır.) Bunların her birisinin de adı önce Berre idi. Nebi Sallallahu Aleyhi ve Sellem bu ismi değiştirdi. İbn Abdilberr öyle demiştir . Cahş kızı Zeyneb'in kıssasını Müslim ve Ebu Davud, Ümmü Seleme'nin kızı Zeyneb'den diye rivayet ettiği bir hadisin muhtevasında zikretmiştir. Ümmü Seleme'nin kızı Zeyneb dedi ki: Bana Berre adı verilmişti. Nebi Sallallahu Aleyhi ve Sellem kendi kendinizi tezkiye etmeyiniz. Şüphesiz Allah sizden hanginizin birr (iyilik) ehli olduğunu en iyi bilendir, buyurdu. Bu sefer: Peki ona ne ad verelim, diye sordular. Allah Rasulü: Ona Zeyneb adını veriniz, buyurdu.\" \"Bana tahdis ettiğine göre dedes1 Hazn ... \" Taberi dedi ki: Anlamı çirkin olan bir adın verilmemesi gerekir. O ismi taşıyanı tezkiye etmeyi gerektiren ismin de sövmek ve hakaret anlamına gelen ismin de verilmemesi gerekir. Resulullah Sallallahu Aleyhi ve Sellem pek çok isim değiştirmiştir. Ama onun bu değiştirmesi bu isimleri vermenin yasaklanışı suretinde değildir. Tercih suretindedir. Devamla der ki: Bundan dolayı Müslümanlar çirkin kimseye hasen, bozuk adama salih adının verilmesini caiz görmüşlerdir. Buna da Hazn'in adının Sehl'e çevrilmesini kabul etmeyince, kabul etmesi için Nebi Sallallahu Aleyhi ve Sellem'in onu zorlamamış olması delildir. Eğer bu bağlayıcı olsaydı, Nebi Sallallahu Aleyhi ve Sellem onun: \"Babamın bana verdiği bir adı değiştirmem\" şeklindeki cevabını kabul etmezdi. ----İktibas özetle burada sona ermektedir",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 217
			}
		}
	]
}