{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6204,
			"arabicnumber": 6204,
			"text": "Sehl İbn Sa'd'dan, dedi ki: \"Şüphesiz Ali r.a.'ın en sevdiği ismi Ebu Turab idi ve gerçekten onunla çağrılmaktan çok memnun olurdu. Ona Ebu Turab adını da Nebi Sallallahu Aleyhi ve Sellem'den başkası vermemiştir. Şöyle ki: Bir gün Ali, Fatıma'ya kızmış, evden çıkıp mesciddeki bir duvarın yanında yatıp uzanmıştı. Nebi Sallallahu Aleyhi ve Sellem onun arkasından gelmiş ve birisi: İşte Ali, duvarın yanında uzanmış yatıyor, demişti. Nebi Sallallahu Aleyhi ve Sellem yanına geldi. Sırtı toprakla dolmuştu. Nebi Sallallahu Aleyhi ve Sellem sırtından toprağı siliyor ve bu arada: Otur ey Ebu Turab, diyordu.\" Fethu'l-Bari Açıklaması: Hadisten, bir kişiye birden çok künyenin verilmesinin, künye lafzı ile ve kişinin durumuna uygun türetilecek lafızlar ile lakap vermenin caiz olduğu anlaşılmaktadır. Lakap, büyük birisi tarafından küçüğe verilecek olursa küçük de bunu övücü bir lafız olmasa dahi kabul eder. Bunu eksiltici bir ifade olarak yorumlayanların da yorumlarına itibar edilmez. İbn Battal dedi ki: Hadisten anlaşıldığına göre, fazilet ehlinden olup büyük kimse ile eşi arasında insan tabiatında bulunan öfke ve kızgınlığı gerektiren haller ortaya çıkabilir. Bazen bu, kişinin evinden çıkıp gitmesine de sebep olabilir. Bundan dolayı da böyle bir kimseyi ayıplamak sözkonusu olamaz. Derim ki: Ali'nin evden çıkıp gitmesinin sebebi, kızgınlıkla Fatıma r.a.'YI incitecek birtakım davranışlar gösterebilme korkusu da olabilir. Böylelikle tartışmayı sona erdirmiş ve her birisinin kızgınlığının geçmesine fırsat tanımış oldu. Bu hadisten Nebi Sallallahu Aleyhi ve Sellem'in üstün ahlakı da anlaşılmaktadır. Çünkü o Ali'yi hoşnut etmek için yanına gitmiş, neşesinin yerine gelmesi için de sırtından toprağı silmiştir. Onun bu halinden çıkartılan, sözü geçen künyeyi de ona vererek onunla latife yapmış olduğudur. Bununla birlikte kızı Fatıma'nın nezdindeki üstün konumuna rağmen, Fatıma'ya kızdı diye Ali'ye sitem etmemiştir. Buradan da sıhri akrabalara yumuşak davranmanın ve sevgilerinin devamını sağlamak için onlara sitemde bulunmayı terk etmenin müstehap olduğu anlaşılmaktadır. Çünkü kin tutacağından korkulan kimselerin siteminden ancak korkulur. Yoksa bundan münezzeh olan kimsenin siteminden çekinilmez",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 228
			}
		}
	]
}