{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6207,
			"arabicnumber": 6207,
			"text": "Usame İbn Zeyd r.a.'dan, dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem Bedir vakasından önce Haris İbn el-Hazrec oğulları diyarında bulunan Sa 'd İbn Ubade'ye hasta ziyaretinde bulunmak için üzerinde Fedek dokuması saçaklı bir kadife eğer bulunan bir eşeğe binerek gitti. Usame'yi de arkasına bindirmişti. Bu halde yolda giderken aralarında Abdullah İbn Ubey İbn Selul'ün de bulunduğu, oturmakta olan bir topluluğun yanından geçti. Abdullah İbn Ubey henüz Müslüman olmamıştı. Oturanlar arasında Müslümanlar, puta tapıcı müşrikler ve Yahudiler bir arada karışık durumda idiler. Müslümanlar arasında Abdullah İbn Revaha da vardı. Bineğin çıkardığı toz, meclisi kaplayınca, İbn Ubey ridası ile burnunu kapattı ve: Üzerimize toz çıkarmayınız, dedi. Resulullah s.a.v. onlara selam verdikten sonra durdu ve bineğinden inip onları Allah'a davet etti, onlara Kur'an okudu. Buna karşılık Abdullah İbn Ubey İbn Selul ona: Eyadam! Eğer bunlar bir hak ise söylediklerinden daha güzeli yoktur. Ama biz meclislerimizde otururken yanımıza gelip onu söyleyerek bizi rahatsız etme! Yanına gelen olursa sen de ona anlat, dedi. Abdullah İbn Revaha: Hayır, ey Allah'ın Rasulü, biz meclislerimizde bulunuyorken yanımıza buyur. Biz bunu seviyoruz, dedi. Nihayet Müslümanlar, müşrikler, Yahudiler karşılıklı ağır sözler söylediler. Neredeyse kavgaya tutuşacaklardı. Resulullah s.a.v., onlar susuncaya kadar onları teskin edip durdu. Sonra da Resulullah Sallallahu Aleyhi ve Sellem bineğine bindi. Yola koyuldu ve nihayet Sa'd İbn Ubade'nin yanına girdi. Resulullah Sallallahu Aleyhi ve Sellem: Ey Sa'd, Ebu Hubab'ın -Abdullah İbn Ubey'i kastediyor- söylediklerini duymadın mı? O şunları şunları söyledi, dedi. Buna karşılık Sa'd İbn Ubade: Ey Allah'ın Rasulü, babam sana feda olsun. Onu affet ve bağışla. Sana kitabı indirene yemin ederim ki, bu belde halkı ona taç giydirmek ve krallara mahsus sarığı ona sarmak üzere antlaşmış bulunuyorlardı. Allah sana vermiş olduğu hak ile bunu geri çevirince, hevesi de kursağında kaldı. İşte onun bu hali senin bu gördüklerini yapmaya itti, dedi. Resulullah Sallallahu Aleyhi ve Sellem da onu affetti. Resulullah Sallallahu Aleyhi ve Sellem ve ashabı müşrikleri de, kitap ehlini de Allah'ın kendilerine emrettiği şekilde affediyorlar, eziyetıere sabrediyorlardı. Nitekim yüce Allah: \"Muhakkak siz, sizden önce kitap verilenlerden ve şirk koşanlardan çok ezalar işiteceksiniz.\"(Al-i İmran, 186) ve: \"Kitap ehlinden bir çoğu ... sizi imanınızdan sonra kafirler olarak geriye döndürmeyi çok isterler. \"(Bakara, 109) buyurmuştur. Bu sebeple Resulullah s.a.v. onları affetmek hususunda Allah 'ın kendisine vermiş olduğu emre göre hareket ediyordu. Bu tutumu, Allah onlar hakkında kendisine izin verinceye kadar böyle sürdü. Resulullah Sallallahu Aleyhi ve Sellem, Bedir gazasım yapıp da Allah o gazada kafirlerin ileri gelenlerinin ve Kureyş'in elebaşılarının öldürülenlerin öldürülmesini takdir buyurduktan sonra, Resulullah s.a.v. ve ashabı, zafer kazanmışlar olarak ve beraberlerinde kafirlerin ileri gelenlerinden, Kureyş'in elebaşılarından esirleri de ganimet almış olarak geri döndü. İbn Ebi Selul ve beraberinde bulunan putlara tapan müşrikler: Artık bu, 01gunlaşmaya doğru yönelen bir iştir. Haydi Resulullah Sallallahu Aleyhi ve Sellem'e İslam'a girmek üzere beyrat ediniz, dediler ve Müslüman oldular",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 231
			}
		}
	]
}