{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6208,
			"arabicnumber": 6208,
			"text": "Abbas İbn Abdulmuttalib'den, dedi ki: \"Ey Allah'ın Rasulü! (Amcan) Ebu Talib'e herhangi bir faydan oldu mu? Çünkü o seni koruyor ve senin için düşmanlarına öfkeleniyordu, diye sordu. Allah Rasulü: Evet, o topuklarına kadar yakın ateşten bir çukur içindedir. Ben olmasaydım ateşin en alt basamağında olacaktı, buyurdu.\" Fethu'l-Bari Açıklaması: \"Müşriğe künye verilmesi.\" Yani (Müslüman bir kimsenin müşrik bir kimseye) ilk olarak künye vermesi caiz midir? Eğer onun baştan beri bir künyesi varsa künyesi ile ona hitap etmek yahut ondan o künye ile söz etmek caiz midir? Başlıkta yer alan hadisler bu son şıkka uygundur. Hüküm itibariyle ikincisi de bunun kapsamına girer. Nevevi, el-Ezkar adlı eserinde kafire künye vermenin, ancak sözkonusu ettiği iki şarta bağlı olarak caiz olacağını tespit ettikten sonra, şunları söylemektedir: Hadiste Ebu Taliblin adı çokça geçmektedir. Asıl adı ise Abdi Menafltır. Yüce Allah da: \"Ebu Leheb'in iki eli kurusun.\"(Tebbet 1) diye buyurmaktadır. Daha sonra Nevevi ikinci hadisi ve hadiste geçen \"Ebu Hubab\" künyesini zikrettikten sonra şunları söylemektedir: Böyle bir künye, şartın bulunması halinde kullanılır. O da o kimsenin ancak künyesi ile tanınması yahut adının anılmasında bir fitne olacağından korkulması halidir. Arkasından şunları söylemektedir: Hesulullah Sallallahu Aleyhi ve Sellem Hirakl (Heraklieus)'a mektup yazarak onu adı ile anmış, ne künyesi ile sözkonusu etmiş, ne de onun lakabı olan Kayser diye anmıştır. Hem bizler onlara karşı sert olmakla emrolunmuş bulunuyoruz. Dolayısı ile sözlü olarak onlara yumuşak hitap edip künyelerini kullanmayız, onlara sevgimizi izhar etmeyiz. Ancak onun bu sözlerine zikrettiği delillerde bir hasr (sadece o çerçevede kullanılma) bulunmamaktadır. Aksine Abdullah İbn Ubey alayında ismiyle değil de künyesiyle sözkonusu edilmesi -üstelik ismiyle daha ünlüdür- fitne korkusundan dolayı değildir. Çünkü ondan bu şekilde huzurunda söz edilen zat (Said İbn Ubade), İslamla bağlılığı pek güçlü birisi olup Abdullah'ın adı ile anılması sebebiyle bir fitnenin ortaya çıkacağından korkulmuyor idi. Bu ancak kalbin -İbn Battallın kesin olarak ifade ettiği gibi- ısındırılmasına yorumlanır. İbn Battal der ki: Buradan ya Müslüman olmalarının ümit edilmesi yahut onlardan bir menfaatin sağlanması gibi, kalplerini telif etmek maksadı ile müşrikleri künyeleri ile anmanın caiz olduğu anlaşılmaktadır. Ebu Talib'in künyesiyle anılmasına gelince, kuvvetli görülen görüşe göre bu, birinci türdendir. O da Ebu Talib'in ismiyle değil de, künyesiyle ün kazanmış olmasıdır. Ebu Leheb'in künyesi ile anılmasına gelince, Nevevı Şerhinde dördüncü bir ihtimale daha işaret edilmektedir. O da onun puta tapıcılığa nispet edilmesinden uzak durulması içindir. Çünkü onun asıl adı (Uzza'nın kulu demek olan) Abdu'l-Uzza idi",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 232
			}
		}
	]
}