{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"78": "Good Manners and Form (Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6224,
			"arabicnumber": 6224,
			"text": "Ebu Hureyre r.a.'dan rivayete göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sizden biriniz aksıracak olursa elhamdulillah desin, kardeşi -yahut arkadaşı- da ona: Yerhamukellah desin. Ona yerhamukellah dediği takdirde aksıran da: Yehdikumullahu ve yuslihu balekum: (Allah size hidayet versin ve halinizi de düzeltsin), desin.\" Fethu'l-Bari Açıklaması: Aksıran kimseye elhamdulillah demesinin emredilmiş olması, bunun namaz kılan kimse için dahi meşru olduğuna delil gösterilmiştir. Daha önceden \"Aksıran kimsenin hamdetmesi\" başlığında Rifaa İbn Rafi'in hadisine işaret edilmiş idi. Ashabın cumhuru ve onlardan sonraki imamlar da bu görüşü ifade etmişlerdir. Malik, Şafil ve Ahmed de böyle demiştir. Tirmizi bazı tabiınden bunun farz namazda değil, nafile namazda meşru olduğunu söylediklerini nakletmiştir. Bununla birlikte (farz namazda) kendi kendisine elhamdulillah, der. Hocamız da Tirmizi Şerhi'nde bu sözleri ile bunu gizlice söyler, açıkça söylemez demek istemiş olabileceğini belirtmiştir. Fakat buna rağmen ona Rifaa İbn Rafi'in rivayet ettiği hadis ileri sürülerek itiraz edilir. Çünkü o, elhamdulillahı açıktan söylemiş, Nebi Sallallahu Aleyhi ve Sellem de onun bu yaptığını reddetmemişti. Evet, aksıranın Fatiha'yı okumakta olması ile başkasını okuyar olması arasında fark gözetilir. Çünkü Fatiha'nın kıraatinin kesintisiz olması gerekmektedir. Malikilerden İbnu'l-Arabi de kesin bir dille namazda iken aksıran kimsenin kendi kendisine elhamdulillah diyeceğini ifade etmiştir. Suhnun'dan ise namazı bitirinceye kadar elhamdulillah demeyeceğini söylediğini nakletmekte, ama daha sonra bunun bir aşırılık olduğunu söyleyerek ona itiraz etmektedir. \"Kardeşi yahut onun arkadaşı da ona yerhamukellah desin.\" Burada kardeşlikten kasıt, İslam kardeşliğidir. Buhari e!-Edebu'l-Müfred'de sahih bir sened ile Ebu Cemra'dan şunu rivayet etmektedir: \"Ben İbn Abbas') aksırıp da ona yerhamukellah denildiği takdirde: Afanallahu ve iyyakum mine'n-nari yerhamukumullah: Allah bizi de, sizi de ateşten kurtarıp afiyet versin, Allah size de rahmet ihsan etsin, derken işitmişimdir.\" Muvatta'da Rafi'den, onun İbn Ömer'den rivayetine göre \"İbn Ömer aksırır da ona yerhamukellah denilirse, o da: yerhamunallahu ve iyyakum ve yağfirullahu lena ve lekum: Allah bize de size de rahmet ihsan etsin, Allah bize de size de mağfiret buyursun, derdi.\" \"Ona: Yerhamukellah diyecek olursa, aksıran: Yehdikumullahu ve yuslihu balekum: Allah size hidayet versin ve halinizi de düzeltsin, desin.\" Bu ifadenin gereği, ancak kendisine yerhamukellah diyen kimse için böyle demenin meşru olmasıdır. Bu da açıktır. Bu lafız da aksırıp elhamdulillah diyen kimsenin vereceği cevaptır. Bu, hakkında görüş ayrılığı bulunan bir husustur. İbn Battal dedi ki: Cumhurun görüşü bu doğrultudadır ama KD.fe bilginlerinin görüşüne göre yağfirullahu lena ve lekum: Allah bize ve size mağfiret buyursun, der. Bunu Taberi, İbn Mesud'dan, İbn Ömer'den ve başkalarından diye rivayet etmiştir. İbn Battal dedi ki: Malik ve Şafii' de bu iki lafızdan istediğini seçebileceği görüşündedirler. İbn Ebi Cemra dedi ki: Hadiste yüce Allah'ın aksırana nimetinin pek büyük olduğuna bir delil vardır. Bu da aksırmaya bağlı olarak sözkonusu olan hayırlardan anlaşılır. Yine bu hadiste Allah'ın kulu üzerindeki pek büyük lütfuna da işaret vardır. O, aksırma nimetiyle kuluna gelecek zararı gidermiştir. Arkasından dolayısıyla kendisine sevap verilen hamd etmek de ona meşru kılınmış, ayrıca hayır ile dua ettikten sonra yine hayır ile dua meşru kılınmıştır. Şanı yüce Allah'ın, kısacık bir zamanda ardı arkasına bu nimetleri teşri buyurmuş olması, onun bir lütfu ve ihsanıdır. Bu da kalbi ve basireti olan bir kimsenin imanını artıran bir husustur. Öyle ki, bundan dolayı pek çok gün ibadet ile elde edemeyeceği şeyleri elde edebilir. Bu vesile ile hatırına getirmediği Allah'ın kendisine ihsan etmiş olduğu Allah sevgisi nimeti de bunun kapsamındadır. Aynı şekilde kendisi vasıtası ile bu hayrı bilip öğrendiğimiz ve değeri ölçülüp biçilemeyecek kadar büyük sünnetinin getirdiği ilim de bunun içerisindedir. Bu kabilden, bir zerrenin artışında bile bunun dışında pek çok amelden daha bir üstünlük sözkonusu olur. Allah'a pek çok hamd olsun",
			"grades": [],
			"reference": {
				"book": 78,
				"hadith": 248
			}
		}
	]
}