{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6242,
			"arabicnumber": 6242,
			"text": "Enes İbn Malik'ten rivayet e göre; \"Bir adam Nebi Sallallahu Aleyhi ve Sellem'in hücrelerinden birisinin içine bakmıştı. Nebi Sallallahu Aleyhi ve Sellem elinde uzunca bir ok demiri -yahut ok demirleriyle- ona doğru kalktı. Hala adamı dürtmek için ona gizlice sokulmasını görüyor gibiyim.\" Bu Hadis 6889 ve 6900 numara ile de geçiyor. Fethu'l-Bari Açıklaması: \"İzin istemek, görmeye karşı tedbir olsun diyedir.\" Yani bunun için meşru kılınmıştır. Çünkü izin isteyen kişi izin almaksızın içeri girecek olursa, yanına girdiği kimsenin görmesinden hoşlanmayacağı bazı şeyleri görecektir. Buhari'nin el-Edebu'l-Müfred'de, Ebu Davud'un ve hasen olduğunu belirterek Tirmizi'nin rivayet etmiş olduğu Sevban yoluyla gelen merfu hadiste bu husus açıkça ifade edilmiş bulunmaktadır: \"Müslüman bir kimsenin izin almadıkça bir evin içine bakması helal değildir. Eğer böyle bir işi yaparsa içeri girmiş demektir.\" Yani içeri giren kimse hükmünde olur. Yine Buhari Ömer radıyaııa.hu anh'ın: \"Kim kendisine izin verilmeden önce bir evin iç tarafında bulunanları görerek gözüyle onlara dolu dolu bakarsa fasıklık etmiş olur.\" Ebu Davud kavi bir sened ile İbn Abbas'tan şu hadisi rivayet etmektedir: \"İnsanların evlerinin (kapıları) üzerinde perdeleri yoktu. Bu sebeple Allah onlara izin istemelerini emir buyurdu. Daha sonra yüce Allah hayırlar getirip sevk etti. Bundan dolayı artık kimsenin bu emir ile amel ettiğini görmüyorum.\" İbn Abdilberr dedi ki: Zannederim onlar kapıyı çalmakla yetindiler. Yine Ebu Davud, Abdullah İbn Busr yoluyla şu hadisi rivayet etmektedir: \"Rasulullah s.a.v. bir ailenin kapısına gidecek olursa yüzünü kapıya doğru çevirmez, ama ya sağ ya da sol tarafında dururdu. Çünkü evlerin, kapıları üzerinde perdeleri yoktu.\" Enes'in rivayet ettiği hadiste \"uzunca ok demiri yahut ok demirleri\" ifadesi, okun demir ucu enli olmayıp, uzun olduğu takdirde kullanılan tabirdir. \"Gizlice\" yani adam fark etmeksizin onu dürtmek istemesini ... demektir. Bundan dolayı gözü yahut başka organı isabet alıp yaralanan kimsenin hükmü, Diyetler bölümünde gelecektir. Bu durum, kasten bakan kimse hakkında özeldir, ama kastetmeksizin bu şekilde içeriyi gören bir kimse için herhangi bir vebal yoktur. Müslim'in Sahih'indeki rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem'e ansızın görmenin hükmü soruldu da o: Gözünü başka tarafa çevir, buyurdu.\" Ali radıyall\"hu anh'a hitaben de: \"Bir defa baktıktan sonra arkasından bir daha bakma. Çünkü birincisi senin lehinedir ama ikincisinde hakkın yoktur, buyurdu.\" Bu hadis, kişinin kendi evine girmek için izin istemeye gerek olmadığına delil gösterilmiştir. Çünkü izin istemenin meşru kılınmasınasebep olan illet bulunmamaktadır. Evet, eğer bununla birlikte izin istemeye ihtiyaç duyuracak yeni bir durumun ortaya çıkmış olma ihtimali varsa, izin istemesi meşru olur. Buradan da mahremler dahil olmak üzere herkesin yanına girmek için izin istemenin meşru olduğu hükmü anlaşılır. Böylelikle mahrem olan bir kadın, avreti açık halde görülmemiş olur. Buhari el-Edebu'l-Müfred'de, NMi'den: \"İbn Ömer, çocuklarından birisi ergenlik yaşına geldi mi izin almadan çocuğunun yanına girmezdi\" rivayetini nakletmiş bulunmaktadır. Alkame yoluyla da şu rivayeti nakletmiştir: \"Bir adam İbn Mesud'a gelerek: Annemin yanına girmek için izin isteyeyim mi, diye sordu. Ona: \"O her zaman bulunduğu her halinde senin kendisini görmeni istemez, diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 16
			}
		}
	]
}