{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6246,
			"arabicnumber": 6246,
			"text": "Ebu Hureyre r.a.'dan dedi ki: \"Rasuluilah Sallallahu Aleyhi ve Sellem ile birlikte içeri girdim. Bir kap içinde bir miktar süt bulunca: Ey Eba Hirr, Suffa ahalisinin yanına var ve onları yanıma davet et, buyurdu. Ebu Hureyre dedi ki: Ben de yanlarına varıp onları davet ettim. Onlar da gelip izin istediler. Allah Rasulü onlara izin verince, onlar da içeri girdiler.\" Fethu'l-Bari Açıklaması: \"Kişi davet edilip de gelirse, izin ister mi?\" Yoksa gelmesi istendiği karinesi ile (onu izin sayarak) yetinir mi? Daha sonra musannıf Mücahid'in, Ebu Hureyre'den diye rivayet ettiği hadisin bir kısmınızikretmektedir. Ebu Hureyre dedi ki: \"Rasuluilah Sallallahu Aleyhi ve Sellem ile birlikte içeri girdim. Bir kapta bir miktar süt buldu. Ey Eba Hirr, Suffa ehlinin yanına var, onları yanıma çağır, buyurdu. Ebu Hureyre dedi ki: Ben de onların yanlarına varıp, onları davet ettim, onlar da geldiler. İçeri girmek için izin istediler, onlara izin verince onlar da içeri girdiler. i, Buhari burada hadisin bu kadarını zikretmiş bulunmaktadır. Çünkü burada bu kadarına ihtiyaç duymuştur. İleride geleceği üzere Rikaak bölümünde hadisi tamamıyla kaydetmiş bulunmaktadır. Hadisin zahiri (başlıktan sonra işaret ettiği) ilk hadis ile tearuz halinde olduğundan dolayı kesin olarak hükmü ifade etmemiştir. el-Mühelleb ve başkaları ise, bunu her iki durumun farklılığını esas alarak yorumlamışlardır: Eğer yapılan davet ile geliş arasında zaman uzamışsa yeniden izin istemeye ihtiyaç vardır. Aynı şekilde arada uzun süre olmamakla birlikte davet yapılmasını isteyen kişi şayet adeten içeri girilmesi için izin istemeyi gerektirecek bir halde ise yine izin istenir. Aksi takdirde yeniden izin istemeye ihtiyaç yoktur. İbnu't-Tın de şöyle demiştir: Birincisi, yanında kendisi dolayısıyla izin istemesini gerektirecek kimsenin bulunmadığını bilmesi hali hakkındadır. İkincisi ise böyle olmayan durum ile ilgilidir. İbnu't-Tın der ki: Bununla birlikte her durumda izin istemek, ihtiyata daha uygundur. Başkası ise şöyle demektedir: Eğer davette bulunan elçi ile birlikte gelmiş ise elçinin izin istemesi, ayrıca onun izin istemesine ihtiyaç bırakmaz ve onun için karşılaşıldığı vakit selam vermesi yeterlidir. Şayet daveti yapan elçiden sonraya kalırsa izin istemesi gerekir. Tahavı de rivayetleri böylece telif etmiş bulunmaktadır. İkinci hadiste yer alan: \"Onlar da gelip izin istediler\" ibaresini de delil göstermiştir. İşte bu, Ebu Hureyre'nin onlarla beraber olmadığına delildir. Çünkü onlarla birlikte olsaydı: Hep birlikte geldik, demesi gerekirdi. Evet, o {Tahavı} böyle demiştir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 20
			}
		}
	]
}