{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6253,
			"arabicnumber": 6253,
			"text": "Aişe r.anha'dan rivayete göre \"Nebi Sallallahu Aleyhi ve Sellem kendisine: Şüphesiz Cibril sana selam söylüyor, dedi. Aişe de: Ve aleyhimusselamu ve rahmetullah diye cevap verdi.\" Fethu'l-Bari Açıklaması: \"Filan kişinin sana selamı var derse\" el-Küşmiheni'nin rivayetinde: \"Yakrau aleykisselam: Sana selam söylüyor\" şeklindedir. Başlıktaki hadisin lafzında da böyledir. Buna dair açıklamalar daha önce Aişe radıyallahu anha'ın Menkıbeleri başlığında (3768 nolu hadiste) geçmiş bulunmaktadır. Nevevi dedi ki: Bu hadisten bir aracı ile selam göndermenin meşru olduğu anlaşılmaktadır. Kendisi ile selam gönderilen elçinin de onu bildirmesi gerekir. Çünkü bu bir emanettir. Ancak bunun vediaya daha çok benzediği söylenerek itiraz edilmiştir. Meselenin tahkiki şudur: Eğer elçi selamı götürmeyi kabul edip üstlenirse emanete daha çok benzer. Aksi takdirde bu bir vedia olur. Bir kimse bir vediayı kabul ettiğini belirtmezse herhangi bir yükümlülüğü olmaz. (Nevevi devamla) dedi ki: Birisine bir kişi bir başkasından selam getirse ya da bir kağıtta yazılı olsa derhal o selamın alınması vaciptir. Selamı ulaştırana da karşılık vermesi müstehaptır. Nitekim Nesai'nin Temim oğullarından bir adamdan rivayet ettiğine göre bu şahıs, Nebi Sallallahu Aleyhi ve Sellem'e babasının selamını bildirmiş, Allah Resuıü de ona: \"Ve aleyke ve ala ebikesselam: Sana da, babana da selam olsun, demiştir.\" Daha önce Menakıb (menkıbeler) bölümünde geçtiği üzere Nebi Sallallahu Aleyhi ve Sellem Hatice radıyalliihu anhii'ya Cibril'den Allah'ın kendisine selamını bildirince şöyle cevap vermişti: \"Şüphesiz Allah es-selamdır. es-Selam da ondandır. Sana da Cibril'e de selam olsun.\" Bununla birlikte Aişe ile ilgili hadisin rivayet yollarını hiç birisinde onun, selamı alırken Nebi Sallallahu Aleyhi ve Sellem'i da söz konusu ettiğini görmedim. İşte bu da getirene de selam vermenin vacip olmadığının deliIidir. Başlıktaki lafız ile, Nebi Sallallahu Aleyhi ve Sellem'in sözü olarak hadis de varid olmuş bulunmaktadır. Bunu Müslim, Enes'den diye rivayet etmiştir. Buna göre \"EslemIilerden bir genç: Ey Allah'ın Rasulü! Ben cihad etmek istiyorum, deyince, Allah Rasulü: Filanın yanına git ve: Şüphesiz Rasulullah Sallallahu Aleyhi ve Sellem'in sana selamı var ve: Cihada gitmek için hazırladığın malzemeyi bana ver diyor, de",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 27
			}
		}
	]
}