{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6254,
			"arabicnumber": 6254,
			"text": "{Usame İbn Zeyd'den rivayete göre; \"Nebi Sallallahu Aleyhi ve Sellem, altında Fedek dokuması bir kadife bulunan palan vurulmuş bir eşeğe bindi. Arkasına da Usame İbn Zeyd'i hindirmişti. el-Haris İbn Hazrec oğulları yurdunda bulunan Said İbn Ubade'ye hasta ziyaretinde bulunmaya gidiyordu. -Bu olay, Bedir vakasından önce idi.- Nihayet aralarında Müslümanlardan, müşriklerden, puta tapıcılardan ve Yahudilerden karışık kimselerin oturduğu bir meclisin yanından geçti. Bunlar arasında Abdullah İbn Ubeyy İbn SeluI de vardı. Yine aynı mecliste Abdullah İbn Revaha da bulunuyordu. Bineğin çıkardığı tozlar, meclisin üzerine gelince, Abdullah İbn Ubeyy ridasıyla burnunu örttü, sonra da: Üzerimize toz çıkarmayınız, dedi. Nebi Sallallahu Aleyhi ve Sellem onlara selam verdikten sonra durdu. Bineğinden indi, onları Allah'a davet etti, onlara Kur'an okudu. Buna karşılık Abdullah İbn Ubeyy İbn Selul: Ey kişil Eğer bu söylediklerin bir hak ise bundan daha güzeli yoktur. Bu sebeple sen bizim meclisimizde bizi rahatsız etme. Kendi kaldığın yere geri dön. Bizden sana gelen olursa sen de ona anlatacaklarını anlat, dedi. İbn Revaha: Meclislerimizde yanımıza gel. Biz bunu seviyor, arzu ediyoruz, dedi. Bunun sonucunda Müslümanlar, müşrikler, Yahudiler birbirlerine ağır sözler söylediler. Hatta sonunda birbirleri üzerine yürüyüp kavgaya tutuşacak hale kadar geldiler. Nebi Sallallahu Aleyhi ve Sellem ise durmadan onları teskin etti. Daha sonra bineğine bindi, nihayet Sa'd İbn Ubade'nin bulunduğu yere girerek: Ey Sad' -Abdullah İbn Ubeyy'i kastederek- Ebu Hubab'ın ne söylediğini duymadın mı: O şöyle şöyle dedi, buyurdu. Sa'd: Ey Allah'ın HasCılü, onu affet ve bağışla! Allah'a yemin ederim ki Allah sana bu verdiği bağışı ihsan etmiş bulunuyor. O sırada bu şehir halkı da ona taç giydirmeyi ve ona hükümdarlığı sarığı sarmayı kararlaştırmış ve bunun üzerine anlaşmışlardı. Ama Allah bunu sana vermiş olduğu o hak ile geri çevirince İbn Ubeyy'in de hevesi kursağında kaldı. İşte senin o gördüklerini yapmaya iten odur, dedi. Nebi Sallallahu Aleyhi ve Sellem de onu affetti.\" Fethu'l-Bari Açıklaması: \"Müslüman ve müşriklerin karışık bulunduğu bir mecliste. oturanlara selam vermek.\" Nevevı dedi ki: Sünnet olan, aralarında Müslüman ve kMirin karışık olarak bulunduğu bir meclisin yanından geçen bir kimsenin genelleştirici bir ifade ile selam verip bununla Müslüman olanları kastetmesidir. İbnu'l-Arabi dedi ki: Aynı şekilde ehl-i sünnet ve bid'atçilerin toplu olarak bulunduğu bir meclisin, adaletli ve zalim kimselerin bulunduğu bir meclisin, sevenin ve nefret edenin bulunduğu bir meclisin yanından geçerse yine böyle yapar. Nevevi buna başlıktaki hadisi delil göstermiştir. Bu da kMire öncelikle selam vermenin yasaklanışı ile ilgili fer'i bir meseledir. Çünkü Müslim ve Buhari'nin el-Edebu'I-Müfred'de Ebu Hureyre'den merfu olarak rivayet ettikleri hadiste bu husustaki yasak açık bir şekilde varid olmuştur: \"Yahudilere ve Hıristiyanıara önce siz selam vermeyiniz ve onları yolun en dar kısmında yürümek zorunda bırakınız.\" Taberi de•şöyle demektedir: Usame'nin Nebi Sallallahu Aleyhi ve Sellem'in Müslümanlarla birlikte bulunan kafirlere selam vermesi ile ilgili rivayet ettiği hadis ile Ebu Hureyre'nin kafirlere öncelikle selam vermeyi yasaklayan hadis arasında herhangi bir aykırılık yoktur. Çünkü Ebu Hureyre'nin hadisi geneldir, Usame'nin hadisi ise özeldir. Kurtubi, hadiste geçen: \"Bir yolda onlarla karşılaştığınızda onları yolu en dar ' kısmından yürümeye mecbur ediniz\" buyruğunun anlamı hakkli}cia şunları söylemketir: Yani onlara ikramda bulunmak ve saygı göstermek ln dar olan yolda bir kenara çekilerek onlara yol açmayınız. Buna göre böyle bir cümle, anlam itibariyle birinci cümleye münasip düşmektedir. Yoksa bunun anlamı: Geniş bir yolda onlarla karşılaşacak olursanız, yalanlara dar ;delecek şekilde kenarından yürümeye onları mecbur ediniz demek değildir. ÇÜnkü böyle bir tutum onlara bir eziyettir, bize de sebepsiz yere onlara eziyey(memiz yasaklanmıştır)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 28
			}
		}
	]
}