{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6255,
			"arabicnumber": 6255,
			"text": "Abdullah İbn Ka'b'dan dedi ki: \"Ben Ka'b İbn Malik'i, Tebuk'ten geri kalışını anlatmasını ve Hasulullah Sallallahu Aleyhi ve Sellem'in bizimle konuşmayı nehyetti, dediğini işittim. Ben Hasulullah Sallallahu Aleyhi ve Sellem'in yanına gidiyor, ona selam veriyordum. Kendi kendime de: Acaba selamımı almak için dudaklarını hareket ettirdi mi ettirmedi mi diyordum. Nihayet elli gün tamamlandı, Nebi Sallallahu Aleyhi ve Sellem da sabah namazını kıldıktan sonra Allah 'ın tevbemizi Kabul ettiğini ilan etti.\" Fethu'l-Bari Açıklaması: \"Bir günah işleyene tevbe ettiği açıkça ortaya çıkana kadar selam vermeyen ve onun selamını almayan kimse ile günahkarın tevbesi ne kadar bir sürE sonra açıkça anlaşılır.\" Birincisi ile ilgili hüküm hakkında görüş ayrılığı bulundu ğuna işaret etmiş bulunmaktadır. Cumhurun görüşüne göre fasık kimseye de, bid'atçiye de selam verilmez. Nevevi der ki: Eğer böylesine selam vermediği takdirde din ya da dünya ile ilgili bir kötülüğün meydana geleceğinden korkarsa selam verir. İbnu'l-Arabi de böyle demiş ve: es-Selam 'ın yüce Allah'ın isimlerinden bir isim olduğuna niyet eder. O, böylelikle Allah sizin üzerinize rakibdir. Sizi görüp gözetendir demiş gibidir, diye eklemiştir. El-Mühelleb de: Masiyet ehli olanlara selam vermeyi terk etmek eskiden beri uyulagelen bir sünnettir, demiştir. İlim ehlinin birçoğu da bid'at ehli hakkında böyle demişlerdir. Bazı Hanefiler çokça mizah yapmak, boş işlerle uğraşmak, çirkin sözlerle konuşmak, gidip gelen kadınları görmek için çarşı-pazarlarda oturmak ve buna benzer insanın mertlik ve insaniyet sıfatları ile bağdaşmayan işleri yapan kimseleri de masiyet işleyenler gibi değerlendirmişlerdir. İbn Rüşd de Malik'in şöyle dediğini nakletmektedir: Heva ehli olan kimselere selam verilmez. İbn Dakiki'l-'Id der ki: Bu onları edeplendirmek ve onlardan uzak oluşunu bildirmek için yapılır. İkinci durumun hükmüne gelince, bunda da görüş ayrılığı vardır. Bir görüşe göre bir sene süreyle onun halini inceler. Bir görüşe göre altı ay, bir görüşe göre de Ka'b İbn Malik kıssasında olduğu gibi elli gün süre ile gözetilir, demiştir. Bunun belli bir süresinin olmadığı, aksine tevbe iddiasında doğruluğuna delil teşkil edecek karinelerin varlığının göz önünde bulundurulacağı da söylenmiştir, ama bu iş için bir saat de, bir gün de yeterli değildir. Bu, işlenen suça ve suçu işleyenin farklılığına göre değişir. Nevevi de şöyle demiştir: Bid'atçi kimseye ve pek büyük bir günah işlemekle birlikte o günahından tevbe etmeyene selam da verilmez, selamları da alınmaz. Nitekim ilim ehlinden bir topluluk böyle demiştir. Buhari buna delil olarak Ka'b İbn Malik'in kıssasını göstermiştir. Burada \"tevbe etmeyen\" kaydı da güzeldir; ama bunun için Ka'b İbn Malik kıssasının delil gösterilmesi tartışılır. Çünkü o yaptığından pişman olup tevbe etmişti, ama Allah onun tevbesini kabul edinceye kadar onunla konuşmak ertelenmişti. Onun ile ilgili hüküm de tevbesi kabul edilinceye kadar onunla konuşulmaması şeklinde idi. Cevap şöyle verilebilir: Ka'b İbn Malik'in başından geçen olayda tevbenin kabul edilip edilmediğini bilmek mümkün idi. Ondan sonraki zamanlarda ise pişmanlığın alametinin ortaya çıkması, o günahtan nihai olarak vazgeçmesi ve bu husustaki sadakat emarelerinin görülmesi yeterlidir. \"İkterafe: İşledi\" kazandı, demektir. Çoğunluğun yorumu da böyledir. Ebu Ubeyde ise: İktiraf, töhmet demektir, demiştir. \"Abdullah İbn Amr içki içenlere selam vermeyiniz, demiştir.\" Abdullah İbn Amr'dan gelen bu eseri (rivayetil Buhari, el-Edebu'l-Müfred adlı eserinde Abdullah ibn Amr el-As'dan şu lafız ile, mevsul bir senedie rivayet etmiştir: \"içki içenlere selam vermeyiniz.\" Sonunda: \"içki içenleri hastalandıkları takdirde ziyaret etmeyiniz\" demiştir)",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 29
			}
		}
	]
}