{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6261,
			"arabicnumber": 6261,
			"text": "Ebu Hureyre r.a.'dan rivayete göre; \"Rasulullah Sallallahu Aleyhi ve Sellem, İsrailoğullarından bir adam'ı sözkonusu etti. Bu adam bir kereste parçası alıp içini oymuş, içine bin dinar ile kendisinden arkadaşına hitaben bir mektup sahifesi koymuştu. Ömer İbn Ebi Seleme'nin babasından, onun da Ebu Hureyre'den rivayetine göre, Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Bir adam bir ağaç parçasını yonttu ve malı onun içine yerleştirdi, o kişiye de: Filan kimseden filan kimseye, diye bir sahife (mektup) yazıp koydu.\" Fethu'l-Bari Açıklaması: \"Mektuba kimin adı yazılarak başlanır.\" Yani kendi adını mı yoksa mektup yazdığı kimsenin adını mı yazarak başlar? Buhari bu başlık altında İsrailoğullarından bin dinar borç almış bir adam ile ilgili hadisin bir bölümünü zikretmiştir. Sanki bu hususta kendi şartına göre merfu bir hadis bulmadığından bununla yetinmiş gibidir. Bu hadis, Buhari'nin bizden öncekilerin şeriatını bizim şeriatimızda nakledilip reddolunmamışsa delil olarak kullanılabileceği şeklinde kabul ettiği kaidesine de uygundur. Özellikle de bizden öncekilerin şeriatindeki bu olay, yapanın övüldüğü bir surette nakledilmesi halinde böyledir. Bu hadiste delilolacak taraf, borçlu olan kimsenin mektubuna \"filan kimseden filan kimseye\" diye yazmış olmasıdır. Buhari'nin Nebi Sallallahu Aleyhi ve Sellem'in az önce işaret olunan Heraklius'a gönderdiği mektubu delil göstermesi mümkün olmakla birlikte, bunu büyük olan zatın küçüğe, azametli olan birisinin ise öyle olmayana mektup yazarken kendi adını yazması esası dolayısıyla delil göstermemiş olabilir. Ama durumun aksi ya da eşit olması halinde tereddüt söz konusu olur. Buhari, el-Edebu'l-Müfred adlı eserinde Harice İbn Zeyd İbn Sabit yoluyla Zeyd İbn Sabit hanedanının büyüklerinden: \"Bu mektup Allah'ın kulu, mü minlerin emiri Muaviye'nin Zeyd İbn Sabit'e mektubudur. Selam olsun sanal diye bir rivayet kaydetmiş bulunmaktadır. İbn Ömer'den de buna yakın bir rivayet nakletmiştir. Ebu Davud da İbn Sirin yoluyla Ebu'l-Ala İbn Hadrami'den, onun el-Ala'dan rivayet ettiğine göre o, Muhammed Rasulullah'a diye mektup yazmıştır. Naf!'den rivayete göre de İbn Ömer, kölelerine kendisine mektup yazdıkları takdirde kendi isimlerini zikretmekle başlamalarını emrederdi. Naf!'den yine rivayete göre Ömer'in gönderdiği görevliler ona mektup yazdıkları takdirde önce kendi adlarını yazarlardı. el-Mühelleb dedi ki: Sünnet olan, yazanın önce kendi adını yazarak başlamasıdır. Mamer'den, onun Eyyub'dan rivayetine göre bazen mektup yazdığı adamın adını kendi adından önce yazardı. Bu hususta Malik'e sorulan soru üzerine o: Bunda bir sakınca yoktur demiş ve şunları eklemiştir: Bu dışarıdan gelen bir kimseye mecliste yer açmaya benzer. Ona: Irak ehli senden önce kimsenin adını yazarak başlamaz, isterse bu kişi baban annen yahut senden daha büyük olsun diyorlar denilince, bunların böyle yapmalarını ayıpladı. Derim ki: İbn Ömer'den nakledilen onun çoğu hallerinde görülen durumdur. Yoksa Buhari el-Edebu'l-Müfred adlı eserinde sahih bir senedie Naf!'den şunu rivayet etmiştir: İbn Ömer'in, Muaviye'nin yanında görülecek bir ihtiyacı vardı. Önce kendi adını yazmak istedi. Etrafındakiler ona ısrar edip durdular, sonunda: Bismillahirahmanirrahim Muaviye'ye diye mektup yazdı. Yine el-Edebu'l-Müfred'de Abdullah İbn Dinar'ın bir rivayeti olarak Abdullah İbn Ömer'in, Abdulmelik'e bey'at etmek üzere şu şekilde mektup yazdığı nı rivayet etmektedir: \"Bismillahirrahmanirrahim. mu'minlerin emiri Abdulmelik'e, Abdullah İbn Ömer'den selam olsun sana",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 35
			}
		}
	]
}