{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6262,
			"arabicnumber": 6262,
			"text": "Ebu Said'den rivayete göre; \"Kureyzalılar Sa'd'in hükmünü kabul ederek kalelerinden indiler. Nebi Sallallahu Aleyhi ve Sellem bu sebeple ona haber gönderdi, o da geldi. Gelince Allah Rasulü: Seyyidiniz için -yahut: en hayırlınız için, dedi- ayağa kalkınız, buyurdu. Nebi Sallallahu Aleyhi ve Sellem'in yanına oturdu. Allah Rasulü ona: Bunlar (Kureyzalılar) senin hükmünü kabul ederek kalelerinden indiler buyurdu. Sa'd İbn Muaz: Ben onların savaşçılarının öldürülmesine, kadın ve çocuklarının esir edilmesine hüküm veriyorum, dedi. Bunun üzerine Allah Rasulü: Andolsun sen me lik olan (Allah)ın vermiş olduğu hüküm ile hükmettin, buyurdu.\" Fethu'l-Bari Açıklaması: İbn Battal dedi ki: Bu hadiste İmam-ı A'zam'ın (en büyük imamın yani İslam devlet başkanının) Müslümanlar arasında büyük şahsiyete, ikrama dair emir verebileceği ve en büyük imamın meclisinde fazilet ehli kimselere ikramda bulunmanın, Nebi efendimizin dışında ashabından bazı kimseler için de ayağa kalkmanın, bütün insanları da aralarındaki büyük bir şahsiyet için ayağa kalkmaya zorlamanın meşru bir iş olduğu anlaşılmaktadır. Bununla birlikte bazı kimseler bunu yasak kabul etmişlerdir. Ayrıca bu kanaatte olanlar Abdullah İbn Bureyde'nin rivayet ettiği şu hadisi de delil gösterirler: Buna göre onun babası (Bureyde) Muaviye'nin huzuruna girerek ona Nebi Sallallahu Aleyhi ve Sellem'in: \"Her kim, adamların önünde ayağa kalkmalarını severse cehennem ateşi ona vacip olur\" buyurduğunu haber vermiştir. Taberi buna şöylece cevap vermiştir: Bu haberde kendisine ayağa kalkılmasından dolayı sevinmek yasaklanmaktadır. Yoksa kendisine ikram olsun diye kalkanların bu kalkışı yasaklanmamıştır. İbn Kuteybe de buna şöyle cevap vermiştir: Bu, Acem krallarının önünde ayakta durulduğu gibi, başı ucunda adamların durmasını isteyen kimseler içindir. Yoksa maksat kişinin, kendisine selam veren kardeşi için ayağa kalkmasının nehyedilmesi değildir. İbn Battal bunun caiz oluşuna Nesai'nin Talha kızı Aişe yoluyla Aişe r.anha'dan rivayet ettiği şu hadisi delil göstermiştir: \"Rasulullah Sallallahu Aleyhi ve Sellem kızı Fatıma'nın geldiğini görünce, ona sevinçle: Hoş geldin der, sonra kalkıp onu öper, daha sonra kendi yerinde onu oturtuncaya kadar elinden tutard!.\" Derim ki: Aişe r.anha'nın rivayet ettiği bu hadisi Ebu Davud, hasen olduğunu belirterek Tirmizi, sahih olduğunu belirterek İbn Hibban ve Hakim rivayet etmişlerdir. Bunun aslı da daha önce Menakıb bölümünde ve Nebi Sallallahu Aleyhi ve Sellem'in vefatı bahsinde geçtiği üzere, Sahih-i Buhari'de yer almaktadır. Ama Buhari'deki rivayette ayağa kalkış, söz konusu edilmemiştir. İmam Malik'ten yapılan bu nakillerden anlaşıldığına göre; kendisi için kalkılan kişi, -kendi özel işiyle uğraşıyor olsa dahi- oturmadığı sürece kalkanın oturmamaya devam etmesi uygun görülmemiştir. Çünkü ona kocasına ikramda ileriye giderek kocasını karşılayıp elbiselerini çıkartarak oturuncaya kadar ayakta bekleyen kadının durumu hakkında soru sorulunca şu cevabı vermiştir: Onu karşılamakta bir sakınca yoktur; ama o oturuncaya kadar ayakta beklemesi uygun değildir. Çünkü bu zorbaların uygulamalarındandır. Ömer İbn Abdulaziz de böyle bir şeyi kabul etmemiştir. el-Hattabi de başlıktaki hadis ile ilgili olarak şunları söylemektedir: Hadisten anlaşıldığına göre hayırlı ve faziletli kimseye \"seyyid\" demek caizdir. Yine bu hadisten yönetilenkimsenin fazilet sahibi yönetici başkanı için, adaletli imam için ve öğrencinin alim için ayağa kalkmasının müstehab olduğu anlaşılmaktadır. Bu niteliklere sahip olmayan kimseler için ayağa kalkmak mekruhtur. \"Kendisi için ayağa kalkılmasını seven kimse\" hadisinin anlamına gelince: Büyüklenmek ve gurur yapmak suretiyle saflar halinde başkalarını ayakta durmaya zorlamaktır. el-Münziri az önce kaydedilen İbn Kuteybe ve Buhari'den nakledilen hadislerin bir arada telif edilmesi ile ilgili açıklamalarını ve yasaklanan ayakta durmanın, kendisi oturduğu halde huzurunda ayakta durulmasını istemek olduğunu tercih etmiştir. İbnu'l-Kayyim ise \"Sünen Haşiyesi\"nde bu görüşü, Muaviye ile ilgili hadisin akışının bunun abine delil teşkil ettiğini belirterek reddetmekte ve Bureydelnin, Muaviye dışarı çıkınca ona tazim olsun diye ayağa kalkılmasını hoş karşılamadığını söylemektedir. Çünkü böyle bir ayağa kalkış için (Arapçada) adam için ayağa kalkmak denilmez. Buna kişinin başı ucunda yada yanında ayakta durmak (beklemek) denir. (Devamla) der ki: Ayakta duruşun üç mertebesi vardır: Kişinin başı ucunda ayakta beklemek -ki bu zorbaların işidir-, kişi gelirken ayağa kalkmak -bunda da bir sakınca yoktur-, kişiyi görünce onun için ayağa kalkmak. İşte hakkında görüş ayrılığı bulunan kalkma da budur. Derim ki: Oturan büyük bir zatın baş ucunda ayakta durmak hususuna dair Taberanilnin el-Evsat'ta zikrettiği şu rivayet varid olmuştur: Eneslden dedi ki: \"Şüphesiz sizden öncekilerin helak oluş sebebi, hükümdarları otururken kendileri ayakta durarak hükümdarlarını tazim edişleridir.\" Daha sonra el-Münziri bunu mutlak olarak kabul etmeyen bazı kimselerin bu husustaki delili şunu gerekçe göstererek reddettiğini nakletmektedir: Said'in olayında Nebi Sallallahu Aleyhi ve Sellemlin onlara Said için ayağa kalkmalarını emrediş sebebi, hasta olduğundan ötürü onu eşeğin üzerinden indirmeleri için idi. Nevevı de kıyam (ayağa kalkmak) bölümünde bunu delil göstermiş, Buhari, Müslim ve Ebu Davud'un da bunu delil gösterdiklerini söylemiştir. Müslimlin lafzı da: Bir kimsenin bir diğeri için ayağa kalkması hususunda bundan daha sahih bir hadis bilmiyorum, şeklindedir. Ancak Şeyh Ebu Abdullah İbn el-Hac ona itiraz ederek özetle şöyle demiştir: Eğer Said için emrolunan ayağa kalkmak, anlaşmazlık konusunu teşkil eden husus olsaydı, bu emri özelolarak ensara vermezdi. Çünkü Allah'a yakınlaştırıcı fiillerde aslolan geneloluştur. Şayet Said için ayağa kalkmak iyilik ve ikram yoluyla olsaydı, hiç şüphesiz bunu ilk yapan kişi Nebi Sallallahu Aleyhi ve Sellem'in kendisi olur ve hazır bulunan ashabın büyüklerine de bunu yapmalarını emrederdi. Allah Rasulü s.a.v. bunu emretmediğine, bizzat kendisi de yapmadığına, onlar da bu işi yapmadıklarına göre; bu, ayağa kalkma emrinin, hakkında anlaşmazlığa düşülen husustan farklı olduğunun delilidir. Bu emir ancak onu bineğinden indirmeleri için verilmiştir. Çünkü bazı rivayetlerde belirtildiği üzere hastalığı sebebiyle bu emri vermiştir. Daha sonra Ebu'l-Velid İbn Rüşd'den şu bilgileri nakletmektedir: Ayağa kalkmanın dört çeşidi vardır: 1- Yasak olan kalkış. Bu da huzurunda ayakta duranlara karşı tekebbür ve azametli görünüş için kendisi için ayağa kalkılmasını isteyen kimseler için ayakta duruş hakkındadır. 2- Mekruh olan ayakta durmak: Bu da ayakta duranlara karşı büyüklenmeyen ve kendisini azametli göstermeyen, bununla birlikte bundan dolayı sakınılması gereken duyguların nefsini etkileyeceğinden korkulan kimse için ve zorbalara benzeyiş ihtiva ettiği için söz konusudur. 3- Caiz olan ayakta duruş: Bu da böyle bir şeyi istemeyen, bununla birlikte zorbalara benzemek istemediğinden emin olunan kimseler için iyilik ve ikramda bulunmak üzere sözkonusu olandır. 4- Mendub olan ayağa kalkmak: Yolc$ktan gelen kimsenin gelişine sevinerek ona selam vermek maksadıyla yahut yeni bir nimete mazhar olan kimseyi o nimeti elde ettiği için tebrik etmek ya da bir musibet ile karşı karşıya kalan kimseyi bundan dolayı taziye ve teselli etmek amacıyla ayağa kalkış",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 36
			}
		}
	]
}