{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6266,
			"arabicnumber": 6266,
			"text": "Abdullah İbn Abbas'tan rivayete göre, \"Ali İbn Ebi Talib r.a., Nebi Sallallahu Aleyhi ve Sellem'in vefatı ile sonuçlanan rahatsızlığı esnasında Nebiin yanından çıktı. İnsanlar: Ey Ebu'l-Hasen, Rasulullah Sallallahu Aleyhi ve Sellem nasıl sabahladı, diye sordular. Ali: Allah'a hamdolsun iyileşmiş olarak sabahı etti, dedi. el-Abbas onun elinden yakalayarak: Sen onu görmüyor musun? Allah'a yemin ederim ki, sen üç gün sonra asanın kulu olacaksın. Allah'a yemin ederim ben Rasulullah Sallallahu Aleyhi ve Sellem'in bu hastalığı sonunda vefat edeceği görüşündeyim. Çünkü ben Abdulmuttalib oğullarının ölümlerinin yaklaştığını yüzlerinin halinden anlarım. Haydi kalk, seninle Rasulullah Sallallahu Aleyhi ve Sellem'in yanına gidelim de ona ondan sonra işin kimin hakkı olacağına dair soru soralım. Eğer bu iş bize ait olacaksa bunu öğrenmiş oluruz, eğer bizden başkasına ait olacaksa, ondan o kimselere hakkımızda tavsiyede bulunmasını isteriz, dedi. Ali: Allah'a yemin ederim eğer biz bu işi Rasulullah Sallallahu Aleyhi ve Sellem'e sorsak, o da bu işi bize vermeyecek olursa, insanlar da o işi bizi ebediyen vermeyecektir. Gerçek şu ki ben bu hususu ebediyen Rasulullah Sallallahu Aleyhi ve Sellem'e sormayacağım, dedi.\" Fethu'l-Bari Açıklaması: \"Mu'anaka (birbirinin boynuna sarılmak) ve kişinin: Nasıl sabahı ettin, diye sormas!.\" İbn Battal dedi ki: İnsanlar mu'anaka hususunda görüş ayrılığı içindedirler. Malik bunu mekruh görmüş, İbn Uyeyne ise caiz kabul etmiştir. el-Mühelleb dedi ki: el-Abbas'ın, Ali'nin elinden tutması, musafahanın caiz oluşuna, hasta olan kimsenin durumunu: Nasıl sabahı etti, diye sormanın da caiz oluşuna delil olduğu gibi, zann-ı galibe dair yemin etmenin caiz oluşuna dair delil de ihtiva eder. İbnu't-Tin'in naklettiğine göre ed-Davudi: \"Nasıl sabahı ettin\" tabirini insanlar ilk olarak Amevas TaCıriu esnasında kullandıklarını söylemiştir. Ancak ona Arapların bunu İslamdan önce de söyledikleri ve Müslümanların da bu hadiste belirtildiği üzere bunu kullandıkları belirtilerek itiraz edilmiştir. Derim ki: Buna şöyle cevap verilir: Öncelik, İslam döneminde meydana gelen hakkında yorumlanır. Çünkü İslam, karşı karşıya gelen kimselerin selamlaşmalarını teşri buyurmuştur. Daha sonra da halinin nasılolduğuna dair soru sormak, ortaya çıkmıştır. Her ikisini bir arada kullanan da çok az idi. Sünnet olan da selam ile söze başlamaktır. Buna (nasıl sabahı ettin, diye sormaya) sebep de görüldüğü kadarıyla meydana gelen Taun hastalığı idi. Bu hastalık sebebiyle kişinin arkadaşına halini sormasını gerektiren sebepler ortaya çıkmış oldu",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 40
			}
		}
	]
}