{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"79": "Asking Permission"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6295,
			"arabicnumber": 6295,
			"text": "Cabir İbn Abdullah r.a.'dan dedi ki: \"Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: Kapların üstünü örtünüz. Kapıları kapatınız, kandilleri söndürünüz. Çünkü o fasıkcık (fare), kandilin fitilini çekip ev halkının yanmasına sebep olabilir.\" Fethu'l-Bari Açıklaması: Kurtubi dedi ki: Bu hadisteki emir ve nehy, irşad içindir. Yine Kurtubi: Mendubluk bildirmek için de olabilir, demiştir. Nevevı ise bunun irşad için olduğunu kesin olarak ifade etmiştir. Çünkü bu emir, dünyevı bir masıahat içindir. Ancak bu dini bir maslahata da götürebilir, denilerek ona itiraz edilmiştir. Bu da öldürülmesi haram olan nefsin, saçıp savrulması haram olan malın korunmasıdır. Kurtubi der ki: Bu hadislerden anlaşıldığına göre bir kişi bir evde geceyi geçirecek olup evde kendisinden başka birisi yoksa ve orada da ateş varsa uyumadan önce ateşi söndürmeli yahut ona karşı yanmaktan yana güven altında olunacak tedbirleri almalıdır. Şayet evde kalabalık iseler onlardan birisinin bunu muayyen olarak yapması gerekir. Bu işi aralarında en çok yapması gereken kişi ise son uyuyacak olanlarıdır. Bu hususta kusurlu davranan kimse sünnete muhalefet etmiş ,!e sünneti terk etmiş birisi olur. Daha sonra Kurtubi, Ebu.Davud'un rivayet ettiği ıbn Hibban'ın ve Hakim'in sahih olduğunu belirttikleri Ikrime yoluyla İbn Abbas'tan gelen şu hadisi kaydetmektedir: İbn Abbas dedi ki: \"Bir fare gelip çıra fitilini sürükleyerek Nebi Sallallahu Aleyhi ve Sellem'in üzerinde oturmakta olduğu seccadenin önüne bıraktı. O seccadenin dirhem büyüklüğündeki kadar bir yerinin yanmasına sebep oldu. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem: Uyuduğunuz vakit, çıralarınızı söndürünüz. Şüphesiz şeytan böyle birisine böylesini gösterir ve yanmanıza sebep olur, buyurdu.\" Aynı zamanda bu hadiste emrin sebebi de o fasıkcığı -ki fare dir- fitili çekmeye itenin şeytan olduğu da beyan edilmektedir. Böylelikle şeytan insanın düşmanı olarak onun bir başka düşmanı olan ateşin yardımını almaktadır. Allah lütfu keremiyle bizleri düşmanların hile ve tuzaklarından korusun. Şüphesiz ki o, çok Rauftur, Rahimdir. İbn Dakiki'l-'Id de şöyle diyor: Çıranın söndürülmesinin emredilme illeti fasıkçığın (farenin) fitili çekip sürüklemesinden sakınıp ona karşı tedbir almak olduğuna göre, bu emrin muktezası da şu olur: Eğer çıra farenin kendisine ulaşamayacağı bir durumda ise, onu yanık bırakmak yasak değildir. Mesela, farenin yükselip çıkmasına imkan vermeyen düz, pürüzsüz bir bakırdan yapılmış bir şamdan üzerinde ise yahut bulunduğu yer farenin çıraya kadar ulaşmasına imkc'in vermeyecek kadar uzakta bulunuyor ise (çıra yanık kalabilir). Devamla der ki: Ama ateşin söndürülmesi emri mutlak olarak varid olmuştur. Nitekim İbn Ömer ve Ebu Musa'nın rivayet ettikleri hadislerde böyledir. Ateş lafzı ise, çıranın ateşinden (alevinden) daha genel bir ifadedir. Çünkü bundan fitilin çekilip sürüklenmesi dışında bir başka kötülüğün çıkması imkanı da vardır. Çıradan bir şeyin, evin bazı eşyaları üzerine düşmesi, şamdanın düşerek çıranın birtakım eşyalar üzerine dağılıp, onları yakması hali gibi. Bu durumda bunların olmayacağından emin olmak gerekir. Eğer böyle bir yangına sebep olmayacağından emin olunursa, bu durumda illetin ortadan kalkması dolayısıyla hüküm de ortadan kalkmış olur. Derim ki: Nevev!, -mesela- kandil ile ilgili olarak bunu açıkça ifade etmiştir. Çünkü bu durumda zarardan yana emin olunabilir, ama çıra hakkında aynı şekilde emin olmak söz konusu değildir",
			"grades": [],
			"reference": {
				"book": 79,
				"hadith": 67
			}
		}
	]
}