{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6305,
			"arabicnumber": 6305,
			"text": "Enes İbn Malik'ten nakledildiğine göre Nebi Sallallahu Aleyhi ve Sellemşöyle buyurmuştur: \"Her Nebi'nin bir isteği (ya da \"Her Nebi'nin bir duası\") kabul edilmiştir. Ben bu hakkımı Kıyamet günü ümmetime şefaat için kullandım\". Fethu'l-Bari Açıklaması: \"Her Nebi'in kabul edilen bir duası uardır\" ifadesinin (dua edenlere mutlaka icabet edileceğini bildiren) ayet ile ilişkisi bazı duaların dua edenin istediği şekilde müstecab olmadığı noktasındadır. \"Ben bu hakkımı ahirette ümmetime şefaat için saklıyorum\" ifadesine gelince Müslim'in naklettiği ve Ebu Hureyre'den gelen bir hadiste geçmiş zaman kipi kullanılarak .:..ı1 .;1-' \"Ben sakladım\" denilmiştir. Enes İbn Malik tarafından nakledilen hadiste ise J y;) \"Ben dua hakkımı şöyle kullandım\" buyurulmuş ve ayrıca \"Kıyamet günü\" ifadesi ilave edilmiştir. Ebu Salih'in naklettiği haberde \"İnşallah ümmetimden Allah'a şirk koşmadan ölenler şefaatime nail olacaklardır\" cümlesi yer almaktadır. Muhtemelen Nebi s.a.v. duasını ertelemek istemiş; ancak daha sonra bundan vazgeçip dua edip talebinin yerine gelmesini arzu etmiştir. Allah Teala'nın kendisine duasının kabul edildiğini haber vermesine dayanarak da bu konuda kendisinden emin bir şekilde konuşmuştur. Şefaat ve çeşitleri hakkında ayrıntılı bilgi Rikak bölümünün başında arzedilecektir (Nuh 26). Nebilerin özellikle de bizim Nebiimizin birçok duası kabul edildiği için hadisin ilk etapta anlaşılan anlamı sorunlu sanılabilir. Zira hadise göre Nebilerin yalnızca bir duaları makbul sayılacaktır. Halbuki hadiste kastedilen kabulü kesin olan duadır. Diğer duaların ise kabulü ancak umulabilir. Her Nebiin kabul edilen duasından kastın en faziletli duaları olduğu da ileri sürülmüştür. Bu yoruma göre onların başka duaları olmakla birlikte en faziletli duaları makbul sayılmıştır. Başka bir yoruma göre ise Nebilerin ümmetIerini kapsayıcı tarzda onların helak ya da kurtuluşu için yaptıkları genel dualar makbul iken özel dualarının kabul edilmesi garanti edilmemiştir. İbnü'tTın'in naklettiğine göre Nebilerin kendi dünyaları ya da nefisleri için yaptıkları bir duaları kabul buyurulmuştur. Örneğin Hz. Nuh \"Ya Rabbı! Yeryüzünde dolaşan bir tek kafir bile bırakma!\", Hz. Zekeriya \"Bana lütf-u kereminden öyle bir uaris nasib et ki bana da, Yakub hanedanına da uaris olsun. Onu, razı olacağın bir insan eyle ya Rabbf!\"(Meryem 5-6) ve Hz. Süleyman \"Ya Rabbf! Affet beni ve bana, benden sonra hiç kimseye nasib olmayacak bir hakimiyet lutfet. Çünkü Sen, lütufları son derece bolalan vehhabsın!\"(Sad 35) diye dua etmişlerdir. Mesabfh adlı kitabı şerhedenlerden biri şunları söylemiştir: Bilinmelidir ki Nebilerin bütün duaları makbuldür. Bu hadis Nebilerin hepsinin kavminin helak edilmesi için dua ettiğini ancak Nebiimizin bu şekilde ümmetine beddua etmediğini bildirmektedir. Ümmetinin yaptığı ezalara karşı gösterdiği sabır sebebiyle kendisine şefaat hakkı verilmiştir. Burada ümmetten kasıt ümmet-i davet olup ümmet-i icabet değildir. Ancak Tıbı bu sözleri eleştirerek Hz. Nebi'in bazı Arap kabilelerine, isimlerini zikrederek bir takım Kureyşlilere, Rı'l, Zekvan ve Mudar adlı kabileiere beddua ettiğini ifade etmiştir. Ona göre bu hadisin şöyle yorumlanması daha doğrudur: Allah her Nebie sonucunu dünyada görecekleri ümmetieriyle ilgili bir dua hakkı vermiştir. Nebiimiz bu hakkını ümmetinden bir kısmı için kullanınca \"Bu hususta sana ait bir iş yoktur: Allah ister onlara tövbe nasib edip bağışlar, ister nefislerine zulmettikleri için onları cezalandırır. Senin görevin sadece uyanp irşad etmektir\" ayeti nazil olnıu Böylece Nebiimizin hakkı ahirete kalmıştır. Hz. Nebi de beddu'a-eftiği kimseIerin helak edilmelerini değil aslında tevbeye yönlendirilmelerini istemiştir. Nebilerin bütün dualarının makbulolduğu yolundaki değerlendirme yapılırken \"Allah'tan üç şey istedim. İkisini kabul etti birini etmedi\" şeklindeki sahih bir hadis unutulmuş görünmektedir. ibn Battal bu hadisin Nebiimizin diğer Nebilerden üstün olduğunu gösterdiğini; zira makbul duasında ümmetini kendi nefsine ve ailesine tercih ettiğini ayrıca önceki Nebiler gibi ümmetin (ümmet-i davetin) helaki için beddua etmediğini ifade etmiştir. ibnü'l-Cevzl ise şu yorumu yapar: Bu Nebi s.a.v.'in güzel tasarruflarından biridir. Çünkü duasını gerektiği gibi kullanmıştır. Ayrıca cömertliğinin bir göstergesidir. Zira ümmetin i kendisine tercih etmiştir. Yine duasını dindar müslümanlardan daha fazla duaya ihtiyacı olan günahkarlara hasretmesi sebebiyle aklı değerlendirmelerindeki sağlamlığın bir işaretidir. Nevevi ise bu hadisin ümmetin e şefkatini, merhametini ve menfaatlerini koruduğunu gösterdiğini; çünkü duasını onların en fazla duaya muhtaç olacakları bir zaman için sakladığın: ifade etmiştir. \"inşallah ümmetimden Allah'a şirk koşmadan ölenler şefaatime nail olacaklardır\" rivayeti büyük günahları işlemekte ısrar eden bir kimse dahi olsa Allah'a şirk koşmayan müslümanların cehennemde ebedi kalmayacakları yolundaki Ehl-i sünnet görüşünün doğruluğunu ispat eden bir delildir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 2
			}
		}
	]
}