{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6309,
			"arabicnumber": 6309,
			"text": "Enes İbn Malik'ten rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah Teala kulunun tevbesine, çölde kaybettiği devesini tesadüfen bulan bir adamın duyacağz sevinçten daha fazla sevinir\" Fethu'l-Bari Açıklaması: İmam Buhar! önce istiğfar sonra tevbe konusunu dua bölümünün başında işleyerek duaların kabulünün günahlardan arınma durumunda daha muhtemel olduğuna işaret etmek istemiştir. Eğer dua edecek kişi önce tevbe istiğfar ederse duasının makbulolması daha da mümkün hale gelir. İbnü'l-Cevz!'nin \"Allah'ı tesbih mi edelim yoksa istiğfar mı edelim?\" sualine verdiği \"Kirli elbiseye koku sürmektense onu yıkamak gerekmez mi?\" şeklindeki cevap meseleyi oldukça güzel açıklamaktadır. ..........İstiğfar ....... Ğufran kelimesinin istifal babına aktarılmış şeklidir. Kökü \"bir şeyi kirden koruyacak örtüyle örtmek\" anlamına gelen Ğafr kelimesidir. Her şeyin kirlenişi kendisine göredir. Allah'ın kullarına ğufranı onları azaptan korumasıdır. Tevbe ise kulun bir şekilde günahlardan uzaklaşmasıdır. İslam! bir terim olarak ise tevbe günahları kötü oldukları için terketmek, işlenen günahlardan pişmanlık duymak, bir daha günah işlememeye niyet etmek, haksızlığı reddetmek ya da haksızlık edenden kurtulmayı istemektir. Büyük alimlerden biri tevbeyi gerçekten ya da takdiren geçmiş bir günahı Allah için terketmeyi istemek diye tanımlamış ve bu tanımın en iyi ve etrafını cami tarif olduğunu belirtmiştir. Hocalarımızdan birisi tevbe için şu şartların varlığından da bahsetmiştir: Kişinin günah işlediği mekanı terketmesi, öleceğini anlayınca tevbe etmiş olmaması, güneşin batıdan doğmuş olmaması (kıyamet koprken tevbe etmiş olmaması), günahı tekrar işlememesi. Eğer tevbe edilen günah tekrar işlenirse ilk tevbenin batıl olduğu anlaşılır. Bana göre birinci şart (günah işlenen yeri terketmek) müstehaptır. İkinci ve üçüncü şartlar ise bizzat mükellefiyet ile ilgilidir. Dördüncü şarta gelince bu Kadı Ebu Bekr el-Bakıllanl'ye nisbet edilmiştir. Halbuki \"İstiğfarın Fazileti\" babında işaret ettiğimiz üzere yirmi bab sonra gelecek olan hadis bu son koşulun geçersizliğini ortaya koymaktadır. Halim! esma-i hüsna içerisinde yer alan Tewab kelimesinin tefsirini yaparken \"Kulu her ne zaman kendisine ibadeti yeğlerse ve işlediği günahlardan pişmanlık duyarsa onun önceden yaptığı iyilikleri yok etmeyip itaatkar kullarına vermeyi vaadettiği nimetlerden onu mahrum bırakmaksızın kuluna rahmetiyle muamele eden\" demiştir. Hattabı de Tewab ismini \"Kul günah işleyip tevbe ettikçe onun tevbelerini kabul eden\" yorumunu yapmıştır. Hadis metnin de yer alan \"elini burnuna götürdü\" ifadesi raviye aittir. Bu durum yine hadis metninde geçen .......fekale «şöyle dedi» kelimesinden anlaşılmaktadır. Muhib et-Taberi bu kısımda yapılan benzetmenin Allah'tan ve O'nun cezasından çok korkan mu'minlerin bir niteliği olduğunu; zira onların günah işlediklerini kesin olarak bilmekle birlikte affa mazhar olacaklarını tam olarak bilemediklerini; günahkar kimselerin ise Allah'ı bilmedikleri için O'ndan korkmadıklarını ve bu sebeple de günah işlemeyi hafife aldıklarını belirtmiştir. İbn Ebi Hamza ise günahkarın kalbi karardığı için günah işlemeyi önemsiz gördüğünü; bu sebeple kendisine nasihat edildiği zaman ciddi bir tavır takınmadığını söylemiştir. Ayrıca hadisin, günahtan korkmayan ve de bunu hafife alan bir mu'minin facir olarak değerlendirileceğini gösterdiğine işaret etmiştir. Hadiste mümkün şeylerle örneklendirme yapılmakta, nefis muhasebesine teşvik edilmekte, iman nimetinin varlığına delalet eden işaretlerin dikkate alınması önerilmekte, fücurun da iman gibi kalple ilgili olduğu vurgulanmaktadır. Ayrıca günah sebebiyle insanları tekfir etmeyi doğru bulmayan Ehl-i sünnet için bir delil olan bu hadis günah sebebiyle insanları tekfir eden Haridierin kanaatinin yanlışlığını göstermektedir. İbn BattaI da mu'minlerin küçük olsun büyük olsun bütün günahlar sebebiyle Allah'tan orkmaları gerektiğini; zira Allah Teala'nın küçük şeyler içinde azap edebileceğini ve O'nun yaptıkları sebebiyle sorgulanamayacağını ifade etmiştir. Hadis metninde yer alan .........sakata ala bairihi ifadesi \"devesiyle aniden karşılaştı, devesini buldu\" anlamlarına gelmektedir. Yine hadiste geçen ........ve kad edallehu ibaresi \"farkında olmadan devesini kaybetti\" demektir. .........felat ise \"çöl\" demektir. Katade'nin rivayeti bu noktada sona ermektedir. İshak İbn Ebi Talha'nın Enes İbn Malik'ten aktardığı ve Müslim'in Sahih'inde yer alan rivayette şu ziyade bulunmaktadır: \"Deve üzerinde yiyecek ve içecek olduğu halde sahibinden uzaklaştı. Adam artık deveden umudunu kesip bir ağacın gölgesine sığınıp uzandı. Adam orada yatarken deve yanına geldi. Bunun üzerine adam devenin yularını tutup sevinçten şaşırarak \"Allahım sen benim kulumsun ben de senin rabbinim!\" deyiverdi\". Kadı İyaz bu hadisin dehşet ve yanılgı sebebiyle söylenen böylesi sözlerin günah olmadığını gösterdiğini ifade etmiştir. Yine ciddiyetten uzak bir şekilde, taklit veya şaka amacı güdülmeksizin ilmi bir yolla ve dini bir menfaat için bunları anlatmanın da bir sakıncası yoktur. Zira Allah Resulü bunları anlattığına göre bu mümkündür. Eğer bu yasak olsaydı Nebi s.a.v. bu örnekleri vermezdi",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 6
			}
		}
	]
}