{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6317,
			"arabicnumber": 6317,
			"text": "İbn Abbas'tan rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem gece teheccüd namazı kıldığında şu duayı edermiş: \"Allahım! Hamd sanadır. Sen göklerin, yerin ve bunlarda olan her şeyin nurusun. Hamd sanadır. Sen, gökleri, yeri ve bunlarda olan her şeyi yönetensin. Sen haksın. Vaadin hak. Sözün hak. Huzuruna gelmemiz hak. Cennet hak, Cehennem hak. Kıyamet hak. Nebilerin ve Muhammed hak. Allahım! Sana teslim oldum ve tevekkül ettim. Sana inandım, boyun eğdim, senin için savaştım, seni hakem bildim. Geçmiş ve gelecek, gizli ve açık kusurlarımı bağışla. Öne alan da sona koyan da sensin! Senden başka ilah yoktur!\" Fethu'l-Bari Açıklaması: Hadis metninde geçen ........ seb'un fi't-tabuti «yedi şey var ki tabuttadır» ifadesinden ne kastedildiği hususunda farklı yorumlar yapılmıştır. Dimyati Haşiyesinde tabuttan kastın kalbe kap görevi gören göğüs olduğunu kesin bir dille söylemiştir. Ondan önce İbn BattSI ve Davudi de aynı kanaati serdetmişlerdir. İbn BattSI ilmini hafızasına nakşedenler hakkında ............ ilmuhu fi't-tSbuti müstevdeun «ilmi göğsüne emanettir» denildiği bilgisini ilave etmiştir. İbnü'l-Cevzi ise tabut kelimesiyle sandığın kastedildiğini ve hadisteki ifadenin «yedi şey var ki henüz ezberlemedim; bunlar yanımdaki sandıktadır» anlamına geldiğini savunmuştur. Hadiste yer alan ......... asabi kelimesi ile ........ beşeri İbnü't-Tin'in belirttiğine göre eklem yerlerındeki sinirler ile deri anlamlarına gelmektedir. Sonda zikredilen iki şey ise öncesinde zikri geçen yedi şeyin tamamlayıcısıdır. Kurtubi Resulullah s.a.v.'in organlarını sayarak talep ettiği nuriarın asıl anlamında kabul edilerek kıyamet günü kendisinin, ona tabi olanların ve Allah'ın dilediği kuııarının azalarının parlayabileceğini söylemiştir. Ancak daha doğru yorumun ise bunun ilim ve hidayete işaret ediyor olmasıdır. Örneğin şu ayetlerde nur kelimesi bu anlamdadır: «o, Rabbi katından bir nur üzere olmaz mı?\"(Zümer 22) ve \"insanlar arasında yürürken önünü aydınlatacak bir nur verdiğimiz kimsenin durumu\"(En'am 22)",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 14
			}
		}
	]
}