{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6318,
			"arabicnumber": 6318,
			"text": "Ali r.a.'den aktarıldığına göre Hz. Fatıma el değirmeninin ellerini tahriş etmesinden şikayetlenerek bir hizmetçi istemek üzere Resulullah Sallallahu Aleyhi ve Sellem'e gelmiş; kendisini bulamayınca durumu Hz. Aişe'ye anlatmıştır. Kızının isteğini öğrenen Nebi Sallallahu Aleyhi ve Sellem de onların evine gelip yatmaya hazırlanan kızı ve damadının arasına oturmuş (bu esnada kalkmak isteyen Hz. Ali'ye izin vermemiş; ayrıca Hz. Ali Nebi efendimizin ayağının serin liğin i göğsünde hissetmiştir) ve onlara \"Size hizmetçiden daha hayırlı bir şey söyleyeyim mi? Yattığınız zaman 34 kere tekbir, 33 kere tesbih, 33 kere hamdedin\" demiştir. Fethu'l-Bari Açıklaması: Bab başlığında tekbir ve tesbih yanında \"tahmid / hamdetme\" ifadesi de yer alıyor sayılmalıdır. Hz. Fatıma'nın talep ettiği hizmetçi cariyelerdendir. Bu hadiste zikri geçen tekbir, tesbih ve hamdin cariyeden daha hayırlı oluşu hakkında değişik yorumlar yapılmıştır. Kadı İyaz Nebi Sallallahu Aleyhi ve Sellem'in kızına ve damadına her durumda ahiret amellerinin dünya amellerinden üstün olduğunu söylemek istediğini belirtir. Yalnızca zikir öğretisinde bulunması hizmetçi verme imkanının olmamasındandır. Taleplerini yerine getiremediği için onlara istediklerinden daha hayırlı olan bir zikir öğretmiş olmalıdır. Kurtubi ise Resulullah Sallallahu Aleyhi ve Sellem'in ihtiyaç anında dua etmeye eş değer olan bir zikir öğrettiği kanaatindedir. Kendisi için nasıl fakirliği ve sonunda ulaşılacak ecrin büyüklüğünü düşünerek sıkıntılarına sabretmeyi tercih etmişse kızı içinde aynı şeyi istemiş de olabilir. Mühelleb de Nebi Sallallahu Aleyhi ve Sellem'in, kızına ahirette daha yararlı olacak bir şey öğrettiğini ifade etmiştir. Mal ve çoluk çocuk derdine düşmeyip karın tokluğuna ilim öğrenmek ve sünneti ezberlemeye kendilerini adayan Ashab-ı suffayı yeğlemiştir. Ashab-ı suffa azık karşılığında nefislerini Allah'a satmışlardır. Bu hadis ilim talebelerinin humus (ganimet) dağıtılırken öncelenmesi gerektiğine delalet etmektedir. Ayrıca selefin hayatın zorluklarına, az mala ve sıkıntılara nasıl dayandıkları da bu hadiste ifade edilmektedir. Allah onlara dünyalık bahşetme imkanına sahip olmasına rağmen dünyalıkların getireceği ilave yüklerden onları korumak istemiştir. Nebilerin ve velilerin çoğunun durumu böyledir. İsmail Kadı şöyle demiştir: Bu hadis devlet başkanının ganimeti dilediği yerlere sarfedebileceğini göstermektedir. Zira esirler de ganimete dahildir. Ganimet onu hakedenlere aittir. Bu İmam Malik ve başka alimlerin de görüşüdür. İmam Şafii ve başka bazı alimler ehl-i beytin ganimette hak sahibi olduğunu beyan etmiştir. Bu konunun ayrıntısı cihad bahsinin sonlarında geçmiştir. Mühelleb'e göre bu hadiste kişinin kendisi için tercih ettiği ahireti, eğer buna muktedir iseler ailesi için de tercih edip onları yönlendirmesi gerektiği ifade edilmektedir. Bu hadiste Hz. Ali ve Hz. Fatıma hakkında güzel bir menkıbe anlatılmaktadır. Yine kızlara ve yakınlara şefkat ve merhamet kanatlarının gerilmesi ve kibri yok edip birliğin sağlanması söz konusudur. Zira Hz. Nebi kızını ve damadını rahatsız etmemiş yanında yatıyor halde kalmalarına müsaade etmiştir. Hatta ayaklarını aralarına sokmuş ve yanlarında kalıp istedikleri hizmetçiden daha hayırlı bir zikir öğretmiştir. Ayrıca hadis yatarken bu zikri sürekli tekrarlayanların yorgunluk duymayacaklarının delilidir. Çünkü Hz. Fatıma yorulduğu için hizmetçi istemiş Resulullah s.a.v. da bu zikri tavsiye etmiştir. İbn Teymiyye de aynı şeyi söylemiştir. Bu zikre devam edenlerin yaptıkları işler sebebiyle yorulabileceklerini ama çok çalışmaktan zarar görmeyeceklerini ve sıkıntı duymaya caklarını söylemek daha doğru görünmektedir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 15
			}
		}
	]
}