{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6321,
			"arabicnumber": 6321,
			"text": "Ebu Hureyre r.a.'den rivayet edildiğine göre Resululah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah Teala gecenin son üçte birlik kısmı kalınca dünya semasına iner ve kim dua eder duasına icabet edeyim? kim bir şeyler ister vereyim? kim mağfiret ister affedeyim? der\". Fethu'l-Bari Açıklaması: Bu bab başlığı gece yarısı yapılan duaların diğer zamanlarda yapılan dualardan daha üstün olduğunu göstermeyi amaçlamaktadır. İbn BattSI şöyle demiştir: \"Bu vakit oldukça faziletlidir. Allah teSıS dünya semasına inişini o vakte hasretmiştir. Kullarının dualarını, isteklerini ve af dileklerini bu vakitte kabul eder. Halbuki bu vakit gaflet, yalnızlık ve uyku vaktidir. Bunları terketmek ise oldukça zordur. Özellikle de rahatına düşkün olanların soğuk havalarda yataktan kalkması çok güçtür. Yine gündüz çalışıp yorulanların kısa gecelerde uykularından feragat etmesi kolay değildir. Eğer birisi tüm bunları bırakıp Rabbine dua için kalkıyorsa bu onun niyetinin halisliğini ve Rabbinin vereceği mükafatı arzuladığını gösterir. İşte bu sebeple Allah TeSıS işin ciddiliğini anlamaları ve ihlas içinde bulunmaları amacıyla kullarının, nefsin dünya arzularından uzaklaştığı bu vakitte dua etmelerini öğütlemiştir. İbn BattaI dünya semasına inme fiilinin Allah için muhal olduğunu zira bunun yukarıdan aşağıya doğru hareket edilmesini gerektirdiğini ifade etmiştir. Halbuki kesin delillerle Allah Tealanın bundan münezzeh olduğu bilinmektedir. O halde hadisin yorumlanması gerekir. Örneğin rahmet meleğinin nüzul ettiği söylenebilir ya da Allah'ın nüzulden münezzeh olduğuna inanılarak bunun keyfiyetinin bilinmediği düşünülebilir. Hadisin şerhi daha önce teheccüd namazı konusu işlenirken \"Gece sonunda kılınan namazda yapılacak dua\" babında geçmişti. Tevhid bölümünde de hadise değinilecektir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 18
			}
		}
	]
}