{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6328,
			"arabicnumber": 6328,
			"text": "Abdullah İbn Mes'ud şöyle demiştir: \"Biz namazda Allah'a selam olsun, falana selam olsun derdik. Bir gün Resulullah Sallallahu Aleyhi ve Sellem \"Bizzat Allah selamdır\" dedi. \"Namazda oturduğunuz zaman tahiyyat duasını okuyun. Eğer bunu okursanız gökte ve yerdeki tüm salih kullara selamınız ulaşır. Allah'tan başka ilah olmadığına ve Muhammed'in Allah'ın elçisi olduğuna şehadet ederim. Bundan sonra da istediğiniz duayı yapabilirsiniz\". Fethu'l-Bari Açıklaması: Taberi Hz. Ebu Bekr'in naklettiği hadisin bir kimseye mu'min demek için günahsız olmayı ve hata yapmamayı gerekli görenlerin kanaatinin yanlışlığını ortaya koyduğunu; zira Hz. Ebu Bekr'in iman ehlinin en büyüklerinden olduğunu belirtmiştir. Görüldüğü üzere Resulullah Sallallahu Aleyhi ve Sellem ona \"Allahım! Ben nefsime çok zulmettim. Günahları ancak sen bağışlarsın\" demesini öğütlemiştir. Kirmanı de bu duanın veciz ifadeli dualardan olduğunu söylemiştir. Çünkü bu duada kusurlar itiraf edilmekte ve en büyük nimet istenmektedir. Mağfıret günahların örtülüp silinmesidir. Rahmet ise güzelliklerin bahşedilmesidir. Yani ilki cehennemden kurtuluşu ikincisi cennete ulaşmayı istemek anlamına gelir. Bu da nihayi kurtuluşun kendisidir. İbn Ebi Cemre ise özetle bu hadisin namazda dua etmenin Şari' tarafından talep edildiğini, söz konusu duanın diğer dualardan üstün olduğunu, insanların bir takım şeyler bildikleri konularda dahi daha bilgili olanlardan bir şeyler öğren mesi gerektiğini, kişinin secde halindeyken Allah'a en yakın durumda olmasından hareketle namazda dua etmenin önemini gösterdiğini söylemiştir. Yine ibadetin nasıl yapılacağının mertebe itibariyle üstün olanlardan öğrenileceği de bu hadisten çıkarılabilir. Resulullah Sallallahu Aleyhi ve Sellem'in Hz. Ebu Bekr'e bu duayı öğretmesi ahiretin dünyaya tercih edilmesi gerektiğine işaret etmektedir. Muhtemelen Hz. Ebu Bekr'in hali Nebi s.a.v.'e bunu düşündürmüş olmalıdır. \"Allahım! Ben nefsime çok zulmettim. Günahları ancak sen bağışlarsın\" sözü günahların affı konusunda Allah'a muhtaç olduğumuzu açıkça ilan etmektedir. Bunun hiçbir çıkış yolu bulunmamaktadır. Hadis zor durumda kalanların dualarının müstecab olmasının daha muhtemelolduğuna ve ayrıca nefsin köreltilip kusurların itiraf edilmesine de delalet etmektedir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 25
			}
		}
	]
}