{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6358,
			"arabicnumber": 6358,
			"text": "Ebu Saıd el-Hudri\"den rivayet edildiğine göre sahabller \"Ya Resulallah! Selamı biliyoruz peki nasıl salat edeceğiz?\" dediler. O da اللهم صل على محمد عبدك ورسولك، كما صليت على إبراهيم، وبارك على محمد، وعلى آل محمد، كما باركت على إبراهيم وآل إبراهيم Allahumme salli ala Muhammedin abdike ve Resulike kema salleyte ala İbrahime. Ve Barik ala Muhammed ve ala al-i Muhammed kema barekte ala İbrahime ve al-i İbrahim. dememizi öğretti. Meali: \"Allahım! İbrahim ve ailesine salat ettiğin gibi Muhammed ve ailesine de salat et. İbrahim ve ailesine bereket verdiğin gibi Muhammed ve ailesine de bereket ver\" Fethu'l-Bari Açıklaması: Bab başlığında sadece \"Resulullah s.a.v.'e salat\" ifadesinin geçmesi salatın hükmünün, faziletinin, nasıl yapılacağının ve yerinin işleneceğini düşündürmektedir. Ancak zikredilen hadislere bakılırsa sadece salatın nasıl yapılacağı işlenmiş gibi durmaktadır. Faziletine de işaret edilmek istendiği düşünülebilir. Salatın hükmü konusunda alimlerin on farklı kanaat serdettiklerini görmekteyiz: 1. İbn Cerır et-Taberi'ye göre salat müstehaptır ve alimler bu konuda icma etmişlerdir. 2. İbnü'l-Kassar'ın ve başkalarının aktardığı görüşe göre sınırlama olmaksızın vaciptir; ancak en az bir kere söylenirse vacip yerine gelmiş olur. 3. Ebu Bekr er-Razı, İbn Hazm ve başkalarına göre ise kelime-yi tevhid gibi namaz ya da başka yerlerde ömürde bir kere okunması vaciptir. Kurtubi hayatta bir kere olsun salat getirmenin müekked sünnetler gibi bir görev (vacip) olduğu konusunda icma bulunduğunu ifade etmiştir. 4. Şafi1'ye göre namazın son oturuşunda teşehhüdden sonra selamdan önce okunması vaciptir. 5. Tahavı, Hanemerden bir grup, Hal1ml ve Şafillerden bir gruba göre ise Resulullah Sallallahu Aleyhi ve Sellem her zikredildiğinde salat getirilmelidir. Malikllerden İbnü'l-Arabl bu görüşün daha ihtiyata uygun olduğunu belirtmiştir; Ahzab suresinin tefsir edildiği bölümün sonunda Allah'ın Nebi s.a.v.'e yönelik salatının, onu meleklerin yanında övmesi ve meleklerin salatının da ona dua etmeleri anlamına geldiğine dair Ebu'ı-Aliye'den bir yorum nakledilmişti. Mukatil İbn Hayyan ise Allah'ın salatını mağfiret, meleklerin salatını istiğfar olarak yorumlamıştır. İbn Abbas'tan da benzer bir yorum naklediimiştir. İyad el-Kuşeyrı Allah'ın Resulullah Sallallahu Aleyhi ve Sellem'e salatının teşrif (yüceltme) ve ikramını artırma anlamına geldiğini, Nebi s.a.v.'in dışındakiler için ise rahmet demek olduğunu belirtmiştir. Bu yorum Nebi s.a.v. ile diğer mu'minler arasındaki farka işaret etmektedir. Nitekim bir ayette Allah ve meleklerinin Nebi s.a.v.'e salat ettikleri (Ahzab 56) kaydedilmişken bir başka ayette ise mu'minlere de salat edildiğinden bahsedilmektedir (Ahzab 43). Doğal olarak bilinmektedir ki Resulullah s.a.v. bu konuda başkalarından daha üst mertebede salata layıktır. Bu ayette başka ayetlerden farklı olarak Nebi s.a.v.'in tazim edildiği ve yüceltildiği konusunda icma vardır. Halımı de Resulullah s.a.v.'e salatın onu tazim anlamına geldiğini belirtmiştir. Yani \"Allahım! Muhammed'e salat et\" demek \"onu yücelt\" demektir. Bu sözle dünyada isminin yüceltilmesi, dininin yaygınlaşması, şeriatinin ebediliği; ahirette ise bol mükafatlara ermesi, ümmetine şefaat edebilmesi, makam-ı mahmud da fazilete ermesi kastedilmektedir. Buna göre mu'minlerden Hz. Nebi s.a.v.'e salat etmelerinin istenmesi rablerinden ona salat etmesi için dua etmeleri anlamına gelmektedir. Nebi s.a.v.'e salih edilirken Hz. İbrahim ve ailesine salat edilmesinin referans gösterilmesi konusunda açıklama yapmak gerekir. Zira yalnızca Nebi s.a.v. dahi Hz. İbrahim ve ailesinden daha üstün olduğu halde, arap dilindeki teşbih sanatı gereği öğretilen salat dualarında (Salli Barik duaları) diğerleri üstün görülmektedir. Çünkü bu dualarda Hz. İbrahim ve ailesi müşebbeh bihdir (kendisine benzetilen). Halbuki Nebi s.a.v. ile birlikte ailesinin de zikredilmesi üstünlüğünü bir kat daha artırmaktadır. Onun üstünlüğü ona yapılacak salatın da üstünlüğünü gerektirir. Bu konuda farklı yorumlar yapılmıştır: 1. Nebi s.a.v. Salli ve Barik dualarını öğretirken Hz. İbrahim'den daha üstün olduğunu bilmiyordu. Müslim'in rivayet ettiği bir hadise göre Nebi s.a.v. kendisine \"mahlukatın en hayırlısı\" diye hitap eden sahabıye Hz. İbrahim'i işaret etmiştir. İbnü'l-Arabı bu hadisi delilolarak kullanmış ve Nebi s.a.v.'in kendisi için Hz. İbrahim ile denklik talep etmesi ve ümmetine de bunu emretmesi ile bunu teyit etmiştir. Allah Teala da onu Hz. İbrahim'den daha üstün kılmıştır. Bununla birlikte bu yorum Nebi s.a.v.'in üstün olduğunu öğrendikten sonra salatın şeklini değiştirmemesi sebebi ile tenkit edilmiştir. 2. Nebi s.a.v. tevazusu sebebiyle böyle söylemiş; ümmetine de fazilet elde etmeleri için bunu tavsiye etmiştir. 3. Buradaki teşbih Hz. İbrahim'e yönelik salat ile Nebi s.a.v.'e yönelik salatı asıl itibariyle birbirine benzetmekte, iki salat arasında fazilet benzetmesi yapılmamaktadır. Aynı durum \"Nuh'a vahyettiğimiz gibi sana da vahyettik\" ve \"Sizden öncekilere farz kılındığı gibi oruç size de farz kılındı\" ayetlerinde de geçerlidir. Yine \"Falancaya iyilik yaptığın gibi kendi çocuğuna da iyilik yap\" denildiğinde iki iyilik arasında üstünlük benzerliği kurulmamıştır. Nevevi bu cevapların bir kısmını zikrettikten sonra İmam Şafiı'ye de nisbet edilen son görüşü tercih etmiştir. İbnü'l-Kayyım ise bu son cevap dışındakileri değersiz addedip \"En güzeli Nebi s.a.v.'in Hz. İbrahim'in ailesinden daha hayırlı olduğunu söylemektir\" der. \"Allah Adem'i, Nuh'u, İbrahim ve İmran ailelerini alemlere üstün kılmıştır\" ayetinin tefsirinde İbn Abbas'tan şöyle bir yorum nakledilmiştir: Hz. Muhammed, İbrahim ailesindendir. Sanki kendisine ve ailesine özelolarak salat etmemizi emretmekle, genelolarak İbrahim ailesi içerisinde kendisine yapmış olduğumuz salatı bir de özelolarak tekrar ettirmiştir. Bundan ailesi layık olduğu kadar istifade etmiş; geri kalan kısım kendisine ait olmuştur. Bu da İbrahim ailesinden olan diğer kimselerin payından fazladır. Böylece dua da yapılan teşbihin faydası ortaya çıkmaktadır. Şarihlerden bazılarının ifadesine göre Hz. İbrahim'in ailesinden maksat İshak ve İsmail yoluyla devam eden zürriyetidir. Hiç kuşkusuz Hz. İbrahim'in Sare ve Hacer dışında birisinden çocuğu olduğu kesin olarak bilinirse onlar da bu zürriyete dahil olurlar. Bu zürriyet içerisinde salat sırasında müslüman hatta müttaki olanlar düşünülmektedir. Buna göre kastedilenler Nebiler, sıddıklar, şehidler ve salihler olup, başkaları değildir. Barik duasında Nebi s.a.v. için talep edilen bereket, hayır ve ikramda artırım ya da kusurlardan arındırıp temizleme anlamlarına gelmektedir. Hamıd övülmüş demektir. Medd ise en şerefli anlamına gelir. Hamd, ikram ve nimet bahşetmeye delalet ettiği gibi, bu sıfat da azamet ve celal sahibi olmaya delalet eder. Bu hadise dayanarak her namazda Resulullah s.a.v.'e salat getirmenin vacip olduğu ifade edilmiştir. İmam Şafii el-Ümm adlı eserinde Resulullah s.a.v.'e salat getirmenin farz kılındığını ifade etmiştir. Çünkü ayette şöyle buyurulmaktadır: \"Allah ve melekleri Nebi'e salat etmektedir. Ey iman edenler! Sizler de ona salat-ü selam edin\". Resulullah s.a.v.'e salatın farziyeti en fazla namaz esnasında uygun düşmektedir. Bu konuda Resulullah s.a.v.'den gelen haberlerde de bir delalet söz konusudur. Fukaha bu konuda İmam Şafii'ye muhalefette birleşmemişlerdir. Bilakis Ahmed İbn Hanbeliden bu mesele hakkında iki kanaat aktarılmıştır. İshak İbn Rahuye hamdin farz olduğunu ve onu terkedenin namazını iade etmesi gerektiğiniifade etmiştir. Hanemerle gelince üstadlarımızdan (Şafiılerden) biri, salatın Nebi s.a.v. her zikredildiğinde ona salat getirilmesi gerektiğini söyleyen Tahavı ve benzerlerini, teşehhüdün sonunda da Resulullah s.a.v. anıldığı için burada da salatın vacip kabul edilmesi gerektiğini söylemeye davet etmiştir. Bununla birlikte her ne kadar salatı bırakmamak istenmişse de bu namazın bir şartı da kılınmamıştır. İbnü'l-Kayyım bu meselede İmam Şafii'nin yanındadır. Şöyle der: Teşehhüdde Resulullah s.a.v.'e salat okumanın meşruiyeti konusunda icma oluşmuştur. İhtilaf bunun vacip mi müstehap mı olduğu konusundadır. Selef alimlerinin ameline uymayı gerekli görmeyenıere tabi olmak doğru değildir. Çünkü selef teşehhüdden sonra salat getirirdi. Ancak amel ile inanç / itikad kastediliyorsa bunun vacip olmadığına dair onlardan açık bir delil nakledilmelidir. Bu da bulunamayacak bir şeydir! Nebi s.a.v.'e salatın vacip olup olmadığı konusunda ihtilaf edilen yerler arasında ilk teşehhüdü (dört ya da üç rekatlık namazıarın ikinci rekatındaki teşehhüd), Cuma namazında okunan hutbeyi ve diğer hutbeleri ve cenaze namazını sayabiliriz. Salat getirilmesi konusunda çoğunda sahih isnadlı hadislerin varid olduğu yerler ise şunlardır: Müezzin ile birlikte içten ezan okunduktan sonra, duanın başı, ortası ve sonunda -ki başında olması daha muhtemeldir- kunut duasının sonunda, bayram tekbirlerinde, mescide giriş ve çıkışta, toplanıp ayrılışta, yolculuğa çıkış ve dönüşte, gece namazına kalkışta, Kur'an hatmedildiğinde, sıkıntı halinde yapılan dualarda, günahlardan tevbe edildiğinde, hadis rivayetinde, ilim ve zikir öğretiminde ve bir şeyin unutulmasında. Daha önce geçtiği üzere sahih bir hadiste Cuma günü çokça salat getirilmesi emredilmiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 55
			}
		}
	]
}