{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6385,
			"arabicnumber": 6385,
			"text": "Abdullah İbn Ömer'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem savaş, hac veya umreden dönerken yükseğe çıktığı her yerde üç kere tekbir getirir sonra şöyle derdi: \"Ortağı bulunmayan Allah'tan başka ilah yoktur. Mülk de onundur hamd de ona mahsustur. O her şeye kadirdir. Bizler ona döneceğiz. Ona tövbe edip ibadet etmekte ve hamd etmekteyiz. Allah'ın vaadi hak yardımı kesindir. O tek başına düşmanlarını yok edebilecek kudrete sahiptir\" Fethu'l-Bari Açıklaması: Bu hadiste her ne kadar yalnızca savaş, hac ve umre zikredilse de alimlerin çoğuna göre söz konusu dua başka amaçlarla yapılan yolculuklar için de geçerlidir. Ancak bu yolculuğun akraba ziyareti ya da ilim talebi gibi meşru sebeplerle yapılması şarttır. Çünkü bunların her biri Allah'a itaat kavramına dahildir. Hatta mubah yolculuklar için dahi bu dua geçerlidir. Zira hakkında sevap vaadi bulunmayan yolculuklara çıkanlar sevap elde edecekleri filleri yapmaktan men edilmemişlerdir. Allah'ın vaadinden maksat İslam dininin yayılması ve müslümanların güçlenmesidir. Kur'an-ı Kerim'de şöyle buyurulmaktadır \"Allah size pek çok ganimetler vaat etmektedir\", \"Allah içinizden iman edip makbul ve güzel işler işleyenlere kesin olarak vaat buyurur ki: Daha önce mu'minleri dünyada hakim kıldığı gibi kendilerini de hakim kılacak, kendileri için beğenip seçtiği İslam dinini tatbik etme gücü verecek ve yaşadıkları korkulu dönemin arkasından, kendilerini tam bir güvene erdirecektir. Çünkü onlar, yalnız Bana ibadet edip hiçbir şeyi Bana şerik yapmazlar. Artık bundan sonra kim küfrana saparsa, işte onlar yoldan Çıkıp Allah'a karşı gelmiş olurlar\". Bu ayetler savaş yolculukları ile ilgilidir. Hac ve umre ile ilgili ise \"Allah dilerse mescidi harama güven içinde gireceksiniz\" buyurulmuştur. Hadis metninde Allah'ın yardımından bahsedilirken Nebi Sallallahu Aleyhi ve Sellem kendisine yapılan yardımı kastetmektedir. Allah düşmanlarını hiç bir insanoğlunun katkısı olmaksızın hezimete uğratmaya muktedirdir. Düşman ifadesiyle kimlerin kastedildiğine dair farklı görüşler vardır. Bir görüşe göre bunlar hendek savaşında müslümanlara karşı birleşen Kureyşli kafirler ve onlara tabi olan Arap ve yahudi kabilelerdir. Bunlar hakkında Ahzab suresi nazil olmuştur. Bu konudaki rivayet savaş bölümünde ayrıntısıyla nakledilmiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 80
			}
		}
	]
}