{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6389,
			"arabicnumber": 6389,
			"text": "Enes İbn Malik'den rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem'in en fazla yaptığı dua şudur: Rabbena atina fi'd-dünya haseneten ve fi'l-Ahireti haseneten ve kina azabennar = \"Rabbimiz bize dünyada ve ahirette güzellikler ver ve bizi cehennem azabından koru\". Fethu'l-Bari Açıklaması: Kadi İyad bu hadisle ilgili şu açıklamaya yer verir: Nebi s.a.v.'in bu ayeti dua niyetiyle çokça okuması onun dünya ve ahiretle ilgili yapılacak duaların anlamlarını kapsaması sebebiyledir. Bu duada talep edilen iyilik nimet demektir. Nebi s.a.v. dünya ve ahiret nimetlerini ve cehennem azabından korunmayı niyaz etmiştir. Biz de Allah'tan aynı şeyi niyaz ediyoruz. Selef alimlerinin bu dua metninde geçen \"hasene\" kelimesiyle ilgili pek çok yorumu vardır. İbn Ebi Hatim'in sahih bir senetle naklettiğine göre Hasan el-Basri \"hasene\" kelimesini ilim ve dünyada yapılan ibadet diye yorumlamıştır. Muhammed İbn Ka'b el-Kurazi'ye göre ise salih zevce de hasene cinsindendir. Yezid İbn Malik'den de benzer bir yorum naklediimiştir. İbnü'l-Münzir'in naklettiğine göre Süfyan es-Sesvri dünyadaki haseneyi temiz rızık ve ilim; ahiretteki haseneyi ise cennet diye yorumlamıştır. Atiyye ise dünyada ilim ve onunla amel, ahirette ise hesabın kolaylaştırılıp cennete dahil edilmek anlamını vermiştir. İbn Kesir ise dünyadaki hasenenin sıhhat, geniş ev, saliha kadın, iyi çocuk, bol rızık, faydalı ilim, iyi amel, uysal binek ve hoş seda (öldükten sonra iyi anılış) gibi alimlerin hasene kabul ettikleri dünyada istenilen her türlü şeyi kapsadığını ifade etmiştir. Ona göre ahiretteki hasenenin en üstünü cennete girmektir. Ayrıca Arasat'taki büyük korkudan emin olmak ve hesabın kolaylaştırılması gibi uhrevi nimetler de bu cümledendir. Cehennem azabından korunmaya gelince burada kastedilen haramlardan kaçınıp şüpheli şeyleri terk etmek gibi azaptan koruyacak şeyler konusunda yapılan ilahi yardımdır",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 84
			}
		}
	]
}