{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6408,
			"arabicnumber": 6408,
			"text": "Ebû Hureyre (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) şöyle buyurdu: \"Allah'ın bir sınıf melekleri vardır ki, bunlar yollarda, sokaklarda dolaşırlar, zikir ehlini ararlar. Onlar (Azîz ve Celîl olan) Allah'ı anan bir cemâat bulunca birbirlerine: Aradığınıza geliniz, diye seslenirler. üzerine melekler zikir ehlini dünyâ semâsına kadar kanatlarıyle tavaf edip etrafını kuşatırlar. Rabb'leri onları pek iyi bildiği hâlde, meleklere: Kullarım ne söylüyorlar? diye sorar. Onlar da: (Subhânallah' diyerek) Sen 'i tesbîh ediyorlar, ('Allâhu Ekber’ diyerek) Sen 'i tekbîr ediyorlar, ('el-Hamdu lillâhi' diyerek) Sen’i hamd ve sena ediyorlar! suretinde cevâb verirler. Allah: Bu kullarım Beni görürler mi ki? diye sorar. Melekler: Hayır, vallahi onlar Sen'i görmezler! derler. Allah: O kullarım ya Beni görseler nasıl olurlar? buyurur. Melekler: Onlar Sen 'i görseler, Sana ibâdet ve ubudiyetleri daha şiddetli; temcîd ve tahmîdleri daha çetin; tesbihleri daha çok olur! derler. Allah: Benden ne diliyorlar? diye sorar. Melekler: Cennet istiyorlar! diye cevâb verirler. Allah: Onlar cenneti görmüşler mi? Hayır, vallahi onlar cenneti görmemişlerdir! Ya onlar cenneti görselerdi? Eğer görselerdi cennete karşı hevesleri daha çok, talebleri daha şiddetli, rağbetleri daha büyük olurdu. O kullarım neden istiâze ederler? Melekler: Cehennem ateşinden! Cehennemi gördüler mi? Hayır, vallahi onu görmediler. Ya görselerdi nasıl olurlardı? Ondan daha çok kaçınırlardı, korkuları daha çok olurdu. Bunun üzerine Yüce Allah, meleklere: Ey melekler, ben sizleri şâhid yapıyorum ki, ben bu zikreden kullarımı mağfiret ettim! buyurur. birisi: O zikredenlerin arasında fulan kişi var ki, o zikredenlerden değildir, bir haceti için gelmiş oturmuştu! der. Allah: O mecliste oturanlar öyle kemâl sahibi kimselerdir ki, onlarla birlikte oturanlar şakı olamaz! cevâbını verir.\" hadîsi Şu'be, el-A'meş'ten, Peygamber'e yükseltmeyerek rivayet etti. Keza bu hadîsi Süheyl, babası Ebû Salih es-Semmân'dan; o da Ebû Hureyre (radıyallahü anh)'den; o daPeygamber(sallallahü aleyhi ve sellem)'den olmak üzere rivayet etmiştir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 103
			}
		}
	]
}