{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"80": "Invocations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6410,
			"arabicnumber": 6410,
			"text": "Ebu Hureyre r.a.'den nakledildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah'ın 99 ismi vardır. Kim onları ezberlerse kesinlikle cennete girer. Biliniz ki Allah vitr'dir vitri sever\". Fethu'l-Bari Açıklaması: Bu hadis bazı alimler tarafından Kur'an'da zikredilmeyen bazı isimlerin isim sigası içerisinde Allah'a nispet edilmesinin mubahlığı için kullanılmıştır. Zira onun isimlerinin pek çoğu böyledir. Velid İbn Şuayb'dan sahih diye nitelenmeye layık bir isnatla nakledilen ve esma-ül hüsnayı şerh edenlerin temel dayanağı olan hadise gelince hadisin Tirmizı'deki rivayeti şöyledir: \"O Allah ki kendisinden başka ilah yoktur. O Rahman, Rahim, Melik, Kuddus, Selam, mu'min, Muheymin, Aziz, Cabbar, Mütekebbir, Halik, Bari, Musavvir, Ğaffar, Kahhar, Vehhab, Rezzak, Fettah, Alim, Kabid, Basit, Hafid, Rafi', Muiz, Muzil, Semi', Basir, Hakem, Adl, Latif, Habir, Halim, Azim, Ğafur, Şekur, Ali, Kebir, Hafiz, Mukit, Hasib, Celil, Kerim, Rakip, Mucib, Vasi', Hakim, Vedud, Mecid, Bais, Şehit, Hak, Vekil, Kavi, Metin, Veli, Hamid, Muhsi, Mubdi, Muid, Muhyi, Mumit, Hayy, Kayyum, Vacit, Macit, Vahid, Samed, Kadir, Muktedir, Mukaddem, Muahhar, Evvel, Ahir, Zahir, Batin, Vali, Muteali, Birr, Tevvab, Muntakim, Afuv, Rauf, Malikü'l-Mülk, Züll-Celal ve'l-İkram, Muksit, Cami, Ğani, Muğni, Mani', Darr, Nafi', Nur, Hadi, Bedi', Baki, Varis, Reşid, Sabur'dur\". Gazalı, Şerhü'l-Esma adlı eserinde şöyle der: Mağrip alimlerinden bir kişi dışında Allah'ın isimlerini araştırıp toplamaya çalışan hiç kimse bilmiyorum. O Mağripli alimin adı Ali İbn Hazm'dır. Şöyle demiştir: Kur'an'dan ve sahih haberlerden seksene yakın ismi tespit ettim. Geri kalan kısmı başka sahih haberlerde aranmalıdır. Gadılınin belirttiğine göre muhtemelen bu kişi Tirmizı'nin yukarıda naklettiğimiz hadisine ulaşamamış yada isnadını zayıf addetmiştir. Bana göre ikinci ihtimal daha doğrudur. Çünkü o el-Muhalla adlı eserinde buna benzer hadisleri zikretmiş ve esma-ül hüsnayı bir bütün halinde serdeden hadislerin zayıf oldukları kanısına varmıştır. Ayrıca Kur'an'dan çıkardığı isimlerin 68 tane olduğunu söylemiştir. İbn Hazım yalnızca Allah'a isim olarak nispet edilenleri toplamış Kur'an'daki fiillerden türetilen isimleri dikkate almamıştır. Örneğin \"Rabbinin yüzü kalıcıdır\" ayetinden türetilen Baki ismi onun buldukları arasında yer almamaktadır. Yine Kur'an'da muzaf olarak yer alan isimleri de esma-yı hüsna içerisinde saymamıştır. örneğin \"göklerin ve yerin yaratıcısıdır (bedı')\" ayetindeki Bedı' kelimesini Allah'ın isimleri arasına sokmamıştır. Onun kabul ettiği isimleri aşağıda açıklayacağım. Başka alimler de Tirmizı'nin naklettiği hadisi zayıf addetmişlerdir. Örneğin Davudi Nebi Sallallahu Aleyhi ve Sellem'in esma-ül hüsnayı tek tek saydığı konusunda sahih bir haberin olmadığını söylemiştir. Ebu'l-Hasan el-Kab isi ise şu değerlendirmeye yer verir: Allah'ın isimleri ve sıfatları tevkifidir. Yani ancak kitap sünnet ve icma ile bilinir. Bu konuda kı yas delil olamaz. Kur'an-ı Kerim'de Allah'ın isimleri konusunda belli bir sayı verilmemiştir. Sünnette ise 99 sayısı geçmektedir. Bazı alimler bu 99 ismi Kur'an-ı Kerim'den çıkarmaya çalışmışlardır. Ancak elbette Allah isimlerini en iyi bilendir. Zira bunların bir kısmı sarih isim değildir. Allah'ın isimlerinin sadece 99 tane mi yoksa bundan daha fazla olmakla birlikte 99 tanesini sayanın cennete mi gireceği konusunda ihtilaf edilmiştir. Alimlerin çoğunluğu ikinci görüştedir. Hatta Nevevı alimlerin bu konuda görüş birliği içinde olduklarını belirtir ve şöyle der: Bu hadiste Allah'ın isimlerinin sayısı sınırlandırılmış değildir. Burada Allah'ın 99 isimden başka bir ismi olmadığı söylenmek istenmemektedir. Bu hadis 99 tane ismi sayanın cennete gireceğini vurgulamak istemektedir. Yani amaç isimlerin sayısını vermek değil bunları sayanın cennete gireceğini müjdelemektir. İbn Mes'ud'dan naklediten şu hadis bu görüşü teyit etmektedir: \"Allahım! Kendini isimlendirdiğin veya Kur'an'da indirdiğin veya kullarından birine öğrettiği n veya kendi katında tuttuğun bütün isimlerinfe sana dua ediyorum\". Ayrıca İmam Malik'in Ka'bu'l-Ahbar'dan naklettiği \"Bildiğim bilmediğim bütün isimlerinfe sana dua ediyorum\" hadisi de aynı şeyi göstermektedir. Bu konuda Hattabı şöyle der: Bu hadis zikri geçen isimlerin Allah'a ait olduğunu ispat etmekle birlikte esmaül hüsnanın bundan daha fazla olmasını engellememektedir. Hadiste bunların zikredilmesi bunların çQkça kullanılması ve anlamlarının daha açık olması sebebiyledir. Allah'a nisbet edilen fiillerden isim türetilerek ona nispet edilemeyeceği anlamında esma-dı hüsnanın tevkifi olup olmadığı tartışmalıdır. Ancak kitap yada sünnet de bir nas varid olursa durum değişir. Razi Şamlere göre esma-ül hüsnanın tevkifi olduğunu belirtmiştir. Mutezile ve Kerramiye'ye gelince onlar aklın Allah'a nispetini onayladığı lafızlardan türeyen isimlerin de ona nispet edilebileceği düşüncesindediler. Kadı Ebu Bekr ve Gazali sıfatlardan ayrı olarak isimlerin tevkifi olduğunu ifade etmişlerdir. Tercihe şayan görüşün bu son görüş olduğu ayrıca vurgulanmıştır. Ebu'l-Kasım el-Kuşeyri ise şöyle der: Allah'ın isimleri kitap sünnet ve icma yoluyla bilinir. Bunlarda varit olan her ismin Allah'a nispeti vaciptir. Bu yollardan birinde yer almayan isimler manen doğru olsalar bile Allah'a nispet edilemezler. Zeccac'a gelince o Allah'ın kendisini nitelemediği hiçbir isim ile ona dua edilemeyeceği düşüncesindedir. Ona göre bu konuda kural şudur: Oinin kendisiyle dua edilmesine izin verdiği müştak ya da gayri müştak her kelime bir ismidir. Allah'a nispet edilmesi caiz olan her şey ister tevil edilsin ister edilmesin onun sıfatıdır. Bunlara isim de denilir. Hadiste isimlerin ezberlenmesinden bahsedilmekle birlikte hadisin başka varyantlarında bunların sayılmasından söz edilmektedir. Hattabi burada zikri geçen saymanın pek çok yoruma müsait olduğunu beyan etmiştir. Mesela burada söz konusu isimlerin tamamının sayılarak Allah'a dua edilmesinin ve bunların hepsiyle Allah'ın övülmesinin kastedildiği ancak böylesi bir duanın arzulanan sevabı celp edeceği kastedildiği söylenmiştir. Bir başka yorum ise şöyledir: İsimlerin sayılmasından maksat bu isimlerin ifade ettiği anlamın gereğini yerine getirmek ve bunların hakkını verebilmektir. \"O sizin bunu başaramayacağınızı bildirrayeti ile \"İstikamet üzere olun! Ama bunu asla başaramazsınız\" hadisinde geçen ihsa kökünden kelimeler de aynı anlamı ifade etmektedir. Yani isimlerin lafızları değil anlamları nazarı itibara alınmalı ve buna göre davranılmalıdır. Örneğin Rezzak denildiği zaman kişi rızık endişesi taşımaması gerektiğini bilmelidir. İsimlerin sayılmasından murad onların anlamlarının bilinmesidir de denilmiştir. Örneğin Araplar \"zü hasat\" dediklerinde \"zü akl\" anlamını kastederler. Kurtubi bu zikri geçen yollardan herhangi birisiyle samimi bir şekilde bu isimleri sayanın cennete gireceğinin umulacağını ifade eder. Ancak bilinmelidir ki bu mertebeler İslam'da öncelik hakkını kazanmış olanlar, sıddıklar ve ahiret de kitaplarını sağ elinden alacaklar için geçerlidir. İbn Atiyye'nin yorumu ise şöyledir: Allah'ın isimlerini saymak onlara iman edip onları ta'zim etmek ve bunlara rağbet gösterip manalarını nazarı itabara almak demektir. Asili ise \"İsimleri saymak yalnızca onları telaffuz etmek değildir. Zira bir günahkarın da bunları dili ile sayması mümkündür. Burada maksat bunlarla amel etmektir\" der. Ebu Nuaym el-İsbahani'ye gelince ona göre hadiste geçen \"sayma\" fiillinden maksat yalnızca dil ile saymak değil, bunlarla amel edip manalarını anlamaya çalışmak ve onlara iman etmektir. Ebu'l-Abbas İbn Ma'd ise burada saymanın iki anlama gelmesinin muhtemelolduğunu; bunlardan birine göre isimlerin kitap ve sünnetten tespit edilmeye çalışılması, ikincisinin ise sıralanmış isimlerin ezberlenmesi olduğunu söylemiştir. Bu isimlerin pek çoğunun şerhi tevhit bölümünde gelecektir",
			"grades": [],
			"reference": {
				"book": 80,
				"hadith": 105
			}
		}
	]
}