{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6440,
			"arabicnumber": 6440,
			"text": "Enes'in nakline göre Ubey İbn Ka'b şöyle demiştir: \"Elhakumu't-tekasuru\" suresi ininceye kadar \"Adem oğlunun altından bir vadisi olsa ... \" cümlesini Kur'an'dan bir ayet zannediyorduk. Fethu'l-Bari Açıklaması: \"Min fitneti'l-mal= mal fitnesinden\" yani mal ile oynayıp, oyalanmaktan demektir. Allahu Teala'ın \"innema emvaluküm ve evladuküm fitne = doğrusu mallarınız ve çocuklarınız sizin için bir fitnedir\"(Teğabun 15) sözü. Burada geçen \"fitne\" kelimesinden maksat, insanın aklını itaati yerine getirmekten alıkoyan şey demektir. Çocuk fitnesine gelince bu konuda Ahmed İbn Hanbel, sünen imamları, sahihtir değerlendirmesiyle İbn Huzeyme ve İbn Hibban'ın, Büreyde'den nakletlikleri şöyle bir hadis vardır: Hz. Nebi hutbe okuyordu. Derken iki torunu Hasan ile Hüseyin üzerlerinde kırmızı bir gömlekle düşe kalka içeri girdiler. Nebi minberden aşağı indi ve onları kucağına alarak önüne koydu. Sonra \"Allah ve Rasulü doğru söylemiştir. Doğrusu mallarınız ve çocuklarınız sizin için bir fitnedir\" buyurdu.(-Ebu Davud, salat; Tirmizi, Menakıb; Nesai Cuma; İbn Mace, Libas; Ahmed İbn Hanbel, V, 354-) Bu hadisin zahirinden hutbeyi kesip çocuklar için aşağı inmenin fitne olduğu anlaşılmaktadır ve Nebi'i buna sevkeden çocuk sevgisidir. Dolayısıyla minberden aşağı inmek, yapılması tercih edilmeyen seçenek olmaktadır. Bu görüşe şöyle cevap verilmiştir: Bu söylenilen, Nebi'den başkası hakkında geçerlidir. Nebi'in uygulaması ise sözkonusu fiilin caizliğini göstermek için yapılmış bir davranıştır. Dolayısıyla Nebi açısından o hareket tercih edilen bir davranış olur. Bir şeyin caiz olduğunu beyan etmek için yapılan fiilden evla olanın onu yapmamak olduğu sonucu çıkmaz. Hadis çocuk fitnesinin de derece derece olduğuna dikkat çekmekte ve bunun o derecelerin en düşüğü olduğunu vurgulamaktadır. Ancak söz konusu fitne, insanı daha ağır bir dereceye sürükleyebilir. Dolayısıyla bundan kaçınmak gerekir. Hadiste geçen \"taise\" sözlükte düştü anlamındadır. Burada kelimeden maksat, \"helak olsun\" anlamıdır. İbnü'l-Enbarı şöyle demiştir: Arapçada \"et-tais\" kötülük anlamınadır. Allahu Teala \"fe ta'sen lehum = inkar edenlere gelince, onların hakkı yıkımdır\"(Muhammed 7) demektedir ki kötülüğün yakalarına yapıştığı anlamını kastetmektedir. \"Abduddinar\" malı toplamaya hırsla talip olan ve onu muhafaza eden demektir. Kişi böylece adeta o malın hizmetkan, kulu ve kölesi olmaktadır. Tıybı'nin ifadesine göre bu hadis şöyle açıklanmıştır: Paraya düşkün olana \"abd = köle\" denilmesi, o kişinin dünya sevgisi ve şehvetleri karşısında bundan kurtuluş çaresi bulamayan esir gibi olduğuna işaret etmek içindir. Hz. Nebi, hadiste \"dinar sahibi\" veya \"dinar biriktiren\" dememiştir. Zira mülkiyetin ve para biriktirmenin kınanmış olanı, ihtiyaçtan fazla olan kısımdır. Aynı hadiste \"ona verilirse\" denilmesi kişinin paraya, pula aşırı hırsının derecesine işaret edilmeye matuftur. Bir başkası şöyle demiştir: Hz. Nebi'in mal hırsı içinde olan kimseyi dinar ve dirhemin kölesi şeklinde nitelemesi, kişinin buna olan aşırı sevgisi ve hırsı dolayısıyladır. Heva ve hevesine köle olan kimsenin ağzından Çıkan \"iyyake na 'budu = ancak sana kulluk ederiz\" cümlesi onun açısından doğru olamaz. Netice olarak bu vasıftaki bir kimse doğru sözlü bir kişi olamaz. \"el-Kat1fe= Kadife\" tüylü yüzlü kumaş demektir. \"el-Hamısa\" ise dört kenarlı kumaş demektir. Bu hadis, Cihad Bölümünde geçmişti. \"İntekese\" hastalık nüksetti anlamına gelir. Buna göre \"ta 's\" kelimesinin düşme anlamına geldiği şeklindeki daha önce yapılan açıklamaya göre \"intekese\" düşüp ayağa kalktıktan sonra tekrar düşer demektir. \"Ta'ise\" kelimesinden sonra \"intekese\"nin manasının düştükten sonra baş aşağı döndü anlamına gelme ihtimali de vardır. \"Ve iza şıke\" yani bir yerine diken battığında onu alet yardımıyla çıkaracak kimseyi bulamaz demektir. \"İntakaşe\" kelimesinin manası budur. Bu fiilin manasının doktor bunu çıkaramaz şeklinde olması da muhtemeldir. Hadiste kişiyi çalışma ve hareketten alıkoyacak şeyle beddua edildiğine işaret vardır. Sözkonusu şahsa bedduayı caiz hale getiren, onun bütün çabasını dünyalık biriktirmeye ve bununla meşgulolarak kendisine emredilen vacib ve mendublarla meşgulolmayı ihmal etmeye yönelmesidir. Tıybı şöyle demiştir: Hadiste \"intikaşu'ş-şevke == diken batması\" deyiminin kullanılması, tasavvur edilen yardımlaşmanın en kolay şekli olmasındandır. Bu en kolay şey imkansız olduğuna göre onun üzerindeki evleviyetle imkansız olur. İbn Abbas'ın ikinci rivayet yoluyla naklettiği \"Allah tövbe eden kimsenin tövbesini kabul eder\" cümlesi, Allahu Teala dünya malına hırsla sarılan kimsenin tövbesini başkasından kabul ettiği gibi kabul eder demektir. Bazılarına göre bu hadis, dünya malını toplamakta ileri giden ve bunu temenni edip, hırsla isteyen kimsenin kınanacağına işaret edilmektedir. Böylece sözkonusu davranışı bırakan kimseye \"tövbe etti\" demenin mümkün olduğuna işaret edilmektedir. \"Tabe == tövbe etti\" fiilinin lügat manasına olma ihtimali de vardır. Sözlükte \"tabe\" mutlak olarak rücu etti, döndü anlamına gelir ki bu sözkonusu fiil ve temenniden rücu edip döndü anlamındadır. Tıybı şöyle demiştir: Hadisin manasının Adem oğlu dünya malı sevgisiyle yaratılmıştır. Allahu Teala'ın koruduğu ve bu karakteri nefsinden silmek için başarılı kıldığı kimseler hariç insan mal biriktirmeye doymaz. Allah'ın koruduğu ve muvaffak kıldığı bu tip insanlar da azdır. \"Abdurrahman İbn Süleyman el-Gasıl\" Abdurrahman'ın künyesindeki \"e1Gasll\" meleklerin yıkadığı anlamınadır. Bu, Hanzala İbn Ebi Amir el-Evsı'dir. İbn Battal ve başkaları şöyle demişlerdir: Allahu Teala'ın \"Çokluk kuruntusu sizi oyaladı\"(Tekasür 11) sözü hitap sözcüğüyle gelmektedir. Zira Allahu Teala insanları mal ve çocuk sevgisi üzerine yaratmıştır. Onların mal ve çocuğu çoğaltma istekleri vardır. Bu isteğin ayrılmaz parçası ise kendilerine emredilen şeylerden gafil olmaktır ki bu gafletin sonucunda ölüm aniden insanın önüne çıkar. Burada zikredilen hadisler, hırs ve açgözlülüğü kınamaktadır. Buradan hareketle selef bilginlerinin çoğunluğu az bir dünya malı edinmeyi, az malla kanaat etmeyi ve geçinecek miktara razı olmayı tercih etmişlerdir. Sahabenin \"Adem oğlunun bir vadi dolusu altın! olsa iki vadi dolusu olmasın! ister\" sözünü Kur'an'dan zannetmeleri, o hadisin çok mal biriktirme hırsınt kınaması, bu hırsı kesen ve herkesin başına gelecek ölümle onları azarlaması yüzündendir. Bu sure inince ve sözkonusu manayı fazlasıyla ifade edince sahabe birinci sözün Hz. Nebi'in ifadesi olduğunu anladı",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 29
			}
		}
	]
}