{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6441,
			"arabicnumber": 6441,
			"text": "Hakim İbn Hizam şöyle anlatmıştır: Ben Nebi Sallallahu Aleyhi ve Sellem'den istedim, o da bana verdi. Sonra yine istedim, o da bana verdi. Sonra yine istedim, yine verdi. Bundan sonra \"Bu mal\" buyurdu. Belki de ravi Süfyan, Hakim şöyle dedi demiştir: Nebi Sallallahu Aleyhi ve Sellem bana \"Ya Hakimi Şüphesiz bu mal caziptir, tatlıdır. Her kim bu malı nefis güzelliğiyle, hırs olmaksızın alırsa o mal kendisi için bereketli kılınır. Kim de bunu nefis düşkünlüğü ile alırsa mal alan için bereketli kılınmaz. O ihtiraslı kişi yiyip yiyip de hiç doymayan kimse gibi olur. Yukarıdaki el (veren) aşağıdaki elden (alan) hayırlıdırı\" buyurdu. Fethu'l-Bari Açıklaması: \"Zuyyine = çekici kılındı, süslendi\" fiili hakkında şu açıklama yapılmıştır: Bunu yapan failin gerçekte Allahu Teala olduğu bilindiği halde süsleyen ve çekici kılanın açıklanmamasındaki hikmet, o sözcüğün süsleme fiilinin nispet edilmesinin mümkün olduğu akla gelebilecek herkesi kapsamasını sağlamaktır. Asıl fail Allahu Teala'tır. Çünkü dünyayı ve içindekileri yoktan var eden, yararlanmaya hazır kılan ve kalpleri bunlara meyilli olarak yaratan Allah 'tır. Çekici kılma kavramına nefsin telkini ve şeytan ın vesvesesi de girsin diye \"et-tezyin\" kelimesi ile buna işaret edilmiştir. Çekici kılmanın Allahu Teala'a nispet edilmesi yaratma, takdir ve hazırlama itibariyledir. Aynı fiilin şeytana nispet edilmesiise Allahu Teala'ın ona nefsinin telkininin kendisinden kaynaklandığı vesvesi ile Adem oğluna musallat olma gücü vermesi itibariyledir. İbnü't-Tıyn şu açıklamayı yapmıştır: Ayet-i kerimede \"nefsani arzular\"a kadınlarla başlanması, erkekleri baştan çıkaran şeylerin en güçlüsünün onlar olmasındandır. \"Benden sonra erkeklere kadınlardan daha zararlı bir fitne bırakmadım\" hadisi de bu doğrultudadır. İbnü't-Tıyn şöyle der: Kadınların süslü gösterilmesi, erkeklerin onları beğenmesi ve kendilerine itaat etmeleri demektir. \"Hz. Ömer 'Allah'ım! Biz ancak senin bizler için süslediğin şeylerle ferahlanmaya muktedir oluruz. Allah'ım! Ben senden malı haklı yerinde harcamama muvaffak kılmanı dilerim' demiştir.\" Bu haber, ayet-i kerimede sözü edilen \"tezyinırin gerçek failinin Allah olduğuna ve bunların süslü gösterilmesinden maksadın Adem oğlunun kalplerine güzel gösterilmesi ve insanların bu karakterde yaratılmış olmasına işaret etmektedir. Ancak insanlardan yaratıldığı bu karakter üzere devam edip, bu şehvetlere dalan kimseler kınanmışlardır. Bunların içerisinde bu konudaki emir ve yasağa riayet eden, kendisine çizilen sınırı aşmayıp o noktada kalan kimseler vardır. Bu, Allah'ın ona nasip ettiği başarı sayesinde nefsi mücahede ile olmuştur. Kınama bu gibi kimseleri kapsamaz. İnsanların arasında bu seviyeden daha yukarıya yükselip, sözkonusu şehevi şeyleri elde etme imkanı bulmuşken ona eğilim duyduğu ve eline geçirebildiği halde bundan yüz çevirip, zühd içinde olanlar vardır ki işte bu da övülmüş bir makamdır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 30
			}
		}
	]
}