{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6442,
			"arabicnumber": 6442,
			"text": "Abdullah İbn Mes'ud'un nakline göre Nebi Sallallahu Aleyhi ve Sellem: \"Hanginize mirasçısının malı, kendi malından daha çok sevimlidir?\" diye sordu. Sahabiler \"Ya Resulallah! Bizden her bir kişiye muhakkak kendi malı daha sevimlidir!\" dediler. Resulullah Sallallahu Aleyhi ve Sellem: \"Çünkü kişinin kendi malı, (ölümünden önce hayır yolunda harcayıp) önden gönderdiği maldır. Mirasçının malı da (kişinin hayra sarfetmeyip, ölünceye kadar) geri bıraktığı maldır\" buyurdu. Fethu'l-Bari Açıklaması: \"İnsanın kendi malından (hayır yollarırıa harcayıp) önden gönderdikleri, kendisinindir sözü.\" Yani insanın şu anda kendisine nispet edilse bile geri bırakmış olduğu mal, varisinin malıdır. Çünkü bu mal, varisine intikal etmesi açısından varise nispet edilir. Onun hayatında malikine nispet edilmesi hakiki, miras bırakanın hayatında varisine nispet edilmesi mecazi iken, ölümünden sonra hakiki bir isimlendirmedir. \"Çünkü onun malı önden gönderdiği maldır.\" Yani mirasçısına bıraktığı malın aksine hayatında ve öldükten sonra kişiye nispet edilen malıdır. İbn Battal ve başkası şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in bu sözü, kişinin ahirette yararlanması için malını Allah'a yakınlaşmaya sebep olan yerlere ve çeşitli iyiliklere önden göndermesi mümkün olanları göndermeye teşvik etmektedir. Çünkü kişinin geriye bıraktığı her şey, varisinin mülkü haline gelir. Varisi onun bıraktığı malı Allah'a itaatte kullanacak olursa özelolarak sevabını alır. O malı biriktirme ve kimseye vermeme noktasında çileyi çeken de bırakan kişidir. Varis sözkonusu malı Allah'a isyan yolunda harcayacak olursa bu mal -sorumluluğundan kurtulsa bile- yararlanma açısından- ilk malikinden çok uzakta olur. Sözkonusu anlayış, Hz. Nebi'in Sa'dıa \"Varislerini ihtiyaç içinde bırakmaman başkalarına muhtaç bırakmandan daha hayırlıdır\" sözü ile çelişmez. Çünkü Sa'd hadisi malının tamamını veya büyük bir kısmını hastalığı esnasında tasadduk eden kimseyle ilgilidir. İbn Mesud'un naklettiği yukarıdaki hadis ise sağlığında ve mala düşkün olduğu bir anda onu tasadduk eden kişi ile ilgilidir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 31
			}
		}
	]
}