{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6443,
			"arabicnumber": 6443,
			"text": "Ebu Zer' r.a. şöyle anlatmıştır: Gecelerden birinde dışarı çıktım. Baktım ki Resulullah Sallallahu Aleyhi ve Sellem de yanında hiçbir insan olmadığı halde tek başına yürüyor. Ebu Zer' dedi ki: Onun beraberinde hiçbir kimsenin yürümesini istemediğini zannettim. Ebu Zer' şöyle devam etti: Ayın gölgesinde yürümeye başladım. Resulullah Sallallahu Aleyhi ve Sellem dönüp beni gördü ve: \"Kimdir o?\" diye sordu. \"Ebu Zer' dir, Allah beni sana feda eylesinl\" dedim. Resulullah Sallallahu Aleyhi ve Sellem \"Ya Eba Zer'! Gel!\" diye çağırdı. Ebu Zer' dedi ki: Ben de onun beraberinde bir müddet yürüdüm. Resulullah Sallallahu Aleyhi ve Sellem: \"Malı devamlı çoğaltanlar kıyamet gününde sevabı azaltanlardır, ancak Allah'ın kendisine bir hayır (yani mal) verdiği, onun da bu malı sağına, soluna, önüne, arkasına veren ve bu malda hayır yapan kimse böyle değildir.\" Ebu Zer' şöyle devam etti: Sonra Resulullah Sallallahu Aleyhi ve Sellem beni etrafı taşlık bir meydanda oturttu ve \"Ben sana dönünceye kadar burada otur!\" buyurdu. Ebu Zer' şöyle devam etti: Sonra kara taşlık arazi içinde ben kendisini görmez oluncaya kadar gitti ve bana dönmesi epey zaman aldı ve bayağı gecikti. Sonra ben onun gelmekte olduğunu işittim. Gelirken: \"Hırsızlık yapsa ve zina etse de mi?\" sözlerini söylüyordu. Ebu Zer' şöyle devam etti: Resulullah Sallallahu Aleyhi ve Sellem gelince sabredemeyip: \"Ey Allah'ın Nebi'i Allah beni sana feda etsin! Sen taşlık yerin kenarında birisiyle konuşuyordun, fakat ben sana cevap veren bir kimse işitmedim\" dedim. \"Bu, Cibril A.S.'dır. Harre'nin yanında bana geldi de 'Ümmetini müjdele! Her kim Allah'a hiçbir şeyi ortak kılmayarak ölürse cennete girer!' dedi. Ben 'Ya Cibril' O kimse hzrsızlık yapsa ve zina etse de mi?' dedim. 'Evet' dedi. Ben yine 'Hırsızlık yapsa ve zina etse de mi?' dedim. O da 'Evet, şarap içmiş olsa da' dedi.\" Fethu'l-Bari Açıklaması: \"(Mallarını Allah yolunda harcamayıp) çoğaltanlar, (sevapıarını) azaltanlardır. \" Hadisteki \"azlık\"tan maksat, sevabın azlığıdır. Sevabı az olan her şey, sevabı çok olana nispetle kayıptır, zarardır. \"Kim (yalnız) dünya hayatını ve zinetini istemekte ise işlerinin karşılzğını orada onlara tam olarak veririz ve orada onlar hiçbir zarara uğratılmazlar.\" Bu ayetin ne manaya geldiği hakkında ihtilaf edilmiştir. Bazılarına göre ayet kafirlerle amelinde riyakarlık yapan Müslümanlar hakkında genelliği üzeredir. Muaviye bu ayeti Ebu Hureyre'nin mücahid, Kur'an okuyan (kari) veya tasadduk eden kimse hakkındaki merfu hadisinin sıhhatine delil olarak göstermiştir. Allahu Teala bu üç kişinin her birine 'Sana şöyle şöyle denilsin diye amel ettin' diyecektir. Muaviye duyduğu bu hadisten dolayı ağlamış sonra yukarıdaki ayeti okumuştur. Bu hadisi Tirmizı uzun şekliyle rivayet etmiştir. Hadisin aslı Müslim'dedir. Bazılarına göre ayet özellikle kafirler hakkındadır. Çünkü bu ayeti izleyen ayette \"İşte onlar ahirette kendileri için ateşten başka hiçbir şeyolmayan kimselerdir\"(Hud 16) şeklinde bir hasr vardır. Genelolarak mu'minin akıbeti ya şefaatle veya mutlak afla birlikte cennete gitmektir. Ayette cehenneme atılma ve amelin boşa gitmesi ve batıl olması şeklindeki tehdit ancak kafir için sözkonusudur. Bu anlayışa şöyle cevap ver imiştir: Sözkonusu tehdit sadece içinde riya olan amelle ilgilidir. Dolayısıyla o ameli işleyen kimseye Allah'ın affı olmadığı takdirde karşılığı verilecektir. Yoksa kastedilen, o kimsenin içinde riya olmayan bütün salih amellerinin boşa gideceğini vurgulamak değildir. Kısacası ameliyle dünyadan bir bedel almayı hedefleyen kimseye bu peşinen verilir. Ancak o kimse, niyetini yalnız dünyaya yönelttiği ve ahiretten yüz çevirdiği için azapla karşılık görür. \"İşlerinin karşılığını orada\" dünyada \"onlara tam olarak veririz\" ifadesinin genelliği Allahu Teala'ın bunu kendisine takdir etmediği kimseye mahsustur. Çünkü Allah bir başka ayet-i kerimede şöyle demektedir: \"Her kim bu çarçabuk geçen dünyay dilerse ona, yani dilediğimiz kimseye dilediğimiz kadarını dünyada hemen veririz. ''(İsra 18) Netice olarak mutlak olan ifade bu kayıt doğrultusunda yorumlanır. Aynı şekilde Allahu Teala'ın \"Kim ahiret kazancını istiyorsa onun kazancInı amınnz. Kim de dünya karını istiyorsa ona da dünyadan bir şeyler veririz. Fakat onun ahirette bir nasibi olmaz\"(Şura 20) ayetindeki mutlaklık da aynı şekilde yorumlanır. Bu açıklamayla şu görüşün ortaya attığı problem kendiliğinden ortadan kalkar. Bazı kafirler dünyada fakir, mal veya sağlık ya da uzun ömür açısından istedikleri durumda değillerdir. Dahası bütün bunlardan nasibi tepetaklak olmuş kimseler bulunabilir. Bunlar tıpkı haklarında \"O dünyasını da, ahiretini de kaybetmiştir. İşte bu apaçık ziyanın ta kendisidir\"(Hac 11) denilen kimselere benzerler. Yukarıdaki ayetin orada zikredilen hadisle olan ilişkisine gelince; hadis içinde yer alan tehdidin Müslümanlardan haklarında bu tehdidin geçerli olduğu kimseler bakımından ebediyyen değil, belli bir süreliğine şeklinde yorumlandığına işaret etmektedir. Çünkü hadis Müslümanlardan büyük günah türünden herhangi birini işleyen kimsenin cennete gireceğini göstermektedir. Bu ifadede o kimsenin cennete girmeden önce azap görmeyeceğine dair herhangi bir kayıt yoktur. Aynı şekilde ayette de riyakarlık günahının azabını gördükten sonra cennete girmeyeceğine dair herhangi bir kayıtlama yoktur",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 32
			}
		}
	]
}