{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6444,
			"arabicnumber": 6444,
			"text": "Ebu Zer' şöyle anlatmıştır: Ben (bir keresinde) Medine'nin Harre mevkiinde Nebi Sallallahu Aleyhi ve Sellem'in beraberinde yürüyordum. Uhud dağı karşımıza çıkınca Nebi Sallallahu Aleyhi ve Sellem: ''Ya Eba Zerr!\" diye seslendi. Ben \"Lebbeyk ya Resulallah Sallallahu Aleyhi ve Sellem (buyur!)\" dedim. Resulullah Sallallahu Aleyhi ve Sellem şöyle dedi: \"Yanında şu Uhud dağı kadar altın olup da ondan benim yanımda bir dinar altın bulunduğu halde üzerimden üç gün geçmesi beni sevindirmez. Ancak borç için hazırlamakta olduğum miktar altın müstesnadır. Beni sevindiren ancak o kadar çok altını Allah'ın kulları uğrunda şöyle şöyle ve şöyle verip dağıtmamdır!\" Nebi s.a.v. bundan sonra sağına soluna ve arkasına eliyle verme işaretleri yaptı. Sonra yürüdü ve \"Malları çok olanlar kıyamet gününde sevapıarı az olanlardır, ancak sağına, soluna, arkasına şöyle şöyle ve şöyle verip hayır yollarına harcayanlar müstesnadır. Bu cömert insanlar da ne kadar a?dırlar!\" dedi. Sonra bana \"Ben sana gelinceye kadar yerinden ayrılma!\" buyurdu. Sonra gecenin karanlığı içinde görünmez oluncaya kadar gitti. Bu sırada ben yüksekçe bir ses işittim ve birisinin karşısına çıkmış olabileceğinden korktum ve hemen onun yanına gitmek istedim, fakat \"Ben sana gelinceye kadar yerinden ayrılma!\" diye bana verdiği tenbihi hatırladım ve yerimden ayrılmadım. Nihayet yanıma geldi. Ona \"Ya Resulallah! Bir ses işittim ve korktum\" dedim. Resulullah \"O sesi sen de işitti n mi\" buyurdu. Ben de \"Evet işittim\" dedim. Resulullah \"O, Cebrai! idi, bana geldi ve 'Ümmetinden AIlah'a hiçbir şeyi ortak kılmayarak ölen kimse cennete girer' dedi. Ben 'O kimse zina etse ve hırsızlık yapsa da mı?' diye sordum. Cebrail 'Zina etse ve hırsızlık yapsa dal' diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 33
			}
		}
	]
}