{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6452,
			"arabicnumber": 6452,
			"text": "Ebû Nuaym Fadl ibn Dukeyn, bu hadîsin yarısından bir kısmını tahdîs etti. Bize Omer ibnu Zerr tahdîs etti. Bize Mucâhid ibn Cebr tahdîs etti ki, Ebû Hureyre(radıyallahü anh) şöyle der idi: Kendisinden başka ilâh olmayan Allah'a yemîn ederim ki, muhakkak ben (bazen) açlıktan karnımı yere dayardım, bazen de açlıktan karnıma taş bağlardım. Bir gün ben (Rasûlüllah ile sahâbîlerinin mescidden) çıkıp gittikleri yol uğrağı üzerine(aç ve mecalsiz) oturdum. Bu sırada Ebû Bekr geçti. Ona Allah'ın Kitâbı'ndan bir âyet sordum.Bu soruşum ancak (beni doyurmak üzere) kendisini ta'kîb etmemi istemesi içindi. Fakat geçti gitti; ümîd ettiğim çağırmayı yapmadı. Sonra Omer uğradı. Ona da Allah'ın Kitâbı'ndan bir âyet sordum. (Maksadım âyeti öğrenmek değildi, çünkü âyeti ben iyi biliyordum.) Yine Omer'in (beni doyurmak üzere) benim kendisini ta'kîb etmemi istemesi içindi. Omer de geçti gitti, benim ümîd ettiğim çağırmayı yapmadı. Sonra bana Ebû'l-Kaasım (sallallahü aleyhi ve sellem) uğradı ve beni gördüğü zaman, bendeki hâlsizliği ve yüzümdeki açlık alâmetini anladı da gülümsedi. Sonra bana: \"Yâ Ebâ Hırr!\" dedi. Ben de: Lebbeyke yâ Rasûlallah ( = Buyur, emrine hazırım yâ Rasûlallah)! dedim. \"Ardımsıra gel!\" buyurdu, yürüdü. de O'nu ta'kîb ettim. Eve girdi. Ben de izin istedim. Bana da izin verildi. Rasûlüllah girdiğinde bir bardak içinde süt buldu. \"Bu süt nereden geldi?\" diye sordu. Onu Sana fulân kimse yahut fulân kadın hediye etti dediler. Rasûlüllah da bana: \"Yâ Ebâ Hırr!\" diye seslendi. Ben de: Buyur yâ Rasûlallah, emrine hazırım! dedim. \"Haydi Suffa ehline git de onları bana çağır!\" buyurdu. Hureyre dedi ki: Suffa ehli, İslâm konuklan idiler. Sığınacak aileleri, malları ve dayanacak bir kimseleri yoktu.Rasûlüllah bir sadaka geldiğinde, sadaka malını onlara gönderirdi. Kendisi sadaka malından birşey almazdı. Bir hediye geldiğinde de bunu Suffa ehline gönderirdi. Hediyeden kendisi de alır ve Suffa ehlini onda ortak yapardı. Hureyre dedi ki: Suffa ehlini (süt ziyafetine) çağırmak bana fena geldi. (Kendi kendime) dedim ki: \"Suffa halkı içinde şu bir bardak süt nedir ki! Lâyık olan, şu sütten bana bir yudum isabet etmeli idi de kuvvet kazanmalı idim. Da'vet edilmelerine me'mûr olduğum Suffa halkı şimdi gelip onlara dağıttığında, bu bir bardak sütten bana ne düşecek?\" diye endişeleniyordum. Allah'a ve Rasûlü'ne itaatten başka çâre yoktu. Bu sebeble gittim, Suffa halkını da'vet ettim. Geldiler, izin istediler, izin verilmesi üzerine evin içinde baştan başa yerlerini aldılar. Bunun üzerine Rasûlüllah bana: \"Yâ Ebâ Hırr!\" diye seslendi. Ben de: Buyur yâ Rasûlallah! Emrine hazırım! dedim. Rasûlüllah: \"Şu süt bardağını al, konuklara ver!\" buyurdu. de bardağı alıp vermeğe başladım. Bir kişiye veriyordum, o kanıncaya kadar içiyordu, sonra bardağı bana veriyordu. Ben de bardağı alıp diğer bir kişiye veriyordum. O da kanıncaya kadar içiyor, sonra bardağı bana veriyordu. Bu suretle bütün halk kana kana içip bardağı bana vererek tâ Rasûlüllah'a kadar gelip dağıtım işi sona erdi. Artık da'vetlilerin hepsi süte kanmışlardı. süt bardağını Rasûlüllah aldı, elinde tutarak bana bakıp gülümsedi ve: \"Yâ Ebâ Hırrl\" buyurdu. Ben de: Emret yâ Rasûlallah, emrine hazırım! dedim. Rasûlüllah: \"Süt içmedik bir ben, bir de sen kaldın!\" buyurdu. Ben de: Doğru buyurdun yâ Rasûlallah! dedim.Rasûlüllah bana: \"Haydi otur da iç!\" buyurdu. Ben de oturup içtim. Rasûlüllah tekrar: \"İç!\" buyurdu. Ben de içtim. Rasûlüllah tekrar: \"İç!\" diye emrediyordu (Ben de içiyordum). En sonu: Yâ Rasûlallah! İçemiyeceğim! Seni hakk ile gönderen Allah'a yemîn ederim ki, süt gidecek bir yol bulamam! dedim. \"Öyle ise bardağı bana ver!\" buyurdu. Ben de verdim. Rasûlüllah da Allah'a hamd etti ve Besmele çekip geri kalan sütü içti",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 41
			}
		}
	]
}