{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6469,
			"arabicnumber": 6469,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah rahmeti yarattığı gün onu yüz rahmet olarak yarattı ve doksan dokuz rahmeti kendi yanında tutup alıkoydu, geri kalan tek bir rahmeti de bütün mahlukları arasında salıverdi. Eğer kafir, Allah'ın yanında bulunan rahmetin hepsini bilir olsaydı, cennetten ümidini kesmezdi. Eğer mu'min de Allah yanındaki azabın hepsini bilir olsaydı, cehennem azabından emin olmazdı!\" Fethu'l-Bari Açıklaması: \"Korkuyla birlikte ümitli olmak.\" Yani bunun müstehab olduğu. Ümit durumunda korku, korku durumunda ümit göz ardı edilemez. Bunun sebebi birincinin aldanmaya, ikincinin Allah'ın rahmetinden ümit kesmeye yol açmasıdır. Bunların her ikisi de kınanmıştır. \"er-Reca.\" kelimesinden maksat şudur: Herhangi bir ihmalde bulunan kimse Allah'a karşı güzel zan beslemeli ve onun, günahını sileceğini ummalıdır. Aynı şekilde herhangi bir itaatte bulunan kimse onun kabul edeceğini ummalıdır. Herhangi bir masiyeti işlediğine pişmanlık duymaksızın ve ondan vazgeçmeksizin hesaba çekilmeyeceği ümidi ile bu günaha dalan kimse, aldanış içindedir. Osman el-Ciz! ne güzel söylemiştir: İtaat etmen ve kabul edilmeyeceğinden korkman saadetin alametlerindendir. İsyan etmen ve bundan kurtulacağını umman ise bedbahtlığın işaretlerindendir. İbn Mace'nin Abdurrahman İbn Said İbn Vehb vasıtasıyla babasından nakline göre Hz. Aişe şöyle anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem'e \"Ve Rablerine dönecekleri için yapmakta oldukları işleri kalpleri çarparak yapanlar\"(Mu'minun 60) ayetinde kastedilen, hırsızlık yapıp, zina eden midir diye sordum. Resulullah Sallallahu Aleyhi ve Sellem \"Hayır fakat o oruç tutan, tasadduk eden, namaz kılan ve bunların kendisinden kabul edilmeyeceği korkusunu taşıyandır\" dedi (İbn Mace, Zühd) Bütün bunların kişinin sağlık durumunda müstehab olduğu bilginlerce kabul edilen husustur. Bazıları şöyle demişlerdir: En uygun olanı sağlıklı iken korkunun, hastalık halinde umudun daha çok olmasıdır. Kişi ölmeye yaklaştığında bazı bilginler Allah'a ihtiyaç duyma içerdiği için sadece umutla yetinmek müstehabtır demişlerdir. Çünkü korkuyu terk etmekten kaynaklanan sakınca artık imkansız hale gelmiş olabilir. Netice olarak affını ve mağfiretini umarak Allah'a güzel zan beslemek tek çıkar yol haline gelir. \"Herhangi biriniz Allah'a güzel zan beslemeden ölmesin\" (Müs!im,Cenne) hadisi de bu düşünceyi teyit etmektedir. Tevhid Bölümünde bu konu hakkında açıklama gelecektir. Başkaları ise şöyle demişlerdir: Kişi güvende olduğuna kesin olarak inanarak esasen korku tarafını ihmal etmemelidir. Bu yaklaşımı Tirmizı'nin Enes'ten naklettiği şu hadis teyit etmektedir: \"Nebi Sallallahu Aleyhi ve Sellem ölmek üzere olan bir gencin yanına girdi. Ona \"Kendini nasıl buluyorsun?\" dedi. Genç \"Allah'tan umuyorum ve günahlarımdan korkuyorum\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Bu durumda olan bir kulun kalbinde korku ve ümit bir araya geldiğinde Allah ona umduğunu verir, korktuğundan emin kılar\" dedi.(Tirmizı, Cenaiz) Herhalde Buhari yukarıdaki başlıkta buna işaret etmektedir. \"Süfyan\" yani Süfyan İbn Uyeyne dedi ki: \"Bana göre Kur'an-ı Kerim'de şu ayetten daha şiddetli bir ayet yoktur.\" Bu rivayetin değerlendirilmesi, açıklanması el-Ma ide suresinin tefsirinde daha önce geçmişti. \"Cennetten ümidini kesmezdi.\" Bazı bilginler bundan maksat, \"KMir Allah'ın rahmetinin genişliğini bilseydi bu bilgi, azabın büyüklüğüne dair bildiğini siler ve böylece umudu doğardı\" demiştir. Bundan maksat, -rahmetin mukabili olan azaba iltifat etmeksizin- rahmetin genişliğine onu umarak ilminin bağlanması da olabilir. Hadisin yukarıdaki başlığa olan uygunluğu, onun umut ve korku doğuran vaad ve tehdidi içermesi dolayısı iledir. Her kim Allahu Teala'ın rahmet etmek istediği kimselere rahmetinin, intikam almak istediği kimselerden intikamının sıfatlarından olduğunu bilirse rahmetini uman, intikamından emin olmaz, intikamından korkan rahmetinden ümitsizliğe düşmez. Bu, -küçük bile olsa- kötülükten kaçınmaya ve -az bile olsa- itaate devam etmeye sebeptir. Kirmanı burada \"lev\" kelimesi hakkında kısaca şöyle söylemiştir: \"Lev\" burada birincinin -ilim- olmaması yüzünden, ikincinin -umut- olmadığını ifade etmektedir. Kelime bu haliyle \"lev ci'teni ekramtuke = bana gelseydin, sana ikram ederdin\" cümlesinin başındaki \"lev\" kelimesine benzemektedir. Kirmanı şöyle der: Hadisten maksat şudur: Mükellefin korku ve ümit arasında bulunması uygun olur ki umut noktasında ifrata kaçıp, iman varsa hiçbir şey zarar vermez diyen Mürde gibi olmasın. Korkuda da irrata kaçıp, büyük günah işleyen tövbe etmeden ölürse cehennemde ebedi olarak kalacaktır diyen Hariciye ve Mutezile gibi de olmasın. Allahu Teala'ın \"Onun rahmetini umarlar ve azabından korkarlar\"(İsra 57) ifadesinde olduğu gibi tam ortada bulunurlar. İslam dinini inceleyen onun gerek usul, gerek füru kaidelerinin tümünün orta yönde olduğunu görürler. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 58
			}
		}
	]
}