{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6491,
			"arabicnumber": 6491,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Rabbinden rivayet ettiği bir hadisinde Allahu Teala'nın şöyle buyurduğunu nakletmiştir: \"Şüphesiz Allahu Teala güzellikleri ve çirkinlikleri takdir edip yazdı. Sonra bunu beyan edip açıkladı. Her kim bir güzel iş yapmayı diler de onu yapamazsa, Allah o kimse hesabına kendi divanında tam bir hasene yazdırır. Eğer o kimse güzel bir iş yapmak ister ve yaparsa Allah o kimse lehine kendi katında on hasene sevabından yedi yüz misline ve daha çok misline kadar hasene sevabı yazdırır. Bir kimse de çirkin bir iş yapmaya niyetlenir ve onu işlemezse, Allah kendi katında onun lehine tam bir hasene sevabı yazdırır. Eğer o kimse fena bir iş yapmak ister de o fenalığı yaparsa Allah onun aleyhine bir tek kötülük yazdırır.\" Fethu'l-Bari Açıklaması: İmam Buhari'nin attığı başlıkta yer alan \"el-hemm\" insanın fiili işleme kastının ağır basması demektir. \"Hememtu bi keza\" yani o işi azmimle yapmaya yöneldim demektir. Bu, bir şeyin sırf kalpten geçirilmesinden daha ötedir. \"Rabbinden rivayet ettiği bir hadisinde.\" Yukarıdaki hadis, kudsi hadislerden biridir. Öte yandan bu ifadeler, Nebi Sallallahu Aleyhi ve Sellem'in Rabbinden vasıtasız olarak aldığı vahiylerden olabileceği gibi, melek vasıtasıyla aldığı vahiy olma ihtimali de vardır ve tercih edilen de budur. \"Sonra bunu beyan edip açıklad!.\" Yani \"fe men hemme = kim azmederse\" ifadesiyle ayrıntısına girdi. Mücmel olan \"Allahu Teala (eşyadaki) güzellikleri ve çirkinlikleri takdir edip yazdı\" cümlesindeki \"ketebe\" fiilidir. Tufı bunu Allahu Teala hafaza meleklerine yazmalarım emretti şeklinde açıklamıştır ya da maksat Allah bunu ilminde vaki olana uygun olarak takdir etti demektir. Bir başkası ise, yazmaktan maksat takdir etti ve katib olan meleklere bu takdirini bildirdi. Dolayısıyla her vakitte yazmanın nasılolduğunu sormaya ihtiyaç yoktur. Çünkü bu bitirilmiş bir iştir demiştir. İmam Şafii'den bu haberin zahirine uygun bir açıklamaya rastladım. Şafii'ye göre hesaba çekilme bir fiile azmedip fakat eyleme dönüştürmeyene değil, onu yapmaya azmedip, bizzat başlayanadır. \"Fe men hemme = Her kim azmederse\" Müslim'de Hemmam'ın Ebu Hureyre'den yaptığı rivayette \"hemme\" yerine \"iza tahaddese = içinden geçirdiğinde\" ifadesi geçmektedir. Bu diğer rivayetlere uygun olması için \"insanın içinden geçirmesi\" şeklinde yorumlanmıştır. Bunu zahiri üzere almak da mümkündür. Fakat insanın kendi kendine konuşması iyiliğin yazılması açısından bir kayıt ve şart değildir. Tam tersine sırf irade etmiş olmakla iyilik yazılır. Mutlak olarak azim ve iradenin yetmediğini gösteren birtakım haberlerin olduğunu biz de kabul etmekteyiz. Ahmed İbn Hanbel, sahihtir değerlendirmesi ile İbn Hibban ve Hakim'in Hureym İbn Fatik'ten yaptıkları bir rivayete göre Resulullah Sallallahu Aleyhi ve Sellem \"Her kim bir iyiliği yapmaya azmederse Allah onu kalbine hissettirdiğini ve bunu istediğini bilir\" buyurmuştur.(İbn Hibban, Sahih, XLV, 45) İbn Hibban bu haberi esas almış ve Sahih'inde habere yer verdikten sonra burada \"el-hemm\"den maksat azimdir demiş sonra da şu açıklamayı yapmıştır: Allahu Teala'ın kul azmetmese bile fazladan lütufta bulunmak için sırf içinden geçirmekle iyiliği yazma ihtimali de vardır. \"Onu yapmazsa.\" Bu cümlede yapılmayan organların amelidir. Kalbin ameline gelince, bu cümlenin onu kapsaması da mümkündür. Ancak bunun için iyiliğin, hadislerin büyük bir kısmında ifade edildiği üzere sırf insanın içinden geçirmesiyle yazılması ve Hureym'in hadisinde ifade edildiği üzere azimle kaydedilmemesi gerekir. Ebu Zerr'in, Müslim'de yer alan \"Kötülükten elini çekmenin sadaka olduğu\" yolundaki rivayet birinci görüşü teyit etmektedir. \"Bir kimse de çirkin bir iş yapmaya niyetlenir ve onu işlemezse, Allah kendi katında onun lehine tam bir hasene sevabı yazdırır.\" Hattabi şöyle demiştir: Çirkin bir fiili terke hasene (güzellik) yazılması, o fiili terk eden kimsenin bunu işlemeye gücünün olması ve sonra da onu terk etmesi şartına bağlıdır. Çünkü insan bir şeyi ancak yapmaya kudreti varken yapmamışsa terk etmiş sayılır. Bir kimse ile bir fiili işlemeye olan isteği arasına herhangi bir mani girmesi de buna dahildir. Sözgelimi kişi zina etmek üzere bir kadına gitse ve kapıyı kapalı bulup açamasa zinayı terk etmiş sayılmaz. Aynı şekilde bir kimse zina imkanı bulsa ancak ereksiyon olmasa ya da karşısına kısa vadede kendisine zarar verecek bir durum çıksa bu kişi de zinayı terk etmiş olmaz. \"Eğer o kimse fena bir iş yapmak ister de o fenafığı yaparsa Allah onun aleyhine bir tek kötülük yazdırır.\" Müslim'de yer alan Ebu Zerr hadisine göre Allahu Teala \"Onun karşılığı misli bir kötülüktür veya ben onu bağışlarım\" buyurmuştur.Müslim, Zikir ve Dua) Bunun manası şudur: Allahu Teala, o kötülüğü lutfuyla veya tövbe ile ya da istiğfarla veya kötülüğüne kefaret olan iyi bir amelde bulunmakla siler. Ebu Zerr hadisinin zahirinden dolayı bunlardan birinci ihtimal daha ağır basmaktadır. Hadis, büyük günahların ancak tövbe ile bağışlanacağını iddia eden görüşe red mahiyetindedir. Hadisten Çıkan Sonuçlar 1- İbn Battal şöyle demiştir: Bu hadis Allahu Teala'nın bu ümmete büyük lütuf ve ihsanını açıklamaktadır. Zira eğer böyle olmasaydı hemen hemen hiç kimse cennete giremezdi. Zira kulların kötülük işlemeleri, iyilik işlemelerinden daha çoktur. İyilik işlemeyi düşünmeye sevap verileceği, kötülük işlemeyi düşünmeye hesap sorulmayacağını ifade eden yukarıdaki hadisi Allahu Teala'ın \"Herkesin kazandığı (hayır) kendine, yapacağı (şer) de kendinedir\"(Bakara 286) ayeti teyit etmektedir. Zira kötülükten söz edilirken -iyiliğin aksine- uğraşma ve zorlama anlamı taşıyan \"iftial = iktisab\" kalıbı kullanılmıştır. 2- Hadiste kulun Rabbi için, onun sevabını arzu ettiğinden, cezasından korktuğundan, lezzetinden vazgeçmesi, şehvetini terk etmesi karşılığında kendisine neyin verileceğinden söz edilmektedir. Hadisten hafaza meleklerinin iyilikleri ve kötülükleri yazma ile görevlendirildikleri için mubahları yazmadıkları sonucu çıkmaktadır. Buna bazı hadis şarihleri, bazı imamların mubahı hasenattan saydıkları yolunda cevap vermişlerdir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 80
			}
		}
	]
}