{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6495,
			"arabicnumber": 6495,
			"text": "Ebu Said el-Hudri'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"İnsanların üzerine öyle (sıkıntılı) bir zaman gelir ki, o günlerde Müslüman kişinin hayırlı malı koyun sürüsüdür. Müslüman o koyun sürüsünü dağ başlarına ve yağmur düşen vadilere götürür. Böylece dini yüzünden olacak fitnelerden kaçar kurtulur!\" Fethu'l-Bari Açıklaması: \"Yalnız Yaşamanın Kötülerle Birlikte Bulunmaya Göre Rahatlık Olduğu.\" İbnü'I-Mübarek'in Rakaik'ta nakline göre Hz. Ömer \"Uzletten nasibinizi alınız\" demiştir. Cüneyd'in -Allah bereketinden bizleri de nasip etsin- şu sözü ne kadar güzeldir: \"İnzivaya katlanmak insanların içine karışıp, onların suyuna gitmekten daha kolaydır.\" Hattabi şöyle demiştir: İnzivaya çekilmekte sadece gıybetten ve ortadan kaldıramadığı münkeri görmekten selamette kalmak olsaydı bu bile büyük bir hayır olurdu. imam Buhariinin attığı başlık ile aynı manada Hakim Ebu Zerr'den şöyle bir hadis nakleder: \"Bir başına olmak kötü bir kişiyle birlikte olmaktan daha hayırlıdır. \"(Hakim, Müstedrek, III, 387) Bu hadisin isnadı hasendir. Yukarıdaki hadiste geçen \"eş-şilb\" dağ yolu veya dağda bir yer, vadi demektir. \"Şalaf\" ise dağ başı demektir. Hattabı Kitabu'l-Uzlelde şöyle der: Uzlete çekilmek ve insanların arasına karışmak bağlantılarına göre farklı hüküm içerir. insanlarla birlikte olmayı teşvik eden hadisler, imamlara itaat ve dini durumlarla ilgilidir şeklinde yorumlanmıştır. Bunun aksi olan deliller de aksi durumlar için sözkonusudur. Bedenen insanlarla birlikte bulunmak ve onlardan ayrılmak meselesine gelince; kişi geçimini sağlama ve dinini yaşama açısından kendi nefsiyle yetinebileceğini biliyorsa onun için en uygun olarıı insanlarla bir arada bulunmaktan kaçınmaktır. Ancak bu kişinin cemaate devam etmesi, selam vermesi, verilen selamı alması ve Müslümanların kendi üzerindeki hasta ziyareti, cenazede bulunmak ve benzeri haklarını ifa etmesi şartıyladır. Burada matlub olan bunun dışında fazladan birlikte bulunmayı terk etmektir. Çünkü bu insanın kafasını meşgul eder ve önemli şeyleri ele alacak vakit bırakmaz. insanlarla bir arada bulunma öğlen ve akşam yemeğine ihtiyaç duymaya benzer. Dolayısıyla kişi vazgeçemeyeceği şeyleri yapmakla kısıtlıdır. Bu, beden ve kalp için daha rahatlık vericidir. Doğruyu en iyi Allahu Teala bilir. Kuşeyrı Risalesinde şöyle der: inzivaya çekilmeyi tercih edenlerin düşünce tarzı kişinin insanların kendi kötülüğünden selamette kalmalarına inanmasıdır, bunun aksi değildir. Çünkü birinci anlayışı doğuran kişinin kendi nefsini küçük görmesidir. Bu da mütevazi olan bir kimsenin niteliğidir. ikincisi ise kişinin kendi nefsinde başkalarına göre bir meziyet görmesidir ki bu da böbürlenen ve kibirlenen kimsenin vasfıdır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 84
			}
		}
	]
}