{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6497,
			"arabicnumber": 6497,
			"text": "Huzeyfe (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) bize iki hâdise haber verdi. Bunlardan birisini gördüm, öbürüsünü görmeyi gözlüyorum. Rasûlüllah bana (emânetin nasıl indirildiğini şöyle) haber verdi: \"Emânet (yânı dîn duyguları, adalet ve emniyet umdeleri ilk önce) sâlih kimselerin gönüllerinin derinliğine indi. (Böylece emânet fıtrî oldu.) Sonra o kullar Kur'ân 'dan bilgi aldılar, sonra sünnetten bilgi aldılar (bu da kesbî oldu).\" bize emânetin geri kaldırılmasını da haber verip şöyle buyurdu: \" (Fıtrî ve kesbî duygular sahibi olan) bilgili kişi, bir uyku uyur. O uyurken emânet kalbinden silinip alınır da, emânetin eseri (izi, yeri), rengi uçuk bir nokta hâlinde yanık yeri gibi kalır. Sonra o bilgin kişi bir uyku daha uyurken, emânetin (geri kalan kısmı da) alınır. Bunun eseri ve yeri de balta sallayan bir işçinin avucundaki kabarcık gibi kalır (bir zaman sonra o da söner gider). Şu hâlde (o mübarek) emânet, senin ayağına düşürdüğün bir ateş parçasının düştüğü yeri şişirip senin onu bir kabarcık şeklinde görmen gibidir. Halbuki bu kabarcıkta (bedenin hayâtı üzerinde te'sîrli) birşey yoktur (bir zaman sonra söner gider). Şu vaziyette halk birbirleriyle alışveriş etmek ve medenî münâsebette bulunmak için (müşkil bir günün) sabahına erişmiş bulunur. Hiçbir kimse emâneti edâ etmek imkânım bulamaz. Şöyle ki, bazen 'Fulân oğulları içinde emîn bir kimse vardır (emâneti ona verelim)' denilir. Bazen birisinin lehine: 'O ne akıllıdır, ne tedbirlidir; o ne zerâfetli zâttır, o ne kahramandır!' diye şehâdet olunur. Halbuki hakkında propaganda yapılan şahsın kalbinde hardal dânesi kadar îmândan bir eser yoktur. \" dedi ki: Bana öyle bir zaman karşı geldi (öyle bir zamanda yaşadım) ki, o (saâdetli ve emânetli) devirde ben kiminle alışveriş edeceğim diye tasalanmazdım. Çünkü medenî münâsebette bulunacağım kimse müslümânsa, onu İslâm Dîni (bana hıyanet etmekten) men' ederdi. Eğer Hristiyân (ve Yahûdî) ise, onu bulunduğu yerin vâlîsi hıyanetten men ederdi. (Bu suretle o devirde umûmî bir emniyet vardı.) Bu gün ise, ben fulân ve fulândan başka kimse ile alışveriş edemez oldum",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 86
			}
		}
	]
}