{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6498,
			"arabicnumber": 6498,
			"text": "Abdullah bin Ömer r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"İnsanlar ancak yüz deve gibidir. İçlerinde hemen hemen kamil sıfatlı, kullanışlı, bir tane iyi binek devesi bulamazsın!\" Fethu'l-Bari Açıklaması: \"Emanetin Kaldırılmas!.\" \"Emanet\", \"hıyanet\" kelimesinin zıttıdır. Onun kaldırılmasından maksat, güvenilir kimsenin yok olması veya yok denecek kadar azalacak şekilde ortadan kaldırılmasıdır. \"Emanet zayi edildiği zaman.\" Bu cümle kıyametin ne zaman kopacağını soran bedeviye verilen cevaptır. \"Emaneti zayi etmek nasılolur?\" sorusunu soran da aynı kişidir, \"İş ehli olmayan kimseye havale edilip verildiğinde.\" \"İş\" kelimesinden maksat hilafet, idarecilik, yargı, fetva ve bunun dışında başka şeyler gibi dinle alakah olan işler demektir. İbn Battal şöyle demiştir: \"İş ehli olmayan kimseye havale edilip verildiğinde\" cümlesinin manası şudur: İdareciler, Allahu Teala'ın kullarını kendilerine emanet ettiği ve onlara içtenlikle bağlı olmalarını emrettiği kimselerdir, Dolayısıyla onların dindar kimseleri göreve getirmeleri gerekir. İdareciler dindar olmayan kimseleri göreve getirdiklerinde Allahu Teala'ın kendilerine yüklediği emaneti zayi etmiş olurlar. Emanet konusunda zikredilen ve merfu olduğu ifade edilen ikinci sıradaki Huzeyfe hadisi isnadı ve metniyle Fiten Bölümünde gelecektir ve inşaailah orada açıklanacaktır. Hadisteki \"el-müntebir\" kabarcık demektir. Hattabi'ye göre Huzeyfe \"baya'tu\" fiili ile alışverişi kastetmiştir. \"Ala sa'ihL\" Bundan maksat o hıristiyandan karşı tarafın hakkını almak için başına getirilmiş olan validir. \"Sa'!\" kelimesi çoğunlukla zekat memurları anlamında kullanılır. Burada cizyeyi almaya yetkili olan memur anlamı da kastediImiş olabilir. İbn Kuteybe'nin hadiste geçen \"er-rahile\" kelimesinin binmek için seçilmiş iyi cins deve anlamında olduğunu söylediği naklediimiştir. \"İnsanlar ancak yüz deve gibidir\" hadisinde geçen \"er-rahile\" kelimesini Ezheri şöyle açıklamıştır: \"er-rahile\" Araplarda erkek ve dişi olmak üzere iyi cins binek devesi demektir. Hadiste ifade edilmek istenen şudur: Dünyadan zühd içinde olan, bu konuda kamil olan ve ahireti isteyen kimseler, iyi cins binek devesinde olduğu gibi gayet azdır. Nevevi şöyle demiştir: Bu, güzel bir açıklamadır. Bu iki açıklamadan daha güzeli ise başkalarının şu ifadesidir: İnsanlardan durumundan hoşnut olunan, vasıfları kamil olan azdır. Bizce bu ikinci şıktır. Ancak onu \"zahid\" kelimesiyle tahsis etmiştir. Uygun olanı şeyh in de dediği gibi bunu genellemektir. Kurtubi şöyle demiştir: Hadisteki örneklemeye uygun olan açıklama insanların yüklerini ve ağırlıklarını onların adına yüklenen, sıkıntılarını gideren, kqliteli insan birçok devenin içinde iyi cins binek devesinde olduğu gibi az bulunur. İbn Battal şöyle demiştir: Hadisin manası şudur: İnsanlar çoktur, onlardan hoşnut olunanlar azdır. İmam Buhari, hadisi \"Emanetin Kaldırılması Bölümünde zikretmek suretiyle bu manaya işaret etmiştir. Çünkü niteliği bu olan kimse hakkında tercih edilen davranış, onunla samimiyet kurmamak, birlikte bulunmamaktır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 87
			}
		}
	]
}