{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6500,
			"arabicnumber": 6500,
			"text": "Muaz İbn Cebel r.a. şöyle anlatmıştır: Ben bineği üzerinde iken Nebi Sallallahu Aleyhi ve Sellem'in arka tarafına binmiş, onunla aramda ancak semerin ağacı olup, beraber yol aldığımız bir sırada bana: \"Ya Muazl\" diye seslendi. Ben de \"lebbeyk ya Resulallah ve sadeyk (buyur ya Resulallah, tekrar tekrar emrine hazırım, tekrar tekrar yardıma hazırım)\" dedim. Sonra bir müddet yürüdü, ardından yine: \"Ya Muazl\" diye seslendi. Ben \"buyur ya Resulallah! İtaate hazırım, yardıma hazırım!\" dedim. Sonra bir müddet daha yürüdü. Sonra yine: \"Ya Muaz İbn Cebel!\" diye seslendi. Ben \"buyur ya Resulallah itaatine ve yardım etmeye hazırım!\" dedim. \"Allah'ın kulları üzerinde ne hakkı vardır bilir misin?\" diye sordu. Ben \"Allah ve Resulü en iyi bilendir\" dedim. \"Allahın kulları üzerinde sabit olan hakkı, kulların Allah'a itaat ve ibadet etmeleri ve Allah'a hiçbir şeyi ortak kılmamalandır\" buyurdu. Sonra bir süre daha yürüdü. Ardından \"Ya Muaz İbn Cebel\" dedi. Ben yine \"lebbeyk ya Resulallah ve sadeyk\" dedim. \"Kullar bu tevhid, ibadeti yaptıkları zaman, onlann Allah üzerindeki hakları nedir bilir misin?\" diye sordu. Ben \"Allah ve Resulü en bilendir!\" dedim. \"Kulların Allah üzerindeki hakkı, Allahın onlara azap etmemesidir\" buyurdu. Fethu'l-Bari Açıklaması: \"Allah'a İtaat Yolunda Nefsiyle Mücahede Eden Kimse.\" Yani Allah'a itaat yolunda nefsiyle mücahede eden kimsenin faziletinin beyanı. \"Mücahede\" kelimesinden maksat, nefsi istemiş olduğu ibadet dışı şeylerden alıkoymak demektir. İmam Buhariinin attığı başlıkla burada yer verdiği hadis arasındaki münasebet bu açıklamayla sağlanmaktadır. İbn Battal şöyle demiştir: Bir kimsenin nefsiyle olan cihadı en mükemmel cihattır. Çünkü Allahu Teala \"Rabbinin makamından korkan ve nefsini kötü arzulardan uzaklaştıran için ise şüphesiz cennet yegane bannaktır\"(Naziat 40, 41) buyurmaktadır. Sözkonusu cihad, nefsi masiyetlerden, şüpheli şeylerden ve mubah olan istek duyduğu şeyleri çok çok yapmaktan alıkoymakla olur. Bunun amacı nefse bunların ahirette bol bol verilmesidir. Buna bir gerekçe de biz ekleyelim: Nefisle mücahede, kulun mubah olan şeyleri çok çok işleyerek buna alışmasının, bunun da kendisini şüpheli şeylere çekmesinin, böylece haramı işlemekten emin olamaz bir duruma düşmesinin önüne geçmek içindir. Ebu Amr İbn Buceyd şöyle demiştir: Kime dini değerli olursa ona nefsi değersiz olur. Kuşeyrı ise şöyle der: Nefisle mücahedenin aslı, onu alıştığı şeylerden kesmek ve heva ve hevesi dışındaki fiillere yönlendirmektir. Nefsin iki sıfatı vardır: a- Şehvetlere dalmak, b- İtaatten kaçınmak. Nefisle mücahede buna göre yapılır. İmamlardan biri şöyle demiştir: Nefisle cihad, düşmanla cihada dahildir. Çünkü düşmanlar üçtür: Bunların en başı şeytandır. Ardından nefis gelir. Çünkü nefis insanı Rabbi gazaplandıracak haramlara düşmeye götüren lezzetlere çağırır. Şeytan bu konuda ona yardımcıdır ve kendisine haramları süsler. Kim nefsinin heva ve hevesine muhalif olursa şeytanını baskı altına almış olur. Kişinin nefsiyle mücahedesi onu Allah'ın emirlerine uymaya ve yasaklarından kaçmaya sevketmesi demektir. Kul bu konuda güçlü olduğunda dindüşmanlarıyla cihadı kolayolur. Birincisi batını, ikincisi zahirı cihaddır. Nefisle cihad dört mertebelidir: ı - Nefsi dini, meseleleri öğrenmeye zorlamak, 2- Nefsi, bunların gereğine göre amel etmeye zorlamak, 3- Nefsi, bilmeyenleri öğretmeye zorlamak, 4- Allahiın tevhidine çağrıda bulunmak, dinine muhalif olan ve nimetlerini inkar edenlerle çarpışmaktır. Nefis ile cihada en güçlü yardımcı şeytan la cihaddır. Bu da şeytanın insana dikte ettiği şek ve şüpheyi, kendisine yasak edilen haramları güzel göstermesini, ardından mubahlardan çok yapılanın şüphelere düşürmeye yol açtığı şeyleri güzel göstermesini reddetmekle olur. Mücahedenin tamamı kişinin her durumda kendi nefsi için müteyakkız ve uyanık olması iledir. Çünkü kişi bundan gafil olduğunda şeytanı ve nefsi kendisine ayartarak yasak olan şeye düşmesine yol açar. Başarı Allah'tandır. \"Resulullah Sallallahu Aleyhi ve Sellem 'Ya Muaz' diye seslendi. Ben 'lebbeyk' dedim.\" Bu cümlenin açıklaması Hac Bölümünde geçmişti. \"Allah'ın kulları üzerinde ne hakkı vardır bilir misin?\" Burada \"hak\"tan maksat, Allahu Teala'ın kulları üzerinde hakkı olduğu ve onların yapmakla kesin olarak yükümlü oldukları şeylerdir. İbnü't-Teymı et-Tahrır isimli eserde böyle demiştir: Kurtubi'nin görüşü ise şudur: Allah'ın kullar üzerindeki hakkı, kendilerine vaat ettiği sevap ve hitabıyla yapmalarını bağlayıcı olarak istediği şeydir. \"Allah'a ibadet etmeleri ve ona hiçbir şeyi ortak koşmamalandır.\" Burada \"ibadet\" kelimesinden maksat, itaati yapmak, masiyetlerden kaçınmaktır. Hadiste \"Allah'a şirk koşmamak\" ibadet üzerine atfedilmiştir. Çünkü bu tevhidi tamamlayan bir unsurdur. Allah'a şirk koşmamanın ibadet üzerine atfedilmesindeki hikmet, bazı keferelerin kendilerinin Allah'a ibadet ettiklerini iddia etmeleridir. Fakat onlar bu iddialarına rağmen başka ilahlara ibadet ediyorlardı. Dolayısıyla ibadet ederken Allah'a şirk koşmamak şart kılındı. Bu cümlenin hal cümlesi olduğu daha önce geçmişti. Buna göre cümlenin takdiri şöyle olur: Allah'a şirk, şirk koşmaksızın ibadet etmeleridir. İbn Hibban şöyle der: Allah'a ibadet, !isan ile ikrar, kalp ile tasdik ve organlar ile amelden ibarettir. Bundan dolayı ona verilen cevapta şöyle denilmiştir: \"Bunları yaptıklarında kulları üzerindeki hakkı nedir? Bu cümle de eylem \"söz\" ile değil, \"fiiı\" ile ifade edilmiştir. \"Kulların Allah üzerindeki hakkı Allah'ın onlara azap etmemesidir.\" Kurtubi şöyle demiştir: Kulların Allah üzerindeki hakları, kendilerine vaad ettiği sevap ve karşılığı vermesidir. Onun doğru olan vaadi ve doğru sözü gereği bu hak edilmiş ve vacib olmuştur. Onun verdiği haberde yalan söylemesi, vaadinden cayması kendisi açısından mümkün değildir. Allahu Teala'ın üzerine emirden hiçbir şey vacib olmaz. Çünkü onun üzerinde bir emreden olmadığı gibi, aklın hükmü de geçerli değildir. Çünkü akıl bir yükümlülük getirmez, sadece olanı ortaya çıkarır. Hadisten Çıkan Sonuçlar 1- İki kişinin bir merkebe binmesi caizdir. 2- Hadisten Hz. Nebi'in (s.av) alçak gönüllü olduğu, Muaz'ın fazileti, gerek konuşma, gerekse ilimde güzel edebi yer almaktadır. Çünkü Muaz hakikatini bilmediği şeyi Allah'ın ve onun Nebiinin ilmine hava le etmektedir. Ayrıca bu hadisten onun Hz. Nebi'e (s. av) yakın olduğu da anlaşılmaktadır. 3- Bir ifadeyi pekiştirmek ve anlaşılmasını sağlamak için tekrarlamak caizdir. Hoca, talebesine onu denemek ve o hüküm konusunda zorlukla karşılaştığı şeyi açıklamak için soru sorabilir. İbn Receb, Buhari'nin baş taraflarını şerh ederken şöyle demiştir: Alimler, Muaz'ın hadisteki müjdeyi insanların buna güvenmemesi için açıklanmasını yasak etmesinden şöyle bir kaide çıkarmışlardır: İnsanlar maksadını yanlış anlamasınlar diye Ruhsat hadisleri halkın arasında yayılmaz. Muaz bu müjdeyi duyduğunda sadece ameli ve Allah'tan korkusu artmıştır. Onun derecesine ermeyen kimsenin haberin zahirine güvenerek amelini ihmal etmeyeceğine güvenilemez. Kitap ve sünnetin naslarından bazı tevhid ehli asilerin cehenneme girecekleri şeklindeki mütevatir haber bu anlayışla çelişmektedir. Buna göre her iki meseleyi birbiriyle cem ve telif etmek gerekir. Bilginler bu konuda çeşitli anlayışları benimsemişlerdir. Bunlardan birisi Zühri'nin \"Ruhsat farzlar ve şer'i cezalar inmeden önce sözkonusu idi\" şeklindeki görüşüdür. Osman'ın abdest hakkındaki hadisi açıklanırken bu görüş ondan nakledilecektir. Bir başkası ise bu yaklaşımı haberin neshe uğramasını uzak gördüğü için uzak bir ihtimal olarar değerlendirmiş ve Muaz'ın bu haberi farzların çoğunun inmesinden daha sonra duyduğunu söylemiştir. Bazı bilginlere göre burada nesih yoktur, aksine haber genelliği üzeredir. Fakat birtakım şartlarla kayıtlıdır. Bu, ahkamın kendisini gerektiren ve manilerin bulunmamasına dayanan sebeplerin sonucu olması gibi bir şeydir. Bu husus tekamül ettiğinde yapılması gereken şey- anlaşılır. Vehb İbn Münebbih, Cenaiz Bölümünde geçen \"La ilahe illallah cennetin anahtarıdır\" hadisi üzerine yaptığı açıklamada buna işaret etmektedir. Kendisi orada \"anahtar\" ancak bazı dişleri olan bir araçtır diyerek bu kelimenin hadiste mecazen kullanıldığını ifade etmiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 89
			}
		}
	]
}