{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6516,
			"arabicnumber": 6516,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem: \"Ölülere sövmeyİniz. Çünkü onlar önden göndermiş oldukları amellerin karşılıklarına ulaşmışlardır\" buyurmuştur. Fethu'l-Bari Açıklaması: \"Ölüm sekeratı\", \"sekerat\" \"sekra\" kelimesinin çoğuludur. Rağıb ve başkaları şöyle demişlerdir: Sekr, kişi ile aklı arasına engelolan durumdur. Kelime daha çok sarhoşluk verici şeyleri içmede kullanılır. Bu kelime öfke, aşk, elem, uyuma, elemden kaynaklanan kendinden geçme durumlarında da kullanılır. Burada kastedilen bu son durumdur. Hadis-i şerif ölüm şiddetinin insanın mertebesinde eksiklik olduğunu göstermediğini ifade etmektedir. Tam tersine bu durum mümin için ya güzel amellerini arttırma veya yaptığı kötü fiilleri örtme amaçlıdır. Bu açıklamadan yukarıdaki hadislerin atılan başlıkla olan ilişkisi ortaya çıkmaktadır. \"Sizin başınıza kıyametiniz kopar.\" Enes'in radıyallahu anh rivayet ettiği bir hadiste ise \"kıyamet kopuncaya kadar\" denilmektedir. Kadı Iyaz şöyle der: Hz. Aişe'nin naklettiği bu hadis Enes'in hadisini tefsir etmekte ve maksadın hitaba muhatap olanların kıyameti olduğunu belirtmektedir. Bu cümle Hz. Nebi Sallallahu Aleyhi ve Sellem'in \"Sizin şu içinde bulunduğunuz gece var ya! Bundan tam yüz sene sonra şu anda bu gecede bulunanlardan hiçbir kimse, yeryüzünde (hayatta) kalmayacaktır\" ifadesine benzemektedir. Bu hadisin açıklaması İlim Bölümünde geçmişti. Hz. Nebi Sallallahu Aleyhi ve Sellem'in demek istediği, o nesiin o andan yüz sene sonra yok olacağı ve kendi zamanında yaşayanların hiçbirinin konuşmanın üzerinden yüz sene geçtikten sonra hayatta olmayacağıdır. Nitekim gerçek aynen Nebi s.a.v.'in haber verdiği gibi çıkmıştır. Zira Hz. Nebii görenlerden hayatta kalan en son kişi, Müslim ve başkalarının kesin olarak belirttikleri üzere Ebü't-Tufeyl Amir b. Vasile olmuştur. Ebü't-Tufeyl'in vefatı hicrı 110 yılına tesadüf eder. Bu tarih, Hz. Nebi Sallallahu Aleyhi ve Sellem'in yaptığı o konuşmadan tam yüz sene sonraki tarihtir. Kirmani şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in verdiği bu cevap üslubu hakimdir. Yani Hz. Nebi Sallallahu Aleyhi ve Sellem onlara şöyle demiş olmaktadır: Büyük kıyametin ne zaman kopacağını sormayı bırakın. Çünkü bunu Allah'tan başka bilen yoktur. Siz asıl• içinde yaşadığınız asrın yok olacağı vakti sorun. Bu sizin için daha uygun bir sorudur. Zira bu tarihi bilmeniz sizleri vakti geçmeden salih ameli bırakmamaya sevkeder. Çünkü hiçbiriniz diğerini geçecek kişinin kim olduğunu bilmiyorsunuz. \"Min nasabi'd-dünya ve ezaha = Dünyanın yorgunluklarından ve eza larından.\" Hadiste geçen \"en-nasab\" yorgunluk demektir. \"en-Nasab\" ve \"et-taab\" vezin vemana itibariyle aynıdır. İbnü't-Tıyn şöyle der: Hadiste yer alan \"el-mümin\" kelimesi ile özellikle takva sahibi müminin kastedilmiş olma ihtimali olduğu gibi her çeşit müminin kastedilmiş olması da muhtemeldir. \"el-Facir\" kelimesi ile de katirin kastedilme ihtimali olduğu gibi her türlü asinin buna dahil olma ihtimali de söz konusudur. Davudi şöyle der: \"Kulların istirahatı\" o kimsenin yapmış olduğu münkerden dolayıdır. Şayet kendisine tepki gösterecek olurlarsa onlara eziyet eder, tepkiyi bir tarafa bırakacak olurlarsa günaha girerler. \"Şehirlerin istirahatı\" o kişinin işlediği masiyetlerden kaynaklanır. Zira bu tavır kuraklık sebeplerindendir. Dolayısıyla yapılan hareket ekin ve neslin helak olması sonucunu doğurur. \"(Ölmekle) istirahat eden ve kendisinden istirahat edilendir. Mümin dünya yorgunluğundan istirahat eder.\" Bir Uyarı: Bu hadisin yukarıdaki başlıkla ilişkisi şu açıdandır: Ölü için iki durumdan birisi sözkonusudur: Ölü ya rahatlayandır ya da kendisinden kurtulunmuş olandır. Bunlardan her biri için ölüm anında sıkıntılı bir durum veya hafif bir hal sözkonusu olabilir. Bunların birincisi sekeratu'l-mevti oluşturandır. Bunun o kişinin takvası veya günahkarlığı ile alakası yoktur. Aksine kişi takva ehli birisi ise sevabı daha da artar. Aksi takdirde o miktarca günahları bağışlanır. Öte yandan aynı kişi kendi sonunda olan dünyanın eziyetinden rahata kavuşur. Bu anlayışı birinci hadisteki Hz. Aişe'nin ifadesi de teyit etmektedir. Ömer b. Abdulaziz şöyle demiştir: Ölüm sarhoşluğunun (sekeratu'l-mevt) bana kolay geçmesini istemem. Çünkü bu durum, bir mu'minin günahının bağışlanacağı son andır. Bununla birlikte müminin karşılaşacağı müjde kendisiyle karşılaştıkları için meleklerin sevinç duyması ve ona refakat etmeleri, Rabbine kavuşma sebebiyle du ya cağı ferahlık ölüm eleminden başına gelen her şeyi kolay hale getirir. Hatta kişi bunlardan hiçbir şey duymuyormuş hale gelir. \"Ölüyü ailesi, malı ve ame/i takip eder.\" Genellikle olan budur. Nice ölü vardır ki kendisini sadece ameli takip eder. Ehlinden cenazesini takip edenlerden maksat arkadaşları ve Arapların adeti üzere hayvanlarıdır. Ona üzüntü duyma durumu geçince aile fertleri definden sonra ister ikamet etsinler, isterse etmesinler geri dönerler. Kişinin amelinin baki kalması, amelin onunla birlikte kabre girmesi demektir. \"Sizden biriniz vefat ettiği zaman sabah akşam ona oturacağı yer arz olunup gösterilir.\" Bu gösteri, gerçekte ruha ve açıklaması daha önce geçtiği üzere onun bedene nimetin veya azabın idrakini mümkün kılan bitişme ile bitiştiği yeredir. Kurtubi bu konuda iki ihtimalden söz eder: Sözkonusu gösteri sadece ruha mıdır Yoksa hem ruha ve hem de bedenin bir kl5mına mıdır? İbn Battal'ın nakline göre kendi memleketinden birisi şöyle demiştir: Burada sözkonusu gösteriden maksat, bu sizin Allah katında amellerinizin karşılığmın verileceği yerdir demektir. Tekrarla onların bunu hatırlamaları kastediimiştir. Delilolarak cesetlerin fani olduğu ve fani olan bir şeye sunum yapmanın mümkün olmadığı ileri sürülmüş ve şöyle denilmiştir: Buradan anlaşılıyor ki kıyamete kadar devam edecek olan sunum, ancak özellikle ruhlara karşı olacaktır. Sözkonusu sunumu \"haber verme\" şeklinde yorumlama, hadisin zahirinden bunu gerektiren bir şey yokken dönmek anlamına gelir. Dönme ancak ifadenin zahirinden insanı çeviren bir gerekçe olduğunda geçerlidir denilerek bu görüş tenkit edilmiştir. Bizim kanaatimiz ise şudur: Hadisi zahiri manaya yorumlamayı haberin mümin ve kafir hakkında genelolarak varid olması teyit etmektedir. Bu ruha mahsus bir durum olsaydı bu durumda şehir için büyük bir fayda hasıl olmazdı. Çünkü onun ruhu sahih hadislerde ifade edildiği üzere kesinlikle nimetlenmektedir. Kafirin ruhu da aynı şekilde kesin olarak cehennemde azap görmektedir. Hadis bedenle ilişkisi olan ruha sunum şeklinde yorumlandığında bunun faydası hem şehit ve hem de kafir hakkında ortaya çıkar",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 105
			}
		}
	]
}