{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6518,
			"arabicnumber": 6518,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Bayılıp düşecekleri zaman insanlar hep birlikte bayılıp düşerler. Kalkışta ben, ayağa kalkanların ilki olurum. Bir de görürüm ki, Musa arşa sıkıca tutunmuş durmaktadır. Artık ben Musa'da bayılanların içinde miydi (yahut değil miydi) bilemiyorum. \" Fethu'l-Bari Açıklaması: \"Sura üfürülmesi.\" Bu kelime Kur'an'da el-En'am, el-Muminun, en-NemI, ez-Zümer, Kaf ve başka surelerde tekrar edilir. Aynı şekilde meşhurkıraatlarda ve hadislerde de geçer. Hasan-ı Basrl'nin \"suret\" kelimesinin çoğulu olarak \"suver\" şeklinde okuduğu ve ruhların cesetlere yeniden iade edilmesi için onlara üflenmesi manasındadır şeklinde tevil ettiği nakledilmiştir. Ebu Ubeyde, el-Mecaz'da şöyle der: Bu kelime \"suret\" kelimesinin çoğulu olarak \"sur\" şeklindedir. Kelime bu haliyle \"suru'l-medine\" ifadesindeki \"sur\" gibidir. Duvar ve sur anlamına gelen bu kelimenin çoğulu da sin harfiyle birlikte \"suret\" şeklindedir. Bu açıklamanın benzerini Taberi bir topluluktan nakletmiştir ve o kelimenin \"sufe\" kelimesinin çoğulu olan \"suf\" gibi olduğunu ilave etmiştir. Bilginler şöyle derler: Sura üfürülmek tabirindeki \"sur\" kelimesinden maksat, ruhların yeniden iade edilmesi için cesetler ve bedenlerdir. Nitekim Allahu Teala \"ve nefahtu fihi min ruhi=ona şekil verdiğim ve ona ruhumdan üflediğim zaman siz hemen onun için secdeye kapanzn.\"(Hier 29; Sad 72) en-Nehhas ve başkaları tevile cevap vermede ileri gitmişlerdir. Ezherı şöyle der: Bu açıklama ehl-i sünnet ve'l-cemaatin anlayışına terstir. Biz de şunu ekleyelim: Ebü'ş-Şeyh, Kitabu'I-Azama'da Vehb b. Münebbih'İn şu cümlesine yer verir: Allah suru cam gibi berrak bir halde beyaz inciden yarattı. Sonra arşa \"suru al\" dedi ve sur ona yapıştı. Ardından \"ol\" emrini verdi ve İsrafil meydana geldi. Allahu Teala ona suru almasını emretti. O da aldı. Üzerinde bütün ruhun ve alınan nefesin sayısınca delik vardı. Bu hadisin devamında şu ifadeler de yer alır: Sonra bütün ruhlar surda birleşti. Öte yandan Allahu Teala İsrafil'e emredecek ve o sura üfürecek. Böylece her ruh kendi cesedine girecek. Buna göre ruha üfürme suretlere yani cesetlere ulaşsın diye önce sura üfürme şeklinde gerçekleşecektir. Üfürmenin boynuzdan ibaret olan sura üfürülmesİ gerçek, cesetlerden ibaret olan surlara üfürülmesi mecazdır. \"Mücahid b. Cebr, sur boru gibi bir şeydir\" demiştir. es-Sıhah müellifi şöyle der: Çalınan boru herkesçe malumdur. Batıla da \"el-buk\" denilir. Yani batıl cinsi bir şeyolduğu için mecazen ona da el-buk denir. Bir Uyarı: Bir şeyin kınanmış olması, övülen bir şeyin ona benzetilmemesini gerektirmez. Vahyin sesi çan sesine benzetilmiştir.Oysa Bed'ü'I-Vahy Bölümünde açıklaması geçtiği üzere namaz vakitlerinin insanlara duyurulması için çan çalınma adeti yasaklanmıştı. Sur merfu hadislerde geçtiği üzere bir borudur. Ezan uygulamasının başlangıcının konu edinildİği yerlerde Yahudilerin ezan vaktini bildirmek için kullandıkları alet hakkında \"el-buk\" ve \"el-karn\" kelimeleri kulJanılmıştır. Yemen lehçesinde \"sur\", \"el-karn\"ın ismidir. Ebu Davud, hasendir . değerlendirmesiyle Tirmizi, Nesai, .sahihtir değerlendirmesi ile İbn Hibban ve - Hakim'in naklettikleri bir hadiste Abdullah b. Amr b. eı-As şöyle demiştir: Bir bedevi Hz. Nebie gelerek \"Sur nedir?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"İçine üflenen bir borudur\"'cevabını verdi.(Ebu Davud, Sünne; Tirmizi, Sıfatu'l-Kıyame; İbn Hibban, Sahih, XVI, 303; Hakim, Müstedrek, Il, 550) Tirmizi'nin hasendir değerlendirmesi ile Ebu Said' den yaptığı bir nakle göre Hz. Nebi Sallallahu Aleyhi ve Sellem \"SCirun sahibi onu ağzına dayamış, ona üflenmesine ne zaman izin verilecek üfleyeceğim diye beklerken ben nasıl rahat hayatyaşanm?\" buyurmuştur (Tirmizi, Sıfatu'I-Kıyame)",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 107
			}
		}
	]
}