{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6530,
			"arabicnumber": 6530,
			"text": "Ebu Said'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Allahu Teala 'Ya Adem! diye seslenir. Adem hemen cevap olarak 'Lebbeyk ve sadeyk' der. Allah Teala ateşe girecekleri çıkarıp gönder!' der. Adem 'Ya Rab! Ateşe gönderilecekler ne kadardır?' diye sorar. Allahu Teala 'Her bin kişiden dokuzyüz doksandokuzu!' diye cevap verir. Bu (o günkü şiddetli korkudan) çocuğun ihtiyarlayacağı, her gebe kadının çocuğunu düşüreceği, insanları da -sarhoş olmadıkları halde Allah'ın azabı şiddetli olduğu için- sarhoş bir durumda göreceğin gündür. Oradakilere bu haber ağır geldi ve \"Ya Resulallah! Bu (binde bir) kişi hangimizdir?\" diye sordular. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Size müjdeler olsun! Muhakkak ki sizden bir kişiye mukabil Ye'cüc ve Me'cüc'den bin kişi {cehenneme gönderilecektir}!\" buyurdu. Sonra da \"Nefsim elinde bulunan Allah'a yemin ederim ki ben sizlerin cennet ehlinin üçte biri olmanızı kuvvetle ummaktayım\" buyurdu. Ravi dedi ki: Bunun üzerine biz yine Allah'a hamdettik ve tekbir getirdik. Bundan sonra Resulullah Sallallahu Aleyhi ve Sellem \"Canım elinde bulunan Allah'a yemin ederim ki ben sizlerin cennet ehlinin yarısı olmanızı kuvvetle ummaktayım. Çünkü ümmetIere nispetle sizin durumunuz, siyah öküzün derisi üzerindeki beyaz kıl gibidir, yahutta eşeğin ön ayaklarının iç taraflarında bulunan daire şeklindeki mühür gibidir.\" Fethu'l-Bari Açıklaması: \"Allahu Teala'ın 'Çünkü kıyamet vaktinin depremi müthiş bir şeydir.' sözü.\" Arapçada \"ez-zelzele\" sarsıntı demektir. Kelimenin aslı \"ez-zelel\" kökündendir. \"Ze\" harfinin tekrarlanması buna uyarıda bulunulmak içindir. \"es-SS'a\", esasen zamanın belli bir dilimi demektir. Ancak istiare yoluyla kıyamet gününe \"saat\" denilmiştir. \"Yaklaşan yaklaştı.\" \"Kıyamet yaklaştı.\" \"Azife\", yakınlık anlamına olan \"elezef\" kökünden türemedir. Arapçada \"ezife keza\" demek şöyle yaklaştı anlamınadır. Kıyamete \"azife\" denitmesi yakın olmasından veya vaktinin darlaşmasından dolayıdır. Müfessirler \"ezifet\" fiilinin yaklaştı anlamına geldiği noktasında ittifak etmişlerdir. 'ateşe girecekleri çıkarıp gönder!\" \"el-ba's\" gönderilecekler anlamına \"elmeb'us\" demektir. Bu kelimenin aslı bir idarecinin savaşma ve başka amaçlarla herhangi bir yöne doğru göndermiş olduğu müfreze birlikler demektir. Kelimenin buradaki manası, anlama \"Cehennemlikleri diğerlerinden ayır\" şeklinde yansımaktadır. Adem'e bu görevin verilmesi onun herkesin babası olması ve mutluluğa erişenlerle, bedbaht olanları tanımış bulunmasındandır. Hz. Nebi Sallallahu Aleyhi ve Sellem onu İsra gecesi görmüştü. Sağ tarafında birtakım karaltılar, sol tarafında birtakım kara1tılar vardı. Bu olay İsra hadisinde daha önce geçmişti. ':ateşe gönderilecekler ne kadardır?\" Yani ateşe gönderilecek kimselerin miktarı ne kadardır? Ebu Hureyre'nin naklettiği hadise göre Resulullah Sallallahu Aleyhi ve Sellem \"Ya Rabbi! Ne kadar çıkarayım?\" diye soracaktır. \"Bu (o günkü şiddetli korkudan) çocuğun ihtiyarlayacağı, her gebe kadının çocuğunu düşüreceği, insanlan da -sarhoş olmadıklan halde Allah'ın azabı şiddetli olduğu için- sarhoş bir durumda göreceği n gündür.\" Bu ifadenin zahiri sözkonusu gelişmenin mahşer yerinde beklerken olacağını göstermektedir. Ancak bu vakitte hamilelik, çocuk doğurma ve yaşlılık gibi şeyler olmayacağı ileri sürülerek burada anlaşılması zor bir durum olduğu (istişkal) olduğu ileri sürü!müştür. Buradan hareketle bazı müfessirler bunun kıyamet gününden önce olacağınıiddia etmişlerdir, fakat hadis bunu reddetmektedir. Kirmani bu probleme şöyle cevap vermiştir: Ayetin ifadesi, olayı misal vererek anlatma ve korku salma şeklindedir. Nevevi bu açıklamayı Kirmanl'den önce yapmış \"Burada alimlerin iki şekilde açıklamaları sözkonusudur\" diyerek bunları zikretmiş ve sonra şöyle devam etmiştir: ifadenin takdiri şudur: Kıyametin geldiği anda sıkıntı o dereceye varacaktır ki o esnada kadınlar hamile olsalardı çocuklarını düşürürlerdi. Bu tıpkı Arapların \"esabena emrun yeşibu minhü'l-velldu = başımıza öyle bir musibet geldi ki bebeğin başına gelse saçları ağınrdı\" cümlesine benzer. Bizim kanaatimiz ise şöyledir: Yukarıdaki ifadeyi hakikati üzere yorumlamak da mümkündür. Eğer bir kimse nasıl öldüyse öyle dirilecekse hamile kadın hamile olarak, emzikli emzikli olarak ve çocuk çocuk olarak dirilecektir. K.ıyametin sarsıntısı meydana geldiği zaman ve Adem'e yukarıdaki emir verildiğinde, insanlar da Adem'i gördüklerinde ve kendisine söyleneni duyduklarında öyle bir titremeye kapılacaklardır ki bu korku ile hamile çocuğunu düşürecek, çocuğun başı ağaracak ve emzikli kadın emzirdiği çocuğunu unutacaktır. Bu olayın sura birinci üfürüşten sonra ve ikinci üfürüşten önce olma ihtimali de vardır. Bu. durumda sözkonusu korku o anda mevcut olanlara mahsus olacaktır. \"Fe zake\" ifadesiyle işaret edilen kıyamet günüdür. Gerçeğin böyle olduğu, ayette açık ve nettir. Bu yorumdan kıyametin saati ile insanların mahşerde yerlerini alması ve oradakilerin ayrılması için Adem'e seslenilmesi arasındaki uzun mesafe reddedilemez. Çünkü bu olyların ardarda gelişeceği sabittir. Nitekim Allahu Teala bunu \"O (diriitme) kork6nç bir sesten ibaret olacak, o anda hemen onlann gözleri açılıp etrafa\" mahşer alanına \"bakacaklar\"(Saffat 19) şeklinde anlatmaktadır. Bir başka ayette ise \"çocuklan ak saçlı ihtiyarlara çevirecek o günden kendinizi nasıl koruyabileceksiniz?\"(Müzzemmil 17) denilmektedir. K1sacası dirilme üfürüşünden sonraki korkunç durumların, sarsılm.-aların ve bunun dışında, C8nnet veya cehennemde istikrar hasıl oluncaya ka;i-aÇ meydana gelecek gelişmelerin tümüne birden \"kıyamet günü\"denilmektedir. \"Feştedde zalike aleyhim = oradakilere bu haber ağır geldi.\" Bu cümle ibn Abbas'ın hadisinde \"Bu haber orada bulunanlara ağır geldi ve üzerlerine hüzün ve tasa çöktü\" şeklinde yer almaktadır. Tirmizl'de İmran'ın, İbn Cüd'şln vasıtasıyla Hasan-ı BasrI' den naklettiği haberde ise (Resulullah Sallallahu Aleyhi ve Sellem kıyametin dehşetini anlatırken) \"Feenşeel mu'minCıne yebkCıne = müminler ağlamaya başladılar\" denilmektedir.(Tirmizi, \"Suretu'l-Hac) \"Sizden bir kişiye mukabil Ye'cüc ve Me'cüc'den bin kişi {cehenneme gönderilecektir)!\". Tıybi şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in bu ifadesi, Ye'cüc ve Me'cüc'ün yukarıda zikri geçen sayıya ve tehdide dahilolduğuna işaret etmektedir. Bu da \"cennetliklerin dörtte biri\" ifadesinin bu ümmetin dışında da cennetlikler olduğuna işaret etmesine benzemektedir. Kurtubi şöyle der: \"Min Ye' cüce ve Me'cüce elf\" yani onlardan ve onlar gibi şirk üzere olanlardan bin demektir. \"Ve minküm racül\" yani Nebi Sallallahu Aleyhi ve Sellem'in sahabilerinden ve müminlerden onlar gibi olanlardan demektir. Biz burayı şöyle toplayabiliriz: Kısacası \"minküm\" ifadesindeki işaret her milletten Müslümanlaradır. Nebi Sallallahu Aleyhi ve Sellem buna İbn Mesud hadisinde \"Cennete ancak Müslüman kişi girer\" cümlesi ile işaret etmiştir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 119
			}
		}
	]
}