{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6545,
			"arabicnumber": 6545,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cennet ehline hitaben 'Ey cennet ehfil Artık ebedilik vardır, ölüm yoktur!' Cehennem ehline hitaben de 'Ey ateş ehli! Artık ebedilik vardır, ölüm yoktur!' denilir.\" Fethu'l-Bari Açıklaması: \"Yetmiş Bin Kişinin Cennete Sorgusuz Sualsiz Gireceği.\" Bu hadiste bundan önceki bölümde işaret edilen ayetin ihtiva ettiği taksimin gerisinde başka bir durum olduğuna ve mükelleflerin içinde hiç hesaba. çekilmeyecekler, kolay bir hesapla hesaba çekilecekler ve inceden inceye hesaba çekilecekler olduğuna işaret vardır. \"Bir Nebi Sallallahu Aleyhi ve Sellem yanına bir ümmet\" yani birçok sayıda insan \"alıp geçiyordu.\" \"Ben uzakta büyük bir karaltı gördüm.\" Husayn b. Nemir'in rivayetine göre Nebi Sallallahu Aleyhi ve Sellem \"Ufku kaplamış büyük bir kalabalık gördüm\" demiştir. Bu hadisin metninde geçen \"sevad\", \"beyad\" kelimesinin zıttıdır. Sevad, uzaktan görülen şahıs demektir. 'Ya Cibril! Bunlar benim ümmetim mi'? diye sordum. O da 'Hayır değildir' dedi.\" Husayn b. Nemir'in rivayetine göre ise Resulullah Sallallahu Aleyhi ve Sellem \"Bunların benim ümmetim olma/arını umdum, bana 'Bu kavmi içinde Musa'dır' denildi\" demiştir. '''Onlar ateşle dağlanma tedavisi yapmazlar, rukye yapmazlar, (eşya ve kuşları) uğursuz saymazlar, onlar ancak Rablerine dayanıp güvenirlerdi' dedi.\" Said b. Mansur'un Müslim'de yer alan rivayetine göre .Resulullah Sallallahu Aleyhi ve Sellem \"la yektev6.n = dağlama tedavisi yapmazlar\" yerine \"ve la yerkun = rukye yapmazlar\" demiştir.(Müslim, İman) Şeyh Takıyuddin İbn Teymiye bu rivayeti yadırgamış ve bunun ravisi tarafından bir hata olduğunu ileri sürmüştür. Buna sebep olarak da şöyle demiştir: Rukye yapan yaptığı kişiye iyilik etmektedir. Şu halde nasılolur da bunu terk etmesi talep edilir? Öte yandan Cebrail Nebie, Nebi'e sahabelerine rukye yapmış ve onların da rukye yapmalarına izin vermiş ve şöyle demiştir: \"Kardeşine fayda vermeye gücü yeten bunu yapsın.'' (Müslim, Selam)Faydalı olmak talep edilen bir şeydir. İbn Teymiye şöyle devam etmiştir: Rukye yapılmasını isteyen ise başkasından bir şey istemekte ve onun faydasını ummaktadır. Allah'a tam tevekkül, bu harekete manidir. İbn Teymiye şöyle demiştir: Hadiste söylenmek istenen, yetmiş bin kişinin Allah'a tam bir tevekkülle nitelenmesidir. Bunun neticesi olarak onlar başkasından kendilerine rukye yapmasını istemezler, dağlamakla tedavi yapmazlar ve hiçbir şeyde uğursuzluk kabul etmezler. Bir başkası buna şöyle cevap vermiştir: Sika olan bir raviden gelen fazlalık makbuldür. Said b. Mansur hadis hafızıdır. Buhari, Müslim ona itimat etmişlerdir. Müslim şu rivayetinde ona dayanmıştır. Bir ravinin ziyadeliği, sahih kılma imkanı varken hatalı olduğu söylenmez. İbn Teymiye'nin hatalı kabul ettiği mana başkasından rukye isteyen kimsede mevcuttur. Çünkü o, bunun sebebini şöyle açıklamıştır: Başkasından kendisine rukye yapmasını talep etmeyen kimse, tam bir tevekkül içindedir. Ancak aynı şeyleri ona da söylemek mümkündür. Çünkü başkasına rukye yapan kimsenin tevekkülün tam olması için bunu yapmaması uygundur. Rukyenin Cebrail tarafından yapılmış olması, ortaya attığı iddiayı desteklemediği gibi, Hz. Nebi Sallallahu Aleyhi ve Sellem'in uygulamasında da bunu gösteren bir husus yoktur. Çünkü o teşri ve ahkamı açıklama makamındadır. Burada şöyle denilebilir: Adı geçenlerin rukyeyi ve rukye istemeyi terk etmeleri, bu mesleği kökünden kazımak içindir. Zira bunu yapan kimsenin bu konuda kendi nefsiyle başbaşa bırakılmayacağından emin olunamaz. Aksi takdirde rukye haddi zatında yasak bir iş değildir. Bunun yasak olanı, şirk olanı veya şirke muhtemel alanıdır. Bundan dolayı Hz. Nebi Sallallahu Aleyhi ve Sellem \"Rukyelerinizi bana gösterin, rukyede şirk olmadığı sürece herhangi bir sakınca yoktur!! buyurmuştur. Bu ifade açıklaması Tıb Bölümünde net olarak geçtiği üzere yasaklığın sebebini teşkil etmektedir. \"Onlar uğursuz saymazlar.!! Uğursuzluk saymanın ne demek olduğu Tıb Bölümünde geçmişti. Söylenmek istenen onların cahiliye döneminde Arapların yaptığı üzere herhangi bir şeyi uğursuz saymadıklarıdır. \"Onlar ancak Rablerine dayanıp güvenirler.!! Tevekkül hakkında kısa bir süre önce \"Kim Allah'a güvenirse o, ona yeter''(Talak 3 ) başlığı altında açıklama geçmişti. Kurtubı ve başkaları şöyle der: Sufilerden bir zümre şöyle demiştir: Kalbine Allah'tan başkasının korkusu karışmayan kimseden başkası, \"tevekkül eden\" ismini almaya layık değildir. Gerçek bir tevekkül içinde olan kimseye bir aslan hücum etse bundan çekinmez, hatta Allah kendisine rızkı garanti ettiği için onun peşinde de koşmaz. Ancak çoğunluk bu görüşü kabul etmemiş ve şöyle demişlerdir: Tevekkül, Allah'ın vaadine güvenmek, kazasının mutlaka olacağına kesin olarak inanmak, rızık peşinde koşarak sünnete uymayı terk etmemekle olur. Çünkü yiyecek ve içecek bulmak şarttır. Silah hazırlayarak, kapıyı kapatarak ve benzeri önlemlerle düşmandan kaçınmak gerekir. Bununla birlikte kişi kalben sebeplere bağlanmaz. Aksine sebeplerin bizatihi fayda getirmeyeceğine ve zararı gidermeyeceğine inanır. Tam tersine sebep ve sebebin sonucunun Allah'ın fiili ve her şeyin onun dilemesiyle olduğuna inanır. Kişi sebebe meylettiği va ki olduğunda bu onun tevekkülünü zedeler. Ebü'l-Kasım el-Kuşeyrı şöyle demiştir: Tevekkülün yeri kalbtir. Dışa yansıyan harekete gelince, bu tevekküle mani değildir. Yeter ki kul her şeyin Allah tarafından olduğuna kesin olarak inansın, bir şeyi kolaylıkla ele geçirdiğinde bunun Allah'ın sayesinde olduğuna, herhangi bir şeyi zorlukla ve sıkıntıyla sağladığında bunun da onun tkdiri ile olduğuna inansın. Çalışıp kazanmanın meşruluğuna delillerden birisi BüyÜ Bölümünde geçen Ebu Hureyre had}sidir. Buna göre Hz. Nebi Sallallahu Aleyhi ve Sellem \"Kişinin yediği şeyin en üstu-nü kendi kazancındandır. Davud a.s.\" kendi kazancını yerdi\" demiştir. Allahu Teala da \"Ona savaş sıkıntılarımzdan sizi koruması için zırh yapmayı öğrettik\"(Enbiya 80) buyururken bir başka ayette \"Ey iman edenler! Tedbirinizi alın\"(Nisa 71) buyurmaktadır. \"Ukkaşe b. Mıhsan kendisine doğru ayağa kalktı.\" Ukkaşe İslama ilk girenlerdendi. Künyesi Ebu Mıhsan' dır. O Bedir savaşına katılmış ve orada çarpışınıştır. Tarihçi İbn İshak şöyle der: Bana ulaşan habere göre Nebi Sallallahu Aleyhi ve Sellem ''l\\rapların içinde en hayırlı süvari Ukkaşe' dir\" demiştir. İbn İshak bir de şu tespiti yapar: Ukkaşe, Bedir günü çok şiddetli bir şekilde• çarpıştı. Sonunda elindeki kılıcı kırıldı. Resulullah Sallallahu Aleyhi ve Sellem ona kalın bir sopa verdi ve \"Bununla çarpış\" dedi. Ukkaşe onunla çarpışmaya başladı. Nihayet o odun parçası elinde uzun, sert, beyaz bir kılıca dönüştü. Ukkaşe bu kılıçla Allahu Teala fethi nasip edene kadar çarplŞtı. Bu kılıç hicretin 12. yılı Halid b. Velid'le birlikte mürtetlerle çarpışırken şehit düşünceye kadar elinde kaldı. \"Bu konuda Ukkaşe seni geçti.\" \"Ukkaşe seni geçti.\" cümlesindeki hikmet hakkında alimlerin farklı görüşleri sözkonusudur. İbnü'l-Cevzı, Keşfü'l-Müşkil isimli eserde yaptığı nakle göre Ebu Ömer ez-Zahid, Sa'leb diye bilinen Ebü'lAbbas Ahmed b. Yahya'ya bunun sebebini sorunca Sa'leb \"O, münafıktı\" demiştir. İbnü'l-Battal şöyle der: \"Seni geçti\" cümlesinin manası, bu sıfatları elde etmekte seni geçti demektir. Sözkonusu sıfat, tevekküı, herhangi bir şeyi uğursuz saymama ve onunla birlikte sayılan diğer niteliklerdir. Hz. Nebi Sallallahu Aleyhi ve Sellem sahabilerine lütufkar ve kendilerine güzel bir edeble muamele ettiği için kendisinden dua isteyen ikinci kişiye \"Sen onlardan değilsin\" veya \"Sen onların ahlakı üzere değilsin\" dememiştir. İbnü'l-Cevzi şöyle der: \"Bana öyle geliyor ki Hz. Nebi'den bunu isteyen birinci kişi sadıkane bir kalple istemiş ve talebi kabul edilmiştir. İkinciye gelince, ona verilen cevapla bu çeşit talebe son verilmek istenmiş olma ihtimali vardır. Hz. Nebi Sallallahu Aleyhi ve Sellem ikinci şahsa \"evet\" deseydi, ardından bir üçüncü, bir dördüncü kişi ayağa kalkacak ve bunun sonu gelmeyecekti. Herkes de böyle bir duaya layık değildir.\" Kurtubi şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'den ikinci olarak talepte bulunan şahısta Ukkaşe'de bulunan durumlardal! yoktu. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem onun talebini kabul etmedi. Zira kabul etseydi orada bulunan herkes böyle bir taleb e kalkışacak ve bu da zincirleme uzayıp gidecekti. Nebi Sallallahu Aleyhi ve Sellem O kişiye verdiği cevapla bu kapıyı kapatmış oldu. Bu, \"O, kişi münafıktı\" diyenin görüşünden iki açıdan daha uygundur: Birincisi, sahabilerde aslolan münafık olmamaktır. Sahih bir nakil olmadıkça bunun aksi sabit olamaz. İkincisi sahih bir niyet ve Nebie kesin bir inançla tasdik olmaksızın böylesi bir talebin bir insandan çıkması nadir görülen hususlardandır. Dolayısıyla bir münafıktan böyle bir talep nasıl sad ır olabilir? İbn Teymiye de bu anlayışa meyletmiştir. Nevevi, Hz. Nebi Sallallahu Aleyhi ve Sellem'in Ukkaşe hakkındaki duasının kabul edileceğini, diğeri hakkındakinin ise edilmeyeceğini vahiy yoluyla öğrendiği iddiasını sahih kabul etmiştir. \"Ümmetimden bir zümre\" yani cemaatin bir kısmı diğerinin izi üzere yürüdüğü takdirde \"(cennete) girer.\" \"Onlarıri yüzleri ayın ondördüncü gecesindeki parlaması gibi parlar.\" Müslim'in rivayetinde bu cümle \"ayın sureti gibi parlar\" şeklindedir (Müslim, İman) Kurtubi şöyle demiştir: Müslim'in rivayetinde geçen \"ala surati'l-kamer\" ifadesindeki \"es. sura\" vasıf, niteliktir demiştir. Yani onların yüzleri ayın ondördüncügecesindeki olduğu gibi parlar. Buradan cennetliklerin nuriarının derecelerine göre farklı olduğu anlaşılmaktadır. Biz de şunu ekleyelim: Aynı şekilde derecelerine göre güzellikteki vasıfları da farklılık gösterir. \"Bunun üzerine Ukkaşe b. Mıhsan el-Esedı üstünde bulunan siyah-beyaz çizgi li elbiseyi kaldırarak ayağa kalktı.\" Hadis metninde geçen \"nemire\", bedevilerin giydiği siyah beyaz çizgili,yünden yapılmış bir elbisedir",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 134
			}
		}
	]
}