{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"81": "To make the Heart Tender (Ar-Riqaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6593,
			"arabicnumber": 6593,
			"text": "İbn Ebi Müleyke'nin Esma bnt. Ebi Bekir'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Ben hauuz başında olacağım hatta sizden bana gelmekte olanları gözetlerken benim önümde birtakım insanlar yakalanacak. Bunun üzerine ben 'Ya Rab' (Onlar) benden ve benim ümmetimdendir' derim. Bana 'Sen onların senden sonra neler yaptıklarını biliyor musun? VAllahi onlar senden sonra ayak topukları üzerine dönmekten hiç mi hiç ayrılmadılar' denilir.\" Abdullah b. Ebi Müleyke şöyle derdi: \"Ya Rabbi! Biz topuklarımız üzerine dönmemizden yahut dinimizden fitnelere uğratılmamızdan sana sığınırızı\" \"Ala a'kabikum tenkisune\" topuklarınızın üzerine geri dönüyorsunuz demektir. Fethu'l-Bari Açıklaması: \"Ahirette Nebi s.a.v.'e Ait Olacak Olan Havuz.\" Yani Hz. Nebi Sallallahu Aleyhi ve Sellem'in havuzu. \"el-Havd\" kelimesi \"hıyad\" ve \"ahvad\" şeklindedir. Havuz, suyun biriktiği alan demektir. Buhari'nin şefaat hadislerinden ve sıratın kurulacağını ifade eden hadislerden sonra havuz hadislerine yer vermesi, havuza gitmenin sıratın kurulmasından ve üzerinden geçilmesinden sonra olacağına işaret etmek içindir. \"Allahu Teala'ın (Resulüm!) 'Kuşkusuz biz sana keuseri verdik' sözü\" İmam Buhari'nin buna yer vermekle \"Kevser\" kelimesinden maksadın havza dökülen nehir olduğuna işaret etmektedir. Bu, burada yer verdiğimiz yedinci hadiste açıkça görüldüğü üzere havzın ana unsurudur. Kevser suresinin tefsirinde bu konuda daha fazla açıklamayla birlikte Aişe hadisi geçmişti. Yine İbn Abbas hadisi açıklanırken kevserin \"çok hayır\" anlamına olduğu ifade edilmiştir. el-Muhtar b. Fülfül'ün Kevser hakkında Enes'ten yaptığı nakle göre hadiste havuza Kevser denilmiştir: \"o, ümmetimin üzerine geleceği hauuzdur.\" (Müslim, Salat)Havuzun bizim Nebiimize ait olduğu meşhurdur. Kurtubi el-Müfhim'de Kadi iyad'a tabi olarak şöyle demiştir: Her mükellefin amel etmesi ve tasdik etmesi gereken şeylerden birisi, Allahu Teala'ın Nebii Muhammed'e havzı vermiş olduğudur. Sözkonusu havzın ismi, sıfatı, içecek maddesi toplamı kesin bilgi oluşturan meşhur ve sahih hadislerde yer almaktadır. Zira bu hadisleri Hz. Nebi'den otuz civarında sahabi rivayet etmiştir. Bu ravilerin yirmi kadarı Buhari ve Müslim'in, kalanı diğer hadis kitaplarının ravileridir. Bu da hadisin naklinin sahih, ravilerinin meşhur olduğunu gösterir. Sonra bu hadisi sözü geçen sahabilerden tabiun ve onların benzerİ, onların ardından da onların kat kat fazlası ravi nakletmiştir Bunun sabit olduğuna selef ve haleften ehl-i sünnet ittifak etmişlerdir \"Ve le yurfeanne = Sizlerden birtakım adamlar kaldırılacaklar\" yani Allah kendilerini göreyim diye onları bana açık edecektir. \"Sümme le yuhtelecunne =benim önümden sürüklenecekler\" yani önümden çekilecekler veya benden çekilip alınacaklar. \"Kokusu miskten daha hoştur.\" Müslim'in Ebu Zerr ve Sevban'dan yaptığı nakilde \"baldan daha tatlıdır\"(Müs!im, Fadail) cümlesi de yer almaktadır. Aynı cümle Ahmed'in, Ubeyy b. Kab'dan yaptığı rivayette de yer almaktadır. Tirmizl'de İbn Ömer'in naklettiği hadiste ise \"Suyu kardan daha soğuktur\" ifadesi geçmektedir. \"Bardakları da gökyüzünün yıldızları gibi çoktur.\" Bundan sonraki Enes hadisinde \"Muhakkak ki o havuzda semanın yıldızları sayısınca ibrikler vardır\"• cümlesi yer almaktadır. Bölümün sonlarına doğru gelen el-Müstevrid hadisinde ise \"Orada yıldızlar gibi kablar görülür\" denilmektedir. \"Her kim ondan\" bardaklardan \"içerse\" Küşmıhenı'nin rivayetinde \"her kim ondan\" havuzdan \"içerse\" denilmektedir. \"Ben suhkan, suhkan derim.\" Suhkan \"bu' den = uzak olsunlar\" anlamınadır. Kelimenin \"suhkan\" şeklinde mansub olması, başında \"elzemehu'l-lahu zalike = Allah bunu onların başına getirsin\" şeklinde bir gizli WL olmasından dolayıdır. \"Bir zümre görürüm. Nihayet onları tanıdığım zaman benimle onlar arasından bir adam ortaya çıktı ve onlara 'geliniz!' dedi.\" Bu ifadede yer alan \"adam\" kelimesinden maksat, buna \"görevli melek\" demektir. \"Senden sonra bunlar kıçları üzerine dönüp dinlerine arkalarına çevirerek gerisin geri dinden çıkmışlardır.\" Yani arkalarına geri dönmüşlerdir. 'Ancak çobansız yolunu şaşıran deve sürüsünden yolunu bulanlar misali bunlardan da\" yani havuza yaklaşan ve neredeyse oraya varmak üzere olanlardan da (tek tük) \"cehennemden kurtulanlar olabilir!\" Ancak onlar havuzdan geri çevrilirler. Hadis metninde geçen \"el-hemel\" çobansız deve sürüsü demektir. Bu, onların içinden havuza çok az kimsenin geleceği anlamına gelir. Zira deve sürüsü içinde çobansız olanı diğerlerine nispeten azdır",
			"grades": [],
			"reference": {
				"book": 81,
				"hadith": 181
			}
		}
	]
}