{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"82": "Divine Will (Al-Qadar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6595,
			"arabicnumber": 6595,
			"text": "Enes İbn. Malik r.a. Nebi Sallallahu Aleyhi ve Sellem'in şöyle dediğini nakletmiştir: Allah rahme bir melek gönderir, melek şöyle der: \"Ey bu ceninin Rabbi, ey bu rahme tutunan embriyonun Rabbi, ey bu bir çiğnemlik etin Rabbi.\" Allah bu cenini yaratmak istediyse o zaman melek şöyle der: \"Ey erkeğin veya dişinin Rabbi, bu varlık bedbaht mı, mutlu mu? Rızkı nedir? Eceli ne zamandır?\" Bunun üzerine o kişi henüz anne karnında iken bunlar yazılır. Fethu'l-Bari Açıklaması: Ebu''I-Muzaffer es-Sem'anı şöyle demiştir: Bu konuyu anlamanın yolu, kitap ve sünnetle yetinmek, salt akıl ve kıyasa dayanmamaktır. Bu konuda kitap ve sünnetle yetinmeyen dalalete düşer, hayret ve şaşkınlık içinde kalır. Kalbi mutmain olmaz. Çünkü kader Allah'ın sırlarından biri olup her şeyi bilen ve her şeyden haberdar olan Allah'a ait bir bilgidir. Allah kendisi dışında herkesle bu bilgi arasına perde koymuş, kendi bildiği bir hikmetten dolayı da bu bilgiyi yarattığı varlıkların akıl ve marifetlerinden uzak tutmuştur. Bu hikmeti hiçbir Nebi Sallallahu Aleyhi ve Sellem ve melek bilememiştir. Kader sırrının insanlara ancak cennete girdikleri zaman açıklanacağı cennete girmeden bu sırrın ortaya çıkmayacağı söylenmiştir. İmam Müslim, Tavus'tan şöyle rivayet etmiştir: Hz. Nebi Sallallahu Aleyhi ve Sellem'in ashabından bazı kimselerin her şey bir kaderledir, dediklerini duydum. Abdullah İbn. Ömer de Hz. Nebi Sallallahu Aleyhi ve Sellem'den naklen acizlik ve akıl dahil her şey bir kaderledir, demiştir. Akıl, acizliğin zıddıdır. Hem dünya hem ahiret işlerinde maharettir. Bu sözün anlamı, Allah'ın ilmi ve iradesi olmadan hiçbir şeyin vücuda gelemeyeceğidir. Fiillerimizi bilip isteyerek yapmış olsak da Allah'ın dilemesi olmaksızın biz bunları gerçekleştiremeyiz. Hadiste de buna işaret edilmektedir. Tavus da bu durumu merfu ve mevkuf rivayetlerle anlatmıştır. Bu rivayetler \"Çünkü Biz her şeyi bir takdir ile yarattık. \"(Kamer, 49) ayetine mutabıktır. Bu ayet Allah'ın her şeyi yaratıp takdir ettiğine delalet etmektedir. \"O her şeyi yaratandır\" ve \"Allah sizi ve yaptıklarınızı yaratandır\" ayetlerinden çok daha açık bir şekilde delalet etmektedir. Selef ve halef alimleri arasında bu ayetin kaderi inkar edenlere karşı nazil olduğu kanaati yaygındır. Selef alimleri\"Hazineleri elimizin altında olmayan hiç bir şey yoktur Biz, onlan ancak belli bir miktar ile indiririz\"(Hier,21) ayetinde buyrulduğu gibi, tüm işlerin Allah'ın takdiri ile gerçekleştiğini kesin olarak ifade ederler. Daha sonra bunun gibi bir çiğnemlik et olur: Bunun gibi ifadesinden kasıt bir halden bir hale geçmenin, daha önceki halin süresi kadar olmasıdır. Alaka, donmuş, koyu kandır. İçindeki rutubetten ve yanındakine tutunmasından ötürü alaka diye adlandırılmıştır. Sonraki halin bir çiğnemlik et olarak adlandırılması ise çiğnenebilecek bir et parçası büyüklüğünde olmasından dolayıdır. Ona dört şeyemredilir: Küşmiheni rivayetinde dört sayısı müzekker olarak zikredilmiştir. Sayılan müphemse sayının müzekker ya da müennes olması caizdir. Ceninin durumu ile ilgili dört hususu yazması emredilmiştir. Adem rivayetinde ise \"Dört kelime yazması emredilir\" denilmiştir. Çoğunluğun rivayeti de böyledir. Kelimelerden kasıt takdir edilenlerdir. Her bir takdir bir kelime olarak adlandırılmıştır. Her bir şahıs için ya bedbahtlık ya da mutluluk yazılır, bir arada bulunmaları mümkün olsa da bir kişi için ikisi birlikte yazılmaz. Çünkü iki şey bir araya gelince hüküm ağır basan istikametindedir. Ardı ardına gelirlerse o zaman da hüküm sondakine göre verilir. Bu nedenle dört hususla yetinilmiş, beşincisi sayılmamıştır. Rızkın yazılmasından kasıt az veya çok olması, haram veya helal olmasıdır. Ecelden kasıt ise ömrün uzun ya da kısa olmasıdır. Amelden kasıt ise salih veya fas it olmasıdır. Bedbaht ya da mutlu olmanın anlamı meleğin, cemnın ömrünü, rızkını, amelini yazması gibi bu iki kelimeden birini yazmasıdır. Bedbaht olmak da mutlu olmak da, rivayetin kalan kısmından anlaşılacağı üzere, kişinin ömrünün sonunda nasılolacağı bakımındandır. Cehennem ehlinin amelini işler: Buradaki '-:\"' harf-i cerri, zaittir. Asıl ifade, harf-i cersizdir. Kişinin amellerinin cehennem ehlinin amellerine benzemesi anlamındadır. Hadisin zahirinden anlaşılan bu kişinin bu amelleri işlemesi ancak ölümüne yakın zamanda tam tersi bir hal üzere olmasıdır. Bu hadis Sehl rivayetinde şöyle nakledilmiştir: İnsanlara cennet ehlinin amellerini işliyormuş gibi görünür.» Dolayısıyla bu rivayet, son anların kötü olmasından bahseden bu başlığın hadisinden farklı olarak, münafık ya da riyakar kimseler hakkında olduğuna hükmedilir. Cennet ehlinİn amelini işler: Sözlü ve fiili inanç ve ibadetler bakımından cennet ehlinin amelini işler. Hafaza melekleri bunları yazarlar, bunların bir kısmı kabul edilir, bir kısmı reddedilir. Yazgı galip gelir: Yazgının galip gelmesi, muhtevasının galip gelmesidir. Burada muzaf (tamlanan) hazfedilmiştir. Yazılı olanların galip gelmesi anlamındadır. Amelleri onun mutlu bir son ile bu dünyadan ayrılacağını gösterirken, yazgı onun bedbaht olarak ayrılacağı yönündedir ve yazılı olan gerçekleşir. Bu durum galip gelmek olarak anlatılmıştır. Çünkü mağlup olanın değil, galip gelenin muradı gerçekleşir. Amel ve yazgı, kazanmak için koşan iki şahıs gibi düşünülecek olursa yazgı kazanır, am el kaybeder. Ebu Hureyre'den rivayet edilen hadiste ise şöyle buyrulmuştur: \"Kişi uzun zaman boyunca cehennemliklerin amelini işler, ancak cennetliklerin ameli ile ölür.\" ' EI-Hattabi şöyle demiştir: Bu hadis mutlu kimsenin bedbaht, bedbaht kimsenin mutlu olabileceğini gösterir. Ancak bu amellerin zahiri itibariyledir. Allah'ın ilminde olan değişmez. Bu hadis insanın son nefesine itibar edileceğini gösterir. İbn Ebi Cemre şöyle demiştir: İyi bir hal üzere olsalar da ölüme yakın nasılolacaklarını bilmemeleri insanların boynunu büken bir durumdur. \"Erkek olsun kadın olsun, kim mü'min olduğu halde salih amel işlerse Biz şüphesiz ona çok güzel bir hayat yaşatırız. Ve bunları elbette işlediklerinin en güzeliyle mükafatlandıracağız.\" (Nahl, 97) ayeti ise bu güzel hal üzere ölenlere mahsustur. Mutlu insanların hayatını yaşayıp bedbaht olarak ölen kimse hakikatte tüm hayatı boyunca Allah katında bedbahttır. Bunun tersi de aynı şekildedir. Buna muhalif olarak varit olan haberler ise bu doğrultuda tevil edilir. Bu hadiste öldükten sonra dirilmenin doğruluğuna dikkat çekilmiştir. Zira bir damla sudan, daha sonra bir alakadan, ardından bir çiğnemlik etten insanı yaratmaya güç yetiren varlık toprak olduktan sonra da bu insana yeniden ruh üfleyip parçalanan azalarını birleştirerek onu diriltmeye kadirdir. O bu adıları bir defada yaratmaya da kadirdi. Ancak hikmeti gereği anneye şefkat göstererek insanı aşamalarla yarattı. Aksi takdirde anne buna alışamayacak, meşakkati artacaktı. O da annenin karnında aşama aşama tamamlanacak şekilde insanı yarattı. Nihayet insan güzel suretli, akıl, anlama ve konuşma becerileri ile donatılıp üstün kılınmış bir varlık oldu. Kendisini yaratana şükretmesi, hakkıyla ibadet ve itaat etmesi, isyan etmemesi gerekliydi. Hadiste amellerin takdirinden önce ve sonra olanlar bulunduğu ortaya çıkmaktadır. Önce olan Allah'ın ilminde var olandır. Sonra olan ise, hadiste belirtildiği üzere, cenin anne karnında iken onun için takdir edilendir. Bu hadisten hareketle dört aydan sonra düşen ceninin cenaze namazı kılınır. Zira artık ona ruh üflenmiştir. Şafii'nin eski görüşü ile Ahmed b. Hanbel ve İshak b. Rahuye'nin meşhur görüşleri bu doğrultudadır. Ahmed b. Hanbel, cenin dört ay on günlük olunca ona ruh üflendiğini bu nedenle bu süre sonunda düşmesi halinde cenaze namazının kılınacağını söylemiştir. Şafiı'nin yeni görüşü ise ceninin her aşamasında ruh bulunduğudur. Doğduktan sonra ağlar, nefes alır ve kıpırdar sonra da bu hayat belirtileri yok olursa ancak o zaman cenaze namazı kılınır, aksi takdirde kılınmaz. Bu hadiste kanaatkar olmak teşvik edilmiş, hırslı olmak yerilmiştir. Rızık takdir edilmişse onu istemek için temennide bulunmanın bir faydası yoktur. Kazanmak meşrudur, çünkü dünya hayatında ilahi hikmetin gerekli kıldığı sebeplerden biridir. Hadisten, amellerin cennete veya cehenneme girme sebebi olduğu sonucu da elde edilir. Bu sonuç \"Hiçbirinizi amdi cennete sokmaz\" hadisiyle çelişmez. Hadiste ölüm anının kötü olmasından Allah'a sığınmak teşvik edilmiştir. Selef ve halef alimlerin hepsi bununla amel etmişlerdir. Abdülhak Kitabu'j-akibet adlı eserinde, iç dünyası dosdoğru olan, dışarıdan bakılınca salih bir insan olduğu görünen kimsenin ölüm anının kötü olmayacağını belirtmiştir. İçinde fesat, şüphe bulunan, büyük günahları ısrarla işleyen, cüretkar kimseye aniden ölüm gelince o zaman şeytanın kendisini teslim alacağını söylemiştir. Bu da kötü son ile ölmenin sadece bir sebebi olur. Bu duruma düşmemek için Allah'a sığınırız. Ölüm anının nasılolacağı insanın çoğunluk ve ağırlıkla nasılolduğuna bağlıdır. Hadisten çıkarılacak sonuçlardan biri de Allah'ın kudretini hiçbir sebebin bağlamayacağıdır. Her şeyancak Allah'ın•dilemesiyle gerçekleşir. Cinsel birleşme çocuğun dünyaya gelişi için yegane sebep değildir. Zira her cinsel birleşme ile çocuk meydana gelmez. Ancak Allah dileyince çocuk olur. Hadisten çıkan bir netice de kesif varlıkların meydana gelmesi için latif varlıkların aksine uzun bir zamana ihtiyaç olduğudur. Ceninin aşama aşama meydana gelmesi ruhun üflenmesinin aksine uzun bir zaman gerektirir. Allah yeri yaratacağı zaman önce göğe yöneldi, kesif olmasından ötürü yeri bırakıp tek parça halinde göğü yarattı, daha sonra parçalara ayırıp yeri var etti. Adem'i yaratacağı zaman ona su ve çamurdan şekil verdi. Bir müddet bekletti, daha sonra ruh üfledi. Hadiste Allah'ın külliyatı bildiği gibi cüz'iyyatı da bildiği açıkça belirtilmiştir. Allah, kişinin halinin ayrıntılı olarak yazılmasını emretmiştir. Hadisten çıkan bir diğer sonuç da Allah'ın kainatı sevip hoşlanması nedeniyle değil, yaratıcısı ve takdir edicisi olarak istediğidir. Hayır ve şerlerin hepsinin, Allah'ın takdiri ve yaratması ile meydana geleceği de bu hadisten elde edilen hükümler arasındadır. Ahmed b. Hanbel ve Ebu Ya'la, Eyyub b. Ziyad tarikiyle Ubade b. el-Velid b. Ubade b. es-Samit'in şöyle dediğini rivayet etmişlerdir: Ubade hasta iken yanına gittim ve bana tavsiyelerde bulunmasını istedim. Şöyle dedi: Kadere, hayır ve şerrin Allah'tan geldiğine iman etmedikçe imanın tadını alamazsın, Allah'ı bilmenin hakikatini idrak edemezsin. Bu da seni günaha düşürecek şeyin doğru yola götürmeyeceğini, doğruya götüren şeyin günaha düşürmeyeceğini bilmendir. Bu hususta \"Bu hal üzere ölmezsen cehenneme girersin\" denilmiştir. Hadiste açıklanan bir diğer husus da kaderin galip, akıbeti n gaip olduğudur. Bu nedenle hiç kimsenin zahire aldanmaması gereklidir. Dolayısıyla dualarda, dinde sebat ve hüsn-i hatime (mümin olarak ölmek) vurgulanır",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 2
			}
		}
	]
}