{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"82": "Divine Will (Al-Qadar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6613,
			"arabicnumber": 6613,
			"text": "İbn Abbas \"Sana gösterdiğimiz o rüyayı ve Kur'an'da lanet edilen ağacı Biz ancak insanlara bir fitne (imtihan) kıldık\" ayeti için şöyle demiştir: Bu, Nebi Sallallahu Aleyhi ve Sellem'e Beyt-i Makdis'e götürüldüğü gece gösterilen rüyaydl. Kur'an'da lanetIenen ağaç ise zakkum ağacıdır. Fethu'l-Bari Açıklaması: \"Sana gösterdiğimiz o rüyayı Biz ancak insanlara bir fitne (imtihan) kıldık. Musannif bu ayetle ilgili İbn Abbas rivayetini zikretmiştir. Bu hadis el-İsra Süresinin tefsirinde yeterince ele alınmıştır. Ayrıca kader bölümünde tekrarlanması imtihandan bahsetmesinden dolayıdır. Bu imtihanı var eden Allah TeaIadır. Musa A.S. da Allah'ın imtihanı ile ilgili fitne kelimesini kullanarak şöyle demiştir: \"Zaten o ancak senin fitnendir. Sen onunla kimi dilersen saptırır, kimi dilersen hidayete erdirirsin.\" (A'raf, 155) Fitne kelimesinin asıl anlamı imtihandır. Ancak daha sonra imtihanın ortaya çıkardığı zorluk anlamında, daha sonra da hoşa gitmeyen şey anlamında kullanılmıştır. Bazen küfür anlamında da kullanılır: \"Fitne katilden beterdir.\" (Bakara, 191, 217) Bazen günah anlamında kullanılır: \"Bilin ki onlar zaten fitnenin ortasına düşmüşlerdir.\" (Tevbe, 49) Bazen yakmak anlamında kullanılmıştır: \"Şüphe yok ki mü 'min erkeklerle mü'min kadınlara (iman ettiler diye) işkence edip (onları yakıp) sonra da Tevbe etmeyenler için, (evet) onlar için cehennem azabı ve onlar için bir de yanma azabı vardır.\" (Buruc, 10) Bazen bir şeyi gidermek, yok etmek anlamında kullanılmıştır: \"Neredeyse seni bile, sana vahy ettiğimizden başkasını Bize karşı uydurasın diye, fitneye düşüreceklerdi\" (İsra, 73) Fitne kelimesi zaman zaman başka anlamlarda da kullanılmaktadır. Burada fitne kelimesi ile kastedilen, asıl anlamı olan imtihandır. Allah en doğrusunu bilir. İbnu't-Tın şöyle demektedir: Bu hadisin Kader bölümünde yer alması, müşriklerin Nebi Sallallahu Aleyhi ve Sellem'in bu rüyasını yalanlayacaklarının Allah' ın takdiri olduğuna işaret etmektir. Bu yalanlama ile onların isyankş.rlığı artmaktadır. Onlar Nebi Sallallahu Aleyhi ve Sellem'in nasılolup da bir gecede Beyt-i Makdis' e gidip döndüğünü söylemişlerdi. Lanetli ağacın varlığı da müşriklerin isyanını arttırmıştır. Onlar ateşte nasıl ağaç olabileceğini sorgulamış, ateşin ağacı yakacağını söylemişlerdi. Allah bu minvalde küfrü ve küfre götürücü etkenleri yaratmıştır. Bu konu Tevhid Kitabında 'Kulların fiillerinin yaratılması' bölümünde değerlendirilecektir. Müşriklerin bu şüpheleri şöyle cevaplandırılabilir: Allah bu ağacı ateşin yakmayacağı bir cevherden yaratmıştır. Cehennem halkının zincirleri, bağları, cehennem bekçileri olan melekler, cehennemdeki yılan ve akrepler de böylebir maddeden yaratılmıştır. Bunların hiçbirinin dünyada bir karşılığı yoktur. Dünya ve ahireti kıyaslayanlar çokça hataya düşerler. Başarıya eriştiren Allah'tır",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 19
			}
		}
	]
}