{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"82": "Divine Will (Al-Qadar)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6618,
			"arabicnumber": 6618,
			"text": "İbn Ömer r.a.'den rivayet edildiğine göre Nebi Sallallahu Aleyhi ve Sellem İbn Sayyad'a: \"Sana bir şey sakladım demiş, İbn Sayyad da (duman demek istedi ama) \"du, du\" demekten daha fazlasını söyleyemedi. Nebi Sallallahu Aleyhi ve Sellem: Zelil ol, kehanetten öteye gidemezsin\" buyurdu. Hz. Ömer: \"İzin ver, boynunu vurayım\" dedi. Nebi Sallallahu Aleyhi ve Sellem ise: \"Bırak, eğer o (deccal) ise sen ona bir şey yapamazsın. (Deccal) değilse öldürülmesinde bir hayır yoktur\" buyurdu. Fethu'l-Bari Açıklaması: Bilin ki Allah kişi ile kalbi arasına girer: Musannif ayette yer alan \"araya girmek\" kelimesini hadiste geçen kalpleri çevirmek\" kelimesi ile açıklamak istemiştir. Ragıp el-Isfahani, buna işaret ederek şöyle demiştir: \"Allah hikmetigereğince, insanın kalbine onu istediği şeyden çevirecek bir his verir.\" İbn Battal ise şöyle demiştir: İbn Ömer hadisinin konubaşlığı ile ilgisi şudur: Ayet Allah'ın küfür ve imanı yarattığına, kafirin kalbi ile ona emrettiği iman arasına girdiğine, Allah takdir etmedikçe kafirin imanı elde edemeyeceğine delalet eder. Aksine Allah imanın zıddını takdir etmiş ve kişi kafir olmuştur. Mümin için de durum buna ters istikamette gerçekleşir. Ayet kulların hayır ve şer tüm fiillerini yaratanın Allah olduğuna delalet eder. Hadiste yer alan \"Kalpleri çevirmek\" sıfatı da aynı anlama gelmektedir. Kulun kalbini imanı tercih etmekten küfrü tercih etme ya da bunun aksi yönünde değiştirir. Allah'ın her fiili adildir. Dalalete düşürüp yalnız bıraktığı kişiyi elde ettiği bir haktan mahrum etmiş değildir. İkinci hadisin konu başlığıyla ilgisi ise, Nebi s.a.v.'in \"(deccal) ise sen ona bir şey yapamazsın\" demesidir. Yani, Allah'ın ilminde bu kimsenin ortaya çıkıp bir şeyler yapacağı var ise Allah'ın ilminde geleceği belli olan birine bir şey yapmaya gücün yetmez. Allah sana bunu yapacak bir güç verse o zaman bu durum kendi ilminde var olanın değişmesi anlamına gelir ki, Allah bundan münezzehtir",
			"grades": [],
			"reference": {
				"book": 82,
				"hadith": 24
			}
		}
	]
}