{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "İbrahim en-Nehaî, Esved bin Yezîd en-Nehai'nİn şöyle söylediğini rivayet etmiştir: \"Biz Aişe (r.anha)'nın yanında namaz'a devam etmenin ve namaz ibadetinin öneminden bahsediyorduk, Bunun üzerine Aişe (r.anha) bize şunları aktardı: Resulullah Sallallahu Aleyhi ve Sellem'in vefatına sebep olan hastalığı günlerinde bir nanaz vakti girdi ve ezan okundu. Resulullah Sallallahu Aleyhi ve Sellem Ebu Bekir'e söyleyin cemaate namaz'ı kıldırsın' buyurdu. Orada bulunanlardan birisi; 'Ebu Bekir pek yufka yüreklidir, namazda kendisini tutamayıp ağlar' deyince Nebi Sallallahu Aleyhi ve Sellem emrini tekrarladı. Orada bulunanlardan biri aynı şekilde Ebu Bekir'in durumunu ifade edince Nebi Sallallahu Aleyhi ve Sellem üçüncü defa emrini tekrar etti ve şöyle dedi; Yusuf'un başını derde sokan siz kadınlar değilmisiniz zaten!? Söyleyin Ebu Bekir'e cemaate namazı kıldırsın!\" Bunun üzerine Ebu Bekir imamete geçip namazı kıldırmaya başladı. Bu namazlardan biri kıldırılırken Nebi Sallallahu Aleyhi ve Sellem kendisini biraz daha iyi hissettiği için cemaat'e katılmak istedi. Ashab'dan iki kişinin kolları arasında mescide girdi. Takatsizliğinden dolayı mübarek ayaklarını yere sürüyerek zorla yürüdüğü sıradaki hali hâlâ gözlerimin önündedir. Resulullah Sallallahu Aleyhi ve Sellem'in geldiğini fark eden Ebu Bekir geri çekilmek istedi. Fakat Nebi Sallallahu Aleyhi ve Sellem: Olduğun yerde dur anlamında eliyle işaret buyurdu. Sonra Resulullah Sallallahu Aleyhi ve Sellem Ebu Bekir'in yanına kadar gidip oraya oturdu.\" Bu rivayetle ilgili olarak A'meş'e şöyle bir soru yönelttiler: \"Resulullah Sallallahu Aleyhi ve Sellem Ebu Bekir (r.a.)'in yanına oturup namaza durduğunda Ebu Bekir, Nebi Sallallahu Aleyhi ve Sellem'e, cemaat ise Ebu Bekir'e uymuştu, değil mi?\" A'meş bu soruyu kafasını evet anlamında sallayarak onaylamıştır. Ebu Dâvud, Şu'be - A'meş senediyle bu rivayetin bir kısmını nakletmiştir: Söz konusu rivayetle ilgili olarak Ebu Muaviye'den nakledilen ek bir bilgi de şöyledir: \"Resulullah Sallallahu Aleyhi ve Sellem Ebu Bekir (r.a.)'in sol tarafına oturdu. Bu sırada Ebu Bekir namaza ayakta devam ediyordu",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 58
			}
		}
	]
}