{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6657,
			"arabicnumber": 6657,
			"text": "Harise İbn Vehb Nebi Sallallahu Aleyhi ve Sellem'den şöyle dinlediğini nakletmiştir: \"Size cennet halkının kimler olduğunu söyleyeyim mi? Bunlar zayıf düşürülmüş kimselerdir. Allah adına yemin etseler Allah yeminlerini tutmalarını sağlar. Cehennem halkı ise kaba, batıl yolda başkaları ile mücadele eden, kendini beğenmiş kimselerdir.\" Fethu'l-Bari Açıklaması: Allah Tealanın \"Olanca güçleri ile Allah adına yemin ettiler\" (el-En'am, 61109) buyurması: Ragıb el-Isfahanı şöyle demiştir: \"Kasem yemin demektir. Kasem kelimesi 'kasame' kökünden gelmektedir. 'Kasame' ise maktulün velilerine yemin ettirmektir. Daha sonra bu kelime her tür yemin hakkında kuııanılmıştır. Ragıb şöyle demiştir: (Olanca güçleri ile yemin etmek) yemin ederken kapasitelerinin son haddinde yemin etmeye çalışmak anlamındadır. ibnu'l-Münzir şöyle demektedir: Allah adına yemin ettiğini söylemek ile sadece yemin ettiğini söylemek ile ilgili ihtilaf edilmiştir. Bazıları sadece yemin ettiğini söylemenin de yemin kastedilmese dahi yemin anlamına geleceğini belirtmişlerdir. Bu görüş İbn Ömer ve ibn Abbas'tan nakledilmiştir. İbrahim en-Nehaı, Süfyan es-Sevri ve Kufeliler bu kanaattedir. Çoğunluk ise, niyet edilmemişse, bunun yemin olmayacağı kanaatindedirler. İmam Malik şöyle demiştir: \"Aııah'a yemin ederim demek yemindir. Ancak sadece yemin ederim demek ancak yemine niyet edilmişse yemindir.\" imam eş-Şafiı şöyle demiştir: \"Sadece yemin ettiğini söylemek niyet etse dahi yemin sayılmaz. Allah'a yemin ederim demek de niyet edilirse yemindir.\" ibnu'l-Münir el-Haşiye'de şöyle demiştir: Buhari, 'yemin ederim' demenin yemin olmayacağını söyleyenlerin görüşünü reddetmektedir. Bu hususta, ilgili ayeti nakletmiştir. Bu ayette Allah adına kasem etmekten söz edilmiştir. Böylelikle kasem lafzı ile Allah lafzının bir arada zikredilmesinin hadislerde şart koşulmadığını açıklamıştır. Hadisler sadece kasem lafzının yemin anlamına geldiğine işaret etmektedir. Yemin eden kimsenin dışındakiler için de yemini yerine getirmek menduptur. Bu hadisin diğer bölümleri el-Cenaiz kitabında yer almaktadır. Hadiste söz edilen zayıf kimseler fakirler ve zayıf düşürülenlerdir. Bu hadisin şerhi Nur Süresinin tefsirinde genişçe anlatılmıştır. (Aııah adına yemin etseler Allah yeminlerini tutmalarını sağlar.) Bir şey yapmak için yemin etseler Aııah keremi ile onun yeminini yerine getirmesini ister, yeminınin gereğini ona yaptırır, böylece o da yeminini yerine getirmiş olur. Bu ifade kişinin duasının kabul edilmesi anlamında kinayedir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 36
			}
		}
	]
}