{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6674,
			"arabicnumber": 6674,
			"text": "Cündeb şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem bayram namazı kıldırdı, ardından hutbe okudu, sonra şöyle buyurdu: \"Kim kurban kestiyse onun yerine bir daha kessin. Kesmeyenler de Allah'ın adıyla kessinier.\" Fethu'l-Bari Açıklaması: (Unutarak yemini bozmak) Kefaret gerektirir mi gerektirmez mi? , \"Hata etmenizden dolayı size bir günah yoktur\" Kasıtlı olmadıkça unutarak ya da zorlanarak yemininden dönen kişinin yemininin bozulmuş sayılmayacağı fikrini ileri sürenler bu ayete dayanmışlardır. Bu ayete dayanılarak kişiye şer'i anlamda yeminden dönme fiili nispet edilmemiştir. Zira ayette kişi böyle bir fiili işlememiş kabul edilerek haram hükmü kaldırılmıştır. Selef alimleri bu konuda farklı görüşler ileri sürmüşlerdir: Boşama ve köle azadı yukarıdaki hükümden istisna edilmiştir. Bilmeden ya da unutarak dahi olsa bunlardan dolayı kefaret gerekir. Ancak yeminler konusunda unutma ya da bilmemek söz konusu ise kefaret gerekmez. İmam Şafii'den ve Ahmed İbn Hanbel'den nakledilen bir rivayet bu yöndedir. Şafiler'in tercih edilen görüşüne göre ise boşama, köle azadı ve yeminler bu konuda eşittir ve unutma söz konusu ise hiç biri için kefaret gerekemez. (Bunlarla amel etmedikçe ve bunlardan söz etmediği sürece) İsmalll şöyle demiştir: Bu hadiste unutmaktan söz edilmemiştir. Burada insanın hatırına gelenler kastediimiştir. Buhari'nin kastı, unutmaktan kaynaklanan davranışlara müsamaha ile bakmaktır. Çünkü unutmak kalbin amellerindendir. Kirmani şöyle demiştir: Buhari hata ve unutma ile vesveseyi kıyaslamıştır. Aynı şekilde alışkanlık haline getirmek söz konusu değilse hata ve unutmaya itibar edilmez. Unutan ve yanılan bunu alışkanlık haline getirmiş olmamalıdır. Hadisin zahirinden anlaşılan amelden kastın azalarla amel olmasıdır. Çünkü \"amel etmedikçe\" ibaresi başlangıç aşamasında hiçbir şeyden dolayı sorgu olmayacağı fikrini vermektedir. Bu konuyla ilgili Rikak Kitabının sonlarında yer alan \"Kim bir günah işlemeyi aklına getirirse bu günah yazılmaz\" hadisi etrafında açıklama yapılmıştı. Bu hadiste Hz. Muhammed'in ümmetinin, yüceliğine işaret edilmiştir. Zira Nebi Sallallahu Aleyhi ve Sellem \"Allah bana müsamaha gösterdi\" buyurmuştur. Hadiste ümmetin bu konuda diğer ümmetlerden ayrıldığına işaret edilmiştir. Bazıları unutan kişinin durumunun günahı kasten işleyenle aynı olduğunu söylemiş bunun bizden önceki ümmetler için günah olan hususlardan olduğunu söylemişlerdir. Müslim'de Ebu Hureyre'den nakledilen •bir rivayet bu durumu desteklemektedir: \"Nefislerinizde olanı gizleseniz de açıklasanız da Allah ondan dolayı sizi hesaba çeker\" ayeti nazil olunca bu hüküm sahabilere çok ağır geldi. Hadiste sahabilerin bu konudaki şikayetlerizikredilmiştir. Nebi Sallallahu Aleyhi ve Sellem bu şikayetler karşısında onlara \"Siz de ehl-i kitap gibi işittik ve isyan ettik mi demek istiyorsunuz? Bilakis işittik ve itaat ettik deyiniz\" buyurdu. Onlar da öyle dediler. Bunun üzerine \"O Nebi Sallallahu Aleyhi ve Sellem, kendisine Rabbinden indirilene iman etti\" diye başlayan ve içinde \"Rabbimiz, unuttuk yahut yanıldıysak bizi sorguya çekme!\" ifadesi yer alan el-Baka ra suresinin son ayetleri nazil oldu. Beşinci hadis Uhut Savaşı'nda Huzeyfe'nin babası el-Yeman'ın öldürülmesi hakkındadır. Bu hadis Menakıb Kitabı'nın sonlarında Uhut Gazvesi ile ilgili bölümde yeterince şerh edilmiştir. Huzeyfe vefat edinceye değin hayırlı bir kimse idi. Yanlışlıkla babasını öldüren müslümanlara \"Allah sizi affetsin\" demesinden ötürü hayırlı bir kimse olmuştu. Ölünceye değin de hayırlı bir kimse olarak kaldı. Hadisin sonunda belirtilen, Huzeyfe'nin üzerinde bu olayın tesirinin kalmasından kasıt bu durumdur",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 52
			}
		}
	]
}