{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6689,
			"arabicnumber": 6689,
			"text": "Alkame b. Vakkas el-Leysi'nin Hz. Ömer'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ameller ancak niyete göredir. Herkesin niyet ettiği neyse eline geçecek olan ancak odur. Kimin hicreti Allah'a ve Resulüne yönelik ise hicreti Allah'a ve Resulünedir. Kimin hicreti de nail olacağı dünyaya (dünya malına) veya evleneceği kadına ise onun hicreti de hicretine sebep olan şeyedir. \" Fethu'l-Bari Açıklaması: \"Yeminlerde Niyetin Esas Olmas!.\" Amellerin niyetlere göre olduğu hadisinin açıklaması Bed'ü'l-Vahy'in baş taraflarında geçmişti. Bu hadisin yukarıdaki başlıkla olan ilişkisi, yeminin amellerden birisi olmasından dolayıdır. Bu hadisten lafızların -Iafızda bunu gerektiren bir şeyolmasa bile- zaman ve mekan açısından niyetle tahsis edilebileceği sonucu çıkarılmıştır. Söz gelimi bir kimse Zeyd'in evine girmeyeceğine yemin etse ve bunun için mesela bir ay veya bir yıl gibi bir süreyi kastetse ya da bir kimse mesela Zeyd'le konuşmayacağına yemin etse ve bunun sadece evi içip geçerli olmasına başka yerler için sözkonusu olmamasına niyet etse birinci durumda eve bir ay veya bir yıl sonra girse yemini bozulmuş olmaz. İkinci durumda da onunla başkasının evinde konuşsa yine bozulmuş olmaz. İmam Şafii ve onun mezhebine uyanlar şu olay için bu hadisi delil olarak almışlardır. Bir kimse karısına \"Şöyle yaparsan boş ol\" dese ve içinden boşamanın sayısına niyet etse bunu açıkça telaffuz etmemiş bile olsa içinden geçen sayı geçerlidir. Aynı şekilde bir kimse karısına \"Şöyle yaparsan bain talakla boş ol\" dese ve bununla üç talakı kastetse kadın bain talakla boş düşer. Buna karşılık daha az bir sayıyı içinden geçirse boşama niyetine uygun olarak ric'i talakla gerçekleşir. Hanefiler her iki surette de muhalif olmuşlardır. Bu hadisten yeminin yemin eden kimsenin niyetine göre değerlendirileceği sonucu çıkarılmıştır. Fakat bu, insan hakları ile ilgili olmayan hususlarda geçerlidir. Zira insan hakları sözkonusu olduğunda yemin, yemini verenin niyetine göredir. Bir kimse, ettiği yeminle bir başkasının hakkına tecavüz ediyorsa bu konuda tevriyeden yararlanamaz",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 66
			}
		}
	]
}