{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6691,
			"arabicnumber": 6691,
			"text": "Ubeyd b. Umeyr'in nakline göre Aişe r.anha şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem Zeynep bnt. Cahş'ın yanında eğlenir ve onun yanında bal şerbeti içerdi. Bunun üzerine ben ve Hafsa, birbirimizle şöyle anlaştık: Nebi Sallallahu Aleyhi ve Sellem ikimizden hangimizin yanına girerse \"Ya Resulallah! meğafir mi yedin, sende meğafir kokusu duyuyorum\" desin diye söz birliği yaptık. Resulullah Sallallahu Aleyhi ve Sellem bu iki eşten birisinin yanına girince eşi bunu ona söyledi. Nebi Sallallahu Aleyhi ve Sellem \"Hayır ben mega/ir yemedim. Yalnız Zeynep bnt. Cahş'ın yanında bal şerbeti içmiştim. Artık bir daha onu içmem!\" diye yemin etti. Bunun üzerine \"Ey Nebi Sallallahu Aleyhi ve Sellem' Eşlerinin rızasını gözeterek Allah'ın sana helal kıldığı şeyi niçin kendine haram ediyorsun?\" ayet i indi. Allahu Teala Aişe ve Hafsa için de \"Eğer ikiniz de Allah'a tövbe ederseniz (yerinde olur)\" buyururken, Nebi Sallallahu Aleyhi ve Sellem eşlerine hayır bal şerbeti içtim dediği için \"Nebi Sallallahu Aleyhi ve Sellem eşlerinden .birine gizlice bir söz söylemişti\" ayeti indi. Fethu'l-Bari Açıklaması: \"Bir Kimsenin Herhangi Bir Yemeği Kendisine Haram Kılması.\" Bu, lecElC nezrine örneklerdendir. Nezr-i lecac kişinin mesela \"Şu yemek veya şu içecek bana haram olsun\" veya \"nezrettim\" ya da \"Allah için şunu yemeyeceğim, şunu içmeyeceğim\" demesidir. Alimlerin görüşleri arasında ağır basan, böyle bir nezrin doğmayacağıdır. Ancak kişi nezrine bir de yemin ekleyecek olursa, bu takdirde yemin kefareti vermekle yükümlü olur. Bu konudaki ihtilaf, \"Resulullah Sallallahu Aleyhi ve Sellem Mariye'yi mi kendine haram kıldı yoksa bal şerbeti içmeyi mi\" şeklinde Talak Bölümünde daha önce geçmişti. İmam Buhari hadise burada yer vererek ikinci ihtimale işaret etmiştir. Bir kimsenin kendisine belli bir yemeği haram kılmasının hükmü, içmeyi haram kllmasH1dan anlaşılır. İbnü'l-Müneyyir şöyle der: Bilginler esasen hela! olan herhangi bir yiyecek veya içecek maddesini kendisine haram kılan kimse hakkında ihtilaf etmişlerdir. Bazı bilginler bu o kişiye haram olmaz, yemin kefareti vermesi gerekir demişlerdir. Iraklı fıkıh bilginlerinin görüşü bu doğrultudadır. Bir grup alim ise yemin etmediği takdirde kefaret vermesi gerekmez demişlerdir. İmam Buhari hadise yer vermek suretiyle bu görüşü tercih ettiğine işaret etmiştir. Çünkü hadiste \"yemin ettim\" cümlesi geçmektedir. Mesruk, Şafiı ve Malik'in görüşü bu doğrultudadır. Fakat İmam Malik kişinin eşini kendisine haram kılmasını istisna etmiş ve bu durumda karısi boş düşer demiştir. İsmail el-Kadı şöyle der: Kadınla cariye arasındaki fark şudur: Bir kimse \"Karım bana haram olsun\" dediği takdirde bu bir ayrılıktır ve kişiyi bağlar. Netice olarak karısı boş düşer. Buna karşılık kişi cariyesine yemin etmeksizin bu cümleyi sarfettiğinde kendi nefsine gerekli olmayan bir şeyi yüklemiş olur. Netice olarak cariyesi kendisine haram olmaz. İmam Şafil'nin görüşü ise şöyledir: Kişi yemin etmediği takdirde üzerine herhangi bir yükümlülük gelmez. Ancak boşamaya niyet ederse karısı boş düşer veyacariyesini aza d etmeye niyet etmişse cariyesi hür olur. İmam Şafil'den böyle bir kimsenin yemin kefareti vermesi gerekir şeklinde bir görüş de nakledilmiştir. 'AIlah'ın size helal kıldığı iyi ve temiz şeyleri (siz kendinize) haram kılmayın. \"(Maide 87) ayetine gelince, İmam Buhari, Cami'inde Sevrl'nin ve onun vasıtasıyla İbnü'lMünzir'in sahih bi'r isnadla İbn Mesud'dan yaptığı rivayete işaret eder gibidir. Bir gün İbn Mesud'un huzuruna bir yemek getirilir. Ancak (sofrada bulunan) birisi onu yemekten kaçınır ve \"Bu yemeği yememek için kendime haram kıldım\" der. Bunun üzerine İbn Mesud \"Yemeği ye ve yeminin için kefaret ver\" der. Ardından bu ayeti \"Ve sınırı aşmayın\"(Maide 87) ayetine kadar okur. İbnü'l-Münzir şöyle der: Kişi yemin etmemiş bile olsa kefaret vermesinin gerekli olduğunu söyleyen bazı alimler Cerm kabilesinden olup, iğrenç bir şey yediği için tavuk etini yemeyi kendisine haram kılan kişi olayı hakkındaki Ebu Musa hadisinde geçen ifadeleri delilolarak almışlardır",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 68
			}
		}
	]
}