{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6704,
			"arabicnumber": 6704,
			"text": "İbn Abbas şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem hutbe okurken güneşte dikilmiş bir adam gördü de onun ismini ve halini sordu. Sahabiler \"O Ebu İsrail'dir, ayakta dikilmeye, oturmamaya, güneşten gölgelenmemeye, konuşmamaya ve bu suretle oruç tutmaya nezretmiştir\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem O zata \"Ona söyle konuşsun, gölgelensin, otursun ve orucunu tamamlasın!\" diye emretti. Fethu'l-Bari Açıklaması: \"Bir Kimsenin Malik Olmadığı Şey İle Masiyet Konusundaki Nezrinin Hükmü.\" İbn Battal'ın şerhinde \"Masiyet konusunda nezr {adak} yoktur\" cümlesi yer almaktadır. İbn Battal şöyle der: İmam Buhari bu konuda Aişe r.anha'nın rivayet ettiği; \"Her kim Allah'a itaat etmeyi adarsa o kişi ona itaat etsin. Her kim de Allah'a karşı masiyet olacak bir iş nezrederse o da ona asi olmasın.\" hadisine, ardından iki oğlu arasında hac yolunda yürümekte olan bir ihtiyarın Nebi Sallallahu Aleyhi ve Sellem'in bunu yapmasını yasakladığından söz eden Enes hadisine, Kabe'yi bir yular veya yulardan başka bir bağ ile tav af etmekte olan ve kendisine yasak getirilen İbn Abbas hadisine, ayakta dikilmeye, oturmamaya, güneşte gölgelenmemeye nezreden ve o hareketine yasaklık getirilen kişi hakkındaki İbn Abbas hadisine yer vermiştir. İbn Battal bu hadislerin kişinin malik olmadığıkonularda nezirde bulunması konusu ile ilgisi olmadığını, bunların masiyet hakkında nezirle ilgili olduğunu söylemiştir. İbnü'l-Müneyyir ise isabetli olanın İmam Buharl'nin yaptığı olduğunu söylemiştir. Çünkü Buhari, kişinin malik olmadığı hususlarda yaptığı nezrin bağlayıcı olmadığını, masiyet konusunda yapılan nezrin bağlayıcı olmamasından çıkarmıştır. Zira kişinin başkasının malik olduğu bir mal konusunda nezirde bulunması, onun izni olmadan mülkünde tasarrufta bulunmak anlamına gelir ki bu da masiyettir. Sözkonusu hadisin lafzı \"Adamın biri Nebi Sallallahu Aleyhi ve Sellem döneminde Büvane denilen yerde bir deveyi boğazlamayı nezretmişti\" şeklindedir. (Ebu Davud Eyman ve'n-nuzur) Aynı hadisi Müslim, esir iken Nebi Sallallahu Aleyhi ve Sellem'in devesine binip kaçan kadının olayının anlatıldığı İmran b. Husayn hadisi olarak nakletmiştir.(Müslim, Nezir) Bu kadını esir edenler kaçtığını fark edince peşine düştüler. Kadın da bunlardan kurtulduğu takdirde sözkonusu deveyi Allah için keseceğine nezretti. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Masiyet konusunda nezir (adak) olmadığı gibi Adem oğlunun malik olmadığı husus/arda da nezir yoktur\" buyurdu. Bilginler bu şekilde nezir (adak) yapan kimseye kefaret gerekip gerekmediği konusunda ihtilaf etmişlerdir. Çoğunluk, gerekmediği görüşünü benimsemiştir. Kendisinden nakledilen bir görüşünde Ahmed b. Hanbel, Sevri, İshak, bazı Şafii alimleri ve Hanefiler ise gerektiği kanaatine varmışlardır. Tirmizi sahabenin bu konuda iki ayrı görüşe ayrıldığını nakletmiştir. Bilginler masiyet konusunda adakta bulunmanın haram olduğu noktasında ittifak etmişlerdir. Onların ihtilafı sadece kefaretin gerekli olup olmadığı noktasındadır. İbn Abbas'ın rivayet ettiği hadise göre bir kimsenin mubah olan sözleri söylemeyip, sükut etmesi Allah'a itaat sayılmaz. Hadise göre yalın ayak yürümek, güneşin altında oturmak gibi kitap veya sünnetten meşruluğuna delilolmayan hareketlerden şu anda değilse bile ilerde insanın eziyet duyacağı her türlü şeyin Allah'a itaat olmadığı anlaşılmaktadır. Netice olarak bu gibi şeyleri yapmaya nezretmek geçerli olmaz. Zira Nebi Sallallahu Aleyhi ve Sellem, Ebu İsrail' e adadığı şeylerden sadece orucunu tamamlamasını emretmiştir. Bu, Nebi Sallallahu Aleyhi ve Sellem'in orucu tamamlamanın ona meşakkat vermeyeceğini bildiği şeklinde yorumlanmıştır. Buna karşılık kendisine ayakta dikilmeyip oturmasını, konuşmasını ve güneşten kaçınıp gölgede durmasını emretmiştir. Kurtubi şöyle der: Ebu İsrailolayı bir masiyeti işlemeye veya itaat sayılmayan bir hareketi yapmaya nezreden kimseye kefaret gerekmediği görüşünü benimseyen çoğunluğu destekleyen delillerin en açığıdır. İmam Malik, kendi naklettiği hadisin açıklamasında Nebi Sallallahu Aleyhi ve Sellem'in ona kefaret vermesini emrettiğini duymadım demiştir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 81
			}
		}
	]
}