{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"83": "Oaths and Vows"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6707,
			"arabicnumber": 6707,
			"text": "Ebu Hureyre şöyle anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem'e birlikte Hayber günü yola çıktık Ne altın, ne gümüş ganimet aldık. Biz oradan birçok mallar (hayvan sürüleri), elbise, eşya ganimeti aldık. Dubeyb oğullarından Rifaa b. Zeyd, Mid'am adında bir köleyi Nebi Sallallahu Aleyhi ve Sellem'e hediye etti. Resulullah Sallallahu Aleyhi ve Sellem onu Vadi'l-Kura'ya gönderdi. Mid'am oraya vardığında Nebi Sallallahu Aleyhi ve Sellem'in eşyasını indirirken kendisine kimin attığı bilinmeyen bir ok isabet etti ve onu öldürdü. İnsanlar \"Cennet ona mübarek olsunı\" dediler. Resulullah Sallallahu Aleyhi ve Sellem; \"Hayır! Hayber gününde ganimetler bölüşülmeden almış olduğu bir örtü şimdi onun üzerinde bir ateş o/up yanmaktadır\" dedi. İnsanlar korktu. Bunun üzerinebirisi bir veya iki ayakkabı tasmasını geri getirdi. Nebi Sallallahu Aleyhi ve Sellem \"Ateşten bir ayakkabı tasması veya iki ayakkabı tasması\" dedi. Fethu'l-Bari Açıklaması: İbn Abdülberr ve onun görüşünde olan bazıları şu görüşü benimsemişlerdir. Ebu Hureyre'nin kabilesi olan Dev's lehçesinde \"el-mal\" kelimesi mal ve kumaş gibi ayn olmayan şeylere denir. Bir grup bilgine göre \"el-mal\" altın ve gümüş gibi ayn denilen maddelere verilen isimdir. Arapların kullanımından bilinen, insanın malolarak mülkiyetine geçirdiği ve malik olduğu her şeye \"mal\" denilir. İmam Buhari attığı başlıkta zikrettiği hadislerle birlikte bu görüşü tercih ettiğine işaret etmektedir. Hz. Ömer'in \"Öyle bir toprak parçası elime geçti ki daha önce bundan daha nefis bir mala sahip olmadım\", Ebu Talha'nın\" Bence mallarımın en sevimlisi Beyruha'da bulunanlardır\" ve Ebu Hureyre'nin \"Ne altın, ne gümüş ganimet aldık\" cümleleri buna örnektir. Bu görüşü Allahu Teala'ın \"Allah'ın geçiminize dayanak kı/dığı mallarınızı aklı ermez/ere vermeyin\"(Nisa 5) ayet-i kerimesi de bu görüşü teyid etmektedir. Çünkü ayette geçen \"mal\" kelimesi insanın malik olduğu her şeyi kapsamaktadır. Dilcilerin \"Araplar mal kelimesini mutlak olarak kullandıklarında nazarlarında şerefli olduğu için sadece deve için kullanırlar\" şeklindeki ifadelerine gelince, bu cümle onların deveden başkasına mal demelerini ortadan kaldırmaz. Araplar deve dışındaki diğer hayvanlara da mal demişlerdir",
			"grades": [],
			"reference": {
				"book": 83,
				"hadith": 84
			}
		}
	]
}