{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6708,
			"arabicnumber": 6708,
			"text": "Ka'b İbn Ucre'nin şöyle dediği nakledilmiştir: Nebi Sallallahu Aleyhi ve Sellem'e geldim. Bana \"yak/aş\" dedi. Ben de yaklaştım. Bana \"Başındaki bit/er sana rahatsız/ık veriyor mu?\" diye sordu. \"Evet veriyor\" diye cevap verdim. Nebi Sallallahu Aleyhi ve Sellem \"Oruç tutarak veya sadaka vererek ya da kurban keserek fidye vermen gerekir\" buyurdu. Fethu'l-Bari Açıklaması: Yukarıda belirtilen hususlara \"kefaret\" denilmesi, günahları örtmesinden dolayıdır. Rağıb konu ile ilgili olarak şöyle bir açıklama yapmaktadır: \"Kefaret\", yeminini bozan kimsenin verdiği şeydir. Bu kelime, adam öldürme ve zıhar kefaretinde de kullanılır. Kelime \"tekfir\" kökündendir. Bu kök, bir fiili örtme ve üzerini kapatma anlamına gelir. Kefareti verilen fiil, hiç yapılmamış gibidir. Allahu Teala bu kelimeyi bir ayette şöyle kullanır: \"Eğer ehl-i kitap iman edip sakınsaydı herhalde (geçmiş) kötülüklerini örterdik. \"(Maide 65) Bu ayetteki \"lekefferna\" kelimesi, izale ederdik, yok ederdik anlamınadır. \"Allahu Teala 'ın 'Yeminin kefCıreti on fakiri doyurmaktır\" İmam Buharl'nin bu ayete yer vermekten maksadı, ayetin tamamıdır. Ayette belirtilen sayıya uymak gerektiği kanaatini taşıyan çoğunluk, bu ayeti delilolarak almıştır. \"On fakire vermek gereken miktarı, bir kişiye verince yeterli olur\" diyenlere karşı bu ayet delil olarak alınmıştır. Bu görüş, İbn Ebi Şeybe tarafından Hasan-ı BasrI'den nakledilmiştir. \"İbn Abbas, Ata ve İkrime'nin şöyle dedik/eri nak/edilmiştir: Kur'an-ı Kerim'de \"ev=veya\" ev=veya\" harfi ile belirtilen hüküm/erde mükellefmuhayyerdir\" İbn Battal şöyle der: Bu, alimler arasında üzerinde görüş birliği edilen bir husustur. Bilginler fakire ne kadar yedirileceği konusunda ihtilaf etmişlerdir. Çoğunluğun kanaatine göre her bir fakire Nebi Sallallahu Aleyhi ve Sellem'in müddü ile bir müd buğday verilmelidir. İmam Malik, Medine'li fakirlere verilecek buğday cinsinin farklı olduğu kanaatine varmış ve onlar açısından -başka şehirlerin aksine- ortalama geçimleri olacağı gerekçesiyle tükettikleri buğdayı esas almıştır. Ona göre her bir belde halkı açısından itibar edilmesi gereken, ortalama geçimin sağlandığı buğday cinsidir. İbnü'l-Kasım, bu konuda İmam Malik'e muhalefet etmiş ve çoğunluğun yanında yer almıştır. Kufeliler verilmesi vacip olanın yarım sa' buğdayolduğu kanaatine varmışlardır. Birinci görüşün delili, Resulullah Sallallahu Aleyhi ve Sellem'in Ramazanda oruçlu iken eşiyle ilişkiye giren kişinin kefareti hakkında her bir fakire bir müd verileceği yolundaki emridir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 1
			}
		}
	]
}