{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6711,
			"arabicnumber": 6711,
			"text": "Ebu Hureyre şöyle demiştir: Adamın biri Resulullah Sallallahu Aleyhi ve Sellem'e gelerek \"mahvoldum\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Derdin nedir?\" diye sordu. Adam \"Ramazan günü eşimle oruçlu iken ilişkiye girdim\" dedi. Nebi Sallallahu Aleyhi ve Sellem \"Bir köleyi özgürlüğüne kavuşturacak mali gücün var mı?\" diye sordu. Adam \"Hayır\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"İki ay peşpeşe oruç tutabilir misin?\" dedi. Adam \"Hayır\" cevabını verdi. Nebi Sallallahu Aleyhi ve Sellem \"Altmış fakiri doyurmaya gücün yeter mi?\" diye sorunca, adam \"Doyuracak bir şey bulamam\" dedi. O sırada Nebi Sallallahu Aleyhi ve Sellem'e bir arak (zembil) dolusu hurma getirildi. Efendimiz sallallahu aleyhi ve sellenı \"Bunu al ve sadaka olarak dağıt\" dedi. Adam \"Bizden daha fakirine mi? Medine'nin kara taşlı iki yanı arasında bizden daha fakir bir aile yoktur\" deyince, Nebi Sallallahu Aleyhi ve Sellem \"Onu al ve çoluk çocuğuna yedir\" buyurdu. Fethu'l-Bari Açıklaması: On fakirin doyurulacağı hükmü, Kur'an'ın yemin kefareti ile ilgili ayetinin gereğidir. Bu konudaki ihtilafı az önce belirtmiştik. Yakın fakirle uzak fakirin aynı olması konusunda İbnü'l- Müneyyir şöyle der: İmam Buhari bu konuda daha önce yukarıda zikredilen Ebu Hureyre hadisine yer verdi. Bu hadiste sadece \"Onu çoluk çocuğuna yedir\" emri yer almaktadır. Kefaret bedelini -akrabalara vermek caiz olduğuna göre, akraba olmayan fakirlere vermek evleviyetle caiz olur. İmam Buhari kefareti akrabalam vermenin caizliği konusunda yemin kefaretini Ramazan günü oruçlu iken ilişkide bulunma kefaretine kıyas etmiştir. Kanaatimizce \"Onu çoluk çocuğuna yedir\" emrini, kefaretle ilgili olarak yorumlayan bütün bilginlerin zihnindeki düşünce budur. Nebi Sallallahu Aleyhi ve Sellem'in hadiste adı geçen hurmayı o fakire ailesine harcaması için verdiği ve eli genişleyinceye dek kefaretin zimmetinde borç olarak kalmaya devam edeceği kanaatinde olan bilginlere göre böyle bir kıyas isabetli değildir. Aynı şekilde sözkonusu kıyas, kefaret borcunun fakirden mutlak olarak sakıt olacağı kanaatinde olan bilginlere göre de doğru değildir. Bu konu oruç bölümünde daha önce incelenmiş ve ihtilaflara yer verilmişti. İmam Şafii'nin mezhebi, bir kimsenin, -nafakalarını temin etmekle yükümlü olduğu yakınları hariç- akrabalam kefaret verilmesinin caiz olduğu yönündedir. Bu konunun bir uzantısı da kefaret verilecek kimselerin mümin olmalarının şart olup olmadığıdır. Çoğunluğa göre fakirIerin mümin olmaları şarttır. Rey ehli bilginler buna zimmliere kefaret vermenin caiz olduğu hükmüyle cevap vermişlerdir. Ebu Sevr de onlara katılmıştır",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 4
			}
		}
	]
}