{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6714,
			"arabicnumber": 6714,
			"text": "Enes b. Malik r.a.'den nakledilmiştir: Resulullah Sallallahu Aleyhi ve Sellem \"Ya Rabbi! Onların ölçeklerini, sa'larını ve müddIerini mübarek kıl\" diye dua etmiştir. Fethu'l-Bari Açıklaması: İmam Buhari bu başlıkla din! hüküm gereğince verilmesi gerekli olan şeylerde Medinelilerin sa'ının esas alınması gerektiğine işaret etmiştir. Zira şer'! hükümler öncelikle bu ölçüler esas alınarak getirilmiştir. İmam Buhari bu görüşünü Nebi Sallallahu Aleyhi ve Sellem'in bu konuda onlara bereket duası ile teyit etmiştir. \"Medinelilerin asırdan asıra kullana geldikleri ağırlık ve hacim birimleri\" İmam Buhari bu cümleyle Medine'de müdd ve sa'ının -mütevatir olarak nakledildiği için- kendi zamanına kadar hiç değişmediğine işaret etmektedir. İmam Malik, İmam Ebu Yusuf'la aralarında geçen meşhur olayda bu haberi delil olarak kullanmıştır. Ve Ebu Yusuf sa' ın miktarı konusunda Kufelilerin görüşünden, Me dinelilerin görüşüne dönmüştür. \"İmam Malik bana sordu: Herhangi bir emir size gelse ... \" İmam Malik, bu ifadesi ile muhalifini susturmak istemiştir. Çünküuygulamaya muhalif olma açısıı:dan arttırmayla eksiltme arasında hiçbir fark yoktur. Fitre, yemin kefareti ve fakirleri doyurma gibi müdd üzerinden verilmesi hükme bağlanan başka yükümlülükleri ifa etmede Şam müddünü esas alan bilgin, müddün daha fazlasını almak daha evladır görüşünü delil olarak ileri sürerse ona şöyle cevap verilir: Şari'in takdir ettiğine uymak bereket olarak yeter. Fazla olan miktarı almak suretiyle meşru kılınana muhalefet caiz olsa, o zaman onu eksilterek muhalefet de caiz olur. Uygulamaya muhalif olan, eksiği almaktan kaçındığında İmam Malik ona şöyle der: Bu konuda Resulullah Sallallahu Aleyhi ve Sellem'in müddünün esas alınacağı kanaatinde değil misin? Çünkü sözkonusu üç müdd yani birincisi, sonradan icad edilen Şam müddü -ki bu ondan daha fazladır- ve şu an mevcut değilse de ileride birincisinden daha hafif olarak basılacağı farz edilen üçüncüsü birbirinden farklı olunca birincinin esas alınması daha evla olmuştur. Çünkü meşruluğu tahakkuk eden odur. İbn Battal şöyle demiştir: Bu haberin delil değeri Medinelilerin bu uygulamayı asırdan asıra ve nesilden nesile birbirlerinden miras olarak devralmalarıdır. İbn Battal, Ebu Yusuf'un müd d ve sa'ın takdiri konusunda İmam Malik'in görüşüne döndüğünü ve onun görüşünü esas aldığıri.i ifade etmiştir",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 7
			}
		}
	]
}