{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"84": "Expiation for Unfulfilled Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6722,
			"arabicnumber": 6722,
			"text": "Abdurrahman b. Semura'nın nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Sen (kendiliğinden) bir görevi isteme' Eğer kendin istemeksizin sana görev verilirse o işte (Allah tarafından) yardım görürsün. Eğer talebin üzerine sana görev verilirse işinde yalnız bırakılırsın. Bir şeye yemin edip de başkasını daha hayırlı gördüğünde o daha hayırlı olan işi yap ve yemininin kefaretini ver. \" Fethu'l-Bari Açıklaması: İbnü'l-Münzir bu konuda şu açıklamayı yapmıştır: Rebi'a, Evzai, İmam Malik, Leys ve -Rey ehli hariç- belli başlı beldelerdeki diğer fıkıh bilginlerinin görüşü, yemini bozmadan önce kefaret vermenin geçerli olduğu yönündedir. Ancak İmam Şafii bu hükümden oruç kefaretini istisna etmiş ve \"Oruç kefareti ancak oruç bozulduktan sonra verilebilir\" demiştir. Rey taraftarı olan bilginler ise \"Yemini bozmadan kefaret vermek geçerli değildir\" demişlerdir. Tahavi onların görüşünü \"Yemin ettiğiniz takdirde yeminlerinizin kefareti işte budur\"(Maide 89) ayetine dayandırmıştır. Onlara göre ayetten maksat, \"yemin edip, yemininizi bozduğunuzda ... \" demektir. Muhalif görüşte olan bilginler ise Tahavi'nin yaklaşımını reddetmişler ve şöyle demişlerdir: Tam tersine ayetin takdiri \"yemin edip, yemininizi bozmak istediğinizde ... \" şeklindedir. Bundan daha uygun olanı ise şöyle demektir: Ayetin takdiri bunlardan daha geneldir. Bu iki takdirden biri diğerinden daha iyi değildir. Bu bilginler bir de ayetin zahirine göre kefaret bizatihi yeminle vacip olur demişlerdir. Yemini bozmadan önce kefaret vermenin caiz olduğunu savunan bilginler ise kefaret bizatihi yeminle vacip olsaydı, yeminine sadık kalan kimselerden kefaret, bilginlerin ittifakıyla saklt olmazdı diye cevap vermişlerdir. lyaz şöyle demiştir: Bilginler kefaretin sadece yemini bozmakla vacip olduğu ve yemini bozduktan sonra ertelenmesinin caiz olduğu noktasında ittifak etmişlerdir. İmam Malik, Şafii, Evzai ve Sevri yeminin bozulmasından sonra kefaretin tehir edilmesini müstehap görmüşlerdir. lyaz şöyle devam eder: Bazı Malikiler, günah olan yemin bozma kefaretinin onu bozmadan önce verilemeyeceğini ifade etmişler ve bu tavrın, masiyete yardım anlamı taşıdığını ileri sürmüşlerdir. Çoğunluk ise bu görüşü reddetmiştir. İbnü'l-Münzir şu açıklamayı yapar: Çoğunluğun delili şudur: Ebu Musa ve Abdurrahman hadislerindeki lafızların farklılığı, iki şeyden birisinin muayyen olduğunu göstermez. Yemin edene iki şey emredilmiştir. Bunlardan ikisini birden yaptığında kendisine emredileni yapmış olur. Haber, yemini bozmadan önce kefaret verilemeyeceğini göstermediğine göre geriye bu konuda akıl yürütmekten başka çare kalmaz. Kadi İyad şöyle der: Kefaretin yemini bozmadan önceden verilmesinin caizliği noktasındaki ihtilaf, onun yemini çözmek veya bozmaktan kaynaklanan günahına kefaret vermek için ruhsat olduğu düşüncesine dayanmaktadır. Çoğu nluğa göre kefaret, Allahu Teala'ın yapılan yemini çözmek için getirdiği bir ruhsattır. Bundan dolayı o, yemini bozmadan önce de sonra da verilebilir .. Mazerl'nin bu konudaki görüşü şöyledir: Kefaret için üç şeyden söz edilebilir: a. Yemini etmeden önce. Bu durumda kefaret vermek bilginlerin ittifakıyla geçerli değildir. b. Yemin ettikten ve onu bozduktan sonra. Bu durumda bilginlerin ittifakıyla kefaretini vermek caizdir. c. Yemin ettikten sonra ve bozmadan önce bu durumda ihtilaf sözkonusudur. Bilginler \"Siz/ere binmeniz için deve/er veren ben değilim. Fakat Allah siz/ere bu deve/eri ihsan etmiştir\" hadisi hakkında şöyle demişlerdir: Nebi Sallallahu Aleyhi ve Sellem bu ifade ile onları minnet altında bırakmak istememiş ve nimetin asli malikine izafe etmek istemiştir. Resulullah Sallallahu Aleyhi ve Sellem onları develere yüklerken hiçbir rolünün olmadığını söylemek istememiştir. Çünkü bunu isteseydi daha sonra \"Allah'a yemin ederim ki inşaailah (diye) yemin eder de sonra ondan daha hayırlısını görürsem yeminimin kefaretini verir, o daha hayırlı o/anı yaparım ve kefaret veririm\" demezdL Mazeri şöyle demiştir: \"Siz/eri deve/ere Allah yük/emiştir\" sözünün manası şudur: Sizleri yüklediğim develeri bana veren Yüce Aııahtır. O bunu yapmasaydı benim yanımda sizi yükleyeceğim hiçbir şeyolmazdı. Bazı bilginler ise şöyle demişlerdir: Resulullah Sallallahu Aleyhi ve Sellem'in yeminini unutmuş olması da muhtemeldir. Unutan kimseye herhangi bir fiil izafe edilmez. Ancak Resulullah Sallallahu Aleyhi ve Sellem'in daha önce beyan ettiğimiz üzere Müslim'de yer alan \"Valiahi onu unutmadım\" (Müslim, Eyman) şeklindeki açık ifadesi bu görüşü reddetmektedir. Bazı bilginlere göre Nebi Sallallahu Aleyhi ve Sellem'in onları develere kendisinin yüklemediği, bunu yapanın Allahu Teala olduğu ifadesinden maksat, onun kendisine ihsan ettiği ganimete işarettir. Çünkü bu ganimet, Nebi Sallallahu Aleyhi ve Sellem'in çabasıyla ele geçmediği gibi, kendisi onu istemiyordu ve böyle bir beklenti içinde de değildi. Buna göre hadisin manası şöyle olmaktadır: Sizleri develere ben yüklemedim. Çünkü ilk başta yanımda böyle bir imkan yoktu. Fakat bize nasip ettiği ganimetten dolayı sizleri develere yükleyen Yüce Aııah'tır",
			"grades": [],
			"reference": {
				"book": 84,
				"hadith": 15
			}
		}
	]
}