{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6731,
			"arabicnumber": 6731,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Ben mu'minlere kendi öz nefislerinden daha yakımmdır. Her kim üzerinde borç olduğu halde ölür ve o borcu ödeyecek bir şey bırakmazsa onu ödemek bize aittir. Her kim de bir mal bırakırsa o da kendi mirasçılarına aittir.\" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Devlet başkanı o kişinin borcunu beytü'l-malden ödemeyecek olursa, cennete girmesine engel olunmaz. Çünkü o kişi, beytü'lmaldeki paradan borcu kadar miktara hak sahibidir. Yeter ki borcu beytü'lmaldeki hakkından daha fazla olmasın. Bizim kanaatimiz ise şudur: Anlaşılan bu karşılıklı ödeşmeye girer. Borçlu olan kişi alacağı ve borcu olan şahıs gibidir. Daha önce ifade ettik ki onlar sırattan geçince cennetle cehennem arasında kurulu bir köprüde durdurulup, yaptıkları haksızlık dolayısıyla birbirleriyle ödeşirier. Karşılıklı olarak arınıp, borçlarını ödediklerinde cennete girmelerine izin verilir. İbn Battal'ın \"Cennete girmesine engel olunmaz\" şeklindeki ifadesi, mesela azap görerek durdurulmaz demektir. Doğruyu en iyi Allah Teala bilir. \"Her kim de bir mal bırakırsa, o da kendi mirasçılarına aittir.\" Yani bıraktığı mal varislerine aittir. Abdurrahman b. Ebu Umre'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Her kim de bir mal bırakırsa, mevcut olan asabeleri ona mirasçı olur\" buyurmuştur. Müslim'de el-A'rac vasıtasıyla Ebu Hureyre'nin nakline göre ise \"Bıraktığı ma/ mevcut o/an asabesine aittir\" buyurmuştur (Müslim, Feraiz). Davudi' şöyle demiştir: Hadiste geçen \"asabe\" den maksat feraiz ilminde asabe yoluyla mirasçı olanlar değil, normal varislerdir. Çünkü feraiz ilminde bir terim olarak asabe, mirasçı oldukları ittifakla kabul edilenlerden belli bir hisseye sahip olan varislerdir. Bunlar tek başına kaldıklarında bütün mala mirasçı olurlar ve ashab-ı feraiz hisselerini aldıktan sonra geriye artan malı asabe yoluyla alırlar. Bazı bilginlere göre \"asabe\"den maksad, erkeğin akrabalarıdır. Bunlar ölüye bir babayla -baba, babanın babası, babanın babasının babası... şeklinde de olabilir- bağlanan kişilerdir. Kirmani\"nin görüşüne göre \"asabe\"den maksat, ashab-ı feraiz'den sonra miras alan akrabalardır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 8
			}
		}
	]
}