{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6738,
			"arabicnumber": 6738,
			"text": "İbn Abbas şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in \"Bu ümmetten bir dost edinseydim muhakkak onu (EbU Bekir'i) edinirdim, fakat İslam dostluğu her şeyden daha üstündür -yahut- daha hayırlıdır\" buyurmasına gelince şüphesiz o dedeyi (mirasta) baba derecesine indirmiştir veya dedenin baba gibi olduğuna hükmetmiştir. Fethu'l-Bari Açıklaması: Bu konuda \"dede\"den maksat, baba tarafından olan dededir. Erkek kardeşlerden maksat ise ana-baba bir erkek kardeşlerle, baba bir erkek kardeşlerdir. Ölünün babası varken, dedesinin miras alamayacağı noktasında icma meydana gelmiştir. Oede gerçekten babadır. Fakat ölüye yakınlığı ve uzaklığı itibariyle mertebeleri farklıdır. Bazı alimlere göre bu sözün manası şudur: Oede evlenme haramlığı ve çeşitli iyiliklerin yapılması açısından baba mesabesindedir. Ancak bu iki görüşten meşhur olanı birincisidir. Sıddık olan Hz. Ebu Bekir'in sözüne gelince, Darimi' Müslim'in şartını taşıyan bir senetle bu ifadeyi Ebu Said el-Hudrl'den mevsul olarak \"Ebu Bekir es-Sıddik dedeyi baba (gibi) mütalaa etti\" şeklinde nakletmiştir. Aynı haber Ebu Musa rivayeti ile de sahih olarak nakledilmiştir. Yine Hz. Osman'a dayanan sahih bir isnadla Hz. Ebu Bekir'in dedeyi baba (gibi) mütalaa ettiği rivayet edilmiştir. Hz. Osman'a ait bir ifadede Ebu Bekir'in dedeyi ölenin babası hayatta değilse baba gibi değerlendirdiği nakledilmiştir. İbn Abbas'a dayanan senedi sahih bir rivayete göre Hz. Ebu Bekir dedeyi baba gibi kabul etmiştir. \"Nebi Sallallahu Aleyhi ve Sellem'in sahabileri çok olduğu halde Ebu Bekir'in bu hükmüne muhalefet eden hiçbir kimse olmadığı ile ilgili bir bilgi nakledilmemiştir\" cümlesiyle İbn Abbas zikredilen görüşün delilini güçlendirmek ister gibidir. Çünkü sükuti iemanın delil değeri vardır ve bu konuda sükuti icma meydana gelmiştir. Ölenin babası hayatta değilse, dedenin babanın aldığı mirası alacağını açıkça belirten kişiler arasında müellifin saydıklarından başka Muaz, Ebü'd-Oerda, Ebu Musa, Ubey b. K'ab, Hz. Aişe ve Ebu Hureyre'nin adı zikredilir. İleride geleceği üzere bu görüş, ayrıca -ayrıntıda ihtilaf olmakla birlikte- Hz. Ömer, Osman, Ali ve İbn Mesud'dan rivayet edilmiştir. Tabiundan Ata, Tavus, Ubeydullah b. Abdullah b. Utbe, Ebü'ş-Şa'sa, Şureyh ve Şa'bi'den de bu dOğrultuda görüş nakledilmiştir. Belli başlı beldelere dağılmış fıkıh bilginlerinden (Fukahau'l-emsar) Osman et-Teymi, İmam Ebu Hanife, İshak b. Rahuye, Oavud, Ebu Sevr, el-Müzeni, İbnü's-Süreyc de bu görüşü benimsemişlerdir. Hz. Ömer, Ali, Zeyd b. Sabit, İbn Mesud dede bulunurken erkek kardeşlerin mirasçı olabilecekleri kanaatine varmışlardır. Fakat onlar, ilerde açıklanacağı üzere bunun nasılolacağı noktasında ihtilaf etmişlerdir. İbn Abbas; \"Oğlumun oğlu dururken erkek kardeşlerim bana mirasçı olamazlar. Ben oğlumun oğluna mirasçı olurum\" demiştir. İbn Abdilberr'in ifadesine göre İbn Abbas'ın yaklaşımı şöyledir: Oğlun oğlu oğulolmayınca oğul gibi olduğundan babanın babası da babanın hayatta olmaması halinde baba gibidir . Darimi'nin nakline göre Şa'bi şöyle demiştir: \"Hz. Ömer, de de ye ölünün bir veya iki erkek kardeşi ile birlikte mirastan pay veriyordu. Kardeşler ikiden çok olduklarında onlara mirasın üçte birini paylaştırıyordu. O, ölünün oğlu hayatta olduğunda dedeye mirasın altıda bir veriyordu.\"(Darimi, feraiz) Beyhaki'nin sahih bir senedie nakline göre \"Hz. Ömer, ölenin dedesinin -alacağı miras üçte birden daha çok olacaksa- ana-baba bir erkek ve baba bir erkek kardeşleri ile mirası paylaşacağına hükmetmişti. O, kardeşler çok olduğunda dedeye mirasın üçte birini verirdi. \"(Beyhaki, es-Sünen, VI, 248) Hz. Ali'ye gelince, İbn Ebi Şeybe ve Muhammed b. Nasr'ın sahih bir is na dıa nakillerine göre Şa'bi şöyle demiştir: İbn Abbas, Hz. Ali'ye bir kimse ölüp, geriye mirasçı olarak altı erkek kardeşi ve dedesi kaldığında nasıl hareket edileceğini sordu. Hz. Ali ona \"Oedeyi o kardeşlerden biri gibi kabul edip, mirası yediye böl ve mektubumu at gitsin\" diye cevap verdi. Darimi'nin güçlü bir senetle nakline göre Şa'bi şöyle demiştir: İbn Abbas Basra'da iken Hz. Ali'ye \"Bir dede ve altı kardeşin mirasçı olduğu bir durumla karşılaştım. Ne yapayım?\" diye yazdı. Hz. Ali ona şöyle cevap verdi: \"Dedeye mirasın yedide birini ver. Ondan sonrakilere verme\"(Darimi, Feraiz) Darimi'nin sahih bir senedIe Abdullah b. Seleme'den nakline göre Hz. Ali dedeyi erkek kardeş gibi kabul ediyor ve altıncı mirasçı kılıyordu. Abdullah b. Mesud'a gelince, Darimi'nin sahih bir senetle nakline göre Ebu İshak es-Sebi'i şöyle demiştir: Şureyh'in huzuruna girdim. Yanında Şa'bi, Abdurrahman b. Abdullah b. Mesud bulunuyordu. eı-Aliye adında bizden bir kadının mirasını paylaştırıyarlardı. Kadının kocası, annesi, baba bir erkek kardeşi ve dedesi kalmıştı. Ebu İshak bu olayın devamını şöyle nakletmektedir: Ubeyde b. Amr'ın yanına geldim. -Kufe'de feraizi Ubeyde ve el-Haris el-Aver'den daha iyi bilen kimse yoktur deniyordu.- Ona bu meseleyi sordum. Bana şöyle dedi: \"Eğer istiyorsanız size bu konuda Abdullah b. Mesud'un hükmünü bildireyim. O, (mirası altıya bölüp) kocaya üç hisse yani mirasın yarısını, anneye geriye kalanın üçte birini yani mirasın altıda birini, erkek kardeşe altıda bir ve dedeye altıda bir verdi.(Darimı, Feraiz) Said b. Mansur ve Ebu Bekir b. Ebi Şeybe'nin sahih olan aynı isnadla nakillerine göre Ubeyd b. Nadla şöyle demiştir: Hz. Ömer ve İbn Mesud, erkek kardeşlerle birlikte bulunan dedeye mirastan pay verirlerken altıda birle, kardeşlerle eşit olarak bölüşmekten hangisi lehine ise ona göre hareket ediyorlardı. Aynı haberi Muhammed b. Nasr bu şekilde nakletmiş ve şu ilave de bulunmuştur: Hz. Ömer, Abdullah'a \"Dedeyi mağdur ettiğimizi düşünmekteyim. Bu mektubum sana ulaştığında dedeye erkek kardeşlerle birlikte bulunduğunda mirastan pay ver. Üçte biri ile mirası kardeşlerle eşit bölüşmekten hangisi lehine ise onu ver \"(İbn Ebi Şeybe, el-Musannef, VI, 259) diye yazdı. Sahih bir isnadla Muhammed b. Nasr'ın nakline göre Ubeyde b. Amr şöyle demiştir: Erkek kardeşlerle birlikte bulunduğundadedeye mirasın üçte biri veriliyordu. Hz. Ömer dedeye mirasın altıda birini veriyordu. Sonra Abdullah'a şöyle yazdı: Biz bu dede yüzünden helak olacağımızdan korkuyoruz. Ona mirasın üçte birini ver. Sonra Hz. Ali buraya yani Kufe'ye geldi ve dedeye mirasın altıda birini verdi. Ubeyde şöyle dedi: Hz. Ali ile Ömer'in birlikte verdikleri hüküm, bana ayrı ayrı verdikleri hükümden daha sevimlidir. Zeyd b. Sabit' e gelince, Darimi'nin nakline göre Hasan-ı Basri şöyle demiştir: Zeyd, erkek kardeşlerle birlikte bulunan dedeye mirasın üçte birini veriyordu. (Darimı, Feraiz) İbn Abdilberr şöyle demiştir: Sahabe arasında Zeyd b. Sabit dedenin baba bir erkek kardeşlerle, ana-baba bir erkek kardeşlere denk olduğu görüşünde tek kalmıştır. Birçok fıkıh bilgini bu konuda ona muhalif olmuştur. Çünkü baba bir erkek kardeşler, ana-baba bir erkek kardeşlerle birlikte bulunduklarında mirastan payalamazlar. Dolayısıyla onları öz kardeşlerle bir tutmanın herhangi bir anlamı yoktur. Zira dedenin miras bölüşme durumunda alacağı mirasın azalacağından korkulur. İbn Abbas, Zeyd b. Sabit'e bu durumu sorunca, Zeyd şöyle demiştir: Sen bu konuda nasıl kendi görüşünü söylüyorsan, ben de kendi görüşümü söylüyorum. Tahav! şöyle demiştir: İmam Malik, Şafil ve Ebu Yusuf, beraberinde ana-baba bir erkek kardeşler bulunduğunda dedeye miras verme noktasında Zeyd b. Sabit'in görüşüne katılmışlardır. Onlara göre dedenin kardeşlerle birlikte mirastan ortaklaşa payalması, alacağı üçte birden daha fazla olduğu takdirde onlarla ortaklaşa böıüşür. Eğer üçte bir onun için daha uygunsa onu alır ve baba bir erkek kardeşler dedeyle birlikte bulunduklarında hiçbir şeyalamayacakları gibi, erkek kardeşlerin oğulları da -öz kardeş bile olsalar- mirastan payalamazlar. Dede ve erkek kardeşlerle birlikte ashab-ı feraizden bir kişi bulunduğunda önce onların hissesi verilir, sonra dedeye mirasçılarla birlikte eşit bölüşmek, kalanın üçte birini almak ve mirasın altıda birini almak seçeneklerinde lehine en uygun olanı verilir. Dedenin hissesi Ekderiyye hariç altıda birden eksik olmaz. Tahav! şöyle demiştir: Hişam'ın nakline göre Muhammed b. el-Hasen dede konusunda hüküm vermemiştir. Ebu Yusuf, İbn Ebu Leyla dede konusunda Hz. Ali'nin görüşünü esas alırlardı. Ahmed b. Hanbel'in yaklaşımı ise dedenin (miras açısından) erkek kardeşlerden birisi gibi olduğudur. Mirasın üçte biri dedenin daha çok lehine olduğunda onu alır. Ashab-ı feraizle birlikte bulunduğunda ise onlar hisselerini aldıktan sonra kardeş gibi bölüşme, mirasın kalanının üçte birini alma ya da tümünün altıda birini alma seçeneklerinden lehine en uygun olanı alır. Yukarıda işaret edilen Ekderiyye'ye merbaatü'l-cemaa da denilir. Çünkü onlar mirasçıların dört kişi oldukları noktasında icma etmişler, ancak hisseleri açısından ihtilaf etmişlerdir. Söz konusu mirasçılar, koca, anne, kız kardeş ve dededir. Bu durumda koca mirasın yarısını alırken, anne üçte birini, dede altıda birini, kız kardeş ise yarısını alır. Burada meselenin paydası genişletilerek miras 27 hisse üzerinden bölüştürülür. Buna göre 27 nin 9'unu koca, 6'sını anne, 4'ünü kız kardeş ve 8'ini dede alır. Bazıları bu meseleyi şu şekilde şiir dizelerine dökmüşlerdir. Bilir misin dört kişinin mirastan hissesini? Hesapla her birinin bu mirastan hissesini! Birisi alır tüm serveti n üçte birini (eş), İkincisine verirler geri kalanın üçte birini (anne) Üçüncü de bundan sonra alır kalanın üçte birini (kız kardeş) Nedir hissesi dördüncünün? Yokla bakalım bilgini! (dede)",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 15
			}
		}
	]
}