{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6739,
			"arabicnumber": 6739,
			"text": "İbn Abbas şöyle demiştir: \"Miras olarak kalan mal, çocuklara aitti. Vasiyet de (ilk zamanlar) ana baba için yapılıyordu. Allahu Teala bundan dilediği kısmı nesh etti ve erkeğe iki dişinin payı hisse tahsis etti. Ölen kişinin anne ve babasından her birine altıda bir, hanımına (çocuğu olauğu takdirde) sekizde bir, (bulunmadığında) dörtte bir ayırdı. Kocaya (ölenin çocuğu bulunmadığında) yarısını ve (çocuğu bulunduğunda) dörtte birini verdi.\" Fethu'l-Bari Açıklaması: Koca, hiçbir durumda mirastan mahrum olmaz. Ancak ölen eşin çocuğu bulunduğunda hissesi yandan dörtte bire iner. İmam Buhari bu konuda \"Miras olarak kalan mal, çocuklara aitti. Vasiyet de (ilk zamanlar) ana baba için yapılıyordu ... \" hadisini zikretmiştir. Bu hadis daha önce Vasaya bölümünde geçmişti ve biz orada bu hadisin gerek senet ve gerekse metin yönünden uzun uzun açıklamasını yapmıştık. İbnü'I-Müneyyir şöyle demiştir: İmam Buharl'nin ayet delili konuya gayet açık olarak işaret ettiği halde İbn Abbas hadisini delilolarak göstermesi, ayetin nüzul sebebini belirtmek ve onun tevil edilmeksizin ve nesih de sozkonusu olmaksızın zahiri üzere olduğuna işaret etmek içindir. Süheylı anne ve babadan her birine mirasın altıda birinin tahsis edilmesindeki hikmeti şu şekilde açıklamıştır: Anne ve babaya mirastan eşit şekilde pay verilmesi, hisselerinin bu miktarın altına düşmemesi ve mesela çocuklar çok olduğu takdirde mağdur olmamaları amacına yöneliktir. Ölenin çocukları veya erkek kardeşleri varken anne ve babanın mirastan eşit olarak payalmaları, her birinin ölen çocuklarını yetiştirme ve benzeri fedakarlıklarına karşılıktır. Ölenin çocuğu ve erkek kardeşleri bulunmadığı takdirde baba, anneye nazaran daha fazla payalır. Çünkü onun harcamada bulunma, yardım etme ve benzeri ayrıcalıkları vardır. Annenin bu durumu ise çocuğun hayatta iken ona iyilik açısından babasına üstün tutulması isteği ile telafi edilir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 16
			}
		}
	]
}