{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6744,
			"arabicnumber": 6744,
			"text": "Bera’ şöyle demiştir: En son inen ayet Nisa suresinin sonundaki \"Senden fetva isterler. Deki: Allah; babası ve çocuğu olmayan kimsenin mirası hakkındaki hükmü şöyle açıklıyor\" ayetidir. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Bera hadisine yer vermiştir. Ebu Davud'un elMerasil'inde nakline göre Ebu Seleme b. Abdurrahman şöyle anlatmıştır: Adamın biri Nebi s.a.v.'e gelerek \"Ya Resulallah! Kelale nedir?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Babası ve çocuğu olmayan bir kimsenin varisleri kelaledir\" buyurdu. Müslim'in Sahih'inde nakline göre Hz. Ömer bir Cuma hutbesinde şöyle demiştir: \"Benden sonraya kanaatimce kelaleden daha önemli bir şey bırakmıyorum. Nebi s.a.v.'e kelale hakkında_başvurduğum kadar, başka bir konuda başvurmuş değilim. Sonunda Resulullah s.a.v. parmağı ile göğsümü dürterek şöyle dedi: \"Nisa suresinin sonundaki yazın inen ayet sana yetmiyor mu?\" Kelalenin açıklaması konusunda bilginler ihtilaf etmişlerdir. Çoğunluğa göre kelale, çocuğu ve babası olmayan kişidir. Fıkıh bilginleri, ölünün kızıyla birlikte mirasçı olarak kalan kız kardeşin onunla birlikte mirastan payalıp alamayacağı noktasında ihtilaf etmişlerdir. Bilginler aynı şekilde dedenin baba gibi kabul edilip, onun mirasçı olarak bulunması durumunda kardeşlerin mirastan payalıp alamayacağı noktasında da ihtilafa düşmüşlerdir. İbnü'l-Müneyyir şöyle der: Kelale ayetine dayanarak kız. kardeşlerin asabe olacakları sonucunu çıkarmak son derece hoştur. Feraiz ayetlerinde yerleşen usul şöyledir: Kız kardeşler hakkında zikri geçen şart, mirasçı olup olmadıkları ile ilgili değil, onların alacakları hissenin miktarı ile ilgilidir. Buradan anlaşılan şudur: Miras miktarının değişmesi için şart bulunmadığı takdirde bu sözkonusu usuldendir. Ana-babanın miras paylarını düzenleyen ayette mirasın miktarı değişirken, mirasçı olmak durumu değişmemektedir. Aynı durum koca ve karı için de geçerlidir .. Buna kıyas ederek kız kardeş hakkında şöyle bir kural çıkarılabilir: Ölenin çocuğu olmadığı takdirde kız kardeş mirasın yarısını alır. çocuğu olduğu takdirde miktarı değişir ama mirasçı olma durumu değişmez. Bu konuda asabe olmaktan başka değişikliğin sözkonusu olan bir başka miktar yoktur. Bundan kız kardeşin ölen kişinin oğluyla birlikte bulunması durumunda mirastan payalacağı sonucu çıkarılmamalıdır. Çünkü o bilginlerin İcmaı ile istisnadır. Dolayısıyla onun dış ındakiler aslı üzere kalırlar. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 21
			}
		}
	]
}