{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6748,
			"arabicnumber": 6748,
			"text": "İbn Ömer r.a.'in nakline göre adamın biri Nebi Sallallahu Aleyhi ve Sellem'in zamanında hanımıyla mülaane yaptı ve kadının çocuğunu (n kendinden olduğunu) kabul etmedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem aralarını ayırdı, boşanmalarına hükmetti, çocuğa da kadının nesebini verdi. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlığı kullanmaktan maksadı kadının kocasıyla mülaanesine konu olan çocuğa mirasçı olup olmayacağıdır. İmam Buhari burada İbn Ömer' in mülaane konusundaki muhtasar hadisine yer vermiştir. Bu hadisin açıklaması lian bölümünde daha önce geçmişti. Burada hadise yer verilmesinin amacı \"çocuğa da kadının nesebini verdi\" cümlesidir. Selef bilginleri bir kimsenin nesebini kabul etmediği çocukla arasında miras cereyan etmeyeceği noktasında ittifak etmekle birlikte, onun nesebinin annesine verilmesinin ne anlama geldiği meselesinde ihtilaf etmişlerdir. Hz. Ali ve İbn Mesud kocasıyla mülaane yapmış kadının oğlu hakkında şöyle demişlerdir: \"Bu çocuğun asabesi annesinin asabesidir.Çocuk onlara, onlar da çocuğa mirasçı olurlar.\" Bu haberi İbn Ebi Şeybe rivayet etmiştir. İbrahim en-Nehaı ve Şa'bl'nin görüşü de bu doğrultudadır. Hz. Ali ve İbn Mesud'un sadece çocuğun annesini asabe kabul ettikleri ve malın tamamının ona verileceğini söyledikleri, naklediimiştir. Anne, çocuktan önce öldüğü takdirde çocuğun malı annenin asabesine aittir. Aralarında Hasan-ı Basrl, İbn Sırın, Mekhul, Sevrı, -bir rivayete göre- Ahmed b. Hanbel'in de bulunduğu bir topluluk bu doğrultuda hüküm vermişlerdir. Hz. Ali'den nakledilen bir rivayete göre mülaane yapmış olan kadın çocuğuna mirasçı olur. Anneden olan erkek kardeşleri de anneye mirasçı olur. Mirastan herhangi bir şeyarttığında o kısım da beytü'l-male intikal eder. Zeyd b. Sabit, bilginlerin çoğunluğu ve belli başlı büyük şehirlerdeki fıkıh bilginlerinin (fukahu'l-emsar) ekseriyeti bu görüştedir. İmam Malik şöyle demiştir: Ben ilim ehli bilginleri bu yaklaşımı benimser gördüm. Şa'bl'nin şöyle dediği naklediImiştir: KufeIiler, Hz. Osman zamanında Hicaz' a birisini göndererek mülaane yapmış kadının' oğlunun miras hükmünü sordular. Hicazlılar onlara çocuğun mirasının annesine ve annesinin asabesine kalacağını haber verdiler",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 25
			}
		}
	]
}