{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6750,
			"arabicnumber": 6750,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Çocuk kimin yatağında dünyaya ge/mişse onundur\" buyurmuştur. Fethu'l-Bari Açıklaması: Hattabi ve ona uyarak lyaz, Kurtubi ve başka bilginler şöyle demişlerdir: Cahiliye dönemi insanları cariye alırlar ve onları her gün kendilerine belli bir bedeli ödemekle yükümlü tutarlardı. Bundan dolayı cariyeler fuhuş yoluyla para kazanırlardı. Cahiliye dönemi insanları -nikah bölümünde değindiğimiz üzerezina eden kimseler, çocuğun nesebinin kendilerine ait olduğunu iddia ettikleri takdirde o nesebi iddia edene verirlerdi. Yukarıdaki hadiste adı geçen Zem'an'ın bir cariyesi vardı. Zem'a arasıra bunun yanına gelip gidiyordu. Derken hamile olduğu anlaşıldı. Utbe b. Ebi Vakkas çocuğun kendinden olduğunu iddia ederek kardeşi Sa'd'a onun nesebinin kendisine verilmesini vasiyet etti. Sa'd b. Ebi Vakkas bu çocuk hakkında Abd b. Zem'a ile anlaşmazlığa düştü. Sa'd, Abd'e \"Cahiliye döneminde geçerli kurallaragöre o çocuk kardeşimin oğludur\" dedi. Abd ise \"İslam' da yerleşik kaideye göre o benim kardeşimdir\" cevabını verdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem cahiliye hükmünü ortadan kaldırıp, çocuğun Zem'a'ya ait olduğu hükmünü verdi. lyaz, Hattabl'nin \"çocuğun nesebinin kendilerine ait olduğunu iddia ettikleri takdirde\" cümlesini \"anne bunu itiraf ettiğinde\" şeklinde değiştirmiştir. Kurtubi ise görüşünü her iki yaklaşıma dayandırarak şöyle demiştir: çocuğun nesebi cahiliye döneminde Utbe'ye verilmemişti. Bu ya Utbe'nin çocuğun nesebinin keı;ı.dine ait olduğunu iddia etmediğinden ya da annenin çocuğun Utbe'ye ait olduğunu kabul etmemesinden kaynaklanıyordu. Biz de şunu belirtelim: Nikah bölümünde Hz. Aişe radıyallilhu anhil'dan naklen bir hadis yer almıştı. O hadis cahiliye insanlarının bir olayda annenin babaya nesep vermesini kabul ettiklerini teyid ederken, bir başka olayda kaiflerin nesep verdiklerini gösteriyordu. Sözkonusu rivayet \"Cahiliye döneminde nikah dört çeşitti\" şeklinde başlırdu. Bu hadiste konumuzia ilgili olarak şu ifadeler yer almaktaydı: \"Sayıları onu bulmayan bir topluluk bir araya gelir ve kadının yanına girerek her biri onunla ilişkide bulunurdu. Kadın hamile kalıp, çocuğunu doğurduğunda ve birkaç gece geçtiğinde onlara haber gönderirdi ve erkeklerin tümü kadının yanında bir araya gelirlerdi. Kadın 'çocuğu dünyaya getirdim ey filanca o senin oğlundur' der ve kadının çocuğunun nesebi o erkeğe verilirdi. Erkek bunu reddedemezdi.\" Aynı rivayette şu ifadeler de yer almaktadır: \"Nikah çeşitlerinden birisi de facir ve fahişelerin nikahı idi. Bu tip kadınlar kapıları üzerine bir bez asarlardı. Onları arzulayan erkekler odalarına girerdi. Bu kadınlardan herhangi biri hamile kalıp çocuğunu doğurduğunda kaif1er oraya toplanır, sonra kadının çocuğunun nesebini kaifin uygun gördüğü bir erkeğe verirlerdi. Erkek bunu reddedemezdi.\" Zem'a'nın cariyesi olayına uygun düşen bu son rivayettir. Yukarıda anlatılan kıssadan çocuğa neseb verilmesinin sadece babaya mahsus olmadığı, tam tersine erkek kardeşin baba adına nesep kabul edebileceği sonucu çıkarılmıştır. Şafiilerin ve bir grup fıkıh bilgininin görüşü bu doğrultudadır. Ançak erkek kardeşin mirastan payalıyor olması veya diğer vereselerin bunu kabul etmeleri, çocuğun adı geçen erkekten dünyaya gelmesinin imkan dahilinde olması, çocuğun akıl (akıl sağlığı yerinde) ve ergenlik çağına gelmişse bunu kabul etmesi ve çocuğun babasının bilinmemesi şarttır. Ancak bu görüş, Zem'a'nın Abd'dan başka da mirasçısı olduğu ileri sürülerek tenkit edilmiştir. Bu itiraza Zem'a'nın, Sevde hariç oğlu Abd'dan başka varisi yoktu şeklinde cevap verilmiştir. Zem'a kafir olarak ölseydi kendisine Abd'dan başkası var is olamazdı. Onun Müslüman olması takdirinde ise kendisine kızı Sevde varis olacaktı. Sevde'nin bu konuda erkek kardeşini ve kil etmiş olması veya onun da çocuğu kabul etmiş bulunması ihtimali vardır. İmam Malik ve bir grup fıkıh bilgini nesep kabul etmenin sadece babaya aitolduğu görüşünü benimsemişler ve nesep vermenin sadece Abd b. Zem'a'nın nesebinin verilmesiyle sınırlı olmadığı şeklinde cevap vermişlerdir. Çünkü Nebi Sallallahu Aleyhi ve Sellem'in buna -Zem'a'nın o kadınla ilişkiye girdiğini itiraf etmesi gibi- herhangi bir şekilde muttali olmuş bulunma ihtimali vardır. Nebi Sallallahu Aleyhi ve Sellem çocuğun dünyaya geldiği yatağın sahibine ait olduğu hükmünü vermiştir. Çünkü o \"Çocuk sana aittir\" dedikten sonra \"Çocuk kimin döşeğinde dünyaya gelmişse onundur\" buyurmuştur. Zira dinimiz bu çocuğun zina eden erkeğe verilmesini yasaklayınca, geriye yatak sahibinden başkası kalmamıştır. Bu görüşe vasinin vasiyet edenin çocuğunun nesebini -bunu kendisine vasiyet ettiği takdirde- onun adına almasının caiz olduğu hükmünü delil olarak göstermişlerdir. Bu durumda kendisine vasiyet edilen kişi, vasiyet denin bu konudaki vekili gibi olur. Eşhas bölümünde bu konuda bir başlık geçmişti. Yine bu hükümden cariyenin ilişki sebebiyle döşek olacağı hükmü çıkarılmıştır. Efendi cariyesiyle ilişkide bulunduğunu itiraf ettiğinde veya bu herhangi bir yolla sabit olduğunda cariye ilişkiden sonra çocuk doğuracak bir sürenin ardından doğum yaptığında -tıpkı nikahlı eşte olduğu gibi- çocuğun nesebinin kendine ait olduğunu kabul etmesine gerek kalmaksızın nesep kendiliğinden babaya ait olur. Fakat eş, sırf nikah akdiyle döşk haline gelir. Dolayısıyla nesebin babaya verilmesi için hamileliğin grektirdiği makul bir sürenin geçmesi hariç başka bir şart aranmaz. Çünkü eş cinsel ilişkide bulunmak için nikahlanılır. Dolayısıyla nikah akdi onunla ilişki gibi kabul edilir. Cariye ise böyle değildir. Çünkü cariye başka amaçlarla da edinilir. Onun açısından cinsel ilişki şarttır. Bundan dolayı iki kız kardeşle ilişki caiz değilken, onları cariye olarak mülkiyette bulundurmak caiz görülmüştür. Çoğunluğu oluşturan fıkıh bilginlerinin görüşü bu doğrultudadır. Hanefilerden bir görüşe göre bir cariye efendisinden çocuk doğurup, nesebi kendisine verilmedikçe doğurduğu çocuk onun yatağında doğmuş kabul edileme? Bundan sonra cariyenin doğurduğu her çocuğun nesebi, baba inkar etmedikçe kendisine aittir. Hanefilerden nakledilen bir görüşe göre bir kimse cariyesi ile ilişkide bulunduğunu itiraf etse ve cariyesi hamile kalıp doğurması mümkün olan bir süre geçtikten sonra çocuk doğursa bu çocuk o kişiye aittir. Cari ye bu kişiden önce çocuk doğursa ve sonra efendi çocuğun nesebini kabul etse Hanbelilerde tercih edilen görüşe göre daha sonraki çocuCıun nesebi yeni bir ikrar olmadıkça babaya verilmez. Birinci görüşün tercih e degr olduğu gayet açıktır. Çünkü Zem'a'nın bu cariyeden başka bir çocuğunun daha olduğu nakledilmemiştir. Bütün fıkıh bilginleri cariyenin ancak ilişkiyle yatak ortağı haline geleceği noktasında görüş birliği etmişlerdir. Hadiste geçen \"tesaveka\" fiili, Sa'd b. Ebi' Vakkas Abd b. Zem'a birlikte Hz. Nebi Sallallahu Aleyhi ve Sellem'e gittiler. Her ikisi de adeta diğerini Efendimiz'e doğru iter gibiydi. İbn Abdilberr şöyle demiştir: Hicaz bilginlerine göre cariyenin efendisi onun yanına girip çıktığını ikrar ettiğinde müstefreşe olur. Irak bilginlerine göre ise efendi cariyeden dünyaya gelen çocuğu kabul ettiğinde cariye müstefreşe haline gelir ve dOğuracağı çocuk müşterek yatakta doğmuş kabul edilir. Mazeri' şöyle demiştir: Bu hadisten erkek kardeşin kardeşi adına nesep kabul edebileceği anlaşılmaktadır. Bu, ölenin o kardeşten başka mirasçısı olmadığı takdirde geçerlidir. Zina edene mahrumiyet vardır demek, onun için kaybetme ve mahrumiyet söz konusudur demektir. Çünkü hadiste geçen \"el-aher\" zina demektir. Burada \"y haybet\" kelimesi kişinin nesebinin kendisine ait olduğunu iddia ettiği çocuktan mahrum olması anlamına gelir. Araplar bu duruma düşen kişiye \"lehu'lhacer\" ve \" fihi']-hacer ve't-turab\" veya buna benzer şeyler söylerlerdi. Bazıları hadiste geçen \"i el-hacer\" kelimesinden maksadın recm edilmek olduğunu söylemişlerdir. Nevevi' şöyle demiştir: Bu yaklaşım zayıftır. Çünkü recm muhsan olan kişilere uygulanır. Sonra bir kimsenin recmedilmesi çocuğun nesebinin ondan alınmasını gerektirmez. Burada hadis çocuğun nesebinin iddia eden kişiden alınması konusunda zikredilmiştir. Hanemer \"Bundan sonra Abdurrahman, Sevde vefat edip Allah'a kavuşuncaya kadar onu görmedi\" cümlesine dayanarak Nebi Sallallahu Aleyhi ve Sellem'in çocuğun nesebini Zem'a'ya vermediği sonucunu çıkarmışlardır. Çünkü eğer çocuğun nesebini Zem'a'ya vermiş olsaydı, çocuk Sevde'nin erkek kardeşi olacaktı. Bir kız kardeşe erkek kardeşinin karşısında tesettürde bulunması emredilmez. Çoğunluğu oluşturan fıkıh bilginleri ise Hanemerin bu yaklaşımına şöyle cevap vermişlerdir: Burada tesettür emri ihtiyattan dolayıdır. Çünkü Nebi Sallallahu Aleyhi ve Sellem -sahih rivayet yollarıyla nakledildiği üzere- \"Ey Abd! O senin kardeşindir\" diyerek onun kardeşi olduğuna hükmetmiştir. Çocuk Abd'ın baba bir kardeşi olduğuna göre Sevde'nin de baba bir kardeşi olmaktadır. Fakat Nebi Sallallahu Aleyhi ve Sellem çocukla Utbe arasındaki apaçık benzerliği görünce Sevde'ye ihtiyaten onun karşısında tesettürde bulunmasını emretmiştir. Hattabi' bu hükmün mu'minlerin annelerine ait bir özellik olduğuna işaret etmiştir. Çünkü onlar bu konuda başka kadınlar gibi değillerdir. Hattabi' şöyle demiştir: Benzerlik bazı yerlerde geçerli kabul edilir, ancak ondan daha güçlü bir emare bulunduğunda benzerliğe dayanılarak hüküm verilmez. Fıkıh bilginleri, kız alma yoluyla meydana gelen haramlık (sıhriyyet) doğurması açısından zina ilişkisinin helal yoldan yapılan ilişki hükmü doğuracağı sonucunu çıkarmışlardır. Çoğunluğun görüşü bu doğrultudadır. Rivayetin bu hükme delaleti şöyle olmaktadır: Nebi Sallallahu Aleyhi ve Sellem çocuğun Sevde'nin erkek kardeşi olduğuna hükmettikten sonra onun zina edene benzerliğinden do.layı eşine tesettürde bulunmasını emretmiştir. Kendisinden nakledilen meşhur rivayete göre İmam Malik ve Şafii şöyle demişlerdir: Zina ilişkisinin herhangi bir hukuki sonucu yoktur. Tam tersine zina eden erkek zina ettiği kadının annesiyle ve başka kocadan olan kızıyla evlenebilir. İmam Şafil bu hükme şöyle bir hüküm daha eklemiştir ki İbn Macişun da bu görüşünde kendisine katılmaktadır: Zina eden erkek, zina ettiği kadının doğurduğu kızla -kadın bu kızın o erkekten olduğunu bilse bile- evlenebilir",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 27
			}
		}
	]
}