{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6756,
			"arabicnumber": 6756,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem vela hakkının satılmasını ve hibe edilmesini yasaklamıştır. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlık, Ahmed b. Hanbel ve Taberanl'nin, Sehl b. Muaz b. Enes vasıtasıyla babası Enes'ten naklettikleri şu hadisin ifadesidir. Buna göre Nebi s.a.v. şöyle buyurmuştur: \"Allah'ın öyle kulları vardır ki Allahu Teala onlarla konuşmaz ... \"(Ahmed b. Hanbel, III, 440; Taberani, Mu'cemu'l-kebir, XX, 195) Bu hadiste şöyle bir ifade yer almaktadır: \"Bunlardan birisi bir kavimden iyilik gördükten sonra onların iyiliğini inkar edip, kendilerinden olmadığını iddia eden kimsedir.\" Yukarıdaki başlıkta yer alan hadis, daha önce Fadailu'l-Medine ve el-Cizye bölümlerinde geçmişti. Aynı hadis Diyat bölümünde tekrar gelecektir. Hz. Ali'nin yukarıdaki naklettiği hadisle aynı manada merfu olarak Aişe r.anha'dan şöyle bir rivayet nakledilmiştir: \"Her kim efendilerinden başkalarını mevla edinirse, cehennemdeki yerine hazırlansın.\" İbn Hibban bu hadisin sahih olduğunu belirtmiştir.(İbn Hibban, Sahih, X, 170) Hz. Ali'nin sözünü ettiği sahifede yer alan hadiste dört şeyden söz edilmektedir: Bunlardan birisi yaralamalar ve zekat develerinin yaşlarıdır. Bu hadisin açıklaması Diyat bölümünde gelecektir. Orada bu develerin haraç veya zekat devesi olduğu ya da bundan daha geniş bir kapsamda ele alınacaktır. Sözkonusu sahifedeki ikinci hüküm Medine'nin harem olduğudur .. Bunun açıklaması geniş bir şekilde Hac bölümünün sonlarında Medine'nin fazileti bölümünde geçmişti. Hz. Ali'nin elindeki sayfada yer alan üçüncü hüküm \"Her kim başka bir kavmi veli edinirse\" ifadesidir. Burada konumuzia ilgili olan kısım, bu cümledir. Hadisteki \"Efendilerinin izni olmadan\" şeklindeki ifadeye gelecek olursak; hadiste en alt tabakadan bir azadiının, en üst tabakaya mensup bir başka efendinin azadlısı olduğunu iddia etmesi haramdır. Çünkü bu tavır, nimete nankörlük, vela ve akile sebebiyle doğan miras hakkını zayi etme ve bunun dışında başka sakıncalara yol açar. İbn Vehb'in nakline göre İmam Malik, Muvatta'ında bu hadisi delilolarak almıştır. Sözkonusu eserde yer alan rivayet şöyledir: İmam Malik' e velasının dilediği kişiye ait olması şartıyla kendisini efı;mdisine satan k?lenin durumu sorulunca o bunun caiz olmadığını söylemiş ve ıbn ümer hadisini bu görüşüne delilolarak göstermiştir. Sonra şöyle demiştir: Yasaklanan hibe işte budur.(Muvatta, itk ve'vela) Ata b. Ebu Rebah bu hadisin mefhum-u muhalifini almak suretiyle kaide dışı davranmıştır. Abdurrezzak'ın nakline göre İbn Cüreyc şöyle demiştir: Bir kimsenin kölesine velasını dilediği kimseye vermesine müsaade etmesi caizdir. Ata bu hükmü verdikten sonra sözkonusu hadisi delil olarak göstermiştir. İbn Battal ve bir grup fıkıh bilgini, Ata'nın dediğinin aksi görüşü savunmuş ve şöyle demişlerdir: Hz. Ali'nin rivayet ettiği hadis, \"Geçim endişesiyle çocuklarınızın canına kıymayın\"(İsra 31) ayetinde olduğu gibi genel uygulamaya uygun olarak ifade edilmiştir. Zira bilginler, ister geçim endişesiyle, ister başka bir gerekçeyle bir kimsenin çocuğunu öldürmesinin haram olduğu konusunda görşü birliği etmişlerdir. Yukarıda ifade edilen hadis, velanın satış ve bağışlanmasını yasaklayan hadisle mensuhtur. İbn Battal şöyle demiştir: Hadisten azad edilmiş bir kölenin filan oğlu filanca yazıp, adını ve kendisini azad eden efendisini yazmasının caiz olmadığı hükmü anlaşılmaktadır. Buna karşılık, filancanın mevlası filanca yazmalıdır. Fakat aza d edilen kişinin Kureyşli ve buna benzer başka bir yere mensup olduğunu yazabilir. İbn Battal şöyle devam eder. En uygunu azad edilen kişinin bunu da açıkça belirtip, ve!a itibariyle Kureyşli veya onların azadlısı gibi bir ifade kullanmasıdır. Hadisten Müslüman bile olsalar fasıklara genellikle lanet okumanın caizliği anlaşılmaktadır. Hz. Ali'nin sözünü ettiği sahifede yer alan dördüncü hüküm ise \"Müslümanların zimmetinin bir olup, statü itibariyle en düşük olan bir ferdinin eman verebileceğidir.\" İbn Battal şöyle der: Bilginler nesebi bir kimseden bir başkasına çevirmenin caiz olmadığı noktasında görüş birliği etmişlerdir. Velanın hükmü, nesebin hükmüyle aynı olduğuna ve nesep bir kişiden bir başkasına intikal edemediğine göre vela da geçemez. Cahiliye döneminde insanlar ve layı satış yoluyla veya başka bir yolla nakledebiliyorlardı. Dinimiz bunu yasaklamıştır",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 33
			}
		}
	]
}