{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6768,
			"arabicnumber": 6768,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Sakın babalarınızdan yüz çevirip uzaklaşmayınız! Her kim babasından yüz çevirip onu terk ederse nankörlük etmiş olur\" buyurmuştur. Fethu'l-Bari Açıklaması: İmam Buharl'nin bu başlıktan maksadı, daha önceki başlıkta açıkça belirtildiği üzere babasından başkasının çocuğu olduğunu iddia edenin günahını vurgulamaktır. Ya da bu başlığın \"günah\" kelimesine yer verilmeksizin mutlak olarak söylenmesi, içerisinde nankörlük ve cennetin haram olması gibi kelimeler dolayısıyla tehdit bulunmasından dolayıdır. Dolayısıyla bu mana, hadisi açıklamaya çalışan kimselerin düşünce ve görüşlerine bırakılmıştır. Müslim'de, Hüşeym'in Halid el-Hazza' dan naklettiği bir rivayet şöyledir: \"Ziyad'ın nesebi kabul edilince, Ebu Bekre ile karşılaştım. Ona \"Bu yaptığınız nedir? Ben Sa'd b. Ebu Vakkas' i her kim babasından başkasının -onun kendi babası olmadığını bile bile- çocuğu olduğunu iddia ederse bu kişiye cennet haramdır\"(Müslim, İman) derken işittim. Ebu Bekre şöyle demiştir: Ben de bu hadisi Resulullah Sallallahu Aleyhi ve Sellemiden duydum. Burada adı geçen Ziyad, Ziyad b. Sümeyye'dir ki Sümeyye annesi olup, el-Haris b. Kelede'nin cariyesi idi. Haris onu azadlısı Ubeyd'le evlendirmişti. Bu cariye Ziyad'ı Ubeyd'in döşeğinde dünyaya getirdi. Onlar o vakitler Taif'te bulunuyorlardı ve Taifliler henüz Müslüman olmamışlardı. Hz. Ömer'in halifelik döneminde Ebu Süfyan b. Harb, Ömer'in yanında Ziyad'ın konuşmasını işitti. Ziyad çok belagatlı idi. Muaviye onu beğendi ve şöyle dedi: \"Ben onun annesinden dolayı durumunu biliyorum. İstesem adını söylerdim, fakat Ömer' den korkuyorum.\" Muaviye halifeliğe gelince, Ziyad Hz. Ali tarafından Fars diyarına tayin edilmiş bulunuyordu. Muaviye onunla iyi geçinmek istedi ve onda Ebu Süfyan'ın nesebini alma isteğini uyandırdı. Ziyad buna boyun eğdi ve bu konuda birtakım talihsizlikler ve terslikler meydana geldi. Sonunda Muaviye onun babasının oğlu olduğunu iddia etti ve kendisini önce Basra, sonra Kufe'ye vali tayin etti ve ona değer verdi. Ziyad meşhur yaşantısına ve siyasetine devam etti. Sahabe ve tabiundan birçok kişi Muaviye'nin bu yaptığına \"Çocuk kimin yatağında dünyaya gelmişse onundur\" hadisini delil göstererek tepki gösterdi. Biraz önce bu konuda bir şeyler söylemiştik. Ebu Osman'ın tepkisini açığa vurmak için Ebu Bekre'yi seçmesi, Ziyad'ınonun ana bir erkek kardeşi olmasından dolayıdır. Ebu Bekre'nin, Ziyad'la yaşadığı bir olay vardır ki buna daha önce Şehadat bölümünde işaret edilmişti. Bu hadis Huneyn gazvesinden söz edilirken geçmişti. \"Sakın babalarınızdan yüz çevirip uzaklaşmayınız!\" hadisindeki \"......\" cümlesi, Küşmihenl' de \".......\" şeklinde yer almaktadır. Bazı hadis şarihleri şöyle demişlerdir: Burada \"küfür\" kelimesine yer verilmesi, o kişinin Allahu Teala'a iftira atar duruma düşmesindendir. Çünkü o adeta \"Allah beni filancanın sperminden yarattı\" demiş olmaktadır. Oysa gerçek böyle değildir. Çünkü onu Allahu Teala bir başka babadan yaratmıştır. Yakında geçen \"Bir topluluğun kız kardeşinin oğlu da onlardandır\" ve \"Bir topluluğun azadlı köleSi, kendilerindendir\" hadislerinin genelliği üzere olmadığı bu hadise dayanılarak ifade edilmiştir. Zira hadisler genelliği üzere olsaydı, bir kimsenin mesela dayısının oğlu olduğunu söylemesi caiz olurdu. O iki hadis genelliği üzere olsaydı, o zaman bunu yapan kimseye yönelik şiddetli tehdit içeren başlıktaki hadisle çelişirdi. Buradan o hadisin kapsamının dar olduğu (haas) anlaşılmaktadır. Bundan maksat kız kardeş çocuğunun şefkat, iyilik, yardımlaşma ve benzeri konularda onlardan olduğudur",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 44
			}
		}
	]
}