{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"85": "Laws of Inheritance (Al-Faraa'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6769,
			"arabicnumber": 6769,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"İki kadın ve kadınların beraberinde iki oğlan çocukları vardı. Bir kurt geldi ve bunlardan birisinin oğlunu kapıp götürdü. Bunun üzerine kadın diğer kadına \"Kurt senin çocuğunu götürdü\" dedi. Diğeri de \"Hayır, kurt senin çocuğunu götürdü\" dedi. Nihayet bu iki kadın davalarını Hz. Dauud Nebie arzettiler. O da aralarında büyük kadının lehine hükmetti. Bu iki kadın çıkıp Davud'un oğlu Süleyman Nebi Sallallahu Aleyhi ve Sellem'e gittiler ve davalarına yeniden baktırmak için meseleyi ona haber verdiler. Süleyman Nebi a.s.: \"Bana bir bıçak getirin, çocuğu iki kadın arasında yarıp paylaştırayım\" dedi. Bunun üzerine küçük kadın 'Aman öyle yapma! Allah sana merhamet etsin! Çocuk bu kadının oğludur\" deyince, Süleyman da çocuğun küçük kadına ait olduğuna hükmetti. Ebu Hureyre \"VAllahi ben o güne kadar 'sikkiyn' kelimesini asla duymamıştım. Ancak o gün işittim. Bizler sadece \"müdye\" kelimesini kullanırdık\" demiştir. Fethu'l-Bari Açıklaması: İmam Buhari, her biri bir oğlana sahip olup, bunlardan birini kurt kapınca, onun hangisi olduğu yolunda ihtilaf eden, sonra anlaşmazlıklarını Davud Nebi s.a.v.'e arz edip, ardından Süleyman Nebi s.a.v.'in hüküm verdiği bu iki kadının kıssasına yer vermiştir. Bu hadisin açıklaması Enbiya bölümünde Süleyman'ın aleyhisselam hayatı verilirken genişçe geçmişti. İbn Battal şöyle demiştir: Fıkıh bilginleri, kadının çocuğunun nesebini onu inkar eden kocasına veremeyeceği noktasında görüş birliği etmişlerdir. Kadın bu konuda herhangi bir beyyine getirebilirse bu kabul edilir. Çünkü kadın o erkeğin nikahı altındadır. Buna karşılık evli değilse ve babasının kim olduğu bilinmeyen bir çocuk için \"Bu benim oğlumdur\" deyip, bu konuda kendisiyle hiç kimse çekişmeye girmezse kadının ifadesine göre hareket edilir. Kadın o çocuğa, çocuk da ona mirasçı olur. Ayrıca o çocuğun ana bir kardeşleri de kendisine mirasçı olur. Ancak İbnü't-Tın, İbn Battal'a itiraz etmiş ve İbnü'l-Kasım'dan bir kadın buluntu çocuğun nesebinin kendine ait olduğunu iddia ettiğinde, sözünün kabuledilemeyeceğine dair bir görüş nakletmiştir. Nesai, es-Sünenü'l-Kübra'da bu hadisten çok nefis sonuçlar çıkarmış ve şöyle bir başlık atmıştır: \"Hakimin kendisi gibi veya kendisinden daha yüksek mertebede bir başkasının verdiği hükmü -durum bunu gerektirdiğinde- bozması",
			"grades": [],
			"reference": {
				"book": 85,
				"hadith": 45
			}
		}
	]
}