{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6783,
			"arabicnumber": 6783,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Allah hırsız kişiye lanet etsin ki o bir miğfer çalar da o nedenle eli kesilir, bir ip çalar o yüzden eli kesilir. \" A'meş'in ifadesine göre hadisi rivayet edenler, hadisteki \"beyda\"nın demir miğfer ve \"habl\"in ip olduğunu ve bunların içinde değeri birkaç dirhem olan çeşitli değerde olduğuni ifade etmişlerdir. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı bu başlıktaki \"hırsız\" dan maksat, belli olmayan hırsızdır. İmam Buhari böylece -daha önce açıklandığı üzere- muayyen içki içen kimseye lanet okuma yasaklığı ile bu bölümde geçen hadisi cem ve telif etmeye/ aralarında uyum sağlamağa işaret etmektedir. İbn Battal şöyle demiştir: Hadise göre günah işleyen kimseleri isim isim belirtmek ve yüzlerine karşı lanet okumak uygun değildir. Uygun olanı, onları caydırmak ve alıkoymak için bu tür fiilleri işleyene genelolarak lanet okumaktır. Muayyen bir kişiye Allah'tan ümit kesmemesi için lanet okumak isabetli değildir. İbn Battal şöyle devam eder: İmam Buhari'nin maksadı buysa, bu isabetli değildir. Çünkü Nebi Sallallahu Aleyhi ve Sellem içki içen kimseye lanet okumayı yasaklamış ve kendisine gerekli ceza verildikten sonra \"Kardeşinizin aleyhinde şeytanın yardımcıları olmayınız\" buyurmuştur. Bu konunun açıklaması az önce geçmişti. TIbı, burada lanetten maksat her halde kişinin hakir ve zelil olmasıdır demiştir. İyad ise şöyle demiştir: Bazı bilginler şer'ı ceza uygulanmadığı sürece belli bir kişiye lanet okumaya cevaz vermişlerdir. Çünkü şer'ı ceza (had) kefarettir. lyaz'a göre bu yaklaşım isabetli değildir. Zira Nebi Sallallahu Aleyhi ve Sellem genelde lanet okumayı yasaklamıştır. Bunu muayyen bir kişiye yorumlamak daha isabetli ve uygundur. Bazıları şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in günah işleyen kimselere laneti, o fiil işlenmeden önce kendilerini sakındırmaya yöneliktir. Fiili işlediklerinde Resulullah Sallallahu Aleyhi ve Sellem onlar için istiğfar etmiş ve tövbekar olmaları için dua etmiştir. Resulullah Sallallahu Aleyhi ve Sellem'in bir kimsenin işlediği fiile karşılık ağır konuşup, lanet ettiği kimseye gelince, o lanetin genel şartına dahildir. Çünkü Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Rabbimden o kişiye lanetimi kefaret ve rahmet kılmasını diledim.\" Bu konu hakkında daha önce gerekli açıklamalarda bulunmuştuk. Orada Müslim'in Sahih'inde kaydettiği üzere bu sözün Ianeti hak etmemiş kimse hakkında söylendiğini açıklamıştık. \" 'el-habl'in ip olduğunu ve bunların içinde değeri birkaçdirhem olan değerli çeşitleri olduğuni ifade etmişlerdir.\" Bu hadisin ifade ediliş sebebi hırsızlığı kınamak, bu fiiHn iğrenç olduğunu vurgulamak ve gerek az, gerek çok olsun hırsızlık fiilinin akıbetinin kötü olduğu noktasında uyarıda bulunmaktır. Nebi Sallallahu Aleyhi ve Sellem adeta şöyle demektedir: Bir kişi değersiz bir miğfer ve eski püskü bir ip gibi basit bir şeyi çalmayı adet haline getirdiğinde ve bunu sürekli yaptığında sözkonusu alışkanlığın o kişiyi daha değerli bir şeyi çalmaya götüreceği şüphesizdir. Çaldığı mal karşılığında hırsıza el kesilme cezası uygulanacak bir miktara ulaşır ve eli kesilir. Sanki Resulullah Sallallahu Aleyhi ve Sellem şöyle demektedir:. Kişi bu fiilden kaçınsın ve hırsızlık karekterine hakim olmadan ve bunu alışkanlık haline getirmeden önce onu bıraksın, böylece o fiilin kötü sonucundan ve vahim sonucundan yakasım kurtarmış olur",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 12
			}
		}
	]
}