{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6786,
			"arabicnumber": 6786,
			"text": "Aişe r.anha şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem dünya işlerinde iki iş arasında muhayyer kılındığında, -o iş günah olmadığı sürece- muhakkak durumların en kolay olanını tercih ederdi. Eğer söz konusu şey, günah türünden olursa Nebi Sallallahu Aleyhi ve Sellem onların ikisinden de insanların en uzak bulunanı olurdu. Allah'a yemin ederim ki o, kendisine getirilen hiçbir şeyde kendi nefsi için intikam almazdı. O ancak Allah'ın haramlarının çiğnenmesi durumunda Allah için (öfkelenir), intikam alırdı.\" Fethu'l-Bari Açıklaması: İmam Buhari, attığı bu başlık altında Aişe r.anha hadisine yer vermiştir. Bu hadis Menakıb bölümünde Nebi s.a.v.'in niteliği başlığı altında geniş bir biçimde açıklanmıştı. İbn Battal şöyle demiştir: Buradaki muhayyer kılma, Allahu Teala tarafından yapılmış değildir. Çünkü Allahu Teala Nebi s.a.v.'ini birisi günah olan iki şey karşısında muhayyer kılmaz. Ancak dinde iki seçenek olur ve bunlardan biri -haddi aşma örneğinde olduğu gibi- kişiyi günaha sürükleyici nitelikte bulunursa, bu müstesnadır. Çünkü haddi aşmak kınanmıştır. Mesela bir kimse kendisini çok ağır bir ibadet i yapmakla yükümlü tutsa ve sonra da onu yapmaktan aciz kalsa bu, haddi aşmaya örnek olur. Buradan hareketle Nebi s.a.v. sahabilerine dünyadan el etek çekmelerini yasaklamıştır. İbnü't-TIn şöyle demiştir: Hadiste muhayyer bırakmaktan maksat, dünya ile ilgili meselelerde sözkonusudur. Ahiretle ilgili işlere gelince, bunlar ne kadar zor olursa o kadar sevabı fazla olur. Ancak İbn Battal'ın söylediği daha iyidir. Bu iki görüşten daha uygun olanı, bunun dünya işleri konusunda olduğudur. Çünkü dünyanın bazı işleri insanı çoğunlukla günaha sürükleyebilir. Akla en yakın ihtimal muhayyer bırakanın insanoğlu olduğudur. Bunu anlamak gayet açıktır. Örnekleri çoktur. Özellikle muhayyer bırakma bir kafir tarafından yapıldığında sonucu ve uygulaması gayet açıktır",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 15
			}
		}
	]
}