{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6820,
			"arabicnumber": 6820,
			"text": "Cabir b. Abdullah şöyle demiştir: Eslem kabilesinden bir kişi Nebi Sallallahu Aleyhi ve Sellem'e gelerek zina ettiğini itiraf etti. Resulullah Sallallahu Aleyhi ve Sellem ondan yüz çevirdi. Adam kendi aleyhine dört kez şehadet edince, Resulullah Sallallahu Aleyhi ve Sellem \"akıl hastalığı var mı?\" diye sordu. O kişi \"hayır\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Muhsan mısın?\" deyince, adam \"evet (evliyim)\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem O kişinin recm edilmesini emretti ve o musallada recm edildi. Taşlar kendisine isabetedip, acıtınca adam kaçmaya başladı. Ancak kendisine yetiştiler ve ölünceye kadar taşlandl. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem O kişiyi hayırla yad etti ve cenaze namazını kıldırdl. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlıktan maksat namazgahın yanında recm demektir. Hadiste geçen musalladan kastedilen ise bayram ve cenaze namazlarının kılındığı namazgah demektir. Burası Cennetu'I-Bakl mezarlığı tarafında bulunuyordu. \"Nebi Sallallahu Aleyhi ve Sellem O kişiyi hayırla yad etti.\" Yani ondan güzellikle bahsetti. Müslim' de yer alan Büreyde hadisine göre insanlar Maiz recm edildikten sonra iki gruba ayrıldılar. Bazıları \"O helak olup gitti. Günahı kendisini çepeçevre kuşattı\" derken, bazıları \"Maiz'in tövbesinden daha üstün bir tövbe yoktur\" dediler. Aradan üç gün geçtikten sonra Nebi Sallallahu Aleyhi ve Sellem geldi ve şöyle dedi: \"Maiz b. Malik'e istiğfar ediniz. \"(Müslim, Hudud) Yine Büreyde'nin bir başka nakline göre Nebi Sallallahu Aleyhi ve Sellem \"Maiz öyle bir tövbe etti ki ümmete taksim edilse herkese yeterdi\" buyurmuştur. Fıkıh bilginleri bu meselede ihtilaf etmişlerdir. İmam Malik \"Yetkili makam (devlet başkanı) zina eden kimsenin recm edilmesini emreder. Bizzat kendisi yapmaz. Ölünceye kadar taşlamaya ara verilmez. Öldüğünde yıkamaları ve namazını kılmaları için cenaze ailesine verilir. Masiyet işleyen kimseler, recmedilerek öldürüleni namazı kılınmaz kimselerdendir diye biliyorlarsa devlet başkanı onları caydırmak ve o fiili işlemeye cüretlerini kırmak maksadıyla onun namazını kılmaz. Maliki alimlerinden biri şöyle demiştir: Devlet başkanı recm edilip ölen kimsenin cenaze namazını kılabilir. İmam Malik'ten nakledilen meşhur görüşe göre devlet başkanının ve fazilet ehli kimselerin recm edilerek öldürülmüş olan kimsenin namazını kılmaları mekruhtur. Ahmed b. Hanbel'in görüşü de bu doğrultudadır. İmam Şafil'ye göre ise devlet başkanı ve faziletli kimselerin böyle bir kişinin namazını kılmaları mekruh değildir. Bu aynı zamanda çoğunluğun da görüşüdür. Bir rivayete göre Zührı, recm edilerek öldürülenle intihar edenin cenaze namazı kılınmaz demiştir. [yaz mutlak konuşmuş ve şöyle demiştir: Bilginler fasık, masiyet ehli kişilerle, had cezası neticesinde öldürülmüş olanların cenaze namazıarının kılınabileceği konusunda ihtilaf etmemişlerdir. Ancak bazı bilginler fazilet ehli kimselerin bu kişilerin namazını kılmalarını mekruh görmüştür. İmam Ebu Hanıfe, hirabe suçu işleyip, öldürülenlerin cenaze namazı kılınmaz derken, Hasan-ı Basri zinadan çocuk doğurup, loğusa iken ölen kadının cenaze namazı kılınmaz demiştir. Fasık, masiyet işlemiş ve had cezaları uygulaması neticesi ölmüş kimselerin cenazelerinin kılınacağı hükmüne Zührı ve Katade de muhalif kalmışlardır. [yaz şöyle demiştir: Yukarıda Gamidiyye olayı hakkında zikredilen hadis, çoğunluğa delil teşkil etmektedir. Doğruyu en iyi Allahu Teala bilir]",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 48
			}
		}
	]
}