{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6822,
			"arabicnumber": 6822,
			"text": "Aişe r.anha'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem mescidde iken yanına bir adam geldi ve \"yandım\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Neden yandın?\" dedi. Adam \"Ramazanda oruçlu iken eşi ml e cinsel ilişkide bulundum\" dedi. Nebi Sallallahu Aleyhi ve Sellem Efendimiz Sallallahu Aleyhi ve Sellem \"tasadduk et\" buyurdu. Adam \"Benim yanımda (tasadduk edecek) hiçbir şey yoktur\" dedi ve orada oturdu. O sırada Nebi Sallallahu Aleyhi ve Sellem'e bir kişi üzerinde yiyecek bir şey bulunan bir eşeği sürerek geldi. Abdurrahman, ben o yiyecek şeyin ne olduğunu bilmiyorum dedi. Hadisin konumuzIa ilgili olan son kısmı şöyledir: Nebi Sallallahu Aleyhi ve Sellem \"O yanan adam nerededir?\" diye seslendi. Adam \"O benim, işte buradayım\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Bunu al ve tasadduk et\" dedi. Adam \"Benden daha muhtaç olana mı? Benim ailemin yiyecek hiçbir şeyi yoktur\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Öyleyse bunu sizler yiyin\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buharl'nin kullandığı başlıkta işlenen günahın \"hadten daha hafif\" olarak nitelenmesi, işlediği günah had cezasını gerektiren bir kimseye -tövbe etmiş bile olsa- ceza verilmesini gerektirmektedir. Bu konudaki ihtilaf Hudıld bölümünün baş taraflarında geçmişti. Ata \"Nebi Sallallahu Aleyhi ve Sellem öyle bir kimseye ceza vermedi demiştir.\" Yani bir günah işlemiş olduğunu haber veren kimseyi Resulullah Sallallahu Aleyhi ve Sellem mühlet vermeksizin cezalandırmamıştır ve ona kıldığı namazın günahlarına kefaret olduğunu bildirmiştir. \"İbn Cüreyc'in ifadesine göre Nebi Sallallahu Aleyhi ve Sellem Ramazanda eşiyle ilişkiye girdiğini söyleyen kişiye ceza vermemiştir. Bu hadisin açıklaması Savm / Oruç bölümünde genişçe yapılmıştı. \"Hz. Ömer de ihramlı olduğu halde ceylan avlayan kimseye ceza uygulamamıştır. \" İmam Buhari bu ifadesiyle İmam Malik' in munkatı olarak zikrettiği ve Said b. Mansur'un sahih bir isnadla Kubaysa b. Cabir'den naklettiği şu habere işaret ediyor gibidir: Hac yapmak üzere yola çıktık. Sonra karşımıza bir ceylan çıktı. Ben ona bir taş attım ve öldü. Mekke'ye geldiğimizde bunu Hz. Ömer'e sorduk. O da Abdurrahman b. Avf'a sordu. Sonra her ikisi bu konuda ceza olarak bir keçi kurban etmemiz gerektiğine hükmettiler. Ben \"mu'minierin emiri ne diyeceğini bilmediği için başkasına sordu\" dedim. Hz. Ömer bana kamçısını çekerek \"Harem bölgesinde av öldürüp, sonra hakemin ehliyetsiz olduğunu mu söylüyorsun?\" dedi. Sonra devamla Allahu Teala 'İçinizden adalet sahibi iki kişi hükmeder'(Maide, 95) buyurmaktadır. Bu Abdurrahman b. Avf'tır, ben de Ömer' im\" dedi. Bu hüküm Buharl'nin attığı başlıktaki had suçundan hafif günah işleyenlere ceza verilemeyeceği ifadesiyle çelişmez. Hz. Ömer'in ona kamçısını çekmesi, verilen hükme dil uzatmasından dolayıdır. Aksi takdirde sözkonusu Hil işlendi diye ona ceza vermek gerekli olsaydı, Hz. Ömer bunu asla ertelemezdi",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 50
			}
		}
	]
}