{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6842,
			"arabicnumber": 6842,
			"text": "Ebu Hureyre ile Zeyd b. Halid'in nakillerine göre iki kişi anlaşmazlıklarını Nebi Sallallahu Aleyhi ve Sellem'e arzettiler. Bunlardan birisi \"Aramızda Allah'ın kitabı ile hükmet!\" dedi. Diğeri de ondan daha anlayışlı birisi olarak \"evet Ya Resulallah! Aramızda Allah'ın kitabı ile hükmet ve konuşmam için bana izin ver!\" dedi. Resulullah Sallallahu Aleyhi ve Sellem ona \"Konuş!\" buyurdu. O da şöyle dedi: \"Benim oğlum bu adamın yanında ücretli idi. -İmam Malik hadiste geçen \"asıf\" ücretle çalışan demektir demiştir.- Bunun üzerine yanında çalıştığı adamın hanımı ile zina etmiş. İnsanlar bana oğlum için recm cezası gerektiğini söylediler. Ben de bu adama yüz koyun ile bir de kendime ait olan bir cariyeyi vererek oğlumu kurtardım. Sonra bu meseleyi bilenlere sordum. Onlar bana henüz bekar olan oğluma yüz değnekle bir yıl sürgüne gönderme cezası, bunun hanımına da recm cezası gerektiğini haber verdiler!\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Dikkat edin! Kudreti sayesinde yaşadığım Allah'a yemin ederim ki ben sizin aranızda elbette Allah'ın kitabı ile hüküm vereceğim: Senin koyunlarına ve cariyene gelince, bunlar sana geri verilecektir\" buyurdu ve zina eden adamı yüz sopa cezasıyla cezalandırıp, bir yıl sürgüne gönderdi. Nebi Sallallahu Aleyhi ve Sellem, Üneys el-Esleml'ye de diğer adamın karısına gitmesini emretti ve \"Eğer zina suçunu itiraf ederse onu recm et\" buyurdu. Kadın zina suçunu itiraf etti ve o da kadını recm etti. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda ev sahibinin eşiyle zina eden ücretli olayına yer vermiştir. Bu hadisin açıklaması geniş bir şekilde daha önce yapılmıştı. Yukarıdaki başlıkta değinilen hüküm, başkasının karısına zina isnadında bulunan kimse açısından açık ve nettir. Kendi karısına bu suçlamayı yöneiten kimseye gelince, İmam Buhari bu hükmü kadının kocasının orada mevcut olup, yapılan suçlamayı inkar etmemiş olmasından almış gibidir. İmam Buhari, \"Hakimin o kadına tahkikatçı gönderip kendisine isnad edilen suçun sormasının gerekip gerekmediği\" ifadesi ile bu konudaki ihtilafa işaret etmektedir. Çoğunluk, bunun devlet başkanının (hakimin) görüşüne kalmış bir iş olduğu kanaatindedir. Nevevi şöyle demiştir: Bizce en sahih olanı hakimin bu durumda bir tahkikat çı göndermesinin gerekli olduğudur. Bu görüşün delili Nebi Sallallahu Aleyhi ve Sellem' in Uneys' i o kadına göndermiş olmasıdır. Ancak Nevevi'nin ileri sürdüğü görüş, şu mülahazalarla tenkide uğramıştır. Bu, özel bir olayla ilgili uygulamadır. Bu uygulamada vacipliğe delalet eden bir husus yoktur. Çünkü Nebi Sallallahu Aleyhi ve Sellem'in Üneys'i O kadına göndermesi kocasıyla ücretli kişinin babası arasında meydana gelen çekişme ve had cezası yerine yaptıkları anlaşma ve bu olayın yayılıp duyulması ihtimaline dayanabilir. Sözkonusu olayda ücretli kişinin babası, durumu açıkça ortaya koymuş, kadının kocası da ona tepki göstermemiştir. Kadına tahkikatçı göndermek, sözkonusu olaydaki kadın gibi güçlü bir zina şaibesi altında bulunan kadınlara mahsustur. Nebi saJlaJlahu aleyhi ve seJlem'in sözkonusu cezayı kadının itirafına bağlaması, zina cezasının o gibi kadınlar açısından -buna beyyine getirmek imkansız olduğu için- ikrarla sabit olmasından dolayıdır. İmam Malik'in Muvatta'ında yer alan bir habere göre adamın biri Hz. Ömer' e gelir. Ona karısıyla birlikte bir kişiyi yakaladığını haber verir. Hz. Ömer o kadına Ebu Vakıd'ı gönderir. Ebu Vakıd, kadına kocasının ileri sürdüğü iddiayı sorar ve ona halifenin kocasının ifadesine göre hareket etmeyeceğini bildirir. Kadın da suçunu itiraf edince, Hz. Ömer recm edilmesini emreder ve kadına recm cezası uygulanır. İbn Battal şöyle demiştir: Bilginler, karısına veya bir başkasının karısına zina isnadında bulunup da buna delil getiremeyen kimseye -suç isnad edilen kişi bunu ikrar etmezse- iffete iftira CeZgSI (hadd-i kazif) uygulanacağı konusunda görüş birliği etmişlerdir. Bundan dolayı devlet başkanının (hakimin) kadına bir tahkikatçı gÖndermesi gerekir. Kadın zina eden ücretli alayında zina ettiğini itiraf etmeyecek olsaydı, o ücretlinin babasına iffete iftira cezası vermek gerekeeekti. Bu hükmü n uzantısı mahiyetinde olmak üzere şunu belirtelim: Bir erkek muayyen bir kadınla zina ettiğini itiraf, kadın da bunu inkar etse kendisine hem zina ve hem de iffete iftira cezası mı uygulanır yoksa sadece iffete iftira cezası mı uygulanır? İmam Malik birinci görüşü savunurken, İmam Ebu Hanife ikinci görüşü benimsemiştir. Şafii ve Ebu Hanife'nin iki öğrencisi ise şöyle demişlerdir: Bu iki kişiden hangisi suçunu itiraf edecek olursa sadece ona zina cezası uygulanır. Bu görüşün delili şudur: Erkek, gerçekten doğru söylüyorsa kadına bu suçu isnad eden kimseye had cezası uygulanmaz. Yalan söylüyorsa erkek zina etmiş değildir. Böyle bir kişiye zina cezası vermenin gerekmesi şu kurala dayanır: Kendisi ve başkası aleyhine herhangi bir suç ikrarında bulunan kimseyi yaptığı ikrar bağlar. Bu kişi başkası açısından ikrarında ise iddia eden pozisyonundadır. Dolayısıyla başkası için değil, kendi açısından yaptığı ikrar onu bağlar",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}