{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6847,
			"arabicnumber": 6847,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem'e bir bedevi geldi ve \"Ya Resulallah! Benim karım siyah bir oğlan doğurdu\" dedi. Nebi Sallallahu Aleyhi ve Sellem ona \"Senin develerin var mı?\" diye sordu. Bedevi \"evet vardır\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Hangi renkteler?\" diye sordu. Bedevi \"kızıl\" diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem \"İçlerinde hiç boz olanı var mı?\" dedi. Bedevi \"evet vardır\" diye cevap verdi. Resulullah Sallallahu Aleyhi ve Sellem \"Sence bunlar nasıl boz renkli oldu?\" diye sordu. Bedevi \"Herhalde bir damara çekti\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Herhalde senin çocuğun da bir damara çekti\" buyurdu. Fethu'l-Bari Açıklaması: Rağıb el-Isfehanı ta'rizi, şöyle tarif eder: Ta'riz, bir zahiri ve bir de batıni yönü olan ifade biçimidir. Bu sözü söyleyen kimse sözün batını manasını kastederken, zahiri manayı kastettiği görüntüsünü verir. Ta'rizle ilgili olarak lian bölümünae \"Ta'riz yoluyla çocuğun nesebini reddetme\" başlığı altında Ebu Hureyre'nin rivayet ettiği \"karım siyah bir oğlan doğurdu\" diyen bedevi olayının açıklaması yapılırken bir parça üzerinde durmuştuk. Orada bu bedevinin adı hakkında söylenenlerden söz etmiş ve ta'rizin hükmü konusunda bilginler arasında var olan ihtilafı belirtmiştik. Aynı şekilde İmam ŞafiI' nin bu hadise dayanarak ta'riz yoluyla iffete iftiraya açıktan iffete iftira hükmü verilemeyeceği sonucunu çıkardığından bahsetmiştik. Bu konuda Buhari de Şafil'ye uymuştur. Çünkü o, bu hadisi iki yerde zikretmektedir. Orada işaret etmiş olduğum Ma'mer rivayetinin sonunda \"Nebi Sallallahu Aleyhi ve Sellem çocuğunu kabul etmemesine izin vermedi\" cümlesi yer almaktadır. Zührı ise şöyle der: Karı-koca arasında lanetleşme (lian) ancak koca ben zinayı gördüm dediği takdirde yapılır. İbnü't-Tın ise şu açıklamayı yapmıştır: Malikiler yukarıda zikrettiğimiz hadisten bedevi Nebi s.a.v.'e fetva sormak üzere gelmişti. O ta'rizi ile karısına iftira atmayı kastetmiyordu diyerek ayrılmışlardır. Kısaca belirtmek gerekirse ta' riz yoluyla iftira, ancak iftira atmak istediği bilinen kimse için geçerlidir. Bu da ta'rizde kişinin iradesine vakıf olmak imkansız olduğu için had cezası olmadığı görüşünü güçlendirmektedir. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 69
			}
		}
	]
}