{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6853,
			"arabicnumber": 6853,
			"text": "Aişe r.anha \"Nebi Sallallahu Aleyhi ve Sellem kendisine arz edilen hiçbir şey hakkında Allah'ın haramlarından biri çiğnenilmediği müddetçe kendi nefsi için intikam almamıştır. Haramlardan biri çiğnendiğinde de Allah için intikam alırdı\" demiştir. Fethu'l-Bari Açıklaması: ......Ta'zir ....... azere\" kökünden türemedir. Bu kökün anlamı engelleme ve geri çevirme demektir. Ta'zir bir şahsı kaçındırmak demektir. Tıpkı düşmanlarını kendisinden savuşturup, ona zarar vermelerini önlemek gibi. \"Ve amentum bi'r-rusuli ve azzertümuhum =Nebilerime inanır, onları desteklerseniz\"(Maide 12) ayetinde kelime bu anlamda kullanılmıştır. Bu bir kimsenin çirkin bir fiili işlemesine engelolmak gibidir. '\\'r':'\\.4.l1 •.Jr\" tabiri de buna bir başka örnektir. Bu cümlenin anlamı hakim sanık bir kez daha çirkin fiili işlemesin diye onu te'dib etti demektir. Ta'zir, kişinin durumuna uygun olarak sözle olabildiği gibi, fiille de olur. Buharl'nin attığı başlıktaki \"Edeb\" kelimesinden maksat, te'dib etmektir. Bu kelimenin ta'zir kelimesine atfedilmesinin sebebi şudur: Ta'zir masiyet sebebiyle yapılırken, te'dib bundan daha geneldir. çocuğu te'dib, öğretmenin te'dibi bu kavrama dahildir. İmam Buhari ta'zir ve te'dibin miktarını soru işaretiyle belirterek -biraz sonra açıklayacağımız üzere- bu konudaki ihtilafa işaret etmektedir. \"Allah 'zn tayin ettiği hallerden birinde olmadıkça ... \" Bu ifadenin zahirinden anlaşılan \"had\"den maksadın, şari (Allah) tarafından hakkında belli sayıda sopa veya vurma ya da belli bir ukubet tayin edilen ceza olduğudur. Bunlardan üzerinde ittifak edilenler, zina, hırsızlık, sarhoş verici madde içmek, hirabe (yol kesme, eşkiyalık), zina iftirası, adam öldürme, kısasen öldürme ve organlara kısasen zarar verme, dinden dönme sebebiyle katı cezalarıdır. Bu cezalardan son ikisine \"had\" denilip, denilmeyeceği konusunda bilginler arasında ihtilaf vardır. İşleyen kimsenin cezayı hak ettiği birçok suça \"had\" veya başka bir şey denilip denilmeyeceği konusunda ihtilaf edilmiştir. Bunlar bırakılan emaneti inkar, homoseksüel ilişki (livata), hayvanlarla cinsel ilişki, bir kadının erkek bir hayvanla ilişkisi, kadın kadına sevicilik (lezbiyenlik), darda kalmayan bir kimsenin ölmüş bir hayvanın etini yiyip kanını içmesi, domuz eti yeme bu suçlardan bazılarıdır. Sihir yapma, içki içme iftirasında bulunma, tembellik ederek namaz kılmama, Ramazan orucunu yeme ve üstü kapalı sözcüklerle (ta'riz) zina iftirasında bulunma da böyledir. Bazı bilginler yukarıda zikrettiğimiz hadislerde geçen \"had\" kelimesinden maksadın Allah hakkı olduğu kanaatine varmışlardır. Selef bilginleri bu hadisin anlamı üzerinde ihtilaf etmişlerdir. Leys, kendisinden nakledilen meşhur rivayete göre Ahmed b. Hanbel, İshak, bazı Şafiı bilginleri bu hadisin zahirini almışlarqır. İmam Malik, Şafii ve İmam Ebu Hanıfe'nin iki öğrencisi, hadiste ifade edilen On sayısının üzerine çıkmak caizdir dedikten sonra ihtilaf etmişlerdir. İmam Şafii hiçe bir zaman had cezalarının en alt sınırına varılmaz demiştir. Ancak burada itibar edilecek olan hür bir kimseye uygulanacak had midir, yoksa köleye uygulanacak had midir? Bu konuda iki görüş vardır. Bir görüşe veya biryaklaşıma göre her ta'zir cezası kendi cinsinin had cezasından belirlenir ve o miktarı aşmaz. \"Bu konuda, had cezasına ulaşılmaz\" diyen Evzaı'nin görüşünün zorunlu sonucu da budur. Evzaı bu konuda ayrıntıya gitmemiştir. Diğer fıkıh bilginleri ise şöyle demişlerdir: Ta'zirde cezanın tayini hangi miktara çıkarsa çıksın devlet başkanına (hakime) kalmıştır. Ebu Sevr'in tercihi de bu yöndedir: Hz. Ömer'in, Ebu Musa'ya bir mektup yazarak \"ta'zir cezasında yirmiden daha fazla vurulamaz\" dediği nakledilmiştir. Hz. Osman'ın otuzdan daha fazla vurulamaz dediği rivayet edilirken, Hz. Ömer yüz kamçıya kadar çıkılabilir demiştir. İbn Mesud'dan da bu doğrultuda bir görüş nakledilmiştir. İmam Malik, Ebu Sevr ve Ata şöyle demişlerdir: Ta'zir cezası ancak bir suçu tekrar tekrar işleyen kimseye verilir. Bir kez günah işleyen kimseye had cezası verilemeyeceği gibi, ta'zir de uygulanmaz. Ebu Hanife'nin ta'zirde kırk sopaya çıkılmaz dediği nakledilmiştir. İbn Ebi Leyla ve Ebu Yusuf ise doksanbeş sopanın üstüne çıkılmaz demişlerdir. İmam Malik ve Ebu Yusuf'tan gelen bir nakle göre seksenin üzerine çıkılmaz. Bu bilginler yukarıdaki hadise birçok cevap vermişlerdir. Bunların içinden bazıları yukarıda geçti. Bu cevaplardan birisi de ta'zir cezasının sadece sopa vurularak uygulanacağıdır. Mesela bastonla veya elle vurmaya gelince, burada hadiste belirtilen rakamın üstüne çıkmak mümkündür. Fakat had cezalarının en düşük miktarının üzerine çıkılamaz. Hadise verilen cevaplardan birisi de onun mensuh olduğudur. Hadisin nesh edildiğini sahabenin icmaı göstermektedir. Buna bu görüşü bazı tabiun alimleri ifade etmişlerdir denilerek itiraz edilmiştir. Leys b. Sa' d' ın görüşü bu doğrultuda olup, İslam beldesinin belli başlı merkezlerinde bulunan fıkıh bilginleri de (fukahau'l-emsar) bu görüşü benimsemişlerdir. Hadise verilen cevaplardan bir diğeri de hadisin kendisinden daha güçlü olan bir delille çeliştiğidir. Bu güçlü delil, ta'zir cezasının had cezalarından farklı olacağına dair yapılmış icmadır. Yukarıda zikrettiğimiz hadis, ta'zirin on veya daha az bir sayıyla belirlenmesini gerektirmektedir. Dolayısıyla bu, had cezası gibi olmaktadır. Hadis bir de ta'zir cezası devlet başkanının (hakimin) görüşüne bırakılmıştır. Ağırlaştırmak ve hafifleştirmek onun görevidir şeklindeki icma ile çelişmektedir. ikinci hadis visal orucunu yasaklama hadisidir. Hadise bu başlık altında yer verilmesinden maksat, \"ceza verici bir tavırla onlara visal orucu tutturdu\". cümlesidir. ibn Battal'ın nakline göre Mühelleb şöyle demiştir: Bu hadisten anlaşılan ta'zir cezası devlet başkanının (hakimin) takdirine bırakılmıştır. Çünkü Nebi Sallallahu Aleyhi ve Sellem \"eğer ay geri kalsaydı, ben sizlere daha fazla visal orucu tuttururdum\" buyurmuştur. Bu ifade devlet başkanının (hakimin) ta'ziri uygun gördüğü kadar arttırmaya yetkisi olduğunu göstermektedir. Durum Mühelleb'in dediği gibidir. Fakat bu, yukarıda zikredilen hadisle çelişmez. Çünkü hadis belli bir sayıda vurma veya sopalama hakkında gelmiştir. Dolayısıyla belli bir şeyle ilgilidir. Bu visal orucu ise terk edilen bir şeyle ilgilidir. O da orucu bozan şeylerden kişinin kendini tutmasıdır. Burada çekilen acı aç ve susuz bırakma sebebi iledir. Açlığın ve susuzluğun şahıslardaki etkisi gerçekten birbirinden çok farklıdır. ifadeden öyle -anlaşılıyor ki Nebi Sallallahu Aleyhi ve Sellem'in visal orucu tutturdu ğu kişiler, genelde bunu başarabilecek güçte olankimselerdi. Nebi s.a.v., visal orucu onların aciz kalmalarıyla sonuçlanmış olsaydı, bunun onları vazgeçirmekte daha etkili olacağına işaret etmektedir. Hadisten anlaşılan ta'zirden maksadın caydırmayı sağlayan bir ceza olduğudur. Bu da değneğin veya vurmanın daha hafif veya daha ağır olması şeklinde çeşitli uygulamalar yapmak suretiyle on sopayla mümkün olur. Doğruyu en iyi Allahu Teala bilir. Bu hadisten aç bırakma veya benzeri manevi şeylerle ta'zir uygulamanın caiz olduğu da anlaşılmaktadır. \"Nebi s.a.v.'in zamanında (ölçüp tartmaksızın) göz kararı pazarlıkla yiyecek maddesi satın aldıklarında ... \" Bu hadisin açıklaması büyu' bölümünde geniş geniş yapılmıştı. Hadisten şer'! emre muhalif olan ve fasid akidere başvuran kimselere vurma suretiyle te'dib cezası uygulanabileceği, çarşı ve pazarlara muhtesib görevlendirmenin meşru olduğu anlaşılmaktadır. Hadiste zikredilen dövme dördüncü hadisten anlaşıldığı üzere emrekarşı gelen kimse içindir şeklinde açıklanmıştır. Bu hadisin geniş bir açıklaması, Nebi s.a.v.'in Sıfatı Bölümünde ge.çmlşti",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 75
			}
		}
	]
}