{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6856,
			"arabicnumber": 6856,
			"text": "İbn Abbas r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in huzurunda liandan söz edildi. Asım b. Adiy bu konuda bir söz söylemiş, sonra evine gitmişti. Bundan sonra ona kendi kavminden olan bir kişi geldi ve kendi karısının yanında bir adamı yakaladığını söyleyip şikayette bulundu. Bunun üzerine Asım \"Ben bu belaya ancak kendi sözümden dolayı uğramışımdır\" dedi ve o adamı Nebi Sallallahu Aleyhi ve Sellem'in yanına götürdü. Adam Efendimize karısını birlikte yakaladığı kişiyi haber verdi. Şikayetçi olan kişi sarı benizli, az etli, düz saçlı idi. Karısıyla birlikte yakaladığını iddia ettiği kişi ise esmer, kalın ve dolgun bacaklı, çok etli, şişman bir kimse idi. Resulullah Sallallahu Aleyhi ve Sellem \"Allahümme beyyin= Allah'ım beyan buyur\" dedi. Sonunda kadın kocasının yanında yakaladığını söylediği adama benzer bir çocuk doğurdu. Resulullah Sallallahu Aleyhi ve Sellem bu karı koca arasında lian yaphrdl. Abdullah b. Şeddad bulundukları mecliste Abdullah b. Abbas'a hitaben \"İşte o kadın Resulullah Sallallahu Aleyhi ve Sellem'in \"Eğer ben beyyinesiz olarak recm etseydim, işte bu kadını recm ederdim\" buyurduğu kadındır deyince, İbn Abbas \"hayır, o kadın, İslamda kötülüğü açıktan açığa işleyen bir kadındı\" dedi. Fethu'l-Bari Açıklaması: \"Genelde çirkin fiile delalet eden bir şey yapmak\" Bu başlıktan maksat, söz konusu fiilin hükmünün ne olduğudur. \"Çirkin fiile delalet eden bir şey yapmak\" tabirinden maksat, elde herhangi bir beyyine veya kişinin ikrarı olmaksızın genelde fuhşa delalet eden bir şey yapmak demektir. Başlıkta geçen .\"lath\", kötülük iftirasında bulunmaktır. \"Lataha fulanun bi keza\" birisi birisine şöyle bir kötülük attı demektir. ......... ona bir kötülük attı ve töhmette bulundu demektir. Töhmet, bu fiil ile suçlanan kimseye normal yoldan bile olsa tahkik etmeksizin suçlamada bulunmak demektir. İmam Buhari bu konuda iki hadise yer vermektedir. Bunlardan birisi, Sehl b. Sa'd'ın karşılıklı !ian yapan karı-koca olayı hakkında naklettiği hadistir. Bu hadis muhtasar olarak nakledilmiştir. Hadisin geniş bir açıklaması lian bölümünde geçmişti. Mühelleb şöyle demiştir: Hadisten bir kimse zina ile itham edilse bile elde beyyine veya kişinin ikrarı olmaksızın ona had cezası uygulanamayacağı anlaşılmaktadır. Nevevi şöyle demiştir: \"Kötü bir şeyi ortaya koyma\" kişinin o kötülükle meşhur olması, bunun yaygın hale gelmesi ancak ispat için bir beyyinenin bulunmaması ve o kişinin de suçunu itiraf etmemesi demektir. Hadis bir kişinin işlediği suçun halk arasında yaygın hale gelmesi dolayısıyla ona had cezası uygulamanın gerekmediğine delildir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 78
			}
		}
	]
}