{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"86": "Limits and Punishments set by Allah (Hudood)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6857,
			"arabicnumber": 6857,
			"text": "Ebu Hureyre r.a.'in nakline göre Nebi Sallallahu Aleyhi ve Sellem bir keresinde \"Helak edici yedi şeyden sakınınız!\" buyurdu. Sahabiler \"Ya ResulaIlah! Nedir onlar?\" diye sordular. Nebi Sallallahu Aleyhi ve Sellem şöyle buyurdu: Allah'a ortak koşmak, sihir yapmak, Allah'ın haram kıldığı cana haksız yere kıymak, faiz kazancı yemek, yetim malı yemek, düşmana hücum sırasında savaştan kaçmak, namuslu, kötülüklerden habersiz mu'min kadınlara zina isnadında bulunmaktır. \" Fethu'l-Bari Açıklaması: \"İffetii kadınlara zina iftirası atmak\" onlara iftirada bulunmak demektir. Burada \"el-muhsanat\" kelimesinden maksat, iffetli ve hür kadınlar demektir. Bu, sadece evli kadınlar demek değildir. Tam tersine bakire olan kadına zina iftirasının cezası da bilginlerin icmaı ile aynıdır. Yukarıda zikredilen birinci ayet, iffete iftira suçunun cezasını açıklarken, ikincisi bunun büyük günahlardan olduğunu ifade etmektedir. Karşılığında lanet veya azap tehdidi bulunan ya da had cezası getirilmiş olan bütün fiiller büyük günahtırlar. Bu konuda esas alınması gereken tanım budur. Böyle bir açıklamayla bu bölümde zikredilen hadisle iki ayet birbiriyle uyumlu hale gelmektedir. İffetli erkeklere zina iftirası atmanın hükmünün, iffetli kadınlara zina iftirasında bulunmayla aynı olduğu noktasında bilginlerin icmaı vardır. Bundan sonraki bölümde açıklayacağımız üzere kölelere zina isnadında bulunmanın hükmü ihtilaflıdır. \"Helak edici yedi şeyden sakınınız.\" Mühelleb şöyle demiştir: Büyük günahlara bu ismin verilmesi, onların bunları işleyen kimseleri helak etmesi sebebiyledir. Bizce burada\"r-ll\" kelimesi, büyük günah anlamındadır. Nesai ve Taberanl'nin rivayet ettikleri İbn Hibban ve Hakim'in sahih olarak degerlendirdikleri ve Ebu Hureyre ile Ebu Said'in naklettikleri bir hadise göre Nebi s.a.v.\"Beş namazı kılıp, yedi büyük günahtan kaçman hiçbir 'kul yoktur ki ona cennetin kapılan açılmasın\" buyurmuştur. (Nesai, Zekat; İbn Hibban, Sahih, V, 43; Hakim, el-Müstedrek, I, 316; Taberani, el-Mu'cemu'l-Kebir, IV, 128) İbn Abdusselam şöyle demiştir: Büyük günahın hiçbir itirazIa karşılaşmayacağı tanımına rastlamadım. Bence en uygun tarifi şudur: Büyük günah, işleyenin dinini hafife aldığını nasla bildirilen büyük günahların en küçüğünün gösterdiği kadar gösteren günahtır. İbn Abdusselam bir de şunu der: Bazıları büyük günahı, işleyene tehdit veya lanet getirilen her türlü günahtır şeklinde tanımlamışlardır. Bizce bu son tanım diğerinden daha kapsamlıdır. Bu tanıma \"ihlal edilmesi had cezası gerektirir\" şeklinde bir ilave yapmak gerekir şeklinde bir itiraza yer yoktur. Çünkü hakkında had cezası uygun görülen her fiil, onu yapan kişiye yönelik tehditten hali değildir. Kurtubl'nin el-Müfhim isimli eserinde yaptığı tarif büyük günah tanımlarının içinde en güzellerinden biridir: Kitap veya sünnetin ya da icmanın hakkında \"büyük günah\" deyimini kullandığı ya da karşılığında şiddetli bir ceza olduğu bildirilen veya had cezası konulan ya da şiddetli bir kınama yapılan fiiller büyük günahtır. Buna göre hakkında tehdit veya lanet ya da fısk terimlerinin kullanıldığı fiilleri Kur'an ya da sahih ve hasen hadislerden araştırmak ve gerek Kur'an, gerek sahih ve hasen hadislerde büyük günah olduğu bildirilen fiillere bunları eklemek uygun olur. Bu fiillerin toplamı kaça ulaşırsa ulaşsın bundan o fiilleri bir bir sıralamayı öğrenmek mümkündür. Ben bunları biraraya toplamaya başladım. Allahu Teala'tan lütfu ve inayetiyle bunları yazmaya yardımcı olmasını dilerim. Hallmı, el-Minhac isimli eserinde şöyle der: Büyük ve küçüğü olmayan hiçbir günah yoktur. Bazen küçük günah belli bir karine dolayısıyla büyük günaha dönüşebilirken, bazen büyük günah aynı şekilde çirkin bir fiile dönüşebilir. Bundan Allah'ı inkar etmek müstesnadır. Çünkü bu büyük günahların en çirkinlerindendir. Allah'ı inkar etme günahının küçüğü yoktur. Biz de şunu ekleyelim: Bununla birlikte bu günah da çirkin ve daha çirkin şeklinde iki kısma ayrılır. Halımı bundan sonra söylediklerine örnekler getirir. İkincisi ise haksız yere bir cana kıymak gibi bir fiildir. Bu büyük günahtır. Bir kimse kendi usulünü (babası, babasının babası. .. ) veya füruunu (oğlu, oğlunun oğlu ... ) ya da kan bağı olan yakın akrabasını öldürse veya Harem' de veya haram olan ayda katı fiilini işlese bu bir çirkin fiildir (fahişe). Zina büyük bir günahtır. Bir kimse komşusunun hanımıyla veya kan bağı olan akrabasıyla ya da Ramazan ayında veya Harem bölgesinde bu fiili işleyecek olursa, bunun adı fahişedir. içki içmek büyük günahtır ama Ramazan ayında gündüz içilirse veya Harem-i Şerif'te ya da açıktan açığa içilecek olursa bu da fahişedir. Nisab miktarından daha az bir değerde mal çalmak küçük günahtır. Malı çalınan kişinin bundan başka malı yoksa ve malı olmaması zaafa yol açıyorsa bu büyük günahtır. Halimi bu konuda daha bir çok örnek verir: Bu örneklerin çoğunda tenkit edilecek noktalar bulunmaktadır. Fakat bu onun alametidir. Yapılan bu ayırım güzel bir metod olup, dikkate almakta herhangi bir sakınca yoktur. Büyük ve küçük günah ayırımının dayanağı mefsedetin ağırlığı veya hafifliğidir. Doğruyu en iyi Allahu Teala bilir",
			"grades": [],
			"reference": {
				"book": 86,
				"hadith": 79
			}
		}
	]
}