{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6875,
			"arabicnumber": 6875,
			"text": "Ahnef b. Kays şöyle anlatmıştır: Ben (Sıffın savaşı sırasında) şu adama (Hz. Ali'ye) yardım etmek için gidiyordum. Ebu Bekir karşıma çıkarak bana \"Nereye gidiyorsun?\" diye sordu. Ben \"Şu adama yardım edeceğim!\" dedim. O da bana şöyle dedi: \"Geri dön! Çünkü ben Nebi Sallallahu Aleyhi ve Sellem'den işittim: \"İki Müslüman kılıçlarıyla karşılaştıkları zaman ölen de, öldüren de ateştedir\" buyuruyordu. Ben \"Ya Resulallah! Öldüren böyledir ama ölene ne oluyor?\" diye sordum. Nebi Sallallahu Aleyhi ve Sellem \"Ölen de, arkadaşını öldürmeye hırslı idi\" buyurdu. Fethu'l-Bari Açıklaması: Başlıkta yer alan ayetten maksat, baş tarafındaki \"Kim bir cana veya yeryüzünde bozgunculuk çıkarmaya karşılık olmaksızın (haksız yere) bir cana kıyarsa bütün insanları öldürmüş gibi olur\"(Maide 32) ifadesidir. Burada yer verdiğimiz hadislerin birincisi yani \"Haksız yere öldürülen her nefsin öldürülme günahından mutlaka bir pay ilk Ademoğlu üzerine de olur\" ifadesi ayetin bu hükmüne uygun düşmektedir. Kalan oniki hadis adam öldürmenin ne kadar büyük bir günah olduğu hakkındadır. İbn Battal şöyle demiştir: Bu hadislerde adam öldürmenin ne kadar büyük bir günah olduğu belirtilmekte ve bu fiilden kaçınmak gerektiği mübalağalı bir üslupla vurgulanmaktadır. İbn Battal şöyle demiştir: Selef bilginleri \"Bütün insanları öldürmüş gibi olur, bütün insanları kurtarmış gibi olur\" ifadesinden maksadın ne olduğu konusunda ihtilaf etmişlerdir. Bir kısım bilgin bunun manasının adam öldürmenin günahının ağır olduğunu vurgulamak ve bir mu'mini öldürmenin ne kadar büyük bir sorumluluk olduğunu belirtmektir demişlerdir. Taberi, Hasan-ı Basri, Mücahid ve Katade'nin bu görüşte olduklarını nakletmiştir. Hasan-ı Basri \"Bir tek cana kıyan kimse, bütün insanları öldürmüşçesine cehenneme gider\" demiştir. Bazıları, ayetin manası bütün insanlar onun hasmı olur demektir derken, bazı bilginler bir mu'mini öldürmesi dolayısıyla o kimseye bütün insanları öldürdüğünde nasıl kısas gerekiyorsa öylece gerekir demişlerdir. Çünkü herkesin lehine kısas olarak ona bir adet ölüm cezası uygulanır. Bu görüşü Taberi, Zeyd b. Eslem'den nakletmiştir. Taberi ayetten maksadın cezanın büyük olduğunu vurgulamak ve tehdidin şiddetini belirtmek olduğu görüşünü tercih etmiştir. Zira ayette bir kişiyi öldürmekle, herkesi öldürmek Allah'ın gazabını ve azabını çekme açısından eşittir. Buna mukabil hiç kimseyi öldürmeyen kişi, herkes elinden selamette kaldığı için bütün insanlığı kurtarmış gibi olur. Hadisteki \"ilk Ademoğlu\"'dan maksat, bilginlerin çoğuna göre Kabil'dir. Hadiste geçen \"……el-kifl\" kelimesi, pay anlamındadır. Bu kelime çoğunlukla ecir ve sevap karşılığı kullanılırken, zayıf bir görüşe göre günah karşılığında da kullanılır. \"Ey iman edenler! Allah 'tan korkun ve Nebiine inanın ki o, size rahmetinden iki kat versin\" ayetinde geçen \"\" nasip ve ecir manasındadır.(Hadid 28) \"......\" kelimesi \"Kim kötü bir işe aracılık ederse onun da ondan bir payı 0lur\"(Nisa 85) ayet-i kerimesinde günah anlamında kullanılmıştır. \"Çünkü o adam öldürme adetini ilk çıkaran kişidir\" ifadesinden bir uygulamayı ilk başlatan kişiye ya sevap ya da günah yazılacağı sonucu çıkmaktadır. Helal olmayan bir şeye yardımcı olmak haramdır kaidesi buna dayanmaktadır. Müslim'in Cerir'den nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Kim İslamda güzel bir çığır açarsa onun ve onu işleyenlerin sevabı kıyamete kadar o kişiye olur. Kim de İslam'a kötü bir çığır açarsa onun günahı ile işleyenlerin günahı kıyamete kadar onun üzerinde olur. \"(Müslim, İlim, Zekat) Bu, açtığı çığırdan dolayı tövbe etmeyen kimse için de sözkonusudur denilmiştir. \"Benden sonra kafirlerin adetine dönüp birbirlerinizin boyunlarını vurmayınız!\" Bu cümlenin ne anlama geldiği hakkında sekiz görüş ileri sürülmüştür. 1- İfade, Haridierin anladığı gibi zahiri üzeredir. 2- İfade, boyun vurmayı helal sayanlarla ilgilidir. 3- İfade kanların, Müslümanların ve dinin haklarını inkar eden kişiler olarak dönmeyiniz demektir. 4- Birbirinizi öldürerek kafirlerin fiillerini yapan kişiler olmayınız. 5- Silah kuşanan kimseler olarak dönmeyiniz. Çünkü Arapça' da \"\"-P J:> .;s\" zırhını bir kumaş parçasıyla örttü demektir. 6- Allah'ın nimetine nankör kimseler olarak dönmeyiniz. 7 - Bu ifadeden maksat zahiri manası değil, o fiili yapmaktan kaçındırmaktır. 8- Birbirinizi tekfir eden kimseler olarak dönmeyiniz yani iki fırkadan biri diğerine ey kafir deyip, onu tekfir etmesin. Bundan sonra dokuzuncu ve onuncu bir açıklama daha buldum. Bunları Fiten bölümünde zikrettim. Hadisin geniş bir açıklaması inşallah Fiten bölümünde gelecektir. \"İnsanları sustur.\" Yani onlardan konuşmamı dinlemeleri için susmalarını iste. \"Sabah vakti o kavme baskın yaptık.\" Yani o insanlar henüz sabah vati daha ne olduğunu bile anlamaya fırsat bulamadan onlara saIdırdık. Arapça'da \"\" ona sabahleyin ansızın geldim demektir. \"Bir sabah kendilerine, yakalarını bir daha bırakmayacak olan bir azap gelip çattl\"(Kamer 38) ayet-i kerimesinde kelime bu anlama kullanılmıştır. .....= onu kuşatıp yakalayınca\" yani ona yetişip, etrafı bizim tarafımızdan sarıldığında demektir. \"Onu adamı 'la ilahe illailah' demesinin ardından niçin öldürdün?\" İbnü'tTın şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in bu kınaması, öğüt için bir tali m ve tebliğdir. Bundan maksat, hiç kimsenin kelime-i tevhidi telaffuz eden kimseyi öldürmeye kalkışmamasıdır. Kurtubi şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'in bu soruyu tekrarlaması ve Usame'nin mazeretini kabul etmemesi, böyle bir fiile atılmayı ağır bir ifade ile engellemektedir. \"Keşke bugünden önce Müslüman olmayaydım diye temenni ettim.\" Yani keşke bugün Müslüman olsaydım diye temenni ettim. Çünkü İslam kendisinden önceki tüm hataları ve günahları silip, yok eder. Usame o fiilin sorumluluğundan emin olmak için İslam'a tam o sırada girmeyi temenni etti. Bununla o andan önce Müslüman olmamayı temenni etmedi. Kurtubi şöyle demiştir: Usame'nin bu sözü, -Nebi Sallallahu Aleyhi ve Sellem' den duymuş olduğu şiddetli tepkiden dolayı- işlediği o fiilin karşısında daha önceki salih amellerini küçük gördüğünü göstermektedir. Onun bu şekilde temennisi mübalağa niteliklidir. Bunun mübalağa olduğunu, hadisin A'meş'in bazı rivayet yollarında \"O gün Müslüman olmayı temenni ettim\" şeklindeki ifadesidir. \"Kim bize silah çekerse artık o kimse bizden değildir.\" Burada söylenmek istenen şudur: Kim Müslümanlarla çarpışmak için onlara silah çekecek olursa onlardan olmaz. Çünkü bu hareket onların yüreğine korku salar. Buna karşılık, onları korumak için silah çekmek böyle değildir. Çünkü bu takdirde kişi silahı onların aleyhinedeğil, lehlerine çekmektedir. \"Bizden değildir\" yani bizim gittiğimiz yolda gitmemektedir, anlamınadır. Hz. Nebi Sallallahu Aleyhi ve Sellem'in ifadesini - \"Kim bize silah çekerse İslam dininden değildir\" manasını kastetme ihtimaline rağmen- mutlak olarak kullanması, o fiili caydırma ve korkutmada mübalağada bulunmak içindir. \"Ateştedir\" yani eğer Allah kendilerini ateşe sokacak olursa ateştedir demektir. Çünkü katil ile maktul azaba uğramayı hak ettikleri bir fiil işlemişlerdir. Hattabi şöyle demiştir: Buradaki tehdit mesela dünyevi bir düşmanlık veya bir mülk talebi için adam öldüren kimseye yöneliktir. Zira zalimlerle çarpışan veya kendisine saldıranı savuşturup, öldüren kimse bu tehdide dahil değildir. Zira o şer' an çarpışmaya izinlidir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 14
			}
		}
	]
}