{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6876,
			"arabicnumber": 6876,
			"text": "Enes b. Malik'in nakline göre yahudinin biri bir cariyenin başını iki taşın arasında ezdi. O cariyeye \"bunu sana kim yaptı? Filanca mı yoksa filanca mı?\" diye soruldu. Sonunda yahudinin adı verilince, o kişi Nebi Sallallahu Aleyhi ve Sellem'e getirildi. Orada alıkonuldu. Nihayet suçunu itiraf edince, onun da başı taşla ezildi.\" Fethu'l-Bari Açıklaması: \"Katili suçunu itiraf ettirmek amacıyla sorgulama ve had cezalarında ikrarın durumu.\" İbn Abdilberr şöyle demiştir: Fıkıh bilginleri, katil bir kölenin, hür bir kişiye, katil bir kadının erkeğe, katil bir erkeğin de kadına karşılıkkısasen katledileceği noktasında icma etmişlerdir. Ancak Hz. Ali gibi bazı sahabi ve Hasan-ı Basri gibi tabiun alimlerinden nakledilen bir görüşe göre bir erkek bir kadını öldürdüğünde kadının akrabaları, o erkeği öldürmek istediklerinde diyetin yarısını vermekle yükümlüdürler. Katili kısasen öldürmedikleri takdirde tam bir diyet alırlar. İbn Abdilberr şöyle der: Hz. Ali' den böyle bir görüş sahih olarak naklediimiş değildir. Fakat bu görüş, Basra fakihlerinden biri olan Osman eL.-Bettl'ye aittir. Kısas açısından erkekle kadının birbirine eşit olduğunu bilginlerin şu ittifakı göstermektedir: Eli kesik veya bir gözü kör bir kişiyi böyle olmayan sağlam bir kimse teammüden öldürdüğü takdirde ona kısas uygulamak gerekir. Öldürülenin bir gözünün kör veya elinin kesik olması, katilin söz konusu noksanlığın diyetten karşılığını almasını gerektirmez. İmam Buharl'nin \"Katili suçunu itiraf ettirmek amacıyla sorgulama\" şeklindeki başlığı, adam öldürmekle suçlanan ve aleyhinde bir beyyine bulunmayan kimseyi suçunu itiraf ettirmek amacıyla sorgulama demektir. \"Cariyenin başını ezdi.\" Hadisin metninde geçen \"er-rad\" ile \"er-radh\" aynı manadadır. Hadiste geçen \"cariye\"nin, bildiğimiz cariye olma ihtimali bulunduğu gibi ergenlik yaşına gelmemiş \"hür kız çocuğu\" olma ihtimali de sözkonusudur. Hişari1 b. Zeyd'in bundan sonraki bölümde yer alan Enes hadisi şöyledir: \"Üzerinde gümüş zınet eşyası bulunan bir cariye Medine'de evden dışarı çıktı. Yahudinin biri ona taş attı.\" Bu hadiste geçen\" evdahun\", Ebu Ubeyde'ye göre gümüşten yapılmış zınet eşyası demektir. \"Orada alıkonuldu. Nihayet suçunu itiraf edince ... \" Bu ifadeden anlaşılan hakimin cinayet işleyen kimseler aleyhine sonuçlar çıkarmasınin uygun olduğudur. Hakim sanıklar suçlarını itiraf etmeleri ve ikrarlarına binaen kendilerini tutuklamak için onlara kibar davranır. Suçlularından tövbe etmek üzere gelmeleri bunun aksinedir. Zira hakim cinayeti işlediğini açık ifadelerle söylemeyen kimseden yüz çevirir. Zira suçunu itiraf ettiği takdirde ona had cezası uygulamak gerekir. Yukarıdaki olayın devamı, o Yahudi aleyhine herhangi bir beyyinenin mevcut olmamasını ve onun ikrarına binaen cezalandırılmış olmasını gerekli kılmaktadır. Hadisten sırf şikayetçi olmakla ve işaretle kan talebi yapmak gerektiği anlaşılmaktadır. el-Mazerı şöyle demiştir: Bu hadis, kılıçtan başka bir aletle kısas uygulamasını inkar eden ve katil bir erkeğin öldürdüğü kadından dolayı katledilmesini inkar edenlere reddiyedir. .......... yani onun kafasını taşla ezdi demektir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 15
			}
		}
	]
}