{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6877,
			"arabicnumber": 6877,
			"text": "Hişam b. Zeyd'in nakline göre dedesi Enes b. Malik şöyle anlatmıştır: Medine'de üzerinde gümüş zınet eşyası bulunan bir cariye dışarı çıkar. Yahudinin biri ona bir taş atar. Cariye son nefeslerini verirken Nebi Sallallahu Aleyhi ve Sellem'e getirilir. Resulullah Sallallahu Aleyhi ve Sellem ona \"Seni filanca mı öldürmeye teşebbüs etti?\" diye sorunca, cariye başını kaldırarak \"hayır\" işareti yapar. Nebi Sallallahu Aleyhi ve Sellem soruyu tekrar ederek \"seni öldürmeye teşebbüs eden filanca mıydı?\" der. Cariye başını kaldırarak \"hayır\" işareti yapar. Nebi Sallallahu Aleyhi ve Sellem üçüncü kez \"Seni öldürmeye teşebbüs eden filanca mıydı?\" deyince, cariye başını indirerek \"evet\" işareti yapar. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem O kişiyi çağırtır ve başı iki taş arasında ezilerek (kısasen) öldürür. Fethu'l-Bari Açıklaması: \"Taş veya sapa ile öldürmenin hükmü.\" imam J3uharl başlıktaki ifadeyi görüldüğü üzere mutlak olarak kullanmış ve bu konuda ihtilaf olduğuna işaret etmek için kesin bir ifade kullanmamıştır. Fakat onun burada yer verdiği hadis, çoğunluğun görüşünü tercih ettiğine işaret etmektedir. imam Buhari, bu konuda bir yahudinin bir cariyenin hayatına kastettiğinden söz eden hadise yer verir. Bu, \"Bir katil öldürmede kullandığı aletle (kısasen) katledilir\" görüşünde olan çoğunluğu destekleyen bir delildir. Bu bilginler \"Eğer ceza verecekseniz, size yapılan işkencenin misliyle ceza verin\"(Nahl 126) ayeti ile \"Kim size saldınrsa siz de ona misilleme olacak kadar saldınn\"(Bakara 194) ayetlerini esas almışlardır. Ancak Kufeli fıkıh bilginleri bunlara muhalif kalmışlardır. Onlar \"Kılıçtan başka bir şeyle kısas olmaz\" hadisini delilolarak almışlardır. Ancak bu hadis zayıftır. Hadisi Bezzar, İbn Adiy, Ebu Bekre'den rivayet etmişlerdir. İbnü'l-Münzir şöyle demiştir: Fıkıh bilginlerinin çoğunluğuna göre bir kimse birisini bir şey kullanarak öldürürse genellikle onun gibi bir şeyle (kısasen) katledilir. Bir alet kullanarak katletme, teammüden öldürmedir. Ata ve Tavus teammüden öldürmenin şartı, silah kullanmaktır demişlerdir. İbnü'l-Arabı içki içmek, homoseksüel ilişki (livata) ve yakmak gibi içinde günah olan yollarla misilleme yapmak bundan müstesnadır. Yakma meselesinde Şafiı mezhebinde ihtilaf sözkonusudur. Ancak ilk ikisi üzerinde bilginlerin ittifakı vardır",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 16
			}
		}
	]
}