{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6881,
			"arabicnumber": 6881,
			"text": "İbn Abbas r.a. şöyle demiştir: İsrailoğulları arasında kısas uygulanıyordu. Onların arasında diyet diye bir uygulama mevcut değildi. Allahu Teala bu ümmete \"Öldürülenler hakkında size kısas farz kılındı\" ayetinden başlayarak \"her kimin cezası kardeşi (öldürülenin velisi) tarafından bir miktar bağışlanırsa artık (taraflar) hakkaniyete uymalı\" ayetine kadar olan ayetler indi. (Bakara 178) İbn Abbas şöyle dedi: Af, teammüden öldürme de (mağdur yakınlarının kısastan vaz geçip) diyeti kabul etmeleri demektir. İbn Abbas sonra ..........= hakkaniyete uymalı\" yani iyilikle talep etmeli ve güzellikle ödemelidir, dedi. Fethu'l-Bari Açıklaması: İmam Buhari, başlığı haber formunda atmaktadır. Bu ifadenin zahiri sözkonusu muhayyerlik, diyet almakla katili kısas etmek, maktulün velilerine bırakılmıştır görüşünü benimseyen bilginlerin lehine delildir. Bu konuda katilin rızası şart değildir. Yukarıdaki atılan başlıkta kastedilen bu kadarıdır. Buradan hareketle İmam Buhari, Ebu Hureyre hadisi ile \"her kimin cezası kardeşi (öldürülenin velisi) tarafından bir miktar bağışlanırsa\" ayetinin tefsiri mahiyetinde olan İbn Abbas hadisine yer vermiştir. Ayette söylenmek istenen şudur: Maktulün velisi, onun kanını talep etmekten vazgeçip diyet vermesine razı olursa bu takdirde \"......\" yani diyeti talep edebilir. İbn Abbas ayette geçen \"af\" kelimesini teammüden öldürmelerde diyeti kabul etme şeklinde tefsir etmiştir. Diyeti kabul etme, kısas talep etme hakkı olan maktul velilerine aittir. Öte yandan katil kendi rızasına bakılmaksızın diyeti vermekle yükümlü tutulmuştur. Çünkü o \"Kendinizi öldürmeyiniz\"(Nisa 29) ayet-i kerimesinin genelliği dolayısıyla kendisini hayatta tutmakla emredilmiştir. Maktulün yakınları ondan diyet almaya razı olduklarında katilin bunu kabul etmeme gibi bir yetkisi yoktur. İbn Battal şöyle demiştir: \"Bu söylenenler Rabbinizden bir hafifletme ve rahmettir\"(Bakara 178) ayetinin manası İsrailoğullarında diyet uygulamasının olmadığına işaret etmektedir. İsrailoğullarında kısas, başvurulan bir tek ceza metoduydu. Allahu Teala maktulün yakınları razı 0lduğu takdirde diyet alma uygulaması getirerek bu ümmete hükmü hafifletmiştir. \"Allah fil'in Mekke'ye girmesine mani oldu.\" Nebi Sallallahu Aleyhi ve Sellem, filin Mekke'ye girmesinin engellenmesi ifadesi ile Habeşlilerin yaşadığı olaya işaret etmektedir. Bu olay meşhur olup, İbn İshak tarafından geniş geniş açıklanmıştır. Onun uzun açıklamalarını şöyle özetlemek mümkündür: Hıristiyan olan Habeşistanlı Ebrehe Yemen'i ele geçirince bir kilise yaptı ve insanları buraya hacca gelmeye zorladı. Araplardan birisi harekete geçerek bekçilerin dalgınlığından yararlanıp, kilisenin içine dışkısını yaptı ve sonra kaçtı. Ebrehe bunu duyunca öfkelendi ve Ka'be'yi yıkmaya karar verdi. Kalabalık bir ordu hazırladı ve yanına büyük bir fil aldı. Mekke'ye yaklaşınca Abdulmuttalib karşısına dikildi. Ebrehe ona hürmet etti. Çünkü Abdulmuttalib güzel ve yakışıklı bir insandı. Abdulmuttalib ondan yağmaladığı develerini geri istedi. Ebrehe, Abdulmuttalib'in ucuz hesapların adamı olduğunu düşündü ve \"Benden sadece yapmayı düşündüğüm şeyi yapmamamı rica edeceğini zannetmiştim\" dedi. Bunun üzerine Abdulmuttalib \"Bu beytin kendisini koruyacak Rabbi vardır\" dedi. Bunun üzerine Ebrehe ona develerini iade etti. Ebrehe ordularıyla ilerledi ve en öne o fili kattı. Ancak fil yere çöktü, onu kaldırmayı başaramadılar. Allahu Teala onların üzerine ikisi ayaklarında, birisi gagalarında olmak üzere üç taş bulunduran kuş sürüsü gönderdi. Kuşlar bu taşları onların üzerine attı ve Ebrehe ordusundan bu taşların isabet etmediği hiç kimse kalmadı. \"Ve men kutile lehu katflun\" yani kimin hayatta olan bir yakını öldürülür ve bu yüzden maktul haline gelirse ... \"Bu kişi iki seçenekten birini tercih edebilir.\" Tirmizi'nin, Evzaı yoluyla yaptığı rivayette \"Bu kişi ya affeder ya da katili (kısasen) öldürür\" denilmektedir.(Tirmizi, Diyat) Burada \"af\"tan maksat, her iki rivayeti birbiriyle cem ve telif etmiş olmak için kısastan vazgeçip, diyeti kabul etmek anlamındadır. Hadisten maktul yakınının kısasla diyetten birini tercih etmede muhayyer olduğu anlaşılmaktadır. Maktul l,.'akını diyeti tercih ettiğinde katilin bu isteğe uyma zorunluluğu olup olmadığı noktasında bilginler ihtilaf etmişlerdir. Bilginlerin çoğu katilin bu isteğe boyun eğmek zorunda olduğu kanaatine varmıştır. İmam Malik'ten gelen bir rivayete göre diyet ancak katilin rızası ile gerekli olur. O, görüşünü \"kimin bir yakını öldürülürse\" ifadesine dayandırmaktadır. Bu ifadeden hakkın maktulün varislerine ait olduğu anlaşılmaktadır. Maktul yakınlarından bazıları mevcut olmaz veya çocuk olursa kalan velilerin çocuk olan ergenlik çağına ermedikçe ve gaib olan geri dönmedikçe katili kısas ettirme hakları yoktur. Ya katil veya yakınları maktul yakınlarına diyet öder ya da katil bu suçundan dolayı (kısasen) katiedilir. Hadis-i şeriften Harem bölgesinde kısas uygulamanın caiz olduğu anlaşılmaktadır. Çünkü Nebi Sallallahu Aleyhi ve Sellem Mekke' de bu hitabı yapmış ve sözkonusu kısası Harem dışında yapılması şeklinde kayıtIamamıştır. \"Sonra Kureyş'ten bir kişi ayağa kalktı ve 'Ya Resulallah! İzhir otu hariç ol• sun' dedi.\" Ayağa kalkan kişinin Hz.Abbas b. Abdulmuttalib olduğu daha önCE geçmişti. Hadisin Mekke'nin haramlığı ve izhir otuyla ilgili kısmının açıklaması Hac bölümünde adı geçen başlıkların altında daha önce yapılmıştı. \"Allahu Teala bu ümmete 'öldürülenler hakkında size kısas farz kılındı' buyurdu.\" İsmail el-Kadı, Ahkamu'l-Kur'an'ında \"cana can\"dan maksat, şer'ı cezalar (hadler) açısından birbirine denk olan candır demiştir. Çünkü hür bir kişi, bir kölenin iffetine iftira attığında bilginlerin ittifakıyla sopa cezasıyla cezalandırılmaz. Kısasen katiedilmek had cezalarındandır. İsmail el-Kadı şöyle demiştir: Bunu Allahu Teala \"Yaralar da kısastır. Kim bunu (kısası) başlarsa kendisi için kefaret 01ur\"(Maide 45) ayetinde açıklamıştır. Buradan hareketle köle ve kafir bu hükmün dışında olur. Zira kölenin kanını ve yarasını tasadduk etme hakkı yoktur. Kafire gelince, ona \"tasadduk eden\" ismi verilemeyeceği gibi, \"kefaret veren\" de denemez. Bize göre İbn Abbas'ın açıklamasından anlaşılan, Allahu Teala'ın \"Onlara Tevrat'ta şöyle yazdık\" (Maide 45) ayeti Tevrat'ta İsrailoğullarına mutlak olarak \"cana can\" yazdık demektir. Bu hüküm, kısas hakkı olan kişilere affettikleri katilin öldürülmesi yerine diyet isteme yetkisi verilerek ve \"cana can\" ilkesi hüre karşı hür şeklinde genelliği daraltılarak hafifletiimiştir. Bu durumda köleyi öldüren hürün, kafiri öldüren Müslümanın kısasen katiedileceği hükmünü benimseyenleri Maide ayetinden destekleyecek bir delil bulunmadığı ortaya çıkmaktadır. Çünkü bizden önceki ümmetierin şeriatı, bizim şeriatımızda ona aykırı bir hüküm gelmediği sürece esas alınır. Hz. İsa'nın şeriatında kısas yoktu. Sadece diyet vardı denilmiştir. Eğer bu sabitse İslam şeriatı her iki uygulamaya da yer vermiş olmakta ve böylece ifrata ve tefrite kaçmaksızın ortada bulunmaktadır. Yukarıdaki hadis, katili kısas ettirmekle, diyet alma arasında muhayyer olan kişinin maktulün velisi olduğunu göstermektedir. Çoğunluğu oluşturan fıkıh bilginlerinin benimsediği görüş de budur. Hattabı ayette zikredilen \"aff'ın açıklamaya ihtiyacı olduğunu ifade etfuiştir. Çünkü kısasın zahirine bakacak olursak katille maktul yakınları arasında herhangi bir ilişki ve münasebet yoktur. Fakat ayetin manası ise şöyledir: Maktulün yakınları her kimi kısas etmekten vazgeçip, diyete razı olurlarsa diyeti hak edenlerin hakkaniyete uyması gerekir. Bu diyeti talep etmede hakkaniyettir. Katilin ise ödeme zorunluluğu vardır ki bu da diyeti güzellikle vermektir. imam Malik, Sevrı, Ebu Hanife kısasla diyet arasında muhayyerliğin katile ait olduğu hükmünü benimsemişlerdir. Bu ayetin nüzul sebebi konusunda ihtilaf edilmiştir. Bazıları ayet Araplardan iki mahalle hakkında indi. Bunlardan biri diğerinden daha şerefli idi. Şerefli olanlar karşı tarafın kadınları ile mehirsiz olarak evleniyarlardı. Aralarından bir köle öldürüldüğünde ona karşılık karşı taraftan bir hür kimseyi veya bir kadın öldürüldüğünde ona karşılık bir erkeği öldürüyorlardı. Bu haberi Taberi, Şa'bl'den rivayet etmiştir. Habere Ebu Davı1d da yer vermiştir. ibn Abbas şöyle anlatmıştır: Kureyza ve en-Nadır diye iki kabile vardı. en-Nadır, Kureyza'dan daha şerefliydi. Kureyza'dan birisi Nadır'den bir kişiyi öldürdüğünde katil kısasen öldürüıürdü. Nadır'den birisi Kureyza'dan birini öldürdüğünde yüz vesk hurma fidye verirdi. Nebi Sallallahu Aleyhi ve Sellem, Nebi olarak gönderildiğinde Nadır' den bir kişi Kureyza'dan birini öldürdü. Bunlar izin verin katili kısasen öldürelim dediler. Karşı taraf ise aramızda Nebi Sallallahu Aleyhi ve Sellem hakem olsun dediler ve Resulullaha geldiler. Bunun üzerine \"Ve eğer hüküm verirsen aralarında adaletle hükmet\"(Maide 42) ayet-i kerimesi indi. Ayette geçen \"kıst\" kelimesi cana can demektir. Sonra \"Yoksa onlar cahiliye idaresini mi arıyorlar\" ayeti indi.(Maide 50) Çoğunluğu oluşturan fıkıh bilginleri bu ayetten hile yoluyla olsa bile teammüden öldürme de diyet almanın caizliği hükmünü çıkarmıştır. Hileden maksat bir kimsenin maktulü aldatıp, kimsenin görmeyeceği bir yere götürerek orada katletmesi demektir. Malikiler bu hükme muhalif kalmışlardır. Bazı Maliki alimleri teammüden adam öldürdükten sonra Harem-i Şerif'e sığınan kişinin katledilebileceğini bu ayetten çıkarmışlardır. Buna karşılık bazıları, katil Harem' de katledilmez, tam tersine oradan çıkması beklenir diyerek bu hükme muhalif kalmışlardır. Hadisin bu hükme nasıl delalet ettiğine gelince; Resulullah Sallallahu Aleyhi ve Sellem bunu Harem bölgesinde öldürülmüş Huzaalı maktul olayı üzerine söylemiştir. Tea.mmüden öldürülmüş kimse hakkında kısas hükmü getirilmiştir. Harem-i Şerif'in dökunulmazlığı hakkında zikredilen ifade bununla çelişmez. Çünkü Harem-i Şerif'in dokunulmazlığından maksat, Allahu Teala'ın haram kıldığı şeyleri haram kılmak suretiyle Harem'e ta'zimde bulunmaktır. Cinayet işleyen birisine had cezasını orada uygulamak Allah'ın haramlarına ta'zim arasında yer alır",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 20
			}
		}
	]
}