{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6890,
			"arabicnumber": 6890,
			"text": "Aişe r.anha şöyle anlatmıştır: Uhud savaşı günü müşrikler yenildiler. İblis \"Ey Allah'ın kulları! Arkanıza dikkat!\" diye bağırdı. Bunun üzerine önde bulunanlar arkaya döndüler ve onlarla arkadakiler çatışmaya başladılar. Huzeyfe etrafa bakarken bir de ne görsün, babası el-Yeman Huzeyfe \"Ey Allah'ın kulları! Babam o, babam o!\" diye bağırdı. Hz. Aişe r.anha şöyle devam eder: Allah'a yemin olsun ki onu kurtaramadılar ve sonunda öldürdüler. Huzeyfe \"Allah sizi affetsin\" dedi. Urve şöyle demiştir: Huzeyfe babasını öldüren Müslümanlara son nefesini verinceye kadar dua ve istiğfar etti durdu. Fethu'l-Bari Açıklaması: \"Kalabalık içinde ölme veya öldürülme.\" İmam Buhari burada Huzeyfe'nin babası el-Yeman'ın öldürülmesi olayını konu alan Aişe r.anha hadisine yer vermiştir. İbn Battal şöyle der: Hz. Ali ve Ömer bu durumda ölen kimsenin beytü'l-malden diyetini vermek gerekir mi yoksa gerekmez mi diye ihtilaf etmişlerdir. İshak, verilmesi gerektiğini söylemiştir. Onun bakış açısı şöyledir: Ölen kişi, . Müslüman bir topluluğun fiili neticesinde ölmüş bir Müslümandır. Dolayısıyla beytü'l-malden diyetini vermek gerekir. Biz de şunu ekleyelim: Herhalde İshak'ın delili Huzeyfe olayının rivayet yollarından birinde yer alan ifadedir. Bunu Ebü'!Abbas es-Serrac, Tarih'inde İkrime'den şöyle nakleder: Uhud günü Huzeyfe'nin babasını bir Müslüman müşriklerden zannederek öldürdü. Resulullah Sallallahu Aleyhi ve Sellem Sallallahu Aleyhi ve Sellem onun diyetini ödedi. Bu haberin ravileri -mürsel olmakla birlikte- sikadır. Söz konusu haberin yanlışlıkla öldürmede af konusunda mürsel bir şahidi geçmişti. Müsedded'in Müsned'inde Yezid b. Mezkur'dan rivayetine göre adamın biri bir Cuma günü kalabalık tarafından sıkıştırıldı ve öldü. Bunun üzerine Hz. Ali onun diyetini beytü'l-malden ödedi. Bu konuda başka görüşler de vardır. Bunlardan birisi Hasen-i Basrl'ye aittir. Buna göre ölen kişinin diyeti orada bulunan herkes tarafından ödenmelidir. Bu bir önceki görüşten daha özeldir. Bu görüşün dayanağı şu anlayıştır: O kişi orada bulunanların fiilleri neticesinde ölmüştür. Dolayısıyla yaptıkları fiilin neticesi kendilerinden öteye geçip, başkalarını etkilemez. Bu konudaki görüşlerden birisi de İmam Şafiı ve ona tabi olanlara aittir. Buna göre ölen kişinin velisine \"Dilediğin bir kimseden davacı 01. Eğer yemin edersen diyeti hak edersin, yeminden kaçınırsan davalı kimse gerçeğin böyle olmadığına dair yemin eder ve böylece dava düşer\" denir. Bu yaklaşımın düşünce tarzına gelince, alen kimsenin kan bedeli ancak talep neticesinde ödenmesi gerekli olan bir yükümlülük haline gelir. Bir başka görüş ise İmam Malik' e aittir. Ona göre bu durumda ölen kimsenin kanı heder olmuştur. Bu yaklaşımın düşünce tarzı ise şöyledir: Ölen kimsenin katilinin kim olduğu bilinmediğine göre herhangi bir kimseyi sorumlu tutmak imkansızdır. Bu görüşlerden hangisinin tercihe değer olduğuna \"Yanlışlıkla Öldürmede Af\" başlığı altında işaret edilmiştir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 28
			}
		}
	]
}