{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6891,
			"arabicnumber": 6891,
			"text": "Seleme şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'la birlikte Hayber'e çıkmıştık. Onlardan birisi \"Ey Amir! Bize kısa şiirlerinden bir şeyler söyle\" dedi. O kişi de bunları şiir söyleyerek götürdü. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Sevkeden kimdir?\" diye sordu. Oradakiler \"Amir' dir\" dediler. Resulullah Sallallahu Aleyhi ve Sellem 'Iillah ona rahmet eylesin\" dedi. İnsanlar \"Ya Resulallah! Keşke bizi ondan biraz daha yararlandırsaydınız!\" dediler. Amir, o gecenin sabahında yaralandı. İnsanlar \"Amir'in ameli boşa gitti. Kendi kendini öldürdü\" dediler. Onlar Amir'in ameli boşa gitti derken ben döndüm ve Resulullah Sallallahu Aleyhi ve Sellem'e dedim ki: \"Ya Resulallah! Anam babam sana feda olsun! İnsanlar Amir'in amelinin boşa gittiğini söylüyorlar.\" Resulullah Sallallahu Aleyhi ve Sellem \"Bunu söyleyenler yalan söylerler. Onun iki sevabı var. O hem cahid ve hem de mücahiddir. Hangi katil onun ecrine ecir katabilir\" dedi. Fethu'l-Bari Açıklaması: \"Kendisini yanlışlıkla öldürenin diyetinin olmadığı\" konusunda İsma1li şöyle der: Kendisini teammüden öldüren e de diyet yoktur. Netice olarak \"yanlışlık\" kelimesinin anlama kattığı herhangi bir farklılık mevcut değildir. Öyle anlaşılıyor ki İmam BuhM' öldürmeyi \"yanlışlık\" kelimesiyle bu konunun ihtilaflı olması dolayısıyla kayıtlamışhr. İbn Battal şöyle der: Evzaı, Ahmed b. Hanbel ve İshak, bu durumdaki kimsenin akilesinin diyetini ödemesi gerekir demişlerdir. Böyle bir kimse yaşadığı takdirde bu diyeti onlardan alır, öldüğü takdirde diyeti varislerinindir. Çoğunluğu oluşturan fıkıh bilginleri şöyle der: Bu konuda herhangi bir şey vermek gerekli değildir. Burada yer verdiğimiz Amir olayı çoğunluğu destekleyen bir delildir. Zira Nebi Sallallahu Aleyhi ve Sellem'in bu olayda Amir için herhangi bir şey vermesi gerektiğine hükmettiği nakledilmemiştir. Şayet bir şey vermek gerekseydi, Resulullah Sallallahu Aleyhi ve Sellem bunu açıklardı. Zira ihtiyaç anında açıklamayı ertelerrek caiz değildir. Bilginler bir kimse teammüden veya yanlışlıkla bir tarafını kestiği takdirde ona herhangi bir şey vermek gerekmediği noktasında görüş birliği etmişlerdir. İbn Battal şöyle demiştir: Bu rivayet yolunda Amir'in kendisini ne şekilde öldürdüğü belirtilmemektedir. Bu konu Edep bölümünde daha önce geçmişti. Orada şöyle demiştik: \"Amir'in kılıcı kısaydı. Bir yahudiye saldırmak üzere kılıcını eline almıştı. Kılıcın ucu döndü ve onun dizine geldi",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 29
			}
		}
	]
}