{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6894,
			"arabicnumber": 6894,
			"text": "Enes'in nakline göre \"en-Nadr'ın kızı bir cariyenin yüzüne tokat attı ve ön dişini kırdı. İnsanlar Nebi Sallallahu Aleyhi ve Sellem'e geldiler. Resulullah Sallallahu Aleyhi ve Sellem kısas uygulanmasını emretti.\" Fethu'l-Bari Açıklaması: \"Dişlerde Kısas.\" İbn Battal şöyle demiştir: Bilginler kasıtlı yapıldığı takdirde dişe karşı dişin kısasen çıkarılacağı noktasındaicma etmişlerdir. Buna karşılık vücudun diğer kemikler konusunda kısas uygulanıp, uygulanamayacağı noktasında ihtilaf etmişlerdir. İmam Malik \"Vücudun diğer kemiklerinde de kısas uygulanır. Ancak içi boş kemikler veya me'mume, munakkıle ve ha.şime gibi yaralar bundan müstesnadır. Bu tip yaralarda diyet gerekir\" demiş ve delil olarak ilgili ayeti göstermiştir. Ayetinbuna delilolması şu açıdandır: Bizden öncekilerin şeriatı, -bizim Nebiimiz tarafından inka.r edilmeksizin nakledildiği takdirde- bizim için de uyulması gereken bir şeriattır. Allahu Teala'ın \"dişe diş\" şeklindeki ifadesi kemiklerde kısas uygulanacağını göstermektedir. Çünkü diş bir kemiktir. Ancak bilginlerin kişinin ölmesi endişesiyle veya kısas edilecek organda mislilik imkanı bulunmaması nedeniyle hakkında kısasa başvurulamayacağına icma ettikleri bundan müstesnadır. İmam Şafii, Leys ve Hanefiler şöyle demişlerdir: Diş dışında kemiklerde kısas uygulanamaz. Çünkü kemiğin üzerinde deri, et, sinir gibi engeller bulunmaktadır. Bu engeııerin varlığı ile misliliği sağlamak imkansızdır. Eğer mislilik imkanı olsaydı, kısas uygulanacağına hükmederdik Fakat kısas uygulayacak infaz memeru (ceııat) kemiğe ulaşamaz, onun dışında miktarı bilinmeyen bir derinlikte kalabilir. \"Resulullah Sallallahu Aleyhi ve Sellem kısas uygulanmasını emretti.\" İmam Buhari Sulh bölümünde \"Erkeklerle Kadınlar Arasında Kısas\" başlığı altında az önce aktardıklarımıza \"Enes b. en-Nadr dedi ki ... \" cümlesini ilave etmiş ve ifadeyi \"Cariyenin akrabaları razı oldular ve affettiler\" şeklinde bitirmiştir. Fezarı'nin rivayetinde \"Cariyenin akrabaları razı oldular ve erş vermeyi kabul ettiler\" cümlesi yer almıştır.(Buhari, Sulh) Mu'temir şöyle farklı bir rivayette bulunmuştur: Nebi Sallallahu Aleyhi ve Sellem bu duruma hayret etti ve \"Allah'ın öyle kulları vardır ki yemin etseler Allah onları yeminlerinde yalancı çıkarmaz\" yani yeminine sadık kılar buyurdu. Nebi s.a.v. \"Allahu Teala 'ın öyle kulları vardır ki\" ifadesiyle bir tevafuk eseri olan bu olayın Yüce Allah'tan yemininde sadık olması için Enes'e verilmiş bir ikram olduğuna ve onun duasını kabul edip, ihtiyaçlarını verdiği kuııarından birisi bulunduğuna işaret etmektedir. Enes b. en-Nadr'ın Nebi Sallallahu Aleyhi ve Sellem kısası emrettiğini duyduğu halde er-Rubeyyi'in dişinin kırılmasına karşı çıkması, sonra da \"erRUbeyyi'in dişi kırılır mı?\" demesi, ardından onun dişinin kırılamayacağını yeminle belirtmesi, bilginler arasında problemli görülmüştür. Buna Enes b. Nadr bu ifadesiyle karşı tarafın en-Nadr'ın kızını bağışlamaları için Nebi Sallallahu Aleyhi ve Sellem nezdinde aracılık talebini vurgulamak isteğine işaret etmiştir diye cevap vermiştir. Bazıları ise Enes'in ettiği bu yemin kısasın kesin olduğunu öğrenmesinden önce idi. O kısas, diyet veya bağışlama arasında muhayyer olduğunu zannediyordu demişlerdir. Başka bazı bilginler ise Enes bu ifadesiyle mutlak olarak kısası inkar etmek, reddetmek istememiş, tam tersine bunu Yüce Allah'ın lutfundan karşı taraftaki insanlara en-Nadr'ın kızını bağışlamaları veya erşi kabul etmeleri için hoşnutluk ilham etmesi beklentisi ve umudu ile söylemiştir demişlerdir. Dbi bu görüşü kesin bir dille şu şekilde ifade etmiştir: Enes bu cümleyi Nebi Sallallahu Aleyhi ve Sellem'in hükmünü reddetmek için söylememiştir. Tam tersine o kısasın gerçekleşmeyeceğini ifade etmiştir. Çünkü onun kendisini ilgilendiren işlerde Allah'ın lutufkar davranacağı umudu ve ettiği yemininde kendisini hayal kırıklığına uğratmayacağı ve karşı tarafın gönlüne af ilham ederek istediği konudaki beklentisini boşa çıkarmayacağı zannı vardı. Gerçekten de gelişme onun istediği gibi oldu. 1. Bir kimsenin vuku bulacağını zannettiği hususta yemin etmesi caizdir. Böyle bir durumla karşılaşan kimseyi -fitneye düşmesi endişesi bulunmadığı takdirde- övmek mümkündür. 2.Kısastan af müstehaptır. 3.Af konusunda şefaat etmek müstehaptır. 4. Kısasta veya diyette muhayyerlik, karşı taraf aleyhine hak sahibinin hakkıdır. 5. Yaralama ve dişlere zarar verme durumunda kadınlar arasında kısas uygulanabilir 6.Diyet üzerine sulh yapılabilir, 7. Diş kırmada kısas uygulanabilir. Sözkonusu kısas, iki diş arasında misliliğin mümkün olduğu durumlarda uygulanabilir. Bu da kırılan dişin ölçülebilir olmasını gerektirir. Bu durumda suçlu olan kişinin dişi, mağdurun dişi kadar olmak şartıyla -mesela törpüyle törpülenerek- küçü1tüıür. Ebu Davud es-Sünen'inde şöyle demiştir: Ahmed b. Hanbel'e \"Dişte kısas nasıl uygulanır?\" diye sordum. Bana \"Törpülenerek\" diye cevap verdi",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 32
			}
		}
	]
}