{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6903,
			"arabicnumber": 6903,
			"text": "Ebu Cuhayfe şöyle demiştir: Ben Ali r.a.'e \"Sizin elinizde Kur'an'da olmayan herhangi bir şey var mı?\" diye sordum. -Ebu Cuhayfe bir keresinde insanların yanında olmayan bir şey var mı demiştir.- Ali r.a. \"Taneyi yaran ve insanı yaratan Allah'a yemin ederim ki bizim elimizde Kur'an'da olandan başka bir şey yoktur. Ancak insana Allah'ın kitabını anlama hususunda verilen bir anlayış ve bir de şu sahifedeki şey vardır\" dedi. Ben \"O sahifedeki nedir?\" diye sordum. Hz. AIi \"Akl yani diyet, esirin esaretten kurtarılması, kafir karşılığında Müslümanın öldürülemeyeceği hükümleri\" dedi. Fethu'l-Bari Açıklaması: \"Akile\" kelimesi \"akıl\" kelimesinin çoğuludur. Akıl, diyet veren kişi demektir. Diyete \"akl\" denilmesi, mastarla isimlendirme yapılmış olmasındandır. Çünkü diyet olarak verilen deve, maktulün avlusuna bağlanıyordu. Daha sonra bu kullanım yaygınlık kazandi ve -verilen deve olmasa bile- diyete \"akl\" denilmeye başlandı. Bir kimsenin akılesi, baba tarafındah'asabesi olan yakınlarıdır. Maktulün veIisinin kapısına diyet develerini bağlaenlar bunlardır. Akılenin diyeti üstlenmesi, sünnetle sabittir. Bilginler bu konuda icma etmişlerdir. Bu hüküm \"Hiçbir suçlu başkasının suçunu yüklenmez\"(En'am 164)ayetinin zahiri ile çelişmektedir. Fakat akıle hükmü bu ayetin genelliğinden tahsis edilmiştir. Çünkü bunda maslahat vardır. Zira katil diyeti vermekle sorumlu tutulsaydı neredeyse elinden bütün malı çıkardı. Bir kişinin ardarda hata etmeyeceğinden emin olunamaz. Kişi hatasının bedelini ödemeksizin bırakıldığı takdirde maktulün kanı heder olup, boşa gider. Biz de şunu ekleyelim: Akıle hükmünün arkasında yatan Sir şu olabilir: Katil diyeti tek başına ödeyip, fakir düştüğü takdirde fakirlik seviyesinde kalmaz heder olup gitme seviyesine düşer. Bundan dolayı onun diyetini akılesi ödemekle yükümlü tutulmuştur. Zira bir kimsenin fakir düşme ihtimali, bir topluluğun fakir düşme ihtimalinden çok daha fazladır. Bir de o kişi tekrar adam öldürdüğünde bu çeşit bir fiili tekrar işlememesi için bir topluluk tarafından uyarılması, kişinin kendi kendini uyarmasına oranla kabule daha yakındır. Doğruyu en iyi Allahu Teala bilir. Kişinin akılesi aşiretidir. Bunun için aşiretin ona en yakın kolundan başlanır. Bunlar diyeti ödemekte acizliğe düştüklerinde onlara en yakın olanlar devriye girer. Diyet hür, ergenlik çağına ermiş, hali vakti yerinde olan erkekler tarafından ödenir. \"Sizin elinizde Kur'an'da olmayan herhangi bir şey var mı?\" Yani ister ezberinizde olsun, isterse olmasın Nebi Sallallahu Aleyhi ve Sellem' den duyup da yazdığınız bir şey var mı? Bundan maksat yazılı ve ezberde olan bütün şeylere genellemek değildir. Çünkü Hz. Ali'den, Nebi Sallallahu Aleyhi ve Sellem'den rivayeten nakledilen ve sözü edilen sahifede bulunmayan çok şey vardır. Maksat, onun Kur'an'ın lafzının manasından anladığı ve manalarının batınından Çıkardığı şeylerdir. Hz. Ali'nin Kur'an'ın dışında yanında bulunan şeyden maksadı, sözkonusu sahifede ona nispet edilerek yazılan ve Kur'an'dan çıkardığı hükümlerdir. Sanki o bunları oraya unutmamak için yazmış gibidir. Nebi Sallallahu Aleyhi ve Sellem'den ezberlediği ahkam ise böyle değildir. Zira o hükümleri bilfiil ve fetva vermek suretiyle aklında tutmakta ve unutacağı endişesi taşımamaktadır. \"Ancak insana Allah'ın kitabını anlama hususunda verilen bir anlayış.\" Humeydi\"nin zikredilen rivayetinde \"Allah'ın bir kuluna kitabı hususunda verdiği anlayış\" şeklindedir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 42
			}
		}
	]
}