{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6913,
			"arabicnumber": 6913,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Hayvanların verdiği zararın diyeti hederdir, kuyu kazmaktan meydana gelen zarar da hederdir. Maden kazmada meydana gelen zarar da hederdir. Define mallarında beşte bir oranında vergi vardır\" buyurmuştur. Fethu'l-Bari Açıklaması: \"İbn Sirin şöyle demiştir: Bilginler hayvan tepmesinden meydana gelen zararı ödetmezlerdi.\" Burada yer alan \"en-Nefha\" ayağıyla vurma yani tepme demektir. \"Binicinin hayvanın dizginini çekmesinden dolayı ayağı ile bir şeye zarar verdiğinde zararı ziya nı tazmin etmek gerektiğini belirtirlerdi.\" Hadis metninde yer alan \"el-inan\" hayvana binen kişinin onu istediği tarafa yönlendirmesi için ağzına konulan şey yani dizgin demektir. Hadisin ma\\: şudur: Bir hayvana binildiği ve binid de dizginini çektiği takdirde hayvan ayağıyla bir şeye zarar verirse, binen kişi o zararı tazmin eder. Buna karşılık binid sebep olmadan hayvan ay ağıyla bir şeye zarar verecek olursa, binen kişi bunu tazmin etmez. \"Hammad şöyle demiştir: Hayvan tepmesinden meydana gelen zarar tazmin olunmaz, ancak insanın hayvanı dürtmesi dolayısıyla meydana gelen zarar ziyan tazmin olunur.\" \"Ancak insanın hayvanı dürtmesi dolayısıyla meydana gelen zarar ziyan tazmin olunur.\" Bu durum, hayvanı sahibinin veya başka bir kimsenin dürtmesi durumundan daha geneldir. \"Bir kimse hayvanına vurur, hayvan da buna tepki olarak ayağı ile ona vurursa meydana gelen zarar ziyan tazmin edilmez.\" İbn Ebi Şeybe'nin nakline göre Muhammed b. Sırın şöyle demiştir: Kadı Şureyh hayvanı süren veya binen kimse hayvanın verdiği zarar ve ziyanı tazmin eder ancak hayvan kendisine vurulması neticesinde bir zarara yol açarsa tazmin etmez dedi. Ben \"Hayvanın muakabesi nedir\" diye sordum. Kadı Şureyh \"Bir kimse hayvana vurur da, hayvan da onu yaralarsa buna muakabe denir dedi. \"Hayvanını kiraya veren kimse (mükarı) üzerinde bir-kadın bulunan eşe ği sürdüğü zaman ... \" ve kadın da o hayvandan düştüğünde sürücü üzerine tazminat yoktur. \"Şa'bı ise şöyle demiştir: Sürücü hayvanı sürüp yorduğu zaman, hayvanın verdiği zararı tazmin eder. Hayvanı yormaksızın yavaş yavaş yumuşaklıkla sürer de bu sırada bir zarar verirse o zararı ödemez.\" İbn Battal şöyle demiştir: Hanefiler hayvanın-ön a)laklarıyla, arka ayaklarının verdiği zararı farkli mütalaa etmişler ve hayvan arka ayakları ve kuyruğuyla zarar verdiğinde kişi buna sebep bile olsa hayvanın verdiği zararı tazmin etmez, buna karşılık ön ayakları ve ağzıyla verdiği zararı tazmin eder demişlerdir. İmam Buhari, Kefe imamlarından bu görüşe muhalif görüşü naklederek bunu kabul etmediğine işaret etmektedir. Şafiilerin bu konudaki görüşü şöyledir: Hayvanla birlikte insan bulunduğu takdirde insan hayvanın cana veya organa ya da mala verdiği zararı tazmin eder. Bu kişi ister hayvanı süren, ister binen, ister yularını çeken olsun fark etmediği gibi hayvanın sahibi veya kiraya vereni ya da kiralayanı veya ödünçalanı ya da gasıbı olsun yine farketmez. Ayrıca hayvanın bu zarara ön veya arka ayaklarıyla ya da kuyruğuyla veya başıyla yol açması arasında fark olmadığı gibi zararın gece veya gündüz meydana gelmiş olmasında da herhangi bir fark yoktur. Bu görüşün deliline gelince, zarar ve ziyanın kasten veya başka bir yolla yapılmış olması arasında hiçbir fark yoktur. Hayvanla birlikte bulunan kimse ona hakimdir. Hayvan adeta onun elindeki bir alet gibidir. Dolayısıyla hayvanın fiili kişi hayvanı buna ister sevk etsin, isterse etmesin yine bunu ister bilsin, isterse bilmesin kendisine nispet edilir. İmam Malik'ten de buna benzer bir görüş nakledilmiştir. Ancak birisi hayvanın tepmesine sebep olacak bir hareket yapmadan teperse, bu müstesnadır. İbn Abdilberr'in nakline göre çoğunluğun görüşü bu doğrultudadır. Bu hadis, hayvanın ekin veya başka bir şeyi gece ve gündüz itlaf etmesi arasında fark olmadığına delil gösterilmiştir. Hanefl ve zahirilerin görüşü bu doğrultudadır. Çoğunluğu oluşturan fıkıh bilginleri şöyle demişlerdir: Verilen zarar ve ziyan gündüz meydana gelmişse tazminat yükümlülüğü düşer. Gece yapılmışsa hayvan sahibi hayvanını korumakla görevlidir. Dolayısıyla hayvan sahibinin kusuru neticesinde bir zarar ve ziyan meydana gelmişse hayvan sahibi hayvanın bu zararını tazmin etmekte yükümlüdür. Bu tahsisin delili ise İmam Şafii, Ebu Davlid, Nesa! ve İbn Mace'nin, Zührı, Haram b. Muhaysa el-Ensarı vasıtasıyla Bera b. Azib'den yaptıkları şu nakildir: \"Bera'nın zarara yol açan bir devesi vardı. Bir gün bu deve bir bahçeye girerek oraya hasar verdi. Bunun üzerine Resuluilah Sallallahu Aleyhi ve Sellem bahçeleri gündüz sahiplerinin korumaları, hayvanları geceleyin sahiplerinin muhafaza etmeleri ve geceleyin verdikleri zararı sahiplerinin tazmin etmesi gerektiğine hükmetti. \"(Ebu Diıvud, Buyu' ve'l-İcarat) İbn Abdilberr şöyle demiştir: Bu hadis her ne kadar mürsel ise de meşhur olup, sika raviler tarafından nakledilmiştir. Hadisi Hicaz fıkıh bilginleri kabul etmiştir. Tahavl'nin bu hadisin yukarıda zikredilen hadisle mensuh olduğuna işaret etmesine gelince, nesheden rivayetin tarihi bilinmeden ihtimale açık bir durumda nesih olamaz denilerek tenkit edilmiştir. Bundan daha güçlü olanı ise İmam Şafii'nin şu görüşüdür: Biz Bera hadisini sabit olduğu ve ravilerinin durumu bilindiği için kabul ediyoruz. \"Hayvanların verdiği zarar ziyan hederdir\" hadisi bu hadisle çelişmez. Çünkü bu, özel anlam kastedilerek kullanılmış genel ifadedir",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 51
			}
		}
	]
}