{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"87": "Blood Money (Ad-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6917,
			"arabicnumber": 6917,
			"text": "Ebu Said el-Hudrı şöyle demiştir: Yahudilerden bimin yüzüne tokat atılmış bunun üzerine Yahudi Resulullah Sallallahu Aleyhi ve Sellem'e geldi ve \"Ya Muhammed! Ensardan olan sahabilerinden biri benim yüzüme tokat vurdu\" diye şikayet etti. Hz. Nebi Sallallahu Aleyhi ve Sellem \"Onu çağırın!\" buyurdu. Sahabiler o Ensarlı kişiyi çağırdılar. Nebi Sallallahu Aleyhi ve Sellem \"Sen bu kişinin yüzüne tokat attın mı?\" diye sordu. O kişi şöyle cevap verdi: \"Ya Resulallah! Ben Yahudilerin yanından geçtim de bu kişinin 'Musa'yı bütün insanlığın üstüne seçip tercih eden Allah'a yemin ederim ki' dediğini işittim. Ensarlı şöyle devam etti: 'Ben Muhammed'in üstüne de mi (yükseltti)?' dedim. Bu sırada öfkeye kapıldım ve yüzüne bir tokat attım. Nebi Sallallahu Aleyhi ve Sellem şöyle dedi: \"Nebiler arasında benim daha hayırlı olduğmu söylemeyiniz. Gerçek şu ki insanlar kıyamet gününde (dehşetten) bayılacaklar. Fakat ilk ayılan ben olacağım. O anda bir de göreceğim ki Musa arşın ayaklarından birini tutmuş olduğu halde olacaktır. Bilmiyorum Musa da bayılanların içinde olacak da benden evvel mi ayılacak, yoksa Tur dağındaki bayılmasının karşılığı mı verilecek?\" Fethu'l-Bari Açıklaması: \"Öfkelendiği bir anda bir yahudiye tokat atan Müslümana bir şey lazım gelmeyeceği.\" Yani böyle bir Müslümana tıpkı bir zimmıyi tokatladığında olduğu gibi kısas uygulanmaz. İmam Buhari, bu ifadesiyle sanki muhalif olan bil!;Iinin tokat atmada kısas yapılma kanaatini taşıdığına işaret etmektedir. Nebi Sallallahu Aleyhi ve Sellem zimmıden dolayı Müslümanı kısas etmediğini göre bu uygulama, kısasm cereyan etmediğini göstermektedir. Fakat Kufe bilginlerinin tamamı tokat atmada kısas uygulanacağı kanaatinde değillerdir. Buradaki hüküm, onların içinden bu kanaati taşıyanlarla ilgilidir. Hadisten Çıkan Sonuçlar 1. Bir zimmı bir Müslümanı şikayet edebilir, davasını hakime götürebilir ve hakim de bunu dinleyebilir. 2. Hükmü bilmeyen kimse, hakimden bunu öğrenebilir ve Müslüman açısından bu kadarıyla yetinilir. 3. Bir zimmı, bilgisi olmadığı bir hususta söz söylemeye kalkıştığında ilmiyle meşhur olan bir Müslüman ona ta'zir cezası uygulayabilir. Hadisten çıkan diğer sonuçlar, Musa aleyhisselam kıssasında geçmişti",
			"grades": [],
			"reference": {
				"book": 87,
				"hadith": 55
			}
		}
	]
}