{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6933,
			"arabicnumber": 6933,
			"text": "Ebu Said şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem ganimet taksimi yaparken Abdullah b. zi'l-Huveysıra et-Temımı geldi ve \"Adil ol Ya Resulallah!\" dedi. Resulullah Sallallahu Aleyhi ve Sellem de ona \"Yazıklar olsun sana! Eğer ben adil olmazsam kim adil olur?\" buyurdu. Bunun üzerine Hz. Ömer \"Müsaade et şunun boynunu vurayım!\" dedi. Resulullah Sallallahu Aleyhi ve Sellem şöyle cevap verdi: \"Onu bırak! Şüphesiz onun birtakım arkadaşları vardır ki onların namazıarı karşısında kendi namazınızı, oruçları karşısında kendi orucunuzu küçük görürsünüz. Onlar okun avı (delip) çıkışı gibi dinden çıkacaklardır. (Avı delip geçen) okun tüyüne bakılır. Orada kandan hiçbir eser bulunmaz. Sonra demirine bakılır, orada da hiçbir şey bulunmaz. Sonra okun yaya giriş yerine bakılır. Orada da bir şey bulunmaz. Sonra oku n ağaç kısmına bakılır, orada da bir şey bulunmaz. Ok avın işkembesi içindeki şeylere ve kana girip çıkmış fakat onlardan hiçbir şey oka 'yapışıp kalmamıştır. Onların alameti, iki elinden biri -veya iki memesi dedi- kadın memesi gibi -ya da öteye beriye gidip gelen büyük bir et parçası gibi dedi- olan bir adamdır. Aralarında öyle biri olacaktır). Onlar, insanlar arasında bir tefrika olduğu zaman ortaya çıkarlar!\" Ebu Said şöyle dedi: Ben şehadet ediyorum ki bu hadisi Resulullah Sallallahu Aleyhi ve Sellem'den işittim ve yine şehadet ediyorum ki Hz. Ali bunlarla savaşmıştır ve ben de onun maiyetindeydim. Sonunda Resulullah Sallallahu Aleyhi ve Sellem'in anlattığı nitelik üzere bir adam getirildi. Ebu Said \"Onlardan sadakaların (taksimi) hususunda seni ayıplayanlar da vardır. Sadakalardan onlara da (bir pay) verilirse razı olurlar, şayet onlara sadakalardan verilmezse hemen kızarlar\"(Tevbe 58) ayeti bunun hakkında indi, dedi",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 15
			}
		}
	]
}