{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"88": "Apostates"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6939,
			"arabicnumber": 6939,
			"text": "Bize Ebû Avâne, Husayn ibn Abdirrahmân'dan; o da Fulân'dan (ki o, Sa'd ibn Ubeyde'dir...) tahdîs etti. Son râvî şöyle demiştir: Ebû Abdirrahmân ile Hıbbân ibnu Atıyye çekiştiler de Ebû Abdirrahmân, Hıbbân'a hitaben, Alî'yi kasdederek: Yemîn olsun, senin sahibinin ne kadar müslümân kanı dökmeye cür'et ettiğini bilmişimdir! dedi. O buna cür'et etmedi ey babasız kalası! dedi. Ebû Abdirrahmân: Bir şey ki, ben onu bunu söylerken işittim, dedi. Hıbbân: Bu şey nedir? dedi. Abdirrahmân şöyle dedi: Alî şöyle dedi: Rasûlüllah(sallallahü aleyhi ve sellem) beni, Zubeyr'i ve Ebû Mersed'i gönderdi, hepimiz süvârî idik. Rasûlüllah:\"Gidiniz; Hâc bustânına kadar gidiniz -Ebû Seleme dedi ki: Ebû Avâne böyle (cim ile) \"Hâc\" şeklinde söyledi-. Çünkü o bustânda bir kadın bulacaksınız ki, onun yanında Hâtıb ibn Ebî Beltea'dan Mekke'deki müşriklere yazılmış bir sahîfe vardır, o sahîfeyi bana getiriniz!\" buyurdu. dedi ki:) Biz atlarımız üzerinde koşturarak gittik. En sonu Rasûlüllah'ın bize söylemiş olduğu yerde, devesi üzerinde gitmekte olan bir kadın bulduk. Hâtıb Mekke ahâlîsine Rasûlüllah'ın kendilerine doğru yürüyeceğini bildiren bir mektûb yazmıştı. Biz kadına: Yanında bulunan mektûb nerede? dedik. Kadın: Bende hiçbir mektûb yoktur! diye inkâr etti. kadının devesini çöktürüp, eşyası arasında mektubu araştırdık, fakat hiçbirşey bulamadık, iki arkadaşım; ez-Zubeyr ile Ebû Mersed: Biz bu kadında hiçbir mektûb görmüyoruz! dediler. Alî dedi ki: Ben de onlara: Yemîn olsun ki, biz Rasûlüllah'ın hiç yalan söylemediğini bilmişizdir! dedim. sonra Alî, kendisiyle yemîn edilen Allah adına yemîn etti de, kadına: Vallahi sen ya mektubu çıkarırsın, yahut ben senin elbiseni muhakkak soyacağım! dedi. üzerine kadın elini, kuşanmakta olduğu izârının bağına doğru uzattı da oradan sahîfeyi çıkardı. Alî ile arkadaşları o mektubu Rasûlüllah'a getirdiler. Omer: Yâ Rasûlallah! Bu zât Allah'a, Rasûlü'ne ve mü'minlere hainlik yapmıştır; beni bırak da bunun boynunu vurayım! dedi. \"Yâ Hâtıb! Bu yaptığın işe seni sevkeden nedir?\" buyurdu. Yâ Rasûlallah! Bende Allah'a ve Rasûlü'ne mü'min olmaktan başka bir hâl olmamıştır. Lâkin ben Kureyşler'in yanında kendim için ailemi ve malımı kendisiyle koruyacak bir minnetdârlık eli olmasını istedim. Yanında bulunan Muhacir sahâbîlerinden herbir kişinin orada kendi kavminden, ailesini, mallarını muhafaza edecek hısımları vardır, (benim ise Kureyş'ten himaye edecek kimsem yoktur)! dedi. \"Hâtıb doğru söyledi, onun hakkında hayırdan başka bir söz söylemeyiniz!\" buyurdu. dedi ki:) Omer, Hâtıb hakkındaki sözünü tekrarladı da: Yâ Rasûlallah! O, Allah'a, Rasûlü'ne ve mü'minlere hainlik yapmıştır, beni bırak da onun boynunu vurayım! dedi. ona: \"Hâtıb, Bedir ehlinden değil midir? Sana ne bildirir ki, belki Yüce Allah Bedir ehlinin samimî mücâhedelerine muttali' olmuştu da ' (Bundan sonra) ne isterseniz işleyiniz, ben sizler için cenneti vâcib kılmışımdır!' buyurmuştur!\" dedi. söz üzerine Omer'in iki gözü bol yaşa boğuldu da: Allah ve Rasûlü en bilendir! dedi. Abdillah el-Buhârî şöyle dedi: Noktalı hâ ile \"Hâh\" kelimesi en doğru olanıdır. Lâkin Ebû Avâne böyle hâ ve noktalı cîm ile \"Hacın\", \"Hâcin\" şeklinde söylemiştir. Bu cîm ile olan yanlıştır. \"Hâh Bustânı\" Mekke ile Medine arasında bir yer ismidir. Heysem -Huşeym- (noktalı hâ ile) \"Hâh\" diye söylerdi",
			"grades": [],
			"reference": {
				"book": 88,
				"hadith": 21
			}
		}
	]
}