{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"89": "(Statements made under) Coercion"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6940,
			"arabicnumber": 6940,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem namazında şöyle dua ederdi: ''Allah'ım! Ayyaş b. Ebi Rebia, Seleme b. Hişam ve el-Velid b. el-Velid'i kurtar! Allah'ım kafir/erin zulmü altında ezilen, kurtulmaya çare bulamayan diğer mu'minleri (müstaz'afları) kurtar! Allah'ım Mudar kabilesini ezip, iyice perişan et, onları yerle bir eyle, onlara Hz. Yusuf'un zamanındaki kıtlık yıllarını gönder. \" Fethu'l-Bari Açıklaması: \"Tehdit ve zor kullanma.\" Zor kullanma (ikrah) başkasını yapmak istemediği bir şeye zorlamak anlamına gelir. İkrahın dört şartı vardır: 1- Zor kullanan kimsenin tehdit ettiği şeyi yapmaya gücü yetmesine karşılık, tehdide maruz kalan kaçarak bile olsa bunu savuşturmaktan aciz olmalıdır. 2- Tehdide maruz kalan kimse kendisinden istenilen fiili yapmadığı takdirde zor kullanan kimsenin söylediğini yapacağına yakın derecesinde zan taşımalıdır. 3- Zor kullanan kimsenin yaptığı tehdit o an için geçerli olmalıdır. Tehdit yönelten kimse \"Eğer şöyle yapmazsan seni yarın döverim\" dese, bu tehdide maruz kalan kimse tehdit altında kalmış sayılmaz. Ancak tehdit yöneiten kişi çok kısa bir zaman dilimini telaffuz etse veya tehdidinden dönmemek gibi bir adeti bulunsa bu takdirde zorlamaya maruz kalmış sayılır. 4- Tehdide maruz kalan kimse yaptığı fiili gönül rızasıyla yaptığını gösterecek davranışlar sergilememelidir. Çoğunluğu oluşturan bilginlere göre tehdidin söz ve fiille yapılmış olması arasında herhangi bir fark yoktur. Fiill tehdit açısından -bir kimseyi haksız yere öldürmek örneğinde olduğu gibi- ebediyyen haram olan bir fiil istisna tutulmuştur. Bilginler tehdide maruzkalan kimsenin zorlandığı fiili yapI1{amakla .mükellef olup olmadığı noktasında farklı görüşler ortaya atmışlardır. Şi&h Ebu ıshak eşŞirazı şöyle demiştir: Bilginler bir kimseyi öldürmeye zorlanan kimsenin, bundan kaçınmakla ve kendisini savunmakla yükümlü olduğu, o kişiyi öldürdüğü takdirde günaha gireceği noktasında icma etmişlerdir. Bu da bizezorlanan kimsenin o durumda mükellef olduğunu' göstermektedir. Aynı şeyleri İmam Gazzalı ve başkalarının ifadesinde de görmek mümkündür. Bilginlerin açıklamalarının zorunlu sonucu, sözkonusu ihtilafın zorlama faktörüyle şeriatın çağrısının birbiriyle uyumlu olması durumuna mahsus olduğudur. Bir kafiri öldürmeye ve Müslüman olmaya zorlama durumu buna örnektir. Buna karşılık bir kimseyi öldürmeye zorlama örneğinde olduğu gibi zorlama faktörüyle şeriatın çağrısı birbiriyle ters düştüğünde kişinin onu öldürmemekle yükümlü olduğu noktasında ihtilaf yoktur. İhtilaf, ikrah-ı müld durumunda kişinin mükellef olup olmadığı noktasındadır. İkrah-ı müld, kişinin zorlandığı fiili yapmaktan başka çare bulamadığı durumlardır. Bilginler tehdidin niteliği konusunda ihtilaf etmişlerdir. Öldürme, herhangi bir organı kesme, şiddetli bir şekilde dövme, uzun süre hapsetme tehdidi ittifakla geçerli kabul edilirken, hafifçe dövme ve bir ya da iki gün hapsetme tehdidinin geçerli olup olmadığı noktasında ihtilaf edilmiştir. \"Kalbi imanla dolu olduğu halde.\" Bu ifade, kendi rızasıyla dinden dönene çok ağır bir tehdittir. Buna karşılık zorlanarak bunu yapan kişi, ayetin hükmüne göre mazurdur. Zira müspet bir hükümden yapılan istisna olumsuz anlamı ifade eder. Dolayısıyla küfre zorlanan kimsenin ayette ifade edilen tehdide dahil olmaması gerekir. Meşhur olduğu üzere zikredilen ayet Ammar b. Yasir hakkında inmiştir. Nitekim Ebu Ubeyde b. Muhammed b. Ammar b. Yasir şöyle demiştir: \"Müşrikler Ammar'ı yakalayıp, ona işkence ettiler. Neticede onların istedikleri bazı şeylerde kendilerine uydu. Ammar Nebi Sallallahu Aleyhi ve Sellem'e yaptığı şeyden yakınınca, Resulullah Sallallahu Aleyhi ve Sellem \"Kalbini nasıl buluyorsun?\" diye sordu. Ammar \"imanla dopdolu\" deyince, Nebi Sallallahu Aleyhi ve Sellem \"Sana yine böyle yaparlarsa sen de öyle davran\" buyurdu. Bu haber mürsel olup, ravileri sikadır. Haberi Taberi rivayet etmiştir. \"Ancak kafir/erden gelebilecek bir tehlikeden sakınmanız başkadır.\" Ayette geçen \"ölZ\",\"takıyYe\" yani onlardan korkarsanız istediklerini yapınız demektir. İmam Buhari bu açıklamayı Ebu Ubeyde'nin ifadesinden almıştır. Ebu Ubeyde, tukat ve takıyye aynı manadadır demiştir. Biz de şunu ekleyelim: Bu kelime Al-i İmran suresinin tefsirinde geçmişti. Ayetin manasına gelince, bir mu'min bir kafiri zahiren ve batınan dost edinmesin. Ancak zahiren ondan sakınması müstesnadır. Bu durumda ondan korktuğunda kendisiyle dost olabilir. Ancak içinden ona düşmanlık besler. \"Görüldüğü üzere Allahu Teala, emrettiği şeyi terk etmekten kaçınmayan çaresizleri mazur görmektedir.\" Yani onlar mağlup olduklarında mazurdurlar. Zorlanan kimse, kendisine emredilen şeyi yapmaktan kaçınamayan zavallı ve aciz bir kimseden başkası değildir. Onu tehdit eden yaptığı tehdidi yerine getirmeye kudreti olan bir kimsedir. Çünkü o kendisinden istenilen fiili yapmamazlık edemez. Tıpkı zorlanan kimsenin istenilen fiilden kaçınamadığı gibi. Netice olarak zayıf ve aciz kimseler (müstazaf) tıpkı zorlanan (mükreh) hükmündedir. \"Hasan-ı Basri Ayette geçen \"ölZ= sakınma\", kıyamete kadar geçerlidir demiştir.\" Abd b. Humeyd ve İbn Ebi Şeybe'nin nakillerine göre Hasan-ı Basri şöyle demiştir: \"Sakınma (takiyye) mu'min için kıyamet gününe kadar caizdir. Ancak adam öldürme de takıyye olamaz. \"(İbn Ebi Şeybe, Musannef, VI, 474) Abd b. Humeyd'in rivayeti ise \"Ancak Allahu Teala'ın haram kıldığı nefsi öldürmede geçerli değildir\" şeklindedir. Yani başkasını öldürmeye zorlanan bir kimse kendi canını başkasının canına tercih ettiği için mazur değildir. Biz de şunu ekleyelim: \"Takıyye\" kelimesinin manası insanın içindeki inancını ve başka şeyleri başkasına açık etmekten kaçınması demektir. Beyhakl'nin nakline göre İbn Abbas şöyle demiştir: \"Takıyye kalp imanla dopdolu iken dille yapılır ve kişi adam öldürmek maksadıyla kimseye el uzatmaz.\" \"İbn Abbas hırsızların zorlaması neticesinde hanımını boşamak zorunda kalan kimse için yaptığına itibar edilmez demiştir. İbn Ömer, İbnü'z-ZUbeyr, Şa'bı ve Hasan-ı Basri bu görüştedirier.\" Abdurrezzak'ın sahih bir isnadla İkrime'den nakline göre İbn Abbas tehdide maruz kalarak yapılmış boşamayı geçerli saymazdı. İbn Battal, İbnü'l-Münzir'e uyarak şöyle demiştir: Müdehitler, küfre zorlanan ve öldürüleceği korkusuyla kalbi imanla dopdolu olduğu halde kafir olan kimsenin kafirliğine hükmedilemeyeceği ve hanımının kendisinden boş düşmeyeceği noktasında icma etmişlerdir. Ancak Muhammed b. el-Hasen şöyle demiştir: Böyle bir kimse -içten içe Müslüman bile olsa- küfrünü açıktan yaparsa mürted olur ve karısı kendisinden boş düşer. İbn Battal, bu söz naslara muhalif olduğu için cevap vermeye değmez, demiştir. Bazı bilginler ise şöyle derler: Sözkonusu ruhsatın mahalli sözdür. Puta tapma veya bir Müslümanı öldürme ya da domuz eti yeme veya zina etme gibi fiille ilgili şeylerde ruhsat sözkonusu değildir. Evzaı ve Sehnun'un görüşü bu doğrultudadır. İsmail el-Kadl'nin sahih bir senedIe nakline göre Hasan-ı Basri ilişilmesi haram olan bir cana kıymada takıyye olmayacağı kanaatinde idi. Bir grup bilgin ise zorlama altında söylenen sözle, yapılan fiil birbirine eşittir demişlerdir. Bilginler zorlamanın tanımı üerinde ihtilaf, etmişlerdir. Abd b. Humeyd'in sahih bir isnadla nakline göre Hz. Omer şöyle demiştir: \"Bir kimse hapse konulduğunda veya bağlandığında ya da işkenceye maruz kaldığında canından emin değilse zorlama altındadır. Kadı Şureyh'ten buna benzer ancak daha uzun bir rivayet nakledilmiştir. Bu rivayette \"Dörılşey vardır ki bunlarla zorlama gerçekleşir: Hapse atmak, dövmek, tehdit yöneltmek ve bağlamak.\" İbn Mesud ise şöyle demiştir: \"Herhangi bir söz, benden iki kamçıyı savuşturuyorsa onu söylerim.\" Çoğunluğu oluşturan bilginlerin görüşü bu doğrultudadır. KOfeli bilginlere göre bu konuda ayrıntı vardır. (Bilginler zorlama altında yapılmış boşama hakkında ihtilaf etmişlerdir. Çoğunluğu oluşturan bilginler böyle bir boşamanın geçerli olmadığı kanaatine varmışlardır. Bu konuda İbn Battal sahabilerin icmaı olduğunu nakleder. KOfeli bilginler ise böyle bir boşamanın geçerli olduğu kanaatindedirler. Zühri, Katade ve Ebu Kılabe' den buna benzer bir görüş '1akledilmiştir. \"Nebi s.a.v. 'Ameller niyet/ere göredir' buyurmuştur.\" Bu hadisin geniş bir çıklaması Sahih'in ilk hadisinde yapılmıştı)",
			"grades": [],
			"reference": {
				"book": 89,
				"hadith": 1
			}
		}
	]
}