{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6962,
			"arabicnumber": 6962,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Su fazlası engellenemez, çünkü neticede (mubah olan) ot fazlası (hayvan sahiplerinden) men edilmiş olur\" buyurmuştur. Fethu'l-Bari Açıklaması: 'Alışverişlerde mekruh olan hile ve fazla otu engellemek amacıyla su fazlasının engellenmemesi.\" Mühelleb şöyle demiştir: Atılan başlıktan maksat şudur: Bir kimsenin kuyusu olup, çevresinde herkese açık bir otlak bulunmaktadır. Kuyu sahibi ise bu otun sırf kendisine ait olmasını istemektedir. Bu maksatla kuyusundaki su fazlasını -hiç ihtiyacı olmadığı halde- başkalarının hayvanlarının gelip içmesine engel olmaktadır. Onun asıl ihtiyacı kuyunun etrafında bulunan otlaradır. Ancak bu otlar kimsenin mülkü dahilinde olmadığı için onu engelleyememektedir. Dolayısıyla suya engelolmakta ve böylece bolota sahip olmaktadır. Çünkü hayvanlar susuz yapamaz, tam tersine otladığında susar. Başka kuyunun suyu ise hayvanlarından uzaktadır. Sürünün sahibinin ise bu otlarda gözü yoktur. Netice olarak kuyu sahibi böyle bir hileye başvurarak o otlara sahip olur. Hadisin manası şudur: Su fazlası hiçbir şekilde engellenemez. Çünkü su başka bir sebepten engellenemediğine göre bizatihi kendisi sebebiyle evleviyetle engellenemez. Suyun \"fazla\" şeklinde nitelenmesi, suyun ihtiyacından fazla olmaması durumunda onu başkasına vermemesinin caiz olduğuna işaret etmektedir. Doğruyu en iyi Allahu Teala bilir. İbnü'l-Müneyyir şöyle demiştir: Buharl'nin attığı başlığın hadise hangi açıdan uyduğuna gelince, çöllerde açılmış kuyuların sahipleri fazla olan miktar dışındaki suyu kendilerine ayırabilirler. Herkesin yararlanma hakkı olan ot ise böyle değildir. O kimsenin özel mülkü olamaz. Kuyu sahibi hIleye başvurup, kuyunun yakınındaki otları çoğaltmak maksadıyla ihtiyaç fazlası su olmadığını iddia edecek olursa, hayvan sahibi bu takdirde hayvanlarını başka bir suya götürmek zorunda kalacaktır. Çünkü hayvanlar susuz kaldıkları takdirde otlayamazlar. İşte bu durumda kuyu sahibi yasaklık kapsamına girmiş olur",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 9
			}
		}
	]
}