{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"90": "Tricks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6965,
			"arabicnumber": 6965,
			"text": "Urve b. ZUbeyr, Hz. Aişe r.anha'ye \"Eğer yetimlerin haklarına riayet edememekten korkarsanız beğendiğiniz kadınlardan ikişer, üçer, dörder alın\"(Nisa 3) ayet-i kerimesini sorunca Aişe r.anha şöyle cevap verir: Burada sözü edilen yetim kız, hamisinin himayesinde bulunur. Hamisi onun malı ve güzelliğine rağbet eder ve ona emsalinin mehrinin en azını vermek suretiyle kendisiyle evlenmek ister. İşte bu ayetlerde o gibi velilerin velayetleri altındaki yetim kızların mehirlerini tamamlamak suretiyle kendilerine adaletle davranmadıkça nikah etmeleri yasaklanmıştı. Sonra insanlar Nebi Sallallahu Aleyhi ve Sellem'e gelerek bu konuda fetva istediler. Bunun üzerine Allahu Teala \"Senden kadınlar hakkında fetva istiyorlar\"(Nisa 127) ayet-i kerimesini indirdi. Fethu'l-Bari Açıklaması: \"Velinin bizzat kendisinin evlenmek istediği yetim kız hakkında hile yapmasının ve o kızın mehrini tam olarak vermemesinin yasak olması.\" İmam Buhari bu konuda Aişe r.anha hadisine yer vermiştir. İbn Battal şöyle der: Ayete göre bir velinin yetim bir kızla mehrinden daha azını vermek suretiyle veya mehr-i misli değerine yetmeyecek bir mal vererek kendisi ile evlenmesi caiz değildir. Bu ayetin nüzul sebebi hakkında ihtilaf edilmiştir. Nitekim bu hususa sözkonusu hadisin Nisa suresinin tefsiri bölümünde açıklaması yapılırken değinilmişti. Ayetteki '...........\" ifadesinde bir hazf vardır. Takdiri ........= yetim kızların nikahı hususunda\" demektir. \"..........\" yani yetim kızlar dışında beğendiğiniz kadınlar demektir. Kadı Ebu Bekir b. et-Tayyib şöyle der: Ayetin manası şöyledir: Haklarını talep edecek velileri bulunmayan yetim kızların haklarına riayet edememekten korkarsanız, haklarını arama güçleri olmadığı için onları ifa edemeyeceğinizden emin değilseniz, işlerini çekip çevirmeye gücü yeten ya da kendilerine haksızlık etmenize engelolacak velileri bulunan kadınlarla evleniniz",
			"grades": [],
			"reference": {
				"book": 90,
				"hadith": 12
			}
		}
	]
}