{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"1": "Revelation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7,
			"arabicnumber": 7,
			"text": "Abdullah b. Abbas'tan rivayet edildiğine göre Ebu Süfyan şunları söylemiştir: \"Hz. Peygamber'in Ebu Süfyan ve Kureyş kâfirleri ile Hudeybiye antlaşma­sını imzaladığı mütâreke günlerinde Ebu Süfyan, Şam'a ticaret için giden bir Kureyş kervanında bulunuyordu. (Rum imparatoru) Herakleios, Kureyşli ker­vanla birlikte Ebu Süfyan'ı huzuruna çağırttı. Ebu Süfyan ve arkadaşları Herak leios'un huzuruna girdiler. O zaman Herakleios ve yanındakiler İliya'da (Ku­düs'te) idiler. Rumların ileri gelenleri ile birlikte iken imparator bunları huzuruna çağırdı ve tercümanının da gelmesini emretti. Tercüman: Peygamberim diyen bu adama hanginiz soy olarak daha yakın­dır? diye sordu: Ebu Süfyan anlatıyor: \"Benim\" dedim. Bunun üzerine Herakleios: \"Onu yanıma, arkadaşlarını da yakına getirin. Onun arkasında dursunlar\" dedi. Sonra tercümanına dönüp dedi ki: \"Bunlara de ki: Ben bu zat hakkında bu adama bazı şeyler soracağım. Bana yalan söylerse onu yalanlasınlar,\" Ebu Süfyan dedi ki: \"Vallahi arkadaşlarım yalan söylediğimi etrafta yayarlar diye utanmasaydım onun (peygamberin) hakkında yalan söylerdim.\" Herakle ilk sorusu şu oldu: İçinizde soyu nasıldır? Onun içimizde soyu pek büyüktür, dedim. İçinizden daha önce peygamberlik iddiasında bulunan kimse var mıydı? diye sordu. Yoktu, dedim. Babaları içinde hiçbir melik (kral) var mıdır? dedi. Hayır, dedim. Ona uyanlar, halkın önde gelenleri mi, yoksa güçsüzleri mi? Halkın zayıf olanları. Ona uyanların sayısı artıyor mu, azalıyor mu? Artıyorlar,. Onun dinine girdikten sonra beğenmeyerek dininden dönenler var mıdır?. Yoktur. Kendisinin peygamber olduğunu söylemeden önce onu yalan ile itham et­tiğiniz olmuş mudur? Hayır. Hiç anlaşmalarını bozar mı? Hayır bozmaz. Ancak biz şimdi onunla bir süreliğine ateşkes yaptık. Bu sü­re içinde ne yapacağını bilmiyoruz. (Ebu Süfyan dedi ki \"Peygamber'i kötülemek adına araya katacak bundan başka bir söz bulamadım.\" Onunla hiç savaş yaptınız mı? Evet yaptık. Bu savaşlar nasıl sonuçlanıyor? Karşılıklıdır, bazen o yener, bazen biz yeneriz. Size neyi emrediyor? Bize; yalnızca Allah'a kulluk edin, hiçbir şeyi O'na ortak koşmayın, Ataları­nızın inanıp söyledikleri şeyleri terk edin, diyor. Namazı, doğruluğu, iffeti ve akraba ile İlişkiyi sıkı tutmayı emrediyor. Bunun üzerine Herakleios tercümanına dedi ki: \"Ona söyle: Soyunu sordum, İçinizde yüksek bir soya sahip olduğunu söy­ledin. Peygamberler de zaten böyle toplumlarının yüksek soya sahip olanların­dan gönderilirler. Aranızda daha önce peygamberlik iddiasında bulunan olup olmadığını sor­dum, olmadığını söyledin. Daha önce böyle birisi olsaydı, bu adam da kendisin­den önceki bir söze uymuş kimsedir, derdim. Babaları içinde hiçbir hükümdar gelip gelmediğini sordum, gelmediğni söyledin. Babaları içinden bir hükümdar gelmiş olsaydı, bu da babasının kral­lığını geri almaya çalışıyor, derdim. Peygamberlik iddia etmeden önce onun yalan söylediğini duydunuz mu diye sordum, duymadığınızı söyledin. Ben ise biliyorum ki önceden halka yalan söylememiş bir kimse sonradan Allah'a yalan söylemeye cüret etmez. Ona tabi olanlar önde gelenler, güçlüler midir, zayıflar mıdır, diye sordum. Zayıfların ona bağlandığım söyledin. Peygamberlerin bağlıları da zaten zayıf kimselerdir. Ona uyanlar artıyor mu azalıyor mu diye sordum, arttığını söyledin. İman işi tamamlanıncaya kadar hep bu şekilde artarak gider. Onun dinine girenlerden, bu dini beğenmeyerek dönenler olup olmadığını sordum, yoktur dedin. İman da kalplere karışıp kökleşinceye kadar böyledir. Hiç anlaşmalarını bozar mı diye sordum, bozmadığını söyledin. Peygamber­ler de böyledir, anlaşmalarını bozmazlar. Size ne emrediyor diye sordum. Yalnız Allah'a kulluk edip, ona hiçbir şeyi ortak koşmamayı emrettiğini, putlara kulluğu yasakladığını, namaz, doğruluk ve, iffeti emrettiğini söyledin. Bu söylediklerin doğruysa şu ayaklarımın bastığı yerlere yakında O zat sahip olacaktır. Ben zaten bir peygamberin yakında çıkacağını biliyordum. Ancak sizin içinizden olacağını tahmin etmezdim. Onun yanına varabileceğimi bilsem, onunla buluşmak için her türlü zahmete katlanır­dım. Yanında olsaydım ayaklarını yıkardım!\" Ondan sonra Herakleios, Dıhye'nin elçiliği ile Busrâ emirine gönderilen (ve onun tarafından İmparatora ulaştırılan) Peygamber'in mektubunu istedi. Getiren adam onu Herakleios'a verdi, o da okudu. Mektupta şunlar yazılmıştı: Rahman ve Rahim olan Allah'ın adıyla. Allah'ın kulu ve resulü Muhammedden, Rumların büyüğü Herakleios'a. Selam hidayete tabi olanlara otsun. Seni islâm'a davet ediyorum, islâm'a gir ki selamete eresin ve Allah mükâfatım iki kat versin. Eğer kabul etmezsen (senin halkın olan) çiftçilerin (bütün Bizans halkının) günahı senin boynunadtr. Ey kitap ehli! Bizimle sizin aranızda ortak bir kelimeye gelin: Allah'tan başkasına tapmayalım. O'na hiçbir şeyi ortak koşmayalım. Allah'ı bırakıp da birbirimizi Rab edinmeyelim. Eğer yüz çevirirlerse deyiniz ki: Şahit olun, biz muhakkak Müslümanlarız.[Ali İmrân, 64] (Ebu Süfyan dedi ki: ) Herakleios sözünü söyledikten ve mektubu bitirdikten sonra .yanında gürültü çoğaldı, sesler yükseldi. Biz de yanından çıkarıldık. (Arkadaşlarımla yalnız kalınca) onlara dedim ki: \"Ebu Kebşe'nin oğlunun işi gerçekten büyüyor. Asfar oğullarının (Rumların) kralı bile ondan korkuyor. Artık Allah Resulü'nün galip geleceğine, Allah İslâm'ı kalbime yerleştirinceye kadar kesin olarak inanmaya devam ettim.\" İliya (Beyt-i Makdis) emiri ve Herakleios'un dostu olup Şam hıristiyanlarına piskopos tayin edilen İbnü'n-Nâtur Herakleios'tan bahsederek derdi ki: \"Herakleios, Beyt-i Makdis'e geldiği zaman çok üzgün göründü. Komutanlarından bazıları ona: 'Senin bir sıkıntın olduğunu görüyoruz' dediler. İbnü'n-Nâtur dedi ki: Herakleios yıldızlara bakan, kahinlikle uğraşan bir kişiydi. Bu soru karşısın­da onlara: 'Bu gece yıldızlara baktığımda sünnet olanların kralının ortaya çıktı­ğını gördüm. Bu ümmet içinde sünnet olanlar kimlerdir?' diye sordu. Yahudiler'den başka sünnet olan yoktur, onlardan da endişe etme. Ülkenin şehirlerine mektup yaz, oralardaki Yahudiler'i öldürsünler' dediler. Derken Herakleios'un huzuruna Gassanî hükümdarı tarafından Hz. Peygamber'e dair haber ulaştırmakla görevli bir adam getirildi. Herakleios o adamdan haberi alınca: 'Bu adam sünnetli midir, değil midir? Bir bakın' dedi. Baktılar ve sünnetli olduğunu bildirdiler. Herakleios gelen adama: 'Araplar sün­net olur mu?' diye sordu. Sünnet' olduklarını öğrenince 'Bu ümmetin kralı İşte ortaya çıkmıştır1 dedi. Ondan sonra Herakleios, Roma'da ilimde kendisine denk bir dostuna mektup yazıp, Hıms'a gitti. Hıms'tan ayrılmadan o dostundan, Peygamber'in çıktığı ve bunun gerçek bir peygamber olduğu hakkındaki görü­şüne uygun bir mektup geldi. Sonra Herakleios, Hıms'ta bulunan bir sarayına Rumların önde gelenlerini davet ederek kapıların kapanmasını emretti. Sonra yüksek bir yere çıkıp: 'Ey Rum topluluğu! Bu peygambere biat edip kurtuluş ve doğru yola kavuş­mayı istemez misiniz? Hem de bu sayede mülkünüz elinizde kalır' diye hitap etti. Bunun üzerine topluluk, yaban eşekleri gibi hızla kapılara doğru koştularsa da kapıların kapalı olduğunu gördüler. Herakleios, bu kadar nefret ettiklerini görüp iman etmelerinden ümidini kesince: Bunları geri çevirin' diye emretti ve onlara dönüp: Biraz önceki sözlerimi, dininize olan sıkı bağlılığınızı denemek için söyle­dim. Bunu da gözlerimle gördüm1 dedi. Bu söz üzerine oradakiler memnunluklarını bildirerek kendisine saygı için secde ettiler. Herakleios hakkındaki haberin sonu da bundan ibarettir. Tekrar: 51, 2681, 2804, 2941, 2978, 3174, 4553, 5980, 6260, 7169, 7541",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		}
	]
}