{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7012,
			"arabicnumber": 7012,
			"text": "Aişe r.anhs'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Ben seninle evlenmeden önce bana rüyadg iki kere gösteri/din. Ben meleği ipekten bir kumaş parçası üzerinde senin suretini taşırken gördüm. Ona 'Bu kumaş parçasını aç!' dedim. Melek de onu açtı. Bir de baktım ki o sendin. Ben eğer bu rüya Allah tarafından ise o bunu gerçekleştirecektir dedim. Sonra melek seni bir ipek parçası üzerinde taşırken ikinci defa bana gösterildin. Ben ona 'Bu parçayı aç!' dedim. O da açtı; Bir de baktım ki o suret sendin. Bunun üzerine ben 'Eğer bu rüya Allah tarafından gösteri/miş ise Allah bunu gerçekleştirecektir' dedim.\" Fethu'l-Bari Açıklaması: \"Rüyada ipek elbise görmek.\" İmam Buhari bu ve bundan önceki konuyla ilgili olarak Hz. Aişe r.anhs'nın naklettiği hadise yer vermiştir. Bu hadis, Resuluilah Sallallahu Aleyhi ve Sellem'in kendisiyle evlenmeden önce onu rüyada görmesine dairdir. Söz konusu hadis, Resulullah Sallallahu Aleyhi ve Sellem'in Medine'ye hicretinden önceki sıreti bölümünde geçmişti. Kurtubi şöyle der: Resulullah s.a.v., Hz. Aişe r.anha'yı uyanıkken gördüğü gibi rüyada da gördüğünü ifade etmek istemektedir. Netice olarak rüyada kastedilen başkası değil, Hz. Aişe radıyallShu anhS olmaktadır. Hammad b. Seleme kendi rivayetinde kastedilenin kim olduğunu şu şekilde açıklamaktadır: \"Hz. Hatice'nin vefatından sonra ipekten bir kumaş parçası içinde bana bir kadın getiri/di. \" İbn Battal şu açıklamayı yapar: Rüyada kadın görmek birkaç şekilde tabir edilir. Bir tabire göre rüyada kadın görmek, kişinin bizzat o gördüğü kadınla veya benzeriyle evleneceği şeklinde tabir edilir. Bazen rüyada görülen kadın, dünyalık elde etme veya dünyada bir mertebe kazanma ya da rızık genişliği olarak tabir edilir. Rüya tabircilerinin bu konudaki görüşleri bundan ibarettir. Bazen rüyada görülen kadın, onunla birlikte rüyayı görenin başına gelecek olan bir fitneye delalet edebilir. Rüyada kadınların ipek elbise giymeleri evlenmeye, rahatlamaya, zenginliğe, kilo almaya delalet eder. Tabirciler insanın bedenini sarması dolayısıyla bütün giysilerin kişinin vücuduna delalet ettiğini söylemişlerdir. Özellikle de elbise örfte insanların toplum içindeki mertebeleri ve ahvalinin göstergesi olduğunda tabir böyle olacaktır",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 30
			}
		}
	]
}