{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7017,
			"arabicnumber": 7017,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zaman yaklaşınca mu'minin rüyası hemen hemen hiç yalan çıkmaz. Çünkü mu'minin rüyası, Nebiliğin kırk altı cüzünden bir cüzdür. Nebilikten cüz olan bir şey yalan çıkmaz.\" Muhammed b. Sirin şöyle dedi: Benim kanaatim de budur. İbn-i Sirin şöyle devam eder: Rüyanın üç çeşit olduğu söyleniyordu. İnsanın içinden geçenler, şeytanın korkutması ve Allah tarafından olan müjde. Kim rüyada hoşlanmayacağı bir şey görürse bunu hiç kimseye söylemesin ve kalkıp namaz kılsın. İbn-i Sirin şöyle devam eder: Rüyada tasma görmek hoş karşılanmazdı. Onlar ayağa vurulan bağı bukağıyı hoş görürlerdi ve ayağa vurulan bağ, dinde sebat anlamına gelir denirdi. Fethu'l-Bari Açıklaması: \"Rüyada ayaklarının bağlı olduğunu görmek.\" Yani bir kimse rüyada ayaklarının bağlı olduğunu görse bunun tabiri nedir? Haberin mutlak olarak zahiri, tüm çeşitleri ile rüyada görülen bağın dinde sebat olarak tabir edileceğini göstermektedir. Fakat tabirciler, bunu başka bir karine bulunmaması şartına bağlamışıardır. Sözgelimi bir kimse yolcu veya hasta ise ayak bağı, o kişinin yolculuğunun veya hastalığının uzayacağına delalet eder. Aynı şekilde bir kimse sözkonusu bağda fazladan bir nitelik görse, mesela ayağının gümüş bir bağ ile bağlandığını görse bu, o kişinin evleneceğine delalet eder. Ayağa vurulan bağ altından ise bu o kişinin arzulamış olduğu bir mala delalet eder. Bu bağ pirinçten (sarı) ise bu hoşlanılmayan bir şeyin başa geleceğine ya da elden çıkacak bir mala delalet eder. Ayak bağı kurşundan ise bu zayıf ve gevşek bir işe delalet eder. Bağ iptense dinle ilgilidir. Tahtadan olduğu takdirde içinde nifak olan bir meseleye delalet eder. Ahşaptan ise rüyayı görenin bir töhmete uğrayacağına delalet eder. Sözkonusu bağ bir hırka veya ipten ise bu devam etmeyecek bir işe delalet eder. \"Zaman yaklaşınca mu'minin rüyası hemen hemen hiç yalan çıkmaz.\" Hattabi Mealimu's-Sünen isimli eserinde şöyle der: \"Zamanın yaklaşması\"nın ne anlama geldiği konusunda iki görüş ileri sürülmüştür. Birincisine göre bunun manası gece ile gündüzün zamanının birbirine yaklaşmasıdır. Tabirciler şöyle derler: Rüyanın en doğru çıkanı, geceyle gündüzün birbirine eşit olduğu ve meyvelerin olgunlaştığı zamanlardır. Hattabi bunu Garibu'l-Hadis isimli eserde Ebu Davud' dan nakleder sonra şöyle der: Tabirciler rüyaların dosdoğru olarak çıktığı zaman çiçeklerin açtığı, meyvelerin olgunlaştığı zamandır. Bu iki zaman, geceyle gündüzün birbirine eşit olduğu vakittir. Bu konudaki ikinci yaklaşıma göre \"zamanın yaklaşması\" kıyametin kopması yaklaştığında süresinin sona ermesi anlamınadır. Biz de şunu ekleyelim: Birinci yaklaşımın mu'minle kayıtlanması, uzak bir ihtimaldir. Çünkü tabiatın mutedil olduğu vakit mü'mine mahsus değildir. İbn Battal birinci yaklaşımın doğru olduğunu kesin bir dille ifade etmiştir. O, bu konuda Tirmizi'nin Ma'mer vasıtasıyla Eyyub'dan naklettiği habere dayanmaktadır. Sözkonusu habere göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Zamanın ahirinde mu'minin rüyası yalan çıkmaz. Onların içinde rüyası en doğru olan, sözü en doğru olandır. \"(Tirmizi, Rüya) İbn Battal şöyle der: Buna göre hadisin manası şudur: Kıyamet yaklaştığında ve ilmin çoğu yeryüzünden alınıp, kargaşa ve fitne dolayısıyla dindarlığın dışa vuran alametleri yeryüzünden silindiğinde insanlar tıpkı fetret döneminde olduğu gibi kendilerini uyaran ve dinden silinmiş olan şeyleri yenileyen birisine ihtiyaç duyacaklardır. Tıpkı geçmiş ümmetierin Nebiler vasıtası ile uyarıldıkları gibi. .. Fakat bizim Nebiimiz, Nebilerin sonuncusu (Hatemü'l-Enbiya) olduğundan ve sözkonusu zaman fetret dönemine benzediğinden mahrum oldukları Nebilik yerine, müjdeleme ve uyarı müessesesi olan Nebiliğin bir cüzü olan sadık rüya verildi. Kurtubi el-Müfhim'de şöyle der: Hadiste zikri geçen \"zamanın ahiri\"nden maksat -Allah daha iyi bilir- Deccal'i öldürdükten sonra Meryem oğlu İsa ile birlikte bulunacak olan zümrenin zamanıdır. Müslim'in, Abdullah b. Ömer'den nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Yüce Allah Meryem oğlu İsa'yı gönderir. O insanların içinde yedi yıl kalır. Bu süre zarfında birinin diğeriyle arasında hiçbir düşmanlık olmaz. Sonra Yüce Allah Şam tarafından soğuk bir rüzgar gönderir. Yeryüzünde kalbinde zerre kadar hayır veya iman bulunup da ruhu kabzedilmemiş hiç kimse kalmaz.\"(Müs!im, Fiten) Kurtub! şöyle der: Bu zamanın insanları asr-ı saadetten sonra bu ümmetin içinde durumu en iyi ve sözleri en doğru olan zümre olacaktır. Onların rüyaları yalan çıkmayacaktır. Buradan hareketle Resulullah Sallallahu Aleyhi ve Sellem ifadesinin devamında \"Onların içinde rüyası en doğru olanı, sözü en doğru alandır\" buyurmaktadır. Bunun sebebi şudur: Çok doğru söyleyen kimsenin kalbi nurlanır, idraki güçlenir ve bu durumda manaları sahih bir şekilde tercih eder. Uyanık halde iken çoğunlukla doğru olan kimse de böyledir. Bu doğruluğu rüyasında da ondan ayrılmaz ve ancak doğru ve sadık rüya görür. Bu durum yalancı ve karıştıran kimsenin durumundan farklıdır. Çünkü yalancının kalbi bozuk ve karanlık olur. O ancak karmakarışık şeyler görür. Zaman zaman nadiren de olsa doğru sözlü kimse sahih olmayan şeyler görürken, yalancı sahih olanları görebilir. Fakat çoğunluk ve genelolan yukarda anlattığımız gibidir. Doğruyu en iyi Allah Teala bilir. \"İnsanın içinden geçenler, şeytanın korkutması ve Allah tarafından olan müjde.\" Müslim'de yer alan bir rivayette Cabir şöyleanlatır: \"Bedevinin biri Nebi Sallallahu Aleyhi ve Sellem'e gelerek \"Ya Resulallah! Rüyamda başımın koparıldığını ve onun ardından gittiğim i gördüm\" der. Bir başka rivayette ise \"Başım yerinden çıktı ve ardından koştum\" ifadesi yer almaktadır. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem \"Şeytanın rüyada seninle oynamasını kimseye anlatma\" buyurur.(Müs!im, Rüya) \"Rüyada tasma görmek hoş karşılanmazd!. Onlar ayağa vurulan bağı hoş görürlerdi ve ayağa vurulan bağ, dinde sebat anlamına gelir denirdi.\" Mühelleb şöyle der: Rüyada görülen tasma, hoşlanılmayan şeylerle tabir edilir. Çünkü Yüce Allah kitabında: \"Boyunlarında demir halkalar ve zincirler olduğu halde sıcak suya sürüklenecekler\"(Mu'min 71) ayet-i kerimesinde onun cehennemliklerin niteliklerinden olduğunu haber vermektedir. Boyuna geçirilen halka bazen küfre delalet edebilir. Bazen eziyet veren kadın şeklinde tabir edilir. İbnü'l-Arabi' şöyle der: Tabirdıerin ayağa vurulan bağı bukağıyı sevmeleri, Resulullah Sallallahu Aleyhi ve Sellem'in onu övülen kısımda zikretmesinden dolayıdır. Çünkü o \"İmanın kaydı adam öldürmeyi engellemesidir. Bir mu'min başkasını öldürmez\" buyurmuştur. (Abdurrezzak, Musannef, V, 298) Boyna vurulan halkaya gelince, bu anlam itibariyle şer'an çirkin görülmüştür. Yüce Allah şöyle buyurur: \"Onu yakalayın da {ellerini boynuna} bağlayın.\"(Hakka 30) \"Boyunlarında demir halkalar ve zincirler olduğu halde sıcak suya sürükleneeekler, sonra da ateşte yakılaeaklardır.\"(Mu'min 71- 72) \"Eli sıkı olma, büsbütün eli açık da olma.\"(İsra 29) \"Nay dedikleri yüzünden elleri bağlanası ve lanet olasılar!\" (Maide 64) Ayağa 'vurulan bağın dinde sebat olması, ayağı bağlı olan kimsenin yürüyememesinden kaynaklanmaktadır. Yüce Allah bunu insanın batıla yürümesine engelolan imana örnek olarak vermiştir. Nevevl'nin belirttiğine göre bilginler şöyle demişlerdir: Ayağa vurulan bağın sevimli olması, onun ayağa vurulmasından dolayıdır. Bu bağ insanı günahlara dalıp, kötülük işlemekten ve batıla sapmaktan alıkoyar. Boyuna vurulan bağın sevimsiz olması ise bunun boyuna vurulmasındandır. Bu da cehennemliklerin niteliğidir. Tabireiler ayağa vurulan bağ kişinin lehine gördüğü işte sebattır demişlerdir. Tabircilere göre kişi hem boynuna ve hem de ayağına bağ vurulduğunu görürse bu hoşlanılmayan şeyin fazlalığına delalet eder. Ellere vurulan bağ övülmüştür. Zira bu elleri kötülüğe uzanmaktan alıkoyar. Kişinin durumuna göre bazen ellere vurulan bağ cimrilik olarak tabir edilir. Tabireiler bir de şunu söylemişlerdir: Bir kimse iki elinin bağlanmış olduğunu görürse bu kişi eimridir. Buna karşılık elinin ve ayağının bağlanmış olduğunu gördüğü takdirde hapse veya sıkıntılı bir duruma düşer. Biz de şunu ekleyelim: Boyna vurulan bağ, bazı rüyalarda Hz. Ebu Bekir' de olduğu gibi övülmüştür. Ebu Bekir b. Ebi Şeybe'nin sahih bir senedIe nakline göre Mesruk şöyle anlatmıştır: Suhayb, Ebu Bekir' e uğrar ve ondan yüz çevirir. Ebu Bekir sebebini sorunca Suhayb \"Elini Ensardan Ebü'l-Haşr'ın kapısının üzerinde bağlı gördüm\" der. Bunun üzerine Ebu Bekir \"Haşr gününe kadar dini m benim için muhafaza edilecek\" der. (Abdurrezzak, Musannef, VI, 179)",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 34
			}
		}
	]
}