{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7028,
			"arabicnumber": 7028,
			"text": "İbn Ömer şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem'in sahabilerinden bazıları onun zamanında rüya görürlerdi de bunu kendisine anlatırlardı. Resulullah Sallallahu Aleyhi ve Sellem de o rüyalar hakkında Allah' ın dilediği tabirleri söylerdi. Ben ise o sırada yaşı küçük bir oğlan idim. Evlenmeden önce evim mescid idi. Kendi kendime 'Eğer sende bir hayır varsa, elbette bu adamların görmekte olduğu gibi rüya görürsün!' dedim. Nihayet bir gece yattıffi. \"Allah'ım! Eğer bende bir hayır bilmekte isen bana bir rüya göster!\" diye dua ettim. Ben böyle uyumakta iken birden yanıma iki melek geldi. Onlardan her birinin elinde demirden yapılmış, ucu çevgenli birer sopa vardı. Bunlar beni cehenneme yöneltip götürüyorlardı. Ben onların ikisi arasında iken \"Ya Allah! Cehennemden sana sığınırım!\" diye dua ediyordum. Sonra bana şöyle gösterildi: Beni elinde demirden yapılmış çevgenli bir sopası bulunan bir melek karşıladı ve bana \"Sen asla korkutulmayacaksın! (Gece) namazını çok kıldığın takdirde ne iyi kişisin!\" dedi. Sonra beni götürdüler ve nihayet cehennemin kenarına durdurdular. Bir de baktım ki cehennem kuyu duvarı gibi örülmüştü. Onun, örülü kuyunun yanları gibi birçok çıkıntılı yanları vardı. Her iki çıkıntı arasında elinde demirden yapılmış ucu çevgenli bir sopası bulunan melek vardı. Cehennemde başları önlerine eğik, zincirlerle asılmış birtakım insanlar gördüm. Orada Kureyş'ten birçok insanları tanıdım. Sonra melekler beni sağ taraftan götürdüler. [-7029-] Ben (uyandıktan sonra) bu rüyamı kızkardeşim Hafsa'ya anlattım. Hafsa da bunu Resulullah Sallallahu Aleyhi ve Sellem' e aktarmış. Resulullah Sallallahu Aleyhi ve Sellem \"Şüphesiz Abdullah iyi bir adamdır\" buyurmuş. Nafi şöyle der: Abdullah, bu olaydan sonra gece namazını çok çok kılmaya devam etti. Fethu'l-Bari Açıklaması: \"Rüyada güven içinde olduğunu ve korkunun gittiğini görmek.\" Başlıkta yer alan \"... er-rav'\" korku, \"er-nı'\" kalp, gönül demektir. Tabirciler şöyle demişlerdir: Bir kimse rüyasında herhangi bir şeyden korktuğunu görse ondan emin olur. Herhangi bir kimse rüyasında bir şeyden emin olduğunu görse ondan korkar. .......Mikma'a\" kelimesinin çoğulu .......mekami\" şeklinde olup, anlamı demirden yapılmış kamçı gibi ucu çevgenli bir sopa demektir. \"Len tura\" sen asla korkmayacaksm demektir. \"……\" Arapçada ….. kuyunun yanları olup, taştan örülür. Bunun üzerine makaranın raptedildiği bir ağaç konur. Her bir kuyunun iki yanı olması adettendir. İbn Battal şöyle der: Bu hadisten bazı rüyaların tabir edilmeye ihtiyacı olmadığı, uyku esnasında rüyada yapılan tabirin uyanıkken yapılacak tabir olduğu anlaşılmaktadır. Çünkü Nebi Sallallahu Aleyhi ve Sellem, meleğin yaptığı tabirin üzerine bir şeyeklememiştir. Biz de şunu vurgulayalım: İbn Battal, hadisin sonundaki Resulullah Sallallahu Aleyhi ve Sellem'in \"Şüphesiz Abdullah iyi bir adamdır\" şeklindeki ifadesine ve meleğin bundan önce \"Gece namazını çok kıldığın takdirde ne iyi kişisin!\" sözüne işaret etmektedir. Bundan sonraki başlıkta ise melekin ona \"sen korkma çünkü iyi bir kişisin\" şeklindeki ifadesi yer almaktadır. Bu hadisin sonunda Nebi Sallallahu Aleyhi ve Sellem \"Abdullah gece namazını çok kıldığı takdirde iyi bir kişidir\" ifadesi yer almaktadır. İbn Battal şöyle der: Bu hadiste sünnetieri terk etmeye tehdit yer alırken bunun yüzünden kişinin azaba uğramasmın mümkün olduğu ifade edilmektedir. Bizce bu, sünneti sevmediği için kılmamaya devam etme şartına bağlıdır. Tehdit ve azap haram olan bir fiilde sözkonusudur. Bu da yüz çevirme kaydıyla yapılan terktir. İbn Battal şöyle der: Tabirin aslı Nebilere dayanmaktadır. Bundan dolayı İbn Ömer bir rüya görmeyi ve rüyasını -yapılacak tabir kendi nezdinde bir esas olsun diyeNebi Sallallahu Aleyhi ve Sellem'in tabir etmesini temenni etmiştir. Hadisten Çıkan Sonuçlar 1- Mescidde yatmak caizdir. Başkasının gördüğü rüyayı onun yerine anlatmak meşrudur. Hadisten İbn Ömer'in Nebi s.a.v. karşısındaki edebi, onun huzurunda duyduğu heybet anlaşılmaktadır. Çünkü o gördüğü rüyayı bizzat kendisi anlatmamıştır. Rüyası ona korkunç gelince, bunu bizzat kendisi anlatmayı tercih etmemiş ve Nebi s.a.v.'e aktarması için ablasına anlatmıştır. 2- Gece namazı faziletlidir. Hadisten bunun dışında daha önce zikredilen ve Teheccüd bölümünde uzun uzun anlatılan başka sonuçlar da çıkmaktadır. Doğruyu en iyi Yüce Allah bilir",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}