{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7043,
			"arabicnumber": 7043,
			"text": "İbn Ömer'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Yalanların en büyüğü, kişinin rüyasında görmediği şeyi gözleriyle gördüğünü iddia etmesidir\" demiştir. Fethu'l-Bari Açıklaması: \"Görmediği bir rüyayı gördüğünü iddia etmek.\" Yani bunu yapan kişinin kınanmış olduğu. Bu hadis üç hüküm içermektedir. Rüyası hakkında yalan söylemek, sözünün dinlenmesinden hoşlanmayan kimsenin sözüne kulak vermek ve suret yapmaktır. Libas bölümünün son kısımlarında \"Her kim bir suret yaparsa ... \" hadisi açıklamasıyla birlikte geçmişti. Görmediği rüyayı gördüğünü iddia etmeye gelince, Taberi şöyle demiştir: Uyanıkken yalan söylemek, bazen görmediği rüyayı gördüğünü iddia ederek yalan söylemekten daha çok fesada yol açar. Zira bu, adam öldürme veya bir had cezası ya da birinin malını çalma hakkında yalan yere şahitlik olabilir. Böylısi yalan şahitlik daha çok fesada yol açtığı halde görmediği rüyayı gördüğünÜ iddia ederek yalan söylemeye bu derece tehdit yönlendirilmesi, rüya hakkında yalan söylemenin göstermediği rüyayı gösterdi diye' Allah'a yalan iftira atmaktan kaynaklanmaktadır. Allah'a yalan iftirası atmak, yaratıklara yalan iftira atmaktan çok daha ağırdır. Çünkü Yüce Allah \"Onlar (kıyamet gününde) Rablerine arz edilecekler, şahitler de 'işte bunlar Rablerine karşı yalan söyleyenlerdir' diyecekler\"(Hud 18) buyurmaktadır. Rüya hakkında yalan söylemek \"Rüya Nebilikten bir cüzdür\" hadisi dolayısıyla Allah'a yalan iftira etmek anlamındadır. Nebiliğin cüzlerinden birisi olan şey, Yüce Allah tarafındandır. \"Ona iki arpa tanesini birbirine düğümlemesi teklif edilir\" ifadesi terim anlamındaki mükellef kılma değildir. O, daha önce geçtiği üzere azap etmenin kinayeli anlatımıdır. Kulağına kurşun dökme şeklindeki tehdit, cezanın yapılan suçun cinsinden olmasından kaynaklanmaktadır. Hadis metninde geçen \"el-anük\" erimiş kurşun demektir. İbn Ebi Cemre şöyle demiştir: Hadisten kulluk niteliğinden dışarı çıkan kimsenin Çıktığı oranda cezayı hak ettiği anlaşılmaktadır. Hadiste bunu bilmeyen kimsenin bilmemesi dolayısıyla mazur olmayacağı uyarısı yapılmaktadır. Bu konuda batıl bir tevile sapan da aynı şekildedir. Çünkü haberde bunun haram olduğunu bilenle bilmeyen arasında herhangi bir fark gözetilmemektedir. \"Valanların en büyüğü\" \"efra\" ismi, ism-i tafdil ölçüsünde olarak yalanların en büyüğü demektir. \"el-Fira\" \"el-firye\" kelimesinin çoğuludur. İbn Battal \"elfirye\" hayret uyandıracak büyük yalan demektir",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 57
			}
		}
	]
}