{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"91": "Interpretation of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7047,
			"arabicnumber": 7047,
			"text": "Semura b. Cündeb şöyle anlatmıştır: Resulullah Sallallahu Aleyhi ve Sellem'in \"Herhangi biriniz rüya gördü mü?\" diye sık sık sorduğu olurdu. Bunun üzerine Allah'ın anlatmasını dilediği biri olursa çıkar rüyasını anlatırdı. Bir gün Nebi Sallallahu Aleyhi ve Sellem, sabah vakti bize kendi gördüğü rüyasını şöyle anlattı: \"Bu gece bana iki kişi geldi. Beni (rüyada) uyandırdılar ve 'Bizimle yürü!' dediler. Ben de onlarla birlikte yürüdüm. Nihayet yatmakta olan bir adamın yanına vardık. Bunun başucunda da elinde taş bulunan başka bir adam durmuş, o yatan adamın başını taşla vurup kınyordu. Taşı başına her vurduğunda taş o tarafa yuvarlanıp gidiyordu. Atan adam da arkasından koşuyor ve onu tekrar alıp getiriyordu. O dönüp gelmeden berikinin başı iyi oluyor ve eski haline dönüyordu. Sonra taşı getiren adam yatan adamın üzerine dönüyor ve ona birinci defa yaptığının aynısını yapıyordu. \" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Ben bu iki kişiye 'Subhanallah! Bu iki kişi nedir?' diye sordum. Bana 'Yürü, yürü!' dediler. Bizler yürüdük ve sonunda arka üstü yatmakta olan bir adamın yanına geldik. Onun başucunda da elinde demirden çatal bir kanca bulunan başka bir adam ayakta duruyordu. Ayakta duran adam yatan adamın. yüzünün bir tarafı üzerine eğiliyor ve ağzının yan tarafını ta başının arkasına kadar yırtıp parçalıyordu. Yine onun boğazını da başının arkasına kadar kesip parçalıyor, gözünü de başının arkasına kadar yırtıp parçalıyordu.\" Ravi dedi ki: Ebu Reca \"A=kesiyor\" yerine \"=yarıyor\" ifadesini kullanmış da olabilir. Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Sonra bu adam onun ağzının diğer tarafına geçiyor ve orasını da ilk yaptığı gibi yarıp parçalıyordu. Bu kısmı parçalamayı bitirinceye kadar ağzın diğer yanı eskiden olduğu gibi iyileşiyordu. Sonra adam tekrar oraya dönüyor, orasını birinci defada yaptığı gibi kesip yarıyordu.\" Resulullah Sallallahu Aleyhi ve Sellem dedi ki: \"Ben yine yanımdaki iki kişiye 'Subhanallah! Bu iki adamın hali nedir?' diye sordum. \" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"O iki kişi bana 'Yürü, yürü!' dediler. Biz yine yürüdük ve tennur (tandır) gibi bir şeyin yanına geldik.\" Ravi dedi ki: Zannederim ki o şöyle diyordu: \"Bir de baktık ki onun içinde karışık bağırmalar ve birçok sesler vardı.\" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Biz onun ağzına doğru baktık ki içeride birçok çıplak erkekler ve çıplak kadınlar vardı. Onların aşağısından kendilerine bir ateş alevi geliyordu. Onlara bu alev geldikçe bağırıp çağırıyorlardı. \" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Yanımdaki iki kişiye 'Bu çıplak erkekler ve kadınlar nedir?' diye sordum. O ikisi bana 'Yürü, yürü!' dediler. Biz yine yürüdük ve bir nehir üzerine geldik.\" Ravi dedi ki: Zannediyorum ki o şöyle diyordu: \"Nehir kan gibi kırmızı idi. Bir de baktık ki bu nehirin içinde yüzmekte olan bir adam vardı. Nehrin kenarında da yanıbaşında birçok taş toplamış bir adam vardı. Nehirdeki bu adam yüzdüğü kadar yüzüyor, sonra yanında taşlar toplayan adamın yanına geliyor ve ona doğru ağzını açıyor. Kenardaki adam da ona bir taş atıp yutturuyor. Bunun üzerine nehirdeki adam yüzerek geriye doğru gidiyor. Sonra tekrar kenardakine doğru dönüp geliyor. Kenardakinin yanına her dönüşünde onun ağzının içine bir taş daha atıyor ve ona taşı yutturuyor.\" Resulullah Sallallahu Aleyhi ve Sellem dedi ki: \"Yanımdaki iki kişiye 'Bu iki adamın hali nedir?' diye sordum. Bana 'Yürü, yürü!' dediler.\" Resulullah Sallallahu Aleyhi ve Sellem dedi ki: \"Biz yine yürüdük ve sonunda gördüğüm en çirkin görünüşte olan çirkin manzaralı bir adamın yanına geldik. Bir de baktı k ki onun yanında yatmakta olduğu ve etrafında koşmakta bulunduğu bir ateş vardır. Ben yine o iki kişiye 'Bu adamın hali nedir?' diye sordum. Onlar da bana 'Yürü, yürü!' diye emrettiler. Biz yine yürüdük. Sonunda uzun ağaçlar ve bol bitkilerle sarılmış bir bahçeye geldik. Bahçede baharın her bir çiçeğinden vardı. Bahçenin ortasında çok uzun boylu bir adam vardı ki ben onun semaya doğru uzanan başını hemen hemen göremiyordum. Adamın etrafında da asla görmediğim kadar pek çok çocuklar vardı. Ben yanımdaki iki kişiye 'Bu uzun adam ve bu çocuklar nedir?' diye sordum. O iki kişi bana 'Yürü, yürü!' dediler. Biz yine yürüdük ve sonunda büyük bir bahçeye vardık. Ben asla ondan daha büyük ve daha güzel bir bahçe görmüş değilim. Yanımdaki iki kişi bana 'Bu ağaçların içinde yükseğe çık!' dediler. Biz o ağaçların içlerinde yükseklere doğru çıktık. Nihayet altın ve gümüşten tuğlalarla bina edilmiş olan bir beldeye ulaştık. Şehrin kapısına geldik ve açılmasını istedik. Kapı bizim için açıldı. Kapıdan şehre girdik. Bizleri onun içinde birtakım adamlar karşıladılar ki, bunların vücutlarının yarısı gördüğüm en güzel insan şeklinde, diğer yarısı da gördüğüm en çirkin insan şeklinde idi. Yanımdaki iki kişi o insanlara 'Gidiniz de şu nehir içine giriniz' dediler. Orada enine akmakta olan bir nehir vardı ki sanki suyu süt kadar beyazdı. O insanlar gittiler ve o nehrin içine girdiler. Sonra kendilerinden o çirkin sıfatlar gitmiş olarak en güzel surette bizim yanımıza döndüler. Yanımda bulunan iki kişi bana 'Bu şehir Adn cennetidir, işte burası senin menzilindir!' dediler. Gözlerim yükselip, yukarıya doğru baktı, bir de ne göreyim! Gökyüzündeki çok uzak bulut gibi bembeyaz bir köşk gördüm. Yanımdaki iki kişi bana 'İşte orası senin menzilindir!' dediler. Ben de onlara '11 Ila h sizlere bereketler ihsan eylesin! Müsaade edin de oraya gireyim' dedim. Onlar 'Şimdi oraya giremezsin. Sen ileride oraya gireceksin!' dediler. Ben yanımda bulunan o iki kişiye 'Ben bu gece boyunca çok hayret verici şeyler gördüm. Benim gördüğüm bu şeyler nedir?' dedim. O iki kişi bana şöyle anlattı: Sana bunun haberini vereceğiz. Şu yanına geldiğin ve taş ile başı ezilen birinci adam Kur'an'ı alıyor, onu reddediyor ve farz namazı terk ederek uyuyordu. Şu üzerine gelip, başının arkasına kadar ağzının bir tarafı, boğazı da başının arkasına kadar, gözü de başının arkasına kadar yırtılıp parçalandığını gördüğün adam da erkenden evinden gider ve öyle bir yalan söylerdi ki onun bu yalanı her tarafa yayılırdı. Şu fırın gibi binanın içinde görmüş olduğun o çıplak erkek ve kadınlar da zina eden erkekler ve kadınlardır. O nehirde yüzmekte olup üzerine geldiğin ve kendisine taş yutturulan adam ise faiz yiyen kimsedir. Bir ateş yanında onu yakıp, etrafında koşmakta olan o çirkin manzaralı adam da cehennemin bekçisi olan Malik'tir. O büyük bahçenin içinde gördüğün uzun boylu adam İbrahim Nebidir. Onun etrafındaki çocuklar ise fıtrat üzere ölen her bir çocuğudur.\" Semura dedi ki: Bazı Müslümanlar \"Ya Resulallah! Müşriklerin çocukları da mı?\" diye sordular. Resulullah Sallallahu Aleyhi ve Sellem \"Müşriklerin çocukları da\" buyurdu ve devamla: \"Kendilerinin bir kısım güzel, diğer kısımları da çirkin olan o topluluk bir kısım güzel amellerini diğer çirkin amelleriyle karıştırmış olan kimselerdir ki Allah onların suçlarını bağışlamıştır.\" Fethu'l-Bari Açıklaması: \"Rüya tabirini sabah namazının ardından yapmak.\" Bu başlıkta Abdurrezzak'ın Ma'mer vasıtasıyla Said b. Abdurrahman'ın bazı alimlerden naklettiği şu görüşün zayıf olduğuna işaret edilmektedir: \"Rüyanı kadına anlatma, onu güneş doğuncaya kadar kimseye söyleme.\"(Abdurreızak, Musannef, XI, 215) Bu başlıkta ayrıca tabirdıerin müstehab olan rüya tabirinin güneş doğduktan itibaren dörde kadar ve ikindiden akşam namazının öncesine kadar yapılmasıdır şeklindeki görüşlerine red vardır. Çünkü hadis, rüya tabirinin güneş doğmadan önce yapılmasının müstehab olduğunu göstermektedir. Bu, tabircilerin rüyanın namaz kılmanın mekruh olduğu vakitlerde tabir edilmesinin mekruh olduğu şeklindeki görüşleriyle çelişmez. Mühelleb şöyle demiştir: Sabah namazı vakti rüya tabiri diğer vakitlerden daha evladır. Çünkü rüya gören kişi onu kısa bir süre önce gördüğü ve henüz unutmadığı için aklında tutar. Ayrıca tabirdnin zihni dağılmamış, geçimiyle ilgili şeyler konusunda düşüncesi fazla meşgulolmadığından rüyayı gören rüya sebebiyle kendisine arz olan şeyi bilir ve hayırla sevinir, kötülükten kaçınır ve buna hazırlanır. Belki de rüyasında bir masiyete karşı uyarı vardır ve bu sayede o masiyetten kaçınır. Gördüğü rüya bir iş konusunda uyarı niteliğinde olup, onu gören o hususta tetikte olur. Rüya tabirdsi son olarak şöyle der: Bunlar rüyanın günün ilk saatlerinde tabir edilmesinin birkaç faydasından ibarettir. .......... yani onlar beni uyandırdılar. .......... başını yardı. ........, onu yukarıdan aşağıya attı. \"C..l>.l.i Tedehdehe\" yukarıdan aşağıya düştü anlamına gelir. ........ yanağını yarıyordu......... eş-Şıdku\" ağzın yan tarafı demektir. \"Ke ekrehi ma ente ra in raculen mir'aten\" yani çirkin manzaralı. \"Ve yes'a havleha.\" Cerır'in rivayetine göre \"ve yukiduha\" bu kelime \"yahuşşuha\"nın tefsiri mahiyetindedir. \"Ke enne maehu'l-mahd\" bu ister tatlı, ister acı olsun içine hiç su katılmamış süt demektir. \"Mislu'r-rebabeti\" beyaz bulut parçası gibi demektir. \"Fe yerfuduhu=onu reddeder.\" İbn HUbeyre şöyle demiştir: Kur'an'ı ezberledikten sonra reddetmek büyük bir dnayettir. Çünkü bu Kur'an'da onu reddetmeyi gerekli kılan bir şey gördüğü izlenimini uyandırır. Bir kimse dünyadaki en şerefli şeyolan Kur' an' i reddettiğinde organlarının en şereflisi olan başı ezilerek ceza görür. \"Fehum ez-zünatu=Onlar zina edenlerdir.\" Zina edenlerle çıplaklık ilişkisi, onların rezil ve rüsvay olmayı hak etmelerinden dolayıdır. Çünkü onların adeti bir yere geçip gizlenmek olduğundan bu gizlilikleri açığa çıkarılmak suretiyle cezalandırıldılar. Onlara azabın alt taraflarından verilmesindeki hikmet, işledikleri fiilin üreme organları vasıtasıyla olmasından dolayıdır. \"Fe innehu akilu'r-rib\"=o faiz yiyendir.\" İbn Hubeyre şöyle demiştir: Faiz yiyen kimsenin kızıl bir nehirde yüzmesi ve kendisine taş yutturulması, faizi n altın üzerinden yapılmasındandır. Altın da . kırmızı renktedir. Meleğin faiz yiyene taş yutturması, taşın o kimseye hiçbir fayda vermeyeceğine işarettir. Faiz de böyledir. Çünkü faiz yiyen, malının artacağını hayal etmektedir. Halbuki Allah onun arkasından malını telef etmektedir. \"Ve eviadu'l-müşrikın =müşriklerin çocukları.\" Cenaiz bölümünün son kısımlarında müşriklerin çocukları ile ilgili geniş bir açıklama geçmişti. Bu hadisin zahirinden Nebi Sallallahu Aleyhi ve Sellem'in müşriklerin çocuklarını ahiret hükmü açısından Müslümanların çocuklarına kattığını göstermektedir. Bu \"Onlar babalarına tabidirler\" ifadesiyle çelişmez. Çünkü bu dünya hükmü açısından böyledir. Hadisten Çıkan Sonuçlar 1- İsra (gece yürüyüşü) birçok yerde uykuda ve uyanıkken defalarca gerçekleşmiştir. 2- Bazı asiler berzah aleminde azap göreceklerdir. 3- Hadiste bir çeşit bilgi özetleme vardır. Bu metoda göre meseleler önce toptan ele alınır, sonra zihinde topluca yer etmesi için açıklamaya geçilir. 4- Uyuyarak farz namazıarı geçirmemelidir. 5- Kur'an'ı ezberleyen kimse onu reddetmemelidir. Zina etmemeli, faiz yememeli ve kasten yalan söylememelidir. 6- Cennette köşkü olan kimse -Nebi ve şehit bile olsa- dünyada iken onun içinde oturmaz. Aksine öldüğünde ikamet eder. 7 - İlim öğrenmelidir ve kişi ilim alacağı kimsenin ardından gitmelidir. 8- Şehitlerin fazileti vardır ve onların cennetteki yerleri mertebelerin en yükseğidir. 9- İyilikleri ve kötülükleri birbirine eşit olan kimseyi Yüce Allah bağışlar. Ya Rabbi, ey merhamet edenlerin en merhametlisi! Rahmetinle bizim günahlarımızı da bağışla. 10- Rüyaya önem vermeli, tabirini sormalıdır. Rüyanın sabah namazından sonra tabir edilmesi faziletli ve müstehaptır. Çünkü o vakitte insanın aklı henüz çeşitli meselelere dalmamıştır. 11- İmam namazdan sonra kılınacak bir sünnet yoksa ve cemaate vaaz etmek veya fetva vermek ya da aralarında hüküm vermek istiyorsa yüzünücemaate döner. 12- İmamın cemaate dönmek için yüzünü kıbleden çevirmesi mekruh değildir. Aksine minberde bulunan hatip örneğinde olduğu gibi bu, meşrudur",
			"grades": [],
			"reference": {
				"book": 91,
				"hadith": 61
			}
		}
	]
}