{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7060,
			"arabicnumber": 7060,
			"text": "Urve'nin nakline göre Usame b. Zeyd şöyle anlatmıştır: Nebi Sallallahu Aleyhi ve Sellem yüksek bir yerden Medine evleri arasından yükselen köşklere baktı da \"Benim gördüklerimi sizler de görebiliyor musunuz?\" buyurdu. Sahabiler \"Hayır\" dediler. Resulullah Sallallahu Aleyhi ve Sellem \"Şüphesiz ben fitnelerin evlerinizin arasına yağmur damlası gibi döküldüğünü görüyorum\" buyurdu. Fethu'l-Bari Açıklaması: \"Yaklaşan bir kötülükten dolayı vay Arapların haline!\" Nebi Sallallahu Aleyhi ve Sellem'in burada özellikle Arapları zikretmesi İslam'a ilk girenlerin onlar olması ve bir de fitneler baş gösterdi mi helakin büyük bir hızla onlara geleceğine uyarıda bulunmak içindir. \"Utum\" kale demektir. \"..........\" ifadesindeki \"hilal\" ara, açıklık demektir. \".......\" el-Müstemlı ve el-Küşmıhenı rivayetine göre bu kelime ........=yağmur\" şeklindedir. Bu rivayet hakkında Hac bölümünün son kısmında açıklamada bulunmuştuk. Medine'nin bu şekilde nitelenmesinin sebebi, Hz. Osman'ın burada katlediimiş olması ve fitnelerin etrafa bundan sonra yayılmış bulunmasındandır. Cemel ve Sıffin savaşları Hz. Osman'ın katledilmesi üzerine çıkmıştı. Nehrevan' da çıkan çarpışma, Sıffın' da hakeme gidilmesi nedeniyle olmuştu. O asırda meydana gelen bütün çarpışmalar ya bu olayla ilgili bir şeyden veya ondan kaynaklanan başka bir sebepten meydana gelmiştir. Öte yandan Hz. Osman'ın katlinin sebeplerinin en başta geleni valilerine yapılan tenkit, sonra da onları göreve getirdiği için kendisine yönelen eleştiridir. Bu ilk defa Irak'tan kaynaklandı. Irak doğu tarafındadır. Netice olarak bu bölümde yer verilen hadisle \"Fitne doğu tarafından gelecektir\" şeklinde ileride gelecek olan hadis arasında herhangi bir çelişki yoktur. İbn Battal şöyle der: Nebi Sallallahu Aleyhi ve Sellem, Zeynep hadisinde insanlar kıyamet üzerlerine kopmadan önce tövbe edebilsinler diye onun yaklaştığı uyarısında bulunmaktadır. \"Ye'cüc ve Me'cüc'ün kıyametten önce çıkacağı sabittir. Ye'cüc ve Me'cüc seddinden Nebi Sallallahu Aleyhi ve Sellem'in zamanında o kadar bir delik açıldığına göre bu delik zaman geçtikçe genişlemeye devam edecektir. Ebu Hureyre'nin naklettiği bir hadiste Resulullah Sallallahu Aleyhi ve Sellem \"Yaklaşan kötülükten vay Arapların haline! Gücünüz yetiyorsa ölünüz\" buyurmuştur. İbn Battal bu hadisi şöyle yorumlamıştır: Hadisin ifadesi, gelecek fitne ve ona daIma konusunda büyük bir uyarıdır. Çünkü Resulullah Sallallahu Aleyhi ve Sellem ölümü, o fitneye dalmaktan daha hayırlı görmüştür. Nebi s.a.v., Üsame hadisinde Medineliler hazır olup, içine dalmasınıar, Allah'tan sabır ve kötülüğünden kurtuluş dilesinler diye fitnelerin evlerin arasından çıkacağını haber vermiştir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 12
			}
		}
	]
}