{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7069,
			"arabicnumber": 7069,
			"text": "Hind binti el-Haris el-Firasiyye'nin nakline göre Nebi Sallallahu Aleyhi ve Sellem'in eşi Ümmü Seleme şöyle anlatmıştır: Bir gece Resulullah Sallallahu Aleyhi ve Sellem dehşetle uyandı. Şöyle diyordu: \"Subhanallah! Allah bu gece ne hazineler indirdi! Ve ne fitneler indirdi! Namaz kılmaları için hücrelerdeki hanımları -eşlerini- kim uyandırır? Dünyada nice giyinik kadınlar vardır ki ahirette çıplaktıdar.\" Fethu'l-Bari Açıklaması: Hadiste geçen Haccac, meşhur vali Haccac b. Yusuf es-Sakafl'dir. İnsanların Enes b. Malik'e gelip şikayet etmeleri, onun kendilerine yaptığı zulüm ve haddi aşmadır. ez-ZUbeyr Muvaffakiyat'ta MÜc2ıhid vasıtasıyla Şabl'nin şu sözüne yer verir: \"Hz. Ömer ve ondan sonra gelenler, bir isyankarı yakaladıklcmnda insanların karşısına dikerler, başından sarığını çıkarırlardı. Ziyad iktidara gelince, işlenen suçları kamçıyla vurarak cezalandırmaya başladı. Sonra Mus'ab b. ZUbeyr sakal kesme cezası ilave etti. Bişr b. Mervan vali olunca suç işleyen kimsenin avucuna çivi çaktı. Haccac vali olunca bunların tamamı oyundan ibarettir diyerek suçluyu kılıçla öldürdü. \"Nebiinizden işittim ... \" İbn Battal şöyle der: Bu haber, Nebilik alametlerindendir. Zira Resulullah Sallallahu Aleyhi ve Sellem durumun kötüye gideceğini haber vermiştir. Bu, akıl yürütülerek bilinecek gaybı bir haber değildir. Bu ancak vahiyle bilinir. Bazı zamanların geçmişinden daha az kötü olması dolayısıyla sözkonusu mutlak ifade problemli görülmüştür. Bu konuda hiçbir örnek olmasa Ömer b. Abdulaziz zamanı buna örnektir. Ömer b. Abdulaziz, Haccac'dan kısa bir süre sonra halife olmuştur. Ömer b. Abdülaziz'in zamanındaki iyilik meşhurdur. Onun zamanının, -bir öncesinden daha kötü olması şöyle dursun- bu zamanda kötülük yavaş yavaş silinip yok oldu dense, gerçeğe uzak bir söz söylenmiş olmaz. Hasan-ı Basrl, bir sonraki zamanın bir öncekinden daha kötü olmasını genellikle ve çoğunlukla şeklinde açıklamıştır. Kendisine Haccac' dan sonra Ömer b. Abdulaziz'in gelmesi sorulunca \"İnsanların rahatlaması şarttır\" demiştir. Bazıları \"üstünlük\"ten maksat, bir asrın tamamının, diğer asrın tamamına olan üstünlüğüdür diye cevap vermişlerdir. Çünkü Haccac'ın asrında birçok sahabe hayattaydı. Ömer b. Abdulaziz zamanında ise vefat etmişlerdi. Sahabenin yaşadığı zaman onlardan sonraki zamandan daha hayırlıdır. Çünkü Resulullah Sallallahu Aleyhi ve Sellem \"Asırlann en hayırlısı içinde bulunduğum asırdır\" buyurmuştur.(Müslim, Fedailu's-sahabe) Bu hadis, Buhari ve Müslim' de yer almaktadır. Bu konudaki bir başka hadis şöyledir: \"Sahabilerim ümmetimin güvencesidir. Onlar hayattan çekildiklerinde ümmetimin başına tehdit edilen gelir.\"(Müs!im, Fedailü'sahabe) Bundan sonra Abdullah b. Mesud'un hadisten maksadın ne olduğuna dair açık ifadesine rastladım. Bu, uyulmaya daha elverişlidir. Yakub b. Şeybe'nin elHaris b. Hasıra vasıtasıyla nakline göre Zeyd b. Vehb şöyle demiştir: Abdullah b. Mesud'un şeyle dediğini duydum: \"Kıyamet kopuncaya kadar üzerinize hiçbir gün gelmez ki bir sonrası ondan daha kötü olmasın. Hayatta elde edilen refahı veya istifade edilen malı kastetmiyorum. Fakat üzerinize hiçbir gün gelmeyecektir ki o ilim açısından geçen günden daha geride olmasın. Alimler hayattan çekilince, insanlar birbiriyle eşit hale gelecek, birbirlerine iyiliği emretmeyip, kötülüğü yasaklamayacaklardır. İşte o durumda helak olup gideceklerdir.\" \"Allah bu gece ne hazineler indirdi! Ve ne fitneler indirdi!\" \"Hazineler ve onunla zikredilen şeyler\" den maksadın ne olduğu İlim bölümünde daha önce geçmişti. \"Giyinik ve çıplak kadınlar\" kelimesinden maksadın ne olduğu konusunda ihtilaf edilmiştir. Bir görüşe göre bu kadınlar dünyada zengin olmaları dolayısıyla giyinik, dünyada amel etmemeleri dolayısıyla ahirette sevaptan arı olacaklardır. İkinci bir görüşe göre elbise ile giyiniktirler, fakat elbiseleri şeffaf olup, avret yerlerini örtmeyecektir. Dolayısıyla ahirette bunun karşılığı olarak çıplak kalmakla cezalandırılacaklardır. Bir üçüncü görüşe göre onlar Allah'ın nimetlerinden giyinik, semeresi ahirette sevapla ortaya çıkan şükürden çıplaktırlar. Dördüncü görüşe göre vücutları giyiniktir, fakat başörtülerini arkalarından örttüklerinden göğüsleri ortaya çıkar ve çıplak hale gelirler. Dolayısıyla ahirette bunun cezasını göreceklerdir. Beşinci görüşe göre bunlar salih bir erkekle evlenme elbisesi bakımından giyinik, ancak ahirette amelden çıplaktırlar. Kocalarının salih olması bunlara fayda vermez. Nitekim Yüce Allah bu konuda \"Sura üflendiği zaman artık aralarında akrabalık bağları kalmamıştır\" uyurmaktadır.(Mu'minun 101) Bu son açıklamayı TIbl yapmış ve bu konuya ve hadisin lafzına uygun düştüğü için tercih etmiştir. Hadis her ne kadar Nebi Sallallahu Aleyhi ve Sellem 'in eşleri hakkında varid olmuş ise de itibar sözün genelinedir. Bunun bir benzerini Davudı şöyle nakletmişti: \"Onlar dünyada şerefli kesimden oldukları için şeref elbisesini giyin ik ancak kıyamet günü çıplaktırlar.\" Hadis-i şerif, fitne baş gösterdiğinde onun ortadan kalkması veya dua edenle, dua ettiği kimsenin ondan salim olması için özellikle duaların kabul vakti olduğu umulan gece vakti Yüce Allah'a dua etme ve yakarma çağrısında bulunmaktadır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 20
			}
		}
	]
}