{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7075,
			"arabicnumber": 7075,
			"text": "Ebu Musa'nın nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Herhangi biriniz mescidimizden veya çarşımızdan yanında aklar varken geçecek olursa herhangi bir Müslümana bir zarar vermemek için onları temrenlerinden tutsun -veya- onu avucunun içine alsın.\" Fethu'l-Bari Açıklaması: \"Kim bize silah çekerse ... \" Hadisin manası şudur: Kim haksız yere çarpışmak için Müslümanlara silah çekerse bizden değildir. Çünkü bu onları korkutmak ve kalplerine korku vermek anlamına gelir. Nebi Sallallahu Aleyhi ve Sellem \"silah taşıma\" fiilini kinaye yoluyla çarpışma veya öldürme anlamında kullanmıştır. Çünkü genellikle silah taşımakla adam öldürmek ve çarpışmak birlikte bulunur. \"Fe leyse minna\" yani kim bize silah çekerse bizim yolumuzda değildir veya bizim yolumuza uyan kimse değildir. Çünkü bir Müslümanın diğer Müslüman üzerindeki hakkı, onunla çarpışmak veya katletmek için kendisine silah çekerek yüreğine korku salmak değil, ona yardım etmek ve uğruna çarpışmaktır. \"Bizi aldatan bizden değildir\",(Müs/im, \"İman) \"Yanaklara vurup, ya ka yırtan bizden değildir\"(Müs/im, \"İman) gibi hadisler, bu hadisin benzeridir. Bu, sözkonusu fiilleri helal saymayan kimseler hakkındadır. Çünkü kişi sırf silah taşımak suretiyle değil, şart cümlesinde haram kılınmış olan fiili helal saymak suretiyle kafir olur. Selef bilginlerinin çoğuna göre en uygun olanı -sakındırmada daha etkin olması için- teviline değinmeksizin haberin lafzını mutlak olarak almaktır. Süfyan b. Uyeyne bu haberi zahirindeki manadan çevirene tepki gösteriyor ve \"Hadisin manası bizim yolumuz üzere değildir\" diyordu. O zikrettiğimiz nedenlerden dolayı hadisi tevil etmemeyi daha uygun görüyordu. Hadiste zikredilen tehdit hak üzere olup, bağllerle çarpışanları kapsamamaktadır. Dolayısıyla bu bağılere ve haksız yere savaşmaya başlayanlara yöneliktir. \"Çünkü silahı doğrultan bilmez. Belki şeytan elini dürtüp de (din kardeşini vurur) ve bu sebeple cehennemden bir çukura yuvarlanır.\" Cümlenin anlamı şudur: Belki şeytan biri diğerini silahı ile vursun ve o kişiye darbesini gerçekleştirsin diye onları kışkırtır. \"Bu sebeple cehennemden bir çukura yuvarlanır.\" Bu ifade kişinin cehenneme girmesine yol açacak günaha düşmesinin kinayeli anlatımıdır. İbn Battal şöyle der: İfadenin manası şeytan böylece tehdidi onun üzerinde gerçekleştirir demektir. Hadis sakıncalı bir duruma yol açacak şeyi yasaklamaktadır. Sakınca durumu -ister ciddi olarak, ister şaka şeklinde olsun- kesin olmasa bile hüküm böyledir. \"Kad beda\" Hadiste geçen \"en-nusul\" \"en- nasl\" kelimesinin çoğulu olup, kelime \"nisal\" şeklinde çoğul yapılır. \"Nasıı> okun temreni demektir. \"Bir Müslümana bir zarar vermemek için.\" Bu cümle oku temreninden tutma emrinin gerekçesini teşkil etmektedir. Hadiste geçen \"hadş\" yaranın başlangıç kısmı demektir",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 26
			}
		}
	]
}