{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7086,
			"arabicnumber": 7086,
			"text": "Huzeyfe (radıyallahü anh) şöyle demiştir: Rasûlüllah(sallallahü aleyhi ve sellem) bize iki hâdise haber verdi. Bunlardan birini gördüm, öbürüsünü görmeyi de gözlüyorum. Rasûlüllah bize (emânetin nasıl indiğim şöyle) haber verdi: \"Emânet (yani dîn duyguları, adalet ve emniyet umdeleri ilk önce) sâlih kimselerin gönüllerinin derinliğine iner (fıtrî duygulanırlar). Sonra o kullar, Kur’ân'dan bilgi alırlar, daha sonra sünnetten öğrenirler (kesbî duygulanırlar)\", bize emânetin ref ini (geri kaldırıldığını) de haber verip şöyle buyurdu: \" (Fıtrî ve kesbî duygulanan bilgin) kişi gece uykusunu uyur. O, uyurken emânet, hâfızasından (silinip) alınır da, emânetin eseri (izi, yeri), rengi uçuk bir nokta hâlinde yanık yeri gibi kalır. Sonra o bilgin kişi bir uyku daha uyurken emânetin (geri kalan kısmı da) alınır. Bunun eseri ve yeri de balta sallayan bir işçinin avucundaki kabarcık gibi kalır, (bir zaman sonra o da söner gider). Şu hâlde (o mübarek) emânet, senin ayağına düşürdüğün bir kıvılcımın düştüğü yeri şişirip, senin onu bir kabarcık hâlinde görmen gibidir. Halbuki bu kabarcıkta (vücûdun hayatî uzviyeti üzerinde te'sîr edici) birşey yoktur (bir zaman sonra söner gider). vaziyette halk, birbiriyle alışveriş etmek ve medenî münâsebette bulunmak için (müşkil bir günün) sabahına erişmiş bulunur. Hiç kimse emâneti edâ etmek imkânını bulamaz. Şöyle ki: (Kâh) Fulân oğulları içinde emîn bir kimse vardır (emâneti ona veririm) denilir. birisinin lehine \"O ne akıllıdır, ne tedbirlidir, o ne zerâfetli zâttır, o ne kahramandır\" diye şehâdet olunur. Halbuki hakkında propaganda yapılan şahsın kalbinde hardal tanesi kadar îmân eseri yoktur.\" dedi ki: Bana öyle bir zaman karşı geldi (öyle bir zamanda yaşadım) ki, o meymenetli devirde ben kiminle alışveriş edeceğim diye tasalanmazdım. Çünkü medenî münâsebette bulunacağım kimse müslümânsa onu İslâmı (bana hıyanet etmekten) men' ederdi, Eğer Hrıstiyan (ve Yahûdî) ise onu (bulunduğu yerin) vâlîsi hıyanetten men' ederdi. (Bu suretle o devirde umûmî bir emniyet vardı). Bugün ise ben Fulân ve Fulân'dan başka kimse ile alışveriş edemez oldum",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 37
			}
		}
	]
}