{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7088,
			"arabicnumber": 7088,
			"text": "Ebu Said el-Hudrl'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem \"Bir Müslümanın en hayırlı malının koyunları olacağı günler yakındır. Müslüman dini uğruna fitnelerden kaçarak kah dağların başlarını, kah vadilerin yağmur düşen yerlerini (otlak olarak) seçecektir\" diye haber vermiştir. Fethu'l-Bari Açıklaması: \"Fitne zamanında bedevilerle birlikte oturmak.\" Bunun anlamı, muhacirin hicret ettiği beldeden çıkarak bedevilerle birlikte oturması ve hicretinden sonra bedevi haline dönmesidir. O sıralarda Nebi s.a.v.'in izin verdikleri hariç bu şekilde davranmak haramdı. İmam Buharl'nin bu hareketi \"Fitne zamanı\" şeklinde kayıtlaması o zamanki iznin fjtnenin baş gösterme zamanı verildiğine işaret etmektedir. Bazıları fitne zamanı böyle bir şeye izin verilmemesi hak üzere olan kimselere destek vermeme sonucunu doğurur demişlerdir. Fakat selef bilginlerinin bu konudaki yaklaşımları değişik olmuştur. Bazıları Sa'd, Muhammed b. Mesleme, İbn Ömer gibi fitneden selamette olmayı ve bir kenara çekilmeyi tercih etmişlerdir. Bazıları ise -ki bunlar çoğunluktur- çarpışmayı üstün tutmuşlardır. \"Seleme b. el-Ekva, Haccac'ın huzuruna girdiğinde ... \" Bu haberde adı geçen Haccac meşhur emir Haccac b. Yusuf es-Sakafi'dir. Bu olay hicretin 74. yılı İbn ZUbeyr'in katlinden sonra Haccac'ın Hicaz emiri olup, Mekke'den Medine'ye geçtiğinde olmuştu. \"Topukların üzerine dininden geri döndün.\" Haccac bu ifadesiyle Hudo.d bölümünde büyük günahlar işlenirken geçtiği üzere bu konuda yer alan hadisteki ifadeye işaret etmektedir. Çünkü \"Kim hicretinden sonra bedevi olarak dönerse\" bu konuda zikredilenlerden birisiydi. Bu haberi Nesai, İbn Mesud' dan şu şekilde rivayet etmiştir: \"Allah faiz yiyene ve yedirene lanet etsin. \"(Nesai, Zinet) Bu hadiste \"Hicretinden sonra bedevi olarak dönene\" ifadesi de yer almaktadır. İbnü'l-Esir en-Nihaye'de şöyle der: Hicretten sonra herhangi bir mazereti olmaksızın bulunduğu yere geri döneni mürted gibi kabul ediyorlardı. Bir başkası şöyle demiştir: Bu Haccac'ın insanlara cefasından kaynaklanıyordu. Zira o, bu büyük sahabiye daha mazeretini anlayıp dinlemeden o çirkin sözle hitap edebilmişti. Rivayete göre Haccac, Seleme'yi öldürmek istemiş ve kendisini katledilmeye layık kılmak istediği gerekçeyi açıklamak istemjştir. \"Seleme hayır dedi.\" Yani Seleme ben hicretten dönmek için çölde yerIeşmedim dedi. \"Resulullah Sallallahu Aleyhi ve Sellem bana çölde oturma izni verdi.\" Hammad b. Mes'ade'nin, Yezid b. Ebi Ubeyd'den nakline göre Seleme Resulullah Sallallahu Aleyhi ve Sellem'den çölde oturma izni istemiş, Resulullah Sallallahu Aleyhi ve Sellem de ona bu izni vermiştir. Haberi el-İsmail! nakletmiştir. Seleme'nin bu konuda Haccac'dan başkasıyla yaşadığı bir olay daha vardır. Bunu Ahmed b. Hanbel şu şekilde nakleder: Seleme, Medine'ye geldiğinde Büreyde b. el-Hasib ile karşılaşır. Büreyde \"Hicretinden irtidad ettin\" deyince, Seleme \"Allah korusun! Ben Resulullah Sallallahu Aleyhi ve Sellem' den aldığım izne dayanarak orada oturuyarum. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Ey Eslem kabilesi! Çölde oturunuz'\" -Eslem, Seleme, Ebu. Berze ve Büreyde'nin mensup olduğu meşhur kabilenin adıdır.- Onlar: .\"Bunun hicretimizi zedeleyeceğinden korkuyoruz\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"Sizler nerde bulunursanız bulunun muhacirsiniz\" buyurmuştur.(Ahmed b. Hanbel, LV, 55) Bu haberin Amr b. Abdurrahman b. Cürhed'den nakledilen şahidi bulunmaktadır. Abdurrahman şöyle demiştir: Ben birisinin Cabir' e şu soruyu sorduğunu gördüm: \"Resulullah Sallallahu Aleyhi ve Sellem'in sahabilerinden kimler kaldı?\" O kişi \"Enes b. Malik ve Seleme b. el-Ekva\" cevabını verdi. Adam \"Seleme hicretinden irtidad etti\" deyince, Cabir \"Böyle söyleme. Çünkü ben Resulullah Sallallahu Aleyhi ve Sellem ile Eslem oğulları arasında şöyle bir konuşmaya şahit oldum\" dedi. Resulullah Sallallahu Aleyhi ve Sellem, Eslem oğullarına \"Çölde oturun\" deyince, Eslem oğulları \"Biz hicretten sonra bundan dönmüş olmaktan korkuyoruz\" dediler. Resulullah Sallallahu Aleyhi ve Sellem \"Sizler nerede bulunursanız bulunun muhacirsiniz\" buyurdu. Bu iki haberin isnadı hasendir. \"Osman b. Affan katledilince, Seleme Rebze'ye çıktı.\" Rebze, Mekke ile Medine arasında çölde bir yerin adıdır. Bu haberden Seleme'nin çölde yaklaşık kırk yıl kaldığı anlaşılmaktadır. Çünkü Hz. Osman hicri 35 yılının zilhiccesinde öldürüldü. Seleme'nin ölümü ise sahih olan rivayete göre hicri 74'tür. \"Dini uğruna fitnelerden kaçarak. .. \" Bu haber dininden endişe duyan kimsenin uzlete çekilmesinin faziletli olduğunu göstermektedir. Selef bilginleri uzlete çekilmenin aslı konusunda ihtilaf etmişlerdir. Çoğunluk şöyle demiştir: Fitne zamanlarında insanların içine karışmak, İslam'ın sembol ibadetlerini yapmak, İslam toplumunun sayısını çoğaltniak, onlara yardım etmek, imdatlarına koşmak, hasta olduklarında ziyaret etmek ve benzeri şekillerde çeşitli iyiliklerde bulunmak dolayısıyla dini faideler kazanma olduğu için daha evladır. Bir başka grup bilgin ise şöyle demişlerdir: Uzlete çekilmek, yapılması gerekeni bilmek şartıyla fitneden selamette kalmak olduğu için daha evladır. Nevevi'nin görüşü şöyledir: Tercihe şayan olanı, günaha düşmeyeceğine dair kuwetli zan besleyen kimse için insanlarla birlikte yaşamaktır. Eğer bir sıkıntı doğacaksa o zaman uzlete çekilmek daha evladır. Bir başkası şöyle demiştir: Bu, kişiden kişiye değişir. Bazıları için iki seçenekten sadece birini yapması gerekirken, bazıları için tercih ve ağır basma sözkonusuur. Bizim sözkonusu ettiğimiz bu değildir. Aksine uzlete çekilmekle insanlarla bir arada yaşamak birbirine eşit olduğunda ne yapılacaktır? Bu, durumdan duruma değişir. İki durum birbiri ile çeliştiğinde zamandan zamana değişir. Bazıları için insanlarla birlikte yaşamak tek seçenektir. Bunlar gördükleri münkeri ortadan kaldırma gücü olanlardır. Bu gibi kimseler için insanlarla birlikte yaşamak duruma ve imkana göre ya farz-ı ayndır ya da kifayedir. Emr-i bi'l-maruf ve nehy-i ani'l-münker yaptığında canını kurtaracağına kuwetli zannı olan kimseler için de insanlarla birlikte yaşaması tercih edilir. Kendi canı açısından emin olduğu halde kendisine itaat edilemeyeceği kesinse bu gibi kimseler için uzlete çekilmekle insanlarla birlikte yaşamak eşittir. Bu, ortada yaygın bir fitne olmadığında sözkonusudur. Şayet yaygın bir fitne varsa genellikle sakıncalı bir duruma düşme sözkonusu olacağı için uzlete çekilJıek daha ağır basar",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 39
			}
		}
	]
}