{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7098,
			"arabicnumber": 7098,
			"text": "Ebu Vail şöyle anlatmıştır: Üsame'ye \"Şununla konuşsan!\" denildi. Üsame cevaben şöyle dedi: \"Şüphesiz ben onunla konuştum. Ancak ilk açanı ben olarak (fitne) kapısını açmadan! Ben Resulullah Sallallahu Aleyhi ve Sellem'den işittiğim bir sözden sonra insanlardan iki kişi üzerine emir olan bir şahsa \"Sen hayırlısın\" diyecek değilim. Zira Resulullah Sallallahu Aleyhi ve Sellem şöyle buyuruyordu: \"Kıyamet günü bir adam getirilir ve cehenneme atılır da cehennem, eşeğin değirmen taşın döndürerek öğütmesi gibi onu öğütür. Bunun üzerine cehennem halkı da onun başına toplanırlar 'Ey filan! Sen marufu emredip, münkeri yasaklıyar değil miydin?' derler. O da 'Evet, ben marufu emreder ancak kendim yapmazdım ve yine ben münkeri yasaklar, onu da kendim işlerdim\" der. Fethu'l-Bari Açıklaması: AÇIKLAMA’DAN SONRA DA BİR BAB VE HADİSLER VAR \"Denizin dalgalanması gibi dalgalanacak olan fitne.\" İmam Buhari bu başlıkla İbn Ebi Şeybe'nin naklettiği şu hadise işaret eder gibidir: \"Yüce Allah bu ümmete beş fitne vermiştir. \"(İbn Ebi Şeybe, Musannef, VII, 453) Resulullah Sallallahu Aleyhi ve Sellem dört fitneyi zikrettikten sonra beşincisini şöyle anlatmıştır: \"Denizin dalgalanması gibi dalgalanacak olan fitne. Bu fitne esnasında insanlar hayvanlar gibi yani akılsız olacaklardır.\" Bunu Ebu Musa'nın \"O zamanın çoğunluğunun aklı gidecektir\" şeklindeki rivayet ettiği hadis teyid etmektedir. İbn Ebi Şeybe'nin bir başka rivayet yoluyla nakline göre Huzeyfe şöyle demiştir: \"Dinini bildiğin sürece fitne sana zarar vermeyecektir. Asıl fitne hak ile batılı karıştırdığında (zararlı olacaktır}.\"(İbn Ebi Şeybe, Musannef, VII, 468) \"Onlar fitne anında\" yani fitne başgösterdiğinde \"şu beyit1eri örnek edinmeyi severlerdi.\" \"Genç bir dilberdir savaş, ilk baş gösterdiğinde.\" Yani savaş genç kız gibi olur. Bir başka ifade ile savaş ilk çıktığında onu denemeyen kimse uzak durur ve sonra içine girer. Böylece savaş onu yok eder. \"O tutuştuğunda\" Bu ifade savaşın kızışmasının kinayeli anlatımıdır. \"Kocakarı\" Bunun manası savaşın kendisiyle evlenmeyi hiç kimsenin istemediği bir hale geldiğini vurgulamaktır. \"Şamta\" Bu şiirde sözü edilen koca karıyı niteleyen bir kelimedir. Davudl'ye göre bu kadının saçlarının çok çok ağardığının kinayeli anlatımıdır. \"Huzeyfe şöyle demiştir: Ömer'in yanında oturuyorduk.\" Bu hadisin açıklaması Nebilik alametleri bölümünde geniş bir şekilde yapılmıştı. \"Yarından önce bu gece olduğunu bildiği gibi biliyordu.\" Yani onun bilgisi tıpkı yarından önce bugünün olduğu gibi zorunlu bir bilgiydi. İbn Battal şöyle demiştir: Huzeyfe'nin Ömer kendisine en büyük fitneyi sorduğunda özel fitneyi haber vermesinin sebebi, kederlenip, kafasını meşgul etmemesi içindir. Bundan dolayı ona şöyle demiştir: \"Seninle onun arasında kapalı bir kapı vardır. Huzeyfe kapının o olduğunu bildiği halde kendisine \"Kapı sensin\" demedi ve anlayacağı şekilde üstü kapalı olarak ifade edip, açıkça belirtmedi. Bu onun güzel edebindendi. Hz. Ömer \"Kapı kırılırsa bir daha kapanmaz\" sonucunu kırma işleminin ancak galebe çalmakla olmasından çıkarmıştır. Galebe çalmak, ancak fitnede olur. Nebi Sallallahu Aleyhi ve Sellem'in haberinden ümmetin kendi arasında savaşacağı ve kıyamete kadar öldürmenin sürüp gideceği anlaşılmaktadır. Nitekim Şeddad'ın naklettiği bir hadiste buna benzer bir ifade yer almaktadır: \"Ümmetimin içine kılıç (bir defa) girdi mi kıyamete kadar kaldlnlmayacaktır.\" Bu hadisi Taberi rivayet etmiş, İbn Hibban sahih olduğunu belirtmiştir.(İbn Hibban, Sahih, XVI, 220) \"Nebi s.a.v. bir gün bir ihtiyacını gidermek için Medine bahçelerinden birine çıktı.\" Bu hadisin açıklaması Ebu Bekir'in menkıbeleri bölümünde geçmişti. \"Kuffu'l-bi'ri\" tamlaması, kuyunun etrafında oturmak için yapılan yer anlamına gelir. Nebi Sallallahu Aleyhi ve Sellem'in Osman hakkında \"Kendisine isabet edecek beJa\" ifadesine gelecek olursak, İbn Battal şu açıklamayı yapmıştır: Hz. Ömer de öldürüldüğü halde Nebi Sallallahu Aleyhi ve Sellem'in belayı Osman için zikretmesi, Ömer'in onun gibi bir imtihan geçirmemiş olmasından kaynaklanmaktadır. Çünkü halifelikten çekilmesini isteyen bazı insanlar ona musallat olmuşlardı. Zira kendisinin hiç alakası yokken ve ona karşı ileri sürdükleri şeylerden mazur iken zalim ve haksız olarak nitelenmişti. Sonra evine saldırmışlar, aile mahremiyetine dokunmuşlardı. Bütün bunlar öldürülmesine ilaveten fazladan uğradığı haksızlıklardı. Biz de şunu ekleyelim: Kısacası Hz. Osman'a mahsus olan beladan maksat öldürülmesine ilaveten gördüğü birtakım sıkıntılardır. Nitekim aynen böyle olmuştur. \"Üsame'ye şununla konuşsan denildi.\" Burada hem söyleyen ve hem de kendisiyle konuşulması istenen kişi müphem bırakılmıştır. Müslim'in rivayetinde kendisiyle konuşulması istenen kişinin adı şöyle geçmektedir: \"Ona Osman'ın huzuruna girip kendisiyle konuşsan denildi. \"(Müs!im, Zühd) \"Şüphesiz ben onunla konuştum. Ancak ilk açanı ben olarak (fitne) kapısını açmadan!\" Yani işaret ettiğiniz konuda onunla konuştum. Fakat sözümde fitne ve benzeri şeyleri uyandırmaksızın gizlice maslahatı gözetip, edebe uyarak konuştum. \"Eşeğin, değirmen taşlarıyla öğütmesi gibi onu öğütür.\" Süfyan ve Ebu Muaviye rivayetinde \"Bağırsakları dışarıya fırlayacak ve eşeğin döndüğü gibi dönecek\" ifadesi geçmişti. Burada yer alan \"aktab\", \"kıtb\" kelimesinin çoğulu olup, bağırsaklar demektir. \"İndilak\" bağırsakların hızla dışarıya dökülmesi demektir. Arapça'da kılıç herhangi bir kimse tarafından çekilmeksizin kınından çıkarsa bunu \"indeleka's-seyfu min ğımdihi''' cümlesiyle ifade ederler. \"Cehennem halkı onun başına toplanırlar.\" Yani etrafında toplanırlar. \"EtMe bihi'l-kavmu\" bir topluluk onun etrafında dönmeseler bile halka oldular demektir. \"Ben marufu emreder ancak kendim yapmazdım ve yine ben münkeri yasaklar, onu da kendim işlerdim.\" Kadı Iyaz şöyle demiştir: Üsame'nin demek istediği halifeye açıktan tepki koyma kapısını açmak istemediğidir. Çünkü o bunun kötü akıbetinden endişe duyuyordu. Tam tersine ona kibar davranıp, gizlice nasihat etmiştir. Bu, kabul edilmeye daha layık bir tavırdır. \"Üzerime emir olan bir kişi hakkında o insanların hayırlısıdır diyecek değilim.\" Bu ifade de -aslı esası olmayan bir şeyle kuyruk sallayan kimse gibi- hak sözkonusu olduğunda, emirlere yağcılık yapıp, içinden geçenin aksini dışa vurmayı kınama vardır. Üsame güzel görülen mudarat ile kınanmış olan yağcılığa işaret etmektedir. Mudaratın ölçüsü bunu yaparken dine herhangi bir zararın gelmemesidir. Kınanmış yağcılığın ölçüsü ise bunda çirkin olan bir şeyi süsleme, batılı doğru gösterme ve benzeri tavırlar sözkonusudur. Taberi' şöyle demiştir: Selef bilginleri iyiliği emretme konusunda ihtilaf etmişlerdir. Bazı bilginler iyiliği emretmek mutlak olarak vaciptir demişler ve buna delil olarak Tarık b. Şihab'ın naklettiği \"Cihadın en üstünü zalim sultanın huzurunda gerçeği söylemektir\" hadisi ile \"Herhangi biriniz bir kötülüğü görürse bunu eliyle değiştirsin\" hadisinin genelliğini göstermişlerdir. Bazıları ise münkere tepki koymak gereklidir, fakat şartı tepki koyan kimseye öldürülme k ve benzeri gibi daha önce sözkonusu olmayan bir belanın gelmemesidir demişlerdir. Bir başka bilgin grubu ise kişi münkere Ümmü Seleme hadisi dolayısıyla kalpten tepki koyar demişler ve delilolarak onun rivayet ettiği \"Benden sonra başınıza birtakım idareciler gelecek. Onların yaptıklarını kim çirkin görürse sorumluluğundan kurtulur, kim tepki gösterirse selamet bulur. Fakat sorumluluk (yaptıklarına) razı olup, ardından gidenedir\" hadisini delilolarak göstermişlerdir. Bir başkası ise şöyle demiştir: İyiliği emretmek buna gücü yeten ve kendi nefsi için herhangi bir zarar geleceği endişesi duymayan kimseye vaciptiı;. İsterse bunu emreden kimse günah işliyor olsun. Çünkü genelolarak iyiliği emretmek sevap kazandırır. Özellikle emreden kişi, itaat edilen bir şahıs ise. O kişinin özel günahına gelince, Yüce Allah onu bağışlayabilir de, hesaba çekebilir de! \"İyiliği kendisinde hiçbir ayıp ve kusur olmayan kimse ancak emreder\" diyen kimse bununla daha iyiyi kastediyorsa ne ala! Aksi takdirde kendisinden başka bunu yapan bulunmadığı takdirde böyle bir anlayış iyiliği emretme kapısının kapanmasını gerektirir. Taberi şöyle devam eder: \"Yukarıda zikredilen Üsame hadisinde iyilik yapmaları emredilen kimseler nasıloluyor da cehenneme gidiyorlar?\" diye sorulacak olursa cevabımız şudur: Onlar kendilerine emredilene sarılmadılar ve günahlarından dolayı azaba uğradılar. Kendilerine iyiliği emreden kişi ise onlara yasak ettiği şeyi kendisi yaptığı için cehenneme gitti. Bu hadisten emirlere saygı göstermek, onlara edep dairesi içinde davranmak ve insanların haklarında konuştuklarını kendilerine bildirmek gerektiği anlaşılmaktadır. Bundan maksat kötülükten vazgeçmeleri, başkasına eziyet etmeksizin amaca ulaşacak şekilde kibarlıkla ve güzel bir üslupla tedbir almalarıdır. 18. BAB",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 49
			}
		}
	]
}