{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "Enes İbn Malik (r.a.) Resûlullah Sallallahu Aleyhi ve Sellem'in şöyle buyurduğunu nakletmiştir: \"Bazen namaza başlarken uzun uzun kılmak istiyorum. Fakat bir çocuk ağlamasını duyunca kısa tutuyorum. Çünkü annenin çocuğun ağlaması dolayısıyla içinde hissettiği acıma duygusunu çok iyi biliyorum.\" Bu Hadislerden Çıkarılan Sonuçlar 1. Çocukların mescide getirilmesinde herhangi bir sakınca yoktur. Ancak bu hüküm hemen kabul edilebilecek gibi değildir. Çünkü çocuk ağladığında sesi duyulabilecek kadar mescide yakın bir evde bırakılmış olabilir. 2. Kadınlar erkeklerle birlikte cemaat olup namaz kılabilir. 3. Resûlullah ashabına ve ümmetine karşı çok şefkatli ve merhametli idi. 4. Namaz kıldırırken hem yaşlılar hem de çocuklar dikkate alınmalıdır. Resûlullah'ın uzun uzun kılmak istiyorum\" diye niyetlen­diği halde çocukları ve annelerini düşünerek bundan vazgeçmesi, müstehap olan bir iş yapmak üzere niyet edildikten sonra bundan vazgeçilebileceğini, söz konusu niyetin yerine getirilmesinin vacib olmadığını gösterir. Resûlullah (s.a.v.)'in namazı annenin hissettiği acıma duygusu dolayısıyla kısalttığını göz önünde bulunduran bazı âlimler: \"İmam birisinin ce­maate katılmak üzere mescide girdiğini hissederse rükûyu uzatabilir\" demişlerdir. Fakat Ibnü'l-Müneyyir bu görüşle ilgili olarak şu değerlendirmeyi yapmıştır: \"Namazı uzatmak ile kısa tutmak birbirinden tamamen farklı iki durumdur. Do­layısıyla namazın kısaltılmasını uzatmaya kıyas etmek doğru olmaz. Ayrıca bu hüküm Resulullah (s.a.v.)'in gözettiği maksada da aykırıdır. Çünkü Resûlullah hafifletme yoluna gittiği halde bu hüküm sırf bir kişi için bütün bir cemaatin bekletilmesine ve sıkıntıya sokulmasına sebep olmakta­dır.\" Fakat gelen kişinin namaza yetişebilmesi için rükûnun uzatılabileceği ile ilgili hüküm cemaate sıkıntı vermeyen durumlar için geçerli olabilir. Nitekim Ahmed Ibn Hanbel, İshâk İbn Râhûye ve Ebû Sevr gibi âlimler bir kimsenin cemaate yetişebilmesi için rükûnun uzatılabilmesini cemaate sıkıntı vermemesi kaydıyla kabul etmişlerdir. İbn Battal ve ondan daha önce Hattâbî bu görüşle ilgili olarak şu açıklamayı yapmışlardır: \"Dünyevî bir ihtiyacın giderilmesi İçin namazın kısal­tılması caiz olduğuna göre, dînî bir ihtiyacın giderilebilmesi için namazı uzatmak haydi haydi caiz olmalıdır.\" Kurtubî, İbn Battal ve Hattâbî tarafından yapılan bu değerlendirme hakkında şunları söylemiştir: \"Namazın uzatılması durumunda namaza matlûb olmayan bir eklemede bulunulmuş olur. Halbuki namazı kısalt­mak böyle değildir (çünkü kısaltma durumunda herhangi bir çıkarma olmaz), hatta daha güzel ve daha geçerlidir.\" Konuyla ilgili olarak Şafiî mezhebine mensup âlimler arasında da görüş ay­rılıkları bulunmaktadır. İmam Nevevî Şafiî mezhebinin görüşünü \"Mutlak olarak bu durumda namazı uzatmak müstehaptır\" şeklinde nakletmiştir. Fakat Mehâmilî'nin et-Tecrid adlı eserinde bunun mekruh olduğu zikredilmektedir. Evzâi, İmam Mâlik, Ebu Hanife ve Ebû Yûsuf'un görüşleri de mekruh olduğu yönün­dedir. Hatta İmam Muhammed: \"Bu uzatmanın şirk olmasından korkarım\" de­miştir",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 105
			}
		}
	]
}