{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7114,
			"arabicnumber": 7114,
			"text": "Huzeyfe şöyle demiştir: Münafıklık Nebi s.a.v. zamanında idi. Bugün ise nifak, imandan sonra küfürdür. Fethu'l-Bari Açıklaması: \"Bir kavmin yanında bir şey söyleyip sonra oradan çıkınca söylediğinin aksini söyleme.\" İmam Buhari bu konuda İbn Ömer'in rivayet ettiği \"Verdiği sözde durmayıp cayan her bir kişi için kıyamet gününde bir bayrak dikilir\" hadisine yer vermiştir. Bu konuda İbn Ömer'in Yezid b. Muaviye'ye bey'atle ilgili olarak yaşadığı bir olay vardır. İmam Buhari yine dünyalık elde etmek için iktidar uğruna çarpışan kimselere tepkisini konu alan Ebu Berze hadisine yer vermekte, ardından Huzeyfe'nin münafıklarla ilgili ifadesini zikretmektedir. Son ifadenin atılan başlığa olan uygunluğu gayet açıktır. Birinci rivayetin başlıkla uygunluğu ise arkadan konuşmanın, yüzüne konuşmaktan başka olmasının bir çeşit verilen sözden dönme olmasındandır. Ahkam bölümünde \"Bir kimsenin Sultanı Yüzüne Karşı Överken Dışarı Çıktığında Bunun Aksini Konuşmasının Çirkinliği\" şeklinde bir başlık gelecektir. İmam Buhari orada İbn Ömer'in emirlerin huzurunda oradan çıkınca söylenenlerin aksini söyleyen kimselerin durumunun ne olacağı şeklindeki soruya \"İbn Ömer \"Biz bu hareketi (Nebi zamanında) münafıklık sayıyorduk\" şeklindeki sözüne yer vermiştir. \"Medine ahalisi Yezid b. Muaviye'ye bey'at etmekten caydıkları zaman.\" elİsmallı'de şu ifade yer almaktadır: Muaviye İbn Ömer'in Yezid'e bey'at etmesini isteyince, İbn Ömer bunu kabul etmedi ve \"Her iki emire de bey'at etmiyorum\" dedi. Bunun üzerine Muaviye ona yüz bin dirhem para gönderdi. İbn Ömer paraları aldı. Akabinde de bir kişiyi göndererek \"Biat etmene man i olan nedir?\" diye sordurdu. İbn Ömer \"Bu, bunun içindir -yani bu paranın bağışlanması bey'atin gerçekleşmesi içindir.- Benim dinim o takdirde nazarımda çok ucuz olmuş olur\" dedi. Muaviye ölünce İbn Ömer, Yezid'e bey'atini bildirmek üzere mektup yazdı. \"Medine ahalisi Yezid b. Muaviye'ye bey'at etmekten caydıkları zaman.\" Hadisin kalan kısmı yukarıda zikredildiği gibidir. Biz şunu ekleyelim: Bunun sebebi Taberl'nin Yezid b. Muaviye'ye isnat ederek zikrettiği şu olaydır: Yezid, Medine'ye amcasının oğlu Osman b. Muhammed b. Ebu Süfyan'ı vali tayin etmişti. Vali Osman, aralarında melekler tarafından yıkanan Hanzala b. Ebu Amir'in oğlu Abdullah b. Hanzala, Abdullah b. Ebu Amr b. Hafs el-Mahzumı olmak üzere Medine halkından bir grubu Yezid' e gönderdi. Yezid onlara ikram etti ve birtakım hediyeler verdi. Heyet geri dönünce Yezid'in ayıp ve kusurlannı sayıp dökmeye başladı. Onun içki içtiğini söyleyip daha başka iddialarda bulundular. Sonra Osman'ın üzerine çullanıp, onu valilikten azlettiler. Yezid b. Muaviye'ye bey'at etmekten vazgeçtiler. Bu olay Yezid'in kulağına gidince, onlara karşı Müslim b. Ukbe el-Mürrı'nin kumandasında bir ordu hazırladı. Ona Medine halkına üç gün çağrıda bulunmasını emretti. \"Eğer bu görüşlerinden dönerlerse ne ala! Dönmezlerse onlarla çarpış. Medine'ye galip geldiğinde üç gün süreyle orduya izin ver, sonra saldırıdan vazgeç\" diye emretti. Ordu kumandanı Medinelilerin üzerine yürüdü. Hicrı30 yılının zilhicce ayında oraya ulaştı ve Medine ahalisiyle çarpıştı. Ensarın emiri Abdullah b. Hanzala idi. Kureyş'in başında Abdullah b. Mutl', diğer kabileierin başında ise Mukbil b. Yesar el-Eşcaıbulunuyordu. Bunlar bir hendek kazdılar. Savaş başlayınca Medine ahalisi yenildi. İbn Hanzala öldürüldü. İbn Mutl' kaçtı. Müslim b. Ukbe, Medinede üç gün süreyle orduya izin verdi. Aralarında Ma'ki! b. Sinan, Muhammed b. Ebu'l-Cehm b. Huzeyfe, Yezid b. Abdullah b. Zem'a bulunmak üzere bir grup çembere alınarak kat/edildi. Kalanlarıyla Yezid'e bağlanmaları şartıyla anlaşma yaptı. \"Haşemehu\" İbnu't-Tın, bu kelimenin burada hizmetçileri ve maiyeti anlamına olduğunu söylemiştir. Hadisten Çıkan Sonuçlar 1- Bey'at almış olan yöneticiye itaat vaciptir, idaresinde zalim bile olsa ona isyan edilemez ve böyle bir idareci, fasıklık yapmakla görevinden çekilmiş sayılmaz. \"Şu sizlerin aranızda bulunan kimseler.\" Yezid b. Zurey' ve İbnü'l-Mübarek'in rivayetine göre Ebu Berze \"Şu etrafınızda bulunan ve kurranız olduğunu iddia ettiğiniz kimseler\" demiştir. Sikkın'in rivayetine göre Nafi b. el-Ezrak'tan da söz etmiş ve son kısmında şöyle demiştir: \"Babam 'o halde bana ne emredersin?' dedi. Ben senin hiç kimseyi terk ettiğini görmüyorum. O da şöyle dedi: Bugün ancak karınıarı insanların malından boş, sırtları kanlarından hafif olan topluluğu hayırlı görüyorum\" demiştir. Sikkın'in rivayetine göre \"İnsanların içinde bana en sevimli olanı kursakları insanların mallarından boş, sırtları kanlarından hafif olan şu topluluktur demiştir.\" Bu ifade Ebu Berze'nin fitne zamanı bir köşeye çekilmek gerektiği ve Müslümanlarla savaşla ilgili olarak hiçbir şeye katılmamak, -özellikle bu savaş bir iktidar talebi uğruna ise- tarafsız kalmak gerektiği şeklinde idi. 2- Fitne baş gösterdiğinde alimlerle ve dini yaşayan kimselerle danışmalarda bulunmak gerekir. Bir alim de görüşüne başvuran kimseye gerekli nasihatı vermekle yükümlüdür. 3- Bir münkeri işleyene arkasından bile olsa sözlü tepki göstermekle yetinmek mümkündür. Çünkü bu tepkiyi duyan kimse bundan öğüt alır ve o münkere düşmekten kaçınır",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 61
			}
		}
	]
}