{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7115,
			"arabicnumber": 7115,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem 'Hayattaki bir kişi kabirdeki bir adam'ın yanından geçerken 'Keşke şu ölünün yerinde ben olaydım' diye ölümü temenni etmedikçe kıyamet kopmaz' buyurmuştur. Fethu'l-Bari Açıklaması: \"Kabirlerde olanlar (diriler tarafından) gıpta edilmedikçe kıyametin kapmayacağı.\" Hadiste yer alan \"gıpta\", gıpta edilen kimse aynı durumda kalmak şartıyla onun gibi olmayı temenni etmek demektir. \"Hayattaki bir kişi kabirdeki bir adamın yanından geçerken 'Keşke şu ölünün yerinde ben olaydım' diyecektir.\" Yani keşke ben de ölü olaydım diyecektir. , İbn Battal şöyle demiştir: Fitne zamanlarında kabirde bulunanlara gıpta edip, ölmeyi temenni etmek batılın galebe çalmasından dolayı dinin elden gideceği korkusu, masiyetterin ve münkerin ortaya çıkması nedeniyledir. Bu, herkes için genel bir durum değildir. Bu sadece hayır ehli kimselere mahsustur. Onların dışındakiler, canlarına veya ailelerine ya da dünyalıklarına gelecek bir musibetten dolayı -dinleriyle ilgili bu konuda hiçbir şeyolmasa bile- bunu temenni ederler. Bu anlayışı Müslim'in Ebu H1zim rivayetiyle Ebu Hureyre' den naklettiği şu hadis teyit etmektedir: \"Dünya hayatı, bir kimsenin birisinin kabrine gidip, toprağına bulanarak 'Keşke şu kabirde yatanın yerinde ben olsaydım' demedikçe ve din, onun açısından beladan başka bir anlam ifade etmedikçe sona ermeyecektir.\"(Müslim, fiten) Hadiste \"recul=erkek\" kelimesinin kullanılması, genellikle kabristana erkeklerin gitmesinden dolayıdır. Aksi takdirde kadın açısından da aynı şeyleri tasawur etmek mümkündür. Bundan sonra Kurtub! şöyle demiştir: Bu hadis, ileride fitne ve ağır meşakkati n baş göstereceğine, bundan dolayı dinin hafife alınacağına ve dini meselelere özen göstermenin azalacağına, kimsenin dünyası, geçimi ve bununla ilgili şeylerden başka bir derdinin olmayacağına işaret etmektedir. Bundan dolayı fitne zamanlarındaibadetin değeri daha da büyük olmuştur. Nitekim Müslim'in Makil b. Yesar' dan naklettiği bir hadiste Resulullah Sallallahu Aleyhi ve Sellem \"Fitne zamanlarında ibadet bana hicret gibidir\" buyurmuştur. (Müslim, fiten)",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 62
			}
		}
	]
}