{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"92": "Afflictions and the End of the World"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7134,
			"arabicnumber": 7134,
			"text": "Enes b. Malik'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Medine'ye Deccal gelecek ve birçok meleklerin onu korumakta olduklarını görecektir. Artık oraya Deccal ve veba hastalığı inşallah yaklaşamayacaktır.\" Fethu'l-Bari Açıklaması: \"O adamı öldürür, sonra diri/tir.\" Hattflbl'ye göre burada şöyle bir soru gündeme gelebilir: \"Yüce Allah'ın bir kflfirin elinde mucize yaratması nasıl mümkün olur? Zira ölüleri diriltmek, Nebilerin gösterdiği büyük mucizelerden biridir. Deccal yalancı, iftiracı ve ilahlık iddia ettiği halde nasılolur da böyle bir mucizeye ulaşabilir?\" Bu soruya cevabımız şudur: Söz konusu mucize ona kullara karşı bir fitne kabilinden verilmiştir. Çünkü insanların nezdinde Deccal'in davasında haklı değil, haksız olduğunu gösteren deliller vardır. Bunlardan birisi onun şaşı gözlü olduğu, alnında kafir yazdığı ve bunu Müslümanın okuduğudur. Dolayısıyla onun iddiası, küfür damgası yemiş olması, organındaki eksiklik ve değersiz olmasıyla kendiliğinden çürümektedir. Zira o ilah olsaydı, bu damgayı alnından silerdi. Nebilerin mucizeleri, benzeri getirilebilecek şeyler değildir. Dolayısıyla bu ikisi birbirine benzemez. Mühelleb şöyle demiştir: Deccal'e sözü edilen maktulü canlandırma gücü verilmesi, \"O Allah katından bundan daha hakirdir\" şeklinde,ki daha önce geçen ifade ile çelişmez. Zira bu sözün anlamı, \"o Allah katında kendisine sahih bir biçimde mucize gösterme gücü verilmeyecek kadar hakirdir\" demektir. Zira onun bir kimseyi öldürüp, sonra diriltme gücü ne kendisinde, ne de bir başkasında devam etmemiştir. Sonra maktul de bundan sevap elde etmekle birlikte öldürülürken çektiği acı anı hariç herhangi bir zarar görmemiştir. O kişi Yüce Allah'ın bu acıyı kendisinden savuşturmaya olan kudreti sayesinde belki de ölüm acısını hiç duymamış olabilir. İbnü'l-Arabı şöyle der: Deccal'in elinde görülen yağmur yağdırma, kendisine inanana bolluk sağlama, kendisini yalanlayana kıtlık verme, yeryüzünün hazinelerinin onu takip etmesi, beraberindeki cennet ve cehennem, akan sular şeklinde elinde gözüken mucizelerin tümü Allah tarafından bir imtihan ve denemeden ibarettir. Yüce Allah bununla şüpheye düşenleri helak eder, imanı kesin olanları kurtarır. Bütün bunlar korkunç şeylerdir. Bundan dolayı Nebi Sallallahu Aleyhi ve Sellem \"Deccal'in fitnesinden daha büyük bir fitne yoktur\" buyurmuştur. Resulullah Sallallahu Aleyhi ve Sellem namazında ümmetinebir gidiş yolu olmak üzere Deccal'in fitnesinden Allah'a sığınırdı. Müslim'de yer alan diğer bir hadiste ise \"Deccalden başkası, sizin hakkınızda endişe ettiğim şeylerin en endişe verici olanıdır\"S1 şeklindeki hadise gelince, Nebi Sallallahu Aleyhi ve Sellem bu sözü sahabilere söylemiştir. Zira onlar hakkındaendişe ettiği şey, kendilerine Deccal' den daha yakındır. Nebi Sallallahu Aleyhi ve Sellem'in hakkında endişe ettiği kimse için meydana geleceği kesin olan yakın tehlikeden vuku bulacağı zanna dayanan uzak tehlikeye nazaran -bu daha ağır olsa bile- daha çok korku duyulur. \"Artık oraya Deccal ve veba hastalığı inşallah yaklaşamayacaktır.\" Bilginlerin ifadesine göre hadisteki istisna ifadesi (inşallah) gerçekten durumu Allah'ın iradesine bağlamak olabileceği gibi, teberrük için de olabilir. Bu ihtimal daha ağır basmaktadır. Kadı [yaz şöyle demiştir: Bu hadisler, ehl-i sünnete delil teşkil etmektedir. Ehl-i sünnete göre Deccal'in gerçekten vardır, o muayyen bir şahıstır. Yüce Allah onunla kullarını deneyecektir. Kendisine öldürdüğü kişiyi diriltme, bereket, nehirler, cennet, cehennem, yeryüzünün hazinelerirÜn ardından gitmesi, göğe emredip yağmur yağdırması, yeryüzüne emredip bitki bitirmesi gibi birtakım mucizeler verilecektir. Bütün bu sayılanlar Yüce Allah'ın dilemesiyle olacaktır. Sonra Allah Teala bunları yapmaktan onu aciz kılacak ve ne o kişiyi, ne de bir başkasını öldüremeyecektir. Sonra davası çürütülecek ve kendisini Meryem oğlu Hz. İsa öldürecektir. Bu konuda bazı Haridier, Mutezile, Cehmiye muhalif kalmıştır. Onlar Deccal' in varlığını inkar etmişler ve sahih olan hadisleri reddetmişlerdir]",
			"grades": [],
			"reference": {
				"book": 92,
				"hadith": 81
			}
		}
	]
}