{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7138,
			"arabicnumber": 7138,
			"text": "Abdullah b. Ömer r.a.'den gelen bilgilere göre: Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Dikkat ediniz! Her biriniz çobandır ve her biriniz güttüğü sürüden sorumludur. Şöyle ki insanların başında bulunan en büyük yönetici {devlet başkanı} bir çobandır ve o da idaresi altında bulunanlardan sorumludur. Erkek, kendi ev halkı üzerinde bir çobandır, o da eli altındakilerden sorumludur. Kadın da kocasının ev halkı ve çocukları üzerinde bir çobandır ve o da onlardan sorumludur. Kişinin kölesi de efendisinin malı üzerinde bir çobandır ve o da o malların korunmasından sorumludur. Dikkat edin! Ve’l-hasıl, her biriniz birer çobansınız ve her biriniz güttüğünüz sürüden sorumlusunuz!\" Fethu'l-Bari Açıklaması: Yüce Allah'ın 'Allah'a itaat edin. Nebie ve sizden olan ulü'l-emr'e de itaat edin' emri.\" Bu başlık, İmam Buharl'nin bu ayetin -alimler hakkında indiğini söyleyenlerin iddialarının aksine- idarecilere itaat hakkında indiği görüşünü tercih ettiğine işaret etmektedir. Bunu Taberi de tercih etmiştir. Söz konusu ayetin Nisa suresinde tefsiri yapılırken bu konuda geniş bir açıklama yapılmıştı. İbn Uyeyne şöyle demiştir: Zeyd b. Eslem'e bu ayeti sordum. O zamanlar Muhammed b. Ka'b'ın dışında Medine'de Kur'an'ı onun gibi tefsir edebilecek bir başka kişi daha yoktu. Bana \"Ayetin bir öncesini oku anlarsın\" dedi. Ben de ayetin öncesini okudum. Yüce Allah; ''Allah size, mutIaka emanetIeri ehIi olanlara vermenizi ve insanlar arasında hükmettiğiniz zaman adaletle hükmetmenizi emreder\"(Nisa 58) buyurulmakta idi. Zeyd b. Eslem \"Bu ayet idareciler hakkındadır\" dedi. Ayet-i kerimede -aslında itaat edilen Yüce Allah olduğu halde\"itaat ediniz\" fiili Resul kelimesiyle birlikte tekrar edildiği halde \"ulü'l-emr\" ile tekrar edilmemesinin sebebi mükellefiyetin bilindiği kaynağın Kur'an ve sünnet olmasındandır. Buna göre ayetin takdiri şöyledir: Kur'an'da size belirttiği hususlarda Allah' a itaat ediniz, Kur' an' da beyan ettiği ve sünnette belirttiği hususlarda Rasulullah'a itaat ediniz. Hoş cevaplardan birisi tabıun alimlerinden birinin Emevı idarecilerinden birisine verdiği şu cevaptır. Emevı idarecisi ona \"Yüce Allah Kur'an'da 'Sizden olan ulü'l-emre itaat ediniz' emriyle bize itaat etmenizi emretmiyor mu?\" deyince, o tabıun alimi şöyle cevap vermiştir: Siz hakka muhalefet ettiğinizde o itaat sizden şu ayette çekilip alınmamış mıdır? \"Eğer bir hususta anlaşmazlığa düşerseniz -Allah'a ve ahirete gerçekten inanıyorsanız- onu Allah'a ve Resulüne götürün. (Onların talimatına göre halledin.) Bu hem hayırlı, hem de netice bakımından daha güzeldir. \"(Nisa 59) Tıbı şöyle demiştir: Yüce Allah \"Nebie itaat edin\" cümlesinde fiili tekrarlayarak Nebi Sallallahu Aleyhi ve Sellem'in itaatte müstakil olduğuna işaret etmiştir. Bunu ulü'l-emr'de tekrarlamayarak onların içinde itaatı gerekli olmayan kişiler bulunabileceğine işaret etmiştir. Yüce Allah bu hususu \"Eğer bir hususta anlaşmazlığa düşerseniz\" ifadesiyle belirtmiştir. Burada adeta şöyle denilmektedir: idareciler hakka göre hareket etmezlerse onlara itaat etmeyiniz ve çekişmeye düştüğünüz şeyi Allah'ın ve Nebiinin hükmüne götürünüz. \"Her kim bana itaat ederse Allah'a itaat etmiştir.\" Bu cümle Yüce Allah'ın \"Kim Resu/e itaat ederse Allah'a itaat etmiş olur. \"(Nisa 80) ayet-i kerimesinden alınmıştır. Bu şu demektir: Çünkü ben ancak Yüce Allah'ın emrettiğini emrederim. Her kim benim emrettiğimi yapacak olursa ancak onu emretmemi bana emredene (Allah'a) itaat etmiş olur. Mananın şu şekilde olması da muhtemeldir: Çünkü Yüce Allah bana itaati emretmiştir. Her kim bana itaat ederse Allah'ın bana itaat edilmesi gerektiği ile ilgili emrine itaat etmiş olur. Masiyette de durum böyledir. İtaat, emredileni yerine getirmek, yasak edilenden kaçınmak demektir. isyan ise bunun tam aksidir. \"Her kim benim emirime itaat ederse bana itaat etmiştir.\" ibnü't-Tın şöyle demiştir: ifade edildiğine göre Kureyş ve civarındaki Araplar idarecilik (emirlik) nedir bilmiyorlardı. Onlar emirlere soğuk bakıyorlardı. ibnü't-Tln dedi ki: Resulullah Sallallahu Aleyhi ve Sellem'in bu sözü, başlarına emir tayin ettiği kimselere itaate, müfrezelerle bir yerlere gönderdiğinde kumandanlara boyun eğmeye, bir belde üzerine yönetici tayin ettiğinde tefrika çıkmaması için onlara isyan etmemeye teşviktir. Biz de İmam Şafil'nin el-Umm'deki ifadesinin bu şekilde olduğunu belirtelim. Bu hadis idarecilere itaatin gerekli olduğunu ifade etmektedir. Ancak bu, Fiten bölümünün baş taraflarında geçtiği üzere masiyet ve günahı emretmemekle kayıtlıdır. İdarecilere itaat emrindeki hikmet, tefrikada fesad olduğu için birlik ve beraberliği muhafazada kendini göstermektedir. \"Kişinin kölesi de efendisinin malı üzerinde bir çobandır.\" Hartabı şöyle demiştir: Devlet başkanı, erkek ve diğer adı geçenier, isimlendirmede yani \"çoban\" olarak nitelendirilmelerde ortak olmuşlardır. Ancak onların fonksiyonları birbirinden farklıdır. Halifenin halkı gözetmesi ve gütmesi şer'ı cezaları uygulayıp, yönetiminde adil davranmak suretiyle şeriatı muhafaza etmesi demektir. Erkeğin ailesini gütmesi, onların işlerini yürütüp, haklarını kendilerine vermesidir. Bir kadının çobanlığı ise ev, çoluk-çocuk, hizmetçilerin işlerini çekip çevirmesi, her hususta kocasına içtenlikle bağlı olması demektir. Bir hizmetçinin çobanlığı ise eli altında olan şeyleri koruyup, vermesi gereken hizmeti yerine getirmesi demektir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 2
			}
		}
	]
}