{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7154,
			"arabicnumber": 7154,
			"text": "Sabit el-Bünanı'nin nakline göre Enes b. Malik kendi ailesinden bir kadına hitaben \"Sen filanca kadını tanıyor musun?\" diye sordu. O kadın \"Evet\" dedi. Enes şöyle dedi: Resulullah Sallallahu Aleyhi ve Sellem, O kadın bir kabir yanında ağlamakta iken ona uğradığı ve \"Allah'tan kork ve sabret!\" buyurdu. Kadın \"Benden uzak dur! Çünkü sen benim başıma gelen musibeti bilmiyorsunı\" dedi. Enes dedi ki: Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem O kadını bırakıp, yoluna devam etti. Arkasından o kadına bir adam rastladı ve \"Resulullah Sallallahu Aleyhi ve Sellem sana ne söyledi?\" dedi. Kadın \"Ben onu tanımadım\" dedi. O kişi \"Haberin olsun O, Allah'ın Resulüdür\" dedi. Enes dedi ki: Durumu öğrenen kadın Nebi Sallallahu Aleyhi ve Sellem'in kapısına geldi de kapının önünde hiçbir (perdedar, bekçi veya) muhafızla karşılaşmadı. Nebi Sallallahu Aleyhi ve Sellem'e \"Ya Resulallah! Allah'a yemin ederim ki seni tanıyamadım\" dedi. Resulullah Sallallahu Aleyhi ve Sellem ona \"Sabır musibetin ilk darbesinin geldiği anda olan sabırdır. \" buyurdu. Fethu'l-Bari Açıklaması: \"Sabır musibetin ilk darbesinin geldiği anda olan sabırdır.\" Bu hadisin geniş bir açıklaması Cenaiz bölümünde \"Kabir Ziyareti\" başlığı altında geçmişti. ............. ileyke annı\" çekil ve beni kendi halime bırak demektir. Kadının: \").>- ,$L; şeklindeki ifadesi, \"sen benim üzüntü ve kederimi yaşamıyorsun\" demektir. Mühelleb şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem'in kapısında düzenli ve sürekli bir muhafız yoktu. Dolayısıyla Menakıb Bölümünde Ebu Musa'nın Resulullah Sallallahu Aleyhi ve Sellem'in kuyunun etrafında oturmak için yapılmış yere oturduğunda ona kapıcılık yaptığı yolundaki ifadesi ile bu hüküm çürütülemez. Mühelleb şöyle devam eder: Bu iki rivayet i birbiriyle uzlaştırmak mümkündür: Resulullah Sallallahu Aleyhi ve Sellem ailesiyle ilgili bir işle meşgulolmadığında veya kendisiyle ilgili bir işi kendi başına yapmadığında halkla arasındaki perdeyi kaldırır ve kendisinden bir şeyler isteyecek olan kimseler için ortaya çıkardı. Taberi şöyle demiştir: Nikah Bölümünde geçtiği üzere Resulullah Sallallahu Aleyhi ve Sellem bir ay süreyle hanımlarının yanına girmeyeceğine yemin ettiğinde elEsved Ömer için izin istemişti. İşte bu hadis, Resulullah Sallallahu Aleyhi ve Sellem'in kendi nefsiyle başbaşa kaldığında kapıcı (muhafız) edindiğini göstermektedir. Böyle olmasaydı Ömer kendisi için izin istemez ve \"Ya Rebah! Benim için izin iste!\" demeye ihtiyaç duymazdı. Bizce Hz. Ömer'in İzin isteme sebebi, kızı dolayısıyla Resulullah Sallallahu Aleyhi ve Sellem'in kendisine kızmış olmasından endişe duyması ve huzuruna girme izni isteyerek bu konuyu araştırmak istemesi olabilir. Kendisine izin verilince endişesi yatışmış ve daha önce açıklaması geçtiği üzere rahat konuşmuştur. Hakimin muhafız tutmasının meşru olup olmadığı noktasında bilginler ihtilaf etmişlerdir. İmam Şafil ve bir grup bilgin hakimin muhafız edinmesi uygun değildir demişlerdir. Başkaları ise bunun caiz olduğu kanaatine varmışlardır. Birinci görüş insanların sükunet içinde oldukları, hayır üzere birleştikleri ve hakime itaat ettikleri zamanlarda sözkonusudur denilmiştir. Başka bilginler ise şöyle derler: Tam tersine bir hakimin bu zamanlarda davacı ve davalıları sıraya koyması, arsızlık edenlere engelolup, kötüleri etkisiz hale getirmesi için muhafız tutması müstehaptır. İbnü't-Tın'in nakline göre Davudl şöyle demiştir: Bazı hakimlerin muhafızların sert davranması, davacı ve davalılar için kart uygulaması getirmeleri, selef alimlerinin uygulamalarından değildir. Muhafız edinme meselesine gelince, bu Abbas ve Ali ile Ömer'in çekişmesi olayında sabittir. Zira onun Yerfe adında bir muhafızı vardı. Bu konu Humus bölümünde açık olarak geçmişti. Alimlerden bunun caizliğini hakimin insanlar arasında hüküm vermek için oturduğu vaktin dışıyla kayıtlayanlar olduğu gibi, daha önce geçtiği üzere caizliği genel kılanlar da vardır. Kartlara gelince İbnü't-Tın şöyle demiştir: Davudl'nin bu kelimeden maksadı üzerinde olup bitenlerin yer aldığı kartlar ise bu sahihtir. Yani böyle bir uygulama sonradan olmuştur. İbnü't-TIn şöyle devam eder: Daha önce gelenin davasına bakmaya başlamak için kimin önce geldiğinin yazıldığı kartlara gelince, bu hüküm de adalete girer. Bir başka alim şöyle demiştir: Kapıcı veya muhafızın vazifesi gelen kimsenin durumu hakkında -özellikle eşraftan ise- hakime bilgi vermektir. \"Zira muhtemeldir ki o kişi davacı veya davalı olarak gelmiştir, hakim ise onun ziyarete geldiğini zanneder ve kendisine hakkını ikram kabilinden verir. Oysa davalı veya davacı olarak gelene bu şekilde hak vermek caiz değildir. Hakime bu konuda haber vermek ya sözle ya da yazıyla olur. Sürekli muhafız tutmak mekruhtur. Bazen haram olabilir. Ebu Davud ve Tirmizi'nin ceyyid bir isnadla nakillerine göre Ebu Meryem el-Esedi Muaviye'ye şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'dan Sallallahu Aleyhi ve Sellem işittim şöyle diyordu: ''Allah, bir kimseyi insanların işiyle ilgili bir göreve getirir de o kişi onların ihtiyaçlarını göreceğine gizlenirse Yüce Allah da kıyamet günü onun ihtiyacını görmeyip, gizlenir.\"lol Bu hadis insanlar arasında hakimlik görevine gelip de herhangi bir mazereti olmaksızın onlardan gizlenen kimseye karşı ağır bir tehdit içermektedir. Zira böyle bir hareket hakları sahiplerine ulaştırılmayı geciktirir veya büsbütün zayi eder. Bilginler, mahkemede ilk müracaat edenden başlayarak sırayla gidilmesi, yolculuk halinde olana -özellikle yolcu, arkadaşlarından geri kalacağından korkuyorsa- mukime göre öncelik tanınmasının müstehab olduğu noktasında ittifak etmişlerdir. Yine kapıcı veya muhafız tutan hakimin bunu güvenilir, iffetli, emanete riayet eden, arif, güzel ahlaklı, insanların değerini bilen kişiler arasından seçmesi gerektiği noktasında da ittifak etmişlerdir",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 18
			}
		}
	]
}