{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7164,
			"arabicnumber": 7164,
			"text": "Abdullah b. Ömer'in nakline göre Hz. Ömer şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem bana devlete hizmetim karşılığı olarak ücretimi verirdi, ben de ona \"Bu malı benden daha muhtaçlara ver\" derdim. Nihayet bir keresinde bana mal verdi. Ben yine ona \"Bunu benden daha muhtaç olanlara ver!\" dedim. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Sen bu malı al, kendi mülkiyetine geçir ve tasadduk et. Göz dikmediğin ve istemediğin halde sana bu maldan bir şey geldiğinde onu al. Aksi takdirde talep etme.\" Fethu'l-Bari Açıklaması: \"H1kimlerin ve devlet işini gören amir ve memurların maaşları.\" Başlıkta geçen \"rızk\" devlet başkanının beytü'l-malden Müslümanların işlerini görenlere vermiş olduğu ücret demektir. Mutarrızı şöyle demiştir: \"Rızk\" devlet başkanının beytü'l-malden ücretle çalışanlara her ay, \"ata\" ise her yıl tahsis ettiği miktardır. İmam Buharl'nin attığı başlıktaki \"4::Js. WljVe'l-amiline aleyha\" \"hakim\" kelimesine atfedilmiş olabilir. Buna göre başlık devlet dairelerinde çalışanların ücreti demek olur. İmam Buharl'nin bu cümleyi (4::Js. WIJ) (zekat ayetindeki cümleyi) hikaye tarzında getirmiş olma ihtimali de vardır. Böylece devletten maaş almanın caizliğini zekat ayetine dayandırmak istemiş olabilir. Zira zekat memurları\" ........inneme's-sadukatu\" ayetinden sonra\" ........ el-fukara\" ve ....... el-mesakın\" kelimesi üzerine atfedildikleri için bu ücreti hak edenlerden olmaktadırlar. Taberi şöyle der: Çoğunluk, hakimin yargı görevi karşılığında ücret almasının caiz olduğu kanaatine varmışlardır. Zira hakimlik görevi onu kendi işlerini görmekten alıkoyar. Ne var ki selef bilginlerinden bir zümre, bunu mekruh görmüşler ama bununla birlikte haram kabul etmemişlerdir. Ebu Ali Kerabısı şöyle der: Hakimin yargı görevi karşılığında devletten ücret almasının sahabe ve daha sonraki nesilden elen ilim adamları nezdinde asla herhangi bir sakıncası yoktur. Belli başlı ilim )merkezlerindeki fıkıh bilginlerinin (fukahau'l-emsar) görüşü de bu doğrultudadır. Aralarında bu konuda herhangi bir ihtilaf olduğunu ben bilmiyorum. İçlerinde Mesruk'un da bulunduğu bir grup bilgin ise bunu mekruh görmüştür. Bilginlerin arasında hakimlerin ücret almalarını haram kabul eden olduğunu ben bilmiyorum. Mühelleb şöyle demiştir: Mekruhluk şuradan kaynaklanmaktadır: Yargı görevi esasen ihtisab olarak değerlendirilmiştir. Çünkü Yüce Allah Nebiine \"Deki ben buna (Nebilik görevime) karşılık sizden bir ücret istemiyorum \"(En'am 90) buyurmaktadır. Hakimlerin ücret almalarını mekruh gören bilginler bu konudaki uygulamanın Yüce Allah'ın Nebiine getirmiş olduğu prensip üzere cereyan etmesini istemişlerdir. Bir başka sakınca ise bu mesleğe ehil olmayanların girip, hile ile insanların mallarını ellerine geçirmeleridir. Bir başkası şöyle demiştir: Yargı görevi karşılığında ücret almak, ücret helalden verildiği takdirde bilginlerin ittifakıyla caizdir. Ücreti almayan ancak takvasından dolayı almamaktadır. Buna karşılık ortada bir şüphe sözkonusuysa en uygun olanı kesin olarak ücret almamaktır. Alınan ücret beytü'l-malden meşru bir yoldan alınmıyorsa haram olur. Alınan ücretin haram olmasının daha ağır basması durumunda ihtilaf edilmiştir. Beytü'l-mal dışından alınan ücrete gelince, hakemin hükmüne başvuran taraflardan ücret almanın caizliğinde ihtilaf vardır. Bunu caiz görenler birtakım şartlar ileri sürmüşlerdir. Caizlik görüşü, o şartları ortadan kaldırmaya yol açabilir. Bu asırlarda sözünü ettiğimiz sakınca yaygınlık kazanmıştır. O derece ki bunu ortadan kaldırmak imkansız hale gelmiştir. Doğruyu en iyi Yüce Allah bilir. \"Aişe r.anha, yetimin vasisi yaptığı iş kadar ücret alır demiştir\" demiştir. Biz de şunu belirtelim: İbn Ebi Şeybe Hişam b. Urve, babası isnadıyla bu haberi Hz. Aişe radıyallahu anM'ya dayandırmıştır. Buna göre Hz. Aişe radıyaııalıu an ha \"Yoksulalan da uygun olarak yesin\"(Nisa 6) ayet-i kerimesi hakkında şöyle demiştir: Yüce Allah, bu ayeti yetimin malını çekip çeviren kişi hakkında indirmiştir. Bu kişi malı yetimin çıkarına olacak şekilde idare eder. Şayet kendisi muhtaçsa o maldan yiyebilir. \"Hz. Ebu Bekir ve Ömer seçildikleri andan itibaren beytü'l-malden maaş alıp yemişlerdir.\" Kerabısı'nin sahih bir isnadla nakline göre el-Ahnef'in \"Biz Hz. Ömer'in kapısında duruyorduk\" diye başladığı rivayetinde konumuzIa ilgili olarak Hz. Ömer şöyle demiştir: \"Neleri helal gördüğümü size haber verebilirim: Binip hac edeceğim ve umre yapacağım hayvan, yazlık ve kışlık elbisem, Kureyş'in en üst ve en alt tabakasına mensup olmayan bir ferdi olarak kendimin ve ailemin yiyeceği.\" İmam Şafiı ve ilim ehli kimselerin çoğunluğu, buna ruhsat vermişlerdir. Ahmed b. Hanbel \"Bu pek hoşuma gitmiyor. Yaptığı işe göre olursa yetimin velisi gibi değerlendirilir\" demiştir. Bilginler bu görev için adam kiralamanın caiz olmadığında ittifak etmişlerdir. \"İnsanların birtakım işlerini üstlenip, çalışmanın ücreti sana verildiğinde bunu almak istemediğini haber aldım\" yani idarecilik ve yargı gibi birtakım işlerini üzerine alıp, üceretini almak istemediğini haber aldım. \"el-Umale\" yapılan işin ücreti anlamınadır. \"Bununla neyi kastediyorsun.\" Yani bunu reddetmekle kastın nedir? Abdullah, maksadını \"Bu hizmetlerimin ücretinin Müslümanlara sadaka olmasını istiyorum\" diyerek açıklamıştır. \"Resulullah Sallallahu Aleyhi ve Sellem bana gördüğüm devlet işlerine karşılık bir ücret verirdi.\" Bu cümledeki \"el-ata\" devlet başkanının devletin işleri için ayırmış olduğu mal demektir. \"Resulullah Sallallahu Aleyhi ve Sellem, 'Sen bunu al da mülkiyetine geçir ve tasadduk et.' buyurdu\" Nebi Sallallahu Aleyhi ve Sellem'in bu emri sahih olan görüşe göre bir irşad ve yol gösterme mahiyetindedir. İbn Battal şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem, Hz. Ömer' e en efdal olanı gösterdi. Zira yaptığı işin ücretini kendine ayırmayıp, daha fakir olanlara tercih etmekle sevap elde etse bile onu alıp, bizzat kendisinin sadaka olarak vermesi daha büyük bir sevaptır. Bu bize bir şeyi mülkiyetine geçirdikten sonra tasadduk etmenin büyük fazileti olduğunu göstermektedir. Zira ne fisler mala karşılık hırslı yaratılmışlardır. \"İstemediğin halde\" yani talep etmediğin halde. Nevevı şu açıklamayı yapar: Bu hadisten dilenmenin yasaklığı anlaşılmaktadır. Bilginler zorunluluk olmadıkça dilenmenin yasak olduğu noktasında ittifak etmişlerdir. Çalışmaya gücü yeten kimsenin dilenmesi konusunda ihtilaf edilmiştir. Sahih olan görüşe göre bu haramdır. Bazıları üç şartla dilenmek mubahtır demişlerdir. Bunlar kişinin kendisini alça1tmaması, dilen med e ısrarlı olmaması ve dilendiği kişiye eziyette bulunmamasıdır. Bu şartlardan biri eksik olduğunda dilenmek bilginlerin ittifakıyla haramdır. \"Onu al. Aksi takdirde talep etme.\" Yani sana ücret gelmediği takdirde bunu talep etme, tam aksine bırak. Bundan maksat, başkalarını tercih etme yasaklığı değildir. Tam tersine kişinin hizmetinin ücretini alıp, sonra bizzat kendisinin tasadduk etmesi -az önce geçtiği üzere- daha büyük bir ecirlidir. Nevevı şöyle der: Bu hadiste Hz. Ömer'in menkıbesi, faziletinin, zühdünün ve insanları kendi nefsine tercihinin açıklaması vardır. Biz de şunu belirtelim: Bu mesele Abdullah b. Sa'dı açısından da böyledir. Onun fiili Hz. Ömer'in fiiliyle aynıdır. İbn Battal şöyle der: Hadise göre bir insanın eline istemeksizin geçen malı almak, terk etmekten daha faziletlidir. Zira malı almayan ki yok etmiş durumuna düşebilir. Bu konuda ise yasaklık vardır. İbnü'l-Müneyyir ise bu konunun malı yok etmekle hiçbir alakası yoktur diyerek İbn Battal'ı tenkit etmiştir. Onun bakış açısı şöyledir: Malı zayi etmek, meşru bir yere harcamaksızın döküp saçmaktır. Verileni almamak, veren kimsenin mal varlığını arttırmak, dünyadan yüz çevirmek ve görevi dünyalık bir bedel karşılığında ifa etme sakıncasından kaçınmak anlamına gelir. Dolayısıyla bu, malı zayi etmek sayılmaz. İbnü'l-Müneyyir şöyle devam eder: Daha üstün olmanın sebebi açısından uygun olan şudur: Görevi karşılığında ücret alan, almayana oranla kendini işe daha çok verir ve daha içtenlikle çalışır. Zira ücret almazsa o işi kendiliğinden gönüllü olarak yapmış olur. Bazen bu görevi üstüne almadığı düşüncesi ile ücret alan kadar işe sarılmaz. Ücret alan ise bunun tam aksidir. Zira o bu işin kendi üzerine vazife olduğunu düşün ür ve görevinde ciddiyetle çalışır",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 28
			}
		}
	]
}