{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7166,
			"arabicnumber": 7166,
			"text": "Saide oğullarının kardeşi olan Sehl b. Sa'd şöyle anlatmıştır: Ensardan birisi Resulullah Sallallahu Aleyhi ve Sellem'e gelerek \"Karısıyla birlikte bir adamı yakalayan kimse hakkında ne dersiniz? Bu adam onu öldürebilir mi?\" diye sordu. Bunun akabinde karı koca lian yaptılar, ben de o esnada orada hazır bulundum.\" Fethu'l-Bari Açıklaması: \"Hz. Ömer, Resulullah Sallallahu Aleyhi ve Sellem'in minberi yanında lian yaptırmıştır. \" Bu, mescidde lian yapmanın caizliği konusunda esas alınacak en net ifadedir. Hz. Ömer'in Resulullah Sallallahu Aleyhi ve Sellem'in minberini seçmesi, onun minberinin yanında yapılacak yeminin daha ağır olduğunu düşünmesindendir. Minberin yanında yemin verme konusunda \"Minberimin yanında yemin edilmez\" şeklinde Cabir hadisi vardır. Bu hadisten yeminlerin belli mekanlarda icra edilmek suretiyle ağırlaştırılabileceği hükmü anlaşılmaktadır. Üzerine yemin edilen varlığın büyük olmasına rağmen yemin, muayyen zaman ve mekanda icra edilmek suretiyle ağırlaşmaktadır. Zira yemin eden kimsenin bizzat müşahede ettiği o büyük nesnenin yalan yere yeminden kaçınmada etkisi vardır. İbn Battal şöyle der: Bir grup bilgin mescidde hÜküm vermeyi müstehap görmüşlerdir. İmam Malik'in bu konudaki görüşü şöyledir: Bu eski bir uygulamadır. Zira hakimin huzuruna kadınlar ve zayıflar (rahatlıkla) girebilir. Yargılama hakimin evinde olduğu takdirde görülmemesi muhtemelolduğu için insanlar kendisine ulaşamazlar. İbn Battal şöyle der: Ahmed b. Hanbel ve İshak'ın görüşü de bu doğrultudadır. Bir grup bilgin ise yargılamanın mescidde yapılmasını mekruh görmüştür. Ömer b. Abdulaziz, el-Kasım b. Abdurrahman'a e yargılama yapma diye mektup yazmıştır. Gerekçe olarak \"Çünkü huzuruna adet halindeki kadınlar gelebileceği gibi müşrikler de gelebilir\" demiştir. İmam Şafiı ise şöyle der: Bence en uygunu, bu gerekçelerden dolayı hakimin mescid dışında hüküm vermesidir. Kerabısı şöyle demiştir: Bazıları yargılama bir müslüman la müşrik arasında geçebilir ve müşrik mescide girer gerekçesiyle mescidde hüküm vermeyi mekruh görmüşlerdir. Kerabısı şöyle der: Müşrikin mescide girmesi mekruhtur. Fakat onların arasında hüküm vermek, Nebi Sallallahu Aleyhi ve Sellem'in mescidiyle başka mescidlerde seleften bu yana devam eden bir uygulamadır. Kerabısı daha sonra bu konuda birçok rivayete yer verir. İbn Battal şöyle demiştir: Sehl b. Sa'd hadisi mescidde hüküm vermenin -evla olanı mescidi korumak olsa bile- caizliğine delildir. İmam Malik şöyle demiştir: Eskiler mescidin dışındaki geniş sahada otururlardı. Burası ya cenazenin konduğu yer olurdu ya da Mervan'ın evinin geniş sahası olurdu. İmam Malik şöyle devam eder: Ben Yahudiler, Hıristiyanlar, adet halindeki kadınlar ve zayıflar kolayca ulaşabilecekleri için büyük şehirlerde bunu hakime müstehap görürüm. Hakimin bu durumu, tevazuya daha uygundur",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 30
			}
		}
	]
}