{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7171,
			"arabicnumber": 7171,
			"text": "Ali b. Hüseyin'in nakline göre Safiye bnt. Huyey (Nebi Sallallahu Aleyhi ve Sellem itikaf yerinde iken onun yanına ziyarete) gelir. Safiye geri döneceği sırada Resulullah Sallallahu Aleyhi ve Sellem de onunla birlikte kapıya kadar yürür, tam bu sırada ensardan iki kişi oradan geçmektedir. Nebi Sallallahu Aleyhi ve Sellem onları çağırır ve \"Bu kadın Safiye bnt. Huyey'dir\" buyurur. Bu iki ensarlı \"Sübhanallah\" derler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Şüphesiz ki şeytan Ademoğlunun vücudunda kanın dolaşması gibi dolaşmaktadırı\" buyurur. Fethu'l-Bari Açıklaması: AÇIKLAMA’DAN SONRA BAB VE HADİS VAR \"Hakimin görevi esnasında veya daha önce çekişme konusu olan olaya davacı veya davalı lehine şahit olması.\" Yani Hakim, kendi bilgisine dayanarak o kimsenin lehine ve hasmının aleyhine hüküm verebilir mi ya da bir başka hakimin huzurunda o kişinin lehine şahitlikte bulunabilir mi? İmam Buharl'nin ifadesi her ne kadar hakimin kendi bilgisine dayanarak hüküm veremeyeceği görüşünü tercih ettiğini gerektiriyor ise de bu meseledeki ihtilafın kuvvetli olmasından dolayı başlığını kesin bir ifade kullanmaksızın soru cümlesi şeklinde atmıştır. \"Hicaz bilginlerinin kanaati şöyledir: Hakim olaya ister görevdeyken şahit olsun, isterse daha önce kendi bilgisine dayanarak hüküm vermez.\" İmam Malik'in görüşü bu doğrultudadır. Ebu Ali Kerabısı şöyle demiştir: Hakim töhmete uğrama tehlikesinden dolayı kendi bilgisine dayanarak hüküm vermez. Zira takva ehli bir kimsenin töhmete uğramayacağından emin olunamaz. Kerabısı şöyle devam eder: Zannediyorum İmam Malik, İbn Şihab'ın Zeyd b. Salt'ın naklettiği şu habere meyletmiştir: \"Hz. Ebu Bekir bir kimseyi had uygulamak gerektiren bir suçu işlerken görürsem yanımda bir başkası daha olmadıkça ona ceza uygulamam demiştir.\" Kerabısı bundan sonra sahih bir isnadla İbn Şihab'ın şu sözünü nakletmiştir: İmam Malik'in o hadisi unutmuş olduğunu zannetmiyorum. Böyle olduğu için ümmetin fazilet ve ilimce onu taklit etmiştir. Hakimin kendi bilgisine dayanarak mutlak olarak hüküm vermesinin caiz olduğu görüşü şöyle bir sakınca doğurabilir: Hakim asla zina ettiği bilinmeyen, durumu kapalı (mestur) bir kimseyi zina ederken gördüğünü iddia edip, recm edebilir ya da bir erkeği karısını boşarken duyduğunu iddia edip, onları birbirinden ayırabilir veya bir efendinin cariyesini azat ettiğini duyduğunu ileri sürerek onları ayırabilir. Bu kapı bir açıldı mı her hakim, düşmanını cezalandırmaya, onun fasık olduğunu ileri sürmeye, kişiyle sevdiği arasını ayırmaya yol bulabilir. Buradan hareketle İmam Şafiı şöyle demiştir: Kötü hakimler olmasaydı, hakimin kendi bilgisine dayanarak hüküm verebileceğini söylerdim. O zamanlar böyle bir sakınca gündeme geldiğine göre acaba zamanımızda neler olur bir düşünmek gerekir. Sonuç olarak bu son zamanlarda hakimlik mesleğine güvenilmez kimselerin çok gelmesi nedeniyle hakimlerin kendi bilgilerine dayanarak hüküm vermelerinin caizliğini kökünden ortadan kaldırmak tek çıkar yol haline gelmiştir. Doğruyu ancak Yüce Allah bilir. \"Taraflardan biri hakimin huzurunda diğeri lehine yargı meclisinde bir hak itirafında bulunacak olursa, bazı bilginlere göre iki şahit çağırıp, onun ikrarına şahit tutmadıkça hüküm vermez.\" İbnü't-Tin şöyle demiştir: Hz. Ömer ve Abdurrahman'dan nakledilen görüş İmam Malik ve mezhebindeki çoğu bilginlerin görüşüdür. Maliki mezhebinden bazıları, yargı meclisinde taraflardan birinin huzurunda ikrarda bulunması durumunda hakimin kendi bilgisine dayanarak hüküm verebileceğini söylemişlerdir. İbnü'l-Kasım ve Eşheb şöyle demişlerdir: Hakim yargı meclisinde kendi huzurunda meydana gelen olay hakkında huzurunda şahit tutmadıkça hüküm veremez. İbnü'I-Müneyyir şöyle demiştir: İmam Malik'in görüşüne göre kendi bilgisine dayanarak hüküm veren hakim mezhepte meşhur olan yaklaşıma göre bunu yapabilir. Ancak bilgisi yargılamaya başladıktan sonra oluşmuşsa bu konuda iki görüş sözkonusudur. Yargı meclisinde huzurunda yapılan ikrara gelince karşı taraf bu ikrardan sonra ve aleyhine hüküm verilmeden önce bunu inkar etmediği sürece ona dayanarak hüküm verebilir. İbnü'l-Kasım'ın yaklaşımı ise şöyledir: Hakim karşı tarafın inkarından sonra onun aleyhine hüküm veremez. Artık şahit konumuna düşmüştür. Bundan sonra İbn Müneyyir şöyle der: \"Yargı meclisinde iki şahidin mutlaka yapılan ikrara şahitlikte bulunması gerekir\" görüşü, sonunda ikrara dayanarak hüküm verme şekline döner. Zira şahitler, a) ya şahitlik ederler ya da etmezler. Şahitlik ettikleri takdirde hakimin (o kişiyi cezalandırmakta) mazur olması gerekir. Mazur olunca ikrara yapılan şahitliğin de başka şahitlerle ispatına ihtiyaç gerektirir. Bu durumda mesele zincirleme uzayıp gider. Şahitliğe ihtiyaç yok denirse hüküm, ikrara dayanılarak hüküm vermeye dönüşür. b) Şahitler, şahitlik etmezlerse o zaman dava yok hükmünde olur. Bir başkası buna şöyle cevap vermiştir: İkrara şahit tutmanın faydası, davalıyı inkar etmekten caydırmaktır. Zira davalı, ikrarına şahitlik edecek birisi bulunduğunu bildiği takdirde -tazir edilmekten emin olma durumunun aksine- bu cezanın korkusuyla inkardan kaçınır. \"Iraklı alimlerin dışındakiler ise şöyle demişlerdir: Tam tersine buna dayanarak hükmünü verir. Çünkü o güvenilirdir.\" Burada \"şahitlik\" kelimesi ile gerçeğin bilinmesi kastedilmektedir. Hakimin gerçek şeye dair bilgisi şahitlikten çok daha güçlüdür. İmam Ebu Yusuf ve ona uyanların görüşü bu doğrultudadır. İmam Şafii de bu konuda onlar gibi düşünmektedir. Ebu Ali Kerabisi şöyle demiştir: Bana nakledildiğine göre İmam Şafii Mısır' da şu görüşü savunmuştur: Hakim ahlaklı (adil) ise şer' i ceza ve kısas konusunda -huzurunda itiraf edilmemişse- kendi bilgisine dayanarak hüküm vermez. Her türlü hak davalarında ise verir. Bu konudaki bilgiyi ister göreve gelmeden önce elde etmiş olsun, isterse daha sonra elde etsin farketmez. Şafii'nin hakimi ahlaklı (adil) şeklinde kayıtlaması yargı görevine kuwet zoruyla ahlaklı olmayan kimselerin gelebileceklerine işarettir. \"Bazı Iraklı bilginler ise şöyle demişlerdir: Hakim dava konusu mal olduğunda kendi bilgisine dayanarak hüküm verirken, bunun dışındaki davalarda veremez.\" İmam Ebu Hanife ve Ebu Yusuf'un görüşü bu doğrultudadır. KerabısI'nin Ebu Yusuf'tan nakline göre hakim bir kimseyi -mesela zina ederken- görse huzurunda buna şahadet eden bir beyyine olmadığı sürece kendi bilgisine dayanarak hüküm vermez. Ahmed b. Hanbel'den de böyle bir rivayet naklediimiştir. Ebu Hanıfe şöyle demiştir: Dindeki genel kural (kıyas), hakimin bütün bu davalarda kendi bilgisine göre hüküm vermesi doğrultusundadır. Fakat ben genel kuralı bırakıp, istihsan yaparak bu hususta kendi bilgisine göre hüküm vermez diyorum",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 35
			}
		}
	]
}