{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"93": "Judgments (Ahkaam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7221,
			"arabicnumber": 7221,
			"text": "Ebu Bekir (Nebi s.a.v.'in vefatından son irtidad eden) Büzaha heyetine hitaben) \"Yüce Allah Nebiinin halifesine ve muhadrlere sizleri mazur kılacak bir durum gösterinceye kadar çöllerde develerin kuyruklarının ardından gidiniz\" dedi. Fethu'l-Bari Açıklaması: AÇIKLAMA SONRASI BİR HADİS DAHA VAR Buharl'nin kullandığı başlıktaki \"İstihlaf\", bir halifenin vefat edeceği sırada kendisinden sonra gelecek halifeyi tayin etmesi veya aralarından birini seçmeleri için bir topluluğa yardımda bulunması demektir. \"Fe a'hide\" yani benden sonra bu işi görecek kimseye yardım edeyim. İmam Buharl'nin cümleden anladığı budur. Dolayısıyla hadiste geçen \"el-ahd\" kelimesi bundan daha genelolmakla birlikte Buhari bu başlığı kullanmıştır. Müslim'in naklettiği bir rivayete göre Resulullah Sallallahu Aleyhi ve Sellem Aişe r.anha'ya \"Bana EbU Bekir ve kardeşini çağır da bir mektup yazayım. Çünkü ben (halifeliği) temennf eden birisinin çıkacağından ve (halifeliğe) ben daha layığım diyeceğinden endişe ediyorum. Yüce Allah ve mu'minler ise EbU Bekir'den başkasına halifeliği nasip etmemekten çekinmez. \"(Müslim, Fadailu's-Sahabe) Bezzar'ın rivayetine göre Resulullah Sallallahu Aleyhi ve Sellem \"Allah korusun! İnsanların Ebu Bekir hakkında ihtilafa düşmelerinden Allah'a sığınırım\" buyurmuştur. Mühelleb bu konuda ileri 'giderek şöyle demiştir: Hadis, Ebu Bekir'in halifeliğine kesin bir delildir. İnsanı hayrette bırakanı onun bunu söyledikten sonra Nebi Sallallahu Aleyhi ve Sellem'in yerine herhangi bir kimseyi halife olarak bırakmadığının sabit olduğunu ifade etmiş olmasıdır. \"Eğer yerime halife tayin ve tavsiye edersem.\" Bizim bu konudaki görüşümüz şudur: Anlaşılan Hz. Ömer'in tercihi yerine herhangi bir kimseyi halife olarak bırakmamaktır. Çünkü Nebi Sallallahu Aleyhi ve Sellem'in yaptığı uygulama, azimetin aksinedir. Bu, Resulullah Sallallahu Aleyhi ve Sellem'in temettu haccına niyetlenip, ifrad haccı yapmasına benzer. Netice olarak o, ifrad haccını tercih etmiş oldu. \"Orada hazır bulunanlar Ömer' i övdüler. Bunun üzerine Ömer 'Ben (hem) isterim ve (hem de) korkarım' dedi.\" İbn Battal şöyle der: Bu ifade iki manaya muhtemeldir: Birincisi beni övenler ya bu konudaki isabetli düşüncemi ve açıklamamı istemektedirler ya da içlerinde gizledikleri hoşlanmamayı artaya Çlkarmamdan korkmaktadırlar ya da bunlar benim yanımda olanı istemekte ve benden korkmaktadırlar veya insanlar hilafeti istemekte ve ondan korkmaktadırlar. Ben bunu isteyene verirsem kendisine (görevi başında) yardım edilmeyeceğinden endişe ederim. İstemeyene verdiğim takdirde onun da bu görevi yapmayacağından korkarım. Kadi iyad bu manalara bir başkasını katarak şöyle demiştir: Bu iki kelime Hz. Ömer'in niteliğidir. Buna göre Hz. Ömer ben Allah katındakini arzulamakta ve onun vereceği cezadan korkmaktayım. Sizin övgülerinize itibar etmem. Bu beni başınıza birini halife tayin ve tespit etme işiyle i1gilenmekten alıkoyuyar demiş olmaktadır. \"Ben bundan\" yani hilafetten onun kötülüğünden ve hayrından uzak olarak yakamı sıyırmak istiyorum. Nitekim kendisi bu ifadeyi hadiste \"ne karlı, ne de zararlı olmayarak\" cümlesiyle tefsir etmektedir. İbn Battal özetle şöyle demiştir: \"Hz. Ömer bu konuda fitne korkusuyla orta bir yol tutmuştur.\" Ve böylece yerine birisini halife tayin etmenin Müslümanların işlerini daha çok sağlama alacağını görmüştür. Bundan dolayı meseleyi Hz. Nebie ve Ebu Bekir' e uymayı terk etmiş olmamak için altı kişiye havale etmiştir. O Nebi Sallallahu Aleyhi ve Sellem'in uygulamasının bir kısmını alarak yerine belli bir kimseyi tayin etmemiş, Ebu Bekır'in uygulamasından bir kısmını alarak -açıkça isim belirtmemekle birlikte- bu görevi altı kişiden birisine bırakmıştır. İbn Battal şöyle devam eder: Bu olay görevdeki halifenin bunu kendisinden sonra başka birisine bırakabileceğine, bu konuda bütün Müslümanlara emir vermesinin caiz olduğuna delildir. Zira sahabiler ve onların ardından gelenler Ebu Bekir'in görevi Ömer'e vermesi konusundaki uygulamada ittifak halindedirler. Aynı şekilde onlar Hz. Ömer'in altı kişiye emir vermesini kabul noktasında da ihtilaf etmemişlerdir. İbn Battal şöyle der: Bu, bir kimsenin bir başkasını kendi çocuğu üzerine -çocuğun menfaatleri konusunda düşünce tarzı bir başkasından daha mükemmelolduğu için- vasi tayin etmesine benzer. Halife de aynen böyledir. Nevevi ve başkalarının bu konudaki ifadelerine göre bilginler tayin ve tavsiye etme yoluyla halife olunabileceği noktasında icma ettikleri gibi bunun ehlü'lhal ve'l-akdin bir kimseyi -bir başkası tavsiye ve tayin edilmediği için- halife tayin edeceği, halifenin bu meseleyi belli sayıda kişiler veya başkaları arasında danışmayla yapılması emri verebileceği noktasında icma etmişlerdir. Yine onlar bir halife tayin etmenin gerekli olduğu, bunun aklen değil, şer'an vacip olduğu noktasında da görüş birliği etmişlerdir. \"Enes b. Malik, Hz. Ömer'in minber üzerine oturup da yaptığı ikinci konuşmayı dinlemişti. Bu konuşma Nebi Sallallahu Aleyhi ve Sellem'in vefatı gününün ertesinde olmuştu.\" Bu konuşma, Nebi Sallallahu Aleyhi ve Sellem'in vefatı gününün ertesinde olmuştu. Enes'in gördüm ve işittim diye naklettiği bu olay, -Muhsan Olup Zinadan Gebe Ka1an Kadının Recmedilmesi başlığı altında daha önce açıklandığı üzere- Ebu Bekir'e Saide oğulları sakifesinde bey'at edildikten sonra gerçekleşmiştir. Orada Ebu Bekir'e önce Muhacirlerin, sonra Ensarın bey'at ettiğinden söz edilmişti. Sahabiler orada bu işi sonlandırıp, Ebu Bekir'e bey'at konusunda tam birlik gerçekleşince, Nebi Sallallahu Aleyhi ve Sellem'in mescidine geldiler ve Resulullah Sallallahu Aleyhi ve Sellem'in cenazesinin kaldırılması işiyle meşgul olmaya başladılar. Sonra Ömer Saide oğulları sakifesinde gerçekleşen bey'at akdinde hazır bulunmayan kimselere orada olup bitenleri haber verdi. Ardından onları Ebu Bekir'e bey'at etmeye davet etti ve orada hazır bulunmayanlar Ebu Bekir'e bey'at ettiler. Bütün bunlar aynı gün içinde gerçekleşti. \"Resulullah Sallallahu Aleyhi ve Sellem'in yaşayıp da bizden sonraya kalmasını ümit ederdim.\" Yani bunu dilerdim. \"Tüm insanlar ona bey'at ettiler.\" Yani ikinci bey'at Saide oğulları sakifesinde gerçekleşen bey'at ten daha genel, daha meşhur ve katılanlar itibarıyla daha kalabalıktı. \"Ebu Bekir, (Resulullah Sallallahu Aleyhi ve Sellem'in vefatından sonra dinden çıkmış) Büzaha heyetine hitaben şöyle dedi.\" Büzaha, Esed ve Gatafan kabilelerindendi. Bu kabileler Nebi Sallallahu Aleyhi ve Sellem'in vefatından sonra dinden dönmüşler, Tulayha b. Huveylid el-Esedı'ye tabi olmuşlardı. Tulayha, Resulullah Sallallahu Aleyhi ve Sellem'in vefatından sonra Nebi olduğunu iddia edince insanlar kendilerinden olduğu için ona itaat ettiler. Bunun üzerine Halid b. Velid, Yemame'de Müseylime'nin işini bitirdikten sonra onlarla çarpıştı. Bu kabileler yenilince heyetlerini Ebu Bekir'e gönderdiler. Tabert ve başka tarihçiler Ridde Olayları Bölümünde onların hikayelerine ve Ebu Bekir'in halifeliği döneminde sahabilerin onlarla yaptıkları çarpışmalara yer verirler. \"Develerin kuyruklarının ardından gidiniz.\" İbn Battal şöyle demiştir: Bu kabileler önce dinden döndüler, sonra tövbe ettiler ve kendilerini mazur görmesi için elçilerini Ebu Bekir' e gönderdiler. Ebu Bekir danışmalarda bulunmadan onlar hakkında hüküm vermek istemedi ve onlara \"Şimdi dönün ve çöllerde develerin kuyruklarının ardından gidiniz\" dedi. Öyle anlaşılıyor ki Ebu Bekir'in onlara bu mühleti vermekten maksadı tövbe ettiklerinin ve İslamı güzel bir şekilde yaşayarak salih kimseler olduklarının ortaya çıkmasıdır",
			"grades": [],
			"reference": {
				"book": 93,
				"hadith": 81
			}
		}
	]
}