{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7230,
			"arabicnumber": 7230,
			"text": "Cabir b. Abdullah şöyle anlatmıştır: Bizler (veda haccı yolunda) Resulullah Sallallahu Aleyhi ve Sellemla birlikte idik. Yalnız hac niyetiyle ihrama girdik ve iilhiccenin dördünde Mekke'ye geldik. Resulullah Sallallahu Aleyhi ve Sellem bize Kabe'yi tavaf, Safa ile Merve arasında sa'y yapmamızı ve bu haccımızı umre yapmamızı, ardından da -beraberinde kurbanlık bulunanlar hariç- ihramdan çıkmamızı emretti. Cabir şöyle devam etti: İçimizde Resulullah Sallallahu Aleyhi ve Sellem ve Talha'dan başka kimsenin beraberinde kurbanlık yoktu. Ali Yemen'den gelmiş, kurbanını beraberinde getirmişti. O \"Ben Resulullah Sallallahu Aleyhi ve Sellem'in ihrama girdiği gibi ihramlandım\" dedi. Bu sözü duyanlar \"Bizler Mina'ya cinsel isteklerimizi yerine getirerek giderken (Resulullah Sallallahu Aleyhi ve Sellem ihramh kalacaktır)\" dediler. Nebi Sallallahu Aleyhi ve Sellem bu sözleri işitince: \"Eğer ben (hac aylarında umremin caiz olduğunu şimdi) bildiğim gibi (ihrama girerken de) önceden bilmiş olsaydım, kurban sevketmezdim. Yanımda kurbanım olmasaydı, şimdi (ben de sizin gibi) ihramdan çıkardım\" buyurdu. Cabir şöyle dedi: Süraka b. Malik el-Müdlici, Nebi Sallallahu Aleyhi ve Sellem Akabe cemresini taşlarken onunla karşılaştı da \"Ya Resulallah! Bu (haccı umreye çevirmek) bize mi mahsustur?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Hayır, size mahsus değildir, ebedidir\" buyurdu. Cabir şöyle devam etti: Hz. Aişe radıyallShu anhS Mekke'ye adet halinde geldi. Nebi Sallallahu Aleyhi ve Sellem ona bütün hac ibadetlerini yapmasını, yalnız temizleninceye kadar Kabe'yi tavaf etmemesini ve namaz kılmamasını emretti. Nihayet Batha denilen yere konakladıkları zaman Hz. Aişe radıyallShu anha (temizlendi ve tavaf etti ve) \"Ya Resulallah! Sizler bir hac ve bir umre ile dönerken ben bir tek hac ile mi döneceğim?\" dedi. Ravi şöyle' devam etti: Sonra Resulullah Sallallahu Aleyhi ve Sellem, Hz. Aişe radıyallShu anhs'nın kardeşi Abdurrahman b. Ebi Bekr'e kızkardeşiyle birlikte Ten'im'e gitmesini emretti. Ve Hz. Aişe radıyallShu anhS, hac günlerinden sonra zilhicce ayında oradan ihrama girerek umre yaptı.\" Bu hadisin geniş bir açıklaması Hac Bölümünde 1568 no ile geçmişti",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 5
			}
		}
	]
}