{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7231,
			"arabicnumber": 7231,
			"text": "Abdullah b. Amir b. Rebi'a'nın nakline göre Aişe r.anha şöyle demiştir: \"Resulullah Sallallahu Aleyhi ve Sellem (Medine'ye hicret ettiği zaman düşman saldırısından endişe ederek) bir gece uyuyamadı ve \"Keşke sahabilerimden elverişli bir kişi bu gece benim için bekçilik etse!\" dedi. Tam bu sırada biz ansızın bir silah sesi işittik. Resulullah Sallallahu Aleyhi ve Sellem \"Bu kimdir?\" diye sordu. Sa'd b. Ebi Vakkas \"Ya Resulallah! Seni bekleyip korumak için geldim!\" diye cevap verdi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem uykuya daldı. Hatta biz onun horladığını işittik.\" Ebu Abdullah el-Buhari şöyle dedi: Hz. Aişe radıyallilhu anha'nın ifadesine göre Bilal şu şiiri söyledi: Ela leyte şi'rf hel ebftenne leyleten Bivadin ve havlf izhirun ve celflü Geceler miyim bir gece bilseydim keşke! Etrafımda izhir ve celfl otu ve ben Mekke vadisinde! Hz. Aişe radıyallahu anhil \"Ben Bilal'in bu sözlerini Nebie haber verdim\" dedi. . Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in 'Keşke şöyle şöyle olsaydı' sözü.\" \"Leyte\" temennı harflerinden birisi olup, genellikle imkansızı, az olarak da mümkün olanı temennı etmede kullanılır. Bunlardan birisi yukarıdaki hadistir. Çünkü bekçilik ve Bilal'in temennı ettiği yerde gecelemesi gerçekleşmiş hadiselerdendir. \"Urika\" vezin ve mana itibarı ile \"sehira=uyumadı\" anlamınadır. Bunun açıklaması Savaşta Bekçilik Etme başlığı altında geçmişti. \"Bu kimdir?\" sorusuna \"Sa'd\" diye cevap verilmiştir. Bir Uyarı Cihad bölümünün \"el-Hirase\" başlığı altında TirmizI'nin Abdullah b. Şakik vasıtasıyla Aişe r.anha' den naklettiği şu hadisi zikretmiştik: Resulullah Sallallahu Aleyhi ve Sellem\" dl: ......... =Allah seni insanlardan koruyacaktır\"(Maide 67) ayet-i kerimesi ininceye kadar korunuyordu. Bu haber, Nebi Sallallahu Aleyhi ve Sellem'in ayet inmiş olduğu için bu andan sonra korunmamış olmasını gerektirmektedir. Fakat birçok haberde onun Bedir' de, Uhud' da, Hendek'te, Hayber'den dönerken Vadi'l-Kura'da, kaza umresinde ve Huneyn'de korunduğu yer almaktadır.\" Sanki bu ayet Huneyn savaşından daha sonra inmiş gibidir. Bu fikri Taberanl'nin el-Mucemu's-Sağir'de naklettiği Ebu Said hadisi teyit etmektedir: \"Abbas, Nebi s.a.v.’ koruyan kimselerden biriydi. Bu ayet inince o Resulullah s.a.v. korumayı bıraktı.\" (Taberani, Mucemu's-Sağir, I, 26- 55) Abbas, Mekke'nin fethinden sonra Resulullah s.a.v.’den hiç ayrılmamıştır. Buna göre ayetin Huneyn'den sonra indiği düşünülür. Nebi s.a.v.'in, Huneyn gecesi korunduğu haberini EbU Davud, Nesai ve el-Hakim, Sehl b. elHanzallye' den şöyle nakletmiştir: \"Enes b. Ebi Mersed o gece Hz. Nebii beklemiştir.\" (Ebu Davud, Cihad; Hakim, el-Müstedrek, I, 362) Bazıları Hz, Nebie bekçilik eden sahabilerin isimlerini araştırmışlar ve bir araya toplamışlardır. Bunlardan bazıları şunlardır: Sa'd b. Muaz, Muhammed b. Mesleme, Zübeyr, Ebu Eyyub, Zekvan b. Abdulkays, el-Edra es-Sülemi, Mihcen b. el-Edra. Bazıları Seleme, Abbad b. Bişr, Abbas, Ebu Reyhane'yi de sayarlar. İsmi geçen bu sahabilerden her biri zikri geçen olaylarda sadece Hz. Nebie bekçilik etmemişlerdir. Tam tersine bunların ismi mutlak olarak bekçilik yaptıkları şeklinde zikredilmiştir. Ebu Eyyub gibi bazı isimlerin sırf Hz. Nebie bekçilik ve koruma görevi yapmış olmaları mümkündür. Nitekim Hz. Nebi sallallahu a1eyhi ve sellem Hayber'den dönüp de Safiye ile gerdeğe girdiğinde Ebu Eyyub bekçilik yapmıştır, Enes b. Ebi Mersed örneğinde olduğu gibi o savaşa katılan kimselere bekçilik yapılmas1 da mümkündür. Bu konunun gerçek bilgisi Yüce Allah'ın katındadır",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 6
			}
		}
	]
}