{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"94": "Wishes"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7245,
			"arabicnumber": 7245,
			"text": "Abdullah b. Zeyd'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Eğer hicret olmasaydı, elbette ben Ensardan bir kimse olurdum. İnsanlar bir vadiye yahut bir dağ yoluna girip gitselerdi, ben muhakkak Ensann vadisine ve gittikleri dağ ya/una giderdim!\" Fethu'l-Bari Açıklaması: \"Keşke şöyle olsaydı diye temennı etmenin caizliği ve Yüce Allah'ın \"Keşke benim size karşı (koyacak) bir gücüm olsaydı veya güçlü bir kaleye sığınabilseydim\"(Hud 80) sözü.\" Kadı lyaz şöyle demiştir: İmam Buharibu başlıkla Allah'ın kazasına razı olan kimsenin \"Şöyle olsaydı şöyle olurdu\" demesinin caiz olduğunu kastetmektedir. \"Keşke benim size karşı (koyacak) bir gücüm olsaydı.\" İbn Battal şöyle demiştir: Bu örnek ayette yer alan \"lev\" şart edatının hüküm cümlesi (cevabı) mahzuftur. İfade adeta şöyledir: \"Benim size karşı (koyacak) bir gücüm olsaydı, sizinle yapmış olduğunuz bu fesad arasına girip engelolurdum.\" İbn Battal şöyle devam eder: Sözkonusu hüküm cümlesinin (cevabın) hazfi son derece beliğdir. Zira olumsuzluk kipiyle bütün engelleme çeşitleri kuşatılmış olmaktadır. Lut'un aleyhisselil.m istediği karşı koyacak çok adama sahip olmaktı. Aksi takdirde o Yüce Allah'tan sağlam ve güçlü bir kalesinin olduğunu biliyordu. Fakat ifadesini, cari olan adete göre kullanmıştır. İbn Battal şöyle devam eder: Ayet-i kerime bir mu'min gidermeye gücü yetmediği bir münkeri gördüğünde nasıl bir tavır takınması gerektiğini beyan etmektedir. Buna göre o kişi münkeri giderme de yardımcısı olmadığı için içi yanacak ve Rabbine itaat arzusu ve ona karşı günaha devam edilmesine tahammül edememekten dolayı böyle bir desteğin bulunmasını temenni edecektir. Buradan hareketle o kötülüğe diliyle ve gidermeye gücü yetmediği takdirde kalbiyle tepki gösterecektir. Sübki' nin zikretmiş olduğu hadise Buhari, \"Keşke şöyle olsaydı diye temenni etmenin caizliği\" cümlesi ile işaret etmiştir. Buhari'nin attığı bu başlık, sözkonusu temenninin istisna durumu hariç esasen caiz olmadığına işaret etmektedir. Bu hadis Nesai', İbn Mace, Tahavi'de Muhammed b. Aclan, el-A'rac, Ebu Hureyre isnadıyla Nebi Sallallahu Aleyhi ve Sellem'in ağzından şöyle nakledilmiştir: \"Kuvvetli mü'min, zayıf mü'minden daha hayırlıdır ve Yüce Allah'a daha sevimlidir. Bunların her birinde hayır vardır. Sana fayda verecek şeyi hırsla iste, bundan aciz olma. Bir şeyin üstesinden gelemediğinde 'Allah'ın kaderi böyle imiş O'nun dilediği olur' de. 'Keşke' demekten sakın. Zira 'Keşke' şeytana faaliyet kapısı açar. \"(İbn Mace, Zühd) Bu hadisi Müslim de Abdullah b. İdris'ten rivayet etmiştir.(Müslim, Kader) Taberi şöyle demiştir: \"Keşke\" demenin yasaklı ğı ile bunun caiz olduğunu gösteren hadisleri birbiriyle cem ve telif etmenin yolu şudur: Yasaklık, henüz gerçekleşmemiş bir fiil hakkında onun kesin olarak olacağına hükmetmekle ilgilidir. Buna göre mana şöyle olur: Gerçekleşmemiş bir iş için kesin olarak gerçekleşeceğine hükmederek ve içinden Allah'ın dilemesinin şart olduğunu geçirmeksizin \"Şayet şöyle yapsaydım bu iş olurdu\" deme. \"Keşke\" demenin caizliği ile ilgili rivayetler, kişi zikredilen şarta kesin olarak inandığı takdirde caizdir şeklinde yorumlanmıştır. Sözkonusu şart, Allah'ın dilemesi ve iradesi olmaksızın hiçbir şey gerçekleşmez düşüncesidir. Bu Ebu Bekir'in mağarada söylediği \"Onlardan herhangi bir ayağını kaldırsaydı bizi görecekti\" şeklindeki ifadesine benzer. Ebu Bekir, Yüce Allah'ın müşriklerin gözlerini Resulullah Sallallahu Aleyhi ve Sellem'in ve kendisinin üzerinden onlara körlük vererek veya başka bir yolla çevireceğine kesin olarak inandığı halde böyle kesin bir dil kullanmıştır. Fakat bu ifade onun ağzından cari olan adete göre çıkmıştır. O, Allah dilemedikçe müşriklerin ayaklarını kaldırsalar bile kendilerini göremeyeceklerine kesin olarak inanıyordu. Kadı Iyaz şöyle demiştir: İmam Buhari'nin kullandığı başlıktan ve bu bölümde zikrettiği hadislerden anlaşılan şudur: \"Lev ve levıa=keşke ... \" ifadesi, kişinin yaptığı şeylerden gelecekle ilgili olan hususlarda kullanılabilir. Çünkü gelecekte bundan başka bir fiilin olması da mümkündür. Bu, \"lev=keşke\" kabilindendir. Zira bu konuya ancak gelecekle ilgili olan şeyler girer. Bu da gerçek, sahih ve kesin değildir. Geçmişte olan veya olup bitmiş bulunan ya da gaybe ve geçmiş kadere itiraz niteliğinde olan şeyler böyle değildir. Kadı Iyaz şöyle devam eder: \"Keşke\" yasaklığı, kişinin bunun olacağına kesin olarak inanması açısındandır. Bu durumdaki kimse, sözkonusu fiili yapsa başına gelen kesinlikle gelmeyecekti inancındadır. Buna karşılık sözkonusu durumu Allah'ın dilemesine havale eden ve Allah bunu dilememiş olsaydı başıma gelmezdi diye düşünen kimse bu kabilden olmaz. Kadı Iyaz şöyle der: Hadisin manası hakkındaki kanaatime göre sözkonusu yasaklık, zahiri ve genelliği üzeredir. Fakat bu yasaklık tenzihidir. Bunun tenzihi olduğunu \"Zira 'Keşke' şeytana faaliyet kapısı açar\" ifadesi göstermektedir. Yani şeytan insanın kalbine kadere itiraz duygusu bırakır ve ona vesvese verir. Nevevı \"lev=keşke\" kelimesinin geçmişle ilgili olarak kullanıldığını ileri sürerek Kadı Iyaz'ı tenkit etmiş ve buna \"Sonradan bildiğimi önceden bilseydim kurbanlık sevk etmezdim\" hadisini örnek vermiştir. Doğru olanı, sözkonusu ifadenin fayda olmayan yerlerde kullanılmasının yasak olduğudur. İnsan bu cümleyi, Allah'a itaat konusunda yapamadıklarına karşı üzüntüsünden veya elde etmesi imkansız olan bir şeye içinin yanmasından ve benzeri şeylerden söylediği takdirde bunda herhangi bir sakınca yoktur. Hadislerde yer alan kullanımların ekserisi bu şekilde yorumlanır. Kurtubı el-Müfhim isimli eserinde şöyle demiştir: Müslim'in rivayet ettiği hadisten maksat, kaderde olan şeyin kişinin karşısına çıkmasından sonra yapılması gereken tek şey, Allah'ın emrine teslimiyet, takdir ettiğine razı olmak ve elden kaçana iltifat etmekten yüz çevirmektir. Zira kişi elden kaçırdığı şeyi düşünüp, 'Şöyle şöyle yapsaydım, şöyle şöyle olurdu' diyecek olursa ona şeytanın vesveseleri gelir ve bu sürüp giderek sonunda kişiyi hüsrana götürür. Böylece insan tedbirin takdirden daha önce geleceği vehmine kapılır. İşte bu, \"'Keşke' demekten sakın. Zira 'Keşke' şeytana faaliyet kapısı açar\" ifadesiyle şeytanın faaliyetlerine kapı aralayan yasak edilmiş vesilelerdir. Yoksa maksat, \"lev=keşke\" kelimesini mutlak olarak kullanmamak değildir. Zira Nebi Sallallahu Aleyhi ve Sellem bu kelimeyi birçok hadisinde kullanmıştır. Fakat bu kelimenin kullanılma yasaklığının yeri, kişinin sözkonusu mani ortadan kalksaydı kaderde olanın aksi olurdu inancıyla birlikte kadere karşı gelme şeklinde kullanılmasıyla ilgilidir. Yoksa kişinin maniyi gelecekte fayda olacak bir açıdan haber vermesiyle ilgili değildir. Zira bu gibi şeylerin söylenmesinin caiz olduğu noktasında ihtilaf yoktur ve bunda şeytana faaliyet kapısı açma olmadığı gibi, haramlığa götürecek bir şey de yoktur. \"Resulullah Sallallahu Aleyhi ve Sellem bir gece yatsı namazını gece karanlığı olan ateme vaktine kadar geciktirdi.\" Bu hadisin geniş bir açıklaması SaıM Bölümünde geçmişti. Aişe r.anha'nın Kabe'nin duvarıyla ilgili olan hadisinin geniş bir açıklaması Hac bölümünde geçmişti. Hadisten burada kastedilen \"Senin kavmin Kureyş cahiliye devrine yakın olmasaydı, ben Hicr-i İsmail'i bey te katmak, beytin kapısını da yer seviyesine indirmek isterdim. Fakat böyle yapıldığında kavminin kalplerinin kırılmasından endişe ederim\" cümlesidir. Ebu Hureyre'nin naklettiği \"Hicret olmasaydı ben muhakkak Ensardan bir kişi olurdum\" ve \"Eğer insanlar bir vadiye Ensar bir başka vadiye veya bir dağ yoluna girseydi\" ifadelerinin açıklaması Huneyn Gazvesi başlığı altında geçmişti",
			"grades": [],
			"reference": {
				"book": 94,
				"hadith": 20
			}
		}
	]
}