{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7274,
			"arabicnumber": 7274,
			"text": "Ebu Hureyre'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Hiçbir Nebi yoktur ki ona insanlığın gördüğünde emin olmasına -veya iman etmesine- sebep olacak bir mucize verilmiş olmasın. Bana verilen ise Yüce Allah'ın bana vahyettiği vahiydir. Ben kıyamet günü o Nebilerin içinde mensubu en kalabalık olanı olacağımı umarım.\" Fethu'l-Bari Açıklaması: \"Nebi Sallallahu Aleyhi ve Sellem'in ben cevamiu'l-kelim ile gönderildim sözü.\" İmam Buhari bu konuda Ebu Hureyre'den iki hadise yer vermektedir. Bunlardan birisi yukarıdaki başlıkta yer alan ifade ile naklediimiştir. Buhari bu cümleye hadisin devamını şu şekilde eklemiştir: \"Bana (bir aylık mesafedeki düşmanın gönüllerine) korku salmak suretiyle yardım edildi. Bir de ben uyuduğum sırada bana yeryüzünün hazinelerinin anahtarları getirildi de benim elime konuldu\" Cevamiu'l-kelimin açıklaması Tabir Bölümünde \"Rüyada Elde Anahtarlar Görme\" başlığı altında geçmişti. Orada bu ifadenin Zührl'den nakledilen tefsiri yer almaktaydı. Kısaca söylemek gerekirse Nebi Sallallahu Aleyhi ve Sellem sözcükleri az, ancak ifade ettiği mana çok olan bir ifadeyle konuşurdu. Zührı'den başkası \"cevamiu'l-kelim\" tabirinden maksadın, '\\::.=gönderildim\" cümlesinin karinesi ile Kur'an olduğunu ifade etmiştir. Kur'an kısa söz ve geniş mana açısından bir zirvedir. \"Düşmanların kalbine korku salmakla yardım olundum\" ifadesinin açıklaması Teyemmüm Bölümünde geçmişti. \"Şimdi siz bu hazineleri iştahla yiyorsunuz.\" Bu ifade önceki zikredilen isnada bitişiktir. Burada yer alan \"Jj=geçti gitti\" yani öldü anlamındadır. \"Ebu Hureyre burada 'telğasuneha' veya 'terğasuneha' ya da buna benzer bir fiil kullandı.\" En uygun olanı bu kelimenin \"er-regas\" kökünden türemiş olduğudur. Bu refah içinde yaşamanın kinayeli anlatımıdır. Aslı \"regase'l-cedyu ümmehu\" ifadesinden türemedir ki bunun manası, oğlak anasını emdi demektir veya kelime \"ergasethu\" fiilinden türemedir ki manası annesi oğlağı emzirdi demektir. İbn Battal şöyle demiştir: \"el-legas\" köküne gelince, bunu karıştırdığım sözlüklerde bulamadım. Ben onun kitabındaki bir haşiyede bu iki kelimenin sahih birer sözcük olduklarını ve manalarının \"bir şeyi iştahla yemek\" olduğunu gördüm. Nevevı şöyle der: Yeryüzünün hazineleriyle kastedilen Müslümanların önüne açılacak olan dünyalıklardır. Bu, ganimet ve hazineleri kapsamaktadır. \"İnsanlığın gördüğünde emin olmasına -veya iman etmesine- sebep olacak bir mucize verilmiş olmasın.\" Bu hadisin geniş bir açıklaması -hamdolsun Allah'a- Fedailu'l-Kur'an bölümünün baş taraflarında geçmişti. \"Bana verilen ise\" ifadesindeki \"hasr\" şurdan kaynaklanmaktadır. Kur'an, mucizelerin en büyüğü, en faydalısı ve en devamlı alanıdır. Zira bu kitap, zamanın sonuna kadar içinde daveti, hücceti ve devamlı yararı bulundurmaktadır. Ona faziletçe eşit olmak şöyle dursun yakın olan bir şey bile bulunmadığına göre onun dışındaki şeyler yok hükmündedir. Bilginlerin cevamiu'l-kelime örnek olarak verdikleri ayetler arasında şu iki ayet de vardır: \"Eyakıl sahipleri kısasta sizin içi,n hayat vardır. \"(Bakara 179) \"Her kim Allah 'a ve Resulüne itaat eder, Allah'a saygı duyar ve ondan sakmırsa işte asıl bunlar mutluluğa erenlerdir.\"(Nur 52) Bunun dışında başka ayetleri sıralamak da mümkündür. Hadisten cevamiu'l-kelim örnekleri arasında Aişe r.anha'nın rivayet ettiği \"Bizim prensibimiz üzere olmayan her iş (sahibine) reddedilir\"(Buhari, İ'tisam; Müslim, Akdiyye) hadisi ile \"Allah'm kitabında bulunmayan her şart batıldır\"(Buhari, Şurut; Müslim, itk) hadisi ve Ebu Hureyre'nin rivayet ettiği \"Size bir şeyi emrettiğimde onu gücünüz yettiği kadar yapınız\" hadisidir. Bu hadisin açıklaması yakında gelecektir. Bir diğer hadis ise Mikdam'ın naklettiği \"Ademoğlu karnından daha kötü bir kabı doldurmamıştır\" hadisidir.(İbn Mace, et'ime; Tirmizi, Zühd) Bu hadisi Sünen imamları rivayet etmişlerdir. İbn Hibban, Hakim ve hadisleri çokça araştıran daha başka bilginler sahih olduğunu ifade etmişlerdir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 7
			}
		}
	]
}