{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7305,
			"arabicnumber": 7305,
			"text": "İbn Şihab'ın nakline göre Malik b. Evs en-Nasri-Muhammed b. Cübeyr b. Mut'im bana onun hakkında bir şeylerden söz etti- şöyle demiştir: \"İmam Malik'in huzuruna girdim ve ona bu konuyu sordum. Bana dedi ki: Ben yola çıktım ve Ömer'in huzuruna girdim. Yanına yırtığını yamamak üzere muhafızı içeri girdi ve ona dedi ki: \"Osman, Abdurrahman, ZUbeyr, Sa'd huzurunuza girmek için izin istiyorlar.\" Ömer \"tamam\" dedi ve ismi geçen kişiler içeri girdiler. Ömer'e selam verip, oturdular. Muhafız, \"Ali ve Abbas'ın içeri girmesine izin verir misin?\" dedi. Ömer onlara da izin verdi. Abbas \"Ey mu'minlerin emiri! Benimle zalim arasında -iki kişiden her biri diğerinin kendisine haksızlık ettiğini iddia ediyordu- hükmünü verir misin dedi. Önceki gelenler yani Osman ve arkadaşları, \"Ey mu'minlerin emiri! Onların arasında hükmünü ver ve birini diğeri karşısında rahata kavuştur\" dedi. Ömer \"Sakin olun, acele etmeyin\" dedikten sonra gökyüzünün ve yerin, izniyle ayakta durduğu Allah adına soruyorum. Resulullah Sallallahu Aleyhi ve Sellem'in \"Bizler miras bırakmaylZ, geriye bıraktığımız sadakadır -burada Resulullah Sallallahu Aleyhi ve Sellem kendini kastetmektedir-\" buyurduğunu biliyor musunuz? Heyet \"Evet, Resulullah Sallallahu Aleyhi ve Sellem böyle buyurmuştur\" dedi. Ömer, Ali ve Abbas'a yönelerek \"Allah aşkına soruyorum. Resulullah Sallallahu Aleyhi ve Sellem'in böyle buyurduğunu biliyor musunuz?\" dedi. Ömer ve Abbas \"evet\" diye cevapladılar. Ömer \"Ben bu konu hakkında size açıklamada bulunacağım. Yüce Allah, Resulüne bu maldan bir payayırmıştır ki bunu ondan başka hiç kimseye vermemiştir. Yüce Allah 'Allah'ın, onlardan (mallarından) Nebiine verdiği ganimetler için siz at ve deve koşturmuş değilsiniz' (Haşr 6) buyurmuştur. Bu ganimet sırf Hz. Nebie mahsustu. Öte yandan Allah'a yemin olsun ki o sizi bir yana bırakıp da buna kendi sahip olmadığı gibi, siz dışlayıp kendi nefsi için tercihte bulunmadı. Söz konusu ganimeti size verdi ve aranızda dağıttı. Sonunda o ganimetten işte bu mal geriye kaldı. Nebi Sallallahu Aleyhi ve Sellem ailesine bu maldan bir yıllık masrafını ayırıyordu. Sonra geri kalanını alıp, Allah'ın malı gibi değerlendiriyordu. Resulullah Sallallahu Aleyhi ve Sellem hayatı boyunca bu şekilde hareket etti. Şimdi size Allah adına soruyorum. Bunun böyle olduğunu biliyor musunuz?\" Onlar \"evet\" diye cevap verdiler. Sonra Ali ve Abbas'a dönerek ''Allah adına size soruyorum. Bunun böyle olduğunu biliyor musunuz?\" dedi. Onlar \"evet, sonra Allah Nebiini vefat ettirdi\" dediler. Bunun üzerine Ebu Bekir \"Ben Resulullah Sallallahu Aleyhi ve Sellem'in izinden gidiyorum\" dedi ve bu ganimeti alıp, ona Resulullah Sallallahu Aleyhi ve Sellem'in yaptığı uygulamayı yaptı. O zaman siz ikiniz -Ömer, Ali ve Abbas'a döndü- \"Ebu Bekir'in bu malda şu kadar hakkı vardır diyordunuz. Allah onun bu ganimet hakkında doğru, itaatkar, isabetli ve hakka uyan birisi olduğunu biliyordu. Sonra Allah Ebu Bekir'i vefat ettirdi ve ben 'Resullah'ın ve Ebu Bekir'in izinden gidiyorum' dedim ve o malı iki yıl kabzedip, Resulullah Sallallahu Aleyhi ve Sellem ve Ebu Bekir'in yaptığı gibi yaptım. Sonra ikiniz geldiniz. Sizin sözleriniz bir, işiniz bir aradadır. Sen bana gelmiş, kardeşinin oğlundan olan payını istiyorsun. Bu da bana gelmiş karısının babasından olan hissesini istiyor. Benim görüşüm şudur: Eğer dilerseniz sözkonusu malı ikinize vereyim ancak AIlah'ın ahdi ve misakı üzerinizde olmak ve onu Resulullah Sallallahu Aleyhi ve Sellem, Ebu Bekir ve hilafete geldiğim andan itibaren benim yaptığım şekilde harcamanız şartıyla' Aksi takdirde bu mal hakkında benimle konuşmayınız. Sizler ise şöyle dediniz: O malı bu şartla bize ver. Ben de bu şartla onu size verdim. Allah için soruyorum. Onu size bu şartla mı verdim? Topluluk \"evet\" dediler. Ömer, Ali ve Abbas'a dönerek \"Allah aşkına soruyorum, malı size bu şartla mı verdim?\" diye sordu. Onlar \"evet\" dediler. Ömer \"Benden bunun dışında bir hüküm istiyor musunuz? Göğün ve yerin izniyle ayakta durduğu Allah'a yemin ederim ki bu mal hakkında kıyamete kadar bunun dışında başka bir hüküm vermeyeceğim. Şayet bu şartla malı kullanmaktan aciz olursanız onu bana verin ve ben sizin yerinize onu işleteyim.\" Fethu'l-Bari Açıklaması: \"Müslümanların verdikleri zimmet birbirine eşittir.\" Bununla ilgili açıklama cizye ve Muvadea Bölümünde geçmişti. \"Fe men ahfera\" yani kim hıyanet ederse demektir. \"Resulullah Sallallahu Aleyhi ve Sellem bir harekette bulundu ve bunda ruhsatı tercih etti. Ancak bazıları (Resulullah s.a.v.'in yaptığı gibi yapmayıp) bundan kaçındı.\" Burada kastedilen şudur: İster azimet, isterse ruhsat konusunda olsun hayır, daima Resulullah s.a.v.'e uymadadır. Resulullah s.a.v.'e uymak maksadıyla haberin varid olduğu yerlerde ruhsata göre hareket etmek, azimete göre hareket etmekten daha iyidir. Hatta belki de azimeti kullahmak bu durumda tercih edilmeyen bir şık bile olabilir. Tıpkı yolculuk halinde namazı tam kılmakta olduğu gibi. Dahası mest üzerine mesh vermeyi terketmek örneğinde olduğu gibi sünnetten yüz çevirme sözkonusu olduğunda böyle bir hareket kınanmış bile olur. İbn Battal, hadiste sözü geçen kaçınanların yapmadıkları hareketin oruçlu iken eşini öpmek olduğuna işaret etmiştir. Bir başkası ise herhalde bu yolculuk halinde oruç tutmamaktır demiştir. İbnü't-Ti'n'in nakline göre Davudi' şöyle demiştir: Resulullah s.a.v.'in ruhsata göre hareket ettiği şeylerden kaçınmak, günahların en büyüklerindendir. Çünkü böyle bir kimse kendi şahsın! Resulullah Sallallahu Aleyhi ve Sellem'e göre Allah'tan daha çok korkuyor görmektedir. Bu dini ve Nebii inkar etmektir (ilhad). Biz de şunu ekleyelim: Buna inanan kimsenin dini ve Nebii inkar ettiğinde hiç şüphe yoktur. Fakat hadiste işaret edilen kimselerin uzaklaşmaya çalıştıkları şahsiyet geçmiş ve gelecek günahları bağışlanan Nebidir. Yani o bir konuda ruhsata göre hareket ettiğinde günahları bağışlanmamış bir başkası gibi değildir. Dolayısıyla günahları bağışlanmamış olan kimse kurtuluşa ermek için azimeti ve sıkı olan uygulamayı almaya muhtaçtır. Netice olarak Resulullah s.a.v. onlara şunu bildirdi: Yüce Allah her ne kadar geçmiş ve gelecek günahlarını bağışlamış olsa bile o yine de Allah'tan en çok korkan ve sakınan birisidir. Nebi Sallallahu Aleyhi ve Sellem, azimet ve ruhsata göre hareket etse bile yine de takva ve huşunun zirvesindedir. Yüce Allah'ın ona bağışlanma ihsan etmesi, kendisini şükreden bir kulolmak için amelinde ciddiyeti bırakmaya sevk etmemiştir. O her ne kadar amelinde ruhsatı tercih etse bile bu faal ve aktif olarak am el edebilmesi için azimete yar iımcı olmaya yöneliktir. \"Sanki sırdaşı gibi sessizce konuşurdu.\" Burada geçen \"es-sirar\" gizli söz demektir. Sır verme anlamına gelen \"el-müsarera\" bu kökten gelmedir. Beşinci hadisin yani Aişe r.anha'nın naklettiği Ebu Bekir' e insanlara namaz kıldırması emri ve Aişe r.anha ile Hafsa'nın Resulullah s.a.v.'e başvurmalarını konu alan hadisin geniş bir açıklaması Namaz Bölümünde İmamet başlığı altında geçmişti. Hadise burada yer verilmesinden maksat, Resulullah Sallallahu Aleyhi ve Sellem'in emrine aykırı davranmanın kınanmış olduğunu açıklamaktır. Altıncı hadisin yani Sehl b. Sa'd'ın Lianla ilgili naklettiği hadisin geniş bir açıklaması, Lian Bölümünde geçmişti. Hadise burada yer verilmesinin amacı \"Resulullah Sallallahu Aleyhi ve Sellem bu sorulardan hoşlanmadı ve soruyu ayıpladı\" ifadesidir. Malik b. Evs'in, Abbas ve Ali'nin, Ömer'in huzurunda Resulullah s.a.v.'in sadakası konusundaki çekişmeleri ile ilgili naklettiği yedinci hadisin geniş bir açıklaması Humus Bölümünde geçmişti. Hadise burada yer verilmesinin gayesi çekişmenin çirkinliğini açıklamaktır. İbn Battal şöyle demiştir: Bu bölümde zikredilen hadisler aşırı gitme, zorlama ve çekişmenin çirkinliği şeklindeki İmam Buharl'nin attığı başlığa uygun hadislerdir. Bu hadislere yer verilmesi yasaklığın ardından visal orucu tutmaya devam eden kimsenin kınanan bir kişi olduğuna işaret etmek içindir. Ayrıca Hz. Ali'nin kendisi hakkında aşırıyı kaçıp, Resulullah s.a.v.'in dini konularda başkalarına vermediği birtakım bilgileri sırf kendisine verdiğini iddia eden kimseyi kınadığına işaret edilmiştir. Bunun yanında Nebi Sallallahu Aleyhi ve Sellem'in ruhsata göre hareket ettiği konularda sıkı davranan kimsenin kınanmasına işaret edilmiştir. Temim oğulları olayında tartışmaya yol açan çekişme ve Ebu Bekir'le Ömer'in birbirlerine muhalefet kast ı güttüğü yolundaki iddialarının kınanması yer almıştır. Bu haberde insanı tefrikaya veya düşmanlığa sevkeden her türlü durumun kınanacak bir durum olduğuna işaret vardır. Aişe r.anha hadisinde Ebu Bekir'in Resulullah Sallallahu Aleyhi ve Sellem'in makamına durmasından dolayı korkmuş olduğu şeyler konusunda zorlamanın kınanmasına işaret edilmektedir. İbnü't-Tin şöyle der: Bu rivayette geçen \"istebba\" fiilinin anlamı, taraflardan her biri diğerinin kendisine haksızlık ettiği iddiasında bulundu demektir. Bu rivayette davacı olan taraf, \"Benimle bu zalim arasında hüküm ver\" diyerek bunu açıkça ifade etmiştir. İbnü't-TIn şöyle devam eder: Onun insanlara zulmettiği varid değildir. Onun kastettiği bu olayla ilgili olarak yaptığı tevildir. Yoksa o Ali'nin bunun dışında Abbas'a kötü söylediğini kastetmemektedir. Zira o babasının ikiz kardeşi idi. Ayrıca Abbas da bunun dışında Ali'ye kötü söylememişti. Zira o Ali'nin faziletini ve kendisinden daha önde olduğunu biliyordu",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 36
			}
		}
	]
}