{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7313,
			"arabicnumber": 7313,
			"text": "Cabir b. Abdullah r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem'e \"Deki onun sizin üstünüzden bir azap göndermeye gücü yeter\" ayeti inince Resulullah Sallallahu Aleyhi ve Sellem \"Rabbim senin zatına sığınırım!\" dedi. \"Yahut ayaklarınızın altından bir azap göndermeye kadirdir\" ifadesinden sonra \"Senin zatına sığınırım!\" dedi. \"Veya birbirinize düşürüp, kiminize kiminizin hıncını tattırmaya gücü yeter\" ayeti inince \"Bu iki özellik daha hafiftir -veya- daha kolaydır!\" dedi. Fethu'l-Bari Açıklaması: İmam Buhari burada \"De ki o sizin üstünüzden veya ayaklarınızın altından bir azap göndermeye gücü yeter\" ayetinin inişi konusunda Cabir hadisine yer verdi. Bu hadisin geniş bir açıklaması En'am suresinin tefsirinde geçmişti. Bunun bir önceki başlıkla ilişkisine gelince, ümmetin tümünün değil, bir kısmının düşmanlarına galip gelmesi, aralarında farklılık olmasını gerekli kılmaktadır. Hatta bunlarıniçinden bir zümre belli bir niteliği almada tek başına kalmıştır. ÇÜnkü sözü edilen zümrenin galip gelmesi, -şayet kafirlere ise- iddia sabit olur. Bu ümmetten bir zümre üzerine de sözkonusu olduğunda farklılığın sübutunda bu, daha da belirgin olur. Buhari bundan sonra farklılığın asıl dayanağından söz etmiş ve Resulullah Sallallahu Aleyhi ve Sellem'in böyle bir farklılığın meydana gelmemesi isteğinde olduğunu bildirmiştir. Bunun üzerine Yüce Allah kendisine böyle bir farklılığın vuku bulacağına hükmettiğini ve onun takdir ettiği her şeyi ortadan kaldırmanın imkanı olmadığını bildirmiştir. İbn Battal şöyle der: Yüce Allah, Nebiinin ümmetinin verilecek bir azapla kökünün kazınmaması yolundaki duasına icabette bulunmuş, buna karşılık onları birbirine düşürmeme yani farklı fırkalara ayırmama ve bir kısmının hıncını savaş ve katl sebebiyle diğerine tattırmama duasına icabet etmemiştir. Bu da her ne kadar Allah'ın azabından ise de ümmetin kökünün kazınmasından daha hafif bir cezadır. Bunda mu'minlere kefeıret niteliği de vardır",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 44
			}
		}
	]
}