{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7315,
			"arabicnumber": 7315,
			"text": "İbn Abbas r.a. şöyle demiştir: Kadının biri Nebi (s.a.v.)'e gelerek \"Annem hac yapmayı nezretmişti, haccedemeden önce öldü. Şimdi ben onun adına hac yapabilir miyim?\" diye sordu. Resulullah Sallallahu Aleyhi ve Sellem \"Evet, annenin adına vekdleten hac edebilirsin! Bana söyler mİsin eğer onun üzerinde bir (kul) borcu olsaydı, sen onu öder miydin?\" diye sordu. Kadın \"evet\" dedi. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem ''Allah'ın hakkı olan borcu da ödeyiniz! Şüphe yok ki Allah hakkı ödenmeye başkalarından daha ziyade layıktır\" buyurdu. Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: \"Teşbih\" ve \"temsil\" Araplara göre kıyastır. Müzeni bu iki hadisi kıyası inkar edenlere delilolarak zikretmiş ve şöyle demiştir: Kıyası ilk inkar eden İbrahim en-Nazzam olup, bazı Mutezile alimleri de ona uymuştur. Fakih olduğu söylenenlerden kıyası inkar eden kişi, Davud b. Ali olmuştur. Topluluğun üzerinde ittifak ettiği görüşün delil gücü vardır. Sahabiler ve onlardan sonra gelen tabiun nesli ve belli başlı beldelerdeki fıkıh bilginleri (fukahau'lemsar) kıyas yapmışlardır. Başarılı kılacak olan yalnız Yüce Allah'tır. İmam Şafii kıyasa taraftar olanların şartlarını zikretmiş ve şöyle demiştir: Kıyas yapacak kişinin Allah'ın kitabından ahkamı, kitabın nesh eden ayetini, neshedileni, hükmü genel alanını (amm) ve kapsamı dar alanını (hassını) bilmesi şarttır. Kıyas yapacak kişi, tevile ihtimali olan şeye sünnet ve icma ile delil getirir. Bu iki kaynaktan delil yoksa Allah'ın kitabında olana kıyas yapar. Bu konuda ayet yoksa sünnette bulunan hükme kıyas yapar. Sünnette de yoksa selef bilginlerinin üzerinde ittifak ettikleri, icma ettikleri ve muhalif olduğu bilinmeyen görüşe kıyas eder. Şafii şöyle devam eder: İlmin herhangi bir konusunda bu dayanaklardan herhangi biri olmadıkça söz söylemek caiz değildir. Hiç kimsenin kendisinden önceki sünnetleri, selef bilginlerinin sözlerini, alimlerin iemaını, ihtilaflarını, Arap dilini bilmedikçe kıyas yapması caiz değildir. Sağlığı yerinde olan akıl, birbirine benzer olan şeyleri birbirinden ayırır ve acele etmez. Kendisine muhalif olanları dinler ki şayet gaflete düşmüşse böylece ona karşı uyanık olur. Bu konuda olanca gücünü harcar ve kendi nefsine insaflı davranır ki söylediğini nereden söylediğini bilsin. İhtilaf iki çeşittir. Nassa dayanan görüş hakkında ihtilafta bulunmak helal değildir. Tevile muhtemelolan ya da kıyasla kavranan şeylerde tevil eden veya kıyasta bulunan kimse, ihtimale açık bir manayı benimser. Bir başkası da ona muhalif olur. Ben demiyorum ki o, muhalifini nassa muhalif olanı sıkıştırdığı gibi sıkıştırabilir. Kıyas yapabilme gücü olan bilginler kıyas yapıp, ihtilafa düştüklerinde her biri kendi içtihadına göre konuşabilir. Böyle bir kimsenin içtihadıyla ulaştığı kanaat konusunda bir başkasına tabi olması caiz değildir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 46
			}
		}
	]
}