{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7321,
			"arabicnumber": 7321,
			"text": "Abdullah b. Mes'ud'un nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Adem oğullarından herhangi bir kimse haksız yere öldürülürse muhakkak ilk Ademoğlu Kabil üzerine onun günahından bir pay ayrılır.\" -Humeydi dedi ki: Ravi Süleyman İbn Uyeyne, \"Onun kanından\" da demiş olabilir- \"Çünkü Adem'in oğlu bu öldürme cinayetini ilk adet ve yol yapan kimsedir. Fethu'l-Bari Açıklaması: \"İnsanları sapkınlığa çağıran kimsenin günahı...\" Çünkü Yüce Allah \"Kıyamet gününde kendi günahlarını tam olarak taşımaları ve bilgisizce saptırmakta oldukları kimselerin günahlarından da bir kısmını yüklenmeleri için (öyle derler)\"(Nahi 25) buyurmuştur. \"Kim sapkınlığa davet ederse\" hadisini Müslim, Ebu Davud ve Tirmizi, Ebu Hureyre'den şöyle rivayet etmişlerdir: Resulullah Sallallahu Aleyhi ve Sellem \"Kim hidayete davet edecek olursa kendi ecir ve sevabından hiçbir şey eksilmeksizin ona tabi olanların ecirleri kadarı o kişiye de verilir. Her kim de bir sapkınlığa davet edecek olursa kendi günahlarından hiçbir şey eksilmeksizin kendine tabi olanların günahlarının aynısı ona da yazılır. \"(Müslim, İlim; Ebu Davud, Sünne; Tirmizi, İlim) \"Kim köta bir çığır açarsa\" hadisini Müslim rivayet etmiştir.(Müslim, Zekat) \"Her kim İslamda güzel bir çığır açacak olursa kendisine tabi olanların ecirlerinden bir şey eksiltmeksizin onların amelinin sevabı kadar da kendisine verilir. Her kim İslamda kötü bir çığır açacak olursa o çığırdan yürüyenıerin günahlarından bir şey eksilmeksizin onların günahı kadar da kendisine yazılır. \"(Müslim, Zekat) Bu bölümdeki hadislerden Abdullah b. Mesud hadisine gelecek olursak, hadiste yer alan \"cemaatten ayrılan\" deyiminden maksadın ne olduğu Kısas bölümünde geçmişti. Mühelleb şöyle der: Bu ve bundan önceki bölüm sapıklıktan sakındırma, dinde bid'at ve sonradan uydurulmuş şeylerden kaçınma ve mu'minierin yoluna aykırı davranmayı yasaklama niteliklidir. Uyarı şu açıdandır: Dinde bid'at çıkaran kime'ilk başta basit bir şeyolduğu için bunu önemsemez ve bunun doğuracak olduğu mefsedeti dikkatten kaçırır. Sözünü ettiğimiz mefsedet, kendisinden sonra gelip, buna göre amel edenlerin günahını üstlenmiş olmasıdır. Kendisi o bid'ate göre amel etmiş olmasa bile onu uydurmada asıl unsur olduğu için bunu üstlenecektir",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 51
			}
		}
	]
}