{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"96": "Holding Fast to the Qur'an and Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7363,
			"arabicnumber": 7363,
			"text": "Abdullah b. Abbas r.a. şöyle demiştir: Sizler ehl-i kitaba herhangi bir şeyi nasıl soruyorsunuz? Halbuki Resulullah Sallallahu Aleyhi ve Sellem'e indirilmiş olan kitabınız, kitapların en yenisidir. Sizler onu halis olarak ve (içine başka hiçbir şey) karışmamış olduğu halde okumaktasınız. (Bu kitap) ehl-i kitabın Allah'ın kitabını tebdil edip, değiştirdiklerini, kitabı kendi elleriyle yazdıklarını ve onu verip az bir bedeli almak için 'Bu Allah katındandır' dediklerini sizlere söylemiştir. Dikkat edin! Size gelmiş olan ilim, onları sorma yasağı getirmiyor mu? Vallahi biz onlardan hiçbir kimseyi size indirilmiş olan kitap hakkında size soru sorarken görmüş değiliz! Abdurrezzak'ın Hureys b. Zahir'den nakline göre Abdullah b. Abbas şöyle demiştir: \"Ehl-i kitaba (dininiz hakkında herhangi bir şey) sormayınlZ. Çünkü onlar, nefislerini saptırmış kimseler olarak sizlere doğru yolu asla göstermeyeceklerdir. (Onlara uyarsanız) ya hakkı yalanlarsınız ya da bir batılı doğrularsınız.\"(Abdurrezzak, Musannef, VI, 111) Süfyan es-Sevri bu haberi bu isnatla ancak şu lafızia nakletmiştir: \"Ehl-i Kitaba herhangi bir şey sormayınız' Çünkü onlar sapıtmış kimseler olarak bir hakkı yalanladığınız veya bir batılı doğru!adığınız yolunda uyarıda bulunarak size doğru yolu asla göstermeyeceklerdir.\" Bu haberin isnadı hasendir. İbn Battal'ın nakline göre Mühelleb şöyle demiştir: Sözkonusu yasaklık, ehl-i kitaba hakkında nas olmayan bir mesele hakkında soru sormakla ilgilidir. Çünkü bizim şeriatımız kendisi ile yetinen bir dindir. Bizim dinimizde herhangi bir nas bulunmadığında nazar (düşünme ve tefekkür) ve istidlal, onlara soru sormaya ihtiyaç bırakmaz. Sözkonusu yasaklığa bizim şeriatımızı tasdik eden haberlerle, geçmiş milletlere dair haberler hakkında soru sormak dahil değildir. Yüce Allah'ın \"Senden önce kitabı okuyanlara sor\"(Yunus 94) ayetine gelince, bundan maksat, ehl-i kitabın iman edenleridir. Yasaklık ise onların içinden iman etmeyenıere soru sormaktır. Emrin tevhid ve Muhammedi risalet ve benzeri konularla ilgili olması, yasaklığın bunun dışındaki şeylerle bağlantılı olması ihtimali de mevcuttur. \"Muaviye şöyle demiştir: Ka'bulahbar, ehl-i kitaptan bize haber verenlerin en doğru sözlüsü ise de bazen yalan söylemekte olduğunu da tecrübe etmekteyiz.\" Yani onun rivayetleriyle şahsı hakkındaki bilgiler arasında çelişki bulunmaktadır. Fethu'l-Bari Açıklaması: İbnü't-Tin şöyle demiştir: Bu, İbn Abbas'ın Ka'bulahbar hakkındaki \"Kendiliğinden değiştirdi ve yalana düştü\" şeklindeki ifadesine benzemektedir. Muaviye'nin sözündeki \"muhaddisın\" kelimesinden maksat, Ka'bulahbar gibi ehl-i kitaptan olan, sonra Müslüman olan kimselerdir. Ka'bulahbar, ehl-i kitaptan rivayette bulunurdu. Onlarına kitaplarına bakıp, orada olan şeyleri nakledenler de böyledir. İbnü't-Tin şöyle devam eder: Herhalde onlar da Ka'b gibi idiler. Ancak Ka'b onlardan çok daha basiretli ve sakınacağı şeyi çok iyi bilen bir kişi idi. İbn Hibban, Kitabu's-Sikat isimli eserinde şöyle der: Muaviye'nin maksadı, Ka'b'm yalancı olduğunu bildirmek değil, verdiği haberlerde zaman zaman hataya düştüğünü vurgulamaktır. Bir başkası ise şöyle demiştir: \"Li nebluve aleyhi=tecrübe etmekteyiz\" ifadesindeki zamir Ka'b yerine değil, kitap yerine kullanılmıştır. Yani kitaplarını değiştirip, tahrif ettikleri için içinde yalan yanlış şeyler yer almıştır. lyaz'ın bu konudaki görüşü şöyledir: Sözkonusu zamirin, \"kitap\", \"Ka'b\" ve yalan söylemek istemese ve kasıtlı davranmasa bile \"Ka'b'ın sözü\" yerine kullanılmış olması mümkündür. Zira \"yalan\" sözcüğünde kasıtlı olmak şart değildir. Tam tersine yalan, herhangi bir şeyi olduğunun aksine haber vermekten ibarettir. Bunda Ka'b'ı yalancılıkla cerh etmek niteliği yoktur. İbnü'I-Cevzi şöyle demiştir: İfadenin manası şudur: Ka'b'ın ehl-i kitabtan haber verdiği bazı şeyler asılsızdır. Yoksa cümlenin manası, Ka'b kasten yalan söylemektedir demek değildir. Çünkü Ka'b bilginlerin hayırlılarındandır. Bu, Zı Ra'ın oğullarından Ka'b b. Mati' b. Amr b. Kays olup, künyesi Ebu İshak'tır. O Nebi Sallallahu Aleyhi ve Sellem'in sağlığında yaşını başını almış bir kişi idi. Yahudi olup, onların kitaplarını biliyordu. Hatta ona Ka'bu'I-Habr veya Ka'bulahbar deniyordu. Onun İslama girmesi, Ömer'in zamanında olmuştur. Bazıları Ebu Bekir'in halifeliği döneminde olmuştur derler. Ka'b'ın Nebi Sallallahu Aleyhi ve Sellem'in döneminde Müslüman olduğunu ve hicretinin daha sonra gerçekleştiğini söyleyenler vardır. Bu görüşlerden birincisi, daha meşhurdur. Ka'b, Medine'ye yerleşmiş ve Hz. Ömer'in halifeliği döneminde Rumlarla çarpışmıştır. Sonra Hz. Osman'ın halifeliği sırasında Şam'a gitmiş ve onun halifeliği döneminde hicri 32 veya 33 ya da 34 yılında Humus'ta vefat edinceye kadar burada ikamet etmiştir. Vefat tarihlerinden birincisi daha çok kişi tarafından tercih edilmiştir. İbn Sa'd'ın Abdurrahman b. CUbeyr b. Nufeyr'den nakline göre Muaviye şöyle demiştir: Dikkat edin! Ka'bulahbar alimlerden biridir. Biz onun hakkında aşırıya gitmiş olsak bile onda denizler gibi ilim vardır. \"Ehl-i Kitap (Yahudiler) Tevrat'ı ibranice metni ile okurlar ve onu Arap diliyle Müslümanlara tefsir ederlerdi.\" Bu haber, aynı isnad ve metinle Bakara suresinin tefsirinde geçmişti. Buna göre \"ehl-i kitab\" deyiminden maksat, Yahudiler olmaktadır. Fakat bu hüküm genelolduğu için Hıristiyanları da kapsamaktadır. \"Ehli Kitab'ın sözlerini tasdik etmeyiniz, tekzip de etmeyiniz.\" Bu ifade başlıkta geçen hadisle çelişmez. Çünkü orada ehl-i kitaba soru sorma yasaklanıyordu. Burada ise onların sözlerini doğrulama ve yalanlama yasaklanmaktadır. İkinci haber ehl-i kitabın Müslümanlara haber vermek için söze başlamaları durumu ile ilgilidir diye açıklanmıştır",
			"grades": [],
			"reference": {
				"book": 96,
				"hadith": 90
			}
		}
	]
}