{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7375,
			"arabicnumber": 7375,
			"text": "Aişe r.anha şöyle demiştir: Nebi sallallahu aleyhi ve seııem birisini bir müfrezenin başında kumandan yapıp göndermişti. Bu zat arkadaşlarına kıldırdığı namazıarda Kur'an okur ve kıraatini her zaman \"Kul huvallahu ahad\" suresiyle bitirirdi. Müfrezeye katılanlar gazadan döndüklerinde (kumandanın bu adetini) Nebie zikrettiler. Resulullah saııallahu aleyhi ve sellem onlara \"Niçin böyle yapmakta olduğunu kendisine sorunuz\" buyurdu. Onlar da gidip bunu kendisine sordular. Kumandan \"Çünkü bu sure, Rahmanın sıfatıdır. Bu yüzden bu sureyi okumayı severim\" diye cevap verdi. (Gelip bu cevabı haber verdiklerinde) Nebi sallallahu aleyhi ve seııem \"Siz de ona Allah'ın kendisini sevmekte olduğunu haber veriniz\" buyurdu. Fethu'l-Bari Açıklaması: \"Allah'ı tevhid\"den maksat, onun bir ilah olduğuna şehadet ederek kendisini birlemektir. \"Şimdi sen ehl-i kitap olan bir kavim üzerine (vali) gidiyorsun.\" Söz konusu ehl-i kitap, Yahudilerdir. Yahudiliğin Yemen'e ilk girişi, Es'ad 21 Kerib zamanında olmuştur ki bu zat, İbn İshak'ın Sıret'incie uzun uzun anlattığı üzere Tübba' elAsgar'dır. İslam doğduğunda Yemen halkı Yahudilik inancı üzereydi. Hıristiyanlık dini Yemen' e daha sonra Habeşliler buraya galip olduklarında girdi. Bunlardan birisi de Mekke'yi fethetmeye kalkıp, Kabe'yi yıkmak isteyen fil sahibi Ebrehe idi. İbn İshak'ın geniş bir şekilde anlattığı üzere Seyf b. Zı Yezen onları buradan süpürüp atmıştır. Bundan sonra Yemen' de Necran hariç hiç Hıristiyan kalmamıştır. Necran, Mekke ile Yemen arasında bulunur. Yemen'in bazı beldelerinde ise Yahudilerden çok az bir nüfus kalmıştır. \"Şimdi sen ehl-i kitap olan bir kavim üzerine (vali) gidiyorsun ... \" Zekat Bölümünün ortalarında İsmail b. Ümeyye'nin Yahya b. Abdullah'tan naklettiği rivayete göre Resulullah sal1allahu aleyhi ve sellem; \"Oraya vardığında ilk vazifen onları Allah'ı ibadete davet etmek olsun. Bunu öğrendiklerinde ... \" buyurmuştur. İmamu'l-Harameyn örneğinde olduğu gibi insana yönelik olan ilk vacip bilmektir diyenler bu rivayeti esas almışlardır. Onların bakış açısına göre emri ve yasaklığı getireni tanımadan emredilen şeylerden herhangi birisini ona sarılmak kastıyla yerine getirmek ve yasak edilen şeylerden herhangi birini ondan vazgeçmek amacıyla kaçınmak mümkün değildir. Ancak bu görüşü savunaniara marifet ancak düşünme ve akıl yürütme ile mümkün olur diye itiraz edilmiştir. İman Bölümünde bu görüşten vazgeçip, Yüce Allah'ın \"Sen yüzünü hanif olarak dine, Allah insanları hangi fıtrat üzere yaratmış ise ona çevir\"(Rum 30) ayeti ile \"Her dünyaya gelen fıtrat üzere doğar\" hadisini esas alan kimselerden söz etmiştik. Çünkü ayet ve hadisin zahiri ne göre marifet, fıtratın aslı olarak insanda mevcuttur. Bundan dışarı çıkmak, kişiye daha sonra arız olan bir durumdur. Zira Hz. Nebi sal1allahu aleyhi vesellem 'J!\\nne ve babası onu Yahudi ve Hıristiyan yapar\" demektedir. Hocamızın hocası Hafız Selahuddin el-Alal'nin açıklamasından bir kısmını okuduğumda özetle şunları görmüştüm: Bu mesele mezheplerin birbiriyle çeliştiği ve farklı görüşler benimsediği, ifrata tefrite düşenlerle, orta yolu benimseyenlerin bulunduğu bir konudur. Bir tarafta Allah'ın varlığını ispat ve ortağının bulunmadığını belirtme noktasında sırf taklitte bulunmak yeterli diyenler vardır. Ubeydullah b. el-Hasen el-Anberı, Hanbelllerden bir grup ve zahiriler bu görüşü benimsemişlerdir. Bunların içinde daha ileri gidip, deliller üzerinde düşünmeyi haram görenler olmuştur. Bunlar -ileride açıklanacağı üzere- büyük imamların kelam ilmini kınayıcı ifadelerine dayanmışlardır. İkinci görüş, herkesin imanının kelam ilmindeki delilleri bilmeye bağlı olduğunu savunan görüştür. Bu yaklaşım Ebu İshak el-İsferayınl'ye nispet edilir. İmam Gazzal1 şöyle demiştir: Bir grup ileri gitmiş ve sade müslümanların küfre girdiklerini ifade ederek şer'ı inançları kendi yazdıkları delillerle bilmeyen kimselerin kafir olduğunu ileri sürmüşlerdir. Bunlar Allah'ın geniş rahmetini daraltmışlar, cenneti kelamcılardan çok az sayıdaki bir zümreye mahsus kılmışlardır. Kurtubı el-Müfhim isimli eserinde açıklaması Ahkam Bölümünde geçen \"Allah katında erkeklerin en sevimsizi, husumeti şiddetli olan kimsedir\" hadisini açıklarken -bu hadis Müslim'in Sahih'inde ilim bölümünün baş taraflarında da yer alır (Müslim, İlim) şöyle der: Yüce Allah'ın buğzettiği bu kişi, husumetiyle hakkı kendisinden uzak kılmayı, fasit yaklaşımlar, zanna düşürücü şüpheler vasıtasıyla onu reddetmeyi hedefleyen kimsedir. Bunun en beteri kelamcıların çoğunluğunun yaptığı gibi usulü'd-din konusundaki husumettir. Zira onların büyük bir kısmı, Allah'ın kitabı, Nebiinin sünneti ve ümmetinin selefinin gösterdiği yollardan yüz çevirip, bid'at olan yollara, uydurulmuş terimlere, cedel kurallarına ve yapay birtakım şeylere sapmış olan kimselerdir. Dayandıkları görüşün büyük bir kısmı felsefi görüşlere veya laM tenakuzlara dayanmaktadır ki bunları esas alan kimseler bu yüzden baş edemeyecekleri birtakım şüphelere veya imanlarını götürecek birtakım kuşkulara düşmektedirler. Bunlardan içinde söz konusu şüphelerden en iyi uzaklaşa!1lar, en bilgili olanları değil, en cedelci olanlarıdır. Şüphenin fasit bir şeyolduğunu bilen nice alim vardır ki onu çözme gücüne sahip değildir. Şüpheden kopmuş nice nice kimseler vardır ki o şüphenin bilgisinin hakikatini kavramamıştır. Öte yandan bunlar öyle olmayacak şeyler işlemişlerdir ki bunlara ne aptallar razı olur ne de çoeuklar! Bunların imamlarından birçokları gittikleri yoldan dönmüşlerdir. Hatta İmamu'l-Harameyn'in şöyle dediği nakledilir: \"Büyük bir okyanusa girmiştim. Hakkı araştırma uğruna taklitten kaçmak için ilim ehli kimselerin yasak ettikleri her şeye dalıp çıktım. Şu anda geri döndüm ve artık selefin yaklaşımını benimsemekteyim.\" İmamu'l-Harameyn'in ifadesi budurveya mealen budur. İmamu'lHarameyn'in vefat ederken şöyle dediği nakledilir: \"Eyarkadaşlarım! Kelam ilmiyle meşgulolmayın! Kelam ilminin beni götürdü gü noktayı baştan bilecek olsaydım, bu ilimle meşgulolmazdım.\" Kurtubı de şöyle demiştir: Kelamcıların bir kimse akıl yürütmeden (istidlal) önce iki şeyden hangisinin hidayet olduğunu bilmez şeklindeki delilleri bizce kabul edilemez. Tam aksine öyle kimseler vardır ki daha ilk anda İslama gönülleri yatışır ve içleri açılır. Bunların içersinde akıl yürütme noktasında durup bekleyen kimseler vardır. Onun sözünü ettiği kimseler, bu ikinci şıkta yer alanlardır. Böyle bir kimsenin kendisini ateşten korumak için düşünmesi gerekir. Zira Yüce Allah \"Kendinizi ve ailenizi yakıtı insanlar ve taşlar olan ateşten koruyun\"(Tahrim 6) buyurmuştur. Bu kişinin kendisinden irşat isteyen herkese bu yolu göstermesi ve hakkın varlığına burhanlar getirmesi gerekir. Nebi s.a.v.'in dönemi ile ondan sonraki zamanlarda yaşayan selef-i salih in böyle hareket etmiştir. Nebi s.a.v.'i tasdik noktasında gönlünde şüphe olmayan ve nefsi Yüce Allah'ın bir lutfu ve kolay kılması sayesinde kendisinden delil istemeyen kimselere gelince, bunlar hakkında Yüce Allah \"Fakat Allah size imanı seudirmiş ve onu gönüllerinize seudirmiştir\"(Hucurat 7) \"Allah kimi doğru yola iletmek isterse onun kalbini İslama açar\"(En'am 125) demektedir. Burada sözü edilenler babalarını ve reisierini taklit eden kimseler değildir. Çünkü onların babaları veya başlarındaki reisieri küfre girse bunlar onların ardından gitmezler. Tam tersine şeriata muhalif bir söz işittikleri herkesten içlerinde nefret duyarlar. Ayetlere ve hadislere gelince, bunlar uymaları yasak edilen kimselere tabi olan ve tabi olmaları emredilenlere tabi olmaktan kaçınan kimseler hakkındadır. Yüce Allah, onlara iddialarına delil getirmeleri yükümlülüğünü koymuştur. mu'minler ise böyle değildir. Onlar bir delil getirmedikçe tabi olmalarını geçersiz kılan herhangi bir ifade gelmiş değildir. Allah'a ve Nebiine muhalif olan herkesin esasen dayanacağı hiçbir delil yoktur. Yüce Allah'ın onlara delil getirme yükümlülüğünü koyması kendilerini susturma ve aciz duruma düşürmek içindir. Getirdiği hususlarda Nebie tabi olan kimseye gelince, o kendisine emredilen hakka uymuştur. Onun gittiği yolun gerçek olduğuna delil vardır. O kişi sözkonusu burhanı açıklamayı ister bilsin, isterse bilmesin farketmez. Bunların içerisinde \"Yüce Allah akıl yürütmekten söz etmiş ve bunu emretmiştir\" diyenlerin görüşlerini kabul ediyoruz. Fakat bu, gücü yeten herkes için mendub ve güzel bir şeydir. Daha önce açıklandığı üzere gönlü tasdike yatışmayan kimse için de bir yükümlülüktür. Başarı Yüce Allah'tandır. Bir başkası şöyle demiştir: Selefin yolu daha salim, halefin yolu daha sağlamdır görüşü isabetli değildir. Çünkü bunu söyleyen kişi, selefin yolunun Kur'an'ın ve hadislerin lafızlarına bu konuda herhangi bir fıkıh ve anlayış sahibi olmaksızın sırf iman etmek olduğunu, halefin yolunun ise çeşitli mecazlarla hakiki manalarından çevrilmiş olan nasıarın manalarını bulup çıkarmak olduğunu zanneder. Bu görüşü savunan kimse böylece selefin yolunu bilmeme, halefin yolu konusunda iddiada bulunma sakıncasını kendisinde birleştirmiş olur. Oysa mesele onun zannettiği gibi değildir. Tam tersine selef, Yüce Allah'ı layıkı olduğu şekilde bilmekte ve ona son derece tazimde bulunup, emrine boyun eğmekte, iradesine teslim olmaktadır. Halefin yolunu tutan hiçbir kimse,- tevil ettiği şeyin Allah'ın iradesi olduğuna güven içinde değildir. Onun yaptığı tevilin sıhhatine kesin karar vermesi mümkün değildir. Kurtubi şöyle demiştir: Fetva imamlarıyla, onlardan önce geçen selef imamlarının benimsedikleri görüş budur. Bazıları fıtratın aslı hakkında söylenenlerle önce Hz. Nebiden, sonra sahabilerden mütevatir olarak nakledilen uygulamaları delil olarak göstermektedirler. Buna göre Hz. Nebi sallallii.hu aleyhi ve selle m ve sahabiler puta tapmakta olan kaba ve sert Arapların İslama girenlerinin Müslüman olduklarına hükmetmişler, onların kelime-i şehadeti ikrar etmelerini, delilleri öğrenmeyi zorunlu kılmaksızın İslamın ahkamını benimsemelerini kabul etmişlerdir. Gerçi onların birçoğu, herhangi bir delilin bulunması ve o delilin kendisine açık bulunması sebebiyle Müslüman olmuşlardır. Bunların birçoğu daha önce herhangi bir delil olmaksızın gönüllerinden Müslüman olmuşlardır. Hatta sırf ehl-i kitabın ileride bir Nebi gönderileceği ve kendisine muhalif olanlara galip geleceği yolundaki haberlerine dayanarak Müslüman olmuşlardır. Hz. Muhammed hakkındaki alametleri gördüklerinde Müslüman olmaya koyulmuşlar, onun söylediği her sözde, namaz, zekat ve başkaca davet ettiği şeyler konusunda kendisini tasdik edip, doğrulamışlardır. Ebü'l-Muzaffer b. es-Sem'anı de bu konuda kısaca şöyle der: Akıl hiçbir şeyi ne vacip kılar, ne de haram kılar. Aklın bu gibi şeylerde hiçbir fonksiyonu yoktur. Şeriat herhangi bir hükmü getirmek istemezse hiç kimseye hiçbir şey vacip olmaz. Zira Yüce Allah \"Biz bir Nebi göndermedikçe (kimseye) azap edecek değiliz. \"(İsra 15) \"İnsanların Nebilerden sonra Allah'a karşı bir bahaneleri olmasın\"(Nisa 165) demektedir. Bu konuda daha birçok ayet sıralamak mümkündür. Nebilerin davetinin detay (fürli') hükümleri beyan etmek için olduğunu iddia eden kimsenin Allah'a çağrıda bulunanın Nebi değil, akılolduğunu söylemesi gerekir ve yine böyle bir iddia sahibinin Allah'a davet açısından Nebilerin varlığıyla yokluğunun bir olduğunu ifade etmesi gerekir. Bu ise sapıklık olarak insana yeter. Biz aklın insanı tevhide götürdüğünü inkar etmiyoruz. Bizim kabul etmediğimiz nokta, aklın tek başına bu fonksiyonu yerine getirdiği ve akılolmaksızın Müslümanlığın geçerli olmadığı iddiasıdır. Sem'anl'nin ifadesini Ebu Davud'un İbn Abbas'tan naklettiği şu hadis teyit etmektedir: Adamın biri Resulullah Sallallahu Aleyhi ve Sellem'e \"Allah aşkına soruyorum. Allah'tan başka ilah olmadığına şehadet etmemiz, Lat ve Uzza'yı bırakmamız için seni Allah mı gönderdi?\" Resulullah Sallallahu Aleyhi ve Sellem\" evet\" deyince, o kişi Müslüman oldu. Bu haberin aslı, Dımam b. Salebe olayı bağlamında Buhari ve Müslim' dedir. İbn Abbas hadisinde buraya kadar zikredilenlerden başka sonuçlar da çıkmaktadır. Buna göre bir kMir kelime-i şehadetleri ikrar ettiği takdirde onun Müslüman olduğuna hükmedilir. Çünkü Allah'a ve Nebiine imanın gereği, onlardan gelen şeylerin tümünü tasdik edip, bunları üstlenmektir. Bunlar kelime-i şehadetleri tasdik eden kimse için hasıl olur. Bir kafir, mesela namaz gibi İslamın rükünlerinden herhangi bir şeyi tasdik ettiğinde bu hareketiyle Müslüman olur. \"Allah'ın kullan üzerindeki hakkı nedir bilir misin?\" Bu ifadenin geniş bir açıklaması Rikak Bölümünde daha önce geçmişti. Bu cümlenin bu bölümde yer alması \"Ona hiçbir şeyi ortak koşmamalandır\" ifadesidir. Çünkü tevhitten maksat budur. \"Kıraatini her zaman 'Kul huvallahu ahad' suresiyle bitirirdL\" İbn Dakık el-Iyd şöyle der: Bu, o sahabinin başka sure okuduğunu ve her rekatta ihlası okuduğunu göstermektedir. İfadenin zahirinden anlaşılan budur. O sahabinin kıraatini İhlas suresiyle tamamlanmış olması da muhtemeldir. Bu durumda İhlas suresi son rekata mahsus olur. Birinci ihtimale göre bir rekatta iki sureyi birlikte okumanın caizliği hükmü anlaşılır. Sözkonusu açıklama Salat Bölümünün zikredilen başlığı altında burada yeniden ele almaya gerek bıraktırmayacak şekilde geçmişti. \"Çünkü o Rahman'ın sıfatıdır.\" İbnü't-Tın şöyle der: O kişinin \"Çünkü bu sure, Rahmanın sıfatıdır\" demesi surenir. içinde Yüce Allah'ın isimlerinin ve sıfatlarının bulunmasından dolayıdır. Onun isimleri, sıfatlarından türemiştir. Bir başkası şöyle der: Sözü edilen sahabinin bu cevabı vermesi Hz. Nebiden duyduğu bir şeye bağlı olabilir. Bu, ya açıkça belirtilmiştir ya da o kişinin hüküm çıkarması yoluyladır. Beyhakl'nin Kitabu'l-Esma ve's-Sıfat isimli eserinde hasen isnadla nakline göre İbn Abbas şöyle demiştir: Yahudiler, Hz. Nebie geldiler ve ona \"Bize ibadet ettiğin Rabbini anlat\" dediler. Bunun üzerine Yüce Allah \"Kulhuvallahu ahad\"le başlayan ihlas suresini sonuna kadar indirdi. Resulullah Sallallahu Aleyhi ve Sellem onlara \"Bunlar aziz ve celil olan Rabbimin sıfatıdır\" dedi. Ubey b. Ka'b ise şöyle demiştir: Müşrikler Hz. Nebie \"Rabbini bize anlat\" deyince, İhlas suresi inmiştir. Bu haber İbn Huzeyme'de Tevhid Bölümünde yer almaktadır. Hakim haberin sahih olduğunu belirtmiştir. Bu bölümde yer verilen hadis, Yüce Allah'ın sıfatı olduğunu söyleyen bilginlerin lehine bir delildir ki çoğunluğun görüşü bu doğrultudadır. \"Siz de ona Allah 'ın kendisini sevmekte olduğunu haber veriniz.\" İbn Dakık el-Iyd şöyle der: Yüce Allah'ın ona muhabbet sebebi, o kişinin bu sureyi sevmesi olabilir. Bunun yanında söylediği sözün anlamı da olabilir. Çünkü o kişinin Allah'ın sıfatlarının zikrini sevmesi, inancının sahih olduğuna delildir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 5
			}
		}
	]
}