{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7377,
			"arabicnumber": 7377,
			"text": "Usame b. Zeyd r.a. şöyle anlatmıştır: Bizler Nebi Sallallahu Aleyhi ve Sellem'in yanında bulunuyorduk. Birden kızlarından birisinin gönderdiği haberci geldi. Kendisini ölmek üzere olan çocuğuna gelmesi için çağırıyordu. Nebi Sallallahu Aleyhi ve Sellem gelen kişiye \"Dön ve ona Allah'ın almak ve vermek istediği her şey kendisine aittir. Her şeyin onun nezdinde tayin edilmiş bir ömrü olduğunu haber ver ve ona söyle sabretsin ve bu sabrın ecrini ve sevabınI Allah'tan beklesin\" buyurdu. Nebi Sallallahu Aleyhi ve Sellem'in kızı haberciyi tekrar gönderdi \"Kızınız kendisine gelmeniz için yemin etti\" dedi. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem beraberinde Sa'd b. Ubade, Muaz b. Cebelolduğu halde kalkıp gitti. Hasta çocuk Nebi Sallallahu Aleyhi ve Sellem'in kucağına verildi. çocuğun nefesi hınltılı bir şekilde gidip gelmekte idi. çocuğun nefesi, sanki eski bir kırbaya dökülen su sesi gibi çıkıyordu. Nebi Sallallahu Aleyhi ve Sellem'in gözleri yaşlarla doldu. Sa'd b. Ubade (bu yaşları görünce) \"Ya Resulallah' Bu (yaş ve ağlama) nedir?\" dedi. Resulullah Sallallahu Aleyhi ve Sellem \"Bu (gözyaşı) Allah'ın kullarının kalplerine koyduğu bir rahmettir. Allah ancak kullarından merhametli ve şefkatli olanlara merhamet eyler\" buyurdu. Fethu'l-Bari Açıklaması: İmam Buhari bu konuda Cerır'in rivayet ettiği \"Allah, insanlara merhamet etmeyene merhamet etmez\" hadisine yer vermiştir. Bu hadisin geniş bir açıklaması, Edeb Bölümünde geçmişti. Buhari bir de Nebi Sallallahu Aleyhi ve Sellem'in kızının çocuğunun vefatı olayı ile ilgili olan Üsame b. Zeyd hadisine yer vermiştir. Bu hadisin geniş bir açıklaması Cenaiz Bölümünde geçmişti. İbn Battal şöyle der: İmam Buharl'nin hadise bu bölümde yer vermesi, rahmeti ortaya koymak içindir. Rahmet Yüce Allah'ın zatının sıfatlarından biridir. Rahman öyle bir vasıftır ki Yüce Allah bununla kendi nefsini nitelemiştir. Rahman, rahmet manasını içermektedir. Tıpkı onun alim olarak nitelenmesi ilim manasını içerdiği gibi. Buna başka örnekler vermek de mümkündür. İbnü't-Tın şöyle der: \"er-Rahman\" ve \"er-Rahim\", \"er-Rahme\" kelimesinden türemiştir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 7
			}
		}
	]
}