{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7378,
			"arabicnumber": 7378,
			"text": "Ebu Musa el-Eş'ari'nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle demiştir: \"Hiçbir kimse (kendisi hakkında) duyduğu eza (verici isnad ve iftira) ya Allah'tan çok sabırlı değildir. İnsanlar Allah'a oğul isnad ederler de sonra Allah yine onları (afetlerden) selamette kılar ve (her türlü nimetlerle) rızıklandırıp (yaşatır). \" Fethu'l-Bari Açıklaması: \"Hiçbir kimse (kendisi hakkında) duyduğu eza (verici isnad ve iftira)ya Allah'tan çok sabırlı değildir.\" Bu hadisin açıklaması Edeb Bölümünde geçmişti. Hadise burada yer verilmesinin sebebi \"onları (afetlerden) selamette kılar ve (her türlü nimetlerle) rızıklandmp (yaşatır)\" ifadesiyle \"isnad ederler\" cümlesidir. İbn Battal şöyle demiştir: Bu başlık, Yüce Allah'ın iki sıfatını içermektedir. Bunlar zatı sıfatlarıyla, mı sıfatıdır. Rızık vermek Yüce Allah'ın fiillerinden biridir. O, Allah'ın fiil sıfatlarındandır. Zira rızık veren niteliği, bir rızıklananın bulunmasını gerektirir. Yüce Allah ezelde vardı, ancak rızıklanan hiç kimse yoktu. Orada mevcut olmayan her şey sonradan olmadır (muhdes). Yüce Allah Rezzak olarak vasıftanmıştır. O mahlukatı yaratmadan önce kendisini Rezzak olarak nitelemiştir. Bu, rızıklanacak kimseleri yarattığında onlara rızık verecek anlamındadır. Kuvvet, Allah'ın zat sıfatlarındandır. Kuwet, kudret manasındadır. Yüce Allah her zaman kuvvet ve kudret sahibidir. Onun kudreti mevcuttur, zatı ile kaimdir ve ona kadir olanların hükmünü vermektedir. Ayette geçen \"el-metin\" kuvvetli anlamındadır. Kelime sözlükte sabit ve sahih olan manasınadır. Beyhaki şöyle demiştir: Kuvvetli ve kudreti tam olan bir varlığa hiçbir durumda acizlik nispet edilmez. Dolayısıyla kelimenin manası, kudret ve kadir köküne dayanır. Bu hüküm, \"Allah kudretle değil, kendi nefsiyle kadirdir. Çünkü \"kuvvet\" \"kudret\" manasındadır. Yüce Allah yukarıdaki ayette \"zülkuvve=kuvvet sahibi\" ifadesini kullanmaktadır\" diyen görüşü reddetmektedir. Hadiste yer alan \"asberu=en sabırlı\" kelimesi, sabır kökünden ism-i tafdildir. Yüce Allah'ın Esma-i hüsna'sından birisi de \"es-sabur=çok sabırlı\" sıfatıdır. Bunun manası asi olanlara acele ile cezalarını vermez demektir. Kelime \"el-halim\" sıfatına anlamca yakındır. \"el-Halim\" selamet konusunda ukubetten daha vurguludur. \"el-Eza\" kelimesinden maksat onun Nebilerine ve salih kullarına yapılan eziyettir. Zira yaratıkların ona eziyet vermeleri imkansızdır. Çünkü eziyet edilme, noksanlık sıfatıdır. Allah her türlü noksanlıktan münezzehtir. Yüce Allah intikamını herhangi bir kimsenin zorlaması altında kalarak değil, kendisinden bir lütuf olarak erteler. Allah'ın eşinin ve çocuğunun olmadığını söyleyen Nebileri yalanlamak, onlara eziyet vermek demektir. Eziyetin Allah'a izafe edilmesi onlara tepki koymada abartı ve sözlerinin vebalinin ne kadar ağır olduğunu vurgulamak içindir. Yüce Allah'ın \"Allah ve Resulünü incitenlere Allah dünyada ve ahirette lanet etmiş ve onlar için horlayıcı bir azap hazırlamıştır. \"(Ahzab 57) ayeti de bu kabildendir. Çünkü ayetin manası Allah'ın ve Resulünün dostlarını incitenler demektir. Bu durumda muzaf (tamlanan) muzafun i1eyh (tamlayan) yerine konulmuştur. İbnü'l-Müneyyir şöyle der: Bu ayetin hadisle uygunluk yönü Allah'ın kudretine delalet eden rızık ve kuvvet sıfatlarını kapsamasından dolayıdır. Rızıktan başlayacak olursak bu \"Rızıklandınp, yaşatır\" ifadesinde gayet açıktır. Kuvvete gelince, bu da \"Çok sabırlıdır\" ifadesinden anlaşılmaktadır. Çünkü kelimede kullar kendisine kötülük ettiği halde -insanların karakteri aksine- Yüce Allah'ın onlara ihsan etmeye kudreti olduğuna işaret vardır. İnsanoğlu ise -şer'an üstlenmesi hariç- kendisine kötü davranana iyilikte bulunma gücünü kendinde bulamaz. Bunun sebebine gelince, yok olma korkusu insanı derhal karşıdaki kişiye ceza ile ödül vermeye sevkeder. Yüce Allah şu anda ve gelecekte buna kadirdir. Onu hiçbir şeyaciz bırakamayacağı gibi yok da edemez",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 8
			}
		}
	]
}