{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7384,
			"arabicnumber": 7384,
			"text": "Enes'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle haber vermiştir: \"Cehenneme (kafirler) atılır durur. Cehennem de 'Daha ziyade var mı?' der. Nihayet alemlerin Rabbi ona ayağını koyar da cehennem bir kısmı diğerine dürülür. Sonra cehennem 'Ya Rab! Senin izzetine ve keremine yemin ederim ki yeter, yeter!' der. Cennet ise (içine girenlerle) devamlı artıp, büyür. Nihayet Allah onun (boşluğunu doldurmak) için yeniden birtakım halk yaratıp, bunları cennetin fazlalığına yerleştirir. \" Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: \"el-Azız\", \"el-izzet\" manasını içermektedir. el-İzzet, kudret ve azam et manasına zat! sıfat olma ihtimali bulunduğu gibi, mahlukatını kahr ve onlara galip olma manasında fiil sıfatı olma ihtimali de vardır. Bundan dolayı Allah'ın isminin ona izafesi isabetli olmuştur. İbn Battal şöyle devam eder: Allah'ın zatı sıfatı olan izzetine yemin edenle, fiili sıfatı olan izzetine yemin eden arasındaki fark, birinciye yemin etmek caiz iken, ikinciye caiz olmaması şeklindedir. ikinci manadaki izzet üstüne yemin etmek, \"hakkussema=semanın hakkı için\" ve \"ve hakkı Zeyd=Zeyd'in hakkı için\" yeminlerinde olduğu gibi yasak edilmiştir. Biz de şunu ekleyelim: Bir kimse mutlak olarak yemin ettiğinde bu Allah'ın zatı sıfatına yemin olarak anlaşılır ve yapılan yemin geçerli olur. Ancak kişi, bunun aksini kastetmişse bu bölümdeki hadislerin ışığı altında bu caiz olmaz. Rağıb şöyle demiştir: el-Azız, galip gelen ve yenilmeyen demektir. Allah'ın izzeti, daimi ve bakidir. Bu, hakiki ve övülen İzzettir. İzzet kelimesi bazen istiare yoluyla taraftarlık ve gurur anlamında kullanılır ve bununla kMir ve fasık nitelenir. Kelime bu manada kötü bir niteliktir. Yüce Allah'ın \"Benlik ve gurur kendilerini günaha sevkeder\"(Bakara 206) ifadesinde geçen \"el-izzet\" kelimesi, bu manada kullanılmıştır. Buna karşılık \"Kim izzet ve şeref istiyor idiyse bilsin ki izzet ve şerefin hepsi Allah'ındır\"(Fatır 10) ayetinde geçen \"el-izzet\" kelimesinin manası, her kim aziz olmak istiyorsa izzeti Allah'tan kazansın. Çünkü izzet onundur ve buna ancak ona itaatı e erilir demektir. Bundan dolayı Yüce Allah Nebiinin ve mu'minlerin izzeti olduğundan söz etmiş ve bir başka ayette \"Halbuki asıl üstünlük (izzet) ancak Allah 'ın, Nebiinin ve mu'minlerindir\" diye haber vermiştir.(Munafıkun 8) İzzet kelimesi bazen \"Sizin sıkıntıya uğramanız ona çok ağır gelir\"(Tevbe 128) ayetinde olduğu gibi zorluk anlamına kullanılır. Bazen de kelime galebe çalmak anlamındadır. \"azzenı fi'l-hitabi=Ve tartışmada beni yendi\"(Sad 23) ayetinde \"izzet\" kelimesi bu manada kullanılmıştır. Beyhaki'ye göre izzet, kuvvet manasına gelir ve kudret manasına döner. Beyhaki bundan sonra İbn Battal'ın ifadesine benzer açıklamalarda bulunur. Öyle anlaşılıyor ki Buharl'nin attığı bu başlıktan maksadı \"Allah ilimsiz bilendir\" dedikleri gibi \"O, izzet olmaksızın azizdir\" diyenlere cevap vermektir. \"Enes b. Malik'in nakline göre Nebi Sallallahu Aleyhi ve Sellem 'Cehennem 'izzetine yemin ederim ki yeter, yeter! diyecektir' demiştir.\" Bu, Kaf suresinin tefsirinde açıklamasıyla birlikte geçen merfu hadisin bir kısmıdır. Bundan maksat şudur: Nebi Sallallahu Aleyhi ve Sellem cehennem in Allah'ın izzeti üstüne yemin edeceğini nakletmiş ve onun bu hareketini kabul ve tasdik etmiştir. Konuşan ister gerçekten cehennem olsun, isterse ona vekil olanlar örneğinde olduğu gibi başkası konuşsun maksat hasıl olur. \"Ebu Hureyre şöyle demiştir: Bu, açıklamasıyla birlikte Rikak bölümünde eçen uzunca hadisin bir kısmıdır. \"Eyyub, 'İzzetine yemin ederim ki senin bereketine ihtiyaç duymama ihtimali m yoktur' demiştiL\" Bu, Ebu Hureyre'nin rivayet ettiği hadisin bir kısmıdır. Hadis, Tahara Bölümünde mevsul olarak geçmişti. Hadisin baş tarafı \"Eyyub Nebi mucizeli suda yıkandığı sırada ... \" şeklinde idi. Bu hadis, Enbiya bölümünde açıklamasıyla birlikte geçmişti. \"Halbuki cinler ve insanlar ölürler.\" Bu ifade, meleklerin ölmeyeceklerine delilolarak gösterilmiştir. Oysa hadiste bunu destekleyecek bir delil yoktur. Çünkü usul-i fıkıh'ta mefhum-ı lakaba itibar edilmez. Mefhum-ı lakabı geçerli kabul ettiğimiz takdirde ifade bundan daha güçlüsü ile çelişir. Sözkonusu güçlü ifade Yüce Allah'ın \"O'nun zatından başka her şey yok olacaktır\"(Kasas 88) ayetinin genelliğidir. Üstelik meleklerin cin ismin e dahil olmalarına herhangi bir mani yoktur. Zira onlar da cinler gibi insanlara görünmeyen varlıklardır. Bu konuda söylenecek diğer şeyler Daavat, Eyman ve'n-NüzCır Bölümlerinin işaret edilen başlıklarında geçmişti",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 14
			}
		}
	]
}