{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7385,
			"arabicnumber": 7385,
			"text": "İbn Abbas'ın nakline göre Nebi Sallallahu Aleyhi ve Sellem geceleyin şöyle dua ederdi: \"Allahumme leke'l-hamdu. Ente Rabbu's-semavati ve'l-ardi. Leke'l-hamdu. Ente kayyimu's- semavati ve'I-ardi. Kavluke el-hakku ve va'duke el-hakku ve likauke hakkun. Ve'l-cennetu hakkun ve'n-naru hakkun ve's-saatu hakkun. Allahumme leke eslemtu ve bike amentu ve aleyke tevekkeltu ve ileyke enebtu ve bike hasamtu ve ileyke hakemtu fağfirlf ma kaddemtu ve ma ahhartu ve esrartu ve a'lentu. Ente ilahi la ilahe li ğayruke! '' --------------------- Duanın meali:: Ya Rabbi! Hamd ancak sana mahsustur. Sen göklerin ve yerin Rabbisin. Hamd ancak sana mahsustur. Gökleri ve yeri ayakta tutan sensin. Senin sözün haktır. Vaadin haktır. Sana kavuşmak haktır. Cennet haktır, cehennem haktır. Kıyametin kopması haktır! Ya Allah! Yalnız sana teslim oldum, yalnız sana iman ettim. Yalnız sana güvenip dayandım. Yalnız sana döndüm. Yalnız senin burhanına dayanarak mücadele ettim. Yalnız seni hakem kıldım. Önceden yaptığım, sonradan yapacağım, gizlediğim ve açığa vurduğum bütün günahlarımı mağfiret eyle! Sen benim ilahımsın. Senden başka ilah yoktur! Fethu'l-Bari Açıklaması: İmam Buhari, bu başlıkla zikrettiği ayette yer alan \"bilhakkı\" ve hadiste zikri geçen \"kavluke el-hakku\" ifadesinin tefsirine işaret eder gibidir. \"Bilhakkl=Bi kelimeti'l-hakkı\" demektir ki bu da \"ol\" anlamında \"kün\" emridir. Buhari adeta \"el-kavl\" ifadesinden maksadın \"el-kelime\" olduğuna işaret eder gibidir ki bundan maksat -Yüce Allah daha iyi bilir- \"kün=ol\" emridir. İbn Battal'ın görüşü şöyledir: Burada yer alan \"bilhakkı\" ifadesinden maksat \"el-hezl=şaka\"nın zıttıdır. Esma-i hüsnada yer alan \"el-hakk\" kelimesi, zaH olup, yok olmayan ve değişime uğramayan sabit ve mevcut olan anlamındadır. Rağıb şöyle demiştir: Esma-i hüsnada yer alan \"el-hakk\", hikmetinin gereğine göre \"el-mevcCıd\" demektir. Rağıb şöyle der: Hikmet gereği onun fiilinden mevcut olan her şeye \"hakk\" denilir. Beyhakl'nin el-Esma ve's-Sıfat isimli eserinden nakline göre Halımı şöyle demiştir: \"el-Hakk\" inkan mümkün olmayan, varlığının tanınması ve itirafı gerekli olan demektir. Allah'ın varlığı itiraf edilmesi gerekli ve inkan caiz olmayan şeylerin en önde gelenidir. Zira Yüce Allah'ın varlığı hakkında zuhur ettiği kadar başka hiçbir varlık hakkında göz alıcı beyyine tezahür etmiş değildir. İmam Buhari bu konuda İbn Abbas'ın Resulullah Sallallahu Aleyhi ve Sellem'in gece namazındaki duasının zikredildiği hadise yer vermektedir. Bu hadiste \"Ya Rabbi! Hamd ancak sana mahsustur. Sen göklerin ve yerin Rabbisin!\" cümlesi yer almaktadır. Bu ifadenin açıklaması ve lafız farklılıklan Teheccüd Bölümünde geçmişti. İbn Battal şöyle der: Nebi Sallallahu Aleyhi ve Sellem'in \"Rabbu' s-semavati ve'l-ard=göklerin ve yerin Rabbisin\" cümlesinin anlamı, göklerin ve yerin yaratıcısısın demektir. \"Bilhakk\" Allah gökleri ve yeri hakla yoktan var etti demektir. Bu ifade tıpkı \"Rabbena ma halakte Mza batıla=Rabbimiz! Sen bunu boşuna yaratmadın\"(AI-i İmran 191) ifadesi gibidir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 15
			}
		}
	]
}