{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7389,
			"arabicnumber": 7389,
			"text": "Urve'nin, Aişe r.anha'den nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"(Ben Taiften eli boş döndüğümde) Cebrail bana nida edip şöyle dedi: Allah, kavminin senin hakkında dediklerini muhakkak işitti ve onların senin davetini reddetmelerini de işitti. \" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın 'Allah her şeyi işiten ve her şeyi görendir' sözü.\" İbn Battal şöyle demiştir: İmam Buharl'nin bu bölümden maksadı \"Seml'un basir\"in manası, \"alim=çok bilen\"dir diyenlere cevap ve reddiyedir. İbn Battal şöyle devam eder: Bu görüşü savunan kimsenin Allah'l gökyüzünün yeşil olduğunu bilip, onu görmeyen körle ve insanların birtakım sesleri olduğunu bilip, bunu duymayan sağırla bir tutması gerekir. Şüphe yok ki işiten ve gören, kemal sıfatı açısından bunlardan birine sahipken, diğerinden mahrum olandan daha mükemmeldir. Onun her şeyi işiten ve gören olması, çok bilen olmasına ilaveten daha fazla bir özellik ifade eder. Onun her şeyi işiten ve gören olması, kulakla işitip, gözle görmesini gerektirir. Tıpkı \"alim\" olmasının, ilimle biliyor olmasını gerektirdiği gibi. Onun her şeyi işiten ve gören olması ile kulak ve göz sahibi olması arasında hiçbir fark yoktur. İbn Battal bu, kesin olarak ehl-i sünnetin benimsediği görüştür demiştir. Beyhaki, el-Esma ve's-Sıfat isimli eserinde şöyle der: \"es-Semi'\" kulağı olup, işitilme özelliği olan şeyleri duyan, \"el-basir\" görülebilen şeyleri idrak ettiği bir göze sahip olan demektir. Bunların her ikisi Yüce Allah açısından kendi zat ı ile kaim bir sıfattır. Ayet-i kerime ve bu başlık altında yer alan hadisler, \"Allah'ın her şeyi işiten ve gören olmasının her şeyi bilen anlamına geldiğini iddia eden\" kimselere red anlamı taşımaktadır. Beyhaki bundan sonra Ebu Davud'un Müslim'in şartını taşıyan güçlü bir isnadla Ebu Yunus'tan naklettiği Ebu Hureyre hadisine yer verır. Buna göre Ebu Hureyre Nebi Sallallahu Aleyhi ve Sellem'in şu ayeti okuduğunu ifade etmiştir: \"Allah size mutlaka emanetleri ehli olanlara vermenizi ve insanlar arasında hükmettiğiniz zaman adaletle hükmetmenizi emreder. Allah size ne kadar güzel öğütler veriyor. Şüphesiz Allah her şeyi işiten ve her şeyi görendir.\"(Nisa,58) Ebu Hureyre bu ayeti okurken iki parmağını kullanmıştır. Ebu Yunus, Ebu Hureyre baş parmağını kulağına şehadet parmağını gözünün üstüne koydu demiştir.(Ebu Davud, Sünne) Beyhaki şöyle der: O bu hareketiyle insandaki bulunduğu yere işaret ederek Yüce Allah'ın kulağının ve gözünün var olduğuna işaret etmek istemiştir. Yine o, Allah'ın kulağının ve gözünün olduğunu vurgulamak istemiş, bundan maksadın ilim ve bilgi olmadığına işaret etmek istemiştir. Şayet böyle olsaydı, Ebu Hureyre kalbine işaret ederdi. Çünkü ilmin mahalli kalptir. Bu başlık altında üçüncü sırada zikredilen Abdullah b. Amr hadisine göre Ebu Bekir Sıddik \"Ya Resulallah! Bana bir dua öğret\" demiştir. Namazın Sıfatları başlığının son kısımlarında ve Daavat Bölümünde bu hadis açıklamasıyla birlikte geçmişti. İbn Battal hadisin Buhari'nin attığı başlıkla olan ilişkisine şöyle işaret etmiştir: Ebu Bekir'in Resulullah Sallallahu Aleyhi ve Sellem kendisine öğretirken yaptığı dua, Yüce Allah'ın onun duasını işitmesini ve karşılığında mükafatını vermesini gerektirmektedir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 18
			}
		}
	]
}