{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7390,
			"arabicnumber": 7390,
			"text": "Cabir b. Abdullah es-Selemi r.a. şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem sahabilerine işlerin hepsinde Kur'an'dan bir sure öğretir gibi istihare duasını öğretir, şöyle buyururdu: \"Herhangi biriniz bir işi yapmaya niyet ettiği zaman farz olmaksızın iki rekat namaz kılsın. Sonra şu duayı okusun: 'Allahumme inni estehiruke bi ilmike ve estekdiruke bi kudretike ve es'eluke min fadlike, fe inneke takdiru vela akdiru ve ta'!emu ve la a'lemu. Ve ente allamu'l-ğuyub. Allahumme fe in kunte ta'lemu haze'l-emre hayren Ii fi acili emri ve ecilihi -veya deki- fl dini ve meaşi ve akibeti emri fakduruhu li ve yessirhu li. Sümme barik Ii flh. Allahumme ve in kunte ta'lemu ennehu şerrun Ii fi dini ve meaşi ve akibeti emrı -veya deki- fi acili emri ve ecilihi fasrifni anhu vakdir li el-hayra haysu kane sümme raddını bihi Duanın meali: 'Allah'ım! Bildiğin için ben senden hayırlısını isterim ve gücün yettiğinden dolayı beni kudretlendirmeni isterim. Bunu senin fadlından istiyorum. Çünkü sen takdir edersin, ben takdir edemem. Sen bilirsin, ben bilemem. Şüphesiz sen allamu'l-guyCıbsun. Allah'ım! Şu işim -dua eden tam buraya geldiğinde işinin ne olduğunu açıkça söyler- benim için dünya ve ahiret işimde -yahut- dinim, yaşayışım ve işimin akıbeti hakkında hayırlı olduğunu bilmekte isen onu benim için takdir et ve bana kolaylaştır. Sonra bu işte bana bereket ihsan eyle! Allah'ım! Bu işin benim için dinim, yaşayışım ve işimin akıbeti hususunda -yahut şöyle derdünya işimde ve ahiret işimde bir kötülük olduğunu bilmekte isen beni ondan çevir ve bana her neredeyse hayrı takdir et. Sonra beni o hayırda razı kıl!\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın 'De ki: Onun gücü yeter' sözü.\" İbn Battal \"kudret\" Allah'ın zatı sıfatlarındandır demiştir. Yüce Allah'ın \"Şüphesiz rızık veren, güç ve kuvvet sahibi olan ancak Allah'tır. \"(Zariyat 58) sözü başlığı altında \"kuwet\" ve \"kudret\" sözcüklerinin aynı manada olduğu geçmiş, bunun yanında bu konudaki görüşler nakledilmiş, gerekli açıklama yapılmıştı. Yukarıdaki hadiste geçen \"estakdiruke bi kudretike\" cümlesindeki \"ba\" harfi cerri, ya \"istiane=yardımıyla\" anlamınadır veya \"kasem=yemin\" manasınadır ya da \"istirham etmek\" manasınadır. Buna göre cümlenin manası şöyledir: Ya Rabbi! Senden talep ettiğim şeyi elde etmek için bana kudret vermeni dilerim. \"fakdurhu\" onu benim için gerçekleştir, \"raddinı\" beni o konuda razı kıl, onu talep ettiğim için ve gerçekleştiğinden dolayı pişman olmayayım. Çünkü ben onu talep ederken her ne kadar razı isem de akıbetini bilmiyorum demektir. \"Sümme ii yekul=sonra desin\" cümlesi, sözkonusu istiare duasının namazı bitirdikten sonra yapılacağını açıkça belirtmektedir. Bu konuda sıralamanın namazın zikir ve duaları gibi olma ihtimali de vardır. Buna göre kişi o duayı namazı bitirdikten sonra ama selamdan önce okur. Bu hadisten çıkan diğer sonuçlar Daavat Bölümünde geçmişti",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 19
			}
		}
	]
}