{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7391,
			"arabicnumber": 7391,
			"text": "Abdullah b. Ömer r.a. şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem çoğu defa \"Kalpleri çevirip döndüren Allah'a yemin olsun ki yapmam!\" diye yemin ederdi. Fethu'l-Bari Açıklaması: Rağıb şöyle demiştir: Arapçada \"Taklibu şey\" bir şeyi bir durumdan diğer duruma çevirmek anlamına gelir. \"Taklib\", \"tasarruf yani çevirme\" anlamınadır. Allah'ın kalpleri ve gözleri \"taklibi\" onları bir görüşten diğer görüşe çevirmesidir. Yukarda zikri geçen İbn Ömer hadisi ile ayetin açıklaması Eyman ve'n-Nüzur Bölümünde geçmişti. Bu ayetle hadisten kalplerin iradi ve irade dışı olarak çevrilmesinin Yüce Allah'ın yaratması ile olduğu anlaşılmaktadır. Bu hadis -mütevatir olmamakla birlikte- Yüce Allah'a \"mukallibu'l-kulub\" demenin caiz olduğunu savunan görüşe delildir. Hadis Allah'a kendi fiilinden türemiş bir kelimeyi isim olarak vermenin caiz olduğunu göstermektedir. Bu konudaki gerekli açıklama Daavat bölümünde Esmuu'l-Hüsna'dan söz edilirken geçmişti. \"Ve nukallibu ef'idetehum\" cümlesinin manası daha önce açıklandığı üzere onların kalplerini dilediğimiz şekilde çeviririz demektir. Beydavi şöyle der: Kalplerin çevrilmesinin Allah'a nispet edilmesi, onun kullarının kalplerini üstüne aldığına ve yaratıklarından hiç kimseye bırakmadığına işaret etmektedir. Resulullah Sallallahu Aleyhi ve Sellem'in duasında geçen \"Ya mukallibe'l-kulub! Sebbit kalbl ald dfnike=Ey kalpleri çeviren! Kalbimi dinin üzere sabit kıl\" cümlesi bu hükmün Nebilerine varıncaya kadar bütün kulları için geçerli olduğuna, Nebilerin bundan istisna edildiğini zannedenlerin bu düşüncelerinin geçersizliğine işaret etmektedir. Nebi Sallallahu Aleyhi ve Sellem'in burada özelolarak kendisini zikretmesi, pak ve temiz olan nefsi Allah'a sığınmaya ihtiyaç duyduğuna göre başkalarının bu ihtiyacı evleviyetle duyacaklarını bildirmek içindir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 20
			}
		}
	]
}