{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7405,
			"arabicnumber": 7405,
			"text": "Ebu Hureyre r.a.'in nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle anlatmıştır: \"Yüce Allah şöyle buyuruyor: Ben kulumun beni zannı üzereyim. Kulum beni andığı zaman ben muhakkak onunla beraber bulunurum. o beni gönlünde gizlice zikrederse ben de onu bu suretle nefsimde zikrederim. Eğer o beni bir cemaat içinde zikrederse ben de onu bu cemaat fertlerinden daha hayırlı bir cemiyet içinde anarım. Kulum bana bir karış yaklaşırsa, ben ona bir arşın yaklaşırım. Kulum bana bir arşın yaklaşırsa, ben ona bir kulaç yaklaşınm. o bana yürüyerek gelirse, ben ona koşarak gelirim. ,,, Fethu'l-Bari Açıklaması: Beyhaki, el-Esma ve's-Sıfat isimli eserinde \"en-nefis\" kelimesi ile bir başlık atmış ve şu iki ayete yer vermiştir: \"Rabbiniz merhamet etmeyi kendisine yazdı. \"(En'am 54) \"Seni kendim için (elçi) seçtim. \"(Taha 41) Hadislere gelince, bunlar, içinde \"sen kendi nefsini nasıl övmüşsen öylesin\"(Müslim, Salat) ve \"Ben zulmü kendi nefsime haram kıldım\"(Müslim, Bİrr ve's-Sıla) cümlesinin geçtiği hadislerdir. Bu iki hadis, Müslim' de yer almaktadır. Biz de şunu ekleyelim: Bu konuda bir de \"Nefsimden razı olan Allah'ı tesbih ederim\"(Müslim, Zikir ve Dua) ifadesinin geçtiği hadis vardır. Beyhaki şöyle devam eder: Arap dilinde \"en-nefis\" kelimesi, birkaç anlamda kullanılır. Bunlardan birisi, Arapların \"fi nefsi'l-emr=aslında\" kullanımlarında olduğu üzere hakiki manadadır. Bu anlamlardan bir diğerine göre kelime \"zat\" anlamına gelir. Beyhaki şöyle devam eder: Yüce Allah'ın \"ta'lemu ma fı nefsı ve la a'lemu ma if nefsik=sen benim içindekini bilirsin, halbuki ben senin zatında {nefsinde} olanı bilmem\"(Maide 116) ayet-i kerimesine şu mana verilmiştir: \"Sen benim içimde gizlediğimi ve sır olarak sakladığımı bilirsin, halbuki ben senin benden gizlediğini bilmem.\" İbn Battal şöyle der: Yukarıdaki ayet ve hadisler, Allah'ın nefsi olduğunu ifade etmektedir. Hadisteki \"ağyeru minallah =Allah'tan daha kıskanç\" ifadesinin ne demek olduğu Küsuf Bölümünde geçmişti. Bazı bilginlere göre \"gayretullah\" Yüce Allah'ın kulun çirkin fiilleri yapmasından hoşlanmaması anlamındadır demişlerdir. \"Yüce Allah şöyle buyuruyor: Ben kulum un beni zannı üzereyim.\" Yani kulum kendisine nasıl muamele edeceğimi zannediyorsa ben o şekilde muamele etmeye ka diri m demektir. Kimiimı şöyle demiştir: Bu ifade akışında umudun (redı) korkuya (havf) ağır bastığına işaret vardır. Kirmanı sanki bunu Allah'ın kulun zannı üzere olmasından (tesviye) çıkarmış gibidir. Zira aklı başında olan bir kimse, böyle bir ifadeyi duyduğunda Rabbinin kendisine yönelik tehdidini uygulayacağı zannına kapılmaz. Bu, \"havf\" tarafıdır. Çünkü kul kendi nefsi için bunu tercih etmez. Tam tersine Allah'ın vaadinin vuku bulacağı zannına meyleder ki bu da \"reca\" yönüdür. Bu, -tahkik ehli bilginlerin de dedikleri gibi- son nefesini verme haliyle kayıtlıdır. Bu anlayışı, \"Herhangi biriniz Yüce Allah'a güzel bir zan beslemedikçe ölmesin\"(Müslim, Cenne) hadisi teyit etmektedir. Bu hadis Cabir' dennakledilip, Müslim' de yer almaktadır. Son nefesten önceki duruma gelince, birincisi hakkında birçok görüş ileri sürülmüştür. Bunlardan üçüncüsü itidaldir. İbn Ebi Cemre, hadiste geçen zandan maksat, bilgidir demiştir. Ona göre bu ifade \"ve zannu en la melcee minallahi illa ileyh = nihayet Allah'tan yine Allah'a sığınmaktan başka çare olmadığını anlamışlardı\"(Tevbe 118) ayetinin ifadesine benzer. Kurtubı, el-Müfhim isimli eserinde şöyle demiştir: \"Kulumun beni zannı\" ifadesinden maksat, kulun dua ederken duasını kabul edeceği yolundaki taşıdığı zan, tövbe ettiğinde tövbesini kabul edeceği, istiğfar ettiğinde bağışlanacağı ve ibadeti şartlarına uygun olarak yaptığında -vaadinde doğruldan ayrılmayarak- onun karşılığını vereceği yolundaki zannıdır. Bu yaklaşımı, Efendimizin bir başka hadisteki \"Allah'a kesin olarak kabul edileceğine inanarak dua ediniz\" ifadesi teyit etmektedir.(Tirmizi, Daavat) Kurtubi şöyle devam eder: Bundan dolayı kişinin üzerindeki vedbeleri Yüce Allah'ın kabul edeceğine ve kendisini bağışlayacağına kesin inanç içinde yapmaya çalışması isabetli olur. Zira o, bunu vaat etmektedir. Allah, vaadinden dönmez. Kişi Allah'ın duasını kabul etmeyeceğini ve bunun kendisine fayda vermeyeceğini zanneder veya buna inanırsa bu Allah'ın rahmetinden ümitsizlik anlamına gelir ki büyük günahlardandır. Her kim bu inanış üzere ölecek olursa, zannına havale edilir. Nitekim hadisin bazı rivayet yollarında \"Kulum beni dilediği gibi zannetsin\" ifadesi yer almaktadır. Kurtubi açıklamasını şöyle tamamlar: Günahta ısrar ettiği halde Allah'ın bağışlayacağını zannetmeye gelince, bu sırf bir cehalet ve kendini aldatmaktan başka bir şey değildir. Böyle bir anlayış insanı Mürde mezhebine götürür. \"Kulum beni andığı zaman ben muhakkak onunla beraber bulunurum\" Bu ifade tıpkı Yüce Allah'ın \"Çünkü ben sizinle beraberim. İşitir, görürüm\"(Taha 46) ifadesine benzemektedir. \"O beni gönlünde gizlice zikrederse ben de onu bu suretle nefsimde zikrederim.\" Yani o beni nefsinde gizlice tenzih edip tazim ederse ben de onu sevap ve rahmetle gizlice zikrederim. İbn Ebi Cemre şöyle demiştir: Bu ifadenin Yüce Allah'ın \"Siz beni anın ki ben de sizi anayım \"(Bakara 152) ayetine paralelolma ihtimali vardır. Çünkü ayetin manası, siz beni tazimle anın ki ben de sizi nimetle anayım demektir. Yüce Allah bir başka ayette Allah'ı anmak elbette en büyüğüdür\"(Ankebut 45) yani ibadetlerin en büyüğüdür buyurmuştur. Kim Allah'ı ondan korkarak zikrederse Allah onun korkusunu giderir. Allah'ı yalnız ve tek başına zikrederse Allah ona arkadaş olur. Yüce Allah \"Bilesiniz ki kalpler ancak Allah'ı anmakla huzur bulur\"(Rad, 28) buyurmaktadır. \"Eğer o beni bir cemaat içinde zikrederse ben de onu bu cemaat fertlerinden daha hayırlı bir cemiyet içinde anarım.\" Bazı alimler şöyle demişlerdir: Bu ifadeden gizli zikrin açık zikirden daha faziletli olduğu anlaşılmaktadır. İfadenin takdiri şudur: Kulum beni kendi içinden zikrederse ben de onu sevapla zikrederim ve bunu hiç kimseye bildirmem. Eğer beni açıktan zikrederse ben de onu mele-i a'la'nın (ruhlar aleminin) haberdar olduğu bir sevapla zikrederim. İbn Battal şöyle demiştir: Bu ifade, meleklerin Ademoğlundan daha faziletli olduklarını göstermektedir. Alimlerin çoğunluğunun yaklaşımı bu doğrultudadır. Bu anlayışa Kur'an'dan örnek ayet bulmak mümkündür. \"Rabbiniz size bu ağacı sırf melek olursunuz veya ebedi kalanlardan olursunuz diye yasakladı. \"(Araf 20) Ebedi olan, fani olandan daha üstündür. Melekler Ademoğlundan daha üstündürler. Ancak bu yaklaşım şu şekilde tenkide uğramıştır. Bilindiği üzere ehl-i sünnet alimlerinin çoğunluğuna göre insanoğlunun salihleri, diğer yaratık cinslerinden daha faziletlidir. Meleklerin daha üstün olduğu kanaatini benimseyenler ise, önce filozoflar, sonra Mutezile, ehl-i sünnetten az bir grup, mutasavvıflar ve bazı zahiriler olmuştur",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 34
			}
		}
	]
}