{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7408,
			"arabicnumber": 7408,
			"text": "Enes'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: ''Allah Teala'nın gönderdiği her bir Nebi kendi kavmine muhakkak o pek yalancı, şaşı Deccal'den haber verip sakındırmıştır. Çünkü o sakat gözıüdür. Rabbiniz ise sakat gözlü değildir. Deccal'in iki gözü arasında 'kafir' yazılmıştır.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın 'Gemi gözlerimizin önünde (yani bilgimizle) akıp gidiyordu' sözü.\" İmam Buhari bu konuda Deccal'den söz eden İbn Ömer ve sonra Enes hadisine yer vermiştir. Bu iki hadis açıklamalarıyla birlikte Fiten Bölümünde geçmişti. Her iki hadiste de Allah'ın sakat gözlü olmadığı belirtilmektedir. \"Ve ii tusnaa ala aynı\" yani benim muhafazamla yetiştirilmen için. Beyhaki şöyle demiştir: Bilginlerin arasında \"el-ayn\" kelimesinin -tıpkı \"elvech\" kelimesinin açıklamasında geçtiği gibi- zat sıfatı olduğunu söyleyenler vardır. Bazı bilginler ise şöyle demişlerdir: \"el-Ayn\"dan maksat görmektir. Buna göre Yüce Allah'ın \"ve li tusnaa ala aynı\" ifadesi, benim gözümün önünde yetiştirilmen için anlamındadır. Aynı şekilde \"uasbir li hukmi Rabbike fe inneke bi a'yunina=Rabbinin hükmüne karşı sabret. Çünkü sen gözlerimizin önündesin\"(Tur 48) ayetindeki \"bi a'yunina\", \"gözlerimizin önünde\" anlamındadır. Kelimenin sonundaki \"na\" tazim ifade etmektedir. Beyhaki bu iki görüşten birincisini tercih etmeye taraftar olmuştur. Çünkü o, selefin mezhebidir. Bu yaklaşım hadisteki \"eliyle işaret etti\" cümlesi ile güçlenmektedir. Zira bunda kelimenin kudret anlamına olduğunu söyleyenlere bir reddiye bulunduğuna işaret vardır. Bunun zatı sıfat olduğunu söyleyenlerin görüşü, sözkonusu yaklaşımı açıkça ifade etmektedir. İbnü'I-Müneyyir şöyle der: Deccal hadisindeki \"Allah sakat gözlü değildir\" ifadesinden Allah'ın gözü olduğu şu şekilde anlaşılmaktadır: Arapçada \"el-aver\" kullanım itibariyle gözü olmamak anlamındadır. \"el-Aver\"in zıttı, gözün olmasıdır. Yüce Allah'ın sözkonusu noksanlıktan uzak olduğu vurgulanınca geriye onun zıttı olan mükemmellik kalır ki bu da gözün bulunmasıdır. Allah'ın gözünün olduğunu söylemek, onun bir organı olduğunu söylemek anlamına değil, bir temsil ve daha kolay kavramayı sağlamaya yöneliktir. İbnü'l-Müneyyir şöyle der: Kelamcılar göz, yüz, el gibi sıfatlar hakkında üç görüşe ayrılmışlardır. Bunlardan birincisi, sözkonusu kelimelerin Allah'ın zat! sıfatları olduğudur. Yüce Allah bunları duyurmuştur. Ancak bunu aklen kavramak mümkün değildir. İkincisi \"ayn=göz\", görme sıfatının kinayeli anlatımıdır, \"el-yedd=el\" kudret sıfatının kinayeli anlatımıdır, \"el-vech=yüz\" varlık sıfatının kinayeli anlatımıdır. Üçüncüsü ise manasını Allah'a havale ederek bunların ifade edildiği üzere geçerli olduğunu kabul etmektir. Şeyh Şihabuddin es-Sühreverdı el-Akıde isimli eserinde şöyle der: Yüce Allah kitabında ve Nebii hadislerinde \"el-istiva = oturmak\" , \"en-nüzu I=inmek\", \"en-nefs=nefis\", \"el-yedd=el\", \"el-ayn=göz\"den söz etmektedir. Bunları yaratıkların organlarına benzetmek caiz olmadığı gibi, inkar etmek de mümkün değildir. Zira Allah'ın ve Nebiinin haber vermesi olmasaydı, insan aklı bu tehlikeli noktada dolaşmaya cesaret edemezdi. Esas alınan görüş budur. Selef-i salihinin yaklaşımı bu doğrultudadır. Bir başkası ise şöyle demiştir: Ne Hz. Nebiden ve ne de sahabilerinden sahih bir yolla bunların tevil edilmesinin gerektiğine dair açık bir ifade nakledilmediği gibi, bunların zikrine dair yasaklama da sözkonusu değildir. Yüce Allah'ın Nebiine Rabbinden kendisine indirileni tebliğ etmesini emretmesi ve ona \"Bugün size dininizi ikmal ettim\"(Maide 3) ayetinin inmesi, sonra da bu konuda herhangi bir açıklama yapmayarak Allah'a nispet edilmesi caiz olan şeylerle olmayanları birbirinden ayırmaması imkansızdır. Üstelik Nebi Sallallahu Aleyhi ve Sellem \"Burada bulunanlar, bulunmayanlara tebliğ etsin\" emriyle kendisinden duyulanların tebliğ edilmesini emretmiştir. Hatta onun sözlerini, fiillerini, hal ve sıfat1arını, huzurunda yapılanları nakletmişlerdir. Bütün bunlar sahabilerin sözkonusu kavramlara Yüce Allah'ın istediği şekilde iman etmek noktasında ittifak ettiklerini göstermektedir. Allah'ın yaratıklarına benzemekten tenzih edilmesi, \"Onun benzeri hiçbir şey yoktur\"(Şura 11) ayeti ile vaciptir. Her kim onlardan sonra bunun aksinin vacip olduğunu söyleyecek olursa selefin yoluna aykırı hareket etmiş olur. Başarı yalnız Allah'tandır",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 37
			}
		}
	]
}