{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7410,
			"arabicnumber": 7410,
			"text": "Bize Hişâm ed-Destevâî, Katâde'den; o da Enes (radıyallahü anh)'ten tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem) şöyle buyurmuştur: \"Allah kıyâmet gününde mü'minleri böylece toplar. bulunduğumuz şu durumumuzdan bizleri kurtarması için Rabb'imize şefaat istesek, derler. Âdem Peygambere gelirler ve: Yâ Âdem! İnsanların sıkıntıda olduklarını görmüyor musun? Allah seni kendi eliyle yarattı, meleklerini sana secde ettirdi... ve herşeyin isimlerini sana öğretti. Bulunduğumuz şu durumdan bizleri kurtarması için Rabb'inden bizlere şefaat et! derler. Ben buna ehil değilim, der ve onlara, işlemiş olduğu o ağaçtan yeme hatîesini zikrederek: Lâkin sizler Nuh'a gidin. Çünkü o, Allah 'ın bütün yeryüzü ahâlîsine göndermiş olduğu ilk rasûldür! der. Nûh 'a gelirler, ondan şefaat isterler. O da: Ben buna ehil değilim, der ve vaktiyle işlediği, kavmi aleyhine duâ etmesi hatîesini zikrederek: Fakat siz Halîlu'r-Rahmân olan İbrâhîm 'e gidin, der. İbrahim'e gidip ondan şefaat isterler. O da: Ben buna ehil değilim, der ve onlara, vaktiyle işlediği hatâlarını (\"Ben hastayım, putları onların büyükleri kırdı” ve zevcesi için \"O benim kızkardeşimdir\" demesini) zikrederek: Lâkin sizler, Allah 'in kendisine Tevrat vermiş ve kendisiyle konuşmuş olduğu bir kul olan Musa'ya gidin, der. Musa'ya giderler. O da: Ben buna ehil değilim, der ve onlara, vaktiyle işlediği (nefis öldürme) hatâsını zikreder: Fakat sizler Allah'ın kulu, rasûlü, kelimesi ve ruhu olan Îsa'ya gidin, der. Îsa'ya gelip (ondan şefaat isterler), İsâ da onlara: Ben buna ehil değilim. Fakat siz geçmiş ve geri kalmış günâhları mağfiret olunmuş bir kul olan Muhammed (sallallahü aleyhi ve sellem)'e gidin, der. üzerine insanlar bana gelirler. Ben de akabinde gider Rabb'imin huzuruna izin isterim. Bana huzura girmem için izin verilir. Ben Rabb'imi görünce hemen O'nun için secdeye kapanırım. Allah beni bu vaziyette bırakmak istediği kadar bırakır. Sonra Allah tarafından bana: Başını kaldır, Muhammedi söyle, sözün dinlenir; iste, Sana verilir; şefaat et, şefaatin kabul olunur! denilir. bana öğrettiği birçok hamdlerle Rabb'ime hamdederim. Sonra şefaat ederim. Benim için bir sınır (yânı belli bir kavim) ta'yîn edilir. Ben onları cennete girdiririm. Sonra tekrar dönerim. Rabb'imi görünce secdeye kapanırım. O beni bu vaziyette bırakmak istediği kadar bırakır. Sonra Allah tarafından: Başını kaldır, Muhammed! Söyle; sözün işitilir; iste, sana verilir; şefaat et, şefaatin kabul olunur! denilir. yine Rabb'imin bana öğretmiş olduğu birçok hamdlerle Rabb 'ime hamdederim. Sonra şefaat ederim. Bana yine bir sınır ta’yîn edilir. Ben onları da cennete koyarım. Bundan sonra yine döner, Rabb'imi görünce secdeye kapanırım. Rabb'im beni o vaziyette bırakmak istediği kadar bırakır. Sonra: Kalk yâ Muhammed! Söyle, sözün işitilir; iste, sana verilir; şefaat et, şefaatin kabul olunur! denilir. yine Rabb'imin bana öğretmiş olduğu birçok hamdlerle Rabb'ime hamdederim. Sonra şefaat ederim. Benim için yine bir sınır konulur. Ben o sınır içindekileri de alır, cennete korum. Sonra döner ve Rabb'ime: Yâ Rabbî! Ateşte Kur'ân'ın habsettiklerinden ve kendisine hulûd vâcib olanlardan başka kimse kalmadı, derim\". ibn Mâlik dedi ki:Peygamber(sallallahü aleyhi ve sellem): \"Lâ ilahe ille’llah diyen ve kalbinde bir arpa ağırlığınca hayır (yani îmân) bulunan kimseler ateşten çıkar. Bundan sonra Lâ ilahe ille’llah diyen ve kalbinde bir buğday tanesi ağırlığı kadar hayır bulunan kimseler ateşten çıkar. Daha sonra Lâ ilahe ille’llah diyen ve kalbinde bir tek zerre ağırlığı kadar hayır olan kimseler ateşten çıkar\" buyurdu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 39
			}
		}
	]
}