{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7432,
			"arabicnumber": 7432,
			"text": "Bize Kabîsa tahcüs etti. Bize Sufyân es-Sevrî, babası Saîd ibn Mesrûk'tan; o da Ebû Nuaym'dan yahut Ebû Nu'm'dan -râvî Kabîsa şekk etmiştir- tahdîs etti. Ebû Saîd el-Hudrî (radıyallahü anh):Peygamber(sallallahü aleyhi ve sellem)’e bir parça altın gönderildi de, kendisi bu altını dört kimse arasında taksîm etti, demiştir. Saîd el-Hudrî (radıyallahü anh) şöyle demiştir: Alî ibn Ebî Tâlib (radıyallahü anh) Yemen'de bulunduğu sırada Peygamber(sallallahü aleyhi ve sellem)'e toprağı içinde altın ma'deni göndermişti. Peygamber bu altını el-Akra’ ibnu Habis el-Hanzalî, sonra Mucâşi' oğullarından biri ve Uyeyne ibn Bedr el-Fezârî ile Alkame ibnu Ulâse el-Âmirî arasında, sonra Kilâb oğulları'ndan biri ile Zeyd el-Hayl et-Tâî arasında, sonra Nebhân oğulları'ndan biri arasında taksîm etti. Bu taksîm sebebiyle Kureyş ile Ensâr öfkelendiler ve: Rasûlüllah bizleri terkediyor da Nech ahâlîsinin seyyidlerine veriyor! dediler. Rasûlüllah: \"Ben ancak (İslâm'da sebat etmeleri için) onları alıştırıyorum!\" buyurdu. sırada iki gözü çökük, alnı yüksek, sakalının kılları bol, elmacık kemikleri çıkık, başı tıraşlı bir kişi geldi de: Yâ Muhammed, Allah'tan kork! dedi. Bunun üzerine Peygamber: \"Ben Allah'a âsî olduğum takdirde, O'na kim itaat eder? O beni Yer halkı üzerine emîn kılıyor, sizler beni emîn saymıyor musunuz?\" buyurdu. topluluktan bir adam Peygamber’e i'tirâz edeni öldürmek istedi. Zannederim ki, o öldürmek isteyen kişi Hâlid ibnu'l-Velîd idi. Peygamber onu bundan men' etti. Sonra o Peygamber'e i'tirâz eden adam arkasına dönüp gittiği zaman, Peygamber şöyle buyurdu: \"Şunun soyundan öyle bir kavim türeyecektir ki, onlar Kur'ân okuyacaklar, fakat Kur'ân onların boğazlarından öteye geçmiyecek. Onlar -ok avı delip çıktığı gibi- islâm'dan çıkacaklar; onlar İslâm ahâlîyi öldürecekler de putlar ehlini bırakacaklardır. Eğer ben onların zamanına erişmiş olsaydım, muhakkak onları Âd kavminin öldürülüşü gibi öldürürdüm",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 59
			}
		}
	]
}