{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7433,
			"arabicnumber": 7433,
			"text": "Ebu Zer' r.a. şöyle demiştir: Ben Nebi Sallallahu Aleyhi ve Sellem'e \"Veşşemsu tecri li mustekarrin lehu = güneş kendisi için belirlenen yerde akar (döner)\"(Yasin 38) ayetini sordum. Nebi Sallallahu Aleyhi ve Sellem \"Onun karargahı (müstekam) arşın altındadır\" dedi. Fethu'l-Bari Açıklaması: Birinci ayete gelince, İmam Buhari bu ayetin tefsiri hakkında son açıklamaya işaret etmiştir ki bu Ferra'nın görüşüdür. \"el-Mearic\", Yüce Allah'ın sıfatlarından olup, o kendini bu şekilde nitelemiştir. Zira melekler ona doğru yükselmektedirler. Bir başkası ise \"zi'l-mearic\"in manasının yüksek dereceler olduğunu söylemiştir. Beyhaki'nin Ali b. Ebi' Talha'dan nakline göre İbn Abbas bu ayeti tefsir ederken şöyle demiştir: \"el-Kelimu't-tayyibu\" Allah'ı zikirdir, \"el-amelu's-salihu\" Allah'ın koyduğu farzları eda etmektir. Her kim Allah'ı zikreder, O'nun farizalarını yerine getirmezse onun kelamını reddetmiş olur. el-Ferra'nın görüşüne göre salih amel güzel sözleri yukarı yükseltir. Bir başka ifadeyle güzel sözler beraberinde salih amel olduğu takdirde kabul edilir. Rağıb şöyle der: \"el-Uruc\" yukarıya doğru yükselmek demektir. Ebu Ali elKa1i', el-Bari' isimli eserinde şöyle der: \"el-Mearic\", \"ma'rec\" kelimesinin çoğuludur. Tıpkı \"el-masaid\" kelimesinin \"mas'ad\" kelimesinin çoğulu olduğu gibi . . \"el-Uruc\" yukarıya doğru yükselmek demektir. Beyhaki' şöyle der: Güzel sözün ve hoş sadakanın yukarıya yükselmesi onların kabul edilmesi demektir. Meleklerin yukarıya yükselmesi ise gökteki bulundukları yere doğru yükselmeleridir. Bu ifadede yer alan \"ilallah=Allah'a doğru\" ifadesi ise selef bilginlerinden daha önce naklettiğimiz üzere işi ona havale etmek anlamındadır. Buhari' bu başlık altında dört hadise yer vermiştir ki bunların bazılarında aynı rivayet yolu üzerine ziyadelik vardır. Ebu Hureyre'nin naklettiği birinci sırada yer alan \"(her gün) birtakım melekler geceleyin, diğer birtakım melekler de gündüzün birbirlerini müteakip size gelirler\" hadisinin açıklaması SaıM Bölümünün baş taraflarında geçmişti. Ebu Said'in rivayet ettiği dördüncü sırada yer alan hadisin geniş bir açıklaması Fiten Bölümünde geçmişti",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 60
			}
		}
	]
}