{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"0": ""
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7437,
			"arabicnumber": 7437,
			"text": "Bize îbrâhîm ibn Sa'd, ibn Şihâb'dan; o da Atâ ibn Yezîd el-Leysî'den; o da Ebû Hureyre (radıyallahü anh)'den şöyle tahdîs etti: İnsanlar: Yâ Rasûlallah, bizler kıyâmet gününde Rabb'imizi görecek miyiz? diye sordular. Bunun üzerine Rasûlüllah(sallallahü aleyhi ve sellem): \"Ayın ondördüncü gecesi Ay'ı görmek için itişip kakışmaya, birbirinize zahmet vermeye hacet görür müsünüz?\" diye sordu. Sahâbîler Hayır yâ Rasûlallah! dediklerinde, tekrar: \"Ya Güneş'in önünde hiçbir bulut yokken görmek için itişip kakışmaya, birbirinize zahmet vermeye hacet görür müsünüz?\" diye sordu. Sahâbîler yine; Hayır yâ Rasûlallah! deyince, Rasûlüllah şöyle buyurdu: \"Şübhesiz sizler O'nu işte böyle açık göreceksiniz. Allah, kıyâmet gününde insanları toplayacak da: Her kim her neye tapıyor idiyse, onun ardına düşsün! buyuracak. Güneş'e tapmakta olan Güneş'in ardına; Ay'a tapmakta olan Ay'ın ardına; tâgûtlara tapmakta olanlar da tâgûtların arkalarına düşüp gidecek. Ve yalnız bu ümmet, içlerinde şefaatçileri -yahut: münafıkları- da olduğu hâlde yerinde durup kalacak -Râvî İbrâhîm bu iki kelimede şekk etti-; Allah onlara (evvelce tanıdıklarından başka bir surette) gelip: Ben sizin Rabb'inizim! buyuracak. Onlar Rabb'lerini o tecellî ile tanıyamadıkları için: Allah'a sığınırız), Rabb'imiz bize gelinceye kadar bizim yerimiz burasıdır (yerimizden ayrılmayız)! Rabb'imiz bize geldiğinde biz O'nu tanırız! diyecekler. Taâlâ onlara bu defa tanımakta oldukları suret üzere gelecek de: Ben sizin Rabb'inizim! buyuracak. Onlar da: (Hakikat) Sen bizim Rabb 'imizsin! diyecekler ve (Allah'ın da'vet etmesi üzerine) O'na tâbi’ olacaklar. de ortasına sırat (yani köprü) kurulur. Ben ümmetimi onun üstünden geçirecek ilk kimse olacağım. O gün rasûllerden başka hiçbir kimse (korku ve dehşetten dolayı) tekellüm edemez. Rasullerin de o günkü duası: \"Allâhumme sellim sellim (Allah'ım, selâmet ver, selâmet ver)!' olacaktır. Cehennemden sa'dân dikenlerine benzer çengeller vardır. Sa'dân dikenlerini hiç görmüşlüğünüz var mı?\" Evet yâ Rasûlallah, dediler. Rasûlüllah şöyle devam etti: \"İşte bu çengeller sa'dân dikenlerine benzer. Ancak şu var ki, ne kadar büyük olduklarını yalnız Allahu Taâlâ bilir. İşte bunlar insanları (kötü) amellerinden dolayı kapıp alırlar. Artık insanlardan kimisi helak olur, kötü ameliyle kalır -yahut: Kötü ameli dolayısıyle helak olur-, kimisi de hardal gibi ezim ezim ezildikten sonra yahut cezasını gördükten yahut buna benzer bir hâlde kurtulur. Nihayet Allahu Taâlâ kulları hakkında hüküm ve kaza adlini icrâ ve tamam edip de sırf ilâhi rahmeti olarak cehennem ehlinden dilediklerini cehennemden çıkarmak istediğinde meleklere ilâhi rahmete nâiliyetleri murâd olanlardan Allah'a birşeyi ortak edinmemişleri, ‘Lâ ilahe ille'llâh' diye şehâdet etmişleri cehennemden çıkarsınlar diye emredecektir. Melekler bunları cehennemde üzerlerindeki sucûd izlerinden tanıyacaklardır. Ateş Âdem oğlunun bütününü yer de yalnız sucûd eserini yiyemez. Allahu Taâlâ sucûd eserini yemeyi cehennem ateşine haram kılmıştır. Bunlar ateşten kavrulup kapkara olarak çıkarılacaklar. Üzerlerine hayât suyu dökülecek de onun altında seyl uğrağında biten yabani reyhan tohumları nasıl çabuk biterse, yeniden öylece bitecekler. Allah Taâlâ kulları arasında hüküm ve kazayı sona erdirir. Ancak cennet ile cehennem arasında yüzü ateşe dönük bir kimse kalır ki, o cennete girecek cehennem ehlinin sonuncusu olacaktır. O kimse: Yâ Rabb! Yüzümü şu ateşten döndür. Çünkü kokusu beni zehirleyip duruyor, alevi beni yakıp duruyor, diyecek. adam mütemadiyen Allah'a, Allah'ın dilemesi kadar duâ ve niyazda bulunacak. Sonunda Allah ona: Bu senin dediğin sana verilecek olsa, acaba başka şey daha istemiyecek misin? buyuracak. ise: İzzetineyemîn olsun ki, hayır; bundan başka Sen'den birşey daha istemem! diyecek ve Rabb'ine, ilâhî ma'siyeti taalluk eden birçok ahidler ve misâklar verecek. sonra Allahu Taâlâ onun yüzünü cehennem cihetinden (cennet tarafına) çevirecek. Yüzünü cennete doğru döndürünce cennetin güzelliğini görecek. (Lâkin hemen istekten utanıp) Allah'ın dilediği kadar bir müddet sükût ettikten sonra: Yâ Rabb! Beni cennetin kapısına yanaştır, diyecek. da ona: Evvelce istediğinden başka ebediyyen hiçbirşey istemiyeceğine ahidlerini ve mîsâklarını vermiş değil miydin? Allah lâyıkını versin be hey Âdem oğlu! Sen ne kadar sözünde durmaz kimsesin! buyuracak. O da: Ey Rabb'im! der ve Allah'a devamlı duâ eder. Allah: Bu sana verilirse, bundan başka birşey istemiyecek misin? diyecek. da: İzzetine yemîn ederim ki, hayır; bundan başka birşey istemem! diyecek ve yine Rabb'inin dilediği bir çok ahidler ve mîsâklar verecek. ardından Rabb'i onu cennetin kapısına yanaştıracak. O kimse cennet kapısına varıp dikildiği ve cennet ona açılıp genişlediği, o da cennetin içindeki güzel ve bol ni'metleri, sevinci görünce (yine utanıp) Allah'ın dilediği kadar bir müddet sükût edecek. Sonra: Yâ Rabb! Beni cennetin içine sok! diyecek. Allah da ona: İstediğin sana verildiği takdirde, ondan başka hiçbirşey istemiyeceğine ahidlerini ve mîsâklarını vermiş değil miydin? der ve: Sana veyl olsun ey Âdem oğlu! Sen ne kadar sözünde durmaz kimsesin! buyurur. üzerine o kimse: Ey Rabb 'im! Mahlûklarının en bedbahtı ben olmayayım, diyecek, durmadan dua ve niyaza devam edecek. Allah Taâlâ ona gülecek. Ona gülünce de:' Cennete gir! buyuracak. kul cennete girince Allah ona: Temenni et! buyuracak. da Rabb'inden ister ve temenni eder. Nihayet Allah ona: Şunu da, bunu da iste! diye buyurarak, istenecek şeyleri onun aklına getirecek. bu dileklerinin hepsi kesilince, yine Allah ona: Bunların hepsi ve bir o kadar dahası hep senindir! buyuracak",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}