{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7439,
			"arabicnumber": 7439,
			"text": "Ebu Said el-Hudri şöyle demiştir: Biz \"Ya Resulallah! Kıyamet gününde bizler Rabbimizi görecek miyiz?\" diye sordu k. Resulullah Sallallahu Aleyhi ve Sellem \"Sizler gökyüzünde bulut olmadığı zaman güneşi ve ayı görmek için birbirinizi sıkıştınp, darlığa düşer misiniz?!! buyurdu. Biz \"Hayır\" deyince, Resulullah Sallallahu Aleyhi ve Sellem \"Şüphesiz sizler güneş ile ayı görmekte birbirinizi sıkıştırıp, darlığa düşürmediğiniz gibi o gün Rabbinizi görmekte de hiç birbirinizi sıkıştırıp darlığa düşmeyeceksiniz!! buyurdu. Sonra şöyle devam etti: \"Her bir kavmin dünyada ibadet edegeldiği şeye gitmesi için bir nidacı nida eder. Bunun üzerine haçlılar haçlarıyla, puta tapanlar putlarıyla her bir mabudun tapanları kendi mabudlarıyla giderler. Nihayet itaatkar olsun, günahkar olsun, hak üzere kalan kitap ehlinin geride kalanları olsun Allah'a ibadet etmekte olanlar kalır. Sonra cehenneme getirilirler, cehennem onlara gösterilir ki sanki cehennem onların nazarında bir seraptır. Yahudilere 'Sizler kime tapardınız?' diye sorulur. Onlar 'Biz Allah'ın oğlu Üzeyr'e tapardık' derler. Bunun üzerine onlara Siz yalan söylüyorsunuz. Allah Teala hiçbir eş, hiçbir oğul edinmiş değildir. Şimdi söyleyin iz istediğiniz nedir?' denilir. Yahudiler 'Ya Rab! Bize su içirmeni istiyoruz' derler. Onlara 'Haydi içiniz' denilir ve birbiri ardınca cehennemin içine dökülürler. Sonra Hıristiyanlara hitaben 'Sizler kime tapardınız?' diye sorulur. Onlar da 'Biz Allah'ın oğlu Mesih'e tapardık' derler. Bunun üzerine onlara 'Siz yalan söylüyorsunuz. Allah Teala hiçbir eş, hiçbir oğul edinmiş değildir. Şimdi söyleyin iz ne istiyorsunuz?' denilir. Onlar da 'Bize su içirmeni istiyoruz' derler. Onlara da 'Haydin su için!' denilir de birbiri ardınca cehennemin içine dökülürler. Nihayet itaatkar olsun, günahkar olsun Allah'a ibadet etmekte olanlar kalır. Onlara da 'İnsanlar hep gittikleri halde sizleri burada alıkoyan nedir?' denilir. Onlar 'Biz şimdikinden ziyade kendilerine muhtaç iken onlardan dünyada ayrılmıştık. (Şimdi nasılolur da onların arkasına takılırız?) Biz bir nidacının 'Her kavim vaktiyle ibadet ettiği ne idiyse ona kavuşsun!' diye nida ettiğini işittik. Bundan dolayı bizler Rabbimizi bekleyip duruyoruz!' derler.\" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Meydanda kalan mu'minlere cebbar olan Allah onları ilk defa gördükleri, tanıdıkları suretten başka bir surette gelir ve 'Ben sizin Rabbinizim!' der. Onlar da 'Sen bizim Rabbimizsin!' derler. Artık onunla Nebilerden başkası konuşamaz. Allah Teala 'Rabbinizi tanıyabilmek için aranızda bir alamet var mıdır?' diye sorar. Onlar 'Evet saktır!' demeleri üzerine Allah Teala sakını açacaktır. Bunun üzerine her mu'min Allah'a secde eder. Allah'a riya ve şöhret için secde eden kimseler kalır. Onlar da secde etmeye davranırlar fakat onların sırtı tek bir tahta gibi kaskatı bir tabakaya döner. Sonra köprü getirilir de cehennemin ortasına kurulur.\" Biz \"Ya Resulallah! Köprü nedir?\" dedik. Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: :4yakların kayacağı bir yerdir ki üzerinde başları eğri demirden çengeller, dikenler, sert, keskin, enli şeyler vardır. Bunların Necid'de olan ve Sa'dan denilen dikenler gibi uçları kıurık, eğri dikenleri vardır. Mu'minlerin kimi onun üzerinden göz kırpacak kadar zaman içinde, kimi şimşek gibi, kimi rüzgar gibi, kimi iyi cins yörük at ve develer gibi süratle geçerler. Bunların kimi sapsağlam olduğu gibi kurtulur. Kimi tırmıklar içinde perişan olmuş olarak salıverilir. Kimi de cehennem ateşi içine sapır sapır düşer. Nihayet sonuncuları sürüklene sürüklene geçer, kurtulur. Bugün ortaya çıkmış hakkını kurtarmak için hiçbirinizin bana yalvarıp yakarması, o (dehşetli) günde asi mu'minin cebbar olan Yüce Allah'a yalvarıp yakarmasına benzemez. Onların kardeşleri arasında kurtulduklarını gördüklerinde 'Ey Rabbimiz! Bu kalanlar bizim kardeşlerimizdir. Onlar bizimle birlikte namaz kılar, oruç tutar, her türlü iyi işlerde bulunurlardı. ' Allah Teala 'Haydin gidin, kalbinde bir dinar ağırlığında iman olan her kimi bulursanız çıkarın!' buyuracaktır. Allah Teala onların suretlerini yakmayı ateşe haram edecektir. Artık bunlar kimi ayağının üstüne, kimi de yarı inciğine kadar ateşe gömülerek içeriye dalıp, tanıdıklarını çıkaracaklardır. Yine Yüce Allah 'Haydin bir daha gidin, kalbinde zerre ağırlığınca iman olan kimi bulursanız çıkarın!' buyuracaktır. Yine böyle olanlardan tanıdıklarını çıkarıp döneceklerdir. Yine Yüce Allah 'Haydin bir daha gidin, kalbinde zerre ağırlığınca iman olan kimi bulursanız çıkarın!'buyuracaktır. Yine böyle olanlardan tanıdıklarını çıkaracaklardır. \" Ebu Said şöyle devam etti: \"Eğer bu dediğime inanmıyorsanız \"Şüphe yok ki Allah zerre kadar haksızlık etmez. (Kulun yaptığı iş eğer bir kötülük ise onun cezasını adaletle verir.) İyilik olursa, onu katlar (kat kat arttırır). Kendinden de büyük mükafat verir. \"(Nisa 40) ayetini okuyunuz. \"Kısacası Nebiler, melekler, mu'minler şefaat edeceklerdir. Derken cebbar olan Yüce Allah Artık sıra benim şefaatime geldi!' buyuracak ve ateşten bir kabza tutacak ve simsiyah yanmış olan birtakım kavimleri dışarı çıkaracak, akabinde bunlar cennetin yolları üzerinde olup, hayat nehri denilen bir nehrin içine atılacaklardır. Onlar o nehrin iki kıyısında sel uğrağında biten yabani (reyhan) tohumlarının bittiği gibi biteceklerdir. Sizler o tohumları taşın kenarında, ağacın yan tarafında görmüşsünüzdür. Onlardan güneşte olanları yeşildir, gölgeli olanları da beyazdır. Sonra onlar bu nehirden (beyaz ve parlak) inciler gibi çıkacaklar, boyunlarına kendileriyle tanınacakları (altın, gümüş türünden) hatemler takılacak ve cennete gireceklerdir. Cennet ahalisi 'İşte bunlar hiçbir amelleri, geçmiş hiçbir hayırları olmadığı halde Allah 'ın cennete koyduğu azaldıklarıdır!' diyeceklerdir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 65
			}
		}
	]
}