{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7447,
			"arabicnumber": 7447,
			"text": "Bize Eyyûb, Muhammed ibn Sîrîn’den; o da İbn Ebî Bekre'den; o da Ebû Bekre(radıyallahü anh)’den tahdîs etti ki, Peygamber(sallallahü aleyhi ve sellem- Veda Haccı'ndaki hutbesinde) şöyle buyurmuştur: \"Zaman, Allah'ın gökleri ve yerleri yarattığı günkü (ilk) vaziyetine dönmüştür. Bir yıl, (ay ölçüsüyle) oniki aydır. Bunlardan dördü haram (yasak) aylardır ki, üçü arka arkaya zu'l-ka'de, zu'l-hicce, muharrem'dir. (Dördüncüsü) Mudar'ın ayı olan receb’dir. O, cumâ-da'l-âhir ile şa’bân arasındadır\". sonra Rasûlüllah: \"Bu ay hangi aydır?\" diye sordu. Biz: Allah ve Rasûlü en bilendir! dedik. sükût etti. Biz Rasûlüllah bu aya eski adından başka bir ad verecek sandık. Sonra: \"Zu'l-hicce ayı değil midir?\" buyurdu. Evet zu'l-hicce’dir! dedik. \"Bu içinde bulunduğunuz hangi beldedir?\" buyurdu. Allah ve Rasûlü en bilendir! dedik. sustu. Hattâ biz Rasûlüllah'ı Mekke'ye eski isminden başka bir isim verecek sandık. Sonra Rasûlüllah: \"Mekke beldesi değil midir?\" buyurdu. Biz: Evet Mekke'dir! dedik. Rasûlüllah: \"Bu gün hangi gündür?” diye sordu. Biz: Allah ve Rasûlü en bilendir! dedik. yine sükût etti. Hattâ biz, eski adından başka bir ad verecek sandık. Rasûlüllah: \"Nahr günü (kurban kesim günü) değil midir?\" buyurdu. Biz: Evet, Nahr günüdür! dedik. mukaddimelerden) sonra Rasûlüllah: \"Şu hâlde, iyi biliniz ki, kanlarınız ve mallarınız-Muhammed ibn Sîrîn: Ebû Bekre şunu da söyledi sanıyorum, demiştir:- ve ırzlarınız birbirinize bu ayınızda, bu beldenizde, bu gününüzün haram oluşu gibi haramdır (Her türlü saldırıdan korunmuştur). Muhakkak ki, siz Rabb'inize kavuşacaksınız. Rabb'iniz sizlere istediğiniz amellerinizden soracaktır. (Ey insanlar!) Aklınızı başınıza toplayınız da, benden sonra birbirinizin boynunu vuracak surette sapıklara dönmeyiniz! (Ey insanlar!) Dikkat edin: Bu sözlerimi burada hazır bulunanlar, hazır bulunmayan müstakbel nesillere tebliğ edip ulaştırsın! Olabilir ki, kendisine tebliğ ulaşan bâzı kimse, burada bulunup işiten bir kısım kimseden daha iyi anlayıp bellemiş olur!\" ibn Sîrîn bu hadîsi zikrettiği zaman: Peygamber(sallallahü aleyhi ve sellem) doğru söyledi, der idi (çünkü dinleyenlerden çoğu, üstâdlarından daha iyi anlayıp belleyicidirler). Bundan sonra Rasûlüllah: edin: Tebliğ ettim mi? Dikkat edin: Tebliğ ettim mi?\" diye iki kerre sordu",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 73
			}
		}
	]
}