{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7447,
			"arabicnumber": 7447,
			"text": "Muhammed b. Ebu Bekre'nin Ebu Bekir'den nakline göre Nebi Sallallahu Aleyhi ve Sellem (veda haccında) şöyle buyurmuştur: \"Zaman Allah'ın gökleri ve yerleri yarattığı günkü (ilk) vaziyetine dönmüştür. Bir yıl (ay ölçüsüyle) oniki aydır. Bunlardan dördü haram (yasak) aylardır ki, üçü arka arkaya zilkade, zilhicce ve muharremdir. (Dördüncüsü) Mudar'ın ayı olan recebtir. O cumade'lahir ile şaban arasındadır.\" Bundan sonra Resulullah Sallallahu Aleyhi ve Sellem \"Bu ay hangi aydır?\" diye sordu. Biz \"Allah ve Resulü en iyi bilendir\" dedik. Resulullah Sallallahu Aleyhi ve Sellem sükCıt etti. Biz Nebi bu aya adından başka bir ad verecek sandık. Sonra \"Zilhicce ayı değil midir?\" buyurdu. Biz \"Evet zilhiccedirl\" dedik. Resulullah Sallallahu Aleyhi ve Sellem \"Bu içinde bulunduğunuz hangi beldedir?\" buyurdu. Biz ''Allah ve Resulü en iyi bilendir!\" dedik. Resulullah Sallallahu Aleyhi ve Sellem sustu. Hatta biz onu Mekke'ye isminden başka bir isim verecek sandık. Sonra Resulullah Sallallahu Aleyhi ve Sellem \"Mekke beldesi değil midir?\" buyurdu. Biz \"Evet, Mekke'dir!\" dedik. Resulullah Sallallahu Aleyhi ve Sellem \"Bugün hangi gündür?\" diye sordu. Biz \"Allah ve Resulü en iyi bilendir!\" dedik. Resulullah Sallallahu Aleyhi ve Sellem yine sükCıt etti. Hatta biz bugüne adından başka bir isim verecek sandık. Resulullah Sallallahu Aleyhi ve Sellem \"Nahr günü (kurban kesim günü) değil midir?\" buyurdu. Biz \"Evet, nahr günüdür!\" dedik. Bundan sonra Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu: \"Şu halde iyi biliniz ki kanlarınız ve mallarınız -Muhammed b. Sirin, Ebu Bekr' e şunu da söyledi sanıyorum demiştir- ve ırzlarınız birbirinize bu ayınızda, bu beldenizde, bu gününüzün haram oluşu gibi haramdır. (Her türlü saldırıdan korunmuştur.) Muhakkak ki siz Rabbinize kavuşacaksınız. Rabbiniz sizlere işlediğiniz amellerinizden soracaktır. (Ey insanlar!) Benden sonra birbirinizin boynunu vuran sapıklara dönmeyiniz! (Ey İnsanlar!) Dikkat edin bu sözlerimi burada hazır bulunanlar, hazır bulunmayanlara tebliğ edip ulaştırsın! Olabilir ki kendisine tebliğ ulaşan bazı kimseler, burada bulunup işiten bir kısım kimselerden daha iyi anlayıp bellemiş olur!\" Muhammed b. Sirin bu hadisi zikrettiği zaman Nebi Sallallahu Aleyhi ve Sellem doğru söyledi derdi. Bundan sonra Resulullah Sallallahu Aleyhi ve Sellem \"Dikkat edin, tebliğ ettim mi? Dikkat edin, tebliğ ettim mi?\" diye iki kere sordu. Fethu'l-Bari Açıklaması: \"Yüce Allah'ın 'Yüzler vardır ki o gün ışılışıl parıldayacaktır. Rablerine bakacaklardır' sözü.\" Taberi'nin sahih bir isnadla Yezid en-Nahvi'den nakline göre İkrime bu ayeti \"Yüzler vardır o gün Rablerine hiç şüphesiz bakacaktır\" şeklinde tefsir etmiştir. Taberi'nin, Buhari, Adem, Mubarek isnadıyla nakline göre Hasan-ı Basri ise \"Yüzler vardır o gün yaratıcısına bakacaktır ve onların bakmak haklarıdır\" şeklinde açıklamıştır. Beyhaki şöyle der: Bu ayetin konumuza delilolan kısmı \"nadıra\" kelimesidir. Birinci kelime dat harfiyle \"nadıra\" şeklinde olup, sevinç anlamına gelen \"ennadra\" kökünden türemiştir. Diğeri ise zı harfiyle \"nazıra\" kelimesidir. Bu kelime Arap dilinde dört manaya gelebilir: Birincisi, tefekkür ve ibret bakışıdır ki \"efela yenzurune ile'l-ibili keyfe hulikat=devenin nasıl yaratzldığına ... bir bakmazlar ml?\"(Ğaşiye 17) ayeti buna örnektir. İkincisi, bekleme anlamındadır. \"Ma yenzurCme illa sayhaten vdhide=Kendilerini ansızın yakalayacak korkunç bir sesi bekliyorlar. \"(Yasin 49) ayeti buna örnektir. Üçüncüsü, rahmet ve şefkat bakışıdır ki \"Id yenzurullahu ileyhim=Allah onlara bakmayacaktır\"(Aı-i İmran 77) ayeti de buna örnektir. Dördüncüsü, görme anlamındadır. Yüce Allah'ın \"yenzurOne ileyke nazara'l-mağşiyyi aleyhi =ölüm baygınfığı geçiren kimsenin bakışı gibi sana baktıklarını görürsün\"(Muhammed 20) ayeti de buna örnektir. Burada söz konusu manalardan ilk üçü kastedilmemektedir. Çünkü birincisi kastedilmiş olamaz, zira ahiret delil getirip akıl yürütme yurdu değildir.. İkincisi kastedilmiş olamaz, çünkü beklemekte nimetin boğaza dikilmesi ve can sıkıntısı sözkonusudur. Ayet ise nimetin hatırlatılması ve müjde makamında zikredilmiştir. Cennet ehli hiçbir şeye bakmaz. Zira akıllarına ne gelirse hemen önlerine getirilip hazır edilir. Üçüncü manaya gelince, bu da mümkün değildir. Çünkü yaratığın yaratıcısına karşı şefkat etmesi sözkonusu olamaz. Sonuç olarak geriye \"görme\" anlamındaki nazar kalmaktadır. Buna bir de şunu ekleyebiliriz: \"Nazar\" kelimesi, yüz kelimesiyle birlikte zikredildiğinde bu yüzde bulunan iki gözle bakma anlamında anlaşılır. Çünkü Yüce Allah'ın \"yenzurCıne ileyke\" ayetinde olduğu üzere sadece bu anlamdaki \"nazar\", \"ila\" harf-i cerriyle kullanılmaktadır. Burada \"nazıra\" kelimesinin görmek anlamında olduğu kesinleştiğine göre 'yetin manası, 'Yüzler Rablerinin sevabına bakmaktadır'\" diyenlerin görüşleri temelinden sarsılmış olur. Çünkü bir ifadeyi açıklarken asıl prensip, ifadeye takdirde bulunmamaktır. Bu ayetin mu'minler hakkındaki mantuku, Mutaffifin suresinde o gün kafjrlerin Rablerini görmekten mahrum olacakları yolundaki mefhurİı.u ile güç kazanmaktadır. Yüce Allah söz konusu \"görme\"nin mu'minler açısından dünyada değil, ahirette olacağına işaret etmek için her iki ayette de kıyamet günüyle kayıtlamıştır. İbn Battal şöyle der: Ehl-i sünnet ve ümmetin çoğunluğu, ahirette Yüce Allah'ı görmenin mümkün olduğu kanaatine varmıştır. Şeyhü'l-İslam İbn Teymıyye şöyle der: Her müslümanın inanması gereken, mu'minlerin ahiret yurdunda Rablerini kıyamet günü mahşerde ve cennete girdikten sonra görecekleridir. Zira Nebi s.a.v.'den hadis alimleri nezdinde mütevatir olarak gelen hadisler bunu göstermektedir. HaridIer, Mutezile ve Mürcie mezhebinden bazıları ise bunun mümkün olmadığını ileri sürerler. Onlar, \"görme fiili\", görülenin sonradan olmasını (muhdes) ve bir mekanda yer tutmasını gerektirir derler ve Yüce Allah'ın \"nazıra\" ifadesini \"beklemektedir\" şeklinde tevil ederler. Ancak bu hatadır. Zira fiil bu manada \"ila\" harf-i cerri alarak geçişli olmaz. İbn Battal bundan sona yukarıdaki açıklamaya benzer şeyler söyler. Sonra şöyle devam eder: Bunların delilolarak sarıldıkları şeyler, Allah'ın mevcut olduğuna dair deliller bulunduğu için geçersizdir. Görmenin görülene bağlantısı, ilmin maluma bağlantısı mesabesindedir. İlmin malum olana bağlantısı nasıL ki illmin sonradan olmasını gerektirmiyarsa, \"görme\" de \"görülen\" varlığın sonradan olmasını gerektirmez. Karşı taraf, \"Gözler onu göremez (En'am 103)\" ayetiyle Allah'ın Hz. Musa'ya hitaben söylediği \"len teranf=sen beni asla göremezsin\"(Araf 143) ayetlerini esas almışlardır. Birinciye verilecek cevap şudur: İki ayetin delilini birbiriyle cem ve telif etmek için \"Gözler onu dünyada göremez\" deriz. İdrak edilememesi Allah'ın görülememesini gerektirmez. Çünkü bir şeyin gerçek mahiyetini kavramaksızın onu görmek mümkündür. İkinciye verilecek cevap da şudur: Yine delilleri cem ve telif etmek için ayetin manası, \"Sen beni dünyada asla göremezsin\" şeklindedir. Zira bir şeyin olmayacağını söylemek, ayete uygun olarak hadislerde yer alan ifadelerle birlikte onun mümkün olmamasını gerektirmez. Sahabe, tabiCın nesiinden bu yana müslümanlar Allah'ın görüleceğini inkar edip, selefe muhalif olanlar ortaya çıkıncaya kadar onun görüleceğini kabul edegelmişlerdir. Kurtubı şöyle der: Allah'ın görüleceğini inkar edenler, görülen varlığın özel bir bedeni olacak, görenle görülen karşı karşıya olacak, görülenden görene bir ışık yansıyacak ve uzaklık ve perde gibi engeller bulunmayacak şeklinde birtakım aklı şartlar ileri sürmüşlerdir ki bunlar onlar açısından yolunu kaybediş ve bir tahakkümden ibarettir. Ehl-i sünnet görülen varlığın varlığı dışında yukarıdaki şartlardan hiçbirini şart koşmaz. Ehl-i sünnete göre \"ru'yet=görmek\" Yüce Allah'ın gören varlıkta yaratmış olduğu bir kavrama gücüdür. Dolayısıyla gören varlık görüleni bu güçle görür. Görme olayına değişmesi mümkün olan birtakım durumlar eşlik edebilir. Bunun bilgisi ancak Yüce Allah'ın katındadır. İmam Buhari bu bölümde onbir hadise yer vermektedir. \"La tudammCıne.\" Beyhaki şöyle der: Şeyh İmam Ebu't-Tayyib Sehl b. Muhammed es-Su'ICıkl'nin \"La tudammCıne fı ru'yetihı\" ifadesini açıklarken şöyle dediğini duydum: Allah'ı görmek için bir yerde toplanmayacak ve birbirinizi sıkıştırmayacaksınız. Fiilin \"La tudammune\" kipinin manası böyledir. Bu fiilin aslı \"la tetadammune’’ ru'yetihl\" şeklindedir ki bir yerde toplanmayı ifade eder. \"La tadamCıne\" şeklinde şeddesiz olanı ise zulüm manasına gelen \"ed-daym\" kökündendir. Bunun manası ise şöyledir: Onu bir kısmınız görürken, bir kısmrrırz görmeyerek haksızlığa uğramazsınlZ. Çünkü sizler onu bulunduğunuz yerden göreceksiniz. Zira o herhangi bir yerde bulunmaktan münezzehtir. Buradaki benzetme, onun kendisini değil, görülmesini ayın görülmesine benzetme şeklindedir. İkinci sırada yer alan Ebu Hureyre hadisi \"İnsanlar \"Ya Resulallah! Bizler kıyamet gününde Rabbimizi görecek miyiz?\" diye sordular. Bunun üzerine Resulullah Sallallahu Aleyhi ve Sellem tekrar \"Ya güneşin önünde hiçbir bulut yokken görmek için itişip kakışmaya, birbirinize zahmet vermeye ihtiyaç duyar mısınız?\" diye sordu.\" Bu uzunca hadisin geniş bir açıklaması Rikak Bölümünde geçmişti. İbn Battal'ın nakline göre Mühelleb şöyle demiştir: Yüce Allah onların, benzeri olmayan Rablerinin sıfatlarına inançları konusunda kendilerini denemek için bir melek gönderir. Melek onlara \"Ben sizin Rabbinizim\" deyince, kendisindeki yaratılmışlık niteliğini gördükleri için onu reddederler. \"Rabbimiz bize geldiğinde biz onu tanırız\" ifadesi Rabbimiz başkasına ait olmayan bir mülk ve yaratıklarından hiçbir şeye benzemeyen azamet içinde kendilerine zuhur ettiğinde \"Sen bizim Rabbimizsin\" derler. \"Allah Teolo 'Rabbinizi tanıyabilmek için aranızda bir alamet var mıdır?' diye sorar. Onlar 'Evet saktır!' derler.\" Onların Rablerini tanımaları melek veya Nebilerden elçilerin ifadesiyle Allah'ın kendilerine tecelli alameti olarak sakı keşfedip açmak olacağı yolundaki ifadeleri olabilir. Şöyle ki Yüce Allah onlara \"Ben sizin Rabbinizim\" diyecek bir kimse göndererek imtihan edecektir. Yüce Allah'ın \"Allah Teolo sağlam sözle iman edenleri hem dünya hayatında, hem de ahirette sapasağlam tutar\"(İbrahim 27) sözü ile buna işaret etmektedir. Bu ayet, her ne kadar kabir azabı hakkında gelmiş ise de mahşer gününü kapsaması da uzak bir ihtimal değildir. Mühelleb şöyle devam eder: İbn Abbas'ın \"yevme yukşefu an sokin=O gün incikten açılır ve secdeye davet edilirler fakat güç getiremezler\"(Kalem 42) ifadesi hakkında \"sak=incik\" güç iş anlamına olduğunu söylediği nakledilir. ---Bu açıklama ayetin lafzına göredir. Zira kelime lafzı itibariyle bir sıfata delalet etmemektedir. Delil bu bölümde Ebu Said el-Hudri'den nakledilen hadistir. Şeyhu'l-İslam İbn Teymıye şöyle der: Ben sahabeden nakledilen tefsirlere ve onların rivayet ettikleri hadislere baktım. Yüzden fazla tefsiri gözden geçirdim. Hiçbir sahabinin sıfat ayetlerinden veya hadislerinden herhangi birini -bilinen mefhumunun gereği aksine- tevil ettiklerini görmedim. Ancak \"yeume yukşefu an sdkin=o gün incikten açılır\" hakkında söylenenler müstesnadır. İbn Abbas ve bir grup bilginden rivayet edildiğine göre \"incikten açılmak\"tan maksat şiddettir ve Allah Teala ahirette şiddeti açacaktır. Ebu Said ve bir grup bilgin bunu Allah'ın sıfatları arasında saymışlardır (Şeyh el-Guneyman'dan naklen.) --- İbn Abbas'ın \"incikten açılma\" ayetini, Allah kendisi ile şiddetin ortaya çıktığı kudretini açar şeklinde tefsir ettiği nakledilmiştir. Beyhaki sözü geçen haberi İbn Abbas'a her biri hasen olan iki isnadla dayandırmaktadır. Beyhakl'nin bir başka sahih isnadla nakline göre İbn Abbas Yüce Allah bununla kıyamet gününü kastetmektedir demiştir. \"Medhadatun mezelletun\" ayakların kayma yeri anlamındadır. \"Haseketun\" et-TehZıb müellifi ve başkaları, \"el-hasek\" koyunların yünlerine yapışan ve sert meyvesi olan bir bitkidir. Bunun bir benzeri demirden de yapılabilir. \"el-hasek\" savaş aletlerinden biridir demişlerdir. \"Müfeltahatun\" kendisinde genişlik olan bir şey demektir ki bu enlidir. Arapçada \"felteha el-kursa = hamuru yaydı, genişletti\" demektir. Yedinci sırada yer alan ve Adiy b.Hatim'in rivayet ettiği \"Yüce Allah'ın arada bir tercüman ve onu görmeyi perdeleyen bir hicab olmaksızın konuşmayacağı hiç kimse olmayacaktır\" şeklindeki hadisi, el-A'meş'den başka bir isnadla \"Kendisini perdeleyen bir perde olmaksızın\" ifadesiyle gelecektir. Tibi Müslim'de yer alan \"Onun hicabı nurdur ki onu açarsa zatının celali ve nuru yaratıklarının gözlerinin ulaştığı her şeyi yakıp kavurur\" (Müslim, Iman)şeklindeki Ebu Musa hadisini şerh ederken şöyle der: Bu hadis, Yüce Allah'ın perdesinin bildiğimiz perdelerden başka bir şeyolduğuna işaret etmektedir. Allah, yaratıklarından izzetinin, celalinin, azamet ve kibriyasının ışıkları ile perdelenmiştir. Akılların önünde dehşete kapıldığı, gözlerin kamaştığı, basiretin hayrete düştüğü perde budur. Altah bu hicabını açıp, bunun arkasında zatının hakikatlerini ve azametini görene tecelli ettiğinde yanmayan bir yaratık kalmaz. Sönüp gitmeyen hiçbir görülen nesne kalmaz. Hicabın aslı görenle görülen arasında engel teşkil eden perde demektir. Burada hicabtan maksat, gözlerin Yüce Allah'ı zikredilen şeylerle görmesini engellemektir. Bu engelleme engel olucu perde makamına kullanılmış ve maksat bununla ifade edilmiştir. Kitap ve sünnetin naslarından bu hadiste işaret edilen durumun ebedi olarak sürmek (baka) için hazırlanmış ahiret yurdu değil, yok olmak (fena) için hazırlanmış dünya yurdu olduğu ortaya çıkmıştır. Bu hadis ve başkalarında zikredilen hicab, yaratıklarla ilgilidir. Çünkü görmeleri engeltenecek olanlar onlardır",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 73
			}
		}
	]
}