{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7450,
			"arabicnumber": 7450,
			"text": "Enes'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"(Asilerden) bir takım kavimlere işlemiş olduklan günahlar sebebiyle bir ceza olmak üzere cehennemden bir siyahlık isabet edecektir. Sonra Allah onlan rahmetinin fazlı ile cennete sokar. Onlara 'cehennemlikler' denilir.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın 'Şüphe yok ki iyilik edenlere Allah'ın rahmeti çok yakındır' sözü.\" İbn Battal şöyle demiştir: Rahmet zati ve fiili sıfat olmak üzere ikiye ayrılır. Burada rahmetin zatı sıfat olma ihtimali vardır. Buna göre ayetin manası itaatkar olanlara sevap verme iradesidir. Bunun fiili sıfat olması da muhtemeldir. Bu durumda ayetin manası Allah'ın bulutları gönderip, yağmur yağdırmak suretiyle lutuf ve ihsanmın iyilik edenlere yakm olmasıdır. Bu, Allah'ın kudreti ve iradesiyle olduğu için kullarına bir rahmeti olur. Tıpkı cennete Allah'm fiillerinden bir fiil, kudretiyle meydana gelen bir hadise olduğu için \"rahmet\" isminin verilmesi gibi. Beyhaki, el-Esma ve's-Sıfat isimli eserinde şöyle bir başlık kullanır: Tedbiri Allah'tan başkasına değil, Allah'a Tanıyan İsimler. Bunlardan birisi de er-Rahman ve er-Rahım isimleridir. Hattabı şöyle der: \"er-Rahman\" kelimesinin manası, rahmet sahibi demektir ki bu rahmet bütün yaratıkları, rızıkları, geçim vesileieri ve maslahatlarını sağlama araçları konusunda kuşatır. Hattabı şöyle devam eder: \"er-Rahım\" mu'minlere mahsustur. Nitekim Yüce Allah'm \"Ve kdne bi'l-mu'minine rahima = Allah mu'minlere karşı çok merhametlidir\"(Ahzab 43) ayet-i kerime si bunu ifade etmektedir. Bir başkası şöyle demiştir: \"er-Rahman\" isimlendirme açısından dar çerçeve li (hass) ve fiil açısından geniş çerçeve li (amm)dır. Buna karşılık \"er-Rahım\" isimle ndir me açısmdan genel, fiil açısmdan özeldir. \"Cennetle cehennem Rablerinin huzurunda çekiştiler.\" İbn Battat'ın nakline göre Mühelleb şöyle demiştir: Sözkonusu çekişme, Yüce Allah'ın cennet ve cehenneme hayat, anlayış ve konuşma özelliği vermek suretiyle hakiki manada olabilir. Allah her şeye kadirdir. \"Cennete gelince (o da dolar). Şüphesiz Allah, halkından hiçbir kimseye zulmetmez. Allah cehennem için (boşluklarını doldurmak üzere) yeniden dileceği kimseler yaratır da bunlar oraya atılırlar.\" Ebü'l-Hasen el-Kabisı şöyle demiştir: Bu konuda bilinen Allah'ın cennet için birtakım mahlukat yaratacağıdır. Cehennıme gelince Allah oraya ayağını kor. Ebü'l-Hasen şöyle devam eder: Allah'ın cehennem için mahlukat yaratacağına dair bu hadis hariç hadislerde geçen hiçbir ifade bilmiyorum. Bu hadis cennet ve cehennemin var olan ve kıyamete kadar var olacak olan herkesi içine alacak şekilde geniş olduğunu göstermektedir. Hatta bunlar daha fazlasına da ihtiyaç duyarlar. Rikak Bölümünün son kısmında cennete en son girecek kimseye dünyanın on katı verileceği ifadesi geçmişti. DavCıdi şöyle der: Bu hadisten eşyanın baskın olan vasfıyla nitelenebileceği anlaşılmaktadır. Çünkü cennete zayıflardan başkaları da gireceği gibi, cehenneme büyüklenen kimselerden başkaları da girecektir. \"Sef'\" ciltte değişiklik eseri anlamına gelir ki bunun sonucu olarak deri üzerinde bir parça siyahlık kalır",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 76
			}
		}
	]
}