{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7480,
			"arabicnumber": 7480,
			"text": "Abdullah b. Ömer şöyle demiştir: Nebi Sallallahu Aleyhi ve Sellem Taif halkını muhasara etti ve orayı fethedemedi. Bunun üzerine \"İnşailah yarın Medine'ye döneceğiz\" dedi. Müslümanlar \"Onların kalelerini fethetmeden nasıl döneriz?\" dediler. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"Öyleyse yarın harbe hazır olun!\" buyurdu. Ertesi gün savaşa giriştiler. (Düşmanın çetin hlüdafa yapmasıüzerine) sahabiler çok yara aldı. Bunun üzerine Nebi Sallallahu Aleyhi ve Sellem \"İnşailah yarın döneceğiz\" dedi. Bu defa bu dönme kararı sahabileri sevindirmiş gibi oldu. Resulullah Sallallahu Aleyhi ve Sellem de sahabilerin bu sevinmelerinden dolayı güıümsedi. Fethu'l-Bari Açıklaması: \"meşiet ve İrade.\" Rağıb şöyle der: çoğu bilginlere göre \"el-meşıe\", \"elirade\" ile aynı manadadır. Bazı bilginlere göre ise \"el-meşıe\" esasen bir şeyi var etmek ve onu elde etmek demektir. Allah'tan olursa \"icat=yoktan var etmek\", insanlardan gelirse \"isabet=elde etmek\" anlamındadır. Örfte ise \"meşiet\" irade yerinde kullanılmaktadır. \"Yüce Allah şöyle buyurmuştur: \"Tu'ti'l-mülke men teşau=Sen mülkü dilediğine verirsin. \"(Al-i İmran 26) \"Ve ma teşacme ilJa en yeşaallah=Sizler ancak Rabbinizin dilemesi (izin vermesi) sayesinde (bir şeyi) dileyebilirsiniz. \"(İnsan 30) \"Ve Ja tekCilenne li şey'in innf lailun zalike ğaden ilJa en yeşaallah =Allah 'ın dilemesine bağlamadıkça {inşaailah demedikçe} hiçbir şey için 'Bunu yarın yapacağım' deme. \"(Kehf, 23.24) \"İnneke la tehdf men ahbebte velakinnallahe yehdf men yeşa =Sen sevdiğini hidayete erdiremezsin, bilakis Allah dilediğine hidayet verir. \"(Kasas 56)\" Beyhak1'nin er-REbi b. Süleyman'a dayanan isnadla nakline göre İmam Şafii şöyle demiştir: \"el-Meşıe\" Allah'ın irade etmesi demektir. Yüce Allah yaratıklarına \"meşıe=dileme\"nin onlara değil, kendine ait olduğUnu bildirmekte ve \"Ve ma teşaCine illa en yeşaallah=Allah dilemedikçe sizler dileyemezsiniz\" buyurmaktadır. Şu halde yaratıkların Allah dilemedikçe dilemeleri mümkün değildir. Beyhakl'nin er-Re bı b. Süleyman'dan nakline göre İmam Şafil'ye kaderi n ne olduğU sorulur. O da bu soruya Ma şi'te kane ve in lem eşe' Ve ma şi'tu in lem teşe' lem yekun ile başlayan beytlerle cevap verir. Olur dilediğin ben dilemesem de! Olmaz dilediğim dileme yoksa sende! Beyhaki bundan sonra Kur'an-ı Kerim'de kırktan fazla yerde tekrarlanan \"el-meşıe=dileme\"nin geçtiği yerleri zikreder. Bunların içinde yukarıdaki başlıkta zikredilenler dışında şu ayetlere yer verilir: \"Allah dileseydi elbette onların kulaklarını sağır, gözlerini kör ederdi. \"(Bakara 20) \"Allah rahmetini dilediğine verir. \"(Bakara 105) \"Eğer Allah dileseydi, sizi de zahmet ve meşakkate sokardı. \"(Bakara 220) \"Dilediği ilimierden ona öğretti. \"(Bakara 251) \"Deki: Lütuf ve ihsan Allah 'zn elindedir. Onu dilediğine verir. \"(AI-i İmran 73) Mutezile ile ehl-i sünnet arasındaki tartışmanın ana noktası, iradenin neye tabi olduğu konusudur. İrade ehl-i sünnete göre ilme tabi iken, Mutezile'ye göre emre tabidir. Ehl-i sünnetin görüşünün isabetli olduğunu \"Allah onlara ahiretten yana bir nasip vermemek istiyor\"(AI-i İmran 176) ayet-i kerimesi göstermektedir. İbn Battal şöyle der: İmam Buhari'nin maksadı \"el-meşıe\" ve \"el-irade\"nin aynı manaya olduğunu vurgulamaktır. İbn Battal şöyle der: Bu mesele, Yüce Allah'ın kulların fiillerinin yaratıcısı olduğu ve onların ancak Allah'ın dilediğini yaptıkları görüşüne dayanmaktadır. Gerçeğin bu olduğuna \"Ve ma teşCiCme illa en yeşaallah =Sizler ancak Rabbinizin dilemesi (izin vermesi) sayesinde (bir şeyi) dileyebilirsiniz\"(İnsan 30) ayet-i kerimesi ve başka şeyler delalet etmektedir. Yüce Allah bir başka ayette \"Allah dileseydi o Nebiden sonra gelen milletler kendilerine açık deliller geldikten sonra birbirleriyle sauaşmazlardı\"(Bakara 253) demektedir. Allah bunu \"Fakat Allah dilediğini yapar\"(Bakara 253) sözüyle teyit etmektedir. Bu da Yüce Allah'ın irade eden olduğu için onların savaşlarını yaptığını göstermektedir. Onların çarpışmalarında asıl fail Allah olunca onların dilemelerini irade eden ve faili olan Allah'tır. Bu ayetten kulların kesbinin ancak Allah'ın dilemesi ve iradesiyle olduğu ortaya çıkmaktadır. Allah bunun meydana gelmesini dilemezse asla vuku bulmaz. Bazı bilginler iradeyi, irade-i emr ve teşri, irade-i kaza ve takdir diye ikiye ayırmışlardır. Bunlardan birincisi ister meydana gelsin, isterse gelmesin itaat ve masiyete taalluk eder. İkincisi ise bütün varlıkları kapsayan, gerek itaat, gerek masiyet bütün hadiseleri kuşatandır. Birinciye Yüce Allah'ın \"Allah sizin için kolaylık ister, zorluk istemez\"(Bakara 185) ayet-i kerimesi işaret etmektedir. İkinciye ise \"Allah kimi doğru yola iletmek isterse onun kalbini İslama açar; Kimi de saptırmak isterse göğe çıkıyormuş gibi kalbini iyice daraItır\"(En'am 125) ayeti işaret etmektedir. Bazıları ise \"irade\" ile \"rıza\"yı birbirinden ayırmışlar ve Allah, masiyetin işlenmesini irade eder ama bundan razı olmaz demişlerdir. Buna delil olarak Yüce Allah'ın \"B!z dilesek elbette herkese hidayetini verirdik\"(Secde 13) ayeti ile \"Bununla beraber 0, kullarının küfrüne razı olmaz\"(Zümer 7) ayetini göstermişlerdir. Bunlar bir de Yüce Allah'ın \"Bununla beraber 0, kullarının küfrüne razı olmaz\" ayetini delilolarak almışlardır. Ehl-i sünnet buna Taberi ve başkalarının ravileri sika olan bir isnadla İbn Abbas'ın \"Eğer inkar ederseniz şüphesiz Allah size muhtaç değildir. Bununla beraber o kullarının küfrüne razı olmaz\"(Zümer 7) ayeti hakkında yaptığı şu açıklama ile cevap vermişlerdir: Yüce Allah burada \"bi ibadihi=kulları\" derken, kalplerini \"la ilahe illallah\" diyerek temizlemek isteyen kafir kullarını kastetmektedir. Allah haklarında \"Şurası muhakkak ki benim Ohlaslı) kulları m üzerinde senin hiçbir ağırlığın olmayacaktır\"(İsra 65) buyurduğu ihlaslı kullar hakkında iradede bulunmuş, onlara imanı sevdirmiş ve la ilahe illallah kelime-i şehadeti olan takva sözünü tutmalarını sağlamıştır. \"Sen sevdiğini hidayete erdiremezsin, bilakis Allah dilediğine hidayet verir\"(Kasas 56) hakkında Said b. el-Müseyyeb babasından şunu nakletmiştir: Bu ayet Ebu Talib hakkında indi. Bunun tamamı mevsul olarak Kasas suresinin tefsirinde geçmişti. Orada hadisin geniş bir açıklaması yapılmıştı. Bu hadisin bir kısmı da Cenaiz bölümünde yer almakta idi. \"Allah sizin için kolaylık ister, zorluk istemez\"(Bakara 185) ayetinde geçen \"kolaylık isteme\", yolculuk halinde ve hastalıkta, oruç tutmayla tutmama arasında gerekli şartlara uygun olarak kulu muhayyer bırakma isteğidir. İstenmediği bildirilen \"zorluk\" yolculukta ve bütün durumlarda kulu oruç tutmak la yükümlü kılmaktır. Şu halde bu yükümlü kılma vuku bulmaz. Zira Allah onu istemiyor. Bu açıklama ile bunun zikredilen hadisten geriye bırakılmasında ve \"irade\" ayetleri ile \"meşiet\" ayetlerini birbirinden ayırmadaki hikmet ortaya çıkmaktadır. Kur'an'da irade de birçok yerde zikredilmektedir. Ehl-i sünnet, ancak Allah'ın irade ettiğinin meydana geldiği ve onun -bunu emretmese bile- bütün varlıklar için irade eden bir varlık olduğu noktasında ittifak etmişlerdir. Mutezile ise şöyle der: Allah kötülüğü irade etmez. Çünkü eğer bunu irade edecek olsaydı, talep ederdi. Mutezile \"emr\"in \"irade\"nin kendisi olduğunu iddia etmiş, ehl-i sünnete çirkin işlerin Allah tarafından irade edildiğini söylemeleri gerektiğini ileri sürerek kara çalmaya kalkışmış ve Allah'ın bundan tenzih edilmesi gerektiğini ileri sürmüştür. Ehl-i sünnet ise bu iddiadan \"Allah karşılığında ceza vermek için bir şeyi irade eder\" diyerek bu suçlamadan kendini kurtarmıştır. Ayrıca Allah'ın cehennemi yarattığı, onun için cehennemlikler var ettiği, cenneti yarattığı ve onun için cennetlikler var ettiği sabittir demiştir. Ehl-i sünnet, Mutezile'nin Allah'ın mülkünde irade etmediği şeylerin meydana geldiğini söylemiş olduklarını ileri sürerek onları susturmuştur. Anlatıldığına göre ehl-i sünnet imamlarından biri münazara yapmak için Mutezile imamlarından birisi ile bir araya getirilir. Mutezile imamı yerine oturun ca \"Çirkin fiillerden münezzeh olan Allah'ı tesbih ederim\" der. Buna karşılık ehl-i sünnet imamı \"Mülkünde ancak dilediği olan Allah'ı tesbih ederim\" der. Bunun üzerine Mutezile imamı \"Rabbimiz kendisine isyan edilmesini ister mi?\" diye sorunca, ehl-i sünnet imamı \"Rabbimiz istemediği halde kendisine isyan edilebilir mi?\" diye sorar. Mutezile imamı \"Allah hidayetime engelolsa ve benim için helaki takdir etse bana iyilik mi yapmış olur, yoksa kötülük mü?\" der. Ehl-i sünnet imamı \"Allah senin olan şeyi sana vermese kötülük yapmış olur, kendisine ait olan şeyi vermezse o rahmetini dilediğine verir\" der. Netice olarak Mutezile imamı tartışmada söyleyecek söz bulamaz. İmam Buhari mu allak hadisten sonra onyedi hadise yer vermiştir. Bunların tümünde \"meşiet=dileme\"den söz edilmektedir. Hadislerin tamamı değişik bölümlerde geçmişti. Enes'in rivayet ettiği \"Sizler Allah'a dua ettiğiniz zaman duada kesin bir dille istemede bulunun\" yani azimli olun ve tereddüt etmeyin hadisinin açıklaması Daavat bölümünde geçmişti. Hz. Ali'nin rivayet ettiği hadisin açıklaması, Teheccüd Bölümünde geçmişti. Bu hadisin konumuzia olan ilgili kısmı, Hz. Ali'nin \"Nefislerimiz Allah'ın elindedir. Bizi uyandırmak istediği zaman uyandırır\" demesi ve Nebi s.a.v.'in de onun bu sözünü kabul etmesidir. Ebu Hureyre'nin rivayet ettiği üçüncü sıradaki \"mu'min kişinin benzeri, bir sap üzerinde biten taze ekin gibidir\" hadisinin açıklaması Rikak Bölümünde geçmişti. Hadisin buraya alınması son kısmındaki \"Nihayet Allah onu dilediği zaman (bir seferde) kırar devirir\" cümlesidir. Yani Allah onu kırıp devirme iradesinin ezelde tecelli ettiği vakitte kırıp devirir. İbn Ömer'in dördüncü sırada naklettiği \"Sizden önce gelen ümmetIere nispetle sizin dünyada kalışınız (bütün güne nispetle) ikindi namazından güneşin batmasına kadar (olan müddet gibi)dir\" hadisi uzun şekliyle SaıM Bölümünde açıklamasıyla birlikte geçmişti. Bey'at le ilgili Ubade b. es-Samit'in naklettiği beşinci sıradaki hadisin açıklaması İman Bölümünde geçmişti. Ebu Hureyre'nin Süleyman'ın aleyhisseIa.m sözü olarak \"Ben bir gecede kadınlarımı dolaşırım\" sözünün açıklaması Enbiya hadisleri arasında geçmişti. İbn Abbas'ın \"Bu yaşlı bir ihtiyar hasta üzerinde harareti kaynayan ve onu kabirleri ziyaret ettirecek olan humma hastalığıdır!\" hadisinin açıklaması Tıp Bölümünde geçmişti",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 106
			}
		}
	]
}