{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7484,
			"arabicnumber": 7484,
			"text": "Aişe r.anha şöyle demiştir: \"Ben Nebi Sallallahu Aleyhi ve Sellem'in eşlerinden hiçbirisini Hatice'yi kıskandığım derecede kıskanmadım. Yemin olsun Rabbi Nebi Sallallahu Aleyhi ve Sellem'e Hatice'ye cennette bir ev müjdesi vermesini emretmiştir\" dedi. Fethu'l-Bari Açıklaması: AÇIKLAMA SONRASI; ALLAH C.C.’NUN MELEKLERLE KONUŞMASINA DAİR BAB VE HADİSLER VAR. Yüce Allah'ın \"Allah'ın huzurunda kendisinin izin verdiği kimselerden başkasının şefaati fayda vermez sözü.\" İmam Buhari bu ayeti sonuna kadar zikrettikten sonra şöyle demiştir: Yüce Allah \"Rabbiniz ne yarattı?\" dememiş bunun yerine \"Rabbiniz ne buyurdu\" demiştir. İbn Battal şöyle der: İmam Buhari, bundan Allah'ın sözünün kadim olup, sıfatlarıyla kaim olduğu ve onunla birlikte mevcut olduğu, kelamının -Allah'ın kelamı olmadığını söyleyen Mutezile'nin aksine- mahlukların sözlerine benzememe özelliğinin devam ettiği sonucunu çıkarmıştır. Beyhaki, el-İtikad isimli eserinde şöyle der: Kur'an Allah'ın kelamıdır. Allah'ın kelamı onun zat! sıfatlarından biridir. Allah'ın zat! sıfatlarından hiçbiri mahluk olmadığı gibi, yaratılmış (muhdes) ve sonradan olma da (hadis) değildir. Yüce Allah \"Biz, bir şeyin olmasını istediğimiz zaman ona (söyleyecek) sözümüz sadece 'ol' dememizdir. Hemen 0luverir\"(Nahl 40) buyurmaktadır. Kur'an mahluk olsaydı \"kün\" emri ile mahluk olurdu. Yüce Allah'ın bir şeye hitabının \"kün\" emriyle olması imkansızdır. Çünkü bu, ikinci, üçüncü bir \"kün\" emrini gerektirirdi ve böylece emir zincirleme (teselsül) eder giderdi.. Bu da geçerli değildir. Yüce Allah \"Rahman, Kur'an'ı öğretti. İnsanı yarattl\"(Rahman 1,2) buyurmaktadır. Allah Kur'an için \"öğretme\" fiilini kullanmaktadır. Çünkü o, onun kelamı ve sıfatıdır. İnsan için ise \"yaratma\" fiilini kullanmaktadır. Çünkü insan, Allah'ın yaratığı ve sanatının eseridir. Şayet böyle olmasaydı \"halaka'l-Kur'ane ve'l-insane=O Kur'an'ı ve insanı yarattı\" derdi. Yüce Allah \"Ve Allah Musa ile gerçekten konuştu\"(Nisa 164) buyurmaktadır. Konuşan kimsenin kelamı (kün emri gibi bir şeyle) kendi dışında bir şeyle mevcut olamaz. Yüce Allah şöyle buyurur: \"Allah bir insanla ancak vahiy yoluyla veya perde arkasından konuşur, yahut bir elçi gönderip izniyle ona dilediğini vahyeder. O yücedir, hakimdir. \"(Şura 51) Allah'ın kelamı ancak mahluk olan bir şeyin içinde mahluk olarak bulunsaydı, ayette zikredilen şekilleri şart koşma anlamsız olurdu. Çünkü bütün mahlukat, Allah'ın dışındakilerin sözlerini duyma açısından aynı durumdadır. Netice olarak Cehmiyyenin \"Allah'ın kelamı, Allah dışında başka bir şeyde mahluktur\" şeklindeki ifadeleri temelsiz kalmaktadır. Onların \"Allah bir ağaçta kelam yaratmış ve Musa'ya onunla konuşmuştur\" şeklindeki görüşleri, Allah'ın kelamını bir melek veya Nebiden dinleyen kimsenin aynı kelamı Musa' dan dinleyenden daha üstün olduğunu söylemelerini gerektirir. Yine ağacın Yüce Allah'ın Musa'ya yaptığı hitabı konuşmuş olduğunu söylemeleri de gerekir. O hitap \"Muhakkak ki ben, yalnızca ben Allah 'ım. Benden başka ilah yoktur. Bana kulluk et; Beni anmak için namaz kıl\"(Taha 14) cümlesidir. Yüce Allah müşriklerin \"Bu insan sözünden başka bir şey değildir\"(Müddessir 25) şeklindeki sözlerini tepkiyle karşılarken \"O şüphesiz değerli, güçlü ve arşın sahibi (Allah'ın) katında itibarlı bir elçinin getirdiği sözdür\"(Tekvir 19,20) ifadesine itiraz etmemektedir. Çünkü \"Resulün sözü\"nün manası Nebi Sallallahu Aleyhi ve Sellem'in şerefli bir elçiden aldığı söz anlamındadır. Bu tıpkı \"Ve eğer müşriklerden biri senden eman dilerseAllah'ın kelamını işitip, dinleyineeye kadarona eman ver\"(Tevbe, 6) ve 'i1paçık kitaba andolsun ki biz anlayıp düşünmeniz için onu Arapça bir Kur'an klldık\"(Zuhruf, 2,3) ifadeleri gibidir. Çünkü \"Kur'an kıldık\" demek \"ona Kur'an adını verdik\" demektir. Bu 'i1llah'ın verdiği rızka karşı şükrü onu yalanlamakla mı yerine getiriyorsunuz?\"(Vakıa 82) \"Kendilerinin hoşlarına gitmeyen şeyleri Allah'a isnad ediyorlar\"(NahI, 62) \"Rablerinden kendilerine ne zaman yeni bir ihtar gelse onlar bunu hep alaya alarak kalpleri oyuna, eğlenceye dalarak dinlemişlerdir\"(Enbiya 2,3) ayetlerindeki ifadeler gibidir. Vurgulanmak istenen şudur: Muhdes olan zikrin bizzat kendisi değil, indirilmesidir. Ahmed b. Hanbel görüşüne bunu delilolarak getirmiştir. Sonra Beyhaki Neyar b. Mükerrem'in hadisine yer vermiştir. Buna göre Ebu Bekir onlara Rum suresini okumuş, onlar da \"Bu senin kelamındır veya arkadaşının kelamıdır\" demişler. Ebu Bekir \"Bu ne benim, ne de arkadaşımın kelamıdır, fakat bu Allah'ın kelamıdır karşılığını vermiştir.(Beyhaki, Şuabu'l-İman, 188) Bu hadisin aslını Tirmizi sahihtir değerlendirmesiyle birlikte nakletmiştir.(Tirmizi, Tefsir, Suretu'r-Rum) Ali b. Ebi Talib \"Ben mahluk olan bir şeyin hakemliğine başvurmadım. Ben sadece Kur'an'ın hakemliğine başvurdum\" demiştir. (Beyhaki, Şuabu'l-İman, 1, 188) İbn Hazm, el-Milel ve' n-Nihai isimli eserde şöyle demiştir: Müslümanlar, Yüce Allah'ın Musa ile konuştuğu, Kur'an'ın Allah'ın kelamı olduğu, aynı şekilde diğer semavi kitaplarla sahifelerin de onun sözü olduğu noktasında icma etmişlerdir. Bazı Hanbelı bilginler ve başkaları Arapça olan Kur'an'ın ve Tevrat'ın Allah'ın kelamı olduğu kanaatine varmışlardır. Onların görüşüne göre Allah dilediğinde hep konuşandır ve o Kur'an harfleriyle konuşur ve dilediği meleklere ve Nebilere sesini işittirir. Selef bilginlerinin çoğunluğundan nakledilen sabit görüş bu konulara dalmamak, derinleşmemek ve sadece Kur'an'ın Allah'ın kelamı olduğunu ve mahluk olmadığını söyleyip, bunun dışında susmaktır. \"Mesruk'un nakline göre İbn Mesud şöyle demiştir: Yüce Allah vahiyle konuşunca göktekiler bir şey işitirler ... \" Beyhaki, el-Esma ve's-Sıfat isimli eserde bu haberi mevsul olarak nakletmiştir. Ahmed b. Hanbel ise aynı haberi Ebu Muaviye'den şu şekilde nakleder: \"Yüce Allah vahiy ile konuştuğunda semada bulunanlar semada düz bir taş üstünde zincir çekme sesi gibi bir ses duyarlar ve hemen düşüp bayılırlar. Cebrail gelinceye kadar o şekilde kalmaya devam ederler. Cebrail gelince kalplerinden korku giderilir. Sonra \"Ya Cibril! Rabbiniz ne buyurdu?\" diye sorarlar. Cebrail \"Hak olanı buyurdu\" der. Bunun üzerine onlar \"Hak, hak diye nida ederler.\" \"Deyy6n (yani karşılık verici) ancak benim!\" Hal1ml şöyle demiştir: Bu kelime \"maliki yevmi'd-dın\"den alınmıştır. Deyyan, hesaba çeken, karşılığını veren, amel edenin amelini boşa çıkarmayan demektir. Hadis şefaatin olacağını göstermektedir. Harid ve Mutezile mezhepleri ise şefaati inkar ederler. Şefaat çeşit çeşittir. Ehl-i sünnet şefaatin birçok anlamı içinden \"mahşerin korkusundan kurtulma\" anlamını kabul etmiştir. Bu şefaat Rikak Bölümünde açıkça belirtildiği üzere Muhammed Mustafa'ya Sallallahu Aleyhi ve Sellem mahsustur. Bu çeşit bir şefaati ümmete mensup fırkalardan hiçbiri inkar etmemiştir. Bu şefaat çeşitlerinden birisi ise, bir topluluğa yapılacak şefaattir ki buna nail olanlar cennete hesaba çekilmeksizin gireceklerdir. Bir diğer şefaat çeşidi ise günahlarının cehenneme girmesine sebep olduğu asi bir topluluğu cehennemden çıkarma şeklindedir. Birçok haberde bu çeşit şefaatten söz edilmektedir. Ehl-i sünnet bu şefaat türünün geçerliliği konusunda görüş birliği etmişlerdir. Başarı yalnız Allah'tandır. Dördüncü sıradaki teğanni ile Kur'an'ı aşikare okumadan söz eden Ebu Hureyre hadisinin açıklaması Fadailu'l-Kur'an bölümünde geçmişti. \"Allah Adem'e bir ses ile 'Allah sana zürriyetinden cehenneme gidecek bir topluluğu çıkarmanı emrediyor!' diye nida eder.\" İmam Buharl'nin bu yoldan zikrettiği son hadis budur. Hadisi tam metin olarak Hac suresinin tefsirinde yukarıda zikredilen isnadla nakletmişti. Hadiste \"nida eder\" ifadesi yer almaktadır. Abdullah b. Ahmed b. Hanbel es-Sünne isimli eserde şöyle der: Ben babama \"Allah Musa ile konuştuğunda sesle konuşmamıştır\" diyen kimselerin durumlarını sordum. Bana şöyle cevap verdi: \"Asine bir sesle konuşmuştur.\" Bu hadisler nasıl gelmişse o şekilde rivayet olunmaktadır",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 110
			}
		}
	]
}