{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7487,
			"arabicnumber": 7487,
			"text": "Ebu Zer' 'in nakline göre Nebi Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Cebrail bana geldi ve 'Allah'a hiçbir şeyi ortak kılmayarak ölen her kişi cennete girer!' diye müjdeledi. Ben 'Ya Cibril! Bu kimse hırsızlık yapsa, zina etse de mi?' diye sordum. Cebrail '(evet) hırsızlık yapmış ve zina etmiş olsa da (cennet'e girer)!' diye cevap verdi.\" Fethu'l-Bari Açıklaması: \"Yüce Allahı'ın Cebrail ile kelamı ve meleklere nidası.\" İmam Buhari bu başlık altında bir haber ve üç hadise yer vermiştir. Birinci hadiste Cebrail' e nida varken, ikincisinde Allah'ın meleklere başlıktakinin aksine hitabı yer almaktadır. İmam Buhari adeta hadisin bazı rivayet yollarında yer alan ifadeye işaret etmektedir. Müslim'de (Müslim, Birr ve Sıla) Suheyl b. Ebi Salih'in babasından yaptığı nakile göre bu hadis şu şekildedir: \"Yüce Allah bir kulunu sevdi mi Cebrail'i çağırır ve 'Ben filanca kulumu seviyorum sen de sev' buyurur.\" Şeyh Ebu Muhammed b. Ebu Cemre şöyle demiştir: Yüce Allah'ın lutfunun bolluğunu \"sevgi\" ile ifade etmesi kullarını rahatlatma ve içlerine sevinç vermeye yöneliktir. Çünkü kul mevlasından onu sevdiği haberini duyunca, kendi nazarında sevincin zirvesine çıkar ve her türlü hayrı elde etmiş olur. Ebu Muhammed şöyle devam eder: Bu da ancak kendi yapısında kişilik, mürüwet ve güzel bir dönüş olan kimse için mümkündür. Nitekim Yüce Allah \"Allah'a yönelenden başkası ibret almaz\"(Mu'min 13) buyurmaktadır. Buna karşılık nefsinde nefsani hazıarının peşinde olma ve şehvet baskın olan kimseleri ancak sert bir şekilde azarlama ve darp caydırır. Şeyh şöyle devam eder: Cebraiı' e -bazı bilginlere göre onun dışında başka meleklere de- \"sev\" emrinin verilmesi, insanın Allah katındaki mertebesini hemcinsleri olan diğer insanlar içinde başkalarından üstün kılmayı amaçlamaktadır. Şeyh Ebu Muhammed'e göre bu hadisten iki sonuç çıkmaktadır. 1- Hadis farz ve sünnet olmak üzere iyilik amellerine teşvik etmektedir. 2- Hadiste masiyet ve bid'atlerden çok çok sakındırma yapılmaktadır. Zira bunlar Yüce Allah'ın gazabını doğurması muhtemel fiillerdir. Başarı ancak Allah'tandır. Şeyhü'I-İslam İbn Teymiye'nin görüşü şu şekildedir. Selef bilginleri ve imamlar derler ki Allah kendi dilemesi (meşiet) ve kudreti ile konuşmaktadır. Onun kelamı tür olarak kadimdir. Şu manadaki o dilediğinde hala konuşmaktadır. Kelam kemal sıfatıdır. Konuşan konuşmayandan daha mükemmeldir. Dilemesi ile (meşiet) ve kudretiyle konuşan, dilemesiyle konuşamayandan daha mükemmeldir. Dilemesiyle ve kudretiyle konuşmaya devam eden konuşma stfatı kendisi için mümkün olan (sonradan olan) kimseden daha mükemmeldir. İbn Teymıye bir de şunu söyler: Doğru olan Allah'ın dilediği takdirde hala konuştuğudur ve o kendi dilemesi (meşiet) ve kudretiyle konuşur. Onun kelimelerinin nihayeti yoktur ve o Musa'ya işitecek olduğu bir sesle hitap etmiştir. O Musa'ya nida etmiş ve Musa da gelmiştir. Allah Musa'ya bundan önce nida etmemişti. Rabbın sesi kulların sesine benzemez. Tıpkı ilminin onların ilmine benzemediği gibi. İbn Teymıye, Mecmuu'I-Fetava, s. 579",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 113
			}
		}
	]
}