{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7490,
			"arabicnumber": 7490,
			"text": "İbn Abbas r.a. şöyle demiştir: \"Namazında yüksek sesle okuma, Onda sesini fazla da kısma; ikisinin arası bir yol tut\"(İsra 110) ayet-i kerimesi Resulullah Sallallahu Aleyhi ve Sellem Mekke'de gizlenmekte iken indirildi. Resulullah Sallallahu Aleyhi ve Sellem Kur'an okurken sesini yükseltir, müşrikler ise onun sesini işitirierdi. Hem Kur'an'a, hem onu indirene, hem de Kur'an'ın kendisine geldiği kimseye söverlerdi. Yüce Allah \"Yüksek sesle okuma, onda sesini fazla da kısma\" yani namazında açıktan okuma sonra müşrikler işitirler, sesini sahabilerinden gizli yapma, sonra onlara işittiremezsin. Bu ikisi arası yol tut, pek bağırmayarak onlara işittir ki onlar Kur'an'ı senden alabilsinler\" buyurdu. Fethu'l-Bari Açıklaması: \"Yüce Allah'ın 'Onu kendi ilmiyle indirdi, melekler de (buna) şahitlik ederler' sözü.\" Allah diğer kitaplarını da bütün Nebilere bu şekilde indirmiştir. Taberi tefsirinde şu ifade nakledilir: \"Allah onu insanlar arasından onu almaya senin ehil olduğunu bilerek indirdi.\" ---İbnü'l-Cevzi şöyle der: 'Enzelehu bi ilmihl' cümlesi üç türlü açıklanmıştır: Birincisi, Zeccac'ın görüşü olup, Allah onu içinde ilmi olduğu halde indirmiştir. İkincisi, Allah onu kendi ilminden indirmiştir. Bu görüşü Ebu Süleyman ed-Dimeşki dile getirmiştir. Üçüncüsü, Allah onu insanların arasından indirilmeye ehil olduğunu bilerek indirmiştir. Bu İbn Cerir et-Taberl'ye aittir (Zadü'l-mesir). İbn Kesir ise şöyle der: \"Enzelehu bi ilmihi\" yani Allah onu içinde kullarının bilmesini istediği açık deliller, hidayet, furkan, sevdiği ve razı olduğu şeylerle, sevmediği ve razı olmadığı şeylere dair bilgisi ile indirdi (İbn Kesir -özetle-, II, 428). --- İbn Battal şöyle demiştir: \"İnzal = indirme\"den maksat, Allah'ın kullarına Kur'an'da geçen farzlarının manasını anlatmaktır. Yoksa Kur'an'ın ona indirilmesi yaratılmış cisimlerin indirilmesi gibi değildir. Çünkü Kur'an cisim olmadığı gibi, mahluk da değildir. İkinci görüş erken dönem (selef) ve geç dönem (halef) ehl-i sünnet bilginleri arasında ittifakla kabul edilen görüştür. Birinciye gelince bu tevil bilginlerinin metoduna göredir. Selef bilginlerinden nakledilen onların Kur'an'ın Allah'ın kelamı olduğu, mahluk olmadığı, Cebrail'in onu Yüce Allah'tan aldığı ve Muhammed'e aleyhisselam, onun da ümmetine tebliğ ettiği bir Allah kelamı olduğu noktasında ittifak ettikleridir. \"Mücahid, Emir yedinci sema ile yedinci arz arasında iner durur demiştir.\" Firyabı ve Taberi bu haberi İbn Ebu Nuceyh vasıtasıyla Mücahid'e ulaştırarak \"Yedinci gökten yedinci yeryüzüne iner durur\" şeklinde nakletmişlerdir. İmam Buhari bu konuda üç hadise yer vermiştir. Bunlardan birincisi, Bera b. Azib'in rivayet ettiği yatağa girerken okunacak dua ile ilgilidir. Bu hadisin geniş bir açıklaması Ed'ıye Bölümünde geçmişti. Hadisin buraya alınmasından maksat içindeki \"Ben senin indirdiğin kitabına inandım\" cümlesidir. İkinci sıradaki Abdullah b. Evfa hadisinin açıklaması Cihad Bölümünde geçmişti. Hadise burada yer verilmesi \"Allah'ım ey kitabı indiren Allah'ım\" cümlesidir. Üçüncü sıradaki İbn Abbas hadisi \"Namazında yüksek sesle okuma; onda sesini fazla da kısma\" ayetiyle ilgilidir. Bu ayet Resulullah Sallallahu Aleyhi ve Sellem Mekke'de gizli bir halde bulunurken inmişti. Hadisin açıklaması İsra Suresi Tefsirinin son kısmında geçmişti. Hadise burada yer verilmesi, \"indirildi\" cümlesinden dolayıdır. Kur'an-ı Kerim'de \"inzal\" ve \"tenzil\" sözcüklerinin açıkça geçtiği ayetler çoktur. Rağıb şöyle der: Kur'an ve melekler anlatılırken geçen \"inzal\" ve \"tenzil\" sözcükleri arasındaki fark şudur: \"Tenzil\" parça parça ve ardarda indirildiğine işaret ettiği yerlere mahsustur. \"İnzal\" ise bundan daha geneldir. Yüce Allah'ın \"İnna enzelnahu ff leyleti'l-kadr=Biz onu kadir gecesinde indirdik\"(Kadr 1) ayeti buna örnektir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 116
			}
		}
	]
}