{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7508,
			"arabicnumber": 7508,
			"text": "Bize Katâde, Ukbe ibnu Abdilgâfır'den; o da Ebû Saîd el-Hudrî (radıyallahü anh)’den tahdîs etti. Peygamber(sallallahü aleyhi ve sellem) geçmiş insanlar içinde yahut sizden evvelki milletler içinde bir adamı zikretti de bir kelime söyledi. Yâni \"Allah o adama mal ve evlâd verdi. Nihayet ona vefat zamanı yaklaştığında, oğullarına hitaben: Ben size nasıl bir baba oldum? diye sordu. Sen bize hayırlı bir baba oldun, dediler. Şu muhakkak ki, bu baba Allah yanında önden bir hayır göndermedi yahut bir hayır biriktirmedi. Şübhesiz Allah(tevhîdden başka hiçbir hayrı olmayan) bu zâtı ele geçirdiğinde, ona azâb edecektir. Şimdi bakınız! Ben öldüğüm zaman sizler beni kömür oluncaya kadar yakınız. Sonra beni ezip öğütünüz -yahut: beni toz yapınız, dedi- Sonra rüzgârı şiddetli esen bir gün olunca, benim tozlarımı bu şiddetli rüzgârın içinde uçurup dağıtın! dedi\". Peygamberi şöyle dedi: \"O adam, Rabb 'ime yemin olsun, bu dediklerimi muhakkak yapacaksınız diye, oğullarından mîsâklarını, yani taahhüdlerini aldı. Onlar da babaları öldükten sonra onun vasiyet ettiği işleri yaptılar. Sonra onun tozlarını rüzgârı şiddetli esen bir günde uçurup dağıttılar. Azîz ve Celîl olan Allah o tozlara 'Ol!'emrini verdi. Derhâl o tozlar ayakta dikilen bir adam oluverdi. Allah: Ey kulum! Sen 'in bu yaptığın işleri yapmana seni sevkeden nedir? diye sordu. zât: Sen'in korkun, yahut Sen'den korkmaktır, dedi. Allah: Kusuru, elden kaçan fırsatı Allah'ın merhamet etmesi telâfi eder -yahut diğer bir kerre de: Kusuru, elden kaçan fırsatı Allah korkusundan başkası telâfi edemez-, buyurdu\". şöyle dedi: Ben bu hadîsi Ebû Usmân en-Nehdî’ye tahdîs ettim de o: Ben bunu Selmân el-Fârisî'den işittim. Şu kadar var ki, o bunda \"Beni deniz içine tozutup dağıtınız\" fıkrasını ziyâde etti yahut onun tahdîs ettiği gibi söyledi",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 133
			}
		}
	]
}