{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7510,
			"arabicnumber": 7510,
			"text": "Ma'bed b. Hilal el-Anezi şöyle demiştir: Basra ahalisinden birkaç kişi ile toplanıp, Enes b. Malik'i ziyarete gittik. Bizimle birlikte Sabit el-Bünani de gitmişti. Sabit bizim için Enes'e 'Büyük şefaat hadisi'ni soracaktl. Enes Basra'ya iki fersah uzaklıkta bulunan Zaviye mevkiindeki kasrında ikamet ediyordu. Ziyaretimiz Enes'in kuşluk namazı kıldığı bir zamana tesadüf etmişti. İçeri girmek istedik, bize izin verdi. Verilen izin üzerine Enes b. Malik'in huzuruna girdik. Enes bir minder üzerinde oturuyordu. Girerken Sabit' e şefaat hadisinden önce hiçbir şey sormamasını tembih etmiştik. O da \"Ey Ebu Hamza! Bu Basralı kardeşlerimiz size şefaat hadisini sormaya geldiler\" dedi. Bunun üzerine Enes, Hz. Muhammed bize şöyle anlattı dedi: \"Kıyamet günü olduğu zaman insanlar birbiri üzerine dalgalanıp çalkalanırlar. Nihayet Adem'e gelirler ve 'Rabbin huzurunda bize şefaat et!' derler. O da 'Ben buna ehil değilim. Fakat İbrahim'e gidin, çünkü o halilullahtır' der.\" Resulullah Sallallahu Aleyhi ve Sellem şöyle devam etti: \"Sonra İbrahim'e gelirler. O da 'Ben buna ehil değilim, fakat siz Musa'ya gidin. Çünkü o kelimullahtır (yani Allah 'ın kelam ettiği Nebidir)' der. Akabinde insanlar Musa'ya gelirler. O da 'Ben buna ehil değilim, fakat sizler İsa'ya gidin. Çünkü o Allah 'ın ruhu ve kelimesidir' der. İsa'ya gelirler, o da 'Ben buna ehil değilim fakat siz Muhammed'e gidin' der. İnsanlar bana gelirler. Ben de 'Ben onun için (yaratılmış)ımdır' derim. Hemen gider Rabbimin huzuruna izin isterim. Bana izin verilir. Bana şimdi hatırlayamadığım, kendisine yapacağım birtakım hamdler ilham eder. Ben bu hamdlerle hamdederim ve kendisine secdeye kapanırım. Bana 'Ya Muhammed! Başını kaldır, söyle, sözün dinlenir, iste, isteğin sana verilir, şefaat et, şefaatin kabul edilir!' buyrulur. Bunun üzerine ben 'Ya Rab! Ümmetimi, ümmetimi!' diye şefaat dilerim. Bana 'Git, kalbinde bir arpa ağırlığı kadar iman bulunan kimseleri oradan çıkar!' denilir. Ben de gider bunu yaparım. Sonra yine Rabbime döner bu hamdlerle ham d ederim, sonra Rabbime secdeye kapanmm. Bana 'Ya Muhammed! Başını kaldır, söyle sözün dinlenir; iste, sana verilir; şefaat et, şefaatin kabulolunur!' denilir. Bunun üzerine ben 'Ya Rabbi! Ümmetimi, ümmetimil' diye şefaat dilerim. Bana 'Git kalbinde bir zerre ağırlığınca yahut hardal tanesi kadar iman bulunanları oradan çıkar!' denilir. Ben gider bunu yaparım, sonra döner yine bu hamdler ile Rabbime hamd ederim. Sonra ona secdeye kapanmm. Bana 'Ya Muhammed! Başını kaldır, söyle, sözün dinlenir; iste, isteğin sana verilir. Şefaat et, şefaatin kabul edilir!' buyurulur. Bunun üzerine ben 'Ya Rabbi! Ümmetimi, ümmetimil' diye şefaat dilerim. Bana 'Git, kalbinde bir hardal tanesi ağırlığından daha az, daha az, daha az iman bulunan kim varsa onları da ateşten çıkar!' buyurur. Ben hemen gider bunu yaparım.\" Ma'bed şöyle dedi: Akabinde Enes'in yanından çıktığımızda arkadaşlarımızdan bazılarına \"Hasan el-Basrl'nin yanına uğrasak. O Ebu Halife et-Taı'nin evinde (Haccac'ın zulmünden) gizlenmiş bir halde bulunmaktadır\" dedim. Enes b. Malik'in bize rivayet ettiği hadisle Hasan'ın yanına vardık, ona selam verdik. Bize izin verdi. Ona \"Ey Ebu Said! Kardeşin Enes b. Malik'in yanından geldik. Şefaat hakkında bize rivayet ettiği hadisin benzerini hiç duymamıştık\" dedik. O \"Devam edin, hadisi söyleyin!\" dedi. Biz de ona bu hadisi rivayet ettik. Hadis bu son noktaya ulaşınca Hasan bize \"Devam edin, daha söyleyinı\" dedi. Biz de ona \"Enes bize daha fazla bir şey söylemedi\" dedik. O da bize şunları söyledi: \"Yemin olsun o bunu bana yirmi sene önce rivayet etmişti. Kendisi o günlerde bütün hafızasını ve kuwetini toplamış haldeydi. Şimdi ise bir kısım şeyi terk etmiştir. O bunu unuttu mu, yoksa güvenip dayanırsınız diye sizlere rivayet etmeyi mi hoş görmedi bilmiyorum\" dedi. Biz de ona \"Ey Ebu Said! Bize sen rivayet et\" dedik. Bunun üzerine güldü ve \"İnsan aceleci (bir ta bey'at ta) yaratılmıştır\"(Enbiya 37) Bunu size sadece o hadisi rivayet etmeyi isteyerek zikrettim dedi ve şöyle devam etti: \"Enes bana bu hadisi size rivayet ettiği gibi nakletti. Bundan sonra Resulullah s.a.v. şöyle demiştir: \"Sonra ben dördüncü defa yine Rabbime döner bu hamdler ile O'na tekrar hamd ederim. Sonra ona secde ederek kapanmm. Bunun üzerine bana 'Ya Muhammed başını kaldır ve söyle; sözün dinlenir, iste sana verilir, şefaat et şefaatin kabul edilir!' buyurulur. Ben de 'Ya Rab! Bana izin ver de la ilahe illailah diyen bütün tevhid ehli hakkında şefaat edeyim diye niyaz ederim. Bunun üzerine Yüce Allah 'İzzetim, celalim, kibriyam, azametim hakkı için la ilahe illailah diyen tevhid ehlinin hepsini muhakkak surette cehennemden çıkaracağım!' buyurur",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 135
			}
		}
	]
}