{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7523,
			"arabicnumber": 7523,
			"text": "Abdullah b. Abbas r.a. şöyle demiştir: Ey müslümanlar topluluğu! Herhangi bir şeyi Kitap ehli olanlara nasıl sorarsınız? Halbuki Allah'ın, Nebiiniz üzerine indirmiş olduğu kitabı, Allah'tan haberlerin halisi olarak en yenisi ve başka şey ile karışmamış alanıdır. Oysa Allah, sizlere Kur'an'ında ve Resulünün diliyle kitap ehli olanların Allah'ın kitaplarını tebdil etmiş ve değiştirmiş olduklarını, onların bu kitapları kendi elleriyle yazıp, onlar sebebiyle az bir bahayı satın almaları için \"Bu Allah'ın katındandır\" dediklerini bildirmiştir. Size gelmiş olan ilim, sizleri onlara sormaktan yasaklamıyar mu? Hayır valiahi bizler onlardan hiçbir kimsenin Allah'ın sizlere indirmiş olduğu kitaptan bir şey soranını görmemişizdir.\" Fethu'l-Bari Açıklaması: Yüce Allah'ın 'O her an bir iştedir' sözü.\" Bu ayetin tefsiri hakkındaki görüşler Rahman Suresinin Tefsirinde geçmişti. \"Rablerinden kendilerine ne zaman yeni bir ihtar gelse onlar bunu hep alaya alarak kalpleri oyuna, eğlenceye dalarak dinlemişlerdir.\" \"Olur ki Allah bundan sonra bir durum ortaya çıkarıverir.\" \"Şüphesiz Allah dileyeceği herhangi bir işi meydana çıkarır ve onun meydana çıkardığı işlerden birisi namazda konuşmamanızdır. \" İbn Ebi Hatim'in Hişam b. Ubeydullah er-Razl'den nakline göreCehmiyye mezhebine mensup bir kişi, Kur'an'ın mahluk olduğu şeklindeki iddiasına bu ayeti delilolarak getirdi. Bunun üzerine Hişam ona \"Kur'an bizim açımızdan ve kullar açısından muhdestir (sonradan tebliğ edilmedir)\" dedi. Ahmed b. İbrahim ed-Oeruki' den de buna benzer bir görüş nakledilmiştir. Nuaym b. Hammad'ın nakline göre Hişam \"Kur'an Allah katında değil, insanların nezdinde muhdestir\" demiştir ve şöyle devam etmiştir: Bundan maksat Kur'an Nebi s.a.v.'in nezdinde muhdestir. Nebi Sallallahu Aleyhi ve Sellem onu ömrünün ilk yıllarında bilmezken, sonradan öğrenmiştir. Ama Yüce Allah ezelde alimdi ve hala alimdir. O bir başka yerde şöyle söyler: Allah'ın kelamı muhdes değildir. Çünkü o ezelden beri konuşandır (mütekellim). Yoksa bir zamanlar konuşmayıp, sonra kendisine kelam ihdas etmiş değildir. Bunu iddia eden kimse, Allah'ı yaratıklarına benzetmiş olur. Çünkü insanlar bir zamanlar konuşmuyorlardı. Sonra kendilerine kelam icad ettiler ve bununla konuşmaya başladılar. Herevl'nin el-Faruk isimli eserde isnadıyla ifadesine göre Harb el-Kirmani şöyle demiştir: İshak b. İbrahim el-Hanzali'ye yani İbn Rahuye'ye Yüce Allah'ın \"Rablerinden kendilerine ne zaman yeni bir ihtar gelse onlar bunu hep alaya alarak kalpleri oyuna, eğlenceye dalarak dinlemişlerdir\" ayetini sordum. Bana dedi ki: O Rabbu'l-İzze açısından kadimdir. Yeryüzüne inme açısından muhdestir. Buharl'nin selefinin bu konudaki görüşü böyledir",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 148
			}
		}
	]
}