{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7524,
			"arabicnumber": 7524,
			"text": "İbn Abbas Yüce Allah'ın \"(Resulüm!) onu (vahyi) çarçabuk almak için dilini kzmzldatma. \"(Kıyame 16) ayeti hakkında şunları söylemiştir: Nebi Sallallahu Aleyhi ve Sellem indirilen ayetlerin zaptı yüzünden güçlük çeker, bundan dolayı çoğu kereler dudaklarını kımıldatırdı. Ravi Said b. CUbeyr \"İşte ben onları İbn Abbas'ın kımıldattığı gibi kımıldatıyorum\" dedi ve dudaklarını hareket ettirdi. Bunun üzerine Yüce Allah \"(Resulüm!) onu (vahyi) çarçabuk almak için dilini kzmzldatma. Şüphesiz onu, toplamak (senin kalbine yerleştirmek) ve onu okutmak bize aittir\"(Kıyame 16,17) ayet-i kerimesini indirdi. İbn Abbas ayette geçen \"cem'ahu\" kelimesini, \"Onu göğsünde toplamak bize aittir. Sonra sen onu okursun. Biz onu (Cebrail'in diliyle) okuduğumuz zaman sen onun okuyuşuna tabi ol\" demektir dedi. Yineİbn Abbas \"Sen onu dinle ve sus. Sonra sana okutmak da bize aittir\" buyurdu dedi. Artık bundan sonra Nebi Sallallahu Aleyhi ve Sellem Cebrail kendisine geldiği zaman susup onu dinler, Cebrail gidince getirmiş olduğu ayetleri nasılokumuşsa, öylece okurdu. Fethu'l-Bari Açıklaması: İbn Battal şöyle demiştir: Hadisin manası şudur: Ben kulum beni zikrettiği an onunla birlikte olurum. Bir başka ifadeyle; ben muhafazam ve korumamla onunla birlikte olurum yoksa bu, Allah kulu nerdeyse zatıyla birlikte orada bulunur demek değildir. \"Dudaklarını benim ismimle hareket ettirdiği zaman.\" Bunun anlamı dudakları benim ismimle hareket ettiği zaman demektir. Yoksa dudakları ve dili Allah'ın zatıyla birlikte hareket eder demek değildir. Çünkü bu imkansızdır. Kirmanı şöyle demiştir: Buradaki \"birliktelik\" rahmet birlikteliğidir. Yüce Allah'ın \"Ve hüve meakum eyne ma küntüm = nerede olsanız o sizinle beraberdir\" ayetindeki \"birliktelik\" bilgi birlikteliğidir. Yani bu ayetteki birliktelikten daha dar çerçevelidir. Buhari Yüce Allah'ın \"(Resulüm!) onu (vahyi) çarçabuk almak için dilini kımıldatma\" ayet-i kerimesini açıklarken İbn Abbas hadisine yer verdi. İbn Abbas, Nebi Sallallahu Aleyhi ve Sellem indirilen ayetlerin zabtı yüzünden güçlük çekerdi demiştir. Bu, \"Kur'an\" kelimesinin \"kıraat\" manasına kullanıldığının en açık delillerinden birisidir. Zira her iki ayetteki \"Kur'an\" kelimesi Kur'an'ın bizzat kendisi anlamında değil, \"kıraat\" anlamındadır. Bu hadisin açıklaması Bed'ü'lvahy Bölümünde geçmişti. İbn Battal şöyle der: İmam Buharl'nin hadise burada yer vermekten maksadı, Kur'an okurken dudakları ve dili oynatmanın kulun ameli olduğunu ve bunun karşılığında sevap alacağını vurgulamaktır",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 149
			}
		}
	]
}