{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"10": "Call to Prayers (Adhaan)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 755,
			"arabicnumber": 755,
			"text": "Cabir İbn Semure (radiyallahu anh) şöyle demiştir: \"Kufeliler Sa'd İbn Ebi Vakkâs'ı Ömer (r.a.)'e şikayet ettiler. - Ömer (r.a.) de onu görevden alıp yerine Ammâr İbn Yâsir'İ tayin etmişti. - Kufeliler Sa'd'ı şikayet ederken işi o kadar ileri götürmüşlerdi ki onun namaz'ı iyi kıldıramadığını söylüyorlardı. Bunun üzerine Ömer (r.a.) Sa'd'a bir elçi gönderdi. Elçi Sa'd'in yanına varınca şöyle dedi; 'Ebu İshâk! Halk senin namazı iyi kıldıramadığını iddia ediyor.' Buna karşılık Sa'd'ın cevabı şöyle oldu; 'Beni mi şikayet ediyorlar, sanırım şimdi söz sırası bana geldi. Allah'a yemin ederim ki, ben onlara Resûlullah Sallallahu Aleyhi ve Sellem nasıl namaz kıldırdıysa öyle namaz kıldırıyorum, asla O'nun kıldırmış olduğu namaz'dan bir şey eksiltmiyorum; yatsı - veya öğle ve ikindi namazlarını kıldırırken ilk iki rekatta kıraati biraz uzatıyorum ve kıyamda fazla duruyorum ancak son iki rekatı kısa kıldırıyorum.' Ömer (r.a.)'in elçisi; 'Zaten onların senin hakkındaki şikayetleri de bundan kaynaklanıyor fakat biz senin söylediğin gibi doğru davrandığını düşünüyorduk, Ey Ebû İshak' dedi. Ömer, Sa'd'ın yanına bir adam göndermişti. Bu şahıs Sa'd ile birlikte Kufe'deki mescidleri geziyor ve halkın onun hakkındaki düşüncelerini öğrenmeye çalışıyordu. Kufe'de uğramadıkları mescid kalmadı. Herkese Sa'd'ı soruyor ve halk da o'ndan sitayişle bahsediyor, övgülerde bulunuyordu. Sonunda Beni Abs mescidine girdi ve oradakilere de Sa'd'ı sordu. Mescidde bulunanlardan Usame İbn Katâde (künyesi Ebu Sa'de'dir) adında birisi kalkıp şöyle dedi; 'Bize-Sa'd'ı mı soruyorsunuz? Size onu anlatayım; o cihad'a giden birliklere katılmaz, istihkakımızı eşit şekilde paylaştırmaz ve herhangi bir da'va hakkında hüküm verirken adil davranmaz.' Bunun üzerine Sa'd şunları söyledi; 'Söz sırası sanırım bana geldi. Ben sadece şu üç bedduayı etmekle yetinececeğim; Allah'ım, eğer bu kulun yalan söylüyorsa, gösteriş ve şöhret düşkünü biri olduğu için halk arasında anılmak arzusuyla bunu yapıyorsa onun ömrünü uzat, fakirliğini çoğalt ve kendisini fitnelere, çeşitli musibetlere düşür. Usame daha sonraki yıllarda halini soranlara şöyle cevap verirdi: 'Ne olsun, beli bükülmüş ve ağır fitnelere düşmüş yaşlı bir adam'ım işte. Sa'd'ın bana ettiği beddua tam yerini buldu. Bu rivayeti Cabir İbn Semure'den nakleden Abdülmelik İbn Umeyr şöyle demiştir; 'Ben bu Usame denen adam'ı gördüm. Yaşlılıktan kaşları sarkmış ve gözlerini örtmüştü; yoldan geçen cariyelere sarkıntılık ediyor ve onları çimdiklemeye çalışıyordu. Tekrar: 758 ve 770 AÇIKLAMA 423.sayfada",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 149
			}
		}
	]
}