{
	"metadata": {
		"name": "Sahih al Bukhari",
		"section": {
			"97": "Oneness, Uniqueness of Allah (Tawheed)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7554,
			"arabicnumber": 7554,
			"text": "Ebu Hureyre' nin nakline göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurmuştur: \"Muhakkak ki Yüce Allah mahlukları yarc.t\"YJadan önce bir kitap yazmış (ve onda) 'Benim rahmetim gazabımın önüne geçmiştir!' diye yazmıştır. O kitap, arşın üstünde Yüce Allah'ın yanında yazılmış bir kitaptır.\" Fethu'l-Bari Açıklaması: \"Yüce Allah'ın 'Hakikatte o levh-i mahfuzda bulunan şerefli Kur'an'dır' sözü.\" İmam Buhari Halk-u Ef'ali'l-İbad'da bu ve bundan sonraki ayete yer verdikten sonra şöyle der: Yüce Allah Kur'an'ın muhafaza edildiğini ve satır satır yazıldığını belirtmektedir. Kalplerde bellenmiş, insanların dillerinde okunan ve Mushaflara yazılmış olan Kur'an, Allah'ın kelamı olarak mahluk değildir. Fakat mürekkep, kağıt, mushafın cildi gibi şeyler mahluktur. \"Halbuki Yüce Allah'ın kitaplarından bir kitabın lafzım izale edebilecek hiçbir kimse yoktur. Fakat onlar \"kitabı tahrif ederler\" yani onu tevilinden başka bir tevil ile tevil ederler.\" Son dönem şerh bilginlerinden biri şöyle demiştir: Bu meselede bilginler birkaç görüş halinde ihtilaf etmişlerdir. Bunlardan birincisine göre daha önceki kitapların tamamı değiştirilmiştir. Bu kitaplara değer vermemenin caizliği yolunda nakledilen görüşün gereği budur. Ancak bu görüş bir ifraddır. Bu konuda mutlak olarak söylenen sözü, çoğunluğun görüşüdür diye anlamak gerekir. Aksi takdirde bu bir kendi görüşünde diretmekten ibarettir. Oysa bu kitaplardan değişikliğe uğramamış birçok şeyin kaldığı noktasında ayet ve haberler çoktur. Bunlardan birisi şu ayettir: \"Yanlarındaki Tevrat ve İncil'de yazılı buldukları o elçiye, o ümmi Nebie uyanlar (var ya) işte o Nebi onlara iyiliği emreder ... \"(Araf 157) İki yahudinin recm edilmesi olayı da bunlardan biridir. O Tevrat'ta recm ayetinin var olduğundan söz edilmişti. Bu görüşü \"De ki eğer doğru sözlü iseniz, o zaman Tevrat'ı getirip onu okuyun\"(AI-i İmran 93) ayet i teyid etmektedir. Bir diğer görüşe göre bu kitaplarda değiştirme yapılmıştır, fakat bu, kitapların büyük kısmı için sözkonusudur. Bunun delilleri çoktur. Birinci görüşü de bu doğrultuda anlamak uygundur. Üçüncüsü bu kitapların çok az bir kısmında değişiklik yapılmıştır ve büyük bir kısmı olduğu gibi durmaktadır. Şeyh Takıyyuddin b. Teymiye, er-Reddü'ssahıh ala men beddele dine'l-Mesıh isimli eserinde bu görüşü savunmaktadır. \"Bu Kur'an bana kendisiyle sizi\" yani Mekkelileri \"ve ulaştığı herkesi uyarmam için vahyolundu.\" Demek ki Nebi Sallallahu Aleyhi ve Sellem kıyamete kadar gelecek herkes için bir uyarıcı olmuştur. İbn Ebi Hatim, bu haberi yukarıda zikredilen isnadla İbn Abbas'a ulaştırmaktadır. İbnü't-Tın şöyle der: \"Ve men belağa\" cümlesi, \"belağahu\" şeklindedir. Fiilin sonundan \"hO\" zamiri hazfedilmiştir. Bazıları ayete şu manayı vermişlerdir: Bu Kur'an bana kendisiyle sizi ve ergenlik çağına erişmiş herkesi uyarmam için vahyolundu. Bu iki manadan birincisi daha meşhurdur. İbn Ebi Hatim'in er-Redd ale'l-Cehmiyye isimli eserde nakline göre Abdullah b. Davud el-Hureybı şöyle demiştir: Kur'an-ı Kerim'de Cehm b. Safvan'ın taraftarlarına \"Kendisiyle sizi ve ulaştığı herkesi uyarmam için vahyolundu\" ayetinden daha şiddetli bir ayet yoktur. Ayetteki \"ve men belağ\" Kur'an'ın ulaştığı kimse demektir. Dolayısıyla o kişi Kur'an'ı sanki Yüce Allah'tan duymuş gibi olmaktadır",
			"grades": [],
			"reference": {
				"book": 97,
				"hadith": 179
			}
		}
	]
}