{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية بن أسماء، عن الوليد بن أبي هشام، عن نافع، أن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ صلوا في بيوتكم ولا تتخذوها قبورا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا عفان بن مسلم، قال حدثنا وهيب، قال سمعت موسى بن عقبة، قال سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه الناس ثم فقدوا صوته ليلة فظنوا أنه نائم فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏ \"‏ ما زال بكم الذي رأيت من صنعكم حتى خشيت أن يكتب عليكم ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم فإن أفضل صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "أخبرنا محمد بن بشار، قال أنبأنا إبراهيم بن أبي الوزير، قال حدثنا محمد بن موسى الفطري، عن سعد بن إسحاق بن كعب بن عجرة، عن أبيه، عن جده، قال صلى رسول الله صلى الله عليه وسلم صلاة المغرب في مسجد بني عبد الأشهل فلما صلى قام ناس يتنفلون فقال النبي صلى الله عليه وسلم ‏ \"‏ عليكم بهذه الصلاة في البيوت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن سعيد، عن قتادة، عن زرارة، عن سعد بن هشام، أنه لقي ابن عباس فسأله عن الوتر، فقال ألا أنبئك بأعلم أهل الأرض بوتر رسول الله صلى الله عليه وسلم قال نعم ‏.‏ قال عائشة ائتها فسلها ثم ارجع إلى فأخبرني بردها عليك فأتيت على حكيم بن أفلح فاستلحقته إليها فقال ما أنا بقاربها إني نهيتها أن تقول في هاتين الشيعتين شيئا فأبت فيها إلا مضيا ‏.‏ فأقسمت عليه فجاء معي فدخل عليها فقالت لحكيم من هذا معك قلت سعد بن هشام ‏.‏ قالت من هشام قلت ابن عامر ‏.‏ فترحمت عليه وقالت نعم المرء كان عامرا ‏.‏ قال يا أم المؤمنين أنبئيني عن خلق رسول الله صلى الله عليه وسلم ‏.‏ قالت أليس تقرأ القرآن قال قلت بلى ‏.‏ قالت فإن خلق نبي الله صلى الله عليه وسلم القرآن ‏.‏ فهممت أن أقوم فبدا لي قيام رسول الله صلى الله عليه وسلم فقال يا أم المؤمنين أنبئيني عن قيام نبي الله صلى الله عليه وسلم ‏.‏ قالت أليس تقرأ هذه السورة ‏{‏ يا أيها المزمل ‏}‏ قلت بلى ‏.‏ قالت فإن الله عز وجل افترض قيام الليل في أول هذه السورة فقام نبي الله صلى الله عليه وسلم وأصحابه حولا حتى انتفخت أقدامهم وأمسك الله عز وجل خاتمتها اثنى عشر شهرا ثم أنزل الله عز وجل التخفيف في آخر هذه السورة فصار قيام الليل تطوعا بعد أن كان فريضة فهممت أن أقوم فبدا لي وتر رسول الله صلى الله عليه وسلم فقلت يا أم المؤمنين أنبئيني عن وتر رسول الله صلى الله عليه وسلم ‏.‏ قالت كنا نعد له سواكه وطهوره فيبعثه الله عز وجل لما شاء أن يبعثه من الليل فيتسوك ويتوضأ ويصلي ثماني ركعات لا يجلس فيهن إلا عند الثامنة يجلس فيذكر الله عز وجل ويدعو ثم يسلم تسليما يسمعنا ثم يصلي ركعتين وهو جالس بعد ما يسلم ثم يصلي ركعة فتلك إحدى عشرة ركعة يا بنى فلما أسن رسول الله صلى الله عليه وسلم وأخذ اللحم أوتر بسبع وصلى ركعتين وهو جالس بعد ما سلم فتلك تسع ركعات يا بنى وكان رسول الله صلى الله عليه وسلم إذا صلى صلاة أحب أن يدوم عليها وكان إذا شغله عن قيام الليل نوم أو مرض أو وجع صلى من النهار اثنتى عشرة ركعة ولا أعلم أن نبي الله صلى الله عليه وسلم قرأ القرآن كله في ليلة ولا قام ليلة كاملة حتى الصباح ولا صام شهرا كاملا غير رمضان فأتيت ابن عباس فحدثته بحديثها فقال صدقت أما أني لو كنت أدخل عليها لأتيتها حتى تشافهني مشافهة ‏.‏ قال أبو عبد الرحمن كذا وقع في كتابي ولا أدري ممن الخطأ في موضع وتره عليه السلام ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "أخبرنا قتيبة، عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "أخبرنا محمد بن إسماعيل أبو بكر، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، قال قال الزهري أخبرني أبو سلمة بن عبد الرحمن، وحميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "أخبرنا قتيبة، عن مالك، عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم صلى في المسجد ذات ليلة وصلى بصلاته ناس ثم صلى من القابلة وكثر الناس ثم اجتمعوا من الليلة الثالثة أو الرابعة فلم يخرج إليهم رسول الله صلى الله عليه وسلم فلما أصبح قال ‏ \"‏ قد رأيت الذي صنعتم فلم يمنعني من الخروج إليكم إلا أني خشيت أن يفرض عليكم ‏\"‏ ‏.‏ وذلك في رمضان ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم في رمضان فلم يقم بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة فقام بنا في الخامسة حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ قال ‏ \"‏ إنه من قام مع الإمام حتى ينصرف كتب الله له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا ولم يقم حتى بقي ثلاث من الشهر فقام بنا في الثالثة وجمع أهله ونساءه حتى تخوفنا أن يفوتنا الفلاح ‏.‏ قلت وما الفلاح قال السحور ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني معاوية بن صالح، قال حدثني نعيم بن زياد أبو طلحة، قال سمعت النعمان بن بشير، على منبر حمص يقول قمنا مع رسول الله صلى الله عليه وسلم في شهر رمضان ليلة ثلاث وعشرين إلى ثلث الليل الأول ثم قمنا معه ليلة خمس وعشرين إلى نصف الليل ثم قمنا معه ليلة سبع وعشرين حتى ظننا أن لا ندرك الفلاح وكانوا يسمونه السحور ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا نام أحدكم عقد الشيطان على رأسه ثلاث عقد يضرب على كل عقدة ليلا طويلا أى ارقد فإن استيقظ فذكر الله انحلت عقدة فإن توضأ انحلت عقدة أخرى فإن صلى انحلت العقد كلها فيصبح طيب النفس نشيطا وإلا أصبح خبيث النفس كسلان ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن منصور، عن أبي وائل، عن عبد الله، قال ذكر عند رسول الله صلى الله عليه وسلم رجل نام ليلة حتى أصبح قال ‏ \"‏ ذاك رجل بال الشيطان في أذنيه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "أخبرنا عمرو بن علي، قال حدثنا عبد العزيز بن عبد الصمد، قال حدثنا منصور، عن أبي وائل، عن عبد الله، أن رجلا، قال يا رسول الله إن فلانا نام عن الصلاة البارحة حتى أصبح ‏.‏ قال ‏ \"‏ ذاك شيطان بال في أذنيه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى، عن ابن عجلان، قال حدثني القعقاع، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ رحم الله رجلا قام من الليل فصلى ثم أيقظ امرأته فصلت فإن أبت نضح في وجهها الماء ورحم الله امرأة قامت من الليل فصلت ثم أيقظت زوجها فصلى فإن أبى نضحت في وجهه الماء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن عقيل، عن الزهري، عن علي بن حسين، أن الحسين بن علي، حدثه عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم طرقه وفاطمة فقال ‏\"‏ ألا تصلون ‏\"‏ ‏.‏ قلت يا رسول الله إنما أنفسنا بيد الله فإذا شاء أن يبعثها بعثها فانصرف رسول الله صلى الله عليه وسلم حين قلت له ذلك ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ ‏{‏ وكان الإنسان أكثر شىء جدلا ‏}‏ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني حكيم بن حكيم بن عباد بن حنيف، عن محمد بن مسلم بن شهاب، عن علي بن حسين، عن أبيه، عن جده، علي بن أبي طالب قال دخل على رسول الله صلى الله عليه وسلم وعلى فاطمة من الليل فأيقظنا للصلاة ثم رجع إلى بيته فصلى هويا من الليل فلم يسمع لنا حسا فرجع إلينا فأيقظنا فقال ‏\"‏ قوما فصليا ‏\"‏ ‏.‏ قال فجلست وأنا أعرك عيني وأقول إنا والله ما نصلي إلا ما كتب الله لنا إنما أنفسنا بيد الله ‏.‏ فإن شاء أن يبعثنا بعثنا - قال - فولى رسول الله صلى الله عليه وسلم وهو يقول ويضرب بيده على فخذه ‏\"‏ ما نصلي إلا ما كتب الله لنا ‏{‏ وكان الإنسان أكثر شىء جدلا ‏}‏ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن، - هو ابن عوف - عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أفضل الصيام بعد شهر رمضان شهر الله المحرم وأفضل الصلاة بعد الفريضة صلاة الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، قال حدثنا شعبة، عن أبي بشر، جعفر بن أبي وحشية أنه سمع حميد بن عبد الرحمن، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ أفضل الصلاة بعد الفريضة قيام الليل وأفضل الصيام بعد رمضان المحرم ‏\"‏ ‏.‏ أرسله شعبة بن الحجاج ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، قال سمعت ربعيا، عن زيد بن ظبيان، رفعه إلى أبي ذر عن النبي صلى الله عليه وسلم قال ‏ \"‏ ثلاثة يحبهم الله عز وجل رجل أتى قوما فسألهم بالله ولم يسألهم بقرابة بينه وبينهم فمنعوه فتخلفهم رجل بأعقابهم فأعطاه سرا لا يعلم بعطيته إلا الله عز وجل والذي أعطاه وقوم ساروا ليلتهم حتى إذا كان النوم أحب إليهم مما يعدل به نزلوا فوضعوا رءوسهم فقام يتملقني ويتلو آياتي ورجل كان في سرية فلقوا العدو فانهزموا فأقبل بصدره حتى يقتل أو يفتح له ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "أخبرنا محمد بن إبراهيم البصري، عن بشر، - هو ابن المفضل - قال حدثنا شعبة، عن أشعث بن سليم، عن أبيه، عن مسروق، قال قلت لعائشة أى الأعمال أحب إلى رسول الله صلى الله عليه وسلم قالت الدائم ‏.‏ قلت فأى الليل كان يقوم قالت إذا سمع الصارخ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "أخبرنا عصمة بن الفضل، قال حدثنا زيد بن الحباب، عن معاوية بن صالح، قال حدثنا الأزهر بن سعيد، عن عاصم بن حميد، قال سألت عائشة بما كان رسول الله صلى الله عليه وسلم يستفتح قيام الليل قالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان رسول الله صلى الله عليه وسلم يكبر عشرا ويحمد عشرا ويسبح عشرا ويهلل عشرا ويستغفر عشرا ويقول ‏ \"‏ اللهم اغفر لي واهدني وارزقني وعافني أعوذ بالله من ضيق المقام يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن معمر، والأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن ربيعة بن كعب الأسلمي، قال كنت أبيت عند حجرة النبي صلى الله عليه وسلم فكنت أسمعه إذا قام من الليل يقول ‏\"‏ سبحان الله رب العالمين ‏\"‏ ‏.‏ الهوي ثم يقول ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏ الهوي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "أخبرنا قتيبة بن سعيد، قال حدثنا سفيان، عن الأحول، - يعني سليمان بن أبي مسلم - عن طاوس، عن ابن عباس، قال كان النبي صلى الله عليه وسلم إذا قام من الليل يتهجد قال ‏\"‏ اللهم لك الحمد أنت نور السموات والأرض ومن فيهن ولك الحمد أنت قيام السموات والأرض ومن فيهن ولك الحمد أنت ملك السموات والأرض ومن فيهن ولك الحمد أنت حق ووعدك حق والجنة حق والنار حق والساعة حق والنبيون حق ومحمد حق لك أسلمت وعليك توكلت وبك آمنت ‏\"‏ ‏.‏ ثم ذكر قتيبة كلمة معناها ‏\"‏ وبك خاصمت وإليك حاكمت اغفر لي ما قدمت وما أخرت وما أعلنت أنت المقدم وأنت المؤخر لا إله إلا أنت ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني مخرمة بن سليمان، عن كريب، أن عبد الله بن عباس، أخبره أنه، بات عند ميمونة أم المؤمنين - وهي خالته - فاضطجع في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل أو قبله قليلا أو بعده قليلا استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتيم من سورة آل عمران ثم قام إلى شن معلقة فتوضأ منها فأحسن وضوءه ثم قام يصلي قال عبد الله بن عباس فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى جاءه المؤذن فصلى ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "أخبرنا عمرو بن علي، ومحمد بن المثنى، عن عبد الرحمن، عن سفيان، عن منصور، والأعمش، وحصين، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم كان إذا قام من الليل يشوص فاه بالسواك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "حدثنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن حصين، قال سمعت أبا وائل، يحدث عن حذيفة، قال كان رسول الله صلى الله عليه وسلم إذا قام من الليل يشوص فاه بالسواك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": 1623,
			"text": "أخبرنا عبد الله بن سعيد، عن إسحاق بن سليمان، عن أبي سنان، عن أبي حصين، عن شقيق، عن حذيفة، قال كنا نؤمر بالسواك إذا قمنا من الليل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": 1624,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال أنبأنا إسرائيل، عن أبي حصين، عن شقيق، قال كنا نؤمر إذا قمنا من الليل أن نشوص أفواهنا بالسواك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": 1625,
			"text": "أخبرنا العباس بن عبد العظيم، قال أنبأنا عمر بن يونس، قال حدثنا عكرمة بن عمار، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال سألت عائشة بأى شىء كان النبي صلى الله عليه وسلم يفتتح صلاته قالت كان إذا قام من الليل افتتح صلاته قال ‏ \"‏ اللهم رب جبريل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اللهم اهدني لما اختلف فيه من الحق إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": 1626,
			"text": "أخبرنا محمد بن سلمة، قال أنبأنا ابن وهب، عن يونس، عن ابن شهاب، قال حدثني حميد بن عبد الرحمن بن عوف، أن رجلا، من أصحاب النبي صلى الله عليه وسلم قال قلت وأنا في سفر مع رسول الله صلى الله عليه وسلم والله لأرقبن رسول الله صلى الله عليه وسلم لصلاة حتى أرى فعله فلما صلى صلاة العشاء - وهي العتمة - اضطجع هويا من الليل ثم استيقظ فنظر في الأفق فقال ‏{‏ ربنا ما خلقت هذا باطلا ‏}‏ حتى بلغ ‏{‏ إنك لا تخلف الميعاد ‏}‏ ‏.‏ ثم أهوى رسول الله صلى الله عليه وسلم إلى فراشه فاستل منه سواكا ثم أفرغ في قدح من إداوة عنده ماء فاستن ثم قام فصلى حتى قلت قد صلى قدر ما نام ثم اضطجع حتى قلت قد نام قدر ما صلى ثم استيقظ ففعل كما فعل أول مرة وقال مثل ما قال ففعل رسول الله صلى الله عليه وسلم ثلاث مرات قبل الفجر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": 1627,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا يزيد، قال أنبأنا حميد، عن أنس، قال ما كنا نشاء أن نرى رسول الله صلى الله عليه وسلم في الليل مصليا إلا رأيناه ولا نشاء أن نراه نائما إلا رأيناه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "أخبرنا هارون بن عبد الله، قال حدثنا حجاج، قال قال ابن جريج عن أبيه، أخبرني ابن أبي مليكة، أن يعلى بن مملك، أخبره أنه، سأل أم سلمة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان يصلي العتمة ثم يسبح ثم يصلي بعدها ما شاء الله من الليل ثم ينصرف فيرقد مثل ما صلى ثم يستيقظ من نومه ذلك فيصلي مثل ما نام وصلاته تلك الآخرة تكون إلى الصبح ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": 1629,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن عبد الله بن عبيد الله بن أبي مليكة، عن يعلى بن مملك، أنه سأل أم سلمة زوج النبي صلى الله عليه وسلم عن قراءة رسول الله صلى الله عليه وسلم وعن صلاته فقالت ما لكم وصلاته كان يصلي ثم ينام قدر ما صلى ثم يصلي قدر ما نام ثم ينام قدر ما صلى حتى يصبح ‏.‏ ثم نعتت له قراءته فإذا هي تنعت قراءة مفسرة حرفا حرفا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": 1630,
			"text": "أخبرنا قتيبة، قال حدثنا سفيان، عن عمرو بن دينار، عن عمرو بن أوس، أنه سمع عبد الله بن عمرو بن العاص، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ أحب الصيام إلى الله عز وجل صيام داود عليه السلام كان يصوم يوما ويفطر يوما وأحب الصلاة إلى الله صلاة داود كان ينام نصف الليل ويقوم ثلثه وينام سدسه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": 1631,
			"text": "أخبرنا محمد بن علي بن حرب، قال حدثنا معاذ بن خالد، قال أنبأنا حماد بن سلمة، عن سليمان التيمي، عن ثابت، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال أتيت ليلة أسري بي على موسى عليه السلام عند الكثيب الأحمر وهو قائم يصلي في قبره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": 1632,
			"text": "أخبرنا العباس بن محمد، قال حدثنا يونس بن محمد، قال حدثنا حماد بن سلمة، عن سليمان التيمي، وثابت، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أتيت على موسى عليه السلام عند الكثيب الأحمر وهو قائم يصلي ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا أولى بالصواب عندنا من حديث معاذ بن خالد والله تعالى أعلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": 1633,
			"text": "أخبرني أحمد بن سعيد، قال حدثنا حبان، قال حدثنا حماد بن سلمة، قال أنبأنا ثابت، وسليمان التيمي، عن أنس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ مررت على قبر موسى عليه السلام وهو يصلي في قبره ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": 1634,
			"text": "أخبرنا علي بن خشرم، قال حدثنا عيسى، عن سليمان التيمي، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ مررت ليلة أسري بي على موسى عليه السلام وهو يصلي في قبره ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": 1635,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا معتمر، عن أبيه، عن أنس، أن النبي صلى الله عليه وسلم ليلة أسري به مر على موسى عليه السلام وهو يصلي في قبره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": 1636,
			"text": "أخبرنا يحيى بن حبيب بن عربي، وإسماعيل بن مسعود، قالا حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، يقول أخبرني بعض، أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم ليلة أسري به مر على موسى عليه السلام وهو يصلي في قبره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": 1637,
			"text": "أخبرنا قتيبة، قال حدثنا ابن أبي عدي، عن سليمان، عن أنس، عن بعض، أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏ \"‏ ليلة أسري بي مررت على موسى وهو يصلي في قبره ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": 1638,
			"text": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي وبقية، قالا حدثنا ابن أبي حمزة، قال حدثني الزهري، قال أخبرني عبيد الله بن عبد الله بن الحارث بن نوفل، عن عبد الله بن خباب بن الأرت، عن أبيه، وكان، قد شهد بدرا",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": 1639,
			"text": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن أبي يعفور، عن مسلم، عن مسروق، قال قالت عائشة رضى الله عنها كان إذا دخلت العشر أحيا رسول الله صلى الله عليه وسلم الليل وأيقظ أهله وشد المئزر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": 1640,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى، قال حدثنا زهير، عن أبي إسحاق، قال أتيت الأسود بن يزيد وكان لي أخا صديقا فقلت يا أبا عمرو حدثني ما حدثتك به أم المؤمنين عن صلاة رسول الله صلى الله عليه وسلم ‏.‏ قال قالت كان ينام أول الليل ويحيي آخره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "أخبرنا هارون بن إسحاق، قال حدثنا عبدة بن سليمان، عن سعيد، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، - رضى الله عنها - قالت لا أعلم رسول الله صلى الله عليه وسلم قرأ القرآن كله في ليلة ولا قام ليلة حتى الصباح ولا صام شهرا كاملا قط غير رمضان ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": 1642,
			"text": "أخبرنا شعيب بن يوسف، عن يحيى، عن هشام، قال أخبرني أبي، عن عائشة، أن النبي صلى الله عليه وسلم دخل عليها وعندها امرأة فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قالت فلانة لا تنام ‏.‏ فذكرت من صلاتها فقال ‏\"‏ مه عليكم بما تطيقون فوالله لا يمل الله عز وجل حتى تملوا ولكن أحب الدين إليه ما داوم عليه صاحبه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": 1643,
			"text": "أخبرنا عمران بن موسى، عن عبد الوارث، قال حدثنا عبد العزيز، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم دخل المسجد فرأى حبلا ممدودا بين ساريتين فقال ‏\"‏ ما هذا الحبل ‏\"‏ ‏.‏ فقالوا لزينب تصلي فإذا فترت تعلقت به ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ حلوه ليصل أحدكم نشاطه فإذا فتر فليقعد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": 1644,
			"text": "أخبرنا قتيبة بن سعيد، ومحمد بن منصور، - واللفظ له - عن سفيان، عن زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول قام النبي صلى الله عليه وسلم حتى تورمت قدماه فقيل له قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ قال ‏ \"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": 1645,
			"text": "أخبرنا عمرو بن علي، قال حدثنا صالح بن مهران، - وكان ثقة - قال حدثنا النعمان بن عبد السلام، عن سفيان، عن عاصم بن كليب، عن أبيه، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يصلي حتى تزلع يعني تشقق قدماه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": 1646,
			"text": "أخبرنا قتيبة، قال حدثنا حماد، عن بديل، وأيوب، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي ليلا طويلا فإذا صلى قائما ركع قائما وإذا صلى قاعدا ركع قاعدا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": 1647,
			"text": "أخبرنا عبدة بن عبد الرحيم، قال أنبأنا وكيع، قال حدثني يزيد بن إبراهيم، عن ابن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي قائما وقاعدا فإذا افتتح الصلاة قائما ركع قائما وإذا افتتح الصلاة قاعدا ركع قاعدا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1648,
			"arabicnumber": 1648,
			"text": "أخبرنا محمد بن سلمة، قال حدثنا ابن القاسم، عن مالك، قال حدثني عبد الله بن يزيد، وأبو النضر، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم كان يصلي وهو جالس فيقرأ وهو جالس فإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأ وهو قائم ثم ركع ثم سجد ثم يفعل في الركعة الثانية مثل ذلك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": 1649,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت ما رأيت رسول الله صلى الله عليه وسلم صلى جالسا حتى دخل في السن فكان يصلي وهو جالس يقرأ فإذا غبر من السورة ثلاثون أو أربعون آية قام فقرأ بها ثم ركع ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": 1650,
			"text": "أخبرنا زياد بن أيوب، قال حدثنا ابن علية، قال حدثنا الوليد بن أبي هشام، عن أبي بكر بن محمد، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقرأ وهو قاعد فإذا أراد أن يركع قام قدر ما يقرأ إنسان أربعين آية ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": 1651,
			"text": "أخبرنا عمرو بن علي، عن عبد الأعلى، قال حدثنا هشام، عن الحسن، عن سعد بن هشام بن عامر، قال قدمت المدينة فدخلت على عائشة - رضى الله عنها - قالت من أنت قلت أنا سعد بن هشام بن عامر ‏.‏ قالت رحم الله أباك ‏.‏ قلت أخبريني عن صلاة رسول الله صلى الله عليه وسلم ‏.‏ قالت إن رسول الله صلى الله عليه وسلم كان وكان ‏.‏ قلت أجل ‏.‏ قالت إن رسول الله صلى الله عليه وسلم كان يصلي بالليل صلاة العشاء ثم يأوي إلى فراشه فينام فإذا كان جوف الليل قام إلى حاجته وإلى طهوره فتوضأ ثم دخل المسجد فيصلي ثماني ركعات يخيل إلى أنه يسوي بينهن في القراءة والركوع والسجود ويوتر بركعة ثم يصلي ركعتين وهو جالس ثم يضع جنبه فربما جاء بلال فآذنه بالصلاة قبل أن يغفي وربما يغفي وربما شككت أغفى أو لم يغف حتى يؤذنه بالصلاة فكانت تلك صلاة رسول الله صلى الله عليه وسلم حتى أسن ولحم - فذكرت من لحمه ما شاء الله - قالت وكان النبي صلى الله عليه وسلم يصلي بالناس العشاء ثم يأوي إلى فراشه فإذا كان جوف الليل قام إلى طهوره وإلى حاجته فتوضأ ثم يدخل المسجد فيصلي ست ركعات يخيل إلى أنه يسوي بينهن في القراءة والركوع والسجود ثم يوتر بركعة ثم يصلي ركعتين وهو جالس ثم يضع جنبه وربما جاء بلال فآذنه بالصلاة قبل أن يغفي وربما أغفى وربما شككت أغفى أم لا حتى يؤذنه بالصلاة قالت فما زالت تلك صلاة رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": 1652,
			"text": "أخبرنا عمرو بن علي، عن حديث أبي عاصم، قال حدثنا عمر بن أبي زائدة، قال حدثني أبو إسحاق، عن الأسود، عن عائشة، قالت ما كان رسول الله صلى الله عليه وسلم يمتنع من وجهي وهو صائم وما مات حتى كان أكثر صلاته قاعدا ثم ذكرت كلمة معناها إلا المكتوبة وكان أحب العمل إليه ما دام عليه الإنسان وإن كان يسيرا ‏.‏ خالفه يونس رواه عن أبي إسحاق عن الأسود عن أم سلمة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": 1653,
			"text": "أخبرنا سليمان بن سلم البلخي، قال حدثنا النضر، قال أنبأنا يونس، عن أبي إسحاق، عن الأسود، عن أم سلمة، قالت ما قبض رسول الله صلى الله عليه وسلم حتى كان أكثر صلاته جالسا إلا المكتوبة ‏.‏ خالفه شعبة وسفيان وقالا عن أبي إسحاق عن أبي سلمة عن أم سلمة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": 1654,
			"text": "أخبرنا إسماعيل بن مسعود، حدثنا خالد، عن شعبة، عن أبي إسحاق، قال سمعت أبا سلمة، عن أم سلمة، قالت ما مات رسول الله صلى الله عليه وسلم حتى كان أكثر صلاته قاعدا إلا الفريضة وكان أحب العمل إليه أدومه وإن قل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": 1655,
			"text": "أخبرنا عبد الله بن عبد الصمد، قال حدثنا يزيد، قال حدثنا سفيان، عن أبي إسحاق، عن أبي سلمة، عن أم سلمة، قالت والذي نفسي بيده ما مات رسول الله صلى الله عليه وسلم حتى كان أكثر صلاته قاعدا إلا المكتوبة وكان أحب العمل إليه ما داوم عليه وإن قل ‏.‏ خالفه عثمان بن أبي سليمان فرواه عن أبي سلمة عن عائشة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": 1656,
			"text": "أخبرنا الحسن بن محمد، عن حجاج، عن ابن جريج، قال أخبرني عثمان بن أبي سليمان، أن أبا سلمة، أخبره أن عائشة أخبرته أن النبي صلى الله عليه وسلم لم يمت حتى كان يصلي كثيرا من صلاته وهو جالس ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": 1657,
			"text": "أخبرنا أبو الأشعث، عن يزيد بن زريع، قال أنبأنا الجريري، عن عبد الله بن شقيق، قال قلت لعائشة هل كان رسول الله صلى الله عليه وسلم يصلي وهو قاعد قالت نعم بعد ما حطمه الناس ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "أخبرنا قتيبة، عن مالك، عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة، عن حفصة، قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا قط حتى كان قبل وفاته بعام فكان يصلي قاعدا يقرأ بالسورة فيرتلها حتى تكون أطول من أطول منها ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": 1659,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثنا منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال رأيت النبي صلى الله عليه وسلم يصلي جالسا فقلت حدثت أنك قلت ‏\"‏ إن صلاة القاعد على النصف من صلاة القائم ‏\"‏ ‏.‏ وأنت تصلي قاعدا ‏.‏ قال ‏\"‏ أجل ولكني لست كأحد منكم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": 1660,
			"text": "أخبرنا حميد بن مسعدة، عن سفيان بن حبيب، عن حسين المعلم، عن عبد الله بن بريدة، عن عمران بن حصين، قال سألت النبي صلى الله عليه وسلم عن الذي يصلي قاعدا قال ‏ \"‏ من صلى قائما فهو أفضل ومن صلى قاعدا فله نصف أجر القائم ومن صلى نائما فله نصف أجر القاعد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": 1661,
			"text": "أخبرنا هارون بن عبد الله، قال حدثنا أبو داود الحفري، عن حفص، عن حميد، عن عبد الله بن شقيق، عن عائشة، قالت رأيت النبي صلى الله عليه وسلم يصلي متربعا ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا روى هذا الحديث غير أبي داود وهو ثقة ولا أحسب هذا الحديث إلا خطأ والله تعالى أعلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": 1662,
			"text": "أخبرنا شعيب بن يوسف، قال حدثنا عبد الرحمن، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال سألت عائشة كيف كانت قراءة رسول الله صلى الله عليه وسلم بالليل يجهر أم يسر قالت كل ذلك قد كان يفعل ربما جهر وربما أسر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": 1663,
			"text": "أخبرنا هارون بن محمد بن بكار بن بلال، قال حدثنا محمد، - يعني ابن سميع - قال حدثنا زيد يعني ابن واقد، عن كثير بن مرة، أن عقبة بن عامر، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الذي يجهر بالقرآن كالذي يجهر بالصدقة والذي يسر بالقرآن كالذي يسر بالصدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": 1664,
			"text": "أخبرنا الحسين بن منصور، قال حدثنا عبد الله بن نمير، قال حدثنا الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، قال صليت مع النبي صلى الله عليه وسلم ليلة فافتتح البقرة فقلت يركع عند المائة فمضى فقلت يركع عند المائتين فمضى فقلت يصلي بها في ركعة فمضى فافتتح النساء فقرأها ثم افتتح آل عمران فقرأها يقرأ مترسلا إذا مر بآية فيها تسبيح سبح وإذا مر بسؤال سأل وإذا مر بتعوذ تعوذ ثم ركع فقال ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ فكان ركوعه نحوا من قيامه ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ فكان قيامه قريبا من ركوعه ثم سجد فجعل يقول ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ فكان سجوده قريبا من ركوعه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": 1665,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر بن محمد المروزي، - ثقة - قال حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد الأنصاري، عن حذيفة، أنه صلى مع رسول الله صلى الله عليه وسلم في رمضان فركع فقال في ركوعه ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ مثل ما كان قائما ثم جلس يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ مثل ما كان قائما ثم سجد فقال ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ مثل ما كان قائما فما صلى إلا أربع ركعات حتى جاء بلال إلى الغداة ‏.‏ قال أبو عبد الرحمن هذا الحديث عندي مرسل وطلحة بن يزيد لا أعلمه سمع من حذيفة شيئا وغير العلاء بن المسيب قال في هذا الحديث عن طلحة عن رجل عن حذيفة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": 1666,
			"text": "أخبرنا محمد بن بشار، قال حدثنا محمد بن جعفر، وعبد الرحمن، قالا حدثنا شعبة، عن يعلى بن عطاء، أنه سمع عليا الأزدي، أنه سمع ابن عمر، يحدث عن النبي صلى الله عليه وسلم قال ‏ \"‏ صلاة الليل والنهار مثنى مثنى ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا الحديث عندي خطأ والله تعالى أعلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": 1667,
			"text": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن منصور، عن حبيب، عن طاوس، قال قال ابن عمر سأل رجل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال ‏ \"‏ مثنى مثنى فإذا خشيت الصبح فواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": 1668,
			"text": "أخبرنا عمرو بن عثمان، ومحمد بن صدقة، قالا حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ صلاة الليل مثنى مثنى فإذا خفت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": 1669,
			"text": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن ابن أبي لبيد، عن أبي سلمة، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم على المنبر يسأل عن صلاة الليل فقال ‏ \"‏ مثنى مثنى فإذا خفت الصبح فأوتر بركعة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": 1670,
			"text": "أخبرنا موسى بن سعيد، قال حدثنا أحمد بن عبد الله بن يونس، قال حدثنا زهير، قال حدثنا الحسن بن الحر، قال حدثنا نافع، أن ابن عمر، أخبرهم أن رجلا سأل رسول الله صلى الله عليه وسلم عن صلاة الليل قال ‏ \"‏ مثنى مثنى فإن خشي أحدكم الصبح فليوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": 1671,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ صلاة الليل مثنى مثنى فإذا خفت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": 1672,
			"text": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، عن شعيب، عن الزهري، عن سالم، عن ابن عمر، قال سأل رجل من المسلمين رسول الله صلى الله عليه وسلم كيف صلاة الليل فقال ‏ \"‏ صلاة الليل مثنى مثنى فإذا خفت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": 1673,
			"text": "أخبرنا محمد بن يحيى، قال حدثنا يعقوب بن إبراهيم، قال حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني حميد بن عبد الرحمن، أن عبد الله بن عمر، أخبره أن رجلا سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الليل مثنى مثنى فإذا خشيت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": 1674,
			"text": "أخبرنا أحمد بن الهيثم، قال حدثنا حرملة، قال حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، أن ابن شهاب، حدثه أن سالم بن عبد الله وحميد بن عبد الرحمن حدثاه عن عبد الله بن عمر، قال قام رجل فقال يا رسول الله كيف صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الليل مثنى مثنى فإذا خفت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": 1675,
			"text": "أخبرنا هناد بن السري، عن أبي بكر بن عياش، عن أبي إسحاق، عن عاصم، - وهو ابن ضمرة - عن علي، رضي الله عنه قال أوتر رسول الله صلى الله عليه وسلم ثم قال ‏ \"‏ يا أهل القرآن أوتروا فإن الله عز وجل وتر يحب الوتر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": 1676,
			"text": "أخبرني محمد بن إسماعيل بن إبراهيم، عن أبي نعيم، عن سفيان، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، رضى الله عنه قال الوتر ليس بحتم كهيئة المكتوبة ولكنه سنة سنها رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": 1677,
			"text": "أخبرنا سليمان بن سلم، ومحمد بن علي بن الحسن بن شقيق، عن النضر بن شميل، قال أنبأنا شعبة، عن أبي شمر، عن أبي عثمان، عن أبي هريرة، قال أوصاني خليلي صلى الله عليه وسلم بثلاث النوم على وتر وصيام ثلاثة أيام من كل شهر وركعتى الضحى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": 1678,
			"text": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، ثم ذكر كلمة معناها عن عباس الجريري، قال سمعت أبا عثمان، عن أبي هريرة، قال أوصاني خليلي صلى الله عليه وسلم بثلاث الوتر أول الليل وركعتى الفجر وصوم ثلاثة أيام من كل شهر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": 1679,
			"text": "أخبرنا هناد بن السري، عن ملازم بن عمرو، قال حدثني عبد الله بن بدر، عن قيس بن طلق، قال زارنا أبي طلق بن علي في يوم من رمضان فأمسى بنا وقام بنا تلك الليلة وأوتر بنا ثم انحدر إلى مسجد فصلى بأصحابه حتى بقي الوتر ثم قدم رجلا فقال له أوتر بهم فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا وتران في ليلة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": 1680,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود بن يزيد، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان ينام أول الليل ثم يقوم فإذا كان من السحر أوتر ثم أتى فراشه فإذا كان له حاجة ألم بأهله فإذا سمع الأذان وثب فإن كان جنبا أفاض عليه من الماء وإلا توضأ ثم خرج إلى الصلاة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": 1681,
			"text": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، عن سفيان، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، عن عائشة، قالت أوتر رسول الله صلى الله عليه وسلم من أوله وآخره وأوسطه وانتهى وتره إلى السحر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": 1682,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن نافع، أن ابن عمر، قال من صلى من الليل فليجعل آخر صلاته وترا فإن رسول الله صلى الله عليه وسلم كان يأمر بذلك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": 1683,
			"text": "أخبرنا عبيد الله بن فضالة بن إبراهيم، قال أنبأنا محمد، - وهو ابن المبارك - قال حدثنا معاوية، - وهو ابن سلام بن أبي سلام - عن يحيى بن أبي كثير، قال أخبرني أبو نضرة العوقي، أنه سمع أبا سعيد الخدري، يقول سئل رسول الله صلى الله عليه وسلم عن الوتر فقال ‏ \"‏ أوتروا قبل الصبح ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": 1684,
			"text": "أخبرنا يحيى بن درست، قال حدثنا أبو إسماعيل القناد، قال حدثنا يحيى، - وهو ابن أبي كثير - عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أوتروا قبل الفجر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": 1685,
			"text": "أخبرنا يحيى بن حكيم، قال حدثنا ابن أبي عدي، عن شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، أنه كان في مسجد عمرو بن شرحبيل فأقيمت الصلاة فجعلوا ينتظرونه فجاء فقال إني كنت أوتر ‏.‏ قال وسئل عبد الله هل بعد الأذان وتر قال نعم وبعد الإقامة ‏.‏ وحدث عن النبي صلى الله عليه وسلم أنه نام عن الصلاة حتى طلعت الشمس ثم صلى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": 1686,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى بن سعيد، عن عبيد الله بن الأخنس، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يوتر على الراحلة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": 1687,
			"text": "أخبرنا إبراهيم بن يعقوب، قال أخبرني عبد الله بن محمد بن علي، قال حدثنا زهير، عن الحسن بن الحر، عن نافع، أن ابن عمر، كان يوتر على بعيره ويذكر أن النبي صلى الله عليه وسلم كان يفعل ذلك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": 1688,
			"text": "أخبرنا قتيبة، قال حدثنا مالك، عن أبي بكر بن عمر بن عبد الرحمن بن عبد الله بن عمر بن الخطاب، عن سعيد بن يسار، قال قال لي ابن عمر أن رسول الله صلى الله عليه وسلم كان يوتر على البعير ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": 1689,
			"text": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا وهب بن جرير، قال حدثنا شعبة، عن أبي التياح، عن أبي مجلز، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": 1690,
			"text": "أخبرنا محمد بن بشار، قال حدثنا يحيى، ومحمد، قالا حدثنا ثم، ذكر كلمة معناها شعبة عن قتادة، عن أبي مجلز، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": 1691,
			"text": "أخبرنا الحسن بن محمد، عن عفان، قال حدثنا همام، قال حدثنا قتادة، عن عبد الله بن شقيق، عن ابن عمر، أن رجلا، من أهل البادية سأل رسول الله صلى الله عليه وسلم عن صلاة الليل قال ‏ \"‏ مثنى مثنى والوتر ركعة من آخر الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": 1692,
			"text": "أخبرنا الربيع بن سليمان، قال حدثنا حجاج بن إبراهيم، قال حدثنا ابن وهب، عن عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ صلاة الليل مثنى مثنى فإذا أردت أن تنصرف فاركع بواحدة توتر لك ما قد صليت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": 1693,
			"text": "أخبرنا قتيبة، قال حدثنا خالد بن زياد، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الليل مثنى مثنى والوتر ركعة واحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": 1694,
			"text": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، وعبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الليل مثنى مثنى فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": 1695,
			"text": "أخبرنا عبيد الله بن فضالة بن إبراهيم، قال حدثنا محمد، - يعني ابن المبارك - قال حدثنا معاوية، - وهو ابن سلام - عن يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، ونافع، عن ابن عمر، عن رسول الله صلى الله عليه وسلم أنه سمعه يقول ‏ \"‏ صلاة الليل ركعتين ركعتين فإذا خفتم الصبح فأوتروا بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": 1696,
			"text": "أخبرنا إسحاق بن منصور، قال أنبأنا عبد الرحمن، قال حدثنا مالك، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم كان يصلي من الليل إحدى عشرة ركعة يوتر منها بواحدة ثم يضطجع على شقه الأيمن ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": 1697,
			"text": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن سعيد بن أبي سعيد المقبري، عن أبي سلمة بن عبد الرحمن، أنه أخبره أنه، سأل عائشة أم المؤمنين كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان قالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا غيره على إحدى عشرة ركعة يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي ثلاثا قالت عائشة فقلت يا رسول الله أتنام قبل أن توتر قال ‏ \"‏ يا عائشة إن عيني تنام ولا ينام قلبي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": 1698,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا سعيد، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أن عائشة، حدثته أن رسول الله صلى الله عليه وسلم كان لا يسلم في ركعتى الوتر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": 1699,
			"text": "أخبرنا علي بن ميمون، قال حدثنا مخلد بن يزيد، عن سفيان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان يوتر بثلاث ركعات كان يقرأ في الأولى بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية بـ ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة بـ ‏{‏ قل هو الله أحد ‏}‏ ويقنت قبل الركوع فإذا فرغ قال عند فراغه ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يطيل في آخرهن ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": 1700,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، عن سعيد بن أبي عروبة، عن قتادة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الركعة الأولى من الوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية بـ ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة بـ ‏{‏ قل هو الله أحد ‏}‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": 1701,
			"text": "أخبرنا يحيى بن موسى، قال أنبأنا عبد العزيز بن خالد، قال حدثنا سعيد بن أبي عروبة، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الركعة الثانية بـ ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة بـ ‏{‏ قل هو الله أحد ‏}‏ ولا يسلم إلا في آخرهن ويقول يعني بعد التسليم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": 1702,
			"text": "أخبرنا الحسين بن عيسى، قال حدثنا أبو أسامة، قال حدثنا زكريا بن أبي زائدة، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يوتر بثلاث يقرأ في الأولى بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية بـ ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة بـ ‏{‏ قل هو الله أحد ‏}‏ أوقفه زهير ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": 1703,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا زهير، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، أنه كان يوتر بثلاث بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "أخبرنا محمد بن رافع، قال حدثنا معاوية بن هشام، قال حدثنا سفيان، عن حبيب بن أبي ثابت، عن محمد بن علي، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم أنه قام من الليل فاستن ثم صلى ركعتين ثم نام ثم قام فاستن ثم توضأ فصلى ركعتين حتى صلى ستا ثم أوتر بثلاث وصلى ركعتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": 1705,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن جده، قال كنت عند النبي صلى الله عليه وسلم فقام فتوضأ واستاك وهو يقرأ هذه الآية حتى فرغ منها ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ‏}‏ ثم صلى ركعتين ثم عاد فنام حتى سمعت نفخه ثم قام فتوضأ واستاك ثم صلى ركعتين ثم نام ثم قام فتوضأ واستاك وصلى ركعتين وأوتر بثلاث ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": 1706,
			"text": "أخبرنا محمد بن جبلة، قال حدثنا معمر بن مخلد، - ثقة - قال حدثنا عبيد الله بن عمرو، عن زيد، عن حبيب بن أبي ثابت، عن محمد بن علي، عن ابن عباس، قال استيقظ رسول الله صلى الله عليه وسلم فاستن وساق الحديث ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": 1707,
			"text": "أخبرنا هارون بن عبد الله، قال حدثنا يحيى بن آدم، قال حدثنا أبو بكر النهشلي، عن حبيب بن أبي ثابت، عن يحيى بن الجزار، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يصلي من الليل ثمان ركعات ويوتر بثلاث ويصلي ركعتين قبل صلاة الفجر ‏.‏ خالفه عمرو بن مرة فرواه عن يحيى بن الجزار عن أم سلمة عن رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": 1708,
			"text": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏ خالفه عمارة بن عمير فرواه عن يحيى بن الجزار عن عائشة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": 1709,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن سليمان، عن عمارة بن عمير، عن يحيى بن الجزار، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل تسعا فلما أسن وثقل صلى سبعا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": 1710,
			"text": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثني ضبارة بن أبي السليل، قال حدثني دويد بن نافع، قال أخبرني ابن شهاب، قال حدثني عطاء بن يزيد، عن أبي أيوب، أن النبي صلى الله عليه وسلم قال ‏ \"‏ الوتر حق فمن شاء أوتر بسبع ومن شاء أوتر بخمس ومن شاء أوتر بثلاث ومن شاء أوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": 1711,
			"text": "أخبرنا العباس بن الوليد بن مزيد، قال أخبرني أبي قال، حدثنا الأوزاعي، قال حدثني الزهري، قال حدثنا عطاء بن يزيد، عن أبي أيوب، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الوتر حق فمن شاء أوتر بخمس ومن شاء أوتر بثلاث ومن شاء أوتر بواحدة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": 1712,
			"text": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا عبد الله بن يوسف، قال حدثنا الهيثم بن حميد، قال حدثني أبو معيد، عن الزهري، قال حدثني عطاء بن يزيد، أنه سمع أبا أيوب الأنصاري، يقول الوتر حق فمن أحب أن يوتر بخمس ركعات فليفعل ومن أحب أن يوتر بثلاث فليفعل ومن أحب أن يوتر بواحدة فليفعل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": 1713,
			"text": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن سفيان، عن الزهري، عن عطاء بن يزيد، عن أبي أيوب، قال من شاء أوتر بسبع ومن شاء أوتر بخمس ومن شاء أوتر بثلاث ومن شاء أوتر بواحدة ومن شاء أومأ إيماء ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": 1714,
			"text": "أخبرنا قتيبة، قال حدثنا جرير، عن منصور، عن الحكم، عن مقسم، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بخمس وبسبع لا يفصل بينها بسلام ولا بكلام ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": 1715,
			"text": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا عبيد الله، عن إسرائيل، عن منصور، عن الحكم، عن مقسم، عن ابن عباس، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بسبع أو بخمس ولا يفصل بينهن بتسليم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": 1716,
			"text": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن يزيد، قال حدثنا سفيان بن الحسين، عن الحكم، عن مقسم، قال الوتر سبع فلا أقل من خمس فذكرت ذلك لإبراهيم فقال عمن ذكره قلت لا أدري ‏.‏ قال الحكم فحججت فلقيت مقسما فقلت له عمن قال عن الثقة عن عائشة وعن ميمونة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Maqtu"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": 1717,
			"text": "أخبرنا إسحاق بن منصور، قال أنبأنا عبد الرحمن، عن سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم كان يوتر بخمس ولا يجلس إلا في آخرهن ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1718,
			"arabicnumber": 1718,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، قالت لما أسن رسول الله صلى الله عليه وسلم وأخذ اللحم صلى سبع ركعات لا يقعد إلا في آخرهن وصلى ركعتين وهو قاعد بعد ما يسلم فتلك تسع يا بنى وكان رسول الله صلى الله عليه وسلم إذا صلى صلاة أحب أن يداوم عليها ‏.‏ مختصر ‏.‏ خالفه هشام الدستوائي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1719,
			"arabicnumber": 1719,
			"text": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا أوتر بتسع ركعات لم يقعد إلا في الثامنة فيحمد الله ويذكره ويدعو ثم ينهض ولا يسلم ثم يصلي التاسعة فيجلس فيذكر الله عز وجل ويدعو ثم يسلم تسليمة يسمعنا ثم يصلي ركعتين وهو جالس فلما كبر وضعف أوتر بسبع ركعات لا يقعد إلا في السادسة ثم ينهض ولا يسلم فيصلي السابعة ثم يسلم تسليمة ثم يصلي ركعتين وهو جالس ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": 1720,
			"text": "أخبرنا هارون بن إسحاق، عن عبدة، عن سعيد، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أن عائشة، قالت كنا نعد لرسول الله صلى الله عليه وسلم سواكه وطهوره فيبعثه الله عز وجل لما شاء أن يبعثه من الليل فيستاك ويتوضأ ويصلي تسع ركعات لا يجلس فيهن إلا عند الثامنة ويحمد الله ويصلي على نبيه صلى الله عليه وسلم ويدعو بينهن ولا يسلم تسليما ثم يصلي التاسعة ويقعد وذكر كلمة نحوها ويحمد الله ويصلي على نبيه صلى الله عليه وسلم ويدعو ثم يسلم تسليما يسمعنا ثم يصلي ركعتين وهو قاعد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": 1721,
			"text": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن قتادة، عن زرارة بن أوفى، أن سعد بن هشام بن عامر، لما أن قدم، علينا أخبرنا أنه، أتى ابن عباس فسأله عن وتر، رسول الله صلى الله عليه وسلم قال ألا أدلك أو ألا أنبئك بأعلم أهل الأرض بوتر رسول الله صلى الله عليه وسلم ‏.‏ قلت من قال عائشة ‏.‏ فأتيناها فسلمنا عليها ودخلنا فسألناها فقلت أنبئيني عن وتر رسول الله صلى الله عليه وسلم ‏.‏ قالت كنا نعد له سواكه وطهوره فيبعثه الله عز وجل ما شاء أن يبعثه من الليل فيتسوك ويتوضأ ثم يصلي تسع ركعات ولا يقعد فيهن إلا في الثامنة فيحمد الله ويذكره ويدعو ثم ينهض ولا يسلم ثم يصلي التاسعة فيجلس فيحمد الله ويذكره ويدعو ثم يسلم تسليما يسمعنا ثم يصلي ركعتين وهو جالس فتلك إحدى عشرة ركعة يا بنى فلما أسن رسول الله صلى الله عليه وسلم وأخذ اللحم أوتر بسبع ثم يصلي ركعتين وهو جالس بعد ما يسلم فتلك تسعا أى بنى وكان رسول الله صلى الله عليه وسلم إذا صلى صلاة أحب أن يداوم عليها ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": 1722,
			"text": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن قتادة، عن الحسن، قال أخبرني سعد بن هشام، عن عائشة، أنه سمعها تقول، إن رسول الله صلى الله عليه وسلم كان يوتر بتسع ركعات ثم يصلي ركعتين وهو جالس فلما ضعف أوتر بسبع ركعات ثم صلى ركعتين وهو جالس ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": 1723,
			"text": "أخبرنا محمد بن بشار، قال حدثنا حجاج، قال حدثنا حماد، عن قتادة، عن الحسن، عن سعد بن هشام، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يوتر بتسع ويركع ركعتين وهو جالس ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": 1724,
			"text": "أخبرنا محمد بن عبد الله الخلنجي، قال حدثنا أبو سعيد، - يعني مولى بني هاشم - قال حدثنا حصين بن نافع، قال حدثنا الحسن، عن سعد بن هشام، أنه وفد على أم المؤمنين عائشة فسألها عن صلاة رسول الله صلى الله عليه وسلم فقالت كان يصلي من الليل ثمان ركعات ويوتر بالتاسعة ويصلي ركعتين وهو جالس ‏.‏ مختصر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": 1725,
			"text": "أخبرنا هناد بن السري، عن أبي الأحوص، عن الأعمش، أراه عن إبراهيم، عن الأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل تسع ركعات ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": 1726,
			"text": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، قال حدثنا مالك، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم كان يصلي من الليل إحدى عشرة ركعة ويوتر منها بواحدة ثم يضطجع على شقه الأيمن ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": 1727,
			"text": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": 1728,
			"text": "أخبرنا إبراهيم بن يعقوب، قال حدثنا أبو النعمان، قال حدثنا حماد بن سلمة، عن عاصم الأحول، عن أبي مجلز، أن أبا موسى، كان بين مكة والمدينة فصلى العشاء ركعتين ثم قام فصلى ركعة أوتر بها فقرأ فيها بمائة آية من النساء ثم قال ما ألوت أن أضع قدمى حيث وضع رسول الله صلى الله عليه وسلم قدميه وأنا أقرأ بما قرأ به رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": 1729,
			"text": "أخبرنا محمد بن الحسين بن إبراهيم بن إشكاب النسائي، قال أنبأنا محمد بن أبي عبيدة، قال حدثنا أبي، عن الأعمش، عن طلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا سلم قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "أخبرنا يحيى بن موسى، قال حدثنا عبد الرحمن بن عبد الله بن سعد، قال حدثنا أبو جعفر الرازي، عن الأعمش، عن زبيد، وطلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ خالفهما حصين فرواه عن ذر عن ابن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "أخبرنا الحسن بن قزعة، عن حصين بن نمير، عن حصين بن عبد الرحمن، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وكان يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ويرفع صوته بالثالثة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن عبد الرحمن، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ثم يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ويرفع بـ ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ صوته بالثالثة ‏.‏ رواه منصور عن سلمة بن كهيل ولم يذكر ذرا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "أخبرنا محمد بن قدامة، عن جرير، عن منصور، عن سلمة بن كهيل، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وكان إذا سلم وفرغ قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا طول في الثالثة ‏.‏ ورواه عبد الملك بن أبي سليمان عن زبيد ولم يذكر ذرا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا عبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ورواه محمد بن جحادة عن زبيد ولم يذكر ذرا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، قال حدثنا محمد بن جحادة، عن زبيد، عن ابن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا فرغ من الصلاة قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "أخبرنا أحمد بن محمد بن عبيد الله، قال حدثنا شعيب بن حرب، عن مالك، عن زبيد، عن ابن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك، عن زبيد، عن ذر، عن ابن أبزى، مرسل ‏.‏ وقد رواه عطاء بن السائب عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "أخبرنا عبد الله بن الصباح، قال حدثنا الحسن بن حبيب، قال حدثنا روح بن القاسم، عن عطاء بن السائب، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "أخبرنا محمد بن بشار، قال حدثنا أبو داود، قال حدثنا شعبة، عن قتادة، قال سمعت عزرة، يحدث عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا فرغ قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "أخبرنا إسحاق بن منصور، قال حدثنا أبو داود، قال حدثنا شعبة، عن قتادة، عن زرارة، عن عبد الرحمن بن أبزى، عن رسول الله صلى الله عليه وسلم كان يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا فرغ قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ويمد في الثالثة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، قال سمعت قتادة، يحدث عن زرارة، عن عبد الرحمن بن أبزى، أن رسول الله صلى الله عليه وسلم كان يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ خالفهما شبابة فرواه عن شعبة عن قتادة عن زرارة بن أوفى عن عمران بن حصين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "أخبرنا بشر بن خالد، قال حدثنا شبابة، عن شعبة، عن قتادة، عن زرارة بن أوفى، عن عمران بن حصين، أن النبي صلى الله عليه وسلم أوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا تابع شبابة على هذا الحديث ‏.‏ خالفه يحيى بن سعيد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، عن شعبة، عن قتادة، عن زرارة، عن عمران بن حصين، قال صلى رسول الله صلى الله عليه وسلم الظهر فقرأ رجل بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ فلما صلى قال ‏\"‏ من قرأ بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ ‏\"‏ ‏.‏ قال رجل أنا ‏.‏ قال ‏\"‏ قد علمت أن بعضهم خالجنيها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن بريد، عن أبي الحوراء، قال قال الحسن علمني رسول الله صلى الله عليه وسلم كلمات أقولهن في الوتر في القنوت ‏ \"‏ اللهم اهدني فيمن هديت وعافني فيمن عافيت وتولني فيمن توليت وبارك لي فيما أعطيت وقني شر ما قضيت إنك تقضي ولا يقضى عليك وإنه لا يذل من واليت تباركت ربنا وتعاليت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن يحيى بن عبد الله بن سالم، عن موسى بن عقبة، عن عبد الله بن علي، عن الحسن بن علي، قال علمني رسول الله صلى الله عليه وسلم هؤلاء الكلمات في الوتر قال ‏ \"‏ اللهم اهدني فيمن هديت وبارك لي فيما أعطيت وتولني فيمن توليت وقني شر ما قضيت فإنك تقضي ولا يقضى عليك وإنه لا يذل من واليت تباركت ربنا وتعاليت وصلى الله على النبي محمد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": 1747,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا سليمان بن حرب، وهشام بن عبد الملك، قالا حدثنا حماد بن سلمة، عن هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم كان يقول في آخر وتره ‏ \"‏ اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": 1748,
			"text": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، عن شعبة، عن ثابت البناني، عن أنس، قال كان النبي صلى الله عليه وسلم لا يرفع يديه في شىء من دعائه إلا في الاستسقاء ‏.‏ قال شعبة فقلت لثابت أنت سمعته من أنس قال سبحان الله ‏.‏ قلت سمعته قال سبحان الله ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": 1749,
			"text": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج، قال حدثنا ليث، قال حدثني عقيل، عن ابن شهاب، عن عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي إحدى عشرة ركعة فيما بين أن يفرغ من صلاة العشاء إلى الفجر بالليل سوى ركعتى الفجر ويسجد قدر ما يقرأ أحدكم خمسين آية ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": 1750,
			"text": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، عن سفيان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن النبي صلى الله عليه وسلم أنه كان يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ويقول بعد ما يسلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يرفع بها صوته ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": 1751,
			"text": "أخبرنا أحمد بن يحيى، قال حدثنا محمد بن عبيد، عن سفيان الثوري، وعبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ويقول بعد ما يسلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يرفع بها صوته ‏.‏ خالفهما أبو نعيم فرواه عن سفيان عن زبيد عن ذر عن سعيد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": 1752,
			"text": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن أبي نعيم، عن سفيان، عن زبيد، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا أراد أن ينصرف قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا يرفع بها صوته ‏.‏ قال أبو عبد الرحمن أبو نعيم أثبت عندنا من محمد بن عبيد ومن قاسم بن يزيد وأثبت أصحاب سفيان عندنا والله أعلم يحيى بن سعيد القطان ثم عبد الله بن المبارك ثم وكيع بن الجراح ثم عبد الرحمن بن مهدي ثم أبو نعيم ثم الأسود في هذا الحديث ‏.‏ ورواه جرير بن حازم عن زبيد فقال يمد صوته في الثالثة ويرفع ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": 1753,
			"text": "أخبرنا حرمي بن يونس بن محمد، قال حدثنا أبي قال، حدثنا جرير، قال سمعت زبيدا، يحدث عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وإذا سلم قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يمد صوته في الثالثة ثم يرفع ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": 1754,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا عبد العزيز بن عبد الصمد، قال حدثنا سعيد، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر بـ ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وإذا فرغ قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ أرسله هشام ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": 1755,
			"text": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن أبي عامر، عن هشام، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، أن النبي صلى الله عليه وسلم كان يوتر ‏.‏ وساق الحديث ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "أخبرنا عبيد الله بن فضالة بن إبراهيم، قال حدثنا محمد، - يعني ابن المبارك الصوري - قال حدثنا معاوية، - يعني ابن سلام - عن يحيى بن أبي كثير، قال أخبرني أبو سلمة بن عبد الرحمن، أنه سأل عائشة عن صلاة، رسول الله صلى الله عليه وسلم من الليل فقالت كان يصلي ثلاث عشرة ركعة تسع ركعات قائما يوتر فيها وركعتين جالسا فإذا أراد أن يركع قام فركع وسجد ويفعل ذلك بعد الوتر فإذا سمع نداء الصبح قام فركع ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا عثمان بن عمر، قال حدثنا شعبة، عن إبراهيم بن محمد، عن أبيه، عن مسروق، عن عائشة، أن النبي صلى الله عليه وسلم كان لا يدع أربع ركعات قبل الظهر وركعتين قبل الفجر ‏.‏ خالفه عامة أصحاب شعبة ممن روى هذا الحديث فلم يذكروا مسروقا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "أخبرني أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن إبراهيم بن محمد، أنه سمع أباه، يحدث أنه سمع عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يدع أربعا قبل الظهر وركعتين قبل الصبح ‏.‏ قال أبو عبد الرحمن هذا الصواب عندنا وحديث عثمان بن عمر خطأ والله تعالى أعلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "أخبرنا هارون بن إسحاق، قال حدثنا عبدة، عن سعيد، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ركعتا الفجر خير من الدنيا وما فيها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن نافع، عن ابن عمر، عن حفصة، عن رسول الله صلى الله عليه وسلم أنه كان إذا نودي لصلاة الصبح ركع ركعتين خفيفتين قبل أن يقوم إلى الصلاة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا عمرو، عن الزهري، عن سالم، عن ابن عمر، قال أخبرتني حفصة، أن النبي صلى الله عليه وسلم كان إذا أضاء له الفجر صلى ركعتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "أخبرنا عمرو بن منصور، قال حدثنا علي بن عياش، قال حدثنا شعيب، عن الزهري، قال أخبرني عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا سكت المؤذن بالأولى من صلاة الفجر قام فركع ركعتين خفيفتين قبل صلاة الفجر بعد أن يتبين الفجر ثم يضطجع على شقه الأيمن ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": 1763,
			"text": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن عبد الله بن عمرو، قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ لا تكن مثل فلان كان يقوم الليل فترك قيام الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": 1764,
			"text": "أخبرنا الحارث بن أسد، قال حدثنا بشر بن بكر، قال حدثني الأوزاعي، قال حدثني يحيى بن أبي كثير، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تكن يا عبد الله مثل فلان كان يقوم الليل فترك قيام الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "أخبرنا محمد بن إبراهيم البصري، قال حدثنا خالد بن الحارث، قال قرأت على عبد الحميد بن جعفر عن نافع، عن صفية، عن حفصة، عن النبي صلى الله عليه وسلم أنه كان يصلي ركعتى الفجر ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": 1766,
			"text": "أخبرنا شعيب بن شعيب بن إسحاق، قال حدثنا عبد الوهاب، قال أنبأنا شعيب، قال حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني نافع، قال حدثني ابن عمر، قال حدثتني حفصة، أن رسول الله صلى الله عليه وسلم كان يركع ركعتين خفيفتين بين النداء والإقامة من صلاة الفجر ‏.‏ قال أبو عبد الرحمن كلا الحديثين عندنا خطأ والله تعالى أعلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": 1767,
			"text": "أخبرنا إسحاق بن منصور، قال أنبأنا يحيى، قال حدثنا الأوزاعي، قال حدثني يحيى، عن نافع، عن ابن عمر، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يركع بين النداء والصلاة ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": 1768,
			"text": "أخبرنا هشام بن عمار، قال حدثنا يحيى، - يعني ابن حمزة - قال حدثنا الأوزاعي، عن يحيى، عن أبي سلمة، قال هو ونافع عن ابن عمر، عن حفصة، أن النبي صلى الله عليه وسلم كان يصلي بين النداء والإقامة ركعتين خفيفتين ركعتى الفجر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": 1769,
			"text": "أخبرنا إسحاق بن منصور، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني نافع، أن ابن عمر، حدثه أن حفصة حدثته أن رسول الله صلى الله عليه وسلم كان يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الصبح ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "أخبرنا يحيى بن محمد، قال حدثنا محمد بن جهضم، قال إسماعيل حدثنا عن عمر بن نافع، عن أبيه، عن ابن عمر، قال أخبرتني حفصة، أن رسول الله صلى الله عليه وسلم كان يصلي قبل الصبح ركعتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": 1771,
			"text": "أخبرنا محمد بن عبد الله بن عبد الحكم، قال أنبأنا إسحاق بن الفرات، عن يحيى بن أيوب، قال حدثني يحيى بن سعيد، قال أنبأنا نافع، عن ابن عمر، عن حفصة، أنها أخبرته أن رسول الله صلى الله عليه وسلم كان إذا نودي لصلاة الصبح سجد سجدتين قبل صلاة الصبح ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": 1772,
			"text": "أخبرنا عبد الله بن إسحاق، عن أبي عاصم، عن ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن ابن عمر، عن حفصة أم المؤمنين، أنها أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن صلى ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": 1773,
			"text": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني نافع، عن عبد الله بن عمر، أن حفصة أم المؤمنين، أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن من الأذان لصلاة الصبح وبدا الصبح صلى ركعتين خفيفتين قبل أن تقام الصلاة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": 1774,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال حدثتني أختي، حفصة أنه كان يصلي قبل الفجر ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": 1775,
			"text": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا أبي قال، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله بن عمر، عن حفصة، أن رسول الله صلى الله عليه وسلم كان يصلي ركعتين إذا طلع الفجر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": 1776,
			"text": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن زيد بن محمد، قال سمعت نافعا، عن ابن عمر، عن حفصة، أنها قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر لا يصلي إلا ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": 1777,
			"text": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن نافع، عن ابن عمر، عن حفصة، عن رسول الله صلى الله عليه وسلم أنه كان إذا نودي لصلاة الصبح ركع ركعتين خفيفتين قبل أن يقوم إلى الصلاة ‏.‏ وروى سالم عن ابن عمر عن حفصة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1778,
			"arabicnumber": 1778,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن الزهري، عن سالم، قال ابن عمر أخبرتني حفصة، أن رسول الله صلى الله عليه وسلم كان يركع ركعتين قبل الفجر وذلك بعد ما يطلع الفجر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": 1779,
			"text": "أخبرنا الحسين بن عيسى، قال حدثنا سفيان، عن عمرو، عن الزهري، عن سالم، عن أبيه، قال أخبرتني حفصة، أن رسول الله صلى الله عليه وسلم كان إذا أضاء له الفجر صلى ركعتين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": 1780,
			"text": "أخبرنا محمود بن خالد، قال حدثنا الوليد، عن أبي عمرو، عن يحيى، قال حدثني أبو سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الفجر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": 1781,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، قال حدثنا يحيى، عن أبي سلمة، أنه سأل عائشة عن صلاة، رسول الله صلى الله عليه وسلم بالليل قالت كان يصلي ثلاث عشرة ركعة يصلي ثمان ركعات ثم يوتر ثم يصلي ركعتين وهو جالس فإذا أراد أن يركع قام فركع ويصلي ركعتين بين الأذان والإقامة في صلاة الصبح ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": 1782,
			"text": "أخبرنا أحمد بن نصر، قال حدثنا عمرو بن محمد، قال حدثنا عثام بن علي، قال حدثنا الأعمش، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يصلي ركعتى الفجر إذا سمع الأذان ويخففهما ‏.‏ قال أبو عبد الرحمن هذا حديث منكر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": 1783,
			"text": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، قال أنبأنا يونس، عن الزهري، قال أخبرني السائب بن يزيد، أن شريحا الحضرمي، ذكر عند رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ ذاك رجل لا يتوسد القرآن ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": 1784,
			"text": "أخبرنا قتيبة بن سعيد، عن مالك، عن محمد بن المنكدر، عن سعيد بن جبير، عن رجل، عنده رضا أخبره أن عائشة رضى الله عنها أخبرته أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما من امرئ تكون له صلاة بليل فغلبه عليها نوم إلا كتب الله له أجر صلاته وكان نومه صدقة عليه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "أخبرنا أبو داود، قال حدثنا محمد بن سليمان، قال حدثنا أبو جعفر الرازي، عن محمد بن المنكدر، عن سعيد بن جبير، عن الأسود بن يزيد، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من كانت له صلاة صلاها من الليل فنام عنها كان ذلك صدقة تصدق الله عز وجل عليه وكتب له أجر صلاته ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": 1786,
			"text": "أخبرنا أحمد بن نصر، قال حدثنا يحيى بن أبي بكير، قال حدثنا أبو جعفر الرازي، عن محمد بن المنكدر، عن سعيد بن جبير، عن عائشة، أن رسول الله صلى الله عليه وسلم قال فذكر نحوه ‏.‏ قال أبو عبد الرحمن أبو جعفر الرازي ليس بالقوي في الحديث ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": 1787,
			"text": "أخبرنا هارون بن عبد الله، قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي صلى الله عليه وسلم قال ‏ \"‏ من أتى فراشه وهو ينوي أن يقوم يصلي من الليل فغلبته عيناه حتى أصبح كتب له ما نوى وكان نومه صدقة عليه من ربه عز وجل ‏\"‏ ‏.‏ خالفه سفيان ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن سفيان الثوري، عن عبدة، قال سمعت سويد بن غفلة، عن أبي ذر، وأبي الدرداء، موقوفا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو عوانة، عن قتادة، عن زرارة، عن سعد بن هشام، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا لم يصل من الليل منعه من ذلك نوم أو وجع صلى من النهار ثنتى عشرة ركعة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو صفوان عبد الله بن سعيد بن عبد الملك بن مروان، عن يونس، عن ابن شهاب، أن السائب بن يزيد، وعبيد الله، أخبراه أن عبد الرحمن بن عبد القاري قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من نام عن حزبه أو عن شىء منه فقرأه فيما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "أخبرنا محمد بن رافع، قال حدثنا عبد الرزاق، قال أنبأنا معمر، عن الزهري، عن عروة، عن عبد الرحمن بن عبد القاري، أن عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من نام عن حزبه - أو قال جزئه - من الليل فقرأه فيما بين صلاة الصبح إلى صلاة الظهر فكأنما قرأه من الليل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "أخبرنا قتيبة بن سعيد، عن مالك، عن داود بن الحصين، عن الأعرج، عن عبد الرحمن بن عبد القاري، أن عمر بن الخطاب، قال من فاته حزبه من الليل فقرأه حين تزول الشمس إلى صلاة الظهر فإنه لم يفته أو كأنه أدركه ‏.‏ رواه حميد بن عبد الرحمن بن عوف موقوفا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن شعبة، عن سعد بن إبراهيم، عن حميد بن عبد الرحمن، عن عمر، قال من فاته ورده من الليل فليقرأه في صلاة قبل الظهر فإنها تعدل صلاة الليل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "أخبرنا الحسين بن منصور بن جعفر النيسابوري، قال حدثنا إسحاق بن سليمان، قال حدثنا مغيرة بن زياد، عن عطاء، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من ثابر على اثنتى عشرة ركعة في اليوم والليلة دخل الجنة أربعا قبل الظهر وركعتين بعدها وركعتين بعد المغرب وركعتين بعد العشاء وركعتين قبل الفجر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "أخبرنا أحمد بن يحيى، قال حدثنا محمد بن بشر، قال حدثنا أبو يحيى، إسحاق بن سليمان الرازي عن المغيرة بن زياد، عن عطاء بن أبي رباح، عن عائشة، رضى الله عنها عن النبي صلى الله عليه وسلم قال ‏ \"‏ من ثابر على اثنتى عشرة ركعة بنى الله عز وجل له بيتا في الجنة أربعا قبل الظهر وركعتين بعد الظهر وركعتين بعد المغرب وركعتين بعد العشاء وركعتين قبل الفجر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا معقل، عن عطاء، قال أخبرت أن أم حبيبة بنت أبي سفيان قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من ركع ثنتى عشرة ركعة في يومه وليلته سوى المكتوبة بنى الله له بها بيتا في الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "أخبرني إبراهيم بن الحسن، قال حدثنا حجاج بن محمد، قال قال ابن جريج قلت لعطاء بلغني أنك تركع قبل الجمعة اثنتى عشرة ركعة ما بلغك في ذلك قال أخبرت أم حبيبة عنبسة بن أبي سفيان أن النبي صلى الله عليه وسلم قال ‏ \"‏ من ركع اثنتى عشرة ركعة في اليوم والليلة سوى المكتوبة بنى الله عز وجل له بيتا في الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "أخبرني أيوب بن محمد، قال أنبأنا معمر بن سليمان، قال حدثنا زيد بن حبان، عن ابن جريج، عن عطاء، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من صلى في يوم ثنتى عشرة ركعة بنى الله عز وجل له بيتا في الجنة ‏\"‏ ‏.‏ قال أبو عبد الرحمن عطاء لم يسمعه من عنبسة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "أخبرنا محمد بن رافع، قال حدثنا زيد بن حباب، قال حدثني محمد بن سعيد الطائفي، قال حدثنا عطاء بن أبي رباح، عن يعلى بن أمية، قال قدمت الطائف فدخلت على عنبسة بن أبي سفيان وهو بالموت فرأيت منه جزعا فقلت إنك على خير ‏.‏ فقال أخبرتني أختي أم حبيبة أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من صلى ثنتى عشرة ركعة بالنهار أو بالليل بنى الله عز وجل له بيتا في الجنة ‏\"‏ ‏.‏ خالفهم أبو يونس القشيري ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، ومحمد بن مكي، قالا أنبأنا عبد الله، عن أبي يونس القشيري، عن ابن أبي رباح، عن شهر بن حوشب، حدثه عن أم حبيبة بنت أبي سفيان، قالت من صلى ثنتى عشرة ركعة في يوم فصلى قبل الظهر بنى الله له بيتا في الجنة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "أخبرنا الربيع بن سليمان، قال أنبأنا أبو الأسود، قال حدثني بكر بن مضر، عن ابن عجلان، عن أبي إسحاق الهمداني، عن عمرو بن أوس، عن عنبسة بن أبي سفيان، عن أم حبيبة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ اثنتا عشرة ركعة من صلاهن بنى الله له بيتا في الجنة أربع ركعات قبل الظهر وركعتين بعد الظهر وركعتين قبل العصر وركعتين بعد المغرب وركعتين قبل صلاة الصبح ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "أخبرنا أبو الأزهر، أحمد بن الأزهر النيسابوري قال حدثنا يونس بن محمد، قال حدثنا فليح، عن سهيل بن أبي صالح، عن أبي إسحاق، عن المسيب، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من صلى اثنتى عشرة ركعة بنى الله له بيتا في الجنة أربعا قبل الظهر واثنتين بعدها واثنتين قبل العصر واثنتين بعد المغرب واثنتين قبل الصبح ‏\"‏ ‏.‏ قال أبو عبد الرحمن فليح بن سليمان ليس بالقوي ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال أنبأنا زهير، عن أبي إسحاق، عن المسيب بن رافع، عن عنبسة، أخي أم حبيبة عن أم حبيبة، قالت من صلى في اليوم والليلة ثنتى عشرة ركعة سوى المكتوبة بني له بيت في الجنة أربعا قبل الظهر وركعتين بعدها وثنتين قبل العصر وثنتين بعد المغرب وثنتين قبل الفجر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد بن هارون، قال أنبأنا إسماعيل، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من صلى في اليوم والليلة ثنتى عشرة ركعة بني له بيت في الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، قال حدثنا إسماعيل، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت من صلى في الليل والنهار ثنتى عشرة ركعة سوى المكتوبة بني له بيت في الجنة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "أخبرنا محمد بن حاتم، قال حدثنا محمد بن مكي، وحبان، قالا حدثنا عبد الله، عن إسماعيل، عن المسيب بن رافع، عن أم حبيبة، قالت من صلى في يوم وليلة ثنتى عشرة ركعة سوى المكتوبة بنى الله عز وجل له بيتا في الجنة ‏.‏ لم يرفعه حصين وأدخل بين عنبسة وبين المسيب ذكوان ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "أخبرنا زكريا بن يحيى، قال حدثنا وهب، قال حدثنا خالد، عن حصين، عن المسيب بن رافع، عن أبي صالح، ذكوان قال حدثني عنبسة بن أبي سفيان، أن أم حبيبة، حدثته أنه، من صلى في يوم ثنتى عشرة ركعة بني له بيت في الجنة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "أخبرنا يحيى بن حبيب، قال حدثنا حماد، عن عاصم، عن أبي صالح، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من صلى في يوم ثنتى عشرة ركعة سوى الفريضة بنى الله له أو بني له بيت في الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "أخبرنا علي بن المثنى، عن سويد بن عمرو، قال حدثني حماد، عن عاصم، عن أبي صالح، عن أم حبيبة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من صلى ثنتى عشرة ركعة في يوم وليلة بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق، قال حدثنا النضر، قال حدثنا حماد بن سلمة، عن عاصم، عن أبي صالح، عن أم حبيبة، قالت من صلى في يوم اثنتى عشرة ركعة بني له بيت في الجنة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى بن إسحاق، قال حدثنا محمد بن سليمان، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من صلى في يوم ثنتى عشرة ركعة سوى الفريضة بنى الله له بيتا في الجنة ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ ومحمد بن سليمان ضعيف هو ابن الأصبهاني وقد روي هذا الحديث من أوجه سوى هذا الوجه بغير اللفظ الذي تقدم ذكره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "أخبرني يزيد بن محمد بن عبد الصمد، قال حدثنا هشام العطار، قال حدثني إسماعيل بن عبد الله بن سماعة، عن موسى بن أعين، عن أبي عمرو الأوزاعي، عن حسان بن عطية، قال لما نزل بعنبسة جعل يتضور فقيل له فقال أما إني سمعت أم حبيبة زوج النبي صلى الله عليه وسلم تحدث عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ من ركع أربع ركعات قبل الظهر وأربعا بعدها حرم الله عز وجل لحمه على النار ‏\"‏ ‏.‏ فما تركتهن منذ سمعتهن ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا أبي قال، حدثنا عبيد الله، عن زيد بن أبي أنيسة، قال حدثني أيوب، - رجل من أهل الشام - عن القاسم الدمشقي، عن عنبسة بن أبي سفيان، قال أخبرتني أختي أم حبيبة، زوج النبي صلى الله عليه وسلم أن حبيبها أبا القاسم صلى الله عليه وسلم أخبرها قال ‏ \"‏ ما من عبد مؤمن يصلي أربع ركعات بعد الظهر فتمس وجهه النار أبدا إن شاء الله عز وجل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "أخبرنا أحمد بن ناصح، قال حدثنا مروان بن محمد، عن سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، أن رسول الله صلى الله عليه وسلم كان يقول ‏ \"‏ من صلى أربع ركعات قبل الظهر وأربعا بعدها حرمه الله عز وجل على النار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "أخبرنا محمود بن خالد، عن مروان بن محمد، قال حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، - قال مروان وكان سعيد إذا قرئ عليه عن أم حبيبة عن النبي صلى الله عليه وسلم أقر بذلك ولم ينكره وإذا حدثنا به هو لم يرفعه - قالت من ركع أربع ركعات قبل الظهر وأربعا بعدها حرمه الله على النار ‏.‏ قال أبو عبد الرحمن مكحول لم يسمع من عنبسة شيئا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "أخبرنا عبد الله بن إسحاق، قال حدثنا أبو عاصم، قال حدثنا سعيد بن عبد العزيز، قال سمعت سليمان بن موسى، يحدث عن محمد بن أبي سفيان، قال لما نزل به الموت أخذه أمر شديد فقال حدثتني أختي أم حبيبة بنت أبي سفيان قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرمه الله تعالى على النار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "أخبرنا عمرو بن علي، قال حدثنا أبو قتيبة، قال حدثنا محمد بن عبد الله الشعيثي، عن أبيه، عن عنبسة بن أبي سفيان، عن أم حبيبة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من صلى أربعا قبل الظهر وأربعا بعدها لم تمسه النار ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب حديث مروان من حديث سعيد بن عبد العزيز ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 220
			}
		}
	]
}