{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2435,
			"arabicnumber": 2435,
			"text": "أخبرنا محمد بن عبد الله بن عمار الموصلي، عن المعافى، عن زكريا بن إسحاق المكي، قال حدثنا يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمعاذ حين بعثه إلى اليمن ‏ \"‏ إنك تأتي قوما أهل كتاب فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإن هم أطاعوك بذلك فأخبرهم أن الله عز وجل فرض عليهم خمس صلوات في يوم وليلة فإن هم - يعني أطاعوك بذلك - فأخبرهم أن الله عز وجل فرض عليهم صدقة تؤخذ من أغنيائهم فترد على فقرائهم فإن هم أطاعوك بذلك فاتق دعوة المظلوم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2436,
			"arabicnumber": 2436,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا معتمر، قال سمعت بهز بن حكيم، يحدث عن أبيه، عن جده، قال قلت يا نبي الله ما أتيتك حتى حلفت أكثر من عددهن - لأصابع يديه - أن لا آتيك ولا آتي دينك وإني كنت امرأ لا أعقل شيئا إلا ما علمني الله عز وجل ورسوله وإني أسألك بوحى الله بما بعثك ربك إلينا قال ‏\"‏ بالإسلام ‏\"‏ ‏.‏ قلت وما آيات الإسلام قال ‏\"‏ أن تقول أسلمت وجهي إلى الله وتخليت وتقيم الصلاة وتؤتي الزكاة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2437,
			"arabicnumber": 2437,
			"text": "أخبرنا عيسى بن مساور، قال حدثنا محمد بن شعيب بن شابور، عن معاوية بن سلام، عن أخيه، زيد بن سلام أنه أخبره عن جده أبي سلام، عن عبد الرحمن بن غنم، أن أبا مالك الأشعري، حدثه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إسباغ الوضوء شطر الإيمان والحمد لله تملأ الميزان والتسبيح والتكبير يملأ السموات والأرض والصلاة نور والزكاة برهان والصبر ضياء والقرآن حجة لك أو عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2438,
			"arabicnumber": 2438,
			"text": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، قال أنبأنا خالد، عن ابن أبي هلال، عن نعيم المجمر أبي عبد الله، قال أخبرني صهيب، أنه سمع من أبي هريرة، ومن أبي سعيد يقولان خطبنا رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ والذي نفسي بيده ‏\"‏ ‏.‏ ثلاث مرات ثم أكب فأكب كل رجل منا يبكي لا ندري على ماذا حلف ثم رفع رأسه في وجهه البشرى فكانت أحب إلينا من حمر النعم ثم قال ‏\"‏ ما من عبد يصلي الصلوات الخمس ويصوم رمضان ويخرج الزكاة ويجتنب الكبائر السبع إلا فتحت له أبواب الجنة فقيل له ادخل بسلام ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2439,
			"arabicnumber": 2439,
			"text": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي، عن شعيب، عن الزهري، قال أخبرني حميد بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أنفق زوجين من شىء من الأشياء في سبيل الله دعي من أبواب الجنة يا عبد الله هذا خير لك وللجنة أبواب فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ قال أبو بكر هل على من يدعى من تلك الأبواب من ضرورة فهل يدعى منها كلها أحد يا رسول الله قال ‏\"‏ نعم وإني أرجو أن تكون منهم ‏\"‏ ‏.‏ يعني أبا بكر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2440,
			"arabicnumber": 2440,
			"text": "أخبرنا هناد بن السري، في حديثه عن أبي معاوية، عن الأعمش، عن المعرور بن سويد، عن أبي ذر، قال جئت إلى النبي صلى الله عليه وسلم وهو جالس في ظل الكعبة فلما رآني مقبلا قال ‏\"‏ هم الأخسرون ورب الكعبة ‏\"‏ ‏.‏ فقلت ما لي لعلي أنزل في شىء قلت من هم فداك أبي وأمي قال ‏\"‏ الأكثرون أموالا إلا من قال هكذا وهكذا وهكذا حتى بين يديه وعن يمينه وعن شماله ‏\"‏ ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لا يموت رجل فيدع إبلا أو بقرا لم يؤد زكاتها إلا جاءت يوم القيامة أعظم ما كانت وأسمنه تطؤه بأخفافها وتنطحه بقرونها كلما نفدت أخراها أعيدت أولاها حتى يقضى بين الناس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2441,
			"arabicnumber": 2441,
			"text": "أخبرنا مجاهد بن موسى، قال حدثنا ابن عيينة، عن جامع بن أبي راشد، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل له مال لا يؤدي حق ماله إلا جعل له طوقا في عنقه شجاع أقرع وهو يفر منه وهو يتبعه ‏\"‏ ‏.‏ ثم قرأ مصداقه من كتاب الله عز وجل ‏{‏ ولا تحسبن الذين يبخلون بما آتاهم الله من فضله هو خيرا لهم بل هو شر لهم سيطوقون ما بخلوا به يوم القيامة ‏}‏ الآية ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2442,
			"arabicnumber": 2442,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، قال حدثنا قتادة، عن أبي عمرو الغداني، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أيما رجل كانت له إبل لا يعطي حقها في نجدتها ورسلها ‏\"‏ ‏.‏ قالوا يا رسول الله ما نجدتها ورسلها قال ‏\"‏ في عسرها ويسرها فإنها تأتي يوم القيامة كأغذ ما كانت وأسمنه وآشره يبطح لها بقاع قرقر فتطؤه بأخفافها إذا جاءت أخراها أعيدت عليه أولاها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين الناس فيرى سبيله وأيما رجل كانت له بقر لا يعطي حقها في نجدتها ورسلها فإنها تأتي يوم القيامة أغذ ما كانت وأسمنه وآشره يبطح لها بقاع قرقر فتنطحه كل ذات قرن بقرنها وتطؤه كل ذات ظلف بظلفها إذا جاوزته أخراها أعيدت عليه أولاها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين الناس فيرى سبيله وأيما رجل كانت له غنم لا يعطي حقها في نجدتها ورسلها فإنها تأتي يوم القيامة كأغذ ما كانت وأكثره وأسمنه وآشره ثم يبطح لها بقاع قرقر فتطؤه كل ذات ظلف بظلفها وتنطحه كل ذات قرن بقرنها ليس فيها عقصاء ولا عضباء إذا جاوزته أخراها أعيدت عليه أولاها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين الناس فيرى سبيله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2443,
			"arabicnumber": 2443,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن عقيل، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، قال لما توفي رسول الله صلى الله عليه وسلم واستخلف أبو بكر بعده وكفر من كفر من العرب قال عمر لأبي بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ فقال أبو بكر رضى الله عنه لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عقالا كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعه ‏.‏ قال عمر رضى الله عنه فوالله ما هو إلا أن رأيت الله شرح صدر أبي بكر للقتال فعرفت أنه الحق ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2444,
			"arabicnumber": 2444,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا بهز بن حكيم، قال حدثني أبي، عن جدي، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ في كل إبل سائمة في كل أربعين ابنة لبون لا يفرق إبل عن حسابها من أعطاها مؤتجرا فله أجرها ومن أبى فإنا آخذوها وشطر إبله عزمة من عزمات ربنا لا يحل لآل محمد صلى الله عليه وسلم منها شىء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2445,
			"arabicnumber": 2445,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا سفيان، قال حدثني عمرو بن يحيى، ح وأخبرنا محمد بن المثنى، ومحمد بن بشار، عن عبد الرحمن، عن سفيان، وشعبة، ومالك، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس فيما دون خمسة أوسق صدقة ولا فيما دون خمس ذود صدقة ولا فيما دون خمسة أواق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2446,
			"arabicnumber": 2446,
			"text": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن يحيى بن سعيد، عن عمرو بن يحيى بن عمارة، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس فيما دون خمسة ذود صدقة وليس فيما دون خمسة أواق صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا المظفر بن مدرك أبو كامل، قال حدثنا حماد بن سلمة، قال أخذت هذا الكتاب من ثمامة بن عبد الله بن أنس بن مالك عن أنس بن مالك أن أبا بكر كتب لهم إن هذه فرائض الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين التي أمر الله عز وجل بها رسوله صلى الله عليه وسلم فمن سئلها من المسلمين على وجهها فليعط ومن سئل فوق ذلك فلا يعط فيما دون خمس وعشرين من الإبل في كل خمس ذود شاة فإذا بلغت خمسا وعشرين ففيها بنت مخاض إلى خمس وثلاثين فإن لم تكن بنت مخاض فابن لبون ذكر فإذا بلغت ستا وثلاثين ففيها بنت لبون إلى خمس وأربعين فإذا بلغت ستة وأربعين ففيها حقة طروقة الفحل إلى ستين فإذا بلغت إحدى وستين ففيها جذعة إلى خمس وسبعين فإذا بلغت ستا وسبعين ففيها بنتا لبون إلى تسعين فإذا بلغت إحدى وتسعين ففيها حقتان طروقتا الفحل إلى عشرين ومائة فإذا زادت على عشرين ومائة ففي كل أربعين بنت لبون وفي كل خمسين حقة فإذا تباين أسنان الإبل في فرائض الصدقات فمن بلغت عنده صدقة الجذعة وليست عنده جذعة وعنده حقة فإنها تقبل منه الحقة ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة الحقة وليست عنده حقة وعنده جذعة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين إن استيسرتا له ومن بلغت عنده صدقة الحقة وليست عنده وعنده بنت لبون فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة ابنة لبون وليست عنده إلا حقة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة ابنة لبون وليست عنده بنت لبون وعنده بنت مخاض فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة ابنة مخاض وليس عنده إلا ابن لبون ذكر فإنه يقبل منه وليس معه شىء ومن لم يكن عنده إلا أربع من الإبل فليس فيها شىء إلا أن يشاء ربها وفي صدقة الغنم في سائمتها إذا كانت أربعين ففيها شاة إلى عشرين ومائة فإذا زادت واحدة ففيها شاتان إلى مائتين فإذا زادت واحدة ففيها ثلاث شياه إلى ثلاثمائة فإذا زادت ففي كل مائة شاة ولا يؤخذ في الصدقة هرمة ولا ذات عوار ولا تيس الغنم إلا أن يشاء المصدق ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية فإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها شىء إلا أن يشاء ربها وفي الرقة ربع العشر فإن لم تكن إلا تسعين ومائة درهم فليس فيها شىء إلا أن يشاء ربها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2448,
			"arabicnumber": 2448,
			"text": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ تأتي الإبل على ربها على خير ما كانت إذا هي لم يعط فيها حقها تطؤه بأخفافها وتأتي الغنم على ربها على خير ما كانت إذا لم يعط فيها حقها تطؤه بأظلافها وتنطحه بقرونها - قال - ومن حقها أن تحلب على الماء ألا لا يأتين أحدكم يوم القيامة ببعير يحمله على رقبته له رغاء فيقول يا محمد ‏.‏ فأقول لا أملك لك شيئا قد بلغت ‏.‏ ألا لا يأتين أحدكم يوم القيامة بشاة يحملها على رقبته لها يعار فيقول يا محمد ‏.‏ فأقول لا أملك لك شيئا قد بلغت - قال - ويكون كنز أحدهم يوم القيامة شجاعا أقرع يفر منه صاحبه ويطلبه أنا كنزك فلا يزال حتى يلقمه أصبعه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2449,
			"arabicnumber": 2449,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا معتمر، قال سمعت بهز بن حكيم، يحدث عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ في كل إبل سائمة من كل أربعين ابنة لبون لا تفرق إبل عن حسابها من أعطاها مؤتجرا له أجرها ومن منعها فإنا آخذوها وشطر إبله عزمة من عزمات ربنا لا يحل لآل محمد صلى الله عليه وسلم منها شىء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2450,
			"arabicnumber": 2450,
			"text": "أخبرنا محمد بن رافع، قال حدثنا يحيى بن آدم، قال حدثنا مفضل، - وهو ابن مهلهل - عن الأعمش، عن شقيق، عن مسروق، عن معاذ، ‏.‏ أن رسول الله صلى الله عليه وسلم بعثه إلى اليمن وأمره أن يأخذ من كل حالم دينارا أو عدله معافر ومن البقر من ثلاثين تبيعا أو تبيعة ومن كل أربعين مسنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2451,
			"arabicnumber": 2451,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، - وهو ابن عبيد - قال حدثنا الأعمش، عن شقيق، عن مسروق، والأعمش، عن إبراهيم، قالا قال معاذ بعثني رسول الله صلى الله عليه وسلم إلى اليمن فأمرني أن آخذ من كل أربعين بقرة ثنية ومن كل ثلاثين تبيعا ومن كل حالم دينارا أو عدله معافر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2452,
			"arabicnumber": 2452,
			"text": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن مسروق، عن معاذ، قال لما بعثه رسول الله صلى الله عليه وسلم إلى اليمن أمره أن يأخذ من كل ثلاثين من البقر تبيعا أو تبيعة ومن كل أربعين مسنة ومن كل حالم دينارا أو عدله معافر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2453,
			"arabicnumber": 2453,
			"text": "أخبرنا محمد بن منصور الطوسي، قال حدثنا يعقوب، قال حدثنا أبي، عن ابن إسحاق، قال حدثني سليمان الأعمش، عن أبي وائل بن سلمة، عن معاذ بن جبل، قال أمرني رسول الله صلى الله عليه وسلم حين بعثني إلى اليمن أن لا آخذ من البقر شيئا حتى تبلغ ثلاثين فإذا بلغت ثلاثين ففيها عجل تابع جذع أو جذعة حتى تبلغ أربعين فإذا بلغت أربعين ففيها بقرة مسنة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2454,
			"arabicnumber": 2454,
			"text": "أخبرنا واصل بن عبد الأعلى، عن ابن فضيل، عن عبد الملك بن أبي سليمان، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من صاحب إبل ولا بقر ولا غنم لا يؤدي حقها إلا وقف لها يوم القيامة بقاع قرقر تطؤه ذات الأظلاف بأظلافها وتنطحه ذات القرون بقرونها ليس فيها يومئذ جماء ولا مكسورة القرن ‏\"‏ ‏.‏ قلنا يا رسول الله وماذا حقها قال ‏\"‏ إطراق فحلها وإعارة دلوها وحمل عليها في سبيل الله ولا صاحب مال لا يؤدي حقه إلا يخيل له يوم القيامة شجاع أقرع يفر منه صاحبه وهو يتبعه يقول له هذا كنزك الذي كنت تبخل به فإذا رأى أنه لا بد له منه أدخل يده في فيه فجعل يقضمها كما يقضم الفحل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2455,
			"arabicnumber": 2455,
			"text": "أخبرنا عبيد الله بن فضالة بن إبراهيم النسائي، قال أنبأنا شريح بن النعمان، قال حدثنا حماد بن سلمة، عن ثمامة بن عبد الله بن أنس بن مالك، عن أنس بن مالك، أن أبا بكر، رضى الله عنه كتب له أن هذه فرائض الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين التي أمر الله بها رسوله صلى الله عليه وسلم فمن سئلها من المسلمين على وجهها فليعطها ومن سئل فوقها فلا يعطه فيما دون خمس وعشرين من الإبل في خمس ذود شاة فإذا بلغت خمسا وعشرين ففيها بنت مخاض إلى خمس وثلاثين فإن لم تكن ابنة مخاض فابن لبون ذكر فإذا بلغت ستة وثلاثين ففيها بنت لبون إلى خمس وأربعين فإذا بلغت ستة وأربعين ففيها حقة طروقة الفحل إلى ستين فإذا بلغت إحدى وستين ففيها جذعة إلى خمسة وسبعين فإذا بلغت ستة وسبعين ففيها ابنتا لبون إلى تسعين فإذا بلغت إحدى وتسعين ففيها حقتان طروقتا الفحل إلى عشرين ومائة فإذا زادت على عشرين ومائة ففي كل أربعين ابنة لبون وفي كل خمسين حقة فإذا تباين أسنان الإبل في فرائض الصدقات فمن بلغت عنده صدقة الجذعة وليست عنده جذعة وعنده حقة فإنها تقبل منه الحقة ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة الحقة وليست عنده إلا جذعة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة الحقة وليست عنده وعنده ابنة لبون فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة بنت لبون وليست عنده إلا حقة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة بنت لبون وعنده بنت مخاض فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة ابنة مخاض وليست عنده إلا ابن لبون ذكر فإنه يقبل منه وليس معه شىء ومن لم يكن عنده إلا أربعة من الإبل فليس فيها شىء إلا أن يشاء ربها وفي صدقة الغنم في سائمتها إذا كانت أربعين ففيها شاة إلى عشرين ومائة فإذا زادت واحدة ففيها شاتان إلى مائتين فإذا زادت واحدة ففيها ثلاث شياه إلى ثلاثمائة فإذا زادت واحدة ففي كل مائة شاة ولا تؤخذ في الصدقة هرمة ولا ذات عوار ولا تيس الغنم إلا أن يشاء المصدق ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية وإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها شىء إلا أن يشاء ربها وفي الرقة ربع العشر فإن لم يكن المال إلا تسعين ومائة فليس فيه شىء إلا أن يشاء ربها ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2456,
			"arabicnumber": 2456,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من صاحب إبل ولا بقر ولا غنم لا يؤدي زكاتها إلا جاءت يوم القيامة أعظم ما كانت وأسمنه تنطحه بقرونها وتطؤه بأخفافها كلما نفذت أخراها أعادت عليه أولاها حتى يقضى بين الناس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2457,
			"arabicnumber": 2457,
			"text": "أخبرنا هناد بن السري، عن هشيم، عن هلال بن خباب، عن ميسرة أبي صالح، عن سويد بن غفلة، قال أتانا مصدق النبي صلى الله عليه وسلم فأتيته فجلست إليه فسمعته يقول ‏\"‏ إن في عهدي أن لا نأخذ راضع لبن ولا نجمع بين متفرق ولا نفرق بين مجتمع ‏\"‏ ‏.‏ فأتاه رجل بناقة كوماء فقال ‏\"‏ خذها ‏\"‏ ‏.‏ فأبى",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2458,
			"arabicnumber": 2458,
			"text": "أخبرنا هارون بن زيد بن يزيد، - يعني ابن أبي الزرقاء - قال حدثنا أبي قال، حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، أن النبي صلى الله عليه وسلم بعث ساعيا فأتى رجلا فأتاه فصيلا مخلولا فقال النبي صلى الله عليه وسلم ‏\"‏ بعثنا مصدق الله ورسوله وإن فلانا أعطاه فصيلا مخلولا اللهم لا تبارك فيه ولا في إبله ‏\"‏ ‏.‏ فبلغ ذلك الرجل فجاء بناقة حسناء فقال أتوب إلى الله عز وجل وإلى نبيه صلى الله عليه وسلم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم بارك فيه وفي إبله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2459,
			"arabicnumber": 2459,
			"text": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال عمرو بن مرة أخبرني قال سمعت عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏ ‏.‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2460,
			"arabicnumber": 2460,
			"text": "أخبرنا محمد بن المثنى، ومحمد بن بشار، - واللفظ له - قالا حدثنا يحيى، عن محمد بن أبي إسماعيل، عن عبد الرحمن بن هلال، قال قال جرير أتى النبي صلى الله عليه وسلم ناس من الأعراب فقالوا يا رسول الله يأتينا ناس من مصدقيك يظلمون ‏.‏ قال ‏\"‏ أرضوا مصدقيكم ‏\"‏ ‏.‏ قالوا وإن ظلم قال ‏\"‏ أرضوا مصدقيكم ‏\"‏ ‏.‏ ثم قالوا وإن ظلم قال ‏\"‏ أرضوا مصدقيكم ‏\"‏ ‏.‏ قال جرير فما صدر عني مصدق منذ سمعت من رسول الله صلى الله عليه وسلم إلا وهو راض ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2461,
			"arabicnumber": 2461,
			"text": "أخبرنا زياد بن أيوب، قال حدثنا إسماعيل، - هو ابن علية - قال أنبأنا داود، عن الشعبي، قال قال جرير قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أتاكم المصدق فليصدر وهو عنكم راض ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2462,
			"arabicnumber": 2462,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا زكريا بن إسحاق، عن عمرو بن أبي سفيان، عن مسلم بن ثفنة، قال استعمل ابن علقمة أبي على عرافة قومه وأمره أن يصدقهم، فبعثني أبي إلى طائفة منهم لآتيه بصدقتهم فخرجت حتى أتيت على شيخ كبير يقال له سعر فقلت إن أبي بعثني إليك لتؤدي صدقة غنمك ‏.‏ قال ابن أخي وأى نحو تأخذون قلت نختار حتى إنا لنشبر ضروع الغنم ‏.‏ قال ابن أخي فإني أحدثك أني كنت في شعب من هذه الشعاب على عهد رسول الله صلى الله عليه وسلم في غنم لي فجاءني رجلان على بعير فقالا إنا رسولا رسول الله صلى الله عليه وسلم إليك لتؤدي صدقة غنمك ‏.‏ قال قلت وما على فيها قالا شاة ‏.‏ فأعمد إلى شاة قد عرفت مكانها ممتلئة محضا وشحما فأخرجتها إليهما فقال هذه الشافع ‏.‏ والشافع الحائل وقد نهانا رسول الله صلى الله عليه وسلم أن نأخذ شافعا قال فأعمد إلى عناق معتاط - والمعتاط التي لم تلد ولدا وقد حان ولادها - فأخرجتها إليهما فقالا ناولناها فرفعتها إليهما فجعلاها معهما على بعيرهما ثم انطلقا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2463,
			"arabicnumber": 2463,
			"text": "أخبرنا هارون بن عبد الله، قال حدثنا روح، قال حدثنا زكريا بن إسحاق، قال حدثني عمرو بن أبي سفيان، قال حدثني مسلم بن ثفنة، أن ابن علقمة، استعمل أباه على صدقة قومه وساق الحديث ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2464,
			"arabicnumber": 2464,
			"text": "أخبرني عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث قال وقال عمر أمر رسول الله صلى الله عليه وسلم بصدقة فقيل منع ابن جميل وخالد بن الوليد وعباس بن عبد المطلب ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ ما ينقم ابن جميل إلا أنه كان فقيرا فأغناه الله وأما خالد بن الوليد فإنكم تظلمون خالدا قد احتبس أدراعه وأعتده في سبيل الله وأما العباس بن عبد المطلب عم رسول الله صلى الله عليه وسلم فهي عليه صدقة ومثلها معها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2465,
			"arabicnumber": 2465,
			"text": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، قال حدثني إبراهيم بن طهمان، عن موسى، قال حدثني أبو الزناد، عن عبد الرحمن، عن أبي هريرة، قال أمر رسول الله صلى الله عليه وسلم بصدقة مثله سواء ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2466,
			"arabicnumber": 2466,
			"text": "أخبرنا عمرو بن منصور، ومحمود بن غيلان، قالا حدثنا أبو نعيم، قال حدثنا سفيان، عن إبراهيم بن ميسرة، عن عثمان بن عبد الله بن الأسود، عن عبد الله بن هلال الثقفي، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال كدت أقتل بعدك في عناق أو شاة من الصدقة ‏.‏ فقال ‏ \"‏ لولا أنها تعطى فقراء المهاجرين ما أخذتها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2467,
			"arabicnumber": 2467,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن شعبة، وسفيان، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس على المسلم في عبده ولا فرسه صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2468,
			"arabicnumber": 2468,
			"text": "أخبرنا محمد بن علي بن حرب المروزي، قال حدثنا محرز بن الوضاح، عن إسماعيل، - وهو ابن أمية - عن مكحول، عن عراك بن مالك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا زكاة على الرجل المسلم في عبده ولا فرسه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2469,
			"arabicnumber": 2469,
			"text": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا أيوب بن موسى، عن مكحول، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، يرفعه إلى النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2470,
			"arabicnumber": 2470,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن خثيم، قال حدثنا أبي، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على المرء في فرسه ولا في مملوكه صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2471,
			"arabicnumber": 2471,
			"text": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2472,
			"arabicnumber": 2472,
			"text": "أخبرنا قتيبة، قال حدثنا حماد، عن خثيم بن عراك بن مالك، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على المسلم صدقة في غلامه ولا في فرسه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2473,
			"arabicnumber": 2473,
			"text": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، قال حدثنا يحيى، - وهو ابن سعيد - عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس فيما دون خمسة أواق صدقة ولا فيما دون خمس ذود صدقة وليس فيما دون خمس أوسق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2474,
			"arabicnumber": 2474,
			"text": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة المازني، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس فيما دون خمس أوسق من التمر صدقة وليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2475,
			"arabicnumber": 2475,
			"text": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن عبد الرحمن بن أبي صعصعة، عن يحيى بن عمارة، وعباد بن تميم، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا صدقة فيما دون خمس أوساق من التمر ولا فيما دون خمس أواق من الورق صدقة ولا فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2476,
			"arabicnumber": 2476,
			"text": "أخبرنا محمد بن منصور الطوسي، قال حدثنا يعقوب، قال حدثنا أبي قال، حدثنا ابن إسحاق، قال حدثني محمد بن يحيى بن حبان، ومحمد بن عبد الله بن عبد الرحمن بن أبي صعصعة، - وكانا ثقة - عن يحيى بن عمارة بن أبي حسن، وعباد بن تميم، - وكانا ثقة - عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس من الإبل صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "أخبرنا محمود بن غيلان، قال حدثنا أبو أسامة، قال حدثنا سفيان، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قد عفوت عن الخيل والرقيق فأدوا زكاة أموالكم من كل مائتين خمسة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2478,
			"arabicnumber": 2478,
			"text": "أخبرنا حسين بن منصور، قال حدثنا ابن نمير، قال حدثنا الأعمش، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قد عفوت عن الخيل والرقيق وليس فيما دون مائتين زكاة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2479,
			"arabicnumber": 2479,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، من أهل اليمن أتت رسول الله صلى الله عليه وسلم وبنت لها في يد ابنتها مسكتان غليظتان من ذهب فقال ‏\"‏ أتؤدين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله عز وجل بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى رسول الله صلى الله عليه وسلم فقالت هما لله ولرسوله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2480,
			"arabicnumber": 2480,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر بن سليمان، قال سمعت حسينا، قال حدثني عمرو بن شعيب، قال جاءت امرأة ومعها بنت لها إلى رسول الله صلى الله عليه وسلم وفي يد ابنتها مسكتان نحوه مرسل ‏.‏ قال أبو عبد الرحمن خالد أثبت من المعتمر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2481,
			"arabicnumber": 2481,
			"text": "أخبرنا الفضل بن سهل، قال حدثنا أبو النضر، هاشم بن القاسم قال حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الذي لا يؤدي زكاة ماله يخيل إليه ماله يوم القيامة شجاعا أقرع له زبيبتان - قال - فيلتزمه أو يطوقه - قال - يقول أنا كنزك أنا كنزك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2482,
			"arabicnumber": 2482,
			"text": "أخبرنا الفضل بن سهل، قال حدثنا حسن بن موسى الأشيب، قال حدثنا عبد الرحمن بن عبد الله بن دينار المدني، عن أبيه، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من آتاه الله عز وجل مالا فلم يؤد زكاته مثل له ماله يوم القيامة شجاعا أقرع له زبيبتان يأخذ بلهزمتيه يوم القيامة فيقول أنا مالك أنا كنزك ‏\"‏ ‏.‏ ثم تلا هذه الآية ‏{‏ ولا يحسبن الذين يبخلون بما آتاهم الله من فضله ‏}‏ الآية ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2483,
			"arabicnumber": 2483,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس فيما دون خمسة أوساق من حب أو تمر صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2484,
			"arabicnumber": 2484,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثنا روح بن القاسم، قال حدثني عمرو بن يحيى بن عمارة، عن أبيه، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يحل في البر والتمر زكاة حتى تبلغ خمسة أوسق ولا يحل في الورق زكاة حتى تبلغ خمسة أواق ولا يحل في إبل زكاة حتى تبلغ خمس ذود ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2485,
			"arabicnumber": 2485,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن إسماعيل بن أمية، عن محمد بن يحيى بن حبان، عن يحيى بن عمارة، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس في حب ولا تمر صدقة حتى يبلغ خمسة أوسق ولا فيما دون خمس ذود ولا فيما دون خمس أواق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2486,
			"arabicnumber": 2486,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا إدريس الأودي، عن عمرو بن مرة، عن أبي البختري، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس فيما دون خمس أواق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2487,
			"arabicnumber": 2487,
			"text": "أخبرنا أحمد بن عبدة، قال حدثنا حماد، عن يحيى بن سعيد، وعبيد الله بن عمر، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس فيما دون خمس أواق صدقة ولا فيما دون خمس ذود صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2488,
			"arabicnumber": 2488,
			"text": "أخبرنا هارون بن سعيد بن الهيثم أبو جعفر الأيلي، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ فيما سقت السماء والأنهار والعيون أو كان بعلا العشر وما سقي بالسواني والنضح نصف العشر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2489,
			"arabicnumber": 2489,
			"text": "أخبرني عمرو بن سواد بن الأسود بن عمرو، وأحمد بن عمرو، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال حدثنا عمرو بن الحارث، أن أبا الزبير، حدثه أنه، سمع جابر بن عبد الله، يقول أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ فيما سقت السماء والأنهار والعيون العشر وفيما سقي بالسانية نصف العشر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2490,
			"arabicnumber": 2490,
			"text": "أخبرنا هناد بن السري، عن أبي بكر، - وهو ابن عياش - عن عاصم، عن أبي وائل، عن معاذ، قال بعثني رسول الله صلى الله عليه وسلم إلى اليمن فأمرني أن آخذ مما سقت السماء العشر وفيما سقي بالدوالي نصف العشر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2491,
			"arabicnumber": 2491,
			"text": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، ومحمد بن جعفر، قالا حدثنا شعبة، قال سمعت خبيب بن عبد الرحمن، يحدث عن عبد الرحمن بن مسعود بن نيار، عن سهل بن أبي حثمة، قال أتانا ونحن في السوق فقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا خرصتم فخذوا ودعوا الثلث فإن لم تأخذوا أو تدعوا الثلث - شك شعبة - فدعوا الربع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2492,
			"arabicnumber": 2492,
			"text": "أخبرنا يونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال حدثني عبد الجليل بن حميد اليحصبي، أن ابن شهاب، حدثه قال حدثني أبو أمامة بن سهل بن حنيف، في الآية التي قال الله عز وجل ‏{‏ ولا تيمموا الخبيث منه تنفقون ‏}‏ قال هو الجعرور ولون حبيق فنهى رسول الله صلى الله عليه وسلم أن تؤخذ في الصدقة الرذالة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2493,
			"arabicnumber": 2493,
			"text": "أخبرنا يعقوب بن إبراهيم، قال أنبأنا يحيى، عن عبد الحميد بن جعفر، قال حدثني صالح بن أبي عريب، عن كثير بن مرة الحضرمي، عن عوف بن مالك، قال خرج رسول الله صلى الله عليه وسلم وبيده عصا وقد علق رجل قنو حشف فجعل يطعن في ذلك القنو فقال ‏ \"‏ لو شاء رب هذه الصدقة تصدق بأطيب من هذا إن رب هذه الصدقة يأكل حشفا يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2494,
			"arabicnumber": 2494,
			"text": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، قال سئل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏ \"‏ ما كان في طريق مأتي أو في قرية عامرة فعرفها سنة فإن جاء صاحبها وإلا فلك وما لم يكن في طريق مأتي ولا في قرية عامرة ففيه وفي الركاز الخمس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2495,
			"arabicnumber": 2495,
			"text": "أخبرنا إسحاق بن إبراهيم، قال حدثنا سفيان، عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح وأخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن الزهري، عن سعيد، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ العجماء جرحها جبار والبئر جبار والمعدن جبار وفي الركاز الخمس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2496,
			"arabicnumber": 2496,
			"text": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سعيد، وعبيد الله بن عبد الله، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2497,
			"arabicnumber": 2497,
			"text": "أخبرنا قتيبة، عن مالك، عن ابن شهاب، عن سعيد، وأبي، سلمة عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ جرح العجماء جبار والبئر جبار والمعدن جبار وفي الركاز الخمس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2498,
			"arabicnumber": 2498,
			"text": "أخبرنا يعقوب بن إبراهيم، حدثنا هشيم، أنبأنا منصور، وهشام، عن ابن سيرين، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ البئر جبار والعجماء جبار والمعدن جبار وفي الركاز الخمس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2499,
			"arabicnumber": 2499,
			"text": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا أحمد بن أبي شعيب، عن موسى بن أعين، عن عمرو بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال إلى رسول الله صلى الله عليه وسلم بعشور نحل له وسأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب كتب سفيان بن وهب إلى عمر بن الخطاب يسأله فكتب عمر إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشر نحله فاحم له سلبة ذلك وإلا فإنما هو ذباب غيث يأكله من شاء ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2500,
			"arabicnumber": 2500,
			"text": "أخبرنا عمران بن موسى، عن عبد الوارث، قال حدثنا أيوب، عن نافع، عن ابن عمر، قال فرض رسول الله صلى الله عليه وسلم زكاة رمضان على الحر والعبد والذكر والأنثى صاعا من تمر أو صاعا من شعير فعدل الناس به نصف صاع من بر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2501,
			"arabicnumber": 2501,
			"text": "أخبرنا قتيبة، قال حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، قال فرض رسول الله صلى الله عليه وسلم صدقة الفطر على الذكر والأنثى والحر والمملوك صاعا من تمر أو صاعا من شعير ‏.‏ قال فعدل الناس إلى نصف صاع من بر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2502,
			"arabicnumber": 2502,
			"text": "أخبرنا قتيبة، قال حدثنا مالك، عن نافع، عن ابن عمر، قال فرض رسول الله صلى الله عليه وسلم زكاة رمضان على كل صغير وكبير حر وعبد وذكر وأنثى صاعا من تمر أو صاعا من شعير ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2503,
			"arabicnumber": 2503,
			"text": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر من رمضان على الناس صاعا من تمر أو صاعا من شعير على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2504,
			"arabicnumber": 2504,
			"text": "أخبرنا يحيى بن محمد بن السكن، قال حدثنا محمد بن جهضم، قال حدثنا إسماعيل بن جعفر، عن عمر بن نافع، عن أبيه، عن ابن عمر، قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر صاعا من تمر أو صاعا من شعير على الحر والعبد والذكر والأنثى والصغير والكبير من المسلمين وأمر بها أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2505,
			"arabicnumber": 2505,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، قال فرض رسول الله صلى الله عليه وسلم صدقة الفطر على الصغير والكبير والذكر والأنثى والحر والعبد صاعا من تمر أو صاعا من شعير ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2506,
			"arabicnumber": 2506,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال أنبأنا شعبة، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن عمرو بن شرحبيل، عن قيس بن سعد بن عبادة، قال كنا نصوم عاشوراء ونؤدي زكاة الفطر فلما نزل رمضان ونزلت الزكاة لم نؤمر به ولم ننه عنه وكنا نفعله ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2507,
			"arabicnumber": 2507,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن سفيان، عن سلمة بن كهيل، عن القاسم بن مخيمرة، عن أبي عمار الهمداني، عن قيس بن سعد، قال أمرنا رسول الله صلى الله عليه وسلم بصدقة الفطر قبل أن تنزل الزكاة فلما نزلت الزكاة لم يأمرنا ولم ينهنا ونحن نفعله ‏.‏ قال أبو عبد الرحمن أبو عمار اسمه عريب بن حميد وعمرو بن شرحبيل يكنى أبا ميسرة وسلمة بن كهيل خالف الحكم في إسناده والحكم أثبت من سلمة بن كهيل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2508,
			"arabicnumber": 2508,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا حميد، عن الحسن، قال قال ابن عباس وهو أمير البصرة في آخر الشهر أخرجوا زكاة صومكم ‏.‏ فنظر الناس بعضهم إلى بعض فقال من ها هنا من أهل المدينة قوموا فعلموا إخوانكم فإنهم لا يعلمون إن هذه الزكاة فرضها رسول الله صلى الله عليه وسلم على كل ذكر وأنثى حر ومملوك صاعا من شعير أو تمر أو نصف صاع من قمح ‏.‏ فقاموا ‏.‏ خالفه هشام فقال عن محمد بن سيرين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2509,
			"arabicnumber": 2509,
			"text": "أخبرنا علي بن ميمون، عن مخلد، عن هشام، عن ابن سيرين، عن ابن عباس، قال ذكر في صدقة الفطر قال صاعا من بر أو صاعا من تمر أو صاعا من شعير أو صاعا من سلت ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2510,
			"arabicnumber": 2510,
			"text": "أخبرنا قتيبة، قال حدثنا حماد، عن أيوب، عن أبي رجاء، قال سمعت ابن عباس، يخطب على منبركم - يعني منبر البصرة - يقول صدقة الفطر صاع من طعام ‏.‏ قال أبو عبد الرحمن هذا أثبت الثلاثة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2511,
			"arabicnumber": 2511,
			"text": "أخبرنا محمد بن علي بن حرب، قال حدثنا محرز بن الوضاح، عن إسماعيل، - وهو ابن أمية - عن الحارث بن عبد الرحمن بن أبي ذباب، عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد الخدري، قال فرض رسول الله صلى الله عليه وسلم صدقة الفطر صاعا من شعير أو صاعا من تمر أو صاعا من أقط ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2512,
			"arabicnumber": 2512,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، عن سفيان، عن زيد بن أسلم، عن عياض بن عبد الله بن أبي سرح، عن أبي سعيد، قال كنا نخرج زكاة الفطر إذ كان فينا رسول الله صلى الله عليه وسلم صاعا من طعام أو صاعا من شعير أو صاعا من تمر أو صاعا من زبيب أو صاعا من أقط ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2513,
			"arabicnumber": 2513,
			"text": "أخبرنا هناد بن السري، عن وكيع، عن داود بن قيس، عن عياض بن عبد الله، عن أبي سعيد، قال كنا نخرج صدقة الفطر إذ كان فينا رسول الله صلى الله عليه وسلم صاعا من طعام أو صاعا من تمر أو صاعا من شعير أو صاعا من أقط فلم نزل كذلك حتى قدم معاوية من الشام وكان فيما علم الناس أنه قال ما أرى مدين من سمراء الشام إلا تعدل صاعا من هذا ‏.‏ قال فأخذ الناس بذلك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2514,
			"arabicnumber": 2514,
			"text": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن ابن عجلان، قال سمعت عياض بن عبد الله، يخبر عن أبي سعيد الخدري، قال لم نخرج على عهد رسول الله صلى الله عليه وسلم إلا صاعا من تمر أو صاعا من شعير أو صاعا من زبيب أو صاعا من دقيق أو صاعا من أقط أو صاعا من سلت - ثم شك سفيان - فقال دقيق أو سلت ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2515,
			"arabicnumber": 2515,
			"text": "أخبرنا علي بن حجر، قال حدثنا يزيد بن هارون، قال حدثنا حميد، عن الحسن، أن ابن عباس، خطب بالبصرة فقال أدوا زكاة صومكم ‏.‏ فجعل الناس ينظر بعضهم إلى بعض فقال من ها هنا من أهل المدينة قوموا إلى إخوانكم فعلموهم فإنهم لا يعلمون إن رسول الله صلى الله عليه وسلم فرض صدقة الفطر على الصغير والكبير والحر والعبد والذكر والأنثى نصف صاع بر أو صاعا من تمر أو شعير ‏.‏ قال الحسن فقال علي أما إذا أوسع الله فأوسعوا أعطوا صاعا من بر أو غيره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2516,
			"arabicnumber": 2516,
			"text": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، قال حدثنا عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، قال كان الناس يخرجون عن صدقة الفطر، في عهد النبي صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2517,
			"arabicnumber": 2517,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا داود بن قيس، قال حدثنا عياض، عن أبي سعيد الخدري، قال كنا نخرج في عهد رسول الله صلى الله عليه وسلم صاعا من شعير أو تمر أو زبيب أو أقط فلم نزل كذلك حتى كان في عهد معاوية قال ما أرى مدين من سمراء الشام إلا تعدل صاعا من شعير ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2518,
			"arabicnumber": 2518,
			"text": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن يزيد، عن عبيد الله بن عبد الله بن عثمان، أن عياض بن عبد الله بن سعد، حدثه أن أبا سعيد الخدري قال كنا نخرج في عهد رسول الله صلى الله عليه وسلم صاعا من تمر أو صاعا من شعير أو صاعا من أقط لا نخرج غيره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2519,
			"arabicnumber": 2519,
			"text": "أخبرنا عمرو بن زرارة، قال أنبأنا القاسم، - وهو ابن مالك - عن الجعيد، سمعت السائب بن يزيد، قال كان الصاع على عهد رسول الله صلى الله عليه وسلم مدا وثلثا بمدكم اليوم وقد زيد فيه ‏.‏ قال أبو عبد الرحمن وحدثنيه زياد بن أيوب ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2520,
			"arabicnumber": 2520,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا سفيان، عن حنظلة، عن طاوس، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ المكيال مكيال أهل المدينة والوزن وزن أهل مكة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2521,
			"arabicnumber": 2521,
			"text": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن، حدثنا زهير، حدثنا موسى، ح قال وأنبأنا محمد بن عبد الله بن بزيع، قال حدثنا الفضيل، قال حدثنا موسى، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أمر بصدقة الفطر أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏ قال ابن بزيع بزكاة الفطر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2522,
			"arabicnumber": 2522,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا وكيع، قال حدثنا زكريا بن إسحاق، - وكان ثقة - عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذ بن جبل إلى اليمن فقال ‏ \"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوك فأعلمهم أن الله عز وجل افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوك فأعلمهم أن الله عز وجل قد افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم فتوضع في فقرائهم فإن هم أطاعوك لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله عز وجل حجاب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2523,
			"arabicnumber": 2523,
			"text": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به عن رسول الله صلى الله عليه وسلم وقال ‏ \"‏ قال رجل لأتصدقن بصدقة فخرج بصدقته فوضعها في يد سارق فأصبحوا يتحدثون تصدق على سارق فقال اللهم لك الحمد على سارق لأتصدقن بصدقة فخرج بصدقته فوضعها في يد زانية فأصبحوا يتحدثون تصدق الليلة على زانية فقال اللهم لك الحمد على زانية لأتصدقن بصدقة فخرج بصدقته فوضعها في يد غني فأصبحوا يتحدثون تصدق على غني قال اللهم لك الحمد على زانية وعلى سارق وعلى غني فأتي فقيل له أما صدقتك فقد تقبلت أما الزانية فلعلها أن تستعف به من زناها ولعل السارق أن يستعف به عن سرقته ولعل الغني أن يعتبر فينفق مما أعطاه الله عز وجل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2524,
			"arabicnumber": 2524,
			"text": "أخبرنا الحسين بن محمد الذارع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا شعبة، ‏.‏ قال وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا شعبة، - واللفظ لبشر - عن قتادة، عن أبي المليح، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الله عز وجل لا يقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2525,
			"arabicnumber": 2525,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن سعيد بن أبي سعيد، عن سعيد بن يسار، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما تصدق أحد بصدقة من طيب ولا يقبل الله عز وجل إلا الطيب إلا أخذها الرحمن عز وجل بيمينه وإن كانت تمرة فتربو في كف الرحمن حتى تكون أعظم من الجبل كما يربي أحدكم فلوه أو فصيله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2526,
			"arabicnumber": 2526,
			"text": "أخبرنا عبد الوهاب بن عبد الحكم، عن حجاج، قال ابن جريج أخبرني عثمان بن أبي سليمان، عن علي الأزدي، عن عبيد بن عمير، عن عبد الله بن حبشي الخثعمي، أن النبي صلى الله عليه وسلم سئل أى الأعمال أفضل قال ‏\"‏ إيمان لا شك فيه وجهاد لا غلول فيه وحجة مبرورة ‏\"‏ ‏.‏ قيل فأى الصلاة أفضل قال ‏\"‏ طول القنوت ‏\"‏ ‏.‏ قيل فأى الصدقة أفضل قال ‏\"‏ جهد المقل ‏\"‏ ‏.‏ قيل فأى الهجرة أفضل قال ‏\"‏ من هجر ما حرم الله عز وجل ‏\"‏ ‏.‏ قيل فأى الجهاد أفضل قال ‏\"‏ من جاهد المشركين بماله ونفسه ‏\"‏ ‏.‏ قيل فأى القتل أشرف قال ‏\"‏ من أهريق دمه وعقر جواده ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2527,
			"arabicnumber": 2527,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن عجلان، عن سعيد بن أبي سعيد، والقعقاع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سبق درهم مائة ألف درهم ‏\"‏ ‏.‏ قالوا وكيف قال ‏\"‏ كان لرجل درهمان تصدق بأحدهما وانطلق رجل إلى عرض ماله فأخذ منه مائة ألف درهم فتصدق بها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2528,
			"arabicnumber": 2528,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا صفوان بن عيسى، قال حدثنا ابن عجلان، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سبق درهم مائة ألف ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف قال ‏\"‏ رجل له درهمان فأخذ أحدهما فتصدق به ورجل له مال كثير فأخذ من عرض ماله مائة ألف فتصدق بها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2529,
			"arabicnumber": 2529,
			"text": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن الحسين، عن منصور، عن شقيق، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يأمرنا بالصدقة فما يجد أحدنا شيئا يتصدق به حتى ينطلق إلى السوق فيحمل على ظهره فيجيء بالمد فيعطيه رسول الله صلى الله عليه وسلم إني لأعرف اليوم رجلا له مائة ألف ما كان له يومئذ درهم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2530,
			"arabicnumber": 2530,
			"text": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال لما أمرنا رسول الله صلى الله عليه وسلم بالصدقة فتصدق أبو عقيل بنصف صاع وجاء إنسان بشىء أكثر منه فقال المنافقون إن الله عز وجل لغني عن صدقة هذا وما فعل هذا الآخر إلا رياء فنزلت ‏{‏ الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم ‏}‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2531,
			"arabicnumber": 2531,
			"text": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، قال أخبرني سعيد، وعروة، سمعا حكيم بن حزام، يقول سألت رسول الله صلى الله عليه وسلم فأعطاني ثم سألته فأعطاني ثم سألته فأعطاني ثم قال ‏ \"‏ إن هذا المال خضرة حلوة فمن أخذه بطيب نفس بورك له فيه ومن أخذه بإشراف نفس لم يبارك له فيه وكان كالذي يأكل ولا يشبع واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2532,
			"arabicnumber": 2532,
			"text": "أخبرنا يوسف بن عيسى، قال أنبأنا الفضل بن موسى، قال حدثنا يزيد، - وهو ابن زياد بن أبي الجعد - عن جامع بن شداد، عن طارق المحاربي، قال قدمنا المدينة فإذا رسول الله صلى الله عليه وسلم قائم على المنبر يخطب الناس وهو يقول ‏ \"‏ يد المعطي العليا وابدأ بمن تعول أمك وأباك وأختك وأخاك ثم أدناك أدناك ‏\"‏ ‏.‏ مختصر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2533,
			"arabicnumber": 2533,
			"text": "أخبرنا قتيبة، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال وهو يذكر الصدقة والتعفف عن المسألة ‏ \"‏ اليد العليا خير من اليد السفلى واليد العليا المنفقة واليد السفلى السائلة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2534,
			"arabicnumber": 2534,
			"text": "أخبرنا قتيبة، قال حدثنا بكر، عن ابن عجلان، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ خير الصدقة ما كان عن ظهر غنى واليد العليا خير من اليد السفلى وابدأ بمن تعول ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2535,
			"arabicnumber": 2535,
			"text": "أخبرنا عمرو بن علي، ومحمد بن المثنى، قالا حدثنا يحيى، عن ابن عجلان، عن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تصدقوا ‏\"‏ ‏.‏ فقال رجل يا رسول الله عندي دينار ‏.‏ قال ‏\"‏ تصدق به على نفسك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على زوجتك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على ولدك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ تصدق به على خادمك ‏\"‏ ‏.‏ قال عندي آخر ‏.‏ قال ‏\"‏ أنت أبصر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2536,
			"arabicnumber": 2536,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا ابن عجلان، عن عياض، عن أبي سعيد، أن رجلا، دخل المسجد يوم الجمعة ورسول الله صلى الله عليه وسلم يخطب فقال ‏\"‏ صل ركعتين ‏\"‏ ‏.‏ ثم جاء الجمعة الثانية والنبي صلى الله عليه وسلم يخطب فقال ‏\"‏ صل ركعتين ‏\"‏ ‏.‏ ثم جاء الجمعة الثالثة فقال ‏\"‏ صل ركعتين ‏\"‏ ‏.‏ ثم قال ‏\"‏ تصدقوا ‏\"‏ ‏.‏ فتصدقوا فأعطاه ثوبين ثم قال ‏\"‏ تصدقوا ‏\"‏ ‏.‏ فطرح أحد ثوبيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تروا إلى هذا إنه دخل المسجد بهيئة بذة فرجوت أن تفطنوا له فتصدقوا عليه فلم تفعلوا فقلت تصدقوا ‏.‏ فتصدقتم فأعطيته ثوبين ثم قلت تصدقوا ‏.‏ فطرح أحد ثوبيه خذ ثوبك ‏\"‏ ‏.‏ وانتهره ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2537,
			"arabicnumber": 2537,
			"text": "أخبرنا قتيبة، قال حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت عميرا، مولى آبي اللحم قال أمرني مولاى أن أقدد، لحما فجاء مسكين فأطعمته منه فعلم بذلك مولاى فضربني فأتيت رسول الله صلى الله عليه وسلم فدعاه فقال ‏\"‏ لم ضربته ‏\"‏ ‏.‏ فقال يطعم طعامي بغير أن آمره وقال مرة أخرى بغير أمري قال ‏\"‏ الأجر بينكما ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2538,
			"arabicnumber": 2538,
			"text": "أخبرني محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني ابن أبي بردة، قال سمعت أبي يحدث، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل مسلم صدقة ‏\"‏ ‏.‏ قيل أرأيت إن لم يجدها قال ‏\"‏ يعتمل بيده فينفع نفسه ويتصدق ‏\"‏ ‏.‏ قيل أرأيت إن لم يفعل قال ‏\"‏ يعين ذا الحاجة الملهوف ‏\"‏ ‏.‏ قيل فإن لم يفعل قال ‏\"‏ يأمر بالخير ‏\"‏ ‏.‏ قيل أرأيت إن لم يفعل قال ‏\"‏ يمسك عن الشر فإنها صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2539,
			"arabicnumber": 2539,
			"text": "أخبرنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، يحدث عن عائشة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا تصدقت المرأة من بيت زوجها كان لها أجر وللزوج مثل ذلك وللخازن مثل ذلك ولا ينقص كل واحد منهما من أجر صاحبه شيئا للزوج بما كسب ولها بما أنفقت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2540,
			"arabicnumber": 2540,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏ \"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏ مختصر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2541,
			"arabicnumber": 2541,
			"text": "أخبرنا أبو داود، قال حدثنا يحيى بن حماد، قال أنبأنا أبو عوانة، عن فراس، عن عامر، عن مسروق، عن عائشة، رضى الله عنها أن أزواج، النبي صلى الله عليه وسلم اجتمعن عنده فقلن أيتنا بك أسرع لحوقا فقال ‏ \"‏ أطولكن يدا ‏\"‏ ‏.‏ فأخذن قصبة فجعلن يذرعنها فكانت سودة أسرعهن به لحوقا فكانت أطولهن يدا فكان ذلك من كثرة الصدقة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2542,
			"arabicnumber": 2542,
			"text": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رجل يا رسول الله أى الصدقة أفضل قال ‏ \"‏ أن تصدق وأنت صحيح شحيح تأمل العيش وتخشى الفقر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2543,
			"arabicnumber": 2543,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا عمرو بن عثمان، قال سمعت موسى بن طلحة، أن حكيم بن حزام، حدثه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أفضل الصدقة ما كان عن ظهر غنى واليد العليا خير من اليد السفلى وابدأ بمن تعول ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2544,
			"arabicnumber": 2544,
			"text": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، عن ابن وهب، قال أنبأنا يونس، عن ابن شهاب، قال حدثنا سعيد بن المسيب، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ خير الصدقة ما كان عن ظهر غنى وابدأ بمن تعول ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2545,
			"arabicnumber": 2545,
			"text": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن عدي بن ثابت، قال سمعت عبد الله بن يزيد الأنصاري، يحدث عن أبي مسعود، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا أنفق الرجل على أهله وهو يحتسبها كانت له صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2546,
			"arabicnumber": 2546,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن أبي الزبير، عن جابر، قال أعتق رجل من بني عذرة عبدا له عن دبر، فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألك مال غيره ‏\"‏ ‏.‏ قال لا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يشتريه مني ‏\"‏ ‏.‏ فاشتراه نعيم بن عبد الله العدوي بثمانمائة درهم فجاء بها رسول الله صلى الله عليه وسلم فدفعها إليه ثم قال ‏\"‏ ابدأ بنفسك فتصدق عليها فإن فضل شىء فلأهلك فإن فضل شىء عن أهلك فلذي قرابتك فإن فضل عن ذي قرابتك شىء فهكذا وهكذا يقول بين يديك وعن يمينك وعن شمالك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2547,
			"arabicnumber": 2547,
			"text": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن ابن جريج، عن الحسن بن مسلم، عن طاوس، قال سمعت أبا هريرة، ثم قال حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن مثل المنفق المتصدق والبخيل كمثل رجلين عليهما جبتان أو جنتان من حديد من لدن ثديهما إلى تراقيهما فإذا أراد المنفق أن ينفق اتسعت عليه الدرع أو مرت حتى تجن بنانه وتعفو أثره وإذا أراد البخيل أن ينفق قلصت ولزمت كل حلقة موضعها حتى أخذته بترقوته أو برقبته ‏\"‏ ‏.‏ يقول أبو هريرة أشهد أنه رأى رسول الله صلى الله عليه وسلم يوسعها فلا تتسع ‏.‏ قال طاوس سمعت أبا هريرة يشير بيده وهو يوسعها ولا تتوسع ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2548,
			"arabicnumber": 2548,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا وهيب، قال حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل البخيل والمتصدق مثل رجلين عليهما جنتان من حديد قد اضطرت أيديهما إلى تراقيهما فكلما هم المتصدق بصدقة اتسعت عليه حتى تعفي أثره وكلما هم البخيل بصدقة تقبضت كل حلقة إلى صاحبتها وتقلصت عليه وانضمت يداه إلى تراقيه ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فيجتهد أن يوسعها فلا تتسع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2549,
			"arabicnumber": 2549,
			"text": "أخبرني محمد بن عبد الله بن عبد الحكم، عن شعيب، حدثني الليث، قال حدثنا خالد، عن ابن أبي هلال، عن أمية بن هند، عن أبي أمامة بن سهل بن حنيف، قال كنا يوما في المسجد جلوسا ونفر من المهاجرين والأنصار فأرسلنا رجلا إلى عائشة ليستأذن فدخلنا عليها قالت دخل على سائل مرة وعندي رسول الله صلى الله عليه وسلم فأمرت له بشىء ثم دعوت به فنظرت إليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما تريدين أن لا يدخل بيتك شىء ولا يخرج إلا بعلمك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ مهلا يا عائشة لا تحصي فيحصي الله عز وجل عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2550,
			"arabicnumber": 2550,
			"text": "أخبرنا محمد بن آدم، عن عبدة، عن هشام بن عروة، عن فاطمة، عن أسماء بنت أبي بكر، أن النبي صلى الله عليه وسلم قال لها ‏ \"‏ لا تحصي فيحصي الله عز وجل عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2551,
			"arabicnumber": 2551,
			"text": "أخبرنا الحسن بن محمد، عن حجاج، قال قال ابن جريج أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، عن أسماء بنت أبي بكر، أنها جاءت النبي صلى الله عليه وسلم فقالت يا نبي الله ليس لي شىء إلا ما أدخل على الزبير فهل على جناح في أن أرضخ مما يدخل على فقال ‏ \"‏ ارضخي ما استطعت ولا توكي فيوكي الله عز وجل عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2552,
			"arabicnumber": 2552,
			"text": "أخبرنا نصر بن علي، عن خالد، حدثنا شعبة، عن المحل، عن عدي بن حاتم، عن النبي صلى الله عليه وسلم قال ‏ \"‏ اتقوا النار ولو بشق تمرة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2553,
			"arabicnumber": 2553,
			"text": "أنبأنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، أن عمرو بن مرة، حدثهم عن خيثمة، عن عدي بن حاتم، قال ذكر رسول الله صلى الله عليه وسلم النار فأشاح بوجهه وتعوذ منها ذكر شعبة أنه فعله ثلاث مرات - ثم قال ‏ \"‏ اتقوا النار ولو بشق التمرة فإن لم تجدوا فبكلمة طيبة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2554,
			"arabicnumber": 2554,
			"text": "أخبرنا أزهر بن جميل، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، قال وذكر عون بن أبي جحيفة قال سمعت المنذر بن جرير، يحدث عن أبيه، قال كنا عند رسول الله صلى الله عليه وسلم في صدر النهار فجاء قوم عراة حفاة متقلدي السيوف عامتهم من مضر بل كلهم من مضر فتغير وجه رسول الله صلى الله عليه وسلم لما رأى بهم من الفاقة فدخل ثم خرج فأمر بلالا فأذن فأقام الصلاة فصلى ثم خطب فقال ‏\"‏ ‏{‏ يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا ‏}‏ و ‏{‏ اتقوا الله ولتنظر نفس ما قدمت لغد ‏}‏ تصدق رجل من ديناره من درهمه من ثوبه من صاع بره من صاع تمره - حتى قال - ولو بشق تمرة ‏\"‏ ‏.‏ فجاء رجل من الأنصار بصرة كادت كفه تعجز عنها بل قد عجزت ثم تتابع الناس حتى رأيت كومين من طعام وثياب حتى رأيت وجه رسول الله صلى الله عليه وسلم يتهلل كأنه مذهبة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من سن في الإسلام سنة حسنة فله أجرها وأجر من عمل بها من غير أن ينقص من أجورهم شيئا ومن سن في الإسلام سنة سيئة فعليه وزرها ووزر من عمل بها من غير أن ينقص من أوزارهم شيئا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2555,
			"arabicnumber": 2555,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن معبد بن خالد، عن حارثة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ تصدقوا فإنه سيأتي عليكم زمان يمشي الرجل بصدقته فيقول الذي يعطاها لو جئت بها بالأمس قبلتها فأما اليوم فلا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2556,
			"arabicnumber": 2556,
			"text": "أخبرنا محمد بن بشار، قال حدثنا يحيى، قال حدثنا سفيان، قال أخبرني أبو بردة بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ اشفعوا تشفعوا ويقضي الله عز وجل على لسان نبيه ما شاء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "أخبرنا هارون بن سعيد، قال أنبأنا سفيان، عن عمرو، عن ابن منبه، عن أخيه، عن معاوية بن أبي سفيان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الرجل ليسألني الشىء فأمنعه حتى تشفعوا فيه فتؤجروا ‏\"‏ ‏.‏ وإن رسول الله صلى الله عليه وسلم قال ‏\"‏ اشفعوا تؤجروا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2558,
			"arabicnumber": 2558,
			"text": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم بن الحارث التيمي، عن ابن جابر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن من الغيرة ما يحب الله عز وجل ومنها ما يبغض الله عز وجل ومن الخيلاء ما يحب الله عز وجل ومنها ما يبغض الله عز وجل فأما الغيرة التي يحب الله عز وجل فالغيرة في الريبة وأما الغيرة التي يبغض الله عز وجل فالغيرة في غير ريبة والاختيال الذي يحب الله عز وجل اختيال الرجل بنفسه عند القتال وعند الصدقة والاختيال الذي يبغض الله عز وجل الخيلاء في الباطل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2559,
			"arabicnumber": 2559,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا همام، عن قتادة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كلوا وتصدقوا والبسوا في غير إسراف ولا مخيلة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2560,
			"arabicnumber": 2560,
			"text": "أخبرني عبد الله بن الهيثم بن عثمان، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا سفيان، عن بريد بن أبي بردة، عن جده، عن أبي موسى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏ ‏.‏ وقال ‏\"‏ الخازن الأمين الذي يعطي ما أمر به طيبا بها نفسه أحد المتصدقين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2561,
			"arabicnumber": 2561,
			"text": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن معاوية بن صالح، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الجاهر بالقرآن كالجاهر بالصدقة والمسر بالقرآن كالمسر بالصدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2562,
			"arabicnumber": 2562,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يزيد بن زريع، قال حدثنا عمر بن محمد، عن عبد الله بن يسار، عن سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاثة لا ينظر الله عز وجل إليهم يوم القيامة العاق لوالديه والمرأة المترجلة والديوث وثلاثة لا يدخلون الجنة العاق لوالديه والمدمن على الخمر والمنان بما أعطى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2563,
			"arabicnumber": 2563,
			"text": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، عن علي بن المدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقرأها رسول الله صلى الله عليه وسلم فقال أبو ذر خابوا وخسروا خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنفق سلعته بالحلف الكاذب والمنان عطاءه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2564,
			"arabicnumber": 2564,
			"text": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، قال سمعت سليمان، - وهو الأعمش - عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم المنان بما أعطى والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2565,
			"arabicnumber": 2565,
			"text": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح وأنبأنا قتيبة بن سعيد، عن مالك، عن زيد بن أسلم، عن ابن بجيد الأنصاري، عن جدته، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ردوا السائل ولو بظلف ‏\"‏ ‏.‏ في حديث هارون محرق ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2566,
			"arabicnumber": 2566,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت بهز بن حكيم، يحدث عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يأتي رجل مولاه يسأله من فضل عنده فيمنعه إياه إلا دعي له يوم القيامة شجاع أقرع يتلمظ فضله الذي منع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2567,
			"arabicnumber": 2567,
			"text": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن الأعمش، عن مجاهد، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من استعاذ بالله فأعيذوه ومن سألكم بالله فأعطوه ومن استجار بالله فأجيروه ومن آتى إليكم معروفا فكافئوه فإن لم تجدوا فادعوا له حتى تعلموا أن قد كافأتموه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2568,
			"arabicnumber": 2568,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت بهز بن حكيم، يحدث عن أبيه، عن جده، قال قلت يا نبي الله ما أتيتك حتى حلفت أكثر من عددهن - لأصابع يديه - ألا آتيك ولا آتي دينك وإني كنت امرأ لا أعقل شيئا إلا ما علمني الله ورسوله وإني أسألك بوجه الله عز وجل بما بعثك ربك إلينا قال ‏\"‏ بالإسلام ‏\"‏ ‏.‏ قال قلت وما آيات الإسلام قال ‏\"‏ أن تقول أسلمت وجهي إلى الله عز وجل وتخليت وتقيم الصلاة وتؤتي الزكاة كل مسلم على مسلم محرم أخوان نصيران لا يقبل الله عز وجل من مشرك بعد ما أسلم عملا أو يفارق المشركين إلى المسلمين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2569,
			"arabicnumber": 2569,
			"text": "أخبرنا محمد بن رافع، قال حدثنا ابن أبي فديك، قال أنبأنا ابن أبي ذئب، عن سعيد بن خالد القارظي، عن إسماعيل بن عبد الرحمن، عن عطاء بن يسار، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الناس منزلا ‏\"‏ ‏.‏ قلنا بلى يا رسول الله ‏.‏ قال ‏\"‏ رجل آخذ برأس فرسه في سبيل الله عز وجل حتى يموت أو يقتل وأخبركم بالذي يليه ‏\"‏ ‏.‏ قلنا نعم يا رسول الله ‏.‏ قال ‏\"‏ رجل معتزل في شعب يقيم الصلاة ويؤتي الزكاة ويعتزل شرور الناس وأخبركم بشر الناس ‏\"‏ ‏.‏ قلنا نعم يا رسول الله ‏.‏ قال ‏\"‏ الذي يسأل بالله عز وجل ولا يعطي به ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2570,
			"arabicnumber": 2570,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، قال سمعت ربعيا، يحدث عن زيد بن ظبيان، رفعه إلى أبي ذر عن النبي صلى الله عليه وسلم قال ‏ \"‏ ثلاثة يحبهم الله عز وجل وثلاثة يبغضهم الله عز وجل أما الذين يحبهم الله عز وجل فرجل أتى قوما فسألهم بالله عز وجل ولم يسألهم بقرابة بينه وبينهم فمنعوه فتخلفه رجل بأعقابهم فأعطاه سرا لا يعلم بعطيته إلا الله عز وجل والذي أعطاه وقوم ساروا ليلتهم حتى إذا كان النوم أحب إليهم مما يعدل به نزلوا فوضعوا رءوسهم فقام يتملقني ويتلو آياتي ورجل كان في سرية فلقوا العدو فهزموا فأقبل بصدره حتى يقتل أو يفتح الله له والثلاثة الذين يبغضهم الله عز وجل الشيخ الزاني والفقير المختال والغني الظلوم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2571,
			"arabicnumber": 2571,
			"text": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، قال حدثنا شريك، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس المسكين الذي ترده التمرة والتمرتان واللقمة واللقمتان إن المسكين المتعفف اقرءوا إن شئتم ‏{‏ لا يسألون الناس إلحافا ‏}‏ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2572,
			"arabicnumber": 2572,
			"text": "أخبرنا قتيبة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس المسكين بهذا الطواف الذي يطوف على الناس ترده اللقمة واللقمتان والتمرة والتمرتان ‏\"‏ ‏.‏ قالوا فما المسكين قال ‏\"‏ الذي لا يجد غنى يغنيه ولا يفطن له فيتصدق عليه ولا يقوم فيسأل الناس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 2573,
			"arabicnumber": 2573,
			"text": "أخبرنا نصر بن علي، قال حدثنا عبد الأعلى، قال حدثنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس المسكين الذي ترده الأكلة والأكلتان والتمرة والتمرتان ‏\"‏ ‏.‏ قالوا فما المسكين يا رسول الله قال ‏\"‏ الذي لا يجد غنى ولا يعلم الناس حاجته فيتصدق عليه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 2574,
			"arabicnumber": 2574,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن سعيد بن أبي سعيد، عن عبد الرحمن بن بجيد، عن جدته أم بجيد، وكانت، ممن بايعت رسول الله صلى الله عليه وسلم أنها قالت لرسول الله صلى الله عليه وسلم إن المسكين ليقوم على بابي فما أجد له شيئا أعطيه إياه فقال لها رسول الله صلى الله عليه وسلم ‏ \"‏ إن لم تجدي شيئا تعطينه إياه إلا ظلفا محرقا فادفعيه إليه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 2575,
			"arabicnumber": 2575,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن ابن عجلان، قال سمعت أبي يحدث، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة الشيخ الزاني والعائل المزهو والإمام الكذاب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 2576,
			"arabicnumber": 2576,
			"text": "أخبرنا أبو داود، قال حدثنا عارم، قال حدثنا حماد، قال حدثنا عبيد الله بن عمر، عن سعيد المقبري، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أربعة يبغضهم الله عز وجل البياع الحلاف والفقير المختال والشيخ الزاني والإمام الجائر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 2577,
			"arabicnumber": 2577,
			"text": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن مسلمة، قال حدثنا مالك، عن ثور بن زيد الديلي، عن أبي الغيث، عن أبي هريرة، قال رسول الله صلى الله عليه وسلم ‏ \"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله عز وجل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 2578,
			"arabicnumber": 2578,
			"text": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سعيد بن مسروق، عن عبد الرحمن بن أبي نعم، عن أبي سعيد الخدري، قال بعث علي وهو باليمن بذهيبة بتربتها إلى رسول الله صلى الله عليه وسلم فقسمها رسول الله صلى الله عليه وسلم بين أربعة نفر الأقرع بن حابس الحنظلي وعيينة بن بدر الفزاري وعلقمة بن علاثة العامري ثم أحد بني كلاب وزيد الطائي ثم أحد بني نبهان فغضبت قريش وقال مرة أخرى صناديد قريش فقالوا تعطي صناديد نجد وتدعنا ‏.‏ قال ‏\"‏ إنما فعلت ذلك لأتألفهم ‏\"‏ ‏.‏ فجاء رجل كث اللحية مشرف الوجنتين غائر العينين ناتئ الجبين محلوق الرأس فقال اتق الله يا محمد ‏.‏ قال ‏\"‏ فمن يطع الله عز وجل إن عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ ‏.‏ ثم أدبر الرجل فاستأذن رجل من القوم في قتله يرون أنه خالد بن الوليد فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم يقتلون أهل الإسلام ويدعون أهل الأوثان يمرقون من الإسلام كما يمرق السهم من الرمية لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 2579,
			"arabicnumber": 2579,
			"text": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، عن هارون بن رئاب، قال حدثني كنانة بن نعيم، ح وأخبرنا علي بن حجر، - واللفظ له - قال حدثنا إسماعيل، عن أيوب، عن هارون، عن كنانة بن نعيم، عن قبيصة بن مخارق، قال تحملت حمالة فأتيت النبي صلى الله عليه وسلم فسألته فيها فقال ‏ \"‏ إن المسألة لا تحل إلا لثلاثة رجل تحمل بحمالة بين قوم فسأل فيها حتى يؤديها ثم يمسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 2580,
			"arabicnumber": 2580,
			"text": "أخبرنا محمد بن النضر بن مساور، قال حدثنا حماد، عن هارون بن رئاب، قال حدثني كنانة بن نعيم، عن قبيصة بن مخارق، قال تحملت حمالة فأتيت رسول الله صلى الله عليه وسلم أسأله فيها فقال ‏\"‏ أقم يا قبيصة حتى تأتينا الصدقة فنأمر لك ‏\"‏ ‏.‏ قال ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ يا قبيصة إن الصدقة لا تحل إلا لأحد ثلاثة رجل تحمل حمالة فحلت له المسألة حتى يصيب قواما من عيش أو سدادا من عيش ورجل أصابته جائحة فاجتاحت ماله فحلت له المسألة حتى يصيبها ثم يمسك ورجل أصابته فاقة حتى يشهد ثلاثة من ذوي الحجا من قومه قد أصابت فلانا فاقة فحلت له المسألة حتى يصيب قواما من عيش أو سدادا من عيش فما سوى هذا من المسألة يا قبيصة سحت يأكلها صاحبها سحتا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 2581,
			"arabicnumber": 2581,
			"text": "أخبرني زياد بن أيوب، قال حدثنا إسماعيل ابن علية، قال أخبرني هشام، قال حدثني يحيى بن أبي كثير، قال حدثني هلال، عن عطاء بن يسار، عن أبي سعيد الخدري، قال جلس رسول الله صلى الله عليه وسلم على المنبر وجلسنا حوله فقال ‏\"‏ إنما أخاف عليكم من بعدي ما يفتح لكم من زهرة ‏\"‏ ‏.‏ وذكر الدنيا وزينتها فقال رجل أويأتي الخير بالشر فسكت عنه رسول الله صلى الله عليه وسلم فقيل له ما شأنك تكلم رسول الله صلى الله عليه وسلم ولا يكلمك ‏.‏ قال ورأينا أنه ينزل عليه فأفاق يمسح الرحضاء وقال ‏\"‏ أشاهد السائل إنه لا يأتي الخير بالشر وإن مما ينبت الربيع يقتل أو يلم إلا آكلة الخضر فإنها أكلت حتى إذا امتدت خاصرتاها استقبلت عين الشمس فثلطت ثم بالت ثم رتعت وإن هذا المال خضرة حلوة ونعم صاحب المسلم هو إن أعطى منه اليتيم والمسكين وابن السبيل وإن الذي يأخذه بغير حقه كالذي يأكل ولا يشبع ويكون عليه شهيدا يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 2582,
			"arabicnumber": 2582,
			"text": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن عون، عن حفصة، عن أم الرائح، عن سلمان بن عامر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الصدقة على المسكين صدقة وعلى ذي الرحم اثنتان صدقة وصلة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 2583,
			"arabicnumber": 2583,
			"text": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، عن سليمان، عن أبي وائل، عن عمرو بن الحارث، عن زينب، امرأة عبد الله قالت قال رسول الله صلى الله عليه وسلم للنساء ‏\"‏ تصدقن ولو من حليكن ‏\"‏ ‏.‏ قالت وكان عبد الله خفيف ذات اليد فقالت له أيسعني أن أضع صدقتي فيك وفي بني أخ لي يتامى فقال عبد الله سلي عن ذلك رسول الله صلى الله عليه وسلم ‏.‏ قالت فأتيت النبي صلى الله عليه وسلم فإذا على بابه امرأة من الأنصار يقال لها زينب تسأل عما أسأل عنه فخرج إلينا بلال فقلنا له انطلق إلى رسول الله صلى الله عليه وسلم فسله عن ذلك ولا تخبره من نحن ‏.‏ فانطلق إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ من هما ‏\"‏ ‏.‏ قال زينب ‏.‏ قال ‏\"‏ أى الزيانب ‏\"‏ ‏.‏ قال زينب امرأة عبد الله وزينب الأنصارية قال ‏\"‏ نعم لهما أجران أجر القرابة وأجر الصدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 2584,
			"arabicnumber": 2584,
			"text": "أخبرنا أبو داود، قال حدثنا يعقوب بن إبراهيم، قال حدثنا أبي، عن صالح، عن ابن شهاب، أن أبا عبيد، مولى عبد الرحمن بن أزهر أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ لأن يحتزم أحدكم حزمة حطب على ظهره فيبيعها خير من أن يسأل رجلا فيعطيه أو يمنعه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 2585,
			"arabicnumber": 2585,
			"text": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث بن سعد، عن عبيد الله بن أبي جعفر، قال سمعت حمزة بن عبد الله، يقول سمعت عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما يزال الرجل يسأل حتى يأتي يوم القيامة ليس في وجهه مزعة من لحم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 2586,
			"arabicnumber": 2586,
			"text": "أخبرنا محمد بن عثمان بن أبي صفوان الثقفي، قال حدثنا أمية بن خالد، قال حدثنا شعبة، عن بسطام بن مسلم، عن عبد الله بن خليفة، عن عائذ بن عمرو، أن رجلا، أتى النبي صلى الله عليه وسلم فسأله فأعطاه فلما وضع رجله على أسكفة الباب قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو تعلمون ما في المسألة ما مشى أحد إلى أحد يسأله شيئا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 2587,
			"arabicnumber": 2587,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن جعفر بن ربيعة، عن بكر بن سوادة، عن مسلم بن مخشي، عن ابن الفراسي، أن الفراسي، قال لرسول الله صلى الله عليه وسلم أسأل يا رسول الله قال ‏ \"‏ لا وإن كنت سائلا لا بد فاسأل الصالحين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 2588,
			"arabicnumber": 2588,
			"text": "أخبرنا قتيبة، عن مالك، عن ابن شهاب، عن عطاء بن يزيد، عن أبي سعيد الخدري، أن ناسا، من الأنصار سألوا رسول الله صلى الله عليه وسلم فأعطاهم ثم سألوه فأعطاهم حتى إذا نفد ما عنده قال ‏ \"‏ ما يكون عندي من خير فلن أدخره عنكم ومن يستعفف يعفه الله عز وجل ومن يصبر يصبره الله وما أعطي أحد عطاء هو خير وأوسع من الصبر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 2589,
			"arabicnumber": 2589,
			"text": "أخبرنا علي بن شعيب، قال أنبأنا معن، قال أنبأنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ والذي نفسي بيده لأن يأخذ أحدكم حبله فيحتطب على ظهره خير له من أن يأتي رجلا أعطاه الله عز وجل من فضله فيسأله أعطاه أو منعه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 2590,
			"arabicnumber": 2590,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا ابن أبي ذئب، حدثني محمد بن قيس، عن عبد الرحمن بن يزيد بن معاوية، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يضمن لي واحدة وله الجنة ‏\"‏ ‏.‏ قال يحيى ها هنا كلمة معناها أن لا يسأل الناس شيئا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 2591,
			"arabicnumber": 2591,
			"text": "أخبرنا هشام بن عمار، قال حدثنا يحيى، - وهو ابن حمزة - قال حدثني الأوزاعي، عن هارون بن رئاب، أنه حدثه عن أبي بكر، عن قبيصة بن مخارق، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تصلح المسألة إلا لثلاثة رجل أصابت ماله جائحة فيسأل حتى يصيب سدادا من عيش ثم يمسك ورجل تحمل حمالة فيسأل حتى يؤدي إليهم حمالتهم ثم يمسك عن المسألة ورجل يحلف ثلاثة نفر من قومه من ذوي الحجا بالله لقد حلت المسألة لفلان فيسأل حتى يصيب قواما من معيشة ثم يمسك عن المسألة فما سوى ذلك سحت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 2592,
			"arabicnumber": 2592,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا سفيان الثوري، عن حكيم بن جبير، عن محمد بن عبد الرحمن بن يزيد، عن أبيه، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وله ما يغنيه جاءت خموشا أو كدوحا في وجهه يوم القيامة ‏\"‏ ‏.‏ قيل يا رسول الله وماذا يغنيه أو ماذا أغناه قال ‏\"‏ خمسون درهما أو حسابها من الذهب ‏\"‏ ‏.‏ قال يحيى قال سفيان وسمعت زبيدا يحدث عن محمد بن عبد الرحمن بن يزيد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 2593,
			"arabicnumber": 2593,
			"text": "أخبرنا الحسين بن حريث، قال أنبأنا سفيان، عن عمرو، عن وهب بن منبه، عن أخيه، عن معاوية، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تلحفوا في المسألة ولا يسألني أحد منكم شيئا وأنا له كاره فيبارك له فيما أعطيته ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 2594,
			"arabicnumber": 2594,
			"text": "أخبرنا أحمد بن سليمان، قال أنبأنا يحيى بن آدم، عن سفيان بن عيينة، عن داود بن شابور، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من سأل وله أربعون درهما فهو الملحف ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 2595,
			"arabicnumber": 2595,
			"text": "أخبرنا قتيبة، قال حدثنا ابن أبي الرجال، عن عمارة بن غزية، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، قال سرحتني أمي إلى رسول الله صلى الله عليه وسلم فأتيته وقعدت فاستقبلني وقال ‏ \"‏ من استغنى أغناه الله عز وجل ومن استعف أعفه الله عز وجل ومن استكفى كفاه الله عز وجل ومن سأل وله قيمة أوقية فقد ألحف ‏\"‏ ‏.‏ فقلت ناقتي الياقوتة خير من أوقية فرجعت ولم أسأله ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 2596,
			"arabicnumber": 2596,
			"text": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال أنبأنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن رجل، من بني أسد قال نزلت أنا وأهلي، ببقيع الغرقد فقالت لي أهلي اذهب إلى رسول الله صلى الله عليه وسلم فسله لنا شيئا نأكله ‏.‏ فذهبت إلى رسول الله صلى الله عليه وسلم فوجدت عنده رجلا يسأله ورسول الله صلى الله عليه وسلم يقول ‏\"‏ لا أجد ما أعطيك ‏\"‏ ‏.‏ فولى الرجل عنه وهو مغضب وهو يقول لعمري إنك لتعطي من شئت ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليغضب على أن لا أجد ما أعطيه من سأل منكم وله أوقية أو عدلها فقد سأل إلحافا ‏\"‏ ‏.‏ قال الأسدي فقلت للقحة لنا خير من أوقية - والأوقية أربعون درهما - فرجعت ولم أسأله فقدم على رسول الله صلى الله عليه وسلم بعد ذلك شعير وزبيب فقسم لنا منه حتى أغنانا الله عز وجل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 2597,
			"arabicnumber": 2597,
			"text": "أخبرنا هناد بن السري، عن أبي بكر، عن أبي حصين، عن سالم، عن أبي هريرة، قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 2598,
			"arabicnumber": 2598,
			"text": "أخبرنا عمرو بن علي، ومحمد بن المثنى، قالا حدثنا يحيى، عن هشام بن عروة، قال حدثني أبي قال، حدثني عبيد الله بن عدي بن الخيار، ‏.‏ أن رجلين، حدثاه أنهما، أتيا رسول الله صلى الله عليه وسلم يسألانه من الصدقة فقلب فيهما البصر - وقال محمد بصره - فرآهما جلدين فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن شئتما ولا حظ فيها لغني ولا لقوي مكتسب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 2599,
			"arabicnumber": 2599,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال أنبأنا شعبة، عن عبد الملك، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن المسائل كدوح يكدح بها الرجل وجهه فمن شاء كدح وجهه ومن شاء ترك إلا أن يسأل الرجل ذا سلطان أو شيئا لا يجد منه بدا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 2600,
			"arabicnumber": 2600,
			"text": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن عبد الملك، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ المسألة كد يكد بها الرجل وجهه إلا أن يسأل الرجل سلطانا أو في أمر لا بد منه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 2601,
			"arabicnumber": 2601,
			"text": "أخبرنا عبد الجبار بن العلاء بن عبد الجبار، عن سفيان، عن الزهري، قال أخبرني عروة، عن حكيم بن حزام، قال سألت رسول الله صلى الله عليه وسلم فأعطاني ثم سألته فأعطاني ثم سألته فأعطاني فقال رسول الله صلى الله عليه وسلم ‏ \"‏ يا حكيم إن هذا المال خضرة حلوة فمن أخذه بطيب نفس بورك له فيه ومن أخذه بإشراف نفس لم يبارك له فيه وكان كالذي يأكل ولا يشبع واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 2602,
			"arabicnumber": 2602,
			"text": "أخبرنا أحمد بن سليمان، قال حدثنا مسكين بن بكير، قال حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، عن حكيم بن حزام، قال سألت رسول الله صلى الله عليه وسلم فأعطاني ثم سألته فأعطاني ثم سألته فأعطاني ثم قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا حكيم إن هذا المال خضرة حلوة من أخذه بسخاوة نفس بورك له فيه ومن أخذه بإشراف النفس لم يبارك له فيه وكان كالذي يأكل ولا يشبع واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 2603,
			"arabicnumber": 2603,
			"text": "أخبرني الربيع بن سليمان بن داود، قال حدثنا إسحاق بن بكر، قال حدثني أبي، عن عمرو بن الحارث، عن ابن شهاب، عن عروة بن الزبير، وسعيد بن المسيب، أن حكيم بن حزام، قال سألت رسول الله صلى الله عليه وسلم فأعطاني ثم سألته فأعطاني ثم قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا حكيم إن هذا المال حلوة فمن أخذه بسخاوة نفس بورك له فيه ومن أخذه بإشراف نفس لم يبارك له فيه وكان كالذي يأكل ولا يشبع واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏ قال حكيم فقلت يا رسول الله والذي بعثك بالحق لا أرزأ أحدا بعدك حتى أفارق الدنيا بشىء ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 2604,
			"arabicnumber": 2604,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن بكير، عن بسر بن سعيد، عن ابن الساعدي المالكي، قال استعملني عمر بن الخطاب رضى الله عنه على الصدقة فلما فرغت منها فأديتها إليه أمر لي بعمالة فقلت له إنما عملت لله عز وجل وأجري على الله عز وجل ‏.‏ فقال خذ ما أعطيتك فإني قد عملت على عهد رسول الله صلى الله عليه وسلم فقلت له مثل قولك فقال لي رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أعطيت شيئا من غير أن تسأل فكل وتصدق ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 2605,
			"arabicnumber": 2605,
			"text": "أخبرنا سعيد بن عبد الرحمن أبو عبيد الله المخزومي، قال حدثنا سفيان، عن الزهري، عن السائب بن يزيد، عن حويطب بن عبد العزى، قال أخبرني عبد الله بن السعدي، أنه قدم على عمر بن الخطاب رضى الله عنه من الشام فقال ألم أخبر أنك تعمل على عمل من أعمال المسلمين فتعطى عليه عمالة فلا تقبلها قال أجل إن لي أفراسا وأعبدا وأنا بخير وأريد أن يكون عملي صدقة على المسلمين فقال عمر رضى الله عنه إني أردت الذي أردت وكان النبي صلى الله عليه وسلم يعطيني المال فأقول أعطه من هو أفقر إليه مني وإنه أعطاني مرة مالا فقلت له أعطه من هو أحوج إليه مني ‏.‏ فقال ‏ \"‏ ما آتاك الله عز وجل من هذا المال من غير مسألة ولا إشراف فخذه فتموله أو تصدق به وما لا فلا تتبعه نفسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 2606,
			"arabicnumber": 2606,
			"text": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن السائب بن يزيد، أن حويطب بن عبد العزى، أخبره أن عبد الله بن السعدي أخبره أنه، قدم على عمر بن الخطاب في خلافته فقال له عمر ألم أحدث أنك تلي من أعمال الناس أعمالا فإذا أعطيت العمالة رددتها فقلت بلى ‏.‏ فقال عمر رضى الله عنه فما تريد إلى ذلك فقلت لي أفراس وأعبد وأنا بخير وأريد أن يكون عملي صدقة على المسلمين ‏.‏ فقال له عمر فلا تفعل فإني كنت أردت مثل الذي أردت كان رسول الله صلى الله عليه وسلم يعطيني العطاء فأقول أعطه أفقر إليه مني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ خذه فتموله أو تصدق به ما جاءك من هذا المال وأنت غير مشرف ولا سائل فخذه وما لا فلا تتبعه نفسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 2607,
			"arabicnumber": 2607,
			"text": "أخبرنا عمرو بن منصور، وإسحاق بن منصور، عن الحكم بن نافع، قال أنبأنا شعيب، عن الزهري، قال أخبرني السائب بن يزيد، أن حويطب بن عبد العزى، أخبره أن عبد الله بن السعدي أخبره أنه، قدم على عمر بن الخطاب في خلافته فقال عمر ألم أخبر أنك، تلي من أعمال الناس أعمالا فإذا أعطيت العمالة كرهتها قال فقلت بلى ‏.‏ قال فما تريد إلى ذلك فقلت إن لي أفراسا وأعبدا وأنا بخير وأريد أن يكون عملي صدقة على المسلمين فقال عمر فلا تفعل فإني كنت أردت الذي أردت فكان النبي صلى الله عليه وسلم يعطيني العطاء فأقول أعطه أفقر إليه مني حتى أعطاني مرة مالا فقلت أعطه أفقر إليه مني ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ خذه فتموله وتصدق به فما جاءك من هذا المال وأنت غير مشرف ولا سائل فخذه وما لا فلا تتبعه نفسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 2608,
			"arabicnumber": 2608,
			"text": "أخبرنا عمرو بن منصور، قال حدثنا الحكم بن نافع، قال أنبأنا شعيب، عن الزهري، قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، قال سمعت عمر، رضى الله عنه يقول كان النبي صلى الله عليه وسلم يعطيني العطاء فأقول أعطه أفقر إليه مني حتى أعطاني مرة مالا فقلت له أعطه أفقر إليه مني ‏.‏ فقال ‏ \"‏ خذه فتموله وتصدق به وما جاءك من هذا المال وأنت غير مشرف ولا سائل فخذه وما لا فلا تتبعه نفسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 2609,
			"arabicnumber": 2609,
			"text": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، عن ابن وهب، قال حدثنا يونس، عن ابن شهاب، عن عبد الله بن الحارث بن نوفل الهاشمي، أن عبد المطلب بن ربيعة بن الحارث بن عبد المطلب، أخبره أن أباه ربيعة بن الحارث قال لعبد المطلب بن ربيعة بن الحارث والفضل بن العباس بن عبد المطلب ائتيا رسول الله صلى الله عليه وسلم فقولا له استعملنا يا رسول الله على الصدقات ‏.‏ فأتى علي بن أبي طالب ونحن على تلك الحال فقال لهما إن رسول الله صلى الله عليه وسلم لا يستعمل منكم أحدا على الصدقة قال عبد المطلب فانطلقت أنا والفضل حتى أتينا رسول الله صلى الله عليه وسلم فقال لنا ‏ \"‏ إن هذه الصدقة إنما هي أوساخ الناس وإنها لا تحل لمحمد ولا لآل محمد صلى الله عليه وسلم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 2610,
			"arabicnumber": 2610,
			"text": "أخبرنا إسحاق بن إبراهيم، قال حدثنا وكيع، قال حدثنا شعبة، قال قلت لأبي إياس معاوية بن قرة أسمعت أنس بن مالك يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ابن أخت القوم من أنفسهم ‏\"‏ ‏.‏ قال نعم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 2611,
			"arabicnumber": 2611,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا شعبة، عن قتادة، عن أنس بن مالك، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ابن أخت القوم منهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثنا الحكم، عن ابن أبي رافع، عن أبيه، أن رسول الله صلى الله عليه وسلم استعمل رجلا من بني مخزوم على الصدقة فأراد أبو رافع أن يتبعه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الصدقة لا تحل لنا وإن مولى القوم منهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "أخبرنا زياد بن أيوب، قال حدثنا عبد الواحد بن واصل، قال حدثنا بهز بن حكيم، عن أبيه، عن جده، قال كان النبي صلى الله عليه وسلم إذا أتي بشىء سأل عنه ‏ \"‏ أهدية أم صدقة ‏\"‏ ‏.‏ فإن قيل صدقة لم يأكل وإن قيل هدية بسط يده ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 2614,
			"arabicnumber": 2614,
			"text": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة، أنها أرادت أن تشتري، بريرة فتعتقها وأنهم اشترطوا ولاءها فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ اشتريها واعتقيها فإن الولاء لمن أعتق ‏\"‏ ‏.‏ وخيرت حين أعتقت وأتي رسول الله صلى الله عليه وسلم بلحم فقيل هذا مما تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏ وكان زوجها حرا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 2615,
			"arabicnumber": 2615,
			"text": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثنا مالك، عن زيد بن أسلم، عن أبيه، قال سمعت عمر، يقول حملت على فرس في سبيل الله عز وجل فأضاعه الذي كان عنده وأردت أن أبتاعه منه وظننت أنه بائعه برخص فسألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏ \"‏ لا تشتره وإن أعطاكه بدرهم فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 2616,
			"arabicnumber": 2616,
			"text": "أخبرنا هارون بن إسحاق، قال حدثنا عبد الرزاق، عن معمر، عن الزهري، عن سالم بن عبد الله، عن أبيه، عن عمر، أنه حمل على فرس في سبيل الله فرآها تباع فأراد شراءها فقال له النبي صلى الله عليه وسلم ‏ \"‏ لا تعرض في صدقتك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 2617,
			"arabicnumber": 2617,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال أنبأنا حجين، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر، كان يحدث أن عمر، تصدق بفرس في سبيل الله عز وجل فوجدها تباع بعد ذلك فأراد أن يشتريه ثم أتى رسول الله صلى الله عليه وسلم فاستأمره في ذلك فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تعد في صدقتك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 2618,
			"arabicnumber": 2618,
			"text": "أخبرنا عمرو بن علي، قال حدثنا بشر، ويزيد، قالا حدثنا عبد الرحمن بن إسحاق، عن الزهري، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم أمر عتاب بن أسيد أن يخرص العنب فتؤدى زكاته زبيبا كما تؤدى زكاة النخل تمرا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 184
			}
		}
	]
}