{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"29": "The Book of Endowments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3594,
			"arabicnumber": 3594,
			"text": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن الحارث، قال ما ترك رسول الله صلى الله عليه وسلم دينارا ولا درهما ولا عبدا ولا أمة إلا بغلته الشهباء التي كان يركبها وسلاحه وأرضا جعلها في سبيل الله ‏.‏ وقال قتيبة مرة أخرى صدقة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3595,
			"arabicnumber": 3595,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا سفيان، قال حدثني أبو إسحاق، قال سمعت عمرو بن الحارث، يقول ما ترك رسول الله صلى الله عليه وسلم إلا بغلته البيضاء وسلاحه وأرضا تركها صدقة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3596,
			"arabicnumber": 3596,
			"text": "أخبرنا عمرو بن علي، قال حدثنا أبو بكر الحنفي، قال حدثنا يونس بن أبي إسحاق، عن أبيه، قال سمعت عمرو بن الحارث، يقول رأيت رسول الله صلى الله عليه وسلم ما ترك إلا بغلته الشهباء وسلاحه وأرضا تركها صدقة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3597,
			"arabicnumber": 3597,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو داود الحفري، عمر بن سعد عن سفيان الثوري، عن ابن عون، عن نافع، عن ابن عمر، عن عمر، قال أصبت أرضا من أرض خيبر فأتيت رسول الله صلى الله عليه وسلم فقلت أصبت أرضا لم أصب مالا أحب إلى ولا أنفس عندي منها ‏.‏ قال ‏ \"‏ إن شئت تصدقت بها ‏\"‏ ‏.‏ فتصدق بها - على أن لا تباع ولا توهب - في الفقراء وذي القربى والرقاب والضيف وابن السبيل لا جناح على من وليها أن يأكل بالمعروف غير متمول مالا ويطعم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3598,
			"arabicnumber": 3598,
			"text": "أخبرني هارون بن عبد الله، قال حدثنا معاوية بن عمرو، عن أبي إسحاق الفزاري، عن ابن عون، عن نافع، عن ابن عمر، عن عمر، رضى الله عنه عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3599,
			"arabicnumber": 3599,
			"text": "أخبرنا حميد بن مسعدة، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا ابن عون، عن نافع، عن ابن عمر، أن عمر، قال أصاب عمر أرضا بخيبر فأتى النبي صلى الله عليه وسلم فقال أصبت أرضا لم أصب مالا قط أنفس عندي فكيف تأمر به قال ‏ \"‏ إن شئت حبست أصلها وتصدقت بها ‏\"‏ ‏.‏ فتصدق بها - على أن لا تباع ولا توهب ولا تورث - في الفقراء والقربى والرقاب وفي سبيل الله والضيف وابن السبيل لا جناح على من وليها أن يأكل منها بالمعروف ويطعم صديقا غير متمول فيه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3600,
			"arabicnumber": 3600,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، عن ابن عون، قال وأنبأنا حميد بن مسعدة، قال حدثنا بشر، قال حدثنا ابن عون، عن نافع، عن ابن عمر، قال أصاب عمر أرضا بخيبر فأتى النبي صلى الله عليه وسلم فاستأمره فيها فقال إني أصبت أرضا كثيرا لم أصب مالا قط أنفس عندي منه فما تأمر فيها قال ‏ \"‏ إن شئت حبست أصلها وتصدقت بها ‏\"‏ ‏.‏ فتصدق بها - على أنه لا تباع ولا توهب - فتصدق بها في الفقراء والقربى وفي الرقاب وفي سبيل الله وابن السبيل والضيف لا جناح - يعني - على من وليها أن يأكل أو يطعم صديقا غير متمول اللفظ لإسماعيل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3601,
			"arabicnumber": 3601,
			"text": "أخبرنا إسحاق بن إبراهيم، قال حدثنا أزهر السمان، عن ابن عون، عن نافع، عن ابن عمر، أن عمر، أصاب أرضا بخيبر فأتى النبي صلى الله عليه وسلم يستأمره في ذلك فقال ‏ \"‏ إن شئت حبست أصلها وتصدقت بها ‏\"‏ ‏.‏ فحبس أصلها أن لا تباع و لا توهب ولا تورث فتصدق بها على الفقراء والقربى والرقاب وفي المساكين وابن السبيل والضيف لا جناح على من وليها أن يأكل منها بالمعروف أو يطعم صديقه غير متمول فيه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3602,
			"arabicnumber": 3602,
			"text": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز، قال حدثنا حماد، قال حدثنا ثابت، عن أنس، قال لما نزلت هذه الآية ‏{‏ لن تنالوا البر حتى تنفقوا مما تحبون ‏}‏ قال أبو طلحة إن ربنا ليسألنا عن أموالنا فأشهدك يا رسول الله أني قد جعلت أرضي لله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها في قرابتك في حسان بن ثابت وأبى بن كعب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3603,
			"arabicnumber": 3603,
			"text": "أخبرنا سعيد بن عبد الرحمن، قال حدثنا سفيان بن عيينة، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال قال عمر للنبي صلى الله عليه وسلم إن المائة سهم التي لي بخيبر لم أصب مالا قط أعجب إلى منها قد أردت أن أتصدق بها ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ احبس أصلها وسبل ثمرتها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3604,
			"arabicnumber": 3604,
			"text": "أخبرنا محمد بن عبد الله الخلنجي، ببيت المقدس قال حدثنا سفيان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، عن عمر، رضى الله عنه قال جاء عمر إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني أصبت مالا لم أصب مثله قط كان لي مائة رأس فاشتريت بها مائة سهم من خيبر من أهلها وإني قد أردت أن أتقرب بها إلى الله عز وجل ‏.‏ قال ‏ \"‏ فاحبس أصلها وسبل الثمرة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3605,
			"arabicnumber": 3605,
			"text": "أخبرنا محمد بن مصفى بن بهلول، قال حدثنا بقية، عن سعيد بن سالم المكي، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، عن عمر، قال سألت رسول الله صلى الله عليه وسلم عن أرض لي بثمغ قال ‏ \"‏ احبس أصلها وسبل ثمرتها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3606,
			"arabicnumber": 3606,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا المعتمر بن سليمان، قال سمعت أبي يحدث، عن حصين بن عبد الرحمن، عن عمرو بن جاوان، - رجل من بني تميم - وذاك أني قلت له أرأيت اعتزال الأحنف بن قيس ما كان قال سمعت الأحنف يقول أتيت المدينة وأنا حاج فبينا نحن في منازلنا نضع رحالنا إذ أتى آت فقال قد اجتمع الناس في المسجد فاطلعت فإذا يعني الناس مجتمعون وإذا بين أظهرهم نفر قعود فإذا هو علي بن أبي طالب والزبير وطلحة وسعد بن أبي وقاص رحمة الله عليهم فلما قمت عليهم قيل هذا عثمان بن عفان قد جاء - قال - فجاء وعليه ملية صفراء فقلت لصاحبي كما أنت حتى أنظر ما جاء به ‏.‏ فقال عثمان أها هنا علي أها هنا الزبير أها هنا طلحة أها هنا سعد قالوا نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبتاع مربد بني فلان غفر الله له ‏\"‏ ‏.‏ فابتعته فأتيت رسول الله صلى الله عليه وسلم فقلت إني ابتعت مربد بني فلان ‏.‏ قال ‏\"‏ فاجعله في مسجدنا وأجره لك ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبتاع بئر رومة غفر الله له ‏\"‏ ‏.‏ فأتيت رسول الله صلى الله عليه وسلم فقلت قد ابتعت بئر رومة ‏.‏ قال ‏\"‏ فاجعلها سقاية للمسلمين وأجرها لك ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يجهز جيش العسرة غفر الله له ‏\"‏ ‏.‏ فجهزتهم حتى ما يفقدون عقالا ولا خطاما ‏.‏ قالوا نعم ‏.‏ قال اللهم اشهد اللهم اشهد اللهم اشهد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3607,
			"arabicnumber": 3607,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الله بن إدريس، قال سمعت حصين بن عبد الرحمن، يحدث عن عمرو بن جاوان، عن الأحنف بن قيس، قال خرجنا حجاجا فقدمنا المدينة ونحن نريد الحج فبينا نحن في منازلنا نضع رحالنا إذ أتانا آت فقال إن الناس قد اجتمعوا في المسجد وفزعوا ‏.‏ فانطلقنا فإذا الناس مجتمعون على نفر في وسط المسجد وإذا علي والزبير وطلحة وسعد بن أبي وقاص فإنا لكذلك إذ جاء عثمان بن عفان عليه ملاءة صفراء قد قنع بها رأسه فقال أها هنا علي أها هنا طلحة أها هنا الزبير أها هنا سعد قالوا نعم ‏.‏ قال فإني أنشدكم بالله الذي لا إله إلا هو أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبتاع مربد بني فلان غفر الله له ‏\"‏ ‏.‏ فابتعته بعشرين ألفا أو بخمسة وعشرين ألفا فأتيت رسول الله صلى الله عليه وسلم فأخبرته فقال ‏\"‏ اجعلها في مسجدنا وأجره لك ‏\"‏ ‏.‏ قالوا اللهم نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبتاع بئر رومة غفر الله له ‏\"‏ ‏.‏ فابتعته بكذا وكذا فأتيت رسول الله صلى الله عليه وسلم فقلت قد ابتعتها بكذا وكذا ‏.‏ قال ‏\"‏ اجعلها سقاية للمسلمين وأجرها لك ‏\"‏ ‏.‏ قالوا اللهم نعم ‏.‏ قال فأنشدكم بالله الذي لا إله إلا هو أتعلمون أن رسول الله صلى الله عليه وسلم نظر في وجوه القوم فقال ‏\"‏ من جهز هؤلاء الله غفر له ‏\"‏ ‏.‏ يعني جيش العسرة فجهزتهم حتى ما يفقدون عقالا ولا خطاما ‏.‏ قالوا اللهم نعم ‏.‏ قال اللهم اشهد اللهم اشهد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3608,
			"arabicnumber": 3608,
			"text": "أخبرني زياد بن أيوب، قال حدثنا سعيد بن عامر، عن يحيى بن أبي الحجاج، عن سعيد الجريري، عن ثمامة بن حزن القشيري، قال شهدت الدار حين أشرف عليهم عثمان فقال أنشدكم بالله وبالإسلام هل تعلمون أن رسول الله صلى الله عليه وسلم قدم المدينة وليس بها ماء يستعذب غير بئر رومة فقال ‏\"‏ من يشتري بئر رومة فيجعل فيها دلوه مع دلاء المسلمين بخير له منها في الجنة ‏\"‏ ‏.‏ فاشتريتها من صلب مالي فجعلت دلوي فيها مع دلاء المسلمين وأنتم اليوم تمنعوني من الشرب منها حتى أشرب من ماء البحر قالوا اللهم نعم ‏.‏ قال فأنشدكم بالله والإسلام هل تعلمون أني جهزت جيش العسرة من مالي قالوا اللهم نعم ‏.‏ قال فأنشدكم بالله والإسلام هل تعلمون أن المسجد ضاق بأهله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يشتري بقعة آل فلان فيزيدها في المسجد بخير له منها في الجنة ‏\"‏ ‏.‏ فاشتريتها من صلب مالي فزدتها في المسجد وأنتم تمنعوني أن أصلي فيه ركعتين قالوا اللهم نعم ‏.‏ قال أنشدكم بالله والإسلام هل تعلمون أن رسول الله صلى الله عليه وسلم كان على ثبير ثبير مكة ومعه أبو بكر وعمر وأنا فتحرك الجبل فركضه رسول الله صلى الله عليه وسلم برجله وقال ‏\"‏ اسكن ثبير فإنما عليك نبي وصديق وشهيدان ‏\"‏ ‏.‏ قالوا اللهم نعم ‏.‏ قال الله أكبر شهدوا لي ورب الكعبة ‏.‏ يعني أني شهيد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3609,
			"arabicnumber": 3609,
			"text": "أخبرنا عمران بن بكار بن راشد، قال حدثنا خطاب بن عثمان، قال حدثنا عيسى بن يونس، حدثني أبي، عن أبي إسحاق، عن أبي سلمة بن عبد الرحمن، أن عثمان، أشرف عليهم حين حصروه فقال أنشد بالله رجلا سمع من رسول الله صلى الله عليه وسلم يقول يوم الجبل حين اهتز فركله برجله وقال ‏\"‏ اسكن فإنه ليس عليك إلا نبي أو صديق أو شهيدان ‏\"‏ ‏.‏ وأنا معه فانتشد له رجال ثم قال أنشد بالله رجلا شهد رسول الله صلى الله عليه وسلم يوم بيعة الرضوان يقول ‏\"‏ هذه يد الله وهذه يد عثمان ‏\"‏ ‏.‏ فانتشد له رجال ثم قال أنشد بالله رجلا سمع رسول الله صلى الله عليه وسلم يوم جيش العسرة يقول ‏\"‏ من ينفق نفقة متقبلة ‏\"‏ ‏.‏ فجهزت نصف الجيش من مالي فانتشد له رجال ثم قال أنشد بالله رجلا سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من يزيد في هذا المسجد ببيت في الجنة ‏\"‏ ‏.‏ فاشتريته من مالي فانتشد له رجال ثم قال أنشد بالله رجلا شهد رومة تباع فاشتريتها من مالي فأبحتها لابن السبيل فانتشد له رجال ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3610,
			"arabicnumber": 3610,
			"text": "أخبرني محمد بن وهب، قال حدثني محمد بن سلمة، قال حدثني أبو عبد الرحيم، قال حدثني زيد بن أبي أنيسة، عن أبي إسحاق، عن أبي عبد الرحمن السلمي، قال لما حصر عثمان في داره اجتمع الناس حول داره - قال - فأشرف عليهم ‏.‏ وساق الحديث ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		}
	]
}