{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"38": "The Book of Distribution of Al-Fay'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4133,
			"arabicnumber": 4133,
			"text": "أخبرنا هارون بن عبد الله الحمال، قال حدثنا عثمان بن عمر، عن يونس بن يزيد، عن الزهري، عن يزيد بن هرمز، أن نجدة الحروري، حين خرج في فتنة ابن الزبير أرسل إلى ابن عباس يسأله عن سهم ذي القربى لمن تراه قال هو لنا لقربى رسول الله صلى الله عليه وسلم قسمه رسول الله صلى الله عليه وسلم لهم وقد كان عمر عرض علينا شيئا رأيناه دون حقنا فأبينا أن نقبله وكان الذي عرض عليهم أن يعين ناكحهم ويقضي عن غارمهم ويعطي فقيرهم وأبى أن يزيدهم على ذلك ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": 4134,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يزيد، - وهو ابن هارون - قال أنبأنا محمد بن إسحاق، عن الزهري، ومحمد بن علي، عن يزيد بن هرمز، قال كتب نجدة إلى ابن عباس يسأله عن سهم، ذي القربى لمن هو قال يزيد بن هرمز وأنا كتبت كتاب ابن عباس إلى نجدة كتبت إليه كتبت تسألني عن سهم ذي القربى لمن هو وهو لنا أهل البيت وقد كان عمر دعانا إلى أن ينكح منه أيمنا ويحذي منه عائلنا ويقضي منه عن غارمنا فأبينا إلا أن يسلمه لنا وأبى ذلك فتركناه عليه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": 4135,
			"text": "أخبرنا عمرو بن يحيى، قال حدثنا محبوب، - يعني ابن موسى - قال أنبأنا أبو إسحاق، - وهو الفزاري - عن الأوزاعي، قال كتب عمر بن عبد العزيز إلى عمر بن الوليد كتابا فيه وقسم أبيك لك الخمس كله وإنما سهم أبيك كسهم رجل من المسلمين وفيه حق الله وحق الرسول وذي القربى واليتامى والمساكين وابن السبيل فما أكثر خصماء أبيك يوم القيامة فكيف ينجو من كثرت خصماؤه وإظهارك المعازف والمزمار بدعة في الإسلام ولقد هممت أن أبعث إليك من يجز جمتك جمة السوء ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": 4136,
			"text": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن يحيى، قال حدثنا نافع بن يزيد، عن يونس بن يزيد، عن ابن شهاب، قال أخبرني سعيد بن المسيب، أن جبير بن مطعم، حدثه أنه، جاء هو وعثمان بن عفان رسول الله صلى الله عليه وسلم يكلمانه فيما قسم من خمس حنين بين بني هاشم وبني المطلب بن عبد مناف فقالا يا رسول الله قسمت لإخواننا بني المطلب بن عبد مناف ولم تعطنا شيئا وقرابتنا مثل قرابتهم ‏.‏ فقال لهما رسول الله صلى الله عليه وسلم ‏ \"‏ إنما أرى هاشما والمطلب شيئا واحدا ‏\"‏ ‏.‏ قال جبير بن مطعم ولم يقسم رسول الله صلى الله عليه وسلم لبني عبد شمس ولا لبني نوفل من ذلك الخمس شيئا كما قسم لبني هاشم وبني المطلب ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": 4137,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا يزيد بن هارون، قال أنبأنا محمد بن إسحاق، عن الزهري، عن سعيد بن المسيب، عن جبير بن مطعم، قال لما قسم رسول الله صلى الله عليه وسلم سهم ذي القربى بين بني هاشم وبني المطلب أتيته أنا وعثمان بن عفان فقلنا يا رسول الله هؤلاء بنو هاشم لا ننكر فضلهم لمكانك الذي جعلك الله به منهم أرأيت بني المطلب أعطيتهم ومنعتنا فإنما نحن وهم منك بمنزلة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إنهم لم يفارقوني في جاهلية ولا إسلام إنما بنو هاشم وبنو المطلب شىء واحد ‏\"‏ ‏.‏ وشبك بين أصابعه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": 4138,
			"text": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، - يعني ابن موسى - قال أنبأنا أبو إسحاق، - وهو الفزاري - عن عبد الرحمن بن عياش، عن سليمان بن موسى، عن مكحول، عن أبي سلام، عن أبي أمامة الباهلي، عن عبادة بن الصامت، قال أخذ رسول الله صلى الله عليه وسلم يوم حنين وبرة من جنب بعير فقال ‏ \"‏ يا أيها الناس إنه لا يحل لي مما أفاء الله عليكم قدر هذه إلا الخمس والخمس مردود عليكم ‏\"‏ ‏.‏ قال أبو عبد الرحمن اسم أبي سلام ممطور وهو حبشي واسم أبي أمامة صدى بن عجلان والله تعالى أعلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": 4139,
			"text": "أخبرنا عمرو بن يزيد، قال حدثنا ابن أبي عدي، قال حدثنا حماد بن سلمة، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم أتى بعيرا فأخذ من سنامه وبرة بين إصبعيه ثم قال ‏ \"‏ إنه ليس لي من الفىء شىء ولا هذه إلا الخمس والخمس مردود فيكم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4140,
			"arabicnumber": 4140,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا سفيان، عن عمرو، - يعني ابن دينار - عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر، قال كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف المسلمون عليه بخيل ولا ركاب فكان ينفق على نفسه منها قوت سنة وما بقي جعله في الكراع والسلاح عدة في سبيل الله ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4141,
			"arabicnumber": 4141,
			"text": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، - يعني ابن موسى - قال أنبأنا أبو إسحاق، - هو الفزاري - عن شعيب بن أبي حمزة، عن الزهري، عن عروة بن الزبير، عن عائشة، أن فاطمة، أرسلت إلى أبي بكر تسأله ميراثها من النبي صلى الله عليه وسلم من صدقته ومما ترك من خمس خيبر قال أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا نورث ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4142,
			"arabicnumber": 4142,
			"text": "أخبرنا عمرو بن يحيى، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن زائدة، عن عبد الملك بن أبي سليمان، عن عطاء، في قوله عز وجل ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى ‏}‏ قال خمس الله وخمس رسوله واحد كان رسول الله صلى الله عليه وسلم يحمل منه ويعطي منه ويضعه حيث شاء ويصنع به ما شاء ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4143,
			"arabicnumber": 4143,
			"text": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، - يعني ابن موسى - قال أنبأنا أبو إسحاق، - هو الفزاري - عن سفيان، عن قيس بن مسلم، قال سألت الحسن بن محمد عن قوله عز وجل ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه ‏}‏ قال هذا مفاتح كلام الله الدنيا والآخرة لله قال اختلفوا في هذين السهمين بعد وفاة رسول الله صلى الله عليه وسلم سهم الرسول وسهم ذي القربى فقال قائل سهم الرسول صلى الله عليه وسلم للخليفة من بعده وقال قائل سهم ذي القربى لقرابة الرسول صلى الله عليه وسلم وقال قائل سهم ذي القربى لقرابة الخليفة فاجتمع رأيهم على أن جعلوا هذين السهمين في الخيل والعدة في سبيل الله فكانا في ذلك خلافة أبي بكر وعمر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4144,
			"arabicnumber": 4144,
			"text": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن موسى بن أبي عائشة، قال سألت يحيى بن الجزار عن هذه الآية، ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ‏}‏ قال قلت كم كان للنبي صلى الله عليه وسلم من الخمس قال خمس الخمس ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4145,
			"arabicnumber": 4145,
			"text": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن مطرف، قال سئل الشعبي عن سهم النبي، صلى الله عليه وسلم وصفيه فقال أما سهم النبي صلى الله عليه وسلم فكسهم رجل من المسلمين وأما سهم الصفي فغرة تختار من أى شىء شاء ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mursal"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4146,
			"arabicnumber": 4146,
			"text": "أخبرنا عمرو بن يحيى، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن سعيد الجريري، عن يزيد بن الشخير، قال بينا أنا مع، مطرف بالمربد إذ دخل رجل معه قطعة أدم قال كتب لي هذه رسول الله صلى الله عليه وسلم فهل أحد منكم يقرأ قال قلت أنا أقرأ فإذا فيها ‏ \"‏ من محمد النبي صلى الله عليه وسلم لبني زهير بن أقيش أنهم إن شهدوا أن لا إله إلا الله وأن محمدا رسول الله وفارقوا المشركين وأقروا بالخمس في غنائمهم وسهم النبي صلى الله عليه وسلم وصفيه فإنهم آمنون بأمان الله ورسوله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4147,
			"arabicnumber": 4147,
			"text": "أخبرنا عمرو بن يحيى بن الحارث، قال أنبأنا محبوب، قال أنبأنا أبو إسحاق، عن شريك، عن خصيف، عن مجاهد، قال الخمس الذي لله وللرسول كان للنبي صلى الله عليه وسلم وقرابته لا يأكلون من الصدقة شيئا فكان للنبي صلى الله عليه وسلم خمس الخمس ولذي قرابته خمس الخمس ولليتامى مثل ذلك وللمساكين مثل ذلك ولابن السبيل مثل ذلك ‏.‏ قال أبو عبد الرحمن قال الله جل ثناؤه ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل ‏}‏ وقوله عز وجل لله ابتداء كلام لأن الأشياء كلها لله عز وجل ولعله إنما استفتح الكلام في الفىء والخمس بذكر نفسه لأنها أشرف الكسب ولم ينسب الصدقة إلى نفسه عز وجل لأنها أوساخ الناس والله تعالى أعلم وقد قيل يؤخذ من الغنيمة شىء فيجعل في الكعبة وهو السهم الذي لله عز وجل وسهم النبي صلى الله عليه وسلم إلى الإمام يشتري الكراع منه والسلاح ويعطي منه من رأى ممن رأى فيه غناء ومنفعة لأهل الإسلام ومن أهل الحديث والعلم والفقه والقرآن وسهم لذي القربى وهم بنو هاشم وبنو المطلب بينهم الغني منهم والفقير وقد قيل إنه للفقير منهم دون الغني كاليتامى وابن السبيل وهو أشبه القولين بالصواب عندي والله تعالى أعلم والصغير والكبير والذكر والأنثى سواء لأن الله عز وجل جعل ذلك لهم وقسمه رسول الله صلى الله عليه وسلم فيهم وليس في الحديث أنه فضل بعضهم على بعض ولا خلاف نعلمه بين العلماء في رجل لو أوصى بثلثه لبني فلان أنه بينهم وأن الذكر والأنثى فيه سواء إذا كانوا يحصون فهكذا كل شىء صير لبني فلان أنه بينهم بالسوية إلا أن يبين ذلك الآمر به والله ولي التوفيق وسهم لليتامى من المسلمين وسهم للمساكين من المسلمين وسهم لابن السبيل من المسلمين ولا يعطى أحد منهم سهم مسكين وسهم ابن السبيل وقيل له خذ أيهما شئت والأربعة أخماس يقسمها الإمام بين من حضر القتال من المسلمين البالغين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4148,
			"arabicnumber": 4148,
			"text": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، - يعني ابن إبراهيم - عن أيوب، عن عكرمة بن خالد، عن مالك بن أوس بن الحدثان، قال جاء العباس وعلي إلى عمر يختصمان فقال العباس اقض بيني وبين هذا ‏.‏ فقال الناس افصل بينهما ‏.‏ فقال عمر لا أفصل بينهما قد علما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ قال فقال الزهري وليها رسول الله صلى الله عليه وسلم فأخذ منها قوت أهله وجعل سائره سبيله سبيل المال ثم وليها أبو بكر بعده ثم وليتها بعد أبي بكر فصنعت فيها الذي كان يصنع ثم أتياني فسألاني أن أدفعها إليهما على أن يلياها بالذي وليها به رسول الله صلى الله عليه وسلم والذي وليها به أبو بكر والذي وليتها به فدفعتها إليهما وأخذت على ذلك عهودهما ثم أتياني يقول هذا اقسم لي بنصيبي من ابن أخي ‏.‏ ويقول هذا اقسم لي بنصيبي من امرأتي ‏.‏ وإن شاءا أن أدفعها إليهما على أن يلياها بالذي وليها به رسول الله صلى الله عليه وسلم والذي وليها به أبو بكر والذي وليتها به دفعتها إليهما وإن أبيا كفيا ذلك ثم قال ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل ‏}‏ هذا لهؤلاء ‏{‏ إنما الصدقات للفقراء والمساكين والعاملين عليها والمؤلفة قلوبهم وفي الرقاب والغارمين وفي سبيل الله ‏}‏ هذه لهؤلاء ‏{‏ وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ‏}‏ قال الزهري هذه لرسول الله صلى الله عليه وسلم خاصة قرى عربية فدك كذا وكذا ‏{‏ ما أفاء الله على رسوله من أهل القرى فلله وللرسول ولذي القربى واليتامى والمساكين وابن السبيل ‏}‏ و ‏{‏ للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم ‏}‏ ‏{‏ والذين تبوءوا الدار والإيمان من قبلهم ‏}‏ ‏{‏ والذين جاءوا من بعدهم ‏}‏ فاستوعبت هذه الآية الناس فلم يبق أحد من المسلمين إلا له في هذا المال حق - أو قال حظ - إلا بعض من تملكون من أرقائكم ولئن عشت إن شاء الله ليأتين على كل مسلم حقه أو قال حظه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 16
			}
		}
	]
}