{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"8": "The Book of the Masjids"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 688,
			"arabicnumber": 688,
			"text": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد بن معدان، عن كثير بن مرة، عن عمرو بن عبسة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من بنى مسجدا يذكر الله فيه بنى الله عز وجل له بيتا في الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": 689,
			"text": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن حماد بن سلمة، عن أيوب، عن أبي قلابة، عن أنس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من أشراط الساعة أن يتباهى الناس في المساجد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 690,
			"arabicnumber": 690,
			"text": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، قال كنت أقرأ على أبي القرآن في السكة فإذا قرأت السجدة سجد فقلت يا أبت أتسجد في الطريق فقال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم أى مسجد وضع أولا قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت وكم بينهما قال ‏\"‏ أربعون عاما والأرض لك مسجد فحيثما أدركت الصلاة فصل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 691,
			"arabicnumber": 691,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن نافع، عن إبراهيم بن عبد الله بن معبد بن عباس، أن ميمونة، زوج النبي صلى الله عليه وسلم قالت من صلى في مسجد رسول الله صلى الله عليه وسلم فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ الصلاة فيه أفضل من ألف صلاة فيما سواه إلا مسجد الكعبة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 692,
			"arabicnumber": 692,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن شهاب، عن سالم، عن أبيه، قال دخل رسول الله صلى الله عليه وسلم البيت هو وأسامة بن زيد وبلال وعثمان بن طلحة فأغلقوا عليهم فلما فتحها رسول الله صلى الله عليه وسلم كنت أول من ولج فلقيت بلالا فسألته هل صلى فيه رسول الله صلى الله عليه وسلم قال نعم صلى بين العمودين اليمانيين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 693,
			"arabicnumber": 693,
			"text": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن ابن الديلمي، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم ‏ \"‏ أن سليمان بن داود صلى الله عليه وسلم لما بنى بيت المقدس سأل الله عز وجل خلالا ثلاثة سأل الله عز وجل حكما يصادف حكمه فأوتيه وسأل الله عز وجل ملكا لا ينبغي لأحد من بعده فأوتيه وسأل الله عز وجل حين فرغ من بناء المسجد أن لا يأتيه أحد لا ينهزه إلا الصلاة فيه أن يخرجه من خطيئته كيوم ولدته أمه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 694,
			"arabicnumber": 694,
			"text": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن أبي سلمة بن عبد الرحمن، وأبي عبد الله الأغر، مولى الجهنيين وكانا من أصحاب أبي هريرة أنهما سمعا أبا هريرة يقول صلاة في مسجد رسول الله صلى الله عليه وسلم أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام فإن رسول الله صلى الله عليه وسلم آخر الأنبياء ومسجده آخر المساجد ‏.‏ قال أبو سلمة وأبو عبد الله لم نشك أن أبا هريرة كان يقول عن حديث رسول الله صلى الله عليه وسلم فمنعنا أن نستثبت أبا هريرة في ذلك الحديث حتى إذا توفي أبو هريرة ذكرنا ذلك وتلاومنا أن لا نكون كلمنا أبا هريرة في ذلك حتى يسنده إلى رسول الله صلى الله عليه وسلم إن كان سمعه منه فبينا نحن على ذلك جالسنا عبد الله بن إبراهيم بن قارظ فذكرنا ذلك الحديث والذي فرطنا فيه من نص أبي هريرة فقال لنا عبد الله بن إبراهيم أشهد أني سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ فإني آخر الأنبياء وإنه آخر المساجد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 695,
			"arabicnumber": 695,
			"text": "أخبرنا قتيبة، عن مالك، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 696,
			"arabicnumber": 696,
			"text": "أخبرنا قتيبة، قال حدثنا سفيان، عن عمار الدهني، عن أبي سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إن قوائم منبري هذا رواتب في الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 697,
			"arabicnumber": 697,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن عمران بن أبي أنس، عن ابن أبي سعيد الخدري، عن أبيه، قال تمارى رجلان في المسجد الذي أسس على التقوى من أول يوم فقال رجل هو مسجد قباء وقال الآخر هو مسجد رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ هو مسجدي هذا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 698,
			"arabicnumber": 698,
			"text": "أخبرنا قتيبة، عن مالك، عن عبد الله بن دينار، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يأتي قباء راكبا وماشيا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 699,
			"arabicnumber": 699,
			"text": "أخبرنا قتيبة، قال حدثنا مجمع بن يعقوب، عن محمد بن سليمان الكرماني، قال سمعت أبا أمامة بن سهل بن حنيف، قال قال أبي قال رسول الله صلى الله عليه وسلم ‏ \"‏ من خرج حتى يأتي هذا المسجد مسجد قباء فصلى فيه كان له عدل عمرة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 700,
			"arabicnumber": 700,
			"text": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن الزهري، عن سعيد، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام ومسجدي هذا ومسجد الأقصى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 701,
			"arabicnumber": 701,
			"text": "أخبرنا هناد بن السري، عن ملازم، قال حدثني عبد الله بن بدر، عن قيس بن طلق، عن أبيه، طلق بن علي قال خرجنا وفدا إلى النبي صلى الله عليه وسلم فبايعناه وصلينا معه وأخبرناه أن بأرضنا بيعة لنا فاستوهبناه من فضل طهوره فدعا بماء فتوضأ وتمضمض ثم صبه في إداوة وأمرنا فقال ‏\"‏ اخرجوا فإذا أتيتم أرضكم فاكسروا بيعتكم وانضحوا مكانها بهذا الماء واتخذوها مسجدا ‏\"‏ ‏.‏ قلنا إن البلد بعيد والحر شديد والماء ينشف ‏.‏ فقال ‏\"‏ مدوه من الماء فإنه لا يزيده إلا طيبا ‏\"‏ ‏.‏ فخرجنا حتى قدمنا بلدنا فكسرنا بيعتنا ثم نضحنا مكانها واتخذناها مسجدا فنادينا فيه بالأذان ‏.‏ قال والراهب رجل من طيئ فلما سمع الأذان قال دعوة حق ‏.‏ ثم استقبل تلعة من تلاعنا فلم نره بعد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 702,
			"arabicnumber": 702,
			"text": "أخبرنا عمران بن موسى، قال حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال لما قدم رسول الله صلى الله عليه وسلم نزل في عرض المدينة في حى يقال لهم بنو عمرو بن عوف فأقام فيهم أربع عشرة ليلة ثم أرسل إلى ملإ من بني النجار فجاءوا متقلدي سيوفهم كأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته وأبو بكر - رضى الله عنه - رديفه وملأ من بني النجار حوله حتى ألقى بفناء أبي أيوب وكان يصلي حيث أدركته الصلاة فيصلي في مرابض الغنم ثم أمر بالمسجد فأرسل إلى ملإ من بني النجار فجاءوا فقال ‏ \"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏ ‏.‏ قالوا والله لا نطلب ثمنه إلا إلى الله عز وجل ‏.‏ قال أنس وكانت فيه قبور المشركين وكانت فيه خرب وكان فيه نخل فأمر رسول الله صلى الله عليه وسلم بقبور المشركين فنبشت وبالنخل فقطعت وبالخرب فسويت فصفوا النخل قبلة المسجد وجعلوا عضادتيه الحجارة وجعلوا ينقلون الصخر وهم يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم لا خير إلا خير الآخرة فانصر الأنصار والمهاجرة",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 703,
			"arabicnumber": 703,
			"text": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن معمر، ويونس، قالا قال الزهري أخبرني عبيد الله بن عبد الله، أن عائشة، وابن، عباس قالا لما نزل برسول الله صلى الله عليه وسلم فطفق يطرح خميصة له على وجهه فإذا اغتم كشفها عن وجهه قال وهو كذلك ‏ \"‏ لعنة الله على اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 704,
			"arabicnumber": 704,
			"text": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى، قال حدثنا هشام بن عروة، قال حدثني أبي، عن عائشة، أن أم حبيبة، وأم سلمة ذكرتا كنيسة رأتاها بالحبشة فيها تصاوير فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أولئك إذا كان فيهم الرجل الصالح فمات بنوا على قبره مسجدا وصوروا تيك الصور أولئك شرار الخلق عند الله يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 705,
			"arabicnumber": 705,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا ابن أبي ذئب، قال حدثنا الأسود بن العلاء بن جارية الثقفي، عن أبي سلمة، - هو ابن عبد الرحمن - عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ حين يخرج الرجل من بيته إلى مسجده فرجل تكتب حسنة ورجل تمحو سيئة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "حدثنا إسحاق بن إبراهيم، قال أنبأنا سفيان، عن الزهري، عن سالم، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا استأذنت امرأة أحدكم إلى المسجد فلا يمنعها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": 707,
			"text": "أخبرنا إسحاق بن منصور، قال حدثنا يحيى، عن ابن جريج، قال حدثنا عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة ‏\"‏ ‏.‏ قال أول يوم ‏\"‏ الثوم ‏\"‏ ‏.‏ ثم قال ‏\"‏ الثوم والبصل والكراث فلا يقربنا في مساجدنا فإن الملائكة تتأذى مما يتأذى منه الإنس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن سعيد، قال حدثنا هشام، قال حدثنا قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، أن عمر بن الخطاب، قال إنكم أيها الناس تأكلون من شجرتين ما أراهما إلا خبيثتين هذا البصل والثوم ولقد رأيت نبي الله صلى الله عليه وسلم إذا وجد ريحهما من الرجل أمر به فأخرج إلى البقيع فمن أكلهما فليمتهما طبخا ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "أخبرنا أبو داود، قال حدثنا يعلى، قال حدثنا يحيى بن سعيد، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يعتكف صلى الصبح ثم دخل في المكان الذي يريد أن يعتكف فيه فأراد أن يعتكف العشر الأواخر من رمضان فأمر فضرب له خباء وأمرت حفصة فضرب لها خباء فلما رأت زينب خباءها أمرت فضرب لها خباء فلما رأى ذلك رسول الله صلى الله عليه وسلم قال ‏ \"‏ آلبر تردن ‏\"‏ ‏.‏ فلم يعتكف في رمضان واعتكف عشرا من شوال ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الله بن نمير، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت أصيب سعد يوم الخندق رماه رجل من قريش رمية في الأكحل فضرب عليه رسول الله صلى الله عليه وسلم خيمة في المسجد ليعوده من قريب ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": 711,
			"text": "أخبرنا قتيبة، قال حدثنا الليث، عن سعيد بن أبي سعيد، عن عمرو بن سليم الزرقي، أنه سمع أبا قتادة، يقول بينا نحن جلوس في المسجد إذ خرج علينا رسول الله صلى الله عليه وسلم يحمل أمامة بنت أبي العاص بن الربيع وأمها زينب بنت رسول الله صلى الله عليه وسلم وهي صبية يحملها فصلى رسول الله صلى الله عليه وسلم وهي على عاتقه يضعها إذا ركع ويعيدها إذا قام حتى قضى صلاته يفعل ذلك بها ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": 712,
			"text": "أخبرنا قتيبة، حدثنا الليث، عن سعيد بن أبي سعيد، أنه سمع أبا هريرة، يقول بعث رسول الله صلى الله عليه وسلم خيلا قبل نجد فجاءت برجل من بني حنيفة يقال له ثمامة بن أثال سيد أهل اليمامة فربط بسارية من سواري المسجد ‏.‏ مختصر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": 713,
			"text": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم طاف في حجة الوداع على بعير يستلم الركن بمحجن ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": 714,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أخبرني يحيى بن سعيد، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم نهى عن التحلق يوم الجمعة قبل الصلاة وعن الشراء والبيع في المسجد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": 715,
			"text": "أخبرنا قتيبة، قال حدثنا الليث بن سعد، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم نهى عن تناشد الأشعار في المسجد ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": 716,
			"text": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، قال مر عمر بحسان بن ثابت وهو ينشد في المسجد فلحظ إليه فقال قد أنشدت وفيه من هو خير منك ثم التفت إلى أبي هريرة فقال أسمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ أجب عني اللهم أيده بروح القدس ‏\"‏ ‏.‏ قال اللهم نعم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "أخبرنا محمد بن وهب، قال حدثنا محمد بن سلمة، عن أبي عبد الرحيم، قال حدثني زيد بن أبي أنيسة، عن أبي الزبير، عن جابر، قال جاء رجل ينشد ضالة في المسجد فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ لا وجدت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": 718,
			"text": "أخبرنا عبد الله بن محمد بن عبد الرحمن بن المسور الزهري، - بصري - ومحمد بن منصور قالا حدثنا سفيان، قال قلت لعمرو أسمعت جابرا يقول مر رجل بسهام في المسجد فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ خذ بنصالها ‏\"‏ ‏.‏ قال نعم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": 719,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، قال حدثنا الأعمش، عن إبراهيم، عن الأسود، قال دخلت أنا وعلقمة، على عبد الله بن مسعود فقال لنا أصلى هؤلاء قلنا لا ‏.‏ قال قوموا فصلوا ‏.‏ فذهبنا لنقوم خلفه فجعل أحدنا عن يمينه والآخر عن شماله فصلى بغير أذان ولا إقامة فجعل إذا ركع شبك بين أصابعه وجعلها بين ركبتيه وقال هكذا رأيت رسول الله صلى الله عليه وسلم فعل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، قال أنبأنا شعبة، عن سليمان، قال سمعت إبراهيم، عن علقمة، والأسود، عن عبد الله، فذكر نحوه ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": 721,
			"text": "أخبرنا قتيبة، عن مالك، عن ابن شهاب، عن عباد بن تميم، عن عمه، أنه رأى رسول الله صلى الله عليه وسلم مستلقيا في المسجد واضعا إحدى رجليه على الأخرى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": 722,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أنه كان ينام وهو شاب عزب لا أهل له على عهد رسول الله صلى الله عليه وسلم في مسجد النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": 723,
			"text": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ البصاق في المسجد خطيئة وكفارتها دفنها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "أخبرنا قتيبة، عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم رأى بصاقا في جدار القبلة فحكه ثم أقبل على الناس فقال ‏ \"‏ إذا كان أحدكم يصلي فلا يبصقن قبل وجهه فإن الله عز وجل قبل وجهه إذا صلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن حميد بن عبد الرحمن، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم رأى نخامة في قبلة المسجد فحكها بحصاة ونهى أن يبصق الرجل بين يديه أو عن يمينه وقال ‏ \"‏ يبصق عن يساره أو تحت قدمه اليسرى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثني منصور، عن ربعي، عن طارق بن عبد الله المحاربي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا كنت تصلي فلا تبزقن بين يديك ولا عن يمينك وابصق خلفك أو تلقاء شمالك إن كان فارغا وإلا فهكذا ‏\"‏ ‏.‏ وبزق تحت رجله ودلكه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": 727,
			"text": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن سعيد الجريري، عن أبي العلاء بن الشخير، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم تنخع فدلكه برجله اليسرى ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": 728,
			"text": "أخبرنا إسحاق بن إبراهيم، قال حدثنا عائذ بن حبيب، قال حدثنا حميد الطويل، عن أنس بن مالك، قال رأى رسول الله صلى الله عليه وسلم نخامة في قبلة المسجد فغضب حتى احمر وجهه فقامت امرأة من الأنصار فحكتها وجعلت مكانها خلوقا فقال رسول الله صلى الله عليه وسلم ‏ \"‏ ما أحسن هذا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": 729,
			"text": "أخبرنا سليمان بن عبيد الله الغيلاني، - بصري - قال حدثنا أبو عامر، قال حدثنا سليمان، عن ربيعة، عن عبد الملك بن سعيد، قال سمعت أبا حميد، وأبا، أسيد يقولان قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا دخل أحدكم المسجد فليقل اللهم افتح لي أبواب رحمتك وإذا خرج فليقل اللهم إني أسألك من فضلك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": 730,
			"text": "أخبرنا قتيبة، قال حدثنا مالك، عن عامر بن عبد الله بن الزبير، عن عمرو بن سليم، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا دخل أحدكم المسجد فليركع ركعتين قبل أن يجلس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "أخبرنا سليمان بن داود، قال حدثنا ابن وهب، عن يونس، قال ابن شهاب وأخبرني عبد الرحمن بن كعب بن مالك، أن عبد الله بن كعب، قال سمعت كعب بن مالك، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك قال وصبح رسول الله صلى الله عليه وسلم قادما وكان إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس فلما فعل ذلك جاءه المخلفون فطفقوا يعتذرون إليه ويحلفون له وكانوا بضعا وثمانين رجلا فقبل رسول الله صلى الله عليه وسلم علانيتهم وبايعهم واستغفر لهم ووكل سرائرهم إلى الله عز وجل حتى جئت فلما سلمت تبسم تبسم المغضب ثم قال ‏\"‏ تعال ‏\"‏ ‏.‏ فجئت حتى جلست بين يديه فقال لي ‏\"‏ ما خلفك ألم تكن ابتعت ظهرك ‏\"‏ ‏.‏ فقلت يا رسول الله إني والله لو جلست عند غيرك من أهل الدنيا لرأيت أني سأخرج من سخطه ولقد أعطيت جدلا ولكن والله لقد علمت لئن حدثتك اليوم حديث كذب لترضى به عني ليوشك أن الله عز وجل يسخطك على ولئن حدثتك حديث صدق تجد على فيه إني لأرجو فيه عفو الله والله ما كنت قط أقوى ولا أيسر مني حين تخلفت عنك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما هذا فقد صدق فقم حتى يقضي الله فيك ‏\"‏ ‏.‏ فقمت فمضيت ‏.‏ مختصر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": 732,
			"text": "أخبرنا محمد بن عبد الله بن عبد الحكم بن أعين، قال حدثنا شعيب، قال حدثنا الليث، قال حدثنا خالد، عن ابن أبي هلال، قال أخبرني مروان بن عثمان، أن عبيد بن حنين، أخبره عن أبي سعيد بن المعلى، قال كنا نغدو إلى السوق على عهد رسول الله صلى الله عليه وسلم فنمر على المسجد فنصلي فيه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": 733,
			"text": "أخبرنا قتيبة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الملائكة تصلي على أحدكم ما دام في مصلاه الذي صلى فيه ما لم يحدث اللهم اغفر له اللهم ارحمه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": 734,
			"text": "أخبرنا قتيبة، قال حدثنا بكر بن مضر، عن عياش بن عقبة، أن يحيى بن ميمون، حدثه قال سمعت سهلا الساعدي، - رضى الله عنه - يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من كان في المسجد ينتظر الصلاة فهو فى الصلاة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 735,
			"arabicnumber": 735,
			"text": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن أشعث، عن الحسن، عن عبد الله بن مغفل، أن رسول الله صلى الله عليه وسلم نهى عن الصلاة في أعطان الإبل ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": 736,
			"text": "أخبرنا الحسن بن إسماعيل بن سليمان، قال حدثنا هشيم، قال حدثنا سيار، عن يزيد الفقير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ جعلت لي الأرض مسجدا وطهورا أينما أدرك رجل من أمتي الصلاة صلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": 737,
			"text": "أخبرنا سعيد بن يحيى بن سعيد الأموي، قال حدثنا أبي قال، حدثنا يحيى بن سعيد، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن أم سليم، سألت رسول الله صلى الله عليه وسلم أن يأتيها فيصلي في بيتها فتتخذه مصلى فأتاها فعمدت إلى حصير فنضحته بماء فصلى عليه وصلوا معه ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": 738,
			"text": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن سليمان، - يعني الشيباني - عن عبد الله بن شداد، عن ميمونة، أن رسول الله صلى الله عليه وسلم كان يصلي على الخمرة ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": 739,
			"text": "أخبرنا قتيبة، قال حدثنا يعقوب بن عبد الرحمن، قال حدثني أبو حازم بن دينار، أن رجالا، أتوا سهل بن سعد الساعدي وقد امتروا في المنبر مم عوده فسألوه عن ذلك فقال والله إني لأعرف مم هو ولقد رأيته أول يوم وضع وأول يوم جلس عليه رسول الله صلى الله عليه وسلم أرسل رسول الله صلى الله عليه وسلم إلى فلانة امرأة قد سماها سهل ‏\"‏ أن مري غلامك النجار أن يعمل لي أعوادا أجلس عليهن إذا كلمت الناس ‏\"‏ ‏.‏ فأمرته فعملها من طرفاء الغابة ثم جاء بها فأرسلت إلى رسول الله صلى الله عليه وسلم فأمر بها فوضعت ها هنا ثم رأيت رسول الله صلى الله عليه وسلم رقي فصلى عليها وكبر وهو عليها ثم ركع وهو عليها ثم نزل القهقرى فسجد في أصل المنبر ثم عاد فلما فرغ أقبل على الناس فقال ‏\"‏ يا أيها الناس إنما صنعت هذا لتأتموا بي ولتعلموا صلاتي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": 740,
			"text": "أخبرنا قتيبة بن سعيد، عن مالك، عن عمرو بن يحيى، عن سعيد بن يسار، عن ابن عمر، قال رأيت رسول الله صلى الله عليه وسلم يصلي على حمار وهو متوجه إلى خيبر ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": 741,
			"text": "أخبرنا محمد بن منصور، قال حدثنا إسماعيل بن عمر، قال حدثنا داود بن قيس، عن محمد بن عجلان، عن يحيى بن سعيد، عن أنس بن مالك، أنه رأى رسول الله صلى الله عليه وسلم يصلي على حمار وهو راكب إلى خيبر والقبلة خلفه ‏.‏ قال أبو عبد الرحمن لا نعلم أحدا تابع عمرو بن يحيى على قوله يصلي على حمار وحديث يحيى بن سعيد عن أنس الصواب موقوف والله سبحانه وتعالى أعلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		}
	]
}