{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] bahwa [Sahl bin Sa'id As Sa'idi] mengabarkan kepadanya, bahwa 'Uwaimir Al 'Ajlani menemui 'Ashim bin 'Adi Al Anshari dan berkata; \"Wahai 'Ashim, bagaimana pendapatmu jika ada seorang laki-laki mendapati isterinya berselingkuh dengan lelaki lain. apakah ia boleh membunuhnya sehingga mereka membunuhnya (sebagai qishah) . Atau apa yang harus dilakukannya? Wahai 'Ashim, tolong tanyakan hal ini kepada Rasulullah shallallahu 'alaihi wasallam.\" 'Ashim lalu menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, tapi beliau malah membenci pertanyaan tersebut dan mencelanya sehingga apa yang didengarnya dari Rasulullah shallallahu 'alaihi wasallam membuatnya semakin berat. Ketika 'Ashim pulang kepada isterinya, Uwaimir menemuinya dan bertanya; \"Wahai 'Ashim, apa jawaban Rasulullah shallallahu 'alaihi wasallam kepadamu?\" 'Ashim menjawab; \"Tidak ada yang baik, bahkan beliau malah membenci pertanyaan yang saya lontarkan kepada beliau.\" 'Uwaimir berkata; \"Demi Allah, saya tidak akan puas sampai saya menanyakan sendiri kepada beliau! \" Kemudian Uwaimir segera beranjak menemui Rasulullah shallallahu 'alaihi wasallam yang sedang berada di tengah-tengah kerumunan orang-orang. Ia lalu bertanya; \"Wahai Rasulullah, bagaimana pendapat anda, jika ada seorang suami yang mendapati isterinya berselingkuh dengan lelaki lain. Bolehkah dia membunuhnya, sehingga keluarga iipihak isteri membujuhnya sebagai qishah, atau bagaimana?\" Rasulullah shallallahu 'alaihi wasallam lantas menjawab; \"Telah diturunkan ayat yang berkenaan dengan dirimu dan isterimu. Maka pergi dan bawalah isterimu kemari.\" Sahl berkata; \"Mereka berdua akhirnya saling melaknat, sementara aku bersama orang-orang berada di sisi Rasulullah shallallahu 'alaihi wasallam. Ketika mereka selesai dari mula'anah (saling laknat), Uwaimir pun berkata, \"Wahai Rasulullah, saya telah berbohong atasnya jika saya tetap mempertahankannya.\" Uwaimi lalu menjatuhkan talak tiga kali kepada isterinya sebelum Rasulullah shallallahu 'alaihi wasallam memerintahkannya.\" Malik berkata; Ibnu Syihab berkata, \"Peristiwa itu terjadi setelah turun wahyu tentang bermula'anah (saling laknat bahwa dirinya tidak berzina)",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1188
			}
		}
	]
}