{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"32": "Qirad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1386,
			"arabicnumber": 1386,
			"text": "Telah menceritakan kepadaku Malik dari [Zaid bin Aslam] dari [Bapaknya] ia berkata; \"Abdullah dan Ubaidullah, keduanya anak Umar bin Khattab, pernah bergabung dalam sebuah pasukan menuju Irak. Tatkala kembali, mereka berdua melewati Abu Musa Al Asy'ari yang pada saat itu menjadi gubernur Bashrah. Abu Musa kemudian menyambut keduanya dengan senang hati seraya berkata; \"Sekiranya aku bisa memberikan sesuatu yang dapat bermanfaat kepada kalian di hari kemudian, niscaya akan aku lakukan.\" [Abu Musa] berkata lagi, \"Oh ya, ini ada harta dari harta Allah, saya ingin menyerahkannya kepada Amirul Mukminin, saya pinjamkan harta ini kepada kalian berdua sehingga kalian bisa berbelanja barang dagangan di Irak dan menjualnya kembali sesampai di Madinah. Nanti serahkanlah modalnya kepada Amirul Mukiminin, dan keuntungannya untuk kalian berdua. Mereka berdua berkata; 'Kami senang dengan hal itu.' Maka Abu Musa melakukannya dan menulis pesan untuk Amirul Mukminin agar dia mengambil harta darinya yang dititipkan kepada kedua anaknya. Tatkala mereka berdua tiba (di Madinah) mereka menjual dagangannya hingga mendapatkan keuntungan. Namun tatkala hendak menyerahkan harta tersebut kepada 'Umar, Umar bertanya; 'Apakah Abu Musa meminjami setiap pasukan sebagaimana dia meminjamkannya kepada kalian berdua? ' Mereka berdua menjawab; 'Tidak'. [Umar bin Khattab] berkata; 'Jadi karena kalian anak dari Amirul Mukminin sehingga dia meminjamkannya?! Serahkan semua harta serta keuntungannya! ' Mendengar hal itu, Abdullah hanya bisa diam. Sedangkan Ubaidullah berkata; 'Tidak sepatutnya engkau bersikap demikian, wahai Amirul Mukminin, bukankah jika harta itu berkurang atau hilang, kami harus menanggungnya? ' Umar masih bersikukuh; 'Serahkan, ' Abdullah juga masih terus diam, sedang Ubaidullah masih terus berusaha mendesaknya. Lalu ada seorang lelaki yang berada di majelis itu berusaha untuk menengahi dan berkata; 'Wahai Amirul Mukminin, bagaimana jika harta itu engkau pinjamkan kepada mereka berdua? ' 'Aku telah meminjamkannya kepada mereka berdua', jawab Umar bin Khattab. Kemudian Umar mengambil harta itu ditambah setengah dari keuntungan, sedang Abdullah dan Ubaidullah juga mendapat setengah dari keuntungan",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 1386
			}
		}
	]
}