{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"44": "The Oath of Qasama"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1596,
			"arabicnumber": 1596,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Laila bin Abdullah bin Abdurrahman bin Sahl] dari [Sahl bin Abu Hatsmah] bahwa ada beberapa orang petinggi kaumnya mengabarkan kepadanya, bahwa Abdullah bin Sahl dan Muhayyishah berangkat ke Khaibar karena sebab kesengsaraan yang menimpa mereka. Lalu seseorang menemui Muhayyishah dan mengabarkan bahwa Abdullah bin Sahl telah dibunuh dan dibuang di samping sumur atau mata air. Muhayyishah kemudian menemui orang-orang Yahudi dan berkata; \"Demi Allah, kalianlah yang telah membunuhnya! \" Mereka menjawab; \"Demi Allah, kami tidak membunuhnya.\" Muhayyishah kemudian pergi mendatangi kaumnya, lantas dia mengabarkan perihal pembunuhan itu kepada mereka. Kemudian ia pergi bersama saudaranya, Huwaishah yang lebih besar darinya, dan Abdurrahman. Muhaiyishah lalu pergi untuk membicarakan hal itu, karena dialah yang di Khaibar. Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Yang besar, yang besar! \" -maksudnya orang yang umurnya lebih tua-. Akhirnya Huwaishah berbicara dan dibantu oleh Muhaiyishah. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka membayar diat untuk saudara kalian, atau mereka mengumumkan perang.\" Rasulullah shallallahu 'alaihi wasallam kemudian menulis surat kepada mereka tentang persoalan tersebut. Lalu orang-orang Yahudi membalas surat tersebut, \"Demi Allah, kami tidak membunuhnya.\" Rasulullah shallallahu 'alaihi wasallam bertanya kepada Huwaishah, Muhaiyishah dan Abdurrahman: \"Apakah kalian mau bersumpah sehingga kalian berhak atas darah teman kalian, \" Mereka menjawab; \"Tidak.\" Beliau bertanya: \"Apakah orang-orang Yahudi itu saja yang bersumpah untuk kalian?\" Mereka menjawab; \"Mereka itu bukan orang Islam.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam membayar diyat dari harta beliau, dan beliau mengirimkan kepada mereka seratus unta sehingga mereka memasukkan ke rumah mereka. Sahl berkata; \"Sampai ada seekor unta merah yang menendangku.\" Malik berkata; \"Al Faqir adalah sumur",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 1596
			}
		}
	]
}