{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"54": "General Subjects"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1765,
			"arabicnumber": 1765,
			"text": "Telah menceritakan kepadaku Malik dari [Rabi'ah bin Abu Abdurrahman] dari [lebih dari satu ulama mereka] bahwa [Abu Musa Al Asy'ari] datang meminta izin kepada Umar bin Khattab, lalu ia mengucapkan salam hingga tiga kali, setelah itu ia kembali pulang. Umar bin Khattab mengutus seseorang untuk mengejarnya. Umar bertanya; \"Kenapa kamu tidak masuk?\" Abu Musa Al Asy'ari menjawab; \"Aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Minta izin itu tiga kali. Jika kamu diizinkan, masuklah. Jika tidak, maka pulanglah'! \" Lalu Umar bin Khattab berkata; \"Selain engkau siapa yang tahu tentang hadits ini? Jika engkau tidak mendatangkannya kepadaku, maka aku akan melakukan ini dan itu terhadapmu.\" Kemudian Abu Musa keluar hingga mendapatkan suatu majlis di dalam masjid yang disebut majlis Anshar. Dia berkata; \"Aku telah mengabari Umar bin Khattab bahwa aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Minta izin itu tiga kali, jika engkau diizinkan maka masuklah, namun jika tidak maka pulanglah.' lalu Umar berkata; 'Kalau engkau tidak mendatangkan kepadaku siapa saja yang mengetahui hal ini, maka aku akan melakukan begini dan begitu. Maka jika salah seorang di antara kalian pernah mendengarnya, ikutlah denganku.\" Orang-orang lalu berkata kepada [Abu Sa'id Al Khudri]; \"Ikutlah bersamanya! \" ketika itu Abu Sa'id Al Khudri adalah orang yang termuda di antara mereka, maka ia pun pergi bersama Abu Musa dan memberi kesaksian kepada Umar bin Khattab. Kemudian Umar bin Khattab berkata kepada Abu Musa; \"Aku tidak meragukanmu, hanya saja aku khawatir jika manusia membuat-buat ucapan (yang dinisbatkan) atas Rasulullah shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1765
			}
		}
	]
}