{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"12": "The Eclipse Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Atha` bin Yasar] dari [Abdullah bin Abbas] bahwa dia berkata; \"Telah terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam. Beliau lalu shalat dan orang-orang ikut bersamanya. Beliau berdiri dalam waktu yang panjang seperti panjangnya bacaan surat Al Baqarah.\" Ibnu Abbas berkata; \"Kemudian beliau rukuk dengan rukuk yang panjang, lalu beliau bangkit dari rukuk. Beliau berdir bangun dengan berdiri yang panjang, namun tidak sepanjang yang pertama. Kemudian beliau rukuk dengan rukuk yang panjang, namun tidak sepanjang rukuk yang sebelumnya. Kemudian beliau bersujud, lalu berdiri lama namun tidak selama berdirinya yang pertama. Kemudian beliau rukuk dengan panjang namun tidak selama rukuk yang pertama. Beliau bangkit dari rukuk dan berdiri dengan panjang, namun tidak sepanjang yang pertama. Kemudian rukuk dengan rukuk yang panjang, namun tidak sepanjang rukuk yang sebelumnya. Setelah itu sujud dan berlalu pergi (selesai) . Sementara matahari sudah mulai nampak, beliau kemudian bersabda: \"Matahari dan bulan adalah dua tanda dari tanda-tanda Kebesaran Allah. Terjadinya gerhana pada keduanya bukan karena kematian atau hidupnya seseorang. Jika kalian melihat itu, maka berdzikirlah kepada Allah\" Mereka bertanya; \"Wahai Rasulullah! kami melihat anda menjulurkan tangan kepada sesuatu di tempat anda berdiri. Lalu kami melihat anda mundur ke belakang.\" Beliau menjawab: \"Saya telah melihat surga. Lalu saya meraih buah dari surga, sekiranya aku mengambilnya, niscaya kalian akan memakannya selama dunia masih ada. Saya juga melihat neraka, saya tidak pernah melihat pemandangan seperti itu. Dan saya lihat paling banyak penghuninya adalah para wanita.\" Mereka bertanya; \"Kenapa wahai Rasulullah! \" beliau menjawab: \"Karena keingkaran mereka.\" Mereka bertanya: \"Apakah karena mereka ingkar terhadap Allah?\" beliau menjawab; \"Mereka ingkar terhadap suami dan ingkar terhadap kebaikan. Jika kamu berbuat kepadanya dalam waktu yang lama, lalu mereka melihat sesuatu darimu, dia berkata; 'Saya tidak pernah melihat kebaikanmu sedikitpun",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 446
			}
		}
	]
}