{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"16": "Burials"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Abdullah bin Jabir bin 'Atik] dari ['Atik bin Al Harits] yaitu kakek Abdullah bin Abdullah bin Jabir, bapak dari ibunya, mengabarkan kepadanya bahwa [Jabir bin 'Atik] mengabarkan, bahwa Rasulullah shallallahu 'alaihi wasallam pernah menjenguk Abdullah bin Tsabit. Beliau mendapatinya sedang sekarat. Beliau memanggilnya, namun dia tidak menjawab. Rasulullah shallallahu 'alaihi wasallam membaca istirja' dan bersabda: \"Engkau telah mendahului kami wahai Abu Ar Rabi'.\" Para wanita pun berteriak dan menangis, sementara Jabir berusaha mendiamkan mereka. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Biarkan saja mereka. Jika itu harus terjadi, janganlah ada seorangpun yang menangisinya.\" Orang-orang bertanya, \"Wahai Rasulullah, yang harus terjadi itu apa?\" beliau menjawab; \"Jika ia meninggal.\" Anak perempuannya berkata, \"Demi Allah, aku berharap dia mati syahid. Sekarang engkau telah menyelesaikan tugasmu.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah telah memberikan pahalanya sesuai dengan niatnya. Apa yang kalian sebut sebagai syahid?\" Mereka menjawab; \"Terbunuh di jalan Allah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Syahid selain terbunuh di jalan Allah itu ada tujuh macam; yang meninggal karena penyakit tha'un maka dia syahid. Orang yang meninggal karena tenggelam maka dia syahid. Orang yang meninggal karena terkena penyakit cacar atau bisul maka dia syahid. Orang yang meninggal karena sakit perut maka dia syahid. Orang yang mati terbakar adalah syahid. Orang yang meninggal karena terkena reruntuhan, maka dia syahid. Wanita yang meninggal karena karena melahirkan maka dia adalah syahid",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 555
			}
		}
	]
}