{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"16": "Burials"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Said] dari [Al Qasim bin Muhammad] bahwa dia berkata, \"Isteriku meninggal dunia. Lalu [Muhammad bin Ka'b Al Qurazhi] berta'ziyah kepadaku dan dia bercerita; 'Dulu di kalangan Bani Isra`il ada seorang laki-laki yang faqih, 'alim, 'abid dan mujtahid. Dia mempunyai seorang isteri yang dia cintai dan dia kagumi. Suatu ketika isterinya meninggal dunia, sehingga dia sangat terpukul dan sedih. Dia mengurung dirinya dan mengasingkan diri dari manusia. Tidak seorangpun yang masuk menemuinya. Lalu ada seorang wanita yang mendengar peristiwa tersebut, lalu wanita itu mendatanginya. Wanita itu berkata, \"Aku ada perlu dengannya. Aku ingin meminta fatwanya. Aku tidak akan pernah puas hingga berbicara dengannya secara langsung.\" Orang-orang pun pergi meninggalkannya, namun dia tetap berada di depan pintu menunggunya dan berkata, \"Aku tidak akan pergi sama sekali.\" Ada seseorang yang berkata pada orang bani Isra`il tersebut; \"Di sini ada seorang wanita yang ingin meminta fatwamu, dan dia berkata, \"Aku tidak mau kecuali berbicara dengannya secara langsung.\" Orang-orang telah pergi meninggalkannya, sedang dia tetap tidak meninggalkan pintu rumahmu. Orang tersebut berkata, \"Ijinkan dia masuk.\" Wanita itupun masuk dan berkata, \"Aku menemuimu untuk meminta fatwa atas suatu urusan.\" Orang itupun bertanya, \"Apa itu?\" Wanita tersebut berkata, \"Aku meminjam perhiasan dari tetanggaku. Aku pun mengenakannya dan meminjamnya untuk beberapa waktu. Kemudian mereka mengutus utusan kepadaku untuk memintanya, apakah aku harus mengembalikannya?\" Orang tersebut menjawab, \"Ya.\" Wanita itu berkata lagi; \"Demi Allah aku telah memakainya beberapa waktu.\" Orang tersebut berkata, \"Begitulah, mereka berhak untuk menariknya kembali darimu setelah meminjamkannya padamu beberapa waktu.\" Wanita itu berkata, \"Baiklah, semoga Allah merahmatimu. Apakah engkau juga tidak rela atas apa yang dipinjamkan Allah padamu, lalu Dia mengambilnya kembali. Padahal Dia lebih berhak atasnya dari dirimu.\" Maka sadarlah orang tersebut atas apa yang telah terjadi. Allah memberikan manfaat atasnya dengan perkataan wanita tersebut",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 562
			}
		}
	]
}