{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"21": "Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "Telah menceritakan kepadaku Yahya dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam pergi ke Quba, beliau menemui Ummu Haram binti Milhan, lalu Ummu Haram menyuguhi beliau makanan, Ummu Haram adalah isteri 'Ubadah bin Shamit. Pada suatu hari Rasulullah shallallahu 'alaihi wasallam menemuinya, lalu ia memberi makanan kepada beliau. Ummu Haram kemudian duduk menyangga kepala Rasulullah shallallahu 'alaihi wasallam hingga beliau tertidur. Kemudian beliau bangun sambil tertawa, Ummu Haram berkata, \"Aku lalu bertanya, \"Wahai Rasulullah, apa yang membuat anda tertawa?\" Beliau menjawab: \"Telah diperlihatkan kepadaku beberapa orang dari umatku yang berperang di jalan Allah, mereka unggul di atas lautan laksana para raja di atas dipan.\" atau \"Seperti raja-raja di atas dipan.\" -Ishaq ragu akan hal ini- Ummu Haram berkata; \"Aku lalu bertanya kepada Rasulullah, 'Wahai Rasulullah, doakanlah agar aku termasuk dari mereka.\" Beliau lantas mendoakan Ummu Haram dan kembali melerakkan kepalanya untuk tidur. Kemudian beliau bangun dan tertawa, Ummu Haram bertanya, \"Wahai Rasulullah, apa yang membuat anda tertawa?\" beliau menjawab; \"Telah diperlihatkan kepadaku sekelompok orang dari umatku yang berjuang di jalan Allah, mereka seperti para raja di atas dipan.\" atau \"Seperti raja-raja yang berada di atas dipan…sebagaimana yang disabdakan pertama tadi. Ummu Haram berkata; \"Wahai Rasulullah, berdoalah agar aku termasuk dari mereka.\" Beliau bersabda: \"Kamu termasuk orang-orang yang pertama dari mereka.\" Anas bin Malik berkata; \"Ummu Haram mengarungi lautan pada masa Mu'awiyah, lalu ketika hendak menepi ke pantai, dia terlempar dari kendaraannya dan meninggal dunia",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 996
			}
		}
	]
}