{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1040,
			"arabicnumber": "465.01",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: முஆத் பின் ஜபல் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுடன் தொழுதுவிட்டுப் பிறகு (தம் கூட்டத்தாரிடம்) திரும்பிச் சென்று (நபி (ஸல்) அவர்களுக்குப் பின்னால் தொழுத தொழுகையை மீண்டும்) தம் கூட்டத்தாருக்குத் தொழுவிப்பார்கள். ஒரு நாள் இரவில் முஆத் (ரலி) அவர்கள் நபி (ஸல்) அவர்களுடன் இஷாத் தொழுது விட்டுத் தம் கூட்டத்தாரிடம் திரும்பிச் சென்று அவர்களுக்கு (அதே இஷாவை)த் தொழுவித்தார்கள்.அதில் (பெரிய அத்தியாயமான) அல்பகராஎனும் (2ஆவது) அத்தியாயத்தை ஓத ஆரம்பித்தார்கள். அப்போது ஒரு மனிதர் (தொழுகையிலிருந்து) விலகி சலாம் கொடுத்தார். பின்னர் தனியாகத் தொழுதுவிட்டுத் திரும்பிச் சென்றுவிட்டார். மக்கள் அவரிடம், இன்னாரே, நீர் நயவஞ்சகர் (முனாஃபிக்) ஆகிவிட்டீரா? என்று கேட்டார்கள். அதற்கு அந்த மனிதர், இல்லை. அல்லாஹ்வின் மீது சத்தியமாக! (நான் நயவஞ்சகன் அல்லன்). நிச்சயம் நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று (இது குறித்து) தெரிவிப்பேன் எனக் கூறினார். அவ்வாறே அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, அல்லாஹ்வின் தூதரே! நாங்கள் பகல் வேளைகளில் வேலைவெட்டிகளில் ஈடுபடுகின்றவர்கள். நாங்கள் ஒட்டகங்கள் மூலம் தண்ணீர் பாய்ச்சுவோம். இந்நிலையில் முஆத் பின் ஜபல் அவர்கள் (நேற்றிரவு) உங்களுடன் இஷாத் தொழுதுவிட்டு வந்து (எங்களுக்குத் தொழுவித்தார். அதில் பெரிய அத்தியாயமான) அல்பகரா அத்தியாயத்தை ஓதலானார். (எனவேதான் விலகிச் சென்று தனியாகத் தொழுதேன்) என்று கூறினார். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முஆத் (ரலி) அவர்களை நோக்கித் திரும்பி, முஆதே! (நீரென்ன) குழப்பவாதியா? என்று கேட்டுவிட்டு, (நீர் மக்களுக்குத் தலைமை தாங்கித் தொழுவிக்கும் போது சற்று சிறிய அத்தியாயமான) இன்ன அத்தியாயத்தை ஓதுவீராக; இன்ன அத்தியாயத்தை ஓதுவீராக என்று சொன்னார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகின்றார்கள்: நான் (இந்த ஹதீஸை எனக்கு அறிவித்த) அம்ர் பின் தீனார் (ரஹ்) அவர்களிடம், (நபி (ஸல்) அவர்கள் முஆத் (ரலி) அவர்களிடம்) வஷ்ஷம்ஸி வ ளுஹாஹா, வள்ளுஹா வல்லைலி, வல்லைலி இதா யஃக்ஷா, சப்பிஹிஸ்ம ரப்பிக்கல் அஃலா ஆகிய (முறையே 91, 93,92,87ஆவது) அத்தியாயங்களை ஓதுவிராக என்று கூறியதாக ஜாபிர் (ரலி) அவர்களிடமிருந்து அபுஸ்ஸுபைர் (ரஹ்) அவர்கள் எமக்கு அறிவித்தார்களே? என்று கேட்டேன். அதற்கு அம்ர் பின் தீனார் (ரஹ்) அவர்கள், (ஆம்) இது போன்றுதான் (அறிவித்தார்கள்) என்றார்கள். அத்தியாயம் : 4",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 202
			}
		}
	]
}