{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1173,
			"arabicnumber": "524.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பிறந்தகத்தைத் துறந்து) மதீனாவுக்கு வந்தபோது மதீனாவின் மேட்டுப்பாங்கான பகுதியில் இறங்கி, \"பனூ அம்ர் பின் அவ்ஃப்\" என்றழைக்கப்பட்டுவந்த ஒரு குடும்பத்தாரிடையே பதிநான்கு நாட்கள் தங்கினார்கள். பிறகு பனூ நஜ்ஜார் கூட்டத்தாருக்கு (அவர்களை அழைத்து வருமாறு) ஆளனுப்பினார்கள். பனூநஜ்ஜார் கூட்டத்தார் (நபியவர்களை வரவேற்கும் முகமாகத்) தம் வாட்களை (கழுத்தில்) தொங்கவிட்டபடி வந்தனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது வாகன(ஒட்டக)த்தில் அமர்ந்திருக்க, அவர்களுக்குப் பின்னால் அபூபக்ர் (ரலி) அவர்கள் அமர்ந்திருக்க, பனூநஜ்ஜார் கூட்டத்தார் புடைசூழ அவர்களைக் குழுமியிருந்த காட்சியை இப்போதும் நான் காண்பதைப் போன்றுள்ளது. இறுதியில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது வாகனம் அபூஅய்யூப் (ரலி) அவர்களின் வீட்டு முற்றத்தில் அவர்களை இறக்கிவிட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகை நேரம் வந்தடையும் இடத்திலேயே தொழுகையை நிறைவேற்றுவார்கள்; ஆட்டுத் தொழுவங்களிலும் தொழுவார்கள். (இது அவர்களது வழக்கமாக இருந்தது.) இந்நிலையில்தான், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பள்ளிவாசல் கட்டும்படி உத்தரவிட்டார்கள். பனூநஜ்ஜார் கூட்டத்தாரை (அழைத்துவரச் சொல்லி) ஆளனுப்பினார்கள். அவர்கள் வந்தபோது, \"பனூநஜ்ஜார் கூட்டத்தாரே! உங்களுடைய இந்தத் தோட்டத்தை எனக்கு விலைபேசி (விற்று)விடுங்கள்\" என்று கேட்டார்கள். அதற்கு அக்கூட்டத்தார், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! இதற்கான விலையை நாங்கள் அல்லாஹ்விடமே கோருவோம்\" என்று கூறி (அத்தோட்டத்தை அளித்த)னர். நான் (உங்களிடம்) கூறவிருப்பவைதாம் அத்தோட்டத்தில் இருந்தன: அதில் சில பேரீச்ச மரங்கள்,இணைவைப்பாளர்களின் சமாதிகள், இடிபாடுகள் ஆகியவைதாம் இருந்தன. எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பள்ளிவாசல் கட்டும்போது அங்கிருந்த) பேரீச்ச மரங்களை வெட்டும்படி உத்தரவிட, அவ்வாறே அவை வெட்டப்பட்டன. இணை வைப்பாளர்களின் சமாதிகளைத் தோண்டி (அப்புறப் படுத்தி)டுமாறு உத்தரவிட அவ்வாறே அவை தோண்டப்பட்டன. இடிபாடுகளை (அகற்றி)ச் சமப்படுத்தும்படி உத்தரவிட அவ்வாறே அவை சமப்படுத்தப்பட்டன. பள்ளிவாசலின் கிப்லாத் திசையில் பேரீச்ச மரங்களை வரிசையாக நட்டனர். பள்ளிவாசலின் (நுழைவாயிலின்) இரு நிலைக்கால்களாகக் கல்லை (நட்டு) வைத்தனர். அப்போது \"ரஜ்ஸ்” எனும் ஒருவித யாப்பு வகைப் பாடலை பாடிக்கொண்டிருந்தனர். அவர்களுடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் (பாடியபடி பணியில் ஈடுபட்டு) இருந்தார்கள். \"இறைவா! மறுமையின் நன்மையைத் தவிர வேறு நன்மை கிடையாது; ஆகவே, (மறுமையின் நன்மைகளுக்காகப் பாடுபடும்) அன்சாரிகளுக்கும் முஹாஜிர்களுக்கும் நீ உதவி செய்வாயாக!” என்று அவர்கள் பாடினர். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 5",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		}
	]
}