{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1199,
			"arabicnumber": "537.01",
			"text": "முஆவியா பின் அல்ஹகம் அஸ்ஸுலமீ (ரலி) அவர்கள் கூறியதாவது: நான் (ஒரு நாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தொழுதுகொண்டிருந்தேன். அப்போது (தொழுதுகொண்டிருந்த) மக்களில் ஒருவர் தும்மினார். உடனே நான் \"யர்ஹமுக் கல்லாஹ்” (அல்லாஹ் உங்களுக்குக் கருணை புரிவானாக) என்று (மறுமொழி) கூறினேன். உடனே மக்கள் என்னை வெறித்துப் பார்த்தனர். நான் \"என்னை என் தாய் இழக்கட்டும்! நீங்கள் ஏன் என்னை இவ்வாறு பார்க்கிறீர்கள்?\" என்று கேட்டேன். மக்கள் (பதிலேதும் கூறாமல்) தங்கள் கைகளால் தொடைகள் மீது தட்டினர். என்னை அவர்கள் அமைதியாக இருக்கச் சொல்கிறார்கள் என்று நான் அறிந்துகொண்டு அமைதியாகி விட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுது முடித்ததும் என் தந்தையும் என் தாயும் நபியவர்களுக்கு அர்ப்பணமாகட்டும்- (பின்வருமாறு அறிவுரை) கூறினார்கள். அவர்களுக்கு முன்னரோ பின்னரோ அவர்களைவிட மிக அழகிய முறையில் கற்பிக்கும் ஆசிரியர் ஒருவரை நான் (என் வாழ்நாளில்) கண்டதேயில்லை. அல்லாஹ்வின் மீதாணையாக! அவர்கள் என்னைக் கண்டிக்கவுமில்லை; அடிக்கவுமில்லை; திட்டவுமில்லை. (மாறாக,) அவர்கள், \"இந்தத் தொழுகையானது, மக்களின் பேச்சுகளுக்கு உரிய நேரமன்று. தொழுகை என்பது இறைவனைத் துதிப்பதும் பெருமைப்படுத்துவதும் குர்ஆன் ஓதுவதுமாகும்\" என்றோ அல்லது இதைப் போன்றோ சொன்னார்கள். நான், \"அல்லாஹ்வின் தூதரே! நான் அறியாமைக் காலத்திற்கு நெருக்கமானவன். அல்லாஹ் இந்த இஸ்லாத்தை வழங்கினான். எங்களில் சிலர் சோதிடர்களிடம் செல்கிறார்களே?\" என்றேன். அதற்கு அவர்கள் \"சோதிடர்களிடம் நீங்கள் செல்லாதீர்கள்\" என்றார்கள். நான் \"எங்களில் இன்னும் சிலர் பறவையை வைத்துக் குறி பார்க்கிறார்களே?\" என்றேன். அதற்கு நபியவர்கள் \"இது, மக்கள் தம் உள்ளங்களில் காணும் (ஐதீகம் சார்ந்த) விஷயமாகும். ஆனால், இது \"அவர்களை\" அல்லது \"உங்களை\" (செயலாற்றுவதிலிருந்து) தடுத்திட வேண்டாம்\" என்று கூறினார்கள். நான், \"எங்களில் இன்னும் சிலர் (நற்குறி அறிய மணலில்) கோடு வரை(யும் பழங்கால கணிப்பு முறையை மேற்கொள்)கின்றனர்\" என்றேன். அதற்கு அவர்கள், \"நபிமார்களில் ஒருவர் இவ்வாறு கோடு வரைந்துவந்தார். யார் அவரைப் போன்று கோடு வரைகிறாரோ அது (சாத்தியம்)தான்\" என்றார்கள். அடுத்து என்னிடம் ஓர் அடிமைப் பெண் இருந்தாள். அவள் என் ஆட்டு மந்தையை (மதீனாவிற்கு அருகிலுள்ள) உஹுத் மலை மற்றும் (அதையொட்டி அமைந்துள்ள) ஜவ்வானிய்யாப் பகுதியில் மேய்த்துவந்தாள். ஒரு நாள் நான் சென்று பார்த்தபோது ஓநாய் ஒன்று அவளிடமிருந்த ஆடுகளில் ஒன்றைக் கொண்டு சென்றுவிட்டது. (சராசரி) மனிதன் கோபப்படுவதைப் போன்று நானும் கோபப்பட்டேன். ஆயினும், அவளை நான் அறைந்துவிட்டேன். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றபோது அது குறித்து அவர்கள் என்னைக் கடுமையாகக் கண்டித்தார்கள். நான், \"அல்லாஹ்வின் தூதரே! நான் அவளை விடுதலை செய்துவிடட்டுமா?\" என்று கேட்டேன். அதற்கு அவர்கள், \"அந்தப் பெண்ணை என்னிடம் அழைத்துவாருங்கள்!\" என்று சொன்னார்கள். நான் அவளை அழைத்துச் சென்றபோது அவளிடம், \"அல்லாஹ் எங்கே இருக்கின்றான்?\" என்று நபியவர்கள் கேட்டார்கள். அவள், \"வானத்தில்” என்று பதிலளித்தாள். அவர்கள், \"நான் யார்?\" என்று கேட்டார்கள். அவள், \"நீங்கள் அல்லாஹ்வின் தூதர்\" என்றாள். அவர்கள் (என்னிடம்), \"அவளை விடுதலை செய்துவிடுங்கள்! ஏனெனில், அவள் இறைநம்பிக்கையுடைய (முஃமினான) பெண் ஆவாள்\" என்றார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 5",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		}
	]
}