{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1258,
			"arabicnumber": "567.01",
			"text": "மஅதான் பின் அபீதல்ஹா (ரஹ்) அவர்கள் கூறியதாவது: )கலீஃபா) உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் ஒரு வெள்ளிக் கிழமை (ஜுமுஆ) தினத்தன்று உரை நிகழ்த்தினார்கள். அவர்கள் (தமது உரையில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களையும் அபூபக்ர் (ரலி) அவர்களையும் நினைவுகூர்ந்தார்கள். மேலும், அவர்கள் (பின்வருமாறு) கூறினார்கள்: நான் (இன்று) ஒரு கோழி என்னை மூன்று முறை கொத்துவதைப் போன்று (கனவு) கண்டேன். இதற்கு என் ஆயுட்காலம் முடிந்துவிட்டது என்றே நான் (விளக்கம்) கண்டேன். மக்களில் சிலர் நான் (எனக்குப் பின்னால்) என் (ஆட்சிக்குப்) பிரதிநிதி (கலீஃபா) ஒருவரை அறிவிக்குமாறு கூறுகின்றனர். நிச்சயமாக அல்லாஹ் தனது மார்க்கத்தையோ, தன் (அடியார்களின்) ஆட்சித் தலைமையையோ, நபி (ஸல்) அவர்களை எதனுடன் அனுப்பிவைத்தானோ அதையோ பாழாக்கிவிடமாட்டான். எனக்கு ஏதேனும் நேர்ந்துவிட்டால் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எவரைக் குறித்து திருப்தியடைந்த நிலையில் இறந்தார்களோ அத்தகைய இந்த ஆறுபேர் ஆட்சித் தலைமை குறித்துத் தம்மிடையே கலந்தாலோசித்து முடிவு செய்வார்கள். சிலர் இந்த விஷயத்தில் என்னைக் குறை கூறிவருவது எனக்குத் தெரியும். நான் (சில நேரங்களில்) அவர்களை இஸ்லாத்திற்காக எனது இந்தக் கையால் அடித்திருக்கிறேன். அவர்கள் இவ்வாறு செய்(வதை மார்க்க அங்கீகாரமுடைய ஒரு செயலாக நினைத்)தால் அத்தகையோர்தாம் இறைவனின் விரோதிகளும் வழிகெட்ட இறைமறுப்பாளர்களும் ஆவர். நான் எனக்குப் பின்னால் \"கலாலா\"வைவிட ஒரு முக்கியமான விஷயத்தை விட்டுச் செல்லவில்லை. நான், இது குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் விவாதித்ததைப் போன்று வேறு எதற்காகவும் விவாதித்ததில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் இது தொடர்பாக என்னிடம் கடிந்துகொண்டதைப் போன்று வேறு எதற்காகவும் என்னிடம் கடிந்துகொண்டதில்லை. எந்த அளவிற்கு (அவர்கள் என்னைக் கடிந்துகொண்டார்கள்) எனில், அவர்கள் தமது விரலால் என் நெஞ்சில் குத்தினார்கள். \"உமரே! அந்நிஸா அத்தியாயத்தின் கடைசியிலுள்ள (4:176ஆவது) வசனம் உமக்குப் போதுமானதாக இல்லையா?\" என்று கேட்டார்கள். நான் இன்னும் (சிறிது காலம்) வாழ்ந்தால் இந்த \"கலாலா\" தொடர்பாகக் குர்ஆனைக் கற்றோரும் கல்லாதோரும் தீர்ப்பளிக்கும் விதத்தில் தெளிவான ஒரு தீர்ப்பை வழங்குவேன். பின்னர் (தொடர்ந்து) கூறினார்கள்: \"இறைவா! நகரங்களின் ஆளுநர்களுக்கு உன்னையே சாட்சியாக்குகிறேன். நான் அவர்களை அந்த மக்களிடையே நேர்மையாக நடந்துகொள்வதற்காகவும் அவர்களுடைய மார்க்கத்தையும் அவர்களுடைய நபி (ஸல்) அவர்களது வழிமுறையையும் கற்றுத் தருவதற்காகவுமே அனுப்பிவைத்தேன். மேலும், அவர்களுக்குப் போரிடாமல் கிடைத்த (\"ஃபய்உ\" எனும்) செல்வத்தை அவர்கள் தம்மிடையே (முறையோடு) பங்கிட வேண்டும்; அவர்களுடைய விவகாரங்களில் சிக்கல் எழும்போது அதை என் கவனத்திற்குக் கொண்டுவர வேண்டும் (என்றும் கூறி அனுப்பினேன்(. மக்களே! நீங்கள் இரு செடிகளிலிருந்து விளைகின்றவற்றைச் சாப்பிடுகிறீர்கள். அவ்விரண்டையும் நான் அருவருப்பானவையாகக் கருதுகிறேன். இந்த வெங்காயமும் வெள்ளைப் பூண்டுமே (அவை இரண்டுமாகும்). அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பள்ளிவாசலில் இருக்கும்போது ஒருவரிடமிருந்து அவற்றின் துர்வாடை வருவதைக் கண்டால், அவரை \"அல்பகீஉ\" பொது மையவாடிக்குக் கொண்டுபோய் விட்டுவிட்டு வருமாறு கூறுவார்கள். எனவே, யார் அதைச் சாப்பிட விரும்புகிறாரோ அவர் அதைச் சமைத்து அதன் வாடையை நீக்கிக்கொள்ளட்டும். - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 5",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 96
			}
		}
	]
}