{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 132,
			"arabicnumber": "24.01",
			"text": "முஸய்யப் பின் ஹஸ்ன் (ரலி) அவர்கள் கூறியதாவது: (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய பெரிய தந்தை) அபூதாலிப் அவர்களுக்கு மரண வேளை நெருங்கிவிட்டபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவரிடம் வந்தார்கள். அங்கே, அவரருகே அபூஜஹ்லையும், அப்துல்லாஹ் பின் அபீஉமய்யா பின் அல்முஃகீராவையும் கண்டார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"என் பெரிய தந்தையே! அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை (லா இலாஹ இல்லல்லாஹ்) என்று சொல்லுங்கள்! இந்த (ஏகத்துவ உறுதிமொழிக்கான) சொல்லை வைத்து நான் உங்களுக்காக அல்லாஹ்விடம் சாட்சியம் கூறுவேன்\" என்று சொன்னார்கள். அப்போது அபூஜஹ்லும் அப்துல்லாஹ் பின் அபீ உமய்யாவும் \"அபூதாலிபே! நீங்கள் (உங்கள் தந்தை) அப்துல் முத்தலிபின் மார்க்கத்தையா வெறுத்து ஒதுக்கப்போகிறீர்கள்?\" என்று கேட்டனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஏகத்துவ உறுதிமொழியைக் கூறும்படி அபூதாலிப் அவர்களிடம் கோரிக்கொண்டேயிருந்தார்கள்; தாம் முன்பு சொன்னதையே அவரிடம் திரும்பத் திரும்பச் சொல்லிக்கொண்டிருந்தார்கள். இறுதியில் அபூதாலிப் கடைசியாக அவர்களிடம் பேசியது \"நான் (என் தந்தை) அப்துல் முத்தலிபின் மார்க்கத்திலேயே இருக்கிறேன்\" என்பதாகவே இருந்தது. \"லா இலாஹ இல்லல்லாஹ்\" எனும் உறுதிமொழியைச் சொல்ல அவர் மறுத்துவிட்டார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அறிந்துகொள்ளுங்கள்! அல்லாஹ்வின் மீதாணையாக! எனக்குத் தடை விதிக்கப்படும்வரை உங்களுக்காக நான் பாவமன்னிப்புக் கேட்டுக்கொண்டேயிருப்பேன்\" என்று சொன்னார்கள். அப்போது தான் கண்ணியமும் மாண்பும் உடைய அல்லாஹ், \"இறைவனுக்கு இணைவைப்பவர்கள் நரகவாசிகள் தாம் என்பது நன்கு தெளிவாகிவிட்ட பின்னரும் (அவர்கள் நெருங்கிய உறவினர்களாயிருந்தாலும் சரி) அவர்களுக்காகப் பாவமன்னிப்புக் கோர இறைத்தூதருக்கும் இறை நம்பிக்கையாளர்களுக்கும் உரிமையில்லை\" எனும் (9:113ஆவது) வசனத்தை அருளினான். அபூதாலிப் தொடர்பாக (நபியவர்கள் வருந்தியபோது) அல்லாஹ், \"(நபியே!) நீங்கள் விரும்பியவரை(யெல்லாம்) நேர்வழியில் செலுத்திவிட முடியாது. மாறாக, அல்லாஹ்தான் தான் நாடியவர்களை நேர்வழியில் செலுத்துகிறான்\" எனும் (28:56ஆவது) வசனத்தை அருளினான். அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 39
			}
		}
	]
}