{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1452,
			"arabicnumber": "642",
			"text": "அப்துல் மலிக் பின் ஜுரைஜ் (ரஹ்) அவர்கள் கூறியதாவது: நான் அதாஉ பின் அபீரபாஹ் (ரஹ்) அவர்களிடம், \"நான் மக்களுக்கு, அவர்கள் \"அல்அ(த்)தமா\" என்று குறிப்பிடுகின்ற இஷாத் தொழுகையை எந்த நேரத்தில் தலைமை தாங்கித் தொழுவிப்பதை, அல்லது நான் தனியாகத் தொழுவதை நீங்கள் விரும்புவீர்கள்?\" என்று கேட்டேன். அதற்கு அதாஉ (ரஹ்) அவர்கள் (பின்வருமாறு) கூறினார்கள்: இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறினார்கள்: ஓர் இரவில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இஷாத் தொழுகையை நன்கு இருட்டும்வரைத் தாமதப்படுத்தினார்கள். (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை எதிர்பார்த்துக்கொண்டிருந்த) மக்கள் உறங்குவதும் விழிப்பதும் பின்னர் உறங்குவதும் விழிப்பதுமாக இருந்தார்கள். அப்போது உமர் பின் அல்கத்தாப் (ரலி) அவர்கள் எழுந்து, \"தொழுகை\" என்று (சப்தமிட்டுக்) கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது தலையிலிருந்து தண்ணீர் சொட்டிக் கொண்டிருக்க, தலையின் ஒரு பகுதியில் தமது கையை வைத்தபடி (தலையிலிருந்த தண்ணீரைத் துடைத்தவாறு) புறப்பட்டுவந்ததை நான் இப்போதும் பார்ப்பதைப் போன்றுள்ளது. அப்போது அவர்கள் \"என் சமுதாயத்தாருக்குச் சிரமம் ஏற்பட்டுவிடும் என்றில்லாதிருப்பின் அவர்களை இந்த நேரத்திலேயே இத்தொழுகையைத் தொழுமாறு உத்தரவிட்டிருப்பேன்\" என்று சொன்னார்கள். அறிவிப்பாளர் அப்துல் மலிக் பின் ஜுரைஜ் (ரஹ்) அவர்கள் தொடர்ந்து கூறுகிறார்கள்: நான் அதாஉ (ரஹ்) அவர்களிடம் \"நபி (ஸல்) அவர்கள் தமது தலையில் எவ்வாறு கையை வைத்திருந்தார்கள் என்பதை இப்னு அப்பாஸ் (ரலி) அவர்கள் அறிவித்ததைப் போன்று கூறுங்கள்\" என விளக்கம் கேட்டேன். அப்போது அதாஉ (ரஹ்) அவர்கள், தம் கை விரல்களைச் சற்று இடைவெளிவிட்டு விரித்து, விரல் நுனிகளை உச்சந்தலையில் வைத்து தலையில் அதை தடவிக்கொண்டே சென்றார்கள். இறுதியில் அவர்களது பெரு விரல் முகத்தை ஒட்டியுள்ள காதோரம், நொற்றிப்பொட்டு, தாடியின் ஓரம் ஆகியவற்றில் பட்டது. இவ்வாறு அவர்கள் தாமதியாமலும் அவசரப்படாமலும் (மிதமாகச்) செய்தார்கள். நான் அதாஉ (ரஹ்) அவர்களிடம், \"நபி (ஸல்) அவர்கள் அன்றைய இரவில் எவ்வளவு நேரம் தொழுகையைத் தாமதப்படுத்தியதாக உங்களிடம் கூறப்பட்டது?\" என்று கேட்டேன். அதற்கு அவர்கள் \"எனக்குத் தெரியாது\" என விடையளித்தார்கள். மேலும் அவர்கள், \"நான் தலைமை தாங்கித் தொழுவித்தாலும் தனியாகத் தொழுதாலும் நபி (ஸல்) அவர்கள் அன்றிரவு இஷாத் தொழுகையைத் தொழுததைப் போன்று தாமதித்துத் தொழவே விரும்புகிறேன். நீங்கள் தனியாகத் தொழும்போதோ அல்லது மக்களுக்குத் தலைமைத் தாங்கிக் கூட்டுத் தொழுகை நடத்தும்போதோ இவ்வாறு செய்வது உங்களுக்குச் சிரமமாகத் தோன்றினால் இதற்கு இடைப்பட்ட மத்திய நேரத்தில் அதைத் தொழுது கொள்ளுங்கள். அவசரப்படவும் வேண்டாம்; தாமதிக்கவும் வேண்டாம்\" என்று சொன்னார்கள். அத்தியாயம் : 5",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 285
			}
		}
	]
}