{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 149,
			"arabicnumber": "33.01",
			"text": "மஹ்மூத் பின் ரபீஉ (ரலி) அவர்கள் கூறியதாவது: நான் மதீனாவுக்குச் சென்று இத்பான் பின் மாலிக் (ரலி) அவர்களைச் சந்தித்து, \"தங்களைப் பற்றிய ஒரு செய்தி எனக்கு எட்டியது (அது உண்மையா? கூறுங்கள்!)\" என்றேன். அப்போது இத்பான் (ரலி) அவர்கள் கூறினார்கள்: என் பார்வையில் ஏதோ ஏற்பட்டு (என் கண்பார்வை போய்)விட்டது. ஆகவே, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஆளனுப்பி \"நீங்கள் வந்து என் வீட்டில் தொழ வேண்டும். அதை நான் தொழுமிடமாக ஆக்கிக்கொள்ள விரும்புகிறேன்\" என்று சொல்லியனுப்பினேன். எனவே, நபி (ஸல்) அவர்களும் அவர்களுடைய தோழர்களில் அல்லாஹ் நாடிய சிலரும் (மறுநாள் என் வீட்டுக்கு) வந்தார்கள். நபி (ஸல்) அவர்கள் (வீட்டுக்குள்) வந்து வீட்டி(ன் ஒரு மூலையி)ல் தொழுது கொண்டிருந்தார்கள். நபித் தோழர்களோ தம்மிடையே (நயவஞ்சகர்களைப் பற்றியும் அவர்களால் தங்களுக்கு ஏற்படும் தொந்தரவு பற்றியும்) பேசிக்கொண்டிருந்தார்கள். பிறகு அதில் மாலிக் பின் துக்ஷுன் அவர்களுக்குப் பெரும் பங்கிருப்பதாகக் கூறினர். அவருக்கெதிராக நபியவர்கள் பிரார்த்தித்து அவர் அழிந்துபோக வேண்டும் என்று மக்கள் விரும்பினர். அவருக்கு ஏதேனும் கேடு நேரவேண்டும் என்றும் விரும்பினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுது முடித்ததும் \"அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்றும் நான் அல்லாஹ்வின் தூதர் என்றும் அவர் (மாலிக் பின் துக்ஷும்) சாட்சியம் கூறவில்லையா?\" என்று கேட்டார்கள். மக்கள், \"அவர் அவ்வாறு (சாட்சியம்) கூறுகிறார். ஆனால், அது அவருடைய இதயத்தில் இல்லையே?\" என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்றும் நான் அல்லாஹ்வின் தூதர் ஆவேன் என்றும் சாட்சியம் கூறும் ஒருவர் \"நரகத்தில் நுழையமாட்டார்\" அல்லது \"நரகம் அவரைத் தீண்டாது\" \" என்று கூறினார்கள். இந்த ஹதீஸை (மஹ்மூத் பின் ரபீஉ (ரலி) அவர்களிடமிருந்து) அறிவிக்கும் அனஸ் (ரலி) அவர்கள் கூறுகின்றார்கள்: இந்த ஹதீஸ் என்னை வியப்படையச் செய்தது. ஆகவே, நான் என் புதல்வரிடம் \"இதை எழுதி வைத்துக்கொள்\" என்று கூறினேன். அவ்வாறே அவர் அதை எழுதி வைத்துக் கொண்டார். அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 56
			}
		}
	]
}