{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1496,
			"arabicnumber": "33.03",
			"text": "பத்ருப் போரில் கலந்துகொண்ட அன்சாரி நபித்தோழர்களில் ஒருவரான இத்பான் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, \"அல்லாஹ்வின் தூதரே! நான் என் (பனூசாலிம்) சமூகத்தாருக்குத் தொழுகை நடத்துபவனாக இருக்கின்றேன். நான் கண் பார்வையை இழந்துவருகிறேன். மழை வந்தால் எனக்கும் (என் சமூகத்தாரான) அவர்களுக்குமிடையே உள்ள பள்ளத்தாக்கில் வெள்ளநீர் வழிந்தோடும். இந்நிலையில் அவர்களுடைய பள்ளிவாசலுக்குச் சென்று அவர்களுக்கு என்னால் தொழவைக்க இயலவில்லை. ஆகவே,அல்லாஹ்வின் தூதரே! தாங்கள் வந்து (எனது வீட்டில்) ஓரிடத்தில் தொழுகை நடத்த வேண்டுமென்றும், (தாங்கள் நின்று தொழும்) அந்த இடத்தை நான் (என்) தொழுமிடமாக ஆக்கிக்கொள்ள வேண்டுமென்றும் விரும்புகிறேன்\" என்று சொன்னேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்ஷா அல்லாஹ் (இறைவன் நாடினால்) நான் (அவ்வாறே) செய்வேன்\" என்று சொன்னார்கள். தொடர்ந்து இத்பான் (ரலி) அவர்கள் கூறினார்கள்: மறுநாள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அபூபக்ர் அஸ்ஸித்தீக் (ரலி) அவர்களும் நண்பகல் நேரத்தில் என்னிடம் வந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என் இல்லத்தினுள் நுழைய) அனுமதி கேட்டார்கள். நான் அனுமதியளித்தேன். உள்ளே வந்த அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உடனே உட்காரவில்லை. பிறகு என்னிடம் \"(இத்பான்!) உங்கள் வீட்டில் எந்த இடத்தில் நான் தொழவேண்டுமென நீங்கள் விரும்புகிறீர்கள்?\" என்று கேட்டார்கள். நான் வீட்டின் ஒரு மூலையைக் காட்டினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்த இடத்தில்) நின்று \"தக்பீர் (தஹ்ரீம்)\" சொன்னார்கள். நாங்கள் அவர்களுக்குப் பின்னே (அணிவகுத்து) நின்றோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரண்டு ரக்அத்கள் தொழுது, சலாம் கொடுத்தார்கள். நாங்கள் அவர்களுக்காகச் சமைத்திருந்த \"கஸீர்\" எனும் (கஞ்சி) உணவி(னை விருந்தளிப்பத)ற்காக அவர்களை நாங்கள் இருக்கவைத்தோம். )அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்திருப்பதைக் கேள்விப்பட்ட) அந்தப் பகுதி மக்கள் எங்களைச் சுற்றிக் குழுமிவிட்டனர். கணிசமான பேர் (சிறுகச் சிறுக) வந்து (என்) வீட்டில் திரண்டுவிட்டனர். அவர்களில் ஒருவர், \"மாலிக் பின் துக்ஷுன் எங்கே?\" என்று கேட்டார். அதற்கு அவர்களில் மற்றொருவர், \"அவர் அல்லாஹ்வையும் அல்லாஹ்வுடைய தூதரையும் நேசிக்காத ஒரு நயவஞ்சகர் (அதனால்தான் அல்லாஹ்வின் தூதரைச் சந்திக்க அவர் வரவில்லை)\" என்று சொன்னார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவரைப் பற்றி அவ்வாறு சொல்லாதீர்கள். அல்லாஹ்வின் திருப்தியை நாடியவராக அவர் \"லா இலாஹ இல்லல்லாஹ்\" (அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை) என்று சொன்னதை நீங்கள் பார்க்கவில்லையா?\" என்று கேட்டார்கள். அதற்கு மக்கள் \"அல்லாஹ்வும் அவனுடைய தூதரும் நன்கு அறிந்தவர்கள்\" என்று கூறினார்கள். அ(வ்வாறு நயவஞ்சகர் என விமரிசித்த)வர், \"(அல்லாஹ்வின் தூதரே!) அவர் (மாலிக் பின் துக்ஷுன்) நயவஞ்சகர்களுடன் தொடர்பு வைத்திருப்பதையும் அவர்கள்மீது அபிமானம் கொண்டிருப்பதையுமே நாங்கள் காண்கிறோம்\" என்று சொன்னார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ்வின் திருப்தியை நாடி \"லா இலாஹ இல்லல்லாஹ்\" என்று சொன்னவரை நரகத்திலிருந்து அல்லாஹ் தடுத்து (ஹராமாக்கி)விட்டான்\" என்று கூறினார்கள். அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறுகின்றார்கள்: பனூசாலிம் குலத்தைச் சேர்ந்தவரும் அவர்களில் முக்கியப் பிரமுகருமான ஹுஸைன் பின் முஹம்மத் அல்அன்சாரி (ரஹ்) அவர்களிடம் மஹ்மூத் பின் அர்ரபீஉ அல்அன்சாரி (ரலி) அவர்கள் அறிவித்த இந்த ஹதீஸ் குறித்துக் கேட்டேன். அவர்கள் அதை \"உண்மைதான்\" என உறுதிப்படுத்தினார்கள். அத்தியாயம் : 5",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 329
			}
		}
	]
}