{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1560,
			"arabicnumber": "680.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கைபர் போரிலிருந்து திரும்பியபோது இரவு முழுவதும் பயணம் செய்தார்கள். இறுதியில் அவர்களுக்கு உறக்கம் வந்துவிடவே (ஓரிடத்தில் இறங்கி) ஓய்வெடுத்தார்கள். அப்போது பிலால் (ரலி) அவர்களிடம் \"இன்றிரவு எமக்காக நீர் காவல் புரிவீராக!\" என்றார்கள். பிலால் (ரலி) அவர்கள் (கண் விழித்து) அவர்களுக்கு விதிக்கப்பட்டிருந்த அளவு தொழுதார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்களுடைய தோழர்களும் (படுத்து) உறங்கினார்கள். வைகறை நேரம் (ஃபஜ்ர்) நெருங்கிய வேளையில் பிலால் (ரலி) அவர்கள் வைகறை (கிழக்கு)த் திசையை முன்னோக்கியபடி தமது வாகன (ஒட்டக)த்தில் சாய்ந்து அமர்ந்து கொண்டார்கள். அப்போது தம்மையும் அறியாமல் சாய்ந்தபடியே கண்ணயர்ந்து உறங்கிவிட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களோ, பிலால் (ரலி) அவர்களோ, நபித்தோழர்களில் எவருமோ சூரிய ஒளி தம்மீது படும்வரை விழிக்கவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்தாம் முதலில் கண் விழித்தார்கள். பதறியபடியே அவர்கள் \"பிலால்!\" என்றழைத்தார்கள். பிலால் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! என் தந்தையும் என் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும்! தங்களைத் தழுவிக்கொண்ட அதே (உறக்கம்)தான் என்னையும் தழுவிக்கொண்டது\" என்று சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (மக்களிடம்) \"உங்கள் வாகனங்களைச் செலுத்துங்கள்\" என்று கூற, உடனே மக்கள் தம் வாகனங்களைச் செலுத்தி சிறிது தூரம் சென்றார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (இறங்கி) அங்கத் தூய்மை (உளூ) செய்தார்கள். பிலால் (ரலி) அவர்களிடம் (பாங்கு மற்றும்) இகாமத் சொல்லச் சொன்னார்கள். பிலால் (ரலி) அவர்கள் இகாமத் சொன்னதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களுக்கு சுப்ஹுத் தொழுகை தொழுவித்தார்கள். தொழுது முடிந்ததும், \"தொழுகையை மறந்துவிட்டவர் நினைவு வந்ததும் அதைத் தொழுதுகொள்ளட்டும். ஏனெனில் அல்லாஹ், \"என்னை நினைவுகூரும் பொருட்டு தொழுகையை நிலைநிறுத்துவீராக!\" (20:14) என்று கூறுகின்றான்\" என்றார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான யூனுஸ் (ரஹ்) அவர்கள் கூறுகின்றார்கள்: )மேற்கண்ட 20:14ஆவது வசனத்தின் மூலத்திலுள்ள \"லி திக்ரீ\" எனும் சொற்றொடரை) இப்னு ஷிஹாப் (ரஹ்) அவர்கள் \"லித்திக்ரா\" (நினைவுகூருவதற்காக) என்று ஓதுவார்கள். அத்தியாயம் : 5",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 393
			}
		}
	]
}