{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1794,
			"arabicnumber": "763.07",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் ஓர் இரவில் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களது இல்லத்தில் தங்கியிருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இரவில் எப்படித் தொழுகிறார்கள் என்பதைக் கவனிக்கக் காத்திருந்தேன். அவர்கள் எழுந்து சென்று சிறுநீர் கழித்து விட்டுப் பிறகு (திரும்பிவந்து) தமது முகத்தையும் கைகளையும் கழுவிவிட்டு உறங்கினார்கள். பின்னர் எழுந்து தண்ணீர் பையை நோக்கிச் சென்று அதன் சுருக்கை அவிழ்த்தார்கள். பிறகு உணவுத் தட்டில் அல்லது பெரிய பாத்திரத்தில் அதை ஊற்றி அதில் தமது கையை நுழைத்து நடுத்தரமாக அழகிய முறையில் அங்கத் தூய்மை (உளூ) செய்தார்கள். பிறகு நின்று தொழுதார்கள். நான் சென்று அவர்களுக்கு (இடப்) பக்கத்தில் நின்றுகொண்டேன். உடனே அவர்கள் என்னைப் பிடித்து தமக்கு வலப் பக்கத்தில் நிறுத்தினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பதிமூன்று ரக்அத்கள் தொழுது முடித்தார்கள். பிறகு குறட்டைவிட்டு உறங்கினார்கள். -(பொதுவாக) அவர்களது குறட்டைச் சப்தத்தை வைத்து அவர்கள் உறங்குகிறார்கள் என்பதை நாங்கள் அறிந்துகொள்வோம்.- பின்னர் (சுப்ஹுத்) தொழுகைக்குப் புறப்பட்டுச் சென்று தொழுதார்கள். அவர்கள் தமது \"தொழுகையில்\"அல்லது \"சஜ்தாவில்\" பின்வருமாறு கூறலானார்கள்: அல்லாஹும்மஜ்அல் ஃபீ கல்பீ நூரன். வ ஃபீ சம்ஈ நூரன். வ ஃபீ பஸரீ நூரன். வ அன் யமீனீ நூரன். வ அன் ஷிமாலீ நூரன். வ அமாமீ நூரன். வ கல்ஃபீ நூரன். வ ஃபவ்கீ நூரன். வ தஹ்தீ நூரன். வஜ்அல்லீ நூரா/ வஜ்அல்னீ நூரா. )பொருள்: இறைவா! என் இதயத்தில் ஒளியை ஏற்படுத்துவாயாக! என் செவியிலும் ஒளியை ஏற்படுத்துவாயாக. என் பார்வையிலும் ஒளியை ஏற்படுத்துவாயாக. என் வலப் பக்கத்திலும் ஒளியை ஏற்படுத்துவாயாக. என் இடப் பக்கத்திலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு முன்னாலும் ஒளியை ஏற்படுத்துவாயாக. எனக்குப் பின்னாலும் ஒளியை ஏற்படுத்துவாயாக. எனக்கு மேலேயும் ஒளியை ஏற்படுத்துவாயாக. எனக்குக் கீழேயும் ஒளியை ஏற்படுத்துவாயாக. \"எனக்கு (எல்லாத் திசைகளிலும்) ஒளியை ஏற்படுத்துவாயாக\" (அல்லது) \"என்னை ஒளிமயமாக்குவாயாக\".( - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. )அதன் அறிவிப்பாளர்களில் ஒருவரான) சலமா (ரஹ்) கூறினார்கள்: நான் குறைப் (ரஹ்) அவர்களைச் சந்தித்தபோது, \"இப்னு அப்பாஸ் (ரலி) அவர்கள் \"நான் என் சிறிய தாயார் மைமூனா (ரலி) அவர்களிடம் இருந்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்தார்கள்...\" என்று கூறிவிட்டு மேற்கண்ட ஹதீஸில் உள்ளவாறு குறிப்பிட்டார்கள்\" என்றார்கள். மேலும் \"என்னை ஒளிமயமாக ஆக்குவாயாக\" என்று (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதாகவு)ம் ஐயப்பாடின்றி அறிவித்தார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 222
			}
		}
	]
}