{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1808,
			"arabicnumber": "769.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நடு இரவில் (தஹஜ்ஜுத்) தொழுவதற்காக எழுந்ததும் (பின்வருமாறு) பிரார்த்திப்பார்கள்: அல்லாஹும்ம, லக்கல் ஹம்து, அன்த்த நூருஸ் ஸமாவாத்தி வல்அர்ள். வ லக்கல் ஹம்து, அன்த்த கய்யாமுஸ் ஸமாவாத்தி வல்அர்ள். வ லக்கல் ஹம்து, அன்த்த ரப்புஸ் ஸமாவாத்தி வல்அர்ளி வமன் ஃபீஹின்ன. அன்த்தல் ஹக்கு. வ வஅதுக்கல் ஹக்கு. வ கவ்லுக்கல் ஹக்கு. வ லிகாஉக ஹக்குன். வல்ஜன்னத்து ஹக்குன். வந்நாரு ஹக்குன். வஸ்ஸாஅத்து ஹக்குன். அல்லாஹும்ம லக அஸ்லம்து, வ பிக ஆமன்து, வ அலைக தவக்கல்து, வ இலைக அனப்து, வ பிக காஸம்து, வ இலைக ஹாக்கம்து, ஃபஃக்ஃபிர்லீ மா கத்தம்து வ அக்கர்து வ அஸ்ரர்து வ அஃலன்து. அன்த இலாஹீ. லா இலாஹ இல்லா அன்த. (பொருள்: இறைவா! உனக்கே புகழ் அனைத்தும். வானங்கள் மற்றும் பூமியின் ஒளி நீயே. உனக்கே புகழ் அனைத்தும். வானங்கள் மற்றும் பூமி ஆகியவற்றை நிர்வகிப்பவன் நீயே. உனக்கே புகழ் அனைத்தும். வானங்கள், பூமி மற்றும் அவற்றிலுள்ளவற்றின் இறைவன் நீயே. நீ உண்மையே. உன் வாக்குறுதி உண்மையே. உனது கூற்று உண்மையே. உன் தரிசனம் உண்மை. சொர்க்கம் உண்மை. நரகம் உண்மை. மறுமை நாள் உண்மை. அல்லாஹ்வே! உனக்கே கட்டுப்பட்டேன். உன்மீதே நம்பிக்கை கொண்டுள்ளேன். உன்னையே சார்ந்துள்ளேன். உன்னிடமே திரும்புகிறேன். உன்னிடமே வழக்காடுவேன். உன்னிடமே நீதி கேட்பேன். எனவே, நான் முந்திச் செய்த, பிந்திச் செய்கிற, இரகசியமாகச் செய்த, பகிரங்கமாகச் செய்த பாவங்களை மன்னிப்பாயாக. நீயே என் இறைவன். உன்னைத் தவிர வேறு இறைவன் இல்லை.( - மேற்கண்ட ஹதீஸ் மேலும் நான்கு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், இப்னு ஜுரைஜ் (ரஹ்) அவர்களது அறிவிப்பும் மாலிக் பின் அனஸ் (ரஹ்) அவர்களது அறிவிப்பும் இரண்டு சொற்றொடர்களில் தவிர வேறெதிலும் மாறுபட வில்லை. \"நிர்வகிப்பவன்\" என்பதைக் குறிக்க இப்னு ஜுரைஜின் அறிவிப்பில் (\"கய்யாம்\" என்பதற்கு பதிலாக) \"கய்யிம்\" எனும் சொல்லும் \"நான் இரகசியமாகச் செய்த\" என்பதைக் குறிக்க (\"வ அஸ்ரர்து\" என்பதற்கு பதிலாக) \"வ மா அஸ்ரர்து\" எனும் சொற்றொடரும் ஆளப்பட்டுள்ளன. இப்னு உயைனா (ரஹ்) அவர்களது அறிவிப்பில் சில கூடுதலான தகவல்கள் உள்ளன. மாலிக் மற்றும் இப்னு ஜுரைஜ் ஆகியோருக்குப் பல சொற்றொடர்களில் அன்னார் மாறுபடுகிறார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. இந்த அறிவிப்பாளர்களின் சொற்கள் மேற்கண்ட ஹதீஸ்களில் உள்ள அறிவிப்பாளர்களின் சொற்களுக்குக் கிட்டத்தட்ட நெருக்கமாகவே அமைந்துள்ளன. அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 236
			}
		}
	]
}