{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1946,
			"arabicnumber": "840.02",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் சேர்ந்து ஜுஹைனா குலத்தைச் சேர்ந்த ஒரு கூட்டத்தாருடன் போரிடப் புறப்பட்டோம். அவர்கள் எங்களிடம் கடுமையாகப் போரிட்டனர். நாங்கள் லுஹ்ர் தொழுகையில் ஈடுபட்டிருந்தபோது (எங்களை நோட்டமிட்ட) இணைவைப்பாளர்கள் \"(முஸ்லிம்கள் தொழுகையில் ஈடுபடும்போது) அவர்கள்மீது நாம் அதிரடித் தாக்குதல் தொடுத்தால் அவர்களை நாம் பூண்டோடு ஒழித்துவிடலாம்\" என்று பேசிக் கொண்டனர். இந்த விவரத்தை (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் தெரிவித்தார்கள். அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களிடம் கூறினார்கள். மேலும், \"அவர்கள் ஒரு தொழுகையை எதிர்நோக்கியுள்ளனர். அது அவர்களுக்கு (தங்கள்) குழந்தை குட்டிகளைவிட மிக விருப்பமானதாகும்\" என்று இணைவைப்பாளர்கள் கூறுகின்றனர் என்றும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். அஸ்ர் தொழுகையின் நேரம் வந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களை இரு வரிசைகளில் அணிவகுக்கச் செய்தார்கள். இணைவைப்பாளர்கள் எங்களுக்கும் தொழும் திசை(யான கிப்லாவு)க்குமிடையே இருந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முதல் தக்பீர் கூறி (தொழுகையைத் துவக்கி)னார்கள். நாங்களும் தக்பீர் கூறினோம். அவர்கள் ருகூஉச் செய்தார்கள். நாங்களும் ருகூஉச் செய்தோம். பிறகு அவர்கள் சஜ்தாச் செய்தபோது முதல் வரிசையிலிருந்தவர்கள் சஜ்தாச் செய்தனர். முதல் வரிசையிலிருந்தவர்கள் (சஜ்தாவிலிருந்து) எழுந்து நின்றதும் இரண்டாவது வரிசையிலிருந்தவர்கள் சஜ்தாச் செய்தனர். பிறகு முதல் வரிசையிலிருந்தவர்கள் பின்வரிசைக்குச் சென்றுவிட, இரண்டாம் வரிசையிலிருந்தவர்கள் முன் வரிசைக்கு வந்து அவர்களது இடத்தில் நின்றனர். (இரண்டாவது ரக்அத்தில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தக்பீர் கூற நாங்கள் (அனைவரும்) தக்பீர் கூறினோம். அவர்கள் ருகூஉச் செய்தபோது நாங்களும் ருகூஉச் செய்தோம். பிறகு அவர்கள் சஜ்தாச் செய்தபோது முதல் வரிசையிலிருந்தவர்களும் சஜ்தாச் செய்தனர். அப்போது இரண்டாவது வரிசையினர் நின்றுகொண்டனர். பின்னர் அவர்களும் சஜ்தாச் செய்த பின்னர் அனைவரும் அமர்ந்தோம். பின்னர் அனைவருடன் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சலாம் கொடுத்தார்கள். இதன் அறிவிப்பாளரான அபுஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறுகிறார்கள்: பிறகு ஜாபிர் (ரலி) அவர்கள் \"இன்றைய தலைவர்கள் உங்களுக்குத் தொழுவிப்பதைப் போன்றே (அன்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எங்களுக்குத் தொழுவித்தார்கள்)\" என்று குறிப்பிட்டுச் சொன்னார்கள். அத்தியாயம் : 6",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 374
			}
		}
	]
}