{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2008,
			"arabicnumber": "868",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: \"அஸ்து ஷனூஆ\" எனும் குலத்தைச் சேர்ந்த ளிமாத் பின் ஸஅலபா என்பார் மக்காவுக்கு வந்தார். அவர் காற்றுகறுப்புக்காக ஓதிப்பார்ப்பவராய் இருந்தார். மக்காவைச் சேர்ந்த சில அறிவிலிகள் \"முஹம்மத் ஒரு மனநோயாளி\" என்று கூறுவதை அவர் செவியுற்றார். \"நான் அந்த மனிதரைச் சந்தித்(து ஓதிப்பார்த்)தால் எனது கரத்தால் அவருக்கு அல்லாஹ் நிவாரணம் அளிக்கக்கூடும்\" என்று ளிமாத் சொன்னார். அவ்வாறே அவர் முஹம்மத் (ஸல்) அவர்(களிடம் வந்து அவர்)களைச் சந்தித்தபோது, \"முஹம்மதே! காற்றுகறுப்புக்காக நான் ஓதிப்பார்த்துவருகிறேன். எனது கரத்தால் தான் நாடியவர்களுக்கு அல்லாஹ் நிவாரணமளிக்கிறான். உங்களுக்கு நான் ஓதிப்பார்க்கட்டுமா?\" என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அனைத்துப் புகழும் அல்லாஹ்வுக்கே உரியது. நாங்கள் அவனைப் போற்றுகிறோம்; அவனிடமே உதவி கோருகிறோம். அல்லாஹ் யாரை நேர்வழியில் செலுத்திவிட்டானோ அவரை எவராலும் வழிகெடுக்க முடியாது. அவன் யாரை வழிகேட்டில் விட்டுவிட்டானோ அவரை எவராலும் நேர்வழியில் சேர்க்க முடியாது. அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை; அவன் தனித்தவன்; அவனுக்கு இணையேதுமில்லை என்றும், முஹம்மத் அல்லாஹ்வின் அடிமையும் தூதருமாவார் என்றும் நான் உறுதி கூறுகிறேன். இறைவாழ்த்துக்குப் பின்!\" என்று கூறினார்கள். (இதைக் கேட்ட) ளிமாத், \"நீங்கள் (இப்போது) சொன்ன இந்த வார்த்தைகளை மீண்டும் சொல்லுங்கள்\" என்று கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்த வார்த்தைகளை முன்பு போன்றே மூன்று முறை கூறினார்கள். இதைக் கேட்ட ளிமாத், \"நான் சோதிடர்கள், சூனியக்காரர்கள், கவிஞர்கள் ஆகியோரின் சொற்களைக் கேட்டிருக்கிறேன். ஆனால், நீங்கள் கூறிய இந்த வார்த்தைகளைப் போன்று நான் கேட்டதேயில்லை. இவ்வார்த்தைகள் ஆழ்கடலையே தொட்டுவிட்டன. உங்களது கரத்தை நீட்டுங்கள்; நான் இஸ்லாத்தை ஏற்பதற்கு உங்களிடம் உறுதிமொழி அளிக்கிறேன்\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவரிடம் உறுதிமொழி வாங்கிக்கொண்டார்கள். அப்போது \"உம்முடைய சமூக மக்களுக்காகவும் (அவர்கள் சார்பாக) உறுதிமொழி அளிப்பீராக!\" என்று கூறினார்கள். அதற்கு ளிமாத் \"என் சமூகத்தாருக்காகவும் (உறுதி அளிக்கிறேன்)\" என்று கூறினார். பிறகு (ஒரு கட்டத்தில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அனுப்பிய படைப் பிரிவொன்று அவருடைய சமூகத்தாரைக் கடந்து சென்றது. அப்போது அப்படையின் தலைவர் தம் வீரர்களிடம், \"இதோ இந்த மக்களிடமிருந்து (போர்ச் செல்வமாக) எதையேனும் பெற்றீர்களா?\" என்று கேட்டார். படைவீரர்களில் ஒருவர், \"(ஆம்) நான் ஒரு தண்ணீர் குவளையை அவர்களிடமிருந்து பெற்றேன்\" என்றார். அதற்கு \"அதைத் திருப்பிக் கொடுத்துவிடுங்கள்! இவர்கள் ளிமாதின் சமூக மக்கள். (ளிமாத் அளித்துள்ள உறுதிமொழியின் கீழ் இவர்கள் அபயம் பெற்றவர்கள்)\" என்று கூறினார். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 7",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 58
			}
		}
	]
}