{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2089,
			"arabicnumber": "901.01",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் சூரிய கிரகணம் ஏற்பட்டது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எழுந்து (மக்களுடன்) தொழுதார்கள். அதில் நன்கு நீண்ட நேரம் நிலையில் நின்றார்கள். பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவை நன்கு நீண்ட நேரம் செய்தார்கள். பிறகு (ருகூஉவிலிருந்து) தலையை உயர்த்தி நன்கு நீண்ட நேரம் நிலையில் நின்றார்கள். இ(ந்த நிலையான)து முதல் நிலையைவிடக் குறைவாகவே இருந்தது. பிறகு (மீண்டும்) ருகூஉச் செய்தார்கள். அந்த ருகூஉவையும் நன்கு நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து முதல் ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு சஜ்தா (சிரவணக்கம்) செய்தார்கள். பிறகு எழுந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இ(ந்த நிலையான)து, இதற்கு முந்தைய நிலையை விடக் குறைவாகவே இருந்தது. பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவையும் நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து இதற்கு முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு (ருகூஉவிலிருந்து) தலையை உயர்த்தி, நிலையில் நின்றார்கள். அந்த நிலையிலும் நீண்ட நேரம் நின்றார்கள். இ(ந்த நிலையான)து இதற்கு முந்தைய நிலையைவிடக் குறைவாகவே இருந்தது. பிறகு (மீண்டும்) ருகூஉச் செய்தார்கள். அந்த ருகூஉ வையும் நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து இதற்கு முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு சஜ்தாச் செய்தார்கள். பின்னர் (கிரகணம் விலகி) சூரிய வெளிச்சம் வந்துவிட்டிருந்த நிலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்தார்கள். பிறகு மக்களுக்கு உரையாற்றினார்கள். அவர்கள் அல்லாஹ்வைப் போற்றிப் புகழ்ந்து விட்டுப் பின்வருமாறு கூறினார்கள்: சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் உள்ளவையாகும். எவரது இறப்புக்காகவும் எவரது பிறப்புக்காகவும் கிரகணம் ஏற்படுவதில்லை. கிரகணம் ஏற்படுவதை நீங்கள் கண்டால் \"தக்பீர்\" (அல்லாஹு அக்பர்) கூறுங்கள்; அல்லாஹ்விடம் பிரார்த்தியுங்கள்; தொழுங்கள்; தானதர்மம் செய்யுங்கள். முஹம்மதின் சமுதாயத்தாரே! தன் அடியார்களில் ஆணோ பெண்ணோ யார் விபசாரத்தில் ஈடுபட்டாலும் (அதைக் கண்டு) கடுமையாக ரோஷம் கொள்பவர் அல்லாஹ்வைவிட வேறெவருமிலர். முஹம்மதின் சமுதாயத்தாரே! அல்லாஹ்வின் மீதாணையாக! நான் அறிவதையெல்லாம் நீங்களும் அறிந்தால் குறைவாகச் சிரிப்பீர்கள்; அதிகமாக அழுவீர்கள். நான் (சொல்ல வேண்டியதைச்) சொல்லிவிட்டேன் அல்லவா? இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் மாலிக் பின் அனஸ் (ரஹ்) அவர்களது அறிவிப்பில் \"சூரியனும் சந்திரனும் அல்லாஹ்வின் சான்றுகளில் இரு சான்றுகளாகும்\" என இடம்பெற்றுள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 1
			}
		}
	]
}