{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"10": "The Book of Prayer - Eclipses"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2098,
			"arabicnumber": "903.01",
			"text": "அம்ரா பின்த் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறியதாவது: ஒரு யூதப் பெண் ஆயிஷா (ரலி) அவர்களிடம் யாசகம் கேட்டு வந்தாள். அப்போது அவள் ஆயிஷாவிடம் ‘மண்ணறை (கப்று) வேதனையிலிருந்து உம்மை இறைவன் காப்பாற்றுவானாக!\" என்று கூறினாள். ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: ஆகவே,நான் (இதுபற்றி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கூறி) \"அல்லாஹ்வின் தூதரே! மனிதர்கள் மண்ணறைகளில் வேதனை செய்யப்படுகிறார்களா?\" எனக் கேட்டேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"(மண்ணறை வேதனையிலிருந்து) நானும் அல்லாஹ்விடம் பாதுகாப்புக் கோருகிறேன்\" என்று கூறினார்கள். பிறகு (ஒரு நாள்) காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் புதல்வர் இப்ராஹீமின் இறப்புச் செய்தி கேட்டு) வாகனத்தில் ஏறிப் பயணமானார்கள். அப்போது சூரிய கிரகணம் ஏற்பட்டு விடவே, நான் சில பெண்களுடன் சேர்ந்து அறைகளின் பின்புற வழியாகப் பள்ளிவாசலுக்குப் புறப்பட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பயணத்தை ரத்துச் செய்துவிட்டு) தமது வாகனத்திலிருந்து இறங்கி, தாம் வழக்கமாக நின்று தொழுவித்துவந்த இடத்திற்குச் சென்று நின்றார்கள். மக்களும் அவர்களுக்குப் பின்னால் நின்றனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தொழுகையில்) நீண்ட நேரம் நிலையில் நின்றுவிட்டுப் பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவில் நீண்ட நேரம் இருந்தார்கள். பிறகு (ருகூஉவிலிருந்து) நிமிர்ந்து நீண்ட நேரம் நிலையில் நின்றார்கள். இ(ந்த நிலையான)து இதற்கு முந்தைய நிலையை விடக் குறைவாகவே இருந்தது. பிறகு ருகூஉச் செய்தார்கள். அந்த ருகூஉவையும் நீண்ட நேரம் செய்தார்கள். இ(ந்த ருகூஉவான)து இதற்கு முந்தைய ருகூஉவைவிடக் குறைவாகவே இருந்தது. பிறகு (ருகூஉவிலிருந்து தலையை) உயர்த்தியபோது, சூரிய வெளிச்சம் வந்துவிட்டிருந்தது. பின்னர் (அவர்கள் ஆற்றிய உரையில்) \"நீங்கள் கப்றுகளில் தஜ்ஜாலின் குழப்பத்தைப் போன்ற குழப்பத்துக்கு உள்ளாக்கப்படுவதை நான் கண்டேன்\" என்று குறிப்பிட்டார்கள். இதன் அறிவிப்பாளரான அம்ரா பின்த் அப்திர் ரஹ்மான் பின் சஅத் (ரஹ்) அவர்கள் கூறினார்கள்: இதன் பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நரகநெருப்பின் வேதனையிலிருந்தும் மண்ணறை (கப்று) வேதனையிலிருந்தும் (இறைவனிடம் அதிகமாகப்) பாதுகாப்புக்கோரி வந்ததை நான் செவியுற்றேன் என ஆயிஷா (ரலி) அவர்கள் கூறினார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 10",
			"grades": [],
			"reference": {
				"book": 10,
				"hadith": 9
			}
		}
	]
}