{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2149,
			"text": "அப்துல்லாஹ் பின் உபைதில்லாஹ் பின் அபீமுலைக்கா (ரஹ்) அவர்கள் கூறியதாவது: நான் (மக்காவில்) இப்னு உமர் (ரலி) அவர்களுக்குப் பக்கத்தில் அமர்ந்திருந்தேன். அப்போது நாங்கள் உஸ்மான் (ரலி) அவர்களின் புதல்வியார் உம்மு அபான் அவர்களது ஜனாஸாவை எதிர்பார்த்துக் காத்திருந்தோம். இப்னு உமர் (ரலி) அவர்களுக்கு அருகில் உஸ்மான் (ரலி) அவர்களுடைய புதல்வர் அம்ரும் இருந்தார். அப்போது இப்னு அப்பாஸ் (ரலி) அவர்கள் வந்தார்கள். அவர்களை ஒருவர் கைத்தாங்கலாக அழைத்துவந்து இப்னு உமர் (ரலி) அவர்கள் அமர்ந்திருந்த இடத்தைக் காட்டினார். உடனே அவர்கள் வந்து எனக்குப் பக்கத்தில் அமர்ந்தார்கள். நான் அவர்கள் இருவருக்குமிடையே இருந்தேன். அப்போது வீட்டிலிருந்து அழுகுரல் கேட்டது. உடனே இப்னு உமர் (ரலி) அவர்கள் அம்ரிடம் \"நீங்கள் எழுந்து சென்று, அவர்களை அழவேண்டாம் எனத் தடை செய்யுங்கள்\"என்று சைகை செய்துவிட்டு, \"குடும்பத்தார் அழுவதன் காரணமாக இறந்தவர் வேதனை செய்யப்படுகிறார் என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை நான் கேட்டுள்ளேன்\" என்றார்கள். அப்போது இப்னு உமர் (ரலி) அவர்கள் (\"இறந்தவர் இறைமறுப்பாளராக இருந்தால்\" என்று குறிப்பிட்டுச் சொல்லாமல்) பொதுப்படையாக (\"இறந்தவர் வேதனை செய்யப்படுகிறார்\" என்று)தான் கூறினார்கள். உடனே இப்னு அப்பாஸ் (ரலி) அவர்கள் (பின்வருமாறு) கூறினார்கள்: நாங்கள் (ஒரு பயணத்தில்) இறைநம்பிக்கையார்களின் தலைவர் உமர் பின் அல்கத்தாப் (ரலி) அவர்களுடன் இருந்தோம். நாங்கள் (மக்காவிற்கும் மதீனாவிற்கும் இடையிலுள்ள) \"பைதாஉ\" எனுமிடத்தில் இருந்தபோது, அங்கு ஒரு மரத்திற்குக் கீழே யாரோ ஒருவர் தங்கியிருந்தார். (இதைக் கண்ட) உமர் (ரலி) அவர்கள் என்னிடம் \"நீங்கள் சென்று அவர் யாரெனப் பார்த்து வந்து என்னிடம் கூறுங்கள்\" என்றார். நான் சென்று பார்த்த போது அங்கு ஸுஹைப் (ரலி) அவர்கள் இருந்தார்கள். நான் உமர் (ரலி) அவர்களிடம் திரும்பிவந்து \"நீங்கள் பார்த்துவிட்டு வந்து தெரிவிக்கச் சொன்ன அந்த மனிதர் ஸுஹைப் (ரலி)\" என்றேன். அதற்கு உமர் (ரலி) அவர்கள் \"அவரை நம்முடன் சேர்ந்து கொள்ளச் சொல்லுங்கள்!\" என்றார்கள். நான் \"அவருடன் அவருடைய குடும்பத்தாரும் உள்ளார்கள்\" என்றேன். உமர் (ரலி) அவர்கள் \"அவருடன் அவருடைய குடும்பத்தார் இருந்தாலும் சரியே! (அவரை நம்முடன் வந்து சேர்ந்துகொள்ளச் சொல்லுங்கள்)\" என்றார்கள். நாங்கள் (அனைவரும் மதீனாவுக்கு) வந்து சேர்ந்து வெகுநாட்கள் ஆகியிருக்கவில்லை. அதற்குள் இறைநம்பிக்கையாளர்களின் தலைவர் உமர் (ரலி) அவர்கள் (கத்தியால் குத்தப்பட்டு) காயமுற்றார்கள். அப்போது ஸுஹைப் (ரலி) அவர்கள் \"சகோதரரே! நண்பரே!\" எனக் கூறியபடியே (அழுதுகொண்டு) வந்தார். அப்போது உமர் (ரலி) அவர்கள் \"குடும்பத்தாரின் அழுகைகளில் சிலவற்றால் இறந்தவர் வேதனை செய்யப்படுகிறார் என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை \"நீர் அறியவில்லையா?\" அல்லது \"நீர் செவியுறவில்லையா?\" என்று கேட்டார்கள். (\"நீர் அறியவும் கேள்விப்படவுமில்லையா?\" என்று கேட்டதாக அய்யூப் (ரஹ்) அவர்களது அறிவிப்பில் இடம்பெற்றுள்ளது.) இப்னு உமர் (ரலி) அவர்கள் (குறிப்பிட்டுக் கூறாமல்) பொதுவாகச் சொல்லியுள்ளார்கள். உமர் (ரலி) அவர்களோ \"குடும்பத்தாரின் சில அழுகையால்\" என்று (குறிப்பாக்கிக்) கூறினார்கள். (அறிவிப்பாளர் அப்துல்லாஹ் பின் உபைதில்லாஹ் பின் அபீமுலைக்கா (ரஹ்) அவர்கள் தொடர்ந்து கூறுகின்றார்கள்:) உடனே நான் எழுந்து ஆயிஷா (ரலி) அவர்களிடம் சென்றேன்; இப்னு உமர் (ரலி) அவர்கள் சொன்ன ஹதீஸை அவர்களிடம் தெரிவித்தேன். ஆயிஷா (ரலி) அவர்கள், \"இல்லை; அல்லாஹ்வின் மீதாணையாக! \"எவரோ ஒருவர் அழுவதன் காரணமாக இறந்துவிட்ட (இறைநம்பிக்கையாளரான) மனிதர் வேதனை செய்யப்படுகிறார்\" என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒருபோதும் கூறவில்லை. மாறாக \"குடும்பத்தார் அழுவதன் காரணமாக இறைமறுப்பாளனுக்கு அல்லாஹ் இன்னும் வேதனையை அதிகப்படுத்துகின்றான்\" என்றே கூறினார்கள். அல்லாஹ்வே சிரிக்கவும் வைக்கிறான்; அழவும் வைக்கிறான் (53:43).ஓர் ஆத்மாவின் (பாவச்) சுமையை மற்றோர் ஆத்மா சுமக்காது (35:18)\" என்று கூறினார்கள். காசிம் பின் முஹம்மத் பின் அபீபக்ர் (ரஹ்) அவர்கள் கூறினார்கள்: உமர் (ரலி) மற்றும் இப்னு உமர் (ரலி) ஆகியோரின் கூற்று ஆயிஷா (ரலி) அவர்களுக்கு எட்டியபோது \"நீங்கள் பொய்யர்களோ பொய்ப்பிக்கப்பட்டவர்களோ அல்லாத இருவர் சொன்ன ஹதீஸை என்னிடம் கூறுகின்றீர்கள். ஆயினும், செவி (சில நேரங்களில்) தவறாக விளங்கிவிடுகிறது\" என்று கூறினார்கள். அத்தியாயம் : 11",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}