{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "அப்துல்லாஹ் பின் கஸீர் அல்முத்தலிப் (ரஹ்) அவர்கள் கூறியதாவது: (ஒரு நாள்) ஆயிஷா (ரலி) அவர்கள் \"நான் நபி (ஸல்) அவர்களைப் பற்றியும் என்னைப் பற்றியும் உங்களுக்கு அறிவிக்க வேண்டாமா?\" என்று கேட்டார்கள். அதற்கு நாங்கள் \"ஆம் (அறிவியுங்கள்)\" என்று கூறினோம் என முஹம்மத் பின் கைஸ் பின் மக்ரமா (ரஹ்) அவர்கள் தெரிவித்தார்கள். மற்றோர் அறிவிப்பில் (பின்வருமாறு) காணப்படுகிறது: ஒரு நாள் முஹம்மத் பின் கைஸ் பின் மக்ரமா பின் அல்முத்தலிப் (ரஹ்) அவர்கள், \"நான் என்னைப் பற்றியும் என் அன்னையைப் பற்றியும் உங்களுக்கு அறிவிக்க வேண்டாமா?\" என்று கேட்டார்கள். அவர்கள் தம்மை ஈன்றெடுத்த அன்னையைப் பற்றித்தான் குறிப்பிடுகிறார்கள் என்று நாங்கள் எண்ணினோம். பிறகு அவர்கள் கூறினார்கள்: (ஒரு நாள் அன்னை) ஆயிஷா (ரலி) அவர்கள் \"நான் என்னைப் பற்றியும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பற்றியும் உங்களுக்கு அறிவிக்க வேண்டாமா?\" என்று கேட்டார்கள். நாங்கள் \"ஆம் (அறிவியுங்கள்)\" என்று கூறினோம். அப்போது ஆயிஷா (ரலி) அவர்கள் பின்வருமாறு கூறினார்கள்: நபி (ஸல்) அவர்கள் என்னுடன் தங்க வேண்டிய இரவில் (என்னிடம்) வந்தார்கள். தமது மேலாடையை (எடுத்துக் கீழே) வைத்தார்கள்; தம் காலணிகளைக் கழற்றித் தமது கால்மாட்டில் வைத்துவிட்டுத் தமது கீழாடையின் ஓரத்தைப் படுக்கையில் விரித்து அதில் ஒருக்களித்துப் படுத்திருந்தார்கள். நான் உறங்கிவிட்டேன் என்று அவர்கள் எண்ணும் அளவு பொறுத்திருந்தார்கள். (நான் உறங்கிவிட்டதாக எண்ணியதும்) மெதுவாகத் தமது மேலாடையை எடுத்து (அணிந்து)கொண்டார்கள்; மெதுவாகக் காலணிகளை அணிந்தார்கள்; கதவைத் திறந்து வெளியே சென்று மெதுவாகக் கதவை மூடினார்கள். உடனே நான் எனது தலைத் துணியை எடுத்து, தலையில் வைத்து மறைத்துக் கொண்டேன்; கீழாடையை அணிந்துகொண்டு அவர்களைப் பின்தொடர்ந்து நடந்தேன். அவர்கள் \"அல்பகீஉ\" பொது மையவாடிக்குச் சென்று நின்றார்கள்; அங்கு நீண்ட நேரம் நின்றிருந்தார்கள். பிறகு மூன்று முறை கைகளை உயர்த்தினார்கள். பிறகு (வீடு நோக்கித்) திரும்பினார்கள்; நானும் திரும்பினேன். அவர்கள் விரைவாக நடந்தபோது நானும் விரைவாக நடந்தேன். அவர்கள் ஓடிவந்தார்கள்; நானும் (அவ்வாறே) ஓடிவந்தேன்;அவர்களுக்கு முன்னால் (வீட்டுக்கு) வந்து படுத்துக்கொண்டேன். நான் படுத்த சிறிது நேரத்தில் அவர்கள் (வீட்டுக்குள்) வந்து \"ஆயிஷ்! உனக்கு என்ன நேர்ந்தது? உனக்கு ஏன் மூச்சு வாங்குகிறது?\" என்று கேட்டார்கள். நான் \"ஒன்றுமில்லை\" என்றேன். அதற்கு அவர்கள் \"ஒன்று, நீயாகச் சொல்லிவிடு! இல்லாவிட்டால் நுண்ணறிவாளனும் மென்மையானவனுமான அல்லாஹ் எனக்கு அறிவித்துவிடுவான்\" என்று கூறினார்கள். நான் \"அல்லாஹ்வின் தூதரே, என் தந்தையும் என் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும்!\" என்று கூறிவிட்டு, நடந்ததை அவர்களிடம் தெரிவித்தேன். அவர்கள் \"ஓ நீதான் எனக்கு முன்னால் நான் கண்ட அந்த உருவமா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். உடனே அவர்கள் என் நெஞ்சில் கையை வைத்துத் தள்ளினார்கள். எனக்கு வலித்தது. பிறகு \"அல்லாஹ்வும் அவனுடைய தூதரும் (உனக்கு) அநீதியிழைத்துவிடுவார்கள் என நீ எண்ணிக்கொண்டாயோ?\" என்று கேட்டார்கள். நான் \"ஆம்! மனிதர்கள் என்னதான் மறைத்தாலும் அல்லாஹ் அதை அறிந்துவிடுவானே!\" என்று கூறினேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீ என்னைக் கண்டபோது (வானவர்) ஜிப்ரீல் என்னிடம் வந்து மறைவாக ஓரிடத்தில் நின்றுகொண்டு என்னை அழைத்தார். நானும் அவரது அழைப்பை ஏற்று உனக்குத் தெரியாமல் மறைவாக அவரிடம் சென்றேன். -(பொதுவாக) நீ உனது ஆடையை கழற்றிவைத்துவிட்ட நேரங்களில் அவர் நீ இருக்கும் இடத்திற்கு வரமாட்டார்- (எனவே தான், மறைவாக நின்று அவர் என்னை அழைத்தார்.) நான் நீ உறங்கிவிட்டதாக நினைத்தேன். உன்னை எழுப்பிவிடவும் நான் விரும்பவில்லை. நீ தனிமையில் இருப்பதை நினைத்து பயந்துவிடுவாய் என்று நான் அஞ்சினேன். (எனவே, உன்னை உறக்கத்திலிருந்து எழுப்பவில்லை.) அப்போது ஜிப்ரீல் \"உம் இறைவன் உம்மை \"பகீஉ\"வாசிகளிடம் சென்று அவர்களுக்காகப் பாவமன்னிப்புக் கோரும்படி கட்டளையிடுகின்றான்\" என்று கூறினார்\" என்றார்கள். தொடர்ந்து ஆயிஷா (ரலி) அவர்கள் கூறுகிறார்கள்: நான் \"அல்லாஹ்வின் தூதரே! அ(டக்கத்தலங்களில் இருப்ப)வர்களுக்காக நான் என்ன சொல்ல வேண்டும்?\" என்று கேட்டேன். அதற்கு அவர்கள், \"அஸ்ஸலாமு அலா அஹ்லித் தியாரி மினல் முஃமினீன வல் முஸ்லிமீன். வ யர்ஹமுல்லாஹுல் முஸ்தக்திமீன மின்னா வல் முஸ்தஃகிரீன். வ இன்னா இன்ஷா அல்லாஹு பி(க்)கும் ல லாஹிகூன்\" என்று சொல்\" என்றார்கள். (பொருள்: அடக்கத்தலங்களில் உள்ள இறைநம்பிக்கையாளர்களுக்கும் முஸ்லிம்களுக்கும் சாந்தி பொழியட்டும்! நம்மில் முந்திச் சென்றுவிட்டவர்களுக்கும் பிந்தி வருபவர்களுக்கும் அல்லாஹ் கருணை புரிவானாக! நாம் அல்லாஹ் நாடினால் உங்களுக்குப் பின்னால் வந்து சேரக்கூடியவர்களாக உள்ளோம்.) அத்தியாயம் : 11",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		}
	]
}