{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"13": "The Book of Fasting "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2730,
			"arabicnumber": "1159.02",
			"text": "யஹ்யா பின் அபீகஸீர் (ரஹ்) அவர்கள் கூறியதாவது: நானும் அப்துல்லாஹ் பின் யஸீத் (ரஹ்) அவர்களும் அபூசலமா பின் அப்திர் ரஹ்மான் பின் அவ்ஃப் (ரஹ்) அவர்களிடம் சென்றோம். அவர்களை அழைத்துவருமாறு ஆளனுப்பிவிட்டு, அவர்கள் எங்களிடம் வரும்வரை அவர்களது வீட்டுக்கு அருகிலிருந்த ஒரு பள்ளிவாசலில் நாங்கள் (காத்து) இருந்தோம். அவர்கள் எங்களிடம் வந்தபோது, \"நீங்கள் நாடினால் (என் வீட்டுக்குள்) வரலாம்; நீங்கள் நாடினால் இங்கேயே அமரலாம்\" என்றார்கள். நாங்கள், \"இல்லை, இங்கேயே அமருகிறோம். எங்களுக்கு ஹதீஸ் அறிவியுங்கள்\" என்றோம். அப்போது அவர்கள் கூறினார்கள்: என்னிடம் அப்துல்லாஹ் பின் அம்ர் பின் அல்ஆஸ் (ரலி) அவர்கள் அறிவித்தார்கள்: நான் பகலெல்லாம் நோன்பு நோற்று, ஒவ்வோர் இரவிலும் குர்ஆன் முழுவதையும் ஓதியும் வந்தேன். அப்போது \"என்னைப் பற்றி நபி (ஸல்) அவர்களிடம் சொல்லப்பட்டது\" அல்லது \"(என்னை அழைத்து வருமாறு) அவர்கள் என்னிடம் ஆளனுப்பினார்கள்.\" நான் அவர்களிடம் சென்றேன். அப்போது அவர்கள் என்னிடம், \"நீர் (பகற்)காலமெல்லாம் நோன்பு நோற்று, ஒவ்வோர் இரவிலும் குர்ஆன் முழுவதையும் ஓதிவருவதாக எனக்குச் செய்தி வந்ததே (அது உண்மையா)?\" என்று கேட்டார்கள். நான், \"ஆம், அல்லாஹ்வின் தூதரே! இதன் மூலம் நான் நன்மையைத் தவிர வேறெதையும் நாடவில்லை\" என்றேன். அவர்கள், \"ஒவ்வொரு மாதமும் மூன்று நாட்கள் நோன்பு நோற்பது உமக்குப் போதுமே!\" என்றார்கள். நான், \"அல்லாஹ்வின் தூதரே! என்னால் இதைவிடக் கூடுதலாகச் செய்ய முடியும்\" என்றேன். அவர்கள், \"உம் துணைவிக்குச் செய்ய வேண்டிய கடமைகள் உமக்கு இருக்கின்றன. உம் விருந்தினருக்குச் செய்யவேண்டிய கடமைகள் உமக்கு உள்ளன. உமது உடலுக்குச் செய்யவேண்டிய கடமைகளும் உமக்கு உண்டு. எனவே, இறைத்தூதர் தாவூத் (அலை) அவர்களைப் போன்று நோன்பு நோற்பீராக! ஏனெனில், தாவூத் (அலை) அவர்கள் மக்களிடையே மாபெரும் வணக்கசாலியாக இருந்தார்கள்\" என்று கூறினார்கள். நான், \"அல்லாஹ்வின் தூதரே! தாவூத் (அலை) அவர்களின் நோன்பு என்ன?\" என்று கேட்டேன். \"ஒரு நாள் நோன்பு நோற்று ஒரு நாள் நோன்பை விடுவதே அவர்களது நோன்பாகும்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். மேலும், \"மாதத்திற்கு ஒரு தடவை குர்ஆனை ஓதி நிறைவு செய்வீராக!\" என்று கூறினார்கள். நான், \"அல்லாஹ்வின் தூதரே! என்னால் இதைவிடக் கூடுதலாகச் செய்யமுடியும்\" என்றேன். \"அவ்வாறாயின் இருபது நாட்களுக்கு ஒரு தடவை குர்ஆனை ஓதி நிறைவு செய்வீராக!\" என்றார்கள். நான், \"அல்லாஹ்வின் தூதரே! என்னால் இதைவிடக் கூடுதலாகச் செய்ய முடியும்\" என்றேன். \"அப்படியானால், பத்து நாட்களுக்கு ஒரு தடவை குர்ஆனை ஓதி நிறைவு செய்வீராக!\" என்றார்கள். நான், \"அல்லாஹ்வின் தூதரே! என்னால் இதைவிடக் கூடுதலாகச் செய்யமுடியும்!\" என்றேன். \"அவ்வாறாயின் வாரத்துக்கு ஒரு தடவை குர்ஆனை ஓதி நிறைவு செய்வீராக! அதைவிட அதிகமாக்க வேண்டாம். ஏனெனில், உம் துணைவிக்குச் செய்யவேண்டிய கடமைகள் உமக்கு உள்ளன;உம் விருந்தினருக்குச் செய்யவேண்டிய கடமைகளும் உமக்கு உள்ளன; உமது உடலுக்குச் செய்ய வேண்டிய கடமைகளும் உமக்கு உள்ளன\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். ஆனால், நான் சிரமத்தை வலிந்து ஏற்றுக்கொண்டேன்; அதனால் என்மீது சிரமம் சுமத்தப்பட்டது. என்னிடம் நபி (ஸல்) அவர்கள், \"உமக்குத் தெரியாது; உமது வயது நீளக்கூடும் (அப்போது தொடர்நோன்பும் தொடர்வழிபாடும் உம்மால் முடியாமல் போகலாம்)\" என்றார்கள். நபி (ஸல்) அவர்கள் கூறியதைப் போன்று நான் ஆனேன். முதுமை அடைந்த பின், நபி (ஸல்) அவர்களின் சலுகையை நான் ஏற்றுக்கொண்டிருந்தால் நன்றாயிருந்திருக்குமே என்று நான் விரும்பினேன். (அந்த அளவிற்கு நான் பலவீனப்பட்டு விட்டேன்). அத்தியாயம் : 13",
			"grades": [],
			"reference": {
				"book": 13,
				"hadith": 236
			}
		}
	]
}