{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2982,
			"arabicnumber": "1227",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"விடைபெறும்\" ஹஜ்ஜின்போது உம்ராவுடன் ஹஜ்ஜையும் நிறைவேற்றினார்கள்.அவர்கள் பலிப்பிராணியை (ஹஜ்ஜில்) அறுத்துப் பலியிட்டார்கள். (மதீனாவாசிகள் \"இஹ்ராம்\" கட்டும் எல்லையான) துல்ஹுலைஃபாவில் இருந்தே தம்முடன் பலிப்பிராணியை நபியவர்கள் கொண்டுவந்தார்கள். முதலில் உம்ராவிற்காக இஹ்ராம் கட்டி தல்பியா கூறி, பின்னர் ஹஜ்ஜுக்காக இஹ்ராம் கட்டி தல்பியா கூறினார்கள். மக்களும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் உம்ராவிற்கும் ஹஜ்ஜுக்குமாக \"இஹ்ராம்\" கட்டியிருந்தனர். மக்களில் சிலர் பலிப்பிராணியை அறுத்துப் பலியிடுபவர்களாக இருந்தனர். (அதற்காக) அவர்கள் பலிப்பிராணியைத் தம்முடன் கொண்டுவந்திருந்தனர். வேறுசிலரோ அறுத்துப் பலியிடுபவர்களாக இருக்கவில்லை. (ஏனெனில், அவர்கள் தம்முடன் பலிப்பிராணியை கொண்டு வந்திருக்கவில்லை.) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவிற்கு வந்ததும், மக்களிடம் \"உங்களில் பலிப் பிராணியைக் கொண்டுவந்தவர்கள்,தமது ஹஜ்ஜை நிறைவு செய்யாதவரை இஹ்ராமிலிருந்து விடுபடக்கூடாது. பலிப்பிராணியைக் கொண்டுவராதவர்கள் இறை யில்லம் கஅபாவையும், ஸஃபா மற்றும் மர்வாவுக்கிடையேயும் சுற்றி வந்துவிட்டு, தமது தலைமுடியை குறைத்துக்கொண்டு இஹ்ராமிலிருந்து விடுபட்டுக்கொள்ளட்டும். பின்னர் ஹஜ்ஜுக்காக \"இஹ்ராம்\" கட்டி அறுத்துப் பலியிடட்டும். பலிப்பிராணி கிடைக்காதவர்கள், ஹஜ்ஜின் நாட்களில் மூன்று நோன்புகளும் (ஹஜ்ஜை முடித்து) தமது வீடு திரும்பியதும் ஏழு நோன்புகளும் நோற்றுக்கொள்ளட்டும்\" என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்காவிற்கு வந்ததும் (கஅபாவை ஏழு முறை) சுற்றிவந்து விட்டு, முதல் வேலையாக (கஅபாவின்) மூலையை (ஒட்டிப் பதிக்கப்பெற்றுள்ள ஹஜருல் அஸ்வதை)த் தொட்டு முத்தமிட்டார்கள். ஏழில் மூன்று சுற்றுகள் (தோள்களைக் குலுக்கி) வேகமாக நடந்தும், நான்கு சுற்றுகள் மெதுவாக நடந்தும் சுற்றி (தவாஃபுல் குதூம்) வந்தார்கள். இறையில்லத்தைச் சுற்றி முடித்ததும் மகாமு இப்ராஹீமில் இரண்டு ரக்அத்கள் தொழுதார்கள். பின்னர் சலாம் கொடுத்துவிட்டு நேராக ஸஃபாவுக்குச் சென்று, ஸஃபா மற்றும் மர்வாவுக்கிடையே ஏழு தடவைச் சுற்றி (சயீ) வந்தார்கள். பிறகு ஹஜ்ஜை முடிக்கும்வரை அவர்கள் இஹ்ராமிலிருந்து விடுபடாமலிருந்தார்கள். துல்ஹஜ் பத்தாவது நாள் (யவ்முந் நஹ்ர்) அன்று தமது பலிப்பிராணியை அறுத்துப் பலியிட்டார்கள். பிறகு அங்கிருந்து திரும்பி இறையில்லம் கஅபாவைச் சுற்றி (தவாஃபுல் இஃபாளா) வந்துவிட்டுப் பின்னர் இஹ்ராமிலிருந்து விடுபட்டார்கள். மக்களில் பலிப்பிராணியைக் கொண்டுவந்து அறுத்துப் பலியிட்டவர்களும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்ததைப் போன்றே செய்தனர். அத்தியாயம் : 15",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 190
			}
		}
	]
}