{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3081,
			"arabicnumber": "1277.03",
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: நான் நபி (ஸல்) அவர்களின் துணைவியார் ஆயிஷா (ரலி) அவர்களிடம், \"ஸஃபா மற்றும் மர்வாவுக்கிடையே சுற்றிவராத எவர்மீதும் (குற்றம்) ஏதுமிருப்பதாக நான் கருதவில்லை. (எனவே) அவ்விரண்டுக்குமிடையே நான் சுற்றி வராமலிருப்பதை நான் ஒரு பொருட்டாகவே எண்ண மாட்டேன்\" என்றேன். அதற்கு ஆயிஷா (ரலி) அவர்கள், \"என் சகோதரி (அஸ்மாவின்) மகனே! நீ சொல்வது தவறு. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் முஸ்லிம்களும் (ஸஃபா மற்றும் மர்வாவுக்கிடையே) சுற்றிவந்தனர். எனவே, அது ஒரு நபிவழியாக ஆகிவிட்டது. \"முஷல்லல்\" எனும் இடத்திலிருந்த சிலைகளுக்காக \"இஹ்ராம்\" கட்டியவர்களே ஸஃபா மற்றும் மர்வாவுக்கிடையே சுற்றி வராமலிருந்தனர். இஸ்லாம் வந்தபோது, அதைப் பற்றி நாங்கள் நபி (ஸல்) அவர்களிடம் வினவினோம். அப்போதுதான் வலிவும் மாண்பும் உடைய அல்லாஹ், \"ஸஃபாவும் மர்வாவும் அல்லாஹ்வின் சின்னங்கள். எனவே, யார் அந்த (கஅபா) ஆலயத்தில் ஹஜ்ஜோ, உம்ராவோ செய்கிறாரோ, அவர்மீது அவ்விரண்டையும் சுற்றிவருவது குற்றமில்லை\" எனும் (2:158ஆவது) வசனத்தை அருளினான். (இவ்வசனத்தில்) \"அவ்விரண்டையும் சுற்றாமலிருப்பது குற்றமில்லை\" என்றிருந்தால்தான் நீ சொல்லும் கருத்து வரும்\" என்றார்கள். இதன் அறிவிப்பாளரான இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறுகின்றார்கள்: இந்த ஹதீஸை நான் அபூபக்ர் பின் அப்திர் ரஹ்மான் பின் அல்ஹாரிஸ் பின் ஹிஷாம் (ரஹ்) அவர்களிடம் சொன்னபோது,அதைக் கேட்டு அவர்கள் வியப்படைந்தார்கள். (\"இந்த வசனத்திற்கு) இதுதான் (சரியான) விளக்கமாகும். அறிஞர்களில் பலர் \"ஸஃபா மற்றும் மர்வாவுக்கிடையே சுற்றிவராத அரபுகள் \"இவ்விரு கற்(குன்று)களுக்கிடையே சுற்றிவருவது அறியாமைக் காலச்செயலாகும்\" என்றார்கள் என்று கூறியதை நான் கேட்டுள்ளேன். (ஆனால்) அன்சாரிகளில் வேறுசிலரோ \"இறையில்லம் கஅபாவைச் சுற்றிவருமாறே நாம் பணிக்கப்பட்டுள்ளோம். ஸஃபா மற்றும் மர்வாவுக்கிடையே அவ்வாறு (சுற்றிவருமாறு) நாம் பணிக்கப்படவில்லை\" என்று கூறினர். அப்போதுதான் வலிவும் மாண்பும் உடைய அல்லாஹ் \"ஸஃபாவும் மர்வாவும் அல்லாஹ்வின் சின்னங்கள்...\" என்று (2:158ஆவது) தொடங்கும் வசனத்தை அருளினான். இந்த வசனம் இவ்விருசாரார் தொடர்பாகவும் அருளப் பெற்றிருக்கலாம் என நான் கருதுகிறேன்\" என்று அபூபக்ர் பின் அப்திர் ரஹ்மான் (ரஹ்) அவர்கள் கூறினார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 15",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 287
			}
		}
	]
}