{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"15": "The Book of Pilgrimage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3336,
			"arabicnumber": "1374.01",
			"text": "மஹ்ரீயின் முன்னாள் அடிமையான அபூசயீத் (ரஹ்) அவர்கள் கூறியதாவது: (ஒரு முறை) மதீனாவில் மக்களுக்குப் பஞ்சமும் கஷ்டமும் ஏற்பட்டன. அப்போது நான் அபூசயீத் அல்குத்ரீ (ரலி) அவர்களிடம் சென்று \"நான் குழந்தை குட்டிகள் அதிகம் உடையவன்; எங்களுக்குக் கடுமை(யான நெருக்கடி) ஏற்பட்டுள்ளது. எனவே, நான் என் குடும்பத்தாருடன் (மதீனாவைவிட்டு) ஏதேனும் ஒரு செழிப்பான ஊருக்கு இடம்பெயர விரும்புகிறேன்\" என்று கூறினேன். அதற்கு அபூசயீத் (ரலி) அவர்கள், \"அவ்வாறு செய்யாதே! மதீனாவையே (உங்கள் இருப்பிடமாக) வைத்துக்கொள்! ஏனெனில், நாங்கள் (ஒரு முறை) அல்லாஹ்வின் நபி (ஸல்) அவர்களுடன் (மதீனாவிலிருந்து) புறப்பட்டு \"உஸ்ஃபான்\" எனும் இடத்திற்குச் சென்றோம். அங்கு பல இரவுகள் தங்கினோம். அப்போது மக்களில் சிலர், \"அல்லாஹ்வின் மீதாணையாக! நாம் எந்த (நிம்மதியான) நிலையிலும் இல்லை. நம் குடும்பத்தார் தனிமையில் உள்ளனர். அவர்களைக் குறித்து அச்சமற்ற நிலையில் நாம் இல்லை\" என்று கூறினர். இச்செய்தி நபி (ஸல்) அவர்களுக்கு எட்டியபோது, \"நீங்கள் சொன்னதாக எனக்கு எட்டியுள்ள இத்தகவல் என்ன? \"நான் எவன்மீது சத்தியம் செய்வேனோ\" அல்லது \"என் உயிர் எவன் கையிலுள்ளதோ\" அவன்மீது சத்தியமாக! \"நீங்கள் விரும்பினால்\" எனது ஒட்டகத்தில் சேணத்தைப் பூட்டுமாறு கட்டளையிட்டு, அதன் முடிச்சுகள் எதையும் அவிழ்க்காமல் (விரைந்து) நான் மதீனாவிற்குச் செல்ல வேண்டும்; அல்லது (அவ்வாறு செல்ல) \"நான் எண்ணுகிறேன்\" என்று கூறிவிட்டு, \"இறைவா! இப்ராஹீம் (அலை) அவர்கள் மக்காவைப் புனித நகரமாக ஆக்கினார்கள். நான் மதீனாவின் இரு கருங்கல் மலைகளுக்கு இடைப்பட்ட பகுதியைப் புனிதமானதாக ஆக்கினேன். மதீனாவிற்குள் இரத்தம் சிந்தப்படக் கூடாது. அங்கு போருக்காக ஆயுதம் ஏந்தப்படக்கூடாது. அங்கு தீனிக்காகத் தவிர எந்தத் தாவரமும் வெட்டப்படக் கூடாது. இறைவா! எங்கள் நகரில் எங்களுக்கு வளம் சேர்ப்பாயாக! இறைவா! எங்கள் (பெரிய அளவையான) \"ஸாஉ\"வில் எங்களுக்கு வளத்தை ஏற்படுத்துவாயாக! இறைவா! எங்கள் (சிறிய அளவையான) \"முத்\"துவிலும் எங்களுக்கு வளத்தை ஏற்படுத்துவாயாக! இறைவா! எங்கள் \"ஸாஉ\"விலும், எங்கள் \"முத்\"துவிலும், எங்கள் நகரத்திலும் எங்களுக்கு வளம் சேர்ப்பாயாக! இறைவா! இப்போதுள்ள வளத்துடன் இரு(மடங்கு) வளத்தை ஏற்படுத்துவாயாக!\" (என்று பிரார்த்தித்தார்கள். பிறகு) \"என் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! மதீனாவின் அனைத்து கணவாய்களிலும் சாலை முனைகளிலும் இரு வானவர்கள் இருந்து அதைக் காவல் புரிந்து கொண்டேயிருக்கின்றனர்; நீங்கள் மதீனா சென்றடையும் வரை (அவ்வாறு காவல் புரிந்து கொண்டிருக்கின்றனர்)\" என்று கூறினார்கள். பிறகு மக்களிடம், \"புறப்படுங்கள்\" என்றார்கள். அவ்வாறே நாங்கள் மதீனா நோக்கிப் புறப்பட்டோம். \"நாங்கள் எவன்மீது சத்தியம் செய்வோமோ\" அல்லது \"எவன்மீது சத்தியம் செய்யப்படுமோ\" அவன்மீது ஆணையாக! (இங்கு அறிவிப்பாளர் ஹம்மாம் பின் இஸ்மாயீல் (ரஹ்) அவர்களே ஐயத்துடன் அறிவிக்கிறார்கள்.) நாங்கள் மதீனாவிற்குள் நுழைந்து எங்கள் ஒட்டகங்களிலிருந்து சேணங்களை நாங்கள் இறக்கி வைத்திருக்கவில்லை. அதற்குள் எங்கள்மீது அப்துல்லாஹ் பின் ஃகத்ஃபானின் மக்கள் தாக்குதல் தொடுத்தனர். அதற்கு முன் (தாக்குதல் தொடுக்க) எந்தத் தூண்டுகோலும் அவர்களுக்கு இருக்கவில்லை. அத்தியாயம் : 15",
			"grades": [],
			"reference": {
				"book": 15,
				"hadith": 540
			}
		}
	]
}