{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 369,
			"arabicnumber": "144.01",
			"text": "ஹுதைஃபா பின் அல்யமான் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (கலீஃபா) உமர் (ரலி) அவர்களிடம் அமர்ந்திருந்தோம். அப்போது அவர்கள், \"உங்களில் யார் சோதனை (ஃபித்னா) தொடர்பாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்றுள்ளார்?\" என்று கேட்டார்கள். அப்போது சிலர், \"நாங்கள் செவியுற்றுள்ளோம்\" என்று கூறினர். உமர் (ரலி) அவர்கள், \"ஒரு மனிதன் தன் குடும்பத்தார் மற்றும் அண்டை வீட்டார் விஷயத்தில் சோதனைக்கு உள்ளாக்கப்படுவதையே நீங்கள் நினைக்கிறீர்கள் போலும்\" என்று கூறினார்கள். அதற்கு மக்கள், \"ஆம்\" என்றனர். \"இத்தகைய சோதனையில் ஆழ்த்தப்படும் போது தொழுகை, நோன்பு, தானதர்மம் ஆகியவை அதற்கான பரிகாரமாக அமைந்து விடும். (நான் அந்த அர்த்தத்திலுள்ள ஃபித்னா பற்றி உங்களிடம் கேட்கவில்லை.) மாறாக, கடல் அலையைப் போன்று அடுக்கடுக்காகத் தோன்றும் என நபியவர்கள் (முன்னறிவிப்பாகக்) கூறிய (அரசியல் குழப்பம் எனும் பொருள் கொண்ட) ஃபித்னாவைப் பற்றிச் செவியுற்றவர் உங்களில் யார்?\" என்று கேட்டார்கள். அப்போது மக்கள் (பதிலளிக்காமல்) அமைதியாக இருந்தனர். ஆகவே, நான், \"நான் (செவியுற்றுள்ளேன்)\" என்று கூறினேன். \"உம் தந்தை அல்லாஹ்வுக்கு அர்ப்பணம்! (உம்மைப் போன்றே அவரும் நல்ல மனிதர்.) நீரா (செவியுற்றீர்)?\" என்று கேட்க, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்றதை(ப் பின்வருமாறு) கூறினேன்: கோரை கோரையாக வைத்துப் பாய் பின்னப்படுவதைப் போன்று மக்கள் உள்ளங்களில் சோதனைகள் பின்னப்படும். எந்த உள்ளம் அந்தச் சோதனைகளில் அமிழ்ந்துவிடுகிறதோ அந்த உள்ளத்தில் ஒரு கரும்புள்ளி இடப்படும். எந்த உள்ளம் அவற்றை நிராகரித்து விடுகிறதோ அந்த உள்ளத்தில் ஒரு வெண்புள்ளி இடப்படும். இவ்வாறு சோதனைகள் இரு விதமான உள்ளங்களில் ஏற்படுகின்றன. ஒன்று, வெண்பாறை போன்று தூய்மையானது; வானங்களும் பூமியும் நிலைத்திருக்கும்வரை எந்தச் சோதனையும் அதற்கு இடரளிக்காது. மற்றொன்று, சிறிதளவு வெண்மை கலந்த கருமையான உள்ளம். அது தலைகீழாகக் கவிழ்க்கப்பட்ட கூஜாவைப் போன்று நல்லதை அறியவும் செய்யாது; தீமையை நிராகரிக்கவும் செய்யாது. மனஇச்சையில் அமிழ்ந்து கிடப்பது ஒன்றுதான் அதற்குத் தெரிந்ததெல்லாம். (அறிவிப்பாளர் ஹுதைஃபா (ரலி) அவர்கள் கூறுகின்றார்கள்:) (மேற்கண்ட ஹதீஸை நான் உமர் (ரலி) அவர்களிடம் அறிவித்துவிட்டு, \"இறை நம்பிக்கையாளர்களின் தலைவரே!) உங்களுக்கும் அந்தக் குழப்பங்களுக்கும் இடையே மூடிய கதவு ஒன்று உண்டு; அக்கதவு (விரைவில்) உடைக்கப்படக் கூடும்\" என்று கூறினேன். உடனே உமர் (ரலி) அவர்கள், \"நீர் தந்தையற்றுப் போவீர்! அது உடைக்கப்படுமா? அது (உடைக்கப் படாமல்) திறக்கப்பட்டாலாவது மீண்டும் அது மூடப்பட இடமுண்டே!\" என்று கூறினார்கள். நான், \"இல்லை. (அது திறக்கப்படாது.) உடைக்கத்தான் படும்\" என்று சொன்னேன். மேலும், நான் அவர்களிடம் \"அந்தக் கதவு \"கொல்லப்படவிருக்கும்\" அல்லது \"இறந்துபோகவிருக்கும்\" ஒரு மனிதர் தாம். இது கட்டுக்கதை அன்று. (உண்மையான செய்திதான்)\" என்றும் கூறினேன். (இதன் அறிவிப்பாளர்களில் ஒருவரான) அபூகாலித் (ரஹ்) அவர்கள் கூறுகிறார்கள்: நான் (அறிவிப்பாளர்) சஅத் பின் தாரிக் (ரஹ்) அவர்களிடம், \"அபூமாலிக்கே! (இந்த ஹதீஸின் மூலத்திலுள்ள) \"அஸ்வது முர்பாத்தன்\" என்பதன் பொருள் என்ன?\" என்று கேட்டேன். அதற்கு அவர்கள், \"கறுப்பில் தூய வெள்ளை\" என்று கூறினார்கள். நான் \"அல்கூஸு முஜக்கியன்\" என்பதன் பொருள் யாது?\" என்று கேட்டேன். அதற்கு, \"தலைகீழாகக் கவிழ்க்கப்பட்ட கூஜா\" என்று பதிலளித்தார்கள். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், (கலீஃபா) உமர் (ரலி) அவர்களிடமிருந்து (விடைபெற்று மதீனாவிலிருந்து) ஹுதைஃபா (ரலி) அவர்கள் புறப்பட்டு (கூஃபா) வந்து எங்களுடன் அமர்ந்துகொண்டு (பின்வருமாறு) கூறினார்கள் என்று காணப்படுகிறது: நான் நேற்று இறைநம்பிக்கையாளர்களின் தலைவரிடம் அமர்ந்திருந்தபோது அவர்கள் தம் தோழர்களிடம், \"உங்களில் யார் (இனி தலைதூக்கவிருக்கும் அரசியல்) குழப்பங்கள் குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொன்னதை நினைவில் வைத்திருக்கிறார்?\" என்று கேட்டார்கள். அபூமாலிக் (ரஹ்) அவர்கள் அளித்த அருஞ் சொற்பொருள்கள் அதில் குறிப்பிடப்படவில்லை. - மேற்கண்ட ஹதீஸ் மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் பின்வருமாறு காணப்படுகிறது: உமர் (ரலி) அவர்கள் மக்களிடம் \"(அரசியல்) குழப்பங்கள் குறித்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை எமக்கு அறிவிப்பவர் உங்களில் யார்?\" என்று கேட்டார்கள். அங்கு ஹுதைஃபா (ரலி) அவர்களும் இருந்தார்கள். அவர்கள் \"நான் (கேட்டிருக்கிறேன்)\" என்று கூறினார்கள். ஹதீஸின் இறுதியில் \"இது கட்டுக்கதை அன்று; அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதுதான்\" என ஹுதைஃபா (ரலி) அவர்கள் தெரிவித்துள்ளார்கள். அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 276
			}
		}
	]
}