{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"18": "The Book of Divorce "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3692,
			"arabicnumber": "1479.02",
			"text": "அப்துல்லாஹ் பின் அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: நான் ஓராண்டு காலமாக ஒரு வசனத்தைப் பற்றி உமர் பின் அல்கத்தாப் (ரலி) அவர்களிடம் (விளக்கம்) கேட்க வேண்டுமென்று காத்துக்கொண்டிருந்தேன். ஆனால், அவர்கள் மீதிருந்த (மரியாதை கலந்த) அச்சம் காரணமாகக் கேட்பதற்குத் துணிவு வரவில்லை. (ஒரு முறை) உமர் (ரலி) அவர்கள் ஹஜ்ஜுக்காகப் புறப்பட்டுச் சென்றபோது நானும் அவர்களுடன் புறப்பட்டேன். அவர்கள் (ஹஜ்ஜை முடித்துக்கொண்டு) திரும்பி வரும் வழியில் நாங்கள் (மர்ருழ் ழஹ்ரான் எனும்) ஒரு சாலையில் இருந்தோம். அப்போது உமர் (ரலி) அவர்கள் தமது இயற்கைக் கடனை நிறைவேற்றுவதற்காக \"அராக்\" (மிஸ்வாக்) மரத்தை நோக்கி ஒதுங்கிச் சென்றார்கள். அவர்கள் இயற்கைக் கடனை நிறைவேற்றிவிட்டு வரும்வரை நான் (அவர்களை எதிர்பார்த்தபடி) அவர்களுக்காக நின்று கொண்டிருந்தேன். பிறகு அவர்களுடன் செல்லலானேன். அப்போது அவர்களிடம் நான், \"இறை நம்பிக்கையாளர்களின் தலைவரே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் துணைவியரில் (நபியவர்களைச் சஞ்சலப்படுத்தும் வகையில்) ஒருவருக்கொருவர் (கூடிப் பேசி) உதவி புரிந்தவர்கள் யார்?\" என்று கேட்டேன். அதற்கு அவர்கள், \"ஹஃப்ஸாவும் ஆயிஷா (ரலி) அவர்களும்தாம்\" என்று பதிலளித்தார்கள். உடனே நான், \"அல்லாஹ்வின் மீதாணையாக! ஓராண்டு காலமாக இது குறித்து உங்களிடம் நான் கேட்க வேண்டுமென எண்ணியிருந்தேன். ஆனால், உங்கள்மீது (எனக்கு) உள்ள (மரியாதை கலந்த) அச்சம் காரணமாக எனக்குத் துணிவு வரவில்லை\" என்று சொன்னேன். அதற்கு \"(இப்படிச்) செய்யாதீர்கள். என்னிடம் ஓர் அறிவு இருப்பதாக நீங்கள் எண்ணினால், என்னிடம் அது குறித்துக் கேட்டுவிடுங்கள். (உண்மையிலேயே) அதை நான் அறிந்திருந்தால், உங்களுக்கு நான் தெரிவிக்கிறேன்\" என்று கூறிய உமர் (ரலி) அவர்கள், பிறகு (பின்வருமாறு) கூறினார்கள்: அல்லாஹ்வின் மீதாணையாக! அறியாமைக் காலத்தில் பெண்களுக்கு எந்த உரிமையும் இருப்பதாக நாங்கள் கருதியதில்லை. அவர்(களின் உரிமை)கள் தொடர்பாக, தான் அருளிய (சட்டத்)தை அல்லாஹ் அருளும் வரையிலும்,அவர்களுக்குரிய (செலவுத் தொகை, சொத்துரிமை ஆகிய)வற்றின் பங்குகளை அவன் நிர்ணயிக்கும் வரையிலும் (இந்நிலை நீடித்தது). இந்நிலையில் (ஒரு நாள்) நான் ஒரு விவகாரம் குறித்து ஆலோசித்துக்கொண்டிருந்தேன். அப்போது என் மனைவி, \"நீங்கள் இப்படி இப்படிச் செய்யலாமே!\" என்று என்னிடம் (ஆலோசனை) கூறினார். அவரிடம் நான், \"உனக்கும் இதற்கும் என்ன சம்பந்தம்? நான் தீர்மானிக்க வேண்டிய ஒரு விஷயத்தில் உன் தலையீடு எதற்கு?\" என்று கேட்டேன். அதற்கு அவர் என்னிடம், \"கத்தாபின் புதல்வரே! (இப்படிச் சொல்கின்ற) உங்களைப் பார்த்து நான் வியப்படைகிறேன். உங்களுடன் விவாதிக்கப்படுவதை நீங்கள் விரும்பவில்லை. ஆனால், உங்களுடைய புதல்வி (ஹஃப்ஸாவோ தம் கணவர்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் விவாதித்ததால் அன்றைய நாள் முழுக்க அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோபமாக இருந்தார்கள்\" என்று சொன்னார். உடனே நான் எழுந்து, எனது மேலங்கியை எடுத்துக்கொண்டு, அப்படியே அங்கிருந்து புறப்பட்டு ஹஃப்ஸாவிடம் சென்றேன். \"என் அருமை மகளே! நீ அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் வாதம் புரிந்து, அதனால் அவர்கள் அன்றைய தினம் முழுக்கக் கோபத்துடன் இருந்தார்களாமே (அது உண்மையா)?\" என்று ஹஃப்சாவிடம் கேட்டேன். அதற்கு ஹஃப்ஸா, \"அல்லாஹ்வின் மீதாணையாக! (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் துணைவியரான) நாங்கள் அவர்களுடன் விவாதிப்பதுண்டு\" என்றார். அதற்கு நான், \"அல்லாஹ்வின் தண்டனையையும் அவனுடைய தூதரின் கோபத்தையும் பற்றி உனக்கு நான் எச்சரிக்கிறேன் என்பதை அறிவாயாக! அருமை மகளே! தம்முடைய அழகும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம்மீது கொண்டுள்ள அன்பும் எவரைப் பூரிப்படைய வைத்துள்ளதோ அவரை (ஆயிஷாவை)ப் பார்த்து நீயும் துணிந்துவிடாதே!\" என்று (அறிவுரை) சொன்னேன். பிறகு நான் நேராக (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் மற்றொரு துணைவியான) உம்மு சலமாவிடம் (அவருக்கு அறிவுரை கூறச்) சென்றேன். ஏனெனில், அவர் என் (தாய்வழி) உறவினராவார். இது குறித்து அவரிடமும் நான் பேசினேன். அப்போது உம்மு சலமா என்னிடம், \"கத்தாபின் புதல்வரே! உம்மைக் கண்டு நான் வியப்படைகிறேன். எல்லா விஷயங்களிலும் தலையிட்டுவந்த நீங்கள், இப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும் அவர்களுடைய துணைவியருக்கும் இடையேயும் தலையிடும் அளவிற்கு வந்துவிட்டீர்களே!\" என்று கூறினார். உம்மு சலமா தம் பேச்சால் என்னை ஒரு பிடி பிடித்துவிட்டார். எனக்கு ஏற்பட்டிருந்த பாதி (கோப உணர்ச்சி)யை உடைத்தெறிந்துவிட்டார். ஆகவே, நான் அவரிடமிருந்து வெளியேறி (வந்து)விட்டேன். அன்சாரிகளில் எனக்கொரு நண்பர் இருந்தார். நான் (அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது அவையில்) இல்லாதபோது கிடைக்கும் செய்திகளை அவர் எனக்குத் தெரிவிப்பதும், அவர் இல்லாத போது கிடைக்கும் செய்திகளை நான் அவருக்குத் தெரிவிப்பதும் வழக்கம். (அந்தக் கால கட்டத்தில் சிரியா நாட்டு) \"ஃகஸ்ஸான்\" வமிச மன்னர்களில் ஒருவனைப் பற்றிய அச்சம் எங்களுக்கு இருந்துவந்தது. அவன் எங்கள் (மதீனா)மீது படையெடுக்கத் திட்டமிட்டிருப்பதாக எங்களிடம் சொல்லப்பட்டிருந்தது. இதனால் அவனைக் குறித்த அச்சம் எங்கள் நெஞ்சங்களில் நிரம்பியிருந்தது. இந்நிலையில் (ஒரு நாள்) அந்த அன்சாரி நண்பர் வந்து (என் வீட்டுக்) கதவைத் தட்டினார். \"திறங்கள்; திறங்கள்\"என்றார். (கதவைத் திறந்த) உடன் நான், \"ஃகஸ்ஸானிய (மன்ன)ன் வந்துவிட்டானா?\" என்று கேட்டேன். அதற்கு அவர், \"அதைவிடப் பெரியது நடந்துவிட்டது; அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் துணைவியரிடமிருந்து விலகிவிட்டார்கள்\" என்றார். உடனே நான், \"ஹஃப்ஸா, ஆயிஷா ஆகியோரின் மூக்கு மண்ணைக் கவ்வட்டும்!\" என்று கூறிவிட்டு, எனது உடையை எடுத்து (அணிந்து)கொண்டு புறப்பட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தபோது, அவர்கள் தமக்குரிய மாடியறையொன்றில் (தங்கி) இருந்தார்கள். ஏணிப்படி வழியாகவே அந்த அறைக்குச் செல்ல முடியும். அங்கே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய கறுப்புநிறப் பணியாளர் ஒருவர் (ரபாஹ்), ஏணியின் முதற்படியில் இருந்தார். அவரிடம் நான், \"இதோ உமர் (வந்துள்ளார் என அல்லாஹ்வின் தூதரிடம் கூறி அனுமதி கேள்)\" என்றேன். எனக்கு அனுமதி கிடைத்தபோது (அந்த அறைக்குச் சென்று) நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (எனக்கும் அவர்களுடைய துணைவியருக்குமிடையே நடைபெற்ற) இந்த உரையாடல்களை எடுத்துரைத்தேன். உம்மு சலமாவின் பேச்சு வந்தபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் புன்னகைத்தார்கள். அப்போது அவர்கள் ஓர் ஈச்சம் பாயில் இருந்தார்கள். அவர்களுக்கும் அந்தப் பாய்க்குமிடையே (விரிப்பு) எதுவும் இருக்கவில்லை. அவர்களது தலைக்குக் கீழே ஈச்ச நார்கள் நிரப்பப்பெற்ற தோல் தலையணை ஒன்றிருந்தது. அவர்களின் கால்களுக்கு அருகில் கருவேல இலைகள் குவிக்கப்பட்டிருந்தன. அவர்களது தலைமாட்டில் பதனிடப்படா தோல்கள் தொங்கிக்கொண்டிருந்தன. அப்போது அவர்களின் விலாப்புறத்தில் ஈச்சம் பாயின் சுவடு (பதிந்து) இருப்பதைக் கண்டு நான் அழுது விட்டேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஏன் அழுகிறீர்கள்?\" என்றார்கள். அதற்கு நான், \"அல்லாஹ்வின் தூதரே! (பாரசீக மற்றும் இத்தாலி மன்னர்களான) குஸ்ருவும் சீசரும் இருக்கும் நிலையே வேறு! (தாராளமான உலகச்செல்வங்களுடன் உல்லாசமாக வாழ்கின்றனர்.) தாங்களோ அல்லாஹ்வின் தூதராயிற்றே?\" என்றேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அ(ம்மன்ன)வர்களுக்கு இம்மையும் நமக்கு மறுமையும் இருப்பதை நீங்கள் திருப்திப்படவில்லையா?\" என்று கேட்டார்கள். அத்தியாயம் : 18",
			"grades": [],
			"reference": {
				"book": 18,
				"hadith": 41
			}
		}
	]
}