{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"21": "The Book of Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3945,
			"arabicnumber": "1548.01",
			"text": "ராஃபிஉ பின் கதீஜ் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் (விளைச்சலில்) மூன்றில் ஒரு பாகம் அல்லது நான்கில் ஒரு பாகம் அல்லது குறிப்பிட்ட உணவுப் பொருட்களை எங்களுக்குக் கொடுத்துவிட வேண்டும் எனும் நிபந்தனையின் பேரில் விளைநிலத்தைக் குத்தகைக்கு விட்டுவந்தோம். இந்நிலையில் ஒரு நாள் என் தந்தையின் சகோதரர்களில் ஒருவர் எங்களிடம் வந்து, \"நமக்குப் பயனளித்துக்கொண்டிருந்த ஒரு காரியத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நமக்குத் தடை விதித்துவிட்டார்கள். அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் கட்டுப்படுவதே அதைவிட மிகவும் நமக்குப் பயனளிக்கக்கூடியதாகும். நிலத்தைக் குத்தகைக்கு விட்டு, (விளைச்சலில்) மூன்றில் ஒரு பாகத்தையோ, நான்கில் ஒரு பாகத்தையோ, குறிப்பிட்ட உணவுப் பொருளையோ பெற்றுக்கொள்ள தடை விதித்தார்கள். நிலத்தின் உரிமையாளர் அதில் தாமே பயிரிட வேண்டும்; அல்லது (யாருக்கேனும்) பயிரிடக் கொடுத்துவிட வேண்டும் எனக் கட்டளையிட்டார்கள்; நிலத்தைக் குத்தகைக்கு விடுவதையும் அது அல்லாத முறையில் பயனடைவதையும் வெறுத்தார்கள்\" என்றார். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ராஃபிஉ பின் கதீஜ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், \"(விளைச்சலில்) மூன்றில் ஒரு பாகம் அல்லது நான்கில் ஒரு பாகத்தை எங்களுக்குத் தந்துவிட வேண்டும் எனும் நிபந்தனையின் பேரில் விளைநிலத்தைக் குத்தகைக்கு விட்டு வந்தோம்\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மேற்கண்ட ஹதீஸ் ராஃபிஉ பின் கதீஜ் (ரலி) அவர்களிடமிருந்து மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ராஃபிஉ பின் கதீஜ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், நபி (ஸல்) அவர்கள் கூறினார்கள் என ராஃபிஉ (ரலி) அவர்கள் தெரிவித்ததாகவே இடம்பெற்றுள்ளது. ராஃபிஉ (ரலி) அவர்கள் தம் தந்தையின் சகோதரர்கள் சிலரிடமிருந்து அறிவித்ததாக இடம்பெறவில்லை. அத்தியாயம் : 21",
			"grades": [],
			"reference": {
				"book": 21,
				"hadith": 144
			}
		}
	]
}