{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஓர் அறப்போருக்குச் சென்றேன். நன்றாக இயங்காதிருந்த, நடக்க முடியாமல் நடந்துகொண்டிருந்த, தண்ணீர் சுமக்கும் எனது ஒட்டகம் ஒன்றின் மீது அமர்ந்து நான் சென்றுகொண்டிருந்தபோது (வழியில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னை வந்தடைந்தார்கள். என்னிடம், \"உனது ஒட்டகத்திற்கு என்ன நேர்ந்தது?\" என்று கேட்டார்கள். நான் \"நோய் கண்டுள்ளது\" என்றேன். அதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சற்று பின்வாங்கி அதை அதட்டினார்கள்; அதற்காகப் பிரார்த்தனையும் செய்தார்கள். உடனே அது (வேகமாக ஓடி) எல்லா ஒட்டகங்களுக்கும் முன்னே சென்றுகொண்டிருந்தது. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம், \"உனது ஒட்டகத்தை (இப்போது) எப்படிக் காண்கிறாய்?\" என்று கேட்டார்கள். நான் \"நல்ல நிலையில் காண்கிறேன். தங்களது (பிரார்த்தனையின்) வளம் அதற்குக் கிடைத்து விட்டது\" என்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீ அதை எனக்கு விற்றுவிடுகிறாயா?\" என்று கேட்டார்கள். நான் (நபியவர்களுக்கு விலைக்கு விற்க) வெட்கப்பட்டேன். (அத் துடன்) எங்களிடம் அதைத் தவிர தண்ணீர் சுமக்கும் ஒட்டகம் வேறெதுவும் இருக்க வில்லை. பின்னர் நான், \"சரி (விற்றுவிடுகிறேன்) என்றேன். ஆயினும், மதீனா சென்றடையும்வரை அதன் மீது பயணம் செய்துகொள்ள என்னை அனுமதிக்க வேண்டும் எனும் நிபந்தனையின் பேரில் அவர்களுக்கு அந்த ஒட்டகத்தை விற்றுவிட்டேன். பின்னர், \"அல்லாஹ்வின் தூதரே! நான் புது மாப்பிள்ளை\" என்று சொல்லி (ஊருக்கு விரைவாகச் செல்ல) அனுமதி கேட்டேன். அவர்கள் எனக்கு அனுமதியளித்தார்கள். ஆகவே, நான் மக்களைவிட முன்னதாகச் சென்று மதீனாவை அடைந்துவிட்டேன். அப்போது என் தாய் மாமன் (ஜத்து பின் கைஸ் அவர்கள் என்னைச்) சந்தித்து ஒட்டகத்தைப் பற்றிக் கேட்டார். நான் அதை என்ன செய்தேன் என்பதை அவரிடம் தெரிவித்தேன். அதற்காக அவர் என்னைக் கடிந்துகொண்டார். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் (நான் புது மாப்பிள்ளை என்று சொல்லி) மதீனாவுக்கு விரைவாக செல்ல அனுமதி கேட்டபோது அவர்கள் என்னிடம், \"நீ யாரை மணந்து கொண்டாய்? கன்னிப் பெண்ணையா, கன்னி கழிந்த பெண்ணையா?\" என்று கேட்டார்கள். நான், \"கன்னி கழிந்த பெண்ணைத்தான் மணந்துகொண்டேன்\" என்றேன். \"கன்னிப் பெண்ணை மணந்து கொண்டு, அவளோடு நீயும் உன்னோடு அவளுமாகக் கூடிக்குலவி மகிழ்ந்திருக்கலாமே?\"என்று கூறினார்கள். நான், \"அல்லாஹ்வின் தூதரே! எனக்குச் சிறு வயது சகோதரிகள் பலர் இருக்கும் நிலையில் என் தந்தை (உஹுதுப் போரில்) \"இறந்துவிட்டார்கள்\" அல்லது \"கொல்லப்பட்டு விட்டார்கள்\". ஆகவே, அவர்களுக்கு ஒழுக்கம் கற்பிக்கவோ,அவர்களைப் பராமரிக்கவோ முன்வராத, அவர்களைப் போன்றே (அனுபவமற்ற இளவயதுப் பெண்) ஒருத்தியை மணந்து, அவர்களிடம் அழைத்துச் செல்ல நான் விரும்பவில்லை. ஆகவே, அவர்களைப் பராமரிப்பதற்காகவும் அவர்களுக்கு ஒழுக்கம் கற்பிப்பதற்காகவும் (வாழ்ந்து பக்குவப்பட்ட) கன்னி கழிந்த ஒரு பெண்ணையே நான் மணந்துகொண்டேன்\" என்று விடையளித்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவுக்கு வந்து சேர்ந்தபோது, காலையில் ஒட்டகத்துடன் அவர்களிடம் சென்றேன். எனக்கு அதன் விலையைக் கொடுத்தார்கள். பிறகு அந்த ஒட்டகத்தையும் என்னிடமே திருப்பிக் கொடுத்துவிட்டார்கள் (அன்பளிப்பாக). இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 22",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		}
	]
}