{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"27": "The Book of Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4264,
			"arabicnumber": "1649.02",
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: என் நண்பர்கள் என்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று, தமக்காக (பயண) வாகனம் கேட்கும்படி அனுப்பிவைத்தார்கள். அப்போது அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் சிரமப்போர் படையுடன் செல்லவிருந்தனர். (தபூக் போர்தான் அது) அப்போது நான், \"அல்லாஹ்வின் தூதரே! என் நண்பர்கள் தமக்காக வாகனம் கேட்கும் படி என்னைத் தங்களிடம் அனுப்பிவைத்துள்ளனர்\" என்று சொன்னேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ்வின் மீதாணையாக! உங்களுக்கு எந்த வாகனத்தையும் என்னால் தர இயலாது\" என்று சொன்னார்கள். நான் அங்கு போன நேரத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கோபத்திலிருந்தார்கள். (அது) எனக்குத் தெரியவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (வாகனம் தர) மறுத்ததாலும் என்மீது அவர்கள் வருத்தம் கொண்டிருப்பார்களோ என்ற அச்சத்தாலும் நான் கவலை கொண்டவனாகத் திரும்பினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதை என் நண்பர்களிடம் வந்து தெரிவித்தேன். இது நடந்து சிறிது நேரம் தான் கழிந்திருக்கும். அதற்குள், \"அப்துல்லாஹ் பின் கைஸே!\" என்று பிலால் (ரலி) அவர்கள் (என்னை) அழைப்பதைக் கேட்டேன். உடனே நான் அவரது அழைப்புக்குப் பதிலளித்தேன். அப்போது பிலால் (ரலி) அவர்கள், \"உங்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அழைக்கிறார்கள். அவர்களது அழைப்பை ஏற்றுச் செல்லுங்கள்\" என்று சொன்னார்கள். நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றபோது அவர்கள், \"(இணைத்துக் கட்டப்பட்டிருக்கும்) இவ்விரு ஒட்டகங்களையும் இவ்விரு ஒட்டகங்களையும் இவ்விரு ஒட்டகங்களையும்\" என்று ஆறு ஒட்டகங்களைக் காட்டி \"பிடித்துக்கொள்ளுங்கள்\" என்று சொன்னார்கள். அவற்றை அப்போதுதான் சஅத் பின் உபாதா (ரலி) அவர்களிடமிருந்து விலைக்கு வாங்கியிருந்தார்கள். \"உங்கள் நண்பர்களிடம் இவற்றைக் கொண்டுசென்று, \"அல்லாஹ்\" அல்லது \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள்\" (அறிவிப்பாளரின் ஐயம்) இந்த ஒட்டகங்களை உங்கள் பயணத்திற்காக அளித்துள்ளார்கள். எனவே, இவற்றில் ஏறிப் புறப்படச் சொன்னார்கள்\" எனத் தெரிவியுங்கள்\" என்றார்கள். அவ்வாறே நான் என் தோழர்களிடம் அவற்றைக் கொண்டுசென்று, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இவற்றில் ஏறிப் பயணம் செல்லும்படி கூறினார்கள். எனினும், அல்லாஹ்வின் மீதாணையாக! உங்களில் சிலர் என்னுடன் வந்து,அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் நான் (வாகனம்) கேட்டதையும், முதலில் அவர்கள் அதற்கு மறுப்புத் தெரிவித்ததையும், பின்னர் அவற்றை வழங்கியதையும் அறிந்த மக்களிடம் விசாரிக்கும் வரையில் நான் உங்களை விடமாட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சொல்லாத ஒன்றை நான் உங்களிடம் சொல்லி விட்டதாக நீங்கள் நினைத்துவிடக் கூடாது\" என்று சொன்னேன். அதற்கு என் தோழர்கள், \"அல்லாஹ்வின் மீதாணையாக! \"(அதற்கெல்லாம் அவசியமில்லை) உங்களை நாங்கள் உண்மையாளர் என்றே உறுதியாக நம்புகிறோம். (இருப்பினும், நீங்கள் விரும்புகிறீர்கள் என்பதால்) உங்கள் விருப்பப்படி நாங்கள் செய்கிறோம்\" என்று கூறினர். நான் அவர்களில் சிலரை அழைத்துக் கொண்டு \"நான் அவர்களுக்குத் தரமாட்டேன்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (முதலில்) மறுத்ததையும், பிறகு அவர்களே வழங்கியதையும் அறிந்த சிலரிடம் சென்றேன். அப்போது அந்தச் சிலர், நான் மக்களிடம் தெரிவித்ததைப் போன்றே தெரிவித்தார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 27",
			"grades": [],
			"reference": {
				"book": 27,
				"hadith": 11
			}
		}
	]
}