{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"28": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4387,
			"arabicnumber": "1680.01",
			"text": "வாயில் பின் ஹுஜ்ர் (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) நான் நபி (ஸல்) அவர்களுடன் அமர்ந்திருந்தேன். அப்போது ஒரு மனிதர் மற்றொரு மனிதரைத் தோல்வாரினால் (கழுத்தில் போட்டு) இழுத்துக்கொண்டு வந்தார். \"அல்லாஹ்வின் தூதரே! இவர் என் சகோதரனைக் கொலை செய்துவிட்டார்\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அந்த மனிதரிடம்), \"நீ அவரைக் கொலை செய்தாயா?\" என்று கேட்டார்கள். (அப்போது அவரை இழுத்துக்கொண்டு வந்தவர், இவர் கொலையை ஒப்புக்கொள்ளாவிட்டால் இவருக்கெதிரான ஆதாரத்தை நான் நிலை நிறுத்துவேன்\" என்றும் கூறினார்). அதற்கு அந்த மனிதர், \"ஆம், நான் அவரைக் கொலை செய்தேன்\" என்று (ஒப்புதல் வாக்குமூலம்) சென்னார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"எப்படி (இக்கொலையை) நீ செய்தாய்?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர், \"நானும் அவரும் ஒரு மரத்தில் (தடியால் அடித்து) இலை உதிர்த்துக்கொண்டிருந்தோம். அப்போது அவர் என்னை ஏசினார். எனக்குக் கோபம் ஏற்பட்டது. உடனே நான் (என் கையிலிருந்த) கோடரியால் அவரது உச்சந்தலையில் அடித்துவிட்டேன். அவர் இறந்துவிட்டார். (திட்டமிட்டு இந்தக் கொலையை நான் செய்யவில்லை)\" என்று சொன்னார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவருக்கு இழப்பீடு வழங்க உம்மிடம் ஏதேனும் (பொருள்) உண்டா?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர் \"என்னிடம் எனது போர்வையையும் எனது கோடரியையும் தவிர வேறொன்றுமில்லை\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உன்னுடைய கூட்டத்தார் உனக்காக (இழப்பீடு) திரட்டித் தருவார்கள் என்று நீ கருதுகிறாயா?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர், \"நான் என் கூட்டத்தாரிடம் அந்த அளவுக்கு மதிப்புடையவன் அல்லன்\" என்று சொன்னார். எனவே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவரது (கழுத்தில் கிடந்த) தோல் வாரை, அ(வரை இழுத்துவ)ந்த மனிதரிடம் தூக்கிப் போட்டு, \"உம்முடைய ஆளைப் பிடித்துக்கொள்க\" என்று சொன்னார்கள். உடனே அந்த மனிதர் அவரை (இழுத்து)க்கொண்டு சென்றார். அவர் திரும்பிச் சென்றதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவரை அவர் கொன்றுவிட்டால், அவரும் இவரைப் போன்றவரே ஆவார்\" என்று கூறினார்கள். அந்த மனிதர் திரும்பிவந்து, \"அல்லாஹ்வின் தூதரே! நீங்கள் \"இவரை அவர் கொன்று விட்டால் அவரும் இவரைப் போன்றவரே ஆவார்\" என்று கூறியதாக எனக்குச் செய்தி எட்டியதே! உங்களது கட்டளைப்படிதானே நான் இவரை பிடித்துச்சென்றேன்\" என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவர் உமது பாவத்துடனும் (கொல்லப்பட்ட) உன் உறவினரின் பாவத்துடனும் திரும்புவதை நீர் விரும்புகிறீரா?\" என்று கேட்டார்கள். அதற்கு அந்த மனிதர், \"அல்லாஹ்வின் தூதரே! ஆம். அது அவ்வாறே ஆகட்டும்\" என்று கூறிவிட்டு, அவரது (கழுத்தில் கிடந்த) தோல் வாரைத் தூக்கியெறிந்து, அவரை அவரது வழியிலேயே செல்ல விட்டுவிட்டார். அத்தியாயம் : 28",
			"grades": [],
			"reference": {
				"book": 28,
				"hadith": 46
			}
		}
	]
}