{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"29": "The Book of Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4457,
			"arabicnumber": "1707.01",
			"text": "அபூசாசான் ஹுளைன் பின் அல்முன்திர் (ரஹ்) அவர்கள் கூறியதாவது: நான் (கலீஃபா) உஸ்மான் பின் அஃப்பான் (ரலி) அவர்களிடம் இருந்தேன். அப்போது வலீத் பின் உக்பா (ரலி) அவர்கள் (அங்கு) கொண்டுவரப்பட்டார். அவர் சுப்ஹுத் தொழுகை இரண்டு ரக்அத் தொழுவித்துவிட்டு, \"உங்களுக்கு நான் இத்தொழுகையைக் கூடுதலாக்கப் போகிறேன்\" என்று கூறியிருந்தார். அப்போது அவருக்கெதிராக இருவர் சாட்சியமளித்தனர். அவர்களில் ஒருவரான ஹும்ரான் பின் அபான், \"அவர் (வலீத்) மது அருந்தியிருந்தார்\" என்று சாட்சியம் அளித்தார். மற்றொருவர் வலீத் வாந்தியெடுத்ததைத் தாம் கண்டதாகச் சாட்சியமளித்தார். உஸ்மான் (ரலி) அவர்கள், \"அவர் மது அருந்தியதாலேயே வாந்தியெடுத்தார்\" என்று கூறிவிட்டு, \"அலீயே! நீங்கள் எழுந்து அவருக்கு (மது அருந்திய குற்றத்திற்காக)ச் சாட்டையடி வழங்குங்கள்\" என்று கூறினார்கள். உடனே அலீ (ரலி) அவர்கள் (தம் புதல்வரிடம்) \"ஹசனே! நீர் எழுந்து அவருக்குச் சாட்டையடி வழங்கு\" என்று கூறினார்கள். அதற்கு ஹசன் (ரலி) அவர்கள், (உஸ்மான் (ரலி) அவர்கள்மீது கோபம் கொண்டவரைப் போன்று) \"ஆட்சியின் குளிர்ச்சிக்குப் பொறுப்பேற்றவர்களையே அதன் வெப்பத்துக்கும் பொறுப்பேற்கச் செய்யுங்கள்\" என்று கூறிவிட்டார்கள். உடனே அலீ (ரலி) அவர்கள் (தம் சகோதரரின் புதல்வரிடம்) \"அப்துல்லாஹ் பின் ஜஅஃபரே! நீர் எழுந்து அவருக்குச் சாட்டையடி வழங்குவீராக\" என்று சொன்னார்கள். அவ்வாறே அப்துல்லாஹ் பின் ஜஅஃபர் அவர்கள், வலீதுக்குச் சாட்டையடி வழங்கினார்கள். அப்போது அலீ (ரலி) அவர்கள் (அப்துல்லாஹ் எத்தனை முறை அடிக்கிறார் என்பதை) எண்ணிக்கொண்டிருந்தார்கள். நாற்பது அடியானதும் \"போதும் நிறுத்து\" என்றார்கள். பிறகு, \"(மது அருந்திய குற்றத்திற்குத் தண்டனையாக) நபி (ஸல்) அவர்கள் நாற்பது சாட்டையடிகள் வழங்கினார்கள். அபூபக்ர் (ரலி) அவர்களும் (தமது ஆட்சிக் காலத்தில்) நாற்பது சாட்டையடிகள் வழங்கினார்கள். உமர் (ரலி) அவர்கள் (தமது ஆட்சிக் காலத்தில்) எண்பது சாட்டையடிகள் வழங்கினார்கள். எல்லாம் (பின்பற்றத் தகுந்த) வழிமுறைகளே. ஆயினும், இ(றைத்தூதர் (ஸல்) அவர்களும் அபூபக்ர் (ரலி) அவர்களும் வழங்கிய நாற்பது சாட்டையடிகளான)து எனக்கு மிகவும் விருப்பமானதாகும்\" என்று அலீ (ரலி) அவர்கள் கூறினார்கள். மேற்கண்ட ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அலீ பின் ஹுஜ்ர் (ரஹ்) அவர்களது அறிவிப்பில், \"நான் இந்த ஹதீஸை அப்துல்லாஹ் அத்தானாஜ் (ரஹ்) அவர்களிடமிருந்தே (நேரடியாகக்) கேட்டிருந்தேன். ஆனால், அதை மனனம் செய்ய வில்லை. (பின்னர் இப்னு அபீஅரூபா (ரஹ்) அவர்களிடம் கேட்டே இப்போது அறிவிக்கிறேன்) என இஸ்மாயீல் பின் உலய்யா (ரஹ்) அவர்கள் கூடுதலாகக் கூறினார்கள்\" என்று இடம்பெற்றுள்ளது. அத்தியாயம் : 29",
			"grades": [],
			"reference": {
				"book": 29,
				"hadith": 60
			}
		}
	]
}