{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4555,
			"arabicnumber": "1747",
			"text": "ஹம்மாம் பின் முனப்பிஹ் (ரஹ்) அவர்கள் கூறியதாவது: இவை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து அபூஹுரைரா (ரலி) அவர்கள் நமக்கு அறிவித்த ஹதீஸ்களாகும். அவற்றில் பின்வரும் ஹதீஸும் ஒன்றாகும். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: இறைத்தூதர்களில் ஒருவர் (யூஷஉ பின் நூன் (அலை) அவர்கள்) ஓர் அறப்போருக்குச் சென்றார். அப்போது அவர் தம் சமுதாயத்தாரிடம் \"ஒரு பெண்ணிடம் இல்லற உரிமையைப் பெற்ற ஒருவர், அவளுடன் தாம்பத்திய உறவைத் தொடங்க விரும்பி, இன்னும் தாம்பத்திய உறவைத் தொடங்காமலிருப்பின் என்னைப் பின்பற்றி (போருக்கு) வர வேண்டாம். (அவ்வாறே,) வீடு கட்டி முடித்து, அதன் மேற்கூரையை (இன்னும்) உயர்த்தாமலிருப்பவரும் என்னைப் பின்பற்றி (போருக்கு) வர வேண்டாம். ஆட்டையோ, சினை ஒட்டகங்களையோ வாங்கிவிட்டு, அவை குட்டிகள் ஈனுவதை எதிர்பார்த்துக் கொண்டிருப்பவரும் என்னைப் பின்பற்றி (போருக்கு) வர வேண்டாம்\" என்று கூறிவிட்டுப் போருக்குப் புறப்பட்டார். ஓர் ஊரை (ஜெரிக்கோ நகரை வெள்ளிக்கிழமை) அஸ்ர் தொழுகையின் நேரத்தில் அல்லது சற்றேறக்குறைய அந்த வேளையில் அவர் நெருங்கினார். (சற்று நேரத்தில் சூரியன் மறையத் தொடங்க, சனிக்கிழமை போரிடுவது அவர்களுக்குத் தடை செய்யப்பட்டிருந்த காரணத்தால் தோற்றுப்போக நேரிடுமே என்றஞ்சி) சூரியனை நோக்கி, \"நீ,இறைவனின் கட்டளைப்படி இயங்குகின்றாய். நானும் இறைக்கட்டளைப்படி நடக்க வேண்டியவன் ஆவேன்\" என்று கூறிவிட்டு, \"இறைவா! சூரியனை (உடனே மறையவிடாமல்) தடுத்துவிடு\" என்று பிரார்த்தித்தார். எனவே, அவருக்கு அல்லாஹ் வெற்றியை வழங்கும்வரை சூரியன் (மறையாமல்) தடுத்து நிறுத்தப்பட்டது. (வெற்றிபெற்ற) பின்னர் அம்மக்கள் போரில் கிடைத்த செல்வங்களை ஒன்று சேர்த்தனர். அப்போது அவற்றை (எரித்துச் சாம்பலாக்கி)ப் புசிப்பதற்கு வானிலிருந்து நெருப்பு வந்தது. (ஆனால்) அவற்றைப் புசிக்க அது மறுத்துவிட்டது. அந்த இறைத்தூதர் \"உங்களில் கையாடல் நடந்துள்ளது. ஆகவே, ஒவ்வொரு குலத்திலிருந்தும் ஒரு மனிதர் என்னிடம் சத்தியப் பிரமாணம் அளிக்கட்டும்\" என்று கூறினார். அவ்வாறே அவர்களும் அவரிடம் சத்தியப் பிரமாணம் அளித்தனர். அப்போது, ஒரு மனிதரின் கை, இறைத்தூதரின் கையோடு ஒட்டிக்கொண்டது. அப்போது இறைத்தூதர், \"உங்களிடையே தான் கையாடல் செய்யப்பட்ட பொருள் உள்ளது. ஆகவே, உன்னுடைய குலத்தார் என்னிடம் சத்தியப் பிரமாணம் அளிக்கட்டும்\" என்று கூறினார். அவ்வாறே, அவர்கள் சத்தியப் பிரமாணம் அளிக்க, இரண்டு மனிதர்களின் கை அல்லது மூவருடைய கை இறைத்தூதருடைய கையுடன் ஒட்டிக்கொண்டது. அப்போது அவர், \"உங்களிடையேதான் கையாடல் செய்யப்பட்ட அந்தப் பொருள் உள்ளது. நீங்கள்தாம் அதைக் கையாடல் செய்துள்ளீர்கள்\" என்று கூறினார். ஆகவே, அக்குலத்தார் பசுமாட்டின் தலை அளவுக்குத் தங்கத்தைக் கொண்டு வந்து, மண் தரையில் இருந்த பொருட்களுடன் வைத்தனர். உடனே (வானிலிருந்து) நெருப்பு வந்து அதைப் புசித்தது. (முற்காலங்களில் போர்ச் செல்வங்கள் இப்படித்தான் செய்யப்பட்டன.) நமக்கு முன்னால் யாருக்கும் போர்ச்செல்வங்கள் (எடுத்துப் பயன்படுத்திக்கொள்ள) அனுமதிக்கப்படவில்லை. (பின்னர் நமக்கு அப்பொருட்களைப் பயன்படுத்த அல்லாஹ் அனுமதியளித்தான்). வளமும் உயர்வும் உள்ள அல்லாஹ் நமது பலவீனத்தையும் இயலாமையையும் கண்டு, அவற்றை நமக்கு அனுமதிக்கப்பட்டவையாக ஆக்கினான். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 32",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 36
			}
		}
	]
}