{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4568,
			"arabicnumber": "1751.03",
			"text": "அபூகத்தாதா (ரலி) அவர்கள் கூறியதாவது: ஹுனைன் போர் நடந்த ஆண்டில் (அப்போருக்காக) நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் புறப்பட்டோம். (எதிரிகளைப் போர்க்களத்தில்) நாங்கள் சந்தித்தபோது, (ஆரம்பத்தில்) முஸ்லிம்களுக்குத் தோல்வி பயம் ஏற்பட்டது. அப்போது இணைவைப்பாளர்களில் ஒருவன் ஒரு முஸ்லிமின் மீது ஏறி உட்கார்ந்து கொண்டு, அவரைக் கொல்ல முயல்வதை நான் கண்டேன். நான் அவனிடம் சுற்றிவந்து, அவனுக்குப் பின்பக்கம் சென்று, அவனது பிடரி நரம்பில் வெட்டிவிட்டேன். உடனே அவன் (அந்த முஸ்லிமை விட்டுவிட்டு) என்னைத் தாவியணைத்து ஓர் இறுக்கு இறுக்கினான். பிராண வாயு பிரியும் நிலைக்கு நான் உள்ளானேன். பின்னர் மரணம் அவனைப் பிடித்துக்கொள்ளவே அவன் என்னை விட்டுவிட்டான். பின்னர் நான் உமர் பின் அல்கத்தாப் (ரலி) அவர்களைச் சென்றடைந்தேன். அப்போது அவர்கள் \"மக்களுக்கு என்ன நேர்ந்தது? (ஏன் சிதறி ஓடுகிறார்கள்?)\" என்று கேட்டார்கள். அதற்கு நான், \"(எல்லாம்) அல்லாஹ்வின் ஏற்பாடு\" என்று பதிலளித்தேன். பிறகு (பின்வாங்கி ஓடிய) மக்கள் (போர்க்களத்திற்கு) திரும்பி வந்தார்கள். (தீரத்துடன் போராடி வென்றார்கள்.) பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அமர்ந்துகொண்டு, \"போரில் எதிரி ஒருவனைக் கொன்றதற்கான ஆதாரம் எவரிடம் இருக்கிறதோ அவருக்கே அந்த எதிரியின் (உடலில் கிடந்த ஆடை, ஆயுதம் போன்ற) உடைமைகள் உரியவை\" என்று கூறினார்கள். அப்போது நான் எழுந்து நின்று, \"(நான் எதிரி ஒருவனை வீழ்த்தியதற்கு) எனக்குச் சாட்சியம் கூறுபவர் யார்?\" என்று கேட்டு விட்டு உட்கார்ந்துகொண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மீண்டும் (\"போரில் எதிரி ஒருவனைக் கொன்றதற்கான ஆதாரம் எவரிடம் இருக்கிறதோ அவருக்கே அந்த எதிரியின் உடைமைகள் உரியவை\" என்று) கூறினார்கள். உடனே நான் (மறுபடியும்) எழுந்து \"(நான் எதிரி ஒருவனை வீழ்த்தியதற்கு) எனக்குச் சாட்சியம் கூறுபவர் யார்?\" என்று கேட்டேன்; பிறகு உட்கார்ந்துகொண்டேன். பிறகு, மூன்றாவது தடவையும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் முன்பு கூறியதைப் போன்றே கூறினார்கள். உடனே நான் எழுந்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னைப் பார்த்து), \"உங்களுக்கு என்ன வேண்டும், அபூகத்தாதா?\" என்று கேட்டார்கள். நடந்ததை அவர்களிடம் நான் எடுத்துரைத்தேன். அப்போது மக்களில் ஒருவர், \"இவர் சொல்வது உண்மைதான், அல்லாஹ்வின் தூதரே! (இவரால்) கொல்லப்பட்டவரின் உடலிலிருந்து எடுக்கப்பட்ட பொருட்கள் என்னிடம் உள்ளன. அவர் தமது உரிமையை (எனக்கு) விட்டுக்கொடுக்கச் சொல்லுங்கள்\" என்று கூறினார். அப்போது அபூபக்ர் அஸ்ஸித்தீக் (ரலி) அவர்கள், \"இல்லை, அல்லாஹ்வின் மீதாணையாக! அல்லாஹ்வின் சிங்கங்களில் ஒரு சிங்கம் அல்லாஹ்வுக்காகவும் அவனுடைய தூதருக்காகவும் போரிட்டு (எதிரி ஒருவனை வீழ்த்திவிட்டு) வர, அவரால் கொல்லப்பட்ட எதிரியின் உடலிலிருந்து எடுத்த பொருளை உனக்குக் கொடுக்கும் முடிவுக்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செல்லமாட்டார்கள்\" என்று கூறினார்கள். இதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உண்மைதான். (எதிரியை வீழ்த்திய) இவரிடமே அந்தப் பொருட்களைக் கொடுத்துவிடு\" என்று சொன்னார்கள். அவ்வாறே அவர் அதை என்னிடம் கொடுத்தார். (அந்த வகையில் எனக்குக் கவச உடையொன்று கிடைத்தது.) அந்தக் கவச உடையை விற்றுவிட்டு பனூ சலமா குலத்தார் வாழும் பகுதியில் ஒரு பேரீச்சந்தோட்டத்தை வாங்கினேன். அதுதான் இஸ்லாத்தைத் தழுவிய பின் நான் சேகரித்த முதல் சொத்தாகும். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் லைஸ் (ரஹ்) அவர்களது அறிவிப்பில், \"அபூபக்ர் (ரலி) அவர்கள் \"இல்லை, அல்லாஹ்வின் சிங்கங்களில் ஒரு சிங்கத்தை விட்டுவிட்டு, குறைஷியரில் உள்ள குழிமுயல் குட்டிக்கு அதைக் கொடுக்க மாட்டார்கள்\" என்று கூறினார்கள்\" என இடம் பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் அபூகத்தாதா (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூகத்தாதா (ரலி) அவர்களிடமிருந்தே வேறோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 32",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 49
			}
		}
	]
}