{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4669,
			"arabicnumber": "1802.02",
			"text": "சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: கைபர் போர் தினத்தன்று என் (தந்தையின்) சகோதரர் (ஆமிர்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் சேர்ந்து (யூதர்களுடன்) கடுமையாகப் போரிட்டார். அப்போது அவருடைய வாள் முனை அவரையே திருப்பித் தாக்கிவிட்டது. அதனால் அவர் இறந்துவிட்டார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய தோழர்கள் (சிலர்) இது தொடர்பாக (பல விதமாக)ப் பேசிக் கொண்டனர். அவர் (மரணம்) தொடர்பாக சந்தேகம் வெளியிட்டனர். \"அவர் தமது ஆயுதத்தாலேயே இறந்துவிட்ட மனிதர்\" என்றும், அவருடைய நடவடிக்கைகளில் இன்னும் சிலவற்றைக் குறித்தும் சந்தேகமாகப் பேசினர். கைபரிலிருந்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் திரும்பிச் சென்றபோது (அவர்களிடம்) நான், \"அல்லாஹ்வின் தூதரே! தங்களுக்காகச் சில யாப்பு வகைக் கவிதையைப் பாட எனக்கு அனுமதி அளியுங்கள்\" என்று கேட்டேன். எனக்கு அவர்கள் அனுமதியளித்தார்கள். அப்போது உமர் பின் அல்கத்தாப் (ரலி) அவர்கள், \"நீ சொல்லவிருப்பதை நான் அறிவேன்\" என்று கூறினார்கள். அப்போது நான் பின்வரும் யாப்பு வகைக் கவிதைகளைப் பாடினேன்: \"அல்லாஹ்வின் மீதாணை! அல்லாஹ் இல்லாவிட்டால் நாங்கள் நேர்வழி பெற்றிருக்கமாட்டோம் தர்மமும் செய்திருக்கமாட்டோம். தொழுதிருக்கவும் மாட்டோம்\" என்று பாடினேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"நீ உண்மையுரைத்தாய்\" என்று கூறினார்கள். பிறகு நான், \"எங்கள் மீது அமைதியைப் பொழிவாயாக. (போர் முனையில் எதிரிகளை) நாங்கள் சந்திக்கும்போது எங்கள் பாதங்களை உறுதிப்படுத்துவாயாக. இணைவைப்பாளர்கள் எங்கள்மீது வரம்புமீறிவிட்டார்கள்\" என்று பாடினேன். நான் பாடி முடித்ததும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதை யாத்தவர் யார்?\" என்று கேட்டார்கள். நான் \"என் (தந்தையின்) சகோதரர் (ஆமிர்)\" என்றேன். \"அவருக்கு அல்லாஹ் அருள்புரிவானாக\" என்று நபியவர்கள் பிரார்த்தித்தார்கள். அப்போது நான், \"அல்லாஹ்வின் தூதரே! சிலர், என் சகோதரருக்கு (இறுதித் தொழுகை) தொழுவதற்கு அஞ்சுகின்றனர். அவர் தமது ஆயுதத்தாலேயே தற்கொலை செய்துகொண்ட ஒரு மனிதர் என்று கூறுகின்றனர்\" என்றேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அவர் துன்பங்களைத் தாங்கி, (இறை வழியில்) அறப்போரும் புரிந்து இறந்தார்\" என்று கூறினார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான இப்னு ஷிஹாப் அஸ்ஸுஹ்ரீ (ரஹ்) அவர்கள் கூறுகிறார்கள்: பிறகு நான் சலமா பின் அல்அக்வஉ (ரலி) அவர்களின் புதல்வர் ஒருவரிடம் (இந்த ஹதீஸைப் பற்றிக்) கேட்டேன். அவரும் தம் தந்தையாரிடமிருந்து இதைப் போன்றே எனக்கு அறிவித்தார். ஆயினும், \"மக்களில் சிலர் ஆமிருக்காக (இறுதித் தொழுகை) தொழுவதற்கு அஞ்சுகின்றனர்\" என்று நான் கூறியபோது \"அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"அவர்கள் பொய்யுரைத்துவிட்டனர். அவர் துன்பங்களைத் தாங்கி (இறைவழியில்) அறப்போரும் புரிந்து இறந்தார். அவருக்கு (நற்செயல் புரிந்த நன்மை, அறப்போர் புரிந்த நன்மை ஆகிய) இரண்டு நன்மைகள் உண்டு\" என்று கூறியபடி, தம் இரு விரல்களை இணைத்துக் காட்டினார்கள்\" என்று அவர் கூறினார். அத்தியாயம் : 32",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 151
			}
		}
	]
}