{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"32": "The Book of Jihad and Expeditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4679,
			"arabicnumber": "1808",
			"text": "சலமா பின் அல்அக்வஉ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் ஹுதைபியாவை நோக்கிச் சென்றோம். அப்போது நாங்கள் ஆயிரத்து நானூறு பேர் இருந்தோம். அங்கு (தண்ணீர் குறைவாக இருந்ததால் எங்களுடைய) ஐம்பது (குர்பானி) ஆடுகள் நீர் புகட்டப் படாமல் (தாகத்துடன்) இருந்தன. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அங்கிருந்த கிணற்றின் சுற்றுச் சுவர்மீது அமர்ந்துகொண்டு பிரார்த்தித்தார்கள். அல்லது அதனுள் உமிழ்ந்தார்கள். உடனே கிணற்றில் நீர் மட்டம் உயர்ந்தது. உடனே நாங்கள் நீர் அருந்தினோம். எங்கள் கால் நடைகளுக்கும் நீர் புகட்டினோம். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அங்கிருந்த மரத்துக்குக் கீழே உறுதிமொழிப் பிரமாணம் (பைஅத்) வாங்குவதற்காக எங்களை அழைத்தார்கள். மக்கள் அனைவருக்கும் முன்பாக (முதலில்) நானே அவர்களிடம் உறுதிமொழி அளித்தேன். பிறகு ஒவ்வொருவராக (வந்து) உறுதிமொழி அளித்தனர். மக்களில் பாதிப்பேரிடம் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (உறுதிமொழி வாங்கி) இருந்தபோது \"சலமா! உறுதிமொழி அளிப்பாயாக!\" என்று (என்னிடம்) கூறினார்கள். நான், \"அல்லாஹ்வின் தூதரே! நான் மக்கள் அனைவருக்கும் முன்பாக தங்களிடம் உறுதிமொழி அளித்துவிட்டேன்\" என்று சொன்னேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"மீண்டும் (ஒரு முறை உறுதிமொழி அளிப்பாயாக)\" என்று கூறினார்கள். அப்போது என்னிடம் ஆயுதம் எதுவும் இல்லாமலிருப்பதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கண்டார்கள். எனக்கு \"சிறிய தோல் கேடயம் ஒன்றை” அல்லது \"தோல் கேடயம் ஒன்றை” அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வழங்கினார்கள். பிறகு என்னிடம் உறுதிமொழி பெற்றார்கள். மக்களில் இறுதி நபரிடம் அவர்கள் (உறுதிமொழி பெற்றுக்கொண்டு) இருந்தபோது, \"சலமா! என்னிடம் நீ உறுதிமொழி அளிக்கக் கூடாதா?\" என்று கேட்டார்கள். நான், \"அல்லாஹ்வின் தூதரே! நான் மக்கள் அனைவருக்கும் முன்பாகவும் மக்களில் பாதிப்பேராகவும் தங்களிடம் உறுதிமொழி அளித்துவிட்டேன்\" என்று சொன்னேன். \"மீண்டும் (ஒரு தடவை உறுதிமொழி அளிப்பாயாக)\" என்று சொன்னார்கள். நான் மூன்றாவது தடவையாக உறுதிமொழி அளித்தேன். பிறகு என்னிடம், \"சலமா! உனக்கு நான் வழங்கிய உனது \"சிறிய தோல் கேடயம்” அல்லது \"தோல் கேடயம்\" எங்கே?\" என்று கேட்டார்கள். நான், \"அல்லாஹ்வின் தூதரே! என் தந்தையின் சகோதரர் ஆமிர் (ரலி) அவர்கள் என்னைச் சந்தித்தார். அவரிடம் ஆயுதம் எதுவும் இல்லாமலிருப்பதை நான் கண்டேன். எனவே, அதை அவருக்குக் கொடுத்துவிட்டேன்\" என்று சொன்னேன். அதைக் கேட்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிரித்தார்கள். மேலும், \"நீர் முற்காலத்தில் வாழ்ந்த ஒரு மனிதரைப் போன்றவர் ஆவீர். அவர் \"இறைவா! எனக்காக ஒரு நண்பரைக் கிடைக்கச் செய்வாயாக! அவர் என் உயிரைவிட எனக்கு மிகவும் பிரியமானவராக இருக்க வேண்டும்\" என்று பிரார்த்தித்தார். (அவரைப் போன்றே நீரும் உம்மைவிட உம் தந்தையின் சகோதரருக்கு முன்னுரிமை அளித்துள்ளீர்)\" என்று கூறினார்கள். பிறகு (மக்கா) இணைவைப்பாளர்கள் சமாதான ஒப்பந்தம் செய்துகொள்வதாக எங்களுக்குத் தூது விட்டார்கள். இதனால், (நாங்களும் அவர்களும்) ஒருவர் பகுதிக்கு மற்றவர் சென்றுவர முடியும். நாங்கள் சமாதான ஒப்பந்தம் செய்துகொண்டோம். நான் தல்ஹா பின் உபைதில்லாஹ் (ரலி) அவர்களுக்கு உதவியாளராக இருந்தேன். அவரது குதிரைக்குத் தண்ணீர் புகட்டுவேன். அதைத் துடைத்துத் துப்புரவு செய்வேன். அவருக்கு ஊழியமும் செய்வேன். அவர் தரும் உணவை உண்டுகொள்வேன். அல்லாஹ்வுக்காகவும் அவனுடைய தூதருக்காகவும் எனது குடும்பம், சொத்து (சுகங்)கள் அனைத்தையும் விட்டுவிட்டு, நான் நாடு துறந்து (மதீனாவுக்கு) வந்திருந்தேன். நாங்களும் மக்காவாசிகளும் சமாதான ஒப்பந்தம் செய்து, எங்களில் ஒருவர் மற்றொருவருடன் கலந்துறவாடிக்கொண்டபோது, நான் ஒரு மரத்தை நோக்கி வந்து, அதன் (அடிப்பாகத்தில் இருந்த) முற்களை அகற்றிவிட்டு அதற்குக் கீழே படுத்துக்கொண்டேன். அப்போது மக்காவாசிகளான நான்கு இணைவைப்பாளர்கள் என்னிடம் வந்து, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை இழிவாகப் பேசத் தொடங்கினர். அவர்கள் மீது எனக்குக் கோபம் வந்தது. உடனே மற்றொரு மரத்துக்கு நான் மாறிக்கொண்டேன். அந்த நால்வரும் தம் ஆயுதங்களை (அந்த மரத்தில்) தொங்கவிட்டுவிட்டு அவர்களும் படுத்துக்கொண்டனர். இந்நிலையில், யாரோ ஒருவர் அந்தப் பள்ளத்தாக்கின் கீழேயிருந்து \"முஹாஜிர்களுக்கு ஏற்பட்ட நாசமே! (நம் தோழர்) இப்னு ஸுனைம் கொல்லப்பட்டுவிட்டார் (ஒப்பந்த மீறல் நடைபெற்றுவிட்டது)\" என்று உரக்க அறிவித்தார். உடனே நான் எனது வாளை உருவிக் கொண்டு, படுத்திருந்த அந்நால்வரைத் தாக்கினேன். அவர்களின் ஆயுதங்களை எடுத்து ஒரே கட்டாக என் கையில் வைத்துக்கொண்டேன். பிறகு \"முஹம்மத் (ஸல்) அவர்களது முகத்தைக் கண்ணியப்படுத்திய (இறை)வன் மீதாணையாக! உங்களில் யாரேனும் தலையைத் தூக்கிப் பார்த்தால் அவரது கண் உள்ள பகுதியிலேயே அடிப்பேன்\" என்று கூறினேன். பின்னர் அவர்களை இழுத்துக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தேன். என் தந்தையின் சகோதரர் ஆமிர் (ரலி) அவர்கள் \"அபலாத்” குலத்தைச் சேர்ந்த \"மிக்ரஸ்” எனப்படும் ஒரு மனிதரை பிடித்துக்கொண்டு, துணி விரிக்கப்பட்ட குதிரையொன்றில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தார். அவருடன் எழுபது இணைவைப்பாளர்களும் இருந்தார்கள். அவர்களை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பார்த்துவிட்டு \"அவர்களை விட்டு விடுங்கள். (ஒப்பந்த மீறல்) குற்றம் அவர்களிடமிருந்தே தொடங்கி மீண்டும் ஏற்பட்டதாக இருக்கட்டும்\" என்று கூறி, அவர்களை மன்னித்து விட்டுவிட்டார்கள். அல்லாஹ் (இது தொடர்பாகவே), \"மக்காவின் மையப் பகுதியில் அவர்களுக்கு எதிராக அவன் உங்களுக்கு வெற்றி அளித்த பின் உங்கள் கைகளை அவர்களிடமிருந்தும், அவர்கள் கைகளை உங்களிடமிருந்தும் அவனே தடுத்தான். அல்லாஹ் நீங்கள் செய்து கொண்டிருப்பதை உற்றுநோக்குபவனாக இருக்கின்றான்\" (48:24) எனும் வசனத்தை அருளினான். பிறகு நாங்கள் மதீனாவை நோக்கித் திரும்பினோம். அப்போது ஓரிடத்தில் நாங்கள் இறங்கித் தங்கினோம். (அந்த இடத்திலிருந்த) எங்களுக்கும் இணைவைப்பாளர்களான \"பனூ லஹ்யான்” குலத்தாருக்கும் இடையே ஒரு மலை மட்டுமே இருந்தது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"(எதிரிகளைக் கண்காணிப்பதற்காக) இன்றிரவு இம்மலைமீது ஏறுபவரின் பாவங்களை அல்லாஹ் மன்னிப்பானாக!\" எனப் பிரார்த்தித்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும் அவர்களுடைய தோழர்களுக்கும் உளவாளி போன்று (அவர் இருக்க வேண்டும் என்பதே நோக்கம்). அன்றிரவு நான் இரண்டு அல்லது மூன்று முறை அம்மலைமீது ஏறினேன். பிறகு நாங்கள் மதீனாவுக்கு வந்தோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் (பால்) ஒட்டகங்களைத் தம் அடிமையான ரபாஹ் (ரலி) அவர்களுடன் அனுப்பிவைத்தார்கள். அவருடன் நானும் இருந்தேன். தல்ஹா (ரலி) அவர்களின் குதிரையை ஓட்டிக்கொண்டு, ஒட்டகங்களுடன் அந்தக் குதிரைக்கும் தண்ணீர் புகட்டி மேய்ச்சல் நிலத்துக்கு அனுப்புவதற்காக நானும் புறப்பட்டுச் சென்றேன். காலையில் அப்துர் ரஹ்மான் அல்ஃபஸாரீ என்பான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் ஒட்டகங்களைத் திடீரெனத் தாக்கி, அவை அனைத்தையும் ஓட்டிச் சென்றுவிட்டான். அவற்றின் மேய்ப்பாளரையும் கொன்றுவிட்டான். உடனே நான், \"ரபாஹே! (இதோ) இந்தக் குதிரையைப் பிடித்துச் சென்று, தல்ஹா பின் உபை தில்லாஹ் (ரலி) அவர்களிடம் சேர்த்துவிடு. மேலும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம், அவர்களின் கால்நடைகளை எதிரிகள் தாக்கிக் கொள்ளையடித்துச் சென்று விட்டனர் எனத் தெரிவித்துவிடு\" என்று கூறினேன். பிறகு ஒரு மலையின் உச்சியில் ஏறி மதீனாவை முன்னோக்கி நின்றுகொண்டு, \"உதவி! உதவி! அதிகாலை ஆபத்து! (யா ஸபாஹா!)\" என மூன்று முறை உரத்த குரலில் கூவினேன். பிறகு அந்தக் (கொள்ளைக்) கூட்டத்தைப் பின்தொடர்ந்து சென்று, அவர்கள்மீது அம்பெய்தவனாக விரட்டிச் சென்றேன். அப்போது நான், \"அக்வஇன் மகன் நான் இன்று அற்பர்களின் (அழிவு) நாள்\" என யாப்புக் கவிதை பாடினேன். பிறகு அவர்களில் ஒருவனை நெருங்கி அவனது ஒட்டகச் சேணத்தின் மீது அம்பெய்தேன். அதன் கூர்முனை சேணத்தில் நுழைந்து அவனது தோளில் பாய்ந்தது. நான், \"இதோ வாங்கிக்கொள்; அக்வஇன் மகன் நான்; இன்று அற்பர்களின் (அழிவு) நாள்\" என்று (பாடியபடி) கூறினேன். அல்லாஹ்வின் மீதாணையாக! இவ்வாறு அவர்கள்மீது அம்பெய்துகொண்டும் அவர்களின் குதிரைகளை வெட்டி வீழ்த்திக்கொண்டும் நான் இருந்தேன். என்னை நோக்கிக் குதிரை வீரர் எவரேனும் திரும்பி வந்தால், நான் ஏதேனும் மரத்தை நோக்கிச் சென்று அதற்குக் கீழே அமர்ந்துகொண்டு, அவன்மீது அம்பைப் பாய்ச்சினேன். அவனது குதிரையை வெட்டி வீழ்த்தினேன். குறுகிய மலையிடுக்கு தென்பட்டபோது, அதன் இடுக்கில் அவர்கள் நுழைந்து கொண்டனர். நானும் அம்மலை மீதேறிக்கொண்டு, கல்லால் அவர்களை விரட்டியடித்தேன். இவ்வாறு (விரட்டியடித்த வண்ணம்) அவர்களை நான் பின்தொடர்ந்து சென்று கொண்டிருந்தேன். இறுதியில் அல்லாஹ் படைத்த அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் ஒட்டகங்கள் அனைத்தையும் என் முதுகுக்குப் பின்னால் கொண்டு வந்துவிட்டேன். அவர்கள் அவற்றை என்னிடமே விட்டுவிட்டு விரைந்துகொண்டிருந்தனர். பிறகு மீண்டும் அவர்கள்மீது அம்பெய்த வண்ணம் அவர்களைப் பின்தொடர்ந்தேன். அவர்கள் (ஓடிய வேகத்தில்) முப்பது சால்வைகளையும் முப்பது ஈட்டிகளையும் விட்டு விட்டு ஓடினர். அவர்கள் விட்டுச் சென்ற ஒவ்வொரு பொருள்மீதும் அல்லாஹ்வின் தூதரும் அவருடைய தோழர்களும் அறியும் விதத்தில் ஓர் அடையாளக் கல்லை வைத்துக் கொண்டேபோனேன். பிறகு ஒரு குறுகலான மலைக் கணவாய்க்கு அவர்கள் சென்றனர். அங்கு பத்ர் அல்ஃபஸாரீ என்பவனின் மகனிடம் அவர்கள் போய்ச்சேர்ந்து, அமர்ந்து காலை உணவை உட்கொள்ளலாயினர். நான் ஒரு மலை உச்சியில் அமர்ந்துகொண்டேன். அப்போது அந்த ஃபஸாரீ, \"நான் காணும் இந்தக் காட்சிகள் என்ன?\" என்று கேட்டான். அதற்கு அவர்கள், \"இதோ இவனிடமிருந்து கடும்துயரத்தை நாங்கள் சந்தித்துவிட்டோம். அல்லாஹ்வின் மீதாணையாக! அதிகாலை இருளிலிருந்து அவன் எங்களை விட்டு விலகவே இல்லை. எங்களை நோக்கி அம்பெய்து எங்கள் கையிலிருந்த எல்லாவற்றையும் பறித்துக்கொண்டான்\" என்று கூறினர். அதற்கு அந்த ஃபஸாரீ, \"உங்களில் நான்கு பேர் அவனை நோக்கிச் செல்லட்டும்\" என்று கூறினான். அவர்களில் நான்கு பேர் நானிருந்த மலைமீது ஏறினர். அவர்கள் எனது பேச்சைக் கேட்கும் இடத்திற்கு வந்தபோது,நான், \"என்னை உங்களுக்குத் தெரியுமா?\" என்று கேட்டேன். அவர்கள் \"இல்லை, நீ யார்?\" என்று கேட்டார்கள். \"நான் சலமா பின் அல்அக்வஉ. முஹம்மத் (ஸல்) அவர்களது முகத்தைக் கண்ணியப்படுத்திய (இறை)வன் மீதாணையாக! உங்களில் யாரேனும் ஒருவரை நான் தேடிப் புறப்பட்டால் அவரை நான் பிடிக்காமல் விடமாட்டேன். (அதே சமயத்தில்) உங்களில் யாரேனும் ஒருவர் என்னைத் தேடிப் புறப்பட்டால் அவரால் என்னைப் பிடிக்க முடியாது\" என்று நான் கூறினேன். அவர்களில் ஒருவன், \"நானும் (அவ்வாறே) கருதுகிறேன்\" என்றான். பிறகு அவர்கள் அனைவரும் திரும்பிச் சென்றனர். நான் அந்த இடத்திலிருந்து நகர்ந்திருக்கக்கூட இல்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் குதிரைப் படையினர் மரங்களிடையே புகுந்து வருவதை நான் பார்த்தேன். அவர்களில முதல் ஆளாக அக்ரம் அல்அசதீ (ரலி) அவர்கள் இருந்தார்கள். அவருக்குப் பின்னால் அபூகத்தாதா அல்அன்சாரீ (ரலி) அவர்கள் இருந்தார்கள். அவரைத் தொடர்ந்து மிக்தாத் பின் அல்அஸ்வத் அல்கிந்தீ (ரலி) அவர்கள் இருந்தார்கள். நான் அக்ரம் (ரலி) அவர்களது குதிரையின் கடிவாளத்தைப் பிடித்துக்கொண்டேன். அவர்கள் நால்வரும் புறமுதுகிட்டு ஓடிக் கொண்டிருந்தனர். நான் \"அக்ரமே! அவர்களிடம் எச்சரிக்கையாக இருந்துகொள்ளுங்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் அவர்களுடைய தோழர்களும் வந்து சேர்வதற்கு முன் (தனியாக வரும்) உம்மை இவர்கள் பிடித்துவிட வேண்டாம்\" என்று கூறினேன். அதற்கு அக்ரம் (ரலி) அவர்கள், \"சலமா! நீங்கள் அல்லாஹ்வின் மீதும் மறுமை நாளின் மீதும் நம்பிக்கை கொண்டவராயிருந்தால், சொர்க்கம் உண்மை; நரகம் உண்மை என நீர் அறிந்திருந்தால் எனக்கும் வீர மரணத்துக்குமிடையே குறுக்கிடாதீர்!\" என்று கூறினார். ஆகவே, அவரை நான் விட்டுவிட்டேன். அவரும் அப்துர் ரஹ்மான் அல்ஃபஸாரியும் (வாள் முனையில்) சந்தித்துக்கொண்டனர். அக்ரம் (ரலி) அவர்கள் அப்துர் ரஹ்மானின் குதிரையை வெட்டிவிட்டார்கள். அப்துர் ரஹ்மான்,அக்ரம் (ரலி) அவர்கள்மீது ஈட்டியைப் பாய்ச்சி அவர்களைக் கொன்றுவிட்டான். முஹம்மத் (ஸல்) அவர்களின் முகத்தைக் கண்ணியப்படுத்திய (இறை)வன் மீதாணையாக! பிறகு நான் காலால் நடந்தே அவர்களைப் பின்தொடர்ந்தேன். எனக்குப் பின்னால் வந்த முஹம்மத் (ஸல்) அவர்களின் தோழர்களையோ,அவர்களது (குதிரை கிளப்பிய) புழுதியையோ நான் பார்க்கவில்லை. இறுதியில் அ(ந்தப் பகை)வர்கள் சூரியன் மறைவதற்கு முன் ஒரு கணவாயை அடைந்தனர். அங்கு ஒரு நீர்நிலை இருந்தது. அதற்கு \"தூ கரத்” எனப் பெயர் சொல்லப்பட்டது. அவர்கள் தாகத்துடன் இருந்ததால் அதில் நீர் அருந்தச் சென்றனர். தங்களுக்குப் பின்னால் நான் ஓடி வருவதை அவர்கள் கண்டதும் அந்த இடத்தைவிட்டு வெளியேறும் நிலைக்கு அவர்கள் உள்ளாயினர். அவர்கள் ஒரு துளி நீரைக்கூட சுவைக்கவில்லை. அவர்கள் அங்கிருந்து கிளம்பி ஒரு மலைக் குன்றில் விரைந்து சென்றனர். நான் வேகமாக ஓடி அவர்களில் ஒருவனைச் சென்றடைந்தேன். அவனது தோள் பட்டையிலுள்ள மெல்லிய எலும்பின் மீது, \"இதோ இதை வாங்கிக்கொள் அக்வஇன் மகன் நான் இன்று அற்பர்களின் (அழிவு) நாள்\" என்று கூறியவாறு ஓர் அம்பைப் பாய்ச்சினேன். அவன், \"உன் தாய் உன்னை இழக்கட்டும்! காலையில் வந்த அக்வஆ நீ?\" என்று கேட்டான். நான் \"ஆம். தனக்குத் தானே பகைவன் ஆகிவிட்டவனே! காலையில் சந்தித்த உன் அக்வஉதான் நான்\" என்றேன். அக்கூட்டத்தார் ஒரு மலைக் குன்றின் மீது இரு குதிரைகளை விட்டுவிட்டு ஓடி விட்டனர். நான் அவ்விரு குதிரைகளையும் பிடித்து, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஓட்டி வந்தேன். அப்போது (என் தந்தையின் சகோதரர்) ஆமிர் (ரலி) அவர்கள் தோல் அடுக்குப் பாத்திரம் ஒன்றை என்னிடம் கொண்டுவந்தார். அதில் தண்ணீர் கலந்த பால் சிறிதளவு இருந்தது. இன்னொரு தோல் அடுக்குப் பாத்திரமும் அவரிடம் இருந்தது. அதில் தண்ணீர் இருந்தது. நான் அங்கத் தூய்மை (உளூ) செய்தேன்; அருந்தினேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தேன். அக்கூட்டத்தாரை நான் விரட்டியடித்த நீர்நிலை அருகில் அவர்கள் இருந்தார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்த ஒட்டகங்களையும் அந்த இணைவைப்பாளர்களிடமிருந்து நான் கைப்பற்றிய ஈட்டிகள், சால்வைகள் உள்ளிட்ட அனைத்துப் பொருட்களையும் எடுத்து வைத்திருந்தார்கள். அப்போது பிலால் (ரலி) அவர்கள், அக்கூட்டத்தாரிடமிருந்து நான் விடுவித்த ஒட்டகங்களில் ஒன்றை அறுத்து அதன் ஈரலையும் திமிலையும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காகப் பொரித்துக்கொண்டிருந்தார்கள். நான், \"அல்லாஹ்வின் தூதரே! என்னை விடுங்கள். நான் (நம்) மக்களில் நூறு பேரைத் தேர்ந்தெடுத்து (அழைத்துக்கொண்டு) அக்கூட்டத்தாரைப் பின் தொடர்ந்து செல்கிறேன். அவர்களில் இறப்புச் செய்தி அறிவிக்கக்கூட ஒருவரையும் விட்டு வைக்காமல் அவர்கள் அனைவரையும் கொன்றுவிடுகிறேன்\" என்று கூறினேன். அதைக் கேட்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் சிரித்தார்கள். அங்கிருந்த நெருப்பின் வெளிச்சத்தில் அவர்களின் கடைவாய்ப் பற்கள் தெரிந்தன. அப்போது அவர்கள், \"சலமா! உன்னால் அதைச் செய்ய முடியும் என நீ கருதுகிறாயா?\"என்று கேட்டார்கள். நான் \"ஆம் (செய்வேன்), தங்களைக் கண்ணியப்படுத்திய (இறை)வன் மீதாணையாக!\" என்று கூறினேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"தற்போது அக்கூட்டத்தார் ஃகத்ஃபான் பகுதியில் விருந்து அளிக்கப்பட்டுக்கொண்டிருக்கிறார்கள்\" என்று (இறையறிவிப்பின் மூலம்) கூறினார்கள். அப்போது ஃகத்ஃபான் பகுதியிலிருந்து ஒரு மனிதர் வந்தார். அவர் \"அக்கூட்டத்தாருக்காக இன்ன மனிதர் இறைச்சி ஒட்டகமொன்றை அறுத்(து விருந்தளித்)தார். அவர்கள் அந்த ஒட்டகத்தின் தோலை உரித்துக்கொண்டிருந்தபோது (பாலைவன வெளியில்) புழுதி கிளம்புவதைக் கண்டனர். உடனே \"அக்(குதிரைப் படைக்) கூட்டம் வந்துவிட்டது” என்று கூறியவாறு வெருண்டோடிவிட்டனர்\" என்று கூறினார். காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்றைய தினத்தில் நம் குதிரைப் படையில் மிகச் சிறந்த வீரர் அபூகத்தாதா ஆவார். நம் காலாட் படையில் மிகச் சிறந்த வீரர் சலமா ஆவார்\" என்று (பாராட்டிக்) கூறினார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், குதிரைப்படை வீரருக்கான ஒரு (பரிசுப்) பங்கும், காலாட்படை வீரருக்கான ஒரு பங்குமாக இரு பங்குகள் சேர்த்து (போர்ச் செல்வமாக) எனக்கு வழங்கினார்கள். பிறகு தமது \"அள்பா” எனும் ஒட்டகத்தில் தமக்குப் பின்னால் என்னை அமரச் செய்து மதீனா நோக்கித் திரும்பினார்கள். நாங்கள் வந்துகொண்டிருந்தபோது (ஒரு நிகழ்ச்சி நடைபெற்றது.) அன்சாரிகளில் ஒருவர் இருந்தார். அவரை ஓட்டப்பந்தயத்தில் யாராலும் வெல்ல முடியாது. அவர், \"மதீனாவரை என்னுடன் போட்டியிட்டு ஓடுபவர் யார்? போட்டியிட்டு ஓடுபவர் யார்?\" என்று திரும்பத் திரும்பக் கூறலானார். அவரது குரலைக் கேட்ட நான் (அவரிடம்), \"மரியாதைக்குரியவர்களை நீ மதிக்கமாட்டாயா? சிறப்புக்குரியவர்களை நீ அஞ்சமாட்டாயா?\" என்று கேட்டேன். அவர் \"இல்லை, அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களாக இருந்தால் தவிர\" என்று கூறினார். நான், \"அல்லாஹ்வின் தூதரே! என் தந்தையும் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும்! என்னை விடுங்கள்; அந்த மனிதரை நான் வெல்கிறேன்\" என்று கேட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"உன் விருப்பம்\" என்றார்கள். நான், \"முதலில் நீ ஓடு” என்று கூறிவிட்டு, என் கால்களை உதறிவிட்டு, குதித்து ஓடினேன். ஓடிக்கொண்டிருந்தபோது ஒன்றிரண்டு மேடுகளில் ஏறியபோது, ஓட்டத்தைக் கட்டுப்படுத்தி மூச்சு வாங்கி ஓய்வெடுத்தேன். பிறகு அவருக்குப் பின்னால் ஓடினேன். மறுபடியும் ஒன்றிரண்டு மேடுகளில் ஏறியபோது ஓட்டத்தை மட்டுப்படுத்தினேன். பிறகு அவரைச் சென்றடைவதற்காக (மேட்டில்) ஏறினேன். அப்போது அவருடைய தோள்களுக்கிடையே அடித்து, \"நீ தோற்கடிக்கப்பட்டாய், அல்லாஹ்வின் மீதாணையாக!\" என்றேன். அவர், \"நானும் (அவ்வாறே) எண்ணுகிறேன்\" என்று கூறினார். மதீனாவரை அவருக்கு முன்பாகவே நான் ஓடிவந்தேன். அல்லாஹ்வின் மீதாணையாக! (மதீனாவிற்கு வந்த பின்) நாங்கள் மூன்று இரவுகள் மட்டுமே தங்கியிருந்தோம். (நான்காம் நாள்தான்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் கைபரை நோக்கி(ப் போருக்காக)ப் புறப்பட்டோம். அப்(பயணத்தின்)போது, என் தந்தையின் சகோதரர் ஆமிர் (ரலி) பின்வரும் யாப்புக் கவிதையைப் பாடினார்கள்: அல்லாஹ்வின் மீதாணையாக! அல்லாஹ் மட்டும் இல்லாவிட்டால் நாங்கள் நேர்வழி பெற்றிருக்கமாட்டோம் தானதர்மம் செய்திருக்கவுமாட்டோம் தொழுதிருக்கவுமாட்டோம் (இறைவா!) நாங்கள் உன் கருணையிலிருந்து தேவையற்றவர்கள் அல்லர். (போர் முனையில் எதிரிகளை) நாங்கள் சந்திக்கும்போது எங்கள் பாதங்களை உறுதிப்படுத்துவாயாக! எங்கள்மீது அமைதியைப் பொழிவாயாக! இதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இவர் யார்?\" என்று கேட்டார்கள். அதற்கு அவர்கள் \"நான் ஆமிர்\" என்றார்கள். \"உம்முடைய இறைவன் உமக்கு மன்னிப்பருள்வானாக\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். (பொதுவாக) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு மனிதருக்காக (போரில் தனிப்பட்ட முறையில்) அவரது பெயர் குறிப்பிட்டுப் பாவமன்னிப்பு வேண்டுவார்களேயானால், அவர் (அப்போரில்) வீர மரணம் அடையாமல் இருந்ததில்லை. ஆகவே, உமர் பின் அல்கத்தாப் (ரலி) அவர்கள், தமது ஒட்டகத்தின் மீதிருந்தவாறு, \"அல்லாஹ்வின் தூதரே! ஆமிர் (நீண்ட நாள் உயிர் வாழ்வதன்) மூலம் எங்களைப் பயனடையச் செய்யக்கூடாதா?\" என்று கேட்டார்கள். பிறகு நாங்கள் கைபர் சென்றடைந்ததும் கைபர்வாசிகளின் மன்னன் மர்ஹப் தனது வாளை மேலும் கீழுமாக அசைத்துக்கொண்டே, \"கைபருக்குத் தெரியும் நான்தான் மர்ஹப் என்று (போருக்கு ஆயத்தமாய் என்றும்) முழு ஆயுதங்கள் தரித்த பண்பட்ட வீரன் என்று. போர்கள் மூண்டு கொழுந்துவிட்டு எரியும்போது (சில நேரம் நான் ஈட்டியெறிவேன் சில நேரம் வாள் வீசுவேன்)\" என்று பாடினான். அப்போது என் தந்தையின் சகோதரர் ஆமிர் (ரலி) அவர்கள் முன்னே வந்து, \"கைபருக்குத் தெரியும் நான் ஆமிர் என்று போர்த் துன்பங்களை எதிர்கொள்ளும் ஆயுதங்கள் தரித்த சரியான வீரன் என்று\" என்று பாடினார்கள். பிறகு இருவரும் மோதிக்கொண்டனர். அப்போது மர்ஹபின் வாள், ஆமிர் (ரலி) அவர்களின் கேடயத்தைத் தாக்கியது. ஆமிர் (ரலி) அவர்கள் (குனிந்து) அவனது கீழ் பகுதியில் (தமது வாளால்) வெட்டப்போனார்கள். அப்போது அவரது வாள் அவரையே திருப்பித் தாக்கிவிட்டது; அவரது கை நரம்பைத் துண்டித்துவிட்டது. அதிலேயே அவரது இறப்பும் ஏற்பட்டது. பிறகு நான் புறப்பட்டுச் சென்றேன். அப்போது நபித்தோழர்களில் சிலர் \"ஆமிரின் நற்செயல்கள் அழிந்துவிட்டன. அவர் தற்கொலை செய்துகொண்டார்\" என்று பேசிக் கொண்டிருந்தனர். உடனே நான் அழுதுகொண்டே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! ஆமிரின் நற்செயல்கள் அழிந்துவிட்டனவா?\" என்று கேட்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(அவ்வாறு) யார் சொன்னது?\" என்று கேட்டார்கள். \"தங்கள் தோழர்களில் சிலர்\" என்று பதிலளித்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவ்வாறு சொன்னவர் பொய்யுரைத்துவிட்டார். அவருக்கு அவரது நன்மை இருமுறை கிடைக்கும்\" என்று கூறினார்கள். பிறகு கண்வலியுடன் இருந்த அலீ (ரலி) அவர்களிடம் (அவர்களை அழைத்துவர) என்னை அனுப்பிவைத்தார்கள். (என்னை அனுப்புவதற்கு முன்) \"நான் (நாளை) இஸ்லாமிய(ச் சேனையின்) கொடியை ஒரு மனிதரிடம் கொடுப்பேன். அவர் அல்லாஹ்வையும் அவனுடைய தூதரையும் நேசிக்கிறார்; அவரை அல்லாஹ்வும் அவனுடைய தூதரும் நேசிக்கின்றனர்\" என்று கூறினார்கள். நான் அலீ (ரலி) அவர்களிடம் சென்று கண் வலியுடனிருந்த அவர்களை அழைத்துக் கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தேன். அப்போது அலீ (ரலி) அவர்களின் கண்களில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உமிழ்ந்தார்கள். அவர்கள் கண் குணமடைந்தார்கள். பிறகு அலீ (ரலி) அவர்களிடம் இஸ்லாமிய(ச் சேனையின்) கொடியைக் கொடுத்தார்கள். கைபரின் மன்னன் மர்ஹப் புறப்பட்டு வந்து, \"கைபருக்குத் தெரியும் நான்தான் மர்ஹப் என்று (போருக்கு ஆயத்தமாய் என்றும்) ஆயுதங்கள் தரித்த பண்பட்ட வீரன் என்று. போர்கள் மூண்டு கொழுந்துவிட்டு எரியும்போது (சில வேளை நான் ஈட்டியெறிவேன் சில வேளை நான் வாள் வீசுவேன்)\" என்று பாடினான். அதற்கு அலீ (ரலி) அவர்கள், என் தாயாரால் ஹைதர் (சிங்கம்) எனப் பெயர் சூட்டப்பட்டவன் நான் அருவருப்பான தோற்றமுடைய அடர்வனத்தின் சிங்கம் நான் சந்தர் எனும் பேரளவையால் அளப்பதைப் போன்று அவர்களைத் தாராளமாக அளந்திடுவேன் (ஏராளமான எதிரிகளை வெட்டி வீழ்த்துவேன்)\" என்று பாடிக்கொண்டே மர்ஹபின் தலையில் ஓங்கி அடித்து, அவனை வீழ்த்தினார்கள். பிறகு அலீ (ரலி) அவர்களின் கரங்களாலேயே (கைபரின்) வெற்றியும் கிட்டியது. இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 32",
			"grades": [],
			"reference": {
				"book": 32,
				"hadith": 162
			}
		}
	]
}