{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4714,
			"arabicnumber": "1823.02",
			"text": "இப்னு உமர் (ரலி) அவர்கள் கூறியதாவது: நான் (என் சகோதரி) ஹஃப்ஸா (ரலி) அவர்களிடம் சென்றபோது அவர், \"உனக்குத் தெரியுமா? உன்னுடைய தந்தை தமக்குப் பின் வேறு யாரையும் ஆட்சித் தலைவராக நியமிக்கமாட்டார்கள்\" என்று கூறினார். நான் \"அவ்வாறு அவர்கள் செய்துவிடக்கூடாது\" என்று கூறினேன். அதற்கு அவர், \"(இல்லை) அவ்வாறுதான் செய்வார்கள்\" என்றார். நான், \"இது தொடர்பாக அவர்களிடம் நான் பேசுவேன்\" எனச் சத்தியமிட்டேன். பிறகு காலைவரை அமைதியாக இருந்துவிட்டேன். (இது தொடர்பாக) அவர்களிடம் நான் பேசவில்லை. (அது குறித்து அவர்களிடம் பேசுவேன் என நான் சத்தியம் செய்திருந்ததால்) எனது வலக்கையில் ஒரு மலையை நான் சுமந்துகொண்டிருந்ததைப் போன்று எனக்கு இருந்தது. திரும்ப அவர்களிடம் சென்றேன். அப்போது அவர்கள் மக்களின் நிலை குறித்து என்னிடம் விசாரித்தார்கள். அதைப் பற்றி அவர்களிடம் நான் தெரிவித்தேன். பிறகு அவர்களிடம், \"மக்கள் ஒரு விஷயத்தைப் பற்றிப் பேசிக்கொள்வதை நான் கேள்விப் பட்டேன். அதைத் தங்களிடம் நான் சொல்வேன் எனச் சத்தியம் செய்துவிட்டேன். தாங்கள் தங்களுக்குப் பிறகு யாரையும் ஆட்சித் தலைவராக நியமிக்கமாட்டீர்கள் எனப் பேசிக் கொண்டனர். (உங்கள்) ஒட்டகத்தையோ ஆட்டையோ மேய்க்கின்ற ஒருவன் உங்களுக்கு இருந்து அவன் அவற்றை (மேய்க்கப்போன இடத்திலேயே) விட்டுவிட்டு, பின்னர் உங்களிடம் வந்தால், அவன் (அவற்றைப்) பாழாக்கிவிட்டான் என்றே நீங்கள் கருதுவீர்கள். அப்படியானால், மக்களை மேய்ப்பது அதைவிடக் கடினமானது (அல்லவா?)\" என்று நான் சொன்னேன். அப்போது எனது கருத்துக்கு என் தந்தை உடன்பட்டார்கள். தமது தலையைச் சிறிது நேரம் தாழ்த்திக்கொண்டிருந்தார்கள். பிறகு தலையை என் பக்கமாக உயர்த்தி, \"வல்லமையும் மாண்பும் மிக்க அல்லாஹ் தனது மார்க்கத்தைப் பாதுகாப்பான். நான் எனக்குப் பின் ஓர் ஆட்சித் தலைவரை நியமிக்காவிட்டால் (அது தவறல்ல); ஏனெனில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமக்குப் பிறகு யாரையும் ஆட்சித் தலைவராக நியமிக்கவில்லை. நான் எனக்குப் பின் யாரையேனும் ஆட்சித் தலைவராக நியமித்தால் (அதுவும் தவறாகாது. ஏனெனில்,) அபூபக்ர் (ரலி) அவர்கள் தமக்குப் பின் (என்னை) ஆட்சித் தலைவராக நியமித்தார்கள்\" என்று கூறினார்கள். அல்லாஹ்வின் மீதாணையாக! அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களையும் அபூபக்ர் (ரலி) அவர்களையும் நினைவு கூர்ந்தபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு நிகராக யாரையும் அவர்கள் ஆக்கமாட்டார்கள்; தமக்குப் பின் யாரையும் ஆட்சித் தலைவராக நியமிக்கமாட்டார்கள் என நான் அறிந்துகொண்டேன். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அத்தியாயம் : 33",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 14
			}
		}
	]
}