{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 480,
			"arabicnumber": "194.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு நாள் (விருந்தொன்றில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு இறைச்சி பரிமாறப் பட்டது. அப்போது (சமைக்கப்பட்ட) முன்கால் சப்பை ஒன்று அவர்களிடம் வழங்கப்பட்டது. அது அவர்களுக்கு மிகவும் பிடித்தமானதாக இருந்தது. (அதை) அவர்கள் தம் பற்களால் கடித்து, அதிலிருந்து சிறிது உண்டார்கள். பிறகு (பின்வருமாறு) கூறினார்கள்: நான் மறுமை நாளில் மனிதர்களின் தலைவன் ஆவேன். அது எப்படி என்று உங்களுக்குத் தெரியுமா? (அந்நாளில்) அல்லாஹ் (மனிதர்களில்) முந்தியவர்களையும் பிந்தியவர்களையும் ஒரே சமவெளியில் ஒன்றுதிரட்டுவான். அழைப்பவர் எவரும் அந்த மக்களை அழைத்தால் அதை அவர்கள் செவியேற்க முடியும். (பார்ப்போரின்) பார்வை அவர்களை ஊடுருவிச் செல்லும். சூரியன் (அவர்களுக்கு) அருகில் வரும். அப்போது மனிதர்களிடம் அவர்களால் தாங்கிக் கொள்ளவோ சகித்துக்கொள்ளவோ இயலாத துன்பங்களும் துயரங்களும் வந்துசேரும். அப்போது மனிதர்களில் சிலர் (சிலரை நோக்கி) \"நீங்கள் (சிக்கிக்கொண்டு) இருக்கும் (அவல) நிலையைக் கவனிக்கவில்லையா? உங்களுக்கு எத்தகைய (ஆபத்தான) நிலை நேர்ந்திருக்கிறது என்பதை நீங்கள் பார்க்க வில்லையா? உங்களுக்காக உங்கள் இறைவனிடம் பரிந்து பேசுபவரை(த் தேடி)ப் பார்க்கமாட்டீர்களா?\" என்று கேட்பார்கள். அப்போது மனிதர்களில் சிலர் வேறு சிலரிடம், \"(ஆதி மனிதர்) ஆதம் (அலை) அவர்களிடம் செல்லுங்கள் (அவர் உங்களுக்காகப் பரிந்து பேசுவார்)\" என்பர். ஆகவே, மனிதர்கள், ஆதம் (அலை) அவர்களிடம் சென்று, \"ஆதமே, நீங்கள் மனித இனத்தின் தந்தையாவீர்கள்; உங்களை அல்லாஹ் தனது கரத்தால் படைத்தான். தன்(னால் உருவாக்கப்பட்ட) உயிரை உங்களுக்குள் அவன் ஊதினான். வானவர்களை உங்களுக்குச் சிரம்பணியும்படி உத்தரவிட்டான். அவ்வாறே அவர்களும் உங்களுக்குச் சிரம் பணிந்தார்கள். நீங்கள் உங்கள் இறைவனிடம் எங்களுக்காகப் பரிந்து பேசுங்கள். நாங்கள் (சிக்கிக்கொண்டு) இருக்கும் (அவல) நிலையையும், எங்களுக்கு நேர்ந்திருக்கும் (துன்ப) நிலையையும் நீங்கள் கவனிக்கவில்லையா?\" என்று கேட்பார்கள். அதற்கு ஆதம் (அலை) அவர்கள் \"(நான் செய்த தவறின் காரணத்தால்) என் இறைவன் என்மீது இன்று (கடுங்)கோபம் கொண்டிருக்கிறான். இதற்கு முன் இதைப் போன்று அவன் கோபம் கொண்டதில்லை. இதற்குப் பிறகும் அவன் இதைப் போன்று ஒருபோதும் கோபம் கொள்ளப்போவதுமில்லை. (நான் நெருங்கக்கூடாத ஒரு) மரத்திலிருந்து (உண்ண வேண்டாமென்று) என்னை அவன் தடுத்தான். நான் அவனுக்கு மாறு செய்தேன். என்னையே நான் காப்பாற்றிக்கொள்ள வேண்டியுள்ளது; என்னையே நான் காப்பாற்றிக்கொள்ள வேண்டியுள்ளது\" என்று கூறிவிட்டு, \"நீங்கள் வேறெவரிடமாவது செல்லுங்கள். நீங்கள் (இறைத்தூதர்) நூஹிடம் செல்லுங்கள்\" என்று சொல்வார்கள். உடனே மக்கள் நூஹ் (அலை) அவர்களிடம் சென்று \"நூஹே! நீங்கள் பூமி(யில் வசிப்பவர்களு)க்கு (அனுப்பப்பெற்ற முக்கியமான) முதலாவது இறைத்தூதர் ஆவீர்கள். உங்களை அல்லாஹ் \"நன்றியுள்ள அடியார்\" என்று குறிப்பிட்டுள்ளான். எங்களுக்காக உங்கள் இறைவனிடம் பரிந்து பேசுங்கள். நாங்கள் (சிக்கிக்கொண்டு) இருக்கும் (அவல) நிலையையும், எங்களுக்கு நேர்ந்திருக்கும் (துன்ப) நிலையையும் நீங்கள் கவனிக்கவில்லையா?\" என்று கேட்பார்கள். அதற்கு நூஹ் (அலை) அவர்கள் \"என் இறைவன் இன்று (என்மீது) கடுங்கோபம் கொண்டுள்ளான். இதற்கு முன் அவன் இதைப் போன்று கோபம் கொண்டதில்லை. இதற்குப் பிறகும் அவன் இதைப் போன்று ஒருபோதும் கோபம் கொள்ளப் போவதுமில்லை. (எல்லா நபிமார்களுக்கும் இருப்பதைப் போன்று விசேஷமான) பிரார்த்தனை ஒன்று எனக்கு (வழங்கப்பட்டு) இருந்தது. அதை நான் என் சமுதாயத்தாருக்கு எதிராகப் பயன்படுத்தி விட்டேன். நான் என்னையே காப்பாற்றிக்கொள்ள வேண்டியுள்ளது; நான் என்னையே காப்பாற்றிக்கொள்ள வேண்டியுள்ளது!\" என்று கூறிவிட்டு, \"நீங்கள் (இறைவனின் உற்ற நண்பர்) இப்ராஹீம் (அலை) அவர்களிடம் செல்லுங்கள்\" என்பார்கள். அவ்வாறே மக்களும் இப்ராஹீம் (அலை) அவர்களிடம் சென்று, \"நீங்கள் இறைத்தூதரும் பூமியில் வசித்தவர்களில் இறைவனின் உற்ற நண்பரும் ஆவீர்கள். எங்களுக்காக உங்கள் இறைவனிடம் பரிந்துரையுங்கள். நாங்கள் (சிக்கிக்கொண்டு) இருக்கும் (அவல) நிலையையும், எங்களுக்கு நேர்ந்திருக்கும் (துன்ப) நிலையையும் நீங்கள் கவனிக்கவில்லையா?\" என்று கேட்பார்கள். அதற்கு இப்ராஹீம் (அலை) அவர்கள் \"என் இறைவன் இன்று (என்மீது) கடுங்கோபம் கொண்டுள்ளான். இதற்கு முன்பும் இதைப் போன்று அவன் கோபம் கொண்டதில்லை. இதற்குப் பிறகும் இதைப் போன்று அவன் ஒருபோதும் கோபம் கொள்ளப்போவதுமில்லை\" என்று கூறிவிட்டுத் தாம் சொன்ன (மூன்று) பொய்களை நினைவு கூருவார்கள். பிறகு \"நான் என்னையே காப்பாற்றிக்கொள்ள வேண்டியுள்ளது; நான் என்னையே காப்பாற்றிக்கொள்ள வேண்டியுள்ளது. (ஆகவே,) வேறெவரிடமாவது நீங்கள் செல்லுங்கள். (இறைத் தூதர்) மூசாவிடம் செல்லுங்கள்\" என்று கூறிவிடுவார்கள். உடனே மக்கள் மூசா (அலை) அவர்களிடம் சென்று, \"மூசாவே! நீங்கள் அல்லாஹ்வின் தூதர் ஆவீர்கள். தன்னுடைய தூதுவத்தை வழங்கியும் உங்களிடம் உரையாடியும் மக்கள் அனைவரையும் விட உங்களை அல்லாஹ் மேன்மைப்படுத்தியுள்ளான். (ஆகவே,) எங்களுக்காக உங்கள் இறைவனிடம் பரிந்து பேசுங்கள். நாங்கள் (சிக்கிக்கொண்டு) இருக்கும் (அவல) நிலையையும், எங்களுக்கு நேர்ந்திருக்கும் (துன்ப) நிலையையும் நீங்கள் கவனிக்க வில்லையா?\" என்று கூறுவார்கள். அதற்கு மூசா (அலை) அவர்கள் \"இன்று என் இறைவன் (என்மீது) கடுங்கோபம் கொண்டுள்ளான். இதற்கு முன்பும் இதைப் போன்று அவன் கோபம் கொண்டதில்லை. இதற்குப் பின்பும் இதைப் போன்று அவன் ஒருபோதும் கோபம் கொள்ளப்போவதுமில்லை. கொலை செய்யுமாறு எனக்கு ஆணையிடப்படாமலேயே நான் ஒரு மனித உயிரைக் கொலை செய்துவிட்டிருக்கிறேன். நான் என்னையே காப்பாற்றிக் கொள்ள வேண்டியுள்ளது; நான் என்னையே காப்பாற்றிக் கொள்ள வேண்டியுள்ளது. (ஆகவே,) நீங்கள் (இறைத்தூதர்) ஈசா (அலை) அவர்களிடம் செல்லுங்கள்\" என்று கூறுவார்கள். உடனே மக்கள் ஈசா (அலை) அவர்களிடம் சென்று, \"ஈசாவே! நீங்கள் அல்லாஹ்வின் தூதர் ஆவீர்கள். நீங்கள் (குழந்தையாய்) தொட்டிலில் இருந்தபோதே மக்களிடம் பேசினீர்கள். மர்யமிடம் இறைவனிட்ட அவனது வார்த்தையும் அவன் (ஊதிய) உயிரும் ஆவீர்கள். ஆகவே, எங்களுக்காக உங்கள் இறைவனிடம் பரிந்து பேசுங்கள். நாங்கள் (சிக்கிக்கொண்டு) இருக்கும் (அவல) நிலையையும், எங்களுக்கு நேர்ந்துள்ள (துன்ப) நிலையையும் நீங்கள் கவனிக்கவில்லையா?\" என்று கேட்பார்கள். அதற்கு ஈசா (அலை) அவர்கள், \"என் இறைவன் இன்று (என்மீது) கடுங்கோபம் கொண்டுள்ளான். இதற்கு முன்பும் இதைப் போன்று அவன் கோபம் கொண்டதில்லை. இதற்குப் பின்பும் இதைப் போன்று அவன் ஒருபோதும் கோபம் கொள்ளப்போவதுமில்லை- (தாம் புரிந்துவிட்டதாக) எந்தப் பாவத்தையும் அவர்கள் குறிப்பிடாமல்- நான் என்னையே காப்பாற்றிக்கொள்ள வேண்டியுள்ளது; நான் என்னையே காப்பாற்றிக்கொள்ள வேண்டியுள்ளது. நீங்கள் வேறெவரிடமாவது செல்லுங்கள்; நீங்கள் (இறுதித்தூதர்) முஹம்மத் (ஸல்) அவர்களிடம் செல்லுங்கள்\" என்று கூறுவார்கள். அப்போது மக்கள் என்னிடம் வந்து, \"முஹம்மதே! நீங்கள் அல்லாஹ்வின் தூதர்; இறைத் தூதர்களில் இறுதியானவர். உங்களது முன் பின் பாவங்களை இறைவன் மன்னித்து விட்டான். எங்களுக்காக உங்கள் இறைவனிடம் பரிந்து பேசுங்கள். நாங்கள் (சிக்கிக்கொண்டு) இருக்கும் (அவல) நிலையையும், எங்களுக்கு நேர்ந்துள்ள (துன்ப) நிலையையும் நீங்கள் கவனிக்கவில்லையா?\" என்று கூறுவர். அப்போது நான் புறப்பட்டு இறைவனின் அரியாசனத்திற்குக் கீழே சென்று என் இறைவனுக்கு(ப் பணிந்து) சஜ்தாவில் விழுவேன். பிறகு இறைவன் எனக்கு முன் வேறெவருக்கும் (உள்ளத்தில்) உதிக்கச் செய்திராத இறைப் புகழ்மாலைகளையும் அழகிய தோத்திரங்களையும் எனக்கு உதிக்கச் செய்வான். பிறகு \"முஹம்மதே! உங்கள் தலையை உயர்த்துங்கள்! கேளுங்கள்; அது உங்களுக்குத் தரப்படும். பரிந்துரையுங்கள்; உங்கள் பரிந்துரை ஏற்கப்படும்\" என்று சொல்லப்படும். அப்போது நான் என் தலையை உயர்த்தி, \"இறைவா! என் சமுதாயம்; என் சமுதாயம்\" என்பேன். அதற்கு \"முஹம்மதே! சொர்க்கவாசல்களில் வலப் பக்க வாசல் வழியாக எந்தவிதக் கேள்வி கணக்கும் இல்லாமல் உங்கள் சமுதாயத்தார் சிலரை நுழையச் செய்யுங்கள்; அவர்கள் மற்ற வாசல்களிலும் மக்களுடன் இணைந்து நுழைந்து கொள்ளலாம்\" என்று கூறப்படும். முஹம்மதின் உயிர் எவன் கையிலுள்ளதோ அவன்மீது சத்தியமாக! சொர்க்கவாசலின் இரு பக்கங்களுக்கிடையேயான தூரம் \"மக்காவிற்கும் (பஹ்ரைனிலுள்ள) ஹஜர் எனும் ஊருக்கும்\" அல்லது \"மக்காவுக்கும் (சிரியாவிலுள்ள) புஸ்ரா எனும் ஊருக்கும்\" இடையிலுள்ள தூரமாகும். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 386
			}
		}
	]
}