{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 482,
			"arabicnumber": "195",
			"text": "அபூஹுரைரா (ரலி) மற்றும் ஹுதைஃபா பின் அல்யமான் (ரலி) ஆகியோர் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் (மறுமை நாளில்) மனிதர்களை ஒன்றுகூட்டுவான். அங்கு இறை நம்பிக்கையாளர்களும் நின்றுகொண்டிருப்பார்கள். அவர்களுக்கு அருகில் சொர்க்கம் கொண்டு வரப்படும். உடனே அவர்கள் ஆதம் (அலை) அவர்களிடம் சென்று, \"எங்கள் தந்தையே! எங்களுக்காகச் சொர்க்கத்தின் வாசலைத் திறக்கும்படி கூறுங்கள்\" என்பார்கள். அதற்கு ஆதம் (அலை) அவர்கள் \"உங்கள் தந்தை ஆதம் செய்த தவறுதானே உங்களைச் சொர்க்கத்திலிருந்தே வெளியேற்றியது! அ(வ்வாறு சொர்க்கத்தைத் திறக்குமாறு கூறுவ)தற்கு நான் உரியவன் அல்லன். (ஆகவே,) நீங்கள் என் புதல்வரும் அல்லாஹ்வின் உற்ற நண்பருமான இப்ராஹீம் அவர்களிடம் செல்லுங்கள்\" என்று கூறுவார்கள். (அவ்வாறே மக்களும் செல்ல) இப்ராஹீம் (அலை) அவர்கள், \"நான் அதற்கு உரியவன் அல்லன். நான் உற்ற நண்பனாக இருந்ததெல்லாம் (வானவர் ஜிப்ரீல் தூதுவராக இருந்த) பின்னணியில்தான்; அந்தப் பின்னணியில்தான். (ஆகவே,) நீங்கள் அல்லாஹ் (நேரடியாக) உரையாடிய மூசா (அலை) அவர்களை நாடிச் செல்லுங்கள்\" என்று கூறுவார்கள். அவ்வாறே மக்களும் மூசா (அலை) அவர்களிடம் செல்ல, அவர்களும் \"நான் அதற்கு உரியவன் அல்லன். (ஆகவே,) நீங்கள் அல்லாஹ்வின் வார்த்தையும் அவனுடைய ஆவியுமான ஈசா (அலை) அவர்களிடம் செல்லுங்கள்\" என்று கூறுவார்கள். (அவ்வாறே மக்களும் செல்ல) ஈசா (அலை) அவர்கள், \"நான் அதற்கு உரியவன் அல்லன்\" என்று கூறுவார்கள். பின்னர் மக்கள் முஹம்மத் (ஸல்) அவர்களிடம் செல்வார்கள். உடனே அவர்கள் எழு(ந்து பரிந்துரைக்க அனுமதி கோரு)வார்கள். அவர்களுக்கு அனுமதி வழங்கப்படும். அப்போது நம்பகத்தன்மையும் இரத்தபந்த உறவும் அனுப்பிவைக்கப்படும். அவையிரண்டும் (நரகத்தின் மீதுள்ள \"ஸிராத்\" எனும்) அப்பாலத்தின் இரு மருங்கிலும் வலம் இடமாக நின்றுகொள்ளும். அப்போது உங்களில் முதல் அணியினர் மின்னலைப் போன்று அதைக் கடந்துசெல்வார்கள். -இதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியபோது, நான் (அபூஹுரைரா-ரலி), \"என் தந்தையும் என் தாயும் தங்களுக்கு அர்ப்பணமாகட்டும். மின்னலைப் போன்று கடந்துசெல்வது என்றால் என்ன?\" என்று கேட்டேன். அதற்கு அவர்கள், \"மின்னல் எவ்வாறு கண் இமைக்கும் நேரத்தில் சென்று விட்டுத் திரும்புகிறதென்று நீங்கள் பார்க்க வில்லையா?\" என்று கேட்டார்கள்.- பிறகு காற்று வீசுவதைப் போன்றும், பறவை பறப்பதைப் போன்றும், மனிதர்கள் விரைந்து ஓடுவதைப் போன்றும் இறைநம்பிக்கையாளர்களை அழைத்துக்கொண்டு அவர்களின் (நற்)செயல்கள் ஓடும். உங்கள் நபியோ அந்தப் பாலத்தின் மீது நின்றுகொண்டு, \"இறைவா! காப்பாற்று! காப்பாற்று!\" என்று கூறிக்கொண்டிருப்பார்கள். இறுதியில் அடியார்களின் செயல்கள் செயலிழந்துபோகும்; அப்போது ஒருவர் வருவார். அவரால் நடக்க முடியாமல் தவழ்ந்தபடியே (அதைக் கடந்து) செல்வார். அந்தப் பாலத்தின் இரு ஓரங்களிலும் கொக்கிகள் மாட்டப்பட்டிருக்கும். சிலரைப் பிடிக்கும்படி அவற்றுக்கு உத்தரவிடப்பட்டிருக்கும். சிலர் காயப்படுத்தப்பட்டுத் தப்பிவிடுவர்; சிலர் நரகநெருப்பில் தள்ளப்படுவர். அபூஹுரைரா (ரலி) அவர்கள் கூறினார்கள்: அபூஹுரைராவின் உயிர் யார் கையில் உள்ளதோ அவன்மீது ஆணையாக! நரகத்தின் ஆழமானது, எழுபது ஆண்டுகள் தொலைதூரம் கொண்டதாகும். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 388
			}
		}
	]
}