{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"33": "The Book on Government"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4923,
			"arabicnumber": "1905.01",
			"text": "சுலைமான் பின் யசார் (ரஹ்) அவர்கள் கூறியதாவது: (ஒருமுறை) அபூஹுரைரா (ரலி) அவர்களிடம் மக்கள் (கூடி, அவை) கலைந்தபோது, சிரியாவாசியான நாத்தில் பின் கைஸ் என்பவர், \"பெரியவரே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து நீங்கள் செவியுற்ற ஹதீஸ் எதையேனும் எங்களுக்குத் தெரிவியுங்கள்\" என்று கேட்டார். அதற்கு அபூஹுரைரா (ரலி) அவர்கள், \"ஆம் (தெரிவிக்கிறேன்). அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (பின்வருமாறு) கூறியதை நான் கேட்டுள்ளேன் என்றார்கள்: மறுமை நாளில் மக்களில் முதல் முதலில் தீர்ப்பு வழங்கப்படுபவர் யாரெனில், இறைவழியில் உயிர்த் தியாகம் செய்தவரே ஆவார். அவர் இறைவனிடம் கொண்டுவரப் படும்போது, அவருக்குத் தான் வழங்கியிருந்த அருட்கொடைகளை இறைவன் எடுத்துரைப்பான். அவற்றை அவர் அறிந்துகொள்வார். பிறகு, \"அந்த அருட்கொடைகளில் நீ எவ்விதம் செயல்பட்டாய்?\" என்று இறைவன் கேட்பான். அவர், \"(இறைவா!) உனக்காக நான் அறப்போரில் ஈடுபட்டு என் உயிரையே தியாகம் செய்தேன்\" என்று பதிலளிப்பார். இறைவன், \"(இல்லை) நீ பொய் சொல்கிறாய். (நீ எனக்காக உயிர்த் தியாகம் செய்யவில்லை.) மாறாக, \"மாவீரன்\" என்று (மக்களிடையே) பேசப்படுவதற்காகவே நீ போரிட்டாய். அவ்வாறு சொல்லப்பட்டுவிட்டது. (உனது நோக்கம் நிறைவேறிவிட்டது)\" என்று கூறுவான். பிறகு இறைவனின் கட்டளைப்படி முகம் குப்புற இழுத்துச் செல்லப்பட்டு, அவர் நரகத்தில் எறியப்படுவார். பிறகு கல்வியைத் தாமும் கற்று அதைப் பிறருக்கும் கற்பித்தவரும் குர்ஆனைக் கற்றுணர்ந்தவருமான (மார்க்க அறிஞர்) ஒருவர் (இறைவனிடம்) கொண்டுவரப்படுவார். அவருக்குத் தான் வழங்கியிருந்த அருட்கொடைகளை இறைவன் எடுத்துரைப்பான். அவற்றை அவர் அறிந்து கொள்வார். பிறகு \"அந்த அருட்கொடைகளில் நீ எவ்விதம் செயல்பட்டாய்?\" என்று இறைவன் கேட்பான். அவர், \"(இறைவா!) கல்வியை நானும் கற்று, பிறருக்கும் அதை நான் கற்பித்தேன். உனக்காகவே குர்ஆனை ஓதினேன்\" என்று பதிலளிப்பார். அதற்கு இறைவன், \"(இல்லை) நீ பொய் சொல்கிறாய். (எனக்காக நீ கல்வியைக் கற்கவுமில்லை; கற்பிக்கவுமில்லை.)\"அறிஞர்\" என்று சொல்லப்பட வேண்டும் என்பதற்காகவே நீ கல்வி கற்றாய்; \"குர்ஆன் அறிஞர்\" என (மக்களிடையே) பேசப்படுவதற்காகவே நீ குர்ஆனை ஓதினாய். அவ்வாறு சொல்லப்பட்டுவிட்டது (உனது நோக்கம் நிறைவேறி விட்டது)\" என்று கூறுவான். பிறகு இறைவனின் கட்டளைப்படி முகம் குப்புற இழுத்துச் செல்லப்பட்டு, அவர் நரகத்தில் எறியப்படுவார். பிறகு இறைவன் தாராளமான வாழ்க்கை வசதிகளும் அனைத்து விதமான செல்வங்களும் வழங்கியிருந்த பெரிய செல்வர் ஒருவர் இறைவனிடம் கொண்டுவரப்படுவார். அவருக்குத் தான் வழங்கியிருந்த அருட்கொடைகளை இறைவன் எடுத்துரைப்பான். அவற்றை அவர் அறிந்துகொள்வார். பிறகு, \"அந்த அருட்கொடைகளில் நீ எவ்விதம் செயல்பட்டாய்?\" என்று இறைவன் கேட்பான். அதற்கு அவர், \"நீ எந்தெந்த வழிகளில் எல்லாம் பொருள் செலவழிக்கப்படுவதை விரும்புகிறாயோ, அந்த வழிகளில் எதையும் விட்டுவிடாமல் அனைத்திலும் நான் உனக்காக எனது பொருளைச் செலவிட்டேன்\" என்று பதிலளிப்பார். அதற்கு இறைவன், \"(இல்லை) நீ பொய் சொல்கிறாய் \"இவர் ஒரு புரவலர்\" என (மக்களிடையே) பேசப்படுவதற்காகவே நீ இவ்வாறு (செலவு) செய்தாய். (உன் எண்ணப்படி) அவ்வாறு சொல்லப்பட்டுவிட்டது. (உனது எண்ணம் நிறைவேறிவிட்டது)\" என்று கூறிவிடுவான். பிறகு இறைவனின் கட்டளைப்படி முகம் குப்புற இழுத்துச் செல்லப்பட்டு, அவர் நரகத்தில் எறியப்படுவார். - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், \"அபூஹுரைரா (ரலி) அவர்களிடமிருந்து மக்கள் கலைந்து சென்றபோது சிரியா நாட்டைச் சேர்ந்த \"நாத்தில் பின் கைஸ்\" என்பவர் அபூஹுரைரா (ரலி) அவர்களிடம் கேட்டார்...\" என ஹதீஸ் ஆரம்பமாகிறது. மற்றவை மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம் பெற்றுள்ளன. அத்தியாயம் : 33",
			"grades": [],
			"reference": {
				"book": 33,
				"hadith": 218
			}
		}
	]
}