{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 508,
			"arabicnumber": "208.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: \"(நபியே!) உங்களுடைய நெருங்கிய உறவினர்களுக்கு எச்சரிக்கை செய்யுங்கள் (அவர்களில் நல்லெண்ணம் படைத்த உங்கள் கூட்டத்தாரையும் எச்சரிக்கை செய்யுங்கள்)\" எனும் (26:214ஆவது) இறைவசனம் அருளப் பெற்றபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் புறப்பட்டுச்சென்று \"ஸஃபா\" மலைக்குன்றின் மீதேறி உரத்த குரலில் \"யா ஸபாஹா!\" (உதவி! உதவி! அதிகாலை ஆபத்து) என்று உரத்த குரலில் கூறினார்கள். அப்போது (குறைஷி) மக்கள், \"சப்தமிடும் இந்த மனிதர் யார்?\" என்று கேட்டார்கள். அதற்கு \"முஹம்மத்\" என்று (சிலர்) பதிலளித்தனர். உடனே முஹம்மத் (ஸல்) அவர்களை நோக்கி மக்கள் திரண்டனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்னாரின் மக்களே, இன்னாரின் மக்களே, இன்னாரின் மக்களே! அப்து மனாஃபின் மக்களே! அப்துல் முத்தலிபின் மக்களே!\" என்று அழைத்தார்கள். அவர்கள் அனைவரும் ஒன்றுகூடினர். அப்போது, \"இந்த மலை அடிவாரத்திலிருந்து (உங்களைத் தாக்குவதற்காக எதிரிகளின்) குதிரைப் படையொன்று புறப்பட்டுவருகிறது என்று நான் உங்களிடம் தெரிவித்தால், என்னை நீங்கள் நம்பியிருப்பீர்களா?\" என்று கேட்டார்கள். மக்கள், \"உம்மிடமிருந்து எந்தப் பொய்யையும் நாங்கள் (இதுவரை) அனுபவித்ததில்லை. (அவ்வாறிருக்க, இதை நாங்கள் நம்பாமல் இருப்போமா?)\" என்று சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அப்படியென்றால், (என் மார்க்கத்தை நீங்கள் ஏற்காவிட்டால் இறைவனின்) கடும் வேதனையொன்று எதிர்நோக்கியுள்ளது என்று உங்களை எச்சரிக்கை செய்கின்றேன்\" என்றார்கள். (அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைப் பார்த்து குறைஷித் தலைவர்களில் ஒருவனான) அபூலஹப், \"உமக்கு அழிவுண்டாகட்டும்! இதற்காகத்தான் எங்களை ஒன்றுகூட்டினாயா?\" என்று கேட்டான். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (புறப்பட) எழுந்தார்கள். அப்போது \"அழியட்டும் அபூலஹபின் இரு கரங்கள்; அவனே அழியட்டும்\" எனும் (111ஆவது) அத்தியாயம் அருளப்பெற்றது. இந்த (111:1ஆவது) வசனத்தை (அதன் இறுதியில் \"கத்\" (ளுóகுú) எனும் இடைச் சொல்லை இணைத்து) \"வ கத் தப்ப\" (அவன் அழிந்தேவிட்டான்) என்றே அப்போது (அறிவிப்பாளர்) அஃமஷ் (ரஹ்) அவர்கள் ஓதினார்கள். அத்தியாயம் : 1",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 414
			}
		}
	]
}