{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5315,
			"arabicnumber": "2039",
			"text": "ஜாபிர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: அகழ் (போருக்காகக் குழி) தோண்டப்பட்டுக்கொண்டிருந்தபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் வயிறு (பசியால்) ஒட்டியிருப்பதைக் கண்டேன். உடனே நான் என் மனைவியிடம் திரும்பிவந்து, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் வயிறு மிகவும் ஒட்டியிருந்ததை நான் கண்டேன். உன்னிடம் ஏதேனும் (உணவு) இருக்கிறதா?\" என்று கேட்டேன். உடனே என் மனைவி என்னிடம் ஒரு பையைக் கொண்டுவந்தார். அதில் ஒரு \"ஸாஉ\" அளவு தொலி நீக்கப்படாத கோதுமை இருந்தது. வீட்டில் வளரும் ஆட்டுக் குட்டி ஒன்றும் எங்களிடம் இருந்தது. அதை நான் அறுத்தேன். என் மனைவி அந்தக் கோதுமையை அரைத்தார். நான் (அறுத்து) முடித்தபோது அவரும் (அரைத்து) முடித்துவிட்டார். மேலும், அதைத் துண்டுகளாக்கி அதற்கான பாத்திரத்தில் இட்டேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் திரும்பிச் சென்றேன். என் மனைவி, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கும் அவர்களுடன் இருப்பவர்களுக்கும் முன்னால் என்னை நீங்கள் கேவலப்படுத்திவிட வேண்டாம் (\"நம்மிடம் உணவு குறைவாகவே இருக்கிறது\" என்று கூறிவிடுங்கள்)\" என்று சொல்லியிருந்தார். எனவே, நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று இரகசியமாக \"அல்லாஹ்வின் தூதரே! நாங்கள் எங்களுக்குச் சொந்தமான ஆட்டுக் குட்டியொன்றை அறுத்தோம். எங்களிடம் இருந்த ஒரு \"ஸாஉ\" அளவு தொலி நீக்கப்படாத கோதுமையை (என் மனைவி) அரைத்து வைத்துள்ளார். எனவே, தாங்களும் தங்களுடன் ஒரு சிலரும் (என் இல்லத்திற்கு) வாருங்கள்\" என்று அழைத்தேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உரத்த குரலில், \"அகழ்வாசிகளே! ஜாபிர் உங்களுக்காக உணவு தயாரித்துள்ளார். எனவே, விரைந்து வாருங்கள்\" என்று கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னிடம்), \"நான் வரும்வரை நீங்கள் பாத்திரத்தை (அடுப்பிலிருந்து) இறக்க வேண்டாம். குழைத்துவைத்துள்ள மாவில் ரொட்டி சுடவும் வேண்டாம்\" என்று கூறினார்கள். நான் என் இல்லத்திற்கு வந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களை அழைத்துக்கொண்டு முன்னால் வந்துகொண்டிருந்தார்கள். நான் என் மனைவியிடம் வந்துசேர்ந்தேன். (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் நூற்றுக்கணக்கான மக்களுடன் வருவதைப் பார்த்து என் மனைவி கோபமுற்று) \"(எல்லாம்) உங்களால்தான்; உங்களால்தான்\" என என்னைக் கடிந்துகொண்டார். உடனே நான் \"நீ அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சொன்ன விஷயத்தை நான் அவர்களிடம் தெரிவித்துவிட்டேன்\" என்று சொன்னேன். பிறகு என் மனைவி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் குழைத்த மாவைக் கொண்டு வந்து கொடுத்தார். அதில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இலேசாக உமிழ்ந்து, பெருக்கம் (பரக்கத்) ஏற்பட பிரார்த்தித்தார்கள். பிறகு (இறைச்சிப்) பாத்திரத்தை நோக்கிச் சென்று, அதில் இலேசாக உமிழ்ந்து பெருக்கம் (பரக்கத்) ஏற்படப் பிரார்த்தித்தார்கள். பிறகு (என் மனைவியிடம்), \"ரொட்டி சுடுபவள் ஒருத்தியை (உதவிக்கு) அழைத்துக்கொள். உன்னுடன் (சேர்ந்து) அவளும் ரொட்டி சுடட்டும்! உங்கள் (இறைச்சிப்) பாத்திரத்திலிருந்து நீ அள்ளிக்கொண்டிரு. பாத்திரத்தை இறக்கி வைத்துவிடாதே\" என்று கூறினார்கள். அ(ங்கு வந்த)வர்கள் ஆயிரம் பேர் இருந்தனர். அல்லாஹ்வின் மீதாணையாக! அவர்கள் அனைவரும் உண்டுவிட்டு, அந்த உணவை (சிறிதும் குறையாமல்) அப்படியே விட்டுவிட்டுத் திரும்பிச் சென்றனர். அப்போது எங்கள் பாத்திரம் முன்பு போலவே (சிறிதும் குறையாமல்) சப்தத்துடன் கொதித்துக்கொண்டிருந்தது. மேலும், நாங்கள் குழைத்த மாவும் (சிறிதும் குறைந்துவிடாமல்) முன்பு போலவே ரொட்டியாகச் சுடப்பட்டுக்கொண்டிருந்தது. அத்தியாயம் : 36",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 189
			}
		}
	]
}