{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5316,
			"arabicnumber": "2040.01",
			"text": "அனஸ் பின் மாலிக் (ரலி) அவர்கள் கூறியதாவது: அபூதல்ஹா (ரலி) அவர்கள் (தம் துணைவியும் என் தாயாருமான) உம்மு சுலைம் (ரலி) அவர்களிடம், \"நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது குரலைப் பலவீனமானதாகக் கேட்டேன். அதில் நான் (அவர்களுக்கு இருக்கும்) பசியைப் புரிந்து கொண்டேன். உன்னிடம் (உணவு) ஏதேனும் இருக்கிறதா?\" என்று கேட்டார்கள். அதற்கு உம்மு சுலைம் (ரலி) அவர்கள், \"ஆம் (இருக்கிறது)\" என்று கூறிவிட்டு, தொலி நீக்கப்படாத கோதுமை(யில் தயாரித்த) ரொட்டிகள் சிலவற்றை எடுத்தார்கள். பிறகு அவர்கள் தமது துப்பட்டா ஒன்றை எடுத்து, அதன் ஒரு பகுதியில் அந்த ரொட்டிகளைச் சுற்றி எனது ஆடைக்குள் திணித்துவிட்டு, அதன் மற்றொரு பகுதியை எனக்கு மேல்துண்டாகப் போர்த்திவிட்டார்கள். பிறகு என்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அனுப்பினார்கள். நான் அதைக் கொண்டுசென்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பள்ளிவாசலில் அமர்ந்திருப்பதைக் கண்டேன். அவர்களுடன் மக்களும் இருந்தனர். நான் (சென்று) அவர்களுக்கு முன்னால் நின்றேன். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னிடம்), \"உன்னை அபூதல்ஹா அனுப்பினாரா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். \"உணவு உண்ணவா?\" என்று கேட்டார்கள். நான் \"ஆம்\" என்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம்முடன் இருந்தவர்களிடம் \"எழுந்திருங்கள்\" என்று சொல்லிவிட்டு, (என் இல்லம் நோக்கி) நடக்கலானார்கள். நான் அவர்களுக்கு முன்னால் நடந்தேன். அபூதல்ஹா (ரலி) அவர்களிடம் நான் சென்று (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் தோழர்களுடன் வந்துகொண்டிருக்கும்) விவரத்தைத் தெரிவித்தேன். உடனே அபூதல்ஹா (ரலி) அவர்கள் (என் தாயாரிடம்), \"உம்மு சுலைம்! அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களுடன் வந்துவிட்டார்கள். ஆனால், அவர்களுக்கு வேண்டிய உணவு நம்மிடம் இல்லையே!\" என்று சொன்னார்கள். உம்மு சுலைம் (ரலி) அவர்கள் \"அல்லாஹ்வும் அவனுடைய தூதருமே அறிந்தவர்கள்\" என்று கூறினார்கள். அபூதல்ஹா (ரலி) அவர்கள் (தாமே அல்லாஹ்வின் தூதர் (ஸல்) அவர்களை வரவேற்பதற்காக) நடந்து சென்று, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களைச் சந்தித்தார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அபூதல்ஹா (ரலி) அவர்களுடன் வீட்டுக்குள் நுழைந்தார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"உம்மு சுலைம்! உம்மிடம் இருப்பதைக் கொண்டுவா\" என்று சொல்ல, உம்மு சுலைம் (ரலி) அவர்கள் அந்த ரொட்டியைக் கொண்டுவந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அதைத் துண்டு துண்டாகப் பிய்க்கும்படி) உத்தரவிட, அவ்வாறே அது பிய்க்கப்பட்டது. உம்மு சுலைம் (ரலி) அவர்கள், தம்மிடமிருந்த தோல் பையிலிருந்து வெண்ணெய் எடுத்துப் பிழிந்து அதை (உருக்கி)க் குழம்பு செய்தார்கள். பிறகு அதில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இறைவன் நாடிய (பிராத்தனை வரிகள் சில)வற்றைச் சொன்னார்கள். பிறகு \"பத்துப் பேருக்கு (உள்ளே வர) அனுமதி அளியுங்கள்\" என்று (அபூதல்ஹா (ரலி) அவர்களிடம்) சொன்னார்கள். அவ்வாறே அவர்களுக்கு அபூதல்ஹா (ரலி) அவர்கள் அனுமதி அளித்தார்கள். அவர்கள் (பத்துப் பேர்) வந்து வயிறார உண்டுவிட்டு வெளியேறினார்கள். பின்னர், \"இன்னும் பத்துப் பேருக்கு அனுமதி அளியுங்கள்\" என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூற,அபூதல்ஹா (ரலி) அவர்களும் அனுமதியளித்தார்கள். அவர்களும் வயிறார உண்டுவிட்டு வெளியேறினார்கள். பிறகு \"இன்னும் பத்துப் பேருக்கு அனுமதி அளியுங்கள்\" என்றார்கள். (இவ்வாறு வந்திருந்த) மக்கள் அனைவரும் வயிறார உண்டார்கள். அப்படி உண்ட மக்கள் எழுபது அல்லது எண்பது பேர் ஆவர். அத்தியாயம் : 36",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 190
			}
		}
	]
}