{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5328,
			"arabicnumber": "2042.01",
			"text": "அப்துல்லாஹ் பின் புஸ்ர் (ரலி) அவர்கள் கூறியதாவது: (ஒருமுறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என் தந்தை (புஸ்ர் பின் அபீபுஸ்ர்-ரலி) அவர்களிடம் (விருந்தாளியாகத்) தங்கினார்கள். அப்போது அவர்களுக்கு அருகே உணவும் (பேரீச்சம் பழம், பாலாடை, நெய் ஆகியவற்றால் செய்யப்பட்ட \"வத்பா\" எனும்) ஒரு வகைப் பலகாரமும் வைத்தோம். அதிலிருந்து அவர்கள் உண்டார்கள். பிறகு பேரீச்சம் பழங்கள் கொண்டுவரப்பட்டன. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் பேரீச்சம் பழத்தைச் சாப்பிட்டுவிட்டு, அவற்றின் கொட்டைகளை (பாத்திரத்தினுள்ளே போடாமல்) தம்மிரு விரல்களுக்கிடையே வைத்திருந்(துவிட்டு பிறகு வீசியெறிந்)தார்கள். - இதைக் கூறியபோது அறிவிப்பாளர் தம் ஆட்காட்டி விரலையும் நடு விரலையும் இணைத்து சைகை செய்கிறார். (இதன் அறிவிப்பாளர்களில் ஒருவரான) ஷுஅபா (ரஹ்) அவர்கள் \"இன்ஷா அல்லாஹ், \"இரு விரல்களுக்கிடையே கொட்டையை வைத்திருந்தார்கள்\" என்பது ஹதீஸிலேயே உள்ளதாகும் என்பதே என் எண்ணமாகும்\" என்று (ஐயத்துடன்) கூறினார்கள்.- பிறகு ஒரு பானம் கொண்டுவரப்பட்டபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதையும் அருந்தினார்கள். பிறகு மீதியிருந்ததைத் தமக்கு வலப்பக்கத்திலிருந்தவருக்குக் கொடுத்தார்கள். பிறகு (அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் புறப்படத் தயாரானபோது) என் தந்தை, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் வாகனத்தின் கடிவாளத்தைப் பிடித்துக்கொண்டு, \"எங்களுக்காகப் பிரார்த்தியுங்கள்\" என்று கூறினார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இறைவா! நீ இவர்களுக்கு வழங்கிய உணவில் அருள்வளம் (பரக்கத்) புரிவாயாக! இவர்களை மன்னித்து, இவர்களுக்குக் கருணை புரிவாயாக!\" (அல்லாஹும்ம, பாரிக் லஹும் ஃபீமா ரஸக்த்தஹும்,, வஃக்ஃபிர் லஹும், வர்ஹம்ஹும்) எனப் பிரார்த்தித்தார்கள். - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் புஸ்ர் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"இரு விரல்களுக்கிடையே பேரீச்சம் பழக் கொட்டைகளை வைத்திருந்(துவிட்டுப் பிறகு வீசியெறிந்)தார்கள்\" என்பது ஐயத்திற்கிடமின்றி (ஹதீஸில் உள்ளதாகவே) அறிவிக்கப் பட்டுள்ளது. அத்தியாயம் : 36",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 202
			}
		}
	]
}