{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5359,
			"arabicnumber": "2054.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"எனக்கு (கடுமையான பசி)த் துன்பம் ஏற்பட்டுள்ளது\" என்று கூறினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் துணைவியரில் ஒருவரிடம் ஆளனுப்பி (அவர்களிடம் உணவு ஏதேனும் இருக்கிறதா என்று கேட்டுவரச் சொன்)னார்கள். அதற்கு அத்துணைவியார், \"தங்களைச் சத்திய (மார்க்க)த்துடன் அனுப்பியவன் மீதாணையாக! என்னிடம் தண்ணீரைத் தவிர வேறெதுவும் இல்லை\" என்று பதிலளித்தார். பிறகு (தம் துணைவியரில்) மற்றொருவரிடம் ஆளனுப்பியபோது, அவரும் அதைப் போன்றே பதிலளித்தார். முடிவில் ஒவ்வொரு துணைவியரிடமிருந்தும் அதே பதிலே வந்தது. \"இல்லை; தங்களைச் சத்திய (மார்க்க)த்துடன் அனுப்பியவன் மீதாணையாக! என்னிடம் தண்ணீரைத் தவிர வேறெதுவும் இல்லை\" என்றே கூறினர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தம் தோழர்களை நோக்கி), \"இன்றிரவு இவருக்கு விருந்தளிப்பவர் யார்? அவருக்கு அல்லாஹ் அருள்புரிவான்\" என்று கேட்டார்கள். அப்போது அன்சாரிகளில் ஒருவர் எழுந்து, \"நான் (இவருக்கு விருந்தளிக்கிறேன்), அல்லாஹ்வின் தூதரே!\" என்று சொல்லி, (அவரை அழைத்துக்கொண்டு) தம் வீட்டுக்குச் சென்றார். அங்கு தம் மனைவியிடம், \"உன்னிடம் (உணவு) ஏதேனும் இருக்கிறதா?\" என்று கேட்டார். அதற்கு அவர் மனைவி \"நம் குழந்தைகளின் உணவைத் தவிர வேறெதுவுமில்லை\" என்றார். அவர், \"(நம் குழந்தைகள் உணவு கேட்டால்) ஏதாவது காரணம் சொல்லி (தூங்கவைத்து) விடு; நம் விருந்தாளி நமது வீட்டுக்குள் நுழைந்ததும் (வீட்டிலுள்ள உணவைத் தயாராக எடுத்து வைத்துவிட்டு, விளக்கை ஏற்றிவிடுவதுபோல் பாவனை செய்து) விளக்கை அணைத்துவிடு. நாமும் சாப்பிட்டுக்கொண்டிருப்பதைப் போன்று அவருக்குக் காட்டிக்கொள். (மறக்காமல் விருந்தாளி வந்து) சாப்பிடக் கையை நீட்டும்போது விளக்கை நோக்கிச் சென்று அதை அணைத்துவிடு\" என்று கூறினார். அவ்வாறே (விருந்தாளி வந்ததும்) அவர்கள் அனைவரும் அமர்ந்தனர். விருந்தாளி சாப்பிட்டார். பிறகு (விருந்தளித்த) அந்தத் தோழர் காலையில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்றபோது, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"இன்றிரவு நீங்கள் இருவரும் உங்கள் விருந்தாளியிடம் நடந்து கொண்ட முறையைக் கண்டு அல்லாஹ் வியப்படைந்தான்\" என்று சொன்னார்கள். அத்தியாயம் : 36",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 233
			}
		}
	]
}