{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "மிக்தாத் பின் அல்அஸ்வத் (ரலி) அவர்கள் கூறியதாவது: நானும் என்னிரு நண்பர்களும் பசியால் காதும் கண்ணும் (அடைபட்டுப்) போய்விட்ட நிலையில் வந்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடைய தோழர்களுக்கு முன்னால் தலை காட்டினோம். (வறுமை சூழ்ந்திருந்த அந்த நிலையில்) அவர்களில் எவரும் எங்களை (விருந்தாளிகளாக) ஏற்றுக்கொள்ளவில்லை. எனவே, நாங்கள் நபி (ஸல்) அவர்களிடம் சென்றோம். நபி (ஸல்) அவர்கள் எங்களைத் தம் வீட்டாரிடம் அழைத்துச் சென்றார்கள். அங்கு மூன்று பெட்டை வெள்ளாடுகள் இருந்தன. நபி (ஸல்) அவர்கள், \"இவற்றிலிருந்து பால் கறந்து நம்மிடையே பகிர்ந்துகொள்வோம்\" என்று சொன்னார்கள். அவ்வாறே நாங்கள் பால் கறந்து எங்களில் ஒவ்வொருவரும் தமக்குரிய பங்கைப் பருகினோம். நபி (ஸல்) அவர்களுக்குரிய பங்கை அவர்களுக்காக எடுத்துவைத்தோம். நபி (ஸல்) அவர்கள் இரவில் (எங்களிடம்) வந்து,உறங்கிக்கொண்டிருப்பவரை விழிக்கச் செய்யாமல், விழித்திருப்பவர்களுக்குக் கேட்கும் விதமாக (மெதுவாக) முகமன் (சலாம்) சொல்வார்கள். பிறகு பள்ளிவாசலுக்குச் சென்று தொழுவார்கள். பிறகு தமது பானத்தை நோக்கி வந்து (அதை) அருந்துவார்கள். இந்நிலையில், எனது பங்கை நான் அருந்திவிட்ட நிலையில் ஓர் இரவில் என்னிடம் ஷைத்தான் வந்து, \"முஹம்மத் அவர்கள் அன்சாரிகளிடம் செல்லும்போது அவர்களுக்கு அன்சாரிகள் அன்பளிப்புகள் வழங்குகிறார்கள். நபி (ஸல்) அவர்களும் அதைப் பெற்று (புசித்து)க்கொள்கிறார்கள். இந்த ஒரு மிடறு(ப்பால்) அவர்களுக்குத் தேவையே இருக்காது\" என்று சொன்னான். எனவே, நான் அந்தப் பாலை நோக்கிச் சென்று அதைப் பருகிவிட்டேன். என் வயிற்றுக்குள் பால் இறங்கியதும், (அருந்திய) அந்தப் பாலை(த் திருப்பி)க் கொடுக்க வழியில்லை என்பதை நான் உணர்ந்தேன். பிறகு ஷைத்தான் \"உனக்குக் கேடு நேரட்டும்! என்ன காரியம் செய்துவிட்டாய்! முஹம்மத் அவர்களுக்குரிய பானத்தைப் பருகிவிட்டாயே? அவர் (வீட்டுக்கு) வரும் போது, பால் இல்லாததைக் கண்டு உனக்கெதிராகப் பிரார்த்தித்துவிட்டால் நீ அழிந்துபோவாய். உனது இம்மையும் மறுமையும் (பாழாகிப்) போய்விடுமே!\" என்று என்னைச் சஞ்சலப்படுத்தினான். அப்போது என்மீது ஒரு சால்வை இருந்தது. அதை என் பாதங்கள்மீது போர்த்தினால் தலை வெளியே தெரியும். தலைமீது போர்த்தினால் என் பாதங்கள் வெளியே தெரியும். (உடல் முழுவதும் போர்த்தி மூடிக்கொள்ளும் அளவுக்கு அது இருக்கவில்லை.) எனக்கு (அன்றிரவு குற்றஉணர்வால்) தூக்கமே வராமலாயிற்று. என்னிரு தோழர்களோ (நிம்மதியாகத்) தூங்கிவிட்டனர். நான் செய்த தவறை அவர்களிருவரும் செய்யவில்லை. பிறகு நபி (ஸல்) அவர்கள் வந்து வழக்கம்போல் சலாம் சொன்னார்கள். பிறகு பள்ளிவாசலுக்குச் சென்று தொழுதார்கள். பிறகு தமது பானத்தை நோக்கி வந்து, அதைத் திறந்தார்கள். அதில் எதுவும் இருக்கவில்லை. அப்போது வானத்தை நோக்கித் தமது தலையை உயர்த்தினார்கள். \"இப்போது எனக்கெதிராக அவர்கள் பிரார்த்திப்பார்கள். நான் அழிந்துபோய்விடுவேன்\" என்று நான் (எனக்குள்ளே) கூறிக்கொண்டேன். ஆனால் அவர்கள், \"இறைவா! எனக்கு உண்ண உணவளித்தவருக்கு நீ உணவளிப்பாயாக! எனக்குப் பருகப்பானம் புகட்டியவருக்கு நீ புகட்டுவாயாக!\" (அல்லாஹும்ம அத்இம் மன் அத்அமனீ வஸ்கி மன் சகானீ) என்று பிரார்த்தித்தார்கள். நான் அந்தச் சால்வையை எடுத்து அதை இறுக்கமாக என்மீது கட்டிக்கொண்டு, கத்தியை எடுத்துக்கொண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குரிய அந்த வெள்ளாடுகளை நோக்கிச் சென்று, அவற்றில் கொழுத்த ஆடு எது என்பதைப் பார்த்து, அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்காக அறுக்கலாம் என நினைத்தேன். ஆனால்,அவற்றின் பால்மடிகள் திரண்டு காணப்பட்டன. அவற்றில் ஒவ்வொன்றும் பால் சுரந்து காணப்பட்டன. உடனே நான் முஹம்மத் (ஸல்) அவர்களின் குடும்பத்தார் பால் கறப்பதற்குப் பயன்படுத்தும் ஒரு பாத்திரத்தை நோக்கிச் சென்று அதில் பால் கறந்தேன். அதில் நுரை ததும்பும் அளவுக்குக் கறந்தேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தேன். அப்போது அவர்கள், \"இன்றிரவு நீங்கள் உங்களுக்குரிய பானத்தைப் பருகினீர்களா?\" என்று கேட்டார்கள். நான், \"அல்லாஹ்வின் தூதரே! தாங்கள் பருகுங்கள்\" என்றேன். அவர்கள் பருகி விட்டுப் பிறகு (மீதியை) என்னிடம் கொடுத்தார்கள். பிறகு (மீண்டும்) நான், \"அல்லாஹ்வின் தூதரே! (இன்னும்) பருகுங்கள்\" என்றேன். அவர்கள் பருகிவிட்டுப் பிறகு (மீதியை மீண்டும்) என்னிடம் கொடுத்தார்கள். நபி (ஸல்) அவர்களின் தாகம் தணிந்துவிட்டது;அவர்களது பிரார்த்தனை எனக்குக் கிடைத்துவிட்டது என்பதை நான் அறிந்துகொண்டபோது, (மகிழ்ச்சியால்) பூமியில் விழுமளவுக்குச் சிரித்தேன். அப்போது நபி (ஸல்) அவர்கள், \"மிக்தாதே! ஏதோ ஒரு குறும்பு செய்துள்ளீர்! அது என்ன?\" என்று கேட்டார்கள். நான், \"அல்லாஹ்வின் தூதரே! இன்னின்னவாறு நடந்தது. இப்படி நான் செய்தேன்\" என்று சொன்னேன். அப்போது நபி (ஸல்) அவர்கள், \"இது அல்லாஹ்விடமிருந்து வந்துள்ள கருணையே ஆகும். இதை (முன்பே) என்னிடம் தெரிவித்திருக்கக் கூடாதா? நம் தோழர்கள் இருவரையும் நாம் எழுப்பி, அவர்களுக்கும் அதைக் கிடைக்கச் செய்திருக்கலாமே!\" என்று கூறினார்கள். அப்போது நான், \"தங்களைச் சத்திய (மார்க்க)த்துடன் அனுப்பியவன் மீதாணையாக! அதைத் தாங்களும் தங்களுடன் நானும் அடைந்துகொண்ட பின் மக்களில் வேறு யாருக்குக் கிடைத்தாலும் (கிடைக்காவிட்டாலும்) அதை நான் பொருட்படுத்த மாட்டேன்\" என்று கூறினேன். - மேற்கண்ட ஹதீஸ் மிக்தாத் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 36",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		}
	]
}