{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"37": "The Book of Clothes and Adornment"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5388,
			"arabicnumber": "2066.01",
			"text": "பராஉ பின் ஆஸிப் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஏழு விஷயங்களைக் கடைப்பிடிக்கும்படி எங்களுக்குக் கட்டளையிட்டார்கள். ஏழு செயல்களைச் செய்ய வேண்டாமென எங்களுக்குத் தடை விதித்தார்கள். எங்களுக்கு அவர்கள் கட்டளையிட்ட ஏழு விஷயங்களாவன: 1. நோயாளிகளை நலம் விசாரிப்பது. 2. ஜனாஸாவைப் பின்தொடர்ந்து செல்வது. 3. தும்மிய(வர் \"அல்லாஹ்வுக்கே எல்லாப் புகழும்\" என்று கூறினால் அ)வருக்கு (\"அல்லாஹ், உங்களுக்குக் கருணை புரிவானாக!\" என்று) மறுமொழி கூறுவது. 4. சத்தியத்தை நிறைவேற்றுவது அல்லது (உன்னோடு தொடர்புடைய ஒரு விஷயத்தில்) சத்தியம் செய்தவருக்கு அதை நிறைவேற்ற உதவுவது. 5. அநீதியிழைக்கப்பட்டவருக்கு உதவுவது. 6. விருந்தழைப்பை ஏற்றுக்கொள்வது. 7. (மக்களிடையே) சலாமைப் பரப்புவது. எங்களுக்கு அவர்கள் தடை விதித்த ஏழு விஷயங்களாவன: 1. (ஆண்கள்) \"பொன் மோதிரம் அணிவது\" அல்லது \"மோதிரங்கள் அணிவது\" 2. வெள்ளிப் பாத்திரத்தில் பருகுவது. 3.மென்பட்டுத் திண்டு பயன்படுத்துவது. 4. (ஆண்கள் எகிப்தியப்) பட்டு கலந்த பஞ்சாடை அணிவது. 5. (ஆண்கள்) சாதாரணப் பட்டு அணிவது. 6. (ஆண்கள்) கெட்டிப் பட்டு அணிவது. 7. (ஆண்கள்) அலங்காரப் பட்டு அணிவது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் பராஉ பின் ஆஸிப் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"சத்தியத்தை நிறைவேற்றுவது, அல்லது சத்தியம் செய்தவருக்கு அதை நிறைவேற்ற உதவுவது\" என்பது இடம்பெறவில்லை. அதற்குப் பகரமாக \"கண்டெடுக்கப்பட்ட பொருள் பற்றி அறிவிப்புச் செய்வது\" என இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் பராஉ பின் ஆஸிப் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"சத்தியத்தை நிறைவேற்றுவது\" என ஐயப்பாடின்றி அறிவிக்கப்பட்டுள்ளது. மேலும் அவற்றில் \"வெள்ளிப் பாத்திரத்தில் பருகுவது; ஏனெனில், இம்மையில் அதில் பருகியவர் மறுமையில் அதில் பருகமாட்டார்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் ஏழு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. இவற்றிலும் மேற்கண்ட ஹதீஸ்களில் உள்ள தகவல்களே இடம்பெற்றுள்ளன. ஆனால், \"(மக்களிடையே) சலாமைப் பரப்புவது\" என்பதற்குப் பகரமாக \"சலாமுக்குப் பதிலுரைப்பது\" என இடம்பெற்றுள்ளது. மேலும் \"(ஆண்கள்) தங்க மோதிரம் அணிவது அல்லது \"தங்க வளையம் அணிவது\" என்று (ஐயத்துடன்) காணப்படுகிறது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"சலாமைப் பரப்புவது\" என்றும் \"தங்க மோதிரம் அணிவது\" என்றும் சந்தேகமின்றி இடம்பெற்றுள்ளது. அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 4
			}
		}
	]
}