{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"37": "The Book of Clothes and Adornment"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5403,
			"arabicnumber": "2068.03",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: \"தமீம்\" குலத்தைச் சேர்ந்த உத்தாரித் (பின் ஹாஜிப்) என்பவர் கடைத்தெருவில் நின்று, கோடுபோட்ட பட்டு அங்கி விற்பதை உமர் (ரலி) அவர்கள் கண்டார்கள். -உத்தாரித் (பன்னாட்டு) மன்னர்களுடன் தொடர்புள்ளவராகவும், அவர்களிடமிருந்து (பல்வேறு பொருட்களைப்) பெற்றுவருபவராகவும் இருந்தார்.- பிறகு உமர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! கடைத்தெருவில் நின்று, கோடு போட்ட பட்டு அங்கியை உத்தாரித் விற்பதைக்கண்டேன். அதைத் தாங்கள் வாங்கி, அரபுத் தூதுக் குழுக்கள் தங்களிடம் வரும்போது தாங்கள் அணிந்துகொண்டால் நன்றாயிருக்குமே!\" என்று சொன்னார்கள். \"வெள்ளிக்கிழமையின்போதும் அணிந்து கொண்டால் நன்றாயிருக்குமே\" என்றும் அவர்கள் கூறியதாக நான் எண்ணுகிறேன். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மறுமையில் எந்த நற்பேறும் இல்லாதவரே இம்மையில் இந்தப் பட்டாடைகளை அணிவார்\" என்று சொன்னார்கள். பின்னர் (ஒரு நாள்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கோடு போட்ட பட்டாடைகள் சில கொண்டுவரப்பட்டன. அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவற்றில் ஓர் பட்டாடையை உமர் (ரலி) அவர்களுக்கும் மற்றொன்றை உசாமா பின் ஸைத் (ரலி) அவர்களுக்கும் அனுப்பி வைத்தார்கள். இன்னொன்றை அலீ பின் அபீதாலிப் (ரலி) அவர்களுக்குக் கொடுத்து, \"இதை முக்காடுகளாக வெட்டி உங்கள் பெண்களிடையே பங்கிட்டுவிடுங்கள்\" என்று கூறினார்கள். உமர் (ரலி) அவர்கள் தமது பட்டாடையை எடுத்துக்கொண்டு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! இதை எனக்குக் கொடுத்தனுப்பியுள்ளீர்கள். ஆனால், உத்தாரித் விற்ற பட்டாடை குறித்து நேற்று தாங்கள் வேறுவிதமாகக் கூறினீர்களே?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதை நீங்கள் அணிந்துகொள்வதற்காக உங்களுக்கு நான் கொடுத்தனுப்பவில்லை. மாறாக, இதை நீங்கள் (விற்றுப் பணம்) பெறுவதற்காகவே கொடுத்தனுப்பினேன்\" என்று சொன்னார்கள். உசாமா (ரலி) அவர்களோ அதை அணிந்துகொண்டு வந்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உசாமாவை உற்றுப் பார்த்தார்கள். (அவர்கள் பார்த்த பார்வையிலிருந்து) அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்குத் தாம் (இவ்வாறு) செய்தது பிடிக்கவில்லை யென்பதை உசாமா உணர்ந்து கொண்டார். உடனே \"அல்லாஹ்வின் தூதரே! ஏன் (இப்படி) என்னை உற்றுப் பார்க்கிறீர்கள்? தாங்கள் தாமே இதை எனக்குக் கொடுத்தனுப்பினீர்கள்?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இதை நீ அணிந்துகொள்வதற்காக உனக்கு நான் கொடுத்தனுப்பவில்லை. மாறாக, இதை முக்காடுகளாக வெட்டி, உன் (வீட்டுப்) பெண்களுக்குப் பங்கிடுவதற்காகவே உனக்குக் கொடுத்தனுப்பினேன்\" என்று சொன்னார்கள். அத்தியாயம் : 37",
			"grades": [],
			"reference": {
				"book": 37,
				"hadith": 18
			}
		}
	]
}