{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 553,
			"arabicnumber": "234.01",
			"text": "உக்பா பின் ஆமிர் (ரலி) அவர்கள் கூறியதாவது: நாங்கள் (முறைவைத்து) ஒட்டகங்கள் மேய்த்துவந்தோம். இந்நிலையில் எனது முறை வந்தபோது மாலை நேரத்தில் நான் அவற்றை ஓட்டிக்கொண்டு மேய்ச்சல் நிலத்திற்குச் சென்றேன். (பிறகு நான் திரும்பிவந்தேன்.) அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களிடையே நின்று உரையாற்றிக் கொண்டிருந்தார்கள். அப்போது அவர்கள்,ஒரு முஸ்லிம் அழகிய முறையில் அங்கத் தூய்மை செய்து, அகத்தையும் முகத்தையும் ஒருமுகப்படுத்தி (பணிந்து,உள்ளச்சத்துடன்) தொழுதால் அவருக்குச் சொர்க்கம் கட்டாயமாகாமல் இருப்பதில்லை என்று கூறுவதை நான் கேட்டேன். உடனே நான் என்ன அருமையான வார்த்தை! என்றேன். அப்போது எனக்கு முன்னால் இருந்த ஒருவர் இதற்கு முன்னர் சொன்ன வார்த்தை இதைவிட அருமையானது என்றார். உடனே நான் (அவர் யார் என்று) பார்த்தேன். அங்கே உமர் (ரலி) அவர்கள் இருந்தார்கள். உமர் (ரலி) அவர்கள் (என்னிடம்) கூறினார்கள்: சற்று முன்னர்தான் நீங்கள் இங்கு வந்தீர்கள்; நான் பார்த்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (நீங்கள் வருவதற்கு முன் பின்வருமாறு) கூறினார்கள்: உங்களில் ஒருவர் முழுமையான முறையில் அங்கத் தூய்மை செய்துவிட்டு, அஷ்ஹது அல்லாயிலாஹ இல்லல்லாஹு வ அன்ன முஹம்மதன் அப்துல்லாஹி வரசூலுஹு (அல்லாஹ்வைத் தவிர வேறு இறைவன் இல்லை என்றும், முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் அடியாரும் தூதரும் ஆவார்கள் என்றும் உறுதிமொழிகிறேன்) என்று கூறினால், சொர்க்கத்தின் எட்டு வாசல்களும் அவருக்காகத் திறக்கப்படுகின்றன.அவற்றில் தாம் நாடிய வாசலில் அவர் நுழைந்துகொள்ளலாம். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில், அங்கத் தூய்மை செய்துவிட்டு, அஷ்ஹது அல்லாயிலாஹ இல்லல்லாஹு வஹ்தஹு லா ஷரீக்க லஹு,வ அஷ்ஹது அன்ன முஹம்மதன் அப்துஹு வ ரசூலுஹு என்று கூறுவாராயின் என்று (சற்று வித்தியாசத்துடன்) இடம்பெற்றுள்ளது. (பொருள்: அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை; அவன் தனித்தவன்; அவனுக்கு இணையானவர் வேறெவருமில்லை என்று நான் உறுதிமொழிகிறேன். மேலும். முஹம்மத் (ஸல்) அவர்கள்,அல்லாஹ்வின் அடியாரும் அவனுடைய தூதரும் ஆவார்கள் என்றும் நான் உறுதிமொழிகிறேன்.) அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 20
			}
		}
	]
}