{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5693,
			"arabicnumber": "2182.02",
			"text": "அஸ்மா (ரலி) அவர்கள் கூறியதாவது: நான் (என் கணவர்) ஸுபைர் (ரலி) அவர்களின் வீட்டுப் பணிகளைக் கவனித்துவந்தேன். என் கணவரிடம் குதிரையொன்று இருந்தது. அந்தக் குதிரையைப் பராமரிக்கும் பொறுப்பைப் போன்று வேறெந்தப் பணியும் எனக்குக் கடினமானதாக இருக்கவில்லை. அதற்காக நானே புற்பூண்டுகள் திரட்டுவேன்; அதைப் பராமரிப்பேன்; அதை நானே மேய்ப்பேன். பிறகு எனக்கு (என் தந்தை அபூபக்ர் மூலம், பெண்) ஊழியர் ஒருவர் கிடைத்தார். நபி (ஸல்) அவர்களிடம் போர்க் கைதிகள் சிலர் வந்தபோது, அவர்களில் (பெண்) ஊழியர் ஒருவரை எனக்கு (என் தந்தை வழியாகக்) கொடுத்தார்கள். அந்தப் பெண் (ஊழியர்) குதிரையைப் பராமரிக்கும் பொறுப்பை ஏற்றுக்கொண்டு, அதைப் பராமரிக்கும் பொறுப்பிலிருந்து என்னை விடுவித்தார். (இந்நிலையில்) ஒரு மனிதர் என்னிடம் வந்து, \"அப்துல்லாஹ்வின் அன்னையே! நான் ஓர் ஏழை. நான் தங்கள் வீட்டு நிழலில் வியாபாரம் செய்ய விரும்புகிறேன்\" என்று கூறி (அனுமதி கோரி)னார். நான் \"உங்களுக்கு அனுமதி அளித்தால் (என் கணவர்) ஸுபைர் (ரலி) அவர்கள் அதை மறுப்பார். எனவே, (என் கணவர்) ஸுபைர் (ரலி) அவர்கள் (வீட்டில்) இருக்கும்போது நீங்கள் வந்து (இது போன்று) அனுமதி கேளுங்கள்\" என்று கூறினேன். அவ்வாறே அம்மனிதர் வந்து, \"அப்துல்லாஹ்வின் அன்னையே! நான் ஓர் ஏழை. நான் தங்கள் வீட்டு நிழலில் வியாபாரம் செய்ய விரும்புகிறேன்\" என்று கேட்டார். உடனே நான் (அவருக்கு மறுப்புத் தெரிவிப்பது போல்) மதீனாவில் உமக்கு என் வீட்டைத் தவிர வேறிடம் கிடைக்கவில்லையா?\" என்று கேட்டேன். அப்போது (என் கணவர்) ஸுபைர் (ரலி) அவர்கள் என்னிடம், \"உனக்கு என்ன ஆயிற்று? ஓர் ஏழை வியாபாரி (நமது வீட்டு நிழலில்) வியாபாரம் செய்வதை நீ ஏன் தடுக்கிறாய்?\" என்று கேட்டார். பிறகு அவர் வியாபாரம் செய்து (நல்ல) வருமானத்தைத் தேடிக் கொண்டார். அவருக்கே (எனது) அந்த அடிமைப் பெண்ணை நான் விற்றேன். அந்தக் காசை நான் எனது மடியில் வைத்துக்கொண்டிருந்த போது (என் கணவர்) ஸுபைர் (ரலி) அவர்கள் என்னிடம் வந்து, \"அதை எனக்கு அன்பளிப்பாக வழங்கு\" என்று கேட்டார். நான் \"இதை ஏற்கெனவே தர்மமாக அளி(க்கத் தீர்மானி)த்து விட்டேன்\" என்று கூறினேன். அத்தியாயம் : 39",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 47
			}
		}
	]
}