{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"2": "The Book of Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 584,
			"arabicnumber": "249.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (முஸ்லிம்களின்) பொது மையவாடிக்குச் சென்று அஸ்ஸலாமு அலைக்கும் தார கவ்மின் முஃமினீன். வ இன்னா இன்ஷா அல்லாஹு பி(க்)கும் லாஹிகூன் (அடக்கத் தலங்களிலுள்ள இறை நம்பிக்கையாளர்களே! உங்கள்மீது இறைச்சாந்தி பொழியட்டும். இறைவன் நாடினால் நிச்சயமாக நாங்களும் உங்களை வந்து சேருபவர்கள்தாம்) என்று கூறி விட்டு, நம் சகோதரர்களை (இவ்வுலகிலேயே) பார்க்க நான் ஆசைப்படுகிறேன் என்று சொன்னார்கள். மக்கள், அல்லாஹ்வின் தூதரே! நாங்கள் உங்கள் சகோதரர்கள் இல்லையா? என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நீங்கள் என் தோழர்கள்தாம். (நான் கூறுவது) இதுவரை (பிறந்து) வந்திராத நம் சகோதரர்கள் என்று கூறினார்கள். மக்கள், உங்கள் சமுதாயத்தாரில் இதுவரை (பிறந்து) வராதவர்களை நீங்கள் எவ்வாறு அறிந்து கொள்வீர்கள், அல்லாஹ்வின் தூதரே? என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், ஒரு மனிதரிடம் முகமும் கை கால்களும் வெண்மையாக உள்ள குதிரை ஒன்று இருந்தது. அது கறுப்புக் குதிரைகளுக்கிடையே இருந்தால் தமது குதிரையை அவர் அறிந்துகொள்ளமாட்டாரா, கூறுங்கள் என்று கேட்டார்கள். மக்கள், ஆம் (அறிந்து கொள்வார்), அல்லாஹ்வின் தூதரே! என்று பதிலளித்தனர். (அவ்வாறே) அவர்கள் அங்கத் தூய்மையினால் (பிரதான) உறுப்புகள் பிரகாசிக்கும் நிலையில் (மறுமையில்) வருவார்கள். நான் அவர்களுக்கு முன்பே (அல்கவ்ஸர் எனும் எனது) தடாகத்திற்குச் சென்று அவர்களுக்கு நீர் புகட்டக் காத்திருப்பேன். அறிந்துகொள்ளுங்கள்! வழி தவறி(விளைச்சல் நிலத்திற்குள் நுழைந்து)விட்ட ஒட்டகம் துரத்தப்படுவதைப் போன்று, சிலர் எனது தடாகத்திலிருந்து துரத்தப்படுவார்கள். அவர்களை நான் வாருங்கள் என்று சப்தமிட்டு அழைப்பேன். அப்போது, இவர்கள் உங்களுக்குப் பின்னால் (உங்களது மார்க்கத்தை) மாற்றிவிட்டார்கள் என்று சொல்லப்படும். அப்போது நான் (இவர்களை) இறைவன் தன் கருணையிலிருந்து அப்புறப்படுத்துவானாக;அப்புறப்படுத்துவானாக! என்று கூறுவேன்.- இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஒரு நாள்) பொது மையவாடிக்குப் புறப்பட்டார்கள். (அங்கு போய்) அஸ்ஸலாமு அலைக்கும் தார கவ்மின் முஃமினீன்; வ இன்னா இன்ஷா அல்லாஹு பி(க்)கும் லாஹிகூன் என்று கூறினார்கள் என ஹதீஸ் தொடங்குகிறது. (அறிந்துகொள்ளுங்கள் என்பதற்கு பதிலாக) உறுதியாக என்று காணப்படுகிறது. அத்தியாயம் : 2",
			"grades": [],
			"reference": {
				"book": 2,
				"hadith": 51
			}
		}
	]
}