{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"42": "The Book of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5928,
			"arabicnumber": "2269.01",
			"text": "இப்னு அப்பாஸ் (ரலி) அவர்கள் கூறியதாவது: ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! நான் நேற்றிரவு கனவில் மேகம் ஒன்றைக் கண்டேன். அந்த மேகத்திலிருந்து நெய்யும் தேனும் சொட்டிக்கொண்டிருந்தன. உடனே மக்கள் தம் கைகளைக் காட்டி அவற்றைப் பிடித்துக்கொண்டிருக்கக் கண்டேன். (அவர்களில்) அதிகம் பிடித்தவர்களும் உண்டு; குறைவாகப் பிடித்தவர்களும் உண்டு. அப்போது ஒரு கயிறு வானத்திலிருந்து பூமிவரை வந்து சேர்ந்ததையும் நான் கண்டேன். உடனே (அல்லாஹ்வின் தூதரே!) நீங்கள் அந்தக் கயிற்றைப் பற்றிக்கொண்டு மேலே சென்றுவிடக் கண்டேன். பிறகு உங்களுக்குப்பின் மற்றொரு மனிதர் அதைப் பற்றிக்கொண்டு அவரும் மேலே சென்று விட்டார். பிறகு (மூன்றாவதாக) இன்னொரு மனிதரும் அதைப் பற்றிக்கொண்டு அவரும் மேலே சென்றுவிட்டார். பிறகு (நான்காவதாக) இன்னொரு மனிதர் அதைப் பற்றிக்கொள்ள கயிறு அறுந்துவிட்டது. பிறகு மறுபடியும் அக்கயிறு அவருக்காக இணைக்கப்பட்டபோது, அந்த மனிதர் (அதைப் பற்றிக்கொண்டு) மேலே சென்றுவிட்டார்\" என்று சொன்னார். அப்போது (அங்கிருந்த) அபூபக்ர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும்! அல்லாஹ்வின் மீதாணையாக! என்னை விடுங்கள்; இந்தக் கனவுக்கு நான் விளக்கமளிக்கிறேன்\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(சரி) இதற்கு விளக்கம் சொல்லுங்கள்\" என்று சொன்னார்கள். அபூபக்ர் (ரலி) அவர்கள், \"அந்த மேகம் \"இஸ்லாம்\" எனும் மேகமாகும். அதிலிருந்து சொட்டிக் கொண்டிருந்த நெய்யும் தேனும் குர்ஆனின் இனிமையும் மென்மையும் ஆகும். மக்கள் (தங்கள் கைகளைக் காட்டி) அதிலிருந்து பிடித்ததானது, குர்ஆனிலிருந்து அதிகம் கற்றவர்களையும் குறைவாகக் கற்றவர்களையும் குறிக்கிறது. வானிலிருந்து பூமிவரை வந்துசேர்ந்த அந்தக் கயிறானது, நீங்கள் இருந்துவருகின்ற சத்திய (மார்க்க)மாகும். அதை நீங்கள் (பின்)பற்றுகிறீர்கள். அல்லாஹ் உங்களை (வானளவுக்கு) உயர்த்திவிடுகிறான். பிறகு உங்களுக்குப் பின்னால் இன்னொரு மனிதர் அதைப் பற்றுகிறார். அதன்மூலம் அவரும் உயர்ந்துவிடுகிறார். அதன் பின்னர் இன்னொரு மனிதர் அதைப் பற்றிக்கொண்டு அவரும் உயர்ந்துவிடுகிறார். அதை (நான்காவதாக) மற்றொருவர் பற்றுகிறார். (முதலில்) அக்கயிறு அறுந்துவிடுகிறது. பிறகு அவருக்காக மீண்டும் அக்கயிறு இணைக்கப்பட்டவுடன் அதைப் பற்றிக்கொண்டு அவரும் உயர்ந்துவிடுகிறார்\"என்று கூறிவிட்டு, \"அல்லாஹ்வின் தூதரே! என் தந்தை தங்களுக்கு அர்ப்பணமாகட்டும்! சொல்லுங்கள்! (நான் சொன்ன விளக்கம்) சரியா? அல்லது தவறா?\" என்று கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"சிலவற்றைச் சரியாகச் சொன்னீர்கள்; சிலவற்றைத் தவறாகச் சொல்லிவிட்டீர்கள்\" என்றார்கள். அபூபக்ர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! அல்லாஹ்வின் மீதாணையாக! நான் தவறாகக் கூறியதைத் தாங்கள் எனக்குத் தெரிவிக்க வேண்டும்\" என்றார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(இதை) சத்தியம் செய்து கேட்காதீர்கள் (நான் இதைப் பற்றிச் சொல்லப் போவதில்லை)\" என்றார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. (மேற்கண்ட அறிவிப்பு அல்லாத) மற்ற அறிவிப்புகளில் இப்னு அப்பாஸ் (ரலி) அவர்கள், அல்லது அபூஹுரைரா (ரலி) அவர்கள் அறிவிப்பதாகத் துவங்குகிறது. - மேற்கண்ட ஹதீஸ் இப்னு அப்பாஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், நபி (ஸல்) அவர்கள் உஹுதுப் போரை முடித்துக்கொண்டு திரும்பியபோது அவர்களிடம் ஒரு மனிதர் வந்து, \"அல்லாஹ்வின் தூதரே! நான் நேற்றிரவு கனவில் மேகம் ஒன்றைக் கண்டேன். அதிலிருந்து நெய்யும் தேனும் சொட்டிக்கொண்டிருந்தது...\" என்று கூறியதாக ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மேற்கண்ட ஹதீஸ் இப்னு அப்பாஸ் (ரலி), அல்லது அபூஹுரைரா (ரலி) அவர்களிடமிருந்து மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில் அறிவிப்பாளர் அப்துர் ரஸ்ஸாக் (ரஹ்) அவர்கள் பின்வரும் குறிப்பையும் தெரிவித்துள்ளார்கள்: மஅமர் (ரஹ்) அவர்கள் சில வேளைகளில் இப்னு அப்பாஸ் (ரலி) அவர்களிடமிருந்தும் வேறுசில வேளைகளில் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தும் அறிவிக்கிறார்கள். அதில் \"ஒரு மனிதர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, நான் நேற்றிரவு (கனவில்) மேகம் ஒன்றைக் கண்டேன்...\" என்று கூறியதாக ஹதீஸ் ஆரம்பமாகிறது. - மேற்கண்ட ஹதீஸ் இப்னு அப்பாஸ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தம் தோழர்களிடம் \"உங்களில் எவரேனும் கனவு கண்டிருந்தால் அதை என்னிடம் கூறுங்கள்; அதற்கு நான் விளக்கம் சொல்கிறேன்\" என்று கேட்பது வழக்கம். அப்போது ஒரு மனிதர் வந்து, \"அல்லாஹ்வின் தூதரே! நான் மேகமொன்றைக் கண்டேன்...\" என்று கூறியதாக ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸ்களில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 42",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 32
			}
		}
	]
}