{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"43": "The Book of Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5948,
			"arabicnumber": "1392.02",
			"text": "அபூஹுமைத் அஸ்ஸாஇதீ (ரலி) அவர்கள் கூறியதாவது: நாங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தபூக் போருக்குப் புறப்பட்டுச் சென்றோம். அப்பயணத்தில் நாங்கள் \"வாதில் குரா\" எனுமிடத்திலிருந்த ஒரு பெண்மணிக்குச் சொந்தமான ஒரு (பேரீச்சந்)தோட்டத்தை அடைந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"மரத்திலுள்ள கனிகளை மதிப்பிடுங்கள்\" என்று கூறினார்கள். அவ்வாறே நாங்கள் மதிப்பிட்டோம். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அதில் பத்து \"வஸ்க்\" கனிகள் இருப்பதாக மதிப்பிட்டார்கள். மேலும் அப்பெண்ணிடம், \"இன்ஷாஅல்லாஹ், நாங்கள் திரும்பி வருவதற்குள் இக்கனிகளை நீ எண்ணிவை\" என்று சொன்னார்கள். பிறகு நாங்கள் நடந்து தபூக்கிற்குச் சென்றோம். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இன்றிரவு உங்கள்மீது கடுமையான காற்று வீசும். அப்போது உங்களில் எவரும் எழுந்திருக்க வேண்டாம். உங்களில் ஒட்டகம் வைத்திருப்பவர் அதைக் கயிற்றால் கட்டிவைக்கட்டும்\" என்று கூறினார்கள். அவ்வாறே அன்றிரவு கடுங்காற்று வீசியது. அப்போது எங்களில் ஒருவர் எழுந்தார். அக்காற்று அவரைத் தூக்கிச் சென்று, \"தய்யி\" குலத்தாரின் (\"அஜா\" மற்றும் \"சல்மா\" ஆகிய) இரு மலைகளுக்கிடையே போட்டுவிட்டது. பின்னர் \"அய்லா\" நாட்டின் அரசர் இப்னுல் அல்மாவின் தூதுவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் ஒரு கடிதத்துடன் வந்தார். மேலும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு (அய்லா அரசர் சார்பாக) வெள்ளைக் கோவேறு கழுதையொன்றையும் அன்பளிப்பாக வழங்கினார். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அய்லா அரசருக்கு) பதில் கடிதம் எழுதினார்கள்; மேலும், போர்வையொன்றை அவருக்கு அன்பளிப்பாகக் கொடுத்த(னுப் பினா)ர்கள். பிறகு நாங்கள் திரும்பி \"வாதில் குரா\" சென்றடைந்தோம். அங்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அந்தப் பெண்ணிடம் அவளது தோட்டத்திலிருந்த பேரீச்சங்கனிகளைப் பற்றிக் கேட்டார்கள். \"அதில் எவ்வளவு கனிகள் உள்ளன?\" என்று கேட்டார்கள். அதற்கு அப்பெண் \"பத்து வஸ்க்குகள்\" என்று பதிலளித்தாள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், நான் விரைவாக (மதீனாவுக்குச்) செல்லப் போகிறேன். உங்களில் விரும்பியவர் என்னுடன் விரைவாக வரலாம்; விரும்பியவர் இங்கு தங்கியிருக்கலாம்\" என்று சொன்னார்கள். பிறகு நாங்கள் புறப்பட்டு மதீனா அருகில் வந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இது தாபா (தூய நகரம்);இதோ உஹுத் மலை; அது நம்மை நேசிக்கிறது; நாமும் அதை நேசிக்கிறோம்\" என்று கூறினார்கள். பிறகு \"அன்சாரிகளின் கிளைக் குடும்பங்களில் சிறந்தது \"பனுந் நஜ்ஜார்\" குடும்பமாகும். பிறகு \"பனூ அப்தில் அஷ்ஹல்\" குடும்பமாகும். பிறகு \"பனூ அப்தில் ஹாரிஸ் பின் அல்கஸ்ரஜ்\" குடும்பமாகும். பிறகு \"பனூ சாஇதா\"குடும்பமாகும். அன்சாரி கிளைக்குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை உண்டு\" என்று சொன்னார்கள். பிறகு (பனூ சாஇதா குடும்பத்தைச் சேர்ந்த) சஅத் பின் உபாதா (ரலி) அவர்கள் எங்களிடம் வந்தார்கள். அப்போது அபூஉசைத் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அன்சாரி கிளைக் குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை இருப்பதாகச் சொல்லிவிட்டு, (பனூ சாஇதா குடும்பத்தாரான) நம்மை இறுதியாகவே குறிப்பிட்டுள்ளதை நீங்கள் பார்க்க வில்லையா?\" என்று கேட்டார்கள். உடனே சஅத் (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, \"அல்லாஹ்வின் தூதரே! அன்சாரி கிளைக்குடும்பங்கள் ஒவ்வொன்றிலும் நன்மை இருப்பதாகத் தாங்கள் குறிப்பிட்டுவிட்டு, இறுதியில் எங்களைக் குறிப்பிட்டுள்ளீர்களே?\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீங்கள் மிகச் சிறந்(த குடும் பத்)தவர்களில் இடம்பெற்றிருப்பதே உங்களுக்குப் போதுமானதல்லவா?\" என்று கேட்டார்கள். அத்தியாயம் : 43",
			"grades": [],
			"reference": {
				"book": 43,
				"hadith": 11
			}
		}
	]
}