{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6183,
			"arabicnumber": "2388.01",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: \"(இஸ்ரவேலர்களில்) ஒரு மனிதர் தமது மாட்டின் மீது சுமைகளை ஏற்றிவிட்டு, அதை ஓட்டிக்கொண்டு சென்றார். அப்போது அது அவரைத் திரும்பிப் பார்த்துப் பேசியது. \"நான் இதற்காக (சுமை சுமப்பதற்காக)ப் படைக்கப்படவில்லை;மாறாக, நான் (நிலத்தை) உழுவதற்காகத்தான் படைக்கப்பட்டுள்ளேன்\" என்று கூறிற்று என அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். உடனே மக்கள், \"அல்லாஹ் தூயவன்\" என்று வியப்புடனும் அதிர்ச்சியுடனும் கூறிவிட்டு, \"மாடு பேசுமா?\" என்று கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நானும் அபூபக்ரும் உமரும் இதை நம்புகிறோம்\" என்று சொன்னார்கள். மேலும், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(இஸ்ரவேலர்களில்) ஓர் ஆட்டு இடையர் தம் ஆடுகளை மேய்த்துக்கொண்டிருந்தார். அப்போது ஓநாய் ஒன்று அவற்றின் மீது பாய்ந்து ஓர் ஆட்டைக் கவ்விச் சென்றது. உடனே அந்த இடையர் அதைத் துரத்திச் சென்று ஓநாயிடமிருந்து அந்த ஆட்டை விடுவித்தார். அப்போது அந்த ஓநாய் அவரைத் திரும்பிப் பார்த்து, \"கொடிய விலங்குகள் ஆதிக்கம் செலுத்தும் (யுக முடிவு) நாளில் இந்த ஆட்டுக்கு (பொறுப்பாளர்) யார்? அன்று என்னைத் தவிர வேறெந்தப் பொறுப்பாளனும் இருக்க மாட்டானே!\" எனக் கூறிற்று என்று சொன்னார்கள். உடனே மக்கள் \"அல்லாஹ் தூயவன்\" என்று (வியந்து) கூறினர். அப்போதும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நானும் அபூபக்ரும் உமரும் இதை நம்புகிறோம்\" என்று சொன்னார்கள். இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்து மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் ஆடு மற்றும் ஓநாய் பற்றிய நிகழ்ச்சி இடம்பெற்றுள்ளது. மாட்டைப் பற்றிய நிகழ்ச்சி காணப்படவில்லை. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் மாடு, ஆடு ஆகியவை பற்றிய குறிப்பு இடம்பெற்றுள்ளது. மேலும், \"நானும் அபூபக்ரும் உமரும் இதை நம்புகிறோம் என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். அப்போது அவர்கள் இருவரும் அந்த இடத்தில் இருக்கவில்லை\" என்று (சற்று கூடுதலான தகவலு)ம் காணப்படுகிறது. - மேற்கண்ட ஹதீஸ் அபூஹுரைரா (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 14
			}
		}
	]
}