{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6207,
			"arabicnumber": "2400.01",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: (நயவஞ்சகர்களின் தலைவர்) அப்துல்லாஹ் பின் உபை இறந்தபோது, அவருடைய புதல்வர் அப்துல்லாஹ் பின் அப்தில்லாஹ் பின் உபை (ரலி) அவர்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, தம் தந்தைக்குப் பிரேத ஆடை (கஃபன்) அணிவிப்பதற்காக அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் சட்டையைத் தருமாறு கோரினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது சட்டையை அவரிடம் கொடுத்தார்கள். பிறகு அப்துல்லாஹ் (ரலி) அவர்கள் தம் தந்தைக்கு இறுதித் தொழுகையை முன்னின்று நடத்தும்படி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வேண்டினார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவருக்கு (ஜனாஸாத் தொழுகை)த் தொழுவிக்க எழுந்தார்கள். உடனே உமர் (ரலி) அவர்கள் எழுந்து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் ஆடையைப் பிடித்துக்கொண்டு, \"அல்லாஹ்வின் தூதரே! (நயவஞ்சகரான) இவருக்குத் தொழுகை நடத்த வேண்டாமென அல்லாஹ் உங்களுக்குத் தடை விதித்திருக்க, இவருக்கா தொழுவிக்கப் போகிறீர்கள்!\" என்று கேட்டார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(பாவமன்னிப்புக் கோரவும் கோராமலிருக்கவும்) எனக்கு அல்லாஹ் உரிமையளித்துள்ளான்\" என்று கூறிவிட்டு, \"(நபியே!) அவர்களுக்காக நீர் பாவமன்னிப்புக் கோரும்! அல்லது அவர்களுக்காகப் பாவமன்னிப்புக் கோராமல் இரும்! அவர்களுக்காக நீர் எழுபது தடவை பாவமன்னிப்புக் கோரினாலும் அவர்களை அல்லாஹ் ஒருபோதும் மன்னிக்க மாட்டான்\" (9:80) என்று கூறுகின்றான். நான் எழுபது தடவையைவிட அதிகமாக (இவருக்காகப்) பாவமன்னிப்புக் கோருவேன்\" என்று சொன்னார்கள். உமர் (ரலி) அவர்கள், \"இவர் நயவஞ்சகராயிற்றே!\" என்று சொன்னார்கள். இருந்தும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அவருக்கு (ஜனாஸாத்) தொழுகையை முன்னின்று நடத்தினார்கள். அப்போது வல்லமையும் மாண்பும் மிக்க அல்லாஹ் \"அவர்களில் இறந்துவிட்ட எவருக்காகவும் ஒருபோதும் நீர் தொழுகை நடத்தாதீர்! அவரது சமாதி அருகிலும் நிற்காதீர்\" (9:84) எனும் வசனத்தை அருளினான். - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் \"ஆகவே, அவர்களுக்காக ஜனாஸாத் தொழுவிப்பதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் விட்டுவிட்டார்கள்\" என்று கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 37
			}
		}
	]
}