{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6212,
			"arabicnumber": "2403.01",
			"text": "அபூமூசா அல்அஷ்அரீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மதீனாவின் தோட்டங்களில் ஒன்றில், தம்மிடமிருந்த குச்சியைத் தண்ணீரிலும் களிமண்ணிலும் ஊன்றியபடி சாய்ந்து அமர்ந்திருந்தார்கள். அப்போது ஒரு மனிதர் (வந்து தோட்டத்தின் வாயிற்கதவைத்) திறக்கும்படி கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவருக்காகக் கதவைத் திறப்பீராக;அவருக்குச் சொர்க்கம் கிடைக்கவிருக்கிறது என்று நற்செய்தி சொல்வீராக\" என்று சொன்னார்கள். (நான் வாயிற்கதவைத் திறந்தேன்.) அங்கு அபூபக்ர் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்கு வாயிற்கதவைத் திறந்துவிட்டு,அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக நற்செய்தி சொன்னேன். பிறகு மற்றொரு மனிதர் (வந்து வாயிற்கதவைத்) திறக்கும்படி கேட்டார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(அவருக்குக்) கதவைத் திறப்பீராக; அவருக்குச் சொர்க்கம் கிடைக்கவிருக்கிறது என்று நற்செய்தி கூறுவீராக\" என்று சொன்னார்கள். நான் சென்று பார்த்தபோது, அங்கு உமர் (ரலி) அவர்கள் இருந்தார்கள். அவர்களுக்குக் கதவைத் திறந்துவிட்டு, அவர்களுக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக நற்செய்தி சொன்னேன். பிறகு இன்னொரு மனிதர் (வந்து கதவைத்) திறக்கும்படி கேட்டார். அப்போது (சாய்ந்து கொண்டிருந்த) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (எழுந்து நேராக) அமர்ந்து, \"அவருக்கு வாயிற்கதவைத் திறப்பீராக; (அவருக்கு) நேரவிருக்கும் துன்பத்தையடுத்து அவருக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக நற்செய்தி கூறுவீராக\" என்று சொன்னார்கள். நான் சென்று (பார்த்தபோது) அங்கு உஸ்மான் பின் அஃப்பான் (ரலி) அவர்கள் இருந்தார்கள். நான் கதவைத் திறந்துவிட்டு, அவருக்குச் சொர்க்கம் கிடைக்கவிருப்பதாக நற்செய்தி சொன்னேன். மேலும்,அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (அவருக்குத் துன்பம் நேர விருப்பதாகவும் அதையடுத்து அவருக்குச் சொர்க்கம் கிடைக்கவிருப்பதாகவும்) கூறியதையும் சொன்னேன். அப்போது உஸ்மான் (ரலி) அவர்கள், \"இறைவா! எனக்குப் பொறுமையை வழங்குவாயாக!\" அல்லது \"(எனக்கு நேரவிருக்கும் அத்துன்பத்தின்போது) அல்லாஹ்வே உதவி புரிபவன் ஆவான்\" என்று கூறினார்கள். - மேற்கண்ட ஹதீஸ் அபூமூசா அல்அஷ்அரீ (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு தோட்டத்திற்குள் நுழைந்துவிட்டு, அதன் வாசலில் காவலுக்கு நிற்கும்படி என்னைப் பணித்தார்கள்\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 42
			}
		}
	]
}