{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6370,
			"arabicnumber": "2479.01",
			"text": "அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உயிரோடிருந்த காலத்தில் ஒரு மனிதர் கனவொன்றைக் கண்டால்,அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் அதை விவரித்துச் சொல்வார். அவ்வாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் விவரித்துச் சொல்வதற்காகக் கனவொன்றை நானும் காண வேண்டும் என்று ஆசைப்பட்டேன். (அப்போது) நான் மணமாகாத ஓர் இளைஞனாக இருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் பள்ளிவாசலில் நான் உறங்குவது வழக்கம். (ஒரு நாள்) கனவில் இவ்வாறு கண்டேன்: வானவர்கள் இருவர் என்னைப் பிடித்து நரகத்தை நோக்கிக் கொண்டுசென்றார்கள். கிணற்றின் சுற்றுச் சுவரைப் போன்று அதற்குச் சுற்றுச்சுவர் எழுப்பப்பட்டிருந்தது. மேலும் கிணற்றின் இரு பக்கங்களிலுமுள்ள கல் தூண்களைப் போன்று இரு தூண்கள் அதற்கும் இருந்தன. அதனுள் எனக்குத் தெரிந்த மக்கள் சிலர் இருந்தனர். உடனே நான், \"நரகத்திலிருந்து காக்கும்படி அல்லாஹ்விடம் கோருகின்றேன்; நரகத்திலிருந்து காக்கும்படி அல்லாஹ்விடம் கோருகின்றேன்; நரகத்திலிருந்து காக்கும்படி அல்லாஹ்விடம் வேண்டுகின்றேன்\" என்று பிரார்த்திக்கலானேன். (அப்போது என்னைப் பிடித்துச் சென்ற) அவ்விரு வானவரையும் வேறொரு வானவர் சந்தித்தார். அவர் என்னிடம், \"இனி ஒருபோதும் நீங்கள் பீதியடையமாட்டீர்கள்\" என்று சொன்னார். நான் இதை (என் சகோதரியும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் துணைவியாருமான) ஹஃப்ஸா (ரலி) அவர்களிடம் விவரித்தேன். ஹஃப்ஸா (ரலி) அவர்கள், அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் விவரித்தார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அப்துல்லாஹ் (பின் உமர்) ஒரு நல்ல மனிதர்;அவர் இரவின் ஒரு பகுதியில் தொழுதால் (நன்றாயிருக்கும்)\" என்று சொன்னார்கள். (இதை அறிவித்த அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களின் புதல்வர்) சாலிம் (ரஹ்) அவர்கள், \"(அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இப்படிச் சொன்னதிலிருந்து) அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் இரவில் சிறிது நேரம் மட்டுமே உறங்குபவராயிருந்தார்கள்\" என்று கூறுகிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், \"நான் குடும்பம் (மனைவி, மக்கள்) இல்லாதவனாயிருந்தபோது இரவில் பள்ளிவாசலில் உறங்கிவந்தேன். (ஒரு நாள்) கனவில் ஒரு கிணற்றை நோக்கி நான் இழுத்துச் செல்லப்படுவதைப் போன்று கண்டேன்\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 200
			}
		}
	]
}