{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6381,
			"arabicnumber": "2484.01",
			"text": "கைஸ் பின் உபாத் (ரஹ்) அவர்கள் கூறியதாவது: நான் மதீனாவில் (மஸ்ஜிதுந் நபவீ பள்ளி வாசலில்) மக்களில் சிலருடன் இருந்தேன். அவர்களில் நபித்தோழர்கள் சிலரும் இருந்தனர். அப்போது ஒரு மனிதர் வந்தார். அவரது முகத்தில் சிரம்பணிந்(து சஜ்தா செய்)ததற்கான அடையாளம் இருந்தது. மக்களில் சிலர், \"இவர் சொர்க்கவாசிகளில் ஒருவர்; இவர் சொர்க்கவாசிகளில் ஒருவர்\" என்று சொன்னார்கள். அவர் இரண்டு ரக்அத்கள் தொழுதார்; அவற்றை (அதிக நேரம் எடுக்காமல்) சுருக்கமாகத் தொழுதார். பிறகு அவர் வெளியேற, நான் அவரைப் பின்தொடர்ந்து சென்றேன். அவர் தமது இல்லத்திற்குள் நுழைந்தபோது நானும் நுழைந்தேன். நாங்கள் பேசிக்கொண்டிருந்தோம். அவர் சகஜ நிலைக்கு வந்தபோது, \"நீங்கள் சற்று முன்னர் (பள்ளிவாசலுக்குள்) நுழைந்த சமயம், ஒரு மனிதர் இப்படி (நீங்கள் சொர்க்கவாசி என்று) சொன்னார்\" என அவரிடம் சொன்னேன். அவர் கூறினார்: அல்லாஹ் தூயவன் (சுப்ஹானல்லாஹ்)! தமக்குத் தெரியாததைக் கூறுவது எவருக்கும் முறையாகாது. ஏன் அவ்வாறு (மக்கள் பேசிக் கொள்கிறார்கள்) என்று உங்களுக்கு இதோ தெரிவிக்கிறேன்: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது காலத்தில் கனவொன்று கண்டேன். அதை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் விவரித்தேன். நான் ஒரு பூங்காவில் இருப்பதைப் போன்று கண்டேன். (அதன் விசாலத்தையும் புற்பூண்டுகளையும் பசுமையையும் வர்ணித்தார்) பூங்காவின் நடுவே இரும்பாலான தூண் ஒன்று இருந்தது. அதன் அடிப்பகுதி தரையிலும் மேற்பகுதி வானத்திலும் இருந்தது. அதற்கும் மேலே \"கைப்பிடி\" ஒன்று இருந்தது. என்னிடம் \"இதில் ஏறு\" என்று சொல்லப்பட்டது. நான் \"என்னால் இயலாதே!\" என்று சொன்னேன். அப்போது என்னிடம் \"மின்ஸஃப்\" ஒருவர் வந்தார் (\"மின்ஸஃப்\" என்பதற்கு ஊழியர் என்பது பொருள் என அறிவிப்பாளர் இப்னு அவ்ன் சொல்கிறார்). அவர் என் ஆடையைப் பிடித்து பின்பக்கமாக என்னை இவ்வாறு தூக்கிவிட்டார். அதைச் சைகையால் செய்து காட்டுகிறார். உடனே நான் அந்தத் தூணில் ஏறினேன். இறுதியில் அதன் உச்சிக்கு நான் சென்று அந்தப் பிடியைப் பற்றினேன். அப்போது என்னிடம் \"நன்கு பற்றிப் பிடித்துக்கொள்\" என்று சொல்லப்பட்டது. (நான் அதைப் பற்றிக்கொண்டேன்.) அந்தப் பிடி என் கையில் இருக்க, (திடுக்கிட்டு) நான் விழித்தேன். நபி (ஸல்) அவர்களிடம் அதை நான் விவரித்தபோது, \"அந்தப் பூங்காதான் இஸ்லாம். அந்தத் தூண் இஸ்லாம் எனும் தூணாகும். அந்தப் பிடி பலமான (இறைநம்பிக்கை எனும்) பிடியாகும். ஆகவே, நீங்கள் இறக்கும்வரை இஸ்லாத்திலேயே நிலைத்து நிற்பீர்கள்\" என்று நபியவர்கள் பதிலளித்தார்கள். (இப்படிச் சொன்ன) அந்த மனிதர் அப்துல்லாஹ் பின் சலாம் (ரலி) அவர்கள்தான். அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 211
			}
		}
	]
}