{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6401,
			"arabicnumber": "2494.01",
			"text": "அலீ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னையும் ஸுபைர் பின் அல்அவ்வாம் (ரலி), மிக்தாத் பின் அல்அஸ்வத் (ரலி) ஆகியோரையும், நீங்கள் \"ரவ்ளத்து காக்\" எனும் இடத்திற்குச் செல்லுங்கள். ஏனெனில், அங்கு ஒட்டகப் பல்லக்கில் ஒரு பெண் இருக்கிறாள். அவளிடம் ஒரு கடிதம் இருக்கும். அதை அவளிடமிருந்து எடுத்துக்கொள்ளுங்கள்\" என்று கூறியனுப்பினார்கள். அவ்வாறே நாங்கள் சென்றோம். எங்களைச் சுமந்துகொண்டு எங்கள் குதிரைகள் விரைந்து சென்றன. (அந்த இடத்தை அடைந்தோம்.) அங்கு அந்தப் பெண் இருந்தாள். நாங்கள் அவளிடம், \"அந்தக் கடிதத்தை வெளியே எடு\" என்று சொன்னோம். அவள் \"என்னிடம் கடிதம் எதுவுமில்லை\" என்று சொன்னாள். நாங்கள், \"நீயாகக் கடிதத்தை எடுத்து(க் கொடுத்து)விடு; இல்லாவிட்டால் (சோதனைக்காக) உன் ஆடையை நீ அவிழ்க்க வேண்டியதிருக்கும்\" என்று கூறினோம். உடனே அவள் (இடுப்புவரை நீண்டிருந்த) தனது சடையின் பின்னல்களுக்கிடையிலிருந்து கடிதத்தை வெளியே எடுத்தாள். நாங்கள் அந்தக் கடிதத்தை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் கொண்டுவந்தோம். அதில், ஹாத்திப் பின் அபீபல்த்தஆ (ரலி) அவர்கள், மக்காவாசிகளான இணை வைப்பாளர்களில் சிலருக்கு,அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் (போர்) விவகாரம் குறித்து சிலவற்றை (முன் கூட்டியே) தெரிவித்திருந்தார். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"ஹாத்திபே! என்ன இது?\" என்று கேட்டார்கள். ஹாத்திப் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! என் விஷயத்தில் அவசரப்பட்டு (நடவடிக்கை எடுத்து)விடாதீர்கள். நான் குறைஷியரைச் சார்ந்து வாழ்பவனாகவே இருந்து வந்தேன். (அதாவது குறைஷியரின் நட்புக் குலத்தாராகவே இருந்துவந்தார்; குறைஷிக் குலத்தில் ஒருவராக இருக்கவில்லை என சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் கூறுகிறார்கள்.) தங்களுடன் இருந்துவந்த முஹாஜிர்களுக்கு அவர்களுடைய குடும்பத்தாரைப் பாதுகாப்பதற்கு மக்கா நகரில் உறவினர் பலர் இருந்தனர். எனக்கு அவர்களிடையே அத்தகைய உறவினர் எவரும் இல்லாததால் (இணை வைப்பாளர்களான) மக்காவாசிகளுக்கு நான் உபகாரம் எதையாவது செய்து, அதற்குப் பிரதியுபகாரமாக அவர்கள் (அங்குள்ள) என் (பலவீனமான) உறவினரைக் காப்பாற்றட்டும் என்று விரும்பினேன். (அதனால்தான் இணைவைப்பாளர்கள் கேட்டுக்கொண்டதற்கிணங்க இத்தகவல்களைத் தெரிவித்தேன்.) நான் என் மார்க்கமான இஸ்லாத்தைவிட்டு வேறு மதத்தை ஏற்பதற்காகவோ,இறைமறுப்பாலோ, இஸ்லாத்தைத் தழுவியபின் இறைமறுப்பை விரும்பியோ இப்படிச் செய்யவில்லை\" என்று கூறினார்கள். இதைக் கேட்ட அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவர் சொல்வது உண்மையே\" என்றார்கள். அப்போது உமர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதரே! என்னை விடுங்கள். இந்த நயவஞ்சகனின் கழுத்தை வெட்டிவிடுகிறேன்\" என்று கூறினார்கள். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"இவர் பத்ருப்போரில் கலந்துகொண்டிருக்கிறார். உமக்கென்ன தெரியும்? பத்ருப்போரில் கலந்துகொண்டவர்களை நோக்கி, \"நீங்கள் விரும்பியதைச் செய்யுங்கள். உங்களை மன்னித்துவிட்டேன்\" என்று அல்லாஹ் கூறிவிட்டிருக்கலாம்\" என்று சொன்னார்கள். அப்போது அல்லாஹ், \"இறைநம்பிக்கை கொண்டவர்களே! எனக்கும் உங்களுக்கும் பகைவர்களாக இருப்போரைப் பாதுகாவலர்களாக ஆக்கிக்கொள்ளாதீர்கள்\" (60:1) எனும் வசனத்தை அருளினான். இந்த ஹதீஸ் ஐந்து அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் அபூபக்ர் பின் அபீஷைபா (ரஹ்), ஸுஹைர் பின் ஹர்ப் (ரஹ்) ஆகியோரது அறிவிப்பில் இந்த வசனம் அருளப்பெற்றது பற்றிய குறிப்பு இல்லை. இஸ்ஹாக் பின் இப்ராஹீம் (ரஹ்) அவர்களது அறிவிப்பில், அறிவிப்பாளர் சுஃப்யான் பின் உயைனா (ரஹ்) அவர்கள் அந்த வசனத்தை ஓதிக்காட்டியதாக இடம்பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் அலீ (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் குதிரைவீரர்களான என்னையும் அபூமர்ஸத் அல்ஃகனவீ (ரலி) அவர்களையும் ஸுபைர் பின் அல்அவ்வாம் (ரலி) அவர்களையும் \"நீங்கள் \"ரவ்ளத்து காக்\" எனும் இடம் வரை செல்லுங்கள். அங்கு இணைவைப்பாளர்களில் ஒரு பெண் இருப்பாள். அவளிடம் ஹாத்திப் பின் அபீபல்த்தஆ (மக்கா) இணை வைப்பாளர்களுக்கு எழுதிய கடிதம் ஒன்று இருக்கும்\" என்று கூறியனுப்பினார்கள் என்று இடம்பெற்றுள்ளது. மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 232
			}
		}
	]
}