{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6406,
			"arabicnumber": "2498",
			"text": "அபூமூசா (ரலி) அவர்கள் கூறியதாவது: நபி (ஸல்) அவர்கள் ஹுனைன் போர் முடிந்த பின்னர் அபூஆமிர் (ரலி) அவர்களின் தலைமையில் \"அவ்தாஸ்\" பள்ளத்தாக்கிற்கு ஒரு படைப் பிரிவை அனுப்பினார்கள். அப்போது அபூஆமிர் (ரலி) அவர்கள் (கவிஞன்) \"துரைத் பின் அஸ்ஸிம்மா\"வைச் சந்தித்தார்கள். (அவர்கள் இருவருக்குமிடையே நடந்த சண்டையில்) \"துரைத்\" கொல்லப்பட்டான்; அவனுடைய தோழர்களை அல்லாஹ் தோற்கடித்தான். அபூஆமிர் அவர்களுடன் என்னையும் நபி (ஸல்) அவர்கள் (அந்தப் போருக்கு) அனுப்பியிருந்தார்கள். அப்போரின்போது அபூஆமிர் அவர்களின் முழங்கால்மீது அம்பு (வந்து) பாய்ந்தது. \"பனூ ஜுஷம்\" குலத்தைச் சேர்ந்த ஒரு மனிதனே அந்த அம்பை எய்து, அதை அவர்களது முழங்காலில் நிறுத்தினான். உடனே நான் அபூஆமிர் அவர்களுக்கு அருகில் சென்று, \"என் தந்தையின் சகோதரரே! உங்கள்மீது அம்பெய்தவன் யார்?\" என்று கேட்டேன். \"இதோ அங்கே தெரிகிறானே அவன்தான் என்மீது அம்பெய்து என்னைக் கொன்றவன்\"என்று எனக்குச் சைகை செய்து காட்டினார்கள். நான் அவனைக் குறி வைத்து நேராக அவனை நோக்கிச் சென்று அவனை அடைந்தேன். என்னைக் கண்டதும் அவன் புறமுதுகிட்டு ஓடலானான். \"புறமுதுகிட்டு ஓடுகிறாயே உனக்கு வெட்கமில்லையா? நீ ஓர் அரபியன் இல்லையா? நீ நிற்கமாட்டாயா?\" என்று அவனிடம் கேட்டுக்கொண்டே அவனைப் பின்தொடர்ந்தேன். உடனே அவன் (ஓடு வதை) நிறுத்திக்கொண்டான். பிறகு நானும் அவனும் நேருக்குநேர் சந்தித்து, வாளால் மாறி மாறித் தாக்கிக்கொண்டோம். அவனை நான் வாளால் வெட்டிக் கொன்றேன். பிறகு அபூஆமிர் அவர்களிடம் திரும்பி வந்து, \"உங்களைக் கொ(ல்ல முய)ன்றவனை அல்லாஹ் கொன்றொழித்துவிட்டான்\" என்று சொன்னேன். பிறகு \"(எனது முழங்காலில் தைத்திருக்கும்) இந்த அம்பைப் பிடுங்கி எடுங்கள்\" என்று அபூஆமிர் (ரலி) அவர்கள் கூற, உடனே நான் அதைப் பிடுங்கினேன். அதிலிருந்து நீர் கொட்டியது. அப்போது அபூஆமிர் அவர்கள், \"என் சகோதரர் மகனே! அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் சென்று அவர்களுக்கு என் முகமன் (சலாம்) கூறி, அபூஆமிர் தமக்காகப் பாவமன்னிப்புக் கோரும்படி கூறியதாகச் சொல்வீராக!\"என்றார்கள். பிறகு அபூஆமிர் (ரலி) அவர்கள் என்னை மக்களுக்குத் தளபதியாக நியமித்துவிட்டுச் சிறிது நேரத்திற்குப்பின் இறந்துவிட்டார்கள். நான் (அங்கிருந்து) திரும்பி நபி (ஸல்) அவர்களிடம் வந்தேன். அப்போது அவர்கள் ஒரு வீட்டில் (பேரீச்ச நாரினால் வேயப்பட்ட) கயிற்றுக் கட்டிலில் படுத்திருந்தார்கள். அதன் மீது விரிப்பு ஒன்று இருந்தது. எனினும், கட்டிலின் கயிறு நபி (ஸல்) அவர்களின் முதுகிலும் விலாப் புறங்களிலும் அடையாளம் பதிந்திருந்தது. அப்போது அவர்களிடம் எங்கள் (படையினர் பற்றிய) செய்தியையும் அபூஆமிர் (ரலி) அவர்களது செய்தியையும் கூறி,தமக்காகப் பாவமன்னிப்புக் கோரும்படி அபூஆமிர் வேண்டியது பற்றியும் கூறினேன். உடனே நபி (ஸல்) அவர்கள் தண்ணீர் கொண்டுவரும்படி கூறி, அதில் அங்கத் தூய்மை (உளூ) செய்தார்கள். பிறகு தம் அக்குள்களின் வெண்மையை நான் பார்க்குமளவுக்குத் தம் இரு கைகளையும் உயர்த்தி, \"இறைவா! அபூஆமிர் உபைதுக்கு நீ மன்னிப்பு அளிப்பாயாக! மறுமை நாளில் உன் \"படைப்பினங்களில்\" அல்லது \"மனிதர்களில்\" பலரையும்விட (தகுதியில்) உயர்ந்தவராக அவரை ஆக்குவாயாக!\" என்று பிரார்த்தித்தார்கள். உடனே நான், \"எனக்காகவும் பாவமன்னிப்புக் கோருங்கள், அல்லாஹ்வின் தூதரே!\" என்று கூறினேன். அதற்கு அவர்கள், \"இறைவா! \"(அபூமூசா) அப்துல்லாஹ் பின் கைஸின் பாவத்தை மன்னித்து, மறுமை நாளில் கண்ணியமான இருப்பிடத்திற்கு அவரை அனுப்புவாயாக\" என்று பிரார்த்தித்தார்கள். இதன் அறிவிப்பாளர்களில் ஒருவரான அபூபுர்தா (ரஹ்) அவர்கள் கூறுகிறார்கள்: (நபி (ஸல்) அவர்கள் செய்த) இரு பிரார்த்தனைகளில் முந்தியது அபூஆமிர் (ரலி) அவர்களுக்கும் இரண்டாவது (என் தந்தை) அபூமூசா (ரலி) அவர்களுக்கும் உரியதாகும். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 237
			}
		}
	]
}