{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6492,
			"arabicnumber": "2542.03",
			"text": "உசைர் பின் ஜாபிர் (ரலி) அவர்கள் கூறியதாவது: (கலீஃபா) உமர் பின் அல்கத்தாப் (ரலி) அவர்களிடம் யமன்வாசிகளின் உதவிப் படைகள் வந்தால், அவர்களிடம் \"உங்களிடையே உவைஸ் பின் ஆமிர் (எனப்படும் மனிதர் ஒருவர்) இருக்கிறாரா?\" என்று கேட்பார்கள். இந்நிலையில் (ஒரு முறை) உவைஸ் (ரஹ்) அவர்களிடம் உமர் (ரலி) அவர்கள் வந்து, \"நீர்தான் உவைஸ் பின் ஆமிரா?\" என்று கேட்டார்கள். அதற்கு உவைஸ் அவர்கள் \"ஆம்\" என்றார்கள். உமர் (ரலி) அவர்கள், \"முராத் (மூலக்) கோத்திரத்தையும் பிறகு \"கரன்\" (கிளைக்) குலத்தையும் சேர்ந்தவரா (நீங்கள்)?\" என்று கேட்டார்கள். அதற்கு உவைஸ் அவர்கள் \"ஆம்\" என்றார்கள். உமர் (ரலி) அவர்கள், \"உங்களுக்கு வெண்குஷ்டம் ஏற்பட்டு, அதில் ஒரு திர்ஹம் அளவைத் தவிர மற்றது (உமது பிரார்த்தனை மூலம்) குணமாகிவிட்டதா?\" என்று கேட்டார்கள். அதற்கும் உவைஸ் அவர்கள் \"ஆம்\" என்றார்கள். உமர் (ரலி) அவர்கள், \"உமக்குத் தாயார் ஒருவர் இருக்கிறாரா?\" என்று கேட்டார்கள். அதற்கு உவைஸ் அவர்கள் \"ஆம்\" என்று பதிலளித்தார்கள். உமர் (ரலி) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"யமன்வாசிகளின் உதவிப் படையினருடன் \"முராத்\" (மூலக்) கோத்திரத்தையும் பின்னர் \"கரன்\" (கிளைக்) குலத்தையும் சேர்ந்த உவைஸ் பின் ஆமிர் என்பவர் உங்களிடம் வருவார். அவருக்கு வெண்குஷ்டம் ஏற்பட்டு, பின்னர் ஒரு திர்ஹம் அளவைத் தவிர மற்றவை குணமாயிருக்கும். அவருக்குத் தாயார் ஒருவர் இருப்பார். அவருக்கு உவைஸ் ஊழியம் புரிபவராக இருப்பார். அவர் அல்லாஹ்வின் மீது சத்தியமிட்டால், அல்லாஹ் அதை நிறைவேற்றி வைப்பான். (உமரே!) அவர் உமக்காகப் பாவமன்னிப்புக் கோரிப் பிரார்த்திக்க வாய்ப்புக் கிட்டினால் அவரைப் பிரார்த்திக்கச் சொல்லுங்கள்\" என்று கூறினார்கள். ஆகவே, எனக்காகப் பாவமன்னிப்பு வேண்டி பிரார்த்தியுங்கள். அவ்வாறே உவைஸ் (ரஹ்) அவர்களும் உமருக்காகப் பாவமன்னிப்பு வேண்டிப் பிரார்த்தித்தார்கள். பிறகு உமர் (ரலி) அவர்கள், \"நீங்கள் எங்கே செல்கிறீர்கள்?\" என்று கேட்டார்கள். அதற்கு உவைஸ் (ரஹ்) அவர்கள், \"கூஃபாவிற்கு\" என்று பதிலளித்தார்கள். உமர் (ரலி) அவர்கள், \"கூஃபாவின் ஆளுநரிடம் உமக்காகப் (பரிந்துரைத்து) கடிதம் எழுதட்டுமா?\" என்று கேட்டார்கள். அதற்கு உவைஸ் (ரஹ்) அவர்கள், \"சாதாரண மக்களில் ஒருவனாக நான் இருப்பதே எனக்கு மிகவும் விருப்பமானதாகும்\" என்று கூறிவிட்டார்கள். அடுத்த ஆண்டில் \"கரன்\" குலத்தைச் சேர்ந்த பிரமுகர்களில் ஒருவர் ஹஜ்ஜுக்காகச் சென்றிருந்த போது உமர் (ரலி) அவர்களைத் தற்செயலாகச் சந்தித்தார். அப்போது அவரிடம் உமர் (ரலி) அவர்கள் உவைஸ் (ரஹ்) அவர்களைப் பற்றி விசாரித்தார்கள். அதற்கு அவர், \"மிக எளிய குடிலில் (நெருக்கடியான வாழ்விலும்) மிகக் குறைவான வாழ்க்கைச் சாதனங்களிலுமே அவரை விட்டுவந்துள்ளேன்\" என்று கூறினார். அப்போது உமர் (ரலி) அவர்கள், \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் \"யமன்வாசிகளின் உதவிப் படையினருடன் \"முராத்\" (மூலக்) கோத்திரத்தையும் பின்னர் \"கரன்\" (கிளைக்) குலத்தையும் சேர்ந்த உவைஸ் பின் ஆமிர் என்பவர் உங்களிடம் வருவார். அவருக்கு (மேனியில்) வெண்குஷ்டம் ஏற்பட்டுப் பின்னர் ஒரு திர்ஹம் அளவு இடத்தைத் தவிர மற்றவை குணமாகியிருக்கும். அவருக்குத் தாயார் ஒருவர் இருப்பார். அவருக்கு உவைஸ் ஊழியம் புரிபவராக இருப்பார். அவர் அல்லாஹ்வின்மீது சத்தியம் செய்தால், அல்லாஹ் அதை நிறைவேற்றி வைப்பான். (உமரே!) அவர் உமக்காகப் பாவ மன்னிப்புக் கோரிப் பிரார்த்திக்கும் வாய்ப்புக் கிட்டினால் அவரிடம் பிரார்த்திக்கச் சொல்லுங்கள் என்று கூறினார்கள்\" என்றார்கள். ஆகவே, அப்பிரமுகர் உவைஸ் (ரஹ்) அவர்களிடம் சென்று, \"எனக்காகப் பாவமன்னிப்பு வேண்டிப் பிரார்த்தியுங்கள்\" என்று கூறினார். அப்போது உவைஸ் அவர்கள், \"நீர்தான் இப்போது புனிதப் பயணம் ஒன்றை முடித்து வந்துள்ளீர். ஆகவே, நீர்தான் எனக்காகப் பாவமன்னிப்புக் கோர வேண்டும்\" என்றார்கள். \"நீர் உமர் (ரலி) அவர்களைச் சந்தித்தீரா?\" என்று கேட்டார்கள். அவர் \"ஆம்\" என்றார். பிறகு அவருக்காகப் பாவமன்னிப்பு வேண்டிப் பிரார்த்தித்தார்கள். அப்போதுதான் மக்களும் உவைஸ் அவர்களை அறிந்துகொண்டனர். பிறகு உவைஸ் அவர்கள் தமது திசையில் நடக்கலானார்கள். தொடர்ந்து (உசைர் பின் ஜாபிர் (ரலி) அவர்கள் கூறுகிறார்கள்:) நான் உவைஸ் அவர்களுக்கு (நல்ல) போர்வையொன்றை அணியக் கொடுத்தேன். அவரை யாரேனும் ஒருவர் காணும்போதெல்லாம் \"உவைஸ் அவர்களுக்கு இந்தப் போர்வை எப்படிக் கிடைத்தது?\" என்று கேட்பார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 44",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 321
			}
		}
	]
}