{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"45": "The Book of Virtue, Enjoining Good Manners, and Joining of the Ties of Kinship"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6509,
			"arabicnumber": "2550.02",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: மூன்று பேரைத் தவிர வேறெவரும் தொட்டிலில் (குழந்தையாக இருந்தபோது) பேசியதில்லை. ஒருவர் மர்யமின் புதல்வர் ஈசா (அலை) அவர்கள்; (மற்றொருவர்) ஜுரைஜின் பிள்ளை (என அவதூறு சொல்லப்பட்ட குழந்தை). ஜுரைஜ் (பனூ இஸ்ராயீல் சமுதாயத்தைச் சேர்ந்த) வணக்கசாலியான மனிதராயிருந்தார். அவர் ஆசிரமம் ஒன்றை அமைத்துக்கொண்டு அதில் இருந்து (வழிபட்டு)வந்தார். (ஒரு முறை) அவர் தொழுதுகொண்டிருந்தபோது அவரிடம் அவருடைய தாயார் வந்து, \"ஜுரைஜே!\" என்று அழைத்தார். அப்போது ஜுரைஜ், \"என் இறைவா! என் தாயா? எனது தொழுகையா?\" (என் தாய்க்குப் பதிலளிப்பதா, அல்லது தொழுகையைத் தொடர்வதா?) என்று (மனதிற்குள்) வினவிக்கொண்டு, தொழுகையில் கவனம் செலுத்தினார். ஆகவே, அவருடைய தாயார் (கோபித்துக்கொண்டு) திரும்பிச்சென்றுவிட்டார். மறுநாளும் அவர் தொழுதுகொண்டிருந்த போது அவரிடம் அவருடைய தாயார் வந்து, \"ஜுரைஜே!\" என்று அழைத்தார். அப்போதும் அவர், \"என் இறைவா! என் தாயா? எனது தொழுகையா?\" என்று (மனதிற்குள்) வினவிக்கொண்டு, தொடர்ந்து தொழுகையில் கவனம் செலுத்தினார். ஆகவே, (அன்றும்) அவருடைய தாயார் (கோபித்துக்கொண்டு) திரும்பிச் சென்றுவிட்டார். அதற்கடுத்த நாளும் அவருடைய தாயார் வந்தார். அப்போதும் அவர் தொழுது கொண்டிருந்தார். அவர், \"ஜுரைஜே!\" என்று அழைத்தார். ஜுரைஜ், \"என் இறைவா! என் தாயா? எனது தொழுகையா?\" என்று (தமக்குள்) வினவிக்கொண்டு தொழுகையில் கவனம் செலுத்தினார். ஆகவே, அவருடைய தாயார் (கோபித்துக்கொண்டு), \"இறைவா! அவனை (ஜுரைஜை) விபசாரிகளின் முகத்தில் விழிக்கச் செய்யாமல் மரணிக்கச் செய்யாதே\" என்று பிரார்த்தித்தார். பனூ இஸ்ராயீல் சமுதாயத்தார் ஜுரைஜைப் பற்றியும் அவருடைய வணக்க வழிபாடுகளைப் பற்றியும் (புகழ்ந்து) பேசிக்கொண்டனர். பனூ இஸ்ராயீலில் அழகுக்குப் பெயர்போன, விபசாரத்தில் ஈடுபட்டுவந்த பெண் ஒருத்தி இருந்தாள். அவள் (பனூ இஸ்ராயீல் மக்களிடம்), \"நீங்கள் விரும்பினால் உங்களுக்காக அவரைக் குழப்பத்தில் ஆழ்த்துகிறேன்\" என்று கூறிவிட்டு, அவரிடம் தன்னை ஒப்படைத்தாள். ஆனால், அவளை ஜுரைஜ் ஏறெடுத்தும் பார்க்கவில்லை. ஆகவே, (அவரைப் பழிவாங்குவதற்காக) அவள் ஓர் ஆட்டு இடையனிடம் சென்றாள். அவன் ஜுரைஜின் ஆசிரமத்துக்கு வருவது வழக்கம். தன்னை அனுபவித்துக்கொள்ள அந்த இடையனுக்கு அவள் வாய்ப்பளித்தாள். அவனும் அவளுடன் (தகாத) உறவில் ஈடுபட்டான். (இதில்) அவள் கர்ப்பமுற்றாள். குழந்தை பிறந்ததும், \"இது ஜுரைஜுக்குப் பிறந்த குழந்தை\" என்று (மக்களிடம்) கூறினாள். எனவே, மக்கள் (வெகுண்டெழுந்து) ஜுரைஜிடம் வந்து அவரைக் கீழே இறங்கிவரச் செய்துவிட்டு, அவரது ஆசிரமத்தை இடித்துத் தகர்த்துவிட்டனர். அவரையும் அடிக்கலாயினர். அப்போது ஜுரைஜ், \"உங்களுக்கு என்ன நேர்ந்தது? (ஏன் இப்படிச் செய்கிறீர்கள்?)\" என்று கேட்டார். மக்கள், \"நீர் இந்த விபசாரியுடன் உறவுகொண்டு அதன் மூலம் அவள் குழந்தை பெற்றெடுத்துவிட்டாள்\" என்று கூறினார். உடனே ஜுரைஜ், \"அந்தக் குழந்தை எங்கே?\" என்று கேட்டார். மக்கள் அந்தக் குழந்தையைக் கொண்டுவந்தனர். அப்போது ஜுரைஜ், \"நான் தொழுது கொள்ளும்வரை என்னை விட்டுவிடுங்கள்\" என்று கூறிவிட்டுத் தொழுதார். தொழுகை முடிந்ததும் அந்தக் குழந்தையிடம் வந்து, அதன் வயிற்றில் (தமது விரலால்) குத்தினார். பிறகு \"குழந்தாய்! உன் தந்தை யார்?\" என்று கேட்டார். அதற்கு அக்குழந்தை, \"இன்ன ஆட்டு இடையன்தான் (என் தந்தை)\" என்று பேசியது. (உண்மையை உணர்ந்துகொண்ட) அம்மக்கள், ஜுரைஜை முன்னோக்கிவந்து அவரை முத்தமிட்டு அவரைத் தொட்டுத்தடவினர். மேலும், \"தங்களது ஆசிரமத்தை நாங்கள் தங்கத்தால் கட்டித்தருகிறோம்\" என்று கூறினார்கள். அதற்கு ஜுரைஜ், \"இல்லை; முன்பிருந்ததைப் போன்று களிமண்ணால் கட்டித்தாருங்கள் (அதுவே போதும்)\" என்று கூறிவிட்டார். அவ்வாறே மக்களும் கட்டித்தந்தனர். (மழலைப் பருவத்தில் பேசிய மூன்றாமவர்:) ஒரு குழந்தை தன் தாயிடம் பாலருந்திக்கொண்டிருந்தது. அப்போது வனப்புமிக்க ஒரு மனிதன் மிடுக்கான வாகனமொன்றில் பயணம் செய்து கொண்டிருந்தான். உடனே அக்குழந்தையின் தாய், \"இறைவா! இதோ இவனைப் போன்று என் மகனையும் ஆக்குவாயாக!\" என்று பிரார்த்தித்தாள். அக்குழந்தை மார்பை விட்டுவிட்டு அப்பயணியைத் திரும்பிப்பார்த்து, \"இறைவா! இவனைப் போல் என்னை ஆக்கிவிடாதே\" என்று பேசியது. பிறகு மறுபடியும் மார்புக்குச் சென்று பால் அருந்தலாயிற்று. -இந்த இடத்தில் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், அந்தக் குழந்தை பால் குடித்ததை அறிவிக்கும் முகமாக, தமது ஆட்காட்டி விரலை வாயில் வைத்து உறிஞ்சுவதைப் போன்று சைகை செய்து காட்டியதை இப்போதும் நான் பார்ப்பதைப் போன்றுள்ளது. பிறகு தாயும் மகவும் ஓர் அடிமைப் பெண்ணைக் கடந்துசென்றனர். மக்கள் அவளை, \"நீ விபசாரம் செய்தாய்;திருடினாய்\" என்று (இடித்துக்) கூறி அடித்துக்கொண்டிருந்தனர். ஆனால் அவளோ, \"அல்லாஹ்வே எனக்குப் போதுமானவன்; பொறுப்பாளர்களில் அவனே நல்லவன்\" என்று கூறிக்கொண்டிருந்தாள். அப்போது அக்குழந்தையின் தாய், \"இறைவா! என் மகனை இவளைப் போன்று ஆக்கிவிடாதே\" என்று கூறினாள். உடனே அக்குழந்தை பால் அருந்துவதை நிறுத்திவிட்டு அந்த அடிமைப் பெண்ணை நோக்கி(த் திரும்பி), \"இறைவா! என்னை இவளைப் போன்று ஆக்குவாயாக!\" என்று கூறியது. அந்த இடத்தில் தாயும் மகவும் பேசிக் கொண்டனர். தாய் சொன்னாள்: உன் தொண்டை அறுபடட்டும்! அழகிய தோற்றம் கொண்ட மனிதர் ஒருவர் கடந்து சென்றபோது நான், \"இறைவா! இதோ இவனைப் போன்று என் மகனை ஆக்குவாயாக\" என்று கூறினேன். அப்போது நீ \"இறைவா! இவனைப் போன்று என்னை ஆக்கிவிடாதே!\" என்று கூறினாய். பிறகு மக்கள், \"விபச்சாரம் செய்துவிட்டாய்; திருடிவிட்டாய்\" என்று (இடித்துக்)கூறி அடித்துக் கொண்டிருந்த இந்த அடிமைப் பெண்ணைக் கடந்துசென்றபோது நான், \"இறைவா! என் மகனை இவளைப் போன்று ஆக்கிவிடாதே!\" என்று பிரார்த்தித்தேன். அப்போது நீ \"இறைவா! இவளைப் போன்று என்னை ஆக்குவாயாக!\" என்று கூறினாய். (ஏன் அப்படிச் சொன்னாய்? என்று கேட்டாள்.) அதற்கு அக்குழந்தை, \"(வாகனத்தில் சென்ற) அந்த மனிதன் (அடக்குமுறைகளை அவிழ்த்து விடும்) கொடுங்கோலனாக இருந்தான். ஆகவே, நான் \"இறைவா! இவனைப் போன்று என்னை ஆக்கிவிடாதே!\" என்று கூறினேன். \"நீ விபசாரம் செய்துவிட்டாய்\" என்று கூறிக்கொண்டிருந்தனரே அப்பெண் விபசாரம் செய்யவுமில்லை. \"நீ திருடிவிட்டாய்\" என்று அவர்கள் கூறிக்கொண்டிருந்தனர். ஆனால், அவள் திருடவுமில்லை. ஆகவேதான், \"இறைவா! அவளைப் போன்று என்னையும் (நல்லவளாக) ஆக்குவாயாக!\" என்று கூறினேன்\" என்று பதிலளித்தது. இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 45",
			"grades": [],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		}
	]
}