{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"47": "The Book of Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6799,
			"arabicnumber": "2673.04",
			"text": "உர்வா பின் அஸ்ஸுபைர் (ரஹ்) அவர்கள் கூறியதாவது: என்னிடம் (என் சிறிய தாயார்) ஆயிஷா (ரலி) அவர்கள், \"என் சகோதரி (அஸ்மாவின்) மகனே! (நபித்தோழர்) அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் நம்மைக் கடந்து ஹஜ்ஜுக்குச் செல்லவிருக்கிறார்கள் என எனக்குச் செய்தி வந்துள்ளது. எனவே, அவரைச் சந்தித்து அவரிடம் (மார்க்க விளக்கங்களைக்) கே(ட்டுத் தெரிந்துகொ)ள். ஏனெனில், அவர் நபி (ஸல்) அவர்களிடமிருந்து அதிகமான கல்வியறிவைப் பெற்றுள்ளார்\"என்று கூறினார்கள். ஆகவே, நான் அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்களைச் சந்தித்து, அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து அவர் கூறி வந்த பல்வேறு செய்திகள் குறித்துக் கேட்டேன். அவற்றில் பின்வரும் செய்தியும் ஒன்றாகும். நபி (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ் மனிதர்களி(ன் மனங்களி)லிருந்து ஒரேயடியாகக் கல்வியைப் பறித்துக்கொள்ளமாட்டான். மாறாக, கல்விமான்களை அவர்களது கல்வியுடன் கைப்பற்றிக்கொள்வான். பின்னர் மக்களிடையே அறிவீனர்களான தலைவர்களையே அல்லாஹ் விட்டுவைப்பான். அவர்கள் அறிவின்றியே மக்களுக்குத் தீர்ப்பு வழங்குவார்கள். (இதன்மூலம்) தாமும் வழிதவறி, பிறரையும் வழிதவறச் செய்வார்கள். பிறகு நான் இந்த ஹதீஸை ஆயிஷா (ரலி) அவர்களிடம் தெரிவித்தேன். அதை ஆயிஷா (ரலி) அவர்கள் பாரதூரமாகக் கருதி அதை மறுத்தார்கள். \"இவ்வாறு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறியதைத் தாம் கேட்டதாக அப்துல்லாஹ் பின் அம்ர் உன்னிடம் சொன்னாரா?\" என்று கேட்டார்கள். அடுத்த ஆண்டு ஆனபோதும் என்னிடம் ஆயிஷா (ரலி) அவர்கள், \"அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்கள் ஹஜ்ஜுக்கு வந்துள்ளார்கள். அவரைச் சந்தித்துப் பேச்சுக் கொடுத்து முன்பு உன்னிடம் அவர் சொன்ன கல்வி தொடர்பான அந்த ஹதீஸைப் பற்றி அவரிடம் கேள்\" என்றார்கள். அவ்வாறே நான் அப்துல்லாஹ் பின் அம்ர் (ரலி) அவர்களைச் சந்தித்து அவர்களிடம் கேட்டேன். முதல் முறை என்னிடம் அறிவித்ததைப் போன்றே (எந்த மாற்றமுமின்றி அந்த ஆண்டிலும்) என்னிடம் அறிவித்தார்கள். நான் ஆயிஷா (ரலி) அவர்களிடம் அதைத் தெரிவித்தபோது அவர்கள், \"அவர் உண்மையே கூறியிருக்கிறார் என்று நான் கருதுகிறேன்; சிறிதும் கூட்டவோ குறைக்கவோ செய்யவில்லை என்றே நான் கருதுகிறேன்\"என்றார்கள். அத்தியாயம் : 47",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 25
			}
		}
	]
}