{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"47": "The Book of Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6800,
			"arabicnumber": "1017.05",
			"text": "ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்கள் கூறியதாவது: கம்பளியாடை அணிந்த கிராமவாசிகளில் சிலர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்தார்கள். அவர்களது வறியநிலையை அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கண்டார்கள். அவர்களுக்குத் தேவை ஏற்பட்டிருந்தது. ஆகவே, (அவர்களுக்குத்) தானதர்மம் செய்யும்படி அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மக்களைத் தூண்டினார்கள். மக்கள் (தர்மம் செய்வதில்) தயக்கம் காட்டினர். அ(தன் அடையாளமான)து அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது முகத்தில் தென்பட்டது. பிறகு அன்சாரிகளில் ஒருவர் ஒரு பை நிறைய வெள்ளியுடன் வந்தார். பிறகு மற்றொருவர் (தர்மத்தைக்கொண்டு) வந்தார். பிறகு ஒவ்வொருவராக (தம்மிடமிருந்த பொருள்களுடன்) வந்தனர். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களது முகத்தில் மகிழ்ச்சி தெரிந்தது. அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: யார் இஸ்லாத்தில் (அதன் அடிப்படைக்கு முரண்படாத வகையில்) ஓர் அழகிய நடைமுறையை உருவாக்கி, அவருக்குப்பின் அந்த நடைமுறை செயல்படுத்தப்படுகிறதோ அதன்படி செயல்படுபவர்களின் நன்மை போன்றது அ(ந்த நடைமுறையை உருவாக்கிய)வருக்கு உண்டு. அதற்காக அவர்களது நன்மையில் எதுவும் குறைந்துவிடாது. யார் இஸ்லாத்தில் (அதன் அடிப்படைக்கு எதிரான) ஒரு தீயநடைமுறையை உருவாக்கி விட, அவருக்குப் பிறகும் அந்த நடைமுறை செயல்படுத்தப்படுகிறதோ அவருக்குப்பின் அதன்படி செயல்படுகிறவர்களின் பாவம் போன்றது அவருக்கு உண்டு. அ(தன்படி செயல்பட்ட)வர்களின் பாவத்திலிருந்து எதுவும் குறையாது. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் ஜரீர் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"(ஒரு முறை) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் உரையாற்றினார்கள். அப்போது தானதர்மம் செய்யும்படி (மக்களைத்) தூண்டினார்கள்\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்றவை மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மேற்கண்ட ஹதீஸ் ஜரீர் பின் அப்தில்லாஹ் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"ஓர் அடியார் நல்ல நடைமுறையொன்றை உருவாக்கி அவருக்குப்பின் அது செயல் படுத்தப்பட்டால்...\" என்று ஹதீஸ் ஆரம்பமாகிறது. மற்ற தகவல்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. - மேற்கண்ட ஹதீஸ் ஜரீர் (ரலி) அவர்களிடமிருந்தே மேலும் ஆறு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அத்தியாயம் : 47",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 26
			}
		}
	]
}