{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6839,
			"arabicnumber": "2689",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: வளமும் உயர்வும் மிக்க அல்லாஹ்விடம் கூடுதல் வானவர்கள் சிலர் உள்ளனர். அவர்கள் பூமியில் சுற்றிவருகின்றனர். அல்லாஹ்வை நினைவுகூர்ந்து போற்றும் சபைகளைத் தேடி வருகின்றனர். அல்லாஹ்வைப் போற்றும் சபை ஒன்றை அவர்கள் கண்டால், அவர்களுடன் அவ்வானவர்களும் அமர்ந்துகொள்கின்றனர். அவர்களில் சிலர் வேறுசிலரைத் தம் இறக்கைகளால் சூழ்ந்து, தமக்கும் முதல் வானத்துக்கும் இடையே உள்ள பகுதியை நிரப்புகின்றனர். (இறைவனை நினைவுகூரும்) அம்மக்கள் கலைந்து சென்றதும் அ(ந்த வான)வர்கள் வானுலகிற்கு ஏறிச் செல்கின்றனர். அப்போது வல்லமையும் மாண்பும் மிக்க அல்லாஹ், அவர்களிடம் -அவர்களை நன்கறிந்திருந்தும்- \"நீங்கள் எங்கிருந்து வருகிறீர்கள்?\" என்று கேட்கிறான். அதற்கு வானவர்கள், \"பூமியிலுள்ள உன் அடியார்கள் சிலரிடமிருந்து நாங்கள் வருகிறோம். அவர்கள் உன்னைத் தூய்மையானவன் என்று கூறித் துதிக்கின்றனர்; உன்னைப் பெருமைப்படுத்திக் கொண்டும், உன்னை ஏகன் என்று கூறிக்கொண்டும், உன்னைப் புகழ்ந்து போற்றிக் கொண்டும், உன்னிடத்தில் வேண்டிக்கொண்டும் இருக்கின்றனர்\" என்று கூறுகின்றனர். அதற்கு இறைவன், \"என்னிடம் அவர்கள் என்ன வேண்டுகின்றனர்?\" என்று (தனக்குத் தெரியாதது போலக்)கேட்கிறான். வானவர்கள், \"அவர்கள் உன்னிடம் சொர்க்கத்தை வேண்டுகின்றனர்\" என்பார்கள். அதற்கு இறைவன், \"அவர்கள் என் சொர்க்கத்தைப் பார்த்ததுண்டா?\" என்று கேட்பான். அதற்கு வானவர்கள், \"இல்லை, இறைவா!\" என்று பதிலளிப்பார்கள். அதற்கு இறைவன், \"அவ்வாறாயின், என் சொர்க்கத்தை அவர்கள் பார்த்திருந்தால் அவர்கள் நிலை எப்படியிருக்கும்?\" என்று கூறுவான். மேலும், \"உன்னிடம் அவர்கள் பாதுகாப்புக் கோருகின்றனர்\" என்றும் வானவர்கள் கூறுகின்றனர். அதற்கு இறைவன், \"என்னிடம் அவர்கள் எதிலிருந்து (காக்குமாறு) பாதுகாப்புக் கோருகின்றனர்?\" என்று கேட்பான். அதற்கு வானவர்கள், \"உன் நரகத்திலிருந்து, இறைவா!\" என்று பதிலளிப்பார்கள். இறைவன், \"அவர்கள் எனது நரகத்தைப் பார்த்திருக்கிறார்களா?\" என்று கேட்பான். வானவர்கள், \"இல்லை\" என்பார்கள். அதற்கு இறைவன், \"அவ்வாறாயின் என் நரகத்தை அவர்கள் பார்த்திருந்தால் அவர்கள் நிலை எப்படியிருக்கும்?\" என்று கூறுவான். மேலும், \"அவர்கள் உன்னிடம் பாவமன்னிப்புக் கோருகிறார்கள்\" என்றும் வானவர்கள் கூறுவார்கள். அதற்கு இறைவன், \"அவர்களுடைய பாவங்களை நான் மன்னித்துவிட்டேன். அவர்கள் வேண்டியதையும் அவர்களுக்கு நான் வழங்கிவிட்டேன். அவர்கள் எதிலிருந்து பாதுகாப்புக் கோரினார்களோ அதிலிருந்து அவர்களை நான் காப்பாற்றிவிட்டேன்\" என்று கூறுவான். அப்போது வானவர்கள், \"இறைவா! (அந்த) சபையோரிடையே அதிகப் பாவங்கள் புரியும் இன்ன மனிதன் இருந்தான். அவன் அவ்வழியே கடந்து சென்றபோது அவர்களுடன் அமர்ந்துகொண்டான்\" என்று கூறுகின்றனர். அதற்கு இறைவன், \"அவனையும் நான் மன்னித்துவிட்டேன். அவர்கள் ஒரு கூட்டத்தார் ஆவர். அவர்களுடன் அமர்ந்திருந்தவர் அவர்களால் (பாக்கியம் பெறுவாரே தவிர) பாக்கியமற்றவராக ஆகமாட்டார்\" என்று கூறுவான். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 35
			}
		}
	]
}