{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6857,
			"arabicnumber": "2701",
			"text": "அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் கூறியதாவது: பள்ளிவாசலில் வட்டமாக அமர்ந்திருந்த ஒரு குழுவினரிடம் முஆவியா (ரலி) அவர்கள் புறப்பட்டுவந்து, \"நீங்கள் இங்கு அமர்ந்திருப்பதற்கு என்ன காரணம்?\" என்று கேட்டார்கள். அதற்கு அக்குழுவினர், \"அல்லாஹ்வை நினைவுகூர்ந்து போற்றுவதற்காக அமர்ந்துள்ளோம்\" என்று கூறினர். அதற்கு முஆவியா (ரலி) அவர்கள், \"அல்லாஹ்வின் மீது சத்தியமாக! இதற்காகத்தான் நீங்கள் அமர்ந்துள்ளீர்களா?\" என்று கேட்டார்கள். அதற்கு அக்குழுவினர், \"அல்லாஹ்வின்மீது சத்தியமாக! அதற்காகத்தான் நாங்கள் அமர்ந்துள்ளோம்\" என்று கூறினர். முஆவியா (ரலி) அவர்கள் கூறினார்கள்: உங்கள்மீது சந்தேகப்பட்டு நான் உங்களைச் சத்தியமிட்டுக் கூறச் சொல்லவில்லை. அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் என் அளவுக்கு நெருக்கமாக இருந்தவர்களில் எவரும் என்னைவிடக் குறைவான ஹதீஸ்களை அவர்களிடமிருந்து அறிவிக்கவில்லை. (நானே மிகக் குறைவான ஹதீஸ்களை அறிவித்தவன்.) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஒரு முறை) வட்டமாக அமர்ந்திருந்த தம் தோழர்களில் சிலரிடம் வந்து, \"நீங்கள் (இங்கு) அமர்ந்திருப்பதற்கு என்ன காரணம்?\" என்று கேட்டார்கள். அதற்குத் தோழர்கள், \"அல்லாஹ் எங்களுக்கு இஸ்லாத்திற்கு நேர்வழி காட்டியதற்காகவும், எங்களுக்கு அருட்கொடைகள் புரிந்ததற்காகவும் அவனை நினைவுகூர்ந்து போற்றுவதற்காக அமர்ந்திருக்கிறோம்\" என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அல்லாஹ்வின் மீது சத்தியமாக! இதற்காகத் தான் நீங்கள் அமர்ந்துள்ளீர்களா?\" என்று கேட்டார்கள். அதற்குத் தோழர்கள், \"அல்லாஹ்வின் மீது சத்தியமாக! இதற்காகத்தான் நாங்கள் அமர்ந்துள்ளோம்\" என்று கூறினர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அறிந்துகொள்ளுங்கள்! உங்கள்மீது சந்தேகம் கொண்டுச் சத்தியமிட்டு உங்களிடம் நான் கேட்கவில்லை. மாறாக, (வானவர்) ஜிப்ரீல் (அலை) அவர்கள் என்னிடம் வந்து, \"வல்லமையும் மாண்பும் மிக்க அல்லாஹ் உங்களைப் பற்றி வானவர்களிடம் பெருமையுடன் பேசிக்கொள்கிறான்\" என்று தெரிவித்தார் என்றார்கள். அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 51
			}
		}
	]
}