{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"49": "The Book of Heart-Melting Traditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6949,
			"arabicnumber": "2743.01",
			"text": "அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: (உங்களுக்கு முன் வாழ்ந்தவர்களில்) மூன்று பேர் நடந்து சென்றுகொண்டிருந்தபோது (திடீரென) மழை பிடித்துக்கொண்டது. ஆகவே, அவர்கள் மலைக்குகையொன்றில் ஓதுங்கினார்கள். (அவர்கள் உள்ளே நுழைந்த) உடனே மலையிலிருந்து உருண்டுவந்த ஒரு பாறை குகைவாசலை அடைத்துக்கொண்டது. (வெளியேற முடியாமல் திணறிய) அவர்கள் (மூவரும்) அப்போது தமக்குள், \"நாம் (வேறெவருடைய திருப்திக்காகவுமின்றி) அல்லாஹ்வுக்காக (என்று தூய்மையான முறையில்) செய்த நற்செயல்களை நினைத்துப் பார்த்து, அவற்றை முன்வைத்து அல்லாஹ்விடம் பிரார்த்திப்போம். அவன் நம்மை விட்டு இதை அகற்றிவிடக்கூடும்\" என்று பேசிக்கொண்டனர். எனவே, அவர்களில் ஒருவர் இவ்விதம் (இறைவனிடம்) வேண்டினார்: இறைவா! எனக்கு முதிர்ந்த வயதுடைய தாய் தந்தையர் இருவரும் மனைவியும் இருந்தனர். எனக்குச் சிறு குழந்தைகளும் உண்டு. நான் இவர்களைப் பராமரிப்பதற்காக ஆடுகளை மேய்த்துக்கொண்டிருந்தேன். மாலையில் அவர்களிடம் நான் திரும்பி வந்த பின் ஆட்டின் பாலைக் கறந்து கொண்டுவந்து, என் குழந்தைகளுக்கு ஊட்டுவதற்கு முன்பாக என் தாய் தந்தையருக்கு முதலில் ஊட்டுவேன். ஒரு நாள் இலை தழைகளைத் தேடியபடி வெகுதூரம் சென்றுவிட்டேன். அதனால் அந்திப் பொழுதிலேயே (வீட்டுக்கு) வர முடிந்தது. அப்போது (என் தாய் தந்தை) இருவரும் உறங்கிவிட்டிருக்கக் கண்டேன். உடனே எப்போதும் போல பால் கறந்து, பால் செம்புடன் வந்தேன். பெற்றோரைத் தூக்கத்திலிருந்து எழுப்பிவிட மனமில்லாமல் அவர்கள் இருவருடைய தலைமாட்டில் நின்றுகொண்டேன். அவர்கள் இருவருக்குமுன் குழந்தைகளுக்கு ஊட்டுவதையும் நான் விரும்பவில்லை. என் குழந்தைகளோ எனது காலருகில் (பால் கேட்டுக்) கூச்சலிட்டுக்கொண்டிந்தனர். இதே நிலையில் நானும் அவர்களும் இருந்து கொண்டிருக்க, வைகறை வந்துவிட்டது. (இறைவா!) நான் இச்செயலை உனது உவப்பை நாடியே செய்தேன் என்று நீ கருதியிருந்தால், எங்களுக்கு இந்தப் பாறையைச் சற்றே நகர்த்துவாயாக! அதன் வழியாக நாங்கள் ஆகாயத்தைப் பார்த்துக்கொள்வோம். அவ்வாறே அவர்களுக்கு அல்லாஹ் பாறையைச் சற்றே நகர்த்திக்கொடுத்தான். அதன் வழியாக அவர்கள் ஆகாயத்தைப் பார்த்தார்கள். இரண்டாமவர் பின்வருமாறு வேண்டினார்: இறைவா! எனக்கு என் தந்தையின் சகோதரருடைய புதல்வி ஒருத்தி இருந்தாள். பெண்களை ஆண்கள் நேசிப்பதிலேயே மிகவும் ஆழமாக அவளை நான் நேசித்தேன். (ஒரு நாள்) அவளிடம் அவளைக் கேட்டேன். நான் அவளிடம் நூறு பொற்காசுகள் கொண்டுவந்து கொடுத்தால் தவிர (எனக்கு இணங்க முடியாதென) அவள் மறுத்துவிட்டாள். நான் கடுமையாக உழைத்து, (அந்த) நூறு பொற்காசுகளைச் சேகரித்தேன். அவற்றை எடுத்துக்கொண்டு சென்று அவளைச் சந்தித்து, அவளுடைய இரு கால்களுக்கிடையே அமர்ந்தபோது அவள், \"அல்லாஹ்வின் அடியானே! அல்லாஹ்வை அஞ்சிக்கொள். முத்திரையை அதற்குரிய (சட்டபூர்வ) உரிமை(யான திருமணம்) இன்றித் திறவாதே\" என்று சொன்னாள். உடனே நான் அவளை விட்டுவிட்டு எழுந்துவிட்டேன். (இறைவா!) இதை உனது உவப்பைப் பெறவிரும்பியே நான் செய்ததாக நீ கருதினால், இந்தப் பாறையை எங்களுக்காக இன்னும் சற்று நகர்த்துவாயாக! அவ்வாறே அவர்களுக்கு (அல்லாஹ் இன்னும்) சற்றே நகர்த்தினான். மற்றொருவர் (பின்வருமாறு) வேண்டினார்: இறைவா! நான் ஒரு \"ஃபரக்\" அளவு நெல்லைக் கூலியாக நிர்ணயித்து கூலியாள் ஒருவரை பணியமர்த்தினேன். அவர் தமது வேலையை முடித்து விட்டு, \"என் உரிமையை (கூலியை)க் கொடு\" என்று கேட்டார். நான் ஒரு \"ஃபரக்\" அளவு நெல்லை அவர்முன் வைத்தபோது அதை அவர் (பெற்றுக்கொள்ளாமல்) புறக்கணித்து(ச் சென்று)விட்டார். பின்னர் நான் அதை நிலத்தில் விதைத்துத் தொடர்ந்து விவசாயம் செய்துவந்தேன். அதி(ல் கிடைத்த வருவாயி)லிருந்து பல மாடுகளையும் அவற்றுக்கான இடையர்களையும் நான் சேகரித்து விட்டேன். பின்னர் (ஒரு நாள்) அவர் என்னிடம் வந்து, \"அல்லாஹ்வை அஞ்சு! எனது உரிமையில் எனக்கு அநீதி இழைக்காதே\" என்று கூறினார். அதற்கு நான், \"அந்த மாடுகளிடத்திலும் அவற்றின் இடையர்களிடத்திலும் நீ சென்று, அவற்றை எடுத்துக்கொள். (அவை உனக்கே உரியவை)\" என்று சொன்னேன். அதற்கு அந்த மனிதர், \"அல்லாஹ்வை அஞ்சு. என்னைப் பரிகாசம் செய்யாதே\" என்று சொன்னார். நான், \"உன்னை நான் பரிகாசம் செய்யவில்லை. இந்த மாடுகளையும் இடையர்களையும் நீயே எடுத்துக்கொள்\" என்று சொன்னேன். அவர் அவற்றைப் பிடித்துக்கொண்டு சென்றார். (இறைவா!) நான் இந்த (நற்)செயலை உன் உவப்பைப் பெற விரும்பியே செய்ததாக நீ கருதியிருந்தால் மீதியுள்ள அடைப்பையும் நீ அகற்றுவாயாக! அவ்வாறே மீதியிருந்த அடைப்பையும் அல்லாஹ் அகற்றி (அவர்களை வெளியேற்றி) விட்டான். இதை அப்துல்லாஹ் பின் உமர் (ரலி) அவர்கள் அறிவிக்கிறார்கள். - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடமிருந்தே மேலும் பத்து அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், அனைவரது அறிவிப்பிலும் (\"அவர்கள் மூவரும் நடந்து சென்றுகொண்டிருந்தனர்\" என்பதைக் குறிக்க) \"கரஜூ யம்ஷூன\" எனக் கூடுதலாக இடம்பெற்றுள்ளது. சாலிஹ் பின் கைஸ் (ரஹ்) அவர்களது அறிவிப்பில் \"யத்தமாஷவ்ன\" என்று காணப்படுகிறது. உபைதுல்லாஹ் பின் உமர் பின் ஹஃப்ஸ் (ரஹ்) அவர்களது அறிவிப்பில் மட்டும் \"புறப்பட்டுச் சென்றனர்\" என்று இடம்பெற்றுள்ளது. (\"நடந்து சென்றனர்\" என்று இல்லை.) - மேற்கண்ட ஹதீஸ் அப்துல்லாஹ் பின் உமர் (ரலி) அவர்களிடமிருந்தே மேலும் மூன்று அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், \"உங்களுக்கு முன் வாழ்ந்தவர்களில் மூன்றுபேர் கொண்ட ஒரு குழுவினர் நடந்து சென்றனர். இறுதியில் இரவு ஓய்வு எடுப்பதற்காக ஒரு குகைக்குள் ஒதுங்கினர்...\" என்று ஹதீஸ் ஆரம்பமாகி மேற்கண்ட ஹதீஸில் உள்ள விவரங்கள் இடம்பெற்றுள்ளன. ஆயினும் அவற்றில், \"ஒரு மனிதர் \"இறைவா! எனக்கு முதிர்ந்த வயதுடைய பெற்றோர் இருந்தார்கள். நான் இரவில் அவர்கள் இருவருக்கும் பால் கறந்து கொடுப்பதற்குமுன் குடும்பத்தாருக்கோ குழந்தைகளுக்கோ பால் கொடுப்பதில்லை\" என்று கூறியதாகவும், மற்றொருவர், \"அவள் (எனக்கு இணங்க) மறுத்துவிட்டாள். பஞ்சம் நிறைந்த ஓராண்டு வந்தபோது (பொருளாதார நெருக்கடி ஏற்பட்டு) அவள் என்னிடம் வந்தாள். (அவளை அடைந்துகொள்வதற்காக) அவளிடம் நான் நூற்று இருபது பொற்காசுகளைக் கொடுத்தேன்\" என்று சொன்னதாகவும்,இன்னொருவர், \"அவரது கூலியை முதலீடாக்கி (நான் விவசாயம் செய்து அதனால் கால்நடைச்) செல்வங்கள் பெருகி,ஆரவாரம் செய்து கொண்டிருந்தன\" என்று கூறியதாகவும் காணப்படுகிறது. மேலும், \"பிறகு அவர்கள் மூவரும் அந்தக் குகையிலிருந்து வெளியேறி நடந்தனர்\" என்றும் இடம்பெற்றுள்ளது. அத்தியாயம் : 48",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		}
	]
}