{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"50": "The Book of Repentance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7008,
			"arabicnumber": "2766.01",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: உங்களுக்குமுன் வாழ்ந்தவர்களில் ஒரு மனிதர் இருந்தார். அவர் தொண்ணூற்று ஒன்பது மனிதர்களைக் கொன்றுவிட்டிருந்தார். பிறகு அவர் அக்கால மக்களில் நன்கறிந்த அறிஞர் யார் என விசாரித்தார். அவருக்கு ஒரு பாதிரியார் காட்டப்பட்டார். அவர் அந்தப் பாதிரியாரிடம் சென்று, \"நான் தொண்ணூற்று ஒன்பது மனிதர்களைக் கொன்றுவிட்டேன். எனக்குப் பாவமன்னிப்புக் கிடைக்குமா?\" என்று கேட்டார். அந்தப் பாதிரியார், \"கிடைக்காது\" என்று கூறவே, அவரையும் அந்த மனிதர் கொன்று, எண்ணிக்கையை நூறாக முழுமையாக்கிவிட்டார். பிறகு மீண்டும் அக்கால மக்களில் நன்கறிந்த அறிஞரைப் பற்றி அவர் விசாரித்தார். அப்போது அறிஞர் ஒருவர் அவருக்குக் காட்டப்பட்டார். (அவரிடம் சென்று) அந்த மனிதர், \"நான் நூறு கொலைகள் செய்துவிட்டேன். எனக்குப் பாவமன்னிப்புக் கிடைக்குமா?\" என்று கேட்டார். அதற்கு அந்த அறிஞர், \"ஆம் (கிடைக்கும்). இறைவனுக்கும் பாவமன்னிப்புக் கோரிக்கைக்கும் இடையே யார் குறுக்கே வந்து நிற்க முடியும்? நீ (நல்லோர் வாழும்) இன்ன ஊருக்குப் போ. அங்கு மக்கள் சிலர் இருப்பார்கள். அவர்கள் இறைவனை வழிபட்டுக் கொண்டிருப்பார்கள். அவர்களுடன் சேர்ந்து நீயும் இறைவனை வழிபடு. நீ உனது ஊருக்குத் திரும்பிச் செல்லாதே! ஏனெனில், அது தீய ஊராகும்\"என்று சொன்னார். அவ்வாறே, அந்த மனிதர் (நல்லோர் வாழும்) அந்த ஊரை நோக்கிச் சென்றுகொண்டிருந்த போது, பாதி வழியில் இறந்துவிட்டார். அப்போது இறையருளைக் கொண்டுவரும் வானவர்களும் இறை தண்டனைகளை நிறைவேற்றும் வானவர்களும் அவர் விஷயத்தில் (அவரை யார் அழைத்துச் செல்வது) என்று சர்ச்சை செய்துகொண்டனர். அப்போது அருளின் வானவர்கள், \"இவர் பாவமன்னிப்புக் கோரி பாவத்திலிருந்து மீண்டு தமது உள்ளத்தால் இறைவனை நோக்கி வந்துகொண்டிருந்தார்\" என்று கூறினர். தண்டனையின் வானவர்கள், \"இவர் சிறிதும் நன்மைகளைச் செய்யாதவர்\" என்று கூறினர். அப்போது மற்றொரு வானவர் மனிதத் தோற்றத்தில் அங்கு வந்தார். அவரை அவ்விரு வானவர்களும் நடுவராக வைத்துக்கொண்டனர். அப்போது அந்த வானவர், \"இவ்விரு ஊர்களுக்குமிடையிலுள்ள தூரத்தைக் கணக்கெடுங்கள். அவற்றில் எந்த ஊருக்கு மிக அருகில் அவரது உடல் இருக்கிறதோ அந்த ஊருக்குரியவராகவே அவர் இருப்பார்\"என்று சொன்னார். அவ்வாறே கணக்கெடுத்தபோது, (அவர் வசித்துவந்த ஊரைவிட) அவர் நாடிவந்த ஊரே அவருக்கு மிகவும் சமீபமாக இருப்பதைக் கண்டனர். ஆகவே, அவரை அருளின் வானவர்கள் கைப்பற்றிக்கொண்டனர். இதை அபூசயீத் அல்குத்ரீ (ரலி) அவர்கள் அறிவிக்கிறார்கள். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. இதன் அறிவிப்பாளர்களில் ஒருவரான கத்தாதா (ரஹ்) அவர்கள் கூறுகிறார்கள்: \"அவர் (இறக்கும் தறுவாயில்) தமது நெஞ்சை (அந்த நல்ல ஊர் இருக்கும் திசை நோக்கி சாய்த்துக்கொண்(டே இறந்துவிட்)டார்\" என்று எங்களிடம் கூறப்பட்டது என ஹசன் அல்பஸ்ரீ (ரஹ்) அவர்கள் கூறினார்கள். அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 54
			}
		}
	]
}