{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"50": "The Book of Repentance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7022,
			"arabicnumber": "2770.03",
			"text": "மேற்கண்ட ஹதீஸ் ஆயிஷா (ரலி) அவர்களிடமிருந்தே மேலும் இரு அறிவிப்பாளர் தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில் பின்வருமாறு இடம்பெற்றுள்ளது: ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: என்னைப் பற்றி அவதூறு பேசப்பட்டபோது, எனக்கு இன்னும் அதைப் பற்றி தெரிந்திராத நிலையில், அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (என்னைப் பற்றி உரையாற்ற மக்களிடையே) எழுந்து நின்றார்கள். ஏகத்துவ உறுதிமொழி கூறி, அல்லாஹ்வை அவன் தகுதிக்கேற்ப போற்றிப் புகழ்ந்துவிட்டு, \"என் வீட்டார்மீது அபாண்டமாகப் பழி சுமத்தியவர்கள் விஷயத்தில் (அவர்களை என்ன செய்வதென்று) எனக்கு ஆலோசனை கூறுங்கள். அல்லாஹ்வின் மீது சத்தியமாக! என் வீட்டாரிடம் எந்தக் கெட்டப்பழக்கத்தையும் நான் காணவில்லை. அல்லாஹ்வின் மீதாணையாக! எவரிடம் எந்தத் தீய நடத்தையையும் நான் காணவில்லையோ அத்தகைய ஒருவருடன் என் வீட்டாரை இணைத்து அவர்கள் பழி சுமத்தியுள்ளார்கள். நான் இருக்கும்போதே தவிர வேறெப்போதும் அவர் என் வீட்டினுள் நுழைந்ததில்லை. நான் பயணத்தில் வெளியே செல்லும்போதெல்லாம், அவரும் என்னுடனேயே இருப்பார்\" என்று சொன்னார்கள் என ஹதீஸ் ஆரம்பமாகி மற்ற விவரங்கள் மேற்கண்ட ஹதீஸில் உள்ளதைப் போன்றே இடம்பெற்றுள்ளன. மேலும், இந்த அறிவிப்புகளில், \"அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என் வீட்டிற்கு வந்திருந்து என் பணிப்பெண்ணிடம் என்னைப் பற்றிக் கேட்டிருந்தார்கள். அவள், \"அல்லாஹ்வின் மீதாணையாக! ஆடு நுழைந்து அவர் \"குழைத்துவைத்த மாவை\" அல்லது \"அவர் பிசைந்துவைத்த மாவை\"த் தின்றுவிட்டுச் செல்லும் அளவுக்கு (மெய்மறந்து) உறங்கி விடுவார் என்பதைத் தவிர வேறு எந்தக் குறையையும் நான் (ஆயிஷாவிடம்) அறிய வில்லை\" என்று சொல்லியிருந்தாள். அப்போது நபி (ஸல்) அவர்களின் தோழர்களில் ஒருவர் அவளை அதட்டி, \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் உண்மையைச் சொல்\" என்று அவளிடம் வெளிப்படையாக விஷயத்தை விளக்கினார். அப்போது அவள், \"அல்லாஹ் தூயவன். அல்லாஹ்வின் மீதாணையாக! பொற்கொல்லன், (தூய்மையான) சிவப்புத் தங்கக்கட்டியை எப்படி மாசு மருவற்றதாகக் கருதுவானோ அவ்வாறே நான் அவரைக் கருதுகிறேன்\" என்று சொன்னாள். எந்த மனிதருடன் (என்னை இணைத்து) அவதூறு பேசப்பட்டதோ அந்த மனிதருக்கும் இந்த விஷயம் எட்டியது. அவர் \"சுப்ஹானல்லாஹ் (அல்லாஹ் தூயவன்). நான் ஒருபோதும் எந்த (அந்நியப்) பெண்ணின் ஆடையையும் அகற்றியதில்லையே!\" என்று சொன்னார். பிறகு அவர் அல்லாஹ்வின் பாதையில் (ஓர் அறப்போரில்) வீரமரணம் அடைந்தார். மேலும், ஆயிஷா (ரலி) அவர்கள் இவ்வாறு கூறியதாகக் கூடுதலாக இடம்பெற்றுள்ளது: (முஸ்லிம்களில்) அதைப் பற்றிப் பேசியவர்கள் மிஸ்தஹும் ஹம்னாவும் ஹஸ்ஸானும் ஆவர். நயவஞ்சகன் \"அப்துல்லாஹ் பின் உபை\"தான் (நடக்காத ஒன்றை நடந்ததாக) ஜோடித்து, அதைப் பரப்பிவந்தவன் ஆவான். அவதூறு பரப்பியவர்களில் பெரும்பங்கு வகித்தவனும் அவன்தான்; ஹம்னாவும்கூட. அத்தியாயம் : 49",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 67
			}
		}
	]
}