{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"52": "Characteristics of the Day of Judgment, Paradise, and Hell"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7065,
			"arabicnumber": "2797",
			"text": "அபூஹுரைரா (ரலி) அவர்கள் கூறியதாவது: (மக்காவில் ஒரு முறை) அபூஜஹ்ல், \"உங்களிடையே முஹம்மத் (இறைவனை வணங்குவதற்காக) மண்ணில் தமது முகத்தை வைக்கிறாரா?\" என்று கேட்டான். அப்போது \"ஆம்\" என்று சொல்லப்பட்டது. அவன், \"லாத் மற்றும் உஸ்ஸாவின் மீதாணையாக! அவ்வாறு அவர் செய்துகொண்டிருப்பதை நான் கண்டால், அவரது பிடரியின் மீது நிச்சயமாக நான் மிதிப்பேன்; அல்லது அவரது முகத்தை மண்ணுக்குள் புதைப்பேன்\" என்று சொன்னான். அவ்வாறே, அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுதுகொண்டிருந்தபோது, அவர்களது பிடரியின் மீது மிதிப்பதற்காக அவர்களை நோக்கி வந்தான். அப்போது அவன் தன் கைகளால் எதிலிருந்தோ தப்பிவருவதைப் போன்று சைகை செய்தவாறு வந்தவழியே பின்வாங்கி ஓடினான். இதைக் கண்ட மக்கள் திடுக்குற்றனர். அவனிடம், \"உனக்கு என்ன நேர்ந்தது?\" என்று கேட்கப்பட்டது. அதற்கு அவன், \"எனக்கும் அவருக்குமிடையில் நெருப்பாலான அகழ் ஒன்றையும் பீதியையும் இறக்கைக(ள் கொண்ட வானவர்)களையும் கண்டேன்\" என்று சொன்னான். (இதைப் பற்றிக் கூறுகையில்) அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"அவன் மட்டும் என்னை நெருங்கியிருந்தால் அவனுடைய உறுப்புகளை ஒவ்வொன்றாக வானவர்கள் பிய்த்தெடுத்திருப்பார்கள்\" என்று சொன்னார்கள். ஆகவே வல்லமையும் மாண்பும் மிக்க அல்லாஹ், \"அவ்வாறில்லை! தன்னைத் தன்னிறைவு பெற்றவன் எனக் கருதியதால் மனிதன் எல்லை மீறுகிறான். உம்முடைய இறைவனிடமே திரும்பிச் செல்ல வேண்டியுள்ளது. தொழும் அடியாரைத் தடுப்பவனை நீர் பார்க்க வில்லையா? அவர் நல்வழியில் இருப்பதையோ, அல்லது இறையச்சத்தை ஏவுவதையோ அவன் (அபூஜஹ்ல்) பொய்யெனக் கருதி அலட்சியம் செய்வதை நீர் கவனித்தீரா? அல்லாஹ் பார்க்கின்றான் என்பதை அவன் அறியவில்லையா? அவ்வாறில்லை. அவன் விலகிக்கொள்ளவில்லையானால் முன்நெற்றியைப் பிடிப்போம். அது குற்றமிழைத்துப் பொய் கூறிய (மனிதனின்) முன்நெற்றி. அவன் தன் சபையோரை அழைத்துப் பார்க்கட்டும்! நாம் நரகின் காவலர்களை அழைப்போம். எனவே, அவனுக்குக் கட்டுப்படாதீர்\" (96:6-19) எனும் வசனங்களை அருளினான். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் உபைதுல்லாஹ் பின் முஆத் (ரஹ்) அவர்களது அறிவிப்பில், \"அவனுக்கு அவர் எதைக் கட்டளையிட்டாரோ அதை அவன் பொய்யெனக் கருதி அலட்சியம் செய்வதை நீர் கவனித்தீரா?\" என்று கூடுதலாக இடம்பெற்றுள்ளது. முஹம்மத் பின் அப்தில் அஃலா (ரஹ்) அவர்களது அறிவிப்பில், \"அவன் தன் சபையோரை அழைக்கட்டும்\" என்பதற்கு, \"அவன் தன் சமுதாயத்தாரை அழைக்கட்டும்\" என்று பொருள் எனக் கூடுதலாக இடம்பெற்றுள்ளது. அத்தியாயம் : 50",
			"grades": [],
			"reference": {
				"book": 52,
				"hadith": 21
			}
		}
	]
}