{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7207,
			"arabicnumber": "2865.01",
			"text": "இயாள் பின் ஹிமார் அல்முஜாஷிஈ (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு நாள் உரையாற்றியபோது பின்வருமாறு கூறினார்கள்: அறிந்துகொள்ளுங்கள்: என் இறைவன் இன்றைய தினம் எனக்குக் கற்றுத் தந்தவற்றிலிருந்து நீங்கள் அறியாதவற்றை உங்களுக்குக் கற்றுத்தருமாறு எனக்குக் கட்டளையிட்டான். (இறைவன் கூறினான்:) நான் ஓர் அடியானுக்கு வெகுமதியாக வழங்கியுள்ள அனைத்துப் பொருட்களும் அவனுக்கு அனுமதிக்கப்பட்டவையே ஆகும். நான் என் அடியார்கள் அனைவரையும் (இயற்கையிலேயே) உண்மை வழி நின்றவர்களாகவே படைத்தேன். (ஆயினும்) அவர்களிடம் ஷைத்தான் வந்து அவர்களது இயற்கை நெறியிலிருந்து அவர்களைப் பிறழச்செய்துவிட்டான். நான் அவர்களுக்கு அனுமதித்துள்ளவற்றைத் தடைசெய்யப் பட்டவையாக ஆக்கிவிட்டான்; நான் எனக்கு இணை கற்பிப்பதற்கு எந்தச் சான்றையும் இறக்காத நிலையில் எனக்கு இணை கற்பிக்குமாறு அவர்களுக்குக் கட்டளையிட்டுவிட்டான். அல்லாஹ் பூமியில் வசித்துக்கொண்டிருப்போரைப் பார்த்து, அவர்களில் அரபியர், அரபியரல்லாதோர் அனைவர்மீதும் (அவர்கள் இணை கற்பித்துக்கொண்டிருந்ததால்) கடுங்கோபம் கொண்டான்; வேதக்காரர்களில் (இணைவைக்காமல்) எஞ்சியிருந்தோரைத் தவிர! மேலும் (என்னிடம்) இறைவன், நான் உம்மைச் சோதிப்பதற்கும் உம்மைக் கொண்டு (பிறரைச்) சோதிப்பதற்குமே உம்மை நான் அனுப்பினேன். (வெள்ள)நீரில் அழிந்துபோய்விடாத வேதத்தையும் உமக்கு நான் அருளினேன். அதை உறங்கும்போதும் விழித்திருக்கும் நிலையிலும் நீர் ஓதுகின்றீர்\" என்று கூறினான். மேலும், என் இறைவன் குறைஷியரை எரித்துவிடுமாறு எனக்குக் கட்டளையிட்டான். அப்போது நான் \"என் இறைவா! அவர்கள் என் தலையை நொறுக்கி ஒரு ரொட்டியைப் போன்று ஆக்கிவிடுவார்களே?\" என்று கூறினேன். இறைவன், \"உம்மை (உமது பிறந்தகத்திலிருந்து) அவர்கள் வெளியேற்றியதைப் போன்று அவர்களை நீர் வெளியேற்றிவிடும். அவர்களிடம் அறப்போர் புரியும். உமக்கு நாம் உதவுவோம். (நல்வழியில்) நீர் செலவிடும். உமக்கு நாம் செலவிடுவோம். (அவர்களை நோக்கி) ஒரு படையை அனுப்பும். அதைப் போன்று ஐந்து மடங்கு படையை நாம் அனுப்புவோம். உமக்குக் கீழ்ப்படிபவர்களுடன் சேர்ந்து உமக்கு மாறுசெய்வோருடன் நீர் போரிடும்\" என்று கூறினான். மேலும், சொர்க்கவாசிகள் மூவர் ஆவர். ஒருவர், நீதிநெறி வழுவாமல் வாரி வழங்கி நல்லறம் புரிய வாய்ப்பளிக்கப்படும் அரசர். இரண்டாமவர், உறவினர்களிடமும் மற்ற முஸ்லிம்களிடமும் அன்புடனும் இரக்கத்துடனும் நடந்துகொள்பவர். மூன்றாமவர், குழந்தை குட்டிகள் இருந்தும் (தவறான வழியில் பொருளீட்டிவிடாமல்) தன் மானத்துடனும் சுயமரியாதையுடனும் வாழ்கின்ற மனிதர். நரகவாசிகள் ஐவர் ஆவர். முதலாமவர், புத்தி சாதுர்யம் இல்லாத பலவீனர். அவர் (சுயகாலில் நிற்காமல்) உங்களையே பின்தொடர்வார். தமக்கென குடும்பத்தையோ செல்வத்தையோ தேடிக்கொள்ளமாட்டார். இரண்டாமவர்,எந்த ஆசையையும் விட்டுவைக்காத மோசடிக்காரர். அற்பமானதே ஆனாலும் மோசடி செய்(தாவது அதை அடை)யாமல் விடமாட்டார். மூன்றாமவர், காலையிலும் மாலையிலும் உம்முடைய வீட்டார் விஷயத்திலும் உமது செல்வம் விஷயத்திலும் உமக்குத் துரோகமிழைப்பவர். (நரகவாசிகளின் குணங்களில் நான்காவதாக) கருமித்தனத்தை அல்லது பொய்யைக் கூறினார்கள். ஐந்தாமவன், \"அதிகமாக அருவருப்பாகப் பேசுகின்ற ஒழுங்கீனன்\" என்று குறிப்பிட்டார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர் தொடர்களில் வந்துள்ளது. அவற்றில் அபூஃகஸ்ஸான் அல்மிஸ்மஈ (ரஹ்) அவர்களது அறிவிப்பில், \"நல்வழியில் செலவிடுவீராக! உமக்கு நாம் செலவிடுவோம்\" எனும் குறிப்பு இடம்பெறவில்லை. - மேற்கண்ட ஹதீஸ், இயாள் பின் ஹிமார் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில், \"நான் ஓர் அடியானுக்கு வெகுமதியாக வழங்கியுள்ள அனைத்துப் பொருட்களுமே (அவனுக்கு) அனுமதிக்கப்பட்டவையாகும்\" எனும் குறிப்பு இல்லை. - மேற்கண்ட ஹதீஸ் இயாள் பின் ஹிமார் (ரலி) அவர்களிடமிருந்தே மற்றோர் அறிவிப்பாளர் தொடர் வழியாகவும் வந்துள்ளது. அதில் \"அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஒரு நாள் உரையாற்றினார்கள்\" என்று ஹதீஸ் ஆரம்பமாகிறது. அத்தியாயம் : 51",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 76
			}
		}
	]
}