{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7386,
			"arabicnumber": "2942.01",
			"text": "ஆமிர் பின் ஷராஹீல் அஷ்ஷஅபீ (ரஹ்) அவர்கள் கூறியதாவது: நான் ளஹ்ஹாக் பின் கைஸ் (ரலி) அவர்களின் சகோதரியும், முந்திய முஹாஜிர்களில் ஒருவருமான ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்களிடம், \"நீங்கள் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்து செவியுற்ற ஹதீஸ் ஒன்றை எனக்கு அறிவியுங்கள். அது (நேரடியாக) நீங்கள் அல்லாஹ்வின் தூதரிடமிருந்து கேட்டதாக இருக்க வேண்டும். பிறர் மூலம் கேட்டதாக இருக்க வேண்டாம்\" என்று கேட்டேன். அப்போது ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்கள், \"நீங்கள் விரும்பினால் நிச்சயமாக அவ்வாறே செய்கிறேன்\" என்றார்கள். நான் \"ஆம் (அவ்வாறுதான் நான் விரும்புகிறேன்); எனக்கு ஹதீஸ் அறிவியுங்கள்\" என்றேன். ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்கள் கூறினார்கள்: நான் அன்றைய குறைஷி இளைஞர்களில் சிறந்தவர்களில் ஒருவரான முஃகீராவின் புதல்வருக்கு வாழ்க்கைப்பட்டிருந்தேன். அவர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் செய்த முதல் போரில் காயப்படுத்தப்பட்ட(வர் ஆவா)ர். (அவர் என்னை மணவிலக்குச் செய்து) நான் விதவையாயிருந்தபோது, என்னை அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் தோழர்களில் ஒரு குழுவினர் பெண் கேட்டார்கள். அவர்களில் அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களும் ஒருவராவார். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களும் தம்மால் விடுதலை செய்யப்பட்ட அடிமையின் புதல்வரான உசாமா பின் ஸைத் அவர்களுக்காக என்னைப் பெண் கேட்டார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"என்னை நேசிப்பவர்,உசாமாவையும் நேசிக்கட்டும்\" என்று கூறிய செய்தியை நான் அறிந்திருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் என்னிடம் பேசியபோது, \"என் காரியம் உங்கள் கையில் உள்ளது. நீங்கள் நாடியவருக்கு என்னை மணமுடித்து வையுங்கள்\" என்று கூறினேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"நீ உம்மு ஷரீக்கின் இல்லத்துக்குச் சென்று தங்கி இரு\" என்று சொன்னார்கள் - உம்மு ஷரீக் (ரலி) அவர்கள் அன்சாரிகளில் வசதி படைத்த பெண்மணியாகவும் அல்லாஹ்வின் பாதையில் பெருமளவில் செலவு செய்யக் கூடியவராகவும் இருந்தார். அவரது இல்லத்தில் விருந்தாளிகள் தங்குவார்கள்.- \"அவ்வாறே செய்கிறேன்\" என்று நான் கூறினேன். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், \"(வேண்டாம்;) அப்படிச் செய்யாதே! உம்மு ஷரீக் ஏராளமான விருந்தாளிகளை உபசரிக்கும் ஒரு பெண்மணி ஆவார். உன் முகத்திரையோ உன் கணைக்காலிலிருந்து ஆடையோ விலகியிருக்க, நீ விரும்பாத சிலவற்றை மக்கள் பார்க்கும் நிலை ஏற்படுவதை நான் வெறுக்கிறேன். எனவே, நீ உன் தந்தையின் சகோதரரான (அம்ர் - உம்மு மக்தூம் தம்பதியரின் புதல்வரான) அப்துல்லாஹ் பின் அம்ர் பின் உம்மி மக்தூம் அவர்களின் இல்லத்துக்குச் சென்று தங்கியிரு\" என்று கூறினார்கள். (அப்துல்லாஹ் பின் அம்ர் பின் உம்மி மக்தூம் குறைஷிக் குலத்திலுள்ள பனூ ஃபிஹ்ர் கிளையைச் சேர்ந்தவர் ஆவார். அந்தக் குடும்பத்தில் ஒருவராக ஃபாத்திமா பின்த் கைஸ் இருந்தார்.) அவ்வாறே நான் அவரது இல்லத்திற்குச் சென்று தங்கினேன். என் காத்திருப்புக் காலம் (\"இத்தா\") முடிந்தபோது அல்லாஹ்வின் தூதர் (ஸல்) அவர்களின் பொது அறிவிப்பாளர்களில் ஒருவர், \"கூட்டுத் தொழுகைக்கு வாருங்கள்\" என்று அறிவிப்புச் செய்வதை நான் செவியுற்றேன். ஆகவே, நான் பள்ளிவாசலுக்குச் சென்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தொழுகையை நிறைவேற்றினேன். அப்போது நான் ஆண்களின் தொழுகை வரிசைக்குப் பின்னால் உள்ள பெண்களின் தொழுகை வரிசையில் இருந்தேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்துச் சொற்பொழிவு மேடை (மிம்பர்)மீது சிரித்தபடியே அமர்ந்தார்கள். \"ஒவ்வொருவரும் தாம் தொழுத இடத்தில் அப்படியே இருங்கள்\" என்று கூறினார்கள். பிறகு, \"நான் உங்களை ஏன் ஒன்று கூட்டினேன் என்று உங்களுக்குத் தெரியுமா?\" என்று கேட்டார்கள். மக்கள், \"அல்லாஹ்வும் அவனுடைய தூதருமே நன்கறிந்தவர்கள்\" என்று பதிலளித்தார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள்: அல்லாஹ்வின் மீதாணையாக! உங்களுக்கு ஆர்வமூட்டுவதற்கோ அச்சுறுத்துவதற்கோ நான் உங்களை ஒன்றுகூட்டவில்லை. மாறாக, (மற்றொரு தகவலைச் சொல்வதற்காகவே) உங்களை ஒன்றுகூட்டினேன். கிறித்தவ மதத்தைச் சேர்ந்த தமீமுத் தாரீ எனும் ஒரு மனிதர் (என்னிடம்) வந்து வாக்குறுதிப் பிரமாணம் அளித்து இஸ்லாத்தை ஏற்றுக்கொண்டார். அவர் என்னிடம் ஒரு செய்தியைச் சொன்னார். அது(பெருங்குழப்பவாதியான) மசீஹுத் தஜ்ஜால் குறித்து நான் உங்களிடம் தெரிவித்திருந்த செய்திக்கு ஒத்திருந்தது. அவர் என்னிடம் கூறினார்: நான் \"லக்ம்\" , \"ஜுதாம்\" ஆகிய குலங்களைச் சேர்ந்த முப்பது பேருடன் ஒரு கப்பலில் கடல் பயணம் மேற்கொண்டேன். அப்போது கடல் அலை ஒரு மாதகாலம் எங்களைக் கடலில் அலைக் கழித்துவிட்டது. பிறகு நாங்கள் கடலில் சூரியன் அஸ்தமிக்கும் (மேற்குத்) திசையில் ஒரு தீவில் ஒதுங்கினோம். பிறகு நாங்கள் சிறிய மரக்கலம் ஒன்றில் அமர்ந்து அங்கிருந்த தீவுக்குள் சென்றோம். அங்கு (உடல் முழுவதும் அடர்ந்த) முடிகள் நிறைந்த ஒரு பிராணி எங்களைச் சந்தித்தது. அதன் முன்பகுதி எது,பின்பகுதி எது என்றே எங்களால் அறிய முடியவில்லை. (உடல் முழுவதும்) முடிகள் நிறைந்திருந்ததே அதற்குக் காரணம். அப்போது நாங்கள், \"உனக்குக் கேடுதான். நீ யார்?\" என்று கேட்டோம். அதற்கு அந்தப் பிராணி \"நான்தான் ஜஸ்ஸாஸா\"என்று சொன்னது. \"ஜஸ்ஸாஸா என்றால் என்ன?\" என்று நாங்கள் கேட்டோம். அதற்கு அந்தப் பிராணி, \"கூட்டத்தாரே! இந்த மண்டபத்திற்கு உள்ளே இருக்கும் மனிதரை நோக்கிச் செல்லுங்கள். அவர் உங்களைப் பற்றிய செய்தி அறிய ஆவலாக உள்ளார்\" என்று சொன்னது. அந்தப் பிராணி ஒரு மனிதனைப் பற்றிக் குறிப்பிட்டதைக் கேட்டு அது ஷைத்தானாக இருக்குமோ என்று நாங்கள் பயந்துவிட்டோம். உடனே நாங்கள் அந்த மனிதனை நோக்கி விரைந்து நடந்தோம். நாங்கள் அந்த மண்டபத்தைச் சென்றடைந்தோம். அங்கு மாபெரும் உருவமுடைய மனிதன் ஒருவன் இருந்தான். அவனைப் போன்ற ஒரு படைப்பை நாங்கள் ஒருபோதும் கண்டதில்லை. அவன் சங்கிலியால் பிணைக்கப்பட்டிருந்தான். அவனுடைய கைகள் அவனது தோளோடு சேர்த்து வைத்து இறுகக்கட்டப்பட்டிருந்தன. அவனுடைய முழங்கால்கள் கணுக்கால்களோடு சேர்த்துச் சங்கிலியால் பிணைக்கப்பட்டிருந்தன. அவனிடம் நாங்கள், \"உனக்குக் கேடுதான். நீ யார்?\" என்று கேட்டோம். \"என்னைப் பற்றிய தகவலை நிச்சயம் நீங்கள் அறிந்துகொள்வீர்கள். (முதலில்) நீங்கள் யார் என்று கூறுங்கள்?\" என்று கேட்டான். \"நாங்கள் அரபு மக்கள். நாங்கள் கப்பலொன்றில் கடல் பயணம் மேற்கொண்டோம். கடல் கொந்தளிப்பு ஏற்பட்டு ஒரு மாதகாலமாகக் கடல் அலை எங்களை அலைக்கழித்துவிட்டது. பிறகு நீயிருக்கும் இந்தத் தீவில் நாங்கள் கரை ஒதுங்கினோம். பிறகு நாங்கள் சிறிய மரக்கலம் ஒன்றில் அமர்ந்து இந்தத் தீவுக்குள் நுழைந்தோம். அப்போது உடல் முழுவதும் அடர்ந்த முடிகள் கொண்ட பிராணி ஒன்று எங்களைச் சந்தித்தது. உடல் முழுவதும் முடிகள் நிறைந்திருந்த காரணத்தால் அதன் முன்பகுதி எது, பின்பகுதி எது என்று அறிய முடியவில்லை. நாங்கள் \"உனக்குக் கேடுதான். நீ யார்?\" என்று கேட்டோம். அது \"நான்தான் ஜஸ்ஸாஸா\" என்று சொன்னது. \"ஜஸ்ஸாஸா என்றால் என்ன?\" என்று கேட்டோம். அதற்கு அது, \"இந்த மண்டபத்திலுள்ள இந்த மனிதரை நோக்கிச் செல்லுங்கள். அவர் உங்களைப் பற்றிய செய்தியை அறிய பெரும் ஆவலுடன் இருக்கிறார்\" என்று கூறியது. ஆகவேதான், நாங்கள் உன்னை நோக்கி விரைந்து வந்தோம். அது ஷைத்தானாக இருக்கலாம் என்பதால் எங்களால் அச்சம் கொள்ளாமல் இருக்க முடியவில்லை\" என்று சொன்னோம். அப்போது அவன், \"பைசான் பேரீச்சந்தோட்டத்தைப் பற்றி எனக்குச் சொல்லுங்கள்\" என்றான். \"அந்தத் தோட்டத்தில் நீ எதைப் பற்றிக் கேட்கிறாய்?\" என்று கேட்டோம். அதற்கு அவன், \"அந்தப் பேரீச்சந்தோட்டத்தின் மரங்கள் கனிகள் தருகின்றனவா என்பதைப் பற்றியே நான் கேட்கிறேன்\" என்றான். நாங்கள் \"ஆம்\" என்று பதிலளித்தோம். அவன், \"அறிந்துகொள்ளுங்கள். அது கனியே தராத காலம் நெருங்கிக்கொண்டிருக்கிறது\" என்று கூறினான். பிறகு \"தபரிய்யா நீர்நிலை பற்றி எனக்குச் சொல்லுங்கள்\" என்று கேட்டான். \"அதில் எதைப் பற்றி நீ கேட்கிறாய்?\"என்று நாங்கள் கேட்டோம். அதற்கு அவன், \"அதில் தண்ணீர் இருக்கிறதா?\" என்று கேட்டான். நாங்கள், \"அதில் தண்ணீர் அதிகமாக இருக்கிறது\" என்று பதிலளித்தோம். அவன், \"அறிந்துகொள்ளுங்கள்: அதிலுள்ள நீர் வற்றும் காலம் நெருங்கிவிட்டது\" என்று சொன்னான். பிறகு, \"(ஷாம் நாட்டிலுள்ள) ஸுஃகர் நீரூற்றைப் பற்றி எனக்குச் சொல்லுங்கள்\" என்று கேட்டான். நாங்கள், \"அதில் எதைப் பற்றி நீ கேட்கிறாய்?\" என்றோம். அதற்கு அவன், \"அந்த ஊற்றில் தண்ணீர் உள்ளதா? அந்த ஊற்றுத் தண்ணீரால் மக்கள் பயிர் செய்கிறார்களா?\" என்று கேட்டான். நாங்கள் \"ஆம், அதில் தண்ணீர் அதிகமாக உள்ளது. அங்குள்ளவர்கள் அந்தத் தண்ணீரால் விவசாயம் செய்கிறார்கள்\" என்று சொன்னோம். பிறகு அவன், \"எழுத்தறிவற்ற மக்களின் இறைத்தூதர் பற்றி எனக்குச் சொல்லுங்கள். அவர் (இப்போது) என்ன செய்கிறார்?\" என்று கேட்டான். நாங்கள், \"அவர் மக்காவிலிருந்து புறப்பட்டுச் சென்று யஸ்ரிபில் (மதீனாவில்) தங்கியிருக்கிறார்\" என்று பதிலளித்தோம். அவன், \"அவருக்கும் அரபியருக்குமிடையே போர் நடந்ததா?\" என்று கேட்டான். நாங்கள், \"ஆம்\" என்றோம். அவன், \"அவர்களை அவர் என்ன செய்தார்?\" என்று கேட்டான். நாங்கள், \"அவர், தம் அருகிலுள்ள அரபியரை வெற்றி கொண்டுவிட்டார். அரபியர் அவருக்குக் கட்டுப்பட்டு விட்டனர்\" என்று சொன்னோம். அதற்கு அவன், \"அப்படித்தான் நடந்ததா?\" என்று கேட்டான். நாங்கள் \"ஆம்\" என்றோம். அவன், \"அறிந்துகொள்ளுங்கள். அவருக்குக் கட்டுப்பட்டு நடப்பதே அவர்களுக்கு நல்லதாகும். (இனி) நான் என்னைப் பற்றி உங்களுக்குச் சொல்கிறேன்: நான்தான் மசீஹ் (அத்தஜ்ஜால்) ஆவேன். நான் (இங்கிருந்து) புறப்பட அனுமதிக்கப்படும் நாள் நெருங்கிக்கொண்டிருக்கிறது. நான் புறப்பட்டு வந்து, நாற்பது நாட்களில் பூமியில் எந்த ஓர் ஊரையும் விட்டுவைக்காமல் பூமியெங்கும் பயணம் செய்வேன்; மக்காவையும் தைபாவையும் தவிர! அவ்விரண்டிற் குள்ளேயும் நுழைவது எனக்குத் தடை விதிக்கப்பட்டுள்ளது. அவ்விரு நகரங்களில் ஏதேனும் ஒன்றில் நுழைய நான் நாடும்போதெல்லாம் என்னை நோக்கி வானவர் ஒருவர் வருவார். அவரது கையில் உருவியவாள் இருக்கும். (அதை வைத்து) அதற்குள் நுழைய விடாமல் அவர் என்னைத் தடுத்துவிடுவார். அதன் ஒவ்வொரு நுழைவாயிலிலும் வானவர் ஒருவர் இருந்து, அதைக் காவல் காத்துக்கொண்டிருப்பார்\" என்று கூறினான். இதைக் கூறியபின் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், தம்மிடமிருந்த கைத்தடியால் சொற்பொழிவு மேடைமீது குத்தியவாறு இது -அதாவது மதீனா நகரம்-தான் தைபா; இதுதான் தைபா; இதுதான் தைபா\" என்று கூறிவிட்டு, \"இதைப்பற்றி நான் உங்களுக்கு (முன்பே) அறிவித்துள்ளேன் அல்லவா?\" என்று கேட்டார்கள். மக்கள், \"ஆம் (அறிவித்தீர்கள்)\" என்று பதிலளித்தனர். \"தமீமுத் தாரீ சொன்ன இந்தச் செய்தி, தஜ்ஜாலைப் பற்றியும் மதீனா மற்றும் மக்கா பற்றியும் நான் ஏற்கெனவே உங்களிடம் நான் கூறியிருந்ததற்கு ஒப்பவே அமைந்திருக்கிறது\" என்று கூறினார்கள். பிறகு அறிந்துகொள்ளுங்கள்: அ(ந்தத் தீவான)து, ஷாம் நாட்டுக் கடலில், அல்லது யமன் நாட்டுக் கடலில் உள்ளது. இல்லை; அது கிழக்குப் பகுதிக் கடலில் உள்ளது. அது கிழக்குப் பகுதிக் கடலில் உள்ளது. அது கிழக்குப் பகுதி கடலில் உள்ளது\" என்று (அறுதியிட்டுச்) சொன்னார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் இதைக் கூறும்போது கிழக்குத் திசையை நோக்கி தமது கரத்தால் சைகை செய்தார்கள். ஃபாத்திமா பின்த் கைஸ் (ரலி) அவர்கள் கூறினார்கள்: இதை நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடமிருந்தே மனனமிட்டேன். இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 52",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 147
			}
		}
	]
}