{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "நபி (ஸல்) அவர்கள் கூறினார்கள்: பனூ இஸ்ராயீல் மக்களில் மூன்று பேர் இருந்தனர். அவர்களில் ஒருவர் தொழு நோயாளியாகவும் மற்றொருவர் வழுக்கைத் தலையராகவும் இன்னொருவர் குருடராகவும் இருந்தனர். அல்லாஹ் அம்மூவரையும் சோதிக்க நாடினான்;எனவே, வானவர் ஒருவரை அவர்களிடம் அனுப்பினான். அந்த வானவர் தொழுநோயாளியிடம் வந்து, \"உனக்கு மிகவும் விருப்பமானது எது?\" என்று கேட்க அவர், \"நல்ல நிறம்,நல்ல தோல்(தான் எனக்கு மிகவும் விருப்பமானவை). மக்கள் என்னை அருவருப்பாகக் கருதக் காரணமான இ(ந்த நோயான)து என்னைவிட்டு விலக வேண்டும்\" என்று சொன்னார். உடனே அவ்வானவர் (இறைநாட்டப்படி) அவரைத் தம் கைகளால் தடவ அந்த அருவருப்பான நோய் அவரைவிட்டு விலகியது. மேலும், அவருக்கு நல்ல நிறமும் நல்ல தோலும் வழங்கப்பட்டன. பிறகு அவ்வானவர், \"செல்வங்களில் உமக்கு மிகவும் விருப்பமானது எது?\" என்று கேட்க, அவர், \"ஒட்டகம்தான்\" என்றோ அல்லது \"பசு மாடுதான்\" என்றோ பதிலளித்தார். -தொழுநோயாளி மற்றும் வழுக்கைத் தலையர் ஆகிய இருவரில் ஒருவர் ஒட்டகம் என்றோ பசுமாடு என்றோ கூறினார் என இஸ்ஹாக் (ரஹ்) அவர்கள் சந்தேகிக்கிறார்கள்.- ஆகவே, பத்து மாத சினையுள்ள ஒட்டகம் ஒன்று அவருக்கு வழங்கப்பட்டது. அவ்வானவர், \"இதில் உனக்கு இறைவன் வளம் (பரக்கத்) வழங்குவானாக!\" என்று பிரார்த்தித்தார். அடுத்து அந்த வானவர் வழுக்கைத் தலையரிடம் சென்று, \"உனக்கு மிகவும் விருப்பமானது எது?\" என்று கேட்டார். அவர் அழகான முடிதான். மக்கள் வெறுக்கும் இந்த வழுக்கை என்னைவிட்டு நீங்க வேண்டும்\" என்றார். உடனே அவ்வானவர், அவரது தலையைத் தடவினார்; வழுக்கை மறைந்தது; அழகிய முடியைப் பெற்றார். அவ்வானவர், \"செல்வங்களில் உமக்கு மிகவும் விருப்பமானது எது?\" என்று கேட்டார். அவர், \"பசுமாடுதான் (எனக்கு மிகவும் விருப்பமான செல்வம்)\" என்று சொன்னார். உடனே அவ்வானவர் அந்த வழுக்கைத் தலையருக்குச் சினையுற்ற பசுமாடு ஒன்றைக் கொடுத்து, \"அல்லாஹ் உமக்கு இதில் வளம் (பரக்கத்) புரிவானாக\" என்று பிரார்த்தித்தார். பிறகு அந்த வானவர் குருடரிடம் சென்று, \"உனக்கு மிகவும் விருப்பமானது எது?\" என்று கேட்க, அவர் \"அல்லாஹ் என் பார்வையை எனக்குத் திரும்பச் செய்வதும், அதன் மூலம் மக்களை நான் பார்ப்பதும்தான் (எனக்கு மிகவும் விருப்பமானது)\" என்று பதிலளித்தார். உடனே அவ்வானவர் அவரைத் தமது கரத்தால் தடவ, அவருக்கு அல்லாஹ் அவரது பார்வையைத் திருப்பித் தந்தான். பிறகு அவ்வானவர், \"செல்வங்களில் உமக்கு மிகவும் விருப்பமானது எது?\" என்று கேட்டார். அவர் \"ஆடு\" என்றார். அவருக்கு அவ்வானவர், சினையுற்ற ஆடு ஒன்றைக் கொடுத்தார். (ஒட்டகமும் மாடும் வழங்கப்பெற்ற) இருவரும் நிறைய குட்டிகள் ஈந்திடப்பெற்றனர். (ஆடு வழங்கப்பட்ட) இந்த மனிதரும் நிறைய குட்டிகள் ஈந்திடப்பெற்றார். தொழுநோயாளியாய் இருந்தவருக்கு ஒரு பள்ளத்தாக்கு நிரம்ப ஒட்டகங்களும், வழுக்கைத் தலையராய் இருந்தவருக்கு ஒரு பள்ளத்தாக்கு நிரம்ப மாடுகளும், குருடராக இருந்தவருக்கு ஒரு பள்ளத்தாக்கு நிரம்ப ஆடுகளும் சேர்ந்தன. பிறகு அவ்வானவர் தொழுநோயாளியாய் இருந்தவரிடம் தமது அதே தோற்றத்திலும் அமைப்பிலும் சென்று, \"நான் ஓர் ஏழை மனிதன். என் பயணத்தில் வாழ்வாதாரம் அறுபட்டு விட்டது. (செலவுக்குப் பணம் தீர்ந்துபோய்விட்டது.) இன்று உதவிக்கான வழிவகை எனக்கு அல்லாஹ்வையும் பிறகு உன்னையும் தவிர வேறெவருமில்லை. உனக்கு அழகிய நிறத்தையும் நல்ல தோலையும் செல்வத்தையும் கொடுத்த (இறை)வனின் பெயரால் உன்னிடம் ஓர் ஒட்டகத்தைக் கேட்கிறேன். அதன் மீது பயணம் செய்து நான் போக வேண்டிய இடத்திற்குப் போய்ச்சேருவேன்\" என்று சொன்னார். அதற்கு அந்த மனிதர், \"(எனக்குக்)கடமைகள் நிறைய இருக்கின்றன. (எனவே, என்னால் நீ கேட்டதைத் தர முடியாது)\"என்றார். உடனே அவ்வானவர், \"உன்னை எனக்குத் தெரியும் போலுள்ளதே! மக்கள் அருவருக்கின்ற தொழுநோயாளியாக நீ இருக்கவில்லையா? ஏழையாகவும் நீ இருக்கவில்லையா? பிறகு அல்லாஹ் உனக்கு (செல்வத்தை)க் கொடுத்தான் அல்லவா?\" என்று கேட்டார். அதற்கு அவன், \"(இல்லையே; நான் இந்த அழகான நிறத்தையும் தோலையும் மற்றும்) இந்தச் செல்வத்தையும் வாழையடி வாழையாக (என் முன்னோரிடமிருந்து) வாரிசுச் சொத்தாகப் பெற்றேன்\" என்று பதிலளித்தான். உடனே அவ்வானவர், \"நீ (இக்கூற்றில்) பொய்யனாயிருந்தால், நீ முன்பு எப்படி இருந்தாயோ அப்படியே உன்னை அல்லாஹ் மாற்றிவிடட்டும்\" என்று சொன்னார். பிறகு வழுக்கைத் தலையரிடம் தமது அதே உருவத்தில் சென்று, முன்பு தொழுநோயாளியிடம் கேட்டதைப் போன்றே கேட்டார். அவரும் முதலாமவர் பதிலளித்ததைப் போன்றே பதிலளித்தார். வானவரும், \"நீ (உன் கூற்றில்) பொய்யனாயிருந்தால் நீ முன்பு எப்படியிருந்தாயோ அப்படியே அல்லாஹ் உன்னை மாற்றிவிடட்டும்\" என்று சொன்னார். பிறகு (இறுதியாக), குருடரிடம் தமது அதே உருவிலும் அமைப்பிலும் வந்து, \"நான் ஓர் ஏழை மனிதன்; வழிப்போக்கன். என் பயணத்தில் வாழ்வாதாரம் (வழிச் செலவுக்கான பணம்) தீர்ந்து போய்விட்டது. இன்று எனக்கு உதவிக்கான வழிவகை அல்லாஹ்வையும், பிறகு உன்னையும் தவிர வேறெவருமில்லை. என் பயணத்தில் என் தேவையைத் தீர்த்துக்கொள்ள உதவும் ஆடு ஒன்றைத் தரும்படி உனக்குப் பார்வையைத் தந்த(இறை)வன் பெயரால் கேட்கிறேன்\"என்று சொன்னார். (குருடராயிருந்து பார்வை பெற்ற) அந்த மனிதர் வானவரிடம், \"நான் குருடனாகத்தான் இருந்தேன். அல்லாஹ் எனக்குப் பார்வையைத் திருப்பித்தந்தான். நீர் விரும்புவதை எடுத்துக்கொள்க; விரும்புவதை விட்டுவிடுக. அல்லாஹ்வின் மீதாணையாக! இன்று நீர் எடுக்கின்ற எந்தப்பொருளையும் திருப்பித் தரும்படி அல்லாஹ்வுக்காக நான் சிரமப்படுத்தமாட்டேன்\" என்று சொன்னார். உடனே அவ்வானவர், \"உமது செல்வத்தை நீரே வைத்துக்கொள்ளும். இது உங்களைச் சோதிப்பதற்காகத்தான். உம்மீது திருப்தி கொள்ளப்பட்டது. உம்முடைய இரு தோழர்கள் (தொழுநோயாளி, வழுக்கைத்தலையர் ஆகியோர்)மீது சினம் கொள்ளப்பட்டது\" என்று சொன்னார். இதை அபூஹுரைரா (ரலி) அவர்கள் அறிவிக்கிறார்கள். அத்தியாயம் : 53",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		}
	]
}