{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 750,
			"arabicnumber": "332.03",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அஸ்மா பின்த் ஷகல் (ரலி) அவர்கள் நபி (ஸல்) அவர்களிடம், மாதவிடாய்க் குளியல் பற்றிக் கேட்டார். அதற்கு நபி (ஸல்) அவர்கள், உங்களில் ஒருவர் (மாதவிடாய்க் குளியலின் போது) தண்ணீரையும் இலந்தை இலைகளையும் எடுத்து நன்கு சுத்தம் செய்துகொள்ளட்டும். பிறகு தலைக்குத் தண்ணீர் ஊற்றி நன்றாகத் தேய்த்து தலையின் சருமம் நனையும்வரைக் கழுவட்டும். பிறகு உடம்புக்குத் தண்ணீர் ஊற்றட்டும். அதன் பின்னர் கஸ்தூரி தடவப்பட்ட பஞ்சுத்துண்டு ஒன்றை எடுத்து சுத்தம் செய்துகொள்ளட்டும் என்று சொன்னார்கள். அதற்கு அஸ்மா (ரலி) அவர்கள், அதை வைத்து அவள் எவ்வாறு சுத்தம் செய்வாள்? என்று கேட்டார்கள். நபி (ஸல்) அவர்கள், சுப்ஹானல்லாஹ் (அல்லாஹ் தூயவன்!). அதனால் சுத்தம் செய்துகொள்ளட்டும் என்று (மீண்டும்) சொன்னார்கள். உடனே நான், இரத்தம் படிந்த இடத்தில் தடவிக்கொள் என்று -பிறர் காதில் விழாதவாறு அதை இரகசியமாகச்- சொன்னேன். மேலும், அஸ்மா நபி (ஸல்) அவர்களிடம், பெருந்துடக்கிற்காகக் குளிக்கும் முறை பற்றிக் கேட்டார். அதற்கு அவர்கள்,தண்ணீர் எடுத்து நன்கு சுத்தம் செய்துகொள். பிறகு தலைக்குத் தண்ணீர் ஊற்றி தலையின் சருமம் நனையும் அளவுக்கு நன்கு தேய்த்துக்கொள். பின்னர் உன் (மேனியின்) மீது தண்ணீர் ஊற்று! என்றார்கள். ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: பெண்களிலேயே மிகச் சிறந்தவர்கள் அன்சாரிப் பெண்களாவர். மார்க்கத்தை விளங்கிக் கொள்வதில் வெட்கம் அவர்களுக்குத் தடையாக இருந்ததில்லை. இந்த ஹதீஸ் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. - மேற்கண்ட ஹதீஸ் மற்றோர் அறிவிப்பாளர்தொடர் வழியாகவும் வந்துள்ளது. அதில், அல்லாஹ் தூயவன்! அதனால் துப்புரவு செய்துகொள் என்று கூறிவிட்டு நபி (ஸல்) அவர்கள் தமது முகத்தை (வெட்கப்பட்டு) மறைத்துக்கொண்டார்கள் என்று இடம் பெற்றுள்ளது. - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அவற்றில் (பின்வருமாறு) இடம்பெற்றுள்ளது: ஆயிஷா (ரலி) அவர்கள் கூறினார்கள்: அஸ்மா பின்த் ஷகல் எனும் பெண்மணி அல்லாஹ்வின் தூதர் (ஸல்) அவர்களிடம் வந்து, அல்லாஹ்வின் தூதரே, எங்களில் ஒருவருக்கு மாதவிடாய் நின்று விட்டால் அவர் எவ்வாறு குளிக்க வேண்டும்? என்று கேட்டார். அதற்கு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் மேற்கண்ட ஹதீஸிலுள்ளபடி பதிலளித்தார்கள். இந்த அறிவிப்பில் பெருந்துடக்கிற்கான குளியலைப் பற்றியக் குறிப்பு இடம்பெறவில்லை. அத்தியாயம் : 3",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 72
			}
		}
	]
}