{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 904,
			"arabicnumber": "404.01",
			"text": "ஹித்தான் பின் அப்தில்லாஹ் அர்ரகாஷீ (ரஹ்) அவர்கள் கூறியதாவது: நான் அபூமுசா அல்அஷ்அரீ (ரலி) அவர்களுடன் ஒரு தொழுகையில் கலந்து கொண்டேன். அவர்கள் (தொழுகையில் அத்தஹிய்யாத்) அமர்வில் இருந்தபோது ஒரு மனிதர் உகிர்ரத்திஸ் ஸலாத்து பில்பிர்ரி வஸ்ஸகாத்தி (நன்மை,தானதருமம் ஆகியவற்றுடன் சேர்ந்து தொழுகையும் ஒரு கடமையாக ஏற்கப்பட்டுவிட்டது) என்று கூறினார். அபூமூசா (ரலி) அவர்கள் தொழுகையை முடித்து சலாம் கொடுத்துத் திரும்பியதும் உங்களில் இன்னின்ன வார்த்தையைக் கூறியவர் யார்? என்று கேட்டார்கள். அப்போது மக்கள் அமைதியாயிருந்தனர். மீண்டும் உங்களில் இன்னின்ன வார்த்தையைக் கூறியவர் யார்? என்று கேட்டார்கள். அப்போதும் மக்கள் அமைதியாயிருந்தனர். பிறகு அவர்கள் (என்னிடம்), ஹித்தான்! நீங்கள்தாம் அதைக் கூறியிருக்க வேண்டும் என்று சொல்ல, அதை நான் கூறவில்லை. அதை நான் சொன்னதாக நினைத்துக்கொண்டு என்னைக் கண்டிப்பீர்களென பயந்துவிட்டேன் என்றேன் நான். அப்போது மக்களில் ஒருவர் நான்தான் அவ்வாறு கூறினேன்.அதன் மூலம் நல்லதையே நாடினேன் என்று சொன்னார். அப்போது அபூமூசா (ரலி) அவர்கள் (பின்வருமாறு) கூறினார்கள்: உங்களுடைய தொழுகையி(ல் அமர்வி)ல் என்ன கூற வேண்டும் என்று உங்களுக்குத் தெரியாதா? நிச்சயமாக அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (ஒரு முறை) எங்களுக்கு உரையாற்றினார்கள். (அதில்) நாம் பின்பற்ற வேண்டிய வழிமுறையை எங்களுக்கு விளக்கிச் சொன்னார்கள். நாம் தொழ வேண்டிய முறையைக் கற்றுக்கொடுத்தார்கள். அப்போது அவர்கள் கூறினார்கள்: நீங்கள் தொழ ஆரம்பித்தால் உங்களுடைய தொழுகை வரிசைகளை ஒழுங்குபடுத்திக் கொள்ளுங்கள். பிறகு உங்களில் ஒருவர் உங்களுக்கு(தலைமை தாங்கி)த் தொழுவிக்கட்டும். அவர் (இமாம்), தக்பீர் கூறினால், நீங்களும் தக்பீர் கூறுங்கள். அவர் ஃகைரில் மஃக்ளூபி அலைஹிம் வலள் ளால்லீன் என்று கூறினால் நீங்கள் ஆமீன் என்று சொல்லுங்கள். (அவ்வாறு செய்தால்) அல்லாஹ் உங்களு(டைய பிரார்த்தனை)க்கு பதிலளிப்பான். பிறகு அவர் தக்பீர் கூறி ருகூஉச் செய்தால் நீங்களும் தக்பீர் கூறி ருகூஉச் செய்யுங்கள். நிச்சயமாக இமாம் உங்களுக்கு முன் ருகூஉச் செய்வார். உங்களுக்கு முன் (ருகூஉவிலிருந்து) எழுந்துவிடுவார். எனவே, இது (இமாம் உங்களுக்கு முன் ருகூஉச் செய்து, உங்களுக்கு முன் நிமிர்வது) அதற்கு (நீங்கள் இமாமுக்குப் பிறகு ருகூஉச் செய்து, இமாமுக்குப் பிறகு நிமிர்வதற்கு)ச் சமமாகிவிட்டது (அதாவது இருவருடைய ருகூஇன் நேரமும் சமமாகி விட்டது) என்று அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். மேலும், அவர் (இமாம்) சமிஅல்லாஹு லிமன் ஹமிதஹ் (தன்னைப் புகழ்வோரின் புகழுரையை அல்லாஹ் ஏற்றுக்கொள்கின்றான்) என்று கூறினால் அல்லாஹும்ம ரப்பனா லக்கல் ஹம்து (அல்லாஹ்வே! எங்கள் இறைவா! உனக்கே எல்லாப் புகழும்) என்று நீங்கள் கூறுங்கள். (அவ்வாறு செய்தால்) அல்லாஹ் உங்களுடைய புகழுரையைச் செவியேற்பான். திண்ணமாக அல்லாஹ் தன்னுடைய தூதரின் நாவின் மூலம் சமிஅல்லாஹு லிமன் ஹமிதஹ் என்று கூறினான். மேலும், அவர் (இமாம்) தக்பீர் கூறி சஜ்தாச் செய்தால் நீங்களும் தக்பீர் கூறி சஜ்தாச் செய்யுங்கள். நிச்சயமாக இமாம் உங்களுக்கு முன் சஜ்தாச் செய்வார். உங்களுக்கு முன் சஜ்தாலிருந்து எழுவார். எனவே இது (அதாவது இமாம் உங்களுக்கு முன் சஜ்தாச் செய்து, உங்களுக்கு முன் நிமிர்வது) அதற்கு (நீங்கள் இமாமுக்குப் பிறகு சஜ்தாச் செய்து, இமாமுக்குப் பிறகு எழுவதற்கு)ச் சமமாகிவிட்டது (அதாவது இருவருடைய சஜ்தாவின் நேரமும் சமமாகிவிட்டது) என்றும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் கூறினார்கள். மேலும், நீங்கள் அத்தஹிய்யாத் இருப்பில் அமர்ந்தால் உங்களுடைய முதல் சொல் இதுவாக இருக்கட்டும்: அத்தஹிய்யாத்துத் தய்யிபாத்துஸ் ஸலவாத்து லில்லாஹி. அஸ்ஸலாமு அலைக்க அய்யுஹந் நபிய்யு, வ ரஹ்மத் துல்லாஹி வ பரக்காத்துஹு. அஸ்ஸலாமு அலைனா வ அலா இபாதில்லாஹிஸ் ஸாலிஹீன். அஷ்ஹது அல் லாயிலாஹ இல்லல்லாஹு, வ அஷ்ஹது அன்ன முஹம்மதன் அப்துஹு வ ரசூலுஹு. (பொருள்: சொல், செயல், பொருள் சார்ந்த எல்லாக் காணிக்கைகளும் பாராட்டுகளும் வணக்கங்களும் அல்லாஹ்வுக்கே உரியன. நபியே! உங்கள்மீது சாந்தியும் அல்லாஹ்வின் அருளும் சுபிட்சமும் உண்டாகட்டுமாக! எங்கள்மீதும் அல்லாஹ்வின் நல்லடியார்கள் மீதும் சாந்தி உண்டாகட்டும்! அல்லாஹ்வைத் தவிர வேறு இறைவனில்லை என்று நான் உறுதிமொழிகிறேன். மேலும் முஹம்மத் (ஸல்) அவர்கள் அல்லாஹ்வின் அடியாரும் தூதருமாவார்கள் என்றும் உறுதிமொழிகிறேன்.) இந்த ஹதீஸ் நான்கு அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 4",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 66
			}
		}
	]
}