{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 941,
			"arabicnumber": "418.06",
			"text": "ஆயிஷா (ரலி) அவர்கள் கூறியதாவது: அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு நோய் கடுமையாயிருந்தபோது அவர்களைத் தொழுகைக்கு அழைப்பதற்காக பிலால் (ரலி) அவர்கள் வந்தார்கள். அப்போது அபூபக்ர் அவர்களை மக்களுக்குத் தொழுவிக்கச் சொல்லுங்கள்! என்று நபியவர்கள் கூறினார்கள். உடனே நான், அல்லாஹ்வின் தூதரே! (என் தந்தை) அபூபக்ர் (ரலி) அவர்கள் வேகமாகத் துக்கப்படுகின்றவர்; (தொழுகைக்காக) நீங்கள் நிற்குமிடத்தில் அவர்கள் நின்றால் (மனம் நெகிழ்ந்து அழுது கொண்டிருப்பார்கள்.) அவர்களால் (சப்தமிட்டு ஓதி) மக்கள் கேட்கும்படி செய்ய முடியாது. எனவே, உமர் (ரலி) அவர்களுக்குக் கட்டளையிட்டால் நன்றாயிருக்குமே! என்று சொன்னேன். அப்போது அபூபக்ரிடம் சொல்லுங்கள்; அவர் மக்களுக்குத் தொழுவிக்கட்டும் என்று (மீண்டும்) நபியவர்கள் சொன்னார்கள். உடனே நான் (மற்றொரு துணைவியாரான) ஹஃப்ஸாவிடம் அபூபக்ர் (ரலி) வேகமாகத் துக்கப்படுகின்றவர்; உங்களது இடத்தில் அவர் நின்றால் அவரால் மக்களுக்குக் கேட்கும்படி செய்ய முடியாது; உமர் (ரலி) அவர்களுக்கு நீங்கள் கட்டளையிட்டால் என்ன?என்று நபியவர்களிடம் கூறுங்கள் என்றேன். ஹஃப்ஸாவும் அவ்வாறே சொன்னார். அதற்கு (பெண்களாகிய) நீங்கள் யூசுஃபுடைய (அழகில் மயங்கிய) தோழிகள் போன்(று உள்நோக்கத்துடன் பேசுகின்)றவர்கள்தாம். மக்களுக்குத் தொழுவிக்கும்படி அபூபக்ரிடம் சொல்லுங்கள் என்று நபியவர்கள் கூறினார்கள். அவ்வாறே மக்கள் அபூபக்ர் (ரலி) அவர்களிடம் தங்களுக்குத் தொழுவிக்குமாறு கூறினர். அபூபக்ர் (ரலி) அவர்கள் தொழ ஆரம்பித்தார்கள். அப்போது அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தமது உடல்நலம் சற்றுத் தேறியிருப்பதைக் கண்டார்கள். உடனே எழுந்து இரண்டு மனிதர்களுக்கிடையே தொங்கியபடி தம் கால்கள் பூமியில் இழுபடப் புறப்பட்டார்கள். அவர்கள் பள்ளிவாசலுக்குள் வருவதை உணர்ந்த அபூபக்ர் (ரலி) அவர்கள் பின்வாங்க ஆரம்பித்தார்கள். உடனே அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள், உங்கள் இடத்திலேயே இருங்கள் என்று அபூபக்ர் (ரலி) அவர்களுக்கு சைகை செய்தார்கள். பிறகு அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் வந்து, அபூபக்ர் (ரலி) அவர்களுக்கு இடப் பக்கத்தில் அமர்ந்தார்கள். பின்னர் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் அமர்ந்துகொண்டு மக்களுக்குத் தொழுவிக்க, அபூபக்ர் (ரலி) அவர்கள் நின்றுகொண்டு தொழலானார்கள். நபி (ஸல்) அவர்களைப் பின்பற்றி அபூபக்ரும், அபூபக்ர் அவர்களைப் பின்பற்றி மக்களும் தொழுதார்கள். இந்த ஹதீஸ் மூன்று அறிவிப்பாளர்தொடர்களில் வந்துள்ளது. அத்தியாயம் : 4",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 103
			}
		}
	]
}