{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"4": "The Book of Prayers "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 952,
			"arabicnumber": "274.12",
			"text": "முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாவது: நான் அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுடன் தபூக் போரில் கலந்துகொண்டேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் ஃபஜ்ர் தொழுகைக்கு முன் இயற்கைக்கடனை நிறைவேற்றுவதற்காக ஒதுக்குப் புறத்திற்குச் சென்றார்கள். அப்போது அவர்களுடன் நான் ஒரு (தண்ணீர்)பாத்திரத்தை எடுத்துச் சென்றேன். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் (தமது தேவையை முடித்துவிட்டு) என்னிடம் திரும்பி வந்தபோது பாத்திரத்திலிருந்த தண்ணீரை அவர்களுடைய கைகளில் ஊற்றினேன். அவர்கள் (மணிக்கட்டுவரை) மூன்று முறை கைகளைக் கழுவினார்கள். பின்னர் முகத்தைக் கழுவினார்கள். பிறகு (முழங்கைவரைக் கழுவுவதற்காகத்) தமது நீளங்கியை முழங்கைகளிலிருந்து வெளியிலெடுக்க முயன்றார்கள். நீளங்கியின் கைப் பகுதி இறுக்கமாக இருந்த காரணத்தால் தம் கைகளை நீளங்கியில் நுழைத்து நீளங்கியின் கீழேயிருந்து கைகளை வெளியில் எடுத்தார்கள். பிறகு கைகைளை மூட்டுவரை கழுவினார்கள். பிறகு (கால்களைக் கழுவுவதற்கு பதிலாக) இரு காலுறைகள்மீதும் ஈரக் கையால் தடவி (மஸ்ஹுச் செய்யலா)னார்கள். பின்னர் (பள்ளிவாசலை நோக்கிச்) சென்றார்கள். நானும் அவர்களுடன் சென்றேன். அப்போது மக்கள் அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களைத் தொழுவிக்கச் சொல்லி (அவர்களுக்குப் பின்னால் நின்று) தொழுதுகொண்டிருந்தனர். அல்லாஹ்வின் தூதர் (ஸல்) அவர்களுக்கு (அந்தத் தொழுகையின்) இரு ரக்அத்களில் ஒரு ரக்அத்தான் கிடைத்தது. எனவே, கிடைத்த அந்த இறுதி ரக்அத்தை மக்களுடன் சேர்ந்து தொழுதார்கள். அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்கள் (தொழுகையை முடிப்பதற்காக) சலாம் கொடுத்ததும் அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் எழுந்து, (எஞ்சிய ஒரு ரக்அத்தைத் தொழுது) தமது தொழுகையை நிறைவு செய்தார்கள். இ(வ்வாறு நபியவர்களை முந்திக் கொண்டு தாங்கள் தொழுத)து, முஸ்லிம்களுக்கு அதிர்ச்சியளித்தது. ஆகவே, அவர்கள் பல முறை தஸ்பீஹ் கூறினார்கள். அல்லாஹ்வின் தூதர் (ஸல்) அவர்கள் தொழுகையை முடித்த பின் மக்களைப் பார்த்து, நீங்கள் செய்தது நல்லதுதான் அல்லது நீங்கள் செய்தது சரிதான் என்று குறித்த நேரத்தில் மக்கள் தொழுததைப் பாராட்டும் வகையில் கூறினார்கள். - மேற்கண்ட ஹதீஸ் மேலும் இரு அறிவிப்பாளர்தொடர்கள் வழியாகவும் வந்துள்ளது. அவற்றில், (நபி (ஸல்) அவர்கள் வந்ததும்) அப்துர் ரஹ்மான் பின் அவ்ஃப் (ரலி) அவர்களைப் பின்னுக்கு கொண்டுவர நான் நினைத்தேன். ஆனால், நபி (ஸல்) அவர்கள் அவரை விட்டுவிடுங்கள் (தொழுவிக்கட்டும்)! என்று கூறினார்கள் என முஃகீரா பின் ஷுஅபா (ரலி) அவர்கள் கூறியதாக இடம்பெற்றுள்ளது. அத்தியாயம் : 4",
			"grades": [],
			"reference": {
				"book": 4,
				"hadith": 114
			}
		}
	]
}