{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 117,
			"arabicnumber": 117,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ علی بن ابی طالب رضی اللہ عنہ استنجاء کر کے میرے پاس آئے، اور وضو کے لیے پانی مانگا، ہم ایک پیالہ لے کر ان کے پاس آئے جس میں پانی تھا یہاں تک کہ ہم نے انہیں ان کے سامنے رکھا تو انہوں نے مجھ سے کہا: اے ابن عباس! کیا میں تمہیں دکھاؤں کہ رسول اللہ صلی اللہ علیہ وسلم کس طرح وضو کرتے تھے؟ میں نے کہا: ہاں، ضرور دکھائیے، تو آپ نے برتن جھکا کر ہاتھ پر پانی ڈالا پھر اسے دھویا پھر اپنا داہنا ہاتھ ( برتن میں ) داخل کیا ( اور پانی لے کر ) اسے دوسرے پر ڈالا پھر اپنی دونوں ہتھیلیوں کو دھویا، پھر کلی کی اور ناک جھاڑی، پھر اپنے دونوں ہاتھ ( ملا کر ) ایک ساتھ برتن میں ڈالے اور لپ بھر پانی لیا اور اسے اپنے منہ پر مارا پھر دونوں انگوٹھوں کو کانوں کے اندر یعنی سامنے کے رخ پر پھیرا، پھر دوسری اور تیسری بار ( بھی ) ایسا ہی کیا، پھر اپنی داہنی ہتھیلی میں ایک چلو پانی لے کر اپنی پیشانی پر ڈالا اور اسے چھوڑ دیا، وہ آپ کے چہرے پر بہہ رہا تھا، پھر دونوں ہاتھ تین تین بار کہنیوں تک دھوئے، اس کے بعد سر اور دونوں کانوں کے اوپری حصہ کا مسح کیا، پھر اپنے دونوں ہاتھ پانی میں ڈال کر ایک لپ بھر پانی لیا اور اسے ( دائیں ) پیر پر ڈالا، اس وقت وہ پیر میں جوتا پہنے ہوئے تھے اور اس سے پیر دھویا پھر دوسرے پیر پر بھی اسی طرح پانی ڈال کر اسے دھویا ۱؎۔ عبیداللہ خولانی کہتے ہیں کہ میں نے ( عبداللہ بن عباس رضی اللہ عنہما سے ) پوچھا: علی رضی اللہ عنہ نے دونوں پیر میں جوتا پہنے پہنے ایسا کیا؟ آپ نے کہا: ہاں، جوتا پہنے پہنے کیا، میں نے کہا: جوتا پہنے پہنے؟ آپ نے کہا: ہاں، جوتا پہنے پہنے، پھر میں نے کہا: جوتا پہنے پہنے؟ آپ نے کہا: ہاں چپل پہنے پہنے۔ ابوداؤد کہتے ہیں: ابن جریج کی حدیث جسے انہوں نے شیبہ سے روایت کیا ہے علی رضی اللہ عنہ کی حدیث کے مشابہ ہے اس لیے کہ اس میں حجاج بن محمد نے ابن جریج سے «مسح برأسه مرة واحدة» کہا ہے اور ابن وہب نے اس میں ابن جریج سے «ومسح برأسه ثلاثا» روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 117
			}
		}
	]
}