{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"3": "The Book Of The Prayer For Rain (Kitab al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1184,
			"arabicnumber": 1184,
			"text": "اسود بن قیس کہتے ہیں کہ ثعلبہ بن عباد عبدی (جو اہل بصرہ میں سے ہیں) نے بیان کیا ہے کہ وہ ایک دن سمرہ بن جندب رضی اللہ عنہ کے خطبہ میں حاضر رہے، سمرہ رضی اللہ عنہ نے ( خطبہ میں ) کہا: میں اور ایک انصاری لڑکا دونوں تیر سے اپنا اپنا نشانہ لگا رہے تھے یہاں تک کہ جب دیکھنے والوں کی نظر میں سورج دو نیزہ یا تین نیزہ کے برابر رہ گیا تو اسی دوران وہ دفعۃً سیاہ ہو گیا پھر گویا وہ تنومہ ۱؎ ہو گیا، تو ہم میں سے ایک نے اپنے ساتھی سے کہا: تم ہمارے ساتھ مسجد چلو کیونکہ اللہ کی قسم سورج کا یہ حال ہونا رسول اللہ صلی اللہ علیہ وسلم کی امت میں کوئی نیا واقعہ رونما کرے گا، تو ہم چلے تو دیکھتے ہیں کہ مسجد بھری ۲؎ ہے پھر نبی اکرم صلی اللہ علیہ وسلم آگے بڑھے اور آپ نے نماز پڑھائی، اور ہمارے ساتھ اتنا لمبا قیام کیا کہ آپ صلی اللہ علیہ وسلم نے کبھی بھی کسی نماز میں اتنا لمبا قیام نہیں کیا تھا، ہمیں آپ کی آواز سنائی نہیں دے رہی تھی، پھر آپ صلی اللہ علیہ وسلم نے ہمارے ساتھ اتنا لمبا رکوع کیا کہ اتنا لمبا رکوع کسی نماز میں نہیں کیا تھا، ہمیں آپ کی آواز سنائی نہیں دے رہی تھی ۳؎ پھر آپ صلی اللہ علیہ وسلم نے اتنا لمبا سجدہ کیا کہ اتنا لمبا سجدہ آپ نے کبھی بھی کسی نماز میں ہمارے ساتھ نہیں کیا تھا اور ہمیں آپ کی آواز سنائی نہیں دے رہی تھی، پھر آپ صلی اللہ علیہ وسلم نے دوسری رکعت میں بھی ایسا ہی کیا۔ سمرہ بن جندب رضی اللہ عنہ کہتے ہیں: دوسری رکعت پڑھ کر آپ صلی اللہ علیہ وسلم کے بیٹھنے کے ساتھ ہی سورج روشن ہو گیا، پھر آپ نے سلام پھیرا، پھر کھڑے ہوئے تو اللہ کی حمد و ثنا بیان کی اور گواہی دی کہ اللہ کے علاوہ کوئی معبود برحق نہیں اور آپ اللہ کے بندے اور اس کے رسول ہیں ، پھر احمد بن یونس نے نبی اکرم صلی اللہ علیہ وسلم کا پورا خطبہ بیان کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		}
	]
}