{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کے غلام کریب کہتے ہیں کہ عبداللہ بن عباس، عبدالرحمٰن بن ازہر رضی اللہ عنہ اور مسور بن مخرمہ رضی اللہ عنہ تینوں نے انہیں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس بھیجا اور کہا: ان سے ہم سب کا سلام کہنا اور عصر کے بعد دو رکعت نفل کے بارے میں پوچھنا اور کہنا: ہمیں معلوم ہوا ہے کہ آپ یہ دو رکعتیں پڑھتی ہیں، حالانکہ ہم تک یہ بات پہنچی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے منع فرمایا ہے، چنانچہ میں ام المؤمنین عائشہ رضی اللہ عنہا کے پاس گیا اور انہیں ان لوگوں کا پیغام پہنچا دیا، آپ نے کہا: ام المؤمنین ام سلمہ رضی اللہ عنہا سے پوچھو! میں ان لوگوں کے پاس آیا اور ان کی بات انہیں بتا دی، تو ان سب نے مجھے ام المؤمنین ام سلمہ کے پاس اسی پیغام کے ساتھ بھیجا، جس کے ساتھ ام المؤمنین عائشہ رضی اللہ عنہا کے پاس بھیجا تھا، تو ام المؤمنین ام سلمہ رضی اللہ عنہا نے کہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو اس سے منع کرتے ہوئے سنا، پھر دیکھا کہ آپ انہیں پڑھ رہے ہیں، ایک روز آپ نے عصر پڑھی پھر میرے پاس آئے، اس وقت میرے پاس انصار کے قبیلہ بنی حرام کی کچھ عورتیں بیٹھی ہوئی تھیں، آپ نے یہ دونوں رکعتیں پڑھنا شروع کیں تو میں نے ایک لڑکی کو آپ کے پاس بھیجا اور اس سے کہا کہ تو جا کر آپ کے بغل میں کھڑی ہو جا اور آپ سے کہہ: اللہ کے رسول! ام سلمہ کہہ رہی ہیں: میں نے تو آپ کو ان دونوں رکعتوں کو پڑھنے سے منع کرتے ہوئے سنا ہے اور اب آپ ہی انہیں پڑھ رہے ہیں، اگر آپ ہاتھ سے اشارہ کریں تو پیچھے ہٹ جانا، اس لڑکی نے ایسا ہی کیا، آپ نے ہاتھ سے اشارہ کیا، تو وہ پیچھے ہٹ گئی، جب آپ نماز سے فارغ ہو گئے تو فرمایا: اے ابوامیہ کی بیٹی! تم نے مجھ سے عصر کے بعد دو رکعتیں پڑھنے کے بارے میں پوچھا ہے، دراصل میرے پاس عبدالقیس کے چند لوگ اپنی قوم کے اسلام کی خبر لے کر آئے تو ان لوگوں نے مجھے باتوں میں مشغول کر لیا اور میں ظہر کے بعد یہ دونوں رکعتیں نہیں پڑھ سکا، یہ وہی دونوں رکعتیں ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		}
	]
}