{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1556,
			"arabicnumber": 1556,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی، آپ کے بعد ابوبکر رضی اللہ عنہ خلیفہ بنائے گئے اور عربوں میں سے جن کو کافر ۱؎ ہونا تھا کافر ہو گئے تو عمر بن خطاب رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے کہا: آپ لوگوں سے کیوں کر لڑیں گے جب کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: مجھے حکم دیا گیا ہے کہ میں لوگوں سے جنگ کروں یہاں تک کہ وہ«لا إله إلا الله» کہیں، لہٰذا جس نے «لا إله إلا الله» کہا اس نے مجھ سے اپنا مال اور اپنی جان محفوظ کر لی سوائے حق اسلام کے ۲؎ اور اس کا حساب اللہ تعالیٰ پر ہے؟ ، ابوبکر رضی اللہ عنہ نے کہا: اللہ کی قسم! میں ہر اس شخص سے جنگ کروں گا جو نماز اور زکاۃ کے درمیان تفریق ۳؎ کرے گا، اس لیے کہ زکاۃ مال کا حق ہے، قسم اللہ کی، یہ لوگ جس قدر رسول اللہ صلی اللہ علیہ وسلم کو دیتے تھے اگر اس میں سے اونٹ کے پاؤں باندھنے کی ایک رسی بھی نہیں دی تو میں ان سے جنگ کروں گا، عمر بن خطاب رضی اللہ عنہ کہتے ہیں: اللہ کی قسم! اس کے سوا کچھ نہ تھا کہ میں نے سمجھا کہ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کا سینہ جنگ کے لیے کھول دیا ہے اور اس وقت میں نے جانا کہ یہی حق ہے۔ ابوداؤد کہتے ہیں: یہ حدیث رباح بن زید نے روایت کی ہے اور عبدالرزاق نے معمر سے معمر نے زہری سے اسے اسی سند سے روایت کیا ہے، اس میں بعض نے «عناقا» کی جگہ «عقالا» کہا ہے اور ابن وہب نے اسے یونس سے روایت کیا ہے اس میں «عناقا» کا لفظ ہے۔ ابوداؤد کہتے ہیں: شعیب بن ابی حمزہ، معمر اور زبیدی نے اس حدیث میں زہری سے «لو منعوني عناقا» نقل کیا ہے اور عنبسہ نے یونس سے انہوں نے زہری سے یہی حدیث روایت کی ہے۔ اس میں بھی «عناقا» کا لفظ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 1
			}
		}
	]
}