{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1567,
			"arabicnumber": 1567,
			"text": "حماد کہتے ہیں میں نے ثمامہ بن عبداللہ بن انس سے ایک کتاب لی، وہ کہتے تھے: یہ ابوبکر رضی اللہ عنہ نے انس رضی اللہ عنہ کے لیے لکھی تھی، اس پر رسول اللہ صلی اللہ علیہ وسلم کی مہر لگی ہوئی تھی، جب آپ نے انہیں صدقہ وصول کرنے کے لیے بھیجا تھا تو یہ کتاب انہیں لکھ کر دی تھی، اس میں یہ عبارت لکھی تھی: یہ فرض زکاۃ کا بیان ہے جو رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں پر مقرر فرمائی ہے اور جس کا حکم اللہ تعالیٰ نے اپنے نبی اکرم صلی اللہ علیہ وسلم کو دیا ہے، لہٰذا جس مسلمان سے اس کے مطابق زکاۃ طلب کی جائے، وہ اسے ادا کرے اور جس سے اس سے زائد طلب کی جائے، وہ نہ دے: پچیس ( ۲۵ ) سے کم اونٹوں میں ہر پانچ اونٹ پر ایک بکری ہے، جب پچیس اونٹ پورے ہو جائیں تو پینتیس ( ۳۵ ) تک میں ایک بنت مخاض ۱؎ ہے، اگر بنت مخاض نہ ہو تو ابن لبون دیدے، اور جب چھتیس ( ۳۶ ) اونٹ ہو جائیں تو پینتالیس ( ۴۵ ) تک میں ایک بنت لبون ہے، جب چھیالیس ( ۴۶ ) اونٹ پورے ہو جائیں تو ساٹھ ( ۶۰ ) تک میں ایک حقہ واجب ہے، اور جب اکسٹھ ( ۶۱ ) اونٹ ہو جائیں تو پچہتر ( ۷۵ ) تک میں ایک جذعہ واجب ہو گی، جب چھہتر ( ۷۶ ) اونٹ ہو جائیں تو نو ے ( ۹۰ ) تک میں دو بنت لبون دینا ہوں گی، جب اکیانوے ( ۹۱ ) ہو جائیں تو ایک سو بیس ( ۱۲۰ ) تک دو حقہ اور جب ایک سو بیس ( ۱۲۰ ) سے زائد ہوں تو ہر چالیس ( ۴۰ ) میں ایک بنت لبون اور ہر پچاس ( ۵۰ ) میں ایک حقہ دینا ہو گا۔ اگر وہ اونٹ جو زکاۃ میں ادا کرنے کے لیے مطلوب ہے، نہ ہو، مثلاً کسی کے پاس اتنے اونٹ ہوں کہ اسے جذعہ دینا ہو لیکن اس کے پاس جذعہ نہ ہو بلکہ حقہ ہو تو حقہ ہی لے لی جائے گی، اور ساتھ ساتھ دو بکریاں، یا بیس درہم بھی دیدے۔ یا اسی طرح کسی کے پاس اتنے اونٹ ہوں کہ ان میں حقہ دینا ہو لیکن اس کے پاس حقہ نہ ہو بلکہ جذعہ ہو تو اس سے جذعہ ہی قبول کر لی جائے گی، البتہ اب اسے عامل ( زکاۃ وصول کرنے والا ) بیس درہم یا دو بکریاں لوٹائے گا، اسی طرح سے کسی کے پاس اتنے اونٹ ہوں کہ ان میں حقہ دینا ہو لیکن اس کے پاس حقہ کے بجائے بنت لبون ہوں تو بنت لبون ہی اس سے قبول کر لی جائے گی ۔ ابوداؤد کہتے ہیں: میں موسیٰ سے حسب منشاء اس عبارت سے «ويجعل معها شاتين إن استيسرتا له، أو عشرين درهمًا» سے لے کر «ومن بلغت عنده صدقة بنت لبون وليس عنده إلا حقة فإنها تقبل منه» تک اچھی ضبط نہ کر سکا، پھر آگے مجھے اچھی طرح یاد ہے: یعنی اگر اسے میسر ہو تو اس سے دو بکریاں یا بیس درہم واپس لے لیں گے، اگر کسی کے پاس اتنے اونٹ ہوں، جن میں بنت لبون واجب ہوتا ہو اور بنت لبون کے بجائے اس کے پاس حقہ ہو تو حقہ ہی اس سے قبول کر لیا جائے گا اور زکاۃ وصول کرنے والا اسے بیس درہم یا دو بکریاں واپس کرے گا، جس کے پاس اتنے اونٹ ہوں جن میں بنت لبون واجب ہوتی ہو اور اس کے پاس بنت مخاض کے علاوہ کچھ نہ ہو تو اس سے بنت مخاض لے لی جائے گی اور اس کے ساتھ ساتھ دو بکریاں یا بیس درہم اور لیے جائیں گے، جس کے اوپر بنت مخاض واجب ہوتا ہو اور بنت مخاض کے بجائے اس کے پاس ابن لبون مذکر ہو تو وہی اس سے قبول کر لیا جائے گا اور اس کے ساتھ کوئی چیز واپس نہیں کرنی پڑے گی، اگر کسی کے پاس صرف چار ہی اونٹ ہوں تو ان میں کچھ بھی نہیں ہے سوائے اس کے کہ ان کا مالک اپنی خوشی سے کچھ دیدے۔ اگر چالیس ( ۴۰ ) بکریاں چرنے والی ہوں تو ان میں ایک سو بیس ( ۱۲۰ ) تک ایک بکری دینی ہو گی، جب ایک سو اکیس ( ۱۲۱ ) ہو جائیں تو دو سو تک دو بکریاں دینی ہوں گی، جب دو سو سے زیادہ ہو جائیں تو تین سو ( ۳۰۰ ) تک تین بکریاں دینی ہوں گی، جب تین سو سے زیادہ ہوں تو پھر ہر سینکڑے پر ایک بکری دینی ہو گی، زکاۃ میں بوڑھی عیب دار بکری اور نر بکرا نہیں لیا جائے گا سوائے اس کے کہ مصلحتاً زکاۃ وصول کرنے والے کو نر بکرا لینا منظور ہو۔ اسی طرح زکاۃ کے خوف سے متفرق مال جمع نہیں کیا جائے گا اور نہ جمع مال متفرق کیا جائے گا اور جو نصاب دو آدمیوں میں مشترک ہو تو وہ ایک دوسرے پر برابر کا حصہ لگا کر لیں گے ۲؎۔ اگر چرنے والی بکریاں چالیس سے کم ہوں تو ان میں کچھ بھی نہیں ہے سوائے اس کے کہ مالک چا ہے تو اپنی مرضی سے کچھ دیدے، اور چاندی میں چالیسواں حصہ دیا جائے گا البتہ اگر وہ صرف ایک سو نوے درہم ہو تو اس میں کچھ بھی واجب نہیں سوائے اس کے کہ مالک کچھ دینا چاہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 12
			}
		}
	]
}