{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1568,
			"arabicnumber": 1568,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ کہ رسول اللہ صلی اللہ علیہ وسلم نے زکاۃ کی کتاب لکھی، لیکن اسے اپنے عمال کے پاس بھیج نہ پائے تھے کہ آپ کی وفات ہو گئی، آپ صلی اللہ علیہ وسلم نے اسے اپنی تلوار سے لگائے رکھا پھر اس پر ابوبکر رضی اللہ عنہ نے عمل کیا یہاں تک کہ وہ وفات پا گئے، پھر عمر رضی اللہ عنہ نے اپنی وفات تک اس پر عمل کیا، اس کتاب میں یہ تھا: پا نچ ( ۵ ) اونٹ میں ایک ( ۱ ) بکری ہے، دس ( ۱۰ ) اونٹ میں دو ( ۲ ) بکریاں، پندرہ ( ۱۵ ) اونٹ میں تین ( ۳ ) بکریاں، اور بیس ( ۲۰ ) میں چار ( ۴ ) بکریاں ہیں، پھر پچیس ( ۲۵ ) سے پینتیس ( ۳۵ ) تک میں ایک بنت مخاض ہے، پینتیس ( ۳۵ ) سے زیادہ ہو جائے تو پینتالیس ( ۴۵ ) تک ایک بنت لبون ہے، جب پینتالیس ( ۴۵ ) سے زیادہ ہو جائے تو ساٹھ ( ۶۰ ) تک ایک حقہ ہے، جب ساٹھ ( ۶۰ ) سے زیادہ ہو جائے تو پچہتر ( ۷۵ ) تک ایک جذعہ ہے، جب پچہتر ( ۷۵ ) سے زیادہ ہو جائے تو نوے ( ۹۰ ) تک دو بنت لبون ہیں، جب نوے ( ۹۰ ) سے زیادہ ہو جائیں تو ایک سو بیس ( ۱۲۰ ) تک دو حقے ہیں، اور جب اس سے بھی زیادہ ہو جائیں تو ہر پچاس ( ۵۰ ) پر ایک حقہ اور ہر چالیس ( ۴۰ ) پر ایک بنت لبون واجب ہے۔ بکریوں میں چالیس ( ۴۰ ) سے لے کر ایک سو بیس ( ۱۲۰ ) بکریوں تک ایک ( ۱ ) بکری واجب ہو گی، اگر اس سے زیادہ ہو جائیں تو دو سو ( ۲۰۰ ) تک دو ( ۲ ) بکریاں ہیں، اس سے زیادہ ہو جائیں تو تین سو ( ۳۰۰ ) تک تین ( ۳ ) بکریاں ہیں، اگر اس سے بھی زیادہ ہو جائیں تو ہر سو ( ۱۰۰ ) بکری پر ایک ( ۱ ) بکری ہو گی، اور جو سو ( ۱۰۰ ) سے کم ہو اس میں کچھ بھی نہیں، زکاۃ کے ڈر سے نہ جدا مال کو اکٹھا کیا جائے اور نہ اکٹھا مال کو جدا کیا جائے اور جو مال دو آدمیوں کی شرکت میں ہو وہ ایک دوسرے سے لے کر اپنا اپنا حصہ برابر کر لیں، زکاۃ میں بوڑھا اور عیب دار جانور نہ لیا جائے گا ۔ زہری کہتے ہیں: جب مصدق ( زکاۃ وصول کرنے والا ) آئے تو بکریوں کے تین غول کریں گے، ایک غول میں گھٹیا درجہ کی بکریاں ہوں گی دوسرے میں عمدہ اور تیسرے میں درمیانی درجہ کی تو مصدق درمیانی درجہ کی بکریاں زکاۃ میں لے گا، زہری نے گایوں کا ذکر نہیں کیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 13
			}
		}
	]
}