{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1590,
			"arabicnumber": 1590,
			"text": "عبداللہ بن ابی اوفی رضی اللہ عنہ کہتے ہیں کہ میرے والد ( ابواوفی ) اصحاب شجرہ ۱؎ میں سے تھے، جب نبی اکرم صلی اللہ علیہ وسلم کے پاس کوئی قوم اپنے مال کی زکاۃ لے کر آتی تو آپ فرماتے: اے اللہ! آل فلاں پر رحمت نازل فرما، میرے والد اپنی زکاۃ لے کر آپ کے پاس آئے تو آپ صلی اللہ علیہ وسلم نے فرمایا: اے اللہ! ابواوفی کی اولاد پر رحمت نازل فرما ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1590.5,
			"arabicnumber": 1590.5,
			"text": "ابوداؤد کہتے ہیں میں نے اونٹوں کی عمروں کی یہ تفصیل ریاشی اور ابوحاتم وغیرہ وغیرہ سے سنا ہے، اور نضر بن مشمیل اور ابوعبید کی کتاب سے حاصل کی ہے، اور بعض باتیں ان میں سے کسی ایک ہی نے ذکر کی ہیں، ان لوگوں کا کہنا ہے: اونٹ کا بچہ ( جب پیدا ہو ) «حواءر»کہلاتا ہے۔ جب دودھ چھوڑے تو اسے «فصیل» کہتے ہیں۔ جب ایک سال پورا کر کے دوسرے سال میں لگ جائے تو دوسرے سال کے پورا ہونے تک اسے «بنت مخاض» کہتے ہیں۔ جب تیسرے میں داخل ہو جائے تو اسے «بنت لبون» کہتے ہیں۔ جب تین سال پورے کرے تو چار برس پورے ہونے تک اسے «حِق» یا «حقہ» کہتے ہیں کیونکہ وہ سواری اور جفتی کے لائق ہو جاتی ہے، اور اونٹنی ( مادہ ) اس عمر میں حاملہ ہو جاتی ہے، لیکن نر جوان نہیں ہوتا، جب تک دگنی عمر ( چھ برس ) کا نہ ہو جائے، «حقہ» کو «طروقۃ الفحل» بھی کہتے ہیں، اس لیے کہ نر اس پر سوار ہوتا ہے۔ جب پانچواں برس لگے تو پانچ برس پورے ہونے تک «جذعہ» کہلاتا ہے۔ جب چھٹا برس لگے اور وہ سامنے کے دانت گراوے تو چھ برس پورے ہونے تک وہ «ثنی» ہے۔ جب ساتواں برس لگے تو سات برس پورے ہونے تک نر کو «رباعی» اور مادہ کو «رباعیہ» کہتے ہیں۔ جب آٹھواں برس لگے اور چھٹا دانت گرا دے تو آٹھ برس پورے ہونے تک اسے «سدیس» یا «سدس» کہتے ہیں۔ جب وہ نویں برس میں لگ جائے تو اسے دسواں برس شروع ہونے تک «بازل» کہتے ہیں، اس لیے کہ اس کی کچلیاں نکل آتی ہیں، کہا جاتا ہے «بزل نابه» یعنی اس کے دانت نکل آئے۔ اور دسواں برس لگ جائے تو وہ «مخلف»ہے، اس کے بعد اس کا کوئی نام نہیں، البتہ یوں کہتے ہیں: ایک سال کا «بازل» ، دو سال کا «بازل» ، ایک سال کا «مخلف» ، دو سال کا«مخلف» اور تین سال کا «مخلف» ، یہ سلسلہ پانچ سال تک چلتا ہے۔ «خلفہ» حاملہ اونٹنی کو کہتے ہیں۔ ابوحاتم نے کہا: «جذوعہ» ایک مدت کا نام ہے کسی خاص دانت کا نام نہیں، دانتوں کی فصل سہیل تارے کے نکلنے پر بدلتی ہے۔ ابوداؤد کہتے ہیں: ہم کو ریاشی نے شعر سنائے ( جن کے معنی ہیں ) : جب رات کے اخیر میں سہیل ( ستارہ ) نکلا تو «ابن لبون» «حِق» ہو گیا اور «حِق» «جذع» ہو گیا کوئی دانت نہ رہا سوائے «ہبع» کے۔ «ہبع» : وہ بچہ ہے جو سہیل کے طلوع کے وقت میں پیدا نہ ہو، بلکہ کسی اور وقت میں پیدا ہو، اس کی عمر کا حساب سہیل سے نہیں ہوتا۔",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}