{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1641,
			"arabicnumber": 1641,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ کہ ایک انصاری نبی اکرم صلی اللہ علیہ وسلم کے پاس مانگنے کے لیے آیا، آپ نے پوچھا: کیا تمہارے گھر میں کچھ نہیں ہے؟ ، بولا: کیوں نہیں، ایک کمبل ہے جس میں سے ہم کچھ اوڑھتے ہیں اور کچھ بچھا لیتے ہیں اور ایک پیالا ہے جس میں ہم پانی پیتے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: وہ دونوں میرے پاس لے آؤ ، چنانچہ وہ انہیں آپ کے پاس لے آیا، رسول اللہ صلی اللہ علیہ وسلم نے ان دونوں کو اپنے ہاتھ میں لیا اور فرمایا: یہ دونوں کون خریدے گا؟ ، ایک آدمی بولا: انہیں میں ایک درہم میں خرید لیتا ہوں، آپ صلی اللہ علیہ وسلم نے پوچھا: ایک درہم سے زیادہ کون دے رہا ہے؟ ، دو بار یا تین بار، تو ایک شخص بولا: میں انہیں دو درہم میں خریدتا ہوں، آپ صلی اللہ علیہ وسلم نے اسے وہ دونوں چیزیں دے دیں اور اس سے درہم لے کر انصاری کو دے دئیے اور فرمایا: ان میں سے ایک درہم کا غلہ خرید کر اپنے گھر میں ڈال دو اور ایک درہم کی کلہاڑی لے آؤ ، وہ کلہاڑی لے کر آیا تو آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اس میں ایک لکڑی ٹھونک دی اور فرمایا: جاؤ لکڑیاں کاٹ کر لاؤ اور بیچو اور پندرہ دن تک میں تمہیں یہاں نہ دیکھوں ، چنانچہ وہ شخص گیا، لکڑیاں کاٹ کر لاتا اور بیچتا رہا، پھر آیا اور دس درہم کما چکا تھا، اس نے کچھ کا کپڑا خریدا اور کچھ کا غلہ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یہ تمہارے لیے بہتر ہے اس سے کہ قیامت کے دن مانگنے کی وجہ سے تمہارے چہرے میں کوئی داغ ہو، مانگنا صرف تین قسم کے لوگوں کے لیے درست ہے: ایک تو وہ جو نہایت محتاج ہو، خاک میں لوٹتا ہو، دوسرے وہ جس کے سر پر گھبرا دینے والے بھاری قرضے کا بوجھ ہو، تیسرے وہ جس پر خون کی دیت لازم ہو اور وہ دیت ادا نہ کر سکتا ہو اور اس کے لیے وہ سوال کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 86
			}
		}
	]
}