{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"9": "Zakat (Kitab Al-Zakat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1658,
			"arabicnumber": 1658,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس کے پاس مال ہو وہ اس کا حق ادا نہ کرتا ہو تو قیامت کے روز اللہ اسے اس طرح کر دے گا کہ اس کا مال جہنم کی آگ میں گرم کیا جائے گا پھر اس سے اس کی پیشانی، پسلی اور پیٹھ کو داغا جائے گا، یہاں تک کہ اللہ تعالیٰ اپنے بندوں کا ایک ایسے دن میں فیصلہ فرما دے گا جس کی مقدار تمہارے ( دنیاوی ) حساب سے پچاس ہزار برس کی ہو گی، اس کے بعد وہ اپنی راہ دیکھے گا وہ راہ یا تو جنت کی طرف جا رہی ہو گی یا جہنم کی طرف۔ ( اسی طرح ) جو بکریوں والا ہو اور ان کا حق ( زکاۃ ) ادا نہ کرتا ہو تو قیامت کے روز وہ بکریاں اس سے زیادہ موٹی ہو کر آئیں گی، جتنی وہ تھیں، پھر اسے ایک مسطح چٹیل میدان میں ڈال دیا جائے گا، وہ اسے اپنی سینگوں سے ماریں گی اور کھروں سے کچلیں گی، ان میں کوئی بکری ٹیڑھے سینگ کی نہ ہو گی اور نہ ایسی ہو گی جسے سینگ ہی نہ ہو، جب ان کی آخری بکری مار کر گزر چکے گی تو پھر پہلی بکری ( مارنے کے لیے ) لوٹائی جائے گی ( یعنی باربار یہ عمل ہوتا رہے گا ) ، یہاں تک کہ اللہ تعالیٰ اپنے بندوں کے درمیان فیصلہ فرما دے اس دن میں جس کی مقدار تمہارے ( دنیاوی ) حساب سے پچاس ہزار برس کی ہو گی، اس کے بعد وہ اپنی راہ دیکھ لے گا یا تو جنت کی طرف یا جہنم کی طرف۔ ( اسی طرح ) جو بھی اونٹ والا ہے اگر وہ ان کا حق ( زکاۃ ) ادا نہیں کرتا تو یہ اونٹ قیامت کے دن پہلے سے زیادہ طاقتور اور موٹے ہو کر آئیں گے اور اس شخص کو ایک مسطح چٹیل میدان میں ڈال دیا جائے گا، پھر وہ اسے اپنے کھروں سے روندیں گے، جب آخری اونٹ بھی روند چکے گا تو پہلے اونٹ کو ( روندنے کے لیے ) پھر لوٹایا جائے گا، ( یہ عمل چلتا رہے گا ) یہاں تک کہ اللہ تعالیٰ اپنے بندوں کے درمیان فیصلہ فرما دے گا اس دن میں جس کی مقدار تمہارے ( دنیاوی ) حساب سے پچاس ہزار برس کی ہو گی، پھر وہ اپنی راہ دیکھ لے گا یا تو جنت کی طرف یا جہنم کی طرف ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 103
			}
		}
	]
}