{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1905,
			"arabicnumber": 1905,
			"text": "جعفر بن محمد اپنے والد محمد (محمد باقر) سے روایت کرتے ہیں، وہ کہتے ہیں کہ ہم جابر بن عبداللہ رضی اللہ عنہما کے پاس آئے جب ہم ان کے پاس پہنچے تو انہوں نے آنے والوں کے بارے میں ( ہر ایک سے ) پوچھا یہاں تک کہ جب مجھ تک پہنچے تو میں نے کہا: میں محمد بن علی بن حسین ہوں، تو انہوں نے اپنا ہاتھ میرے سر کی طرف بڑھایا، اور میرے کرتے کے اوپر کی گھنڈی کھولی، پھر نیچے کی کھولی، اور پھر اپنی ہتھیلی میرے دونوں چھاتیوں کے بیچ میں رکھی، میں ان دنوں جوان تھا، پھر کہا: خوش آمدید، اے میرے بھتیجے! جو چاہو پوچھو، میں نے ان سے سوالات کئے، وہ نابینا ہو چکے تھے اور نماز کا وقت آ گیا، تو وہ ایک کپڑا اوڑھ کر کھڑے ہو گئے ( یعنی ایک ایسا کپڑا جو دہرا کر کے سلا ہوا تھا ) ، جب اسے اپنے کندھے پر ڈالتے تو چھوٹا ہونے کی وجہ سے وہ کندھے سے گر جاتا، چنانچہ انہوں نے ہمیں نماز پڑھائی اور ان کی چادر ان کے بغل میں تپائی پر رکھی ہوئی تھی، میں نے عرض کیا: مجھے اللہ کے رسول کے حج کا حال بتائیے، پھر انہوں نے اپنے ہاتھ سے اشارہ کیا اور نو کی گرہ بنائی پھر بولے: رسول اللہ صلی اللہ علیہ وسلم نو سال تک ( مدینہ میں ) حج کئے بغیر رہے، پھر دسویں سال لوگوں میں اعلان کیا گیا کہ رسول اللہ صلی اللہ علیہ وسلم حج کو جانے والے ہیں، چنانچہ مدینہ میں لوگ کثرت سے آ گئے ۱؎، ہر ایک کی خواہش تھی کہ وہ آپ صلی اللہ علیہ وسلم کی اقتداء میں حج کرے، اور آپ ہی کی طرح سارے کام انجام دے، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نکلے اور آپ کے ساتھ ہم بھی نکلے، ہم لوگ ذی الحلیفہ پہنچے تو اسماء بنت عمیس رضی اللہ عنہا کے یہاں محمد بن ابی بکر رضی اللہ عنہما کی ولادت ہوئی، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھوایا: میں کیا کروں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تم غسل کر لو، اور کپڑے کا لنگوٹ باندھ لو، اور احرام پہن لو ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ( ذو الحلیفہ کی ) مسجد میں نماز پڑھی، پھر قصواء ( نامی اونٹنی ) پر سوار ہوئے، یہاں تک کہ جب بیداء میں اونٹنی کو لے کر سیدھی ہو گئی ( جابر رضی اللہ عنہ کہتے ہیں ) تو میں نے تاحد نگاہ دیکھا کہ آپ صلی اللہ علیہ وسلم کے سامنے سوار بھی ہیں پیدل بھی، اسی طرح معاملہ دائیں جانب تھا، اسی طرح بائیں جانب، اور اسی طرح آپ کے پیچھے، اور رسول اللہ صلی اللہ علیہ وسلم ہمارے درمیان میں تھے ۱؎، آپ صلی اللہ علیہ وسلم پر قرآن نازل ہو رہا تھا، اور آپ صلی اللہ علیہ وسلم اس کا معنی سمجھتے تھے، چنانچہ جیسے آپ صلی اللہ علیہ وسلم کرتے ویسے ہی ہم بھی کرتے۔ آپ صلی اللہ علیہ وسلم نے توحید پر مشتمل تلبیہ: «لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك» پکارا، اور لوگ وہی تلبیہ پکارتے رہے جسے آپ صلی اللہ علیہ وسلم پکارا کرتے تھے ۲؎، تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں اس میں سے کسی بھی لفظ سے منع نہیں کیا، بلکہ آپ صلی اللہ علیہ وسلم اپنا تلبیہ ہی برابر کہتے رہے۔ ہماری نیت صرف حج کی تھی، ہمیں پتہ نہیں تھا کہ عمرہ بھی کرنا پڑے گا ۳؎، جب ہم آپ صلی اللہ علیہ وسلم کے ساتھ بیت اللہ پہنچے تو آپ صلی اللہ علیہ وسلم نے حجر اسود کا استلام کیا پھر تین پھیروں میں رمل کیا، اور چار پھیروں میں عام چال چلے، پھر مقام ابراہیم کے پاس آئے اور یہ آیت پڑھی: «واتخذوا من مقام إبراهيم مصلى» ۴؎، اور مقام ابراہیم کو اپنے اور بیت اللہ کے بیچ میں رکھا۔ ( محمد بن جعفر ) کہتے ہیں: میرے والد کہتے تھے ( ابن نفیل اور عثمان کی روایت میں ہے ) کہ میں یہی جانتا ہوں کہ جابر رضی اللہ عنہ نے اسے نبی اکرم صلی اللہ علیہ وسلم سے نقل کیا ہے ( اور سلیمان کی روایت میں ہے ) میں یہی جانتا ہوں کہ انہوں نے کہا: رسول صلی اللہ علیہ وسلم نے دونوں رکعتوں میں «قل هو الله أحد» اور «قل يا أيها الكافرون» پڑھا ۵؎، پھر بیت اللہ کی طرف لوٹے اور حجر اسود کا استلام کیا، اس کے بعد ( مسجد کے ) دروازے سے صفا کی طرف نکل گئے جب صفا سے قریب ہوئے تو «إن الصفا والمروة من شعائر الله» پڑھا اور فرمایا: ہم بھی وہیں سے شروع کریں گے جہاں سے اللہ تعالیٰ نے شروع کیا ہے ، چنانچہ آپ صلی اللہ علیہ وسلم نے صفا سے ابتداء کی اور اس پر چڑھے یہاں تک کہ بیت اللہ کو دیکھا، تو اللہ کی بڑائی اور وحدانیت بیان کی اور فرمایا: «لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شىء قدير لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده» پھر اس کے درمیان میں دعا مانگی اور اس طرح تین بار کہا، پھر مروہ کی طرف اتر کر آئے، جب آپ صلی اللہ علیہ وسلم کے قدم ڈھلکنے لگے تو آپ صلی اللہ علیہ وسلم نے بطن وادی ۶؎ میں رمل کیا یہاں تک کہ جب چڑھنے لگے تو عام چال چلے، یہاں تک کہ مروہ آئے تو وہاں بھی وہی کیا جو صفا پہ کیا تھا، جب طواف کا آخری پھیرا مروہ پہ ختم ہوا تو فرمایا: اگر مجھے پہلے سے معلوم ہوتا جو کہ بعد میں معلوم ہوا تو میں ہدی نہ لاتا اور میں اسے عمرہ بنا دیتا، لہٰذا تم میں سے جس کے ساتھ ہدی نہ ہو تو وہ حلال ہو جائے، اور اسے عمرہ بنا لے ۔ سبھی لوگ حلال ہو گئے اور بال کتروا لیے سوائے نبی اکرم صلی اللہ علیہ وسلم اور ان لوگوں کے جن کے ساتھ ہدی تھی۔ پھر سراقہ بن جعشم رضی اللہ عنہ کھڑے ہوئے اور انہوں نے پوچھا: اللہ کے رسول! کیا یہ ( عمرہ ) صرف اسی سال کے لیے ہے یا ہمیشہ ہمیش کے لیے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے اپنے ایک ہاتھ کی انگلیاں دوسرے میں داخل کیں اور فرمایا: عمرہ حج میں اسی طرح داخل ہو گیا ، اسے دو مرتبہ فرمایا: ( صرف اسی سال کے لیے ) نہیں، بلکہ ہمیشہ ہمیش کے لیے ( صرف اسی سال کے لیے ) نہیں، بلکہ ہمیشہ ہمیش کے لیے ، اور علی رضی اللہ عنہ یمن سے نبی اکرم صلی اللہ علیہ وسلم کے ہدی کے اونٹ لے کر آئے تو فاطمہ رضی اللہ عنہا کو ان لوگوں میں سے پایا جنہوں نے احرام کھول ڈالا تھا، وہ رنگین کپڑے زیب تن کئے ہوئے تھیں، اور سرمہ لگا رکھا تھا، علی رضی اللہ عنہ کو یہ ناگوار لگا، وہ کہنے لگے: تمہیں کس نے اس کا حکم دیا تھا؟ وہ بولیں: میرے والد نے۔ علی رضی اللہ عنہ ( اپنے ایام خلافت میں ) عراق میں کہا کرتے تھے کہ میں ان کاموں سے جن کو فاطمہ نے کر رکھا تھا غصہ میں بھرا ہوا رسول اللہ صلی اللہ علیہ وسلم کے پاس پوچھنے کے لیے آیا جو فاطمہ نے آپ صلی اللہ علیہ وسلم کے متعلق بتائی تھی، اور جس پر میں نے ناگواری کا اظہار کیا تھا، تو انہوں نے کہا کہ مجھے میرے والد نے اس کا حکم دیا ہے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: اس نے سچ کہا، اس نے سچ کہا، تم نے حج کی نیت کرتے وقت کیا کہا تھا؟ ، عرض کیا: میں نے یوں کہا تھا: اے اللہ! میں اسی کا احرام باندھتا ہوں جس کا تیرے رسول نے باندھا ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا: میرے ساتھ تو ہدی ہے اب تم بھی احرام نہ کھولنا ۔ جابر رضی اللہ عنہ کہتے ہیں: ہدی کے جانوروں کی مجموعی تعداد جو علی رضی اللہ عنہ یمن سے لے کر آئے تھے اور جو رسول اللہ صلی اللہ علیہ وسلم مدینہ سے لے کر آئے تھے کل سو ( ۱۰۰ ) تھی، چنانچہ تمام لوگوں نے احرام کھول دیا، اور بال کتروائے سوائے نبی اکرم صلی اللہ علیہ وسلم اور ان لوگوں کے جن کے ساتھ ہدی تھی۔ جابر رضی اللہ عنہ کہتے ہیں: جب یوم الترویہ ( ذو الحجہ کا آٹھواں دن ) آیا تو سب لوگوں نے منیٰ کا رخ کیا اور حج کا احرام باندھا، رسول اللہ صلی اللہ علیہ وسلم بھی سوار ہوئے، اور منیٰ پہنچ کر آپ صلی اللہ علیہ وسلم نے وہاں ظہر، عصر، مغرب، عشاء اور فجر کی نمازیں ادا کیں۔ پھر کچھ دیر ٹھہرے یہاں تک کہ سورج نکل آیا، آپ صلی اللہ علیہ وسلم نے اپنے لیے بالوں سے بنا ہوا ایک خیمہ کا حکم دیا، تو وادی نمرہ میں خیمہ لگایا گیا، پھر رسول اللہ صلی اللہ علیہ وسلم چلے، قریش کو اس بات میں شک نہیں تھا کہ رسول اللہ صلی اللہ علیہ وسلم مزدلفہ میں مشعر حرام ۷؎ کے پاس ٹھہریں گے جیسے جاہلیت میں قریش کیا کرتے تھے، لیکن رسول اللہ صلی اللہ علیہ وسلم آگے بڑھ گئے یہاں تک کہ عرفات جا پہنچے ۸؎ تو دیکھا کہ خیمہ نمرہ میں لگا دیا گیا ہے، آپ صلی اللہ علیہ وسلم وہاں اترے یہاں تک کہ جب سورج ڈھل گیا تو قصواء کو لانے کا حکم فرمایا، اس پر کجاوہ باندھا گیا، آپ صلی اللہ علیہ وسلم اس پر سوار ہوئے یہاں تک کہ وادی کے اندر آئے، تو لوگوں کو خطاب کیا اور فرمایا: تمہاری جانیں اور تمہارے مال تم پر ایسے ہی حرام ہیں جیسے تمہارا یہ دن، تمہارے اس مہینے، اور تمہارے اس شہر میں۔ سنو! جاہلیت کے زمانے کی ہر بات میرے قدموں تلے پامال ہو گئی ( یعنی لغو اور باطل ہو گئی اور اس کا اعتبار نہ رہا ) جاہلیت کے سارے خون معاف ہیں اور سب سے پہلا خون جسے میں معاف کرتا ہوں وہ ابن ربیعہ یا ربیعہ بن حارث بن عبدالمطلب کا ہے- وہ بنی سعد میں دودھ پی رہا تھا- اسے ہذیل کے لوگوں نے قتل کر دیا تھا ( وہ نبی اکرم صلی اللہ علیہ وسلم کا چچا زاد بھائی تھا ) اور جاہلیت کے تمام سود ختم ہیں سب سے پہلا سود جسے میں ختم کرتا ہوں وہ اپنا سود ہے یعنی عباس بن عبدالمطلب کا کیونکہ سود سبھی ختم ہیں خواہ وہ کسی کے بھی ہوں۔ اور عورتوں کے بارے میں اللہ سے ڈرو، اس لیے کہ تم نے انہیں اللہ کی امان کے ساتھ اپنے قبضہ میں لیا ہے، اور تم نے اللہ کے حکم سے ان کی شرمگاہوں کو حلال کیا ہے، ان پر تمہارا حق یہ ہے کہ وہ تمہارے بستر پر اس شخص کو نہ آنے دیں جسے تم ناپسند کرتے ہو، اب اگر وہ ایسا کریں تو انہیں بس اس قدر مارو کہ ہڈی نہ ٹوٹنے پائے، اور انہیں تم سے دستور کے مطابق کھانا لینے اور کپڑا لینے کا حق ہے۔ میں تمہارے درمیان ایسی چیز چھوڑے جاتا ہوں کہ اگر تم اسے مضبوطی سے پکڑے رہو گے تو اس کے بعد کبھی گمراہ نہ ہو گے، وہ اللہ کی کتاب ہے۔ ( اچھا بتاؤ ) تم سے قیامت کے روز میرے بارے میں سوال کیا جائے گا تو تمہارا جواب کیا ہو گا؟ لوگوں نے کہا: ہم گواہی دیں گے کہ آپ صلی اللہ علیہ وسلم نے اللہ کا حکم پہنچا دیا، حق ادا کر دیا، اور نصیحت کی، پھر آپ صلی اللہ علیہ وسلم نے اپنی انگشت شہادت کو آسمان کی طرف اٹھایا، پھر لوگوں کی طرف جھکایا، اور فرمایا: اے اللہ! تو گواہ رہ، اے اللہ! تو گواہ رہ ۔ پھر بلال رضی اللہ عنہ نے اذان دی اور اقامت کہی تو آپ صلی اللہ علیہ وسلم نے ظہر پڑھی اور انہوں نے پھر اقامت کہی تو آپ صلی اللہ علیہ وسلم نے عصر کی نماز پڑھی یہاں تک کہ میدان عرفات آئے تو اپنی اونٹنی قصواء کا پیٹ صخرات ( بڑے پتھروں ) کی جانب کیا، اور حبل المشاۃ کو اپنے سامنے کیا، اور قبلہ رخ ہوئے، اور شام تک ٹھہرے رہے یہاں تک کہ سورج ڈوب گیا اور سورج کی ٹکیہ غائب ہونے کے بعد زردی کچھ کم ہو گئی۔ آپ صلی اللہ علیہ وسلم نے اسامہ رضی اللہ عنہ کو اپنے پیچھے بٹھا لیا، پھر عرفات سے لوٹے، قصواء کی باگ آپ صلی اللہ علیہ وسلم نے کھینچ کر رکھی تھی یہاں تک کہ اس کا سر پالان کے سر سے چھو جایا کرتا تھا، آپ صلی اللہ علیہ وسلم اپنے داہنے ہاتھ کے اشارہ سے لوگوں سے کہہ رہے تھے کہ: لوگو! اطمینان سے چلو!، لوگو! اطمینان سے چلو! ، جب آپ صلی اللہ علیہ وسلم کسی بلندی پر آتے تو باگ ڈھیلی چھوڑ دیتے تاکہ وہ چڑھ سکے یہاں تک کہ مزدلفہ پہنچے تو مغرب اور عشاء ایک اذان اور دو اقامتوں کے ساتھ ملا کر پڑھیں۔ عثمان کہتے ہیں: دونوں کے بیچ میں کوئی نفلی نماز نہیں پڑھی پھر سارے راوی متفق ہیں۔ پھر رسول اللہ صلی اللہ علیہ وسلم لیٹ گئے یہاں تک کہ فجر طلوع ہو گئی تو آپ صلی اللہ علیہ وسلم نے فجر پڑھی یہاں تک کہ صبح خوب اچھی طرح روشن ہو گئی، سلیمان کہتے ہیں ( یہ نماز ) آپ صلی اللہ علیہ وسلم نے ایک اذان اور ایک اقامت سے ( پڑھی ) ، پھر سارے راوی متفق ہیں ) ، پھر آپ صلی اللہ علیہ وسلم قصواء پر سوار ہوئے یہاں تک کہ مشعر حرام کے پاس آئے، اس پر چڑھے، ( عثمان اور سلیمان کہتے ہیں ) پھر قبلہ رخ ہوئے اور اللہ کی تحمید، تکبیر اور تہلیل کی، ( عثمان نے یہ اضافہ کیا کہ ) آپ صلی اللہ علیہ وسلم نے توحید بیان کی۔ پھر آپ صلی اللہ علیہ وسلم وہاں ٹھہرے رہے یہاں تک کہ خوب روشنی ہو گئی اس کے بعد سورج طلوع ہونے سے پہلے آپ صلی اللہ علیہ وسلم وہاں سے چل پڑے، اور فضل بن عباس رضی اللہ عنہما کو اپنے پیچھے سوار کر لیا، وہ نہایت عمدہ بال والے گورے خوبصورت شخص تھے، جب رسول اللہ صلی اللہ علیہ وسلم چلے تو آپ کا گزر ایسی عورتوں پر ہوا جو ہودجوں میں بیٹھی ہوئی جا رہی تھیں، فضل ان کی طرف دیکھنے لگے، رسول اللہ صلی اللہ علیہ وسلم نے اپنا ہاتھ فضل کے چہرے پر رکھ دیا تو فضل نے اپنا چہرہ دوسری طرف پھیر لیا، آپ صلی اللہ علیہ وسلم نے بھی اپنا ہاتھ دوسری جانب موڑ دیا تو فضل نے اپنا رخ اور جانب موڑ لیا اور دیکھنے لگے، یہاں تک کہ جب وادی محسر میں آئے تو اپنی سواری کو ذرا حرکت دی ( یعنی ذرا تیز چلایا ) پھر درمیانی راستے ۹؎ سے چلے جو جمرہ عقبہ پہنچاتا ہے یہاں تک کہ جب اس جمرے کے پاس آئے جو درخت کے پاس ہے تو اسے سات کنکریاں ماریں، ہر کنکری پر تکبیر کہی، کنکری اتنی بڑی تھی کہ انگلی میں رکھ کر پھینک رہے تھے، آپ صلی اللہ علیہ وسلم نے وادی کے اندر سے کنکریاں ماریں پھر آپ صلی اللہ علیہ وسلم وہاں سے نحر کرنے کی جگہ کو آئے، اور اپنے ہاتھ سے ( ۶۳ ) اونٹنیاں نحر کیں، اور پھر علی رضی اللہ عنہ کو حکم دیا تو باقی انہوں نے نحر کیں، آپ صلی اللہ علیہ وسلم نے انہیں بھی اپنے ہدی میں شریک کر لیا ( یعنی اپنے ہدی کے اونٹوں میں سے کچھ اونٹ انہیں بھی نحر کرنے کے لیے دے دیئے ) پھر ہر اونٹ میں سے گوشت کا ایک ایک ٹکڑا لینے کا حکم دیا، تو وہ سب ٹکڑے ایک دیگ میں رکھ کر پکائے گئے ( آپ صلی اللہ علیہ وسلم اور علی رضی اللہ عنہ ) دونوں نے ان کا گوشت کھایا اور ان کا شوربہ پیا، ( سلیمان کہتے ہیں ) پھر آپ صلی اللہ علیہ وسلم سوار ہوئے اور بیت اللہ کی طرف چلے، آپ صلی اللہ علیہ وسلم نے مکہ میں ۱۰؎ ظہر پڑھی۔ پھر بنی عبدالمطلب کے پاس آئے، وہ لوگ آب زمزم پلا رہے تھے فرمایا: اے بنی عبدالمطلب! پانی کھینچو، اگر مجھے یہ اندیشہ نہ ہوتا کہ تمہارے سقایہ پر لوگ تم پر غالب آ جائیں گے ۱۱؎ تو میں بھی تمہارے ساتھ پانی کھینچتا، ان لوگوں نے ایک ڈول آپ صلی اللہ علیہ وسلم کو بھی دیا، آپ صلی اللہ علیہ وسلم نے اس میں سے پیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 185
			}
		}
	]
}