{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "عروہ بن زبیر نے ام المؤمنین عائشہ رضی اللہ عنہا سے اللہ تعالیٰ کے فرمان: «وإن خفتم ألا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء سورة النساء» ۱؎ کے بارے میں دریافت کیا تو ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: بھانجے! اس سے وہ یتیم لڑکی مراد ہے، جو اپنے ایسے ولی کی پرورش میں ہو جس کے مال میں وہ شریک ہو اور اس کی خوبصورتی اور اس کا مال اسے بھلا لگتا ہو اس کی وجہ سے وہ اس سے بغیر مناسب مہر ادا کئے نکاح کرنا چاہتا ہو ( یعنی جتنا مہر اس کو اور کوئی دیتا اتنا بھی نہ دے رہا ہو ) چنانچہ انہیں ان سے نکاح کرنے سے روک دیا گیا، اگر وہ انصاف سے کام لیں اور انہیں اونچے سے اونچا مہر ادا کریں تو نکاح کر سکتے ہیں ورنہ فرمان رسول ہے کہ ان کے علاوہ جو عورتیں انہیں پسند ہوں ان سے نکاح کر لیں۔ عروہ کا بیان ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس آیت کے نزول کے بعد یتیم لڑکیوں کے بارے میں حکم دریافت کیا تو یہ آیت نازل ہوئی: «ويستفتونك في النساء قل الله يفتيكم فيهن وما يتلى عليكم في الكتاب في يتامى النساء اللاتي لا تؤتونهن ما كتب لهن وترغبون أن تنكحوهن» ۲؎ ام المؤمنین عائشہ نے کہا کہ اس آیت میں اللہ تعالیٰ نے جو یہ فرمایا ہے کہ وہ ان پر کتاب میں پڑھی جاتی ہیں اس سے مراد پہلی آیت ہے جس میں اللہ تعالیٰ نے فرمایا ہے: «وإن خفتم أن لا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء» اور اس دوسری آیت میں اللہ تعالیٰ کے قول: «وترغبون أن تنكحوهن» سے یہی غرض ہے کہ تم میں سے کسی کی پرورش میں کم مال والی کم حسن والی یتیم لڑکی ہو تو وہ اس کے ساتھ نکاح سے بے رغبتی نہ کرے چنانچہ انہیں منع کیا گیا کہ مال اور حسن کی بنا پر یتیم لڑکیوں سے نکاح کی رغبت کریں، ہاں انصاف کی شرط کے ساتھ درست ہے۔ یونس نے کہا کہ ربیعہ نے اللہ کے فرمان: «وإن خفتم أن لا تقسطوا في اليتامى» کا مطلب یہ بتایا ہے کہ اگر تمہیں یتیم لڑکیوں کے بارے میں انصاف نہ کر پانے کا ڈر ہو تو انہیں چھوڑ دو ( کسی اور عورت سے نکاح کر لو ) میں نے تمہارے لیے چار عورتوں سے نکاح جائز کر دیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		}
	]
}