{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "سارہ بنت مقسم نے بیان کیا ہے کہ انہوں نے میمونہ بنت کردم رضی اللہ عنہا کو کہتے سنا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے حج میں اپنے والد کے ساتھ نکلی، میرے والد آپ صلی اللہ علیہ وسلم کے قریب پہنچے، آپ اپنی اونٹنی پر سوار تھے تو وہ آپ کے پاس کھڑے ہو گئے، اور آپ کی باتیں سننے لگے، آپ صلی اللہ علیہ وسلم کے پاس معلموں کے درے کی طرح ایک درہ تھا، میں نے بدوؤں نیز دیگر لوگوں کو کہتے ہوئے سنا کہ تھپتھپانے سے بچو، تھپتھپانے سے بچو تھپتھپانے سے بچو ۱؎۔ میرے والد نے آپ صلی اللہ علیہ وسلم سے قریب جا کر آپ کا پیر پکڑ لیا اور آپ کے رسول ہونے کا اقرار کیا، اور آپ صلی اللہ علیہ وسلم کے پاس ٹھہرے رہے اور آپ کی بات کو غور سے سنا، پھر کہا کہ میں لشکر عثران ( یہ جاہلیت کی جنگ ہے ) میں حاضر تھا، ( ابن مثنی کی روایت میں جیش عثران کے بجائے جیش غثران ہے ) تو طارق بن مرقع نے کہا: مجھے اس کے عوض میں نیزہ کون دیتا ہے؟ میں نے پوچھا: اس کا عوض کیا ہو گا؟ کہا: میری جو پہلی بیٹی ہو گی اس کے ساتھ اس کا نکاح کر دوں گا، چنانچہ میں نے اپنا نیزہ اسے دے دیا اور غائب ہو گیا، جب مجھے پتہ چلا کہ اس کی بیٹی ہو گئی اور جوان ہو گئی ہے تو میں اس کے پاس پہنچ گیا اور اس سے کہا کہ میری بیوی کو میرے ساتھ رخصت کرو تو وہ قسم کھا کر کہنے لگا کہ وہ ایسا نہیں کر سکتا، جب تک کہ میں اسے مہر جدید ادا نہ کر دوں اس عہد و پیمان کے علاوہ جو میرے اور اس کے درمیان ہوا تھا، میں نے بھی قسم کھا لی کہ جو میں اسے دے چکا ہوں اس کے علاوہ کوئی اور مہر نہیں دے سکتا، تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا: اب وہ کن عورتوں کی عمر میں ہے ( یعنی اس کی عمر اس وقت کیا ہے ) ، اس نے کہا: وہ بڑھاپے کو پہنچ گئی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: میری رائے ہے کہ تم اسے جانے دو ، تو آپ صلی اللہ علیہ وسلم کی اس بات نے مجھے گھبرا دیا میں آپ کی جانب دیکھنے لگا، آپ صلی اللہ علیہ وسلم نے میری جب یہ حالت دیکھی تو فرمایا: ( گھبراؤ مت ) نہ تم گنہگار ہو گے اور نہ ہی تمہارا ساتھی ۲؎ گنہگار ہو گا ۔ ابوداؤد کہتے ہیں: روایت میں وارد لفظ «قتیر» کا مطلب بڑھاپا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		}
	]
}