{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2196,
			"arabicnumber": 2196,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رکانہ اور اس کے بھائیوں کے والد عبد یزید نے رکانہ کی ماں کو طلاق دے دی، اور قبیلہ مزینہ کی ایک عورت سے نکاح کر لیا، وہ عورت رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور اپنے سر سے ایک بال لے کر کہنے لگی کہ وہ میرے کام کا نہیں مگر اس بال برابر لہٰذا میرے اور اس کے درمیان جدائی کرا دیجئیے، یہ سن کر آپ صلی اللہ علیہ وسلم کو غصہ آ گیا، آپ نے رکانہ اور اس کے بھائیوں کو بلوا لیا، پھر پاس بیٹھے ہوئے لوگوں سے پوچھا کہ: کیا فلاں کی شکل اس اس طرح اور فلاں کی اس اس طرح عبد یزید سے نہیں ملتی؟ ، لوگوں نے کہا: ہاں ( ملتی ہے ) ، نبی اکرم صلی اللہ علیہ وسلم نے عبد یزید سے فرمایا: اسے طلاق دے دو ، چنانچہ انہوں نے طلاق دے دی، پھر فرمایا: اپنی بیوی یعنی رکانہ اور اس کے بھائیوں کی ماں سے رجوع کر لو ، عبد یزید نے کہا: اللہ کے رسول میں تو اسے تین طلاق دے چکا ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: مجھے معلوم ہے، تم اس سے رجوع کر لو ، اور آپ صلی اللہ علیہ وسلم نے یہ آیت تلاوت فرمائی «يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن» ( سورۃ الطلاق: ۱ ) اے نبی! جب تم عورتوں کو طلاق دو تو ان کی عدت میں طلاق دو ۔ ابوداؤد کہتے ہیں: نافع بن عجیر اور عبداللہ بن علی بن یزید بن رکانہ کی حدیث جسے انہوں نے اپنے والد سے انہوں نے اپنے دادا سے روایت ( حدیث نمبر: ۲۲۰۶ ) کیا ہے کہ رکانہ نے اپنی بیوی کو طلاق بتہ دے دی، پھر بھی نبی اکرم صلی اللہ علیہ وسلم نے اس سے رجوع کرا دیا، زیادہ صحیح ہے کیونکہ رکانہ کے لڑکے اور ان کے گھر والے اس بات کو اچھی طرح جانتے تھے کہ رکانہ نے اپنی بیوی کو طلاق بتہ دی تھی تو نبی اکرم صلی اللہ علیہ وسلم نے اسے ایک ہی شمار کیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		}
	]
}