{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2253,
			"arabicnumber": 2253,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ میں ( ایک دفعہ ) جمعہ کی رات مسجد میں تھا کہ اچانک انصار کا ایک شخص مسجد میں آیا، اور کہنے لگا: اگر کوئی شخص اپنی بیوی کے ساتھ کسی ( اجنبی ) آدمی کو پا لے اور ( حقیقت حال ) بیان کرے تو تم لوگ اسے کوڑے لگاؤ گے، یا وہ قتل کر دے تو اس کے بدلے میں تم لوگ اسے قتل کر دو گے، اور اگر وہ چپ رہے تو اندر ہی اندر غصہ میں جلے بھنے، اللہ کی قسم، میں اس سلسلہ میں رسول اللہ صلی اللہ علیہ وسلم سے ضرور دریافت کروں گا، چنانچہ جب دوسرا دن ہوا تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور اس نے عرض کیا کہ اگر کوئی شخص اپنی بیوی کے ساتھ کسی ( اجنبی ) آدمی کو پا لے اور حقیقت حال بیان کرے تو ( تہمت کی حد کے طور پر ) آپ اسے کوڑے لگائیں گے، یا وہ قتل کر دے تو اسے قتل کر دیں گے، یا وہ خاموشی اختیار کر کے اندر ہی غصہ سے جلے بھنے، یہ سن کر آپ صلی اللہ علیہ وسلم دعا کرنے لگے: اے اللہ! معاملے کی وضاحت فرما دے ، چنانچہ لعان کی آیت «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم» اور جو لوگ اپنی بیویوں کو تہمت لگاتے ہیں اور ان کے پاس گواہ نہ ہوں ( سورۃ النور: ۶ ) آخر تک نازل ہوئی تو لوگوں میں یہی شخص اس مصیبت میں مبتلا ہوا چنانچہ وہ دونوں میاں بیوی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور ان دونوں نے لعان کیا، اس آدمی نے چار بار اللہ کا نام لے کر اپنے سچے ہونے کی گواہی دی، اور پانچویں بار کہا کہ اگر وہ جھوٹا ہو تو اس پر اللہ کی لعنت ہو، پھر عورت لعان کرنے چلی تو آپ صلی اللہ علیہ وسلم نے فرمایا: ٹھہرو ، لیکن وہ نہیں مانی اور لعان کر ہی لیا، تو جب وہ دونوں جانے لگے، تو آپ صلی اللہ علیہ وسلم نے فرمایا: شاید یہ عورت کالا گھنگرالے بالوں والا بچہ جنم دے چنانچہ اس نے وہ کالا اور گھنگرالے بالوں والا بچہ ہی جنم دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 79
			}
		}
	]
}