{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2254,
			"arabicnumber": 2254,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ہلال بن امیہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے پاس اپنی بیوی پر شریک بن سحماء کے ساتھ ( زنا کی ) تہمت لگائی تو آپ صلی اللہ علیہ وسلم نے فرمایا: ثبوت لاؤ ورنہ پیٹھ پر کوڑے لگیں گے ، تو ہلال نے کہا کہ: اللہ کے رسول! جب ہم میں سے کوئی شخص کسی آدمی کو اپنی بیوی کے ساتھ دیکھے تو وہ گواہ ڈھونڈنے جائے؟ اس پر بھی نبی اکرم صلی اللہ علیہ وسلم یہی فرمائے جا رہے تھے کہ: گواہ لاؤ، ورنہ تمہاری پیٹھ پر کوڑے پڑیں گے ، تو ہلال نے کہا: اس ذات کی قسم جس نے آپ کو حق کے ساتھ نبی بنا کر بھیجا ہے میں بالکل سچا ہوں اور اللہ تعالیٰ ضرور میرے بارے میں وحی نازل کر کے میری پیٹھ کو حد سے بری کرے گا، چنانچہ «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم» کی آیت نازل ہوئی، آپ صلی اللہ علیہ وسلم نے اسے پڑھا یہاں تک کہ آپ پڑھتے پڑھتے «من الصادقين» ۱؎ تک پہنچے، پھر آپ صلی اللہ علیہ وسلم پلٹے اور آپ نے ان دونوں کو بلوایا، وہ دونوں آئے، پہلے ہلال بن امیہ کھڑے ہوئے اور گواہی دینے لگے، نبی اکرم صلی اللہ علیہ وسلم فرما رہے تھے: اللہ خوب جانتا ہے کہ تم میں سے ایک جھوٹا ہے، تو کیا تم دونوں میں سے کوئی توبہ کرنے والا ہے؟ پھر عورت کھڑی ہوئی اور گواہی دینے لگی، پانچویں بار میں جب ان الفاظ کے کہنے کی باری آئی کہ اگر وہ سچا ہے تو مجھ پر اللہ کا غضب نازل ہو تو لوگ اس سے کہنے لگے: یہ عذاب کو واجب کر دینے والا ہے۔ عبداللہ بن عباس رضی اللہ عنہما کا بیان ہے: تو وہ ہچکچائی اور ہٹ گئی اور ہمیں یہ گمان ہوا کہ وہ باز آ جائے گی، لیکن پھر کہنے لگی: ہمیشہ کے لیے میں اپنی قوم پر رسوائی کا داغ نہ لگاؤں گی ( یہ کہہ کر ) اس نے آخری جملہ کو بھی ادا کر دیا۔ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: دیکھو اس کا ہونے والا بچہ اگر سرمگیں آنکھوں، بڑی سرینوں اور موٹی پنڈلیوں والا ہوا تو وہ شریک بن سحماء کا ہے ، چنانچہ انہیں صفات کا بچہ پیدا ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا: اگر اللہ کی کتاب کا فیصلہ نہ آ گیا ہوتا تو میرا اور اس کا معاملہ کچھ اور ہوتا ، یعنی میں اس پر حد جاری کرتا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 80
			}
		}
	]
}