{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2256,
			"arabicnumber": 2256,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ہلال بن امیہ رضی اللہ عنہ ( جو کہ ان تین اشخاص میں سے ایک تھے جن کی اللہ تعالیٰ نے ( ایک غزوہ میں پچھڑ جانے کی وجہ سے سرزنش کے بعد ) توبہ قبول فرمائی تھی، وہ ) اپنی زمین سے رات کو آئے تو اپنی بیوی کے پاس ایک آدمی کو پایا، اپنی آنکھوں سے سارا منظر دیکھا، اور کانوں سے پوری گفتگو سنی، لیکن صبح تک اس معاملہ کو دبا کر رکھا، صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے، اور عرض کیا: اللہ کے رسول! رات کو میں گھر آیا تو اپنی بیوی کے پاس ایک مرد کو پایا، اپنی آنکھوں سے ( سب کچھ ) دیکھا، اور کانوں سے ( سب ) سنا، ان کی ان باتوں کو آپ نے ناپسند کیا اور ان پر ناگواری کا اظہار فرمایا، تو یہ دونوں آیتیں نازل ہوئیں «والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم فشهادة أحدهم» اور جو لوگ اپنی بیویوں پر بدکاری کی تہمت لگائیں اور ان کے پاس کوئی گواہ بجز ان کی ذات کے نہ ہو تو ایسے لوگوں میں سے ہر ایک کا ثبوت یہ ہے کہ چار مرتبہ اللہ کی قسم کھا کر کہیں کہ وہ سچوں میں سے ہیں اور پانچویں مرتبہ کہے کہ اس پر اللہ تعالیٰ کی لعنت ہو اگر وہ جھوٹوں میں سے ہو ( سورۃ النور: ۷، ۶ ) پھر رسول اللہ صلی اللہ علیہ وسلم سے جب وحی کی کیفیت دور ہوئی تو آپ نے فرمایا: ہلال! خوش ہو جاؤ، اللہ تعالیٰ نے تمہارے لیے کشادگی کا راستہ نکال دیا ہے ، ہلال رضی اللہ عنہ نے کہا: مجھے اپنے پروردگار سے اسی کی امید تھی۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اسے بلواؤ ، تو وہ آئی تو آپ نے دونوں پر یہ آیتیں تلاوت فرمائیں، اور نصیحت کی نیز بتایا کہ: آخرت کا عذاب دنیا کے عذاب سے بہت سخت ہے ۔ ہلال رضی اللہ عنہ نے کہا: قسم اللہ کی میں نے اس کے متعلق جو کہا ہے سچ کہا ہے، وہ کہنے لگی: یہ جھوٹے ہیں، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ان کے درمیان لعان کراؤ ، چنانچہ ہلال رضی اللہ عنہ سے کہا گیا کہ وہ گواہی دیں تو انہوں نے چار بار اللہ کا نام لے کر گواہی دی کہ وہ سچے ہیں، پانچویں کے وقت کہا گیا: ہلال! اللہ سے ڈرو کیونکہ دنیا کا عذاب آخرت کے عذاب کے مقابلے میں بہت آسان ہے، اور اس بار کی گواہی تمہارے لیے عذاب کو واجب کر دے گی، وہ بولے: اللہ کی قسم! جس طرح اللہ تعالیٰ نے مجھے کوڑوں سے بچایا ہے اسی طرح عذاب سے بھی بچائے گا، چنانچہ پانچویں گواہی بھی دے دی کہ اگر وہ جھوٹے ہوں تو ان پر اللہ کی لعنت ہو۔ پھر عورت سے گواہی دینے کے لیے کہا گیا، تو اس نے بھی چار بار گواہی دی کہ وہ جھوٹے ہیں، پانچویں بار اس سے بھی کہا گیا کہ اللہ سے ڈر جا کیونکہ دنیا کا عذاب آخرت کے عذاب کے مقابلے میں بہت آسان ہے، اور اس دفعہ کی گواہی عذاب کو واجب کر دے گی، یہ سن کر وہ ایک لمحہ کے لیے ہچکچائی پھر بولی: اللہ کی قسم میں اپنی قوم کو رسوا نہ کروں گی، چنانچہ پانچویں بار بھی گواہی دے دی کہ اگر وہ سچے ہوں تو مجھ پر اللہ کی لعنت ہو۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے ان کے درمیان تفریق کرا دی، اور فیصلہ فرمایا کہ اس کا لڑکا باپ کی طرف نہ منسوب کیا جائے، اور لڑکے اور عورت کو تہمت نہ لگائی جائے جو اس پر یا اس کے لڑکے پر اب تہمت لگائے گا تو اس پر تہمت کی حد جاری کی جائے گی، نیز آپ صلی اللہ علیہ وسلم نے فیصلہ فرمایا کہ اسے نان نفقہ اور رہائش نہیں ملے گی، کیونکہ ان کی جدائی نہ تو طلاق کی بنا پر ہوئی ہے اور نہ شوہر کے انتقال کی وجہ سے، اور آپ صلی اللہ علیہ وسلم نے فرمایا: اگر وہ بھورے بالوں والا، پتلی سرین والا، چوڑی پیٹھ والا اور پتلی پنڈلیوں والا بچہ جنے تو وہ ہلال کا ( نطفہ ) ہے، اور اگر مٹیالے رنگ والا، گھنگرالے بالوں والا، موٹی پنڈلیوں والا، اور بھاری سرین والا جنے تو اس کا جس کے نام کی تہمت لگائی گئی ہے ، چنانچہ اس عورت کا بچہ مٹیالے رنگ کا گھنگرالے بالوں والا، موٹی پنڈلیوں والا اور بھاری سرین والا پیدا ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر قسمیں نہ ہوتیں تو میرا اور اس کا معاملہ کچھ اور ہوتا ۔ عکرمہ کہتے ہیں: یہی بچہ آگے چل کر مضر کا امیر بنا، اسے باپ کی جانب منسوب نہیں کیا جاتا تھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 82
			}
		}
	]
}