{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"18": "Wills (Kitab Al-Wasaya)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"text": "سعد بن ابی وقاص رضی اللہ عنہ کہتے ہیں کہ وہ بیمار ہوئے ( ابن ابی خلف کی روایت میں ہے: مکہ میں، آگے دونوں راوی متفق ہیں کہ ) اس بیماری میں وہ مرنے کے قریب پہنچ گئے تو رسول اللہ صلی اللہ علیہ وسلم نے ان کی عیادت فرمائی، تو میں نے کہا: اللہ کے رسول! میں بہت مالدار ہوں اور میری بیٹی کے سوا میرا کوئی وارث نہیں، کیا میں اپنے مال کا دو تہائی صدقہ کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں ، پوچھا: کیا آدھا مال صدقہ کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں ، پھر پوچھا: تہائی مال خیرات کر دوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تہائی مال ( دے سکتے ہو ) اور تہائی مال بھی بہت ہے، تمہارا اپنے ورثاء کو مالدار چھوڑنا اس سے بہتر ہے کہ تم انہیں محتاج چھوڑ کر جاؤ وہ لوگوں کے سامنے ہاتھ پھیلاتے پھریں، اور جو چیز بھی تم اللہ کی رضا مندی کے لیے خرچ کرو گے اس کا ثواب تمہیں ملے گا، یہاں تک کہ تم اپنی بیوی کے منہ میں لقمہ اٹھا کر دو گے تو اس کا ثواب بھی پاؤ گے ۱؎، میں نے کہا: اللہ کے رسول! کیا میں ہجرت سے پیچھے رہ جاؤں گا؟ ( یعنی آپ صلی اللہ علیہ وسلم مکہ سے چلے جائیں گے، اور میں اپنی بیماری کی وجہ سے مکہ ہی میں رہ جاؤں گا، جب کہ صحابہ مکہ چھوڑ کر ہجرت کر چکے تھے ) ، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم پیچھے رہ گئے، اور میرے بعد میرے غائبانہ میں بھی نیک عمل اللہ کی رضا مندی کے لیے کرتے رہے تو تمہارا درجہ بلند رہے گا، امید ہے کہ تم زندہ رہو گے، یہاں تک کہ تمہاری ذات سے کچھ اقوام کو فائدہ پہنچے گا اور کچھ کو نقصان و تکلیف ۲؎ ، پھر آپ صلی اللہ علیہ وسلم نے دعا فرمائی کہ: اے اللہ! میرے اصحاب کی ہجرت مکمل فرما، اور انہیں ان کے ایڑیوں کے بل پیچھے کی طرف نہ پلٹا ، لیکن بیچارے سعد بن خولہ رضی اللہ عنہ ان کے لیے رسول اللہ صلی اللہ علیہ وسلم رنج و افسوس کا اظہار فرماتے تھے کہ وہ مکہ ہی میں انتقال فرما گئے ۳؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 18,
				"hadith": 3
			}
		}
	]
}