{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "مالک بن اوس بن حدثان کہتے ہیں کہ عمر رضی اللہ عنہ نے مجھے دن چڑھے بلوا بھیجا، چنانچہ میں آیا تو انہیں ایک تخت پر جس پر کوئی چیز بچھی ہوئی نہیں تھی بیٹھا ہوا پایا، جب میں ان کے پاس پہنچا تو مجھے دیکھ کر کہنے لگے: مالک! تمہاری قوم کے کچھ لوگ میرے پاس آئے ہیں اور میں نے انہیں کچھ دینے کے لیے حکم دیا ہے تو تم ان میں تقسیم کر دو، میں نے کہا: اگر اس کام کے لیے آپ کسی اور کو کہتے ( تو اچھا رہتا ) عمر رضی اللہ عنہ نے کہا: نہیں تم ( جو میں دے رہا ہوں ) لے لو ( اور ان میں تقسیم کر دو ) اسی دوران یرفاء ۱؎ آ گیا، اس نے کہا: امیر المؤمنین! عثمان بن عفان، عبدالرحمٰن بن عوف، زبیر بن عوام اور سعد بن ابی وقاص رضی اللہ عنہم آئے ہوئے ہیں اور ملنے کی اجازت چاہتے ہیں، کیا انہیں بلا لوں؟ عمر رضی اللہ عنہ نے کہا: ہاں ( بلا لو ) اس نے انہیں اجازت دی، وہ لوگ اندر آ گئے، جب وہ اندر آ گئے، تو یرفا پھر آیا، اور آ کر کہنے لگا: امیر المؤمنین! ابن عباس اور علی رضی اللہ عنہما آنا چاہتے ہیں؛ اگر حکم ہو تو آنے دوں؟ کہا: ہاں ( آنے دو ) اس نے انہیں بھی اجازت دے دی، چنانچہ وہ بھی اندر آ گئے، عباس رضی اللہ عنہ نے کہا: امیر المؤمنین! میرے اور ان کے ( یعنی علی رضی اللہ عنہ کے ) درمیان ( معاملے کا ) فیصلہ کر دیجئیے، ( تاکہ جھگڑا ختم ہو ) ۲؎ اس پر ان میں سے ایک شخص نے کہا: ہاں امیر المؤمنین! ان دونوں کا فیصلہ کر دیجئیے اور انہیں راحت پہنچائیے۔ مالک بن اوس کہتے ہیں کہ میرا گمان یہ ہے کہ ان دونوں ہی نے ان لوگوں ( عثمان، عبدالرحمٰن، زبیر اور سعد بن ابی وقاص رضی اللہ عنہم ) کو اپنے سے پہلے اسی مقصد سے بھیجا تھا ( کہ وہ لوگ اس قضیہ کا فیصلہ کرانے میں مدد دیں ) ۔ عمر رضی اللہ عنہ نے کہا: اللہ ان پر رحم کرے! تم دونوں صبر و سکون سے بیٹھو ( میں ابھی فیصلہ کئے دیتا ہوں ) پھر ان موجود صحابہ کی جماعت کی طرف متوجہ ہوئے اور ان سے کہا: میں تم سے اس اللہ کی قسم دے کر پوچھتا ہوں جس کے حکم سے آسمان و زمین قائم ہیں کیا تم جانتے ہو کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ہم انبیاء کا کوئی وارث نہیں ہوتا، ہم جو کچھ چھوڑ کر مرتے ہیں وہ صدقہ ہوتا ہے؟ ، سبھوں نے کہا: ہاں ہم جانتے ہیں۔ پھر وہ علی اور عباس رضی اللہ عنہما کی طرف متوجہ ہوئے اور ان دونوں سے کہا: میں تم دونوں سے اس اللہ کی قسم دے کر پوچھتا ہوں جس کے حکم سے زمین، و آسمان قائم ہیں، کیا تم جانتے ہو کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا: ہمارا ( گروہ انبیاء کا ) کوئی وارث نہیں ہوتا، ہم جو چھوڑ جائیں وہ صدقہ ہوتا ہے؟ ، ان دونوں نے کہا: ہاں ہمیں معلوم ہے۔ عمر رضی اللہ عنہ نے کہا: اللہ نے اپنے رسول صلی اللہ علیہ وسلم کو ایک ایسی خصوصیت سے سرفراز فرمایا تھا جس سے دنیا کے کسی انسان کو بھی سرفراز نہیں کیا، اللہ تعالیٰ نے فرمایا: «وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ولكن الله يسلط رسله على من يشاء والله على كل شىء قدير» اور ان کا جو مال اللہ تعالیٰ نے اپنے رسول کے ہاتھ لگایا ہے جس پر نہ تو تم نے اپنے گھوڑے دوڑائے ہیں اور نہ اونٹ بلکہ اللہ تعالیٰ اپنے رسول کو جس پر چاہے غالب کر دیتا ہے اور اللہ تعالیٰ ہر چیز پر قادر ہے ( سورۃ الحشر: ۶ ) چنانچہ اللہ نے اپنے رسول کو بنو نضیر کا مال دلایا، لیکن قسم اللہ کی رسول اللہ صلی اللہ علیہ وسلم نے اسے تمہیں محروم کر کے صرف اپنے لیے نہیں رکھ لیا، رسول اللہ صلی اللہ علیہ وسلم اس مال سے صرف اپنے اور اپنے اہل و عیال کا سال بھر کا خرچہ نکال لیتے تھے، اور جو باقی بچتا وہ دوسرے مالوں کی طرح رہتا ( یعنی مستحقین اور ضرورت مندوں میں خرچ ہوتا ) ۔ پھر عمر رضی اللہ عنہ صحابہ کی جماعت کی طرف متوجہ ہوئے اور کہنے لگے: میں تم سے اس اللہ کی قسم دے کر پوچھتا ہوں جس کے حکم سے آسمان و زمین قائم ہیں، کیا تم اس بات کو جانتے ہو ( یعنی یہ کہ رسول اللہ صلی اللہ علیہ وسلم ایسا کرتے تھے ) انہوں نے کہا: ہاں ہم جانتے ہیں، پھر عمر رضی اللہ عنہ عباس اور علی رضی اللہ عنہما کی طرف متوجہ ہوئے اور ان سے کہا: میں اس اللہ کی ذات کو گواہ بنا کر تم سے پوچھتا ہوں جس کے حکم سے آسمان و زمین قائم ہیں کیا تم اس کو جانتے ہو؟ انہوں نے کہا: ہاں ہم جانتے ہیں ( یعنی ایسا ہی ہے ) پھر جب رسول اللہ صلی اللہ علیہ وسلم انتقال فرما گئے تو ابوبکر رضی اللہ عنہ نے کہا: میں رسول اللہ صلی اللہ علیہ وسلم کا خلیفہ ہوں، پھر تم اور یہ ابوبکر رضی اللہ عنہ کے پاس آئے، تم اپنے بھتیجے ( یعنی رسول اللہ صلی اللہ علیہ وسلم ) کے ترکہ میں سے اپنا حصہ مانگ رہے تھے اور یہ اپنی بیوی ( فاطمہ رضی اللہ عنہا ) کی میراث مانگ رہے ہیں جو انہیں ان کے باپ کے ترکہ سے ملنے والا تھا، پھر ابوبکر ( اللہ ان پر رحم کرے ) نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: ہمارا کوئی وارث نہیں ہوتا ہے ہم جو چھوڑ جائیں وہ صدقہ ہے ، اور اللہ جانتا ہے کہ ابوبکر رضی اللہ عنہ سچے نیک اور حق کی پیروی کرنے والے تھے، پھر ابوبکر رضی اللہ عنہ اس مال پر قابض رہے، جب انہوں نے وفات پائی تو میں نے کہا: میں رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کا خلیفہ ہوں، اور اس وقت تک والی ہوں جب تک اللہ چاہے۔ پھر تم اور یہ ( علی ) آئے تم دونوں ایک ہی تھے، تمہارا معاملہ بھی ایک ہی تھا تم دونوں نے اسے مجھ سے طلب کیا تو میں نے کہا تھا: اگر تم چاہتے ہو کہ میں اسے تم دونوں کو اس شرط پر دے دوں کہ اللہ کا عہد کر کے کہو اس مال میں اسی طرح کام کرو گے جس طرح رسول اللہ صلی اللہ علیہ وسلم متولی رہتے ہوئے کرتے تھے، چنانچہ اسی شرط پر وہ مال تم نے مجھ سے لے لیا۔ اب پھر تم دونوں میرے پاس آئے ہو کہ اس کے سوا دوسرے طریقہ پر میں تمہارے درمیان فیصلہ کر دوں ۳؎ تو قسم اللہ کی! میں قیامت تک تمہارے درمیان اس کے سوا اور کوئی فیصلہ نہ کروں گا، اگر تم دونوں ان مالوں کا ( معاہدہ کے مطابق ) اہتمام نہیں کر سکتے تو پھر اسے مجھے لوٹا دو ( میں اپنی تولیت میں لے کر پہلے کی طرح اہتمام کروں گا ) ۔ ابوداؤد کہتے ہیں: ان دونوں حضرات نے اس بات کی درخواست کی تھی کہ یہ ان دونوں کے درمیان آدھا آدھا کر دیا جائے، ایسا نہیں کہ انہیں نبی اکرم صلی اللہ علیہ وسلم کا فرمان:«لا نورث ما تركنا صدقة» ہمارا کوئی وارث نہیں ہوتا ہم جو چھوڑ جائیں وہ صدقہ ہے معلوم نہیں تھا بلکہ وہ بھی حق ہی کا مطالبہ کر رہے تھے، اس پر عمر رضی اللہ عنہ نے کہا: میں اس پر تقسیم کا نام نہ آنے دوں گا ( کیونکہ ممکن ہے بعد والے میراث سمجھ لیں ) بلکہ میں اسے پہلی ہی حالت پر باقی رہنے دوں گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		}
	]
}