{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2972,
			"arabicnumber": 2972,
			"text": "مغیرہ کہتے ہیں عمر بن عبدالعزیز جب خلیفہ ہوئے تو انہوں نے مروان بن حکم کے بیٹوں کو اکٹھا کیا پھر ارشاد فرمایا: رسول اللہ صلی اللہ علیہ وسلم کے پاس فدک تھا، آپ اس کی آمدنی سے ( اہل و عیال، فقراء و مساکین پر ) خرچ کرتے تھے، اس سے بنو ہاشم کے چھوٹے بچوں پر احسان فرماتے تھے، ان کی بیوہ عورتوں کے نکاح پر خرچ کرتے تھے، فاطمہ رضی اللہ عنہا نے آپ صلی اللہ علیہ وسلم سے فدک مانگا تو آپ نے انہیں دینے سے انکار کیا، آپ صلی اللہ علیہ وسلم کی زندگی تک ایسا ہی رہا، یہاں تک کہ آپ صلی اللہ علیہ وسلم انتقال فرما گئے، پھر جب ابوبکر رضی اللہ عنہ خلیفہ ہوئے تو انہوں نے ویسے ہی عمل کیا جیسے نبی اکرم صلی اللہ علیہ وسلم نے اپنی زندگی میں کیا تھا، یہاں تک کہ وہ بھی انتقال فرما گئے، پھر جب عمر رضی اللہ عنہ خلیفہ ہوئے تو انہوں نے بھی ویسے ہی کیا جیسے رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ نے کیا تھا یہاں تک کہ عمر رضی اللہ عنہ بھی انتقال فرما گئے، پھر مروان نے اسے اپنی جاگیر بنا لیا، پھر وہ عمر بن عبدالعزیز کے قبضہ و تصرف میں آیا، عمر بن عبدالعزیز کہتے ہیں: تو میں نے اس معاملے پر غور و فکر کیا، میں نے اسے ایک ایسا معاملہ جانا کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے فاطمہ علیہا السلام کو دینے سے منع کر دیا تو پھر ہمیں کہاں سے یہ حق پہنچتا ہے کہ ہم اسے اپنی ملکیت میں رکھیں؟ تو سن لو، میں تم سب کو گواہ بنا کر کہتا ہوں کہ اسے میں نے پھر اس کی اپنی اسی حالت پر لوٹا دیا ہے جس پر رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں تھا ( یعنی میں نے پھر وقف کر دیا ہے ) ۔ ابوداؤد کہتے ہیں: عمر بن عبدالعزیزخلیفہ مقرر ہوئے تو اس وقت ان کی آمدنی چالیس ہزار دینار تھی، اور انتقال کیا تو ( گھٹ کر ) چار سو دینار ہو گئی تھی، اور اگر وہ اور زندہ رہتے تو اور بھی کم ہو جاتی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 45
			}
		}
	]
}