{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "عبدالمطلب بن ربیعہ بن حارث بن عبدالمطلب نے خبر دی کہ ان کے والد ربیعہ بن حارث اور عباس بن عبدالمطلب رضی اللہ عنہما نے ان سے اور فضل بن عباس رضی اللہ عنہ سے کہا کہ تم دونوں رسول اللہ صلی اللہ علیہ وسلم کے پاس جاؤ اور آپ سے عرض کرو کہ اللہ کے رسول! ہم جس عمر کو پہنچ گئے ہیں وہ آپ دیکھ ہی رہے ہیں، اور ہم شادی کرنے کے خواہاں ہیں، اللہ کے رسول! آپ لوگوں میں سب سے زیادہ نیک اور سب سے زیادہ رشتہ و ناتے کا خیال رکھنے والے ہیں، ہمارے والدین کے پاس مہر ادا کرنے کے لیے کچھ نہیں ہے، اللہ کے رسول! ہمیں صدقہ وصولی کے کام پر لگا دیجئیے جو دوسرے عمال وصول کر کے دیتے ہیں وہ ہم بھی وصول کر کے دیں گے اور جو فائدہ ( یعنی حق محنت ) ہو گا وہ ہم پائیں گے۔ عبدالمطلب رضی اللہ عنہ کہتے ہیں کہ ہم اسی حال میں تھے کہ علی بن ابی طالب رضی اللہ عنہ گئے اور انہوں نے ہم سے کہا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: قسم اللہ کی! ہم تم میں سے کسی کو بھی صدقہ کی وصولی کا عامل نہیں بنائیں گے ۱؎ ۔ اس پر ربیعہ رضی اللہ عنہ نے کہا: یہ تم اپنی طرف سے کہہ رہے ہو، تم نے رسول اللہ صلی اللہ علیہ وسلم کی دامادی کا شرف حاصل کیا تو ہم نے تم سے کوئی حسد نہیں کیا، یہ سن کر علی رضی اللہ عنہ اپنی چادر بچھا کر اس پر لیٹ گئے اور کہنے لگے: میں ابوالحسن سردار ہوں ( جیسے اونٹوں میں بڑا اونٹ ہوتا ہے ) قسم اللہ کی! میں یہاں سے نہیں ٹلوں گا جب تک کہ تمہارے دونوں بیٹے رسول اللہ صلی اللہ علیہ وسلم کے پاس سے اس بات کا جواب لے کر نہ آ جائیں جس کے لیے تم نے انہیں اللہ کے نبی کریم صلی اللہ علیہ وسلم کے پاس بھیجا ہے۔ عبدالمطلب رضی اللہ عنہ کہتے ہیں: میں اور فضل بن عباس رضی اللہ عنہ دونوں گئے، ہم نبی کریم صلی اللہ علیہ وسلم کے دروازے کے پاس پہنچے ہی تھے کہ ظہر کھڑی ہو گئی ہم نے سب کے ساتھ نماز جماعت سے پڑھی، نماز پڑھ کر میں اور فضل دونوں جلدی سے نبی اکرم صلی اللہ علیہ وسلم کے حجرے کے دروازے کی طرف لپکے، آپ اس دن ام المؤمنین زینب بنت حجش رضی اللہ عنہا کے پاس تھے، اور ہم دروازے پر کھڑے ہو گئے، یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم آ گئے اور ( پیار سے ) میرے اور فضل کے کان پکڑے، اور کہا: بولو بولو، جو دل میں لیے ہو ، یہ کہہ کر آپ صلی اللہ علیہ وسلم گھر میں چلے گئے اور مجھے اور فضل کو گھر میں آنے کی اجازت دی، تو ہم اندر چلے گئے، اور ہم نے تھوڑی دیر ایک دوسرے کو بات چھیڑنے کے لیے اشارہ کیا ( تم کہو تم کہو ) پھر میں نے یا فضل نے ( یہ شک حدیث کے راوی عبداللہ کو ہوا ) آپ سے وہی بات کہی جس کا ہمارے والدین نے ہمیں حکم دیا تھا، یہ سن کر رسول اللہ صلی اللہ علیہ وسلم ایک گھڑی تک چپ رہے، پھر نگاہیں اٹھا کر گھر کی چھت کی طرف دیر تک تکتے رہے، ہم نے سمجھا کہ شاید آپ صلی اللہ علیہ وسلم ہمیں کوئی جواب نہ دیں، یہاں تک کہ ہم نے دیکھا کہ پردے کی آڑ سے ( ام المؤمنین ) زینب رضی اللہ عنہا اشارہ کر رہی ہیں کہ تم جلدی نہ کرو ( گھبراؤ نہیں ) رسول اللہ صلی اللہ علیہ وسلم تمہارے ہی مطلب کی فکر میں ہیں، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے اپنے سر کو نیچا کیا، اور فرمایا: یہ صدقہ تو لوگوں ( کے مال ) کا میل ( کچیل ) ہے، اور یہ محمد صلی اللہ علیہ وسلم کے لیے اور محمد صلی اللہ علیہ وسلم کی آل ( و اولاد ) کے لیے حلال نہیں ہے، ( یعنی بنو ہاشم کے لیے صدقہ لینا درست نہیں ہے ) نوفل بن حارث کو میرے پاس بلاؤ چنانچہ نوفل بن حارث رضی اللہ عنہ کو آپ کے پاس بلایا گیا، آپ صلی اللہ علیہ وسلم نے فرمایا: نوفل! اپنی بیٹی کا نکاح عبدالمطلب سے کر دو ، تو نوفل نے اپنی بیٹی کا نکاح مجھ سے کر دیا۔ پھر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: محمیہ بن جزء کو میرے پاس بلاؤ ، محمیۃ بن جزء رضی اللہ عنہ بنو زبید کے ایک فرد تھے، رسول اللہ صلی اللہ علیہ وسلم نے انہیں خمس کی وصولی کا عامل بنا رکھا تھا ( وہ آئے ) آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: تم فضل کا ( اپنی بیٹی سے ) نکاح کر دو ، تو انہوں نے ان کا نکاح کر دیا، پھر رسول اللہ صلی اللہ علیہ وسلم نے ( ان سے ) کہا: جاؤ مال خمس میں سے ان دونوں کا مہر اتنا اتنا ادا کر دو ۔ ( ابن شہاب کہتے ہیں ) عبداللہ بن حارث نے مجھ سے مہر کی مقدار بیان نہیں کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		}
	]
}