{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3006,
			"arabicnumber": 3006,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے اہل خیبر سے جنگ کی، ان کی زمین، اور ان کے کھجور کے باغات قابض ہو گئے اور انہیں اپنے قلعہ میں محصور ہو جانے پر مجبور کر دیا، تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس شرط پر صلح کر لی کہ سونا چاندی اور ہتھیار جو کچھ بھی ہیں وہ سب رسول اللہ صلی اللہ علیہ وسلم کے لیے ہوں گے اور ان کے لیے صرف وہی کچھ ( مال و اسباب ) ہے جنہیں ان کے اونٹ اپنے ساتھ اٹھا کر لے جا سکیں، انہیں اس کا حق و اختیار نہ ہو گا کہ وہ کوئی چیز چھپائیں یا غائب کریں، اگر انہوں نے ایسا کیا تو مسلمانوں پر ان کی حفاظت اور معاہدے کی پاس داری کی کوئی ذمہ داری نہ رہے گی تو انہوں نے حیی بن اخطب کے چمڑے کی ایک تھیلی غائب کر دی، حیی بن اخطب خیبر سے پہلے قتل کیا گیا تھا، اور وہ جس دن بنو نضیر جلا وطن کئے گئے تھے اسے اپنے ساتھ اٹھا لایا تھا اس میں ان کے زیورات تھے۔ رسول اللہ صلی اللہ علیہ وسلم نے سعیہ ( یہودی ) سے پوچھا: حیی بن اخطب کی تھیلی کہاں ہے؟ ، اس نے کہا: لڑائیوں میں کام آ گئی اور مصارف میں خرچ ہو گئی پھر صحابہ کو وہ تھیلی مل گئی تو آپ صلی اللہ علیہ وسلم نے ابن ابی حقیق کو قتل کر دیا، ان کی عورتوں کو قیدی بنا لیا، اور ان کی اولاد کو غلام بنا لیا، ان کو جلا وطن کر دینے کا ارادہ کر لیا، تو وہ کہنے لگے: محمد! ہمیں یہیں رہنے دیجئیے، ہم اس زمین میں کام کریں گے ( جوتیں بوئیں گے ) اور جو پیداوار ہو گی اس کا آدھا ہم لیں گے اور آدھا آپ کو دیں گے، رسول اللہ صلی اللہ علیہ وسلم ( اس پیداوار سے ) اپنی ہر ہر بیوی کو ( سال بھر میں ) ( ۸۰، ۸۰ ) وسق کھجور کے اور ( ۲۰، ۲۰ ) وسق جو کے دیتے تھے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 79
			}
		}
	]
}