{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3027,
			"arabicnumber": 3027,
			"text": "عامر بن شہر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا ( بحیثیت نبی ) ظہور ہوا تو مجھ سے ( قبیلہ ) ہمدان کے لوگوں نے کہا: کیا تم اس آدمی کے پاس جاؤ گے اور ہماری طرف سے اس سے بات چیت کرو گے؟ اگر تمہیں کچھ بھی اطمینان ہوا تو ہم اسے قبول کر لیں گے، اگر تم نے اسے ناپسند کیا تو ہم بھی برا جانیں گے، میں نے کہا: ہاں ( ٹھیک ہے میں جاؤں گا ) پھر میں چلا یہاں تک کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، تو آپ کا معاملہ ہمیں پسند آ گیا ( تو میں اسلام لے آیا ) اور میری قوم بھی اسلام لے آئی، اور رسول اللہ صلی اللہ علیہ وسلم نے عمیر ذی مران کو یہ تحریر لکھ کر دی، اور آپ صلی اللہ علیہ وسلم نے مالک بن مرارہ رہاوی کو تمام یمن والوں کے پاس ( اسلام کا پیغام پہنچانے کے لیے ) بھیجا، تو عک ذوخیوان ( ایک شخص کا نام ہے ) اسلام لے آیا۔ عک ذوخیوان سے کہا گیا کہ تو رسول اللہ صلی اللہ علیہ وسلم کے پاس جا اور آپ سے اپنی بستی اور اپنے مال کے لیے امان لے کر آ ( تاکہ آئندہ کوئی تجھ پر اور تیری بستی والوں پر زیادتی نہ کرے ) تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور رسول اللہ صلی اللہ علیہ وسلم نے اسے لکھ کر دیا آپ نے لکھا: بسم اللہ الرحمن الرحیم محمد صلی اللہ علیہ وسلم کی طرف سے جو اللہ کے رسول ہیں عک ذوخیوان کے لیے اگر وہ سچا ہے تو اسے لکھ کر دیا جاتا ہے کہ اس کو امان ہے، اس کی زمین، اس کے مال اور اس کے غلاموں میں، اسے اللہ اور اللہ کے رسول محمد صلی اللہ علیہ وسلم کی طرف سے ذمہ اور امان و پناہ حاصل ہے ۔ ( راوی کہتے ہیں ) خالد بن سعید بن العاص نے یہ پروانہ ( رسول اللہ صلی اللہ علیہ وسلم کی طرف سے ) اسے لکھ کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 100
			}
		}
	]
}