{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 321,
			"arabicnumber": 321,
			"text": "ابووائل شقیق بن سلمہ کہتے ہیں کہ میں عبداللہ بن مسعود اور ابوموسیٰ اشعری رضی اللہ عنہما کے درمیان بیٹھا ہوا تھا کہ ابوموسیٰ رضی اللہ عنہ نے کہا: ابوعبدالرحمٰن! ( یہ عبداللہ بن مسعود کی کنیت ہے ) اس مسئلے میں آپ کا کیا خیال ہے کہ اگر کوئی شخص جنبی ہو جائے اور ایک مہینے تک پانی نہ پائے تو کیا وہ تیمم کرتا رہے؟ عبداللہ بن مسعود نے کہا: تیمم نہ کرے، اگرچہ ایک مہینہ تک پانی نہ ملے۔ ابوموسیٰ رضی اللہ عنہ نے کہا: پھر آپ سورۃ المائدہ کی اس آیت: «فلم تجدوا ماء فتيمموا صعيدا طيبا» پانی نہ پاؤ تو پاک مٹی سے تیمم کرو کے متعلق کیا کہتے ہیں؟ تو عبداللہ بن مسعود نے کہا: اگر تیمم کی رخصت دی جائے تو قریب ہے کہ جب پانی ٹھنڈا ہو تو لوگ مٹی سے تیمم کرنے لگیں۔ اس پر ابوموسیٰ رضی اللہ عنہ نے ان سے کہا: آپ نے اسی وجہ سے اسے ناپسند کیا ہے؟ ابن مسعود رضی اللہ عنہ نے کہا: ہاں، تو ابوموسیٰ رضی اللہ عنہ نے ان سے کہا: کیا آپ نے عمار رضی اللہ عنہ کی بات ( جو انہوں نے عمر رضی اللہ عنہ سے کہی ) نہیں سنی کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے کسی ضرورت کے لیے بھیجا تو میں جنبی ہو گیا اور مجھے پانی نہیں ملا تو میں مٹی ( زمین ) پر لوٹا جیسے جانور لوٹتا ہے، پھر میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے اس کا ذکر کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: تمہیں تو بس اس طرح کر لینا کافی تھا ، اور آپ صلی اللہ علیہ وسلم نے اپنا ہاتھ زمین پر مارا، پھر اسے جھاڑا، پھر اپنے بائیں سے اپنی دائیں ہتھیلی پر اور دائیں سے بائیں ہتھیلی پر مارا، پھر اپنے چہرے کا مسح کیا، تو عبداللہ رضی اللہ عنہ نے ان سے کہا: کیا آپ نے نہیں دیکھا کہ عمر رضی اللہ عنہ، عمار رضی اللہ عنہ کی اس بات سے مطمئن نہیں ہوئے؟ ! ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 321
			}
		}
	]
}