{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"22": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3316,
			"arabicnumber": 3316,
			"text": "عمران بن حصین رضی اللہ عنہما کہتے ہیں کہ عضباء ۱؎ بنو عقیل کے ایک شخص کی تھی، حاجیوں کی سواریوں میں آگے چلنے والی تھی، وہ شخص گرفتار کر کے نبی اکرم صلی اللہ علیہ وسلم کے پاس بندھا ہوا لایا گیا، اس وقت آپ ایک گدھے پر سوار تھے اور آپ ایک چادر اوڑھے ہوئے تھے، اس نے کہا: محمد! آپ نے مجھے اور حاجیوں کی سواریوں میں آگے جانے والی میری اونٹنی ( عضباء ) کو کس بنا پر پکڑ رکھا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: ہم نے تمہارے حلیف ثقیف کے گناہ کے جرم میں پکڑ رکھا ہے ۔ راوی کہتے ہیں: ثقیف نے نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے دو شخصوں کو قید کر لیا تھا۔ اس نے جو بات کہی اس میں یہ بات بھی کہی کہ میں مسلمان ہوں، یا یہ کہا کہ میں اسلام لے آیا ہوں، تو جب نبی اکرم صلی اللہ علیہ وسلم آگے بڑھ گئے ( آپ نے کوئی جواب نہیں دیا ) تو اس نے پکارا: اے محمد! اے محمد! عمران کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم رحم دل اور نرم مزاج تھے، اس کے پاس لوٹ آئے، اور پوچھا: کیا بات ہے؟ اس نے کہا: میں مسلمان ہوں، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم یہ پہلے کہتے جب تم اپنے معاملے کے مختار تھے تو تم بالکل بچ جاتے اس نے کہا: اے محمد! میں بھوکا ہوں، مجھے کھانا کھلاؤ، میں پیاسا ہوں مجھے پانی پلاؤ۔ عمران رضی اللہ عنہ کہتے ہیں: نبی اکرم صلی اللہ علیہ وسلم نے یہ سن کر فرمایا: یہی تمہارا مقصد ہے یا: یہی اس کا مقصد ہے ۔ راوی کہتے ہیں: پھر وہ دو آدمیوں کے بدلے فدیہ میں دے دیا گیا ۲؎ اور عضباء کو رسول اللہ صلی اللہ علیہ وسلم نے اپنی سواری کے لیے روک لیا ( یعنی واپس نہیں کیا ) ۔ پھر مشرکین نے مدینہ کے جانوروں پر حملہ کیا اور عضباء کو پکڑ لے گئے، تو جب اسے لے گئے اور ایک مسلمان عورت کو بھی پکڑ لے گئے، جب رات ہوتی تو وہ لوگ اپنے اونٹوں کو اپنے کھلے میدانوں میں سستانے کے لیے چھوڑ دیتے، ایک رات وہ سب سو گئے، تو عورت ( نکل بھاگنے کے ارادہ ) سے اٹھی تو وہ جس اونٹ پر بھی ہاتھ رکھتی وہ بلبلانے لگتا یہاں تک کہ وہ عضباء کے پاس آئی، وہ ایک سیدھی سادی سواری میں مشاق اونٹنی کے پاس آئی اور اس پر سوار ہو گئی اس نے نذر مان لی کہ اگر اللہ نے اسے بچا دیا تو وہ اسے ضرور قربان کر دے گی۔ جب وہ مدینہ پہنچی تو اونٹنی نبی اکرم صلی اللہ علیہ وسلم کی اونٹنی کی حیثیت سے پہچان لی گئی، نبی اکرم صلی اللہ علیہ وسلم کو اس کی اطلاع دی گئی، آپ نے اسے بلوایا، چنانچہ اسے بلا کر لایا گیا، اس نے اپنی نذر کے متعلق بتایا، آپ صلی اللہ علیہ وسلم نے فرمایا: کتنا برا ہے جو تم نے اسے بدلہ دینا چاہا، اللہ نے اسے اس کی وجہ سے نجات دی ہے تو وہ اسے نحر کر دے، اللہ کی معصیت میں نذر کا پورا کرنا نہیں اور نہ ہی نذر اس مال میں ہے جس کا آدمی مالک نہ ہو ۔ ابوداؤد کہتے ہیں: یہ عورت ابوذر کی بیوی تھیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		}
	]
}