{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 333,
			"arabicnumber": 333,
			"text": "قبیلہ بنی عامر کے ایک آدمی کہتے ہیں کہ میں اسلام میں داخل ہوا تو مجھے اپنا دین سیکھنے کی فکر لاحق ہوئی لہٰذا میں ابوذر رضی اللہ عنہ کے پاس آیا، انہوں نے کہا: مجھے مدینہ کی آب و ہوا راس نہ آئی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھے کچھ اونٹ اور بکریاں دینے کا حکم دیا اور مجھ سے فرمایا: تم ان کا دودھ پیو ، ( حماد کا بیان ہے کہ مجھے شک ہے کہ آپ صلی اللہ علیہ وسلم نے انہیں پیشاب بھی پینے کے لیے کہا یا نہیں، یہ حماد کا قول ہے ) ، پھر ابوذر رضی اللہ عنہ نے کہا: میں پانی سے ( اکثر ) دور رہا کرتا تھا اور میرے ساتھ میری بیوی بھی تھی، مجھے جنابت لاحق ہوتی تو میں بغیر طہارت کے نماز پڑھ لیتا تھا، تو میں رسول اللہ صلی اللہ علیہ وسلم کے پاس دوپہر کے وقت آیا، آپ صحابہ کی ایک جماعت کے ساتھ مسجد کے سائے میں ( بیٹھے ) تھے، آپ نے فرمایا: ابوذر؟ ، میں نے کہا: جی، اللہ کے رسول! میں تو ہلاک و برباد ہو گیا، آپ صلی اللہ علیہ وسلم نے فرمایا: کس چیز نے تمہیں ہلاک و برباد کیا؟ ، میں نے کہا: میں پانی سے دور رہا کرتا تھا اور میرے ساتھ میری بیوی تھی، مجھے جنابت لاحق ہوتی تو میں بغیر طہارت کے نماز پڑھ لیتا تھا، تو رسول اللہ صلی اللہ علیہ وسلم نے میرے لیے پانی لانے کا حکم دیا، چنانچہ ایک کالی لونڈی بڑے برتن میں پانی لے کر آئی جو برتن میں ہل رہا تھا، برتن بھرا ہوا نہیں تھا، پھر میں نے اپنے اونٹ کی آڑ کی اور غسل کیا، پھر آیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اے ابوذر! پاک مٹی پاک کرنے والی ہے، اگرچہ تم دس سال تک پانی نہ پاؤ، لیکن جب تمہیں پانی مل جائے تو اسے اپنی کھال پر بہاؤ ( غسل کرو ) ۔ ابوداؤد کہتے ہیں: اسے حماد بن زید نے ایوب سے روایت کیا ہے اور اس میں انہوں نے پیشاب کا ذکر نہیں کیا ہے۔ ابوداؤد کہتے ہیں: یہ صحیح نہیں ہے اور پیشاب کا ذکر صرف انس بن مالک رضی اللہ عنہ کی حدیث میں ہے، جس میں اہل بصرہ منفرد ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 333
			}
		}
	]
}