{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"23": "Commercial Transactions (Kitab Al-Buyu)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "سالم بن عبداللہ بن عمر نے خبر دی کہ ابن عمر رضی اللہ عنہما اپنی زمین بٹائی پر دیا کرتے تھے، پھر جب انہیں یہ خبر پہنچی کہ رافع بن خدیج انصاری رضی اللہ عنہ نے حدیث بیان کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم زمین کو بٹائی پر دینے سے روکتے تھے، تو عبداللہ بن عمر رضی اللہ عنہما ان سے ملے، اور کہنے لگے: ابن خدیج! زمین کو بٹائی پر دینے کے سلسلے میں رسول اللہ صلی اللہ علیہ وسلم سے آپ کیا حدیث بیان کرتے ہیں؟ رافع رضی اللہ عنہ نے عبداللہ بن عمر سے کہا: میں نے اپنے دونوں چچاؤں سے سنا ہے اور وہ دونوں جنگ بدر میں شریک تھے، وہ گھر والوں سے حدیث بیان کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے زمین کو بٹائی پر دینے سے منع فرمایا ہے، عبداللہ بن عمر نے کہا: قسم اللہ کی! میں رسول اللہ صلی اللہ علیہ وسلم کے زمانہ میں یہی جانتا تھا کہ زمین بٹائی پر دی جاتی تھی، پھر عبداللہ کو خدشہ ہوا کہ اس دوران رسول اللہ صلی اللہ علیہ وسلم نے اس باب میں کوئی نیا حکم نہ صادر فرما دیا ہو اور ان کو پتہ نہ چل پایا ہو، تو انہوں نے زمین کو بٹائی پر دینا چھوڑ دیا۔ ابوداؤد کہتے ہیں کہ اسے ایوب، عبیداللہ، کثیر بن فرقد اور مالک نے نافع سے انہوں نے رافع رضی اللہ عنہ سے اور رافع نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے۔ اور اسے اوزاعی نے حفص بن عنان حنفی سے اور انہوں نے نافع سے اور نافع نے رافع رضی اللہ عنہ سے روایت کیا ہے، رافع کہتے ہیں: میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا۔ اور اسی طرح اسے زید بن ابی انیسہ نے حکم سے انہوں نے نافع سے اور نافع نے ابن عمر رضی اللہ عنہما سے روایت کیا ہے کہ وہ رافع رضی اللہ عنہ کے پاس آئے اور ان سے دریافت کیا کہ کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے؟ تو انہوں نے کہا: ہاں۔ ایسے ہی عکرمہ بن عمار نے ابونجاشی سے اور انہوں نے رافع بن خدیج رضی اللہ عنہ سے روایت کیا ہے، وہ کہتے ہیں: میں نے نبی اکرم صلی اللہ علیہ وسلم سے سنا ہے۔ اور اسے اوزاعی نے ابونجاشی سے، انہوں نے رافع بن خدیج رضی اللہ عنہ سے، رافع نے اپنے چچا ظہیر بن رافع سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کیا ہے۔ ابوداؤد کہتے ہیں: ابونجاشی سے مراد عطاء بن صہیب ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		}
	]
}