{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 394,
			"arabicnumber": 394,
			"text": "ابن شہاب زہری کہتے ہیں کہ عمر بن عبدالعزیز منبر پر بیٹھے ہوئے تھے، آپ نے عصر میں کچھ تاخیر کر دی، اس پر عروہ بن زبیر نے آپ سے کہا: کیا آپ کو معلوم نہیں کہ جبرائیل علیہ السلام نے محمد صلی اللہ علیہ وسلم کو نماز کا وقت بتا دیا ہے؟ تو عمر بن عبدالعزیز نے کہا: جو تم کہہ رہے ہو اسے سوچ لو ۱؎۔ عروہ نے کہا: میں نے بشیر بن ابی مسعود کو کہتے سنا، وہ کہتے تھے کہ میں نے ابومسعود انصاری رضی اللہ عنہ کو کہتے سنا، وہ کہتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا کہ جبرائیل علیہ السلام اترے، انہوں نے مجھے اوقات نماز کی خبر دی، چنانچہ میں نے ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی ، آپ اپنی انگلیوں پر پانچوں ( وقت کی ) نماز کو شمار کرتے جا رہے تھے۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ نے سورج ڈھلتے ہی ظہر پڑھی، اور جب کبھی گرمی شدید ہوتی تو آپ صلی اللہ علیہ وسلم ظہر دیر کر کے پڑھتے۔ اور میں نے آپ صلی اللہ علیہ وسلم کو عصر اس وقت پڑھتے دیکھا جب سورج بالکل بلند و سفید تھا، اس میں زردی نہیں آئی تھی کہ آدمی عصر سے فارغ ہو کر ذوالحلیفہ ۲؎ آتا، تو سورج ڈوبنے سے پہلے وہاں پہنچ جاتا، آپ صلی اللہ علیہ وسلم مغرب سورج ڈوبتے ہی پڑھتے اور عشاء اس وقت پڑھتے جب آسمان کے کناروں میں سیاہی آ جاتی، اور کبھی آپ صلی اللہ علیہ وسلم عشاء میں دیر کرتے تاکہ لوگ اکٹھا ہو جائیں، آپ صلی اللہ علیہ وسلم نے ایک مرتبہ فجر غلس ( اندھیرے ) میں پڑھی، اور دوسری مرتبہ آپ نے اس میں اسفار ۳؎ کیا یعنی خوب اجالے میں پڑھی، مگر اس کے بعد آپ صلی اللہ علیہ وسلم فجر ہمیشہ غلس میں پڑھتے رہے یہاں تک کہ آپ کی وفات ہو گئی اور آپ صلی اللہ علیہ وسلم نے پھر کبھی اسفار میں نماز نہیں ادا کی۔ ابوداؤد کہتے ہیں: یہ حدیث زہری سے: معمر، مالک، ابن عیینہ، شعیب بن ابوحمزہ، لیث بن سعد وغیرہم نے بھی روایت کی ہے لیکن ان سب نے ( اپنی روایت میں ) اس وقت کا ذکر نہیں کیا، جس میں آپ نے نماز پڑھی، اور نہ ہی ان لوگوں نے اس کی تفسیر کی ہے، نیز ہشام بن عروہ اور حبیب بن ابی مرزوق نے بھی عروہ سے اسی طرح روایت کی ہے جس طرح معمر اور ان کے اصحاب نے روایت کی ہے، مگر حبیب نے ( اپنی روایت میں ) بشیر کا ذکر نہیں کیا ہے۔ اور وہب بن کیسان نے جابر رضی اللہ عنہ سے، جابر نے نبی اکرم صلی اللہ علیہ وسلم سے مغرب کے وقت کی روایت کی ہے، اس میں ہے کہ جبرائیل علیہ السلام دوسرے دن مغرب کے وقت سورج ڈوبنے کے بعد آئے یعنی دونوں دن ایک ہی وقت میں آئے۔ ابوداؤد کہتے ہیں کہ ابوہریرہ رضی اللہ عنہ نے بھی اسی طرح نبی اکرم صلی اللہ علیہ وسلم سے نقل کیا ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: جبرائیل نے مجھے دوسرے دن مغرب ایک ہی وقت میں پڑھائی ۔ اسی طرح عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے بھی مروی ہے یعنی حسان بن عطیہ کی حدیث جسے وہ عمرو بن شعیب سے، وہ ان کے والد سے، وہ اپنے دادا عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے، اور عبداللہ بن عمرو نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 4
			}
		}
	]
}