{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "سبیع بن خالد کہتے ہیں کہ تستر فتح کئے جانے کے وقت میں کوفہ آیا، وہاں سے میں خچر لا رہا تھا، میں مسجد میں داخل ہوا تو دیکھا کہ چند درمیانہ قد و قامت کے لوگ ہیں، اور ایک اور شخص بیٹھا ہے جسے دیکھ کر ہی تم پہچان لیتے کہ یہ اہل حجاز میں کا ہے، میں نے پوچھا: یہ کون ہیں؟ تو لوگ میرے ساتھ ترش روئی سے پیش آئے، اور کہنے لگے: کیا تم انہیں نہیں جانتے؟ یہ رسول اللہ صلی اللہ علیہ وسلم کے صحابی حذیفہ بن یمان رضی اللہ عنہ ہیں، پھر حذیفہ نے کہا: لوگ رسول اللہ صلی اللہ علیہ وسلم سے خیر کے متعلق پوچھتے تھے، اور میں آپ سے شر کے بارے میں پوچھا کرتا تھا، تو لوگ انہیں غور سے دیکھنے لگے، انہوں نے کہا: جس پر تمہیں تعجب ہو رہا ہے وہ میں سمجھ رہا ہوں، پھر وہ کہنے لگے: میں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کیا: اللہ کے رسول! مجھے بتائیے کہ اس خیر کے بعد جسے اللہ نے ہمیں عطا کیا ہے کیا شر بھی ہو گا جیسے پہلے تھا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ہاں میں نے عرض کیا: پھر اس سے بچاؤ کی کیا صورت ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تلوار ۱؎ میں نے عرض کیا: اللہ کے رسول! پھر اس کے بعد کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: اگر اللہ کی طرف سے کوئی خلیفہ ( حاکم ) زمین پر ہو پھر وہ تمہاری پیٹھ پر کوڑے لگائے، اور تمہارا مال لوٹ لے جب بھی تم اس کی اطاعت کرو ورنہ تم درخت کی جڑ چبا چبا کر مر جاؤ ۲؎ میں نے عرض کیا: پھر کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر دجال ظاہر ہو گا، اس کے ساتھ نہر بھی ہو گی اور آگ بھی جو اس کی آگ میں داخل ہو گیا تو اس کا اجر ثابت ہو گیا، اور اس کے گناہ معاف ہو گئے، اور جو اس کی ( اطاعت کر کے ) نہر میں داخل ہو گیا تو اس کا گناہ واجب ہو گیا، اور اس کا اجر ختم ہو گیا میں نے عرض کیا: پھر کیا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: پھر قیامت قائم ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		}
	]
}