{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4520,
			"arabicnumber": 4520,
			"text": "سہل بن ابی حثمہ اور رافع بن خدیج رضی اللہ عنہما سے روایت ہے کہ محیصہ بن مسعود اور عبداللہ بن سہل دونوں خیبر کی طرف چلے اور کھجور کے درختوں میں ( چلتے چلتے ) دونوں ایک دوسرے سے علیحدہ ہو گئے، پھر عبداللہ بن سہل قتل کر دیے گئے، تو ان لوگوں نے یہودیوں پر تہمت لگائی، ان کے بھائی عبدالرحمٰن بن سہل اور ان کے چچازاد بھائی حویصہ اور محیصہ اکٹھا ہوئے اور وہ سب نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے، عبدالرحمٰن بن سہل جو ان میں سب سے چھوٹے تھے اپنے بھائی کے معاملے میں بولنے چلے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بڑوں کا لحاظ کرو ( اور انہیں گفتگو کا موقع دو ) یا یوں فرمایا: بڑے کو پہلے بولنے دو چنانچہ ان دونوں ( حویصہ اور محیصہ ) نے اپنے عزیز کے سلسلے میں گفتگو کی، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے پچاس آدمی یہودیوں کے کسی آدمی پر قسم کھائیں تو اسے رسی سے باندھ کر تمہارے حوالے کر دیا جائے ان لوگوں نے کہا: یہ ایسا معاملہ ہے جسے ہم نے دیکھا نہیں ہے، پھر ہم کیسے قسم کھا لیں؟ آپ نے فرمایا: پھر یہود اپنے پچاس آدمیوں کی قسم کے ذریعہ خود کو تم سے بچا لیں گے وہ بولے: اللہ کے رسول! یہ کافر لوگ ہیں ( ان کی قسموں کا کیا اعتبار؟ ) چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے انہیں اپنی طرف سے دیت دے دی، سہل کہتے ہیں: ایک دن میں ان کے شتر خانے میں گیا، تو ان اونٹوں میں سے ایک اونٹنی نے مجھے لات مار دی، حماد نے یہی کہا یا اس جیسی کوئی بات کہی۔ ابوداؤد کہتے ہیں: اسے بشر بن مفضل اور مالک نے یحییٰ بن سعید سے روایت کیا ہے اس میں ہے: کیا تم پچاس قسمیں کھا کر اپنے ساتھی کے خون، یا اپنے قاتل کے مستحق ہوتے ہو؟ البتہ بشر نے لفظ دم یعنی خون کا ذکر نہیں کیا ہے، اور عبدہ نے یحییٰ سے اسی طرح روایت کی ہے جیسے حماد نے کی ہے، اور اسے ابن عیینہ نے یحییٰ سے روایت کیا ہے، تو انہوں نے ابتداء «تبرئكم يهود بخمسين يمينا يحلفون» سے کی ہے اور استحقاق کا ذکر انہوں نے نہیں کیا ہے۔ ابوداؤد کہتے ہیں: یہ ابن عیینہ کا وہم ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 27
			}
		}
	]
}