{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 453,
			"arabicnumber": 453,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لائے تو آپ شہر کے بالائی حصہ میں ایک محلہ میں اترے، جسے بنی عمرو بن عوف کا محلہ کہا جاتا تھا، وہاں آپ صلی اللہ علیہ وسلم چودہ دن تک قیام پذیر رہے، پھر آپ نے بنو نجار کے لوگوں کو بلوایا تو وہ اپنی تلواریں لٹکائے آئے، انس رضی اللہ عنہ کہتے ہیں: گویا میں اس وقت رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہا ہوں، آپ اپنی اونٹنی پر سوار ہیں اور ابوبکر رضی اللہ عنہ آپ کے پیچھے سوار ہیں، اور بنو نجار کے لوگ آپ صلی اللہ علیہ وسلم کے اردگرد ہیں یہاں تک کہ آپ ابوایوب رضی اللہ عنہ کے مکان کے صحن میں اترے، جس جگہ نماز کا وقت آ جاتا آپ صلی اللہ علیہ وسلم نماز پڑھ لیتے تھے، بکریوں کے باڑے میں بھی نماز پڑھ لیتے، پھر آپ صلی اللہ علیہ وسلم نے مسجد بنانے کا حکم فرمایا اور بنو نجار کے لوگوں کو بلوایا، ( وہ آئے ) تو آپ صلی اللہ علیہ وسلم نے ان سے فرمایا: اے بنو نجار! تم مجھ سے اپنے اس باغ کی قیمت لے لو ، انہوں نے کہا: اللہ کی قسم! ہم اس کی قیمت اللہ ہی سے چاہتے ہیں۔ انس رضی اللہ عنہ کہتے ہیں: اس باغ میں جو چیزیں تھیں وہ میں تمہیں بتاتا ہوں: اس میں مشرکوں کی قبریں تھیں، ویران جگہیں، کھنڈرات اور کھجور کے درخت تھے، آپ صلی اللہ علیہ وسلم نے حکم فرمایا، مشرکوں کی قبریں کھود کر پھینک دی گئیں، ویران جگہیں اور کھنڈر ہموار کر دیئے گئے، کھجور کے درخت کاٹ ڈالے گئے، ان کی لکڑیاں مسجد کے قبلے کی طرف قطار سے لگا دی گئیں اور اس کے دروازے کی چوکھٹ کے دونوں بازو پتھروں سے بنائے گئے، لوگ پتھر اٹھاتے جاتے تھے اور اشعار پڑھتے جاتے تھے، آپ صلی اللہ علیہ وسلم بھی ان کے ساتھ تھے اور فرماتے تھے: «اللهم لا خير إلا خير الآخره فانصر الأنصار والمهاجره» اے اللہ! بھلائی تو دراصل آخرت کی بھلائی ہے تو تو انصار و مہاجرین کی مدد فرما۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 63
			}
		}
	]
}