{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4659,
			"arabicnumber": 4659,
			"text": "عمرو بن ابی قرہ کہتے ہیں کہ حذیفہ رضی اللہ عنہ مدائن میں تھے اور وہ ان باتوں کا ذکر کیا کرتے تھے، جو رسول اللہ صلی اللہ علیہ وسلم نے اپنے اصحاب میں سے بعض لوگوں سے غصہ کی حالت میں فرمائی تھیں، پھر ان میں سے کچھ لوگ جو حذیفہ سے باتیں سنتے چل کر سلمان رضی اللہ عنہ کے پاس آتے اور ان سے حذیفہ رضی اللہ عنہ کی باتوں کا تذکرہ کرتے تو سلمان رضی اللہ عنہ کہتے: حذیفہ ہی اپنی کہی باتوں کو بہتر جانتے ہیں، تو وہ لوگ حذیفہ کے پاس لوٹ کر آتے اور ان سے کہتے: ہم نے آپ کی باتوں کا تذکرہ سلمان سے کیا تو انہوں نے نہ آپ کی تصدیق کی اور نہ تکذیب، یہ سن کر حذیفہ سلمان کے پاس آئے، وہ اپنی ترکاری کے کھیت میں تھے کہنے لگے: اے سلمان! ان باتوں میں میری تصدیق کرنے سے آپ کو کون سی چیز روک رہی ہے جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ہیں؟ تو سلمان نے کہا: رسول اللہ صلی اللہ علیہ وسلم بلاشبہ کبھی غصے میں اپنے بعض اصحاب سے کچھ باتیں کہہ دیتے اور کبھی خوش ہوتے تو خوشی میں اپنے بعض اصحاب سے کچھ باتیں کہہ دیتے، تو کیا آپ اس وقت تک باز نہ آئیں گے جب تک کہ بعض لوگوں کے دلوں میں بعض لوگوں کی محبت اور بعض دوسروں کے دلوں میں بعض کی دشمنی نہ ڈال دیں اور ان کو اختلاف میں مبتلا نہ کر دیں، حالانکہ آپ جانتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے ایک خطبہ میں فرمایا: میں نے اپنی امت کے کسی فرد کو غصے کی حالت میں اگر برا بھلا کہا یا اسے لعن طعن کی تو میں بھی تو آدم کی اولاد میں سے ہوں، مجھے بھی غصہ آتا ہے جیسے انہیں آتا ہے، لیکن اللہ نے مجھے رحمۃ للعالمین بنا کر بھیجا ہے تو ( اے اللہ ) میرے برا بھلا کہنے اور لعن طعن کو ان لوگوں کے لیے قیامت کے روز رحمت بنا دے اللہ کی قسم یا تو آپ اپنی اس حرکت سے باز آ جائیں ورنہ میں عمر بن الخطاب ( امیر المؤمنین ) کو لکھ بھیجوں گا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 64
			}
		}
	]
}