{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "جبیر بن مطعم رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک اعرابی آیا اور کہا: اللہ کے رسول! لوگ مصیبت میں پڑ گئے، گھربار تباہ ہو گئے، مال گھٹ گئے، جانور ہلاک ہو گئے، لہٰذا آپ ہمارے لیے بارش کی دعا کیجئے، ہم آپ کو سفارشی بناتے ہیں اللہ کے دربار میں، اور اللہ کو سفارشی بناتے ہیں آپ کے دربار میں، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تمہارا برا ہو، سمجھتے ہو تم کیا کہہ رہے ہو؟ پھر رسول اللہ صلی اللہ علیہ وسلم سبحان اللہ کہنے لگے، اور برابر کہتے رہے یہاں تک کہ اس کا اثر آپ صلی اللہ علیہ وسلم کے اصحاب کے چہروں پر دیکھا گیا، پھر فرمایا: تمہارا برا ہو اللہ کو اس کی مخلوق میں سے کسی کے دربار میں سفارشی نہیں بنایا جا سکتا، اللہ کی شان اس سے بہت بڑی ہے، تمہارا برا ہو! کیا تم جانتے ہو اللہ کیا ہے، اس کا عرش اس کے آسمانوں پر اس طرح ہے ( آپ نے انگلیوں سے گنبد کے طور پر اشارہ کیا ) اور وہ چرچراتا ہے جیسے پالان سوار کے بیٹھنے سے چرچراتا ہے، ( ابن بشار کی حدیث میں ہے ) اللہ تعالیٰ اپنے عرش کے اوپر ہے، اور اس کا عرش اس کے آسمانوں کے اوپر ہے اور پھر پوری حدیث ذکر کی۔ عبدالاعلی، ابن مثنی اور ابن بشار تینوں نے یعقوب بن عتبہ اور جبیر بن محمد بن جبیر سے ان دونوں نے محمد بن جبیر سے اور محمد بن جبیر نے جبیر بن مطعم سے روایت کی ہے۔ البتہ احمد بن سعید کی سند والی حدیث ہی صحیح ہے، اس پر ان کی موافقت ایک جماعت نے کی ہے، جس میں یحییٰ بن معین اور علی بن مدینی بھی شامل ہیں اور اسے ایک جماعت نے ابن اسحاق سے روایت کیا ہے جیسا کہ احمد بن سعید نے بھی کہا ہے، اور عبدالاعلی، ابن مثنی اور ابن بشار کا سماع جیسا کہ مجھے معلوم ہوا ہے، ایک ہی نسخے سے ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 131
			}
		}
	]
}