{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4768,
			"arabicnumber": 4768,
			"text": "زید بن وہب جہنی بیان کرتے ہیں کہ وہ اس فوج میں شامل تھے جو علی رضی اللہ عنہ کے ساتھ تھی، اور جو خوارج کی طرف گئی تھی، علی نے کہا: اے لوگو! میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے: میری امت میں کچھ لوگ ایسے نکلیں گے کہ وہ قرآن پڑھیں گے، تمہارا پڑھنا ان کے پڑھنے کے مقابلے کچھ نہ ہو گا، نہ تمہاری نماز ان کی نماز کے مقابلے کچھ ہو گی، اور نہ ہی تمہارا روزہ ان کے روزے کے مقابلے کچھ ہو گا، وہ قرآن پڑھیں گے، اور سمجھیں گے کہ وہ ان کے لیے ( ثواب ) ہے حالانکہ وہ ان پر ( عذاب ) ہو گا، ان کی صلاۃ ان کے حلق سے نیچے نہ اترے گی، وہ اسلام سے نکل جائیں گے، جس طرح تیر شکار سے نکل جاتا ہے، اگر ان لوگوں کو جو انہیں قتل کریں گے، یہ معلوم ہو جائے کہ ان کے لیے ان کے نبی اکرم صلی اللہ علیہ وسلم کی زبانی کس چیز کا فیصلہ کیا گیا ہے، تو وہ ضرور اسی عمل پر بھروسہ کر لیں گے ( اور دوسرے نیک اعمال چھوڑ بیٹھیں گے ) ان کی نشانی یہ ہے کہ ان میں ایک ایسا آدمی ہو گا جس کے بازو ہو گا، لیکن ہاتھ نہ ہو گا، اس کے بازو پر پستان کی گھنڈی کی طرح ایک گھنڈی ہو گی، اس کے اوپر کچھ سفید بال ہوں گے تو کیا تم لوگ معاویہ اور اہل شام سے لڑنے جاؤ گے، اور انہیں اپنی اولاد اور اسباب پر چھوڑ دو گے ( کہ وہ ان پر قبضہ کریں اور انہیں برباد کریں ) اللہ کی قسم مجھے امید ہے کہ یہی وہ لوگ ہیں ( جن کے بارے میں نبی اکرم صلی اللہ علیہ وسلم کا فرمان ہے ) اس لیے کہ انہوں نے ناحق خون بہایا ہے، لوگوں کی چراگاہوں پر شب خون مارا ہے، چلو اللہ کے نام پر۔ سلمہ بن کہیل کہتے ہیں: پھر زید بن وہب نے مجھے ایک ایک مقام بتایا ( جہاں سے ہو کر وہ خارجیوں سے لڑنے گئے تھے ) یہاں تک کہ وہ ہمیں لے کر ایک پل سے گزرے۔ وہ کہتے ہیں: جب ہماری مڈبھیڑ ہوئی تو خارجیوں کا سردار عبداللہ بن وہب راسبی تھا اس نے ان سے کہا: نیزے پھینک دو اور تلواروں کو میان سے کھینچ لو، مجھے اندیشہ ہے کہ کہیں وہ تم سے اسی طرح صلح کا مطالبہ نہ کریں جس طرح انہوں نے تم سے حروراء کے دن کیا تھا، چنانچہ انہوں نے اپنے نیز ے پھینک دئیے، تلواریں کھینچ لیں، لوگوں ( مسلمانوں ) نے انہیں اپنے نیزوں سے روکا اور انہوں نے انہیں ایک پر ایک کر کے قتل کیا اور ( مسلمانوں میں سے ) اس دن صرف دو آدمی شہید ہوئے، علی رضی اللہ عنہ نے کہا: ان میں «مخدج» یعنی لنجے کو تلاش کرو، لیکن وہ نہ پا سکے، تو آپ خود اٹھے اور ان لوگوں کے پاس آئے جو ایک پر ایک کر کے مارے گئے تھے، آپ نے کہا: انہیں نکالو، تو انہوں نے اسے دیکھا کہ وہ سب سے نیچے زمین پر پڑا ہے، آپ نے نعرہ تکبیر بلند کیا اور بولے: اللہ نے سچ فرمایا اور اس کے رسول نے ساری باتیں پہنچا دیں۔ پھر عبیدہ سلمانی آپ کی طرف اٹھ کر آئے کہنے لگے: اے امیر المؤمنین! قسم ہے اس ذات کی جس کے سوا کوئی لائق عبادت نہیں کیا آپ نے اسے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے؟ وہ بولے: ہاں، اللہ کی قسم جس کے سوا کوئی لائق عبادت نہیں، یہاں تک کہ انہوں نے انہیں تین بار قسم دلائی اور وہ ( تینوں بار ) قسم کھاتے رہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 173
			}
		}
	]
}