{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4904,
			"arabicnumber": 4904,
			"text": "سہل بن ابی امامہ کا بیان ہے کہ وہ اور ان کے والد عمر بن عبدالعزیز کے زمانے میں جب وہ مدینے کے گورنر تھے، مدینے میں انس رضی اللہ عنہ کے پاس گئے تو دیکھا، وہ ہلکی یا مختصر نماز پڑھ رہے ہیں، جیسے وہ مسافر کی نماز ہو یا اس سے قریب تر کوئی نماز، جب انہوں نے سلام پھیرا تو میرے والد نے کہا: اللہ آپ پر رحم کرے، آپ بتائیے کہ یہ فرض نماز تھی یا آپ کوئی نفلی نماز پڑھ رہے تھے تو انہوں نے کہا: یہ فرض نماز تھی، اور یہ رسول اللہ صلی اللہ علیہ وسلم کی نماز ہے، اور جب بھی مجھ سے کوئی غلطی ہوتی ہے، میں اس کے بدلے سجدہ سہو کر لیتا ہوں، پھر کہنے لگے: رسول اللہ صلی اللہ علیہ وسلم فرماتے تھے: اپنی جانوں پر سختی نہ کرو ۲؎ کہ تم پر سختی کی جائے۳؎ اس لیے کہ کچھ لوگوں نے اپنے اوپر سختی کی تو اللہ تعالیٰ نے بھی ان پر سختی کر دی تو ایسے ہی لوگوں کے باقی ماندہ لوگ گرجا گھروں میں ہیں انہوں نے رہبانیت کی شروعات کی جو کہ ہم نے ان پر فرض نہیں کی تھی پھر جب دوسرے دن صبح ہوئی تو کہا: کیا تم سواری نہیں کرتے یعنی سفر نہیں کرتے کہ دیکھو اور نصیحت حاصل کرو، انہوں نے کہا: ہاں ( کرتے ہیں ) پھر وہ سب سوار ہوئے تو جب وہ اچانک کچھ ایسے گھروں کے پاس پہنچے، جہاں کے لوگ ہلاک اور فنا ہو کر ختم ہو چکے تھے، اور گھر چھتوں کے بل گرے ہوئے تھے، تو انہوں نے کہا: کیا تم ان گھروں کو پہنچانتے ہو؟ میں نے کہا: مجھے کس نے ان کے اور ان کے لوگوں کے بارے میں بتایا؟ ( یعنی میں نہیں جانتا ) تو انس نے کہا: یہ ان لوگوں کے گھر ہیں جنہیں ان کے ظلم اور حسد نے ہلاک کر دیا، بیشک حسد نیکیوں کے نور کو گل کر دیتا ہے اور ظلم اس کی تصدیق کرتا ہے یا تکذیب اور آنکھ زنا کرتی ہے اور ہتھیلی، قدم جسم اور زبان بھی اور شرمگاہ اس کی تصدیق یا تکذیب کرتی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 132
			}
		}
	]
}