{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "عبداللہ بن زید رضی اللہ عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم نے ناقوس کی تیاری کا حکم دینے کا ارادہ کیا تاکہ لوگوں کو نماز کی خاطر جمع ہونے کے لیے اسے بجایا جا سکے تو ایک رات میں نے خواب دیکھا کہ ایک شخص ۱؎ کے ہاتھ میں ناقوس ہے، میں نے اس سے پوچھا: اللہ کے بندے! کیا اسے فروخت کرو گے؟ اس نے کہا: تم اسے کیا کرو گے؟ میں نے کہا: ہم اس کے ذریعے لوگوں کو نماز کے لیے بلائیں گے، اس شخص نے کہا: کیا میں تمہیں اس سے بہتر چیز نہ بتا دوں؟ میں نے کہا: کیوں نہیں، ضرور بتائیے، تو اس نے کہا: تم اس طرح کہو «الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله» اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، میں گواہی دیتا ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں، نماز کے لیے آؤ، نماز کے لیے آؤ، کامیابی کی طرف آؤ، کامیابی کی طرف آؤ، اللہ سب سے بڑا ہے، اللہ سب سے بڑا ہے، اللہ کے سوا کوئی معبود برحق نہیں۔ عبداللہ بن زید رضی اللہ عنہ کہتے ہیں: پھر وہ شخص مجھ سے تھوڑا پیچھے ہٹ گیا، زیادہ دور نہیں گیا پھر اس نے کہا: جب تم نماز کے لیے کھڑے ہو تو اس طرح کہو: «الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله حى على الصلاة حى على الفلاح قد قامت الصلاة قد قامت الصلاة الله أكبر الله أكبر لا إله إلا الله» ۔ پھر جب صبح ہوئی تو میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور جو کچھ میں نے دیکھا تھا اسے آپ سے بیان کیا۔ آپ صلی اللہ علیہ وسلم نے فرمایا: ان شاءاللہ یہ خواب سچا ہے ، پھر فرمایا: تم بلال کے ساتھ اٹھ کر جاؤ اور جو کلمات تم نے خواب میں دیکھے ہیں وہ انہیں بتاتے جاؤ تاکہ اس کے مطابق وہ اذان دیں کیونکہ ان کی آواز تم سے بلند ہے ۲؎۔ چنانچہ میں بلال کے ساتھ اٹھ کھڑا ہوا، میں انہیں اذان کے کلمات بتاتا جاتا تھا اور وہ اسے پکارتے جاتے تھے۔ وہ کہتے ہیں: تو عمر بن خطاب رضی اللہ عنہ نے اسے اپنے گھر میں سے سنا تو وہ اپنی چادر گھسیٹتے ہوئے نکلے اور کہہ رہے تھے: اللہ کے رسول! اس ذات کی قسم! جس نے آپ کو حق کے ساتھ بھیجا ہے، میں نے بھی اسی طرح دیکھا ہے جس طرح عبداللہ رضی اللہ عنہ نے دیکھا ہے، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: الحمدللہ ۔ ابوداؤد کہتے ہیں: اسی طرح زہری کی روایت ہے، جسے انہوں نے سعید بن مسیب سے، اور سعید نے عبداللہ بن زید رضی اللہ عنہ سے روایت کیا ہے، اس میں ابن اسحاق نے زہری سے یوں نقل کیا ہے: «الله أكبر الله أكبر الله أكبر الله أكبر» ( یعنی چار بار ) اور معمر اور یونس نے زہری سے صرف «الله أكبر الله أكبر» کی روایت کی ہے، اسے انہوں نے دہرایا نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		}
	]
}