{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5063,
			"arabicnumber": 5063,
			"text": "ابوسلورد بن ثمامہ کہتے ہیں کہ علی رضی اللہ عنہ نے ابن اعبد سے کہا: کیا میں تم سے اپنے اور رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی فاطمہ رضی اللہ عنہا سے متعلق واقعہ نہ بیان کروں، فاطمہ رسول اللہ صلی اللہ علیہ وسلم کو اپنے گھر والوں میں سب سے زیادہ پیاری تھیں اور میری زوجیت میں تھیں، چکی پیستے پیستے ان کے ہاتھ میں نشان پڑ گئے، مشکیں بھرتے بھرتے ان کے سینے میں نشان پڑ گئے، گھر کی صفائی کرتے کرتے ان کے کپڑے گرد آلود ہو گئے، کھانا پکاتے پکاتے کپڑے کالے ہو گئے، اس سے انہیں نقصان پہنچا ( صحت متاثر ہوئی ) پھر ہم نے سنا کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس غلام اور لونڈیاں لائی گئی ہیں، تو میں نے فاطمہ سے کہا: اگر تم اپنے والد کے پاس جاتیں اور ان سے خادم مانگتیں تو تمہاری ضرورت پوری ہو جاتی، تو وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں، لیکن وہاں لوگوں کو آپ کے پاس بیٹھے باتیں کرتے ہوئے پایا تو شرم سے بات نہ کہہ سکیں اور لوٹ آئیں، دوسرے دن صبح آپ خود ہمارے پاس تشریف لے آئے ( اس وقت ) ہم اپنے لحافوں میں تھے، آپ فاطمہ کے سر کے پاس بیٹھ گئے، فاطمہ نے والد سے شرم کھا کر اپنا سر لحاف میں چھپا لیا، آپ نے پوچھا: کل تم محمد کے اہل و عیال کے پاس کس ضرورت سے آئی تھیں؟ فاطمہ دو بار سن کر چپ رہیں تو میں نے عرض کیا: اللہ کے رسول! میں آپ کو بتاتا ہوں: انہوں نے میرے یہاں رہ کر اتنا چکی پیسی کہ ان کے ہاتھ میں گھٹا پڑ گیا، مشک ڈھو ڈھو کر لاتی رہیں یہاں تک کہ سینے پر اس کے نشان پڑ گئے، انہوں نے گھر کے جھاڑو دیئے یہاں تک کہ ان کے کپڑے گرد آلود ہو گئے، ہانڈیاں پکائیں، یہاں تک کہ کپڑے کالے ہو گئے، اور مجھے معلوم ہوا کہ آپ کے پاس غلام اور لونڈیاں آئیں ہیں تو میں نے ان سے کہا کہ وہ آپ کے پاس جا کر اپنے لیے ایک خادمہ مانگ لیں، پھر راوی نے حکم والی حدیث کے ہم معنی حدیث ذکر کی اور پوری ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 291
			}
		}
	]
}