{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"13": "The Book on Divorce and Li'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "حدثنا قتيبة بن سعيد، حدثنا حماد بن زيد، عن أيوب، عن محمد بن سيرين، عن يونس بن جبير، قال سألت ابن عمر عن رجل، طلق امرأته وهي حائض فقال هل تعرف عبد الله بن عمر فإنه طلق امرأته وهي حائض فسأل عمر النبي صلى الله عليه وسلم فأمره أن يراجعها ‏.‏ قال قلت فيعتد بتلك التطليقة قال فمه أرأيت إن عجز واستحمق",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": 1176,
			"text": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن سالم، عن أبيه، أنه طلق امرأته في الحيض فسأل عمر النبي صلى الله عليه وسلم فقال ‏ \"‏ مره فليراجعها ثم ليطلقها طاهرا أو حاملا ‏\"‏ ‏.‏ قال أبو عيسى حديث يونس بن جبير عن ابن عمر حديث حسن صحيح وكذلك حديث سالم عن ابن عمر وقد روي هذا الحديث من غير وجه عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن طلاق السنة أن يطلقها طاهرا من غير جماع ‏.‏ وقال بعضهم إن طلقها ثلاثا وهي طاهر فإنه يكون للسنة أيضا ‏.‏ وهو قول الشافعي وأحمد بن حنبل ‏.‏ وقال بعضهم لا تكون ثلاثا للسنة إلا أن يطلقها واحدة واحدة ‏.‏ وهو قول سفيان الثوري وإسحاق ‏.‏ وقالوا في طلاق الحامل يطلقها متى شاء ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعضهم يطلقها عند كل شهر تطليقة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": 1177,
			"text": "حدثنا هناد، حدثنا قبيصة، عن جرير بن حازم، عن الزبير بن سعيد، عن عبد الله بن يزيد بن ركانة، عن أبيه، عن جده، قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إني طلقت امرأتي البتة ‏.‏ فقال ‏\"‏ ما أردت بها ‏\"‏ ‏.‏ قلت واحدة ‏.‏ قال ‏\"‏ والله ‏\"‏ ‏.‏ قلت والله ‏.‏ قال ‏\"‏ فهو ما أردت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من هذا الوجه وسألت محمدا عن هذا الحديث فقال فيه اضطراب ‏.‏ ويروى عن عكرمة عن ابن عباس أن ركانة طلق امرأته ثلاثا ‏.‏ - وقد اختلف أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في طلاق البتة فروي عن عمر بن الخطاب أنه جعل البتة واحدة وروي عن علي أنه جعلها ثلاثا ‏.‏ وقال بعض أهل العلم فيه نية الرجل إن نوى واحدة فواحدة وإن نوى ثلاثا فثلاث وإن نوى ثنتين لم تكن إلا واحدة ‏.‏ وهو قول الثوري وأهل الكوفة ‏.‏ وقال مالك بن أنس في البتة إن كان قد دخل بها فهي ثلاث تطليقات ‏.‏ وقال الشافعي إن نوى واحدة فواحدة يملك الرجعة وإن نوى ثنتين فثنتان وإن نوى ثلاثا فثلاث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": 1178,
			"text": "حدثنا علي بن نصر بن علي، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، قال قلت لأيوب هل علمت أن أحدا قال في أمرك بيدك أنها ثلاث إلا الحسن فقال لا إلا الحسن ‏.‏ ثم قال اللهم غفرا إلا ما حدثني قتادة عن كثير مولى ابن سمرة عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏ \"‏ ثلاث ‏\"‏ ‏.‏ قال أيوب فلقيت كثيرا - مولى ابن سمرة فسألته فلم يعرفه فرجعت إلى قتادة فأخبرته فقال نسي ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث سليمان بن حرب عن حماد بن زيد ‏.‏ وسألت محمدا عن هذا الحديث، فقال حدثنا سليمان بن حرب، عن حماد بن زيد، بهذا وإنما هو عن أبي هريرة، موقوف ‏.‏ ولم يعرف حديث أبي هريرة مرفوعا ‏.‏ وكان علي بن نصر حافظا صاحب حديث ‏.‏ وقد اختلف أهل العلم في أمرك بيدك فقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم منهم عمر بن الخطاب وعبد الله بن مسعود هي واحدة ‏.‏ وهو قول غير واحد من أهل العلم من التابعين ومن بعدهم ‏.‏ وقال عثمان بن عفان وزيد بن ثابت القضاء ما قضت ‏.‏ وقال ابن عمر إذا جعل أمرها بيدها وطلقت نفسها ثلاثا وأنكر الزوج وقال لم أجعل أمرها بيدها إلا في واحدة استحلف الزوج وكان القول قوله مع يمينه ‏.‏ وذهب سفيان وأهل الكوفة إلى قول عمر وعبد الله ‏.‏ وأما مالك بن أنس فقال القضاء ما قضت ‏.‏ وهو قول أحمد ‏.‏ وأما إسحاق فذهب إلى قول ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1179,
			"arabicnumber": 1179,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن إسماعيل بن أبي خالد، عن الشعبي، عن مسروق، عن عائشة، قالت خيرنا رسول الله صلى الله عليه وسلم فاخترناه أفكان طلاقا؟ حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة، بمثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ واختلف أهل العلم في الخيار فروي عن عمر وعبد الله بن مسعود أنهما قالا إن اختارت نفسها فواحدة بائنة ‏.‏ وروي عنهما أنهما قالا أيضا واحدة يملك الرجعة وإن اختارت زوجها فلا شىء ‏.‏ وروي عن علي أنه قال إن اختارت نفسها فواحدة بائنة وإن اختارت زوجها فواحدة يملك الرجعة ‏.‏ وقال زيد بن ثابت إن اختارت زوجها فواحدة وإن اختارت نفسها فثلاث ‏.‏ وذهب أكثر أهل العلم والفقه من أصحاب النبي صلى الله عليه وسلم ومن بعدهم في هذا الباب إلى قول عمر وعبد الله وهو قول الثوري وأهل الكوفة وأما أحمد بن حنبل فذهب إلى قول علي رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1180,
			"arabicnumber": 1180,
			"text": "حدثنا هناد، حدثنا جرير، عن مغيرة، عن الشعبي، قال قالت فاطمة بنت قيس طلقني زوجي ثلاثا على عهد النبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ لا سكنى لك ولا نفقة ‏\"‏ ‏.‏ قال مغيرة فذكرته لإبراهيم فقال قال عمر لا ندع كتاب الله وسنة نبينا صلى الله عليه وسلم لقول امرأة لا ندري أحفظت أم نسيت ‏.‏ وكان عمر يجعل لها السكنى والنفقة ‏.‏ حدثنا أحمد بن منيع، حدثنا هشيم، أنبأنا حصين، وإسماعيل، ومجالد، قال هشيم وحدثنا داود، أيضا عن الشعبي، قال دخلت على فاطمة بنت قيس فسألتها عن قضاء، رسول الله صلى الله عليه وسلم فيها فقالت طلقها زوجها البتة فخاصمته في السكنى والنفقة فلم يجعل لها النبي صلى الله عليه وسلم سكنى ولا نفقة ‏.‏ وفي حديث داود قالت وأمرني أن أعتد في بيت ابن أم مكتوم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول بعض أهل العلم منهم الحسن البصري وعطاء بن أبي رباح والشعبي وبه يقول أحمد وإسحاق ‏.‏ وقالوا ليس للمطلقة سكنى ولا نفقة إذا لم يملك زوجها الرجعة ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر وعبد الله إن المطلقة ثلاثا لها السكنى والنفقة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏ وقال بعض أهل العلم لها السكنى ولا نفقة لها ‏.‏ وهو قول مالك بن أنس والليث بن سعد والشافعي ‏.‏ وقال الشافعي إنما جعلنا لها السكنى بكتاب الله قال الله تعالى‏:‏ ‏(‏لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة ‏)‏ قالوا هو البذاء أن تبذو على أهلها ‏.‏ واعتل بأن فاطمة بنت قيس لم يجعل لها النبي صلى الله عليه وسلم السكنى لما كانت تبذو على أهلها ‏.‏ قال الشافعي ولا نفقة لها لحديث رسول الله صلى الله عليه وسلم في قصة حديث فاطمة بنت قيس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": 1181,
			"text": "حدثنا أحمد بن منيع، حدثنا هشيم، حدثنا عامر الأحول، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا نذر لابن آدم فيما لا يملك ولا عتق له فيما لا يملك ولا طلاق له فيما لا يملك ‏\"‏ ‏.‏ قال وفي الباب عن علي ومعاذ بن جبل وجابر وابن عباس وعائشة ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن صحيح وهو أحسن شيء روي في هذا الباب ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم روي ذلك عن علي بن أبي طالب وابن عباس وجابر بن عبد الله وسعيد بن المسيب والحسن وسعيد بن جبير وعلي بن الحسين وشريح وجابر بن زيد وغير واحد من فقهاء التابعين وبه يقول الشافعي ‏.‏ وروي عن ابن مسعود أنه قال في المنصوبة إنها تطلق ‏.‏ وقد روي عن إبراهيم النخعي والشعبي وغيرهما من أهل العلم أنهم قالوا إذا وقت نزل ‏.‏ وهو قول سفيان الثوري ومالك بن أنس أنه إذا سمى امرأة بعينها أو وقت وقتا أو قال إن تزوجت من كورة كذا فإنه إن تزوج فإنها تطلق ‏.‏ وأما ابن المبارك فشدد في هذا الباب وقال إن فعل لا أقول هي حرام ‏.‏ وقال أحمد إن تزوج لا آمره أن يفارق امرأته ‏.‏ وقال إسحاق أنا أجيز في المنصوبة لحديث ابن مسعود وإن تزوجها لا أقول تحرم عليه امرأته ‏.‏ ووسع إسحاق في غير المنصوبة ‏.‏ وذكر عن عبد الله بن المبارك أنه سئل عن رجل حلف بالطلاق أنه لا يتزوج ثم بدا له أن يتزوج هل له رخصة بأن يأخذ بقول الفقهاء الذين رخصوا في هذا فقال عبد الله بن المبارك إن كان يرى هذا القول حقا من قبل أن يبتلى بهذه المسألة فله أن يأخذ بقولهم فأما من لم يرض بهذا فلما ابتلي أحب أن يأخذ بقولهم فلا أرى له ذلك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": 1182,
			"text": "حدثنا محمد بن يحيى النيسابوري، حدثنا أبو عاصم، عن ابن جريج، قال حدثني مظاهر بن أسلم، قال حدثني القاسم، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ طلاق الأمة تطليقتان وعدتها حيضتان ‏\"‏ ‏.‏ قال محمد بن يحيى وحدثنا أبو عاصم، أنبأنا مظاهر، بهذا ‏.‏ قال وفي الباب عن عبد الله بن عمر، ‏.‏ قال أبو عيسى حديث عائشة حديث غريب لا نعرفه مرفوعا إلا من حديث مظاهر بن أسلم ومظاهر لا نعرف له في العلم غير هذا الحديث ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": 1183,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ تجاوز الله لأمتي ما حدثت به أنفسها ما لم تكلم به أو تعمل به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم أن الرجل إذا حدث نفسه بالطلاق لم يكن شيء حتى يتكلم به ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": 1184,
			"text": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن عبد الرحمن بن أردك، عن عطاء، عن ابن ماهك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاث جدهن جد وهزلهن جد النكاح والطلاق والرجعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏ قال أبو عيسى وعبد الرحمن هو ابن حبيب بن أردك المدني وابن ماهك هو عندي يوسف بن ماهك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": 1185,
			"text": "حدثنا محمود بن غيلان، أنبأنا الفضل بن موسى، عن سفيان، أنبأنا محمد بن عبد الرحمن، وهو مولى آل طلحة عن سليمان بن يسار، عن الربيع بنت معوذ بن عفراء، أنها اختلعت على عهد النبي صلى الله عليه وسلم فأمرها النبي صلى الله عليه وسلم - أو أمرت - أن تعتد بحيضة ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث الربيع الصحيح أنها أمرت أن تعتد بحيضة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1186,
			"arabicnumber": 1186,
			"text": "حدثنا أبو كريب، حدثنا مزاحم بن ذواد بن علبة، عن أبيه، عن ليث، عن أبي الخطاب، عن أبي زرعة، عن أبي إدريس، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ المختلعات هن المنافقات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏ وروي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أيما امرأة اختلعت من زوجها من غير بأس لم ترح رائحة الجنة ‏\"‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": 1187,
			"text": "أنبأنا بذلك بندار أنبأنا عبد الوهاب أنبأنا أيوب عن أبي قلابة عمن حدثه عن ثوبان أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما امرأة سألت زوجها طلاقا من غير بأس فحرام عليها رائحة الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ويروى هذا الحديث عن أيوب عن أبي قلابة عن أبي أسماء عن ثوبان ‏.‏ ورواه بعضهم عن أيوب بهذا الإسناد ولم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1188,
			"arabicnumber": 1188,
			"text": "حدثنا عبد الله بن أبي زياد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن المرأة كالضلع إن ذهبت تقيمها كسرتها وإن تركتها استمتعت بها على عوج ‏\"‏ ‏.‏ قال وفي الباب عن أبي ذر وسمرة وعائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "حدثنا أحمد بن محمد، أنبأنا ابن المبارك، أنبأنا ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن حمزة بن عبد الله بن عمر، عن ابن عمر، قال كانت تحتي امرأة أحبها وكان أبي يكرهها فأمرني أبي أن أطلقها فأبيت فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏ \"‏ يا عبد الله بن عمر طلق امرأتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح إنما نعرفه من حديث ابن أبي ذئب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": 1190,
			"text": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم قال ‏ \"‏ لا تسأل المرأة طلاق أختها لتكتفئ ما في إنائها ‏\"‏ ‏.‏ قال وفي الباب عن أم سلمة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1191,
			"arabicnumber": 1191,
			"text": "حدثنا محمد بن عبد الأعلى الصنعاني، أنبأنا مروان بن معاوية الفزاري، عن عطاء بن عجلان، عن عكرمة بن خالد المخزومي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كل طلاق جائز إلا طلاق المعتوه المغلوب على عقله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مرفوعا إلا من حديث عطاء بن عجلان ‏.‏ وعطاء بن عجلان ضعيف ذاهب الحديث ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن طلاق المعتوه المغلوب على عقله لا يجوز إلا أن يكون معتوها يفيق الأحيان فيطلق في حال إفاقته ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": 1192,
			"text": "حدثنا قتيبة، حدثنا يعلى بن شبيب، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان الناس والرجل يطلق امرأته ما شاء أن يطلقها وهي امرأته إذا ارتجعها وهي في العدة وإن طلقها مائة مرة أو أكثر حتى قال رجل لامرأته والله لا أطلقك فتبيني مني ولا آويك أبدا ‏.‏ قالت وكيف ذاك قال أطلقك فكلما همت عدتك أن تنقضي راجعتك ‏.‏ فذهبت المرأة حتى دخلت على عائشة فأخبرتها فسكتت عائشة حتى جاء النبي صلى الله عليه وسلم فأخبرته فسكت النبي صلى الله عليه وسلم حتى نزل القرآن ‏:‏ ‏(‏ الطلاق مرتان فإمساك بمعروف أو تسريح بإحسان ‏)‏ قالت عائشة فاستأنف الناس الطلاق مستقبلا من كان طلق ومن لم يكن طلق ‏.‏ حدثنا أبو كريب، حدثنا عبد الله بن إدريس، عن هشام بن عروة، عن أبيه، نحو هذا الحديث بمعناه ولم يذكر فيه عن عائشة ‏.‏ قال أبو عيسى وهذا أصح من حديث يعلى بن شبيب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": 1193,
			"text": "حدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا شيبان، عن منصور، عن إبراهيم، عن الأسود، عن أبي السنابل بن بعكك، قال وضعت سبيعة بعد وفاة زوجها بثلاثة وعشرين أو خمسة وعشرين يوما فلما تعلت تشوفت للنكاح فأنكر عليها ذلك فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏ \"‏ إن تفعل فقد حل أجلها ‏\"‏ ‏.‏ حدثنا أحمد بن منيع، حدثنا الحسن بن موسى، حدثنا شيبان، عن منصور، نحوه ‏.‏ قال وفي الباب عن أم سلمة، ‏.‏ قال أبو عيسى حديث أبي السنابل حديث مشهور من هذا الوجه ‏.‏ ولا نعرف للأسود سماعا من أبي السنابل ‏.‏ وسمعت محمدا يقول لا أعرف أن أبا السنابل عاش بعد النبي صلى الله عليه وسلم ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الحامل المتوفى عنها زوجها إذا وضعت فقد حل التزويج لها وإن لم تكن انقضت عدتها ‏.‏ وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم تعتد آخر الأجلين ‏.‏ والقول الأول أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": 1194,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، عن سليمان بن يسار، أن أبا هريرة، وابن، عباس وأبا سلمة بن عبد الرحمن تذاكروا المتوفى عنها زوجها الحامل تضع عند وفاة زوجها فقال ابن عباس تعتد آخر الأجلين ‏.‏ وقال أبو سلمة بل تحل حين تضع ‏.‏ وقال أبو هريرة أنا مع ابن أخي يعني أبا سلمة فأرسلوا إلى أم سلمة زوج النبي صلى الله عليه وسلم فقالت قد وضعت سبيعة الأسلمية بعد وفاة زوجها بيسير فاستفتت رسول الله صلى الله عليه وسلم فأمرها أن تتزوج ‏.‏ قال أبو عيسى هذا حديث حسن صحيح.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": 1195,
			"text": "حدثنا الأنصاري، حدثنا معن بن عيسى، أنبأنا مالك بن أنس، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب فدعت بطيب فيه صفرة خلوق أو غيره فدهنت به جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاثة أيام إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": 1196,
			"text": "قالت زينب فدخلت على زينب بنت جحش حين توفي أخوها فدعت بطيب فمست منه ثم قالت والله ما لي في الطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": 1197,
			"text": "قالت زينب وسمعت أمي أم سلمة، تقول جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي توفي عنها زوجها وقد اشتكت عينيها أفنكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ مرتين أو ثلاث مرات كل ذلك يقول ‏\"‏ لا ‏\"‏ ‏.‏ ثم قال ‏\"‏ إنما هي أربعة أشهر وعشرا وقد كانت إحداكن في الجاهلية ترمي بالبعرة على رأس الحول ‏\"‏ ‏.‏ قال وفي الباب عن فريعة بنت مالك أخت أبي سعيد الخدري وحفصة بنت عمر ‏.‏ قال أبو عيسى حديث زينب حديث حسن صحيح ‏.‏ - والعمل على هذا عند أصحاب النبي صلى الله عليه وسلم وغيرهم أن المتوفى عنها زوجها تتقي في عدتها الطيب والزينة ‏.‏ وهو قول سفيان الثوري ومالك بن أنس والشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1198,
			"arabicnumber": 1198,
			"text": "حدثنا أبو سعيد الأشج، حدثنا عبد الله بن إدريس، عن محمد بن إسحاق، عن محمد بن عمرو بن عطاء، عن سليمان بن يسار، عن سلمة بن صخر البياضي، عن النبي صلى الله عليه وسلم في المظاهر يواقع قبل أن يكفر قال ‏ \"‏ كفارة واحدة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ والعمل على هذا عند أكثر أهل العلم وهو قول سفيان الثوري ومالك والشافعي وأحمد وإسحاق ‏.‏ وقال بعضهم إذا واقعها قبل أن يكفر فعليه كفارتان ‏.‏ وهو قول عبد الرحمن بن مهدي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": 1199,
			"text": "أنبأنا أبو عمار الحسين بن حريث، أنبأنا الفضل بن موسى، عن معمر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، أن رجلا، أتى النبي صلى الله عليه وسلم قد ظاهر من امرأته فوقع عليها فقال يا رسول الله إني قد ظاهرت من زوجتي فوقعت عليها قبل أن أكفر ‏.‏ فقال ‏\"‏ وما حملك على ذلك يرحمك الله ‏\"‏ ‏.‏ قال رأيت خلخالها في ضوء القمر ‏.‏ قال ‏\"‏ فلا تقربها حتى تفعل ما أمرك الله به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": 1200,
			"text": "حدثنا إسحاق بن منصور، أنبأنا هارون بن إسماعيل الخزاز، أنبأنا علي بن المبارك، أنبأنا يحيى بن أبي كثير، أنبأنا أبو سلمة، ومحمد بن عبد الرحمن بن ثوبان، أن سلمان بن صخر الأنصاري، أحد بني بياضة جعل امرأته عليه كظهر أمه حتى يمضي رمضان فلما مضى نصف من رمضان وقع عليها ليلا فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أعتق رقبة ‏\"‏ ‏.‏ قال لا أجدها ‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏ ‏.‏ قال لا أستطيع ‏.‏ قال ‏\"‏ أطعم ستين مسكينا ‏\"‏ ‏.‏ قال لا أجد ‏.‏ فقال رسول الله صلى الله عليه وسلم لفروة بن عمرو ‏\"‏ أعطه ذلك العرق ‏\"‏ ‏.‏ وهو مكتل يأخذ خمسة عشر صاعا أو ستة عشر صاعا فقال ‏\"‏ أطعم ستين مسكينا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ يقال سلمان بن صخر ويقال سلمة بن صخر البياضي ‏.‏ والعمل على هذا الحديث عند أهل العلم في كفارة الظهار ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": 1201,
			"text": "حدثنا الحسن بن قزعة البصري، أنبأنا مسلمة بن علقمة، أنبأنا داود بن علي، عن عامر، عن مسروق، عن عائشة، قالت آلى رسول الله صلى الله عليه وسلم من نسائه وحرم فجعل الحرام حلالا وجعل في اليمين كفارة ‏.‏ قال وفي الباب عن أنس وأبي موسى ‏.‏ قال أبو عيسى حديث مسلمة بن علقمة عن داود رواه علي بن مسهر وغيره عن داود عن الشعبي أن النبي صلى الله عليه وسلم ‏.‏ مرسلا ‏.‏ وليس فيه عن مسروق عن عائشة وهذا أصح من حديث مسلمة بن علقمة ‏.‏ والإيلاء هو أن يحلف الرجل أن لا يقرب امرأته أربعة أشهر فأكثر ‏.‏ واختلف أهل العلم فيه إذا مضت أربعة أشهر فقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر يوقف فإما أن يفيء وإما أن يطلق ‏.‏ وهو قول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر فهي تطليقة بائنة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": 1202,
			"text": "حدثنا هناد، حدثنا عبدة بن سليمان، عن عبد الملك بن أبي سليمان، عن سعيد بن جبير، قال سئلت عن المتلاعنين، في إمارة مصعب بن الزبير أيفرق بينهما فما دريت ما أقول فقمت مكاني إلى منزل عبد الله بن عمر استأذنت عليه فقيل لي إنه قائل ‏.‏ فسمع كلامي فقال ابن جبير ادخل ما جاء بك إلا حاجة ‏.‏ قال فدخلت فإذا هو مفترش بردعة رحل له ‏.‏ فقلت يا أبا عبد الرحمن المتلاعنان أيفرق بينهما قال سبحان الله نعم إن أول من سأل عن ذلك فلان بن فلان أتى النبي صلى الله عليه وسلم فقال يا رسول الله أرأيت لو أن أحدنا رأى امرأته على فاحشة كيف يصنع إن تكلم تكلم بأمر عظيم وإن سكت سكت على أمر عظيم ‏.‏ قال فسكت النبي صلى الله عليه وسلم فلم يجبه فلما كان بعد ذلك أتى النبي صلى الله عليه وسلم فقال إن الذي سألتك عنه قد ابتليت به ‏.‏ فأنزل الله هذه الآيات التي في سورة النور ‏:‏ ‏(‏والذين يرمون أزواجهم ولم يكن لهم شهداء إلا أنفسهم ‏)‏ حتى ختم الآيات فدعا الرجل فتلا الآيات عليه ووعظه وذكره وأخبره أن عذاب الدنيا أهون من عذاب الآخرة ‏.‏ فقال لا والذي بعثك بالحق ما كذبت عليها ‏.‏ ثم ثنى بالمرأة فوعظها وذكرها وأخبرها أن عذاب الدنيا أهون من عذاب الآخرة فقالت لا والذي بعثك بالحق ما صدق ‏.‏ قال فبدأ بالرجل فشهد أربع شهادات بالله إنه لمن الصادقين والخامسة أن لعنة الله عليه إن كان من الكاذبين ‏.‏ ثم ثنى بالمرأة فشهدت أربع شهادات بالله إنه لمن الكاذبين والخامسة أن غضب الله عليها إن كان من الصادقين ‏.‏ ثم فرق بينهما ‏.‏ قال وفي الباب عن سهل بن سعد وابن عباس وابن مسعود وحذيفة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح والعمل على هذا الحديث عند أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1203,
			"arabicnumber": 1203,
			"text": "أنبأنا قتيبة، أنبأنا مالك بن أنس، عن نافع، عن ابن عمر، قال لاعن رجل امرأته وفرق النبي صلى الله عليه وسلم بينهما وألحق الولد بالأم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": 1204,
			"text": "حدثنا الأنصاري، أنبأنا معن، أنبأنا مالك، عن سعد بن إسحاق بن كعب بن عجرة، عن عمته، زينب بنت كعب بن عجرة أن الفريعة بنت مالك بن سنان، وهي أخت أبي سعيد الخدري أخبرتها أنها، جاءت رسول الله صلى الله عليه وسلم تسأله أن ترجع إلى أهلها في بني خدرة وأن زوجها خرج في طلب أعبد له أبقوا حتى إذا كان بطرف القدوم لحقهم فقتلوه ‏.‏ قالت فسألت رسول الله صلى الله عليه وسلم أن أرجع إلى أهلي فإن زوجي لم يترك لي مسكنا يملكه ولا نفقة ‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قالت فانصرفت حتى إذا كنت في الحجرة أو في المسجد ناداني رسول الله صلى الله عليه وسلم أو أمر بي فنوديت له فقال ‏\"‏ كيف قلت ‏\"‏ ‏.‏ قالت فرددت عليه القصة التي ذكرت له من شأن زوجي قال ‏\"‏ امكثي في بيتك حتى يبلغ الكتاب أجله ‏\"‏ ‏.‏ قالت فاعتددت فيه أربعة أشهر وعشرا ‏.‏ قالت فلما كان عثمان أرسل إلى فسألني عن ذلك فأخبرته فاتبعه وقضى به ‏.‏ أنبأنا محمد بن بشار، أنبأنا يحيى بن سعيد، أنبأنا سعد بن إسحاق بن كعب بن عجرة، فذكر نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لم يروا للمعتدة أن تنتقل من بيت زوجها حتى تنقضي عدتها ‏.‏ وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم للمرأة أن تعتد حيث شاءت وإن لم تعتد في بيت زوجها ‏.‏ قال أبو عيسى والقول الأول أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 31
			}
		}
	]
}