{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"17": "The Book on Legal Punishments (Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "حدثنا محمد بن يحيى القطعي البصري، حدثنا بشر بن عمر، حدثنا همام، عن قتادة، عن الحسن البصري، عن علي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رفع القلم عن ثلاثة عن النائم حتى يستيقظ وعن الصبي حتى يشب وعن المعتوه حتى يعقل ‏\"‏ ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث علي حديث حسن غريب من هذا الوجه وقد روي من غير وجه عن علي عن النبي صلى الله عليه وسلم ‏.‏ وذكر بعضهم ‏\"‏ وعن الغلام حتى يحتلم ‏\"‏ ‏.‏ ولا نعرف للحسن سماعا عن علي بن أبي طالب ‏.‏ وقد روي هذا الحديث عن عطاء بن السائب عن أبي ظبيان عن علي بن أبي طالب عن النبي صلى الله عليه وسلم نحو هذا الحديث ‏.‏ ورواه الأعمش عن أبي ظبيان عن ابن عباس عن علي موقوفا ولم يرفعه ‏.‏ والعمل على هذا الحديث عند أهل العلم ‏.‏ قال أبو عيسى قد كان الحسن في زمان علي وقد أدركه ولكنا لا نعرف له سماعا منه وأبو ظبيان اسمه حصين بن جندب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "حدثنا قتيبة، حدثنا الليث، عن عقيل، عن الزهري، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ المسلم أخو المسلم لا يظلمه ولا يسلمه ومن كان في حاجة أخيه كان الله في حاجته ومن فرج عن مسلم كربة فرج الله عنه كربة من كرب يوم القيامة ومن ستر مسلما ستره الله يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث ابن عمر.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن سماك بن حرب، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لماعز بن مالك ‏\"‏ أحق ما بلغني عنك ‏\"‏ ‏.‏ قال وما بلغك عني قال ‏\"‏ بلغني أنك وقعت على جارية آل فلان ‏\"‏ ‏.‏ قال نعم ‏.‏ فشهد أربع شهادات فأمر به فرجم ‏.‏ قال وفي الباب عن السائب بن يزيد ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن ‏.‏ وروى شعبة هذا الحديث عن سماك بن حرب عن سعيد بن جبير مرسلا ولم يذكر فيه عن ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال جاء ماعز الأسلمي إلى رسول الله صلى الله عليه وسلم فقال إنه قد زنى ‏.‏ فأعرض عنه ثم جاء من شقه الآخر فقال يا رسول الله إنه قد زنى ‏.‏ فأعرض عنه ثم جاء من شقه الآخر فقال يا رسول الله إنه قد زنى ‏.‏ فأمر به في الرابعة فأخرج إلى الحرة فرجم بالحجارة فلما وجد مس الحجارة فر يشتد حتى مر برجل معه لحى جمل فضربه به وضربه الناس حتى مات فذكروا ذلك لرسول الله صلى الله عليه وسلم أنه فر حين وجد مس الحجارة ومس الموت فقال رسول الله صلى الله عليه وسلم ‏ \"‏ هلا تركتموه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وقد روي من غير وجه عن أبي هريرة ‏.‏ وروي هذا الحديث عن الزهري عن أبي سلمة عن جابر بن عبد الله عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "حدثنا بذلك الحسن بن علي الخلال، حدثنا عبد الرزاق، أنبأنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله، أن رجلا، من أسلم جاء إلى النبي صلى الله عليه وسلم فاعترف بالزنا فأعرض عنه ثم اعترف فأعرض عنه حتى شهد على نفسه أربع شهادات فقال النبي صلى الله عليه وسلم ‏\"‏ أبك جنون ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أحصنت ‏\"‏ ‏.‏ قال نعم ‏.‏ قال فأمر به فرجم بالمصلى فلما أذلقته الحجارة فر فأدرك فرجم حتى مات فقال له رسول الله صلى الله عليه وسلم خيرا ولم يصل عليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم أن المعترف بالزنا إذا أقر على نفسه أربع مرات أقيم عليه الحد وهو قول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم إذا أقر على نفسه مرة أقيم عليه الحد وهو قول مالك بن أنس والشافعي ‏.‏ وحجة من قال هذا القول حديث أبي هريرة وزيد بن خالد أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما يا رسول الله إن ابني زنى بامرأة هذا الحديث بطوله وقال النبي صلى الله عليه وسلم ‏\"‏ اغد يا أنيس على امرأة هذا فإن اعترفت فارجمها ‏\"‏ ‏.‏ ولم يقل فإن اعترفت أربع مرات ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن عروة، عن عائشة، أن قريشا، أهمهم شأن المرأة المخزومية التي سرقت فقالوا من يكلم فيها رسول الله صلى الله عليه وسلم فقالوا من يجترئ عليه إلا أسامة بن زيد حب رسول الله صلى الله عليه وسلم ‏.‏ فكلمه أسامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتشفع في حد من حدود الله ‏\"‏ ‏.‏ ثم قام فاختطب فقال ‏\"‏ إنما أهلك الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه وإذا سرق فيهم الضعيف أقاموا عليه الحد وايم الله لو أن فاطمة بنت محمد سرقت لقطعت يدها ‏\"‏ ‏.‏ قال وفي الباب عن مسعود ابن العجماء ويقال مسعود بن الأعجم وابن عمر وجابر ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن داود بن أبي هند، عن سعيد بن المسيب، عن عمر بن الخطاب، قال رجم رسول الله صلى الله عليه وسلم ورجم أبو بكر ورجمت ولولا أني أكره أن أزيد في كتاب الله لكتبته في المصحف فإني قد خشيت أن تجيء أقوام فلا يجدونه في كتاب الله فيكفرون به ‏.‏ قال وفي الباب عن علي ‏.‏ قال أبو عيسى حديث عمر حديث حسن صحيح وروي من غير وجه عن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "حدثنا سلمة بن شبيب، وإسحاق بن منصور، والحسن بن علي الخلال، وغير، واحد، قالوا حدثنا عبد الرزاق، عن معمر، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، عن عمر بن الخطاب، قال إن الله بعث محمدا صلى الله عليه وسلم بالحق وأنزل عليه الكتاب فكان فيما أنزل عليه آية الرجم فرجم رسول الله صلى الله عليه وسلم ورجمنا بعده وإني خائف أن يطول بالناس زمان فيقول قائل لا نجد الرجم في كتاب الله فيضلوا بترك فريضة أنزلها الله ألا وإن الرجم حق على من زنى إذا أحصن وقامت البينة أو كان حبل أو اعتراف ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وروي من غير وجه عن عمر رضي الله عنه.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "حدثنا نصر بن علي، وغير، واحد، حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، سمعه من أبي هريرة، وزيد بن خالد، وشبل، أنهم كانوا عند النبي صلى الله عليه وسلم فأتاه رجلان يختصمان فقام إليه أحدهما وقال أنشدك الله يا رسول الله لما قضيت بيننا بكتاب الله ‏.‏ فقال خصمه وكان أفقه منه أجل يا رسول الله اقض بيننا بكتاب الله وائذن لي فأتكلم إن ابني كان عسيفا على هذا فزنا بامرأته فأخبروني أن على ابني الرجم ففديت منه بمائة شاة وخادم ثم لقيت ناسا من أهل العلم فزعموا أن على ابني جلد مائة وتغريب عام وإنما الرجم على امرأة هذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله المائة شاة والخادم رد عليك وعلى ابنك جلد مائة وتغريب عام واغد يا أنيس على امرأة هذا فإن اعترفت فارجمها ‏\"‏ ‏.‏ فغدا عليها فاعترفت فرجمها ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "حدثنا قتيبة، حدثنا هشيم، عن منصور بن زاذان، عن الحسن، عن حطان بن عبد الله، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خذوا عني فقد جعل الله لهن سبيلا الثيب بالثيب جلد مائة ثم الرجم والبكر بالبكر جلد مائة ونفى سنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم علي بن أبي طالب وأبى بن كعب وعبد الله بن مسعود وغيرهم قالوا الثيب تجلد وترجم ‏.‏ وإلى هذا ذهب بعض أهل العلم وهو قول إسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وغيرهما الثيب إنما عليه الرجم ولا يجلد ‏.‏ وقد روي عن النبي صلى الله عليه وسلم مثل هذا في غير حديث في قصة ماعز وغيره أنه أمر بالرجم ولم يأمر أن يجلد قبل أن يرجم ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول سفيان الثوري وابن المبارك والشافعي وأحمد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، حدثنا معمر، عن يحيى بن أبي كثير، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن امرأة، من جهينة اعترفت عند النبي صلى الله عليه وسلم بالزنا فقالت إني حبلى ‏.‏ فدعا النبي صلى الله عليه وسلم وليها فقال ‏\"‏ أحسن إليها فإذا وضعت حملها فأخبرني ‏\"‏ ‏.‏ ففعل فأمر بها فشدت عليها ثيابها ثم أمر برجمها فرجمت ثم صلى عليها فقال له عمر بن الخطاب يا رسول الله رجمتها ثم تصلي عليها ‏.‏ فقال ‏\"‏ لقد تابت توبة لو قسمت بين سبعين من أهل المدينة لوسعتهم وهل وجدت شيئا أفضل من أن جادت بنفسها لله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم رجم يهوديا ويهودية ‏.‏ قال أبو عيسى وفي الحديث قصة وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "حدثنا هناد، حدثنا شريك، عن سماك بن حرب، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم رجم يهوديا ويهودية ‏.‏ قال وفي الباب عن ابن عمر والبراء وجابر وابن أبي أوفى وعبد الله بن الحارث بن جزء وابن عباس ‏.‏ قال أبو عيسى حديث جابر بن سمرة حديث حسن غريب ‏.‏ والعمل على هذا عند أكثر أهل العلم قالوا إذا اختصم أهل الكتاب وترافعوا إلى حكام المسلمين حكموا بينهم بالكتاب والسنة وبأحكام المسلمين وهو قول أحمد وإسحاق ‏.‏ وقال بعضهم لا يقام عليهم الحد في الزنا ‏.‏ والقول الأول أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت، قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏ \"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا قرأ عليهم الآية فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب عليه فهو كفارة له ومن أصاب من ذلك شيئا فستره الله عليه فهو إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏ قال وفي الباب عن علي وجرير بن عبد الله وخزيمة بن ثابت ‏.‏ قال أبو عيسى حديث عبادة بن الصامت حديث حسن صحيح ‏.‏ وقال الشافعي لم أسمع في هذا الباب أن الحدود تكون كفارة لأهلها شيئا أحسن من هذا الحديث ‏.‏ قال الشافعي وأحب لمن أصاب ذنبا فستره الله عليه أن يستر على نفسه ويتوب فيما بينه وبين ربه ‏.‏ وكذلك روي عن أبي بكر وعمر أنهما أمرا رجلا أن يستر على نفسه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا زنت أمة أحدكم فليجلدها ثلاثا بكتاب الله فإن عادت فليبعها ولو بحبل من شعر ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي هريرة وزيد بن خالد وشبل عن عبد الله بن مالك الأوسي ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح وقد روي عنه من غير وجه ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم رأوا أن يقيم الرجل الحد على مملوكه دون السلطان وهو قول أحمد وإسحاق ‏.‏ وقال بعضهم يرفع إلى السلطان ولا يقيم الحد هو بنفسه ‏.‏ والقول الأول أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "حدثنا الحسن بن علي الخلال، حدثنا أبو داود الطيالسي، حدثنا زائدة بن قدامة، عن السدي، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، قال خطب علي فقال يا أيها الناس أقيموا الحدود على أرقائكم من أحصن منهم ومن لم يحصن وإن أمة لرسول الله صلى الله عليه وسلم زنت فأمرني أن أجلدها فإذا هي حديثة عهد بنفاس فخشيت إن أنا جلدتها أن أقتلها - أو قال تموت - فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏ \"‏ أحسنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والسدي اسمه إسماعيل بن عبد الرحمن وهو من التابعين قد سمع من أنس بن مالك ورأى حسين بن علي بن أبي طالب رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "حدثنا سفيان بن وكيع، حدثنا أبي، عن مسعر، عن زيد العمي، عن أبي الصديق الناجي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم ضرب الحد بنعلين أربعين ‏.‏ قال مسعر أظنه في الخمر ‏.‏ قال وفي الباب عن علي وعبد الرحمن بن أزهر وأبي هريرة والسائب وابن عباس وعقبة بن الحارث ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن ‏.‏ وأبو الصديق الناجي اسمه بكر بن عمرو ويقال بكر بن قيس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس، عن النبي صلى الله عليه وسلم أنه أتي برجل قد شرب الخمر فضربه بجريدتين نحو الأربعين وفعله أبو بكر فلما كان عمر استشار الناس فقال عبد الرحمن بن عوف كأخف الحدود ثمانين ‏.‏ فأمر به عمر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن حد السكران ثمانون ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "حدثنا أبو كريب، حدثنا أبو بكر بن عياش، عن عاصم بن بهدلة، عن أبي صالح، عن معاوية، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب الخمر فاجلدوه فإن عاد في الرابعة فاقتلوه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة والشريد وشرحبيل بن أوس وجرير وأبي الرمد البلوي وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث معاوية هكذا روى الثوري أيضا عن عاصم عن أبي صالح عن معاوية عن النبي صلى الله عليه وسلم ‏.‏ وروى ابن جريج ومعمر عن سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ قال سمعت محمدا يقول حديث أبي صالح عن معاوية عن النبي صلى الله عليه وسلم في هذا أصح من حديث أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وإنما كان هذا في أول الأمر ثم نسخ بعد هكذا روى محمد بن إسحاق عن محمد بن المنكدر عن جابر بن عبد الله عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من شرب الخمر فاجلدوه فإن عاد في الرابعة فاقتلوه ‏\"‏ ‏.‏ قال ثم أتي النبي صلى الله عليه وسلم بعد ذلك برجل قد شرب الخمر في الرابعة فضربه ولم يقتله ‏.‏ وكذلك روى الزهري عن قبيصة بن ذؤيب عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ قال فرفع القتل وكانت رخصة ‏.‏ والعمل على هذا الحديث عند عامة أهل العلم لا نعلم بينهم اختلافا في ذلك في القديم والحديث ومما يقوي هذا ما روي عن النبي صلى الله عليه وسلم من أوجه كثيرة أنه قال ‏\"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث النفس بالنفس والثيب الزاني والتارك لدينه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "حدثنا علي بن حجر، حدثنا سفيان بن عيينة، عن الزهري، أخبرته عمرة، عن عائشة، أن النبي صلى الله عليه وسلم كان يقطع في ربع دينار فصاعدا ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وقد روي هذا الحديث من غير وجه عن عمرة عن عائشة مرفوعا ورواه بعضهم عن عمرة عن عائشة موقوفا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "حدثنا قتيبة، حدثنا الليث، عن نافع، عن ابن عمر، قال قطع رسول الله صلى الله عليه وسلم في مجن قيمته ثلاثة دراهم ‏.‏ قال وفي الباب عن سعد وعبد الله بن عمرو وابن عباس وأبي هريرة وأيمن ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر الصديق قطع في خمسة دراهم ‏.‏ وروي عن عثمان وعلي أنهما قطعا في ربع دينار ‏.‏ وروي عن أبي هريرة وأبي سعيد أنهما قالا تقطع اليد في خمسة دراهم ‏.‏ والعمل على هذا عند بعض فقهاء التابعين وهو قول مالك بن أنس والشافعي وأحمد وإسحاق رأوا القطع في ربع دينار فصاعدا ‏.‏ وقد روي عن ابن مسعود أنه قال لا قطع إلا في دينار أو عشرة دراهم ‏.‏ وهو حديث مرسل رواه القاسم بن عبد الرحمن عن ابن مسعود والقاسم لم يسمع من ابن مسعود ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول سفيان الثوري وأهل الكوفة قالوا لا قطع في أقل من عشرة دراهم ‏.‏ وروي عن علي أنه قال لا قطع في أقل من عشرة دراهم ‏.‏ وليس إسناده بمتصل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "حدثنا قتيبة، حدثنا عمر بن علي المقدمي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألت فضالة بن عبيد عن تعليق اليد، في عنق السارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث عمر بن علي المقدمي عن الحجاج بن أرطاة ‏.‏ وعبد الرحمن بن محيريز هو أخو عبد الله بن محيريز شامي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "حدثنا علي بن خشرم، حدثنا عيسى بن يونس، عن ابن جريج، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على خائن ولا منتهب ولا مختلس قطع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وقد رواه مغيرة بن مسلم عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم نحو حديث ابن جريج ‏.‏ ومغيرة بن مسلم هو بصري أخو عبد العزيز القسملي كذا قال علي بن المديني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، أن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى بعضهم عن يحيى بن سعيد عن محمد بن يحيى بن حبان عن عمه واسع بن حبان عن رافع بن خديج عن النبي صلى الله عليه وسلم نحو رواية الليث بن سعد ‏.‏ وروى مالك بن أنس وغير واحد هذا الحديث عن يحيى بن سعيد عن محمد بن يحيى بن حبان عن رافع بن خديج عن النبي صلى الله عليه وسلم ولم يذكروا فيه عن واسع بن حبان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عياش بن عباس المصري، عن شييم بن بيتان، عن جنادة بن أبي أمية، عن بسر بن أرطاة، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ لا تقطع الأيدي في الغزو ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روى غير ابن لهيعة بهذا الإسناد نحو هذا ‏.‏ ويقال بسر بن أبي أرطاة أيضا ‏.‏ والعمل على هذا عند بعض أهل العلم منهم الأوزاعي لا يرون أن يقام الحد في الغزو بحضرة العدو مخافة أن يلحق من يقام عليه الحد بالعدو فإذا خرج الإمام من أرض الحرب ورجع إلى دار الإسلام أقام الحد على من أصابه ‏.‏ كذلك قال الأوزاعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "حدثنا علي بن حجر، حدثنا هشيم، عن سعيد بن أبي عروبة، وأيوب بن مسكين، عن قتادة، عن حبيب بن سالم، قال رفع إلى النعمان بن بشير رجل وقع على جارية امرأته فقال لأقضين فيها بقضاء رسول الله صلى الله عليه وسلم لئن كانت أحلتها له لأجلدنه مائة وإن لم تكن أحلتها له رجمته ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "حدثنا علي بن حجر، حدثنا هشيم، عن أبي بشر، عن حبيب بن سالم، عن النعمان بن بشير، نحوه ‏.‏ قال وفي الباب عن سلمة بن المحبق، ‏.‏ قال أبو عيسى حديث النعمان في إسناده اضطراب ‏.‏ قال سمعت محمدا يقول لم يسمع قتادة من حبيب بن سالم هذا الحديث إنما رواه عن خالد بن عرفطة ‏.‏ ويروى عن قتادة أنه قال كتب به إلى حبيب بن سالم ‏.‏ وأبو بشر لم يسمع من حبيب بن سالم هذا أيضا إنما رواه عن خالد بن عرفطة ‏.‏ قال أبو عيسى وقد اختلف أهل العلم في الرجل يقع على جارية امرأته فروي عن غير واحد من أصحاب النبي صلى الله عليه وسلم منهم علي وابن عمر أن عليه الرجم ‏.‏ وقال ابن مسعود ليس عليه حد ولكن يعزر ‏.‏ وذهب أحمد وإسحاق إلى ما روى النعمان بن بشير عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "حدثنا علي بن حجر، حدثنا معمر بن سليمان الرقي، عن الحجاج بن أرطاة، عن عبد الجبار بن وائل بن حجر، عن أبيه، قال استكرهت امرأة على عهد رسول الله صلى الله عليه وسلم فدرأ عنها رسول الله صلى الله عليه وسلم الحد وأقامه على الذي أصابها ولم يذكر أنه جعل لها مهرا ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بمتصل وقد روي هذا الحديث من غير هذا الوجه ‏.‏ قال سمعت محمدا يقول عبد الجبار بن وائل بن حجر لم يسمع من أبيه ولا أدركه يقال إنه ولد بعد موت أبيه بأشهر ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن ليس على المستكرهة حد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، عن إسرائيل، حدثنا سماك بن حرب، عن علقمة بن وائل الكندي، عن أبيه، أن امرأة، خرجت على عهد رسول الله صلى الله عليه وسلم تريد الصلاة فتلقاها رجل فتجللها فقضى حاجته منها فصاحت فانطلق ومر عليها رجل فقالت إن ذاك الرجل فعل بي كذا وكذا ‏.‏ ومرت بعصابة من المهاجرين فقالت إن ذاك الرجل فعل بي كذا وكذا ‏.‏ فانطلقوا فأخذوا الرجل الذي ظنت أنه وقع عليها وأتوها فقالت نعم هو هذا ‏.‏ فأتوا به رسول الله صلى الله عليه وسلم فلما أمر به ليرجم قام صاحبها الذي وقع عليها فقال يا رسول الله أنا صاحبها ‏.‏ فقال لها ‏\"‏ اذهبي فقد غفر الله لك ‏\"‏ ‏.‏ وقال للرجل قولا حسنا وقال للرجل الذي وقع عليها ‏\"‏ ارجموه ‏\"‏ ‏.‏ وقال ‏\"‏ لقد تاب توبة لو تابها أهل المدينة لقبل منهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وعلقمة بن وائل بن حجر سمع من أبيه وهو أكبر من عبد الجبار بن وائل وعبد الجبار بن وائل لم يسمع من أبيه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": 1455,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1456,
			"arabicnumber": 1456,
			"text": "حدثنا محمد بن عمرو السواق، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وجدتموه يعمل عمل قوم لوط فاقتلوا الفاعل والمفعول به ‏\"‏ ‏.‏ قال وفي الباب عن جابر وأبي هريرة ‏.‏ قال أبو عيسى وإنما يعرف هذا الحديث عن ابن عباس عن النبي صلى الله عليه وسلم من هذا الوجه وروى محمد بن إسحاق هذا الحديث عن عمرو بن أبي عمرو فقال ‏\"‏ ملعون من عمل عمل قوم لوط ‏\"‏ ‏.‏ ولم يذكر فيه القتل وذكر فيه ملعون من أتى بهيمة ‏.‏ وقد روي هذا الحديث عن عاصم بن عمر عن سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ اقتلوا الفاعل والمفعول به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث في إسناده مقال ولا نعرف أحدا رواه عن سهيل بن أبي صالح غير عاصم بن عمر العمري ‏.‏ وعاصم بن عمر يضعف في الحديث من قبل حفظه ‏.‏ واختلف أهل العلم في حد اللوطي فرأى بعضهم أن عليه الرجم أحصن أو لم يحصن وهذا قول مالك والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من فقهاء التابعين منهم الحسن البصري وإبراهيم النخعي وعطاء بن أبي رباح وغيرهم قالوا حد اللوطي حد الزاني وهو قول الثوري وأهل الكوفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": 1457,
			"text": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا همام، عن القاسم بن عبد الواحد المكي، عن عبد الله بن محمد بن عقيل، أنه سمع جابرا، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أخوف ما أخاف على أمتي عمل قوم لوط ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه عن عبد الله بن محمد بن عقيل بن أبي طالب عن جابر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": 1458,
			"text": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا عبد الوهاب الثقفي، حدثنا أيوب، عن عكرمة، أن عليا، حرق قوما ارتدوا عن الإسلام، فبلغ ذلك ابن عباس فقال لو كنت أنا لقتلتهم، لقول رسول الله صلى الله عليه وسلم ‏\"‏ من بدل دينه فاقتلوه ‏\"‏ ‏.‏ ولم أكن لأحرقهم لقول رسول الله صلى الله عليه وسلم ‏\"‏ لا تعذبوا بعذاب الله ‏\"‏ ‏.‏ فبلغ ذلك عليا فقال صدق ابن عباس ‏.‏ قال أبو عيسى هذا حديث صحيح حسن ‏.‏ والعمل على هذا عند أهل العلم في المرتد ‏.‏ واختلفوا في المرأة إذا ارتدت عن الإسلام فقالت طائفة من أهل العلم تقتل وهو قول الأوزاعي وأحمد وإسحاق ‏.‏ وقالت طائفة منهم تحبس ولا تقتل وهو قول سفيان الثوري وغيره من أهل الكوفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": 1459,
			"text": "حدثنا أبو كريب، وأبو السائب، سلم بن جنادة قالا حدثنا أبو أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وابن الزبير وأبي هريرة وسلمة بن الأكوع ‏.‏ قال أبو عيسى حديث أبي موسى حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": 1460,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن إسماعيل بن مسلم، عن الحسن، عن جندب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ حد الساحر ضربة بالسيف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ وإسماعيل بن مسلم المكي يضعف في الحديث وإسماعيل بن مسلم العبدي البصري قال وكيع هو ثقة ‏.‏ ويروى عن الحسن أيضا والصحيح عن جندب موقوف ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول مالك بن أنس ‏.‏ وقال الشافعي إنما يقتل الساحر إذا كان يعمل في سحره ما يبلغ به الكفر فإذا عمل عملا دون الكفر فلم نر عليه قتلا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": 1461,
			"text": "حدثنا محمد بن عمرو السواق، حدثنا عبد العزيز بن محمد، عن صالح بن محمد بن زائدة، عن سالم بن عبد الله بن عمر، عن عبد الله بن عمر، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من وجدتموه غل في سبيل الله فاحرقوا متاعه ‏\"‏ ‏.‏ قال صالح فدخلت على مسلمة ومعه سالم بن عبد الله فوجد رجلا قد غل فحدث سالم بهذا الحديث فأمر به فأحرق متاعه فوجد في متاعه مصحف فقال سالم بع هذا وتصدق بثمنه ‏.‏ قال أبو عيسى هذا الحديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول الأوزاعي وأحمد وإسحاق ‏.‏ قال وسألت محمدا عن هذا الحديث فقال إنما روى هذا صالح بن محمد بن زائدة وهو أبو واقد الليثي وهو منكر الحديث قال محمد وقد روي في غير حديث عن النبي صلى الله عليه وسلم في الغال فلم يأمر فيه بحرق متاعه ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": 1462,
			"text": "حدثنا محمد بن رافع، حدثنا ابن أبي فديك، عن إبراهيم بن إسماعيل بن أبي حبيبة، عن داود بن الحصين، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا قال الرجل للرجل يا يهودي فاضربوه عشرين وإذا قال يا مخنث فاضربوه عشرين ومن وقع على ذات محرم فاقتلوه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من هذا الوجه ‏.‏ وإبراهيم بن إسماعيل يضعف في الحديث ‏.‏ والعمل على هذا عند أصحابنا قالوا من أتى ذات محرم وهو يعلم فعليه القتل ‏.‏ وقال أحمد من تزوج أمه قتل ‏.‏ وقال إسحاق من وقع على ذات محرم قتل ‏.‏ - وقد روي عن النبي صلى الله عليه وسلم من غير وجه رواه البراء بن عازب وقرة بن إياس المزني أن رجلا تزوج امرأة أبيه فأمر النبي صلى الله عليه وسلم بقتله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": 1463,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن عبد الرحمن بن جابر بن عبد الله، عن أبي بردة بن نيار، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يجلد فوق عشر جلدات إلا في حد من حدود الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث بكير بن الأشج ‏.‏ وقد اختلف أهل العلم في التعزير وأحسن شيء روي في التعزير هذا الحديث ‏.‏ قال وقد روى هذا الحديث ابن لهيعة عن بكير فأخطأ فيه وقال عن عبد الرحمن بن جابر بن عبد الله عن أبيه عن النبي صلى الله عليه وسلم وهو خطأ والصحيح حديث الليث بن سعد إنما هو عبد الرحمن بن جابر بن عبد الله عن أبي بردة بن نيار عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 47
			}
		}
	]
}