{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"20": "The Book on Vows and Oaths"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "حدثنا قتيبة، حدثنا أبو صفوان، عن يونس بن يزيد، عن ابن شهاب، عن أبي سلمة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا نذر في معصية وكفارته كفارة يمين ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وجابر وعمران بن حصين ‏.‏ قال أبو عيسى هذا حديث لا يصح لأن الزهري لم يسمع هذا الحديث من أبي سلمة ‏.‏ قال سمعت محمدا يقول روى غير واحد منهم موسى بن عقبة وابن أبي عتيق عن الزهري عن سليمان بن أرقم عن يحيى بن أبي كثير عن أبي سلمة عن عائشة عن النبي صلى الله عليه وسلم ‏.‏ قال محمد والحديث هو هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "حدثنا أبو إسماعيل الترمذي، - واسمه محمد بن إسماعيل بن يوسف حدثنا أيوب بن سليمان بن بلال، حدثنا أبو بكر بن أبي أويس، عن سليمان بن بلال، عن موسى بن عقبة، ومحمد بن عبد الله بن أبي عتيق، عن الزهري، عن سليمان بن أرقم، عن يحيى بن أبي كثير، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا نذر في معصية الله وكفارته كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وهو أصح من حديث أبي صفوان عن يونس ‏.‏ وأبو صفوان هو مكي واسمه عبد الله بن سعيد بن عبد الملك بن مروان وقد روى عنه الحميدي وغير واحد من جلة أهل الحديث ‏.‏ وقال قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية الله وكفارته كفارة يمين ‏.‏ وهو قول أحمد وإسحاق واحتجا بحديث الزهري عن أبي سلمة عن عائشة ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية ولا كفارة في ذلك ‏.‏ وهو قول مالك والشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي قلابة، عن ثابت بن الضحاك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على العبد نذر فيما لا يملك ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وعمران بن حصين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": 1528,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو بكر بن عياش، حدثني محمد، مولى المغيرة بن شعبة حدثني كعب بن علقمة، عن أبي الخير، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كفارة النذر إذا لم يسم كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، عن يونس، هو ابن عبيد حدثنا الحسن، عن عبد الرحمن بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا عبد الرحمن لا تسأل الإمارة فإنك إن أتتك عن مسألة وكلت إليها وإن أتتك عن غير مسألة أعنت عليها وإذا حلفت على يمين فرأيت غيرها خيرا منها فائت الذي هو خير ولتكفر عن يمينك ‏\"‏ ‏.‏ وفي الباب عن علي وجابر وعدي بن حاتم وأبي الدرداء وأنس وعائشة وعبد الله بن عمرو وأبي هريرة وأم سلمة وأبي موسى ‏.‏ قال أبو عيسى حديث عبد الرحمن بن سمرة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "حدثنا قتيبة، عن مالك بن أنس، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من حلف على يمين فرأى غيرها خيرا منها فليكفر عن يمينه وليفعل ‏\"‏ ‏.‏ قال وفي الباب عن أم سلمة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الكفارة قبل الحنث تجزئ وهو قول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم لا يكفر إلا بعد الحنث ‏.‏ قال سفيان الثوري إن كفر بعد الحنث أحب إلى وإن كفر قبل الحنث أجزأه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "حدثنا محمود بن غيلان، حدثنا عبد الصمد بن عبد الوارث، حدثني أبي وحماد بن سلمة، عن أيوب، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من حلف على يمين فقال إن شاء الله فقد استثنى فلا حنث عليه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن ‏.‏ وقد رواه عبيد الله بن عمر وغيره عن نافع عن ابن عمر موقوفا ‏.‏ وهكذا روي عن سالم عن ابن عمر رضى الله عنهما موقوفا ‏.‏ ولا نعلم أحدا رفعه غير أيوب السختياني وقال إسماعيل بن إبراهيم وكان أيوب أحيانا يرفعه وأحيانا لا يرفعه ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الاستثناء إذا كان موصولا باليمين فلا حنث عليه وهو قول سفيان الثوري والأوزاعي ومالك بن أنس وعبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين فقال إن شاء الله لم يحنث ‏\"‏ ‏.‏ قال أبو عيسى سألت محمد بن إسماعيل عن هذا فقال هذا حديث خطأ أخطأ فيه عبد الرزاق اختصره من حديث معمر عن ابن طاوس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ إن سليمان بن داود قال لأطوفن الليلة على سبعين امرأة تلد كل امرأة غلاما ‏.‏ فطاف عليهن فلم تلد امرأة منهن إلا امرأة نصف غلام ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قال إن شاء الله لكان كما قال ‏\"‏ ‏.‏ هكذا روي عن عبد الرزاق عن معمر عن ابن طاوس عن أبيه هذا الحديث بطوله وقال ‏\"‏ سبعين امرأة ‏\"‏ ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود لأطوفن الليلة على مائة امرأة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "حدثنا قتيبة، حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، سمع النبي صلى الله عليه وسلم عمر وهو يقول وأبي وأبي فقال ‏ \"‏ ألا إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏ فقال عمر فوالله ما حلفت به بعد ذلك ذاكرا ولا آثرا ‏.‏ قال وفي الباب عن ثابت بن الضحاك وابن عباس وأبي هريرة وقتيلة وعبد الرحمن بن سمرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ قال أبو عيسى قال أبو عبيد معنى قوله ولا آثرا ‏.‏ أى لم آثره عن غيري يقول لم أذكره عن غيري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "حدثنا هناد، حدثنا عبدة، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أدرك عمر وهو في ركب وهو يحلف بأبيه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله ينهاكم أن تحلفوا بآبائكم ليحلف حالف بالله أو ليسكت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "حدثنا قتيبة، حدثنا أبو خالد الأحمر، عن الحسن بن عبيد الله، عن سعد بن عبيدة، أن ابن عمر، سمع رجلا، يقول لا والكعبة ‏.‏ فقال ابن عمر لا يحلف بغير الله فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف بغير الله فقد كفر أو أشرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وفسر هذا الحديث عند بعض أهل العلم أن قوله ‏\"‏ فقد كفر أو أشرك ‏\"‏ على التغليظ ‏.‏ والحجة في ذلك حديث ابن عمر أن النبي صلى الله عليه وسلم سمع عمر يقول وأبي وأبي ‏.‏ فقال ‏\"‏ ألا إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏ وحديث أبي هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من قال في حلفه واللات والعزى فليقل لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا مثل ما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن الرياء شرك ‏\"‏ ‏.‏ وقد فسر بعض أهل العلم هذه الآية ‏:‏ ‏(‏ ومن كان يرجو لقاء ربه فليعمل عملا صالحا ‏)‏ الآية قال لا يرائي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "حدثنا عبد القدوس بن محمد العطار البصري، حدثنا عمرو بن عاصم، عن عمران القطان، عن حميد، عن أنس، قال نذرت امرأة أن تمشي، إلى بيت الله فسئل نبي الله صلى الله عليه وسلم عن ذلك فقال ‏ \"‏ إن الله لغني عن مشيها مروها فلتركب ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعقبة بن عامر وابن عباس ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح غريب من هذا الوجه ‏.‏ والعمل على هذا عند بعض أهل العلم وقالوا إذا نذرت امرأة أن تمشي فلتركب ولتهد شاة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": 1537,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": 1538,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تنذروا فإن النذر لا يغني من القدر شيئا وإنما يستخرج به من البخيل ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم كرهوا النذر ‏.‏ وقال عبد الله بن المبارك معنى الكراهية في النذر في الطاعة والمعصية وإن نذر الرجل بالطاعة فوفى به فله فيه أجر ويكره له النذر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": 1539,
			"text": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن سعيد القطان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، عن عمر، قال قلت يا رسول الله إني كنت نذرت أن أعتكف ليلة في المسجد الحرام في الجاهلية ‏.‏ قال ‏ \"‏ أوف بنذرك ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وابن عباس ‏.‏ قال أبو عيسى حديث عمر حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث قالوا إذا أسلم الرجل وعليه نذر طاعة فليف به ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا اعتكاف إلا بصوم ‏.‏ وقال آخرون من أهل العلم ليس على المعتكف صوم إلا أن يوجب على نفسه صوما ‏.‏ واحتجوا بحديث عمر أنه نذر أن يعتكف ليلة في الجاهلية فأمره النبي صلى الله عليه وسلم بالوفاء ‏.‏ وهو قول أحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": 1540,
			"text": "حدثنا علي بن حجر، أخبرنا عبد الله بن المبارك، وعبد الله بن جعفر، عن موسى بن عقبة، عن سالم بن عبد الله، عن أبيه، قال كثيرا ما كان رسول الله صلى الله عليه وسلم يحلف بهذه اليمين ‏ \"‏ لا ومقلب القلوب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": 1541,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن عمر بن علي بن الحسين بن علي بن أبي طالب، عن سعيد ابن مرجانة، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من أعتق رقبة مؤمنة أعتق الله منه بكل عضو منه عضوا من النار حتى يعتق فرجه بفرجه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعمرو بن عبسة وابن عباس وواثلة بن الأسقع وأبي أمامة وعقبة بن عامر وكعب بن مرة ‏.‏ قال أبو عيسى حديث أبي هريرة هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وابن الهاد اسمه يزيد بن عبد الله بن أسامة بن الهاد وهو مدني ثقة قد روى عنه مالك بن أنس وغير واحد من أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": 1542,
			"text": "حدثنا أبو كريب، حدثنا المحاربي، عن شعبة، عن حصين، عن هلال بن يساف، عن سويد بن مقرن المزني، قال لقد رأيتنا سبعة إخوة ما لنا خادم إلا واحدة فلطمها أحدنا فأمرنا النبي صلى الله عليه وسلم أن نعتقها ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى غير واحد هذا الحديث عن حصين بن عبد الرحمن فذكر بعضهم في الحديث قال لطمها على وجهها ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": 1543,
			"text": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي قلابة، عن ثابت بن الضحاك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف بملة غير الإسلام كاذبا فهو كما قال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد اختلف أهل العلم في هذا إذا حلف الرجل بملة سوى الإسلام فقال هو يهودي أو نصراني إن فعل كذا وكذا ففعل ذلك الشىء فقال بعضهم قد أتى عظيما ولا كفارة عليه وهو قول أهل المدينة وبه يقول مالك بن أنس وإلى هذا القول ذهب أبو عبيد ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين وغيرهم عليه في ذلك الكفارة وهو قول سفيان وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": 1544,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن يحيى بن سعيد، عن عبيد الله بن زحر، عن أبي سعيد الرعيني، عن عبد الله بن مالك اليحصبي، عن عقبة بن عامر، قال قلت يا رسول الله إن أختي نذرت أن تمشي إلى البيت حافية غير مختمرة ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ إن الله لا يصنع بشقاء أختك شيئا فلتركب ولتختمر ولتصم ثلاثة أيام ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أهل العلم وهو قول أحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": 1545,
			"text": "حدثنا إسحاق بن منصور، حدثنا أبو المغيرة، حدثنا الأوزاعي، حدثنا الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حلف منكم فقال في حلفه واللات والعزى فليقل لا إله إلا الله ومن قال تعال أقامرك فليتصدق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو المغيرة هو الخولاني الحمصي واسمه عبد القدوس بن الحجاج ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": 1546,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، أن سعد بن عبادة، استفتى رسول الله صلى الله عليه وسلم في نذر كان على أمه توفيت قبل أن تقضيه فقال النبي صلى الله عليه وسلم ‏ \"‏ اقضه عنها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": 1547,
			"text": "حدثنا محمد بن عبد الأعلى حدثنا عمران بن عيينة هو أخو سفيان بن عيينة عن حصين عن سالم بن أبي الجعد عن أبي أمامة وغيره من أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال أيما امرئ مسلم أعتق امرأ مسلما كان فكاكه من النار يجزي كل عضو منه عضوا منه وأيما امرئ مسلم أعتق امرأتين مسلمتين كانتا فكاكه من النار يجزي كل عضو منهما عضوا منه وأيما امرأة مسلمة أعتقت امرأة مسلمة كانت فكاكها من النار يجزي كل عضو منها عضوا منها قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه قال أبو عيسى وفي الحديث ما يدل على أن عتق الذكور للرجال أفضل من عتق الإناث لقول رسول الله صلى الله عليه وسلم من أعتق امرأ مسلما كان فكاكه من النار يجزي كل عضو منه عضوا منه",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 26
			}
		}
	]
}