{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"25": "The Book on Food"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1788,
			"arabicnumber": 1788,
			"text": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثني أبي، عن يونس، عن قتادة، عن أنس، قال ما أكل رسول الله صلى الله عليه وسلم في خوان ولا في سكرجة ولا خبز له مرقق ‏.‏ قال فقلت لقتادة فعلى ما كانوا يأكلون قال على هذه السفر ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال محمد بن بشار ويونس هذا هو يونس الإسكاف ‏.‏ وقد روى عبد الوارث بن سعيد عن سعيد بن أبي عروبة عن قتادة عن أنس عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": 1789,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن هشام بن زيد بن أنس، قال سمعت أنسا، يقول أنفجنا أرنبا بمر الظهران فسعى أصحاب النبي صلى الله عليه وسلم خلفها فأدركتها فأخذتها فأتيت بها أبا طلحة فذبحها بمروة فبعث معي بفخذها أو بوركها إلى النبي صلى الله عليه وسلم فأكله ‏.‏ قال قلت أكله قال قبله ‏.‏ قال أبو عيسى وفي الباب عن جابر وعمار ومحمد بن صفوان ويقال محمد بن صيفي ‏.‏ وهذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم لا يرون بأكل الأرنب بأسا ‏.‏ وقد كره بعض أهل العلم أكل الأرنب وقالوا إنها تدمي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": 1790,
			"text": "حدثنا قتيبة، حدثنا مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، أن النبي صلى الله عليه وسلم سئل عن أكل الضب فقال ‏ \"‏ لا آكله ولا أحرمه ‏\"‏ ‏.‏ قال وفي الباب عن عمر وأبي سعيد وابن عباس وثابت بن وديعة وجابر وعبد الرحمن ابن حسنة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد اختلف أهل العلم في أكل الضب فرخص فيه بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وكرهه بعضهم ‏.‏ ويروى عن ابن عباس أنه قال أكل الضب على مائدة رسول الله صلى الله عليه وسلم وإنما تركه رسول الله صلى الله عليه وسلم تقذرا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": 1791,
			"text": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، أخبرنا ابن جريج، عن عبد الله بن عبيد بن عمير، عن ابن أبي عمار، قال قلت لجابر الضبع صيد هي قال نعم ‏.‏ قال قلت آكلها قال نعم ‏.‏ قال قلت له أقاله رسول الله صلى الله عليه وسلم قال نعم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إلى هذا ولم يروا بأكل الضبع بأسا وهو قول أحمد وإسحاق ‏.‏ وروي عن النبي صلى الله عليه وسلم حديث في كراهية أكل الضبع وليس إسناده بالقوي وقد كره بعض أهل العلم أكل الضبع وهو قول ابن المبارك ‏.‏ قال يحيى القطان وروى جرير بن حازم هذا الحديث عن عبد الله بن عبيد بن عمير عن ابن أبي عمار عن جابر عن عمر قوله ‏.‏ وحديث ابن جريج أصح ‏.‏ وابن أبي عمار هو عبد الرحمن بن عبد الله بن أبي عمار المكي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": 1792,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن إسماعيل بن مسلم، عن عبد الكريم بن أبي المخارق أبي أمية، عن حبان بن جزء، عن أخيه، خزيمة بن جزء قال سألت رسول الله صلى الله عليه وسلم عن أكل الضبع فقال ‏\"‏ أويأكل الضبع أحد ‏\"‏ ‏.‏ وسألته عن أكل الذئب فقال ‏\"‏ أويأكل الذئب أحد فيه خير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بالقوي لا نعرفه إلا من حديث إسماعيل بن مسلم عن عبد الكريم أبي أمية ‏.‏ وقد تكلم بعض أهل الحديث في إسماعيل وعبد الكريم أبي أمية وهو عبد الكريم بن قيس بن أبي المخارق وعبد الكريم بن مالك الجزري ثقة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": 1793,
			"text": "حدثنا قتيبة، ونصر بن علي، قالا حدثنا سفيان، عن عمرو بن دينار، عن جابر، قال أطعمنا رسول الله صلى الله عليه وسلم لحوم الخيل ونهانا عن لحوم الحمر ‏.‏ قال وفي الباب عن أسماء بنت أبي بكر ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح وهكذا روى غير واحد عن عمرو بن دينار عن جابر ‏.‏ ورواه حماد بن زيد عن عمرو بن دينار عن محمد بن علي عن جابر ورواية ابن عيينة أصح ‏.‏ قال وسمعت محمدا يقول سفيان بن عيينة أحفظ من حماد بن زيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": 1794,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "حدثنا أبو كريب، حدثنا حسين بن علي الجعفي، عن زائدة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حرم يوم خيبر كل ذي ناب من السباع والمجثمة والحمار الإنسي ‏.‏ قال وفي الباب عن علي وجابر والبراء وابن أبي أوفى وأنس والعرباض بن سارية وأبي ثعلبة وابن عمر وأبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى عبد العزيز بن محمد وغيره عن محمد بن عمرو هذا الحديث وإنما ذكروا حرفا واحدا نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": 1796,
			"text": "حدثنا زيد بن أخزم الطائي، حدثنا سلم بن قتيبة، حدثنا شعبة، عن أيوب، عن أبي قلابة، عن أبي ثعلبة، قال سئل رسول الله صلى الله عليه وسلم عن قدور المجوس فقال ‏ \"‏ أنقوها غسلا واطبخوا فيها ‏\"‏ ‏.‏ ونهى عن كل سبع ذي ناب ‏.‏ قال أبو عيسى هذا حديث مشهور من حديث أبي ثعلبة وروي عنه من غير هذا الوجه ‏.‏ وأبو ثعلبة اسمه جرثوم ويقال جرهم ويقال ناشب ‏.‏ وقد ذكر هذا الحديث عن أبي قلابة عن أبي أسماء الرحبي عن أبي ثعلبة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": 1797,
			"text": "حدثنا علي بن عيسى بن يزيد البغدادي، حدثنا عبيد الله بن محمد العيشي، حدثنا حماد بن سلمة، عن أيوب، وقتادة، عن أبي قلابة، عن أبي أسماء الرحبي، عن أبي ثعلبة الخشني، أنه قال يا رسول الله إنا بأرض أهل الكتاب فنطبخ في قدورهم ونشرب في آنيتهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لم تجدوا غيرها فارحضوها بالماء ‏\"‏ ‏.‏ ثم قال يا رسول الله إنا بأرض صيد فكيف نصنع قال ‏\"‏ إذا أرسلت كلبك المكلب وذكرت اسم الله فقتل فكل وإن كان غير مكلب فذكي فكل وإذا رميت بسهمك وذكرت اسم الله فقتل فكل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": 1798,
			"text": "حدثنا سعيد بن عبد الرحمن المخزومي، وأبو عمار قالا حدثنا سفيان، عن الزهري، عن عبيد الله، عن ابن عباس، عن ميمونة، أن فأرة، وقعت، في سمن فماتت فسئل عنها النبي صلى الله عليه وسلم فقال ‏\"‏ ألقوها وما حولها وكلوه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن الزهري عن عبيد الله عن ابن عباس أن النبي صلى الله عليه وسلم سئل ولم يذكروا فيه عن ميمونة وحديث ابن عباس عن ميمونة أصح ‏.‏ وروى معمر عن الزهري عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه وهو حديث غير محفوظ ‏.‏ قال وسمعت محمد بن إسماعيل يقول وحديث معمر عن الزهري عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم وذكر فيه أنه سئل عنه فقال ‏\"‏ إذا كان جامدا فألقوها وما حولها وإن كان مائعا فلا تقربوه ‏\"‏ ‏.‏ فقال هذا خطأ أخطأ فيه معمر ‏.‏ قال والصحيح حديث الزهري عن عبيد الله عن ابن عباس عن ميمونة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "حدثنا إسحاق بن منصور، أخبرنا عبد الله بن نمير، حدثنا عبيد الله بن عمر، عن ابن شهاب، عن أبي بكر بن عبيد الله بن عبد الله بن عمر، عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يأكل أحدكم بشماله ولا يشرب بشماله فإن الشيطان يأكل بشماله ويشرب بشماله ‏\"‏ ‏.‏ قال وفي الباب عن جابر وعمر بن أبي سلمة وسلمة بن الأكوع وأنس بن مالك وحفصة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهكذا روى مالك وابن عيينة عن الزهري عن أبي بكر بن عبيد الله عن ابن عمر ‏.‏ وروى معمر وعقيل عن الزهري عن سالم عن ابن عمر ورواية مالك وابن عيينة أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "حدثنا عبد الله بن عبد الرحمن، قال حدثنا جعفر بن عون، عن سعيد بن أبي عروبة، عن معمر، عن الزهري، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا أكل أحدكم فليأكل بيمينه وليشرب بيمينه فإن الشيطان يأكل بشماله ويشرب بشماله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": 1801,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أكل أحدكم فليلعق أصابعه فإنه لا يدري في أيتهن البركة ‏\"‏ ‏.‏ قال وفي الباب عن جابر ‏.‏ وكعب بن مالك وأنس ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث سهيل ‏.‏ وسألت محمدا عن هذا الحديث فقال هذا حديث عبد العزيز من المختلف لا يعرف إلا من حديثه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": 1802,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا أكل أحدكم طعاما فسقطت لقمة فليمط ما رابه منها ثم ليطعمها ولا يدعها للشيطان ‏\"‏ ‏.‏ قال وفي الباب عن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": 1803,
			"text": "حدثنا الحسن بن علي الخلال، حدثنا عفان بن مسلم، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس، أن النبي صلى الله عليه وسلم كان إذا ما أكل طعاما لعق أصابعه الثلاث وقال ‏\"‏ إذا ما وقعت لقمة أحدكم فليمط عنها الأذى وليأكلها ولا يدعها للشيطان ‏\"‏ ‏.‏ وأمرنا أن نسلت الصحفة وقال ‏\"‏ إنكم لا تدرون في أى طعامكم البركة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": 1804,
			"text": "حدثنا نصر بن علي الجهضمي، أخبرنا أبو اليمان المعلى بن راشد، قال حدثتني جدتي أم عاصم، وكانت أم ولد، لسنان بن سلمة قالت دخل علينا نبيشة الخير ونحن نأكل في قصعة فحدثنا أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أكل في قصعة ثم لحسها استغفرت له القصعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث المعلى بن راشد ‏.‏ وقد روى يزيد بن هارون وغير واحد من الأئمة عن المعلى بن راشد هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": 1805,
			"text": "حدثنا قتيبة أبو رجاء، حدثنا جرير، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إن البركة تنزل وسط الطعام فكلوا من حافتيه ولا تأكلوا من وسطه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح إنما يعرف من حديث عطاء بن السائب ‏.‏ وقد رواه شعبة والثوري عن عطاء بن السائب ‏.‏ وفي الباب عن ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": 1806,
			"text": "حدثنا إسحاق بن منصور، أخبرنا يحيى بن سعيد القطان، عن ابن جريج، حدثنا عطاء، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أكل من هذه - قال أول مرة الثوم ثم قال الثوم والبصل والكراث فلا يقربنا في مساجدنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن عمر وأبي أيوب وأبي هريرة وأبي سعيد وجابر بن سمرة وقرة بن إياس المزني وابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": 1807,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن سماك بن حرب، سمع جابر بن سمرة، يقول نزل رسول الله صلى الله عليه وسلم على أبي أيوب وكان إذا أكل طعاما بعث إليه بفضله فبعث إليه يوما بطعام ولم يأكل منه النبي صلى الله عليه وسلم فلما أتى أبو أيوب النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ فيه ثوم ‏\"‏ ‏.‏ فقال يا رسول الله أحرام هو قال ‏\"‏ لا ولكني أكرهه من أجل ريحه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": 1808,
			"text": "حدثنا محمد بن مدويه، حدثنا مسدد، حدثنا الجراح بن مليح، والد، وكيع، عن أبي إسحاق، عن شريك بن حنبل، عن علي، أنه قال نهي عن أكل الثوم، إلا مطبوخا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": 1809,
			"text": "حدثنا هناد، حدثنا وكيع، عن أبيه، عن أبي إسحاق، عن شريك بن حنبل، عن علي، قال لا يصلح أكل الثوم إلا مطبوخا ‏.‏ قال أبو عيسى هذا الحديث ليس إسناده بذلك القوي وقد روي هذا عن علي قوله وروي عن شريك بن حنبل عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال محمد الجراح بن مليح صدوق والجراح بن الضحاك مقارب الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": 1810,
			"text": "حدثنا الحسن بن الصباح البزار، حدثنا سفيان بن عيينة، عن عبيد الله بن أبي يزيد، عن أبيه، أن أم أيوب، أخبرته أن النبي صلى الله عليه وسلم نزل عليهم فتكلفوا له طعاما فيه من بعض هذه البقول فكره أكله فقال لأصحابه ‏ \"‏ كلوه فإني لست كأحدكم إني أخاف أن أوذي صاحبي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وأم أيوب هي امرأة أبي أيوب الأنصاري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": 1811,
			"text": "حدثنا محمد بن حميد، حدثنا زيد بن الحباب، عن أبي خلدة، عن أبي العالية، قال الثوم من طيبات الرزق ‏.‏ وأبو خلدة اسمه خالد بن دينار وهو ثقة عند أهل الحديث وقد أدرك أنس بن مالك وسمع منه وأبو العالية اسمه رفيع هو الرياحي قال عبد الرحمن بن مهدي كان أبو خلدة خيارا مسلما ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": 1812,
			"text": "حدثنا قتيبة، عن مالك بن أنس، عن أبي الزبير، عن جابر، قال قال النبي صلى الله عليه وسلم ‏ \"‏ أغلقوا الباب وأوكئوا السقاء وأكفئوا الإناء أو خمروا الإناء وأطفئوا المصباح فإن الشيطان لا يفتح غلقا ولا يحل وكاء ولا يكشف آنية وإن الفويسقة تضرم على الناس بيتهم ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وأبي هريرة وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن جابر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": 1813,
			"text": "حدثنا ابن أبي عمر، وغير، واحد، قالوا حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تتركوا النار في بيوتكم حين تنامون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": 1814,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، وعبيد الله، عن الثوري، عن جبلة بن سحيم، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم أن يقرن بين التمرتين حتى يستأذن صاحبه ‏.‏ قال وفي الباب عن سعد مولى أبي بكر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": 1815,
			"text": "حدثنا محمد بن سهل بن عسكر البغدادي، وعبد الله بن عبد الرحمن، قالا حدثنا يحيى بن حسان، حدثنا سليمان بن بلال، عن هشام بن عروة، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ بيت لا تمر فيه جياع أهله ‏\"‏ ‏.‏ قال وفي الباب عن سلمى امرأة أبي رافع ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث هشام بن عروة إلا من هذا الوجه ‏.‏ قال وسألت البخاري عن هذا الحديث فقال لا أعلم أحدا رواه غير يحيى بن حسان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": 1816,
			"text": "حدثنا هناد، ومحمود بن غيلان، قالا حدثنا أبو أسامة، عن زكريا بن أبي زائدة، عن سعيد بن أبي بردة، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله ليرضى عن العبد أن يأكل الأكلة أو يشرب الشربة فيحمده عليها ‏\"‏ ‏.‏ قال وفي الباب عن عقبة بن عامر وأبي سعيد وعائشة وأبي أيوب وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه غير واحد عن زكريا بن أبي زائدة نحوه ولا نعرفه إلا من حديث زكريا بن أبي زائدة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": 1817,
			"text": "حدثنا أحمد بن سعيد الأشقر، وإبراهيم بن يعقوب، قالا حدثنا يونس بن محمد، حدثنا المفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فأدخله معه في القصعة ثم قال ‏ \"‏ كل بسم الله ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث يونس بن محمد عن المفضل بن فضالة ‏.‏ والمفضل بن فضالة هذا شيخ بصري والمفضل بن فضالة شيخ آخر مصري أوثق من هذا وأشهر ‏.‏ وقد روى شعبة هذا الحديث عن حبيب بن الشهيد عن ابن بريدة أن ابن عمر أخذ بيد مجذوم وحديث شعبة أثبت عندي وأصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": 1818,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الكافر يأكل في سبعة أمعاء والمؤمن يأكل في معى واحد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن أبي هريرة وأبي سعيد وأبي بصرة الغفاري وأبي موسى وجهجاه الغفاري وميمونة وعبد الله بن عمرو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": 1819,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم ضافه ضيف كافر فأمر له رسول الله صلى الله عليه وسلم بشاة فحلبت فشرب ثم أخرى فشربه ثم أخرى فشربه حتى شرب حلاب سبع شياه ثم أصبح من الغد فأسلم فأمر له رسول الله صلى الله عليه وسلم بشاة فحلبت فشرب حلابها ثم أمر له بأخرى فلم يستتمها فقال رسول الله صلى الله عليه وسلم ‏ \"‏ المؤمن يشرب في معى واحد والكافر يشرب في سبعة أمعاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث سهيل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": 1820,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": 1821,
			"text": "حدثنا أحمد بن منيع، حدثنا سفيان، عن أبي يعفور العبدي، عن عبد الله بن أبي أوفى، أنه سئل عن الجراد، فقال غزوت مع النبي صلى الله عليه وسلم ست غزوات نأكل الجراد ‏.‏ قال أبو عيسى هكذا روى سفيان بن عيينة عن أبي يعفور هذا الحديث وقال ست غزوات وروى سفيان الثوري وغير واحد هذا الحديث عن أبي يعفور فقال سبع غزوات ‏. قال وفي الباب عن ابن عمر وجابر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو يعفور اسمه واقد ويقال وقدان أيضا وأبو يعفور الآخر اسمه عبد الرحمن بن عبيد بن نسطاس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": 1822,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، والمؤمل، قالا حدثنا سفيان، عن أبي يعفور، عن ابن أبي أوفى، قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات نأكل الجراد ‏.‏ قال أبو عيسى وروى شعبة، هذا الحديث عن أبي يعفور، عن ابن أبي أوفى، قال غزوت مع رسول الله صلى الله عليه وسلم غزوات نأكل الجراد ‏.‏ حدثنا بذلك محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة بهذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": 1823,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو النضر، هاشم بن القاسم قال حدثنا زياد بن عبد الله بن علاثة، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن جابر بن عبد الله، وأنس بن مالك، قالا كان رسول الله صلى الله عليه وسلم إذا دعا على الجراد قال ‏\"‏ اللهم أهلك الجراد اقتل كباره وأهلك صغاره وأفسد بيضه واقطع دابره وخذ بأفواههم عن معاشنا وأرزاقنا إنك سميع الدعاء ‏\"‏ ‏.‏ قال فقال رجل يا رسول الله كيف تدعو على جند من أجناد الله بقطع دابره قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها نثرة حوت في البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وموسى بن محمد بن إبراهيم التيمي قد تكلم فيه وهو كثير الغرائب والمناكير وأبوه محمد بن إبراهيم ثقة وهو مدني ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": 1824,
			"text": "حدثنا هناد، حدثنا عبدة، عن محمد بن إسحاق، عن ابن أبي نجيح، عن مجاهد، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن أكل الجلالة وألبانها ‏.‏ قال وفي الباب عن عبد الله بن عباس ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى الثوري عن ابن أبي نجيح عن مجاهد عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": 1825,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": 1826,
			"text": "حدثنا زيد بن أخزم الطائي، حدثنا أبو قتيبة، عن أبي العوام، عن قتادة، عن زهدم الجرمي، قال دخلت على أبي موسى وهو يأكل دجاجا فقال ادن فكل فإني رأيت رسول الله صلى الله عليه وسلم يأكله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث من غير وجه عن زهدم ولا نعرفه إلا من حديث زهدم ‏.‏ وأبو العوام هو عمران القطان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": 1827,
			"text": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن أيوب، عن أبي قلابة، عن زهدم، عن أبي موسى، قال رأيت رسول الله صلى الله عليه وسلم يأكل لحم دجاج ‏.‏ قال وفي الحديث كلام أكثر من هذا ‏.‏ وهذا حديث حسن صحيح ‏.‏ وقد روى أيوب السختياني هذا الحديث أيضا عن القاسم التميمي وعن أبي قلابة عن زهدم (الجرمي) ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": 1828,
			"text": "حدثنا الفضل بن سهل الأعرج البغدادي، حدثنا إبراهيم بن عبد الرحمن بن مهدي، عن إبراهيم بن عمر بن سفينة، عن أبيه، عن جده، قال أكلت مع رسول الله صلى الله عليه وسلم لحم حبارى ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وإبراهيم بن عمر بن سفينة روى عنه ابن أبي فديك ويقال بريه بن عمر بن سفينة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": 1829,
			"text": "حدثنا الحسن بن محمد الزعفراني، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني محمد بن يوسف، أن عطاء بن يسار، أخبره أن أم سلمة أخبرته أنها، قربت إلى رسول الله صلى الله عليه وسلم جنبا مشويا فأكل منه ثم قام إلى الصلاة وما توضأ ‏.‏ قال وفي الباب عن عبد الله بن الحارث والمغيرة وأبي رافع ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": 1830,
			"text": "حدثنا قتيبة، حدثنا شريك، عن علي بن الأقمر، عن أبي جحيفة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أما أنا فلا آكل متكئا ‏\"‏ ‏.‏ قال وفي الباب عن علي وعبد الله بن عمرو وعبد الله بن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث علي بن الأقمر ‏.‏ وروى زكريا بن أبي زائدة وسفيان الثوري وغير واحد عن علي بن الأقمر هذا الحديث وروى شعبة عن سفيان الثوري هذا الحديث عن علي بن الأقمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": 1831,
			"text": "حدثنا سلمة بن شبيب، ومحمود بن غيلان، وأحمد بن إبراهيم الدورقي، قالوا حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان النبي صلى الله عليه وسلم يحب الحلواء والعسل ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ وقد رواه علي بن مسهر عن هشام بن عروة وفي الحديث كلام أكثر من هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": 1832,
			"text": "حدثنا محمد بن عمر بن علي المقدمي، حدثنا مسلم بن إبراهيم، حدثنا محمد بن فضاء، حدثني أبي، عن علقمة بن عبد الله المزني، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏ \"‏ إذا اشترى أحدكم لحما فليكثر مرقته فإن لم يجد لحما أصاب مرقة وهو أحد اللحمين ‏\"‏ ‏.‏ وفي الباب عن أبي ذر ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث محمد بن فضاء ‏.‏ ومحمد بن فضاء هو المعبر وقد تكلم فيه سليمان بن حرب وعلقمة بن عبد الله هو أخو بكر بن عبد الله المزني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": 1833,
			"text": "حدثنا الحسين بن علي بن الأسود البغدادي، حدثنا عمرو بن محمد العنقزي، حدثنا إسرائيل، عن صالح بن رستم أبي عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يحقرن أحدكم شيئا من المعروف وإن لم يجد فليلق أخاه بوجه طليق وإن اشتريت لحما أو طبخت قدرا فأكثر مرقته واغرف لجارك منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه شعبة عن أبي عمران الجوني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": 1834,
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن مرة الهمداني، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ كمل من الرجال كثير ولم يكمل من النساء إلا مريم ابنة عمران وآسية امرأة فرعون وفضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأنس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": 1835,
			"text": "حدثنا أحمد بن منيع، حدثنا سفيان بن عيينة، عن عبد الكريم أبي أمية، عن عبد الله بن الحارث، قال زوجني أبي فدعا أناسا فيهم صفوان بن أمية فقال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ انهسوا اللحم نهسا فإنه أهنأ وأمرأ ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأبي هريرة ‏.‏ قال أبو عيسى وهذا حديث حسن لا نعرفه إلا من حديث عبد الكريم ‏.‏ وقد تكلم بعض أهل العلم في عبد الكريم المعلم منهم أيوب السختياني من قبل حفظه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": 1836,
			"text": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن جعفر بن عمرو بن أمية الضمري، عن أبيه، أنه رأى النبي صلى الله عليه وسلم احتز من كتف شاة فأكل منها ثم مضى إلى الصلاة ولم يتوضأ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن المغيرة بن شعبة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": 1837,
			"text": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن أبي حيان التيمي، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها ‏.‏ قال وفي الباب عن ابن مسعود وعائشة وعبد الله بن جعفر وأبي عبيدة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حيان اسمه يحيى بن سعيد بن حيان وأبو زرعة بن عمرو بن جرير اسمه هرم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": 1838,
			"text": "حدثنا الحسن بن محمد الزعفراني، حدثنا يحيى بن عباد أبو عباد، حدثنا فليح بن سليمان، عن عبد الوهاب بن يحيى، من ولد عباد بن عبد الله بن الزبير عن عبد الله بن الزبير، عن عائشة، قالت ما كان الذراع أحب اللحم إلى رسول الله صلى الله عليه وسلم ولكن كان لا يجد اللحم إلا غبا فكان يعجل إليه لأنه أعجلها نضجا ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": 1839,
			"text": "حدثنا الحسن بن عرفة، حدثنا مبارك بن سعيد، هو أخو سفيان بن سعيد الثوري عن سفيان، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ نعم الإدام الخل ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأم هانئ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": 1840,
			"text": "حدثنا محمد بن سهل بن عسكر البغدادي، حدثنا يحيى بن حسان، حدثنا سليمان بن بلال، عن هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نعم الإدام الخل ‏\"‏ ‏.‏ حدثنا عبد الله بن عبد الرحمن، أخبرنا يحيى بن حسان، عن سليمان بن بلال، بهذا الإسناد نحوه إلا أنه قال ‏\"‏ نعم الإدام أو الأدم الخل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه لا نعرفه من حديث هشام بن عروة إلا من حديث سليمان بن بلال ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": 1841,
			"text": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو بكر بن عياش، عن أبي حمزة الثمالي، عن الشعبي، عن أم هانئ بنت أبي طالب، قالت دخل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ هل عندكم شيء ‏\"‏ ‏.‏ فقلت لا إلا كسر يابسة وخل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قربيه فما أقفر بيت من أدم فيه خل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه لا نعرفه من حديث أم هانئ إلا من هذا الوجه ‏.‏ وأبو حمزة الثمالي اسمه ثابت بن أبي صفية وأم هانئ ماتت بعد علي بن أبي طالب بزمان ‏.‏ وسألت محمدا عن هذا الحديث فقال لا أعرف للشعبي سماعا من أم هانئ ‏.‏ فقلت أبو حمزة كيف هو عندك فقال أحمد بن حنبل تكلم فيه وهو عندي مقارب الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": 1842,
			"text": "حدثنا عبدة بن عبد الله الخزاعي البصري، قال حدثنا معاوية بن هشام، عن سفيان، عن محارب بن دثار، عن جابر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ نعم الإدام الخل ‏\"‏ ‏.‏ هذا أصح من حديث مبارك بن سعيد ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": 1843,
			"text": "حدثنا عبدة بن عبد الله الخزاعي، حدثنا معاوية بن هشام، عن سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم كان يأكل البطيخ بالرطب ‏.‏ قال وفي الباب عن أنس ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ورواه بعضهم عن هشام بن عروة عن أبيه عن النبي صلى الله عليه وسلم مرسل ولم يذكر فيه عن عائشة وقد روى يزيد بن رومان عن عروة عن عائشة هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": 1844,
			"text": "حدثنا إسماعيل بن موسى الفزاري، حدثنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر، قال كان النبي صلى الله عليه وسلم يأكل القثاء بالرطب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث إبراهيم بن سعد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": 1845,
			"text": "حدثنا الحسن بن محمد الزعفراني، حدثنا عفان، حدثنا حماد بن سلمة، أخبرنا حميد، وثابت، وقتادة، عن أنس، أن ناسا، من عرينة قدموا المدينة فاجتووها فبعثهم النبي صلى الله عليه وسلم في إبل الصدقة وقال ‏ \"‏ اشربوا من أبوالها وألبانها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث من غير وجه عن أنس رواه أبو قلابة عن أنس ورواه سعيد بن أبي عروبة عن قتادة عن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": 1846,
			"text": "حدثنا يحيى بن موسى، حدثنا عبد الله بن نمير، حدثنا قيس بن الربيع، ح قال وحدثنا قتيبة، حدثنا عبد الكريم الجرجاني، عن قيس بن الربيع المعنى، واحد، عن أبي هاشم يعني الرماني، عن زاذان، عن سلمان، قال قرأت في التوراة أن بركة الطعام الوضوء بعده فذكرت ذلك للنبي صلى الله عليه وسلم فأخبرته بما قرأت في التوراة فقال رسول الله صلى الله عليه وسلم ‏ \"‏ بركة الطعام الوضوء قبله والوضوء بعده ‏\"‏ ‏.‏ قال وفي الباب عن أنس وأبي هريرة ‏.‏ قال أبو عيسى لا نعرف هذا الحديث إلا من حديث قيس بن الربيع ‏.‏ وقيس بن الربيع يضعف في الحديث وأبو هاشم الرماني اسمه يحيى بن دينار ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": 1847,
			"text": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، عن أيوب، عن ابن أبي مليكة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم خرج من الخلاء فقرب إليه طعام فقالوا ألا نأتيك بوضوء قال ‏ \"‏ إنما أمرت بالوضوء إذا قمت إلى الصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه عمرو بن دينار عن سعيد بن الحويرث عن ابن عباس ‏.‏ وقال علي بن المديني قال يحيى بن سعيد كان سفيان الثوري يكره غسل اليد قبل الطعام وكان يكره أن يوضع الرغيف تحت القصعة ‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": 1848,
			"text": "حدثنا محمد بن بشار، حدثنا العلاء بن الفضل بن عبد الملك بن أبي سوية أبو الهذيل، حدثنا عبيد الله بن عكراش، عن أبيه، عكراش بن ذؤيب قال بعثني بنو مرة بن عبيد بصدقات أموالهم إلى رسول الله صلى الله عليه وسلم فقدمت عليه المدينة فوجدته جالسا بين المهاجرين والأنصار قال ثم أخذ بيدي فانطلق بي إلى بيت أم سلمة فقال ‏\"‏ هل من طعام ‏\"‏ ‏.‏ فأتينا بجفنة كثيرة الثريد والوذر وأقبلنا نأكل منها فخبطت بيدي من نواحيها وأكل رسول الله صلى الله عليه وسلم من بين يديه فقبض بيده اليسرى على يدي اليمنى ثم قال ‏\"‏ يا عكراش كل من موضع واحد فإنه طعام واحد ‏\"‏ ‏.‏ ثم أتينا بطبق فيه ألوان الرطب أو التمر عبيد الله شك قال فجعلت آكل من بين يدى وجالت يد رسول الله صلى الله عليه وسلم في الطبق وقال ‏\"‏ يا عكراش كل من حيث شئت فإنه غير لون واحد ‏\"‏ ‏.‏ ثم أتينا بماء فغسل رسول الله صلى الله عليه وسلم يديه ومسح ببلل كفيه وجهه وذراعيه ورأسه وقال ‏\"‏ يا عكراش هذا الوضوء مما غيرت النار ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث العلاء بن الفضل وقد تفرد العلاء بهذا الحديث ولا نعرف لعكراش عن النبي صلى الله عليه وسلم إلا هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": 1849,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن معاوية بن صالح، عن أبي طالوت، قال دخلت على أنس بن مالك وهو يأكل القرع وهو يقول يا لك شجرة ما أحبك إلا لحب رسول الله صلى الله عليه وسلم إياك ‏.‏ قال وفي الباب عن حكيم بن جابر عن أبيه ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": 1850,
			"text": "حدثنا محمد بن ميمون المكي، حدثنا سفيان بن عيينة، حدثني مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأيت رسول الله صلى الله عليه وسلم يتتبع في الصحفة - يعني الدباء فلا أزال أحبه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث من غير وجه عن أنس وروي أنه رأى الدباء بين يدى رسول الله صلى الله عليه وسلم فقال له ما هذا قال ‏ \"‏ هذا الدباء نكثر به طعامنا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": 1851,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": 1852,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، وأبو نعيم قالا حدثنا سفيان، عن عبد الله بن عيسى، عن رجل، يقال له عطاء من أهل الشام عن أبي أسيد قال قال النبي صلى الله عليه وسلم ‏ \"‏ كلوا الزيت وادهنوا به فإنه من شجرة مباركة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه إنما نعرفه من حديث سفيان الثوري عن عبد الله بن عيسى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": 1853,
			"text": "حدثنا نصر بن علي، حدثنا سفيان، عن إسماعيل بن أبي خالد، عن أبيه، عن أبي هريرة، يخبرهم ذاك عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا كفى أحدكم خادمه طعامه حره ودخانه فليأخذ بيده فليقعده معه فإن أبى فليأخذ لقمة فليطعمها إياه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو خالد والد إسماعيل اسمه سعد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": 1854,
			"text": "حدثنا يوسف بن حماد المعني البصري، حدثنا عثمان بن عبد الرحمن الجمحي، عن محمد بن زياد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أفشوا السلام وأطعموا الطعام واضربوا الهام تورثوا الجنان ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وابن عمر وأنس وعبد الله بن سلام وعبد الرحمن بن عائش وشريح بن هانئ عن أبيه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث ابن زياد عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": 1855,
			"text": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اعبدوا الرحمن وأطعموا الطعام وأفشوا السلام تدخلوا الجنة بسلام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": 1856,
			"text": "حدثنا يحيى بن موسى، حدثنا محمد بن يعلى الكوفي، حدثنا عنبسة بن عبد الرحمن القرشي، عن عبد الملك بن علاق، عن أنس بن مالك، قال قال النبي صلى الله عليه وسلم ‏ \"‏ تعشوا ولو بكف من حشف فإن ترك العشاء مهرمة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث منكر لا نعرفه إلا من هذا الوجه ‏.‏ وعنبسة يضعف في الحديث وعبد الملك بن علاق مجهول ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": 1857,
			"text": "حدثنا عبد الله بن الصباح الهاشمي، حدثنا عبد الأعلى، عن معمر، عن هشام بن عروة، عن أبيه، عن عمر بن أبي سلمة، أنه دخل على رسول الله صلى الله عليه وسلم وعنده طعام فقال ‏ \"‏ ادن يا بنى وسم الله وكل بيمينك وكل مما يليك ‏\"‏ ‏.‏ قال أبو عيسى وقد روي عن هشام بن عروة عن أبي وجزة السعدي عن رجل من مزينة عن عمر بن أبي سلمة ‏.‏ وقد اختلف أصحاب هشام بن عروة في رواية هذا الحديث ‏.‏ وأبو وجزة السعدي اسمه يزيد بن عبيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": 1858,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": 1859,
			"text": "حدثنا أحمد بن منيع، حدثنا يعقوب بن الوليد المدني، عن ابن أبي ذئب، عن المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الشيطان حساس لحاس فاحذروه على أنفسكم من بات وفي يده ريح غمر فأصابه شيء فلا يلومن إلا نفسه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وقد روي من حديث سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": 1860,
			"text": "حدثنا أبو بكر، محمد بن إسحاق البغدادي الصاغاني حدثنا محمد بن جعفر المدائني، حدثنا منصور بن أبي الأسود، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من بات وفي يده ريح غمر فأصابه شيء فلا يلومن إلا نفسه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث الأعمش إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 78
			}
		}
	]
}