{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"29": "Chapters On Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2090,
			"arabicnumber": 2090,
			"text": "حدثنا سعيد بن يحيى بن سعيد الأموي، قال حدثنا أبي، قال حدثنا محمد بن عمرو، قال حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من ترك مالا فلأهله ومن ترك ضياعا فإلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن جابر وأنس ‏.‏ وقد رواه الزهري عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم أطول من هذا وأتم ‏.‏ معنى ضياعا ضائعا ليس له شيء فأنا أعوله وأنفق عليه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "حدثنا عبد الأعلى بن واصل، قال حدثنا محمد بن القاسم الأسدي، قال حدثنا الفضل بن دلهم، قال حدثنا عوف، عن شهر بن حوشب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ تعلموا القرآن والفرائض وعلموا الناس فإني مقبوض ‏\".‏ قال أبو عيسى هذا حديث فيه اضطراب وروى أبو أسامة، هذا الحديث عن عوف، عن رجل، عن سليمان بن جابر، عن ابن مسعود، عن النبي صلى الله عليه وسلم ‏.‏ حدثنا بذلك الحسين بن حريث، أخبرنا أبو أسامة، عن عوف، بهذا بمعناه ‏.‏ ومحمد بن القاسم الأسدي قد ضعفه أحمد بن حنبل وغيره ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "حدثنا عبد بن حميد، قال حدثني زكرياء بن عدي، أخبرنا عبيد الله بن عمرو، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، قال جاءت امرأة سعد بن الربيع بابنتيها من سعد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله هاتان ابنتا سعد بن الربيع قتل أبوهما معك يوم أحد شهيدا وإن عمهما أخذ مالهما فلم يدع لهما مالا ولا تنكحان إلا ولهما مال ‏.‏ قال ‏\"‏ يقضي الله في ذلك ‏\"‏ ‏.‏ فنزلت آية الميراث فبعث رسول الله صلى الله عليه وسلم إلى عمهما فقال ‏\"‏ أعط ابنتى سعد الثلثين وأعط أمهما الثمن وما بقي فهو لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث عبد الله بن محمد بن عقيل وقد رواه شريك أيضا عن عبد الله بن محمد بن عقيل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "حدثنا الحسن بن عرفة, قال حدثنا يزيد بن هارون، عن سفيان الثوري، عن أبي قيس الأودي، عن هزيل بن شرحبيل، قال جاء رجل إلى أبي موسى وسلمان بن ربيعة فسألهما عن الابنة، وابنة الابن، وأخت، لأب وأم فقالا للابنة النصف وللأخت من الأب والأم ما بقي ‏.‏ وقالا له انطلق إلى عبد الله فاسأله فإنه سيتابعنا ‏.‏ فأتى عبد الله فذكر ذلك له وأخبره بما قالا قال عبد الله قد ضللت إذا وما أنا من المهتدين ولكن أقضي فيهما كما قضى رسول الله صلى الله عليه وسلم للابنة النصف ولابنة الابن السدس تكملة الثلثين وللأخت ما بقي ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وأبو قيس الأودي اسمه عبد الرحمن بن ثروان الكوفي وقد رواه شعبة عن أبي قيس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": 2094,
			"text": "حدثنا بندار، قال حدثنا يزيد بن هارون، أخبرنا سفيان، عن أبي إسحاق، عن الحارث، عن علي، أنه قال إنكم تقرءون هذه الآية ‏:‏ ‏(‏من بعد وصية توصون بها أو دين ‏)‏ وأن رسول الله صلى الله عليه وسلم قضى بالدين قبل الوصية وإن أعيان بني الأم يتوارثون دون بني العلات الرجل يرث أخاه لأبيه وأمه دون أخيه لأبيه ‏.‏ حدثنا بندار، قال حدثنا يزيد بن هارون، أخبرنا زكريا بن أبي زائدة، عن أبي إسحاق، عن الحارث، عن علي، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": 2095,
			"text": "حدثنا ابن أبي عمر، قال حدثنا سفيان، قال حدثنا أبو إسحاق، عن الحارث، عن علي، قال قضى رسول الله صلى الله عليه وسلم أن أعيان بني الأم يتوارثون دون بني العلات ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث أبي إسحاق عن الحارث عن علي ‏.‏ وقد تكلم بعض أهل العلم في الحارث والعمل على هذا الحديث عند عامة أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": 2096,
			"text": "حدثنا عبد بن حميد، قال حدثنا عبد الرحمن بن سعد، أخبرنا عمرو بن أبي قيس، عن محمد بن المنكدر، عن جابر بن عبد الله، قال جاءني رسول الله صلى الله عليه وسلم يعودني وأنا مريض في بني سلمة فقلت يا نبي الله كيف أقسم مالي بين ولدي فلم يرد على شيئا فنزلت ‏:‏ ‏(‏يوصيكم الله في أولادكم للذكر مثل حظ الأنثيين ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة وابن عيينة وغيره عن محمد بن المنكدر عن جابر.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "حدثنا الفضل بن الصباح البغدادي، قال أخبرنا سفيان بن عيينة، قال أخبرنا محمد بن المنكدر، سمع جابر بن عبد الله، يقول مرضت فأتاني رسول الله صلى الله عليه وسلم يعودني فوجدني قد أغمي على فأتى ومعه أبو بكر وعمر وهما ماشيان فتوضأ رسول الله صلى الله عليه وسلم فصب على من وضوئه فأفقت فقلت يا رسول الله كيف أقضي في مالي أو كيف أصنع في مالي فلم يجبني شيئا وكان له تسع أخوات حتى نزلت آية الميراث ‏:‏ ‏(‏يستفتونك قل الله يفتيكم في الكلالة ‏)‏ الآية ‏.‏ قال جابر في نزلت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": 2098,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ألحقوا الفرائض بأهلها فما بقي فهو لأولى رجل ذكر ‏\"‏ ‏.‏ حدثنا عبد بن حميد، أخبرنا عبد الرزاق، عن معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى هذا حديث حسن وقد روى بعضهم عن ابن طاوس عن أبيه عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": 2099,
			"text": "حدثنا الحسن بن عرفة، قال حدثنا يزيد بن هارون، عن همام بن يحيى، عن قتادة، عن الحسن، عن عمران بن حصين، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إن ابني مات فما لي في ميراثه قال ‏\"‏ لك السدس ‏\"‏ ‏.‏ فلما ولى دعاه فقال ‏\"‏ لك سدس آخر ‏\"‏ ‏.‏ فلما ولى دعاه قال ‏\"‏ إن السدس الآخر طعمة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن معقل بن يسار ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2100,
			"arabicnumber": 2100,
			"text": "حدثنا ابن أبي عمر، قال حدثنا سفيان، قال حدثنا الزهري، قال مرة قال قبيصة وقال مرة رجل عن قبيصة بن ذؤيب قال جاءت الجدة أم الأم أو أم الأب إلى أبي بكر فقالت إن ابن ابني أو ابن بنتي مات وقد أخبرت أن لي في كتاب الله حقا ‏.‏ فقال أبو بكر ما أجد لك في الكتاب من حق وما سمعت رسول الله صلى الله عليه وسلم قضى لك بشيء وسأسأل الناس ‏.‏ قال فسأل فشهد المغيرة بن شعبة أن رسول الله صلى الله عليه وسلم أعطاها السدس ‏.‏ قال ومن سمع ذلك معك قال محمد بن مسلمة ‏.‏ قال فأعطاها السدس ثم جاءت الجدة الأخرى التي تخالفها إلى عمر ‏.‏ قال سفيان وزادني فيه معمر عن الزهري ولم أحفظه عن الزهري ولكن حفظته من معمر أن عمر قال إن اجتمعتما فهو لكما وأيتكما انفردت به فهو لها ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2101,
			"arabicnumber": 2101,
			"text": "حدثنا الأنصاري، حدثنا معن، قال حدثنا مالك، عن ابن شهاب، عن عثمان بن إسحاق بن خرشة، عن قبيصة بن ذؤيب، قال جاءت الجدة إلى أبي بكر تسأله ميراثها ‏.‏ قال فقال لها ما لك في كتاب الله شيء وما لك في سنة رسول الله صلى الله عليه وسلم شيء فارجعي حتى أسأل الناس ‏.‏ فسأل الناس فقال المغيرة بن شعبة حضرت رسول الله صلى الله عليه وسلم فأعطاها السدس ‏.‏ فقال أبو بكر هل معك غيرك فقام محمد بن مسلمة الأنصاري فقال مثل ما قال المغيرة بن شعبة فأنفذه لها أبو بكر ‏.‏ قال ثم جاءت الجدة الأخرى إلى عمر بن الخطاب تسأله ميراثها فقال ما لك في كتاب الله شيء ولكن هو ذاك السدس فإن اجتمعتما فيه فهو بينكما وأيتكما خلت به فهو لها ‏.‏ قال أبو عيسى وفي الباب عن بريدة ‏.‏ وهذا أحسن وهو أصح من حديث ابن عيينة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": 2102,
			"text": "حدثنا الحسن بن عرفة، قال حدثنا يزيد بن هارون، عن محمد بن سالم، عن الشعبي، عن مسروق، عن عبد الله بن مسعود، قال في الجدة مع ابنها إنها أول جدة أطعمها رسول الله صلى الله عليه وسلم سدسا مع ابنها وابنها حى ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ - وقد ورث بعض أصحاب النبي صلى الله عليه وسلم الجدة مع ابنها ولم يورثها بعضهم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "حدثنا بندار، قال: حدثنا أبو أحمد الزبيري، قال: حدثنا سفيان، عن عبد الرحمن بن الحارث، عن حكيم بن حكيم بن عباد بن حنيف، عن أبي أمامة بن سهل بن حنيف، قال كتب عمر بن الخطاب إلى أبي عبيدة أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الله ورسوله مولى من لا مولى له والخال وارث من لا وارث له ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عائشة والمقدام بن معديكرب ‏.‏ وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2104,
			"arabicnumber": 2104,
			"text": "أخبرنا إسحاق بن منصور، قال: أخبرنا أبو عاصم، عن ابن جريج، عن عمرو بن مسلم، عن طاوس، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ الخال وارث من لا وارث له ‏\"‏ ‏.‏ وهذا حديث حسن غريب وقد أرسله بعضهم ولم يذكر فيه عن عائشة ‏.‏ - واختلف فيه أصحاب النبي صلى الله عليه وسلم فورث بعضهم الخال والخالة والعمة وإلى هذا الحديث ذهب أكثر أهل العلم في توريث ذوي الأرحام وأما زيد بن ثابت فلم يورثهم وجعل الميراث في بيت المال ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2105,
			"arabicnumber": 2105,
			"text": "حدثنا بندار، قال: حدثنا يزيد بن هارون، قال: أخبرنا سفيان، عن عبد الرحمن بن الأصبهاني، عن مجاهد، وهو ابن وردان عن عروة، عن عائشة، أن مولى، للنبي صلى الله عليه وسلم وقع من عذق نخلة فمات فقال النبي صلى الله عليه وسلم ‏\"‏ انظروا هل له من وارث ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فادفعوه إلى بعض أهل القرية ‏\"‏ ‏.‏ وهذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": 2106,
			"text": "حدثنا ابن أبي عمر، قال: حدثنا سفيان، عن عمرو بن دينار، عن عوسجة، عن ابن عباس، أن رجلا، مات على عهد رسول الله صلى الله عليه وسلم ولم يدع وارثا إلا عبدا هو أعتقه فأعطاه النبي صلى الله عليه وسلم ميراثه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل عند أهل العلم في هذا الباب إذا مات الرجل ولم يترك عصبة أن ميراثه يجعل في بيت مال المسلمين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": 2107,
			"text": "حدثنا سعيد بن عبد الرحمن المخزومي، وغير، واحد، قالوا حدثنا سفيان، عن الزهري، ح وحدثنا علي بن حجر، أخبرنا هشيم، عن الزهري، عن علي بن حسين، عن عمرو بن عثمان، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يرث المسلم الكافر ولا الكافر المسلم ‏\"‏ ‏.‏ حدثنا ابن أبي عمر حدثنا سفيان حدثنا الزهري نحوه ‏.‏ قال أبو عيسى وفي الباب عن جابر وعبد الله بن عمرو ‏.‏ وهذا حديث حسن صحيح هكذا رواه معمر وغير واحد عن الزهري نحو هذا ‏.‏ وروى مالك عن الزهري عن علي بن حسين عن عمر بن عثمان عن أسامة بن زيد عن النبي صلى الله عليه وسلم نحوه وحديث مالك وهم وهم فيه مالك وقد رواه بعضهم عن مالك فقال عن عمرو بن عثمان وأكثر أصحاب مالك قالوا عن مالك عن عمر بن عثمان وعمرو بن عثمان بن عفان هو مشهور من ولد عثمان ولا يعرف عمر بن عثمان ‏.‏ والعمل على هذا الحديث عند أهل العلم واختلف بعض أهل العلم في ميراث المرتد فجعل أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم المال لورثته من المسلمين ‏.‏ وقال بعضهم لا يرثه ورثته من المسلمين واحتجوا بحديث النبي صلى الله عليه وسلم ‏\"‏ لا يرث المسلم الكافر ‏\"‏ ‏.‏ وهو قول الشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": 2108,
			"text": "حدثنا حميد بن مسعدة، قال: حدثنا حصين بن نمير، عن ابن أبي ليلى، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يتوارث أهل ملتين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث جابر إلا من حديث ابن أبي ليلى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": 2109,
			"text": "حدثنا قتيبة، قال: حدثنا الليث، عن إسحاق بن عبد الله، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ القاتل لا يرث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا يصح ولا يعرف إلا من هذا الوجه ‏.‏ وإسحاق بن عبد الله بن أبي فروة قد تركه بعض أهل الحديث منهم أحمد بن حنبل ‏.‏ والعمل على هذا عند أهل العلم أن القاتل لا يرث كان القتل عمدا أو خطأ ‏.‏ وقال بعضهم إذا كان القتل خطأ فإنه يرث وهو قول مالك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": 2110,
			"text": "حدثنا قتيبة، وأحمد بن منيع، وغير، واحد، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن سعيد بن المسيب، قال قال عمر الدية على العاقلة ولا ترث المرأة من دية زوجها شيئا ‏.‏ فأخبره الضحاك بن سفيان الكلابي أن رسول الله صلى الله عليه وسلم كتب إليه أن ورث امرأة أشيم الضبابي من دية زوجها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": 2111,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قضى في جنين امرأة من بني لحيان سقط ميتا بغرة عبد أو أمة ثم إن المرأة التي قضي عليها بالغرة توفيت فقضى رسول الله صلى الله عليه وسلم أن ميراثها لبنيها وزوجها وأن عقلها على عصبتها ‏.‏ قال أبو عيسى وروى يونس هذا الحديث عن الزهري عن سعيد بن المسيب وأبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه ورواه مالك عن الزهري عن أبي سلمة عن أبي هريرة ومالك عن الزهري عن سعيد بن المسيب عن النبي صلى الله عليه وسلم مرسل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": 2112,
			"text": "حدثنا أبو كريب، قال: حدثنا أبو أسامة، وابن، نمير ووكيع عن عبد العزيز بن عمر بن عبد العزيز، عن عبد الله بن موهب، وقال، بعضهم عن عبد الله بن وهب، عن تميم الداري، قال سألت رسول الله صلى الله عليه وسلم ما السنة في الرجل من أهل الشرك يسلم على يدى رجل من المسلمين فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو أولى الناس بمحياه ومماته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث عبد الله بن وهب ويقال ابن موهب عن تميم الداري ‏.‏ وقد أدخل بعضهم بين عبد الله بن وهب وبين تميم الداري قبيصة بن ذؤيب ولا يصح رواه يحيى بن حمزة عن عبد العزيز بن عمر وزاد فيه قبيصة بن ذؤيب وهو عندي ليس بمتصل ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم وقال بعضهم يجعل ميراثه في بيت المال وهو قول الشافعي واحتج بحديث النبي صلى الله عليه وسلم ‏\"‏ أن الولاء لمن أعتق ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": 2113,
			"text": "حدثنا قتيبة، قال حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما رجل عاهر بحرة أو أمة فالولد ولد زنا لا يرث ولا يورث ‏\"‏ ‏.‏ قال أبو عيسى وقد روى غير ابن لهيعة هذا الحديث عن عمرو بن شعيب ‏.‏ والعمل على هذا عند أهل العلم أن ولد الزنا لا يرث من أبيه.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": 2114,
			"text": "حدثنا قتيبة، قال: حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يرث الولاء من يرث المال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بالقوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": 2115,
			"text": "حدثنا هارون أبو موسى المستملي البغدادي، قال: حدثنا محمد بن حرب، قال: حدثنا عمر بن رؤبة التغلبي، عن عبد الواحد بن عبد الله أبي بسر النصري، عن واثلة بن الأسقع، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ المرأة تحوز ثلاثة مواريث عتيقها ولقيطها وولدها الذي لاعنت عليه ‏\"‏ ‏.‏ هذا حديث حسن غريب لا يعرف إلا من هذا الوجه من حديث محمد بن حرب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 26
			}
		}
	]
}