{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"32": "Chapters On Al-Qadar"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2133,
			"arabicnumber": 2133,
			"text": "حدثنا عبد الله بن معاوية الجمحي البصري، قال حدثنا صالح المري، عن هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن نتنازع في القدر فغضب حتى احمر وجهه حتى كأنما فقئ في وجنتيه الرمان فقال ‏ \"‏ أبهذا أمرتم أم بهذا أرسلت إليكم إنما هلك من كان قبلكم حين تنازعوا في هذا الأمر عزمت عليكم ألا تتنازعوا فيه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمر وعائشة وأنس ‏.‏ وهذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث صالح المري ‏.‏ وصالح المري له غرائب ينفرد بها لا يتابع عليها ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": 2134,
			"text": "حدثنا يحيى بن حبيب بن عربي، قال حدثنا المعتمر بن سليمان، قال حدثنا أبي، عن سليمان الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ احتج آدم وموسى فقال موسى يا آدم أنت الذي خلقك الله بيده ونفخ فيك من روحه أغويت الناس وأخرجتهم من الجنة ‏.‏ قال فقال آدم وأنت موسى الذي اصطفاك الله بكلامه أتلومني على عمل عملته كتبه الله على قبل أن يخلق السموات والأرض قال فحج آدم موسى ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمر وجندب ‏.‏ وهذا حديث حسن صحيح غريب من هذا الوجه من حديث سليمان التيمي عن الأعمش ‏.‏ وقد روى بعض أصحاب الأعمش عن الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وقال بعضهم عن الأعمش عن أبي صالح عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": 2135,
			"text": "حدثنا بندار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا شعبة، عن عاصم بن عبيد الله، قال سمعت سالم بن عبد الله، يحدث عن أبيه، قال قال عمر يا رسول الله أرأيت ما نعمل فيه أمر مبتدع أو مبتدأ أو فيما قد فرغ منه فقال ‏ \"‏ فيما قد فرغ منه يا ابن الخطاب وكل ميسر أما من كان من أهل السعادة فإنه يعمل للسعادة وأما من كان من أهل الشقاء فإنه يعمل للشقاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وحذيفة بن أسيد وأنس وعمران بن حصين ‏.‏ وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": 2136,
			"text": "حدثنا الحسن بن علي الحلواني،قال حدثنا عبد الله بن نمير، ووكيع، عن الأعمش، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي، قال بينما نحن مع رسول الله صلى الله عليه وسلم وهو ينكت في الأرض إذ رفع رأسه إلى السماء ثم قال ‏\"‏ ما منكم من أحد إلا قد علم وقال وكيع إلا قد كتب مقعده من النار ومقعده من الجنة ‏\"‏ ‏.‏ قالوا أفلا نتكل يا رسول الله قال ‏\"‏ لا اعملوا فكل ميسر لما خلق له ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": 2137,
			"text": "حدثنا هناد، حدثنا أبو معاوية، قال عن الأعمش، عن زيد بن وهب، عن عبد الله بن مسعود، قال حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق ‏ \"‏ إن أحدكم يجمع خلقه في بطن أمه في أربعين يوما ثم يكون علقة مثل ذلك ثم يكون مضغة مثل ذلك ثم يرسل الله إليه الملك فينفخ فيه ويؤمر بأربع يكتب رزقه وأجله وعمله وشقي أو سعيد فوالذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع ثم يسبق عليه الكتاب فيختم له بعمل أهل النار فيدخلها وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع ثم يسبق عليه الكتاب فيختم له بعمل أهل الجنة فيدخلها ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا الأعمش، حدثنا زيد بن وهب، عن عبد الله بن مسعود، قال حدثنا رسول الله صلى الله عليه وسلم فذكر مثله ‏.‏ وهذا حديث حسن صحيح ‏.‏ وقد روى شعبة والثوري عن الأعمش نحوه ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وأنس ‏.‏ وسمعت أحمد بن الحسن قال سمعت أحمد بن حنبل يقول ما رأيت بعيني مثل يحيى بن سعيد القطان و هذا حديث حسن صحيح. وقد روى شعبة والثوري عن عن الأعمش نحوه. حدثنا محمد بن العلاء، حدثنا وكيع، عن الأعمش، عن زيد، نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": 2138,
			"text": "حدثنا محمد بن يحيى القطعي البصري، قال: حدثنا عبد العزيز بن ربيعة البناني، قال: حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مولود يولد على الملة فأبواه يهودانه أو ينصرانه أو يشركانه ‏\"‏ ‏.‏ قيل يا رسول الله فمن هلك قبل ذلك قال ‏\"‏ الله أعلم بما كانوا عاملين به ‏\"‏ ‏.‏ حدثنا أبو كريب، والحسين بن حريث، قالا حدثنا وكيع، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه بمعناه وقال ‏\"‏ يولد على الفطرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة وغيره عن الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم بمعناه ‏.‏ وفي الباب عن الأسود بن سريع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": 2139,
			"text": "حدثنا محمد بن حميد الرازي، وسعيد بن يعقوب، قالا حدثنا يحيى بن الضريس، عن أبي مودود، عن سليمان التيمي، عن أبي عثمان النهدي، عن سلمان، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يرد القضاء إلا الدعاء ولا يزيد في العمر إلا البر ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي أسيد ‏.‏ وهذا حديث حسن غريب من حديث سلمان لا نعرفه إلا من حديث يحيى بن الضريس ‏.‏ وأبو مودود اثنان أحدهما يقال له فضة وهو الذي روى هذا الحديث اسمه فضة بصري والآخر عبد العزيز بن أبي سليمان أحدهما بصري والآخر مدني وكانا في عصر واحد وابو مودود الذي روى هذا الحديث أسمه فضة بصري. ‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": 2140,
			"text": "حدثنا هناد، قال حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن أنس، قال كان رسول الله صلى الله عليه وسلم يكثر أن يقول ‏\"‏ يا مقلب القلوب ثبت قلبي على دينك ‏\"‏ ‏.‏ فقلت يا رسول الله آمنا بك وبما جئت به فهل تخاف علينا قال ‏\"‏ نعم إن القلوب بين أصبعين من أصابع الله يقلبها كيف يشاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن النواس بن سمعان وأم سلمة وعبد الله بن عمرو وعائشة ‏.‏ وهذا حديث حسن وهكذا روى غير واحد عن الأعمش عن أبي سفيان عن أنس ‏.‏ وروى بعضهم عن الأعمش عن أبي سفيان عن جابر عن النبي صلى الله عليه وسلم ‏.‏ وحديث أبي سفيان عن أنس أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "حدثنا قتيبة بن سعيد، قال: حدثنا الليث، عن أبي قبيل، عن شفى بن ماتع، عن عبد الله بن عمرو بن العاصي، قال خرج علينا رسول الله صلى الله عليه وسلم وفي يده كتابان فقال ‏\"‏ أتدرون ما هذان الكتابان ‏\"‏ ‏.‏ فقلنا لا يا رسول الله إلا أن تخبرنا ‏.‏ فقال للذي في يده اليمنى ‏\"‏ هذا كتاب من رب العالمين فيه أسماء أهل الجنة وأسماء آبائهم وقبائلهم ثم أجمل على آخرهم فلا يزاد فيهم ولا ينقص منهم أبدا ‏\"‏ ‏.‏ ثم قال للذي في شماله ‏\"‏ هذا كتاب من رب العالمين فيه أسماء أهل النار وأسماء آبائهم وقبائلهم ثم أجمل على آخرهم فلا يزاد فيهم ولا ينقص منهم أبدا ‏\"‏ ‏.‏ فقال أصحابه ففيم العمل يا رسول الله إن كان أمر قد فرغ منه فقال ‏\"‏ سددوا وقاربوا فإن صاحب الجنة يختم له بعمل أهل الجنة وإن عمل أى عمل وإن صاحب النار يختم له بعمل أهل النار وإن عمل أى عمل ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم بيديه فنبذهما ثم قال ‏\"‏ فرغ ربكم من العباد فريق في الجنة وفريق في السعير ‏\"‏ ‏.‏ حدثنا قتيبة حدثنا بكر بن مضر عن أبي قبيل نحوه ‏.‏ قال أبو عيسى وفي الباب عن ابن عمر ‏.‏ وهذا حديث حسن غريب صحيح ‏.‏ وأبو قبيل اسمه حيى بن هانئ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": 2142,
			"text": "حدثنا علي بن حجر، قال: حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أراد الله بعبد خيرا استعمله ‏\"‏ ‏.‏ فقيل كيف يستعمله يا رسول الله قال ‏\"‏ يوفقه لعمل صالح قبل الموت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": 2143,
			"text": "حدثنا بندار، قال: حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عمارة بن القعقاع، حدثنا أبو زرعة بن عمرو بن جرير، قال حدثنا صاحب، لنا عن ابن مسعود، قال قام فينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا يعدي شيء شيئا ‏\"‏ ‏.‏ فقال أعرابي يا رسول الله البعير الجرب الحشفة ندبنه فيجرب الإبل كلها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن أجرب الأول لا عدوى ولا صفر خلق الله كل نفس وكتب حياتها ورزقها ومصائبها ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وابن عباس وأنس ‏.‏ قال وسمعت محمد بن عمرو بن صفوان الثقفي البصري قال سمعت علي بن المديني يقول لو حلفت بين الركن والمقام لحلفت أني لم أر أحدا أعلم من عبد الرحمن بن مهدي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": 2144,
			"text": "حدثنا أبو الخطاب، زياد بن يحيى البصري حدثنا عبد الله بن ميمون، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يؤمن عبد حتى يؤمن بالقدر خيره وشره حتى يعلم أن ما أصابه لم يكن ليخطئه وأن ما أخطأه لم يكن ليصيبه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبادة وجابر وعبد الله بن عمرو ‏.‏ وهذا حديث غريب لا نعرفه إلا من حديث عبد الله بن ميمون ‏.‏ وعبد الله بن ميمون منكر الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": 2145,
			"text": "حدثنا محمود بن غيلان، قال: حدثنا أبو داود، قال أنبأنا شعبة، عن منصور، عن ربعي بن حراش، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يؤمن عبد حتى يؤمن بأربع يشهد أن لا إله إلا الله وأني محمد رسول الله بعثني بالحق ويؤمن بالموت وبالبعث بعد الموت ويؤمن بالقدر ‏\"‏ ‏.‏ حدثنا محمود بن غيلان، حدثنا النضر بن شميل، عن شعبة، نحوه إلا أنه قال ربعي عن رجل، عن علي، ‏.‏ قال أبو عيسى حديث أبي داود عن شعبة، عندي أصح من حديث النضر وهكذا روى غير واحد عن منصور عن ربعي عن علي ‏.‏ حدثنا الجارود قال سمعت وكيعا يقول بلغنا أن ربعيا لم يكذب في الإسلام كذبة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": 2147,
			"text": "حدثنا أحمد بن منيع، وعلي بن حجر، - المعنى واحد قالا حدثنا إسماعيل بن إبراهيم، عن أيوب، عن أبي المليح بن أسامة، عن أبي عزة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا قضى الله لعبد أن يموت بأرض جعل له إليها حاجة أو قال بها حاجة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وأبو عزة له صحبة واسمه يسار بن عبد وأبو المليح اسمه عامر بن أسامة بن عمير الهذلي ويقال زيد بن أسامة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": 2148,
			"text": "حدثنا سعيد بن عبد الرحمن المخزومي، قال: حدثنا سفيان بن عيينة، عن الزهري، عن ابن أبي خزامة، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله أرأيت رقى نسترقيها ودواء نتداوى به وتقاة نتقيها هل ترد من قدر الله شيئا فقال ‏ \"‏ هي من قدر الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث الزهري وقد روى غير واحد هذا عن سفيان عن الزهري عن أبي خزامة عن أبيه وهذا أصح هكذا قال غير واحد عن الزهري عن أبي خزامة عن أبيه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2149,
			"arabicnumber": 2149,
			"text": "حدثنا واصل بن عبد الأعلى الكوفي، قال: حدثنا محمد بن فضيل، عن القاسم بن حبيب، وعلي بن نزار، عن نزار، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ صنفان من أمتي ليس لهما في الإسلام نصيب المرجئة والقدرية ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمر وابن عمر ورافع بن خديج ‏.‏ وهذا حديث غريب حسن صحيح ‏.‏ حدثنا محمد بن رافع، قال: حدثنا محمد بن بشر، قال: حدثنا سلام بن أبي عمرة، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ قال محمد بن رافع وأخبرنا محمد بن بشر أخبرنا علي بن نزار عن نزار عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2150,
			"arabicnumber": 2150,
			"text": "حدثنا أبو هريرة، محمد بن فراس البصري, قال: حدثنا أبو قتيبة، سلم بن قتيبة حدثنا أبو العوام، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏ \"‏ مثل ابن آدم وإلى جنبه تسع وتسعون منية إن أخطأته المنايا وقع في الهرم حتى يموت ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأبو العوام هو عمران وهو ابن داور القطان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": 2151,
			"text": "حدثنا محمد بن بشار، قال: حدثنا أبو عامر، عن محمد بن أبي حميد، عن إسماعيل بن محمد بن سعد بن أبي وقاص، عن أبيه، عن سعد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من سعادة ابن آدم رضاه بما قضى الله له ومن شقاوة ابن آدم تركه استخارة الله ومن شقاوة ابن آدم سخطه بما قضى الله له ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث محمد بن أبي حميد ‏.‏ ويقال له أيضا حماد بن أبي حميد وهو أبو إبراهيم المدني وليس هو بالقوي عند أهل الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": 2152,
			"text": "حدثنا محمد بن بشار، قال: حدثنا أبو عاصم، قال: حدثنا حيوة بن شريح، أخبرني أبو صخر، قال حدثني نافع، أن ابن عمر، جاءه رجل فقال إن فلانا يقرأ عليك السلام ‏.‏ فقال له إنه بلغني أنه قد أحدث فإن كان قد أحدث فلا تقرئه مني السلام فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ يكون في هذه الأمة أو في أمتي الشك منه خسف أو مسخ أو قذف في أهل القدر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وأبو صخر اسمه حميد بن زياد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": 2153,
			"text": "حدثنا قتيبة، قال: حدثنا رشدين بن سعد، عن أبي صخر، حميد بن زياد عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏ \"‏ يكون في أمتي خسف ومسخ وذلك في المكذبين بالقدر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": 2154,
			"text": "حدثنا قتيبة، قال: حدثنا عبد الرحمن بن زيد بن أبي الموالي المزني، عن عبيد الله بن عبد الرحمن بن موهب، عن عمرة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ ستة لعنتهم لعنهم الله وكل نبي كان الزائد في كتاب الله والمكذب بقدر الله والمتسلط بالجبروت ليعز بذلك من أذل الله ويذل من أعز الله والمستحل لحرم الله والمستحل من عترتي ما حرم الله والتارك لسنتي ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى عبد الرحمن بن أبي الموالي هذا الحديث عن عبيد الله بن عبد الرحمن بن موهب عن عمرة عن عائشة عن النبي صلى الله عليه وسلم ‏.‏ ورواه سفيان الثوري وحفص بن غياث وغير واحد عن عبيد الله بن عبد الرحمن بن موهب عن علي بن حسين عن النبي صلى الله عليه وسلم مرسلا وهذا أصح ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": 2155,
			"text": "حدثنا يحيى بن موسى، قال: حدثنا أبو داود الطيالسي، قال: حدثنا عبد الواحد بن سليم، قال قدمت مكة فلقيت عطاء بن أبي رباح فقلت له يا أبا محمد إن أهل البصرة يقولون في القدر ‏.‏ قال يا بنى أتقرأ القرآن قلت نعم ‏.‏ قال فاقرإ الزخرف ‏.‏ قال فقرأت ‏:‏ ‏(‏حم* والكتاب المبين * إنا جعلناه قرآنا عربيا لعلكم تعقلون * وإنه في أم الكتاب لدينا لعلي حكيم ‏)‏ فقال أتدري ما أم الكتاب قلت الله ورسوله أعلم ‏.‏ قال فإنه كتاب كتبه الله قبل أن يخلق السموات وقبل أن يخلق الأرض فيه إن فرعون من أهل النار وفيه ‏:‏ ‏(‏تبت يدا أبي لهب وتب ‏)‏ قال عطاء فلقيت الوليد بن عبادة بن الصامت صاحب رسول الله صلى الله عليه وسلم فسألته ما كان وصية أبيك عند الموت قال دعاني أبي فقال لي يا بنى اتق الله واعلم أنك لن تتقي الله حتى تؤمن بالله وتؤمن بالقدر كله خيره وشره فإن مت على غير هذا دخلت النار إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول ما خلق الله القلم فقال اكتب ‏.‏ فقال ما أكتب قال اكتب القدر ما كان وما هو كائن إلى الأبد ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": 2156,
			"text": "حدثنا إبراهيم بن عبد الله بن المنذر الباهلي الصنعاني، قال: حدثنا عبد الله بن يزيد المقرئ، قال: حدثنا حيوة بن شريح، قال: حدثني أبو هانئ الخولاني، أنه سمع أبا عبد الرحمن الحبلي، يقول سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ قدر الله المقادير قبل أن يخلق السموات والأرض بخمسين ألف سنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": 2157,
			"text": "حدثنا أبو كريب، محمد بن العلاء ومحمد بن بشار قالا حدثنا وكيع، عن سفيان الثوري، عن زياد بن إسماعيل، عن محمد بن عباد بن جعفر المخزومي، عن أبي هريرة، قال جاء مشركو قريش إلى رسول الله صلى الله عليه وسلم يخاصمون في القدر فنزلت هذه الآية ‏:‏ ‏(‏يوم يسحبون في النار على وجوههم ذوقوا مس سقر * إنا كل شيء خلقناه بقدر ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2298,
			"arabicnumber": 2298,
			"text": "حدثنا قتيبة، حدثنا مروان بن معاوية الفزاري، عن يزيد بن زياد الدمشقي، عن الزهري، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجوز شهادة خائن ولا خائنة ولا مجلود حدا ولا مجلودة ولا ذي غمر لأخيه ولا مجرب شهادة ولا القانع أهل البيت لهم ولا ظنين في ولاء ولا قرابة ‏\"‏ ‏.‏ قال الفزاري القانع التابع ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث يزيد بن زياد الدمشقي ‏.‏ ويزيد يضعف في الحديث ولا يعرف هذا الحديث من حديث الزهري إلا من حديثه ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏ قال ولا نعرف معنى هذا الحديث ولا يصح عندي من قبل إسناده ‏.‏ والعمل عند أهل العلم في هذا أن شهادة القريب جائزة لقرابته ‏.‏ واختلف أهل العلم في شهادة الوالد للولد والولد لوالده ولم يجز أكثر أهل العلم شهادة الوالد للولد ولا الولد للوالد ‏.‏ وقال بعض أهل العلم إذا كان عدلا فشهادة الوالد للولد جائزة وكذلك شهادة الولد للوالد ‏.‏ ولم يختلفوا في شهادة الأخ لأخيه أنها جائزة وكذلك شهادة كل قريب لقريبه ‏.‏ وقال الشافعي لا تجوز شهادة لرجل على الآخر وإن كان عدلا إذا كانت بينهما عداوة ‏.‏ وذهب إلى حديث عبد الرحمن الأعرج عن النبي صلى الله عليه وسلم مرسلا ‏\"‏ لا تجوز شهادة صاحب إحنة ‏\"‏ ‏.‏ يعني صاحب عداوة وكذلك معنى هذا الحديث حيث قال ‏\"‏ لا تجوز شهادة صاحب غمر لأخيه ‏\"‏ يعني صاحب عداوة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 32,
				"hadith": 14
			}
		}
	]
}