{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"36": "Chapters On Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2304,
			"arabicnumber": 2304,
			"text": "حدثنا صالح بن عبد الله، وسويد بن نصر، قال صالح حدثنا وقال، سويد أخبرنا عبد الله بن المبارك، عن عبد الله بن سعيد بن أبي هند، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ نعمتان مغبون فيهما كثير من الناس الصحة والفراغ ‏\"‏ ‏.‏ حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا عبد الله بن سعيد بن أبي هند، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال وفي الباب عن أنس بن مالك ‏.‏ وقال هذا حديث حسن صحيح ‏.‏ ورواه غير واحد عن عبد الله بن سعيد بن أبي هند فرفعوه وأوقفه بعضهم عن عبد الله بن سعيد بن أبي هند ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2305,
			"arabicnumber": 2305,
			"text": "حدثنا بشر بن هلال الصواف البصري، حدثنا جعفر بن سليمان، عن أبي طارق، عن الحسن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يأخذ عني هؤلاء الكلمات فيعمل بهن أو يعلم من يعمل بهن ‏\"‏ ‏.‏ فقال أبو هريرة فقلت أنا يا رسول الله فأخذ بيدي فعد خمسا وقال ‏\"‏ اتق المحارم تكن أعبد الناس وارض بما قسم الله لك تكن أغنى الناس وأحسن إلى جارك تكن مؤمنا وأحب للناس ما تحب لنفسك تكن مسلما ولا تكثر الضحك فإن كثرة الضحك تميت القلب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث جعفر بن سليمان ‏.‏ والحسن لم يسمع من أبي هريرة شيئا هكذا روي عن أيوب ويونس بن عبيد وعلي بن زيد قالوا لم يسمع الحسن من أبي هريرة ‏.‏ وروى أبو عبيدة الناجي عن الحسن هذا الحديث قوله ولم يذكر فيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2306,
			"arabicnumber": 2306,
			"text": "حدثنا أبو مصعب المدني، عن محرر بن هارون، عن عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ بادروا بالأعمال سبعا هل تنظرون إلا فقرا منسيا أو غنى مطغيا أو مرضا مفسدا أو هرما مفندا أو موتا مجهزا أو الدجال فشر غائب ينتظر أو الساعة فالساعة أدهى وأمر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه من حديث الأعرج عن أبي هريرة إلا من حديث محرر بن هارون وقد روى بشر بن عمر وغيره عن محرر بن هارون هذا ‏.‏ وقد روى معمر هذا الحديث عمن سمع سعيدا المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وقال تنتظرون ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2307,
			"arabicnumber": 2307,
			"text": "حدثنا محمود بن غيلان، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أكثروا ذكر هاذم اللذات ‏\"‏ ‏.‏ يعني الموت ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2308,
			"arabicnumber": 2308,
			"text": "حدثنا هناد، حدثنا يحيى بن معين، حدثنا هشام بن يوسف، حدثني عبد الله بن بحير، أنه سمع هانئا، مولى عثمان قال كان عثمان إذا وقف على قبر بكى حتى يبل لحيته فقيل له تذكر الجنة والنار فلا تبكي وتبكي من هذا فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن القبر أول منازل الآخرة فإن نجا منه فما بعده أيسر منه وإن لم ينج منه فما بعده أشد منه ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ ما رأيت منظرا قط إلا والقبر أفظع منه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث هشام بن يوسف ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2309,
			"arabicnumber": 2309,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن قتادة، قال سمعت أنسا، يحدث عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة وأنس وأبي موسى ‏.‏ قال حديث عبادة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2310,
			"arabicnumber": 2310,
			"text": "حدثنا أبو الأشعث، أحمد بن المقدام العجلي حدثنا محمد بن عبد الرحمن الطفاوي، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت لما نزلت هذه الآية ‏:‏ ‏(‏ وأنذر عشيرتك الأقربين ‏)‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يا صفية بنت عبد المطلب يا فاطمة بنت محمد يا بني عبد المطلب إني لا أملك لكم من الله شيئا سلوني من مالي ما شئتم ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأبي موسى وابن عباس ‏.‏ قال حديث عائشة حديث حسن غريب ‏.‏ هكذا روى بعضهم عن هشام بن عروة نحو هذا وروى بعضهم عن هشام عن أبيه عن النبي صلى الله عليه وسلم مرسلا لم يذكر فيه عن عائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2311,
			"arabicnumber": 2311,
			"text": "حدثنا هناد، حدثنا عبد الله بن المبارك، عن عبد الرحمن بن عبد الله المسعودي، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يلج النار رجل بكى من خشية الله حتى يعود اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم ‏\"‏ ‏.‏ قال وفي الباب عن أبي ريحانة وابن عباس ‏.‏ قال هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى آل طلحة وهو مدني ثقة روى عنه شعبة وسفيان الثوري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2312,
			"arabicnumber": 2312,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن إبراهيم بن المهاجر، عن مجاهد، عن مورق، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إني أرى ما لا ترون وأسمع ما لا تسمعون أطت السماء وحق لها أن تئط ما فيها موضع أربع أصابع إلا وملك واضع جبهته ساجدا لله لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا وما تلذذتم بالنساء على الفرش ولخرجتم إلى الصعدات تجأرون إلى الله ‏\"‏ ‏.‏ لوددت أني كنت شجرة تعضد ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة وابن عباس وأنس ‏.‏ قال هذا حديث حسن غريب ‏.‏ ويروى من غير هذا الوجه أن أبا ذر قال لوددت أني كنت شجرة تعضد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2313,
			"arabicnumber": 2313,
			"text": "حدثنا أبو حفص، عمرو بن علي الفلاس حدثنا عبد الوهاب الثقفي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2314,
			"arabicnumber": 2314,
			"text": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن محمد بن إسحاق، حدثني محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الرجل ليتكلم بالكلمة لا يرى بها بأسا يهوي بها سبعين خريفا في النار ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2315,
			"arabicnumber": 2315,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا بهز بن حكيم، حدثني أبي، عن جدي، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ ويل للذي يحدث بالحديث ليضحك به القوم فيكذب ويل له ويل له ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2316,
			"arabicnumber": 2316,
			"text": "حدثنا سليمان بن عبد الجبار البغدادي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الأعمش، عن أنس بن مالك، قال توفي رجل من أصحابه فقال يعني رجل أبشر بالجنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أولا تدري فلعله تكلم فيما لا يعنيه أو بخل بما لا ينقصه ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2317,
			"arabicnumber": 2317,
			"text": "حدثنا أحمد بن نصر النيسابوري، وغير، واحد، قالوا حدثنا أبو مسهر، عن إسماعيل بن عبد الله بن سماعة، عن الأوزاعي، عن قرة، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من حسن إسلام المرء تركه ما لا يعنيه ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه من حديث أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2318,
			"arabicnumber": 2318,
			"text": "حدثنا قتيبة، حدثنا مالك بن أنس، عن الزهري، عن علي بن حسين، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن من حسن إسلام المرء تركه ما لا يعنيه ‏\"‏ ‏.‏ قال أبو عيسى وهكذا روى غير واحد من أصحاب الزهري عن الزهري عن علي بن حسين عن النبي صلى الله عليه وسلم نحو حديث مالك مرسلا وهذا عندنا أصح من حديث أبي سلمة عن أبي هريرة ‏.‏ وعلي بن حسين لم يدرك علي بن أبي طالب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2319,
			"arabicnumber": 2319,
			"text": "حدثنا هناد، حدثنا عبدة، عن محمد بن عمرو، حدثني أبي، عن جدي، قال سمعت بلال بن الحارث المزني، صاحب رسول الله صلى الله عليه وسلم يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن أحدكم ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيكتب الله له بها رضوانه إلى يوم يلقاه وإن أحدكم ليتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيكتب الله عليه بها سخطه إلى يوم يلقاه ‏\"‏ ‏.‏ قال وفي الباب عن أم حبيبة ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وهكذا رواه غير واحد عن محمد بن عمرو نحو هذا قالوا عن محمد بن عمرو عن أبيه عن جده عن بلال بن الحارث ‏.‏ وروى هذا الحديث مالك عن محمد بن عمرو عن أبيه عن بلال بن الحارث ولم يذكر فيه عن جده ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2320,
			"arabicnumber": 2320,
			"text": "حدثنا قتيبة، حدثنا عبد الحميد بن سليمان، عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو كانت الدنيا تعدل عند الله جناح بعوضة ما سقى كافرا منها شربة ماء ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2321,
			"arabicnumber": 2321,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن مجالد، عن قيس بن أبي حازم، عن المستورد بن شداد، قال كنت مع الركب الذين وقفوا مع رسول الله صلى الله عليه وسلم على السخلة الميتة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أترون هذه هانت على أهلها حين ألقوها ‏\"‏ ‏.‏ قالوا من هوانها ألقوها يا رسول الله ‏.‏ قال ‏\"‏ فالدنيا أهون على الله من هذه على أهلها ‏\"‏ ‏.‏ وفي الباب عن جابر وابن عمر ‏.‏ قال أبو عيسى حديث المستورد حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2322,
			"arabicnumber": 2322,
			"text": "حدثنا محمد بن حاتم المكتب، حدثنا علي بن ثابت، حدثنا عبد الرحمن بن ثابت بن ثوبان، قال سمعت عطاء بن قرة، قال سمعت عبد الله بن ضمرة، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ألا إن الدنيا ملعونة ملعون ما فيها إلا ذكر الله وما والاه وعالما أو متعلما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2323,
			"arabicnumber": 2323,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، قال سمعت مستوردا، أخا بني فهر قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما الدنيا في الآخرة إلا مثل ما يجعل أحدكم إصبعه في اليم فلينظر بماذا يرجع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإسماعيل بن أبي خالد يكنى أبا عبد الله ووالد قيس أبو حازم اسمه عبد بن عوف وهو من الصحابة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2324,
			"arabicnumber": 2324,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الدنيا سجن المؤمن وجنة الكافر ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2325,
			"arabicnumber": 2325,
			"text": "حدثنا محمد بن إسماعيل، حدثنا أبو نعيم، حدثنا عبادة بن مسلم، حدثنا يونس بن خباب، عن سعيد الطائي أبي البختري، أنه قال حدثني أبو كبشة الأنماري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ثلاثة أقسم عليهن وأحدثكم حديثا فاحفظوه ‏\"‏ ‏.‏ قال ‏\"‏ ما نقص مال عبد من صدقة ولا ظلم عبد مظلمة فصبر عليها إلا زاده الله عزا ولا فتح عبد باب مسألة إلا فتح الله عليه باب فقر أو كلمة نحوها وأحدثكم حديثا فاحفظوه قال ‏\"‏ إنما الدنيا لأربعة نفر عبد رزقه الله مالا وعلما فهو يتقي فيه ربه ويصل فيه رحمه ويعلم لله فيه حقا فهذا بأفضل المنازل وعبد رزقه الله علما ولم يرزقه مالا فهو صادق النية يقول لو أن لي مالا لعملت بعمل فلان فهو بنيته فأجرهما سواء وعبد رزقه الله مالا ولم يرزقه علما فهو يخبط في ماله بغير علم لا يتقي فيه ربه ولا يصل فيه رحمه ولا يعلم لله فيه حقا فهذا بأخبث المنازل وعبد لم يرزقه الله مالا ولا علما فهو يقول لو أن لي مالا لعملت فيه بعمل فلان فهو بنيته فوزرهما سواء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2326,
			"arabicnumber": 2326,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن بشير أبي إسماعيل، عن سيار، عن طارق بن شهاب، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من نزلت به فاقة فأنزلها بالناس لم تسد فاقته ومن نزلت به فاقة فأنزلها بالله فيوشك الله له برزق عاجل أو آجل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2327,
			"arabicnumber": 2327,
			"text": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان، عن منصور، والأعمش، عن أبي وائل، قال جاء معاوية إلى أبي هاشم بن عتبة وهو مريض يعوده فقال يا خال ما يبكيك أوجع يشئزك أم حرص على الدنيا قال كل لا ولكن رسول الله صلى الله عليه وسلم عهد إلى عهدا لم آخذ به قال ‏ \"‏ إنما يكفيك من جمع المال خادم ومركب في سبيل الله ‏\"‏ ‏.‏ وأجدني اليوم قد جمعت ‏.‏ قال أبو عيسى وقد روى زائدة وعبيدة بن حميد عن منصور عن أبي وائل عن سمرة بن سهم قال دخل معاوية على أبي هاشم فذكر نحوه ‏.‏ وفي الباب عن بريدة الأسلمي عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2328,
			"arabicnumber": 2328,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن الأعمش، عن شمر بن عطية، عن المغيرة بن سعد بن الأخرم، عن أبيه، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تتخذوا الضيعة فترغبوا في الدنيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2329,
			"arabicnumber": 2329,
			"text": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن معاوية بن صالح، عن عمرو بن قيس، عن عبد الله بن بسر، أن أعرابيا، قال يا رسول الله من خير الناس قال ‏ \"‏ من طال عمره وحسن عمله ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وجابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2330,
			"arabicnumber": 2330,
			"text": "حدثنا أبو حفص، عمرو بن علي حدثنا خالد بن الحارث، حدثنا شعبة، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، قال يا رسول الله أى الناس خير قال ‏\"‏ من طال عمره وحسن عمله ‏\"‏ ‏.‏ قال فأى الناس شر قال ‏\"‏ من طال عمره وساء عمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2331,
			"arabicnumber": 2331,
			"text": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا محمد بن ربيعة، عن كامل أبي العلاء، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ عمر أمتي من ستين سنة إلى سبعين سنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي صالح عن أبي هريرة وقد روي من غير وجه عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2332,
			"arabicnumber": 2332,
			"text": "حدثنا عباس بن محمد الدوري، حدثنا خالد بن مخلد، حدثنا عبد الله بن عمر العمري، عن سعد بن سعيد الأنصاري، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تقوم الساعة حتى يتقارب الزمان فتكون السنة كالشهر والشهر كالجمعة وتكون الجمعة كاليوم ويكون اليوم كالساعة وتكون الساعة كالضرمة بالنار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وسعد بن سعيد هو أخو يحيى بن سعيد الأنصاري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2333,
			"arabicnumber": 2333,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن ليث، عن مجاهد، عن ابن عمر، قال أخذ رسول الله صلى الله عليه وسلم بمنكبي فقال ‏\"‏ كن في الدنيا كأنك غريب أو عابر سبيل وعد نفسك في أهل القبور ‏\"‏ ‏.‏ فقال لي ابن عمر إذا أصبحت فلا تحدث نفسك بالمساء وإذا أمسيت فلا تحدث نفسك بالصباح وخذ من صحتك قبل سقمك ومن حياتك قبل موتك فإنك لا تدري يا عبد الله ما اسمك غدا ‏\"‏ ‏.‏ قال أبو عيسى وقد روى هذا الحديث الأعمش عن مجاهد عن ابن عمر نحوه ‏.‏ حدثنا أحمد بن عبدة الضبي البصري، حدثنا حماد بن زيد، عن ليث، عن مجاهد، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2334,
			"arabicnumber": 2334,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن حماد بن سلمة، عن عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا ابن آدم وهذا أجله ‏\"‏ ‏.‏ ووضع يده عند قفاه ثم بسطها فقال ‏\"‏ وثم أمله وثم أمله وثم أمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي سعيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2335,
			"arabicnumber": 2335,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن أبي السفر، عن عبد الله بن عمرو، قال مر علينا رسول الله صلى الله عليه وسلم ونحن نعالج خصا لنا فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ فقلنا قد وهى فنحن نصلحه ‏.‏ قال ‏\"‏ ما أرى الأمر إلا أعجل من ذلك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو السفر اسمه سعيد بن يحمد ويقال ابن أحمد الثوري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2336,
			"arabicnumber": 2336,
			"text": "حدثنا أحمد بن منيع، حدثنا الحسن بن سوار، حدثنا ليث بن سعد، عن معاوية بن صالح، أن عبد الرحمن بن جبير بن نفير، حدثه عن أبيه، عن كعب بن عياض، قال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ إن لكل أمة فتنة وفتنة أمتي المال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب إنما نعرفه من حديث معاوية بن صالح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2337,
			"arabicnumber": 2337,
			"text": "حدثنا عبد الله بن أبي زياد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح بن كيسان، عن ابن شهاب، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو كان لابن آدم واديا من ذهب لأحب أن يكون له ثانيا ولا يملأ فاه إلا التراب ويتوب الله على من تاب ‏\"‏ ‏.‏ وفي الباب عن أبى بن كعب وأبي سعيد وعائشة وابن الزبير وأبي واقد وجابر وابن عباس وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2338,
			"arabicnumber": 2338,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ قلب الشيخ شاب على حب اثنتين طول الحياة وكثرة المال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2339,
			"arabicnumber": 2339,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن قتادة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يهرم ابن آدم ويشب منه اثنتان الحرص على العمر والحرص على المال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2340,
			"arabicnumber": 2340,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن المبارك، حدثنا عمرو بن واقد، حدثنا يونس بن حلبس، عن أبي إدريس الخولاني، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الزهادة في الدنيا ليست بتحريم الحلال ولا إضاعة المال ولكن الزهادة في الدنيا أن لا تكون بما في يديك أوثق مما في يدى الله وأن تكون في ثواب المصيبة إذا أنت أصبت بها أرغب فيها لو أنها أبقيت لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأبو إدريس الخولاني اسمه عائذ الله بن عبد الله ‏.‏ وعمرو بن واقد منكر الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2341,
			"arabicnumber": 2341,
			"text": "حدثنا عبد بن حميد، حدثنا عبد الصمد بن عبد الوارث، حدثنا حريث بن السائب، قال سمعت الحسن، يقول حدثني حمران بن أبان، عن عثمان بن عفان، أن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس لابن آدم حق في سوى هذه الخصال بيت يسكنه وثوب يواري عورته وجلف الخبز والماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو حديث الحريث بن السائب ‏.‏ وسمعت أبا داود سليمان بن سلم البلخي يقول قال النضر بن شميل جلف الخبز يعني ليس معه إدام ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2342,
			"arabicnumber": 2342,
			"text": "حدثنا محمود بن غيلان، حدثنا وهب بن جرير، حدثنا شعبة، عن قتادة، عن مطرف، عن أبيه، أنه انتهى إلى النبي صلى الله عليه وسلم وهو يقول ‏:‏ ‏(‏ألهاكم التكاثر ‏)‏ قال ‏\"‏ يقول ابن آدم مالي مالي وهل لك من مالك إلا ما تصدقت فأمضيت أو أكلت فأفنيت أو لبست فأبليت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2343,
			"arabicnumber": 2343,
			"text": "حدثنا محمد بن بشار، حدثنا عمر بن يونس، - هو اليمامي حدثنا عكرمة بن عمار، حدثنا شداد بن عبد الله، قال سمعت أبا أمامة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا ابن آدم إنك إن تبذل الفضل خير لك وإن تمسكه شر لك ولا تلام على كفاف وابدأ بمن تعول واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وشداد بن عبد الله يكنى أبا عمار ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2344,
			"arabicnumber": 2344,
			"text": "حدثنا علي بن سعيد الكندي، حدثنا ابن المبارك، عن حيوة بن شريح، عن بكر بن عمرو، عن عبد الله بن هبيرة، عن أبي تميم الجيشاني، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو أنكم كنتم توكلون على الله حق توكله لرزقتم كما ترزق الطير تغدو خماصا وتروح بطانا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من هذا الوجه ‏.‏ وأبو تميم الجيشاني اسمه عبد الله بن مالك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2345,
			"arabicnumber": 2345,
			"text": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا حماد بن سلمة، عن ثابت، عن أنس بن مالك، قال كان أخوان على عهد النبي صلى الله عليه وسلم فكان أحدهما يأتي النبي صلى الله عليه وسلم والآخر يحترف فشكا المحترف أخاه إلى النبي صلى الله عليه وسلم فقال ‏ \"‏ لعلك ترزق به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2346,
			"arabicnumber": 2346,
			"text": "حدثنا عمرو بن مالك ومحمود بن خداش البغدادي قالا حدثنا مروان بن معاوية حدثنا عبد الرحمن بن أبي شميلة الأنصاري عن سلمة بن عبيد الله بن محصن الخطمي عن أبيه وكانت له صحبة قال قال رسول الله صلى الله عليه وسلم من أصبح منكم آمنا في سربه معافى في جسده عنده قوت يومه فكأنما حيزت له الدنيا قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث مروان بن معاوية وحيزت جمعت حدثنا بذلك محمد بن إسمعيل حدثنا الحميدي حدثنا مروان بن معاوية نحوه وفي الباب عن أبي الدرداء",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2347,
			"arabicnumber": 2347,
			"text": "أخبرنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم أبي عبد الرحمن، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أغبط أوليائي عندي لمؤمن خفيف الحاذ ذو حظ من الصلاة أحسن عبادة ربه وأطاعه في السر وكان غامضا في الناس لا يشار إليه بالأصابع وكان رزقه كفافا فصبر على ذلك ‏\"‏ ‏.‏ ثم نفض بيده فقال ‏\"‏ عجلت منيته قلت بواكيه قل تراثه ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ عرض على ربي ليجعل لي بطحاء مكة ذهبا قلت لا يا رب ولكن أشبع يوما وأجوع يوما أو قال ثلاثا أو نحو هذا فإذا جعت تضرعت إليك وذكرتك وإذا شبعت شكرتك وحمدتك ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وفي الباب عن فضالة بن عبيد ‏.‏ والقاسم هذا هو ابن عبد الرحمن ويكنى أبا عبد الرحمن وهو مولى عبد الرحمن بن خالد بن يزيد بن معاوية وهو شامي ثقة وعلي بن يزيد ضعيف الحديث ويكنى أبا عبد الملك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2348,
			"arabicnumber": 2348,
			"text": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، عن شرحبيل بن شريك، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قد أفلح من أسلم وكان رزقه كفافا وقنعه الله ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2349,
			"arabicnumber": 2349,
			"text": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، أخبرنا حيوة بن شريح، أخبرني أبو هانئ الخولاني، أن أبا علي، عمرو بن مالك الجنبي أخبره عن فضالة بن عبيد، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ طوبى لمن هدي إلى الإسلام وكان عيشه كفافا وقنع ‏\"‏ ‏.‏ قال وأبو هانئ اسمه حميد بن هانئ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2350,
			"arabicnumber": 2350,
			"text": "حدثنا محمد بن عمرو بن نبهان بن صفوان الثقفي البصري، حدثنا روح بن أسلم، حدثنا شداد أبو طلحة الراسبي، عن أبي الوازع، عن عبد الله بن مغفل، قال قال رجل للنبي صلى الله عليه وسلم يا رسول الله والله إني لأحبك ‏.‏ فقال ‏\"‏ انظر ماذا تقول ‏\"‏ ‏.‏ قال والله إني لأحبك ‏.‏ فقال ‏\"‏ انظر ماذا تقول ‏\"‏ ‏.‏ قال والله إني لأحبك ‏.‏ ثلاث مرات فقال ‏\"‏ إن كنت تحبني فأعد للفقر تجفافا فإن الفقر أسرع إلى من يحبني من السيل إلى منتهاه ‏\"‏ ‏.‏ حدثنا نصر بن علي، حدثنا أبي، عن شداد أبي طلحة، نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو الوازع الراسبي اسمه جابر بن عمرو وهو بصري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2351,
			"arabicnumber": 2351,
			"text": "حدثنا محمد بن موسى البصري، حدثنا زياد بن عبد الله، عن الأعمش، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ فقراء المهاجرين يدخلون الجنة قبل أغنيائهم بخمسمائة سنة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وعبد الله بن عمرو وجابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2352,
			"arabicnumber": 2352,
			"text": "حدثنا عبد الأعلى بن واصل الكوفي، حدثنا ثابت بن محمد العابد الكوفي، حدثنا الحارث بن النعمان الليثي، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم أحيني مسكينا وأمتني مسكينا واحشرني في زمرة المساكين يوم القيامة ‏\"‏ ‏.‏ فقالت عائشة لم يا رسول الله قال ‏\"‏ إنهم يدخلون الجنة قبل أغنيائهم بأربعين خريفا يا عائشة لا تردي المسكين ولو بشق تمرة يا عائشة أحبي المساكين وقربيهم فإن الله يقربك يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2353,
			"arabicnumber": 2353,
			"text": "حدثنا محمود بن غيلان، حدثنا قبيصة، حدثنا سفيان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يدخل الفقراء الجنة قبل الأغنياء بخمسمائة عام نصف يوم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2354,
			"arabicnumber": 2354,
			"text": "حدثنا أبو كريب، حدثنا المحاربي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يدخل فقراء المسلمين الجنة قبل أغنيائهم بنصف يوم وهو خمسمائة عام ‏\"‏ ‏.‏ وهذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2355,
			"arabicnumber": 2355,
			"text": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، عن عمرو بن جابر الحضرمي، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يدخل فقراء المسلمين الجنة قبل أغنيائهم بأربعين خريفا ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2356,
			"arabicnumber": 2356,
			"text": "حدثنا أحمد بن منيع، حدثنا عباد بن عباد المهلبي، عن مجالد، عن الشعبي، عن مسروق، قال دخلت على عائشة فدعت لي بطعام وقالت ما أشبع من طعام فأشاء أن أبكي إلا بكيت ‏.‏ قال قلت لم قالت أذكر الحال التي فارق عليها رسول الله صلى الله عليه وسلم الدنيا والله ما شبع من خبز ولحم مرتين في يوم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2357,
			"arabicnumber": 2357,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن أبي إسحاق، قال سمعت عبد الرحمن بن يزيد، يحدث عن الأسود بن يزيد، عن عائشة، قالت ما شبع رسول الله صلى الله عليه وسلم من خبز شعير يومين متتابعين حتى قبض ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2358,
			"arabicnumber": 2358,
			"text": "حدثنا أبو كريب، محمد بن العلاء حدثنا المحاربي، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال ما شبع رسول الله صلى الله عليه وسلم وأهله ثلاثا تباعا من خبز البر حتى فارق الدنيا ‏.‏ هذا حديث صحيح حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2359,
			"arabicnumber": 2359,
			"text": "حدثنا عباس بن محمد الدوري، حدثنا يحيى بن أبي بكير، حدثنا حريز بن عثمان، عن سليم بن عامر، قال سمعت أبا أمامة، يقول ما كان يفضل عن أهل، بيت النبي صلى الله عليه وسلم خبز الشعير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ ويحيى بن أبي بكير هذا كوفي وأبو بكير والد يحيى روى له سفيان الثوري ويحيى بن عبد الله بن بكير مصري صاحب الليث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2360,
			"arabicnumber": 2360,
			"text": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يبيت الليالي المتتابعة طاويا وأهله لا يجدون عشاء وكان أكثر خبزهم خبز الشعير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2361,
			"arabicnumber": 2361,
			"text": "حدثنا أبو عمار، حدثنا وكيع، عن الأعمش، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2362,
			"arabicnumber": 2362,
			"text": "حدثنا قتيبة، حدثنا جعفر بن سليمان، عن ثابت، عن أنس، قال كان النبي صلى الله عليه وسلم لا يدخر شيئا لغد ‏.‏ قال أبو عيسى هذا حديث غريب وقد روي هذا الحديث عن جعفر بن سليمان عن ثابت عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2363,
			"arabicnumber": 2363,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا أبو معمر عبد الله بن عمرو، حدثنا عبد الوارث، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، قال ما أكل رسول الله صلى الله عليه وسلم على خوان ولا أكل خبزا مرققا حتى مات ‏.‏ قال هذا حديث حسن صحيح غريب من حديث سعيد بن أبي عروبة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2364,
			"arabicnumber": 2364,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبيد الله بن عبد المجيد الحنفي، حدثنا عبد الرحمن بن عبد الله بن دينار، أخبرنا أبو حازم، عن سهل بن سعد، أنه قيل له أكل رسول الله صلى الله عليه وسلم النقي يعني الحوارى فقال سهل ما رأى رسول الله صلى الله عليه وسلم النقي حتى لقي الله ‏.‏ فقيل له هل كانت لكم مناخل على عهد رسول الله صلى الله عليه وسلم قال ما كانت لنا مناخل ‏.‏ قيل فكيف كنتم تصنعون بالشعير قال كنا ننفخه فيطير منه ما طار ثم نثريه فنعجنه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه مالك بن أنس عن أبي حازم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2365,
			"arabicnumber": 2365,
			"text": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثنا أبي، عن بيان، عن قيس بن أبي حازم، قال سمعت سعد بن أبي وقاص، يقول إني لأول رجل أهراق دما في سبيل الله وإني لأول رجل رمى بسهم في سبيل الله ولقد رأيتني أغزو في العصابة من أصحاب محمد صلى الله عليه وسلم ما نأكل إلا ورق الشجر والحبلة حتى إن أحدنا ليضع كما تضع الشاة أو البعير وأصبحت بنو أسد يعزروني في الدين لقد خبت إذا وضل عملي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث بيان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2366,
			"arabicnumber": 2366,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا إسماعيل بن أبي خالد، حدثنا قيس، قال سمعت سعد بن مالك، يقول إني أول رجل من العرب رمى بسهم في سبيل الله ولقد رأيتنا نغزو مع رسول الله صلى الله عليه وسلم وما لنا طعام إلا الحبلة وهذا السمر حتى إن أحدنا ليضع كما تضع الشاة ثم أصبحت بنو أسد يعزروني في الدين لقد خبت إذا وضل عملي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن عتبة بن غزوان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2367,
			"arabicnumber": 2367,
			"text": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن محمد بن سيرين، قال كنا عند أبي هريرة وعليه ثوبان ممشقان من كتان فتمخط في أحدهما ثم قال بخ بخ يتمخط أبو هريرة في الكتان لقد رأيتني وإني لأخر فيما بين منبر رسول الله صلى الله عليه وسلم وحجرة عائشة من الجوع مغشيا على فيجيء الجائي فيضع رجله على عنقي يرى أن بي الجنون وما بي جنون وما هو إلا الجوع ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏ من هذا الوجه",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2368,
			"arabicnumber": 2368,
			"text": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد، حدثنا حيوة بن شريح، أخبرني أبو هانئ الخولاني، أن أبا علي، عمرو بن مالك الجنبي أخبره عن فضالة بن عبيد، أن رسول الله صلى الله عليه وسلم كان إذا صلى بالناس يخر رجال من قامتهم في الصلاة من الخصاصة وهم أصحاب الصفة حتى تقول الأعراب هؤلاء مجانين أو مجانون فإذا صلى رسول الله صلى الله عليه وسلم انصرف إليهم فقال ‏ \"‏ لو تعلمون ما لكم عند الله لأحببتم أن تزدادوا فاقة وحاجة ‏\"‏ ‏.‏ قال فضالة وأنا يومئذ مع رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2369,
			"arabicnumber": 2369,
			"text": "حدثنا محمد بن إسماعيل، حدثنا آدم بن أبي إياس، حدثنا شيبان أبو معاوية، حدثنا عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال خرج النبي صلى الله عليه وسلم في ساعة لا يخرج فيها ولا يلقاه فيها أحد فأتاه أبو بكر فقال ‏\"‏ ما جاء بك يا أبا بكر ‏\"‏ ‏.‏ فقال خرجت ألقى رسول الله صلى الله عليه وسلم وأنظر في وجهه والتسليم عليه ‏.‏ فلم يلبث أن جاء عمر فقال ‏\"‏ ما جاء بك يا عمر ‏\"‏ ‏.‏ قال الجوع يا رسول الله قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأنا قد وجدت بعض ذلك ‏\"‏ ‏.‏ فانطلقوا إلى منزل أبي الهيثم بن التيهان الأنصاري وكان رجلا كثير النخل والشاء ولم يكن له خدم فلم يجدوه فقالوا لامرأته أين صاحبك فقالت انطلق يستعذب لنا الماء ‏.‏ فلم يلبثوا أن جاء أبو الهيثم بقربة يزعبها فوضعها ثم جاء يلتزم النبي صلى الله عليه وسلم ويفديه بأبيه وأمه ثم انطلق بهم إلى حديقته فبسط لهم بساطا ثم انطلق إلى نخلة فجاء بقنو فوضعه فقال النبي صلى الله عليه وسلم ‏\"‏ أفلا تنقيت لنا من رطبه ‏\"‏ ‏.‏ فقال يا رسول الله إني أردت أن تختاروا أو قال تخيروا من رطبه وبسره ‏.‏ فأكلوا وشربوا من ذلك الماء فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا والذي نفسي بيده من النعيم الذي تسألون عنه يوم القيامة ظل بارد ورطب طيب وماء بارد ‏\"‏ ‏.‏ فانطلق أبو الهيثم ليصنع لهم طعاما فقال النبي صلى الله عليه وسلم ‏\"‏ لا تذبحن ذات در ‏\"‏ ‏.‏ قال فذبح لهم عناقا أو جديا فأتاهم بها فأكلوا فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك خادم ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أتانا سبى فائتنا ‏\"‏ ‏.‏ فأتي النبي صلى الله عليه وسلم برأسين ليس معهما ثالث فأتاه أبو الهيثم فقال النبي صلى الله عليه وسلم ‏\"‏ اختر منهما ‏\"‏ ‏.‏ فقال يا نبي الله اختر لي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن المستشار مؤتمن خذ هذا فإني رأيته يصلي واستوص به معروفا ‏\"‏ ‏.‏ فانطلق أبو الهيثم إلى امرأته فأخبرها بقول رسول الله صلى الله عليه وسلم فقالت امرأته ما أنت ببالغ ما قال فيه النبي صلى الله عليه وسلم إلا أن تعتقه قال فهو عتيق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله لم يبعث نبيا ولا خليفة إلا وله بطانتان بطانة تأمره بالمعروف وتنهاه عن المنكر وبطانة لا تألوه خبالا ومن يوق بطانة السوء فقد وقي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2370,
			"arabicnumber": 2370,
			"text": "حدثنا صالح بن عبد الله، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، أن رسول الله صلى الله عليه وسلم خرج يوما وأبو بكر وعمر فذكر نحو هذا الحديث ولم يذكر فيه عن أبي هريرة وحديث شيبان أتم من حديث أبي عوانة وأطول ‏.‏ وشيبان ثقة عندهم صاحب كتاب ‏.‏ وقد روي عن أبي هريرة هذا الحديث من غير هذا الوجه وروي عن ابن عباس أيضا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2371,
			"arabicnumber": 2371,
			"text": "حدثنا عبد الله بن أبي زياد، حدثنا سيار بن حاتم، عن سهل بن أسلم، عن يزيد بن أبي منصور، عن أنس بن مالك، عن أبي طلحة، قال شكونا إلى رسول الله صلى الله عليه وسلم الجوع ورفعنا عن بطوننا عن حجر حجر فرفع رسول الله صلى الله عليه وسلم عن حجرين ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2372,
			"arabicnumber": 2372,
			"text": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، قال سمعت النعمان بن بشير، يقول ألستم في طعام وشراب ما شئتم لقد رأيت نبيكم صلى الله عليه وسلم وما يجد من الدقل ما يملأ بطنه ‏.‏ قال وهذا حديث صحيح ‏.‏ قال أبو عيسى وروى أبو عوانة وغير واحد عن سماك بن حرب نحو حديث أبي الأحوص ‏.‏ وروى شعبة هذا الحديث عن سماك عن النعمان بن بشير عن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2373,
			"arabicnumber": 2373,
			"text": "حدثنا أحمد بن بديل بن قريش اليامي الكوفي، حدثنا أبو بكر بن عياش، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس الغنى عن كثرة العرض ولكن الغنى غنى النفس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حصين اسمه عثمان بن عاصم الأسدي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2374,
			"arabicnumber": 2374,
			"text": "حدثنا قتيبة، حدثنا الليث، عن سعيد المقبري، عن أبي الوليد، قال سمعت خولة بنت قيس، وكانت، تحت حمزة بن عبد المطلب تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن هذا المال خضرة حلوة من أصابه بحقه بورك له فيه ورب متخوض فيما شاءت به نفسه من مال الله ورسوله ليس له يوم القيامة إلا النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو الوليد اسمه عبيد سنوطى",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2375,
			"arabicnumber": 2375,
			"text": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، عن يونس، عن الحسن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لعن عبد الدينار لعن عبد الدرهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث من غير هذا الوجه عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم أيضا أتم من هذا وأطول ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2376,
			"arabicnumber": 2376,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن زكريا بن أبي زائدة، عن محمد بن عبد الرحمن بن سعد بن زرارة، عن ابن كعب بن مالك الأنصاري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما ذئبان جائعان أرسلا في غنم بأفسد لها من حرص المرء على المال والشرف لدينه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ويروى في هذا الباب عن ابن عمر عن النبي صلى الله عليه وسلم ولا يصح إسناده ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2377,
			"arabicnumber": 2377,
			"text": "حدثنا موسى بن عبد الرحمن الكندي، حدثنا زيد بن حباب، أخبرني المسعودي، حدثنا عمرو بن مرة، عن إبراهيم، عن علقمة، عن عبد الله، قال نام رسول الله صلى الله عليه وسلم على حصير فقام وقد أثر في جنبه فقلنا يا رسول الله لو اتخذنا لك وطاء ‏.‏ فقال ‏ \"‏ ما لي وما للدنيا ما أنا في الدنيا إلا كراكب استظل تحت شجرة ثم راح وتركها ‏\"‏ ‏.‏ قال وفي الباب عن عمر وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2378,
			"arabicnumber": 2378,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا زهير بن محمد، حدثني موسى بن وردان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الرجل على دين خليله فلينظر أحدكم من يخالل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2379,
			"arabicnumber": 2379,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن سفيان بن عيينة، عن عبد الله بن أبي بكر، هو ابن محمد بن عمرو بن حزم الأنصاري قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ يتبع الميت ثلاث فيرجع اثنان ويبقى واحد يتبعه أهله وماله وعمله فيرجع أهله وماله ويبقى عمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2380,
			"arabicnumber": 2380,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا إسماعيل بن عياش، حدثني أبو سلمة الحمصي، وحبيب بن صالح، عن يحيى بن جابر الطائي، عن مقدام بن معديكرب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما ملأ آدمي وعاء شرا من بطن بحسب ابن آدم أكلات يقمن صلبه فإن كان لا محالة فثلث لطعامه وثلث لشرابه وثلث لنفسه ‏\"‏ ‏.‏ حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، نحوه ‏.‏ وقال المقدام بن معديكرب عن النبي صلى الله عليه وسلم ولم يذكر فيه سمعت النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2381,
			"arabicnumber": 2381,
			"text": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن شيبان، عن فراس، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرائي يرائي الله به ومن يسمع يسمع الله به ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ من لا يرحم الناس لا يرحمه الله ‏\"‏ ‏.‏ وفي الباب عن جندب وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2382,
			"arabicnumber": 2382,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا حيوة بن شريح، أخبرني الوليد بن أبي الوليد أبو عثمان المدني، أن عقبة بن مسلم، حدثه أن شفيا الأصبحي حدثه أنه، دخل المدينة فإذا هو برجل قد اجتمع عليه الناس فقال من هذا فقالوا أبو هريرة ‏.‏ فدنوت منه حتى قعدت بين يديه وهو يحدث الناس فلما سكت وخلا قلت له أنشدك بحق وبحق لما حدثتني حديثا سمعته من رسول الله صلى الله عليه وسلم عقلته وعلمته ‏.‏ فقال أبو هريرة أفعل لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم عقلته وعلمته ‏.‏ ثم نشغ أبو هريرة نشغة فمكث قليلا ثم أفاق فقال لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم في هذا البيت ما معنا أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة أخرى ثم أفاق فمسح وجهه فقال لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم وأنا وهو في هذا البيت ما معنا أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة أخرى ثم أفاق ومسح وجهه فقال أفعل لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم وأنا معه في هذا البيت ما معه أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة شديدة ثم مال خارا على وجهه فأسندته على طويلا ثم أفاق فقال حدثني رسول الله صلى الله عليه وسلم أن الله تبارك وتعالى إذا كان يوم القيامة ينزل إلى العباد ليقضي بينهم وكل أمة جاثية فأول من يدعو به رجل جمع القرآن ورجل قتل في سبيل الله ورجل كثير المال فيقول الله للقارئ ألم أعلمك ما أنزلت على رسولي قال بلى يا رب ‏.‏ قال فماذا عملت فيما علمت قال كنت أقوم به آناء الليل وآناء النهار ‏.‏ فيقول الله له كذبت وتقول له الملائكة كذبت ويقول الله له بل أردت أن يقال إن فلانا قارئ فقد قيل ذاك ‏.‏ ويؤتى بصاحب المال فيقول الله له ألم أوسع عليك حتى لم أدعك تحتاج إلى أحد قال بلى يا رب ‏.‏ قال فماذا عملت فيما آتيتك قال كنت أصل الرحم وأتصدق ‏.‏ فيقول الله له كذبت وتقول له الملائكة كذبت ويقول الله تعالى بل أردت أن يقال فلان جواد فقد قيل ذاك ‏.‏ ويؤتى بالذي قتل في سبيل الله فيقول الله له في ماذا قتلت فيقول أمرت بالجهاد في سبيلك فقاتلت حتى قتلت ‏.‏ فيقول الله تعالى له كذبت وتقول له الملائكة كذبت ويقول الله بل أردت أن يقال فلان جريء فقد قيل ذاك ‏\"‏ ‏.‏ ثم ضرب رسول الله صلى الله عليه وسلم على ركبتي فقال ‏\"‏ يا أبا هريرة أولئك الثلاثة أول خلق الله تسعر بهم النار يوم القيامة ‏\"‏ ‏.‏ وقال الوليد أبو عثمان فأخبرني عقبة بن مسلم أن شفيا هو الذي دخل على معاوية فأخبره بهذا ‏.‏ قال أبو عثمان وحدثني العلاء بن أبي حكيم أنه كان سيافا لمعاوية فدخل عليه رجل فأخبره بهذا عن أبي هريرة فقال معاوية قد فعل بهؤلاء هذا فكيف بمن بقي من الناس ثم بكى معاوية بكاء شديدا حتى ظننا أنه هالك وقلنا قد جاءنا هذا الرجل بشر ثم أفاق معاوية ومسح عن وجهه وقال صدق الله ورسوله ‏:‏ ‏(‏من كان يريد الحياة الدنيا وزينتها نوف إليهم أعمالهم فيها وهم فيها لا يبخسون * أولئك الذين ليس لهم في الآخرة إلا النار وحبط ما صنعوا فيها وباطل ما كانوا يعملون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2383,
			"arabicnumber": 2383,
			"text": "حدثنا أبو كريب، حدثني المحاربي، عن عمار بن سيف الضبي، عن أبي معان البصري، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعوذوا بالله من جب الحزن ‏\"‏ ‏.‏ قالوا يا رسول الله وما جب الحزن قال ‏\"‏ واد في جهنم تتعوذ منه جهنم كل يوم مائة مرة ‏\"‏ ‏.‏ قلنا يا رسول الله ومن يدخله قال ‏\"‏ القراء المراءون بأعمالهم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2384,
			"arabicnumber": 2384,
			"text": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا أبو سنان الشيباني، عن حبيب بن أبي ثابت، عن أبي صالح، عن أبي هريرة، قال قال رجل يا رسول الله الرجل يعمل العمل فيسره فإذا اطلع عليه أعجبه ذلك قال رسول الله صلى الله عليه وسلم ‏\"‏ له أجران أجر السر وأجر العلانية ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد رواه الأعمش وغيره عن حبيب بن أبي ثابت عن أبي صالح عن النبي صلى الله عليه وسلم مرسلا وأصحاب الأعمش لم يذكروا فيه عن أبي هريرة ‏.‏ قال أبو عيسى وقد فسر بعض أهل العلم هذا الحديث فقال إذا اطلع عليه فأعجبه فإنما معناه أن يعجبه ثناء الناس عليه بالخير لقول النبي صلى الله عليه وسلم ‏\"‏ أنتم شهداء الله في الأرض ‏\"‏ ‏.‏ فيعجبه ثناء الناس عليه لهذا لما يرجو بثناء الناس عليه فأما إذا أعجبه ليعلم الناس منه الخير ليكرم على ذلك ويعظم عليه فهذا رياء ‏.‏ وقال بعض أهل العلم إذا اطلع عليه فأعجبه رجاء أن يعمل بعمله فيكون له مثل أجورهم فهذا له مذهب أيضا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2385,
			"arabicnumber": 2385,
			"text": "حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن حميد، عن أنس، أنه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله متى قيام الساعة فقام النبي صلى الله عليه وسلم إلى الصلاة فلما قضى صلاته قال ‏\"‏ أين السائل عن قيام الساعة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ ما أعددت لها ‏\"‏ قال يا رسول الله ما أعددت لها كبير صلاة ولا صوم إلا أني أحب الله ورسوله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ المرء مع من أحب وأنت مع من أحببت ‏\"‏ ‏.‏ فما رأيت فرح المسلمون بعد الإسلام فرحهم بهذا ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2386,
			"arabicnumber": 2386,
			"text": "حدثنا أبو هشام الرفاعي، حدثنا حفص بن غياث، عن أشعث، عن الحسن، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ المرء مع من أحب وله ما اكتسب ‏\"‏ ‏.‏ وفي الباب عن علي وعبد الله بن مسعود وصفوان بن عسال وأبي هريرة وأبي موسى ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث الحسن البصري عن أنس بن مالك عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير وجه عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2387,
			"arabicnumber": 2387,
			"text": "حدثنا محمود بن غيلان، حدثنا يحيى بن آدم، حدثنا سفيان، عن عاصم، عن زر بن حبيش، عن صفوان بن عسال، قال جاء أعرابي جهوري الصوت فقال يا محمد الرجل يحب القوم ولما يلحق بهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ المرء مع من أحب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم، عن زر، عن صفوان بن عسال، عن النبي صلى الله عليه وسلم نحو حديث محمود ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2388,
			"arabicnumber": 2388,
			"text": "حدثنا أبو كريب، حدثنا وكيع، عن جعفر بن برقان، عن يزيد بن الأصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله يقول أنا عند ظن عبدي في وأنا معه إذا دعاني ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2389,
			"arabicnumber": 2389,
			"text": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، حدثنا معاوية بن صالح، حدثنا عبد الرحمن بن جبير بن نفير الحضرمي، عن أبيه، عن النواس بن سمعان، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن البر والإثم فقال النبي صلى الله عليه وسلم ‏ \"‏ البر حسن الخلق والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ‏\"‏ ‏.‏ حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، نحوه إلا أنه قال سألت النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2390,
			"arabicnumber": 2390,
			"text": "حدثنا أحمد بن منيع، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، حدثنا حبيب بن أبي مرزوق، عن عطاء بن أبي رباح، عن أبي مسلم الخولاني، حدثني معاذ بن جبل، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ قال الله عز وجل المتحابون في جلالي لهم منابر من نور يغبطهم النبيون والشهداء ‏\"‏ ‏.‏ وفي الباب عن أبي الدرداء وابن مسعود وعبادة بن الصامت وأبي هريرة وأبي مالك الأشعري ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو مسلم الخولاني اسمه عبد الله بن ثوب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2391,
			"arabicnumber": 2391,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أو عن أبي سعيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سبعة يظلهم الله في ظله يوم لا ظل إلا ظله إمام عادل وشاب نشأ بعبادة الله ورجل كان قلبه معلقا بالمسجد إذا خرج منه حتى يعود إليه ورجلان تحابا في الله فاجتمعا على ذلك وتفرقا ورجل ذكر الله خاليا ففاضت عيناه ورجل دعته امرأة ذات حسب وجمال فقال إني أخاف الله ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهكذا روي هذا الحديث عن مالك بن أنس من غير وجه مثل هذا وشك فيه وقال عن أبي هريرة أو عن أبي سعيد وعبيد الله بن عمر رواه عن خبيب بن عبد الرحمن ولم يشك فيه يقول عن أبي هريرة ‏.‏ حدثنا سوار بن عبد الله العنبري، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد، عن عبيد الله بن عمر، حدثني خبيب، عن حفص بن عاصم، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحو حديث مالك بن أنس بمعناه إلا أنه قال ‏\"‏ كان قلبه معلقا بالمساجد ‏\"‏ ‏.‏ وقال ‏\"‏ ذات منصب وجمال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2392,
			"arabicnumber": 2392,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2393,
			"arabicnumber": 2393,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن حبيب بن أبي ثابت، عن مجاهد، عن أبي معمر، قال قام رجل فأثنى على أمير من الأمراء فجعل المقداد يحثو في وجهه التراب وقال أمرنا رسول الله صلى الله عليه وسلم أن نحثو في وجوه المداحين التراب ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى زائدة عن يزيد بن أبي زياد عن مجاهد عن ابن عباس وحديث مجاهد عن أبي معمر أصح ‏.‏ وأبو معمر اسمه عبد الله بن سخبرة والمقداد بن الأسود هو المقداد بن عمرو الكندي ويكنى أبا معبد وإنما نسب إلى الأسود بن عبد يغوث لأنه كان قد تبناه وهو صغير ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2394,
			"arabicnumber": 2394,
			"text": "حدثنا محمد بن عثمان الكوفي، حدثنا عبيد الله بن موسى، عن سالم الخياط، عن الحسن، عن أبي هريرة، قال أمرنا رسول الله صلى الله عليه وسلم أن نحثو في أفواه المداحين التراب ‏.‏ قال أبو عيسى هذا حديث غريب من حديث أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2395,
			"arabicnumber": 2395,
			"text": "حدثنا سويد بن نصر، أخبرنا ابن المبارك، عن حيوة بن شريح، حدثني سالم بن غيلان، أن الوليد بن قيس التجيبي، أخبره أنه، سمع أبا سعيد الخدري، قال سالم أو عن أبي الهيثم، عن أبي سعيد، - أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تصاحب إلا مؤمنا ولا يأكل طعامك إلا تقي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن إنما نعرفه من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2396,
			"arabicnumber": 2396,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن سعد بن سنان، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أراد الله بعبده الخير عجل له العقوبة في الدنيا وإذا أراد الله بعبده الشر أمسك عنه بذنبه حتى يوفى به يوم القيامة ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ إن عظم الجزاء مع عظم البلاء وإن الله إذا أحب قوما ابتلاهم فمن رضي فله الرضا ومن سخط فله السخط ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2397,
			"arabicnumber": 2397,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن الأعمش، قال سمعت أبا وائل، يقول قالت عائشة ما رأيت الوجع على أحد أشد منه على رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2398,
			"arabicnumber": 2398,
			"text": "حدثنا قتيبة، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن مصعب بن سعد، عن أبيه، قال قلت يا رسول الله أى الناس أشد بلاء قال ‏ \"‏ الأنبياء ثم الأمثل فالأمثل فيبتلى الرجل على حسب دينه فإن كان دينه صلبا اشتد بلاؤه وإن كان في دينه رقة ابتلي على حسب دينه فما يبرح البلاء بالعبد حتى يتركه يمشي على الأرض ما عليه خطيئة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي هريرة وأخت حذيفة بن اليمان ‏أن النبي صلى الله عليه وسلم سئل أي الناس أشد بلاء قال الأنبياء ثم الأمثل فالأمثل",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2399,
			"arabicnumber": 2399,
			"text": "حدثنا محمد بن عبد الأعلى، حدثنا يزيد بن زريع، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما يزال البلاء بالمؤمن والمؤمنة في نفسه وولده وماله حتى يلقى الله وما عليه خطيئة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2400,
			"arabicnumber": 2400,
			"text": "حدثنا عبد الله بن معاوية الجمحي، حدثنا عبد العزيز بن مسلم، حدثنا أبو ظلال، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله يقول إذا أخذت كريمتى عبدي في الدنيا لم يكن له جزاء عندي إلا الجنة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وزيد بن أرقم ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وأبو ظلال اسمه هلال ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2401,
			"arabicnumber": 2401,
			"text": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان، عن الأعمش، عن أبي صالح، عن أبي هريرة، رفعه إلى النبي صلى الله عليه وسلم قال ‏ \"‏ يقول الله عز وجل من أذهبت حبيبتيه فصبر واحتسب لم أرض له ثوابا دون الجنة ‏\"‏ ‏.‏ وفي الباب عن عرباض بن سارية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2402,
			"arabicnumber": 2402,
			"text": "حدثنا محمد بن حميد الرازي، ويوسف بن موسى القطان البغدادي، قالا حدثنا عبد الرحمن بن مغراء أبو زهير، عن الأعمش، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يود أهل العافية يوم القيامة حين يعطى أهل البلاء الثواب لو أن جلودهم كانت قرضت في الدنيا بالمقاريض ‏\"‏ ‏.‏ وهذا حديث غريب لا نعرفه بهذا الإسناد إلا من هذا الوجه ‏.‏ وقد روى بعضهم هذا الحديث عن الأعمش عن طلحة بن مصرف عن مسروق قوله شيئا من هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2403,
			"arabicnumber": 2403,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا يحيى بن عبيد الله، قال سمعت أبي يقول، سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من أحد يموت إلا ندم ‏\"‏ ‏.‏ قالوا وما ندامته يا رسول الله قال ‏\"‏ إن كان محسنا ندم أن لا يكون ازداد وإن كان مسيئا ندم أن لا يكون نزع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إنما نعرفه من هذا الوجه ‏.‏ ويحيى بن عبيد الله قد تكلم فيه شعبة وهو يحيى بن عبيد الله بن موهب مدني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2404,
			"arabicnumber": 2404,
			"text": "حدثنا سويد، أخبرنا ابن المبارك، أخبرنا يحيى بن عبيد الله، قال سمعت أبي يقول، سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ يخرج في آخر الزمان رجال يختلون الدنيا بالدين يلبسون للناس جلود الضأن من اللين ألسنتهم أحلى من السكر وقلوبهم قلوب الذئاب يقول الله عز وجل أبي يغترون أم على يجترئون فبي حلفت لأبعثن على أولئك منهم فتنة تدع الحليم منهم حيرانا ‏\"‏ ‏.‏ وفي الباب عن ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2405,
			"arabicnumber": 2405,
			"text": "حدثنا أحمد بن سعيد الدارمي، حدثنا محمد بن عباد، أخبرنا حاتم بن إسماعيل، أخبرنا حمزة بن أبي محمد، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله تعالى قال لقد خلقت خلقا ألسنتهم أحلى من العسل وقلوبهم أمر من الصبر فبي حلفت لأتيحنهم فتنة تدع الحليم منهم حيرانا فبي يغترون أم على يجترءون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عمر لا نعرفه إلا من هذا الوجه",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2406,
			"arabicnumber": 2406,
			"text": "حدثنا صالح بن عبد الله، حدثنا عبد الله بن المبارك، ح وحدثنا سويد بن نصر، أخبرنا ابن المبارك، عن يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم، عن أبي أمامة، عن عقبة بن عامر، قال قلت يا رسول الله ما النجاة قال ‏ \"‏ أمسك عليك لسانك وليسعك بيتك وابك على خطيئتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2407,
			"arabicnumber": 2407,
			"text": "حدثنا محمد بن موسى البصري، حدثنا حماد بن زيد، عن أبي الصهباء، عن سعيد بن جبير، عن أبي سعيد الخدري، رفعه قال ‏ \"‏ إذا أصبح ابن آدم فإن الأعضاء كلها تكفر اللسان فتقول اتق الله فينا فإنما نحن بك فإن استقمت استقمنا وإن اعوججت اعوججنا ‏\"‏ ‏.‏ حدثنا هناد، حدثنا أبو أسامة، عن حماد بن زيد، نحوه ولم يرفعه وهذا أصح من حديث محمد بن موسى ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث حماد بن زيد وقد رواه غير واحد عن حماد بن زيد ولم يرفعوه ‏.‏ حدثنا صالح بن عبد الله، حدثنا حماد بن زيد، عن أبي الصهباء، عن سعيد بن جبير، عن أبي سعيد الخدري، قال أحسبه عن النبي صلى الله عليه وسلم فذكر نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2408,
			"arabicnumber": 2408,
			"text": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا عمر بن علي المقدمي، عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يتكفل لي ما بين لحييه وما بين رجليه أتكفل له بالجنة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وابن عباس ‏.‏ قال أبو عيسى حديث سهل حديث حسن صحيح غريب من حديث سهل بن سعد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2409,
			"arabicnumber": 2409,
			"text": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من وقاه الله شر ما بين لحييه وشر ما بين رجليه دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى أبو حازم الذي روى عن أبي هريرة اسمه سلمان مولى عزة الأشجعية وهو كوفي وأبو حازم الذي روى عن سهل بن سعد هو أبو حازم الزاهد مدني واسمه سلمة بن دينار ‏.‏ وهذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2410,
			"arabicnumber": 2410,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن معمر، عن الزهري، عن عبد الرحمن بن ماعز، عن سفيان بن عبد الله الثقفي، قال قلت يا رسول الله حدثني بأمر أعتصم به ‏.‏ قال ‏\"‏ قل ربي الله ثم استقم ‏\"‏ ‏.‏ قلت يا رسول الله ما أخوف ما تخاف على فأخذ بلسان نفسه ثم قال ‏\"‏ هذا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن سفيان بن عبد الله الثقفي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2411,
			"arabicnumber": 2411,
			"text": "حدثنا أبو عبد الله، محمد بن أبي ثلج البغدادي صاحب أحمد بن حنبل حدثنا علي بن حفص، حدثنا إبراهيم بن عبد الله بن حاطب، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تكثروا الكلام بغير ذكر الله فإن كثرة الكلام بغير ذكر الله قسوة للقلب وإن أبعد الناس من الله القلب القاسي ‏\"‏ ‏.‏ حدثنا أبو بكر بن أبي النضر، حدثني أبو النضر، عن إبراهيم بن عبد الله بن حاطب، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث إبراهيم بن عبد الله بن حاطب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2412,
			"arabicnumber": 2412,
			"text": "حدثنا محمد بن بشار، وغير، واحد، قالوا حدثنا محمد بن يزيد بن خنيس المكي، قال سمعت سعيد بن حسان المخزومي، قال حدثتني أم صالح، عن صفية بنت شيبة، عن أم حبيبة، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏ \"‏ كل كلام ابن آدم عليه لا له إلا أمر بمعروف أو نهى عن منكر أو ذكر الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن يزيد بن خنيس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2413,
			"arabicnumber": 2413,
			"text": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى رسول الله صلى الله عليه وسلم بين سلمان وبين أبي الدرداء فزار سلمان أبا الدرداء فرأى أم الدرداء متبذلة فقال ما شأنك متبذلة قالت إن أخاك أبا الدرداء ليس له حاجة في الدنيا ‏.‏ قال فلما جاء أبو الدرداء قرب إليه طعاما فقال كل فإني صائم ‏.‏ قال ما أنا بآكل حتى تأكل ‏.‏ قال فأكل فلما كان الليل ذهب أبو الدرداء ليقوم فقال له سلمان نم ‏.‏ فنام ثم ذهب يقوم فقال له نم ‏.‏ فنام فلما كان عند الصبح قال له سلمان قم الآن فقاما فصليا فقال إن لنفسك عليك حقا ولربك عليك حقا ولضيفك عليك حقا وإن لأهلك عليك حقا فأعط كل ذي حق حقه ‏.‏ فأتيا النبي صلى الله عليه وسلم فذكرا ذلك فقال له ‏ \"‏ صدق سلمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وأبو العميس اسمه عتبة بن عبد الله وهو أخو عبد الرحمن بن عبد الله المسعودي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2414,
			"arabicnumber": 2414,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن عبد الوهاب بن الورد، عن رجل، من أهل المدينة قال كتب معاوية إلى عائشة أم المؤمنين رضى الله عنها أن اكتبي إلى كتابا توصيني فيه ولا تكثري على ‏.‏ فكتبت عائشة رضى الله عنها إلى معاوية سلام عليك أما بعد فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من التمس رضاء الله بسخط الناس كفاه الله مؤنة الناس ومن التمس رضاء الناس بسخط الله وكله الله إلى الناس ‏\"‏ ‏.‏ والسلام عليك ‏.‏ حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، عن سفيان الثوري، عن هشام بن عروة، عن أبيه، عن عائشة، أنها كتبت إلى معاوية فذكر الحديث بمعناه ولم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		}
	]
}