{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"40": "The Book on Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2606,
			"arabicnumber": 2606,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها منعوا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏ وفي الباب عن جابر وأبي سعيد وابن عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Mutawatir"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2607,
			"arabicnumber": 2607,
			"text": "حدثنا قتيبة، حدثنا الليث، عن عقيل، عن الزهري، أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، قال لما توفي رسول الله صلى الله عليه وسلم واستخلف أبو بكر بعده كفر من كفر من العرب فقال عمر بن الخطاب لأبي بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله ومن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ قال أبو بكر والله لأقاتلن من فرق بين الزكاة والصلاة فإن الزكاة حق المال والله لو منعوني عقالا كانوا يؤدونه إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعه فقال عمر بن الخطاب فوالله ما هو إلا أن رأيت أن الله قد شرح صدر أبي بكر للقتال فعرفت أنه الحق ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهكذا روى شعيب بن أبي حمزة عن الزهري عن عبيد الله بن عبد الله عن أبي هريرة ‏.‏ وروى عمران القطان هذا الحديث عن معمر عن الزهري عن أنس بن مالك عن أبي بكر وهو حديث خطأ وقد خولف عمران في روايته عن معمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2608,
			"arabicnumber": 2608,
			"text": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا ابن المبارك، أخبرنا حميد الطويل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا عبده ورسوله وأن يستقبلوا قبلتنا ويأكلوا ذبيحتنا وأن يصلوا صلاتنا فإذا فعلوا ذلك حرمت علينا دماؤهم وأموالهم إلا بحقها لهم ما للمسلمين وعليهم ما على المسلمين ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد رواه يحيى بن أيوب عن حميد عن أنس نحو هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2609,
			"arabicnumber": 2609,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن سعير بن الخمس التميمي، عن حبيب بن أبي ثابت، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ بني الإسلام على خمس شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وحج البيت ‏\"‏ ‏.‏ وفي الباب عن جرير بن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن ابن عمر عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ وسعير بن الخمس ثقة عند أهل الحديث ‏.‏ حدثنا أبو كريب، حدثنا وكيع، عن حنظلة بن أبي سفيان الجمحي، عن عكرمة بن خالد المخزومي، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2610,
			"arabicnumber": 2610,
			"text": "حدثنا أبو عمار الحسين بن حريث الخزاعي، أخبرنا وكيع، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن يحيى بن يعمر، قال أول من تكلم في القدر معبد الجهني قال فخرجت أنا وحميد بن عبد الرحمن الحميري حتى أتينا المدينة فقلنا لو لقينا رجلا من أصحاب النبي صلى الله عليه وسلم فسألناه عما أحدث هؤلاء القوم ‏.‏ قال فلقيناه يعني عبد الله بن عمر وهو خارج من المسجد قال فاكتنفته أنا وصاحبي قال فظننت أن صاحبي سيكل الكلام إلى فقلت يا أبا عبد الرحمن إن قوما يقرءون القرآن ويتقفرون العلم ويزعمون أن لا قدر وأن الأمر أنف قال فإذا لقيت أولئك فأخبرهم أني منهم بريء وأنهم مني برآء والذي يحلف به عبد الله لو أن أحدهم أنفق مثل أحد ذهبا ما قبل ذلك منه حتى يؤمن بالقدر خيره وشره ‏.‏ قال ثم أنشأ يحدث فقال قال عمر بن الخطاب كنا عند رسول الله صلى الله عليه وسلم فجاء رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد حتى أتى النبي صلى الله عليه وسلم فألزق ركبته بركبته ثم قال يا محمد ما الإيمان قال ‏\"‏ أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر والقدر خيره وشره ‏\"‏ ‏.‏ قال فما الإسلام قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا عبده ورسوله وإقام الصلاة وإيتاء الزكاة وحج البيت وصوم رمضان ‏\"‏ ‏.‏ قال فما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه فإنك إن لم تكن تراه فإنه يراك ‏\"‏ ‏.‏ قال في كل ذلك يقول له صدقت ‏.‏ قال فتعجبنا منه يسأله ويصدقه ‏.‏ قال فمتى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل ‏\"‏ ‏.‏ قال فما أمارتها قال أن تلد الأمة ربتها وأن ترى الحفاة العراة العالة أصحاب الشاء يتطاولون في البنيان ‏\"‏ ‏.‏ قال عمر فلقيني النبي صلى الله عليه وسلم بعد ذلك بثلاث فقال ‏\"‏ يا عمر هل تدري من السائل ذاك جبريل أتاكم يعلمكم معالم دينكم ‏\"‏ ‏.‏ حدثنا أحمد بن محمد، أخبرنا ابن المبارك، أخبرنا كهمس بن الحسن، بهذا الإسناد نحوه ‏.‏ حدثنا محمد بن المثنى، حدثنا معاذ بن معاذ، عن كهمس، بهذا الإسناد نحوه بمعناه ‏.‏ وفي الباب عن طلحة بن عبيد الله وأنس بن مالك وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح قد روي من غير وجه نحو هذا عن عمر ‏.‏ وقد روي هذا الحديث عن ابن عمر عن النبي صلى الله عليه وسلم والصحيح هو ابن عمر عن عمر عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2611,
			"arabicnumber": 2611,
			"text": "حدثنا قتيبة، حدثنا عباد بن عباد المهلبي، عن أبي جمرة، عن ابن عباس، قال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إنا هذا الحى من ربيعة ولسنا نصل إليك إلا في أشهر الحرام فمرنا بشيء نأخذه عنك وندعو إليه من وراءنا ‏.‏ فقال ‏ \"‏ آمركم بأربع الإيمان بالله ثم فسرها لهم شهادة أن لا إله إلا الله وأني رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا خمس ما غنمتم ‏\"‏ ‏.‏ حدثنا قتيبة، حدثنا حماد بن زيد، عن أبي جمرة، عن ابن عباس، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو جمرة الضبعي اسمه نصر بن عمران ‏.‏ وقد رواه شعبة عن أبي جمرة أيضا وزاد فيه أتدرون ما الإيمان شهادة أن لا إله إلا الله وأني رسول الله وذكر الحديث ‏.‏ سمعت قتيبة بن سعيد يقول ما رأيت مثل هؤلاء الأشراف الأربعة مالك بن أنس والليث بن سعد وعباد بن عباد المهلبي وعبد الوهاب الثقفي ‏.‏ قال قتيبة كنا نرضى أن نرجع من عند عباد كل يوم بحديثين وعباد بن عباد هو من ولد المهلب بن أبي صفرة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "حدثنا أحمد بن منيع البغدادي، حدثنا إسماعيل ابن علية، حدثنا خالد الحذاء، عن أبي قلابة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن من أكمل المؤمنين إيمانا أحسنهم خلقا وألطفهم بأهله ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وأنس بن مالك ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ولا نعرف لأبي قلابة سماعا من عائشة ‏.‏ وقد روى أبو قلابة عن عبد الله بن يزيد رضيع لعائشة عن عائشة غير هذا الحديث وأبو قلابة اسمه عبد الله بن زيد الجرمي ‏.‏ حدثنا ابن أبي عمر حدثنا سفيان بن عيينة قال ذكر أيوب السختياني أبا قلابة فقال كان والله من الفقهاء ذوي الألباب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "حدثنا أبو عبد الله، هريم بن مسعر الأزدي الترمذي حدثنا عبد العزيز بن محمد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خطب الناس فوعظهم ثم قال ‏\"‏ يا معشر النساء تصدقن فإنكن أكثر أهل النار ‏\"‏ ‏.‏ فقالت امرأة منهن ولم ذاك يا رسول الله قال ‏\"‏ لكثرة لعنكن ‏\"‏ ‏.‏ يعني وكفركن العشير ‏.‏ قال ‏\"‏ وما رأيت من ناقصات عقل ودين أغلب لذوي الألباب وذوي الرأى منكن ‏\"‏ ‏.‏ قالت امرأة منهن وما نقصان دينها وعقلها قال ‏\"‏ شهادة امرأتين منكن بشهادة رجل ونقصان دينكن الحيضة تمكث إحداكن الثلاث والأربع لا تصلي ‏\"‏ ‏.‏ وفي الباب عن أبي سعيد وابن عمر ‏.‏ قال أبو عيسى هذا حديث صحيح غريب حسن من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2614,
			"arabicnumber": 2614,
			"text": "حدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن سهيل بن أبي صالح، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإيمان بضع وسبعون بابا فأدناها إماطة الأذى عن الطريق وأرفعها قول لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهكذا روى سهيل بن أبي صالح عن عبد الله بن دينار عن أبي صالح عن أبي هريرة ‏.‏ وروى عمارة بن غزية، هذا الحديث عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان أربعة وستون بابا ‏\"‏ ‏.‏ قال حدثنا بذلك قتيبة حدثنا بكر بن مضر عن عمارة بن غزية عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2615,
			"arabicnumber": 2615,
			"text": "حدثنا ابن أبي عمر، وأحمد بن منيع، - المعنى واحد قالا حدثنا سفيان بن عيينة، عن الزهري، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم مر برجل وهو يعظ أخاه في الحياء فقال رسول الله صلى الله عليه وسلم ‏ \"‏ الحياء من الإيمان ‏\"‏ ‏.‏ قال أحمد بن منيع في حديثه إن النبي صلى الله عليه وسلم سمع رجلا يعظ أخاه في الحياء ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي هريرة وأبي بكرة وأبي أمامة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2616,
			"arabicnumber": 2616,
			"text": "حدثنا ابن أبي عمر، حدثنا عبد الله بن معاذ الصنعاني، عن معمر، عن عاصم بن أبي النجود، عن أبي وائل، عن معاذ بن جبل، قال كنت مع النبي صلى الله عليه وسلم في سفر فأصبحت يوما قريبا منه ونحن نسير فقلت يا رسول الله أخبرني بعمل يدخلني الجنة ويباعدني من النار ‏.‏ قال ‏\"‏ لقد سألتني عن عظيم وإنه ليسير على من يسره الله عليه تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أدلك على أبواب الخير الصوم جنة والصدقة تطفئ الخطيئة كما يطفئ الماء النار وصلاة الرجل من جوف الليل ‏\"‏ ‏.‏ قال ثم تلا‏:‏ ‏(‏ تتجافى جنوبهم عن المضاجع ‏)‏ حتى بلغ‏:‏ ‏(‏يعملون‏)‏ ثم قال ‏\"‏ ألا أخبرك برأس الأمر كله وعموده وذروة سنامه ‏\"‏ ‏.‏ قلت بلى يا رسول الله ‏.‏ قال ‏\"‏ رأس الأمر الإسلام وعموده الصلاة وذروة سنامه الجهاد ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أخبرك بملاك ذلك كله ‏\"‏ ‏.‏ قلت بلى يا نبي الله قال فأخذ بلسانه قال ‏\"‏ كف عليك هذا ‏\"‏ ‏.‏ فقلت يا نبي الله وإنا لمؤاخذون بما نتكلم به فقال ‏\"‏ ثكلتك أمك يا معاذ وهل يكب الناس في النار على وجوههم أو على مناخرهم إلا حصائد ألسنتهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2617,
			"arabicnumber": 2617,
			"text": "حدثنا ابن أبي عمر، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن دراج أبي السمح، عن أبي الهيثم، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيتم الرجل يتعاهد المسجد فاشهدوا له بالإيمان فإن الله تعالى يقول‏:‏ ‏(‏إنما يعمر مساجد الله من آمن بالله واليوم الآخر وأقام الصلاة وآتى الزكاة ‏)‏ ‏\"‏ ‏.‏ الآية ‏.‏ قال أبو عيسى هذا حديث غريب حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2618,
			"arabicnumber": 2618,
			"text": "حدثنا قتيبة، حدثنا جرير، وأبو معاوية عن الأعمش، عن أبي سفيان، عن جابر، أن النبي صلى الله عليه وسلم قال ‏ \"‏ بين الكفر والإيمان ترك الصلاة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2619,
			"arabicnumber": 2619,
			"text": "حدثنا هناد، حدثنا أسباط بن محمد، عن الأعمش، بهذا الإسناد نحوه وقال ‏ \"‏ بين العبد وبين الشرك أو الكفر ترك الصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو سفيان اسمه طلحة بن نافع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2620,
			"arabicnumber": 2620,
			"text": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ بين العبد وبين الكفر ترك الصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو الزبير اسمه محمد بن مسلم بن تدرس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2621,
			"arabicnumber": 2621,
			"text": "حدثنا أبو عمار الحسين بن حريث، ويوسف بن عيسى، قالا حدثنا الفضل بن موسى، عن الحسين بن واقد، ح وحدثنا أبو عمار الحسين بن حريث، ومحمود بن غيلان، قالا حدثنا علي بن الحسين بن واقد، عن أبيه، ح وحدثنا محمد بن علي بن الحسن بن شقيق، ومحمود بن غيلان، قالا حدثنا علي بن الحسن بن شقيق، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2622,
			"arabicnumber": 2622,
			"text": "حدثنا قتيبة، حدثنا بشر بن المفضل، عن الجريري، عن عبد الله بن شقيق العقيلي، قال كان أصحاب محمد صلى الله عليه وسلم لا يرون شيئا من الأعمال تركه كفر غير الصلاة ‏.‏ قال أبو عيسى سمعت أبا مصعب المدني يقول من قال الإيمان قول يستتاب فإن تاب وإلا ضربت عنقه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2623,
			"arabicnumber": 2623,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن عامر بن سعد بن أبي وقاص، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد نبيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2624,
			"arabicnumber": 2624,
			"text": "حدثنا ابن أبي عمر، حدثنا عبد الوهاب الثقفي، عن أيوب، عن أبي قلابة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ثلاث من كن فيه وجد بهن طعم الإيمان من كان الله ورسوله أحب إليه مما سواهما وأن يحب المرء لا يحبه إلا لله وأن يكره أن يعود في الكفر بعد إذ أنقذه الله منه كما يكره أن يقذف في النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه قتادة عن أنس بن مالك عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2625,
			"arabicnumber": 2625,
			"text": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن ولا يسرق السارق حين يسرق وهو مؤمن ولكن التوبة معروضة ‏\"‏ ‏.‏ وفي الباب عن ابن عباس وعائشة وعبد الله بن أبي أوفى ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب من هذا الوجه ‏.‏ - وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا زنى العبد خرج منه الإيمان فكان فوق رأسه كالظلة فإذا خرج من ذلك العمل عاد إليه الإيمان ‏\"‏ ‏.‏ وقد روي عن أبي جعفر محمد بن علي أنه قال في هذا خرج من الإيمان إلى الإسلام ‏.‏ وقد روي من غير وجه عن النبي صلى الله عليه وسلم أنه قال في الزنا والسرقة ‏\"‏ من أصاب من ذلك شيئا فأقيم عليه الحد فهو كفارة ذنبه ومن أصاب من ذلك شيئا فستر الله عليه فهو إلى الله إن شاء عذبه يوم القيامة وإن شاء غفر له ‏\"‏ ‏.‏ روى ذلك علي بن أبي طالب وعبادة بن الصامت وخزيمة بن ثابت عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2626,
			"arabicnumber": 2626,
			"text": "حدثنا أبو عبيدة بن أبي السفر، - واسمه أحمد بن عبد الله الهمداني الكوفي قال حدثنا حجاج بن محمد، عن يونس بن أبي إسحاق، عن أبي إسحاق الهمداني، عن أبي جحيفة، عن علي، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من أصاب حدا فعجل عقوبته في الدنيا فالله أعدل من أن يثني على عبده العقوبة في الآخرة ومن أصاب حدا فستره الله عليه وعفا عنه فالله أكرم من أن يعود في شيء قد عفا عنه ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن غريب صحيح ‏.‏ وهذا قول أهل العلم لا نعلم أحدا كفر أحدا بالزنا أو السرقة وشرب الخمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2627,
			"arabicnumber": 2627,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المسلم من سلم المسلمون من لسانه ويده والمؤمن من أمنه الناس على دمائهم وأموالهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ويروى عن النبي صلى الله عليه وسلم أنه سئل أى المسلمين أفضل قال ‏\"‏ من سلم المسلمون من لسانه ويده.\" وفي الباب عن جابر وأبي موسى وعبد الله بن عمرو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2628,
			"arabicnumber": 2628,
			"text": "حدثنا بذلك إبراهيم بن سعيد الجوهري حدثنا أبو أسامة عن بريد بن عبد الله بن أبي بردة عن جده أبي بردة عن أبي موسى الأشعري أن النبي صلى الله عليه وسلم سئل أى المسلمين أفضل قال ‏ \"‏ من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب من حديث أبي موسى الأشعري عن النبي صلى الله عليه وسلم",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2629,
			"arabicnumber": 2629,
			"text": "حدثنا أبو كريب، حدثنا حفص بن غياث، عن الأعمش، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ فطوبى للغرباء ‏\"‏ ‏.‏ وفي الباب عن سعد وابن عمر وجابر وأنس وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث ابن مسعود إنما نعرفه من حديث حفص بن غياث عن الأعمش وأبو الأحوص اسمه عوف بن مالك بن نضلة الجشمي تفرد به حفص ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2630,
			"arabicnumber": 2630,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا إسماعيل بن أبي أويس، حدثني كثير بن عبد الله بن عمرو بن عوف بن زيد بن ملحة، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الدين ليأرز إلى الحجاز كما تأرز الحية إلى جحرها وليعقلن الدين من الحجاز معقل الأروية من رأس الجبل إن الدين بدأ غريبا ويرجع غريبا فطوبى للغرباء الذين يصلحون ما أفسد الناس من بعدي من سنتي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2631,
			"arabicnumber": 2631,
			"text": "حدثنا أبو حفص، عمرو بن علي حدثنا يحيى بن محمد بن قيس، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ آية المنافق ثلاث إذا حدث كذب وإذا وعد أخلف وإذا اؤتمن خان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث العلاء وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وفي الباب عن ابن مسعود وأنس وجابر ‏.‏ حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، عن أبي سهيل بن مالك، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث صحيح وأبو سهيل هو عم مالك بن أنس واسمه نافع بن مالك بن أبي عامر الأصبحي الخولاني ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2632,
			"arabicnumber": 2632,
			"text": "حدثنا محمود بن غيلان، حدثنا عبيد الله بن موسى، عن سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أربع من كن فيه كان منافقا وإن كانت خصلة منهن فيه كانت فيه خصلة من النفاق حتى يدعها من إذا حدث كذب وإذا وعد أخلف وإذا خاصم فجر وإذا عاهد غدر ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ حدثنا الحسن بن علي الخلال، حدثنا عبد الله بن نمير، عن الأعمش، عن عبد الله بن مرة، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإنما معنى هذا عند أهل العلم نفاق العمل وإنما كان نفاق التكذيب على عهد رسول الله صلى الله عليه وسلم هكذا روي عن الحسن البصري شيئا من هذا أنه قال النفاق نفاقان نفاق العمل ونفاق التكذيب ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2633,
			"arabicnumber": 2633,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا إبراهيم بن طهمان، عن علي بن عبد الأعلى، عن أبي النعمان، عن أبي وقاص، عن زيد بن أرقم، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا وعد الرجل وينوي أن يفي به فلم يف به فلا جناح عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بالقوي ‏.‏ علي بن عبد الأعلى ثقة ولا يعرف أبو النعمان ولا أبو وقاص وهما مجهولان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2634,
			"arabicnumber": 2634,
			"text": "حدثنا محمد بن عبد الله بن بزيع، حدثنا عبد الحكيم بن منصور الواسطي، عن عبد الملك بن عمير، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قتال المسلم أخاه كفر وسبابه فسوق ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن مغفل ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح ‏.‏ وقد روي عن عبد الله بن مسعود من غير وجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2635,
			"arabicnumber": 2635,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن زبيد، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى هذا الحديث قتاله كفر ليس به كفرا مثل الارتداد عن الإسلام والحجة في ذلك ما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من قتل متعمدا فأولياء المقتول بالخيار إن شاءوا قتلوا وإن شاءوا عفوا ‏\"‏ ‏.‏ ولو كان القتل كفرا لوجب القتل ولم يصح العفو وقد روي عن ابن عباس وطاوس وعطاء وغير واحد من أهل العلم قالوا كفر دون كفر وفسوق دون فسوق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2636,
			"arabicnumber": 2636,
			"text": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي قلابة، عن ثابت بن الضحاك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس على العبد نذر فيما لا يملك ولاعن المؤمن كقاتله ومن قذف مؤمنا بكفر فهو كقاتله ومن قتل نفسه بشيء عذبه الله بما قتل به نفسه يوم القيامة ‏\"‏ ‏.‏ وفي الباب عن أبي ذر وابن عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2637,
			"arabicnumber": 2637,
			"text": "حدثنا قتيبة، عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أيما رجل قال لأخيه كافر فقد باء به أحدهما ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ ومعنى قوله باء يعني أقر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن الصنابحي، عن عبادة بن الصامت، أنه قال دخلت عليه وهو في الموت فبكيت فقال مهلا لم تبكي فوالله لئن استشهدت لأشهدن لك ولئن شفعت لأشفعن لك ولئن استطعت لأنفعنك ثم قال والله ما من حديث سمعته من رسول الله صلى الله عليه وسلم لكم فيه خير إلا حدثتكموه إلا حديثا واحدا وسوف أحدثكموه اليوم وقد أحيط بنفسي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شهد أن لا إله إلا الله وأن محمدا رسول الله حرم الله عليه النار ‏\"‏ ‏.‏ وفي الباب عن أبي بكر وعمر وعثمان وعلي وطلحة وجابر وابن عمر وزيد بن خالد ‏.‏ قال سمعت ابن أبي عمر يقول سمعت ابن عيينة يقول محمد بن عجلان كان ثقة مأمونا في الحديث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه والصنابحي هو عبد الرحمن بن عسيلة أبو عبد الله ‏.‏ وقد روي عن الزهري أنه سئل عن قول النبي صلى الله عليه وسلم ‏\"‏ من قال لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏ فقال إنما كان هذا في أول الإسلام قبل نزول الفرائض والأمر والنهى ‏.‏ قال أبو عيسى ووجه هذا الحديث عند بعض أهل العلم أن أهل التوحيد سيدخلون الجنة وإن عذبوا بالنار بذنوبهم فإنهم لا يخلدون في النار ‏.‏ وقد روي عن عبد الله بن مسعود وأبي ذر وعمران بن حصين وجابر بن عبد الله وابن عباس وأبي سعيد الخدري وأنس بن مالك عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ سيخرج قوم من النار من أهل التوحيد ويدخلون الجنة ‏\"‏ ‏.‏ هكذا روي عن سعيد بن جبير وإبراهيم النخعي وغير واحد من التابعين وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم في تفسير هذه الآية‏:‏ ‏(‏ربما يود الذين كفروا لو كانوا مسلمين‏)‏ قالوا إذا أخرج أهل التوحيد من النار وأدخلوا الجنة يود الذين كفروا لو كانوا مسلمين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2639,
			"arabicnumber": 2639,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن ليث بن سعد، حدثني عامر بن يحيى، عن أبي عبد الرحمن المعافري، ثم الحبلي قال سمعت عبد الله بن عمرو بن العاص، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله سيخلص رجلا من أمتي على رءوس الخلائق يوم القيامة فينشر عليه تسعة وتسعين سجلا كل سجل مثل مد البصر ثم يقول أتنكر من هذا شيئا أظلمك كتبتي الحافظون فيقول لا يا رب ‏.‏ فيقول أفلك عذر فيقول لا يا رب ‏.‏ فيقول بلى إن لك عندنا حسنة فإنه لا ظلم عليك اليوم فتخرج بطاقة فيها أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فيقول احضر وزنك فيقول يا رب ما هذه البطاقة مع هذه السجلات فقال إنك لا تظلم ‏.‏ قال فتوضع السجلات في كفة والبطاقة في كفة فطاشت السجلات وثقلت البطاقة فلا يثقل مع اسم الله شيء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ حدثنا قتيبة، حدثنا ابن لهيعة، عن عامر بن يحيى، بهذا الإسناد نحوه بمعناه ‏.‏ والبطاقة هي القطعة ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2640,
			"arabicnumber": 2640,
			"text": "حدثنا الحسين بن حريث أبو عمار، حدثنا الفضل بن موسى، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تفرقت اليهود على إحدى وسبعين أو اثنتين وسبعين فرقة والنصارى مثل ذلك وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن عمرو وعوف بن مالك ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2641,
			"arabicnumber": 2641,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان الثوري، عن عبد الرحمن بن زياد بن أنعم الإفريقي، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليأتين على أمتي ما أتى على بني إسرائيل حذو النعل بالنعل حتى إن كان منهم من أتى أمه علانية لكان في أمتي من يصنع ذلك وإن بني إسرائيل تفرقت على ثنتين وسبعين ملة وتفترق أمتي على ثلاث وسبعين ملة كلهم في النار إلا ملة واحدة قالوا ومن هي يا رسول الله قال ما أنا عليه وأصحابي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث مفسر حسن غريب لا نعرفه مثل هذا إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2642,
			"arabicnumber": 2642,
			"text": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، قال سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الله عز وجل خلق خلقه في ظلمة فألقى عليهم من نوره فمن أصابه من ذلك النور اهتدى ومن أخطأه ضل فلذلك أقول جف القلم على علم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2643,
			"arabicnumber": 2643,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حقه عليهم أن يعبدوه ولا يشركوا به شيئا ‏\"‏ ‏.‏ قال ‏\"‏ فتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن معاذ بن جبل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2644,
			"arabicnumber": 2644,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن حبيب بن أبي ثابت، وعبد العزيز بن رفيع، والأعمش، كلهم سمعوا زيد بن وهب، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل فبشرني فأخبرني أنه من مات لا يشرك بالله شيئا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي الدرداء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 39
			}
		}
	]
}