{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3370,
			"arabicnumber": 3370,
			"text": "حدثنا عباس بن عبد العظيم العنبري، وغير، واحد، قالوا حدثنا أبو داود الطيالسي، حدثنا عمران القطان، عن قتادة، عن سعيد بن أبي الحسن، عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس شيء أكرم على الله تعالى من الدعاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه مرفوعا إلا من حديث عمران القطان وعمران القطان هو ابن داور ويكنى أبا العوام ‏.‏ حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن عمران القطان، بهذا الإسناد نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3371,
			"arabicnumber": 3371,
			"text": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، عن ابن لهيعة، عن عبيد الله بن أبي جعفر، عن أبان بن صالح، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الدعاء مخ العبادة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه لا نعرفه إلا من حديث ابن لهيعة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3372,
			"arabicnumber": 3372,
			"text": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن الأعمش، عن ذر، عن يسيع، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم قال ‏\"‏ الدعاء هو العبادة ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏وقال ربكم ادعوني أستجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين ‏)‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه منصور والأعمش عن ذر ولا نعرفه إلا من حديث ذر ‏.‏ هو ذر بن عبد الله الهمداني ثقة والد عمر بن ذر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3373,
			"arabicnumber": 3373,
			"text": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن أبي المليح، عن أبي صالح، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من لم يسأل الله يغضب عليه ‏\"‏ ‏.‏ قال وروى وكيع وغير واحد عن أبي المليح هذا الحديث ولا نعرفه إلا من هذا الوجه وأبو المليح اسمه صبيح سمعت محمدا يقوله وقال يقال له الفارسي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3374,
			"arabicnumber": 3374,
			"text": "حدثنا محمد بن بشار حدثنا مرحوم بن عبد العزيز العطار حدثنا أبو نعامة السعدي عن أبي عثمان النهدي عن أبي موسى الأشعري رضي الله عنه قال كنا مع رسول الله صلى الله عليه وسلم في غزاة فلما قفلنا أشرفنا على المدينة فكبر الناس تكبيرة ورفعوا بها أصواتهم فقال رسول الله صلى الله عليه وسلم إن ربكم ليس بأصم ولا غائب هو بينكم وبين رءوس رحالكم ثم قال يا عبد الله بن قيس ألا أعلمك كنزا من كنوز الجنة لا حول ولا قوة إلا بالله قال أبو عيسى هذا حديث حسن وأبو عثمان النهدي اسمه عبد الرحمن بن مل وأبو نعامة السعدي اسمه عمرو بن عيسى. حدثنا إسحاق بن منصور، حدثنا أبو عاصم، عن حميد أبي المليح، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3375,
			"arabicnumber": 3375,
			"text": "حدثنا أبو كريب، حدثنا زيد بن حباب، عن معاوية بن صالح، عن عمرو بن قيس، عن عبد الله بن بسر، رضى الله عنه أن رجلا، قال يا رسول الله إن شرائع الإسلام قد كثرت على فأخبرني بشيء أتشبث به ‏.‏ قال ‏ \"‏ لا يزال لسانك رطبا من ذكر الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3376,
			"arabicnumber": 3376,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن دراج، عن أبي الهيثم، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم سئل أى العباد أفضل درجة عند الله يوم القيامة قال ‏\"‏ الذاكرون الله كثيرا والذاكرات ‏\"‏ ‏.‏ قلت يا رسول الله ومن الغازي في سبيل الله قال ‏\"‏ لو ضرب بسيفه في الكفار والمشركين حتى ينكسر ويختضب دما لكان الذاكرون الله كثيرا أفضل منه درجة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث دراج ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3377,
			"arabicnumber": 3377,
			"text": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الله بن سعيد، هو ابن أبي هند عن زياد، مولى ابن عياش عن أبي بحرية، عن أبي الدرداء، رضي الله عنه قال قال النبي صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بخير أعمالكم وأزكاها عند مليككم وأرفعها في درجاتكم وخير لكم من إنفاق الذهب والورق وخير لكم من أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ ذكر الله تعالى ‏\"‏ ‏.‏ فقال معاذ بن جبل رضى الله عنه ما شيء أنجى من عذاب الله من ذكر الله ‏.‏ قال أبو عيسى وقد روى بعضهم هذا الحديث عن عبد الله بن سعيد مثل هذا بهذا الإسناد وروى بعضهم عنه فأرسله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3378,
			"arabicnumber": 3378,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن أبي إسحاق، عن الأغر أبي مسلم، أنه شهد على أبي هريرة وأبي سعيد الخدري أنهما شهدا على رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ ما من قوم يذكرون الله إلا حفت بهم الملائكة وغشيتهم الرحمة ونزلت عليهم السكينة وذكرهم الله فيمن عنده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا يوسف بن يعقوب، حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، قال سمعت الأغر أبا مسلم، قال أشهد على أبي سعيد وأبي هريرة رضى الله عنهما أنهما شهدا على رسول الله صلى الله عليه وسلم فذكر مثله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3379,
			"arabicnumber": 3379,
			"text": "حدثنا محمد بن بشار، حدثنا مرحوم بن عبد العزيز العطار، حدثنا أبو نعامة، عن أبي عثمان النهدي، عن أبي سعيد الخدري، قال خرج معاوية إلى المسجد فقال ما يجلسكم قالوا جلسنا نذكر الله قال آلله ما أجلسكم إلا ذاك قالوا والله ما أجلسنا إلا ذاك ‏.‏ قال أما إني ما أستحلفكم تهمة لكم وما كان أحد بمنزلتي من رسول الله صلى الله عليه وسلم أقل حديثا عنه مني إن رسول الله صلى الله عليه وسلم خرج على حلقة من أصحابه فقال ‏\"‏ ما يجلسكم ‏\"‏ ‏.‏ قالوا جلسنا نذكر الله ونحمده لما هدانا للإسلام ومن علينا به ‏.‏ فقال ‏\"‏ آلله ما أجلسكم إلا ذاك ‏\"‏ ‏.‏ قالوا آلله ما أجلسنا إلا ذاك ‏.‏ قال ‏\"‏ أما إني لم أستحلفكم لتهمة لكم إنه أتاني جبريل فأخبرني أن الله يباهي بكم الملائكة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه وأبو نعامة السعدي اسمه عمرو بن عيسى وأبو عثمان النهدي اسمه عبد الرحمن بن مل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3380,
			"arabicnumber": 3380,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن صالح، مولى التوأمة عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما جلس قوم مجلسا لم يذكروا الله فيه ولم يصلوا على نبيهم إلا كان عليهم ترة فإن شاء عذبهم وإن شاء غفر لهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ومعنى قوله ترة يعني حسرة وندامة ‏.‏ وقال بعض أهل المعرفة بالعربية: الترة هو الثأر",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3381,
			"arabicnumber": 3381,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن أبي الزبير، عن جابر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من أحد يدعو بدعاء إلا آتاه الله ما سأل أو كف عنه من السوء مثله ما لم يدع بإثم أو قطيعة رحم ‏\"‏ ‏.‏ وفي الباب عن أبي سعيد وعبادة بن الصامت ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3382,
			"arabicnumber": 3382,
			"text": "حدثنا محمد بن مرزوق، حدثنا عبيد الله بن واقد، حدثنا سعيد بن عطية الليثي، عن شهر بن حوشب، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من سره أن يستجيب الله له عند الشدائد والكرب فليكثر الدعاء في الرخاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3383,
			"arabicnumber": 3383,
			"text": "حدثنا يحيى بن حبيب بن عربي، حدثنا موسى بن إبراهيم بن كثير الأنصاري، قال سمعت طلحة بن خراش، قال سمعت جابر بن عبد الله، رضى الله عنهما يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ أفضل الذكر لا إله إلا الله وأفضل الدعاء الحمد لله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث موسى بن إبراهيم ‏.‏ وقد روى علي بن المديني وغير واحد عن موسى بن إبراهيم هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3384,
			"arabicnumber": 3384,
			"text": "حدثنا أبو كريب، ومحمد بن عبيد المحاربي، قالا حدثنا يحيى بن زكريا بن أبي زائدة، عن أبيه، عن خالد بن سلمة، عن البهي، عن عروة، عن عائشة، رضى الله عنها قالت كان رسول الله صلى الله عليه وسلم يذكر الله على كل أحيانه ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث يحيى بن زكريا بن أبي زائدة والبهي اسمه عبد الله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3385,
			"arabicnumber": 3385,
			"text": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا أبو قطن، عن حمزة الزيات، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان إذا ذكر أحدا فدعا له بدأ بنفسه ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح وأبو قطن اسمه عمرو بن الهيثم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3386,
			"arabicnumber": 3386,
			"text": "حدثنا أبو موسى، محمد بن المثنى وإبراهيم بن يعقوب وغير واحد قالوا حدثنا حماد بن عيسى الجهني، عن حنظلة بن أبي سفيان الجمحي، عن سالم بن عبد الله، عن أبيه، عن عمر بن الخطاب، رضي الله عنه قال كان رسول الله صلى الله عليه وسلم إذا رفع يديه في الدعاء لم يحطهما حتى يمسح بهما وجهه ‏.‏ قال محمد بن المثنى في حديثه لم يردهما حتى يمسح بهما وجهه ‏.‏ قال أبو عيسى هذا حديث صحيح غريب لا نعرفه إلا من حديث حماد بن عيسى ‏.‏ وقد تفرد به وهو قليل الحديث وقد حدث عنه الناس حنظلة بن أبي سفيان ثقة وثقه يحيى بن سعيد القطان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3387,
			"arabicnumber": 3387,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن ابن شهاب، عن أبي عبيد، مولى ابن أزهر عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ يستجاب لأحدكم ما لم يعجل يقول دعوت فلم يستجب لي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو عبيد اسمه سعد وهو مولى عبد الرحمن بن أزهر ويقال مولى عبد الرحمن بن عوف وعبد الرحمن بن أزهر هو ابن عم عبد الرحمن بن عوف ‏.‏ قال وفي الباب عن أنس رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3388,
			"arabicnumber": 3388,
			"text": "حدثنا محمد بن بشار، حدثنا أبو داود، - وهو الطيالسي حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن أبان بن عثمان، قال سمعت عثمان بن عفان، رضى الله عنه يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من عبد يقول في صباح كل يوم ومساء كل ليلة بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم ثلاث مرات فيضره شيء ‏\"‏ ‏.‏ وكان أبان قد أصابه طرف فالج فجعل الرجل ينظر إليه فقال له أبان ما تنظر أما إن الحديث كما حدثتك ولكني لم أقله يومئذ ليمضي الله على قدره ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3389,
			"arabicnumber": 3389,
			"text": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، عن أبي سعد، سعيد بن المرزبان عن أبي سلمة، عن ثوبان، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قال حين يمسي رضيت بالله ربا وبالإسلام دينا وبمحمد نبيا كان حقا على الله أن يرضيه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3390,
			"arabicnumber": 3390,
			"text": "حدثنا سفيان بن وكيع، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان النبي صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله ولا إله إلا الله وحده لا شريك له أراه قال فيها له الملك وله الحمد وهو على كل شيء قدير أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر هذه الليلة وشر ما بعدها وأعوذ بك من الكسل وسوء الكبر وأعوذ بك من عذاب النار وعذاب القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله والحمد لله ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة بهذا الإسناد عن ابن مسعود لم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3391,
			"arabicnumber": 3391,
			"text": "حدثنا علي بن حجر، حدثنا عبد الله بن جعفر، أخبرنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يعلم أصحابه يقول ‏ \"‏ إذا أصبح أحدكم فليقل اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك المصير ‏.‏ وإذا أمسى فليقل اللهم بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك النشور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3392,
			"arabicnumber": 3392,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن يعلى بن عطاء، قال سمعت عمرو بن عاصم الثقفي، يحدث عن أبي هريرة، رضى الله عنه قال قال أبو بكر يا رسول الله مرني بشيء أقوله إذا أصبحت وإذا أمسيت قال ‏ \"‏ قل اللهم عالم الغيب والشهادة فاطر السموات والأرض رب كل شيء ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه قال قله إذا أصبحت وإذا أمسيت وإذا أخذت مضجعك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3393,
			"arabicnumber": 3393,
			"text": "حدثنا الحسين بن حريث، حدثنا عبد العزيز بن أبي حازم، عن كثير بن زيد، عن عثمان بن ربيعة، عن شداد بن أوس، رضى الله عنه أن النبي صلى الله عليه وسلم قال له ‏ \"‏ ألا أدلك على سيد الاستغفار اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت وأبوء إليك بنعمتك على وأعترف بذنوبي فاغفر لي ذنوبي إنه لا يغفر الذنوب إلا أنت ‏.‏ لا يقولها أحدكم حين يمسي فيأتي عليه قدر قبل أن يصبح إلا وجبت له الجنة ولا يقولها حين يصبح فيأتي عليه قدر قبل أن يمسي إلا وجبت له الجنة ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وابن عمر وابن مسعود وابن أبزى وبريدة رضى الله عنهم ‏.‏ قال وهذا حديث حسن غريب ‏.‏ وعبد العزيز بن أبي حازم هو ابن أبي حازم الزاهد ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن شداد بن أوس رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن أبي إسحاق الهمداني، عن البراء بن عازب، أن النبي صلى الله عليه وسلم قال له ‏\"‏ ألا أعلمك كلمات تقولها إذا أويت إلى فراشك فإن مت من ليلتك مت على الفطرة وإن أصبحت أصبحت وقد أصبت خيرا تقول اللهم إني أسلمت نفسي إليك ووجهت وجهي إليك وفوضت أمري إليك رغبة ورهبة إليك وألجأت ظهري إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت وبنبيك الذي أرسلت ‏\"‏ ‏.‏ قال البراء فقلت وبرسولك الذي أرسلت ‏.‏ قال فطعن بيده في صدري ثم قال ‏\"‏ وبنبيك الذي أرسلت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب قد روي من غير وجه عن البراء ‏.‏ ورواه منصور بن المعتمر عن سعد بن عبيدة عن البراء عن النبي صلى الله عليه وسلم نحوه إلا أنه قال إذا أويت إلى فراشك وأنت على وضوء ‏.‏ قال وفي الباب عن رافع بن خديج رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3395,
			"arabicnumber": 3395,
			"text": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن يحيى بن إسحاق ابن أخي، رافع بن خديج عن رافع بن خديج، رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا اضطجع أحدكم على جنبه الأيمن ثم قال اللهم إني أسلمت نفسي إليك ووجهت وجهي إليك وألجأت ظهري إليك وفوضت أمري إليك لا ملجأ ولا منجا منك إلا إليك أومن بكتابك وبرسلك ‏.‏ فإن مات من ليلته دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث رافع بن خديج رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3396,
			"arabicnumber": 3396,
			"text": "حدثنا إسحاق بن منصور، أخبرنا عفان بن مسلم، حدثنا حماد بن سلمة، عن ثابت، عن أنس بن مالك، رضى الله عنه أن رسول الله صلى الله عليه وسلم كان إذا أوى إلى فراشه قال ‏ \"‏ الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا وكم ممن لا كافي له ولا مؤوي ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3397,
			"arabicnumber": 3397,
			"text": "حدثنا صالح بن عبد الله، حدثنا أبو معاوية، عن الوصافي، عن عطية، عن أبي سعيد، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏ \"‏ من قال حين يأوي إلى فراشه أستغفر الله العظيم الذي لا إله إلا هو الحى القيوم وأتوب إليه ‏.‏ ثلاث مرات غفر الله ذنوبه وإن كانت مثل زبد البحر وإن كانت عدد ورق الشجر وإن كانت عدد رمل عالج وإن كانت عدد أيام الدنيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث الوصافي عبيد الله بن الوليد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3398,
			"arabicnumber": 3398,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن ربعي بن حراش، عن حذيفة بن اليمان، رضى الله عنهما أن النبي صلى الله عليه وسلم كان إذا أراد أن ينام وضع يده تحت رأسه ثم قال ‏ \"‏ اللهم قني عذابك يوم تجمع عبادك أو تبعث عبادك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3399,
			"arabicnumber": 3399,
			"text": "حدثنا أبو كريب، أخبرنا إسحاق بن منصور، - هو السلولي عن إبراهيم بن يوسف بن أبي إسحاق، عن أبيه، عن أبي إسحاق، عن أبي بردة، عن البراء بن عازب، رضى الله عنهما قال كان رسول الله صلى الله عليه وسلم يتوسد يمينه عند المنام ثم يقول ‏ \"‏ رب قني عذابك يوم تبعث عبادك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وروى الثوري هذا الحديث عن أبي إسحاق عن البراء لم يذكر بينهما أحدا وروى شعبة عن أبي إسحاق عن أبي عبيدة ورجل آخر عن البراء ‏.‏ وروى إسرائيل عن أبي إسحاق عن عبد الله بن يزيد عن البراء وعن أبي إسحاق عن أبي عبيدة عن عبد الله عن النبي صلى الله عليه وسلم مثله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3400,
			"arabicnumber": 3400,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عمرو بن عون، أخبرنا خالد بن عبد الله، عن سهيل، عن أبيه، عن أبي هريرة، رضى الله عنه قال كان رسول الله صلى الله عليه وسلم يأمرنا إذا أخذ أحدنا مضجعه أن يقول ‏ \"‏ اللهم رب السموات ورب الأرضين وربنا ورب كل شيء وفالق الحب والنوى ومنزل التوراة والإنجيل والقرآن أعوذ بك من شر كل ذي شر أنت آخذ بناصيته أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء والظاهر فليس فوقك شيء والباطن فليس دونك شيء اقض عني الدين وأغنني من الفقر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3401,
			"arabicnumber": 3401,
			"text": "حدثنا ابن أبي عمر المكي، حدثنا سفيان، عن ابن عجلان، عن سعيد المقبري، عن أبي هريرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا قام أحدكم عن فراشه ثم رجع إليه فلينفضه بصنفة إزاره ثلاث مرات فإنه لا يدري ما خلفه عليه بعده فإذا اضطجع فليقل باسمك ربي وضعت جنبي وبك أرفعه فإن أمسكت نفسي فارحمها وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين ‏.‏ فإذا استيقظ فليقل الحمد لله الذي عافاني في جسدي ورد على روحي وأذن لي بذكره ‏\"‏ ‏.‏ قال وفي الباب عن جابر وعائشة ‏.‏ قال حديث أبي هريرة حديث حسن ‏.‏ وروى بعضهم هذا الحديث وقال فلينفضه بداخلة إزاره ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3402,
			"arabicnumber": 3402,
			"text": "حدثنا قتيبة، حدثنا المفضل بن فضالة، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما فقرأ فيهما ‏:‏ ‏(‏ قل هو الله أحد ‏)‏ و ‏:‏ ‏(‏ قل أعوذ برب الفلق ‏)‏ و ‏:‏ ‏(‏ قل أعوذ برب الناس ‏)‏ ثم يمسح بهما ما استطاع من جسده يبدأ بهما على رأسه ووجهه وما أقبل من جسده يفعل ذلك ثلاث مرات ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3403,
			"arabicnumber": 3403,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أخبرنا شعبة، عن أبي إسحاق، عن رجل، عن فروة بن نوفل، رضى الله عنه أنه أتى النبي صلى الله عليه وسلم فقال يا رسول الله علمني شيئا أقوله إذا أويت إلى فراشي قال ‏\"‏ اقرأ ‏:‏ ‏(‏ قل يا أيها الكافرون ‏)‏ فإنها براءة من الشرك ‏\"‏ ‏.‏ قال شعبة أحيانا يقول مرة وأحيانا لا يقولها ‏.‏ حدثنا موسى بن حزام، أخبرنا يحيى بن آدم، عن إسرائيل، عن أبي إسحاق، عن فروة بن نوفل، عن أبيه، أنه أتى النبي صلى الله عليه وسلم فذكر نحوه بمعناه وهذا أصح ‏.‏ قال أبو عيسى وروى زهير هذا الحديث عن أبي إسحاق عن فروة بن نوفل عن أبيه عن النبي صلى الله عليه وسلم نحوه وهذا أشبه وأصح من حديث شعبة ‏.‏ وقد اضطرب أصحاب أبي إسحاق في هذا الحديث ‏.‏ وقد روي هذا الحديث من غير هذا الوجه قد رواه عبد الرحمن بن نوفل عن أبيه عن النبي صلى الله عليه وسلم وعبد الرحمن هو أخو فروة بن نوفل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3404,
			"arabicnumber": 3404,
			"text": "حدثنا هشام بن يونس الكوفي، حدثنا المحاربي، عن ليث، عن أبي الزبير، عن جابر، رضى الله عنه قال كان النبي صلى الله عليه وسلم لا ينام حتى يقرأ بتنزيل السجدة وبتبارك ‏.‏ قال أبو عيسى هكذا روى سفيان وغير واحد هذا الحديث عن ليث عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم نحوه ‏.‏ وروى زهير هذا الحديث عن أبي الزبير قال قلت له سمعته من جابر قال لم أسمعه من جابر إنما سمعته من صفوان أو ابن صفوان ‏.‏ وروى شبابة عن مغيرة بن مسلم عن أبي الزبير عن جابر نحو حديث ليث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3405,
			"arabicnumber": 3405,
			"text": "حدثنا صالح بن عبد الله، حدثنا حماد بن زيد، عن أبي لبابة، قال قالت عائشة رضى الله عنها كان النبي صلى الله عليه وسلم لا ينام حتى يقرأ الزمر وبني إسرائيل ‏.‏ أخبرني محمد بن إسماعيل قال أبو لبابة هذا اسمه مروان مولى عبد الرحمن بن زياد وسمع من عائشة سمع منه حماد بن زيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3406,
			"arabicnumber": 3406,
			"text": "حدثنا علي بن حجر، أخبرنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الله بن أبي بلال، عن العرباض بن سارية، رضى الله عنه أن النبي صلى الله عليه وسلم كان لا ينام حتى يقرأ المسبحات ويقول ‏ \"‏ فيها آية خير من ألف آية ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3407,
			"arabicnumber": 3407,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن الجريري، عن أبي العلاء بن الشخير، عن رجل، من بني حنظلة قال صحبت شداد بن أوس رضى الله عنه في سفر فقال ألا أعلمك ما كان رسول الله صلى الله عليه وسلم يعلمنا أن نقول اللهم إني أسألك الثبات في الأمر وأسألك عزيمة الرشد وأسألك شكر نعمتك وحسن عبادتك وأسألك لسانا صادقا وقلبا سليما وأعوذ بك من شر ما تعلم وأسألك من خير ما تعلم وأستغفرك مما تعلم إنك أنت علام الغيوب ‏.‏ قال وكان رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما من مسلم يأخذ مضجعه يقرأ سورة من كتاب الله إلا وكل الله به ملكا فلا يقربه شيء يؤذيه حتى يهب متى هب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إنما نعرفه من هذا الوجه والجريري هو سعيد بن إياس أبو مسعود الجريري وأبو العلاء اسمه يزيد بن عبد الله بن الشخير ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3408,
			"arabicnumber": 3408,
			"text": "حدثنا أبو الخطاب، زياد بن يحيى البصري حدثنا أزهر السمان، عن ابن عون، عن ابن سيرين، عن عبيدة، عن علي، رضى الله عنه قال شكت إلى فاطمة مجل يديها من الطحين فقلت لو أتيت أباك فسألتيه خادما فقال ‏ \"‏ ألا أدلكما على ما هو خير لكما من الخادم إذا أخذتما مضجعكما تقولان ثلاثا وثلاثين وثلاثا وثلاثين وأربعا وثلاثين من تحميد وتسبيح وتكبير ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عون وقد روي هذا الحديث من غير وجه عن علي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3409,
			"arabicnumber": 3409,
			"text": "حدثنا محمد بن يحيى، حدثنا أزهر السمان، عن ابن عون، عن محمد، عن عبيدة، عن علي، رضى الله عنه قال جاءت فاطمة إلى النبي صلى الله عليه وسلم تشكو مجلا بيديها فأمرها بالتسبيح والتكبير والتحميد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3410,
			"arabicnumber": 3410,
			"text": "حدثنا أحمد بن منيع، حدثنا إسماعيل ابن علية، حدثنا عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، رضى الله عنهما قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خلتان لا يحصيهما رجل مسلم إلا دخل الجنة ألا وهما يسير ومن يعمل بهما قليل يسبح الله في دبر كل صلاة عشرا ويحمده عشرا ويكبره عشرا ‏\"‏ ‏.‏ قال فأنا رأيت رسول الله صلى الله عليه وسلم يعقدها بيده قال ‏\"‏ فتلك خمسون ومائة باللسان وألف وخمسمائة في الميزان وإذا أخذت مضجعك تسبحه وتكبره وتحمده مائة فتلك مائة باللسان وألف في الميزان فأيكم يعمل في اليوم والليلة ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قالوا وكيف لا يحصيها قال ‏\"‏ يأتي أحدكم الشيطان وهو في صلاته فيقول اذكر كذا اذكر كذا ‏.‏ حتى ينفتل فلعله أن لا يفعل ويأتيه وهو في مضجعه فلا يزال ينومه حتى ينام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روى شعبة والثوري عن عطاء بن السائب هذا الحديث ‏.‏ وروى الأعمش هذا الحديث عن عطاء بن السائب مختصرا ‏.‏ وفي الباب عن زيد بن ثابت وأنس وابن عباس رضى الله عنهم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3411,
			"arabicnumber": 3411,
			"text": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا عثام بن علي، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، رضى الله عنهما قال رأيت رسول الله صلى الله عليه وسلم يعقد التسبيح ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث الأعمش ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3412,
			"arabicnumber": 3412,
			"text": "حدثنا محمد بن إسماعيل بن سمرة الأحمسي الكوفي، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ معقبات لا يخيب قائلهن يسبح الله في دبر كل صلاة ثلاثا وثلاثين ويحمده ثلاثا وثلاثين ويكبره أربعا وثلاثين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وعمرو بن قيس الملائي ثقة حافظ ‏.‏ وروى شعبة هذا الحديث عن الحكم ولم يرفعه ‏.‏ ورواه منصور بن المعتمر عن الحكم ورفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3413,
			"arabicnumber": 3413,
			"text": "حدثنا يحيى بن خلف، حدثنا ابن أبي عدي، عن هشام بن حسان، عن محمد بن سيرين، عن كثير بن أفلح، عن زيد بن ثابت، رضى الله عنه قال أمرنا أن نسبح دبر كل صلاة ثلاثا وثلاثين ونحمده ثلاثا وثلاثين ونكبره أربعا وثلاثين ‏.‏ قال فرأى رجل من الأنصار في المنام فقال أمركم رسول الله صلى الله عليه وسلم أن تسبحوا في دبر كل صلاة ثلاثا وثلاثين وتحمدوا الله ثلاثا وثلاثين وتكبروا أربعا وثلاثين قال نعم ‏.‏ قال فاجعلوا خمسا وعشرين واجعلوا التهليل معهن فغدا على النبي صلى الله عليه وسلم فحدثه فقال ‏ \"‏ افعلوا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3414,
			"arabicnumber": 3414,
			"text": "حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، رضى الله عنه عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير وسبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم قال رب اغفر لي أو قال ثم دعا استجيب له فإن عزم فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3415,
			"arabicnumber": 3415,
			"text": "حدثنا علي بن حجر حدثنا مسلمة بن عمرو قال كان عمير بن هانئ يصلي كل يوم ألف سجدة ويسبح مائة ألف تسبيحة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3416,
			"arabicnumber": 3416,
			"text": "حدثنا إسحاق بن منصور، أخبرنا النضر بن شميل، ووهب بن جرير، وأبو عامر العقدي وعبد الصمد بن عبد الوارث قالوا حدثنا هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلمة، حدثني ربيعة بن كعب الأسلمي، قال كنت أبيت عند باب النبي صلى الله عليه وسلم فأعطيه وضوءه فأسمعه الهوي من الليل يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ وأسمعه الهوي من الليل يقول ‏\"‏ الحمد لله رب العالمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3417,
			"arabicnumber": 3417,
			"text": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد، حدثنا أبي، عن عبد الملك بن عمير، عن ربعي، عن حذيفة بن اليمان، رضى الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا أراد أن ينام قال ‏\"‏ اللهم باسمك أموت وأحيا ‏\"‏ ‏.‏ وإذا استيقظ قال ‏\"‏ الحمد لله الذي أحيا نفسي بعد ما أماتها وإليه النشور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3418,
			"arabicnumber": 3418,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن أبي الزبير، عن طاوس، عن عبد الله بن عباس، رضى الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا قام إلى الصلاة من جوف الليل يقول ‏ \"‏ اللهم لك الحمد أنت نور السموات والأرض ولك الحمد أنت قيام السموات والأرض ولك الحمد أنت رب السموات والأرض ومن فيهن أنت الحق ووعدك الحق ولقاؤك حق والجنة حق والنار حق والساعة حق اللهم لك أسلمت وبك آمنت وعليك توكلت وإليك أنبت وبك خاصمت وإليك حاكمت فاغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن ابن عباس عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3419,
			"arabicnumber": 3419,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن عمران بن أبي ليلى، حدثني أبي، حدثني ابن أبي ليلى، عن داود بن علي، هو ابن عبد الله بن عباس عن أبيه، عن جده ابن عباس، قال سمعت نبي الله صلى الله عليه وسلم يقول ليلة حين فرغ من صلاته ‏ \"‏ اللهم إني أسألك رحمة من عندك تهدي بها قلبي وتجمع بها أمري وتلم بها شعثي وتصلح بها غائبي وترفع بها شاهدي وتزكي بها عملي وتلهمني بها رشدي وترد بها ألفتي وتعصمني بها من كل سوء اللهم أعطني إيمانا ويقينا ليس بعده كفر ورحمة أنال بها شرف كرامتك في الدنيا والآخرة اللهم إني أسألك الفوز في العطاء ويروى في القضاء ونزل الشهداء وعيش السعداء والنصر على الأعداء اللهم إني أنزل بك حاجتي وإن قصر رأيي وضعف عملي افتقرت إلى رحمتك فأسألك يا قاضي الأمور ويا شافي الصدور كما تجير بين البحور أن تجيرني من عذاب السعير ومن دعوة الثبور ومن فتنة القبور اللهم ما قصر عنه رأيي ولم تبلغه نيتي ولم تبلغه مسألتي من خير وعدته أحدا من خلقك أو خير أنت معطيه أحدا من عبادك فإني أرغب إليك فيه وأسألكه برحمتك رب العالمين اللهم ذا الحبل الشديد والأمر الرشيد أسألك الأمن يوم الوعيد والجنة يوم الخلود مع المقربين الشهود الركع السجود الموفين بالعهود إنك رحيم ودود وأنت تفعل ما تريد اللهم اجعلنا هادين مهتدين غير ضالين ولا مضلين سلما لأوليائك وعدوا لأعدائك نحب بحبك من أحبك ونعادي بعداوتك من خالفك اللهم هذا الدعاء وعليك الاستجابة وهذا الجهد وعليك التكلان اللهم اجعل لي نورا في قبري ونورا في قلبي ونورا من بين يدى ونورا من خلفي ونورا عن يميني ونورا عن شمالي ونورا من فوقي ونورا من تحتي ونورا في سمعي ونورا في بصري ونورا في شعري ونورا في بشري ونورا في لحمي ونورا في دمي ونورا في عظامي اللهم أعظم لي نورا وأعطني نورا واجعل لي نورا سبحان الذي تعطف العز وقال به سبحان الذي لبس المجد وتكرم به سبحان الذي لا ينبغي التسبيح إلا له سبحان ذي الفضل والنعم سبحان ذي المجد والكرم سبحان ذي الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث ابن أبي ليلى من هذا الوجه ‏.‏ وقد روى شعبة وسفيان الثوري عن سلمة بن كهيل عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم بعض هذا الحديث ولم يذكره بطوله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3420,
			"arabicnumber": 3420,
			"text": "حدثنا يحيى بن موسى، وغير، واحد، قالوا أخبرنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا يحيى بن أبي كثير، حدثنا أبو سلمة، قال سألت عائشة رضى الله عنها بأى شيء كان النبي صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل قالت كان إذا قام من الليل افتتح صلاته فقال ‏ \"‏ اللهم رب جبريل وميكائيل وإسرافيل فاطر السموات والأرض وعالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3421,
			"arabicnumber": 3421,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يوسف بن الماجشون، حدثني أبي، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم كان إذا قام إلى الصلاة قال ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها إنه لا يصرف عني سيئها إلا أنت آمنت بك تباركت وتعاليت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ فإذا ركع قال ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت خشع لك سمعي وبصري ومخي وعظامي وعصبي ‏\"‏ ‏.‏ فإذا رفع رأسه قال ‏\"‏ اللهم ربنا لك الحمد ملء السموات والأرضين وملء ما بينهما وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ فإذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت سجد وجهي للذي خلقه فصوره وشق سمعه وبصره فتبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ثم يكون آخر ما يقول بين التشهد والسلام ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3422,
			"arabicnumber": 3422,
			"text": "حدثنا الحسن بن علي الخلال، حدثنا أبو الوليد الطيالسي، حدثنا عبد العزيز بن أبي سلمة، ويوسف بن الماجشون، قال عبد العزيز حدثني عمي، وقال، يوسف أخبرني أبي، حدثني الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم كان إذا قام إلى الصلاة قال ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك والخير كله في يديك والشر ليس إليك أنا بك وإليك تباركت وتعاليت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ فإذا ركع قال ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت خشع لك سمعي وبصري وعظامي وعصبي ‏\"‏ ‏.‏ فإذا رفع قال ‏\"‏ اللهم ربنا لك الحمد ملء السماء وملء الأرض وملء ما بينهما وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ فإذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت سجد وجهي للذي خلقه فصوره وشق سمعه وبصره فتبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ثم يقول من آخر ما يقول بين التشهد والتسليم ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أسرفت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3423,
			"arabicnumber": 3423,
			"text": "حدثنا الحسن بن علي الخلال، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة رفع يديه حذو منكبيه ويصنع ذلك أيضا إذا قضى قراءته وأراد أن يركع ويصنعها إذا رفع رأسه من الركوع ولا يرفع يديه في شيء من صلاته وهو قاعد وإذا قام من سجدتين رفع يديه كذلك فكبر ويقول حين يفتتح الصلاة بعد التكبير ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت سبحانك أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك وأنا بك وإليك ولا منجا منك ولا ملجأ إلا إليك أستغفرك وأتوب إليك ‏\"‏ ‏.‏ ثم يقرأ فإذا ركع كان كلامه في ركوعه أن يقول ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت وأنت ربي خشع سمعي وبصري ومخي وعظمي لله رب العالمين ‏\"‏ ‏.‏ فإذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يتبعها ‏\"‏ اللهم ربنا ولك الحمد ملء السموات والأرض وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ وإذا سجد قال في سجوده ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت وأنت ربي سجد وجهي للذي خلقه وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند الشافعي وبعض أصحابنا ‏.‏ قال أبو عيسى وأحمد لا يراه وقال بعض أهل العلم من أهل الكوفة وغيرهم يقول هذا في صلاة التطوع ولا يقوله في المكتوبة ‏.‏ سمعت أبا إسماعيل الترمذي محمد بن إسماعيل بن يوسف يقول سمعت سليمان بن داود الهاشمي يقول وذكر هذا الحديث فقال هذا عندنا مثل حديث الزهري عن سالم عن أبيه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3424,
			"arabicnumber": 3424,
			"text": "حدثنا قتيبة، حدثنا محمد بن يزيد بن خنيس، حدثنا الحسن بن محمد بن عبيد الله بن أبي يزيد، قال قال لي ابن جريج أخبرني عبيد الله بن أبي يزيد، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله رأيتني الليلة وأنا نائم كأني أصلي خلف شجرة فسجدت الشجرة لسجودي وسمعتها وهي تقول اللهم اكتب لي بها عندك أجرا وضع عني بها وزرا واجعلها لي عندك ذخرا وتقبلها مني كما تقبلتها من عبدك داود ‏.‏ قال ابن جريج قال لي جدك قال ابن عباس فقرأ النبي صلى الله عليه وسلم سجدة ثم سجد ‏.‏ قال ابن عباس فسمعته وهو يقول مثل ما أخبر الرجل عن قول الشجرة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وفي الباب عن أبي سعيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3425,
			"arabicnumber": 3425,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، حدثنا خالد الحذاء، عن أبي العالية، عن عائشة، قالت كان النبي صلى الله عليه وسلم يقول في سجود القرآن بالليل ‏ \"‏ سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3426,
			"arabicnumber": 3426,
			"text": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا أبي، حدثنا ابن جريج، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قال - يعني إذا خرج من بيته - بسم الله توكلت على الله لا حول ولا قوة إلا بالله ‏.‏ يقال له كفيت ووقيت ‏.‏ وتنحى عنه الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3427,
			"arabicnumber": 3427,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن منصور، عن عامر الشعبي، عن أم سلمة، أن النبي صلى الله عليه وسلم كان إذا خرج من بيته قال ‏ \"‏ بسم الله توكلت على الله اللهم إنا نعوذ بك من أن نزل أو نضل أو نظلم أو نظلم أو نجهل أو يجهل علينا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3428,
			"arabicnumber": 3428,
			"text": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا أزهر بن سنان، حدثنا محمد بن واسع، قال قدمت مكة فلقيني أخي سالم بن عبد الله بن عمر فحدثني عن أبيه عن جده أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من دخل السوق فقال لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو حى لا يموت بيده الخير وهو على كل شيء قدير كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة ورفع له ألف ألف درجة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد رواه عمرو بن دينار - وهو قهرمان آل الزبير عن سالم بن عبد الله، هذا الحديث نحوه",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3429,
			"arabicnumber": 3429,
			"text": "حدثنا بذلك، أحمد بن عبدة الضبي حدثنا حماد بن زيد، والمعتمر بن سليمان، قالا حدثنا عمرو بن دينار، وهو قهرمان آل الزبير عن سالم بن عبد الله بن عمر، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قال في السوق لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو حى لا يموت بيده الخير وهو على كل شيء قدير كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة وبنى له بيتا في الجنة ‏\"‏ ‏.‏ قال أبو عيسى وعمرو بن دينار هذا هو شيخ بصري وقد تكلم فيه بعض أصحاب الحديث وقد روى عن سالم بن عبد الله بن عمر أحاديث لا يتابع عليها وقد روي هذا الحديث من غير هذا الوجه ‏.‏ ورواه يحيى بن سليم الطائفي عن عمران بن مسلم عن عبد الله بن دينار عن ابن عمر عن النبي صلى الله عليه وسلم ولم يذكر فيه عن عمر رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3430,
			"arabicnumber": 3430,
			"text": "حدثنا سفيان بن وكيع، حدثنا إسماعيل بن محمد بن جحادة، حدثنا عبد الجبار بن عباس، عن أبي إسحاق، عن الأغر أبي مسلم، قال أشهد على أبي سعيد وأبي هريرة أنهما شهدا على النبي صلى الله عليه وسلم قال ‏ \"‏ من قال لا إله إلا الله والله أكبر ‏.‏ صدقه ربه فقال لا إله إلا أنا وأنا أكبر ‏.‏ وإذا قال لا إله إلا الله وحده ‏.‏ قال يقول الله لا إله إلا أنا وأنا وحدي ‏.‏ وإذا قال لا إله إلا الله وحده لا شريك له ‏.‏ قال الله لا إله إلا أنا وحدي لا شريك لي ‏.‏ وإذا قال لا إله إلا الله له الملك وله الحمد ‏.‏ قال الله لا إله إلا أنا لي الملك ولي الحمد ‏.‏ وإذا قال لا إله إلا الله ولا حول ولا قوة إلا بالله ‏.‏ قال الله لا إله إلا أنا ولا حول ولا قوة إلا بي ‏.‏ وكان يقول من قالها في مرضه ثم مات لم تطعمه النار ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وقد رواه شعبة عن أبي إسحاق، عن الأغر أبي مسلم، عن أبي هريرة، وأبي، سعيد بنحو هذا الحديث بمعناه ولم يرفعه شعبة ‏.‏ حدثنا بذلك، بندار حدثنا محمد بن جعفر، عن شعبة، بهذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3431,
			"arabicnumber": 3431,
			"text": "حدثنا محمد بن عبد الله بن بزيع، حدثنا عبد الوارث بن سعيد، عن عمرو بن دينار، مولى آل الزبير عن سالم بن عبد الله بن عمر، عن ابن عمر، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من رأى صاحب بلاء فقال الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلا إلا عوفي من ذلك البلاء كائنا ما كان ما عاش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وفي الباب عن أبي هريرة ‏.‏ وعمرو بن دينار قهرمان آل الزبير هو شيخ بصري وليس هو بالقوي في الحديث ‏.‏ وقد تفرد بأحاديث عن سالم بن عبد الله بن عمر ‏.‏ وقد روي عن أبي جعفر محمد بن علي أنه قال إذا رأى صاحب بلاء فتعوذ منه يقول ذلك في نفسه ولا يسمع صاحب البلاء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3432,
			"arabicnumber": 3432,
			"text": "حدثنا أبو جعفر السمناني، وغير، واحد، قالوا حدثنا مطرف بن عبد الله المدني، حدثنا عبد الله بن عمر العمري، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من رأى مبتلى فقال الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلا لم يصبه ذلك البلاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3433,
			"arabicnumber": 3433,
			"text": "حدثنا أبو عبيدة بن أبي السفر الكوفي، - واسمه أحمد بن عبد الله الهمداني حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني موسى بن عقبة، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من جلس في مجلس فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ‏.‏ إلا غفر له ما كان في مجلسه ذلك ‏\"‏ ‏.‏ وفي الباب عن أبي برزة وعائشة ‏.‏ قال هذا حديث حسن غريب صحيح من هذا الوجه لا نعرفه من حديث سهيل إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3434,
			"arabicnumber": 3434,
			"text": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا المحاربي، عن مالك بن مغول، عن محمد بن سوقة، عن نافع، عن ابن عمر، قال كان يعد لرسول الله صلى الله عليه وسلم في المجلس الواحد مائة مرة من قبل أن يقوم ‏ \"‏ رب اغفر لي وتب على إنك أنت التواب الغفور ‏\"‏ ‏.‏ حدثنا ابن أبي عمر، حدثنا سفيان، عن محمد بن سوقة، بهذا الإسناد نحوه بمعناه ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3435,
			"arabicnumber": 3435,
			"text": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي العالية، عن ابن عباس، أن نبي الله صلى الله عليه وسلم كان يدعو عند الكرب ‏ \"‏ لا إله إلا الله العلي الحليم لا إله إلا الله رب العرش العظيم لا إله إلا الله رب السموات والأرض ورب العرش الكريم ‏\"‏ ‏.‏ حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن هشام، عن قتادة، عن أبي العالية، عن ابن عباس، عن النبي صلى الله عليه وسلم بمثله ‏.‏ قال وفي الباب عن علي ‏.‏ قال وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3436,
			"arabicnumber": 3436,
			"text": "حدثنا أبو سلمة، يحيى بن المغيرة المخزومي المدني وغير واحد قالوا حدثنا ابن أبي فديك، عن إبراهيم بن الفضل، عن المقبري، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان إذا أهمه الأمر رفع رأسه إلى السماء فقال ‏\"‏ سبحان الله العظيم ‏\"‏ ‏.‏ وإذا اجتهد في الدعاء قال ‏\"‏ يا حى يا قيوم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3437,
			"arabicnumber": 3437,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن الحارث بن يعقوب، عن يعقوب بن عبد الله بن الأشج، عن بسر بن سعيد، عن سعد بن أبي وقاص، عن خولة بنت حكيم السلمية، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من نزل منزلا ثم قال أعوذ بكلمات الله التامات من شر ما خلق لم يضره شيء حتى يرتحل من منزله ذلك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏ وروى مالك بن أنس هذا الحديث أنه بلغه عن يعقوب بن عبد الله بن الأشج فذكر نحو هذا الحديث ‏.‏ وروي عن ابن عجلان هذا الحديث عن يعقوب بن عبد الله بن الأشج ويقول عن سعيد بن المسيب عن خولة ‏.‏ قال وحديث الليث أصح من رواية ابن عجلان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3438,
			"arabicnumber": 3438,
			"text": "حدثنا محمد بن عمر بن علي المقدمي، حدثنا ابن أبي عدي، عن شعبة، عن عبد الله بن بشر الخثعمي، عن أبي زرعة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم إذا سافر فركب راحلته قال بأصبعه ومد شعبة بأصبعه قال ‏ \"‏ اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم اصحبنا بنصحك واقلبنا بذمة ‏.‏ اللهم ازو لنا الأرض وهون علينا السفر اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب ‏\"‏ ‏.‏ قال أبو عيسى كنت لا أعرف هذا إلا من حديث ابن أبي عدي حتى حدثني به سويد ‏.‏ حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، حدثنا شعبة، بهذا الإسناد نحوه بمعناه ‏.‏ قال هذا حديث حسن غريب من حديث أبي هريرة ولا نعرفه إلا من حديث ابن أبي عدي عن شعبة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3439,
			"arabicnumber": 3439,
			"text": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم الأحول، عن عبد الله بن سرجس، قال كان النبي صلى الله عليه وسلم إذا سافر يقول ‏ \"‏ اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم اصحبنا في سفرنا واخلفنا في أهلنا اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب ومن الحور بعد الكون ومن دعوة المظلوم ومن سوء المنظر في الأهل والمال ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ قال ويروى الحور بعد الكور أيضا قال ومعنى قوله الحور بعد الكون أو الكور وكلاهما له وجه يقال إنما هو الرجوع من الإيمان إلى الكفر أو من الطاعة إلى المعصية إنما يعني الرجوع من شيء إلى شيء من الشر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3440,
			"arabicnumber": 3440,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن أبي إسحاق، قال سمعت الربيع بن البراء بن عازب، يحدث عن أبيه، أن النبي صلى الله عليه وسلم كان إذا قدم من سفر قال ‏ \"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى الثوري هذا الحديث عن أبي إسحاق عن البراء ولم يذكر فيه عن الربيع بن البراء ورواية شعبة أصح ‏.‏ قال وفي الباب عن ابن عمر وأنس وجابر بن عبد الله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3441,
			"arabicnumber": 3441,
			"text": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم كان إذا قدم من سفر فنظر إلى جدرات المدينة أوضع راحلته وإن كان على دابة حركها من حبها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3442,
			"arabicnumber": 3442,
			"text": "حدثنا أحمد بن أبي عبيد الله السليمي البصري، حدثنا أبو قتيبة، سلم بن قتيبة عن إبراهيم بن عبد الرحمن بن يزيد بن أمية، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم إذا ودع رجلا أخذ بيده فلا يدعها حتى يكون الرجل هو يدع يد النبي صلى الله عليه وسلم ويقول ‏ \"‏ أستودع الله دينك وأمانتك وآخر عملك ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه ‏.‏ وروي هذا الحديث من غير وجه عن ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3443,
			"arabicnumber": 3443,
			"text": "حدثنا إسماعيل بن موسى الفزاري، حدثنا سعيد بن خثيم، عن حنظلة، عن سالم، أن ابن عمر، كان يقول للرجل إذا أراد سفرا ادن مني أودعك كما كان رسول الله صلى الله عليه وسلم يودعنا ‏.‏ فيقول ‏ \"‏ أستودع الله دينك وأمانتك وخواتيم عملك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه من حديث سالم بن عبد الله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3444,
			"arabicnumber": 3444,
			"text": "حدثنا عبد الله بن أبي زياد، حدثنا سيار، حدثنا جعفر بن سليمان، عن ثابت، عن أنس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني أريد سفرا فزودني ‏.‏ قال ‏\"‏ زودك الله التقوى ‏\"‏ ‏.‏ قال زدني ‏.‏ قال ‏\"‏ وغفر ذنبك ‏\"‏ ‏.‏ قال زدني بأبي أنت وأمي ‏.‏ قال ‏\"‏ ويسر لك الخير حيثما كنت ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3445,
			"arabicnumber": 3445,
			"text": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، أخبرني أسامة بن زيد، عن سعيد المقبري، عن أبي هريرة، رضى الله عنه أن رجلا، قال يا رسول الله إني أريد أن أسافر فأوصني ‏.‏ قال ‏\"‏ عليك بتقوى الله والتكبير على كل شرف ‏\"‏ ‏.‏ فلما أن ولى الرجل قال ‏\"‏ اللهم اطو له الأرض وهون عليه السفر ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3446,
			"arabicnumber": 3446,
			"text": "حدثنا قتيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن علي بن ربيعة، قال شهدت عليا أتي بدابة ليركبها فلما وضع رجله في الركاب قال بسم الله ثلاثا فلما استوى على ظهرها قال الحمد لله ثم قال ‏:‏ ‏(‏ سبحان الذي سخر لنا هذا وما كنا له مقرنين * وإنا إلى ربنا لمنقلبون ‏)‏ ثم قال الحمد لله ثلاثا والله أكبر ثلاثا سبحانك إني قد ظلمت نفسي فاغفر لي فإنه لا يغفر الذنوب إلا أنت ‏.‏ ثم ضحك ‏.‏ فقلت من أى شيء ضحكت يا أمير المؤمنين قال رأيت رسول الله صلى الله عليه وسلم صنع كما صنعت ثم ضحك فقلت من أى شيء ضحكت يا رسول الله قال ‏\"‏ إن ربك ليعجب من عبده إذا قال رب اغفر لي ذنوبي إنه لا يغفر الذنوب غيرك ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر رضى الله عنهما ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3447,
			"arabicnumber": 3447,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، حدثنا حماد بن سلمة، عن أبي الزبير، عن علي بن عبد الله البارقي، عن ابن عمر، أن النبي صلى الله عليه وسلم كان إذا سافر فركب راحلته كبر ثلاثا ويقول ‏:‏ ‏(‏ سبحان الذي سخر لنا هذا وما كنا له مقرنين * وإنا إلى ربنا لمنقلبون ‏)‏ ثم يقول ‏\"‏ اللهم إني أسألك في سفري هذا من البر والتقوى ومن العمل ما ترضى اللهم هون علينا المسير واطو عنا بعد الأرض اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم اصحبنا في سفرنا واخلفنا في أهلنا ‏\"‏ ‏.‏ وكان يقول إذا رجع إلى أهله ‏\"‏ آيبون إن شاء الله تائبون عابدون لربنا حامدون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3448,
			"arabicnumber": 3448,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا الحجاج الصواف، عن يحيى بن أبي كثير، عن أبي جعفر، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاث دعوات مستجابات دعوة المظلوم ودعوة المسافر ودعوة الوالد على ولده ‏\"‏ ‏.‏ حدثنا علي بن حجر، حدثنا إسماعيل بن إبراهيم، عن هشام الدستوائي، عن يحيى بن أبي كثير، بهذا الإسناد نحوه ‏.‏ وزاد فيه مستجابات لا شك فيهن ‏.‏ قال أبو عيسى هذا حديث حسن وأبو جعفر الرازي هذا الذي روى عنه يحيى بن أبي كثير يقال له أبو جعفر المؤذن وقد روى عنه يحيى بن أبي كثير غير حديث ولا نعرف اسمه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3449,
			"arabicnumber": 3449,
			"text": "حدثنا عبد الرحمن بن الأسود أبو عمرو البصري، حدثنا محمد بن ربيعة، عن ابن جريج، عن عطاء، عن عائشة، رضى الله عنها قالت كان النبي صلى الله عليه وسلم إذا رأى الريح قال ‏ \"‏ اللهم إني أسألك من خيرها وخير ما فيها وخير ما أرسلت به وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبى بن كعب رضى الله عنه وهذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3450,
			"arabicnumber": 3450,
			"text": "حدثنا ��تيبة، حدثنا عبد الواحد بن زياد، عن الحجاج بن أرطاة، عن أبي مطر، عن سالم بن عبد الله بن عمر، عن أبيه، أن رسول الله صلى الله عليه وسلم كان إذا سمع صوت الرعد والصواعق قال ‏ \"‏ اللهم لا تقتلنا بغضبك ولا تهلكنا بعذابك وعافنا قبل ذلك ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3451,
			"arabicnumber": 3451,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا سليمان بن سفيان المدني، حدثني بلال بن يحيى بن طلحة بن عبيد الله، عن أبيه، عن جده، طلحة بن عبيد الله أن النبي صلى الله عليه وسلم كان إذا رأى الهلال قال ‏ \"‏ اللهم أهلله علينا باليمن والإيمان والسلامة والإسلام ربي وربك الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3452,
			"arabicnumber": 3452,
			"text": "حدثنا محمود بن غيلان، حدثنا قبيصة، أخبرنا سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن معاذ بن جبل، رضى الله عنه قال استب رجلان عند النبي صلى الله عليه وسلم حتى عرف الغضب في وجه أحدهما فقال النبي صلى الله عليه وسلم ‏ \"‏ إني لأعلم كلمة لو قالها لذهب غضبه أعوذ بالله من الشيطان الرجيم ‏\"‏ ‏.‏ حدثنا بندار، حدثنا عبد الرحمن، عن سفيان، بهذا الإسناد نحوه ‏.‏ قال وفي الباب عن سليمان بن صرد قال وهذا حديث مرسل ‏.‏ عبد الرحمن بن أبي ليلى لم يسمع من معاذ بن جبل مات معاذ في خلافة عمر بن الخطاب وقتل عمر بن الخطاب وعبد الرحمن بن أبي ليلى غلام ابن ست سنين وهكذا روى شعبة عن الحكم عن عبد الرحمن بن أبي ليلى وقد روى عبد الرحمن بن أبي ليلى عن عمر بن الخطاب ورآه وعبد الرحمن بن أبي ليلى يكنى أبا عيسى وأبو ليلى اسمه يسار وروي عن عبد الرحمن بن أبي ليلى قال أدركت عشرين ومائة من الأنصار من أصحاب النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3453,
			"arabicnumber": 3453,
			"text": "حدثنا قتيبة بن سعيد، حدثنا بكر بن مضر، عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إذا رأى أحدكم الرؤيا يحبها فإنما هي من الله فليحمد الله عليها وليحدث بما رأى وإذا رأى غير ذلك مما يكره فإنما هي من الشيطان فليستعذ بالله من شرها ولا يذكرها لأحد فإنها لا تضره ‏\"‏ ‏.‏ قال وفي الباب عن أبي قتادة ‏.‏ قال وهذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وابن الهاد اسمه يزيد بن عبد الله بن أسامة بن الهاد المدني وهو ثقة روى عنه مالك والناس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3454,
			"arabicnumber": 3454,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، وأخبرنا قتيبة، عن مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، رضى الله عنه قال كان الناس إذا رأوا أول الثمر جاءوا به إلى رسول الله صلى الله عليه وسلم فإذا أخذه رسول الله صلى الله عليه وسلم قال ‏ \"‏ اللهم بارك لنا في ثمارنا وبارك لنا في مدينتنا وبارك لنا في صاعنا ومدنا اللهم إن إبراهيم عبدك وخليلك ونبيك وإني عبدك ونبيك وإنه دعاك لمكة وأنا أدعوك للمدينة بمثل ما دعاك به لمكة ومثله معه ‏\"‏ ‏.‏ ثم يدعو أصغر وليد يراه فيعطيه ذلك الثمر ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3455,
			"arabicnumber": 3455,
			"text": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، حدثنا علي بن زيد، عن عمر، وهو ابن أبي حرملة عن ابن عباس، قال دخلت مع رسول الله صلى الله عليه وسلم أنا وخالد بن الوليد على ميمونة فجاءتنا بإناء من لبن فشرب رسول الله صلى الله عليه وسلم وأنا على يمينه وخالد على شماله فقال لي ‏\"‏ الشربة لك فإن شئت آثرت بها خالدا ‏\"‏ ‏.‏ فقلت ما كنت أوثر على سؤرك أحدا ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ من أطعمه الله الطعام فليقل اللهم بارك لنا فيه وأطعمنا خيرا منه ‏.‏ ومن سقاه الله لبنا فليقل اللهم بارك لنا فيه وزدنا منه ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس شيء يجزي مكان الطعام والشراب غير اللبن ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد روى بعضهم هذا الحديث عن علي بن زيد فقال عن عمر بن حرملة ‏.‏ وقال بعضهم عمرو بن حرملة ولا يصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3456,
			"arabicnumber": 3456,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا ثور بن يزيد، حدثنا خالد بن معدان، عن أبي أمامة، قال كان رسول الله صلى الله عليه وسلم إذا رفعت المائدة من بين يديه يقول ‏ \"‏ الحمد لله حمدا كثيرا طيبا مباركا فيه غير مودع ولا مستغنى عنه ربنا ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3457,
			"arabicnumber": 3457,
			"text": "حدثنا أبو سعيد الأشج، حدثنا حفص بن غياث، وأبو خالد الأحمر عن حجاج بن أرطاة، عن رياح بن عبيدة، قال حفص عن ابن أخي أبي سعيد، وقال أبو خالد، عن مولى، لأبي سعيد عن أبي سعيد، رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا أكل أو شرب قال ‏ \"‏ الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3458,
			"arabicnumber": 3458,
			"text": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، حدثني أبو مرحوم، عن سهل بن معاذ بن أنس، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أكل طعاما فقال الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة ‏.‏ غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب وأبو مرحوم اسمه عبد الرحيم بن ميمون ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3459,
			"arabicnumber": 3459,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن جعفر بن ربيعة، عن الأعرج، عن أبي هريرة، رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا سمعتم صياح الديكة فاسألوا الله من فضله فإنها رأت ملكا وإذا سمعتم نهيق الحمار فتعوذوا بالله من الشيطان الرجيم فإنه رأى شيطانا ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3460,
			"arabicnumber": 3460,
			"text": "حدثنا عبد الله بن أبي زياد الكوفي، حدثنا عبد الله بن أبي بكر السهمي، عن حاتم بن أبي صغيرة، عن أبي بلج، عن عمرو بن ميمون، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما على الأرض أحد يقول لا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ‏.‏ إلا كفرت عنه خطاياه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى شعبة هذا الحديث عن أبي بلج بهذا الإسناد نحوه ولم يرفعه وأبو بلج اسمه يحيى بن أبي سليم ويقال أيضا يحيى بن سليم ‏.‏ حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن حاتم بن أبي صغيرة، عن أبي بلج، عن عمرو بن ميمون، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم نحوه وحاتم يكنى أبا يونس القشيري ‏.‏ حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن أبي بلج، نحوه ولم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3461,
			"arabicnumber": 3461,
			"text": "حدثنا محمد بن بشار، حدثنا مرحوم بن عبد العزيز العطار، حدثنا أبو نعامة السعدي، عن أبي عثمان النهدي، عن أبي موسى الأشعري، قال كنا مع النبي صلى الله عليه وسلم في غزاة فلما قفلنا أشرفنا على المدينة فكبر الناس تكبيرة ورفعوا بها أصواتهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن ربكم ليس بأصم ولا غائب هو بينكم وبين رءوس رحالكم ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا عبد الله بن قيس ألا أعلمك كنزا من كنوز الجنة لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو عثمان النهدي اسمه عبد الرحمن بن مل وأبو نعامة اسمه عمرو بن عيسى ‏.‏ ومعنى قوله بينكم وبين رءوس رحالكم يعني علمه وقدرته ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3462,
			"arabicnumber": 3462,
			"text": "حدثنا عبد الله بن أبي زياد، حدثنا سيار، حدثنا عبد الواحد بن زياد، عن عبد الرحمن بن إسحاق، عن القاسم بن عبد الرحمن، عن أبيه، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لقيت إبراهيم ليلة أسري بي فقال يا محمد أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة عذبة الماء وأنها قيعان وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر ‏\"‏ ‏.‏ قال وفي الباب عن أبي أيوب ‏.‏ قال هذا حديث حسن غريب من هذا الوجه من حديث ابن مسعود ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3463,
			"arabicnumber": 3463,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا موسى الجهني، حدثني مصعب بن سعد، عن أبيه، أن رسول الله صلى الله عليه وسلم قال لجلسائه ‏\"‏ أيعجز أحدكم أن يكسب ألف حسنة ‏\"‏ ‏.‏ فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة قال ‏\"‏ يسبح أحدكم مائة تسبيحة تكتب له ألف حسنة وتحط عنه ألف سيئة ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3464,
			"arabicnumber": 3464,
			"text": "حدثنا أحمد بن منيع، وغير، واحد، قالوا حدثنا روح بن عبادة، عن حجاج الصواف، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من قال سبحان الله العظيم وبحمده ‏.‏ غرست له نخلة في الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث أبي الزبير عن جابر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3465,
			"arabicnumber": 3465,
			"text": "حدثنا محمد بن رافع، حدثنا المؤمل، عن حماد بن سلمة، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3466,
			"arabicnumber": 3466,
			"text": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا المحاربي، عن مالك بن أنس، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قال سبحان الله وبحمده مائة مرة غفرت له ذنوبه وإن كانت مثل زبد البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3467,
			"arabicnumber": 3467,
			"text": "حدثنا يوسف بن عيسى، حدثنا محمد بن الفضيل، عن عمارة بن القعقاع، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن سبحان الله وبحمده سبحان الله العظيم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3468,
			"arabicnumber": 3468,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير في يوم مائة مرة كانت له عدل عشر رقاب وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكان له حرزا من الشيطان يومه ذلك حتى يمسي ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال سبحان الله وبحمده مائة مرة حطت خطاياه وإن كانت أكثر من زبد البحر ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3469,
			"arabicnumber": 3469,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من قال حين يصبح وحين يمسي سبحان الله وبحمده مائة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3470,
			"arabicnumber": 3470,
			"text": "حدثنا إسماعيل بن موسى الكوفي، حدثنا داود بن الزبرقان، عن مطر الوراق، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ذات يوم لأصحابه ‏ \"‏ قولوا سبحان الله وبحمده مائة مرة من قالها مرة كتبت له عشرا ومن قالها عشرا كتبت له مائة ومن قالها مائة كتبت له ألفا ومن زاد زاده الله ومن استغفر غفر الله له ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3471,
			"arabicnumber": 3471,
			"text": "حدثنا محمد بن وزير الواسطي، حدثنا أبو سفيان الحميري، هو سعيد بن يحيى الواسطي عن الضحاك بن حمرة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من سبح الله مائة بالغداة ومائة بالعشي كان كمن حج مائة مرة ومن حمد الله مائة بالغداة ومائة بالعشي كان كمن حمل على مائة فرس في سبيل الله أو قال غزا مائة غزوة ومن هلل الله مائة بالغداة ومائة بالعشي كان كمن أعتق مائة رقبة من ولد إسماعيل ومن كبر الله مائة بالغداة ومائة بالعشي لم يأت في ذلك اليوم أحد بأكثر مما أتى به إلا من قال مثل ما قال أو زاد على ما قال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3472,
			"arabicnumber": 3472,
			"text": "حدثنا الحسين بن الأسود العجلي البغدادي، حدثنا يحيى بن آدم، عن الحسن بن صالح، عن أبي بشر، عن الزهري، قال تسبيحة في رمضان أفضل من ألف تسبيحة في غيره ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad Maqtu"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3473,
			"arabicnumber": 3473,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن الخليل بن مرة، عن الأزهر بن عبد الله، عن تميم الداري، عن رسول الله صلى الله عليه وسلم أنه قال ‏ \"‏ من قال أشهد أن لا إله إلا الله وحده لا شريك له إلها واحدا أحدا صمدا لم يتخذ صاحبة ولا ولدا ولم يكن له كفوا أحد عشر مرات كتب الله له أربعين ألف ألف حسنة ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ والخليل بن مرة ليس بالقوي عند أصحاب الحديث ‏.‏ قال محمد بن إسماعيل هو منكر الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3474,
			"arabicnumber": 3474,
			"text": "حدثنا إسحاق بن منصور، حدثنا علي بن معبد المصري، حدثنا عبيد الله بن عمرو الرقي، عن زيد بن أبي أنيسة، عن شهر بن حوشب، عن عبد الرحمن بن غنم، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قال في دبر صلاة الفجر وهو ثاني رجليه قبل أن يتكلم لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير عشر مرات كتب له عشر حسنات ومحي عنه عشر سيئات ورفع له عشر درجات وكان يومه ذلك في حرز من كل مكروه وحرس من الشيطان ولم ينبغ لذنب أن يدركه في ذلك اليوم إلا الشرك بالله ‏\"‏ ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3475,
			"arabicnumber": 3475,
			"text": "حدثنا جعفر بن محمد بن عمران الثعلبي الكوفي، حدثنا زيد بن حباب، عن مالك بن مغول، عن عبد الله بن بريدة الأسلمي، عن أبيه، قال سمع النبي صلى الله عليه وسلم رجلا يدعو وهو يقول اللهم إني أسألك بأني أشهد أنك أنت الله لا إله إلا أنت الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد ‏.‏ قال فقال ‏ \"‏ والذي نفسي بيده لقد سأل الله باسمه الأعظم الذي إذا دعي به أجاب وإذا سئل به أعطى ‏\"‏ ‏.‏ قال زيد فذكرته لزهير بن معاوية بعد ذلك بسنين فقال حدثني أبو إسحاق عن مالك بن مغول ‏.‏ قال زيد ثم ذكرته لسفيان الثوري فحدثني عن مالك ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى شريك هذا الحديث عن أبي إسحاق عن ابن بريدة عن أبيه وإنما أخذه أبو إسحاق الهمداني عن مالك بن مغول وإنما دلسه ‏.‏ وروى شريك هذا الحديث عن أبي إسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3476,
			"arabicnumber": 3476,
			"text": "حدثنا قتيبة، حدثنا رشدين بن سعد، عن أبي هانئ الخولاني، عن أبي علي الجنبي، عن فضالة بن عبيد، قال بينا رسول الله صلى الله عليه وسلم قاعدا إذ دخل رجل فصلى فقال اللهم اغفر لي وارحمني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ عجلت أيها المصلي إذا صليت فقعدت فاحمد الله بما هو أهله وصل على ثم ادعه ‏\"‏ ‏.‏ قال ثم صلى رجل آخر بعد ذلك فحمد الله وصلى على النبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم ‏\"‏ أيها المصلي ادع تجب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن رواه حيوة بن شريح عن أبي هانئ الخولاني وأبو هانئ اسمه حميد بن هانئ وأبو علي الجنبي اسمه عمرو بن مالك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3477,
			"arabicnumber": 3477,
			"text": "حدثنا محمود بن غيلان، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة بن شريح، حدثني أبو هانئ الخولاني، أن عمرو بن مالك الجنبي، أخبره أنه، سمع فضالة بن عبيد، يقول سمع النبي صلى الله عليه وسلم رجلا يدعو في صلاته فلم يصل على النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ عجل هذا ‏\"‏ ‏.‏ ثم دعاه فقال له أو لغيره ‏\"‏ إذا صلى أحدكم فليبدأ بتحميد الله والثناء عليه ثم ليصل على النبي صلى الله عليه وسلم ثم ليدع بعد بما شاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3478,
			"arabicnumber": 3478,
			"text": "حدثنا علي بن خشرم، حدثنا عيسى بن يونس، عن عبيد الله بن أبي زياد القداح، كذا قال عن شهر بن حوشب، عن أسماء بنت يزيد، أن النبي صلى الله عليه وسلم قال ‏\"‏ اسم الله الأعظم في هاتين الآيتين ‏:‏ ‏(‏ وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم ‏)‏ وفاتحة آل عمران ‏(‏الم * الله لا إله إلا هو الحى القيوم ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3479,
			"arabicnumber": 3479,
			"text": "حدثنا عبد الله بن معاوية الجمحي، - وهو رجل صالح حدثنا صالح المري، عن هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ادعوا الله وأنتم موقنون بالإجابة واعلموا أن الله لا يستجيب دعاء من قلب غافل لاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ سمعت عباسا العنبري يقول اكتبوا عن عبد الله بن معاوية الجمحي فإنه ثقة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3480,
			"arabicnumber": 3480,
			"text": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن حمزة الزيات، عن حبيب بن أبي ثابت، عن عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول ‏ \"‏ اللهم عافني في جسدي وعافني في بصري واجعله الوارث مني لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم والحمد لله رب العالمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال سمعت محمدا يقول حبيب بن أبي ثابت لم يسمع من عروة بن الزبير شيئا وحبيب بن أبي ثابت هو حبيب بن قيس بن دينار وقد أدرك عمر وابن عباس والله أعلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3481,
			"arabicnumber": 3481,
			"text": "حدثنا أبو كريب، حدثنا أبو أسامة، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال جاءت فاطمة إلى النبي صلى الله عليه وسلم تسأله خادما فقال لها ‏ \"‏ قولي اللهم رب السموات السبع ورب العرش العظيم ربنا ورب كل شيء منزل التوراة والإنجيل والقرآن فالق الحب والنوى أعوذ بك من شر كل شيء أنت آخذ بناصيته أنت الأول فليس قبلك شيء وأنت الآخر فليس بعدك شيء وأنت الظاهر فليس فوقك شيء وأنت الباطن فليس دونك شيء اقض عني الدين وأغنني من الفقر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب وهكذا روى بعض أصحاب الأعمش عن الأعمش نحو هذا ‏.‏ وروى بعضهم عن الأعمش عن أبي صالح مرسل ولم يذكر فيه عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3482,
			"arabicnumber": 3482,
			"text": "حدثنا أبو كريب، حدثنا يحيى بن آدم، عن أبي بكر بن عياش، عن الأعمش، عن عمرو بن مرة، عن عبد الله بن الحارث، عن زهير بن الأقمر، عن عبد الله بن عمرو، قال كان رسول الله صلى الله عليه وسلم يقول ‏ \"‏ اللهم إني أعوذ بك من قلب لا يخشع ودعاء لا يسمع ومن نفس لا تشبع ومن علم لا ينفع أعوذ بك من هؤلاء الأربع ‏\"‏ ‏.‏ قال وفي الباب عن جابر وأبي هريرة وابن مسعود ‏.‏ قال وهذا حديث حسن صحيح غريب من هذا الوجه من حديث عبد الله بن عمرو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3483,
			"arabicnumber": 3483,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن شبيب بن شيبة، عن الحسن البصري، عن عمران بن حصين، قال قال النبي صلى الله عليه وسلم لأبي ‏\"‏ يا حصين كم تعبد اليوم إلها ‏\"‏ ‏.‏ قال أبي سبعة ستا في الأرض وواحدا في السماء ‏.‏ قال ‏\"‏ فأيهم تعد لرغبتك ورهبتك ‏\"‏ ‏.‏ قال الذي في السماء ‏.‏ قال ‏\"‏ يا حصين أما إنك لو أسلمت علمتك كلمتين تنفعانك ‏\"‏ ‏.‏ قال فلما أسلم حصين قال يا رسول الله علمني الكلمتين اللتين وعدتني ‏.‏ فقال ‏\"‏ قل اللهم ألهمني رشدي وأعذني من شر نفسي ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وقد روي هذا الحديث عن عمران بن حصين من غير هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3484,
			"arabicnumber": 3484,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا أبو مصعب المدني، عن عمرو بن أبي عمرو، مولى المطلب عن أنس بن مالك، رضى الله عنه قال كثيرا ما كنت أسمع النبي صلى الله عليه وسلم يدعو بهؤلاء الكلمات ‏ \"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث عمرو بن أبي عمرو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3485,
			"arabicnumber": 3485,
			"text": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، عن النبي صلى الله عليه وسلم كان يدعو يقول ‏ \"‏ اللهم إني أعوذ بك من الكسل والهرم والجبن والبخل وفتنة المسيح وعذاب القبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3486,
			"arabicnumber": 3486,
			"text": "حدثنا محمد بن عبد الأعلى، - بصري - حدثنا عثام بن علي، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت النبي صلى الله عليه وسلم يعقد التسبيح ‏.‏ وقال هذا حديث حسن غريب من هذا الوجه من حديث الأعمش عن عطاء بن السائب ‏.‏ وروى شعبة والثوري هذا الحديث عن عطاء بن السائب بطوله ‏.‏ وفي الباب عن يسيرة بنت ياسر عن النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا معشر النساء اعقدن بالأنامل فإنهن مسئولات مستنطقات ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3487,
			"arabicnumber": 3487,
			"text": "حدثنا محمد بن بشار، حدثنا سهل بن يوسف، حدثنا حميد، عن ثابت البناني، عن أنس بن مالك، أن النبي صلى الله عليه وسلم عاد رجلا قد جهد حتى صار مثل الفرخ فقال له ‏\"‏ أما كنت تدعو أما كنت تسأل ربك العافية ‏\"‏ ‏.‏ قال كنت أقول اللهم ما كنت معاقبي به في الآخرة فعجله لي في الدنيا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ سبحان الله إنك لا تطيقه - أو لا تستطيعه أفلا كنت تقول اللهم آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد روي من غير وجه عن أنس عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3488,
			"arabicnumber": 3488,
			"text": "حدثنا هارون بن عبد الله البزاز، حدثنا روح بن عبادة، عن هشام بن حسان، عن الحسن، في قوله ‏:‏ ‏(‏ ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة ‏)‏ قال في الدنيا العلم والعبادة وفي الآخرة الجنة ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3489,
			"arabicnumber": 3489,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن أبي إسحاق، قال سمعت أبا الأحوص، يحدث عن عبد الله، أن النبي صلى الله عليه وسلم كان يدعو ‏ \"‏ اللهم إني أسألك الهدى والتقى والعفاف والغنى ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3490,
			"arabicnumber": 3490,
			"text": "حدثنا أبو كريب، حدثنا محمد بن فضيل، عن محمد بن سعد الأنصاري، عن عبد الله بن ربيعة الدمشقي، حدثنا عائذ الله أبو إدريس الخولاني، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كان من دعاء داود يقول اللهم إني أسألك حبك وحب من يحبك والعمل الذي يبلغني حبك اللهم اجعل حبك أحب إلى من نفسي وأهلي ومن الماء البارد ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم إذا ذكر داود يحدث عنه قال ‏\"‏ كان أعبد البشر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3491,
			"arabicnumber": 3491,
			"text": "حدثنا سفيان بن وكيع، حدثنا ابن أبي عدي، عن حماد بن سلمة، عن أبي جعفر الخطمي، عن محمد بن كعب القرظي، عن عبد الله بن يزيد الخطمي الأنصاري، عن رسول الله صلى الله عليه وسلم أنه كان يقول في دعائه ‏ \"‏ اللهم ارزقني حبك وحب من ينفعني حبه عندك اللهم ما رزقتني مما أحب فاجعله قوة لي فيما تحب اللهم وما زويت عني مما أحب فاجعله لي فراغا فيما تحب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وأبو جعفر الخطمي اسمه عمير بن يزيد بن خماشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3492,
			"arabicnumber": 3492,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا سعد بن أوس، عن بلال بن يحيى العبسي، عن شتير بن شكل، عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله علمني تعوذا أتعوذ به ‏.‏ قال فأخذ بكتفي فقال ‏ \"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏ يعني فرجه ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث سعد بن أوس عن بلال بن يحيى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3493,
			"arabicnumber": 3493,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم التيمي، أن عائشة، قالت كنت نائمة إلى جنب رسول الله صلى الله عليه وسلم ففقدته من الليل فلمسته فوقعت يدي على قدميه وهو ساجد وهو يقول ‏\"‏ أعوذ برضاك من سخطك وبمعافاتك من عقوبتك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏ قال هذا حديث حسن قد روي من غير وجه عن عائشة ‏.‏ حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، بهذا الإسناد نحوه ‏.‏ وزاد فيه ‏\"‏ وأعوذ بك منك لا أحصي ثناء عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3494,
			"arabicnumber": 3494,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن أبي الزبير المكي، عن طاوس اليماني، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم كان يعلمهم هذا الدعاء كما يعلمهم السورة من القرآن ‏\"‏ اللهم إني أعوذ بك من عذاب جهنم ومن عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح [غريب] ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3495,
			"arabicnumber": 3495,
			"text": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يدعو بهؤلاء الكلمات ‏ \"‏ اللهم إني أعوذ بك من فتنة النار وعذاب النار وعذاب القبر وفتنة القبر ومن شر فتنة الغنى ومن شر فتنة الفقر ومن شر فتنة المسيح الدجال اللهم اغسل خطاياى بماء الثلج والبرد وأنق قلبي من الخطايا كما أنقيت الثوب الأبيض من الدنس وباعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم إني أعوذ بك من الكسل والهرم والمأثم والمغرم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3496,
			"arabicnumber": 3496,
			"text": "حدثنا هارون بن إسحاق، حدثنا عبدة، عن هشام بن عروة، عن عباد بن عبد الله بن الزبير، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول عند وفاته ‏ \"‏ اللهم اغفر لي وارحمني وألحقني بالرفيق الأعلى ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3497,
			"arabicnumber": 3497,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يقول أحدكم اللهم اغفر لي إن شئت اللهم ارحمني إن شئت ليعزم المسألة فإنه لا مكره له ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3498,
			"arabicnumber": 3498,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن ابن شهاب، عن أبي عبد الله الأغر، وعن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ينزل ربنا كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر فيقول من يدعوني فأستجيب له ومن يسألني فأعطيه ومن يستغفرني فأغفر له ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وأبو عبد الله الأغر اسمه سلمان ‏.‏ قال وفي الباب عن علي وعبد الله بن مسعود وأبي سعيد وجبير بن مطعم ورفاعة الجهني وأبي الدرداء وعثمان بن أبي العاصي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3499,
			"arabicnumber": 3499,
			"text": "حدثنا محمد بن يحيى الثقفي المروزي، حدثنا حفص بن غياث، عن ابن جريج، عن عبد الرحمن بن سابط، عن أبي أمامة، قال قيل يا رسول الله أى الدعاء أسمع قال ‏\"‏ جوف الليل الآخر ودبر الصلوات المكتوبات ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد روي عن أبي ذر وابن عمر عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ جوف الليل الآخر الدعاء فيه أفضل أو أرجى ‏\"‏ ‏.‏ أو نحو هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3500,
			"arabicnumber": 3500,
			"text": "حدثنا علي بن حجر، حدثنا عبد الحميد بن عمر الهلالي، عن سعيد بن إياس الجريري، عن أبي السليل، عن أبي هريرة، أن رجلا، قال يا رسول الله سمعت دعاءك الليلة فكان الذي وصل إلى منه أنك تقول ‏\"‏ اللهم اغفر لي ذنبي ووسع لي في رزقي وبارك لي فيما رزقتني ‏\"‏ ‏.‏ قال ‏\"‏ فهل تراهن تركن شيئا ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ وأبو السليل اسمه ضريب بن نفير ويقال ابن نقير ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3501,
			"arabicnumber": 3501,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا حيوة بن شريح، وهو ابن يزيد الحمصي عن بقية بن الوليد، عن مسلم بن زياد، قال سمعت أنسا، يقول إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قال حين يصبح اللهم أصبحنا نشهدك ونشهد حملة عرشك وملائكتك وجميع خلقك بأنك الله لا إله إلا أنت وحدك لا شريك لك وأن محمدا عبدك ورسولك ‏.‏ إلا غفر الله له ما أصاب في يومه ذلك وإن قالها حين يمسي غفر الله له ما أصاب في تلك الليلة من ذنب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3502,
			"arabicnumber": 3502,
			"text": "حدثنا علي بن حجر، أخبرنا ابن المبارك، أخبرنا يحيى بن أيوب، عن عبيد الله بن زحر، عن خالد بن أبي عمران، أن ابن عمر، قال قلما كان رسول الله صلى الله عليه وسلم يقوم من مجلس حتى يدعو بهؤلاء الكلمات لأصحابه ‏ \"‏ اللهم اقسم لنا من خشيتك ما يحول بيننا وبين معاصيك ومن طاعتك ما تبلغنا به جنتك ومن اليقين ما تهون به علينا مصيبات الدنيا ومتعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا واجعله الوارث منا واجعل ثأرنا على من ظلمنا وانصرنا على من عادانا ولا تجعل مصيبتنا في ديننا ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا ولا تسلط علينا من لا يرحمنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روى بعضهم هذا الحديث عن خالد بن أبي عمران عن نافع عن ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3503,
			"arabicnumber": 3503,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عثمان الشحام، حدثني مسلم بن أبي بكرة، قال سمعني أبي، وأنا أقول اللهم، إني أعوذ بك من الهم والكسل وعذاب القبر ‏.‏ قال يا بنى ممن سمعت هذا قال قلت سمعتك تقولهن ‏.‏ قال الزمهن فإني سمعت رسول الله صلى الله عليه وسلم يقولهن ‏.‏ قال هذا حديث حسن [صحيح][غريب] ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3504,
			"arabicnumber": 3504,
			"text": "حدثنا علي بن خشرم، أخبرنا الفضل بن موسى، عن الحسين بن واقد، عن أبي إسحاق، عن الحارث، عن علي، رضى الله عنه قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألا أعلمك كلمات إذا قلتهن غفر الله لك وإن كنت مغفورا لك ‏\"‏ ‏.‏ قال ‏\"‏ قل لا إله إلا الله العلي العظيم لا إله إلا الله الحليم الكريم لا إله إلا الله سبحان الله رب العرش العظيم ‏\"‏ ‏.‏ قال علي بن خشرم وأخبرنا علي بن الحسين بن واقد، عن أبيه، بمثل ذلك إلا أنه قال في آخرها ‏\"‏ الحمد لله رب العالمين ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث أبي إسحاق عن الحارث عن علي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3505,
			"arabicnumber": 3505,
			"text": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا يونس بن أبي إسحاق، عن إبراهيم بن محمد بن سعد، عن أبيه، عن سعد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ دعوة ذي النون إذ دعا وهو في بطن الحوت لا إله إلا أنت سبحانك إني كنت من الظالمين ‏.‏ فإنه لم يدع بها رجل مسلم في شيء قط إلا استجاب الله له ‏\"‏ ‏.‏ قال محمد بن يحيى قال محمد بن يوسف مرة عن إبراهيم بن محمد بن سعد، عن سعد، ‏.‏ قال أبو عيسى وقد روى غير، واحد، هذا الحديث عن يونس بن أبي إسحاق، عن إبراهيم بن محمد بن سعد، عن سعد، ولم يذكروا فيه عن أبيه، ‏.‏ وروى بعضهم، عن يونس بن أبي إسحاق، فقالوا عن إبراهيم بن محمد بن سعد، عن أبيه، عن سعد، وكان، يونس بن أبي إسحاق ربما ذكر في هذا الحديث عن أبيه، وربما، لم يذكره ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3506,
			"arabicnumber": 3506,
			"text": "حدثنا يوسف بن حماد البصري، حدثنا عبد الأعلى، عن سعيد، عن قتادة، عن أبي رافع، عن أبي هريرة، رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن لله تسعة وتسعين اسما مائة غير واحد من أحصاها دخل الجنة ‏\"‏ ‏.‏ قال يوسف وحدثنا عبد الأعلى، عن هشام بن حسان، عن محمد، عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3507,
			"arabicnumber": 3507,
			"text": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثني صفوان بن صالح، حدثنا الوليد بن مسلم، حدثنا شعيب بن أبي حمزة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن لله تعالى تسعة وتسعين اسما مائة غير واحدة من أحصاها دخل الجنة هو الله الذي لا إله إلا هو الرحمن الرحيم الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر الخالق البارئ المصور الغفار القهار الوهاب الرزاق الفتاح العليم القابض الباسط الخافض الرافع المعز المذل السميع البصير الحكم العدل اللطيف الخبير الحليم العظيم الغفور الشكور العلي الكبير الحفيظ المقيت الحسيب الجليل الكريم الرقيب المجيب الواسع الحكيم الودود المجيد الباعث الشهيد الحق الوكيل القوي المتين الولي الحميد المحصي المبدئ المعيد المحيي المميت الحى القيوم الواجد الماجد الواحد الصمد القادر المقتدر المقدم المؤخر الأول الآخر الظاهر الباطن الوالي المتعالي البر التواب المنتقم العفو الرءوف مالك الملك ذو الجلال والإكرام المقسط الجامع الغني المغني المانع الضار النافع النور الهادي البديع الباقي الوارث الرشيد الصبور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب حدثنا به غير واحد عن صفوان بن صالح ‏.‏ ولا نعرفه إلا من حديث صفوان بن صالح وهو ثقة عند أهل الحديث ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ولا نعلم - في كبير شيء من الروايات له إسناد صحيح ذكر الأسماء إلا في هذا الحديث ‏.‏ وقد روى آدم بن أبي إياس هذا الحديث بإسناد غير هذا عن أبي هريرة عن النبي صلى الله عليه وسلم وذكر فيه الأسماء وليس له إسناد صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3508,
			"arabicnumber": 3508,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن لله تسعة وتسعين اسما من أحصاها دخل الجنة ‏\"‏ ‏.‏ قال وليس في هذا الحديث ذكر الأسماء ‏.‏ قال وهذا حديث حسن صحيح ‏.‏ رواه أبو اليمان عن شعيب بن أبي حمزة عن أبي الزناد ولم يذكر فيه الأسماء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3509,
			"arabicnumber": 3509,
			"text": "حدثنا إبراهيم بن يعقوب، حدثنا زيد بن حباب، أن حميدا المكي، مولى ابن علقمة حدثه أن عطاء بن أبي رباح حدثه عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مررتم برياض الجنة فارتعوا ‏\"‏ ‏.‏ قلت يا رسول الله وما رياض الجنة قال ‏\"‏ المساجد ‏\"‏ ‏.‏ قلت وما الرتع يا رسول الله قال ‏\"‏ سبحان الله والحمد لله ولا إله إلا الله والله أكبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3510,
			"arabicnumber": 3510,
			"text": "حدثنا عبد الوارث بن عبد الصمد بن عبد الوارث، قال حدثني أبي قال، حدثنا محمد بن ثابت البناني، قال حدثني أبي، عن أنس بن مالك، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا مررتم برياض الجنة فارتعوا ‏\"‏ ‏.‏ قال وما رياض الجنة قال ‏\"‏ حلق الذكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث ثابت عن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3511,
			"arabicnumber": 3511,
			"text": "حدثنا إبراهيم بن يعقوب، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن ثابت، عن عمرو بن أبي سلمة، عن أمه أم سلمة، عن أبي سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أصاب أحدكم مصيبة فليقل ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ اللهم عندك احتسبت مصيبتي فأجرني فيها وأبدلني منها خيرا ‏\"‏ ‏.‏ فلما احتضر أبو سلمة قال اللهم اخلف في أهلي خيرا مني فلما قبض قالت أم سلمة ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ عند الله احتسبت مصيبتي فأجرني فيها ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وروي هذا الحديث من غير هذا الوجه عن أم سلمة عن النبي صلى الله عليه وسلم وأبو سلمة اسمه عبد الله بن عبد الأسد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3512,
			"arabicnumber": 3512,
			"text": "حدثنا يوسف بن عيسى، حدثنا الفضل بن موسى، حدثنا سلمة بن وردان، عن أنس بن مالك، أن رجلا، جاء إلى النبي صلى الله عليه وسلم فقال يا رسول الله أى الدعاء أفضل قال ‏\"‏ سل ربك العافية والمعافاة في الدنيا والآخرة ‏\"‏ ‏.‏ ثم أتاه في اليوم الثاني فقال يا رسول الله أى الدعاء أفضل فقال له مثل ذلك ثم أتاه في اليوم الثالث فقال له مثل ذلك ‏.‏ قال ‏\"‏ فإذا أعطيت العافية في الدنيا وأعطيتها في الآخرة فقد أفلحت ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه إنما نعرفه من حديث سلمة بن وردان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3513,
			"arabicnumber": 3513,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جعفر بن سليمان الضبعي، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عائشة، قالت قلت يا رسول الله أرأيت إن علمت أى ليلة ليلة القدر ما أقول فيها قال ‏ \"‏ قولي اللهم إنك عفو كريم تحب العفو فاعف عني ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3514,
			"arabicnumber": 3514,
			"text": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن العباس بن عبد المطلب، قال قلت يا رسول الله علمني شيئا أسأله الله عز وجل ‏.‏ قال ‏\"‏ سل الله العافية ‏\"‏ ‏.‏ فمكثت أياما ثم جئت فقلت يا رسول الله علمني شيئا أسأله الله ‏.‏ فقال لي ‏\"‏ يا عباس يا عم رسول الله سل الله العافية في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وعبد الله بن الحارث بن نوفل قد سمع من العباس بن عبد المطلب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3515,
			"arabicnumber": 3515,
			"text": "حدثنا القاسم بن دينار الكوفي، حدثنا إسحاق بن منصور الكوفي، عن إسرائيل، عن عبد الرحمن بن أبي بكر، وهو المليكي عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما سئل الله شيئا أحب إليه من أن يسأل العافية ‏\"‏ ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث عبد الرحمن بن أبي بكر المليكي ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3516,
			"arabicnumber": 3516,
			"text": "حدثنا محمد بن بشار، حدثنا إبراهيم بن عمر بن أبي الوزير، حدثنا زنفل بن عبد الله أبو عبد الله، عن ابن أبي مليكة، عن عائشة، عن أبي بكر الصديق، أن النبي صلى الله عليه وسلم كان إذا أراد أمرا قال ‏ \"‏ اللهم خر لي واختر لي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث زنفل ‏.‏ وهو ضعيف عند أهل الحديث ويقال له زنفل العرفي وكان سكن عرفات وتفرد بهذا الحديث ولا يتابع عليه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3517,
			"arabicnumber": 3517,
			"text": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا أبان، هو ابن يزيد العطار حدثنا يحيى، أن زيد بن سلام، حدثه أن أبا سلام حدثه عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الوضوء شطر الإيمان والحمد لله تملأ الميزان وسبحان الله والحمد لله تملآن أو تملأ ما بين السموات والأرض والصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3518,
			"arabicnumber": 3518,
			"text": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن عبد الرحمن بن زياد بن أنعم، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ التسبيح نصف الميزان والحمد لله يملؤه ولا إله إلا الله ليس لها دون الله حجاب حتى تخلص إليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏ وعبد الرحمن بن زياد بن أنعم هو الإفريقي وقد ضعفه أحمد بن حنبل ويحيى بن معين وعبد الله بن يزيد هو أبو عبد الرحمن الحبلي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3519,
			"arabicnumber": 3519,
			"text": "حدثنا هناد، حدثنا أبو الأحوص، عن أبي إسحاق، عن جرى النهدي، عن رجل، من بني سليم قال عدهن رسول الله صلى الله عليه وسلم في يدي أو في يده ‏ \"‏ التسبيح نصف الميزان والحمد يملؤه والتكبير يملأ ما بين السماء والأرض والصوم نصف الصبر والطهور نصف الإيمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وقد رواه شعبة وسفيان الثوري عن أبي إسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3520,
			"arabicnumber": 3520,
			"text": "حدثنا محمد بن حاتم المؤدب، حدثنا علي بن ثابت، حدثني قيس بن الربيع، وكان، من بني أسد عن الأغر بن الصباح، عن خليفة بن حصين، عن علي بن أبي طالب، قال أكثر ما دعا به رسول الله صلى الله عليه وسلم عشية عرفة في الموقف ‏ \"‏ اللهم لك الحمد كالذي تقول وخيرا مما نقول اللهم لك صلاتي ونسكي ومحياى ومماتي وإليك مآبي ولك رب تراثي اللهم إني أعوذ بك من عذاب القبر ووسوسة الصدر وشتات الأمر اللهم إني أعوذ بك من شر ما تجيء به الريح ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه وليس إسناده بالقوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3521,
			"arabicnumber": 3521,
			"text": "حدثنا محمد بن حاتم المؤدب، حدثنا عمار بن محمد ابن أخت، سفيان الثوري حدثنا الليث بن أبي سليم، عن عبد الرحمن بن سابط، عن أبي أمامة، قال دعا رسول الله صلى الله عليه وسلم بدعاء كثير لم نحفظ منه شيئا قلنا يا رسول الله دعوت بدعاء كثير لم نحفظ منه شيئا ‏.‏ فقال ‏ \"‏ ألا أدلكم على ما يجمع ذلك كله تقول اللهم إنا نسألك من خير ما سألك منه نبيك محمد ونعوذ بك من شر ما استعاذ بك منه نبيك محمد وأنت المستعان وعليك البلاغ ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3522,
			"arabicnumber": 3522,
			"text": "حدثنا أبو موسى الأنصاري، حدثنا معاذ بن معاذ، عن أبي كعب، صاحب الحرير حدثني شهر بن حوشب، قال قلت لأم سلمة يا أم المؤمنين ما كان أكثر دعاء رسول الله صلى الله عليه وسلم إذا كان عندك قالت كان أكثر دعائه ‏\"‏ يا مقلب القلوب ثبت قلبي على دينك ‏\"‏ ‏.‏ قالت قلت يا رسول الله ما لأكثر دعائك يا مقلب القلوب ثبت قلبي على دينك قال ‏\"‏ يا أم سلمة إنه ليس آدمي إلا وقلبه بين أصبعين من أصابع الله فمن شاء أقام ومن شاء أزاغ ‏\"‏ ‏.‏ فتلا معاذ ‏:‏ ‏(‏ ربنا لا تزغ قلوبنا بعد إذ هديتنا ‏)‏ قال وفي الباب عن عائشة والنواس بن سمعان وأنس وجابر وعبد الله بن عمرو ونعيم بن همار ‏.‏ قال وهذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3523,
			"arabicnumber": 3523,
			"text": "حدثنا محمد بن حاتم المؤدب، حدثنا الحكم بن ظهير، حدثنا علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال شكا خالد بن الوليد المخزومي إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما أنام الليل من الأرق ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ إذا أويت إلى فراشك فقل اللهم رب السموات السبع وما أظلت ورب الأرضين وما أقلت ورب الشياطين وما أضلت كن لي جارا من شر خلقك كلهم جميعا أن يفرط على أحد منهم أو أن يبغي على عز جارك وجل ثناؤك ولا إله غيرك ولا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث ليس إسناده بالقوي ‏.‏ والحكم بن ظهير قد ترك حديثه بعض أهل الحديث ويروى هذا الحديث عن النبي صلى الله عليه وسلم مرسلا من غير هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3524,
			"arabicnumber": 3524,
			"text": "حدثنا محمد بن حاتم المكتب، حدثنا أبو بدر، شجاع بن الوليد عن الرحيل بن معاوية، أخي زهير بن معاوية عن الرقاشي، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا كربه أمر قال ‏\"‏ يا حى يا قيوم برحمتك أستغيث ‏\"‏ ‏.‏ وبإسناده قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألظوا بيا ذا الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روي هذا الحديث عن أنس من غير هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3525,
			"arabicnumber": 3525,
			"text": "حدثنا محمود بن غيلان، حدثنا المؤمل، عن حماد بن سلمة، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ ألظوا بيا ذا الجلال والإكرام ‏\"‏ ‏.‏ قال هذا حديث غريب وليس بمحفوظ ‏.‏ وإنما يروى هذا عن حماد بن سلمة عن حميد عن الحسن عن النبي صلى الله عليه وسلم وهذا أصح ومؤمل غلط فيه فقال عن حماد عن حميد عن أنس ولا يتابع فيه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3526,
			"arabicnumber": 3526,
			"text": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن عبد الله بن عبد الرحمن بن أبي حسين، عن شهر بن حوشب، عن أبي أمامة الباهلي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من أوى إلى فراشه طاهرا يذكر الله حتى يدركه النعاس لم ينقلب ساعة من الليل يسأل الله شيئا من خير الدنيا والآخرة إلا أعطاه الله إياه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وقد روي هذا أيضا عن شهر بن حوشب عن أبي ظبية عن عمرو بن عبسة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3527,
			"arabicnumber": 3527,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن الجريري، عن أبي الورد، عن اللجلاج، عن معاذ بن جبل، قال سمع النبي صلى الله عليه وسلم رجلا يدعو يقول اللهم إني أسألك تمام النعمة ‏.‏ فقال ‏\"‏ أى شيء تمام النعمة ‏\"‏ ‏.‏ قال دعوة دعوت بها أرجو بها الخير ‏.‏ قال ‏\"‏ فإن من تمام النعمة دخول الجنة والفوز من النار ‏\"‏ ‏.‏ وسمع رجلا وهو يقول يا ذا الجلال والإكرام فقال ‏\"‏ قد استجيب لك فسل ‏\"‏ ‏.‏ وسمع النبي صلى الله عليه وسلم رجلا وهو يقول اللهم إني أسألك الصبر ‏.‏ فقال ‏\"‏ سألت الله البلاء فسله العافية ‏\"‏ ‏.‏ حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، عن الجريري، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3528,
			"arabicnumber": 3528,
			"text": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا فزع أحدكم في النوم فليقل أعوذ بكلمات الله التامة من غضبه وعقابه وشر عباده ومن همزات الشياطين وأن يحضرون ‏.‏ فإنها لن تضره ‏\"‏ ‏.‏ قال وكان عبد الله بن عمرو يلقنها من بلغ من ولده ومن لم يبلغ منهم كتبها في صك ثم علقها في عنقه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3529,
			"arabicnumber": 3529,
			"text": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن محمد بن زياد، عن أبي راشد الحبراني، قال أتيت عبد الله بن عمرو بن العاصي فقلت له حدثنا مما، سمعت من، رسول الله صلى الله عليه وسلم ‏.‏ فألقى إلى صحيفة فقال هذا ما كتب لي رسول الله صلى الله عليه وسلم قال فنظرت فيها فإذا فيها إن أبا بكر الصديق رضى الله عنه قال يا رسول الله علمني ما أقول إذا أصبحت وإذا أمسيت ‏.‏ فقال ‏ \"‏ يا أبا بكر قل اللهم فاطر السموات والأرض عالم الغيب والشهادة لا إله إلا أنت رب كل شيء ومليكه أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن أقترف على نفسي سوءا أو أجره إلى مسلم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3530,
			"arabicnumber": 3530,
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، قال سمعت عبد الله بن مسعود، يقول قلت له أأنت سمعته من عبد الله، قال نعم ‏.‏ ورفعه أنه قال ‏ \"‏ لا أحد أغير من الله ولذلك حرم الفواحش ما ظهر منها وما بطن ولا أحد أحب إليه المدح من الله ولذلك مدح نفسه ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3531,
			"arabicnumber": 3531,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، عن أبي بكر الصديق، أنه قال لرسول الله صلى الله عليه وسلم علمني دعاء أدعو به في صلاتي قال ‏ \"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب وهو حديث ليث بن سعد وأبو الخير اسمه مرثد بن عبد الله اليزني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3532,
			"arabicnumber": 3532,
			"text": "حدثنا محمود بن غيلان حدثنا أبو أحمد حدثنا سفيان عن يزيد بن أبي زياد عن عبد الله بن الحارث عن المطلب بن أبي وداعة قال جاء العباس إلى رسول الله صلى الله عليه وسلم فكأنه سمع شيئا فقام النبي صلى الله عليه وسلم على المنبر فقال من أنا فقالوا أنت رسول الله عليك السلام قال أنا محمد بن عبد الله بن عبد المطلب إن الله خلق الخلق فجعلني في خيرهم فرقة ثم جعلهم فرقتين فجعلني في خيرهم فرقة ثم جعلهم قبائل فجعلني في خيرهم قبيلة ثم جعلهم بيوتا فجعلني في خيرهم بيتا وخيرهم نسبا قال أبو عيسى هذا حديث حسن",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3533,
			"arabicnumber": 3533,
			"text": "حدثنا محمد بن حميد الرازي، حدثنا الفضل بن موسى، عن الأعمش، عن أنس، أن رسول الله صلى الله عليه وسلم مر بشجرة يابسة الورق فضربها بعصاه فتناثر الورق فقال ‏ \"‏ إن الحمد لله وسبحان الله ولا إله إلا الله والله أكبر لتساقط من ذنوب العبد كما تساقط ورق هذه الشجرة ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ ولا نعرف للأعمش سماعا من أنس إلا أنه قد رآه ونظر إليه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3534,
			"arabicnumber": 3534,
			"text": "حدثنا قتيبة، حدثنا الليث، عن الجلاح أبي كثير، عن أبي عبد الرحمن الحبلي، عن عمارة بن شبيب السبئي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير ‏.‏ عشر مرات على إثر المغرب بعث الله له مسلحة يحفظونه من الشيطان حتى يصبح وكتب الله له بها عشر حسنات موجبات ومحا عنه عشر سيئات موبقات وكانت له بعدل عشر رقاب مؤمنات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث ليث بن سعد ‏.‏ ولا نعرف لعمارة بن شبيب سماعا عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3535,
			"arabicnumber": 3535,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عاصم بن أبي النجود، عن زر بن حبيش، قال أتيت صفوان بن عسال المرادي أسأله عن المسح، على الخفين فقال ما جاء بك يا زر فقلت ابتغاء العلم فقال إن الملائكة تضع أجنحتها لطالب العلم رضا بما يطلب ‏.‏ قلت إنه حك في صدري المسح على الخفين بعد الغائط والبول وكنت امرأ من أصحاب النبي صلى الله عليه وسلم فجئت أسألك هل سمعته يذكر في ذلك شيئا قال نعم كان يأمرنا إذا كنا سفرا أو مسافرين أن لا ننزع خفافنا ثلاثة أيام ولياليهن إلا من جنابة لكن من غائط وبول ونوم ‏.‏ فقلت هل سمعته يذكر في الهوى شيئا قال نعم كنا مع النبي صلى الله عليه وسلم في سفر فبينا نحن عنده إذ ناداه أعرابي بصوت له جهوري يا محمد ‏.‏ فأجابه رسول الله صلى الله عليه وسلم على نحو من صوته هاؤم وقلنا له ويحك اغضض من صوتك فإنك عند النبي صلى الله عليه وسلم وقد نهيت عن هذا ‏.‏ فقال والله لا أغضض ‏.‏ قال الأعرابي المرء يحب القوم ولما يلحق بهم ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ المرء مع من أحب يوم القيامة ‏\"‏ ‏.‏ فمازال يحدثنا حتى ذكر بابا من قبل المغرب مسيرة عرضه أو يسير الراكب في عرضه أربعين أو سبعين عاما قال سفيان قبل الشام خلقه الله يوم خلق السموات والأرض مفتوحا يعني للتوبة لا يغلق حتى تطلع الشمس منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3536,
			"arabicnumber": 3536,
			"text": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم، عن زر بن حبيش، قال أتيت صفوان بن عسال المرادي فقال لي ما جاء بك قلت ابتغاء العلم ‏.‏ قال بلغني أن الملائكة تضع أجنحتها لطالب العلم رضا بما يفعل ‏.‏ قال قلت إنه حاك أو قال حك في نفسي شيء من المسح على الخفين فهل حفظت من رسول الله صلى الله عليه وسلم فيه شيئا قال نعم كنا إذا كنا سفرا أو مسافرين أمرنا أن لا نخلع خفافنا ثلاثا إلا من جنابة ولكن من غائط وبول ونوم ‏.‏ قال فقلت فهل حفظت من رسول الله صلى الله عليه وسلم في الهوى شيئا قال نعم كنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره فناداه رجل كان في آخر القوم بصوت جهوري أعرابي جلف جاف فقال يا محمد يا محمد ‏.‏ فقال له القوم مه إنك قد نهيت عن هذا ‏.‏ فأجابه رسول الله صلى الله عليه وسلم نحوا من صوته هاؤم فقال الرجل يحب القوم ولما يلحق بهم ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ المرء مع من أحب ‏\"‏ ‏.‏ قال زر فما برح يحدثني حتى حدثني أن الله جعل بالمغرب بابا عرضه مسيرة سبعين عاما للتوبة لا يغلق حتى تطلع الشمس من قبله وذلك قول الله عز وجل ‏:‏ ‏(‏ يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3537,
			"arabicnumber": 3537,
			"text": "حدثنا إبراهيم بن يعقوب، حدثنا علي بن عياش، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله يقبل توبة العبد ما لم يغرغر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، عن عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3538,
			"arabicnumber": 3538,
			"text": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لله أفرح بتوبة أحدكم من أحدكم بضالته إذا وجدها ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود والنعمان بن بشير وأنس ‏.‏ قال وهذا حديث حسن صحيح غريب من هذا الوجه من حديث أبي الزناد ‏.‏ وقد روي هذا الحديث�� عن مكحول بإسناد له عن أبي ذر عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 3539,
			"arabicnumber": 3539,
			"text": "حدثنا قتيبة، حدثنا الليث، عن محمد بن قيس، قاص عمر بن عبد العزيز عن أبي صرمة، عن أبي أيوب، أنه قال حين حضرته الوفاة قد كتمت عنكم شيئا سمعته من رسول الله سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لولا أنكم تذنبون لخلق الله خلقا يذنبون ويغفر لهم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وقد روي هذا، عن محمد بن كعب، عن أبي أيوب، عن النبي صلى الله عليه وسلم نحوه ‏.‏ حدثنا بذلك، قتيبة حدثنا عبد الرحمن بن أبي الرجال، عن عمر، مولى غفرة عن محمد بن كعب، عن أبي أيوب، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 3540,
			"arabicnumber": 3540,
			"text": "حدثنا عبد الله بن إسحاق الجوهري البصري، حدثنا أبو عاصم، حدثنا كثير بن فائد، حدثنا سعيد بن عبيد، قال سمعت بكر بن عبد الله المزني، يقول حدثنا أنس بن مالك، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ قال الله يا ابن آدم إنك ما دعوتني ورجوتني غفرت لك على ما كان فيك ولا أبالي يا ابن آدم لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك ولا أبالي يا ابن آدم إنك لو أتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئا لأتيتك بقرابها مغفرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 3541,
			"arabicnumber": 3541,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ خلق الله مائة رحمة فوضع رحمة واحدة بين خلقه يتراحمون بها وعند الله تسعة وتسعون رحمة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن سلمان وجندب بن عبد الله بن سفيان البجلي وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 3542,
			"arabicnumber": 3542,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لو يعلم المؤمن ما عند الله من العقوبة ما طمع في الجنة أحد ولو يعلم الكافر ما عند الله من الرحمة ما قنط من الجنة أحد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من حديث العلاء بن عبد الرحمن عن أبيه عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 3543,
			"arabicnumber": 3543,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الله حين خلق الخلق كتب بيده على نفسه إن رحمتي تغلب غضبي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 3544,
			"arabicnumber": 3544,
			"text": "حدثنا محمد بن عبد الله بن أبي الثلج، - رجل من أهل بغداد أبو عبد الله صاحب أحمد بن حنبل حدثنا يونس بن محمد، حدثنا سعيد بن زربي، عن عاصم الأحول، وثابت، عن أنس، قال دخل النبي صلى الله عليه وسلم المسجد ورجل قد صلى وهو يدعو ويقول في دعائه اللهم لا إله إلا أنت المنان بديع السموات والأرض ذا الجلال والإكرام ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ تدرون بم دعا الله دعا الله باسمه الأعظم الذي إذا دعي به أجاب وإذا سئل به أعطى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث ثابت عن أنس ‏.‏ وقد روي من غير هذا الوجه عن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 3545,
			"arabicnumber": 3545,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا ربعي بن إبراهيم، عن عبد الرحمن بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ رغم أنف رجل ذكرت عنده فلم يصل على ورغم أنف رجل دخل عليه رمضان ثم انسلخ قبل أن يغفر له ورغم أنف رجل أدرك عنده أبواه الكبر فلم يدخلاه الجنة ‏\"‏ ‏.‏ قال عبد الرحمن وأظنه قال أو أحدهما ‏.‏ قال وفي الباب عن جابر وأنس وهذا حديث حسن غريب من هذا الوجه ‏.‏ وربعي بن إبراهيم هو أخو إسماعيل بن إبراهيم وهو ثقة وهو ابن علية ‏.‏ ويروى عن بعض أهل العلم قال إذا صلى الرجل على النبي صلى الله عليه وسلم مرة في المجلس أجزأ عنه ما كان في ذلك المجلس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 3546,
			"arabicnumber": 3546,
			"text": "حدثنا يحيى بن موسى، وزياد بن أيوب، قالا حدثنا أبو عامر العقدي، عن سليمان بن بلال، عن عمارة بن غزية، عن عبد الله بن علي بن حسين بن علي بن أبي طالب، عن أبيه، عن حسين بن علي بن أبي طالب، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ البخيل الذي من ذكرت عنده فلم يصل على ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 3547,
			"arabicnumber": 3547,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الحسن بن عبيد الله، عن عطاء بن السائب، عن عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم يقول ‏ \"‏ اللهم برد قلبي بالثلج والبرد والماء البارد اللهم نق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 3548,
			"arabicnumber": 3548,
			"text": "حدثنا الحسن بن عرفة، حدثنا يزيد بن هارون، عن عبد الرحمن بن أبي بكر القرشي المليكي، عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من فتح له منكم باب الدعاء فتحت له أبواب الرحمة وما سئل الله شيئا يعني أحب إليه من أن يسأل العافية ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الدعاء ينفع مما نزل ومما لم ينزل فعليكم عباد الله بالدعاء ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ لا نعرفه إلا من حديث عبد الرحمن بن أبي بكر القرشي وهو المكي المليكي وهو ضعيف في الحديث ضعفه بعض أهل العلم من قبل حفظه ‏.‏ وقد روى إسرائيل، هذا الحديث عن عبد الرحمن بن أبي بكر، عن موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما سئل الله شيئا أحب إليه من العافية ‏\"‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 3549,
			"arabicnumber": 3549,
			"text": "حدثنا بذلك القاسم بن دينار الكوفي حدثنا إسحاق بن منصور الكوفي عن إسرائيل بهذا ‏.‏ حدثنا أحمد بن منيع، حدثنا أبو النضر، حدثنا بكر بن خنيس، عن محمد القرشي، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن بلال، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عليكم بقيام الليل فإنه دأب الصالحين قبلكم وإن قيام الليل قربة إلى الله ومنهاة عن الإثم وتكفير للسيئات ومطردة للداء عن الجسد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث بلال إلا من هذا الوجه ولا يصح من قبل إسناده ‏.‏ قال سمعت محمد بن إسماعيل يقول محمد القرشي هو محمد بن سعيد الشامي وهو ابن أبي قيس وهو محمد بن حسان وقد ترك حديثه ‏.‏ وقد روى هذا الحديث معاوية بن صالح عن ربيعة بن يزيد عن أبي إدريس الخولاني عن أبي أمامة عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ عليكم بقيام الليل فإنه دأب الصالحين قبلكم وهو قربة إلى ربكم ومكفرة للسيئات ومنهاة للإثم ‏\"‏ ‏.‏ قال أبو عيسى وهذا أصح من حديث أبي إدريس عن بلال ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 3550,
			"arabicnumber": 3550,
			"text": "حدثنا الحسن بن عرفة، حدثني عبد الرحمن بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أعمار أمتي ما بين ستين إلى سبعين وأقلهم من يجوز ذلك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم لا نعرفه إلا من هذا الوجه ‏.‏ وقد روي عن أبي هريرة من غير هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 3551,
			"arabicnumber": 3551,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان الثوري، عن عمرو بن مرة، عن عبد الله بن الحارث، عن طليق بن قيس، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يدعو يقول ‏ \"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر الهدى لي وانصرني على من بغى على رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطواعا لك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي وثبت حجتي وسدد لساني واهد قلبي واسلل سخيمة صدري ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمود بن غيلان وحدثنا محمد بن بشر العبدي، عن سفيان الثوري، بهذا الإسناد نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 3552,
			"arabicnumber": 3552,
			"text": "حدثنا هناد، حدثنا أبو الأحوص، عن أبي حمزة، عن إبراهيم، عن الأسود، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من دعا على من ظلمه فقد انتصر ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث أبي حمزة ‏.‏ وقد تكلم بعض أهل العلم في أبي حمزة من قبل حفظه وهو ميمون الأعور ‏.‏ حدثنا قتيبة، حدثنا حميد بن عبد الرحمن الرؤاسي، عن أبي الأحوص، عن أبي حمزة، بهذا الإسناد نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 3553,
			"arabicnumber": 3553,
			"text": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن حباب، قال وأخبرني سفيان الثوري، عن محمد بن عبد الرحمن بن أبي ليلى، عن الشعبي، عن عبد الرحمن بن أبي ليلى، عن أبي أيوب الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من قال عشر مرات لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير ‏.‏ كانت له عدل أربع رقاب من ولد إسماعيل ‏\"‏ ‏.‏ قال وقد روي هذا الحديث عن أبي أيوب موقوفا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 3554,
			"arabicnumber": 3554,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الصمد بن عبد الوارث، حدثنا هاشم، وهو ابن سعيد الكوفي حدثني كنانة، مولى صفية قال سمعت صفية، تقول دخل على رسول الله صلى الله عليه وسلم وبين يدى أربعة آلاف نواة أسبح بها فقلت لقد سبحت بهذه ‏.‏ فقال ‏\"‏ ألا أعلمك بأكثر مما سبحت به ‏\"‏ ‏.‏ فقلت بلى علمني ‏.‏ فقال ‏\"‏ قولي سبحان الله عدد خلقه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث صفية إلا من هذا الوجه من حديث هاشم بن سعيد الكوفي وليس إسناده بمعروف ‏.‏ وفي الباب عن ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 3555,
			"arabicnumber": 3555,
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن محمد بن عبد الرحمن، قال سمعت كريبا، يحدث عن ابن عباس، عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم مر عليها وهي في مسجد ثم مر النبي صلى الله عليه وسلم بها قريبا من نصف النهار فقال لها ‏\"‏ ما زلت على حالك ‏\"‏ ‏.‏ فقالت نعم ‏.‏ قال ‏\"‏ ألا أعلمك كلمات تقولينها سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى آل طلحة وهو شيخ مدني ثقة وقد روى عنه المسعودي وسفيان الثوري هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 3556,
			"arabicnumber": 3556,
			"text": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، قال أنبأنا جعفر بن ميمون، صاحب الأنماط عن أبي عثمان النهدي، عن سلمان الفارسي، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله حيي كريم يستحي إذا رفع الرجل إليه يديه أن يردهما صفرا خائبتين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ورواه بعضهم ولم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 3557,
			"arabicnumber": 3557,
			"text": "حدثنا محمد بن بشار، حدثنا صفوان بن عيسى، حدثنا محمد بن عجلان، عن القعقاع، عن أبي صالح، عن أبي هريرة، أن رجلا، كان يدعو بأصبعيه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أحد أحد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ ومعنى هذا الحديث إذا أشار الرجل بأصبعيه في الدعاء عند الشهادة لا يشير إلا بأصبع واحدة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 3558,
			"arabicnumber": 3558,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير، وهو ابن محمد عن عبد الله بن محمد بن عقيل، أن معاذ بن رفاعة، أخبره عن أبيه، قال قام أبو بكر الصديق على المنبر ثم بكى فقال قام رسول الله صلى الله عليه وسلم عام الأول على المنبر ثم بكى فقال ‏ \"‏ سلوا الله العفو والعافية فإن أحدا لم يعط بعد اليقين خيرا من العافية ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه عن أبي بكر رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 3559,
			"arabicnumber": 3559,
			"text": "حدثنا حسين بن يزيد الكوفي، حدثنا أبو يحيى الحماني، حدثنا عثمان بن واقد، عن أبي نصيرة، عن مولى، لأبي بكر عن أبي بكر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما أصر من استغفر ولو فعله في اليوم سبعين مرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث أبي نصيرة وليس إسناده بالقوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 3560,
			"arabicnumber": 3560,
			"text": "حدثنا يحيى بن موسى، وسفيان بن وكيع، - المعنى واحد قالا حدثنا يزيد بن هارون، حدثنا الأصبغ بن زيد، حدثنا أبو العلاء، عن أبي أمامة، قال لبس عمر بن الخطاب رضى الله عنه ثوبا جديدا فقال الحمد لله الذي كساني ما أواري به عورتي وأتجمل به في حياتي ‏.‏ ثم عمد إلى الثوب الذي أخلق فتصدق به ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من لبس ثوبا جديدا فقال الحمد لله الذي كساني ما أواري به عورتي وأتجمل به في حياتي ثم عمد إلى الثوب الذي أخلق فتصدق به كان في كنف الله وفي حفظ الله وفي ستر الله حيا وميتا ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ وقد رواه يحيى بن أيوب عن عبيد الله بن زحر عن علي بن يزيد عن القاسم عن أبي أمامة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 3561,
			"arabicnumber": 3561,
			"text": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن نافع الصائغ، قراءة عليه عن حماد بن أبي حميد، عن زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أن النبي صلى الله عليه وسلم بعث بعثا قبل نجد فغنموا غنائم كثيرة وأسرعوا الرجعة فقال رجل ممن لم يخرج ما رأينا بعثا أسرع رجعة ولا أفضل غنيمة من هذا البعث ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ ألا أدلكم على قوم أفضل غنيمة وأسرع رجعة قوم شهدوا صلاة الصبح ثم جلسوا يذكرون الله حتى طلعت عليهم الشمس فأولئك أسرع رجعة وأفضل غنيمة ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وحماد بن أبي حميد هو أبو إبراهيم الأنصاري المزني وهو محمد بن أبي حميد المدني وهو ضعيف في الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 3562,
			"arabicnumber": 3562,
			"text": "حدثنا سفيان بن وكيع، حدثنا أبي، عن سفيان، عن عاصم بن عبيد الله، عن سالم، عن ابن عمر، عن عمر، أنه استأذن النبي صلى الله عليه وسلم في العمرة فقال ‏ \"‏ أى أخى أشركنا في دعائك ولا تنسنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 3563,
			"arabicnumber": 3563,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يحيى بن حسان، حدثنا أبو معاوية، عن عبد الرحمن بن إسحاق، عن سيار، عن أبي وائل، عن علي، رضى الله عنه أن مكاتبا، جاءه فقال إني قد عجزت عن كتابتي فأعني ‏.‏ قال ألا أعلمك كلمات علمنيهن رسول الله صلى الله عليه وسلم لو كان عليك مثل جبل صير دينا أداه الله عنك قال ‏ \"‏ قل اللهم اكفني بحلالك عن حرامك وأغنني بفضلك عمن سواك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 3564,
			"arabicnumber": 3564,
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن علي، قال كنت شاكيا فمر بي رسول الله صلى الله عليه وسلم وأنا أقول اللهم إن كان أجلي قد حضر فأرحني وإن كان متأخرا فأرفغني وإن كان بلاء فصبرني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كيف قلت ‏\"‏ ‏.‏ قال فأعاد عليه ما قال قال فضربه برجله فقال ‏\"‏ اللهم عافه أو اشفه ‏\"‏ ‏.‏ شعبة الشاك ‏.‏ فما اشتكيت وجعي بعد ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 3565,
			"arabicnumber": 3565,
			"text": "حدثنا سفيان بن وكيع، حدثنا يحيى بن آدم، عن إسرائيل، عن أبي إسحاق، عن الحارث، عن علي، رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا عاد مريضا قال ‏ \"‏ اللهم أذهب البأس رب الناس واشف فأنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 3566,
			"arabicnumber": 3566,
			"text": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم كان يقول في وتره ‏ \"‏ اللهم إني أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من حديث علي لا نعرفه إلا من هذا الوجه من حديث حماد بن سلمة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 3567,
			"arabicnumber": 3567,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا زكريا بن عدي، حدثنا عبيد الله، هو ابن عمرو الرقي عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن دبر الصلاة ‏ \"‏ اللهم إني أعوذ بك من الجبن وأعوذ بك من البخل وأعوذ بك من أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن أبو إسحاق الهمداني مضطرب في هذا الحديث يقول عن عمرو بن ميمون عن عمر ويقول عن غيره ويضطرب فيه قال أبو عيسى هذا حديث حسن صحيح من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 3568,
			"arabicnumber": 3568,
			"text": "حدثنا أحمد بن الحسن، حدثنا أصبغ بن الفرج، أخبرني عبد الله بن وهب، عن عمرو بن الحارث، أنه أخبره عن سعيد بن أبي هلال، عن خزيمة، عن عائشة بنت سعد بن أبي وقاص، عن أبيها، أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى أو قال حصى تسبح به فقال ‏ \"‏ ألا أخبرك بما هو أيسر عليك من هذا أو أفضل سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض وسبحان الله عدد ما بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ولا حول ولا قوة إلا بالله مثل ذلك ‏\"‏ ‏.‏ قال وهذا حديث حسن غريب من حديث سعد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 3569,
			"arabicnumber": 3569,
			"text": "حدثنا سفيان بن وكيع، حدثنا عبد الله بن نمير، وزيد بن حباب، عن موسى بن عبيدة، عن محمد بن ثابت، عن أبي حكيم، خطمي مولى الزبير عن الزبير بن العوام، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من صباح يصبح العباد فيه إلا ومناد ينادي سبحوا الملك القدوس ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 3570,
			"arabicnumber": 3570,
			"text": "حدثنا أحمد بن الحسن، حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا الوليد بن مسلم، حدثنا ابن جريج، عن عطاء بن أبي رباح، وعكرمة، مولى ابن عباس عن ابن عباس، أنه قال بينما نحن عند رسول الله صلى الله عليه وسلم إذ جاءه علي بن أبي طالب فقال بأبي أنت وأمي تفلت هذا القرآن من صدري فما أجدني أقدر عليه ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا الحسن أفلا أعلمك كلمات ينفعك الله بهن وينفع بهن من علمته ويثبت ما تعلمت في صدرك ‏\"‏ ‏.‏ قال أجل يا رسول الله فعلمني ‏.‏ قال ‏\"‏ إذا كان ليلة الجمعة فإن استطعت أن تقوم في ثلث الليل الآخر فإنها ساعة مشهودة والدعاء فيها مستجاب وقد قال أخي يعقوب لبنيه ‏:‏ ‏(‏سوف أستغفر لكم ربي ‏)‏ يقول حتى تأتي ليلة الجمعة فإن لم تستطع فقم في وسطها فإن لم تستطع فقم في أولها فصل أربع ركعات تقرأ في الركعة الأولى بفاتحة الكتاب وسورة يس وفي الركعة الثانية بفاتحة الكتاب و‏(‏ حم ‏)‏ الدخان وفي الركعة الثالثة بفاتحة الكتاب والم تنزيل السجدة وفي الركعة الرابعة بفاتحة الكتاب وتبارك المفصل فإذا فرغت من التشهد فاحمد الله وأحسن الثناء على الله وصل على وأحسن وعلى سائر النبيين واستغفر للمؤمنين والمؤمنات ولإخوانك الذين سبقوك بالإيمان ثم قل في آخر ذلك اللهم ارحمني بترك المعاصي أبدا ما أبقيتني وارحمني أن أتكلف ما لا يعنيني وارزقني حسن النظر فيما يرضيك عني اللهم بديع السموات والأرض ذا الجلال والإكرام والعزة التي لا ترام أسألك يا الله يا رحمن بجلالك ونور وجهك أن تلزم قلبي حفظ كتابك كما علمتني وارزقني أن أتلوه على النحو الذي يرضيك عني اللهم بديع السموات والأرض ذا الجلال والإكرام والعزة التي لا ترام أسألك يا الله يا رحمن بجلالك ونور وجهك أن تنور بكتابك بصري وأن تطلق به لساني وأن تفرج به عن قلبي وأن تشرح به صدري وأن تغسل به بدني لأنه لا يعينني على الحق غيرك ولا يؤتيه إلا أنت ولا حول ولا قوة إلا بالله العلي العظيم يا أبا الحسن تفعل ذلك ثلاث جمع أو خمس أو سبع تجاب بإذن الله والذي بعثني بالحق ما أخطأ مؤمنا قط ‏\"‏ ‏.‏ قال عبد الله بن عباس فوالله ما لبث علي إلا خمسا أو سبعا حتى جاء علي رسول الله صلى الله عليه وسلم في مثل ذلك المجلس فقال يا رسول الله إني كنت فيما خلا لا آخذ إلا أربع آيات أو نحوهن وإذا قرأتهن على نفسي تفلتن وأنا أتعلم اليوم أربعين آية أو نحوها وإذا قرأتها على نفسي فكأنما كتاب الله بين عينى ولقد كنت أسمع الحديث فإذا رددته تفلت وأنا اليوم أسمع الأحاديث فإذا تحدثت بها لم أخرم منها حرفا ‏.‏ فقال له رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ مؤمن ورب الكعبة يا أبا الحسن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الوليد بن مسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 3571,
			"arabicnumber": 3571,
			"text": "حدثنا بشر بن معاذ العقدي البصري، حدثنا حماد بن واقد، عن إسرائيل، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ سلوا الله من فضله فإن الله عز وجل يحب أن يسأل وأفضل العبادة انتظار الفرج ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى حماد بن واقد هذا الحديث وقد خولف في روايته ‏.‏ وحماد بن واقد هذا هو الصفار ليس بالحافظ وهو عندنا شيخ بصري ‏.‏ وروى أبو نعيم هذا الحديث عن إسرائيل عن حكيم بن جبير عن رجل عن النبي صلى الله عليه وسلم مرسل وحديث أبي نعيم أشبه أن يكون أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 3572,
			"arabicnumber": 3572,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، حدثنا عاصم الأحول، عن أبي عثمان، عن زيد بن أرقم، رضى الله عنه قال كان النبي صلى الله عليه وسلم يقول ‏ \"‏ اللهم إني أعوذ بك من الكسل والعجز والبخل ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم أنه كان يتعوذ من الهرم وعذاب القبر ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 3573,
			"arabicnumber": 3573,
			"text": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن ابن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، أن عبادة بن الصامت، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على الأرض مسلم يدعو الله بدعوة إلا آتاه الله إياها أو صرف عنه من السوء مثلها ما لم يدع بمأثم أو قطيعة رحم ‏\"‏ ‏.‏ فقال رجل من القوم إذا نكثر ‏.‏ قال ‏\"‏ الله أكثر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وابن ثوبان هو عبد الرحمن بن ثابت بن ثوبان العابد الشامي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 3574,
			"arabicnumber": 3574,
			"text": "حدثنا سفيان بن وكيع، حدثنا جرير، عن منصور، عن سعد بن عبيدة، حدثني البراء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أخذت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن ثم قل اللهم أسلمت وجهي إليك وفوضت أمري إليك وألجأت ظهري إليك رهبة ورغبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت وبنبيك الذي أرسلت ‏.‏ فإن مت في ليلتك مت على الفطرة ‏\"‏ ‏.‏ قال فرددتهن لأستذكره فقلت آمنت برسولك الذي أرسلت فقال ‏\"‏ قل آمنت بنبيك الذي أرسلت ‏\"‏ ‏.‏ قال وهذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن البراء ولا نعلم في شيء من الروايات ذكر الوضوء إلا في هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 3575,
			"arabicnumber": 3575,
			"text": "حدثنا عبد بن حميد، حدثنا محمد بن إسماعيل بن أبي فديك، حدثنا ابن أبي ذئب، عن أبي سعيد البراد، عن معاذ بن عبد الله بن خبيب، عن أبيه، قال خرجنا في ليلة مطيرة وظلمة شديدة نطلب رسول الله صلى الله عليه وسلم يصلي لنا - قال - فأدركته فقال ‏\"‏ قل ‏\"‏ ‏.‏ فلم أقل شيئا ثم قال ‏\"‏ قل ‏\"‏ ‏.‏ فلم أقل شيئا ‏.‏ قال ‏\"‏ قل ‏\"‏ ‏.‏ قلت ما أقول قال ‏\"‏ قل ‏:‏ ‏(‏ هو الله أحد ‏)‏ والمعوذتين حين تمسي وتصبح ثلاث مرات تكفيك من كل شيء ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح غريب من هذا الوجه وأبو سعيد البراد هو أسيد بن أبي أسيد مدني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 3576,
			"arabicnumber": 3576,
			"text": "حدثنا أبو موسى، محمد بن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد بن خمير الشامي، عن عبد الله بن بسر، قال نزل رسول الله صلى الله عليه وسلم على أبي فقربنا إليه طعاما فأكل منه ثم أتي بتمر فكان يأكل ويلقي النوى بأصبعيه جمع السبابة والوسطى قال شعبة وهو ظني فيه إن شاء الله فألقى النوى بين أصبعين ثم أتي بشراب فشربه ثم ناوله الذي عن يمينه قال فقال أبي وأخذ بلجام دابته ادع لنا ‏.‏ فقال ‏ \"‏ اللهم بارك لهم فيما رزقتهم واغفر لهم وارحمهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روي أيضا من غير هذا الوجه عن عبد الله بن بسر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 3577,
			"arabicnumber": 3577,
			"text": "حدثنا محمد بن إسماعيل، حدثنا موسى بن إسماعيل، حدثنا حفص بن عمر الشني، حدثني أبي عمر بن مرة، قال سمعت بلال بن يسار بن زيد، مولى النبي صلى الله عليه وسلم حدثني أبي عن جدي سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ من قال أستغفر الله العظيم الذي لا إله إلا هو الحى القيوم وأتوب إليه ‏.‏ غفر له وإن كان فر من الزحف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 3578,
			"arabicnumber": 3578,
			"text": "حدثنا محمود بن غيلان، حدثنا عثمان بن عمر، حدثنا شعبة، عن أبي جعفر، عن عمارة بن خزيمة بن ثابت، عن عثمان بن حنيف، أن رجلا، ضرير البصر أتى النبي صلى الله عليه وسلم فقال ادع الله أن يعافيني ‏.‏ قال ‏\"‏ إن شئت دعوت وإن شئت صبرت فهو خير لك ‏\"‏ ‏.‏ قال فادعه ‏.‏ قال فأمره أن يتوضأ فيحسن وضوءه ويدعو بهذا الدعاء ‏\"‏ اللهم إني أسألك وأتوجه إليك بنبيك محمد نبي الرحمة إني توجهت بك إلى ربي في حاجتي هذه لتقضى لي اللهم فشفعه في ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب لا نعرفه إلا من هذا الوجه من حديث أبي جعفر وهو غير الخطمي وعثمان بن حنيف هو أخو سهل بن حنيف ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 3579,
			"arabicnumber": 3579,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا إسحاق بن عيسى، حدثني معن، حدثني معاوية بن صالح، عن ضمرة بن حبيب، قال سمعت أبا أمامة، رضي الله عنه يقول حدثني عمرو بن عبسة، أنه سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ أقرب ما يكون الرب من العبد في جوف الليل الآخر فإن استطعت أن تكون ممن يذكر الله في تلك الساعة فكن ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 3580,
			"arabicnumber": 3580,
			"text": "حدثنا أبو الوليد الدمشقي، أحمد بن عبد الرحمن بن بكار حدثنا الوليد بن مسلم، حدثنا عفير بن معدان، أنه سمع أبا دوس اليحصبي، يحدث عن ابن عائذ اليحصبي، عن عمارة بن زعكرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الله عز وجل يقول إن عبدي كل عبدي الذي يذكرني وهو ملاق قرنه ‏\"‏ ‏.‏ يعني عند القتال ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه ليس إسناده بالقوي ‏.‏ - ولا نعرف لعمارة بن زعكرة عن النبي صلى الله عليه وسلم إلا هذا الحديث الواحد ‏.‏ ومعنى قوله وهو ملاق قرنه ‏.‏ إنما يعني عند القتال يعني أن يذكر الله في تلك الساعة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 3581,
			"arabicnumber": 3581,
			"text": "حدثنا أبو موسى، محمد بن المثنى حدثنا وهب بن جرير، حدثنا أبي قال، سمعت منصور بن زاذان، يحدث عن ميمون بن أبي شبيب، عن قيس بن سعد بن عبادة، أن أباه، دفعه إلى النبي صلى الله عليه وسلم يخدمه ‏.‏ قال فمر بي النبي صلى الله عليه وسلم وقد صليت فضربني برجله وقال ‏\"‏ ألا أدلك على باب من أبواب الجنة ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 3582,
			"arabicnumber": 3582,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن عبيد الله بن أبي جعفر، عن صفوان بن سليم، قال ما نهض ملك من الأرض حتى قال لا حول ولا قوة إلا بالله ‏.‏",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 3583,
			"arabicnumber": 3583,
			"text": "حدثنا موسى بن حزام، وعبد بن حميد، وغير، واحد، قالوا حدثنا محمد بن بشر، فقال سمعت هانئ بن عثمان، عن أمه، حميضة بنت ياسر عن جدتها، يسيرة وكانت من المهاجرات قالت قال لنا رسول الله صلى الله عليه وسلم ‏ \"‏ عليكن بالتسبيح والتهليل والتقديس واعقدن بالأنامل فإنهن مسئولات مستنطقات ولا تغفلن فتنسين الرحمة ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من حديث هانئ بن عثمان وقد روى محمد بن ربيعة عن هانئ بن عثمان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 3584,
			"arabicnumber": 3584,
			"text": "حدثنا نصر بن علي الجهضمي، أخبرني أبي، عن المثنى بن سعيد، عن قتادة، عن أنس، قال كان النبي صلى الله عليه وسلم إذا غزا قال ‏ \"‏ اللهم أنت عضدي وأنت نصيري وبك أقاتل ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ومعنى قوله عضدي ‏.‏ يعني عوني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 3585,
			"arabicnumber": 3585,
			"text": "حدثنا أبو عمرو، مسلم بن عمرو الحذاء المديني حدثني عبد الله بن نافع، عن حماد بن أبي حميد، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏ \"‏ خير الدعاء دعاء يوم عرفة وخير ما قلت أنا والنبيون من قبلي لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏ وحماد بن أبي حميد هو محمد بن أبي حميد وهو أبو إبراهيم الأنصاري المدني وليس هو بالقوي عند أهل الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 3586,
			"arabicnumber": 3586,
			"text": "حدثنا محمد بن حميد، حدثنا علي بن أبي بكر، عن الجراح بن الضحاك الكندي، عن أبي شيبة، عن عبد الله بن عكيم، عن عمر بن الخطاب، قال علمني رسول الله صلى الله عليه وسلم قال ‏ \"‏ قل اللهم اجعل سريرتي خيرا من علانيتي واجعل علانيتي صالحة اللهم إني أسألك من صالح ما تؤتي الناس من المال والأهل والولد غير الضال ولا المضل ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه وليس إسناده بالقوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 3587,
			"arabicnumber": 3587,
			"text": "حدثنا عقبة بن مكرم، حدثنا سعيد بن سفيان الجحدري، حدثنا عبد الله بن معدان، أخبرني عاصم بن كليب الجرمي، عن أبيه، عن جده، قال دخلت على النبي صلى الله عليه وسلم وهو يصلي وقد وضع يده اليسرى على فخذه اليسرى ووضع يده اليمنى على فخذه اليمنى وقبض أصابعه وبسط السبابة وهو يقول ‏ \"‏ يا مقلب القلوب ثبت قلبي على دينك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 3588,
			"arabicnumber": 3588,
			"text": "حدثنا عبد الوارث بن عبد الصمد، حدثني أبي، حدثنا محمد بن سالم، حدثنا ثابت البناني، قال قال لي يا محمد إذا اشتكيت فضع يدك حيث تشتكي وقل بسم الله أعوذ بعزة الله وقدرته من شر ما أجد من وجعي هذا ثم ارفع يدك ثم أعد ذلك وترا فإن أنس بن مالك حدثني أن رسول الله صلى الله عليه وسلم حدثه بذلك ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ومحمد بن سالم هذا شيخ بصري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 3589,
			"arabicnumber": 3589,
			"text": "حدثنا حسين بن علي بن الأسود البغدادي، حدثنا محمد بن فضيل، عن عبد الرحمن بن إسحاق، عن حفصة بنت أبي كثير، عن أبيها أبي كثير، عن أم سلمة، قالت علمني رسول الله صلى الله عليه وسلم قال ‏ \"‏ قولي اللهم هذا استقبال ليلك وإدبار نهارك وأصوات دعاتك وحضور صلواتك أسألك أن تغفر لي ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من هذا الوجه ‏.‏ وحفصة بنت أبي كثير لا نعرفها ولا أباها ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 3590,
			"arabicnumber": 3590,
			"text": "حدثنا الحسين بن علي بن يزيد الصدائي البغدادي، حدثنا الوليد بن القاسم بن الوليد الهمداني، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما قال عبد لا إله إلا الله قط مخلصا إلا فتحت له أبواب السماء حتى تفضي إلى العرش ما اجتنب الكبائر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 3591,
			"arabicnumber": 3591,
			"text": "حدثنا سفيان بن وكيع، حدثنا أحمد بن بشير، وأبو أسامة عن مسعر، عن زياد بن علاقة، عن عمه، قال كان النبي صلى الله عليه وسلم يقول ‏ \"‏ اللهم إني أعوذ بك من منكرات الأخلاق والأعمال والأهواء ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وعم زياد بن علاقة هو قطبة بن مالك صاحب النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 3592,
			"arabicnumber": 3592,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا إسماعيل بن إبراهيم، حدثنا الحجاج بن أبي عثمان، عن أبي الزبير، عن عون بن عبد الله، عن ابن عمر، رضى الله عنهما قال بينما نحن نصلي مع رسول الله صلى الله عليه وسلم إذ قال رجل من القوم الله أكبر كبيرا والحمد لله كثيرا وسبحان الله بكرة وأصيلا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من القائل كذا وكذا ‏\"‏ ‏.‏ فقال رجل من القوم أنا يا رسول الله ‏.‏ قال ‏\"‏ عجبت لها فتحت لها أبواب السماء ‏\"‏ ‏.‏ قال ابن عمر ما تركتهن منذ سمعتهن من رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وحجاج بن أبي عثمان هو حجاج بن ميسرة الصواف ويكنى أبا الصلت وهو ثقة عند أهل الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 3593,
			"arabicnumber": 3593,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا إسماعيل بن إبراهيم، أخبرنا الجريري، عن أبي عبد الله الجسري، عن عبد الله بن الصامت، عن أبي ذر، رضى الله عنه أن رسول الله صلى الله عليه وسلم عاده أو أن أبا ذر عاد رسول الله صلى الله عليه وسلم فقال بأبي أنت يا رسول الله أى الكلام أحب إلى الله عز وجل قال ‏ \"‏ ما اصطفى الله لملائكته سبحان ربي وبحمده سبحان ربي وبحمده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 3594,
			"arabicnumber": 3594,
			"text": "حدثنا أبو هشام الرفاعي، محمد بن يزيد الكوفي حدثنا يحيى بن اليمان، حدثنا سفيان، عن زيد العمي، عن أبي إياس، معاوية بن قرة عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الدعاء لا يرد بين الأذان والإقامة ‏\"‏ ‏.‏ قالوا فماذا نقول يا رسول الله قال ‏\"‏ سلوا الله العافية في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد زاد يحيى بن اليمان في هذا الحديث هذا الحرف قالوا فماذا نقول قال ‏\"‏ سلوا الله العافية في الدنيا والآخرة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 3595,
			"arabicnumber": 3595,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، وعبد الرزاق، وأبو أحمد وأبو نعيم عن سفيان، عن زيد العمي، عن معاوية بن قرة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الدعاء لا يرد بين الأذان والإقامة ‏\"‏ ‏.‏ قال أبو عيسى وهكذا روى أبو إسحاق الهمداني هذا الحديث عن بريد بن أبي مريم الكوفي عن أنس عن النبي صلى الله عليه وسلم نحو هذا وهذا أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 3596,
			"arabicnumber": 3596,
			"text": "وحدثنا أبو كريب، محمد بن العلاء أخبرنا أبو معاوية، عن عمر بن راشد، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سبق المفردون ‏\"‏ ‏.‏ قالوا وما المفردون يا رسول الله قال ‏\"‏ المستهترون في ذكر الله يضع الذكر عنهم أثقالهم فيأتون يوم القيامة خفافا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 3597,
			"arabicnumber": 3597,
			"text": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لأن أقول سبحان الله والحمد لله ولا إله إلا الله والله أكبر أحب إلى مما طلعت عليه الشمس ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 3598,
			"arabicnumber": 3598,
			"text": "حدثنا أبو كريب، حدثنا عبد الله بن نمير، عن سعدان القبي، عن أبي مجاهد، عن أبي مدلة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاثة لا ترد دعوتهم الصائم حتى يفطر والإمام العادل ودعوة المظلوم يرفعها الله فوق الغمام ويفتح لها أبواب السماء ويقول الرب وعزتي لأنصرنك ولو بعد حين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وسعدان القبي هو سعدان بن بشر ‏.‏ وقد روى عنه عيسى بن يونس وأبو عاصم وغير واحد من كبار أهل الحديث وأبو مجاهد هو سعد الطائي وأبو مدلة هو مولى أم المؤمنين عائشة وإنما نعرفه بهذا الحديث ويروى عنه هذا الحديث أتم من هذا وأطول ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 3599,
			"arabicnumber": 3599,
			"text": "حدثنا أبو كريب، حدثنا عبد الله بن نمير، عن موسى بن عبيدة، عن محمد بن ثابت، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم انفعني بما علمتني وعلمني ما ينفعني وزدني علما الحمد لله على كل حال وأعوذ بالله من حال أهل النار ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 3600,
			"arabicnumber": 3600,
			"text": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، أو عن أبي سعيد الخدري، قالا قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن لله ملائكة سياحين في الأرض فضلا عن كتاب الناس فإذا وجدوا أقواما يذكرون الله تنادوا هلموا إلى بغيتكم فيجيئون فيحفون بهم إلى سماء الدنيا فيقول الله على أى شيء تركتم عبادي يصنعون فيقولون تركناهم يحمدونك ويمجدونك ويذكرونك ‏.‏ قال فيقول فهل رأوني فيقولون لا ‏.‏ قال فيقول فكيف لو رأوني قال فيقولون لو رأوك لكانوا أشد تحميدا وأشد تمجيدا وأشد لك ذكرا ‏.‏ قال فيقول وأى شيء يطلبون قال فيقولون يطلبون الجنة ‏.‏ قال فيقول وهل رأوها قال فيقولون لا ‏.‏ قال فيقول فكيف لو رأوها قال فيقولون لو رأوها كانوا لها أشد طلبا وأشد عليها حرصا ‏.‏ قال فيقول من أى شيء يتعوذون قالوا يتعوذون من النار ‏.‏ قال فيقول وهل رأوها فيقولون لا ‏.‏ فيقول فكيف لو رأوها فيقولون لو رأوها كانوا منها أشد هربا وأشد منها خوفا وأشد منها تعوذا ‏.‏ قال فيقول فإني أشهدكم أني قد غفرت لهم ‏.‏ فيقولون إن فيهم فلانا الخطاء لم يردهم إنما جاءهم لحاجة ‏.‏ فيقول هم القوم لا يشقى لهم جليس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي عن أبي هريرة من غير هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 3601,
			"arabicnumber": 3601,
			"text": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن هشام بن الغاز، عن مكحول، عن أبي هريرة، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أكثر من قول لا حول ولا قوة إلا بالله فإنها كنز من كنوز الجنة ‏\"‏ ‏.‏ قال مكحول فمن قال لا حول ولا قوة إلا بالله ولا منجا من الله إلا إليه ‏.‏ كشف عنه سبعين بابا من الضر أدناهن الفقر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بمتصل ‏.‏ مكحول لم يسمع من أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Maqtu"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 3602,
			"arabicnumber": 3602,
			"text": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لكل نبي دعوة مستجابة وإني اختبأت دعوتي شفاعة لأمتي وهي نائلة إن شاء الله من مات منهم لا يشرك بالله شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 3603,
			"arabicnumber": 3603,
			"text": "حدثنا أبو كريب، حدثنا ابن نمير، وأبو معاوية عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الله عز وجل أنا عند ظن عبدي بي وأنا معه حين يذكرني فإن ذكرني في نفسه ذكرته في نفسي وإن ذكرني في ملإ ذكرته في ملإ خير منهم وإن اقترب إلى شبرا اقتربت منه ذراعا وإن اقترب إلى ذراعا اقتربت إليه باعا وإن أتاني يمشي أتيته هرولة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ويروى عن الأعمش في تفسير هذا الحديث من تقرب مني شبرا تقربت منه ذراعا يعني بالمغفرة والرحمة وهكذا فسر بعض أهل العلم هذا الحديث ‏.‏ قالوا إنما معناه يقول إذا تقرب إلى العبد بطاعتي وما أمرت أسرع إليه بمغفرتي ورحمتي ‏.‏ وروي عن سعيد بن جبير، أنه قال في هذه الآية ‏:‏ ‏(‏ فاذكروني أذكركم ‏)‏ قال اذكروني بطاعتي أذكركم بمغفرتي ‏.‏ حدثنا عبد بن حميد قال حدثنا الحسن بن موسى وعمرو بن هاشم الرملي عن ابن لهيعة عن عطاء بن يسار عن سعيد بن جبير بهذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 3604,
			"arabicnumber": 3604,
			"text": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ استعيذوا بالله من عذاب جهنم استعيذوا بالله من عذاب القبر استعيذوا بالله من فتنة المسيح الدجال واستعيذوا بالله من فتنة المحيا والممات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 235
			}
		}
	]
}