{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"49": "Chapters on Virtues"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3605,
			"arabicnumber": 3605,
			"text": "حدثنا خلاد بن أسلم البغدادي، حدثنا محمد بن مصعب، حدثنا الأوزاعي، عن أبي عمار، عن واثلة بن الأسقع، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله اصطفى من ولد إبراهيم إسماعيل واصطفى من ولد إسماعيل بني كنانة واصطفى من بني كنانة قريشا واصطفى من قريش بني هاشم واصطفاني من بني هاشم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3606,
			"arabicnumber": 3606,
			"text": "حدثنا محمد بن إسماعيل، حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني شداد أبو عمار، حدثني واثلة بن الأسقع، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله اصطفى كنانة من ولد إسماعيل واصطفى قريشا من كنانة واصطفى هاشما من قريش واصطفاني من بني هاشم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3607,
			"arabicnumber": 3607,
			"text": "حدثنا يوسف بن موسى القطان البغدادي، حدثنا عبيد الله بن موسى، عن إسماعيل بن أبي خالد، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن العباس بن عبد المطلب، قال قلت يا رسول الله إن قريشا جلسوا فتذاكروا أحسابهم بينهم فجعلوا مثلك كمثل نخلة في كبوة من الأرض ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ إن الله خلق الخلق فجعلني من خيرهم من خير فرقهم وخير الفريقين ثم تخير القبائل فجعلني من خير قبيلة ثم تخير البيوت فجعلني من خير بيوتهم فأنا خيرهم نفسا وخيرهم بيتا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وعبد الله بن الحارث هو ابن نوفل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3608,
			"arabicnumber": 3608,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن المطلب بن أبي وداعة، قال جاء العباس إلى رسول الله صلى الله عليه وسلم فكأنه سمع شيئا فقام النبي صلى الله عليه وسلم على المنبر فقال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالوا أنت رسول الله عليك السلام ‏.‏ قال ‏\"‏ أنا محمد بن عبد الله بن عبد المطلب إن الله خلق الخلق فجعلني في خيرهم ثم جعلهم فرقتين فجعلني في خيرهم فرقة ثم جعلهم قبائل فجعلني في خيرهم قبيلة ثم جعلهم بيوتا فجعلني في خيرهم بيتا وخيرهم نفسا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروي عن سفيان الثوري عن يزيد بن أبي زياد نحو حديث إسماعيل بن أبي خالد عن يزيد بن أبي زياد عن عبد الله بن الحارث عن العباس بن عبد المطلب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3609,
			"arabicnumber": 3609,
			"text": "حدثنا أبو همام الوليد بن شجاع بن الوليد البغدادي، حدثنا الوليد بن مسلم، عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قالوا يا رسول الله متى وجبت لك النبوة قال ‏ \"‏ وآدم بين الروح والجسد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث أبي هريرة لا نعرفه إلا من هذا الوجه ‏.‏ وفي الباب عن ميسرة الفجر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3610,
			"arabicnumber": 3610,
			"text": "حدثنا الحسين بن يزيد الكوفي، حدثنا عبد السلام بن حرب، عن ليث، عن الربيع بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أنا أول الناس خروجا إذا بعثوا وأنا خطيبهم إذا وفدوا وأنا مبشرهم إذا أيسوا لواء الحمد يومئذ بيدي وأنا أكرم ولد آدم على ربي ولا فخر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3611,
			"arabicnumber": 3611,
			"text": "حدثنا الحسين بن يزيد، حدثنا عبد السلام بن حرب، عن يزيد أبي خالد، عن المنهال بن عمرو، عن عبد الله بن الحارث، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أنا أول من تنشق عنه الأرض فأكسى الحلة من حلل الجنة ثم أقوم عن يمين العرش ليس أحد من الخلائق يقوم ذلك المقام غيري ‏\"‏ ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3612,
			"arabicnumber": 3612,
			"text": "حدثنا بندار، حدثنا أبو عاصم، حدثنا سفيان الثوري، عن ليث، وهو ابن أبي سليم حدثني كعب، حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سلوا الله لي الوسيلة ‏\"‏ ‏.‏ قالوا يا رسول الله وما الوسيلة قال ‏\"‏ أعلى درجة في الجنة لا ينالها إلا رجل واحد أرجو أن أكون أنا هو ‏\"‏ ‏.‏ قال هذا حديث غريب إسناده ليس بالقوي ‏.‏ وكعب ليس هو بمعروف ولا نعلم أحدا روى عنه غير ليث بن أبي سليم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3613,
			"arabicnumber": 3613,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن الطفيل بن أبى بن كعب، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثلي في النبيين كمثل رجل بنى دارا فأحسنها وأكملها وأجملها وترك منها موضع لبنة فجعل الناس يطوفون بالبناء ويعجبون منه ويقولون لو تم موضع تلك اللبنة وأنا في النبيين موضع تلك اللبنة ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كان يوم القيامة كنت إمام النبيين وخطيبهم وصاحب شفاعتهم غير فخر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3614,
			"arabicnumber": 3614,
			"text": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة، أخبرنا كعب بن علقمة، سمع عبد الرحمن بن جبير، أنه سمع عبد الله بن عمرو، أنه سمع النبي صلى الله عليه وسلم يقول ‏ \"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول المؤذن ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو ومن سأل لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمد عبد الرحمن بن جبير هذا قرشي مصري مدني وعبد الرحمن بن جبير بن نفير شامي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3615,
			"arabicnumber": 3615,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن جدعان، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أنا سيد ولد آدم يوم القيامة ولا فخر وبيدي لواء الحمد ولا فخر وما من نبي يومئذ آدم فمن سواه إلا تحت لوائي وأنا أول من تنشق عنه الأرض ولا فخر ‏\"‏ ‏.‏ قال أبو عيسى وفي الحديث قصة وهذا حديث حسن ‏.‏ وقد روي بهذا الإسناد عن أبي نضرة عن ابن عباس عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3616,
			"arabicnumber": 3616,
			"text": "حدثنا علي بن نصر بن علي، حدثنا عبيد الله بن عبد المجيد، حدثنا زمعة بن صالح، عن سلمة بن وهرام، عن عكرمة، عن ابن عباس، قال جلس ناس من أصحاب رسول الله صلى الله عليه وسلم ينتظرونه قال فخرج حتى إذا دنا منهم سمعهم يتذاكرون فسمع حديثهم فقال بعضهم عجبا إن الله عز وجل اتخذ من خلقه خليلا اتخذ إبراهيم خليلا ‏.‏ وقال آخر ماذا بأعجب من كلام موسى كلمه تكليما وقال آخر فعيسى كلمة الله وروحه ‏.‏ وقال آخر آدم اصطفاه الله فخرج عليهم فسلم وقال ‏ \"‏ قد سمعت كلامكم وعجبكم إن إبراهيم خليل الله وهو كذلك وموسى نجي الله وهو كذلك وعيسى روح الله وكلمته وهو كذلك وآدم اصطفاه الله وهو كذلك ألا وأنا حبيب الله ولا فخر وأنا حامل لواء الحمد يوم القيامة ولا فخر وأنا أول شافع وأول مشفع يوم القيامة ولا فخر وأنا أول من يحرك حلق الجنة فيفتح الله لي فيدخلنيها ومعي فقراء المؤمنين ولا فخر وأنا أكرم الأولين والآخرين ولا فخر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3617,
			"arabicnumber": 3617,
			"text": "حدثنا زيد بن أخزم الطائي البصري، حدثنا أبو قتيبة، سلم بن قتيبة حدثني أبو مودود المدني، حدثنا عثمان بن الضحاك، عن محمد بن يوسف بن عبد الله بن سلام، عن أبيه، عن جده، قال مكتوب في التوراة صفة محمد وعيسى ابن مريم يدفن معه ‏.‏ قال فقال أبو مودود وقد بقي في البيت موضع قبر ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ هكذا قال عثمان بن الضحاك والمعروف الضحاك بن عثمان المدني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3618,
			"arabicnumber": 3618,
			"text": "حدثنا بشر بن هلال الصواف البصري، حدثنا جعفر بن سليمان الضبعي، عن ثابت، عن أنس بن مالك، قال لما كان اليوم الذي دخل فيه رسول الله صلى الله عليه وسلم المدينة أضاء منها كل شيء فلما كان اليوم الذي مات فيه أظلم منها كل شيء وما نفضنا عن رسول الله صلى الله عليه وسلم الأيدي وإنا لفي دفنه حتى أنكرنا قلوبنا ‏.‏ قال أبو عيسى هذا حديث غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3619,
			"arabicnumber": 3619,
			"text": "حدثنا محمد بن بشار العبدي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن المطلب بن عبد الله بن قيس بن مخرمة، عن أبيه، عن جده، قال ولدت أنا ورسول الله، صلى الله عليه وسلم عام الفيل ‏.‏ وسأل عثمان بن عفان قباث بن أشيم أخا بني يعمر بن ليث أأنت أكبر أم رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم أكبر مني وأنا أقدم منه في الميلاد ولد رسول الله صلى الله عليه وسلم عام الفيل ورفعت بي أمي على الموضع قال ورأيت خذق الفيل أخضر محيلا ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن إسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3620,
			"arabicnumber": 3620,
			"text": "حدثنا الفضل بن سهل أبو العباس الأعرج البغدادي، حدثنا عبد الرحمن بن غزوان أبو نوح، أخبرنا يونس بن أبي إسحاق، عن أبي بكر بن أبي موسى، عن أبيه، قال خرج أبو طالب إلى الشام وخرج معه النبي صلى الله عليه وسلم في أشياخ من قريش فلما أشرفوا على الراهب هبطوا فحلوا رحالهم فخرج إليهم الراهب وكانوا قبل ذلك يمرون به فلا يخرج إليهم ولا يلتفت ‏.‏ قال فهم يحلون رحالهم فجعل يتخللهم الراهب حتى جاء فأخذ بيد رسول الله صلى الله عليه وسلم قال هذا سيد العالمين هذا رسول رب العالمين يبعثه الله رحمة للعالمين ‏.‏ فقال له أشياخ من قريش ما علمك فقال إنكم حين أشرفتم من العقبة لم يبق شجر ولا حجر إلا خر ساجدا ولا يسجدان إلا لنبي وإني أعرفه بخاتم النبوة أسفل من غضروف كتفه مثل التفاحة ‏.‏ ثم رجع فصنع لهم طعاما فلما أتاهم به وكان هو في رعية الإبل قال أرسلوا إليه فأقبل وعليه غمامة تظله فلما دنا من القوم وجدهم قد سبقوه إلى فىء الشجرة فلما جلس مال فىء الشجرة عليه فقال انظروا إلى فىء الشجرة مال عليه ‏.‏ قال فبينما هو قائم عليهم وهو يناشدهم أن لا يذهبوا به إلى الروم فإن الروم إذا رأوه عرفوه بالصفة فيقتلونه فالتفت فإذا بسبعة قد أقبلوا من الروم فاستقبلهم فقال ما جاء بكم قالوا جئنا أن هذا النبي خارج في هذا الشهر فلم يبق طريق إلا بعث إليه بأناس وإنا قد أخبرنا خبره بعثنا إلى طريقك هذا فقال هل خلفكم أحد هو خير منكم قالوا إنما أخبرنا خبره بطريقك هذا ‏.‏ قال أفرأيتم أمرا أراد الله أن يقضيه هل يستطيع أحد من الناس رده قالوا لا ‏.‏ قال فبايعوه وأقاموا معه قال أنشدكم الله أيكم وليه قالوا أبو طالب فلم يزل يناشده حتى رده أبو طالب وبعث معه أبو بكر بلالا وزوده الراهب من الكعك والزيت ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3621,
			"arabicnumber": 3621,
			"text": "حدثنا محمد بن إسماعيل، حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن هشام بن حسان، عن عكرمة، عن ابن عباس، قال أنزل على رسول الله صلى الله عليه وسلم وهو ابن أربعين فأقام بمكة ثلاث عشرة وبالمدينة عشرا وتوفي وهو ابن ثلاث وستين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3622,
			"arabicnumber": 3622,
			"text": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن هشام، عن عكرمة، عن ابن عباس، قال قبض النبي صلى الله عليه وسلم وهو ابن خمس وستين وهكذا حدثنا هو يعني ابن بشار وروى عنه محمد بن إسماعيل مثل ذلك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3623,
			"arabicnumber": 3623,
			"text": "حدثنا قتيبة، عن مالك بن أنس، وحدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ربيعة بن أبي عبد الرحمن، أنه سمع أنس بن مالك، يقول لم يكن رسول الله صلى الله عليه وسلم بالطويل البائن ولا بالقصير المتردد ولا بالأبيض الأمهق ولا بالآدم وليس بالجعد القطط ولا بالسبط بعثه الله على رأس أربعين سنة فأقام بمكة عشر سنين وبالمدينة عشر سنين وتوفاه الله على رأس ستين سنة وليس في رأسه ولحيته عشرون شعرة بيضاء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3624,
			"arabicnumber": 3624,
			"text": "حدثنا محمد بن بشار، ومحمود بن غيلان، قالا أنبأنا أبو داود الطيالسي، حدثنا سليمان بن معاذ الضبي، عن سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن بمكة حجرا كان يسلم على ليالي بعثت إني لأعرفه الآن ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3625,
			"arabicnumber": 3625,
			"text": "حدثنا محمد بن بشار، حدثنا يزيد بن هارون، حدثنا سليمان التيمي، عن أبي العلاء، عن سمرة بن جندب، قال كنا مع رسول الله صلى الله عليه وسلم نتداول من قصعة من غدوة حتى الليل يقوم عشرة ويقعد عشرة ‏.‏ قلنا فما كانت تمد قال من أى شيء تعجب ما كانت تمد إلا من ها هنا وأشار بيده إلى السماء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو العلاء اسمه يزيد بن عبد الله بن الشخير ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3626,
			"arabicnumber": 3626,
			"text": "حدثنا عباد بن يعقوب الكوفي، حدثنا الوليد بن أبي ثور، عن السدي، عن عباد بن أبي يزيد، عن علي بن أبي طالب، قال كنت مع النبي صلى الله عليه وسلم بمكة فخرجنا في بعض نواحيها فما استقبله جبل ولا شجر إلا وهو يقول السلام عليك يا رسول الله ‏.‏ قال هذا حديث غريب ‏.‏ وروى غير واحد عن الوليد بن أبي ثور وقالوا عن عباد أبي يزيد منهم فروة بن أبي المغراء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3627,
			"arabicnumber": 3627,
			"text": "حدثنا محمود بن غيلان، حدثنا عمر بن يونس، عن عكرمة بن عمار، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم خطب إلى لزق جذع واتخذوا له منبرا فخطب عليه فحن الجذع حنين الناقة فنزل النبي صلى الله عليه وسلم فمسه فسكن ‏.‏ قال أبو عيسى وفي الباب عن أبى وجابر وابن عمر وسهل بن سعد وابن عباس وأم سلمة وحديث أنس حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3628,
			"arabicnumber": 3628,
			"text": "حدثنا محمد بن إسماعيل، حدثنا محمد بن سعيد، حدثنا شريك، عن سماك، عن أبي ظبيان، عن ابن عباس، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال بم أعرف أنك نبي قال ‏\"‏ إن دعوت هذا العذق من هذه النخلة أتشهد أني رسول الله ‏\"‏ ‏.‏ فدعاه رسول الله صلى الله عليه وسلم فجعل ينزل من النخلة حتى سقط إلى النبي صلى الله عليه وسلم ثم قال ‏\"‏ ارجع ‏\"‏ ‏.‏ فعاد فأسلم الأعرابي ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3629,
			"arabicnumber": 3629,
			"text": "حدثنا محمد بن بشار، بندار حدثنا أبو عاصم، حدثنا عزرة بن ثابت، حدثنا علباء بن أحمر، حدثنا أبو زيد بن أخطب، قال مسح رسول الله صلى الله عليه وسلم يده على وجهي ودعا لي قال عزرة إنه عاش مائة وعشرين سنة وليس في رأسه إلا شعرات بيض ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو زيد اسمه عمرو بن أخطب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3630,
			"arabicnumber": 3630,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، قال عرضت على مالك بن أنس عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول قال أبو طلحة لأم سليم لقد سمعت صوت، رسول الله صلى الله عليه وسلم - يعني ضعيفا - أعرف فيه الجوع فهل عندك من شيء فقالت نعم ‏.‏ فأخرجت أقراصا من شعير ثم أخرجت خمارا لها فلفت الخبز ببعضه ثم دسته في يدي وردتني ببعضه ثم أرسلتني إلى رسول الله صلى الله عليه وسلم قال فذهبت به إليه فوجدت رسول الله صلى الله عليه وسلم جالسا في المسجد ومعه الناس قال فقمت عليهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسلك أبو طلحة ‏\"‏ ‏.‏ فقلت نعم ‏.‏ قال ‏\"‏ بطعام ‏\"‏ ‏.‏ فقلت نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏ ‏.‏ قال فانطلقوا فانطلقت بين أيديهم حتى جئت أبا طلحة فأخبرته فقال أبو طلحة يا أم سليم قد جاء رسول الله صلى الله عليه وسلم والناس معه وليس عندنا ما نطعمهم ‏.‏ قالت أم سليم الله ورسوله أعلم ‏.‏ قال فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل رسول الله صلى الله عليه وسلم وأبو طلحة معه حتى دخلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي يا أم سليم ما عندك ‏\"‏ ‏.‏ فأتت بذلك الخبز فأمر به رسول الله صلى الله عليه وسلم ففت وعصرت أم سليم عكة لها فآدمته ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا فأكل القوم كلهم وشبعوا والقوم سبعون أو ثمانون رجلا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3631,
			"arabicnumber": 3631,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر والتمس الناس الوضوء فلم يجدوه فأتي رسول الله صلى الله عليه وسلم بوضوء فوضع رسول الله صلى الله عليه وسلم يده في ذلك الإناء وأمر الناس أن يتوضئوا منه ‏.‏ قال فرأيت الماء ينبع من تحت أصابعه فتوضأ الناس حتى توضئوا من عند آخرهم ‏.‏ قال أبو عيسى وفي الباب عن عمران بن حصين وابن مسعود وجابر وزياد بن الحارث الصدائي وحديث أنس حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3632,
			"arabicnumber": 3632,
			"text": "حدثنا الأنصاري، إسحاق بن موسى حدثنا يونس بن بكير، أخبرنا محمد بن إسحاق، حدثني الزهري، عن عروة، عن عائشة، أنها قالت أول ما ابتدئ به رسول الله صلى الله عليه وسلم من النبوة حين أراد الله كرامته ورحمة العباد به أن لا يرى شيئا إلا جاءت مثل فلق الصبح فمكث على ذلك ما شاء الله أن يمكث وحبب إليه الخلوة فلم يكن شيء أحب إليه من أن يخلو ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3633,
			"arabicnumber": 3633,
			"text": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال إنكم تعدون الآيات عذابا وإنا كنا نعدها على عهد رسول الله صلى الله عليه وسلم بركة لقد كنا نأكل الطعام مع النبي صلى الله عليه وسلم ونحن نسمع تسبيح الطعام ‏.‏ قال وأتي النبي صلى الله عليه وسلم بإناء فوضع يده فيه فجعل الماء ينبع من بين أصابعه فقال النبي صلى الله عليه وسلم ‏ \"‏ حى على الوضوء المبارك والبركة من السماء ‏\"‏ ‏.‏ حتى توضأنا كلنا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3634,
			"arabicnumber": 3634,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى، حدثنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أن الحارث بن هشام، سأل رسول الله صلى الله عليه وسلم كيف يأتيك الوحى فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أحيانا يأتيني في مثل صلصلة الجرس وهو أشد على وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول ‏\"‏ ‏.‏ قالت عائشة فلقد رأيت رسول الله صلى الله عليه وسلم ينزل عليه الوحى في اليوم الشديد البرد فيفصم عنه وإن جبينه ليتفصد عرقا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3635,
			"arabicnumber": 3635,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن أبي إسحاق، عن البراء، قال ما رأيت من ذي لمة في حلة حمراء أحسن من رسول الله صلى الله عليه وسلم له شعر يضرب منكبيه بعيد ما بين المنكبين لم يكن بالقصير ولا بالطويل ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3636,
			"arabicnumber": 3636,
			"text": "حدثنا سفيان بن وكيع، حدثنا حميد بن عبد الرحمن، حدثنا زهير، عن أبي إسحاق، قال سأل رجل البراء أكان وجه رسول الله صلى الله عليه وسلم مثل السيف قال لا مثل القمر ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3637,
			"arabicnumber": 3637,
			"text": "حدثنا محمد بن إسماعيل، حدثنا أبو نعيم، حدثنا المسعودي، عن عثمان بن مسلم بن هرمز، عن نافع بن جبير بن مطعم، عن علي، قال لم يكن رسول الله صلى الله عليه وسلم بالطويل ولا بالقصير شثن الكفين والقدمين ضخم الرأس ضخم الكراديس طويل المسربة إذا مشى تكفأ تكفؤا كأنما انحط من صبب لم أر قبله ولا بعده مثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا سفيان بن وكيع، حدثنا أبي، عن المسعودي، بهذا الإسناد نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3638,
			"arabicnumber": 3638,
			"text": "حدثنا أبو جعفر، محمد بن الحسين بن أبي حليمة من قصر الأحنف وأحمد بن عبدة الضبي وعلي بن حجر المعنى واحد قالوا حدثنا عيسى بن يونس، حدثنا عمر بن عبد الله، مولى غفرة حدثني إبراهيم بن محمد، من ولد علي بن أبي طالب قال كان علي رضى الله عنه إذا وصف النبي صلى الله عليه وسلم قال لم يكن بالطويل الممغط ولا بالقصير المتردد وكان ربعة من القوم ولم يكن بالجعد القطط ولا بالسبط كان جعدا رجلا ولم يكن بالمطهم ولا بالمكلثم وكان في الوجه تدوير أبيض مشرب أدعج العينين أهدب الأشفار جليل المشاش والكتد أجرد ذو مسربة شثن الكفين والقدمين إذا مشى تقلع كأنما يمشي في صبب وإذا التفت التفت معا بين كتفيه خاتم النبوة وهو خاتم النبيين أجود الناس كفا وأشرحهم صدرا وأصدق الناس لهجة وألينهم عريكة وأكرمهم عشرة من رآه بديهة هابه ومن خالطه معرفة أحبه يقول ناعته لم أر قبله ولا بعده مثله ‏.‏ قال أبو عيسى هذا حديث حسن غريب ليس إسناده بمتصل ‏.‏ قال أبو جعفر سمعت الأصمعي يقول في تفسيره صفة النبي صلى الله عليه وسلم الممغط الذاهب طولا ‏.‏ وسمعت أعرابيا يقول تمغط في نشابة أى مدها مدا شديدا ‏.‏ وأما المتردد فالداخل بعضه في بعض قصرا وأما القطط فالشديد الجعودة والرجل الذي في شعره حجونة قليلا وأما المطهم فالبادن الكثير اللحم وأما المكلثم فالمدور الوجه ‏.‏ وأما المشرب فهو الذي في بياضه حمرة والأدعج الشديد سواد العين والأهدب الطويل الأشفار والكتد مجتمع الكتفين وهو الكاهل والمسربة هو الشعر الدقيق الذي هو كأنه قضيب من الصدر إلى السرة ‏.‏ والشثن الغليظ الأصابع من الكفين والقدمين والتقلع أن يمشي بقوة والصبب الحدور يقول انحدرنا في صبوب وصبب وقوله جليل المشاش يريد رءوس المناكب والعشيرة الصحبة والعشير الصاحب والبديهة المفاجأة يقال بدهته بأمر أى فجأته ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3639,
			"arabicnumber": 3639,
			"text": "حدثنا حميد بن مسعدة، حدثنا حميد بن الأسود، عن أسامة بن زيد، عن الزهري، عن عروة، عن عائشة، قالت ما كان رسول الله صلى الله عليه وسلم يسرد سردكم هذا ولكنه كان يتكلم بكلام بينه فصل يحفظه من جلس إليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث الزهري وقد رواه يونس بن يزيد عن الزهري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3640,
			"arabicnumber": 3640,
			"text": "حدثنا محمد بن يحيى، حدثنا أبو قتيبة، سلم بن قتيبة عن عبد الله بن المثنى، عن ثمامة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يعيد الكلمة ثلاثا لتعقل عنه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب إنما نعرفه من حديث عبد الله بن المثنى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3641,
			"arabicnumber": 3641,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عبيد الله بن المغيرة، عن عبد الله بن الحارث بن جزء، قال ما رأيت أحدا أكثر تبسما من رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3642,
			"arabicnumber": 3642,
			"text": "وقد روي عن يزيد بن أبي حبيب، عن عبد الله بن الحارث بن جزء، مثل هذا ‏.‏ حدثنا بذلك، أحمد بن خالد الخلال حدثنا يحيى بن إسحاق السيلحاني، حدثنا الليث بن سعد، عن يزيد بن أبي حبيب، عن عبد الله بن الحارث بن جزء، قال ما كان ضحك رسول الله صلى الله عليه وسلم إلا تبسما ‏.‏ قال أبو عيسى هذا حديث صحيح غريب لا نعرفه من حديث ليث بن سعد إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3643,
			"arabicnumber": 3643,
			"text": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن الجعد بن عبد الرحمن، قال سمعت السائب بن يزيد، يقول ذهبت بي خالتي إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع فمسح برأسي ودعا لي بالبركة وتوضأ فشربت من وضوئه فقمت خلف ظهره فنظرت إلى الخاتم بين كتفيه فإذا هو مثل زر الحجلة ‏.‏ قال أبو عيسى الزر يقال بيض لها ‏.‏ قال أبو عيسى وفي الباب عن سلمان وقرة بن إياس المزني وجابر بن سمرة وأبي رمثة وبريدة الأسلمي وعبد الله بن سرجس وعمرو بن أخطب وأبي سعيد ‏.‏ وهذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3644,
			"arabicnumber": 3644,
			"text": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا أيوب بن جابر، عن سماك بن حرب، عن جابر بن سمرة، قال كان خاتم رسول الله صلى الله عليه وسلم - يعني الذي بين كتفيه غدة حمراء مثل بيضة الحمامة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3645,
			"arabicnumber": 3645,
			"text": "حدثنا أحمد بن منيع، حدثنا عباد بن العوام، أخبرنا الحجاج، هو ابن أرطاة عن سماك بن حرب، عن جابر بن سمرة، قال كان في ساقى رسول الله صلى الله عليه وسلم حموشة وكان لا يضحك إلا تبسما وكنت إذا نظرت إليه قلت أكحل العينين وليس بأكحل ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3646,
			"arabicnumber": 3646,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو قطن، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم ضليع الفم أشكل العينين منهوس العقب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3647,
			"arabicnumber": 3647,
			"text": "حدثنا أبو موسى، محمد بن المثنى قال حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم ضليع الفم أشكل العينين منهوش العقب ‏.‏ قال شعبة قلت لسماك ما ضليع الفم قال واسع الفم ‏.‏ قلت ما أشكل العين قال طويل شق العين ‏.‏ قال قلت ما منهوش العقب قال قليل اللحم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3648,
			"arabicnumber": 3648,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن أبي يونس، عن أبي هريرة، قال ما رأيت شيئا أحسن من رسول الله صلى الله عليه وسلم كأن الشمس تجري في وجهه وما رأيت أحدا أسرع في مشيه من رسول الله صلى الله عليه وسلم كأنما الأرض تطوى له إنا لنجهد أنفسنا وإنه لغير مكترث ‏.‏ قال هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3649,
			"arabicnumber": 3649,
			"text": "حدثنا قتيبة، حدثنا الليث، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ عرض على الأنبياء فإذا موسى ضرب من الرجال كأنه من رجال شنوءة ورأيت عيسى ابن مريم فإذا أقرب الناس من رأيت به شبها عروة بن مسعود ورأيت إبراهيم فإذا أقرب من رأيت به شبها صاحبكم نفسه ورأيت جبريل فإذا أقرب من رأيت به شبها دحية ‏\"‏ ‏.‏ هو ابن خليفة الكلبي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3650,
			"arabicnumber": 3650,
			"text": "حدثنا أحمد بن منيع، ويعقوب بن إبراهيم الدورقي، قالا حدثنا إسماعيل ابن علية، عن خالد الحذاء، حدثني عمار، مولى بني هاشم قال سمعت ابن عباس، يقول توفي رسول الله صلى الله عليه وسلم وهو ابن خمس وستين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3651,
			"arabicnumber": 3651,
			"text": "حدثنا نصر بن علي الجهضمي،قال حدثنا بشر بن المفضل،قال حدثنا خالد الحذاء،قال حدثنا عمار، مولى بني هاشم قال حدثنا ابن عباس، أن النبي صلى الله عليه وسلم توفي وهو ابن خمس وستين ‏.‏ قال أبو عيسى هذا حديث حسن الإسناد صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3652,
			"arabicnumber": 3652,
			"text": "حدثنا أحمد بن منيع، قال حدثنا روح بن عبادة، قال حدثنا زكريا بن إسحاق، قال حدثنا عمرو بن دينار، عن ابن عباس، قال مكث النبي صلى الله عليه وسلم بمكة ثلاث عشرة - يعني يوحى إليه وتوفي وهو ابن ثلاث وستين ‏.‏ قال أبو عيسى وفي الباب عن عائشة وأنس بن مالك ودغفل بن حنظلة ولا يصح لدغفل سماع من النبي صلى الله عليه وسلم ولا رؤية ‏.‏ وحديث ابن عباس حديث حسن غريب من حديث عمرو بن دينار ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3653,
			"arabicnumber": 3653,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن أبي إسحاق، عن عامر بن سعد، عن جرير بن عبد الله، عن معاوية بن أبي سفيان، أنه قال سمعته يخطب، يقول مات رسول الله صلى الله عليه وسلم وهو ابن ثلاث وستين وأبو بكر وعمر وأنا ابن ثلاث وستين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3654,
			"arabicnumber": 3654,
			"text": "حدثنا العباس العنبري والحسين بن مهدي البصري، قالا حدثنا عبد الرزاق، عن ابن جريج، قال أخبرت عن ابن شهاب الزهري، عن عروة، عن عائشة، وقال الحسين بن مهدي، في حديثه ابن جريج عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم مات وهو ابن ثلاث وستين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه ابن أخي الزهري عن الزهري عن عروة عن عائشة مثل هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3655,
			"arabicnumber": 3655,
			"text": "حدثنا محمود بن غيلان، قال حدثنا عبد الرزاق، قال أخبرنا الثوري، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أبرأ إلى كل خليل من خله ولو كنت متخذا خليلا لاتخذت ابن أبي قحافة خليلا وإن صاحبكم خليل الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي سعيد وأبي هريرة وابن الزبير وابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3656,
			"arabicnumber": 3656,
			"text": "حدثنا إبراهيم بن سعيد الجوهري، قال حدثنا إسماعيل بن أبي أويس، عن سليمان بن بلال، عن هشام بن عروة، عن أبيه، عن عائشة، عن عمر بن الخطاب، قال أبو بكر سيدنا وخيرنا وأحبنا إلى رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3657,
			"arabicnumber": 3657,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، قال حدثنا إسماعيل بن إبراهيم، عن الجريري، عن عبد الله بن شقيق، قال قلت لعائشة أى أصحاب رسول الله صلى الله عليه وسلم كان أحب إلى رسول الله قالت أبو بكر ‏.‏ قلت ثم من قالت عمر ‏.‏ قلت ثم من قالت ثم أبو عبيدة بن الجراح ‏.‏ قلت ثم من قال فسكتت ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3658,
			"arabicnumber": 3658,
			"text": "حدثنا قتيبة، قال حدثنا محمد بن فضيل، عن سالم بن أبي حفصة، والأعمش، وعبد الله بن صهبان، وابن أبي ليلى، وكثير النواء، كلهم عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن أهل الدرجات العلى ليراهم من تحتهم كما ترون النجم الطالع في أفق السماء وإن أبا بكر وعمر منهم وأنعما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وقد روي من غير وجه عن عطية عن أبي سعيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3659,
			"arabicnumber": 3659,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن ابن أبي المعلى، عن أبيه، أن رسول الله صلى الله عليه وسلم خطب يوما فقال ‏\"‏ إن رجلا خيره ربه بين أن يعيش في الدنيا ما شاء أن يعيش ويأكل في الدنيا ما شاء أن يأكل وبين لقاء ربه فاختار لقاء ربه ‏\"‏ ‏.‏ قال فبكى أبو بكر فقال أصحاب النبي صلى الله عليه وسلم ألا تعجبون من هذا الشيخ إذ ذكر رسول الله صلى الله عليه وسلم رجلا صالحا خيره ربه بين الدنيا وبين لقاء ربه فاختار لقاء ربه ‏.‏ قال فكان أبو بكر أعلمهم بما قال رسول الله صلى الله عليه وسلم فقال أبو بكر بل نفديك بآبائنا وأموالنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما من الناس أحد أمن إلينا في صحبته وذات يده من ابن أبي قحافة ولو كنت متخذا خليلا لاتخذت ابن أبي قحافة خليلا ولكن ود وإخاء إيمان ود وإخاء إيمان مرتين أو ثلاثا وإن صاحبكم خليل الله ‏\"‏ وقد روي هذا الحديث عن أبي عوانة عن عبد الملك بن عمير بإسناد غير هذا ‏.‏ ومعنى قوله أمن إلينا يعني أمن علينا ‏.‏ وفي الباب عن أبي سعيد وهذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3660,
			"arabicnumber": 3660,
			"text": "حدثنا أحمد بن الحسن، قال حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن أبي النضر، عن عبيد بن حنين، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم جلس على المنبر فقال ‏\"‏ إن عبدا خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عنده فاختار ما عنده ‏\"‏ ‏.‏ فقال أبو بكر فديناك يا رسول الله بآبائنا وأمهاتنا ‏.‏ قال فعجبنا فقال الناس انظروا إلى هذا الشيخ يخبر رسول الله عن عبد خيره الله بين أن يؤتيه من زهرة الدنيا ما شاء وبين ما عند الله وهو يقول فديناك بآبائنا وأمهاتنا ‏.‏ قال فكان رسول الله هو المخير وكان أبو بكر هو أعلمنا به فقال النبي صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبو بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ولكن أخوة الإسلام لا تبقين في المسجد خوخة إلا خوخة أبي بكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3661,
			"arabicnumber": 3661,
			"text": "حدثنا علي بن الحسن الكوفي،قال حدثنا محبوب بن محرز القواريري، عن داود بن يزيد الأودي، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما لأحد عندنا يد إلا وقد كافيناه ما خلا أبا بكر فإن له عندنا يدا يكافئه الله بها يوم القيامة وما نفعني مال أحد قط ما نفعني مال أبي بكر ولو كنت متخذا خليلا لاتخذت أبا بكر خليلا ألا وإن صاحبكم خليل الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3662,
			"arabicnumber": 3662,
			"text": "حدثنا الحسن بن الصباح البزار، قال حدثنا سفيان بن عيينة، عن زائدة، عن عبد الملك بن عمير، عن ربعي، وهو ابن حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اقتدوا باللذين من بعدي أبي بكر وعمر ‏\"‏ ‏.‏ حدثنا أحمد بن منيع، وغير واحد، قالوا حدثنا سفيان بن عيينة، عن عبد الملك بن عمير نحوه وكان سفيان بن عيينة يدلس في هذا الحديث فربما ذكره عن زائدة عن عبد الملك بن عمير وربما لم يذكر فيه عن زائدة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وفيه عن ابن مسعود ‏.‏ وروى سفيان الثوري هذا الحديث عن عبد الملك بن عمير عن مولى لربعي عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير هذا الوجه أيضا عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏ ورواه سالم الأنعمي كوفي عن ربعي بن حراش عن حذيفة",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3663,
			"arabicnumber": 3663,
			"text": "حدثنا سعيد بن يحيى بن سعيد الأموي، قال حدثنا وكيع، عن سالم أبي العلاء المرادي، عن عمرو بن هرم، عن ربعي بن حراش، عن حذيفة، رضى الله عنه قال كنا جلوسا عند النبي صلى الله عليه وسلم فقال ‏ \"‏ إني لا أدري ما بقائي فيكم فاقتدوا باللذين من بعدي ‏\"‏ ‏.‏ وأشار إلى أبي بكر وعمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3664,
			"arabicnumber": 3664,
			"text": "حدثنا الحسن بن الصباح البزار، قال حدثنا محمد بن كثير العبدي، عن الأوزاعي، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم لأبي بكر وعمر ‏ \"‏ هذان سيدا كهول أهل الجنة من الأولين والآخرين إلا النبيين والمرسلين ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3665,
			"arabicnumber": 3665,
			"text": "حدثنا علي بن حجر، قال أخبرنا الوليد بن محمد الموقري، عن الزهري، عن علي بن الحسين، عن علي بن أبي طالب، قال كنت مع رسول الله صلى الله عليه وسلم إذ طلع أبو بكر وعمر فقال رسول الله صلى الله عليه وسلم ‏ \"‏ هذان سيدا كهول أهل الجنة من الأولين والآخرين إلا النبيين والمرسلين يا علي لا تخبرهما ‏\"‏ ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏ والوليد بن محمد الموقري يضعف في الحديث ولم يسمع علي بن الحسين من علي بن أبي طالب ‏.‏ وقد روي هذا الحديث عن علي من غير هذا الوجه ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3666,
			"arabicnumber": 3666,
			"text": "حدثنا يعقوب بن إبراهيم الدورقي، قال حدثنا سفيان بن عيينة، قال ذكر داود عن الشعبي، عن الحارث، عن علي، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أبو بكر وعمر سيدا كهول أهل الجنة من الأولين والآخرين ما خلا النبيين والمرسلين لا تخبرهما يا علي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3667,
			"arabicnumber": 3667,
			"text": "حدثنا أبو سعيد الأشج، قال حدثنا عقبة بن خالد، قال حدثنا شعبة، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال قال أبو بكر ألست أحق الناس بها ألست أول من أسلم ألست صاحب كذا ألست صاحب كذا ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قد رواه بعضهم، عن شعبة، عن الجريري، عن أبي نضرة، قال قال أبو بكر وهذا أصح ‏.‏ حدثنا بذلك، محمد بن بشار قال حدثنا عبد الرحمن بن مهدي، عن شعبة، عن الجريري، عن أبي نضرة، قال قال أبو بكر فذكر نحوه بمعناه ولم يذكر فيه عن أبي سعيد وهذا أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3668,
			"arabicnumber": 3668,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود، قال حدثنا الحكم بن عطية، عن ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم كان يخرج على أصحابه من المهاجرين والأنصار وهم جلوس فيهم أبو بكر وعمر فلا يرفع إليه أحد منهم بصره إلا أبو بكر وعمر فإنهما كانا ينظران إليه وينظر إليهما ويتبسمان إليه ويتبسم إليهما ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث الحكم بن عطية ‏.‏ وقد تكلم بعضهم في الحكم بن عطية ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3669,
			"arabicnumber": 3669,
			"text": "حدثنا عمر بن إسماعيل بن مجالد، قال حدثنا سعيد بن مسلمة، عن إسماعيل بن أمية، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم خرج ذات يوم ودخل المسجد وأبو بكر وعمر أحدهما عن يمينه والآخر عن شماله وهو آخذ بأيديهما وقال ‏ \"‏ هكذا نبعث يوم القيامة ‏\"‏ ‏. قال أبو عيسى هذا حديث غريب ‏.‏ ‏ وسعيد بن مسلمة ليس عندهم بالقوي ‏.‏ وقد روي هذا الحديث أيضا من غير هذا الوجه عن نافع عن ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3670,
			"arabicnumber": 3670,
			"text": "حدثنا يوسف بن موسى القطان البغدادي، قال حدثنا مالك بن إسماعيل، عن منصور بن أبي الأسود، قال حدثني كثير أبو إسماعيل، عن جميع بن عمير التيمي، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال لأبي بكر ‏ \"‏ أنت صاحبي على الحوض وصاحبي في الغار ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3671,
			"arabicnumber": 3671,
			"text": "حدثنا قتيبة، قال حدثنا ابن أبي فديك، عن عبد العزيز بن المطلب، عن أبيه، عن جده عبد الله بن حنطب، أن رسول الله صلى الله عليه وسلم رأى أبا بكر وعمر فقال ‏ \"‏ هذان السمع والبصر ‏\"‏ ‏.‏وفي الباب عن عبد الله بن عمرو وهذا حديث مرسل وعبد الله بن حنطب لم يدرك النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3672,
			"arabicnumber": 3672,
			"text": "حدثناإسحاق بن موسى الأنصاري قال حدثنا معن، قال حدثنا مالك بن أنس، عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت عائشة يا رسول الله إن أبا بكر إذا قام مقامك لم يسمع الناس من البكاء فأمر عمر فليصل بالناس ‏.‏ قالت فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ قالت عائشة فقلت لحفصة قولي له إن أبا بكر إذا قام مقامك لم يسمع الناس من البكاء فأمر عمر فليصل بالناس ففعلت حفصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنكن لأنتن صواحب يوسف مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت حفصة لعائشة ما كنت لأصيب منك خيرا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن عبد الله بن مسعود وأبي موسى وابن عباس وسالم بن عبيد وعبد الله بن زمعة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3673,
			"arabicnumber": 3673,
			"text": "حدثنا نصر بن عبد الرحمن الكوفي، قال حدثنا أحمد بن بشير، عن عيسى بن ميمون الأنصاري، عن القاسم بن محمد، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا ينبغي لقوم فيهم أبو بكر أن يؤمهم غيره ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3674,
			"arabicnumber": 3674,
			"text": "حدثنا إسحاق بن موسى الأنصاري، قال حدثنا معن، قال حدثنا مالك بن أنس، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله نودي في الجنة يا عبد الله هذا خير فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ فقال أبو بكر بأبي أنت وأمي ما على من دعي من هذه الأبواب من ضرورة فهل يدعى أحد من تلك الأبواب كلها قال ‏\"‏ نعم وأرجو أن تكون منهم ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3675,
			"arabicnumber": 3675,
			"text": "حدثنا هارون بن عبد الله البزاز البغدادي، قال حدثنا الفضل بن دكين، قال حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر بن الخطاب، يقول أمرنا رسول الله صلى الله عليه وسلم أن نتصدق فوافق ذلك عندي مالا فقلت اليوم أسبق أبا بكر إن سبقته يوما قال فجئت بنصف مالي فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أبقيت لأهلك ‏\"‏ ‏.‏ قلت مثله وأتى أبو بكر بكل ما عنده فقال ‏\"‏ يا أبا بكر ما أبقيت لأهلك ‏\"‏ ‏.‏ قال أبقيت لهم الله ورسوله قلت والله لا أسبقه إلى شيء أبدا ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3676,
			"arabicnumber": 3676,
			"text": "حدثنا عبد بن حميد، قال حدثنا يعقوب بن إبراهيم بن سعد، قال حدثنا أبي، عن أبيه، قال أخبرني محمد بن جبير بن مطعم، عن أبيه، جبير بن مطعم أخبره أن رسول الله صلى الله عليه وسلم أتته امرأة فكلمته في شيء وأمرها بأمر فقالت أرأيت يا رسول الله إن لم أجدك قال ‏ \"‏ فإن لم تجديني فأت أبا بكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3677,
			"arabicnumber": 3677,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود، قال أنبأنا شعبة، عن سعد بن إبراهيم، قال سمعت أبا سلمة بن عبد الرحمن، يحدث عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا رجل راكب بقرة إذ قالت لم أخلق لهذا إنما خلقت للحرث ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آمنت بذلك أنا وأبو بكر وعمر ‏\"‏ ‏.‏ قال أبو سلمة وما هما في القوم يومئذ والله أعلم ‏.‏ حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3678,
			"arabicnumber": 3678,
			"text": "حدثنا محمد بن حميد، قال حدثنا إبراهيم بن المختار، عن إسحاق بن راشد، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم أمر بسد الأبواب إلا باب أبي بكر ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏ وفي الباب عن أبي سعيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3679,
			"arabicnumber": 3679,
			"text": "حدثنا الأنصاري، قال حدثنا معن، قال حدثنا إسحاق بن يحيى بن طلحة، عن عمه إسحاق بن طلحة عن عائشة، أن أبا بكر، دخل على رسول الله صلى الله عليه وسلم فقال ‏ \"‏ أنت عتيق الله من النار ‏\"‏ ‏.‏ فيومئذ سمي عتيقا ‏.‏ هذا حديث غريب ‏.‏ وروى بعضهم هذا الحديث عن معن وقال عن موسى بن طلحة عن عائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3680,
			"arabicnumber": 3680,
			"text": "حدثنا أبو سعيد الأشج، قال حدثنا تليد بن سليمان، عن أبي الجحاف، عن عطية، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من نبي إلا له وزيران من أهل السماء ووزيران من أهل الأرض فأما وزيراى من أهل السماء فجبريل وميكائيل وأما وزيراى من أهل الأرض فأبو بكر وعمر ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏ وأبو الجحاف اسمه داود بن أبي عوف ‏.‏ ويروى عن سفيان الثوري ‏.‏ قال حدثنا أبو الجحاف وكان مرضيا وتليد بن سليمان يكنى أبا إدريس وهو شيعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3681,
			"arabicnumber": 3681,
			"text": "حدثنا محمد بن بشار، ومحمد بن رافع، قالا حدثنا أبو عامر العقدي، قال حدثنا خارجة بن عبد الله الأنصاري، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ اللهم أعز الإسلام بأحب هذين الرجلين إليك بأبي جهل أو بعمر بن الخطاب ‏\"‏ ‏.‏ قال وكان أحبهما إليه عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3682,
			"arabicnumber": 3682,
			"text": "حدثنا محمد بن بشار، قال حدثنا أبو عامر العقدي، قال حدثنا خارجة بن عبد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن الله جعل الحق على لسان عمر وقلبه ‏\"‏ ‏.‏ وقال ابن عمر ما نزل بالناس أمر قط فقالوا فيه وقال فيه عمر أو قال ابن الخطاب فيه شك خارجة إلا نزل فيه القرآن على نحو ما قال عمر ‏.‏ قال أبو عيسى وفي الباب عن الفضل بن العباس وأبي ذر وأبي هريرة وهذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وخارجة بن عبد الله الأنصاري هو ابن سليمان بن زيد بن ثابت وهو ثقة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3683,
			"arabicnumber": 3683,
			"text": "حدثنا أبو كريب، قال حدثنا يونس بن بكير، عن النضر أبي عمر، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ اللهم أعز الإسلام بأبي جهل بن هشام أو بعمر ‏\"‏ ‏.‏ قال فأصبح فغدا عمر على رسول الله صلى الله عليه وسلم فأسلم ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وقد تكلم بعضهم في النضر أبي عمر وهو يروي مناكير من قبل حفظه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3684,
			"arabicnumber": 3684,
			"text": "حدثنا محمد بن المثنى، قال حدثنا عبد الله بن داود الواسطي أبو محمد، قال حدثني عبد الرحمن ابن أخي محمد بن المنكدر عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال عمر لأبي بكر يا خير الناس بعد رسول الله ‏.‏ فقال أبو بكر أما إنك إن قلت ذاك فلقد سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما طلعت الشمس على رجل خير من عمر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وليس إسناده بذاك ‏.‏ وفي الباب عن أبي الدرداء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3685,
			"arabicnumber": 3685,
			"text": "حدثنا محمد بن المثنى، قال حدثنا عبد الله بن داود، عن حماد بن زيد، عن أيوب، عن محمد بن سيرين، قال ما أظن رجلا ينتقص أبا بكر وعمر يحب النبي صلى الله عليه وسلم ‏.‏ قال هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3686,
			"arabicnumber": 3686,
			"text": "حدثنا سلمة بن شبيب، قال حدثنا المقرئ، عن حيوة بن شريح، عن بكر بن عمرو، عن مشرح بن هاعان، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو كان بعدي نبي لكان عمر بن الخطاب ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث مشرح بن هاعان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3687,
			"arabicnumber": 3687,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن عقيل، عن الزهري، عن حمزة بن عبد الله بن عمر، عن ابن عمر، رضى الله عنهما قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رأيت كأني أتيت بقدح من لبن فشربت منه فأعطيت فضلي عمر بن الخطاب ‏\"‏ ‏.‏ قالوا فما أولته يا رسول الله قال ‏\"‏ العلم ‏\"‏ ‏.‏هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3688,
			"arabicnumber": 3688,
			"text": "حدثنا علي بن حجر، قال حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ دخلت الجنة فإذا أنا بقصر من ذهب فقلت لمن هذا القصر قالوا لشاب من قريش فظننت أني أنا هو فقلت ومن هو فقالوا عمر بن الخطاب ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3689,
			"arabicnumber": 3689,
			"text": "حدثنا الحسين بن حريث أبو عمار المروزي، قال حدثنا علي بن الحسين بن واقد، قال حدثني أبي، قال حدثني عبد الله بن بريدة، قال حدثني أبي بريدة، قال أصبح رسول الله صلى الله عليه وسلم فدعا بلالا فقال ‏\"‏ يا بلال بم سبقتني إلى الجنة ما دخلت الجنة قط إلا سمعت خشخشتك أمامي دخلت البارحة الجنة فسمعت خشخشتك أمامي فأتيت على قصر مربع مشرف من ذهب فقلت لمن هذا القصر فقالوا لرجل من العرب فقلت أنا عربي لمن هذا القصر قالوا لرجل من قريش قلت أنا قرشي لمن هذا القصر قالوا لرجل من أمة محمد قلت أنا محمد لمن هذا القصر قالوا لعمر بن الخطاب ‏\"‏ ‏.‏ فقال بلال يا رسول الله ما أذنت قط إلا صليت ركعتين وما أصابني حدث قط إلا توضأت عندها ورأيت أن لله على ركعتين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بهما ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن جابر ومعاذ وأنس وأبي هريرة أن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في الجنة قصرا من ذهب فقلت لمن هذا فقيل لعمر بن الخطاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ ومعنى هذا الحديث أني دخلت البارحة الجنة يعني رأيت في المنام كأني دخلت الجنة هكذا روي في بعض الحديث ‏.‏ ويروى عن ابن عباس أنه قال رؤيا الأنبياء وحى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3690,
			"arabicnumber": 3690,
			"text": "حدثنا الحسين بن حريث، قال حدثنا علي بن الحسين بن واقد، حدثني أبي، قال حدثني عبد الله بن بريدة، قال سمعت أبي بريدة، يقول خرج رسول الله صلى الله عليه وسلم في بعض مغازيه فلما انصرف جاءت جارية سوداء فقالت يا رسول الله إني كنت نذرت إن ردك الله سالما أن أضرب بين يديك بالدف وأتغنى ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إن كنت نذرت فاضربي وإلا فلا ‏\"‏ ‏.‏ فجعلت تضرب فدخل أبو بكر وهي تضرب ثم دخل علي وهي تضرب ثم دخل عثمان وهي تضرب ثم دخل عمر فألقت الدف تحت استها ثم قعدت عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشيطان ليخاف منك يا عمر إني كنت جالسا وهي تضرب فدخل أبو بكر وهي تضرب ثم دخل علي وهي تضرب ثم دخل عثمان وهي تضرب فلما دخلت أنت يا عمر ألقت الدف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث بريدة وفي الباب عن عمر وسعد بن أبي وقاص وعائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3691,
			"arabicnumber": 3691,
			"text": "حدثنا الحسن بن صباح البزار، قال حدثنا زيد بن حباب، عن خارجة بن عبد الله ابن سليمان بن زيد بن ثابت، قال أخبرنا يزيد بن رومان، عن عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم جالسا فسمعنا لغطا وصوت صبيان فقام رسول الله صلى الله عليه وسلم فإذا حبشية تزفن والصبيان حولها فقال ‏\"‏ يا عائشة تعالى فانظري ‏\"‏ ‏.‏ فجئت فوضعت لحيى على منكب رسول الله صلى الله عليه وسلم فجعلت أنظر إليها ما بين المنكب إلى رأسه فقال لي ‏\"‏ أما شبعت أما شبعت ‏\"‏ ‏.‏ قالت فجعلت أقول لا لأنظر منزلتي عنده إذ طلع عمر قال فارفض الناس عنها قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأنظر إلى شياطين الإنس والجن قد فروا من عمر ‏\"‏ ‏.‏ قالت فرجعت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3692,
			"arabicnumber": 3692,
			"text": "حدثنا سلمة بن شبيب، قال حدثنا عبد الله بن نافع الصائغ، قال حدثنا عاصم بن عمر العمري، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أنا أول من تنشق عنه الأرض ثم أبو بكر ثم عمر ثم آتي أهل البقيع فيحشرون معي ثم أنتظر أهل مكة حتى أحشر بين الحرمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وعاصم بن عمر العمري ليس بالحافظ عند أهل الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3693,
			"arabicnumber": 3693,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن ابن عجلان، عن سعد بن إبراهيم، عن أبي سلمة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ قد كان يكون في الأمم محدثون فإن يك في أمتي أحد فعمر بن الخطاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.و أخبرني بعض أصحاب سفيان بن عيينة قال قال سفيان بن عيينة محدثون يعني مفهمون ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3694,
			"arabicnumber": 3694,
			"text": "حدثنا محمد بن حميد، قال حدثنا عبد الله بن عبد القدوس، قال حدثنا الأعمش، عن عمرو بن مرة، عن عبد الله بن سلمة، عن عبيدة السلماني، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ يطلع عليكم رجل من أهل الجنة ‏\"‏ ‏.‏ فاطلع أبو بكر ثم قال ‏\"‏ يطلع عليكم رجل من أهل الجنة ‏\"‏ ‏.‏ فاطلع عمر ‏.‏ وفي الباب عن أبي موسى وجابر ‏. هذا حديث غريب من حديث ابن مسعود ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3695,
			"arabicnumber": 3695,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود الطيالسي، عن شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل يرعى غنما له إذ جاء ذئب فأخذ شاة فجاء صاحبها فانتزعها منه فقال الذئب كيف تصنع بها يوم السبع يوم لا راعي لها غيري ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فآمنت بذلك أنا وأبو بكر وعمر ‏\"‏ ‏.‏ قال أبو سلمة وما هما في القوم يومئذ ‏.‏ حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سعد بن إبراهيم، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3696,
			"arabicnumber": 3696,
			"text": "حدثنا قتيبة بن سعيد، قال حدثنا عبد العزيز بن محمد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم كان على حراء هو وأبو بكر وعمر وعلي وعثمان وطلحة والزبير رضى الله عنهم فتحركت الصخرة فقال النبي صلى الله عليه وسلم ‏ \"‏ اهدأ إنما عليك نبي أو صديق أو شهيد ‏\"‏ ‏.‏وفي الباب عن عثمان وسعيد بن زيد وابن عباس وسهل بن سعد وأنس بن مالك وبريدة هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3697,
			"arabicnumber": 3697,
			"text": "حدثنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن سعيد بن أبي عروبة، عن قتادة، عن أنس حدثهم أن رسول الله صلى الله عليه وسلم صعد أحدا وأبو بكر وعمر وعثمان فرجف بهم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ اثبت أحد فإنما عليك نبي وصديق وشهيدان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3698,
			"arabicnumber": 3698,
			"text": "حدثنا أبو هشام الرفاعي، قال حدثنا يحيى بن اليمان، عن شيخ، من بني زهرة عن الحارث بن عبد الرحمن بن أبي ذباب، عن طلحة بن عبيد الله، قال قال النبي صلى الله عليه وسلم ‏ \"‏ لكل نبي رفيق ورفيقي - يعني في الجنة عثمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب و ليس إسناده بالقوي وهو منقطع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3699,
			"arabicnumber": 3699,
			"text": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا عبد الله بن جعفر الرقي، قال حدثنا عبيد الله بن عمرو، عن زيد، هو ابن أبي أنيسة عن أبي إسحاق، عن أبي عبد الرحمن السلمي، قال لما حصر عثمان أشرف عليهم فوق داره ثم قال أذكركم بالله هل تعلمون أن حراء حين انتفض قال رسول الله صلى الله عليه وسلم ‏\"‏ اثبت حراء فليس عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال أذكركم بالله هل تعلمون أن رسول الله صلى الله عليه وسلم قال في جيش العسرة ‏\"‏ من ينفق نفقة متقبلة ‏\"‏ ‏.‏ والناس مجهدون معسرون فجهزت ذلك الجيش قالوا نعم ‏.‏ ثم قال أذكركم بالله هل تعلمون أن بئر رومة لم يكن يشرب منها أحد إلا بثمن فابتعتها فجعلتها للغني والفقير وابن السبيل قالوا اللهم نعم وأشياء عددها ‏.‏ هذا حديث حسن صحيح غريب من هذا الوجه من حديث أبي عبد الرحمن السلمي عن عثمان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3700,
			"arabicnumber": 3700,
			"text": "حدثنا محمد بن بشار، قال حدثنا أبو داود، قال حدثنا السكن بن المغيرة، ويكنى أبا محمد، مولى لآل عثمان قال حدثنا الوليد بن أبي هشام، عن فرقد أبي طلحة، عن عبد الرحمن بن خباب، قال شهدت النبي صلى الله عليه وسلم وهو يحث على جيش العسرة فقام عثمان بن عفان فقال يا رسول الله على مائة بعير بأحلاسها وأقتابها في سبيل الله ‏.‏ ثم حض على الجيش فقام عثمان بن عفان فقال يا رسول الله على مائتا بعير بأحلاسها وأقتابها في سبيل الله ‏.‏ ثم حض على الجيش فقام عثمان بن عفان فقال يا رسول الله لله على ثلاثمائة بعير بأحلاسها وأقتابها في سبيل الله ‏.‏ فأنا رأيت رسول الله صلى الله عليه وسلم ينزل عن المنبر وهو يقول ‏ \"‏ ما على عثمان ما عمل بعد هذه ما على عثمان ما عمل بعد هذه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه لا نعرفه إلا من حديث السكن بن المغيرة ‏.‏ وفي الباب عن عبد الرحمن بن سمرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3701,
			"arabicnumber": 3701,
			"text": "حدثنا محمد بن إسماعيل، قال حدثنا الحسن بن واقع الرملي، قال حدثنا ضمرة بن ربيعة، عن عبد الله بن شوذب، عن عبد الله بن القاسم، عن كثير، مولى عبد الرحمن بن سمرة عن عبد الرحمن ابن سمرة، قال جاء عثمان إلى النبي صلى الله عليه وسلم بألف دينار - قال الحسن بن واقع وكان في موضع آخر من كتابي في كمه حين جهز جيش العسرة فنثرها في حجره ‏.‏ قال عبد الرحمن فرأيت النبي صلى الله عليه وسلم يقلبها في حجره ويقول ‏ \"‏ ما ضر عثمان ما عمل بعد اليوم ‏\"‏ ‏.‏ مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3702,
			"arabicnumber": 3702,
			"text": "حدثنا أبو زرعة، قال حدثنا الحسن بن بشر، قال حدثنا الحكم بن عبد الملك، عن قتادة، عن أنس بن مالك، قال لما أمر رسول الله صلى الله عليه وسلم ببيعة الرضوان كان عثمان بن عفان رسول رسول الله صلى الله عليه وسلم إلى أهل مكة قال فبايع الناس قال فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن عثمان في حاجة الله وحاجة رسوله ‏\"‏ ‏.‏ فضرب بإحدى يديه على الأخرى فكانت يد رسول الله صلى الله عليه وسلم لعثمان خيرا من أيديهم لأنفسهم ‏.‏ هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3703,
			"arabicnumber": 3703,
			"text": "حدثنا عبد الله بن عبد الرحمن، وعباس بن محمد الدوري، وغير، واحد المعنى، واحد، قالوا حدثنا سعيد بن عامر قال عبد الله أخبرنا سعيد بن عامر عن يحيى بن أبي الحجاج المنقري عن أبي مسعود الجريري عن ثمامة بن حزن القشيري قال شهدت الدار حين أشرف عليهم عثمان فقال ائتوني بصاحبيكم اللذين ألباكم على ‏.‏ قال فجيء بهما فكأنهما جملان أو كأنهما حماران ‏.‏ قال فأشرف عليهم عثمان فقال أنشدكم بالله والإسلام هل تعلمون أن رسول الله صلى الله عليه وسلم قدم المدينة وليس بها ماء يستعذب غير بئر رومة فقال رسول الله ‏\"‏ من يشتري بئر رومة فيجعل دلوه مع دلاء المسلمين بخير له منها في الجنة ‏\"‏ ‏.‏ فاشتريتها من صلب مالي فأنتم اليوم تمنعوني أن أشرب منها حتى أشرب من ماء البحر ‏.‏ قالوا اللهم نعم ‏.‏ قال أنشدكم بالله والإسلام هل تعلمون أن المسجد ضاق بأهله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يشتري بقعة آل فلان فيزيدها في المسجد بخير له منها في الجنة ‏\"‏ ‏.‏ فاشتريتها من صلب مالي فأنتم اليوم تمنعوني أن أصلي فيها ركعتين ‏.‏ قالوا اللهم نعم ‏.‏ قال أنشدكم بالله والإسلام هل تعلمون أني جهزت جيش العسرة من مالي قالوا اللهم نعم ‏.‏ ثم قال أنشدكم بالله والإسلام هل تعلمون أن رسول الله صلى الله عليه وسلم كان على ثبير مكة ومعه أبو بكر وعمر وأنا فتحرك الجبل حتى تساقطت حجارته بالحضيض قال فركضه برجله وقال ‏\"‏ اسكن ثبير فإنما عليك نبي وصديق وشهيدان ‏\"‏ ‏.‏ قالوا اللهم نعم ‏.‏ قال الله أكبر شهدوا لي ورب الكعبة أني شهيد ثلاثا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي من غير وجه عن عثمان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3704,
			"arabicnumber": 3704,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الوهاب الثقفي، قال حدثنا أيوب، عن أبي قلابة، عن أبي الأشعث الصنعاني، أن خطباء، قامت بالشام وفيهم رجال من أصحاب رسول الله صلى الله عليه وسلم فقام آخرهم رجل يقال له مرة بن كعب فقال لولا حديث سمعته من رسول الله صلى الله عليه وسلم ما قمت ‏.‏ وذكر الفتن فقربها فمر رجل مقنع في ثوب فقال هذا يومئذ على الهدى فقمت إليه فإذا هو عثمان بن عفان ‏.‏ قال فأقبلت عليه بوجهه فقلت هذا قال نعم ‏.هذا حديث حسن صحيح ‏.‏ وفي الباب عن ابن عمر وعبد الله بن حوالة وكعب بن عجرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3705,
			"arabicnumber": 3705,
			"text": "حدثنا محمود بن غيلان، قال حدثنا حجين بن المثنى، قال حدثنا الليث بن سعد، عن معاوية بن صالح، عن ربيعة بن يزيد، عن عبد الله بن عامر، عن النعمان بن بشير، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ يا عثمان إنه لعل الله يقمصك قميصا فإن أرادوك على خلعه فلا تخلعه لهم ‏\"‏ ‏.‏ وفي الحديث قصة طويلة ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3706,
			"arabicnumber": 3706,
			"text": "حدثنا صالح بن عبد الله، قال حدثنا أبو عوانة، عن عثمان بن عبد الله بن موهب، أن رجلا، من أهل مصر حج البيت فرأى قوما جلوسا فقال من هؤلاء قالوا قريش ‏.‏ قال فمن هذا الشيخ قالوا ابن عمر ‏.‏ فأتاه فقال إني سائلك عن شيء فحدثني أنشدك الله بحرمة هذا البيت أتعلم أن عثمان فر يوم أحد قال نعم ‏.‏ قال أتعلم أنه تغيب عن بيعة الرضوان فلم يشهدها قال نعم ‏.‏ قال أتعلم أنه تغيب يوم بدر فلم يشهد قال نعم ‏.‏ قال الله أكبر ‏.‏ فقال له ابن عمر تعال أبين لك ما سألت عنه أما فراره يوم أحد فأشهد أن الله قد عفا عنه وغفر له وأما تغيبه يوم بدر فإنه كانت عنده - أو تحته - ابنة رسول الله صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ لك أجر رجل شهد بدرا وسهمه ‏\"‏ ‏.‏ وأمره أن يخلف عليها وكانت عليلة وأما تغيبه عن بيعة الرضوان فلو كان أحد أعز ببطن مكة من عثمان لبعثه رسول الله صلى الله عليه وسلم مكان عثمان بعث رسول الله صلى الله عليه وسلم عثمان إلى مكة وكانت بيعة الرضوان بعد ما ذهب عثمان إلى مكة قال فقال رسول الله صلى الله عليه وسلم بيده اليمنى ‏\"‏ هذه يد عثمان ‏\"‏ ‏.‏ وضرب بها على يده فقال ‏\"‏ هذه لعثمان ‏\"رضى الله عنه‏ ‏.‏ قال له اذهب بهذا الآن معك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3707,
			"arabicnumber": 3707,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، قال حدثنا العلاء بن عبد الجبار، قال حدثنا الحارث بن عمير، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال كنا نقول ورسول الله صلى الله عليه وسلم حى أبو بكر وعمر وعثمان ‏.‏ هذا حديث حسن صحيح غريب من هذا الوجه يستغرب من حديث عبيد الله بن عمر ‏.‏ وقد روي هذا الحديث من غير وجه عن ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3708,
			"arabicnumber": 3708,
			"text": "حدثنا إبراهيم بن سعيد الجوهري، قال حدثنا شاذان الأسود بن عامر، عن سنان بن هارون البرجمي، عن كليب بن وائل، عن ابن عمر، قال ذكر رسول الله صلى الله عليه وسلم فتنة فقال ‏ \"‏ يقتل فيها هذا مظلوما ‏\"‏ ‏.‏ لعثمان ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3709,
			"arabicnumber": 3709,
			"text": "حدثنا الفضل بن أبي طالب البغدادي، وغير، واحد، قالوا حدثنا عثمان بن زفر، قال حدثنا محمد بن زياد، عن محمد بن عجلان، عن أبي الزبير، عن جابر، قال أتي رسول الله صلى الله عليه وسلم بجنازة رجل يصلي عليه فلم يصل عليه فقيل يا رسول الله ما رأيناك تركت الصلاة على أحد قبل هذا قال ‏ \"‏ إنه كان يبغض عثمان فأبغضه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ ومحمد بن زياد صاحب ميمون بن مهران ضعيف في الحديث جدا ومحمد بن زياد صاحب أبي هريرة هو بصري ثقة ويكنى أبا الحارث ومحمد بن زياد الألهاني صاحب أبي أمامة ثقة يكنى أبا سفيان شامي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3710,
			"arabicnumber": 3710,
			"text": "حدثنا أحمد بن عبدة الضبي، قال حدثنا حماد بن زيد، عن أيوب، عن أبي عثمان النهدي، عن أبي موسى الأشعري، قال انطلقت مع النبي صلى الله عليه وسلم فدخل حائطا للأنصار فقضى حاجته فقال لي ‏\"‏ يا أبا موسى أملك على الباب فلا يدخلن على أحد إلا بإذن ‏\"‏ ‏.‏ فجاء رجل يضرب الباب فقلت من هذا فقال أبو بكر ‏.‏ فقلت يا رسول الله هذا أبو بكر يستأذن ‏.‏ قال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏ ‏.‏ فدخل وبشرته بالجنة وجاء رجل آخر فضرب الباب فقلت من هذا فقال عمر ‏.‏ فقلت يا رسول الله هذا عمر يستأذن ‏.‏ قال ‏\"‏ افتح له وبشره بالجنة ‏\"‏ ‏.‏ ففتحت الباب ودخل وبشرته بالجنة فجاء رجل آخر فضرب الباب فقلت من هذا قال عثمان ‏.‏ فقلت يا رسول الله هذا عثمان يستأذن ‏.‏ قال ‏\"‏ افتح له وبشره بالجنة على بلوى تصيبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن أبي عثمان النهدي ‏.‏ وفي الباب عن جابر وابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3711,
			"arabicnumber": 3711,
			"text": "حدثنا سفيان بن وكيع، قال حدثنا أبي ويحيى بن سعيد، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، قال حدثني أبو سهلة، قال قال لي عثمان يوم الدار إن رسول الله صلى الله عليه وسلم قد عهد إلى عهدا فأنا صابر عليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث إسماعيل بن أبي خالد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3712,
			"arabicnumber": 3712,
			"text": "حدثنا قتيبة، قال حدثنا جعفر بن سليمان الضبعي، عن يزيد الرشك، عن مطرف بن عبد الله، عن عمران بن حصين، قال بعث رسول الله صلى الله عليه وسلم جيشا واستعمل عليهم علي بن أبي طالب فمضى في السرية فأصاب جارية فأنكروا عليه وتعاقد أربعة من أصحاب رسول الله صلى الله عليه وسلم فقالوا إذا لقينا رسول الله صلى الله عليه وسلم أخبرناه بما صنع علي وكان المسلمون إذا رجعوا من السفر بدءوا برسول الله صلى الله عليه وسلم فسلموا عليه ثم انصرفوا إلى رحالهم فلما قدمت السرية سلموا على النبي صلى الله عليه وسلم فقام أحد الأربعة فقال يا رسول الله ألم تر إلى علي بن أبي طالب صنع كذا وكذا ‏.‏ فأعرض عنه رسول الله صلى الله عليه وسلم ثم قام الثاني فقال مثل مقالته فأعرض عنه ثم قام إليه الثالث فقال مثل مقالته فأعرض عنه ثم قام الرابع فقال مثل ما قالوا فأقبل إليه رسول الله صلى الله عليه وسلم والغضب يعرف في وجهه فقال ‏ \"‏ ما تريدون من علي ما تريدون من علي ما تريدون من علي إن عليا مني وأنا منه وهو ولي كل مؤمن من بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث جعفر بن سليمان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3713,
			"arabicnumber": 3713,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سلمة بن كهيل، قال سمعت أبا الطفيل، يحدث عن أبي سريحة، أو زيد بن أرقم شك شعبة - عن النبي صلى الله عليه وسلم قال ‏ \"‏ من كنت مولاه فعلي مولاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روى شعبة هذا الحديث عن ميمون أبي عبد الله عن زيد بن أرقم عن النبي صلى الله عليه وسلم ‏.‏ وأبو سريحة هو حذيفة بن أسيد صاحب النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3714,
			"arabicnumber": 3714,
			"text": "حدثنا أبو الخطاب، زياد بن يحيى البصري قال حدثنا أبو عتاب، سهل بن حماد قال حدثنا المختار بن نافع، قال حدثنا أبو حيان التيمي، عن أبيه، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ رحم الله أبا بكر زوجني ابنته وحملني إلى دار الهجرة وأعتق بلالا من ماله رحم الله عمر يقول الحق وإن كان مرا تركه الحق وماله صديق رحم الله عثمان تستحييه الملائكة رحم الله عليا اللهم أدر الحق معه حيث دار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ والمختار بن نافع شيخ بصري كثير الغرائب وأبو حيان التيمي اسمه يحيى بن سعيد بن حيان التيمي كوفي وهو ثقة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3715,
			"arabicnumber": 3715,
			"text": "حدثنا سفيان بن وكيع، قال حدثنا أبي، عن شريك، عن منصور، عن ربعي بن حراش، قال حدثنا علي بن أبي طالب، بالرحبة قال لما كان يوم الحديبية خرج إلينا ناس من المشركين فيهم سهيل بن عمرو وأناس من رؤساء المشركين فقالوا يا رسول الله خرج إليك ناس من أبنائنا وإخواننا وأرقائنا وليس لهم فقه في الدين وإنما خرجوا فرارا من أموالنا وضياعنا فارددهم إلينا ‏.‏ ‏\"‏ فإن لم يكن لهم فقه في الدين سنفقههم ‏\"‏ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا معشر قريش لتنتهن أو ليبعثن الله عليكم من يضرب رقابكم بالسيف على الدين قد امتحن الله قلبه على الإيمان ‏\"‏ ‏.‏ قالوا من هو يا رسول الله فقال له أبو بكر من هو يا رسول الله وقال عمر من هو يا رسول الله قال ‏\"‏ هو خاصف النعل ‏\"‏ ‏.‏ وكان أعطى عليا نعله يخصفها ثم التفت إلينا علي فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من هذا الوجه من حديث ربعي عن علي ‏.‏ وسمعت الجارود يقول سمعت وكيعا يقول لم يكذب ربعي بن حراش في الإسلام كذبة ‏.‏ وأخبرني محمد بن إسماعيل عن عبد الله بن أبي الأسود قال سمعت عبد الرحمن بن مهدي يقول منصور بن المعتمر أثبت أهل الكوفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 3716,
			"arabicnumber": 3716,
			"text": "حدثنا سفيان بن وكيع، حدثنا أبي، عن إسرائيل، وحدثنا محمد بن إسماعيل، حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء بن عازب، أن النبي صلى الله عليه وسلم قال لعلي بن أبي طالب ‏ \"‏ أنت مني وأنا منك ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3717,
			"arabicnumber": 3717,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3718,
			"arabicnumber": 3718,
			"text": "حدثنا إسماعيل بن موسى الفزاري ابن بنت السدي، قال حدثنا شريك، عن أبي ربيعة، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أمرني بحب أربعة وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قيل يا رسول الله سمهم لنا ‏.‏ قال ‏\"‏ علي منهم يقول ذلك ثلاثا وأبو ذر والمقداد وسلمان أمرني بحبهم وأخبرني أنه يحبهم ‏\"‏ ‏.‏هذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3719,
			"arabicnumber": 3719,
			"text": "حدثنا إسماعيل بن موسى، قال حدثنا شريك، عن أبي إسحاق، عن حبشي بن جنادة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ علي مني وأنا من علي ولا يؤدي عني إلا أنا أو علي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3720,
			"arabicnumber": 3720,
			"text": "حدثنا يوسف بن موسى القطان البغدادي، قال حدثنا علي بن قادم، قال حدثنا علي بن صالح بن حى، عن حكيم بن جبير، عن جميع بن عمير التيمي، عن ابن عمر، قال آخى رسول الله صلى الله عليه وسلم بين أصحابه فجاء علي تدمع عيناه فقال يا رسول الله آخيت بين أصحابك ولم تؤاخ بيني وبين أحد ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ أنت أخي في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وفي الباب عن زيد بن أبي أوفى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3721,
			"arabicnumber": 3721,
			"text": "حدثنا سفيان بن وكيع، قال حدثنا عبيد الله بن موسى، عن عيسى بن عمر، عن السدي، عن أنس بن مالك، قال كان عند النبي صلى الله عليه وسلم طير فقال ‏ \"‏ اللهم ائتني بأحب خلقك إليك يأكل معي هذا الطير ‏\"‏ ‏.‏ فجاء علي فأكل معه ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث السدي إلا من هذا الوجه وقد روي هذا الحديث من غير وجه عن أنس ‏.‏ وعيسى بن عمر هو كوفي والسدي اسمه إسماعيل بن عبد الرحمن قد أدرك أنس بن مالك ورأى الحسين بن علي وثقه شعبة وسفيان الثوري وزائدة ووثقه يحيى بن سعيد القطان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3722,
			"arabicnumber": 3722,
			"text": "حدثنا خلاد بن أسلم البغدادي، قال حدثنا النضر بن شميل، قال أخبرنا عوف، عن عبد الله بن عمرو بن هند الجملي، قال قال علي كنت إذا سألت رسول الله صلى الله عليه وسلم أعطاني وإذا سكت ابتدأني ‏.هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3724,
			"arabicnumber": 3724,
			"text": "حدثنا قتيبة، قال حدثنا حاتم بن إسماعيل، عن بكير بن مسمار، عن عامر بن سعد بن أبي وقاص، عن أبيه، قال أمر معاوية بن أبي سفيان سعدا فقال ما يمنعك أن تسب أبا تراب قال أما ما ذكرت ثلاثا قالهن رسول الله صلى الله عليه وسلم فلن أسبه لأن تكون لي واحدة منهن أحب إلى من حمر النعم سمعت رسول الله صلى الله عليه وسلم يقول لعلي وخلفه في بعض مغازيه فقال له علي يا رسول الله تخلفني مع النساء والصبيان فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى إلا أنه لا نبوة بعدي ‏\"‏ ‏.‏ وسمعته يقول يوم خيبر ‏\"‏ لأعطين الراية رجلا يحب الله ورسوله ويحبه الله ورسوله ‏\"‏ ‏.‏ قال فتطاولنا لها فقال ‏\"‏ ادع لي عليا ‏\"‏ ‏.‏ فأتاه وبه رمد فبصق في عينه فدفع الراية إليه ففتح الله عليه ‏.‏ وأنزلت هذه الآية ‏:‏ ‏(‏ فقل تعالوا ندع أبناءنا وأبناءكم ‏)‏ الآية دعا رسول الله صلى الله عليه وسلم عليا وفاطمة وحسنا وحسينا فقال ‏\"‏ اللهم هؤلاء أهلي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3725,
			"arabicnumber": 3725,
			"text": "حدثنا عبد الله بن أبي زياد، قال حدثنا الأحوص بن جواب أبو الجواب، عن يونس بن أبي إسحاق، عن أبي إسحاق، عن البراء، قال بعث النبي صلى الله عليه وسلم جيشين وأمر على أحدهما علي بن أبي طالب وعلى الآخر خالد بن الوليد وقال ‏\"‏ إذا كان القتال فعلي ‏\"‏ ‏.‏ قال فافتتح علي حصنا فأخذ منه جارية فكتب معي خالد كتابا إلى النبي صلى الله عليه وسلم يشي به ‏.‏ قال فقدمت على النبي صلى الله عليه وسلم فقرأ الكتاب فتغير لونه ثم قال ‏\"‏ ما ترى في رجل يحب الله ورسوله ويحبه الله ورسوله ‏\"‏ ‏.‏ قال قلت أعوذ بالله من غضب الله و من غضب رسوله وإنما أنا رسول فسكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3726,
			"arabicnumber": 3726,
			"text": "حدثنا علي بن المندر الكوفي، قال حدثنا محمد بن فضيل، عن الأجلح، عن أبي الزبير، عن جابر، قال دعا رسول الله صلى الله عليه وسلم عليا يوم الطائف فانتجاه فقال الناس لقد طال نجواه مع ابن عمه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما انتجيته ولكن الله انتجاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الأجلح وقد رواه غير ابن فضيل أيضا عن الأجلح ‏.‏ ومعنى قوله ‏\"‏ ولكن الله انتجاه ‏\"‏ ‏.‏ يقول إن الله أمرني أن أنتجي معه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3727,
			"arabicnumber": 3727,
			"text": "حدثنا علي بن المنذر، قال حدثنا محمد بن فضيل، عن سالم بن أبي حفصة، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم لعلي ‏ \"‏ يا علي لا يحل لأحد أن يجنب في هذا المسجد غيري وغيرك ‏\"‏ ‏.‏ قال علي بن المنذر قلت لضرار بن صرد ما معنى هذا الحديث قال لا يحل لأحد يستطرقه جنبا غيري وغيرك ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه وقد سمع مني محمد بن إسماعيل هذا الحديث واستغربه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3728,
			"arabicnumber": 3728,
			"text": "حدثنا إسماعيل بن موسى، قال حدثنا علي بن عابس، عن مسلم الملائي، عن أنس بن مالك، قال بعث النبي صلى الله عليه وسلم يوم الاثنين وصلى علي يوم الثلاثاء ‏.‏ وفي الباب عن علي ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث مسلم الأعور ‏.‏ ومسلم الأعور ليس عندهم بذلك القوي ‏.‏ وقد روي هذا عن مسلم عن حبة عن علي نحو هذا ‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3729,
			"arabicnumber": 3729,
			"text": "حدثنا خلاد بن أسلم البغدادي، حدثنا النضر بن شميل، أخبرنا عوف، عن عبد الله بن عمرو بن هند الجملي قال: قال علي: كنت إذا سألت رسول الله صلى الله عليه وسلم أعطاني وإذا سكت ابتدأني. قال أبو عيسى: هذا حديث حسن غريب من هذا الوجه",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3730,
			"arabicnumber": 3730,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو أحمد ، قال حدثنا شريك، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم قال لعلي ‏ \"‏ أنت مني بمنزلة هارون من موسى إلا أنه لا نبي بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وفي الباب عن سعد وزيد بن أرقم وأبي هريرة وأم سلمة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3731,
			"arabicnumber": 3731,
			"text": "حدثنا القاسم بن دينار الكوفي، قال حدثنا أبو نعيم، عن عبد السلام بن حرب، عن يحيى بن سعيد، عن سعيد بن المسيب، عن سعد بن أبي وقاص، أن النبي صلى الله عليه وسلم قال لعلي ‏ \"‏ أنت مني بمنزلة هارون من موسى إلا أنه لا نبي بعدي ‏\"‏ ‏.‏هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن سعد عن النبي صلى الله عليه وسلم ويستغرب هذا الحديث من حديث يحيى بن سعيد الأنصاري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3732,
			"arabicnumber": 3732,
			"text": "حدثنا محمد بن حميد الرازي، قال حدثنا إبراهيم بن المختار، عن شعبة، عن أبي بلج، عن عمرو بن ميمون، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أمر بسد الأبواب إلا باب علي ‏.‏ هذا حديث غريب لا نعرفه عن شعبة بهذا الإسناد إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3733,
			"arabicnumber": 3733,
			"text": "حدثنا نصر بن علي الجهضمي، قال حدثنا علي بن جعفر بن محمد بن علي، قال أخبرني أخي، موسى بن جعفر بن محمد عن أبيه، جعفر بن محمد عن أبيه، محمد بن علي عن أبيه، علي بن الحسين عن أبيه، عن جده، علي بن أبي طالب أن رسول الله صلى الله عليه وسلم أخذ بيد حسن وحسين فقال ‏ \"‏ من أحبني وأحب هذين وأباهما وأمهما كان معي في درجتي يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث جعفر بن محمد إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3734,
			"arabicnumber": 3734,
			"text": "حدثنا محمد بن حميد، قال حدثنا إبراهيم بن المختار، عن شعبة، عن أبي بلج، عن عمرو بن ميمون، عن ابن عباس، قال أول من صلى علي ‏.‏ قال هذا حديث غريب من هذا الوجه لا نعرفه من حديث شعبة عن أبي بلج إلا من حديث محمد بن حميد ‏.‏ وأبو بلج اسمه يحيى بن أبي سليم ‏.‏ وقد اختلف أهل العلم في هذا فقال بعضهم أول من أسلم أبو بكر الصديق ‏.‏ وقال بعضهم أول من أسلم علي ‏.‏ وقال بعض أهل العلم أول من أسلم من الرجال أبو بكر وأسلم علي وهو غلام ابن ثمان سنين وأول من أسلم من النساء خديجة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3735,
			"arabicnumber": 3735,
			"text": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، رجل من الأنصار قال سمعت زيد بن أرقم، يقول أول من أسلم علي ‏.‏ قال عمرو بن مرة فذكرت ذلك لإبراهيم النخعي فأنكره وقال أول من أسلم أبو بكر الصديق ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حمزة اسمه طلحة بن يزيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3736,
			"arabicnumber": 3736,
			"text": "حدثنا عيسى بن عثمان ابن أخي، يحيى بن عيسى الرملي قال حدثنا يحيى بن عيسى الرملي، عن الأعمش، عن عدي بن ثابت، عن زر بن حبيش، عن علي، قال لقد عهد إلى النبي الأمي صلى الله عليه وسلم ‏ \"‏ أنه لا يحبك إلا مؤمن ولا يبغضك إلا منافق ‏\"‏ ‏.‏ قال عدي بن ثابت أنا من القرن الذين دعا لهم النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3737,
			"arabicnumber": 3737,
			"text": "حدثنا محمد بن بشار، ويعقوب بن إبراهيم، وغير، واحد، قالوا حدثنا أبو عاصم، عن أبي الجراح، قال حدثني جابر بن صبح، قال حدثتني أم شراحيل، قالت حدثتني أم عطية، قالت بعث النبي صلى الله عليه وسلم جيشا فيهم علي ‏.‏ قالت فسمعت النبي صلى الله عليه وسلم وهو رافع يديه يقول ‏ \"‏ اللهم لا تمتني حتى تريني عليا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3738,
			"arabicnumber": 3738,
			"text": "حدثنا أبو سعيد الأشج، قال حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يحيى ابن عباد بن عبد الله بن الزبير، عن أبيه، عن جده عبد الله بن الزبير، عن الزبير، قال كان على رسول الله صلى الله عليه وسلم يوم أحد درعان فنهض إلى صخرة فلم يستطع فأقعد تحته طلحة فصعد النبي صلى الله عليه وسلم حتى استوى على الصخرة فقال سمعت النبي صلى الله عليه وسلم يقول ‏ \"‏ أوجب طلحة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3739,
			"arabicnumber": 3739,
			"text": "حدثنا قتيبة، قال حدثنا صالح بن موسى الطلحي، من ولد طلحة بن عبيد الله عن الصلت بن دينار، عن أبي نضرة، قال قال جابر بن عبد الله سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من سره أن ينظر إلى شهيد يمشي على وجه الأرض فلينظر إلى طلحة بن عبيد الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث الصلت ‏.‏ وقد تكلم بعض أهل العلم في الصلت بن دينار وفي صالح بن موسى من قبل حفظهما ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3740,
			"arabicnumber": 3740,
			"text": "حدثنا عبد القدوس بن محمد العطار البصري، قال حدثنا عمرو بن عاصم، عن إسحاق بن يحيى بن طلحة، عن عمه، موسى بن طلحة قال دخلت على معاوية فقال ألا أبشرك سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ طلحة ممن قضى نحبه ‏\"‏ ‏.‏هذا حديث غريب لا نعرفه من حديث معاوية إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3741,
			"arabicnumber": 3741,
			"text": "حدثنا أبو سعيد الأشج، قال حدثنا أبو عبد الرحمن بن منصور العنزي، عن عقبة بن علقمة اليشكري، قال سمعت علي بن أبي طالب، قال سمعت أذني، من في رسول الله صلى الله عليه وسلم وهو يقول ‏ \"‏ طلحة والزبير جاراى في الجنة ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3742,
			"arabicnumber": 3742,
			"text": "حدثنا أبو كريب، محمد بن العلاء قال حدثنا يونس بن بكير، قال حدثنا طلحة بن يحيى، عن موسى، وعيسى، ابنى طلحة عن أبيهما، طلحة أن أصحاب، رسول الله صلى الله عليه وسلم قالوا لأعرابي جاهل سله عمن قضى نحبه من هو وكانوا لا يجترئون على مسألته يوقرونه ويهابونه فسأله الأعرابي فأعرض عنه ثم سأله فأعرض عنه ثم سأله فأعرض عنه ثم إني اطلعت من باب المسجد وعلى ثياب خضر فلما رآني رسول الله صلى الله عليه وسلم قال ‏\"‏ أين السائل عمن قضى نحبه ‏\"‏ ‏.‏ قال الأعرابي أنا يا رسول الله ‏.‏ قال ‏\"‏ هذا ممن قضى نحبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث أبي كريب عن يونس بن بكير ‏.‏ وقد رواه غير واحد من كبار أهل الحديث عن أبي كريب بهذا الحديث ‏.‏ وسمعت محمد بن إسماعيل يحدث بهذا عن أبي كريب ووضعه في كتاب الفوائد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3743,
			"arabicnumber": 3743,
			"text": "حدثنا هناد، قال حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن عبد الله بن الزبير، عن الزبير، قال جمع لي رسول الله صلى الله عليه وسلم أبويه يوم قريظة فقال ‏ \"‏ بأبي وأمي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3744,
			"arabicnumber": 3744,
			"text": "حدثنا أحمد بن منيع، قال حدثنا معاوية بن عمرو، قال حدثنا زائدة، عن عاصم، عن زر، عن علي رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن لكل نبي حواريا وإن حواري الزبير بن العوام ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ ويقال الحواري هو الناصر ‏.‏ سمعت ابن أبي عمر يقول قال سفيان بن عيينة الحواري هو الناصر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3745,
			"arabicnumber": 3745,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود الحفري، وأبو نعيم عن سفيان، عن محمد بن المنكدر، عن جابر، رضى الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن لكل نبي حواريا وإن حواري الزبير بن العوام ‏\"‏ ‏.‏ وزاد أبو نعيم فيه يوم الأحزاب قال ‏\"‏ من يأتينا بخبر القوم ‏\"‏ ‏.‏ قال الزبير أنا ‏.‏ قالها ثلاثا قال الزبير أنا ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3746,
			"arabicnumber": 3746,
			"text": "حدثنا قتيبة، قال حدثنا حماد بن زيد، عن صخر بن جويرية، عن هشام بن عروة، قال أوصى الزبير إلى ابنه عبد الله صبيحة الجمل فقال ما مني عضو إلا وقد جرح مع رسول الله صلى الله عليه وسلم ‏.‏ حتى انتهى ذاك إلى فرجه ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث حماد بن زيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3747,
			"arabicnumber": 3747,
			"text": "حدثنا قتيبة، قال حدثنا عبد العزيز بن محمد، عن عبد الرحمن بن حميد، عن أبيه، عن عبد الرحمن بن عوف، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أبو بكر في الجنة وعمر في الجنة وعثمان في الجنة وعلي في الجنة وطلحة في الجنة والزبير في الجنة وعبد الرحمن بن عوف في الجنة وسعد في الجنة وسعيد في الجنة وأبو عبيدة بن الجراح في الجنة ‏\"‏ ‏.‏ أخبرنا أبو مصعب، قراءة عن عبد العزيز بن محمد، عن عبد الرحمن بن حميد، عن أبيه، عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عن عبد الرحمن بن عوف ‏.‏ قال وقد روي هذا الحديث عن عبد الرحمن بن حميد عن أبيه عن سعيد بن زيد عن النبي صلى الله عليه وسلم نحو هذا وهذا أصح من الحديث الأول ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3748,
			"arabicnumber": 3748,
			"text": "حدثنا صالح بن مسمار المروزي، قال حدثنا ابن أبي فديك، عن موسى بن يعقوب، عن عمر بن سعيد، عن عبد الرحمن بن حميد، عن أبيه، أن سعيد بن زيد، حدثه في، نفر أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ عشرة في الجنة أبو بكر في الجنة وعمر في الجنة وعثمان وعلي والزبير وطلحة وعبد الرحمن وأبو عبيدة وسعد بن أبي وقاص ‏\"‏ ‏.‏ قال فعد هؤلاء التسعة وسكت عن العاشر فقال القوم ننشدك الله يا أبا الأعور من العاشر قال نشدتموني بالله أبو الأعور في الجنة ‏.‏أبو الأعور هو سعيد بن زيد بن عمرو بن نفيل ‏.‏ وسمعت محمدا يقول هو أصح من الحديث الأول ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3749,
			"arabicnumber": 3749,
			"text": "حدثنا قتيبة، قال حدثنا بكر بن مضر، عن صخر بن عبد الله، عن أبي سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يقول ‏ \"‏ إن أمركن مما يهمني بعدي ولن يصبر عليكن إلا الصابرون ‏\"‏ ‏.‏ قال ثم تقول عائشة فسقى الله أباك من سلسبيل الجنة ‏.‏ تريد عبد الرحمن بن عوف وقد كان وصل أزواج النبي صلى الله عليه وسلم بمال يقال بيعت بأربعين ألفا ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3750,
			"arabicnumber": 3750,
			"text": "حدثنا أحمد بن عثمان البصري، وإسحاق بن إبراهيم بن حبيب البصري، قالا حدثنا قريش بن أنس، عن محمد بن عمرو، عن أبي سلمة، أن عبد الرحمن بن عوف، أوصى بحديقة لأمهات المؤمنين بيعت بأربع مئة ألف ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3751,
			"arabicnumber": 3751,
			"text": "حدثنا رجاء بن محمد العذري، - بصري - قال حدثنا جعفر بن عون، عن إسماعيل ابن أبي خالد، عن قيس بن أبي حازم، عن سعد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم استجب لسعد إذا دعاك ‏\"‏ ‏.‏ وقد روي هذا الحديث عن إسماعيل عن قيس أن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم استجب لسعد إذا دعاك ‏\"‏ ‏.‏ وهذا أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3752,
			"arabicnumber": 3752,
			"text": "حدثنا أبو كريب، وأبو سعيد الأشج قالا حدثنا أبو أسامة، عن مجالد، عن عامر الشعبي، عن جابر بن عبد الله، قال أقبل سعد فقال النبي صلى الله عليه وسلم ‏\"‏ هذا خالي فليرني امرؤ خاله ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث مجالد ‏.‏ وكان سعد بن أبي وقاص من بني زهرة وكانت أم النبي صلى الله عليه وسلم من بني زهرة فلذلك قال النبي صلى الله عليه وسلم ‏\"‏ هذا خالي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3753,
			"arabicnumber": 3753,
			"text": "حدثنا الحسن بن الصباح البزار، قال حدثنا سفيان بن عيينة، عن علي بن زيد، ويحيى بن سعيد، سمعا سعيد بن المسيب، يقول قال علي ما جمع رسول الله صلى الله عليه وسلم أباه وأمه لأحد إلا لسعد قال له يوم أحد ‏ \"‏ ارم فداك أبي وأمي وقال له ارم أيها الغلام الحزور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روى غير واحد هذا الحديث عن يحيى بن سعيد عن سعيد بن المسيب عن سعد ‏.‏ وفي الباب عن سعد",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3754,
			"arabicnumber": 3754,
			"text": "حدثنا قتيبة، قال حدثنا الليث بن سعد، وعبد العزيز بن محمد، عن يحيى بن سعيد، عن سعيد بن المسيب، عن سعد بن أبي وقاص، قال جمع لي رسول الله صلى الله عليه وسلم أبويه يوم أحد ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن عبد الله بن شداد بن الهاد، عن علي بن أبي طالب، عن النبي صلى الله عليه وسلم",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3755,
			"arabicnumber": 3755,
			"text": "‏حدثنا بذلك، محمود بن غيلان قال حدثنا وكيع، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الله بن شداد، عن علي بن أبي طالب، قال ما سمعت النبي صلى الله عليه وسلم يفدي أحدا بأبويه إلا لسعد فإني سمعته يقول يوم أحد ‏ \"‏ ارم سعد فداك أبي وأمي ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3756,
			"arabicnumber": 3756,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن يحيى بن سعيد، عن عبد الله بن عامر بن ربيعة، أن عائشة، قالت سهر رسول الله صلى الله عليه وسلم مقدمه المدينة ليلة قال ‏\"‏ ليت رجلا صالحا يحرسني الليلة ‏\"‏ ‏.‏ قالت فبينا نحن كذلك إذ سمعنا خشخشة السلاح فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ فقال سعد بن أبي وقاص ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما جاء بك ‏\"‏ ‏.‏ فقال سعد وقع في نفسي خوف على رسول الله صلى الله عليه وسلم فجئت أحرسه ‏.‏ فدعا له رسول الله صلى الله عليه وسلم ثم نام ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3757,
			"arabicnumber": 3757,
			"text": "حدثنا أحمد بن منيع، قال حدثنا هشيم، قال أخبرنا حصين، عن هلال بن يساف، عن عبد الله بن ظالم المازني، عن سعيد بن زيد بن عمرو بن نفيل، أنه قال أشهد على التسعة أنهم في الجنة ولو شهدت على العاشر لم آثم ‏.‏ قيل وكيف ذلك قال كنا مع رسول الله صلى الله عليه وسلم بحراء فقال ‏ \"‏ اثبت حراء فإنه ليس عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ قيل ومن هم قال رسول الله صلى الله عليه وسلم وأبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد وعبد الرحمن بن عوف ‏.‏ قيل فمن العاشر قال أنا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن سعيد بن زيد عن النبي صلى الله عليه وسلم ‏.‏ حدثنا أحمد بن منيع، قال حدثنا الحجاج بن محمد، قال حدثني شعبة، عن الحر بن الصباح، عن عبد الرحمن بن الأخنس، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3758,
			"arabicnumber": 3758,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3759,
			"arabicnumber": 3759,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3760,
			"arabicnumber": 3760,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، قال حدثنا وهب بن جرير، قال حدثني أبي قال، سمعت الأعمش، يحدث عن عمرو بن مرة، عن أبي البختري، عن علي، أن النبي صلى الله عليه وسلم قال لعمر في العباس ‏ \"‏ إن عم الرجل صنو أبيه ‏\"‏ ‏.‏ وكان عمر كلمه في صدقته ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3761,
			"arabicnumber": 3761,
			"text": "حدثنا أحمد بن إبراهيم الدورقي، قال حدثنا شبابة، قال حدثنا ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ العباس عم رسول الله وإن عم الرجل صنو أبيه أو من صنو أبيه ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه من حديث أبي الزناد إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3762,
			"arabicnumber": 3762,
			"text": "حدثنا إبراهيم بن سعيد الجوهري، قال حدثنا عبد الوهاب بن عطاء، عن ثور بن يزيد، عن مكحول، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم للعباس ‏\"‏ إذا كان غداة الاثنين فأتني أنت وولدك حتى أدعو لهم بدعوة ينفعك الله بها وولدك ‏\"‏ ‏.‏ فغدا وغدونا معه وألبسنا كساء ثم قال ‏\"‏ اللهم اغفر للعباس وولده مغفرة ظاهرة وباطنة لا تغادر ذنبا اللهم احفظه في ولده ‏\"‏ ‏.هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3763,
			"arabicnumber": 3763,
			"text": "حدثنا علي بن حجر، قال أخبرنا عبد الله بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ رأيت جعفرا يطير في الجنة مع الملائكة ‏\"‏ ‏.‏ هذا حديث غريب من حديث أبي هريرة لا نعرفه إلا من حديث عبد الله بن جعفر ‏.‏ وقد ضعفه يحيى بن معين وغيره وعبد الله بن جعفر هو والد علي بن المديني ‏.‏ وفي الباب عن ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3764,
			"arabicnumber": 3764,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الوهاب الثقفي، قال حدثنا خالد الحذاء، عن عكرمة، عن أبي هريرة، قال ما احتذى النعال ولا انتعل ولا ركب المطايا ولا ركب الكور بعد رسول الله صلى الله عليه وسلم أفضل من جعفر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏‏ والكور الرحل",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3765,
			"arabicnumber": 3765,
			"text": "حدثنا محمد بن إسماعيل، قال حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء بن عازب، أن النبي صلى الله عليه وسلم قال لجعفر بن أبي طالب ‏ \"‏ أشبهت خلقي وخلقي ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا سفيان بن وكيع، حدثنا أبي، عن إسرائيل نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3766,
			"arabicnumber": 3766,
			"text": "حدثنا أبو سعيد الأشج، قال حدثنا إسماعيل بن إبراهيم أبو يحيى التيمي، قال حدثنا إبراهيم أبو إسحاق المخزومي، عن سعيد المقبري، عن أبي هريرة، قال إن كنت لأسأل الرجل من أصحاب النبي صلى الله عليه وسلم عن الآيات من القرآن أنا أعلم بها منه ما أسأله إلا ليطعمني شيئا فكنت إذا سألت جعفر بن أبي طالب لم يجبني حتى يذهب بي إلى منزله فيقول لامرأته يا أسماء أطعمينا شيئا ‏.‏ فإذا أطعمتنا أجابني وكان جعفر يحب المساكين ويجلس إليهم ويحدثهم ويحدثونه فكان رسول الله صلى الله عليه وسلم يكنيه بأبي المساكين ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وأبو إسحاق المخزومي هو إبراهيم بن الفضل المدني وقد تكلم فيه بعض أهل الحديث من قبل حفظه وله غرائب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3767,
			"arabicnumber": 3767,
			"text": "حدثنا أبو أحمد حاتم بن سياه المروزي حدثنا عبد الرزاق، أخبرنا معمر، عن ابن عجلان، عن يزيد بن قسيط، عن أبي سلمة، عن أبي هريرة، قال كنا ندعو جعفر بن أبي طالب رضى الله عنه أبا المساكين فكنا إذا أتيناه قربنا إليه ما حضر فأتيناه يوما فلم يجد عنده شيئا فأخرج جرة من عسل فكسرها فجعلنا نلعق منها ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي سلمة عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3768,
			"arabicnumber": 3768,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود الحفري، عن سفيان، عن يزيد بن أبي زياد، عن ابن أبي نعم، عن أبي سعيد الخدري، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏ حدثنا سفيان بن وكيع، قال حدثنا جرير، ومحمد بن فضيل، عن يزيد نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وابن أبي نعم هو عبد الرحمن بن أبي نعم البجلي الكوفي ويكنى أبا الحكم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3769,
			"arabicnumber": 3769,
			"text": "حدثنا سفيان بن وكيع، وعبد بن حميد، قالا حدثنا خالد بن مخلد، قال حدثنا موسى بن يعقوب الزمعي، عن عبد الله بن أبي بكر بن زيد بن المهاجر، قال أخبرني مسلم بن أبي سهل النبال، قال أخبرني الحسن بن أسامة بن زيد، قال أخبرني أبي أسامة بن زيد، قال طرقت النبي صلى الله عليه وسلم ذات ليلة في بعض الحاجة فخرج النبي صلى الله عليه وسلم وهو مشتمل على شيء لا أدري ما هو فلما فرغت من حاجتي قلت ما هذا الذي أنت مشتمل عليه قال فكشفه فإذا حسن وحسين عليهما السلام على وركيه فقال ‏ \"‏ هذان ابناى وابنا ابنتي اللهم إني أحبهما فأحبهما وأحب من يحبهما ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3770,
			"arabicnumber": 3770,
			"text": "حدثنا عقبة بن مكرم البصري العمي، قال حدثنا وهب بن جرير بن حازم، قال حدثنا أبي، عن محمد بن أبي يعقوب، عن عبد الرحمن بن أبي نعم، أن رجلا، من أهل العراق سأل ابن عمر عن دم البعوض يصيب الثوب فقال ابن عمر انظروا إلى هذا يسأل عن دم البعوض وقد قتلوا ابن رسول الله صلى الله عليه وسلم وسمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن الحسن والحسين هما ريحانتاى من الدنيا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وقد رواه شعبة ومهدي بن ميمون عن محمد بن أبي يعقوب ‏.‏ وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم نحو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 3771,
			"arabicnumber": 3771,
			"text": "حدثنا أبو سعيد الأشج، قال حدثنا أبو خالد الأحمر، قال حدثنا رزين، قال حدثتني سلمى، قالت دخلت على أم سلمة وهي تبكي فقلت ما يبكيك قالت رأيت رسول الله صلى الله عليه وسلم - تعني في المنام - وعلى رأسه ولحيته التراب فقلت ما لك يا رسول الله ‏.‏ قال ‏ \"‏ شهدت قتل الحسين آنفا ‏\"‏ ‏. هذا حديث غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 3772,
			"arabicnumber": 3772,
			"text": "حدثنا أبو سعيد الأشج، قال حدثنا عقبة بن خالد، قال حدثني يوسف بن إبراهيم، أنه سمع أنس بن مالك، يقول سئل رسول الله صلى الله عليه وسلم أى أهل بيتك أحب إليك قال ‏\"‏ الحسن والحسين ‏\"‏ ‏.‏ وكان يقول لفاطمة ‏\"‏ ادعي لي ابنى ‏\"‏ ‏.‏ فيشمهما ويضمهما إليه ‏.‏ هذا حديث غريب من هذا الوجه من حديث أنس",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 3773,
			"arabicnumber": 3773,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن عبد الله الأنصاري، قال حدثنا الأشعث، هو ابن عبد الملك عن الحسن، عن أبي بكرة، قال صعد رسول الله صلى الله عليه وسلم المنبر فقال ‏ \"‏ إن ابني هذا سيد يصلح الله على يديه فئتين عظيمتين ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ يعني الحسن بن علي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 3774,
			"arabicnumber": 3774,
			"text": "حدثنا الحسين بن حريث، قال حدثنا علي بن حسين بن واقد، قال حدثني أبي، قال حدثني عبد الله بن بريدة، قال سمعت أبي، ‏:‏ بريدة يقول كان رسول الله صلى الله عليه وسلم يخطبنا إذ جاء الحسن والحسين عليهما السلام عليهما قميصان أحمران يمشيان ويعثران فنزل رسول الله صلى الله عليه وسلم من المنبر فحملهما ووضعهما بين يديه ثم قال ‏\"‏ صدق الله ‏:‏ ‏(‏ إنما أموالكم وأولادكم فتنة ‏)‏ نظرت إلى هذين الصبيين يمشيان ويعثران فلم أصبر حتى قطعت حديثي ورفعتهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث الحسين بن واقد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 3775,
			"arabicnumber": 3775,
			"text": "حدثنا الحسن بن عرفة، قال حدثنا إسماعيل بن عياش، عن عبد الله بن عثمان بن خثيم، عن سعيد بن راشد، عن يعلى بن مرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ حسين مني وأنا من حسين أحب الله من أحب حسينا حسين سبط من الأسباط ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وإنما نعرفه من حديث عبد الله بن عثمان ابن خثيم وقد رواه غير واحد عن عبد الله بن عثمان بن خثيم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 3776,
			"arabicnumber": 3776,
			"text": "حدثنا محمد بن يحيى، قال حدثنا عبد الرزاق، عن معمر، عن الزهري، عن أنس بن مالك، قال لم يكن أحد منهم أشبه برسول الله من الحسن بن علي ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 3777,
			"arabicnumber": 3777,
			"text": "حدثنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا إسماعيل بن أبي خالد، عن أبي جحيفة، قال رأيت رسول الله صلى الله عليه وسلم وكان الحسن بن علي يشبهه ‏.‏ هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي بكر الصديق وابن عباس وابن الزبير ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 3778,
			"arabicnumber": 3778,
			"text": "حدثنا خلاد بن أسلم أبو بكر البغدادي، قال حدثنا النضر بن شميل، قال أخبرنا هشام بن حسان، عن حفصة بنت سيرين، قالت حدثني أنس بن مالك، قال كنت عند ابن زياد فجيء برأس الحسين فجعل يقول بقضيب له في أنفه ويقول ما رأيت مثل هذا حسنا لم يذكر ‏.‏ قال قلت أما إنه كان من أشبههم برسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 3779,
			"arabicnumber": 3779,
			"text": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن هانئ بن هانئ، عن علي، قال الحسن أشبه برسول الله صلى الله عليه وسلم ما بين الصدر إلى الرأس والحسين أشبه بالنبي صلى الله عليه وسلم ما كان أسفل من ذلك ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 3780,
			"arabicnumber": 3780,
			"text": "حدثنا واصل بن عبد الأعلى، قال حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، قال لما جيء برأس عبيد الله بن زياد وأصحابه نضدت في المسجد في الرحبة فانتهيت إليهم وهم يقولون قد جاءت قد جاءت ‏.‏ فإذا حية قد جاءت تخلل الرءوس حتى دخلت في منخرى عبيد الله بن زياد فمكثت هنيهة ثم خرجت فذهبت حتى تغيبت ثم قالوا قد جاءت قد جاءت ‏.‏ ففعلت ذلك مرتين أو ثلاثا ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 3781,
			"arabicnumber": 3781,
			"text": "حدثنا عبد الله بن عبد الرحمن، وإسحاق بن منصور، قالا أخبرنا محمد بن يوسف، عن إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن زر بن حبيش، عن حذيفة، قال سألتني أمي متى عهدك - تعني - بالنبي صلى الله عليه وسلم ‏.‏ فقلت ما لي به عهد منذ كذا وكذا ‏.‏ فنالت مني فقلت لها دعيني آتي النبي صلى الله عليه وسلم فأصلي معه المغرب وأسأله أن يستغفر لي ولك ‏.‏ فأتيت النبي صلى الله عليه وسلم فصليت معه المغرب فصلى حتى صلى العشاء ثم انفتل فتبعته فسمع صوتي فقال ‏\"‏ من هذا حذيفة ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ما حاجتك غفر الله لك ولأمك ‏\"‏ ‏.‏ قال ‏\"‏ إن هذا ملك لم ينزل الأرض قط قبل هذه الليلة استأذن ربه أن يسلم على ويبشرني بأن فاطمة سيدة نساء أهل الجنة وأن الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث إسرائيل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 3782,
			"arabicnumber": 3782,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو أسامة، عن فضيل بن مرزوق، عن عدي بن ثابت، عن البراء، أن النبي صلى الله عليه وسلم أبصر حسنا وحسينا فقال ‏ \"‏ اللهم إني أحبهما فأحبهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 3783,
			"arabicnumber": 3783,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عدي بن ثابت، قال سمعت البراء بن عازب، يقول رأيت النبي صلى الله عليه وسلم واضعا الحسن بن علي على عاتقه وهو يقول ‏ \"‏ اللهم إني أحبه فأحبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو أصح من حديث الفضيل بن مرزوق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 3784,
			"arabicnumber": 3784,
			"text": "حدثنا محمد بن بشار، قال حدثنا أبو عامر العقدي، قال حدثنا زمعة بن صالح، عن سلمة بن وهرام، عن عكرمة، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم حامل الحسن بن علي على عاتقه فقال رجل نعم المركب ركبت يا غلام ‏.‏ فقال النبي صلى الله عليه وسلم ‏ \"‏ ونعم الراكب هو ‏\"‏ ‏. هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ وزمعة بن صالح قد ضعفه بعض أهل الحديث من قبل حفظه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 3785,
			"arabicnumber": 3785,
			"text": "حدثنا ابن أبي عمر، قال حدثنا سفيان، عن كثير النواء، عن أبي إدريس، عن المسيب بن نجبة، قال قال علي بن أبي طالب قال النبي صلى الله عليه وسلم ‏ \"‏ إن كل نبي أعطي سبعة نجباء أو نقباء وأعطيت أنا أربعة عشر ‏\"‏ ‏.‏ قلنا من هم قال أنا وابناى وجعفر وحمزة وأبو بكر وعمر ومصعب بن عمير وبلال وسلمان وعمار والمقداد و حذيفة وعبد الله بن مسعود ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث عن علي موقوفا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 3786,
			"arabicnumber": 3786,
			"text": "حدثنا نصر بن عبد الرحمن الكوفي، قال حدثنا زيد بن الحسن، هو الأنماطي عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال رأيت رسول الله صلى الله عليه وسلم في حجته يوم عرفة وهو على ناقته القصواء يخطب فسمعته يقول ‏ \"‏ يا أيها الناس إني قد تركت فيكم ما إن أخذتم به لن تضلوا كتاب الله وعترتي أهل بيتي ‏\"‏ ‏.‏وفي الباب عن أبي ذر وأبي سعيد وزيد بن أرقم وحذيفة بن أسيد ‏.‏ وهذا حديث حسن غريب من هذا الوجه ‏.‏ وزيد بن الحسن قد روى عنه سعيد بن سليمان وغير واحد من أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 3787,
			"arabicnumber": 3787,
			"text": "حدثنا قتيبة بن سعيد، قال حدثنا محمد بن سليمان الأصبهاني، عن يحيى بن عبيد، عن عطاء بن أبي رباح، عن عمر بن أبي سلمة، ربيب النبي صلى الله عليه وسلم قال نزلت هذه الآية على النبي صلى الله عليه وسلم ‏:‏ ‏(‏ إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا ‏)‏ في بيت أم سلمة فدعا النبي صلى الله عليه وسلم فاطمة وحسنا وحسينا فجللهم بكساء وعلي خلف ظهره فجلله بكساء ثم قال ‏\"‏ اللهم هؤلاء أهل بيتي فأذهب عنهم الرجس وطهرهم تطهيرا ‏\"‏ ‏.‏ قالت أم سلمة وأنا معهم يا نبي الله قال ‏\"‏ أنت على مكانك وأنت إلي خير ‏\"‏ ‏. وفي الباب عن أم سلمة ومعقل بن يسار وأبي الحمراء وأنس بن مالك ‏.‏ وهذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 3788,
			"arabicnumber": 3788,
			"text": "حدثنا علي بن المنذر، - الكوفي - قال حدثنا محمد بن فضيل، قال حدثنا الأعمش، عن عطية، عن أبي سعيد، والأعمش، عن حبيب بن أبي ثابت، عن زيد بن أرقم، رضي الله عنهما قالا قال رسول الله صلى الله عليه وسلم ‏ \"‏ إني تارك فيكم ما إن تمسكتم به لن تضلوا بعدي أحدهما أعظم من الآخر كتاب الله حبل ممدود من السماء إلى الأرض وعترتي أهل بيتي ولن يتفرقا حتى يردا على الحوض فانظروا كيف تخلفوني فيهما ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 3789,
			"arabicnumber": 3789,
			"text": "حدثنا أبو داود، سليمان بن الأشعث قال أخبرنا يحيى بن معين، قال حدثنا هشام بن يوسف، عن عبد الله بن سليمان النوفلي، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أحبوا الله لما يغذوكم من نعمه وأحبوني بحب الله وأحبوا أهل بيتي لحبي ‏\"‏ ‏.‏ قال أبو عيسى هذا ��ديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 3790,
			"arabicnumber": 3790,
			"text": "حدثنا سفيان بن وكيع، قال حدثنا حميد بن عبد الرحمن، عن داود العطار، عن معمر، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أرحم أمتي بأمتي أبو بكر وأشدهم في أمر الله عمر وأصدقهم حياء عثمان وأعلمهم بالحلال والحرام معاذ بن جبل وأفرضهم زيد بن ثابت وأقرؤهم أبى بن كعب ولكل أمة أمين وأمين هذه الأمة أبو عبيدة بن الجراح ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه من حديث قتادة إلا من هذا الوجه ‏.‏ وقد رواه أبو قلابة عن أنس عن النبي صلى الله عليه وسلم نحوه والمشهور حديث أبي قلابة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 3791,
			"arabicnumber": 3791,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الوهاب بن عبد المجيد الثقفي، قال حدثنا خالد الحذاء، عن أبي قلابة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أرحم أمتي بأمتي أبو بكر وأشدهم في أمر الله عمر وأصدقهم حياء عثمان وأقرؤهم لكتاب الله أبى بن كعب وأفرضهم زيد بن ثابت وأعلمهم بالحلال والحرام معاذ بن جبل ألا وإن لكل أمة أمينا وإن أمين هذه الأمة أبو عبيدة بن الجراح ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 3792,
			"arabicnumber": 3792,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم لأبى بن كعب ‏\"‏ إن الله أمرني أن أقرأ عليك ‏:‏ ‏(‏ لم يكن الذين كفروا ‏)‏ ‏\"‏ ‏.‏ قال وسماني قال ‏\"‏ نعم ‏\"‏ ‏.‏ فبكى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن أبى بن كعب قال قال لي النبي صلى الله عليه وسلم فذكر نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 3793,
			"arabicnumber": 3793,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن عاصم، قال سمعت زر بن حبيش، يحدث عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ إن الله أمرني أن أقرأ عليك ‏\"‏ ‏.‏ فقرأ عليه‏:‏ ‏(‏ لم يكن الذين كفروا من أهل الكتاب ‏)‏ فقرأ فيها ‏\"‏ إن ذات الدين عند الله الحنيفية المسلمة لا اليهودية ولا النصرانية من يعمل خيرا فلن يكفره ‏\"‏ ‏.‏ وقرأ عليه ‏\"‏ ولو أن لابن آدم واديا من مال لابتغى إليه ثانيا ولو كان له ثانيا لابتغى إليه ثالثا ولا يملأ جوف ابن آدم إلا التراب ويتوب الله على من تاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وقد روي من غير هذا الوجه ‏.‏ رواه عبد الله بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب أن النبي صلى الله عليه وسلم قال لأبى بن كعب ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏ وقد روى قتادة عن أنس أن النبي صلى الله عليه وسلم قال لأبى ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 3794,
			"arabicnumber": 3794,
			"text": "حدثنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، عن قتادة، عن أنس بن مالك، قال جمع القرآن على عهد رسول الله صلى الله عليه وسلم أربعة كلهم من الأنصار أبى بن كعب ومعاذ بن جبل وزيد بن ثابت وأبو زيد ‏.‏ قلت لأنس من أبو زيد قال أحد عمومتي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 3795,
			"arabicnumber": 3795,
			"text": "حدثنا قتيبة، قال حدثنا عبد العزيز بن محمد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ نعم الرجل أبو بكر نعم الرجل عمر نعم الرجل أبو عبيدة بن الجراح نعم الرجل أسيد بن حضير نعم الرجل ثابت بن قيس بن شماس نعم الرجل معاذ بن جبل نعم الرجل معاذ بن عمرو بن الجموح ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن إنما نعرفه من حديث سهيل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 3796,
			"arabicnumber": 3796,
			"text": "حدثنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن أبي إسحاق، عن صلة بن زفر، عن حذيفة بن اليمان، قال جاء العاقب والسيد إلى النبي صلى الله عليه وسلم فقالا ابعث معنا أمينا ‏.‏ فقال ‏\"‏ فإني سأبعث معكم أمينا حق أمين ‏\"‏ ‏.‏ فأشرف لها الناس فبعث أبا عبيدة بن الجراح رضى الله عنه ‏.‏ قال وكان أبو إسحاق إذا حدث بهذا الحديث عن صلة قال سمعته منذ ستين سنة ‏.‏ هذا حديث حسن صحيح ‏. حدثنا محمد بن بشار أخبرنا سلم بن قتيبة وأبو داود عن شعبة عن أبي إسحاق قال قال حذيفة قلب صلة بن زفر من ذهب ‏ وقد روي عن عمر وأنس عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لكل أمة أمين وأمين هذه الأمة أبو عبيدة بن الجراح ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 3797,
			"arabicnumber": 3797,
			"text": "حدثنا سفيان بن وكيع، قال حدثنا أبي، عن الحسن بن صالح، عن أبي ربيعة الإيادي، عن الحسن، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الجنة تشتاق إلى ثلاثة علي وعمار وسلمان ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث الحسن بن صالح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 3798,
			"arabicnumber": 3798,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا سفيان، عن أبي إسحاق، عن هانىء بن هانىء، عن علي، قال جاء عمار يستأذن على النبي صلى الله عليه وسلم فقال ‏ \"‏ ائذنوا له مرحبا بالطيب المطيب ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 3799,
			"arabicnumber": 3799,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 3800,
			"arabicnumber": 3800,
			"text": "حدثنا أبو مصعب المدني، قال حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أبشر عمار تقتلك الفئة الباغية ‏\"‏ ‏. وفي الباب عن أم سلمة وعبد الله بن عمرو وأبي اليسر وحذيفة ‏. وهذا حديث حسن صحيح غريب من حديث العلاء بن عبد الرحمن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 3801,
			"arabicnumber": 3801,
			"text": "حدثنا محمود بن غيلان، قال حدثنا ابن نمير، عن الأعمش، عن عثمان بن عمير، هو أبو اليقظان عن أبي حرب بن أبي الأسود الديلي، عن عبد الله بن عمرو، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما أظلت الخضراء ولا أقلت الغبراء أصدق من أبي ذر ‏\"‏ ‏.‏ وفي الباب عن أبي الدرداء وأبي ذر ‏.‏ وهذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 3802,
			"arabicnumber": 3802,
			"text": "حدثنا العباس العنبري، قال حدثنا النضر بن محمد، قال حدثنا عكرمة بن عمار، قال حدثني أبو زميل، هو سماك بن الوليد الحنفي عن مالك بن مرثد، عن أبيه، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أظلت الخضراء ولا أقلت الغبراء من ذي لهجة أصدق ولا أوفى من أبي ذر شبه عيسى ابن مريم عليه السلام ‏\"‏ ‏.‏ فقال عمر بن الخطاب كالحاسد يا رسول الله أفنعرف ذلك له قال ‏\"‏ نعم فاعرفوه له ‏\"‏ ‏. هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روى بعضهم هذا الحديث فقال ‏\"‏ أبو ذر يمشي في الأرض بزهد عيسى ابن مريم عليه السلام ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 3803,
			"arabicnumber": 3803,
			"text": "حدثنا علي بن سعيد الكندي، قال حدثنا أبو محياة يحيى بن يعلى بن عطاء عن عبد الملك بن عمير، عن ابن أخي عبد الله بن سلام، قال لما أريد قتل عثمان جاء عبد الله بن سلام فقال له عثمان ما جاء بك قال جئت في نصرك ‏.‏ قال اخرج إلى الناس فاطردهم عني فإنك خارجا خير لي منك داخلا ‏.‏ فخرج عبد الله إلى الناس فقال أيها الناس إنه كان اسمي في الجاهلية فلان فسماني رسول الله صلى الله عليه وسلم عبد الله ونزلت في آيات من كتاب الله فنزلت في ‏:‏ ‏(‏ وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين ‏)‏ ونزلت في ‏:‏ ‏(‏ قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب ‏)‏ إن لله سيفا مغمودا عنكم وإن الملائكة قد جاورتكم في بلدكم هذا الذي نزل فيه رسول الله صلى الله عليه وسلم فالله الله في هذا الرجل أن تقتلوه فوالله لئن قتلتموه لتطردن جيرانكم الملائكة ولتسلن سيف الله المغمود عنكم فلا يغمد عنكم إلى يوم القيامة ‏.‏ قالوا اقتلوا اليهودي واقتلوا عثمان ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث عبد الملك بن عمير ‏.‏ وقد روى شعيب بن صفوان هذا الحديث عن عبد الملك بن عمير فقال عن عمر بن محمد بن عبد الله بن سلام عن جده عبد الله بن سلام ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 3804,
			"arabicnumber": 3804,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن يزيد بن عميرة، قال لما حضر معاذ بن جبل الموت قيل له يا أبا عبد الرحمن أوصنا ‏.‏ قال أجلسوني ‏.‏ فقال إن العلم والإيمان مكانهما من ابتغاهما وجدهما يقول ذلك ثلاث مرات والتمسوا العلم عند أربعة رهط عند عويمر أبي الدرداء وعند سلمان الفارسي وعند عبد الله بن مسعود وعند عبد الله بن سلام الذي كان يهوديا فأسلم فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إنه عاشر عشرة في الجنة ‏\"‏ ‏. وفي الباب عن سعد ‏.‏ وهذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 3805,
			"arabicnumber": 3805,
			"text": "حدثنا إبراهيم بن إسماعيل بن يحيى بن سلمة بن كهيل، قال حدثني أبي، عن أبيه، عن سلمة بن كهيل، عن أبي الزعراء، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اقتدوا باللذين من بعدي من أصحابي أبي بكر وعمر واهتدوا بهدى عمار وتمسكوا بعهد ابن مسعود ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه من حديث ابن مسعود لا نعرفه إلا من حديث يحيى بن سلمة بن كهيل ‏.‏ ويحيى بن سلمة يضعف في الحديث وأبو الزعراء اسمه عبد الله بن هانئ وأبو الزعراء الذي روى عنه شعبة والثوري وابن عيينة اسمه عمرو بن عمرو وهو ابن أخي أبي الأحوص صاحب عبد الله بن مسعود ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 3806,
			"arabicnumber": 3806,
			"text": "حدثنا أبو كريب، قال حدثنا إبراهيم بن يوسف بن أبي إسحاق، عن أبيه، عن أبي إسحاق، عن الأسود بن يزيد، أنه سمع أبا موسى، يقول لقد قدمت أنا وأخي، من اليمن وما نرى حينا إلا أن عبد الله بن مسعود رجل من أهل بيت النبي صلى الله عليه وسلم لما نرى من دخوله ودخول أمه على النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد رواه سفيان الثوري عن أبي إسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 3807,
			"arabicnumber": 3807,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، قال أتينا على حذيفة فقلنا حدثنا من، بأقرب الناس من رسول الله صلى الله عليه وسلم هديا ودلا فنأخذ عنه ونسمع منه قال كان أقرب الناس هديا ودلا وسمتا برسول الله صلى الله عليه وسلم ابن مسعود حتى يتوارى منا في بيته ولقد علم المحفوظون من أصحاب رسول الله صلى الله عليه وسلم أن ابن أم عبد هو من أقربهم إلى الله زلفى ‏. هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 3808,
			"arabicnumber": 3808,
			"text": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا صاعد الحراني، قال حدثنا زهير، قال حدثنا منصور، عن أبي إسحاق، عن الحارث، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو كنت مؤمرا أحدا من غير مشورة منهم لأمرت عليهم ابن أم عبد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث الحارث عن علي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 3809,
			"arabicnumber": 3809,
			"text": "حدثنا سفيان بن وكيع، قال حدثنا أبي، عن سفيان الثوري، عن أبي إسحاق، عن الحارث، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لو كنت مؤمرا أحدا من غير مشورة لأمرت ابن أم عبد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 3810,
			"arabicnumber": 3810,
			"text": "حدثنا هناد، قال حدثنا أبو معاوية، عن الأعمش، عن شقيق بن سلمة، عن مسروق، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خذوا القرآن من أربعة من ابن مسعود وأبى بن كعب ومعاذ بن جبل وسالم مولى أبي حذيفة ‏\"‏ ‏. هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 3811,
			"arabicnumber": 3811,
			"text": "حدثنا الجراح بن مخلد البصري، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن خيثمة بن أبي سبرة، قال أتيت المدينة فسألت الله أن ييسر لي جليسا صالحا فيسر لي أبا هريرة فجلست إليه فقلت له إني سألت الله أن ييسر لي جليسا صالحا فوفقت لي ‏.‏ فقال لي من أين أنت قلت من أهل الكوفة جئت ألتمس الخير وأطلبه ‏.‏ قال أليس فيكم سعد بن مالك مجاب الدعوة وابن مسعود صاحب طهور رسول الله صلى الله عليه وسلم ونعليه وحذيفة صاحب سر رسول الله صلى الله عليه وسلم وعمار الذي أجاره الله من الشيطان على لسان نبيه وسلمان صاحب الكتابين ‏.‏ قال قتادة والكتابان الإنجيل والقرآن ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ وخيثمة هو ابن عبد الرحمن بن أبي سبرة نسب إلى جده ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 3812,
			"arabicnumber": 3812,
			"text": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا إسحاق بن عيسى، عن شريك، عن أبي اليقظان، عن زاذان، عن حذيفة، قال قالوا يا رسول الله لو استخلفت ‏.‏ قال ‏ \"‏ إن استخلفت عليكم فعصيتموه عذبتم ولكن ما حدثكم حذيفة فصدقوه وما أقرأكم عبد الله فاقرءوه ‏\"‏ ‏.‏ قال عبد الله فقلت لإسحاق بن عيسى يقولون هذا عن أبي وائل ‏.‏ قال لا عن زاذان إن شاء الله ‏. هذا حديث حسن وهو حديث شريك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 3813,
			"arabicnumber": 3813,
			"text": "حدثنا سفيان بن وكيع، قال حدثنا محمد بن بكر، عن ابن جريج، عن زيد بن أسلم، عن أبيه، عن عمر، أنه فرض لأسامة بن زيد في ثلاثة آلاف وخمسمائة وفرض لعبد الله بن عمر في ثلاثة آلاف قال عبد الله بن عمر لأبيه لم فضلت أسامة على فوالله ما سبقني إلى مشهد ‏.‏ قال لأن زيدا كان أحب إلى رسول الله صلى الله عليه وسلم من أبيك وكان أسامة أحب إلى رسول الله منك فآثرت حب رسول الله صلى الله عليه وسلم على حبي ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 3814,
			"arabicnumber": 3814,
			"text": "حدثنا قتيبة، قال حدثنا يعقوب بن عبد الرحمن، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن أبيه، قال ما كنا ندعو زيد بن حارثة إلا زيد بن محمد حتى نزلت ‏:‏ ‏(‏ ادعوهم لأبائهم هو أقسط عند الله ‏)‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 3815,
			"arabicnumber": 3815,
			"text": "حدثنا الجراح بن مخلد البصري، وغير، واحد، قالوا حدثنا محمد بن عمر بن الرومي، قال حدثنا علي بن مسهر، عن إسماعيل بن أبي خالد، عن أبي عمرو الشيباني، قال أخبرني جبلة بن حارثة، أخو زيد قال قدمت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله ابعث معي أخي زيدا ‏.‏ قال ‏\"‏ هو ذا ‏\"‏ ‏.‏ قال ‏\"‏ فإن انطلق معك لم أمنعه ‏\"‏ ‏.‏ قال زيد يا رسول الله والله لا أختار عليك أحدا ‏.‏ قال فرأيت رأى أخي أفضل من رأيي ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث ابن الرومي عن علي بن مسهر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 3816,
			"arabicnumber": 3816,
			"text": "حدثنا أحمد بن الحسن، قال حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم بعث بعثا وأمر عليهم أسامة بن زيد فطعن الناس في إمارته فقال النبي صلى الله عليه وسلم ‏ \"‏ إن تطعنوا في إمارته فقد كنتم تطعنون في إمرة أبيه من قبل وايم الله إن كان لخليقا للإمارة وإن كان من أحب الناس إلى وإن هذا من أحب الناس إلى بعده ‏\"‏ ‏. هذا حديث حسن صحيح ‏.‏ حدثنا علي بن حجر، قال حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم نحو حديث مالك بن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 3817,
			"arabicnumber": 3817,
			"text": "حدثنا أبو كريب، قال حدثنا يونس بن بكير، عن محمد بن إسحاق، عن سعيد بن عبيد بن السباق، عن محمد بن أسامة بن زيد، عن أبيه، قال لما ثقل رسول الله صلى الله عليه وسلم هبطت وهبط الناس المدينة فدخلت على رسول الله صلى الله عليه وسلم وقد أصمت فلم يتكلم فجعل رسول الله صلى الله عليه وسلم يضع يديه على ويرفعهما فأعرف أنه يدعو لي ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 3818,
			"arabicnumber": 3818,
			"text": "حدثنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت أراد النبي صلى الله عليه وسلم أن ينحي مخاط أسامة قالت عائشة دعني دعني حتى أكون أنا الذي أفعل ‏.‏ قال ‏ \"‏ يا عائشة أحبيه فإني أحبه ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 3819,
			"arabicnumber": 3819,
			"text": "حدثنا أحمد بن الحسن، قال حدثنا موسى بن إسماعيل، قال حدثنا أبو عوانة، قال حدثنا عمر بن أبي سلمة بن عبد الرحمن، عن أبيه، قال أخبرني أسامة بن زيد، قال كنت جالسا عند النبي صلى الله عليه وسلم إذ جاء علي والعباس يستأذنان فقالا يا أسامة استأذن لنا على رسول الله صلى الله عليه وسلم ‏.‏ فقلت يا رسول الله علي والعباس يستأذنان ‏.‏ فقال ‏\"‏ أتدري ما جاء بهما ‏\"‏ ‏.‏ قلت لا أدري ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لكني أدري ‏\"‏ ‏.‏ فأذن لهما فدخلا فقالا يا رسول الله جئناك نسألك أى أهلك أحب إليك قال ‏\"‏ فاطمة بنت محمد ‏\"‏ ‏.‏ فقالا ما جئناك نسألك عن أهلك ‏.‏ قال ‏\"‏ أحب أهلي إلى من قد أنعم الله عليه وأنعمت عليه أسامة بن زيد ‏\"‏ ‏.‏ قالا ثم من قال ‏\"‏ ثم علي بن أبي طالب ‏\"‏ ‏.‏ قال العباس يا رسول الله جعلت عمك آخرهم قال ‏\"‏ لأن عليا قد سبقك بالهجرة ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وكان شعبة يضعف عمر بن أبي سلمة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 3820,
			"arabicnumber": 3820,
			"text": "حدثنا أحمد بن منيع، قال حدثنا معاوية بن عمرو الأزدي، قال حدثنا زائدة، عن بيان، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا ضحك . هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 3821,
			"arabicnumber": 3821,
			"text": "حدثنا أحمد بن منيع، قال حدثنا معاوية بن عمرو، قال حدثنا زائدة، عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا تبسم ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 3822,
			"arabicnumber": 3822,
			"text": "حدثنا محمد بن بشار، ومحمود بن غيلان، قالا حدثنا أبو أحمد، عن سفيان، عن ليث، عن أبي جهضم، عن ابن عباس، أنه رأى جبريل عليه السلام مرتين ودعا له النبي صلى الله عليه وسلم مرتين ‏.‏ قال أبو عيسى هذا حديث مرسل ‏.‏ ولا نعرف لأبي جهضم سماعا من ابن عباس ‏.‏ وقد روي عن عبيد الله بن عبد الله ابن عباس عن ابن عباس ‏.‏ وأبو جهضم اسمه موسى بن سالم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 3823,
			"arabicnumber": 3823,
			"text": "حدثنا محمد بن حاتم المكتب المؤدب، قال حدثنا القاسم بن مالك المزني، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، قال دعا لي رسول الله صلى الله عليه وسلم أن يؤتيني الله الحكمة مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث عطاء ‏.‏ وقد رواه عكرمة عن ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 3824,
			"arabicnumber": 3824,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الوهاب الثقفي، قال أخبرنا خالد الحذاء، عن عكرمة، عن ابن عباس، قال ضمني إليه رسول الله صلى الله عليه وسلم وقال ‏ \"‏ اللهم علمه الحكمة ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 3825,
			"arabicnumber": 3825,
			"text": "حدثنا أحمد بن منيع، قال حدثنا إسماعيل بن إبراهيم، عن أيوب، عن نافع، عن ابن عمر، قال رأيت في المنام كأنما بيدي قطعة إستبرق ولا أشير بها إلى موضع من الجنة إلا طارت بي إليه فقصصتها على حفصة فقصتها حفصة على النبي صلى الله عليه وسلم فقال ‏\"‏ إن أخاك رجل صالح ‏\"‏ ‏.‏ أو ‏\"‏ إن عبد الله رجل صالح ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 3826,
			"arabicnumber": 3826,
			"text": "حدثنا عبد الله بن إسحاق الجوهري، قال حدثنا أبو عاصم، عن عبد الله بن المؤمل، عن ابن أبي مليكة، عن عائشة، أن النبي صلى الله عليه وسلم رأى في بيت الزبير مصباحا فقال ‏ \"‏ يا عائشة ما أرى أسماء إلا قد نفست فلا تسموه حتى أسميه ‏\"‏ ‏.‏ فسماه عبد الله وحنكه بتمرة بيده ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 3827,
			"arabicnumber": 3827,
			"text": "حدثنا قتيبة، قال حدثنا جعفر بن سليمان، عن الجعد أبي عثمان، عن أنس بن مالك، قال مر رسول الله صلى الله عليه وسلم فسمعت أمي أم سليم صوته فقالت بأبي أنت وأمي يا رسول الله أنيس ‏.‏ قال فدعا لي رسول الله صلى الله عليه وسلم ثلاث دعوات قد رأيت منهن اثنين في الدنيا وأنا أرجو الثالثة في الآخرة ‏. هذا حديث حسن صحيح غريب من هذا الوجه وقد روي هذا الحديث من غير وجه عن أنس عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 3828,
			"arabicnumber": 3828,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو أسامة، عن شريك، عن عاصم الأحول، عن أنس، قال ربما قال لي النبي صلى الله عليه وسلم ‏ \"‏ يا ذا الأذنين ‏\"‏ ‏.‏ قال أبو أسامة يعني يمازحه ‏.‏ هذا حديث حسن غريب صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 3829,
			"arabicnumber": 3829,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، عن أم سليم، أنها قالت يا رسول الله أنس خادمك ادع الله له ‏.‏ قال ‏ \"‏ اللهم أكثر ماله وولده وبارك له فيما أعطيته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 3830,
			"arabicnumber": 3830,
			"text": "حدثنا زيد بن أخزم الطائي، قال حدثنا أبو داود، عن شعبة، عن جابر، عن أبي نصر، عن أنس، رضى الله عنه قال كناني رسول الله صلى الله عليه وسلم ببقلة كنت أجتنيها ‏. هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث جابر الجعفي عن أبي نصر ‏.‏ وأبو نصر هو خيثمة بن أبي خيثمة البصري روى عن أنس أحاديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 3831,
			"arabicnumber": 3831,
			"text": "حدثنا إبراهيم بن يعقوب، قال حدثنا زيد بن حباب، قال حدثنا ميمون أبو عبد الله، قال حدثنا ثابت البناني قال قال لي أنس بن مالك يا ثابت خذ عني فإنك لم تأخذ عن أحد أوثق مني إني أخذته عن رسول الله صلى الله عليه وسلم وأخذه رسول الله صلى الله عليه وسلم عن جبريل وأخذه جبريل عن الله تعالى ‏. هذا حديث حسن غريب لا نعرفه إلا من حديث زيد بن حباب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 3832,
			"arabicnumber": 3832,
			"text": "حدثنا أبو كريب، قال حدثنا زيد بن حباب، عن ميمون أبي عبد الله، عن ثابت، عن أنس، نحو حديث إبراهيم بن يعقوب ولم يذكر فيه وأخذه النبي صلى الله عليه وسلم عن جبريل ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 3833,
			"arabicnumber": 3833,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود، عن أبي خلدة، قال قلت لأبي العالية سمع أنس، من النبي صلى الله عليه وسلم قال خدمه عشر سنين ودعا له النبي صلى الله عليه وسلم وكان له بستان يحمل في السنة الفاكهة مرتين وكان فيها ريحان يجد منه ريح المسك ‏.‏ هذا حديث حسن غريب ‏.‏ وأبو خلدة اسمه خالد بن دينار وهو ثقة عند أهل الحديث وقد أدرك أنس بن مالك وروى عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 3834,
			"arabicnumber": 3834,
			"text": "حدثنا محمد بن عمر بن علي المقدمي، قال حدثنا ابن أبي عدي، عن شعبة، عن سماك، عن أبي الربيع، عن أبي هريرة، قال أتيت النبي صلى الله عليه وسلم فبسطت ثوبي عنده ثم أخذه فجمعه على قلبي فما نسيت بعده حديثا ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 3835,
			"arabicnumber": 3835,
			"text": "حدثنا أبو موسى، محمد بن المثنى قال حدثنا عثمان بن عمر، قال حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة، قال قلت يا رسول الله أسمع منك أشياء فلا أحفظها ‏.‏ قال ‏ \"‏ ابسط رداءك ‏\"‏ ‏.‏ فبسطت فحدث حديثا كثيرا فما نسيت شيئا حدثني به ‏.‏ هذا حديث حسن صحيح و قد روي من غير وجه عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 3836,
			"arabicnumber": 3836,
			"text": "حدثنا أحمد بن منيع، قال حدثنا هشيم، قال أخبرنا يعلى بن عطاء، عن الوليد بن عبد الرحمن، عن ابن عمر، أنه قال لأبي هريرة يا أبا هريرة أنت كنت ألزمنا لرسول الله صلى الله عليه وسلم وأحفظنا لحديثه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 3837,
			"arabicnumber": 3837,
			"text": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا أحمد بن أبي شعيب الحراني، قال حدثني محمد بن سلمة الحراني، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن مالك بن أبي عامر، قال جاء رجل إلى طلحة بن عبيد الله فقال يا أبا محمد أرأيت هذا اليماني يعني أبا هريرة هو أعلم بحديث رسول الله صلى الله عليه وسلم منكم نسمع منه ما لا نسمع منكم أو يقول على رسول الله صلى الله عليه وسلم ما لم يقل ‏.‏ قال أما أن يكون سمع من رسول الله صلى الله عليه وسلم ما لم نسمع فلا أشك إلا أنه سمع من رسول الله صلى الله عليه وسلم ما لم نسمع وذاك أنه كان مسكينا لا شىء له ضيفا لرسول الله صلى الله عليه وسلم يده مع يد رسول الله صلى الله عليه وسلم وكنا نحن أهل بيوتات وغنى وكنا نأتي رسول الله صلى الله عليه وسلم طرفى النهار فلا نشك إلا أنه سمع من رسول الله صلى الله عليه وسلم ما لم نسمع ولا نجد أحدا فيه خير يقول على رسول الله صلى الله عليه وسلم ما لم يقل ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن إسحاق ‏.‏ وقد رواه يونس بن بكير وغيره عن محمد بن إسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 3838,
			"arabicnumber": 3838,
			"text": "حدثنا بشر بن آدم ابن بنت أزهر السمان، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا أبو خلدة، قال حدثنا أبو العالية، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ممن أنت ‏\"‏ ‏.‏ قال قلت من دوس ‏.‏ قال ‏\"‏ ما كنت أرى أن في دوس أحدا فيه خير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وأبو خلدة اسمه خالد بن دينار وأبو العالية اسمه رفيع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 3839,
			"arabicnumber": 3839,
			"text": "حدثنا عمران بن موسى القزاز، قال حدثنا حماد بن زيد، قال حدثنا المهاجر، عن أبي العالية الرياحي، عن أبي هريرة، قال أتيت النبي صلى الله عليه وسلم بتمرات فقلت يا رسول الله ادع الله فيهن بالبركة ‏.‏ فضمهن ثم دعا لي فيهن بالبركة فقال لي ‏ \"‏ خذهن واجعلهن في مزودك هذا أو في هذا المزود كلما أردت أن تأخذ منه شيئا فأدخل فيه يدك فخذه ولا تنثره نثرا ‏\"‏ ‏.‏ فقد حملت من ذلك التمر كذا وكذا من وسق في سبيل الله فكنا نأكل منه ونطعم وكان لا يفارق حقوي حتى كان يوم قتل عثمان فإنه انقطع ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث من غير هذا الوجه عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 3840,
			"arabicnumber": 3840,
			"text": "حدثنا أحمد بن سعيد المرابطي، قال حدثنا روح بن عبادة، قال حدثنا أسامة بن زيد، عن عبد الله بن رافع، قال قلت لأبي هريرة لم كنيت أبا هريرة قال أما تفرق مني قلت بلى والله إني لأهابك ‏.‏ قال كنت أرعى غنم أهلي فكانت لي هريرة صغيرة فكنت أضعها بالليل في شجرة فإذا كان النهار ذهبت بها معي فلعبت بها فكنوني أبا هريرة ‏. هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 3841,
			"arabicnumber": 3841,
			"text": "حدثنا قتيبة، قال حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن وهب بن منبه، عن أخيه، همام بن منبه عن أبي هريرة، قال ليس أحد أكثر حديثا عن رسول الله صلى الله عليه وسلم مني إلا عبد الله بن عمرو فإنه كان يكتب وكنت لا أكتب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 3842,
			"arabicnumber": 3842,
			"text": "حدثنا محمد بن يحيى، قال حدثنا أبو مسهر عبد الأعلى بن مسهر، عن سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن عبد الرحمن بن أبي عميرة، وكان، من أصحاب رسول الله صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال لمعاوية ‏ \"‏ اللهم اجعله هاديا مهديا واهد به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 3843,
			"arabicnumber": 3843,
			"text": "حدثنا محمد بن يحيى، قال حدثنا عبد الله بن محمد النفيلي، قال حدثنا عمرو بن واقد، عن يونس بن حلبس، عن أبي إدريس الخولاني، قال لما عزل عمر بن الخطاب عمير بن سعيد عن حمص، ولى معاوية فقال الناس عزل عميرا وولى معاوية ‏.‏ فقال عمير لا تذكروا معاوية إلا بخير فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ اللهم اهد به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏, وعمرو بن واقد يضعف ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 3844,
			"arabicnumber": 3844,
			"text": "حدثنا قتيبة، قال حدثنا ابن لهيعة، عن مشرح بن هاعان، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أسلم الناس وآمن عمرو بن العاصي ‏\"‏ ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث ابن لهيعة عن مشرح بن هاعان وليس إسناده بالقوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 3845,
			"arabicnumber": 3845,
			"text": "حدثنا إسحاق بن منصور، قال أخبرنا أبو أسامة، عن نافع بن عمر الجمحي، عن ابن أبي مليكة، قال قال طلحة بن عبيد الله سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إن عمرو بن العاصي من صالحي قريش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إنما نعرفه من حديث نافع بن عمر الجمحي ‏.‏ ونافع ثقة وليس إسناده بمتصل وابن أبي مليكة لم يدرك طلحة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 3846,
			"arabicnumber": 3846,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن هشام بن سعد، عن زيد بن أسلم، عن أبي هريرة، قال نزلنا مع رسول الله صلى الله عليه وسلم منزلا فجعل الناس يمرون فيقول رسول الله صلى الله عليه وسلم ‏\"‏ من هذا يا أبا هريرة ‏\"‏ ‏.‏ فأقول فلان ‏.‏ فيقول ‏\"‏ نعم عبد الله هذا ‏\"‏ ‏.‏ ويقول ‏\"‏ من هذا ‏\"‏ ‏.‏ فأقول فلان ‏.‏ فيقول ‏\"‏ بئس عبد الله هذا ‏\"‏ ‏.‏ حتى مر خالد بن الوليد فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ فقلت هذا خالد بن الوليد ‏.‏ فقال ‏\"‏ نعم عبد الله خالد بن الوليد سيف من سيوف الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ولا نعرف لزيد بن أسلم سماعا من أبي هريرة وهو عندي حديث مرسل ‏.‏ وفي الباب عن أبي بكر الصديق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 3847,
			"arabicnumber": 3847,
			"text": "حدثنا محمود بن غيلان، قال حدثنا وكيع، عن سفيان، عن أبي إسحاق، عن البراء، قال أهدي لرسول الله صلى الله عليه وسلم ثوب حرير فجعلوا يعجبون من لينه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ تعجبون من هذا لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏ ‏. وفي الباب عن أنس ‏.‏ وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 3848,
			"arabicnumber": 3848,
			"text": "حدثنا محمود بن غيلان، قال حدثنا عبد الرزاق، قال أخبرنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول وجنازة سعد بن معاذ بين أيديهم ‏ \"‏ اهتز له عرش الرحمن ‏\"‏ ‏. وفي الباب عن أسيد بن حضير وأبي سعيد ورميثة ‏.‏هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 3849,
			"arabicnumber": 3849,
			"text": "حدثنا عبد بن حميد، قال أخبرنا عبد الرزاق، قال أخبرنا معمر، عن قتادة، عن أنس بن مالك، قال لما حملت جنازة سعد بن معاذ قال المنافقون ما أخف جنازته ‏.‏ وذلك لحكمه في بني قريظة فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏ \"‏ إن الملائكة كانت تحمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 3850,
			"arabicnumber": 3850,
			"text": "حدثنا محمد بن مرزوق البصري، قال حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، قال كان قيس بن سعد من النبي صلى الله عليه وسلم بمنزلة صاحب الشرط من الأمير ‏.‏ قال الأنصاري يعني مما يلي من أموره ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الأنصاري ‏.‏ حدثنا محمد بن يحيى، قال حدثنا محمد بن عبد الله الأنصاري، نحوه ولم يذكر فيه قول الأنصاري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 3851,
			"arabicnumber": 3851,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا سفيان، عن محمد بن المنكدر، عن جابر بن عبد الله، قال جاءني رسول الله صلى الله عليه وسلم ليس براكب بغل ولا برذون ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 3852,
			"arabicnumber": 3852,
			"text": "حدثنا ابن أبي عمر، قال حدثنا بشر بن السري، عن حماد بن سلمة، عن أبي الزبير، عن جابر، قال استغفر لي رسول الله صلى الله عليه وسلم ليلة البعير خمسا وعشرين مرة ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ ومعنى قوله ليلة البعير ما روي عن جابر من غير وجه أنه كان مع النبي صلى الله عليه وسلم في سفر فباع بعيره من النبي صلى الله عليه وسلم واشترط ظهره إلى المدينة يقول جابر ليلة بعت من النبي صلى الله عليه وسلم البعير استغفر لي خمسا وعشرين مرة وكان جابر قد قتل أبوه عبد الله بن عمرو بن حرام يوم أحد وترك بنات فكان جابر يعولهن وينفق عليهن وكان النبي صلى الله عليه وسلم يبر جابرا ويرحمه لسبب ذلك هكذا روي في حديث عن جابر نحو هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 3853,
			"arabicnumber": 3853,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن الأعمش، عن أبي وائل، عن خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله فوقع أجرنا على الله فمنا من مات ولم يأكل من أجره شيئا ومنا من أينعت له ثمرته فهو يهدبها وإن مصعب بن عمير مات ولم يترك إلا ثوبا كانوا إذا غطوا به رأسه خرجت رجلاه وإذا غطي بها رجلاه خرج رأسه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ غطوا رأسه واجعلوا على رجليه الإذخر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا هناد، قال حدثنا ابن إدريس، عن الأعمش، عن أبي وائل، شقيق بن سلمة عن خباب بن الأرت، نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 3854,
			"arabicnumber": 3854,
			"text": "حدثنا عبد الله بن أبي زياد، قال حدثنا سيار، قال حدثنا جعفر بن سليمان، قال حدثنا ثابت، وعلي بن زيد، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ كم من أشعث أغبر ذي طمرين لا يؤبه له لو أقسم على الله لأبره منهم البراء بن مالك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 3855,
			"arabicnumber": 3855,
			"text": "حدثنا موسى بن عبد الرحمن الكندي، قال حدثنا أبو يحيى الحماني، عن بريد بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏ \"‏ يا أبا موسى لقد أعطيت مزمارا من مزامير آل داود ‏\"‏ ‏.‏هذا حديث حسن صحيح ‏.‏ وفي الباب عن بريدة وأبي هريرة وأنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 3856,
			"arabicnumber": 3856,
			"text": "حدثنا محمد بن عبد الله بن بزيع، قال حدثنا الفضيل بن سليمان، قال حدثنا أبو حازم، عن سهل بن سعد، قال كنا مع رسول الله صلى الله عليه وسلم وهو يحفر الخندق ونحن ننقل التراب فيمر بنا فقال ‏ \"‏ اللهم لا عيش إلا عيش الآخرة فاغفر للأنصار والمهاجرة ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وأبو حازم اسمه سلمة بن دينار الأعرج الزاهد ‏.‏وفي الباب عن أنس بن مالك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 3857,
			"arabicnumber": 3857,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن قتادة، قال حدثنا أنس، أن النبي صلى الله عليه وسلم كان يقول ‏ \"‏ اللهم لا عيش إلا عيش الآخرة فأكرم الأنصار والمهاجرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب وقد روي من غير وجه عن أنس رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 3858,
			"arabicnumber": 3858,
			"text": "حدثنا يحيى بن حبيب بن عربي، قال حدثنا موسى بن إبراهيم بن كثير الأنصاري، قال سمعت طلحة بن خراش، يقول سمعت جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا تمس النار مسلما رآني أو رأى من رآني ‏\"‏ ‏.‏ قال طلحة فقد رأيت جابر بن عبد الله ‏.‏ وقال موسى وقد رأيت طلحة ‏.‏ قال يحيى وقال لي موسى وقد رأيتني ونحن نرجو الله ‏. هذا حديث حسن غريب لا نعرفه إلا من حديث موسى بن إبراهيم الأنصاري ‏.‏ وروى علي بن المديني وغير واحد من أهل الحديث عن موسى هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 3859,
			"arabicnumber": 3859,
			"text": "حدثني هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبيدة، هو السلماني عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خير الناس قرني ثم الذين يلونهم ثم الذين يلونهم ثم يأتي قوم من بعد ذلك تسبق أيمانهم شهاداتهم أو شهاداتهم أيمانهم ‏\"‏ ‏.‏ وفي الباب عن عمر وعمران بن حصين وبريدة ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 3860,
			"arabicnumber": 3860,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يدخل النار أحد ممن بايع تحت الشجرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 3861,
			"arabicnumber": 3861,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود، قال أخبرنا شعبة، عن الأعمش، قال سمعت ذكوان أبا صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبوا أصحابي فوالذي نفسي بيده لو أن أحدكم أنفق مثل أحد ذهبا ما أدرك مد أحدهم ولا نصيفه ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ ومعنى قوله ‏\"‏ نصيفه ‏\"‏ يعني نصف المد ‏.‏ حدثنا الحسن بن علي الخلال، - وكان حافظا - قال حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي سعيد الخدري ، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 3862,
			"arabicnumber": 3862,
			"text": "حدثنا محمد بن يحيى، قال حدثنا يعقوب بن إبراهيم بن سعد، قال حدثنا عبيدة ابن أبي رائطة، عن عبد الرحمن بن زياد، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الله الله في أصحابي الله الله في أصحابي لا تتخذوهم غرضا بعدي فمن أحبهم فبحبي أحبهم ومن أبغضهم فببغضي أبغضهم ومن آذاهم فقد آذاني ومن آذاني فقد آذى الله ومن آذى الله فيوشك أن يأخذه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 3863,
			"arabicnumber": 3863,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أزهر السمان، عن سليمان التيمي، عن خداش، عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ليدخلن الجنة من بايع تحت الشجرة إلا صاحب الجمل الأحمر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 3864,
			"arabicnumber": 3864,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن أبي الزبير، عن جابر، أن عبدا، لحاطب بن أبي بلتعة جاء رسول الله صلى الله عليه وسلم يشكو حاطبا فقال يا رسول الله ليدخلن حاطب النار ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ كذبت لا يدخلها فإنه قد شهد بدرا والحديبية ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 3865,
			"arabicnumber": 3865,
			"text": "حدثنا أبو كريب، قال حدثنا عثمان بن ناجية، عن عبد الله بن مسلم أبي طيبة، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما من أحد من أصحابي يموت بأرض إلا بعث قائدا ونورا لهم يوم القيامة ‏\"‏ ‏. هذا حديث غريب ‏.‏ وروي هذا الحديث عن عبد الله بن مسلم أبي طيبة عن ابن بريدة عن النبي صلى الله عليه وسلم مرسلا وهو أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 3866,
			"arabicnumber": 3866,
			"text": "حدثنا أبو بكر، محمد بن نافع قال حدثنا النضر بن حماد، قال حدثنا سيف ابن عمر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا رأيتم الذين يسبون أصحابي فقولوا لعنة الله على شركم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث منكر لا نعرفه من حديث عبيد الله بن عمر إلا من هذا الوجه ‏.‏ والنضر مجهول وسيف مجهول ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 3867,
			"arabicnumber": 3867,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن ابن أبي مليكة، عن المسور بن مخرمة، قال سمعت النبي صلى الله عليه وسلم يقول وهو على المنبر ‏ \"‏ إن بني هشام بن المغيرة استأذنوني في أن ينكحوا ابنتهم علي بن أبي طالب فلا آذن ثم لا آذن ثم لا آذن إلا أن يريد ابن أبي طالب أن يطلق ابنتي وينكح ابنتهم فإنها بضعة مني يريبني ما رابها ويؤذيني ما آذاها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه عمرو بن دينار عن ابن أبي مليكة عن المسور بن مخرمة نحو حديث الليث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 3868,
			"arabicnumber": 3868,
			"text": "حدثنا إبراهيم بن سعيد الجوهري، قال حدثنا الأسود بن عامر، عن جعفر الأحمر، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، قال كان أحب النساء إلى رسول الله صلى الله عليه وسلم فاطمة ومن الرجال علي ‏.‏ قال إبراهيم بن سعيد يعني من أهل بيته ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 3869,
			"arabicnumber": 3869,
			"text": "حدثنا أحمد بن منيع، قال حدثنا إسماعيل ابن علية، عن أيوب، عن ابن أبي مليكة، عن عبد الله بن الزبير، أن عليا، ذكر بنت أبي جهل فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏ \"‏ إنما فاطمة بضعة مني يؤذيني ما آذاها وينصبني ما أنصبها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ هكذا قال أيوب عن ابن أبي مليكة عن ابن الزبير وقال غير واحد عن ابن أبي مليكة عن المسور بن مخرمة ويحتمل أن يكون ابن أبي مليكة روى عنهما جميعا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 3870,
			"arabicnumber": 3870,
			"text": "حدثنا سليمان بن عبد الجبار البغدادي، قال حدثنا علي بن قادم، قال حدثنا أسباط بن نصر الهمداني، عن السدي، عن صبيح، مولى أم سلمة عن زيد بن أرقم، أن رسول الله صلى الله عليه وسلم قال لعلي وفاطمة والحسن والحسين ‏ \"‏ أنا حرب لمن حاربتم وسلم لمن سالمتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من هذا الوجه ‏.‏ وصبيح مولى أم سلمة ليس بمعروف ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 3871,
			"arabicnumber": 3871,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو أحمد الزبيري، قال حدثنا سفيان، عن زبيد، عن شهر بن حوشب، عن أم سلمة، أن النبي صلى الله عليه وسلم جلل على الحسن والحسين وعلي وفاطمة كساء ثم قال ‏\"‏ اللهم هؤلاء أهل بيتي وخاصتي أذهب عنهم الرجس وطهرهم تطهيرا ‏\"‏ ‏.‏ فقالت أم سلمة وأنا معهم يا رسول الله قال ‏\"‏ إنك على خير ‏\"‏ ‏. هذا حديث حسن صحيح وهو أحسن شيء روي في هذا الباب ‏.‏ وفي الباب عن عمر بن أبي سلمة وأنس بن مالك وأبي الحمراء ومعقل بن يسار وعائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 3872,
			"arabicnumber": 3872,
			"text": "حدثنا محمد بن بشار، قال حدثنا عثمان بن عمر، قال أخبرنا إسرائيل، عن ميسرة ابن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت ما رأيت أحدا أشبه سمتا ودلا وهديا برسول الله في قيامها وقعودها من فاطمة بنت رسول الله صلى الله عليه وسلم ‏.‏ قالت وكانت إذا دخلت على النبي صلى الله عليه وسلم قام إليها فقبلها وأجلسها في مجلسه وكان النبي صلى الله عليه وسلم إذا دخل عليها قامت من مجلسها فقبلته وأجلسته في مجلسها فلما مرض النبي صلى الله عليه وسلم دخلت فاطمة فأكبت عليه فقبلته ثم رفعت رأسها فبكت ثم أكبت عليه ثم رفعت رأسها فضحكت فقلت إن كنت لأظن أن هذه من أعقل نسائنا فإذا هي من النساء فلما توفي النبي صلى الله عليه وسلم قلت لها أرأيت حين أكببت على النبي صلى الله عليه وسلم فرفعت رأسك فبكيت ثم أكببت عليه فرفعت رأسك فضحكت ما حملك على ذلك قالت إني إذا لبذرة أخبرني أنه ميت من وجعه هذا فبكيت ثم أخبرني أني أسرع أهله لحوقا به فذاك حين ضحكت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وقد روي هذا الحديث من غير وجه عن عائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 3873,
			"arabicnumber": 3873,
			"text": "أخبرنا محمد بن بشار، قال حدثنا محمد بن خالد بن عثمة، قال حدثني موسى بن يعقوب الزمعي، عن هاشم بن هاشم، أن عبد الله بن وهب، أخبره أن أم سلمة أخبرته أن رسول الله صلى الله عليه وسلم دعا فاطمة يوم الفتح فناجاها فبكت ثم حدثها فضحكت ‏.‏ قالت فلما توفي رسول الله صلى الله عليه وسلم سألتها عن بكائها وضحكها قالت أخبرني رسول الله صلى الله عليه وسلم أنه يموت فبكيت ثم أخبرني أني سيدة نساء أهل الجنة إلا مريم ابنت عمران فضحكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 3874,
			"arabicnumber": 3874,
			"text": "حدثنا حسين بن يزيد الكوفي، قال حدثنا عبد السلام بن حرب، عن أبي الجحاف، عن جميع بن عمير التيمي، قال دخلت مع عمتي على عائشة فسئلت أى الناس كان أحب إلى رسول الله صلى الله عليه وسلم قالت فاطمة ‏.‏ فقيل من الرجال قالت زوجها إن كان ما علمت صواما قواما ‏.‏ هذا حديث حسن غريب ‏.‏ وأبو الجحاف اسمه داود بن أبي عوف ويروى عن سفيان الثوري قال حدثنا أبو الجحاف وكان مرضيا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 3875,
			"arabicnumber": 3875,
			"text": "حدثنا أبو هشام الرفاعي، قال حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما غرت على أحد من أزواج النبي صلى الله عليه وسلم ما غرت على خديجة وما بي أن أكون أدركتها وما ذاك إلا لكثرة ذكر رسول الله صلى الله عليه وسلم لها وإن كان ليذبح الشاة فيتتبع بها صدائق خديجة فيهديها لهن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 3876,
			"arabicnumber": 3876,
			"text": "حدثنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما حسدت أحدا ما حسدت خديجة وما تزوجني رسول الله صلى الله عليه وسلم إلا بعد ما ماتت وذلك أن رسول الله صلى الله عليه وسلم بشرها ببيت في الجنة من قصب لا صخب فيه ولا نصب ‏.‏ هذا حديث حسن ‏.‏ من قصب قال إنما يعني به قصب اللؤلؤ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 3877,
			"arabicnumber": 3877,
			"text": "حدثنا هارون بن إسحاق الهمداني، قال حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن عبد الله بن جعفر، قال سمعت علي بن أبي طالب، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ خير نسائها خديجة بنت خويلد وخير نسائها مريم بنت عمران ‏\"‏ ‏. وفي الباب عن أنس وابن عباس وعائشة ‏.‏ وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 3878,
			"arabicnumber": 3878,
			"text": "حدثنا أبو بكر بن زنجويه، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن قتادة، عن أنس، رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏ \"‏ حسبك من نساء العالمين مريم ابنة عمران وخديجة بنت خويلد وفاطمة بنت محمد وآسية امرأة فرعون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 3879,
			"arabicnumber": 3879,
			"text": "حدثنا يحيى بن درست، - المصري - قال حدثنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان الناس يتحرون بهداياهم يوم عائشة قالت فاجتمع صواحباتي إلى أم سلمة فقلن يا أم سلمة إن الناس يتحرون بهداياهم يوم عائشة وإنا نريد الخير كما تريد عائشة فقولي لرسول الله صلى الله عليه وسلم يأمر الناس يهدون إليه أينما كان فذكرت ذلك أم سلمة فأعرض عنها ثم عاد إليها فأعادت الكلام فقالت يا رسول الله إن صواحباتي قد ذكرن أن الناس يتحرون بهداياهم يوم عائشة فأمر الناس يهدون أينما كنت ‏.‏ فلما كانت الثالثة قالت ذلك قال ‏ \"‏ يا أم سلمة لا تؤذيني في عائشة فإنه ما أنزل على الوحى وأنا في لحاف امرأة منكن غيرها ‏\"‏ ‏‏.‏ وقد روى بعضهم هذا الحديث عن حماد بن زيد عن هشام بن عروة عن أبيه عن النبي صلى الله عليه وسلم مرسلا ‏. هذا حديث حسن غريب ‏ وقد روي عن هشام بن عروة هذا الحديث عن عوف بن الحارث عن رميثة عن أم سلمة شيئا من هذا ‏.و‏هذا حديث قد روي عن هشام بن عروة على روايات مختلفة ‏.‏ وقد روى سليمان بن بلال عن هشام بن عروة عن أبيه عن عائشة نحو حديث حماد بن زيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 3880,
			"arabicnumber": 3880,
			"text": "حدثنا عبد بن حميد، قال أخبرنا عبد الرزاق، عن عبد الله بن عمرو بن علقمة المكي، عن ابن أبي حسين، عن ابن أبي مليكة، عن عائشة، أن جبريل، جاء بصورتها في خرقة حرير خضراء إلى النبي صلى الله عليه وسلم فقال ‏ \"‏ هذه زوجتك في الدنيا والآخرة ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث عبد الله بن عمرو بن علقمة ‏.‏ وقد روى عبد الرحمن بن مهدي هذا الحديث عن عبد الله بن عمرو بن علقمة بهذا الإسناد مرسلا ولم يذكر فيه عن عائشة وقد روى أبو أسامة عن هشام بن عروة عن أبيه عن عائشة عن النبي صلى الله عليه وسلم شيئا من هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 3881,
			"arabicnumber": 3881,
			"text": "حدثنا سويد بن نصر، قال حدثنا عبد الله بن المبارك، قال أخبرنا معمر، عن الزهري، عن أبي سلمة، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ يا عائشة هذا جبريل وهو يقرأ عليك السلام ‏\"‏ ‏.‏ قالت قلت وعليه السلام ورحمة الله وبركاته ترى ما لا نرى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 3882,
			"arabicnumber": 3882,
			"text": "حدثنا سويد، قال أخبرنا عبد الله بن المبارك، قال أخبرنا زكريا، عن الشعبي، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ إن جبريل يقرأ عليك السلام ‏\"‏ ‏.‏ فقلت وعليه السلام ورحمة الله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 3883,
			"arabicnumber": 3883,
			"text": "حدثنا حميد بن مسعدة، قال حدثنا زياد بن الربيع، قال حدثنا خالد بن سلمة المخزومي، عن ابن أبي بردة، عن أبي موسى، قال ما أشكل علينا أصحاب رسول الله صلى الله عليه وسلم حديث قط فسألنا عائشة إلا وجدنا عندها منه علما ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 3884,
			"arabicnumber": 3884,
			"text": "حدثنا القاسم بن دينار الكوفي، قال حدثنا معاوية بن عمرو، عن زائدة، عن عبد الملك بن عمير، عن موسى بن طلحة، قال ما رأيت أحدا أفصح من عائشة ‏.‏ هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 3885,
			"arabicnumber": 3885,
			"text": "حدثنا إبراهيم بن يعقوب، ومحمد بن بشار، واللفظ، لابن يعقوب قالا حدثنا يحيى بن حماد، قال حدثنا عبد العزيز بن المختار، قال حدثنا خالد الحذاء، عن أبي عثمان النهدي، عن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم استعمله على جيش ذات السلاسل ‏.‏ قال فأتيته فقلت يا رسول الله أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قلت من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 3886,
			"arabicnumber": 3886,
			"text": "حدثنا إبراهيم بن سعيد الجوهري، قال حدثنا يحيى بن سعيد الأموي، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن عمرو بن العاص، أنه قال يا رسول الله من أحب الناس إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قال من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه من حديث إسماعيل عن قيس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 3887,
			"arabicnumber": 3887,
			"text": "حدثنا علي بن حجر، قال حدثنا إسماعيل بن جعفر، عن عبد الله بن عبد الرحمن بن معمر الأنصاري، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏. وفي الباب عن عائشة وأبي موسى ‏.‏ وهذا حديث حسن صحيح ‏.‏ وعبد الله بن عبد الرحمن بن معمر هو أبو طوالة الأنصاري المدني ثقة وقد روى عنه مالك بن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 3888,
			"arabicnumber": 3888,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا سفيان، عن أبي إسحاق، عن عمرو بن غالب، أن رجلا، نال من عائشة عند عمار بن ياسر فقال اغرب مقبوحا منبوحا أتؤذي حبيبة رسول الله صلى الله عليه وسلم ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 3889,
			"arabicnumber": 3889,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا أبو بكر بن عياش، عن أبي حصين، عن عبد الله بن زياد الأسدي، قال سمعت عمار بن ياسر، يقول هي زوجته في الدنيا والآخرة ‏.‏ يعني عائشة رضى الله عنها ‏.‏ هذا حديث حسن صحيح ‏.‏ وفي الباب عن علي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 3890,
			"arabicnumber": 3890,
			"text": "حدثنا أحمد بن عبدة الضبي، قال حدثنا المعتمر بن سليمان، عن حميد، عن أنس قال قيل يا رسول الله من أحب الناس إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قيل من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب من هذا الوجه من حديث أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 3891,
			"arabicnumber": 3891,
			"text": "حدثنا عباس العنبري، قال حدثنا يحيى بن كثير العنبري أبو غسان، قال حدثنا سلم ابن جعفر وكان ثقة عن الحكم بن أبان، عن عكرمة، قال قيل لابن عباس بعد صلاة الصبح ماتت فلانة لبعض أزواج النبي صلى الله عليه وسلم فسجد فقيل له أتسجد هذه الساعة فقال أليس قد قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا رأيتم آية فاسجدوا ‏\"‏ ‏.‏ فأى آية أعظم من ذهاب أزواج النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 3892,
			"arabicnumber": 3892,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا هاشم، هو ابن سعيد الكوفي قال حدثنا كنانة، قال حدثتنا صفية بنت حيى، قالت دخل على رسول الله صلى الله عليه وسلم وقد بلغني عن حفصة وعائشة كلام فذكرت ذلك له فقال ‏ \"‏ ألا قلت فكيف تكونان خيرا مني وزوجي محمد وأبي هارون وعمي موسى ‏\"‏ ‏.‏ وكان الذي بلغها أنهم قالوا نحن أكرم على رسول الله صلى الله عليه وسلم منها ‏.‏ وقالوا نحن أزواج النبي صلى الله عليه وسلم وبنات عمه ‏.‏ وفي الباب عن أنس ‏.‏هذا حديث غريب لا نعرفه من حديث صفية إلا من حديث هاشم الكوفي وليس إسناده بذلك القوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 3893,
			"arabicnumber": 3893,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن خالد بن عثمة، قال حدثني موسى بن يعقوب الزمعي، عن هاشم بن هاشم، أن عبد الله بن وهب بن زمعة أخبره أن أم سلمة أخبرته أن رسول الله صلى ا��له عليه وسلم دعا فاطمة عام الفتح فناجاها فبكت ثم حدثها فضحكت قالت فلما توفي رسول الله صلى الله عليه وسلم سألتها عن بكائها وضحكها ‏.‏ قالت أخبرني رسول الله صلى الله عليه وسلم أنه يموت فبكيت ثم أخبرني أني سيدة نساء أهل الجنة إلا مريم بنت عمران فضحكت ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 3894,
			"arabicnumber": 3894,
			"text": "حدثنا إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، عن ثابت، عن أنس، قال بلغ صفية أن حفصة، قالت بنت يهودي ‏.‏ فبكت فدخل عليها النبي صلى الله عليه وسلم وهي تبكي فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقالت قالت لي حفصة إني بنت يهودي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنك لابنة نبي وإن عمك لنبي وإنك لتحت نبي ففيم تفخر عليك ‏\"‏ ‏.‏ ثم قال ‏\"‏ اتقي الله يا حفصة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 3895,
			"arabicnumber": 3895,
			"text": "حدثنا محمد بن يحيى، قال حدثنا محمد بن يوسف، قال حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ خيركم خيركم لأهله وأنا خيركم لأهلي وإذا مات صاحبكم فدعوه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح من حديث الثوري ما أقل من رواه عن الثوري ‏.‏ وروي هذا عن هشام بن عروة عن أبيه عن النبي صلى الله عليه وسلم مرسل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 3896,
			"arabicnumber": 3896,
			"text": "حدثنا محمد بن يحيى، قال حدثنا محمد بن يوسف، عن إسرائيل، عن الوليد، عن زيد بن زائدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبلغني أحد عن أحد من أصحابي شيئا فإني أحب أن أخرج إليهم وأنا سليم الصدر ‏\"‏ ‏.‏ قال عبد الله فأتي رسول الله صلى الله عليه وسلم بمال فقسمه فانتهيت إلى رجلين جالسين وهما يقولان والله ما أراد محمد بقسمته التي قسمها وجه الله ولا الدار الآخرة ‏.‏ فتثبت حين سمعتهما فأتيت رسول الله صلى الله عليه وسلم وأخبرته فاحمر وجهه وقال ‏\"‏ دعني عنك فقد أوذي موسى بأكثر من هذا فصبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وقد زيد في هذا الإسناد رجل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 3897,
			"arabicnumber": 3897,
			"text": "حدثنا محمد بن إسماعيل، قال حدثنا عبد الله بن محمد، قال حدثنا عبيد الله بن موسى، والحسين بن محمد، عن إسرائيل، عن السدي، عن الوليد بن أبي هشام، عن زيد بن زائدة، عن عبد الله بن مسعود، رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يبلغني أحد عن أحد شيئا ‏\"‏ ‏.‏ وقد روي هذا الحديث عن عبد الله بن مسعود عن النبي صلى الله عليه وسلم شيئا من هذا من غير هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 3898,
			"arabicnumber": 3898,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو داود، قال أخبرنا شعبة، عن عاصم، قال سمعت زر بن حبيش، يحدث عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏ فقرأ عليه ‏:‏ ‏(‏ لم يكن الذين كفروا ‏)‏ وفيها ‏\"‏ إن ذات الدين عند الله الحنيفية المسلمة لا اليهودية ولا النصرانية ولا المجوسية من يعمل خيرا فلن يكفره ‏\"‏ ‏.‏ وقرأ عليه ‏\"‏ لو أن لابن آدم واديا من مال لابتغى إليه ثانيا ولو كان له ثانيا لابتغى إليه ثالثا ولا يملأ جوف ابن آدم إلا التراب ويتوب الله على من تاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير هذا الوجه رواه عبد الله بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب رضى الله عنه أن النبي صلى الله عليه وسلم قال له ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏ وقد رواه قتادة عن أنس أن النبي صلى الله عليه وسلم قال لأبى بن كعب ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 3899,
			"arabicnumber": 3899,
			"text": "حدثنا محمد بن بشار، قال حدثنا أبو عامر، عن زهير بن محمد، عن عبد الله ابن محمد بن عقيل، عن الطفيل بن أبى بن كعب، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا الهجرة لكنت امرأ من الأنصار ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ لو سلك الناس واديا أو شعبا لكنت مع الأنصار ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 3900,
			"arabicnumber": 3900,
			"text": "حدثنا بندار قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عدي بن ثابت، عن البراء بن عازب، أنه سمع النبي صلى الله عليه وسلم أو قال قال النبي صلى الله عليه وسلم في الأنصار ‏ \"‏ لا يحبهم إلا مؤمن ولا يبغضهم إلا منافق من أحبهم فأحبه الله ومن أبغضهم فأبغضه الله ‏\"‏ ‏.‏ فقلت له أأنت سمعته من البراء فقال إياى حدث ‏.‏ هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 3901,
			"arabicnumber": 3901,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر،قال حدثنا شعبة، قال سمعت قتادة، عن أنس، رضي الله عنه قال جمع رسول الله صلى الله عليه وسلم ناسا من الأنصار فقال ‏\"‏ هلم هل فيكم أحد من غيركم ‏\"‏ ‏.‏ قالوا لا إلا ابن أخت لنا ‏.‏ فقال صلى الله عليه وسلم ‏\"‏ إن ابن أخت القوم منهم ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن قريشا حديث عهدهم بجاهلية ومصيبة وإني أردت أن أجبرهم وأتألفهم أما ترضون أن يرجع الناس بالدنيا وترجعون برسول الله صلى الله عليه وسلم إلى بيوتكم ‏\"‏ ‏.‏ قالوا بلى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو سلك الناس واديا أو شعبا وسلكت الأنصار واديا أو شعبا لسلكت وادي الأنصار أو شعبهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 3902,
			"arabicnumber": 3902,
			"text": "حدثنا أحمد بن منيع، قال حدثنا هشيم، قال أخبرنا علي بن زيد بن جدعان، قال حدثنا النضر بن أنس، عن زيد بن أرقم، أنه كتب إلى أنس بن مالك يعزيه فيمن أصيب من أهله وبني عمه يوم الحرة فكتب إليه إني أبشرك ببشرى من الله إني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ اللهم اغفر للأنصار ولذراري الأنصار ولذراري ذراريهم ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏‏ وقد رواه قتادة عن النضر بن أنس، عن زيد بن أرقم، ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 3903,
			"arabicnumber": 3903,
			"text": "حدثنا عبدة بن عبد الله الخزاعي البصري، قال حدثنا أبو داود، وعبد الصمد، قالا حدثنا محمد بن ثابت البناني، عن أبيه، عن أنس بن مالك، عن أبي طلحة، قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ اقرأ قومك السلام فإنهم ما علمت أعفة صبر ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 3904,
			"arabicnumber": 3904,
			"text": "حدثنا الحسين بن حريث، قال حدثني الفضل بن موسى، عن زكريا ابن أبي زائدة، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ألا إن عيبتي التي آوي إليها أهل بيتي وإن كرشي الأنصار فاعفوا عن مسيئهم واقبلوا من محسنهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏. وفي الباب عن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 3905,
			"arabicnumber": 3905,
			"text": "حدثنا أحمد بن الحسن، قال حدثنا سليمان بن داود الهاشمي، قال حدثنا إبراهيم ابن سعد، قال حدثني صالح بن كيسان، عن الزهري، عن محمد بن أبي سفيان، عن يوسف بن الحكم، عن محمد بن سعد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يرد هوان قريش أهانه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ حدثنا عبد بن حميد، قال أخبرني يعقوب بن إبراهيم بن سعد، قال حدثني أبي، عن صالح بن كيسان، عن ابن شهاب، بهذا الإسناد نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 3906,
			"arabicnumber": 3906,
			"text": "حدثنا محمود بن غيلان، قال حدثنا بشر بن السري، والمؤمل، قالا حدثنا سفيان، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ لا يبغض الأنصار أحد يؤمن بالله واليوم الآخر ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 3907,
			"arabicnumber": 3907,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الأنصار كرشي وعيبتي وإن الناس سيكثرون ويقلون فاقبلوا من محسنهم وتجاوزوا عن مسيئهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 3908,
			"arabicnumber": 3908,
			"text": "حدثنا أبو كريب، قال حدثنا أبو يحيى الحماني، عن الأعمش، عن طارق بن عبد الرحمن، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ اللهم أذقت أول قريش نكالا فأذق آخرهم نوالا ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ حدثنا عبد الوهاب الوراق، قال حدثنا يحيى بن سعيد الأموي، عن الأعمش، نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 3909,
			"arabicnumber": 3909,
			"text": "حدثنا القاسم بن دينار الكوفي، قال حدثنا إسحاق بن منصور، عن جعفر الأحمر، عن عطاء بن السائب، عن أنس، أن النبي صلى الله عليه وسلم قال ‏ \"‏ اللهم اغفر للأنصار ولأبناء الأنصار ولأبناء أبناء الأنصار ولنساء الأنصار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 3910,
			"arabicnumber": 3910,
			"text": "حدثنا قتيبة، قال حدثنا الليث بن سعد، عن يحيى بن سعيد الأنصاري، أنه سمع أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بخير دور الأنصار أو بخير الأنصار ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ بنو النجار ثم الذين يلونهم بنو عبد الأشهل ثم الذين يلونهم بنو الحارث بن الخزرج ثم الذين يلونهم بنو ساعدة ‏\"‏ ‏.‏ ثم قال بيده فقبض أصابعه ثم بسطهن كالرامي بيديه قال ‏\"‏ وفي دور الأنصار كلها خير ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روي هذا أيضا عن أنس عن أبي أسيد الساعدي عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 3911,
			"arabicnumber": 3911,
			"text": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، عن أبي أسيد الساعدي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خير دور الأنصار دور بني النجار ثم دور بني عبد الأشهل ثم بني الحارث بن الخزرج ثم بني ساعدة وفي كل دور الأنصار خير ‏\"‏ ‏.‏ فقال سعد ما أرى رسول الله صلى الله عليه وسلم إلا قد فضل علينا ‏.‏ فقيل قد فضلكم على كثير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو أسيد الساعدي اسمه مالك بن ربيعة ‏.‏ وقد روي نحو هذا عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ ورواه معمر عن الزهري عن أبي سلمة وعبيد الله بن عبد الله بن عتبة عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 3912,
			"arabicnumber": 3912,
			"text": "حدثنا أبو السائب سلم بن جنادة قال حدثنا أحمد بن بشير، عن مجالد، عن الشعبي، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خير ديار الأنصار بنو النجار ‏\"‏ ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 3913,
			"arabicnumber": 3913,
			"text": "حدثنا أبو السائب، سلم بن جنادة قال حدثنا أحمد بن بشير، عن مجالد، عن الشعبي، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ خير الأنصار بنو عبد الأشهل ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 3914,
			"arabicnumber": 3914,
			"text": "حدثنا قتيبة بن سعد‏ قال حدثنا الليث عن سعيد بن أبي سعيد المقبري، عن عمرو بن سليم الزرقي، عن عاصم بن عمر، عن علي بن أبي طالب، قال خرجنا مع رسول الله صلى الله عليه وسلم حتى إذا كنا بحرة السقيا التي كانت لسعد بن أبي وقاص فقال رسول الله صلى الله عليه وسلم ‏\"‏ ائتوني بوضوء ‏\"‏ ‏.‏ فتوضأ ثم قام فاستقبل القبلة ثم قال ‏\"‏ اللهم إن إبراهيم كان عبدك وخليلك ودعا لأهل مكة بالبركة وأنا عبدك ورسولك أدعوك لأهل المدينة أن تبارك لهم في مدهم وصاعهم مثلى ما باركت لأهل مكة مع البركة بركتين ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وفي الباب عن عائشة وعبد الله بن زيد وأبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 3915,
			"arabicnumber": 3915,
			"text": "حدثنا عبد الله بن أبي زياد،‏ قال حدثنا أبو نباتة، يونس بن يحيى بن نباتة‏ قال حدثنا سلمة بن وردان، عن أبي سعيد بن أبي المعلى، عن علي بن أبي طالب، وأبي هريرة قالا قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه من حديث علي وقد روي من غير هذا الوجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 3916,
			"arabicnumber": 3916,
			"text": "حدثنا محمد بن كامل المروزي، قال حدثنا عبد العزيز بن أبي حازم الزاهد، عن كثير بن زيد، عن الوليد بن رباح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة في مسجدي هذا خير من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام ‏\"‏ ‏.‏هذا حديث حسن صحيح وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم من غير وجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 3917,
			"arabicnumber": 3917,
			"text": "حدثنا محمد بن بشار، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من استطاع أن يموت بالمدينة فليمت بها فإني أشفع لمن يموت بها ‏\"‏ ‏.‏ وفي الباب عن سبيعة بنت الحارث الأسلمية ‏. هذا حديث حسن صحيح غريب من هذا الوجه من حديث أيوب السختياني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 3918,
			"arabicnumber": 3918,
			"text": "حدثنا محمد بن عبد الأعلى، قال حدثنا المعتمر بن سليمان، قال سمعت عبيد الله ابن عمر، عن نافع، عن ابن عمر، رضى الله عنهما أن مولاة، له أتته فقالت اشتد على الزمان وإني أريد أن أخرج إلى العراق ‏.‏ قال فهلا إلى الشأم أرض المنشر اصبري لكاع فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ من صبر على شدتها ولأوائها كنت له شهيدا أو شفيعا يوم القيامة ‏\"‏ ‏.‏ وفي الباب عن أبي سعيد وسفيان بن أبي زهير وسبيعة الأسلمية ‏.‏هذا حديث حسن صحيح غريب من حديث عبيد الله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 3919,
			"arabicnumber": 3919,
			"text": "حدثنا أبو السائب، سلم بن جنادة قال أخبرنا أبي جنادة بن سلم، عن هشام بن عروة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ آخر قرية من قرى الإسلام خرابا المدينة ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث جنادة عن هشام بن عروة ‏.‏ قال تعجب محمد بن إسماعيل من حديث أبي هريرة هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 3920,
			"arabicnumber": 3920,
			"text": "حدثنا الأنصاري، قال حدثنا معن، قال حدثنا مالك بن أنس، وحدثنا قتيبة، عن مالك بن أنس، عن محمد بن المنكدر، عن جابر، أن أعرابيا، بايع رسول الله صلى الله عليه وسلم على الإسلام فأصابه وعك بالمدينة فجاء الأعرابي إلى رسول الله صلى الله عليه وسلم فقال أقلني بيعتي ‏.‏ فأبى رسول الله صلى الله عليه وسلم فخرج الأعرابي ثم جاءه فقال أقلني بيعتي ‏.‏ فأبى فخرج الأعرابي فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إنما المدينة كالكير تنفي خبثها وتنصع طيبها ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة ‏.‏هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 3921,
			"arabicnumber": 3921,
			"text": "حدثنا الأنصاري، قال حدثنا معن، قال حدثنا مالك، وحدثنا قتيبة، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أنه كان يقول لو رأيت الظباء ترتع بالمدينة ما ذعرتها إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما بين لابتيها حرام ‏\"‏ ‏. وفي الباب عن سعد وعبد الله بن زيد وأنس وأبي أيوب وزيد بن ثابت ورافع بن خديج وسهل بن حنيف وجابر ‏.‏ حديث أبي هريرة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 3922,
			"arabicnumber": 3922,
			"text": "حدثنا قتيبة، عن مالك، وحدثنا الأنصاري، قال حدثنا معن، قال حدثنا مالك، عن عمرو بن أبي عمرو، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم طلع له أحد فقال ‏ \"‏ هذا جبل يحبنا ونحبه اللهم إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 3923,
			"arabicnumber": 3923,
			"text": "حدثنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن عيسى بن عبيد، عن غيلان بن عبد الله العامري، عن أبي زرعة بن عمرو بن جرير، عن جرير بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن الله أوحى إلى أى هؤلاء الثلاثة نزلت فهي دار هجرتك المدينة أو البحرين أو قنسرين ‏\"‏ ‏. هذا حديث غريب لا نعرفه إلا من حديث الفضل بن موسى تفرد به أبو عامر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 3924,
			"arabicnumber": 3924,
			"text": "حدثنا محمود بن غيلان، قال حدثنا الفضل بن موسى، قال حدثنا هشام بن عروة، عن صالح بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يصبر على لأواء المدينة وشدتها أحد إلا كنت له شفيعا أو شهيدا يوم القيامة ‏\"‏ ‏.‏ وفي الباب عن أبي سعيد وسفيان بن أبي زهير وسبيعة الأسلمية ‏.‏ وهذا حديث حسن غريب من هذا الوجه ‏. وصالح بن أبي صالح أخو سهيل بن أبي صالح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 3925,
			"arabicnumber": 3925,
			"text": "حدثنا قتيبة، قال حدثنا الليث، عن عقيل، عن الزهري، عن أبي سلمة، عن عبد الله بن عدي بن حمراء الزهري، قال رأيت رسول الله صلى الله عليه وسلم واقفا على الحزورة فقال ‏ \"‏ والله إنك لخير أرض الله وأحب أرض الله إلى الله ولولا أني أخرجت منك ما خرجت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقد رواه يونس عن الزهري نحوه ‏.‏ ورواه محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وحديث الزهري عن أبي سلمة عن عبد الله بن عدي بن حمراء عندي أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 3926,
			"arabicnumber": 3926,
			"text": "حدثنا محمد بن موسى البصري، قال حدثنا الفضيل بن سليمان، عن عبد الله بن عثمان بن خثيم، قال حدثنا سعيد بن جبير، وأبو الطفيل، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمكة ‏ \"‏ ما أطيبك من بلد وأحبك إلى ولولا أن قومي أخرجوني منك ما سكنت غيرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 3927,
			"arabicnumber": 3927,
			"text": "حدثنا محمد بن يحيى الأزدي، وأحمد بن منيع، وغير، واحد، قالوا حدثنا أبو بدر، شجاع ابن الوليد عن قابوس بن أبي ظبيان، عن أبيه، عن سلمان، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا سلمان لا تبغضني فتفارق دينك ‏\"‏ ‏.‏ قلت يا رسول الله كيف أبغضك وبك هدانا الله قال ‏\"‏ تبغض العرب فتبغضني ‏\"‏ ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث أبي بدر شجاع بن الوليد ‏.‏ وسمعت محمد بن إسماعيل يقول أبو ظبيان لم يدرك سلمان مات سلمان قبل علي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 3928,
			"arabicnumber": 3928,
			"text": "حدثنا عبد بن حميد، قال حدثنا محمد بن بشر العبدي، قال حدثنا عبد الله بن عبد الله بن الأسود، عن حصين بن عمر الأحمسي، عن مخارق بن عبد الله، عن طارق بن شهاب، عن عثمان ابن عفان، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من غش العرب لم يدخل في شفاعتي ولم تنله مودتي ‏\"‏ ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث حصين بن عمر الأحمسي عن مخارق ‏.‏ وليس حصين عند أهل الحديث بذاك القوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "حدثنا يحيى بن موسى، قال حدثنا سليمان بن حرب، قال حدثنا محمد بن أبي رزين، عن أمه، قالت كانت أم الحرير إذا مات أحد من العرب اشتد عليها فقيل لها إنا نراك إذا مات رجل من العرب اشتد عليك ‏.‏ قالت سمعت مولاى يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من اقتراب الساعة هلاك العرب ‏\"‏ ‏.‏ قال محمد بن أبي رزين ومولاها طلحة بن مالك ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث سليمان بن حرب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "حدثنا محمد بن يحيى الأزدي، قال حدثنا حجاج بن محمد، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول حدثتني أم شريك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليفرن الناس من الدجال حتى يلحقوا بالجبال ‏\"‏ ‏.‏ قالت أم شريك يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم قليل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 3931,
			"arabicnumber": 3931,
			"text": "حدثنا بشر بن معاذ العقدي، - بصري - قال حدثنا يزيد بن زريع، عن سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ سام أبو العرب ويافث أبو الروم وحام أبو الحبش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ويقال يافث ويافت ويفت ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 3932,
			"arabicnumber": 3932,
			"text": "أخبرنا سفيان بن وكيع، قال حدثنا يحيى بن آدم، عن أبي بكر بن عياش، قال حدثنا صالح بن أبي صالح، مولى عمرو بن حريث قال سمعت أبا هريرة، يقول ذكرت الأعاجم عند النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏ \"‏ لأنا بهم أو ببعضهم أوثق مني بكم أو ببعضكم ‏\"‏ ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث أبي بكر بن عياش ‏.‏ وصالح بن أبي صالح هذا يقال له صالح بن مهران مولى عمرو بن حريث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 3933,
			"arabicnumber": 3933,
			"text": "حدثنا علي بن حجر، قال حدثنا عبد الله بن جعفر، قال حدثني ثور بن زيد الديلي، عن أبي الغيث، عن أبي هريرة، قال كنا عند رسول الله صلى الله عليه وسلم حين أنزلت سورة الجمعة فتلاها فلما بلغ ‏:‏ ‏(‏ وآخرين منهم لما يلحقوا بهم ‏)‏ قال له رجل يا رسول الله من هؤلاء الذين لم يلحقوا بنا فلم يكلمه ‏.‏ قال وسلمان الفارسي فينا ‏.‏ قال فوضع رسول الله صلى الله عليه وسلم يده على سلمان فقال ‏\"‏ والذي نفسي بيده لو كان الإيمان بالثريا لتناوله رجال من هؤلاء ‏\"‏ ‏.‏ هذا حديث حسن وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وأبو الغيث اسمه سالم مولى عبد الله بن مطيع مدني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 3934,
			"arabicnumber": 3934,
			"text": "حدثنا عبد الله بن أبي زياد القطواني، وغير، واحد، قالوا حدثنا أبو داود الطيالسي، قال حدثنا عمران القطان، عن قتادة، عن أنس، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم نظر قبل اليمن فقال ‏ \"‏ اللهم أقبل بقلوبهم وبارك لنا في صاعنا ومدنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه من حديث زيد بن ثابت إلا من حديث عمران القطان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 3935,
			"arabicnumber": 3935,
			"text": "حدثنا قتيبة، قال حدثنا عبد العزيز بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أتاكم أهل اليمن هم أضعف قلوبا وأرق أفئدة الإيمان يمان والحكمة يمانية ‏\"‏ ‏.‏ وفي الباب عن ابن عباس وأبي مسعود ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 3936,
			"arabicnumber": 3936,
			"text": "حدثنا أحمد بن منيع، قال حدثنا زيد بن حباب، قال حدثنا معاوية بن صالح، قال حدثنا أبو مريم الأنصاري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الملك في قريش والقضاء في الأنصار والأذان في الحبشة والأمانة في الأزد ‏\"‏ ‏.‏ يعني اليمن ‏.‏ حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن أبي مريم الأنصاري، عن أبي هريرة، نحوه ولم يرفعه ‏.‏ وهذا أصح من حديث زيد بن حباب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 3937,
			"arabicnumber": 3937,
			"text": "حدثنا عبد القدوس بن محمد العطار، قال حدثني عمي، صالح بن عبد الكبير بن شعيب بن الحبحاب قال حدثني عمي عبد السلام بن شعيب، عن أبيه، عن أنس، رضي الله عنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الأزد أسد الله في الأرض يريد الناس أن يضعوهم ويأبى الله إلا أن يرفعهم وليأتين على الناس زمان يقول الرجل يا ليت أبي كان أزديا يا ليت أمي كانت أزدية ‏\"‏ ‏.‏ هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وروي هذا الحديث عن أنس بهذا الإسناد موقوفا وهو عندنا أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 3938,
			"arabicnumber": 3938,
			"text": "حدثنا عبد القدوس بن محمد العطار البصري، حدثنا محمد بن كثير العبدي البصري، حدثنا مهدي بن ميمون، حدثني غيلان بن جرير، قال سمعت أنس بن مالك، يقول إن لم نكن من الأزد فلسنا من الناس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 3939,
			"arabicnumber": 3939,
			"text": "حدثنا أبو بكر بن زنجويه، - بغدادي - قال حدثنا عبد الرزاق، قال أخبرني أبي، عن ميناء، مولى عبد الرحمن بن عوف قال سمعت أبا هريرة، يقول كنا عند النبي صلى الله عليه وسلم فجاء رجل أحسبه من قيس فقال يا رسول الله العن حميرا ‏.‏ فأعرض عنه ثم جاءه من الشق الآخر فأعرض عنه فقال النبي صلى الله عليه وسلم ‏ \"‏ رحم الله حميرا أفواههم سلام وأيديهم طعام وهم أهل أمن وإيمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه من حديث عبد الرزاق ‏.‏ ويروى عن ميناء هذا أحاديث مناكير ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 3940,
			"arabicnumber": 3940,
			"text": "حدثنا أحمد بن منيع، قال حدثنا يزيد بن هارون، قال حدثنا أبو مالك الأشجعي، عن موسى بن طلحة، عن أبي أيوب الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ الأنصار ومزينة وجهينة وغفار وأشجع ومن كان من بني عبد الدار موالي ليس لهم مولى دون الله والله ورسوله مولاهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 3941,
			"arabicnumber": 3941,
			"text": "حدثنا علي بن حجر، قال حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أسلم سالمها الله وغفار غفر الله لها وعصية عصت الله ورسوله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 3942,
			"arabicnumber": 3942,
			"text": "حدثنا أبو سلمة يحيى بن خلف قال حدثنا عبد الوهاب الثقفي، عن عبد الله بن عثمان بن خثيم، عن أبي الزبير، عن جابر، قال قالوا يا رسول الله أخرقتنا نبال ثقيف فادع الله عليهم ‏.‏ قال ‏ \"‏ اللهم اهد ثقيفا ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 3943,
			"arabicnumber": 3943,
			"text": "حدثنا زيد بن أخزم الطائي، قال حدثنا عبد القاهر بن شعيب، قال حدثنا هشام، عن الحسن، عن عمران بن حصين، قال مات النبي صلى الله عليه وسلم وهو يكره ثلاثة أحياء ثقيفا وبني حنيفة وبني أمية ‏.‏ هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 3944,
			"arabicnumber": 3944,
			"text": "حدثنا علي بن حجر، قال أخبرنا الفضل بن موسى، عن شريك، عن عبد الله بن عصم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ في ثقيف كذاب ومبير ‏\"‏ ‏.‏ حدثنا عبد الرحمن بن واقد أبو مسلم، قال حدثنا شريك، بهذا الإسناد نحوه ‏.‏ وعبد الله بن عصم يكنى أبا علوان وهو كوفي ‏.‏ هذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏ وشريك يقول عبد الله بن عصم وإسرائيل يروي عن هذا الشيخ ويقول عبد الله بن عصمة ‏.‏ وفي الباب عن أسماء بنت أبي بكر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 3945,
			"arabicnumber": 3945,
			"text": "حدثنا أحمد بن منيع، قال حدثنا يزيد بن هارون، قال أخبرني أيوب، عن سعيد المقبري، عن أبي هريرة، أن أعرابيا، أهدى لرسول الله صلى الله عليه وسلم بكرة فعوضه منها ست بكرات فتسخطها فبلغ ذلك النبي صلى الله عليه وسلم فحمد الله وأثنى عليه ثم قال ‏ \"‏ إن فلانا أهدى إلى ناقة فعوضته منها ست بكرات فظل ساخطا ولقد هممت أن لا أقبل هدية إلا من قرشي أو أنصاري أو ثقفي أو دوسي ‏\"‏ ‏.‏ وفي الحديث كلام أكثر من هذا ‏.‏ هذا حديث قد روي من غير وجه عن أبي هريرة ويزيد بن هارون يروي عن أيوب أبي العلاء وهو أيوب بن مسكين ويقال ابن أبي مسكين ولعل هذا الحديث الذي روي عن أيوب عن سعيد المقبري هو أيوب أبو العلاء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 3946,
			"arabicnumber": 3946,
			"text": "حدثنا محمد بن إسماعيل، قال حدثنا أحمد بن خالد الحمصي، قال حدثنا محمد ابن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، قال أهدى رجل من بني فزارة إلى النبي صلى الله عليه وسلم ناقة من إبله التي كانوا أصابوا بالغابة فعوضه منها بعض العوض فتسخطه فسمعت رسول الله صلى الله عليه وسلم على هذا المنبر يقول ‏ \"‏ إن رجالا من العرب يهدي أحدهم الهدية فأعوضه منها بقدر ما عندي ثم يتسخطه فيظل يتسخط فيه على وايم الله لا أقبل بعد مقامي هذا من رجل من العرب هدية إلا من قرشي أو أنصاري أو ثقفي أو دوسي ‏\"‏ ‏.‏ هذا حديث حسن وهو أصح من حديث يزيد بن هارون عن أيوب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 3947,
			"arabicnumber": 3947,
			"text": "حدثنا إبراهيم بن يعقوب، وغير، واحد، قالوا حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت عبد الله بن ملاذ، يحدث عن نمير بن أوس، عن مالك بن مسروح، عن عامر بن أبي عامر الأشعري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم الحى الأسد والأشعرون لا يفرون في القتال ولا يغلون هم مني وأنا منهم ‏\"‏ ‏.‏ قال فحدثت بذلك معاوية فقال ليس هكذا قال رسول الله قال ‏\"‏ هم مني وإلى ‏\"‏ ‏.‏ فقلت ليس هكذا حدثني أبي ولكنه حدثني قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هم مني وأنا منهم ‏\"‏ ‏.‏ قال فأنت أعلم بحديث أبيك ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث وهب بن جرير ‏.‏ ويقال الأسد هم الأزد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 3948,
			"arabicnumber": 3948,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا شعبة، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي ذر وأبي برزة الأسلمي وبريدة وأبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 3949,
			"arabicnumber": 3949,
			"text": "حدثنا محمد بن بشار، قال حدثنا مؤمل، قال حدثنا سفيان، عن عبد الله بن دينار، نحو حديث شعبة وزاد فيه ‏ \"‏ وعصية عصت الله ورسوله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 3950,
			"arabicnumber": 3950,
			"text": "حدثنا قتيبة، قال حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ والذي نفس محمد بيده لغفار وأسلم ومزينة ومن كان من جهينة أو قال جهينة ومن كان من مزينة خير عند الله يوم القيامة من أسد وطيء وغطفان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 3951,
			"arabicnumber": 3951,
			"text": "حدثنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا سفيان، عن جامع بن شداد، عن صفوان بن محرز، عن عمران بن حصين، قال جاء نفر من بني تميم إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أبشروا يا بني تميم ‏\"‏ ‏.‏ قالوا بشرتنا فأعطنا ‏.‏ قال فتغير وجه رسول الله صلى الله عليه وسلم وجاء نفر من أهل اليمن فقال ‏\"‏ أقبلوا البشرى فلم يقبلها بنو تميم ‏\"‏ ‏.‏ قالوا قد قبلنا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "حدثنا محمود بن غيلان، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن عبد الملك ابن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم وغفار ومزينة خير من تميم وأسد وغطفان وبني عامر بن صعصعة ‏\"‏ ‏.‏ يمد بها صوته فقال القوم قد خابوا وخسروا ‏.‏ قال ‏\"‏ فهم خير منهم ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 3953,
			"arabicnumber": 3953,
			"text": "حدثنا بشر بن آدم ابن بنت أزهر السمان، قال حدثني جدي، أزهر السمان عن ابن عون، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لنا في شامنا اللهم بارك لنا في يمننا ‏\"‏ ‏.‏ قالوا وفي نجدنا ‏.‏ فقال ‏\"‏ اللهم بارك لنا في شامنا وبارك لنا في يمننا ‏\"‏ ‏.‏ قالوا وفي نجدنا ‏.‏ قال ‏\"‏ هنالك الزلازل والفتن وبها أو قال منها يخرج قرن الشيطان ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب من هذا الوجه من حديث ابن عون ‏.‏ وقد روي هذا الحديث أيضا عن سالم بن عبد الله بن عمر عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 3954,
			"arabicnumber": 3954,
			"text": "حدثنا محمد بن بشار، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عبد الرحمن بن شماسة، عن زيد بن ثابت، قال كنا عند رسول الله صلى الله عليه وسلم نؤلف القرآن من الرقاع فقال رسول الله صلى الله عليه وسلم ‏\"‏ طوبى للشأم ‏\"‏ ‏.‏ فقلنا لأى ذلك يا رسول الله قال ‏\"‏ لأن ملائكة الرحمن باسطة أجنحتها عليها ‏\"‏ ‏.‏ هذا حديث حسن غريب إنما نعرفه من حديث يحيى بن أيوب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 3955,
			"arabicnumber": 3955,
			"text": "حدثنا محمد بن بشار، قال حدثنا أبو عامر العقدي، قال حدثنا هشام بن سعد، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لينتهين أقوام يفتخرون بآبائهم الذين ماتوا إنما هم فحم جهنم أو ليكونن أهون على الله من الجعل الذي يدهده الخراء بأنفه إن الله قد أذهب عنكم عبية الجاهلية إنما هو مؤمن تقي وفاجر شقي الناس كلهم بنو آدم وآدم خلق من تراب ‏\"‏ ‏.‏ وفي الباب عن ابن عمر وابن عباس ‏.‏وهذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 3956,
			"arabicnumber": 3956,
			"text": "حدثنا هارون بن موسى بن أبي علقمة الفروي المدني، قال حدثني أبي، عن هشام بن سعد، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قد أذهب الله عنكم عبية الجاهلية وفخرها بالآباء مؤمن تقي وفاجر شقي والناس بنو آدم وآدم من تراب ‏\"‏ ‏. هذا حديث حسن صحيح ‏.‏‏ وهذا أصح عندنا من الحديث الأول ‏.‏ وسعيد المقبري قد سمع من أبي هريرة ويروي عن أبيه أشياء كثيرة عن أبي هريرة رضى الله عنه ‏.‏ وقد روى سفيان الثوري وغير واحد هذا الحديث عن هشام ابن سعد عن سعيد المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم نحو حديث أبي عامر عن هشام بن سعد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 49,
				"hadith": 356
			}
		}
	]
}