{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"6": "The Book on Traveling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "حدثنا عبد الوهاب بن عبد الحكم الوراق البغدادي، حدثنا يحيى بن سليم، عن عبيد الله، عن نافع، عن ابن عمر، قال سافرت مع النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان فكانوا يصلون الظهر والعصر ركعتين ركعتين لا يصلون قبلها ولا بعدها ‏.‏ وقال عبد الله لو كنت مصليا قبلها أو بعدها لأتممتها ‏.‏ قال وفي الباب عن عمر وعلي وابن عباس وأنس وعمران بن حصين وعائشة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن غريب لا نعرفه إلا من حديث يحيى بن سليم مثل هذا ‏.‏ قال محمد بن إسماعيل وقد روي هذا الحديث عن عبيد الله بن عمر عن رجل من آل سراقة عن عبد الله بن عمر ‏.‏ قال أبو عيسى وقد روي عن عطية العوفي عن ابن عمر أن النبي صلى الله عليه وسلم كان يتطوع في السفر قبل الصلاة وبعدها ‏.‏ وقد صح عن النبي صلى الله عليه وسلم أنه كان يقصر في السفر وأبو بكر وعمر وعثمان صدرا من خلافته ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏ وقد روي عن عائشة أنها كانت تتم الصلاة في السفر ‏.‏ والعمل على ما روي عن النبي صلى الله عليه وسلم وأصحابه وهو قول الشافعي وأحمد وإسحاق إلا أن الشافعي يقول التقصير رخصة له في السفر فإن أتم الصلاة أجزأ عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا علي بن زيد بن جدعان القرشي، عن أبي نضرة، قال سئل عمران بن حصين عن صلاة المسافر، فقال حججت مع رسول الله صلى الله عليه وسلم فصلى ركعتين وحججت مع أبي بكر فصلى ركعتين ومع عمر فصلى ركعتين ومع عثمان ست سنين من خلافته أو ثماني سنين فصلى ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن محمد بن المنكدر، وإبراهيم بن ميسرة، سمعا أنس بن مالك، قال صلينا مع النبي صلى الله عليه وسلم الظهر بالمدينة أربعا وبذي الحليفة العصر ركعتين ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "حدثنا قتيبة، حدثنا هشيم، عن منصور بن زاذان، عن ابن سيرين، عن ابن عباس، أن النبي صلى الله عليه وسلم خرج من المدينة إلى مكة لا يخاف إلا الله رب العالمين فصلى ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا يحيى بن أبي إسحاق الحضرمي، حدثنا أنس بن مالك، قال خرجنا مع النبي صلى الله عليه وسلم من المدينة إلى مكة فصلى ركعتين ‏.‏ قال قلت لأنس كم أقام رسول الله صلى الله عليه وسلم بمكة قال عشرا ‏.‏ قال وفي الباب عن ابن عباس وجابر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ وقد روي عن ابن عباس عن النبي صلى الله عليه وسلم أنه أقام في بعض أسفاره تسع عشرة يصلي ركعتين ‏.‏ قال ابن عباس فنحن إذا أقمنا ما بيننا وبين تسع عشرة صلينا ركعتين وإن زدنا على ذلك أتممنا الصلاة ‏.‏ وروي عن علي أنه قال من أقام عشرة أيام أتم الصلاة ‏.‏ وروي عن ابن عمر أنه قال من أقام خمسة عشر يوما أتم الصلاة ‏.‏ وقد روي عنه ثنتى عشرة ‏.‏ وروي عن سعيد بن المسيب أنه قال إذا أقام أربعا صلى أربعا ‏.‏ وروى عنه ذلك قتادة وعطاء الخراساني ‏.‏ وروى عنه داود بن أبي هند خلاف هذا ‏.‏ واختلف أهل العلم بعد في ذلك فأما سفيان الثوري وأهل الكوفة فذهبوا إلى توقيت خمس عشرة وقالوا إذا أجمع على إقامة خمس عشرة أتم الصلاة ‏.‏ وقال الأوزاعي إذا أجمع على إقامة ثنتى عشرة أتم الصلاة ‏.‏ وقال مالك بن أنس والشافعي وأحمد إذا أجمع على إقامة أربعة أتم الصلاة ‏.‏ وأما إسحاق فرأى أقوى المذاهب فيه حديث ابن عباس قال لأنه روى عن النبي صلى الله عليه وسلم ثم تأوله بعد النبي صلى الله عليه وسلم إذا أجمع على إقامة تسع عشرة أتم الصلاة ‏.‏ ثم أجمع أهل العلم على أن المسافر يقصر ما لم يجمع إقامة وإن أتى عليه سنون ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "حدثنا هناد بن السري، حدثنا أبو معاوية، عن عاصم الأحول، عن عكرمة، عن ابن عباس، قال سافر رسول الله صلى الله عليه وسلم سفرا فصلى تسعة عشر يوما ركعتين ركعتين ‏.‏ قال ابن عباس فنحن نصلي فيما بيننا وبين تسع عشرة ركعتين ركعتين فإذا أقمنا أكثر من ذلك صلينا أربعا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن صفوان بن سليم، عن أبي بسرة الغفاري، عن البراء بن عازب، قال صحبت رسول الله صلى الله عليه وسلم ثمانية عشر سفرا فما رأيته ترك الركعتين إذا زاغت الشمس قبل الظهر ‏.‏ وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث البراء حديث غريب ‏.‏ قال وسألت محمدا عنه فلم يعرفه إلا من حديث الليث بن سعد ولم يعرف اسم أبي بسرة الغفاري ورآه حسنا ‏.‏ وروي عن ابن عمر أن النبي صلى الله عليه وسلم كان لا يتطوع في السفر قبل الصلاة ولا بعدها ‏.‏ وروي عنه عن النبي صلى الله عليه وسلم أنه كان يتطوع في السفر ‏.‏ ثم اختلف أهل العلم بعد النبي صلى الله عليه وسلم فرأى بعض أصحاب النبي صلى الله عليه وسلم أن يتطوع الرجل في السفر وبه يقول أحمد وإسحاق ‏.‏ ولم تر طائفة من أهل العلم أن يصلى قبلها ولا بعدها ‏.‏ ومعنى من لم يتطوع في السفر قبول الرخصة ومن تطوع فله في ذلك فضل كثير ‏.‏ وهو قول أكثر أهل العلم يختارون التطوع في السفر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "حدثنا علي بن حجر، حدثنا حفص بن غياث، عن الحجاج، عن عطية، عن ابن عمر، قال صليت مع النبي صلى الله عليه وسلم الظهر في السفر ركعتين وبعدها ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه ابن أبي ليلى عن عطية ونافع عن ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "حدثنا محمد بن عبيد المحاربي، - يعني الكوفي حدثنا علي بن هاشم، عن ابن أبي ليلى، عن عطية، ونافع، عن ابن عمر، قال صليت مع النبي صلى الله عليه وسلم في الحضر والسفر فصليت معه في الحضر الظهر أربعا وبعدها ركعتين وصليت معه في السفر الظهر ركعتين وبعدها ركعتين والعصر ركعتين ولم يصل بعدها شيئا والمغرب في الحضر والسفر سواء ثلاث ركعات لا تنقص في الحضر ولا في السفر وهي وتر النهار وبعدها ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ سمعت محمدا يقول ما روى ابن أبي ليلى حديثا أعجب إلى من هذا ولا أروي عنه شيئا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "حدثنا قتيبة بن سعيد، حدثنا الليث بن سعد، عن يزيد بن أبي حبيب، عن أبي الطفيل، هو عامر بن واثلة عن معاذ بن جبل، أن النبي صلى الله عليه وسلم كان في غزوة تبوك إذا ارتحل قبل زيغ الشمس أخر الظهر إلى أن يجمعها إلى العصر فيصليهما جميعا وإذا ارتحل بعد زيغ الشمس عجل العصر إلى الظهر وصلى الظهر والعصر جميعا ثم سار وكان إذا ارتحل قبل المغرب أخر المغرب حتى يصليها مع العشاء وإذا ارتحل بعد المغرب عجل العشاء فصلاها مع المغرب ‏.‏ قال وفي الباب عن علي وابن عمر وأنس وعبد الله بن عمرو وعائشة وابن عباس وأسامة بن زيد وجابر بن عبد الله ‏.‏ قال أبو عيسى والصحيح عن أسامة ‏.‏ وروى علي بن المديني عن أحمد بن حنبل عن قتيبة هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "حدثنا عبد الصمد بن سليمان، حدثنا زكريا اللؤلؤي، حدثنا أبو بكر الأعين، حدثنا علي بن المديني، حدثنا أحمد بن حنبل، حدثنا قتيبة، بهذا الحديث يعني حديث معاذ ‏.‏ وحديث معاذ حديث حسن غريب تفرد به قتيبة لا نعرف أحدا رواه عن الليث غيره ‏.‏ وحديث الليث عن يزيد بن أبي حبيب عن أبي الطفيل عن معاذ حديث غريب ‏.‏ والمعروف عند أهل العلم حديث معاذ من حديث أبي الزبير عن أبي الطفيل عن معاذ أن النبي صلى الله عليه وسلم جمع في غزوة تبوك بين الظهر والعصر وبين المغرب والعشاء ‏.‏ رواه قرة بن خالد وسفيان الثوري ومالك وغير واحد عن أبي الزبير المكي ‏.‏ وبهذا الحديث يقول الشافعي ‏.‏ وأحمد وإسحاق يقولان لا بأس أن يجمع بين الصلاتين في السفر في وقت إحداهما ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "حدثنا هناد بن السري، حدثنا عبدة بن سليمان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أنه استغيث على بعض أهله فجد به السير فأخر المغرب حتى غاب الشفق ثم نزل فجمع بينهما ثم أخبرهم أن رسول الله صلى الله عليه وسلم كان يفعل ذلك إذا جد به السير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وحديث الليث عن يزيد بن أبي حبيب حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عباد بن تميم، عن عمه، أن رسول الله صلى الله عليه وسلم خرج بالناس يستسقي فصلى بهم ركعتين جهر بالقراءة فيهما وحول رداءه ورفع يديه واستسقى واستقبل القبلة ‏.‏ قال وفي الباب عن ابن عباس وأبي هريرة وأنس وآبي اللحم ‏.‏ قال أبو عيسى حديث عبد الله بن زيد حديث حسن صحيح ‏.‏ وعلى هذا العمل عند أهل العلم وبه يقول الشافعي وأحمد وإسحاق ‏.‏ وعم عباد بن تميم هو عبد الله بن زيد بن عاصم المازني ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "حدثنا قتيبة، حدثنا الليث بن سعد، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن يزيد بن عبد الله، عن عمير، مولى آبي اللحم عن آبي اللحم، أنه رأى رسول الله صلى الله عليه وسلم عند أحجار الزيت يستسقي وهو مقنع بكفيه يدعو ‏.‏ قال أبو عيسى كذا قال قتيبة في هذا الحديث عن آبي اللحم ولا نعرف له عن النبي صلى الله عليه وسلم إلا هذا الحديث الواحد وعمير مولى آبي اللحم قد روى عن النبي صلى الله عليه وسلم أحاديث وله صحبة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن هشام بن إسحاق، وهو ابن عبد الله بن كنانة عن أبيه، قال أرسلني الوليد بن عقبة وهو أمير المدينة إلى ابن عباس أسأله عن استسقاء، رسول الله صلى الله عليه وسلم فأتيته فقال إن رسول الله صلى الله عليه وسلم خرج متبذلا متواضعا متضرعا حتى أتى المصلى فلم يخطب خطبتكم هذه ولكن لم يزل في الدعاء والتضرع والتكبير وصلى ركعتين كما كان يصلي في العيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن هشام بن إسحاق بن عبد الله بن كنانة، عن أبيه، فذكر نحوه وزاد فيه متخشعا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول الشافعي قال يصلي صلاة الاستسقاء نحو صلاة العيدين يكبر في الركعة الأولى سبعا وفي الثانية خمسا واحتج بحديث ابن عباس ‏.‏ قال أبو عيسى وروي عن مالك بن أنس أنه قال لا يكبر في صلاة الاستسقاء كما يكبر في صلاة العيدين ‏.‏ وقال النعمان أبو حنيفة لا تصلى صلاة الاستسقاء ولا آمرهم بتحويل الرداء ولكن يدعون ويرجعون بجملتهم ‏.‏ قال أبو عيسى خالف السنة ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن سفيان، عن حبيب بن أبي ثابت، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه صلى في كسوف فقرأ ثم ركع ثم قرأ ثم ركع ثم قرأ ثم ركع ثلاث مرات ثم سجد سجدتين والأخرى مثلها ‏.‏ قال وفي الباب عن علي وعائشة وعبد الله بن عمرو والنعمان بن بشير والمغيرة بن شعبة وأبي مسعود وأبي بكرة وسمرة وأبي موسى الأشعري وابن مسعود وأسماء بنت أبي بكر الصديق وابن عمر وقبيصة الهلالي وجابر بن عبد الله وعبد الرحمن بن سمرة وأبى بن كعب ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد روي عن ابن عباس عن النبي صلى الله عليه وسلم أنه صلى في كسوف أربع ركعات في أربع سجدات ‏.‏ وبه يقول الشافعي وأحمد وإسحاق ‏.‏ قال واختلف أهل العلم في القراءة في صلاة الكسوف فرأى بعض أهل العلم أن يسر بالقراءة فيها بالنهار ‏.‏ ورأى بعضهم أن يجهر بالقراءة فيها كنحو صلاة العيدين والجمعة وبه يقول مالك وأحمد وإسحاق يرون الجهر فيها ‏.‏ وقال الشافعي لا يجهر فيها ‏.‏ وقد صح عن النبي صلى الله عليه وسلم كلتا الروايتين صح عنه أنه صلى أربع ركعات في أربع سجدات ‏.‏ وصح عنه أيضا أنه صلى ست ركعات في أربع سجدات ‏.‏ وهذا عند أهل العلم جائز على قدر الكسوف إن تطاول الكسوف فصلى ست ركعات في أربع سجدات فهو جائز وإن صلى أربع ركعات في أربع سجدات وأطال القراءة فهو جائز ‏.‏ ويرون أصحابنا أن تصلى صلاة الكسوف في جماعة في كسوف الشمس والقمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن عروة، عن عائشة، أنها قالت خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم بالناس فأطال القراءة ثم ركع فأطال الركوع ثم رفع رأسه فأطال القراءة وهي دون الأولى ثم ركع فأطال الركوع وهو دون الأول ثم رفع رأسه فسجد ثم فعل مثل ذلك في الركعة الثانية ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وبهذا الحديث يقول الشافعي وأحمد وإسحاق يرون صلاة الكسوف أربع ركعات في أربع سجدات ‏.‏ قال الشافعي يقرأ في الركعة الأولى بأم القرآن ونحوا من سورة البقرة سرا إن كان بالنهار ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع رأسه بتكبير وثبت قائما كما هو وقرأ أيضا بأم القرآن ونحوا من آل عمران ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع رأسه ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم سجد سجدتين تامتين ويقيم في كل سجدة نحوا مما أقام في ركوعه ثم قام فقرأ بأم القرآن ونحوا من سورة النساء ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع رأسه بتكبير وثبت قائما ثم قرأ نحوا من سورة المائدة ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم سجد سجدتين ثم تشهد وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن الأسود بن قيس، عن ثعلبة بن عباد، عن سمرة بن جندب، قال صلى بنا النبي صلى الله عليه وسلم في كسوف لا نسمع له صوتا ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث سمرة حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وهو قول الشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "حدثنا أبو بكر، محمد بن أبان حدثنا إبراهيم بن صدقة، عن سفيان بن حسين، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم صلى صلاة الكسوف وجهر بالقراءة فيها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه أبو إسحاق الفزاري عن سفيان بن حسين نحوه ‏.‏ وبهذا الحديث يقول مالك بن أنس وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن سالم، عن أبيه، أن النبي صلى الله عليه وسلم صلى صلاة الخوف بإحدى الطائفتين ركعة والطائفة الأخرى مواجهة العدو ثم انصرفوا فقاموا في مقام أولئك وجاء أولئك فصلى بهم ركعة أخرى ثم سلم عليهم فقام هؤلاء فقضوا ركعتهم وقام هؤلاء فقضوا ركعتهم ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وقد روى موسى بن عقبة عن نافع عن ابن عمر مثل هذا ‏.‏ قال وفي الباب عن جابر وحذيفة وزيد بن ثابت وابن عباس وأبي هريرة وابن مسعود وسهل بن أبي حثمة وأبي عياش الزرقي واسمه زيد بن صامت وأبي بكرة ‏.‏ قال أبو عيسى وقد ذهب مالك بن أنس في صلاة الخوف إلى حديث سهل بن أبي حثمة وهو قول الشافعي ‏.‏ وقال أحمد قد روي عن النبي صلى الله عليه وسلم صلاة الخوف على أوجه وما أعلم في هذا الباب إلا حديثا صحيحا وأختار حديث سهل بن أبي حثمة ‏.‏ وهكذا قال إسحاق بن إبراهيم قال ثبتت الروايات عن النبي صلى الله عليه وسلم في صلاة الخوف ‏.‏ ورأى أن كل ما روي عن النبي صلى الله عليه وسلم في صلاة الخوف فهو جائز وهذا على قدر الخوف ‏.‏ قال إسحاق ولسنا نختار حديث سهل بن أبي حثمة على غيره من الروايات ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، حدثنا يحيى بن سعيد الأنصاري، عن القاسم بن محمد، عن صالح بن خوات بن جبير، عن سهل بن أبي حثمة، أنه قال في صلاة الخوف قال يقوم الإمام مستقبل القبلة وتقوم طائفة منهم معه وطائفة من قبل العدو ووجوهم إلى العدو فيركع بهم ركعة ويركعون لأنفسهم ركعة ويسجدون لأنفسهم سجدتين في مكانهم ثم يذهبون إلى مقام أولئك ويجيء أولئك فيركع بهم ركعة ويسجد بهم سجدتين فهي له ثنتان ولهم واحدة ثم يركعون ركعة ويسجدون سجدتين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "قال أبو عيسى قال محمد بن بشار سألت يحيى بن سعيد عن هذا الحديث، فحدثني عن شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن صالح بن خوات، عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم بمثل حديث يحيى بن سعيد الأنصاري ‏.‏ وقال لي يحيى اكتبه إلى جنبه ولست أحفظ الحديث ولكنه مثل حديث يحيى بن سعيد الأنصاري ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ لم يرفعه يحيى بن سعيد الأنصاري عن القاسم بن محمد وهكذا روى أصحاب يحيى بن سعيد الأنصاري موقوفا ورفعه شعبة عن عبد الرحمن بن القاسم بن محمد ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "وروى مالك بن أنس، عن يزيد بن رومان، عن صالح بن خوات، عمن صلى مع النبي صلى الله عليه وسلم صلاة الخوف فذكر نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وبه يقول مالك والشافعي وأحمد وإسحاق ‏.‏ وروي عن غير واحد أن النبي صلى الله عليه وسلم صلى بإحدى الطائفتين ركعة ركعة فكانت للنبي صلى الله عليه وسلم ركعتان ولهم ركعة ركعة ‏.‏ قال أبو عيسى أبو عياش الزرقي اسمه زيد بن صامت ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "حدثنا سفيان بن وكيع، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن سعيد بن أبي هلال، عن عمر الدمشقي، عن أم الدرداء، عن أبي الدرداء، قال سجدت مع رسول الله صلى الله عليه وسلم إحدى عشرة سجدة منها التي في النجم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبد الله بن صالح، حدثنا الليث بن سعد، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن عمر، وهو ابن حيان الدمشقي قال سمعت مخبرا، يخبر عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم نحوه بلفظه ‏.‏ قال أبو عيسى وهذا أصح من حديث سفيان بن وكيع عن عبد الله بن وهب ‏.‏ قال وفي الباب عن علي وابن عباس وأبي هريرة وابن مسعود وزيد بن ثابت وعمرو بن العاص ‏.‏ قال أبو عيسى حديث أبي الدرداء حديث غريب لا نعرفه إلا من حديث سعيد بن أبي هلال عن عمر الدمشقي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": 570,
			"text": "حدثنا نصر بن علي، حدثنا عيسى بن يونس، عن الأعمش، عن مجاهد، قال كنا عند ابن عمر فقال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ايذنوا للنساء بالليل إلى المساجد ‏\"‏ ‏.‏ فقال ابنه والله لا نأذن لهن يتخذنه دغلا ‏.‏ فقال فعل الله بك وفعل أقول قال رسول الله صلى الله عليه وسلم وتقول لا نأذن لهن ‏.‏ قال وفي الباب عن أبي هريرة وزينب امرأة عبد الله بن مسعود وزيد بن خالد ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن سفيان، عن منصور، عن ربعي بن حراش، عن طارق بن عبد الله المحاربي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا كنت في الصلاة فلا تبزق عن يمينك ولكن خلفك أو تلقاء شمالك أو تحت قدمك اليسرى ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وابن عمر وأنس وأبي هريرة ‏.‏ قال أبو عيسى وحديث طارق حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قال وسمعت الجارود يقول سمعت وكيعا يقول لم يكذب ربعي بن حراش في الإسلام كذبة ‏.‏ قال وقال عبد الرحمن بن مهدي أثبت أهل الكوفة منصور بن المعتمر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ البزاق في المسجد خطيئة وكفارتها دفنها ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "حدثنا قتيبة بن سعيد، حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن عطاء بن ميناء، عن أبي هريرة، قال سجدنا مع رسول الله صلى الله عليه وسلم في ‏(‏اقرأ باسم ربك الذي خلق ‏)‏ و ‏(‏إذا السماء انشقت ‏)‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن أبي بكر بن محمد، هو ابن عمرو بن حزم عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم يرون السجود في‏(‏إذا السماء انشقت ‏)‏ و ‏(‏اقرأ باسم ربك ‏)‏ ‏.‏ وفي هذا الحديث أربعة من التابعين بعضهم عن بعض ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "حدثنا هارون بن عبد الله البزاز البغدادي، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، عن أيوب، عن عكرمة، عن ابن عباس، قال سجد رسول الله صلى الله عليه وسلم فيها - يعني النجم - والمسلمون والمشركون والجن والإنس ‏.‏ قال وفي الباب عن ابن مسعود وأبي هريرة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم يرون السجود في سورة النجم ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ليس في المفصل سجدة ‏.‏ وهو قول مالك بن أنس ‏.‏ والقول الأول أصح وبه يقول الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وفي الباب عن ابن مسعود وأبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "حدثنا يحيى بن موسى، حدثنا وكيع، عن ابن أبي ذئب، عن يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على رسول الله صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏ قال أبو عيسى حديث زيد بن ثابت حديث حسن صحيح ‏.‏ وتأول بعض أهل العلم هذا الحديث فقال إنما ترك النبي صلى الله عليه وسلم السجود لأن زيد بن ثابت حين قرأ فلم يسجد لم يسجد النبي صلى الله عليه وسلم ‏.‏ وقالوا السجدة واجبة على من سمعها فلم يرخصوا في تركها ‏.‏ وقالوا إن سمع الرجل وهو على غير وضوء فإذا توضأ سجد ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يقول إسحاق ‏.‏ وقال بعض أهل العلم إنما السجدة على من أراد أن يسجد فيها والتمس فضلها ورخصوا في تركها إن أراد ذلك ‏.‏ واحتجوا بالحديث المرفوع حديث زيد بن ثابت حيث قال قرأت على النبي صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏ فقالوا لو كانت السجدة واجبة لم يترك النبي صلى الله عليه وسلم زيدا حتى كان يسجد ويسجد النبي صلى الله عليه وسلم ‏.‏ واحتجوا بحديث عمر أنه قرأ سجدة على المنبر فنزل فسجد ثم قرأها في الجمعة الثانية فتهيأ الناس للسجود فقال إنها لم تكتب علينا إلا أن نشاء ‏.‏ فلم يسجد ولم يسجدوا ‏.‏ فذهب بعض أهل العلم إلى هذا ‏.‏ وهو قول الشافعي وأحمد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أيوب، عن عكرمة، عن ابن عباس، قال رأيت رسول الله صلى الله عليه وسلم يسجد في ص ‏.‏ قال ابن عباس وليست من عزائم السجود ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ واختلف أهل العلم في ذلك فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن يسجد فيها ‏.‏ وهو قول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقال بعضهم إنها توبة نبي ولم يروا السجود فيها ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن مشرح بن هاعان، عن عقبة بن عامر، قال قلت يا رسول الله فضلت سورة الحج بأن فيها سجدتين قال ‏ \"‏ نعم ومن لم يسجدهما فلا يقرأهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بذاك القوي ‏.‏ واختلف أهل العلم في هذا فروي عن عمر بن الخطاب وابن عمر أنهما قالا فضلت سورة الحج بأن فيها سجدتين ‏.‏ وبه يقول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏ ورأى بعضهم فيها سجدة وهو قول سفيان الثوري ومالك وأهل الكوفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "حدثنا قتيبة، حدثنا محمد بن يزيد بن خنيس، حدثنا الحسن بن محمد بن عبيد الله بن أبي يزيد، قال قال لي ابن جريج يا حسن أخبرني عبيد الله بن أبي يزيد، عن ابن عباس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني رأيتني الليلة وأنا نائم كأني أصلي خلف شجرة فسجدت فسجدت الشجرة لسجودي فسمعتها وهي تقول اللهم اكتب لي بها عندك أجرا وضع عني بها وزرا واجعلها لي عندك ذخرا وتقبلها مني كما تقبلتها من عبدك داود ‏.‏ قال الحسن قال لي ابن جريج قال لي جدك قال ابن عباس فقرأ النبي صلى الله عليه وسلم سجدة ثم سجد ‏.‏ قال فقال ابن عباس فسمعته وهو يقول مثل ما أخبره الرجل عن قول الشجرة ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عباس لا نعرفه إلا من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، حدثنا خالد الحذاء، عن أبي العالية، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقول في سجود القرآن بالليل ‏ \"‏ سجد وجهي للذي خلقه وشق سمعه وبصره بحوله وقوته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "حدثنا قتيبة، حدثنا أبو صفوان، عن يونس بن يزيد، عن ابن شهاب الزهري، أن السائب بن يزيد، وعبيد الله بن عبد الله بن عتبة بن مسعود، أخبراه عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ من نام عن حزبه أو عن شيء منه فقرأه ما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وأبو صفوان اسمه عبد الله بن سعيد المكي وروى عنه الحميدي وكبار الناس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": 582,
			"text": "حدثنا قتيبة، حدثنا حماد بن زيد، عن محمد بن زياد، وهو أبو الحارث البصري ثقة عن أبي هريرة، قال قال محمد صلى الله عليه وسلم ‏\"‏ أما يخشى الذي يرفع رأسه قبل الإمام أن يحول الله رأسه رأس حمار ‏\"‏ ‏.‏ قال قتيبة قال حماد قال لي محمد بن زياد وإنما قال ‏\"‏ أما يخشى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومحمد بن زياد هو بصري ثقة ويكنى أبا الحارث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"text": "حدثنا قتيبة، حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، أن معاذ بن جبل، كان يصلي مع رسول الله صلى الله عليه وسلم المغرب ثم يرجع إلى قومه فيؤمهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أصحابنا الشافعي وأحمد وإسحاق قالوا إذا أم الرجل القوم في المكتوبة وقد كان صلاها قبل ذلك أن صلاة من ائتم به جائزة ‏.‏ واحتجوا بحديث جابر في قصة معاذ وهو حديث صحيح وقد روي من غير وجه عن جابر ‏.‏ وروي عن أبي الدرداء أنه سئل عن رجل دخل المسجد والقوم في صلاة العصر وهو يحسب أنها صلاة الظهر فائتم بهم قال صلاته جائزة ‏.‏ وقد قال قوم من أهل الكوفة إذا ائتم قوم بإمام وهو يصلي العصر وهم يحسبون أنها الظهر فصلى بهم واقتدوا به فإن صلاة المقتدي فاسدة إذ اختلف نية الإمام ونية المأموم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"text": "حدثنا أحمد بن محمد، حدثنا عبد الله بن المبارك، أخبرنا خالد بن عبد الرحمن، قال حدثني غالب القطان، عن بكر بن عبد الله المزني، عن أنس بن مالك، قال كنا إذا صلينا خلف النبي صلى الله عليه وسلم بالظهائر سجدنا على ثيابنا اتقاء الحر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن جابر بن عبد الله وابن عباس ‏.‏ وقد روى وكيع هذا الحديث عن خالد بن عبد الرحمن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم إذا صلى الفجر قعد في مصلاه حتى تطلع الشمس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "حدثنا عبد الله بن معاوية الجمحي البصري، حدثنا عبد العزيز بن مسلم، حدثنا أبو ظلال، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى الغداة في جماعة ثم قعد يذكر الله حتى تطلع الشمس ثم صلى ركعتين كانت له كأجر حجة وعمرة ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تامة تامة تامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال وسألت محمد بن إسماعيل عن أبي ظلال فقال هو مقارب الحديث ‏.‏ قال محمد واسمه هلال ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "حدثنا محمود بن غيلان، وغير، واحد، قالوا حدثنا الفضل بن موسى، عن عبد الله بن سعيد بن أبي هند، عن ثور بن زيد، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يلحظ في الصلاة يمينا وشمالا ولا يلوي عنقه خلف ظهره ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد خالف وكيع الفضل بن موسى في روايته ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، عن عبد الله بن سعيد بن أبي هند، عن بعض، أصحاب عكرمة أن النبي صلى الله عليه وسلم كان يلحظ في الصلاة ‏.‏ فذكر نحوه ‏.‏ قال وفي الباب عن أنس وعائشة ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "حدثنا أبو حاتم، مسلم بن حاتم البصري حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ يا بنى إياك والالتفات في الصلاة فإن الالتفات في الصلاة هلكة فإن كان لا بد ففي التطوع لا في الفريضة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "حدثنا صالح بن عبد الله، حدثنا أبو الأحوص، عن أشعث بن أبي الشعثاء، عن أبيه، عن مسروق، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الالتفات في الصلاة قال ‏ \"‏ هو اختلاس يختلسه الشيطان من صلاة الرجل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"text": "حدثنا هشام بن يونس الكوفي، حدثنا المحاربي، عن الحجاج بن أرطاة، عن أبي إسحاق، عن هبيرة بن يريم، عن علي، وعن عمرو بن مرة، عن ابن أبي ليلى، عن معاذ بن جبل، قالا قال النبي صلى الله عليه وسلم ‏ \"‏ إذا أتى أحدكم الصلاة والإمام على حال فليصنع كما يصنع الإمام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعلم أحدا أسنده إلا ما روي من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قالوا إذا جاء الرجل والإمام ساجد فليسجد ولا تجزئه تلك الركعة إذا فاته الركوع مع الإمام واختار عبد الله بن المبارك أن يسجد مع الإمام وذكر عن بعضهم فقال لعله لا يرفع رأسه في تلك السجدة حتى يغفر له ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، أخبرنا معمر، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني خرجت ‏\"‏ ‏.‏ قال وفي الباب عن أنس وحديث أنس غير محفوظ ‏.‏ قال أبو عيسى حديث أبي قتادة حديث حسن صحيح ‏.‏ وقد كره قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن ينتظر الناس الإمام وهم قيام ‏.‏ وقال بعضهم إذا كان الإمام في المسجد فأقيمت الصلاة فإنما يقومون إذا قال المؤذن قد قامت الصلاة قد قامت الصلاة ‏.‏ وهو قول ابن المبارك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "حدثنا محمود بن غيلان، حدثنا يحيى بن آدم، حدثنا أبو بكر بن عياش، عن عاصم، عن زر، عن عبد الله، قال كنت أصلي والنبي صلى الله عليه وسلم وأبو بكر وعمر معه فلما جلست بدأت بالثناء على الله ثم الصلاة على النبي صلى الله عليه وسلم ثم دعوت لنفسي فقال النبي صلى الله عليه وسلم ‏ \"‏ سل تعطه سل تعطه ‏\"‏ ‏.‏ قال وفي الباب عن فضالة بن عبيد ‏.‏ قال أبو عيسى حديث عبد الله بن مسعود حديث حسن صحيح ‏.‏ قال أبو عيسى هذا الحديث رواه أحمد بن حنبل عن يحيى بن آدم مختصرا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "حدثنا محمد بن حاتم المؤدب البغدادي البصري، حدثنا عامر بن صالح الزبيري، هو من ولد الزبير حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت أمر رسول الله صلى الله عليه وسلم ببناء المساجد في الدور وأن تنظف وتطيب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "حدثنا هناد، حدثنا عبدة، ووكيع، عن هشام بن عروة، عن أبيه، أن النبي صلى الله عليه وسلم أمر فذكر نحوه ‏.‏ قال أبو عيسى وهذا أصح من الحديث الأول ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن هشام بن عروة، عن أبيه، أن النبي صلى الله عليه وسلم أمر فذكر نحوه ‏.‏ قال سفيان قوله ‏ \"‏ ببناء المساجد في الدور ‏\"‏ ‏.‏ يعني القبائل ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن يعلى بن عطاء، عن علي الأزدي، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة الليل والنهار مثنى مثنى ‏\"‏ ‏.‏ قال أبو عيسى اختلف أصحاب شعبة في حديث ابن عمر فرفعه بعضهم وأوقفه بعضهم ‏.‏ وروي عن عبد الله العمري عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ والصحيح ما روي عن ابن عمر أن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة الليل مثنى مثنى ‏\"‏ ‏.‏ وروى الثقات عن عبد الله بن عمر عن النبي صلى الله عليه وسلم ولم يذكروا فيه صلاة النهار ‏.‏ وقد روي عن عبيد الله عن نافع عن ابن عمر أنه كان يصلي بالليل مثنى مثنى وبالنهار أربعا ‏.‏ وقد اختلف أهل العلم في ذلك فرأى بعضهم أن صلاة الليل والنهار مثنى مثنى ‏.‏ وهو قول الشافعي وأحمد ‏.‏ وقال بعضهم صلاة الليل مثنى مثنى ورأوا صلاة التطوع بالنهار أربعا مثل الأربع قبل الظهر وغيرها من صلاة التطوع ‏.‏ وهو قول سفيان الثوري وابن المبارك وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "حدثنا محمود بن غيلان، حدثنا وهب بن جرير، حدثنا شعبة، عن أبي إسحاق، عن عاصم بن ضمرة، قال سألنا عليا عن صلاة، رسول الله صلى الله عليه وسلم من النهار فقال إنكم لا تطيقون ذاك ‏.‏ فقلنا من أطاق ذاك منا ‏.‏ فقال كان رسول الله صلى الله عليه وسلم إذا كانت الشمس من ها هنا كهيئتها من ها هنا عند العصر صلى ركعتين وإذا كانت الشمس من ها هنا كهيئتها من ها هنا عند الظهر صلى أربعا وصلى أربعا قبل الظهر وبعدها ركعتين وقبل العصر أربعا يفصل بين كل ركعتين بالتسليم على الملائكة المقربين والنبيين والمرسلين ومن تبعهم من المؤمنين والمسلمين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقال إسحاق بن إبراهيم أحسن شيء روي في تطوع النبي صلى الله عليه وسلم في النهار هذا ‏.‏ وروي عن عبد الله بن المبارك أنه كان يضعف هذا الحديث ‏.‏ وإنما ضعفه عندنا والله أعلم لأنه لا يروى مثل هذا عن النبي صلى الله عليه وسلم إلا من هذا الوجه عن عاصم بن ضمرة عن علي ‏.‏ وعاصم بن ضمرة هو ثقة عند بعض أهل العلم ‏.‏ قال علي بن المديني قال يحيى بن سعيد القطان قال سفيان كنا نعرف فضل حديث عاصم بن ضمرة على حديث الحارث ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "حدثنا محمد بن عبد الأعلى، حدثنا خالد بن الحارث، عن أشعث، وهو ابن عبد الملك عن محمد بن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في لحف نسائه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم رخصة في ذلك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن برد بن سنان، عن الزهري، عن عروة، عن عائشة، قالت جئت ورسول الله صلى الله عليه وسلم يصلي في البيت والباب عليه مغلق فمشى حتى فتح لي ثم رجع إلى مكانه ‏.‏ ووصفت الباب في القبلة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن الأعمش، قال سمعت أبا وائل، قال سأل رجل عبد الله عن هذا الحرف ‏(‏غير آسن‏)‏ أو ياسن قال كل القرآن قرأت غير هذا الحرف قال نعم ‏.‏ قال إن قوما يقرءونه ينثرونه نثر الدقل لا يجاوز تراقيهم إني لأعرف السور النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن ‏.‏ قال فأمرنا علقمة فسأله فقال عشرون سورة من المفصل كان النبي صلى الله عليه وسلم يقرن بين كل سورتين في ركعة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 603,
			"arabicnumber": 603,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن الأعمش، سمع ذكوان، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا توضأ الرجل فأحسن الوضوء ثم خرج إلى الصلاة لا يخرجه أو قال لا ينهزه إلا إياها لم يخط خطوة إلا رفعه الله بها درجة أو حط عنه بها خطيئة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 604,
			"arabicnumber": 604,
			"text": "حدثنا محمد بن بشار، حدثنا إبراهيم بن أبي الوزير البصري، ثقة حدثنا محمد بن موسى، عن سعد بن إسحاق بن كعب بن عجرة، عن أبيه، عن جده، قال صلى النبي صلى الله عليه وسلم في مسجد بني عبد الأشهل المغرب فقام ناس يتنفلون فقال النبي صلى الله عليه وسلم ‏ \"‏ عليكم بهذه الصلاة في البيوت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث كعب بن عجرة لا نعرفه إلا من هذا الوجه ‏.‏ والصحيح ما روي عن ابن عمر قال كان النبي صلى الله عليه وسلم يصلي الركعتين بعد المغرب في بيته ‏.‏ قال أبو عيسى وقد روي عن حذيفة أن النبي صلى الله عليه وسلم صلى المغرب فما زال يصلي في المسجد حتى صلى العشاء الآخرة ‏.‏ ففي هذا الحديث دلالة أن النبي صلى الله عليه وسلم صلى الركعتين بعد المغرب في المسجد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 605,
			"arabicnumber": 605,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن الأغر بن الصباح، عن خليفة بن حصين، عن قيس بن عاصم، أنه أسلم فأمره النبي صلى الله عليه وسلم أن يغتسل بماء وسدر ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من هذا الوجه ‏.‏ والعمل عليه عند أهل العلم يستحبون للرجل إذا أسلم أن يغتسل ويغسل ثيابه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 606,
			"arabicnumber": 606,
			"text": "حدثنا محمد بن حميد الرازي، حدثنا الحكم بن بشير بن سلمان، حدثنا خلاد الصفار، عن الحكم بن عبد الله النصري، عن أبي إسحاق، عن أبي جحيفة، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ستر ما بين أعين الجن وعورات بني آدم إذا دخل أحدهم الخلاء أن يقول بسم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وإسناده ليس بذاك القوي ‏.‏ وقد روي عن أنس عن النبي صلى الله عليه وسلم أشياء في هذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 607,
			"arabicnumber": 607,
			"text": "حدثنا أبو الوليد، أحمد بن بكار الدمشقي حدثنا الوليد بن مسلم، قال قال صفوان بن عمرو أخبرني يزيد بن خمير، عن عبد الله بن بسر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ أمتي يوم القيامة غر من السجود محجلون من الوضوء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه من حديث عبد الله بن بسر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 608,
			"arabicnumber": 608,
			"text": "حدثنا هناد، حدثنا أبو الأحوص، عن أشعث بن أبي الشعثاء، عن أبيه، عن مسروق، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يحب التيمن في طهوره إذا تطهر وفي ترجله إذا ترجل وفي انتعاله إذا انتعل ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو الشعثاء اسمه سليم بن أسود المحاربي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "حدثنا هناد، حدثنا وكيع، عن شريك، عن عبد الله بن عيسى، عن ابن جبر، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يجزئ في الوضوء رطلان من ماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث شريك على هذا اللفظ ‏.‏ وروى شعبة عن عبد الله بن عبد الله بن جبر عن أنس بن مالك أن النبي صلى الله عليه وسلم كان يتوضأ بالمكوك ويغتسل بخمسة مكاكي ‏.‏ وروي عن سفيان الثوري عن عبد الله بن عيسى عن عبد الله بن جبر عن أنس أن النبي صلى الله عليه وسلم كان يتوضأ بالمد ويغتسل بالصاع ‏.‏ وهذا أصح من حديث شريك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 610,
			"arabicnumber": 610,
			"text": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي حرب بن أبي الأسود، عن أبيه، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال في بول الغلام الرضيع ‏ \"‏ ينضح بول الغلام ويغسل بول الجارية ‏\"‏ ‏.‏ قال قتادة وهذا ما لم يطعما فإذا طعما غسلا جميعا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ رفع هشام الدستوائي هذا الحديث عن قتادة وأوقفه سعيد بن أبي عروبة عن قتادة ولم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 611,
			"arabicnumber": 611,
			"text": "حدثنا قتيبة، حدثنا خالد بن زياد، عن مقاتل بن حيان، عن شهر بن حوشب، قال رأيت جرير بن عبد الله توضأ ومسح على خفيه قال فقلت له في ذلك فقال رأيت النبي صلى الله عليه وسلم توضأ فمسح على خفيه ‏.‏ فقلت له أقبل المائدة أم بعد المائدة قال ما أسلمت إلا بعد المائدة ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 612,
			"arabicnumber": 612,
			"text": "حدثنا محمد بن حميد الرازي، قال حدثنا نعيم بن ميسرة النحوي، عن خالد بن زياد، نحوه ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه مثل هذا إلا من حديث مقاتل بن حيان عن شهر بن حوشب ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 613,
			"arabicnumber": 613,
			"text": "حدثنا هناد، حدثنا قبيصة، عن حماد بن سلمة، عن عطاء الخراساني، عن يحيى بن يعمر، عن عمار، أن النبي صلى الله عليه وسلم رخص للجنب إذا أراد أن يأكل أو يشرب أو ينام أن يتوضأ وضوءه للصلاة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 614,
			"arabicnumber": 614,
			"text": "حدثنا عبد الله بن أبي زياد القطواني الكوفي، حدثنا عبيد الله بن موسى، حدثنا غالب أبو بشر، عن أيوب بن عائذ الطائي، عن قيس بن مسلم، عن طارق بن شهاب، عن كعب بن عجرة، قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ أعيذك بالله يا كعب بن عجرة من أمراء يكونون من بعدي فمن غشي أبوابهم فصدقهم في كذبهم وأعانهم على ظلمهم فليس مني ولست منه ولا يرد على الحوض ومن غشي أبوابهم أو لم يغش فلم يصدقهم في كذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وسيرد على الحوض يا كعب بن عجرة الصلاة برهان والصوم جنة حصينة والصدقة تطفئ الخطيئة كما يطفئ الماء النار ‏.‏ يا كعب بن عجرة إنه لا يربو لحم نبت من سحت إلا كانت النار أولى به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث عبيد الله بن موسى ‏.‏ وأيوب بن عائذ الطائي يضعف ويقال كان يرى رأى الإرجاء ‏.‏ وسألت محمدا عن هذا الحديث فلم يعرفه إلا من حديث عبيد الله بن موسى واستغربه جدا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 615,
			"arabicnumber": 615,
			"text": "وقال محمد حدثنا ابن نمير، عن عبيد الله بن موسى، عن غالب، بهذا ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 616,
			"arabicnumber": 616,
			"text": "حدثنا موسى بن عبد الرحمن الكندي الكوفي، حدثنا زيد بن الحباب، أخبرنا معاوية بن صالح، حدثني سليم بن عامر، قال سمعت أبا أمامة، يقول سمعت رسول الله صلى الله عليه وسلم يخطب في حجة الوداع فقال ‏ \"‏ اتقوا الله ربكم وصلوا خمسكم وصوموا شهركم وأدوا زكاة أموالكم وأطيعوا ذا أمركم تدخلوا جنة ربكم ‏\"‏ ‏.‏ قال فقلت لأبي أمامة منذ كم سمعت من رسول الله صلى الله عليه وسلم هذا الحديث قال سمعته وأنا ابن ثلاثين سنة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 73
			}
		}
	]
}