{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"7": "The Book on Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 617,
			"arabicnumber": 617,
			"text": "حدثنا هناد بن السري التميمي الكوفي، حدثنا أبو معاوية، عن الأعمش، عن المعرور بن سويد، عن أبي ذر، قال جئت إلى رسول الله صلى الله عليه وسلم وهو جالس في ظل الكعبة ‏.‏ قال فرآني مقبلا فقال ‏\"‏ هم الأخسرون ورب الكعبة يوم القيامة ‏\"‏ ‏.‏ قال فقلت ما لي لعله أنزل في شيء ‏.‏ قال قلت من هم فداك أبي وأمي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هم الأكثرون إلا من قال هكذا وهكذا وهكذا ‏\"‏ ‏.‏ فحثا بين يديه وعن يمينه وعن شماله ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لا يموت رجل فيدع إبلا أو بقرا لم يؤد زكاتها إلا جاءته يوم القيامة أعظم ما كانت وأسمنه تطؤه بأخفافها وتنطحه بقرونها كلما نفدت أخراها عادت عليه أولاها حتى يقضى بين الناس ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة مثله ‏.‏ وعن علي بن أبي طالب رضى الله عنه قال لعن مانع الصدقة ‏.‏ وعن قبيصة بن هلب عن أبيه وجابر بن عبد الله وعبد الله بن مسعود ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن صحيح ‏.‏ واسم أبي ذر جندب بن السكن ويقال ابن جنادة ‏.‏ حدثنا عبد الله بن منير عن عبيد الله بن موسى عن سفيان الثوري عن حكيم بن الديلم عن الضحاك بن مزاحم قال الأكثرون أصحاب عشرة آلاف ‏.‏ قال وعبد الله بن منير مروزي رجل صالح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 618,
			"arabicnumber": 618,
			"text": "حدثنا عمر بن حفص الشيباني البصري، حدثنا عبد الله بن وهب، أخبرنا عمرو بن الحارث، عن دراج، عن ابن حجيرة، هو عبد الرحمن بن حجيرة المصري عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أديت زكاة مالك فقد قضيت ما عليك ‏\"‏ ‏.‏ قال أبو عيسى ‏.‏ هذا حديث حسن غريب ‏.‏ وقد روي عن النبي صلى الله عليه وسلم من غير وجه أنه ذكر الزكاة ‏.‏ فقال رجل يا رسول الله هل على غيرها فقال ‏\"‏ لا إلا أن تتطوع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"text": "حدثنا محمد بن إسماعيل، حدثنا علي بن عبد الحميد الكوفي، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال كنا نتمنى أن يأتي، الأعرابي العاقل فيسأل النبي صلى الله عليه وسلم ونحن عنده فبينا نحن على ذلك إذ أتاه أعرابي فجثا بين يدى النبي صلى الله عليه وسلم فقال يا محمد إن رسولك أتانا فزعم لنا أنك تزعم أن الله أرسلك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي رفع السماء وبسط الأرض ونصب الجبال آلله أرسلك فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا خمس صلوات في اليوم والليلة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا صوم شهر في السنة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا في أموالنا الزكاة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا الحج إلى البيت من استطاع إليه سبيلا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ فقال والذي بعثك بالحق لا أدع منهن شيئا ولا أجاوزهن ‏.‏ ثم وثب فقال النبي صلى الله عليه وسلم ‏\"‏ إن صدق الأعرابي دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي من غير هذا الوجه عن أنس عن النبي صلى الله عليه وسلم ‏.‏ سمعت محمد بن إسماعيل يقول قال بعض أهل العلم فقه هذا الحديث أن القراءة على العالم والعرض عليه جائز مثل السماع ‏.‏ واحتج بأن الأعرابي عرض على النبي صلى الله عليه وسلم فأقر به النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 620,
			"arabicnumber": 620,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قد عفوت عن صدقة الخيل والرقيق فهاتوا صدقة الرقة من كل أربعين درهما درهما وليس في تسعين ومائة شيء فإذا بلغت مائتين ففيها خمسة الدراهم ‏\"‏ ‏.‏ وفي الباب عن أبي بكر الصديق وعمرو بن حزم ‏.‏ قال أبو عيسى روى هذا الحديث الأعمش وأبو عوانة وغيرهما عن أبي إسحاق عن عاصم بن ضمرة عن علي وروى سفيان الثوري وابن عيينة وغير واحد عن أبي إسحاق عن الحارث عن علي ‏.‏ قال وسألت محمدا عن هذا الحديث فقال كلاهما عندي صحيح عن أبي إسحاق يحتمل أن يكون روي عنهما جميعا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 621,
			"arabicnumber": 621,
			"text": "حدثنا زياد بن أيوب البغدادي، وإبراهيم بن عبد الله الهروي، ومحمد بن كامل المروزي المعنى، واحد، قالوا حدثنا عباد بن العوام، عن سفيان بن حسين، عن الزهري، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم كتب كتاب الصدقة فلم يخرجه إلى عماله حتى قبض فقرنه بسيفه فلما قبض عمل به أبو بكر حتى قبض وعمر حتى قبض وكان فيه ‏ \"‏ في خمس من الإبل شاة وفي عشر شاتان وفي خمس عشرة ثلاث شياه وفي عشرين أربع شياه وفي خمس وعشرين بنت مخاض إلى خمس وثلاثين فإذا زادت ففيها ابنة لبون إلى خمس وأربعين فإذا زادت ففيها حقة إلى ستين فإذا زادت ففيها جذعة إلى خمس وسبعين فإذا زادت ففيها ابنتا لبون إلى تسعين فإذا زادت ففيها حقتان إلى عشرين ومائة فإذا زادت على عشرين ومائة ففي كل خمسين حقة وفي كل أربعين ابنة لبون ‏.‏ وفي الشاء في كل أربعين شاة شاة إلى عشرين ومائة فإذا زادت فشاتان إلى مائتين فإذا زادت فثلاث شياه إلى ثلاثمائة شاة فإذا زادت على ثلاثمائة شاة ففي كل مائة شاة شاة ثم ليس فيها شيء حتى تبلغ أربعمائة ولا يجمع بين متفرق ولا يفرق بين مجتمع مخافة الصدقة وما كان من خليطين فإنهما يتراجعان بالسوية ولا يؤخذ في الصدقة هرمة ولا ذات عيب ‏\"‏ ‏.‏ وقال الزهري إذا جاء المصدق قسم الشاء أثلاثا ثلث خيار وثلث أوساط وثلث شرار وأخذ المصدق من الوسط ‏.‏ ولم يذكر الزهري البقر ‏.‏ وفي الباب عن أبي بكر الصديق وبهز بن حكيم عن أبيه عن جده ‏.‏ وأبي ذر وأنس ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن ‏.‏ والعمل على هذا الحديث عند عامة الفقهاء ‏.‏ وقد روى يونس بن يزيد وغير واحد عن الزهري عن سالم هذا الحديث ولم يرفعوه وإنما رفعه سفيان بن حسين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 622,
			"arabicnumber": 622,
			"text": "حدثنا محمد بن عبيد المحاربي، وأبو سعيد الأشج قالا حدثنا عبد السلام بن حرب، عن خصيف، عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏ \"‏ في ثلاثين من البقر تبيع أو تبيعة وفي أربعين مسنة ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل ‏.‏ قال أبو عيسى هكذا رواه عبد السلام بن حرب عن خصيف وعبد السلام ثقة حافظ ‏.‏ وروى شريك هذا الحديث عن خصيف عن أبي عبيدة عن أمه عن عبد الله ‏.‏ وأبو عبيدة بن عبد الله لم يسمع من عبد الله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 623,
			"arabicnumber": 623,
			"text": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن مسروق، عن معاذ بن جبل، قال بعثني النبي صلى الله عليه وسلم إلى اليمن فأمرني أن آخذ من كل ثلاثين بقرة تبيعا أو تبيعة ومن كل أربعين مسنة ومن كل حالم دينارا أو عدله معافر ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروى بعضهم هذا الحديث عن سفيان عن الأعمش عن أبي وائل عن مسروق أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن فأمره أن يأخذ ‏.‏ وهذا أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 624,
			"arabicnumber": 624,
			"text": "حدثنا محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة عن عمرو بن مرة قال سألت أبا عبيدة بن عبد الله هل تذكر من عبد الله شيئا قال لا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 625,
			"arabicnumber": 625,
			"text": "حدثنا أبو كريب، حدثنا وكيع، حدثنا زكريا بن إسحاق المكي، حدثنا يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم بعث معاذا إلى اليمن فقال له ‏ \"‏ إنك تأتي قوما أهل كتاب فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في اليوم والليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم تؤخذ من أغنيائهم وترد على فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنها ليس بينها وبين الله حجاب ‏\"‏ ‏.‏ وفي الباب عن الصنابحي ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وأبو معبد مولى ابن عباس اسمه نافذ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 626,
			"arabicnumber": 626,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم قال ‏ \"‏ ليس فيما دون خمس ذود صدقة وليس فيما دون خمس أواق صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وابن عمر وجابر وعبد الله بن عمرو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 627,
			"arabicnumber": 627,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، وشعبة، ومالك بن أنس، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد، عن النبي صلى الله عليه وسلم نحو حديث عبد العزيز عن عمرو بن يحيى ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح وقد روي من غير وجه عنه ‏.‏ والعمل على هذا عند أهل العلم أن ليس فيما دون خمسة أوسق صدقة ‏.‏ والوسق ستون صاعا وخمسة أوسق ثلاثمائة صاع وصاع النبي صلى الله عليه وسلم خمسة أرطال وثلث وصاع أهل الكوفة ثمانية أرطال ‏.‏ وليس فيما دون خمس أواق صدقة والأوقية أربعون درهما وخمس أواق مائتا درهم ‏.‏ وليس فيما دون خمس ذود صدقة يعني ليس فيما دون خمس من الإبل صدقة فإذا بلغت خمسا وعشرين من الإبل ففيها بنت مخاض وفيما دون خمس وعشرين من الإبل في كل خمس من الإبل شاة ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 628,
			"arabicnumber": 628,
			"text": "حدثنا أبو كريب، محمد بن العلاء ومحمود بن غيلان قالا حدثنا وكيع، عن سفيان، وشعبة، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس على المسلم في فرسه ولا في عبده صدقة ‏\"‏ ‏.‏ وفي الباب عن علي وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم أنه ليس في الخيل السائمة صدقة ولا في الرقيق إذا كانوا للخدمة صدقة إلا أن يكونوا للتجارة فإذا كانوا للتجارة ففي أثمانهم الزكاة إذا حال عليها الحول ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 629,
			"arabicnumber": 629,
			"text": "حدثنا عمرو بن أبي سلمة التنيسي، عن صدقة بن عبد الله، عن موسى بن يسار، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ في العسل في كل عشرة أزق زق ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وأبي سيارة المتعي وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث ابن عمر في إسناده مقال ولا يصح عن النبي صلى الله عليه وسلم في هذا الباب كبير شيء والعمل على هذا عند أكثر أهل العلم وبه يقول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم ليس في العسل شيء ‏.‏ وصدقة بن عبد الله ليس بحافظ وقد خولف صدقة بن عبد الله في رواية هذا الحديث عن نافع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 630,
			"arabicnumber": 630,
			"text": "حدثنا محمد بن بشار حدثنا عبد الوهاب الثقفي حدثنا عبيد الله بن عمر عن نافع قال سألني عمر بن عبد العزيز عن صدقة العسل ‏.‏ قال قلت ما عندنا عسل نتصدق منه ولكن أخبرنا المغيرة بن حكيم أنه قال ليس في العسل صدقة ‏.‏ فقال عمر عدل مرضي ‏.‏ فكتب إلى الناس أن توضع ‏.‏ يعني عنهم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 631,
			"arabicnumber": 631,
			"text": "حدثنا يحيى بن موسى، حدثنا هارون بن صالح الطلحي المدني، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من استفاد مالا فلا زكاة عليه حتى يحول عليه الحول عند ربه ‏\"‏ ‏.‏ وفي الباب عن سراء بنت نبهان الغنوية ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الوهاب الثقفي، حدثنا أيوب، عن نافع، عن ابن عمر، قال من استفاد مالا فلا زكاة فيه حتى يحول عليه الحول عند ربه ‏.‏ قال أبو عيسى وهذا أصح من حديث عبد الرحمن بن زيد بن أسلم ‏.‏ قال أبو عيسى وروى أيوب وعبيد الله بن عمر وغير واحد عن نافع عن ابن عمر موقوفا ‏.‏ وعبد الرحمن بن زيد بن أسلم ضعيف في الحديث ضعفه أحمد بن حنبل وعلي بن المديني وغيرهما من أهل الحديث وهو كثير الغلط ‏.‏ وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم أن لا زكاة في المال المستفاد حتى يحول عليه الحول ‏.‏ وبه يقول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم إذا كان عنده مال تجب فيه الزكاة ففيه الزكاة وإن لم يكن عنده سوى المال المستفاد ما تجب فيه الزكاة لم يجب عليه في المال المستفاد زكاة حتى يحول عليه الحول فإن استفاد مالا قبل أن يحول عليه الحول فإنه يزكي المال المستفاد مع ماله الذي وجبت فيه الزكاة ‏.‏ وبه يقول سفيان الثوري وأهل الكوفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 633,
			"arabicnumber": 633,
			"text": "حدثنا يحيى بن أكثم، حدثنا جرير، عن قابوس بن أبي ظبيان، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تصلح قبلتان في أرض واحدة وليس على المسلمين جزية ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 634,
			"arabicnumber": 634,
			"text": "حدثنا أبو كريب، حدثنا جرير، عن قابوس، بهذا الإسناد نحوه ‏.‏ وفي الباب عن سعيد بن زيد، وجد حرب بن عبيد الله الثقفي ‏.‏ قال أبو عيسى حديث ابن عباس قد روي عن قابوس بن أبي ظبيان، عن أبيه، عن النبي صلى الله عليه وسلم مرسلا ‏.‏ والعمل على هذا عند عامة أهل العلم أن النصراني إذا أسلم وضعت عنه جزية رقبته ‏.‏ وقول النبي صلى الله عليه وسلم ‏\"‏ ليس على المسلمين عشور ‏\"‏ إنما يعني به جزية الرقبة وفي الحديث ما يفسر هذا حيث قال ‏\"‏ إنما العشور على اليهود والنصارى وليس على المسلمين عشور ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 635,
			"arabicnumber": 635,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن أبي وائل، عن عمرو بن الحارث بن المصطلق، عن ابن أخي، زينب امرأة عبد الله عن زينب، امرأة عبد الله بن مسعود قالت خطبنا رسول الله صلى الله عليه وسلم فقال ‏ \"‏ يا معشر النساء تصدقن ولو من حليكن فإنكن أكثر أهل جهنم يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 636,
			"arabicnumber": 636,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، عن شعبة، عن الأعمش، قال سمعت أبا وائل، يحدث عن عمرو بن الحارث ابن أخي، زينب امرأة عبد الله - عن زينب، - امرأة عبد الله - عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى وهذا أصح من حديث أبي معاوية وأبو معاوية وهم في حديثه فقال عن عمرو بن الحارث عن ابن أخي زينب ‏.‏ والصحيح إنما هو عن عمرو بن الحارث ابن أخي زينب ‏.‏ وقد روي عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم أنه رأى في الحلي زكاة ‏.‏ وفي إسناد هذا الحديث مقال ‏.‏ واختلف أهل العلم في ذلك فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين في الحلي زكاة ما كان منه ذهب وفضة ‏.‏ وبه يقول سفيان الثوري وعبد الله بن المبارك ‏.‏ وقال بعض أصحاب النبي صلى الله عليه وسلم منهم ابن عمر وعائشة وجابر بن عبد الله وأنس بن مالك ليس في الحلي زكاة ‏.‏ وهكذا روي عن بعض فقهاء التابعين وبه يقول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 637,
			"arabicnumber": 637,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأتين، أتتا رسول الله صلى الله عليه وسلم وفي أيديهما سواران من ذهب فقال لهما ‏\"‏ أتؤديان زكاته ‏\"‏ ‏.‏ قالتا لا ‏.‏ قال فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ أتحبان أن يسوركما الله بسوارين من نار ‏\"‏ ‏.‏ قالتا لا ‏.‏ قال ‏\"‏ فأديا زكاته ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث قد رواه المثنى بن الصباح عن عمرو بن شعيب نحو هذا ‏.‏ والمثنى بن الصباح وابن لهيعة يضعفان في الحديث ولا يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 638,
			"arabicnumber": 638,
			"text": "حدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن الحسن بن عمارة، عن محمد بن عبد الرحمن بن عبيد، عن عيسى بن طلحة، عن معاذ، أنه كتب إلى النبي صلى الله عليه وسلم يسأله عن الخضروات وهي البقول فقال ‏ \"‏ ليس فيها شيء ‏\"‏ ‏.‏ قال أبو عيسى إسناد هذا الحديث ليس بصحيح وليس يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء وإنما يروى هذا عن موسى بن طلحة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ والعمل على هذا عند أهل العلم أن ليس في الخضروات صدقة ‏.‏ قال أبو عيسى والحسن هو ابن عمارة وهو ضعيف عند أهل الحديث ضعفه شعبة وغيره وتركه عبد الله بن المبارك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 639,
			"arabicnumber": 639,
			"text": "حدثنا أبو موسى الأنصاري، حدثنا عاصم بن عبد العزيز المدني، حدثنا الحارث بن عبد الرحمن بن أبي ذباب، عن سليمان بن يسار، وبسر بن سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ فيما سقت السماء والعيون العشر وفيما سقي بالنضح نصف العشر ‏\"‏ ‏.‏ قال وفي الباب عن أنس بن مالك وابن عمر وجابر ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن بكير بن عبد الله بن الأشج عن سليمان بن يسار وبسر بن سعيد عن النبي صلى الله عليه وسلم مرسلا ‏.‏ وكأن هذا أصح ‏.‏ وقد صح حديث ابن عمر عن النبي صلى الله عليه وسلم في هذا الباب وعليه العمل عند عامة الفقهاء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 640,
			"arabicnumber": 640,
			"text": "حدثنا أحمد بن الحسن، حدثنا سعيد بن أبي مريم، حدثنا ابن وهب، حدثني يونس، عن ابن شهاب، عن سالم، عن أبيه، عن رسول الله صلى الله عليه وسلم أنه سن فيما سقت السماء والعيون أو كان عثريا العشر وفيما سقي بالنضح نصف العشر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 641,
			"arabicnumber": 641,
			"text": "حدثنا محمد بن إسماعيل، حدثنا إبراهيم بن موسى، حدثنا الوليد بن مسلم، عن المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم خطب الناس فقال ‏ \"‏ ألا من ولي يتيما له مال فليتجر فيه ولا يتركه حتى تأكله الصدقة ‏\"‏ ‏.‏ قال أبو عيسى وإنما روي هذا الحديث من هذا الوجه وفي إسناده مقال لأن المثنى بن الصباح يضعف في الحديث ‏.‏ وروى بعضهم هذا الحديث عن عمرو بن شعيب أن عمر بن الخطاب ‏.‏ فذكر هذا الحديث ‏.‏ وقد اختلف أهل العلم في هذا الباب فرأى غير واحد من أصحاب النبي صلى الله عليه وسلم في مال اليتيم زكاة ‏.‏ منهم عمر وعلي وعائشة وابن عمر وبه يقول مالك والشافعي وأحمد وإسحاق ‏.‏ وقالت طائفة من أهل العلم ليس في مال اليتيم زكاة ‏.‏ وبه يقول سفيان الثوري وعبد الله بن المبارك ‏.‏ وعمرو بن شعيب هو ابن محمد بن عبد الله بن عمرو بن العاص وشعيب قد سمع من جده عبد الله بن عمرو ‏.‏ وقد تكلم يحيى بن سعيد في حديث عمرو بن شعيب وقال هو عندنا واه ‏.‏ ومن ضعفه فإنما ضعفه من قبل أنه يحدث من صحيفة جده عبد الله بن عمرو وأما أكثر أهل الحديث فيحتجون بحديث عمرو بن شعيب ويثبتونه منهم أحمد وإسحاق وغيرهما ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 642,
			"arabicnumber": 642,
			"text": "حدثنا قتيبة، حدثنا الليث بن سعد، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏ \"‏ العجماء جرحها جبار والمعدن جبار والبئر جبار وفي الركاز الخمس ‏\"‏ ‏.‏ قال وفي الباب عن أنس بن مالك وعبد الله بن عمرو وعبادة بن الصامت وعمرو بن عوف المزني وجابر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 643,
			"arabicnumber": 643,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، أخبرنا شعبة، أخبرني خبيب بن عبد الرحمن، قال سمعت عبد الرحمن بن مسعود بن نيار، يقول جاء سهل بن أبي حثمة إلى مجلسنا فحدث أن رسول الله صلى الله عليه وسلم كان يقول ‏ \"‏ إذا خرصتم فخذوا ودعوا الثلث فإن لم تدعوا الثلث فدعوا الربع ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعتاب بن أسيد وابن عباس ‏.‏ قال أبو عيسى والعمل على حديث سهل بن أبي حثمة عند أكثر أهل العلم في الخرص وبحديث سهل بن أبي حثمة يقول أحمد وإسحاق ‏.‏ والخرص إذا أدركت الثمار من الرطب والعنب مما فيه الزكاة بعث السلطان خارصا يخرص عليهم ‏.‏ والخرص أن ينظر من يبصر ذلك فيقول يخرج من هذا من الزبيب كذا وكذا ومن التمر كذا وكذا فيحصى عليهم وينظر مبلغ العشر من ذلك فيثبت عليهم ثم يخلي بينهم وبين الثمار فيصنعون ما أحبوا فإذا أدركت الثمار أخذ منهم العشر ‏.‏ هكذا فسره بعض أهل العلم وبهذا يقول مالك والشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 644,
			"arabicnumber": 644,
			"text": "حدثنا أبو عمرو، مسلم بن عمرو الحذاء المدني حدثنا عبد الله بن نافع الصائغ، عن محمد بن صالح التمار، عن ابن شهاب، عن سعيد بن المسيب، عن عتاب بن أسيد، أن النبي صلى الله عليه وسلم كان يبعث على الناس من يخرص عليهم كرومهم وثمارهم ‏.‏ وبهذا الإسناد أن النبي صلى الله عليه وسلم قال في زكاة الكروم ‏ \"‏ إنها تخرص كما يخرص النخل ثم تؤدى زكاته زبيبا كما تؤدى زكاة النخل تمرا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روى ابن جريج هذا الحديث عن ابن شهاب عن عروة عن عائشة ‏.‏ وسألت محمدا عن هذا الحديث فقال حديث ابن جريج غير محفوظ وحديث ابن المسيب عن عتاب بن أسيد أثبت وأصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 645,
			"arabicnumber": 645,
			"text": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا يزيد بن عياض، عن عاصم بن عمر بن قتادة، ح وحدثنا محمد بن إسماعيل، قال حدثنا أحمد بن خالد، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏ قال أبو عيسى حديث رافع بن خديج حديث حسن صحيح ‏.‏ ويزيد بن عياض ضعيف عند أهل الحديث ‏.‏ وحديث محمد بن إسحاق أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 646,
			"arabicnumber": 646,
			"text": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن سعد بن سنان، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المعتدي في الصدقة كمانعها ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وأم سلمة وأبي هريرة ‏.‏ قال أبو عيسى حديث أنس حديث غريب من هذا الوجه ‏.‏ وقد تكلم أحمد بن حنبل في سعد بن سنان ‏.‏ وهكذا يقول الليث بن سعد عن يزيد بن أبي حبيب عن سعد بن سنان عن أنس بن مالك ‏.‏ ويقول عمرو بن الحارث وابن لهيعة عن يزيد بن أبي حبيب عن سنان بن سعد عن أنس ‏.‏ قال وسمعت محمدا يقول والصحيح سنان بن سعد ‏.‏ وقوله ‏\"‏ المعتدي في الصدقة كمانعها ‏\"‏ يقول على المعتدي من الإثم كما على المانع إذا منع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 647,
			"arabicnumber": 647,
			"text": "حدثنا علي بن حجر، أخبرنا محمد بن يزيد، عن مجالد، عن الشعبي، عن جرير، قال قال النبي صلى الله عليه وسلم ‏ \"‏ إذا أتاكم المصدق فلا يفارقنكم إلا عن رضا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 648,
			"arabicnumber": 648,
			"text": "حدثنا أبو عمار الحسين بن حريث، حدثنا سفيان بن عيينة، عن داود، عن الشعبي، عن جرير، عن النبي صلى الله عليه وسلم بنحوه ‏.‏ قال أبو عيسى حديث داود عن الشعبي، أصح من حديث مجالد ‏.‏ وقد ضعف مجالدا بعض أهل العلم وهو كثير الغلط ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 649,
			"arabicnumber": 649,
			"text": "حدثنا علي بن سعيد الكندي الكوفي، حدثنا حفص بن غياث، عن أشعث، عن عون بن أبي جحيفة، عن أبيه، قال قدم علينا مصدق النبي صلى الله عليه وسلم فأخذ الصدقة من أغنيائنا فجعلها في فقرائنا وكنت غلاما يتيما فأعطاني منها قلوصا ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث أبي جحيفة حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 650,
			"arabicnumber": 650,
			"text": "حدثنا قتيبة، وعلي بن حجر، - قال قتيبة حدثنا شريك، وقال، علي أخبرنا شريك، والمعنى، واحد، عن حكيم بن جبير، عن محمد بن عبد الرحمن بن يزيد، عن أبيه، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الناس وله ما يغنيه جاء يوم القيامة ومسألته في وجهه خموش أو خدوش أو كدوح ‏\"‏ ‏.‏ قيل يا رسول الله وما يغنيه قال ‏\"‏ خمسون درهما أو قيمتها من الذهب ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن ‏.‏ وقد تكلم شعبة في حكيم بن جبير من أجل هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 651,
			"arabicnumber": 651,
			"text": "حدثنا محمود بن غيلان، حدثنا يحيى بن آدم، حدثنا سفيان، عن حكيم بن جبير، بهذا الحديث ‏.‏ فقال له عبد الله بن عثمان صاحب شعبة لو غير حكيم حدث بهذا الحديث ‏.‏ فقال له سفيان وما لحكيم لا يحدث عنه شعبة قال نعم ‏.‏ قال سفيان سمعت زبيدا يحدث بهذا عن محمد بن عبد الرحمن بن يزيد ‏.‏ والعمل على هذا عند بعض أصحابنا وبه يقول الثوري وعبد الله بن المبارك وأحمد وإسحاق ‏.‏ قالوا إذا كان عند الرجل خمسون درهما لم تحل له الصدقة ‏.‏ قال ولم يذهب بعض أهل العلم إلى حديث حكيم بن جبير ووسعوا في هذا وقالوا إذا كان عنده خمسون درهما أو أكثر وهو محتاج فله أن يأخذ من الزكاة وهو قول الشافعي وغيره من أهل الفقه والعلم ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 652,
			"arabicnumber": 652,
			"text": "حدثنا أبو بكر، محمد بن بشار حدثنا أبو داود الطيالسي، حدثنا سفيان بن سعيد، ح وحدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان، عن سعد بن إبراهيم، عن ريحان بن يزيد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وحبشي بن جنادة وقبيصة بن مخارق ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن ‏.‏ وقد روى شعبة عن سعد بن إبراهيم هذا الحديث بهذا الإسناد ولم يرفعه ‏.‏ وقد روي في غير هذا الحديث عن النبي صلى الله عليه وسلم ‏\"‏ لا تحل المسألة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏ وإذا كان الرجل قويا محتاجا ولم يكن عنده شيء فتصدق عليه أجزأ عن المتصدق عند أهل العلم ووجه هذا الحديث عند بعض أهل العلم على المسألة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 653,
			"arabicnumber": 653,
			"text": "حدثنا علي بن سعيد الكندي، حدثنا عبد الرحيم بن سليمان، عن مجالد، عن عامر الشعبي، عن حبشي بن جنادة السلولي، قال سمعت رسول الله صلى الله عليه وسلم في حجة الوداع وهو واقف بعرفة أتاه أعرابي فأخذ بطرف ردائه فسأله إياه فأعطاه وذهب فعند ذلك حرمت المسألة فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن المسألة لا تحل لغني ولا لذي مرة سوي إلا لذي فقر مدقع أو غرم مفظع ومن سأل الناس ليثري به ماله كان خموشا في وجهه يوم القيامة ورضفا يأكله من جهنم فمن شاء فليقل ومن شاء فليكثر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 654,
			"arabicnumber": 654,
			"text": "حدثنا محمود بن غيلان، حدثنا يحيى بن آدم، عن عبد الرحيم بن سليمان، نحوه ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 655,
			"arabicnumber": 655,
			"text": "حدثنا قتيبة، حدثنا الليث، عن بكير بن عبد الله بن الأشج، عن عياض بن عبد الله، عن أبي سعيد الخدري، قال أصيب رجل في عهد رسول الله صلى الله عليه وسلم في ثمار ابتاعها فكثر دينه فقال رسول الله صلى الله عليه وسلم ‏\"‏ تصدقوا عليه ‏\"‏ ‏.‏ فتصدق الناس عليه فلم يبلغ ذلك وفاء دينه فقال رسول الله صلى الله عليه وسلم لغرمائه ‏\"‏ خذوا ما وجدتم وليس لكم إلا ذلك ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وجويرية وأنس ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 656,
			"arabicnumber": 656,
			"text": "حدثنا محمد بن بشار، حدثنا مكي بن إبراهيم، ويوسف بن يعقوب الضبعي السدوسي، قالا حدثنا بهز بن حكيم، عن أبيه، عن جده، قال كان رسول الله صلى الله عليه وسلم إذا أتي بشيء سأل ‏ \"‏ أصدقة هي أم هدية ‏\"‏ ‏.‏ فإن قالوا صدقة لم يأكل وإن قالوا هدية أكل ‏.‏ قال وفي الباب عن سلمان وأبي هريرة وأنس والحسن بن علي وأبي عميرة جد معرف بن واصل واسمه رشيد بن مالك وميمون بن مهران وابن عباس وعبد الله بن عمرو وأبي رافع وعبد الرحمن بن علقمة ‏.‏ وقد روي هذا الحديث أيضا عن عبد الرحمن بن علقمة عن عبد الرحمن بن أبي عقيل عن النبي صلى الله عليه وسلم ‏.‏ وجد بهز بن حكيم اسمه معاوية بن حيدة القشيري ‏.‏ قال أبو عيسى وحديث بهز بن حكيم حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 657,
			"arabicnumber": 657,
			"text": "حدثنا محمد بن المثنى، قال حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن ابن أبي رافع، عن أبي رافع، رضى الله عنه أن النبي صلى الله عليه وسلم بعث رجلا من بني مخزوم على الصدقة فقال لأبي رافع اصحبني كيما تصيب منها ‏.‏ فقال لا ‏.‏ حتى آتي رسول الله صلى الله عليه وسلم فأسأله ‏.‏ فانطلق إلى النبي صلى الله عليه وسلم فسأله فقال ‏ \"‏ إن الصدقة لا تحل لنا وإن موالي القوم من أنفسهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو رافع مولى النبي صلى الله عليه وسلم اسمه أسلم وابن أبي رافع هو عبيد الله بن أبي رافع كاتب علي بن أبي طالب رضى الله عنه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 658,
			"arabicnumber": 658,
			"text": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن عاصم الأحول، عن حفصة بنت سيرين، عن الرباب، عن عمها، سلمان بن عامر يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ إذا أفطر أحدكم فليفطر على تمر فإنه بركة فإن لم يجد تمرا فالماء فإنه طهور ‏\"‏ ‏.‏ وقال ‏\"‏ الصدقة على المسكين صدقة وهي على ذي الرحم ثنتان صدقة وصلة ‏\"‏ ‏.‏ قال وفي الباب عن زينب امرأة عبد الله بن مسعود وجابر وأبي هريرة ‏.‏ قال أبو عيسى حديث سلمان بن عامر حديث حسن ‏.‏ والرباب هي أم الرائح بنت صليع ‏.‏ وهكذا روى سفيان الثوري عن عاصم عن حفصة بنت سيرين عن الرباب عن سلمان بن عامر عن النبي صلى الله عليه وسلم نحو هذا الحديث ‏.‏ وروى شعبة عن عاصم عن حفصة بنت سيرين عن سلمان بن عامر ‏.‏ ولم يذكر فيه عن الرباب ‏.‏ وحديث سفيان الثوري وابن عيينة أصح ‏.‏ وهكذا روى ابن عون وهشام بن حسان عن حفصة بنت سيرين عن الرباب عن سلمان بن عامر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 659,
			"arabicnumber": 659,
			"text": "حدثنا محمد بن أحمد بن مدويه، حدثنا الأسود بن عامر، عن شريك، عن أبي حمزة، عن الشعبي، عن فاطمة بنت قيس، قالت سألت أو سئل النبي صلى الله عليه وسلم عن الزكاة فقال ‏\"‏ إن في المال لحقا سوى الزكاة ‏\"‏ ‏.‏ ثم تلا هذه الآية التي في البقرة ‏(‏ ليس البر أن تولوا وجوهكم ‏)‏ الآية ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 660,
			"arabicnumber": 660,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن الطفيل، عن شريك، عن أبي حمزة، عن عامر الشعبي، عن فاطمة بنت قيس، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن في المال حقا سوى الزكاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إسناده ليس بذاك ‏.‏ وأبو حمزة ميمون الأعور يضعف ‏.‏ وروى بيان وإسماعيل بن سالم عن الشعبي هذا الحديث قوله وهذا أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 661,
			"arabicnumber": 661,
			"text": "حدثنا قتيبة، حدثنا الليث، عن سعيد بن أبي سعيد المقبري، عن سعيد بن يسار، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما تصدق أحد بصدقة من طيب ولا يقبل الله إلا الطيب إلا أخذها الرحمن بيمينه وإن كانت تمرة تربو في كف الرحمن حتى تكون أعظم من الجبل كما يربي أحدكم فلوه أو فصيله ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وعدي بن حاتم وأنس وعبد الله بن أبي أوفى وحارثة بن وهب وعبد الرحمن بن عوف وبريدة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 662,
			"arabicnumber": 662,
			"text": "حدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، حدثنا عباد بن منصور، حدثنا القاسم بن محمد، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقبل الصدقة ويأخذها بيمينه فيربيها لأحدكم كما يربي أحدكم مهره حتى إن اللقمة لتصير مثل أحد ‏\"‏ ‏.‏ وتصديق ذلك في كتاب الله عز وجل ‏(‏وهو الذي يقبل التوبة عن عباده ‏)‏ ويأخذ الصدقات‏‏ ‏(يمحق الله الربا ويربي الصدقات‏)‏‏.‏ قال أبو عيسى: هذا حديث حسن صحيح. وقد روي عن عائشة عن النبي صلى الله عليه وسلم نحو هذا. وقد قال غير واحد من أهل العلم في هذا الحديث وما يشبه هذا من الروايات من الصفات ونزول الرب تبارك وتعالى كل ليلة إلى السماء الدنيا قالوا قد تثبت الروايات في هذا ويؤمن بها ولا يتوهم ولا يقال كيف هكذا روي عن مالك وسفيان بن عيينة وعبد الله بن المبارك أنهم قالوا في هذه الأحاديث أمروها بلا كيف. وهكذا قول أهل العلم من أهل السنة والجماعة. وأما الجهمية فأنكرت هذه الروايات وقالوا هذا تشبيه. وقد ذكر الله عز وجل في غير موضع من كتابه اليد والسمع والبصر فتأولت الجهمية هذه الآيات ففسروها على غير ما فسر أهل العلم وقالوا إن الله لم يخلق آدم بيده. وقالوا إن معنى اليد هاهنا القوة. وقال إسحاق بن إبراهيم إنما يكون التشبيه إذا قال يد كيد أو مثل يد أو سمع كسمع أو مثل سمع. فإذا قال سمع كسمع أو مثل سمع فهذا التشبيه وأما إذا قال كما قال الله تعالى يد وسمع وبصر ولا يقول كيف ولا يقول مثل سمع ولا كسمع فهذا لا يكون تشبيها وهو كما قال الله تعالى في كتابه: {ليس كمثله شيء وهو السميع البصير}",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 663,
			"arabicnumber": 663,
			"text": "حدثنا محمد بن إسماعيل، حدثنا موسى بن إسماعيل، حدثنا صدقة بن موسى، عن ثابت، عن أنس، قال سئل النبي صلى الله عليه وسلم أى الصوم أفضل بعد رمضان فقال ‏\"‏ شعبان لتعظيم رمضان ‏\"‏ ‏.‏ قيل فأى الصدقة أفضل قال ‏\"‏ صدقة في رمضان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وصدقة بن موسى ليس عندهم بذاك القوي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "حدثنا عقبة بن مكرم العمي البصري، حدثنا عبد الله بن عيسى الخزاز البصري، عن يونس بن عبيد، عن الحسن، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الصدقة لتطفئ غضب الرب وتدفع ميتة السوء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 665,
			"arabicnumber": 665,
			"text": "حدثنا قتيبة، حدثنا الليث بن سعد، عن سعيد بن أبي سعيد، عن عبد الرحمن بن بجيد، عن جدته أم بجيد، - وكانت ممن بايع رسول الله صلى الله عليه وسلم - أنها قالت يا رسول الله إن المسكين ليقوم على بابي فما أجد له شيئا أعطيه إياه ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏ \"‏ إن لم تجدي شيئا تعطينه إياه إلا ظلفا محرقا فادفعيه إليه في يده ‏\"‏ ‏.‏ قال وفي الباب عن علي وحسين بن علي وأبي هريرة وأبي أمامة ‏.‏ قال أبو عيسى حديث أم بجيد حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 666,
			"arabicnumber": 666,
			"text": "حدثنا الحسن بن علي الخلال، حدثنا يحيى بن آدم، عن ابن المبارك، عن يونس بن يزيد، عن الزهري، عن سعيد بن المسيب، عن صفوان بن أمية، قال أعطاني رسول الله صلى الله عليه وسلم يوم حنين وإنه لأبغض الخلق إلى فما زال يعطيني حتى إنه لأحب الخلق إلى ‏.‏ قال أبو عيسى حدثني الحسن بن علي بهذا أو شبهه في المذاكرة ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى حديث صفوان رواه معمر وغيره عن الزهري عن سعيد بن المسيب أن صفوان بن أمية قال أعطاني رسول الله صلى الله عليه وسلم ‏.‏ وكأن هذا الحديث أصح وأشبه إنما هو سعيد بن المسيب أن صفوان ‏.‏ وقد اختلف أهل العلم في إعطاء المؤلفة قلوبهم فرأى أكثر أهل العلم أن لا يعطوا ‏.‏ وقالوا إنما كانوا قوما على عهد النبي صلى الله عليه وسلم كان يتألفهم على الإسلام حتى أسلموا ‏.‏ ولم يروا أن يعطوا اليوم من الزكاة على مثل هذا المعنى وهو قول سفيان الثوري وأهل الكوفة وغيرهم وبه يقول أحمد وإسحاق ‏.‏ وقال بعضهم من كان اليوم على مثل حال هؤلاء ورأى الإمام أن يتألفهم على الإسلام فأعطاهم جاز ذلك ‏.‏ وهو قول الشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 667,
			"arabicnumber": 667,
			"text": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال كنت جالسا عند النبي صلى الله عليه وسلم إذ أتته امرأة فقالت يا رسول الله إني كنت تصدقت على أمي بجارية وإنها ماتت ‏.‏ قال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنها كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت يا رسول الله إنها لم تحج قط أفأحج عنها قال ‏\"‏ نعم حجي عنها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ولا يعرف هذا من حديث بريدة إلا من هذا الوجه ‏.‏ وعبد الله بن عطاء ثقة عند أهل الحديث ‏.‏ والعمل على هذا عند أكثر أهل العلم أن الرجل إذا تصدق بصدقة ثم ورثها حلت له ‏.‏ وقال بعضهم إنما الصدقة شيء جعلها لله فإذا ورثها فيجب أن يصرفها في مثله ‏.‏ وروى سفيان الثوري وزهير بن معاوية هذا الحديث عن عبد الله بن عطاء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 668,
			"arabicnumber": 668,
			"text": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبد الرزاق، عن معمر، عن الزهري، عن سالم، عن ابن عمر، عن عمر، أنه حمل على فرس في سبيل الله ثم رآها تباع فأراد أن يشتريها فقال النبي صلى الله عليه وسلم ‏ \"‏ لا تعد في صدقتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 669,
			"arabicnumber": 669,
			"text": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا زكريا بن إسحاق، حدثني عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، قال يا رسول الله إن أمي توفيت أفينفعها إن تصدقت عنها قال ‏ \"‏ نعم ‏\"‏ ‏.‏ قال فإن لي مخرفا فأشهدك أني قد تصدقت به عنها ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وبه يقول أهل العلم ‏.‏ يقولون ليس شيء يصل إلى الميت إلا الصدقة والدعاء ‏.‏ وقد روى بعضهم هذا الحديث عن عمرو بن دينار عن عكرمة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال ومعنى قوله إن لي مخرفا ‏.‏ يعني بستانا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 670,
			"arabicnumber": 670,
			"text": "حدثنا هناد، حدثنا إسماعيل بن عياش، حدثنا شرحبيل بن مسلم الخولاني، عن أبي أمامة الباهلي، قال سمعت رسول الله صلى الله عليه وسلم في خطبته عام حجة الوداع يقول ‏\"‏ لا تنفق امرأة شيئا من بيت زوجها إلا بإذن زوجها ‏\"‏ ‏.‏ قيل يا رسول الله ولا الطعام قال ‏\"‏ ذاك أفضل أموالنا ‏\"‏ ‏.‏ وفي الباب عن سعد بن أبي وقاص وأسماء بنت أبي بكر وأبي هريرة وعبد الله بن عمرو وعائشة ‏.‏ قال أبو عيسى حديث أبي أمامة حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 671,
			"arabicnumber": 671,
			"text": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، يحدث عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ إذا تصدقت المرأة من بيت زوجها كان لها به أجر وللزوج مثل ذلك وللخازن مثل ذلك ولا ينقص كل واحد منهم من أجر صاحبه شيئا له بما كسب ولها بما أنفقت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 672,
			"arabicnumber": 672,
			"text": "حدثنا محمود بن غيلان، حدثنا المؤمل، عن سفيان، عن منصور، عن أبي وائل، عن مسروق، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أعطت المرأة من بيت زوجها بطيب نفس غير مفسدة كان لها مثل أجره لها ما نوت حسنا وللخازن مثل ذلك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهذا أصح من حديث عمرو بن مرة عن أبي وائل وعمرو بن مرة لا يذكر في حديثه عن مسروق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 673,
			"arabicnumber": 673,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن زيد بن أسلم، عن عياض بن عبد الله، عن أبي سعيد الخدري، قال كنا نخرج زكاة الفطر إذ كان فينا رسول الله صلى الله عليه وسلم - صاعا من طعام أو صاعا من شعير أو صاعا من تمر أو صاعا من زبيب أو صاعا من أقط فلم نزل نخرجه حتى قدم معاوية المدينة فتكلم فكان فيما كلم به الناس إني لأرى مدين من سمراء الشام تعدل صاعا من تمر ‏.‏ قال فأخذ الناس بذلك ‏.‏ قال أبو سعيد فلا أزال أخرجه كما كنت أخرجه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم يرون من كل شيء صاعا ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم من كل شيء صاع إلا من البر فإنه يجزئ نصف صاع ‏.‏ وهو قول سفيان الثوري وابن المبارك وأهل الكوفة يرون نصف صاع من بر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 674,
			"arabicnumber": 674,
			"text": "حدثنا عقبة بن مكرم البصري، حدثنا سالم بن نوح، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعث مناديا في فجاج مكة ‏ \"‏ ألا إن صدقة الفطر واجبة على كل مسلم ذكر أو أنثى حر أو عبد صغير أو كبير مدان من قمح أو سواه صاع من طعام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى عمر بن هارون هذا الحديث عن ابن جريج وقال عن العباس بن ميناء عن النبي صلى الله عليه وسلم فذكر بعض هذا الحديث ‏.‏ حدثنا جارود حدثنا عمر بن هارون هذا الحديث",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 675,
			"arabicnumber": 675,
			"text": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال فرض رسول الله صلى الله عليه وسلم صدقة الفطر على الذكر والأنثى والحر والمملوك صاعا من تمر أو صاعا من شعير ‏.‏ قال فعدل الناس إلى نصف صاع من بر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي سعيد وابن عباس وجد الحارث بن عبد الرحمن بن أبي ذباب وثعلبة بن أبي صعير وعبد الله بن عمرو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 676,
			"arabicnumber": 676,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر من رمضان صاعا من تمر أو صاعا من شعير على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وروى مالك عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم نحو حديث أيوب وزاد فيه من المسلمين ‏.‏ ورواه غير واحد عن نافع ولم يذكر فيه من المسلمين ‏.‏ واختلف أهل العلم في هذا فقال بعضهم إذا كان للرجل عبيد غير مسلمين لم يؤد عنهم صدقة الفطر ‏.‏ وهو قول مالك والشافعي وأحمد ‏.‏ وقال بعضهم يؤدي عنهم وإن كانوا غير مسلمين ‏.‏ وهو قول الثوري وابن المبارك وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 677,
			"arabicnumber": 677,
			"text": "حدثنا مسلم بن عمرو بن مسلم أبو عمرو الحذاء المدني، حدثني عبد الله بن نافع الصائغ، عن ابن أبي الزناد، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يأمر بإخراج الزكاة قبل الغدو للصلاة يوم الفطر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وهو الذي يستحبه أهل العلم أن يخرج الرجل صدقة الفطر قبل الغدو إلى الصلاة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 678,
			"arabicnumber": 678,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا سعيد بن منصور، حدثنا إسماعيل بن زكريا، عن الحجاج بن دينار، عن الحكم بن عتيبة، عن حجية بن عدي، عن علي، أن العباس، سأل رسول الله صلى الله عليه وسلم عن تعجيل صدقته قبل أن تحل فرخص له في ذلك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 679,
			"arabicnumber": 679,
			"text": "حدثنا القاسم بن دينار الكوفي، حدثنا إسحاق بن منصور، عن إسرائيل، عن الحجاج بن دينار، عن الحكم بن جحل، عن حجر العدوي، عن علي، أن النبي صلى الله عليه وسلم قال لعمر ‏ \"‏ إنا قد أخذنا زكاة العباس عام الأول للعام ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى لا أعرف حديث تعجيل الزكاة من حديث إسرائيل عن الحجاج بن دينار إلا من هذا الوجه وحديث إسماعيل بن زكريا عن الحجاج عندي أصح من حديث إسرائيل عن الحجاج بن دينار ‏.‏ وقد روي هذا الحديث عن الحكم بن عتيبة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ وقد اختلف أهل العلم في تعجيل الزكاة قبل محلها فرأى طائفة من أهل العلم أن لا يعجلها ‏.‏ وبه يقول سفيان الثوري قال أحب إلى أن لا يعجلها ‏.‏ وقال أكثر أهل العلم إن عجلها قبل محلها أجزأت عنه ‏.‏ وبه يقول الشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 680,
			"arabicnumber": 680,
			"text": "حدثنا هناد، حدثنا أبو الأحوص، عن بيان بن بشر، عن قيس بن أبي حازم، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لأن يغدو أحدكم فيحتطب على ظهره فيتصدق منه فيستغني به عن الناس خير له من أن يسأل رجلا أعطاه أو منعه ذلك فإن اليد العليا أفضل من اليد السفلى وابدأ بمن تعول ‏\"‏ ‏.‏ قال وفي الباب عن حكيم بن حزام وأبي سعيد الخدري والزبير بن العوام وعطية السعدي وعبد الله بن مسعود ومسعود بن عمرو وابن عباس وثوبان وزياد بن الحارث الصدائي وأنس وحبشي بن جنادة وقبيصة بن مخارق وسمرة وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب يستغرب من حديث بيان عن قيس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 681,
			"arabicnumber": 681,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن عبد الملك بن عمير، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن المسألة كد يكد بها الرجل وجهه إلا أن يسأل الرجل سلطانا أو في أمر لا بد منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 65
			}
		}
	]
}