{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 682,
			"arabicnumber": 682,
			"text": "حدثنا أبو كريب، محمد بن العلاء بن كريب حدثنا أبو بكر بن عياش، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا كان أول ليلة من شهر رمضان صفدت الشياطين ومردة الجن وغلقت أبواب النار فلم يفتح منها باب. وفتحت أبواب الجنة فلم يغلق منها باب وينادي مناد يا باغي الخير أقبل ويا باغي الشر أقصر ولله عتقاء من النار وذلك كل ليلة ‏\"‏ ‏.‏ قال وفي الباب عن عبد الرحمن بن عوف وابن مسعود وسلمان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 683,
			"arabicnumber": 683,
			"text": "حدثنا هناد، حدثنا عبدة، والمحاربي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام رمضان وقامه إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏ قال أبو عيسى حديث أبي هريرة الذي رواه أبو بكر بن عياش حديث غريب لا نعرفه من رواية أبي بكر بن عياش عن الأعمش عن أبي صالح عن أبي هريرة إلا من حديث أبي بكر ‏.‏ قال وسألت محمد بن إسماعيل عن هذا الحديث، فقال حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن مجاهد، قوله ‏\"‏ إذا كان أول ليلة من شهر رمضان ‏\"‏ ‏.‏ فذكر الحديث ‏.‏ قال محمد وهذا أصح عندي من حديث أبي بكر بن عياش ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 684,
			"arabicnumber": 684,
			"text": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏ \"‏ لا تقدموا الشهر بيوم ولا بيومين إلا أن يوافق ذلك صوما كان يصومه أحدكم صوموا لرؤيته وأفطروا لرؤيته فإن غم عليكم فعدوا ثلاثين ثم أفطروا ‏\"‏ ‏.‏ روى منصور بن المعتمر عن ربعي بن حراش عن بعض أصحاب النبي صلى الله عليه وسلم بنحو هذا ‏.‏ قال وفي الباب عن بعض أصحاب النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم كرهوا أن يتعجل الرجل بصيام قبل دخول شهر رمضان لمعنى رمضان وإن كان رجل يصوم صوما فوافق صيامه ذلك فلا بأس به عندهم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 685,
			"arabicnumber": 685,
			"text": "حدثنا هناد، حدثنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تقدموا شهر رمضان بصيام قبله بيوم أو يومين إلا أن يكون رجل كان يصوم صوما فليصمه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 686,
			"arabicnumber": 686,
			"text": "حدثنا أبو سعيد عبد الله بن سعيد الأشج، حدثنا أبو خالد الأحمر، عن عمرو بن قيس الملائي، عن أبي إسحاق، عن صلة بن زفر، قال كنا عند عمار بن ياسر فأتي بشاة مصلية فقال كلوا ‏.‏ فتنحى بعض القوم فقال إني صائم ‏.‏ فقال عمار من صام اليوم الذي يشك فيه الناس فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏ قال وفي الباب عن أبي هريرة وأنس ‏.‏ قال أبو عيسى حديث عمار حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين وبه يقول سفيان الثوري ومالك بن أنس وعبد الله بن المبارك والشافعي وأحمد وإسحاق كرهوا أن يصوم الرجل اليوم الذي يشك فيه ورأى أكثرهم إن صامه فكان من شهر رمضان أن يقضي يوما مكانه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 687,
			"arabicnumber": 687,
			"text": "حدثنا مسلم بن حجاج، حدثنا يحيى بن يحيى، حدثنا أبو معاوية، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحصوا هلال شعبان لرمضان ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة لا نعرفه مثل هذا إلا من حديث أبي معاوية ‏.‏ والصحيح ما روي عن محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقدموا شهر رمضان بيوم ولا يومين ‏\"‏ ‏.‏ وهكذا روي عن يحيى بن أبي كثير عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم نحو حديث محمد بن عمرو الليثي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 688,
			"arabicnumber": 688,
			"text": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا تصوموا قبل رمضان صوموا لرؤيته وأفطروا لرؤيته فإن حالت دونه غياية فأكملوا ثلاثين يوما ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وأبي بكرة وابن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح وقد روي عنه من غير وجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": 689,
			"text": "حدثنا أحمد بن منيع، حدثنا يحيى بن زكريا بن أبي زائدة، أخبرني عيسى بن دينار، عن أبيه، عن عمرو بن الحارث بن أبي ضرار، عن ابن مسعود، قال ما صمت مع النبي صلى الله عليه وسلم تسعا وعشرين أكثر مما صمنا ثلاثين ‏.‏ قال وفي الباب عن عمر وأبي هريرة وعائشة وسعد بن أبي وقاص وابن عباس وابن عمر وأنس وجابر وأم سلمة وأبي بكرة أن النبي صلى الله عليه وسلم قال ‏ \"‏ الشهر يكون تسعا وعشرين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 690,
			"arabicnumber": 690,
			"text": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، أنه قال آلى رسول الله صلى الله عليه وسلم من نسائه شهرا فأقام في مشربة تسعا وعشرين يوما قالوا يا رسول الله إنك آليت شهرا فقال ‏ \"‏ الشهر تسع وعشرون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 691,
			"arabicnumber": 691,
			"text": "حدثنا محمد بن إسماعيل، حدثنا محمد بن الصباح، حدثنا الوليد بن أبي ثور، عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال إني رأيت الهلال ‏.‏ قال ‏\"‏ أتشهد أن لا إله إلا الله أتشهد أن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس أن يصوموا غدا ‏\"‏ ‏.‏ حدثنا أبو كريب، حدثنا حسين الجعفي، عن زائدة، عن سماك، نحوه بهذا الإسناد ‏.‏ قال أبو عيسى حديث ابن عباس فيه اختلاف ‏.‏ وروى سفيان الثوري، وغيره، عن سماك، عن عكرمة، عن النبي صلى الله عليه وسلم مرسلا وأكثر أصحاب سماك رووا عن سماك عن عكرمة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ والعمل على هذا الحديث عند أكثر أهل العلم قالوا تقبل شهادة رجل واحد في الصيام ‏.‏ وبه يقول ابن المبارك والشافعي وأحمد وأهل الكوفة ‏.‏ قال إسحاق لا يصام إلا بشهادة رجلين ‏.‏ ولم يختلف أهل العلم في الإفطار أنه لا يقبل فيه إلا شهادة رجلين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 692,
			"arabicnumber": 692,
			"text": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شهرا عيد لا ينقصان رمضان وذو الحجة ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي بكرة حديث حسن ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن أبي بكرة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال أحمد معنى هذا الحديث ‏\"‏ شهرا عيد لا ينقصان ‏\"‏ ‏.‏ يقول لا ينقصان معا في سنة واحدة شهر رمضان وذو الحجة إن نقص أحدهما تم الآخر ‏.‏ وقال إسحاق معناه ‏\"‏ لا ينقصان ‏\"‏ يقول وإن كان تسعا وعشرين فهو تمام غير نقصان ‏.‏ وعلى مذهب إسحاق يكون ينقص الشهران معا في سنة واحدة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 693,
			"arabicnumber": 693,
			"text": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، حدثنا محمد بن أبي حرملة، أخبرني كريب، أن أم الفضل بنت الحارث، بعثته إلى معاوية بالشام ‏.‏ قال فقدمت الشام فقضيت حاجتها واستهل على هلال رمضان وأنا بالشام فرأينا الهلال ليلة الجمعة ثم قدمت المدينة في آخر الشهر فسألني ابن عباس ثم ذكر الهلال فقال متى رأيتم الهلال فقلت رأيناه ليلة الجمعة ‏.‏ فقال أأنت رأيته ليلة الجمعة فقلت رآه الناس وصاموا وصام معاوية ‏.‏ قال لكن رأيناه ليلة السبت فلا نزال نصوم حتى نكمل ثلاثين يوما أو نراه ‏.‏ فقلت ألا تكتفي برؤية معاوية وصيامه قال لا هكذا أمرنا رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح غريب ‏.‏ والعمل على هذا الحديث عند أهل العلم أن لكل أهل بلد رؤيتهم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 694,
			"arabicnumber": 694,
			"text": "حدثنا محمد بن عمر بن علي المقدمي، حدثنا سعيد بن عامر، حدثنا شعبة، عن عبد العزيز بن صهيب، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من وجد تمرا فليفطر عليه ومن لا فليفطر على ماء فإن الماء طهور ‏\"‏ ‏.‏ قال وفي الباب عن سلمان بن عامر ‏.‏ قال أبو عيسى حديث أنس لا نعلم أحدا رواه عن شعبة مثل هذا غير سعيد بن عامر وهو حديث غير محفوظ ولا نعلم له أصلا من حديث عبد العزيز بن صهيب عن أنس ‏.‏ وقد روى أصحاب شعبة هذا الحديث عن شعبة عن عاصم الأحول عن حفصة بنت سيرين عن الرباب عن سلمان بن عامر عن النبي صلى الله عليه وسلم وهو أصح من حديث سعيد بن عامر ‏.‏ وهكذا رووا عن شعبة عن عاصم عن حفصة بنت سيرين عن سلمان ولم يذكر فيه شعبة عن الرباب ‏.‏ والصحيح ما رواه سفيان الثوري وابن عيينة وغير واحد عن عاصم الأحول عن حفصة بنت سيرين عن الرباب عن سلمان بن عامر ‏.‏ وابن عون يقول عن أم الرائح بنت صليع عن سلمان بن عامر ‏.‏ والرباب هي أم الرائح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 695,
			"arabicnumber": 695,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن عاصم الأحول، ح وحدثنا هناد، حدثنا أبو معاوية، عن عاصم الأحول، ‏.‏ وحدثنا قتيبة، قال أنبأنا سفيان بن عيينة، عن عاصم الأحول، عن حفصة بنت سيرين، عن الرباب، عن سلمان بن عامر الضبي، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أفطر أحدكم فليفطر على تمر ‏\"‏ ‏.‏ زاد ابن عيينة ‏\"‏ فإنه بركة فمن لم يجد فليفطر على ماء فإنه طهور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 696,
			"arabicnumber": 696,
			"text": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا جعفر بن سليمان، عن ثابت، عن أنس بن مالك، قال ‏ \"‏ كان النبي صلى الله عليه وسلم يفطر قبل أن يصلي على رطبات فإن لم تكن رطبات فتميرات فإن لم تكن تميرات حسا حسوات من ماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال أبو عيسى وروي أن رسول الله صلى الله عليه وسلم كان يفطر في الشتاء على تمرات وفي الصيف على الماء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 697,
			"arabicnumber": 697,
			"text": "أخبرني محمد بن إسماعيل، حدثنا إبراهيم بن المنذر، حدثنا إسحاق بن جعفر بن محمد، حدثني عبد الله بن جعفر، عن عثمان بن محمد الأخنسي، عن سعيد المقبري، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ الصوم يوم تصومون والفطر يوم تفطرون والأضحى يوم تضحون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وفسر بعض أهل العلم هذا الحديث فقال إنما معنى هذا أن الصوم والفطر مع الجماعة وعظم الناس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 698,
			"arabicnumber": 698,
			"text": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن عاصم بن عمر، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا أقبل الليل وأدبر النهار وغابت الشمس فقد أفطرت ‏\"‏ ‏.‏ قال وفي الباب عن ابن أبي أوفى وأبي سعيد ‏.‏ قال أبو عيسى حديث عمر حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 699,
			"arabicnumber": 699,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبي حازم، ح قال وأخبرنا أبو مصعب، قراءة عن مالك بن أنس، عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يزال الناس بخير ما عجلوا الفطر ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وابن عباس وعائشة وأنس بن مالك ‏.‏ قال أبو عيسى حديث سهل بن سعد حديث حسن صحيح ‏.‏ وهو الذي اختاره أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم استحبوا تعجيل الفطر ‏.‏ وبه يقول الشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 700,
			"arabicnumber": 700,
			"text": "حدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، عن الأوزاعي، عن قرة بن عبد الرحمن، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ قال الله عز وجل أحب عبادي إلى أعجلهم فطرا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 701,
			"arabicnumber": 701,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا أبو عاصم، وأبو المغيرة، عن الأوزاعي، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 702,
			"arabicnumber": 702,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي عطية، قال دخلت أنا ومسروق، على عائشة فقلنا يا أم المؤمنين رجلان من أصحاب النبي صلى الله عليه وسلم أحدهما يعجل الإفطار ويعجل الصلاة والآخر يؤخر الإفطار ويؤخر الصلاة ‏.‏ قالت أيهما يعجل الإفطار ويعجل الصلاة قلنا عبد الله بن مسعود ‏.‏ قالت هكذا صنع رسول الله صلى الله عليه وسلم ‏.‏ والآخر أبو موسى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو عطية اسمه مالك بن أبي عامر الهمداني ويقال مالك بن عامر الهمداني وابن عامر أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 703,
			"arabicnumber": 703,
			"text": "حدثنا يحيى بن موسى، حدثنا أبو داود الطيالسي، حدثنا هشام الدستوائي، عن قتادة، عن أنس بن مالك، عن زيد بن ثابت، قال تسحرنا مع النبي صلى الله عليه وسلم ثم قمنا إلى الصلاة ‏.‏ قال قلت كم كان قدر ذلك قال قدر خمسين آية ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 704,
			"arabicnumber": 704,
			"text": "حدثنا هناد، حدثنا وكيع، عن هشام، بنحوه إلا أنه قال قدر قراءة خمسين آية ‏.‏ قال وفي الباب عن حذيفة ‏.‏ قال أبو عيسى حديث زيد بن ثابت حديث حسن صحيح ‏.‏ وبه يقول الشافعي وأحمد وإسحاق استحبوا تأخير السحور ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 705,
			"arabicnumber": 705,
			"text": "حدثنا هناد، حدثنا ملازم بن عمرو، حدثني عبد الله بن النعمان، عن قيس بن طلق، حدثني أبي طلق بن علي، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ كلوا واشربوا ولا يهيدنكم الساطع المصعد وكلوا واشربوا حتى يعترض لكم الأحمر ‏\"‏ ‏.‏ قال وفي الباب عن عدي بن حاتم وأبي ذر وسمرة ‏.‏ قال أبو عيسى حديث طلق بن علي حديث حسن غريب من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم أنه لا يحرم على الصائم الأكل والشرب حتى يكون الفجر الأحمر المعترض ‏.‏ وبه يقول عامة أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "حدثنا هناد، ويوسف بن عيسى، قالا حدثنا وكيع، عن أبي هلال، عن سوادة بن حنظلة، هو القشيري عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يمنعنكم من سحوركم أذان بلال ولا الفجر المستطيل ولكن الفجر المستطير في الأفق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": 707,
			"text": "حدثنا أبو موسى، محمد بن المثنى حدثنا عثمان بن عمر، أخبرنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من لم يدع قول الزور والعمل به فليس لله حاجة بأن يدع طعامه وشرابه ‏\"‏ ‏.‏ قال وفي الباب عن أنس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": 708,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن قتادة، وعبد العزيز بن صهيب، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏ \"‏ تسحروا فإن في السحور بركة ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعبد الله بن مسعود وجابر بن عبد الله وابن عباس وعمرو بن العاص والعرباض بن سارية وعتبة بن عبد وأبي الدرداء ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "وروي عن النبي صلى الله عليه وسلم أنه قال ‏ \"‏ فصل ما بين صيامنا وصيام أهل الكتاب أكلة السحر ‏\"‏ ‏.‏ حدثنا بذلك قتيبة حدثنا الليث عن موسى بن علي عن أبيه عن أبي قيس مولى عمرو بن العاص عن عمرو بن العاص عن النبي صلى الله عليه وسلم بذلك ‏.‏ قال وهذا حديث حسن صحيح ‏.‏ وأهل مصر يقولون موسى بن علي وأهل العراق يقولون موسى بن على وهو موسى بن علي بن رباح اللخمي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": 710,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم خرج إلى مكة عام الفتح فصام حتى بلغ كراع الغميم وصام الناس معه فقيل له إن الناس قد شق عليهم الصيام وإن الناس ينظرون فيما فعلت ‏.‏ فدعا بقدح من ماء بعد العصر فشرب والناس ينظرون إليه فأفطر بعضهم وصام بعضهم فبلغه أن ناسا صاموا فقال ‏\"‏ أولئك العصاة ‏\"‏ ‏.‏ قال وفي الباب عن كعب بن عاصم وابن عباس وأبي هريرة ‏.‏ قال أبو عيسى حديث جابر حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏ واختلف أهل العلم في الصوم في السفر فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الفطر في السفر أفضل حتى رأى بعضهم عليه الإعادة إذا صام في السفر ‏.‏ واختار أحمد وإسحاق الفطر في السفر ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إن وجد قوة فصام فحسن وهو أفضل وإن أفطر فحسن ‏.‏ وهو قول سفيان الثوري ومالك بن أنس وعبد الله بن المبارك ‏.‏ وقال الشافعي وإنما معنى قول النبي صلى الله عليه وسلم ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏ وقوله حين بلغه أن ناسا صاموا فقال ‏\"‏ أولئك العصاة ‏\"‏ ‏.‏ فوجه هذا إذا لم يحتمل قلبه قبول رخصة الله فأما من رأى الفطر مباحا وصام وقوي على ذلك فهو أعجب إلى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": 711,
			"text": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة، أن حمزة بن عمرو الأسلمي، سأل رسول الله صلى الله عليه وسلم عن الصوم في السفر وكان يسرد الصوم فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏ قال وفي الباب عن أنس بن مالك وأبي سعيد وعبد الله بن مسعود وعبد الله بن عمرو وأبي الدرداء وحمزة بن عمرو الأسلمي ‏.‏ قال أبو عيسى حديث عائشة أن حمزة بن عمرو سأل النبي صلى الله عليه وسلم حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": 712,
			"text": "حدثنا نصر بن علي الجهضمي، حدثنا بشر بن المفضل، عن سعيد بن يزيد أبي مسلمة، عن أبي نضرة، عن أبي سعيد الخدري، قال كنا نسافر مع رسول الله صلى الله عليه وسلم في رمضان فما يعيب على الصائم صومه ولا على المفطر إفطاره ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": 713,
			"text": "حدثنا نصر بن علي، حدثنا يزيد بن زريع، حدثنا الجريري، ح قال وحدثنا سفيان بن وكيع، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي نضرة، عن أبي سعيد الخدري، قال كنا نسافر مع رسول الله صلى الله عليه وسلم فمنا الصائم ومنا المفطر فلا يجد المفطر على الصائم ولا الصائم على المفطر فكانوا يرون أنه من وجد قوة فصام فحسن ومن وجد ضعفا فأفطر فحسن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": 714,
			"text": "حدثنا قتيبة، حدثنا ابن لهيعة، عن يزيد بن أبي حبيب، عن معمر بن أبي حيية، عن ابن المسيب، أنه سأله عن الصوم، في السفر فحدث أن عمر بن الخطاب قال غزونا مع رسول الله صلى الله عليه وسلم في رمضان غزوتين يوم بدر والفتح فأفطرنا فيهما ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى حديث عمر لا نعرفه إلا من هذا الوجه ‏.‏ وقد روي عن أبي سعيد عن النبي صلى الله عليه وسلم أنه أمر بالفطر في غزوة غزاها ‏.‏ وقد روي عن عمر بن الخطاب نحو هذا أنه رخص في الإفطار عند لقاء العدو وبه يقول بعض أهل العلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": 715,
			"text": "حدثنا أبو كريب، ويوسف بن عيسى، قالا حدثنا وكيع، حدثنا أبو هلال، عن عبد الله بن سوادة، عن أنس بن مالك، رجل من بني عبد الله بن كعب قال أغارت علينا خيل رسول الله صلى الله عليه وسلم فأتيت رسول الله صلى الله عليه وسلم فوجدته يتغدى فقال ‏\"‏ ادن فكل ‏\"‏ ‏.‏ فقلت إني صائم ‏.‏ فقال ‏\"‏ ادن أحدثك عن الصوم أو الصيام إن الله تعالى وضع عن المسافر الصوم وشطر الصلاة وعن الحامل أو المرضع الصوم أو الصيام ‏\"‏ ‏.‏ والله لقد قالهما النبي صلى الله عليه وسلم كلتيهما أو إحداهما فيا لهف نفسي أن لا أكون طعمت من طعام النبي صلى الله عليه وسلم ‏.‏ قال وفي الباب عن أبي أمية ‏.‏ قال أبو عيسى حديث أنس بن مالك الكعبي حديث حسن ولا نعرف لأنس بن مالك هذا عن النبي صلى الله عليه وسلم غير هذا الحديث الواحد ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وقال بعض أهل العلم الحامل والمرضع تفطران وتقضيان وتطعمان ‏.‏ وبه يقول سفيان ومالك والشافعي وأحمد ‏.‏ وقال بعضهم تفطران وتطعمان ولا قضاء عليهما وإن شاءتا قضتا ولا إطعام عليهما ‏.‏ وبه يقول إسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": 716,
			"text": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن الأعمش، عن سلمة بن كهيل، ومسلم البطين، عن سعيد بن جبير، وعطاء، ومجاهد، عن ابن عباس، قال جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إن أختي ماتت وعليها صوم شهرين متتابعين ‏.‏ قال ‏\"‏ أرأيت لو كان على أختك دين أكنت تقضينه ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ فحق الله أحق ‏\"‏ ‏.‏ قال وفي الباب عن بريدة وابن عمر وعائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن الأعمش، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ قال وسمعت محمدا، يقول جود أبو خالد الأحمر هذا الحديث عن الأعمش، ‏.‏ قال محمد وقد روى غير أبي خالد، عن الأعمش، مثل رواية أبي خالد ‏.‏ قال أبو عيسى وروى أبو معاوية، وغير، واحد، هذا الحديث عن الأعمش، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكروا فيه سلمة بن كهيل ولا عن عطاء ولا عن مجاهد ‏.‏ واسم أبي خالد سليمان بن حيان ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": 718,
			"text": "حدثنا قتيبة، حدثنا عبثر بن القاسم، عن أشعث، عن محمد، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من مات وعليه صيام شهر فليطعم عنه مكان كل يوم مسكينا ‏\"‏ ‏.‏ قال أبو عيسى حديث ابن عمر لا نعرفه مرفوعا إلا من هذا الوجه والصحيح عن ابن عمر موقوف قوله ‏.‏ واختلف أهل العلم في هذا الباب فقال بعضهم يصام عن الميت ‏.‏ وبه يقول أحمد وإسحاق قالا إذا كان على الميت نذر صيام يصوم عنه وإذا كان عليه قضاء رمضان أطعم عنه ‏.‏ وقال مالك وسفيان والشافعي لا يصوم أحد عن أحد ‏.‏ قال وأشعث هو ابن سوار ‏.‏ ومحمد هو عندي ابن عبد الرحمن بن أبي ليلى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": 719,
			"text": "حدثنا محمد بن عبيد المحاربي، حدثنا عبد الرحمن بن زيد بن أسلم، عن أبيه، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ثلاث لا يفطرن الصائم الحجامة والقىء والاحتلام ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي سعيد الخدري حديث غير محفوظ ‏.‏ وقد روى عبد الله بن زيد بن أسلم وعبد العزيز بن محمد وغير واحد هذا الحديث عن زيد بن أسلم مرسلا ‏.‏ ولم يذكروا فيه عن أبي سعيد ‏.‏ وعبد الرحمن بن زيد بن أسلم يضعف في الحديث ‏.‏ قال سمعت أبا داود السجزي يقول سألت أحمد بن حنبل عن عبد الرحمن بن زيد بن أسلم فقال أخوه عبد الله بن زيد لا بأس به ‏.‏ قال وسمعت محمدا يذكر عن علي بن عبد الله المديني قال عبد الله بن زيد بن أسلم ثقة وعبد الرحمن بن زيد بن أسلم ضعيف ‏.‏ قال محمد ولا أروي عنه شيئا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": 720,
			"text": "حدثنا علي بن حجر، حدثنا عيسى بن يونس، عن هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ من ذرعه القىء فليس عليه قضاء ومن استقاء عمدا فليقض ‏\"‏ ‏.‏ قال وفي الباب عن أبي الدرداء وثوبان وفضالة بن عبيد ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب لا نعرفه من حديث هشام عن ابن سيرين عن أبي هريرة عن النبي صلى الله عليه وسلم إلا من حديث عيسى بن يونس ‏.‏ وقال محمد لا أراه محفوظا ‏.‏ قال أبو عيسى وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ولا يصح إسناده ‏.‏ وقد روي عن أبي الدرداء وثوبان وفضالة بن عبيد أن النبي صلى الله عليه وسلم قاء فأفطر ‏.‏ وإنما معنى هذا أن النبي صلى الله عليه وسلم كان صائما متطوعا فقاء فضعف فأفطر لذلك ‏.‏ هكذا روي في بعض الحديث مفسرا ‏.‏ والعمل عند أهل العلم على حديث أبي هريرة عن النبي صلى الله عليه وسلم أن الصائم إذا ذرعه القىء فلا قضاء عليه وإذا استقاء عمدا فليقض ‏.‏ وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": 721,
			"text": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن حجاج بن أرطاة، عن قتادة، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أكل أو شرب ناسيا فلا يفطر فإنما هو رزق رزقه الله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": 722,
			"text": "حدثنا أبو سعيد الأشج، حدثنا أبو أسامة، عن عوف، عن ابن سيرين، وخلاس، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله أو نحوه ‏.‏ قال وفي الباب عن أبي سعيد وأم إسحاق الغنوية ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ وقال مالك بن أنس إذا أكل في رمضان ناسيا فعليه القضاء ‏.‏ والقول الأول أصح ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": 723,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، قالا حدثنا سفيان، عن حبيب بن أبي ثابت، حدثنا أبو المطوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من أفطر يوما من رمضان من غير رخصة ولا مرض لم يقض عنه صوم الدهر كله وإن صامه ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة لا نعرفه إلا من هذا الوجه ‏.‏ وسمعت محمدا يقول أبو المطوس اسمه يزيد بن المطوس ولا أعرف له غير هذا الحديث ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "حدثنا نصر بن علي الجهضمي، وأبو عمار والمعنى واحد واللفظ لفظ أبي عمار قالا أخبرنا سفيان بن عيينة، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال أتاه رجل فقال يا رسول الله هلكت ‏.‏ قال ‏\"‏ وما أهلكك ‏\"‏ ‏.‏ قال وقعت على امرأتي في رمضان ‏.‏ قال ‏\"‏ هل تستطيع أن تعتق رقبة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فهل تستطيع أن تصوم شهرين متتابعين ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فهل تستطيع أن تطعم ستين مسكينا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فجلس فأتي النبي صلى الله عليه وسلم بعرق فيه تمر - والعرق المكتل الضخم قال ‏\"‏ تصدق به ‏\"‏ ‏.‏ فقال ما بين لابتيها أحد أفقر منا ‏.‏ قال فضحك النبي صلى الله عليه وسلم حتى بدت أنيابه ‏.‏ قال ‏\"‏ فخذه فأطعمه أهلك ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وعائشة وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أهل العلم في من أفطر في رمضان متعمدا من جماع وأما من أفطر متعمدا من أكل أو شرب فإن أهل العلم قد اختلفوا في ذلك فقال بعضهم عليه القضاء والكفارة ‏.‏ وشبهوا الأكل والشرب بالجماع ‏.‏ وهو قول سفيان الثوري وابن المبارك وإسحاق ‏.‏ وقال بعضهم عليه القضاء ولا كفارة عليه لأنه إنما ذكر عن النبي صلى الله عليه وسلم الكفارة في الجماع ولم تذكر عنه في الأكل والشرب ‏.‏ وقالوا لا يشبه الأكل والشرب الجماع ‏.‏ وهو قول الشافعي وأحمد ‏.‏ وقال الشافعي وقول النبي صلى الله عليه وسلم للرجل الذي أفطر فتصدق عليه ‏\"‏ خذه فأطعمه أهلك ‏\"‏ ‏.‏ يحتمل هذا معاني يحتمل أن تكون الكفارة على من قدر عليها وهذا رجل لم يقدر على الكفارة فلما أعطاه النبي صلى الله عليه وسلم شيئا وملكه فقال الرجل ما أحد أفقر إليه منا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ خذه فأطعمه أهلك ‏\"‏ ‏.‏ لأن الكفارة إنما تكون بعد الفضل عن قوته ‏.‏ واختار الشافعي لمن كان على مثل هذا الحال أن يأكله وتكون الكفارة عليه دينا فمتى ما ملك يوما ما كفر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال رأيت النبي صلى الله عليه وسلم ما لا أحصي يتسوك وهو صائم ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث عامر بن ربيعة حديث حسن ‏.‏ والعمل على هذا عند أهل العلم لا يرون بالسواك للصائم بأسا إلا أن بعض أهل العلم كرهوا السواك للصائم بالعود الرطب وكرهوا له السواك آخر النهار ولم ير الشافعي بالسواك بأسا أول النهار ولا آخره وكره أحمد وإسحاق السواك آخر النهار ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "حدثنا عبد الأعلى بن واصل الكوفي، حدثنا الحسن بن عطية، حدثنا أبو عاتكة، عن أنس بن مالك، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال اشتكت عيني أفأكتحل وأنا صائم قال ‏ \"‏ نعم ‏\"‏ ‏.‏ قال وفي الباب عن أبي رافع ‏.‏ قال أبو عيسى حديث أنس حديث ليس إسناده بالقوي ولا يصح عن النبي صلى الله عليه وسلم في هذا الباب شيء ‏.‏ وأبو عاتكة يضعف ‏.‏ واختلف أهل العلم في الكحل للصائم فكرهه بعضهم وهو قول سفيان وابن المبارك وأحمد وإسحاق ‏.‏ ورخص بعض أهل العلم في الكحل للصائم وهو قول الشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": 727,
			"text": "حدثنا هناد، وقتيبة، قالا حدثنا أبو الأحوص، عن زياد بن علاقة، عن عمرو بن ميمون، عن عائشة، أن النبي صلى الله عليه وسلم كان يقبل في شهر الصوم ‏.‏ قال وفي الباب عن عمر بن الخطاب وحفصة وأبي سعيد وأم سلمة وابن عباس وأنس وأبي هريرة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ واختلف أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم في القبلة للصائم فرخص بعض أصحاب النبي صلى الله عليه وسلم في القبلة للشيخ ولم يرخصوا للشاب مخافة أن لا يسلم له صومه والمباشرة عندهم أشد ‏.‏ وقد قال بعض أهل العلم القبلة تنقص الأجر ولا تفطر الصائم ‏.‏ ورأوا أن للصائم إذا ملك نفسه أن يقبل وإذا لم يأمن على نفسه ترك القبلة ليسلم له صومه ‏.‏ وهو قول سفيان الثوري والشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": 728,
			"text": "حدثنا ابن أبي عمر، حدثنا وكيع، حدثنا إسرائيل، عن أبي إسحاق، عن أبي ميسرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يباشرني وهو صائم وكان أملككم لإربه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": 729,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن علقمة، والأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقبل ويباشر وهو صائم وكان أملككم لإربه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو ميسرة اسمه عمرو بن شرحبيل ‏.‏ ومعنى لإربه لنفسه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": 730,
			"text": "حدثنا إسحاق بن منصور، أخبرنا ابن أبي مريم، أخبرنا يحيى بن أيوب، عن عبد الله بن أبي بكر، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من لم يجمع الصيام قبل الفجر فلا صيام له ‏\"‏ ‏.‏ قال أبو عيسى حديث حفصة حديث لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ وقد روي عن نافع عن ابن عمر قوله وهو أصح وهكذا أيضا روي هذا الحديث عن الزهري موقوفا ولا نعلم أحدا رفعه إلا يحيى بن أيوب ‏.‏ وإنما معنى هذا عند أهل العلم لا صيام لمن لم يجمع الصيام قبل طلوع الفجر في رمضان أو في قضاء رمضان أو في صيام نذر إذا لم ينوه من الليل لم يجزه وأما صيام التطوع فمباح له أن ينويه بعد ما أصبح وهو قول الشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": 731,
			"text": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن ابن أم هانئ، عن أم هانئ، قالت كنت قاعدة عند النبي صلى الله عليه وسلم فأتي بشراب فشرب منه ثم ناولني فشربت منه فقلت إني أذنبت فاستغفر لي ‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالت كنت صائمة فأفطرت ‏.‏ فقال ‏\"‏ أمن قضاء كنت تقضينه ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ فلا يضرك ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وعائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": 732,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، حدثنا شعبة، قال كنت أسمع سماك بن حرب يقول أحد ابنى أم هانئ حدثني فلقيت، أنا أفضلهما، وكان، اسمه جعدة وكانت أم هانئ جدته فحدثني عن جدته أن رسول الله صلى الله عليه وسلم دخل عليها فدعى بشراب فشرب ثم ناولها فشربت فقالت يا رسول الله أما إني كنت صائمة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الصائم المتطوع أمين نفسه إن شاء صام وإن شاء أفطر ‏\"‏ ‏.‏ قال شعبة فقلت له أأنت سمعت هذا من أم هانئ قال لا أخبرني أبو صالح وأهلنا عن أم هانئ ‏.‏ وروى حماد بن سلمة هذا الحديث عن سماك بن حرب فقال عن هارون ابن بنت أم هانئ عن أم هانئ ‏.‏ ورواية شعبة أحسن ‏.‏ هكذا حدثنا محمود بن غيلان عن أبي داود فقال ‏\"‏ أمين نفسه ‏\"‏ ‏.‏ وحدثنا غير محمود عن أبي داود فقال ‏\"‏ أمير نفسه أو أمين نفسه ‏\"‏ ‏.‏ على الشك وهكذا روي من غير وجه عن شعبة ‏\"‏ أمين أو أمير نفسه ‏\"‏ على الشك ‏.‏ قال وحديث أم هانئ في إسناده مقال ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الصائم المتطوع إذا أفطر فلا قضاء عليه إلا أن يحب أن يقضيه ‏.‏ وهو قول سفيان الثوري وأحمد وإسحاق والشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": 733,
			"text": "حدثنا هناد، حدثنا وكيع، عن طلحة بن يحيى، عن عمته، عائشة بنت طلحة عن عائشة أم المؤمنين، قالت دخل على رسول الله صلى الله عليه وسلم يوما فقال ‏\"‏ هل عندكم شيء ‏\"‏ ‏.‏ قالت قلت لا ‏.‏ قال ‏\"‏ فإني صائم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": 734,
			"text": "حدثنا محمود بن غيلان، حدثنا بشر بن السري، عن سفيان، عن طلحة بن يحيى، عن عائشة بنت طلحة، عن عائشة أم المؤمنين، قالت كان النبي صلى الله عليه وسلم يأتيني فيقول ‏\"‏ أعندك غداء ‏\"‏ ‏.‏ فأقول لا ‏.‏ فيقول ‏\"‏ إني صائم ‏\"‏ ‏.‏ قالت فأتاني يوما فقلت يا رسول الله إنه قد أهديت لنا هدية ‏.‏ قال ‏\"‏ وما هي ‏\"‏ ‏.‏ قالت قلت حيس ‏.‏ قال ‏\"‏ أما إني قد أصبحت صائما ‏\"‏ ‏.‏ قالت ثم أكل ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 735,
			"arabicnumber": 735,
			"text": "حدثنا أحمد بن منيع، حدثنا كثير بن هشام، حدثنا جعفر بن برقان، عن الزهري، عن عروة، عن عائشة، قالت كنت أنا وحفصة، صائمتين فعرض لنا طعام اشتهيناه فأكلنا منه فجاء رسول الله صلى الله عليه وسلم فبدرتني إليه حفصة وكانت ابنة أبيها فقالت يا رسول الله إنا كنا صائمتين فعرض لنا طعام اشتهيناه فأكلنا منه ‏.‏ قال ‏ \"‏ اقضيا يوما آخر مكانه ‏\"‏ ‏.‏ قال أبو عيسى وروى صالح بن أبي الأخضر ومحمد بن أبي حفصة هذا الحديث عن الزهري عن عروة عن عائشة مثل هذا ‏.‏ ورواه مالك بن أنس ومعمر وعبيد الله بن عمر وزياد بن سعد وغير واحد من الحفاظ عن الزهري عن عائشة مرسلا ‏.‏ ولم يذكروا فيه عن عروة وهذا أصح ‏.‏ لأنه روي عن ابن جريج، قال سألت الزهري قلت له أحدثك عروة عن عائشة قال لم أسمع من عروة في هذا شيئا ولكني سمعت في خلافة سليمان بن عبد الملك من ناس عن بعض من سأل عائشة عن هذا الحديث ‏.‏ حدثنا بذلك علي بن عيسى بن يزيد البغدادي حدثنا روح بن عبادة عن ابن جريج فذكر الحديث ‏.‏ وقد ذهب قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلى هذا الحديث فرأوا عليه القضاء إذا أفطر وهو قول مالك بن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": 736,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن منصور، عن سالم بن أبي الجعد، عن أبي سلمة، عن أم سلمة، قالت ما رأيت النبي صلى الله عليه وسلم يصوم شهرين متتابعين إلا شعبان ورمضان ‏.‏ وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن ‏.‏ وقد روي هذا الحديث، أيضا عن أبي سلمة، عن عائشة، أنها قالت ما رأيت النبي صلى الله عليه وسلم في شهر أكثر صياما منه في شعبان كان يصومه إلا قليلا بل كان يصومه كله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": 737,
			"text": "حدثنا هناد حدثنا عبدة عن محمد بن عمرو حدثنا أبو سلمة عن عائشة عن النبي صلى الله عليه وسلم بذلك ‏.‏ وروي عن ابن المبارك أنه قال في هذا الحديث هو جائز في كلام العرب إذا صام أكثر الشهر أن يقال صام الشهر كله ويقال قام فلان ليله أجمع ‏.‏ ولعله تعشى واشتغل ببعض أمره ‏.‏ كأن ابن المبارك قد رأى كلا الحديثين متفقين يقول إنما معنى هذا الحديث أنه كان يصوم أكثر الشهر ‏.‏ قال أبو عيسى وقد روى سالم أبو النضر وغير واحد هذا الحديث عن أبي سلمة عن عائشة نحو رواية محمد بن عمرو ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": 738,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا بقي نصف من شعبان فلا تصوموا ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح لا نعرفه إلا من هذا الوجه على هذا اللفظ ‏.‏ ومعنى هذا الحديث عند بعض أهل العلم أن يكون الرجل مفطرا فإذا بقي من شعبان شيء أخذ في الصوم لحال شهر رمضان ‏.‏ وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم ما يشبه قولهم حيث قال صلى الله عليه وسلم ‏\"‏ لا تقدموا شهر رمضان بصيام إلا أن يوافق ذلك صوما كان يصومه أحدكم ‏\"‏ ‏.‏ وقد دل في هذا الحديث أنما الكراهية على من يتعمد الصيام لحال رمضان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": 739,
			"text": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا الحجاج بن أرطاة، عن يحيى بن أبي كثير، عن عروة، عن عائشة، قالت فقدت رسول الله صلى الله عليه وسلم ليلة فخرجت فإذا هو بالبقيع فقال ‏\"‏ أكنت تخافين أن يحيف الله عليك ورسوله ‏\"‏ ‏.‏ قلت يا رسول الله إني ظننت أنك أتيت بعض نسائك ‏.‏ فقال ‏\"‏ إن الله عز وجل ينزل ليلة النصف من شعبان إلى السماء الدنيا فيغفر لأكثر من عدد شعر غنم كلب ‏\"‏ ‏.‏ وفي الباب عن أبي بكر الصديق ‏.‏ قال أبو عيسى حديث عائشة لا نعرفه إلا من هذا الوجه من حديث الحجاج ‏.‏ وسمعت محمدا يضعف هذا الحديث وقال يحيى بن أبي كثير لم يسمع من عروة والحجاج بن أرطاة لم يسمع من يحيى بن أبي كثير ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": 740,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن أبي بشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أفضل الصيام بعد صيام شهر رمضان شهر الله المحرم ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": 741,
			"text": "حدثنا علي بن حجر، قال أخبرنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال سأله رجل فقال أى شهر تأمرني أن أصوم بعد شهر رمضان قال له ما سمعت أحدا يسأل عن هذا إلا رجلا سمعته يسأل رسول الله صلى الله عليه وسلم وأنا قاعد فقال يا رسول الله أى شهر تأمرني أن أصوم بعد شهر رمضان قال ‏ \"‏ إن كنت صائما بعد شهر رمضان فصم المحرم فإنه شهر الله فيه يوم تاب الله فيه على قوم ويتوب فيه على قوم آخرين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 742,
			"arabicnumber": 742,
			"text": "حدثنا القاسم بن دينار، حدثنا عبيد الله بن موسى، وطلق بن غنام، عن شيبان، عن عاصم، عن زر، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يصوم من غرة كل شهر ثلاثة أيام وقلما كان يفطر يوم الجمعة ‏.‏ قال وفي الباب عن ابن عمر وأبي هريرة ‏.‏ قال أبو عيسى حديث عبد الله حديث حسن غريب ‏.‏ وقد استحب قوم من أهل العلم صيام يوم الجمعة وإنما يكره أن يصوم يوم الجمعة لا يصوم قبله ولا بعده ‏.‏ قال وروى شعبة عن عاصم هذا الحديث ولم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 743,
			"arabicnumber": 743,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لا يصوم أحدكم يوم الجمعة إلا أن يصوم قبله أو يصوم بعده ‏\"‏ ‏.‏ قال وفي الباب عن علي وجابر وجنادة الأزدي وجويرية وأنس وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم يكرهون للرجل أن يختص يوم الجمعة بصيام لا يصوم قبله ولا بعده ‏.‏ وبه يقول أحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 744,
			"arabicnumber": 744,
			"text": "حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، عن ثور بن يزيد، عن خالد بن معدان، عن عبد الله بن بسر، عن أخته، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تصوموا يوم السبت إلا فيما افترض الله عليكم فإن لم يجد أحدكم إلا لحاء عنبة أو عود شجرة فليمضغه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومعنى كراهته في هذا أن يخص الرجل يوم السبت بصيام لأن اليهود تعظم يوم السبت ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 745,
			"arabicnumber": 745,
			"text": "حدثنا أبو حفص، عمرو بن علي الفلاس حدثنا عبد الله بن داود، عن ثور بن يزيد، عن خالد بن معدان، عن ربيعة الجرشي، عن عائشة، قالت كان النبي صلى الله عليه وسلم يتحرى صوم الاثنين والخميس ‏.‏ قال وفي الباب عن حفصة وأبي قتادة وأبي هريرة وأسامة بن زيد ‏.‏ قال أبو عيسى حديث عائشة حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 746,
			"arabicnumber": 746,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، ومعاوية بن هشام، قالا حدثنا سفيان، عن منصور، عن خيثمة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصوم من الشهر السبت والأحد والاثنين ومن الشهر الآخر الثلاثاء والأربعاء والخميس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروى عبد الرحمن بن مهدي هذا الحديث عن سفيان ولم يرفعه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 747,
			"arabicnumber": 747,
			"text": "حدثنا محمد بن يحيى، حدثنا أبو عاصم، عن محمد بن رفاعة، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تعرض الأعمال يوم الاثنين والخميس فأحب أن يعرض عملي وأنا صائم ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة في هذا الباب حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 748,
			"arabicnumber": 748,
			"text": "حدثنا الحسين بن محمد الحريري، ومحمد بن مدويه، قالا حدثنا عبيد الله بن موسى، أخبرنا هارون بن سلمان، عن عبيد الله بن مسلم القرشي، عن أبيه، قال سألت أو سئل رسول الله صلى الله عليه وسلم عن صيام الدهر فقال ‏ \"‏ إن لأهلك عليك حقا صم رمضان والذي يليه وكل أربعاء وخميس فإذا أنت قد صمت الدهر وأفطرت ‏\"‏ ‏.‏ وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث مسلم القرشي حديث غريب ‏.‏ وروى بعضهم عن هارون بن سلمان عن مسلم بن عبيد الله عن أبيه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 749,
			"arabicnumber": 749,
			"text": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن النبي صلى الله عليه وسلم قال ‏ \"‏ صيام يوم عرفة إني أحتسب على الله أن يكفر السنة التي قبله والسنة التي بعده ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى حديث أبي قتادة حديث حسن ‏.‏ وقد استحب أهل العلم صيام يوم عرفة إلا بعرفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 750,
			"arabicnumber": 750,
			"text": "حدثنا أحمد بن منيع، حدثنا إسماعيل ابن علية، حدثنا أيوب، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم أفطر بعرفة وأرسلت إليه أم الفضل بلبن فشرب ‏.‏ وفي الباب عن أبي هريرة وابن عمر وأم الفضل ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد روي عن ابن عمر قال حججت مع النبي صلى الله عليه وسلم فلم يصمه يعني يوم عرفة ومع أبي بكر فلم يصمه ومع عمر فلم يصمه ومع عثمان فلم يصمه ‏.‏ والعمل على هذا عند أكثر أهل العلم يستحبون الإفطار بعرفة ليتقوى به الرجل على الدعاء وقد صام بعض أهل العلم يوم عرفة بعرفة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 751,
			"arabicnumber": 751,
			"text": "حدثنا أحمد بن منيع، وعلي بن حجر، قالا حدثنا سفيان بن عيينة، وإسماعيل بن إبراهيم، عن ابن أبي نجيح، عن أبيه، قال سئل ابن عمر عن صوم، يوم عرفة بعرفة فقال حججت مع النبي صلى الله عليه وسلم فلم يصمه ومع أبي بكر فلم يصمه ومع عمر فلم يصمه ومع عثمان فلم يصمه ‏.‏ وأنا لا أصومه ولا آمر به ولا أنهى عنه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث عن ابن أبي نجيح عن أبيه عن رجل عن ابن عمر ‏.‏ وأبو نجيح اسمه يسار ‏وقد سمع من ابن عمر.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 752,
			"arabicnumber": 752,
			"text": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن النبي صلى الله عليه وسلم قال ‏\"‏ صيام يوم عاشوراء إني أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏ وفي الباب عن علي ومحمد بن صيفي وسلمة بن الأكوع وهند بن أسماء وابن عباس والربيع بنت معوذ بن عفراء وعبد الرحمن بن سلمة الخزاعي عن عمه وعبد الله بن الزبير ذكروا عن رسول الله صلى الله عليه وسلم أنه حث على صيام يوم عاشوراء ‏.‏ قال أبو عيسى لا نعلم في شيء من الروايات أنه قال ‏\"‏ صيام يوم عاشوراء كفارة سنة ‏\"‏ ‏.‏ إلا في حديث أبي قتادة ‏.‏ وبحديث أبي قتادة يقول أحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 753,
			"arabicnumber": 753,
			"text": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان عاشوراء يوما تصومه قريش في الجاهلية وكان رسول الله صلى الله عليه وسلم يصومه فلما قدم المدينة صامه وأمر الناس بصيامه فلما افترض رمضان كان رمضان هو الفريضة وترك عاشوراء فمن شاء صامه ومن شاء تركه ‏.‏ وفي الباب عن ابن مسعود وقيس بن سعد وجابر بن سمرة وابن عمر ومعاوية ‏.‏ قال أبو عيسى والعمل عند أهل العلم على حديث عائشة وهو حديث صحيح لا يرون صيام يوم عاشوراء واجبا إلا من رغب في صيامه لما ذكر فيه من الفضل ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 754,
			"arabicnumber": 754,
			"text": "حدثنا هناد، وأبو كريب قالا حدثنا وكيع، عن حاجب بن عمر، عن الحكم بن الأعرج، قال انتهيت إلى ابن عباس وهو متوسد رداءه في زمزم فقلت أخبرني عن يوم عاشوراء أى يوم هو أصومه فقال إذا رأيت هلال المحرم فاعدد ثم أصبح من التاسع صائما ‏.‏ قال فقلت أهكذا كان يصومه محمد صلى الله عليه وسلم قال نعم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 755,
			"arabicnumber": 755,
			"text": "حدثنا قتيبة، حدثنا عبد الوارث، عن يونس، عن الحسن، عن ابن عباس، قال أمر رسول الله صلى الله عليه وسلم بصوم عاشوراء يوم العاشر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد اختلف أهل العلم في يوم عاشوراء فقال بعضهم يوم التاسع ‏.‏ وقال بعضهم يوم العاشر ‏.‏ وروي عن ابن عباس أنه قال صوموا التاسع والعاشر وخالفوا اليهود ‏.‏ وبهذا الحديث يقول الشافعي وأحمد وإسحاق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 756,
			"arabicnumber": 756,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت ما رأيت النبي صلى الله عليه وسلم صائما في العشر قط ‏.‏ قال أبو عيسى هكذا روى غير واحد عن الأعمش عن إبراهيم عن الأسود عن عائشة ‏.‏ وروى الثوري وغيره هذا الحديث عن منصور عن إبراهيم أن النبي صلى الله عليه وسلم لم ير صائما في العشر ‏.‏ وروى أبو الأحوص عن منصور عن إبراهيم عن عائشة ‏.‏ ولم يذكر فيه عن الأسود ‏.‏ وقد اختلفوا على منصور في هذا الحديث ورواية الأعمش أصح وأوصل إسنادا ‏.‏ قال وسمعت أبا بكر محمد بن أبان يقول سمعت وكيعا يقول الأعمش أحفظ لإسناد إبراهيم من منصور ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 757,
			"arabicnumber": 757,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن مسلم، هو البطين وهو ابن عمران عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من أيام العمل الصالح فيهن أحب إلى الله من هذه الأيام العشر ‏\"‏ ‏.‏ فقالوا يا رسول الله ولا الجهاد في سبيل الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ ولا الجهاد في سبيل الله إلا رجل خرج بنفسه وماله فلم يرجع من ذلك بشيء ‏\"‏ ‏.‏ وفي الباب عن ابن عمر وأبي هريرة وعبد الله بن عمرو وجابر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 758,
			"arabicnumber": 758,
			"text": "حدثنا أبو بكر بن نافع البصري، حدثنا مسعود بن واصل، عن نهاس بن قهم، عن قتادة، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ ما من أيام أحب إلى الله أن يتعبد له فيها من عشر ذي الحجة يعدل صيام كل يوم منها بصيام سنة وقيام كل ليلة منها بقيام ليلة القدر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث مسعود بن واصل عن النهاس ‏.‏ قال وسألت محمدا عن هذا الحديث فلم يعرفه من غير هذا الوجه مثل هذا ‏.‏ وقال قد روي عن قتادة عن سعيد بن المسيب عن النبي صلى الله عليه وسلم مرسلا شيء من هذا ‏.‏ وقد تكلم يحيى بن سعيد في نهاس بن قهم من قبل حفظه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 759,
			"arabicnumber": 759,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، حدثنا سعد بن سعيد، عن عمر بن ثابت، عن أبي أيوب، قال قال النبي صلى الله عليه وسلم ‏\"‏ من صام رمضان ثم أتبعه ستا من شوال فذلك صيام الدهر ‏\"‏ ‏.‏ وفي الباب عن جابر وأبي هريرة وثوبان ‏.‏ قال أبو عيسى حديث أبي أيوب حديث حسن صحيح ‏.‏ وقد استحب قوم صيام ستة أيام من شوال بهذا الحديث ‏.‏ قال ابن المبارك هو حسن هو مثل صيام ثلاثة أيام من كل شهر ‏.‏ قال ابن المبارك ويروى في بعض الحديث ‏\"‏ ويلحق هذا الصيام برمضان ‏\"‏ ‏.‏ واختار ابن المبارك أن تكون ستة أيام في أول الشهر ‏.‏ وقد روي عن ابن المبارك أنه قال إن صام ستة أيام من شوال متفرقا فهو جائز ‏.‏ قال وقد روى عبد العزيز بن محمد عن صفوان بن سليم وسعد بن سعيد عن عمر بن ثابت عن أبي أيوب عن النبي صلى الله عليه وسلم هذا ‏.‏ وروى شعبة عن ورقاء بن عمر عن سعد بن سعيد هذا الحديث ‏.‏ وسعد بن سعيد هو أخو يحيى بن سعيد الأنصاري وقد تكلم بعض أهل الحديث في سعد بن سعيد من قبل حفظه ‏.‏ حدثنا هناد قال أخبرنا الحسين بن علي الجعفي عن إسرائيل أبي موسى عن الحسن البصري قال كان إذا ذكر عنده صيام ستة أيام من شوال فيقول والله لقد رضي الله بصيام هذا الشهر عن السنة كلها ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 760,
			"arabicnumber": 760,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن سماك بن حرب، عن أبي الربيع، عن أبي هريرة، قال عهد إلى النبي صلى الله عليه وسلم ثلاثة أن لا أنام إلا على وتر وصوم ثلاثة أيام من كل شهر وأن أصلي الضحى ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 761,
			"arabicnumber": 761,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن الأعمش، قال سمعت يحيى بن سام، يحدث عن موسى بن طلحة، قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إذا صمت من الشهر ثلاثة أيام فصم ثلاث عشرة وأربع عشرة وخمس عشرة ‏\"‏ ‏.‏ وفي الباب عن أبي قتادة وعبد الله بن عمرو وقرة بن إياس المزني وعبد الله بن مسعود وأبي عقرب وابن عباس وعائشة وقتادة بن ملحان وعثمان بن أبي العاصي وجرير ‏.‏ قال أبو عيسى حديث أبي ذر حديث حسن ‏.‏ وقد روي في بعض الحديث أن ‏\"‏ من صام ثلاثة أيام من كل شهر كان كمن صام الدهر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 762,
			"arabicnumber": 762,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن عاصم الأحول، عن أبي عثمان النهدي، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام من كل شهر ثلاثة أيام فذلك صيام الدهر ‏\"‏ ‏.‏ فأنزل الله عز وجل تصديق ذلك في كتابه ‏:‏ ‏(‏من جاء بالحسنة فله عشر أمثالها ‏)‏ ‏.‏ اليوم بعشرة أيام ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى شعبة هذا الحديث عن أبي شمر وأبي التياح عن أبي عثمان عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 763,
			"arabicnumber": 763,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن يزيد الرشك، قال سمعت معاذة، قالت قلت لعائشة أكان رسول الله صلى الله عليه وسلم يصوم ثلاثة أيام من كل شهر قالت نعم ‏.‏ قلت من أيه كان يصوم قالت كان لا يبالي من أيه صام ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال ويزيد الرشك هو يزيد الضبعي وهو يزيد بن القاسم وهو القسام والرشك هو القسام بلغة أهل البصرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 764,
			"arabicnumber": 764,
			"text": "حدثنا عمران بن موسى القزاز، حدثنا عبد الوارث بن سعيد، حدثنا علي بن زيد، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن ربكم يقول كل حسنة بعشر أمثالها إلى سبعمائة ضعف والصوم لي وأنا أجزي به الصوم جنة من النار ولخلوف فم الصائم أطيب عند الله من ريح المسك وإن جهل على أحدكم جاهل وهو صائم فليقل إني صائم ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل وسهل بن سعد وكعب بن عجرة وسلامة بن قيصر وبشير ابن الخصاصية ‏.‏ واسم بشير زحم بن معبد والخصاصية هي أمه ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 765,
			"arabicnumber": 765,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، عن هشام بن سعد، عن أبي حازم، عن سهل بن سعد، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إن في الجنة لبابا يدعى الريان يدعى له الصائمون فمن كان من الصائمين دخله ومن دخله لم يظمأ أبدا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 766,
			"arabicnumber": 766,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ للصائم فرحتان فرحة حين يفطر وفرحة حين يلقى ربه ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 767,
			"arabicnumber": 767,
			"text": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد، عن أبي قتادة، قال قيل يا رسول الله كيف بمن صام الدهر قال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏ أو ‏\"‏ لم يصم ولم ي��طر ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن عمرو وعبد الله بن الشخير وعمران بن حصين وأبي موسى ‏.‏ قال أبو عيسى حديث أبي قتادة حديث حسن ‏.‏ وقد كره قوم من أهل العلم صيام الدهر وأجازه قوم آخرون وقالوا إنما يكون صيام الدهر إذا لم يفطر يوم الفطر ويوم الأضحى وأيام التشريق فمن أفطر هذه الأيام فقد خرج من حد الكراهية ولا يكون قد صام الدهر كله ‏.‏ هكذا روي عن مالك بن أنس وهو قول الشافعي ‏.‏ وقال أحمد وإسحاق نحوا من هذا وقالا لا يجب أن يفطر أياما غير هذه الخمسة الأيام التي نهى رسول الله صلى الله عليه وسلم عنها يوم الفطر ويوم الأضحى وأيام التشريق ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 768,
			"arabicnumber": 768,
			"text": "حدثنا قتيبة، حدثنا حماد بن زيد، عن أيوب، عن عبد الله بن شقيق، قال سألت عائشة عن صيام النبي، صلى الله عليه وسلم قالت كان يصوم حتى نقول قد صام ويفطر حتى نقول قد أفطر ‏.‏ قالت وما صام رسول الله صلى الله عليه وسلم شهرا كاملا إلا رمضان ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 769,
			"arabicnumber": 769,
			"text": "حدثنا علي بن حجر، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس بن مالك، أنه سئل عن صوم النبي، صلى الله عليه وسلم قال كان يصوم من الشهر حتى نرى أنه لا يريد أن يفطر منه ويفطر حتى نرى أنه لا يريد أن يصوم منه شيئا وكنت لا تشاء أن تراه من الليل مصليا إلا رأيته مصليا ولا نائما إلا رأيته نائما ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 770,
			"arabicnumber": 770,
			"text": "حدثنا هناد، حدثنا وكيع، عن مسعر، وسفيان، عن حبيب بن أبي ثابت، عن أبي العباس، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ أفضل الصوم صوم أخي داود كان يصوم يوما ويفطر يوما ولا يفر إذا لاقى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو العباس هو الشاعر المكي الأعمى واسمه السائب بن فروخ ‏.‏ قال بعض أهل العلم أفضل الصيام أن تصوم يوما وتفطر يوما ‏.‏ ويقال هذا هو أشد الصيام ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 771,
			"arabicnumber": 771,
			"text": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن أبي عبيد، مولى عبد الرحمن بن عوف قال شهدت عمر بن الخطاب في يوم النحر بدأ بالصلاة قبل الخطبة ثم قال سمعت رسول الله صلى الله عليه وسلم ينهى عن صوم هذين اليومين أما يوم الفطر ففطركم من صومكم وعيد للمسلمين وأما يوم الأضحى فكلوا من لحوم نسككم ‏.‏ قال هذا حديث صحيح ‏.‏ وأبو عبيد مولى عبد الرحمن بن عوف اسمه سعد ويقال له مولى عبد الرحمن بن أزهر أيضا وعبد الرحمن بن أزهر هو ابن عم عبد الرحمن بن عوف ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 772,
			"arabicnumber": 772,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن صيامين يوم الأضحى ويوم الفطر ‏.‏ قال وفي الباب عن عمر وعلي وعائشة وأبي هريرة وعقبة بن عامر وأنس ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم ‏.‏ قال أبو عيسى وعمرو بن يحيى هو ابن عمارة بن أبي الحسن المازني المدني وهو ثقة روى عنه سفيان الثوري وشعبة ومالك بن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 773,
			"arabicnumber": 773,
			"text": "حدثنا هناد، حدثنا وكيع، عن موسى بن على، عن أبيه، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام وهي أيام أكل وشرب ‏\"‏ ‏.‏ قال وفي الباب عن علي وسعد وأبي هريرة وجابر ونبيشة وبشر بن سحيم وعبد الله بن حذافة وأنس وحمزة بن عمرو الأسلمي وكعب بن مالك وعائشة وعمرو بن العاص وعبد الله بن عمرو ‏.‏ قال أبو عيسى وحديث عقبة بن عامر حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم يكرهون الصيام أيام التشريق إلا أن قوما من أصحاب النبي صلى الله عليه وسلم وغيرهم رخصوا للمتمتع إذا لم يجد هديا ولم يصم في العشر أن يصوم أيام التشريق ‏.‏ وبه يقول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ قال أبو عيسى وأهل العراق يقولون موسى بن علي بن رباح وأهل مصر يقولون موسى بن على ‏.‏ وقال سمعت قتيبة يقول سمعت الليث بن سعد يقول قال موسى بن علي لا أجعل أحدا في حل صغر اسم أبي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 774,
			"arabicnumber": 774,
			"text": "حدثنا محمد بن يحيى، ومحمد بن رافع النيسابوري، ومحمود بن غيلان، ويحيى بن موسى، قالوا حدثنا عبد الرزاق، عن معمر، عن يحيى بن أبي كثير، عن إبراهيم بن عبد الله بن قارظ، عن السائب بن يزيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وسعد وشداد بن أوس وثوبان وأسامة بن زيد وعائشة ومعقل بن سنان ويقال ابن يسار وأبي هريرة وابن عباس وأبي موسى وبلال ‏.‏ قال أبو عيسى وحديث رافع بن خديج حديث حسن ‏.‏ وذكر عن أحمد بن حنبل أنه قال أصح شيء في هذا الباب حديث رافع بن خديج ‏.‏ وذكر عن علي بن عبد الله أنه قال أصح شيء في هذا الباب حديث ثوبان وشداد بن أوس لأن يحيى بن أبي كثير روى عن أبي قلابة الحديثين جميعا حديث ثوبان وحديث شداد بن أوس ‏.‏ وقد كره قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم الحجامة للصائم حتى أن بعض أصحاب النبي صلى الله عليه وسلم احتجم بالليل منهم أبو موسى الأشعري وابن عمر وبهذا يقول ابن المبارك ‏.‏ قال أبو عيسى سمعت إسحاق بن منصور يقول قال عبد الرحمن بن مهدي من احتجم وهو صائم فعليه القضاء ‏.‏ قال إسحاق بن منصور وهكذا قال أحمد بن حنبل وإسحاق بن إبراهيم ‏.‏ وقال أبو عيسى وأخبرني الحسن بن محمد الزعفراني قال قال الشافعي قد روي عن النبي صلى الله عليه وسلم أنه احتجم وهو صائم وروي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ ولا أعلم واحدا من هذين الحديثين ثابتا ولو توقى رجل الحجامة وهو صائم كان أحب إلى ولو احتجم صائم لم أر ذلك أن يفطره ‏.‏ قال أبو عيسى هكذا كان قول الشافعي ببغداد وأما بمصر فمال إلى الرخصة ولم ير بالحجامة للصائم بأسا واحتج بأن النبي صلى الله عليه وسلم احتجم في حجة الوداع وهو محرم صائم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 775,
			"arabicnumber": 775,
			"text": "حدثنا بشر بن هلال البصري، حدثنا عبد الوارث بن سعيد، حدثنا أيوب، عن عكرمة، عن ابن عباس، قال احتجم رسول الله صلى الله عليه وسلم وهو محرم صائم ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وهكذا روى وهيب نحو رواية عبد الوارث ‏.‏ وروى إسماعيل بن إبراهيم عن أيوب عن عكرمة مرسلا ولم يذكر فيه عن ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 776,
			"arabicnumber": 776,
			"text": "حدثنا أبو موسى، محمد بن المثنى حدثنا محمد بن عبد الله الأنصاري، عن حبيب بن الشهيد، عن ميمون بن مهران، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وهو صائم ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 777,
			"arabicnumber": 777,
			"text": "حدثنا أحمد بن منيع، حدثنا عبد الله بن إدريس، عن يزيد بن أبي زياد، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم فيما بين مكة والمدينة وهو محرم صائم ‏.‏ قال أبو عيسى وفي الباب عن أبي سعيد وجابر وأنس ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد ذهب بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلى هذا الحديث ولم يروا بالحجامة للصائم بأسا ‏.‏ وهو قول سفيان الثوري ومالك بن أنس والشافعي ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": 778,
			"text": "حدثنا نصر بن علي، حدثنا بشر بن المفضل، وخالد بن الحارث، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تواصلوا ‏\"‏ ‏.‏ قالوا فإنك تواصل يا رسول الله ‏.‏ قال ‏\"‏ إني لست كأحدكم إن ربي يطعمني ويسقيني ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي هريرة وعائشة وابن عمر وجابر وأبي سعيد وبشير ابن الخصاصية ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم كرهوا الوصال في الصيام ‏.‏ وروي عن عبد الله بن الزبير أنه كان يواصل الأيام ولا يفطر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": 779,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، قال أخبرتني عائشة، وأم سلمة زوجا النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان يدركه الفجر وهو جنب من أهله ثم يغتسل فيصوم ‏.‏ قال أبو عيسى حديث عائشة وأم سلمة حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان والشافعي وأحمد وإسحاق ‏.‏ وقد قال قوم من التابعين إذا أصبح جنبا يقضي ذلك اليوم ‏.‏ والقول الأول أصح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": 780,
			"text": "حدثنا أزهر بن مروان البصري، حدثنا محمد بن سواء، حدثنا سعيد بن أبي عروبة، عن أيوب، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا دعي أحدكم إلى طعام فليجب فإن كان صائما فليصل ‏\"‏ ‏.‏ يعني الدعاء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": 781,
			"text": "حدثنا نصر بن علي، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ إذا دعي أحدكم وهو صائم فليقل إني صائم ‏\"‏ ‏.‏ قال أبو عيسى وكلا الحديثين في هذا الباب عن أبي هريرة حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": 782,
			"text": "حدثنا قتيبة، ونصر بن علي، قالا حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ لا تصوم المرأة وزوجها شاهد يوما من غير شهر رمضان إلا بإذنه ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس وأبي سعيد ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن أبي الزناد عن موسى بن أبي عثمان عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": 783,
			"text": "حدثنا قتيبة، حدثنا أبو عوانة، عن إسماعيل السدي، عن عبد الله البهي، عن عائشة، قالت ما كنت أقضي ما يكون على من رمضان إلا في شعبان حتى توفي رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وقد روى يحيى بن سعيد الأنصاري عن أبي سلمة عن عائشة نحو هذا ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": 784,
			"text": "حدثنا علي بن حجر، أخبرنا شريك، عن حبيب بن زيد، عن ليلى، عن مولاتها، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الصائم إذا أكل عنده المفاطير صلت عليه الملائكة ‏\"‏ ‏.‏ قال أبو عيسى وروى شعبة هذا الحديث عن حبيب بن زيد عن ليلى عن جدته أم عمارة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": 785,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن حبيب بن زيد، قال سمعت مولاة، لنا يقال لها ليلى تحدث عن جدته أم عمارة بنت كعب الأنصارية، أن النبي صلى الله عليه وسلم دخل عليها فقدمت إليه طعاما فقال ‏\"‏ كلي ‏\"‏ ‏.‏ فقالت إني صائمة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الصائم تصلي عليه الملائكة إذا أكل عنده حتى يفرغوا ‏\"‏ ‏.‏ وربما قال ‏\"‏ حتى يشبعوا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو أصح من حديث شريك ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": 786,
			"text": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن حبيب بن زيد، عن مولاة، لهم يقال لها ليلى عن جدته أم عمارة بنت كعب، عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه ‏ \"‏ حتى يفرغوا أو يشبعوا ‏\"‏ ‏.‏ قال أبو عيسى وأم عمارة هي جدة حبيب بن زيد الأنصاري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": 787,
			"text": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن عبيدة، عن إبراهيم، عن الأسود، عن عائشة، قالت كنا نحيض على عهد رسول الله صلى الله عليه وسلم ثم نطهر فيأمرنا بقضاء الصيام ولا يأمرنا بقضاء الصلاة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي عن معاذة عن عائشة أيضا ‏.‏ والعمل على هذا عند أهل العلم لا نعلم بينهم اختلافا أن الحائض تقضي الصيام ولا تقضي الصلاة ‏.‏ قال أبو عيسى وعبيدة هو ابن معتب الضبي الكوفي يكنى أبا عبد الكريم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": 788,
			"text": "حدثنا عبد الوهاب بن عبد الحكم البغدادي الوراق، وأبو عمار الحسين بن حريث قالا حدثنا يحيى بن سليم، حدثني إسماعيل بن كثير، قال سمعت عاصم بن لقيط بن صبرة، عن أبيه، قال قلت يا رسول الله أخبرني عن الوضوء، ‏.‏ قال ‏ \"‏ أسبغ الوضوء وخلل بين الأصابع وبالغ في الاستنشاق إلا أن تكون صائما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد كره أهل العلم السعوط للصائم ورأوا أن ذلك يفطره وفي الحديث ما يقوي قولهم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": 789,
			"text": "حدثنا بشر بن معاذ العقدي البصري، حدثنا أيوب بن واقد الكوفي، عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ من نزل على قوم فلا يصومن تطوعا إلا بإذنهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث منكر لا نعرف أحدا من الثقات روى هذا الحديث عن هشام بن عروة ‏.‏ وقد روى موسى بن داود عن أبي بكر المديني عن هشام بن عروة عن أبيه عن عائشة عن النبي صلى الله عليه وسلم نحوا من هذا ‏.‏ قال أبو عيسى وهذا حديث ضعيف أيضا ‏.‏ وأبو بكر ضعيف عند أهل الحديث وأبو بكر المدني الذي روى عن جابر بن عبد الله اسمه الفضل بن مبشر وهو أوثق من هذا وأقدم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": 790,
			"text": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، وعروة، عن عائشة، أن النبي صلى الله عليه وسلم كان يعتكف العشر الأواخر من رمضان حتى قبضه الله ‏.‏ قال وفي الباب عن أبى بن كعب وأبي ليلى وأبي سعيد وأنس وابن عمر ‏.‏ قال أبو عيسى حديث أبي هريرة وعائشة حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": 791,
			"text": "حدثنا هناد، حدثنا أبو معاوية، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يعتكف صلى الفجر ثم دخل في معتكفه ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن يحيى بن سعيد عن عمرة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ رواه مالك وغير واحد عن يحيى بن سعيد عن عمرة مرسلا ‏.‏ ورواه الأوزاعي وسفيان الثوري وغير واحد عن يحيى بن سعيد عن عمرة عن عائشة ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم يقولون إذا أراد الرجل أن يعتكف صلى الفجر ثم دخل في معتكفه ‏.‏ وهو قول أحمد بن حنبل وإسحاق بن إبراهيم ‏.‏ وقال بعضهم إذا أراد أن يعتكف فلتغب له الشمس من الليلة التي يريد أن يعتكف فيها من الغد وقد قعد في معتكفه ‏.‏ وهو قول سفيان الثوري ومالك بن أنس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": 792,
			"text": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يجاور في العشر الأواخر من رمضان ويقول ‏\"‏ تحروا ليلة القدر في العشر الأواخر من رمضان ‏\"‏ ‏.‏ وفي الباب عن عمر وأبى وجابر بن سمرة وجابر بن عبد الله وابن عمر والفلتان بن عاصم وأنس وأبي سعيد وعبد الله بن أنيس وأبي بكرة وابن عباس وبلال وعبادة بن الصامت ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وقولها يجاور يعني يعتكف ‏.‏ وأكثر الروايات عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ التمسوها في العشر الأواخر في كل وتر ‏\"‏ ‏.‏ وروي عن النبي صلى الله عليه وسلم في ليلة القدر أنها ليلة إحدى وعشرين وليلة ثلاث وعشرين وخمس وعشرين وسبع وعشرين وتسع وعشرين وآخر ليلة من رمضان ‏\"‏ ‏.‏ قال أبو عيسى قال الشافعي كأن هذا عندي والله أعلم أن النبي صلى الله عليه وسلم كان يجيب على نحو ما يسأل عنه يقال له نلتمسها في ليلة كذا فيقول التمسوها في ليلة كذا ‏.‏ قال الشافعي وأقوى الروايات عندي فيها ليلة إحدى وعشرين ‏.‏ قال أبو عيسى وقد روي عن أبى بن كعب أنه كان يحلف أنها ليلة سبع وعشرين ‏.‏ ويقول أخبرنا رسول الله صلى الله عليه وسلم بعلامتها فعددنا وحفظنا ‏.‏ وروي عن أبي قلابة أنه قال ليلة القدر تنتقل في العشر الأواخر ‏.‏ حدثنا بذلك عبد بن حميد أخبرنا عبد الرزاق عن معمر عن أيوب عن أبي قلابة بهذا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": 793,
			"text": "حدثنا واصل بن عبد الأعلى الكوفي، حدثنا أبو بكر بن عياش، عن عاصم، عن زر، قال قلت لأبى بن كعب أنى علمت أبا المنذر أنها ليلة سبع وعشرين قال بلى أخبرنا رسول الله صلى الله عليه وسلم ‏ \"‏ أنها ليلة صبيحتها تطلع الشمس ليس لها شعاع ‏\"‏ ‏.‏ فعددنا وحفظنا والله لقد علم ابن مسعود أنها في رمضان وأنها ليلة سبع وعشرين ولكن كره أن يخبركم فتتكلوا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 794,
			"arabicnumber": 794,
			"text": "حدثنا حميد بن مسعدة، حدثنا يزيد بن زريع، حدثنا عيينة بن عبد الرحمن، قال حدثني أبي قال، ذكرت ليلة القدر عند أبي بكرة فقال ما أنا بملتمسها، لشيء سمعته من، رسول الله صلى الله عليه وسلم إلا في العشر الأواخر فإني سمعته يقول ‏ \"‏ التمسوها في تسع يبقين أو في سبع يبقين أو في خمس يبقين أو في ثلاث أو آخر ليلة ‏\"‏ ‏.‏ قال وكان أبو بكرة يصلي في العشرين من رمضان كصلاته في سائر السنة فإذا دخل العشر اجتهد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": 795,
			"text": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن أبي إسحاق، عن هبيرة بن يريم، عن علي، أن النبي صلى الله عليه وسلم كان يوقظ أهله في العشر الأواخر من رمضان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": 796,
			"text": "حدثنا قتيبة، حدثنا عبد الواحد بن زياد، عن الحسن بن عبيد الله، عن إبراهيم، عن الأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يجتهد في العشر الأواخر ما لا يجتهد في غيرها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": 797,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سفيان، عن أبي إسحاق، عن نمير بن عريب، عن عامر بن مسعود، عن النبي صلى الله عليه وسلم قال ‏ \"‏ الغنيمة الباردة الصوم في الشتاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث مرسل ‏.‏ عامر بن مسعود لم يدرك النبي صلى الله عليه وسلم وهو والد إبراهيم بن عامر القرشي الذي روى عنه شعبة والثوري ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": 798,
			"text": "حدثنا قتيبة، حدثنا بكر بن مضر، عن عمرو بن الحارث، عن بكير بن عبد الله بن الأشج، عن يزيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال لما نزلت ‏:‏ ‏(‏وعلى الذين يطيقونه فدية طعام مسكين ‏)‏ كان من أراد منا أن يفطر ويفتدي حتى نزلت الآية التي بعدها فنسختها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ ويزيد هو ابن أبي عبيد مولى سلمة بن الأكوع ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": 799,
			"text": "حدثنا قتيبة، حدثنا عبد الله بن جعفر، عن زيد بن أسلم، عن محمد بن المنكدر، عن محمد بن كعب، أنه قال أتيت أنس بن مالك في رمضان وهو يريد سفرا وقد رحلت له راحلته ولبس ثياب السفر فدعا بطعام فأكل فقلت له سنة قال سنة ‏.‏ ثم ركب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": 800,
			"text": "حدثنا محمد بن إسماعيل، حدثنا سعيد بن أبي مريم، حدثنا محمد بن جعفر، قال حدثني زيد بن أسلم، قال حدثني محمد بن المنكدر، عن محمد بن كعب، قال أتيت أنس بن مالك في رمضان فذكر نحوه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومحمد بن جعفر هو ابن أبي كثير هو مديني ثقة وهو أخو إسماعيل بن جعفر ‏.‏ وعبد الله بن جعفر هو ابن نجيح والد علي بن عبد الله المديني وكان يحيى بن معين يضعفه ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا للمسافر أن يفطر في بيته قبل أن يخرج وليس له أن يقصر الصلاة حتى يخرج من جدار المدينة أو القرية ‏.‏ وهو قول إسحاق بن إبراهيم الحنظلي ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": 801,
			"text": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن سعد بن طريف، عن عمير بن مأمون، عن الحسن بن علي، قال قال رسول الله ‏ \"‏ تحفة الصائم الدهن والمجمر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ليس إسناده بذاك لا نعرفه إلا من حديث سعد بن طريف ‏.‏ وسعد بن طريف يضعف ويقال عمير بن مأموم أيضا ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": 802,
			"text": "حدثنا يحيى بن موسى، حدثنا يحيى بن اليمان، عن معمر، عن محمد بن المنكدر، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏ \"‏ الفطر يوم يفطر الناس والأضحى يوم يضحي الناس ‏\"‏ ‏.‏ قال أبو عيسى سألت محمدا قلت له محمد بن المنكدر سمع من عائشة قال نعم يقول في حديثه سمعت عائشة ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح من هذا الوجه ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": 803,
			"text": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، قال أنبأنا حميد الطويل، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم يعتكف في العشر الأواخر من رمضان فلم يعتكف عاما فلما كان في العام المقبل اعتكف عشرين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث أنس بن مالك ‏.‏ واختلف أهل العلم في المعتكف إذا قطع اعتكافه قبل أن يتمه على ما نوى فقال بعض أهل العلم إذا نقض اعتكافه وجب عليه القضاء ‏.‏ واحتجوا بالحديث أن النبي صلى الله عليه وسلم خرج من اعتكافه فاعتكف عشرا من شوال ‏.‏ وهو قول مالك ‏.‏ وقال بعضهم إن لم يكن عليه نذر اعتكاف أو شيء أوجبه على نفسه وكان متطوعا فخرج فليس عليه أن يقضي إلا أن يحب ذلك اختيارا منه ولا يجب ذلك عليه ‏.‏ وهو قول الشافعي ‏.‏ قال الشافعي فكل عمل لك أن لا تدخل فيه فإذا دخلت فيه فخرجت منه فليس عليك أن تقضي إلا الحج والعمرة ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": 804,
			"text": "حدثنا أبو مصعب المدني، قراءة عن مالك بن أنس، عن ابن شهاب، عن عروة، وعمرة، عن عائشة، أنها قالت كان رسول الله صلى الله عليه وسلم إذا اعتكف أدنى إلى رأسه فأرجله وكان لا يدخل البيت إلا لحاجة الإنسان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ هكذا رواه غير واحد عن مالك عن ابن شهاب عن عروة وعمرة عن عائشة ‏.‏ ورواه بعضهم عن مالك عن ابن شهاب عن عروة عن عمرة عن عائشة ‏.‏ والصحيح عن عروة وعمرة عن عائشة ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": 805,
			"text": "حدثنا بذلك، قتيبة حدثنا الليث بن سعد، عن ابن شهاب، عن عروة، وعمرة، عن عائشة، ‏.‏ والعمل على هذا عند أهل العلم إذا اعتكف الرجل أن لا يخرج من اعتكافه إلا لحاجة الإنسان واجتمعوا على هذا أنه يخرج لقضاء حاجته للغائط والبول ‏.‏ ثم اختلف أهل العلم في عيادة المريض وشهود الجمعة والجنازة للمعتكف فرأى بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن يعود المريض ويشيع الجنازة ويشهد الجمعة إذا اشترط ذلك ‏.‏ وهو قول سفيان الثوري وابن المبارك ‏.‏ وقال بعضهم ليس له أن يفعل شيئا من هذا ورأوا للمعتكف إذا كان في مصر يجمع فيه أن لا يعتكف إلا في مسجد الجامع لأنهم كرهوا الخروج له من معتكفه إلى الجمعة ولم يروا له أن يترك الجمعة فقالوا لا يعتكف إلا في مسجد الجامع حتى لا يحتاج إلى أن يخرج من معتكفه لغير قضاء حاجة الإنسان لأن خروجه لغير قضاء حاجة الإنسان قطع عندهم للاعتكاف ‏.‏ وهو قول مالك والشافعي ‏.‏ وقال أحمد لا يعود المريض ولا يتبع الجنازة على حديث عائشة ‏.‏ وقال إسحاق إن اشترط ذلك فله أن يتبع الجنازة ويعود المريض ‏.‏",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": 806,
			"text": "حدثنا هناد، حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم فلم يصل بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة وقام بنا في الخامسة حتى ذهب شطر الليل فقلنا له يا رسول الله لو نفلتنا بقية ليلتنا هذه فقال ‏ \"‏ إنه من قام مع الإمام حتى ينصرف كتب له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا حتى بقي ثلاث من الشهر وصلى بنا في الثالثة ودعا أهله ونساءه فقام بنا حتى تخوفنا الفلاح ‏.‏ قلت له وما الفلاح قال السحور ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ واختلف أهل العلم في قيام رمضان فرأى بعضهم أن يصلي إحدى وأربعين ركعة مع الوتر ‏.‏ وهو قول أهل المدينة والعمل على هذا عندهم بالمدينة ‏.‏ وأكثر أهل العلم على ما روي عن عمر وعلي وغيرهما من أصحاب النبي صلى الله عليه وسلم عشرين ركعة ‏.‏ وهو قول سفيان الثوري وابن المبارك والشافعي ‏.‏ وقال الشافعي وهكذا أدركت ببلدنا بمكة يصلون عشرين ركعة ‏.‏ وقال أحمد روي في هذا ألوان ‏.‏ ولم يقض فيه بشيء ‏.‏ وقال إسحاق بل نختار إحدى وأربعين ركعة على ما روي عن أبى بن كعب ‏.‏ واختار ابن المبارك وأحمد وإسحاق الصلاة مع الإمام في شهر رمضان ‏.‏ واختار الشافعي أن يصلي الرجل وحده إذا كان قارئا ‏.‏ وفي الباب عن عائشة والنعمان بن بشير وابن عباس ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": 807,
			"text": "حدثنا هناد، حدثنا عبد الرحيم بن سليمان، عن عبد الملك بن أبي سليمان، عن عطاء، عن زيد بن خالد الجهني، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ من فطر صائما كان له مثل أجره غير أنه لا ينقص من أجر الصائم شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": 808,
			"text": "حدثنا عبد بن حميد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يرغب في قيام رمضان من غير أن يأمرهم بعزيمة ويقول ‏ \"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ فتوفي رسول الله صلى الله عليه وسلم والأمر على ذلك ثم كان الأمر كذلك في خلافة أبي بكر وصدرا من خلافة عمر بن الخطاب على ذلك ‏.‏ وفي الباب عن عائشة ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وقد روي هذا الحديث أيضا عن الزهري عن عروة عن عائشة ‏عن النبي قال أبو عيسى هذا حديث حسن صحيح.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 127
			}
		}
	]
}