{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"14": "The Book on Business"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1246,
			"arabicnumber": 1246,
			"text": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن شعبة، عن قتادة، عن صالح أبي الخليل، عن عبد الله بن الحارث، عن حكيم بن حزام، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البيعان بالخيار ما لم يتفرقا فإن صدقا وبينا بورك لهما في بيعهما وإن كتما وكذبا محقت بركة بيعهما ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏ قال أبو عيسى وفي الباب عن أبي برزة وحكيم بن حزام وعبد الله بن عباس وعبد الله بن عمرو وسمرة وأبي هريرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول الشافعي وأحمد وإسحاق وقالوا الفرقة بالأبدان لا بالكلام ‏.‏ وقد قال بعض أهل العلم معنى قول النبي صلى الله عليه وسلم ‏\"‏ ما لم يتفرقا ‏\"‏ ‏.‏ يعني الفرقة بالكلام ‏.‏ والقول الأول أصح لأن ابن عمر هو روى عن النبي صلى الله عليه وسلم وهو أعلم بمعنى ما روى وروي عنه أنه كان إذا أراد أن يوجب البيع مشى ليجب له ‏.‏ وهكذا روي عن أبي برزة الأسلمي أن رجلين اختصما إليه في فرس بعد ما تبايعا ‏.‏ وكانوا في سفينة فقال لا أراكما افترقتما وقال رسول الله صلى الله عليه وسلم ‏\"‏ البيعان بالخيار ما لم يتفرقا ‏\"‏ ‏.‏ وقد ذهب بعض أهل العلم من أهل الكوفة وغيرهم إلى أن الفرقة بالكلام وهو قول سفيان الثوري وهكذا روي عن مالك بن أنس ‏.‏ وروي عن ابن المبارك أنه قال كيف أرد هذا والحديث فيه عن النبي صلى الله عليه وسلم صحيح ‏.‏ وقوى هذا المذهب ‏.‏ ومعنى قول النبي صلى الله عليه وسلم ‏\"‏ إلا بيع الخيار ‏\"‏ ‏.‏ معناه أن يخير البائع المشتري بعد إيجاب البيع فإذا خيره فاختار البيع فليس له خيار بعد ذلك في فسخ البيع وإن لم يتفرقا ‏.‏ هكذا فسره الشافعي وغيره ‏.‏ ومما يقوي قول من يقول الفرقة بالأبدان لا بالكلام حديث عبد الله بن عمرو عن النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 46
			}
		}
	]
}