{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"1": "The Book on Purification"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 128,
			"arabicnumber": 128,
			"text": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش قالت كنت أستحاض حيضة كثيرة شديدة فأتيت النبي صلى الله عليه وسلم أستفتيه وأخبره فوجدته في بيت أختي زينب بنت جحش فقلت يا رسول الله إني أستحاض حيضة كثيرة شديدة فما تأمرني فيها قد منعتني الصيام والصلاة قال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فتلجمي ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فاتخذي ثوبا ‏\"‏ ‏.‏ قالت هو أكثر من ذلك إنما أثج ثجا فقال النبي صلى الله عليه وسلم ‏\"‏ سآمرك بأمرين أيهما صنعت أجزأ عنك فإن قويت عليهما فأنت أعلم ‏\"‏ ‏.‏ فقال ‏\"‏ إنما هي ركضة من الشيطان فتحيضي ستة أيام أو سبعة أيام في علم الله ثم اغتسلي فإذا رأيت أنك قد طهرت واستنقأت فصلي أربعا وعشرين ليلة أو ثلاثا وعشرين ليلة وأيامها وصومي وصلي فإن ذلك يجزئك وكذلك فافعلي كما تحيض النساء وكما يطهرن لميقات حيضهن وطهرهن فإن قويت على أن تؤخري الظهر وتعجلي العصر ثم تغتسلين حين تطهرين وتصلين الظهر والعصر جميعا ثم تؤخرين المغرب وتعجلين العشاء ثم تغتسلين وتجمعين بين الصلاتين فافعلي وتغتسلين مع الصبح وتصلين وكذلك فافعلي وصومي إن قويت على ذلك ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وهو أعجب الأمرين إلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه عبيد الله بن عمرو الرقي وابن جريج وشريك عن عبد الله بن محمد بن عقيل عن إبراهيم بن محمد بن طلحة عن عمه عمران عن أمه حمنة إلا أن ابن جريج يقول عمر بن طلحة والصحيح عمران بن طلحة ‏.‏ قال وسألت محمدا عن هذا الحديث فقال هو حديث حسن صحيح ‏.‏ وهكذا قال أحمد بن حنبل هو حديث حسن صحيح ‏.‏ وقال أحمد وإسحاق في المستحاضة إذا كانت تعرف حيضها بإقبال الدم وإدباره وإقباله أن يكون أسود ‏.‏ وإدباره أن يتغير إلى الصفرة فالحكم لها على حديث فاطمة بنت أبي حبيش وإن كانت المستحاضة لها أيام معروفة قبل أن تستحاض فإنها تدع الصلاة أيام أقرائها ثم تغتسل وتتوضأ لكل صلاة وتصلي وإذا استمر بها الدم ولم يكن لها أيام معروفة ولم تعرف الحيض بإقبال الدم وإدباره فالحكم لها على حديث حمنة بنت جحش ‏.‏ وكذلك قال أبو عبيد ‏.‏ وقال الشافعي المستحاضة إذا استمر بها الدم في أول ما رأت فدامت على ذلك فإنها تدع الصلاة ما بينها وبين خمسة عشر يوما فإذا طهرت في خمسة عشر يوما أو قبل ذلك فإنها أيام حيض فإذا رأت الدم أكثر من خمسة عشر يوما فإنها تقضي صلاة أربعة عشر يوما ثم تدع الصلاة بعد ذلك أقل ما تحيض النساء وهو يوم وليلة ‏.‏ قال أبو عيسى واختلف أهل العلم في أقل الحيض وأكثره فقال بعض أهل العلم أقل الحيض ثلاثة وأكثره عشرة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يأخذ ابن المبارك وروي عنه خلاف هذا ‏.‏ وقال بعض أهل العلم منهم عطاء بن أبي رباح أقل الحيض يوم وليلة وأكثره خمسة عشر يوما ‏.‏ وهو قول مالك والأوزاعي والشافعي وأحمد وإسحاق وأبي عبيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 128
			}
		}
	]
}