{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"33": "Chapters On Al-Fitan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2191,
			"arabicnumber": 2191,
			"text": "حدثنا عمران بن موسى القزاز البصري، حدثنا حماد بن زيد، حدثنا علي بن زيد بن جدعان القرشي، عن أبي نضرة، عن أبي سعيد الخدري، قال صلى بنا رسول الله صلى الله عليه وسلم يوما صلاة العصر بنهار ثم قام خطيبا فلم يدع شيئا يكون إلى قيام الساعة إلا أخبرنا به حفظه من حفظه ونسيه من نسيه وكان فيما قال ‏\"‏ إن الدنيا حلوة خضرة وإن الله مستخلفكم فيها فناظر كيف تعملون ألا فاتقوا الدنيا واتقوا النساء ‏\"‏ ‏.‏ وكان فيما قال ‏\"‏ ألا لا يمنعن رجلا هيبة الناس أن يقول بحق إذا علمه ‏\"‏ ‏.‏ قال فبكى أبو سعيد فقال قد والله رأينا أشياء فهبنا ‏.‏ وكان فيما قال ‏\"‏ ألا إنه ينصب لكل غادر لواء يوم القيامة بقدر غدرته ولا غدرة أعظم من غدرة إمام عامة يركز لواؤه عند استه ‏\"‏ ‏.‏ وكان فيما حفظنا يومئذ ‏\"‏ ألا إن بني آدم خلقوا على طبقات شتى فمنهم من يولد مؤمنا ويحيا مؤمنا ويموت مؤمنا ومنهم من يولد كافرا ويحيا كافرا ويموت كافرا ومنهم من يولد مؤمنا ويحيا مؤمنا ويموت كافرا ومنهم من يولد كافرا ويحيا كافرا ويموت مؤمنا ألا وإن منهم البطيء الغضب سريع الفىء ومنهم سريع الغضب سريع الفىء فتلك بتلك ألا وإن منهم سريع الغضب بطيء الفىء ألا وخيرهم بطيء الغضب سريع الفىء ألا وشرهم سريع الغضب بطيء الفىء ألا وإن منهم حسن القضاء حسن الطلب ومنهم سيئ القضاء حسن الطلب ومنهم حسن القضاء سيئ الطلب فتلك بتلك ألا وإن منهم السيئ القضاء السيئ الطلب ألا وخيرهم الحسن القضاء الحسن الطلب ألا وشرهم سيئ القضاء سيئ الطلب ألا وإن الغضب جمرة في قلب ابن آدم أما رأيتم إلى حمرة عينيه وانتفاخ أوداجه فمن أحس بشيء من ذلك فليلصق بالأرض ‏\"‏ ‏.‏ قال وجعلنا نلتفت إلى الشمس هل بقي منها شيء فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا إنه لم يبق من الدنيا فيما مضى منها إلا كما بقي من يومكم هذا فيما مضى منه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة وأبي مريم وأبي زيد بن أخطب والمغيرة بن شعبة وذكروا أن النبي صلى الله عليه وسلم حدثهم بما هو كائن إلى أن تقوم الساعة ‏.‏ وهذا حديث حسن ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 34
			}
		}
	]
}