{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"36": "Chapters On Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2369,
			"arabicnumber": 2369,
			"text": "حدثنا محمد بن إسماعيل، حدثنا آدم بن أبي إياس، حدثنا شيبان أبو معاوية، حدثنا عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال خرج النبي صلى الله عليه وسلم في ساعة لا يخرج فيها ولا يلقاه فيها أحد فأتاه أبو بكر فقال ‏\"‏ ما جاء بك يا أبا بكر ‏\"‏ ‏.‏ فقال خرجت ألقى رسول الله صلى الله عليه وسلم وأنظر في وجهه والتسليم عليه ‏.‏ فلم يلبث أن جاء عمر فقال ‏\"‏ ما جاء بك يا عمر ‏\"‏ ‏.‏ قال الجوع يا رسول الله قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأنا قد وجدت بعض ذلك ‏\"‏ ‏.‏ فانطلقوا إلى منزل أبي الهيثم بن التيهان الأنصاري وكان رجلا كثير النخل والشاء ولم يكن له خدم فلم يجدوه فقالوا لامرأته أين صاحبك فقالت انطلق يستعذب لنا الماء ‏.‏ فلم يلبثوا أن جاء أبو الهيثم بقربة يزعبها فوضعها ثم جاء يلتزم النبي صلى الله عليه وسلم ويفديه بأبيه وأمه ثم انطلق بهم إلى حديقته فبسط لهم بساطا ثم انطلق إلى نخلة فجاء بقنو فوضعه فقال النبي صلى الله عليه وسلم ‏\"‏ أفلا تنقيت لنا من رطبه ‏\"‏ ‏.‏ فقال يا رسول الله إني أردت أن تختاروا أو قال تخيروا من رطبه وبسره ‏.‏ فأكلوا وشربوا من ذلك الماء فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا والذي نفسي بيده من النعيم الذي تسألون عنه يوم القيامة ظل بارد ورطب طيب وماء بارد ‏\"‏ ‏.‏ فانطلق أبو الهيثم ليصنع لهم طعاما فقال النبي صلى الله عليه وسلم ‏\"‏ لا تذبحن ذات در ‏\"‏ ‏.‏ قال فذبح لهم عناقا أو جديا فأتاهم بها فأكلوا فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك خادم ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أتانا سبى فائتنا ‏\"‏ ‏.‏ فأتي النبي صلى الله عليه وسلم برأسين ليس معهما ثالث فأتاه أبو الهيثم فقال النبي صلى الله عليه وسلم ‏\"‏ اختر منهما ‏\"‏ ‏.‏ فقال يا نبي الله اختر لي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن المستشار مؤتمن خذ هذا فإني رأيته يصلي واستوص به معروفا ‏\"‏ ‏.‏ فانطلق أبو الهيثم إلى امرأته فأخبرها بقول رسول الله صلى الله عليه وسلم فقالت امرأته ما أنت ببالغ ما قال فيه النبي صلى الله عليه وسلم إلا أن تعتقه قال فهو عتيق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله لم يبعث نبيا ولا خليفة إلا وله بطانتان بطانة تأمره بالمعروف وتنهاه عن المنكر وبطانة لا تألوه خبالا ومن يوق بطانة السوء فقد وقي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		}
	]
}