{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"36": "Chapters On Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2382,
			"arabicnumber": 2382,
			"text": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا حيوة بن شريح، أخبرني الوليد بن أبي الوليد أبو عثمان المدني، أن عقبة بن مسلم، حدثه أن شفيا الأصبحي حدثه أنه، دخل المدينة فإذا هو برجل قد اجتمع عليه الناس فقال من هذا فقالوا أبو هريرة ‏.‏ فدنوت منه حتى قعدت بين يديه وهو يحدث الناس فلما سكت وخلا قلت له أنشدك بحق وبحق لما حدثتني حديثا سمعته من رسول الله صلى الله عليه وسلم عقلته وعلمته ‏.‏ فقال أبو هريرة أفعل لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم عقلته وعلمته ‏.‏ ثم نشغ أبو هريرة نشغة فمكث قليلا ثم أفاق فقال لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم في هذا البيت ما معنا أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة أخرى ثم أفاق فمسح وجهه فقال لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم وأنا وهو في هذا البيت ما معنا أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة أخرى ثم أفاق ومسح وجهه فقال أفعل لأحدثنك حديثا حدثنيه رسول الله صلى الله عليه وسلم وأنا معه في هذا البيت ما معه أحد غيري وغيره ‏.‏ ثم نشغ أبو هريرة نشغة شديدة ثم مال خارا على وجهه فأسندته على طويلا ثم أفاق فقال حدثني رسول الله صلى الله عليه وسلم أن الله تبارك وتعالى إذا كان يوم القيامة ينزل إلى العباد ليقضي بينهم وكل أمة جاثية فأول من يدعو به رجل جمع القرآن ورجل قتل في سبيل الله ورجل كثير المال فيقول الله للقارئ ألم أعلمك ما أنزلت على رسولي قال بلى يا رب ‏.‏ قال فماذا عملت فيما علمت قال كنت أقوم به آناء الليل وآناء النهار ‏.‏ فيقول الله له كذبت وتقول له الملائكة كذبت ويقول الله له بل أردت أن يقال إن فلانا قارئ فقد قيل ذاك ‏.‏ ويؤتى بصاحب المال فيقول الله له ألم أوسع عليك حتى لم أدعك تحتاج إلى أحد قال بلى يا رب ‏.‏ قال فماذا عملت فيما آتيتك قال كنت أصل الرحم وأتصدق ‏.‏ فيقول الله له كذبت وتقول له الملائكة كذبت ويقول الله تعالى بل أردت أن يقال فلان جواد فقد قيل ذاك ‏.‏ ويؤتى بالذي قتل في سبيل الله فيقول الله له في ماذا قتلت فيقول أمرت بالجهاد في سبيلك فقاتلت حتى قتلت ‏.‏ فيقول الله تعالى له كذبت وتقول له الملائكة كذبت ويقول الله بل أردت أن يقال فلان جريء فقد قيل ذاك ‏\"‏ ‏.‏ ثم ضرب رسول الله صلى الله عليه وسلم على ركبتي فقال ‏\"‏ يا أبا هريرة أولئك الثلاثة أول خلق الله تسعر بهم النار يوم القيامة ‏\"‏ ‏.‏ وقال الوليد أبو عثمان فأخبرني عقبة بن مسلم أن شفيا هو الذي دخل على معاوية فأخبره بهذا ‏.‏ قال أبو عثمان وحدثني العلاء بن أبي حكيم أنه كان سيافا لمعاوية فدخل عليه رجل فأخبره بهذا عن أبي هريرة فقال معاوية قد فعل بهؤلاء هذا فكيف بمن بقي من الناس ثم بكى معاوية بكاء شديدا حتى ظننا أنه هالك وقلنا قد جاءنا هذا الرجل بشر ثم أفاق معاوية ومسح عن وجهه وقال صدق الله ورسوله ‏:‏ ‏(‏من كان يريد الحياة الدنيا وزينتها نوف إليهم أعمالهم فيها وهم فيها لا يبخسون * أولئك الذين ليس لهم في الآخرة إلا النار وحبط ما صنعوا فيها وباطل ما كانوا يعملون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		}
	]
}