{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"37": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2477,
			"arabicnumber": 2477,
			"text": "حدثنا هناد، حدثنا يونس بن بكير، حدثني عمر بن ذر، حدثنا مجاهد، عن أبي هريرة، قال كان أهل الصفة أضياف أهل الإسلام لا يأوون على أهل ولا مال والله الذي لا إله إلا هو إن كنت لأعتمد بكبدي على الأرض من الجوع وأشد الحجر على بطني من الجوع ولقد قعدت يوما على طريقهم الذي يخرجون فيه فمر بي أبو بكر فسألته عن آية من كتاب الله ما سألته إلا ليستتبعني فمر ولم يفعل ثم مر بي عمر فسألته عن آية من كتاب الله ما أسأله إلا ليستتبعني فمر ولم يفعل ثم مر بي أبو القاسم صلى الله عليه وسلم فتبسم حين رآني وقال ‏\"‏ أبا هريرة ‏\"‏ ‏.‏ قلت لبيك يا رسول الله ‏.‏ قال ‏\"‏ الحق ‏\"‏ ‏.‏ ومضى فاتبعته ودخل منزله فاستأذنت فأذن لي فوجد قدحا من لبن فقال ‏\"‏ من أين هذا اللبن لكم ‏\"‏ ‏.‏ قيل أهداه لنا فلان ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبا هريرة ‏\"‏ ‏.‏ قلت لبيك ‏.‏ فقال ‏\"‏ الحق إلى أهل الصفة فادعهم ‏\"‏ ‏.‏ وهم أضياف أهل الإسلام لا يأوون على أهل ولا مال إذا أتته صدقة بعث بها إليهم ولم يتناول منها شيئا وإذا أتته هدية أرسل إليهم فأصاب منها وأشركهم فيها فساءني ذلك وقلت ما هذا القدح بين أهل الصفة وأنا رسوله إليهم فسيأمرني أن أديره عليهم فما عسى أن يصيبني منه وقد كنت أرجو أن أصيب منه ما يغنيني ولم يكن بد من طاعة الله وطاعة رسوله فأتيتهم فدعوتهم فلما دخلوا عليه فأخذوا مجالسهم فقال ‏\"‏ أبا هريرة خذ القدح وأعطهم ‏\"‏ ‏.‏ فأخذت القدح فجعلت أناوله الرجل فيشرب حتى يروى ثم يرده فأناوله الآخر حتى انتهيت به إلى رسول الله صلى الله عليه وسلم وقد روي القوم كلهم فأخذ رسول الله صلى الله عليه وسلم القدح فوضعه على يديه ثم رفع رأسه فتبسم فقال ‏\"‏ أبا هريرة اشرب ‏\"‏ ‏.‏ فشربت ثم قال ‏\"‏ اشرب ‏\"‏ ‏.‏ فلم أزل أشرب ويقول ‏\"‏ اشرب ‏\"‏ ‏.‏ حتى قلت والذي بعثك بالحق ما أجد له مسلكا فأخذ القدح فحمد الله وسمى ثم شرب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 63
			}
		}
	]
}