{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"38": "Chapters on the description of Paradise"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2557,
			"arabicnumber": 2557,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يجمع الله الناس يوم القيامة في صعيد واحد ثم يطلع عليهم رب العالمين فيقول ألا يتبع كل إنسان ما كانوا يعبدونه ‏.‏ فيمثل لصاحب الصليب صليبه ولصاحب التصاوير تصاويره ولصاحب النار ناره فيتبعون ما كانوا يعبدون ويبقى المسلمون فيطلع عليهم رب العالمين فيقول ألا تتبعون الناس فيقولون نعوذ بالله منك نعوذ بالله منك الله ربنا هذا مكاننا حتى نرى ربنا ‏.‏ وهو يأمرهم ويثبتهم ثم يتوارى ثم يطلع فيقول ألا تتبعون الناس فيقولون نعوذ بالله منك نعوذ بالله منك الله ربنا وهذا مكاننا حتى نرى ربنا ‏.‏ وهو يأمرهم ويثبتهم ‏\"‏ ‏.‏ قالوا وهل نراه يا رسول الله قال ‏\"‏ وهل تضارون في رؤية القمر ليلة البدر ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ قال ‏\"‏ فإنكم لا تضارون في رؤيته تلك الساعة ثم يتوارى ثم يطلع فيعرفهم نفسه ثم يقول أنا ربكم فاتبعوني ‏.‏ فيقوم المسلمون ويوضع الصراط فيمرون عليه مثل جياد الخيل والركاب وقولهم عليه سلم سلم ‏.‏ ويبقى أهل النار فيطرح منهم فيها فوج ثم يقال هل امتلأت فتقول هل من مزيد ‏.‏ ثم يطرح فيها فوج فيقال هل امتلأت ‏.‏ فتقول هل من مزيد ‏.‏ حتى إذا أوعبوا فيها وضع الرحمن قدمه فيها وأزوي بعضها إلى بعض ثم قال قط قالت قط قط فإذا أدخل الله أهل الجنة الجنة وأهل النار النار قال أتي بالموت ملببا فيوقف على السور الذي بين أهل الجنة وأهل النار ثم يقال يا أهل الجنة ‏.‏ فيطلعون خائفين ثم يقال يا أهل النار ‏.‏ فيطلعون مستبشرين يرجون الشفاعة فيقال لأهل الجنة وأهل النار هل تعرفون هذا فيقولون هؤلاء وهؤلاء قد عرفناه هو الموت الذي وكل بنا ‏.‏ فيضجع فيذبح ذبحا على السور الذي بين الجنة والنار ثم يقال يا أهل الجنة خلود لا موت ويا أهل النار خلود لا موت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ - وقد روي عن النبي صلى الله عليه وسلم روايات كثيرة مثل هذا ما يذكر فيه أمر الرؤية أن الناس يرون ربهم وذكر القدم وما أشبه هذه الأشياء والمذهب في هذا عند أهل العلم من الأئمة مثل سفيان الثوري ومالك بن أنس وابن المبارك وابن عيينة ووكيع وغيرهم أنهم رووا هذه الأشياء ثم قالوا تروى هذه الأحاديث ونؤمن بها ولا يقال كيف وهذا الذي اختاره أهل الحديث أن تروى هذه الأشياء كما جاءت ويؤمن بها ولا تفسر ولا تتوهم ولا يقال كيف وهذا أمر أهل العلم الذي اختاروه وذهبوا إليه ‏.‏ ومعنى قوله في الحديث ‏\"‏ فيعرفهم نفسه ‏\"‏ ‏.‏ يعني يتجلى لهم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		}
	]
}