{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"40": "The Book on Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن الصنابحي، عن عبادة بن الصامت، أنه قال دخلت عليه وهو في الموت فبكيت فقال مهلا لم تبكي فوالله لئن استشهدت لأشهدن لك ولئن شفعت لأشفعن لك ولئن استطعت لأنفعنك ثم قال والله ما من حديث سمعته من رسول الله صلى الله عليه وسلم لكم فيه خير إلا حدثتكموه إلا حديثا واحدا وسوف أحدثكموه اليوم وقد أحيط بنفسي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شهد أن لا إله إلا الله وأن محمدا رسول الله حرم الله عليه النار ‏\"‏ ‏.‏ وفي الباب عن أبي بكر وعمر وعثمان وعلي وطلحة وجابر وابن عمر وزيد بن خالد ‏.‏ قال سمعت ابن أبي عمر يقول سمعت ابن عيينة يقول محمد بن عجلان كان ثقة مأمونا في الحديث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه والصنابحي هو عبد الرحمن بن عسيلة أبو عبد الله ‏.‏ وقد روي عن الزهري أنه سئل عن قول النبي صلى الله عليه وسلم ‏\"‏ من قال لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏ فقال إنما كان هذا في أول الإسلام قبل نزول الفرائض والأمر والنهى ‏.‏ قال أبو عيسى ووجه هذا الحديث عند بعض أهل العلم أن أهل التوحيد سيدخلون الجنة وإن عذبوا بالنار بذنوبهم فإنهم لا يخلدون في النار ‏.‏ وقد روي عن عبد الله بن مسعود وأبي ذر وعمران بن حصين وجابر بن عبد الله وابن عباس وأبي سعيد الخدري وأنس بن مالك عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ سيخرج قوم من النار من أهل التوحيد ويدخلون الجنة ‏\"‏ ‏.‏ هكذا روي عن سعيد بن جبير وإبراهيم النخعي وغير واحد من التابعين وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم في تفسير هذه الآية‏:‏ ‏(‏ربما يود الذين كفروا لو كانوا مسلمين‏)‏ قالوا إذا أخرج أهل التوحيد من النار وأدخلوا الجنة يود الذين كفروا لو كانوا مسلمين ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 33
			}
		}
	]
}