{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2953,
			"arabicnumber": 2953,
			"text": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج فهي خداج غير تمام ‏\"‏ ‏.‏ قال قلت يا أبا هريرة إني أحيانا أكون وراء الإمام ‏.‏ قال يا ابن الفارسي فاقرأها في نفسك فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله تعالى قسمت الصلاة بيني وبين عبدي نصفين فنصفها لي ونصفها لعبدي ولعبدي ما سأل يقوم العبد فيقرأ ‏:‏ ‏(‏الحمد لله رب العالمين ‏)‏ فيقول الله حمدني عبدي فيقول ‏:‏ ‏(‏الرحمن الرحيم ‏)‏ فيقول الله أثنى على عبدي فيقول ‏:‏ ‏(‏ مالك يوم الدين ‏)‏ فيقول مجدني عبدي وهذا لي وبيني وبين عبدي ‏:‏ ‏(‏إياك نعبد وإياك نستعين ‏)‏ وآخر السورة لعبدي ولعبدي ما سأل يقول ‏:‏ ‏(‏اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى شعبة وإسماعيل بن جعفر وغير واحد عن العلاء بن عبد الرحمن عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا الحديث ‏.‏ وروى ابن جريج ومالك بن أنس عن العلاء بن عبد الرحمن عن أبي السائب مولى هشام بن زهرة عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ وروى ابن أبي أويس، عن أبيه، عن العلاء بن عبد الرحمن، قال حدثني أبي وأبو السائب، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ أخبرنا بذلك محمد بن يحيى النيسابوري ويعقوب بن سفيان الفارسي قالا حدثنا إسماعيل بن أبي أويس عن أبيه عن العلاء بن عبد الرحمن حدثني أبي وأبو السائب مولى هشام بن زهرة وكانا جليسين لأبي هريرة عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج فهي خداج غير تمام ‏\"‏ ‏.‏ وليس في حديث إسماعيل بن أبي أويس أكثر من هذا ‏.‏ وسألت أبا زرعة عن هذا الحديث فقال كلا الحديثين صحيح ‏.‏ واحتج بحديث ابن أبي أويس عن أبيه عن العلاء ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2953.2,
			"arabicnumber": 2953.2,
			"text": "أخبرنا عبد بن حميد، أخبرنا عبد الرحمن بن سعد، أنبأنا عمرو بن أبي قيس، عن سماك بن حرب، عن عباد بن حبيش، عن عدي بن حاتم، قال أتيت رسول الله صلى الله عليه وسلم وهو جالس في المسجد فقال القوم هذا عدي بن حاتم ‏.‏ وجئت بغير أمان ولا كتاب فلما دفعت إليه أخذ بيدي وقد كان قال قبل ذلك إني لأرجو أن يجعل الله يده في يدي قال فقام بي فلقيته امرأة وصبي معها ‏.‏ فقالا إن لنا إليك حاجة فقام معهما حتى قضى حاجتهما ثم أخذ بيدي حتى أتى بي داره فألقت له الوليدة وسادة فجلس عليها وجلست بين يديه فحمد الله وأثنى عليه ثم قال ‏\"‏ ما يفرك أن تقول لا إله إلا الله فهل تعلم من إله سوى الله ‏\"‏ ‏.‏ قال قلت لا ‏.‏ قال ثم تكلم ساعة ثم قال ‏\"‏ إنما تفر أن تقول الله أكبر وتعلم أن شيئا أكبر من الله ‏\"‏ ‏.‏ قال قلت لا قال ‏\"‏ فإن اليهود مغضوب عليهم وإن النصارى ضلال ‏\"‏ ‏.‏ قال قلت فإني جئت مسلما ‏.‏ قال فرأيت وجهه تبسط فرحا قال ثم أمر بي فأنزلت عند رجل من الأنصار جعلت أغشاه آتيه طرفى النهار قال فبينا أنا عنده عشية إذ جاءه قوم في ثياب من الصوف من هذه النمار قال فصلى وقام فحث عليهم ثم قال ‏\"‏ ولو صاع ولو بنصف صاع ولو بقبضة ولو ببعض قبضة يقي أحدكم وجهه حر جهنم أو النار ولو بتمرة ولو بشق تمرة فإن أحدكم لاقي الله وقائل له ما أقول لكم ألم أجعل لك سمعا وبصرا فيقول بلى ‏.‏ فيقول ألم أجعل لك مالا وولدا فيقول بلى ‏.‏ فيقول أين ما قدمت لنفسك فينظر قدامه وبعده وعن يمينه وعن شماله ثم لا يجد شيئا يقي به وجهه حر جهنم ليق أحدكم وجهه النار ولو بشق تمرة فإن لم يجد فبكلمة طيبة فإني لا أخاف عليكم الفاقة فإن الله ناصركم ومعطيكم حتى تسير الظعينة فيما بين يثرب والحيرة أكثر ما تخاف على مطيتها السرق ‏\"‏ ‏.‏ قال فجعلت أقول في نفسي فأين لصوص طيئ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث سماك بن حرب ‏.‏ وروى شعبة عن سماك بن حرب عن عباد بن حبيش عن عدي بن حاتم عن النبي صلى الله عليه وسلم الحديث بطوله ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}