{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3036,
			"arabicnumber": 3036,
			"text": "حدثنا الحسن بن أحمد بن أبي شعيب أبو مسلم الحراني، حدثنا محمد بن سلمة الحراني، حدثنا محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن أبيه، عن جده، قتادة بن النعمان قال كان أهل بيت منا يقال لهم بنو أبيرق بشر وبشير ومبشر وكان بشير رجلا منافقا يقول الشعر يهجو به أصحاب رسول الله صلى الله عليه وسلم ثم ينحله بعض العرب ثم يقول قال فلان كذا وكذا قال فلان كذا وكذا فإذا سمع أصحاب رسول الله صلى الله عليه وسلم ذلك الشعر قالوا والله ما يقول هذا الشعر إلا هذا الخبيث أو كما قال الرجل وقالوا ابن الأبيرق قالها قال وكان أهل بيت حاجة وفاقة في الجاهلية والإسلام وكان الناس إنما طعامهم بالمدينة التمر والشعير وكان الرجل إذا كان له يسار فقدمت ضافطة من الشام من الدرمك ابتاع الرجل منها فخص بها نفسه وأما العيال فإنما طعامهم التمر والشعير فقدمت ضافطة من الشام فابتاع عمي رفاعة بن زيد حملا من الدرمك فجعله في مشربة له وفي المشربة سلاح ودرع وسيف فعدي عليه من تحت البيت فنقبت المشربة وأخذ الطعام والسلاح فلما أصبح أتاني عمي رفاعة فقال يا ابن أخي إنه قد عدي علينا في ليلتنا هذه فنقبت مشربتنا فذهب بطعامنا وسلاحنا ‏.‏ قال فتحسسنا في الدار وسألنا فقيل لنا قد رأينا بني أبيرق استوقدوا في هذه الليلة ولا نرى فيما نرى إلا على بعض طعامكم ‏.‏ قال وكان بنو أبيرق قالوا ونحن نسأل في الدار والله ما نرى صاحبكم إلا لبيد بن سهل رجل منا له صلاح وإسلام فلما سمع لبيد اخترط سيفه وقال أنا أسرق فوالله ليخالطنكم هذا السيف أو لتبينن هذه السرقة ‏.‏ قالوا إليك عنها أيها الرجل فما أنت بصاحبها ‏.‏ فسألنا في الدار حتى لم نشك أنهم أصحابها فقال لي عمي يا ابن أخي لو أتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له ‏.‏ قال قتادة فأتيت رسول الله صلى الله عليه وسلم فقلت إن أهل بيت منا أهل جفاء عمدوا إلى عمي رفاعة بن زيد فنقبوا مشربة له وأخذوا سلاحه وطعامه فليردوا علينا سلاحنا فأما الطعام فلا حاجة لنا فيه ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ سآمر في ذلك ‏\"‏ ‏.‏ فلما سمع بنو أبيرق أتوا رجلا منهم يقال له أسير بن عروة فكلموه في ذلك فاجتمع في ذلك ناس من أهل الدار فقالوا يا رسول الله إن قتادة بن النعمان وعمه عمدا إلى أهل بيت منا أهل إسلام وصلاح يرمونهم بالسرقة من غير بينة ولا ثبت ‏.‏ قال قتادة فأتيت رسول الله صلى الله عليه وسلم فكلمته فقال ‏\"‏ عمدت إلى أهل بيت ذكر منهم إسلام وصلاح ترميهم بالسرقة على غير ثبت ولا بينة ‏\"‏ ‏.‏ قال فرجعت ولوددت أني خرجت من بعض مالي ولم أكلم رسول الله صلى الله عليه وسلم في ذلك فأتاني عمي رفاعة فقال يا ابن أخي ما صنعت فأخبرته بما قال لي رسول الله صلى الله عليه وسلم فقال الله المستعان فلم يلبث أن نزل القرآن ‏:‏ ‏(‏ إنا أنزلنا إليك الكتاب بالحق لتحكم بين الناس بما أراك الله ولا تكن للخائنين خصيما ‏)‏ بني أبيرق ‏:‏ ‏(‏ واستغفر الله ‏)‏ أى مما قلت لقتادة ‏:‏ ‏(‏ إن الله كان غفورا رحيما * ولا تجادل عن الذين يختانون أنفسهم إن الله لا يحب من كان خوانا أثيما * يستخفون من الناس ولا يستخفون من الله ‏)‏ إلى قوله ‏:‏ ‏(‏ غفورا رحيما ‏)‏ أى لو استغفروا الله لغفر لهم ‏:‏ ‏(‏ ومن يكسب إثما فإنما يكسبه على نفسه ‏)‏ إلى قوله ‏:‏ ‏(‏ إثما مبينا ‏)‏ قولهم للبيد ‏:‏ ولولا فضل الله عليك ورحمته ‏)‏ إلى قوله ‏:‏ ‏(‏ فسوف نؤتيه أجرا عظيما ‏)‏ فلما نزل القرآن أتي رسول الله صلى الله عليه وسلم بالسلاح فرده إلى رفاعة فقال قتادة لما أتيت عمي بالسلاح وكان شيخا قد عسي أو عشي في الجاهلية وكنت أرى إسلامه مدخولا فلما أتيته بالسلاح قال يا ابن أخي هو في سبيل الله فعرفت أن إسلامه كان صحيحا فلما نزل القرآن لحق بشير بالمشركين فنزل على سلافة بنت سعد ابن سمية فأنزل الله ‏:‏ ‏(‏ ومن يشاقق الرسول من بعد ما تبين له الهدى ويتبع غير سبيل المؤمنين نوله ما تولى ونصله جهنم وساءت مصيرا * إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء ومن يشرك بالله فقد ضل ضلالا بعيدا ‏)‏ فلما نزل على سلافة رماها حسان بن ثابت بأبيات من شعره فأخذت رحله فوضعته على رأسها ثم خرجت به فرمت به في الأبطح ثم قالت أهديت لي شعر حسان ما كنت تأتيني بخير ‏.‏ قال أبو عيسى هذا حديث غريب لا نعلم أحدا أسنده غير محمد بن سلمة الحراني ‏.‏ وروى يونس بن بكير وغير واحد هذا الحديث عن محمد بن إسحاق عن عاصم بن عمر بن قتادة مرسل لم يذكروا فيه عن أبيه عن جده وقتادة بن النعمان هو أخو أبي سعيد الخدري لأمه وأبو سعيد الخدري اسمه سعد بن مالك بن سنان ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 88
			}
		}
	]
}