{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3104,
			"arabicnumber": 3104,
			"text": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا إبراهيم بن سعد، عن الزهري، عن أنس، أن حذيفة، قدم على عثمان بن عفان وكان يغازي أهل الشام في فتح أرمينية وأذربيجان مع أهل العراق فرأى حذيفة اختلافهم في القرآن فقال لعثمان بن عفان يا أمير المؤمنين أدرك هذه الأمة قبل أن يختلفوا في الكتاب كما اختلفت اليهود والنصارى فأرسل إلى حفصة أن أرسلي إلينا بالصحف ننسخها في المصاحف ثم نردها إليك فأرسلت حفصة إلى عثمان بالصحف فأرسل عثمان إلى زيد بن ثابت وسعيد بن العاصي وعبد الرحمن بن الحارث بن هشام وعبد الله بن الزبير أن انسخوا الصحف في المصاحف وقال للرهط القرشيين الثلاثة ما اختلفتم فيه أنتم وزيد بن ثابت فاكتبوه بلسان قريش فإنما نزل بلسانهم ‏.‏ حتى نسخوا الصحف في المصاحف بعث عثمان إلى كل أفق بمصحف من تلك المصاحف التي نسخوا ‏.‏ قال الزهري وحدثني خارجة بن زيد بن ثابت أن زيد بن ثابت قال فقدت آية من سورة الأحزاب كنت أسمع رسول الله صلى الله عليه وسلم يقرؤها ‏:‏ ‏(‏ من المؤمنين رجال صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه ‏)‏ فالتمستها فوجدتها مع خزيمة بن ثابت أو أبي خزيمة فألحقتها في سورتها ‏.‏ قال الزهري فاختلفوا يومئذ في التابوت والتابوه فقال القرشيون التابوت ‏.‏ وقال زيد التابوه ‏.‏ فرفع اختلافهم إلى عثمان فقال اكتبوه التابوت فإنه نزل بلسان قريش ‏.‏ قال الزهري فأخبرني عبيد الله بن عبد الله بن عتبة أن عبد الله بن مسعود كره لزيد بن ثابت نسخ المصاحف وقال يا معشر المسلمين أعزل عن نسخ كتابة المصحف ويتولاها رجل والله لقد أسلمت وإنه لفي صلب رجل كافر يريد زيد بن ثابت ولذلك قال عبد الله بن مسعود يا أهل العراق اكتموا المصاحف التي عندكم وغلوها فإن الله يقول ‏:‏ ‏(‏ ومن يغلل يأت بما غل يوم القيامة ‏)‏ فالقوا الله بالمصاحف ‏.‏ قال الزهري فبلغني أن ذلك كرهه من مقالة ابن مسعود رجال من أفاضل أصحاب النبي صلى الله عليه وسلم ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وهو حديث الزهري لا نعرفه إلا من حديثه ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 156
			}
		}
	]
}