{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"2": "The Book on Salat (Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 312,
			"arabicnumber": 312,
			"text": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن ابن أكيمة الليثي، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم انصرف من صلاة جهر فيها بالقراءة فقال ‏\"‏ هل قرأ معي أحد منكم آنفا ‏\"‏ ‏.‏ فقال رجل نعم يا رسول الله ‏.‏ قال ‏\"‏ إني أقول ما لي أنازع القرآن ‏\"‏ ‏.‏ قال فانتهى الناس عن القراءة مع رسول الله صلى الله عليه وسلم فيما جهر فيه رسول الله صلى الله عليه وسلم من الصلوات بالقراءة حين سمعوا ذلك من رسول الله صلى الله عليه وسلم ‏.‏ قال وفي الباب عن ابن مسعود وعمران بن حصين وجابر بن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وابن أكيمة الليثي اسمه عمارة ‏.‏ ويقال عمرو بن أكيمة ‏.‏ وروى بعض أصحاب الزهري هذا الحديث وذكروا هذا الحرف قال قال الزهري فانتهى الناس عن القراءة حين سمعوا ذلك من رسول الله صلى الله عليه وسلم ‏.‏ وليس في هذا الحديث ما يدخل على من رأى القراءة خلف الإمام لأن أبا هريرة هو الذي روى عن النبي صلى الله عليه وسلم هذا الحديث وروى أبو هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج فهي خداج غير تمام ‏\"‏ ‏.‏ فقال له حامل الحديث إني أكون أحيانا وراء الإمام قال اقرأ بها في نفسك ‏.‏ وروى أبو عثمان النهدي عن أبي هريرة قال أمرني النبي صلى الله عليه وسلم أن أنادي أن لا صلاة إلا بقراءة فاتحة الكتاب ‏.‏ واختار أكثر أصحاب الحديث أن لا يقرأ الرجل إذا جهر الإمام بالقراءة وقالوا يتتبع سكتات الإمام ‏.‏ وقد اختلف أهل العلم في القراءة خلف الإمام فرأى أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم القراءة خلف الإمام وبه يقول مالك بن أنس وعبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏ وروي عن عبد الله بن المبارك أنه قال أنا أقرأ خلف الإمام والناس يقرءون إلا قوما من الكوفيين وأرى أن من لم يقرأ صلاته جائزة ‏.‏ وشدد قوم من أهل العلم في ترك قراءة فاتحة الكتاب وإن كان خلف الإمام فقالوا لا تجزئ صلاة إلا بقراءة فاتحة الكتاب وحده كان أو خلف الإمام ‏.‏ وذهبوا إلى ما روى عبادة بن الصامت عن النبي صلى الله عليه وسلم ‏.‏ وقرأ عبادة بن الصامت بعد النبي صلى الله عليه وسلم خلف الإمام وتأول قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة إلا بقراءة فاتحة الكتاب ‏\"‏ ‏.‏ وبه يقول الشافعي وإسحاق وغيرهما ‏.‏ وأما أحمد بن حنبل فقال معنى قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ إذا كان وحده ‏.‏ واحتج بحديث جابر بن عبد الله حيث قال من صلى ركعة لم يقرأ فيها بأم القرآن فلم يصل إلا أن يكون وراء الإمام ‏.‏ قال أحمد بن حنبل فهذا رجل من أصحاب النبي صلى الله عليه وسلم تأول قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ أن هذا إذا كان وحده ‏.‏ واختار أحمد مع هذا القراءة خلف الإمام وأن لا يترك الرجل فاتحة الكتاب وإن كان خلف الإمام ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 164
			}
		}
	]
}