{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3180,
			"arabicnumber": 3180,
			"text": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، عن هشام بن عروة، أخبرني أبي، عن عائشة، قالت لما ذكر من شأني الذي ذكر وما علمت به قام رسول الله صلى الله عليه وسلم في خطيبا فتشهد وحمد الله وأثنى عليه بما هو أهله ثم قال ‏\"‏ أما بعد أشيروا على في أناس أبنوا أهلي والله ما علمت على أهلي من سوء قط وأبنوا بمن والله ما علمت عليه من سوء قط ولا دخل بيتي قط إلا وأنا حاضر ولا غبت في سفر إلا غاب معي فقام سعد بن معاذ رضي الله عنه فقال ائذن لي يا رسول الله أن أضرب أعناقهم ‏.‏ وقام رجل من الخزرج وكانت أم حسان بن ثابت من رهط ذلك الرجل فقال كذبت أما والله أن لو كانوا من الأوس ما أحببت أن تضرب أعناقهم حتى كاد أن يكون بين الأوس والخزرج شر في المسجد وما علمت به فلما كان مساء ذلك اليوم خرجت لبعض حاجتي ومعي أم مسطح فعثرت فقالت تعس مسطح فقلت لها أى أم تسبين ابنك فسكتت ثم عثرت الثانية فقالت تعس مسطح فقلت لها أى أم تسبين ابنك فسكتت ثم عثرت الثالثة فقالت تعس مسطح فانتهرتها فقلت لها أى أم تسبين ابنك فقالت والله ما أسبه إلا فيك ‏.‏ فقلت في أى شيء قالت فبقرت إلى الحديث قلت وقد كان هذا قالت نعم ‏.‏ والله لقد رجعت إلى بيتي وكأن الذي خرجت له لم أخرج لا أجد منه قليلا ولا كثيرا ووعكت فقلت لرسول الله صلى الله عليه وسلم أرسلني إلى بيت أبي فأرسل معي الغلام فدخلت الدار فوجدت أم رومان في السفل وأبو بكر فوق البيت يقرأ فقالت أمي ما جاء بك يا بنية قالت فأخبرتها وذكرت لها الحديث فإذا هو لم يبلغ منها ما بلغ مني قالت يا بنية خففي عليك الشأن فإنه والله لقلما كانت امرأة حسناء عند رجل يحبها لها ضرائر إلا حسدنها وقيل فيها فإذا هي لم يبلغ منها ما بلغ مني قالت قلت وقد علم به أبي قالت نعم ‏.‏ قلت ورسول الله صلى الله عليه وسلم قالت نعم ‏.‏ واستعبرت وبكيت فسمع أبو بكر صوتي وهو فوق البيت يقرأ فنزل فقال لأمي ما شأنها قالت بلغها الذي ذكر من شأنها ‏.‏ ففاضت عيناه فقال أقسمت عليك يا بنية إلا رجعت إلى بيتك ‏.‏ فرجعت ولقد جاء رسول الله صلى الله عليه وسلم بيتي فسأل عني خادمتي فقالت لا والله ما علمت عليها عيبا إلا أنها كانت ترقد حتى تدخل الشاة فتأكل خميرتها أو عجينتها وانتهرها بعض أصحابه فقال أصدقي رسول الله صلى الله عليه وسلم حتى أسقطوا لها به فقالت سبحان الله والله ما علمت عليها إلا ما يعلم الصائغ على تبر الذهب الأحمر فبلغ الأمر ذلك الرجل الذي قيل له فقال سبحان الله والله ما كشفت كنف أنثى قط قالت عائشة فقتل شهيدا في سبيل الله قالت وأصبح أبواى عندي فلم يزالا عندي حتى دخل على رسول الله صلى الله عليه وسلم وقد صلى العصر ثم دخل وقد اكتنفني أبواى عن يميني وعن شمالي فتشهد النبي صلى الله عليه وسلم فحمد الله وأثنى عليه بما هو أهله ثم قال ‏\"‏ أما بعد يا عائشة إن كنت قارفت سوءا أو ظلمت فتوبي إلى الله فإن الله يقبل التوبة عن عباده ‏\"‏ ‏.‏ قالت وقد جاءت امرأة من الأنصار وهي جالسة بالباب فقلت ألا تستحي من هذه المرأة أن تذكر شيئا ‏.‏ فوعظ رسول الله صلى الله عليه وسلم فالتفت إلى أبي فقلت أجبه ‏.‏ قال فماذا أقول فالتفت إلى أمي فقلت أجيبيه ‏.‏ قالت أقول ماذا قالت فلما لم يجيبا تشهدت فحمدت الله وأثنيت عليه بما هو أهله ثم قلت أما والله لئن قلت لكم إني لم أفعل والله يشهد إني لصادقة ما ذاك بنافعي عندكم لي لقد تكلمتم وأشربت قلوبكم ولئن قلت إني قد فعلت والله يعلم أني لم أفعل لتقولن إنها قد باءت به على نفسها وإني والله ما أجد لي ولكم مثلا قالت والتمست اسم يعقوب فلم أقدر عليه إلا أبا يوسف حين قال ‏:‏ ‏(‏فصبر جميل والله المستعان على ما تصفون ‏)‏ قالت وأنزل على رسول الله صلى الله عليه وسلم من ساعته فسكتنا فرفع عنه وإني لأتبين السرور في وجهه وهو يمسح جبينه ويقول ‏\"‏ البشرى يا عائشة فقد أنزل الله براءتك ‏\"‏ ‏.‏ قالت وكنت أشد ما كنت غضبا فقال لي أبواى قومي إليه ‏.‏ فقلت لا والله لا أقوم إليه ولا أحمده ولا أحمدكما ولكن أحمد الله الذي أنزل براءتي لقد سمعتموه فما أنكرتموه ولا غيرتموه وكانت عائشة تقول أما زينب بنت جحش فعصمها الله بدينها فلم تقل إلا خيرا وأما أختها حمنة فهلكت فيمن هلك وكان الذي يتكلم فيه مسطح وحسان بن ثابت والمنافق عبد الله بن أبى ابن سلول وهو الذي كان يسوسه ويجمعه وهو الذي تولى كبره منهم هو وحمنة قالت فحلف أبو بكر أن لا ينفع مسطحا بنافعة أبدا فأنزل الله تعالى هذه الآية ‏:‏ ‏(‏ولا يأتل أولو الفضل منكم والسعة ‏)‏ إلى آخر الآية يعني أبا بكر ‏:‏ ‏(‏أن يؤتوا أولي القربى والمساكين والمهاجرين في سبيل الله ‏)‏ يعني مسطحا إلى قوله ‏:‏ ‏(‏ألا تحبون أن يغفر الله لكم والله غفور رحيم ‏)‏ قال أبو بكر بلى والله يا ربنا إنا لنحب أن تغفر لنا وعاد له بما كان يصنع ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث هشام بن عروة ‏.‏ وقد رواه يونس بن يزيد ومعمر وغير واحد عن الزهري عن عروة بن الزبير وسعيد بن المسيب وعلقمة بن وقاص الليثي وعبيد الله بن عبد الله عن عائشة هذا الحديث أطول من حديث هشام بن عروة وأتم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 232
			}
		}
	]
}