{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3218,
			"arabicnumber": 3218,
			"text": "حدثنا قتيبة بن سعيد، حدثنا جعفر بن سليمان الضبعي، عن الجعد بن عثمان، عن أنس بن مالك، رضى الله عنه قال تزوج رسول الله صلى الله عليه وسلم فدخل بأهله - قال - فصنعت أمي أم سليم حيسا فجعلته في تور فقالت يا أنس اذهب بهذا إلى رسول الله صلى الله عليه وسلم فقل له بعثت إليك بها أمي وهي تقرئك السلام وتقول إن هذا لك منا قليل يا رسول الله ‏.‏ قال فذهبت به إلى رسول الله صلى الله عليه وسلم فقلت إن أمي تقرئك السلام وتقول إن هذا منا لك قليل ‏.‏ فقال ‏\"‏ ضعه ‏\"‏ ‏.‏ ثم قال ‏\"‏ اذهب فادع لي فلانا وفلانا وفلانا ومن لقيت ‏\"‏ ‏.‏ فسمى رجالا قال فدعوت من سمى ومن لقيت قال قلت لأنس عددكم كم كانوا قال زهاء ثلاثمائة ‏.‏ قال وقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أنس هات التور ‏\"‏ ‏.‏ قال فدخلوا حتى امتلأت الصفة والحجرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليتحلق عشرة عشرة وليأكل كل إنسان مما يليه ‏\"‏ ‏.‏ قال فأكلوا حتى شبعوا قال فخرجت طائفة ودخلت طائفة حتى أكلوا كلهم ‏.‏ قال فقال لي ‏\"‏ يا أنس ارفع ‏\"‏ ‏.‏ قال فرفعت فما أدري حين وضعت كان أكثر أم حين رفعت قال وجلس منهم طوائف يتحدثون في بيت رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم جالس وزوجته مولية وجهها إلى الحائط فثقلوا على رسول الله صلى الله عليه وسلم فخرج رسول الله صلى الله عليه وسلم فسلم على نسائه ثم رجع فلما رأوا رسول الله صلى الله عليه وسلم قد رجع ظنوا أنهم قد ثقلوا عليه قال فابتدروا الباب فخرجوا كلهم وجاء رسول الله صلى الله عليه وسلم حتى أرخى الستر ودخل وأنا جالس في الحجرة فلم يلبث إلا يسيرا حتى خرج على وأنزلت هذه الآيات فخرج رسول الله صلى الله عليه وسلم فقرأهن على الناس ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه ‏)‏ إلى آخر الآية ‏.‏ قال الجعد قال أنس أنا أحدث الناس عهدا بهذه الآيات وحجبن نساء رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والجعد هو ابن عثمان ويقال هو ابن دينار ويكنى أبا عثمان بصري وهو ثقة عند أهل الحديث روى عنه يونس بن عبيد وشعبة وحماد بن زيد ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 270
			}
		}
	]
}