{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3313,
			"arabicnumber": 3313,
			"text": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن السدي، عن أبي سعيد الأزدي، حدثنا زيد بن أرقم، قال غزونا مع رسول الله صلى الله عليه وسلم وكان معنا أناس من الأعراب فكنا نبتدر الماء وكان الأعراب يسبقونا إليه فسبق أعرابي أصحابه فسبق الأعرابي فيملأ الحوض ويجعل حوله حجارة ويجعل النطع عليه حتى يجيء أصحابه ‏.‏ قال فأتى رجل من الأنصار أعرابيا فأرخى زمام ناقته لتشرب فأبى أن يدعه فانتزع قباض الماء فرفع الأعرابي خشبته فضرب بها رأس الأنصاري فشجه فأتى عبد الله بن أبى رأس المنافقين فأخبره وكان من أصحابه فغضب عبد الله بن أبى ثم قال ‏:‏ ‏(‏لا تنفقوا على من عند رسول الله حتى ينفضوا ‏)‏ من حوله ‏.‏ يعني الأعراب وكانوا يحضرون رسول الله صلى الله عليه وسلم عند الطعام فقال عبد الله إذا انفضوا من عند محمد فائتوا محمدا بالطعام فليأكل هو ومن عنده ثم قال لأصحابه لئن رجعتم إلى المدينة ليخرجن الأعز منها الأذل ‏.‏ قال زيد وأنا ردف رسول الله صلى الله عليه وسلم قال فسمعت عبد الله بن أبى فأخبرت عمي فانطلق فأخبر رسول الله صلى الله عليه وسلم فأرسل إليه رسول الله صلى الله عليه وسلم فحلف وجحد ‏.‏ قال فصدقه رسول الله صلى الله عليه وسلم وكذبني قال فجاء عمي إلى فقال ما أردت إلا أن مقتك رسول الله صلى الله عليه وسلم وكذبك والمسلمون ‏.‏ قال فوقع على من الهم ما لم يقع على أحد ‏.‏ قال فبينما أنا أسير مع رسول الله صلى الله عليه وسلم في سفر قد خفقت برأسي من الهم إذ أتاني رسول الله صلى الله عليه وسلم فعرك أذني وضحك في وجهي فما كان يسرني أن لي بها الخلد في الدنيا ‏.‏ ثم إن أبا بكر لحقني فقال ما قال لك رسول الله صلى الله عليه وسلم قلت ما قال شيئا إلا أنه عرك أذني وضحك في وجهي ‏.‏ فقال أبشر ‏.‏ ثم لحقني عمر فقلت له مثل قولي لأبي بكر فلما أصبحنا قرأ رسول الله صلى الله عليه وسلم سورة المنافقين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 365
			}
		}
	]
}