{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3318,
			"arabicnumber": 3318,
			"text": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، عن معمر، عن الزهري، عن عبيد الله بن عبد الله بن أبي ثور، قال سمعت ابن عباس، رضى الله عنهما يقول لم أزل حريصا أن أسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله عز وجل ‏:‏ ‏(‏إن تتوبا إلى الله فقد صغت قلوبكما ‏)‏ حتى حج عمر وحججت معه فصببت عليه من الإداوة فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله : ( إن تتوبا إلى الله فقد صغت قلوبكما وإن تظاهرا عليه فإن الله هو مولاه ‏)‏ فقال لي واعجبا لك يا ابن عباس قال الزهري وكره والله ما سأله عنه ولم يكتمه فقال لي هي عائشة وحفصة قال ثم أنشأ يحدثني الحديث فقال كنا معشر قريش نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فتغضبت على امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني فقالت ما تنكر من ذلك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ قال قلت في نفسي قد خابت من فعلت ذلك منهن وخسرت ‏.‏ قال وكان منزلي بالعوالي في بني أمية وكان لي جار من الأنصار كنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم فينزل يوما فيأتيني بخبر الوحى وغيره وأنزل يوما فآتيه بمثل ذلك ‏.‏ قال وكنا نحدث أن غسان تنعل الخيل لتغزونا ‏.‏ قال فجاءني يوما عشاء فضرب على الباب فخرجت إليه فقال حدث أمر عظيم ‏.‏ قلت أجاءت غسان قال أعظم من ذلك طلق رسول الله صلى الله عليه وسلم نساءه ‏.‏ قال قلت في نفسي قد خابت حفصة وخسرت قد كنت أظن هذا كائنا قال فلما صليت الصبح شددت على ثيابي ثم انطلقت حتى دخلت على حفصة فإذا هي تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم قالت لا أدري هو ذا معتزل في هذه المشربة ‏.‏ قال فانطلقت فأتيت غلاما أسود فقلت استأذن لعمر ‏.‏ قال فدخل ثم خرج إلى ‏.‏ قال قد ذكرتك له فلم يقل شيئا ‏.‏ قال فانطلقت إلى المسجد فإذا حول المنبر نفر يبكون فجلست إليهم ثم غلبني ما أجد فأتيت الغلام فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى فقال قد ذكرتك له فلم يقل شيئا ‏.‏ قال فانطلقت إلى المسجد أيضا فجلست ثم غلبني ما أجد فأتيت الغلام فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى فقال قد ذكرتك له فلم يقل شيئا ‏.‏ قال فوليت منطلقا فإذا الغلام يدعوني فقال ادخل فقد أذن لك فدخلت فإذا النبي صلى الله عليه وسلم متكئ على رمل حصير قد رأيت أثره في جنبه فقلت يا رسول الله أطلقت نساءك قال لا ‏.‏ قلت الله أكبر لقد رأيتنا يا رسول الله ونحن معشر قريش نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فتغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت ذلك فقالت ما تنكر فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ قال فقلت لحفصة أتراجعين رسول الله صلى الله عليه وسلم قالت نعم وتهجره إحدانا اليوم إلى الليل ‏.‏ فقلت قد خابت من فعلت ذلك منكن وخسرت أتأمن إحداكن أن يغضب الله عليها لغضب رسوله فإذا هي قد هلكت فتبسم النبي صلى الله عليه وسلم ‏.‏ قال فقلت لحفصة لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني ما بدا لك ولا يغرنك أن كانت صاحبتك أوسم منك وأحب إلى رسول الله صلى الله عليه وسلم ‏.‏ قال فتبسم أخرى فقلت يا رسول الله أستأنس قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فرفعت رأسي فما رأيت في البيت إلا أهبة ثلاثة ‏.‏ قال فقلت يا رسول الله ادع الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدونه ‏.‏ فاستوى جالسا فقال ‏\"‏ أوفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏ ‏.‏ قال وكان أقسم أن لا يدخل على نسائه شهرا فعاتبه الله في ذلك وجعل له كفارة اليمين ‏.‏ قال الزهري فأخبرني عروة، عن عائشة، قالت فلما مضت تسع وعشرون دخل على النبي صلى الله عليه وسلم بدأ بي فقال ‏\"‏ يا عائشة إني ذاكر لك شيئا فلا تعجلي حتى تستأمري أبويك ‏\"‏ ‏.‏ قالت ثم قرأ هذه الآية ‏(‏ يا أيها النبي قل لأزواجك ‏)‏ الآية ‏.‏ قالت علم والله أن أبوى لم يكونا يأمراني بفراقه فقلت أفي هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة ‏.‏ قال معمر فأخبرني أيوب أن عائشة قالت له يا رسول الله لا تخبر أزواجك أني اخترتك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنما بعثني الله مبلغا ولم يبعثني متعنتا ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب قد روي من غير وجه عن ابن عباس ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 370
			}
		}
	]
}