{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"47": "Chapters on Tafsir"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3340,
			"arabicnumber": 3340,
			"text": "حدثنا محمود بن غيلان، وعبد بن حميد، - المعنى واحد قالا حدثنا عبد الرزاق، عن معمر، عن ثابت البناني، عن عبد الرحمن بن أبي ليلى، عن صهيب، قال كان رسول الله صلى الله عليه وسلم إذا صلى العصر همس - والهمس في قول بعضهم تحرك شفتيه كأنه يتكلم فقيل له إنك يا رسول الله إذا صليت العصر همست قال ‏.‏ ‏\"‏ إن نبيا من الأنبياء كان أعجب بأمته فقال من يقول لهؤلاء فأوحى الله إليه أن خيرهم بين أن أنتقم منهم وبين أن أسلط عليهم عدوهم فاختار النقمة فسلط عليهم الموت فمات منهم في يوم سبعون ألفا ‏\"‏ ‏.‏ قال وكان إذا حدث بهذا الحديث حدث بهذا الحديث الآخر ‏.‏ قال ‏\"‏ كان ملك من الملوك وكان لذلك الملك كاهن يكهن له فقال الكاهن انظروا لي غلاما فهما أو قال فطنا لقنا فأعلمه علمي هذا فإني أخاف أن أموت فينقطع منكم هذا العلم ولا يكون فيكم من يعلمه ‏.‏ قال فنظروا له على ما وصف فأمره أن يحضر ذلك الكاهن وأن يختلف إليه فجعل يختلف إليه وكان على طريق الغلام راهب في صومعة ‏\"‏ ‏.‏ قال معمر أحسب أن أصحاب الصوامع كانوا يومئذ مسلمين قال ‏\"‏ فجعل الغلام يسأل ذلك الراهب كلما مر به فلم يزل به حتى أخبره فقال إنما أعبد الله ‏\"‏ ‏.‏ قال ‏\"‏ فجعل الغلام يمكث عند الراهب ويبطئ على الكاهن فأرسل الكاهن إلى أهل الغلام إنه لا يكاد يحضرني فأخبر الغلام الراهب بذلك فقال له الراهب إذا قال لك الكاهن أين كنت فقل عند أهلي ‏.‏ وإذا قال لك أهلك أين كنت فأخبرهم أنك كنت عند الكاهن ‏\"‏ ‏.‏ قال ‏\"‏ فبينما الغلام على ذلك إذ مر بجماعة من الناس كثير قد حبستهم دابة ‏\"‏ ‏.‏ فقال بعضهم إن تلك الدابة كانت أسدا قال ‏\"‏ فأخذ الغلام حجرا قال اللهم إن كان ما يقول الراهب حقا فأسألك أن أقتلها ‏.‏ قال ثم رمى فقتل الدابة ‏.‏ فقال الناس من قتلها قالوا الغلام ففزع الناس وقالوا لقد علم هذا الغلام علما لم يعلمه أحد ‏.‏ قال فسمع به أعمى فقال له إن أنت رددت بصري فلك كذا وكذا ‏.‏ قال له لا أريد منك هذا ولكن أرأيت إن رجع إليك بصرك أتؤمن بالذي رده عليك قال نعم ‏.‏ قال فدعا الله فرد عليه بصره فآمن الأعمى فبلغ الملك أمرهم فبعث إليهم فأتي بهم فقال لأقتلن كل واحد منكم قتلة لا أقتل بها صاحبه فأمر بالراهب والرجل الذي كان أعمى فوضع المنشار على مفرق أحدهما فقتله وقتل الآخر بقتلة أخرى ‏.‏ ثم أمر بالغلام فقال انطلقوا به إلى جبل كذا وكذا فألقوه من رأسه فانطلقوا به إلى ذلك الجبل فلما انتهوا به إلى ذلك المكان الذي أرادوا أن يلقوه منه جعلوا يتهافتون من ذلك الجبل ويتردون حتى لم يبق منهم إلا الغلام ‏\"‏ ‏.‏ قال ‏\"‏ ثم رجع فأمر به الملك أن ينطلقوا به إلى البحر فيلقونه فيه فانطلق به إلى البحر فغرق الله الذين كانوا معه وأنجاه فقال الغلام للملك إنك لا تقتلني حتى تصلبني وترميني وتقول إذا رميتني بسم الله رب هذا الغلام ‏.‏ قال فأمر به فصلب ثم رماه فقال بسم الله رب هذا الغلام ‏.‏ قال فوضع الغلام يده على صدغه حين رمي ثم مات ‏.‏ فقال أناس لقد علم هذا الغلام علما ما علمه أحد فإنا نؤمن برب هذا الغلام ‏.‏ قال فقيل للملك أجزعت أن خالفك ثلاثة فهذا العالم كلهم قد خالفوك ‏.‏ قال فخد أخدودا ثم ألقى فيها الحطب والنار ثم جمع الناس فقال من رجع عن دينه تركناه ومن لم يرجع ألقيناه في هذه النار فجعل يلقيهم في تلك الأخدود ‏.‏ قال يقول الله تعالى ‏:‏ ‏(‏قتل أصحاب الأخدود * النار ذات الوقود ‏)‏ حتى بلغ ‏:‏ ‏(‏العزيز الحميد ‏)‏ ‏\"‏ ‏.‏ قال ‏\"‏ فأما الغلام فإنه دفن ‏\"‏ ‏.‏ قال فيذكر أنه أخرج في زمن عمر بن الخطاب وأصبعه على صدغه كما وضعها حين قتل ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 47,
				"hadith": 392
			}
		}
	]
}