{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3419,
			"arabicnumber": 3419,
			"text": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن عمران بن أبي ليلى، حدثني أبي، حدثني ابن أبي ليلى، عن داود بن علي، هو ابن عبد الله بن عباس عن أبيه، عن جده ابن عباس، قال سمعت نبي الله صلى الله عليه وسلم يقول ليلة حين فرغ من صلاته ‏ \"‏ اللهم إني أسألك رحمة من عندك تهدي بها قلبي وتجمع بها أمري وتلم بها شعثي وتصلح بها غائبي وترفع بها شاهدي وتزكي بها عملي وتلهمني بها رشدي وترد بها ألفتي وتعصمني بها من كل سوء اللهم أعطني إيمانا ويقينا ليس بعده كفر ورحمة أنال بها شرف كرامتك في الدنيا والآخرة اللهم إني أسألك الفوز في العطاء ويروى في القضاء ونزل الشهداء وعيش السعداء والنصر على الأعداء اللهم إني أنزل بك حاجتي وإن قصر رأيي وضعف عملي افتقرت إلى رحمتك فأسألك يا قاضي الأمور ويا شافي الصدور كما تجير بين البحور أن تجيرني من عذاب السعير ومن دعوة الثبور ومن فتنة القبور اللهم ما قصر عنه رأيي ولم تبلغه نيتي ولم تبلغه مسألتي من خير وعدته أحدا من خلقك أو خير أنت معطيه أحدا من عبادك فإني أرغب إليك فيه وأسألكه برحمتك رب العالمين اللهم ذا الحبل الشديد والأمر الرشيد أسألك الأمن يوم الوعيد والجنة يوم الخلود مع المقربين الشهود الركع السجود الموفين بالعهود إنك رحيم ودود وأنت تفعل ما تريد اللهم اجعلنا هادين مهتدين غير ضالين ولا مضلين سلما لأوليائك وعدوا لأعدائك نحب بحبك من أحبك ونعادي بعداوتك من خالفك اللهم هذا الدعاء وعليك الاستجابة وهذا الجهد وعليك التكلان اللهم اجعل لي نورا في قبري ونورا في قلبي ونورا من بين يدى ونورا من خلفي ونورا عن يميني ونورا عن شمالي ونورا من فوقي ونورا من تحتي ونورا في سمعي ونورا في بصري ونورا في شعري ونورا في بشري ونورا في لحمي ونورا في دمي ونورا في عظامي اللهم أعظم لي نورا وأعطني نورا واجعل لي نورا سبحان الذي تعطف العز وقال به سبحان الذي لبس المجد وتكرم به سبحان الذي لا ينبغي التسبيح إلا له سبحان ذي الفضل والنعم سبحان ذي المجد والكرم سبحان ذي الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث ابن أبي ليلى من هذا الوجه ‏.‏ وقد روى شعبة وسفيان الثوري عن سلمة بن كهيل عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم بعض هذا الحديث ولم يذكره بطوله ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 50
			}
		}
	]
}