{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"48": "Chapters on Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3604,
			"arabicnumber": 3604,
			"text": "حدثنا أبو كريب، حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ استعيذوا بالله من عذاب جهنم استعيذوا بالله من عذاب القبر استعيذوا بالله من فتنة المسيح الدجال واستعيذوا بالله من فتنة المحيا والممات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 48,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 3604.1,
			"arabicnumber": 3604.1,
			"text": "حدثنا صالح بن عبد الله، أخبرنا جعفر بن سليمان، عن ثابت البناني، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليسأل أحدكم ربه حاجته حتى يسأله الملح وحتى يسأله شسع نعله إذا انقطع ‏\"‏ ‏.‏ وهذا أصح من حديث قطن عن جعفر بن سليمان ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.2,
			"arabicnumber": 3604.2,
			"text": "حدثنا يحيى بن موسى، أخبرنا يزيد بن هارون، أخبرنا هشام بن حسان، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏ \"‏ من قال حين يمسي ثلاث مرات أعوذ بكلمات الله التامات من شر ما خلق لم يضره حمة تلك الليلة ‏\"‏ ‏.‏ قال سهيل فكان أهلنا تعلموها فكانوا يقولونها كل ليلة فلدغت جارية منهم فلم تجد لها وجعا ‏.‏ هذا حديث حسن ‏.‏ وروى مالك بن أنس هذا الحديث عن سهيل بن أبي صالح عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم وروى عبيد الله بن عمر وغير واحد هذا الحديث عن سهيل ولم يذكروا فيه عن أبي هريرة ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.3,
			"arabicnumber": 3604.3,
			"text": "حدثنا يحيى بن موسى، أخبرنا وكيع، أخبرنا أبو فضالة الفرج بن فضالة، عن أبي سعيد المقبري، أن أبا هريرة، قال دعاء حفظته من رسول الله صلى الله عليه وسلم لا أدعه ‏ \"‏ اللهم اجعلني أعظم شكرك وأكثر ذكرك وأتبع نصيحتك وأحفظ وصيتك ‏\"‏ ‏.‏ هذا حديث غريب ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.4,
			"arabicnumber": 3604.4,
			"text": "حدثنا يحيى بن موسى، أخبرنا أبو معاوية، أخبرنا الليث، وهو ابن أبي سليم عن زياد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل يدعو الله بدعاء إلا استجيب له فإما أن يعجل له في الدنيا وإما أن يدخر له في الآخرة وإما أن يكفر عنه من ذنوبه بقدر ما دعا ما لم يدع بإثم أو قطيعة رحم أو يستعجل ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف يستعجل قال ‏\"‏ يقول دعوت ربي فما استجاب لي ‏\"‏ ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.5,
			"arabicnumber": 3604.5,
			"text": "حدثنا يحيى، أخبرنا يعلى بن عبيد، قال أخبرنا يحيى بن عبيد الله، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يرفع يديه حتى يبدو إبطه يسأل الله مسألة إلا آتاها إياه ما لم يعجل ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف عجلته قال ‏\"‏ يقول قد سألت وسألت ولم أعط شيئا ‏\"‏ ‏.‏ وروى هذا الحديث الزهري عن أبي عبيد مولى ابن أزهر عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ يستجاب لأحدكم ما لم يعجل يقول دعوت فلم يستجب لي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.6,
			"arabicnumber": 3604.6,
			"text": "حدثنا يحيى بن موسى، أخبرنا أبو داود، أخبرنا صدقة بن موسى، أخبرنا محمد بن واسع، عن سمير بن نهار العبدي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن حسن الظن بالله من حسن عبادة الله ‏\"‏ ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.7,
			"arabicnumber": 3604.7,
			"text": "حدثنا يحيى بن موسى، أخبرنا عمرو بن عون، أخبرنا أبو عوانة، عن عمر بن أبي سلمة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ لينظرن أحدكم ما الذي يتمنى فإنه لا يدري ما يكتب له من أمنيته ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.8,
			"arabicnumber": 3604.8,
			"text": "حدثنا يحيى بن موسى، أخبرنا جابر بن نوح، قال أخبرنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يدعو فيقول ‏ \"‏ اللهم متعني بسمعي وبصري واجعلهما الوارث مني وانصرني على من يظلمني وخذ منه بثأري ‏\"‏ ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		},
		{
			"hadithnumber": 3604.9,
			"arabicnumber": 3604.9,
			"text": "حدثنا أبو داود، سليمان بن الأشعث السجزي حدثنا قطن البصري، أخبرنا جعفر بن سليمان، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ليسأل أحدكم ربه حاجته كلها حتى يسأل شسع نعله إذا انقطع ‏\"‏ ‏.‏ هذا حديث غريب ‏.‏ وروى غير واحد هذا الحديث عن جعفر بن سليمان عن ثابت البناني عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكروا فيه عن أنس ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}