{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"7": "The Book on Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"text": "حدثنا محمد بن إسماعيل، حدثنا علي بن عبد الحميد الكوفي، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال كنا نتمنى أن يأتي، الأعرابي العاقل فيسأل النبي صلى الله عليه وسلم ونحن عنده فبينا نحن على ذلك إذ أتاه أعرابي فجثا بين يدى النبي صلى الله عليه وسلم فقال يا محمد إن رسولك أتانا فزعم لنا أنك تزعم أن الله أرسلك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي رفع السماء وبسط الأرض ونصب الجبال آلله أرسلك فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا خمس صلوات في اليوم والليلة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا صوم شهر في السنة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا في أموالنا الزكاة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا الحج إلى البيت من استطاع إليه سبيلا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ فقال والذي بعثك بالحق لا أدع منهن شيئا ولا أجاوزهن ‏.‏ ثم وثب فقال النبي صلى الله عليه وسلم ‏\"‏ إن صدق الأعرابي دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي من غير هذا الوجه عن أنس عن النبي صلى الله عليه وسلم ‏.‏ سمعت محمد بن إسماعيل يقول قال بعض أهل العلم فقه هذا الحديث أن القراءة على العالم والعرض عليه جائز مثل السماع ‏.‏ واحتج بأن الأعرابي عرض على النبي صلى الله عليه وسلم فأقر به النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 3
			}
		}
	]
}