{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 724,
			"arabicnumber": 724,
			"text": "حدثنا نصر بن علي الجهضمي، وأبو عمار والمعنى واحد واللفظ لفظ أبي عمار قالا أخبرنا سفيان بن عيينة، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال أتاه رجل فقال يا رسول الله هلكت ‏.‏ قال ‏\"‏ وما أهلكك ‏\"‏ ‏.‏ قال وقعت على امرأتي في رمضان ‏.‏ قال ‏\"‏ هل تستطيع أن تعتق رقبة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فهل تستطيع أن تصوم شهرين متتابعين ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فهل تستطيع أن تطعم ستين مسكينا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فجلس فأتي النبي صلى الله عليه وسلم بعرق فيه تمر - والعرق المكتل الضخم قال ‏\"‏ تصدق به ‏\"‏ ‏.‏ فقال ما بين لابتيها أحد أفقر منا ‏.‏ قال فضحك النبي صلى الله عليه وسلم حتى بدت أنيابه ‏.‏ قال ‏\"‏ فخذه فأطعمه أهلك ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وعائشة وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أهل العلم في من أفطر في رمضان متعمدا من جماع وأما من أفطر متعمدا من أكل أو شرب فإن أهل العلم قد اختلفوا في ذلك فقال بعضهم عليه القضاء والكفارة ‏.‏ وشبهوا الأكل والشرب بالجماع ‏.‏ وهو قول سفيان الثوري وابن المبارك وإسحاق ‏.‏ وقال بعضهم عليه القضاء ولا كفارة عليه لأنه إنما ذكر عن النبي صلى الله عليه وسلم الكفارة في الجماع ولم تذكر عنه في الأكل والشرب ‏.‏ وقالوا لا يشبه الأكل والشرب الجماع ‏.‏ وهو قول الشافعي وأحمد ‏.‏ وقال الشافعي وقول النبي صلى الله عليه وسلم للرجل الذي أفطر فتصدق عليه ‏\"‏ خذه فأطعمه أهلك ‏\"‏ ‏.‏ يحتمل هذا معاني يحتمل أن تكون الكفارة على من قدر عليها وهذا رجل لم يقدر على الكفارة فلما أعطاه النبي صلى الله عليه وسلم شيئا وملكه فقال الرجل ما أحد أفقر إليه منا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ خذه فأطعمه أهلك ‏\"‏ ‏.‏ لأن الكفارة إنما تكون بعد الفضل عن قوته ‏.‏ واختار الشافعي لمن كان على مثل هذا الحال أن يأكله وتكون الكفارة عليه دينا فمتى ما ملك يوما ما كفر ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 43
			}
		}
	]
}