{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"8": "The Book on Fasting"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 774,
			"arabicnumber": 774,
			"text": "حدثنا محمد بن يحيى، ومحمد بن رافع النيسابوري، ومحمود بن غيلان، ويحيى بن موسى، قالوا حدثنا عبد الرزاق، عن معمر، عن يحيى بن أبي كثير، عن إبراهيم بن عبد الله بن قارظ، عن السائب بن يزيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وسعد وشداد بن أوس وثوبان وأسامة بن زيد وعائشة ومعقل بن سنان ويقال ابن يسار وأبي هريرة وابن عباس وأبي موسى وبلال ‏.‏ قال أبو عيسى وحديث رافع بن خديج حديث حسن ‏.‏ وذكر عن أحمد بن حنبل أنه قال أصح شيء في هذا الباب حديث رافع بن خديج ‏.‏ وذكر عن علي بن عبد الله أنه قال أصح شيء في هذا الباب حديث ثوبان وشداد بن أوس لأن يحيى بن أبي كثير روى عن أبي قلابة الحديثين جميعا حديث ثوبان وحديث شداد بن أوس ‏.‏ وقد كره قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم الحجامة للصائم حتى أن بعض أصحاب النبي صلى الله عليه وسلم احتجم بالليل منهم أبو موسى الأشعري وابن عمر وبهذا يقول ابن المبارك ‏.‏ قال أبو عيسى سمعت إسحاق بن منصور يقول قال عبد الرحمن بن مهدي من احتجم وهو صائم فعليه القضاء ‏.‏ قال إسحاق بن منصور وهكذا قال أحمد بن حنبل وإسحاق بن إبراهيم ‏.‏ وقال أبو عيسى وأخبرني الحسن بن محمد الزعفراني قال قال الشافعي قد روي عن النبي صلى الله عليه وسلم أنه احتجم وهو صائم وروي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ ولا أعلم واحدا من هذين الحديثين ثابتا ولو توقى رجل الحجامة وهو صائم كان أحب إلى ولو احتجم صائم لم أر ذلك أن يفطره ‏.‏ قال أبو عيسى هكذا كان قول الشافعي ببغداد وأما بمصر فمال إلى الرخصة ولم ير بالحجامة للصائم بأسا واحتج بأن النبي صلى الله عليه وسلم احتجم في حجة الوداع وهو محرم صائم ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 93
			}
		}
	]
}