{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"9": "The Book on Hajj"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 885,
			"arabicnumber": 885,
			"text": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عبد الرحمن بن الحارث بن عياش بن أبي ربيعة، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، رضى الله عنه قال وقف رسول الله صلى الله عليه وسلم بعرفة فقال ‏\"‏ هذه عرفة وهذا هو الموقف وعرفة كلها موقف ‏\"‏ ‏.‏ ثم أفاض حين غربت الشمس وأردف أسامة بن زيد وجعل يشير بيده على هيئته والناس يضربون يمينا وشمالا يلتفت إليهم ويقول ‏\"‏ يا أيها الناس عليكم السكينة ‏\"‏ ‏.‏ ثم أتى جمعا فصلى بهم الصلاتين جميعا فلما أصبح أتى قزح فوقف عليه وقال ‏\"‏ هذا قزح وهو الموقف وجمع كلها موقف ‏\"‏ ‏.‏ ثم أفاض حتى انتهى إلى وادي محسر فقرع ناقته فخبت حتى جاوز الوادي فوقف وأردف الفضل ثم أتى الجمرة فرماها ثم أتى المنحر فقال ‏\"‏ هذا المنحر ومنى كلها منحر ‏\"‏ ‏.‏ واستفتته جارية شابة من خثعم فقالت إن أبي شيخ كبير قد أدركته فريضة الله في الحج أفيجزئ أن أحج عنه قال ‏\"‏ حجي عن أبيك ‏\"‏ ‏.‏ قال ولوى عنق الفضل فقال العباس يا رسول الله لم لويت عنق ابن عمك قال ‏\"‏ رأيت شابا وشابة فلم آمن الشيطان عليهما ‏\"‏ ‏.‏ ثم أتاه رجل فقال يا رسول الله إني أفضت قبل أن أحلق ‏.‏ قال ‏\"‏ احلق أو قصر ولا حرج ‏\"‏ ‏.‏ قال وجاء آخر فقال يا رسول الله إني ذبحت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال ثم أتى البيت فطاف به ثم أتى زمزم فقال ‏\"‏ يا بني عبد المطلب لولا أن يغلبكم الناس عنه لنزعت ‏\"‏ ‏.‏ قال وفي الباب عن جابر ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح لا نعرفه من حديث علي إلا من هذا الوجه من حديث عبد الرحمن بن الحارث بن عياش ‏.‏ وقد رواه غير واحد عن الثوري مثل هذا ‏.‏ والعمل على هذا عند أهل العلم رأوا أن يجمع بين الظهر والعصر بعرفة في وقت الظهر ‏.‏ وقال بعض أهل العلم إذا صلى الرجل في رحله ولم يشهد الصلاة مع الإمام إن شاء جمع هو بين الصلاتين مثل ما صنع الإمام ‏.‏ قال وزيد بن علي هو ابن حسين بن علي بن أبي طالب عليه السلام ‏.‏",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 78
			}
		}
	]
}