{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3962,
			"arabicnumber": "1551.01",
			"text": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) contracted with the people of Khaibar the (trees) on the condition that he would have half the produce in fruits and harvest",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": "1551.02",
			"text": "Ibn Umar (Allah be pleased with them) reported:Allah's Messenger (ﷺ) handed over the land of Khaibar (on the condition) of the share of produce of fruits and harvest, and he also gave to his wives every year one hundred wasqs: eighty wasqs of dates and twenty wasqs of barley. When 'Umar became the caliph he distributed the (lands and trees) of Khaibar, and gave option to the wives of Allah's Apostle (ﷺ) to earmark for themselves the land and water or stick to the wasqs (that they got) every year. They differed in this matter. Some of them opted for land and water, and some of them opted for wasqs every year. 'A'isha and Hafsa were among those who opted for land and water",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": "1551.03",
			"text": "Abdullah b. Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) contracted with the people of Khaibar (land and trees on the condition that they should give) half of the yield from land and trees. The rest of the hadith is the same. In the hadith transmitted on the authority of AIi b. Mushir there is no mention of it, but that A'isha and Hafsa were those who opted for land and water, but he (the narrator) said:He (Hadrat 'Umar, gave option to the wives of Allah's Apostle (ﷺ) that land would be earmarked for them, but he made no mention of water",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": "1551.04",
			"text": "Abdullah b. Umar (Allah be pleased with them) reported that when Khaibar had been conquered, the Jews asked Allah's Messenger (ﷺ) to let them continue (cultivation in those lands) on half of the share of yield in fruits and crop, whereupon Allah's Messenger (ﷺ) said:I will allow you to continue here, so long as we would desire. The rest of the hadith is the same, but with this addition:\" The fruit would be distributed equal to the half of Khaibar. And out of hall of the produce of the land, Allah's Apostle (may peace be be upon him) got the fifth part",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3966,
			"arabicnumber": "1551.05",
			"text": "Abdullah b. Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) returned to the Jews of Khaibar the date-palms of Khaibar and its land on the condition that they should work upon them with their own wealth (seeds, implements), and give half of the yield to Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3967,
			"arabicnumber": "1551.06",
			"text": "Ibn Umar reported that 'Umar b. al-Khattab (Allah be pleased with him) expelled the Jews and Christians from the land of Hijaz, and that when Allah's Messenger (ﷺ) conquered Khaibar he made up his mind to expel the Jews from it (the territory of Khaibar) because, when that land was conquered, it came under the sway of Allah, that of His Messenger (ﷺ) and that of the Muslims. The jews asked Allah's Messenger (ﷺ) to let them continue there on the condition that they would work on it, and would get in turn half of the fruit (of the trees), whereupon Allah's Messenger (ﷺ) said:We would let you continue there so long as we will desire. So they continued (to cultivate the lands) till 'Umar externed them to Taima' ang Ariha (two villages in Arabia, but out of Hijaz)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3968,
			"arabicnumber": "1552.01",
			"text": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Never does a Muslim plants a tree except that he has the reward of charity for him, for what is eaten out of that is charity; what is stolen out of that, what the beasts eat out of that, what the birds eat out of that is charity for him. (In short) none incurs a loss to him but it becomes a charity on his part",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3969,
			"arabicnumber": "1552.02",
			"text": "Jabir (Allah be pleased with him) reported that Allah's Apostle (ﷺ) visited Umm Mubashshir al-Ansariya at her orchard of date-palms and said to her:Who has planted these trees of dates-a Muslim or a non-Musim? She said: A Muslim, of course, whereupon he said: Never a Muslim plants, or cultivates a land, and it out of that men eat, or the animals eat, or anything else eats, but that becomes charity on his (planter's) behalf",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3970,
			"arabicnumber": "1552.03",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported:I heard Allah's Messenger (ﷺ) saying: Never does a Muslim plant, or cultivate, but has reward for him for what the beasts eat, or the birds eat or anything else eats out of that",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3971,
			"arabicnumber": "1552.04",
			"text": "Jabir b. Abdullah (Allah be pleased with them) reported:Allah's Apostle (ﷺ) visited the orchard of Umm Ma'sud and said: Umm Ma'bad. he who has planted this tree, is he a Muslim or a non-Muslim? She said: Of course, he is a Muslim, whereupon he (the Holy Prophet) said: No Muslim who plants (trees) and from their fruits the human beings or the beasts or birds eat, but that would be taken as an act of charity on the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3972,
			"arabicnumber": "1552.05",
			"text": "This hadith is transmitted on the authority of Abu Muawiya (but With a slight change of words)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3973,
			"arabicnumber": "1553.01",
			"text": "Anas reported Allah's Messenger (ﷺ) as saying Never does a Muslim plant trees or cultivate land and birds or a man or a beast eat out of them but that is a charity on his behalf",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3974,
			"arabicnumber": "1553.02",
			"text": "Anas b. Malik (Allah be pleased with him) reported that Allah's Apostle (ﷺ) visited the date-palms of Umm Mubashshir (Allah be pleased with her), a lady from the Ansar, and said:Who planted this palm-a Muslim or an unbelievers The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3975,
			"arabicnumber": "1554.01",
			"text": "Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) saying:If You sell fruits to your brother (and Jabir b. Ahduthh reported through another chain of narrators: If you were to sell fruits to your brother) and these is a stricken with Calamity, it is not permissible for you to get anything from him. Why do you get the wealth of your brother, without jutification?",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3976,
			"arabicnumber": "1554.02",
			"text": "A hadith like this has been narrated on the authority of Juraij with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3977,
			"arabicnumber": "1555.01",
			"text": "Anas (Allah be pleased with him) reported that Allah's Apostle (ﷺ) forbade the sale of the fruit of date-palms until it becomes mellow. We (some of the other narrators in the chain of transmitters) said:What does the word\" mellow\" mean? He said: (There the fruit) turns red or yellow. Don't you see if Allah had checked (the growth of) fruits; then what for the wealth of your brother would be permissible for you?",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3978,
			"arabicnumber": "1555.02",
			"text": "Anas b. Malik (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the sale of fruits until these are mellow. They (the companions of Anas) said:What is meant by\" mellow\"? He said: It implies that these became red. He said: When Allah hinders the growth of fruits, (then) what for the wealth of your brother would become permissible for you?",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3979,
			"arabicnumber": "1555.03",
			"text": "Anas (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:If Allah does not fructify them, then what is permissible for one of you to take the wealth of his brother?",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3980,
			"arabicnumber": "1554.03",
			"text": "Jabir (Allah be pleased with him) reported that Allah's Apostle (ﷺ) commanded to make deductions in the payment of that stricken with a Calamity",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3981,
			"arabicnumber": "1556.01",
			"text": "Abu Sa'id al-Khudri (Allah be pleeased with him) reported that in the time of Allah's Messenger (ﷺ) a man suffered loss in fruits he had bought and his debt increased; so Allah's Messenger (ﷺ) told (the people) to give him charity and they gave him charity, but that was not enough to pay the debt in full, whereupon Allah's Messenger (ﷺ) said to his creditors:\" Take what you find, you will have nothing but alms",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3982,
			"arabicnumber": "1556.02",
			"text": "This hadith has been narrated on the authority of Bukair b. al-Ashajj with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3983,
			"arabicnumber": "1557",
			"text": "A'isha (Allah be pleased with her) reported:Allah's Messenger (ﷺ) heard the voices of altercation of two disputants at the door; both the voices were quite loud. The one demanded some remission and desired that the other one should show leniency to him, whereupon the (other one) was saying: By Allah will not do that. Then there came Allah's Messenger (ﷺ) to them and said: Where is he who swears by Allah that he would not do good? He said: Massenger of Allah, it is I. He may do as he desires",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3984,
			"arabicnumber": "1558.01",
			"text": "Abdullah b. Ka'ab b. Malik reported from his father that he pressed in the mosque Ibn Abu Hadrad for the payment of the debt that he owed to him during the lifetime of Allah's Messenger (ﷺ). (In this altercation) their voices became loud, until Allah's Messenger (ﷺ) heard them, while he was in the house, so Allah's Messenger (ﷺ) came out towards them, and he lifted the curtain of his apartment and he called upon Ka'b b. Malik and said:O Ka'b. He said: At thy beck and call, Allah's Messenger. He pointed out with the help of his hand to remit half of the loan due to him. Ka'b said: Allah's Messenger, I am ready to do that, whereupon Allah's Messenger (ﷺ) said (to Ibn Abu Hadrad): Stand up and make him the payment (of the rest)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3985,
			"arabicnumber": "1558.02",
			"text": "The above hadith is narrated through another chain with a slight variation of words at the begining and the rest is of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3986,
			"arabicnumber": "1558.03",
			"text": "Ka'b b. Malik reported that he made a demand for the payment of the debt that Ibn Abu Hadrad owed to him. This hadith is narrated through another chain of transmitters and (the words are):\" He had to get the loan from Abdullah b. Hadrad al-Aslami. He met him and pressed him for payment. There was an altercation between them, until their voices became loud. There happened to pass by them Allah's Messenger (ﷺ) and he said: O Ka'b, and pointed out with his hand in such a way as he meant half. So he got half of what he (Ibn Abu Hadrad) owed to him and remitted the half",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3987,
			"arabicnumber": "1559.01",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who found his property intact with a person (who bought it but who later on) became insolvent (or a person who became insolvent), he (the seller) is entitled to get it more than anyone else",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3988,
			"arabicnumber": "1559.02",
			"text": "This hadith has been narrated on the authority of Yahya b. Sa'id with the same chain of transmitters (but with a slight variation of words and these are)\" Whenever a man becomes poor",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3989,
			"arabicnumber": "1559.03",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) saying about a person who becomes insolvent and (the thing bought by him) is found intact with him, that belongs to one who sold it",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3990,
			"arabicnumber": "1559.04",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:When a man becomes insolvent (and the other) man (the seller) finds his commodity intact with him, he is more entitled to get it (than anyone else)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3991,
			"arabicnumber": "1559.05",
			"text": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters (but with a change of these words):\" He is more entitled to get it than any other creditor",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3992,
			"arabicnumber": "1559.06",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:When a inan becomes insolvent, and the other person (seller) finds his goods intact with him, he is more entitled to get them than anyone else",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3993,
			"arabicnumber": "1560.01",
			"text": "Hudhaifa reported Allah's Messenger (ﷺ) as saying The angels took away the soul of a person who had lived among people who were before you. They (the angels) said:Did you do anything good? He said: No. they said: Try to recall. He said: I used to lend to people and order my servants to give respite to one in straitened circumstances and give allowance to the solvent, for Allah, the Exalted and Majestic, said (to the angels): You should ignore (his failing)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3994,
			"arabicnumber": "1560.02",
			"text": "Hudhaifa reported:A person met his Lord (after death) and He said: What (good) did you do? He said: I did no good except this that I was a rich man, and I demanded from the people (the repayment of debt that I advanced to them). I, however, accepted that which the solvent gave and remitted (the debt) of the insolvent, whereupon He (the Lord) said: You should ignore (the faults) of My servant. Abu Mas'ud (Allah be pleased with him) said: This is what I heard Allah's Messenger (ﷺ) as saying",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3995,
			"arabicnumber": "1560.03",
			"text": "Hudhaifa (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:A person died and he entered Paradise. It was said to him What (act) did you do? (Either he recalled it himself or he was made to recall), he said I used to enter into transactions with people and I gave respite to the insolvent and did not show any strictness in case of accepting a coin or demanding cash payment. (For these acts of his) he was granted pardon. Abu Mas'ud said: I heard this from Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3996,
			"arabicnumber": "1560.04",
			"text": "Hudhaifa (Allah be pleased with him) reported:A servant from amongst the servants of Allah was brought to Him whom Allah had endowed with riches. He (Allah) said to him: What (did you do) in the world? (They cannot conceal anything from Allah) He (the person) said: O my Lord, You endowed me with Your riches. I used to enter into transactions with people. It was my nature to be lenient to (my debtors). I showed leniency to the solvent and gave respite to the insolvent, whereupon Allah said: I have more right than you to do this to connive at My servant. 'Uqba b. 'Amir al-Juhani and Abu Mas'ud said: This is what we heard from Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3997,
			"arabicnumber": "1561",
			"text": "Abu Mas'ud (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:A person from people who lived before you was called to account (by Allah at the Day of Judgment) and no good was found in his account except this that lie being a rich man had (financial) dealings with people and had commanded his servants to show leniency to the straitened ones. Upon this Allah, the Exalted and Majestic, said: We have more right to this, so overlook (his faults)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3998,
			"arabicnumber": "1562.01",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:There was a person who gave loans to the people and said to his men: When an insolvent comes to you show him leniency that Allah may overlook our (faults). So when he met Allah, He overlooked his faults (forgave him)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3999,
			"arabicnumber": "1562.02",
			"text": "A hadith like this is narrated on the authority of Abu Huraira (Allah be pleased with him)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4000,
			"arabicnumber": "1563.01",
			"text": "Abdullah b. Abu Qatada reported that Abu Qatada (Allah be pleased with him) demanded (the payment of his debt) from his debtor but he disappeared; later on he found him and he said:I am hard up financially, whereupon he said: (Do you state it) by God? He said: By God. Upon this he (Qatada) said: I heard Allah's Messenger (ﷺ) as saying: He who loves that Allah saves him from the torments of the Day of Resurrection should give respite to the insolvent or remit (his debt)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4001,
			"arabicnumber": "1563.02",
			"text": "This hadith has been narrated on the authority of Ayyob with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4002,
			"arabicnumber": "1564.01",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Delay (in the payment of debt) on the part of a rich man is injustice, and when one of you is retired to a rich man, he should follow him",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4003,
			"arabicnumber": "1564.02",
			"text": "A hadith like this has been transmitted on the authority of Abu Huraira (Allah be pleased with him)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4004,
			"arabicnumber": "1565.01",
			"text": "Jabir b. 'Abdullah (, Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the sale of excess water",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4005,
			"arabicnumber": "1565.02",
			"text": "Jabir b. 'Abdullah (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the hiring of a Camel to cover a she-Camel and from selling water and land to be tilled. So from all this the Messenger of Allah (ﷺ) forbade",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4006,
			"arabicnumber": "1566.01",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Excess water must not be withheld so that the growth of herbage may be hindered",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4007,
			"arabicnumber": "1566.02",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Do not withhold excess of water, so that you may prevent the growth of herbage",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4008,
			"arabicnumber": "1566.03",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:The excess of water should not be sold in order to enable the sate of herbage",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4009,
			"arabicnumber": "1567.01",
			"text": "Aba Mas'ud al-Ansari (Allah be pleased with him) reported that Allah's Messenger (ﷺ) forbade the charging of price of the dog, and earnings of a prostitute and sweets offered to a kahin",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4010,
			"arabicnumber": "1567.02",
			"text": "A hadith like this is reported on the authority of Abu Mas'ud through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4011,
			"arabicnumber": "1568.01",
			"text": "Rafi b. Khadij (Allah be pleased with him) reported:I heard Allah's Apostle (ﷺ) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4012,
			"arabicnumber": "1568.02",
			"text": "Rafi b. Khadij reported Allah'& Messenger (ﷺ) as saying:The price of a dog is evil, the earning of a prostitute is evil and the earning of a cupper is evil",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4013,
			"arabicnumber": "1568.03",
			"text": "A hadith like this has been narrated on the authority of Rafi' b. Khadij through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4014,
			"arabicnumber": "1568.04",
			"text": "A hadith like this has been narrated on the authority of Rafi' b. Khadij through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4015,
			"arabicnumber": "1569",
			"text": "Abu Zubair said:I asked Jabir about the price of a dog and a cat; he said: Allah's Messenger (ﷺ) disapproved of that",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4016,
			"arabicnumber": "1570.01",
			"text": "Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (ﷺ) giving command for killing dogs",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4017,
			"arabicnumber": "1570.02",
			"text": "Ibn 'Umar (Allah be pleased with them) reported:Allah's Messenger (ﷺ) ordered to kill dogs, and he sent (men) to the corners of Medina that they should be killed",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4018,
			"arabicnumber": "1570.03",
			"text": "Abdullah (b. Umar) (Allah be pleased with them) reported:Allah's Messenger (ﷺ) ordered the killing of dogs and we would send (men) in Medina and its corners and we did not spare any dog that we did not kill, so much so that we killed the dog that accompanied the wet she-camel belonging to the people of the desert",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4019,
			"arabicnumber": "1571",
			"text": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (may peace be, upon him) ordered the killing of dogs except the dog tamed for hunting, or watching of the herd of sheep or other domestic animals. It was said to Ibn Umar (Allah be pleased with them) that Abu Huraira (Allah be pleased with him) talks of (exception) about the dog for watching the field, whereupon he said:Since Abu Huraira (Allah be pleased with him) possessed land",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4020,
			"arabicnumber": "1572",
			"text": "Abu Zubair heard Jabir b. 'Abdullah (Allah be pleased with him) saying:Allah's Messenger (ﷺ) ordered us to kill dogs, and we carried out this order so much so that we also kill the dog coming with a woman from the desert. Then Allah's Apostle (ﷺ) forbade their killing. He (the Prophet further) said: It is your duty the jet-black (dog) having two spots (on the eyes), for it is a devil",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4021,
			"arabicnumber": "1573.01",
			"text": "Ibn Mughaffal reported:Allah's Messenger (ﷺ) ordered the killing of dogs and then said: what is the trouble with them (the people of Medina)? How dogs are nuisance to them (the citizens of Medina)? He then permitted keehing of dogs for hunting and (the protection of) herds",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4022,
			"arabicnumber": "1573.02",
			"text": "In the hadith transmitted on the authority of Yahya, he (the Holy Prophet) permitted the keeping of dogs for (the protection of) herds, for hunting and (the protection of) cultivated land",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4023,
			"arabicnumber": "1574.01",
			"text": "Ibn Umar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who keeps a dog other than that meant for watching the herd or for hunting loses every day out of his deeds equal to two qirat",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4024,
			"arabicnumber": "1574.02",
			"text": "Salim reported on the authority of his father that Allah's Apostle (ﷺ) said:He who kept a dog other than one meant for hunting or for watching the herd, lost two qirat of his reward every day",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4025,
			"arabicnumber": "1574.03",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying He who kept a dog other than one meant for hunting or for watching the herd lost out of his deeds (equal to) two qirat every day",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4026,
			"arabicnumber": "1574.04",
			"text": "Salim b. 'Abdullah reported on the authority of his father that Allah's Messenger (ﷺ) said:He who kept a dog other than one meant for watching the herd or for hunting would lose every day two qirat of his good deeds. 'Abdullah and Abu Huraira also said: Or dog meant for watching the field",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4027,
			"arabicnumber": "1574.05",
			"text": "Salim reported on the authority of his father (Allah be pleased with him) that Allah's Messenger (ﷺ) said:He who kept a dog other than one meant for hunting or for the protection of the herd would lose two qirat of his deeds every day. Salim said: Abu Huraira (Allah be pleased with him) used to say: Or the dog meant for watching the field, and he was the owner of the land",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4028,
			"arabicnumber": "1574.06",
			"text": "Salim b. Abdullah reported on the authority of his father that Allah's Messenger (ﷺ) said:Whosover amongst the owners of the house keeps a dog other than one meant for watching the herd or for hunting loses two qirat of his deeds every day",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4029,
			"arabicnumber": "1574.07",
			"text": "Ibn Umar (Allah be pleased with them) narrated Allah's Messenger (ﷺ) as saying:He who kept a dog ther than one meant for watching the fields or herds or hunting would lose one qirat every day out of his reward (with God)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4030,
			"arabicnumber": "1575.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:He who kept a dog which is neither meant for hunting nor for watching the anitmals nor for watching the fields would lose two qirat every day out of his reward; and there is no mention of the fields in the hadith transmitted by Abu Tahir",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4031,
			"arabicnumber": "1575.02",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who kept a dog except one meant for watching the herd, or for hunting or for watching the fields. he lost two qirat of reward every day. Zuhri said: The words of Abu Huraira (Allah be pleased with him) were conveyed to Ibn Umar who said: May Allah have mercy upon Abu Huraira; he owned a field",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4032,
			"arabicnumber": "1575.03",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who kept a dog would lose out of his deeds equal to one qirat every day. except (one kept) for watching the field or herd",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4033,
			"arabicnumber": "1575.04",
			"text": "A hadith like this has been transmitted on the authority of Abu Huraira",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4034,
			"arabicnumber": "1575.05",
			"text": "This hadith has been reported on the authority of Yahya b. Abu Kathir with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4035,
			"arabicnumber": "1575.06",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who kept a dog, but not meant for hunting or watching the herd, would lose one qirat of reward every day",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4036,
			"arabicnumber": "1576.01",
			"text": "Sufyan b. Abu Zuhair (he was a person belonging to the tribe of Shanu'a and was amongst the Conpanions of Allah's Messenger [may peace be upon him ) said:I heard Messenger of Allah (ﷺ) as saying: He who kept a dog (other than that) which is indispensable for watching the field or the animals would lose one qirat out of his deeds every day. As-Sa'ib b Yazid (one of the narrators) said: Did you hear it from Allah's Messenger (ﷺ)? He said: Yes. by the Lord of this mosque",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4037,
			"arabicnumber": "1576.02",
			"text": "This hadith has been narrated on the authority of Sufyan b. Abu Zuhair al-Shana'i",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4038,
			"arabicnumber": "1577.01",
			"text": "It is narrated on the authority of Humaid that Anas b. Malik was asked about the earnings of the cupper. He said:Allah's Messenger (ﷺ) got himself cupped. His cupper was Abu Taiba and he (the Holy Prophet) commanded to give him two sa's of corn. He (the Holy Prophet) talked with the members of his family and they lightened the burden of Kharaj (tax) from him (i. e. they made remis- sion in the charges of their own accord). He (Allah's Apostle) said: The best (treat- ment) which you take is cupping, or it is the best of your treatments",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4039,
			"arabicnumber": "1577.02",
			"text": "Rumaid reported that Anas b. Malik (Allah be pleased with him) has asked about the earnings of a cupper. Then (the above-mentioned hadith was reported but with this addition) that he said:The best treatment which you get is cupping. or aloeswood and do not torture your children by pressing their uvula",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4040,
			"arabicnumber": "1577.03",
			"text": "Humaid reported Anas (Allah be pleased with him) having said this:Allah's Apostle (ﷺ) called for young cupper belonging to us. He capped him and he (the Holy Prophet) commanded that he should be paid one sa' or one mudd or two mudds (of wheat). It was said (that charges were high) and a reduction was made in the charges",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4041,
			"arabicnumber": "1202.02",
			"text": "Ibn Abbas (Allah be pleased with them) reported that Allah's Messenger (ﷺ) got himself cupped and he paid the clipper his charges and he put medicine in his nostrils",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4042,
			"arabicnumber": "1202.03",
			"text": "Ibn 'Abbas (Allah be pleased with them) reported:The slave of Banu Bayada cupped Allah's Apostle (ﷺ) and he gave him his wages, and talked to his master and he reduced the charges, and if this earning was unlawful Allah's Apostle (ﷺ) would not have given it",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4043,
			"arabicnumber": "1578",
			"text": "Abu Sa'id al-Khudri (Allah be pleased with him) reported:I heard Allah's Messenger (ﷺ) addressing in Medina. He said: O people, Allah is giving an indication (of the prohibition) of wine. and He is probably soon going to give an order about it. So he who has anything of it with him should sell that, and derive benefit out of it. He (the narrator) said: We waited for some time that Allah's Apostle (ﷺ) said: Verily Allah, the Exalted, has forbidden wine. So who hears this verse and he has anything of it with him, he should neither drink it nor sell it. He (the narrator) said: The people then brought whatever they had of it with them on the streets of Medina and spilt that",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4044,
			"arabicnumber": "1579.01",
			"text": "Abd al-Rahman b. Wa'ala as-Saba'i (who was an Egyptian) asked 'Abdullah b. Abbas; (Allah be pleased with them) about that which is extracted from the grapes, whereupon he said:A person presented to Allah's Messenger (ﷺ) a small water-skin of wine. Allah's Messenger (ﷺ) said to him: Do you know that Allah has forbidden it? He said: No. He then whispered to another man. Allah's Messenger (ﷺ) asked him what he had whispered. He said: I advised him to sell that, whereupon he (the Holy Prophet) said: Verily He Who has forbidden its drinking has forbidden its sale also. He (the narrator) said: He opened the waterskin until what was contained in it was spilt",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4045,
			"arabicnumber": "1579.02",
			"text": "Abd al-Rahman b. Wa'ala narrated this on the authority of 'Abdullah b. Abbas",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4046,
			"arabicnumber": "1580.01",
			"text": "A'isha (Allah be pleased with her) reported:When the concluding verses of Sura Baqara were revealed, Allah's Messenger (ﷺ) went out and read them out to the people and then forbade them to trade in wine",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4047,
			"arabicnumber": "1580.02",
			"text": "A'isha (Allah be pleased with her) reported:When the concluding verses of Sura Baqara pertaining to Riba were revealed, Allah's Messenger (ﷺ) went out to the mosque and he forbade the trade in wine",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4048,
			"arabicnumber": "1581.01",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying in the Year of Victory while he was in Mecca:Verily Allah and His Messenger have forbidden the sale of wine, carcass, swine and idols, It was said: Allah's Messenger, you see that the fat of the carcass is used for coating the boats and varnishing the hides and people use it for lighting purposes, whereupon he said: No, it is forbidden, Then Allah's Messenger (ﷺ) said: May Allah the Exalted and Majestic destroy the Jews; when Allah forbade the use of fat of the carcass for them, they melted it, and then sold it and made use of its price (received from it)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4049,
			"arabicnumber": "1581.02",
			"text": "Yazid b. Abu Habib reported:'Ata' reported to me that he heard Jabir (b. 'Abdullah) saying it that he had heard that from Allah's Messenger (ﷺ) in the Year of Victory",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4050,
			"arabicnumber": "1582.01",
			"text": "Ibn Abbas (Allah be pleased with him) reported:This news reached 'Umar that Samura had sold wine, whereupon he said: May Allah destroy Samura; does he not know that Allah's Messenger (ﷺ) said:\" Let there be the curse of Allah upon the Jews that fat was declared forbidden for them, but they melted it and then sold it\"?",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4051,
			"arabicnumber": "1582.02",
			"text": "This hadith has been narrated on the authority of 'Amr b. Dinar with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4052,
			"arabicnumber": "1583.01",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:May Allah destroy the Jews for Allah forbade the use of fats for them, but they sold them and made use of their price",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4053,
			"arabicnumber": "1583.02",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:May Allah destroy the Jews for Allah forbade the use of fat for them, but they sold it and made use of its price",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4054,
			"arabicnumber": "1584.01",
			"text": "Abu Salid al-Khudri reported Allah's Messenger (ﷺ) as saying:Do not sell gold for gold, except like for like, and don't increase something of it upon something; and don't sell silver unless like for like, and don't increase some thing of it upon something, and do not sell for ready money something to be given later",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4055,
			"arabicnumber": "1584.02",
			"text": "Nafi' reported that Ibn 'Umar told him that a person of the tribe of Laith said that Abu Sa'id al-Kludri narrated it (the above-mentioned hadith) from tile Messenger of Allah (ﷺ) in a narration of Qutaiba. So 'Abduliali and Nafi' went along with him, and in the hadith transmitted by Ibn Rumh (the words are) that Nafi' said:'Abdullah (b. 'Umar) went and I along with the person belonging to Banu Laith entered (the house) of Sa'id al-Khudri, and he ('Abdullah b. Umar) said: I have been informed that you say that Allah's Messenger (ﷺ) forbade the sale of silver with silver except in case of like for like, and sale of gold for gold except in case of like for like. Abu Sa'id pointed towards this eyes and his ears with his fingers and said: My eyes saw, and my ears listened to Allah's Messenger (ﷺ) saying: Do not sell gold for gold, and do not sell silver for silver except in case of like for like, and do not increase something of it upon something, and do not sell for ready money something, not present, but hand to hand",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4056,
			"arabicnumber": "1584.03",
			"text": "This hadith has been narrated on the authority of Abu Sa'id al-Khudri through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4057,
			"arabicnumber": "1584.04",
			"text": "Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Do not sell gold for gold and silver for silver weight for weight or of the same quality",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4058,
			"arabicnumber": "1585",
			"text": "Uthman b. 'Affan reported Allah's Messenger (ﷺ) as saying:Do not sell a dinar for two dinars and one dirham for two dirhams",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4059,
			"arabicnumber": "1586.01",
			"text": "Malik b. Aus b. al-Hadathan reported:I came saying who was prepared toexchange dirhams (for my gold), whereupon Talha b. Ubaidullah (Allah be pleased with him) (as he was sitting with 'Umar b. Khattib) said: Show us your gold and then come to us (at a later time). When our servant would come we would give you your silver (dirhams due to you). Thereupon 'Umar b. al-Khattib (Allah be pleased with him) said: Not at all. By Allah, either give him his silver (coins). or return his gold to him, for Allah's Messenger (ﷺ) said: Exchange of silver for gold (has an element of) interest in it. except when (it is exchanged) on the spot;and wheat for wheat is an interest unless both are handed over on the spot: barley for barley is interest unless both are handed over on the spot; dates for dates is interest unless both are handed over on the Spot",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4060,
			"arabicnumber": "1586.02",
			"text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4061,
			"arabicnumber": "1587.01",
			"text": "Abi Qilabah reported:I was in Syria (having) a circle (of friends). in which was Muslim b. Yasir. There came Abu'l-Ash'ath. He (the narrator) said that they (the friends) called him: Abu'l-Ash'ath, Abu'l-Ash'ath, and he sat down. I said to him: Narrate to our brother the hadith of Ubada b. Samit. He said: Yes. We went out on an expedition, Mu'awiya being the leader of the people, and we gained a lot of spoils of war. And there was one silver utensil in what we took as spoils. Mu'awiya ordered a person to sell it for payment to the people (soldiers). The people made haste in getting that. The news of (this state of affairs) reached 'Ubada b. Samit, and he stood up and said: I heard Allah's Messenger (ﷺ) forbidding the sale of gold by gold, and silver by silver, and wheat by wheat, and barley by barley, and dates by dates, and salt by salt, except like for like and equal for equal. So he who made an addition or who accepted an addition (committed the sin of taking) interest. So the people returned what they had got. This reached Mu'awiya. and he stood up to deliver an address. He said: What is the matter with people that they narrate from the Messenger (ﷺ) such tradition which we did not hear though we saw him (the Holy Prophet) and lived in his company? Thereupon, Ubida b. Samit stood up and repeated that narration, and then said: We will definitely narrate what we heard from Allah's Messenger (ﷺ) though it may be unpleasant to Mu'awiya (or he said: Even if it is against his will). I do not mind if I do not remain in his troop in the dark night. Hammad said this or something like this",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4062,
			"arabicnumber": "1587.02",
			"text": "The above hadith is likewise narrated through another chain of transmission on the authority of Abi Qilabah",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4063,
			"arabicnumber": "1587.03",
			"text": "Ubida b. al-Simit (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, and salt by salt, like for like and equal for equal, payment being made hand to hand. If these classes differ, then sell as you wish if payment is made hand to hand",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4064,
			"arabicnumber": "1584.05",
			"text": "Abu Sa'id al-Khudri (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, salt by salt, like by like, payment being made hand to hand. He who made an addition to it, or asked for an addition, in fact dealt in usury. The receiver and the giver are equally guilty",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4065,
			"arabicnumber": "1584.06",
			"text": "This hadith has been narrated on the authority of Abu Sa'id al-Khudri (Allah be pleased with him) through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4066,
			"arabicnumber": "1588.01",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Dates are to be paid for by dates, wheat by wheat, barley by barley, salt by salt, like for like, payment being made on the spot. He who made an addition or demanded an addition, in fact, dealt in usury except in case where their classes differ",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4067,
			"arabicnumber": "1588.02",
			"text": "This hadith has been narrated on the authority of Fudail b. Ghazwan with the same chain of transmitters, but he made no mention of (payment being) made on the spot",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4068,
			"arabicnumber": "1588.03",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Mess-., nger (ﷺ) as saying:Gold is to be paid for by gold with equal weight, like for like, and silver is to be paid for by silver with equal weight, like for like. He who made an addition to it or demanded an addition dealt in usury",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4069,
			"arabicnumber": "1588.04",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:Let dinar be exchanged for dinar, with no addition on either side and dirham be exchanged for dirham with no addition on either side",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4070,
			"arabicnumber": "1588.05",
			"text": "This hadith has been narrated on the authority of Musa b. Abu Tamim with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4071,
			"arabicnumber": "1589.01",
			"text": "Abu Minhal reported:My partner sold silver to be paid in the (Hajj) season or (in the days of) Hajj. He (my partner) came to me and informed me, and I said to him: Such transaction is not desirable. He said: I sold it in the market (on loan) but nobody objected to this. I went to al-Bara' b. 'Azib and asked him, and he said: Allah's Apostle (ﷺ) came to Medina and we made such transaction, whereupon he said: In case the payment is made on the spot, there is no harm in it, and in case (it is 'sold) on loan, it is usury. You better go to Zaid b. Arqam, for he is a greater trader than I; so I went to him and asked him, and he said like it",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4072,
			"arabicnumber": "1589.02",
			"text": "Habib reported that he heard Abu Minhal as saying:I asked al-Bara' b. Azib about the exchange of (gold for silver or vice versa), whereupon he said: you better ask Zaid b. Arqam for he knows more than I. So I asked Zaid but he said: You better ask al-Bara' for he knows more than I. Then both of them said: Allah's Messenger (ﷺ) forbade the sale of silver for gold when payment is to be made in future",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4073,
			"arabicnumber": "1590.01",
			"text": "Abd al-Rabman b. Abia Bakra reported on the authority of his father that Allah's Messenger (ﷺ) forbade the sale of gold for gold, and silver for silver except equal for equal, and commanded us to buy silver for gold as we desired and buy gold for silver as we desired. A person asked him (about the nature of payment), whereupon he said:It is to be made on the spot. This is what I heard (from Allah's Messenger (may peace be upon him)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4074,
			"arabicnumber": "1590.02",
			"text": "Abd al-Rabman b. Abu Bakra said:Allah's Messenger (ﷺ) prohibited us. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4075,
			"arabicnumber": "1591.01",
			"text": "Fadala b. Ubaid al-Ansari reported:A necklace having gold and gems in it was brought to Allah's Messenger (ﷺ) in Khaibar and it was one of the spoils of war and was put to sale. Allah's Messenger (ﷺ) said: The gold used in it should be separated, and then Allah's Messenger (ﷺ) further said: (Sell) gold for gold with equal weight",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4076,
			"arabicnumber": "1591.02",
			"text": "Fadila b. 'Ubaid (Allah be pleased with him) reported:I bought on the day (of the Victory of Khaibar) a necklace for twelve dinars (gold coins). It was made of gold studded with gems. I separated (gold from gems) in it, and found (gold) of more (worth) than twelve dinars. I made a mention of it to Allah's Apostle (ﷺ), whereupon he said: It should not be sold unless it is separated",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4077,
			"arabicnumber": "1591.03",
			"text": "A hadith like this is narrated on the authority of Sa'id b. Yazid with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4078,
			"arabicnumber": "1591.04",
			"text": "Fadala b. 'Ubaid reported:We were in the company of Allah's Messenger ( may peace be upon him) on the day (of the Victory of) Khaibar, and made transaction with the Jews for the 'uqiya of gold for the dinars or three (gold coins), whereupon Allah's Messenger (ﷺ) said: Do not sell gold for gold but for equal weight",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4079,
			"arabicnumber": "1591.05",
			"text": "Hanash reported:We were along with Fadala b. Ubaid (Allah be pleased with him) in an expedition. There fell to my and my friend's lot a necklace made of gold, silver and jewels. I decided to buy that. I asked Fadala b. 'Ubaid, whereupon he said: Separate its gold and place it in one pan (of the balance) and place your gold in the other pan, and do not receive but equal for equal, for I heard Allah's Messenger (ﷺ) as saying: He who believes in Allah and the Hereafter should not take but equal for equal",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4080,
			"arabicnumber": "1592",
			"text": "Ma'mar b. Abdullah reported that he sent his slave with a sa' of wheat and said to him:Sell it, and then buy with it barley. The slave went away and he got a sa' (of barley) and a part of sa' over and above that. When he came to Ma'mar he informed him about that, whereupon Ma'mar said to him: Why did you do that? Go back and return that, and do not accept but weight, for weight, for I used to hear from Allah's Apostle (ﷺ) as saying: Wheat for wheat and like for like. He (one of the narrators) said: Our food in those days consisted of barley. It was said to him (Ma'mar) that (wheat) is not like that (barley). He replied: I am afraid these may not be similar",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4081,
			"arabicnumber": "1593.01",
			"text": "Abu Huraira and Abu Sa'id al-Khudri (Allah be pleased with them) reported that Allah's Messenger (ﷺ) deputed a person from Banu 'Adi al-Ansari to collect revenue from Khaibar. He came with a fine quality of dates, whereupon Allah's Messenger (ﷺ) said to him:Are all the dates of Khaibar like this? He said: Allah's Messenger, it is not so. We buy one sa' of (fine quality of dates) for two sa's out of total output (including even the inferior quality of dates), whereupon Allah's Messenger (ﷺ) said: Don't do that, but like for like, or sell this (the inferior quality and receive the price) and then buy with the price of that, and that would make up the measure",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4082,
			"arabicnumber": "1593.02",
			"text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) deputed a person to collect revenue from Khaibar. He brought fine quality of dates, whereupon Allah's Messenger (ﷺ) said:Are all the dates of Khaibar like this)? He said: No. We got one sa' (of fine dates) for two sa's (of inferior dates), and (similarly) two sa's for three sa's. Thereupon Allah's Messenger (ﷺ) said: Don't do that rather sell the inferior quality of dates for dirhams (money), and then buy the superior quality with the help of dirhams",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4083,
			"arabicnumber": "1594.01",
			"text": "Abd Sa'id reported:Bilal (Allah be pleased with him) came with fine quality of dates. Allah's Messenger (ﷺ) said to him: From where (you have brought them)? Bilal said: We had inferior quality of dates and I exchanged two sa's (of inferior quality) with one sa (of fine quality) as food for Allah's Apostle (ﷺ), whereupon Allah's Messenger (ﷺ) said: Woe! it is in fact usury; therefore, don't do that. But when you intend to buy dates (of superior quality), sell (the inferior quality) in a separate bargain and then buy (the superior quality). And in the hadith transmitted by Ibn Sahl there is no mention of\" whereupon",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4084,
			"arabicnumber": "1594.02",
			"text": "Abu Sa'id (Allah be pleased with him) reported:Dates were brought to Allah's Messenger (ﷺ), and he said: These dates are not like our dates, whereupon a man said: We sold two sa's of our dates (in order to get) one sa', of these (fine dates), whereupon Allah's Messenger (ﷺ) said: That is interest; so return (these dates of fine quality), and get your (inferior dates) ; then sell our dates (for money) and buy for us (with the help of money) such (fine dates)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4085,
			"arabicnumber": "1595",
			"text": "Abu Sa'id (Allah be pleased with him) reported:We were given to eat, during the lifetime of Allah's Messenger (ﷺ), dates of different qualities mixed together, and we used to sell two sa's of these for one sa, (of fine quality of dates). This reached Allah's Messenger (ﷺ), whereupon he said: There should be no exchange of two sa's of (inferior) dates for one sa (of fine dates) and two sa's of (inferior) wheat for one sa' of (fine) wheat. and one dirham for two dirharms",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4086,
			"arabicnumber": "1594.03",
			"text": "Abu Nadra reported:I asked Ibn Abbas (Allah be pleased with them) about the conversion (of gold and silver for silver and gold). We said: Is it hand to hand exchange? I said: Yes. whereupon he said: There is no harm in it. I informed Abu Sa'id about it, telling him that I had asked Ibn 'Abbas about it and he said: Is it hand to hand exchange? I said: Yes, whereupon he said: There is no harm in it. He (the narrator) said, or he said like it: We will soon write to him, and he will not give you this fatwa (religious verdict). He said: By Allah, someone of the boy-servants of Allah's Messenger (ﷺ) brought dates, but he refused to accept them (on the plea) that those did not seem to be of the dates of our land. He said: Something had happened to the dates of our land, or our dates. So I got these dates (in exchange by giving) excess (of the dates of our land), whereupon he said: You made an addition for getting the fine dates (in exchange) which tantamounts, to interest; don't do that (in future). Whenever you find some doubt (as regards the deteriorating quality of) your dates, sell them, and then buy the dates that you like",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4087,
			"arabicnumber": "1594.04",
			"text": "Abu Nadra reported:I asked Ibn Umar and Ibn Abbas (Allah be pleased with them) about the conversion of gold with gold but they did not find any harm in that. I was sitting in the company of Abd Sa'id al-Khudri (Allah be pleased with him) and asked him about this exchange, and he said: Whatever is addition is an' interest. I refused to accept it on account of their statement (statement of Ibn 'Abbas and Ibn 'Umar). He said: I am not narrating to you except what I heard from Allah's Messenger (ﷺ). There came to him the owner of a date-palm with one sa' of fine dates, and the dates of Allah's Apostle (ﷺ) were of that colour. Allah's Apostle (ﷺ) said to him: Where did you get these dates? I went with two sa's of (inferior dates) and bought one sa' of (these fine dates), for that is the prevailing price (of inferior dates) in the market and that is the price (of the fine quality of dates in the market), whereupon Allah's Messenger (ﷺ) said: Woe be upon you! You have dealt in interest, when you decide to do it (i. e. exchange superior quality of dates for inferior quality) ; so you should sell your dates for another commodity (or currency) and then with the help of that commodity buy the dates you like. Abu Sa'ad said: When dates are exchanged for dates (with different qualities) there is the possibility (of the element of) interest (creeping into that) or when gold is exchanged for gold having different qualities. I subsequently came to Ibn 'Umar and he forbade me (to do it), but I did not come to Ibn 'Abbas; (Allah be pleased with them). He (the narrator) said: Abu as-Sahba' narrated to me: He asked Ibn Abbas (Allah be pleased with them) in Mecca, and he too disapproved of it",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4088,
			"arabicnumber": "1596.01",
			"text": "Abu Salih reported:I heard Abu Sa'id al-Khudri (Allah be pleased with him) said: Dinar (gold) for gold and dirham for dirham can be (exchanged) with equal for equal; but he who gives more or demands more in fact deals in interest. I sald to him: Ibn 'Abbas (Allah be pleased with them) says otherwise, whereupon he said: I met Ibn 'Abbas (Allah be pleased with them) and said: Do you see what you say; have you heard it from Allah's Messenger (ﷺ), or found it in the Book of Allah, the Glorious and Majestic? He said: I did not hear it from Allah's Messenger (ﷺ). and I did not find it in the Book of Allah (Glorious and Majestic), but Usama b. Zaid narrated it to me that Allah's Apostle (ﷺ) said: There can be an element of interest in credit",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4089,
			"arabicnumber": "1596.02",
			"text": "Ubaidullah b. Abu Yazid heard Ibn 'Abbas (Allah be pleased with them) as saying:Usama b. Zaid reported Allah's Apostle (ﷺ) as saying: There can be an element of interest in credit (when the payment is not equal)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4090,
			"arabicnumber": "1596.03",
			"text": "Ibn 'Abbas; (Allah be pleased with them) reported on the authority of Usama b. Zaid Allah's Messenger (ﷺ) as having said this:There is no element of interest when the money or commodity is exchanged hand to hand",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4091,
			"arabicnumber": "1596.04",
			"text": "Ata' b. Abu Rabah reported:Abu Sa'id al-Khudri (Allah be pleased with them) met Ibn 'Abbas (Allah be pleased with them) and said to him: What do you say in regard to the conversion (of commodities or money) did you hear it from Allah's Messenger (ﷺ), or is it something which you found In Allah's Book, Majestic and Glorious? Thereupon Ibn Abbas (Allah be pleated with them) said: I don't say that. So far at Allah's Massenger (ﷺ) is concerned, you know him better, and to far as the Book of Allah to concerned, I do not know it (more than you do), but 'Usama b. Zaid (Allah be pleased with him) narrated to me Allah's Messenger (ﷺ) as having said this: Beware, there can be an element of interest in credit",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4092,
			"arabicnumber": "1597",
			"text": "Abdullah (b. Mas'ud) (Allah be pleased with him) said that Allah's Messenger (ﷺ) cursed the one who accepted interest and the one who paid it I asked about the one who recorded it, and two witnesses to it. He (the narrator) said:We narrate what we have heard",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4093,
			"arabicnumber": "1598",
			"text": "Jabir said that Allah's Messenger (ﷺ) cursed the accepter of interest and its payer, and one who records it, and the two witnesses, and he said:They are all equal",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4094,
			"arabicnumber": "1599.01",
			"text": "Nu'man b. Bashir (Allah be pleased with him) reported:I heard Allah's Messenger (may peace be upon himn) as having said this (and Nu'man) pointed towards his ears with his fingers): What is lawful is evident and what is unlawful is evident, and in between them are the things doubtful which many people do not know. So he who guards against doubtful things keeps his religion and honour blameless, and he who indulges in doubtful things indulges in fact in unlawful things, just as a shepherd who pastures his animals round a preserve will soon pasture them in it. Beware, every king has a preserve, and the things God his declaced unlawful are His preserves. Beware, in the body there is a piece of flesh; if it is sound, the whole body is sound and if it is corrupt the whole body is corrupt, and hearken it is the heart",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4095,
			"arabicnumber": "1599.02",
			"text": "This hadith has been narrated on the authority of Zakariya with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4096,
			"arabicnumber": "1599.03",
			"text": "AI-Nu'man b. Bashir reported it from Allah's Apostle (ﷺ). The hadith narrated by Zakariya is, however, more complete and lengthy than the other ones",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4097,
			"arabicnumber": "1599.04",
			"text": "Nu'man b. Bashir b. Sa'd, a Companion of Allah's Messenger (ﷺ) was heard delivering a sermon at Hims and was saying:I heard Allah's Messenger (way peace be upon him) as saying: The lawful is evident and the unlawful is evident, the rest of the hadith is the same as related by Zakariya",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4098,
			"arabicnumber": "715.13",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported that he was travelling on his camel which had grown jaded, and he decided to let it off. When Allah's Apostle (ﷺ) met him and prayed for him and struck it, so it trotted as it had never trotted before. He said:Sell it to me for an 'uqaya. I said: No. He again said: Sell it to me. So I sold it to him for an 'uqaya, but made the stipulation that I should be allowed to ride back to my family. Then when I came to (my place) I took the camel to him and he paid me its price in ready money. I then went back and he sent: (someone) behind me (and as I came) he said: Do you see that I asked you to reduce price for buying your camel. Take your camel and your coins; these are yours",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4099,
			"arabicnumber": "715.14",
			"text": "This hadith has been narrated on the authority of Jabir through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported:I went on an expedition with Allah's Messenger (ﷺ). He overtook me and I was on a water-carrying camel who had grown tired and did not walk (trot). He (the Holy Prophet) said to me: What is the matter with your camel? I said: It is sick. He (the Holy Prophet) stepped behind and drove it and prayed for it, and then it always moved ahead of other camels. He (then) said: How do you find your camel? I said: It is, by the grace of your prayer, all right. He said: Would you sell this (camel) to me? I felt shy (to say him,\" No\" ) as we had no other camel for carrying water, but (later on) I said: Yes, and to I sold it to him on the condition that (I would be permitted) to ride it until I reached Madina. I said to him: Allah's Messenger, I am newly married, so I asked his permission (to go ahead of the caravan). He permitted me, and I reached Medina well in advance of other people, until I reached my destination. There my maternal uncle met me and asked me about the camel, and I told him what I had done with regard to it. He reproved me in this connection. He (Jabir) said: When I asked his permission (to go ahead of the caravan) Allah's Messenger (ﷺ) inquired of me whether I had married a virgin or a non-virgin. I said to him: I have married a non-virgin. He said: Why did you not marry a virgin who would have played with you and you would have played with her? I said to him: Allah's Messenger, my father died (or he fell as a martyr), and I have small sisters to (look after), so I did not like the idea that I should marry a woman who is like them and thus be not able to teach them manners and look after them properly. So I have married a non-virgin so that she should be able to look after them and teach them manners, When Allah's Messenger (ﷺ) came to Medina, I went to him in the morning with the camel. He paid me its price and returned that (the camel) to me",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4101,
			"arabicnumber": "715.16",
			"text": "Jabir reported:We went from Mecca to Medina with Allah's Messenger (ﷺ) when my camel fell ill, and the rest of the hadith is the same. (But it in also narrated in it: ) He (the Holy Prophet) said to me: Sell your camel to me. I said: No, but it is yours. He said: No. (it can't be), but sell it to me. I said: No, but, Allah's Messenger, it is yours. He said: No, it can't be, but sell it to me. I said: Then give me an 'uqaya of gold for I owe that to a person and then it would be yours. He (the Holy Prophet) said: I take it (for an 'uqiya of gold) and you reach Medina on it. As I reached Medina, Allah's Messenger (ﷺ) said to Bilal: Give him an 'uqiya of gold and make some extra payment too. He (Jabir) said: He gave me an 'uqiya of gold and made an addition of a qirat. He (Jabir) said: The addition made by Allah's Messenger (ﷺ) was with me (as a sacred trust for belssing) and lay with me in a pocket until the people of Syria took it on the Day of Harra",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4102,
			"arabicnumber": "715.17",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported:We were with Allah's Messenger (ﷺ) in a journey and my camel meant for carrying water lagged behind. The rest of the hadith is the same and it is mentioned also: Allah's Messenger (ﷺ) pricked it and then said to me: Ride in the name of Allah. He constantly made addition (in prayers for me) and went on saying. May Allah forgive you",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4103,
			"arabicnumber": "715.18",
			"text": "Jabir (Allah be pleased with him) reported:My camel had grown tired as Allah's Messenger (ﷺ) came to me. He goaded it and it began to jump. After that I tried to restrain its rein so that I could listen to his (Prophet's) words, but I could not do that. Allah's Apostle (ﷺ) met me and said: Sell it to me, and I sold it for five 'uqiyas. I said: On the condition that I may use it as a ride (for going back) to Medina. He (the Holy Prophet) said: Well, you may use it as a ride up till Medina. When I came to Medina I handed over that to him and he made an addition of an uqiya (to that amount which had been agreed upon) and then presented that (camel) to me",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4104,
			"arabicnumber": "715.19",
			"text": "Abd Mutawakkil al-Najl reported from Jabir b. 'Abdullah (Allah be pleased with them) who said:I accompanied Allah's Messenger (ﷺ) in one of his journeys (the narrator says, he said in Jihad), and he narrated the rest of the hadith, and made this addition: He (the Holy Prophet) said: Jabir, have you received the price? I said: Yes, whereupon he said: Yours is the price as well as the camel; yours is the price as well as the camel",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4105,
			"arabicnumber": "715.20",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported:Allah's Messenger (ﷺ) bought a camel from me for two 'uqiyas and a dirham or two dirhams. As he reached Sirar (a village near Medina), he commanded a cow to be slaughtered and it was slaughtered, and they ate of that, and as he (the Holy Prophet) reached Medina he ordered me to go to the mosque and offer two rak'ahs of prayer, and he measured for me the price of the camel and even made an excess payment to me",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4106,
			"arabicnumber": "715.21",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported this narration from Allah's Apostle (ﷺ) but with this variation that he said:He (the Holy Prophet) bought the camel from me on a stipulated price. And he did not mention two 'uqiyas and a dirham or two dirhams, and he comanded a cow (to be slaughtered) and it was slaughtered, and he then distributed its flesh",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4107,
			"arabicnumber": "715.22",
			"text": "Jabir (Allah be pleased with him) reported that Allah's Apostle (ﷺ) said to him:I have taken your camelfor four dinars, and you may ride upon it to Medina",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4108,
			"arabicnumber": "1600.01",
			"text": "Abu Rafi' reported that Allah's Messenger (ﷺ) took from a man as a loan a young camel (below six years). Then the camels of Sadaqa were brought to him. He ordered Abu Rafi' to return to that person the young camel (as a return of the loan). Abu Rafi' returned to him and said:I did not find among them but better camels above the age of six. He (the Holy Prophet) said: Give that to him for the best men are those who are best in paying off the debt",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4109,
			"arabicnumber": "1600.02",
			"text": "Abu Rafi', the freed slave of Allah's Messenger (ﷺ), said:Allah's Messenger (ﷺ) took as a loan (the rest of the hadith is the same), but with this variation that he (the Holy Prophet) said: Good amongst the servants of Allah is he who is best in paying off the debt",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4110,
			"arabicnumber": "1601.01",
			"text": "Abu Huraira (Allah be pleased with him) reported:Allah's Messenger (ﷺ) owed (something) to a person. He behaved in an uncivil manner with him. This vexed the Companions of the Prophet (ﷺ), whereupon Allah's Apostle (ﷺ) said: He who has a right is entitled to speak, and said to them (his Companions): Buy a camel for him and give that to him. They said: We do not find a camel (of that age) but one with better age than that. He said: Buy that and give that to him, for best of you or best amongst you are those who are best in paying off debt",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4111,
			"arabicnumber": "1601.02",
			"text": "Abu Huraira (Allah be pleased with him) reported:Allah's Messenger (ﷺ) took a camel on loan, and then returned him (the lender) the camel of a more mature age and said: Good among you are those who are good in clearing off the debt",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4112,
			"arabicnumber": "1601.03",
			"text": "Abu Huraira (Allah be pleased with him) reported:There came a person demanding a camel from Allah's Messenger (ﷺ). He (the Holy Prophet) said: Give him (the camel) of that age or of more mature age, and said: Best among you is one who is best in clearing off the debt",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4113,
			"arabicnumber": "1602",
			"text": "Jabir (Allah be pleased with him) reported:There came a slave and pledg- ed allegiance to Allah's Apostle (ﷺ) on migration; he (the Holy Prophet) did not know that he was a slave. Then there came his master and demanded him back, whereupon Allah's Apostle (ﷺ) said: Sell him to me. And he bought him for two black slaves, and he did not afterwards take allegiance from anyone until he had asked him whether he was a slave (or a free man)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4114,
			"arabicnumber": "1603.01",
			"text": "A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) bought some grain from a Jew on credit and gave him a coat-of- mail of his as a pledge",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4115,
			"arabicnumber": "1603.02",
			"text": "A'isha (Allah be pleased with her) reported:Allah's Messenger (ﷺ) bought from a Jew grain (as loan) and pledged him his iron coat-of-mail",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4116,
			"arabicnumber": "1603.03",
			"text": "A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) bought from a Jew grain for a specified time; and gave him iron coat-of-mail of his as a pledge",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4117,
			"arabicnumber": "1603.04",
			"text": "This hadith has been narrated on the authority of 'A'isha (Allah be pleased with her), through another chain ol transmitters, but no mention was made of (its being made) of iron",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4118,
			"arabicnumber": "1604.01",
			"text": "Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Prophet (ﷺ) came to Medina, they were paying one and two years in advance for fruits, so he said:Those who pay in advance for anything must do so for a specified weight and for a definite time",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4119,
			"arabicnumber": "1604.02",
			"text": "Ibn 'Abbas (Allah be pleased with them) reported that when Allah's Messenger (ﷺ) came to (Medina) and the people were paying in advance (for the fruits, etc.), he said to them:He who makes an advance payment should not make advance payment except for a specified measure and weight (and for a specified period)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4120,
			"arabicnumber": "1604.03",
			"text": "Ibn Abu Najih has narrated a hadith like this with the same chain of transmitters, but he has not mentioned:\" for a definite period",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4121,
			"arabicnumber": "1604.04",
			"text": "This hadith has been narrated by Ibn Abu Najih through another chain of transmitters mentioning in it\" for a specified period",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4122,
			"arabicnumber": "1605.01",
			"text": "Ma`mar (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:He who hoards is a sinner. It was said to Sa`id (b. al-Musayyib): You also hoard. Sa`id said: Ma`mar who narrated this hadith also hoarded",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4123,
			"arabicnumber": "1605.02",
			"text": "Ma'mar b. Abdullah reported Allah's Messenger (ﷺ) as saying:No one hoards but the sinner",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4124,
			"arabicnumber": "1605.03",
			"text": "This hadith has been transmitted on the authority of Sulaiman b. Bilal from Yahya",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4125,
			"arabicnumber": "1606",
			"text": "Abu Huraira (Allah be pleased with him) said he heard Allah's Messenger (ﷺ) as saying:Swearing produces a ready sale for a commodity, but blots out the blessing",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4126,
			"arabicnumber": "1607",
			"text": "Abu Qatada al-Ansari (Allah be pleased with him) reported he heard Allah's Messenger (ﷺ) say:Beware of swearing; it produces a ready sale for a commodity, but blots out the blessing",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4127,
			"arabicnumber": "1608.01",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:He who has a partner in a dwelling or a garden, it is not lawful for him to sell that until he is permitted by his partner. If he (the partner) agrees, he should go in for that, and if he disapproves of that, he should abandon (the idea of selling it)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4128,
			"arabicnumber": "1608.02",
			"text": "Jabir bin 'Abdullah (Allah be pleased with them) said that the Messenger of Allah (ﷺ) decreed pre-emption in every joint ownership and not divided-the one-it may be a dwelling or a garden. It is not lawful for him (for the partner) to sell that until his partner gives his consent. He (the partner) is entitled to buy it when he desires and he can abandon it if he so likes. And if he (the one partner) sells it without getting the consent of the (other partner), he has the greatest right to it",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4129,
			"arabicnumber": "1608.03",
			"text": "Jabir b. 'Abdullah (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:There is pre-emption in everything which is shared, be it land, or a dwelling or a garden. It is not proper to sell it until he informs his partner; he may go in for that, or he may abandon it; and it he (the partner intending to sell his share) does not do that, then his partner has the greatest right to it until he permits him",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4130,
			"arabicnumber": "1609.01",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:None among you should prevent his neighbour from fixing a beam in his wall. Abu Huraira (Allah be pleased with him) then said: What is this that I see you evading (this injunction of the Holy Prophet)? By Allah, I will certainly throw it between your shoulders (narrate this to you)",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4131,
			"arabicnumber": "1609.02",
			"text": "This hadith is narrated on the authority of Zuhri with the same chain of transrmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4132,
			"arabicnumber": "1610.01",
			"text": "Sa'id b. Zaid b. 'Amr b. Nufail (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:He who wrongly took a span of land, Allah shall make him carry around his neck seven earths",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4133,
			"arabicnumber": "1610.02",
			"text": "Sa'id b. Zaid b. 'Amr b. Nufail (Allah be pleased with them) reported that Arwi (bint Uwais) disputed with him (in regard to a part of the land) of his hodse. He said:Leave it and take off your claim from it, for I heard Allah's Messenger (ﷺ) as saying: He who took a span of land without his right would be made to wear around his neck seven earths on the Day of Resurrection. He (Sa'id b. Zaid) said: O Allah, make her blind if she has told a lie and make her grave in her house. He (the narrator) said: I saw her blind groping (her way) by touching the walls and saying: The curse of Sa'id b. Zaid has hit me. And it so happened that as she was walking in her house, she passed by a well in her house and fell therein and that be- came her grave",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": "1610.03",
			"text": "Hisham b. Urwa reported on the authority of his father (Allah be pleased with him) that Arwa bint Uwais disputed with Sa'id b. Zaid that he had seized some of the land belonging to her. She brought this dispute before Marwan b. al-Hakam. Sa'id said:How could I take a part of her land, after what I heard from Allah's Messenger (may peace be upon'him)? He (Marwan) said: What did you hear from Allah's Messenger (ﷺ)? He said: I heard Allah's Messenger (ﷺ) say: He who wrongly took a span of land would be made to wear around his neck seven earths. Marwan said: I do not ask any evidence from you after this. He (Sa'id) said: O Allah, make her blind if she has told a lie and kill her in her own land. He (the narrator) said: She did not die until she had lost her eyesight, and (one day) as she was walking in her land, she fell down into a pit and died",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": "1610.04",
			"text": "Sa'id b. Zaid reported:I heard Allah's Apostle (ﷺ) say: He who took a span of earth wrongly would be made to wear around his neck seven earths on the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": "1611",
			"text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace he upon him) as saying:One should not take a span of land without having legitimate right to it, otherwise Allah would make him wear (around his neck) seven earths on the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": "1612.01",
			"text": "Muhammad b. Ibrahim said that Abu Salama reported to him that there was between him and his people dispute over a piece of land, and he came to 'A'isha and mentioned that to her, whereupon she said:Abu Salama, abstain from getting this land, for Allah's Messenger (ﷺ) said: He who usurps even a span of land would be made to wear around his neck seven earths",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": "1612.02",
			"text": "This hadith has been narrated on the authority of Abu Salama with another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": "1613",
			"text": "Abu Haraira reported Allah's Apostle (ﷺ) as saying:When you disagree about a path, its breadth should be made seven cubits",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 178
			}
		}
	]
}