{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5114,
			"arabicnumber": "977.03",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5115,
			"arabicnumber": "977.04",
			"text": "",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5127,
			"arabicnumber": "1979.01",
			"text": "Ali b. Abu Talib reported; There fell to my lot along with Allah's Messenger (ﷺ) an old she-camel from the spoils of Badr. Allah's Messenger (ﷺ) granted me another camel. I made them kneel down one day at the door of an Ansari, and I wanted to carry on them Idhkhir (a kind of grass) in order to sell that. There was with me a goldsmith of the tribe of Qainuqa'. I saught to give a wedding feast (on the occasion of marriage with) Fatima with the help of that (the price accrued from the sale of this grass). And Hamza b. 'Abd al-Muttalib was busy in drinking in that house in the company of a singing girl who was singing to him. She said:Hamza, get up for slaughtering the fat she-camels. Hamza attacked them with the sword and cut off their humps and ripped their haunches, and then took out their livers. I said to Ibn Shihab: Did he take out anything from the hump? He said: He cut off the humps altogether. Ibn Shihab reported 'Ali having said: I saw this (horrible) sight and it shocked me, and I came to Allah's Apostle (ﷺ) and there was Zaid b, Haritha with him and communicated to him this news. He came in the company of Zaid and I also went along with him and he went to Hamza and he expressed anger with him. Hamza raised his eyes and said: Are you (not) but the servants of my father? Allah's Messenger (ﷺ) turned back on his heels (on hearing this) until he went away from them",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5128,
			"arabicnumber": "1979.02",
			"text": "This hadith has been narrated on the authority of Juraij with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5129,
			"arabicnumber": "1979.03",
			"text": "Husain b. 'Ali reported 'Ali having said:There fell to my lot a she-camel out of the spoils of war on the Day of Badr, and Allah's Messenger (ﷺ) gave me (another) she-camel on that day out of the Khums (one-fifth reserved for Allah and His Messenger). When I made up my mind to consummate my marriage with Fatima, the daughter of Allah's Messenger (ﷺ), I prevailed upon a goldsmith of the tribe of Qainuqa' to go along with me so that we might bring Idhkhir wishing to sell that to the goldsmiths and thus I should be able to arrange my wedding feast. While I was arranging the equipments. i. e. litters, sacks and ropes, my two she-camels were sitting down at the side of the apartment of a person of the Ansar. I collected (the different articles of equipment) and found to my surprise that their humps had been chopped off and their haunches had been cut off and their livers had been taken out. I could not help weeping when I saw that plight of theirs. I said: Who has done that? They said: Hamza b. 'Abd al-Muttalib has done this. and he is in this house dead drunk in the company of some of the Ansair with asinging girl singing before him and his companions. She said in her song: O Hamza. get up and attack these falty she-camels. Thereupon Hamza stood up with a sword (in his hand) and cut off their humps and ripped their haunches and tore out their livers. 'Ali said: I went away until I came to Allah's Messenger (ﷺ) and there was with him Zaid b. Haritha. Allah's Messenger (ﷺ) recognised from my face what I had experienced, whereupon Allah's Messenger (ﷺ) said: What has happened to you? I said: Messenger of Allah, by Allah, I have never seen (such an unfortunate day) as this day. Hamza has committed aggression to my she-camels, and has cut off their humps. and ripped their haunches, and he is in a house in the company of some drunkards. (Hearing this) Allah's Messenger (ﷺ) sent for his mantle and, putting it on him, he proceeded, and I and Zaid b. Haritha followed him, until he came to the door (of the house) in which there was Hamza. He (the Holy Prophet) sought permission which they granted him. and they were all drunk. Allah's Messenger (ﷺ) began to reprimand Hamza for what he had done. Hamza's eyes were red. He cast a glance at Allah's Messenger (ﷺ) and then looked towards his knees. and then lifted his eyes and cast a glance at his waist and then lifted his eyes and saw his face. And then Hamza said: Are you anything but the slaves of my father? Alah's Messenger (ﷺ) came to know that he was intoxicated, and he thus turned upon his heels, and came out, and we also came out along with him",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5130,
			"arabicnumber": "1979.04",
			"text": "The above hadith has been narrated likewise through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5131,
			"arabicnumber": "1980.01",
			"text": "Anas b. Malik reported:I was the cup-bearer of some people in the house of Abu Talha on the day when liquor was forbidden. Their liquor had been prepared from dry dates or fresh dates when the announcer made the announcement. He (Abu Talha) said to me: Go out and find out (what the announcement is). I got out (and found) an announcer making this announcement: Behold, liquor has been declared unlawful. He said: The liquor (was spilt and) flawed in the lanes of Medina. Abu Talha said to me: Go out and Spill it, and I spilt it. They said or some of them said: Such and such were killed, such and such were killed for (the wine) had been in their stomachs. He (the narrator) said. I do not know whether it is the narration transmitted by Anas, (or by someone else). Then Allah, the Exalted and Majestic, revealed:\" There shall be no sin (imputed) unto those who have believed and done good works for what they may have eaten as long as they fear (Allah) and believe and do good works\" (v. 93)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5132,
			"arabicnumber": "1980.02",
			"text": "Abd al-Aziz b. Suhaib reported:They (some persons) asked Anas b. Malik, about Fadikh (that is, a wine prepared from fresh dates), whereupon he said: There was no liquor with us except this Fadikih of yours. It was only this Fadikh that I had been serving to Abu Talha and Abu Ayyub and some persons from amongst the Companions of the Messenger of Allah (ﷺ) in our house. When a person came and said: Has the news reached you? We said, No. He said: Verily liquor has been declared forbidden. Thereupon, Abd Talha said: Anas, spill these large pitchers. He (the narrator) said: They then never reverted to it, nor even asked about this after the announcement by that person",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5133,
			"arabicnumber": "1980.03",
			"text": "Anas b. Malik reported:I was standing amongst the uncles of my tribe serving them Fadikh while I was the youngest of them, when a person came and said: Verily the use of liqour has been prohibited. They said: Anas, spill it away. So I spilt it. He (one of the narrators. Sulaiman Taimi) said that he asked Anas what that was (the Fadikh). He said: It had been prepared from unripe and ripe dates. Abu Bakr b. Anas said: It was their liquor in those days. Sulaiman said: A person narrated it to me from Anas b. Malik that he had said so",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5134,
			"arabicnumber": "1980.04",
			"text": "Anas reported:I was standing amongst the members of my (tribe) and serving them liquor. The rest of the hadith is the same, but with this variation that Abu Bakr b. Anas said: It was their liquor in those days (prepared from dates), and Anas was present there and he did not deny this (fact) Mu'tamir reported on the authority of his father: A person who was with me told me that he had heard Anas saying that that was their liquor in those days",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5135,
			"arabicnumber": "1980.05",
			"text": "Anas b. Malik reported I was serving wine to Abu Talha, and Abu Dujana. and Mu'adh b. jabal admidst a group of Ansar when a visitor came to us and said There is a fresh news; the (verses) concerning the prohibition of liquor have been revealed. So we spilt it on that day; and it was a mixture of dry dates and fresh dates. Anas b. Malik said:Whil Khamr was declared unlawful, the common liquor of theirs was then a mixture of dry dates and fresh dates",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5136,
			"arabicnumber": "1980.06",
			"text": "Anas b. Malik said:I was serving wine to Abu Talha, Abu Dujana, and Suhail b. Baida' from a waterskin which contained the mixture of unripe dates and fresh dates. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5137,
			"arabicnumber": "1981",
			"text": "Anas b. Malik is reported to have said that Allah's Messenger (ﷺ) had forbidden to mixture fresh dates and unripe dates and then drinking (the wine prepared out of it), and that was their common intoxicant when liquor was prohibited",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5138,
			"arabicnumber": "1980.07",
			"text": "Anas b. Malik reported:I was serving drink to Abu 'Ubaida b. jarrah, Abu Talha and Ubayy b. Ka'b prepared from unripe dates and fresh dates when a visitor came and he said: Verily liquor has been prohibited. Thereupon, Abu Talha said: Anas, stand up and break this pitcher. I stool up and (took hold) of a pointed stone and struck the pitcher with its lower part until it broke into pieces",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5139,
			"arabicnumber": "1982",
			"text": "Anas b. Malik reported:Allah revealed the verse in which Allah prohibited the use of liquor. In those days no other liquor was drunk but that prepared from dates",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5140,
			"arabicnumber": "1983",
			"text": "Anas reported that Allah's Messenger (ﷺ) was asked about the use of Khamr from which vinegar is prepared. He said:No (it is prohibited)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5141,
			"arabicnumber": "1984",
			"text": "Wa'il al-Hadrami reported that Tariq b. Suwaid a-Ju'fi asked Allah's Apostle (ﷺ) about liquor. He forbade (its use) and he expressed hatred that it should be prepared. He (Tariq) said:I prepare it as a medicine, whereupon he (the Holy Prophet) said: It is no medicine, but an ailment",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5142,
			"arabicnumber": "1985.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) having said:Wine is prepared from the (fruit) of these two trees-date-palm and vine",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5143,
			"arabicnumber": "1985.02",
			"text": "This hadith has been narrated on the authority of Abu Huraira through a different chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5144,
			"arabicnumber": "1985.03",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Wine comes from vine and date-palms. Abu Kuraib has narrated it with a slight variation of words",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5145,
			"arabicnumber": "1986.01",
			"text": "Jabir b. 'Abdullah al-Ansari reported that Allah's Messenger (may peace upon him) prohibited the mixing of grapes and fresh dates, and dry dates and fresh dates",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5146,
			"arabicnumber": "1986.02",
			"text": "Jabir b. 'Abdullah al-Ansari reported that Allah's Messenger (ﷺ) prohibited the (preparation of) Nabidh by mixing together fresh dates and grapes, and he prohibited the preparation of Nabidh by mixing the fresh dates and unripe dates together",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5147,
			"arabicnumber": "1986.03",
			"text": "Jabir b. Abdullah reported Allah's Messenger (ﷺ) as saying:Do not mix fresh dates and dry dates, and grapes and fresh dates for preparing Nabidh",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5148,
			"arabicnumber": "1986.04",
			"text": "Jabir b. Abdullah al-Ansari reported that Allah's Messenger (ﷺ) Prohibited the preparation of Nabidh by mixing grapes and fresh dates. and he forbade the preparation of Nabidh by mixing unripe dates with fresh dates",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5149,
			"arabicnumber": "1987.01",
			"text": "Abu Sa'id reported that Allah's Apostle (ﷺ) prohibited that fresh dates and grapes be mixed together and that fresh dates and unripe dates be mixed together",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5150,
			"arabicnumber": "1987.02",
			"text": "Abu Sa'id reported that Allah's Messenger (ﷺ) prohibited us to mix grapes and dry dates together and unripe dates and dry dates (to prepare Nabidh)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5151,
			"arabicnumber": "1987.03",
			"text": "This hadith is narrated on the authority of Abi Maslama with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5152,
			"arabicnumber": "1987.04",
			"text": "Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:He who amongst you drinks Nabidh should drink that (prepared either from) grapes alone, or from dates alone, or from unripe dates alone (and not by mixing them with one another)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5153,
			"arabicnumber": "1987.05",
			"text": "Isma'il b. Muslim al-'Abadi reported on the authority of the same chain of transmitters:Allah's Messenger (ﷺ) prohibited us that we should mix dry dates with unripe dates or (mix) grapes with dry dates (and prepare Nabidh). He also said: He who amongst you drinks-the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5154,
			"arabicnumber": "1988.01",
			"text": "Abu Qatada, on the authority of his father, reported Allah's Messenger (ﷺ) having said this:Do not prepare Nabidh by mixing nearly ripe dates and fresh dates together, and do not prepare Nabidh by mixing grapes and dates together, but prepare Nabidh from each (one of them) separately",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5155,
			"arabicnumber": "1988.02",
			"text": "This hadith has been narrated on the authority of Yahya b. Abu Kathir with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5156,
			"arabicnumber": "1988.03",
			"text": "Abu Qatada reported Allah's Messenger (ﷺ) as saying:Do not prepare Nabidh by mixing nearly ripe and fresh dates and do not prepare Nabidh by mixing together fresh dates and grapes, but prepare Nabidh out of each (one of them) separately. Yahya stated that he had met 'Abdullah b. Abu Qatada and he narrated it on the authority of his father that Allah's Apostle (ﷺ) said this",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5157,
			"arabicnumber": "1988.04",
			"text": "This hadith has been narrated on the authority of Yahya b. Abu Kathir through these two chains of transmitters but with a slight variation of words",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5158,
			"arabicnumber": "1988.05",
			"text": "Abdullah b. Abu Qatada, on the authority of his father, reported Allah's Apostle (ﷺ) forbidding the preparation of the mixture of ripe dates and unripe dates, and the mixture of grapes and dates, and that of nearly ripe dates and fresh dates but the Prophet said:Prepare the Nabidh from each one of them separately",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5159,
			"arabicnumber": "1988.06",
			"text": "This hadith is narrated on the authority of Abu Qatada through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5160,
			"arabicnumber": "1989.01",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) forbade (the preparation of Nabidh) from grapes and dates, and unripe dates and dry dates (by mixing them together). He (the Prophet also) said:Prepare Nabidh from each one of them separately",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5161,
			"arabicnumber": "1989.02",
			"text": "The above hadith has been narrated on the authority of Abu Huraira through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5162,
			"arabicnumber": "1990.01",
			"text": "Ibn 'Abbas reported that Allah's Apostle (ﷺ) forbade the mixing of dates and grapes together, and mixing of unripe dates and ripe dates together (for preparing Nabidh), and he wrote to the people of Jurash (in Yemen) forbidding them to prepare the mixture of dates and grapes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5163,
			"arabicnumber": "1990.02",
			"text": "This hadith has been narrated through another chain of transmitters with a slight variation of words",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5164,
			"arabicnumber": "1991.01",
			"text": "Ibn Umar reported that he was forbidden to prepare Nabidh by mixing unripe dates and fresh dates, and dates with grapes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5165,
			"arabicnumber": "1991.02",
			"text": "Ibn 'Umar reported that they were forbidden to prepare Nabidh by mixing dry dates and fresh dates and dates and grapes together",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5166,
			"arabicnumber": "1992.01",
			"text": "Anas b. Malik reported that Allah's Messenger (ﷺ) forbade the preparation of Nabidh in gourd or varnished jar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5167,
			"arabicnumber": "1992.02",
			"text": "The above hadith is narrated through a different chain with slight variation in wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5168,
			"arabicnumber": "1993.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Do not prepare Nabidh in gourd or jar or in a pitcher besmeared with pitch (known as green pitcher)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5169,
			"arabicnumber": "1993.02",
			"text": "Abu Huraira reported that Allah's Apostle (ﷺ) forbade (the preparation of Nabidh) in varnished jar, pitcher besmeared with green pitch and hollow stump. It was said to Abu Huraira:What that Hantama was? He said: It is green pitcher (besmeared with pitch)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5170,
			"arabicnumber": "1993.03",
			"text": "Abu Huraira reported that Allah's Apostle (ﷺ) said to the group of Abd al-Qais:I forbid you (to prepare Nabidh) in gourd. and green pitcher, hollow stump and varnished jar and the waterskin having its upper end cut, but (prepare it) in your small waterskin, and tie its mouth",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5171,
			"arabicnumber": "1994",
			"text": "Ali reported that Allah's Messenger (ﷺ) forbade to prepare Nabidh in gourd and varnished jar. This hadith has been narrated through another chain of transmitters with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5172,
			"arabicnumber": "1995.01",
			"text": "Ibrahim reported:I said to Aswad if he had asked the Mother of the Believers (in which utensils) he (the Holy Prophet) disapproved the preparation of Nabidh. He (Aswad) said: Yes. I said: Mother of the Believers, inform me about the utensils in which) Allah's Apostle forbade to prepare Nabidh. She (Hadrat 'A'isha) said: He forbade us, the members of his family, to prepare Nabidh in gourd, or varnished jar. I said to him: Do you remember green pitcher, and pitcher? He said: I narrated to you what I have heard; should I narrate to you which I did not hear?",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5173,
			"arabicnumber": "1995.02",
			"text": "A'isha reported that Allah's Apostle (ﷺ) forbade (the preparation) of Nabidh in gourd and varnished jar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5174,
			"arabicnumber": "1995.03",
			"text": "The above hadith has been narrated likewise through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5175,
			"arabicnumber": "1995.04",
			"text": "Thumama b. Hazn Al-Qushairi reported:I met 'A'isha and asked her (about the utensils in which) Nabidh (may be prepared). She narrated to me that a group of 'Abd al-Qais came to Allah's Apostle (ﷺ) and asked: Allah's Apostle (ﷺ) about Nabidh. He (the Holy Prophet) forbade them to prepare Nabidh in varnished jar, hollow stumps and gourd and green pitcher",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5176,
			"arabicnumber": "1995.05",
			"text": "A'isha reported Allah's Messenger (ﷺ) forbidding (the preparation of Nabidh) in varnished jar, green pitcher, gourd, and hollow stump",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5177,
			"arabicnumber": "1995.06",
			"text": "Ishaq b. Suwaid reported through the same chain of transmitters but for the difference that he substituted the word\" gourd\" for\" waterskin\" (meant for preserving wine)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5178,
			"arabicnumber": "17.04",
			"text": "Ibn 'Abbas reported that there came to Allah's Messenger (ﷺ) a group of people from the tribe of 'Abd al-Qais. Allah's Messenger (ﷺ) said to them:I forbid you to prepare Nabidh in gourd, in pitcher besmeared with pitch, in hollow stump and in waterskin (meant for preserving wine). In the hadith transmitted on the authority of Hammad the word.\" gourd\" has been used in place of\" waterskin",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5179,
			"arabicnumber": "17.05",
			"text": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) forbade the (preparation of Nabidh) in gourd in pitcher besmeared with pitch, in varnished jar, and in hollow stumps",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5180,
			"arabicnumber": "17.06",
			"text": "Ibn Abbas reported that Allah's Messenger (ﷺ) forbade, the preparation of Nabidh in gourd, in varnished jar, hollow stump and from mixing up ripe dates with nearly ripe dates",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5181,
			"arabicnumber": "17.07",
			"text": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) forbade (preparation) of Nabidh in gourd, in hollow stump and in varnished jar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5182,
			"arabicnumber": "1996.01",
			"text": "Abu Sa'id reported that Allah's Messenger (ﷺ) forbade (the preparation) of Nabidh in a green pitcher (besmeared with pitch)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5183,
			"arabicnumber": "1996.02",
			"text": "Abu Sa'id Khudri reported that Allah's Messenger (ﷺ) forbade (the preparation) of Nabidh in gourd, in pitcher besmeared with green pitch, in hollow stump and in varnished jar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5184,
			"arabicnumber": "1996.03",
			"text": "This hadith has been reported on the authority of Qatada with the same chain of transmitters that Allah's Apostle (ﷺ) forbade (the preparation of) Nabidh, the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5185,
			"arabicnumber": "1996.04",
			"text": "Abu Sa'id reported that Allah's Messenger (ﷺ) forbade drinking in green pitcher, in gourd and in the hollow stump",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5186,
			"arabicnumber": "1997.01",
			"text": "Sa'id b. Jubair reported:I bear testimony to the fact that Ibn 'Umar and Ibn 'Abbas testified to the fact that Allah's Messenger (ﷺ) forbade (the preparation) of Nabidh in gourd in vessel besmeared with pitch and hollow stump",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5187,
			"arabicnumber": "1997.02",
			"text": "Sa'id b. Jubair reported:I asked Ibn 'Umar about (the preparation of) Nabidh in a green pitcher (besmeared with pitch), whereupon he said that Allah's Messenger (ﷺ) forbade the (preparation of) Nabidh in green pitcher (besmeared with pitch). I then came to Ibn Abbas and said: Do you hear what Ibn 'Umar has said? Thereupon he said: What does he say? I said: He stated that Allah's Messenger (ﷺ) has forbidden the (preparation of) Nabidh in a green pitcher (besmeared with pitch), whereupon he said: Ibn 'Umar has told the truth. Allah's Messenger (ﷺ) declared unlawful the preparation of Nabidh in a green pitcher (besmeared with pitch). I said: What is this thing, the Nabidh of a pitcher (Nabidh prepared in a pitcher)? Thereupon, he said: Everything that is prepared in earthen pitcher",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5188,
			"arabicnumber": "1997.03",
			"text": "Ibn 'Umar reported:Allah's Messenger (ﷺ) addressed people in one of his expeditions. Ibn 'Umar said: I went forward to him but he went away before I reached him. I asked (the people present there): What did he say? They said that he (the Holy Prophet) had forbidden the preparation of Nabidh in gourd and varnished jar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5189,
			"arabicnumber": "1997.04",
			"text": "This hadith has been reported on the authority of Ibn 'Umar with different chains of transmitters but they have not mentioned:\" In one of his expeditions\" except Malik and Usama",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5190,
			"arabicnumber": "1997.05",
			"text": "Thabit reported:I said to Ibn 'Umar that Allah's Messenger (ﷺ) had forbidden the preparation of Nabidh in the green pitcher (besmeared with pitch). He said: This is what they stated. I said: Did Allah's Messenger (ﷺ) forbid this? He said: They said so",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5191,
			"arabicnumber": "1997.06",
			"text": "A person asked Ibn 'Umar if the Messenger of Allah (ﷺ) forbade the preparation of Nabidh in a green pitcher (besmeared with pitch). He said:Yes. Then Tawus said: By Allah, I heard it from him",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5192,
			"arabicnumber": "1997.07",
			"text": "Ibn 'Umar reported that a person came to him and said:Did Allah's Apostle (ﷺ) forbid the preparation of Nabidh in a green pitcher (besmeared with pitch and) in varnished jar? He said: Yes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5193,
			"arabicnumber": "1997.08",
			"text": "Ibn 'Umar reported that Allah's Messenger (ﷺ) forbade (the preparation) of Nabidh in a green pitcher (besmeared with pitch) and in varnished jar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5194,
			"arabicnumber": "1997.09",
			"text": "Ibrahim b. Maisarah reported that he heard Tawus as saying:I was sitting with Ibn 'Umar when a man came to him, and said: Did Allah's Messenger (ﷺ) forbid the preparation of Nabidh in a green pitcher (besmeared with pitch), in varnished jar and in gourd? Thereupon he said: Yes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5195,
			"arabicnumber": "1997.10",
			"text": "Muharib b. Dithar reported:I heard Ibn 'Umar say: Allah's Messenger (ﷺ) forbade (the preparation of Nabidh) in a pitcher besmeared with pitch, in gourd, in varnished jar. He said, I heard it from him more than once",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5196,
			"arabicnumber": "1997.11",
			"text": "Muharib b. Dithar reported a hadith like this on the authority of Ibn 'Umar through a different chain of transmitters. He (the narrator) said:I think he also made a mention of hollow stump",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5197,
			"arabicnumber": "1997.12",
			"text": "Uqba b. Huraith said:I heard Ibn 'Umar saying: The Messenger of Allah (ﷺ) forbade (the preparation of Nabidh) in a green pitcher (besmeared with pitch), in varnished jar, and in gourd, and he said: Prepare Nabidh in small waterskins",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5198,
			"arabicnumber": "1997.13",
			"text": "Jabalah reported:I heard Ibn 'Umar narrating that Allah's messenger (ﷺ) had forbidden (the preparation of Nabidh) in the pitcher besmeared with pitch. I said to him: What is Huntama? He said: It is a pitcher (besmeared with pitch)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5199,
			"arabicnumber": "1997.14",
			"text": "Zadhan reported:I said to Ibn 'Umar: Tell me in your own language and then explain it to me in any language because your language is different from our language (about the vessels) in which Allah's Apostle (ﷺ) has forbidden (us) to drink. He said: Allah's Messenger (ﷺ) has forbidden (the preparation) of Nabidh in Hantama and that is a pitcher (besmeared with pitch), in gourd and that is pumpkin, in the varnished jar, in hollow stump and in wooden vessels. This Naqir is the wood of date-palm from which the vessel is fashioned out or hollowed out, but he commanded us to prepare Nabidh in waterskins",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5200,
			"arabicnumber": "1997.15",
			"text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5201,
			"arabicnumber": "1997.16",
			"text": "Sa'id b. Musayyib reported:I heard 'Abdullah b 'Umar saying this near the pulpit while pointing towards the pulpit of Allah's Messenger (ﷺ): A group of the tribe of 'Abd al-Qais came to Allah's Messenger (ﷺ) and asked him about (vessels) which might (be used for preparing Nabidh and) drinking in them. He (the Holy Prophet) forbade them (to use) gourd, hollow stump, vessel besmeared with pitch. I said to him: Abu Muhammad, (what about) varnished jar? and we think he had forgotten to mention the word 'varnished jar\". Thereupon he said: I did not hear it from him on that day, i. e. from 'Abdullah b. 'Umar, and he hated that (i. e. preparation of Nabidh in gourd)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5202,
			"arabicnumber": "1998.01",
			"text": "It is reported on the authority of Jabir and Ibn Umar that Allah's Messenger (ﷺ) forbade (the preparation) of Nabidh in hollow stump and varnished jar and gourd",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5203,
			"arabicnumber": "1998.02",
			"text": "It is reported on the authority of Ibn Umar that Allah's Messenger (ﷺ) forbade (the preparation of Nabidh in) a green pitcher (besmeared with pitch) and gourd and varnished jar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5205,
			"arabicnumber": "1999.02",
			"text": "This hadith is reported on the authority of Jabir b. Abdullah that Nabidh was prepared for him in a big bowl of stone",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5206,
			"arabicnumber": "1999.03",
			"text": "Jabir reported that Nabidh was prepared for Allan's Messenger (ﷺ) in a waterskin, but if they did not find waterskin it was prepared in a big bowl of stone. One of the persons and I had heard from Abu Zubair that it was Biram (a vessel made of stone)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5209,
			"arabicnumber": "977.07",
			"text": "Ibn Buraida, on the authority of his father, reported Allah's Messenger (may Peace be upon him) as saying:I had forbidden you from the drinking (and preparation of) Nabidh in the vessels made out of leather, but (now) you may drink in all vessels, but you do not drink an intoxicant",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5210,
			"arabicnumber": "2000",
			"text": "Abdullah b. 'Amr reported that when Allah's Messenger (ﷺ) forbade (the preparation) of Nabidh in vessels, they said all the people cannot (afford to have) them. He (the Holy Prophet) then granted them permission (to prepare) Nabidh in a green pitcher, but not in those besmeared with pitch",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5211,
			"arabicnumber": "2001.01",
			"text": "A'isha reported:Allah's Messenger (ﷺ) was asked about Bit'i, whereupon he said: Every drink that causes intoxication is forbidden",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5212,
			"arabicnumber": "2001.02",
			"text": "A'isha reported that Allah's Messenger (ﷺ) was asked about it, whereupon he said that everything that causes intoxication is forbidden",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5213,
			"arabicnumber": "2001.03",
			"text": "This hadith has been reported on the authority of Zuhri with this chain of transmitters but in the hadith transmitted on the authority of Sufyan and Salih (these words are not found)\" she was asked about Bit\". (These words are found in the hadith) transmitted on the authority of Ma'mar and in the hadith transmitted on the authority of Salih (only these words are found) that she (Hadrat 'A'isha) had heard Allah's Messenger (ﷺ) say:Every intoxicating drink is forbidden",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5215,
			"arabicnumber": "1733.06",
			"text": "Abu Burda reported on the authority of his grandfather that Allah's Messenger (ﷺ) sent him and Mu'adh b. Jabal to Yemen and said to them:Give good tidings to the (people). and make things easy (for them), teach (them), and do not repel (them) ; and I think he also said: Cooperate cheerfully with each other. When he (the Holy Prophet) turned his back, Abu Musa returned to him and said: Allah's Messenger, they (the people of Yemen) have a drink which is (made) from honey and which is prepared by cooking it until it coagulates, and Mizr is prepared from barley, whereupon Allah's Messenger (ﷺ) said: Every intoxicant that detains you from prayer is forbidden",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5216,
			"arabicnumber": "1733.07",
			"text": "Abu Burda reported on the authority of his father:Allah's Messenger (ﷺ) sent me and Mu'adh to Yemen saying: Call people (to the path of righteousness) and give good tidings to the (people), and do not repel them, make things easy for them and do not make things difficult. I (Burda) said: Allah's Messenger, give us a religious verdict about two kinds of drinks which we prepare in Yemen. One is Bit' which is prepared from honey; it is a fermented Nabidh and is strong and turns into wine, and (the second is) Mizr which is prepared from millet and barley. Thereupon, Allah's Messenger (ﷺ), who had been gifted with the most eloquent and pithy expressions, said: I forbid you from every intoxicant that keeps you away from prayer",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5217,
			"arabicnumber": "2002",
			"text": "Jabir reported that a person came from Jaishan, a town of Yemen, and he asked Allah's Apostle (ﷺ) about the wine which was drunk in their land and which was prepared from millet and was called Mizr. Allah's Messenger (ﷺ) asked whether that was intoxicating. He said:Yes. Thereupon Allah's Messenger (ﷺ) said: Every intoxicant is forbidden. Verily Allah the Exalted and Majestic, made a covenant to those who drank intoxicants to make their drink Tinat al-Khabal. They said: Allah's Messenger, what is Tinat a]-Khabal? He said: It is the sweat of the denizens of Hell or the discharge of the denizens of Hell",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5218,
			"arabicnumber": "2003.01",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:Every intoxicant is Khamr and every intoxicant is forbidden. He who drinks wine in this world and dies while he is addicted to it, not having repented, will not be given a drink in the Hereafter",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5219,
			"arabicnumber": "2003.02",
			"text": "Ibn 'Umar, through another chain of transmitters; reported Allah's Messenger (ﷺ) having said this:Every intoxicant is Khamr and every intoxicant is forbidden",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5220,
			"arabicnumber": "2003.03",
			"text": "This hadith has been narrated on the authority of Musa b. Uqba with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5221,
			"arabicnumber": "2003.04",
			"text": "Nafi' reported Ibn 'Umar as saying:I do not know this but from Allah's Apostle (ﷺ) who said: Every intoxicant is Khamr and every Khamr is forbidden",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5222,
			"arabicnumber": "2003.05",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:He who drank (wine) in this world would be deprived of it in the Hereafter",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5223,
			"arabicnumber": "2003.06",
			"text": "Ibn 'Umar said:He who drank wine in the world and did not repent would be deprived of it (the pure drink) in the Hereafter. It was said to Malik: Is this hadith Marfu'? He said: Yes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5224,
			"arabicnumber": "2003.07",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:He who drank wine in this world will not be provided with pure drink in the Hereafter, except in case he repents",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5225,
			"arabicnumber": "2003.08",
			"text": "Ibn 'Umar reported this hadith from Allah's Messenger (ﷺ) through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5226,
			"arabicnumber": "2004.01",
			"text": "Ibn 'Abbas reported that Nabidh was prepared for Allah's Messenger (ﷺ) in the beginning of the night and he would drink it in the morning and the following night and the following day and the night after that up to the afternoon. If anything was left out of that he gave it to his servant, or gave orders for it to be poured out",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5227,
			"arabicnumber": "2004.02",
			"text": "Ibn 'Abbas reported that Nabidh was prepared for Allah's Messenger (ﷺ) in the waterskin, Shu'ba said:It was the night of Monday. He drank it on Monday and on Tuesday up to the afternoon, and If anything was left out of it he gave it to his servant or poured it out",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5228,
			"arabicnumber": "2004.03",
			"text": "Ibn Abbas reported that raisins were steeped in water for the Messenger of Allah (ﷺ) and he would drink it on that day and on the next day and on the following day until the evening of the third day. He would then order it to be drunk by (other people) or to be thrown away",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5229,
			"arabicnumber": "2004.04",
			"text": "Ibn Abbas reported that Nabidh was prepared from raisins for Allah's Messenger (ﷺ) in the waterskin and he would drink it on that day and on the next day and the day following and when It was the evening of the third day, and he would drink it and give it to (his Companions) and if something was left over, he threw that away",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5230,
			"arabicnumber": "2004.05",
			"text": "Yahya Abu 'Umar al-Nakhai reported that some people asked Ibn Abbas about the sale and purchase of wine and its commerce. He asked (them):Are you Muslims? They said, Yes. Thereupon he said: Its sale and purchase and its trade are not permissible. They then asked him about Nabidh and he said: Allah's Messenger (ﷺ) went out on a journey and then came back and some persons amongst his Companions prepared Nabidh for him in green pitcher, hollow stump and gourd. He commanded it to be thrown away, and it was done accordingly. He then ordered them (to prepare it.) in a waterskin and it was prepared in that by steeping raisins in water, and it was prepared in the night. In the morning he drank out of that and on that day and then the next night, and then on the next day until the evening. He drank and gave others to drink. When it was morning (of the third night) he commanded what was left of that to be thrown away",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5231,
			"arabicnumber": "2005.01",
			"text": "Thumama (i. e. Ibn Hazn al-Qushairi) reported:I met 'A'isha and asked her about Nabidh (that was served to the Holy Prophet). 'A'isha called an Abyssinian maid (servant) and said: Ask her (about it) for it was he, who prepared the Nabidh for the Messenger of Allah (ﷺ). The Abyssinian (maid-servant) said: I prepared Nabidh for him in a waterskin in the night and tied its mouth and then suspended it; and when it was morning he (the Holy Prophet) drank from it",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5232,
			"arabicnumber": "2005.02",
			"text": "A'isha reported:We prepared Nabidh for Allah's Messenger (ﷺ) in a waterskin, the upper part of which was tied and it (the waterskin) had a hole (in its lower part). We prepared the Nabidh in the morning and he drank it in the evening and we prepared the Nabidh in the night, and he would drink it in the morning",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5233,
			"arabicnumber": "2006.01",
			"text": "Sahl b. Sa'd reported that Abu Usaid al-Sa'idi invited Allah's Messenger (ﷺ) to his wedding feast, and his wife had been serving them on that day while yet a bride. Sahl said ' Do you know what she served as a drink to Allah's Messenger (ﷺ)? She steeped the dates in water during the night in a big bowl, and when he (the Holy Prophet) had eaten food she served him this drink",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5234,
			"arabicnumber": "2006.02",
			"text": "Sahl reported that Abu Usaid al-Sa'idi came to Allah's Messenger (ﷺ) ; the rest of the hadith is the same, but he did not mention this:when he had eaten (the food) she gave him this to drink",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5235,
			"arabicnumber": "2006.03",
			"text": "Sahl b. Sa'd reported (this hadith through another chain of transmitters) and he said (these words):\" In a big bowl of stone, and when Allah's Messenger (ﷺ) had taken the food, she drenched the dates and served (this) especially to him",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5236,
			"arabicnumber": "2007",
			"text": "Sahl b. Sa'd reported:An Arab woman was mentioned before Allah's Messenger (ﷺ). He commanded Abu Usaid to send a message to her and he (accordingly) sent a message to her. She came and stayed in the fortresses of Banu Sa'idah. Allah's Messenger (ﷺ) went out until he came to her while she was (at that time) sitting with her head downcast. When Allah's Messenger (ﷺ) talked to her, she said: I seek refuge with Allah from you. Thereupon he said: I (have decided to) keep you away from me. They (the people near her) said: Do you know who he is? She said: No. They said: He is the Messenger of Allah (ﷺ). He came to you in order to give you the proposal of marriage. She said: Then I am the most unfortunate woman because of this (i. e. my defiance). Sahl said: Allah's. Messenger (ﷺ) then set forth on that day until he sat in the Saqifa of Banu Sa'idah along with his Companions. He then said to Sahl: Serve us drink. He (Sahl) said: I brought out for them this bowl (containing drink) and served them this. Abu Hazim said: Sahl brought out this cup for us and we also drank from that. Then 'Umar b. 'Abd al-'Aziz asked him to give that (cup) as a gift to him and he gave (it to) him as a gift. In the narration of Abu Bakr b. Ishaq (the words) are:\" Sahl, serve us drink",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5237,
			"arabicnumber": "2008",
			"text": "Anas reported:I served drink to Allah's Messenger (ﷺ) in this cup of mine: honey, Nabidh, water and milk",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5238,
			"arabicnumber": "2009.01",
			"text": "Abu Bakr Siddiq reported:As we went along with Allah's Messenger (ﷺ) from Mecca to Medina, we passed by a shepherd and Allah's Messenger (ﷺ) was feeling thirsty. He (Abu Bakr Siddiq) said: I milked for him a small quantity of milk (from his goat) and brought it to him (the Holy Prophet), and he drank it and I was very happy",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5239,
			"arabicnumber": "2009.02",
			"text": "Al-Bara' reported:When Allah's Messenger (ﷺ) went forth from Mecca to Medina, Suraqa b. Malik b. Ju'shum pursued him. Allah's Messenger (ﷺ) invoked curse upon him, and his horse sank (in the desert). He (Suraqa) said: (Allah's Messenger), invoke blessings for me and I will do no harm to you. He (the Holy Prophet) then supplicated Allah. (At that time) he (the Holy Prophet) felt thirsty, and they happened to pass by a shepherd. Abu Bakr Siddiq said: I took hold of a bowl and milked some milk into it for Allah's Messenger (ﷺ) and gave it to him. He drank it and I was pleased",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5240,
			"arabicnumber": "168.02",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) was presented two cups at Bait al-Maqdis on the night of Heavenly Journey, one containing wine and the other containing milk. He looked at both of them, and be took the one containing milk, whereupon Gabriel (peace be upon him) said:Praise is due to Allah Who guided you to the true nature; had you taken the one containing wine, Your Umma would have gone astray",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5241,
			"arabicnumber": "168.03",
			"text": "This hadith is narrated on the authority of Abu Huraira through another chain of transmitters, but he did not mention Aelia (Capitolina. i. e. Bait al-Maqdis)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5242,
			"arabicnumber": "2010.01",
			"text": "Abu Humaid Sa'idi reported:I came to Allah's Messenger (ﷺ) with a cup of milk from Naqi' which had no cover over it, whereupon he said: Why did you not cover it? - even if you had covered it only with a stick. Abu Humaid said that he had been ordered that waterskins be tied during the night, and the doors be closed during the night",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5243,
			"arabicnumber": "2010.02",
			"text": "Abu Humaid Sa'idi reported through another chain of transmitters that he brought to Allah's Messenger (ﷺ) a cup containing milk, but there is no mention of the word\" in the night",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5244,
			"arabicnumber": "2011.01",
			"text": "Jabir b 'Abdullah reported:We were with Allah's Messenger (ﷺ) and he asked for water. A person said: Allah's Messenger, may we not give you Nabidh to drink? He (the Holy Prophet) said: Yes (you may). He (the narrator) said: Then that person went out speedily and brought a cup containing Nabidh, whereupon Allah's Messenger (ﷺ) said: Why did you not cover it? - even if it is with a wood. He said that then he drank it",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5245,
			"arabicnumber": "2011.02",
			"text": "Jabir reported that a person who was known as Abu Humaid brought for him (the Holy Prophet) a cup of milk from al-Naqi'. Allah's Messenger (ﷺ) said to him:Why did you not cover it even with a wood across it?",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5246,
			"arabicnumber": "2012.01",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:Cover vessels, waterskins, close the doors and extinguish the lamps, for the Satan does not loosen the waterskin, does not open the door and does not uncover the vessels. And if one amongst you fails to find (something) to cover it well, he should cover it by placing (a piece of) wood across it. Qutaiba did not mention the closing of the doors in the hadith transmitted by him",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5247,
			"arabicnumber": "2012.02",
			"text": "This hadith is reported on the authority of Jabir but with a slight change of wording, and he did not mention the words:\" Putting a stick across the vessel",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5248,
			"arabicnumber": "2012.03",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:Shut the doors; the rest of the hadith is the same but with a slight variation of wording: Cover the utensils, and further said: It (the mouse) may set fire to the clothes of the residents of the house",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5249,
			"arabicnumber": "2012.04",
			"text": "This hadith has been reported on the authority of Jabir through another chain of transmitters but with a slight variation of words:\" The mouse may set the house on fire over its inhabitants",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5250,
			"arabicnumber": "2012.05",
			"text": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) having said:When the wings of the night (spread) or it is night, restrain your children (from going out), for the Satan is abroad at that time, and when a part of the night is passed, free them and shut the doors. making mention of God's name, for the Satan does not open a closed door; and tighten the (mouths of waterskins and mention the name of Allah, cover your utensils and mention the name of Allah even though you should just put something on them, and extinguish your lamps)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5251,
			"arabicnumber": "2012.06",
			"text": "This hadith has been narrated on the authority of Jabir b. Abdullah through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5252,
			"arabicnumber": "2012.07",
			"text": "This hadith has been transmitted on the authority of Ibn Juraij",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5253,
			"arabicnumber": "2013.01",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:Do not let your animals and children go out when the sun sets until the first and the darkest part of the night is over, for the Satan is let loose with the sinking of the sun until the darkest part of the night is over",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5254,
			"arabicnumber": "2013.02",
			"text": "Jabir b. Abdullah reported this hadith through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5255,
			"arabicnumber": "2014.01",
			"text": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) as saying:Cover the vessels and tie the waterskin, for there is a night in a year when pestilence descends, and it does not pass an uncovered vessel or an untied waterskin but some of that pestilence descending into it",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5256,
			"arabicnumber": "2014.02",
			"text": "This hadith is reported on the authority of Laith b. Sa'd with the same chain of transmitters, but with a slight variation in wording (and that is that) he (the Holy Prophet) said:There is a day in a year when descends the pestilence; at the end of the hadith Laith said that the non Arabs save themselves from it in Kanun Awwal (this is the month of December)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5257,
			"arabicnumber": "2015",
			"text": "Salim, on the authority of his father, reported Allah's Messenger (ﷺ) having said:Do not leave the fire burning in your houses when you go to sleep",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5258,
			"arabicnumber": "2016",
			"text": "Abu Musa reported that a house was burnt down in Medina during the night over its inhabitants. When their matter was reported to Allah's Messenger (ﷺ), he said; This fire is an enemy of yours. So when you go to sleep, extinguish it",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5259,
			"arabicnumber": "2017.01",
			"text": "Hudhaifa reported:When we attended a dinner along with the Messenger of Allah (ﷺ) we did not lay our hands on the food until Allah's Messenger (ﷺ) had laid his hand and commenced eating (the food). Once we went with him to a dinner when a girl came rushingly as it someone had been pursuing her. She was about to lay her hand on the food, when Allah's Messenger (ﷺ) caught her hand. Then a desert Arab came there (rushingly) as if someone had been pursuing him. He (the Holy Prophet) caught his hand; and then Allah's Messenger (ﷺ) said: Satan considers that food lawful on which Allah's name is not mentioned. He had brought this girl so that the food might be made lawful for him and I caught her hand. And he had brought a desert Arab so that (the food) might be lawful for him. So I caught his hand. By Him, in Whose hand is my life, it was (Satan's) hand that was in my hand along with her hand",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5260,
			"arabicnumber": "2017.02",
			"text": "Hudhaifa b. al-Yaman reported:When we were invited to a dinner with Allah's Messenger (ﷺ) ; the rest of hadith is the same but there is a slight variation of wording (and the variation is) that in that hadith the desert Arab precedes the arrival of that girl, and at the conclusion there is an addition (to this effect):\" He (the Holy Prophet) then mentioned the name of Allah and ate",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5261,
			"arabicnumber": "2017.03",
			"text": "This hadith is reported on the authority of A'mash with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5262,
			"arabicnumber": "2018.01",
			"text": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) as saying:When a person enters his house and mentions the name of Allah at the time of entering it and while eating the food, Satan says (addressing himself: You have no place to spend the night and no evening meal; but when he enters without mentioning the name of Allah, the Satan says: You have found a place to spend the night, and when he does not mention the name of Allah while eating food, he (the Satan) says: You have found a place to spend the night and evening meal",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5263,
			"arabicnumber": "2018.02",
			"text": "This hadith has been narrated on the authority of Jabir b. Abdullah through the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5264,
			"arabicnumber": "2019",
			"text": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) having said:Do not eat with your left hand, for the Satan eats with his left hand",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5265,
			"arabicnumber": "2020.01",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:When any one of you intends to eat (meal), he should eat with his right hand. and when he (intends) to drink he should drink with his right hand, for the Satan eats with his left hand and drinks with his left hand",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5266,
			"arabicnumber": "2020.02",
			"text": "This hadith is reported by Zuhri on the authority of Sufyan with a different chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5267,
			"arabicnumber": "2020.03",
			"text": "Salim, on the authority of his father, reported Allah's Messenger (ﷺ) as saying:None of you should eat with his left hand and drink with that (left hand), for the Satan eats with left hand and drinks with that (hand). Nafi' has made this addition in that:\" Do not take up anything with that (left hand) and do not give anything with that\" ; and in the narration transmitted on the authority of Abu Tahir there is a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5268,
			"arabicnumber": "2021",
			"text": "Salama b. Akwa' reported on the authority of his father that a person ate in the presence of Allah's Messenger (ﷺ) with his left hand, whereupon he said:Eat with your right hand. He said: I cannot do that, whereupon he (the Holy Prophet) said: May you not be able to do that. It was vanity that prevented him from doing it, and he could not raise it (the right hand) up to his mouth",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5269,
			"arabicnumber": "2022.01",
			"text": "Umar b. Abu Salama reported:I was under the care of Allah's Messenger (way peace be upon him), and as my hand used to roam about in the dish he said to me: Boy, mention the name of Allah, and eat with your right hand and eat from what is near to you",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5270,
			"arabicnumber": "2022.02",
			"text": "Umar b. Abu Salama reported:I (had the opportunity) one day to dine with Allah's Messenger (ﷺ), and I picked up flesh from around the dish. Thereupon Allah's Messenger (ﷺ) said: Eat from that which is near to you",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5271,
			"arabicnumber": "2023.01",
			"text": "Abu Sa'id (Khudri) reported that Allah's Messenger (ﷺ) forbade from turning the waterskins upside down and drinking from its mouth",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5272,
			"arabicnumber": "2023.02",
			"text": "Abu Sa'id Khudri reported that Allah's, Messenger (may peace he upon him) forbade from turning the waterskins upside down and drinking from their mouths",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5273,
			"arabicnumber": "2023.03",
			"text": "This hadith has been reported from Zuhri with the same chain of transmitters, but he also said that Ikhtinath means that its head (i. e., of the waterskin) be turned upside down and then (water) be drank from that",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5274,
			"arabicnumber": "2024.01",
			"text": "Anas reported Allah's Apostle (ﷺ) disapproved the drinking of water while standing",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5275,
			"arabicnumber": "2024.02",
			"text": "Anas reported that Allah's Apostle (ﷺ) forbade that a person should drink while standing. Qatada reported:We said to him: What about eating? Thereupon he (Anas) said: That is even worse and more detestable (abominable)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5276,
			"arabicnumber": "2024.03",
			"text": "This hadith is reported on the authority of Anas with a different chain of transmitters, but no mention is made of the words of Qatada",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5277,
			"arabicnumber": "2025.01",
			"text": "Abu Sa'id Khudri reported that Allah's Messenger (ﷺ) warned against drinking while standing",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5278,
			"arabicnumber": "2025.02",
			"text": "Abu Sa'id Khudri reported this hadith through another chain of transmitters but with a slight, variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5279,
			"arabicnumber": "2026",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:None of you should drink while standing; and if anyone forgets, he must vomit",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5280,
			"arabicnumber": "2027.01",
			"text": "Ibn Abbas reported:I served. (water of) Zamzam to Allah's Messenger (ﷺ), and he drank it while standing",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5281,
			"arabicnumber": "2027.02",
			"text": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) drank (water) from Zamzam in a bucket while he was standing",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5282,
			"arabicnumber": "2027.03",
			"text": "Ibn 'Abbas reported that Allah's Apostle (ﷺ) drank (water) from Zamzam while he was standing",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5283,
			"arabicnumber": "2027.04",
			"text": "Ibn 'Abbas reported:I served (water from) Zamzam to Allah's Messenger (ﷺ), and he drank while standing, and he asked for it while he was near the House (i. e. House of Allah-Ka'ba)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5284,
			"arabicnumber": "2027.05",
			"text": "This hadith is reported on the authority of Shu'ba with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5285,
			"arabicnumber": "267.04",
			"text": "Abu Qatada reported on the authority of his father that Allah's Apostle (ﷺ) forbade breathing in a vessel",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5286,
			"arabicnumber": "2028.01",
			"text": "Anas reported that Allah's Messenger (ﷺ) used to breathe three times in the course of a drink (i. e. he drank in three gulps)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5287,
			"arabicnumber": "2028.02",
			"text": "Anas reported that Allah's Messenger (ﷺ) breathed three times (outside the vessel) in the course of a drink and said:It is more thirst- quenching, healthier and more wholesome. Anas said: So I also breathe three times in the course of a drink",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5288,
			"arabicnumber": "2028.03",
			"text": "This hadith is reported on the authority of Anas with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5289,
			"arabicnumber": "2029.01",
			"text": "Anas b. Malik reported that there was brought to Allah's Messenger (ﷺ) a cup of milk mixed with water, while there was on his right a desert Arab and on his left Abu Bakr. He (the Holy Prophet) drank; he then gave it to the desert Arab and said:(Give to one) who is on the right, then again who is on the right",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5290,
			"arabicnumber": "2029.02",
			"text": "Anas reported:The Apostle of Allah (may peace he upon him) came to Medina when I was ten years old and he died when I was twenty years old. My mother exhorted me to serve him. He (the Holy Prophet) came to our house, and we ruined a flabby goat for him and mixed it (the milk) with water from the well of the house. Allah's Messenger (ﷺ) drank that. Umar and Abu Bakr on his left side said to him: Allah's Messenger, give it to Abu Bakr, but he (the Holy Prophet) gave it to the desert Arab who was on his right. Allah's Messenger (ﷺ) said: He who is on the right, then he who is on the right",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5291,
			"arabicnumber": "2029.03",
			"text": "Anas b. Malik reported:Allah's Messenger (ﷺ) came to our house and he asked for a drink. We milked a goat for him and then mixed it (the milk) with the water of this well of mine. I gave it to Allah's Messenger (ﷺ) and he drank it, while Abu Bakr was on his left and 'Umar was in front of him, and a desert Arab was on his right. When Allah's Messenger (ﷺ) had finished the drink, Umar said: Allah's Messenger, here is Abu Bakr, give him to drink; but Allah's Messenger (ﷺ) gave it to the desert Arab and he left out Abu Bakr and Umar. And Allah's Messenger (ﷺ) said: Those on the right, those on the right, those on the right (deserve preference). Anas said: This is the Sunnah, this is the Sunnah, this is the Sunnah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5292,
			"arabicnumber": "2030.01",
			"text": "Sahl b. Sa'd Sa'idi reported that Allah's Messenger (ﷺ) was given a drink, and he drank from that, and there was on his right side a boy. and on his left some old men. He said to the boy:Do you permit me to give it to them (the old men), but that boy said: by God. I will not give preference at your hand over me in my share. He (the narrator) said that Allah's Messenger (ﷺ) then gave it in his hand",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5293,
			"arabicnumber": "2030.02",
			"text": "This hadith is reported on the authority of Sahl b. Sa'd with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5294,
			"arabicnumber": "2031.01",
			"text": "Ibn 'Abbas reported Allah's Messenger (may peace be upon him.) as saying:When any one of you eats food he should not wipe his hand until he has licked it or has it licked",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5295,
			"arabicnumber": "2031.02",
			"text": "Ibn 'Abbas reported Allah's Messenger (ﷺ) as saying:When any one of you eats food he should not wipe his hand until he has licked it or have it licked",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5296,
			"arabicnumber": "2032.01",
			"text": "Ibn Ka'b b. Malik reported on the authority of his father that he saw Allah's Messenger (ﷺ) licking his three fingers (after having finished the food). Ibn Hatim made no mention of\" three\". This hadith is also narrated through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5297,
			"arabicnumber": "2032.02",
			"text": "Ibn Ka'b b. Malik reported on the authority of his father that the Messenger of Allah (ﷺ) used to eat (food) with three fingers and he licked his hand before wiping it (with towel)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5298,
			"arabicnumber": "2032.03",
			"text": "Abdullah b. Ka'b reported that his father Ka'b narrated to him that Allah's Messenger (ﷺ) used to eat with three fingers and when he had finished (eating), he licked them",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5299,
			"arabicnumber": "2032.04",
			"text": "A hadith like this has been reported on the authority of Ka'b b. Malik through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5300,
			"arabicnumber": "2033.01",
			"text": "Jabir reported that Allah's Messenger (ﷺ) commanded the licking of fingers and the dish, saying:You do not know in what portion the blessing lies",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5301,
			"arabicnumber": "2033.02",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:When any one of you drops a mouthful he should pick it up and remove any of the filth on it, and then eat it, and should not leave it for the Satan, and should not wipe his hand with towel until he has licked his fingers, for he does not know in what portion of the food the blessing lies",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5302,
			"arabicnumber": "2033.03",
			"text": "This hadith has been narrated on the authority of Sufyan with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5303,
			"arabicnumber": "2033.04",
			"text": "Jabir reported:I heard Allah's Apostle (ﷺ) as saying: The Satan is present with any one of you in everything he does; he is present even when he eats food; so if any one of you drops a mouthful he should remove away anything filthy on it and eat it and not leave for the devil; and when he finishes (food) he should lick his fingers, for he does not know in what portion of his food the blessing lies",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5304,
			"arabicnumber": "2033.05",
			"text": "This hadith is reported on the authority of A'mash with the same chain of transmitters but with a slight variation of words but no mention is made of the first part of the hadith, i. e. the Satan is present with any one of you",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 5305,
			"arabicnumber": "2033.06",
			"text": "Jabir reported from Allah's Messenger. (ﷺ) about mentioning the licking (of fingers) and the (falling of) the mouthful",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5306,
			"arabicnumber": "2034",
			"text": "Anas reported that when Allah's Messenger (ﷺ) ate food he licked his three fingers, and he said:When any one of you drops a mouthful he should remove anything filthy from it and then eat it, and should not leave it for the Satan. He also commanded us that we should wipe the dish saying: You do not know in what portion of your food the blessing lies",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5307,
			"arabicnumber": "2035.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When any one of you eats food he should lick his fingers, for he does not know in what part of the food sticking to his fingers the blessing lies",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5308,
			"arabicnumber": "2035.02",
			"text": "This hadith has been reported on the authority of Hammad with the same chain of transmitters, but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5309,
			"arabicnumber": "2036.01",
			"text": "Abu Mas'ud Ansari reported that a person from the Ansar who was called Abu Shu'aib had a slave who was a butcher (by profession). He (Abu Mas'ud) saw Allah's Messenger (ﷺ) and found signs of hunger on his face. He said to the servant:0 ye, prepare for us food sufficient for five persons, for I intend to invite Allah's Apostle (ﷺ) who would be the fifth amongst the five. He (the narrator) reported that he then prepared the food and came to Allah's Apostle (ﷺ) and invited all the five (including him) who was the fifth amongst them to the feast. A man followed him and when Allah's Apostle (ﷺ) reached the door, he said: This man has followed us; if you like you may permit him (to join the meal) and if you like he can go back. Thereupon the person said: Allah's Messenger, I permit him",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5310,
			"arabicnumber": "2036.02",
			"text": "This hadith has been reported on the authority of Abu Mas'ud Ansari through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5311,
			"arabicnumber": "2036.03",
			"text": "This hadith has been transmitted on the authority of Jabir also",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5312,
			"arabicnumber": "2037",
			"text": "Anas reported that:Allah's Messenger (ﷺ) had a Persian neighbour who made excellent soup. He prepared some for Allah's Messenger (ﷺ) and then came to him to invite him to eat. He (Allah's Messenger) said, \"and her too,\" referring to `Aisha. The man said \"No,\" so Allah's Messenger (ﷺ) then said \"No.\" He returned later to invite him again, so Allah's Messenger (ﷺ) said \"and her too.\" The man said \"No,\" so Allah's Messenger (ﷺ) then said \"No.\" He returned another time to invite him and Allah's Messenger (ﷺ) said, \"and her too.\" The man said yes on this third occasion, and they then stood eagerly to go out together to the man's home",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5313,
			"arabicnumber": "2038.01",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) went out (of his house) one day or one night, and there he found Abu Bakr and 'Umar also. He said:What has brought you out of your houses at this hour? They said: Allah's Messenger, it is hunger. Thereupon he said: By Him in Whose Hand is my life, what has brought you out has brought me out too; get up. They got up along with him. and (all of them) came to the house of an Ansari, but he was not at home. When his wife saw him she said: Most welcome, and Allah's Messenger (may peace be Upon him) said to her: Where is so and so? She said: He has gone to get some fresh water for us. When the Ansari came and he saw Allah's Messenger (ﷺ) and his two Companions, he said: Praise be to Allah, no one has more honourable guests today than I (have). He then went out and brought them a bunch of ripe dates, dry dates and fresh dates, and said: Eat some of them. He then took hold of his long knife (for slaughtering a goat or a sheep). Allah's Messenger (ﷺ) said to him: Beware of killing a milch animal. He slaughtered a sheep for them and after they had eaten of it and of the bunch and drank, and when they had taken their fill and had been fully satisfied with the drink, Allah's Messenger (ﷺ) said to Abu Bakr and Umar: By Him in Whose Hand is my life, you will certainly be questioned about this bounty on the Day of judgment. Hunger brought you out of your house, then you did not return until this bounty came to you",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5314,
			"arabicnumber": "2038.02",
			"text": "Abu Huraira reported:One day while Abu Bakr was sitting and there was with him Umar also there came to them Allah's Messenger (ﷺ) and he said: What makes you stay here? They said: It is hunger that has brought us out from our houses. By Him Who has stint you with Truth; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5315,
			"arabicnumber": "2039",
			"text": "Jabir b. 'Abdullah reported:When the ditch was dug, I saw Allah's Messenger (may peace he upon him) feeling very hungry. I came to my wife and said to her: Is there anything with you? I have seen Allah's Messenger (ﷺ) feeling extremely hungry. She brought out a bag of provisions which contained a sa', of barley. We had also with us a lamb. I slaughtered it. She ground the flour. She finished (this work) along with me. I cut it into pieces and put it in the earthen pot and then returned to Allah's Apostle (ﷺ) (for inviting him). She said: Do not humiliate me in the presence of Allah's Messenger (ﷺ) and those who are with him. When I came to him I whispered to him saying: Allah's Messenger, we have slaughtered a lamb for you and she has ground a sa' of barley which we had with us. So you come along with a group of people with you. Thereupon Allah's Messenger (ﷺ) said loudly: O people of the ditch, Jabir has arranged a feast for you, so (come along). Allah's Messenger (ﷺ) said: Do not remove your earthen pot from the hearth and do not bake the bread from the kneaded flour until I come. So I came and Allah's Messenger (ﷺ) came and he was ahead of the people; and I came to my wife and she said (to me): You will be humbled. I said: I did what you had asked me to do. She (his wife) said: I brought out the kneaded flour and Allah's Messenger (ﷺ) put some saliva of his in that and blessed It. He then put saliva in the earthen pot and blessed it and then said. Call another baker who can bake with you. and bring out the soup from it, but do not remove it from the hearth, and the guests were one thousand. (Jabir said): I take an oath by Allah that all of them ate (the food to their fill) until they left it and went away and our earthen pot was brimming over as before, and so was the case with our flour, or as Dahhak (another narrator) said: It (the flour) was in the same condition and loaves had been prepared from that",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5316,
			"arabicnumber": "2040.01",
			"text": "Anas b. Malik reported that Abu Talha said to Umm Sulaim:I felt some feebleness in the voice of Allah's Messenger (ﷺ) and perceived that it was due to hunger; so have you anything with you? She said: Yes. She brought out barley loaves, then took out a head-covering of hers, in a part of which she wrapped those loaves and then put them beneath my mantle and covered me with a part of it. She then sent me to Allah's Messenger (ﷺ). I set forth and found Allah's Messenger (ﷺ) sitting in the mosque in the company of some persons. I stood near them, whereupon Allah's Messenger (ﷺ) said: Has Abu Talha sent you? I said, Yes. He said: Is it for a feast? I said. Yes. Thereupon Allah's messenger (ﷺ) said to'those who were with him to get up He went forth and so I did before them, until I came to Abu Talha and informed him. Abu Talba said: Umm Sulaim, here comes Allah's Messenger (ﷺ) along with people and we do not have enough (food) to feed them. She said: Allah and His Messenger know best. Abu Talha went out (to receive him) Until he met Allah's Messenger (ﷺ) and Allah's Apostle (ﷺ) came forward along with him until they both (Allah's Messenger, along with Abu Talha) came in. Then Allah's Messenger (ﷺ) said: Umm Sulaim. bring forth that which you have with you. She brought the bread. Allah's Messenger (ﷺ) commanded that the bread be broken into small pieces, and when Umm Sulaim had squeezed a small waterskin and put seasoning on it, Allah's Messenger (ﷺ) recited something regarding it what Allah wished him to say. He then said: Allow ten (guests to come in and have their meals). He permitted them; they ate until they had their fill. They then went out. He (the Holy Prophet) again said: Permit ten (more) and he (the host gave permission to them. They ate until they had enough. Then they went out. he again said: Permit ten (more) until all the people had eaten to their fill, and they were seventy or eighty persons",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5317,
			"arabicnumber": "2040.02",
			"text": "Anas b. Malik reported:Abu Talha sent me to Allah's Messenger (ﷺ) in order to invite him (for meal). She had prepared a meal. So I came and found Allah's Messenger (ﷺ) along with some people. He looked at me, and I felt shy and said: Accept the invitation of Abu Talha. He (the Holy Prophet) asked the people to get up. Thereupon Abu Talha said: Allah's Messenger, I have prepared something for you. Allah's Messenger (ﷺ) touched (the food) and invoked blessings upon it, and then said: Let ten persons from my Companions enter (the house). He then said: Eat, and (in the meanwhile) brought out something from between his fingers for them. They then began to eat until they had their fill and then went out. He then asked ten more men (to have the meal) and they ate to their fill, and the ten persons went on getting in (and eating the food) and then getting out until none was left amongst them who had not got in and eaten to his fill. He then collected (the remaining part of the food) and it (the quantity of the food) was the same (as it had been prior to the serving of guests)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5318,
			"arabicnumber": "2040.03",
			"text": "Anas b Malik reported:Abu Talha sent me to Allah's Messenger (ﷺ) ; the rest of the hadith is the same, but 'there is a slight variation of wording that he said at the end (The Holy Prophet) took what was left (of the food) and collected it and then invoked blessings upon it and it returned to its original state. He (the Holy Prophet) then said Take this",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5319,
			"arabicnumber": "2040.04",
			"text": "Anas b. Malik reported:Abu Talha ordered Umm Sulaim to prepare a meal specially for Allah's Apostle (ﷺ). He then sent me to him (to the Holy Prophet) ; the rest of the hadith is the same (but there is a slight variation of wording):\" Allah's Messenger (ﷺ) placed his hand and mentioned the name of Allah upon that, and then said: Admit ten men. He (Abu Talha) admitted them and they got in. He (the Holy Prophet) said: Eat while mentioning the name of Allah upon it (the meal). They ate until eighty persons had taken the food. Then Allah's Apostle (ﷺ) had his meal and so the members of the household, and still they left some food",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5320,
			"arabicnumber": "2040.05",
			"text": "Anas b. Malik reported this incident pertaining to the feast given by Abu Talha to Allah's Apostle (ﷺ) with the addition of these words:\" Abu Talha stood at the door (to welcome the honourable guest) until Allah's Messenger (may peacec be upon him) came there, He (Abu Talha) said to him: Allah's Messenger, the thing (we intend to offer you as a meal) is small in quantity. Thereupon he (the Holy Prophet) said: Bring that, for Allah will soon bless it (and increase it)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5321,
			"arabicnumber": "2040.06",
			"text": "Anas b. Malik reported this hadith (with a slight variation of wording) Then AlIah's Messenger (ﷺ) ate and the people of his house also ate. but (still) there was left a surplus, which they sent to their neighbours",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5322,
			"arabicnumber": "2040.07",
			"text": "Anas b. Malik reported:Abu Talha saw Allah's Messenger (ﷺ) lying down upon his belly in the mosque. He came to Umm Sulaim and said: I saw Allah's Messenger (ﷺ) lying down upon the belly in the mosque, and I think he is hungry. The rest of the hadith is the same (but with the addition of these words) that Allah's messenger (ﷺ) ate (the food) and so did Abu Talha, Umm Sulaim and Anas b. Malik, but there was left some. thing which we presented to our neighbours",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5323,
			"arabicnumber": "2040.08",
			"text": "Anas b. Malik reported:I visited Allah's Messenger (ﷺ) one day and found him sitting in the company of his Companions and talking to them, and he had tied his belly with a bandage. Usama said: I am in doubt whether there was stone on that (his belly) or not. I asked some of his Companions why Allah's Messenger (ﷺ) had bandaged his belly. They said: (He has done that to relieve) his hunger. I went to Abu Talha, the husband of Umm Sulaim, the daughter of Milhan, and said to him: Father, I saw Allah's Messenger (ﷺ) having bandaged his belly. I asked some of his Companions (the reason of it) and they said that it was due to hunger. Abu Talha came to mv mother and said: Is there anything? She said: Yes, I have some pieces of bread with me and some dates. If Allah's Messenger (ﷺ) comes to us alone we can feed him to his fill, but if someone comes along with him this would be insufficient for them. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5324,
			"arabicnumber": "2040.09",
			"text": "Anas b. Malik reported this hadith pertaining to the entertainment of Allah's Messenger (ﷺ) by Abu Talha through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5325,
			"arabicnumber": "2041.01",
			"text": "Anas b. Malik reported:A tailor invited Allah's Messenger (ﷺ) to a meal which he had prepared. Anas b. Malik said: I went along with Allah's Messenger (ﷺ) to that feast. He presented to Allah's Messenger (ﷺ) barley bread and soup containing pumpkin, and sliced pieces of meat. Anas said: I saw Allah's Messenger (ﷺ) going after the pumpkin round the dish, so I have always liked the pumpkin since that day",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5326,
			"arabicnumber": "2041.02",
			"text": "Anas b. Malik reported that a person invited Allah's Messenger (ﷺ) to a meal. I also went along with him. He brought soup containing pumpkin. Allah's 'messenger (ﷺ) ate that pumpkin with relish. He (Anas) said:When I saw that I began to place it before him, and did not eat it (myself). Anas said: It was since then that pumpkin was always my favourite (food)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5327,
			"arabicnumber": "2041.03",
			"text": "Anas b. Malik rdported that a tailor invited Allah's Messenger (ﷺ) to a feast. There has been an addition to this that Thabit said:I heard Anas saying that any meal that was prepared for me after that I tried that it should contain pumpkin",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5328,
			"arabicnumber": "2042.01",
			"text": "Abdullah b. Busr reported:Allah's Messenger (ﷺ) came to my father and we brought to him a meal and a preparation from dates, cheese and butter. He ate out of that. He was then given dates which he ate, putting the stones between his fingers and holding his forefinger and middle finger together\" - Shu'bah said: \"I think we learn from this that one may hold the date stones between two fingers, In shaAllah.\" Then a drink was brought for him and he drank it, and then gave it to one who was on his right side. He (the narrator) said: My father took hold of the rein of his riding animal and requested him to supplicate for us. Thereupon he said: O Allah. bless them in what You have provided them as a sustenance; and forgive them and have mercy upon them",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5329,
			"arabicnumber": "2042.02",
			"text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters and they did not doubt about keeping the dates between his fingers (as is expressed in the previous hadith)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5330,
			"arabicnumber": "2043",
			"text": "Abdullah b. Ja'far reported:I saw Allah's Messenger (ﷺ) eating cucumber with fresh dates",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5331,
			"arabicnumber": "2044.01",
			"text": "Anas b. Malik reported:I saw Allah's Apostle (ﷺ) squatting and eating dates",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5332,
			"arabicnumber": "2044.02",
			"text": "Anas reported that there were brought to Allah's Messenger (ﷺ) dates. He distributed them in the state that he had been sitting upright (in an easy posture) and he had also been eating them a (bit) quickly",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5333,
			"arabicnumber": "2045.01",
			"text": "Jabala b. Suhaim reported:Ibn Zubair used to provide us with dates during the time that the people were hard pressed because of famine (Once) as we were busy in eating there happened to appear before us Ibn 'Umar. He said: Don't eat two dates together, for Allah's Messenger (ﷺ) forbade eating them together but only after seeking permission from his brother (partner). Shu'ba said: I do not think these words pertaining to seeking permission but from the words of Ibn 'Umar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5334,
			"arabicnumber": "2045.02",
			"text": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters but these words of his (are not found):\" The people were hard pressed because of the famine during those days",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5335,
			"arabicnumber": "2045.03",
			"text": "Jabala b. Suhaim reported:I heard Ibn 'Umar as saying that Allah's Messenger (ﷺ) forbade anyone taking two dates together without seeking the consent of his companions",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5336,
			"arabicnumber": "2046.01",
			"text": "A'isha reported Allah's Messenger (ﷺ) as saying:A family which has dates will not be hungry",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5337,
			"arabicnumber": "2046.02",
			"text": "A'isha reported Allah's Messenger (ﷺ) as saying:'A'isha a family which has no dates (in their house) its members will be hungry; (or) 'A'isha the family which has no dates its members may be hungry. He said this twice or thrice",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5338,
			"arabicnumber": "2047.01",
			"text": "Amir b. Sa'd b. Abu Waqqas, on the authority of his father, reported Allah's Messenger (ﷺ) having said:He who ate seven dates (of the land situated) between these two lava plains in the morning, no poison will harm him until it is evening",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 5339,
			"arabicnumber": "2047.02",
			"text": "Amir b. Sa'd b. Abu Waqqas reported Allah's Messenger (ﷺ) as saying:He who ate seven 'ajwa' dates in the morning, poison and magic will not harm him on that day",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 5340,
			"arabicnumber": "2047.03",
			"text": "This hadith has been reported on the authority of Ibn Hashim with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 5341,
			"arabicnumber": "2048",
			"text": "A'isha reported Allah's Messenger (ﷺ) as saying:The 'ajwa' dates of 'Aliya' contain healing effects and these are antidote in the early morning",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 5342,
			"arabicnumber": "2049.01",
			"text": "Sa'id b. Zaid b. 'Amr b. Nufail reported:I heard Allah's Apostle (ﷺ) as saying: Truffles are a kind of 'Manna' and their juice is a medicine for the eyes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 5343,
			"arabicnumber": "2049.02",
			"text": "Through another chain of transmitters, Sa'id b. Zaid b. 'Amr reported:I heard Allah's Apostle (ﷺ) as saying: Truffles are a kind of 'Manna' and their juice is a medicine for the eyes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 5344,
			"arabicnumber": "2049.03",
			"text": "Sa'id b. Zaid reported:I heard Allah's Messenger (ﷺ) as saying: Truffles are a kind of blessing and their juice is a medicine for the eyes. Shu'ba said: When Hakam narrated this hadith to me, I did not deem it as a Munkar hadith because of the narration of Abd al-Malik",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 5345,
			"arabicnumber": "2049.04",
			"text": "Sa'id b. Zaid b. 'Amr b. Nufail reported Allah's Messenger (ﷺ) as saying:Truffles are a kind of 'Manna' which Allah the Glorious and Exalted, sent down upon the people of Israil, and its juice is a medicine for the eyes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 5346,
			"arabicnumber": "2049.05",
			"text": "Sa'id b. Zaid reported Allal a Messenger (ﷺ) as saying:Truffles are a kind of 'Manna' which Allah sent down upon Moses and their juice is a medicine for the eyes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 5347,
			"arabicnumber": "2049.06",
			"text": "Sa'id b. Zaid reported Allah's Messenger (ﷺ) as saying:Truffles are 'Manna' which Allah, the Exalted the Majestic, sent to the people of Israil, and its juice is a medicine for the eyes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 5348,
			"arabicnumber": "2049.07",
			"text": "Sa'id b. Zaid reported Allah's Messenger (ﷺ) as saying:Truffles are 'Manna' and its juice is the medicine for the eyes",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 5349,
			"arabicnumber": "2050",
			"text": "Jabir b. Abdullah reported:We were with the Messenger of Allah (ﷺ) at Marr az-Zahran, and we were plucking the fruit of the Arak tree, whereupon Allah's Messenger (may peace he upon him) said: Pluck only its black ones (for they are the most pleasant). We said: Allah's Messenger, it seems you shepherded the flock. He said: Yes. Has there been a prophet who did not shepherd it (or some words like it)?",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 5350,
			"arabicnumber": "2051.01",
			"text": "A'isha reported Allah's Apostle (ﷺ) as saying:The best of condiments or condiment is vinegar",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 5351,
			"arabicnumber": "2051.02",
			"text": "This hadith has been reported on the authority of Sulaiman b. Bilal with the same chain of transmitters and he is reported to have said:\" The best condiment.\" And he did not doubt (about this word)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 5352,
			"arabicnumber": "2052.01",
			"text": "Jabir b. 'Abdullah reported that Allah's Apostle (ﷺ) asked his family for condiment. They (the members of his household) said:We have nothing with us but vinegar. He asked for it, he began to eat it, and then said: Vinegar is a good condiment, vinegar is a good condiment",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 5353,
			"arabicnumber": "2052.02",
			"text": "Jabir b. 'Abdullah reported:Allah's Messenger (ﷺ) took hold of my hand one day (and led me) to his residence. There was presented to him some pieces of bread, whereupon he said: Is there no condiment? They (the members of his household) said: No, except some vinegar. He (the Holy Prophet) said: Vinegar is a good condiment. Jabir said: I have always loved vinegar since I heard it trom Allah's Apostle (ﷺ). Talha said: I have always loved vinegar since I heard about it from Jabir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 5354,
			"arabicnumber": "2052.03",
			"text": "This hadith is reported on the authority of Jabir b. 'Abdullah that Allah's Messenger (ﷺ) took hold of his hand and led him to his residence as narrated above up to the words:\" Vinegar is a good condiment.\" But in the hadith transmitted through this chain of transmitters, there is no mention of the subsequent part",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 5355,
			"arabicnumber": "2052.04",
			"text": "Jabir b. 'Abdullah reported:While I was sitting in my house there happened to pass by me Allah's Messenger (ﷺ). He made a gesture to me and I stood up for him. He took hold of my hand until we came to one of the apartments of his wives. He entered and then asked me to get in. So I entered and there was hanging a curtain beside her. He (the Holy Prophet) said: Is there any food (with you)? They (the members of the household) said: Yes And then there were brought three loaves of bread for him (the Holy Prophet) and placed in the basket of palm leaves. Allah's Messenger (ﷺ) picked up one loaf and placed that before him, and then picked up another one and placed it before me. He then picked up the third one and broke it into two parts, and kept the one-half before him and the other half before me, and then said: Is there any condiment? They (the members of the household) said: There is nothing (in the form of condiment) but some vinegar only. He said: Bring that, for vinegar is a good condiment",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 5356,
			"arabicnumber": "2053.01",
			"text": "Abd Ayydb Ansari reported that when food was brought to Allah's Messenger (ﷺ) he ate out of that, and sent the remaining part to me, and one day he sent to me the left-over; (I found that he) had not taken from it at all for it included garlic. I asked him whether that was forbidden, whereupon he said:No, but I do not like it because of its odour. He (Abu Ayyub Ansiri) said: Then I also do not like what you do not like",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 5357,
			"arabicnumber": "2053.02",
			"text": "This Hadith is narrated on the authority of Shu'ba with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 5358,
			"arabicnumber": "2053.03",
			"text": "Aflah, the freed slave of Abu Ayyub Ansiri, reported:Allah's Messnger (ﷺ) had alighted in his house (viz. of Abu Ayyub Ansari at the time of his emigration to Medina) and he occupied the lower storey, whereas Abu Ayyub Ansari lived in the upper storey. One night, Abu Ayyub Ansari got up and said (to himself): (How unfortunate it is) that we walk above the head of Allah's Messenger (ﷺ), so they went aside and spent the night in a nook and then told Allah's Apostle (ﷺ) about it whereupon Allah's Apostle (ﷺ) said: The lower storey is more comfortable (for me). but he (Abu Ayyub Ansari) said: We (would not live) over the roof under which you live. So Allah's Messenger (ﷺ) shifted to the upper storey, whereas Abu Ayyub Ansari shifted to the lower storey; and he (Abu Ayyub Ansari) used to prepare food for Allah's Apostle (ﷺ) ; and when it was brought (back) to him he asked (to locate) the part, where his fingers had touched (the food), and he followed his fingers on that part where his fingers (those of the Holy Prophet) had touched it. (One day) he prepared food which contained garlic, and when it was returned to him he asked (to locate) the part which the fingers of Allah's Apostle (ﷺ) had touched. It was said to him that he had not eaten (the food). He (Abd Ayyub Ansari) was distressed and went up to him (to the Holy Prophet) and said: Is it forbidden? But Allah's Messenger (ﷺ) said: No, (it is not forbidden), but I do not like it. and he (Abu Ayyub Ansari) said: I also do not like what you do not like or which you did not like. He (Abu Ayyub Ansari) said: (The Prophet did not eat garlic) as Allah's Apostle (ﷺ) was visited (by angels) and brought him the message of Allah",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 5359,
			"arabicnumber": "2054.01",
			"text": "Abu Huraira reported that a person came to Allah's Messenger (ﷺ) and said:I am hard pressed by hunger. He sent (message) to one of his wives (to procure food for him). but she said: By Him Who has sent you with Truth, thrre is nothing with me (to serve him) but only water. He (the Holy Prophet) then sent the (same) message to another, and she gave the same reply, until all of them gave the same reply: By Him Who has sent thee with the Truth, there is nothing with me but only water, whereupon he (the Holy Prophet) said: Allah would show mercy to him who will entertain this guest tonight. A person from the Ansar stood up and said: Messenger of Allah, I (am ready to entertain). He took him to his house and said to his wife: Is there anything with you (to serve the gdest)? She said: No, but only a subsistence for our children. He said: Distract their attention with something, and when the guest enters extinguish the lamp and give him the impression that we are eating. So they sat down. and the guest had his meal. When it was morning he went to Allah's Apostle (ﷺ) who said: Allah was well pleased with what you both did for your guest this night",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 5360,
			"arabicnumber": "2054.02",
			"text": "Abu Huraira reported that a guest spent the night with a person from the Ansar who had nothing with him but food (sufficient) for his own self and his children. He said to his wife:(Lull) the children to sleep, and put out the lamp, and serve the guest with what you have with you. It was on this occasion that this verse was revealed:\" Those who prefer the needy to their own selves in spite of the fact that they are themselves in pressing need\" (Lix. 9)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 5361,
			"arabicnumber": "2054.03",
			"text": "Abu Huraira reported that a man came to Allah's Messenger (ﷺ) so that he should entertain him as a guest, but he had nothing with which he could entertain him. He, therefore, asked if there was any person who would entertain him (assuring the audience) that Allah would show mercy to him. A person from the Ansar who was called Abu Talha stood up and he took him to his house. The rest of the hadith is the same and mention is (also) made in that about the revelation of the verse as narrated by Waki",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "Miqdad reported:I and two of my companions were so much afflicted by hunger that we had lost our power of seeing and hearing. We presented ourselves (as guests) to the Companions of the Prophet (ﷺ), but none amongst them would entertain us. So we came to Allah's Apostle (ﷺ), and he took us to his residence and there were three goats. Allah's Apostle (ﷺ) said: Milk these for us. So we milked them and every person amongst us drank his share and we set aside the share of Allah's Apostle (ﷺ). (It was his habit) to come during the night and greet (the people present there) in a manner that would not wake up one in sleep but make one who was awake hear it. He would then go to the mosque and say prayer, then go to the milk and drink it. Miqdad added: One night the Satan came to me when I had taken my share, and he said: Muhammad has gone to the Ansar, who would offer him hospitality and he would get what is with them, and he has no need for this draught (of milk). So I took (that milk) and drank it, and when it had penetrated deeply in my stomach and I was certain that there was no way out (but to digest it), the Satan aroused (my sense of) remorse and said: Woe be to thee! what have you done? You have taken the drink reserved for Muhammad! When he would come and he would not find it, he would curse you, and you would be ruined, and thus there would go (waste) this world and the Hereafter (for) you. There was a sheet over me; as I placed (pulled) it upon my feet, my head was uncovered and as I placed it upon my head, my feet were uncovered, and I could not sleep, but my two companions had gone to sleep for they had not done what I had done. There came Allah's Apostle (ﷺ), and he greeted as he used to greet (by saying as-Salamu 'Alaikum). He then came to the mosque and observed prayer and then came to his drink (milk) and uncovered it, but did not find anything in it. He raised his head towards the sky, and I said (to myself) that he (the Holy Prophet) was going to invoke curse upon me and I would be thus ruined; but he (the Holy Prophet) said: Allah, feed him who fed me and give drink to him who provided me drink. I held tight the sheet upon myself (and when he had supplicated), I took hold of the knife and went to the goats (possessed by the Holy Prophet) so that I may slauhter one for Allah's Messenger (ﷺ) which was the fattest amongst them, and in fact all of them were milch goats; then I took hold of the vessel which belonged to the family of Allah's Messenger (ﷺ) in which they used to milk and drink therefrom, and milked them in that until it swelled up with foam. I came to Allah's Messenger (ﷺ) and he said: Have you taken your share of the milk during the night? I said: Drink it. and he drank it; he then handed over (the vessel) to me and I said: Allah's Messenger, drink it, and he drank it and handed over (the vessel) to me again, I then perceived that Allah's Apostle (ﷺ) had been satiated and I had got his blessings. I burst into laughter (so much) so that I fell upon the ground, whereupon Allah's Messenger (ﷺ) said: Miqdad, it must be one of your mischiefs. I said: Allah's Messenger, this affair of mind is like this and this. and I have done so. Thereupon. Allah's Apostle (ﷺ) said: This is nothing but a mercy from Allah. Why is it that you did not give me an opportunity so that we should have awakened our two friends and they would have got their share (of the milk)? I said: By Him Who has sent you with Truth. I do not mind whatever you give (to them), and whatever the (other) people happen to get, when I had got it along with you from among the people",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 5363,
			"arabicnumber": "2055.02",
			"text": "This hadith has been reported on the authority of Mughira with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 5364,
			"arabicnumber": "2056",
			"text": "Abd al-Rahman b. Abu Bakr reported:We were one hundred and thirty (persons) with Allah's Apostle (ﷺ). Allah's Apostle (ﷺ) said: Does any one of You possess food? There was a person with (us) who had a sa' of flour or something about that, and it was kneaded. Then a tall polytheist with dishevelled hair came driving his flock of sheep. Thereupon Allah's Apostle (ﷺ) said: Would you like to sell it (any one of these goats) or offer it as a gift or a present? He said: No, (I am not prepared to offer as a gift), but I would sell it. He (the Holy Prophet) bought a sheep from him, and it was slaughtered and its meat was prepared, and Allah's Messenger (ﷺ) commanded that its liver should be roasted. He (the narrator) said: By Allah, none among one hundred and thirty persons was left whom Allah's Messenger (ﷺ) had not given a part out of her liver; if anyone was present he gave it to him. but if he was absent it was set aside for him. And he (the Holy Prophet) filled two bowls (one with soup and the other with mutton) and we all ate out of them to our hearts' content, but (still) some part was (left) in (those) two bowls, and I placed it on the camel- (or words to the same effect)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 5365,
			"arabicnumber": "2057.01",
			"text": "Abd al-Rabman b. Abu Bakr reported that the people of Suffa were very poor. Once the Messenger of Allah (ﷺ) said (to his Companions):He who amongst you has food for two persons should take three (guests with him). and he who has with him food for four persons should take five or six (guests with him for entertaining them). It was (in accordance with these instructions of the Holy Prophet) that Abu Bakr brought three persons, and the Messenger of Allah (ﷺ) brought ten persons (as guests to their respective houses). Abu Bakr had brought three persons (he himself, and myself), my father and my mother (along with therm). He (the narrator) said: I do not know whether he also said: My wife and one servant who was common between our house and that of Abu Bakr. Abu Bakr had had his evening meal with Allah's Apostle (ﷺ). He stayed here until night prayer had been offered. He then came back (to the house of Allah's Apostle) and stayed there until Allah's Messenger (ﷺ) felt drowsy and (Abu Bakr) then came (back to his own house) when (a considerable) part of the night had been over, as Allah had desired. His wife said to him: What held you back from your guests? He said: Oh! have you not served them the evening meal (by this time)? She said: It was in fact served to them. but they refused to eat until you came. He ('Abd al-Rahman) said: I slunk away and bid myself. He (Abu Bakr) said: O, you stupid fellow, and he reprimanded me, and said to the guests: Eat, though it may not be pleasant now. He said: By Allah. I will never eat it He ('Abd al-Rahman) said: By Allah. we did not take a morsel when from beneath that (there appeared) more until they had eaten to their fill, and lo! it was more than what it was before. Abu Bakr saw that and found that it was so or more than that. He said to his wife: Sister of Band Firis, what is th-is? She said: By the coolness of my eyes. it is in excess by three times over the previous one. Then Abu Bakr ate saying: That was from the Satan (viz. his vow for not eating the food). He then took a morsel out of that and then took it (the rest) to the Messenger of Allah (ﷺ), and it was kept there until morning, and during (those days) there was a covenant between us and some other people, and the period of covenant was over, and we had appointed twelve officials with every person amongst them. It is Allah only Who knows as to how many people were there with each of them. He sent (this food to them) and all of them ate out of it",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 5366,
			"arabicnumber": "2057.02",
			"text": "Abd al-Rahman b. Abd Bakr reported:There came to our house some guests. It was a common practice with my father to (go) and talk to Allah's Messenger (ﷺ) during the night. While going he said: 'Abd al-Rahman, entertain the guests. When it was evening we served the food to them, but they refused saying: So long as the owner of the house does not come and join us, we would not take the meal. I said to them: He ('Abd Bakr) is a stern person, and if you would not do that (if you do not take the food). I fear, I may be harmed by him, but they refused. As he (my father) came, the first thing he asked was: Have you served the guests? They (the peopleof the household) said: We have not served them sofar. He said: Did I not command 'Abd al-Rahman (to do this)? He ('Abd al-Rahman) said: I slunk away and kept myself away by that time. He again said: O stupid fellow, I ask you on oath that In case you hear my voice you come to me. I came and said: By Allah, there is no fault of mine. These are your guests; you may ask them. I provided them with food but they refused to eat until you came. He said to them: Why is it that you did not accept our food? By Allah, I shall not even take food tonight (as you have not taken). They said: By Allah, we would not take until you join us. Thereupon he Abu Bakr) said: I have never seen a more unfortunate night than this. Woe be to thee! that you do not accept from us food prepared for you. He again said: What I did first (that is the taking of vow for not eating the food) was prompted by the Satan. Bring the food. The food was brought, and he ate by reciting the name of Allah and they also ate, and when it was morning he came to Allah's Apostle (ﷺ) and said: Allah's Messenger, their oath (that of the guests) came to be true, but mine was not true, and after that he informed him of the whole incident. He said: Your oath came to be the most true and you are the best of them. He (the narrator) said. I do not know whether he made an atonement for it",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 5367,
			"arabicnumber": "2058",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Food for two persons suffices three persons and food for three persons suffices four persons",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 5368,
			"arabicnumber": "2059.01",
			"text": "Jabir b. 'Abdullah reported:I heard Allah'. s Messenger (ﷺ) as saying: Food for one person suffices two persons and food for two persons suffices four persons, and food for four persons suffices eight persons; and in the tradition transmitted on the authority of Ishaq there is no mention of the fact that he heard it directly (from the Holy Prophet)",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 5369,
			"arabicnumber": "2059.02",
			"text": "A hadith like this is reported on the authority of Jabir but with a different chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 5370,
			"arabicnumber": "2059.03",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:Food for one suffices two and food for two suffices for four",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 5371,
			"arabicnumber": "2059.04",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:Food for one (person) suffices two, and food for two (persons) suffices four persons and food for four persons suffices eight persons",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 5372,
			"arabicnumber": "2060.01",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying that a non-Muslim eats in seven intestines whereas a Muslim eats in one intestine",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 5373,
			"arabicnumber": "2060.02",
			"text": "This hadith has been reported on the authority of Ibn 'Umar but with a different chain oi transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 5374,
			"arabicnumber": "2060.03",
			"text": "Nafi' reported that Ibn 'Umar saw a poor man. He placed food before him and he ate much. He (Ibn 'Umar) said:He should not come to me. for I heard Allah's Messenger (ﷺ) as saying that the non-Muslim eats in seven intestines",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 5375,
			"arabicnumber": "2061.01",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:A believer eats in one intestine, whereas a non-believer eats in seven intestines",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 5376,
			"arabicnumber": "2061.02",
			"text": "This hadith has been transmitted on the authority of Jabir",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 5377,
			"arabicnumber": "2062.01",
			"text": "Abu Musa reported Allah's Messenger (ﷺ) as saying:A believer eats in one intestine, whereas a non-believer eats in seven intestines",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 5378,
			"arabicnumber": "2062.02",
			"text": "This hadith has been narrated on the authority of Abu Huraira with a different chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 5379,
			"arabicnumber": "2063",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) invited a non-Muslim. Allah's Messenger (ﷺ) commanded that a goat be milked for him. It was milked and he drank its milk. Then the second one was milked and he drank its milk, and then the other one was milked and he drank its milk. till he drank the milk of seven goats. On the next morning he embraced Islam. And Allah's Messenger (ﷺ) commanded that a goat should be milked for him and he drank its milk and then another was milked but he did not finish it, whereupon Allah's Messenger (ﷺ) said:A believer drinks In one intestine whereas a non-believer drinks in seven intestines",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 5380,
			"arabicnumber": "2064.01",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) never found fault with food (served to him). If he liked anything, he ate it and if he did not like it he left it",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 5381,
			"arabicnumber": "2064.02",
			"text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 5382,
			"arabicnumber": "2064.03",
			"text": "A hadith like this has been narrated on the authority of A'mash",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 5383,
			"arabicnumber": "2064.04",
			"text": "Abu Huraira reported:I never saw Allah's Messenger (ﷺ) finding fault with food (served to him) ; if he liked it he ate it, and if did not like it he kept silent. This hadith has been narrated on the authority of Abu Huraira through a different chain of transmitters",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 257
			}
		}
	]
}