{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"42": "The Book of Dreams"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5897,
			"arabicnumber": "2261.01",
			"text": "Abu Salama reported:I used to see dreams (and was so much perturbed) that I began to quiver and have temperature, but did not cover myself with a mantle. I met Abu Qatada and made a mention of that to him. He said: I heard Allah's Messenger (ﷺ) as saying: A good vision comes from Allah and a (bad) dream (hulm) from devil. So when one of you sees a bad dream (hulm) which he does not like, he should spit on his left side thrice and seek refuge with Allah from its evil; then it will not harm him",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5898,
			"arabicnumber": "2261.02",
			"text": "This hadith has been narrated on the authority of Abu Qatada, but there is no mention of the words of Abu Salama:\"I saw dreams (which perturbed me) but I did not cover myself with a mantle",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5899,
			"arabicnumber": "2261.03",
			"text": "This hadith has been reported on the authority of Zuhri with the same chain of transmitters, but it does not contain the words:\"I felt disturbed because of that,\" and there is an addition of these words in the hadith transmitted on the authority of Yunus: \"Then spit thrice on the left side when you get up from sleep",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5900,
			"arabicnumber": "2261.04",
			"text": "Abu Qatada reported Allah's Messenger (ﷺ) as saying:A good vision is from Allah and a bad dream (hulm) is from the satan; so if one of you sees anything (in a dream) which he dislikes, he should spit on his left side thrice and seek refuge with Allah from its evil, and then it will never harm him. Abu Salama said: I used to see dreams weighing more heavily upon me than a mountain; but since I heard this hadith I don't care for it (its burden)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5901,
			"arabicnumber": "2261.05",
			"text": "Abu Salama reported:I used to see dreams, but the hadith transmitted on the authority of Laith b. Nu`man, the words of Abu Salama at the concluding part of the hadith are not mentioned. Ibn Rumh has reported in the hadith: \"He (one who sleeps) should change the side on which he had been lying before",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5902,
			"arabicnumber": "2261.06",
			"text": "Abu Qatada reported Allah's Messenger (ﷺ) as saying:The good vision are from Allah and the evil dreams are from the satan. If one sees a dream which one does not like, one should spit on one's left side and seek the refuge of Allah from the satan; it will not do one any harm, and one should not disclose it to anyone and if one sees a good vision one should feel pleased but should not disclose it to anyone but whom one loves",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5903,
			"arabicnumber": "2261.07",
			"text": "Abu Salama reported:I used to see (such horrible dreams) that I fell ill. I saw Abu Qatada who also said: I used to see dreams which made me sick until I heard Allah's Messenger (ﷺ) as saying: Good dreams are from Allah, so if any one of you sees which he likes he should not disclose it to one but whom he loves, but if he sees something which he does not like he should spit on his left side thrice and seek refuge with Allah from the mischief of the Satan and its mischief (i.e. of the dream), and he should not relate it to anyone, then it would not harm him",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5904,
			"arabicnumber": "2262",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:If anyone sees a dream which he does not like, he should spit on his left side three times, and seek refuge with Allah from the Satan three times, and let him turn over from the side on which he was sleeping",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5905,
			"arabicnumber": "2263.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:When the time draws near (when the Resurrection is near) a believer's dream can hardly be false. And the truest vision will be of one who is himself the most truthful in speech, for the vision of a Muslim is the forty-fifth part of Prophecy, and dreams are of three types: one good dream which is a sort of good tidings from Allah; the evil dream which causes pain is from the satan; and the third one is a suggestion of one's own mind; so if any one of you sees a dream which he does not like he should stand up and offer prayer and he should not relate it to people, and he said: I would love to see fetters (in the dream), but I dislike wearing of necklace, for the fetters is (an indication of) one's steadfastness in religion. The narrator said: I do not know whether this is a part of the hadith or the words of Ibn Sirin",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5906,
			"arabicnumber": "2263.02",
			"text": "Abu Huraira reported:I love to see fetters but I hate necklace (in a dream), for fetters signifies one's steadfastness in religion, and he also reported Allah's Messenger (ﷺ) as saying: The vision of a believer is forty-sixth part of Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5907,
			"arabicnumber": "2263.03",
			"text": "This hadith has been transmitted on the authority of Abu Huraira and the words are:\"When the time draws near,\" the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5908,
			"arabicnumber": "2263.04",
			"text": "Muhammad b. Sirin reported from Abu Huraira a hadith from Allah's Apostle (ﷺ) and he mentioned in his hadith his words:\"I dislike shackles,\" up to the end of his statement, but he made no mention of this: \"A vision is a forty-sixth part of Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5909,
			"arabicnumber": "2264.01",
			"text": "Ubada b. as-Samit reported Allah's Messenger (ﷺ) as saying:The vision of a believer is the forty-sixth part of Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5910,
			"arabicnumber": "2264.02",
			"text": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5911,
			"arabicnumber": "2263.05",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Verily the vision of a believer is one of the forty-sixth part of Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5912,
			"arabicnumber": "2263.06",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The vision of a Muslim which he sees or which is shown to him, and in the hadith transmitted on the authority of Ibn Mushir (the words are): \"The pious dream is the forty-sixth part of Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5913,
			"arabicnumber": "2263.07",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The vision of a pious man is the forty-sixth part of Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5914,
			"arabicnumber": "2263.08",
			"text": "This hadith has been narrated on the authority of Yahya b. Abu Kathir with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5915,
			"arabicnumber": "2263.09",
			"text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5916,
			"arabicnumber": "2265.01",
			"text": "Ibn `Umar reported Allah's Messenger (ﷺ) as saying:The pious dreams are the seventieth part of Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5917,
			"arabicnumber": "2265.02",
			"text": "This hadith has been reported on the authority of `Ubaidullah with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5918,
			"arabicnumber": "2265.03",
			"text": "A hadith like this has been reported on the authority of Nafi` with the same chain of transmitters (and the words are):\"I think Ibn `Umar said: The seventieth part from Prophecy",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5919,
			"arabicnumber": "2266.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:He who saw me in a dream in fact saw me, for the satan does not appear in my form",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5920,
			"arabicnumber": "2266.02",
			"text": "Abu Huraira reported:I heard Allah's Messenger (ﷺ) as saying: He who saw me in a dream would soon see me in the state of wakefulness, or as if he saw me in a state of wakefulness, for the satan does not appear in my form",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5921,
			"arabicnumber": "2267.01",
			"text": "Abu Qatada reported Allah's Messenger (ﷺ) as saying:He who saw me in dream in fact saw the truth (what is true)",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5922,
			"arabicnumber": "2267.02",
			"text": "The above two hadith have been narrated likewise through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5923,
			"arabicnumber": "2268.01",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:He who saw me in sleep in fact saw me, for it is not possible for the satan to appear in my form; and he also said: When any one of you sees a hulm he should not inform anyone, for it is a sort of vain sport of devil in the state of sleep",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5924,
			"arabicnumber": "2268.02",
			"text": "Jabir b. `Abdullah reported Allah's Messenger (ﷺ) as saying:He who saw me in a dream in fact saw me, for the satan cannot assume my form",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5925,
			"arabicnumber": "2268.03",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:There came to him (the Holy Prophet) a desert Arab and said: I saw in a dream that I had been beheaded and I had been following it (the severed head). Allah's Apostle (ﷺ) reprimanded him saying: Do not inform about the vain sporting of devil with you during the night",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5926,
			"arabicnumber": "2268.04",
			"text": "Jabir reported that there came to Allah's Apostle (ﷺ) a desert Arab and said:Allah's Messenger, I saw in the state of sleep as if my head had been cut off and I had been moving on haltingly after it. Thereupon Allah's Messenger (ﷺ) said to that desert Arab: Do not narrate to the people the vain sporting of satan with you in your sleep and (the narrator) also said: I heard Allah's Messenger (ﷺ) in his subsequent address: None amongst you should narrate the vain sporting of devil with him in the dream",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5927,
			"arabicnumber": "2268.05",
			"text": "Jabir reported that a person came to Allah's Apostle (ﷺ) and said:Allah's Messenger, I have seen in the state of sleep as if my head had been cut off. Thereupon Allah's Apostle (ﷺ) laughed and said: When the satan plays with any one of you in the state of sleep, do not mention it to the people; and in the hadith transmitted by Abu Bakr (the words are): \"If one of you is played with, and he did not make any mention of the word: \"Satan",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5928,
			"arabicnumber": "2269.01",
			"text": "It is reported either on the authority of Ibn `Abbas or on the authority of Abu Huraira that a person came to Allah's Messenger (ﷺ) and said:Allah's Messenger, I saw while I was sleeping during the night (this vision) that there was a canopy from which butter and honey were trickling and I also saw people collecting them in the palms of their hands, some more, some less, and I also saw a rope connecting the earth with the sky and I saw you catching hold of it and rising towards the heaven; then another person after you catching hold of it and rising towards (Heaven); then another person catching hold of it, but it was broken while it was rejoined for him and he also climbed up. Abu Bakr said: Allah's Messenger, may my father be sacrificed for you, by Allah, allow me to interpret it. Allah's Messenger (ﷺ) said: Well, give its interpretation. Thereupon Abu Bakr said: The canopy signifies the canopy of Islam and that what trickles out of it in the form of butter and honey is the Holy Qur'an and its sweetness and softness and what the people get hold of it in their palms implies major portion of the Qur'an or the small portion; and so far as the rope joining the sky with the earth is concerned, it is the Truth by which you stood (in the worldly life) and by which Allah would raise you (to Heaven). Then the person after you would take hold of it and he would also climb up with the help of it. Then another person would take hold of it and climb up with the help of it. Then another person would take hold of it and it would be broken; then it would be rejoined for him and he would climb up with the help of it. Allah's Messenger, may my father be taken as a ransom for you, tell me whether I have interpreted it correctly or I have made an error. Allah's Messenger (ﷺ) said: You have interpreted a part of it correctly and you have erred in interpreting a part of it. Thereupon he said: Allah's Messenger, by Allah, tell me that part where I have committed an error. Thereupon he said: Don't take an oath",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5929,
			"arabicnumber": "2269.02",
			"text": "Ibn `Abbas reported that there came to Allah's Apostle (ﷺ) a person as he was returning from Uhud and he said:Allah's Messenger, I saw in sleep during the night a canopy trickling butter and honey; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5930,
			"arabicnumber": "2269.03",
			"text": "It is reported either on the authority of Ibn 'Abbas or on that of Abu Huraira that a person came to Allah's Messenger (ﷺ) and said:Verily I saw during the night a canopy; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5931,
			"arabicnumber": "2269.04",
			"text": "Ibn `Abbas reported that Allah's Messenger (ﷺ) used to say to his Companions:He who amongst you sees a vision should narrate it and I would interpret it for him, and a person came and said: Allah's Messenger, I saw a canopy. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5932,
			"arabicnumber": "2270",
			"text": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:I saw during the night that which a person sees during the sleep as if we are in the house of `Uqba b. Rafi` that there was brought to us the fresh dates of Ibn Tab. I interpreted it as the sublimity for us in the world and good ending in the Hereafter and that our religion is good",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5933,
			"arabicnumber": "2271",
			"text": "Abdullah b. `Umar reported Allah's Messenger (ﷺ) as saying:I saw in a dream that I was using miswak and two persons contended to get it from me, one being older than the other one. I gave the miswak to the younger one. It was said to me to give that to the older one and I gave it to the older one",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5934,
			"arabicnumber": "2272",
			"text": "Abu Musa reported Allah's Messenger (ﷺ) as saying:I dreamt (while asleep) that I was about to migrate from Mecca to a land abounding in palm trees and I guessed that it would be Yamama or Hajar, but it was the city of Yathrib (the old name of Medina), and I saw in this dream of mine that I was brandishing a sword and its upper end was broken and this is what fell (in the form of misfortune to the believers on the Day of Uhud). I brandished (the sword) for the second time and it became all right and this is what came to be true when Allah granted us victory and solidarity of the believers. And I saw therein cows also and Allah is the Doer of good. These meant the group from amongst the believers on the Day of Uhud and the goodness which Allah brought after that and the reward of attestation of his Truth which Allah brought to us after the Day of Badr",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5936,
			"arabicnumber": "2274.02",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:While I was sleeping, the treasures of the earth were presented to me and I was made to wear in my hands two gold bangles. I felt a sort of burden upon me and I was disturbed and it was suggested to me that I should blow over them, so I blew and both of them disappeared. I interpreted them as two great liars who would appear at any time, one is the inhabitant of San`a' and the other is that of Yamama",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5937,
			"arabicnumber": "2275",
			"text": "Samura b. Jundab reported that when Allah's Messenger (ﷺ) had performed his dawn prayer he turned his face towards them (that is towards his Companions) and said:Did any one of you see any vision last night?",
			"grades": [],
			"reference": {
				"book": 42,
				"hadith": 41
			}
		}
	]
}