{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6169,
			"arabicnumber": "2381",
			"text": "Anas b. Malik reported that Abu Bakr Siddiq reported him thus:I saw the feet of the polytheists very close to us as we were in the cave. I said: Allah's Messenger, if one amongst them were to see at his feet he would have surely seen us. Thereupon he said: Abu Bakr, what can befall two who have Allah as the third One with them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6170,
			"arabicnumber": "2382.01",
			"text": "Abu Sa'id reported that Allah's Messenger (ﷺ) sat on the pulpit and said:Allah gave a choice to His servant that he may opt the beauties of the world or that which is with Him and the servant chose that which was with Him. Thereupon Abu Bakr wept and he wept bitterly and said: Let our fathers and our mothers be taken as ransom for you. It was Allah's Messenger (ﷺ) who had been given the choice and Abu Bakr knew it better than us, and Allah's Messenger (ﷺ) is reported to have said: Behold, of all people the most generous toward me in regard to his companionship and his property was Abu Bakr and were I to choose anyone as my bosom friend, I would have chosen Abu Bakr as my dear friend, but (for him) I cherish Islamic brotherliness and love. There shall be left open no window in the mosque except Abu Bakr's window",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6171,
			"arabicnumber": "2382.02",
			"text": "This hadith has been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6172,
			"arabicnumber": "2383.01",
			"text": "Abdullah b. Mas'ud reported Allah's Messenger (ﷺ) as saying:If I were to choose a bosom friend I would have definitely chosen Abu Bakr as my bosom friend, but he is my brother and my companion and Allah, the Exalted and Gliorious. has taken your brother and companion (meaning Prophet himself) as a friend",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6173,
			"arabicnumber": "2383.02",
			"text": "Abdullah reported Allah's Messenger (ﷺ) as saying:If I were to choose from my Umma anyone as my bosom friend, I would have chosen Abu Bakr",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6174,
			"arabicnumber": "2383.03",
			"text": "Abdullah reported Allah's Messenger (ﷺ) as saying:If I were to choose as my bosom friend I would have chosen the son of Abu Quhafa (Abu Bakr) as my bosom friend",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6175,
			"arabicnumber": "2383.04",
			"text": "Abdullah reported Allah's Messenger (ﷺ) as saying:If I were to choose amongst the people of earth someone as my bosom friend, I would have chosen the son of Abu Quhafa as my friends but God has taken your companion as a friend",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6176,
			"arabicnumber": "2383.05",
			"text": "This hadith has been narrated through another chain of transmitters and the one narrated on the authority of Abdullah (the words are):\" Allah's Messenger (ﷺ) is reported to have said: Behold I am free from the dependence of all bosom friends and if I were to choose anyone as bosom friend I would have taken Abu Bakr as my bosom friend. Allah has taken your companion as a friend",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6177,
			"arabicnumber": "2384",
			"text": "Amr b. al-'As reported that Allah's Messenger (ﷺ) sent him in command of the army despatched to Dhat-as-Salasil. When 'Amr b. al-'As came back to the Prophet (ﷺ) he said:Who amongst people are dearest to you? He said: A'isha. He then said: Who amongst men? He said: Her father, and I said: And who next? He said: Umar. He then enumerated some other men",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6178,
			"arabicnumber": "2385",
			"text": "Ibn Abu Mulaika reported:I heard `A'isha as saying and she was asked as to whom Allah's Messenger (ﷺ) would have nominated as his successor if he had to nominate one at all. She said: Abu Bakr. It was said to her: Then whom after Abu Bakr? She said: `Umar. It was said to her. Then whom after `Umar? She said: Abu `Ubaida b. al-Jarrah, and then she kept quiet at this",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6181,
			"arabicnumber": "2387",
			"text": "A'isha reported that Allah's Messenger (ﷺ) in his (last) illness asked me to call Abu Bakr, her father, and her brother too, so that he might write a document, for he feared that someone else might be desirous (of succeeding him) and that some claimant may say:I have better claim to it, whereas Allah and the Faithful do not substantiate the claim of anyone but that of Abu Bakr",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6182,
			"arabicnumber": "1028.02",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) said:Who amongst you is fasting today? Abu Bakr said: I am. He (again) said: Who amongst you followed a funeral procession today? Abu Bakr said: I did. He (the Prophet) again said: Who amongst you served food to the needy? Abu Bakr said: I did. He (again) said: Who amongst you has today visited the sick? Abu Bakr said: I did. Thereupon Allah's Messenger (ﷺ) said: Anyone in whom (these good deeds) are combined will certainly enter paradise",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6183,
			"arabicnumber": "2388.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:A person had been driving an ox loaded with luggage. The ox looked towards him and said: I have not been created for this but for lands (i. e. for ploughing the land and for drawing out water from the wells for the purpose of irrigating the lands). The people said with surprise and awe: Hallowed be Allah, does the ox speak? Allah's Messenger (ﷺ) said: I believe it and so do Abu Bakr and 'Umar. Abu Huraira reported Allah's Messenger (ﷺ) as saying: A shepherd was tendirig the flock when a wolf came there and took away one goat. Tile shepherd pursued it (the wolf) and rescued it (the goat) from that (wolf). The wolf looked towards him and said: Who would save it on the day when there will be no shepherd except me? Thereupon people said: Hallowed be Allah I Thereupon Allah's Messenger (ﷺ) said: I believe in it and so do Abu Bakr and Umar believe",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6184,
			"arabicnumber": "2388.02",
			"text": "This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters, but there is no mention of the story pertaining to the ox",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6185,
			"arabicnumber": "2388.03",
			"text": "This hadith has been transmitted on the authority of Zuhri, and there is a clear mention of the stories of ox and goat (and the words are):I believe in it and so do Abu Bakr and Umar, but they were not at that time present there",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6186,
			"arabicnumber": "2388.04",
			"text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transrritters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6187,
			"arabicnumber": "2389.01",
			"text": "Ibn Abu Mulaika reported:I heard Ibn 'Abbas as saying: When 'Umar b. Khattab was placed in the coffin the people gathered around him. They praised him and supplicated for him before the bier was lifted up, and I was one amongst them. Nothing attracted my attention but a person who gripped my shoulder from behind. I saw towards him and found that he was 'Ali. He invoked Allah's mercy upon 'Umar and said: You have left none behind you (whose) deeds (are so enviable) that I love to meet Allah with them. By Allah, I hoped that Allah would keep you and your two associates together. I had often heard Allah's Messenger (ﷺ) as saying: I came and there came too Abu Bakr and 'Umar; I entered and there entered too Abu Bakr and 'Umar; I went out and there went out too Abu Bakr and 'Umar, and I hope and think that Allah will keep you along with them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6188,
			"arabicnumber": "2389.02",
			"text": "This hadith has been narrated on the authority of 'Umar b. Sa'id with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6189,
			"arabicnumber": "2390",
			"text": "Abu Sa'id Khudri reported Allah's Messenger (ﷺ) as say ing:While I was asleep I saw people being presented to me (in a dream) and they wore shirts and some of these reached up to the breasts and some even beyond them. Then there happened to pass 'Umar b. Khattab and his shirt had been trailing. They said: Allah's Messeneer, how do you interpret the dream? He said: (As strength of) faith",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6190,
			"arabicnumber": "2391.01",
			"text": "Hamza b. Abdullah b. 'Umar b. Khattab reported on the authority of his father that Allah's Messenger (ﷺ) said:While I was asleep I saw (in a dream) a cup containing milk being presented to me. I took out of that until I perceived freshness being reflected through my nails. Then I presented the leftover to 'Umar b. Khattab. They said: Allah's Messenger: How do you interpret it? He said: This implies knowledge",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6191,
			"arabicnumber": "2391.02",
			"text": "This hadith has been narrated on the authority of Yunus with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6192,
			"arabicnumber": "2392.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:While I was asleep I saw myself on a well with a leathern bucket on a pulley. I drew (water) out of that as Allah wished me (to draw). Then the son of Abu Quhafa (Abu Bakr) drew from it one bucketful or two and there was some weakness in drawing that (may Allah forgive him). Then that bucket (changed into a large bucket) and Ibn Khattab drew it. I did not see any strongest man drawing it like 'Umar b. Khattab. He brought out so much water that the camels of the people had enough to drink and then laid down (for rest)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6193,
			"arabicnumber": "2392.02",
			"text": "This hadith has been narrated on the authority of Yunus through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6194,
			"arabicnumber": "2392.03",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:I saw Ibn Abu Quhafa drawing (water) ; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6195,
			"arabicnumber": "2392.04",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:While I was asleep I saw myself drawing water from my tank in order to quench the thirst of the people that there came to me Abu Bakr. He took hold of the leathern bucket from my hand so that he should serve water to the people. He drew two bucketfuls and there was some weakness in his drawing (Allah may forgive him). Then there came Ibn Khattab and he took hold of that, and I did not see a person stronger than he (drawing water) until the people went away with their thirst quenched and the tank filled with water",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6196,
			"arabicnumber": "2393.01",
			"text": "Abdullah b. 'Umar reported Allah's Messenger (ﷺ) as saying:I saw (in a dream) as if I was drawing water with a leathern bucket on a wooden pulley. There came Abu Bakr and he drew out a bucketful or two and as he drew out, some weakness (was perceived in it) (may Allah, the Exalted and Glorious, forgive him). Then Umar came in order to serve water -and the bucket was changed into a large leather bucket and I did not see such a wonderful man amongst persons (drawing water) and he went on serving water to the people until they were fully satisfied and then went to their resting places",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6197,
			"arabicnumber": "2393.02",
			"text": "Salim b. 'Abdullah reported on the authority of his father some of the dreams of Allah's Messenger (ﷺ) pertaining to Abu Bakr and Umar b. Khattab (Allah be pleased with them) and a hadith like this",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6198,
			"arabicnumber": "2394.01",
			"text": "Jabir reported Allah's Messenger (ﷺ) as saying:I entered Paradise and saw in it a house or a palace. I said: For whom is it resersred? They (the Angels) said: It is for 'Umar b. Khattab. (The Prophet said to 'Umar b. Khattab): I intenied to get into it but I thought of your feelings. Thereupon 'Umar wept and said: Apostle of Allah, could I feel any jealousy in your case?",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6199,
			"arabicnumber": "2394.02",
			"text": "This hadith has been narrated on the authority of Jabir through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6202,
			"arabicnumber": "2396",
			"text": "Sa'd b. Waqqas reported that Umar sought permission from Allah's Messenger (ﷺ) to visit him when some women of the Quraish were busy in talking with him and raising their voices above his Voiee. When'Umar sought permission they stood up and went hurriedly behind the curtain. Allah's Messenger (ﷺ) gave him permission smilingly. Thereupon 'Umar said:Allah's Messenger, may Allah keep you happy all your life. Then Allah's Messenger (ﷺ) said: I wonder at these women who were with me and no sooner did they hear your voice, they immediately went behind the curtain. Thereupon 'Umar said: Allah's Messenger, you have more right that they should fear you. Then Umar (addressing the women) said: O ye enemies of yourselves, do you fear me and fear not the Messenger of Allah (ﷺ)? They said: Yes, you are harsh and strict as compared to the Messenger of Allah (ﷺ). Thereupon, Allah's Messenger (maypeace be upon him) said: By Him in Whose Hand is my life, if satan would encounter you in the way he would certainly take a different way from that of yours",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6203,
			"arabicnumber": "2397",
			"text": "Abu Huraira reported that Umar b. Khattab came to Allah's Messenger (ﷺ) while there were some women with him and they were raising their voices above the voice of Allah's Messenger (ﷺ) and when Umar sought permission to get into the house they went behind the curtain hurriedly. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6204,
			"arabicnumber": "2398.01",
			"text": "A'isha reported Allah's Messenger (ﷺ) as saying:There had been among the people before you inspired persons and if there were any such among my Umma Umar b. Khattab would be one of them. Ibn Wahb explained the word Muhaddathun as those who receive hint from the High (Mulhamun)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6205,
			"arabicnumber": "2398.02",
			"text": "This hadith has been narrated on the authority of Sa'd b. Ibrahim with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6206,
			"arabicnumber": "2399",
			"text": "Ibn Umar reported Umar as saying:My lord concorded with (my judgments) on three occasions. In case of the Station of Ibrahim, in case of the observance of veil and in case of the prisoners of Badr",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6207,
			"arabicnumber": "2400.01",
			"text": "Ibn Umar reported that when 'Abdullah b. Ubayy b. Salul (the hypocrite) died, his son Abdullah b. Abdullah came to Allah's Messenger (may peace be upon -him) and asked him to give his shirt which should be used for the coffin of his father. He gave that to him. Allah's Messenger (ﷺ) stood up to say prayer over him Thereupon I Umar caught hold of the clothe of Allah's Messenger (ﷺ) and said:Allah's Messenger, are you going to offer prayer, whereas Allah has forbidden to offer prayer for him, whereupon Allah's Messenger (ﷺ) said: Allah has given me a choice saying: Ask forgiveness for them or you may not ask for them; even if you ask for them seventy times, I will make an addition to the seventy. He was a hypocrite and Allah's Messenger (ﷺ) said prayer over him that Allah, the Exalted and Glorious, revealed the verse:\" And never pray over any one of them that has died and never should you stand by his grave\" (ix. 84)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6208,
			"arabicnumber": "2400.02",
			"text": "This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitter but with the addition of the words:\" He abandoned saying prayer over the hypocrites who had died",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6209,
			"arabicnumber": "2401",
			"text": "Aisha reported:Allah's Messenger (ﷺ) was lying in the bed in my apartment with his thigh uncovered and Abu Bakr sought permission to enter. It was given to him and he conversed in the same very state (the Prophet's thigh or shank uncovered). Then `Umar sought permission for entering and it was given to him and he conversed in that very state. Then `Uthman sought permission to enter; Allah's Messenger (ﷺ) sat down and he set right his clothes. Muhammad (one of the narrators) said: I do not say that it happened on the same day. He (`Uthman) then entered and conversed and as he went out, `Aisha said: Abu Bakr entered and you did not stir and did not observe much care (in arranging your clothes), then `Umar entered and you did not stir and did not arrange your clothes, then `Uthman entered and you got up and set your clothes right, so he (ﷺ) said: Should I not show modesty to one whom even the Angels show modesty",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6210,
			"arabicnumber": "2402.01",
			"text": "A'isha, the wife of Allah's Apostle (mav peace be upon him), and Uthman both reported that Abu Bakr sought permission from Allah's Messenger (ﷺ) for entrance (in his apartment) as he had been lying on his bed covered with the bed-sheet of A'isha, and he gave permission to Abu Bakr in that very state and he, having his need fulfilled, went back. Then Umar sought permission and it was given to him in that very state and, after having his need fulfilled, he went back. And 'Uthman reported:Then I sought permission from him and he got up and raid to A'isha: Wrap yourself well with your cloth, then I got my need fulfilled and came back. And A'isha said: Allah's Messenger, why is it that I did not see you feeling any anxiety in case of dressing properly in the presence of Abu Bakr and 'Umar (Allah be pleased with them) as you showed in case of 'Uthman. Thereupon Allah's Messenger (ﷺ) said: Verily Uthman is a person who is very modest and I was afraid that if I permitted him to enter in this very state he would not inform me of his need",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6211,
			"arabicnumber": "2402.02",
			"text": "This hadith has been transmitted on the authority of Uthman and A'isha with the same wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6212,
			"arabicnumber": "2403.01",
			"text": "Abu Musa al-Ash'ari reported that while Allah's Messenger (ﷺ) was in one of the gardens of Medina, reclining against a pillow and fixing a stick in a mud, that a person came asking for the gate to be opened, whereupon he said:Open it for him and give him glad tidings of Paradise and, lo, it was Abu Bakr. I opened (the gate) for him and gave him the glad tidings of Paradise. Then another person asked for the door to be opened, whereupon he said: Open it and give him the glad tidings of Piradise. He said: I went away and, lo, it was 'Umar. I opened it for him and gave him the glad tidings of Paradise. Then still another man asked for the door to be opened, and thereupon Allah's Apostle (ﷺ) said: Open it and give him the glad tidings of Paradise after a trial would afflict him. I went and, lo, it was 'Uthman b. 'Affan. 1 opened the door and gave him the glad tidings of Paradise and informed him (what the Prophet had said). Thereupon he said: O Allah, grant me steadfastness. Allah is one Whose help is to be sought",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6213,
			"arabicnumber": "2403.02",
			"text": "This hadith has been transmitted on the authority of Abu Musa al-Ash'ari with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6214,
			"arabicnumber": "2403.03",
			"text": "Abu Musa Ash'ari reported that he performed ablution in his house and then came out saying:I would remain with Allah's Messenger (ﷺ) the whole day long. He came to the mosque, and asked about Allah's Apostle (ﷺ). They (his Companions) said: He has gone in this direction. He (Abu Musa Ash'ari) said: I followed his steps asking about him until I came to Bi'r Aris (it is a well in the suburb of Medina). I sat by its wooden door until Allah's Messenger (ﷺ) had relieved himself and then performed ablution. I went to him and he was sitting with his shanks uncovered hp to the knees and his legs dangl- ing in that well. I offered him salutations. I then came back and sat at the door as if I had been a chamberlain at the door of Allah's Messenger (ﷺ) that day. There came Abu Bakr and knocked the door and I said: Who is it? He said: This is Abu Bakr. I said: Wait, please. I went and said: Allah's Messenger, here is Abu Bakr seeking permission. Thereupon he said: Admit him and give him glad tidings of Paradise. I came and I said to Abu Bakr to get in (and also told him) that Allah's Messenger (ﷺ) was giving him the glad tidings of Paradise. Abu Bakr got in and sat on the right side of Allah's Messenger (ﷺ) and dangled his feet in the well as Allah's Messenger (ﷺ) had done, and he uncovered his shanks. I then returned and sat there and I had left my brother as he had been performing ablution and he was to meet me and I said: If Allah would intend goodness for such and such he would intend goodness for his brother and He would bring him. I was thinking this that a person stirred the door. I said: Who is it. He said: This is Umar b., Khattab. I said: Wait. Then I came to Allah's Messenger (ﷺ), greeted him and said: Here is 'Umar seeking your. permission to get in. Thereupon he said: Let him come in and give him glad tid- ings of Paradise. I came to Umar and said: There is permission for you and glad tidings for you from Allah's Messenger (ﷺ) for Paradise. He got in and sat on the left side of Allah's Messenger (ﷺ) with his feet dangling in the well. I then returned and sat and said: If Allah would intend goodness for such and such (that is for his brother), He would bring him. And I was contemplat- ing over it that a man stirred the door and I said: Who is it? He said: This is Uthman b. Affan. I said: Wait, please. I then came to Allah's Messenger (ﷺ) and informed him. and he said: Admit him and give him glad tidings (and inform) him of the turmoil which he shall have to face. I came and said: Get in, Allah's Messenger (ﷺ) gives you the glad tidings of Paradise along with the trial which you shall have to face. He got in and saw the elevated plan round the well fully occupied. He sat on the other side. Sharik said that Sa'id b. al-Musayyib reported: I drew a conclusion from it that their groves would be (in this very state, the graves of Hadrat Abu Bakr, 'Umar Faruq by the tide of the Prophet [may peace be upon him] and the grave of Hadrat 'Uthman away from their graves",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6215,
			"arabicnumber": "2403.04",
			"text": "Abu Musa. reported:I set out with the intention (of meeting) Allah's Messenger (ﷺ) and came to know that he had gone to the gardens (in the suburb of Medina). I followed him and found him in a garden sitting upon an elevated place round the well with his shanks uncovered which had been dangling in the well. The rest of the hadith is the same but with this variation that there is no mention of the words of Sa'id: all drew a conclusion from it pertaining to their graves",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6216,
			"arabicnumber": "2403.05",
			"text": "Sa'id b. al-Musayyib reported Abu Musa Ash'ari having said that Allah's Messenger (ﷺ) set out one day to the suburbs of Medina for reliev- ing himself. I followed his steps. The rest of the hadith is the same. Ibn Musayyib said:I concluded (from the manner of their sitting) the (order) of their graves. (The three) would be together (the graves of the Holy Prophet, Hadrat Abu Bakr and Hadrat Umar) and that of 'Uthman would be separate (from them)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6217,
			"arabicnumber": "2404.01",
			"text": "Amir b Sa'd b. Abi Waqqas reported (on the authority of his father that Allah's Messenger (ﷺ) addressing 'Ali said:You are in the same position with relation to me as Aaron (Harun) was in relation to Moses but with (this explicit difference) that there is no prophet after me. Sa'd said: I had an earnest desire to hear it directly from Sa'd, so I met him and narrated to him what (his son) Amir had narrated to me, whereupon he said: Yes, I did hear it. I said: Did you hear it yourself? Thereupon he placed his fingers upon his ears and said: Yes, and if not, let both my ears become deaf",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6218,
			"arabicnumber": "2404.02",
			"text": "Sa'd b. Abi Waqqas reported that Allah's Messenger (ﷺ) left 'Ali b. Abi Talib behind him (as he proceeded) to the expedition of Tabuk, whereupon he ('Ali) said:Allah's Messenger, are you leaving me behind amongst women and children? Thereupon he (the Holy Prophet) said: Aren't you satisfied with being unto me what Aaron was unto Moses but with this exception that there would be no prophet after me?",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6219,
			"arabicnumber": "2404.03",
			"text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6220,
			"arabicnumber": "2404.04",
			"text": "Amir b. Sa'd b. Abi Waqqas reported on the authority of his father that Muawiya b. Abi Sufyan appointed Sa'd as the Governor and said:What prevents you from abusing Abu Turab (Hadrat 'Ali), whereupon be said: It is because of three things which I remember Allah's Messenger (ﷺ) having said about him that I would not abuse him and even if I find one of those three things for me, it would be more dear to me than the red camels. I heard Allah's Messenger (ﷺ) say about 'Ali as he left him behind in one of his campaigns (that was Tabuk). 'Ali said to him: Allah's Messenger, you leave me behind along with women and children. Thereupon Allah's Messenger (ﷺ) said to him: Aren't you satisfied with being unto me what Aaron was unto Moses but with this exception that there is no prophethood after me. And I (also) heard him say on the Day of Khaibar: I would certainly give this standard to a person who loves Allah and his Messenger, and Allah and his Messenger love him too. He (the narrator) said: We had been anxiously waiting for it, when he (the Holy Prophet) said: Call 'Ali. He was called and his eyes were inflamed. He applied saliva to his eyes and handed over the standard to him, and Allah gave him victory. (The third occasion is this) when the (following) verse was revealed: \"Let us summon our children and your children.\" Allah's Messenger (ﷺ) called 'Ali, Fatima, Hasan and Husain and said: O Allah, they are my family",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6221,
			"arabicnumber": "2404.05",
			"text": "Sa'd reported Allah's Apostle (ﷺ) as saying to 'Ali:Aren't you satisfied with being unto me what Aaron was unto Moses?",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6222,
			"arabicnumber": "2405",
			"text": "Suhail reported on the authority of Abu Huraira that Allah's Messenger (ﷺ) said on the Day of Khaibar:I shall certainly give this standard in the hand of one who loves Allah and his Messenger and Allah will grant victory at his hand. Umar b. Khattab said: Never did I cherish for leadership but on that day. I came before him with the hope that I may be called for this, but Allah's Messenger (ﷺ) called 'Ali b. Abu Talib and he conferred (this honour) upon him and said: Proceed on and do not look about until Allah grants you victory, and 'Ali went a bit and then halted and did not look about and then said in a loud voice: Allah's Messenger, on what issue should I fight with the people? Thereupon he (the Prophet) said: Fight with them until they bear testimony to the fact that there is no god but Allah and Muhammad is his Messenger, and when they do that then their blood and their riches are inviolable from your hands but what is justified by law and their reckoning is with Allah",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6223,
			"arabicnumber": "2406",
			"text": "Sahl b. Sa'd reported that Allah's Messenger (ﷺ) said on the Day of Khaibar:I would certainly give this standard to a person at whose hand Allah would grant victory and who loves Allah and His Messenger and Allah and His Messenger love him also. The people spent the night thinking as to whom it would be given. When it was morning the people hastened to Allah's Messenger (ﷺ) all of them hoping that that would be given to him. He (the Holy Prophet) said: Where is 'Ali b. Abu Talib? They said: Allah's Messenger, his eyes are sore. He then sent for him and he was brought and Allah's Messenger (ﷺ) applied saliva to his eyes and invoked blessings and he was all right, as if he had no ailment at all, and conferred upon him the standard. 'Ali said: Allah's Messenger, I will fight them until they are like us. Thereupon he (the Holy Prophet) said: Advance cautiously until you reach their open places, thereafter invite them to Islam and inform them what is obligatory for them from the rights of Allah, for, by Allah, if Allah guides aright even one person through you that is better for you than to possess the most valuable of the camels",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6224,
			"arabicnumber": "2407",
			"text": "Salama b. Akwa' reported that it was 'Ali whom Allah's Apostle (ﷺ) left behind him (in the charge of his family and the Islamic State) on the occasion of the campaign of Khaibar, and his eyes were inflamed and he said:Is it for me to remain behind Allah's Messenger (ﷺ)? So he went forth and rejoined Allah's Apostle (ﷺ) and on the evening of that night (after which) next morning Allah granted victory. Allah's Messenger (ﷺ) said: I will certainly give this standard to a man whom Allah and His Messenger love. or he said: Who loves Allah or His Messenger and Allah will grant him victory through him, and, lo, we saw 'Ali whom we least expected (to be present on that occasion). They (the Companions) said: Here is 'Ali. Thereupon Allah's Messenger (may peace be upon hin) gave him the standard. Allah granted victory at his hand",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6225,
			"arabicnumber": "2408.01",
			"text": "Yazid b. Hayyan reported, I went along with Husain b. Sabra and 'Umar b. Muslim to Zaid b. Arqam and, as we sat by his side, Husain said to him:Zaid. you have been able to acquire a great virtue that you saw Allah's Messenger (ﷺ) listened to his talk, fought by his side in (different) battles, offered prayer behind me. Zaid, you have in fact earned a great virtue. Zaid, narrate to us what you heard from Allah's Messenger (ﷺ). He said: I have grown old and have almost spent my age and I have forgotten some of the things which I remembered in connection with Allah's Messenger (ﷺ), so accept whatever I narrate to you, and which I do not narrate do not compel me to do that. He then said: One day Allah's Messenger (ﷺ) stood up to deliver sermon at a watering place known as Khumm situated between Mecca and Medina. He praised Allah, extolled Him and delivered the sermon and. exhorted (us) and said: Now to our purpose. O people, I am a human being. I am about to receive a messenger (the angel of death) from my Lord and I, in response to Allah's call, (would bid good-bye to you), but I am leaving among you two weighty things: the one being the Book of Allah in which there is right guidance and light, so hold fast to the Book of Allah and adhere to it. He exhorted (us) (to hold fast) to the Book of Allah and then said: The second are the members of my household I remind you (of your duties) to the members of my family. He (Husain) said to Zaid: Who are the members of his household? Aren't his wives the members of his family? Thereupon he said: His wives are the members of his family (but here) the members of his family are those for whom acceptance of Zakat is forbidden. And he said: Who are they? Thereupon he said: 'Ali and the offspring of 'Ali, 'Aqil and the offspring of 'Aqil and the offspring of Ja'far and the offspring of 'Abbas. Husain said: These are those for whom the acceptance of Zakat is forbidden. Zaid said: Yes",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6226,
			"arabicnumber": "2408.02",
			"text": "This hadith has been narrated on the authority of Zaid b. Arqam through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6227,
			"arabicnumber": "2408.03",
			"text": "This hadith has been transmitted on the authority of Abu Hayyan but with this addition:\" The Book of Allah contains right guidance, the light, and whoever adheres to it and holds it fast, he is upon right guidance and whosoever deviates from it goes astray",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": "2408.04",
			"text": "Yazid b. Hayyan reported:We went to him (Zaid b. Arqam) and said to him. You have found goodness (for you had the honour) to live in the company of Allah's Messenger (ﷺ) and offered prayer behind him, and the rest of the hadith is the same but with this variation of wording that lie said: Behold, for I am leaving amongst you two weighty things, one of which is the Book of Allah, the Exalted and Glorious, and that is the rope of Allah. He who holds it fast would be on right guidance and he who abandons it would be in error, and in this (hadith) these words are also found: We said: Who are amongst the members of the household? Aren't the wives (of the Holy Prophet) included amongst the members of his house hold? Thereupon he said: No, by Allah, a woman lives with a man (as his wife) for a certain period; he then divorces her and she goes back to her parents and to her people; the members of his household include his ownself and his kith and kin (who are related to him by blood) and for him the acceptance of Zakat is prohibited",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": "2409",
			"text": "Sahl b. Sa`d reported that a person from the offspring of Marwan was appointed as the governor of Medina. He called Sahl b. Sa`d and ordered him to abuse `Ali. Sahl refused to do that. He (the governor) said to him:If you do not agree to it (at least) say: May Allah curse Abu Turab. Sahl said: There was no name dearer to `Ali than Abu Turab (for it was given to him by the Prophet himself) and he felt delighted when he was called by this name. He (the governor) said to him: Narrate to us the story of his being named as Abu Turab. He said: Allah's Messenger (ﷺ) came to the house of Fatima and he did not find `Ali in the house; whereupon he said: Where is your uncle's son? She said: (There cropped up something) between me and him which had annoyed him with me. He went out and did not rest here. Allah's Messenger (ﷺ) asked a person to find out where he was. He came and said: Allah's Messenger, he is sleeping in the mosque. Allah's Messenger (ﷺ) came to him and found him lying in the mosque and saw that his mantle had slipped from his back and his back was covered with dust and Allah's Messenger (ﷺ) began to wipe it away from him (from the body of Hadrat `Ali) saying: Get up, covered with dust (Abu Turab); get up, covered with dust",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": "2410.01",
			"text": "A'isha reported that Allah's Messenger (may peace he upon him) lay on bed during one night and said:Were there a pious person from amongst my companions who should keep a watch for me during the nightt? She said: We heard the noise of arms, whereupon Allah's Messenger (ﷺ) said: Who is it? And Sa'd b. Abi Waqqas said: Allah's MesseDger. I have come to serve as your sentinel. 'A'isha said: Allah' s Messenger (ﷺ) slept (such a sound sleep) that I heard the noise of his snoring",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": "2410.02",
			"text": "A'isha reported that Allah's Messenger (may peace he upon him) laid down on bed during one night on his arrival at Medina and said:Were there a pious person from amongst my Companions who should keep a watch for me durin. the night? She (A'isha) reported: We were in this state that we heard the clanging noise of arms. lie (the Holy Prophet) said: Who is it? He said: This is Sa'd b. Abi Waqqas. Allah's Messenger (ﷺ) said to him: What brings you here? Thereupon he said: I harboured fear (lest any harm should come to) Allah's Messenger (ﷺ), so I came to serve as your sentinel. Allah's Messenger (ﷺ) invoked blessings upon him. He then slept. This hadith has been transmitted on the authority of Ibn Rumh with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": "2410.03",
			"text": "Abdullah b. 'Amir b. Rabi reported A'isha as saying:Allah's Messenger (ﷺ) went to bed one night; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": "2411.01",
			"text": "Abdullah b. Shaddad reported that he heard `Ali saying:Allah's Messenger (ﷺ) did not gather his parents except in case of Sa`d b. Malik that he said to him on the Day of Uhud: Shoot an arrow, may my father and mother be taken as ransom for you",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": "2411.02",
			"text": "This hadith has been narrated on the authority of 'Ali through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": "2412.01",
			"text": "Sa'd b Abi Waqqqs said:Allah's Messenger (may peace he upon him) gathered his parents for me on the Day of Uhud",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": "2412.02",
			"text": "This hadith has been narrated on the authority of Yabyl b. Sa'id with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": "2412.03",
			"text": "Amir b. Sa'd reported oLi the authority of his father that Allah's Apostle (ﷺ) gathered for him on the Day of Uhud his parents when a polytheist had set fire to (i. e. attacked fiercely) the Muslims. Thereupon Allah's Apostle (ﷺ) said to him:(Sa'd), shoot an arrow, (Sa'd), may my mother and father be taken as ransom for you. I drew an arrow and I shot a featherless arrow at him aiming his side that lie fell down and his private parts were exposed. Allah's Messenger (ﷺ) laughed that I saw his front teeth",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": "1748.03",
			"text": "Mus'ab b. Sa'd reported on the authority of his father that many verses of the Qur'an had been revealed in connection with him. His mother Umm Sa'd had taken oath that she would never talk with him until he abandoned his faith and she neither ate nor drank and said:Allah has commanded you to treat well your parents and I am your mother and I command you to do this. She passed three days in this state until she fainted because of extreme hunger and at that time her son whose name was Umara stood up and served her drink and she began to curse Sa'd that Allah, the Exalted and Glorions, revealed these verses of the Holy Qur'an:\" And We have enjoined upon a person goodness to his parents but if they contend with thee to associate (others) with Me of which you have no knowledge, then obey them not\" (xxix. 8) ; Treat thein with customary good in this world\" (xxxi. 15). He also reported that there fell to the lot of Allah's Messenger (ﷺ) huge spoils of war and there was one sword in them. I picked that up and came to Allah's Messenger (ﷺ) and said: Bestow this sword upon me (as my share in the spoils of war) and you know my state. Thereupon he said: Return it to the place from where you picked it up. I went back until I decided to throw it in a store but my soul repulsed me so I came back and asked him to give that sword to me. He said in a loud voice to return it to the place from where I had picked it up. It was on this occasion that this verse was revealed:\" They asked about the spoils of war\" (viii. 1). He further said: I once fell ill and sent a message to Allah's Apostle (ﷺ). He visited me and I said to him: Permit me to distribute (in charity) my property as much as I like. He did not agree. I said: (Permit me to distribute) half of it. He did not agree. I said: (Permit me to distribute) the third part, whereupon he kept quiet and it was after this (that the distribution of one's property in charity) to the extent of one-third was held valid. He further said: I came to a group of persons of the Ansir and Muhajirin and they said: Come, so that we may serve you wine, and it was before the use of wine had been prohibited. I went to them in a garden and there had been with them the roasted head of a camel and a small water-skin containing wine. I ate and drank along with them and there came under discussion the Ansr (Helpers) and Muhajirin (immigrants). I said: The immigrants are better than the Ansar, that a person picked up a portion of the head (of the camel and struck me with it that my nose was injured. I came to Allah's Messenger (ﷺ) and informed him of the situation that Aliah, the Exalted and Glorious, revealed verses pertaining to wine:\" Intoxicants and the games of chance and (sacrificing to) stones set up and (divining by) arrows are only an uncleanliness, the devil's work\" (v. 90)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": "1748.04",
			"text": "This hadith has been transmitted on the authority of Simak and the hadith transmitted on the authority of Shu'ba (the words are):When they intended to feed her (Sa'd'. s mother), they opened her mouth with the help of a stick and then put the feed in her mouth, and in the same hadith the words are: He struck the nose of Sa'd and it was injured and Sa'd had (the mark) of wound on his nose",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": "2413.01",
			"text": "Sa'd reported:This verse was revealed in relation to six persons and I and Ibn Mas'ud were amongst them. The polytheists said to him (the Holy Prophet): Do not keep such persons near you. It was upon this that (this verse was revealed):\" Drive not away those who call upon their Lord morning and evening desiring only His pleasure\" (vi. 52)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": "2413.02",
			"text": "Sa'd reported:We were six men in the company of Allah's Messenger (, nay peace be upon him) that the polytheists said to Allah's Apostle (ﷺ): Drive them away so that they may not be overbold upon us. He said: I, Ibn Mas'ud and a person from the tribe of Hudhail, Bilal and two other persons, whose names I do not know (were amongst such persons). And there occurred to Allah's Messenger (ﷺ) what. Allah wished and he talked with himself that Allah, the Exalted and Glorious, revealed:\" Do not drive away those who call their Lord morning and evening desiring to seek His pleasure",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": "2414",
			"text": "Abu 'Uthman reported on one of the days when Allah's Messenger (ﷺ) was fighting and none remained with him save Talha and Sa'd",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": "2415.01",
			"text": "Jabir b. Abdullah reported:I heard Allah's Messenger (ﷺ) exhorting people on the Day of the Battle of the Ditch to fight. Zubair said: I am ready (to participate). He then again exhorted and he again said: I am ready to participate. Thereupon Allah's Messenger (ﷺ) said: Behold. for every Prophet there is a helper and my helper is Zubair",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": "2415.02",
			"text": "Jabir reported this hadith through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": "2416.01",
			"text": "Abdullah b. Zubair reported on the Day of the Battle of the Trench:I and Umar b. Abu Salama were with women folk in the fort of Hassan (b. Thabit). He at one time leaned for me and I cast a glance and at anothertime I leaned for him and he would see and I recognised my father as he rode on his horse with his arms towards the tribe of Quraizah. 'Abdullah b. 'Urwa reported from Abdullah b. Zubair: I made a mention of that to my father, whereupon he said: My son, did you see me (on that occasion)? He said: Yes. Thereupon he said: By Allah, Allah's Messenger (ﷺ) addressed me saying: I would sacrifice for thee my father and my mother",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": "2416.02",
			"text": "Abdullah b. Zubair reported:When it was the Day of the Battle of the Ditch I and 'Umar b. Salama were in the fort in which there were women, i. e. the wives of Allah's Apostle (ﷺ) ; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": "2417.01",
			"text": "Abu Huraira reported:Allah's Messenger (ﷺ) was upon the mountain of Hira, ' and there were along with him Abu Bakr, Umar, Uthman. 'Ali, Talha, 'Zubair, that the mountain stirred; thereupon Allah's Messenger (ﷺ) said: Be calm, there is none upon you but a Prophet, a Fiddle (the testifier of truth) and a Martyr",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": "2417.02",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) was on the mountain of Hira' that it stirred; thereupon Allah's Messenger (ﷺ) said:Hira! be calm, for there is none upon you but a Prophet, a Siddiq, a Shahid, and there were upon it Allah's Prophet (ﷺ), Abu Bakr, 'Umar, Uthman, 'Ali, Talha, Zubair, Sa'd b. Abi Waqqas (Allah be pleased witli them)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": "2418.01",
			"text": "Hisham reported on the authority of his father ('Urwa b. Zubair) that A'isha said:BY Allah, both fathers of yours are amongst those who have been men. tioned in this verse:\" Those who responded to the call of Allah and the Messenger after the misfortune had fallen upon thein",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": "2418.02",
			"text": "This hadith has been narrated on the authority of Hishan through the same chain of transmitters but with this addition (that by both fathers of yours) he meant Abu Bakr and Zubair",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": "2418.03",
			"text": "Urwa reported:'Aisha said to me: Your fathers (Zubair and Abu Bakr) were amongst those about whom (it has been revealed):\" Those who responded to the call of Allah and His Messenger after the misfortune had fallen upon them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": "2419.01",
			"text": "Anas reported Allah's Messenger (ﷺ) as saying:For every Umma there is a man of trust and the man of trust of this Umma is Abu 'Ubaida b. Jarrah",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": "2419.02",
			"text": "Anas reported that the people of Yemen came to Allah's Messenger (ﷺ) and said:Send with us a person who should teach us Sunnah and al-Islam, whereupon he (the Holy Prophet) caught hold of the hand of Ubaida and said: He is a man of trust of this Umma",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": "2420.01",
			"text": "Hudhaifa reported that the people of Najran came to Allah's Messenger (ﷺ) and said:Allah's Messenger, send along with us a man of trust; whereupon he said: I would definitely send to you a man of trust, a man of trust in the true sense of the term. Thereupon his Companions looked up eagerly and he sent Abu Ubaida b. Jarrah",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": "2420.02",
			"text": "This hadith has been reported on the authority of Abu Ishaq with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": "2421.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying to Hasan:O Allah, behold, I love him. Thou too love him and love one who loves him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": "2421.02",
			"text": "Abu Huraira reported:I went along with Allah's Messenger (ﷺ) at a time during the day but he did not talk to me and I did not talk to him until he reached the market of Bani Qainuqa`. He came back to the tent of Fatima and said: Is the little chap (meaning Hasan) there? We were under the impression that his mother had detained him in order to bathe him and dress him and garland him with a sweet garland. Not much time had passed that he (Hasan) came running until both of them embraced each other, thereupon Allah's Messenger (ﷺ) said: O Allah, I love him; love him Thou and love one who loves him (Hasan)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": "2422.01",
			"text": "Al-Bara' b. Azib reported:I saw Hasan b. 'Ali upon the shoulders of Allah's Apostle (ﷺ) and he was saying: O Allah, I love him, and love him Thou",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": "2422.02",
			"text": "Al-Bara' b. Azib reported:I saw the Messenger of Allah (ﷺ) with Al-Hasan b. 'Ali placed upon his shoulders and he was saying: O Allah, I love him, and love him Thou",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": "2423",
			"text": "Iyas reported on the authority of his father:I (had the honour of) leading the white mule on which rode Allah's Apostle (ﷺ) and with him were Hasan and Husain, till it reached the apartment of Allah's Apostle (ﷺ). The one amongst them was seated before him and the other one was seated behind him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": "2424",
			"text": "A'isha reported that Allah's Apostle (ﷺ) went out one norning wearing a striped cloak of the black camel's hair that there came Hasan b. 'Ali. He wrapped hitn under it, then came Husain and he wrapped him under it along with the other one (Hasan). Then came Fatima and he took her under it, then came 'Ali and he also took him under it and then said:Allah only desires to take away any uncleanliness from you, O people of the household, and purify you (thorough purifying)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": "2425.01",
			"text": "Salim b. 'Abdullah reported on the authority of his father:We were in the habit of calling Zaid b. Harith as Zaid b. Muhammad until it was revealed in the Qur'an:\" Call them by the names of their fathers. This is more equitable with Allah\" (This hadith has been transmitted on the authority of Qutaiba b. Sa'd)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": "2425.02",
			"text": "This hadith has been narrated on the authority 'Abdullah through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": "2426.01",
			"text": "Ibn 'Umar reported that Allah's Messenger (ﷺ) sent an expedition and appointed Usama b. Zaid as its chief. The people objected to his command, whereupon Allah's Messenger (ﷺ) stood up and said:You object to his command and before this you objected to the command of his father (Zaid). By Allah, he was fit as the commander and he was one of the dearest of persons to me and after him, behold! this one (Usama) is one of the dearest of persons to me",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": "2426.02",
			"text": "Salim reported on the authority of his father that Allah's Messenger (ﷺ) said on the pulpit:You object to the command of Usima b. Zaid as you had objected before to the command of his father (Zaid). By Allah, he was most competent for it and, by Allah, he was dearest to me amongst people and, by Allah, the same is the case with Usama b. Zaid. He is most dear to me after him and I advise you to treat him well for he is pious amongst you",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": "2427.01",
			"text": "Abdullah b. Abu Mulaika reported that Abdullah b. Jafar said to Ibn Zubair:Do you remember (the occasion) when we three (i. e. I, you and lbn 'Abbas) met Allah's Messenger (ﷺ) and he mounted us (on his camel) but left you? He said: Yes",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": "2427.02",
			"text": "This hadith has been transmitted on the authority of Habib b. Ash-Shahid",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": "2428.01",
			"text": "Abdullah b. Ja'far reported that when Allah's Messenger (may peace be, upon him) came back from a journey, the children of his family used to accord him welcome. It was in this way that once he came back from a journey and I went to him first of all. He mounted me before him. Then there came one of the two sons of Fatima and he mounted him behind him and this is how we three entered Medina riding on a beast",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": "2428.02",
			"text": "Abdullah b. Ja'a'far reported that when Allah's Messenger (ﷺ) came back from a journey he met us. Once he met me, Hasan or Husain, and he mounted one of us before him and the other one behind him until we entered Medina",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": "2429",
			"text": "Abdullah b. Ja'far reported that one day Allah's Messenger (ﷺ) mounted me behind him and narrated to me something in secret which I would narrate to none amongst people",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": "2430",
			"text": "Abdullah b. Ja`far reported that he heard `Ali say in Kufa that Allah's Messenger (ﷺ) said:The best of the women of her time was Mary, daughter of `Imran, and the best of the women of her time was Khadija, daughter of Khuwailid. Abu Kuraib said that Waki` pointed towards the sky and the earth",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": "2431",
			"text": "Abu Musa reported Allah's Messenger (ﷺ) as saying:There are many persons amongst men who are quite perfect but there are none perfect amongst women except Mary, daughter of 'Imran, Asiya wife of Pharaoh, and the excellence of 'A'isha as compared to women is that of Tharid over all other foods",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": "2432",
			"text": "Abu Huraira reported that Gabriel came to Allah's Apostle (ﷺ) and said:Allah's Messenger, lo. Khadija is coming to you with a vessel of seasoned food or drink. When she comes to you, offer her greetings from her Lord, the Exalted and Glorious, and on my behalf and give her glad tidings of a palace of jewels in Paradise wherein there is no noise and no toil. This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": "2433.01",
			"text": "Ismail reported:I said to 'Abdullah b. Abi Aufa: Did Allah's Messenger (ﷺ) give glad tidings of Paradise to Khadija? He said: Yes. He did give glad tidings to her of a palace of jewels in Paradise wherein there would be no noise and no toil",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": "2433.02",
			"text": "This hadith has been narrated on the a tliority of Ibn Abi Aufa through other chains of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": "2434",
			"text": "A'isha reported that Allah's Messenger (may peace he upon him) gave glad tidings to Khadija bint Khuwailid of a palace in Paradise",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": "2435.01",
			"text": "A'isha reported:Never did I feel jealous of any woman as I was jealous of Khadija. She had died three years before he (the Holy Prophet) married me. I often heard him praise her, and his lord, the Exalted and Glorious, had commanded him to give her the glad tidings of a palace of jewels in Paradise: and whenever he slaughtered a sheep he presented (its meat) to her female companions",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": "2435.02",
			"text": "A'isha reported:Never did I feel jealous of the wives of Allah's Apostle (ﷺ) but in case of Khadija, although I did no, (have the privilege to) see her. She further added that whenever Allah's Messenger (ﷺ) slaughtered a sheep, he said: Send it to the companions of Khadija I annoyed him one day and said: (It is) Khadija only who always prevails upon your mind. Thereupon Allah's Messenger (ﷺ) said: Her love had been nurtured in my heart by Allah Himself",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": "2435.03",
			"text": "This hadith has been transmitted on the authority of Abu Usama up to the slaughtering of a sheep, but he. did not make mention of the subsequent words",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": "2435.04",
			"text": "A'isha reported:Never did I feel jealous of any wife amongst the wives of Allah's Apostle (ﷺ) as I feel in case of Khadija (though I had never seen her), for he praised her very often",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": "2436",
			"text": "A'isha reported that Allah's Apostle (ﷺ) did not marry any other woman till her (Khadija's) death",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6282,
			"arabicnumber": "2437",
			"text": "A'isha reported that Hala b. Khuwailid (sister of Khadija) sought permission from Allah's Messenger (ﷺ) to see him and he was reminded of Khadija's (manner of) asking leave to enter and (was overwhelmed) with emotions thereby and said:O Allah, it is Hala, daughter of Khuwailid, and I felt jealous and said: Why do you remember one of those old women of the Quraish with gums red and who is long dead-while Allah has given you a better one in her stead?",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": "2438.01",
			"text": "A'isha reported Allah's Messenger (ﷺ) having said:I saw you in a dream for three nights when an angel brought you to me in a silk cloth and he said: Here is your wife, and when I removed (the cloth) from your face, lo, it was yourself, so I said: If this is from Allah, let Him carry it out",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": "2438.02",
			"text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6285,
			"arabicnumber": "2439.01",
			"text": "A'isha reported:Allah's Messenger (ﷺ) said to me: I can well discern when you are pleased with me and when you are annoyed with me. I said: How do you discern it? Thereupon be said: When you are pleased with me you say;\" No, by the Lord of Muhammad,\" and when you are annoyed with me, you say:\" No, by the Lord of Ibrahim.\" I said: Allah's Messenger, by Allah, I in fact leave your name (when I am annoyed with you)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": "2439.02",
			"text": "This hadith has been reported on the authority of Hishim b. 'Urwa with the same chain of transmitters up to the words:\" No, by the Lord of Ibrahim,\" and he did not make mention of what follows subsequently",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": "2440.01",
			"text": "A'isha reported that she used to play with dolls in the presence of Allah's Messenger (ﷺ) and when her playmates came to her they left (the house) because they felt shy of Allah's Messenger (ﷺ), whereas Allah's Messenger (ﷺ) sent them to her",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": "2440.02",
			"text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": "2441",
			"text": "A'isha reported that people sent their gifts when it was the turn of 'A'isha seeking thereby the pleasure of Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": "2442.01",
			"text": "A'isha, the wife of Allah's Apostle (ﷺ), said:The wives of Allah's Apostle (ﷺ) sent Fatima, the daughter of Allah's Messenger (ﷺ), to Allah's Apostle (ﷺ). She sought permission to get in as he had been lying with me in my mantle. He gave her permission and she said: Allah's Messenger, verily, your wives have sent me to you in order to ask you to observe equity in case of the daughter of Abu Quhafa. She (`A'isha) said: I kept quiet. Thereupon Allah's Messenger (ﷺ) said to her (Fatima): O daughter, don't you love whom I love? She said: Yes, (I do). Thereupon he said: I love this one. Fatima then stood up as she heard this from Allah's Messenger (ﷺ) and went to the wives of Allah's Apostle (ﷺ) and informed them of what she had said to him and what Allah's messenger (ﷺ) had said to her. Thereupon they said to her: We think that you have been of no avail to us. You may again go to Allah's Messenger (ﷺ) and tell him that his wives seek equity in case of the daughter of Abu Quhafa. Fatima said: By Allah, I will never talk to him about this matter. `A'isha (further) reported: The wives of Allah's Apostle (ﷺ) then sent Zainab b. Jahsh, the wife of Allah's Apostle (ﷺ), and she was one who was somewhat equal in rank with me in the eyes of Allah's Messenger (ﷺ) and I have never seen a woman more advanced in religious piety than Zainab, more God-conscious, more truthful, more alive to the ties of blood, more generous and having more sense of self-sacrifice in practical life and having more charitable disposition and thus more close to God, the Exalted, than her. She, however, lost temper very soon but was soon calm. Allah's Messenger (ﷺ) permitted her to enter as she (`A'isha) was along with Allah's Messenger (ﷺ) in her mantle, in the same very state when Fatima had entered. She said: Allah's Messenger, your wives have sent me to you seeking equity in case of the daughter of Abu Quhafa. She then came to me and showed harshness to me and I was seeing the eyes of Allah's Messenger (ﷺ) whether he would permit me. Zainab went on until I came to know that Allah's Messenger (ﷺ) would not disapprove if I retorted. Then I exchanged hot words until I made her quiet. Thereupon Allah's Messenger (ﷺ) smiled and said: She is the daughter of Abu Bakr",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": "2442.02",
			"text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters, but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": "2443",
			"text": "A'isha reported that Allah's Messenger (ﷺ) during his last illness) inquired:Where I would be tomorrow, where I would be tomorrow (thinking, that the turn of 'A'isha was not very near) and when it was my turn, Allah called him to his Heavenly Home and his head was between my neck and chest",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": "2444.01",
			"text": "A'isha reported that Allah's Messenger (ﷺ) at the time of breathing his last was reclining against her chest and she was leaning over him and listening to him as he was saying:O Allah, grant me pardon, show mercy to me, enjoin me to companions (on High)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": "2444.02",
			"text": "This hadith has been narrated on the authority of Hisham through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": "2444.03",
			"text": "A'isha reported:I heard that never a prophet dies until he is given an option to opt the life of (this) world or that of the Hereafter. She further said: I heard Allah's Messenger (ﷺ) say in his last illness in which he' died. I heard him saying in gruffness of the voice: Along with those persons upon whom Allah bestowed favours from amongst the Apostles, the testifiers of truth, the martyrs, the pious and goodly company are they (iv. 69). (It was on bearing these words) that I thought that he had been given choice (and he opted to live with these pious persons in the Paradise)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": "2444.04",
			"text": "This hadith has been narrated on the authority of Sa'd with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": "2444.05",
			"text": "A'isha, the wife of Allah's Apostle (ﷺ), reported that he used to say:Never a prophet dies in a state that he is not made to see his abode in Paradise, and then given a choice. 'A'isha said that when Allah's Messenger (ﷺ) was about to leave the world, his head was over her thigh and he had fallen into swoon three times. When he felt relief his eyes were fixed at the ceiling. He then said: O Allah, along with the high companions (i. e. along with the Apostles who live in the most elevated place of the Paradise). (On hearing these words), I then said (to myself) He is not going to opt us and I remembered a hadith which he had narrated to us as he was healthy and in which he said: No prophet dies until he sees his abode in Paradise, he is then given a choice. 'A'isha said: These were the last words which Allah's Messenger (ﷺ) spoke (the words are): O Allah, with companions on High",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": "2445",
			"text": "A'isha reported that when Allah's Messenger (ﷺ) set ont on a journey, he used to cast lots amongst his wives. Once this lot came out in my favour and that of Hafsa. They (Hafsi, and 'A'isha) both went along with him and Allah's Messenger (ﷺ) used to travel (on camel) when it was night along with 'A'isha and talked with her. Hafsa said to 'A'isha:Would you like to ride upon my camel tonight and allow me to ride upon your camel and you would see (what you do not generally see) and I would see (what I do not see) generally? She said: Yes. So 'A'isha rode upon the camel of Hafsa and Hafsa rode upon the camel of 'A'isha and Allah's Messenger (ﷺ) came near the camel of 'A'isha. (whereas) Hafsa had been riding over that. He greeted her and then rode with her until they came down. She ('A'isha) thus missed (the company of the Holy Prophet) and when they sat down, 'A'isha felt jealous. She put her foot in the grass and said: O Allah, let the scorpion sting me or the serpent bite me. And so far as thy Messenger is concerned, I cannot say anything about him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": "2446.01",
			"text": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:The excellence of 'A'isha over women is like the excellence of Tharid over all other foods",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": "2446.02",
			"text": "This hadith has been narrated on the authority of Anas b. Malik through other chains of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": "2447.01",
			"text": "A'isha reported that Allah's Messenger (ﷺ) said to her:Gabriel offered you greetings and I said: So there should be peace and mercy of Allah upon him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": "2447.02",
			"text": "This hadith has been narrated on the authority of 'A'isha through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": "2447.03",
			"text": "This hadith has been narrated on the authority of Zakriyya' through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6304,
			"arabicnumber": "2447.04",
			"text": "A'isha, the wife of Allah's Apostle (ﷺ), reported that Allah's Messenger (ﷺ) said:'A'isha, here is Gabriel offering you greetings. She said: 1 made a reply: Let there be peace and blessings of Allah upon him, and added: He sees what I do not see",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6305,
			"arabicnumber": "2448.01",
			"text": "A'isha reported that (one day) there sat together eleven women making an explicit promise amongst themselves that they would conceal nothing about their spouses. The first one said:My husband is a sort of the meat of a lean camel placed at the top of a hill, which it is difficult to climb up, nor (the meat) is good enough that one finds in oneself the urge to take it away (from the top of that mountain). The second one said: My husband (is so bad) that I am afraid I would not be able to describe his faults-both visible and invisible completely. The third one said: My husband is a long-statured fellow (i. e. he lacks intelligence). If I give vent to my feelings about him, he would divorce me, and if I keep quiet I would be made to live in a state of suspense (neither completely abandoned by him nor entertained as wife). The fourth one said: My husband is like the night of Tihama (the night of Hijaz and Mecca), neither too cold nor hot, neither there is any fear of him nor grief. The fifth one said: My husband is (like) a leopard as he enters the house, and behaves like a lion when he gets out, and he does not ask about that which he leaves in the house. The sixth one said: So far as my husband is concerned, he eats so much that nothing is left back and when he drinks he drinks that no drop is left behind. And when he lies down he wraps his body and does not touch me so that he may know my grief. The seventh one said: My husband is heavy in spirit, having no brightness in him, impotent, suffering from all kinds of conceivable diseases, heaving such rough manners that he may break my head or wound my body, or may do both. The eighth one said: My husband is as sweet as the sweet-smelling plant, and as soft as the softness of the hare. The ninth one said: My husband is the master of a lofty building, long-statured, having heaps of ashes (at his door) and his house is near the meeting place and the inn. The tenth one said: My husband is Malik, and how fine Malik is, much above appreciation and praise (of mine). He has many folds of his camel, more in number than the pastures for them. When they (the camels) hear the sound of music they become sure that they are going to be slaughtered. The eleventh one said: My husband is Abu Zara'. How fine Abu Zara' is! He has suspended in my ears heavy ornaments and (fed me liberally) that my sinews and bones are covered with fat. So he made me happy. He found me among the shepherds living in the side of the mountain, and he made me the owner of the horses, camels and lands and heaps of grain and he finds no fault with me. I sleep and get up in the morning (at my own sweet will) and drink to my heart's content. The mother of Abu Zara', how fine is the mother of Abu Zara'! Her bundles are heavily packed (or receptacles in her house are filled to the brim) and the house quite spacious. So far as the son of Abu Zara' is concerned, his bed is as soft as a green palm-stick drawn forth from its bark, or like a sword drawn forth from its scabbard, and whom just an arm of a lamb is enough to satiate. So far as the daughter of Abu Zara' is concerned, how fine is the daughter of Abu Zara', obedient to her father, obedient to her mother, wearing sufficient flesh and a source of jealousy for her co-wife. As for the slave-girl of Abu Zara', how fine is she; she does not disclose our affairs to others (outside the four walls of the house). She does not remove our wheat, or provision, or take it forth, or squander it, but she preserves it faithfully (as a sacred trust). And she does not let the house fill with rubbish. One day Abu Zara' went out (of his house) when the milk was churned in the vessels, that he met a woman, having two children like leopards playing with her pomegranates (chest) under her vest. He divorced me (Umm Zara') and married that woman (whom Abu Zara') met on the way. I (Umm Zara') later on married another person, a chief, who was an expert rider, and a fine archer: he bestowed upon me many gifts and gave me one pair of every kind of animal and said: Umm Zara', make use of everything (you need) and send forth to your parents (but the fact) is that even if I combine all the gifts that he bestowed upon me, they stand no comparison to the least gift of Abu Zara'. 'A'isha reported that Allah's Messenger (ﷺ) said to me: I am for you as Abu Zara' was for Umm Zara",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6306,
			"arabicnumber": "2448.02",
			"text": "This hadith has been transmitted on the authority of Hisham b. 'Urwa but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6307,
			"arabicnumber": "2449.01",
			"text": "Miswar b. Makhramali reported that he heard Allah's Messenger (ﷺ) say, as he sat on the pulpit:The sons of Hisham b. Mughira have asked my permission to marry their daughter with 'Ali b. Abi Talib (that refers to the daughter of Abu Jahl for whom 'All had sent a proposal for marriage). But I would not allow them, I would not allow them, I would not allow them (and the only alternative possible is) that 'Ali should divorce my daughter (and then marry their daughter), for my daughter is part of me. He who disturbs her in fact disturbs me and he who offends her offends me",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6308,
			"arabicnumber": "2449.02",
			"text": "Miswar b. Makhramah reported Allah's Messenger (ﷺ) as saying:Fatima is a part of me. He in fact tortures me who tortures her",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6309,
			"arabicnumber": "2449.03",
			"text": "(Imam Zain-ul-'Abidin) 'Ali b. Husain reported that when they came to Medina from Yazid b. Mu'awiya after the martyrdom of Husain b. 'Ali (Allah be pleased with him) Miswar b. Makhramah met him and said to him:Is there any work for me which you ask me to do? I said to him: No. He again said to me: Would you not give me the sword of Allah's Messenger (ﷺ) for I fear that the people may snatch it from you? By Allah, if you give that to me, no one would be able to take it away, so long as there is life in me. Verily 'Ali b. Abi Talib sent a proposal of marriage to the daughter of Abu Jahl in spite of (the fact that his wife) Fatima (had been living in his house). Thereupon I heard Allah's Messenger (ﷺ) say while addressing the people on the pulpit. I was adolescing in those days. He said: Fatima is a part of me and I fear that she may be put to trial in regard to religion. He then made a mention of his son-in law who had been from the tribe of 'Abd Shams and praised his behaviour as a son-in-law and said: Whatever he said to me he told the truth and whatever he promised he fulfilled it for me. I am not going to declare forbidden what is lawful and make lawful what is forbidden, but, by Allah, the daaghter of Allah's Messenger and the daughter of the enemy of Allah can never be combined at one place",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6310,
			"arabicnumber": "2449.04",
			"text": "Ali b. Husain reported that Miswar b. Makhramah informed him that 'Ali b. Abi Talib sent the proposal of marriage to the daughter of Abu Jahl as he had Fatima, the daughter of Allah's Messenger (ﷺ), (as his wife). When Fatima heard about it, she came to Allah's Apostle (ﷺ) and said:The people say that you never feel angry on account of your daughters and now 'Ali is going to marry the daughter of Abu Jahl. Makhramah said: Thereupon Allah's Messenger (ﷺ) rose up and I heard him reciting Tashahhud and say: Now to the point. I gave a daughter of mine (Zainab) to Abu'l-'As b. Rabi, and he spoke to me and spoke the truth. Verily Fatima, the daughter of Muhammad, is a part of me and I do not approve that she may be put to any trial and by Allah, the daughter of Allah's Messenger cannot be combined with the daughter of God's enemy (as the co-wives) of one person. Thereupon 'Ali gave up (the idea of his intended) marriage",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6311,
			"arabicnumber": "2449.05",
			"text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6312,
			"arabicnumber": "2450.01",
			"text": "A'isha reported that Allah's Messenger (ﷺ) called his daughter Fatima (during his last illness). He said. to her something secretly and she wept. He again said to her something secretly and she laughed. 'A'isha further reported that she said to Fatima:What is that which Allah's Messenger (ﷺ) said to you secretly and you wept and then said to you something secretly and you laughed? Thereupon she said: He informed me secretly of his death and so I wept. He then again informed me secretly that I would be the first amongst the members of his family to follow him and so I laughed",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6313,
			"arabicnumber": "2450.02",
			"text": "A'isha reported:We, the wives of Allah's Apostle (ﷺ), were with him (during his last illness) and none was absent therefrom that Fatima, who walked after the style of Allah's Messenger (ﷺ), came there, and when he saw her he welcomed her saying: You are welcome, my daughter. He their made her sit on his right side or on his left side. Then he said something secretly to her and she wept bitterly and when he found her (plunged) in grief he said to her something secretly for the second time and she laughed. I ('A'isha) said to her: Allah's Messenger has singled you amongst the women (of the family) for talking (to you something secretly) and you wept. When Allah's Messenger (ﷺ) recovered from illness, I said to her. What did Allah's Messenger (ﷺ) say to you? Thereupon she said: I am not going to disclose the secret of Allah's Messenger (ﷺ). When Allah's Messenger (ﷺ) died, I said to her: I adjure you by the right that I have upon you that you should narrate to me what Allah's Messenger (ﷺ) said to you. She said: Yes, now I can do that (so listen to it). When he talked to me secretly for the first time he informed me that Gabirel was in the habit of reciting the Qur'an along with him once or twice every year, but this year it had been twice and so he perceived his death quite near, so fear Allah and be patient (and he told me) that he would be a befitting forerunner for me and so I wept as you saw me. And when he saw me in grief he talked to me secretly for the second time and said: Fatima, are you not pleased that you should be at the head of the believing women or the head of this Umma? I laughed and it was that laughter which you saw",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6314,
			"arabicnumber": "2450.03",
			"text": "A'isha reported that all the wives of Allah's Apostle (ﷺ) had gathered (in her apartment) during the days of his (Prophet's) last illness and no woman was left behind that Fatima, who walked after the style of Allah's Messenger (ﷺ), came there. He welcomed her by saying:You are welcome, my daughter, and made her sit on his right side or on his left side, and then talked something secretly to her and Fatima wept. Then he talked something secretly to her and she laughed. I said to her: What makes you weep? She said: I am not going to divulge the secret of Allah's Messenger (ﷺ). I (`A'isha) said: I have not seen (anything happening) like today, the happiness being more close to grief (as I see today) when she wept. I said to her: Has Allah's Messenger (ﷺ) singled you out for saying something leaving us aside? She then wept and I asked her what he said, and she said: I am not going to divulge the secrets of Allah's Messenger (ﷺ). And when he died I again asked her and she said that he (the Holy Prophet) told her: Gabriel used to recite the Qur'an to me once a year and for this year it was twice and so I perceived that my death had drawn near, and that I (Fatima) would be the first amongst the members of his family who would meet him (in the Hereafter). He shall be my good forerunner and it made me weep. He again talked to me secretly (saying): Aren't you pleased that you should be the sovereign amongst the believing women or the head of women of this Ummah? And this made me laugh",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6315,
			"arabicnumber": "2451",
			"text": "Salman reported:In case it lies in your power don't be one to enter the bazar first and the last to get out of that because there is a bustle and the standard of Satan is set there. He said: I was informed that Gabriel (Allah be pleased with him) came to Allah's Apostle (ﷺ) and there was with him Umin Salama and he began to talk with him. He then stood up, whereupon Allah's Apostle (ﷺ) said to Umm Salama: (Do you know) who was he and what did he say? She said: He was Dihya (Kalbi). He reported Umm Salama having said: By Allah, I did not deem him but only he (Dihya) until I heard the address of Allah's Apostle (ﷺ) informing him about us. He (the narrator) said: I said to Uthman: From whom did you hear it? He said: From Usima b. Zaid",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6316,
			"arabicnumber": "2452",
			"text": "A'isha, the Mother of the Faithful, reported that Allah's Messenger (ﷺ) said:One who has the longest hands amongst you would meet me most immediately. She farther said: They (the wives of Allah's Apostle) used to measure the hands as to whose hand was the longest and it was the hand of Zainab that was the longest amongst them, as she used to work with her hand and Spend (that income) on charity",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6317,
			"arabicnumber": "2453",
			"text": "Anas reported that Allah's Messenger (ﷺ) went to Umm Aiman and I went along with him and she served him a drink in a vessel and he reported that the narrator said:I do not know whether it was because of the fasting (or for any other reason) that he (the Holy Prophet) refused to accept that. She raised her voice and showed annoyance to him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6318,
			"arabicnumber": "2454",
			"text": "Anas reported that after the death of Allah's Messenger (ﷺ) Abu Bakr said to 'Umar:Let us visit Umm Aiman as Allah's Messenger (ﷺ) used to visit her. As we came to her, she wept. They (Abu Bakr and Umar) said to her: What makes you weep? What is in store (in the next world) for Allah's-Messenger (ﷺ) is better than (this worldly life). She said: I weep not because I am ignorant of the fact that what is in store for Allah's Messenger (ﷺ) (in the next world) is better than (this world), but I weep because the revelation which came from the Heaven has ceased to come. This moved both of them to tears and they began to weep along with her",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6319,
			"arabicnumber": "2455",
			"text": "Anas reported that Allah's Apostle (ﷺ) did not enter the house of any woman except that of his wives and that of Umm Sulaim. He used to visit her. It was said to him why it was so, whereupon he said:I feel great compassion for her. Her brother was killed while he was with me",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6320,
			"arabicnumber": "2456",
			"text": "Anas reported that Allah's Apostle (ﷺ) said:I entered Paradise and heard the noise of steps. I said: Who is it? They said: She is Ghumaisa, daughter of Milhan, the mother of Anas b. Malik",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6321,
			"arabicnumber": "2457",
			"text": "Jabir b. 'Abdullah reported that Allah's Messenger (ﷺ) said:I was shown Paradise and I saw the wife of Abu Talha (i.e. Umm Sulaim) and I heard the noise of steps before me and, lo, it was that of Bilal",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6322,
			"arabicnumber": "2144.04",
			"text": "Anas reported that the son of Abu Talba who was born of Umm Sulaim died. She (Umm Sulaim) said to the members of her family:Do not narrate to Abu Talha about his son until I narrate it to him. Abu Talha came (home) ; she presented to him the supper. He took it and drank water. She then embellished herself which she did not do before. He (Abu Talha) had a sexual intercourse with her and when she saw that he was satisfied after sexual intercourse with her, she said: Abu Talha, if some people borrow something from another family and then (the members of the family) ask for its return, would they resist its return? He said: No. She said: I inform you about the death of your son. He was annoyed, and said: You did not inform me until I had a sexual intercourse with you and you later on gave me information about my son. He went to Allah's Messenger (ﷺ) and informed him what had happened. Thereupon Allah's Messenger (ﷺ) said: May Allah bless both of you in the night spent by you! He (the narrator) said: She became pregnant. Allah's Messenger (may peace he upon him) was in the course of a journey and she was along with him and when Allah's Messenger (ﷺ) came back to Medina from the journey he did not enter (his house) (during the night). When the people came near Medina, she felt the pangs of delivery. He (Abu Talha) remained with her and Allah's Messenger (ﷺ) proceeded on. Abu Talha said: O Lord, you know that I love to go along with Allah's Messenger when he goes out and enter along with him when he enters and I have been detained as Thou seest. Umm Sulaim said: Abu Talha, I do not feel (so much pain) as I was feeling formerly, so better proceed on. So we proceeded on and she felt the pangs of delivery as they reached (Medina) and a child was born and my mother said to me: Anas, none should suckle him until you go to Allah's Messenger (ﷺ) tomorrow morning. And when it was morning I carried him (the child) and went along with him to Allah's Messenger (may peace beupon him). He said: I saw that he had in his hand the instrument for the cauterisation of the camels. When he saw me. he said: This is, perhaps, what Umm Sulaim has given birth to. I said: Yes. He laid down that instrument on the ground. I brought that child to him and placed it in his lap and Allah's Messenger (ﷺ) asked Ajwa dates of Medina to be brought and softened them in his month. When these had become palatable he placed them in the mouth of that child. The child began to taste them. Then Allah's Messenger (ﷺ) said: See what love the Ansar have for dates. He then wiped his face and named him 'Abdullah",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6323,
			"arabicnumber": "2144.05",
			"text": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6324,
			"arabicnumber": "2458",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) said to Bilal:Bilal, narrate to me which act at the time of morning prayer you did in Islam for which you hope to receive good reward, for I heard during the night the sound of your steps before me in Paradise. Bilal said: I did not do any act in Islam for which I hope to get any benefit but this that when I perform complete ablution during the night or day I observe prayer with that purification what Allah has ordained for me to pray",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6325,
			"arabicnumber": "2459",
			"text": "Abdullah reported that when this verse was revealed:\" There is no harm on persons who believe and perform good acts, what they had eaten (formerly) when they avoided it (now) and they affirmed their faith\" (v. 93) up to the end. Allah's Messenger (ﷺ) said to me: You are one amongst them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6326,
			"arabicnumber": "2460.01",
			"text": "Abu Musa reported:When I and my brother came from Yemen we used to consider Ibn Mas'ud and his mother amongst the members of the household. of Allah's Messenger (ﷺ) because of their visiting them frequently and staying there for long (periods of) time",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6327,
			"arabicnumber": "2460.02",
			"text": "The above hadith is narrated likewise through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6328,
			"arabicnumber": "2460.03",
			"text": "Abu Musa. reported:I came to Allah's Messenger (ﷺ) and thought that 'Abdullah was amongst the members of the family, or like that",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6329,
			"arabicnumber": "2461.01",
			"text": "Abu Ishaq reported that he heard Abu'l-Ahwas say:I was along with Abu Musa and Abu Mas'ud as Ibn Mas'ud died and one of them said to the other: Do you find one like him besides him? Thereupon he said: Do you say this (no one can be his rival)? He was admitted (to the company of the Holy Prophet) whereas we were detained and he had been present in the company of Allah's Messenger (ﷺ) whereas we had been absent",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6330,
			"arabicnumber": "2461.02",
			"text": "Abu Ahwas reported:We were in the house of Abu Musa along with some of the companions of 'Abdullah and they were looking at the Holy Book. 'Abdullah stood up, whereupon Abu Mas'ud said: I do not know whether Allah's Messenger, (ﷺ) has left after him one having a better knowledge (of Islam) than the man who is standing. Abu Musa said: If you say this, that is correct, because he had been present when we had been absent and he was permitted when we were detained",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6331,
			"arabicnumber": "2461.03",
			"text": "Zaid b. Wahab reported:I was sitting along with Hudhaifa and Abu Musa, and the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6332,
			"arabicnumber": "2462",
			"text": "Abdullah (b. Mas'ud) reported that he (said to his companions to conceal their copies of the Qur'an) and further said:He who conceals anything he shall have to bring that which he had concealed on the Day of judgment, and then said: After whose mode of recitation you command me to recite? I in fact recited before AIlah's Messenger (ﷺ) more than seventy chapters of the Qur'an and the Companions of Allah's Messenger (ﷺ) know it that I have better understanding of the Book of Allah (than they do), and if I were to know that someone had better understanding than I, I would have gone to him. Shaqiq said: I sat in the company of the Companions of Mubkmmad (ﷺ) but I did not hear anyone having rejected that (that is, his recitation) or finding fault with it",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6333,
			"arabicnumber": "2463",
			"text": "Abdullah reported:By Him besides Whom there is no god, there is no chapter in the Book of Allah about which I do not know as to where it was revealed and there is no verse about which I do not know in what context it was revealed, and if I were to know of one having a better understanding of the Book of Allah than I (and I could reach him) on the back of the mule, I would have definitely gone to him on camel's back",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6334,
			"arabicnumber": "2464.01",
			"text": "Masruq reported:We used to go to Abdullah b. 'Amr and talk to him, Ibn Numair said: One day we made a mention of Abdullah b. Mas'ud, whereupon he said: You have made mention of a person whom I love more than anything else. I heard Allah's Messenger (ﷺ) as saying: Learn Qur'an from four persons: Ibn Umm 'Abd (i. e. 'Abdullah b. Mas'ud) he started from him-then Mu'adh b. Jabal and Ubayya b. Ka'b, then Salim the ally of Abu Hudhaifa",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6335,
			"arabicnumber": "2464.02",
			"text": "Masruq reported:We were in the company of Abdullah b 'Amr that we made a mention of a hadith from Abdullah b. Mas'ud; thereupon he said: That is a person whose love ever remains (fresh in my heart) after I heard Allah's Messenger (ﷺ) as saying: Learn Qur'an from four persons: Ibn Umm 'Abd, i e. Abdullah b. Mas'ud and he started from his name-then Ubayy b. Ka'b and Mu'adh b Jabal. Zuhri did not make a mention of the words yaquluhu in his narration",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6336,
			"arabicnumber": "2464.03",
			"text": "This hadith has been reported on the authority of Abu Bakr b. Abu Shaiba and Abu Kuraib, and both of them said:Abu Mu'awiya narrated to us from A'mash on the authority of Jarir and Waki', and in a narration of Abu Bakr transmitted on the authority of Abu Mu'awiya the mention of Mu'adh has preceded Ubayy's, and in the narration transmitted on the authority of Abu Kuraib, the name of Ubayy preceded Mu'ddh's",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6337,
			"arabicnumber": "2464.04",
			"text": "This tradition has been transmitted on the authority of Shu'ba through A'mash, but there is a difference of order of the four",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6338,
			"arabicnumber": "2464.05",
			"text": "Masruq reported:They made a mention of Ibn Mas'ud before 'Abdullah b. Amr, whereupon he said: He is a person whose love is always fresh in my heart after I heard Allah's Messenger (ﷺ) as saying: Learn the recita- tion of the Qur'an from four persons: from Ibn Mas'ud, Salim, the ally of Abu Hudhaifa, Ubayy b. Ka'b, Mu'adh b. Jabal",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6339,
			"arabicnumber": "2464.06",
			"text": "Ubaidullah b. Mu'adh reported it on the authority of his father Shu'ba with the same chain of transmitters and he made this addition. He made a mention of these two names but I do not know whose name he mentioned first",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6340,
			"arabicnumber": "2465.01",
			"text": "Anas is reported to have said:Four persons collected the Qur'an during the lifetime of Allah's Messenger (ﷺ) and all of them were Ansar: Mu'adh b. Jabal, Ubayy b. Ka'b, Zaid b. Thabit, Abu Zaid. Qatada said: Anas, who was Abu Zaid? He said: He was one of my uncles",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6341,
			"arabicnumber": "2465.02",
			"text": "Hammam said:I said to Anas b. Malik: Who collected the Qur'an during the lifetime of Allah's Messenger (ﷺ)? He said: Four (persons), all of them belonging to Ansir: Ubayy b. Ka'b, Mu'adh b. Jabal, Zaid b. Thabit and a person from the Ansar whose Kunya was Abu Zaid",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6342,
			"arabicnumber": "799.04",
			"text": "Anas b. Malik reported that Allah's Messenger (ﷺ) said to Ubayy:Verily Allah, the Exalted and Glorious, has commanded me to recite the Qur'an to you, whereupon he said: (Has) Allah mentioned my name to you? He said: Allah has mentioned your name to me. Thereupon he began to shed tears (of joy)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6343,
			"arabicnumber": "799.05",
			"text": "Anas b. Malik reported that Allah's Messenger (ﷺ) said to Ubayy b. Ka'b:I have been commanded to recite to you the Sura (al- Bayyinah) which opens with these words (Lam Yakunil-ladhiyna Kafaruu) He said: Has he mentioned to you my name? He said: Yes; thereupon he shed tears of joy",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6344,
			"arabicnumber": "799.06",
			"text": "This hadith has been narrated on the authority of Anas through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6345,
			"arabicnumber": "2466.01",
			"text": "Jabir b. 'Abdullah reported Allah's Messenger (ﷺ) as saying while the bier of Sa'd b. Mu'adh was placed before them:The Throne of the most Gracious shook at the death of Sa'd b. Mu'adh",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6346,
			"arabicnumber": "2466.02",
			"text": "Jabir reported that the Throne of the most Compassionate shook because of the death of Sa'd b. Mu'adh",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6347,
			"arabicnumber": "2467",
			"text": "Anas b. Malik reported Allah's Messenger (ﷺ) as say- ing:That his bier (that of Sa'd) was placed (before them) and the Throne of the most Compassionate shook",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6348,
			"arabicnumber": "2468.01",
			"text": "Al-Bara' reported that a garment of silk was presented to Allah's Messenger (ﷺ). His Companions touched it and admired its softness; there- upon he said:Do you admire the softness of this (cloth)? The handkerchiefs of Sa'd b. Mu'adh in Paradise are better than this",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6349,
			"arabicnumber": "2468.02",
			"text": "This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6350,
			"arabicnumber": "2468.03",
			"text": "This hadith has been reported on the authority of Shu'ba combining the two chains of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6351,
			"arabicnumber": "2469.01",
			"text": "Anas b Malik reported that Allah's Messenger (ﷺ) was presented a garment of sundus and he prohibited the use of silk. The persons admired it, whereupon he said:By Him in Whose Hand is the life of Muhammad, the kerchiefs of Sa'd b. Mu'adh in Paradise are better than this",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6352,
			"arabicnumber": "2469.02",
			"text": "Anas reported the king of Dumat al-Jandal presented to Allah's Messenger (ﷺ) the garment and lie made no mention (of the fact) that he prohibited the use of silk",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6353,
			"arabicnumber": "2470",
			"text": "Anas reported that Allah's Messenger (ﷺ) took hold of his sword on the Day of Uhud and said:Who would take it from me? All the persons stretched their hands saying: I would do it, I would do it. He (Allah's Apostle) said: Who would take it in order to fulfil its rights? Then the people withdrew their hands. Simak b. Kharasha Abu Dujana said: I am here to take it and fulfil its rights. He took it and struck the heads of the polytheists",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6354,
			"arabicnumber": "2471.01",
			"text": "Jabir b. 'Abdullah reported:The dead body of my father was brought and he was covered (with cloth) and it had been mutilated. I made an attempt to lift the cloth, but my people prohibited me to do so. I again made an attempt to lift the cloth, but my people prohibited me. Thereupon Allah's Messenger (ﷺ) lifted it or he commanded it to be lifted. He heard the noise (of a loud) weeping, or the noise of a woman mourner. He inquired who she was. They said: The daughter of 'Amr or the sister of Amr, whereupon he said: Why does she weep? The Angels provide him shade with the help of their Wings until he would be lifted (to his heavenly abode)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6355,
			"arabicnumber": "2471.02",
			"text": "Jabir b. 'Abdullah reported:My father fell as a martyr on the Day of Uhud and I attempted to uncover his face and weep, but they (the Companions of the Holy Prophet) forbade me to do this, whereas Allah's Messenger (ﷺ) did not forbid me and Fatima bint Amr, the sister of my father, was also weeping There- upon Allah's Messenger (ﷺ) said: You may weep or you may not weep; the Angels provide him shade with the help of their wings until you lift him (to be buried in the grave)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6356,
			"arabicnumber": "2471.03",
			"text": "This hadith has been narrated on the authority of Jabir through another chain of transmitters, but with this difference that there is no mention of the Angels and the weeping of a female mourner",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6357,
			"arabicnumber": "2471.04",
			"text": "Jabir reported:My father was brought in a state that his ears had been cut off and (his dead body) was placed before Allah's Apostle (ﷺ), the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6358,
			"arabicnumber": "2472",
			"text": "Abu Barza reported that Allah's Apostle (ﷺ) was there in a battlefield that Allah conferred upon him the spoils of war. He said to his Companions:Is anyone missing amongst you? They said: So and so and so. He again said: Is there anyone missing amongst you? They said: So and so and so. He then said: Is there anyone missing amongst you? They said: No. Thereupon he (the Holy Prophet) said: But I am missing Julaibib. They (his Companions) searched him amongst those who had been killed and they found him by the side of seven (dead bodies) whom he had killed and he had been killed (by the oppoments). Allah's Apostle (ﷺ) came there and stood (by his side) and said: He killed seven (persons). Then (his opponents) killed him. He is mine and I am his. He then placed him upon his hands and there was none else to lift but Allah's Apostle (ﷺ). Then the grave was dug for him and he was placed in the grave and no mention is made of a bath",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6359,
			"arabicnumber": "2473.01",
			"text": "Abdullah b. Samit reported that Abu Dharr said:We set out from our tribe Ghafir who look upon the prohibited months as permissible months. I and my brother Unais and our mother stayed with our maternal uncle who treated us well. The men of his tribe fell jealous and they said: When you are anay from your house, Unais commits adultery with your wife. Our -naternal uncle came and he accused us of the sin which was conveyed to him. I said: You have undone the good you did to us. We cannot stay with you after this. We came to our camels and loaded (our) luggage. Our maternal uncle began to weep covering himself with (a piece of) cloth. We proceeded on until we encamped by the side of Mecca. Unais cast lot on the camels (we had) and an equal number (above that). They both went to a Kahin and he made Unais win and Unais came with our camels and an equal number along with them. He (Abu Dharr) said: My nephew, I used to observe prayer three years before my meeting with Allah's Messenger (ﷺ). I said: For whom did you say prayer? He said: For Allah. I said: To which direction did you turn your face (for observing prayer)? He said: I used to turn my face as Allah has directed me to turn my face. I used to observe the night prayer at the time of the end of night and I fell down in prostration like the mantle until the sun rose over me. Unais said: I have a work in Mecca, so you better stay here. Unais went until he came to Mecca and he came to me late. I said: What did you do? He said: I met a person in Mecca who is on your religion and he claims that verily it is Allah Who has sent him. I said: What do the people say about him? He said: They say that he is a poet or a Kahin or a magician. Unais who was himself one of the poets said. I have heard the words of a Kahin but his words in no way resemble his (words). And 1 also compared his words to the verses of poets but such words cannot be uttered by any poet. By Allah, he is truthful and they are liars. Then I said: you stay here, until I go, so that I should see him. He said: I came to Mecca and I selected an insignificant person from amongst them and said to him: Where is he whom you call as-Sabi? He pointed out towards me saying: He is Sabi. Thereupon the people of the valley attacked me with sods and bows until I fell down unconscious. I stood up after havin. regained my consciousness and I found as if I was a red idol. I came to Zamzarn and washed blood from me and drank water from it and listen, O son of my brother, I stayed there for thirty nights or days and there was no food for me but the water of Zamzarn. And I became so bulky that there appeared wrinkles upon my stomach, and I did not feel any hunger in my stomach. It was during this time that the people of Mecca slept in the moonlit night and none was there to eircumambulate the House but only two women who had been invoking the name of Isafa, and Na'ila (the two idols). They came to me while in their circuit and I said: Marry one with the other, but they did not dissuade from their invoking. They came to me and I said to them: Insert wood (in the idols' private parts). (I said this to them in such plain words) as I could not express in metaphorical terms. These women went away crying and saying: Had there been one amongst our people (he would have taught a lesson to you for the obscene words used for our idols before us). These women met Allah's Messenger (ﷺ) and Abu Bakr who had also been coming down the hill. He asked them: What has happened to you? They said: There is Sabi, who has hidden himself between the Ka'ba and its curtain. He said: What did he say to you? They said: He uttered such words before us as we cannot express. Allah's Messenger (ﷺ) came and he kissed the Black Stone and circumambulated the House along with his Companion and then observed prayer, and when he had finished his prayer, Abu Dharr said: I was the first to greet him with the salutation of peace and uttered (these words) in this way; Allah's Messen- ger, may there be peace upon you, whereupon he said: It may be upon you too and the mercy of Allah. He then said: Who are you? I said: From the tribe of Ghifar. He leaned his hand and placed his finger on his forehead and I said to myself: Perhaps he has not liked it that I belong to the tribe of Ghifar. I attempted to catch hold of his hand but his friend who knew about him more than I dissuaded me f rom doing so. He then lifted his head and said: Since how long have you been here? I said: I have been here for the last thirty nights or days. He said: Who has been feeding you? I said: There has been no food for me but the water of Zamzam. I have grown so bulky that there appear wrinkles upon my stomach and I do not feel any hunger. He said: It is blessed (water) and it also serves as food. Thereupon Abu Bakr said: Allah's Messenger, let me serve as a host to him for tonight, and then Allah's Messenger (ﷺ) proceeded forth and so did Abu Bakr and I went along with them. Abu Bakr opened the door and then he brought for us the raisins of Ta'if and that was the first food which I ate there. Then I stayed as long as I had to stay. I then came to Allah's Messenaer (ﷺ) and he said: I have been shown the land abound- ing in trees and I think it cannot be but that of Yathrib (that is the old name of Medina). You are a preacher to your people on my behalf. I hope Allah would benefit them through you and He would reward you. I came to Unais and he said: What have you done? I said: I have done that I have embraced Islam and I have testified (to the prophethood of Allah's Messenger). He said: I have no aversion for your religion and I also embrace Islam and testify (to the prophethood of Muhammad). Then both of us came to our mother and she said: I have no aversion for your religion and I also embrace Islam and testify to the prophethood of Muhammad. We then loaded our camels and came to our tribe Ghifir and half of the tribe embraced Islam and their chief was Aimi' b. Rahada Ghifirl and he was their leader and hall of the tribe said: We will embrace Islam when Allah's Messenger (may p,. ace be upon him) would come to Medina, and when Allah's Messenger (ﷺ) came to Medina the remaining half also embraced Islam. Then a tribe Aslam came to the Prophet (ﷺ) and said: Allah's Messenger, we also embrace Islam like our brothers who have embraced Islam. And they also embraced Islam. Thereupon Allah's Messenger (ﷺ) said: Allah granted pardon to the tribe of Ghifar and Allah saved (from destruction) the tribe of Aslam",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6360,
			"arabicnumber": "2473.02",
			"text": "This hadlth has been narrated on the authority of Humaid b. Hilal with the same chain of transmitters but with this addition:\" As I came to Mecca, Unais said: (Well), go but be on your guard against the Meccans for they are his enemies and are annoyed with him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6361,
			"arabicnumber": "2473.03",
			"text": "Abdullah b. Samit reported that Abu Dharr said:Son of my brother, I used to observe prayer two years before the advent of Allah's Apostle (ﷺ). I said: To which direction did you turn your face? He said: To which Allah directed me to turn my face. The rest of the hadith is the same but with this addition that they went to a Kahin and his brother Unais began to praise him until he (in verses declared) him (Unais) as winner (in the contest of poetry), and so we got his camels, mixed them with our camels, and there is in this hadith also these words that Allah's Apostle (ﷺ) came there and he circumambulated the House and observed two Rak'ahs of prayer behind the Station (of Ibrahim). I came to him and I was the first amongst persons to greet him with Assalam-o-'Alaikum, and I said to Allah's Messenger Let there be peace upon you. And he said: Let there be peace upon you too; who are you? And in the hadith (these words are) also found: Since how long have you been here? And Abu Bakr said: Let him be my guest tonight",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6362,
			"arabicnumber": "2474",
			"text": "Ibn `Abbas reported that when Abu Dharr heard of the advent of the Apostle (ﷺ) in Mecca he said:Brother, ride in this valley and bring information for me about the person who claims that there comes to him information from the Heavens. Listen to his words and then come to me. So he rode on until he came to Mecca and he heard his words (the sacred words of the Holy Prophet) and then came back to Abu Dharr and said: I have seen him exhorting (people) to develop good morals and his expressions can in no way be termed as poetry. He (Abu Dharr) said: I have not been satisfied with it regarding that which I had in my mind (as I sent you). So he took up provisions for the journey and a small water-skin containing water (and set forth) until he came to Mecca. He came to the mosque (Ka`bah) and began to look for Allah's Apostle (ﷺ) and he did not recognize him (the Holy Prophet) and he did not even like that he should ask about him from anyone until it was night, and he slept. `Ali saw him and found him to be a stranger. So he went with him. He followed him but one did not make any inquiry from the other about anything until it was morning. He then brought the water and his provisions to the mosque and spent a day there, but he did not see Allah's Apostle (ﷺ) until it was night. He then returned to his bed, and there happened to pass `Ali and he said: This man has not been able to find his destination until this time. He made him stand and he went with him and no one made an inquiry from his companion about anything. And when it was the third day he did the same. `Ali made him stand up and brought him along with him. He said: By Him, besides Whom there is no god, why don't you tell me (the reason) which brought you here to this town? He said: (I shall do this) provided you hold me promise and a covenant that you would guide me aright. He then did that. He (`Ali) said: Verily, he is truthful and he is a Messenger of Allah (ﷺ) and when it is morning, follow me and if I would say anything from which I would sense fear about you I would stand (in a manner) as if I was throwing water and if I move on, you then follow me until I get in (some house). He did that and I followed him until he came to Allah's Messenger (ﷺ). He entered (the house) of Allah's Apostle (ﷺ) along with him and listened to his words and embraced Islam at this very place. Allah's Apostle (ﷺ) said to him: Go to your people and inform them until my command reaches you. Thereupon he said: By Him in Whose Hand is my life, I shall say to the people of Mecca this thing at the top of my voice. So he set forth until he came to the mosque and then spoke at the top of his voice (saying): I bear testimony to the fact that there is no god but Allah and that Muhammad is the Messenger of Allah. The people attacked him and made him fall down when al-`Abbas came and he leaned over him and said: Woe be upon you, don't you know that he is from amongst the tribe of Ghifar and your trading route to Syria passes through (the settlements of this tribe), and he rescued him. He (Abu Dharr) did the same on the next day and they (the Meccans) again attacked him and al-`Abbas leaned upon him and he rescued him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6363,
			"arabicnumber": "2475.01",
			"text": "Jarir b. 'Abdullah said:Allah's Messenger (ﷺ) never refused me permission to see him since I embraced Islam and never looked at me but with a smile",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6364,
			"arabicnumber": "2475.02",
			"text": "Jarir reported:Since I embraced Islam Allah's Messenger (ﷺ) never refused to see me and he did not see me but with a smile on his face. Ibn Numair has made this addition to this hadith which has been reported on the authority of Ibn Idris that he (Jarir) made this complaint to him (to the Holy Prophet): I cannot sit upon the horse with firmness, whereupon he (Allah's Apostle) struck his chest with his hand and prayed: O Allah, make him steadfast and rightly-guided",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6365,
			"arabicnumber": "2476.01",
			"text": "Jabir reported that there was in pre-Islamic days a temple called Dhu'l- Khalasah and it was called the Yamanite Ka'ba or the northern Ka'ba. Allah's Messenger (ﷺ) said unto me:Will you rid me of Dhu'l-Khalasah and so I went forth at the head of 350 horsemen of the tribe of Ahmas and we destroyed it and killed whomsoever we found there. Then we came back to him (to the Holy Prophet) and informed him and he blessed us and the tribe of Ahmas",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6366,
			"arabicnumber": "2476.02",
			"text": "Jarir b. 'Abdullah al-Bajali said:Allah's Messenger (ﷺ) said to me: Can't on rid me of Dhu'I-Khalasah, the idol-house of Khath'am, and this idol-house was called the Yamanite Ka'ba. So I went along with 150 horsemen and I could not sit with steadfastness upon the horse. I made the mention of it to Allah's Messenger (ﷺ) and he struck his hand on my chest and said: O Allah, grant him steadfastness and make him the guide of righteousness and the rightly-guided one. So he went away and he set fire to it. Then Jarir sent some person to Allah's Messenger (ﷺ) whose Kunya was Abu Arta to give him the happy news about that. He came to Allah's Messenger (ﷺ) and said: I have not come to you (but with the news) that we have left Dhu'l-Khalasah as a scabed camel. Thereupon Allah's Messenger (ﷺ) blessed the horses of Ahmas and the men of their tribe five times",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6367,
			"arabicnumber": "2476.03",
			"text": "This hadith has been narrated on the authority of Ismail with different chains of transmitters and in the hadith transmitted on the authority of Marwan (the words are):\"A person giving the glad tidings on behalf of Jarir came or Abu Husain b. Rabi`a came in order to give glad tidings to Allah's Apostle (ﷺ)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6368,
			"arabicnumber": "2477",
			"text": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) came to privy and I placed for him water for ablution, When he came out he said:Who placed it here? And in a version of Zuhair they (the Companions) said, and in the version of Abu Bakr (the words are): I said: It is Ibn 'Abbas (who has done that), whereupon he (the Holy Prophet) said: May Allah grant him deep understanding of religion",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 6369,
			"arabicnumber": "2478",
			"text": "Ibn 'Umar reported:I saw in a state of sleep as if I have in my hand a piece of silk cloth and there is no place in the Paradise where I intend to reach but that piece of cloth does not fly towards it. I made a mention of it to Hafsa (the sister of Ibn 'Umar) and Hafsa made a mention of it to Allah's Apostle (ﷺ), whereupon Allah's Apostle (ﷺ) said: I find 'Abdullah b 'Umar a pious person",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6370,
			"arabicnumber": "2479.01",
			"text": "Ibn 'Umar reported that when a person saw anything in sleep during the lifetime of Allah's Messenger (may peace he upon him) he narrated it to Allah's Messenger, and I also had a longing that I should also see in a dream something which I should narrate to Allah's Apostle (ﷺ) and I was at that time an unmarried young man. I was sleeping in the mosque during the lifetime of Allah's Messenger (ﷺ) tl) at I saw in a dream as if two Angels have taken hold of me and they have carried me to the fire, and, lo, it was built like the easing of a well and had two pillars like those of a well; and, lo, there were people in it whom I knew and I cried out:I seek refuge with Allah from Hell-fire; I seek refuge with Allah from Hell-fire. Then another Angel joined the two others, and said unto me: You need not fear I narrated this dream to llafsa and she narrated it to Allah's Messenger, whereupon Allah's Apostle said: Worthy is this man Abdullah, O that he would pray at night, and Silim added that Abdullah afterwards slept only but for a small part of the night",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 6371,
			"arabicnumber": "2479.02",
			"text": "Ibn Umar reported:I used to spend nights in the mosque and by that time I had no wife and children. I saw in a dream as if I am being taken to a well. I made a mention of it to Allah's Messenger (may peacebe upon him). The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6372,
			"arabicnumber": "2480.01",
			"text": "Anas reported that Umm Sulaim said (to the Holy Prophet) Allah's Messenger, here is your servant Anas, invoke blessings of Allah upon him. Thereupon he (the Holy Prophet) said:O Allah, make an increase in his wealth, and progeny, and confer blessings upon him in everything Thou hast bestowed upon him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6373,
			"arabicnumber": "2480.02",
			"text": "Anas reported (that his mother) Umm Sulaim said (to the Holy Prophet) Allah's Messenger, here is your servant Anas. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6374,
			"arabicnumber": "2480.03",
			"text": "This hadith has been reported on the authority of Anas through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6375,
			"arabicnumber": "2481.01",
			"text": "Anas reportedAllah's Apostle (ﷺ) visited us and there was none else (in the house) but I, my mother and my mother's sister Umm Haram. My mother said to him:Allah's Messenger, here is a small servant of yours, invoke blessings of Allah upon him. And he invoked blessings for me (that I should be bestowed upon) every good and this was what he (said) at the end of what be supplicated for me: O Allah, make an increase in his wealth, and progeny, and cqnfer blessings (upon him) in (each one) of them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6376,
			"arabicnumber": "2481.02",
			"text": "Anas reported:My mother Umm Anas came to Allah's Messenger (ﷺ). And she prepared my lower garment out of the half of her headdress and (with the other half) she covered my upper body and said: Allah's Messenger, here is my son Unais; I have brought him to you for serving you. Invoke blessings of Allah upon him. Thereupon he (the Holy Prophet) said: O Allah, make an increase in his wealth, and progeny. Anas said: By Allah, my fortune is huge and my children, and grand-children are now more than one hundred",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6377,
			"arabicnumber": "2481.03",
			"text": "Anas b. Malik said:Allah's Messenger (ﷺ) passed (by our house) that my mother Umm Sulaim listened to his voice and said: Allah's Messenger, let my father and mother be sacrificed for thee, here is Unais (and requested him to invoke blessings upon me). So Allah's Messenger (ﷺ) invoked three blessings upon me. I have seen (the results) of the two in this very world (in regard to wealth and progeny) and I hope to see (the result) of the third one in the Hereafter",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 6378,
			"arabicnumber": "2482.01",
			"text": "Anas reported:Allah's Messenger (ﷺ) came to me as I was playing with playmates. He greeted and sent me on an errand and I made delay in going to my mother. When I came to her she said: What detained you? I said: Allah's Messenger (ﷺ) sent me on an errand. She said: What was the purpose? I said: It is something secret. Therupon she said: Do not then divulge the secret of Allah's Messenger (ﷺ) to anyone. Anas said: By Allah, if I were to divulge it to anyone, then, O Thabit, I would have divulged it to you",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6379,
			"arabicnumber": "2482.02",
			"text": "Anas b. Malik reported that Allah's Apostle (ﷺ) told me something secretly. I informed none about that and Umm Sulaim asked me about it, but I did not tell her even",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6380,
			"arabicnumber": "2383",
			"text": "Amir b. Sa'd reported that he heard his father (Sa'd b. Abi Waqqas) say:never heard Allah's Messenger (ﷺ) say unto one living and moving about that he was in Paradise except to 'Abdullah b. Salim",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6381,
			"arabicnumber": "2484.01",
			"text": "Qais b. 'Ubada reported:I was in the company of some persons, amongst whom some were the Companions of Allah's Apostle (ﷺ) in Medina, that there came a person whose face depicted the fear (of Allah). Some people said: He is a person from amongst the people of Paradise; he is a person from amongst the people of Paradise. He observed two short rak'ahs of prayer and then went out. I followed him and he got into his house and I also got in and we began to converse with each other. And when he became familiar (with me) I said to Him: When you entered (the mosque) before (your entrance in the house) a person said so and so (that you are amongst the people of Paradise), whereupon he said: It is not meet for anyone to say anything which he does not know. I shall (now) tell you why they (say) this. I saw a dream during the lifetime of Allah's Messenger (ﷺ) and narrated it to him. I seemed to be in a garden [he described its vastness, its rich fructification and its verdure]; in the midst of it, there stood an iron pillar, with its base in the earth and its summit in the sky: and upon its summit there was a handhold. It was said to me: Climb up this (pillar). I said to him (visitant in the dream): I am unable to do it. Thereupon a helper came to me, and he (supported) me (by catching hold of my) garment from behind and thus helped me with his hand and so I climbed up till I was at the summit of the pillar, and grasped the handhold. It was said to me: Ho d it tightly. It was at this that I woke up when (the handhold) was in fthe grip) of my hand. I narrated it (the dream) to Allah's Apostle (ﷺ), whereupon he said: That garden implies al-Islam and that pillar implies the pillar of Islam. And that handhold is the firmest faith (as refered to in the Qur'an). And you will remain attached to Islam until you shall die. And that man was 'Abdullah b. Salim",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6382,
			"arabicnumber": "2484.02",
			"text": "Qais b. 'Ubaida reported:I was (sitting) in a company in which there were (besides others) Sa'd b. Malik and Ibn 'Umar that 'Abdullah b. Saliim happened to pass (by that side). They (the people sitting in that company) said: He is a person from amongst the dwellers of Paradise. I stood up and said to him: They say such and such (thing about you), whereupon he said: Hallowed be Allah, it is not meet for them to say (anything) of which They have no knowledge. Verily I saw as if a pillar had been raised in a green garden and there had been fixed at its (upper) end a handhold and there was a helper at its base. It was said to me: Climb up. So I climbed up and caught hold of the haildhold. I narrated (the contents of this dream) to Allah's Messenger (ﷺ), whereupon he said: 'Abdullah would die in a state that he would be catching hold of the firmest handhold (he would die holding fast to the faith)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6383,
			"arabicnumber": "2484.03",
			"text": "Kharasha b. Hurr reported:I was sitting in a circle in the mosque of Medina and there was an old man, quite handsome. He was 'Abdullah b. Salim. He was telling good things to them (to the people sitting in that company). As he stood up (to depart) the people said: He who is desirous of looking at a person from amongst the people of Paradise should see him. I said: By Allah, I will follow him, and would try to know his residence. So I followed him and he walked on until he reached the outskirts of Medina. He then entered his house. I sought permission from him to get in, and he granted me the permission, saying: My nephew, what is the need (that has brought you here)? I said to him: As you stood up, I heard people say about you: He who is desirous of seeing a person from among the people of Paradise should look at him. So I became desirous of accompanying you. He ('Abdullah b. Salim) said: It is Allah Who knows best about the people of Paradise. I would, however, narrate to you as to why they said like it. (The story is) that while I was asleep (one night) there came to me a person (in the dream) who asked me to stand up. (So I stood up) and he caught hold of my hand and I walked along with him, and, lo, I found some paths on my left and I was about to set out upon them. Thereupon he said to me Do not set yourself on (them) for these are the paths of the leftists (denizens of Hell-fire). Then there were paths leading to the right side, whereupon he said: Set yourself on these paths. We came across a hill and he said to me: Climb up, and I attempted to climb up that I fell upon my buttocks. I made several attempts (but failed to succeed). He led until he came to a pillar (so high) that its upper end touched the sky and its base was in the earth. And there was a handhold at its upper end. He said to me Climb over it. I said: How can I climb upon it, as its upper end touches the sky? He cought hold of my hand and pushed me up and I found myself suspended with the handhold. He then struck the pillar and it fell down, but I remained attached to that handhold until it was morning (and the dream was thus over). I came to Allah's Apostle (ﷺ) and narrated it to him. He said: So far as the paths which you saw on your left are concerned, these are paths of the leftists (denizens of Hell) and the paths which you saw on your right, these are the paths of the rightists (the dwellers of Paradise) and the mountain represents the destination of the martyrs which you would not be able to attain. The pillar implies the pillar of Islam. and so far as the handhold is concerned, it implies the handhold of Islam, and you would hold to it fastly until you would meet death",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6384,
			"arabicnumber": "2485.01",
			"text": "Abu Huraira reported that 'Umar happened to pass by Hassan as he was reciting verses in the mosque. He (Hadrat 'Umar) looked towards him (meaningfully), whereupon he (gassin) said:I used to recite (verses) when one better than you (the Holy Prophet) had been present (here). He then looked towards Abu Huraira and said to him: I adjure you by Allah (to tell) if you had not heard Allah's Messenger (ﷺ) as saying: (Hassan), give a reply on my behalf; Allah I help him with Ruh-ul-Qudus. He (Abu Huraira) said: By Allah, it is so (i. e. the Prophet actually said these words)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6385,
			"arabicnumber": "2485.02",
			"text": "Ibn Musayyib reported that Hassan said to a circle in which there was also Abu Huraira:Abu Huraira, I adjure you by Allah (to tell) whether you-had not heard Allah's Messenger (ﷺ) saying like this",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6386,
			"arabicnumber": "2485.03",
			"text": "Abd al-Rahman reported that he heard Hassin b. Thabit al-Ansari call Abu Huraira to bear witness by saying:I adjure you by Allah if you had not heard Allah's Apostle (ﷺ) saying: Hassin, give a reply on behalf of the Messenger of Allah. O Allah, help him with Ruh-ul-Qudus. Abu Huraira said: Yes, it is so",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6387,
			"arabicnumber": "2486.01",
			"text": "Al-Bari' b. 'Azib reported:I heard Allah's Messenger (ﷺ) as saying: Hassan b. Thibit, write satire (against the non-believers) ; Gabriel is with you",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 6388,
			"arabicnumber": "2486.02",
			"text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 6389,
			"arabicnumber": "2487.01",
			"text": "Hisham reported on the authority of his father that Hassan b. Thabit talked much about 'A'isha. I scolded him, whereupon she said:My nephew, leave him for he defended Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 6390,
			"arabicnumber": "2487.02",
			"text": "This hadith has been narrated on the authority of Hishim with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 6391,
			"arabicnumber": "2488.01",
			"text": "Masruq reported:I visited 'A'isha when Hassin was sitting there and reciting verses from his compilation: She is chaste and prudent. There is no calumny against her and she rises up early in the morning without eating the meat of the un- mindful. 'A'isha said: But you are not so. Masruq said: I said to her: Why do you permit him to visit you, whereas Allah has said:\" And as for him among them who took upon himself the main part thereof, he shall have a grievous punishment\" (XXIV. ll)? Thereupon she said: What tornient can be more severe than this that he has become blind? He used to write satire as a rebuttal on behalf of Allah's Messenger (ﷺ)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 6392,
			"arabicnumber": "2488.02",
			"text": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 6393,
			"arabicnumber": "2489.01",
			"text": "A'isha reported that Hassin said:Allah's Messenger, permit me to write satire against Abu Sufyan, whereupon he said: How can it be because I am also related to him? Thereupon he (Hassan) said: By Him Who has honoured you. I shall draw you out from them (their family) just as hair is drawn out from the fermented (flour). Thereupon Hassan said: The dignity and greatness belongs to the tribe of Bint Makhzum from amongst the tribe of Hisham, whereas your father was a slave",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 6394,
			"arabicnumber": "2489.02",
			"text": "Urwa reported on the same chain of transmitters that Hassan b. Thabit sought permission from Allah's Apostle (ﷺ) to satirise against the polytheists, but he did not mention Abu Sufyan. And instead of the word al- Khamir, the word al-'Ajin was used",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 6395,
			"arabicnumber": "2490",
			"text": "A'isha reported that Allah's Messenger (may peace be uport him) said. Satirise against the (non-believing amongst the) Quraish, for (the satire) is more grievous to them than the hurt of an arrow. So he (the Holy Prophet) sent (someone) to Ibn Rawiha and asked him to satirise against them, and he composed a satire, but it did not appeal to him (to the Holy Prophet). He then sent (someone) to Ka'b b. Malik (to do the same, but what he composed did not appeal to the Holy Prophet). He then sent one to Hassan b. Thabit. As he got into his presence, Hassan said:Now you have called for this lion who strikes (the enemies) with his tail. He then brought out his tongue and began to move it and said: By Him Who has sent you with Truth, I shall tear them with my tongue as the leather is torn. Thereupon Allah's Messenger (ﷺ) said: Don't be hasty; (let) Abu Bakr who has the best know- ledge of the lineage of the Quraish draw a distinction for you in regard to my lineage, as my lineage is thesame as theirs. Hassan then came to him (Abu Bakr) and after making inquiry (in regard to the lineage of the Holy Prophet) came back to him (the holy Prophet) and said: Allah's Messenger, he (Abu Bakr) has drawn a distinction in vour lineage (and that of the Quraish) By Him Who has sent you with Truth, I shall draw out from them (your name) as hair is drawn out from the flour. 'A'isha said: I heard Allah's Messenger (ﷺ) as saying to Hassin: Verily Ruh-ul- Qudus would continue to help you so long as you put up a defence on behalf of Allah and His Messenger. And she said: I heard Allah's Messenger (ﷺ) saying: Hassan satirised against them and gave satisfaction to the (Muslims) and disquieted (the non-Muslims). You satirised Muhammad, but I replied on his behalf, And there is reward with Allah for this. You satirised Muhammad. virtuous, righteous, The Apostle of Allah, whose nature is truthfulness. So verily my father and his father and my honour Are a protection to the honour of Muhammad; May I lose my dear daughter, if you don't see her, Wiping away the dust from the two sides of Kada', They pull at the rein, going upward; On their shoulders are spears thirsting (for the blood of the enemy) ; our steeds are sweating-our women wipe them with their mantles. If you had not interfered with us, we would have performed the 'Umra, And (then) there was the Victory, and the darkness cleared away. Otherwise wait for the fighting on the day in which Allah will honour whom He pleases. And Allah said: I have sent a servant who says the Truth in which there is no ambiguity; And Allah said: I have prepared an army-they are the Ansar whose object is fighting (the enemy), There reaches every day from Ma'add abuse, or fighting or satire; Whoever satirises the Apostle from amongst you, or praises him and helps it is all the same, And Gabriel, the Messenger of Allah is among us, and the Holy Spirit who has no match",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 6396,
			"arabicnumber": "2491",
			"text": "Abu Huraira reported:I invited my mother, who was a polytlieist, to Islam. I invited her one day and she said to me something about Allah's Messenger (ﷺ) which I hated. I came to Allah's Messenger (ﷺ) weeping and said: Allah's Messenger, I invited my mother to Islam but she did not accept (my invitation). I invited her today but she said to me something which I did not like. (Kindly) supplicate Allah that He may set the mother of Abu Huraira right. Thereupon Allah's Messenger (ﷺ) said: O Allah, set the mother of Abu Huraira on the right path. I came out quite pleased with the supplication of Allah's Apostle (ﷺ) and when I came near the door it was closed from within. My mother heard the noise of my footsteps and she said: Abu Huraira, just wait. And I heard the noise of falling of water. She took a bath and put on the shirt and quickly covered her head with a headdress and opened the door and then said: Abu Huraira, I bear witness to the fact that there is no god but Allah and Muhammad is His bondsman and His Messenger. He (Abu Huraira) said: I went back to Allah's Messenger (ﷺ) and (this time) I was shedding the tears of joy. I said: Allah's Messenger, be happy, for Allah has responded to your supplication and He has set on the right path the mother of Abu Huraira. He (the Holy Prophet) praised Allah, and extolled Him and uttered good words. I said: Allah's Messenger, supplicate to Allah so that He may instill love of mine and that of my mother too in the believing servants and let our hearts be filled with their love, whereupon Allah's Messenger (ﷺ) said: O Allah, let there be love of these servants of yours, i.e. Abu Huraira and his mother, in the hearts of the believing servants and let their hearts be filled with the love of the believing servants. (Abu Huraira said: This prayer) was so well granted by Allah that no believer was ever born who heard of me and who saw me but did not love me",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 6397,
			"arabicnumber": "2492.01",
			"text": "Al-A'raj reported that he heard Abu Huraira as saying:You are under the impression that Abu Huraira transmits so many ahadith from Allah's Messenger (may peace up upon him) ; (bear in mind) Allah is the great Reckoner. I was a poor man and I served Allah's Messenger (ﷺ) being satisfied with bare subsistence, whereas the immigrants remained busy with transactions in the bazar; while the Ansar had been engaged in looking after their properties. (He further reported) that Allah's Messenger (ﷺ) said: He who spreads the cloth would not forget anything that he would hear from me. I spread my cloth until he narrated something. I then pressed it against my (chest), so I never forgot anything that I heard from him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 6398,
			"arabicnumber": "2492.02",
			"text": "This hadith has been transmitted on the authority of Abu Huraira but with the variation that the hadith transmitted on the authority of Malik conclude with the words of Abu Huraira and there is no mention of a transmission of these from Allah's Apostle (ﷺ):\" who spreads his cloth,\" to the end",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 6399,
			"arabicnumber": "2493",
			"text": "A'isha reported:Don't you feel surprised at Abu Huraira? He came (one day) and sat beside the nook of my apartment and began to narrate (the hadith of Allah's Apostle). I was hearing while I was engaged in extolling Allah (reciting Subhan Allah) constantly. He stood up before I finished my repetition of Subhan Allah. if I were to meet him I would have warned him in stern words that Allah's Messenger (ﷺ) did not speak so quickly as you talk",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 6400,
			"arabicnumber": "2492.03",
			"text": "Ibn Shihab transmitted on the authority of Ibn Musayyib that Abu Huraira said:People say that Abu Huraira transmits so many ahadith, whereas Allah is the Reckoner, and they say: How is it with Muhajirs and the Ansar that they do not narrate ahadith like him (like Abu Huraira)? Abu Huraira said: I tell you that my brothers from Ansar remained busy with their lands and my brothers Muhajirs were busy in transactions in the bazars, but I always kept myself attached to Allah's Messenger (ﷺ) with bare subsistence. I remained present (in the company of the Holy Prophet), whereas they had been absent. I retained in my mind (what the Prophet said), whereas they forgot it. One day Allah's Messenger (ﷺ) said: He who amongst you spreads the cloth and listens to my talk and would then press it against his chest would never forget anything heard from me. So I spread my mantle and when he had concluded his talk I then pressed it against my chest and so I never forgot after that day anything that he (the Holy Prophet) said. And if these two verses would not have been revealed in the Book I would have never transmitted anything (to anybody):\" Those who conceal the clear evidence and the guidance that We revealed\" (ii. 159) tip to the last verse",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 6401,
			"arabicnumber": "2494.01",
			"text": "Ubaidullah b. Rafi', who was the scribe of 'All, reported:I heard 'Ali (Allah be pleased with him) as saying: Allah's Messenger (ﷺ) sent me and Zubair and Miqdad saying: Go to the garden of, Khakh [it is a place between Medina and Mecca at a distance of twelve miles from Medina] and there you will find a woman riding a camel. She would be in possession of a letter, which you must get from her. So we rushed on horses and when we met that woman, we asked her to deliver that letter to us. She said: There is no letter with me. We said: Either bring out that letter or we would take off your clothes. She brought out that letter from (the plaited hair of) her head. We delivered that letter to Allah's Messenger (ﷺ) in which Hatib b. Abu Balta'a had informed some people amongst the polytheists of Mecca about the affairs of Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) said: Hatib, what is this? He said: Allah's messenger, do not be hasty in judging my intention. I was a person attached to the Quraish. Sufyan said: He was their ally but had no relationship with them. (Hatib further said): Those who are with you amongst the emigrants have blood-relationship with them (the Quraish) and thus they would protect their families. I wished that when I had no blood-relationship with them I should find some supporters from (amongst them) who would help my family. I have not done this because of any unbelief or apostasy and I have no liking for the unbelief after I have (accepted) Islam. Thereupon Allah's Apostle (ﷺ) said: You have told the truth. 'Umar said: Allah's Messenger, permit me to strike the neck of this hypocrite. But he (the Holy Prophet) said: He was a participant in Badr and you little know that Allah revealed about the people of Badr: Do what you like for there is forgiveness for you. And Allah, the Exalted and Glorious, said:\" O you who believe, do not take My enemy and your enemy for friends\" (lx. 1). And there is no mention of this verse in the hadith transmitted on the authority of Abu Bakr and Zubair and Ishaq has in his narration made a mention of the recitation of this verse by Sufyan",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 6402,
			"arabicnumber": "2494.02",
			"text": "Ali reported that Allah's Messenger (ﷺ) sent me and Abu Marthad al-Ghitnavi and Zubair b. 'Awwam and we were all riders, and he said:Ride on until you reach the garden of Khakh for there is a woman amongst the polytheists and there is a letter with her sent by Hatib to the polytheists; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 6403,
			"arabicnumber": "2495",
			"text": "Jabir reported that a slave of Hatib came to Allah's Messenger (ﷺ) complaining against Hatib and said:Hatib will definitely go to Hell. (But) Allah's Messenger (ﷺ) said: You tell a lie; he would not get into that for he had taken part in Badr and in (the expedition of) Hudaibiya",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 6404,
			"arabicnumber": "2496",
			"text": "Umm Mubashshir reported that she heard Allah's Apostle (ﷺ) as saying in presence of Hafsa:God willing, the people of the Tree would never enter the fire of Hell one amongst those who owed allegiance under that. She said: Allah's Messenger, why not? He scolded her. Hafsa said: And there is none amongst you but shall have to pass over that (narrow Bridge). Thereupon Allah's Apostle (ﷺ) said: Allah, the Exalted and Glorious, has said: We would rescue those persons who are God-conscious and we would leave the tyrants to their fate there (xix. 72)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 6405,
			"arabicnumber": "2497",
			"text": "Abu Musa reported:I was in the company of Allah's Apostle (ﷺ) as he had been sitting in Ji'rana (a place) between Mecca and Medina and Bilal was also there, that there came to Allah's Apostle (ﷺ) a desert Arab, and he said: Muhammad, fulfill your promise that you made with me. Allah's Messenger (ﷺ) said to him: Accept glad tidings. Thereupon the desert Arab said: You shower glad tidings upon me very much; then Allah's Messenger (ﷺ) turned towards Abu Musa and Bilal seemingly in a state of annoyance and said: Verily he has rejected glad tidings but you two should accept them. We said: Allah's Messenger, we have readily accepted them. Then Allah's Messenger (ﷺ) called for a cup of water and washed his hands in that and face too and put the saliva in it and then said: Drink out of it and pour it over your faces and over your chest and gladden yourselves. They took hold of the cup and did as Allah's Messenger (ﷺ) had commanded them to do. Thereupon Umm Salama called from behind the veil: Spare some water in your vessel for your mother also, and they also gave some water which had been spared for her",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 6406,
			"arabicnumber": "2498",
			"text": "Abu Burda reported on the authority of his father that when Allah's Apostle (ﷺ) had been free from the Battle of Hunain, he sent Abu 'Amir as the head of the army of Autas. He had an encounter with Duraid b. as_Simma. Duraid was killed and Allah gave defeat to his friends. Abu Musa said:He (the Holy Prophet) sent me along with Abu 'Amir and Abu 'Amir received a wound in his knee from the arrow, (shot by) a person of Bani Jusham. It stuck in his knee. I went to him and said: Uncle, who shot an arrow upon you? Abu 'Amir pointed out to Abu Musa and said: Verily that one who shot an arrow upon me in fact killed me. Abu Musa said: I followed him with the determination to kill him and overtook him and when he saw me he turned upon his heels. I followed him and I said to him: Don't you feel ashamed (that you run), aren't you an Arab? Why don't you stop? He stopped and I had an encounter with him and we exchanged the strokes of (swords). I struck him with the sword and killed him. Then I came back to Abu Amir and said: Verily Allah has killed the one who killed you. And he said: Now draw out this arrow. I drew out the arrow and there came out from that (wound) water. Abu 'Amir said: My nephew, go to Allah's Messenger (ﷺ) and convey my greetings to him and tell him that Abu Amir begs you to ask forgiveness for him. And Abu Amir appointed me as the chief of the people and he died after a short time. When I came to Allah's Apostle (ﷺ) I visited him and he had been lying on the cot woven by strings and there was (no) bed over it and so there had been marks of the strings on the back of Allah's Messenger (ﷺ) and on his sides. I narrated to him what had happened to us and narrated to him about Abu Amir and said to him that he had made a request to the effect that forgiveness should be sought for him (from Allah). Thereupon Allah's Messenger (may peace be. upon him) called for water and performed ablution with it. He then lifted his hands and said. O Allah, grant pardon to Thy servant Abu Amir. (The Prophet had raised his hands so high for supplication) that I saw the whiteness of his armpits. He again said: O Allah, grant him distinction amongst the majority of Thine created beings or from amongst the people. I said: Allah's Messenger, ask forgiveness for me too. Thereupon Allah's Apostle (ﷺ) said: Allah, forgive the sins of Abdullah b. Qais (Abu Musa Ash'ari) and admit him to an elevated place on the Day of Resurrection. Abu Burda said: One prayer is for abu 'Amir and the other is tor Abu Musa",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 6407,
			"arabicnumber": "2499",
			"text": "Abu Musa reported that Allah's Messenger (ﷺ) said:I recognise the voice of the Ash'arites while they recite the Qur'an as they arrive during the night and I also recognise their station from the recital of the Qur'an during the night time, although I have not seen their encampments as they encamp during the day time. And there is a person amongst them, Hakim; when he encounters the horsemen or the enemies he says to them: My friends command you to wait for them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 6408,
			"arabicnumber": "2500",
			"text": "Abu Musa reported that Allah's Messenger (ﷺ) said:When the Ash'arites run short of provisions in the campaigns or run short of food for their children in Medina they collect whatever is with them in the cloth and then partake equally from one vessel. They are from me and I am from them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 6409,
			"arabicnumber": "2501",
			"text": "Ibn Abbas reported that the Muslims neither looked to Abu Sufyan (with respect) nor did they sit in his company. he (Abu Sufyan) said to Allah's Apostle (ﷺ):Allah's Apostle, confer upon me three things. He replied in the affirmative. He (further) said: I have with me the most handsome and the best (woman) Umm Habiba, daughter of Abu Sufyan; marry her, whereupon he said: Yes. And he again said: Accept Mu'awiya to serve as your scribe. He said: Yes. He again said: Make me the commander (of the Muslim army) so that I should fight against the unbelievers as I fought against the Muslims. He said: Yes. Abu Zumnail said: If he had not asked for these three things from Allah's Apostle (ﷺ), he would have never conferred them upon him, for it was (his habit) to accede to everybody's (earnest) request",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 6411,
			"arabicnumber": "2503",
			"text": "",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 6412,
			"arabicnumber": "2504",
			"text": "A'idh b. Amr reported that Abu Sufyan came to Salman, Suhaib and Bilal in the presence of a group of persons. They said:By Allah, the sword of Allah did not reach the neck of the enemy of Allah as it was required to reach. Thereupon Abu Bakr said: Do you say this to the old man of the Quraish and their chief? Then he came to Allah's Apostle (may peace be upon'him) and informed him of this. Thereupon he (the Holy Prophet) said: Abu Bakr, you have perhaps annoyed them and if you annoyed them you have in fact annoyed your Lord. So Abu Bakr came to them and said: O my brothers, I have annoyed you. They said: No, our brother, may Allah forgive you",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 6413,
			"arabicnumber": "2505",
			"text": "Jabir b. Abdullah reported that it was concerning them (the Ansar) that this verse was revealed, that when the two groups amongst you were about to lose heart and Allah was the Guardian of them both. This concerned Banu Salama and Banu Haritha and we did not like that Allah, the Exalted and Glorious, should not have revealed this verse for the fact that Allah (gave an assurance) of being the Guardian of both",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 6416,
			"arabicnumber": "2507",
			"text": "Anas reported that Allah's Messenger (ﷺ) sought forgiveness for the Ansar and he said:I think (he also sought forgiveness) for the children of the Ansar and the slaves and the freed men of the Ansar. I have no doubt about it",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 6417,
			"arabicnumber": "2508",
			"text": "Anas reported that Allah's Messenger (ﷺ) saw children and women of the Ansar coming back from a wedding feast. Allah's Apostle (ﷺ) stood up motionless (as a mark of respect) and said:O Allah, (bear witness) (and addressing the Ansar), said: You are dearest to me amongst people, (and said: O Allah (bear witness) (and addressing the Ansar), said: You are dearest to me amongst people. And he meant Ansar",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 6418,
			"arabicnumber": "2509.01",
			"text": "Anas b. Malik reported that a woman from the Ansar came to Allah's Messenger (ﷺ) and Allah's Messenger (ﷺ) stood aside with her and said:By Him in Whose Hand is my life, you are dearest to me amongst the people. He repeated it thrice",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 6419,
			"arabicnumber": "2509.02",
			"text": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 6420,
			"arabicnumber": "2510",
			"text": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:The Ansar are my family and my trusted friends. and the people would increase in number whereas they (the Ansar) would become less and less, so appreciate the deeds of those from amongst them who do good and overlook their failings",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 6421,
			"arabicnumber": "2511.01",
			"text": "Abu Usaid reported Allah's Messenger (ﷺ) as saying:The worthiest clans of the Ansar are Banu Najjar, thereafter Banu al-Ashhal; thereafter Banu Harith b. Banu Khazraj; thereafter Banu Sa'idah and there is goodness in all clans of the Ansar. Sa'd said: I see that he (the Holy Prophet) has placed others above us. It was said to (him): He has placed you above many others",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 6422,
			"arabicnumber": "2511.02",
			"text": "Abu Usaid Ansari has reported this hadith through another chain of transmitters. When the Prophet (ﷺ) was marching towards Badr in order",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 6423,
			"arabicnumber": "2511.03",
			"text": "Anas reported a hadith like this from Allah's Apostle (ﷺ) but he has made no mention in the hadith of the words of Sa'd",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 6424,
			"arabicnumber": "2511.04",
			"text": "Ibrahim b. Muhammad b. Talha reported:I heard Abu Sa'ld delivering an address in the presence of Abu 'Utba that the Messenger of Allah (ﷺ) said: The worthiest settlements of the Ansar are those of Banu Najjar, then of Banu 'Abu al-Ashhal and then of Banu Harith and then of Banu Khazraj and then of the clan of Banu Sa'idah, and if I were to give preference to anyone besides them I would have given preference to my relatives",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 6425,
			"arabicnumber": "2511.05",
			"text": "Abu Usaid Ansar reported:I bear witness to the fact that Allah's Messenger (ﷺ) said: The best settlements of the Ansar are of those of Banu Najjar, then of Banu 'Abu al-Aslihal and then of Banu Harith b. Khazraj, then of Banu Sa'ida and there is in every settlement of the Ansar good. Abu Salama reported that Abu Usaid said: Can I tell a Iie about Allah's Messenger (ﷺ)? And if I were a liar, I would have started with my tribe Banu Sa'ida. This was conveyed to Sa'd b. 'Ubida and he found (rankling) in his mind and said: We have been left behind (in the sense) that we have been (mentioned) last of the four. He (Sa'd) sid: Saddle my pony so that I should go to Allah's Messenger (ﷺ). His nephew saw him and said: Are you going to contradict (the order of) precedence set by Allah's Messenger (ﷺ), whereas Allah's Messenger (ﷺ) has the best knowledge of it? Is it not sufficient for you that you are the fourth amongst the four (best tribes of the Ansar)? So he returned and said: Allah and His Messenger know best, and he commanded that his pony should be unsaddled",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 6426,
			"arabicnumber": "2511.06",
			"text": "Abu Usaid Ansari reported that he heard Allah's Messenger (ﷺ) as saying:The worthiest of the Ansar or the worthiest of the settlements and the clans of Ansar; the rest of the hadith is the same, but there is no mention of the story of Sa'd b. 'Ubida (Allah be pleased with him)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 6427,
			"arabicnumber": "2512",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying in a large gathering of the Muslims:Should I not tell you of the best clans of the Ansar? They said: Allah's Messenger, (kindly) do this. Thereupon Allah's Messenger said: That is Banu Abd al-Ashhal. They said: Allah's Messenger, then next? He said: Banu Najjar. They again said: Allah's Messenger, then next? He said: Then of Banu Harith b. Khazraj. They then said: Allah's Messenger, then next? He said. Then of Banu Sa'ida. They said: Allah's Messenger, then next? He said: There is good in all the clans of the Ansar. It was upon this that Sa'd b. Ubida stood up in annoyance and said: Are we the last of the four as Allah's Messenger (ﷺ) has determined (the order of precedence) of their clans? He decided to talk with Allah's Messenger (ﷺ) on this issue, but the people Of his tribe said to him: Be seated, are you not happy with this that Allah's Messenger' (ﷺ) has mentioned your clan as one of the four (best) clans and those whom he left and did not mention (the order of their precedence) are more than those whom he mentioned? And Sa'd b. 'Ubada dropped the idea of talking to Allah's Messenger (ﷺ) (on this issue)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 6428,
			"arabicnumber": "2513",
			"text": "Anas b. Malik reported:I set out along with Jabrir b. 'Abdullah al-Bajali on a journey and he used to serve me. I said to him: Don't do that. Thereupon he said: I have seen Ansar doing this with Allah's Messenger (ﷺ). I swore by Allah whenever I accompany any one of the Ansar, I would serve him and Ibn Muthanni, and Ibn Bashshir made this addition in their narrations: Jarir was older than Anas, and Ibn Bashshir said: He was of a more advanced age as compared with Anas. Allah's Apostle (ﷺ) invoked blessings for the tribes of Ghifar and Aslam",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 6429,
			"arabicnumber": "2514.01",
			"text": "Abu Dharr reported Allah's Messenger (ﷺ) as saying:Go to your people and say that the Messenger of Allah (ﷺ) says: Ghifar (is a tribe) to whom Allah granted pardon, and Aslam (is the tribe) to whom Allah granted safety",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 6430,
			"arabicnumber": "2514.02",
			"text": "Abu Dharr reported Allah's Messenger (ﷺ) as saying:To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 6431,
			"arabicnumber": "2514.03",
			"text": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 6432,
			"arabicnumber": "2515",
			"text": "This hadith has been narrated through other chains of transmitters on the authority of Jabir and Abu Huraira that Allah's Apostle (ﷺ) said:To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 6433,
			"arabicnumber": "2516",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon. Verily it is not I that say this, but (it is) Allah the Exalted and Glorious. (who) says this",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 6434,
			"arabicnumber": "2517",
			"text": "Khufaf b. Jura' reported that Allah's Messenger (ﷺ) said in prayer:O Allah, hurl curse upon the tribe of Lihyan and Ri'l aid Dhakwan and Usayya for they disobeyed Allah and His Messenger, (and for) Ghifar Allah has granted pardon and for the tribe of Aslam Allah has granted safety",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 6435,
			"arabicnumber": "2518.01",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:Allah has granted pardon to the tribe of Ghifar and to the tribe of Aslam Allah has granted safety and as for Usayya tribe, they disobeyed Allah and His Messenger",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 6436,
			"arabicnumber": "2518.02",
			"text": "This hadith has been transmitted on the authority of Ibn Umar with a slight variation of wording (and the wording) that Allah's Messenger (ﷺ) said this on the pulpit",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 6437,
			"arabicnumber": "2518.03",
			"text": "This hadith has been reported on the authority of Ibn Umar but through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 6438,
			"arabicnumber": "2519",
			"text": "Abu Ayyub reported Allah's Messenger (ﷺ) as saying:The tribes of Ansar, Muzaina and Juhaina and Ghifar and Ashja' and those from Banu 'Abdullah, they are my friends amongst the people and Allah and His Messenger are their protectors",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 6439,
			"arabicnumber": "2520.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Quraish, Ansar, Muzaina, Juhaina and Ghifar, they are my friends and there is no friend of theirs besides Allah and His Messenger",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 6440,
			"arabicnumber": "2520.02",
			"text": "This hadith has been transmitted on the authority of Sa'd b. Ibrahim with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 6441,
			"arabicnumber": "2521.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The tribes of Ashja', Ghifar and Muzaina and from the tribe of Juhaina they are better than Banu Tamim, Banu Amir and the allies of Asad and Ghatfan",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 6442,
			"arabicnumber": "2521.02",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:By Him in Whose Hand is the life of Muhammad, (the tribes of) Ghifar, Aslam, Muzaina, or from the tribe of Juhaina or from the tribe of Muzaina, they would be better in the eye of Allah than Asad, Tayyi, and Ghatfan on the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 6443,
			"arabicnumber": "2521.03",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Aslam, Ghifar or some people from Muzaina, Juhaina (with the variation of words) are better in the eye of Allah than Asad, Ghatfan, Hawizin and Tamim. The narrator said: I think he also said:\" On the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 6444,
			"arabicnumber": "2522.01",
			"text": "Abu Bakra reported from his father that al-Aqra' b. Habis reported that he came to Allah's Messenger (ﷺ) and said to him:How did the tribes of Aslam, Ghifar, Muzaina (and I think he also said Juhaina and the narrator is in doubt about it) owe allegiance to you, whereas they plundered the pilgrims? Thereupon Allah's Messenger (ﷺ) said:\" you were to say that Aslam, Ghifar, Muzaina and I think Juhaina are better than Banu Tamim, Banu 'Amir and Asad, Ghatfan, then would these people (of latter group of tribes) be in loss? He said: Yes. Thereupon he (the Holy Prophet) said: By Him in Whose Hand is my life, these people are better than Banu Tamim, Banu Amir, Asad and Ghatfan, and in this hadith of Abu Shaiba (these words are not found) that Muhammad (the narrator) had a doubt about",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 6445,
			"arabicnumber": "2522.02",
			"text": "This hadith has been narrated on the authority of Abu Ya'qub Dabbi with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 6446,
			"arabicnumber": "2522.03",
			"text": "Abu Bakra reported from the Messenger of Allah (ﷺ) that Aslam, Ghifar, Muzaina and Juhaina are better than Banu Tamim, Banu Amir and their allies Banu Asad and Ghatfan",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 6447,
			"arabicnumber": "2522.04",
			"text": "This hadith has been reported on the authority of Abu Bishr with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 6448,
			"arabicnumber": "2522.05",
			"text": "Abu Bakra reported on the authority of his father that Allah's Messenger (ﷺ) said:What is your view if Juhaina, Aslam, Ghifar were better than Banu Tamim, Banu 'Abdullah b. Ghatfan and 'Amir b. Sa'sa'a' respectively (then what would be status of the latter one)? He said this in a loud voice. They said: Allah's Messenger, they would be definitely at a loss and disadvantage. Thereupon he said: They (the first group) are decidedly better than the others; and in the hadith transmitted on the authority of Abu Kuraib the words are: It you were to find that Juhaina, Muzaina and Aslam and Ghifar (are better than)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 6449,
			"arabicnumber": "2523",
			"text": "Adi b. Hatim reported:I came to Umar b. Khattab and he said to me: The first consignment of Sadaqa brought to Allah's Messenger (ﷺ) which brightened the face of Allah's Messenger (ﷺ) and the faces of his Companions was that of Tayyi",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 6450,
			"arabicnumber": "2524",
			"text": "Abu Huraira reported that Tufail and his companions said:Allah's Messenger, the tribe of Daws has disbelieved and has belied you, so invoke curse upon them. It was said: Let Daws be destroyed, whereupon he (Allah's Messenger) said: Allah guide aright the tribe of Daws and direct them to me",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 6451,
			"arabicnumber": "2525.01",
			"text": "empty",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 6452,
			"arabicnumber": "2525.02",
			"text": "The other hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 6453,
			"arabicnumber": "2525.03",
			"text": "Abu Huraira reported:There are some distinguishing features of Banu Tamim which I heard from Allah's Messenger (ﷺ) and my love for them is never on the decline after that and the words are: They are the bravest amongst people in the battlefield and there is no mention of (the word)\" Dajjal",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 6454,
			"arabicnumber": "2526.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:You would find people like those of mine, the good amongst you in the Days of Ignorance would be good amongst you in the days of Islam, provided they have an understanding of it and you will find good amongst people the persons who would be averse to position of authority until it is thrust upon them, and you will find the worst amongst persons one who has double face. He comes with one face to them and with the other face to the others",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 6455,
			"arabicnumber": "2526.02",
			"text": "This hadith has been transmitted through other chains of transmitters. The chain of of Abu Zur'a has a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 6456,
			"arabicnumber": "2527.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Good amongst the women are those who ride camels. One of them said: They are pious women of the Quraish, and the other one said: The women of the Quraish are kind to the orphans in their childhood and look after the wealth of their spouses",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 6457,
			"arabicnumber": "2527.02",
			"text": "This hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording and there is no word\" orphan",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 6458,
			"arabicnumber": "2527.03",
			"text": "Abu Huraira reported:I heard Allah's Messenger (ﷺ) as saying: The women of the Quraish are good amongst the womenfolk. They ride camels and show affection to their children and zealously guard the wealth of their husbands. Abu Huraira said at the end of this narration that Mary, the daughter of Imran, never rode the camel",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 6459,
			"arabicnumber": "2527.04",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) gave a proposal of marriage to Umm Hani, the daughter of Abu Talib, whereupon she said:Allah's Messenger, I am of an advanced age with a (large) family. Thereupon Allah's Messenger (ﷺ) said: The best women are those who ride (the camels) ; the rest of the hadith is the same but with this difference that, instead of the word Ar'a the word Ahna has been used (and the complete sentence is like this): That they treat children in their childhood with affection",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 6460,
			"arabicnumber": "2527.05",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The best women who ride the camels are the pious women of the Quraish; they treat with affection children in their childhood and keep a strict watch on the wealth of their spouses",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 6461,
			"arabicnumber": "2527.06",
			"text": "This hadith has been reported on the authority of Abu Huraira with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 6462,
			"arabicnumber": "2528",
			"text": "Anas reported that Allah's Messenger (ﷺ) established fraternity between Abu Ubaida b. Jarrah and Abu Talha",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 6463,
			"arabicnumber": "2529.01",
			"text": "It was said to Anas b. Malik:You must have heard this that Allah's Messenger (ﷺ) said: There is no alliance (hilf) of brotherhood in Islam. Anas said: Allah's Messenger (ﷺ) established the bond of fraternity between the Quraish and the Ansar in his home",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 6464,
			"arabicnumber": "2529.02",
			"text": "Anas reported Allah's Messenger (ﷺ) established fraternity between the Quraish and the Ansar in his house at Medina",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 6465,
			"arabicnumber": "2530",
			"text": "Jubair b. Mut'im reported Allah's Messenger (ﷺ) as saying:There is no alliance (hilf) in Islam but (the hilf) established in the pre-Islamic days (for good). Islam intensifies and strengthens it",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 6466,
			"arabicnumber": "2531",
			"text": "Abu Burda reported on the authority of his father:We offered the sunset prayer along with Allah's Apostle (ﷺ). We then said: If we sit (along with Allah's Messenger) and observe night prayer with him it would be very good, so we sat down and he came to us and said: You are still sitting here. I said: Allah's Messenger, we observed evening prayer with you, then we said: Let us sit down and observe night prayer along with you, whereupon he said: You have done well or you have done right. He then lifted his head towards the sky and it often happened that as he lifted his head towards the sky, he said: The stars are a source of security for the sky and when the stars disappear there comes to the sky, i. e. (it meets the same fate) as it has been promised (it would plunge into darkness). And I am a source of safety and security to my Companions and when I would go away there would fall to the lot (of my Companions) as they have been promised with and my Companions are a source of security for the Umma and as they would go there would fall to the lot of my Umma as (its people) have been promised",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 6467,
			"arabicnumber": "2532.01",
			"text": "Abu Sa'id Khudri reported Allah's Apostle (ﷺ) as saying:A time would come for the people when groups of people would set out for fighting in the cause of Allah and it would be said to them: Is there one amongst you who saw Allah's Messenger (ﷺ)? And they would say: Yes, and they would be victorious. Then the people would set out for fighting in the cause of Allah and it would be said to them: Is there one amongst you who saw those (who have had the privilege of sitting in the company of Allah's Messenger (ﷺ)? And they would say: Yes, and victory would be granted to them. Then a group of persons would set out for fighting in the cause of Allah and it would be said to them: Is there one amongst you who saw one of those who saw those who (had the privilege) of sitting in the company of Allah's Messenger (ﷺ)? And they would say: Yes, and the Victory would be granted to them",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 6468,
			"arabicnumber": "2532.02",
			"text": "Abu Sa'id Khudri reported Allah's Messenger (ﷺ) as saying:There would come to the people a time when a detachment would be sent for fighting in the cause of Allah and they would say: See, if you can find amongst them someone from amongst the Companions of Allah's Apostle (ﷺ). They would find a person and they would be granted victory because of him. Then a second detachment would be sent to them and they would say: Do you find amongst them one who had had the privilege of seeing the Companions of the Messenger of Allah (ﷺ)? -and the victory would be granted to them because of him. Then the third detachment would be sent and it would be said to them: See, if you find amongst them (who had had the honour of seeing one) who saw those who saw the Companions of Allah's Apostle (ﷺ). Then the fourth detachment would be sent and it would be said to them: See it you find amongst them one who had the privilege (of seeing) one who saw those who saw those who saw the Companions of Allah's Apostle (ﷺ), and a person would be found and they would be granted victory because of him",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 6469,
			"arabicnumber": "2533.01",
			"text": "Abdullah reported Allah's Messenger (ﷺ) as saying:The best of my Umma would be those of the generation nearest to mine. Then those nearest to them, then those nearest to them, then people would come whose witness would precede the oath and the oath will precede the witness. Hannad has not made the mention of Qarn in his narration. Qutaiba said that, instead of the word Qaum, the word Aqwam has been used",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 6470,
			"arabicnumber": "2533.02",
			"text": "Abdullah reported:It was asked from Allah's Apostle (ﷺ) who amongst the people were the best. He said: (People) of my generation, then those next to them, then those next to them, then there would come a people whose evidence would precede their oath and their oath would precede their evidence. Ibrahim said: They forbade us to make vows and bear witness when we were too young",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 6471,
			"arabicnumber": "2533.03",
			"text": "This hadith has been transmitted by Mansur on the authority of Abu al-Ahwas and Jarir with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 6472,
			"arabicnumber": "2533.04",
			"text": "Abdullah (b. Mas'ud) reported Allah's Apostle (ﷺ) as saying:The best among people are of my generation, then those next to them. (The narrator said): I do not know whether (he said) it three times or four times. Then there would fellow after them such persons whose evidence would precede the oath, and in case of some others, the oath (would precede) the evidence",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 6473,
			"arabicnumber": "2534.01",
			"text": "Abu Huraira reported Allah's Messenger (may, peace be upon him) as saying:The best age of my Umma is one in which I was sent (by Allah as an Apostle), then the one next to that. (The narrator said): And Allah knows best whether he stated this third (time) or not. Then there would come people who would love (to look) bulky and they would hasten to the witness box before they are asked to bear witness",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 6474,
			"arabicnumber": "2534.02",
			"text": "This hadith has been reported on the authority of Abu Huraira through another chain of transmitters (but with this variation) that Abu Huraira said:I do not know whether he (the Holy Prophet) said (these words:\" Then next\" ) twice or thrice",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 6475,
			"arabicnumber": "2535.01",
			"text": "Imran b. Husain reported Allah's-Messenger (ﷺ) as saying:The best among you (are) the people (who belong to) my age. Then those next to them, then those next to them, then those next to them. 'Imran said: I do not know whether Allah's Messenger (ﷺ) said twice or thrice (the words:\" Then next\" ) after (saying) about his (own age but he then said): Then after them (after successors or those who would succeed them) would come a people who would give evidence before they are asked for it, and would be dishonest and not trustworthy, who would make vows but would not fulfil them, and would be significant in being bulky",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 6476,
			"arabicnumber": "2535.02",
			"text": "This hadith has been reported on the authority of Shu'ba with the same chain of transmitters (and the words are):I do not know whether he made a mention of two generations after his generation or of the third one too. Shababa said: I heard this from Zahdam b. Mudarrib as he came to me riding a horse for some need and he narrated it to me that he had heard it from 'Imran b. Husain, and in the hadith transmitted on the authority of Yahya and Shababa (the words are): They take an oath but they do not fulfil it, and in the hadith transmitted on the authority of Bahz there the word is Yafun as transmitted on the authority of Ibn Ja'far",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 6477,
			"arabicnumber": "2535.03",
			"text": "This hadith has been narrated on the authority of 'Imran b. Husain through another chain of transmitters (and the words are):The best generation of this Umma is the generation to which I have been sent, then the next one, and there is an addition in the hadith transmitted on the authority of Abu 'Awana (and the words are): And Allah knows best whether he made a mention of the third (generation) or not; the rest of the hadith is the same as transmitted by Zahdam on the authority of 'Imran. And in the hadith transmitted by Hisham on the authority of Qatada there is an addition of these words: They take an oath whereas they are not asked to take",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 6478,
			"arabicnumber": "2536",
			"text": "A'isha reported that a person asked Allah's Apostle (ﷺ) as to who amongst the people were the best. He said:Of the generation to which I belong, then of the second generation (generation adjacent to my generation), then of the third generation (generation adjacent to the second generation)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 6479,
			"arabicnumber": "2537.01",
			"text": "Abdullah b. Umar reported that Allah's Messenger (ﷺ) led us 'Isha' prayer at the latter part of the night and when he had concluded it by salutations he stood up and said:Have you seen this night of yours? At the end of one hundred years after this none would survive on the surface of the earth (from amount my Companions). Ibn Umar said: People were (not understanding) these words of the Messenger of Allah (ﷺ) which had been uttered pertaining to one hundred years. Allah's Messenger (ﷺ) in fact meant (by these words) that on that day none from amongst those who had been living upon the earth (from amongst his Companions) would survive (after one hundred years) and that would be the end of this generation",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 6480,
			"arabicnumber": "2537.02",
			"text": "This hadith has been transmitted by Zuhri on the authority of Ma'mar",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 6481,
			"arabicnumber": "2538.01",
			"text": "Jabir b. 'Abdullah reported:I heard Allah's Messenger (ﷺ) as saying this one month before his death: You asked me about the Last Hour whereas its knowledge is with Allah. I, however, take an oath and say that none upon the earth, the created beings (from amongst my Companions), would survive at the end of one hundred years",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 6482,
			"arabicnumber": "2538.02",
			"text": "This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters, but there is no mention of the words:\" one month before his death",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 6483,
			"arabicnumber": "2538.03",
			"text": "Jabir b. 'Abdullah reported Allah's Apostle (ﷺ) as saying one mouth before his death (or something like it):None amongst the created beings who had been living by that time (during the lifetime of Allah's Apostle).... 'Abd al-Rahman has interpreted these words of Allah's Apostle (ﷺ) as: The ages (of the people) would be diminished",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 6484,
			"arabicnumber": "2538.04",
			"text": "This hadith has been reported on the authority of Sulaiman Taimi through other chains of transmitters",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 6485,
			"arabicnumber": "2539",
			"text": "Abu Sa'id reported that when Allah's Apostle (ﷺ) came back from Tabuk they (his Companions) asked about the Last Hour. Thereupon Allah's Messenger (ﷺ) said:There would be none amongst the created beings living on the earth (who would survive this century)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 6486,
			"arabicnumber": "2538.05",
			"text": "Jabir b. 'Abdullah reported that Allah's Messenger (ﷺ) said:None amongst the created beings (from my Companions) would survive after one hundred years. Salim said: We made a mention of it to him (Jabir), whereupon he said: It means those who had been living on that day",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 6487,
			"arabicnumber": "2540",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Do not revile my Companions, do not revile my Companions. By Him in Whose Hand is my life, if one amongst you would have spent as much gold as Uhud it would not amount to as much as one much on behalf of one of them or half of it",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 6488,
			"arabicnumber": "2541.01",
			"text": "Abu Sa'id reported there was some altercation between Khalid b. Walid and Abd al-Rahman b. 'Auf and Khalid reviled him. Thereupon Allah's Messwger (ﷺ) said:None should revile my Companions. for if one amongst you were to spend as much gold as Uhud, it would not amount to as much as one mudd of one of them or half of it",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 6489,
			"arabicnumber": "2541.02",
			"text": "This hadith has been transmitted on the authority of al-A'mash and there is no mention by Shu'ba and Waki' of 'Abd al-Rahman b. Auf and Khalid",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 6490,
			"arabicnumber": "2542.01",
			"text": "Usair b. Jabir reported that a delegation from Kufa came to 'Umar and there was a person amongst them who jeered at Uwais. Thereupon Umar said:Is there amongst us one from Qaran? That person came and Umar said: Verily Allah's Messenger (ﷺ) has said: There would come to you a person from Yemen who would be called Uwais and he would leave none in Yemen (behind him) except his mother, and he would have the whiteness (due to leprosy) and he supplicated Allah and it was cured except for the size of a dinar or dirham. He who amongst you meets him should ask him to supplicate for forgiveness (from Allah) for you",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 6491,
			"arabicnumber": "2542.02",
			"text": "Umar b. Khattab reported:I heard Allah's Messenger (ﷺ) as saying: Worthy amongst the successors would be a person who would be called Uwais. He would have his mother (living with him) and he would have (a small) sign of leprosy. Ask him to beg pardon for you (from Allah)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 6492,
			"arabicnumber": "2542.03",
			"text": "Usair b. Jabir reported that when people from Yemen came to help (the Muslim army at the time of jihad) he asked them:Is there amongst you Uwais b. 'Amir? (He continued finding him out) until he met Uwais. He said: Are you Uwais b., Amir? He said: Yes. He said: Are you from the tribe of Qaran? He said: Yes. He (Hadrat) 'Umar (again) said: Did you suffer from leprosy and then you were cured from it but for the space of a dirham? He said: Yes. He ('Umar) said: Is your mother (living)? He said: Yes. He ('Umar) said: I heard Allah's Messenger (ﷺ) say: There would come to you Uwais b. Amir with the reinforcement from the people of Yemen. (He would be) from Qaran, (the branch) of Murid. He had been suffering from leprosy from which he was cured but for a spot of a dirham. His treatment with his mother would have been excellent. If he were to take an oath in the name of Allah, He would honour that. And if it is possible for you, then do ask him to beg forgiveness for you (from your Lord). So he (Uwais) begged forgiveness for him. Umar said: Where do you intend to go? He said: To Kufa. He ('Umar) said: Let me write a letter for you to its governor, whereupon he (Uwais) said: I love to live amongst the poor people. When it was the next year, a person from among the elite (of Kufa) performed Hajj and he met Umar. He asked him about Uwais. He said: I left him in a state with meagre means of sustenance. (Thereupon) Umar said: I heard Allah's Messenger (ﷺ) as saying: There would come to you Uwais b. 'Amir, of Qaran, a branch (of the tribe) of Murid, along with the reinforcement of the people of Yemen. He had been suffering from leprosy which would have been cured but for the space of a dirham. His treatment with his mother would have been very kind. If he would take an oath in the name of Allah (for something) He would honour it. Ask him to beg forgiveness for you (from Allah) in case it is possible for you. So he came to Uwais and said.: Beg forgiveness (from Allah) for me. He (Uwais) said: You have just come from a sacred journey (Hajj) ; you, therefore, ask forgiveness for me. He (the person who had performed Hajj) said: Ask forgiveness for me (from Allah). He (Uwais again) said: You have just come from the sacred journey, so you ask forgiveness for me. (Uwais further) said: Did you meet Umar? He said: Yes. He (Uwais) then begged forgiveness for him (from Allah). So the people came to know about (the status of religious piety) of Uwais. He went away (from that place). Usair said: His clothing consisted of a mantle, and whosoever saw him said: From where did Uwais get this mantle?",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 6493,
			"arabicnumber": "2543.01",
			"text": "Abu Dharr reported Allah's Messenger (ﷺ) as saying:You would soon conquer a land where people are in the habit of using foul language. They have a right of kinship upon you. And when you see two persons fighting for the space of a brick, then get out of that. He (Abu Dharr) then happened to pass by Rabila and 'Abd al-Rahman, the two sons of Shurahbil b. Hasana, and they had been disputing for the space of a brick. So he left the land",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 6494,
			"arabicnumber": "2543.02",
			"text": "Abu Dharr reported Allah's Messenger (ﷺ) as saying:You would soon conquer Egypt and that is a land which is known (as the land of al-qirat). So when you conquer it, treat its inhabitants well. For there lies upon you the responsibility because of blood-tie or relationship of marriage (with them). And when you see two persons falling into dispute amongst themselves for the space of a brick, than get out of that. He (Abu Dharr) said: I saw Abd al-Rahman b. Shurahbil b. Hasana and his brother Rabi'a disputing with one another for the space of a brick. So I left that (land)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 6495,
			"arabicnumber": "2544",
			"text": "Abu Barza reported that Allah's Messenger (ﷺ) sent a person to a tribe amongst the tribes of Arabia. They reviled him and beat him. He came to Allah's Messenger (ﷺ) and narrated to him (the story of atrocities perpetrated upon him by the people of the tribe). Thereupon he (the Holy Prophet) said:If you were to come to the people of 'Uman, they would have neither reviled you nor beaten you",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 6496,
			"arabicnumber": "2545",
			"text": "Abu Naufal reported:I saw (the dead body) of Abdullah b. Zubair hanging on the road of Medina (leading to Mecca). The Quraish passed by it and other people too, that Abdullah b. Umar happened to pass by it. He stood up there and said: May there be peace upon you, Abu Khubaib (the Kunya of Hadrat 'Abdullah b. Zubair), may there be peace upon you Abu Khubaib, may there be peace upon you, Abu Khubaib! By Allah, I used to forbid you from this; by Allah, I used to forbid you from this, by Allah I used to forbid you from this. By Allah, so far as I know, you had been very much devoted to fasting and prayer and you had been paying very much care to cementing the ties of blood. By Allah, the group to which you belong (are labelled) as (a) wicked (person) is indeed a fine group. Then 'Abdullah b. 'Umar went away. The stand 'Abdullah (b. 'Umar) took in regard to the inhuman treatment (meted out to 'Abdullah b. Zubair) and his words (in that connection) were conveyed to Hajjaj (b. Yusuf) and (as a consequence of that) he (the body of Abdullah b. Zubair) was brought down from the stump (the scaffold) by which it was hanging and thrown into the graves of the Jews. He (Hajjaj) sent (his messenger) to Asma' (bint Abu Bakr, 'Abdullah's mother). But she refused to come. He again sent the messenger to her with the message that she must come, otherwise he would bring her forcibly catching hold of her hair. But she again refused and said: By Allah, I will not come to you until you send one to me who would drag me by pulling my hair. Thereupon he said: Bring me my shoes. He put on his shoes and walked on quickly swollen with vanity and pride until he came to her and said: How do you find what I have done with the enemy of Allah? She said: I find that you wronged him in this world, whereas he has spoiled your next life. It has been conveyed to me that you used to call him ('Abdullah b. Zubair) as the son of one having two belts. By Allah, I am indeed (a woman) of two belts. One is that with the help of which I used to suspend high the food of Allah's Messenger (ﷺ) and that of Abu Bakr (making it out of the reach) of animals and, so far as the second belt is concerned, that is the belt which no woman can dispense with. Verily Allah's Messenger (ﷺ) told us that in Thaqif, there would be born a great liar and great murderer. The liar we have seen, and as far as the murderer is concerned, I do not find anyone else besides you. 'Thereupon he (Hajjaj) stood up and did not give any reply to her",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 6497,
			"arabicnumber": "2546.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:If the din were at the Pleiades, even then a person from Persia would have taken hold of it, or one amongst the Persian descent would have surely found it",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 6498,
			"arabicnumber": "2546.02",
			"text": "Abu Huraira reported:We were sitting in the company of Allah's Apostle (ﷺ) that Sura al-Jumu'a was revealed to him and when he recited (these words):\" Others from amongst them who have not yet joined them,\" a person amongst them (those who were sitting there) said: Allah's Messenger! But Allah's Apostle (ﷺ) made no reply, until he questioned him once, twice or thrice. And there was amongst us Salman the Persian. The Apostle of Allah (ﷺ) placed his hand on Salman and then said: Even if faith were near the Pleiades, a man from amongst these would surely find it",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 6499,
			"arabicnumber": "2547",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as saying:You would find people like one hundred camels and you would not find even one (camel) fit for riding",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 328
			}
		}
	]
}