{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"46": "The Book of Destiny"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6723,
			"arabicnumber": "2643.01",
			"text": "Abdullah (b. Mas'ud) reported that Allah's Messenger (ﷺ) who is the most truthful (of the human beings) and his being truthful (is a fact) said:Verily your creation is on this wise. The constituents of one of you are collected for forty days in his mother's womb in the form of blood, after which it becomes a clot of blood in another period of forty days. Then it becomes a lump of flesh and forty days later Allah sends His angel to it with instructions concerning four things, so the angel writes down his livelihood, his death, his deeds, his fortune and misfortune. By Him, besides Whom there is no god, that one amongst you acts like the people deserving Paradise until between him and Paradise there remains but the distance of a cubit, when suddenly the writing of destiny overcomes him and he begins to act like the denizens of Hell and thus enters Hell, and another one acts in the way of the denizens of Hell, until there remains between him and Hell a distance of a cubit that the writing of destiny overcomes him and then he begins to act like the people of Paradise and enters Paradise",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6724,
			"arabicnumber": "2643.02",
			"text": "This hadith has been reported on the authority of A'mash with the same chain of transmitters and in the hadith transmitted on the authority of Waki' (the words are):\" The creation of any one of you is like this that (semen) is collected in the womb of the mother for forty nights,\" and in the hadith transmitted on the authority of Shu'ba (the words are):\" Forty nights and forty days.\" And in the hadith transmitted on the authority of Jarir and 'Isa (the words are):\" Forty days",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6725,
			"arabicnumber": "2644",
			"text": "Hudhaifa b. Usaid reported directly from Allah's Messenger (ﷺ) that he said:When the drop of (semen) remains in the womb for forty or forty five nights, the angel comes and says: My Lord, will he be good or evil? And both these things would be written. Then the angel says: My Lord, would he be male or female? And both these things are written. And his deeds and actions, his death, his livelihood; these are also recorded. Then his document of destiny is rolled and there is no addition to nor subtraction from it",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6726,
			"arabicnumber": "2645.01",
			"text": "Abdullah b. Mas'ud reported:Evil one is he who is evil in the womb of his mother and the good one is he who takes a lesson from the (fate of) others. The narrator came to a person from amongst the Companions of Allah's Messenger (ﷺ) who was called Hudhaifa b. Usaid Ghifari and said: How can a person be an evil one without (committing an evil) deed? Thereupon the person said to him: You are surprised at this, whereas I have heard Allah's Messenger (ﷺ) as saying: When forty-two nights pass after the semen gets into the womb, Allah sends the angel and gives him shape. Then he creates his sense of hearing, sense of sight, his skin, his flesh, his bones, and then says: My Lord, would he be male or female? And your Lord decides as He desires and the angel then puts down that also and then says: My Lord, what about his age? And your Lord decides as He likes it and the angel puts it down. Then he says: My Lord, what about his livelihood? And then the Lord decides as He likes and the angel writes it down, and then the angel gets out with his scroll of destiny in his hand and nothing is added to it and nothing is subtracted from it",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6727,
			"arabicnumber": "2645.02",
			"text": "This hadith has been narrated on the authority of 'Abdullah b. Mas'ud through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6728,
			"arabicnumber": "2645.03",
			"text": "Abu Tufail reported:I visited Abu Sariha Hudhaifa b. Usaid al-Ghifari who said: I listened with these two ears of mine Allahs Messenger (ﷺ) as saying: The semen stays in the womb for forty nights, then the angel, gives it a shape. Zubair said: I think that he said: One who fashions that and decides whether he would be male or female. Then he (the angel) says: Would his limbs be full or imperfect? And then the Lord makes thein full and perfect or otherwise as He desires. Then he says: My Lord, what about his livelihood, and his death and what about his disposition? And then the Lord decides about his misfortune and fortune",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6729,
			"arabicnumber": "2645.04",
			"text": "Hadhaifa b. Usaid Ghifari, a Companion of Allah's Messenger (ﷺ), reported it directly from Allah's Messenger (may peace upon him). as he said:There is an angel who looks after the womb when Allah decides to create any- thing after more than forty nights are over; the rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6730,
			"arabicnumber": "2646",
			"text": "Anas b. Malik reported directly from Allah's Messenger (ﷺ) that he said:Allah, the Exlated and Glorious, has appointed an angel as the caretaker of the womb, and he would say: My Lord, it is now a drop of semen; my Lord, It is now a clot of blood; my Lord, it has now become a lump of flesh, and when Allah decides to give it a final shape, the angel says: My Lord, would it be male or female or would he be an evil or a good person? What about his livelihood and his age? And it is all written as he is in the womb of his mother",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6731,
			"arabicnumber": "2647.01",
			"text": "Ali reported:We were in a funeral in the graveyard of Gharqad when Allah's Messenger (ﷺ) came to us and we sat around him. He had a stick with him. He lowered his head and began to scratch the earth with his stick, and then said: There is not one amongst you whom a seat in Paradise or Hell has not been allotted and about whom it has not been written down whether he would be an evil person or a blessed person. A person said: Allah's Messenger, should we not then depend upon our destiny and abandon our deeds? Thereupon he said: Acts of everyone will be facilitated in that which has been created for him so that whoever belongs to the company of the blessed will have good works made easier for him and whoever belongs to the unfortunate ones will have evil acts made easier for him. He then recited this verse (from the Qur'an): \"Then, who gives to the needy and guards against evil and accepts the excellent (the truth of Islam and the path of righteousness it prescribes), We shall make easy for him the easy end and who is miserly and considers himself above need, We shall make easy for him the difficult end\" (xcii. 5-10)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6732,
			"arabicnumber": "2647.02",
			"text": "This hadith has been narrated on the authority of Mansur with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6733,
			"arabicnumber": "2647.03",
			"text": "Ali reported that one day Allah's Messenger (ﷺ) was sitting with a wood in his hand and he was scratching the ground. He raised his head and said:There is not one amongst you who has not been allotted his seat in Paradise or Hell. They said: Allah's Messenger. then, why should we perform good deeds, why not depend upon our destiny? Thereupon he said. No, do perform good deeds, for everyone is facilitated in that for which he has been created; then he recited this verse:\" Then, who gives to the needy and guards against evil and accepts the excellent (the truth of Islam and the path of righteousness it prescribes), We shall make easy for him the easy end...\" (xcii. 5-10)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6734,
			"arabicnumber": "2647.04",
			"text": "This hadith has been narrated on the authority of 'Ali through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6735,
			"arabicnumber": "2648.01",
			"text": "Jabir reported that Suriqa b. Malik b. Ju'shuin came and said:Allah's Messenger, explain our religion to us (in a way) as if we have been created just now. Whosoever deeds we do today, is it because of the fact that-the pens have dried (after recording them) and the destitiles have began to operate or these have effects in future? Thereupon he said: The pens have dried tmd destinies have begun to operate. (Suraqa b. Malik) said: If it Is so, then what is the use of doing good deeds? Zuhair said: Then Abu Zubair said something but I could not understand that and I said. What did he say? Thereupon he said: Act, for everyone is facilitated what he intends to do",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6736,
			"arabicnumber": "2648.02",
			"text": "This hadith has been transmitted on the authority of Jabir b. Abdullah with the same wording (and includes these words):\" Allah's Messenger (ﷺ) said: Every doer of deed is facilitated in his action",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6737,
			"arabicnumber": "2649.01",
			"text": "Imran b. Husain repotted that it was said to Allah's Messenger (ﷺ):Has there been drawn a distinction between the people of Paradise and the denizens of hell? He said: Yes. It was again said: (If it is so), then What is the use of doing good deeds? Thereupon he said: Everyone is facilitated in what has been created for him",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6738,
			"arabicnumber": "2649.02",
			"text": "This hadith has been narrated through other chains of transmiters with slight variations of wording",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6739,
			"arabicnumber": "2650",
			"text": "Abu al-Aswad reported that 'Imran b Husain asked him:What is your view, what the people do today in the world, and strive for, is it something decreed for them or preordained for them or will their fate in the Hereafter be deterrained by the fact that their Prophets brought them teaching which they did not act upon? I said: Of course, it is something which is predetermined for them and preordained for them. He (further) said: Then, would it not be an injustice (to punish them)? I felt greatly disturbed because of that, and said: Everything is created by Allah and lies in His Power. He would not be questioned as to what He does, but they would be questioned; thereupon he said to me: May Allah have mercy upon you, I did not mean to ask you but for testing your intelligence. Two men of the tribe of Muzaina came to Allah's Messenger (ﷺ) and said: Allah's Messenger, what is your opinion that the people do in the world and strive for, is something decreed for them; something preordained for them and will their fate in the Hereafter be determined by the fact that their Prophets brought them teachings which they did not act upon. and thus they became deserving of punishment? Thereupon, he said: Of course, it happens as it is decreed by Destiny and preordained for them, and this view is confirmed by this verse of the Book of Allah, the Exalted and Glorious:\" Consider the soul and Him Who made it perfect, then breathed into it its sin and its piety\" (xci. 8)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6740,
			"arabicnumber": "2651",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Verily, a man would perform the deeds of the people of Paradise for a long time, then his deeds would be concluded with the deeds of the people of Hell. And verily, a man would perform the deeds of the people of Hell for a long time, and then his deeds would be concluded with the deeds of the people of Paradise",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6741,
			"arabicnumber": "112.02",
			"text": "Sahl b. Sa'd reported it from Allah's Messenger (ﷺ) that a person performs deeds like the deeds of the people of Paradise apparently before people and he would be amongst the dwellers of Hell and a person acts apparently like the people of Hell, but (in fact) he would be among the dwellers of Paradise",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6742,
			"arabicnumber": "2652.01",
			"text": "Abu Huraira reported Allah's Messenger (way peace be upon him) as saying:There was argument between Adam and Moses. Moses said to Adam: You are our father. You did us harm and caused us to get out of Paradise. Adam said to him: You are Moses. Allah selected you (for direct conversation with you) and wrote with His own Hand the Book (Torah) for you. Despite this you blame me for an act which Allah had ordained for me forty years before He created me. Allah's Apostle (ﷺ) said:. This is how Adam came the better of Moses and Adam came the better of Moses",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6743,
			"arabicnumber": "2652.02",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There was argument between Adam and Moses, and Adam came the better of Moses. Moses said to him: You are the same Adam who misled people, and caused them to get out of Paradise. Adam said: You are the same (Moses) whom Allah endowed the knowledge of everything and selected him amongst the people as His Messenger. He said: Yes. Adam then again said: Even then you blame me for an affair which had been ordained for me before I was created",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6744,
			"arabicnumber": "2652.03",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There was an argument between Adam and Moses (peace be upon both of them) in the presence of their Lord. Adam came the better of Moses. Moses said: Are you that Adam whom Allah created with His Hand and breathed into himHis sprit, and commanded angels to fall in prostration before him and He made you live in Paradise with comfort and ease. Then you caused the people to get down to the earth because of your lapse. Adam said: Are you that Moses whom Allah selected for His Messengership and for His conversation with him and conferred upon you the tablets, in which everything was clearly explained and granted you the audience in order to have confidential talk with you. What is your opinion, how long Torah would haye been written before I was created? Moses said: Forty years before. Adam said: Did you not see these words: Adam committed an error and he was enticed to (do so). He (Moses) said: Yes. Whereupon, he (Adam) said: Do you then blame me for an act which Allah had ordained for me forty years before He created me? Allah's Messenger (ﷺ) said: This is how Adam came the better of Moses",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6745,
			"arabicnumber": "2652.04",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There was an argument between Adam and Moses. Moses said: Are you that Adam whose lapse caused you to get out of Paradise? Adam said to him: Are you that Moses whom Allah selected for His Messengership, for His conversation and you blame me for an affair which had been ordained for me before I was created? This is how Adam came the better of Moses",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6746,
			"arabicnumber": "2652.05",
			"text": "Abu Huraira narrated a hadith like this through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6747,
			"arabicnumber": "2652.06",
			"text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6748,
			"arabicnumber": "2653.01",
			"text": "Abu Huraira reported a hadith like this through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6749,
			"arabicnumber": "2653.02",
			"text": "Abdullah b. 'Amr b. al-'As reported:I heard Allah's Messenger (ﷺ) as saying: Allah ordained the measures (of quality) of the creation fifty thousand years before He created the heavens and the earth, as His Throne was upon water",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6750,
			"arabicnumber": "2654",
			"text": "This hadith has been narrated on the authority of Abu Hani with the same chain of transmitters, but there is no mention of\" His Throne was upon water",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6751,
			"arabicnumber": "2655",
			"text": "Abdullah b. Amr b. al-'As reported that he heard Allah's Messenger (ﷺ) as saying:Verily, the hearts of all the sons of Adam are between the two fingers out of the fingers of the Compassionate Lord as one heart. He turns that to any (direction) He likes. Then Allahs Messenger (ﷺ) said: 0 Allah, the Turner of the hearts, turn our hearts to Thine obedience",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6752,
			"arabicnumber": "2656",
			"text": "Tawus reported:I found some Companions of Allah's Messenger (ﷺ) as saying: Everything is by measure. And he further said: I heard Abdullah b. 'Umar as saying: There is a neasure for everything-even for incapacity and-capability",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6753,
			"arabicnumber": "2657.01",
			"text": "Abu Huraira reported that the polytheists of the Quraish came to have an argument with Allah's Messenger (ﷺ) in regard to Destiny and then this verse was revealed:\" On the day when they are dragged into the Fire upon their faces, taste the touch of Fire. Surely, We have created everything according to a measure\" (liv. 48)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6754,
			"arabicnumber": "2657.02",
			"text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:Verily Allah has fixed the very portion of adultery which a man will indulge in, and which he of necessity must commit. The adultery of the eye is the lustful look, and the adultery of the tongue is the licentious speech, the heart desires and yearns, which the parts may or may not put into effect",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6755,
			"arabicnumber": "2658.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying. Allah fixed the very portion of adultery which a man will indulge in. There would be no escape from it. The adultery of the eye is the lustful look and the adultery of the ears is listening to voluptuous (song or talk) and the adultery of the tongue is licentious speech and the adultery of the hand is the lustful grip (embrace) and the adultery of the feet is to walk (to the place) where he intends to commit adultery and the heart yearns and desires which he may or may not put into effect",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6756,
			"arabicnumber": "2658.02",
			"text": "There is none born but is created to his true nature (Islam). It is his parents who make him a Jew or a Christian or a Magian quite as beasts produce their young with their limbs perfect. Do you see anything deficient in them? Then he quoted the Qur'an., The nature made by Allah in which He has created men there is no altering of Allah's creation; that is the right religion\" (ar-Rum:30)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6757,
			"arabicnumber": "2658.03",
			"text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters and there is no mention of his deficiency in limbs",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6758,
			"arabicnumber": "2658.04",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:No child is born but upon Fitra. He then said. Recite: The nature made by Allah in which He created man, there is no altering of Allah's nature; that is the right religion",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6759,
			"arabicnumber": "2658.05",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:No babe is born but upon Fitra. It is his parents who make him a Jew or a Christian or a Polytheist. A person said: Allah's Messenger, what is your opinion if they were to die before that (before reaching the age of adolescence when they can distinguish between right and wrong)? He said: It is Allah alone Who knows what they would be doing",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6760,
			"arabicnumber": "2658.06",
			"text": "It is reported on the authority of Abu Mu'awiya that (the Holy Prophet) said:Every new-born babe is born on the millat (of Islam and he) remains on this until his tongue is enabled to express himself. This hadith has been narratted on the authority of Abu Mu'awiya through another chain of transmitters (and the words are):\" Every child is born but on this Fitra so long as he does not express himself with his tongue",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6761,
			"arabicnumber": "2658.07",
			"text": "Abu Huraira reported from Allah's Messenger (may peace be upom him) many ahadith and one amongst them is that he is reported to have said:An infant is born according to his (true) nature. It is his parents Who make him a Jew, a Christian, just as a she-camel gives birth to its young ones. Do you find any deficiency in their limbs? You cut their ears (i. e. after birth). They (the Companions of the Holy Prophet) said: What is your opinion about him who dies in infancy? Thereupon Allah's Apostle (ﷺ) said: It is Allah alone Who knows best what they would be doing",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6762,
			"arabicnumber": "2659.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The mother of every person gives him birth according to his true nature. It is subsequently his parents who make him a Jew or a Christian or a Magian. Had his parents been Muslim he would have also remained a Muslim. Every person to whom his mother gives birth (has two aspects of his life) ; when his mother gives birth Satan strikes him but it was not the case with Mary and her son (Jesus Christ)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6763,
			"arabicnumber": "2659.02",
			"text": "Abu Huraira reported that Allah's Messenger (ﷺ) was asked about the children of the polytheists, whereupon he said:It is Allah Who knows best what they would be doing",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6764,
			"arabicnumber": "2659.03",
			"text": "This hadith has been transmitted on the authority of Shu'aib and Ma'qil with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6765,
			"arabicnumber": "2660",
			"text": "Abu Huraira reported that Allahs Messenger (way peace be upon him) was asked about the children of the polytheists who die young. Thereupon Allah's Apostle (ﷺ) said:It is Allah Who knows what they would be doing",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6766,
			"arabicnumber": "2661",
			"text": "Ibn Abbas reported that Allah's Messenger (ﷺ) was asked about the children of the polytheists, whereupon he said:It is Allah alone Who knows what they would be doing according to their creation",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6767,
			"arabicnumber": "2662.01",
			"text": "Ubayy b. Ka'b reported that Allah's Messenger (ﷺ) said:The young man whom Khadir killed was a non-believer by his very nature and had he survived he would have involved his parents in defiance and unbelief",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6768,
			"arabicnumber": "2662.02",
			"text": "A'isha, the mother of the believers, reported that a child died and I said:There is happiness for this child who is a bird from amongst the birds of Paradise. Thereupon Allah's Messenger (ﷺ) said: Don't you know that Allah created the Paradise and He created the Hell and He created the dwellers for this (Paradise) and the denizens for this (Hell)?",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6769,
			"arabicnumber": "2662.03",
			"text": "A'isha, the mother of the believers, said that Allah's Messenger (ﷺ) was called to lead the funeral prayer of a child of the Ansar. I said:Allah's Messenger, there is happiness for this child who is a bird from the birds of Paradise for it committed no sin nor has he reached the age when one can commit sin. He said: 'A'isha, per adventure, it may be otherwise, because God created for Paradise those who are fit for it while they were yet in their father's loins and created for Hell those who are to go to Hell. He created them for Hell while they were yet in their father's loins",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6770,
			"arabicnumber": "2663.01",
			"text": "This hadith has been narrated on the authority of Yahya with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6771,
			"arabicnumber": "2663.02",
			"text": "Abdullah reported that Umm Habiba, the wife of Allah's Apostle (ﷺ), said:0 Allah, enable me to derive benefit from my husband, the Messenger of Allah (ﷺ), and from my father Abu Sufyan and from my brother Mu'awiya. Allah's Apostle (ﷺ) said: You have asked from Allah about durations of life already set, and the length of days already allotted and the sustenances the share of which has been fixed. Allah would not do anything earlier before its due time, or He would not delay anything beyond its due time. And if you were to ask Allah to provide you refuge from the torment of the HellFire, or from the torment of the grave, it would have good in store for you and better for you also. He (the narrator) further said: Mention was made before him about monkeys, and Mis'ar (one of the narrators) said: I think that (the narrator) also (made a mention) of the swine, which had suffered metamorphosis. Thereupon he (the Holy Prophet) said: Verily, Allah did not cause the race of those which suffered metamorphosis to grow or they were not survived by young ones. Monkeys and swine had been in existence even before (the metamorphosis of the human beings)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6772,
			"arabicnumber": "2663.03",
			"text": "This hadith has been reported on the authority of Mis'ar with the same chain of transmitters but with this variation that the hadith transmitted on the authority of Ibn Bishr and Waki', the torment of the Hell-Fire and the torment of grave have been mentioned together (and there is no conjunction\" iw\" or\" between them)",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6773,
			"arabicnumber": "2663.04",
			"text": "Ibn Mas'dd reported that Umm Habiba said:0 Allah, enable me to derive benefit from my husband, Allah's Messenger (ﷺ), and from my father Abu Sufyan, and from my brother Mu'awiya. Allah's Messenger (ﷺ) said to her: Verily, you have asked Allah about the durations of life already set, and the steps which you would take, and the sustenances the share of which is fixed. Nothing would take place earlier than its due time, and nothing would be deferred beyond that when it is due. So, if you were to ask Allah about your safety from the torment of Hell-Fire and from the torment of the grave, it would have been better for you. A person said: Allah's Messenger, what about those apes and swine which suffered metamorphosis? Thereupon Allah's Apostle (ﷺ) said: Verily, Allah, the Exalted and Glorious, did not destroy a people or did not torment a people, and let their race grow. Apes and swine had been even before that (when the deniers of truth were tormented and suffered metamorphosis). This hadith has been narrated on the authority of Sufyin through another chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6774,
			"arabicnumber": "2664",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:A strong believer is better and is more lovable to Allah than a weak believer, and there is good in everyone, (but) cherish that which gives you benefit (in the Hereafter) and seek help from Allah and do not lose heart, and if anything (in the form of trouble) comes to you, don't say: If I had not done that, it would not have happened so and so, but say: Allah did that what He had ordained to do and your\" if\" opens the (gate) for the Satan",
			"grades": [],
			"reference": {
				"book": 46,
				"hadith": 52
			}
		}
	]
}