{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"49": "The Book of Heart-Melting Traditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6937,
			"arabicnumber": "2736",
			"text": "Usama b. Zaid reported that Allah's Messenger (way peace be upon him) said:I stood at the door of Paradise and I found that the overwhelming majority of those who entered therein was that of poor persons and the wealthy persons were detained to get into that. The denizens of Hell were commanded to get into Hell, and I stood upon the door of Fire and the majority amongst them who entered there was that of women",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6938,
			"arabicnumber": "2737.01",
			"text": "Ibn Abbas reported that Allah's Messenger (ﷺ) said:I had a chance to look into the Paradise and I found that majority of the people was poor and I looked into the Fire and there I found the majority constituted by women",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6939,
			"arabicnumber": "2737.02",
			"text": "This hadith has been narrated on the authority of Ibn 'Abbas through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6940,
			"arabicnumber": "2737.03",
			"text": "Ibn 'Abbas reported that Allah's Messenger (ﷺ) stated like this:He looked into the Fire of Hell. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6941,
			"arabicnumber": "2737.04",
			"text": "This hadith is narrated likewise through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6942,
			"arabicnumber": "2738.01",
			"text": "Imran b. Husain reported that Allah's Messenger (ﷺ) said:Amongst the inmates of Paradise the women would form a minority",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6943,
			"arabicnumber": "2738.02",
			"text": "This hadith has been narrated on the authority of Mutarrif through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6944,
			"arabicnumber": "2739",
			"text": "Abdullah b. Umar reported that Allah's Messenger (ﷺ) supplicated in these words:\" O Allah, I seek refuge in Thee from the withdrawal of Thine blessing and the change of Thine protection (from me) and from the sudden wrath of Thine, and from every displeasure of Thine",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6945,
			"arabicnumber": "2740",
			"text": "Usama b. Zaid reported Allah's Messenger (ﷺ) as saying:I have not left after me any (chance) of turmoil more injurious to men than the harm done to the men because of women",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6946,
			"arabicnumber": "2741.01",
			"text": "Usama b. Zaid b. Harith and Sa'id b. Zaid b. 'Amr b. Naufal both reported Allah's Messenger (ﷺ) as saying:I have not left after me turmoil for the people but the harm done to men by women",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6947,
			"arabicnumber": "2741.02",
			"text": "This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6948,
			"arabicnumber": "2742",
			"text": "Abu Sa'id Khudri reported that Allah's Messenger (ﷺ) said:The world is sweet and green (alluring) and verily Allah is going to install you as vicegerent in it in order to see how you act. So avoid the allurement of women: verily, the first trial for the people of Isra'il was caused by women. And in the hadith transmitted on the authority of Ibn Bashshar the words are:\" So that He should see how you act",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6949,
			"arabicnumber": "2743.01",
			"text": "Abdullah b. 'Umar reported that Allah's Messenger (ﷺ) said:Three persons set out on a journey. They were overtaken by rain and they had to find protection in a mountain cave where at its mouth there fell a rock of that mountain and thus blocked them altogether. One of them said to the others: Look to your good deeds that you performed for the sake of Allah and then supplicate Allah, the Exalted, that He might rescue you (from this trouble). One of them said: 0 Allah, I had my parents who were old and my wife and my small children also. I tended the flock and when I came back to them in the evening, I milked them (the sheep, goats, cows, etc.) and first served that milk to my parents. One day I was obliged to go out to a distant place in search of fodder and I could not come back before evening and found them (the parents) asleep. I milked the animals as I used to milk and brought milk to them and stood by their heads avoiding to disturb them from sleep and I did not deem it advisable to serve milk to my children before serving them. My children wept near my feet. I remained there in that very state and my parents too until it was morning. And (0 Allah) if Thou art aware that I did this in order to seek Thine pleasure, grant us riddance from this trouble. (The rock slipped a bit) that they could see the sky. The second one said: 0 Allah, I had a female cousin whom I loved more than the men love the women. I wanted to have sexual intercourse with her; she refused but on the condition of getting one hundred dinirs. It was with very great difficulty that I could collect one hundred dinirs and then paid them to her and when I was going to have a sexual intercourse with her, that she said: Servant of Allah, fear Allah and do not break the seal (of chastity) but by lawful means. I got up. 0 Allah, if Thou art aware that I did this in order to seek Thine pleasure, rid us from this trouble. The situation was somewhat eased for them. The third one said: Allah, I employed a workman for a measure of rice. After he had finished his work I gave him his dues (in the form of) a measure of rice, but he did not accept them. I used these rice as seeds, and that gave a bumper crop and I became rich enough to have cows and flocks (in my possession). He came to me and said: Fear Allah, and commit no crueltv upon me in regard to my dues. I said to him: Takeaway this flock of cows and sheep. He said: Fear Allah and do not make a fun of me. I said: I am not making a fun of you. You take the cows and the flocks. So he took them. 0 Allah, if Thou art aware that I did it for Thine pleasure, case the situation for us. And Allah relieved them from the rest of the trouble",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6950,
			"arabicnumber": "2743.02",
			"text": "This hadith has been transmitted on the authority of Musa b. 'Uqba but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6951,
			"arabicnumber": "2743.03",
			"text": "Abdullah b 'Umar reported:I heard Allah's Messenger (ﷺ) as saying: Three persons belonging to the earlier Ummahs set out on a journey until they had to spend a night in a cave. The rest of the hadith is the same and the additional words are:\" A person amongst them said: O Allah, I had my aged parents and I served them milk before I (served that) to my wife, children and my servants.\" And in case of the second one, the words are: \"She avoided me until she was hard pressed because of famine and she came to me and I gave her one hundred and twenty dinars.\" And in case of the third one (the words are):\" I invested his wages, and it brought profit and, as a result thereof, the merchandise increased and there was an abundance of goods.\" And he (the narrator said) that they got out of the cave and began to walk",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 15
			}
		}
	]
}