{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"53": "The Book of Paradise, its Description, its Bounties and its Inhabitants"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7130,
			"arabicnumber": "2822",
			"text": "Anas b. Malik reported:The Paradise is surrounded by hardships and the Hell-Fire is surrounded by temptations",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7131,
			"arabicnumber": "2823",
			"text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7132,
			"arabicnumber": "2824.01",
			"text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying that:Allah the Exalted and Glorious, said: I have prepared for My pious servants which no eye has ever seen, and no ear has ever heard, and no human heart has ever perceived but it is testified by the Book of Allah. He then recited:\" No soul knows what comfort has been concealed from them, as a reward for what they did\". (xxxii. 17)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7133,
			"arabicnumber": "2824.02",
			"text": "Abu Huraira reported that Allah's Apostle (ﷺ) said:Allah, the Exalted and Glorious, said: I have prepared for My pious servants which no eye (has ever) seen, no ear has (ever) heard and no human heart has ever perceived those bounties leaving apart (those bounties) about which Allah has informed you",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7134,
			"arabicnumber": "2824.03",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) said that Allah, the Exalted and Glorious, said:I have prepared for My pious servants which the eye has seen not, and the ear has heard not and no human heart has ever perceived such bounties leaving aside those about which Allah has informed you. He then recited:\" No soul knows what comfort has been hidden for thein",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7135,
			"arabicnumber": "2825",
			"text": "Sahl b. Sa'd as-Sa'idi reported:I was in the company of Allah's Messenger (ﷺ) that he gave a description of Paradise and then Allah's Apostle (ﷺ) concluded with these words: There would be bounties which the eye has not seen and the ear has not heard and no human heart has ever perceived them. He then recited this verse:\" They forsake (their) beds, calling upon their Lord in fear and in hope, and spend out of what We have given them. So no soul knows what refreshment of the eyes is hidden for them: a reward for what they did\" (xxxii. 16-17)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7136,
			"arabicnumber": "2826.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:In Paradise, there is a tree under the shadow of which a rider can travel for a hundred years",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7137,
			"arabicnumber": "2826.02",
			"text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters with the addition of these words:\" He will not be able to cover this distance",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7139,
			"arabicnumber": "2828",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7140,
			"arabicnumber": "2829",
			"text": "Abu Sa'id al-Khudri reported that Allah's Apostle (ﷺ) said that Allah would say to the inmates of Paradise:O, Dwellers of Paradise, and they would say in response: At thy service and pleasure, our Lord, the good is in Thy Hand. He (the Lord) would say: Are you well pleased now? They would say: Why should we not be pleased, O Lord, when Thou hast given us what Thou hast not given to any of Thy creatures? He would, however, say: May I not give you (something) even more excellent than that? And they would say: O Lord, what thing can be more excellent than this? And He would say: I shall cause My pleasure to alight upon you and I shall never be afterwards annoyed with you",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7142,
			"arabicnumber": "2831.01",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7143,
			"arabicnumber": "2831.02",
			"text": "Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:The inmates of Paradise would see the inmates of the apartment over them just as you see the shining planets which remain in the eastern and the western horizon because of the superiority some have over others. They said: Allah's Messenger, would in these abodes of Apostles others besides them not be able to reach? He said: Yes, they will, by Him, in Whose hand is my life, those who believe in God and acknowledge the Truth, will reach them",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7145,
			"arabicnumber": "2832",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The people most loved by me from amongst my Ummah would be those who would come after me but everyone amongst them would have the keenest desire to catch a glimpse of me even at the cost of his family and wealth",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7146,
			"arabicnumber": "2833",
			"text": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:In Paradise there is a street to which they would come every Friday. The north wind will blow and would scatter fragrance on their faces and on their clothes and would add to their beauty and loveliness, and then they would go back to their family after having an added lustre to their beauty and loveliness, and their family would say to them: By Allah, you have been increased in beauty and loveliness after leaving us, and they would say: By Allah, you have also increased in beauty and loveliness after us",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7147,
			"arabicnumber": "2834.01",
			"text": "Muhammad reported that some (persons) stated with a sense of pride and some discussed whether there would be more men in Paradise or more women. It was upon this that Abu Huraira reported that Abu'l Qasim (the Holy Prophet) (ﷺ) said:The (members) of the first group to get into Paradise would have their faces as bright as full moon during the night, and the next to this group would have their faces as bright as the shining stars in the sky, and every person would have two wives and the marrow of their shanks would glimmer beneath the flesh and there would be none without a wife in Paradise",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7148,
			"arabicnumber": "2834.02",
			"text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7149,
			"arabicnumber": "2834.03",
			"text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters that Allah's Messenger (ﷺ) said:The (members of the) first group which would get into Paradise will have their faces as bright as stars in the sky. They would neither pass water, nor void excrement, nor will they suffer from catarrh, nor will they spit, and their combs would be made of gold, and their sweat will be musk, the fuel of their brazier will be aloes, and their wives will be large-eyed maidens and their form would be alike as one single person after the form of their father (Adam) sixty cubits tall",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7150,
			"arabicnumber": "2834.04",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:The first group of my Ummah to get into Paradise would be like a full moon in the night. Then those who would be next to them; they would be like the most significantly glittering stars in regard to brightness, then after them (others) in ranks. They would neither void excrement, nor pass water, nor suffer from catarrh, nor would they spit. And their combs would be made of gold, and the fuel of their braziers would be aloes and their sweat would be musk and their form would be the form of one single person according to the length of their father sixty cubits tall. This hadith has been transmitted on the authority of Ibn Abi Shaiba with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7151,
			"arabicnumber": "2834.05",
			"text": "Hammam b. Munabbih reported:These are some of the ahidith which Abu Huraira reported from Allah's Messenger (ﷺ) and one is this that he is reported to have said: The (members of the) first group that would be admitted to Paradise would have their faces as bright as full moon during the night. They would neither spit nor suffer catarrh, nor void excrement. They would have their utensils and their combs made of gold and silver and the fuel of their braziers would be aloes and their sweat would be musk and every one of them would have two spouses (so beautiful) that the marrow of their shanks would be visible through the flesh. There would be no dissension amongst them and no enmity in their hearts. Their hearts would be like one heart, glorifying Allah morning and evening",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7152,
			"arabicnumber": "2835.01",
			"text": "Jabir reported:I heard Allah's Apostle (ﷺ) as saying that the inmates of Paradise would eat and drink but would neither spit, nor pass water, nor void excrement, nor suffer catarrah. It was said: Then, what would happen with food? Thereupon he said: They would belch and sweat (and it would be over with their food), and their sweat would be that of musk and they would glorify and praise Allah as easily as you breathe",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7153,
			"arabicnumber": "2835.02",
			"text": "This hadith has been transmitted on the authority of A'mash with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7154,
			"arabicnumber": "2835.03",
			"text": "Jabir b. Abdullah reported that Allah's Messenger (ﷺ) said that the inmates of Paradise would eat therein and they would also drink, but they would neither void excrement, nor suffer catarrh, nor pass water, and their eating (would be digested) in the form of belching and their sweat would be musk aged they would glorify and praise Allah as easily ai you breathe",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7155,
			"arabicnumber": "2835.04",
			"text": "This hadith has been transmitted on the authority of Jabir with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7156,
			"arabicnumber": "2836",
			"text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:He who would get into Paradise (would be made to enjoy such an everlasting) bliss that he would neither become destitute, nor would his clothes wear out, nor his youth would decline",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7157,
			"arabicnumber": "2837",
			"text": "Abu Sa'id al-Khudri and Abu Huraira both reported Allah's Messenger (ﷺ) as saying:There would be an announcer (in Paradise) who would make this announcement: Verily I there is in store for you (everlasting) health and that you should never fall ill and that you live (for ever) and do not die at all. And that you would remain young and never grow old. And that you would always live in affluent circumstances and never become destitute, as words of Allah, the Exalted and Glorious, are:\" And it would be announced to them: This is the Paradise. You have been made to inherit it for what you used to do\". (VII; 43)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7158,
			"arabicnumber": "2838.01",
			"text": "Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (ﷺ) said that in Paradise there would be for a believer a tent of a single hollowed pearl the breadth of which would be sixty miles. It would be meant for a believer and the believers would go around it and none would be able to see the others",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7159,
			"arabicnumber": "2838.02",
			"text": "Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (ﷺ) said that in Paradise there would be a tent made of a single hollowed pearl, the breadth of which would be sixty miles from all sides and there would live a family in each corner and the other would not be able to see the believer who goes around them",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7160,
			"arabicnumber": "2838.03",
			"text": "This hadith has been transmitted on the authority of Abu Bakr b. Abu Musa b. Qais who, on the authority of his father, reported the Apostle (ﷺ) to have said that there would be a tent made of a pearl whose height towards the sky would be sixty miles. In each corner, there would be a family of the believer, out of sight for the others",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7161,
			"arabicnumber": "2839",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Saihan, Jaihan, Euphrates and Nile are all among the rivers of Paradise",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7162,
			"arabicnumber": "2840",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:There would enter Paradise people whose hearts would be like those of the hearts of birds",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7163,
			"arabicnumber": "2841",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Allah, the Exalted and Glorious, created Adam in His image with His length of sixty cubits, and as He created him He told him to greet that group, and that was a party of angels sitting there, and listen to the response that they give him, for it would form his greeting and that of his offspring. He then went away and said: Peace be upon you! They (the angels) said: May there be peace upon you and the Mercy of Allah, and they made an addition of\" Mercy of Allah\". So he who would get into Paradise would get in the form of Adam, his length being sixty cubits, then the people who followed him continued to diminish in size up to this day",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7164,
			"arabicnumber": "2842",
			"text": "Abdullah b. Mas`ud reported Allah's Messenger (ﷺ) as saying:Hell would be brought on that day (the Day of Judgment) with seventy thousand bridles, and seventy thousand angels dragging each bridle",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7165,
			"arabicnumber": "2843.01",
			"text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:The fire which sons of Adam burn is only one-seventieth part of the Fire of Hell. His Companions said: By Allah, even ordinary fire would have been enough (to burn people). Thereupon he said: It is sixty-nine parts in excess of (the heat of) fire in this world each of them being equivalent to their heat",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7166,
			"arabicnumber": "2843.02",
			"text": "This hadith has been narrated on the authority of Abn Huraira through another chain of transmitters with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7167,
			"arabicnumber": "2844.01",
			"text": "Abu Huraira reported:We were in the company of Allah's Messenger (ﷺ) that we heard a terrible sound. Thereupon Allah's Apostle (ﷺ) said: Do you know what (sound) is this? We said: Allah and His Messenger know best. Thereupon he said: That is a stone which was thrown seventy years before in Hell and it has'been constantly slipping down and now it has reached its base",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7168,
			"arabicnumber": "2844.02",
			"text": "This hadith has been narrated on the authority of Abfi Huraira with the same chain of transmitters but with this change of wording that the Prophet (may. peace be upon him) said:It reached at its base and you heard its sound",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7169,
			"arabicnumber": "2845.01",
			"text": "Samura b. Jundub reported Allah's Apostle (may peace -be upon him) as saying:There will be some to whose ankels the fire will reach, some to whose knees, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7170,
			"arabicnumber": "2845.02",
			"text": "Samura b. Jundub reported Allah's Messenger (ﷺ) as saying:There would be among them those to whom the fire will reach up to their ankels and to some of them the fire would reach their knees and to some it would reach their waists and to some it would reach up to their collar-bones",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7171,
			"arabicnumber": "2845.03",
			"text": "This hadith has been narrated on the authority of Sa'id with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7172,
			"arabicnumber": "2846.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing:There was a dispute between the Hell and the Paradise and it (the Hell) said: The haughty and the proud would find abode in me. And the Paradise said: The meek and the humble would find their abode in me. Thereupon Allah, the Exalted and Glorious, (addressing the Hell) said: You are (the means) of My punishment by which I punish those of My servants whom I wish. (And addressing the Paradise) He said: You are only My Mercy by means of which 1 shall show mercy to those whom I wish, but each one of you would be full",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7173,
			"arabicnumber": "2846.02",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing:The Hell and the Paradise fell into dispute and the Hell said: I have been dis- tinguished by the proud and the haughty. And the Paradise said: What is the matter with me that the meek and the humble amongst people and the downtrodden and the simple enter me? Thereupon Allah said to the Paradise: You are (the means) of My Mercy whereby I show mercy to those of My servants whom 1 wish, and He said to the Hell: You are (the means) of punishment whereby 1 punish those of My servants whoml wish. Both of you will be full. The Hell will riot be filled up until Allah puts down His foot in it. The Hell would say: Enough, enough, enough, and at that time it will be filled up, all its parts integrated together",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7174,
			"arabicnumber": "2846.03",
			"text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:The Paradise and the Hell disputed with each other. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7175,
			"arabicnumber": "2846.04",
			"text": "Hammam b. Munabbih reported that Abu Huraira narrated to them some ahadith of Allah's Messenger (ﷺ) and one of them is this that Allah's Messenger (ﷺ) said:The Paradise and the Hell fell into dispute and the Hell said: 1 have been distinguished for accommodating (the haughty and proud in me), and the Paradise said: What is the matter that the meek and the humble and the downtrodden and simple would find an abode in me? Thereupon Allah said to Paradise: You are a (means) of My Mercy. 1 shall show mercy through you to one whom I will from amongst My servants. And lie said to the Hell: You are a (sign) of My chastisement and I shall chastise through you anyone whom I will from amongst My servants and both of you, would be full. And as regards the Hell it would not be full until Allah, the Exalted and Glorious, places His foot therein, and it would say: Enough, enough, enough, and it would be then full and the one part would draw very close to the other one and Allah would not treat unjustly anyone amongst His creation and He would create another creation for the Paradise (to accommodate it)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7176,
			"arabicnumber": "2847",
			"text": "Abu Sa'id al-Khudri reported that Allah's Messenger (ﷺ) said:The Paradise and the Hell disputed with each other. The rest of the hadith is the same as transmitted by Abu Huraira up to the words'.\" It is essential for Me to fill up both of you",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7177,
			"arabicnumber": "2848.01",
			"text": "Anas b. Malik reported that Allah's Apostle (ﷺ) said that the Hell would continue to say:Is there anything more, until Allah, the Exalted and High, would place His foot therein and that would say: Enough, enough, by Your Honour, and some parts of it would draw close to the other",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7178,
			"arabicnumber": "2848.02",
			"text": "This hadith has been narrated on the authority of Anas through another chain of transmitters",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7179,
			"arabicnumber": "2848.03",
			"text": "Abd al-Wahhab b. Ata' reported in connection with the words of Allah, the Exalted and the Glorious:We would say to Hell on the Day of Ressurection: Have you been completely filled up? and it would say: Is there anything -more? And he stated on the authority of Anas b. Malik that Allah's Apostle (ﷺ) said: (The sinners) would be thrown therein and it would continue to say: Is there anything more, until Allah, the Exalted and Glorious, would keep His foot there- in and some of its part would draw close to the other and it would say: Enough, enough, by Thy Honour and by Thy Dignity, and there would be enough space in Paradise until Allah would create a new creation and He would make them accommo- date that spare place in Paradise",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7180,
			"arabicnumber": "2848.04",
			"text": "Anas reported Allah's Apostle (ﷺ) as saying:There would be left some space in Paradise as Allah would like that to be left. Then Allah would create another creation as He would like",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7181,
			"arabicnumber": "2849.01",
			"text": "Abu Sa'id reported Allah's Messenger (ﷺ) as saying:Death would be brought on the Day of Resurrection. in the form of a white-coloured ram. Abu Kuraib made this addition: Then it would be made to stand between the Paradise and the Hell. So far as the rest of the hadith is concerned there is perfect agreement (between the two narrators) and it would be said to the inmates of Paradise: Do you recognise this? They would raise up their necks and look towards it and say: Yes, ' it is death. Then it would be said to the inmates of Hell-Fire.. Do you recognise this? And they would raise up their necks and look and say: Yes, it is death. Then command would be given for slaughtering that and then it would be said: 0 inmates of Paradise,, there is an everlasting life for you and no death. And then (addressing) to the inmates of the Hell-Fire, it would be said: 0 inmates of Hell-Fire, there is an everlasting living for you and no death. Allah's Messenger (may peace be u@on him) then recited this verse pointing with his hand to this (material) world:\" Warn them, this Day of dismay, and when their affairs would be decided and they would be un- mindful and they believe not\" (xix. 39)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7182,
			"arabicnumber": "2849.02",
			"text": "Abu Sa'id reported Allah's Messenger (ﷺ) as saying:When the inmates of Paradise would be admitted to Paradise and the inmates of Hell would be admitted to Hell, it would be said (to the inmates of Paradise): 0 inmates of Paradise. The rest of the hadith is the same but with this variation (that he only) said. That is the word of Allah, the Exalted. And he did not say: Then Allah's Mes- senger (ﷺ) recited, and he did not make a mention of his having pointed with his hand towards the (material) world",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7183,
			"arabicnumber": "2850.01",
			"text": "Abdullah reported that Allah's Messenger (ﷺ) said:Allah would admit the inmates of Paradise into Paradise and the inmates of Hell into Hell. Then the announcer would stand between them and say: 0 inmates of Paradise, there is no death for you,0 inmates of Hell, there is no death for you. You would live for ever therein",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7184,
			"arabicnumber": "2850.02",
			"text": "Umar b. Muhammad b. Zaid b. `Abdullah b. `Umar b. al-Khattab reported on the authority of his father `Abdullah b. `Umar that Allah's Messenger (ﷺ) said:When the inmates of Paradise would go to Paradise and the inmates of Hell would go to Hell, death would be called and it would be placed between the Paradise and the Hell and then slaughtered and then the announcer would announce: O inmates of Paradise, no death. O inmates of Hell-Fire, no death. And it would increase the delight of the inmates of Paradise and it would increase the grief of the inmates of Hell-Fire",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7185,
			"arabicnumber": "2851",
			"text": "It is transmitted on the authority of Abu Huraira that Allah's Messenger (ﷺ) said:The molar tooth of an unbeliever or the canine teeth of an unbeliever will be like Uhud and the thickness of his skin a three night's journey",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7186,
			"arabicnumber": "2852",
			"text": "Abu Huraira reported directly from Allah's Messenger (ﷺ) that he said:The distance of the two shoulders of the non-believer in Hell will be a three-day journey for a swift rider",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7187,
			"arabicnumber": "2853.01",
			"text": "Haritha b. Wahb reported that he heard Allah's Apostle (ﷺ) as saying:May I not inform you about the inmates of Paradise? They said: Do this, of course. Thereupon Allah's Apostle (ﷺ) said: Every humble person who is considered to be humble if he were to adjure In the name of Allah, He would fulfil it. He then said: May I not inform you about the denizens of Hell-Fire? They said: Yes. And he said: Every haughty, fat and proud (person)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7188,
			"arabicnumber": "2853.02",
			"text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7189,
			"arabicnumber": "2853.03",
			"text": "Haritha b. Wahb al-KhuzaIi reported Allah's Messenger (ﷺ) as saying:May I not inform you about the inmates of Paradise? (And then informing about them) said: Every meek person who is considered to be humble and if they were to adjure in the name of Allah, Allah would certainly fulfil it. May I not inform you about the inmates of Hell-Fire? They are all proud, mean and haughty",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7190,
			"arabicnumber": "2854",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing:Many a people with dishevelled hair are driven away from the door (but they are so pious) that if they are to swear in the name of Allah, He would definitely fulfil that",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7191,
			"arabicnumber": "2855",
			"text": "Abdullah b. Zam'a reported that Allah's Messenger (ﷺ) delivered an address and he made a mention of the dromedary and also made a mention of one (base person) who cut off Its hind legs, and he recited:\" When the basest of them broke forth with mischief\" (xei. 12). When A mischievous person, strong even because of the strength of a family like Abu Zam'a, broke forth. He then delivered instruction in regard to the women saying: There is amongst you who beats his woman, and in the narration on the authority of Abu Bakr, the words are: He flogs her like a slave-girl. And in the narration of Abu Kuraib (the words are): He flogs like a slave and then comforts his bed with the help of that at the end of the day, and he then advised in regard to laughing of people at the breaking of wind and said: One of you laughs at that which you yourself do",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7192,
			"arabicnumber": "2856.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing:I saw 'Amr b. Luhayy b. Qam'a b. Khindif, brother of Bani Ka'b, dragging his Intestines in Fire",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7193,
			"arabicnumber": "2856.02",
			"text": "Sa'id b. Musayyib explained\" al-bahira\" as that animal which is not milked but for the idols. and none amongst the people milks them, and\" as-sa'iba\" as that animal which is let loose for the deities. Nothing is loaded over it, and Ibn Musayyib narrated that Abu Huraira stated that Allah's Messenger (ﷺ) said:I saw 'Amr b. 'Amir al-Khuzili dragging his intestines in fire and he was the first who devoted animals to deity",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7194,
			"arabicnumber": "2128.02",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:Two are the types amongst the denizens of Hell, the one possessing whips like the tail of an ox and they flog people with their help. (The second one) the women who would be naked in spite of their being dressed, who are seduced (to wrong paths) and seduce others with their hair high like humps. These women would not get into Paradise and they would not perceive the odour of Paradise, although its frag- rance can be perceived from such and such distance (from great distance)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7195,
			"arabicnumber": "2857.01",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:If you survive for a time you would certainly see people who would have whips in their hands like the tail of an ox. They would get up in the morning under the wrath of Allah and they would get into the evening with the anger of Allah",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7196,
			"arabicnumber": "2857.02",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:If you live for a time, you would certainly see people get up (in the morning) in the wrath of Allah and getting into the evening under the curse of Allah, and there would be in their hands (whips) like the tail of an ox",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7197,
			"arabicnumber": "2858",
			"text": "This hadith has been narrated through five different chains of transmitters and all of them are narrated on the authority of Mustaurid, brother of Bani Fihr, that Allah's Messenger (ﷺ) said:By Allah, this world (is so insigni- ficant in comparison) to the Hereafter that if one of you should dip his finger- (and wnile saying this Yahyg pointed with his forefinger) -in the ocean and then he should see as to what has stuck to it. This hadith has been narrated through another chain of transmitters also but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7198,
			"arabicnumber": "2859.01",
			"text": "A'isha reported that she heard Allah's Messenger (ﷺ) as saying:The people would be assembled on the Day of Resurrection barefooted, naked and uncircumcised. I said: Allah's Messenger, will the male and the female be together on the Day and would they be looking at one another? Upon this Allah's Messenger (ﷺ) said: 'A'isha, the matter would be too serious for them to look to one another",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7199,
			"arabicnumber": "2859.02",
			"text": "This hadith has been narrated on the authority of Hatim b. Abi Saghira with the same chain of transmitters and there is no mention of the word\" uncircum- cised",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7200,
			"arabicnumber": "2860.01",
			"text": "Ibn Abbas reported that he heard Allah's Messenger (ﷺ) deliver an address and he was saying that they would meet Allah barefooted, naked and uncircumcised",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7201,
			"arabicnumber": "2860.02",
			"text": "This hadith has been narrated through other chains of transmitters on the authority of Ibn Abbas, (and) the words are:While Allah's Messenger (ﷺ) stood up to deliver a sermon, he said: 0 people, Allah would make you assemble barefooted, naked and uncircumcised (and then recited the words of the Qur'an):\" As We created you for the first time, We shall repeat it. (It is) a promise (binding) upon us. Lo! We are to perform it, and the first person who would be clothed on the Day of Resurrection would be (Hadrat) Ibrahim (peace be upon him)\" and, behold! some persons of my Ummah would be brought and taken to the left and I would say: My Lord, they are my companions, and it would be said: You do not know what they did after you, and I would say just as the pious servant (Hadrat 'Isa) said:, I was a witness regarding them as I remained among them and Thou art a witness over everything, so if Thou chastisest them, they are Thy servants and if Thou for- givest them, Thou art Mighty, Wise\" (v. 117-118). And it would be said to him: They constantly turned to their heels since you left them. This hadith has been transmitted on the authority of Waki' and Mu'adh (and the words are):\" What new things they fabricated",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7202,
			"arabicnumber": "2861",
			"text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying, The people will be assembled in three categories. Those desirous (of Paradise), fearing (Hell), coming two upon the came], three upon the camel, four upon the camel, ten upon the camel and the rest will be assembled, Hell-Fire being with them when they are at midday where they would spend the night and where they would spend the morning and where they would spend the evening",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7203,
			"arabicnumber": "2862.01",
			"text": "Ibn 'Umar reported Allah's Apostle (ﷺ) as saying:When the people stand before Allah, the Lord of the worlds, each one of them would stand submerged into perspiration up to half of his ears, and there is no mention of the \"day\" in the hadith transmitted on the authority of Ibn Muthanni",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7204,
			"arabicnumber": "2862.02",
			"text": "This hadith has been transmitted on the authority of Ibn 'Umar but with a slight variation of wording (and the words are):\" One of them would be completely submerged in perspiration up to half of his ears",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7205,
			"arabicnumber": "2863",
			"text": "Abu Huraira reported Allah's Messenger (ﷺ) as say- ing:The perspiration would spread on the Day of Resurrection upon the earth to the extent of seventy cubits and it would reach up to their mouths or up to their ears. Thaur is not sure (which words) he used (mouth or ears)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7206,
			"arabicnumber": "2864",
			"text": "Miqdad b. Aswad reported:I heard Allah's Messenger (may peace he upon him) as saying: On the Day of Resurrection, the sun would draw so close to the people that there woum be left only a distance of one mile. Sulaim b. Amir said: By Allah, I do not know whether he meant by\" mile\" the mile of the (material) earth or dn instrument used for applying collyrium to the eye. (The Prophet is, however, reported to have said): The people would be submerged in perspiration according to their deeds, some up to their. knees, Some up to the waist and some would have the bridle of perspiration and, while saying this, Allah's Apostle (ﷺ) pointed his hand towards his mouth",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7207,
			"arabicnumber": "2865.01",
			"text": "Iyad b. Him-ar reported that Allah's Messenger (ﷺ), while delivering a sermon one day, said:Behold, my Lord commanded me that I should teach you which you do not know and which He has taught me today. (He has instructed thus): The property which I have conferred upon them is lawful for them. I have created My servants as one having a natural inclination to the worship of Allah but it is Satan who turns them away from the right religion and he makes unlawful what has been declared lawful for them and he commands them to ascribe partnership with Me, although he has no justification for that. And verily, Allah looked towards the people of the world and He showed hatred for the Arabs and the non-Arabs, but with the exception of some remnants from the People of the Book. And He (further) said: I have sent thee (the Holy Prophet) in order to put you to test and put (those to test) through you. And I sent the Book to you which cannot be washed away by water, so that you may recite it while in the state of wakefulness or sleep. Verily, Allah commanded me to burn (kill) the Quraish. I said: My Lord, they would break my head (like the tearing) of bread, and Allah said: You turn them out as they turned you out, you fight against them and We shall help you in this, you should spend and you would be conferred upon. You send an army and I would send an army five times greater than that. Fight against those who disobey you along with those who obey you. The inmates of Paradise are three: One who wields authority and is just and fair, one who Is truthful and has been endowed with power to do good deeds. And the person who is merciful and kind hearted towards his relatives and to every pious Muslim, and one who does not stretch his hand in spite of having a large family to support. And He said: The inmates of Hell are five: the weak who lack power to (avoid evil), the (carefree) who pursue (everything irrespective of the fact that it is good or evil) and who do not have any care for their family or for their wealth. And those dishonest whose greed cannot be concealed even in the case of minor things. And the third. who betray you. morning and evening, in regard to your family and your property. He also made a mention of the miser and the liar and those who are in the habit of abusing people and using obscene and foul language. Abu Ghassan in his narration did not make mention of\" Spend and there would be spent for you",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7208,
			"arabicnumber": "2865.02",
			"text": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7209,
			"arabicnumber": "2865.03",
			"text": "This hadith has been transmitted on the authority of 'Iyad b. Himar that Allah's Messenger (ﷺ) gave an address one day. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7210,
			"arabicnumber": "2865.04",
			"text": "Iyad. b. Himar reported tbat, while Allah's Messenger (ﷺ) was delivering an address, he stated that Allah commanded me The rest of the hadith is the same, and there is an addition in it:\" Allah revealed to me that we should be humble amongst ourselves and none should show pride upon the others, And it does not behove one to do so, and He also said: There are among you people to follow not caring a bit for their family and property. Qatada said: Abu Abdullah, would this happen? Thereupon he said: Yes. By Allah, I found this in the days of ignorance that a person grazed the goat of a tribe and did not find anyone but their slave-girl (and he did not spare her) but committed adultery with her",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7211,
			"arabicnumber": "2866.01",
			"text": "Ibn 'Umar reported Allah's Messenger (ﷺ) as say- ing:When any one of you dies, he is shown his seat (in the Hereafter) morning and evening; if he is amongst the inmates of Paradise (he is shown the seat) from amongst the inmates of Paradise and if he is one from amongst the denizens of Hell (he is shown the seat) from amongst the denizens of Hell, and it would be said to him: That is your seat until Allah raises you on the Day of Resurrection (and sends you to your proper seat)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7212,
			"arabicnumber": "2866.02",
			"text": "Ibn Umar reported that Allah's Apostle (ﷺ) said:When a person dies, he is shown his seat morning and evening. If he is one amongst the inmates of Paradise (he is shown his seat) in Paradise and if he is one amongst the denizens of Hell-Fire (he is shown his seat) in the Hell-Fire. Then it is said to him: That is your seat where you would be sent on the Day of Resurrection",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7213,
			"arabicnumber": "2867",
			"text": "Abu Sa'id al-Khudri reported:I did not hear this hadith from Allah's Apostle (ﷺ) directly but it was Zaid b. Thabit who narrated it from him. As Allah's Apostle (ﷺ) was going along with us towards the dwellings of Bani an-Najjar, riding upon his pony, it shied and he was about to fall. He found four, five or six graves there. He said: Who amongst you knows about those lying in the graves? A person said: It is I. Thereupon he (the Holy Prophet) said: In what state did they die? He said: They died as polytheists. He said: These people are passing through the ordeal in the graves. If it were not the reason that you would stop burying (your dead) in the graves on listening to the torment in the grave which I am listening to, I would have certainly made you hear that. Then turning his face towards us, he said: Seek refuge with Allah from the torment of Hell. They said: We seek refuge with Allah from the torment of Hell. He said: Seek refuge with Allah from the torment of the grave. They said: We seek refuge with Allah from the torment of the grave. He said: Seek refuge with Allah from turmoil, its visible and invisible (aspects), and they said: We seek refuge with Allah from turmoil and its visible and invisible aspects and he said: Seek refuge with Allah from the turmoil of the Dajjal, and they said We seek refuge with Allah from the turmoil of the Dajjal",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7214,
			"arabicnumber": "2868",
			"text": "Anas reported Allah's Apostle (ﷺ) as saying:If you were not (to abandon) the burying of the dead (in the grave), I would have certainly supplicated Allah that He should make you listen the torment of the grave",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7215,
			"arabicnumber": "2869",
			"text": "This hadith has been narrated on the authority of Abu Ayyub through some other chains of transmitters (and the words are):\" Allah's Messenger (ﷺ) went out after the sun had set and he heard some sound and said: It is the Jews who are being tormented in their graves",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7216,
			"arabicnumber": "2870.01",
			"text": "Anas b. Malik reported Allah's Apostle (ﷺ) having said:When the servant is placed in his grave, his companions retrace their steps, and he hears the noise of their footsteps, two angels come to him and make him sit and say to him: What you have to say about this person (the Prophet)? If he is a believer, he would say: I bear testimony to the fact that he is a servant of Allah and His Messenger. Then it would be said to him: Look to your seat in the Hellfire, for Allah has substituted (the seat of yours) with a seat in Paradise. Allah's Messenger (ﷺ) said: He would be shown both the seats. Qatada said: It was mentioned to us that his grave (the grave of a believer) expands to seventy cubits and is full with verdure until the Day when they would be resurrected",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7217,
			"arabicnumber": "2870.02",
			"text": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:When the dead body. is placed in the grave, he listens to the sound of the shoes (as his friends and relatives return after burying him)",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7218,
			"arabicnumber": "2870.03",
			"text": "Anas b. Malik reported that Allah's Apostle (ﷺ) said:When the servant is placed in his grave and his friends retrace their steps. The rest of the hadith is the same as transmitted by Qatada",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7219,
			"arabicnumber": "2871.01",
			"text": "Al-Bara' b. `Azib reported Allah's Apostle (ﷺ) as saying:This verse: \"Allah grants steadfastness to those who believe with firm word,\" was revealed in connection with the torment of the grave. It would be said to him: Who is your Lord? And he would say: Allah is my Lord and Muhammad is my Apostle (ﷺ), and that is (what is implied) by the words of Allah, the Exalted: \"Allah keeps steadfast those who believe with firm word in this world and in the Hereafter",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7220,
			"arabicnumber": "2871.02",
			"text": "Al-Bara' b. 'Azib reported that this verse:\"Allah keeps those who believe steadfast with firm word in this world and the Hereafter\" was revealed in connection with the torment of the grave",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7221,
			"arabicnumber": "2872",
			"text": "Abu Huraira reported:When the soul of a believer would go out (of his body) it would be received bv two angels who would take it to the sky. Hammad (one of the narrators in the chain of transmitters) mentioned the swetness of its odour, (and further said) that the dwellers of the sky say: Here comes the pious soul from the side of the earth Let there be blessings of Allah upon the body in which it resides. And it is carried (by the angels) to its Lord, the Exalted and Glorious. He would say: Take it to its destined end. And if he is a nonbeliever and as it (the soul) leaves the body-Hammad made a mention of its foul smell and of its being cursed-the dwellers of the sky say: There comes a dirty soul from the side of the earth, and it would be said: Take it to its destined end. Abu Huraira reported that Allah's Messenger (ﷺ) put a thin cloth which was with him upon his nose while making a mention (of the foul smell) of the soul of a non-believer",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7222,
			"arabicnumber": "2873",
			"text": "Anas b. Malik reported:We were along with Umar between Mecca and Medina that we began to look for the new moon. And I was a man with sharp eye- sight, so I could see it, but none except me saw it. I began to say to 'Umar: Don't you see it? But he would not see it. Thereupon Umar said: I would soon be able to see it (when it will shine more brightly). I lay upon bed. He then made a mention of the people of Badr to us and said: Allah's Messenger (ﷺ) showed us one day before (the actual battle) the place of death of the people (participating) in (the Battle) of Badr and he was saying: This would be the place of death of so and so tomorrow, if Allah wills. Umar said: By Him Who sent him with truth, they did not miss the places (of their death) which Allah's Messenger (ﷺ) had pointed for them. Then they were all thrown in a well one after another. Allah's Messenger (ﷺ) then went to them and said: O, so and so, the son of so and so; O so and so, the son of so and so, have you found correct what Allah and His Messenger had promised you? I have, however, found absolutely true what Allah had promised with me. Umar said: Allah's Messenger, how are you talking with the bodies without soul in them. Thereupon he said: You cannot hear more distinctly than (their hearing) of what I say, but with this exception that they have not power to make any reply",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7223,
			"arabicnumber": "2874",
			"text": "Anas b. Malik reported that Allah's Messenger (ﷺ) let the dead bodies of the unbelievers who fought in Badr (lie unburied) for three days. He then came to them and sat by their side and called them and said:O Abu Jahl b. Hisham, O Umayya b. Khalaf, O Utba b. Rab'ila, O Shaiba b. Rabi'a, have you not found what your Lord had promised with you to be correct? As for me, I have found the promises of my Lord to be (perfectly) correct. Umar listened to the words of Allah's Apostle (ﷺ) and said: Allah's Messenger, how do they listen and respond to you? They are dead and their bodies have decayed. Thereupon he (the Holy Prophet) said: By Him in Whose Hand is my life, what I am saying to them, even you cannot hear more distinctly than they, but they lack the power to reply. Then'he commanded that they should be buried in the well of Badr",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7224,
			"arabicnumber": "2875",
			"text": "Aba Talha reported:When it was the Day of Badr and Allah's Apostle (ﷺ) had gained victory over them (the Meccans), he commanded more than twenty persons, and in another hadith these are counted as twenty-four persons, from the non-believers of the Quraish to be thrown into the well of Badr. The rest of the hadith is the same",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7225,
			"arabicnumber": "2876.01",
			"text": "A'isha reported that Allah's Messenger (ﷺ) said:He who is taken to account on the Day of Resurrection is in fact put to torment. I said: Has Allah, the Exalted and Glorious, not said this: 'He will be made subject to an easy reckoning\" (Ixxxiv. 8)? Thereupon he said: (What it implies) is not the actual reckoning, but only the presentation of one's deeds to Him. He who is thoroughly examined in reckoning is put to torment",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7226,
			"arabicnumber": "2876.02",
			"text": "This hadith has been narrated on the authority of Ayyub with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7227,
			"arabicnumber": "2876.03",
			"text": "A'isha reported Allah's Apostle (ﷺ) as saying:Everyone who is reckoned thoroughly is undone. I said: Allah's Messenger, has Allah not called (reckoning) as easy reckoning? Thereupon he said.. It implies only presenta- tion of (one's deeds to Him), but if one is thoroughly examined in reckoning, he in fact is undone",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 7228,
			"arabicnumber": "2876.04",
			"text": "A'isha reported Allah's Apostle (ﷺ) as saying:He who is examined thoroughly In reckoning is undone",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 7229,
			"arabicnumber": "2877.01",
			"text": "Jabir reported:I heard Allah's Apostle (ﷺ) as saying three days before his death: None of you should court death but only hoping good from Allah",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 7230,
			"arabicnumber": "2877.02",
			"text": "This hadith has been narrated on the authority of A'mash with the same chain of transmitters",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 7231,
			"arabicnumber": "2877.03",
			"text": "Jabir b. 'Abdullah al-Ansari reported:I heard Allah's Messenger (ﷺ) say three days before his death: None of you should die but hoping only good from Allah, the Exalted and Glorious",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 7232,
			"arabicnumber": "2878.01",
			"text": "Jabir reported:I heard Allah's Apostle (ﷺ) as saying. Every servant would be raised (in the same very state) in which he dies",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 7233,
			"arabicnumber": "2878.02",
			"text": "This hadith has been transmitted on the authority of A'mash but with a slight variation of wording",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 7234,
			"arabicnumber": "2879",
			"text": "Abdullah b. Umar reported:I heard Allah's Messenger (ﷺ) as saying: When Allah intends to chastise a people, He chastises all of them then they would be raised according to their deeds",
			"grades": [],
			"reference": {
				"book": 53,
				"hadith": 103
			}
		}
	]
}