{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"11": "The Book of Prayer - Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2123,
			"arabicnumber": "916.01",
			"text": "بشر بن مفضل نے کہا : ہمیں عمارہ بن غزیہ نے یحییٰ بن عمارہ سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اپنے مرنے والے لوگوں کو لاالٰہ الا اللہ کی تلقین کرو ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": "916.02",
			"text": "عبدالعزیز دراوردی اور سلیمان بن بلال نے اسی ( مذکورہ بالا ) سند سے ( یہی ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": "917",
			"text": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" اپنے مرنے والے لوگوں کو لاالٰہ الا اللہ کی تلقین کرو ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": "918.01",
			"text": "اسماعیل بن جعفر نےکہا : مجھے سعد بن سعید نے عمر بن کثیر بن افلح سے خبر دی ، انھوں نے ( عمر ) ابن سفینہ سے اور انھوں نے حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" کوئی مسلمان نہیں جسے مصیبت پہنچے اور وہ ( وہی کچھ ) کہے جس کا اللہ نے اسے حکم دیا ہے : \"\" یقینا ہم اللہ کے ہیں اور اسی کی طرف لوٹنے والے ہیں ، اے اللہ!مجھے میری مصیبت پر اجر دے اور مجھے ( اس کا ) اس سے بہتر بدل عطا فرما \"\" مگر اللہ تعالیٰ اسے اس ( ضائع شدہ چیز ) کا بہتر بدل عطا فرمادیتا ہے ۔ \"\" ( ام سلمہ رضی اللہ تعالیٰ عنہا نے ) کہا : جب ( میرے خاوند ) ابو سلمہ رضی اللہ تعالیٰ عنہ فوت ہوگئے تو میں نے ( دل میں ) کہا : کون سا مسلمان ابو سلمہ رضی اللہ تعالیٰ عنہ سے بہتر ( ہوسکتا ) ہے!وہ پہلا گھرانہ ہے جس نے رسول اللہ صلی اللہ علیہ وسلم کی طرف ہجرت کی ۔ پھر میں نے وہ ( کلمات ) کہےتو اللہ تعالیٰ نے مجھے رسول اللہ صلی اللہ علیہ وسلم کی صورت میں اس کا بدل عطا فرمادیا ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے اپنے لئے نکاح کا پیغام دیتے ہوئے حاطب بن ابی بلتعہ رضی اللہ تعالیٰ عنہ کو میرے پا س بھیجا تو میں نے کہا : میری ایک بیٹی ہے اور میں بہت غیرت کرنے والی ہوں ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کی بیٹی کے بارے میں ہم اللہ سے دعا کرتے ہیں کہ وہ اس کو اس ( ام سلمہ رضی اللہ تعالیٰ عنہا ) سے بے نیاز کردے اور میں اللہ سے دعا کرتا ہوں کہ وہ ( بے جا ) غیرت کو ( اس سے ) ہٹا دے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": "918.02",
			"text": "ابو اسامہ نے سعد بن سعید سے روایت کی ، انھوں نے کہا : مجھے عمر بن کثیر بن افلح نے خبر دی ، انھوں نے کہا : میں نے ابن سفینہ سے سنا ، وہ بیان کررہے تھے کہ انھوں نے نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ کو یہ کہتے ہوئے سناکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" کوئی بندہ نہیں جسے مصیبت پہنچے اور وہ کہے : بےشک ہم اللہ کے ہیں اور اسی کی طرف لوٹنے والے ہیں ۔ اے اللہ!مجھے میری مصیبت کا اجردے اور مجھے اس کا بہتر بدل عطا فرما ، مگر اللہ تعالیٰ اسے اس کی مصیبت کا اجر دیتاہے اور اسے اس کا بہتر بدل عطا فرماتاہے ۔ \"\" ( حضرت ام سلمہ رضی اللہ تعالیٰ عنہا نے ) کہا : تو جب ابو سلمہ رضی اللہ تعالیٰ عنہ فوت ہوگئے ، میں نے اس طرح کہا جس طرح نبی اکرم صلی اللہ علیہ وسلم نے مجھے حکم دیا تھا تو اللہ تعالیٰ نے مجھے رسول اللہ صلی اللہ علیہ وسلم کی صورت میں ان سے بہتر بدل عطا فرمادیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": "918.03",
			"text": "عبداللہ بن نمیر نے کہا : ہمیں سعد بن سعید نے حدیث سنائی ، انھوں نے کہا : مجھے عمر بن کثیر نے حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کے آزاد کردہ غلام ابن سفینہ سے خبر دی اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ۔ ۔ ۔ ( آگے ) ابو اسامہ کی حدیث کے مانند ( حدیث بیان کی ) اور یہ اضافہ کیا : حضرت ام سلمہ رضی اللہ تعالیٰ عنہا نےکہا : جب ابو سلمہ رضی اللہ تعالیٰ عنہ فوت ہوگئے تو میں نے ( دل میں ) کہا : رسول اللہ صلی اللہ علیہ وسلم کے صحابی ابو سلمہ رضی اللہ تعالیٰ عنہ سے بہتر کون ہوسکتاہے؟پھر اللہ تعالیٰ نے میرے ارادے کو پختہ کردیا تو میں نےوہی ( کلمات ) کہے ۔ اس کے بعد میری رسول اللہ صلی اللہ علیہ وسلم سے شادی ہوگئی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": "919",
			"text": "حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت ہے ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم مریض یا مرنے والے کے پاس جاؤ تو بھلائی کی بات کہو کیونکہ جو تم کہتے ہو فرشتے اس پر آمین کہتے ہیں ۔ \" کہا : جب ابو سلمہ رضی اللہ تعالیٰ عنہ فوت ہوگئے تو میں نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !ابو سلمہ وفات پاگئے ہیں ۔ آپ نے فرمایا : \" تم ( یہ کلمات ) کہو : اےاللہ! مجھے اور اس کو معاف فرما اور اس کے بعد مجھے اس کا بہترین بدل عطا فرما ۔ \" کہا : میں نے ( یہ کلمات ) کہے تو اللہ تعالیٰ نے مجھے ان کےبعد وہ دے دیے جو میرے لئے ان سے بہتر ہیں ، یعنی محمد صلی اللہ علیہ وسلم ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": "920.01",
			"text": "ابو اسحاق فزاری نے خالد حذا سے ، انھوں نے ابو قلابہ سے ، انھوں نے قبیصہ بن ذویب سے اور انھوں نے حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم ابو سلمہ رضی اللہ تعالیٰ عنہ کے پاس تشریف لائے ، اس وقت ان کی آنکھیں کھلی ہوئیں تھیں تو آپ نے انھیں بند کردیا ، پھر فرمایا : \" جب روح قبض کی جاتی ہے تو نظر اس کا پیچھاکرتی ہے ۔ \" اس پر انکے گھر کے کچھ لوگ چلا کر ر ونے لگے تو آ پ صلی اللہ علیہ وسلم نے فرمایا؛ \" تم اپنے لئے بھلائی کے علاوہ اور کوئی دعا نہ کرو کیونکہ تم جو کہتے ہو فرشتے اس پر آمین کہتے ہیں ۔ \" پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" اے اللہ!ابو سلمہ رضی اللہ تعالیٰ عنہ کی مغفرت فرما ، ہدایت یافتہ لوگوں میں اس کے درجات بلند فرما اور اس کے پیچھے رہ جانے والوں میں تو اس کا جانشین بن اور اے جہانوں کے پالنے والے!ہمیں اور اس کو بخش دے ، اس کے لئے اس کی قبر میں کشادگی عطا فرما اور اس کے لئے اس ( قبر ) میں روشنی کردے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": "920.02",
			"text": "عبیداللہ بن حسن نے کہا : ہمیں خالد حذاء نے اسی ( مذکورہ بالا ) سند کے ساتھ اس ( سابقہ حدیث ) کے ہم معنی حدیث بیان کی ، اس کے سوا کہ انھوں نے ( واخلفه في عقبه کے بجائے ) واخلفه في تركته ( جو کچھ اس نے چھوڑا ہے ، یعنی اہل ومال ، اس میں اس کا جانشین بن ) کہا ، اور انھوں نےاللهم!اوسع له في قبره ( اے اللہ!اس کے لئے اس کی قبر میں وسعت پیدا فرما ) کہا اورافسح له ( اوراس کے لئے کشادگی پیدا فرما ) نہیں کہا اور ( عبیداللہ نے ) یہ زائد بیان کیا کہ خالد حذاء نے کہا : ایک اور ساتویں دعا کی جسے میں بھول گیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": "921.01",
			"text": "ابن جریج نے علاء بن یعقوب سے روایت کی ، انھوں نے کہا : مجھے میرے والد نے خبر دی کہ انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیاتم انسان کو دیکھتے نہیں کہ جب وہ فوت ہوجاتاہے تو اس کی نظر اٹھ جاتی ہے؟ \" لوگوں نے کہا : کیوں نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ اس وقت ہوتا ہے جب اس کی نظر اس کی روح کا پیچھا کرتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": "921.02",
			"text": "عبدالعزیز دراوردی نے ( بھی ) علاء سے اسی سند کے ساتھ ( سابقہ حدیث کے مانند ) روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": "922",
			"text": "حضرت ام سلمہ رضی اللہ تعالیٰ عنہا نے فرمایا : جب ابو سلمہ رضی اللہ تعالیٰ عنہ فوت ہوئے ، میں نے ( دل میں ) کہا : پردیسی ، پردیس میں ( فوت ہوگیا ) میں اس پر ایسا روؤں گی کہ اس کا خوب چرچا ہوگا ، چنانچہ میں نے اس پر رونے کی تیاری کرلی کہ اچانک بالائی علاقے سے ایک عورت آئی ، وہ ( رونے میں ) میرا ساتھ دینا چاہتی تھی کہ اسے سامنے سے رسول اللہ صلی اللہ علیہ وسلم مل گئےتو آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" کیا تم شیطان کو اس گھر میں ( دوبارہ ) داخل کرنا چاہتی ہو ۔ جہاں سے اللہ نے اس کو نکال دیا ہے؟ \" دوبار ( آپ صلی اللہ علیہ وسلم نے یہ کلمات کہے ) تو میں ر ونے سے رک گئی اور نہ روئی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": "923.01",
			"text": "حماد بن زید نے عاصم احول سے ، انھوں نے ابو عثمان نہدی سے اور انہوں نے اسامہ بن زید رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے کہ آپ کی بیٹیوں میں سے ایک نے آپ کو بلاتے ہوئے اور اطلاع دیتے ہوئے آپ کی طرف پیغام بھیجا کہ اس کابچہ ۔ ۔ ۔ یااس کا بیٹا ۔ ۔ ۔ موت ( کے عالم ) میں ہے ۔ اس پر آپ صلی اللہ علیہ وسلم نے پیام لانے والےسے فرمایا : \" ان کے پاس واپس جا کر ان کو بتاؤ کہ اللہ ہی کا ہے جو اس نے لے لیا اوراسی کا ہے ۔ جو اس نے دیا تھا اور اس کے ہاں ہر چیز کا وقت مقرر ہے ، اور ان کو بتادو کہ وہ صبر کریں اور اجر وثواب کی طلب گار ہوں ۔ \" پیام رساں دوبارہ آیا اور کہا : انھوں نے ( آپ کو ) قسم دی ہے کہ آپ ان کے پاس ضرور تشریف لائیں ۔ کہا : اس پر نبی اکرم صلی اللہ علیہ وسلم اٹھے اور آپ کے ساتھ حضرت سعد بن عبادہ رضی اللہ تعالیٰ عنہ اور معاذ بن جبل رضی اللہ تعالیٰ عنہ بھی اٹھ کھڑے ہوئے اور میں بھی ان کے ساتھ چل پڑا ، آپ کے سامنے بچے کو پیش کیا گیا جبکہ اس کا سانس اکھڑا ہواتھا ، ( جسم اس طرح مضطرب تھا ) جیسے اس کی جان پرانے مشکیزے میں ہوتو آپ کی آنکھیں بہہ پڑیں ، اس پر حضرت سعد رضی اللہ تعالیٰ عنہ نے عرض کی : اےاللہ کے رسول صلی اللہ علیہ وسلم !یہ کیا ہے؟آپ نے فرمایا؛ \" یہ رحمت ہے جو اللہ نے اپنے بندوں کے دلوں میں رکھی ہے اور اللہ اپنے بندوں میں سے رحم دل بندوں ہی پر رحم فرماتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": "923.02",
			"text": "ابن فضیل اور ابو معاویہ ہر ایک نے عاصم احول سے اسی سند کے ساتھ ( سابقہ حدیث کی مانند ) حدیث بیان کی ، البتہ حماد کی حدیث زیادہ مکمل اور زیادہ لمبی ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": "924",
			"text": "حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : حضرت سعد بن عبادہ رضی اللہ تعالیٰ عنہ اپنی بیماری میں مبتلا ہوئے تو رسول اللہ صلی اللہ علیہ وسلم عبدالرحمان بن عوف رضی اللہ تعالیٰ عنہ ، سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ، اور عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کےساتھ ان کی عیادت کے لئے ان کے پاس تشریف لے گئے ۔ جب آپ ان کے ہاں داخل ہوئے تو انھیں غشی کی حالت میں پایا ، آپ نے پوچھا : \" کیا انھوں نے اپنی مدت پوری کرلی ( وفات پاگئے ہیں ) ؟ \" لوگوں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !نہیں ۔ رسول اللہ صلی اللہ علیہ وسلم روپڑے ، جب لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو روتے ہوئے دیکھاتو انہوں نے بھی روناشروع کردیا ۔ اس پر آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم سنو گے نہیں کہ اللہ تعالیٰ آنکھ کے آنسو اور دل کے غم پر سزا نہیں دیتا بلکہ اس ۔ ۔ ۔ آپ نے اپنی زبان مبارک کی طرف اشارہ کیا ۔ ۔ ۔ کی وجہ سے عذاب دیتا ہے یا رحم کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": "925",
			"text": "حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ انھوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہوئے تھے کہ انصار میں سے ایک آدمی آیا ، اس نے آپ کو سلام کہا اور پھر وہ انصاری پشت پھیر کر چل دیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اے انصار کے بھائی ( انصاری ) !میرے بھائی سعد بن عبادہ رضی اللہ تعالیٰ عنہ کا کیا حال ہے ؟ \" اس نے عرض کی : وہ اچھا ہے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کون اسکی عیادت کرے گا؟ \" پھر آپ اٹھے اور آپ کےساتھ ہم بھی اٹھ کھڑے ہوئے ، ہم دس سے زائد لوگ تھے ، ہمارے پاس جوتے نہ تھے نہ موزے ، نہ ٹوپیاں اور نہ قمیص ہی ۔ ہم اس شوریلی زمین پر چلتے ہوئے ان کے پاس پہنچ گئے ، ان کی قوم کے لوگ ان کے ارد گرد سے پیچھے ہٹ گئے حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحابہ کرام رضوان اللہ عنھم اجمعین جو آپ کےساتھ تھے ، ( ان کے ) قریب ہوگئے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": "926.01",
			"text": "محمد یعنی جعفر ( الصادق ) کے فرزند نے حدیث بیان کی ، کہا : ہمیں شعبہ نے ثابت سے حدیث سنائی ، انھوں نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ کو یہ فرماتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" صبر پہلے صدمے کے وقت ہے ( اس کے بعد تو انسان غم کو آہستہ آہستہ برداشت کرنے لگتاہے ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": "926.02",
			"text": "عثمان بن عمر نے کہا : ہمیں شعبہ نے ثابت بنانی کے حوالےسے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم ایک عورت کے پاس آئے جو اپنے بچے ( کی موت ) پر رورہی تھی تو آپ نے ان سے فرمایا : \" اللہ کاتقویٰ اختیار کرواورصبر کرو \" اس نے کہا : آپ کو میری مصیبت کی کیاپروا؟جب آپ چلے گئے تو اس کو بتایا گیا کہ وہ ( تمھیں صبر کی تلقین کرنے والے ) اللہ کے رسول صلی اللہ علیہ وسلم تھے ۔ تو اس عورت پر موت جیسی کیفیت طاری ہوگئی ، وہ آپ کے دروازے پر آئی تو اس نے آپ صلی اللہ علیہ وسلم کے دروازے پر دربان نہ پائے ۔ اس نےکہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں نے ( اس وقت ) آپ کو نہیں پہچانا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" ( حقیقی ) صبر پہلے صدمے یا صدمے کے آغاز ہی میں ہوتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": "926.03",
			"text": "خالد بن حارث ، عبدالملک بن عمرو ، اور عبدالصمد سب نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ عثمان بن عمر کے سنائے گئے واقعے کے مطابق اس کی حدیث کی طرح حدیث سنائی ۔ اورعبدالصمد کی حدیث میں ( یہ جملہ ) ہے : نبی اکرم صلی اللہ علیہ وسلم قبرکے پاس ( بیٹھی ہوئی ) ایک عورت کے پاس سے گزرے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": "927.01",
			"text": "نافع نے حضرت عبد اللہ ( بن عمر ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہ حضرت حفصہ رضی اللہ تعالیٰ عنہا سید نا عمر رضی اللہ تعالیٰ عنہ ( کی حالت ) پر رونے لگیں تو انھوں نے کہا : اے میری بیٹی !رک جا ؤ کیا تمھیں معلوم نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا تھا : \" میت کو اس پر اس کے گھروالوں کی آہ و بکا سے عذاب دیا جا تا ہے",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": "927.02",
			"text": "شعبہ نے کہا : میں نے قتادہ کو سعید بن مسیب سے حدیث بیان کرتے ہو ئے سنا ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے واسطے سے حضرت عمر رضی اللہ تعالیٰ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے روا یت کی ، آپ نے فر ما یا : \" میت کو اس کی قبر میں اس پر کیے جا نے والے نو حے سے عذاب دیا جا تاہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": "927.03",
			"text": "سعید ( بن ابی عروبہ ) نے قتادہ سے انھوں نے سعید بن مسیب سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے انھوں نے حضرت عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فر ما یا : \" میت کو اس کی قبر میں اس پر کیے جا نے والے نو حے سے عذاب دیا جا تا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": "927.04",
			"text": "ابو صالح نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روا یت کی ، انھوں نے کہا : جب حضرت عمر رضی اللہ تعالیٰ عنہ کو زخمی کیا گیاوہ بے ہو ش ہو گئے تب ان پر بلند آواز سے چیخ و پکار کی گئی جب ان کو افاقہ ہوا تو انھوں نے کہا : کیا تم لوگ جانتے نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : \" میت کو زندہ کے رونے سے عذاب دیا جا تا ہے ؟",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": "927.05",
			"text": "۔ ( ابو اسحاق ) شیبانی نے ابو بردہ سے اور انھوں نے اپنے والد ( حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا : جب حضڑت عمر رضی اللہ تعالیٰ عنہ کو زخمی کیا گیا تو حضرت صہیب رضی اللہ تعالیٰ عنہ نے یہ کہنا شروع کر دیا : ہائے میرا بھا ئی ! تو حضرت عمر رضی اللہ تعالیٰ عنہ نے ان سے کہا : صہیب !کیا تمھیں معلوم نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" زندہ کے رونے سے میت کو عذاب دیا جا تا ہے :",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": "927.06",
			"text": "عبد الملک بن عمیر نے ابو بردہ بن ابی موسیٰ سے اور انھوں نے ( اپنے والد ) حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے روا یت کی ، انھوں نے کہا : جب حضرت عمر رضی اللہ تعالیٰ عنہ زخمی ہو ئے تو صہیب رضی اللہ تعالیٰ عنہ اپنے گھر سے آئے یہاں تک کہ حضرت عمر رضی اللہ تعالیٰ عنہ کے پا س اندر داخل ہو ئے اور ان کے سامنے کھڑے ہو کر رونے لگے تو حضرت عمر رضی اللہ تعالیٰ عنہ نے ان سے کہا : کیوں رو رہے ہو؟ کیا مجھ پر رو رہے ہو ؟ کہا : اللہ کی قسم !ہاں ، امیر المومنین!آپ ہی پر رو رہا ہوں ۔ تو انھوں نے کہا : اللہ کی قسم !تمھیں خوب علم ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا تھا جس پر آہ و بکا کی جا ئے اسے عذاب دیا جا تا ہے ۔ ( عبد الملک بن عمیر نے ) کہا : میں نے یہ حدیث موسیٰ بن طلحہ کے سامنے بیان کی تو انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا کہا کرتی تھیں ( یہ ) یہودیوں کا معاملہ تھا ۔ ( دیکھیے حدیث نمبر2153 ) ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": "927.07",
			"text": "حضرت انس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ جب حضرت عمر رضی اللہ تعالیٰ عنہ کو زخمی کر دیا گیا تو حضرت حفصہ رضی اللہ تعالیٰ عنہا نے ان پر واویلا کیا انھوں نے کہا : اے حفصہ !کیا تم نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے نہیں سنا کہ جس پر واویلا کیاجا تا ہے اسے عذاب دیا جا تا ہے اور ( اسی طرح ) صہیب رضی اللہ تعالیٰ عنہ نے بھی واویلا کیا تو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : صہیب !کیا تمھیں علم نہیں : \" جس پر واویلا کیا جا ئے اس کو عذاب دیا جا تا ہے ؟",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": "929.03",
			"text": "عمرو ( بن دینا ر ) نے ابن ابی ملیکہ سے روا یت کی ، انھوں نے کہا : ہم حضرت عثمان رضی اللہ تعالیٰ عنہ کی صاحبزادی اُم ابان کے جنا زے میں ( حاضر ) تھے ۔ ۔ ۔ اور مذکورہ حدیث بیان کی ، انھوں ( عمرو ) نے حضرت عمر رضی اللہ تعالیٰ عنہ سے ( آگے ) نبی صلی اللہ علیہ وسلم سے روا یت مرفوع ہو نے کی صراحت نہیں کی جس طرح ایوب اور ابن جریج نے اس کی صراحت کی ہے اور ان دو نوں کی حدیث سے زیادہ مکمل ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": "930",
			"text": "سالم نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میت کو زندہ کے رونے سے عذاب دیا جا تا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": "931",
			"text": "حماد بن زید نے ہشام بن عروہ سے انھوں نے اپنے والد سے روا یت کی انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا کے سامنے حضرت ابن عمر رضی اللہ تعالیٰ عنہ کا روایت کردہ قول بیان کیا گیا : میت کو اس کے گھر والوں کے رونے سے عذاب دیا جا تا ہے تو انھوں نے کہا : اللہ عبد الرحمٰن پر رحم فر ما ئے انھوں نے ایک چیز کو سنا لیکن ( پوری طرح ) محفوظ نہ رکھا ( امرواقع یہ ہے کہ ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے ایک یہودی کا جنا زہ گزرا اور وہ لو گ اس پر رو رہے تھے تو آپ نے فر ما یا : \" تم رو رہے ہو اور اسے عذاب دیا جا رہا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": "932.01",
			"text": "ابو اسامہ نے ہشام سے اور انھوں نے اپنے والد ( عروہ ) سے روایت کی انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس اس بات کا ذکر کیا گیا کہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم سے مرفوعاً یہ بیان کرتے ہیں میت کو اس کی قبر میں اس کے گھر والوں کے رونے سے عذاب دیا جا تا ہے ۔ \" انھوں نے کہا : وہ ( ابن عمر رضی اللہ تعالیٰ عنہ ) بھول گئے ہیں رسول اللہ صلی اللہ علیہ وسلم نے تو یہ فر ما یا تھا : \" اس ( مرنےوالے ) کو اس کی غلطی یا گناہ کی وجہ سے عذاب دیا جا رہا ہے اور اس کے گھر والے اب اسی وقت اس پر رورہے ہیں اور یہ ( بھول ) ان ( اعبداللہ رضی اللہ تعالیٰ عنہ ) کی اس روا یت کے مانند ہے کہ رسول اللہ صلی اللہ علیہ وسلم بدر کے دب اس کنویں ( کے کنارے ) پر کھڑے ہو ئے جس بدر میں قتل ہو نے والے مشرکوں کی لا شیں تھیں تو آپ نے ان سے جو کہنا تھا کہا ( اور فرمایا : \" اب ) جو میں کہہ رہا ہوں وہ اس کو بخوبی سن رہے ہیں ۔ حالا نکہ ( اس بات میں بھی ) وہ بھول گئے آپ نے تو فر ما یا تھا : \" یہ لو گ بخوبی جانتے ہیں کہ میں ان سے ( دنیامیں ) جو کہاکرتا تھا وہ حق تھا ۔ \" پھر انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے ( یہ آیتیں پڑھیں ) \" اور بے شک تو مردوں کو نہیں سنا سکتا ۔ \" اور تو ہر گز انھیں سنانے والا نہیں جو قبروں میں ہیں ( گویا ) آپ یہ کہہ رہے ہیں : جبکہ وہ آگ میں اپنے ٹھکانے بنا چکے ہیں ( اور وہ اچھی طرح جان چکے ہیں کہ جو ان سے کہا گیا تھا وہی سچ ہے یعنی ابن عمر رضی اللہ تعالیٰ عنہ ان دو روایتوں کا اصل بیان محفوظ نہیں رکھ سکے ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": "932.02",
			"text": "وکیع نے بیان کیا کہ ہمیں ہشام بن عروہ نے اسی سند سے ابو اسامہ کی حدیث کے ہم معنی حدیث سنا ئی اور ابو اسامہ کی ( مذکورہ بالا ) حدیث زیادہ مکمل ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": "932.03",
			"text": "عمرہ بنت عبد الرحمٰن نے خبردی کہ انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا ( اس موقع پر ) ان کے سامنے بیان کیا گیا تھا حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کہتے ہیں میت کو زندہ کے رونے کی وجہ سے عذاب دیا جاتا ہے تو عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اللہ ابو عبد الرحمٰن کو معاف فر ما ئے !یقیناً انھوں نے جھوٹ نہیں بو لا لیکن وہ بھول گئے ہیں یا ان سے غلطی ہو گئی ہے ( امرواقع یہ ہے کہ ) رسول اللہ صلی اللہ علیہ وسلم ایک یہودی عورت ( کے جنازے ) کے پاس سے گزرے جس پر آہ و بکارکی جا رہی تھی تو آپ نے فر ما یا : \" یہ لو گ اس پر رو رہے ہیں اور اس کو اس کی قبر میں عذاب دیا جا رہاہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": "933.01",
			"text": "وکیع نے سعید بن عبید طائی اور محمد بن قیس سے اور انھوں نے علی بن ربیعہ سے روایت کی ، انھوں نے کہا : کو فہ میں سب سے پہلے جس پر نو حہ کیا گیا وہ قرظہ بن کعب تھا اس پر حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ہے ۔ \" جس پر نوھہ کیا گیا اسے قیامت کے دن اس پر کیے جا نے والے نو حے ( کی وجہ ) سے عذاب دیا جا ئے گا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": "933.02",
			"text": "ہمیں علی بن مسہر نے حدیث بیان کی ، ( کہا ) ہمیں محمد بن قیس نے علی بن ربیعہ سے خبر دی انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اس ( سابقہ حدیث ) کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": "933.03",
			"text": "مروان بن معاویہ فزاری نے کہا : ہمیں سعید بن عبید طا ئی نے علی بن ربیعہ سے حدیث سنا ئی انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اس ( سابقہ حدیث ) کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": "934",
			"text": "حضرت ابو مالک اشعری رضی اللہ تعالیٰ عنہ نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میری امت میں جا ہلیت کے کا موں میں سے چار باتیں ( موجود ) ہیں وہ ان کو ترک نہیں کریں گے اَحساب ( باپ داداکے اصلی یا مزعومہ کا ر ناموں ) پر فخر کرنا ( دوسروں کے ) نسب پر طعن کرنا ستاروں کے ذریعے سے بارش مانگنا اور نوحہ کرنا ۔ اور فر ما یا \" نوحہ کرنے والی جب اپنی مو ت سے پہلے تو بہ نہ کرے تو قیامت کے دن اس کو اس حالت میں اٹھا یا جا ئے گا کہ اس ( کے بدن ) پر تار کول کا لباس اور خارش کی قمیص ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": "935.01",
			"text": "‏عبد الوہاب نے کہا : میں نے یحییٰ بن سعید سے سنا وہ کہہ رہے تھے مجھے عمرہ نے بتا یا کہ انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا وہ فر ما رہی تھیں جب رسول اللہ صلی اللہ علیہ وسلم کو زید بن حارثہ جعفر بن ابی طالب اور عبد اللہ بن رواحہ رضی اللہ تعالیٰ عنہ کے قتل ( شہید ) ہو نے کی خبر پہنچی تو رسول اللہ صلی اللہ علیہ وسلم اس طرح ) مسجد میں ) بیٹھے کہ آپ ( کے چہرہ انور ) پر غم کا پتہ چل رہا تھا کہا : میں دروازے کی جھری ۔ ۔ ۔ دروازے کی درز ۔ ۔ ۔ ے دیکھ رہی تھی کہ آپ کے پاس ایک آدمی آیا اور کہنے لگا اللہ کے رسول صلی اللہ علیہ وسلم !جعفر ( کے خاندان ) کی عورتیں اور اس نے ان کے رونے کا تذکرہ کیا آپ نے اسے حکم دیا کہ وہ جا کر انھیں روکے وہ چلا گیا وہ ( دوبارہ ) آپ کے پاس آیا اور بتا یا کہ انھوں نے اس کی بات نہیں مانی آپ نے اسے دوبارہ حکم دیا کہ وہ جا کر انھیں روکے وہ گیا اور پھر ( تیسری بار ) آپ کے پاس آکر کہنے لگا : اللہ کی قسم !اللہ کے رسول !وہ ہم پر غالب آگئی ہیں کہا : : ان ( عائشہ رضی اللہ تعالیٰ عنہا ) کا خیال ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جاؤ اور ان کے منہ میں مٹی ڈال دو ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے ( دل میں ) کہا : اللہ تیری ناک خاک آلود کرے !اللہ کی قسم !نہ تم وہ کا م کرتے ہو جس کا رسول اللہ صلی اللہ علیہ وسلم نے تمھیں حکم دیا ہے اور نہ ہی تم نے ( باربار بتا کر ) رسول اللہ صلی اللہ علیہ وسلم کو تکلیف ( دینا ) ترک کیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": "935.02",
			"text": "عبد اللہ بن نمیر ، معاویہ بن صالح اور عبد العزیز بن مسلم نے یحییٰ بن سعید سے اس سند کے ساتھ اسی طرح روایت کی اور عبد العزیز کی حدیث میں ہے تم رسول اللہ صلی اللہ علیہ وسلم کو مشقت میں ڈالنے سے باز نہیں آئے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": "936.01",
			"text": "محمد ( بن سیرین ) نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے بیعت کے ساتھ ہم سے یہ عہد لیا کہ ہم نو حہ نہیں کریں گی تو ہم میں سے ان پانچ عورتوں : ام سلیم ، امعلاء ابو سیر ہ کی بیٹی ، معاذ رضی اللہ تعالیٰ عنہ کی بیوی یا ابو سیرہ کی بیٹی اور معاذ رضی اللہ تعالیٰ عنہ کی بیوی کے سواکسی نے ( کماحقہ ) اس کی پاسداری نہیں کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": "936.02",
			"text": "ہشام نے حفصہ سے اور انھوں نے حضرت عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے بیعت میں ہم سے یہ عہد لیا کہ تم نو حہ نہیں کرو گی ہم میں سے پانچ کے سوا کسی نے اس کی ( کماحقہ ) پاسداری نہیں کی ، ان ( پانچ ) میں سے ایک ام سلیم رضی اللہ تعالیٰ عنہا ہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": "937",
			"text": "عاصم نے حفصہ سے اور انھوں نے حضرت اُم عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : جب یہ آیت نازل ہو ئی : \" عورتیں آپ سے بیعت کریں کہ وہ اللہ تعا لیٰ کے ساتھ کسی کو شریک نہیں ٹھہرائیں گی ۔ ۔ ۔ اور کسی نیک کا م میں آپ کی مخالفت نہیں کریں گی ۔ \" کہا : اس ( عہد ) میں سے ایک نو حہ گری ( کی شق ) بھی تھی تو میں نے کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !فلا ں خاندان کے سوا کیونکہ انھوں نے جا ہلیت کے دور میں ( نوھہ کرنے پر ) میرے ساتھ تعاون کیا تھا تو اب میرے لیے بھی لا زمی ہے کہ میں ( ایک بار ) ان کے ساتھ تعاون کروں ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" فلاں کے خاندان کے سوا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": "938.01",
			"text": "محمد بن سیرین نے کہا : حضرت ام عطیہ رضی اللہ تعالیٰ عنہا نے فر ما یا ہمیں جنازوں کے ساتھ جا نے سے روکا جا تا تھا لیکن ہمیں سختی کے ساتھ حکم نہیں دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": "938.02",
			"text": "حفصہ نے حجرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روا یت کی ، انھوں نے کہا : ہمیں جنازوں کے ساتھ جا نے سے رو کا گیا لیکن ہمیں سختی کے ساتھ حکم نہیں دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": "939.01",
			"text": "یزید بن زریع نے ایوب سے انھوں نے محمد بن سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : جب ہم رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی کو غسل دے رہی تھیں تو آپ صلی اللہ علیہ وسلم ہمارے پاس تشریف لا ئے آپ نے فر ما یا : \" اس کو تین پانچ یا اگر تمھا ری را ئے ہو تو اس سے زائد مرتبہ پانی اور بیری ( کے پتوں ) سے غسل دو اور آخری بار میں کا فوریا کا فورمیں سے کچھ ڈال دینا اور جب تم فارغ ہو جا ؤ تو مجھے اطلا ع کر دینا ۔ جب ہم فارغ ہو گئیں تو ہم نے آپ کو اطلا ع دی تو آپ نے ہمیں اپنا تہبند دیا اور فر ما یا : \" اس کو اس کے جسم کے ساتھ لپیٹ دو",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": "939.02",
			"text": "حفصہ بنت سیرین نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : ہم نے ان ( کے بالوں ) کی کنگھی کر کے تین گندھی ہو ئی لٹیں بنا دیں",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": "939.03",
			"text": "مالک بن انس ، حماد اور ابن علیہ نے ایوب سے انھوں نے محمد سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : نبی اکرم صلی اللہ علیہ وسلم کی بیٹیوں میں سے ایک وفات پاگئیں ۔ ابن علیہ کی حدیث میں ( یوں ) ہے ( ام عطیہ رضی اللہ تعالیٰ عنہا نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشریف لا ئے اور ہم آپ کی بیٹی کو غسل دے رہی تھیں اور مالک کی حدیث میں ہے کہا : جب آپ کی بیٹی وفات پا گئیں تو آپ ہمارے پاس تشریف لا ئے ۔ ۔ ۔ ( اس سے آگے ) ام عطیہ رضی اللہ تعالیٰ عنہا سے محمد ، ان سے ایوب اور ان سے یزید کی حدیث کے مانند ہے",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": "939.04",
			"text": "۔ حماد نے ایوب سے ، انھوں نے حفصہ سے اور انھوں نے حجرت ام عطیہ رضی اللہ تعالیٰ عنہا سے اس ( سابقہ حدیث ) کی طرح روایت بیان کی ، اس کے سوا کہ آپ نے فر ما یا : \" تین ، پانچ سات یا اگر تمھاری رائے ہو تو اس سے زائد بار ( غسل دینا ۔ ) حفصہ نے ام عطیہ رضی اللہ تعالیٰ عنہا سے کہا : ہم نے ان کے سر ( کے بالوں ) کی تین گندھی ہو ئی لٹیں بنا دیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2172,
			"arabicnumber": "939.05",
			"text": "(اسماعیل ) ابن علیہ نے کہا : ہمیں ایوب نے خبر دی ، انھوں نے کہا : حفصہ نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے ( بیان کرتے ہو ئے ) کہا : ( رسول اللہ صلی اللہ علیہ وسلم نے ) فر ما یا : اس کو طاق تعداد میں تین ، پانچ یا سات مرتبہ غسل دو ۔ کہا اور ام عطیہ رضی اللہ تعالیٰ عنہا نے کہا : ہم نے ان ( کے بالوں ) کی کنگھی کر کے تین مینڈھیاں بنا دیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": "939.06",
			"text": "عاصم احول نے حفصہ بنت سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم کی ( بڑی ) بیٹی زینب رضی اللہ تعالیٰ عنہا وفات پا گئیں تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فر ما یا : \" اسے طاق تعداد میں تین یا پنچ مرتبہ غسل دو اور پانچویں بار ( پانی میں ) کا فور ۔ ۔ ۔ یا کچھ کا فور ۔ ۔ ۔ ڈال دینا اور جب تم غسل سے فارغ ہو جا ؤتو مجھے بتا نا ۔ \" ہم نے آپ کو بتا یا تو آپ نے ہمیں اپنا تہبند دیا اور فر ما یا : \" اس ( تہبند ) کو اس کے جسم کے ساتھ لپیٹ دو ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": "939.07",
			"text": "ہشا م بن حسان نے حفصہ بنت سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس تشر یف لا ئے اور ہم آپ کی بیٹیوں میں سے ایک کو غسل دے رہی تھیں تو آپ نے فر ما یا : \" اسے طاق تعداد میں پانچ یا اس سے زائد بار غسل دینا ۔ ( آگے ) ایوب اور عاصم کی حدیث کے ہم معنی ( حدیث بیان کی ) اس حدیث میں انھوں نے کہا : ( ام عطیہ رضی اللہ تعالیٰ عنہا نے ) کہا : ہم نے ان کے بالوں کو تین تہائیوں میں گو ندھ دیا ان کے سر کے دو نوں طرف اور انکی پیشانی کے بال ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2175,
			"arabicnumber": "939.08",
			"text": "ہشیم نے خالد سے خبردی انھوں نے حفصہ بنت سیرین سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے جہاں انھیں اپنی بیٹی کو غسل دینے کا حکم دیا تو ( وہاں یہ بھی ) فر ما یا : \" ان کی دائیں جانب سے اور اس کے وضو کے اعضا ء سے ( غسل کی ابتداء کرو ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2176,
			"arabicnumber": "939.09",
			"text": "اسماعیل ابن علیہ نے خالد سے انھوں نے حفصہ سے اور انھوں نے حضرت ام عطیہ رضی اللہ تعالیٰ عنہا سے روا یت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیٹی کے غسل کے بارے میں ان سے فر ما یا : \" ان کی دائیں جا نب سے اور ان کے وضو کے اعضاء سے آغاز کرو ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2177,
			"arabicnumber": "940.01",
			"text": "ابو معاویہ نے اعمش سے انھوں نے شقیق سے اور انھوں نے حضرت خباب بن ارت رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اللہ کے راستے میں ہجرت کی ۔ ہم اللہ کی رضاچا ہتے تھے تو ( اس کے وعدے کے مطا بق ) ہمارا اجر اللہ پر واجب ہو گیا ۔ ہم میں سے کچھ لو گ چلے گئے انھوں نے ( دنیا میں ) اپنے اجر میں سے کچھ نہیں لیا ان میں سے ایک مصعب بن عمیر رضی اللہ تعالیٰ عنہا تھے وہ احد کے دن شہید ہو ئے تو ان کے لیے ایک دھاری دار چادر کے سوا کو ئی چیز نہ ملی جس میں ان کو کفن دیا جا تا ۔ جب ہم اس کو ان کے سر پر ڈالتے تو ان کے پا ؤں باہر نکل جا تے اور جب ہم اسے ان کے پیروں پر رکھتے تو سر نکل جا تا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اس کو ان کے سر والے حصے پر ڈال دا اور پاؤں پر کچھ اذخر ( گھاس ) ڈال دو ۔ اور ہم میں سے کو ئی ایسا ہے جس کے لیے پھل پک چکا ہے اور وہ اس کو چن رہا ہے",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2178,
			"arabicnumber": "940.02",
			"text": "جریر عیسیٰ بن یو نس علی بن مسہر اور ابن عیینہ نے اعمش سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2179,
			"arabicnumber": "941.01",
			"text": "ابو معاویہ نے ہشام بن عروہ سے انھوں نے اپنے والد ( عروہ ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کو سحول ( یمن ) سے لا ئے جا نے والے تین سفید سوتی کپڑوں میں کفن دیا گیا ان میں نہ قمیص تھی اور نہ عمامہ البتہ حُلے ( ہم رنگ چادروں پر مشتمل جوڑے ) کے حوالے سے لو گ اشتباہ میں پڑگئے بلا شبہ وہ آپ کے لیے خرید ا گیا تھا تا کہ آپ کو اس میں کفن دیا جا ئے ۔ پھر اس حلے کو چھوڑ دیا گیا اور آپ کو سحول کے تین سفید کپڑوں میں کفن دیا گیا اور اس ( حلے ) کو عبد اللہ بن ابی بکر رضی اللہ تعالیٰ عنہ نے لے لیا اور کہا : میں اس کو ( اپنے پاس ) محفوظ رکھوں گا یہاں تک کہ اس میں خود اپنے کفن کا انتظام کروں گا بعد میں کہا : اگر اسکو اللہ تعا لیٰ اپنے نبی کے لیے پسند فر ماتا تو آپ کو اس میں کفن ( دینے کا بندوبست کر ) دیتا اس لیے انھوں نے اسے فروخت کردیا اور اس کی قیمت صدقہ کر دی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2180,
			"arabicnumber": "941.02",
			"text": "علی بن مسہر نے کہا : ہمیں ہشام بن عروہ نے اپنے والد ( عروہ ) سے حدیث سنا ئی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کو عبد اللہ بن ابی بکر رضی اللہ تعالیٰ عنہ کے ایک یمنی حلے میں لپیٹا ( کفن دیا ) گیا پھر اس کو اتاردیا گیا اور آپ کو سحول کے تین سفید یمنی کپڑوں میں کفن دیا گیا جن میں نہ قمیص تھی اور نہ عمامہ ۔ عبد اللہ رضی اللہ تعالیٰ عنہ نے وہ حلہ اٹھا لیا اور کہا : مجھے اس میں کفن دیا جا ئے گا پھر کہا : رسول اللہ صلی اللہ علیہ وسلم کو اس میں کفن نہیں دیا گیا تو مجھے اس میں کفن دیا جا ئے گا !چنانچہ انھوں نے اس کو صدقہ کردیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2181,
			"arabicnumber": "941.03",
			"text": "حفص بن غیاث ، ابن عیینہ ، ابن ادریس ، عبدہ ، وکیع اور عبد العزیز سب نے ہشام سے اسی سند کے ساتھ روایت کی اور ان کی حدیث میں عبد اللہ بن ابی بکر رضی اللہ تعالیٰ عنہ کا واقعہ نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2182,
			"arabicnumber": "941.04",
			"text": "ابو سلمہ ( عبد اللہ بن عبد الرحمان بن عوف رضی اللہ تعالیٰ عنہ ) سے روایت ہے کہ انھوں نے کہا : میں نے نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سوال کیا : میں نے ان سے کہا : رسول اللہ صلی اللہ علیہ وسلم کو کتنے کپڑوں میں کفن دیا گیا تھا ؟تو انھوں نے کہا : تین سحولی کپڑوں میں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2183,
			"arabicnumber": "942.01",
			"text": "صالح ( بن کیسان ) نے ابن شہاب ( زہری سے روایت کی ، انھیں ابو سلمہ بن عبد الرحمان نے خبردی کہ ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم فوت ہو ئے تو آپ کو دھاری دار یمنی چادر سے ڈھا نپا گیا ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2184,
			"arabicnumber": "942.02",
			"text": "معمر اور شہاب نے ( ابن شہاب ) زہری سے اسی سند کے ساتھ بالکل اسی طرح حدیث روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2185,
			"arabicnumber": "943",
			"text": "حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ بیان کر تے ہیں کہ ایک دن نبی اکرم صلی اللہ علیہ وسلم نے خطبہ دیا ، آپ نے اپنے اصحاب میں سے ایک آدمی کا تذکرہ فر ما یا جو فوت ہوا تو اس کو معمولی ( کپڑے میں ) کفن دیا گیا اور رات ہی کو دفن کر دیا گیا تو نبی اکرم صلی اللہ علیہ وسلم نے کسی بھی آدمی کو رات کو دفن کرنے سے ڈانٹ کر روکا یہاں تک کہ اس کی ( شان شایان طریقے سے ) نماز جنازہ ادا کی جا ئے اولاًیہ کہ کو ئی انسان اس پر مجبور ہو جا ئے اور نبی اکرم صلی اللہ علیہ وسلم نے فر ما یا : \" جب تم میں سے کو ئی شخص اپنے بھا ئی کو کفن دے تو اسے اچھا کفن دے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2186,
			"arabicnumber": "944.01",
			"text": "سفیان بن عیینہ نے زہری سے انھوں نے سعید ( بن مسیب ) سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فر ما یا جنا زے ( کو لے جا نے ) میں جلدی کرو ، اگر وہ ( میت ) نیک ہے تو جس کی طرف تم اس کو لے جا رہے ہو وہ خیرہے اگر وہ اس کے سوا ہے تو پھر وہ شر ہے جسے تم اپنی گردنوں سے اتاردو گے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2187,
			"arabicnumber": "944.02",
			"text": "معمر اور محمد بن ابی حفصہ دو نوں نے زہری سے ، انھوں نے سعید ( بن مسیب ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے ( یہی حدیث ) روایت کی ، لیکن معمر کی حدیث میں ہے انھوں نے کہا : میں اس کے سوا اور کچھ نہیں جا نتا کہ انھوں ( ابو ہریرہ رضی اللہ تعالیٰ عنہ ) نے اس حدیث کو مرفوع ( رسول اللہ صلی اللہ علیہ وسلم سے ) بیان کیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2188,
			"arabicnumber": "944.03",
			"text": "ابو امامہ بن سہل بن حنیف نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ہے : \" جنا زے میں جلدی کرو اگر ( میت ) نیک ہے تو تم نے اسے بھلا ئی کے قریب کر دیا اور اگر وہ اس کے سوا ہے تو شر ہے جسے تم اپنی گردنوں سے اتار دو گے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2189,
			"arabicnumber": "945.01",
			"text": "ابو طا ہر حرملہ یحییٰ اور ہارون بن سعید ایلی ۔ ۔ ۔ اس روایت کے الفا ظ ہارون اور حرملہ کے ہیں ۔ ۔ ۔ میں سے ہارون نے کہا : ہمیں حدیث سنا ئی اور دو سرے دو نوں نے کہا : ہمیں ابن وہب نے خبر دی ، انھوں نے نے کہا : مجھے یو نس نے ابن شہاب سے خبر دی کہا : مجھے عبد الرحمان بن ہر مزا عرج نے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" جو شخص جنا زے میں شریک رہا یہاں تک کہ نماز جنا زہ ادا کر لی گئی تو اس کے لیے ایک قیراط ہے اور جو اس ( جنازے ) میں شریک رہاحتیٰ کہ اس کو دفن کر دیا گیا تو اس کے لیے دو قیراط ہیں ۔ \"\" پوچھا گیا : دو قیراط سے کہا مراد ہے ؟ آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" دو بڑے پہاڑوں کے مانند ۔ ابو طا ہر کی حدیث یہاں ختم ہو گئی ۔ دوسرے دو اساتذہ نے اضافہ کیا : ابن شہاب نے کہا : سالم بن عبد اللہ بن عمرنے کہا : کہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ نماز جنازہ پڑھ کر لو ٹ آتے تھے جب ان کو حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کی حدیث پہنچی تو انھوں نے نے کہایقیناًہم نے بہت سے قیراطوں میں نقصان اٹھا یا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2190,
			"arabicnumber": "945.02",
			"text": "عبد الاعلیٰ اور عبد الررزاق نے معمر سے انھوںے زہری سے ، انھوں نے سعید بن مسیب سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں ے نبی صلی اللہ علیہ وسلم سے ( یہ روایت ) ان الفاظ : \" دو عظیم پہاڑوں تک بیان کی اور اس کے بعد والا حصہ بیان نہیں کیا ۔ اور عبد لاعلیٰ کی حدیث میں ہے ۔ یہاں تک کہ اس ( کے دفن ) سے فراغت ہو جا ئے ۔ \" اور عبد الررزاق کی حدیث میں ہے : \" یہاں تک کہ اس کو لحد میں رکھ دیا جا ئے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2191,
			"arabicnumber": "945.03",
			"text": "‏عقیل بن خالد نے ابن شہاب سے روایت کی کہ انھوں نے کہا : مجھے کئی لو گوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے حدیث سنا ئی اور انھوں نے نبی صلی اللہ علیہ وسلم سے جس طرح معمر کی حدیث ہے اور کہا : اور جو اس کو دفن کیے جا نے تک اس کے ساتھ رہا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2192,
			"arabicnumber": "945.04",
			"text": "سہیل کے والد ابو صالح نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روا یت کی ، فر ما یا : \" جس نے نماز جنازہ ادا کی اور اس کے پیچھے ( قبر ستان ) نہیں گیا تو اس کے لیے ایک قیراط ( اجر ) ہے اور اگر وہ اس کے پیچھے گیا تو اس کے لیے دو قیراط ہیں ۔ پو چھا گیا : دو قیراط کیا ہیں؟ فر ما یا : \" ان دو نوں میں سے چھوٹا اُحد پہاڑ کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2193,
			"arabicnumber": "945.05",
			"text": "ابو حازم نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوںنے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فر ما یا : \" جس نے نماز جنازہ ادا کیتو اس کے لیے قیراط ہے اور جو اس کے ساتھ گیا حتیٰ کہ اسے قبر میں اتاردیا گیا تو ( اس کے لیے ) دو قیراط ہیں ۔ ( ابو حازم نے ) کہا میں نے کہا : اے ابو ہریرہ رضی اللہ تعالیٰ عنہ قیراط کیا ہے ؟ انھوں نے کہا : احد پہاڑ کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2194,
			"arabicnumber": "945.06",
			"text": "نا فع نے کہا : حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے کہا گیا کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ کہتے ہیں میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \" جو شخص جنازے کے پیچھے چلا تو اس کے لیے قیراط اجرہے اس پر ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ہمیں کثرت سے احادیث سنا ئی ہیں اس کے بعد انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پا س پیغا م بھیجا اور ان سے پو چھا تو انھوں نے حضرت ابو ہر یرہ رضی اللہ تعالیٰ عنہ کی تصدیق فر ما ئی اس پر حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : یقیناً ہم نے بہت سے قیراطوں ( کے حصول ) میں کو تا ہی کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2195,
			"arabicnumber": "945.07",
			"text": "داودبن عامر بن سعد بن ابی وقاص نے اپنے والد ( عامر ) سے حدیث بیان کی کہ وہ حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کے پا س بیٹھے ہو ئے تھے کہ صاحب مقصود خباب رضی اللہ تعالیٰ عنہ نے آکر کہا : اے عبد اللہ بن عمر!کیا آپ نے ہمیں سنا ابو ہریرہ رضی اللہ تعالیٰ عنہ کیا کہتے ہیں ؟ بلا شبہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا ہے ۔ جو شخص جنازے کے ساتھ اس کے گھر سے نکا اور اس کی نماز جنا زہ ادا کی پھر اس کے ساتھ رہا حتیٰ کے اس کو دفن کر دیا گیا تو اس کے لیے بطور اجر دو قیرا ط ہیں ہر قیراط اُحد ( پہاڑ ) کے مانند ہے اور جس نے اس کی نماز جنازہ اداکی اور لو ٹ آیا اس کا اجر احد پہاڑ جیسا ہے ( یہ بات سنکر ) حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے خباب رضی اللہ تعالیٰ عنہ کو حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس بھیجا ( تا کہ ) وہ ان سے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کے قول کے بارے میں دریافت دریافت کریں اور پھر واپس آکر ان کو بتا ئیں کہ انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے کیا کہا ۔ ( اس دوران میں ) ابن عمر رضی اللہ تعالیٰ عنہ نے مسجد کی کنکریوں سے ایک مٹھی بھرلی اور ان کواپنے ہاتھ میں الٹ پلٹ کرنے لگے یہاں تک کہ پیام رساں ان کے پاس واپس آگیا اس نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہاہے کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ نے سچ کہا ہے اس پر ابن عمر رضی اللہ تعالیٰ عنہ نے وہ کنکریاں جو ان کے ہاتھ میں تھیں زمین پر دے ماریں پھر کہا یقیناًہم نے بہت قیراطوں ( کے حصول ) میں کو تا ہی کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2196,
			"arabicnumber": "946.01",
			"text": "شعبہ نے کہا : ہمیں قتادہ نے سالم بن ابی جعد سے حدیث سنا ئی انھوں نے معدان ابن ابی طلحہ یعمری سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے آزاد کردہ غلام ثوبان رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے نماز جنا زہ پڑھی اس کے لیے ایک قیراط ہے اور اگر وہ اس کے دفن میں شامل ہوا تو اس کے لیے دو قیرا ط ہیں ( ایک ) قیرا ط احد ( پہاڑ ) کے ما نند ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2197,
			"arabicnumber": "946.02",
			"text": "ہشام سعید اور ابان نے قتادہ سے اسی سند کے ساتھ سابقہ حدیث کے مانند روایت کی سعید اور ہشام کی حدیث میں ہے نبی صلی اللہ علیہ وسلم سے قیراط کے بارے میں دریافت کیا گیا تو آپ نے فر ما یا : \" احد ( پہاڑ ) کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2198,
			"arabicnumber": "947",
			"text": "اسلام بن ابی مطیع نے ایوب سے انھوں نے ابو قلابہ سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کے دودھ شریک بھا ئی عبداللہ بن یزید سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روا یت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" کو ئی بھی ( مسلمان ) مرنے والا جس کی نماز جناز ہ مسلمانو کی ایک جماعت جن کی تعداد سو تک پہنچی ہو ادا کرے وہ سب اس کی سفارش کریں تو اس کے بارے میں ان کی سفارش قبول کر لی جا تی ہے ۔ ( سلام نے ) کہا میں نے یہ حدیث شعیب بن حجاب کو بیان کی تو انھوں نے کہا مجھے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے بھی یہ حدیث نبی صلی اللہ علیہ وسلم سے بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2199,
			"arabicnumber": "948",
			"text": "ہارون بن معروف ہارون بن سعید ایلی اور ولید بن شجاع میں سے ولید نے کہا : مجھے حدیث سنا ئی اور دوسرے دو نوں نے کہا : ہمیں حدیث سنا ئی ابن وہب نے انھوں نے کہا : مجھے ابو صخر نے شر یک بن عبد اللہ بن ابی نمر سے خبر دی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلا م کریب سے اور انھوں نے حضرت عبد اللہ بن عبا س رضی اللہ تعالیٰ عنہ سے روا یت کی کہ قدید یا عسفان میں ان کے ایک بیٹے کا انتقال ہو گیا تو انھوں نے کہا : کریب !دیکھو اس کے ( جنازے کے ) لیے کتنے لو گ جمع ہو چکے ہیں ۔ میں با ہر نکلا تو دیکھا کہ اس کی خا طر ( خاصے ) لو گ جمع ہو چکے ہیں تو میں نے ان کو اطلا ع دی ۔ انھوں نے پو چھا تو کہتے ہو کہ وہ چا لیس ہوں گے ؟ انھوں نے جواب دیا : ہاں ۔ تو انھوں نے فر ما یا : اس ( میت ) کو ( گھر سے ) باہر نکا لو کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ہے : جو بھی مسلمان فوت ہو جا تا ہے اور اس کے جنا زے پر ( ایسے ) چالیس آدمی ( نماز ادا کرنے کے لیے ) کھڑے ہو جا تے ہیں جو اللہ کے ساتھ کسی چیز کو شریک نہیں ٹھہر اتے تو اللہ تعا لیٰ اس کے بارے میں ان کی سفارش کو قبول فر ما لیتا ہے ۔ ابن معروف کی روا یت میں ہے انھوں نے شریک بن ابی نمر سے انھوں نے کریب سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ۔ ( اس سند میں شریک کے والد اور ابو نمر کے بیٹے عبد اللہ کا نام لیے بغیر داداکی طرف منسوب کرتے ہو ئے شریک بن ابی نمر کہا گیا ہے ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2200,
			"arabicnumber": "949.01",
			"text": "عبد العزیز بن صہیب نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ایک جنازہ گزرا تو اس کی اچھی صفت بیان کی گئی اس پر نبی اکرم صلی اللہ علیہ وسلم نے فر ما یا : \" واجب ہو گئی واجب ہو گئی واجب ہو گئی ، اس کے بعد ایک اور جنازہ گزرا تو اس کی بری صفت بیان کی گئی تو نبی اکرم صلی اللہ علیہ وسلم نے فر ما یا : \" واجب ہو گئی واجب ہو گئی واجب ہو گئی اس پرحضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : آپ پر میرے ماں باپ فدا ہوں! ایک جنازہ گزرا اور اس کی اچھی صفت بیان کی گئی تو آپ نے فر ما یا : \" واجب ہو گئی واجب ہو گئی واجب ہو گئی ۔ ایک اور جنازہ گزرا اور اس کی بری صفت بیان کی گئی تو آپ نے فر ما یا واجب ہو گئی واجب ہو گئی واجب ہو گئی \" ( اس کا مطلب کیا ہے؟ ) تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس کی تم لو گوں نےاچھی صفت بیان کی اس کے لیے جنت واجب ہو گئی اور جس کی تم نے بری صفت بیان کی اس کے لیے آگ واجب ہو گئی تم زمین میں اللہ کے گواہ ہو تم زمین میں اللہ کے گواہ ہو تم زمین میں اللہ کے گواہ ہو ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2201,
			"arabicnumber": "949.02",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : نبی اکرم صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ گزرا ۔ ۔ ۔ اس کے بعد انھوں نے انس سے عبد العزیز کی ( سابقہ ) حدیث کے ہم معنی حدیث بیان کی البتہ عبد العزیز کی حدیث زیادہ مکمل ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2202,
			"arabicnumber": "950.01",
			"text": "امام مالک بن انس نے محمد بن عمرو بن حلحلہ سے ، انھوں نے معبد بن کعب بن مالک سے اور انھوں نے حضرت قتادہ بن ربعی رضی اللہ تعالیٰ عنہ سے روایت کی ، وہ حدیث بیان کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس سے ایک جنازہ گزرا تو آپ نے فر ما یا : \" آرام پانے والا ہے یا اس سے آرام ملنے والا ہے ۔ انھوں ( صحابہ ) نے پو چھا اے اللہ کے رسول صلی اللہ علیہ وسلم !آرام پانے والا یا جس سے آرام ملنے والا ہے سے کیا مراد ہے؟ تو آپ نے فر ما یا : \" بندہ مومن دنیا کی تکا لیف سے آرام پا تا ہے اور فاجر بندے ( کے مرنے ) سے لو گ شہر درخت اور حیوانات آرام پاتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2203,
			"arabicnumber": "950.02",
			"text": "یحییٰ بن سعید اور عبد الرزاق نے عبد اللہ بن سعید سے انھوں نے محمد بن عمرو سے انھوں نے کعب بن مالک کے بیٹے ( معبد ) سے انھوں نے حضرت ابو قتادہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے ( سابقہ حدیث کے مانند ) روایت بیان کی اور یحییٰ کی حدیث میں ہے : \" وہ ( مومن بندہ ) اللہ کی رحمت میں آکر دنیا کی اذیت اور تکان سے آرام حاصل کر لیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2204,
			"arabicnumber": "951.01",
			"text": "امام مالکؒ نے ابن شہاب سے ، انھوں نے سعید بن مسیب سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے جس دن نجاشی فوت ہوئے ، لوگوں کو ان کی وفات کی اطلاع دی ، آپ صلی اللہ علیہ وسلم ان ( صحابہ کرام رضوان اللہ عنھم اجمعین ) کے ساتھ باہر جنازہ گاہ میں گئے اور آپ صلی اللہ علیہ وسلم نے چارتکبیریں کہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2205,
			"arabicnumber": "951.02",
			"text": "عقیل بن خالد نے ابن شہاب سے ، انھوں نے سعید بن مسیب اور ابو سلمہ بن عبدالرحمان سے اور ان دونوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حبشہ والے ( حکمران ) نجاشی کی ، جس دن وہ فوت ہوئے ، موت کی خبر دی اور فرمایا : \"\" اپنے بھائی کے لئے بخشش کی دعاکرو ۔ \"\" ابن شہاب نے کہا : مجھے سعید بن مسیب نے حدیث سنائی کہ ان کو حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے جنازہ گاہ میں ان کی صفیں بنوائیں ، نماز ( جنازہ ) پڑھائی اور اور پر چار تکبیریں کہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2206,
			"arabicnumber": "951.03",
			"text": "صالح نے دونوں سندوں کے ساتھ ابن شہاب سے عقیل ( بن خالد ) کی روایت کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2207,
			"arabicnumber": "952.01",
			"text": "سعید بن میناء نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے اصمحہ نجاشی کی نمازجنازہ ادا کی تو اس پر چار تکبیریں کہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2208,
			"arabicnumber": "952.02",
			"text": "عطاء نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" آج اللہ کا ایک نیک بندہ اصمحہ فوت ہوگیا ہے ۔ \" اس کے بعد آپ صلی اللہ علیہ وسلم کھڑے ہوئے ، ہماری امامت کرائی اور اس کی نماز جنازہ ادا کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2209,
			"arabicnumber": "952.03",
			"text": "ابو زبیر نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بلاشبہ تمھارا ایک بھائی وفات پاگیا ہے ، لہذا تم لوگ اٹھو اور اس پر نماز ( جنازہ ) پڑھو ۔ \" ( جابر رضی اللہ تعالیٰ عنہ نے ) کہا : اس پر ہم اٹھے تو آپ صلی اللہ علیہ وسلم نے ہماری دو صفیں بنائیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2210,
			"arabicnumber": "953",
			"text": "(زہیر بن حرب ، علی بن حجر ، اور یحییٰ بن ایوب نے کہا : ہمیں اسماعیل ابن علیہ نے ایوب سے حدیث سنائی ، انھوں نے ابو قلابہ سے ، انھوں نے ابو مہلب سے اور انھوں نے حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تمھارا ایک بھائی وفات پاگیا ہے لہذا تم اٹھو اور اس کی نماز جنازہ ادا کرو ۔ \" آپ کی مراد نجاشی سے تھی ۔ اور زہیر کی روایت میں ان اخالكم \" تمھارا ایک بھائی \" کی بجائے ) ان اخاكم ( تمھارا بھائی ) کےالفاظ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2211,
			"arabicnumber": "954.01",
			"text": "حسن بن ربیع اور محمد بن عبداللہ بن نمیر نے کہا : ہمیں عبداللہ بن ادریس نے شیبانی سے حدیث سنائی ، انھوں نے شعبی سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے میت کے دفن کیے جانے کے بعد ایک قبر پر نماز جنازہ پڑھی اور آپ صلی اللہ علیہ وسلم نے اس پر چار تکبیریں کہیں ۔ شیبانی نے کہا : میں نے شعبی سے پوچھا : آپ صلی اللہ علیہ وسلم کویہ حدیث کس نے بیان کی؟انھوں نے کہا : ایک قابل اعتماد ہستی ، عبداللہ ابن عباس رضی اللہ تعالیٰ عنہ نے ۔ یہ حسن کی حدیث کے الفاظ ہیں اور ابن نمیر کی روایت میں ہے کہا : رسول اللہ صلی اللہ علیہ وسلم ایک گیلی ( نئی ) قبر کے پاس تشریف لے گئے تو آپ صلی اللہ علیہ وسلم نے اس پر نماز ( جنازہ ) پڑھی اور انھوں نے ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے آپ صلی اللہ علیہ وسلم کے پیچھے صفیں بنائیں اور آپ صلی اللہ علیہ وسلم نے چار تکبیریں کہیں ۔ میں نے عامر ( بن شراحیل شعبی ) سے پوچھا : آپ کو ( یہ حدیث ) کس نے بیان کی؟انھوں نے کہا : ایک قابل اعتماد ہستی جو اس جنازے میں شریک تھے حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2212,
			"arabicnumber": "954.02",
			"text": "ہشیم ، عبدالواحد بن زیاد ، جریر ، سفیان ، معاذ بن معاذ اور شعبہ سب نے شیبانی سے ، انھوں نے شعبی سے ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی ( سابقہ حدیث ) کے مانند روایت کی اور ان میں سے کسی کی روایت میں نہیں ہے کہ نبی کریم صلی اللہ علیہ وسلم نے اس پر چار تکبیریں کہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2213,
			"arabicnumber": "954.03",
			"text": "اسماعیل بن ابی خالد اور ابوحصین نے شعبی سے ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے آپ کے قبر پر نماز پڑھنے کے بارے میں شیبانی کی حدیث کے مانند حدیث بیان کی ، ان کی حدیث میں ( بھی ) وكبر اربعا ( آپ نے چار تکبیریں کہیں ) کے الفاظ نہیں ہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2214,
			"arabicnumber": "955",
			"text": "حضرت انس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے ایک قبر پر نماز جنازہ پڑھی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2215,
			"arabicnumber": "956",
			"text": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ایک سیاہ فام عورت مسجد میں جھاڑو دیا کرتی تھی ۔ یا ایک نوجوان تھا ۔ ۔ ۔ رسول اللہ صلی اللہ علیہ وسلم نے اسے نہ پایاتو آپ صلی اللہ علیہ وسلم نے اس عورت ۔ ۔ ۔ یا اس مرد ۔ ۔ ۔ کے بارے میں پوچھا تو لوگوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے کہا : وہ فوت ہوگیا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم لوگوں کو مجھے اطلاع نہیں دینی چاہیے تھی؟ \" کہا : گویا ان لوگوں نے اس عورت ۔ ۔ ۔ یا اس مرد ۔ ۔ ۔ کے معاملے کو معمولی خیال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے اس کی قبردکھاؤ ۔ \" صحابہ رضوان اللہ عنھم اجمعین نے آپ صلی اللہ علیہ وسلم کو اس کی قبر دیکھائی ۔ تو آپ صلی اللہ علیہ وسلم نےاس کی نماز جنازہ پڑھی ، پھر فرمایا : \" اہل قبور کے لئے یہ قبریں تاریکی سے بھری ہوئی ہیں اورمیری ان پر نماز پڑھنے کی وجہ سے اللہ تعالیٰ ان کے لئے ان ( قبروں ) کو منور فرمادیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2216,
			"arabicnumber": "957",
			"text": "۔ عبدالرحمان بن ابی لیلیٰ نے کہا : زید رضی اللہ تعالیٰ عنہ ( بن ارقم ) ہمارے جنازوں پر چار تکبیریں کہا کرتے تھے ، انھوں نے ایک جنازے پر پانچ تکبیریں کہیں ، میں نے ان سے ( اس کے بارے میں ) پوچھا تو انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم ( بسا اوقات ) اتنی ( پانچ ) تکبیریں کہا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2217,
			"arabicnumber": "958.01",
			"text": "سفیان نے زہری سے حدیث بیان کی ، انھوں نے سالم سے ، انھوں نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے اور انھوں نے حضرت عامر بن ربعیہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم جنازے کو دیکھو تو اس کے لئے کھڑے ہوجاؤیہاں تک کہ وہ تم کو پیچھے چھوڑ دے ( آگے نکل جائے ) یا اسے رکھ دیا جائے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2218,
			"arabicnumber": "958.02",
			"text": "لیث اور یونس نے ابن شہاب سے اسی سند کے ساتھ روایت بیان کی ہے اور یونس کی حدیث میں ہے کہ انھوں ( عامر بن ربعیہ رضی اللہ تعالیٰ عنہ ) نے رسول اللہ صلی اللہ علیہ وسلم سنا ، آپ فرمارہے تھے ۔ ( اسی طرح ) قتیبہ بن سعید اور ابن رمح نے لیث سے ، انھوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے انھوں نے حضرت عامر بن ربعیہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، فرمایا : \" جب تم میں سے کوئی شخص جنازے کو دیکھے ، تو اگر وہ جنازے کے ساتھ چل نہیں رہا ، تو کھڑا ہوجائے حتیٰ کہ وہ ( جنازہ ) اس کو پیچھے چھوڑ دے یا اس کو پیچھے چھوڑنے سے پہلے اس کو رکھ دیا جائے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2219,
			"arabicnumber": "958.03",
			"text": "ایوب ، عبیداللہ ، ابن عون اور ابن جریج سب نے نافع سے اسی سند کے ساتھ لیث بن سعد کی حدیث کے ہم معنی حدیث بیان کی ، البتہ ابن جریج کی حدیث یہ ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی جنازے کو دیکھے تو اگر وہ اس کے پیچھے ( ساتھ ) چلنے والا نہیں ۔ تو اس کو دیکھتے ہی کھڑا ہوجائے حتیٰ کہ وہ اس کو پیچھے چھوڑ جائے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2220,
			"arabicnumber": "959.01",
			"text": "ابو صالح نے ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم کسی جنازے کے پیچھے ( ساتھ ) جاؤ تو نہ بیٹھو یہاں تک کہ اس کو رکھ دیا جائے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2221,
			"arabicnumber": "959.02",
			"text": "ابو سلمہ بن عبدالرحمان نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم جنازے کو دیکھو تو کھڑے ہوجاؤ اور جو شخص جنازے کے پیچھے ( ساتھ ) جائے تو وہ نہ بیٹھے یہاں تک کہ اس ( جنازے ) کو رکھ دیا جائے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2222,
			"arabicnumber": "960.01",
			"text": "عبیداللہ بن مقسم نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ایک جنازہ گزرا تو رسول اللہ صلی اللہ علیہ وسلم اس کے لئے کھڑے ہوگئے اور ہم بھی آپ صلی اللہ علیہ وسلم کے ساتھ کھڑے ہوگئے پھر ہم نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !یہ تو ایک یہودی عو رت ( کا جنازہ ) ہے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" موت خوف اور گھبراہٹ ( کا باعث ) ہے ، پس جب تم جنازے کو دیکھو تو کھڑے ہوجاؤ ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2223,
			"arabicnumber": "960.02",
			"text": "محمد بن رافع نےکہا : ہمیں عبدالرزاق نے حدیث سنائی ، کہا : مجھے ابو زبیر نے خبر دی کہ انھوں نے حضر ت جابر رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے رسول اللہ صلی اللہ علیہ وسلم ایک جنازے کے لئے جو آپ صلی اللہ علیہ وسلم کے پاس سے گزرا کھڑے ہوگئے ، یہاں تک کہ وہ ( نگاہوں سے ) اوجھل ہوگیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2224,
			"arabicnumber": "960.03",
			"text": "ابن جریج سے روایت ہے ‘ انہوں نے کہا : مجھے ابو زبیر نےیہ خبر دی کہ انھوں نے حضر ت جابر رضی اللہ تعالیٰ عنہ کو فرماتے ہوئے سنا ، وہ کہہ رہے تھے رسول اللہ صلی اللہ علیہ وسلم ایک جنازے کے لئے جو آپ صلی اللہ علیہ وسلم کے پاس سے گزرا کھڑے ہوگئے ، یہاں تک کہ وہ ( نگاہوں سے ) اوجھل ہوگیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2226,
			"arabicnumber": "961.02",
			"text": "اعمش نے عمرو بن مرہ سے اسی سند کے ساتھ روایت کی اور اس میں ہے : ان دونوں نے کہا : ہم ر سول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ہمارے سامنے سے ایک جنازہ گزرا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2227,
			"arabicnumber": "962.01",
			"text": "لیث نے یحییٰ بن سعید سے اور انھوں نے واقد بن عمرو بن سعد بن معاذ سے روایت کی ، انھوں نے کہا : نافع بن جبیر نے مجھے کھڑے ہونے کی حالت میں دیکھا جبکہ ہم ایک جنازے میں شریک تھے اور وہ خود بیٹھ کر جنازے کو رکھ دیئے جانے کا انتظار کررہے تھے ۔ تو انھوں نے مجھے کہا : تمھیں کس چیز نے کھڑا کررکھا ہے؟میں نے کہا : میں انتظار کررہا ہوں کہ جنازہ رکھ دیا جائے کیونکہ حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ ( اسکے بارے میں ) حدیث بیان کرتے ہیں ۔ تو نافع نے کہا : مجھے مسود بن حکم نے حضرت علی ابن ابی طالب رضی اللہ تعالیٰ عنہ سے حدیث سنائی ہے ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم ( ابتداء میں جنازوں کے لئے ) کھڑے ہوئے ، پھر ( بعد میں ) بیٹھتے رہے ۔ اور انھوں نے ( نافع ) نے یہ روایت اس لئے بیا ن کی کہ نافع بن جبیر نے واقد بن عمرو کو دیکھا وہ جنازے کے رکھ دیئے جانے تک کھڑے رہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2228,
			"arabicnumber": "962.02",
			"text": "(عبد الوھاب ) نےکہا میں نےیحیٰ بن سعید سے سنا ‘ کہا : مجھے واقد بن عمروبن سعدبن معاذ انصاری نے خبر دی کہ نافع بن جبیر نے ان کو خبر دی کہ ان کو مسعود بن حکم انصاری نے بتایا کہ انہوں نے حضرت علی بن ابی طالبؓ سے سنا ‘ وہ جنازوں کے بارے میں کہتے تھے : ( پہلے ) رسول اللہﷺ کھڑے ہوتے تھے ( بعد میں ) بیٹھے رہتے ۔ اور انہوں ( نافع ) نے یہ روایت اس لیے بیان کی کہ نافع بن جبیر نے واقد بن عمرو کو دیکھا وہ جنازے کے رکھ دیے جانے تک کھڑے رہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2229,
			"arabicnumber": "962.03",
			"text": "ابن ابی زائدہ نے یحییٰ بن سعید سے اسی سند کے ساتھ یہی روایت بیا ن کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2230,
			"arabicnumber": "962.04",
			"text": "عبدالرحمان بن مہدی نے کہا : ہمیں شعبہ نے محمد بن منکدر سے حدیث سنائی ، کہا : میں نے مسعود بن حکم سے سنا ، وہ حضرت علی رضی اللہ تعالیٰ عنہ سے حدیث بیان کررہے تھے ، انھوں نے کہا : ہم نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو ہم بھی کھڑے ہوئے اور آپ بیٹھنے لگے تگو ہم بھی بیٹھنے لگے ، یعنی جنازے میں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2231,
			"arabicnumber": "962.05",
			"text": "یحییٰ قطان نے شعبہ سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2233,
			"arabicnumber": "963.02",
			"text": "عبدالرحمان بن مہدی نے کہا : ہمیں معاویہ بن صالح نے دونوں میں سے ہر ایک سند کےساتھ ابن وہب کی حدیث کی مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2234,
			"arabicnumber": "963.03",
			"text": "عبدالرحمان بن جبیر بن نفیر نے اپنے والد سے اور انھوں نے حضرت عوف بن مالک اشجعی رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، اور آپ صلی اللہ علیہ وسلم نے ایک جنازہ پڑھایا ۔ آپ صلی اللہ علیہ وسلم فرمارہے تھے : \"\" \"\" اے اللہ!اسے بخش دے اس پر رحم فرما اور اسے عافیت دے ، اسے معاف فرما اور اس کی باعزت ضیافت فرما اور اس کے داخل ہونے کی جگہ ( قبر ) کو وسیع فرما اور اس ( کےگناہوں ) کو پانی ، برف اور اولوں سے دھو دے ، اسے گناہوں سے اس طرح صاف کردے جس طرح تو نے سفید کپڑے کو میل کچیل سے صاف کیا اور اسے اس گھر کے بدلے میں بہتر گھر ، اس کے گھر والوں کے بدلے میں بہتر گھر والے اور اس کی بیوی کے بدلے میں بہتر بیوی عطا فرما اور اس کو جنت میں داخل فرما اور قبر کے عذاب سے اور آگ کے عذاب سے اپنی پناہ عطا فرما ۔ \"\" حضرت عوف رضی اللہ تعالیٰ عنہ نے کہا : اس میت پر رسول اللہ صلی اللہ علیہ وسلم کی دعاؤں کی وجہ سے میں نے تمنا کی کہ کاش وہ میت میں ہوتا",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2235,
			"arabicnumber": "964.01",
			"text": "عبدالوارث بن سعیدنے حسین بن ذکوان سے خبردی ، انھوں نے کہا : مجھے عبداللہ بن بریدہ نے حضرت سمرہ بن جندب رضی اللہ تعالیٰ عنہ سے حدیث سنائی ، انھوں نے کہا : میں نے نبی اکرم صلی اللہ علیہ وسلم کے پیچھے نماز پڑھی ، آپ صلی اللہ علیہ وسلم نے ام کعب رضی اللہ تعالیٰ عنہا کی نماز جنازہ پڑھائی جو حالت نفاس میں وفات پاگئیں تھیں ، تو رسول اللہ صلی اللہ علیہ وسلم اس کی نماز جنازہ ادا کرنے کے لئے اس کے ( سامنے ) درمیان میں کھڑے ہوئے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2236,
			"arabicnumber": "964.02",
			"text": "ابن مبارک ، یزید بن ہارون اور فضل بن موسیٰ سب نے حسین سے اسی ( سابقہ ) سند کے ساتھ روایت بیان کی اور انھوں نے ام کعب رضی اللہ تعالیٰ عنہا ( کا نام ) ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2237,
			"arabicnumber": "964.03",
			"text": "محمد بن مثنیٰ اور عقبہ بن مکرم عمی نے کہا : ہمیں ابن ابی عدی نے حسین ( بن ذکوان ) سے حدیث بیان کی اور انھوں نے عبداللہ بن بریدہ سے روایت کی ، انھوں نے کہا : حضرت سمرہ بن جندب رضی اللہ تعالیٰ عنہ نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں نوعمر لڑکا تھا اور میں آپ صلی اللہ علیہ وسلم سے ( احادیث سن کر ) یاد کیا کر تا تھا اور مجھے بات کرنے سے اس کے سوا کوئی چیز نہ روکتی کہ یہاں بہت لوگ ہیں جو عمر میں مجھ سےبڑے ہیں ، میں نے رسول اکرم صلی اللہ علیہ وسلم کی اقتداء میں ایک عورت کی نماز جنازہ ادا کی جوحالت نفاس میں وفات پاگئیں تھی ۔ رسول اللہ صلی اللہ علیہ وسلم نماز میں اس کے ( سامنے ) درمیان میں کھڑے ہوئے تھے ۔ ابن مثنیٰ کی روایت میں ہے ( حسین نے ) کہا : مجھے عبداللہ بن بریدہ نے حدیث سنائی اور کہا : آپ اس کی نماز جنازہ ادا کرنے کےلئے اس کے ( سامنے ) درمیان میں کھڑے ہوئے تھے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2238,
			"arabicnumber": "965.01",
			"text": "مالک بن مغول سے نے سماک بن حرب سے اور انھوں نے جابر بن سمرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے پاس ( بغیرزین کے ) ننگی پشت والا ایک گھوڑا لایاگیا ، جب آپ صلی اللہ علیہ وسلم ابن دحداح رضی اللہ تعالیٰ عنہ کے جنازے سے لوٹے تو اس پر سوار ہوگئے جبکہ ہم آپ صلی اللہ علیہ وسلم کے ارد گرد ( پیدل ) چل رہے تھے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2239,
			"arabicnumber": "965.02",
			"text": "شعبہ نے سماک بن حرب سے اور انھوں نے جابر بن سمرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ابن دحداح کی نماز جنازہ پڑھائی ، پھر ننگی پشت والا ( بغیرزین کے ) ایک گھوڑا لایا گیا ، ایک آدمی نے اسے ( پکڑ کر ) روکا تو آپ صلی اللہ علیہ وسلم اس پر سوار ہوگئے وہ آپ صلی اللہ علیہ وسلم کو اٹھا کردلکی چال چلنے لگا ، ہم آپ صلی اللہ علیہ وسلم کےپیچھے تیز قدموں کے ساتھ چل رہے تھے ، کہا : لوگوں میں سے ایک آدمی نے کہا : نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" ابن دحداح کے لئے جنت میں کتنے لٹکے ہوئے ۔ ۔ ۔ یا جھکے ہوئے ۔ ۔ ۔ خوشے ہیں! \" یا شعبہ نے ( ابن دحداح رضی اللہ تعالیٰ عنہ کے بجائے ) \" ابو دحداح رضی اللہ تعالیٰ عنہ کے لئے کہا :",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2240,
			"arabicnumber": "966",
			"text": "عامر بن سعد بن ابی وقاص سے روایت ہے کہ حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ نے اپنی اس بیماری کے دوران میں جس میں وہ فوت ہوگئے تھے ، ( اپنے لواحقین سے ) کہا : میرے لئے لحد تیار کرنا اور میرے اوپر اچھے طریقے سے کچی اینٹیں لگانا جس طرح رسول اللہ صلی اللہ علیہ وسلم ) قبر مبارک ) کے ساتھ کیا گیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2241,
			"arabicnumber": "967",
			"text": "ابو جمرہ نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کی قبر میں سرخ موٹی چادر رکھی ( بچھائی ) گئی تھی ۔ امام مسلم ؒ نے کہا : ابو جمرہ کا نام نصر بن عمران اور ابو تیاح کا نام یزید بن حمید ہے ۔ ( ان کا نام سند میں نہیں ) یہ ایک زائد فائدہ ہے جس کا اضافہ امام مسلم ؒ نے غالباً کسی شاگرد کے سوال پر کیا ) ان دونوں نے سرخس میں وفات پائی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2242,
			"arabicnumber": "968",
			"text": "اثامہ بن شفی نے بیان کیا ، کہا : ہم سرزمین روم کے جزیرہ رودس ( Rhodes ) میں فضالہ بن عبید ( اوسی انصاری ) رضی اللہ تعالیٰ عنہ کے ساتھ تھے کہ ہمارا ایک دوست وفات پاگیا ۔ حضرت فضالہ بن عبید رضی اللہ تعالیٰ عنہ نے ان کی قبر کے بارے میں حکم دیا تو اس کو برابرکردیا گیا ، پھر انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے کہ آپ صلی اللہ علیہ وسلم ان ( قبروں ) کو ( زمین کے ) برابر کرنے کا حکم دیتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2244,
			"arabicnumber": "969.02",
			"text": "یحییٰ القطان نے کہا : ہمیں سفیان نے حبیب سے اسی سند کے ساتھ ( سابقہ حدیث کے مانند ) حدیث بیان کی اور انھوں نے ( لا تدع تمثالا الا طمسته کے بجائے ) ولا صورة الا طمستها ( کوئی تصویر نہ چھوڑنا مگر اسے مٹا دینا ) کہا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2245,
			"arabicnumber": "970.01",
			"text": "حفص بن غیاث نے ابن جریج سے ، انھوں نے ابو زبیر سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ( اس بات سے ) منع فرمایا کہ قبر پر چونا لگایا جائے اور اس پر بیٹھا جائے اور اس پر عمارت بنائی جائے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2246,
			"arabicnumber": "970.02",
			"text": "حجاج بن محمد اور عبدالرزاق نے ابن جریج سے روایت کی ، کہا : مجھے ابو زبیر نے خبر دی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ فرمارہے تھے : میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ۔ ۔ ۔ آگے اس ( پچھلی حدیث ) کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2247,
			"arabicnumber": "970.03",
			"text": "ایوب نے ابو زبیر سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : قبروں کوچونا لگانے سے منع کیا گیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2248,
			"arabicnumber": "971.01",
			"text": "جریری نے سہیل سے ، انہوں نے اپنے والد ( ابوصالح ) سے اور انھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی انگارے پر ( اس طرح ) بیٹھ جائے کہ وہ اس کے کپڑوں کو جلا کر اس کی جلد تک پہنچ جائے ، اس کے حق میں اس سے بہتر ہے کہ وہ کسی قبر پر بیٹھے ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2249,
			"arabicnumber": "971.02",
			"text": "عبدالعزیز اور سفیان دونوں نے سہیل سے اسی سند کے ساتھ اسی طرح روایت بیا ن کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2250,
			"arabicnumber": "972.01",
			"text": "بسر بن عبیداللہ نے حضرت و اثلہ ( بن اسقع بن کعب رضی اللہ تعالیٰ عنہ ) سے اور انھوں نے حضرت ابو مرثد غنوی رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قبروں پر نہ بیٹھو اور نہ ان کی طرف ( رخ کرکے ) نماز پڑھو ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2251,
			"arabicnumber": "972.02",
			"text": "ابو ادریس خولانی نے حضرت و اثلہ بن اسقع رضی اللہ تعالیٰ عنہ سے اور انھوں نے اور حضرت ابو مرثد غنوی رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" قبروں کی طرف ( رخ کرکے ) نماز نہ پڑھو اور نہ ان پر بیٹھو ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2252,
			"arabicnumber": "973.01",
			"text": "عبدالعزیز بن محمد نے عبدالواحد بن حمزہ سے اور انھوں نے عباد بن عبداللہ بن زبیر سے روایت کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے حکم دیا کہ حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ کا جنازہ مسجد میں سے گزارا جائے ( تاکہ ) وہ بھی ان کا جنازہ ادا کرسکیں ۔ آپ کی بات پر لوگوں نے اعتراض کیا تو حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : لوگ کس قدر جلد بھول گئے! رسول اللہ صلی اللہ علیہ وسلم نے ( بدری صحابی ) سہیل بن بیضاء رضی اللہ تعالیٰ عنہ کی نماز جنازہ مسجد ہی میں ادا کی تھی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2253,
			"arabicnumber": "973.02",
			"text": "موسیٰ بن عقبہ نے عبدالواحد سے اور انھوں نے عباد بن عبداللہ بن زبیر سے روایت کی ، وہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کرتے ہیں کہ جب حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ فوت ہوئے تو نبی اکرم صلی اللہ علیہ وسلم کی ازواج مطہرات نے پیغام بھیجا کہ ان کے جنازے کو مسجد میں سے گزار کرلے جائیں تا کہ وہ بھی ان کی نماز جنازہ ادا کرسکیں تو انھوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے ایسا ہی کیا ، اس جنازے کو ان کے حجروں کے سامنے روک ( کررکھ ) دیا گیا ( تاکہ ) وہ نماز جنازہ پڑھ لیں ۔ ( پھر ) اس ( جنازے ) کو باب الجنائز سے ، جو مقاعد کی طرف ( کھلتا ) تھا ، باہر نکالا گیا ۔ اس کے بعد ان ( ازواج ) کو یہ بات پہنچی کہ لوگوں نے معیوب سمجھا ہے اور کہا ہے : جنازوں کو مسجد میں نہیں لایا جاتا تھا ۔ یہ بات حضرت عائشہ رضی اللہ تعالیٰ عنہا تک پہنچی تو انھوں نے فرمایا : لوگوں نےاس کام کو معیوب سمجھنے میں کتنی جلدی کی جس کا انھیں علم نہیں!انھوں نے ہماری اس بات پر اعتراض کیا ہے کہ جنازہ مسجد میں لایاجائے ، حالانکہ رسول اللہ صلی اللہ علیہ وسلم نے سہیل بن بیضاء رضی اللہ تعالیٰ عنہ کا جنازہ مسجد کے اندر ہی پڑھا تھا ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 2254,
			"arabicnumber": "973.03",
			"text": "حضرت ابوسلمہ بن عبدالرحمان سے روایت ہے کہ جب حضر ت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ کی وفات ہوئی تو حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : ان کو مسجد میں لاؤ تاکہ میں بھی انکی نماز جنازہ ادا کرسکوں ۔ ان کی اس بات پر اعتراض کیا گیا تو انھوں نے کہا : اللہ کی قسم!رسول اللہ صلی اللہ علیہ وسلم نے بیضاء کے دو بیٹوں سہیل اور اس کے بھائی ( سہل ) رضوان اللہ عنھم اجمعین کا جنازہ مسجد میں ہی پڑھا تھا ۔ امام مسلم ؒ نے کہا : سہیل بن دعد ، جو ابن بیضاء ہے ، اس کی ماں بیضاء تھیں ۔ ( بیضاء کا اصل نام دعد تھا ، سہیل کے والد کا نام وہب بن ربیعہ تھا ، اسے شرف صحبت حاصل نہ ہوا ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 2255,
			"arabicnumber": "974.01",
			"text": "یحییٰ بن یحییٰ تمیمی ، یحییٰ بن ایوب اور قتیبہ بن سعید نے ہمیں حدیث سنائی ۔ ۔ ۔ یحییٰ بن یحییٰ نے کہا : ہمیں خبر دی اور دوسرے دونوں نے کہا : ہمیں حدیث سنائی ۔ ۔ ۔ اسماعیل بن جعفر نے شریک سے ، انھوں نے عطاء بن یسار سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے ، انھوں نے کہا : ۔ ۔ ۔ جس رات رسول اللہ صلی اللہ علیہ وسلم کی باری ان کے پاس ہوتی تو ۔ ۔ ۔ رسول اللہ صلی اللہ علیہ وسلم رات کے آخری حصے میں بقیع ( کے قبرستان میں ) تشریف لے جاتے اور فرماتے : \" اے ایمان رکھنے والی قوم کے گھرانے!تم پر اللہ کی سلامتی ہو ، کل کے بارے میں تم سے جس کا وعدہ کیا جاتا تھا ، وہ تم تک پہنچ گیا ۔ تم کو ( قیامت ) تک مہلت دے دی گئی اور ہم بھی ، اگر اللہ نے چاہا تم سے ملنے والے ہیں ۔ اے اللہ!بقیع غرقد ( میں رہنے ) والوں کو بخش دے ۔ \" قتیبہ نے ( اپنی روایت ) میں \" واتاكم \" ( تم تک پہنچ گیا ) نہیں کہا ۔ ۔ ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 2256,
			"arabicnumber": "974.02",
			"text": "عبداللہ بن وہب نے ہمیں حدیث سنائی اور کہا : ابن جریج نے عبداللہ بن کثیر بن مطلب سے روایت کی ، انھوں نے محمد بن قیس بن مخرمہ بن مطلب ( المطلبی ) کو کہتے ہوئے سنا کہ میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا ، وہ حدیث بیان کررہی تھیں ، انھوں نے کہا : کیا میں تمھیں رسول اللہ صلی اللہ علیہ وسلم اور اپنی طرف سے حدیث نہ سناؤں؟ہم نے کہا : کیوں نہیں ۔ ۔ ۔ اور حجاج بن محمد نے ہمیں حدیث سنائی ، کہا : ہمیں ابن جریج نے حدیث سنائی ، کہا : قریش کے ایک فرد عبداللہ نے محمد بن قیس بن مخرمہ بن مطلب سے روایت کی کہ ایک دن انھوں نے کہا؛کیا میں تمھیں اپنی اور اپنی ماں کی طرف سے حدیث نہ سناؤں؟کہا : ہم نے سمجھا کہ ان کی مراد اپنی اس ماں سے ہے جس نے انھیں جنم دیا ( لیکن انھوں نے ) کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : کیا میں تمھیں اپنی طرف سے اور ر سول اللہ صلی اللہ علیہ وسلم کی طرف سے حدیث نہ سناؤں؟ہم نے کہا : کیوں نہیں!کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : ( ایک دفعہ ) جب میری ( باری کی ) رات ہوئی جس میں نبی کریم صلی اللہ علیہ وسلم میرے ہاں تھے ، آپ ( مسجد سے ) لوٹے ، اپنی چادر ( سرہانے ) رکھی ، اپنے دونوں جوتے اتار کر اپنے دونوں پاؤں کے پاس رکھے اور اپنے تہبند کا ایک حصہ بستر پر بچھایا ، پھر لیٹ گئے ۔ آپ نے صرف اتنی دیر انتظار کیا کہ آپ نے خیال کیا میں سو گئی ہوں ، تو آپ نے آہستہ سے اپنی چادر اٹھائی ، آہستہ سے اپنے جوتے پہنے اور آہستہ سے دروازہ کھولا ، نکلے ، پھر آہستہ سے اس کو بند کردیا ۔ ( یہ دیکھ کر ) میں نے بھی اپنی قمیص سر سے گزاری ( جلدی سے پہنی ) اپنا دوپٹا اوڑھا اور اپنی آزار ( کمر پر ) باندھی ، پھر آپ کے پیچھے چل پڑی حتیٰ کہ آپ بقیع ( کے قبرستان میں ) پہنچے اور کھڑے ہوگئے اور آپ لمبی دیر تک کھڑے رہے ، پھر آپ نے تین دفعہ ہاتھ اٹھائے ، پھر آپ پلٹے اور میں بھی واپس لوٹی ، آپ تیز ہوگئے تو میں بھی تیز ہوگئی ، آپ تیز تر ہوگئے تو میں بھی تیز تر ہوگئی ۔ آپ دوڑ کر چلے تو میں نے بھی دوڑنا شروع کردیا ۔ میں آپ سے آگے نکل آئی اور گھر میں داخل ہوگئی ۔ جونہی میں لیٹی آپ صلی اللہ علیہ وسلم بھی گھر میں داخل ہوگئے اور فرمایا : \" عائشہ! تمھیں کیا ہوا کانپ رہی ہو؟سانس چڑھی ہوئی ہے ۔ \" میں نے کہا کوئی بات نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم مجھے بتاؤ گی یا پھر وہ مجھے بتائے گا جو لطیف وخبیر ہے ( باریک بین ہے اور انتہائی باخبر ) ہے ۔ \" میں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم میرے ماں باپ آپ پر فدا ہوں!اور میں نے ( پوری بات ) آپ کو بتادی ۔ آپ نے فرمایا : \" تو وہ سیاہ ( ہیولا ) جو میں نے اپنے آگے دیکھا تھا ، تم تھیں؟ \" میں نے کہا : ہاں ۔ آپ نے میرے سینے کو زور سے دھکیلا جس سے مجھے تکلیف ہوئی ۔ پھر آپ نے فرمایا : \" کیا تم نے یہ خیال کیا کہ اللہ تم پر زیادتی کرے گا اور اس کا رسول صلی اللہ علیہ وسلم ؟ \" ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : لوگ ( کسی بات کو ) کتنا ہی چھپا لیں اللہ اس کوجانتا ہے ، ہاں ۔ آپ نے فرمایا : \" جب تو نے ( مجھے جاتے ہوئے ) دیکھاتھا اس وقت جبرئیل علیہ السلام میرے پاس آئے تھے ۔ انھوں نے ( آکر ) مجھے آواز دی اور اپنی آواز کو تم سے مخفی رکھا ، میں نے ان کو جواب دیا تو میں نے بھی تم سے اس کو مخفی رکھا اور وہ تمہارے پاس اندر نہیں آسکتے تھے تم کپڑے اتار چکیں تھیں اور میں نے خیال کیا کہ تم سوچکی ہو تو میں نے تمھیں بیدار کرنا مناسب نہ سمجھا اور مجھے خدشہ محسوس ہواکہ تم ( اکیلی ) وحشت محسوس کروگی ۔ تو انھوں ( جبرئیل علیہ السلام ) نے کہا : آپ کا رب آپ کو حکم دیتاہے کہ آپ اہل بقیع کے پاس جائیں اور ان کے لئے بخشش کی دعا کریں ۔ \" ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : میں نے پوچھا : اے اللہ کےرسول صلی اللہ علیہ وسلم !میں ان کے حق میں ( دعا کے لئے ) کیسے کہوں؟آپ نے فرمایا : \" تم کہو ، مومنوں اور مسلمانوں میں سے ان ٹھکانوں میں رہنے والوں پر سلامتی ہو ، اللہ تعالیٰ ہم سے آگے جانے والوں اور بعد میں آنے والوں پر رحم کرے ، اور ہم ان شاء اللہ ضرور تمہارے ساتھ ملنے والے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 2257,
			"arabicnumber": "975",
			"text": "ابو بکر بن ابی شیبہ اور زہیر بن حرب نے کہا : ہمیں محمد بن عبد اللہ اسدی نے سفیان سے حدیث سنائی ، انھوں نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے اور انھوں نے ا پنے والد ( بریدہ اسلمی رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا : جب وہ قبرستان جاتے تو رسول اللہ صلی اللہ علیہ وسلم ان کو تعلیم دیا کرتے تھے تو ( سیکھنے کے بعد ) ان کا کہنے والا کہتا : ابو بکر کی روایت میں ہے : \" سلامتی ہو مسلمانوں اور مومنوں کے ٹھکانوں میں رہنے والوں پر \" اورزہیر کی روایت میں ہے؛ \" مسلمانوں اور مومنوں کے ٹھکانے میں رہنے والو تم پر ۔ ۔ ۔ اور ہم ان شاء اللہ ضرور ( تمہارے ساتھ ) ملنے والے ہیں ، میں اللہ تعالیٰ سے اپنے اور تمھارے لئے عافیت مانگتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 2258,
			"arabicnumber": "976.01",
			"text": "مروان بن معاویہ نے یزید ، یعنی ابن کیسان سے ، انھوں نے ابو حازم سےاور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے اپنے رب سے اپنی ماں کے استغفار کی اجازت مانگی تو اس نے مجھے اجازت نہیں دی اور میں نے اس سے ان کی قبر کی زیارت کی اجازت مانگی تو مجھے اجازت دے دی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 2259,
			"arabicnumber": "976.02",
			"text": "محمد بن عبید نے یزید بن کیسان سے ، انھوں نے ابو حازم سے اور اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے اپنی ماں کی قبر کی زیارت کی ، آپ روئے اور اپنے اردگرد والوں کو بھی رلایا ، پھر فرمایا : \" میں نے اپنے رب سے اجازت مانگی کہ میں ان کے لئے بخشش کی طلب کروں تو مجھے اجازت نہیں دی گئی اور میں نے اجازت مانگی کہ میں ان کی قبر کی زیارت کروں تو اس نے مجھے اجازت دے دی ، پس تم بھی قبروں کی زیارت کیاکرو کیونکہ وہ تمھیں موت کی یاددلاتی ہیں ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 2260,
			"arabicnumber": "977.01",
			"text": "ابو بکر بن ابی شیبہ ، محمد بن عبداللہ بن نمیر اور محمد بن مثنی نے ہمیں حدیث سنائی ۔ ۔ ۔ الفاظ ابو بکر اور ابن نمیر کے ہیں ۔ ۔ ۔ انھوں نے کہا : ہمیں محمد بن فضیل نے ابو سنان سے ، جو ضرار بن مرہ ہیں ، حدیث سنائی ، انھوں نے محارب بن دثار سے ، انھوں نے ابن بریدہ سے ، اور انھوں نے اپنے والد ( حضرت بریرہ بن حصیب اسلمی رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میں نے تمھیں قبروں کی زیارت سے منع کیا تھاتو ( اب ) تم ان کی زیارت کیا کرو ۔ اور میں نے تمھیں تین دن سے اوپر قربانیوں کے گوشت ( رکھنے ) سے منع کیا تھا ( اب ) تم جب تک چاہو رکھ سکتے ہو اور میں نے تمھیں مشکیزوں کے سوا کسی اور برتن میں نبیذ پینے سے منع کیا تھا ، اب تم ہر قسم کے برتنوں میں سے پی سکتے ہولیکن کوئی نشہ آورچیز نہ پیو ۔ \"\" ابن نمیر نے اپنی روایت میں کہا : عبداللہ بن بریدہ سے روایت ہے ، انھوں نے اپنے والد سے روایت کی ۔ ( انھوں نے ابن بریدہ کے نام ، عبداللہ کی صراحت کی ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 2261,
			"arabicnumber": "977.02",
			"text": "ابو خیثمہ نے زبید الیامی سے ، انھوں نے محارب بن دثار سے ، انھوں نے ابن بریدہ سے ، انھوں نے ، میرا خیال ہے اپنے والدسےشک ابو خیثمہ کی طرف سے ہے ۔ ۔ ۔ اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ۔ ( اسی طرح ) سفیان نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے ، انھوں نے اپنے والد سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ۔ ( اسی طرح ) معمر نے عطاء خراسانی سے روایت کی ، انھو ں نے کہا : مجھے عبداللہ بن بریدہ نے اپنے والد سے حدیث سنائی اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ۔ ان سب ( زبید ، سفیان اور معمر ) نے ابو سنان کی حدیث کے ہم معنی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 2262,
			"arabicnumber": "978",
			"text": "حضرت جابر بن سمرہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : نبی اکرم صلی اللہ علیہ وسلم کے پاس ایک آدمی لایا گیا جس نے اپنے آپ کو ایک چوڑے تیر سے قتل کرڈالا تھا تو آپ نے ( خود ) اس کی نماز جنازہ نہیں پڑھی ۔ ( دوسروں کو پڑھنے کا حکم دیا جس طرح ابتداء میں آپ دوسروں کو مقروض کا جنازہ پڑھنے کا حکم دیتے تھے ۔)",
			"grades": [],
			"reference": {
				"book": 11,
				"hadith": 138
			}
		}
	]
}