{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"16": "The Book of Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 388,
			"arabicnumber": "154.02",
			"text": "عبدہ بن سلیمان ، سفیان اور شعبہ نے صالح بن صالح کے واسطے سے سابقہ سند کے ساتھ یہی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 3398,
			"arabicnumber": "1400.01",
			"text": "ابو معاویہ نے ہمیں اعمش سے خبر دی ، انہوں نے ابراہیم سے ، انہوں نے علقمہ سے روایت کی ، انہوں نے کہا : میں منیٰ میں حضرت عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ پیدل چل رہا تا کہ حضرت عثمان رضی اللہ عنہ س ے ان کی ملاقات ہوئی ، وہ کھڑے ہو کر ان سے باتیں کرنے لگے ۔ سیدنا عثمان رضی اللہ عنہ نے اِن سے کہا : ابوعبدالرحمٰن! کیا ہم کسی نوجوان لڑکی سے آپ کی شادی نہ کرا دیں ، شاید وہ آپ کو آپ کا وہی زمانہ یاد کرا دے جو گزر چکا ہے؟ کہا : تو حضرت عبداللہ بن مسعود رضی اللہ عنہ نے کہا : اگر آپ نے یہ بات کہی ہے تو ( اس سے پہلے ) رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا تھا : \" اے جوانوں کے گروہ! تم میں سے جو کوئی شادی کی استطاعت رکھتا ہو وہ شادی کر لے ، یہ نگاہ کو زیادہ جھکانے والی اور شرمگاہ کی زیادہ حفاظت کرنے والی ہے اور جو استطاعت نہیں رکھتا تو وہ روزے کو لازم کر لے ، یہ اس کے لیے خواہش کو قابو میں کرنے کا ذریعہ ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3399,
			"arabicnumber": "1400.02",
			"text": "جریر نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے ابراہیم سے ، انہوں نے علقمہ سے روایت کی ، کہا : میں منیٰ میں حضرت عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ پیدل چل رہا تھا کہ حضرت عثمان رضی اللہ عنہ ان سے ملے تو انہوں نے کہا : ابوعبدالرحمٰن! ( میرے ساتھ ) آئیں ۔ کہا : وہ انہیں تنہائی میں لے گئے ۔ جب عبداللہ ( بن مسعود ) رضی اللہ عنہ نے دیکھا کہ انہیں اس ( تنہائی ) کی ضرورت نہیں ، تو انہوں نے مجھے بلا لیا ۔ ( کہا : ) علقمہ آ جاؤ! میں آ گیا ، تو سیدنا عثمان رضی اللہ عنہ نے ان سے کہا : ابوعبدالرحمٰن! کیا ہم کسی کنواری لڑکی سے آپ کی شادی نہ کرا دیں ، شاید یہ آپ کے دل کی اسی کیفیت کو لوٹا دے جو آپ ( عہد جوانی ) میں محسوس کرتے تھے؟ تو عبداللہ رضی اللہ عنہ نے جواب دیا : اگر آپ نے یہ بات کہی ہے ۔ ۔ ۔ پھر ابومعاویہ کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3400,
			"arabicnumber": "1400.03",
			"text": "ابومعاویہ نے ہمیں اعمش سے حدیث سنائی ، انہوں نے عمارہ بن عمیر سے ، انہوں نے عبدالرحمٰن بن یزید سے ، انہوں نے حضرت عبداللہ ( بن مسعود ) رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا : \" اے جوانوں کی جماعت! تم میں سے جو شادی کرنے کی استطاعت رکھتا ہو وہ شادی کر لے ، یہ نگاہوں کو جھکانے اور شرمنگاہ کی حفاظت کرنے میں ( دوسری چیزوں کی نسبت ) بڑھ کر ہے ، اور جو استطاعت نہ پائے ، وہ خود پر روزے کو لازم کر لے ، یہ اس کے لیے اس کی خواہش کو قطع کرنے والا ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3401,
			"arabicnumber": "1400.04",
			"text": "جریر نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے عمارہ بن عمیر سے ، انہوں نے عبدالرحمٰن بن یزید ( بن قیس ) سے روایت کی ، کہا : میں ، میرے چچا علقمہ ( بن قیس ) اور ( میرے بھائی ) اسود ( بن یزید بن قیس ) حضرت ابن مسعود رضی اللہ عنہ کی خدمت میں حاضر ہوئے ۔ کہا : میں ان دنوں جوان تھا ۔ انہوں نے ایک حدیث بیان کی ، مجھے یوں لگتا ہے کہ وہ انہوں نے میری وجہ سے بیان کی ۔ انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ۔ ۔ ۔ ( آگے ) ابومعاویہ کی حدیث کے مانند ہے ۔ اور ( یہ ) اضافہ کیا ، کہا : اس کے بعد میں نے زیادہ عرصہ توقف کیے بغیر شادی کر لی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3402,
			"arabicnumber": "1400.05",
			"text": "وکیع نے ہمیں حدیث بیان کی ، کہا : ہمیں اعمش نے باقی ماندہ سابقہ سند کے ساتھ حضرت عبداللہ رضی اللہ عنہ سے روایت کی ، ( عبدالرحمان بن یزید نے ) کہا : ہم ان کی خدمت میں حاضر ہوئے ، میں سب سے کم عمر تھا ، آگے انہی کی حدیث کے مانند ہے ، ( مگر ) انہوں نے یہ نہیں کہا : \" اس کے بعد میں نے زیادہ عرصہ توقف کیے بغیر شادی کر لی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3403,
			"arabicnumber": "1401",
			"text": "حضرت انس رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم کے صحابہ میں سے کچھ لوگوں نے نبی صلی اللہ علیہ وسلم کی ازدواج مطہرات سے آپ کی تنہائی کے معمولات کے بارے میں سوال کیا ، پھر ان میں سے کسی نے کہا : میں عورتوں سے شادی نہیں کروں گا ، کسی نے کہا : میں گوشت نہیں کھاؤں گا ، اور کسی نے کہا : میں بستر پر نہیں سوؤں گا ۔ ( آپ کو پتہ چلا ) تو آپ صلی اللہ علیہ وسلم نے اللہ کی حمد کی ، اس کی ثنا بیان کی اور فرمایا : \" لوگوں کا کیا حال ہے؟ انہوں نے اس اس طرح سے کہا ہے ۔ لیکن میں تو نماز پڑھتا ہوں اور آرام بھی کرتا ہوں ، روزے رکھتا ہوں اور افطار بھی کرتا ہوں اور عورتوں سے نکاح بھی کرتا ہوں ، جس نے میری سنت سے رغبت ہٹا لی وہ مجھ سے نہیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3404,
			"arabicnumber": "1402.01",
			"text": "معمر نے زہری سے ، انہوں نے سعید بن مسیب سے اور انہوں نے سعد بن ابی وقاص رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے عثمان بن معظون رضی اللہ عنہ کی ( طرف سے ) نکاح کو ترک کر کے عبادت میں مشغولیت ( کے ارادے ) کو مسترد فرما دیا ۔ اگر آپ انہیں اجازت دے دیتے تو ہم سب خود کو خصی کر لیتے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3405,
			"arabicnumber": "1402.02",
			"text": "ابراھیم بن سعد نے ہمیں ابن شہاب زہری سے حدیث بیان کی انہو ں نے سعید بن مسیب سے روایت کی ‘ انہوں نے کہا کہ میں نے سعد سے سنا وہ کہہ رہے تھے ’’عثمان بن معون ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ترک نکاح کو ( ارادے کو ) رسول اللہ ﷺ کی طرف سے رد کر دیا گیا ‘ اگر انہیں اجازت مل جاتی تو ہم سب خصی ہو جاتے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3406,
			"arabicnumber": "1402.03",
			"text": "عُقَیل نے ابن شہاب سے روایت کی ، انہوں نے کہا : مجھے سعید بن مسیب نے خبر دی کہ انہوں نے سعد بن ابی وقاص رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : عثمان بن معثون رضی اللہ عنہ نے ارادہ کیا کہ وہ ( عبادے کے لئے نکاح اور گھرداری سے ) الگ ہو جائیں تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں منع فرما دیا ، اگر آپ انہیں اس کی اجازت دے دیتے تو ہم سب خصی ہو جاتے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3407,
			"arabicnumber": "1403.01",
			"text": "ہشام بن ابی عبداللہ نے ابوزبیر سے حدیث بیان کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی کہ ایک عورت پر رسول اللہ صلی اللہ علیہ وسلم کی نظر پڑ گئی تو آپ اپنی اہلیہ حضرت زینب رضی اللہ عنہا کے پاس آئے ۔ وہ اپنے لیے ایک چمڑے کو رنگ رہی تھیں ، آپ نے ( گھر میں ) اپنی ضرورت پوری فرمائی ، پھر اپنے صحابہ کی طرف تشریف لے گئے ، اور فرمایا : \" بلاشبہ ( فتنے میں ڈالنے کے حوالے سے ) عورت شیطان کی صورت میں سامنے آتی ہے اور شیطان ہی کی صورت میں مڑکر واپس جاتی ہے ۔ تم میں سے کوئی جب کسی عورت کو دیکھے تو وہ اپنی بیوی کے پاس آ جائے ، بلاشبہ یہ چیز اس خواہش کو ہتا دے گی جو اس کے دل میں ( پیدا ہوئی ) ہے ،",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3408,
			"arabicnumber": "1403.02",
			"text": "حرب بن ابوعالیہ نے ہمیں حدیث بیان کی ، کہا : ہمیں ابوزبیر نے جابر بن عبداللہ رضی اللہ عنہ سے حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم کی نظر ایک عورت پر پڑ گئی ۔ ۔ ۔ آگے اسی کے مانند بیان کیا ، البتہ انہوں نے کہا : آپ صلی اللہ علیہ وسلم اپنی بیوی زینب رضی اللہ عنہا کے پاس آئے جبکہ وہ چمڑے کو رنگ رہی تھیں ۔ اور یہ نہیں کہا : \" وہ شیطان کی صورت میں واپس آ جاتی ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3409,
			"arabicnumber": "1403.03",
			"text": "معقل نے ابوزبیر سے روایت کی ، کہا : حضرت جابر رضی اللہ عنہ نے کہا : میں نے نبی اکرم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جب تم میں سے کسی کو ، کوئی عورت اچھی لگے ، اور اس کے دل میں جاگزیں ہو جائے تو وہ اپنی بیوی کا رخ کرے اور اس سے صحبت کرے ، بلاشبہ یہ ( عمل ) اس کیفیت کو دور کر دے گا جو اس کے دل میں ( پیدا ہوئی ) ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3410,
			"arabicnumber": "1404.01",
			"text": "محمد بن عبداللہ بن نمیر ہمدانی نے کہا : میرے والد نے اور وکیع اور ابن بشیر نے ہمیں اسماعیل سے حدیث بیان کی ، انہوں نے قیس سے روایت کی ، کہا : میں نے عبداللہ ( بن مسعود ) رضی اللہ عنہ کو کہتے ہوئے سنا : ہم رسول اللہ صلی اللہ علیہ وسلم کی معیت میں جہاد کرتے تھے اور ہمارے پاس عورتیں نہیں ہوتی تھیں ، تو ہم نے ( آپ سے ) دریافت کیا : کیا ہم خصی نہ ہو جائیں؟ آپ نے ہمیں اس سے منع فرما دیا ، پھر آپ نے ہمیں رخصت دی کہ ہم کسی عورت سے ایک کپڑے ( یا ضرورت کی کسی اور چیز ) کے عوض مقررہ وقت تک نکاح کر لیں ، پھر حضرت عبداللہ رضی اللہ عنہ نے ( یہ آیت ) تلاوت کی : \" اے لوگو جو ایمان لائے! وہ پاکیزہ چیزیں حرام مت ٹھہراؤ جو اللہ نے تمہارے لیے حلال کی ہیں اور حد سے نہ بڑھو ، بے شک اللہ تعالیٰ حد سے بڑھنے والوں کو پسند نہیں کرتا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3411,
			"arabicnumber": "1404.02",
			"text": "جریر نے اسماعیل بن ابی خالد سے اسی سند کے ساتھ ، اسی کے مانند حدیث بیان کی اور کہا : \" پھر انہوں نے ہمارے سامنے یہ آیت پڑھی ۔ \" انہوں نے ( نام لے کر \" عبداللہ رضی اللہ عنہ نے پڑھی \" نہیں کہا)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3412,
			"arabicnumber": "1404.03",
			"text": "ابوبکر بن ابی شیبہ نے کہا : ہمیں وکیع نے اسماعیل سے اسی سند کے ساتھ حدیث بیان کی ، اور کہا : ہم سب نوجوان تھے تو ہم نے عرض کی : اے اللہ کے رسول! کیا ہم خصی نہ ہو جائیں؟ اور انہوں نے نغزو ( ہم جہاد کرتے تھے ) کے الفاظ نہیں کہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3413,
			"arabicnumber": "1405.01",
			"text": "شعبہ نے ہمیں عمرو بن دینار سے حدیث بیان کی ، انہوں نے کہا : میں نے حسن بن محمد سے سنا ، وہ جابر بن عبداللہ اور سلمہ بن اکوع رضی اللہ عنہم سے حدیث بیان کر رہے تھے ، ان دونوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کا ایک منادی کرنے والا ہمارے پاس آیا اور اعلان کیا : بلاشبہ رسول اللہ صلی اللہ علیہ وسلم نے تمہیں استمتاع ( فائدہ اٹھانے ) ، یعنی عورتوں سے ( نکاح ) متعہ کرنے کی اجازت دی ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3414,
			"arabicnumber": "1405.02",
			"text": "روح بن قاسم نے ہمیں عمرو بن دینار سے حدیث بیان کی ، انہوں نے حسن بن محمد سے ، انہوں نے سلمہ بن اکوع اور جابر بن عبداللہ رضی اللہ عنہم سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے ( اعلان کی صورت میں آپ کا پیغام آیا ) اور ہمیں متعہ کی اجازت دی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3415,
			"arabicnumber": "1405.03",
			"text": "عطاء نے کہا : حضرت جابر بن عبداللہ رضی اللہ عنہ عمرے کے لیے آئے تو ہم ان کی رہائش گاہ پر ان کی خدمت میں حاضر ہوئے ، لوگوں نے ان سے مختلف چیزوں کے بارے میں پوچھا ، پھر لوگوں نے متعے کا تذکرہ کیا تو انہوں نے کہا : ہاں ، ہم نے رسول اللہ صلی اللہ علیہ وسلم ، ابوبکر اور عمر رضی اللہ عنہما کے عہد میں متعہ کیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3416,
			"arabicnumber": "1405.04",
			"text": "مجھے ابوزبیر نے خبر دی ، کہا : میں نے جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : ہم رسول اللہ صلی اللہ علیہ وسلم اور ابوبکر رضی اللہ عنہ کے دور میں ایک مٹھی کھجور اور آٹے کے عوض چند دنوں کے لئے متعہ کرتے تھے ، حتی کہ حضرت عمر رضی اللہ عنہ نے عمرو بن حُریث کے واقعے ( کے دوران ) میں اس سے منع کر دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3417,
			"arabicnumber": "1405.05",
			"text": "ابونضرہ سے روایت ہے ، کہا : میں جابر بن عبداللہ رضی اللہ عنہ کے پاس تھا کہ ان کے پاس ایک آنے والا ( ملاقاتی ) آیا اور کہنے لگا : حضرت ابن عباس اور ابن زبیر رضی اللہ عنہم نے دونوں متعتوں ( حج تمتع اور نکاح متعہ ) کے بارے میں اختلاف کیا ہے ۔ تو حضرت جابر رضی اللہ عنہ نے کہا : ہم نے رسول اللہ صلی اللہ علیہ وسلم کے عہد میں وہ دونوں کام کیے ، پھر حضرت عمر رضی اللہ عنہ نے ہمیں ان دونوں سے منع کر دیا ، پھر ہم نے دوبارہ ان کا رخ نہیں کیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3418,
			"arabicnumber": "1405.06",
			"text": "ایاس بن سلمہ نے اپنے والد ( سلمہ بن اکوع رضی اللہ عنہ ) سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے اوطاس کے سال تین دن متعے کی اجازت دی ، پھر اس سے منع فرما دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3419,
			"arabicnumber": "1406.01",
			"text": "لیث نے ہمیں ربیع بن سبرہ جہنی سے حدیث بیان کی ، انہوں نے اپنے والد سبرہ ( بن معبد جہنی رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ( نکاح ) متعہ کی اجازت دی ۔ میں اور ایک آدمی بنو عامر کی ایک عورت کے پاس گئے ، وہ جوان اور لمبی گردن والی خوبصورت اونٹنی جیسی تھی ، ہم نے خود کو اس کے سامنے پیش کیا تو اس نے کہا : کیا دو گے؟ میں نے کہا : اپنی چادر ۔ اور میرے ساتھی نے بھی کہا : اپنی چادر ۔ میرے ساتھی کی چادر میری چادر سے بہتر تھی ، اور میں اس سے زیادہ جوان تھا ۔ جب وہ میرے ساتھی کی چادر کی طرف دیکھتی تو وہ اسے اچھی لگتی اور جب وہ میری طرف دیکھتی تو میں اس کے دل کو بھاتا ، پھر اس نے ( مجھ سے ) کہا : تم اور تمہاری چادر ہی میرے لیے کافی ہے ۔ اس کے بعد میں تین دن اس کے ساتھ رہا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کسی کے پاس ان عورتوں میں سے ، جن سے وہ متعہ کرتا ہے ، کوئی ( عورت ) ہو ، تو وہ اس کا راستہ چھوڑ دے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3420,
			"arabicnumber": "1406.02",
			"text": "بشر بن مفضل نے ہمیں حدیث بیان کی ، کیا : ہمیں عمارہ بن غزیہ نے ربیع بن سبرہ سے حدیث بیان کی کہ ان کے والد نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ غزوہ فتح مکہ میں شرکت کی ، کہا : ہم نے وہاں پندرہ روز ۔ ۔ ۔ ( الگ الگ دن اور راتیں گنیں تو ) تیس شب و روز ۔ ۔ قیام کیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں عورتوں سے متعہ کرنے کی اجازت دے دی ، چنانچہ میں اور میری قوم کا ایک آدمی نکلے ۔ مجھے حسن میں اس پر ترجیح حاصل تھی اور وہ تقریبا بدصورت تھا ۔ ہم دونوں میں سے ہر ایک کے پاس چادر تھی ، میری چادر پرانی تھی اور میرے چچا زاد کی چادر نئی ( اور ) ملائم تھی ، حتی کہ جب ہم مکہ کے نشیبی علاقے میں یا اس کے بالائی علاقے میں پہنچے تو ہماری ملاقات لمبی گردن والی جوان اور خوبصورت اونٹنی جیسی عورت سے ہوئی ، ہم نے کہا : کیا تم چاہتی ہو کہ ہم میں سے کوئی ایک تمہارے ساتھ متعہ کرے؟ اس نے کہا : تم دونوں کیا خرچ کرو گے؟ اس پر ہم میں سے ہر ایک نے اپنی اپنی چادر ( اس کے سامنے ) پھیلا دی ، اس پر اس نے دونوں آدمیوں کو دیکھنا شروع کر دیا اور میرا ساتھی اس کو دیکھنے لگا اور اس کے پہلو پر نظریں گاڑ دیں اور کہنے لگا : اس کی چادر پرانی ہے اور میری چادر نئی اور ملائم ہے ۔ اس پر وہ کہنے لگی : اس کی چادر میں بھی کوئی خرابی نہیں ۔ تین بار یا دو بار یہ بات ہوئی ۔ پھر میں نے اس سے متعہ کر لیا اور پھر میں اس کے ہاں سے ( اس وقت تک ) نہ نکلا حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم نے اسے ( متعے کو ) حرام قرار دے دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3421,
			"arabicnumber": "1406.03",
			"text": "ہمیں وُہَیب نے حدیث بیان کی ، کہا : ہمیں عُمارہ بن غزیہ نے حدیث بیان کی ، کہا : ربیع بن سبرہ جہنی نے اپنے والد سے حدیث بیان کی ، انہوں نے کہا : فتح مکہ کے سال ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مکہ کی طرف نکلے ، آگے بشر کی حدیث کے مانند بیان کیا اور یہ اضافہ کیا : اس عورت نے کہا : کیا یہ ( متعہ ) جائز ہے؟ اور اسی ( روایت ) میں ہے : ( میرے ساتھی نے ) کہا : اس کی چادر پرانی بوسیدہ ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3422,
			"arabicnumber": "1406.04",
			"text": "عبداللہ بن نمیر نے کہا : ہمیں عبدالعزیز بن عمر نے حدیث بیان کی ، کہا : مجھے ربیع بن سبرہ جہنی نے حدیث سنائی کہ ان کے والد نے انہیں حدیث بیان کی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" لوگو! بےشک میں نے تمہیں عورتوں سے متعہ کرنے کی اجازت دی تھی ، اور بلاشبہ اب اللہ تعالیٰ نے اسے قیامت کے دن تک کے لیے حرام کر دیا ہے ، اس لیے جس کسی کے پاس ان عورتوں میں سے کوئی ( عورت موجود ) ہو تو وہ اس کا راستہ چھوڑ دے ، اور جو کچھ تم لوگوں نے انہیں دیا ہے اس میں سے کوئی چیز ( واپس ) مت لو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3423,
			"arabicnumber": "1406.05",
			"text": "عبدہ بن سلیمان نے عبدالعزیز بن عمر سے اسی سند کے ساتھ حدیث بیان کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو حجر اسود اور ( بیت اللہ کے ) دروازے کے درمیان کھڑے ہوئے دیکھا ، اور آپ فرما رہے تھے ۔ ۔ ۔ ( آگے ) ابن نمیر کی حدیث کی طرح ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3424,
			"arabicnumber": "1406.06",
			"text": "عبدالملک بن ربیع بن سبرہ جہنی نے اپنے والد کے حوالے سے اپنے دادا ( سبرہ بن معبد رضی اللہ عنہ ) سے روایت کی ، کہا : فتح مکہ کے سال جب ہم مکہ میں داخل ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ( نکاح ) متعہ ( کے جواز ) کا حکم دیا ، پھر ابھی ہم وہاں سے نکلے نہ تھے کہ آپ نے ہمیں اس سے منع فرما دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3425,
			"arabicnumber": "1406.07",
			"text": "عبدالعزیز بن ربیع بن سبرہ بن معبد نے کہا : میں نے اپنے والد ربیع بن سبرہ سے سنا ، وہ اپنے والد سبرہ بن معبد رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ فتح مکہ کے سال نبی صلی اللہ علیہ وسلم نے اپنے ساتھیوں کو عورتوں کے ساتھ متعہ کر لینے کا حکم دیا ۔ میں اور بنو سُلیم میں سے میرا ایک ساتھی نکلے ، حتیٰ کہ ہم نے بنو عامر کی ایک جوان لڑکی کو پایا ، وہ ایک جوان اور خوبصورت لمبی گردن والی اونٹنی کی طرح تھی ۔ ہم نے اسے نکاح ( متعہ ) کا پیغام دیا ، اور اس کے سامنے اپنی چادریں پیش کیں ، وہ غور سے دیکھنے لگی ، مجھے میرے ساتھی سے زیادہ خوبصورت پاتی اور میرے ساتھی کی چادر کو میری چادر سے بہتر دیکھتی ، اس کے بعد اس نے گھڑی بھر اپنے دل سے مشورہ کیا ، پھر اس نے مجھے میرے ساتھی پر فوقیت دی ، پھر یہ عورتیں تین دن تک ہمارے ساتھ رہیں ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں ان کو علیحدہ کرنے کا حکم دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3426,
			"arabicnumber": "1406.08",
			"text": "سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی ، انہوں نے ربیع بن سبرہ سے اور انہوں نے اپنے والد سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے نکاح متعہ سے منع فرما دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3427,
			"arabicnumber": "1406.09",
			"text": "معمر نے زہری سے ، انہوں نے ربیع بن سبرہ سے ، انہوں نے اپنے والد سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے ( دنوں میں سے ایک ) دن عورتوں کے ساتھ ( نکاح ) متعہ کرنے سے منع فرما دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3428,
			"arabicnumber": "1406.10",
			"text": "صالح سے روایت ہے ، کہا : ہمیں ابن شہاب نے ربیع بن سبرہ جہنی سے خبر دی ، انہوں نے اپنے والد ( سبرہ رضی اللہ عنہ ) سے روایت کی کہ انہوں نے اِن کو بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے زمانے میں عورتوں سے متعہ کرنے سے منع فرما دیا تھا ، اور یہ کہ ان کے والد ( سبرہ ) نے ( اپنے ساتھی کے ہمراہ ) دو سرخ چادریں پیش کرتے ہوئے نکاح متعہ کیا تھا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3429,
			"arabicnumber": "1406.11",
			"text": "مجھے یونس نے خبر دی کہ ابن شہاب نے کہا : مجھے عروہ بن زبیر نے خبر دی کہ حضرت عبداللہ بن زبیر رضی اللہ عنہ مکہ میں کھڑے ہوئے ، اور کہا : بلاشبہ کچھ لوگ ہیں ، اللہ نے ان کے دلوں کو بھی اندھا کر دیا ہے جس طرح ان کی آنکھوں کو اندھا کیا ہے ۔ وہ لوگوں کو متعہ ( کے جواز ) کا فتویٰ دیتے ہیں ، وہ ایک آدمی ( حضرت ابن عباس رضی اللہ عنہ ) پر تعریض کر رہے تھے ، اس پر انہوں نے ان کو پکارا اور کہا : تم بے ادب ، کم فہم ہو ، میری عمر قسم! بلاشبہ امام المتقین کے عہد میں ( نکاح ) متعہ کیا جاتا تھا ۔ ۔ ان کی مراد رسول اللہ صلی اللہ علیہ وسلم سے تھی ۔ ۔ تو ابن زبیر رضی اللہ عنہ نے ان سے کہا : تم خود اپنے ساتھ اس کا تجربہ کر ( دیکھو ) ، بخدا! اگر تم نے یہ کام کیا تو میں تمہارے ( ہی ان ) پتھروں سے ( جن کے تم مستحق ہو گے ) تمہیں رجم کروں گا ۔ ابن شہاب نے کہا : مجھے خالد بن مہاجر بن سیف اللہ نے خبر دی کہ اس اثنا میں جب وہ ان صاحب ( ابن عباس رضی اللہ عنہ ) کے پاس بیٹھے ہوئے تھے ، ایک آدمی ان کے پاس آیا اور متعہ کے بارے میں ان سے فتویٰ مانگا تو انہوں نے اسے اس ( کے جواز ) کا حکم دیا ۔ اس پر ابن ابی عمرہ انصاری رضی اللہ عنہ نے ان سے کہا : ٹھہریے! انہوں نے کہا : کیا ہوا؟ اللہ کی قسم! میں نے امام المتقین صلی اللہ علیہ وسلم کے عہد میں کیا ہے ۔ ابن ابی عمرہ رضی اللہ عنہ نے کہا : بلاشبہ یہ ( ایسا کام ہے کہ ) ابتدائے اسلام میں ایسے شخص ے لئے جو ( حالات کی بنا پر ) اس کے لئے مجبور کر دیا گیا ہو ، اس کی رخصت تھی جس طرح ( مجبوری میں ) مردار ، خون اور سور کے گوشت ( کے لیے ) ہے ، پھر اللہ تعالیٰ نے اپنے دین کو محکم کیا اور اس سے منع فرما دیا ۔ ابن شہاب نے کہا : مجھے ربیع بن سبرہ جہنی نے بتایا کہ ان کے والد نے کہا : میں نے نبی صلی اللہ علیہ وسلم کے زمانے میں بنو عامر کی ایک عورت سے دو سرخ ( کی پیش کش ) پر متعہ کیا تھا ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں متعہ سے منع فرما دیا ۔ ابن شہاب نے کہا : میں نے ربیع بن سبرہ سے سنا ، وہ یہی حدیث عمر بن عبدالعزیز سے بیان کر رہے تھے اور میں ( اس مجلس میں ) بیٹھا ہوا تھا ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3430,
			"arabicnumber": "1406.12",
			"text": "ہمیں معقل نے ابن ابی عبلہ سے حدیث بیان کی ، انہوں نے عمر بن عبدالعزیز سے روایت کی ، انہوں نے کہا : مجھے ربیع بن سبرہ جہنی نے اپنے والد سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے متعے سے روکا اور فرمایا : \" خبردار! یہ تمہارے آج کے دن سے قیامت کے دن تک کے لیے حرام ہے اور جس نے ( متعے کے عوض ) کوئی چیز دی ہو وہ اسے واپس نہ لے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3431,
			"arabicnumber": "1407.01",
			"text": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے قراءت کی ، انہوں نے ابن شہاب سے ، انہوں نے محمد بن علی ( ابن حنفیہ ) کے دونوں بیٹوں عبداللہ اور حسن سے ، ان دونوں نے اپنے والد سے ، اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے دن عورتوں کے ساتھ متعہ کرنے اور پالتو گدھوں کا گوشت کھانے سے منع فرما دیا تھا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3432,
			"arabicnumber": "1407.02",
			"text": "ہمیں عبداللہ بن محمد بن اسماء ضبعی نے حدیث سنائی ، کہا : ہمیں جویریہ ( بن اسماء بن عبید ضبعی ) نے امام مالک رحمۃ اللہ علیہ سے اسی سند کے ساتھ حدیث بیان کی اور کہا : انہوں ( محمد بن علی ) نے حضرت علی رضی اللہ عنہ سے سنا ، وہ فلاں ( حضرت ابن عباس رضی اللہ عنہ ) سے کہہ رہے تھے : تم حیرت میں پڑے ہوئے ( حقیقت سے بے خبر ) شخص ہو ۔ رسول اللہ صلی اللہ علیہ وسلم نے منع فرما دیا تھا ۔ ۔ ۔ آگے یحییٰ بن یحییٰ کی امام مالک رحمۃ اللہ علیہ سے روایت کردہ حدیث کی طرح ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3433,
			"arabicnumber": "1407.03",
			"text": "سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی ، انہوں نے محمد بن علی ( ابن حنفیہ ) کے دونوں بیٹوں حسن اور عبداللہ سے ، ان دونوں نے اپنے والد سے ، انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے خیبر کے دن ( نکاح ) متعہ اور پالتو گدھوں کے گوشت سے منع فرما دیا تھا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3434,
			"arabicnumber": "1407.04",
			"text": "عبیداللہ نے ابن شہاب سے ، انہوں نے محمد بن علی سے کے دونوں بیٹوں حسن اور عبداللہ سے ، ان دونوں نے اپنے والد ( محمد ابن حنفیہ ) سے ، اور انہوں نے ( اپنے والد ) حضرت علی رضی اللہ عنہ سے روایت کی کہ انہوں نے حضرت ابن عباس رضی اللہ عنہ سے سنا ، وہ عورتوں سے متعہ کرنے کے بارے میں ( فتویٰ دینے میں ) نرمی سے کام لیتے ہیں ، انہوں نے کہا : ابن عباس! ٹھہریے! بلاشبہ رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے دن اس سے اور پالتو گدھوں کے گوشت سے منع فرما دیا تھا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3435,
			"arabicnumber": "1407.05",
			"text": "یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے محمد بن علی بن ابی طالب کے بیٹوں حسن اور عبداللہ سے ( اور ) ان دونوں نے اپنے والد ( محمد بن علی ابن حنفیہ ) سے روایت کی ، انہوں نے حضرت علی بن ابی طالب رضی اللہ عنہ سے سنا ، وہ ابن عباس رضی اللہ عنہ سے کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے خیبر کے دن عورتوں کے ساتھ متعہ کرنے اور پالتو گدھوں کے گوشت کھانے سے منع فرما دیا تھا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3436,
			"arabicnumber": "1408.01",
			"text": "اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی عورت اور اس کی پھوپھی کو ، اور کسی عورت اور اس کی خالہ کو ( نکاح میں ) اکٹھا نہ کیا جائے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3437,
			"arabicnumber": "1408.02",
			"text": "عِراک بن مالک نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے چار عورتوں کے بارے میں منع فرمایا کہ ان کو ( نکاح میں باہم ) جمع کیا جائے : عورت اور اس کی پھوپھی ( یا ) عورت اور اس کی خالہ",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3438,
			"arabicnumber": "1408.03",
			"text": "عبدالرحمٰن بن عبدالعزیز نے ابن شہاب سے خبر دی ، انہوں نے قبیصہ بن ذؤیب سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" بھائی کی بیٹی پر پھوپھی کو نہ بیاہا جائے اور نہ خالہ کے ہوتے ہوئے بھانجی سے نکاح کیا جائے ۔ \" ( اصل مقصود یہی ہے کہ یہ اکٹھی ایک شخص کے نکاح میں نہ آئیں)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3439,
			"arabicnumber": "1408.04",
			"text": "یونس نے مجھے ابن شہاب سے خبر دی ، کہا : مجھے قبیصہ بن ذؤیب کعبی نے خبر دی کہ انہوں نے سیدنا ابوہریرہ رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ کوئی شخص کسی عورت اور اس کی پھوپھی کو اور کسی عورت اور اس کی خالہ کو ( اپنے نکاح میں ایک ساتھ ) جمع کرے ۔ ابن شہاب نے کہا : ہم اس ( منکوحہ عورت ) کے والد کی خالہ اور والد کی پھوپھی کو بھی اسی حیثیت میں دیکھتے ہیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3440,
			"arabicnumber": "1408.05",
			"text": "ہشام نے ہمیں یحییٰ سے حدیث بیان کی کہ انہوں ( یحییٰ ) نے ان ( ہشام ) کی طرف ابوسلمہ سے ( اپنی ) روایت کردہ حدیث لکھ کر بھیجی کہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسی عورت سے اس کی پھوپھی اور اس کی خالہ کی موجودگی میں نکاح نہ کیا جائے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3441,
			"arabicnumber": "1408.06",
			"text": "شیبان نے یحییٰ سے روایت کی ، کہا : مجھے ابوسلمہ نے حدیث بیان کی کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا وہ کہہ رہے تھے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ ۔ ( آگے ) اسی کے مانند ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3442,
			"arabicnumber": "1408.07",
			"text": "ہشام نے محمد بن سیرین سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی آدمی اپنے بھائی کے پیغامِ نکاح پر ( اپنے ) نکاح کا پیغام نہ دے ، اور نہ اپنے بھائی کے سودے پر سودا کرے ، اور نہ کسی عورت سے اس کی پھوپھی اور خالہ کی موجودگی میں نکاح کیا جائے اور نہ کوئی عورت اپنی ( مسلمان ) بہن کی طلاق کا مطالبہ کرے تاکہ اس کی پلیٹ کو ( اپنے لیے ) انڈیل لے ۔ اسے ( پہلی بیوی کی طلاق کا مطالبہ کیے بغیر ) نکاح کر لینا چاہئے ، بات یہی ہے کہ جو اللہ نے اس کے لیے لکھا ہوا ہے وہی اس کا ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3443,
			"arabicnumber": "1408.08",
			"text": "داود بن ابی ہند نے ابن سیرین سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ کسی عورت کے ساتھ ، اس کی پھوپھی یا اس کی خالہ کے ( نکاح میں ) ہوتے ہوئے ، نکاح کیا جائے اور اس سے کہ کوئی عورت اپنی بہن کی طلاق کا مطالبہ کرے تاکہ جو اس کی پلیٹ میں ہے ، وہ ( اسے اپنے لیے ) انڈیل لے ۔ بلاشبہ اللہ عزوجل ( خود ) اس کو رزق دینے والا ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3444,
			"arabicnumber": "1408.09",
			"text": "شعبہ نے عمرو بن دینار سے ، انہوں نے ابوسلمہ سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے منع فرمایا کہ کسی عورت اور اس کی پھوپھی کو اور کسی عورت اور اس کی خالہ کو ( ایک مرد کے نکاح میں ) جمع کیا جائے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3445,
			"arabicnumber": "1408.10",
			"text": "ورقاء نے عمرو بن دینار سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3446,
			"arabicnumber": "1409.01",
			"text": "امام مالک نے نافع سے ، انہوں نے نُبَیہ بن وہب سے روایت کی کہ عمر بن عبیداللہ ( بن معمر جہنی ) نے ارادہ کیا کہ اپنے بیٹے طلحہ بن عمر کی شادی شیبہ بن جبیر ( بن عثمان جہنی ) کی بیٹی سے کر دیں ، تو انہوں نے ابان بن عثمان کی طرف پیغام بھیجا کہ وہ بھی آئیں ، وہ امیر الحج بھی تھے ۔ ابان نے کہا : میں نے حضرت عثمان بن عفان رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : محرم ( احرام باندھنے والا ) نہ ( خود ) نکاح کرے اور نہ اس کا نکاح کرایا جائے اور نہ وہ نکاح کا پیغام بھیجے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3447,
			"arabicnumber": "1409.02",
			"text": "ایوب نے نافع سے روایت کی ، کہا : مجھے نبیہ بن وہب نے حدیث بیان کی ، کہا : مجھے عمر بن عبیداللہ بن معمر نے بھیجا ۔ وہ شیبہ ( بن جبیر ) بن عثمان کی بیٹی کے لیے اپنے بیٹے کے نکاح کا پیغام بھیج رہے تھے تو مجھے انہوں نے ابان بن عثمان کی طرف بھیجا اور وہ امیر حج تھے ، انہوں نے کہا : کیا میں اسے ( عمر کو ) ایک بدو ( جیسا کام کرتے ) نہیں دیکھ رہا؟ جو شخص حالت احرام میں ہو وہ نہ نکاح کرتا ہے نہ ( کسی کا ) نکاح کراتا ہے ۔ ہمیں حضرت عثمان رضی اللہ عنہ نے اس بات کی خبر رسول اللہ صلی اللہ علیہ وسلم سے دی تھی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3448,
			"arabicnumber": "1409.03",
			"text": "مطر اور یعلیٰ بن حکیم نے نافع سے ، انہوں نے نبیہ بن وہب سے ، انہوں نے ابان بن عثمان سے ، انہوں نے عثمان بن عفان رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص حالت احرام میں ہو ، وہ نہ نکاح کرے نہ نکاح کرائے اور نہ نکاح کا پیغام بھیجے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3449,
			"arabicnumber": "1409.04",
			"text": "ایوب بن موسیٰ نے نبیہ بن وہب سے ، انہوں نے ابان بن عثمان سے ، انہوں نے حضرت عثمان رضی اللہ عنہ سے روایت کی ، وہ اس ( کی سند ) کو نبی صلی اللہ علیہ وسلم تک پہنچاتے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" محرم ( جس نے احرام باندھ رکھا ہو وہ ) نکاح کرے نہ نکاح کا پیغام بھیجے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3450,
			"arabicnumber": "1409.05",
			"text": "سعید بن ابوہلال نے مجھے نبیہ بن وہب سے حدیث بیان کی کہ عمر بن عبیداللہ بن معمر نے ارادہ کیا کہ حج ( کے ایام ) میں اپنے بیٹے طلحہ کا نکاح شیبہ بن جبیر کی بیٹی سے کریں ، ابان بن عثمان ان دنوں حج کے امیر تھے ۔ تو انہوں نے ابان کی طرف پیغام بھیجا کہ میں نے ارادہ کیا ہے کہ طلحہ بن عمر کا نکاح کر دوں اور میں چاہتا ہوں کہ آپ بھی اس میں شریک ہوں تو ابان نے انہیں جواب دیا : کیا مجھے تم ایک اکھڑ عراقی جیسے دکھائی نہیں دے رہے! بلاشبہ میں نے حضرت عثمان بن عفان رضی اللہ عنہ کو کہتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" محرم ( جو شخص حالت احرام میں ہو وہ ) کسی کا نکاح نہ کرائے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3451,
			"arabicnumber": "1410.01",
			"text": "ابوبکر بن ابی شیبہ ، ابن نمیر اور اسحاق حنظلی سب نے سفیان بن عیینہ سے حدیث بیان کی ، انہوں نے عمرو بن دینار سے ، انہوں نے ابوشعثاء سے روایت کی کہ حضرت ابن عباس رضی اللہ عنہ نے انہیں خبر دی کہ نبی اکرم صلی اللہ علیہ وسلم نے حضرت میمونہ رضی اللہ عنہا سے نکاح کیا تو آپ احرام میں تھے ۔ ابن نمیر نے یہ اضافہ کیا : میں نے یہ حدیث زہری کو سنائی تو انہوں نے کہا : مجھے یزید بن اصم نے خبر دی کہ آپ صلی اللہ علیہ وسلم نے ان ( حضرت میمونہ رضی اللہ عنہا ) سے اس حالت میں نکاح کیا جبکہ آپ احرام کے بغیر تھے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3452,
			"arabicnumber": "1410.02",
			"text": "داود بن عبدالرحمٰن نے ہمیں عمرو بن دینار سے خبر دی ، انہوں نے ابوشعثاء جابر بن زید سے ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے حضرت میمونہ رضی اللہ عنہا سے نکاح کیا جبکہ آپ حالتِ احرام میں تھے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3453,
			"arabicnumber": "1411",
			"text": "یزید بن اصم سے روایت ہے ، کہا : مجھے حضرت میمونہ بنت حارث رضی اللہ عنہا نے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے اس حالت میں نکاح کیا کہ آپ احرام کے بغیر تھے ۔ ( یزید بن اصم نے ) کہا : وہ میری بھی خالہ تھیں اور حضرت ابن عباس رضی اللہ عنہ کی بھی خالہ تھیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3454,
			"arabicnumber": "1412.01",
			"text": "لیث نے ہمیں نافع سے خبر دی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص کسی دوسرے کے سودے پر سودا نہ کرے اور نہ تم میں سے کوئی کسی ( اور ) کے پیغامِ نکاح پر نکاح کا پیغام بھیجے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3455,
			"arabicnumber": "1412.02",
			"text": "یحییٰ نے ہمیں عبیداللہ سے حدیث بیان کی ، کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ عنہ سے خبر دی ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی آدمی اپنے بھائی کے سودے پر سودا نہ کرے اور نہ اپنے بھائی کے پیغامِ نکاح پر پیغام بھیجے الا یہ کہ وہ اسے اجازت دے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3456,
			"arabicnumber": "1412.03",
			"text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ ، عَنْ عُبَيْدِ اللهِ ، بِهَذَا الْإِسْنَادِ",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3457,
			"arabicnumber": "1412.04",
			"text": "ایوب نے نافع سے اسی سند کے ساتھ یہی حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3458,
			"arabicnumber": "1413.01",
			"text": "عمرو ناقد ، زہیر بن حرب اور ابن ابی عمر نے حدیث بیان کی ۔ زہیر نے کہا : سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی ، انہوں نے سعید بن مسیب سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم نے اس بات سے منع فرمایا کہ کوئی شہری کسی دیہاتی کے لیے سودا بیچے یا لوگ ( خریداری کی نیت کے بغیر ) بڑھ چڑھ کر قیمت لگائیں یا کوئی آدمی اپنے بھائی کے پیغامِ نکاح پر نکاح کا پیغام بھیجے ، یا کوئی آدمی اپنے بھائی کی بیع پر بیع کرے ۔ اور نہ ہی کوئی عورت ( اس غرض سے ) اپنی بہن کی طلاق کا مطالبہ کرے کہ جو کچھ اس کے برتن میں ہے یا اس کی پلیٹ میں ہے وہ اسے ( اپنے لیے ) انڈیل لے ۔ عمرو نے اپنی حدیث میں یہ اضافہ کیا : اور نہ کوئی آدمی اپنے بھائی کے کیے جانے سودے پر سودا بازی کرے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3459,
			"arabicnumber": "1413.02",
			"text": "یونس نے مجھے ابن شہاب سے خبر دی ، کہا : مجھے سعید بن مسیب نے حدیث بیان کی کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم ( خریدنے کی نیت کے بغیر ) قیمت نہ بڑھاؤ اور نہ کوئی آدمی اپنے بھائی کی بیع پر بیع کرے اور نہ کوئی شہری کسی دیہاتی کے لیے بیع کرے اور نہ کوئی آدمی اپنے بھائی کے پیغامِ نکاح پر نکاح کا پیغام بھیجے اور نہ کوئی عورت دوسری عورت کی طلاق کا مطالبہ کرے تاکہ جو کچھ اس کے برتن میں ہے وہ اسے ( اپنے لیے ) انڈیل لے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3460,
			"arabicnumber": "1413.03",
			"text": "معمر نے زہری سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، البتہ معمر کی حدیث میں ہے : \" اور نہ کوئی آدمی اپنے بھائی کی بیع پر اضافہ ( کی پیش کش ) کرے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3461,
			"arabicnumber": "1413.04",
			"text": "علاء کے والد ( عبدالرحمٰن بن یعقوب ) نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی مسلمان کسی مسلمان کے سودے پر سودا نہ کرے ، اور نہ اس کے پیغامِ نکاح پر نکاح کا پیغام بھیجے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3462,
			"arabicnumber": "1413.05",
			"text": "احمد بن ابراہیم دورقی نے حدیث بیان کی ، کہا : ہم سے شعبہ نے علاء ( بن عبدالرحمٰن جہنی ) اور سہیل ( بن ابی صالح سمان مدنی ) سے ، انہوں نے اپنے اپنے والد سے ، ان دونوں نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے ( یہی حدیث ) روایت کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3464,
			"arabicnumber": "1414",
			"text": "عبدالرحمٰن بن شماسہ سے روایت ہے کہ انہوں نے منبر پر سے حضرت عقبہ بن عامر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مومن دوسرے مومن کا بھائی ہے ، کسی مومن کے لیے حلال نہیں کہ وہ اپنے بھائی کی بیع پر بیع کرے اور نہ اپنے بھائی کے پیغامِ نکاح پر نکاح کا پیغام بھیجے ، حتیٰ کہ وہ ( خود اسے ) چھوڑ دے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3465,
			"arabicnumber": "1415.01",
			"text": "امام مالک نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے شغار سے منع فرمایا ۔ اور شغار یہ ہے کہ آدمی اپنی بیٹی کا نکاح اس شرط پر کرے کہ وہ ( دوسرا ) بھی اپنی بیٹی کا نکاح اس سے کرے گا اور ان دونوں کے درمیان مہر نہ ہو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3466,
			"arabicnumber": "1415.02",
			"text": "عبیداللہ نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، البتہ عبیداللہ کی حدیث میں ہے ، انہوں نے کہا : میں نے نافع سے پوچھا : شغار کیا ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3467,
			"arabicnumber": "1415.03",
			"text": "عبدالرحمٰن سراج نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے شغار سے منع فرمایا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3468,
			"arabicnumber": "1415.04",
			"text": "ابن ‌عمر ‌رضی ‌اللہ ‌عنہما ‌نے ‌كہا ‌كہ ‌نبی ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌شغار ‌نہیں ‌ہے ‌اسلام ‌میں ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3469,
			"arabicnumber": "1416.01",
			"text": "ابن نمیر اور ابواسامہ نے ہمیں عبیداللہ سے حدیث بیان کی ، انہوں نے ابوزناد سے ، انہوں نے اعرج سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے شغار سے منع فرمایا ۔ ابن نمیر نے اضافہ کیا : شغار یہ ہے کہ ایک آدمی دوسرے سے کہے : تم اپنی بیٹی کا نکاح میرے ساتھ کر دو اور میں اپنی بیٹی کا نکاح تمہارے ساتھ کرتا ہوں ۔ اور تم اپنی بہن کا نکاح میرےساتھ کر دو میں اپنی بہن کا نکاح تمہارے ساتھ کرتا ہوں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3470,
			"arabicnumber": "1416.02",
			"text": "عبدہ نے عبیداللہ ( بن عمر ) سے اسی سند کے ساتھ یہ ( حدیث ) بیان کی ، اور انہوں نے ابن نمیر کا اضافہ ذکر نہیں کیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3471,
			"arabicnumber": "1417",
			"text": "ابن جریج نے ہمیں خبر دی ، کہا : مجھے ابوزبیر نے بتایا کہ انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے شغار سے منع فرمایا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3472,
			"arabicnumber": "1418",
			"text": "یحییٰ بن ایوب نے کہا : ہمیں ہُشَیم نے حدیث بیان کی ، ابن نمیر نے کہا : ہمیں وکیع نے حدیث بیان کی ، ابوبکر بن ابی شیبہ نے کہا : ہمیں ابوخالد احمر نے حدیث سنائی اور محمد بن مثنیٰ نے کہا : ہمیں یحییٰ قطان نے عبدالحمید بن جعفر سے ، انہوں نے یزید بن ابی حبیب سے ، انہوں نے مرثد بن عبداللہ یزنی سے ، انہوں نے حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سب سے زیادہ پوری کیے جانے کے لائق شرط وہ ہے جس سے تم نے شرمگاہوں کو حلال کیا ہے ۔ \" یہ ابوبکر اور ابن مثنیٰ کی حدیث کے الفاظ ہیں ، البتہ ابن مثنیٰ نے ( الشرط کی بجائے ) الشروط ( شرطیں وہ ہیں ) کہا ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3473,
			"arabicnumber": "1419.01",
			"text": "ہشام نے یحییٰ بن ابی کثیر سے حدیث بیان کی ، کہا : ہمیں ابوسلمہ نے حدیث بیان کی ، کہا : ہمیں حضرت ابوہریرہ رضی اللہ عنہ نے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس عورت کا خاوند نہ رہا ہو اس کا نکاح ( اس وقت تک ) نہ کیا جائے حتیٰ کہ اس سے پوچھ لیا جائے اور کنواری کا نکاح نہ کیا جائے حتیٰ کہ اس سے اجازت لی جائے ۔ \" صحابہ نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم! اس کی اجازت کیسے ہو گی؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( ایسے ) کہ وہ خاموش رہے ( انکار نہ کرے)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3474,
			"arabicnumber": "1419.02",
			"text": "اس ‌سند ‌سے ‌بھی ‌مذكورہ ‌بالا ‌حدیث ‌اسی ‌طرح ‌مروی ‌ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3475,
			"arabicnumber": "1420",
			"text": "حضرت عائشہ رضی اللہ عنہا فرماتی ہیں : میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس لڑکی کے بارے میں پوچھا جس کے گھر والے اس کا نکاح ( کرنے کا ارادہ ) کریں ، کیا اس سے اس کی مرضی معلوم کی جائے گی یا نہیں؟ تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" ہاں ، اس کی مرضی معلوم کی جائے گی ۔ \" حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے آپ سے عرض کی : وہ تو یقینا حیا محسوس کرے گی ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب وہ خاموش رہی تو یہی اس کی اجازت ہو گی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3476,
			"arabicnumber": "1421.01",
			"text": "سعید بن منصور اور قتیبہ بن سعید نے کہا : ہم سے امام مالک نے حدیث بیان کی ۔ یحییٰ بن یحییٰ نے کہا : میں نے امام مالک رحمۃ اللہ علیہ سے پوچھا : کیا آپ کو عبداللہ بن فضل نے نافع بن جبیر کے واسطے سے حضرت ابن عباس رضی اللہ عنہ سے یہ حدیث بیان کی ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" جس عورت کا شوہر نہ رہا ہو وہ اپنے ولی کی نسبت اپنے بارے میں زیادہ حق رکھتی ہے ، اور کنواری سے اس کے ( نکاح کے ) بارے میں اجازت لی جائے اور اس کا خاموش رہنا اس کی اجازت ہے \" ؟ تو امام مالک نے جواب دیا : ہاں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3477,
			"arabicnumber": "1421.02",
			"text": "قتیبہ بن سعید نے کہا : ہمیں سفیان نے زیاد بن سعد سے حدیث بیان کی ، انہوں نے عبداللہ بن فضل سے روایت کی ، انہوں نے نافع بن جبیر کو حضرت ابن عباس رضی اللہ عنہ سے خبر دیتے ہوئے سنا کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" جس نے شادی شدہ زندگی گزاری ہو وہ اپنے بارے میں اپنے والی کی نسبت زیادہ حق رکھتی ہے ، اور کنواری سے اس کی مرضی پوچھی جائے اور اس کی خاموشی اس کی اجازت ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3478,
			"arabicnumber": "1421.03",
			"text": "ابن ابی عمر نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے اسی سند کے ساتھ حدیث بیان کی اور کہا : \" جس عورت نے شادی شدہ زندگی گزاری ہو وہ اپنے بارے میں اپنے ولی کی نسبت زیادہ حق رکھتی ہے ، اور کنواری سے اس کا والد اس کے ( نکاح کے ) بارے میں اجازت لے گا ، اس کی خاموشی اس کی اجازت ہے ۔ \" اور کبھی انہوں نے کہا : \" اور اس کی خاموشی اس کا اقرار ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3479,
			"arabicnumber": "1422.01",
			"text": "ابو اسامہ نے ہشام سے ، انہوں نے اپنے والد ( عروہ ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے میرے ساتھ چھ برس کی عمر میں نکاح کیا اور جب میں نو برس کی تھی تو میرے ساتھ گھر بسایا ۔ کہا : ہم ( ہجرت کے بعد ) مدینہ آئے تو میں ایک مہینہ بخار میں مبتلا رہی ۔ ( اور میرے سر کے بال جھڑ گئے ، جب صحت یاب ہوئی تو ) پھر میرے بال ( اچھی طرح سے اگ آئے حتیٰ کہ ) گردن سے نیچے تک کی چٹیا بن گئی ۔ ( ان دنوں ایک روز میری والدہ ) ام رومان رضی اللہ عنہ میرے پاس آئیں جبکہ میں جھولے پر ( جھول رہی ) تھی اور میرے ساتھ میری سہیلیاں بھی تھیں ، انہوں نے مجھے زور سے آواز دی ، میں ان کے پاس گئی ، مجھے معلوم نہ تھا کہ وہ مجھ سے کیا چاہتی ہیں ۔ انہوں نے میرا ہاتھ تھاما اور مجھے دروازے پر لاکھڑا کیا ، ( سانس پھولنے کی وجہ سے ) میرے منہ سے ھہ ھہ کی آواز نکل رہی تھی ، حتیٰ کہ جب میری سانس ( چڑھنے کی کیفیت ) چلی گئی تو وہ مجھے ایک گھر کے اندر لے آئیں تو ( غیر متوقع طور پر ) وہاں انصار کی عورتیں ( جمع ) تھیں ، وہ کہنے لگیں ، خیر وبرکت پر اور اچھے نصیب پر ( آئی ہو ۔ ) تو انہوں ( میری والدہ ) نے مجھے ان کے سپرد کر دیا ۔ انہوں نے میرا سر دھویا ، اور مجھے بنایا سنوارا ، پھر میں اس کے سوا کسی بات پر نہ چونکی کہ اچانک چاشت کے وقت رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے ۔ اور ان عورتوں نے مجھے آپ صلی اللہ علیہ وسلم کے سپرد کر دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3480,
			"arabicnumber": "1422.02",
			"text": "ابو معاویہ اور عبدہ بن سلیمان نے ہشام سے انھوں نے اپنے والد ( عروہ ) سے انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت می انہوں نے کہا کہ رسۃل اللہ ﷺ نے میرے ساتھ نکاح کیا جب میں چھ سال کی تھی اور میرے ساتھ گھر بسایا جب میں نو سال کی تھی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3481,
			"arabicnumber": "1422.03",
			"text": "زہری نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم نے ان سے نکاح کیا جب وہ سات سال کی تھیں ، اور گھر بسایا جب وہ نو سال کی تھیں اور ان کے کھلونے ان کے ساتھ تھے ۔ آپ صلی اللہ علیہ وسلم انہیں چھوڑ کر فوت ہوئے جب وہ اٹھارہ سال کی تھیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3482,
			"arabicnumber": "1422.04",
			"text": "اسود نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ان سے نکاح کیا جبکہ وہ چھ برس کی تھیں اور ان کی رخصتی ہوئی جبکہ وہ نو برس کی تھیں اور آپ فوت ہوئے جبکہ وہ اٹھارہ برس کی تھیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 3483,
			"arabicnumber": "1423.01",
			"text": "وکیع نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے اسماعیل بن امیہ سے حدیث بیان کی ، انہوں نے عبداللہ بن عروہ سے ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے شوال میں میرے ساتھ نکاح کیا ، اور شوال ہی میں میرے ساتھ گھر بسایا ، تو رسول اللہ صلی اللہ علیہ وسلم کی بیویوں میں سے کون سی بیوی آپ کے ہاں مجھ سے زیادہ خوش نصیب تھی؟ ( عروہ نے ) کہا : حضرت عائشہ رضی اللہ عنہا پسند کرتی تھیں کہ اپنی ( رشتہ دار اور زیر کفالت ) عورتوں کی رخصتی شوال میں کریں ۔ ( جبکہ عربوں میں پرانا تصور یہ تھا کہ شوال میں نکاح اور رخصتی شادی کے لئے ٹھیک نہیں)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 3484,
			"arabicnumber": "1423.02",
			"text": "عبداللہ بن نمیر نے کہا : ہمیں سفیان نے اسی سند کے ساتھ ( یہ ) حدیث بیان کی اور انہوں نے حضرت عائشہ رضی اللہ عنہا کے عمل ( خاندان کی بچیوں کا شوال میں شادی کرانے ) کا تذکرہ نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 3485,
			"arabicnumber": "1424.01",
			"text": "سفیان نے ہمیں یزید بن کیسان سے حدیث بیان کی ، انہوں نے ابوحازم سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں نبی اکرم صلی اللہ علیہ وسلم کے پاس حاضر تھا ، آپ کے پاس ایک آدمی آیا اور بتایا کہ اس نے انصار کی ایک عورت سے نکاح ( طے ) کیا ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے اس سےفرمایا : \" کیا تم نے اسے دیکھا ہے؟ \" اس نے جواب دیا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ اور اسے دیکھ لو کیونکہ انصار کی آنکھوں میں کچھ ہے ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 3486,
			"arabicnumber": "1424.02",
			"text": "مروان بن معاویہ فزاری نے حدیث بیان کی ، کہا : ہمیں یزید بن کیسان نے ابوحازم سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں ایک آدمی حاضر ہوا اور کہا : میں نے انصار کی ایک عورت سے نکاح کیا ہے ۔ نبی اکرم صلی اللہ علیہ وسلم نے اس سے پوچھا : \" کیا تم نے اسے دیکھا ہے؟ کیونکہ انصار کی آنکھوں میں کچھ ہے ۔ \" اس نے جواب دیا : میں نے اسے دیکھا ہے ۔ آپ نے پوچھا : \" کتنے مہر پر تم نے اِس سے نکاح کیا ہے؟ \" اس نے جواب دیا : چار اوقیہ پر ۔ تو نبی اکرم صلی اللہ علیہ وسلم نے اس سے فرمایا : \" چار اوقیہ چاندی پر؟ گویا تم اس پہاڑ کے پہلو سے چاندی تراشتے ہو! تمہیں دینے کے لیے ہمارے پاس کچھ موجود نہیں ، البتہ جلد ہی ہم تمہیں ایک لشکر میں بھیج دیں گے تمہیں اس سے ( غنیمت کا حصہ ) مل جائے گا ۔ \" کہا : اس کے بعد آپ صلی اللہ علیہ وسلم نے بنو عبس کی جانب ایک لشکر روانہ کیا ( تو ) اس آدمی کو بھی اس میں بھیج دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 3487,
			"arabicnumber": "1425.01",
			"text": "یعقوب بن عبدالرحمٰن القاری اور عبدالعزیز بن ابی حازم نے ابوحازم سے ، انہوں نے حضرت سہل بن سعد ساعدی رضی اللہ عنہ سے روایت کی ، کہا : ایک خاتون رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ، اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم! میں اپنی ذات آپ کو ہبہ کرنے کے لیے حاضر ہوئی ہوں ، آپ صلی اللہ علیہ وسلم نے اس کی طرف نظر کی ، آپ اپنی نظر نیچے سے اوپر اور اوپر سے نیچے تک لے گئے ۔ پھررسول اللہ صلی اللہ علیہ وسلم نے اپنا سر مبارک جھکا لیا ۔ جب عورت نے دیکھا کہ آپ نے اس کے بارے میں کوئی فیصلہ نہیں کیا تو وہ بیٹھ گئی ۔ اس پر آپ کے صحابہ میں سے ایک آدمی کھڑا ہوا اور عرض کی : اے اللہ کے رسول ( صلی اللہ علیہ وسلم ) ! اگر آپ کو اس ( کے ساتھ شادی ) کی ضرورت نہیں تو اس کی شادی میرے ساتھ کر دیں ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : کیا تمہارے پاس ( حق مہر میں دینے کے لیے ) کوئی چیز ہے؟ \" اس نے جواب دیا : اللہ کی قسم! اللہ کے رسول! ( کچھ ) نہیں ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اپنے گھر والوں کے پاس جاؤ ، دیکھو تمہیں کچھ ملتا ہے؟ \" وہ گیا پھر واپس آیا اور عرض کی : نہیں ، اللہ کی قسم! مجھے کچھ نہیں ملا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دیکھو! چاہے لوہے کی انگوٹھی ہو ۔ \" وہ گیا پھر واپس آیا ، اور عرض کی ، نہیں ، اللہ کی قسم! اللہ کے رسول! لوہے کی انگوٹھی بھی نہیں ہے ، البتہ میری یہ تہبند ہے ۔ سہل نے کہا : اس کے پاس ( کندھے کی ) چادر بھی نہیں تھی ۔ اس میں سے آدھی ( بطور مہر ) اِس کے لیے ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ تمہارے تہبند کا کیا کرے گی ، اگر تم اسے پہنو گے تو اس ( کے جسم ) پر اس میں سے کچھ نہیں ہو گا اور اگر وہ پہنے گی تو تم پر اس میں سے کچھ نہیں ہو گا ۔ \" اس پر وہ آدمی بیٹھ گیا ۔ اسے بیٹھے ہوئے لمبا وقت ہو گیا تو وہ کھڑا ہو گیا ( اور چل دیا ۔ ) رسول اللہ صلی اللہ علیہ وسلم نے اسے پیٹھ پھیر کر جاتے ہوئے دیکھ لیا ۔ آپ نے اس کے بارے میں حکم دیا تو اسے آپ صلی اللہ علیہ وسلم کی خاطر بلا لیا گیا ، جب وہ آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارے پاس قرآن کتنا ہے؟ \" ( تمہیں کتنا قرآن یاد ہے؟ ) اس نے عرض کی : میرے پاس فلاں سورت اور فلاں سورت ہے ۔ اس نے وہ سورتیں شمار کیں ۔ تو آپ نے پوچھا : \" تم انہیں زبانی پڑھتے ہو؟ \" اس نے عرض کی ، جی ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ ، تمہیں جتنا قرآن یاد ہے اس کے عوض ( نکاح کے لیے ) تمہیں اس کا مالک ( خاوند ) بنا دیا گیا ہے ۔ \" یہ ابن ابوحازم کی حدیث ہے ، یعقوب کی حدیث بھی الفاظ میں اسی کے قریب ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 3488,
			"arabicnumber": "1425.02",
			"text": "حماد بن زید ، سفیان بن عیینہ ، دراوردی اور زائدہ سب نے ابوحازم سے ، انہوں نے سہل بن سعد رضی اللہ عنہ سے یہی حدیث بیان کی ، ان میں سے کچھ راوی دوسروں پر اضافہ کرتے ہیں ۔ مگر زائدہ کی حدیث میں ہے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ ، میں نے اس سے تمہاری شادی کر دی ہے ، اس لیے ( اب ) تم اسے قرآن کی تعلیم دو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 3489,
			"arabicnumber": "1426",
			"text": "ابوسلمہ بن عبدالرحمٰن سے روایت ہے ، انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کی اہلیہ ، ( ام المومنین ) حضرت عائشہ رضی اللہ عنہا سے پوچھا : رسول اللہ صلی اللہ علیہ وسلم ( کی بیویوں ) کا مہر کتنا ( ہوتا ) تھا؟ انہوں نے جواب دیا : اپنی بیویوں کے لیے آپ کا مہر بارہ اوقیہ اور ایک نَش تھا ۔ ( پھر ) انہوں نے پوچھا : جانتے ہو نش کیا ہے؟ میں نے عرض کی : نہیں ، انہوں نے کہا : آدھا اوقیہ ، یہ کل 500 درہم بنتے ہیں اور یہی اپنی بیویوں کے لیے رسول اللہ صلی اللہ علیہ وسلم کا مہر تھا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 3490,
			"arabicnumber": "1427.01",
			"text": "ثابت نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم نے حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ ( کے لباس ) پر زرد ( زعفران کی خوشبو کا ) نشان دیکھا تو فرمایا : \" یہ کیا ہے؟ \" انہوں نے جواب دیا : اللہ کے رسول ( صلی اللہ علیہ وسلم ) ! میں نے سونے کی ایک گٹھلی کے وزن پر ایک عورت سےشادی کی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تمہیں برکت دے ۔ ولیمہ کرو ، خواہ ایک بکری سے کرو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 3491,
			"arabicnumber": "1427.02",
			"text": "ابو عوانہ نے ہمیں قتادہ سے حدیث بیان کی ، انہوں نے انس بن مالک رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے سونے کی گھٹلی کے وزن کے برابر سونے کے عوض نکاح کیا تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" ولیمہ کرو خواہ ایک بکری سے کرو ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 3492,
			"arabicnumber": "1427.03",
			"text": "وکیع نے ہمیں خبر دی ، کہا : ہمیں شعبہ نے قتادہ اور حُمید سے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی کہ حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے سونے کی ایک گٹھلی کے وزن کے برابر سونے کے عوض نکاح کیا اور یہ کہ نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا : \" ولیمہ کرو خواہ ایک بکری سے کرو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 3493,
			"arabicnumber": "1427.04",
			"text": "ابوداود ، وہب بن جریر اور شبابہ سب نے شعبہ سے حدیث بیان کی ، انہوں نے حمید سے اسی سند کے ساتھ روایت کی ، البتہ وہب کی حدیث میں یوں ہے : \" انہوں نے کہا : حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا : میں نے ایک عورت سے شادی کی ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 3494,
			"arabicnumber": "1427.05",
			"text": "اسحاق بن ابراہیم اور محمد بن قدامہ نے کہا : ہمیں نضر بن شُمَیل نے خبر دی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : ہمیں عبدالعزیز بن صُہَیب نے حدیث بیان کی ، کہا : میں نے حضرت انس رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھے دیکھا جبکہ مجھ پر شادی کی بشاشت ( خوشی ) نمایاں تھی ، میں نے عرض کی : میں نے انصار کی ایک عورت سے شادی کی ہے ، آپ نے پوچھا : \" تم نے اسے کتنا مہر دیا ہے؟ \" میں نے عرض کی : ایک گٹھلی ۔ اور اسحاق کی حدیث میں ہے : سونے کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 3495,
			"arabicnumber": "1427.06",
			"text": "ابوداود نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے ابوحمزہ سے حدیث بیان کی ۔ شعبہ نے کہا : ان کا نام عبدالرحمٰن بن ابی عبداللہ ( کیسان ) ہے ۔ انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ حضرت عبدالرحمٰن بن عوف رضی اللہ عنہ نے سونے کی گٹھلی کے وزن کے برابر ( سونے ) کے عوض ایک عورت سے شادی کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 3496,
			"arabicnumber": "1427.07",
			"text": "وہب نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ یہ حدیث بیان کی ، مگر انہوں نے کہا : حضرت عبدالرحم ن بن عوف رضی اللہ عنہ کے بیٹوں میں سے ایک نے کہا : سونے کی ( ایک گٹھلی)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 3497,
			"arabicnumber": "1365.03",
			"text": "حضرت انسؓ سے روایت ہے کہ رسول اﷲ ﷺ نے جہاد کیا خیبر پر او رہم لوگوں نے وہاں نماز پڑھی صبح کی بہت اندھریے میں اور سوار ہوئے نبی ﷺ او رسوار ہوئے ابوطلحہٰ ؓ اور میں ردیف تھا ابوطلحہ کا اور روانہ ہوئے نبی ﷺ گلیوں میں خیبر کی اور میرا زانو نبیﷺ کے ران سے لگ لگ جاتا تھا اور تہبند رسول اﷲ ﷺ کی آپ کی ران سے کھسک گئی تھی او رمیں دیکھتا سفیدی آپ کی ران کی پھر جب شہر کے اندر گئے آپ نے فرمایا اﷲ اکبر خراب ہوا خیبر ہم جب اترتے ہیں کسی قوم کے انگن میں تو برا ہوتا ہے حال ڈرائے گئے لوگوں کا ۔ اس آیت کو آپ نے تین بار پڑھا یعنی انا اذا نزلنا بساحۃ قوم سے اخیر تک اور اتنے میں وہاں کے لوگ اپنے اپنے کاموں میں نکلے اور انہوں نے کہا کہ محمد ﷺ آچکے ۔ اور عبدالعزیز نے کہا کہ ہمارے لوگوں نے یہ بھی کہا کہ لشکر بھی آگیا ۔ کہا راوی نے کہ غرض ہم نے لے لیا خیبر کو جبراً قہراً اور قیدی لوگ جمع کیے گئے اور دحیہ آئے اور عرص کی کہ یا رسول اﷲؐ! ایک لونڈی مجھے عنایت کیجیے ان قیدیوںمیںسے ۔ آپ نے فرمایا کہ جاؤ ایک لونڈی لے لو ۔ انہوں نے صفیہ بنت حیی کو لے لیا اور ایک شخص نے آکے کہا کہ اے نبی اﷲ تعالیٰ کے آپ نے دحیہ کو حیی کی بیٹی دیدی جو سردار ہے بنی قریظہ اور بنی نضیر کا اور وہ کسی کے لائق نہیں سوا آپ کے تو فرمایا کہ بلاؤ ان کو مع اس لونڈی کے ۔ کہا راوی نے کہ پھر وہ اسے لے کر آئے پھر جب آپ نے اس کو دیکھا تو دحیہ سے فرمایا کہ تم کوئی اور لونڈی لے لو قیدیوں میں سے اس کے سوا ۔ کہا راوی نے کہ پھر آپ نے آزاد کیا صفیہؓ کو اور ان سے نکاح کرلیا سو ثابت نے ان سے کہا کہ اے ابوحمزہ! ان کا مہر کیا باندھا انہوں نے؟ کہا یہی مرہ تھا کہ ان کو آزاد کردیا اور نکاح کرلیا یہاں تک کہ پھر جب وہ را میں تھے تو سنگار کردیا ان کا ام سلیمؓ نے اور پیش کردیا آپ پر ان کو رات میں اور صبح کو رسول اﷲﷺ نوشہ بنے ہوئے تھے ۔ پھر فرمایا اپ نے جس کے پاس جو کچھ ہو ( یعنی کھانے کی قسم سے ) وہ لائے او رایک دستر خوان چمڑے کا بچھا دیا اور کوئی اقط لانے لگا ( دہی سکھا کر بناتے ہیں ) اور کوئی کھجور او رکوئی گھی ان سب کو توڑ تاڑ کر خوب ملایا اور یہ ولیمہ ہوا رسول اﷲ ﷺ کا ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 3498,
			"arabicnumber": "1365.04",
			"text": "حماد ، یعنی ابن زید نے ثابت اور عبدالعزیز بن صہیب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ حماد نے ثابت اور شعیب بن حَبحَاب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ اسی طرح ابوعوانہ نے قتادہ اور عبدالعزیز سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ ابوعوانہ ( ہی ) نے ابوعثمان سے ، انہوں نے حضرت انس رضی اللہ عنہ سے ۔ معاذ بن ہشام نے اپنے والد سے ، انہوں نے شعیب بن حبحاب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور اسی طرح یونس بن عبید نے شعیب بن حبحاب سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور ان سب نے ( کہا : انہوں نے ) نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے حضرت صفیہ رضی اللہ عنہا کو آزاد کیا اور ان کو آزادی کو ان کا مہر مقرر کیا ۔ معاذ کی اپنے والد ( ہشام ) سے روایت کردہ حدیث میں ہے : آپ صلی اللہ علیہ وسلم نے صفیہ رضی اللہ عنہا سے نکاح فرمایا اور ان کی آزادی ، ان کو مہر میں دی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 3500,
			"arabicnumber": "1365.05",
			"text": "حماد بن سلمہ نے ہمیں حدیث بیان کی ، کہا : ثابت نے ہمیں حضرت انس رضی اللہ عنہ سے حدیث سنائی ، انہوں نے کہا : میں خیبر کے دن ابوطلحہ رضی اللہ عنہ کے ساتھ سوار تھا ، اور میرا پاؤں رسول اللہ صلی اللہ علیہ وسلم کے قدم مبارک کو چھو رہا تھا ۔ کہا : ہم ( صفحہ نمبر 67 پی ڈی ایف فائل میں نہیں ہے ) رفتار تیز کر لی ، کہا : اونٹنی عضباء ٹھوکر کھا کر گر گئی اور رسول اللہ صلی اللہ علیہ وسلم ( پالان سے ) نکل گئے اور وہ ( سیدہ صفیہ رضی اللہ عنہا ) بھی نکل کر گر گئیں ، آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور ان کو پردے میں کیا ، عورتیں اوپر سے جھانک رہی تھیں ، کہنے لگیں : اللہ یہودی عورت کو دور کرے ۔ ( ثابت نے ) کہا : میں نے کہا : اے ابوحمزہ! کیا رسول اللہ صلی اللہ علیہ وسلم گر پڑے تھے؟ انہوں نے جواب دیا : ہاں اللہ کی قسم! آپ گر پڑے تھے ۔ حضرت انس رضی اللہ عنہ نے کہا : اور میں نے حضرت زینب رضی اللہ عنہا کے ولیمے میں بھی شرکت کی تھی ۔ آپ نے لوگوں کو پیٹ بھر کر روٹی اور گوشت کھلایا تھا ، آپ مجھے بھتیجے تھے میں لوگوں کو ( کھانے کے لیے ) بلاتا تھا ۔ جب آپ فارغ ہوئے ، تو کھڑے ہو گئے اور میں نے بھی آپ کی پیروی کی ، پیچھے دو آدمی رہ گئے ، باہمی گفتگو نے ان دونوں کو ساتھ لگائے رکھا ۔ وہ دونوں نہ نکلے ۔ آپ نے ( چلتے ہوئے ) اپنی ازواج مطہرات کے پاس جانا شروع کیا ۔ آپ ان میں سے ہر ایک کو سلام کرتے ، ( فرماتے ) \"\" تم پر سلامتی ہو ، گھر والو! آپ کیسے ہو؟ \"\" وہ جواب دیتے : اللہ کے رسول! خیریت سے ہیں ۔ آپ نے اپنے اہل ( نئی اہلیہ ) کو کیسا پایا؟ رسول اللہ صلی اللہ علیہ وسلم جواب دیتے : \"\" خیر و ( عافیت ) کے ساتھ ۔ \"\" جب آپ صلی اللہ علیہ وسلم فارغ ہوئے تو واپس ہوئے ، میں بھی آپ کے ساتھ لوٹ آیا ، جب آاپ دروازے پر پہنچے تو آپ نے اُن دو آدمیوں کو دیکھا ( کہ ) باہمی گفتگو نے ان دونوں کو ساتھ لگا رکھا ہے ، جب ان دونوں نے آپ کو دیکھا کہ آپ واپس آ رہے ہیں تو وہ دونوں اٹھے اور چلے گئے ۔ اللہ کی قسم! ( اب ) مجھے معلوم نہیں کہ میں نے آپ کو بتایا یا آپ پر وحی نازل کی گئی کہ وہ دونوں چلے گئے ہیں ۔ آپ واپس آئے اور میں بھی آپ کے ساتھ واپس آیا ۔ پھر آپ نے اپنا پاؤں دروازے کی چوکھٹ پر رکھا تو میرے اور اپنے درمیان پردہ لٹکا دیا ۔ اور اللہ تعالیٰ نے یہ آیت نازل فرمائی : \"\" تم لوگ نبی صلی اللہ علیہ وسلم کے گھروں میں مت داخل ہو اِلا یہ کہ تمہیں ( اس کی ) اجازت دی جائے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 3501,
			"arabicnumber": "1365.06",
			"text": "سلیمان بن مغیرہ نے ہمیں ثابت سے حدیث بیان کی کہا : حضرت انس رضی اللہ عنہ نے ہمیں حدیث بیان کی ، انہوں نے کہا : حضرت صفیہ حضرت دحیہ رضی اللہ عنہا کے حصے میں آ گئیں ، ( آپ صلی اللہ علیہ وسلم نے دحیہ رضی اللہ عنہا کو اپنے حصے کی ایک کنیز لینے کی اجازت دے کر غیر رسمی طور پر تقسیم کا آغاز فرما دیا تھا ۔ ) لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس ان کی تعریف کرنے لگے ، وہ کہہ رہے تھے : ہم نے قیدیوں میں ان جیسی عورت نہیں دیکھی ۔ تو آپ نے دحیہ رضی اللہ عنہ کی طرف پیغام بھیجا ، اور ان کے بدلے میں جو انہوں نے چاہا ، آپ صلی اللہ علیہ وسلم نے دیا ، پھر آپ نے اسے میری والدہ کے سپرد کیا اور فرمایا : \" اسے بنا سنوار دو ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم خیبر سے نکلے حتیٰ کہ جب آپ نے اسے پشت کی طرف کر لیا ، ( خیبر پیچھے رہ گیا ) تو آپ نے پڑاؤ ڈالا ، پھر ان ( حضرت صفیہ رضی اللہ عنہا ) کے لیے خیمہ لگوایا ، جب صبح ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کے پاس زادِ راہ سے زائد کچھ ہو وہ اسے ہمارے پاس لے آئے ۔ \" کہا : اس پر کوئی آدمی زائد کھجوریں لے کر آنے لگا اور ( کوئی ) زائد ستو ، حتیٰ کہ لوگوں نے ان چیزوں سے ایک ڈھیر مخلوط کھانے ( حَیس ) کا بنا لیا ، پھر وہ اس حیس میں سے تناول کرنےلگے اور بارش کے پانی کے حوضوں سے جو ان کے قریب تھے پانی پینے لگے ۔ کہا : حضرت انس رضی اللہ عنہ نے کہا : یہ تھا ان ( صفیہ رضی اللہ عنہا ) کے لیے رسول اللہ صلی اللہ علیہ وسلم کا ولیمہ ۔ کہا : اس کے بعد ہم چل پڑے ، جب ہم نے مدینہ کی دیواریں دیکھیں تو ہم شدتِ شوق سے اس کی طرف لپک پڑے ، ہم نے اپنی ساریاں اٹھا دیں ( تیز کر دیں ) اور رسول اللہ صلی اللہ علیہ وسلم نے بھی اپنی سواری اٹھا دی ۔ کہا : صفیہ رضی اللہ عنہا آپ کے پیچھے تھیں ، رسول اللہ صلی اللہ علیہ وسلم نے انہیں اپنے ساتھ سوار کر لیا تھا ، کہا : ( اچانک ) رسول اللہ کی سواری کو ٹھوکر لگی تو آپ زمین پر آ رہے اور وہ ( حضرت صفیہ رضی اللہ عنہا ) بھی زمین پر آ رہیں ، کہا : لوگوں میں سے کوئی بھی نہ آپ صلی اللہ علیہ وسلم کی طرف دیکھ رہا تھا اور نہ ان کی طرف ، کہا : حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوئے اور حضرت صفیہ رضی اللہ عنہا کے آگے پردہ کیا ، پھر ہم آپ کی خدمت میں حاضر ہوئے ، تو آپ نے فرمایا : \" ہمیں کوئی نقصان نہیں پہنچا ۔ \" پھر ہم مدینہ کے اندر داخل ہوئے تو آپ کی ازواج کی باندیاں باہر نکل آئیں ، وہ ایک دوسری کو وہ ( صفیہ رضی اللہ عنہا ) دکھا رہی تھیں ، اور ان کے گرنے پر دل ہی دل میں خوش ہو رہی تھیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 3502,
			"arabicnumber": "1428.01",
			"text": "محمد بن حاتم بن میمون نے مجھے حدیث بیان کی ، کہا : ہمیں بہز نے حدیث سنائی ، نیز محمد بن رافع نے مجھے حدیث بیان کی ، کہا : ہمیں ابونضر ہاشم بن قاسم نے حدیث سنائی ، ان دونوں ( بہز اور ابونضر ) نے کہا : ہمیں سلیمان بن مغیرہ نے ثابت سے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ۔ یہ بہز کی حدیث ہے ۔ کہا : جب حضرت زینب رضی اللہ عنہا کی عدت گزری تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت زید رضی اللہ عنہ سے فرمایا : \"\" اِن ( زینب رضی اللہ عنہا ) کے سامنے ان کی میرے ساتھ شادی کا ذکر کرو ۔ \"\" کہا : تو حضرت زید رضی اللہ عنہ چلے حتیٰ کہ ان کے پاس پہنچے تو وہ اپنے آٹے میں خمیر ملا رہی تھیں ، کہا : جب میں نے ان کو دیکھا تو میرے دل میں ان کی عظمت بیٹھ گئی حتیٰ کہ میں ان کی طرف نظر بھی نہ اٹھا سکتا تھا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ان ( کے ساتھ شادی ) کا ذکر کیا تھا ، میں نے ان کی طرف اپنی پیٹھ کی اور ایڑیوں کے بل مڑا اور کہا : زینب! رسول اللہ صلی اللہ علیہ وسلم نے تمہارا ذکر کرتے ہوئے پیغام بھیجا ہے ۔ انہوں نے کہا : میں کچھ کرنے والی نہیں یہاں تک کہ اپنے رب سے مشورہ ( استخارہ ) کر لوں ، اور وہ اٹھ کر اپنی نماز کی جگہ کی طرف چلی گئیں اور ( ادھر ) قرآن نازل ہو گیا ، رسول اللہ صلی اللہ علیہ وسلم بغیر اجازت لیے ان کے پاس تشریف لے آئے ۔ ( سلیمان بن مغیرہ نے ) کہا : ( انس رضی اللہ عنہ نے ) کہا : میں نے اپنے آپ سمیت سب لوگوں کو دیکھا کہ جب دن کا اجالا پھیل گیا تو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں روٹی اور گوشت کھلایا ۔ اس کے بعد ( اکثر ) لوگ نکل گئے ، چند باقی رہ گئے وہ کھانے کے بعد ( آپ کے ) گھر میں ہی باتیں کرنے لگے ۔ رسول اللہ صلی اللہ علیہ وسلم ( وہاں سے ) نکلے ، میں بھی آپ کے پیچھے ہو لیا ، آپ یکے بعد دیگرے اپنی ازواج کے حجروں کی طرف جا کر انہیں سلام کہنے لگے ۔ وہ ( جواب دے کر ) کہتیں : اللہ کے رسول! آپ صلی اللہ علیہ وسلم نے اپنی ( نئی ) اہلیہ کو کیسا پایا؟ ( انس رضی اللہ عنہ نے ) کہا : میں نہیں جانتا میں نے آپ کو بتایا کہ لوگ جا چکے ہیں یا آپ نے مجھے بتایا ۔ پھر آپ چل پڑے حتیٰ کہ گھر میں داخل ہو گئے ۔ میں بھی آپ کے ساتھ داخل ہونے لگا تو آپ نے میرے اور اپنے درمیان پردہ لٹکا دیا اور ( اس وقت ) حجاب ( کا حکم ) نازل ہوا ، کہا : اور لوگوں کو ( اس مناسبت سے ) جو نصیحت کی جانی تھی کر دی گئی ۔ ابن رافع نے اپنی حدیث میں یہ اضافہ کیا : \"\" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو مگر یہ کہ تمہیں کھانے کے لیے ( آنے کی ) اجازت دی جائے ، اس حال میں ( آؤ ) کہ اس کے پکنے کا انتظار نہ کر رہے ہو ( کھانے کے وقت آؤ پہلے نہ آؤ ) \"\" سے لے کر اس فرمان تک : \"\" اور اللہ کا حق سے شرم نہیں کرتا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 3503,
			"arabicnumber": "1428.02",
			"text": "ابوربیع زہرانی ، ابو کامل فُضَیل بن حسین اور قتیبہ بن سعید نے ہمیں حدیث بیان کی ، کہا : ہمیں حماد نے ، وہ ( جو ) زید کے بیٹے ہیں ، ثابت نے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ۔ ابو کامل کی روایت میں ہے : میں نے حضرت انس رضی اللہ عنہ سے سنا ۔ انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھا کہ آپ نے کسی بیوی کا ۔ ۔ ابوکامل نے کہا : اپنی بیویوں میں سے کسی بیوی کی کسی چیز ( خوشی ) پر ۔ اس جیسا ولیمہ کیا ہو جیسا حضرت زینب رضی اللہ عنہا ( کے ساتھ نکاح ) پر کیا ۔ آپ صلی اللہ علیہ وسلم نے ( اس موقع پر ) بکری ذبح کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 3504,
			"arabicnumber": "1428.03",
			"text": "عبدالعزیز بن صہیب سے روایت ہے ، انہوں نے کہا : میں نے حضرت انس رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں میں سے کسی بیوی کا اس سے بڑھ کر یااس سے بہتر ولیمہ نہیں کیا جیسا ولیمہ حضرت زینب رضی اللہ عنہا کا کیا ۔ ثابت بنانی نے پوچھا : آپ نے کس چیز سے ولیمہ کیا تھا؟ انہوں نے جواب دیا : آپ نے انہیں روٹی اور گوشت کھلایا حتیٰ کہ انہوں نے ( سیر ہو کر کھانا ) چھوڑ دیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 3505,
			"arabicnumber": "1428.04",
			"text": "یحییٰ بن حبیب حارثی ، عاصم بن نضر تیمی اور محمد بن عبدالاعلیٰ نے ہمیں حدیث بیان کی ، سب نے معتمر سے روایت کی ۔ لفظ ( یحییٰ ) بن حبیب کے ہیں ۔ کہا : ہم سے معتمر بن سلیمان نے حدیث بیان کی ، انہوں نے کہا : میں نے اپنے والد سے سنا ، انہوں نے کہا : ہمیں ابومجلز نے سیدنا انس بن مالک رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا : جب نبی صلی اللہ علیہ وسلم نے زینب بنت حجش رضی اللہ عنہا سے نکاح کیا تو آپ نے لوگوں کو ( کھانے کی ) دعوت دی ، انہوں نے کھانا کھایا ، پھر بیٹھ کر باتیں کرنے لگے ۔ کہا : آپ نے ایسا انداز اختیار فرمایا گویا کہ کھڑے ہونے لگے ہوں اس پر بھی وہ نہ اٹھے ، جب آپ نے یہ صورت حال دیکھی تو آپ کھڑے ہو گئے ، جب آپ کھڑے ہوئے تو لوگوں میں سے بھی جو کھڑے ہوئے ، وہ ہو گئے ۔ عاصم اور ابن عبدالاعلیٰ نے اپنی حدیث میں اضافہ کیا : کہا \"\" تین آدمی بیٹھے رہے ، نبی صلی اللہ علیہ وسلم ( حجرے میں ) داخل ہونے کے لیے تشریف لے آئے ، تو ( اس وقت بھی ) وہ لوگ بیٹھے ہوئے تھے ، پھر ( کچھ دیر بعد ) وہ اٹھے اور چلے گئے ۔ ( انس رضی اللہ عنہ نے ) کہا : میں نے آ کر نبی صلی اللہ علیہ وسلم کو خبر دی کہ وہ جا چکے ہیں ۔ آپ تشریف لائے اور اندر داخل ہوئے ، میں بھی داخل ہونے لگا تو آپ نے میرے اور اپنے درمیان پردہ لٹکا دیا ۔ کہا : اور ( اس موقع پر ) اللہ عزوجل نے ( یہ آیت ) نازل فرمائی : \"\" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو ، الا یہ کہ تمہیں کھانے کے لیے اجازت دی جائے ، ایسے ( وقت میں ) آؤ کہ ( آ کر ) اس کے پکنے کا انتظار کرنے والے نہ ہو ( کھانا رکھ دیا جائے تو آؤ ) \"\" اس فرمان تک : \"\" بلاشبہ یہ بات اللہ کے نزدیک بہت بڑی تھی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 3506,
			"arabicnumber": "1428.05",
			"text": "ابن شہاب نے کہا : حضرت انس بن مالک رضی اللہ عنہ نے فرمایا : پردے ( کے احکام ) کو سب لوگوں سے زیادہ جاننے والا میں ہوں ۔ حضرت ابی بن کعب رضی اللہ عنہ بھی اس کے بارے میں مجھ سے پوچھا کرتے تھے ۔ انس رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے حضرت زینب بنت حجش رضی اللہ عنہا کے دلہا کی حیثیت سے صبح کی ، آپ نے ( اسی رات ) مدینہ میں ان سے شادی کی تھی ، دن چڑھنے کے بعد آپ نے لوگوں کو کھانے کے لیے بلایا ، رسول اللہ صلی اللہ علیہ وسلم تشریف فرما ہوئے تو کچھ افراد لوگوں کے چلے جانے کے بعد بھی آپ کے ساتھ بیٹھے رہے ، یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہو گئے ۔ آپ چلے تو میں بھی آپ کے ساتھ چل پڑا حتیٰ کہ آپ ( سب حجروں سے ہوتے ہوئے ) حجرہ عائشہ رضی اللہ عنہا کے دروازے پر پہنچے ۔ پھر آپ نے سوچا کہ وہ لوگ جا چکے ہوں گے ، آپ واپس ہوئے ، میں بھی آپ کے ساتھ واپس آیا ، تو تب بھی وہ اپنی جگہوں پر بیٹھے ہوئے تھے ۔ آپ لوٹ گئے اور میں بھی دوبارہ لوٹ گیا ، حتیٰ کہ آپ حضرت عائشہ رضی اللہ عنہا کے حجرے تک پہنچے تو پھر سے واپس آئے ، میں بھی آپ کے ساتھ واپس آیا ، تو دیکھا کہ وہ لوگ اٹھ ( کر جا ) چکے تھے ، اس کے بعد آپ نے میرے اور اپنے درمیان پردہ لٹکا دیا ، اور ( اس وقت ) پردے کی آیت نازل کی گئی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 3507,
			"arabicnumber": "1428.06",
			"text": "جعفر بن سلیمان نے ہمیں ابوعثمان جعد سے حدیث بیان کی ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے شادی کی اور اپنی اہلیہ کے پاس تشریف لے گئے ۔ میری والدہ ام سُلَیم رضی اللہ عنہا نے حَیس تیار کیا ، اسے ایک پیالہ نما بڑے برتن میں ڈالا ، اور کہا : انس! یہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے جاؤ اور عرض کرو : یہ میری والدہ نے آپ کی خدمت میں بھیجا ہے ، اور وہ آپ کو سلام عرض کرتی ہیں اور کہتی ہیں : اللہ کے رسول! یہ ہماری طرف سے آپ کے لیے تھوڑی سی چیز ہے ۔ کہا : میں اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : میری والدہ آپ کو سلام پیش کرتی ہیں اور کہتی ہیں : اللہ کے رسول! یہ آپ کے لیے ہماری طرف سے تھوڑی سی چیز ہے ۔ آپ نے فرمایا : \"\" اسے رکھ دو \"\" ( آپ نے اسے بھی ولیمے کے کھانے کے ساتھ شامل کر لیا ) پھر فرمایا : \"\" جاؤ ، فلاں ، فلاں اور فلاں اور جو لوگ تمہیں ملیں انہیں بلا لاؤ ۔ \"\" آپ نے چند آدمیوں کے نام لیے ۔ کہا : میں ان لوگوں کو جن کے آپ نے نام لیے اور وہ جو مجھے ملے ، ان کو لے آیا ۔ کہا : میں نے انس رضی اللہ عنہ سے پوچھا : وہ ( سب ) تعداد میں کتنے تھے؟ انہوں نے جواب دیا : تین سو کے لگ بھگ ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \"\" انس! برتن لے اؤ \"\" کہا : لوگ اندر داخل ہوئے حتیٰ کہ صفہ ( چبوترہ ) اور حجرہ بھر گیا ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" دس دس افراد حلقہ بنا لیں ، اور ہر انسان اپنے سامنے سے کھائے ۔ \"\" ان سب نے کھایا حتیٰ کہ سیر ہو گئے ، ایک گروہ نکلا تو دوسرا داخل ہوا ( اس طرح ہوتا رہا ) حتیٰ کہ ان سب نے کھانا کھا لیا ، تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا : \"\" انس! اٹھا لو \"\" تو میں نے ( برتن ) اٹھا لیے ، مجھے معلوم نہیں کہ جب میں نے ( کھانا ) رکھا تھا اس وقت زیادہ تھا یا جب میں نے اٹھایا اُس وقت ۔ کہا : ان میں سے کچھ ٹولیاں رسول اللہ صلی اللہ علیہ وسلم کے گھر میں ہی بیٹھ کر باتیں کرنے لگیں ، جبکہ رسول اللہ صلی اللہ علیہ وسلم بیٹھے ہوئے تھے ، اور آپ کی اہلیہ دیوار کی طرف رخ کیے بیٹھی تھیں ، یہ لوگ رسول اللہ صلی اللہ علیہ وسلم پر گراں گزرنے لگے تو رسول اللہ صلی اللہ علیہ وسلم ( گھر سے ) نکلے ، ( یکے بعد دیگرے ) اپنی ازواج کو سلام کیا ، پھر واپس ہوئے ۔ جب انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ واپس ہو گئے ہیں ، تو انہوں نے محسوس کیا کہ وہ آپ پر گراں گزر رہے ہیں ۔ کہا : تو وہ جلدی سے دروازے کی طرف لپکے اور سب کے سب نکل گئے ، رسول اللہ صلی اللہ علیہ وسلم ( آگے ) تشریف لائے ، حتیٰ کہ آپ نے پردہ لٹکایا اور اندر داخل ہو گئے اور میں حجرہ ( نما صفے ) میں بیٹھا ہوا تھا ، آپ تھوڑی ہی دیر ٹھہرے حتی کہ ( دوبارہ ) باہر میرے پاس آئے ، اور ( آپ پر ) یہ آیت نازل کی گئی ۔ رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لائے اور لوگوں کے سامنے انہیں ( آیتِ کریمہ کے جملہ کلمات کو ) تلاوت فرمایا : \"\" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو الا یہ کہ تمہیں کھانے کے لیے اجازت دی جائے ، کھانا پکنے کا انتظار کرتے ہوئے نہیں ، بلکہ جب تمہیں دعوت دی جائے تب تم اندر جاؤ ، پھر جب کھانا کھا چلو تو منشتر ہو جاؤ ، اور ( وہیں ) باتوں میں دل لگاتے ہوئے نہیں ( بیٹھے رہو ۔ ) بلاشبہ یہ بات نبی صلی اللہ علیہ وسلم کو تکلیف دیتی ہے \"\" آیت کے آخر تک ۔ جعد نے کہا : حضرت انس بن مالک رضی اللہ عنہ نے کہا : ان آیات کے ساتھ ( جو ایک ہی طویل آیت میں سمو دی گئیں ) میرا تعلق سب سے زیادہ قریب کا ہے ، اور ( ان کے نزول ہوتے ہی ) نبی صلی اللہ علیہ وسلم کی ازواج رضی اللہ عنھن کو پردہ کرا دیا گیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 3508,
			"arabicnumber": "1428.07",
			"text": "معمر نے ہمیں ابوعثمان ( جعد ) سے حدیث بیان کی ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : جب نبی صلی اللہ علیہ وسلم نے حضرت زینب رضی اللہ عنہا سے نکاح کیا تو ام سلیم رضی اللہ عنہا نے ایک بڑے برتن میں حیس بھی آپ کی خدمت میں بطور ہدیہ پیش کیا ۔ انس رضی اللہ عنہ نے کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \" جاؤ اور مسلمانوں میں سے جو بھی تمہیں ملے اسے میرے پاس بلا لاؤ \" تو میں جس سے ملا اسے آپ کی طرف دعوت دی ، لوگ آپ کی خدمت میں حاضر ہوتے ، کھانا کھاتے اور نکل جاتے ۔ نبی اکرم صلی اللہ علیہ وسلم نے کھانے پر اپنا ہاتھ رکھا اور اس میں ( برکت کی ) دعا کی ، اس کے بارے میں جو اللہ نے چاہا کہ آپ کہیں ، آپ نے کہا ۔ اور میں جس کو بھی ملا ، ان میں سے کسی ایک کو بھی نہیں چھوڑا مگر اسے دعوت دی ، لوگوں نے کھایا ، حتی کہ سیر ہو گئے اور نکل گئے ، ان میں سے ایک گروہ ( وہیں ) رہ گیا ، انہوں نے آپ کی موجودگی میں طویل گفتگو کی ، نبی صلی اللہ علیہ وسلم حیا محسوس کرنے لگے کہ ان سے کچھ کہیں ، چنانچہ آپ نکلے اور انہیں گھر میں ہی چھوڑ دیا ، تو اللہ تعالیٰ نے ( یہ آیات ) نازل فرمائیں : \" اے ایمان والو! تم نبی صلی اللہ علیہ وسلم کے گھروں میں داخل نہ ہوا کرو ، الا یہ کہ تمہیں کھانے کے لیے ( اندر آنے کی ) اجازت دی جائے ، کھانا پکنے کا انتظار کرتے ہوئے نہیں ۔ \" ۔ ۔ قتادہ نے کہا : کھانے کے وقت کا انتظار کرتے ہوئے نہیں ۔ ۔ \" لیکن جب تمہیں بلایا جائے تب تم اندر جاؤ ۔ \" حتی کہ آپ نے یہاں تک تلاوت کی : \" یہ تمہارے اور ان کے دلوں کے لیے اور یادہ پاکیزگی ( کا طریقہ ) ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 3509,
			"arabicnumber": "1429.01",
			"text": "امام مالک نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو ولیمے کی دعوت دی جائے تو وہ اس میں ضرور آئے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 3510,
			"arabicnumber": "1429.02",
			"text": "خالد بن حارث نے ہمیں عبیداللہ ( بن عمر بن حفص مدنی ) سے حدیث بیان کی ، انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب تم میں سے کسی کو ولیمے کی دعوت دی جائے تو وہ قبول کرے ۔ \"\" خالد نے کہا : عبیداللہ اسے شادی ( کی دعوتِ ولیمہ ) پر محمول کرتے تھے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 3511,
			"arabicnumber": "1429.03",
			"text": "محمد بن عبداللہ بن نمیر کے والد نے کہا : ہمیں عبیداللہ نے نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو شادی کے ولیمے کی دعوت دی جائے تو وہ قبول کرے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 3512,
			"arabicnumber": "1429.04",
			"text": "حماد نے ہمیں ایوب سے حدیث بیان کی ، انہوں نے نافع سے ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تمہیں بلایا جائے تو دعوت میں آؤ",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 3513,
			"arabicnumber": "1429.05",
			"text": "معمر نے ہمیں ایوب سے خبر دی ، انہوں نے نافع سے روایت کی کہ حضرت ابن عمر رضی اللہ عنہ نبی صلی اللہ علیہ وسلم سے ( حدیث بیان کرتے ہوئے ) کہا کرتے تھے : \" جب تم میں سے کوئی اپنے بھائی کو دعوت دے تو وہ قبول کرے شادی ہو یا اس جیسی ( کوئی اور ) تقریب",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 3514,
			"arabicnumber": "1429.06",
			"text": "زُبیدی نے ہمیں نافع سے حدیث بیان کی ، انہوں نے ابن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص کو شادی یا اس جیسی کسی تقریب میں بلایا جائے تو وہ قبول کرے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 3515,
			"arabicnumber": "1429.07",
			"text": "اسماعیل بن اُمیہ نے ہمیں نافع سے حدیث بیان کی ، انہوں نے عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تمہیں بلایا جائے تو دعوت میں آؤ",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 3516,
			"arabicnumber": "1429.08",
			"text": "موسیٰ بن عقبہ نے نافع سے خبر دی ، انہوں نے کہا : میں نے عبداللہ بن عمر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ( مسلمان بھائیوں کی طرف سے دی جانے والی ) اس دعوت کو ، جب تمہیں اس کے لیے بلایا جائے ، قبول کرو ۔ \"\" کہا : عبداللہ بن عمر رضی اللہ عنہ دعوت میں شریک ہوتے خواہ وہ شادی کی ہو یا شادی کے بغیر ، اور وہ روزے کی حالت میں بھی اس میں آتے تھے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 3517,
			"arabicnumber": "1429.09",
			"text": "عمر بن محمد نے مجھے نافع سے حدیث بیان کی ، انہوں نے حضرت ابن عمر رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" جب تمہیں ( بکری کے ) پائے کی بھی دعوت دی جائے تو قبول کرو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 3518,
			"arabicnumber": "1430.01",
			"text": "محمد بن مثنیٰ نے ہمیں حدیث بیان کی ، کہا : ہمیں عبدالرحمٰن بن مہدی نے حدیث سنائی ، نیز ہمیں محمد بن عبداللہ بن نمیر نے حدیث سنائی ، انہوں نے کہا : ہمیں میرے والد نے حدیث بیان کی ، دونوں ( ابن مہدی اور عبداللہ بن نمیر ) نے کہا : ہمیں سفیان اور ابوزبیر سے حدیث بیان کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو کھانے کی دعوت دی جائے تو وہ اس مین آئے ، پھر اگر اور چاہے تو کھا لے ، چاہے تو نہ کھائے ۔ \" ابن مثنیٰ نے \" کھانے کی دعوت \" کے الفاظ ذکر نہیں کیے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 3519,
			"arabicnumber": "1430.02",
			"text": "ابن جُریج نے ابوزبیر سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 3520,
			"arabicnumber": "1431",
			"text": "ابن سیرین نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کو دعوت دی جائے تو وہ قبول کرے ۔ اگر وہ روزہ دار ہے تو دعا کرے اور اگر روزے کے بغیر ہے تو کھانا کھائے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 3521,
			"arabicnumber": "1432.01",
			"text": "امام مالک نے ابن شہاب سے ، انہوں نے اعرج سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، وہ کہا کرتے تھے : اُس ولیمے کا کھانا بُرا کھانا ہے جس میں امیروں کو بلایا جائے اور مسکینوں کو چھوڑ دیا جائے اور جس نے ( بلانے کے باوجود ) دعوت میں شرکت نہ کی ، اس نے اللہ اور اس کے رسول کی نافرمانی کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 3522,
			"arabicnumber": "1432.02",
			"text": "سفیان ( بن عیینہ ) نے ہمیں حدیث بیان کی ، کہا : میں نے امام زہری سے پوچھا : جنابِ ابوبکر! یہ حدیث کس طرح ہے : \"\" بدترین کھانا امیروں کا کھانا ہے \"\" ؟ وہ ہنسے ، اور جواب دیا : یہ ( حدیث ) اس طرح نہیں ہے کہ بدترین کھانا امیروں کا کھانا ہے ۔ سفیان نے کہا : میرے والد غنی تھے ، جب میں نے یہ حدیث سنی تھی تو اس نے مجھے گھبراہٹ میں ڈال دیا ، اس لیے میں نے اس کے بارے میں امام زہری سے دریافت کیا ، انہوں نے کہا : مجھے عبدالرحمٰن اعرج نے حدیث بیان کی کہ انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : بدترین کھانا اُس ولیمے کا کھانا ہے ۔ آگے امام مالک رحمۃ اللہ علیہ کی حدیث کی طرح بیان کیا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 3523,
			"arabicnumber": "1432.03",
			"text": "معمر نے زہری سے خبر دی ، انہوں نے سعید بن مسیب سے اور اعرج سے ، اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : بدترین کھانا اُس ولیمے کا کھانا ہے ، ( آگے ) امام مالک رحمۃ اللہ علیہ کی حدیث کی طرح ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 3524,
			"arabicnumber": "1432.04",
			"text": "ابوزناد نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اسی کے مانند حدیث روایت کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 3526,
			"arabicnumber": "1433.01",
			"text": "سفیان نے ہمیں زہری سے حدیث بیان کی ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رفاعہ ( بن سموءل قرظی ) کی بیوی ( تمیمہ بنت وہب قرظیہ ) نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور عرض کی : میں رفاعہ کے ہاں ( نکاح میں ) تھی ، اس نے مجھے طلاق دی اور قطعی ( تیسری ) طلاق دے دی تو میں نے عبدالرحمٰن بن زبیر ( بن باطا قرظی ) سے شادی کر لی ، مگر جو اس کے پاس ہے وہ کپڑے کی جھالر کی طرح ہے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم مسکرائے اور فرمایا : \"\" کیا تم دوبارہ رفاعہ کے پاس لوٹنا چاہتی ہو؟ نہیں ( جا سکتی ) ، حتی کہ تم اس ( دوسرے خاوند ) کی لذت چکھ لو اور وہ تمہاری لذت چکھ لے ۔ \"\" ( حضرت عائشہ رضی اللہ عنہا نے ) کہا : حضرت ابوبکر رضی اللہ عنہ آپ کے پاس موجود تھے اور خالد رضی اللہ عنہ ( بن سعید بن عاص ) دروازے پر اجازت ملنے کے منتظر تھے ، تو انہوں نے پکار کر کہا : ابوبکر! کیا آپ اس عورت کو نہیں سن رہے جو بات وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس اونچی آواز سے کہہ رہی ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 3527,
			"arabicnumber": "1433.02",
			"text": "یونس نے ابن شہاب سے خبر دی ، کہا : مجھے عروہ بن زبیر نے حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ رفاعہ قرظی نے اپنی بیوی کو طلاق دے دی اور قطعی ( آخری ) طلاق دے دی ، تو اس عورت نے اس کے بعد عبدالرحمٰن بن زبیر ( قرظی ) سے شادی کر لی ، بعد ازاں وہ نبی صلی اللہ علیہ وسلم کے پاس آئی ، اور کہنے لگی : اے اللہ کے رسول! وہ رفاعہ کے نکاح میں تھی ، اس نے اسے تین طلاق بھی دے دی ، تو میں اس کے بعد عبدالرحمٰن بن زبیر سے شادی کر لی اور وہ ، اللہ کی قسم! اس کے پاس تو کپڑے کے کنارے کی جھالر کی مانند ہی ہے ، اور اس نے اپنی چادر کے کنارے کی جھالر پکڑ لی ۔ رسول اللہ صلی اللہ علیہ وسلم مسکرائے اور فرمایا : \" شاید تم رفاعہ کے پاس جانا چاہتی ہو؟ نہیں! یہاں تک کہ وہ تمہاری لذت چکھ لے اور تم اس کی لذت چکھ لو ۔ \" حضرت ابوبکر صدیق رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس بیٹھے تھے اور خالد بن سعید بن عاص رضی اللہ عنہ حجرے کے دروازے پر بیٹھے ہوئے تھے ، انہیں ( ابھی اندر آنے کی ) اجازت نہیں ملی تھی ۔ کہا : تو خالد نے ( وہیں سے ) ابوبکر رضی اللہ عنہ کو پکارنا شروع کر دیا : آپ اس عورت کو سختی سے اس بات سے روکتے کیوں نہیں جو وہ بلند آواز سے رسول اللہ صلی اللہ علیہ وسلم کے پاس کہہ رہی ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 3528,
			"arabicnumber": "1433.03",
			"text": "معمر نے ہمیں زہری سے خبر دی ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ رفاعہ قرظی نے اپنی بیوی کو طلاق دے دی تو عبدالرحمٰن بن زبیر نے اس عورت سے نکاح کر لیا ۔ وہ نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی اور کہنے لگی : اللہ کے رسول ( صلی اللہ علیہ وسلم ) ! رفاعہ نے اسے تین طلاقوں میں سے آخری طلاق بھی دے دی ہے ۔ ۔ جس طرح یونس کی حدیث ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 3529,
			"arabicnumber": "1433.04",
			"text": "ابواسامہ نے ہمیں ہشام سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ بن زبیر ) سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم سے اس عورت کے بارے میں سوال کیا گیا جس سے کوئی آدمی نکاح کرے ، پھر وہ اسے طلاق دے دے ، اس کے بعد وہ کسی اور آدمی سے نکاح کر لے اور وہ اس کے ساتھ مباشرت کرنے سے پہلے اسے طلاق دے دے تو کیا وہ عورت اپنے پہلے شوہر کے لیے حلال ( ہو جاتی ) ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ، حتیٰ کہ وہ ( دوسرا خاوند ) اس کی لذت چکھ لے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 3530,
			"arabicnumber": "1433.05",
			"text": "ابن فُضَیل اور ابومعاویہ نے ہشام سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 3531,
			"arabicnumber": "1433.06",
			"text": "علی بن مسہر نے عبیداللہ بن عمر ( بن حفص عمری ) سے حدیث بیان کی ، انہوں نے قاسم بن محمد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : ایک آدمی نے اپنی بیوی کو تین طلاقیں دیں ، اس کے بعد ایک اور آدمی نے اس سے نکاح کیا ، پھر اس نے اس کے ساتھ مباشرت کرنے سے پہلے اس عورت کو طلاق دے دی تو اس کے پہلے شوہر نے چاہا کہ اس سے نکاح کر لے ۔ رسول اللہ صلی اللہ علیہ وسلم سے اس مسئلے کے بارے میں پوچھا گیا تو آپ نے فرمایا : \" نہیں ، حتیٰ کہ دوسرا ( خاوند ) اس کی ( وہی ) لذت چکھ لے جو پہلے نے چکھی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 3532,
			"arabicnumber": "1433.07",
			"text": "عبداللہ بن نمیر اور یحییٰ بن سعید نے عبیداللہ سے اسی سند کے ساتھ اسی کے مانند روایت کی ، اور عبیداللہ سے روایت کردہ یحییٰ کی حدیث میں ہے : ہمیں قاسم نے حضرت عائشہ رضی اللہ عنہا سے حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 3533,
			"arabicnumber": "1434.01",
			"text": "شعبہ نے ہمیں حدیث بیان کی ، نیز ابن نمیر اور عبدالرزاق نے ثوری سے ( اور ثوری اور شعبہ ) دونوں نے منصور سے جریر کی حدیث کے ہم معنی روایت کی ، لیکن شعبہ کی حدیث میں \" اللہ کے نام سے \" کا ذکر نہیں ، اور ثوری سے روایت کردہ عبدالرزاق کی روایت میں \" اللہ کے نام سے \" ( کا جملہ ) ہے ۔ اور ابن نمیر کی روایت میں ہے : منصور نے کہا : میرا خیال ہے کہ انہوں نے کہا : اللہ کے نام سے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 3534,
			"arabicnumber": "1434.02",
			"text": "مضمون ‌وہی ‌ہے ‌مگر ‌شعبہ ‌كی ‌روایت ‌میں ‌بسم ‌اللہ ‌كا ‌لفظ ‌نہیں ‌اور ‌عبد ‌الرزاق ‌كی ‌روایت ‌میں ‌ہے ‌اور ‌ابن ‌نمیر ‌كی ‌روایت ‌میں ‌ہے ‌كہ ‌منصور ‌نے ‌كہا ‌كہ ‌خیال ‌كرتا ‌ہوں ‌میں ‌كہ ‌انہوں ‌نے ‌بسم ‌اللہ ‌كہا ‌ہے ‌",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 3535,
			"arabicnumber": "1435.01",
			"text": "سفیان نے ہمیں ابن منکدر سے حدیث بیان کی ، انہوں نے حضرت جابر رضی اللہ عنہ سے سنا وہ کہہ رہے تھے ، یہود کہا کرتے تھے : اگر کوئی شخص اپنی بیوی کے پیچھے کی طرف سے اس کی شرم گاہ میں مجامعت کرے تو بچہ بھینگا ( پیدا ) ہو گا ۔ اس پر ( یہ آیت ) نازل ہوئی : \" تمہاری عورتیں تمہاری کھیتی ہیں ، سو اپنی کھیتی میں آؤ جس طرف سے چاہو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 3536,
			"arabicnumber": "1435.02",
			"text": "ابوحازم نے محمد بن منکدر سے ، انہوں نے جابر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ یہود کہا کرتے تھے : جب عورت کے پیچھے کی طرف سے اس کی شرمگاہ میں مباشرت کی جائے ، پھر وہ حاملہ ہو تو اس کا بچہ بھینگا ہو گا ۔ کہا : اس پر ( یہ آیت ) نازل کی گئی : \" تمہاری عورتیں تمہاری کھیتی ہیں ، سو جس طرف سے چاہو اپنی کھیتی میں آؤ",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 3537,
			"arabicnumber": "1435.03",
			"text": "قتیبہ بن سعید نے کہا : ہمیں ابوعوانہ نے حدیث بیان کی ۔ عبدالوارث بن عبدالصمد نے کہا : مجھے میرے والد نے میرے داداسے حدیث بیان کی ، انہوں نے ایوب سے روایت کی ۔ محمد بن مثنیٰ نے کہا : ہمیں عبدالرحمٰن نے حدیث بیان کی ، انہوں نے کہا : ہمیں سفیان نے حدیث سنائی ۔ عبیداللہ بن سعد ، ہارون بن عبداللہ اور ابومعن رقاشی نے کہا : ہمیں وہب بن جریر نے حدیث بیان کی ، انہوں نے کہا : ہمیں میرے والد نے حدیث سنائی ، انہوں نے کہا : میں نے نعمان بن راشد سے سنا ، وہ زہری سے روایت کر رہے تھے ۔ سلیمان بن سعید نے کہا : ہمیں معلیٰ بن اسد نے حدیث سنائی ، انہوں نے کہا : ہمیں عبدالعزیز بن مختار نے سہل بن ابی صالح سے حدیث سنائی ، ان سب ( ابوعوانہ ، ایوب ، شعبہ ، سفیان ، زہری اور سہیل بن ابی صالح ) نے محمد بن منکدر سے ، انہوں نے حضرت جابر رضی اللہ عنہ سے یہی حدیث بیان کی ، زہری سے روایت کردہ نعمان ( بن راشد کی حدیث میں ان کے شاگرد جریر نے ) اضافہ کیا : اگر چاہے تو منہ کے بل اور اگر چاہے تو اس کے بغیر ( کسی اور ہئیت میں ) ، لیکن یہ ایک ہی ڈھکنے ( کی جگہ ، یعنی قُبل ) میں ہو",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 3538,
			"arabicnumber": "1436.01",
			"text": "محمد بن جعفر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : میں نے قتادہ سے سنا وہ زرارہ بن اوفیٰ سے حدیث بیان کر رہے تھے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" جب کوئی عورت ( بلا عذر ) اپنے شوہر کے بستر کو چھوڑ کر رات گزارتی ہے ، تو فرشتے اس کے صبح کرنے تک اس پر لعنت بھیجتے رہتے ہیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 3539,
			"arabicnumber": "1436.02",
			"text": "خالد بن حارث نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ یہی حدیث بیان کی ، اور کہا : \" یہاں تک کہ وہ ( اس کے بستر پر ) لوٹ آئے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 3540,
			"arabicnumber": "1436.03",
			"text": "یزید بن کیسان نے ابوحازم سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : اللہ کے رسول صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! کوئی مرد نہیں جو اپنی بیوی کو اس کے بستر کی طرف بلائے اور وہ انکار کرے مگر وہ جو آسمان میں ہے اس سے ناراض رہتا ہے یہاں تک کہ وہ ( شوہر ) اس سے راضی ہو جائے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 3541,
			"arabicnumber": "1436.04",
			"text": "اعمش نے ابوحازم سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب مرد اپنی بیوی کو اپنے بستر پر بلائے ، وہ نہ آئے اور وہ ( شوہر ) اس پر ناراضی کی حالت میں رات گزارے تو اس کے صبح کرنے تک فرشتے اس عورت پر لعنت کرتے رہتے ہیں ۔ \"\" باب 21 : بیوی کا راز افشا کرنا حرام ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 3542,
			"arabicnumber": "1437.01",
			"text": "مروان بن معاویہ نے عمر بن حمزہ عمری سے حدیث بیان کی ، کہا : ہمیں عبدالرحمٰن بن سعد نے حدیث بیان کی ، کہا : میں نے حضرت ابوسعید خدری رضی اللہ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کے دن ، اللہ کے ہاں لوگوں میں مرتبے کے اعتبار سے بدترین وہ آدمی ہو گا جو اپنی بیوی کے پاس خلوت میں جاتا ہے اور وہ اس کے پاس خلوت میں آتی ہے پھر وہ ( آدمی ) اس کا راز افشا کر دیتا ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 3543,
			"arabicnumber": "1437.02",
			"text": "محمد بن عبیداللہ بن نمیر اور ابوکریب نے کہا : ہمیں ابواسامہ نے عمر بن حمزہ سے حدیث بیان کی ، انہوں نے عبدالرحمٰن بن سعد سے روایت کی ، انہوں نے کہا : میں نے حضرت ابوسعید رضی اللہ عنہ سے سنا وہ کہہ رہے تھے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بلاشبہ قیامت کے دن اللہ کے ہاں امانت کے حوالے سے سب سے بڑے ( سنگین ) معاملات میں سے اس آدمی ( کا معاملہ ) ہو گا جو خلوت میں بیوی کے پاس جائے اور وہ اس کے پاس آئے ، پھر وہ اس ( بیوی ) کا راز افشا کر دے ۔ \" ابن نمیر نے کہا : سب سے بڑا ( سنگین ) معاملہ ۔ \" ( یہ بڑی خیانت ہے)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 3544,
			"arabicnumber": "1438.01",
			"text": "ربیعہ نے محمد بن یحییٰ بن حبان سے خبر دی ، انہوں نے ابن مُحَریز سے روایت کی ، انہوں نے کہا : میں اور ابوصرمہ حضرت ابوسعید خدری رضی اللہ عنہ کے ہاں حاضر ہوئے ، ابوصرمہ نے ان سے سوال کیا اور کہا : ابوسعید! کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو عزل کا ذکر کرتے ہوئے سنا؟ انہوں نے کہا : ہاں ، ہم نے رسول اللہ صلی اللہ علیہ وسلم کی معیت میں بنی مصطلق کے خلاف جنگ کی اور عرب کی چنیدہ عورتیں بطور غنیمت حاصل کیں ، ہمیں ( اپنی عورتوں سے ) دور رہتے ہوئے کافی مدت ہو چکی تھی ، اور ہم ( ان عورتوں کے ) فدیے کی بھی رغبت رکھتے تھے ، ہم نے ارادہ کیا کہ ( ان عورتوں سے ) فائدہ اٹھائیں اور عزل کر لیں ، ہم نے کہا : ہم یہ کام کریں بھی اور رسول اللہ صلی اللہ علیہ وسلم ہمارے درمیان موجود ہوں تو ان سے سوال بھی نہ کریں! چنانچہ ہم نے رسول اللہ صلی اللہ علیہ وسلم سے دریافت کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم ( عزل ) نہ بھی کرو تو تمہیں کوئی نقصان نہیں ہو گا کیونکہ اللہ نے قیامت کے دن تک ( پیدا ) ہونے والی جس جان کی پیدائش لکھ دی ہے ، وہ ضرور پیدا ہو گی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 3545,
			"arabicnumber": "1438.02",
			"text": "موسیٰ بن عقبہ نے محمد بن یحییٰ بن حبان سے اسی سند کے ساتھ ربیعہ کی حدیث کے ہم معنی حدیث بیان کی ، مگر انہوں نے کہا : \" اللہ نے ( پہلے ہی ) لکھ دیا ہے کہ وہ قیامت کے دن تک کس کو پیدا کرنے والا ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 3546,
			"arabicnumber": "1438.03",
			"text": "زہری نے ابن محریز سے اور انہوں نے ابوسعید خدری رضی اللہ عنہ سے روایت کی ، انہوں نے ان ( ابن محریز ) کو خبر دی ، ہمیں لونڈیاں حاصل ہوئیں تو ( ان کے ساتھ ) ہم عزل کرتے تھے ، پھر ہم نے اس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے پوچھا تو آپ نے ہمیں فرمایا : \" ( کیا ) تم ایسا کرتے ہو؟ تم ایسا کرتے ہو؟ ( واقعی ) تم ایسا کرتے ہو؟ کوئی جان نہیں جو قیامت تک پیدا ہونے والی ہو مگر وہ پیدا ہو کر رہے گی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 3547,
			"arabicnumber": "1438.04",
			"text": "بشر بن مفضل نے کہا : ہمیں شعبہ نے انس بن سیرین سے حدیث بیان کی ، انہوں نے معبد بن سیرین سے ، انہوں نے ابوسعید خدری رضی اللہ عنہ سے روایت کی ، ( انس بن سیرین نے ) کہا : میں نے ان ( معبد ) سے پوچھا : آپ نے یہ حضرت ابوسعید رضی اللہ عنہ سے خود سنا ہے؟ انہوں نے کہا : ہاں! انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمہیں اس بات کا کوئی نقصان نہیں کہ تم ( ایسا ) نہ کرو ، یہ تو صرف تقدیر ہے ( جو تم عزل کرو یا نہ کرو ، بہرصورت پوری ہو کر رہے گی)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 3548,
			"arabicnumber": "1438.05",
			"text": "محمد بن جعفر ، خالد بن حارث ، عبدالرحمٰن بن مہدی اور بہز ، سب نے کہا : ہمیں شعبہ نے انس بن سیرین سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، مگر ان کی حدیث میں ( اس طرح ) ہے : انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے عزل کے بارے میں فرمایا : \"\" ( اس میں ) کوئی حرج نہیں کہ تم یہ کام نہ کرو ، یہ تو بس تقدیر ( کا معاملہ ) ہے ۔ \"\" بہز کی روایت میں ہے ، شعبہ نے کہا : میں نے ان سے پوچھا : کیاآپ نے یہ حدیث ابوسعید رضی اللہ عنہ سے سنی؟ انہوں نے کہا : ہاں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 3549,
			"arabicnumber": "1438.06",
			"text": "ایوب نے ہمیں محمد ( بن سیرین ) سے حدیث بیان کی ، انہوں نے عبدالرحمٰن بن بشر بن مسعود سے روایت کی ، اسے پیچھے حضرت ابوسعید خدری رضی اللہ عنہ تک لے گئے ( ان سے روایت کی ) ، انہوں نے کہا : نبی صلی اللہ علیہ وسلم سے عزل کے بارے میں سوال کیا گیا تو آپ نے فرمایا : \" تم پر کوئی حرج نہیں کہ تم یہ کام نہ کرو ، یہ تو بس تقدیر ( کا معاملہ ) ہے ۔ \" محمد ( بن سیرین ) نے کہا : آپ صلی اللہ علیہ وسلم کا قول : ( لا عليكم ) \" اس بات کا تم پر کوئی حرج نہیں \" ممانعت کے زیادہ قریب ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 3550,
			"arabicnumber": "1438.07",
			"text": "معاذ بن معاذ نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن عون نے محمد ( بن سیرین ) سے حدیث بیان کی ، انہوں نے عبدالرحمٰن بن بشر انصاری سے روایت کی ، اور اس حدیث کو پیچھے لے گئے اور اسے حضرت ابوسعید خدری رضی اللہ عنہ کی طرف منسوب کیا ، انہوں نے کہا : نبی صلی اللہ علیہ وسلم کے پاس عزل کا تذکرہ کیا گیا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" ( اس سے ) تمہارا مقصود کیا ہے؟ \"\" صحابہ کرام رضی اللہ عنہم نے جواب دیا : کسی آدمی کی بیوی ہے ( بچے کو ) دودھ پلا رہی ہوتی ہے ، وہ اس سے مباشرت کرتا ہے اور ناپسند کرتا ہے کہ وہ اس سے حاملہ ہو ۔ اور کسی شخص کی لونڈی ہے وہ اس سے مباشرت کرتا ہے اور ناپسند کرتا ہے کہ وہ اس سے حاملہ ہو ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کوئی حرج نہیں کہ تم ایسا نہ کرو ، یہ ( بچے کا پیدا ہونا یا نہ ہونا ) تو تقدیر کا معاملہ ہے ۔ \"\" ابن عون نے کہا : میں نے یہ حدیث حسن ( بصری ) کو سنائی تو انہوں نے کہا : اللہ کی قسم! یہ تو گویا ڈانٹ ہے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 3551,
			"arabicnumber": "1438.08",
			"text": "حماد بن زید نے ابن عون سے حدیث بیان کی ، کہا : میں نے حماد ( بن سیرین ) کو ابراہیم کے واسطے سے عبدالرحمٰن بن بشر کی حدیث ، یعنی عزل کی حدیث سنائی تو انہوں نے کہا : عبدالرحمٰن بن بشر نے خود مجھے بھی یہ حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 3552,
			"arabicnumber": "1438.09",
			"text": "ہشام نے ہمیں محمد ( بن سیرین ) سے حدیث بیان کی ، انہوں نے معبد بن سیرین سے روایت کی ، کہا : ہم نے حضرت ابوسعید رضی اللہ عنہ سے عرض کی ، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو عزل کے بارے میں کچھ فرماتے ہوئے سنا؟ انہوں نے کہا : ہاں ۔ آگے انہوں نے القدر ( یہ تو تقدیر ہے ) تک ابن عون کی حدیث کے ہم معنی حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 3553,
			"arabicnumber": "1438.10",
			"text": "قزعہ نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے سامنے عزل کا ذکر کیا گیا تو آپ نے فرمایا : \" تم میں سے کوئی شخص ایسا کیوں کرتا ہے؟ ۔ ۔ آپ نے یہ نہیں فرمایا : تم میں سے کوئی ایسا نہ کرے ۔ حقیقت یہ ہے پیدا ہونے والی کوئی جان نہیں مگر اللہ اسے پیدا کرنے والا ہے ۔ ( وہ اسے ضرور پیدا کرے گا)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 3554,
			"arabicnumber": "1438.11",
			"text": "عبداللہ بن وہب نے ہمیں حدیث بیان کی ، کہا : مجھے معاویہ بن صالح نے علی بن ابو طلحہ سے خبر دی ، انہوں نے ابو وداک سے ، انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، انہوں ( ابووداک ) نے ان سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم سے عزل کے بارے میں سوال کیا گیا ، آپ نے فرمایا : \"\" ہر پانی ( منی کے قطرے ) سے بچہ پیدا نہیں ہوتا ، اور جب اللہ تعالیٰ کسی چیز کو پیدا کرنے کا ارادہ فرما لیتا ہے تو اسے کوئی چیز روک نہیں سکتی ۔ \"\" ( زید بن حباب نے معاویہ سے ، باقی ماندہ اسی سند کے ساتھ نبی صلی اللہ علیہ وسلم سے اسی کے مانند حدیث بیان کی)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 3555,
			"arabicnumber": "1438.12",
			"text": "ابوزبیر نے ہمیں حضرت جابر رضی اللہ عنہ سے خبر دی کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، اور عرض کی : میری ایک لونڈی ہے ، وہی ہماری خادمہ ہے اور وہی ہمارے لیے پانی لانے والی بھی ہے اور میں اس سے مجامعت بھی کرتا ہوں ۔ میں ناپسند کرتا ہوں کہ وہ حاملہ ہو ۔ تو آپ نے فرمایا : \" اگر تم چاہو تو اس سے عزل کر لیا کرو ، ( لیکن ) یہ بات یقینی ہے کہ جو بچہ اس کے لیے مقدر میں لکھا گیا ہے وہ آ کر رہے گا ۔ \" وہ شخص ( چند دن ) رکا ، پھر آپ کی خدمت میں حاضر ہوا ، اور عرض کی : وہ لونڈی حاملہ ہو گئی ہے ۔ تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے تمہیں بتا دیا تھا کہ جو اس کے لیے مقدر کیا گیا ہے وہ آ کر رہے گا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 3556,
			"arabicnumber": "1439.01",
			"text": "سفیان بن عیینہ نے ہمیں سعید بن حسان سے حدیث بیان کی ، انہوں نے عروہ بن عیاض سے اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا : ایک آدمی نے نبی صلی اللہ علیہ وسلم سے دریافت کیا ، اور کہا : میرے پاس میری ایک لونڈی ہے ، میں اس سے عزل کرتا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک یہ ( عزل ) ایسی کسی چیز کو نہیں روک سکتا جس کا اللہ نے ارادہ کیا ہو ۔ \" کہا : وہ شخص ( دوبارہ ) حاضرِ خدمت ہوا اور کہنے لگا : اللہ کے رسول! وہ لونڈی جس کا میں نے آپ سے ذکر کیا تھا ، حاملہ ہو گئی ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں اللہ کا بندہ اور رسول ہوں ۔ ( میں جو کہتا ہوں اللہ کی طرف سے کہتا ہوں)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 3557,
			"arabicnumber": "1439.02",
			"text": "سفیان بن عیینہ نے ہمیں سعید بن حسان سے حدیث بیان کی ، انہوں نے عروہ بن عیاض سے اور انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا : ایک آدمی نے نبی صلی اللہ علیہ وسلم سے دریافت کیا ، اور کہا : میرے پاس میری ایک لونڈی ہے ، میں اس سے عزل کرتا ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک یہ ( عزل ) ایسی کسی چیز کو نہیں روک سکتا جس کا اللہ نے ارادہ کیا ہو ۔ \" کہا : وہ شخص ( دوبارہ ) حاضرِ خدمت ہوا اور کہنے لگا : اللہ کے رسول! وہ لونڈی جس کا میں نے آپ سے ذکر کیا تھا ، حاملہ ہو گئی ہے ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں اللہ کا بندہ اور رسول ہوں ۔ ( میں جو کہتا ہوں اللہ کی طرف سے کہتا ہوں)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 3558,
			"arabicnumber": "1439.03",
			"text": "ابو احمد زبیری نے ہمیں حدیث بیان کی ، کہا : ہمیں مکہ کے قصہ گو سعید بن حسان نے حدیث بیان کی ، کہا : مجھے عروہ بن عیاض بن عدی بن خیار نوفلی نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے خبر دی ، انہوں نے کہا : ایک آدمی نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ ( آگے ) سفیان کی حدیث کے ہم معنی ( ہے)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 3559,
			"arabicnumber": "1440.01",
			"text": "ہمیں ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم نے حدیث بیان کی ، ( انہوں نے کہا ) ہمیں سفیان نے عمرو سے حدیث بیان کی ، انہوں نے عطاء سے اور انہوں نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : ہم عزل کرتے تھے جبکہ قرآن نازل ہو رہا ہوتا تھا ۔ اسحاق نے اضافہ کیا : سفیان نے کہا : اگر یہ ایسی چیز ہوتی جس سے منع کیا جانا ( ضروری ) ہوتا تو قرآن ہمیں ( ضرور ) اس سے منع کرتا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 3560,
			"arabicnumber": "1440.02",
			"text": "معقل نے ہمیں عطاء سے حدیث بیان کی ، انہوں نے کہا : میں نے جابر رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : ہم رسول اللہ صلی اللہ علیہ وسلم کے عہد میں عزل کیا کرتے تھے",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 3561,
			"arabicnumber": "1440.03",
			"text": "ابوزبیر نے حضرت جابر رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں عزل کرتے تھے ۔ یہ بات اللہ کے نبی صلی اللہ علیہ وسلم کو پہنچی تو آپ نے ہمیں منع نہیں فرمایا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 3562,
			"arabicnumber": "1441.01",
			"text": "محمد بن جعفر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے یزید بن خُمَیر سے حدیث بیان کی ، انہوں نے کہا : میں نے عبدالرحمٰن بن جبیر سے سنا وہ اپنے والد ( جبیر بن نفیر ) سے حدیث بیان کر رہے تھے ، انہوں نے ابودرداء رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم خیمے کے دروازے پر کھڑی ایک پورے دِنوں کی حاملہ عورت ( لونڈی ) کے پاس سے گزرے ، آپ نے فرمایا : \" شاید وہ ( اس کا مالک ) چاہتا ہے کہ اس کے ساتھ مجامعت کرے؟ \" صحابہ رضی اللہ عنہم نے عرض کی : جی ہاں ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے ارادہ کیا کہ اس پر ایسی لعنت بھیجوں جو اس کی قبر میں اس کے ساتھ جائے ۔ ایسا کام کرنے والا کیسے اس ( طرح کے بچے ) کو وارث بنائے گا ، جبکہ وہ ( وارث بنانا ) اس کے لیے حلال نہیں ۔ وہ کیسے اس سے خدمت لے گا ( اسے غلام بنائے گا؟ ) جبکہ ( اس بچے کے پیٹ میں ہونے کے دوران میں اس کی ماں سے مباشرت کرنے کی بنا پر اس بچے/بچی کو غلام/کنیز بنانا ) اس کے لیے حلال نہیں",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 3563,
			"arabicnumber": "1441.02",
			"text": "یزید بن ہارون اور ابوداؤد نے شعبہ سے اسی سند کے ساتھ یہ حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 3564,
			"arabicnumber": "1442.01",
			"text": "جدامہ نے رسول اﷲ ﷺ سے سُنا کہ فرماتے تھے میں نے چاہا کہ غیلہ سے منع کردوں پھر مجھے یاد آیا کہ روم اور فارس غیلہ کرتے ہیں اور ان کی اولاد کو ضرر نہیں ہوتا ۔ مسلم نے فرمایا کہ جدامہ بے نقطہ کے دل سے صحیح ہے ۔",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 3565,
			"arabicnumber": "1442.02",
			"text": "عبیداللہ بن سعید اور محمد بن ابی عمر نے ہمیں حدیث بیان کی ، ان دونوں نے کہا : ہمیں مُقری نے حدیث بیان کی ، کہا : ہمیں سعید بن ابی ایوب نے حدیث بیان کی ، کہا : مجھے ابواسود نے عروہ سے حدیث بیان کی ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، انہوں نے عکاشہ رضی اللہ عنہ کی بہن جدامہ بنت وہب رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : میں لوگوں کی موجودگی میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی ، آپ صلی اللہ علیہ وسلم فرما رہے تھے : \"\" میں نے ارادہ کیا تھا کہ غیلہ ( دودھ پلانے والی بیوی کے ساتھ مباشرت کرنے ) سے منع کر دوں ، پھر میں نے روم اور فارس ( کے لوگوں کے بارے ) میں دیکھا ( سوچا ، غور کیا ) تو وہ اپنے بچوں ( کی دودھ پلانے والی ماؤں ) سے غیلہ کرتے ہیں اور یہ ان کے بچوں کو کچھ نقصان نہیں پہنچاتا ۔ \"\" پھر صحابہ نے آپ سے عزل کے بارے میں پوچھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ مخفی ( واد ) زندہ درگور کرنا ہے ۔ \"\" عبیداللہ نے مُقری سے روایت کردہ اپنی حدیث میں اضافہ کیا : اور یہی ہے : \"\" زندہ درگور کی گئی سے ( قیامت کے دن ) پوچھا جائے گا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 3566,
			"arabicnumber": "1442.03",
			"text": "یحییٰ بن ایوب نے ہمیں محمد بن عبدالرحمٰن بن نوفل قرشی سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے ، انہوں نے جدامہ بنت وہب اسدیہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ۔ ۔ ۔ آگے عزل اور غیلہ کے بارے میں سعید بن ابوایوب کی حدیث کی طرح بیان کیا ۔ لیکن انہوں نے ( غیلہ کے بجائے ) غِیال کہا ( معنی وہی ہیں)",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 3567,
			"arabicnumber": "1443",
			"text": "محمد بن عبداللہ بن نمیر اور زہیر بن حرب نے ۔ ۔ الفاظ ابن نمیر کے ہیں ۔ ۔ حدیث بیان کی ، دونوں نے کہا : ہمیں عبداللہ بن یزید مقبری نے حدیث بیان کی ، کہا : ہمیں حیوہ نے حدیث بیان کی ، کہا : مجھے عیاش بن عباس نے حدیث سنائی ، انہیں ابونضر نے عامر بن سعد سے حدیث بیان کی کہ اسامہ بن زید رضی اللہ عنہ نے ان کے والد سعد بن ابی وقاص رضی اللہ عنہ کو خبر دی کہ ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : می اپنی بیوی سے عزل کرتا ہوں ، تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \"\" تم ایسا کیوں کرتے ہو؟ \"\" اس نے جواب دیا : میں اس کے بچے یا اس کے بچوں پر ( جنہیں وہ دودھ پلا رہی ہوتی ہے ) شفقت کرتا ہوں ( کہ انہیں کوئی نقصان نہ ہو ۔ ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اگر یہ نقصان دہ ہوتا تو فارس اور روم ( کے بچوں ) کو نقصان دیتا ۔ \"\" زہیر نے اپنی روایت میں کہا : \"\" اگر یہ ( عزل ) اس وجہ سے ہے تو ( اس کی ضرورت ) نہیں ، اس ( عمل ) نے فارس اور روم ( کے بچوں ) کو کوئی نقصان نہیں پہنچایا",
			"grades": [],
			"reference": {
				"book": 16,
				"hadith": 169
			}
		}
	]
}