{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"17": "The Book of Suckling"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3568,
			"arabicnumber": "1444.01",
			"text": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے قراءت کی ، عبداللہ بن ابوبکر سے روایت ہے ، انہوں نے عمرہ سے روایت کی ، حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم ان کے ہاں تشریف فرما تھے انہوں ( حضرت عائشہ رضی اللہ عنہا ) نے ایک آدمی کی آواز سنی جو حضرت حفصہ رضی اللہ عنہا کے گھر میں داخل ہونے کی اجازت مانگ رہا تھا ۔ حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے عرض کی : اے اللہ کے رسول! یہ آدمی آپ کے گھر میں داخل ہونے کی اجازت مانگ رہا ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میرا خیال ہے وہ فلاں ہے ۔ حفصہ رضی اللہ عنہا کے رضاعی چچا کے بارے میں ( فرمایا ) ۔ ۔ \" عائشہ رضی اللہ عنہا نے عرض کی : اے اللہ کے رسول! اگر فلاں ۔ ۔ انہوں نے اپنے ایک رضاعی چچا کے بارے میں کہا ۔ ۔ زندہ ہوتا تو وہ میرے گھر میں آ سکتا تھا؟ رسول اللہ صلی اللہ علیہ وسلم نے جواب دیا : \" ہاں ، بلاشبہ رضاعت ان تمام رشتوں کو حرام کر دیتی ہے جن کو ولادت حرام کرتی ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3569,
			"arabicnumber": "1444.02",
			"text": "ہشام بن عروہ نے عبداللہ بن ابوبکر سے ، انہوں نے عمرہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" رضاعت سے وہ ( رشتے ) حرام ہو جاتے ہیں جو ولادت سے حرام ہوتے ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3570,
			"arabicnumber": "1444.03",
			"text": "ابن جریج نے ہمیں خبر دی ، کہا : مجھے عبداللہ بن ابوبکر نے اسی سند سے ہشام بن عروہ کی حدیث کے مانند خبر دی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3571,
			"arabicnumber": "1445.01",
			"text": "امام مالک نے ابن شہاب سے ، انہوں نے عروہ بن زبیر سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے ان ( عروہ ) کو خبر دی کہ پردے کے احکام نازل ہونے کے بعد ابوقُعیس کے بھائی افلح آئے ، وہ اندر آنے کی اجازت چاہتے تھے ، اور وہ ان کے رضاعی چچا ( لگتے ) تھے ۔ انہوں نے کہا : میں نے انہیں اجازت دینے سے انکار کر دیا ۔ جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو جو میں نے کیا آپ کو بتایا تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ انہیں اپنے سامنے آنے کی اجازت دوں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3572,
			"arabicnumber": "1445.02",
			"text": "سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : میرے پاس میرے رضاعی چچا افلح بن ابی قعیس آئے ، ( آگے ) امام مالک رحمۃ اللہ علیہ کی حدیث کے ہم معنی بیان کیا اور یہ اضافہ کیا : ( عائشہ رضی اللہ عنہا نے کہا : ) میں نے عرض کی : مجھے تو عورت نے دودھ پلایا ہے ، مرد نے نہیں پلایا ۔ آپ نے فرمایا : \" تیرے دونوں ہاتھ یا تیرا دایاں ہاتھ خاک آلود ہو",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3573,
			"arabicnumber": "1445.03",
			"text": "یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے عروہ سے روایت کی ، حضرت عائشہ رضی اللہ عنہا نے انہیں خبر دی کہ پردے کا حکم نازل ہونے کے بعد ابوقعیس کے بھائی افلح آئے ، وہ ان کے پاس ( گھر کے اندر ) آنے کی اجازت چاہتے تھے ۔ ابوقعیس حضرت عائشہ رضی اللہ عنہا کے رضاعی والد تھے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے کہا : اللہ کی قسم! میں افلح کو اجازت نہیں دوں گی حتیٰ کہ میں رسول اللہ صلی اللہ علیہ وسلم سے اجازت لے لوں ۔ مجھے ابوقعیس نے تو دودھ نہیں پلایا ( کہ اس کا بھائی میرا محرم بن جائے ) مجھے تو ان کی بیوی نے دودھ پلایا تھا ۔ عائشہ رضی اللہ عنہا نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، میں نے عرض کی : اللہ کے رسول! ابوقعیس کے بھائی افلح میرے پاس آئے تھے ، وہ اندر آنے کی اجازت مانگ رہے تھے ، مجھے اچھا نہ لگا کہ میں انہیں اجازت دوں یہاں تک کہ آپ سے اجازت لے لوں ۔ ( عروہ نے ) کہا : حضرت ( عائشہ رضی اللہ عنہا نے ) کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" انہیں اجازت دے دیا کرو ۔ \"\" عروہ نے کہا : اسی ( حکم ) کی وجہ سےحضرت عائشہ رضی اللہ عنہا کہا کرتی تھیں : رضاعت کی وجہ سے وہ سب رشتے حرام ٹھہرا لو جنہیں تم نسب کی وجہ سے حرام ٹھہراتے ہو",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3574,
			"arabicnumber": "1445.04",
			"text": "معمر نے ہمیں زہری سے اسی سند کے ساتھ خبر دی کہ ابوقعیس کے بھائی افلح آئے ، وہ ان کے پاس گھر کے اندر آنے کی اجازت چاہتے تھے ۔ ۔ ۔ ان سب کی حدیث کی طرح ۔ ۔ ۔ اور اس میں ہے : \" وہ تمہارے چچا ہیں ، تمہارا دایاں ہاتھ خاک آلود ہو \" اور ابوقعیس اس عورت کے شوہر تھے جس نے حضرت عائشہ رضی اللہ عنہا کو دودھ پلایا تھا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3575,
			"arabicnumber": "1445.05",
			"text": "ابن نمیر نے ہشام سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ بن زبیر ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : میرے رضاعی چچا آئے ، وہ مجھ سے ( گھر کے ) اندر آنے کی اجازت چاہتے تھے ، میں نے انہیں اجازت دینے سے انکار کر دیا حتیٰ کہ رسول اللہ صلی اللہ علیہ وسلم سے اجازت لے لوں ۔ جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے عرض کی : میرے رضاعی چچا نے میرے پاس ( گھر کے اندر ) آنے کی اجازت مانگی تو میں نے انہیں اجازت دینے سے انکار کر دیا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارے چچا تمہارے پاس ( گھر میں ) آ جائیں ۔ \" میں نے کہا : مجھے عورت نے دودھ پلایا تھا ، مرد نے نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ تمہارے چچا ہیں ، وہ تمہارے گھر میں آ سکتے ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3576,
			"arabicnumber": "1445.06",
			"text": "حماد ، یعنی ابن زید نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشام نے اسی سند سے حدیث بیان کی کہ ابوقعیس کے بھائی نے ان ( حضرت عائشہ رضی اللہ عنہا ) کے ہاں آنے کی اجازت مانگی ۔ ۔ ۔ آگے اسی طرح بیان کیا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3577,
			"arabicnumber": "1445.07",
			"text": "ابومعاویہ نے ہشام سے اسی سند کے ساتھ اسی کی طرح حدیث بیان کی مگر انہوں نے کہا : ابوقیس نے ان کے ہاں آنے کی اجازت مانگی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3578,
			"arabicnumber": "1445.08",
			"text": "عطاء سے روایت ہے ، کہا : مجھے عروہ بن زبیر نے خبر دی کہ انہیں حضرت عائشہ رضی اللہ عنہا نے خبر دی ، کہا : میرے رضاعی چچا ابوالجعد نے میرے پاس آنے کی اجازت مانگی تو میں نے انہیں انکار کر دیا ۔ ہشام نے مجھ سے کہا : یہ ابوقعیس ہی تھے ۔ پھر جب نبی صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ کو یہ بات بتائی ۔ آپ نے فرمایا : \" تم نے انہیں اجازت کیوں نہ دی؟ تمہارا دایاں ہاتھ یا تمہارا ہاتھ خاک آلود ہو",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3579,
			"arabicnumber": "1445.09",
			"text": "یزید بن ابی حبیب نے عراک ( بن مالک غفاری ) سے ، انہوں نے عروہ سے ، انہوں نے سیدہ عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے اسے خبر دی کہ ان کے رضاعی چچا نے ، جن کا نام افلح تھا ، ان کے ہاں آنے کی اجازت مانگی تو انہوں نے ان کے آگے پردہ کیا ( انہیں روک دیا ) اس کے بعد انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو بتایا تو آپ نے فرمایا : \" تم ان سے پردہ نہ کرو کیونکہ رضاعت سے بھی وہ سب رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہوتے ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3580,
			"arabicnumber": "1445.10",
			"text": "حکم نے عراک بن مالک سے ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : قعیس کے بیٹے افلح نے میرے ہاں آنے کی اجازت مانگی تو میں نے انہیں اجازت دینے سے انکار کر دیا ، انہوں نے پیغام بھیجا : میں آپ کا چچا ہوں ، میرے بھائی کی بیوی نے آپ کو دودھ پلایا ہے ، اس پر بھی میں نے انہیں اجازت دینے سے انکار کر دیا ، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے آپ صلی اللہ علیہ وسلم کے سامنے اس واقعے کا ذکر کیا ، آپ نے فرمایا : \" وہ تمہارے سامنے آ سکتا ہے وہ تمہارا چچا ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3581,
			"arabicnumber": "1446.01",
			"text": "ابومعاویہ نے ہمیں اعمش سے خبر دی ، انہوں نے سعد بن عبیدہ سے ، انہوں نے ابوعبدالرحمٰن سے اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں نے عرض کی : اللہ کے رسول! کیا وجہ ہے آپ ( نکاح کے لیے ) قریش ( کی عورتوں ) کے انتخاب کا اہتمام کرتے ہیں اور ہمیں ( بنو ہاشم کو ) چھوڑ دیتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" تمہارے پاس کوئی شے ( رشتہ ) ہے؟ \" میں نے عرض کی : جی ہاں ، حمزہ رضی اللہ عنہ کی بیٹی ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ میرے لیے حلال نہیں ( کیونکہ ) وہ میرے رضاعی بھائی کی بیٹی ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3582,
			"arabicnumber": "1446.02",
			"text": "جریر ، عبداللہ بن نمیر اور سفیان سب نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3583,
			"arabicnumber": "1447.01",
			"text": "ہمام نے ہمیں حدیث بیان کی ، کہا : ہمیں قتادہ نے جابر بن زید سے حدیث بیان کی ، انہوں نے ابن عباس رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم سے حضرت حمزہ رضی اللہ عنہ کی بیٹی ( کے ساتھ نکاح کرنے ) کے بارے میں خواہش کا اظہار کیا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ میرے لیے حلال نہیں کیونکہ وہ میرے رضاعی بھائی کی بیٹی ہے اور رضاعت سے وہ سب رشتے حرام ہو جاتے ہیں جو رحم ( ولادت اور نسب ) سے حرام ہوتے ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3584,
			"arabicnumber": "1447.02",
			"text": "یحییٰ قطان اور بشر بن عمر نے شعبہ سے حدیث بیان کی ، شعبہ اور سعید بن ابی عروبہ دونوں نے قتادہ سے ہمام کی ( سابقہ ) سند کے ساتھ بالکل اسی طرح روایت کی ، مگر شعبہ کی حدیث آپ صلی اللہ علیہ وسلم کے قول : \" میرے رضاعی بھائی کی بیٹی ہے \" پر ختم ہو گئی اور سعید کی حدیث میں ہے : \" رضاعت سے وہ رشتے حرام ہو جاتے ہیں جو نسب سے حرام ہوتے ہیں ۔ \" اور بشر بن عمر کی روایت میں ( جابر بن زید سے روایت ہے کی بجائے یہ ) ہے : \" میں نے جابر بن زید سے سنا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3585,
			"arabicnumber": "1448",
			"text": "نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت ام سلمہ رضی اللہ عنہا فرماتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم سے عرض کی گئی : اللہ کے رسول! آپ حمزہ رضی اللہ عنہ کی بیٹی ( کے ساتھ نکاح کرنے ) سے ( دور یا قریب ) کہاں ہیں؟ یا کہا گیا : کیا آپ حمزہ بن عبدالمطلب رضی اللہ عنہ کی بیٹی کو نکاح کا پیغام نہیں بھیجیں گے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" حمزہ رضاعت کی بنا پر یقینی طور پر میرے بھائی ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3586,
			"arabicnumber": "1449.01",
			"text": "ابواسامہ نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشام نے خبر دی ، کہا : مجھے میرے والد ( عروہ بن زبیر ) نے زینب بنت ام سلمہ رضی اللہ عنہا سے خبر دی ، انہوں نے ام حبیبہ بنت ابو سفیان رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے ، میں نے آپ سے عرض کی : کیا آپ میری بہن ( عَزہ ) بنت ابوسفیان کے بارے میں کوئی سوچ رکھتے ہیں؟ آپ نے پوچھا : \" میں کیا کروں؟ \" میں نے عرض کی : آپ اس سے نکاح کر لیں ، آپ نے فرمایا : \" کیا تم اس بات کو پسند کرتی ہو؟ \" میں نے عرض کی : میں اکیلی ہی آپ کی بیوی نہیں ہوں اور اپنے ساتھ خیر میں شریک ہونے ( کے معاملے ) میں ( میرے لیے ) سب سے زیادہ محبوب میری بہن ہے ۔ آپ نے فرمایا : \" وہ میرے لیے حلال نہیں ہے ۔ \" میں نے عرض کی : مجھے خبر دی گئی ہے کہ آپ دُرہ بنت ابوسلمہ رضی اللہ عنہا کے لیے نکاح کا پیغام بھیج رہے ہیں ۔ آپ نے پوچھا : \" ام سلمہ کی بیٹی کے لئے؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے فرمایا : \" اگر وہ میری گود میں پروردہ ( ربیبہ ) نہ ہوتی تو بھی میرے لیے حلال نہ تھی ، وہ میرے رضاعی بھائی کی بیٹی ہے ، مجھے اور اس کے والد کو ثوبیہ نے دودھ پلایا تھا ، اس لیے تم خواتین میرے سامنے اپنی بیٹیوں اور بہنوں کے بارے میں پیش کش نہ کیا کرو",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3587,
			"arabicnumber": "1449.02",
			"text": "یحییٰ بن زکریا بن ابی زائدہ اور زہیر دونوں نے ہشام بن عروہ سے اسی سند کے ساتھ بالکل اسی طرح حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3588,
			"arabicnumber": "1449.03",
			"text": "یزید بن ابوحبیب سے روایت ہے کہ محمد بن شہاب ( زہری ) نے ( ان کی طرف ) یہ بیان کرتے ہوئے لکھا کہ عروہ نے انہیں حدیث سنائی ، زینب بنت ابوسلمہ رضی اللہ عنہا نے انہیں حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ ام حبیبہ رضی اللہ عنہا نے ان سے بیان کیا ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی ، اے اللہ کے رسول! میری بہن عزہ سے نکاح کر لیجئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے پوچھا : \" کیا تم یہ پسند کرو گی؟ \" انہوں نے کہا : جی ہاں ، اللہ کے رسول! میں اکیلی آپ کی بیوی تو ہوں نہیں ، اور ( مجھے ) سب سے زیادہ محبوب ، جو خیر میں میرے ساتھ شریک ہو ، میری بہن ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ میرے لیے حلال نہیں ہے ۔ \" انہوں نے کہا : میں نے عرض کی : اے اللہ کے رسول! ہم سے یہ بات کی جاتی ہے کہ آپ درہ بنت ابوسلمہ رضی اللہ عنہا سے نکاح کرنا چاہتے ہیں ۔ آپ نے پوچھا : \" کیا ابوسلمہ کی بیٹی سے؟ \" انہوں نے جواب دیا : جی ہاں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر وہ میری گود کی پروردہ ( ربیبہ ) نہ ہوتی تو بھی میرے لیے حلال نہ تھی ، وہ میرے رضاعی بھائی کی بیٹی ہے ، مجھے اور اس کے والد ابوسلمہ کو ثوبیہ نے دودھ پلایا تھا ، اس لیے تم مجھے اپنی بیٹیوں اور بہنوں ( کے ساتھ نکاح ) کی پیش کش نہ کیا کرو",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3589,
			"arabicnumber": "1449.04",
			"text": "عقیل بن خالد اور محمد بن عبداللہ بن مسلم دونوں نے زہری سے ابن ابی حبیب کی ( سابقہ ) سند کے ساتھ اسی کی حدیث کے ہم معنی حدیث بیان کی اور یزید بن ابی حبیب کے سوا ان میں سے کسی نے اپنی حدیث میں عزہ ( بنت ابی سفیان رضی اللہ عنہا ) کا نام نہیں لیا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3590,
			"arabicnumber": "1450",
			"text": "زہیر بن حرب ، محمد بن عبداللہ بن نمیر اور سوید بن سعید نے ، اپنی اپنی سندوں سے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ سوید اور زہیر نے کہا : بے شک نبی صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ : \" ( دودھ کی ) ایک یا دو چسکیاں حرمت کا سبب نہیں بنتیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3591,
			"arabicnumber": "1451.01",
			"text": "یحییٰ بن یحییٰ ، عمرو ناقد اور اسحاق بن ابراہیم سب نے معتمر سے حدیث بیان کی ۔ ۔ الفاظ یحییٰ کےہیں ۔ ۔ کہا : ہمیں معتمر بن سلیمان نے ایوب سے خبر دی ، وہ ابوخلیل سے حدیث بیان کر رہے تھے ، انہوں نے عبداللہ بن حارث سے ، انہوں نے ام فضل رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : ایک اعرابی اللہ کے نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا جبکہ آپ میرے گھر میں تشریف فرما تھے ، اس نے عرض کی : اے اللہ کے نبی! ( پہلے ) میری ایک بیوی تھی ، اس پر میں نے دوسری سے شادی کر لی ، میری پہلی بیوی کا خیال ہے کہ اس نے میری نئی بیوی کو ایک یا دو مرتبہ دودھ پلایا تھا ۔ تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" ایک دو مرتبہ دودھ دینا ( رشتے کو ) حرام نہیں کرتا ۔ \" عمرو نے اپنی روایت میں کہا : عبداللہ بن حارث بن نوفل سے روایت ہے ( عبداللہ کے والد کے ساتھ دادا کا نام بھی لیا)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3592,
			"arabicnumber": "1451.02",
			"text": "ہشام نے مجھے قتادہ سے حدیث بیان کی ، انہوں نے ابوخلیل صالح بن ابی مریم سے ، انہوں نے عبداللہ بن حارث سے اور انہوں نے ام فضل رضی اللہ عنہا سے روایت کی کہ بنو عامر بن صعصعہ کے ایک آدمی نے کہا : اے اللہ کے نبی! کیا ایک مرتبہ دودھ پینا رشتوں کو حرام کر دیتا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3593,
			"arabicnumber": "1451.03",
			"text": "ہمیں محمد بن بشر نے حدیث بیان کی ، کہا : ہمیں سعید بن ابی عروبہ نے قتادہ سے باقی ماندہ سابقہ سند کے ساتھ عبداللہ بن حارث سے روایت کی کہ ام فضل رضی اللہ عنہا نے حدیث بیان کی ، اللہ کے نبی صلی اللہ علیہ وسلم نے فرمایا : \" ایک یا دو مرتبہ دودھ پینا یا ایک دو مرتبہ دودھ چوسنا حرمت کا سبب نہیں بنتا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3594,
			"arabicnumber": "1451.04",
			"text": "ابوبکر بن ابی شیبہ اور اسحاق بن ابراہیم دونوں نے عبدہ بن سلیمان سے اور انہوں نے ابن ابو عروبہ سے اسی سند کے ساتھ روایت کی لیکن اسحاق نے ابن بشر کی روایت کی طرح کہا : \" یا دو مرتبہ دودھ پینا یا دو مرتبہ دودھ چوسنا \" اور ابن ابی شیبہ نے کہا : \" اور دو مرتبہ دودھ پینا اور دو مربہ دودھ چوسنا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3595,
			"arabicnumber": "1451.05",
			"text": "حماد بن سلمہ نے ہمیں قتادہ سے باقی ماندہ اسی سند کے ساتھ ام فضل رضی اللہ عنہا سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" ایک دو مرتبہ دودھ دینا حرمت کا سبب نہیں بنتا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3596,
			"arabicnumber": "1451.06",
			"text": "ہمام نے ہمیں حدیث بیان کی ، کہا : ہمیں قتادہ نے باقی ماندہ اسی سند کے ساتھ ام فضل رضی اللہ عنہا سے روایت کی کہ ایک آدمی نے نبی صلی اللہ علیہ وسلم سے سوال کیا : کیا ایک مرتبہ دودھ چوسنا ( رشتے کو ) حرام کر دیتا ہے؟ تو آپ نے جواب دیا : \" نہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3597,
			"arabicnumber": "1452.01",
			"text": "عبداللہ بن ابی بکرہ نے عمرہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : قرآن میں نازل کیا گیا تھا کہ دس بار دودھ پلانا جن کا علم ہو ، حرمت کا سبب بن جاتا ہے ، پھر انہیں پانچ بار دودھ پلانے ( کے حکم ) سے جن کا علم ہو ، منسوخ کر دیا گیا ، رسول اللہ صلی اللہ علیہ وسلم فوت ہوئے تو یہ ان آیات میں تھی جن کی ( نسخ کا حکم نہ جاننے والے بعض لوگوں کی طرف سے ) قرآن میں تلاوت کی جاتی تھی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3598,
			"arabicnumber": "1452.02",
			"text": "سلیمان بن بلال نے ہمیں یحییٰ بن سعید سے حدیث بیان کی ، انہوں نے عمرہ سے روایت کی کہ انہوں نے حضرت عائشہ رضی اللہ عنہا سے سنا ۔ ۔ ۔ وہ اس رضاعت کا ذکر کر رہی تھیں جس سے حرمت ثابت ہوتی ہے ۔ عمرہ نے کہا : حضرت عائشہ رضی اللہ عنہا نے کہا : قرآن میں دس بار دودھ پلانے سے جن کا علم ہو ، ( حرمت ثابت ہونے ) کا حکم نازل ہوا تھا ، پھر یہ ( حکم ) بھی نازل ہوا تھا : پانچ بار دودھ پلانے سے جن کا علم ہو",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3599,
			"arabicnumber": "1452.03",
			"text": "عبدالوہاب نے ہمیں حدیث بیان کی ، کہا : میں نے یحییٰ بن سعید سے سنا ، انہوں نے کہا : مجھے عمرہ نے خبر دی کہ انہوں نے حضرت عائشہ رضی اللہ عنہا سے سنا وہ کہہ رہی تھیں ۔ ۔ ( آگے ) اسی کے مانند ( ہے)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3600,
			"arabicnumber": "1453.01",
			"text": "عمرو ناقد اور ابن ابی عمر نے کہا : ہمیں سفیان بن عیینہ نے عبدالرحمٰن بن قاسم سے حدیث بیان کی ، انہوں نے اپنے والد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : سہلہ بنت سہیل رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کی : اے اللہ کے رسول! میں سالم رضی اللہ عنہ کے گھر آنے کی بنا پر ( اپنے شوہر ) ابوحذیفہ رضی اللہ عنہ کے چہرے میں ( تبدیلی ) دیکھتی ہوں ۔ ۔ حالانکہ وہ ان کا حلیف بھی ہے ۔ ۔ تو نبی صلی اللہ علیہ وسلم نے فرمایا : \"\" اسے دودھ پلا دو ۔ \"\" انہوں نے عرض کی : میں اسے کیسے دودھ پلاؤں؟ جبکہ وہ بڑا ( آدمی ) ہے ۔ رسول اللہ صلی اللہ علیہ وسلم مسکرائے اور فرمایا : \"\" میں اچھی طرح جانتا ہوں کہ وہ بڑا آدمی ہے ۔ \"\" عمرو نے اپنی حدیث میں یہ اضافہ کیا : اور وہ ( سالم ) بدر میں شریک ہوئے تھے ۔ اور ابن ابی عمر کی روایت میں ہے : \"\" رسول اللہ صلی اللہ علیہ وسلم ہنس پڑے ۔ \"\" ( آپ کا مقصود یہ تھا کہ کسی برتن میں دودھ نکال کر سالم رضی اللہ عنہ کو پلوا دیں)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3601,
			"arabicnumber": "1453.02",
			"text": "ایوب نے ابن ابی مُلیکہ سے ، انہوں نے قاسم سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ ابوحذیفہ رضی اللہ عنہ کے مولیٰ سالم رضی اللہ عنہ ، ابوحذیفہ رضی اللہ عنہ اور ان کی اہلیہ کے ساتھے ان کے گھر ہی میں ( قیام پذیر ) تھے ۔ تو ( ان کی اہلیہ ) یعنی ( سہلہ ) بنت سہیل رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور عرض کی : سالم مردوں کی ( حد ) بلوغت کو پہنچ چکا ہے اور وہ ( عورتوں کے بارے میں ) وہ سب سمجھنے لگا ہے جو وہ سمجھتے ہیں اور وہ ہمارے ہاں ( گھر میں ) آتا ہے اور میں خیال کرتی ہوں کہ ابوحذیفہ رضی اللہ عنہ کے دل میں اس سے کچھ ( ناگواری ) ہے ۔ تو نبی صلی اللہ علیہ وسلم نے ان سے فرمایا : \" تم اسے دودھ پلا دو ، اس پر حرام ہو جاؤ گی اور وہ ( ناگواری ) دور ہو جائے گی جو ابوحذیفہ رضی اللہ عنہ کے دل میں ہے ۔ \" چنانچہ وہ دوبارہ آپ کے پاس آئی اور کہا : میں نے اسے دودھ پلوا دیا ہے تو ( اب ) وہ ناگواری دور ہو گئی جو ابوحذیفہ کے دل میں تھی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3602,
			"arabicnumber": "1453.03",
			"text": "ابن جریج نے ہمیں خبر دی ، کہا : ہمیں ابن ابی ملیکہ نے بتایا ، انہیں قاسم بن محمد بن ابی بکر نے خبر دی ، انہیں حضرت عائشہ رضی اللہ عنہا نے بتایا کہ سہلہ بنت سہیل بن عمرو رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئیں اور کہا : اللہ کے رسول! سالم ۔ ۔ ( انہوں نے ) سالم مولیٰ ابی حذیفہ رضی اللہ عنہ کے بارے میں ( کہا : ) ۔ ۔ ہمارے ساتھ ہمارے گھر میں رہتا ہے ۔ وہ مردوں کی حد بلوغٹ کو پہنچ چکا ہے اور وہ ( سب کچھ ) جاننے لگا ہے جو مرد جانتے ہیں ۔ آپ نے فرمایا : \" تم اسے دودھ پلا دو تو تم اس پر حرام ہو جاؤ گی ۔ \" ( گویا یہ حکم صرف حضرت سہلہ کے لیے تھا ۔ ) ( ابن ابی ملیکہ نے ) کہا : میں سال بھر یا اس کے قریب ٹھہرا ، میں نے یہ حدیث بیان نہ کی ، میں اس ( کو بیان کرنے ) سے ڈرتا رہا ، پھر میں قاسم سے ملا تو میں نے انہیں کہا : آپ نے مجھے ایک حدیث سنائی تھی ، جو میں نے اس کے بعد کبھی بیان نہیں کی ، انہوں نے پوچھا : وہ کون سی حدیث ہے؟ میں نے انہیں بتائی ، انہوں نے کہا : اسے میرے حوالے سے بیان کرو کہ حضرت عائشہ رضی اللہ عنہا نے مجھے اس کی خبر دی تھی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3603,
			"arabicnumber": "1453.04",
			"text": "شعبہ نے حُمَید بن نافع سے حدیث بیان کی ، انہوں نے زینب بنت ام سلمہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : حضرت ام سلمہ رضی اللہ عنہا نے حضرت عائشہ رضی اللہ عنہا سے کہا : آپ کے پاس ( گھر میں ) ایک قریب البلوغت لڑکا آتا ہے جسے میں پسند نہیں کرتی کہ وہ میرے پاس آئے ۔ حضرت عائشہ رضی اللہ عنہا نے جواب دیا : کیا تمہارے لیے رسول اللہ صلی اللہ علیہ وسلم ( کی زندگی ) میں نمونہ نہیں ہے؟ انہوں نے ( آگے ) کہا : ابوحذیفہ رضی اللہ عنہ کی بیوی نے عرض کی تھی : اے اللہ کے رسول! سالم میرے سامنے آتا ہے اور ( اب ) وہ مرد ہے ، اور اس وجہ سے ابوحذیفہ رضی اللہ عنہ کے دل میں کچھ ناگواری ہے ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اسے دودھ پلا دو تاکہ وہ تمہارے پاس آ سکے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3604,
			"arabicnumber": "1453.05",
			"text": "بُکَیر سے روایت ہے ، انہوں نے کہا : میں نے حمید بن نافع سے سنا وہ کہہ رہے تھے ، میں نے زینب بنت ابی سلمہ رضی اللہ عنہا سے سنا وہ کہہ رہی تھیں : میں نے نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ ام سلمہ رضی اللہ عنہا سے سنا وہ حضرت عائشہ رضی اللہ عنہا سے کہہ رہی تھیں : اللہ کی قسم! میرے دل کو یہ بات اچھی نہیں لگتی کہ مجھے کوئی ایسا لڑکا دیکھے جو رضاعت سے مستغنی ہو چکا ہے ۔ انہوں نے پوچھا : کیوں؟ سہلہ بنت سہیل رضی اللہ عنہا رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی تھیں ، انہوں نے عرض کی تھی : اے اللہ کے رسول! اللہ کی قسم! میں سالم کے ( گھر میں ) داخلے کی وجہ سے ابوحذیفہ رضی اللہ عنہ کے چہرے پر ناگواری سی محسوس کرتی ہوں ، کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اسے دودھ پلا دو ۔ \"\" اس نے کہا : وہ تو داڑھی والا ہے ۔ آپ نے فرمایا : \"\" اسے دودھ پلا دو ، اس سے وہ ناگواری ختم ہو جائے گی جو ابوحذیفہ کے چہرے پر ہے ۔ \"\" ( سہلہ رضی اللہ عنہا نے ) کہا : اللہ کی قسم! ( اس کے بعد ) میں نے ابوحذیفہ رضی اللہ عنہا کے چہرے پر ( کبھی ) ناگواری محسوس نہیں کی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3605,
			"arabicnumber": "1454",
			"text": "ابوعبیدہ بن عبداللہ بن زمعہ نے مجھے خبر دی کہ ان کی والدہ زینب بنت ابی سلمہ رضی اللہ عنہا نے انہیں بتایا کہ ان کی والدہ نبی صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت ام سلمہ رضی اللہ عنہاکہا کرتی تھیں : نبی صلی اللہ علیہ وسلم کی تمام ازواج نے اس بات سے انکار کیا کہ اس ( بڑی عمر کی ) رضاعت کی وجہ سے کسی کو اپنے گھر میں داخل ہونے دیں ، اور انہوں نے عائشہ رضی اللہ عنہا سے کہا : اللہ کی قسم! ہم اسے محض رخصت خیال کرتی ہیں جو رسول اللہ صلی اللہ علیہ وسلم نے خاص طور پر سالم رضی اللہ عنہ کو دی تھی ، لہذا اس ( طرح کی ) رضاعت کی وجہ سے نہ کوئی ہمارے پاس آنے والا بن سکے گا اور نہ ہمیں دیکھنے والا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 3606,
			"arabicnumber": "1455.01",
			"text": "ابواحوص نے ہمیں اشعث سے حدیث بیان کی ، انہوں نے اپنے والد سے ، اور انہوں نے مسروق سے روایت کی ، انہوں نے کہا : حضرت عائشہ رضی اللہ عنہا نے کہا : رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے جبکہ میرے پاس ایک آدمی بیٹھا ہوا تھا ۔ یہبات آپ پر گراں گزری ، اور میں نے آپ کے چہرے پر غصہ دیکھا ، کہا : تو میں نے عرض کی : اللہ کے رسول! یہ رضاعت ( کے رشتے سے ) میرا بھائی ہے ، کہا : تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( تم خواتین ) اپنے رضاعی بھائیوں ( کے معاملے ) کو دیکھ لیا کرو ( اچھی طرح غور کر لیا کرو ) کیونکہ رضاعت بھوک ہی سے ( معتبر ) ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 3607,
			"arabicnumber": "1455.02",
			"text": "شعبہ ، سفیان اور زائدہ سب نے اشعث بن ابو شعثاء سے ابواحوص کی سند کے ساتھ اسی کی حدیث کے ہم معنی حدیث بیان کی ، مگر انہوں نے ( بھی ) من المجاعة کے الفاظ کہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 3608,
			"arabicnumber": "1456.01",
			"text": "یزید بن زُرَیع نے ہمیں حدیث بیان کی ، کہا : ہمیں سعید بن ابوعروبہ نے قتادہ سے حدیث بیان کی ، انہوں نے ابوخلیل صالح سے ، انہوں نے ابوعلقمہ ہاشمی سے اور انہوں نے ابوسعید خدری رضی اللہ عنہ سے روایت کی کہ حنین کے دن ( جنگ میں فتح حاصل کرنے کے بعد ) رسول اللہ صلی اللہ علیہ وسلم نے اوطاس کی جانب ایک لشکر بھیجا ، ان کا دشمن سے سامنا ہوا ، انہوں نے ان ( دشمنوں ) سے لڑائی کی ، پھر ان پر غالب آ گئے اور ان میں سے کنیزیں حاصل کر لیں ، تو رسول اللہ صلی اللہ علیہ وسلم کے اصحاب میں سے بعض لوگوں نے ان کے مشرک خاوندوں ( کی موجودگی ) کی بنا پر ان سے مجامعت کرنے میں حرج محسوس کیا ، اس پر اللہ عزوجل نے اس کے بارے میں ( یہ آیت ) نازل فرمائی : \" اور شادی شدہ عورتیں ( بھی حرام ہیں ) سوائے ان ( لونڈیوں ) کے جن کے مالک تمہارے دائیں ہاتھ ہوں ۔ \" یعنی جب ان کی عدت پوری ہو جائے تو ( تمہاری لونڈیاں بن جانے کی بنا پر ) وہ تمہارے لیے حلال ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 3609,
			"arabicnumber": "1456.02",
			"text": "عبدالاعلی نے ہمیں سعید سے حدیث بیان کی ، انہوں نے قتادہ سے ، انہوں نے ابوخلیل سے روایت کی کہ ابوعلقمہ ہاشمی نے حدیث بیان کی ، انہیں حضرت ابوسعید خدری رضی اللہ عنہ نے حدیث بیان کی کہ اللہ کے نبی صلی اللہ علیہ وسلم نے حنین کے دن ایک سریہ بھیجا ۔ ۔ ۔ ( آگے ) یزید بن زریع کی حدیث کے ہم معنی ہے لیکن انہوں نے کہا : سوائے ان ( لونڈیوں ) کے جن کے مالک تمہارے دائیں ہاتھ ہوں ، وہ تمہارے لیے حلال ہیں ۔ اور انہوں نے \" جب ان کی عدت پوری ہو جائے \" کے الفاظ ذکر نہیں کیے ۔ ( اس سریہ میں جو کنیزیں ہاتھ آئیں یہ واقعہ ان کے بارے میں ہے)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 3610,
			"arabicnumber": "1456.03",
			"text": "شعبہ نے قتادہ سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 3611,
			"arabicnumber": "1456.04",
			"text": "شعبہ نے ہمیں قتادہ سے حدیث بیان کی ، انہوں نے ابوخلیل سے اور انہوں نے حضرت ابوسعید رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : اوطاس کے دن صحابہ کو لونڈیاں ملیں جن کے خاوند بھی تھے ، اس پر وہ ( ان سے تعلقات ، قائم کرتے ہوئے ) ڈرے ( کہ یہ گناہ نہ ہو ) اس پر یہ آیت نازل کی گئی : \" اور شادی شدہ عورتیں ( بھی حرام ہیں ) سوائے ان ( لونڈیوں ) کے جن کے تمہارے دائیں ہاتھ مالک ہو جائیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 3612,
			"arabicnumber": "1456.05",
			"text": "سعید نے قتادہ سے اسی سند کے ساتھ اسی طرح حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 3613,
			"arabicnumber": "1457.01",
			"text": "قتیبہ بن سعید اور محمد بن رُمح نے کہا : لیث نے ہمیں ابن شہاب سے خبر دی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : سعد بن ابی وقاص اور عبد بن زمعہ رضی اللہ عنہما نے ایک لڑکے کے بارے میں جھگڑا کیا ۔ سعد رضی اللہ عنہ نے کہا : اللہ کے رسول! یہ میرے بھائی عتبہ بن ابی وقاص کا بیٹا ہے ، اس نے مجھے وصیت کی تھی کہ یہ اس کا بیٹا ہے ، آپ اس کی مشابہت دیکھ لیں ۔ عبد بن زمعہ رضی اللہ عنہ نے کہا : یہ میرا بھائی ہے ، اللہ کے رسول! یہ میرے باپ کی لونڈی سے اسی کے بستر پر پیدا ہوا ہے ، رسول اللہ صلی اللہ علیہ وسلم نے اس کی مشابہت دیکھی تو آپ نے واضھ طور پر عتبہ کے ساتھ مشابہت ( بھی ) محسوس کی ، اس کے بعد آپ نے فرمایا : \"\" عبد! یہ تمہارا ( بھائی ) ہے ۔ ( اس کا سبب یہ ہے کہ ) بچہ صاحب فراش کا ہے ، اور زنا کرنے والے کے لیے پتھر ( ناکامی اور محرومی ) ہے ۔ اور سودہ بنت زمعہ! ( تم ) اس سے پردہ کرو ۔ \"\" اس کے بعد اس نے کبھی حضرت سودہ رضی اللہ عنہا کو نہیں دیکھا ۔ اور محمد بن رمح نے آپ کے الفاظ \"\" يا عبد \"\" ذکر نہیں کیے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 3614,
			"arabicnumber": "1457.02",
			"text": "سفیان بن عیینہ اور معمر نے زہری سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی ۔ لیکن معمر اور ابن عیینہ کی حدیث میں ہے : \" بچہ صاحب فراش کا ہے \" اور ان دونوں نے \" زانی کے لیے پتھر ہے \" کے الفاظ ذکر نہیں کیے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 3615,
			"arabicnumber": "1458.01",
			"text": "معمر نے زہری سے خبر دی ، انہوں نے ابن مسیب اور ابوسلمہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بچہ بستر والے کا ہے اور زانی کے لیے پتھر ( ناکامی اور محرومی ) ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 3616,
			"arabicnumber": "1458.02",
			"text": "سعید بن منصور ، زہیر بن حرب ، عبدالاعلیٰ بن حماد اور عمرو ناقد سب نے کہا : ہمیں سفیان نے زہری سے خبر دی ۔ ابن منصور نے کہا : سعید نے ابوہریرہ رضی اللہ عنہ سے روایت کی ۔ عبدالاعلی نے کہا : ابوسلمہ سے یا سعید سے روایت ہے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی ۔ زہیر نے کہا : سعید یا ابوسلمہ نے ان دونوں میں سے ایک نے یا دونوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی ۔ اور عمرو نے ایک بار کہا : ہمیں سفیان نے زہری کے حوالے سے سعید اور ابوسلمہ سے ، اور ایک بار کہا : سعید یا ابوسلمہ سے ، اور ایک بار کہا : سعید نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ ۔ ( آگے ) جس طرح معمر کی حدیث ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 3617,
			"arabicnumber": "1459.01",
			"text": "لیث نے ہمیں ابن شہاب سے حدیث بیان کی ، انہوں نے عروہ سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم خوش خوش میرے پاس تشریف لائے ، آپ کے چہرے ( پیشانی ) کے خطوط چمک رہے تھے ، آپ نے فرمایا : \" تم نے دیکھا نہیں کہ ابھی ابھی ( بنو مدلج کے قیافہ شناس ) مُجزز نے زید بن حارثہ اور اسامہ بن زید رضی اللہ عنہما کو دیکھا ہے ، اور کہا ہے : ان قدموں میں سے ایک ( قدم ) دوسرے میں سے ہے ۔ \" ( ایک بیٹے کا ہے ، دوسرا باپ کا)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 3618,
			"arabicnumber": "1459.02",
			"text": "سفیان نے ہمیں زہری سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : ایک روز رسول اللہ صلی اللہ علیہ وسلم خوش خوش میرے پاس تشریف لائے ۔ اور فرمایا : \" عائشہ! کیا تم نے دیکھا نہیں کہ مجزز مدلجی میرے پاس آیا ، اس نے اسامہ اور زید کو دیکھا ، ان دونوں پر ایک چادر تھی جس نے ان کے سروں کو ڈھانپا ہوا تھا اور ان کے پاؤں ننگے تھے تو اس نے کہا : بلاشبہ یہ قدم ایک دوسرے میں سے ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 3619,
			"arabicnumber": "1459.03",
			"text": "ابراہیم بن سعد نے ہمیں زہری سے حدیث بیان کی ، انہوں نے عروہ سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : ایک قیافہ شناس آیا ، رسول اللہ صلی اللہ علیہ وسلم بھی موجود تھے ، اسامہ بن زید اور زید بن حارثہ رضی اللہ عنہم ( ایک چادر میں ) لیٹے ہوئے تھے تو اس نے کہا : بلاشبہ یہ قدم ایک دوسرے میں سے ہیں ۔ اس سے نبی صلی اللہ علیہ وسلم کو خوشی ہوئی اور آپ کو بہت اچھا لگا ، آپ نے یہ بات حضرت عائشہ رضی اللہ عنہا کو بھی بتائی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 3620,
			"arabicnumber": "1459.04",
			"text": "یونس ، معمر اور ابن جریج سب نے زہری سے اسی سند کے ساتھ ، ان ( لیث ، سفیان اور ابراہیم بھی سعد ) کی حدیث کے ہم معنی روایت بیان کی اور ( ابن وہب نے ) یونس کی حدیث میں یہ اضافہ کیا : اور مجزز ایک قیافہ شاس تھا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 3621,
			"arabicnumber": "1460.01",
			"text": "محمد بن ابوبکر نے عبدالملک بن ابوبکر بن عبدالرحمٰن بن حارث بن ہشام سے ، انہوں نے اپنے والد سے ، انہوں نے ام سلمہ رضی اللہ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے جب ام سلمہ رضی اللہ عنہا سے شادی کی تو ان کے ہاں تین دن قیام کیا اور فرمایا : \" اپنے اہل ( شوہر ) کے نزدیک تمہاری قدر و منزلت میں کسی طرح کی کمی نہیں ، اگر تم چاہو تو میں تمہارے پاس ( قیام کے لیے ) سات دن رکھ لیتا ہوں اور اگر میں نے تمہارے ہاں سات دن قیام کیا تو اپنی ساری بیویوں کے ہاں سات سات دن قیام کروں گا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 3622,
			"arabicnumber": "1460.02",
			"text": "عبداللہ بن ابوبکر نے عبدالملک بن ابوبکر سے ، انہوں نے ابوبکر بن عبدالرحمٰن سے روایت کی کہ جب رسول اللہ صلی اللہ علیہ وسلم نے ام سلمہ رضی اللہ عنہا سے نکاح کیا اور وہ آپ صلی اللہ علیہ وسلم کے پاس رہائش پذیر ہو گئیں تو آپ صلی اللہ علیہ وسلم نے ان سے کہا : \" اپنے شوہر کے سامنے تمہارے مرتبے میں کوئی کمی نہیں ، اگر تم چاہو تو میں تمہارے ہاں سات دن قیام کروں گا ، اور اگر تم چاہو تو تین دن قیام کروں گا پھر ( باری باری ) سب کے ہاں جانا شروع کروں گا ۔ \" ام سلمہ رضی اللہ عنہا نے جواب دیا : آپ تین دن قیام فرمائیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 3623,
			"arabicnumber": "1460.03",
			"text": "سلیمان بن بلال نے ہمیں عبدالرحمٰن بن حُمَید سے حدیث بیان کی ، انہوں نے عبدالملک بن ابوبکر سے ، انہوں نے ابوبکر بن عبدالرحمٰن سے روایت کی کہ جب رسول اللہ صلی اللہ علیہ وسلم نے ام سلمہ رضی اللہ عنہا سے نکاح کیا تو آپ ان کے پاس گئے ، اس کے بعد آپ نے نکلنے کا ارادہ کیا تو انہوں نے آپ کے کپڑے کو پکڑ لیا ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم چاہو تو میں مزید تمہارے ہاں قیام کروں گا اور تمہارے ساتھ اس کا حساب رکھوں گا ، کنواری کے لیے سات راتیں ہیں اور ثیبہ ( دوہاجو ) کے لیے تین راتیں ہیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 3624,
			"arabicnumber": "1460.04",
			"text": "ابوضمرہ نے عبدالرحمٰن بن حمید سے اسی سند کے ساتھ اسی کے مانند روایت کی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 3625,
			"arabicnumber": "1460.05",
			"text": "عبدالواحد بن ایمن نے ابوبکر بن عبدالرحمٰن سے ، انہوں نے ام سلمہ رضی اللہ عنہا سے روایت کی ، انہوں ( عبدالواحد ) نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے ان ( ام سلمہ رضی اللہ عنہا ) سے شادی کی ، اور بہت سی باتوں کا ذکر کیا ، ان میں یہ بات بھی تھی : آپ نے فرمایا : \" اگر تم چاہو کہ میں تمہارے ہاں سات سات دن قیام کروں ( تو ہو سکتا ہے ) اور اگر میں نے تمہارے ہاں سات دن قیام کیا تو اپنی ساری بیویوں کے ہاں سات سات دن قیام کروں گا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 3626,
			"arabicnumber": "1461.01",
			"text": "ہشیم نے ہمیں خالد سے خبر دی ، انہوں نے ابوقلابہ سے ، انہوں نے انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : جب کوئی دوہاجو جو ( ثیبہ ) کے بعد باکرہ سے شادی کرے تو اس کے ہاں سات دن قیام کرے اور جب باکرہ کے بعد کسی ثیبہ سے شادی کرے تو اس کے ہاں تین دن قیام کرے ۔ خالد نے کہا : اگر میں کہوں کہ انہوں نے اسے مرفوعا بیان کیا ہے ، تو میں سچ کہوں گا لیکن انہوں نے کہا تھا : سنت اسی طرح ہے ۔ ( یہ حدیث کو مرفوع کرنے کے مترادف ہے)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 3627,
			"arabicnumber": "1461.02",
			"text": "سفیان نے ایوب اور خالد حذاء سے خبر دی ، انہوں نے ابوقلابہ سے ، انہوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : سنت میں سے ہے کہ ( دلہا ) باکرہ کے ہاں سات راتیں قیام کرے ۔ خالد نے کہا : اگر میں چاہوں تو کہہ سکتا ہوں : انہوں نے اسے نبی صلی اللہ علیہ وسلم سے مرفوعا بیان کیا ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 3628,
			"arabicnumber": "1462",
			"text": "حضرت انس رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : نبی صلی اللہ علیہ وسلم کی نو بیویاں تھیں ، جب آپ ان میں باری تقسیم فرماتے تو پہلی باری والی بیوی کے پاس نویں رات ہی پہنچتے ۔ وہ سب ہر رات اس ( بیوی کے ) گھر میں جمع ہو جاتی تھیں جہاں نبی صلی اللہ علیہ وسلم تشریف فرما ہوتے ، حضرت زینب رضی اللہ عنہا آئیں تو آپ نے اپنا ہاتھ ان کی طرف پھیلایا ۔ انہوں ( عائشہ رضی اللہ عنہا ) نے کہا : یہ زینب ہیں آپ نے اپنا ہاتھ روک لیا ، اس پر ان دونوں میں تکرار ہو گئی حتی کہ ان کی آوازیں بلند ہو گئیں ، اور ( اسی دوران میں ) نماز کی اامت ہو گئی ، حضرت ابوبکر رضی اللہ عنہ کا وہاں سے گزر ہوا ، انہوں نے ان کی آوازیں سنیں تو کہا : اے اللہ کے رسول! آپ نماز کے لیے تشریف لائیے اور ان کے منہ میں مٹی ڈالیے ۔ نبی صلی اللہ علیہ وسلم باہر تشریف لائے تو حضرت عائشہ رضی اللہ عنہا نے کہا : ابھی نبی صلی اللہ علیہ وسلم اپنی نماز پوری کریں گے تو ابوبکر رضی اللہ عنہ آئیں گے وہ مجھے ایسے ایسے ( ڈانٹ ڈپٹ ) کریں گے ۔ جب نبی صلی اللہ علیہ وسلم نے نماز مکمل کی ، ابوبکر رضی اللہ عنہ ان ( حضرت عائشہ رضی اللہ عنہا ) کے پاس آئے اور انہیں سخت سرزنش کی ۔ اور کہا : کیا تم ایسا کرتی ہو؟",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 3629,
			"arabicnumber": "1463.01",
			"text": "جریر نے ہمیں ہشام بن عروہ سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ بن زبیر ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : میں نے کوئی عورت نہیں دیکھی جو مجھے سودہ بنت زمعہ رضی اللہ عنہا کی نسبت زیادہ پسندیدہ ہو کہ میں اس کے پیکر میں ہوں ( اس جیسی بن جاؤں ) ایک ایسی خاتون کی نسبت جن میں کچھ گرم مزاجی ( بھی ) تھی ، کہا : جب وہ بوڑھی ہو گئیں تو انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اپنی باری کا دن حضرت عائشہ رضی اللہ عنہا کو دے دیا ۔ انہوں نے کہا : اے اللہ کے رسول! میں نے آپ کے ساتھ اپنی باری کا دن حضرت عائشہ رضی اللہ عنہا کو دے دیا ہے ۔ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم عائشہ رضی اللہ عنہا کو دو دن دیتے ، ایک ان کا دن اور ایک حضرت سودہ رضی اللہ عنہا کا دن",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 3630,
			"arabicnumber": "1463.02",
			"text": "عقبہ بن خالد ، زہیر اور شریک ، ان سب نے ہشام سے اسی سند کے ساتھ روایت کی کہ حضرت سودہ رضی اللہ عنہا جب بوڑھی ہو گئیں ۔ ۔ ۔ آگے جریر کی حدیث کے ہم معنی ہے اور شریک کی حدیث میں یہ اضافہ ہے : وہ پہلی خاتون تھیں جن سے آپ صلی اللہ علیہ وسلم نے میرے بعد نکاح کیا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 3631,
			"arabicnumber": "1464.01",
			"text": "ابواسامہ نے ہمیں ہشام سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : میں ان عورتوں پر غیرت کرتی تھی جو اپنے آپ کو رسول اللہ صلی اللہ علیہ وسلم کے سامنے بطور ہبہ پیش کرتی تھیں ، میں کہتی : کیا کوئی عورت بھی خود کو ہبہ کر سکتی ہے؟ جب اللہ تعالیٰ نے نازل فرمایا : \" آپ ان عورتوں میں سے جسے چاہیں پیچھے کر دیں اور جسے چاہیں اپنے پاس جگہ دیں اور جسے آپ نے الگ کر دیا تھا ان میں سے بھی جسے آپ کا دل چاہے لائیں ۔ \" کہا : تو میں نے کہا : اللہ کی قسم! میں آپ کے رب کو نہیں دیکھتی مگر وہ آپ کے لیے آپ کی خواہش ( کو پورا کرنے ) میں جلدی کرتا ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 3632,
			"arabicnumber": "1464.02",
			"text": "عبدہ بن سلیمان نے ہشام سے حدیث بیان کی ، انہوں نے اپنے والد ( عروہ ) سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سےروایت کی ، وہ کہاکرتی تھیں : کیا اس عورت کو حیا محسوس نہیں ہوتی جو خود کو کسی مرد کے لیے ہبہ کرتی ہے ۔ یہاں تک کہ اللہ تعالیٰ نے یہ نازل فرمایا : \" آپ ان عورتوں میں سے جسے چاہیں پیچھے کریں اور جسے چاہیں اپنے پاس جگہ دیں ۔ \" تو میں نے کہا : بلاشبہ آپ کا رب آپ کی خواہش ( کو پورا کرنے ) میں جلدی کرتا ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 3633,
			"arabicnumber": "1465.01",
			"text": "محمد بن بکر نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن جریج نے خبر دی ، کہا : مجھے عطاء نے خبر دی ، کہا : سرف کے مقام پر ہم حضرت ابن عباس رضی اللہ عنہ کے ساتھ نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت میمونہ رضی اللہ عنہا کے جنازے میں حاضر ہوئے تو ابن عباس رضی اللہ عنہ نے کہا : یہ نبی صلی اللہ علیہ وسلم کی اہلیہ ہیں ۔ جب تم ان کی چارپائی اٹھاؤ تو اس کو ادھر اُدھر حرکت دینا نہ ہلانا ، نرمی ( اور احترام ) سے کام لینا ، امر واقع یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی نو بیویاں تھیں ، آپ آٹھ کے لیے باری تقسیم کرتے اور ایک کے لیے تقسیم نہ کرتے تھے ۔ عطاء نے کہا : جن کو آپ باری نہیں دیتے تھے وہ حضرت صفیہ بنت حیی بن اخطب رضی اللہ عنہا تھیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 3634,
			"arabicnumber": "1465.02",
			"text": "عبدالرزاق نے ابن جریج سے اسی سند کے ساتھ روایت کی اور یہ اضافہ کیا کہ عطاء نے کہا : وہ ان سب میں سے ، آخر میں فوت ہونے والی ( میمونہ رضی اللہ عنہا ) تھیں ، وہ مدینہ میں فوت ہوئیں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 3635,
			"arabicnumber": "1466",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" عورت کے ساتھ چار باتوں کی بنا پر شادی کی جاتی ہے : اس کے مال کی وجہ سے ، اس کے حسب ( ونسب ) کی وجہ سے ، اس کی خوبصورتی کی وجہ سے اور اس کے دین کی وجہ سے ۔ تم دین والی کے ساتھ ( شادی کر کے ) ظفر مند بنو ( کامیابی حاصل کرو ) تمہارے ہاتھ خاک آلود ہوں ۔ \" ( یہ اس بات سے کنایہ ہے کہ تم ہمیشہ کام کرتے رہو)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 3636,
			"arabicnumber": "715.04",
			"text": "عطاء سے روایت ہے ، کہا : مجھے جابر بن عبداللہ رضی اللہ عنہ نے خبر دی ، انہوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک عورت سے شادی کی ، میری ملاقات نبی صلی اللہ علیہ وسلم سے ہوئی تو آپ نے پوچھا : \" جابر! تم نے نکاح کر لیا ہے؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے فرمایا : \" کنواری ہے یا دوہاجو ( شوہر دیدہ ) ؟ \" میں نے عرض کی : دوہاجو ۔ آپ نے فرمایا : \" باکرہ سے کیوں نہ کی ، تم اس سے دل لگی کرتے؟ \" میں نے عرض کی : اے اللہ کے رسول! میری بہنیں ہیں تو میں ڈرا کہ وہ میرے اور ان کے درمیان حائل ہو جائے گی ، آپ نے فرمایا : \" پھر ٹھیک ہے ، بلاشبہ کسی عورت سے شادی ( میں رغبت ) اس کے دین ، مال اور خوبصورتی کی وجہ سے کی جاتی ہے ، تم دین والی کو چنو تمہارے ہاتھ خاک آلود ہوں",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 3637,
			"arabicnumber": "715.05",
			"text": "شعبہ نے ہمیں محارب سے حدیث بیان کی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں نے ایک عورت سے شادی کی تو رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا : \"\" کیا تم نے نکاح کیا ہے؟ \"\" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \"\" کنواری سے یا دوہاجو ( ثیبہ ) سے؟ \"\" میں نے عرض کی : دوہاجو سے ۔ آپ نے فرمایا : \"\" تم کنواریوں اور ان کی ملاعبت ( باہم کھیل کود ) سے ( دور ) کہاں رہ گئے؟ \"\" شعبہ نے کہا : میں نے یہ حدیث عمرو بن دینار کے سامنے بیان کی تو انہوں نے کہا : میں نے یہ حدیث حضرت جابر رضی اللہ عنہ سے سنی تھی اور انہوں نے کہا تھا : \"\" تم نے کنواری سے ( شادی ) کیوں نہ کی؟ تم اس کے ساتھ کھیلتے وہ تمہارے ساتھ کھیلتی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 3638,
			"arabicnumber": "715.06",
			"text": "یحییٰ بن یحییٰ اور ابو ربیع زہرانی نے ہمیں حدیث بیان کی ، یحییٰ نے کہا : حماد بن زید نے ہمیں عمرو بن دینار سے خبر دی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی کہ ( میرے والد ) عبداللہ رضی اللہ عنہ نے وفات پائی اور پیچھے نو بیٹیاں ۔ ۔ یا کہا : سات بیٹیاں ۔ ۔ چھوڑیں تو میں نے ایک ثیبہ ( دوہاجو ) عورت سے نکاح کر لیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا : \"\" جابر! نکاح کر لیا ہے؟ \"\" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \"\" کنواری ہے یا دوہاجو؟ \"\" میں نے عرض کی : اللہ کے رسول! دوہاجو ہے ۔ آپ نے فرمایا : \"\" کنواری کیوں نہیں ، تم اس سے دل لگی کرتے ، وہ تم سے دل لگی کرتی ۔ ۔ یا فرمایا : تم اس کے ساتھ ہنستے کھیلتے ، وہ تمہارے ساتھ ہنستی کھیلتی ۔ ۔ \"\" میں نے آپ صلی اللہ علیہ وسلم سے عرض کی : ( میرے والد ) عبداللہ رضی اللہ عنہ نے وفات پائی اور پیچھے نو ۔ ۔ یا سات ۔ ۔ بیٹیاں چھوڑیں ، تو میں نے اچھا نہ سمجھا کہ میں ان کے پاس انہی جیسی ( کم عمر ) لے آؤں ۔ میں نے چاہا کہ ایسی عورت لاؤں جو ان کی نگہداشت کرے اور ان کی اصلاح کرے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تمہیں برکت دے! \"\" یا آپ نے میرے لیے خیر اور بھلائی کی دعا فرمائی ۔ اور ابوربیع کی روایت میں ہے : \"\" تم اس کے ساتھ دل لگی کرتے وہ تمہارے ساتھ دل لگی کرتی اور تم اس کے ساتھ ہنستے کھیلتے ، وہ تمہارے ساتھ ہنستی کھیلتی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 3639,
			"arabicnumber": "715.07",
			"text": "سفیان نے ہمیں عمرو سے حدیث بیان کی ، انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے پوچھا : \" جابر! کیا تم نے نکاح کر لیا ہے؟ \" اور آگے یہاں تک بیان کیا : ایسی عورت جو اُن کی نگہداشت کرے اور ان کی کنگھی کرے ، آپ نے فرمایا : \" تم نے ٹھیک کیا ۔ \" اور انہوں نے اس کے بعد والا حصہ بیان نہیں کیا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 3640,
			"arabicnumber": "715.08",
			"text": "شعبی نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوے میں شریک تھے ۔ جب ہم واپس ہوئے تو میں نے اپنے سست رفتار اونٹ کو تھوڑا سا تیز کیا ، میرے ساتھ پیچھے سے ایک سوار آ کر ملا انہوں نے لوہے کی نوک والی چھڑی سے جو ان کے ساتھ تھی ، میرے اونٹ کو کچوکا لگایا ، تو وہ اتنا تیز چلنے لگا جتنا آپ نے کسی بہترین اونٹ کو ( تیز چلتے ہوئے ) دیکھا ، آپ نے پوچھا : \"\" جابر! تمہیں کس چیز نے جلدی میں ڈال رکھا ہے؟ \"\" میں نے عرض کی : اللہ کے رسول! میں نے نئی نئی شادی کی ہے ۔ آپ نے پوچھا : \"\" باکرہ سے شادی کی ہے یا ثیبہ ( دوہاجو ) سے؟ \"\" انہوں نے عرض کی : ثیبہ سے ۔ آپ نے فرمایا : \"\" تم نے کسی ( کنواری ) لڑکی سے کیوں نہ کی ، تم اس کے ساتھ دل لگی کرتے ، وہ تمہارے ساتھ دل لگی کرتی؟ \"\" کہا : جب ہم مدینہ آئے ، ( اس میں ) داخل ہونے لگے تو آپ نے فرمایا : \"\" ٹھہر جاؤ ، ہم رات ۔ ۔ یعنی عشاء ۔ ۔ کے وقت داخل ہوں ، تاکہ پراگندہ بالوں والی بال سنوار لے اور جس جس کا شوہر غائب رہا ، وہ بال ( وغیرہ ) صاف کر لے ۔ \"\" اور فرمایا : \"\" جب گھر پہنچنا تو عقل و تحمل سے کام لینا ( حالت حیض میں جماع نہ کرنا)",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 3641,
			"arabicnumber": "715.09",
			"text": "وہب بن کیسان نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوے میں نکلا تھا ، میرے اونٹ نے میری رفتار سست کر دی تو رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لے آئے اور فرمایا : \" جابر! \" میں نے عرض کی : جی ۔ آپ نے پوچھا : \" کیا معاملہ ہے؟ \" میں نے عرض کی : میرے لیے میرا اونٹ سست پڑ چکا ہے اور تھک گیاہے ، اس لیے میں پیچھے رہ گیا ہوں ۔ آپ ( اپنی سواری سے ) اترے اور اپنی مڑے ہوئے سرے والی چھڑی سے اسے کچوکا لگایا ، پھر فرمایا : \" سوار ہو جاؤ ۔ \" میں سوار ہو گیا ۔ اس کے بعد میں نے خود کو دیکھا کہ میں اس کو رسول اللہ صلی اللہ علیہ وسلم ( کی اونٹنی ) سے ( آگے بڑھنے سے ) روک رہا ہوں ۔ پھر آپ نے پوچھا : \" کیا تم نے شادی کر لی؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \" کنواری سے یا دوہاجو سے؟ \" میں نے عرض کی : دوہاجو ہے ۔ آپ نے فرمایا : \" ( کنواری ) لڑکی سے کیوں نہ کی ، تم اس کے ساتھ دل لگی کرتے ، وہ تمہارے ساتھ دل لگی کرتی ۔ \" میں نے عرض کی : میری ( چھوٹی ) بہنیں ہیں ۔ میں نے چاہا کہ ایسی عورت سے شادی کروں جو ان کی ڈھارس بندھائے ، ان کی کنگھی کرے اور ان کی نگہداشت کرے ۔ آپ نے فرمایا : \" تم ( گھر ) پہنچنے والے ہو ، جب پہنچ جاؤ تو احتیاط اور عقل مندی سے کام لینا ۔ \" پھر پوچھا : \" کیا تم اپنا اونٹ بیچو گے؟ \" میں نے عرض کی : جی ہاں ، چنانچہ آپ نے وہ ( اونٹ ) مجھ سے ایک اوقیہ ( چاندی کی قیمت ) میں خرید لیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم پہنچ گئے اور میں صبح کے وقت پہنچا ، مسجد میں آیا تو آپ کو مسجد کے دروازے پر پایا ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" ابھی پہنچے ہو؟ \" میں نے عرض کی : جی ہاں ۔ آپ نے فرمایا : \" اپنا اونٹ چھوڑو اور مسجد میں جا کر دو رکعت نماز ادا کرو ۔ \" میں مسجد میں داخل ہوا ، نماز پڑھی ، پھر ( آپ کے پاس ) واپس آیا تو آپ نے بلال رضی اللہ عنہ کو حکم دیا کہ میرے لیے ایک اوقیہ ( چاندی ) تول دیں ، چنانچہ حضرت بلال رضی اللہ عنہ نے وزن کیا ، اورترازو کو جھکایا ( اوقیہ سے زیادہ تولا ۔ ) کہا : اس کے بعد میں چل پڑا ، جب میں نے پیٹھ پھیری تو آپ نے فرمایا : \" جابر کو میرے پاس بلاؤ ۔ \" مجھے بلایا گیا ۔ میں نے ( دل میں ) کہا : اب آپ میرا اونٹ ( بھی ) مجھے واپس کر دیں گے ۔ اور مجھے کوئی چیز اس سے زیادہ ناپسند نہ تھی ( کہ میں قیامت وصول کرنے کے بعد آپ صلی اللہ علیہ وسلم سے اپنا اونٹ بھی واپس لے لوں ۔ ) آپ نے فرمایا : \" اپنا اونٹ لے لو اور اس کی قیمت بھی تمہاری ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 3642,
			"arabicnumber": "715.10",
			"text": "ابونضرہ نے ہمیں حضرت جابر بن عبداللہ رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ، اور میں ایک پانی ڈھونے والے اونٹ پر ( سوار ) تھا ۔ اور وہ پیچھے رہ جانے والے لوگوں کے ساتھ تھا ۔ کہا : آپ نے اسے ۔ ۔ میرا خیال ہے ، انہوں نے کہا : اپنے پاس موجود کسی چیز سے ۔ ۔ مارا ، یا کہا : کچوکا لگایا ، کہا : اس کے بعد وہ لوگوں ( کے اونٹوں ) سے آگے نکلنے لگا ، وہ مجھ سے کھینچا تانی کرنے لگا حتیٰ کہ مجھے اس کو روکنا پڑتا تھا ۔ کہا : اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" کیا تم مجھے یہ اتنے اتنے میں بیچو گے؟ اللہ تمہیں معاف فرمائے! \"\" کہا : میں نے عرض کی ۔ اللہ کے نبی! وہ آپ ہی کا ہے ۔ آپ نے ( دوبارہ ) پوچھا : \"\" کیا تم مجھے وہ اتنے اتنے میں بیچو گے؟ اللہ تمہارے گناہ معاف فرمائے! \"\" کہا : میں نے عرض کی : اللہ کے نبی! وہ آپ کا ہے ۔ کہا : اور آپ نے مجھ سے ( یہ بھی ) پوچھا : \"\" کیا اپنے والد ( کی وفات ) کے بعد تم نے نکاح کر لیا ہے؟ \"\" میں نے عرض کی : جی ہاں ۔ آپ نے پوچھا : \"\" دوہاجو ( شوہر دیدہ ) سے یا دوشیزہ سے؟ \"\" میں نے عرض کی : دوہاجو سے ۔ آپ نے فرمایا : \"\" تم نے کنواری سے کیوں نہ شادی کی ، وہ تمہارے ساتھ ہنستی کھیلتی اور تم اس کے ساتھ ہنستے کھیلتے اور وہ تمہارے ساتھ دل لگی کرتی ، تم اس کے ساتھ دل لگی کرتے؟ \"\" ابونضرہ نے کہا : یہ ایسا کلمہ تھا جسے مسلمان ( محاورتا ) کہتے تھے کہ ایسے ایسے کرو ، اللہ تمہارے گناہ بخش دے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 3643,
			"arabicnumber": "715.11",
			"text": "اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عورت کو پسلی سے پیدا کیا گیا ہے ، وہ تمہارے لیے کسی ایک طریقے پر ہرگز سیدھی نہیں رہ سکتی ، اگر تم اس سے فائدہ اٹھانا چاہو تو ( اسی طرح ) فائدہ اٹھا لو گے کہ اس میں کجی رہے گی اور اگر تم اسے سیدھا کرنے چلو گے تو اسے توڑ ڈالو گے ، اور اسے توڑنا اس کی طلاق ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 3644,
			"arabicnumber": "715.12",
			"text": "ابوحازم نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جو اللہ اور قیامت کے دن پر ایمان رکھتا ہے جب ( اپنی بیوی میں ) کوئی ( پسند نہ آنے والا ) معاملہ دیکھے تو اچھی طرح سے بات کہے یا خاموش رہے ۔ اور عورتوں کے ساتھ اچھے سلوک کی نصیحت قبول کرو کیونکہ عورت پسلی سے پیدا کی گئی ہے ۔ اور پسلیوں میں سب سے زیادہ ٹیڑھ اس کے اوپر والے حصے میں ہے ۔ اگر تم اسے سیدھا کرنے لگ جاؤ گے تو اسے توڑ دو گے اور اگر چھوڑ دو گے تو وہ ٹیڑھی ہی رہے گی ، عورتوں کے ساتھ اچھے سلوک کی نصیحت قبول کرو",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 3645,
			"arabicnumber": "1467.01",
			"text": "عیسیٰ بن یونس نے ہمیں حدیث بیان کی ، کہا : ہمیں عبدالحمید بن جعفر نے عمران بن ابی انس سے حدیث سنائی ، انہوں نے عمر بن حکم سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم نے فرمایا : \" کوئی مومن مرد کسی مومنہ عورت سے بغض نہ رکھے ۔ اگر اسے اس کی کوئی عادت ناپسند ہے تو دوسری پسند ہو گی ۔ \" یا آپ نے غيره ( اس کے سوا کوئی اور ) فرمایا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 3646,
			"arabicnumber": "1467.02",
			"text": "ابوعاصم نے ہمیں حدیث بیان کی ، کہا : ہمیں عبدالحمید بن جعفر نے سابقہ سند کے ساتھ حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ۔ ۔ اسی کے مانند",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 3647,
			"arabicnumber": "1468.01",
			"text": "ابوہریرہ رضی اللہ عنہ کے آزاد کردہ غلام ابو یونس نے حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" اگر حواء ( علیہا السلام ) نہ ہوتیں تو کوئی عورت اپنے شوہر سے کبھی خیانت نہ کرتی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 3648,
			"arabicnumber": "1468.02",
			"text": "ہمام بن منبہ سے روایت ہے ، انہوں نے کہا : یہ احادیث ہیں جو حضرت ابوہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انہوں نے متعدد احادیث بیان کیں ، ان میں ایک یہ تھی : اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر بنی اسرائیل نہ ہوتے تو کھانا خراب نہ ہوتا اور گوشت بدبودار نہ ہوتا اور اگر حواء علیہا السلام نہ ہوتیں تو کوئی عورت اپنے شوہر سے خیانت نہ کرتی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 3649,
			"arabicnumber": "1469",
			"text": "حضرت عبداللہ بن عمرو رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دنیا متاع ( کچھ وقت تک کے لیے فائدہ اٹھانے کی چیز ) ہے اور دنیا کی بہترین متاع نیک عورت ہے",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 3650,
			"arabicnumber": "1470.01",
			"text": "یونس نے مجھے ابن شہاب سے خبر دی ، کہا : مجھے ابن مسیب نے حضرت ابوہریرہ رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بلاشبہ عورت پسلی کی طرح ہے ، اگر تم اسے سیدھا کرنے لگ جاؤ گے تو اسے توڑ ڈالو گے اور اگر اسے چھوڑ دو گے تو اس سے فائدہ اٹھاؤ گے جبکہ اس میں ٹیڑھا پن ( موجود ) ہو گا",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 3651,
			"arabicnumber": "1470.02",
			"text": "زہری کے بھتیجے نے اپنے چچا ( زہری ) سے اسی سند کے ساتھ بالکل اسی کے مانند روایت کی",
			"grades": [],
			"reference": {
				"book": 17,
				"hadith": 84
			}
		}
	]
}