{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"23": "The Book of the Rules of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4140,
			"arabicnumber": "1614",
			"text": "حضرت اسامہ بن زید رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" مسلمان کافر کا وارث نہیں بنتا ، نہ کافر مسلمان کا وارث بنتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4141,
			"arabicnumber": "1615.01",
			"text": "وہیب نے ہمیں ابن طاوس سے حدیث بیان کی ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مقررہ حصے حقداروں کو دو اور جو بچ جائے وہ سب سے قریبی رشتہ رکھنے والے مرد کے لیے ہے ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4142,
			"arabicnumber": "1615.02",
			"text": "روح بن قاسم نے باقی ماندہ سابقہ سند کے ساتھ حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" مقررہ حصے ان کے حقداروں کو دو اور ان سے جو باقی بچے وہ سب سے قریبی مرد کا ہے ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4143,
			"arabicnumber": "1615.03",
			"text": "معمر نے ہمیں ابن طاوس سے باقی ماندہ سابقہ سند سے روایت کی : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مال کو اللہ کی کتاب کی رو سے مقررہ کردہ حصے والوں کے درمیان تقسیم کرو اور جو ان حصوں سے بچ جائے وہ سب سے قریبی مرد کے لیے ہے ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4144,
			"arabicnumber": "1615.04",
			"text": "یحییٰ بن ایوب نے ابن طاوس سے اسی سند کے ساتھ وہیب اور روح بن قاسم کی حدیث کے ہم معنی روایت بیان کی",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4145,
			"arabicnumber": "1616.01",
			"text": "سفیان بن عیینہ نے ہمیں محمد بن منکدر سے حدیث بیان کی : انہوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، انہوں نے کہا : میں بیمار ہوا تو رسول اللہ صلی اللہ علیہ وسلم اور حضرت ابوبکر رضی اللہ عنہ میری عیادت کرنے کے لیے پیدل چل کر تشریف لائے ، مجھ پر غشی ہو گئی تو رسول اللہ صلی اللہ علیہ وسلم نے وضو کیا ، پھر اپنے وضو کا پانی مجھ پر ڈالا تو مجھے افاقہ ہو گیا ، میں نے عرض کی : اے اللہ کے رسول! میں اپنے مال کے بارے میں کیسے فیصلہ کروں؟ ( اس کو ایسے ہی چھوڑ جاؤں یا وصیت کروں ، وصیت کروں تو کتنے حصے میں؟ اس وقت حضرت جابر رضی اللہ عنہ کے والد زندہ تھے نہ اور کوئی بیٹا تھا ۔ ) آپ نے مجھے جواب نہ دیا حتی کہ وراثت کی آیت نازل ہوئی : \" وہ آپ سے فتویٰ مانتے ہیں ، کہہ دیجئے : اللہ تمہیں کلالہ کے بارے میں فتویٰ دیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4146,
			"arabicnumber": "1616.02",
			"text": "ابن جریج نے ہمیں حدیث بیان کی ، انہوں نے کہا : مجھے ابن منکدر نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے خبر دی ، انہوں نے کہا : نبی صلی اللہ علیہ وسلم اور حضرت ابوبکر رضی اللہ عنہ نے بنوسلمہ ( کے علاقے ) میں پیدل چل کر میری عیادت کی ، آپ نے مجھے اس حالت میں پایا کہ میں کچھ سمجھ نہیں پا رہا تھا ، آپ نے پانی منگوایا ، وضو کیا ، پھر اس میں سے مجھ پر چھینٹے مارے تو مجھے افاقہ ہو گیا ، میں نے کہا : اللہ کے رسول! میں اپنے مال میں کیا کروں؟ تو ( یہ آیت ) نازل ہوئی : \" اللہ تمہیں تمہاری اولاد کے بارے میں تاکیدی حکم دیتا ہے ، مرد کے لیے دو عورتوں کے حصے کے برابر ہے ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 4147,
			"arabicnumber": "1616.03",
			"text": "سفیان ( ثوری ) نے ہمیں حدیث بیان کی ، انہوں نے کہا : میں نے محمد بن منکدر سے سنا ، انہوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : میں بیمار تھا تو رسول اللہ صلی اللہ علیہ وسلم نے میری عیادت کی ، آپ کے ساتھ حضرت ابوبکر رضی اللہ عنہ بھی تھے ، دونوں پیدل چل کر تشریف لائے ۔ آپ نے مجھے ( اس حالت میں ) پایا کہ مجھ پر غشی طاری تھی ، رسول اللہ صلی اللہ علیہ وسلم نے وضو کیا ، پھر اپنے وضو کا بچا ہوا پانی مجھ پر ڈالا ، میں ہوش میں آ گیا تو دیکھا سامنے رسول اللہ صلی اللہ علیہ وسلم تشریف فرما ہیں ، میں نے عرض کی : اے اللہ کے رسول! میں اپنے مال کے بارے میں کیا کروں؟ کہا : آپ نے مجھے کوئی جواب نہ دیا یہاں تک کہ وراثت کی آیت نازل ہوئی ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4148,
			"arabicnumber": "1616.04",
			"text": "بہز نے ہمیں حدیث بیان کی : شعبہ نے ہمیں حدیث بیان کی : مجھے محمد بن منکدر نے خبر دی ، انہوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم میرے ہاں تشریف لائے جبکہ میں بیمار تھا اور بے ہوش تھا ، آپ نے وضو کیا تو لوگوں نے آپ کے وضو کا بچا ہوا پانی مجھ پر ڈالا ، ( اس پر ) مجھے افاقہ ہوا تو میں نے کہا : اے اللہ کے رسول! میرا وارث کلالہ بنے گا ۔ ( اس وقت حضرت جابر رضی اللہ عنہ کی بہنیں ہی تھیں جو وارث بنتی تھیں ) اس پر وراثت کی آیت نازل ہوئی ۔ میں نے محمد بن منکدر سے پوچھا : ( يَسْتَفْتُونَكَ قُلِ اللَّـهُ يُفْتِيكُمْ فِي الْكَلَالَةِ ۚ ) ( والی آیت ) ؟ انہوں نے کہا : اسی طرح ( حضرت جابر رضی اللہ عنہ کے سوال پر ) نازل کی گئی ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4149,
			"arabicnumber": "1616.05",
			"text": "نضر بن شمیل ، ابو عامر عقدی اور وہب بن جریر سب نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی ، وہب بن جریر کی حدیث میں ہے : تو آیت فرائض نازل ہوئی ۔ اور ان میں سے کسی کی حدیث میں ابن منکدر سے شعبہ کے سوال کا تذکرہ نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4150,
			"arabicnumber": "1617.01",
			"text": "ہشام نے ہمیں حدیث بیان کی : ہمیں قتادہ نے سالم بن ابی جعد سے حدیث بیان کی ، انہوں نے معدان بن ابی طلحہ سے روایت کی کہ حضرت عمر بن خطاب رضی اللہ عنہ نے جمعہ کے دن خطبہ دیا ، انہوں نے نبی صلی اللہ علیہ وسلم کا تذکرہ کیا اور حضرت ابوبکر رضی اللہ عنہ کا تذکرہ کیا ، پھر کہا : میں اپنے بعد کوئی ایسی چیز نہیں چھوڑ رہا جو میرے ہاں کلالہ سے زیادہ اہم ہو ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے کسی چیز کے بارے میں اتنی مراجعت نہیں کی جتنی کلالہ کے بارے میں کی ، اور آپ نے بھی مجھ سے کسی چیز کے بارے میں اتنی شدت اختیار نہیں فرمائی جتنی کلالہ کے بارے میں فرمائی حتی کہ آپ نے اپنی انگلی میرے سینے میں چبھوئی اور فرمایا : \" اے عمر! تمہیں موسم گرما ( میں نازل ہونے ) والی آیت کافی نہیں جو سورہ نساء کے آخر میں ہے؟ ( جس سے مسئلہ واضح ہو گیا ہے ) \" اور میں ( عمر ) اگر زندہ رہا تو اس کے بارے میں ایسا واضح فیصلہ کروں گا جس ( کو دیکھتے ہوئے ) ایسا شخص ( بھی ) فیصلہ کر سکے گا جو قرآن پڑھتا ( اور سمجھتا ) ہے اور وہ بھی جو قرآن نہیں پڑھتا ۔",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4151,
			"arabicnumber": "1617.02",
			"text": "سعید بن ابی عروبہ اور شعبہ دونوں نے قتادہ سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4152,
			"arabicnumber": "1618.01",
			"text": "ابن ابی خالد نے ابواسحاق سے اور انہوں نے حضرت براء ( بن عازب ) رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : قرآن کی آخری آیت جو نازل ہوئی ( یہ تھی ) ( يَسْتَفْتُونَكَ قُلِ اللَّـهُ يُفْتِيكُمْ فِي الْكَلَالَةِ ۚ ) \" وہ آپ سے فتویٰ مانگتے ہیں ، کہہ دیجئے : اللہ تمہیں کلالہ کے بارے میں فتویٰ دیتا ہے",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4153,
			"arabicnumber": "1618.02",
			"text": "شعبہ نے ہمیں ابواسحاق سے حدیث بیان کی ، انہوں نے کہا : میں نے حضرت براء بن عازب رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : آخری آیت جو نازل کی گئی ، آیت کلالہ ہے اور آخری سورت جو نازل کی گئی ، سورہ براءت ہے ۔ ( سورہ توبہ کا دوسرا نام ، سورت براءت ہے)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4154,
			"arabicnumber": "1618.03",
			"text": "زکریا نے ہمیں ابواسحاق کے واسطے سے حضرت براء رضی اللہ عنہ سے حدیث بیان کی کہ آخری سورت جو پوری نازل کی گئی ، سورہ توبہ ہے اور آخری آیت جو نازل کی گئی ، آیت کلالہ ہے",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4155,
			"arabicnumber": "1618.04",
			"text": "عمار بن رزیق نے ہمیں ابواسحاق کے حوالے سے حضرت براء رضی اللہ عنہ سے اسی کے مانند حدیث بیان کی مگر انہوں نے کہا : آخری سورت جو مکمل نازل کی گئی ۔ ( تامة کے بجائے كاملة کے الفاظ ہیں)",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4156,
			"arabicnumber": "1618.05",
			"text": "ابوسفر نے حضرت براء رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : آخری آیت جو اتاری گئی ، ( يَسْتَفْتُونَكَ ) ہے",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4157,
			"arabicnumber": "1619.01",
			"text": "یونس نے مجھے ابن شہاب سے خبر دی ، انہوں نے ابوسلمہ بن عبدالرحمان سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس کسی ( ایسے ) شخص کی میت لائی جاتی جس پر قرض ہوتا تو آپ پوچھتے",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4158,
			"arabicnumber": "1619.02",
			"text": "عقیل ، ابن شہاب ( زہری ) کے بھتیجے اور ابن ابی ذئب سب نے زہری سے اسی سند کے ساتھ یہ حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4159,
			"arabicnumber": "1619.03",
			"text": "اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں محمد کی جان ہے! روئے زمین پر کوئی مومن نہیں مگر میں سب لوگوں کی نسبت اس کے زیادہ قریب ہوں ، تم میں سے جس نے بھی جو قرض یا اولاد چھوڑی ( جس کے ضائع ہونے کا ڈر ہے ) تو میں اس کا ذمہ دار ہوں اور جس نے مال چھوڑا وہ عصبہ ( قرابت دار جو کسی طرح بھی وارث بن سکتا ہو اس ) کا ہے ، وہ جو بھی ہو",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 4160,
			"arabicnumber": "1619.04",
			"text": "ہمام بن منبہ سے روایت ہے ، انہوں نے کہا : یہ وہ احادیث ہیں جو ہمیں حضرت ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انہوں نے چند احادیث بیان کیں ، ان میں سے یہ بھی تھی اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : اللہ عزوجل کی کتاب کی رو سے میں مومنوں کے ، ( ان کی اپنی ذات سمیت ) سب لوگوں کی نسبت زیادہ قریب ہوں ، تم میں سے جو قرض یا اولاد چھوڑ جائے تو مجھے بلانا میں اس کا ولی ہوں اور جو مال چھوڑ جائے تو اس کے مال کے معاملے میں ( ذوی الفروض کے حصے دینے کے بعد ) اس کے عصبہ ( قریب ترین مرد رشتہ دار ) کو ترجیح دی جائے ، وہ جو بھی ہو",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 4161,
			"arabicnumber": "1619.05",
			"text": "معاذ عنبری نے ہمیں حدیث بیان کی : ہمیں شعبہ نے عدی سے حدیث بیان کی کہ انہوں نے ابوحازم سے سنا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" جس نے مال چھوڑا وہ اس کے ورثاء کا ہے اور جس نے بوجھ ( بے سہارا اولاد ہو یا قرض ) چھوڑا وہ ہمارے ذمہ ہے",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 4162,
			"arabicnumber": "1619.06",
			"text": "(محمد بن جعفر ) غندر اور عبدالرحمان بن مہدی نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ حدیث بیان کی ، مگر غندر کی حدیث میں ہے : \" جس نے بوجھ چھوڑا اس کی ذمہ داری میں نے لے لی",
			"grades": [],
			"reference": {
				"book": 23,
				"hadith": 23
			}
		}
	]
}