{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"31": "The Book of Lost Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4498,
			"arabicnumber": "1722.01",
			"text": "ہمیں یحییٰ بن یحییٰ تمیمی نے حدیث بیان کی ، انہوں نے کہا : میں نے امام مالک کے سامنے قراءت کی ، انہوں نے ربیعہ بن ابی عبدالرحمٰن سے ، انہوں نے منبعث رضی اللہ عنہ کے مولیٰ یزید سے اور انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا : ایک آدمی نبی صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے ( کسی کی ) گری ، بھولی چیز کے بارے میں دریافت کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کے ڈھکنے/تھیلی اور بندھن کی شناخت کر لو ، پھر ایک سال اس کی تشہیر کرو ، اگر اس کا مالک آ جائے ( تو اسے دے دو ) ورنہ اس کا جو چاہو کرو ۔ \"\" اس نے کہا : گمشدہ بکری ( کا کیا حکم ہے؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تمہاری ہے یا تمہارے بھائی کی ہے یا بھیڑیے کی ہے ۔ \"\" اس نے پوچھا : تو گمشدہ اونٹ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" تمہارا اس سے کیا تعلق ہے؟ اس کی مشک اور اس کا موزہ اس کے ساتھ ہے ، وہ ( خود ہی ) پانی پر پہنچتا ہے اور درخت ( کے پتے ) کھاتا ہے یہاں تک کہ اس کا مالک اسے پا لیتا ہے ۔ \"\" ( یحییٰ نے کہا : میرا خیال ہے میں نے عفاصها پڑھا تھا ۔ ( بعض روایات میں \"\" وكاءها \"\" ( اس کا بندھن ) ہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 4499,
			"arabicnumber": "1722.02",
			"text": "اسماعیل بن جعفر نے ہمیں ربیعہ بن ابی عبدالرحمٰن سے حدیث بیان کی ، انہوں نے منبعث کے مولیٰ ( آزاد کردہ غلام ) یزید سے اور انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت کی کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے ( کسی کی ) گری پڑی چیز کے بارے میں دریافت کیا تو آپ نے فرمایا : \" ایک سال اس کا اعلان کرو ، پھر اس کے بندھن اور تھیلی وغیرہ کی شناخت رکھو ، پھر اس سے خرچ کرو ، اگر اس کا مالک آ جائے تو اسے دے دو ۔ \" اس نے کہا : اے اللہ کے رسول! گمشدہ بکری؟ آپ نے فرمایا : \" اسے پکڑ لو ، وہ تمہاری ہے یا تمہارے بھائی کی ہے یا بھیڑیے کی ہے ۔ \" اس نے کہا : اے اللہ کے رسول! گمشدہ اونٹ؟ کہا : اس پر رسول اللہ صلی اللہ علیہ وسلم غصے ہوئے حتی کہ آپ کے دونوں رخسار سرخ ہو گئے ۔ ۔ یا آپ کا چہرہ مبارک سرخ ہو گیا ۔ پھر فرمایا : \" تمہار اس سے کیا تعلق؟ اس وقت تک کہ اس کا مالک اسے پا لے ، اس کا موزہ اور اس کی مشک اس کے ساتھ ہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 4500,
			"arabicnumber": "1722.03",
			"text": "عبداللہ بن وہب نے ہمیں خبر دی ، کہا : مجھے سفیان ثوری ، مالک بن انس ، عمرو بن حارث اور دیگر لوگوں نے خبر دی کہ ربیعہ بن ابی عبدالرحمان نے انہیں اسی سند کے ساتھ مالک کی حدیث کے مانند حدیث بیان کی ، البتہ انہوں نے یہ اضافہ کیا : کہا : ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو میں آپ کے ساتھ تھا ، اس نے آپ سے کسی کی گری پڑی چیز کے بارے میں پوچھا ۔ اور ( ابن وہب نے ) کہا : عمرو نے حدیث میں کہا : \" جب اسے تلاش کرنے والا کوئی نہ آئے تو اسے خرچ کر لو",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4501,
			"arabicnumber": "1722.04",
			"text": "سلیمان بن بلال نے مجھے ربیعہ بن ابی عبدالرحمان سے حدیث بیان کی ، انہوں نے منبعث کے مولیٰ یزید سے روایت کی ، انہوں نے کہا : میں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ۔ ۔ اس کے بعد اسماعیل بن جعفر کی حدیث کی طرح بیان کیا ، مگر انہوں نے کہا : \" تو آپ کا چہرہ اور پیشانی سرخ ہو گئے اور آپ غصہ ہوئے ۔ \" اور انہوں نے اس قول \" پھر ایک سال اس کی تشہیر کرو ۔ \" کے بعد ۔ ۔ یہ اضافہ کیا : \" اگر اس کا مالک نہ آیا تو وہ تمہارے پاس امانت ہو گی",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 4502,
			"arabicnumber": "1722.05",
			"text": "سلیمان بن بلال نے ہمیں یحییٰ بن سعید سے حدیث بیان کی ، انہوں نے منبعث کے مولیٰ یزید سے روایت کی کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھی حضرت زید بن خالد جہنی رضی اللہ عنہ سے سنا ، وہ کہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم سے کسی کے گرے یا بھولے ہوئے سونے اور چاندی کے بارے میں پوچھا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس کی تھیلی اور ( باندھنے کی ) رسی کی شناخت کر لو ، پھر ایک سال اس کی تشہیر کرو ، اگر ( کچھ بھی ) نہ جان پاؤ تو اسے خرچ کر لو اور وہ تمہارے پاس امانت ہو گی ، اگر کسی بھی دن اس کا طلب کرنے والا آ جائے تو اسے اس کی ادائیگی کر دو ۔ \" اس شخص نے آپ صلی اللہ علیہ وسلم سے گمشدہ اونٹ کے بارے میں پوچھا : تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تمہارا اس سے کیا واسطہ؟ اس کا جوتا اور مشکیزہ اس کے ساتھ ہے ، وہ مالک کے پا لینے تک ( خود ہی ) پانی پر آتا اور درخت کھاتا ہے ۔ اس نے آپ سے بکری کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : اسے پکڑ لو ، وہ تمہاری ہے یا تمہارے بھائی کی ہے یا بھیڑیے کی ہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 4503,
			"arabicnumber": "1722.06",
			"text": "حماد بن مسلمہ نے ہمیں حدیث بیان کی ، کہا : مجھے یحییٰ بن سعید اور ربیعہ رائے بن ابو عبدالرحمان نے منبعث کے مولیٰ یزید سے حدیث بیان کی ، انہوں نے حضرت زید بن خالد جہنی رضی اللہ عنہ سے روایت کی کہ ایک آدمی نے نبی صلی اللہ علیہ وسلم سے گمشدہ اونٹ کے بارے میں پوچھا ۔ ( اس روایت میں ) ربیعہ نے اضافہ کیا : تو آپ غصے ہوئے حتی کہ آپ کے دونوں رخسار مبارک سرخ ہو گئے ۔ ۔ اور انہوں نے انہی کی حدیث کی طرح حدیث بیان کی اور ( آخر میں ) یہ اضافہ کیا : \" اگر اس کا مالک آ جائے اور اس کی تھیلی ، ( اندر جو تھا اس کی ) تعداد اور اس کے بندھن کو جانتا ہو تو اسے دے دو ورنہ وہ تمہاری ہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 4506,
			"arabicnumber": "1723.01",
			"text": "(محمد بن جعفر ) غندر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے سلمہ بن کہیل سے حدیث بیان کی ، انہوں نے کہا : میں نے سوید بن غفلہ سے سنا ، انہوں نے کہا : میں ، زید بن صوحان اور سلمان بن ربیعہ جہاد کے لیے نکلے ، مجھے ایک کوڑا ملا تو میں نے اسے اٹھا لیا ، ان دونوں نے مجھ سے کہا : اسے رہنے دو ۔ میں نے کہا : نہیں ، بلکہ میں اس کا اعلان کروں گا ، اگر اس کا مالک آ گیا ( تو اسے دے دوں گا ) ورنہ اس سے فائدہ اٹھاؤں گا ۔ کہا : میں نے ان دونوں ( کی بات ماننے ) سے انکار کر دیا ۔ جب ہم اپنی جنگ سے واپس ہوئے ( تو ) میرے مقدور میں ہوا کہ میں نے حج کرنا ہے ، چنانچہ میں مدینہ آیا ، حضرت ابی بن کعب رضی اللہ عنہ سے ملاقات کی اور انہیں کوڑے کے واقعے اور ان دونوں کی باتوں سے آگاہ کیا تو انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے عہد میں مجھے ایک تھیلی ملی جس میں سو دینار تھے ، میں اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو آپ نے فرمایا : \"\" سال بھر اس کی تشہیر کرو ۔ \"\" میں نے ( دوسرا سال ) اس کی تشہیر کی تو مجھے کوئی شخص نہ ملا جو اسے پہچان پاتا ، میں پھر آپ کے پاس آیا تو آپ نے فرمایا : \"\" ایک سال اس کی تشہیر کرو ۔ \"\" میں نے ( پھر سال بھر ) اس کی تشہیر کی تو مجھے کوئی شخص نہ ملا جو اسے پہچان پاتا ، میں پھر آپ کے پاس آیا تو آپ نے فرمایا : \"\" ایک سال اس کی تشہیر کرو ۔ \"\" میں نے اس کی تشہیر کی تو مجھے کوئی ایسا شخص نہ ملا جو اسے پہچان پاتا ۔ تو آپ نے فرمایا : \"\" اس کی تعداد ، اس کی تھیلی اور اس کے بندھن کو یاد رکھنا ، اس اگر اس مالک آ جائے ( تو اسے دے دینا ) ورنہ اس سے فائدہ اٹھا لینا ۔ \"\" پھر میں نے اسے استعمال کیا ۔ ( شعبہ نے کہا : ) اس کے بعد میں انہیں ( سلمہ بن کہیل کو ) مکہ میں ملا تو انہوں نے کہا : مجھے معلوم نہیں ( حضرت اُبی رضی اللہ عنہ نے ) تین سال ( تشہیر کی ) یا ایک سال",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 4507,
			"arabicnumber": "1723.02",
			"text": "بہز نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : مجھے سلمہ بن کہیل نے خبر دی یا انہوں نے کچھ لوگوں کو خبر دی اور میں بھی ان میں ( شامل ) تھا ، انہوں نے کہا : میں نے سوید بن غفلہ سے سنا ، انہوں نے کہا : میں زید بن صُوحان اور سلمان بن ربیعہ کے ساتھ ( سفر پر ) نکلا ، مجھے ایک کوڑا ملا ۔ ۔ انہوں نے اسی ( سابقہ روایت ) کے مانند اس قول تک حدیث بیان کی : \" پھر میں نے اسے استعمال کیا ۔ \" شعبہ نے کہا : میں نے دس سال بعد ان سے سنا ، وہ کہہ رہے تھے : انہوں ان سے سنا ، وہ کہہ رہے تھے : انہوں نے ایک سال اس کی تشہیر کی تھی",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 4508,
			"arabicnumber": "1723.03",
			"text": "قتیبہ بن سعید نے کہا : ہمیں جریر نے اعمش سے حدیث بیان کی ۔ ابوبکر بن ابی شیبہ نے کہا : ہمیں وکیع نے حدیث بیان کی ۔ ابن نمیر نے کہا : ہمیں میرے والد نے حدیث بیان کی ، وکیع اور عبداللہ بن نمیر نے سفیان سے روایت کی ۔ محمد بن حاتم نے کہا : ہمیں عبداللہ بن جعفر رَقی نے حدیث بیان کی ، کہا : ہمیں عبیداللہ بن عمر نے زید بن ابی انیسہ سے حدیث بیان کی ۔ عبدالرحمٰن بن بشر نے کہا : ہمیں بہز نے حدیث بیان کی ، کہا : ہمیں حماد بن سلمہ نے حدیث بیان کی ، ان سب ( اعمش ، سفیان ، زید بن ابی انیسہ اور حماد بن سلمہ ) نے سلمہ بن کہیل سے اسی سند کے ساتھ شعبہ کی حدیث کی طرح حدیث بیان کی ۔ حماد بن سلمہ کے سوا ، ان سب کی حدیث میں تین سال ہیں اور ان ( حماد ) کی حدیث میں دو یا تین سال ہیں ۔ سفیان ، زید بن ابی انیسہ اور حماد بن سلمہ کی حدیث میں ہے : \" اگر کوئی ( تمہارے پاس ) آ کر تمہیں اس کی تعداد ، تھیلی اور بندھن کے بارے میں بتا دے تو وہ اسے دے دو ۔ \" وکیع کی روایت میں سفیان نے یہ اضافہ کیا : \" ورنہ وہ تمہارے مال کے طریقے پر ہے ۔ \" اور ابن نمیر کی روایت میں ہے : \" اور اگر نہیں ( آیا ) تو اسے فائدہ اٹھاؤ",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 4509,
			"arabicnumber": "1724",
			"text": "حضرت عبدالرحمان بن عثمان تیمی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حاجیوں کی گری پڑی چیز اٹھانے سے منع فرمایا",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 4510,
			"arabicnumber": "1725",
			"text": "حضرت زید بن خالد جہنی رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" جس نے ( کسی کے ) بھٹکتے ہوئے جانور ( اونٹنی ) کو اپنے پاس رکھ لیا ہے تو وہ ( خود ) بھٹکا ہوا ہے جب تک اس کی تشہیر نہیں کرتا",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 4511,
			"arabicnumber": "1726.01",
			"text": "عبداﷲ بن عمر رضی ‌اللہ ‌عنہ سے روایت ہے جناب رسول اﷲ صلی ‌اللہ ‌علیہ ‌وسلم نے فرمایا کوئی تم میں سے دوسرے کے جانور کا دودھ نہ دھوئے مگر اس کی اجازت سے۔ کیا تم میں کوئی یہ چاہتا ہے کہ اس کی کوٹھری میں کوئی آئے اور اس کا خزانہ توڑ کر اس کے کھانے کا غلہ نکال لے جائے؟ اسی طرح جانوروں کے تھن ان کے خزانے ہیں کھانے کو تو کوئی نہ دوھوہے کسی کے جانور کا دودھ بغیر اس کی اجازت کے۔ ( مگر جو مرتا ہو مارے بھوک کے وہ بقدر ضرورت کے دوسرے کا کھانا بعیر اجازت کے کھا سکتا ہے۔ لیکن اس پر قیمت لازم ہوگی اور بعض سلف اور محدثین کے نزدیک لازم نہ ہوگی۔ اگر مردار بھی موجود ہو تو اس میں اختلاف ہے۔ بعضوں کے نزدیک مردار کھالے اور بعضوں کے نزدیک غیر کا کھانا۔)",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 4512,
			"arabicnumber": "1726.02",
			"text": "مذکورہ بالا حدیث اس سند سے بھی مروی ہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 4513,
			"arabicnumber": "48.02",
			"text": "لیث نے سعید بن ابی سعید سے ، انہوں نے ابو شریح عدوی سے روایت کی ، انہوں نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم نے گفتگو کی ، تو میرے دونوں کانوں نے سنا اور میری دونوں آنکھوں نے دیکھا ، آپ نے فرمایا : \" جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہے وہ اپنے مہمان کو ، جو پیش کرتا ہے ، اس کو لائق عزت بنائے ۔ \" صحابہ نے پوچھا : اے اللہ کے رسول! اس کو جو پیش کیا جائے ، وہ کیا ہے؟ آپ نے فرمایا : \" اس کے ایک دن اور ایک رات کا اہتمام اور مہمان نوازی تین دن ہے ، جو اس سے زائد ہے وہ اس پر صدقہ ہے ۔ \" اور آپ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ اور یومِ آخرت پر ایمان رکھتا ہے وہ اچھی بات کہے یا خاموش رہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 4514,
			"arabicnumber": "48.03",
			"text": "وکیع نے کہا : ہمیں عبدالحمید بن جعفر نے سعید بن ابی سعید مقبری سے حدیث بیان کی ، انہوں نے ابوشریح خزاعی سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مہمان نوازی تین دن ہے اور خصوصی اہتمام ایک دن اور ایک رات کا ہے اور کسی مسلمان آدمی کے لیے حلال نہیں کہ وہ اپنے بھائی کے ہاں ( ہی ) ٹھہرا رہے حتی کہ اسے گناہ میں مبتلا کر دے ۔ \" صحابہ نے پوچھا : اے اللہ کے رسول! وہ اسے گناہ میں کیسے مبتلا کرے گا؟ آپ نے فرمایا : \" وہ اس کے ہاں ٹھہرا رہے اور اس کے پاس کچھ نہ ہو جس سے وہ اس کی میزبانی کر سکے ( تو وہ غلط کام کے ذریعے سے اس کی میزبانی کا انتظام کرے)",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 4515,
			"arabicnumber": "48.04",
			"text": "ابوبکر حنفی نے کہا : ہمیں عبدالحمید بن جعفر نے حدیث بیان کی ، کہا : مجھے سعید مقبری نے حدیث بیان کی کہ انہوں نے ابوشریح خزاعی رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : میرے دونوں کانوں نے سنا اور میری آنکھ نے دیکھا اور میرے دل نے یاد رکھا جب رسول اللہ صلی اللہ علیہ وسلم نے یہ گفتگو فرمائی ۔ ۔ ( آگے ) لیث کی حدیث کی طرح بیان کیا اور اس میں یہ ذکر کیا : \" تم میں سے کسی کے لیے حلال نہیں کہ اپنے بھائی کے ہاں ٹھہرا رہے حتی کہ اسے گناہ میں ڈال دے ۔ \" اسی کے مانند جس طرح وکیع کی حدیث میں ہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 4516,
			"arabicnumber": "1727",
			"text": "حضرت عقبہ بن عامر رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : ہم نے عرض کی : اے اللہ کے رسول! آپ ہمیں کسی ( اہم کام کے لیے ) روانہ کرتے ہیں ، ہم کچھ لوگوں کے ہاں اترتے ہیں تو وہ ہماری مہمان نوازی نہیں کرتے ، آپ کی رائے کیا ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فرمایا : \" اگر تم کسی قوم کے ہاں اترو اور وہ تمہارے لیے ایسی چیز کا حکم دیں جو مہمان کے لائق ہے تو قبول کر لو اور اگر وہ ایسا نہ کریں تو ان سے مہمان کا اتنا حق لے لو جو ان ( کی استطاعت کے مطابق ان ) کے لائق ہو ۔",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 4517,
			"arabicnumber": "1728",
			"text": "حضرت ابو سعید خدری رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : ہم نبی صلی اللہ علیہ وسلم کے ساتھ سفر میں تھے ، اس اثنا میں ایک آدمی اپنی سواری پر آپ کے پاس آیا ، کہا : پھر وہ اپنی نگاہ دائیں بائیں دوڑانے لگا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کے پاس ضرورت سے زائد سواری ہو ، وہ اس کے ذریعے سے ایسے شخص کے ساتھ نیکی کرے جس کے پاس سواری نہیں ہے اور جس کے پاس زائد از ضرورت زادِ راہ ہے وہ اس کے ذریعے سے ایسے شخص کی خیرخواہی کرے جس کے پاس زاد راہ نہیں ہے ۔ کہا : آپ نے مال کی بہت سی اقسام کا ذکر کیا جس طرح کیا ، حتی کہ ہم نے خیال کیا کہ زائد مال پر ہم میں سے کسی کا کوئی حق نہیں ہے",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 4518,
			"arabicnumber": "1729",
			"text": "ایاس بن سلمہ نے ہمیں اپنے والد حضرت سلمہ بن اکوع رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک غزوہ میں نکلے ، ( راستے میں ) تنگی ( زاد راہ کی کمی ) کا شکار ہو گئے حتی کہ ہم نے ارادہ کر لیا کہ اپنی بعض سواریاں ذبح کر لیں ۔ اس پر نبی صلی اللہ علیہ وسلم نے حکم دیا تو ہم نے اپنا زادراہ اکٹھا کر لیا ۔ ہم نے اس کے لیے چمڑے کا دسترخوان بچھایا تو سب لوگوں کا زادراہ اس دسترخوان پر اکٹھا ہو گیا ۔ کہا : میں نے نگاہ اٹھائی کہ اندازہ کر سکوں کہ وہ کتنا ہے؟ تو میں نے اندازہ لگایا کہ وہ ایک بکری کے بیٹھنے کی جگہ کے بقدر تھا اور ہم چودہ سو آدمی تھے ۔ کہا : تو ہم نے کھایا حتی کہ ہم سب سیر ہو گئے ، پھر ہم نے اپنے ( خوراک کے ) تھیلے ( بھی ) بھر لیے ۔ اس کے بعد نبی صلی اللہ علیہ وسلم نے پوچھا : \"\" کیا وضو کے لیے پانی ہے؟ \"\" کہا : تو ایک آدمی اپنا ایک برتن لایا ۔ اس میں تھوڑا سا پانی تھا ، اس نے وہ ایک کھلے منہ والے پیالے میں انڈیلا تو ہم سب نے وضو کیا ، ہم چودہ سو آدمی اسے کھلا استعمال کر رہے تھے ۔ کہا : پھر اس کے بعد آٹھ افراد ( اور ) آئے ، انہوں نے کہا : کیا وضو کے لیے پانی ہے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" وضو کاپانی ختم ہو چکا",
			"grades": [],
			"reference": {
				"book": 31,
				"hadith": 20
			}
		}
	]
}