{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"35": "The Book of Sacrifices"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5064,
			"arabicnumber": "1960.01",
			"text": "ابوخثیمہ زہیر ( بن معاویہ ) نے اسود بن قیس سے حدیث بیان کی ، کہا : مجھے حضرت جندب بن سفیان ( بجلی ) رضی اللہ تعالیٰ عنہ نے بیان کیا ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ عید الاضحیٰ منائی ، آپ نے نماز پڑھی اور آپ اس ( نماز کے بعدخطبہ ، دعا وغیرہ ) سے فارغ ہوئے ہی تھے کہ آپ نے قربانی کے جانوروں کاگوشت دیکھا جو نماز پڑھے جانے سے پہلے ذبح کردیے گئے تھے ، اس پر آپ صلی اللہ علیہ وسلم نے فرمایا : : جس شخص نے نماز پڑھنے سے ۔ یا ( فرمایا : ) ہمارے نماز پڑھنے سے ۔ پہلے اپناقربانی کا جانور ذبح کرلیا وہ اس کی جگہ دوسرا ذبح کرے اور جس نے ذبح نہیں کیا ، وہ اللہ کا نام لے کر ذبح کرے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5065,
			"arabicnumber": "1960.02",
			"text": "ابو احوص سلام بن سلیم نے اسود بن قیس سے ، انھوں نے حضرت جندب بن سفیان رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ میں نبی کریم صلی اللہ علیہ وسلم کے ساتھ عیدالاضحی میں شریک ہوا ، آپ صلی اللہ علیہ وسلم نے ابھی کچھ بھی نہ کیا تھا سوائے اس کے کہ آپ صلی اللہ علیہ وسلم نے ( عید کی ) نماز پڑھائی ۔ نماز سے فارغ ہوئے ، سلام پھیرا کہ اچانک آپ صلی اللہ علیہ وسلم نے قربانی کی بکری دیکھی کہ وہ نماز سے پہلے ذبح کی جا چکی ہے ۔ چنانچہ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جس نے قربانی نمازعید سے پہلے کر لی تو اس قربانی کی جگہ دوسری قربانی کرے اور جس نے قربانی نہیں کی تو وہ اللہ کے نام کے ساتھ قربانی ذبح کر دے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5066,
			"arabicnumber": "1960.03",
			"text": "ابو عوانہ اور ابن عینیہ نے اسود بن قیس سے اسی سند کے ساتھ روایت کی اور دونوں نے کہا؛ \" اللہ کے نام پر ( ذبح کرے ) \" جس طرح ابو احوص کی حدیث ہے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5067,
			"arabicnumber": "1960.04",
			"text": "عبیداللہ کے والد معاذ نے کہا : ہمیں شعبہ نے اسود بن قیس سے حدیث بیا ن کی ، انھوں نے جندب بجلی رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو عید الاضحیٰ کے دن دیکھا ، آپ صلی اللہ علیہ وسلم نے نماز پڑھی ، پھر خطبہ د یا اور فرمایا : \" جس نے نماز پڑھنے سے پہلے ( اپنی قربانی کا جانور ) ذبح کردیا تھا ، وہ اس کی جگہ دوسرا ذبح کرے اور جس نے ذبح نہیں کیا وہ اللہ کے نام کے ساتھ ذبح کرے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5068,
			"arabicnumber": "1960.05",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5069,
			"arabicnumber": "1961.01",
			"text": "مطرف نے عامر ( شعبی ) سے ، انھوں نے حضرت براء رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میرے ماموں حضرت ابو بردہ رضی اللہ تعالیٰ عنہ نے نماز سے پہلے قربانی کردی ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ گوشت کی ایک ( عام ) بکری ہے ( قربانی کی نہیں ۔ ) \" انھوں ( حضرت ابو بردہ رضی اللہ تعالیٰ عنہ ) نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! میرے پاس بکری کا ایک چھ ماہ کا بچہ ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس کی قربانی کردو اور یہ تمہارے سوا کسی اور کے لئے جائز نہیں ہے ۔ \" پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے نماز سے پہلے ذبح کیا اس نے اپنے ( کھانے کے ) لئے ذبح کیا ہے اور جس نے نماز کے بعد ذبح کیا تو اس کی قر بانی مکمل ہوگئی اوراس نے مسلمانوں کے طریقے کو پا لیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5070,
			"arabicnumber": "1961.02",
			"text": "ہشیم نے داود سے ، انھوں نے ( عامر ) شعبی سے ، انھوں نے حضرت براء بن عازب رضی اللہ تعالیٰ عنہ سے روایت کی کہ ان کے ماموں حضرت ابو بردہ بن نیار رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم کے ذبح کرنے سے پہلے قربانی کا جانور ذبح کردیا اور کہنے لگے : اللہ کے رسول صلی اللہ علیہ وسلم ! یہ وہ دن ہے جس میں گوشت سے دل بھر جاتاہے ۔ ( اور اس کی چاہت باقی نہیں ر ہتی ) اور میں نے اپنے بچوں ، ہمسایوں اور گھروالوں ( کو کھلانے ) کےلیے قربانی کا جانور جلدی ذبح کردیاہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی اور ( جانور ) ذبح کرو ۔ \" انھوں نےکہا : اللہ کے رسول صلی اللہ علیہ وسلم میرے پاس ایک سالہ دودھ پیتی ( کھیری ) بکری ہے ۔ وہ گوشت والی دو بکریوں سے بہتر ہے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" یہ تمہاری بہترین قربانی ہے ( تم اسی کی قربانی کرلو ) اور تمہارے بعد کسی کی طرف سے بھی ایک سالہ بکری کی قربانی کافی نہیں ہوگی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5071,
			"arabicnumber": "1961.03",
			"text": "ابن ابی عدی داؤد سے ، انھوں نے ( عامر ) شعبی سے اور انھوں نے حضرت ابراء بن عازب رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن ہمیں خطبہ دیا اور فرما یا : \" کو ئی شخص بھی نماسز سے پہلے ہر گز ( قربانی کا جا نور ) ذبح نہ کرے ۔ \" تو میرے ماموں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !یہ ایسا دن ہے جس میں گوشت سے دل بھر جا تا ہے ۔ پھر ہشیم کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5072,
			"arabicnumber": "1961.04",
			"text": "(فراس نے عامر سے ، انھوں نے حضرت براء رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جو ہماری طرح نماز پڑھے اور ہمارے قبلے کی طرف منہ کرے اور ہماری قربانی کرے ، وہ نماز پڑھنے سے پہلے ذبح نہ کرے ۔ \" میرے ماموں نے کہا : یا رسول اللہ صلی اللہ علیہ وسلم ! میں اپنے ایک بیٹے کی طرف سے قربانی کر چکا ہوں ۔ آپ نے فر ما یا : \" یہ وہ ذبیحہ ) ہے جسے تم نے اپنے گھر والوں ( کو کھلا نے ) کے لیے جلد ذبح کر لیا ۔ \" انھوں نے کہا : میرے پاس ایک بکری ہے جو بکریوں سے بہتر ہے آپ نے فر ما یا : \" تم اس کی قربانی کر دو وہ بہترین قربانی ہے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5073,
			"arabicnumber": "1961.05",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے زبید یا می سے حدیث بیان کی ، انھوں نے حضرت براء بن عازب رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" آج کے دن ہم جس کا م سے آغاز کریں گے ( وہ یہ ہے ) کہ ہم نماز پڑھیں گے ، پھر لوٹیں گے ، اور قربانی کریں گے ۔ جس نے ایسا کیا ، اس نے ہمارا طریقہ پالیا اور جس نے ( پہلے ) ذبح کر لیا تو وہ گو شت ہے جو اس نے اپنے گھر والوں کو پیش کیا ہے ۔ وہ کسی طرح بھی قربانی نہیں ہے ۔ \" حضرت ابو بردہ بن دینار رضی اللہ تعالیٰ عنہ ( اس سے پہلے ) ذبح کر چکے تھے انھوں نے کہا : میرے پاس بکری کا ایک سالہ بچہ ہے جو دودانتی بکری دودانتا بکرے سے بہتر ہے ۔ تو آپ صلی اللہ علیہ وسلم نے فر ما یا : تم اس کو ذبح کردو ، اور تمھا رے بعد یہ کسی کی طرف سے کا فی نہ ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5074,
			"arabicnumber": "1961.06",
			"text": "عبید اللہ کے والد معاذ نے کہا : ہمیں شعبہ نے زبید سے حدیث بیان کی ، انھوں نے شعبی سے سنا ، انھوں نے حضرت براءعازب رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5075,
			"arabicnumber": "1961.07",
			"text": "منصور نے شعبی سے ، انھوں نے حضرت برا ء بن عازب رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن کے بعد ہمیں خطبہ دیا ، پھر ان سب کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5076,
			"arabicnumber": "1961.08",
			"text": "عاصم احول نے شعبی سے روایت کی ، کہا : مجھے حضرت برا ء بن عازب رضی اللہ تعالیٰ عنہ نے حدیث سنا ئی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں قربانی کے دن خطبہ دیا اور فرما یا : \" کو ئی شخص نماز پڑھنے سے پہلے قربانی نہ کرے ۔ \" ایک شخص نے کہا : میرے پاس ایک سالہ دودھ پینے والی ( کھیری ) بکری ہے جو گوشت والی دوبکریوں سے بہترہے ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" تم اس کی قربانی کردو ، تمھا رے بعد ایک سالہ بکری کسی کے لیے کا فی نہ ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5077,
			"arabicnumber": "1961.09",
			"text": "محمد بن جریر نے کہا : ہمیں شعبہ نے سلمہ سے حدیث بیان کی ، انھوں نے ابو جحیفہ رضی اللہ تعالیٰ عنہ سے انھوں نے حضرت براء بن عازب رضی اللہ تعالیٰ عنہ سے روایت کی کہا : حضرت ابو بردہ رضی اللہ تعالیٰ عنہ نے نما ز سے پہلے قربانی کا جا نورذبح کر لیا تو نبی صلی اللہ علیہ وسلم نے فرما یا : \" اس کے بدلے میں دوسری قربانی کرو ۔ انھوں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! میرے پاس ایک سالہ بکری ہے ۔ شعبہ نے کہا : میرا خیال ہے کہ انھوں نے کہا : ۔ ۔ ۔ اور وہ دو دانتی بکری سے بہتر ہے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے اس کی جگہ ( ذبح ) کرلو لیکن یہ تمھارے بعد کسی کے لیے کافی نہ ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5078,
			"arabicnumber": "1961.10",
			"text": "وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى ، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ ، ح وحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ ، حَدَّثَنَا شُعْبَةُ ، بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرِ الشَّكَّ فِي قَوْلِهِ : هِيَ خَيْرٌ مِنْ مُسِنَّةٍ وہب بن جریر اور ابو عامر عقدی نے کہا : شعبہ نے ہمیں اسی سند کے ساتھ حدیث بیان کی اور آپ صلی اللہ علیہ وسلم کے فرما ن \"\" یہ دودانتی بکری سے بہتر ہے \"\" کے بارے میں کسی شک کا ظہار نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5079,
			"arabicnumber": "1962.01",
			"text": "اسماعیل بن ابرا ہیم ( ابن علیہ ) نے ایوب سے ، انھوں نے محمد ( بن سیرین ) سے انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے قربانی کے دن فر ما یا : \" جس شخص نے نماز سے پہلے قربانی کر لی ہے وہ پھر اسے کرے ۔ \" تو ایک آدمی کھڑا ہوا اور کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! یہ ایسا دن ہے کہ اس میں گوشت کی خواہش ہو تی ہے ۔ اس نے اپنے ہمسایوں کی ضرورت مندی کا بھی ذکر کیا ۔ ( ایسا لگا ) جیسے رسول اللہ صلی اللہ علیہ وسلم نے بھی اس کی تصدیق کی ہو ۔ اس نے ( مزید ) کہا : اور میرے پاس ایک سالہ بکری ہے وہ مجھے گو شت والی دوبکریوں سے زیادہ پسند ہے کیا میں اسے ذبح کردوں ؟کہا : آپ نے اسے اس کی اجازت دے دی ۔ ( حضرت انس رضی اللہ تعالیٰ عنہ نے ) کہا : مجھے معلوم نہیں کہ آپ کی دی ہو ئی رخصت اس ( شخص ) کے علاوہ دوسروں کے لیے بھی ہے یا نہیں ؟پھر ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے دو مینڈھوں کا رخ کیا اور ان کو ذبحفر ما یا ۔ لوگ کھڑے ہو کر بکریوں کے ایک چھوٹے سے ریوڑ کی طرف متوجہ ہو ئے اور اس کو آپس میں تقسیم کرلیا ۔ ۔ ۔ یا کہا : اس کے حصے کر لیے ۔ ۔ ۔ ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5080,
			"arabicnumber": "1962.02",
			"text": "حماد بن زید نے کہا : ہمیں ایوب اور ہشام نے محمد سے حدیث بیان کی ، انھوں نے حضرت انس بن ما لک رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھا ئی پھر خطبہ دیا ، پھر آپ نے حکم دیا کہ جس نے نماز سے پہلے قربانی کی ہے وہ دوبارہ کرے ، اس کے بعد ابن علیہ کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5081,
			"arabicnumber": "1962.03",
			"text": "حاتم بن وردان نے کہا : ہمیں ایو ب نے محمد بن سیرین سے حدیث بیان کی ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں قربانی کے دن خطبہ دیا کہا : آپ صلی اللہ علیہ وسلم کو گوشت کی بو محسوس ہو ئی تو آپ نے ان کو ذبح کرنے سے منع کیا ، آپ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے ( نماز سے پہلے ) ذبح لیا ہے وہ دوبارہ ( قربانی ) کرے ۔ \" پھر ( حاتم نے ) ان دونوں ( ابن علیہ اور حمادبن زید ) کی حدیثٖ کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5082,
			"arabicnumber": "1963",
			"text": "حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : صرف مسنہ ( دودانتا ) جا نور کی قربانی کرو ہاں ! اگر تم کو دشوار ہو تو ایک سالہ دنبہ یا مینڈھا ذبح کر دو ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5083,
			"arabicnumber": "1964",
			"text": "ابو زبیر نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں قربانی کے دن مدینہ میں نما ز پڑھا ئی کچھ لوگوں نے جلدی کی اور قربانی کر لی ۔ ان کا خیال تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے قربانی کر لی ہو ئی ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا کہ جس نے آپ ( کے نماز اور خطبے سے فارغ ہو نے ) سے پہلے قربانی کر لی وہ ایک اور قربانی کریں ۔ اور نبی اکرم صلی اللہ علیہ وسلم سے پہلے کو ئی شخص قربانی نہ کرے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5084,
			"arabicnumber": "1965.01",
			"text": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے انھوں نے یزید بن ابی حبیب سے انھوں نے ابو خیر سے انھوں نے حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ سے روایت کی رسول اللہ صلی اللہ علیہ وسلم نے انھیں کچھ بکریاں عطا کیں کہ وہ ان کو آپ صلی اللہ علیہ وسلم کے ساتھیوں میں قربانی کے لیے تقسیم کر دیں ۔ آخر میں بکری کا ایک سالہ بچہ رہ گیا انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کا ذکر کیا تو آپ نے فرما یا : \" اس کی قربانی تم کر لو ۔ قتیبہ نے ( اصحابه کے بجا ئے ) علي صحابته آپ کے صحابہ میں ( تقسیم کردیں ۔ ) \" کے الفاظ کہے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5085,
			"arabicnumber": "1965.02",
			"text": "ہشام دستوائی یحییٰ بن ابی کیثر سے انھوں نے بعجہ جہنی سے انھوں نے حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ جہنی رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا رسول اللہ صلی اللہ علیہ وسلم نے ہمارے درمیان قربانی کے کچھ جا نور بانٹے تو مجھے ایک سالہ بھیڑ یا بکری ملی ۔ میں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میرے حصے میں ایک سالہ بھیڑ یا بکری آئی ہے آپ نے فرما یا : \" اسی کی قربانی کردو ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5086,
			"arabicnumber": "1965.03",
			"text": "معاویہ بن سلام نے کہا : مجھے یحییٰ بن ابی کثیر نے حدیث بیان کی ، کہا مجھے بعجہ بن عبد اللہ نے بتا یا کہ حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ نے انھیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے ساتھیوں میں قربانی کے جا نور تقسیم کیے ۔ اسی ( سابقہ ) حدیث کے ہم معنی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5087,
			"arabicnumber": "1966.01",
			"text": "ابو عوانہ نے قتادہ سے انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم نے دو سفید رنگ کے بڑے سینگوں والے مینڈھوں کی قربانی دی ۔ آپ نے انھیں اپنے ہا تھ سے ذبح کیا بسم اللہ پڑھی اور تکبیر کہی ۔ آپ نے ( قربانی کے وقت انھیں لٹا کر ) ان کے رخسار پر اپنا قدم مبارک رکھا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5088,
			"arabicnumber": "1966.02",
			"text": "وکیع نے شعبہ سے ، انھوں نے قتادہ سے انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی : کہا رسول اللہ صلی اللہ علیہ وسلم نے دو خوبصورت سفید رنگ کے بڑے سینگوں والے مینڈھوں کی قربانی دی ۔ کہا : میں نے دیکھا کہ آپ انھیں اپنے ہاتھوں سے ذبح کر رہے تھے ۔ اور میں نے دیکھا آپ نے ان کے رخسار پر قدم رکھا ہوا تھا ( اور ) کہا : آپ نے اللہ کا نام لیا ( بسم اللہ پڑھی ) اور تکبیر کہی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5089,
			"arabicnumber": "1966.03",
			"text": "خالد بن حارث نے کہا : ہمیں شعبہ نے حدیث بیان کی : کہا : مجھے قتادہ نے بتا یا کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا کہہ رہے تھے رسول اللہ صلی اللہ علیہ وسلم نے قربانی دی اس ( پچھلی حدیث ) کے مانند ۔ ( شعبہ نے ) کہا : میں نے قتادہ سے پو چھا : کیا آپ نے ( خود ) حضرت انس رضی اللہ تعالیٰ عنہ سے سنا تھا ؟ کہا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5090,
			"arabicnumber": "1966.04",
			"text": "سعید نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اس حدیث کے مانند روایت کی مگر انھوں نے یہ کہا : آپ صلی اللہ علیہ وسلم بسم اللہ واللہ اکبرکہہ رہے تھے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5091,
			"arabicnumber": "1967",
			"text": "عروہ بن زبیر نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک سینگوں والا مینڈھا لانے کا حکم دیا جو سیاہی میں چلتا ہو ، سیاہی میں بیٹھتا ہو اور سیاہی میں دیکھتا ہو ( یعنی پاؤں ، پیٹ اور آنکھیں سیاہ ہوں ) ۔ پھر ایک ایسا مینڈھا قربانی کے لئے لایا گیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے عائشہ! چھری لا ۔ پھر فرمایا کہ اس کو پتھر سے تیز کر لے ۔ میں نے تیز کر دی ۔ پھر آپ صلی اللہ علیہ وسلم نے چھری لی ، مینڈھے کو پکڑا ، اس کو لٹایا ، پھر ذبح کرتے وقت فرمایا کہ بسم اللہ ، اے اللہ! محمد ( صلی اللہ علیہ وسلم ) کی طرف سے اور محمد ( صلی اللہ علیہ وسلم ) کی آل کی طرف سے اور محمد ( صلی اللہ علیہ وسلم ) کی امت کی طرف سے اس کو قبول کر ، پھر اس کی قربانی کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5092,
			"arabicnumber": "1968.01",
			"text": "یحییٰ بن سعید نے سفیان ( بن سعید ) سے رویت کی ، کہا مجھے میرے والد ( سعید بن مسروق ) نے عبایہ بن رفاعہ بن رافع بن خدیج سے حدیث بیان کی ، انھوں نے حضرت رافع بن خدیج رضی اللہ تعالیٰ عنہ سے روایت کی کہ میں نے کہا کہ یا رسول اللہ صلی اللہ علیہ وسلم ! ہم کل دشمن سے لڑنے والے ہیں اور ہمارے پاس چھریاں نہیں ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جلدی کر یا ہوشیاری کر جو خون بہا دے اور اللہ کا نام لیا جائے اس کو کھا لے ، سوا دانت اور ناخن کے ۔ اور میں تجھ سے کہوں گا اس کی وجہ یہ ہے کہ دانت ہڈی ہے اور ناخن حبشیوں کی چھریاں ہیں ۔ راوی نے کہا کہ ہمیں مال غنیمت میں اونٹ اور بکریاں ملیں ، پھر ان میں سے ایک اونٹ بگڑ گیا ، ایک شخص نے اس کو تیر سے مارا تو وہ ٹھہر گیا ۔ تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ان اونٹوں میں بھی بعض بگڑ جاتے ہیں اور بھاگ نکلتے ہیں جیسے جنگلی جانور بھاگتے ہیں ۔ پھر جب کوئی جانور ایسا ہو جائے تو اس کے ساتھ یہی کرو ۔ ( یعنی دور سے تیر سے نشانہ کرو ) ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5093,
			"arabicnumber": "1968.02",
			"text": "وکیع نے کہا : ہمیں سفیان بن سعید بن مسروق نے اپنے والد سے حدیث سنائی ، انھوں نے عبایہ بن رفاعہ بن رافع بن خدیج سے ، انھوں نے حضرت رافع بن خدیج رضی اللہ تعالیٰ عنہ سے ر وایت کی ، کہا : ہم تہامہ کے مقام ذوالحلیفہ میں رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ تھے ۔ تو ہمیں ( غنیمت میں ) بکریاں اور اونٹ حاصل ہوئے تو لوگوں نے جلد بازی کی اور ( ان میں سے کچھ جانوروں کو ذبح کیا ، ان کا گوشت کاٹا اور ) ہانڈیاں چڑھادیں ۔ رسول اللہ صلی اللہ علیہ وسلم ( تشریف لائے تو آپ صلی اللہ علیہ وسلم ) نے حکم دیا اور ان ہانڈیوں کو الٹ دیا گیا ۔ پھر آپ نے ( سب کے حصے تقسیم کرنے کے لیے ) دس بکریوں کو ایک اونٹ کے مساوی قرار دیا ۔ اس کے بعد یحییٰ بن سعید کی حدیث کی طرح حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5094,
			"arabicnumber": "1968.03",
			"text": "۔ اسماعیل بن مسلم اور عمربن سعید نے سعید بن مسروق سے ، انھوں نے عبایہ بن رفاعہ بن رافع بن خدیج سے ، انھوں نے اپنے دادا حضرت رافع بن خدیج رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کل ہم دشمن کا سامنا کریں گے اور ہمارے پاس چھریاں نہیں ہیں ، کیا ہم بانس کے چھلکے ( یا تیز دھار کھپچی ) سے ذبح کر سکتے ہیں ؟اور سارے واقعے سمیت حدیث بیان کی اور کہا : ایک اونٹ ہم سے بدک کر بھا گ نکلا تو ہم نے اس پر تیر چلا ئے یہاں تک کہ اس کو گرا لیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5095,
			"arabicnumber": "1968.04",
			"text": "زائدہ نے سعید بن مسروق سے اسی سند کے ساتھ یہ حدیث آخر تک پوری بیان کی اور اس میں کہا ( ہم نے عرض کی : ) ہمارے پاس چھریاں نہیں ہیں تو کیا ہم بانسوں ( کی کچھیوں ) سے جانور ذبح کرلیں ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5096,
			"arabicnumber": "1968.05",
			"text": "زائد ہ نے سعید بن مسروق سے اسی سند کے ساتھ یہ حدیث آخر تک پو ری بیان کی اور اس میں کہا : ( ہم نے عرض کی ، ) ہمارے پاس چھریاں نہیں ہیں تو کیا ہم بانسوں ( کی کھپچیوں ) سے جا نور ذبح کر لیں ۔ شعبہ نے سعید بن مسروق سے انھوں نے عبایہ رفاعہ بن را فع سے انھوں نے حضرت رافع بن خدیج رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا ( ہم نے عرض کی : ) اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کل ہم دشمن سے مقابلہ کرنے والے ہیں اور ہمارے پاس چھریاں نہیں ہیں پھر حدیث بیان کی ، البتہ اس میں یہ نہیں کہا : \" لوگوں نے جلدبازی کی اور ان کے گو شت سے ہانڈیا ں ابالنے لگے آپ صلی اللہ علیہ وسلم نے ان کے بارے میں حکم دیا تو انھیں الٹ دیا گیا ۔ اور انھوں نے باقی سارا قصہ بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5097,
			"arabicnumber": "1969.01",
			"text": "سفیان نے کہا : ہمیں زہری نے ابو عبید سے روایت کی کہا : میں عید کے مو قع پر حضرت علی بن ابی طا لب رضی اللہ تعالیٰ عنہ کے ساتھ انھوں نے خطبے سے پہلے نماز پڑھا ئی اور کہا : رسول اللہ صلی اللہ علیہ وسلم نمے اس بات سے منع فر مایا تھا کہ ہم تین دن ( گزرجانے ) کے بعد اپنی قربانیوں کا گوشت کھا ئیں ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5098,
			"arabicnumber": "1969.02",
			"text": "یو نس نے ابن شہاب سے روایت کی ، کہا : مجھے ابن ازہر کے مو لیٰ ابو عبید نے حدیث بیان کی کہ انھوں نے حضرت عمر بن خطا ب رضی اللہ تعالیٰ عنہ کے ساتھ عید پڑھی کہا : اس کے بعد میں نے حضرت علی رضی اللہ تعالیٰ عنہ نے خطبے سے پہلے ہمیں نماز پڑھائی پھر لو گوں کو خطبہ دیا اور فر ما یا کہ رسول اللہ صلی اللہ علیہ وسلم نے تم کو تین راتوں سے زیادہ اپنی قربانی کا گوشت کھانے سے منع فر ما یا ہے اس لیے ( تین راتوں کے بعد یہ گو شت ) نہ کھا ؤ ۔ ان تین دنوں میں کھا کر اور تقسیم کر کے ختم کر دو ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5099,
			"arabicnumber": "1969.03",
			"text": "ابن شہاب کے بھتیجے صالح اور معمر سب نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5100,
			"arabicnumber": "1970.01",
			"text": "لیث نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فر ما یا : \" تم میں سے کو ئی شخص اپنی قربانی کے گو شت میں سے تین دن کے بعد ( کچھ ) نہ کھائے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5101,
			"arabicnumber": "1970.02",
			"text": "ابن جریج اور ضحاک بن عثمان دونوں نے نافع سے ، انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے لیث کی حدیث کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5102,
			"arabicnumber": "1970.03",
			"text": "ابن ابی عمر اور عبد بن حمید نے ہمیں حدیث بیان کی ، کہا : عبد الرزاق نے کہا : معمر نے ہمیں زہری سے خبر دی ، انھوں نے سالم سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ( اس بات سے ) منع کیا کہ تین دن کے بعد قربانی کا گو شت کھا یا جا ئے ۔ سالم نے کہا : حضرت ابن عمر رضی اللہ تعالیٰ عنہ تین دن سے اوپر قربانی کا گوشت نہیں کھا تے تھے اور ابن ابی عمر نے ( تین دن سے اوپر کے بجائے ) \" تین کے بعد \" کے الفا ظ کہے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5103,
			"arabicnumber": "1971",
			"text": "عبد اللہ بن ابی بکر نے حضرت عبد اللہ بن واقد رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے تین ( دن رات ) کے بعد قربانیوں کے گو شت کھا نے سے منع فر ما یا ۔ عبد اللہ بن ابی بکر نے کہا : میں نے یہ بات عمرہ ( بنت عبد الرحمان بن سعد انصار یہ ) کو بتا ئی عمرہ نے کہا : انھوں نے سچ کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کو یہ کہتے ہوئے سنا ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں بادیہ کے کچھ گھرانے ( بھوک اور کمزوری کے سبب ) آہستہ آہستہ چلتے ہو ئے جہاں لو گ قربانیوں کے لیے مو جو د تھے ( قربان گا ہ میں ) آئے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تین دن تک کے لیے گو شت رکھ لو ۔ جو باقی بچے ( سب کا سب ) صدقہ کر دو ۔ \" دوبارہ جب اس ( قربانی ) کا مو قع آیا تو لو گوں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !لو گ تو اپنی قربانی ( کی کھا لوں ) سے مشکیں بنا تے ہی اور اس کی چربی پگھلا کر ان میں سنبھال رکھتے ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا مطلب ؟ \" انھوں نے کہا : یہ ( صورتحال ہم اس لیے بتا رہے ہیں کہ ) آپ نے منع فرما یا تھا کہ تین دن کے بعد قربانی کا گو شت ( وغیرہ استعمال نہ کیا جا ئے ۔ تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میں نے تو تمھیں ان خانہ بدوشوں کی وجہ سے منع کیا تھا جو اس وقت بمشکل آپا ئے تھے ۔ اب ( قربانی کا گو شت ) کھا ؤ رکھو اور صدقہ کرو ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5104,
			"arabicnumber": "1972.01",
			"text": "۔ ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے تین دن کے بعد قربانیوں کا گوشت کھا نے سے منع فر ما یا تھا پھر اس کے بعد آپ صلی اللہ علیہ وسلم نے یہ فر ما یا : \" کھا ؤ اور زاددراہ بنا ؤ اور رکھو ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5105,
			"arabicnumber": "1972.02",
			"text": "۔ ابن جریج نے کہا : ہمیں عطاء نے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت جابربن عبداللہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا : ( پہلے ) ہم منیٰ کے تین دنوں سے زیادہ اپنے اونٹوں کی قربانیوں کا گوشت نہیں کھاتے تھے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اجازت دے دی اور فرمایا : \"\" کھاؤ اور ساتھ لے جاؤ ۔ ( اور صدقہ کرو جس طرح دوسری احادیث میں ہے ۔ ) \"\" میں نے عطاء سے کہا : حضرت جابر رضی اللہ تعالیٰ عنہ نے یہ کہا تھا کہ یہاں تک کہ ہم مدینہ آگئے؟ ( مدینہ تک پہنچنے کے آٹھ دنوں تک بطور زاد راہ استعمال کرتے رہے؟ ) انھوں نے کہا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5106,
			"arabicnumber": "1972.03",
			"text": "زید بن ابی انیسہ نے عطاء بن ابی رباح سے ، انھوں نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم تین دن سے زیادہ قربانیوں کا گوشت نہیں رکھتے تھے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا کہ ہم اس میں سے زادراہ بنائیں اور اس سے کھائیں ، یعنی تین سے زیادہ ( دنوں تک)",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5107,
			"arabicnumber": "1972.04",
			"text": "عمرو ( بن دینار ) نے عطاء سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے عہد میں قربانیوں کا گوشت زاد راہ کے طور پر مدینہ تک ساتھ لے جاتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5108,
			"arabicnumber": "1973",
			"text": "ابو بکر بن ابی شیبہ نے کہا : ہمیں عبدالاعلیٰ نے جریری سے حدیث بیان کی ، انھوں نے ابونضرہ سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، نیز محمد بن مثنیٰ نے کہا : ہمیں عبدالاعلیٰ نے حدیث بیان کی ، ہمیں سعید نے قتادہ سے ، انھوں نے ابو نضرہ سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایاتھا : \"\" مدینہ والو!قربانیوں کا گوشت تین ( دنوں ۔ راتوں ) سے زیادہ نہ کھاتے رہو ۔ \"\" ابن مثنیٰ نے ( صراحت سے ) \"\" تین دن ( سے زیادہ ) \"\" کہا ۔ صحابہ رضوان اللہ عنھم اجمعین نے رسول اللہ صلی اللہ علیہ وسلم سے یہ شکایت کی کہ ہمارے بال بچے اور نوکر چاکر ہیں ۔ آپ نے فرمایا : \"\" کھاؤ اور کھلاؤ اور روک کر رکھو یا ( فرمایا : ) ذخیرہ کرو ۔ \"\" ابن مثنیٰ نے کہا : عبدالاعلیٰ کو ( ان دو لفظوں میں ) شک ہے ( کہ آپ نے \"\" روک کررکھو \"\" فرمایا ، یا \"\" ذخیرہ کرو \"\" فرمایا)",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5109,
			"arabicnumber": "1974",
			"text": "حضرت سلمہ بن اکوع رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے جو شخص قربانی کرے تو تین دن کے بعد اس کے گھر میں ( اس گوشت میں سے ) کوئی چیز نہ رہے ۔ \" جب اگلے سال ( میں عید کادن ) آیاتو صحابہ رضوان اللہ عنھم اجمعین نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !کیا ہم اسی طرح کریں جس طرح پچھلے سال کیاتھا؟آپ نے فرمایا : \" نہیں ، وہ ایسا سال تھا کہ اس میں لوگ سخت ضرورت مند تھے تو میں نے چاہا کہ ( قربانی کا گوشت ) ان میں پھیل ( کر ہر ایک تک پہنچ ) جائے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5110,
			"arabicnumber": "1975.01",
			"text": "معن بن عیسیٰ نے کہا : ہمیں معاویہ بن صالح نے ابوزاہریہ سے حدیث بیان کی ، انھوں نے جبیر بن نفیر سے ، انھوں نے حضرت ثوبان رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ( اپنے قربانی کے جانوروں میں سے ) قربانی کا ایک جانور ذبح کرکے فرمایا : \"\" ثوبان! اس کے گوشت کو درست کرلو ( ساتھ لے جانے کے لیے تیار کرلو ۔ ) \"\" پھرمیں وہ گوشت آپ کو کھلاتا رہا یہاں تک کہ آپ مدینہ تشریف لے آئے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5111,
			"arabicnumber": "1975.02",
			"text": "زید بن حباب اور عبدالرحمان بن مہدی دونوں نے معاویہ بن صالح سے اسی سند کے ساتھ رویت کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5116,
			"arabicnumber": "1976",
			"text": "یحییٰ بن یحییٰ تمیمی ، ابو بکر بن ابی شیبہ ، عمرو ناقد اور زہیر بن حرب نے ہمیں سفیان بن عینیہ سے حدیث بیان کی ، انھوں نے زہری سے روایت کی ، انھوں نے سعید ( بن مسیب ) سے ، انھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سےاور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ، نیز محمد بن رافع اور عبد بن حمید نے کہا : ہمیں عبدالرزاق نے حدیث بیان کی ، کہا : ہمیں معمر نے زہری سے خبر دی ، انھوں نے ابن مسیب سے ، انھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" نہ جانور کا پہلوٹھا بچہ ذبح کرنا ( واجب/جائز ) ہے ، نہ رجب کے شروع میں جانور قربان کرنا درست ہے ۔ \"\" ابن رافع نے اپنی روایت میں اضافہ کیا : فرع سے مراد پہلوٹھی کا بچہ تھا ، جب وہ جنم پاتا تو وہ اسے ذبح کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5117,
			"arabicnumber": "1977.01",
			"text": "ابن ابی عمر مکی نے کہا : ہمیں سفیان نے عبدالرحمان بن حمید بن عبدالرحمان بن عوف سے حدیث سنائی : انھوں نے سعید بن مسیب سے سنا ، وہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے حدیث روایت کررہے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \"\" جب عشرہ ( ذوالحجہ ) شروع ہوجائے اور تم میں سے کوئی شخص قربانی کرنے کا ارادہ رکھتاہو وہ اپنے بالوں اور ناخنوں کو نہ کاٹے ۔ \"\" سفیان سے کہا گیا کہ بعض راوی اس حدیث کو مرفوعاً ( رسول اللہ صلی اللہ علیہ وسلم سے ) بیان نہیں کرتے ( حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کا قول بتاتے ہیں ) ، انھوں نے کہا : لیکن میں اس کو مرفوعاً بیان کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5118,
			"arabicnumber": "1977.02",
			"text": "اسحاق بن ابراہیم نے کہا : سفیان نے ہمیں خبر دی ، کہا : مجھے عبدالرحمان بن حمید بن عبدالرحمان بن عوف نے سعید بن مسیب سے حدیث بیان کی ، انھوں نے حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے مرفوعاً روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جب عشرہ ( ذوالحجہ ) شروع ہوجائے تو جس شخص کے پاس قر بانی ہو اور وہ قربانی کرنے کا ارادہ رکھتاہو ، وہ اپنے بال اتارے نہ ناخن تراشے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5119,
			"arabicnumber": "1977.03",
			"text": "یحییٰ بن کثیر عنبری ابو غسان نے کہا : ہمیں شعبہ نے مالک بن انس سے حدیث بیان کی ، انھوں نے عمر بن مسلم سے ، انھوں نے سعید بن مسیب سے ، انھوں نے ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" جب تم ذوالحجہ کا چاند دیکھو اور تم میں سے کوئی شخص قربانی کاا رادہ رکھتا ہو ، وہ اپنے بالوں اور ناخنوں کو ( نہ کاٹے ) اپنے حال پر رہنے دے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5120,
			"arabicnumber": "1977.04",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے مالک بن انس سے حدیث بیا ن کی ، انھوں نے عمر یا عمرو بن مسلم سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5121,
			"arabicnumber": "1977.05",
			"text": "معاذ عنبری نے کہا : ہمیں محمد بن عمر ولیثی نے عمر بن مسلم بن عمارہ بن اُکیمہ لیثی سے حدیث بیان کی ، کہا : میں نے سعید بن مسیب کو یہ کہتے ہوئے سنا : میں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے سنا ، وہ کہہ رہی تھیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص کے پاس ذ بح کرنے کے لئے کوئی ذبیحہ ہوتو جب ذوالحجہ کا چاند نظر آجائے ، وہ ہرگز اپنے بال اور ناخن نہ کاٹے ، یہاں تک کہ قربانی کرلے ( پھر بال اور ناخن کاٹے ۔)",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5122,
			"arabicnumber": "1977.08",
			"text": "ابواسامہ نے کہا : مجھے محمد بن عمرو نے حدیث بیان کی ، کہا : ہمیں عمرو بن مسلم بن عمارہ لیثی نے حدیث بیان کی ، کہا : عیدالاضحیٰ سے کچھ پہلے حمام میں تھے ، بعض لوگوں نے چونے سے اپنے بال صاف کیے ، اہل حمام میں سے کسی شخص نے کہا : سعید بن مسیب اس فعل ( عیدالاضحیٰ کی نماز پڑھنے اور قربانی کرنے سے پہلے جسم پر سے بال وغیرہ کاٹنے یا مونڈنے ) کو مکروہ قرار دیتے ہیں یا اس سے منع کرتے ہیں ۔ میری سعید بن مسیب سے ملاقات ہوئی تو میں نے ان سے اس بات کا ذکر کیا ۔ انھوں نے کہا : بھتیجے!یہ حدیث بھلا دی گئی اور ترک کردی گئی ہے ۔ ، ( یہ پابندی ملحوظ نہیں رکھی جاتی ویسے ) مجھے نبی کریم صلی اللہ علیہ وسلم کی زوجہ محترمہ ام سلمہ رضی اللہ تعالیٰ عنہا نے یہ حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ۔ ۔ آگے محمد بن عمر و سے معاذ کی حدیث کےہم معنی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5123,
			"arabicnumber": "1977.09",
			"text": "سعید بن ابی ہلال نے عمرو بن مسلم جندعی سے روایت کی کہ حضرت سعید بن مسیب نے انھیں خبر دی کہ نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا نے انھیں بتایا اور نبی اکرم صلی اللہ علیہ وسلم کا نام لیا ( پھر ) ان سب کی حدیث کے ہم معنی ( حدیث بیان کی ۔)",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5124,
			"arabicnumber": "1978.01",
			"text": "مروان بن معاویہ فزاری نے کہا : ہمیں منصور بن حیان نے حدیث بیان کی کہا : ابو طفیل عامر بن واثلہ رضی اللہ تعالیٰ عنہ نے ہمیں بیان کیا کہا : میں حضرت علی بن ابی طا لب رضی اللہ تعالیٰ عنہ کے پاس تھا ایک شخص آپ کے پاس آیا اور کہنے لگا : نبی صلی اللہ علیہ وسلم آپ کو راز داری سے کیا فر ما تے تھے؟ آپ ناراض ہو ئے اور کہا : نبی صلی اللہ علیہ وسلم نے مجھے کو ئی راز نہیں بتا یا جس کو اور لوگوں سے چھپایا ہو ۔ البتہ آپ نے مجھے چار باتیں ارشاد فر ما ئی تھیں ۔ اس نے پو چھا : امیر المومنین ! وہ کیا باتیں ہیں ؟ انھوں نے کہا : آپ صلی اللہ علیہ وسلم نے فر ما یا : \" جو شخص اپنے والد پر لعنت کرے اس پر اللہ کی لعنت ہے اور جو شخص غیر اللہ کے نام پر ذبح کرے اس پر اللہ لعنت کرے اور جو شخص کسی بدعتی کو پناہ دے اس پر اللہ لعنت کرے اور جس شخص نے زمین ( کی حد بندی ) کا نشان بدلا اس پر اللہ لعنت کرے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5125,
			"arabicnumber": "1978.02",
			"text": "ابوخالد احمر سلیمان بن حیان نے منصور بن حیان سے انھوں نے ابو طفیل رضی اللہ تعالیٰ عنہ سے روایت کی : کہا : ہم نے حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ سے عرض کی ، ہمیں کو ئی ایسی چیز بتا ئیے جو رسول اللہ صلی اللہ علیہ وسلم نے راز داری سے آپ کو بتا ئی ہو ۔ انھوں نے کہا : آپ صلی اللہ علیہ وسلم نے مجھے راز داری سے کو ئی بات نہیں بتا ئی جو لوگوں سے چھپائی ہو البتہ میں نے آپ صلی اللہ علیہ وسلم کو یہ فرما تے ہو ئے سنا : \" جس شخص نے غیر اللہ کے نام پر ذبح کیا اس پر اللہ لعنت کرے ۔ اور اللہ اس پر لعنت کرے جس نے کسی بدعتی کو پناہ دی اور اللہ اس پر لعنت کرے ۔ جس نے اپنے والدین پر لعنت کی اور اللہ اس پر لعنت کرے کرے جس نے ( زمین کی حد بندی کا ) نشان تبدیل کیا ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5126,
			"arabicnumber": "1978.03",
			"text": "شعبہ نے کہا : میں نے قاسم بن ابی بزہ کو ابو طفیل رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے ہو ئے سنا کہا : حضرت علی رضی اللہ تعالیٰ عنہ سے یہ سوال کیا گیا : کیا رسول اللہ صلی اللہ علیہ وسلم نے خصوصی طور پر کو ئی چیز آپ کو عطا فرمائی ؟ حضرت علی رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں کو ئی چیز خاص ہمارے لیے نہیں بتا ئی جو آپ نے تمام لوگوں میں عام نہ کی ہو ۔ البتہ میری اس تلوار کی نیام میں کچھ احکا م ہیں ۔ پھر آپ نے ایک صحیفہ نکا لا جس میں لکھا ہوا تھا : \" جو شخص غیر اللہ کے لیے ذبح کرے اس پر اللہ لعنت کرے اور جو شخص زمین کی ( حد بندی کی ) نشانی چرا ئے اللہ اس پر لعنت کرے اور جو شخص اپنے والد پر لعنت کرے اللہ اس پر لعنت کرے ، اور جو شخص کسی بدعتی کو پناہ دے اللہ اس پر لعنت کرے ۔",
			"grades": [],
			"reference": {
				"book": 35,
				"hadith": 62
			}
		}
	]
}