{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"38": "The Book of Manners and Etiquette"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5586,
			"arabicnumber": "2131",
			"text": "حضرت انس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ بقیع میں ایک شخص نے دوسرے شخص کو یا ابالقاسم کہہ کر آوازدی ، رسول اللہ صلی اللہ علیہ وسلم ( اس آواز پر ) اس ( آدمی ) کی طرف متوجہ ہو ئے تو اس شخص نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میرا مقصود آپ کو پکارنا نہ تھا ، میں نے تو فلاں کو آوزادی ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے نام پر نام رکھو اور میری کنیت پر ( اپنی ) کنیت نہ رکھو ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5587,
			"arabicnumber": "2132",
			"text": "حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : : \" تمھا رے ناموں میں سے اللہ تعا لیٰ کے نزدیک سب سے زیادہ پسندیدہ نام عبد اللہ اور عبدالرحمان ہیں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5588,
			"arabicnumber": "2133.01",
			"text": "منصور نے سالم بن ابی جعد سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم ( انصار ) میں سے ایک شخص کے ہاں لڑکا پیدا ہوا ، اس نے اس کا نام محمد رکھا ، اس کی قوم نے اس سے کہا : تم نے اپنے بیٹے کا نام رسول اللہ صلی اللہ علیہ وسلم کے نام پر رکھا ہے ، ہم تمھیں رسول اللہ صلی اللہ علیہ وسلم کے نام پر نام نہیں رکھنے دیں گے ، وہ شخص اپنے بیٹے کو اپنی پیٹھ پر اٹھا کر ( کندھےپر چڑھا کر ) رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میرے ہاں ایک لڑکا پیدا ہوا ہے میں نے اس کا نام محمد رکھا ہے ، اس پر میری قوم نے کہا ہے : ہم تمھیں رسول اللہ صلی اللہ علیہ وسلم کے نام پر نام نہیں رکھنے دیں گے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میرے نام پر نام رکھو اور میری کنیت پر ( اپنی ) کنیت نہ رکھو ۔ بے شک میں تقسیم کرنے والا ہوں ( جو اللہ عطاکرتا ہے ، اسے ) تمھا رے درمیان تقسیم کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5589,
			"arabicnumber": "2133.02",
			"text": "حسین نے سالم بن ابی جعد سے ، انھوں نے حضرت جابر عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم ( انصار ) میں سے ایک شخص کے ہاں لڑکا پیدا ہوا اس نے اس کا نام محمد رکھا ہم نے اس سے کہا : ہم تمھیں رسول اللہ صلی اللہ علیہ وسلم کی کنیت سے نہیں پکاریں گے ۔ یہاں تک کہ تم رسول اللہ صلی اللہ علیہ وسلم سے ( اس بات کی ) اجازت لے لو ۔ سووہ شخص آپ صلی اللہ علیہ وسلم کے پاس آیا اور کہا کہ اس کے ہاں لڑکا پیدا ہوا ہے ، تو میں نے رسول اللہ صلی اللہ علیہ وسلم کے نام پر اس کا نام رکھا ہے اور میری قوم نے اس بات سے انکا ر کر دیا ہے کہ مجھے اس کے نام کی کنیت سے پکا ریں یہاں تک کہ تم رسول اللہ صلی اللہ علیہ وسلم سے اجازت لے لو ۔ تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے نام پر نام رکھو لیکن میری کنیت پر کنیت نہ رکھو ، بے شک میں \" قاسم \" بنا کر بھیجا گیا ہوں ، تمھا رے درمیان ( اللہ کا دیا ہوا فضل ) تقسیم کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5590,
			"arabicnumber": "2133.03",
			"text": "خالد طحان نے حصین سے اسی سند کے ساتھ حدیث بیان کی اور \" میں قاسم ( تقسیم کرنے والا ) بنا کر بھیجا گیا ہوں ، تمھا رے درمیان تقسیم کرتا ہوں \" کے الفا ظ ذکر نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5591,
			"arabicnumber": "2133.04",
			"text": "ابو بکر بن ابی شیبہ اور ابو سعید اشج نے کہا : ہمیں وکیع نے حدیث بیان کی کہا : ہمیں اعمش نے سالم بن ابی جعد سے حدیث سنائی انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : میرے نام پر نام رکھو اور میری کنیت پر کنیت نہ رکھو ، کیو نکہ میں ہی ابو القاسم ہوں تمھا رے درمیان تقسیم کرتا ہوں ۔ اپنی کنیت نہ رکھو ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5592,
			"arabicnumber": "2133.05",
			"text": "ابو معاویہ نے اعمش سے اسی سند کے ساتھ حدیث بیان کی اور کہا : \" قاسم بنا یا گیا ہوں تمھا رے درمیان تقسیم کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5593,
			"arabicnumber": "2133.06",
			"text": "محمد بن مثنیٰ اور محمد بن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث سنا ئی انھوں نے کہا : میں نے قتادہ سے سنا ، انھوں نے سالم سے ، انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ انصار میں سے ایک شخص کے ہاں لڑکا پیدا ہوا اس نے اس کا نام محمد رکھنا چا ہا تو وہ نبی صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے پوچھا : آپ صلی اللہ علیہ وسلم نے فر ما یا : \" انصار نے اچھا کیا ، میرے نام پر نام رکھو ، میری کنیت پر ( اپنی ) کنیت نہ رکھو ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5594,
			"arabicnumber": "2133.07",
			"text": "ابو بکر بن ابی شیبہ محمد بن مثنیٰ محمد بن عمرو بن جبلہ اور بشر بن خالد نے محمد بن جعفر سے ۔ محمد بن جعفر ابن ابی عدی اور نضر بن شمیل نے شعبہ سے ، انھوں نے قتادہ منصور سلیمان اور حصین بن عبد الرحمٰن سے روایت کی ، انھوں نے کہا : ہم نے سالم بن ابی جعد سے سنا ، انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی ، جس طرح ان سب کی روایت ہے جن کی حدیث ہم پہلے بیان کر چکے ہیں شعبہ سے نضر کی بیان کردہ حدیث میں ہے کہا : اس میں حصین اور سلیمان نے اضا فہ کیا ، حصین نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مجھے قاسم بنا کر بھیجا گیا ہے ، میں تمھا رے درمیان تقسیم کرتا ہوں ۔ ۔ \" اور سلیمان نے کہا : \" میں ہی قاسم ہوں ، تمھا رے درمیان تقسیم کرتا ہوں",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5595,
			"arabicnumber": "2133.08",
			"text": "سفیان بن عیینہ نے کہا : ہمیں ( محمد ) بن منکدر نے حدیث سنا ئی کہ انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہو ئے سنا ، ہم میں سے ایک شخص کے ہاں ایک لڑکا پیدا ہوا ، اس شخص نے اس کا نم قاسم رکھا ، ہم نے کہا : ہم تمھیں ابو القاسم کی کنیت سے نہیں پکا ریں گے ۔ ( تمھا ری یہ خواہش پوری کر کے ) تمھا ری آنکھیں ٹھنڈی کریں گے تو وہ شخص نبی صلی اللہ علیہ وسلم کی خدمت میں آیا اور آپ صلی اللہ علیہ وسلم کو یہ سب بات بتا ئی تو آپ صلی اللہ علیہ وسلم نے فرما یا : \" تم اپنے بیٹے کا نام عبدالرحمٰن رکھ لو ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5596,
			"arabicnumber": "2133.09",
			"text": "روح بن قاسم نے محمد بن مکدر سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ کی حدیث کی طرح حدیث بیان کی ، مگر انھوں نے یہ الفاظ نہیں کہے : \" اور ہم تمہاری آنکھیں ٹھنڈی نہیں کریں گے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5597,
			"arabicnumber": "2134",
			"text": "ابو بکر بن ابی شیبہ ، عمرو ناقد ، زہیر بن حرب ، اور ابن نمیر نے کہا : ہمیں سفیان بن عینیہ نے ایوب سے حدیث بیان کی ، انھوں نے محمد بن سیرین سے روایت کی ، کہا : میں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا : ابو القاسم صلی اللہ علیہ وسلم نے فرمایا : \" میرے نام پر نام رکھو اور میری کنیت پر کنیت نہ رکھو ۔ \" عمرو نےکہا \" حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ر وایت ہے \" کہا اور \" میں نے سنا \" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5598,
			"arabicnumber": "2135",
			"text": "سیدنا مغیرہ بن شعبہ رضی اللہ عنہ سے روایت ہے کہ جب میں نجران میں آیا ، تو وہاں کے ( انصاری ) لوگوں نے مجھ پر اعتراض کیا کہ تم پڑھتے ہو کہ ( آیت ) ( ”اے ہارون کی بہن“ ( مریم : 28 ) ( یعنی مریم علیہا السلام کو ہارون کی بہن کہا ہے ) حالانکہ ( سیدنا ہارون موسیٰ علیہ السلام کے بھائی تھے اور ) موسیٰ علیہ السلام ، عیسیٰ علیہ السلام سے اتنی مدت پہلے تھے ( پھر مریم ہارون علیہ السلام کی بہن کیونکر ہو سکتی ہیں؟ ) ، جب میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو میں نے آپ صلی اللہ علیہ وسلم سے پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( یہ وہ ہارون تھوڑی ہیں جو موسیٰ کے بھائی تھے ) بنی اسرائیل کی عادت تھی ( جیسے اب سب کی عادت ہے ) کہ وہ پیغمبروں اور اگلے نیکوں کے نام پر نام رکھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5599,
			"arabicnumber": "2136.01",
			"text": "معتمر بن سلیمان نے کہا : میں رُکین سے سنا ، وہ ا پنے والد سے حدیث بیان کررہے تھے ، انھوں نے حضرت سمرہ بن جندب رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اپنے غلاموں کے یہ چار نام رکھنے سے منع فرمایا : افلح ( زیادہ کامیاب ) ، رباح ( منافع والا ) ، یسار ( آسانی والا ) اور نافع ( نفع پہنچانے والا)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5600,
			"arabicnumber": "2136.02",
			"text": "۔ جریر نے رکین بن ربیع سے ، انھوں نے اپنے والد سے ، انھوں نے سمرہ بن جندب رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اپنے لڑکے ( غلام ، خادم ) کا نام رباح ، یسار ، افلح ، اور نافع نہ رکھو ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5601,
			"arabicnumber": "2137.01",
			"text": "‏‏‏‏ سیدنا سمرہ بن جندب رضی اللہ عنہ سے روایت ہے، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”سب سے زیادہ پسند اللہ تعالیٰ کو چار کلمے ہیں «سُبْحَانَ اللهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ» ان میں سے جس کو چاہے پہلے کہے کوئی نقصان نہ ہو گا اور اپنے غلام کا نام یسار، رباح اور نجیح (اس کے وہی معنی ہیں جو افلح کے ہیں) اور افلح نہ رکھو۔ اس لیے کہ تو پوچھے گا وہاں وہ ہے (یعنی یسار یا رباح یا نجیح یا افلح) وہ کہے گا نہیں ہے۔“ سمرہ نے کہا: رسول اللہ صلی اللہ علیہ وسلم نے یہی چار نام فرمائے۔ تو زیادہ مت نقل کرنا مجھ سے۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5602,
			"arabicnumber": "2137.02",
			"text": "جریر ، روح بن قاسم اورشعبہ سب نے منصور سے زہیر کی سند کے ساتھ حدیث بیان کی ، جریر اورروح کی حدیث قصے سمیت زہیر کی حدیث جیسی ہے ۔ اورجوشعبہ کی حدیث ہے ۔ اس میں صرف غلام کانام رکھنے کا ذکر ہے ، انھوں نے \" چار بہترین کلمات \" کاذ کر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5603,
			"arabicnumber": "2138",
			"text": "ابن جریج نے کہا : مجھے ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے ارادہ فرمایا کہ آپ یعلیٰ ( بلند ) ، برکت ، افلح ، یساراور نافع جیسے نام رکھنے سے منع فرمادیں ، پھرمیں نے دیکھا کہ آپ خاموش ہوگئے ، پھر آپ کی رحلت ہوئی تو آپ نے ان ناموں سے نہیں روکا تھا ، پھر حضرت عمر رضی اللہ تعالیٰ عنہ نے ان سے روکنے کا ا رادہ نہیں کیاتو انھوں نے بھی ( یہ ارادہ ) ترک کردیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5604,
			"arabicnumber": "2139.01",
			"text": "احمد بن حنبل ، زہیر بن حرب ، محمد بن مثنیٰ ، عبیداللہ بن سعید اور محمد بن بشار نے ( ان سب نے ) کہا : ہمیں یحییٰ بن سعید نے عبیداللہ سے حدیث بیان کی ، کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے عاصیہ ( نافرمانی کرنے والی ) کانام تبدیل کردیا اور فرمایا : \"\" تم جمیلہ ( خوبصورت ) ہو ۔ \"\" احمد نے \"\" مجھے خبر دی \"\" کی جگہ \"\" سے روایت ہے ۔ \"\" کہا ہے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5605,
			"arabicnumber": "2139.02",
			"text": "حماد بن سلمہ نے عبیداللہ سے ، انھوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ حضرت عمر رضی اللہ تعالیٰ عنہ کی ایک صاحبزادی کو عاصیہ کہا جاتاتھا ، تو رسول اللہ صلی اللہ علیہ وسلم نےاس کانام جمیلہ رکھا دیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5606,
			"arabicnumber": "2140",
			"text": "عمرو ناقد اور ابن ابی عمر نے حدیث بیان کی ۔ الفاظ عمرو کے ہیں ۔ دونوں نے کہا : ہمیں سفیان نے آل طلحہ کے آزاد کردہ غلام محمد بن عبدالرحمان سے حدیث بیان کی ، انھوں نے کریب سے ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ( پہلے ام المومنین حضرت ) جویریہ رضی اللہ تعالیٰ عنہا کا نام \" برہ \" تھا تو رسول اللہ صلی اللہ علیہ وسلم نے ان کا نام بدل کر جویریہ رکھ دیا ۔ آپ کو پسند نہ تھا ۔ کہ اس طرح کہا جائے کہ آپ برہ ( نیکیوں و الی ) کے ہاں سے نکل گئے ۔ ابن ابی عمر کی حدیث میں ہے : کریب سے روایت ہے ، کہا : میں نے ابن عباس رضی اللہ تعالیٰ عنہ سے سنا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5607,
			"arabicnumber": "2141",
			"text": "ابو بکر بن ابی شیبہ ، محمد بن مثنیٰ اورمحمد بن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، محمد بن جعفر اورعبیداللہ کے والد معاذ نے شعبہ سے ، انھوں نے عطاء بن ابی میمونہ سے ، انھوں نے ابو رافع سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ حضرت زینب ( بنت ام سلمہ رضی اللہ تعالیٰ عنہا ) کا نام برہ تھا تو کہا گیا کہ وہ ( نام بتاتے وقت خود ) اپنی پارسائی بیان کرتی ہیں ، تو رسول اللہ صلی اللہ علیہ وسلم نے ان کا نام زینب رکھ دیا ۔ حدیث کے الفاظ ابن بشار کے علاوہ باقی سب کے ( بیان کردہ ) ہیں ۔ ابن ابی شیبہ نے کہا : ہمیں محمد بن جعفر نے شعبہ سے حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5608,
			"arabicnumber": "2142.01",
			"text": "ولید بن کثیر نے کہا : مجھے محمد بن عمرو بن عطاء نے حدیث بیان کی ، کہا : مجھے حضرت زینب بنت ام سلمہ رضی اللہ تعالیٰ عنہا نے بتایا ، کہا : میرا نام برہ تھا ، تو رسول اللہ صلی اللہ علیہ وسلم نے میرا نام زینب رکھ دیا ۔ انھوں نے کہا : جب زینب بنت جحش رضی اللہ تعالیٰ عنہا آپ کے حبالہ عقد میں داخل ہوئیں تو ان کا نام بھی برہ تھا ، تو آپ صلی اللہ علیہ وسلم نے ان کا نام بھی زینب رکھا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5609,
			"arabicnumber": "2142.02",
			"text": "یزید بن ابی حبیب نے محمد بن عمرو بن عطاء سے روایت کی ، کہا : میں نے اپنی بیٹی کانام برہ رکھا تو حضرت زینب بنت ابی سلمہ رضی اللہ تعالیٰ عنہا نے مجھ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ نام رکھنے سے منع فرمایا ہے ۔ اور ( بتایا کہ ) میرا نام بھی پہلے برہ رکھا گیا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم لوگ اپنی پارسائی بیان کرو اللہ تعالیٰ ہی خوب جانتا ہے کہ تم میں سے نیکو کار کون ہے ۔ \"\" ( گھرکے ) لوگوں نے کہا : پھر ہم اس کا کیا نام رکھیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کا نام زینب رکھ دو ۔ \"\" یزید بن ابی حبیب نے محمد بن عمرو بن عطاء سے روایت کی ، کہا : میں نے اپنی بیٹی کانام برہ رکھا تو حضرت زینب بنت ابی سلمہ رضی اللہ تعالیٰ عنہا نے مجھ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ نام رکھنے سے منع فرمایا ہے ۔ اور ( بتایا کہ ) میرا نام بھی پہلے برہ رکھا گیا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم لوگ اپنی پارسائی بیان کرو اللہ تعالیٰ ہی خوب جانتا ہے کہ تم میں سے نیکو کار کون ہے ۔ \"\" ( گھرکے ) لوگوں نے کہا : پھر ہم اس کا کیا نام رکھیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کا نام زینب رکھ دو ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 5610,
			"arabicnumber": "2143.01",
			"text": "سعید بن عمرو اشعشی ، احمد بن حنبل رحمۃ اللہ علیہ اورابو بکر بن ابی شیبہ نے ہمیں حدیث بیان کی ۔ الفاظ امام احمد کے ہیں ، اشعشی نے کہا : ہمیں سفیان بن عینیہ نے خبر دی جبکہ دیگر نے کہا : ہمیں حدیث بیان کی ۔ ابوزناد سے ، انھوں نے اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نےفرمایا؛ \"\" اللہ تعالیٰ کے نزدیک سب سے قابل تحقیر نام اس شخص کا ہے جو شہنشاہ کہلائے ۔ \"\" اور ابن ابی شیبہ نے اپنی روایت میں اضافہ کیا : \"\" اللہ عزوجل کے سوا کوئی ( بادشاہت کا ) مالک نہیں ہے ۔ \"\" اشعشی کا قول ہے : سفیان نے کہا : جیسے شاہان شاہ ( شہنشاہ ) ہے ۔ اور احمد بن حنبل نے کہا : میں نے ابو عمرو ( اسحاق بن مرار شیبانی ، نحوی ، کوفی ) سے \"\" اخنع \"\" کے بارے میں پوچھا توانھوں نے کہا : ( اس کے معنی ہیں ) اوضع ( انتہائی حقیر)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5611,
			"arabicnumber": "2143.02",
			"text": "ہمیں معمر ہمام بن منبہ سے خبر دی ، کہا : یہ احادیث ہمیں حضرت ابوہریر رضی اللہ تعالیٰ عنہ رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کیں ، پھر انھوں نے کچھ احادیث بیان کیں ، ان میں سے یہ حدیث ( بھی ) ہے : اوررسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کے نزدیک قیامت کےدن سب سےزیادہ گندا اورغضب کامستحق شخص وہ ہوگا جوشہنشاہ کہلاتا ہوگا ، اللہ کے سوا کوئی اور بادشاہ نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5612,
			"arabicnumber": "2144.01",
			"text": "ثابت بنانی نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : جب عبداللہ بن ابی طلہ پیدا ہوئے تو میں انھیں لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم ایک دھاری دارعبا ( چادر ) زیب تن فرمائے اپنے ایک اونٹ کو ( خارش سے نجات دلانے کے لئے ) گندھک ( یاکول تار ) لگارہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" کچھ کھجور ساتھ ہے؟میں نے عرض کی : جی ہاں ، پھر میں نے آپ کو کچھ کھجوریں پیش کیں ، آپ نے ان کو اپنے منہ میں ڈالا ، انھیں چبایا ، پھر بچے کامنہ کھول کر ان کو اپنے دہن مبارک سے براہ راست اس کے منہ میں ڈال دیا ۔ بچے نے زبان ہلاکر اس کاذائقہ لینا شروع کردیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ انصار کی کھجوروں سے محبت ہے ۔ \" اور آپ صلی اللہ علیہ وسلم نے اس کا نام عبداللہ رکھا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5613,
			"arabicnumber": "2144.02",
			"text": "یزید بن ہارون نے کہا : ہمیں ابن عون نے ابن سیرین سے خبر دی ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا؛ سیدنا انس بن مالک رضی اللہ عنہ کہتے ہیں کہ ابوطلحہ رضی اللہ عنہ کا ایک لڑکا بیمار تھا ، وہ باہر گئے ہوئے تھے کہ وہ لڑکا فوت ہو گیا ۔ جب وہ لوٹ کر آئے تو انہوں نے پوچھا کہ میرا بچہ کیسا ہے؟ ( ان کی بیوی ) ام سلیم رضی اللہ عنہا نے کہا کہ اب پہلے کی نسبت اس کو آرام ہے ( یہ موت کی طرف اشارہ ہے اور کچھ جھوٹ بھی نہیں ) ۔ پھر ام سلیم شام کا کھانا ان کے پاس لائیں تو انہوں نے کھایا ۔ اس کے بعد ام سلیم سے صحبت کی ۔ جب فارغ ہوئے تو ام سلیم نے کہا کہ جاؤ بچہ کو دفن کر دو ۔ پھر صبح کو ابوطلحہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آپ صلی اللہ علیہ وسلم سے سب حال بیان کیا ، تو آپ صلی اللہ علیہ وسلم نے پوچھا کہ کیا تم نے رات کو اپنی بیوی سے صحبت کی تھی؟ ابوطلحہ نے کہا جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے دعا کی کہ اے اللہ ان دونوں کو برکت دے ۔ پھر ام سلیم کے ہاں لڑکا پیدا ہوا تو ابوطلحہ نے مجھ سے کہا کہ اس بچہ کو اٹھا کر رسول اللہ صلی اللہ علیہ وسلم کے پاس لے جا اور ام سلیم نے بچے کے ساتھ تھوڑی کھجوریں بھی بھیجیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس بچے کو لے لیا اور پوچھا کہ اس کے ساتھ کچھ ہے؟ لوگوں نے کہا کہ کھجوریں ہیں ۔ آپ صلی اللہ علیہ وسلم نے کھجوروں کو لے کر چبایا ، پھر اپنے منہ سے نکال کر بچے کے منہ میں ڈال کر اسے گٹھی دی اور اس کا نام عبداللہ رکھا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5614,
			"arabicnumber": "2144.03",
			"text": "حماد بن مسعدہ نے کہا : ہمیں ابن عون نے محمد ( ابن سیرین ) سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اسی قصے کے ساتھ یزید کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5615,
			"arabicnumber": "2145",
			"text": "حضرت ابوموسیٰ رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : میرے ہاں ایک لڑکا پیدا ہوا ، میں اس کو لے کر نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ، آپ نے اس کا نام ابراہیم رکھا اور اس کو ایک کھجور ( کے دانے ) سے گھٹی دی ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5616,
			"arabicnumber": "2146.01",
			"text": "شعیب بن اسحاق نے کہا؛مجھے ہشام بن عروہ نے بتایا ، کہا : مجھے عروہ بن زبیر اور فاطمہ بنت منذر بن زبیر نے حدیث بیان کی ، دونوں نے کہا : کہ سیدہ اسماء رضی اللہ عنہا ( مکہ سے ) ہجرت کی نیت سے جس وقت نکلیں ، ان کے پیٹ میں عبداللہ بن زبیر تھے ( یعنی حاملہ تھیں ) جب وہ قباء میں آ کر اتریں تو وہاں سیدنا عبداللہ بن زبیر پیدا ہوئے ۔ پھر ولادت کے بعد انہیں لے کر نبی کریم صلی اللہ علیہ وسلم کے پاس آئیں تاکہ آپ صلی اللہ علیہ وسلم اس کو گھٹی لگائیں ، پس آپ صلی اللہ علیہ وسلم نے انہیں سیدہ اسماء رضی اللہ عنہا سے لے لیا اور اپنی گود میں بٹھایا ، پھر ایک کھجور منگوائی ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ ہم ایک گھڑی تک کھجور ڈھونڈتے رہے ، آخر آپ صلی اللہ علیہ وسلم نے کھجور کو چبایا ، پھر ( اس کا جوس ) ان کے منہ میں ڈال دیا ۔ یہی پہلی چیز جو عبداللہ کے پیٹ میں پہنچی ، وہ رسول اللہ صلی اللہ علیہ وسلم کا تھوک تھا ۔ سیدہ اسماء رضی اللہ عنہا نے کہا کہ اس کے بعد رسول اللہ صلی اللہ علیہ وسلم نے عبداللہ پر ہاتھ پھیرا اور ان کے لئے دعا کی اور ان کا نام عبداللہ رکھا ۔ پھر جب وہ سات یا آٹھ برس کے ہوئے تو سیدنا زبیر رضی اللہ عنہ کے اشارے پر وہ نبی کریم صلی اللہ علیہ وسلم سے بیعت کے لئے آئے ۔ جب نبی کریم صلی اللہ علیہ وسلم نے ان کو آتے دیکھا تو تبسم فرمایا ۔ پھر ان سے ( برکت کے لئے ) بیعت کی ( کیونکہ وہ کمسن تھے ) ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5617,
			"arabicnumber": "2146.02",
			"text": "ابو اسامہ نے ہشام سے ، انھوں نے ا پنے والد سے ، انھوں نے حضرت اسماء رضی اللہ تعالیٰ عنہا سے روایت کی کہ وہ مکہ میں حاملہ ہوئیں ، حضرت عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ ان کے پیٹ میں تھے ، حضرت اسماء رضی اللہ تعالیٰ عنہا نے کہاکہ جب میں ( مکہ سے ) نکلی تو میں پورے دنوں سے تھی ، پھر میں مدینہ آئی اورقباء میں ٹھہری اور قباء میں نے اسے ( عبداللہ ) کو جنم دیا ، پھر میں ر سول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئی تو آپ نے اسے اپنی گود میں لے لیا ، پھر آپ نے کھجور منگوائی ، اسے چبایا ۔ پھر اپنا لعاب دہن اس کے منہ میں ڈال دیا ، پہلی چیز جو اس کے پیٹ میں گئی وہ رسول اللہ صلی اللہ علیہ وسلم کالعاب دہن تھا ، پھر آپ نے ( چبائی ہوئی ) کھجور کی گھٹی اس کے تالو کولگائی ، پھر میں کے لئے دعا کی ، برکت مانگی ، ( ہجرت مدینہ کے بعد ) یہ پہلا بچہ تھا جو اسلام میں پیدا ہوا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5618,
			"arabicnumber": "2146.03",
			"text": "علی بن مسہر نے ہشام بن عروہ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت اسماء بنت ابی بکر رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے ر سول اللہ صلی اللہ علیہ وسلم کی طرف ہجرت کی ، اس وقت وہ عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ سےحاملہ تھیں ، پھر ابو اسامہ کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5619,
			"arabicnumber": "2147",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس بچے لائے جاتے ، آپ ان کے لئے برکت کی دعا کرتے اور انھیں گھٹی دیتے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5620,
			"arabicnumber": "2148",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سےروایت ہے ، کہا : ہم گھٹی دلوانے کے لئے عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ کو نبی کریم صلی اللہ علیہ وسلم کی خدمت میں لے گئے ، ہم نے کھجور حاصل کرنی چاہی تو ہمارے لیے اس کا حصول دشوار ہوگیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5621,
			"arabicnumber": "2149",
			"text": "حضرت سہل بن سعد ( بن مالک رضی اللہ تعالیٰ عنہ ) سے روایت ہے ، کہا : کہ ابواسید رضی اللہ عنہ کا بیٹا منذر ، جب پیدا ہوا تو اسے رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا گیا ۔ آپ صلی اللہ علیہ وسلم نے اس کو اپنی ران پر رکھا اور ( اس کے والد ) ابواسید ۔ بیٹھے تھے پھر آپ صلی اللہ علیہ وسلم کسی چیز میں اپنے سامنے متوجہ ہوئے تو ابواسید نے حکم دیا تو وہ بچہ آپ صلی اللہ علیہ وسلم کے ران پر سے اٹھا لیا گیا ۔ جب آپ صلی اللہ علیہ وسلم کو خیال آیا تو فرمایا کہ بچہ کہاں ہے؟ سیدنا ابواسید رضی اللہ عنہ نے کہا کہ یا رسول اللہ! ہم نے اس کو اٹھا لیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کا نام کیا ہے؟ ابواسید نے کہا کہ فلاں نام ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ نہیں ، اس کا نام منذر ہے ۔ پھر اس دن سے انہوں نے اس کا نام منذر ہی رکھ دیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5622,
			"arabicnumber": "2150",
			"text": "ابوتیاح نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم تمام انسانوں سے بڑھ کر خوش ا خلاق تھے ، میرا ایک بھائی تھا جسے ابو عمیر کہا جاتا تھا ۔ ( ابوالتیاح نے ) کہا : میرا خیال ہے ( انس رضی اللہ تعالیٰ عنہ نے ) کہا تھا : اس کا دودھ چھڑایا جاچکا تھا ، کہا : جب رسول اللہ صلی اللہ علیہ وسلم تشریف لاتے اور اسے دیکھتے تو فرماتے : ابو عمیر!نغیر نے کیا کیا \" وہ بچہ اس ( پرندے ) سے کھیلا کرتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5623,
			"arabicnumber": "2151",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" اے میرے بیٹے",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5624,
			"arabicnumber": "2152.01",
			"text": "یزید بن ہارون نے اسماعیل بن ابی خالد سے ، انھوں نے قیس بن ابی حازم سے ، انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم سے دجال کے متعلق جتنے سوالات میں نے کیے اتنے کسی اور نے نہیں کیے ، آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا؛ \" میرے بیٹے!تمھیں اس ( دجال ) سے کیا بات پریشان کررہی ہے؟تمھیں اس سے ہر گز کوئی نقصان نہ پہنچے گا ۔ \" کہا : میں نے عرض کی : لوگ سمجھتے ہیں کہ اس کے ساتھ پانی کی نہریں اور ر وٹی کے پہاڑ ہوں گے ۔ \" آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ اللہ تعالیٰ کے نزدیک اس کی نسبت زیادہ ذلیل ہے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5625,
			"arabicnumber": "2152.02",
			"text": "وکیع ، ہشیم ، جریر اور ابو اسامہ سب نے اسماعیل سے اسی سند کے ساتھ حدیث بیان کی ، ان میں سے تنہا یزید کی حدیث میں رسول اللہ صلی اللہ علیہ وسلم کی طرف سے مغیرہ رضی اللہ تعالیٰ عنہ کے لیے \" اے میرے بیٹے \" کے الفاظ ہیں اور کسی کی حدیث میں نہیں ہیں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5626,
			"arabicnumber": "2153.01",
			"text": "عمرو بن محمد بن بکیر ناقد نے کہا : ہمیں سفیان بن عینیہ نے حدیث بیان کی ، کہا : اللہ کی قسم!ہمیں یزید بن خصیفہ نے بسر بن سعید سے حدیث بیان کی ، کہا : میں نے حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا : میں مدینہ منورہ میں انصار کی مجلس میں بیٹھا ہوا تھا اتنے میں ابو موسیٰ ڈرے سہمے ہوئے آئے ، ہم نے ان سے پوچھا آپ کو کیا ہوا؟ انھوں نے بتایا کہ حضرت عمر رضی اللہ تعالیٰ عنہ نے میری طرف پیغام بھیجا ہے کہ میں ان کے پاس آؤں ، میں ان کے دروازے پر گیا اور تین مرتبہ سلام کیا انھوں نے مجھے سلام کا جواب نہیں دیا تو میں لوٹ آیا ، انھوں نے کہا : آپ کو ہمارے پاس آنے سے کس بات نے روکا؟میں نے کہا : میں آیا تھا ، آپ کے دروازے پر کھڑے تین بار سلام کیا ، آپ لوگوں نے مجھے جواب نہیں دیا ، اس لئے میں لوٹ گیا کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" جب تم میں سے کوئی شخص تین باراجازت مانگے اور اسے اجازت نہ دی جائے تو وہ لوٹ جائے ۔ \"\" حضرت عمر رضی اللہ تعالیٰ عنہ نے فرمایا : اس پر گواہی پیش کرو ورنہ میں تم کو سزا دوں گا ۔ حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ نے کہا : ان کے ساتھ صرف وہ شخص جا کرکھڑا ہوگا جو قوم میں سے سب سے کم عمر ہے ، حضرت ابو سعید رضی اللہ تعالیٰ عنہ نے کہا : میں نے کہا کہ میں سب سے کم عمر ہوں توانھوں نے کہا : تم ان کے ساتھ جاؤ ( اور گواہی دو)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5627,
			"arabicnumber": "2153.02",
			"text": "قتیبہ بن سعید اور ابن ابی عمر نے کہا : \" ہمیں سفیان نے یزید بن خصیفہ سے اسی سند کے ساتھ حدیث بیان کی اور ابن ابی عمر نے اپنی حدیث میں یہ اضافہ کیا : حضرت ابو سعید رضی اللہ تعالیٰ عنہ نے کہا : میں ان کے ہمرا اٹھ کھڑا ہوا ، حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس گیا اور گواہی دی ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5628,
			"arabicnumber": "2153.03",
			"text": "بکیر بن اشج سے روایت ہے کہ بسر بن سعید نے انھیں حدیث بیان کی ، انھوں نے حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے : ایک مجلس میں ہم حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ کے پا س بیٹھےہوئے تھے ۔ اتنے میں حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ غصے کی حالت میں آئے اور کھڑے ہوگئے پھر کہنے لگے : میں تم کو اللہ کی قسم دیتا ہوں کہ تم میں سے کسی شخص نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \"\" اجازت تین بار مانگی جاتی ہے ، اگر تمھیں اجازت مل جائے ( تو اندر آجاؤ ) ، نہیں تو لوٹ جاؤ؟حضرت ابی نے کہا معاملہ کیا ہے؟انھوں نے کہا : میں نے کل حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس تین بار اجازت مانگی ، مجھے اجازت نہیں دی گئی تو میں لوٹ گیا پھر میں آج ان کے پاس آیاتو ان کے پا س حاضر ہوگیا ۔ میں نے انھیں بتایا کہ میں کل آیا تھا ، تین بار سلام کیا تھا ، پھر چلا گیا تھا ۔ کہنے لگے ہم نے سن لیاتھا ، اس وقت ہم کسی کام میں لگے ہوئے تھے تم کیوں نہ اجازت مانگتے رہے یہاں تک کہ تمھیں اجازت مل جاتی ۔ میں نے کہا : میں نے اسی طرح اجازت مانگی جس طرح میں نے ر سول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا تھا ۔ کہنے لگے : اللہ کی قسم!میں تمھاری پشت اور پیٹھ پر کوڑے ماروں گا پھر تم کوئی ایسا شخص لے آؤ جو تمہارے لئے اس پر گواہی دے ۔ حضرت ابی ابن کعب کہنے لگے : اللہ کی قسم!تمھارے ساتھ ہم میں سے صرف وہ کھڑاہوگا جو عمر میں سب سے چھوٹاہے ( بڑے تو بڑے ہیں یہ حدیث ہم میں سے کم عمر لوگوں نے بھی سنی ہے اور یادرکھی ہے ۔ ) ابو سعید !اٹھو ، ( انھوں نے کہا ) تو میں اٹھا ، حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس آیا اور کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو ا س طرح فرماتے ہوئے سنا تھا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5629,
			"arabicnumber": "2153.04",
			"text": "بشر بن مفضل نے کہا : ہمیں سعید بن یزید نے ابو نضرہ سے حدیث بیان کی ، انھوں نے حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے ر وایت کی کہ حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ حضرت عمر رضی اللہ تعالیٰ عنہ کے دروازے پر گئے اور اجازت طلب کی ، حضرت عمر رضی اللہ تعالیٰ عنہ نےکہا : یہ ایک بار ہے ۔ پھر انھوں نے دوبارہ اجازت طلب کی ، حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : یہ دوسری بار ہے ۔ پھر انہوں نے تیسری باراجازت طلب کی ، حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : یہ تیسری بار ہے ، پھر وہ لوٹ گئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے ( اگلے دن ) کسی کو ان کے پیچھے روانہ کیا اور انھیں دوبارہ بلا بھیجا ۔ پھر ( حضرت عمر رضی اللہ تعالیٰ عنہ نے ) ان سے کہا : اگر یہ ایسی بات ہے جو تم نے رسول اللہ صلی اللہ علیہ وسلم سے ( سن کر ) یار رکھی ہے تو ٹھیک ہے ، اگر نہیں تو میں تمھیں ( دوسروں کے لیے نشان ) عبرت بنا دوں گا ۔ حضرت ابو سعید رضی اللہ تعالیٰ عنہ نے کہا : تو وہ ہمارے ہاں آئے اور کہنے لگے : تمھیں علم نہیں ہے کہ ر سول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" اجازت تین بار طلب کی جاتی ہے؟ \" کہا : تو لوگ ہنسنے لگے ، کہا : میں نے ( لوگوں سے کہا : ) تمھارے پاس تمھارا مسلمان بھائی ڈرا ہوا آیا ہے اور تم ہنس رہے ہو؟ ( پھر حضرت موسیٰ رضی اللہ تعالیٰ عنہ سے کہا : ) چلیں میں اس سزا میں آپ کا حصہ دار بنوں گاپھر وہ حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس آئے اور کہا : یہ ابو سعید ہیں ( یہ میرے گواہ ہیں ۔)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5630,
			"arabicnumber": "2153.05",
			"text": "شعبہ نے ابو سلمہ جریری اور سعید بن یزید سے حدیث بیان کی ، جریری اور سعید بن یزید دونوں نے ابو نضر ہ سے روایت کی ، دونوں نے کہا : ہم نے انھیں ابو سعید خدری رضی اللہ تعالیٰ عنہ سے اسی حدیث کے ہم معنی حدیث بیان کر تے ہو ئے سنا ، جس طرح بشر بن مفضل نے ابو سلمہ سے روایت کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5631,
			"arabicnumber": "2153.06",
			"text": "یحییٰ بن سعیدقطان نے ابن جریج سے روایت کی کہا : ہمیں عطاء نے عبید بن عمیر سے حدیث بیان کی کہ حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ نے حضرت عمر رضی اللہ تعالیٰ عنہ سے تین مرتبہ اجا زت طلب کی تو جیسے انھوں نے حضرت عمر رضی اللہ تعالیٰ عنہ کو مشغول سمجھا اور واپس ہو گئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : کیا ہم نے عبد اللہ بن قیس ( ابو موسیٰ رضی اللہ تعالیٰ عنہ ) کی آواز نہیں سنی تھی؟ ان کو اندر آنے کی اجازت دو ، ( حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ واپس چلے گئے ہوئے تھے ، دوسرے دن ) حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ کو بلا یا گیا حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : تم نے ایسا کیوں کیا؟ انھوں نے کہا : ہمیں یہی ( کرنے کا ) حکم دیا جا تا تھا ۔ انھوں نے کہا : تم اس پر گواہی دلاؤ ، نہیں تو میں ( وہ ) کروں گا ( جو کروںگا ) وہ ( حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ ) نکلے انصار کی مجلس میں آئے انھوں نے کہا : اس بات پر تمھا رے حق میں اور کو ئی نہیں ، ہم میں سے جو سب سے چھوٹا ہے وہی گواہی دے گا ۔ ابو سعید رضی اللہ تعالیٰ عنہ نے ( حضرت عمر رضی اللہ تعالیٰ عنہ کے سامنے ) کھڑے ہو کر کہا : ہمیں ( رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ) اسی کا حکم دیا جا تا تھا ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم کا یہ حکم مجھ سے اوجھل رہ گیا ، بازاروں میں ہو نے والے سودوں نے مجھے اس سے مشغول کردیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5632,
			"arabicnumber": "2153.07",
			"text": "ابو عاصم اور نضر بن شمیل دونوں نے کہا : ہمیں ابن جریج نے اسی سند کے ساتھ اسی طرح حدیث بیان کی ۔ اور نضر کی حدیث میں انھوں نے \" بازاروں میں ہو نے والے سودوں نے مجھے اس سے مشغول کردیا ۔ \" کے الفا ظ بیان نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5633,
			"arabicnumber": "2154.01",
			"text": "افضل بن موسیٰ نے کہا : ہمیں طلحہ بن یحییٰ نے ابو بردہ سے خبر دی ، انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کے پاس آئے اور کہا : السلام علیکم ، عبد اللہ بن قیس ( حاضر ہوا ) ہے ، انھوں نے آنے کی اجازت نہ دی ۔ انھوں نے پھر کہا : السلام علیکم ، یہ ابو موسیٰ ہے ، السلام علیکم ، یہ اشعری ہے ، اس کے بعد چلے گئے ، حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : ان کو میرے پاس واپس لا ؤ ۔ میرے پاس واپس لا ؤ ۔ وہ آئے تو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : ابو موسیٰ !آپ کو کس بات نے لوٹا دیا ؟ ہم کا م میں مشغول تھے ۔ انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے فر ما یا : \"\" اجازت تین بار طلب کی جا ئے ، اگر تم کو اجازت دے دی جا ئے ( توآ جاؤ ) ورنہ لوٹ جا ؤ ۔ \"\" حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : یا تو آپ اس پر گواہ لا ئیں گے یا پھر میں یہ کروں گا تو حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ چلے گئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا ابو موسیٰ کو گواہ مل گیا تو شام کو وہ تمھیں منبر کے پاس ملیں گے اور اگر ان کو گواہ نہیں ملا تو وہ تمھیں نہیں ملیں گے ، جب حضرت عمر رضی اللہ تعالیٰ عنہ شام کو آئے تو انھوں نے حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ کو موجود پا یا ، انھوں نے کہا ابو موسیٰ !کیا کہتے ہیں ؟آپ کو گواہ مل گیا ؟ انھوں نے کہا : ہاں! ابی بن کعب ہیں انھوں ( حضرت عمر رضی اللہ تعالیٰ عنہ ) نے کہا : وہ قابل اعتماد گواہ ہیں ۔ ( پھر ابو طفیل عامر بن واثلہ رضی اللہ تعالیٰ عنہ کی طرف متوجہ ہو کر ) کہا : ابو طفیل !یہ ( ابی بن کعب رضی اللہ تعالیٰ عنہ ) کیا کہتے ہیں ؟ انھوں ( حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ ) نے کہا : ابن خطاب !میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ یہی فر ما رہے تھے ۔ لہٰذا آپ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین پر عذاب نہ بنیں ۔ انھوں نے کہا : سبحان اللہ !میں نے ایک چیز سنی اور چاہا کہ اس کا ثبوت حاصل کروں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5634,
			"arabicnumber": "2155.01",
			"text": "علی بن ہاشم نے طلحہ بن یحییٰ سے اسی سند کے ساتھ حدیث بیان کی ، مگر انھوں نے کہا : تو انھوں ( حضرت عمر رضی اللہ تعالیٰ عنہ ) نے کہا : ابو منذر! ( ابی بن کعب رضی اللہ تعالیٰ عنہ کی کنیت ) کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے یہ حدیث سنی تھی ؟انھوں نے کہا : ہاں ، ابن خطاب !تو آپ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین کے لیے عذاب نہ بنیں اور انھوں نے حضرت عمر رضی اللہ تعالیٰ عنہ کا قول : سبحان اللہ اور اس کے بعد کا حصہ ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5635,
			"arabicnumber": "2155.02",
			"text": "عبد اللہ بن ادریس نے شبعہ سے انھوں نے محمد بن منکدر سے ، انھوں نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نبی صلی اللہ علیہ وسلم کی خدمت میں حا ضر ہوا اور آواز دی نبی صلی اللہ علیہ وسلم نے فر ما یا \" کون ہے \" ؟میں نے کہا : میں ۔ آپ باہر تشریف لا ئے اور آپ فرما رہے تھے َ \" میں ، میں ( کیسا جواب ہے؟)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5636,
			"arabicnumber": "2155.03",
			"text": "وکیع نے شعبہ سے ، انھوں نے محمد بن منکدر سے ، انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : نبی صلی اللہ علیہ وسلم کے ہاں اجازت طلب کی ، آپ نے فرما یا : \" یہ کو ن ہے؟ \" میں نے کہا : میں ۔ نبی صلی اللہ علیہ وسلم نے فر ما یا : \" میں ، میں ! ( سے کیا پتہ چل سکتا ہے ؟)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5638,
			"arabicnumber": "2156.01",
			"text": "لیث نے ابن شہاب سے روایت کی کہ حضرت سہل بن سعد ساعدی رضی اللہ تعالیٰ عنہ نے انھیں بتا یا کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے دروازے کی جھری میں اندر جھا نکا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم کے پاس ( لکڑی یا لو ہے کا لمبی لمبی کئی نوکوں والا ) بال درست کرنے کا ایک آلہ تھا جس سے آپ سر کھجا رہے تھے ، جب رسول اللہ صلی اللہ علیہ وسلم نے اس کو دیکھا تو فرما یا : \" اگر مجھے یقینی طور پر پتہ چل جا تا کہ تم مجھے دیکھ رہے ہو تو میں اس کو تمھا ری آنکھوں میں گھسا دیتا ، \" رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اجازت لینے کا طریقہ آنکھ ہی کی وجہ سے تو رکھا گیا ہے ۔ \" ( کہ آنکھ کسی خلوت کے عالم میں نہ دیکھ سکے ۔)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5639,
			"arabicnumber": "2156.02",
			"text": "یو نس نے ابن شہاب سے روایت کی کہ سہل بن سعدانصاری رضی اللہ تعالیٰ عنہ نے انھیں بتا یا کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے دروازے میں بن جا نے والی جھری میں سے جھا نکا ، اس وقت رسول اللہ صلی اللہ علیہ وسلم کے پاس بال درست کرنے والا لوہے کا ایک آلہ تھا جس سے آپ سر کے بالوں کو سنوار رہے تھے رسول اللہ صلی اللہ علیہ وسلم نے اس سے فر ما یا : \" اگر میں جان لیتا کہ تو واقعی مجھے دیکھ رہے ہو تو میں اس کو تمھا ری آنکھوں میں چبھو دیتا ۔ اللہ نے اجازت لینے کا طریقہ آنکھ ہی کے لیے تو رکھا ہے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5640,
			"arabicnumber": "2156.03",
			"text": "سفیان بن عیینہ اور معمر دونوں نے زہری سے انھوں نے حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے لیث اور یونس کی حدیث کی طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5641,
			"arabicnumber": "2157",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے حجرے میں جھا نکا رسول اللہ صلی اللہ علیہ وسلم چوڑے پھل کا ایک تیر یا کئی تیرلے کر اٹھے جیسے میں رسول اللہ صلی اللہ علیہ وسلم کو دیکھ رہا ہو ں کہ آپ خاموشی سے اس کی آنکھوں میں وہ تیر چبھو نے کے امکا ن کا جائزہ لے رہے تھے ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5642,
			"arabicnumber": "2158.01",
			"text": "سہیل کے والد ابو صالح نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فر ما یا : \" جس نے اجازت کے بغیر لو گوں کے گھر میں تانک جھانک کی ، انھیں اجا زت ہے کہ وہ اس کی آنکھ پھوڑدیں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5643,
			"arabicnumber": "2158.02",
			"text": "اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اگر کو ئی شخص اجازت کے بغیر تمھا رے ہاں جھا نکے اور تم کنکری مارکر اس کی آنکھ پھوڑدو تو تم پر کو ئی گناہ نہیں ہے ( کو ئی سزایا جرمانہ نہیں ۔)",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5644,
			"arabicnumber": "2159.01",
			"text": "یزید بن زریع ، اسماعیل بن علیہ اور ہشیم نے یو نس سے ، انھوں نے عمرو بن سعید سے ، انھوں نے ابوزرعہ سے ، انھوں نے حضرت جریر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم سے اچانک نظر پڑجا نے کے بارے میں پو چھا تو آپ نے مجھے حکم دیا کہ میں اپنی نظر ہٹا لوں ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5645,
			"arabicnumber": "2159.02",
			"text": "عبد الاعلیٰ اور سفیان دونوں نے یو نس سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 38,
				"hadith": 60
			}
		}
	]
}