{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"39": "The Book of Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5646,
			"arabicnumber": "2160",
			"text": "عبد الرحمٰن بن زید کے آزاد کردہ غلام ثابت نے بتا یا کہ انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" سوار پید ل کو سلام کرے ، چلنے والا بیٹھے ہو ئے کو سلام کرے اور کم لو گ زیادہ لوگوں کو سلام کریں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 5647,
			"arabicnumber": "2161",
			"text": "اسحاق بن عبد اللہ بن ابی طلحہ نے اپنے والد سے روایت کی ، انھوں نے کہا کہ حضرت ابو طلحہ رضی اللہ تعالیٰ عنہ نے کہا : ہم مکانوں کے سامنے کی کھلی جگہوں میں بیٹھے باتیں کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے اور ہمارے پاس کھڑے ہو گئے ۔ آپ نے فر ما یا : \" تمھا را راستوں کی خالی جگہوں پر مجلسوں سے کیا سروکار؟ راستوں کی مجا لس سے اجتناب کرو ۔ \" ہم ایسی باتوں کے لیے بیٹھے ہیں جن میں کسی قسم کی کو ئی قباحت نہیں ، ہم ایک دوسرے سے گفتگو اور بات چیت کے لیے بیٹھے ہیں ، آپ نے فر ما یا : \" اگر نہیں ( رہ سکتے ) تو ان ( جگہوں ) کے حق ادا کرو ( جو یہ ہیں ) : آنکھ نیچی رکھنا ، سلام کا جواب دینا اور اچھی گفتگو کرنا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 5648,
			"arabicnumber": "2121.03",
			"text": "حفص بن میسرہ نے زید بن اسلم سے ، انھوں نے عطاء بن یسار سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فر ما یا : \" راستوں میں بیٹھنے سے اجتنا ب کرو ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم !ہمارے لیے ( را ستے کی ) مجلسوں کے بغیر جن میں ( بیٹھ کر ) ہم باتیں کرتے ہیں ، کو ئی چارہ نہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : اگر تم مجا لس کے بغیر نہیں رہ ہو سکتے تو را ستے کا حق ادا کرو ۔ \" لوگوں نے کہا : اس کا حق کیا ہے ؟آپ نے فر ما یا : \" نگاہ نیچی رکھنا تکلیف دہ چیزوں کو ( را ستے سے ) ہٹانا ، سلام کا جواب دینا ، اچھا ئی کی تلقین کرنا اور بر ائی سے روکنا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 5649,
			"arabicnumber": "2121.04",
			"text": "عبد العزیزبن محمد مدنی اور ہشام بن سعد دونوں نے زید بن اسلم سے اسی سند کے ساتھ روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5650,
			"arabicnumber": "2162.01",
			"text": "یو نس نے ابن شہاب ( زہری ) سے انھوں نے ابن مسیب سے روایت کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : مسلمان کے مسلمان پر پا نچ حق ہیں ۔ \"\" نیز عبد الرزاق نے کہا : ہمیں معمر نے ( ابن شہاب ) زہری سے خبر دی ، انھوں نے ابن مسیب سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : \"\" ایک مسلمان کے لیے اس کے بھا ئی پر پانچ چیزیں واجب ہیں : سلام کا جواب دینا چھینک مارنے والے کے لیے رحمت کی دعا کرنا دعوت قبول کرنا ، مریض کی عیادت کرنا اور جنازوں کے ساتھ جا نا ۔ \"\" عبدالرزاق نے کہا : معمر اس حدیث ( کی سند ) میں ارسال کرتے تھے ( تابعی اور صحابی کا نام ذکر نہیں کرتے تھے ) اور کبھی اسے ( سعید ) بن مسیب اور آگے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کی سند سے ( متصل مرفوع ) روایت کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 5651,
			"arabicnumber": "2162.02",
			"text": "اسماعیل بن جعفر نے اپنے والد سے ، انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے ، روایت کی ، کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مسلمان کے دوسرے مسلمان پر چھ حق ہیں ۔ \" پوچھا گیا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !وہ کو ن سے ہیں ؟ آپ صلی اللہ علیہ وسلم نے فر ما یا : جب تم اس سے ملو تو اس کو سلام کرو اور جب وہ تم کو دعوت دے تو قبول کرو اور جب وہ تم سے نصیحت طلب کرے تو اس کو نصیحت کرو ، اور جب اسے چھینک آئے اور الحمدللہ کہے تو اس کے لیے رحمت کی دعاکرو ۔ جب وہ بیمار ہو جا ئے تو اس کی عیادت کرو اور جب وہ فوت ہو جا ئے تو اس کے پیچھے ( جنازے میں ) جاؤ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 5652,
			"arabicnumber": "2163.01",
			"text": "عبید اللہ بن ابی بکر نے اپنے داداحضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کرتے ہو ئے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جب اہل کتاب تم کوسلام کریں تو تم ان کے جواب میں \" وعلیکم \" ( اورتم پر ) کہو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 5653,
			"arabicnumber": "2163.02",
			"text": "شعبہ نے کہا کہ میں نے قتادہ سے سنا ، وہ حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کرتےہو ئے حدیث بیان کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی : اہل کتاب ہمیں سلام کرتے ہیں ۔ ہم ان کو کیسے جواب دیں ، آپ نے فر ما یا : \" تم لوگ \" وعلیکم \" ( اور تم پر ) کہو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 5654,
			"arabicnumber": "2164.01",
			"text": "اسماعیل بن جعفر نے عبد اللہ بن دینار سے روایت کی ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : جب یہود تم کو سلام کرتے ہیں تو ان میں سے کو ئی شخص ( اَلسَامُ عَلَيكُم ) ( تم پر موت نازل ہو ) کہتا ہے ۔ \" ( اس پر ) تم ( عَلَيكُم ) ( تجھ پر ہو ) کہو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 5655,
			"arabicnumber": "2164.02",
			"text": "سفیان نے عبد اللہ بن دینار سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے مانند روایت کی مگر اس میں ہے ۔ \" تو تم پر کہو : \" وعلیکم \" ( تم پرہو ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 5656,
			"arabicnumber": "2165.01",
			"text": "سفیان بن عیینہ نے ہمیں زہری سے حدیث بیان کی انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : یہودیوں کی ایک جماعت نے رسول اللہ صلی اللہ علیہ وسلم سے ملنے کے لیے اجازت طلب کی اور انھوں نے کہا ( اَلسَامُ عَلَيكُم ) ( آپ پر مو ت ہو! ) حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : بلکہ تم پر موت ہو اور لعنت ہو ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : عائشہ !اللہ تعا لیٰ ہر معا ملے میں نرمی پسند فر ما تا ہے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے عرض کی : کیا آپ نے سنانہیں کہ انھوں نے کیا کہا تھا ؟آپ صلی اللہ علیہ وسلم نے فر ما یا : میں نے ( وَ عَلَيكُم ) ( اور تم پرہو ) کہہ دیاتھا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 5657,
			"arabicnumber": "2165.02",
			"text": "صالح اور معمر دونوں نے زہری سے اسی سند کے ساتھ حدیث بیان کی ، دونوں کی حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں نے علیکم کہہ دیا تھا ۔ \" اور انھوں نے اس کے ساتھ واؤ ( اور ) نہیں لگا یا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 5658,
			"arabicnumber": "2165.03",
			"text": "ابو معاویہ نے اعمش سے ، انھوں نے مسلم سے انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، رسول اللہ صلی اللہ علیہ وسلم کے پاس یہود میں سے کچھ لو گ آئے ، انھوں نے آکر کہا : ( السام عليك يا أبا القاسم ) ( ابو القاسم !آپ پر موت ہو ) کہا آپ نے فر ما یا : \" وَ عَلَيكُم ( تم لوگوں پر ہو! ) حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فر ما یا : \" بلکہ تم پر موت بھی ہو ذلت بھی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" عائشہ رضی اللہ تعالیٰ عنہا !زبان بری نہ کرو ۔ انھوں ( عائشہ رضی اللہ تعالیٰ عنہا ) نے کہا : آپ نے نہیں سنا ، انھوں نے کیا کہا تھا ؟آپ صلی اللہ علیہ وسلم نے فر ما یا : \" انھوں نے جو کہا تھا میں نے ان کو لوٹا دیا ، میں نے کہا : تم پر ہو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 5659,
			"arabicnumber": "2165.04",
			"text": "یعلیٰ بن عبید نے ہمیں خبر دی کہا : ہمیں اعمش نے اسی سند کے ساتھ حدیث بیان کی ، مگر انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ان کی بات سمجھ لی ( انھوں نے سلام کے بجا ئے سام کا لفظ بولا تھا ) اور انھیں برا بھلا کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" عائشہ رضی اللہ تعالیٰ عنہا ! بس کرو ، اللہ تعا لیٰ برا ئی اور اسے اپنالینے کو پسند نہیں فرماتا ۔ \" اور یہ اضافہ کیا تو اس پر اللہ عزوجل نے ( وَإِذَا جَاءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ ) نازل فر ما ئی : \" اور جب وہ آپ کے پاس آتے ہیں تو آپ کو اس طرح سلام نہیں کہتے جس طرح اللہ آپ کو سلام کہتا ہے ۔ \" آیت کے آخر تک ( اور اپنے دلوں میں کہتے ہیں جو کچھ ہم کہتے ہیں اللہ اس پر ہمیں عذاب کیوں نہیں دیتا ؟ان کے لیے دوزخ کا فی ہے جس میں وہ جلیں گے اور وہ لوٹ کر جانے کا بدترین ٹھکا ناہے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 5660,
			"arabicnumber": "2166",
			"text": "ابوزبیر نے کہا : انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا : یہود میں سے کچھ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو سلام کیا اور کہا ( السام عليك يا أبا القاسم ) ( ابو القاسم ) آپ پر مو ت ہو!اس پر آپ نے فر ما یا : \" تم پرہو ۔ \" حضرت عائشہ رضی اللہ تعالیٰ عنہا کہنے لگیں اور وہ غصے میں آگئی تھیں ۔ کیا آپ نے نہیں سنا ، جو انھوں نے کہا ہے ؟ آپ نے فر ما یا : \" کیوں نہیں !میں نے سنا ہے اور میں نے ان کو جواب دے دیا ہےاور ان کے خلاف ہماری دعاقبول ہو تی ہے اور ہمارے خلا ف ان کی دعا قبول نہیں ہو تی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 5661,
			"arabicnumber": "2167.01",
			"text": "عبد العزیز دراوردی نے سہیل سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" یہود نصاری ٰکو سلام کہنے میں ابتدانہ کرو اور جب تم ان میں سے کسی کو راستے میں ملو ( تو بجا ئے اس کے وہ یہ کام کرے ) تم اسے راستے کے تنگ حصے کی طرف جا نے پر مجبورکردو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 5662,
			"arabicnumber": "2167.02",
			"text": "محمد بن مثنیٰ نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث بیان کی ۔ ابو بکر بن ابی شیبہ اور ابو کریب نے کہا : ہمیں وکیع نے سفیان سے حدیث بیان کی ، زہیر بن حرب نے کہا : ہمیں جریر نے حدیث بیان کی ، ان سب ( شعبہ سفیان اور جریر ) نے سہیل سے اسی سند کے ساتھ حدیث بیان کی ۔ وکیع کی حدیث میں ہے ، \" جب تم یہود سے ملو ۔ \" شعبہ سے ابن جعفر کی روایت کردہ حدیث میں ہے ۔ آپ صلی اللہ علیہ وسلم نے اہل کتاب کے بارے میں فر ما یا ۔ اور جریر کی روایت میں ہے : \" جب تم ان لوگوں سے ملو ، \" اور مشرکوں میں سے کسی ایک ( گروہ ) کا نام نہیں لیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 5663,
			"arabicnumber": "2168.01",
			"text": "۔ یحییٰ بن یحییٰ نے کہا : ہمیں ہشیم نے سیارے سے خبر دی ، انھوں نے ثابت بنا نی سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہ رسول اللہ صلی اللہ علیہ وسلم ان ( انصار ) کے لڑکوں کے پاس سے گزرے تو آپ نے ان کو سلام کیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 5664,
			"arabicnumber": "2168.02",
			"text": "اسماعیل بن سالم نے کہا : ہمیں ہشیم نے خبر دی کہا : ہمیں سیار نے اسی سند کے ساتھ خبر دی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 5665,
			"arabicnumber": "2168.03",
			"text": "شعبہ نے سیار سے روایت کی ، کہا : میں ثابت بنانی کے ساتھ جا رہا تھا وہ کچھ بچوں کے پاس سے گزرے تو انھیں سلام کیا ، پھر ثابت نے یہ حدیث بیان کی کہ وہ حضرت انس رضی اللہ تعالیٰ عنہ کے ساتھ جا رہے تھے وہ بچوں کے پاس سے گزرے تو انھوں نے ان کو سلام کیا ۔ اور حضرت انس رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جا رہے تھے آپ صلی اللہ علیہ وسلم بچوں کے پاس سے گزرے تو ان کو سلام کیا ،",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 5666,
			"arabicnumber": "2169.01",
			"text": "عبد الوحد بن زیاد نے کہا : ہمیں حسن بن عبید اللہ نے حدیث بیان کی ۔ کہا : ہمیں ابرا ہیم بن سوید نے حدیث سنائی کہا : میں نے عبد الرحمٰن بن یزید سے سنا ، انھوں نے کہا : میں نے حضرت ابن مسعود رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فر ما یا : \" تمھا رے لیے میرے پاس آنے کی یہی اجازت ہے کہ حجاب اٹھا دیا جا ئے اور تم میرے راز کی بات سن لو ، ( یہ اجازت اس وقت تک ہے ) حتی کہ میں تمھیں روک دوں",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 5667,
			"arabicnumber": "2169.02",
			"text": "عبد اللہ بن ادریس نے حسن بن عبد اللہ سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 5668,
			"arabicnumber": "2170.01",
			"text": "ابو بکر بن ابی شیبہ اور ابو کریب نے کہا : ہمیں ابو اسامہ نے ہشام سے حدیث بیان کی ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : پردہ ہم پرلاگو ہوجانےکےبعد حضرت سودہ رضی اللہ تعالیٰ عنہا قضائے حاجت کے لیے باہر نکلیں ، حضرت سودہ رضی اللہ تعالیٰ عنہا جسامت میں بڑی تھیں ، جسمانی طور پر عورتوں سے اونچی ( نظر آتی ) تھیں ۔ جوشخص انہیں جانتا ہو ( پردے کے باوجود ) اس کے لیے مخفی نہیں رہتی تھی ، حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے انھیں دیکھ کر کہا : سودہ رضی اللہ تعالیٰ عنہا !اللہ کی قسم!آپ ہم سے پوشیدہ نہیں رہ سکتیں اس لیے دیکھ لیجئے آپ کیسے باہر نکلا کریں گی ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : حضرت سودہ رضی اللہ تعالیٰ عنہا ( یہ سنتے ہی ) الٹے پاؤں لوٹ آئیں اور ( اس وقت ) رسول اللہ صلی اللہ علیہ وسلم میرے ہاں رات کا کھانا تناول فرما رہے تھے ۔ آپ کے دست مبارک میں گوشت والی ایک ہڈی تھی وہ اندر آئیں اور کہنے لگیں ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! میں باہر نکلی تھی اور حضرت عمر رضی اللہ تعالیٰ عنہ نے مجھے اس اس طرح کہا ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اسی وقت اللہ تعا لیٰ نے آپ پر وحی نازل فر ما ئی ، پھر آپ سے وحی کی کیفیت زائل ہو گئی ، ہڈی اسی طرح آپ کے ہاتھ میں تھی ، آپ نے اسے رکھا نہیں تھا ، آپ نے فر ما یا : تم سب ( امہات المومنین ) کو اجازت دے دی گئی ہے کہ تم ضرورت کے لیے باہر جا سکتی ہو ۔ \"\" ابوبکر ( ابن ابی شیبہ ) کی روایت میں ہے : \"\" ان کا جسم عورتوں سے اونچاتھا \"\" ابو بکر نے اپنی حدیث ( کی سند ) میں یہ اضافہ کیا : تو ہشام نے کہا : آپ کا مقصود قضائے حاجت کے لیے جا نے سے تھا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 5671,
			"arabicnumber": "2170.04",
			"text": "عقیل بن خالد نے ابن شہاب سے ، انھوں نے عروہ بن زبیر سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم کی ازواج جب رات کو قضائے حاجت کے لئے باہر نکلتیں تو \"\" المناصع \"\" کی طرف جاتی تھیں ، وہ دور ایک کھلی ، بڑی جگہ ہے ۔ اور حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم سے یہ عرض کرتے رہتے تھے کہ آپ اپنی ازواج کو پردہ کرائیں ، رسول اللہ صلی اللہ علیہ وسلم ( کسی حکمت کی بنا پر ) ایسا نہیں کرتے تھے ، پھر ایک رات کو نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت سودہ بنت زمعہ رضی اللہ تعالیٰ عنہا عشاء کے وقت ( قضائے حاجت کے لئے ) باہرنکلیں ، وہ دراز قدخاتون تھیں ، تو عمر رضی اللہ تعالیٰ عنہ نے اس حرص میں کہ حجاب نازل ہوجائے ، پکار کر ان سے کہا : سودہ! ہم نے آپ کو پہچان لیا ہے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اس پر اللہ تعالیٰ نے حجاب نازل فرمادیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 5672,
			"arabicnumber": "2170.05",
			"text": "صالح نے ابن شہاب سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 5673,
			"arabicnumber": "2171",
			"text": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے خبر دی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سنو! کوئی شخص کسی شادی شدہ عورت کے پاس رات کو نہ رہے ، الا یہ کہ اس کا خاوند ہو یا محرم ( غیر شادی شدہ عورت کے پاس رہنا اورزیادہ سختی سے ممنوع ہے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 5674,
			"arabicnumber": "2172.01",
			"text": "قتیبہ بن سعید اور محمد بن رمح نے کہا : ہمیں لیث نے یزید بن ابی حبیب سے خبر دی ، انھوں نے ابو الخیر سے ، انھوں نے حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" تم ( اجنبی ) عورتوں کے ہاں جانے سے بچو ۔ انصار میں سے ایک شخص نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! دیور/جیٹھ کے متعلق آپ کا کیاخیال ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" دیور/جیٹھ تو موت ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 5675,
			"arabicnumber": "2172.02",
			"text": "عبداللہ بن وہب نے عمرو بن حارث ، لیث بن سعد اور حیوہ بن شریح وغیرہ سے روایت کی کہ یزید بن ابی حبیب نے انھیں اسی سند کے ساتھ اسی کے مانند روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 5676,
			"arabicnumber": "2172.03",
			"text": "ابن وہب نے کہا : میں نے لیث بن سعد سے سنا ، کہہ رہے تھے : حمو ( دیور/جیٹھ ) خاوند کابھائی ہے یا خاوند کے رشتہ داروں میں اس جیسا رشتہ رکھنے والا ، مثلاً : اس کا چچا زاد وغیرہ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 5677,
			"arabicnumber": "2173",
			"text": "عبدالرحمان بن جبیر نے کہا کہ حضرت عبداللہ بن عمرو بن عاص رضی اللہ تعالیٰ عنہ نے انھیں حدیث سنائی کہ بنو ہاشم کے کچھ لوگ حضرت اسماء بنت عمیس رضی اللہ تعالیٰ عنہا کے گھر گئے ، پھر حضرت ابو بکر رضی اللہ تعالیٰ عنہ بھی آگئے ، حضرت اسماء رضی اللہ تعالیٰ عنہا اس وقت ان کے نکاح میں تھیں ۔ انھوں نے ان لوگوں کو دیکھا تو انھیں ناگوارگزرا ۔ انھوں نے یہ بات رسول اللہ صلی اللہ علیہ وسلم کو بتائی ، ساتھ ہی کہا : میں نے خیر کے سواکچھ نہیں دیکھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے ( بھی ) انھیں ( حضرت اسماء بنت عمیس رضی اللہ تعالیٰ عنہا کو ) اس سے بری قرار دیا ہے ، پھر رسول اللہ صلی اللہ علیہ وسلم منبر پر کھڑے ہوئے اور فرمایا؛ \" آج کے بعد کوئی شخص کسی ایسی عورت کے پا س نہ جائے جس کا خاوند گھر پر نہ ہو ، الا یہ کہ اس کے ساتھ ایک یا دو لوگ ہوں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 5678,
			"arabicnumber": "2174",
			"text": "ثابت بنانی نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم ( گھرسے باہر ) اپنی ایک اہلیہ کے ساتھ تھے ، آپ کے پا س سے ایک شخص گزرا تو آپ نے اسے بلالیا ، جب وہ آیا تو آپ نے فرمایا؛ \" اے فلاں!یہ میری فلاں بیوی ہے ۔ \" اس شخص نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! میں کسی کے بارے میں گمان کرتا بھی تو آپ کے بارے میں تو نہیں کرسکتا تھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" شیطان انسان کی رگوں میں خون کی طرح دوڑتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 5679,
			"arabicnumber": "2175.01",
			"text": "معمر نے زہری سے ، انھوں نے علی بن حسین رضی اللہ تعالیٰ عنہ سے ، انھوں نے حضرت صفیہ بنت حی ( ام الومنین رضی اللہ تعالیٰ عنہا ) سے روایت کی ، کہا : ام المؤمنین صفیہ بنت حیی رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اعتکاف میں تھے ، میں رات کو آپ صلی اللہ علیہ وسلم کی زیارت کو آئی ۔ میں نے آپ صلی اللہ علیہ وسلم سے باتیں کیں ، پھر میں لوٹ جانے کو کھڑی ہوئی تو آپ صلی اللہ علیہ وسلم بھی مجھے پہنچا دینے کو میرے ساتھ کھڑے ہوئے اور میرا گھر اسامہ بن زید رضی اللہ عنہ کی مکان میں تھا ۔ راہ میں انصار کے دو آدمی ملے جب انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا تو وہ جلدی جلدی چلنے لگے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ٹھہرو ، یہ صفیہ بنت حیی ہے ۔ وہ دونوں بولے کہ سبحان اللہ یا رسول اللہ! ( یعنی ہم بھلا آپ پر کوئی بدگمانی کر سکتے ہیں؟ ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ شیطان انسان کے بدن میں خون کی طرح پھرتا ہے اور میں ڈرا کہ کہیں تمہارے دل میں برا خیال نہ ڈالے ( اور اس کی وجہ سے تم تباہ ہو ) ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 5680,
			"arabicnumber": "2175.02",
			"text": "شعیب نے زہری سے روایت کی ، کہا : مجھے علی بن حسین نے بتایا کہ انھیں نبی کریم صلی اللہ علیہ وسلم کی اہلیہ محترمہ حضرت صفیہ رضی اللہ تعالیٰ عنہا نے خبر دی کہ وہ رمضان کے آخری عشرے میں نبی کریم صلی اللہ علیہ وسلم کے اعتکاف کے دوران مسجد میں آپ سے ملنے آئیں ، انھوں نے گھڑی بھر آپ سے بات کی ، پھر واپسی کے لئے کھڑی ہوگئیں ۔ رسول اللہ صلی اللہ علیہ وسلم بھی ان کو واپس چھوڑنے کےلیے کھڑی ہوگئیں ۔ رسول اللہ صلی اللہ علیہ وسلم بھی ان کو واپس چھوڑنے کے لئے کھڑے ہوگئے ۔ اس کے بعد ( شعیب نے ) معمر کی حدیث کے ہم معنی حدیث بیان کی ، مگر انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" شیطان انسان کے اندر وہاں پہنچتا ہے جہاں خون پہنچتاہے ۔ انھوں نے \" دوڑتا ہوا \" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 5681,
			"arabicnumber": "2176.01",
			"text": "امام مالک بن انس نے اسحاق بن عبداللہ بن ابی طلحہ سےروایت کی کہ عقیل بن ابی طالب کے آذاد کردہ غلام ابو مرہ نے انھیں حضرت ابو واقد لیثی رضی اللہ تعالیٰ عنہ سے روایت کرتے ہوئے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم مسجد میں بیٹھے تھے اور لوگ آپ صلی اللہ علیہ وسلم کے ساتھ تھے ، اتنے میں تین آدمی آئے ، دو تو سیدھے رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور ایک چلا گیا ۔ وہ دو جو آئے ان میں سے ایک نے مجلس میں جگہ خالی پائی تو وہ وہاں بیٹھ گیا اور دوسرا لوگوں کے پیچھے بیٹھا اور تیسرا تو پیٹھ پھیر کر چل دیا ۔ جب رسول اللہ صلی اللہ علیہ وسلم فارغ ہوئے تو فرمایا کیا میں تم سے تین آدمیوں کا حال نہ کہوں؟ ایک نے تو اللہ کے پاس ٹھکانہ لیا تو اللہ نے اس کو جگہ دی اور دوسرے نے ( لوگوں میں گھسنے کی ) شرم کی تو اللہ نے بھی اس سے شرم کی اور تیسرے نے منہ پھیرا تو اللہ نے بھی اس سے منہ پھیر لیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 5682,
			"arabicnumber": "2176.02",
			"text": "یحییٰ بن ابی کثیر نے کہا کہ اسحٰق بن عبد اللہ بن ابی طلحہ نے انھیں اسی سند سے اسی کے ہم معنی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 5683,
			"arabicnumber": "2177.01",
			"text": "لیث نے نا فع سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فر ما یا : تم میں سے کو ئی شخص کسی دوسرے کو اس کی جگہ سے نہ اٹھا ئے کہ پھر وہاں ( خود ) بیٹھ جائے",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 5684,
			"arabicnumber": "2177.02",
			"text": "عبید اللہ نے نا فع سے حدیث بیان کی انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : کو ئی شخص کسی دوسرے شخص کو اس کی جگہ سے نہ اٹھا ئے کہ پھر وہاں بیٹھ جائے \" ، بلکہ کھلے ہو کر بیٹھو اور وسعت پیدا کرو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 5685,
			"arabicnumber": "2177.03",
			"text": "ابو ربیع اور الکامل نے کہا : ہمیں حماد نے حدیث بیان کی کہا : ہمیں ایوب نے حدیث سنائی ۔ یحییٰ بن حبیب نے کہا : ہمیں روح نے حدیث سنائی ، محمد را فع نے کہا : ہمیں عبد الرزاق نے حدیث بیان کی ، ان دونوں ( روح اور عبدالرزاق ) نے ابن جریج سے روایت کی ، محمد بن رافع نے کہا : ہمیں ابن ابی فدیک نے حدیث بیان کی ، کہا : ضحاک بن عثمان نے خبر دی ، ان سب ( ایوب ابن جریج اور ضحاک بن عثمان ) نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے لیث کی حدیث کے مانند روایت کی ، انھوں نے اس حدیث میں : \" بلکہ کھلے ہو کر بیٹھو اور وسعت پیدا کرو \" کے الفاظ بیان نہیں کیے اور ( ابن رافع نے ) ابن جریج کی حدیث میں یہ اضا فہ کیا : میں نے ان ( ابن بن جریج ) سے پو چھا : جمعہ کے دن ؟ \" انھوں نے کہا : جمعہ میں اس اور اس کے علاوہ بھی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 5686,
			"arabicnumber": "2177.04",
			"text": "عبد الا علیٰ نے معمر سے ، انھوں نے زہری سے ، انھوں نے سالم سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سےروایت کی کہ نبی صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے کو ئی شخص اپنے بھا ئی کو اس جگہ سے نہ اٹھا ئےکہ پھر اس کی جگہ پر بیٹھ جائے ۔ \" ( سالم نے کہا ) حضرت ابن عمر رضی اللہ تعالیٰ عنہ کا یہ طریق تھا کہ کو ئی شخص ان کے لیے ( خود بھی ) اپنی جگہ سے اٹھتا تو وہ اس کی جگہ پر نہ بیٹھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 5687,
			"arabicnumber": "2177.05",
			"text": "عبد الرزاق نے کہا : معمر نے ہمیں اسی سند کے ساتھ اسی کے مانند خبر دی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 5688,
			"arabicnumber": "2178",
			"text": "ابو زبیر نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فر ما یا : \" تم میں سے کو ئی شخص جمعے کے دن اپنے بھا ئی کو کھڑا نہ کرے کہ پھر دوسری طرف سے آکر اس کی جگہ پر خود بیٹھ جائے ، بلکہ ( جوآئے وہ ) کہے \" جگہ کشادہ کردو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 5689,
			"arabicnumber": "2179",
			"text": "ابو عوانہ اور عبد العزیز بن محمد دونوں نے سہیل سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جب تم میں سے کو ئی شخص کھڑا ہو \" اور ابوعوانہ کی حدیث میں ہے \" جب تم میں سے کو ئی شخص اپنی جگہ سے کھڑا ہو ۔ پھر اس جگہ لوٹ آئے تو وہی اس ( جگہ ) کا زیادہ حقدارہے ۔ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 5690,
			"arabicnumber": "2180",
			"text": "زینب بنت ام سلمہ رضی اللہ تعالیٰ عنہا نے ام المومنین ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ ایک مخنث ان کے ہاں مو جو دتھا رسول اللہ صلی اللہ علیہ وسلم بھی گھر پر تھے وہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کے بھا ئی سے کہنے لگا : عبد اللہ بن ابی امیہ! اگر کل ( کلاں کو ) اللہ تعا لیٰ تم لو گوں کو طا ئف پر فتح عطا فر ما ئے تو میں تمھیں غیلا ن کی بیٹی ( بادیہ بنت غیلا ن ) کا پتہ بتا ؤں گا وہ چار سلوٹوں کے ساتھ سامنے آتی ہے ( سامنے سے جسم پر چار سلوٹیں پڑتی ہیں ) اور آٹھ سلوٹوں کے ساتھ پیٹھ پھیر کر جا تی ہے ۔ ۔ ( انتہائی فربہ جسم کی ہے ) رسول اللہ صلی اللہ علیہ وسلم نے اس کی یہ بات سن لی تو آپ نے فر ما یا : \" یہ ( مخنث ) تمھا رے ہاں داخل نہ ہو ا کریں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 5691,
			"arabicnumber": "2181",
			"text": "عروہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کی ازواج کے پاس ایک مخنث آیا کرتا تھا اور ازواج مطہرات رضی اللہ تعالیٰ عنہا اسے جنسی معاملا ت سے بے بہر ہ سمجھا کرتی تھیں ۔ فرما یا : \" ایک دن رسول اللہ صلی اللہ علیہ وسلم تشریف لا اور وہ آپ کی ایک اہلیہ کے ہاں بیٹھا ہوا ایک عورت کی تعریف کررہا تھا وہ کہنے لگا : جب وہ آتی ہے تو چار سلوٹوں کے ساتھ آتی ہے اور جب پیٹھ پھیرتی ہے تو آٹھ سلوٹوں کے ساتھ پیٹھ پھیرتی ہے ۔ اس پر نبی صلی اللہ علیہ وسلم نے فر ما یا : کیا میں دیکھ نہیں رہا کہ جو کچھ یہاں ہے اسے سب پتہ ہے ، یہ لوگ تمھا رے پاس نہ آیا کریں ۔ \" \" تو انھوں ( امہات المومنین رضی اللہ تعالیٰ عنہا ) نے اس سے پردہ کر لیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 5692,
			"arabicnumber": "2182.01",
			"text": "ہشام کے والد ( عروہ ) نے حضرت اسماء بنت ابی بکر رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے ( حضرت اسماء رضی اللہ تعالیٰ عنہا ) نے کہا : حضرت زبیر رضی اللہ تعالیٰ عنہ نے مجھ سے نکا ح کیا تو ان کے پاس ایک گھوڑے کے سوانہ کچھ مال تھا ، نہ غلام تھا ، نہ کو ئی اور چیز تھی ۔ ان کے گھوڑے کو میں ہی چارا ڈالتی تھی ان کی طرف سے اس کی ساری ذمہ داری میں سنبھا لتی ۔ اس کی نگہداشت کرتی ان کے پانی لا نے والے اونٹ کے لیے کھجور کی گٹھلیاں توڑتی اور اسے کھلا تی میں ہی ( اس پر ) پانی لا تی میں ہی ان کا پانی کا ڈول سیتی آٹا گوندھتی ، میں اچھی طرح روٹی نہیں بنا سکتی تھی تو انصار کی خواتین میں سے میری ہمسائیاں میرے لیے روٹی بنا دیتیں ، وہ سچی ( دوستی والی ) عورتیں تھیں ، انھوں نے ( اسماء رضی اللہ تعالیٰ عنہا ) نے کہا رسول اللہ صلی اللہ علیہ وسلم نے زبیر رضی اللہ تعالیٰ عنہ کو زمین کا جو ٹکڑا عطا فرما یا تھا وہاں سے اپنے سر پر گٹھلیاں رکھ کر لا تی یہ ( زمین ) تقریباً دو تہائی فرسخ ( تقریباً 3.35کلو میٹر ) کی مسافت پر تھی ۔ کہا : ایک دن میں آرہی تھی گٹھلیاں میرے سر پر تھیں تو میں رسول اللہ صلی اللہ علیہ وسلم سے ملی آپ کے صحابہ کرام رضوان اللہ عنھم اجمعین میں سے کچھ لو گ آپ کے ساتھ تھے ۔ آپ صلی اللہ علیہ وسلم نے مجھے بلا یا ، پھر آواز سے اونٹ کو بٹھا نے لگے تا کہ ( گٹھلیوں کا بوجھ درمیان میں رکھتے ہو ئے ) مجھے اپنے پیچھے بٹھا لیں ۔ انھوں نے ( حضرت زبیر رضی اللہ تعالیٰ عنہ کو مخاطب کرتے ہو ئے ) کہا : مجھے شرم آئی مجھے تمھا ری غیرت بھی معلوم تھی تو انھوں ( زبیر رضی اللہ تعالیٰ عنہ ) نے کہا : اللہ جا نتا ہے کہ تمھارا اپنے سر پر گٹھلیوں کا بوجھ اٹھا نا آپ صلی اللہ علیہ وسلم کے ساتھ سوار ہونے سے زیادہ سخت ہے ۔ کہا : ( یہی کیفیت رہی ) یہاں تک کہ ابوبکر رضی اللہ تعالیٰ عنہ نے میرے پاس ( رسول اللہ صلی اللہ علیہ وسلم کی عطا کردہ حدیث : 5693 ۔ ) ایک کنیز بھجوادی اور اس نے مجھ سے گھوڑے کی ذمہ داری لے لی ۔ ( مجھے ایسے لگا ) جیسے انھوں نے مجھے ( غلا می سے ) آزاد کرا دیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 5693,
			"arabicnumber": "2182.02",
			"text": "ابن ابی ملیکہ نے کہا کہ حضرت اسماء رضی اللہ تعالیٰ عنہا نے بیان کیا کہ میں گھر کی خدمات سر انجام دےکر حضرت زبیر رضی اللہ تعالیٰ عنہ کی خدمت کرتی تھی ، ان کا ایک گھوڑاتھا ، میں اس کی دیکھ بھال کرتی تھی ، میرے لیے گھر کی خدمات میں سے گھوڑے کی نگہداشت سے بڑھ کر کوئی اورخدمت زیادہ سخت نہ تھی ۔ میں اس کے لئے چارہ لاتی ، اس کی ہرضرورت کا خیال رکھتی اور اس کی نگہداشت کرتی ، کہا : پھر انھیں ایک خادمہ مل گئی ، رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ قیدی آئے تو آپ نے ان کے لئے ایک خادمہ عطا کردی ۔ کہا : اس نے مجھ سے گھوڑے کی نگہداشت ( کی ذمہ داری ) سنبھال لی اور مجھ سے بہت بڑا بوجھ ہٹا لیا ۔ میرے پاس ایک آدمی آیا اور کہا : ام عبداللہ! میں ایک فقیر آدمی ہوں : میرا دل چاہتاہے ہے کہ میں آپ کے گھر کے سائے میں ( بیٹھ کرسودا ) بیچ لیاکروں ۔ انھوں نے کہا : اگر میں نے تمھیں اجازت دے دی تو زبیر رضی اللہ تعالیٰ عنہ انکار کردیں گے ۔ جب زبیر رضی اللہ تعالیٰ عنہ موجود ہوں تو ( اس وقت ) آکر مجھ سے اجازت مانگنا ، پھر وہ شخص ( حضرت زبیر رضی اللہ تعالیٰ عنہ کی موجودگی میں ) آیا اور کہا : ام عبداللہ! میں ایک فقیرآدمی ہوں اور چاہتاہوں کہ میں آپ کے گھر کے سائے میں ( بیٹھ کر کچھ ) بیچ لیاکروں ، انھوں ( حضرت اسماء رضی اللہ تعالیٰ عنہا ) نے جواب دیا : مدینے میں تمھارے لئے میرے گھر کے سوا اور کوئی گھر نہیں ہے ؟تو حضرت زبیر رضی اللہ تعالیٰ عنہ نے ان سے کہا : تمھیں کیا ہوا ہے ، ایک فقیر آدمی کو سودا بیچنے سے روک رہی ہو؟وہ بیچنے لگا ، یہاں تک کہ اس نے کافی کمائی کرلی ، میں نے وہ خادمہ اسے بیچ دی ۔ زبیر رضی اللہ تعالیٰ عنہ اند رآئے تو اس خادمہ کی قیمت میری گود میں پڑی تھی ، انھوں نے کہا ، یہ مجھے ہبہ کردو ۔ تو انھوں نے کہا : میں اس کو صدقہ کرچکی ہوں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 5694,
			"arabicnumber": "2183.01",
			"text": "مالک نےنافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تین شخص ( موجود ) ہوں تو ایک کو چھوڑ کر دو آدمی آ پس میں سرگوشی نہ کریں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 5695,
			"arabicnumber": "2183.02",
			"text": "عبیداللہ ، لیث بن اسعد ، ایوب ( سختیانی ) اور ایوب بن موسیٰ ان سب نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے مالک کی حدیث کے ہم معنی روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 5696,
			"arabicnumber": "2184.01",
			"text": "منصور نے ابو وائل ( شقیق ) سے ، انھوں نے عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم تین لوگ ( ایک ساتھ ) ہوتو ایک کو چھوڑ کردو آدمی باہم سرگوشی نہ کریں ، یہاں تک کہ تم بہت سے لوگوں میں مل جاؤ ، کہیں ایسا نہ ہوکہ یہ ( دوکی سرگوشی ) اسے غمزدہ کردے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 5697,
			"arabicnumber": "2184.02",
			"text": "ابو معاویہ نے اعمش سے ، انھوں نے شقیق سے ، انھوں نے حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" جب تم تین لوگ ہوتو اپنے ساتھی کو چھوڑ کر دو آپس میں سرگوشی نہ کریں کیونکہ یہ چیز اس کو غم زدہ کردے گی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 5698,
			"arabicnumber": "2184.03",
			"text": "عیسیٰ بن یونس اورسفیان دونوں نے اعمش سے اسی سند کے ساتھ ( حدیث بیان کی ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 5699,
			"arabicnumber": "2185",
			"text": "نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ صدیقہ رضی اللہ تعالیٰ عنہا سے روایت ہے ، انھوں نے کہا : جب نبی اکرم صلی اللہ علیہ وسلم بیمار ہوتے تو جبریل علیہ السلام آپ کو دم کرتے ، وہ کہتے : \" اللہ کے نام سے ، وہ آپ کو بچائے اور ہر بیماری سے شفا دے اور حسد کرنے والے کے شر سے جب وہ حسد کرے اورنظر لگانے والی ہر آنکھ کے شرسے ( آپ کومحفوظ رکھے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 5700,
			"arabicnumber": "2186",
			"text": "ابونضرہ نے حضرت ابوسعید رضی اللہ تعالیٰ عنہ سے روایت کی کہ جبرائیل علیہ السلام نبی کریم صلی اللہ علیہ وسلم کے پاس آئے اور کہا : اے محمد!کیا آپ بیمار ہوگئے ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہاں ۔ \" حضرت جبرائیل علیہ السلام نے یہ کلمات کہے : \" میں اللہ کے نام سے آپ کو دم کرتاہوں ، ہر چیز سے ( حفاظت کے لئے ) جو آپ کو تکلیف دے ، ہر نفس اور ہر حسد کرنے والی آنکھ کے شر سے ، اللہ آپ کو شفا دے ، میں اللہ کے نام سے آ پ کو دم کر تا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 5701,
			"arabicnumber": "2187",
			"text": "ہمام بن منبہ نے کہا : یہ احادیث جو ہمیں حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے ر وایت کیں ، انھوں نے متعدد احادیث بیان کیں ، ان میں سے ایک یہ ہے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" نظر حق ( ثابت شدہ بات ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 5702,
			"arabicnumber": "2188",
			"text": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آ پ نے فرمایا : \" نظر حق ( ثابت شدہ بات ) ہے ، اگر کوئی ایسی چیز ہوتی جو تقدیر پر سبقت لے جاسکتی تو نظرسبقت ہے جاتی ۔ اور جب ( نظر بد کے علاج کےلیے ) تم سے غسل کرنے کے لئے کہا جائے تو غسل کرلو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 5703,
			"arabicnumber": "2189.01",
			"text": "ابن نمیر نے ہشام سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : کہ رسول اللہ صلی اللہ علیہ وسلم پر بنی زریق کے ایک یہودی لبید بن اعصم نے جادو کیا ۔ یہاں تک کہ آپ صلی اللہ علیہ وسلم کو خیال آتا کہ میں یہ کام کر رہا ہوں حالانکہ وہ کام کرتے نہ تھے ۔ ایک دن یا ایک رات آپ صلی اللہ علیہ وسلم نے دعا کی ، پھر دعا کی ، پھر فرمایا کہ اے عائشہ! تجھے معلوم ہوا کہ اللہ جل جلالہ نے مجھے وہ بتلا دیا جو میں نے اس سے پوچھا؟ ۔ میرے پاس دو آدمی آئے ، ایک میرے سر کے پاس بیٹھا اور دوسرا پاؤں کے پاس ( وہ دونوں فرشتے تھے ) جو سر کے پاس بیٹھا تھا ، اس نے دوسرے سے کہا جو پاؤں کے پاس بیٹھا تھا اس نے سر کے پاس بیٹھے ہوئے سے کہا کہ اس شخص کو کیا بیماری ہے؟ وہ بولا کہ اس پر جادو ہوا ہے ۔ اس نے کہا کہ کس نے جادو کیا ہے؟ وہ بولا کہ لبید بن اعصم نے ۔ پھر اس نے کہا کہ کس میں جادو کیا ہے؟ وہ بولا کہ کنگھی میں اور ان بالوں میں جو کنگھی سے جھڑے اور نر کھجور کے گابھے کے ریشے میں ۔ اس نے کہا کہ یہ کہاں رکھا ہے؟ وہ بولا کہ ذی اروان کے کنوئیں میں ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ پھر رسول اللہ صلی اللہ علیہ وسلم اپنے چند اصحاب کے ساتھ اس کنوئیں پر گئے اور آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے عائشہ! اللہ کی قسم اس کنوئیں کا پانی ایسا تھا جیسے مہندی کا زلال اور وہاں کے کھجور کے درخت ایسے تھے جیسے شیطانوں کے سر ۔ میں نے عرض کیا کہ یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے اس کو جلا کیوں نہیں دیا؟ ( یعنی وہ جو بال وغیرہ نکلے ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے تو اللہ نے ٹھیک کر دیا ، اب مجھے لوگوں میں فساد بھڑکانا برا معلوم ہوا ، پس میں نے حکم دیا اور وہ دفن کر دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 5704,
			"arabicnumber": "2189.02",
			"text": "ابو کریب نے کہا : ہمیں ابو اسامہ نے حدیث بیان کی ، کہا ، ہمیں ہشام نے اپنے والد سے حدیث بیا ن کی ، انھوں نےحضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم پر جادو کیا گیا ۔ اسکے بعد ابو کریب نے واقعے کی تفصیلات سمیت ابن نمیر کی حدیث کی طرح حدیث بیان کی اور اس میں کہا : پھر رسول اللہ صلی اللہ علیہ وسلم کنویں کی طرف تشریف لئے گئے ، اسے دیکھا ، اس کنویں پر کھجور کے درخت تھے ( جنھیں کسی زمانے میں کنویں کے پانی سےسیراب کیاجاتا ہوگا ) انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے کہا : میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !اسے نکالیں ( اور جلادیں ) ابو کریب نے : \" آپ نے اسے جلا کیوں نہ دیا؟ \" کے الفاظ نہیں کہے اور یہ الفاظ ( بھی ) بیان نہیں کیے؛ \" میں نے اس کے بار ے میں حکم دیا تو اس کو پاٹ دیاگیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 5705,
			"arabicnumber": "2190.01",
			"text": "خالد بن حارث نے کہا : ہمیں شعبہ نے ہشام بن زید سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک یہودی عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک زہر آلود ( پکی ہوئی ) بکری لے کر آئی ، نبی کریم صلی اللہ علیہ وسلم نے اس میں سے کچھ ( گوشت کھایا ) ( آپ کو اس کے زہر آلود ہونے کاپتہ چل گیا ) تو اس عورت کو رسول اللہ صلی اللہ علیہ وسلم کے پاس لایاگیا ، آپ نے اس عورت سے اس ( زہر ) کے بارے میں پوچھا تو اس نے کہا : ( نعوذ باللہ! ) میں آپ کو قتل کرنا چاہتی تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ ایسا نہیں کرے گا کہ تمھیں اس بات پر تسلط ( اختیار ) دے دے ۔ \" انھوں ( انس رضی اللہ تعالیٰ عنہ ) نےکہا : یا آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( تمھیں ) مجھ پر ( تسلط دے دے ۔ ) \" انھوں ( انس رضی اللہ تعالیٰ عنہ ) نے کہا : صحابہ رضوان اللہ عنھم اجمعین نے عرض کی : کیا ہم اسے قتل نہ کردیں؟آپ صلی اللہ علیہ وسلم نےفرمایا : \" نہیں ۔ \" انھوں ( انس رضی اللہ تعالیٰ عنہ رضی اللہ تعالیٰ عنہ ) نے کہا : تو میں اب بھی رسول اللہ صلی اللہ علیہ وسلم کےدہن مبارک کے اندرونی حصے میں اسکے اثرات کو پہچانتاہوں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 5706,
			"arabicnumber": "2190.02",
			"text": "روح بن عبادہ نےکہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : میں نے ہشام بن زید سے سنا ، انھوں نےکہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا ، وہ حدیث بیان کررہے تھے کہ ایک یہودی عورت نے گوشت میں زہرملادیا اور پھر اس ( گوشت ) کو رسول اللہ صلی اللہ علیہ وسلم کے پا س لے آئی ، جس طرح خالد ( بن حارث ) کی حدیث ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 5707,
			"arabicnumber": "2191.01",
			"text": "جریر نے اعمش سے ، انھوں نے ابوضحیٰ سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : جب ہم میں سے کوئی شخص بیمار ہوتا تو رسول اللہ صلی اللہ علیہ وسلم اس ( کےمتاثرہ حصے ) پر اپنا دایاں ہاتھ پھیرتے ، پھر فرماتے : \"\" تکلیف کو دور کردے ، اے تمام انسانوں کے پالنے والے!شفا دے ، تو ہی شفا دینے والا ہے ، تیری شفا کے سوا کوئی شفا نہیں ، ایسی شفا جو بیماری کو ( ذرہ برابر باقی ) نہیں چھوڑتی ۔ \"\" پھر جب رسول اللہ صلی اللہ علیہ وسلم بیمار ہوئے اورآپ کے لیے اعضاء کو حرکت دینا مشکل ہوگیا تو میں نے آپ کا دست مبارک تھاماتاکہ جس طرح خود آپ صلی اللہ علیہ وسلم کیاکرتے تھے ، میں بھی اسی طرح کروں تو آپ صلی اللہ علیہ وسلم نے اپنا ہاتھ میرے ہاتھ سے چھڑا لیا ، پھر فرمایا : \"\" اے میرے اللہ!مجھے بخش دے اور مجھے رفیق اعلیٰ کی معیت عطا کردے ۔ \"\" انھوں نے کہا : پھر میں دیکھنے لگی تو آپ رحلت فرماچکے تھے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 5708,
			"arabicnumber": "2191.02",
			"text": "یحییٰ بن یحییٰ نے کہا : ہمیں ہشیم نے خبر دی ، ابو بکر بن خلاد اور بو کریب نے کہا : ہمیں ابو معاویہ نے حدیث بیان کی ، بشر بن خالد نےکہا : ہمیں محمد بن جعفر نے حدیث سنائی ۔ ابن بشار نے کہا؛ \"\" ہمیں ابن عدی نے حدیث بیان کی ، ان دونوں ( محمد بن جعفر اور ابن ابی عدی ) نے شعبہ سے روایت کی ۔ ( اسی طرح ) ابو بکر بن ابی شیبہ اور ابو بکر بن خلاد نے بھی ہمیں یہ حدیث بیان کی ، دونوں نے کہا : ہمیں یحییٰ قطان نے سفیان سے حدیث بیان کی ، ان سب نے جریرکی سند کےساتھ اعمش سے روایت کی ۔ ہشیم اورشعبہ کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم اپنا ہاتھ اس ( متاثرہ حصے ) پر پھیرتے اور ( سفیان ) ثوری کی حدیث میں ہے : آپ اپنا دایاں ہاتھ اس پر پھیرتے ۔ اوراعمش سےسفیان اور ان سے یحییٰ کی روایت کردہ حدیث کے آخر میں ہے ، کہا : میں نے منصور کو یہ حدیث سنائی تو انھوں نے اسی کے مطابق حضرت عائشہ رضی اللہ تعالیٰ عنہا سے مسروق اور ان سے ابراہیم کی روایت کردہ حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 5709,
			"arabicnumber": "2191.03",
			"text": "ابوعوانہ نے منصور سے ، انھوں نےابراہیم سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ بلا شبہ رسول ا للہ صلی اللہ علیہ وسلم جب کسی مریض کی عیادت کرتے تھے تو فرماتے : \" تکلیف دور کردے ، اے سب لوگوں کے پالنے والے!اس کو شفا عطا کر ، تو شفا دینے والا ہے ، تیری شفا کے سوا کوئی شفا نہیں ، ایسی شفا ( دے ) جو ( ذرہ برابر ) بیماری کو نہ چھوڑے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 5710,
			"arabicnumber": "2191.04",
			"text": "ابو بکر بن ابی شیبہ اور زہیر بن حرب نے کہا : ہمیں جریر نے منصور سے حدیث بیان کی ، انھوں نے ابو ضحیٰ سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی مریض کے پاس تشریف لاتے تواس کے لئے دعا فرماتے ہوئے کہتے : \" تکلیف دور کردے ، اے سب انسانوں کے پالنے والے! اور شفا عطا کرتو ہی شفا دینے والا ہے ، شفا عطا کر ، تیری شفا کے سوا ( کہیں ) کوئی شفا نہیں ، ایسی شفا سے جو بیماری کو ( باقی ) نہ چھوڑے ۔ \" ابوبکر ( ابن ابی شیبہ ) کی روایت میں ہے : آپ اس کے لئے دعا فرماتے اور کہتے : \" اور تو ہی شفا دینے والا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 5711,
			"arabicnumber": "2191.05",
			"text": "اسرائیل نےمنصور سے ، انھوں نے ابراہیم اور مسلم بن صبیح سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم ( جب کسی مریض کی عیادت کرتے ) تھے ( آگے ) جس طرح ابوعوانہ اور جریر کی حدیث میں ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 5712,
			"arabicnumber": "2191.06",
			"text": "ابن نمیر نے کہا : ہمیں ہشام نے اپنے والد سے حدیث بیان کی ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سےروایت کی کہ رسول اللہ صلی اللہ علیہ وسلم ان کلمات کے ساتھ دم کرتے تھے : \" تکلیف دور فرمادے ، اے سب انسانوں کے پالنے والے!شفا تیرے ہی ہاتھ میں ہے ، تیرے سوا اس تکلیف کو دور کرنے والا اور کوئی نہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 5713,
			"arabicnumber": "2191.07",
			"text": "ابواسامہ اور عیسیٰ بن یونس دونوں نے ہشام سے اسی سند کےساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 5714,
			"arabicnumber": "2192.01",
			"text": "سریج بن یونس اور یحییٰ بن ایوب نے کہا : ہمیں عباد بن عبادنے ہشام بن عروہ سے حدیث بیان کی ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : جب رسول اللہ صلی اللہ علیہ وسلم کے گھروالوں میں سے کوئی بیمار ہوتا تو آپ پناہ دلوانے والے کلمات اس پر پھونکتے ۔ پھر جب آپ اس مرض میں مبتلا ہوئے جس میں آپ کی ر حلت ہوئی تو میں نے آپ پر پھونکنا اور آپ کا اپنا ہاتھ آپ کے جسم اطہر پر پھیرنا شروع کردیا کیونکہ آ پ کا ہاتھ میرے ہاتھ سےزیادہ بابرکت تھا ۔ یحییٰ بن ایوب کی روایت میں ( بِالْمَعَوِّذَاتِ ، کے بجائے ) \" بمَعَوِّذَاتِ \" ( پناہ دلوانے والے کچھ کلمات ) ہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 5715,
			"arabicnumber": "2192.02",
			"text": "مالک نے ابن شہاب سے ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہ جب نبی صلی اللہ علیہ وسلم بیما ر ہو تے تو آپ خود پر معواذات ( معواذتین اور دیگر پناہ دلوانے والی دعائیں اور آیات ) پڑھتے اور پھونک مارتے ۔ جب آپ کی تکلیف شدید ہو گئی تو میں آپ پر پڑھتی اور آپ کی طرف سے میں آپ کا اپنا ہاتھ اس کی برکت کی امید کے ساتھ ( آپ کے جسم اطہر پر ) پھیرتی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 5716,
			"arabicnumber": "2192.03",
			"text": "یو نس معمر اور زیاد سب نے ابن شہاب سے ، امام مالک کی سند کے ساتھ ان کی حدیث کی طرح حدیث بیان کی ، مالک کے علاوہ اور کسی کی سند میں \" آپ کے ہاتھ کی برکت کی امید سے \" کے الفا ظ نہیں ۔ اور یو نس اور زیاد کی حدیث میں ہے کہ نبی صلی اللہ علیہ وسلم جب بیمار ہو تے تو آپ خود اپنے آپ پر کلمات ( پڑھ کر ) پھونکتے اور اپنے جسم پر اپنا ہاتھ پھیرتے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 5717,
			"arabicnumber": "2193.01",
			"text": "عبد الرحمٰن بن اسود نے اپنے والد سے روایت کی ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے دم کرنے کے بارے میں دریافت کیا تو انھوں نے بتا یا نبی صلی اللہ علیہ وسلم نے انصار کے ایک گھر کے لو گوں کو ہر زہریلے جا نور کے ڈنک سے ( شفا کے لیے ) دم کرنے کی اجازت عطا فر ما ئی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 5718,
			"arabicnumber": "2193.02",
			"text": "ابرا ہیم نے سود سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم نے انصار کے ایک گھر کے لو گوں کو ہر زہریلے ڈنک کے علاج کے لیے دم کرنے کی اجازت دی تھی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 5719,
			"arabicnumber": "2194",
			"text": "ابو بکر بن ابی شیبہ زہیر بن حرب اور ابن ابی عمرنے ۔ الفاظ ابن ابی عمر کے ہیں ۔ کہا : ہمیں سفیان نے عبد ربہ بن سعیدسے حدیث بیان کی ، انھوں نے عمرہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ جب کسی انسان کو اپنے جسم کے کسی حصے میں تکلیف ہو تی یا اسے کوئی پھوڑا نکلتا یا زخم لگتا تو رسول اللہ صلی اللہ علیہ وسلم اپنی انگشت مبارک سے اس طرح ( کرتے ) فر ما تے : ( یہ بیان کرتے ہو ئے ) سفیان نے اپنی شہادت کی انگلی زمین پر لگائی ، پھر اسے اٹھا یا : \" اللہ کے نام کے ساتھ ہماری زمین کی مٹی سے ہم میں سے ایک کے لعاب دہن کے ساتھ ہمارے رب کے اذن سے ہمارا بیمار شفایاب ہو ۔ \" ابن ابی شیبہ نے \" ہمارا بیمار شفایاب ہو \" کے الفا ظ اور زہیر نے \" تا کہ \" ہمارا بیمار شفایاب ہو \" کے الفاظ کہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 5720,
			"arabicnumber": "2195.01",
			"text": "محمد بن بشر نے مسعر سے روایت کی ، کہا : ہمیں معبد بن خالد نے ابن شداد سے حدیث بیان کی ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم انھیں حکم دیتے تھے کہ وہ نظر بد سے ( شفا کے لیے دم کرالیں ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 5721,
			"arabicnumber": "2195.02",
			"text": "عبید اللہ بن نمیر نے کہا : ہمیں مسعر نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 5722,
			"arabicnumber": "2195.03",
			"text": "سفیان نے معبد بن خالد سے ، انھوں نے عبد اللہ بن شداد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم مجھے حکم دیتے تھے کہ وہ نظر بد سے دم کرالوں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 5723,
			"arabicnumber": "2196.01",
			"text": "ابو خیثمہ نے عاصم احول سے ، انھوں نے یو سف بن عبد اللہ سے ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے دم جھا ڑ کے بارے میں روایت بیان کی ، کہا : زہریلے ڈنگ جلد نکلنے والے دانوں اور نظر بد ( کے عوارض ) میں دم کرانے کی اجا زت دی گئی ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 5724,
			"arabicnumber": "2196.02",
			"text": "(سفیان اور حسن بن صالح دونوں نے عاصم انھوں نے یوسف بن عبد اللہ سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے نظر بد زہریلے ڈنگ جلد نکلنے والے دانوں میں دم کرنے کی اجا زت دی ۔ اور سفیا ن کی روایت میں یو سف بن عبد اللہ کے بجائے ) یو سف بن عبد اللہ بن حارث ( سے مروی ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 5725,
			"arabicnumber": "2197",
			"text": "زینب بنت ام سلمہ رضی اللہ تعالیٰ عنہا نے ام المومنین حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی زوجہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کے گھر میں ایک لڑکی کے بارے میں جس کے چہرے ( کے ایک حصے ) کا رنگ بدلا ہوا دیکھا فرما یا : \" اس کو نظر لگ گئی ہے اس کو دم کراؤ ۔ \" آپ کی مراد اس کے چہرے کی پیلا ہٹ سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 5726,
			"arabicnumber": "2198",
			"text": "ابوعاصم نے ابن جریج سے روایت کی ، کہا : مجھے ابو زبیر نے بتا یا کہ انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہو ئے سنا ، نبی صلی اللہ علیہ وسلم نے آل ( بنو عمروبن ) حزم کو سانپ ( کے کا ٹے ) کا دم کرنے کی اجازت دی اور آپ صلی اللہ علیہ وسلم نےاسماء بنت عمیس رضی اللہ تعالیٰ عنہا سے فر ما یا : \" کیا ہوا ہے میں نے اپنے بھا ئی ( حضرت جعفر بن ابی طالب رضی اللہ تعالیٰ عنہ ) کے بچوں کے جسم لا غر دیکھ رہا ہوں ، کیا انھیں بھوکا رہنا پڑتا ہے؟ \" انھوں نے کہا : نہیں لیکن انھیں نظر بد جلدی لگ جاتی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرما یا : \" انھیں دم کرو ۔ \" انھوں ( اسماء بنت عمیس رضی اللہ تعالیٰ عنہا ) نے کہا : تومیں نے ( دم کے الفاظ کو ) آپ کے سامنے پیش کیا تو آپ صلی اللہ علیہ وسلم نے فر مایا : \" ( ان الفاظ سے ) ان کو دم کردو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 5727,
			"arabicnumber": "2199.01",
			"text": "روح بن عبادہ نے کہا : ہمیں ابن جریج نے حدیث بیان کی ، کہا : مجھے ابو زبیر نے بتا یا کہ انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہو ئے سنا ، نبی صلی اللہ علیہ وسلم نے بنو عمرو ( بن حزم ) کو سانپ کے ڈسنے کی صورت میں دم کرنے کی اجا زت دی ۔ ابو زبیر نے کہا : میں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے ( یہ بھی ) سنا ، وہ کہتے تھے : ہم میں سے ایک شخص کو بچھو نے ڈنگ مار دیا ، ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں بیٹھے ہو ئے تھے ۔ کہ ایک آدمی نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !میں دم کردوں؟آپ نے فرما یا : \" تم میں سے جو شخص اپنے بھا ئی کو فا ئدہ پہنچا سکتا ہو تو اسے ایسا کرنا چا ہیے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 5728,
			"arabicnumber": "2199.02",
			"text": "سعید بن یحییٰ اموی کے والد نے کہا : ہمیں ابن جریج نے اسی سند کے ساتھ اسی کی مثل روایت بیان کی مگر انھوں نے کہا : لو گوں میں سے ایک شخص نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کیا میں اس کو دم کردوں؟اور ( صرف ) : \" دم کردوں \" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 5729,
			"arabicnumber": "2199.03",
			"text": "وکیع نے اعمش سے ، انھوں نے ابو سفیان سے ، انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میرے ایک ماموں تھے وہ بچھوکے کا ٹے پردم کرتے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ( عمومی طور ہر طرح کے ) دم کرنے سے منع فر ما یا ۔ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہو ئے اور کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ نے دم کرنے سے منع فرما دیا ہے ۔ میں بچھو کے کاٹے سے دم کرتا ہوں تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" تم میں سے جو کو ئی اپنے بھا ئی کو فا ئدہ پہنچا سکتا ہو تو وہ ایسا کرے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 5730,
			"arabicnumber": "2199.04",
			"text": "جریر نے اعمش سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 5731,
			"arabicnumber": "2199.05",
			"text": "ابو معاویہ نے اعمش سے ، انھوں نے سفیان سے ، انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے دم کرنے سے منع فرما دیا تو عمرو بن حزم کا خاندان رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حا ضر ہوا اور عرض کی ، اللہ کے رسول صلی اللہ علیہ وسلم ! ہمارے پاس دم ( کرنے کا ایک کلمہ ) تھا ۔ ہم اس سے بچھو کے ڈسے ہو ئے کو دم کرتے تھے اور آپ نے دم کرنے سے منع فر ما دیا ۔ انھوں ( جا بر رضی اللہ تعالیٰ عنہ ) نے کہا : تو انھوں نے وہ پیش کیا تو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میں ( اس میں کو ئی ) حرج نہیں سمجھتا ۔ تم میں سے جو کوئی اپنے بھا ئی کو فائدہ پہنچاسکتا ہو تو وہ ضرور اسے فائدہ پہنچائے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 5732,
			"arabicnumber": "2200",
			"text": "حضرت عوف بن مالک اشجعی رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : ہم زمانہ جاہلیت میں دم کیا کرتے تھے ہم نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! اس کے بارے میں آپ کا کیا خیال ہے؟آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اپنے دم کے کلمات میرے سامنے پیش کرو دم میں کو ئی حرج نہیں جب تک اس میں شرک نہ ہو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 5733,
			"arabicnumber": "2201.01",
			"text": "ہشیم نے ابو بشر سے ، انھوں نے ابو متوکل سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم ! کے چند صحابہ کرام رضوان اللہ عنھم اجمعین سفر میں تھے عرب کے قبائل میں سے کسی قبیلے کے سامنے سے ان کا گزر ہوا انھوں نے ان ( قبیلے والے ) لوگوں سے چاہا کہ وہ انھیں اپنا مہمان بنائیں ۔ انھوں نے مہمان بنانے سے انکا ر کر دیا ، پھر انھوں نے کہا : کیا تم میں کو ئی دم کرنے والا ہے کیونکہ قوم کے سردار کو کسی چیز نے ڈس لیا ہے یا اسے کو ئی بیماری لا حق ہو گئی ہے ۔ ان ( صحابہ کرام رضوان اللہ عنھم اجمعین ) میں سے ایک آدمی نے کہا : ہاں پھر وہ اس کے قریب آئے اور اسے فاتحہ الکتاب سے دم کر دیا ۔ وہ آدمی ٹھیک ہو گیا تو اس ( دم کرنے والے ) کو بکریوں کاا یک ریوڑ ( تیس بکریاں ) پیش کی گئیں ۔ اس نے انھیں ( فوری طور پر ) قبول کرنے ( کا م میں لا نے ) سے انکا ر کر دیا اور کہا : یہاں تک کہ میں رسول اللہ صلی اللہ علیہ وسلم ! کو ماجرا سنادوں ۔ وہ رسول اللہ صلی اللہ علیہ وسلم ! کی خدمت میں حا ضر ہوا اور سارا ماجرا آپ کو سنایا اور کہا اللہ کے رسول اللہ صلی اللہ علیہ وسلم !!میں فاتحہ الکتاب کے علاوہ اور کو ئی دم نہیں کیا ۔ آپ صلی اللہ علیہ وسلم مسکرائے اور فرما یا : \" تمھیں کیسے پتہ چلا کہ وہ دم ( بھی ) ہے؟ \" پھر انھیں لے لو اور اپنے ساتھ میرا بھی حصہ رکھو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 5734,
			"arabicnumber": "2201.02",
			"text": "شعبہ نے ابو بشر سے اسی سند کے ساتھ روایت کی ، اور حدیث میں یہ کہا : اس نے ام القرآن ( سورۃفاتحہ ) پڑھنی شروع کی اور اپنا تھوک جمع کرتا اور اس پر پھینکتا جاتا تو وہ آدمی تندرست ہوگیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 5735,
			"arabicnumber": "2201.03",
			"text": "یزید بن ہارون نے کہا : ہمیں ہشام بن حسان نے محمد بن سیرین سےخبر دی ، انھوں نے ا پنے بھائی معبد بن سیرین سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے ، روایت کی ، کہا : ہم نے ایک مقام پر پڑاؤکیا ، ایک عورت ہمارے پاس آئی اور کہا : قبیلے کےسردار کو ڈنک لگا ہے ، ( اسے بچھو نے ڈنک ماراہے ) کیا تم میں سے کوئی دم کرنے والا ہے؟ہم میں سے ایک آدمی اس کے ساتھ ( جانے کےلئے ) کھڑا ہوگیا ، اس کے بارے میں ہمارا خیال نہیں تھا کہ وہ اچھی طرح دم کرسکتا ہے ۔ اس نے اس ( ڈسے ہوئے ) کو فاتحہ سے دم کیاتو وہ ٹھیک ہوگیا ، تو انھوں نے اسے بکریوں کا ایک ریوڑ دیا اور ہم سب کو دودھ پلایا ۔ ہم نے ( اس سے ) پوچھا : کیا تم اچھی طرح دم کرنا جانتے تھے؟اس نے کہا : میں نے اسے صرف فاتحۃ الکتاب سے دم کیا ہے ۔ کہا : میں نے ( ساتھیوں سے ) کہا : ان بکریوں کو کچھ نہ کہو یہاں تک کہ ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوجائیں ۔ ہم نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، آپ کو یہ بات بتائی توآپ صلی اللہ علیہ وسلم نے فرمایا : \" اسے کس ذریعے سے پتہ چلا کہ یہ ( فاتحہ ) دم ( کا کلمہ بھی ) ہے؟ان ( بکریوں ) کو بانٹ لو اور اپنے داتھ میرا بھی حصہ رکھو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 5736,
			"arabicnumber": "2201.04",
			"text": "ہمیں ہشام نے اسی سند کے ساتھ ، اسی طرح حدیث بیان کی ، مگر اس نے کہا : ہم میں سے ایک آدمی اس کے ساتھ ( جانے کے لئے کھڑا ہوگیا ) ہم نے کبھی گمان نہیں کیاتھا کہ وہ دم کرسکتاہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 5737,
			"arabicnumber": "2202",
			"text": "سیدنا عثمان بن ابی العاص ثقفی رضی اللہ عنہ سے روایت ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اپنے ایک درد کی شکایت کی ، جو ان کے بدن میں پیدا ہو گیا تھا جب سے وہ مسلمان ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم اپنا ہاتھ درد کی جگہ پر رکھو اور تین بار ( ( بسم اللہ ) ) کہو ، اس کے بعد سات بار یہ کہو کہأَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ ”میں اللہ تعالیٰ کی پناہ مانگتا ہوں اس چیز کی برائی سے جس کو پاتا ہوں اور جس سے ڈرتا ہوں“ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 5738,
			"arabicnumber": "2203.01",
			"text": "عبدالاعلیٰ نے سعید جریری سے ، انھوں نے ابو علاء سے روایت کی کہ سیدنا عثمان بن ابوالعاص رضی اللہ عنہ نبی کریم صلی اللہ علیہ وسلم کے پاس آئے اور کہا کہ یا رسول اللہ! شیطان میری نماز میں حائل ہو جاتا ہے اور مجھے قرآن بھلا دیتا ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس شیطان کا نام خنزب ہے ، جب تجھے اس شیطان کا اثر معلوم ہو تو اس سے اللہ تعالیٰ کی پناہ مانگ اور ( نماز کے اندر ہی ) بائیں طرف تین بار تھوک لے ۔ سیدنا عثمان رضی اللہ عنہ نے کہا کہ میں نے ایسا ہی کیا ، پھر اللہ تعالیٰ نے اس شیطان کو مجھ سے دور کر دیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 5739,
			"arabicnumber": "2203.02",
			"text": "سالم بن نوح اور ابو اسامہ ، دونوں نےجریری سے ، انھوں نے ابو علااء سے ، انھوں نے عثمان بن ابی العاص رضی اللہ تعالیٰ عنہ سے روایت کی کہ وہ نبی کریم صلی اللہ علیہ وسلم کے پاس حاضر ہوئے ، پھر اس طرح بیا ن کیا اور سالم بن نوح کی حدیث میں \" تین بار \" کا لفظ نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 5740,
			"arabicnumber": "2203.03",
			"text": "سفیان نے سعید جریری سے روایت کی ، کہا : ہمیں یزید بن عبداللہ بن شخیر نے حدیث بیان کی ، انھوں نے حضرت عثمان بن ابی العاص ثقفی رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !پھر ان کی حدیث کی مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 5741,
			"arabicnumber": "2204",
			"text": "حضرت جابر رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ہر بیماری کی دوا ہے ، جب کوئی دوا بیماری پر ٹھیک بٹھا دی جاتی ہے تو مریض اللہ تعالیٰ کےحکم سے تندرست ہوجاتاہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 5742,
			"arabicnumber": "2205.01",
			"text": "بکیر نے کہا کہ عاصم بن عمر بن قتادہ نے انھیں حدیث سنائی کہ حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ نے مقنع ( بن سنان تابعی ) کی عیادت کی ، پھر فرمایا : میں ( اس وقت تک ) یہاں سے نہیں جاؤں گا جب تک کہ تم پچھنے نہ لگوالو ، کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے ، آپ فرماتے ہیں؛ \" یقیناً اس میں شفاہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 5743,
			"arabicnumber": "2205.02",
			"text": "عبدالرحمان بن سلیمان نے حضرت عاصم بن عمر بن قتادہ سے روایت کی ، کہا : کہ سیدنا جابر بن عبداللہ رضی اللہ عنہ ہمارے گھر میں آئے اور ایک شخص کو زخم کی تکلیف تھی ( یعنی قرحہ پڑ گیا تھا ) ۔ سیدنا جابر رضی اللہ عنہ نے کہا کہ تجھے کیا تکلیف ہے؟ وہ بولا کہ ایک قرحہ ہو گیا ہے جو کہ مجھ پر نہایت سخت ہے ۔ سیدنا جابر رضی اللہ عنہ نے کہا کہ اے غلام! ایک پچھنے لگانے والے کو لے کر آ ۔ وہ بولا کہ پچھنے لگانے والے کا کیا کام ہے؟ سیدنا جابر رضی اللہ عنہ نے کہا کہ میں اس زخم پر پچھنے لگوانا چاہتا ہوں ، وہ بولا کہ اللہ کی قسم مجھے مکھیاں ستائیں گی اور کپڑا لگے گا تو مجھے تکلیف ہو گی اور مجھ پر بہت سخت ( وقت ) گزرے گا ۔ جب سیدنا جابر رضی اللہ عنہ نے دیکھا کہ اس کو پچھنے لگانے سے رنج ہوتا ہے تو کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اگر تمہاری دواؤں میں بہتر کوئی دوا ہے تو تین ہی دوائیں ہیں ، ایک تو پچھنا ، دوسرے شہد کا ایک گھونٹ اور تیسرے انگارے سے جلانا اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں داغ لینا بہتر نہیں جانتا ۔ راوی نے کہا کہ پھر پچھنے لگانے والا آیا اور اس نے اس کو پچھنے لگائے اور اس کی بیماری جاتی رہی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 5744,
			"arabicnumber": "2206",
			"text": "حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے پچھنے لگوانے کے متعلق اجازت طلب کی تو نبی کریم صلی اللہ علیہ وسلم نے حضرت ابوطیبہ رضی اللہ تعالیٰ عنہ کو حکم دیا کہ انھیں پچھنے لگائیں ۔ انھوں نے ( جابر رضی اللہ تعالیٰ عنہ ) نے کہا : حضرت ابو طیبہ رضی اللہ تعالیٰ عنہ حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کے رضاعی بھائی تھے یا نابالغ لڑکے تھے ۔ ( اور انھوں نے ہاتھ یا پاؤں ایسی جگہ پچھنے لگائےجنھیں دیکھنا محرم یا بچے کے لئے جائز ہے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 5745,
			"arabicnumber": "2207.01",
			"text": "ابومعاویہ نے اعمش سے ، انھوں نے ابو سفیان سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ( جب ) حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ ( کو جنگ خندق کے موقع پر ہاتھ کی بڑی رگ پر زخم لگاتو ان ) کے پاس ا یک طبیب بھیجا ، اس نے ان کی ( زخمی ) رگ ( کی خراب ہوجانے والی جگہ ) کاٹی ، پھر اس پرداغ لگایا ( تاکہ خون رک جائے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 5746,
			"arabicnumber": "2207.02",
			"text": "جریر اور سفیان دونوں نے اعمش سے اسی سند کے ساتھ بیان کیا اور \" تو ان کی رگ کاٹی \" کے الفاظ بیان نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 5747,
			"arabicnumber": "2207.03",
			"text": "سلیمان نے کہا : میں نے ابو سفیان کو سنا ، انھوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا : غزوہ احزاب میں حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ کے بازو کی بڑی رگ میں تیر لگا ۔ کہا : تو نبی کریم صلی اللہ علیہ وسلم نے انھیں داغ لگوایا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 5748,
			"arabicnumber": "2208",
			"text": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : حضرت سعد بن معاذ رضی اللہ تعالیٰ عنہ کے بازو کی بڑی رگ میں تیر لگا ، کہا : تو نبی کریم صلی اللہ علیہ وسلم نے اپنے دست مبارک سےتیر کے پھل کے ساتھ اس ( جگہ ) کو داغ لگایا ، ان کا ہاتھ دوبارہ سوج گیا تو آپ نے دوبارہ اس پر داغ لگایا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 5749,
			"arabicnumber": "1202.04",
			"text": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے پچھنے لگوانے اور لگانے والے کو اس کی اجرت دی اور آپ نے ناک کے ذریعے دوائی لی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 5750,
			"arabicnumber": "1577.04",
			"text": "عمر و بن عامر انصاری نے کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، آپ کہہ رہے تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے پچھنے بھی لگوائے ، آپ کسی کی اجرت کےمعاملے میں کسی پر زرہ برابر ظلم نہیں کرتے تھے ( بلکہ زیادہ عطافرماتے تھے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 5751,
			"arabicnumber": "2209.01",
			"text": "یحییٰ بن سعید نے عبیداللہ سے روایت کی ، کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے خبر دی ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" بخار جہنم کی لپٹوں سے ہے ، اس کو پانی سے ٹھنڈا کرو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 5752,
			"arabicnumber": "2209.02",
			"text": "عبداللہ بن نمیر اور محمد بن بشر نے کہا : ہمیں عبیداللہ نے نافع سے حدیث بیان کی ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" بخار کی شدت جہنم کی لپٹوں سے ہے ، اس کو پانی سے ٹھنڈا کرو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 5753,
			"arabicnumber": "2209.03",
			"text": "امام مالک اورضحاک بن عثمان ، دونوں نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ ر سول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بخار جہنم کی لپٹوں میں سے ہے ، اس کو پانی سے بجھاؤ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 5754,
			"arabicnumber": "2209.04",
			"text": "محمد بن زید نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بخار جہنم کی لپٹوں سے ہے ، اس کو پانی سے بجھاؤ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 5755,
			"arabicnumber": "2210.01",
			"text": "ابن نمیر نے ہشام سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بخار جہنم کی لپٹوں سے ہے اس کو پانی سے ٹھنڈا کرو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 5756,
			"arabicnumber": "2210.02",
			"text": "خالد بن حارث اور عبدہ بن سلیمان نے ہشام سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 5757,
			"arabicnumber": "2211.01",
			"text": "عبدہ بن سلیمان نے ہشام سے ، انھوں نے فاطمہ سے ، انھوں نے حضرت اسماء رضی اللہ تعالیٰ عنہا سے روایت کی کہ بخار میں مبتلا عورت کو ان کے پاس لایاجاتا تو وہ پانی منگواتیں اور اسے عورت کے گریبان میں انڈیلتیں اور کہتیں : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اس ( بخار ) کو پانی سے ٹھنڈاکرو ۔ \" اور کہا ( وہ کہتیں : ) \" یہ جہنم کی لپٹوں سے ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 5758,
			"arabicnumber": "2211.02",
			"text": "ابن نمیر اور ابو اسامہ نے ہشام سے اسی سند کے ساتھ حدیث بیان کی اور ابن نمیر کی حدیث میں ہے : وہ اس کے اور اسکی قمیص کے گریبان کے درمیان پانی ڈالتیں ۔ ابواسامہ کی حدیث میں انھوں نے \"\" یہ جہنم کی لپٹوں میں سے ہے \"\" کا ذکر نہیں کیا ۔ ابوا حمد نے کہا : ابراہیم نے کہا : ہمیں حسن بن شر نے حدیث بیان کی ، کہا : ہمیں ابو اسامہ نے اسی سند کےساتھ حدیث بیا ن کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 5759,
			"arabicnumber": "2212.01",
			"text": "سعید بن مسروق نے عبایہ بن رفاعہ سے ، انھوں نے اپنے دادا سے ، انھوں نےحضرت رافع بن خدیج رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرمارہے تھے : \" بخار جہنم کے جوش سے ہے ، اس کو پانی سے ٹھنڈاکرو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 5760,
			"arabicnumber": "2212.02",
			"text": "ابو بکر بن ابی شیبہ ، محمد بن مثنیٰ ، محمد بن حاتم اور ابو بکر بن نافع نے کہا : ہمیں عبدالرحمان بن مہدی نے سفیان سے حدیث بیان کی ، انھوں نے اپنے والد سے ، انھوں نے عبایہ بن رفاعہ سے رویت کی ، کہا : مجھے رافع بن خدیج رضی اللہ تعالیٰ عنہ نے حدیث سنائی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے : \" بخار جہنم کے جوش سے ہے ، اسے خود سے پانی کے ذریعے ٹھنڈا کرو ۔ \" ( ابو بکر ) کی روایت میں \" خود سے \" کے الفاظ نہیں ہیں ۔ نیز ابو بکر نے کہا کہ عبایہ بن رفاعہ نے ( حدثنی کے بجائے ) اخبرني رافع بن خديج کہا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 5761,
			"arabicnumber": "2213",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : نبی کریم صلی اللہ علیہ وسلم کےمرض میں ہم نے آپ کی مرضی کے بغیر منہ کے کونے سے آپ کے دہن مبارک میں دوائی ڈالی ، آپ نے اشارے سے روکا بھی کہ مجھے زبردستی دوائی نہ پلاؤ ، ہم نے ( آپس میں ) کہا : یہ مریض کی طبعی طور پر دوائی کی ناپسندیدگی ( کی وجہ سے ) ہے ۔ جب آپ کو افاقہ ہوا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی نہ بچے ، سب کو زبردستی ( ہی ) دوائی پلائی جائے ، سوائے عباس رضی اللہ تعالیٰ عنہ کے کیونکہ وہ تمھارے ساتھ موجود نہیں تھے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 5763,
			"arabicnumber": "2214.01",
			"text": "انھوں نے ( ام قیس رضی اللہ تعالیٰ عنہا ) نے کہا : میں اپنے ایک بچے کو لے کر آپ صلی اللہ علیہ وسلم کی خدمت میں حا ضر ہو ئی ، میں نے اس کے گلے میں سوزش کی بنا پر اس کے حلق کو انگلی سے اوپر کی طرف دبایا تھا ( تا کہ سوزش کی وجہ سے لٹکا ہوا حصہ اوپر ہو جا ئے ) تو آپ صلی اللہ علیہ وسلم نے فرما یا : \" تم انگلیوں کے دباؤ کے ذریعے سے اپنے بچوں کا گلا کیوں دباتی ہو؟ ( آپ نے بچوں کے لیے اس تکلیف دہ طریقہ علاج کو ناپسند فرما یا ۔ ) تم عودہندی کا استعمال لا زم کر لو ۔ اس میں ساتھ اقسام کی شفا ہے ان میں سے ایک نمونیا حلق کی سوزش کے لیے اس کو ناک کے راستے استعمال کیا جا تا ہے ۔ اور نمونیے کے لیے اسے منہ میں انڈیلا جا تا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 5765,
			"arabicnumber": "287.05",
			"text": "عبید اللہ نے کہا : انھوں ( ام قیس رضی اللہ تعالیٰ عنہا ) نے مجھ سے بیان کیا کہ ان کے اسی بچے نے رسول اللہ صلی اللہ علیہ وسلم کی گو د میں پیشاب کر دیا تھا ۔ رسول اللہ صلی اللہ علیہ وسلم نے پانی منگوا کر اس پر بہا دیا تھا اور اس کو زیادہ رگڑ کر نہیں دھویا تھا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 5766,
			"arabicnumber": "2215.01",
			"text": "عقیل نے ابن شہاب سے روایت کی ، کہا : مجھے ابو سلمہ بن عبد الرحمٰن اور سعید بن مسیب نے بتا یا کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے ان دونوں کو خبرد ی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرما تے ہو ئے سنا ، \" شونیز سام ( موت ) کے علاوہ ہر بیماری سے شفا ہے ۔ \" \" سام : موت ہے اور حبہ سودا ( سے مراد ) شونیز ( زیرسیاہ ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 5767,
			"arabicnumber": "2215.02",
			"text": "یو نس نے ابن شہاب سے ، انھوں نے سعید بن مسیب سے ، انھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، سفیان بن عیینہ معمر اور شعیب سب نے زہری سے ، انھوں نے ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے عقیل کی حدیث کے مانند روایت کی ۔ سفیان اور یونس کی حدیث میں \" الحبۃ السوداء \" کے الفا ظ ہیں انھوں نے ( آگے ) شونیز نہیں کہا :",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 5768,
			"arabicnumber": "2215.03",
			"text": "اعلاء ( بن الرحمٰن ) کے والد نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" موت کے سوا کو ئی بیماری نہیں جس کی شونیز کے زریعےسے شفا نہ ہو تی ہو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 5769,
			"arabicnumber": "2216",
			"text": "عروہ رسول اللہ صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ جب ان کے خاندان میں سے کسی فرد کا انتقال ہو تا تو عورتیں ( اس کی تعزیت کے لیے ) جمع ہو جا تیں ، پھر ان کے گھر والے اور خواص رہ جاتے اور باقی لو گ چلے جاتے ، اس وقت وہ تلبینے کی ایک ہانڈی ( دیگچی ) پکا نے کو کہتیں تلبینہ پکایا جا تا ، پھر ثرید بنایا جا تا اور اس پر تلبینہ ڈالا جا تا ، پھر وہ کہتیں : یہ کھا ؤ کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ، تلبینہ بیمار کے دل کو راحت بخشتا ہےاور غم کو ہلکا کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 5770,
			"arabicnumber": "2217.01",
			"text": "شعبہ نے قتادہ سے ، انھوں نے ابو متوکل سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک شخص حاضر ہوا اور عرض کی : میرے بھا ئی کا پیٹ چل پڑا ہے ( دست لگ گئے ۔ ہیں ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اس کو شہد پلا ؤ ۔ اس نے اسے شہد پلا یا ، وہ پھر آیا اور کہا : میں نے اسے شہد پلا یاہے ، اس سے ( دستوں کی تیزی میں مزید اضافہ ہو گیا ہے آپ صلی اللہ علیہ وسلم نے تین بار اس سے وہی فرما یا ( شہد پلاؤ ) جب وہ چوتھی بار آیاتو آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے شہد پلاؤ ۔ \" اس نے کہا : میں نے اسے شہد پلا یا ہے اس سے دستوں میں اضافے کے علاوہ اور کچھ نہیں ہوا تو رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : \" اللہ نے سچ فر مایا ہے ( کہ شہد میں شفا ہے ) اور تمھا رے بھا ئی کا پیٹ جھوٹ بول رہا ہے ۔ \" اس نے اسے ( اور ) شہد پلا یا وہ تندرست ہو گیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 5771,
			"arabicnumber": "2217.02",
			"text": "سعید نے قتادہ سے انھوں نے ابو متوکل ناجی سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک شخص رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی کہ میرے بھا ئی کا پیٹ خراب ہو گیا ہے ، آپ نے فر ما یا : \" اس کو شہد پلا ؤ ۔ \" ( آگے ) شعبہ کی حدیث کے ہم معنی روایت ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 5772,
			"arabicnumber": "2218.01",
			"text": "امام مالک نے محمد بن منکدر اور عمربن عبید اللہ کے آزاد کردہ غلام ابو نضر سے ، انھوں نے عامر بن ( سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ انھوں نے سنا کہ وہ حضرت اسامہ بن زید رضی اللہ تعالیٰ عنہ سے پو چھ رہے تھے ۔ آپ نے طاعون کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے کیا سنا ، ؟اسامہ رضی اللہ تعالیٰ عنہ نے کہا رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \"\" طاعون ( اللہ کی بھیجی ہو ئی ) آفت یا عذاب ہے جو بنی اسرا ئیل پر بھیجا گیا یا ( فرما یا ) تم سے پہلے لوگوں پر بھیجا گیا جب تم سنو کہ وہ کسی سر زمین میں ہے تو اس سر زمین پر نہ جاؤ اور اگر وہ ایسی سر زمین میں واقع ہو جا ئے جس میں تم لو گ ( مو جو د ) ہو تو تم اس سے بھا گ کر وہاں سے نکلو ۔ \"\" ابو نضر نے ( یہ جملہ ) کہا : \"\" تمھیں اس ( طاعون ) سے فرار کے علاوہ کو ئی اور بات ( اس سر زمین سے ) نہ نکا ل رہی ہو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 5773,
			"arabicnumber": "2218.02",
			"text": "عبداللہ بن مسلمہ بن قعنب اورقتیبہ بن سعید نے کہا : ہمیں مغیرہ بن عبدالرحمان قرشی نے ابو نضرسے حدیث بیان کی ، انھوں نےعامر بن سعد بن ابی وقاص سے رضی اللہ تعالیٰ عنہ سے ، انھوں نے حضرت اسامہ بن زید رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" طاعون عذاب کی علامت ہے ، اللہ تعالیٰ نے اپنے بندوں میں کچھ لوگوں کو طاعون میں مبتلاکیا ، جب تم طاعون کے بارے میں سنو تو وہاں مت جاؤ اور جب اس سرزمین میں طاعون واقع ہوجائے جہاں تم ہوتو وہاں سے مت بھاگو ۔ \"\" یہ قعنبی کی حدیث ہے ، قتیبہ نے بھی اس طرح بیا ن کیاہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 5774,
			"arabicnumber": "2218.03",
			"text": "سفیان نے محمد بن منکدرسے ، انھوں نے عامر بن سعد سے ، انھوں نے اسامہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" یہ طاعون ایک عذاب ہے جوتم سے پہلے لوگوں پر مسلط کیا گیا تھا ، یا ( فرمایا : ) بنی اسرائیل پر مسلط کیاگیا تھا ، اگر یہ کسی علاقےمیں ہوتو تم اس سے بھاگ کر وہاں سے نہ نکلنا اور اگر کسی ( دوسری ) سر زمین میں ( طاعون ) موجود ہوتو تم اس میں داخل نہ ہونا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 5775,
			"arabicnumber": "2218.04",
			"text": "ابن جریج نے کہا : مجھے عمرو بن دینار نے بتایا کہ عامر بن سعد نے انھیں خبر دی کہ کسی شخص نے حضرت سعد بن ابی وقاص سے طاعون کے بارے میں سوال کیا تو ( وہاں موجود ) حضرت اسامہ بن زید رضی اللہ تعالیٰ عنہ نے کہا : میں تمھیں اس کے بارے میں بتاتا ہوں ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ ایک عذاب یاسزا ہے جسے اللہ تعالیٰ نے بنی اسرائیل کے ایک گروہ پر بھیجا تھا ، یا ( فرمایا : ) ان لوگوں پر جو تم سے پہلے تھے ، لہذا تم جب کسی سرزمین میں اس کے ( پھیلنے کے ) متعلق سنو تو اس میں اس کے ہوتے ہوئے داخل نہ ہونا اور جب یہ تم پر وار د ہوجائے تو اس سےبھاگ کروہاں سے نہ نکلنا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 5776,
			"arabicnumber": "2218.05",
			"text": "حماد بن زید اور سفیان بن عینیہ دونوں نے عمرو بن دینار سے ابن جریج کی سند کے ساتھ اسی کی حدیث کےمانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 5777,
			"arabicnumber": "2218.06",
			"text": "یونس نے ابن شہاب سے ، انھوں نے عامر بن سعد سے خبر دی ، انھوں نے حضرت اسامہ بن زید رضی اللہ تعالیٰ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی : \" کہ آپ صلی اللہ علیہ وسلم نے فرمایا : یہ بیماری ( طاعون ایک ) عذاب ہے جو تم سے پہلے ایک امت کو ہوا تھا ۔ پھر وہ زمین میں رہ گیا ۔ کبھی چلا جاتا ہے ، کبھی پھر آتا ہے ۔ لہٰذا جو کوئی کسی ملک میں سنے کہ وہاں طاعون ہے ، تو وہ وہاں نہ جائے اور جب اس کے ملک میں طاعون نمودار ہو تو وہاں سے بھاگے بھی نہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 5778,
			"arabicnumber": "2218.07",
			"text": "معمر نے زہری سے یونس کی سند کے ساتھ اسی ( یونس ) کی حدیث کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 5779,
			"arabicnumber": "2218.08",
			"text": "ابن ابی عدی نے شعبہ سے انھوں نے حبیب ( بن ابی ثابت اسدی ) سے روایت کی ، کہا : ہم مدینہ میں تھے تو مجھے خبر پہنچی کہ کو فہ میں طاعون پھیل گیا ہے تو عطاء بن یسار اور دوسرے لو گوں نے مجھ سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا تھا : جب تم کسی سر زمین میں ہوا ور وہاں طاعون پھیل جا ئے تو تم اس سر زمین سے مت نکلواور جب تم کو یہ خبر پہنچے کہ وہ کسی سر زمین میں پھیل گیا ہے تو تم اس میں مت جاؤ ۔ \"\" کہا : میں نے پو چھا : ( حدیث ) کس سے روایت کی گئی ؟ ان سب نے کہا : عامر بن سعد سے وہی یہ حدیث بیان کرتے تھے ۔ کیا : تو میں ان کے ہاں پہنچا ، ان کے ( گھر کے ) لوگوں نے کہا : وہ موجود نہیں ، تو میں ان کے بھا ئی ابرا ہیم بن سعد سے ملا اور ان سے دریافت کیا تو انھوں نے کہا : میں اسامہ رضی اللہ تعالیٰ عنہ کے پاس مو جو د تھا جب وہ ( میرے والد ) حضرت سعد رضی اللہ تعالیٰ عنہ کو حدیث بیان کررہے تھے ۔ انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے : \"\" یہ بیماری سزا اور عذاب ہے یاعذاب کا بقیہ حصہ ہے جس میں تم سے پہلے کے لو گوں کو مبتلا کیا گیا تھا ۔ تو جب یہ کسی سر زمین میں پھیل جائے اور تم وہیں ہو تو وہاں سے باہر مت نکلواور جب تمھیں خبر پہنچے کہ یہ کسی سر زمین میں ہے تو اس میں مت جاؤ ۔ \"\" حبیب نے کہا : میں نے ابرا ہیم ( بن سعد ) سے کہا : کیا آپ نے ( خود ) اسامہ رضی اللہ تعالیٰ عنہ سے سنا تھا وہ حضرت سعد رضی اللہ تعالیٰ عنہ کو یہ حدیث سنا رہے تھے اور وہ اس کا انکا ر نہیں کر رہے تھے؟انھوں نے کہا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 5780,
			"arabicnumber": "2218.09",
			"text": "عبید اللہ بن معاذ کے والد نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ یہ حدیث سنا ئی مگر انھوں نے حدیث کے آغاز میں عطاء بن یسار کا واقعہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 5781,
			"arabicnumber": "2218.10",
			"text": "سفیان نے حبیب سے ، انھوں نے ابرا ہیم بن سعد سے ، انھوں نے حضرت سعد بن مالک ، حضرت حزیمہ بن ثابت اور حضرت اسامہ بن زید رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" آگے شعبہ کی حدیث کے ہم معنی ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 5782,
			"arabicnumber": "2218.11",
			"text": "اعمش نے حبیب سے ، انھوں نے ابرا ہیم بن سعد بن ابی وقاص سے روایت کی ، کہا : حضرت اسامہ بن زید رضی اللہ تعالیٰ عنہ اور حضرت سعد رضی اللہ تعالیٰ عنہ بیٹھے ہو ئے احادیث بیان کررہے تھے ۔ تو ان دونوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا ، جس طرح ان سب کی حدیث ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 5783,
			"arabicnumber": "2218.12",
			"text": "شیبانی نے حبیب بن ابی ثابت سے ، انھوں نے ابرا ہیم بن سعد بن مالک سے ، انھوں نے اپنے والد سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ان سب کی بیان کردہ حدیث کے مطا بق روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 5784,
			"arabicnumber": "2219.01",
			"text": "امام مالک نے ابن شہاب سے ، انھوں نے عبدالحمید بن عبدالرحمان بن زید بن خطاب سے ، انھوں نے عبداللہ بن عبداللہ بن حارث بن نوفل سے ، انھوں نے حضرت عبداللہ بن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ سیدنا عمر بن خطاب رضی اللہ عنہ شام کی طرف نکلے ۔ جب ( تبوک کے مقام ) سرغ پر پہنچے تو لشکر گاہوں کے امراء میں سیدنا ابوعبیدہ بن الجراح رضی اللہ عنہ اور ان کے اصحاب نے آپ سے ملاقات کی ۔ اور یہ بتایا کہ شام میں وبا پھیل گئی ہے ۔ سیدنا ابن عباس رضی اللہ عنہما نے کہا کہ سیدنا عمر رضی اللہ عنہ نے کہا کہ میرے سامنے مہاجرین اوّلین کو بلاؤ ۔ ( مہاجرین اوّلین وہ لوگ ہیں جنہوں نے دونوں قبلہ کی طرف نماز پڑھی ہو ) میں نے ان کو بلایا ۔ سیدنا عمر رضی اللہ عنہ نے ان سے مشورہ لیا اور ان سے بیان کیا کہ شام کے ملک میں وبا پھیلی ہوئی ہے ۔ انہوں نے اختلاف کیا ۔ بعض نے کہا کہ آپ ایک اہم کام کے لئے نکلے ہوئے ہیں اس لئے ہم آپ کا لوٹنا مناسب نہیں سمجھتے ۔ بعض نے کہا کہ تمہارے ساتھ وہ لوگ ہیں جو اگلوں میں باقی رہ گئے ہیں اور رسول اللہ صلی اللہ علیہ وسلم کے اصحاب ہیں اور ہم ان کو وبائی ملک میں لے جانا مناسب نہیں سمجھتے ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ اب تم لوگ جاؤ ۔ پھر کہا کہ انصار کے لوگوں کو بلاؤ ۔ میں نے ان کو بلایا تو انہوں نے ان سے مشورہ لیا ۔ انصار بھی مہاجرین کی چال چلے اور انہی کی طرح اختلاف کیا ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ تم لوگ جاؤ ۔ پھر کہا کہ اب قریش کے بوڑھوں کو بلاؤ جو فتح مکہ سے پہلے یا ( فتح کے ساتھ ہی ) مسلمان ہوئے ہیں ۔ میں نے ان کو بلایا اور ان میں سے دو نے بھی اختلاف نہیں کیا ، سب نے یہی کہا کہ ہم مناسب سمجھتے ہیں کہ آپ لوگوں کو لے کر لوٹ جائیے اور ان کو وبا کے سامنے نہ کیجئے ۔ آخر سیدنا عمر رضی اللہ عنہ نے لوگوں میں منادی کرا دی کہ میں صبح کو اونٹ پر سوار ہوں گا ( اور مدینہ لوٹوں گا ) تم بھی سوار ہو جاؤ ۔ سیدنا ابوعبیدہ بن الجراح رضی اللہ عنہ نے کہا کہ کیا تقدیر سے بھاگتے ہو؟ سیدنا عمر رضی اللہ عنہ نے کہا کہ کاش یہ بات کوئی اور کہتا ( یا اگر اور کوئی کہتا تو میں اس کو سزا دیتا ) { اور سیدنا عمر رضی اللہ عنہ برا جانتے تھے ان کا خلاف کرنے کو } ہاں ہم اللہ کی تقدیر سے اللہ کی تقدیر کی طرف بھاگتے ہیں ۔ کیا اگر تمہارے پاس اونٹ ہوں اور تم ایک وادی میں جاؤ جس کے دو کنارے ہوں ایک کنارہ سرسبز اور شاداب ہو اور دوسرا خشک اور خراب ہو اور تم اپنے اونٹوں کو سرسبز اور شاداب کنارے میں چراؤ تو اللہ کی تقدیر سے چرایا اور جو خشک اور خراب میں چراؤ تب بھی اللہ کی تقدیر سے چرایا ( سیدنا عمر رضی اللہ عنہ کا مطلب یہ ہے کہ جیسے اس چرواہے پر کوئی الزام نہیں ہے بلکہ اس کا فعل قابل تعریف ہے کہ جانوروں کو آرام دیا ایسا ہی میں بھی اپنی رعیت کا چرانے والا ہوں تو جو ملک اچھا معلوم ہوتا ہے ادھر لے جاتا ہوں اور یہ کام تقدیر کے خلاف نہیں ہے بلکہ عین تقدیر الٰہی ہے ) ؟ اتنے میں سیدنا عبدالرحمن بن عوف رضی اللہ عنہ آئے اور وہ کسی کام کو گئے ہوئے تھے ، انہوں نے کہا کہ میرے پاس تو اس مسئلہ کی دلیل موجود ہے ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم فرماتے تھے کہ جب تم سنو کہ کسی ملک میں وبا پھیلی ہے تو وہاں مت جاؤ اور اگر تمہارے ملک میں وبا پھیلے تو بھاگو بھی نہیں ۔ کہا : اس پر سیدنا عمر رضی اللہ عنہ نے اللہ کا شکر ادا کیا ۔ پھر ( اگلےدن ) روانہ ہوگئے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 5785,
			"arabicnumber": "2219.02",
			"text": "معمر نے ہمیں اسی سند کے ساتھ مالک کی حدیث کی طرح حدیث بیان کی اور معمر کی حدیث میں یہ الفاظ زائد بیان کیے ، کہا : اور انہوں ( حضرت عمر رضی اللہ تعالیٰ عنہ ) نے ان ( ابو عبیدہ رضی اللہ تعالیٰ عنہ ) سے یہ بھی کہا : آپ کا کیا حال ہے کہ اگر وہ ( اونٹ ) بنجر کنارے پر چرے اور سرسبز کنارے کو چھوڑ دے تو کیا آپ اسے اس کے عجز اور غلطی پر محمول کریں گے؟انھوں نے کہا : ہاں ، حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : تو پھر چلیں ۔ ( ابن عباس رضی اللہ تعالیٰ عنہ نے ) کہا : وہ چل کر مدینہ آئے اور کہا : ان شاء اللہ! یہی ( کجاوے ) کھولنے کی ، یاکہا : یہی اترنے کی جگہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 5786,
			"arabicnumber": "2219.03",
			"text": "یونس نے اسی سند کے ساتھ ابن شہاب سے خبر دی ، مگر انھوں نے کہا : بلاشبہ عبداللہ بن حارث نے انھیں حدیث سنائی اور \" عبداللہ بن عبداللہ \" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 5787,
			"arabicnumber": "2219.04",
			"text": "امام مالک نے ابن شہاب سے ، انھوں نے عبد اللہ بن عامر بن ربیعہ سے ، روایت کی کہ حضرت عمر رضی اللہ تعالیٰ عنہ شام کی طرف روانہ ہو ئے ، جب سرغ پہنچے تو ان کو یہ اطلا ع ملی کہ شام میں وبا نمودار ہو گئی ہے ۔ تو حضرت عبدالرحمٰن بن عوف رضی اللہ تعالیٰ عنہ نے انھیں بتا یا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا تھا : \"\" جب تم کسی علاقے میں اس ( وبا ) کی خبر سنو تو وہاں نہ جا ؤ اور جب تم کسی علاقے میں ہواور وہاں وبا نمودار ہو جا ئے تو اس وبا سے بھا گنے کے لیے وہاں سے نہ نکلو ۔ \"\" اس پر حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ سرغ سے لوٹ آئے ۔ اور ابن شہاب سے روایت ہے ، انھوں نے سالم بن عبد اللہ سے روایت کی کہ حضرت عمر رضی اللہ تعالیٰ عنہ حضرت عبد الرحمان بن عوف رضی اللہ تعالیٰ عنہ کی حدیث کی وجہ سے لوگوں کو لے کر لوٹ آئے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 5788,
			"arabicnumber": "2220.01",
			"text": "یونس نے کہا : ابن شہاب نے کہا : مجھے ابو سلمہ بن عبد الرحمٰن نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ جب رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مرض کا کسی دوسرے کو چمٹنا ماہ صفر کی نحوست اور مقتول کی کھوپڑی سے الوکا نکلنا سب بے اصل ہیں تو ایک اعرا بی ( بدو ) نے کہا : تو پھر اونٹوں کا یہ حال کیوں ہو تا ہے کہ وہ صحرامیں ایسے پھر رہے ہوتے ہیں جیسے ہرن ( صحت مند چاق چوبند ) ، پھر ایک خارش زدہ اونٹ آتا ہے ، ان میں شامل ہو تا ہے ، اور ان سب کو خارش لگا دیتا ہے؟آپ صلی اللہ علیہ وسلم نے ارشاد فر ما یا : \" پہلے اونٹ کو کس نے بیماری لگا ئی تھی ۔ ؟",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 5789,
			"arabicnumber": "2220.02",
			"text": "صالح نے ابن شہاب سے روایت کی ، کہا : مجھے ابو سلمہ بن عبدالرحمٰن وغیرہ نے بتا یا کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : کسی سے کو ئی مرض خود بخود نہیں چمٹتا ، نہ بد فالی کی کو ئی حقیقت ہے نہ صفر کی نحوست کی اور نہ کھوپڑی سے الونکلنے کی ۔ \" تو ایک اعرابی کہنے لگا : یا رسول اللہ صلی اللہ علیہ وسلم ! ( آگے ) یو نس کی حدیث کی مانند ( ہے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 5790,
			"arabicnumber": "2220.03",
			"text": "شعیب نے زہری سے روایت کی ، کہا : مجھے سنان بن ابی سنان دؤلی نے بتایا کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : نبی صلی اللہ علیہ وسلم نے فرما یا : کو ئی مرض کسی دوسرے کو خود بخود نہیں چمٹتا ۔ \" تو ایک اعرابی کھڑا ہو گیا ، پھر یونس اور صالح کی حدیث کی مانند بیان کیا اور شعیب سے روایت ہے ، انھوں نے زہری سے روایت کی ، کہا : مجھے سائب بن یزید بن اخت نمر نے حدیث سنا ئی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" نہ کسی سے خود بخود مرض چمٹتا ہے نہ صفر کی نحوست کو ئی چیز ہے اور نہ کھوپڑی سے الو نکلنا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 5791,
			"arabicnumber": "2221.01",
			"text": "یو نس نے ابن شہاب سے روایت کی ، کہ ابوسلمہ بن عبد الرحمٰن بن عوف رضی اللہ تعالیٰ عنہ نے انھیں حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" کسی سے کو ئی مرض خود بخود نہیں چمٹتااور وہ حدیث بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" بیمار اونٹوں والا صحت مند اونٹوں والے ( چرواہے ) کے پاس اونٹ نہ لے جا ئے ۔ \"\" ابو سلمہ نے کہا کہ حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ دونوں حدیثیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا کرتے تھے ، پھر ابوہریرہ رضی اللہ تعالیٰ عنہ \"\" لاعدوي \"\" والی حدیث بیان کرنے سے رک گئے اور \"\" بیمار اونٹوں والا صحت مند اونٹوں والے کے پاس ( اونٹ ) نہ لا ئے ۔ \"\" والی حدیث پر قائم رہے ۔ تو حارث بن ابی ذباب نے ۔ وہ ابو ہریرہ رضی اللہ تعالیٰ عنہ کے چچا کے بیٹے تھے ۔ ۔ کہا : ابوہریرہ رضی اللہ تعالیٰ عنہ !میں تم سے سنا کرتا تھا ، تم اس کے ساتھ ایک اور حدیث بیان کرتے تھے جسے بیان کرنے سے اب تم خاموش ہو گئے ۔ ہو ۔ تم کہا کرتے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" کسی سے مرض خود بخود نہیں چمٹتا \"\" تو ابو ہریرہ رضی اللہ تعالیٰ عنہ نے اس حدیث کو پہناننے سے انکا ر کر دیا اور یہ حدیث بیان کی ۔ \"\" بیمار اونٹوں والا صحت مند اونٹوں والے کے پاس ( اونٹ ) نہ لا ئے ۔ \"\" اس پر حارث نے اس معاملے میں ان کے ساتھ تکرار کی حتی کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ غصے میں آگئے اور حبشی زبان میں ان کو نہ سمجھ میں آنے والی کو ئی بات کہی ، پھر حارث سے کہا : تمھیں پتہ چلا ہے کہ میں نے تم سے کیا کہا ہے؟ انھوں نے کہا : نہیں ۔ ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا تھا : میں ( اس سے ) انکا ر کرتا ہوں ۔ ابو سلمہ نے کہا : مجھے اپنی زند گی کی قسم!ابو ہریرہ رضی اللہ تعالیٰ عنہ ہمیں یہ حدیث سنایا کرتے تھے ۔ \"\" لاعدوي ( کسی سے خود بخود کو ئی بیماری نہیں لگتی ) مجھے معلوم نہیں کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ بھول گئے ہیں یا ایک بات نے دوسری کو منسوخ کردیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 5792,
			"arabicnumber": "2221.02",
			"text": "صالح نے ابن شہاب سے روایت کی ، کہا : مجھے ابو سلمہ بن عبدالرحمٰن نے بتایا : انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو حدیث بیان کرتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کو ئی مرض خود بخود دوسرے کو نہیں لگ جا تا ۔ اور اس کے ساتھ یہ بیان کرتے \" بیمار اونٹوں والا ( اپنے اونٹ ) صحت مند اونٹوں والے کے پاس نہ لا ئے ۔ \" یو نس کی حدیث کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 5793,
			"arabicnumber": "2221.03",
			"text": "شعیب نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 5794,
			"arabicnumber": "2220.04",
			"text": "علاء کے والد ( عبد الرحمٰن ) نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : : کسی سے خود بخود مرض کا لگ جانا کھوپڑی سے الوکانکلنا ، ستارے کے غائب ہو نے اور طلوع ہو نے سے بارش برسنا اور صفر ( کی نحوست ) کی کو ئی حقیقت نہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 5795,
			"arabicnumber": "2222.01",
			"text": "ابو خیثمہ ( زہیر ) نے ابو زبیر سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" کسی سے کو ئی مرض لا زمی طور پر نہیں چمٹ جا تا ۔ نہ بد شگونی کو ئی چیز ہے ، نہ چھلا وے ( غول بیا بانی ) کی کو ئی حقیقت ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 5796,
			"arabicnumber": "2222.02",
			"text": "یزید تستری نے کہا : ہمیں ابو زبیر نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کسی سے کو ئی مرض خود بخود نہیں چمٹتا ، نہ چھلا وا کوئی چیز ہے ، نہ صفر کی ( نحوست ) کو ئی حقیقت ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 5797,
			"arabicnumber": "2222.03",
			"text": "ابن جریج نے کہا : مجھے ابو زبیر نے بتا یا کہ انھوں نے جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا ، میں نے نبی صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ہے : \" کسی سے کو ئی مرض خود بخود نہیں لگ جا تا ، نہ صفر ( کی نحوست ) اور چھلاوا کو ئی چیز ہے ۔ ( ابن جریج نے کہا : ) میں نے ابو زبیر کو یہ ذکر کرتے ہو ئے سنا کہ حضرت جابر رضی اللہ تعالیٰ عنہ نے ان کے سامنے آپ صلی اللہ علیہ وسلم کے فرمان \" ( وَلَا صَفَر ) کی وضاحت کی ، ابو زبیر نے کہا : صفر پیٹ ( کی بیماری ) ہے ۔ حضرت جا بر رضی اللہ تعالیٰ عنہ سے پوچھا گیا : کیسے ؟انھوں نے کہا : کہا جا تا تھا کہ اس سے پیٹ کے اندربننے والے جانور مراد ہیں ۔ کہا : انھوں نے غول کی تشریح نہیں کی ، البتہ ابو زبیر نے کہا : یہ غول ( وہی ہے جس کے بارے میں کہا جا تا ہے ) جو رنگ بدلتا ہے ( اور مسافروں کو راستے سے بھٹکا کر مارڈالتا ہے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 5798,
			"arabicnumber": "2223.01",
			"text": "معمر نے زہری سے ، انھوں نے عبید اللہ بن عبد اللہ بن عتبہ سے روایت کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : میں نے نبی صلی اللہ علیہ وسلم کو فرماتے ہو ئے سنا : \" بد شگونی کی کو ئی حقیقت نہیں اور شگون میں سے اچھی نیک فال ہے ۔ \" عرض کی گئی ۔ اللہ کے رسول صلی اللہ علیہ وسلم !فال کیا ہے ؟ ( وہ شگون سے کس طرح مختلف ہے؟ ) آپ صلی اللہ علیہ وسلم نے فر ما یا : \" ( فال ) نیک کلمہ ہے تو تم میں سے کوئی شخص سنتا ہےَ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 5799,
			"arabicnumber": "2223.02",
			"text": "عقیل بن خالد اور شعیب دونوں نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔ عقیل کی حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم سے روایت ہے ، انھوں نے \" میں نے سنا \" کے الفا ظ نہیں کہے اور شعیب کی حدیث میں ہے ۔ انھوں نے کہا : \" میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ۔ \" جس طرح معمر نے کہا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 5800,
			"arabicnumber": "2224.01",
			"text": "ہمام بن یحییٰ نے کہا : ہمیں قتادہ نے حضرت انس رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم نے فر ما یا : \" کسی سے کو ئی مرض خود بخود نہیں لگتا برے شگون کی کو ئی حقیقت نہیں اور ( اس کے بالمقابل ) نیک فال یعنی حوصلہ افزائی کا اچھا کلمہ پاکیزہ بات مجھے اچھی لگتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 5801,
			"arabicnumber": "2224.02",
			"text": "شعبہ نے کہا : میں قتادہ سے سنا ، وہ حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث روایت کر رہے تھے کہ نبی صلی اللہ علیہ وسلم نے فرما یا : \" کسی سے کو ئی مرض خود بخود نہیں لگتا براشگون کی کو ئی چیز نہیں اور مجھے نیک فال اچھی لگتی ہے ۔ \" کہا آپ سے عرض کی گئی : نیک فال کیا ہے ؟فر ما یا : \" پاکیزہ کلمہ ( دعایا حوصلہ افزائی یا دا نا ئی پر مبنی کو ئی جملہ ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 5802,
			"arabicnumber": "2223.03",
			"text": "یحییٰ بن عتیق نے کہا : ہمیں محمد بن سیرین نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کسی پر لازمی طور پر بیمار ی لگ جا نے کی کو ئی حقیقت نہیں بد شگونی کو ئی شے نہیں اور میں اچھی فال کو پسند کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 5803,
			"arabicnumber": "2223.04",
			"text": "ہشام بن حسان نے محمد بن سیرین سے انھوں نے ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" لا زمی طور پر خود بخود کسی سے بیمار ی لگ جا نے کی کو ئی حقیقت نہیں ، کھوپڑی سے الونکلنا کو ئی چیز نہیں ، بد شگونی کچھ نہیں اور میں نیک فا ل کو پسند کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 5804,
			"arabicnumber": "2225.01",
			"text": "امام مالک نے ابن شہاب سے ، انھوں نے عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کے دو بیٹوں حمزہ اور سالم سے ، انھوں نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : عدم موافقت ( ناسزاداری ) گھری ، عورت اور گھوڑے میں ہو سکتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 5805,
			"arabicnumber": "2225.02",
			"text": "یو نس نے ابن شہاب سے ، انھوں نے بن عمر رضی اللہ تعالیٰ عنہ کے دوبیٹوں حمزہ اور سالم سے ، انھوں نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کسی سے خود بخود مرض کا لگ جا نا اور بد شگونی کی کو ئی حقیقت نہیں ۔ ناموافقت تین چیزوں میں ہو تی ہے ۔ عورت گھوڑے اور گھر میں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 5806,
			"arabicnumber": "2225.03",
			"text": "سفیان ، صالح ، عقیل ، بن خا لد ، عبد الرحمٰن بن اسحٰق اور شعیب ، ان سب نے زہری سے ، انھوں نے سالم سے ، انھوں نے اپنے والد ( ابن معر رضی اللہ تعالیٰ عنہ ) سے انھوں نے ناموافقت کے بارے میں نبی صلی اللہ علیہ وسلم سے امام مالک کی حدیث کے مانند بیان کیا ، یو نس بن یزید کے علاوہ ان میں سے کسی نے ابن عمر رضی اللہ تعالیٰ عنہ کی حدیث میں \"\" کسی بیماری کے خو د بخود کسی دوسرے کو لگ جا نے اور بد شگونی \"\" کا ذکر نہیں کیا ۔ حدیث نمبر 5807 ۔ محمد بن جعفر نے کہا : ہمیں شعبہ نے عمر بن محمد بن یزید سے حدیث بیان کی انھوں نے اپنے والد سے سنا ، وہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کر رہے تھے کہ انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" اگر کسی چیز میں کسی ناموافقت کا ہو نا بر حق ہو سکتا ہے تو وہ گھوڑے عورت اور مکان میں ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 5807,
			"arabicnumber": "2225.04",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے عمر بن محمد بن یزید سے حدیث بیان کی انھوں نے اپنے والد سے سنا ، وہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کر رہے تھے کہ انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اگر کسی چیز میں کسی ناموافقت کا ہو نا بر حق ہو سکتا ہے تو وہ گھوڑے عورت اور مکان میں ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 5808,
			"arabicnumber": "2225.05",
			"text": "روح بن عبادہ نے کہا : شعبہ نے ہمیں اسی سند کے ساتھ اسی کے مانند حدیث سنائی لیکن انوھں نے \" برحق \" نہیں کہا : ( امکان یہی ہے کہ وہ حدیث روایت بالمعنی ہے ،)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 5809,
			"arabicnumber": "2225.06",
			"text": "حمزہ بن عبد اللہ بن عمر نے اپنے والد ( حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اگر کسی چیز میں عدم موافقت ہو تو گھوڑے ، مکان اور عورت میں ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 5810,
			"arabicnumber": "2226.01",
			"text": "امام مالک نے ابو حازم سے ، انھوں نے حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم نے فر ما یا : \" اگر یہ بات ہو تو عورت ، گھوڑے اور گھر میں ہو گی ۔ \" آپ کی مراد عدم موافقت سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 5811,
			"arabicnumber": "2226.02",
			"text": "ہشام بن سعد نے ابو حازم سے ، انھوں نے حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے اس کے مانند حدیث روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 5812,
			"arabicnumber": "2227",
			"text": "ابن جریج نے کہا : مجھے ابو زبیر نے بتا یا کہ انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے سنا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے خبردے رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : اگر کسی چیز میں یہ بات ہو گی تو گھر ، کادم اور گھوڑےمیں ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 5813,
			"arabicnumber": "537.03",
			"text": "یو نس نے ابن شہاب سے ، انھوں نے ابو سلمہ بن عبد الرحمٰن بن عوف سے ، انھوں نے حضرت معاویہ بن حکم سلمی رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کچھ کا م ایسے تھے جو ہم زمانے جاہلیت میں کیا کرتے تھے ہم کا ہنوں کے پاس جا تے تھے آپ صلی اللہ علیہ وسلم نے فر ما یا \" تم کا ہنوں کے پاس نہ جا یا کرو ۔ \" میں نے عرض کی : ہم بد شگونی لیتے تھے ، آپ نے فر ما یا : \" یہ ( بدشگونی ) محض ایک خیال ہے جو کو ئی انسان اپنے دل میں محسوس کرتا ہے ، یہ تمھیں ( کسی کام سے ) نہ روکے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 5814,
			"arabicnumber": "537.04",
			"text": "عقیل معمر ، ابن ابی ذئب اور مالک ، ان سب نے زہری سے اسی سند کے ساتھ یو نس کی حدیث کے ہم معنی روایت کی ، مگر مالک نے اپنی حدیث میں بدشگونی کا نام لیا ہے ، اس میں کا ہنوں کا ذکر نہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 5815,
			"arabicnumber": "537.05",
			"text": "حجاج صواف اور اوزاعی ، دونوں نے یحییٰ بن ابی کثیر سے ، انھوں نے ہلال بن ابی میمونہ سے ، انھوں نے عطا ء بن یسار سے ، انھوں نے معاویہ بن حکم سلمہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے زہری کی ابو سلمہ سے اور ان کی معاویہ سے روایت کردہ حدیث کے مانند روایت کی ، اور یحییٰ بن ابی کثیر کی حدیث میں یہ الفا ظ زائد بیان کیے ، کہا : میں نے عرض کی : ہم میں ایسے لو گ ہیں جو ( مستقبل کا حال بتا نے کے لیے ) لکیریں کھینچتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" انبیاء علیہ السلام میں سے ایک نبی تھے جو لکیریں کھینچتے تھے ، جو ان کی لکیروں سے موافقت کرگیا تو وہ ٹھیک ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 5816,
			"arabicnumber": "2228.01",
			"text": "معمر نے زہر ی سے ، انھوں نے یحییٰ بن عروہ بن زبیر سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : میں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کا ہن کسی چیز کے بارے میں جو ہمیں بتا یا کرتے تھے ( ان میں سےکچھ ) ہم درست پاتے تھے ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" وہ سچی بات ہو تی ہے جسے کو ئی جن اچک لیتا ہے اور وہ اس کو اپنے دوست ( کا ہن ) کے کا ن میں پھونک دیتا ہے اور اس ایک سچ میں سوجھوٹ ملا دیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 5817,
			"arabicnumber": "2228.02",
			"text": "معقل بن عبید اللہ نے زہری سے روایت کی ، کہا : مجھے یحییٰ بن عروہ نے بتا یا کہ انھوں نے عروہ سے سنا ، وہ کہہ رہے تھے کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : لو گوں نے رسول اللہ صلی اللہ علیہ وسلم سے کا ہنوں کے متعلق سوال کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : \"\" وہ کچھ نہیں ہیں ۔ \"\" صحابہ کرام رضوان اللہ عنھم اجمعین نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !وہ لو گ بعض اوقات ایسی چیز بتاتے ہیں جو سچ نکلتی ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : وہ جنوں کی بات ہو تی ہے ، ایک جن اسے ( آسمان کے نیچے سے ) اچک لیتا تھا پھر وہ اسے اپنے دوست ( کا ہن ) کے کان میں مرغی کی کٹ کٹ کی طرح کٹکٹاتا رہتا ہے ۔ اور وہ اس ( ایک ) بات میں سو زیادہ جھوٹ ملا دیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 5818,
			"arabicnumber": "2228.03",
			"text": "ابن جریج نے ابن شہاب سے اسی سند کے ساتھ معقل کی زہری سے روایت کردہ حدیث کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 5819,
			"arabicnumber": "2229.01",
			"text": "صالح نے ابن شہا ب سے ، روایت کی : کہا مجھے علی بن حسین ( زین العابدین ) نے حدیث سنا ئی کہ حضرت عبد اللہ بن عباس رضی اللہ تعالیٰ عنہ نے کہا رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں میں سے ایک انصاری نے مجھے بتا یا کہ ایک بار وہ لو گ رات کے وقت رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بیٹھے ہو ئے تھے ۔ کہ ایک ستا رے سے کسی چیز کو نشانہ بنایا گیا اور وہ روشن ہو گیا تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فر ما یا : \" جب جاہلیت میں اس طرح ستارے سے نشانہ لگا یا جا تا تھا ۔ تو تم لوگ کیا کہا کرتے تھے؟لوگوں نے کہا : اللہ اور اس کا رسول زیادہ جا ننے والے ہیں ہم یہی کہا : کرتے تھے ۔ کہ آج رات کسی عظیم انسان کی ولادت ہو ئی ہے اور کو ئی عظیم انسان فوت ہوا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اسے کسی کی زندگی یا موت کی بنا پر نشانے کی طرف نہیں چھوڑا جا تا ، بلکہ ہمارا رب ، اس کا نام برکت والا اور اونچا ہے ، جب کسی کام کا فیصلہ فر ما تا ہے تو حاملین عرش ( زورسے ) تسبیح کرتے ہیں ، پھر ان سے نیچے والے آسمان کے فرشتے تسبیح کا ورد کرتے ہیں ۔ یہاں تک کہ تسبیح کا ورد ( دنیا کے ) اس آسمان تک پہنچ جا تا ہے ، پھر حاملین عرش کے قریب کے فرشتے حاملین عرش سے پو چھتے ہیں تمھا رے پروردیگا ر نے کیا فرمایا؟وہ انھیں بتا تے ہیں کہ اس نے کیا فر ما یا پھر ( مختلف ) آسمانوں والے ایک دوسرے سے پو چھتے ہیں ، یہاں تک کہ وہ خبر دنیا کے اس آسمان تک پہنچ جا تی ہے تو جن بھی جلدی سے اس کی کچھ سماعت اچکتے ہیں اور اپنے دوستوں ( کا ہنوں ) تک دے چھینکتے ہیں ( اس خبر کو پہنچادیتے ہیں ) خبروہ صحیح طور پر لا تے ہیں وہ سچ تو ہو تی ہے لیکن وہ اس میں جھوٹ ملا تے اور اضافہ کردیتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 5820,
			"arabicnumber": "2229.02",
			"text": "اوزاعی ، یونس اور معقل بن عبید اللہ سب نے زہری سے ، اسی سند کے ساتھ حدیث بیان کی ، مگر یونس نے کہا : عبد اللہ بن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے : مجھے انصار میں سے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کرام رضوان اللہ عنھم اجمعین نے خبر دی اور اوزاعی کی حدیث میں ہے ۔ لیکن وہ اس میں جھوٹ ملا تے ہیں اور بڑھا تے ہیں ۔ \" اور یونس کی حدیث میں ہے : \" لیکن وہ اونچا لے جا تے ہیں ( مبا لغہ کرتے ہیں ) اور بڑھاتے ہیں ۔ \" یونس کی حدیث میں مزید یہ ہے : اللہ تعا لیٰ نے فر ما یا : یہاں تک کہ جب ان کے دلوں سے ہیبت اور ڈر کو ہٹا لیا جا تا ہے تو وہ کہتے ہیں ۔ تمھا رے رب نے کیا کہا ؟ وہ کہتے ہیں ۔ حق کہا ۔ اور معقل کی حدیث میں اسی کی طرح ہے جس طرح اوزاعی نے کہا : \" لیکن وہ اس میں جھوٹ ملا تے ہیں ۔ اور اضافہ کرتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 5821,
			"arabicnumber": "2230",
			"text": "۔ ( حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کی اہلیہ ) صفیہ نے نبی صلی اللہ علیہ وسلم کی ایک اہلیہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ آپ نے فرما یا : \" جو شخص کسی غیب کی خبر یں سنا نے والے کے پاس آئے اور اس سے کسی چیز کے بارے میں پوچھے تو چالیس راتوں تک اس شخص کی نماز قبول نہیں ہوتی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 5822,
			"arabicnumber": "2231",
			"text": "عمرو بن شرید نے اپنے والد سے روایت کی ، کہا : ثقیف کے وفد میں کو ڑھ کا یک مریض بھی تھا رسول اللہ صلی اللہ علیہ وسلم نے اس کو پیغام بھیجا : \" ہم نے ( بالواسطہ ) تمھا ری بیعت لے لی ہے ، اس لیے تم ( اپنے گھر ) لوٹ جاؤ ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 5823,
			"arabicnumber": "2232.01",
			"text": "عبد ہ بن سلیمان اور ابن نمیر نے ہشام سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے پیٹھ پر دوسفید لکیروں والے سانپ کو قتل کرنے کا حکم دیا ، کیونکہ وہ بصارت چھین لیتا ہے ۔ اور حمل کو نقصان پہنچاتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 5824,
			"arabicnumber": "2232.02",
			"text": "ابو معاویہ نے کہا : ہمیں ہشام نے اس سند کے ساتھ حدیث سنا ئی اور کہا : بے دم کا سانپ اور پشت پر دو سفیدلکیروں والا سانپ ( ماردیا جا ئے ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 5825,
			"arabicnumber": "2233.01",
			"text": "سفیان بن عیینہ نے زہری سے ، انھوں نے سالم سے ، انھوں نے اپنے والد ( حضرت ابن عمر رضی اللہ تعالیٰ عنہ ) سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی : \"\" سانپوں کو قتل کردو اور ( خصوصاً ) دو سفید لکیروں والے اور دم بریدہ کو ، کیونکہ یہ حمل گرا دیتے ہیں اور بصارت زائل کردیتے ہیں ۔ \"\" ( سالم نے ) کہا : حضرت ابن عمر رضی اللہ تعالیٰ عنہ کو جو بھی سانپ ملتا وہ اسے مار ڈالتے ، ایک بارابولبابہ بن عبدالمنذر یا زید بن خطاب رضی اللہ تعالیٰ عنہ نے ان کو دیکھا کہ وہ ایک سانپ کا پیچھا کر رہے تھے تو انھوں نے کہا : لمبی مدت سے گھروں میں رہنے والے سانپوں کو ( فوری طور پر ) ماردینے سے منع کیا گیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 5828,
			"arabicnumber": "2233.04",
			"text": "لیث ( بن سعد ) نے نافع سے روایت کی کہ حضرت ابو لبابہ رضی اللہ تعالیٰ عنہ نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے بات کی کہ وہ ان کے لیے اپنے گھر ( کے احاطے ) میں ایک دروازہ کھول دیں جس سے وہ مسجد کے قریب آجا ئیں تو لڑکوں کو سانپ کی ایک کینچلی ملی ، حضرت عبد اللہ رضی اللہ تعالیٰ عنہ نے کہا : اس کو قتل مت کرو ، کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ان چھپے ہو ئے سانپوں کے مارنے سے منع فرمایا : ہے جو گھر وں کے اندر ہو تے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 5829,
			"arabicnumber": "2233.05",
			"text": "جریر بن حازم نے کہا : ہمیں نافع نے حدیث سنا ئی کہا : حضرت ابن عمر رضی اللہ تعالیٰ عنہ سانپوں کو مار ڈالتے تھے ، حتی کہ حضرت ابو لبابہ بن عبد المنذربدری رضی اللہ تعالیٰ عنہ نے ہم لوگوں کو یہ حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ( مدت سے ) گھروں میں رہنے والے سانپوں کو مارنے سے منع فر ما یا ہے ۔ پھر حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ رک گئے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 5830,
			"arabicnumber": "2233.06",
			"text": "عبید اللہ نے کہا : مجھے نافع نے بتا یا کہ انھوں نے حضرت ابولبابہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ کو حدیث بیان کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( گھریلو ) سانپوں کے مارنے سے منع فر ما یا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 5831,
			"arabicnumber": "2233.07",
			"text": "نافع سے روایت ہے کہ انھوں نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے بیان کیا کہ حضرت ابو لبابہ رضی اللہ تعالیٰ عنہ نے انھیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سانپوں کو قتل کرنے سے منع فر ما یا : جو گھروں میں رہتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 5832,
			"arabicnumber": "2233.08",
			"text": "یحییٰ بن سعید کہہ رہے تھے : مجھے نافع نے خبر دی کہ حضرت ابولبابہ بن عبدا لمنذرانصاری رضی اللہ تعالیٰ عنہ ۔ اور ان کا گھر قبا ء میں تھا وہ مدینہ منورہ منتقل ہو گئے ۔ ایک دن حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ ان کے ساتھ بیٹھے ہو ئے ( ان کی خاطر ) اپنا ایک دروازہ کھول رہے تھے کہ اچانک انھوں نے ایک سانپ دیکھا جو گھر آباد کرنے والے ( مدت سے گھروں میں رہنے والے ) سانپوں میں سے تھا ۔ گھروالوں نے اس کو قتل کرنا چا ہا تو حضرت ابو لبابہ رضی اللہ تعالیٰ عنہ نے کہا : ان کو ۔ ان کی مراد گھروں میں رہنے والے سانپوں سے تھے ۔ مارنے سے منع کیا گیا تھا ۔ اور دم کٹے اور دوسفید دھاریوں والے سانپوں کو قتل کرنے کا حکم دیا گیا تھا ۔ کہا گیا : یہی دو سانپ ہیں جو نظر چھین لیتے ہیں اور عورتوں کے ( پیٹ کے ) بچوں کو گرا دیتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 5833,
			"arabicnumber": "2233.09",
			"text": "عمر بن نافع نے اپنے والد سے روایت کی ، کہا : ایک دن حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ اپنے گھر کے گرے ہو ئے حصے کے قریب مو جو د تھے کہ انھوں نے اچانک سانپ کی ایک کینچلی دیکھی ، حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے فر ما یا : اس سانپ کو تلا ش کر کے قتل کردو ۔ حضرت ابو لبابہ انصاری رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ نے ان سانپوں کو ، جو گھروں میں رہتے ہیں قتل کرنےسے منع فر ما یا ، سوا ئے دم کٹے اور دو سفید دھاریوں والے سانپوں کے کیونکہ یہی دوسانپ ہیں جو نظر کو زائل کر دیتے ہیں اور عورتوں کے حمل کو نقصان پہنچاتے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 5834,
			"arabicnumber": "2233.10",
			"text": "اسامہ کو نافع نے حدیث سنا ئی کہ حضرت ابو لبابہ رضی اللہ تعالیٰ عنہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے پاس سے گزرے ، وہ اس قلعے نما حصے کے پاس تھا جووہ حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کی رہائش گا ہ کے قریب تھا ، وہ اس میں ایک سانپ کی تاک میں تھے ، جس طرح لیث بن سعد کی ( حدیث : 5828 ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 5835,
			"arabicnumber": "2234.01",
			"text": "ابو معاویہ نے اعمش سے ، انھوں نے ابرا ہیم سے ، انھوں نے اسود سے ، انھوں نے حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم نبی صلی اللہ علیہ وسلم کے ساتھ ایک غار میں تھے ، اس وقت نبی صلی اللہ علیہ وسلم پر ( سورۃ ) ﴿وَالْمُرْسَلَاتِ عُرْفًا﴾نازل ہو ئی ، ہم اس سورت کو تازہ بہ تازہ رسول اللہ صلی اللہ علیہ وسلم کے دہن مبارک سے حاصل کر ( سیکھ رہے تھے کہ اچانک ایک سانپ نکلا ، آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اس کو مار دو ۔ \" ہم اس کو مارنے کے لیے جھپٹےتو وہ ہم سے آگے بھا گ گیا ، رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اللہ تعالیٰ نے اس کو تمھا رے ( ہاتھوں ) نقصان پہنچنےسے بچا لیا جس طرح تمھیں اس کے نقصان سے بچا لیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 5836,
			"arabicnumber": "2234.02",
			"text": "جریر اعمش سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 5837,
			"arabicnumber": "2235",
			"text": "ابو کریب نے کہا : ہمیں حفص نے حدیث بیان کی ، انھوں نے کہا : ہمیں اعمش نے ابرا ہم سے حدیث بیان کی ، انھوں نے اسود سے ، انھوں نے حضرت عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہ رسول اللہ صلی اللہ علیہ وسلم نے منیٰ میں احرام والے ایک شخص کو سانپ مارنے کا حکم دیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 5838,
			"arabicnumber": "2234.03",
			"text": "عمر بن حفص بن غیاث نے کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں اعمش نے حدیث سنائی ، کہا : مجھے ابرا ہیم نے اسود سے حدیث بیان کی ، انھوں نے حضرت عبد اللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ ایک غار میں تھےجس طرح جریر اور ابو معاویہ کی حدیث ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 5839,
			"arabicnumber": "2236.01",
			"text": "امام مالک بن انس نے ، ابن افلح کے آزاد کردہ غلام صیفی سے روایت کی ، کہا : مجھے ہشام بن زہرہ کے آزاد کردہ غلام ابو سائب نے بتایا کہ وہ سیدنا ابو سعید خدری رضی اللہ عنہ کے پاس ان کے گھر گئے ۔ ابوسائب نے کہا کہ میں نے ان کو نماز میں پایا تو بیٹھ گیا ۔ میں نماز پڑھ چکنے کا منتظر تھا کہ اتنے میں ان لکڑیوں میں کچھ حرکت کی آواز آئی جو گھر کے کونے میں رکھی تھیں ۔ میں نے ادھر دیکھا تو ایک سانپ تھا ۔ میں اس کے مارنے کو دوڑا تو سیدنا ابوسعید رضی اللہ عنہ نے اشارہ کیا کہ بیٹھ جا ۔ میں بیٹھ گیا جب نماز سے فارغ ہوئے تو مجھے ایک کوٹھری دکھاتے ہوئے پوچھا کہ یہ کوٹھڑی دیکھتے ہو؟ میں نے کہا کہ ہاں ، انہوں نے کہا کہ اس میں ہم لوگوں میں سے ایک جوان رہتا تھا ، جس کی نئی نئی شادی ہوئی تھی ۔ ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ خندق کی طرف نکلے ۔ وہ جوان دوپہر کو آپ صلی اللہ علیہ وسلم سے اجازت لے کر گھر آیا کرتا تھا ۔ ایک دن آپ صلی اللہ علیہ وسلم سے اجازت مانگی تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہتھیار لے کر جا کیونکہ مجھے بنی قریظہ کا ڈر ہے ( جنہوں نے دغابازی کی تھی اور موقع دیکھ کر مشرکوں کی طرف ہو گئے تھے ) ۔ اس شخص نے اپنے ہتھیار لے لئے ۔ جب اپنے گھر پر پہنچا تو اس نے اپنی بیوی کو دیکھا کہ دروازے کے دونوں پٹوں کے درمیان کھڑی ہے ۔ اس نے غیرت سے اپنا نیزہ اسے مارنے کو اٹھایا تو عورت نے کہا کہ اپنا نیزہ سنبھال اور اندر جا کر دیکھ تو معلوم ہو گا کہ میں کیوں نکلی ہوں ۔ وہ جوان اندر گیا تو دیکھا کہ ایک بڑا سانپ کنڈلی مارے ہوئے بچھونے پر بیٹھا ہے ۔ جوان نے اس پر نیزہ اٹھایا اور اسے نیزہ میں پرو لیا ، پھر نکلا اور نیزہ گھر میں گاڑ دیا ۔ وہ سانپ اس پر لوٹا اس کے بعد ہم نہیں جانتے کہ سانپ پہلے مرا یا جوان پہلے شہید ہوا ۔ ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آپ صلی اللہ علیہ وسلم سے سارا قصہ بیان کیا اور عرض کیا کہ یا رسول اللہ! اللہ سے دعا کیجئے کہ اللہ تعالیٰ اس جوان کو پھر جلا دے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اپنے ساتھی کے لئے بخشش کی دعا کرو ۔ پھر فرمایا کہ مدینہ میں جن رہتے ہیں جو مسلمان ہو گئے ہیں ، پھر اگر تم سانپوں کو دیکھو تو تین دن تک ان کو خبردار کرو ، اگر تین دن کے بعد بھی نہ نکلیں تو ان کو مار ڈالو کہ وہ شیطان ہیں ( یعنی کافر جن ہیں یا شریر سانپ ہیں ) ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 5840,
			"arabicnumber": "2236.02",
			"text": "جریر بن حا زم نے کہا : میں نے اسماء بن عبید کو ایک آدمی سے حدیث بیان کرتے ہو ئے سنا ، جسے سائب کہا جا تا تھا ۔ وہ ہمارے نزدیک ابو سائب ہیں ۔ انھوں نے کہا : ہم حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ کے پاس حاضر ہو ئے ، ہم بیٹھے ہو ئے تھے جب ہم نے ان کی چار پا ئی کے نیچے ( کسی چیز کی ) حرکت کی آواز سنی ۔ ہم نے دیکھا تو وہ ایک سانپ تھا ، پھر انھوں نے پو رے واقعے سمیت صیفی سے امام مالک کی روایت کردہ حدیث کی طرح حدیث بیان کی ، اور اس میں کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ان گھروں میں کچھ مخلوق آباد ہے ۔ جب تم ان میں سے کو ئی چیز دیکھو تو تین دن تک ان پر تنگی کرو ( تا کہ وہ خود وہاں سے کہیں اور چلے جا ئیں ) اگر وہ پہلے جا ئیں ( تو ٹھیک ) ورنہ ان کو مار دوکیونکہ پھر وہ ( نہ جا نے والا ) کا فر ہے ۔ \" اور آپ صلی اللہ علیہ وسلم نے ان سے فر ما یا : \" جاؤاور اپنے ساتھی کو دفن کردو ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 5841,
			"arabicnumber": "2236.03",
			"text": "ابن عجلا ن نے کہا : مجھے صیفی نے ابو سائب سے حدیث بیان کی ، انھوں نے حضرت خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا ؛ میں نے ان ( حضرت ابو خدری رضی اللہ تعالیٰ عنہ ) کو یہ کہتے ہو ئے سنا ، کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" مدینہ میں جنوں کی کچھ نفری رہتی ہے جو مسلمان ہو گئے ہیں جو شخص ان ( پرانے ) رہائشیوں میں سے کسی کو دیکھتے تو تین دن تک اسے ( جا نےکو ) کہتا رہے ۔ اس کے بعد اگر وہ اس کے سامنے نمودار ہو تو اسے قتل کر دے ، کیونکہ وہ شیطان ( ایمان نہ لا نے والا جن ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 5842,
			"arabicnumber": "2237.01",
			"text": "ابو بکر بن ابی شیبہ عمر وناقد اسحٰق بن ابرا ہیم اور ابن ابی عمر نے ہمیں حدیث بیان کی ، اسحٰق نے کہا : ہمیں خبر دی جبکہ دیگر نے کہا : ہمیں حدیث بیان کی ، سفیان بن عیینہ نے عبد الحمید بن جبیربن شیبہ سے ، انھوں نے سعید بن مسیب سے ، انھوں نے ام شریک رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے انھیں چھپکلیوں کو مارڈالنے کا حکم دیا ۔ ابن شعبہ کی روایت میں \"\" ( ان کا حکم دیا \"\" کے بجا ئے صرف ) \"\" حکم دیا \"\" ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 5843,
			"arabicnumber": "2237.02",
			"text": "ابوطاہر نے کہا : ہمیں ابن وہب نے بتا یا کہا ، مجھے ابن جریج نے خبرد ۔ اور محمد بن احمد بن ابی خلف نے کہا : ہمیں روح نے حدیث بیان کی ، کہا : ہمیں ابن جریج نے حدیث سنائی ۔ اور عبد بن حمید نے کہا : ہمیں محمد بن بکر نے بتا یا ، کہا : ہمیں ابن جریج نے خبر دی ، کہا : مجھے عبد الحمید بن ام شریک رضی اللہ تعالیٰ عنہا نے بتا یا کہ انھوں نے نبی صلی اللہ علیہ وسلم سے چھپکلی کو مارنے کے متعلق آپ کا حکم پو چھا تو آپ نے اسے ماردینے کا حکم دیا ۔ ام شریک رضی اللہ تعالیٰ عنہا بنو عامر بن لؤی کی ایک خاتون تھیں ( محمد بن احمد ) بن ابی خلف اور عبد بن حمید کی حدیث کے الفا ظ ایک ہیں اور ابن وہب کی حدیث اس سے قریب ہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 5844,
			"arabicnumber": "2238",
			"text": "عامر بن سعد نے اپنے والد ( حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے چھپکلی کو مار دینے کا حکم دیا اور اس کا نام چھوٹی فاسق رکھا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 5845,
			"arabicnumber": "2239",
			"text": "ابو طا ہر اور حرملہ نے کہا : ہمیں ابن وہب نے خبر دی ، کہا : مجھے یو نس نے زہری سے ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے چھپکلی کو فویسق ( چھوٹی فاسق ) کہا حرملہ نے ( اپنی ) روایت میں یہ اضافہ کیا : ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : میں نے آپ صلی اللہ علیہ وسلم سے اس کو قتل کرنے کا حکم نہیں سنا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 5846,
			"arabicnumber": "2240.01",
			"text": "خالد بن عبد اللہ نے سہیل سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : جس شخص نے پہلی ضرب میں چھپکلی کو قتل کر دیا اس کے لیے اتنی اتنی نیکیاں ہیں اور جس نے دوسری ضرب میں مارااس کے لیے اتنی اتنی پہلی سے کم نیکیاں ہیں اور اگر تیسری ضرب سے ماراتو اتنی اتنی نیکیاں ہیں دوسری سے کم ( بتا ئیں ۔)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 5847,
			"arabicnumber": "2240.02",
			"text": "ابو عوانہ جریر ، اسماعیل بن زکریا اور سفیان سب نے سہیل سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، جس طرح سہیل سے خالد کی روایت ہے سوائے اکیلے جریر کے انھوں نے اپنی روایت کردہ حدیث میں کہا : \" جس نے چھپکلی کو پہلی ضرب میں مار دیا اس کے لیے سو نیکیاں لکھی گئیں ۔ دوسری ضرب میں اس سے کم اور تیسری ضرب میں اس سے کم ،",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 5848,
			"arabicnumber": "2240.03",
			"text": "محمد بن صباح نے کہا : ہمیں اسماعیل بن زکریا نے سہیل سے حدیث بیان کی انھوں نے کہا : مجھے میری بہن ( سودہ بنت ابو صالح رضی اللہ تعالیٰ عنہا ) نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" پہلی ضرب میں سترنیکیاں ہیں ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 5849,
			"arabicnumber": "2241.01",
			"text": "سعید بن مسیب اور ابو سلمہ بن عبد الرحمٰن نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" ( پہلے ) انبیاء علیہ السلام میں سے ایک نبی کو کسی چیونٹی نے کا ٹ لیا ، انھوں نے چیونٹیوں کی پوری بستی کے بارے میں حکم دیا تو وہ جلا دی گئی ۔ اس پر اللہ تعا لیٰ نے ان کے طرف وحی کی کہ ایک چیونٹی کے کاٹنے کی وجہ سے آپ نے امتوں میں سے ایک ایسی امت ( بڑی آبادی ) کو ہلا ک کر دیا ۔ جو اللہ کی تسبیح کرتی تھی؟",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 5850,
			"arabicnumber": "2241.02",
			"text": "اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے فر ما یا : \" ( پہلے ) انبیاء علیہ السلام میں سے ایک نبی ایک درخت کے نیچے ( آرام ) کرنے کے لیے سواری سے ) اترے تو ایک چیونٹی نے ان کو کا ٹ لیا ۔ انھوں نے اس کے پورے بل کے بارے میں حکم دیا ، اسے نیچے سے نکل دیا گیا پھر حکم دیا ان کو جلا دیا گیا ۔ اللہ تعا لیٰ نے ان کی طرف وحی کی کہ آپ نے ایک ہی چیونٹی کو کیوں ( سزا ) نہ ( دی ؟)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 5851,
			"arabicnumber": "2241.03",
			"text": "ہمام بن منبہ نے کہا : یہ احادیث ہیں جو ہمیں حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے نبی صلی اللہ علیہ وسلم سے بیان کیں ، پھر انھوں نے کچھ احادیث ذکر کیں ، ان میں سے ایک یہ ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ( پہلے ) انبیاء علیہ السلام میں سے ایک نبی ایک درخت نیچے فروکش ہو ئے انھیں ایک چیونٹی نے کا ٹ لیا ، انھوں نے ان کی پوری آبادی کے بارے میں حکم دیا ، اسے نیچے سے ( کھودکر ) نکا ل لیا گیا ، پھر اس کے بارے میں حکم دیا تو اس ( پوریآبادی ) کو آگ سے جلا دیا گیا ۔ تو اللہ تعا لیٰ نے ان کی طرف وحی کی ، ( اس ایک ہی کو کیوں ( سزا ) نہ ( دی؟)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 5852,
			"arabicnumber": "2242.01",
			"text": "جویریہ بن اسماءنے نافع سے ، انھوں نے حضرت عبد اللہ ( بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک عورت کو بلی کے سبب سے عذاب دیا گیا ، اس نے بلی کو قید کر کے رکھا یہاں تک کہ وہ مر گئی ۔ وہ عورت اس کی وجہ سے جہنم میں چلی گئی ، اس عورت نے جب بلی کو قید کیا تو نہ اس کو کھلا یا پلا یا اور نہ اس کو چھوڑا ہی کہ وہ زمین کے اندر اور اوپر رہنے والے چھوٹے چھوٹے جانور کھا لیتی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 5853,
			"arabicnumber": "2242.02",
			"text": "عبید اللہ بن عمر نے نافع سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، اسی طرح ( عبید اللہ بن عمر رضی اللہ تعالیٰ عنہ نے ) سعید مقبری سے اور انھوں نےحضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اس حدیث کے ہم معنی حدیث روایت کی ،",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 5854,
			"arabicnumber": "2242.03",
			"text": "مالک نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے یہی روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 5855,
			"arabicnumber": "2243.01",
			"text": "عبد ہ نے ہشام ( بن عروہ ) سے ، انھوں نے اپنےوالد سے ، انھوں نےحضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے فر ما یا : \" ایک عورت کو بلی کے معاملے میں عذاب دیا گیا ۔ اس عورت نے نہ اسے کھلا یا نہ پلا یا اور نہ اس کو چھوڑا کہ وہ زمین کے چھوٹے جا نور کھا لیتی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 5856,
			"arabicnumber": "2243.02",
			"text": "ابو معاویہ اور خالد بن حارث نے ہمیں حدیث سنا ئی کہا : ہمیں ہشام نے اسی سند کے ساتھ حدیث بیان کی ، ان دونوں کی حدیث میں ہے : \" اس عورت نے اسےباندھ دیا ۔ \" اور ابومعاویہ کی حدیث میں ہے : \" حشرات الارض ( کھالیتی)",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 5857,
			"arabicnumber": "2243.03",
			"text": "حمید بن عبد الرحمٰن نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ہشام کی اس حدیث کے ہم معنی روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 5858,
			"arabicnumber": "2243.04",
			"text": "ہمام بن منبہ نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے ، ان کی حدیث کی طرح روایت کی ،",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 5859,
			"arabicnumber": "2244",
			"text": "ابو صالح سمان نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک بار ایک شخص راستے میں چلا جا رہا تھا اس کو شدید پیاس لگی ، اسے ایک کنواں ملا وہ اس کنویں میں اترااورپانی پیا ، پھر وہ کنویں سے نکلا تو اس کے سامنے ایک کتا زور زور ہانپ رہا تھا پیاس کی وجہ سے کیچڑ چاٹ رہا تھا ، اس شخص نے ( دل میں ) کہا : یہ کتابھی پیاس سے اسی حالت کو پہنچا ہے جو میری ہو ئی تھی ۔ وہ کنویں میں اترا اور اپنے موزے کو پانی سے بھرا پھر اس کو منہ سے پکڑا یہاں تک کہ اوپر چڑھ آیا ، پھر اس نے کتے کو پانی پلا یا ۔ اللہ تعا لیٰ نے اسے اس نیکی کا بدلہ دیا اس کو بخش دیا ۔ \" لوگوں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! ہمارے لیے ان جانوروں میں اجرہے؟ تو آپ صلی اللہ علیہ وسلم نےفرمایا : \" نمی رکھنے والے ہر جگرمیں ( کسی بھی جاندار کا ہو ۔ ) اجرہے ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 5860,
			"arabicnumber": "2245.01",
			"text": "ہشام نے محمد ( بن سیرین ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نےنبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک فاحشہ عورت نے ایک سخت گرم دن میں ایک کتا دیکھا جو ایک کنویں کے گردچکر لگا رہا تھا ۔ پیاس کی وجہ سے اس نے زبان باہر نکا لی ہو ئی تھی اس عورت نے اس کی خاطر اپنا موزہ اتارہ ( اور اس کے ذریعے پانی نکا ل کر اس کتے کو پلایا ) تو اس کو بخش دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 5861,
			"arabicnumber": "2245.02",
			"text": "ایوب سختیانی نے محمد بن سیرین سے ، انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک کتا ایک ( گہرے ، کچے ) کنویں کے گرد چکر لگا رہا تھا اور پیاس کی شدت سے مرنے کے قریب تھا کہ بنی اسرا ئیل کی فاحشہ عورتوں میں سے ایک فاحشہ نے اس کو دیکھا تو اس نے اپنا موٹا موزاہ اتارا اور اس کے ذریعے سے اس ( کتے ) کے لیے پانی نکا لا اور وہ پانی اسے پلا یا تو اس بنا پر اس کو بخش دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 39,
				"hadith": 212
			}
		}
	]
}