{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6169,
			"arabicnumber": "2381",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ حضرت ابو بکر صدیق رضی اللہ تعالیٰ عنہ نے انھیں بتایا ، کہا : جس وقت ہم غار میں تھے ، میں نے اپنے سرو ں کی جانب ( غار کے اوپر ) مشرکین کے قدم دیکھے ، میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! اگر ان میں سے کسی نے اپنے پیروں کی طرف نظر کی تووہ نیچے ہمیں دیکھ لے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ابو بکر!تمھارا ان دو کے بارے میں کیا گیا گمان ہے جن کے ساتھ تیسرا اللہ ہے؟ \" ( انھیں کوئی ضرر نہیں پہنچ سکتا ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6170,
			"arabicnumber": "2382.01",
			"text": "امام مالک نے ابو نضر سے ، انھوں نے عبید بن حنین سے ، انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم منبر پر رونق افروز ہوئے اور فرمایا : \" کہ اللہ تعالیٰ کا ایک بندہ ہے جس کو اللہ نے اختیار دیا ہے کہ چاہے دنیا کی دولت لے اور چاہے اللہ تعالیٰ کے پاس رہنا اختیار کرے ، پھر اس نے اللہ کے پاس رہنا اختیار کیا ۔ یہ سن کر سیدنا ابوبکر رضی اللہ عنہ روئے ( سمجھ گئے کہ آپ صلی اللہ علیہ وسلم کی وفات کا وقت قریب ہے ) اور بہت روئے ۔ پھر کہا کہ ہمارے باپ دادا ہماری مائیں آپ صلی اللہ علیہ وسلم پر قربان ہوں ( پھر معلوم ہوا ) کہ اس بندے سے مراد خود رسول اللہ صلی اللہ علیہ وسلم تھے اور سیدنا ابوبکر رضی اللہ عنہ ہم سب سے زیادہ علم رکھتے تھے ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ سب لوگوں سے زیادہ مجھ پر ابوبکر کا احسان ہے مال کا بھی اور صحبت کا بھی اور اگر میں کسی کو ( اللہ تعالیٰ کے سوا ) دوست بناتا تو ابوبکر کو دوست بناتا ۔ ( اب خلّت تو نہیں ہے ) لیکن اسلام کی اخوت ( برادری ) ہے ۔ مسجد میں کسی کی کھڑکی نہ رہے ( سب بند کر دی جائیں ) لیکن ابوبکر کے گھر کی کھڑکی قائم رکھو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6171,
			"arabicnumber": "2382.02",
			"text": "سالم نےابو نضر سے ، انھوں نے عبید بن حنین اور بسر بن سعید سے ، انھوں نے ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک دن رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کو خطبہ دیا ، ( اس کے بعد ) مالک کی حدیث کی مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6172,
			"arabicnumber": "2383.01",
			"text": "اسماعیل بن رجاء نے کہا : میں نے عبداللہ بن ابی ہذیل کو ابواحوص سے حدیث بیان کرتے ہوئے سنا ، انھوں نے کہا : میں نے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے سنا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کررہے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں کسی شخص کو خلیل بناتا تو ابو بکر کو خلیل بناتا لیکن وہ میرے ( دینی ) بھائی اور ساتھی ہیں اور تمھارے ساتھی ( رسول اللہ صلی اللہ علیہ وسلم ) کو اللہ عزوجل نےاپنا خلیل بنایا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6173,
			"arabicnumber": "2383.02",
			"text": "شعبہ نے ابو اسحاق سے ، انھوں نے ابو احوص سے ، انھوں نے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں اپنی امت میں سے کسی کو اپنا خلیل بناتا تو ابو بکر کو بناتا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6174,
			"arabicnumber": "2383.03",
			"text": "سفیان نے ابو اسحاق سے ، انھوں نے ابو احوص سے ، انھوں نے عبداللہ سے روایت کی ، ابو عمیس نے ابن ابی ملیکہ سے ، انھوں نے عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں کسی کو خلیل بناتاتو ابوقحافہ کے فرزند ( ابو بکر رضی اللہ تعالیٰ عنہ ) کو خلیل بناتا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6175,
			"arabicnumber": "2383.04",
			"text": "واصل بن حیان نے عبداللہ بن ابی ہذیل سے ، انھوں نے ابو احوص سے ، انھوں نے عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر میں زمین پر رہنے والوں میں سے کسی کو خلیل بناتا تو ابو قحافہ کے بیٹے کو خلیل بناتا ، لیکن تمہارے صاحب ( رسول اللہ صلی اللہ علیہ وسلم ) اللہ کے خلیل ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6176,
			"arabicnumber": "2383.05",
			"text": "عبداللہ بن مرہ نے ابو احوص سے ، انھوں نے عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سن رکھو!میں ہر خلیل کی رازدارانہ دوستی سے براءت کا اظہار کرتا ہوں اور اگر میں کسی کو خلیل بناتا تو ابو بکر کو خلیل بناتا ۔ تمھارا صاحب ( نبی اکرم صلی اللہ علیہ وسلم ) اللہ کا خلیل ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6177,
			"arabicnumber": "2384",
			"text": "عمرو بن عاصؓ سے روایت ہے رسول اﷲ ﷺ نے ان کو ذات السلاسل کے لشکر کے ساتھ بھیجا ( ذات السلاسل نواحی شام میں ایک پانی کا نام ہے وہاں کی لڑائی جمادی الاخری۸ھ میں ہوئی ) ۔ وہ آئے آپ کے پاس انہوں نے کہا یا رسول اﷲؐ! سب لوگوں میں آپ کو کس سے زیادہ محبت ہے؟ آپ نے فرمایا عائشہ صدیقہؓ سے ۔ انہوں نے کہا مرودں میں کس سے زیادہ محبت ہے؟ آپﷺ نے فرمایا ان کے باپ سے ۔ انہوں نے کہا پھر ان کے بعد کس سے؟ آپؐ نے فرمایا عمرؓ سے یہاں تک کہ آپ نے کئی آدمیوں کا ذکر کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6178,
			"arabicnumber": "2385",
			"text": "ابن ابی ملیکہ کہتے ہیں کہ میں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے سنا ، ان سے پوچھا گیا کہ اگر رسول اللہ صلی اللہ علیہ وسلم خلیفہ کرتے تو کس کو کرتے؟ انہوں نے کہا کہ سیدنا ابوبکر رضی اللہ عنہ کو ( خلیفہ ) بناتے ۔ پھر پوچھا گیا کہ ان کے بعد کس کو ( خلیفہ ) بناتے؟ انہوں نے کہا کہ سیدنا عمر رضی اللہ عنہ کو ( خلیفہ ) بناتے ۔ پھر پوچھا گیا کہ ان کے بعد کس کو ( خلیفہ ) بناتے؟ انہوں نے کہا کہ سیدنا ابوعبیدہ بن الجراح کو ۔ پھر خاموش ہو رہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6181,
			"arabicnumber": "2387",
			"text": "حضرت عائشہ صدیقہ رضی اللہ تعالیٰ عنہا سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ا پنے ( آخری ) مرض کے دوران میں مجھ سے فرمایا؛ \" اپنے والد ابو بکر اور اپنے بھائی کو میرے پاس بلاؤ تاکہ میں ایک تحریر لکھ دوں ، مجھے یہ خوف ہے کہ کوئی تمنا کرنے والا تمنا کرے گا اور کہنے والا کہے گا : میں زیادہ حقدار ہوں جبکہ اللہ بھی ابو بکر کے سوا ( کسی اور کی جانشینی ) سے انکار فرماتا ہے اور مومن بھی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6182,
			"arabicnumber": "1028.02",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے دریا فت کیا : \" آج تم میں سے کس نے روزہ رکھا ہے؟ \" حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے کہا : میں نے ۔ آپ صلی اللہ علیہ وسلم نے فرما یا : \" آج تم میں سے کون جنازے میں شامل ہوا ۔ ؟ \" ابوبکر رضی اللہ تعالیٰ عنہ نے کہا : میں ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" آج تم میں سے کس شخص نے کسی مسکین کو کھا نا کھلا یا ؟ \" حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے کہا : میں نے ۔ آپ نے فر ما یا : \" آج تم میں سے کس شخص نے کسی مریض کی عیادت کی ہے ۔ ؟حضرت ابوبکر رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس کسی آدمی میں یہ سب اوصاف اکٹھے ہو تے ہیں تو وہ جنت میں داخل ہو جاتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6183,
			"arabicnumber": "2388.01",
			"text": "یو نس نے ابن شہاب سے روایت کی ، کہا : مجھے سعد بن مسیب اور ابو سلمہ بن عبد الرحمان ( بن عوف ) نے حدیث سنائی کہ ان دونوں نے ابوہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ایک شخص اپنی گا ئے کو ہانک رہاتھا اس پر بو جھ لادا ہوا تھا ۔ اس گائے نے منہ پیچھے کیا اور کہا : مجھے اس کا م کے لیے پیدا نہیں کیا گیا بلکہ کھیتی باڑی کے لیے پیدا کیا گیا ہے ۔ \" لوگوں نے تعجب اور حیرت سے کہا : سبحان اللہ ! کیا گائے بولتی ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ( کسی اور کو یقین ہو نہ ہو ) میرا ابو بکر کا اور عمر کا اس پر ایمان ہے ۔ \" حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" ایک چرواہااپنی بکریوں میں ( مو جود ) تھا کہ بھیڑیے نے اس پر حملہ کیا اور ایک بکری پکڑلی ، چرواہا اس کے پیچھے لگ گیا حتی کہ اس بکری کو بھیڑیے سے بچا لیا ۔ اس ( بھیڑیے ) نے کہا : اس دن اسے کون بچا ئے گا جب درندوں ( کے حملے ) کا دن آئے گا اور میرے سوا اس کا چرواہا ( مالک ) کو ئی نہ ہو گا ؟ \" لوگوں نے کہا : سبحان اللہ !تو رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں اس بات پر یقین رکھتا ہوں اور ابو بکر اور عمر ( بھی یقین رکھتے ہیں ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6184,
			"arabicnumber": "2388.02",
			"text": "عقیل بن خالد نے ابن شہاب سے اسی سند کے ساتھ بکری اور بھیڑیے کا واقعہ بیان کیا اور گا ئے کا واقعہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6185,
			"arabicnumber": "2388.03",
			"text": "سفیان بن عیینہ اور سفیان ( ثوری ) دونوں نے ابو زناد سے ، انھوں نے اعرج سے ، انھوں نے ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سےزہری سے یونس کی روایت کے ہم معنی روایت کی ۔ ان دونوں کی حدیث میں گا ئے اور بکری دونوں کا ذکر ہے اور دونوں نے اپنی حدیث کے الفا ظ کہے ۔ \" میں اس پر یقین رکھتا ہوں اور ابو بکراور عمر ( بھی یقین رکھتے ہیں ۔ ) \" اور وہ دونوں وہاں نہیں تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6186,
			"arabicnumber": "2388.04",
			"text": "شعبہ اور مسعر دونوں نے سعد بن ابرا ہیم سے انھوں نے ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6187,
			"arabicnumber": "2389.01",
			"text": "ابن مبارک نے عمر بن سعید بن ابو حسین سے ، انھوں نے ابن ابی ملیکہ سے روایت کی ، انھوں نے کہا : میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ کو بیان کرتے ہو ئے سنا ، جب حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ ( کے جسد خاکی ) کو چار پائی پر رکھا گیا تو ( جنازہ ) اٹھا نے سے پہلے لوگوں نے چاروں طرف سے ان کو گھیر لیا ۔ وہ دعائیں کر رہے تھے تعریف کر رہے تھے دعائے رحمت کر رہے تھے ۔ میں بھی ان میں شامل تھا تو مجھے اچانک کسی ایسے شخص نے چونکا دیا جس نے پیچھے سے ( آکر ) میرا کندھا تھا ما ۔ میں نے مڑ کر دیکھا تو حضرت علی رضی اللہ تعالیٰ عنہ تھے ، انھوں نے حضرت عمر رضی اللہ تعالیٰ عنہ کے لیے رحمت کی دعا کی اور کہا : آپ نے کو ئی ایسا آدمی پیچھے نہ چھوڑا جو آپ سے بڑھ کر اس بات میں مجھے محبوب ہو کہ میں اللہ سے اس کے جیسے عملوں کے ساتھ ملوں ۔ اللہ کی قسم!مجھے ۔ ہمیشہ سے یہ یقین تھا کہ اللہ تعا لیٰ آپ کو اپنے دونوں ساتھیوں کے ساتھ رکھے گا ۔ اس کا سبب یہ ہے کہ میں اکثر رسول اللہ صلی اللہ علیہ وسلم سے سناکرتا تھا ، آپ فر ما یا کرتے تھے ، \" میں ابو بکر اور عمر آئے ۔ میں ابو بکر اور عمر اندر گئے ، میں ابو بکر اور عمر باہر نکلے ۔ \" مجھے امید تھی بلکہ مجھے ہمیشہ سے یقین رہا کہ اللہ آپ کو ان دونوں کے ساتھ رکھے گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6188,
			"arabicnumber": "2389.02",
			"text": "عیسیٰ بن یونس نے عمربن سعید سے اسی سند سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6189,
			"arabicnumber": "2390",
			"text": "ابو امامہ بن سہل نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے سنا ، کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں سویا ہوا تھا : میں نے دیکھا کہ لو گ میرے سامنے لا ئے جا رہے ہیں ۔ انھوں نے قمیص پہنی ہو ئی ہیں ، کسی کی قمیص چھا تی تک پہنچتی ہے کسی کی اس سے نیچے تک پہنچتی ہے اور عمر بن خطاب گزرے تو ان پر جو قمیص ہے وہ اسے گھسیٹ رہے ہیں ۔ \" لوگوں نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ نے اس کی کیا تعبیر فرما ئی ہے؟ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" دین ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6190,
			"arabicnumber": "2391.01",
			"text": "یو نس نے کہا : کہ ابن شہاب نے انھیں بتا یا ، انھوں نےحمزہ بن عبد اللہ بن عمربن خطاب سے روایت کی ، انھوں نے اپنے والد سے انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" میں سویا ہوا تھا کہ میں نے ایک پیا لہ دیکھا جو میرے پاس لا یا گیا ۔ اس میں دودھ تھا ۔ میں نے اس میں سے پیا یہاں تک کہ مجھے محسوس ہوا کہ سیرابی میرے ناخنوں سے نکل رہی ہے ۔ پھر اپنا بچا ہوا دودھ میں نے عمر رضی اللہ تعالیٰ عنہ کو دے دیا ۔ \" ( حاضرین نے ) کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ نے اس کی کیا تعبیر فر ما ئی ؟آپ نے فرما یا : \" علم ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6191,
			"arabicnumber": "2391.02",
			"text": "صالح نے یونس کی سند کے ساتھ اسی کی حدیث کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6192,
			"arabicnumber": "2392.01",
			"text": "یو نس نے ابن شہاب سے روایت کی کہ سعید بن مسیب نے انھیں خبر دی ، انھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، کہتے تھے میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ فر ما رہےتھے ۔ \" میں سویا ہوا تھا کہ میں نے خود ایک کنویں پر دیکھا اس پر ایک ڈول تھا میں نے اس میں جتنا اللہ نے چا ہا پانی نکالا ، پھر ابن ابی قحافہ نے اس سے ایک یا دوڈول نکالے ، اللہ ان کی مغفرت کرے!ان کے پانی نکا لنے میں کچھ کمزوری تھی ، پھر وہ ایک بڑا ڈول بن گیا تو عمر بن خطاب نے اسے پکڑ لیا ، چنانچہ میں نے لوگوں میں کو ئی ایسا عبقری ( غیر معمولی صلاحیت کا مالک ) نہیں دیکھا جو عمر بن خطاب کی طرح سے پانی نکا لے حتی کہ لو گ اونٹوں کو ( سیراب کر کے گھاٹ سے سے باہر ) آرام کرنے کی جگہ پر لے گئے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6193,
			"arabicnumber": "2392.02",
			"text": "صالح نے یو نس کی سند کے ساتھ انھی کی حدیث کے مانند حدیث بیان کی ،",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6194,
			"arabicnumber": "2392.03",
			"text": "صالح نے کہا : اعرج وغیرہ نے کہا : کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں نے ابن ابی قحافہ کو ڈول کھینچتے دیکھا ۔ \" زہری کی حدیث کی طرح ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6195,
			"arabicnumber": "2392.04",
			"text": "ابو ہریرہ رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام ابو یونس نے ابوہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" میں سویا ہوا تھا تو مجھے خواب میں دکھا یا گیا کہ میں اپنے حوض سے پانی نکال کر لوگوں کو پلا رہا ہوں ، پھر ابو بکر آئے اور انھوں نے مجھے آرام پہنچانے کے لیے میرے ہاتھ سے ڈول لے لیا ، انھوں نے دو ڈول پانی نکا لا ، ان کے پانی نکا لنے میں کچھ کمزوری تھی ، اللہ ان کی مغفرت کرے!پھر ابن خطاب رضی اللہ تعالیٰ عنہ آئے تو انھوں نے ان سے ڈول لے لیا ، میں نے کسی شخص کو ان سے زیادہ قوت کے ساتھ ڈول کھینچتےنہیں دیکھا ، یہاں تک کہ لوگ ( سیراب ہو کر ) چلے گئے ۔ اور حوض پوری طرح بھراہوا تھا ( اس میں سے ) پانی امڈ رہا تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6196,
			"arabicnumber": "2393.01",
			"text": "ابو بکر بن سالم نے سالم بن عبد اللہ سے ، انھوں نے عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" میں نے ( خواب میں دیکھا ) کہ جیسے میں ایک کنویں پر چرخی والے ڈول سے پانی نکا ل رہا ہوں ، پھر ابو بکر آگئے ، انھوں نے ایک یا دوڈول نکا لے اللہ تبارک وتعا لیٰ ان کی مغفرت فرما ئے ، انھوں نے کچھ کمزوری سے ڈول نکالے ۔ پھر عمر آئے انھوں نے پانی نکا لا تو وہ بہت بڑا ڈول بن گیا ، میں نے لوگوں میں کو ئی غیر معمولی آدمی بھی ایسا نہیں دیکھا جوان جیسی طاقت کا مظاہرہ کرسکتا ہو یہاں تک کہ لو گ سیراب ہو گئے اور انھوں نے جانوروں کو سیراب کرکے ) آرام کرنے کی جگہ پہنچادیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6197,
			"arabicnumber": "2393.02",
			"text": "موسیٰ بن عقبہ نے سالم بن عبداللہ سے ، انھوں نے اپنے والد سے حضرت ابو بکر اور عمربن خطاب رضی اللہ تعالیٰ عنہ کے بارے میں نبی صلی اللہ علیہ وسلم کا خواب ان سب کی حدیث کی طرح روایت کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6198,
			"arabicnumber": "2394.01",
			"text": "محمد بن عبد اللہ بن نمیر اور زہیر بن حرب نے کہا : ۔ الفاظ انھی ( زہیر ) کے ہیں ۔ ہمیں سفیان بن عیینہ نے حدیث بیان کی ، انھوں نے عمرواور ابن منکدر سے انھوں نے جابر رضی اللہ تعالیٰ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ کہ آپ نے فرما یا : \" میں جنت میں داخل ہوا تو میں نے وہاں ایک گھر یا محل دیکھا میں نے پو چھا : یہ کس کا ہے؟فرشتوں نے کہا : یہ عمر بن خطاب کا ( محل ) ہے ، میں نے اس میں داخل ہو نے کا ارادہ کیا ، پھر مجھے تمھا ری غیرت یاد آگئی ۔ حضرت عمر رضی اللہ تعالیٰ عنہ رونے لگے اور عرض کی : اے اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! کیا آپ سے غیرت کی جا تی ہے",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6199,
			"arabicnumber": "2394.02",
			"text": "اسحٰق بن ابرا ہیم ، ابو بکر بن ابی شیبہ اور عمرو ناقد نے سفیان بن عیینہ سے حدیث بیان کی ، انھوں نے عمرو اور ابن منکدر سے روایت کی ، انھوں نے کہا : میں نے جابر رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے نبی صلی اللہ علیہ وسلم سے ابن نمیر اور زہیر کی حدیث کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6202,
			"arabicnumber": "2396",
			"text": "ابرا ہیم بن سعد نے صالح سے ، انھوں نے ابن شہاب سے روایت کی ، کہا : مجھے عبد الحمید بن عبد الرحمٰن بن زید نے بتا یا کہ انھیں محمد بن سعد بن ابی وقاص نے خبر دی ، ان کے والد سعد رضی اللہ تعالیٰ عنہ نے بیان کیا کہ حضرت عمر رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضری کی اجازت طلب کی ، اس وقت قریش کی کچھ خواتین آپ کے پاس ( بیٹھی ) آپ سے گفتگو کر رہی تھیں ، بہت بول رہی تھیں ، ان کی آوازیں بھی اونچی تھیں ، جب حضرت عمر رضی اللہ تعالیٰ عنہ نے اجازت مانگی تو وہ کھڑی ہو کر جلدی سے پردے میں جا نے لگیں ۔ رسول اللہ صلی اللہ علیہ وسلم نےان کو اجازت دی ، آپ اس وقت ہنس رہے تھے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! اللہ تعا لیٰ آپ کے دندان مبارک کو مسکراتا رکھے!اس پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میں ان عورتوں پر حیران ہوں جو میرے پاس بیٹھی ہو ئی تھیں تمھا ری آواز سنی تو فوراً پردے میں چلی گئیں ۔ \" حضرت عمر رضی اللہ تعالیٰ عنہ نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ کا زیادہ حق ہے کہ یہ آپ سے ڈریں پھر حضرت عمر کہنے لگے ۔ اپنی جان کی دشمنو!مجھ سے ڈرتی ہو اور رسول اللہ صلی اللہ علیہ وسلم سے نہیں ڈرتی ہو؟ان عورتوں نے کہا : ہاں تم رسول اللہ صلی اللہ علیہ وسلم کی نسبت سخت اور درشت مزاج ہو ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اس ذات کی قسم جس کے ہاتھ میں میری جا ن ہے!جب کبھی شیطان تمھیں کسی راستے میں چلتے ہو ئے ملتا ہے تو تمھا را راستہ چھوڑ کر دوسرا راستہ اختیار کر لیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6203,
			"arabicnumber": "2397",
			"text": "سہیل نے اپنے والد صالح سے ، انھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ عمر بن خطاب رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہو ئے اور ( اس وقت ) رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ خواتین تھیں جو رسول اللہ صلی اللہ علیہ وسلم کے سامنے بلند آواز سے باتیں کر رہی تھیں ۔ جب حضرت عمر رضی اللہ تعالیٰ عنہ نے ( اندر آنےکی ) اجازت مانگی تو وہ جلدی سے پردے میں چلی گئیں ۔ پھر انھوں نے زہری کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6204,
			"arabicnumber": "2398.01",
			"text": "ابرا ہیم سعد نے اپنے والد سعد بن ابرا ہیم سے ، انھوں نے ابو سلمہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ، کہ آپ نے فر ما یا کرتے تھے ۔ \" تم سے پہلے کی امتوں میں ایسے لوگ تھے جن سے بات کی جا تی تھیں اگر ان میں سے کو ئی میری امت میں ہے تو عمر خطاب انھی میں سے ہے ۔ \" ابن وہب نے کہا : مُحَدَّثُونَکا مطلب ہے جن پر الہام کیا جا تا ہو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6205,
			"arabicnumber": "2398.02",
			"text": "سعید ابرا ہیم نے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6206,
			"arabicnumber": "2399",
			"text": "نافع نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : \" میں نے تین باتوں میں اپنے رب کی موافقت کی ، مقام ابرا ہیم ( کو نماز کی جگہ بنا نے ) میں حجاب میں اور بدر کے قیدیوں میں ( کہ ان کو قتل کر دیا جا ئے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6207,
			"arabicnumber": "2400.01",
			"text": "ابو اسامہ نے کہا : ہمیں عبید اللہ نے نافع سے حدیث بیان کی ، انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : جب ( رئیس المنافقین ) عبد اللہ بن ابی ابن سلول مر گیا تو اس کا بیٹا عبد اللہ بن عبد اللہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور آپ سے درخواست کی کہ آپ اپنی قمیص عنایت فر ما ئیں جس میں وہ اپنے باپ کو کفن دے ، آپ نے اسے عنایت کر دی ، پھر اس نے یہ درخواست کی کہ آپ اس کا نماز جنازہ پڑھا ئیں ۔ رسول اللہ صلی اللہ علیہ وسلم اس کا جنازہ پڑھانے کے لیے کھڑے ہو ئے تو حضرت عمر رضی اللہ تعالیٰ عنہ کھڑے ہو ئے ، رسول اللہ صلی اللہ علیہ وسلم کا کپڑا پکڑااور عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !کیا آپ اس شخص کی نماز جنازہ پڑھیں گے جبکہ اللہ تعا لیٰ نے آپ کو اس کی نماز جنازہ پڑھنے سے منع فر ما یا ہے؟ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اللہ نے مجھے اختیار دیا ہے اور فر ما یا ہے : \" آپ ان کے لیے بخشش کی دعا کریں یا نہ کریں ۔ آپ ان کے لیے ستر بار بخشش کی دعا کریں گے ( تو بھی اللہ ان کو معاف نہیں کرے گا ۔ ) تو میں ستر سے زیادہ بار بخشش مانگ لوں گا ۔ انھوں ( حضرت عمر رضی اللہ تعالیٰ عنہ ) نے کہا : وہ منا فق ہے ۔ چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے اس کی نماز جنازہ پڑھا دی ۔ اس پر اللہ تعا لیٰ نے یہ آیت نازل فر مائی : \" ان میں سے کسی کی بھی ، جب وہ مرجائے کبھی نماز جنازہ نہ پڑھیں اور نہ ان کی قبر پر کھڑےہوں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6208,
			"arabicnumber": "2400.02",
			"text": "یحییٰ قطان نے عبید اللہ سے اسی سند کے ساتھ ابو اسامہ کی حدیث کے ہم معنی روایت کی اور مزید بیان کیا : کہا : تو آپ صلی اللہ علیہ وسلم نے ان کی نماز جنازہ پڑھنی چھوڑ دی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6209,
			"arabicnumber": "2401",
			"text": "محمد بن ابی حرملہ نے یسار کے دونوں بیٹوں عطاء اور سلیمان اور ابوسلمہ بن عبدالرحمان سے روایت کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : کہ رسول اللہ صلی اللہ علیہ وسلم اپنے گھر میں لیٹے ہوئے تھے ، رانیں یا پنڈلیاں کھولے ہوئے تھے کہ اتنے میں سیدنا ابوبکر رضی اللہ عنہ نے اجازت مانگی ، تو آپ صلی اللہ علیہ وسلم نے اسی حالت میں اجازت دے دی اور باتیں کرتے رہے ۔ پھر سیدنا عمر رضی اللہ عنہ نے اجازت چاہی تو انہیں بھی اسی حالت میں اجازت دے دی اور باتیں کرتے رہے ۔ پھر سیدنا عثمان رضی اللہ عنہ نے اجازت چاہی تو رسول اللہ صلی اللہ علیہ وسلم بیٹھ گئے اور کپڑے برابر کر لئے ۔ پھر وہ آئے اور باتیں کیں ۔ ( راوی محمد کہتا ہے کہ میں نہیں کہتا کہ تینوں کا آنا ایک ہی دن ہوا ) جب وہ چلے گئے تو ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ سیدنا ابوبکر رضی اللہ عنہ آئے تو آپ صلی اللہ علیہ وسلم نے کچھ خیال نہ کیا ، پھر سیدنا عمر رضی اللہ عنہ آئے تو بھی آپ صلی اللہ علیہ وسلم نے کچھ خیال نہ کیا ، پھر سیدنا عثمان رضی اللہ عنہ آئے تو آپ صلی اللہ علیہ وسلم بیٹھ گئے اور اپنے کپڑے درست کر لئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا میں اس شخص سےحیا نہ کروں جس سے فرشتے حیاکرتے ہیں؟",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6210,
			"arabicnumber": "2402.01",
			"text": "عقیل بن خالد نے ابن شہاب سے ، انھوں نے یحییٰ بن سعید بن عاص سے روایت کی ، انھیں سعید بن عاص نے بتایا کہ نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا اور حضرت عثمان رضی اللہ تعالیٰ عنہ نے ان سے بیان کیا کہ حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے اجازت طلب کی ، اس وقت رسول اللہ صلی اللہ علیہ وسلم اپنے بستر پر لیٹے ہوئے تھے ، حضرت عائشہ رضی اللہ تعالیٰ عنہا کی چادر اوڑھ رکھی تھی ۔ آپ نے حضرت ابو بکر رضی اللہ تعالیٰ عنہ کو اس حالت میں اندر آنے کی اجازت دے دی ، حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے اپنی بات کی ، پھر چلے گئے ، ان کے بعد حضرت عمر رضی اللہ تعالیٰ عنہ نے اجازت طلب کی ، آپ نے اجازت دے دی ۔ وہ بھی جس کام کے لئے آئے تھے ، وہ کیا ، پھر چلے گئے ۔ حضرت عثمان رضی اللہ تعالیٰ عنہ نے کہا : پھر میں نے آپ کے پاس حاضری کی اجازت چاہی تو آپ اٹھ کر بیٹھ گئے اور حضرت عائشہ رضی اللہ تعالیٰ عنہا سے کہا : \" اپنے کپڑے اپنے اوپر اکھٹے کرلو ۔ \" پھر میں جس کام کے لئے آیا تھا وہ کیا اور واپس آگیا توحضرت عائشہ رضی اللہ تعالیٰ عنہا نے پوچھا : اللہ کے رسول صلی اللہ علیہ وسلم ! کیا وجہ ہے میں نے آپ کو نہیں دیکھا کہ آپ ابو بکر رضی اللہ تعالیٰ عنہ اور عمر رضی اللہ تعالیٰ عنہ کے لئے اس طرح ہڑ بڑا کے اٹھے ہوں جس طرح عثمان رضی اللہ تعالیٰ عنہ کے لئے اٹھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عثمان انتہائی حیادار ہیں ، مجھے ڈر تھا کہ میں نے اسی حالت میں ان کو آنے کی اجازت دی تو وہ اپنی ضرورت کے بارے میں مجھ سے بات نہیں کرسکیں گے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 6211,
			"arabicnumber": "2402.02",
			"text": "صالح بن کیسان نے ابن شہاب سے روایت کی ، انھوں نے کہا : مجھے یحییٰ بن سعید بن عاص نے بتایا ، انھیں سعید بن عاص نے خبر دی کہ حضرت عثمان اور حضرت عائشہ رضی اللہ تعالیٰ عنہا نے انھیں حدیث سنائی کہ حضرت ابو بکر صدیق رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے ( حاضر ہونے کی ) اجازت طلب کی ، پھر زہری سے عقیل کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6212,
			"arabicnumber": "2403.01",
			"text": "عثمان بن غیاث نے ابو عثمان نہدی سے ، انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک دن رسول اللہ صلی اللہ علیہ وسلم مدینہ منورہ کے باغوں میں سے ایک باغ میں ٹیک لگائے بیٹھے ہوئے تھے آپ کے پاس جو لکڑی تھی اس ( کی نوک ) کو پانی اور مٹی کے درمیان ماررہے تھے کہ ایک شخص نے ( باغ کا دروازہ ) کھولنے کی درخواست کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" دروازہ کھول دو اور اس ( آنے والے ) کو جنت کی خوشخبری سنادو ۔ \" ( ابو موسیٰ علیہ السلام نے ) کہا : وہ ابو بکر رضی اللہ تعالیٰ عنہ تھے ، میں نے ان کے لئے دروازہ کھولا اور انھیں جنت کی بشارت دی ، کہا : پھر ایک اور شخص نے دروازہ کھولنے کی درخواست کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" دروازہ کھول دو اور اسے ( بھی ) جنت کی خوشخبری سنادو ۔ \" میں گیا تو وہ حضرت عمر رضی اللہ تعالیٰ عنہ تھے ۔ میں نے ان کے لیے دروازہ کھولا اور انھیں جنت کی بشارت دی ، اس کے بعد ایک اور شخص نے دروازہ کھولنے کی درخواست کی ، کہا : تو آپ ( سیدھے ہوکر ) بیٹھ گئے ، پھر فرمایا : \" دروازہ کھولو اور فتنے پر جو ( برپا ) ہوگا ، انھیں جنت کی خوشخبری دے دو ۔ \" کہا : میں گیا تو وہ عثمان بن عفان رضی اللہ تعالیٰ عنہ تھے ۔ کہا : میں نے دروازہ کھولا اور انھیں جنت کی خوشخبری دی اور آپ نے جو کچھ فرمایا تھا ، انھیں بتایا ۔ انھوں نے کہا : اے اللہ صبر عطا فرمانا اور اللہ ہی ہے جس سے مدد طلب کی جاتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6213,
			"arabicnumber": "2403.02",
			"text": "ایوب نے ابو عثمان نہدی سے ، انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم باغ میں گئے اور مجھے حکم دیا کہ میں دروازے کی حفاظت کروں ۔ ( پھر ) عثمان بن غیاث کی حدیث کے ہم معنی ( حدیث بیا ن کی ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6214,
			"arabicnumber": "2403.03",
			"text": "یحییٰ بن حسان نے کہا : ہمیں سلیمان بن بلال نے شریک بن ابی نمر سے ، انھوں نے سعید بن مسیب سے روایت کی ، کہا : کہ مجھے سیدنا ابوموسیٰ اشعری رضی اللہ عنہ نے خبر دی کہ انہوں نے اپنے گھر میں وضو کیا ، پھر باہر نکلے ۔ سیدنا ابوموسیٰ کہتے ہیں کہ میں نے کہا کہ آج میں دن بھر رسول اللہ صلی اللہ علیہ وسلم کا ساتھ نہ چھوڑوں گا ، آپ صلی اللہ علیہ وسلم کے پاس ہی رہوں گا ۔ کہتے ہیں کہ پھر مسجد میں آیا تو نبی کریم صلی اللہ علیہ وسلم کے بارے میں پوچھا ۔ لوگوں نے کہا کہ باہر اس طرف تشریف لے گئے ہیں ۔ میں بھی آپ صلی اللہ علیہ وسلم کے قدموں کے نشان پر چلا اور آپ صلی اللہ علیہ وسلم کے بارے میں لوگوں سے پوچھتا جاتا تھا ۔ چلتے چلتے معلوم ہوا کہ آپ صلی اللہ علیہ وسلم مقام اریس پر باغ میں گئے ہیں ۔ میں دروازے کے قریب بیٹھ گیا جو کھجور کی ڈالیوں کا بنا ہوا تھا ، یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم حاجت سے فارغ ہوئے اور وضو کر چکے تو میں آپ صلی اللہ علیہ وسلم کی طرف چل دیا ۔ میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم اریس کنوئیں کی منڈیر پر بیٹھے ہیں اور دونوں پنڈلیاں کھول کر کنوئیں میں لٹکا دی ہیں ۔ پس میں نے آپ صلی اللہ علیہ وسلم کو سلام کیا اور پھر لوٹ کر دروازے کے قریب بیٹھ گیا ۔ میں نے ( دل میں ) کہا کہ میں آج نبی کریم صلی اللہ علیہ وسلم کا دربان ، چوکیدار رہوں گا ۔ اتنے میں سیدنا ابوبکر رضی اللہ عنہ آئے اور دروازے کو دھکیلا ۔ میں نے پوچھا کون ہے؟ انہوں نے کہا کہ ابوبکر ہوں ، میں نے کہا ذرا ٹھہرو ۔ پھر میں گیا اور کہا کہ یا رسول اللہ! ابوبکر اندر آنے کی اجازت چاہتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ان کو آنے دو اور جنت کی خوشخبری دو ۔ میں آیا اور سیدنا ابوبکر سے کہا کہ اندر داخل ہو ، اور رسول اللہ صلی اللہ علیہ وسلم نے آپ کو جنت کی خوشخبری دی ہے ۔ پس سیدنا ابوبکر داخل ہوئے اور نبی کریم صلی اللہ علیہ وسلم کی داہنی طرف اسی منڈیر پر دونوں پاؤں لٹکا کر پنڈلیاں کھول کر جیسے نبی کریم صلی اللہ علیہ وسلم بیٹھے تھے ، بیٹھ گئے ۔ میں لوٹ آیا اور پھر بیٹھ گیا اور میں اپنے بھائی ( عامر ) کو گھر میں وضو کرتے چھوڑ آیا تھا ، میں نے کہا کہ اگر اللہ تعالیٰ کو فلاں ( یعنی ) میرے بھائی کی بھلائی منظور ہے تو اس کو یہاں لے آئے گا ۔ اتنے میں ( کیا دیکھتا ہوں کہ ) کوئی دروازہ ہلانے لگا ہے ۔ میں نے پوچھا کون ہے؟ جواب آیا کہ عمر بن خطاب ۔ میں نے کہا ٹھہر جا ۔ پھر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا ، سلام کیا اور کہا کہ سیدنا عمر بن خطاب اندر آنے کی اجازت چاہتے ہیں؟ فرمایا کہ انہیں اجازت دو اور جنت کی خوشخبری بھی دو ۔ پس میں گیا اور کہا کہ اندر داخل ہو اور رسول اللہ صلی اللہ علیہ وسلم نے تجھے جنت کی خوشخبری دی ہے ۔ پس وہ بھی داخل ہوئے اور رسول اللہ صلی اللہ علیہ وسلم کے بائیں طرف اسی منڈیر پر بیٹھ گئے اور دونوں پاؤں کنوئیں میں لٹکا دئیے ۔ پھر میں لوٹ آیا اور ( دروازے پر ) بیٹھ گیا ۔ میں نے کہا کہ اگر اللہ کو فلاں آدمی ( عامر ) کی بھلائی منظور ہے تو اس کو بھی لے آئے گا ۔ اتنے میں ایک اور آدمی نے دروازہ ہلایا ۔ میں نے کہا کہ کون ہے؟ جواب دیا کہ عثمان بن عفان ۔ میں نے کہا کہ ٹھہر جا ۔ پھر میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور بتایا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ انہیں اجازت دو اور جنت کی خوشخبری دو مگر وہ ایک مصیبت میں مبتلا ہوں گے ۔ میں آیا اور ان سے کہا کہ داخل ہو اور رسول اللہ صلی اللہ علیہ وسلم نے تجھے جنت کی خوشخبری دی ہے مگر ایک بلا کے ساتھ جو تم پر آئے گی ۔ پس وہ بھی داخل ہوئے اور دیکھا کہ منڈیر کا ایک حصہ بھر گیا ہے ، پس وہ دوسرے کنارے پر آپ صلی اللہ علیہ وسلم کے سامنے بیٹھ گئے ۔ شریک نے کہا کہ سعید بن مسیب نے کہا کہ میں نے اس حدیث سے یہ نکالا کہ ان کی قبریں بھی اسی طرح ہوں گی ۔ ( ویسا ہی ہوا کہ سیدنا عثمان رضی اللہ عنہ کو اس حجرہ میں جگہ نہ ملی ، تو وہ آپ صلی اللہ علیہ وسلم کے سامنے بقیع میں دفن ہوئے ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6215,
			"arabicnumber": "2403.04",
			"text": "سعید بن عفیر نے کہا : مجھے سلیمان بن بلال نے حدیث بیان کی ، کہا : مجھے شریک بن عبداللہ بن ابی نمر نے حدیث بیان کی ، کہا : میں نے سعید بن مسیب کو یہ کہتے ہوئے سنا کہ مجھے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ نے اس جگہ ۔ اور سلیمان نے سعید بن مسیب کے بیٹھنے کی جگہ کی جانب اشارہ کیا ۔ حدیث سنائی ۔ ابو موسیٰ رضی اللہ تعالیٰ عنہ نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضری کے لئے نکلا ۔ میں نے دیکھا کہ آپ ( لوگوں کے ) باغات کے اندر سے گزر کرگئے ہیں ۔ میں آپ کے پیچھے ہولیا ، میں نے دیکھا کہ آپ ایک باغ کے اندر تشریف لے گئے ہیں ، کنویں کی منڈیر پر بیٹھ گئے ہیں اور اپنی پنڈلیوں سے کپڑا ہٹا کر انھیں کنویں میں لٹکا لیا ہے ، پھر یحییٰ بن حسان کی حدیث کے ہم معنی حدیث بیان کی اور ( اس میں ) حضرت سعید بن مسیب کا قول : \" میں نے ان کی قبریں مراد لیں \" بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6216,
			"arabicnumber": "2403.05",
			"text": "محمد بن جعفر بن ابی کثیر نے ہمیں حدیث بیان کی ، کہا : مجھے شریک بن عبداللہ بن ابی نمر نے سعید بن مسیب سے خبر دی ، انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ایک دن رسول اللہ صلی اللہ علیہ وسلم اپنی ضرورت کے لئے مدینہ کے ایک باغ میں تشریف لے گئے ، میں آپ کے پیچھے پیچھے نکل پڑا ، اور سلیمان بن بلال کی حدیث کے ہم معنی حدیث بیان کی اور حدیث میں یہ بیا ن کیاکہ ابن مسیب نےکہا : میں نے ان سے ان کی قبریں مراد لیں ( جو ) یہاں اکھٹی ہیں اورحضرت عثمان رضی اللہ تعالیٰ عنہ کی الگ ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6217,
			"arabicnumber": "2404.01",
			"text": "سعید بن مسیب نے عامر بن سعد بن ابی وقاص سے ، انھوں نے ا پنے والد سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے حضرت علی رضی اللہ تعالیٰ عنہ سےفرمایا : \"\" تمھارا میرے ساتھ وہی مقام ہے جو ہارون علیہ السلام کاموسیٰ علیہ السلام کےساتھ تھا مگر یہ کہ میرے بعد کوئی نبی نہیں ۔ \"\" سعید ( بن مسیب ) نے کہا : میں نے چاہا کہ یہ بات میں خود حضرت سعد رضی اللہ تعالیٰ عنہ کے منہ سے سنوں تو میں حضرت سعد رضی اللہ تعالیٰ عنہ سے جا کر ملا اور جو حدیث مجھے عامر نے سنائی تھی ، ان کے سامنے بیان کی ، انھوں نے کہا : میں نے ( آپ صلی اللہ علیہ وسلم سے خود ) یہ بات سنی تھی ، میں نے کہا : آپ نے خود سنی تھی؟کہا : تو انھوں نے اپنی انگلیاں اپنے دونوں کانوں پر رکھیں اورکہا : ہاں ، ورنہ ( اگر یہ بات نہ سنی ہو ) تو ان دونوں کو سنائی نہ دے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6218,
			"arabicnumber": "2404.02",
			"text": "محمد بن جعفر ( غندر ) نے کہا : ہمیں شعبہ نے حکم سے حدیث بیان کی ، انھوں نے مصعب بن سعد بن ابی وقاص سے روایت کی ، انھوں نے حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ رسول اللہ صلی اللہ علیہ وسلم نے غزوہ تبوک کے موقعہ پر سیدنا علی رضی اللہ عنہ کو ( مدینہ میں ) خلیفہ بنایا ، تو انہوں نے عرض کیا کہ یا رسول اللہ! آپ مجھے عورتوں اور بچوں میں چھوڑے جاتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ کیا تم اس بات سے خوش نہیں ہوتے کہ تمہارا درجہ میرے پاس ایسا ہو جیسے موسیٰ علیہ السلام کے پاس ہارون علیہ السلام کا تھا ، لیکن میرے بعد کوئی پیغمبر نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6219,
			"arabicnumber": "2404.03",
			"text": "معاذ نے کہا : ہمیں شعبہ نے اسی سند سے حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6220,
			"arabicnumber": "2404.04",
			"text": "بکیر بن مسمار نے عامر بن سعد بن ابی وقاص سے ، انھوں نے اپنے والد سے روایت کی کہ حضرت معاویہ بن ابی سفیان رضی اللہ تعالیٰ عنہ نے حضرت سعد رضی اللہ تعالیٰ عنہ کو حکم دیا ، کہا : آپ کو اس سے کیا چیز روکتی ہے کہ آپ ابوتراب ( حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ ) کو براکہیں ۔ انھوں نے جواب دیا : جب تک مجھے وہ تین باتیں یاد ہیں جو رسول اللہ صلی اللہ علیہ وسلم نے ان ( حضر ت علی رضی اللہ تعالیٰ عنہ ) سے کہی تھیں ، میں ہرگز انھیں برا نہیں کہوں گا ۔ ان میں سے کوئی ایک بات بھی میرے لئے ہوتو وہ مجھے سرخ اونٹوں سے زیادہ پسند ہوگی ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے سناتھا ، آپ ان سے ( اس وقت ) کہہ رہے تھے جب آپ ایک جنگ میں ان کو پیچھے چھوڑ کر جارہے تھے اور علی رضی اللہ تعالیٰ عنہ نے ان سے کہا تھا : اللہ کےرسول صلی اللہ علیہ وسلم !آپ مجھے عورتوں اوربچوں میں پیچھے چھوڑ کرجارہے ہیں؟تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے فرمایا : \" تمھیں یہ پسند نہیں کہ تمھارا میرے ساتھ وہی مقام ہو جوحضرت ہارون علیہ السلام کاموسیٰ علیہ السلام کےساتھ تھا ، مگر یہ کہ میرے بعد نبوت نہیں ہے ۔ \" اسی طرح خیبر کے دن میں نے آپ صلی اللہ علیہ وسلم کو یہ کہتے ہوئے سناتھا : \" اب میں جھنڈ ا اس شخص کو دوں گا جو اللہ اوراس کے رسول صلی اللہ علیہ وسلم ! سے محبت کرتا ہے اور اللہ اور اس کا ر سول صلی اللہ علیہ وسلم اس سے محبت کرتے ہیں ۔ \" کہا : پھر ہم نے اس بات ( مصداق جاننے ) کے لئے اپنی گردنیں اٹھا اٹھا کر ( ہرطرف ) دیکھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" علی کو میرے پاس بلاؤ ۔ \" انھیں شدید آشوب چشم کی حالت میں لایا گیا ۔ آپ نےان کی آنکھوں میں اپنا لعاب دہن لگایا اورجھنڈا انھیں عطافرمادیا ۔ اللہ نے ان کے ہاتھ پر خیبر فتح کردیا ۔ اورجب یہ آیت اتری : \" ( تو آپ کہہ دیں : آؤ ) ہم اپنے بیٹوں اور تمھارے بیٹوں کو بلالیں ۔ \" تورسول اللہ صلی اللہ علیہ وسلم نے حضر ت علی رضی اللہ تعالیٰ عنہ ، حضرت فاطمہ رضی اللہ تعالیٰ عنہ ، حضرت حسن رضی اللہ تعالیٰ عنہ ، اورحضرت حسین رضی اللہ تعالیٰ عنہ کو بلایا اور فرمایا : \" اے اللہ! یہ میرے گھر والے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 6221,
			"arabicnumber": "2404.05",
			"text": "ابراہیم بن سعد نے حضرت سعد رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روای کی کہ آپ نے حضرت علی رضی اللہ تعالیٰ عنہ سے فرمایا : \" کیا تم اس پر راضی نہیں ہو کہ تم میرے لئے ایسےہو جیسے موسیٰ علیہ السلام کے لئے ہارون علیہ السلام تھے؟",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6222,
			"arabicnumber": "2405",
			"text": "سہیل کے والد ( ابو صالح ) نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ ر سول اللہ صلی اللہ علیہ وسلم نے غزوہ خیبر کےدن فرمایا : \" کل میں اس شخص کو جھنڈا دوں گا جو اللہ اور اس کے رسول صلی اللہ علیہ وسلم سے محبت کرتا ہے ، اللہ اس کے ہاتھ پر فتح عطافرمائے گا ۔ \" حضرت عمر رضی اللہ تعالیٰ عنہ بن خطاب نے کہا : اس ایک دن کے علاوہ میں نے کبھی امارت کی تمنا نہیں کی ، کہا : میں نے اس امید کہ مجھے اس کے لئے بلایا جائے گا اپنی گردن اونچی کی تو رسول اللہ صلی اللہ علیہ وسلم نے حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ کو بلایا ، ان کو وہ جھنڈا دیا اور فرمایا : \" جاؤ ، پیچھےمڑ کر نہ دیکھو ، یہاں تک کہ اللہ تمھیں فتح عطا کردے ۔ \" کہا : حضرت علی رضی اللہ تعالیٰ عنہ کچھ دور گئے ، پھر ٹھر گئے ، پیچھے مڑ کر نہ دیکھا اور بلند آواز سے پکار کر کہا : اللہ کے رسول صلی اللہ علیہ وسلم !کس بات پر لوگوں سے جنگ کروں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ان سے لڑو یہاں تک کہ وہ اس بات کی گواہی دیں کہ اللہ کے سوا کوئی عبادت کے لائق نہیں اور محمد صلی اللہ علیہ وسلم اللہ کے رسول ہیں ، اگرانھوں نے ایسا کرلیا توانھوں نے اپنی جانیں اور اپنے مال تم سے محفوظ کرلیے ، سوائے یہ کہ اسی ( شہادت ) کاحق ہو اوران کاحساب اللہ پر ہوگا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6223,
			"arabicnumber": "2406",
			"text": "ابوحازم نے کہا : مجھے حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ نے کہ خیبر کے دن رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کہ میں یہ جھنڈا اس شخص کو دوں گا جس کے ہاتھ پر اللہ تعالیٰ فتح دے گا اور وہ اللہ اور اس کے رسول سے محبت کرتا ہو گا اور اللہ اور اللہ کے رسول اس کو چاہتے ہوں گے ۔ پھر رات بھر لوگ ذکر کرتے رہے کہ دیکھیں یہ شان آپ صلی اللہ علیہ وسلم کس کو دیتے ہیں ۔ جب صبح ہوئی تو سب کے سب رسول اللہ صلی اللہ علیہ وسلم کے پاس یہی امید لئے آئے کہ یہ جھنڈا مجھے ملے گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ علی بن ابی طالب کہاں ہیں؟ لوگوں نے عرض کیا کہ یا رسول اللہ! ان کی آنکھیں دکھتی ہیں ۔ پھر آپ صلی اللہ علیہ وسلم نے انہیں بلا بھیجا اور ان کی آنکھوں میں تھوک لگایا اور ان کے لئے دعا کی تو وہ بالکل اچھے ہو گئے گویا ان کو کوئی تکلیف نہ تھی ۔ پھر آپ صلی اللہ علیہ وسلم نے انہیں جھنڈا دیا ۔ چنانچہ سیدنا علی رضی اللہ عنہ نے عرض کیا کہ یا رسول اللہ! میں ان سے لڑوں گا یہاں تک کہ وہ ہماری طرح ( مسلمان ) ہو جائیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ آہستہ چلتا جا ، یہاں تک کہ ان کے میدان میں اترے ، پھر ان کو اسلام کی طرف بلا اور ان کو بتا جو اللہ کا حق ان پر واجب ہے ۔ اللہ کی قسم اگر اللہ تعالیٰ تیری وجہ سے ایک شخص کو ہدایت کرے تو وہ تیرے لئے سرخ اونٹوں سے زیادہ بہتر ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6224,
			"arabicnumber": "2407",
			"text": "حضرت سلمہ بن اکوع رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : غزوہ خیبر میں حضرت علی رضی اللہ تعالیٰ عنہ نبی کریم صلی اللہ علیہ وسلم سے پیچھے رہ گئے ، انھیں آشوب چشم تھا ۔ پھر انھوں نے کہا : میں تو رسول اللہ صلی اللہ علیہ وسلم پیچھے رہ گیا!چنانچہ حضرت علی رضی اللہ تعالیٰ عنہ ( وہاں سے ) نکلے اور نبی کریم صلی اللہ علیہ وسلم سے آملے ، جب اس رات کی شام آئی جس کی صبح کو اللہ تعالیٰ نے خیبر فتح کرایا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کل میں جھنڈا اس کودوں گایا ( فرمایا : ) کل جھنڈا وہ شخص لے گا جس سے اللہ اور اس کے رسول صلی اللہ علیہ وسلم کو محبت ہے یا فرمایا : جواللہ اور اس کے رسول صلی اللہ علیہ وسلم سے محبت کرتاہے ، اللہ تعالیٰ اس کے ہاتھ پر فتح دے گا ۔ \" پھر اچانک ہم نے حضرت علی رضی اللہ تعالیٰ عنہ کو دیکھا اور ہمیں اس کے بارے میں کوئی توقع نہیں تھی تو صحابہ رضوان للہ عنھم اجمعین نے کہا : یہ حضرت علی رضی اللہ تعالیٰ عنہ ہیں ، رسول اللہ صلی اللہ علیہ وسلم نے ان کو جھنڈا عطا کردیا اور اللہ نے ان کے ہاتھ پرفتح عطا کردی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6225,
			"arabicnumber": "2408.01",
			"text": "زہیر بن حرب اور شجاع بن مخلد نے اسماعیل بن ابراہیم ( ابن علیہ ) سے روایت کی ، انھوں نے کہا : مجھے ابوحیان نے حدیث بیان کی ، کہا : یزید بن حیان نے مجھ سے بیان کیا کہ میں ، حصین بن سبرہ اور عمر بن مسلم ( تینوں ) حضرت زید بن ارقم کے پاس گئے ۔ جب ہم ان کے قریب بیٹھ گئے تو حصین نے ان سے کہا : زید!آ پ کو خیر کثیرحاصل ہوئی ، آپ نے رسول اللہ صلی اللہ علیہ وسلم کی زیارت کی ، ان کی بات سنی ، ان کے ساتھ مل کر جہاد کیا اور ان کی اقتداء میں نمازیں پڑھیں ۔ زید!آپ کوخیر کثیرحاصل ہوئی ۔ زید!ہمیں رسول اللہ صلی اللہ علیہ وسلم سے سنی ہوئی ( کوئی ) حدیث سنایئے ۔ ( حضرت زید رضی اللہ تعالیٰ عنہ نے ) کہا : بھتیجے!میری عمر زیادہ ہوگی ، زمانہ بیت گیا ، رسول اللہ صلی اللہ علیہ وسلم کی جو احادیث یاد تھیں ان میں سے کچھ بھول چکا ہوں ، اب جو میں بیان کروں اسے قبول کرو ۔ اور جو ( بیان ) نہ کرسکوں تو اس کا مجھےمکلف نہ ٹھہراؤ ۔ پھر کہا : کہ رسول اللہ صلی اللہ علیہ وسلم ایک دن مکہ اور مدینہ کے درمیان واقع مقام ”خم“کے پانی کے مقام پر خطبہ سنانے کو کھڑے ہوئے ۔ آپ صلی اللہ علیہ وسلم نے اللہ کی حمد کی اور اس کی تعریف کو بیان کیا اور وعظ و نصیحت کی ۔ پھر فرمایا کہ اس کے بعد اے لوگو! میں آدمی ہوں ، قریب ہے کہ میرے رب کا بھیجا ہوا ( موت کا فرشتہ ) پیغام اجل لائے اور میں قبول کر لوں ۔ میں تم میں دو بڑی چیزیں چھوڑے جاتا ہوں ۔ پہلے تو اللہ کی کتاب ہے اور اس میں ہدایت ہے اور نور ہے ۔ تو اللہ کی کتاب کو تھامے رہو اور اس کو مضبوط پکڑے رہو ۔ غرض کہ آپ صلی اللہ علیہ وسلم نے اللہ کی کتاب کی طرف رغبت دلائی ۔ پھر فرمایا کہ دوسری چیز میرے اہل بیت ہیں ۔ میں تمہیں اپنے اہل بیت کے بارے میں اللہ تعالیٰ یاد دلاتا ہوں ، تین بار فرمایا ۔ اور حصین نے کہا کہ اے زید! آپ صلی اللہ علیہ وسلم کے اہل بیت کون سے ہیں ، کیا آپ صلی اللہ علیہ وسلم کی ازواج مطہرات اہل بیت نہیں ہیں؟ سیدنا زید رضی اللہ عنہ نے کہا کہ ازواج مطہرات بھی اہل بیت میں داخل ہیں لیکن اہل بیت وہ ہیں جن پر زکوٰۃ حرام ہے ۔ حصین نے کہا کہ وہ کون لوگ ہیں؟ سیدنا زید رضی اللہ عنہ نے کہا کہ وہ علی ، عقیل ، جعفر اور عباس کی اولاد ہیں ۔ حصین نے کہا کہ ان سب پر صدقہ حرام ہے؟ سیدنا زید رضی اللہ عنہ نے کہا کہ ہاں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6226,
			"arabicnumber": "2408.02",
			"text": "سعید بن مسروق نے یزید بن حیان سے ، انھوں نے زید بن ارقم رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ، نیز ( سعید بن مسروق نے ) ان ( ابوحیان ) کی حدیث کے مانند زہیر کی حدیث کے ہم معنی روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6227,
			"arabicnumber": "2408.03",
			"text": "ابو بکر بن ابی شیبہ نے کہا : ہمیں محمد بن فضیل نے حدیث بیان کی ، اسحاق بن ابراہیم نے کہا : ہمیں جریر نے خبر دی ، ان دونوں ( محمد بن فضیل اورجریر ) نے ابوحیان سے اسی سند کےساتھ اسماعیل کی حدیث کے مانند بیان کیا اور ( اسحاق بن ابراہیم نے ) جریر کی روایت میں مزید یہ بیان کیا : \" اللہ کی کتاب جس میں ہدایت اورنور ہے ، جس نے اس کو مضبوطی سےتھام لیا اور اسے لےلیا وہ ہدایت پر ہوگا اور جو اس سے ہٹ گیا وہ گمراہ ہوجائے گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6228,
			"arabicnumber": "2408.04",
			"text": "سعید بن مسروق نے یزید بن حیان سے ، انھوں نے زید بن ارقم رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم ان ( زید بن ارقم رضی اللہ تعالیٰ عنہ ) کے پاس آئے اور اُن سے عرض کی : آپ نے بہت خیر دیکھی ہے ۔ آپ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہے ۔ آپ صلی اللہ علیہ وسلم کے پیچھے نمازیں پڑھیں ہیں ، اور پھر ابو حیان کی حدیث کی طرح حدیث بیان کی ، مگرانھوں نے ( اس طرح ) کہا : ( رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ) \" دیکھو ، میں تمھارے درمیان دو عظیم چیزیں چھوڑے جارہا ہوں ۔ ایک اللہ کی کتاب ہے وہ اللہ کی رسی ہے جس نے ( اسے تھام کر ) اس کا اتباع کیا وہ سیدھی راہ پر رہے گا اور جو اسے چھوڑ دے گا وہ گمراہی پر ہوگا ۔ \" اور اس میں یہ بھی ہے کہ ہم نے ان سے پوچھا : آپ کے اہل بیت کون ہیں؟ ( صرف ) آپ کی ازواج؟انھوں نے کہا : نہیں ، اللہ کی قسم!عورت اپنے مرد کے ساتھ زمانے کا بڑا حصہ رہتی ہے ، پھر وہ اسے طلاق دے دیتا ہے تو وہ اپنے باپ اور اپنی قوم کی طرف واپس چلی جاتی ہے ۔ آپ صلی اللہ علیہ وسلم کے بعد آپ کے اہل بیت وہ ( بھی ) ہیں جو آپ کے خاندان سے ہیں ، آپ کے وہ ددھیال رشتہ دار جن پر صدقہ حرام ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6229,
			"arabicnumber": "2409",
			"text": "ابو حازم نے حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ مدینہ میں مروان کی اولاد میں سے ایک شخص حاکم ہوا تو اس نے سیدنا سہل رضی اللہ عنہ کو بلایا اور سیدنا علی رضی اللہ عنہ کو گالی دینے کا حکم دیا ۔ سیدنا سہل رضی اللہ عنہ نے انکار کیا تو وہ شخص بولا کہ اگر تو گالی دینے سے انکار کرتا ہے تو کہہ کہ ابوتراب پر اللہ کی لعنت ہو ۔ سیدنا سہل رضی اللہ عنہ نے کہا کہ سیدنا علی رضی اللہ عنہ کو ابوتراب سے زیادہ کوئی نام پسند نہ تھا اور وہ اس نام کے ساتھ پکارنے والے شخص سے خوش ہوتے تھے ۔ وہ شخص بولا کہ اس کا قصہ بیان کرو کہ ان کا نام ابوتراب کیوں ہوا؟ سیدنا سہل رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم سیدہ فاطمۃالزہراء رضی اللہ عنہا کے گھر تشریف لائے تو سیدنا علی رضی اللہ عنہ کو گھر میں نہ پایا ، آپ صلی اللہ علیہ وسلم نے پوچھا کہ تیرے چچا کا بیٹا کہاں ہے؟ وہ بولیں کہ مجھ میں اور ان میں کچھ باتیں ہوئیں اور وہ غصہ ہو کر چلے گئے اور یہاں نہیں سوئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی سے فرمایا کہ دیکھو وہ کہاں ہیں؟ وہ آیا اور بولا کہ یا رسول اللہ! علی مسجد میں سو رہے ہیں ۔ آپ صلی اللہ علیہ وسلم سیدنا علی رضی اللہ عنہ کے پاس تشریف لے گئے ، وہ لیٹے ہوئے تھے اور چادر ان کے پہلو سے الگ ہو گئی تھی اور ( ان کے بدن سے ) مٹی لگ گئی تھی ، تو رسول اللہ صلی اللہ علیہ وسلم نے وہ مٹی پونچھنا شروع کی اور فرمانے لگے کہ اے ابوتراب! اٹھ ۔ اے ابوتراب! اٹھ ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6230,
			"arabicnumber": "2410.01",
			"text": "سلیمان بن بلال نے یحییٰ بن سعید سے ، انھوں نے عبداللہ بن عامر بن ربیعہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : ایک رات رسول اللہ صلی اللہ علیہ وسلم سو نہ سکے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کاش! میرے ساتھیوں میں سے کوئی صالح شخص آج پہرہ دے ۔ \"\" حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : اچانک ہم نے ہتھیاروں کی آوازسنی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ کون ہے؟حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم ! میں آپ کا پہرہ دینے کے لئے آیا ہوں ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : تو رسول اللہ صلی اللہ علیہ وسلم سو گئے حتیٰ کہ میں نے آپ کے خراٹوں کی آواز سنی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6231,
			"arabicnumber": "2410.02",
			"text": "قتیبہ بن سعید اور محمد بن رمح نے لیث سے حدیث بیان کی ، انھوں نے یحییٰ بن سعید سے ، انھوں نے عبداللہ بن عامر بن ربیعہ سے روایت کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : کہ ایک رات مدینہ کے راستے میں رسول اللہ صلی اللہ علیہ وسلم کی آنکھ کھل گئی اور نیند اچاٹ ہو گئی ، تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ کاش میرے اصحاب میں سے کوئی نیک بخت رات بھر میری حفاظت کرے ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ اتنے میں ہمیں ہتھیاروں کی آواز معلوم ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ کون ہے؟ آواز آئی کہ یا رسول اللہ! سعد بن ابی وقاص ہوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم کیوں آئے؟ وہ بولے کہ مجھے رسول اللہ صلی اللہ علیہ وسلم پر اپنے نفس میں ڈر ہوا تو میں آپ صلی اللہ علیہ وسلم کی حفاظت کرنے کو آیا ہوں ۔ پس رسول اللہ صلی اللہ علیہ وسلم نے ان کے لئے دعا کی اور پھر سو رہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6232,
			"arabicnumber": "2410.03",
			"text": "عبد الواہاب نے کہا : میں نے یحییٰ بن سعید کو کہتے ہو ئے سنا کہا : میں نے عبد اللہ بن عامر بن ربیعہ کو کہتے ہو ئے سنا کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : ایک رات رسول اللہ صلی اللہ علیہ وسلم سونہ سکے ۔ ( آگے ) سلیمان بن بلال کی حدیث کے مانند ( ہے)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6233,
			"arabicnumber": "2411.01",
			"text": "منصور بن ابی مزاحم نے کہا : ہمیں ابرا ہیم بن سعد نے اپنے والد سے حدیث بیان کی ، انھوں نے عبد اللہ بن شداد سے روایت کی ، انھوں نے کہا : میں نے حضرت علی رضی اللہ تعالیٰ عنہ سے سنا ، کہ حضرت سعد بن مالک ( سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) کے سوا رسول اللہ صلی اللہ علیہ وسلم نے کسی کے لیے اکٹھا اپنے ماں باپ کا نام نہیں لیا ۔ جنگ اُحد کے دن آپ بار بار ان سے کہہ رہے تھے ۔ \" تیر چلا ؤ تم پرمیرے ماں باپ فداہوں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6234,
			"arabicnumber": "2411.02",
			"text": "شعبہ ، وکیع اور مسعر ، سب نے سعد بن ابرا ہیم سے ، انھوں نے عبد اللہ بن شدادسے ، انھوں نے حضرت علی رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6235,
			"arabicnumber": "2412.01",
			"text": "سلیمان بن بلال نے یحییٰ بن سعید سے انھوں نے سعید سے انھوں نے حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ سے روایت کی ۔ کہا : رسول اللہ صلی اللہ علیہ وسلم نے جنگ اُحد کے دن میرے لیے ایک ساتھ اپنے ماں باپ کا نام نہیں لیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6236,
			"arabicnumber": "2412.02",
			"text": "لیث بن سعد اور عبد الوہاب دونوں نے یحییٰ بن سعید سے اسی سند کے ساتھ حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6237,
			"arabicnumber": "2412.03",
			"text": "عامر بن سعد نے اپنے والد سے روایت کی ، کہ جنگ اُحد کےدن رسول اللہ صلی اللہ علیہ وسلم نے ان کے لیے ایک ساتھ اپنے ماں باپ کا نام لیا ۔ مشرکوں میں سے ایک شخص نے مسلمانوں کو جلا ڈالا تھا تو نبی صلی اللہ علیہ وسلم نے سعد سے کہا : \" تیر چلا ؤ تم پرمیرے ماں باپ فداہوں ! \" حضرت سعد رضی اللہ تعالیٰ عنہ نے کہا : میں نے اس کے لیے ( ترکش سے ) ایک تیر کھینچا ، اس کے پرَہی نہیں تھے ۔ میں نے وہ اس کے پہلو میں مارا تو وہ گر گیا اور اس کی شرمگاہ ( بھی ) کھل گئی تو ( اس کے اس طرح گرنے پر ) رسول اللہ صلی اللہ علیہ وسلم ہنس پڑے ، یہاں تک کے مجھے آپ کی داڑھیں نظر آنے لگیں ( آپ صلی اللہ علیہ وسلم کھل کھلاکرہنسے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6238,
			"arabicnumber": "1748.03",
			"text": "ابو بکر بن ابی شیبہ اور زہیر بن حرب نے کہا : ہمیں حسن بن موسیٰ نے حدیث بیان کی ، کہا : ہمیں زہیر نےسماک بن حرب سے حدیث بیان کی کہ قرآن مجید میں ان کے حوالے سے کئی آیات نازل ہوئیں کہا : ان کی والدہ نے قسم کھائی کہ وہ اس وقت تک ان سے بات نہیں کریں گی یہاں تک کہ وہ اپنے دین ( اسلام ) سے کفر کریں اور نہ ہی کچھ کھا ئیں گی اور نہ پئیں گی ان کا خیال یہ تھا کہ اللہ تعالیٰ نے تمھیں حکم دیا ہے کہ اپنے والدین کی بات مانو اور میں تمھا ری ماں ہوں لہٰذا میں تمھیں اس دین کو چھوڑ دینے کا حکم دیتی ہوں ۔ کہا : وہ تین دن اسی حالت میں رہیں یہاں تک کہ کمزوری سے بے ہوش ہو گئیں تو ان کا بیٹا جو عمارہ کہلا تا تھا کھڑا ہوا اور انھیں پانی پلا یا ۔ ( ہوش میں آکر ) انھوں نے سعد رضی اللہ تعالیٰ عنہ کو بددعائیں دینی شروع کر دیں تو اللہ تعا لیٰ نے قرآن میں یہ آیت نازل فر ما ئی : \" ہم نے انسان کو اس کے والدین کے ساتھ حسن سلوک کا حکم دیا ہے اور اگر وہ دونوں یہ کو شش کریں کہ تم میرے ساتھ شریک ٹھہراؤ جس بات کو تم ( درست ہی ) نہیں جانتے تو تم ان کی اطاعت نہ کرواور دنیا میں ان کے ساتھ اچھے طریقے سے رہو ۔ \" کہا : اور ( دوسری آیت اس طرح اتری کہ ) رسول اللہ صلی اللہ علیہ وسلم کو بہت زیادہ غنیمت حاصل ہوئی ۔ اس میں ایک تلوار بھی تھی ۔ میں نے وہ اٹھا لی اور اسے لے کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ اور عرض کی : ( میرےحصے کے علاوہ ) یہ تلوارمزید مجھے دے دیں ، میری حالت کا تو آپ کو علم ہے ہی آپ نے فر ما یا : \" اسے وہیں رکھ دو جہاں سے تم نے اٹھائی ہے ۔ \" میں چلا گیا جب میں نے اسے مقبوضہ غنائم میں واپس پھینکنا چا ہا تو میرے دل نے مجھے ملا مت کی ( کہ واپس کیوں کر رہے ہو؟ ) تو میں آپ کے پاس واپس آگیا ۔ میں نے کہا : یہ مجھے عطا کر دیجئے ، آپ نے میرے لیے اپنی آواز کو سخت کیا اور فر ما یا : \" جہاں سے اٹھا ئی ہے وہیں واپس رکھ دو ۔ \" کہا : اس پر اللہ عزوجل نے یہ نازل فر ما یا : \" یہ لو گ آپ سے غنیمتوں کے بارے میں سوال کرتے ہیں ۔ \" کہا : ( ایک موقع نزول وحی کا یہ تھا کہ ) میں بیمار ہو گیا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کی طرف پیغام بھیجا ۔ آپ میرے پاس تشریف لے آئے ۔ میں نے کہا : مجھے اجازت دیجیے کہ میں اپنا ( سارا ) مال جہاں چاہوں تقسیم کر دوں ۔ کہا : آپ نے انکا ر فر مادیا ۔ میں نے کہا : تو آدھا؟ آپ اس پر بھی نہ مانے ، میں نے کہا : تو پھر تیسرا حصہ ؟اس پر آپ خاموش ہوگئے ۔ اس کے بعد تیسرے حصے کی وصیت جا ئز ہو گئی ۔ کہا : اور ( ایک اور موقع بھی آیا ) میں انصار اور مہاجرین کے کچھ لوگوں کے پاس آیا انھوں نے کہا : آؤ ہم تمھیں کھانا کھلا ئیں اور شراب پلا ئیں اور یہ شراب حرام کیے جا نے سے پہلے کی بات ہے ۔ کہا : میں کھجوروں کے ایک جھنڈکے درمیان خالی جگہ میں ان کے پاس پہنچا دیکھا تو اونٹ کا ایک بھنا ہوا سران کے پاس تھا اور شراب کی ایک مشک تھی ۔ میں نے ان کے ساتھ کھا یا ، شراب پی ، پھر ان کے ہاں انصار اور مہاجرین کا ذکر آگیا ۔ میں نے ( شراب کی مستی میں ) کہہ دیا : مہاجرین انصار سے بہتر ہیں تو ایک آدمی نے ( اونٹ کا ) ایک جبڑا پکڑا ، اس سے مجھے ضرب لگا ئی اور میری ناک زخمی کردی ، میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ کو یہ ( ساری ) بات بتا ئی تو اللہ تعا لیٰ نے میرے بارے میں ۔ ۔ ۔ ان کی مراد اپنے آپ سے تھی ۔ ۔ ۔ شراب کے متعلق ( یہ آیت ) نازل فر ما ئی : \" بے شک شراب ، جوا بت اور پانسے شیطان کے گندے کام ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6239,
			"arabicnumber": "1748.04",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے سماک بن حرب سے حدیث بیان کی ، انھوں نے مصعب بن سعد سے ، انھوں نے اپنے والد ( حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا : میرے بارے میں چار آیات نازل ہو ئیں پھر زبیر سے سماک کی حدیث کے ہم معنی بیان کیا اور شعبہ کی حدیث میں ( محمد بن جعفر نے ) مزید یہ بیان کیا کہ لوگ جب میری ماں کو کھانا کھلا نا چاہتے تو لکڑی سے اس کا منہ کھولتے ، پھر اس میں کھا نا ڈالتے ، اور انھی کی حدیث میں یہ بھی ہے کہ حضرت سعد رضی اللہ تعالیٰ عنہ کی ناک پر ہڈی ماری اور ان کی ناک پھاڑ دی ، حضرت سعد رضی اللہ تعالیٰ عنہ کی ناک پھٹی ہوئی تھی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6240,
			"arabicnumber": "2413.01",
			"text": "سفیان نے مقدام بن شریح سے انھوں نے اپنے والد سے انھوں نے حضرت سعد رضی اللہ تعالیٰ عنہ سے ( آیت ) \" اور ان ( مسکین مو منوں ) کو خود سے دورنہ کریں جو صبح و شام اپنے رب کو پکا رتے ہیں \" کے بارے میں روایت کی ، کہا : یہ چھ لو گوں کے بارے میں نازل ہو ئی ۔ میں اور ابن مسعود رضی اللہ تعالیٰ عنہ ان میں شامل تھے مشرکوں نے رسول اللہ صلی اللہ علیہ وسلم سے کہا تھا ۔ ان لوگوں کو اپنے قریب نہ کریں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6241,
			"arabicnumber": "2413.02",
			"text": "اسرائیل نے مقدام بن شریح سے انھوں نے اپنے والد سے انھوں نے حضرت سعد رضی اللہ تعالیٰ عنہ سےروایت کی ، کہا : نبی صلی اللہ علیہ وسلم کے ساتھ ہم چھ شخص تھے تو مشرکین نے نبی صلی اللہ علیہ وسلم سے کہا : \" ان لوگوں کو بھگا دیجیے ، یہ ہمارے سامنے آنے کی جرات نہ کریں ۔ ( حضرت سعد رضی اللہ تعالیٰ عنہ نے ) کہا : ( یہ لوگ تھے ) میں ابن مسعود ہذیل کا ایک شخص بلال اور دواور شخص جن کا نام میں نہیں لو ں گا ۔ رسول اللہ صلی اللہ علیہ وسلم کے دل میں جو اللہ نے چاہا سوآیا ، آپ نے اپنے دل میں کچھ کہا : بھی ، تب اللہ عزوجل نے یہ آیت نازل کی : \" اور ان لوگوں کو دورنہ کیجیے جو صبح ، شام اپنے رب کو پکا رتے ہیں صرف اس کی رضا چاہتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6242,
			"arabicnumber": "2414",
			"text": "معتمر کے والد سلیمان نے کہا : میں نے حضرت ابو عثمان سے سنا ، کہا : ان ایام میں سے ایک میں جب رسول اللہ صلی اللہ علیہ وسلم نے جہاد کیا تو جنگ کے دوران میں آپ کے ساتھ حضرت طلحہ رضی اللہ تعالیٰ عنہ اور حضرت سعد رضی اللہ تعالیٰ عنہ کے سوا اور کو ئی باقی نہیں رہا تھا ۔ ( یہ میں ) ان دونوں کی بتا ئی ہو ئی بات سے ( بیان کر رہا ہوںَ)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6243,
			"arabicnumber": "2415.01",
			"text": "سفیان بن عیینہ نے محمد بن منکدر سے انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے جنگ خندق کے دن لوگوں کو پکارا ۔ ( کو ن ہے جو ہمیں دشمنوں کے اندر کی خبر دے گا ۔ ؟ ) تو زبیر رضی اللہ تعالیٰ عنہ آگے آئے ( کہا : میں لا ؤں گا ) پھر آپ نے ان کو ( دوسری بار ) پکا را تو زبیر رضی اللہ تعالیٰ عنہ ہی آگے بڑھے پھر ان کو ( تیسری بار ) پکا را تو بھی زبیر رضی اللہ تعالیٰ عنہ ہی آگے بڑھے چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہر نبی کا حواری ( خاص مددگار ) ہو تا ہے اور میرا حواری زبیر ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6244,
			"arabicnumber": "2415.02",
			"text": "ہشام بن عروہ اور سفیان بن عیینہ نے محمد بن منکدر سے ، انھوں نے جا بر رضی اللہ تعالیٰ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے ابن عیینہ کی حدیث کے ہم معنی روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6245,
			"arabicnumber": "2416.01",
			"text": "علی بن مسہر نے ہشام بن عروہ سے انھوں نے اپنے والد سے ، انھوں نے حضرت عبد اللہ بن زبیر رضی اللہ تعالیٰ عنہ سے روایت کی کہا : میں اور حضرت عمر بن ابی سلمہ رضی اللہ تعالیٰ عنہ جنگ خندق کے دن عورتوں کے ساتھ حضرت حسان رضی اللہ تعالیٰ عنہ کے قلعے میں تھے کبھی وہ میرے لیے کمر جھکا کر کھڑے ہو جا تے اور میں ( ان کی کمر پر کھڑا ہو کر مسلمانوں کے لشکر کو ) دیکھ لیتا کبھی میں کمر جھکا کر کھڑا ہو جا تا اور وہ دیکھ لیتے ۔ میں نے اس وقت اپنے والد کو پہچان لیا تھا جب وہ اپنے گھوڑے پر ( سوار ہو کر ) بنو قریظہ کی طرف جا نے کے لیے گزرے ۔ ( ہشام بن عروہ نے ) کہا : مجھے عبد اللہ بن عروہ نے حضرت عبد اللہ بن زبیر رضی اللہ تعالیٰ عنہ سے ( روایت کرتے ہو ئے ) بتا یا کہا : میں نے یہ بات اپنے والد کو بتا ئی تو انھوں نے کہا : میرے بیٹے !تم نے مجھے دیکھا تھا ؟ میں نے کہا : ہاں انھوں نے کہا : اللہ کی قسم! اس روز رسول اللہ صلی اللہ علیہ وسلم نے میرے لیے اپنے ماں باپ دونوں کا ایک ساتھ ذکر کرتے ہو ئے کہا : تھا \" میرے ماں باپ تم پر قربان",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6246,
			"arabicnumber": "2416.02",
			"text": "ابو اسامہ نے ہشام سے انھوں نے اپنے والد سے انھوں نے حضرت عبد اللہ بن زبیر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : خندق کے دن میں اور عمر بن ابی سلمہ رضی اللہ تعالیٰ عنہ اس قلعے میں تھے جس میں عورتیں یعنی نبی صلی اللہ علیہ وسلم کی ازواج تھیں اس کے بعد ابن مسہر کی اسی سند کے ساتھ روایت کردہ حدیث کی طرح حدیث بیان کی اور حدیث ( کی سند ) میں عبد اللہ بن عروہ کا ذکر نہیں کیا لیکن ( ان کا بیان کیا ہوا سارا ) قصہ اس روایت میں شامل کردیا جو ہشام نے اپنے والد سے اور انھوں نے ( عبد اللہ ) ابن زبیر رضی اللہ تعالیٰ عنہ سے روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6247,
			"arabicnumber": "2417.01",
			"text": "عبد العزیزبن محمد نے سہیل ( بن ابی صالح ) سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم حراء پہاڑ پر تھے ۔ آپ صلی اللہ علیہ وسلم خود حضرت ابو بکر رضی اللہ تعالیٰ عنہ ، حضرت عمر رضی اللہ تعالیٰ عنہ ، حضرت عثمان رضی اللہ تعالیٰ عنہ ، حضرت علی رضی اللہ تعالیٰ عنہ ، حضرت طلحہ رضی اللہ تعالیٰ عنہ اور حضرت زبیر رضی اللہ تعالیٰ عنہ تو چٹان ( جس پر یہ سب تھے ) ہلنے لگی ، رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ٹھہرجاؤ ، تجھ پر نبی یا صدیق یا شہید کے علاوہ اور کو ئی نہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6248,
			"arabicnumber": "2417.02",
			"text": "یحییٰ بن سعید نے سہیل بن ابی صالح سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم کوہ حراء پر تھے ۔ وہ ہلنے لگا تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ٹھہرجا ، تجھ پر نبی یا صدیق یا شہید کے سوااور کو ئی نہیں ۔ \" اس پر نبی صلی اللہ علیہ وسلم تھے اور ( آپ کے ساتھ ) حضرت ابو بکر رضی اللہ تعالیٰ عنہ ، حضرت عمر رضی اللہ تعالیٰ عنہ ، حضرت عثمان رضی اللہ تعالیٰ عنہ حضرت علی رضی اللہ تعالیٰ عنہ ، حضرت طلحہ رضی اللہ تعالیٰ عنہ اور حضرت زبیر رضی اللہ تعالیٰ عنہ اور سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6249,
			"arabicnumber": "2418.01",
			"text": "(ابن نمیر اور عبدہ نے کہا : ہمیں ہشام نے اپنے والد عروہ ) سے حدیث بیان کی کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے مجھ سے فر ما یا : اللہ کی قسم! تمھا رے دو والد ( والد زبیراور نانا ابو بکر رضی اللہ تعالیٰ عنہ ) ان لوگوں میں سے تھے جنھوں نے ( اُحد میں ) زخم کھا لینے کے بعد ( بھی ) اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کے بلا وے پر لبیک کہا تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6250,
			"arabicnumber": "2418.02",
			"text": "ابو اسامہ نے کہا : ہمیں ہشام نے اسی سند کے ساتھ حدیث بیان کی اور یہ اضافہ کیا کہ وہ ابو بکر رضی اللہ تعالیٰ عنہ اور زبیر رضی اللہ تعالیٰ عنہ مراد لے رہی تھیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6251,
			"arabicnumber": "2418.03",
			"text": "بہی نے عروہ سے روایت کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے مجھ سے فرمایا : \" تمھا رے دونوں والد ان لوگوں میں سے تھے جنھوں نے زخم کھا نے کے بعد بھی اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کے بلا وے پر لبیک کہا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6252,
			"arabicnumber": "2419.01",
			"text": "حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہر امت کا ایک امین ہو تا ہے اور اے امت! ہمارے امین ابو عبیدہ ابن الجراح رضی اللہ تعالیٰ عنہ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6253,
			"arabicnumber": "2419.02",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ یمن کے لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے ، انھوں نے کہا : ہمارے ساتھ ایک شخص بھیجیے جو ہمیں سنت اور اسلام کی تعلیم دے ( حضرت انس رضی اللہ تعالیٰ عنہ نے ) کہا : تو آپ صلی اللہ علیہ وسلم نے حضرت ابو عبیدہ رضی اللہ تعالیٰ عنہ کا ہاتھ پکڑ کر فر ما یا : یہ اس امت کے امین ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6254,
			"arabicnumber": "2420.01",
			"text": "شعبہ نے کہا : میں نے ابو اسحٰق کو صلہ بن زفر سے حدیث بیان کرتے ہو ئے سنا ، انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کے پاس اہل نجران آئے اور کہنے لگے ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ہمارے پاس ایک امین شخص بھیجیے ۔ آپ نے فر ما یا : میں تمھا رے پاس ایسا شخص بھیجوں گا جو ایسا امین ہے جس طرح امین ہو نے کا حق ہے ۔ لو گوں نے اس بات پراپنی نگا ہیں اٹھا ئیں ( کہ اس کا مصداق کو ن ہے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے ابو عبیدہ بن جراح رضی اللہ تعالیٰ عنہ کو روانہ فرما یا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6255,
			"arabicnumber": "2420.02",
			"text": "سفیان نے ابو اسحٰق سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6256,
			"arabicnumber": "2421.01",
			"text": "احمد بن حنبل نے کہا : ہمیں سفیان بن عیینہ نے حدیث بیان کی ، کہا : مجھے عبیداللہ بن ابی یزید نے نافع بن جبیر سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم روایت کی کہ آ پ صلی اللہ علیہ وسلم نے حضرت حسن رضی اللہ تعالیٰ عنہ کے متعلق فرمایا : \" اے اللہ! میں اس سے محبت کرتاہوں ، تو ( بھی ) اس سے محبت فرما اور جو اس سے محبت کرے ، اس سے ( بھی ) محبت فرما ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6257,
			"arabicnumber": "2421.02",
			"text": "ابن ابی عمر نے کہا : ہمیں سفیان نے عبیداللہ بن ابی یزید سے ، انھوں نے نافع بن جبیر بن معطم سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ دن کو ایک وقت میں نکلا ، کہ نہ آپ صلی اللہ علیہ وسلم مجھ سے بات کرتے تھے اور نہ میں آپ صلی اللہ علیہ وسلم سے بات کرتا تھا ( یعنی خاموش چلے جاتے تھے ) یہاں تک کہ بنی قینقاع کے بازار میں پہنچے ۔ پھر آپ صلی اللہ علیہ وسلم لوٹے اور سیدہ فاطمۃالزہراء رضی اللہ عنہا کے گھر پر آئے اور پوچھا کہ بچہ ہے؟ بچہ ہے؟ یعنی سیدنا حسن رضی اللہ عنہ کا پوچھ رہے تھے ۔ ہم سمجھے کہ ان کی ماں نے ان کو روک رکھا ہے نہلانے دھلانے اور خوشبو کا ہار پہنانے کے لئے ، لیکن تھوڑی ہی دیر میں وہ دوڑتے ہوئے آئے اور دونوں ایک دوسرے سے گلے ملے ( یعنی رسول اللہ صلی اللہ علیہ وسلم اور سیدنا حسن رضی اللہ عنہ ) پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! میں اس سے محبت کرتا ہوں تو بھی اس سے محبت رکھ اور اس شخص سے محبت کر جو اس سے محبت کرے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6258,
			"arabicnumber": "2422.01",
			"text": "عبیداللہ کے والد معاذ نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے کہا : ہمیں حضرت براء بن عازب رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، کہا : میں نے حضرت حسن بن علی رضی اللہ تعالیٰ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے کندھے پر دیکھا ، اور آپ فرمارہے تھے : \" اے اللہ! میں اس سے محبت کرتا ہوں تو بھی اس سے محبت فرما ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6259,
			"arabicnumber": "2422.02",
			"text": "۔ ( محمد بن جعفر ) غندر نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے حضرت براء رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ نے حضرت حسن بن علی رضی اللہ تعالیٰ عنہ کو اپنے کندھے پر بٹھا رکھا تھا اور فرمارہے تھے : \" اے اللہ! میں اس سے محبت کرتا ہوں ، تو بھی اس سے محبت فرما ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6260,
			"arabicnumber": "2423",
			"text": "ہمیں ایاس نے اپنے والد سے حدیث سنائی ، کہا : میں نبی کریم صلی اللہ علیہ وسلم اور حضرت حسن اور حسین رضوان للہ عنھم اجمعین کو آپ کے سفید خچر پر بٹھا کر اس کی باگ پکڑ کر چلا ، یہاں تک کہ انھیں نبی کریم صلی اللہ علیہ وسلم کے گھر میں لے گیا ۔ یہ ( ایک بچہ ) آپ کے آگے بیٹھ گیا اور وہ ( دوسرا بچہ ) آپ کے پیچھے بیٹھ گیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6261,
			"arabicnumber": "2424",
			"text": "۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم صبح کو نکلے اور آپ صلی اللہ علیہ وسلم ایک چادر اوڑھے ہوئے تھے جس پر کجاووں کی صورتیں یا ہانڈیوں کی صورتیں بنی ہوئی تھیں ۔ اتنے میں سیدنا حسن رضی اللہ عنہ آئے تو آپ صلی اللہ علیہ وسلم نے ان کو اس چادر کے اندر کر لیا ۔ پھر سیدنا حسین رضی اللہ عنہ آئے تو ان کو بھی اس میں داخل کر لیا ۔ پھر سیدہ فاطمۃالزہراء رضی اللہ عنہا آئیں تو ان کو بھی انہی کے ساتھ شامل کر لیا پھر سیدنا علی رضی اللہ عنہ آئے تو ان کو بھی شامل کر کے فرمایا کہ ”اللہ تعالیٰ چاہتا ہے کہ تم سے ناپاکی کو دور کرے اور تم کو پاک کرے اے گھر والو ۔ ( الاحزاب : 33 ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6262,
			"arabicnumber": "2425.01",
			"text": "قتیبہ بن سعید نے ہمیں حدیث بیان کی ، کہا : ہمیں یعقوب بن عبدالرحمان القاری نے موسیٰ بن عقبہ سے حدیث بیان کی ، انھوں نے سالم بن عبداللہ ( بن عمر ) سے ، انھوں نے اپنے والد سے روایت کی کہ وہ کہا کرتے تھے : ہم زید بن حارثہ رضی اللہ تعالیٰ عنہ کو زید بن محمد صلی اللہ علیہ وسلم کے سوا اورکسی نام سے نہیں پکارتے تھے ، یہاں تک کہ قرآن میں یہ آیت نازل ہوئی؛ \"\" ان ( متنبیٰ ) کو ان کے اپنے باپوں کی نسبت سے پکارو ، اللہ کے نزدیک یہی زیادہ انصاف کی بات ہے ۔ \"\" ( اس کتاب کے ایک راوی ) شیخ ابو احمد محمد بن عیسیٰ ( نیشار پوری ) نے کہا : ہمیں ابو عباس سراج اور محمد بن عبداللہ بن یوسف دویری نے بیان کیا ، کہا : ہمیں بھی ( امام مسلم رحمۃ اللہ علیہ کے استاد ) قتیبہ بن سعید نے یہ حدیث بیان کی ( یعنی اس کتاب کے راوی نے یہ حدیث امام مسلم کے علاوہ قتیبہ سے ان کے دو اور شاگردوں کے حوالے سے بھی سنی ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6263,
			"arabicnumber": "2425.02",
			"text": "وہیب نے کہا : موسیٰ بن عقبہ نےہمیں حدیث بیان کی ، کہا : مجھے سالم نے عبداللہ رضی اللہ تعالیٰ عنہ سے اسی سند کے مانند حدیث بیان کی ، ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6264,
			"arabicnumber": "2426.01",
			"text": "عبداللہ بن دینار سے روایت ہے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے ایک لشکر بھیجا اور اُسامہ بن زید کو اس کا امیر مقرر فرمایا ۔ کچھ لوگوں نے ان کی امارت پر اعتراض کیا تو رسول اللہ صلی اللہ علیہ وسلم ( خطبہ دینے کے لئے ) کھڑے ہوئے اور فرمایا : \" تم نےاگر اس ( اسامہ رضی اللہ تعالیٰ عنہ ) کی امارت پر اعتراض کیا ہےتواس سے پہلے اس کے والد کی امارت پر بھی اعتراض کرتے تھے ۔ اللہ کی قسم! وہ بھی امارت کا اہل تھا اور بلاشبہ میرے محبوب ترین لوگوں میں سے تھا اور ا س کے بعد بلاشبہ یہ ( بھی ) میرے محبوب ترین لوگوں میں سے ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6265,
			"arabicnumber": "2426.02",
			"text": "سالم نے اپنے والد ( حضرت ابن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اور ( اس وقت ) آپ منبر پر تھے : \" اگر تم اسکی امارت پر اعتراض کررہے ہو آپ کی مراد حضرت اُسامہ بن زید سے تھی ۔ تو اس سے پہلے تم اس کے باپ کی امارت پر ( بھی ) اعتراض کرچکے ہو ۔ اللہ کی قسم!اس کے بعد یہ بھی مجھے سب لوگوں سے زیادہ محبوب ہے ۔ میں تمھیں اس کے ساتھ ہر طرح کی اچھائی کی وصیت کرتا ہوں کیونکہ یہ تمھارے نیک ترین لوگوں میں سے ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6266,
			"arabicnumber": "2427.01",
			"text": "اسماعیل بن علیہ نے حبیب بن شہید سے ، انھوں نے عبداللہ بن ابی ملیکہ سے روایت کی ، کہا : حضرت عبداللہ بن جعفر رضی اللہ تعالیٰ عنہ نے حضرت ابن زبیر رضی اللہ تعالیٰ عنہ سے کہا : تمھیں یاد ہے جب ہم ، میں ، تم اور ابن عباس رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کو ملے تھے؟انھوں نے کہا : ہاں ، ( کہا : ) تو آپ نے ہمیں سوار کرلیا تھا اور ( جگہ نہ ہونے کی بناء پر ) تمھیں چھوڑ دیاتھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6267,
			"arabicnumber": "2427.02",
			"text": "ابو اسامہ نے حبیب بن شہید سے ابن علیہ کی حدیث کے مانند اور اسی کی سند سے حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6268,
			"arabicnumber": "2428.01",
			"text": "ابو معاویہ نے عاصم احول سے ، انھوں نے مورق عجلی سے ، انھوں نے حضرت عبداللہ بن جعفررضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم جب کسی سفر سے آتے تو آپ کے گھر کے بچوں کو ( باہر لے جاکر ) آپ سے ملایا جاتا ، ایک بار آپ سفر سے آئے ، مجھے سب سے پہلے آپ کے پاس پہنچا دیاگیا تو آپ صلی اللہ علیہ وسلم نے مجھے اپنے سامنے بٹھا دیا ، پھر حضرت فاطمہ رضی اللہ تعالیٰ عنہا کے ایک صاحبزادے کو لایا گیا تو انھیں آ پ صلی اللہ علیہ وسلم نے پیچھے بٹھا لیا ۔ کہا : تو ہم تینوں کو ایک سواری پر مدینہ کے اندر لایا گیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6269,
			"arabicnumber": "2428.02",
			"text": "عبدالرحیم بن سلیمان نے عاصم سے روایت کی ، کہا : مجھے مورق عجلی نے حدیث بیان کی ، کہا : مجھے حضرت عبداللہ بن جعفر رضی اللہ تعالیٰ عنہ نے حدیث سنائی ، کہا : نبی کریم صلی اللہ علیہ وسلم جب سفر سے آتے تو ہمیں ( آپ کی محبت میں ) آگے لے جاکر آپ سے ملایا جاتا ، کہا : مجھے اور حسن یا حسین رضوان اللہ عنھم اجمعین کو آپ کے پاس آگے لے جایا گیا تو آپ صلی اللہ علیہ وسلم نے ہم میں سے ایک کو ا پنے آگے اور ایک کو اپنے پیچھے سوار کرلیا ، یہاں تک کہ ہم ( اسی طرح ) مدینہ میں داخل ہوئے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6270,
			"arabicnumber": "2429",
			"text": "حضرت حسن بن علی رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام حسن بن سعد نے حضرت عبداللہ بن جعفر رضی اللہ تعالیٰ عنہ سے ر وایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ایک دن مجھے سواری پر اپنے پیچھے بٹھایا ، پھر مجھے راز داری سے ایک بات بتائی جو میں لوگوں میں سے کسی بھی شخص کو نہیں سناؤں گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6271,
			"arabicnumber": "2430",
			"text": "ابوبکر بن ابی شیبہ اور ابوکریب نے ابو اسامہ ، ابن نمیر ، وکیع اور ابو معاویہ سے حدیث بیان کی ۔ اسحاق بن ابراہیم نے کہا : ہمیں عبدہ بن سلیمان نے خبر دی ۔ ان سب نے ہشام بن عروہ سے روایت کی ۔ الفاظ حدیث ابو اسامہ کے ہیں ۔ ہشام نے اپنے والد سے روایت کی ، انھوں نےکہا : میں نے عبداللہ بن جعفر رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا ، میں نے کوفہ میں حضرت علی رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" ( اپنے دور کی ) تمام عورتوں میں سے بہترین مریم بنت عمران علیہ السلام ہیں اور ( اس دور کی ) تمام عورتوں میں سے بہترین حضرت خدیجہ رضی اللہ تعالیٰ عنہا بنت خویلد رضی اللہ تعالیٰ عنہا ہیں ۔ \"\" ابو کریب نے کہا : وکیع نے آسمان وزمین کی طرف اشارہ کرکے بتایا ( کہ ان دونوں کے درمیان بہترین خواتین یہ ہیں ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6272,
			"arabicnumber": "2431",
			"text": "حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" مردوں میں بہت سے لوگ کامل ہوئے ہیں اور ( لیکن ) عورتوں میں سے مریم بنت عمران اور فرعون کی بیوی آسیہ کے سوا کوئی کامل نہیں ہوئی اور عائشہ رضی اللہ تعالیٰ عنہا کی فضیلت عورتوں پر اسی طرح ہے جس طرح ثرید کی باقی کھانوں پر ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6273,
			"arabicnumber": "2432",
			"text": "ابو بکر بن ابی شیبہ ، ابو کریب اور ابن نمیر نے کہا : ہمیں ابن فضیل نے عمارہ سے حدیث بیان کی ، انھوں نے ابو زرعہ سے ، انھوں نےکہا : میں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا : حضرت جبرائیل علیہ السلام نبی اکرم صلی اللہ علیہ وسلم کے پاس آئے اور کہا : اللہ کے رسول صلی اللہ علیہ وسلم !یہ خدیجہ ہیں ، آپ کے پاس آئی ہیں ، ان کے پاس ایک برتن ہے جس میں سالن ہے یا کھانا ہے یا مشروب ہے ، چنانچہ جب یہ آپ کے پاس آجائیں تو انھیں ان کے رب عزوجل کی طرف سے اور میری طرف سے سلام کہیں اور انھیں جنت میں ایک گھر کی خوش خبری دیں جو ( موتیوں کی ) لمبی چھڑیوں کا بنا ہواہے ، نہ اس میں کوئی شور ہے اور نہ تھکاوٹ کا گزر ہے ۔ ابو بکر بن ابی شیبہ نے اپنی روایت میں کہا : \"\" حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سےروایت ہے ۔ \"\" انھوں نے \"\" میں نے سنا \"\" ( کا لفظ ) نہیں کہا اور نہ ہی حدیث میں \"\" اورمیری طرف سے \"\" ( کالفظ ) کہا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6274,
			"arabicnumber": "2433.01",
			"text": "عبداللہ بن نمیر اور محمد بن بشر عبدی نے اسماعیل سے روایت کی ، کہا : میں نے حضرت عبداللہ بن ابی اوفیٰ رضی اللہ تعالیٰ عنہ سے پوچھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ تعالیٰ عنہا کو جنت میں ایک گھر کی بشارت دی تھی؟انھوں نے کہا : ہاں ، آپ صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ تعالیٰ عنہا کو ایسے گھر کی بشارت دی تھی جو ( موتیوں کی ) شاخوں سے بنا ہے ، اس میں نہ شور وشغب ہوگا اور نہ تکان ہوگی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6275,
			"arabicnumber": "2433.02",
			"text": "ابو معاویہ ، وکیع ، معتمر بن سلیمان ، جریر اور سفیان سب نے اسماعیل بن ابی خالد سے ، انھوں نے ابن ابی اوفیٰ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کی مثل روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6276,
			"arabicnumber": "2434",
			"text": "عبدہ نے ہشام بن عروہ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ تعالیٰ عنہا بنت خویلد رضی اللہ تعالیٰ عنہا کو جنت میں ایک گھر کی بشارت دی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6277,
			"arabicnumber": "2435.01",
			"text": "ابواسامہ نے ہمیں حدیث بیان کی ، کہا : ہمیں ہشام نے اپنے والد سے حدیث بیا ن کی ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : مجھے کبھی کسی خاتون پر ایسا رشک نہیں آتا تھا جیسا حضرت خدیجہ رضی اللہ تعالیٰ عنہا پر آتاتھا ، حالانکہ مجھ سے نکاح کرنے سے تین سال قبل وہ فوت ہوچکی تھیں ، کیونکہ میں اکثر آپ صلی اللہ علیہ وسلم سے ان کا ذکر سنتی تھی ، آپ کے ر ب عزوجل نے آپ کو یہ حکم دیا تھا کہ آپ ان کو جنت میں ( موتیوں کی ) شاخون سے بنے ہوئے گھر کی بشارت دیں ۔ اور بے شک آپ بکری ذبح کرتے ، پھر اس ( کے پارچوں ) کو ان کی سہیلیوں کی طرف بھیج دیتے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6278,
			"arabicnumber": "2435.02",
			"text": "حفص بن غیاث نے ہشام بن عروہ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کی ازواج میں سے مجھے کسی پر رشک نہیں آتاتھا ، سوائے حضرت خدیجۃ رضی اللہ تعالیٰ عنہا کے ، حالانکہ میں نے ان کا زمانہ نہیں دیکھا تھا ۔ کہا : اور رسول اللہ صلی اللہ علیہ وسلم جب بکری ذبح کرتے تو فرماتے : \"\" اس کو خدیجہ کی سہیلیوں کی طرف بھیجو ۔ \"\" کہا : میں نے ایک دن آپ کو غصہ دلادیا ۔ میں نے کہا : خدیجہ؟ ( آپ انھی کا نام لیتے رہتے ہیں ) تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" مجھے ان کی محبت عطا کی گئی ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6279,
			"arabicnumber": "2435.03",
			"text": "ابو معاویہ نے کہا : ہمیں ہشام نے اسی سند کے ساتھ بکری ( ذبح کرنے ) کے قصے تک ابو اسامہ کی حدیث کی طرح حدیث بیا ن کی ۔ اس کے بعد کے زائد الفاظ بیان نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6280,
			"arabicnumber": "2435.04",
			"text": "زہری نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : مجھے رسول اللہ صلی اللہ علیہ وسلم کے لئے ، آپ کی کسی بیوی پر ایسا رشک نہیں ہوا جیسا حضرت خدیجہ رضی اللہ تعالیٰ عنہا پر ہوا ۔ اس کا سبب یہ تھا کہ آپ ان کو بہت کثرت سے یاد کرتے تھے ، حالانکہ میں نے انھیں کبھی دیکھا تک نہ تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6281,
			"arabicnumber": "2436",
			"text": "عروہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے حضرت خدیجہ رضی اللہ تعالیٰ عنہا کی وفات تک اور شادی نہیں کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 6282,
			"arabicnumber": "2437",
			"text": "علی بن مسہر نے ہشام سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : کہ خدیحہ رضی اللہ عنہا کی بہن ہالہ بنت خویلد نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آنے کی اجازت مانگی ، تو آپ صلی اللہ علیہ وسلم کو خدیجہ رضی اللہ عنہا کا اجازت مانگنا یاد آ گیا ۔ آپ صلی اللہ علیہ وسلم خوش ہوئے اور فرمایا کہ یا اللہ! ہالہ بنت خویلد ۔ مجھے رشک آیا تو میں نے کہا کہ آپ صلی اللہ علیہ وسلم کیا قریش کی بوڑھیوں میں سے سرخ مسوڑھوں والی ایک بڑھیا کو یاد کرتے ہیں ( یعنی انتہا کی بڑھیا جس کے ایک دانت بھی نہ رہا ہو نری سرخی ہی سرخی ہو ، دانت کی سفیدی بالکل نہ ہو ) جو مدت گزری فوت ہو چکی اور اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو اس سے بہتر عورت دی ( جوان باکرہ جیسے میں ہوں ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6283,
			"arabicnumber": "2438.01",
			"text": "حماد نے کہا : ہمیں ہشام نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" تم مجھے تین راتوں تک خواب میں دکھائی دیتی رہی ہو ، ایک فرشتہ ریشم کے ایک ٹکڑے پر تمھیں ( تمھاری تصویر کو ) لے کر میرے پاس آیا ۔ وہ کہتا : یہ تمھاری بیوی ہے ، میں تمھارے چہرے سے کپڑا ہٹاتا تو وہ تم ہوتیں ، میں کہتا : یہ ( پیشکش ) اگر اللہ کی طرف سے ہے تو وہ اسے پورا کردے گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6284,
			"arabicnumber": "2438.02",
			"text": "ابن ادریس اور ابو اسامہ نے ہشام سے ، اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6285,
			"arabicnumber": "2439.01",
			"text": "ابو اسامہ نے ہشام سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : کہ مجھ سے رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ میں جان لیتا ہوں جب تو مجھ سے خوش ہوتی ہے اور جب ناخوش ہوتی ہے ۔ میں نے عرض کیا کہ آپ صلی اللہ علیہ وسلم کیسے جان لیتے ہیں؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تو خوش ہوتی ہے تو کہتی ہے کہ نہیں محمد ( صلی اللہ علیہ وسلم ) کے رب کی قسم ، اور جب ناراض ہوتی ہے تو کہتی ہے کہ نہیں قسم ہے ابراہیم ( علیہ السلام ) کے رب کی ۔ میں نے عرض کیا کہ بیشک اللہ کی قسم یا رسول اللہ صلی اللہ علیہ وسلم ! میں آپ صلی اللہ علیہ وسلم کے نام کے سوا اور کسی بات کو ترک ن ہیں کرتی ( محبت ، اطاعت ، توجہ ہر لمحہ آپ ہی کی طرف رہتی ہے)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6286,
			"arabicnumber": "2439.02",
			"text": "عبدہ نے ہشام بن عروہ سے اسی سند کے ساتھ آپ صلی اللہ علیہ وسلم کے فرمان؛ \" نہیں ، حضرت ابراہیم علیہ السلام کے رب کی قسم! \" تک روایت کی اور بعد کا حصہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6287,
			"arabicnumber": "2440.01",
			"text": "عبدالعزیز بن محمد نے ہشام بن عروہ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس گڑیوں سے کھیلتی تھیں ، کہا : اور میری سہیلیاں میرے پاس آتی تھیں ، وہ رسول اللہ صلی اللہ علیہ وسلم کی ( آمد کی ) وجہ سے ( گھر کے کسی کونے میں ) چھپ جاتی تھیں ، کہا : رسول اللہ صلی اللہ علیہ وسلم ان کو ( بلا کر ) میری طرف بھیج دیتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6288,
			"arabicnumber": "2440.02",
			"text": "ابو اسامہ ، جریر اور محمد بن بشر سب نے ہشام سے اسی سند کے ساتھ روایت کی ، اور جریر کی حدیث میں کہا : میں آپ صلی اللہ علیہ وسلم کے گھر میں گڑیوں کے ساتھ کھیلا کرتی تھی اور وہ ( ہمارے ) کھلونے ہوتی تھیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6289,
			"arabicnumber": "2441",
			"text": "عروہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ لوگ اپنے ہدیے بھیجنے کے لئے حضرت عائشہ رضی اللہ تعالیٰ عنہا ( کی باری ) کا دن ڈھونڈا کرتے تھے ، اس طرح وہ رسول اللہ صلی اللہ علیہ وسلم کو خوش کرناچاہتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6290,
			"arabicnumber": "2442.01",
			"text": "صالح نے ابن شہاب سے روایت کی ، کہا : مجھے محمد بن عبدالرحمان بن حارث بن ہشام نے بتایا کہ نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : کہ رسول اللہ صلی اللہ علیہ وسلم کی ازواج مطہرات رضی اللہ عنہن نے آپ صلی اللہ علیہ وسلم کی صاحبزادی سیدہ فاطمۃالزہراء رضی اللہ عنہا کو آپ صلی اللہ علیہ وسلم کے پاس بھیجا ۔ انہوں نے اجازت مانگی ، اور آپ صلی اللہ علیہ وسلم میرے ساتھ میری چادر میں لیٹے ہوئے تھے ۔ آپ صلی اللہ علیہ وسلم نے اجازت دی تو انہوں نے کہا کہ یا رسول اللہ! آپ صلی اللہ علیہ وسلم کی ازواج مطہرات نے مجھے آپ صلی اللہ علیہ وسلم کے پاس بھیجا ہے ، وہ چاہتی ہیں کہ آپ صلی اللہ علیہ وسلم ان کے ساتھ ابوقحافہ کی بیٹی میں انصاف کریں ( یعنی جتنی محبت ان سے رکھتے ہیں اتنی ہی اوروں سے رکھیں ۔ اور یہ امر اختیاری نہ تھا اور سب باتوں میں تو آپ صلی اللہ علیہ وسلم انصاف کرتے تھے ) اور میں خاموش تھی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے بیٹی! کیا تو وہ نہیں چاہتی جو میں چاہوں؟ وہ بولیں کہ یا رسول اللہ! میں تو وہی چاہتی ہوں جو آپ صلی اللہ علیہ وسلم چاہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو عائشہ سے محبت رکھ ۔ یہ سنتے ہی فاطمہ اٹھیں اور ازواج مطہرات کے پاس گئیں اور ان سے جا کر اپنا کہنا اور رسول اللہ صلی اللہ علیہ وسلم کا فرمانا بیان کیا ۔ وہ کہنے لگیں کہ ہم سمجھتیں ہیں کہ تم ہمارے کچھ کام نہ آئیں ، اس لئے پھر رسول اللہ صلی اللہ علیہ وسلم کے پاس جاؤ اور کہو کہ آپ صلی اللہ علیہ وسلم کی ازواج ابوقحافہ کی بیٹی کے مقدمہ میں انصاف چاہتی ہیں ( ابوقحافہ سیدنا ابوبکر رضی اللہ عنہ کے والد تھے تو عائشہ رضی اللہ عنہا کے دادا ہوئے اور دادا کی طرف نسبت دے سکتے ہیں ) ۔ سیدہ فاطمۃالزہراء رضی اللہ عنہا نے کہا کہ اللہ کی قسم! میں تو اب عائشہ رضی اللہ عنہا کے مقدمہ میں کبھی رسول اللہ صلی اللہ علیہ وسلم سے گفتگو نہ کروں گی ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ آخر آپ صلی اللہ علیہ وسلم کی ازواج نے ام المؤمنین زینب بنت جحش رضی اللہ عنہا کو آپ صلی اللہ علیہ وسلم کے پاس بھیجا اور میرے برابر کے مرتبہ میں آپ صلی اللہ علیہ وسلم کے سامنے وہی تھیں اور میں نے کوئی عورت ان سے زیادہ دیندار ، اللہ سے ڈرنے والی ، سچی بات کہنے والی ، ناطہٰ جوڑنے والی اور خیرات کرنے والی نہیں دیکھی اور نہ ان سے بڑھ کر کوئی عورت اللہ تعالیٰ کے کام میں اور صدقہ میں اپنے نفس پر زور ڈالتی تھی ، فقط ان میں ایک تیزی تھی ( یعنی غصہ تھا ) اس سے بھی وہ جلدی پھر جاتیں اور مل جاتیں اور نادم ہو جاتی تھیں ۔ انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے اجازت چاہی تو آپ صلی اللہ علیہ وسلم نے اسی حال میں اجازت دی کہ آپ صلی اللہ علیہ وسلم میری چادر میں تھے ، جس حال میں سیدہ فاطمۃالزہراء رضی اللہ عنہا آئی تھیں ۔ انہوں نے کہا کہ یا رسول اللہ! آپ صلی اللہ علیہ وسلم کی ازواج ابوقحافہ کی بیٹی کے مقدمہ میں انصاف چاہتی ہیں ۔ پھر یہ کہہ کر مجھ پر آئیں اور زبان درازی کی اور میں رسول اللہ صلی اللہ علیہ وسلم کی نگاہ کو دیکھ رہی تھی کہ آپ صلی اللہ علیہ وسلم مجھے جواب دینے کی اجازت دیتے ہیں یا نہیں ، یہاں تک کہ مجھے معلوم ہو گیا کہ آپ صلی اللہ علیہ وسلم جواب دینے سے برا نہیں مانیں گے ، تب تو میں بھی ان پر آئی اور تھوڑی ہی دیر میں ان کو لاجواب کر دیا یا ان پر غالب آ گئی ۔ رسول اللہ صلی اللہ علیہ وسلم مسکرائے اور فرمایا کہ یہ ابوبکر رضی اللہ عنہ کی بیٹی ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6291,
			"arabicnumber": "2442.02",
			"text": "یونس نے زہری سے اسی سند کے ساتھ ، معنی میں بالکل اسی کے مانند روایت کی ، مگر انھوں نے یوں کہا : جب میں نے ان کے بارے میں بات کی تو انھیں مہلت تک نہ دی کہ میں نے غالب آکر ان کو بے بس کردیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6292,
			"arabicnumber": "2443",
			"text": "عروہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم ( بیماری کے دوران میں ) دریافت کرتے فرماتے تھے : \" آج میں کہاں ہوں؟کل میں کہاں ہوں گا؟ \" آپ صلی اللہ علیہ وسلم کو لگتا تھا کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا کی باری کا دن آہی نہیں رہا ۔ انھوں نےکہا : جب میری باری کا دن آیاتو اللہ نے آپ کو اس طرح اپنے پاس بلایا کہ آپ میرے سینے اور حلق کے درمیان ( سر رکھے ہوئے ) تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6293,
			"arabicnumber": "2444.01",
			"text": "مالک بن انس نے ہشام بن عروہ سے ، انھوں نے عباد بن عبداللہ بن زبیر سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ کوبتایا کہ انھوں نے سنا ، رسول اللہ صلی اللہ علیہ وسلم وفات سے پہلے فرمارہے تھے اور آپ ان کے سینے سے ٹیک لگائے ہوئے تھے اور انھوں نے کان لگا کر آپ صلی اللہ علیہ وسلم کی بات سنی ، آپ فرمارہے تھے : \" اللہ!مجھے بخش دے ، مجھ پر رحم فرما اور مجھے رفیق ( اعلیٰ ) کے ساتھ ملادے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6294,
			"arabicnumber": "2444.02",
			"text": "ابواسامہ ، عبداللہ بن نمیر اورعبدہ بن سلیمان ، سب نے ہشام سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6295,
			"arabicnumber": "2444.03",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے سعد بن ابرا ہیم سے حدیث بیان کی ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، فر ما یا : میں سناکرتی تھی ۔ کہ کو ئی نبی فوت نہیں ہو تا یہاں تک کہ اس کو دنیا آخرت کے درمیان اختیار دیا جا تا ہے کہا : تو میں نے نبی صلی اللہ علیہ وسلم کو مرض الموت میں یہ فر ما تے ہو ئے سنا ۔ اس وقت آپ کی آواز بھا ری ہو گئی تھی آپ فر ما رہے تھے : \" ان لوگوں کے ساتھ جن پر اللہ تعا لیٰ نے انعام فر ما یا : \" یعنی انبیاء ، صدیقین شہداء اور صالحین ( کے ساتھ ) اور یہی بہترین رفیق ہیں ۔ \" کہا : تو میں نے سمجھ لیا کہ اس وقت آپ کو اختیا ردے دیا گیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6296,
			"arabicnumber": "2444.04",
			"text": "وکیع اور معاذ نے کہا : ہمیں شعبہ نےسعد ( بنابرا ہیم ) سے اسی سند کے ساتھ اسکے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6297,
			"arabicnumber": "2444.05",
			"text": "ابن شہاب نے کہا : مجھے سعید بن مسیب اور عروہ بن زبیر نے بہت سے اہل علم لوگوں کی مو جو دگی میں خبردی کہ نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : رسول اللہ صلی اللہ علیہ وسلم اپنی تندرستی کے زمانے میں فرما یا کرتے تھے ۔ \"\" کسی نبی کی روح اس وقت تک قبض نہیں کی جا تی ۔ یہاں تک کہ اسے جنت میں اپنا مقام دکھا دیا جا تا ہے ، پھر اس کو اختیا ر دیا جا تا ہے ۔ \"\" حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم کی رحلت کا وقت آیا اور اس وقت آپ کاسر میرے زانو پر تھا ۔ آپ کچھ دیر غشی طاری رہی پھر آپ کو افاقہ ہوا تو آپ نے چھت کی طرف نگا ہیں اٹھا ئیں ، پھر فر ما یا : \"\" اے اللہ !رفیق اعلیٰ! \"\" حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے ( دل میں ) ) کہا : اب آپ ہمیں نہیں چنیں گے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فر ما یا : اور میں نے وہ حدیث پہچان لی جو آپ ہم سے بیان فر ما یا کرتے تھے ۔ وہ آپ کےاپنے الفاظ میں بالکل صحیح تھی : کسی نبی کو اس وقت تک کبھی موت نہیں آئی یہاں تک کہ اسے جنت میں اس کا ٹھکا نا دکھایا جا تا ہے اور اسے ( موت کو قبول کرنے یا مؤخرکرانے کا ) اختیار دیا جا تا ہے ۔ \"\" حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : آپ صلی اللہ علیہ وسلم کا یہ فر ما ن : \"\" اے اللہ !رفیق اعلیٰ ! \"\" وہ آخری بات تھی جو آپ نے کہی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 6298,
			"arabicnumber": "2445",
			"text": "قاسم بن محمد نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : جب رسول اللہ صلی اللہ علیہ وسلم باہر تشریف لے جا تے تو اپنی ازواج کے درمیان قرعہ اندازی کرتے ، ایک مرتبہ حضرت عائشہ اور حضرت حفصہ رضی اللہ تعالیٰ عنہا کےنام قرعہ نکلا ، وہ دونوں آپ کے ساتھ سفر پر نکلیں ، جب را ت کا وقت ہو تا تو رسول اللہ صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ تعالیٰ عنہا کے ساتھ سفر کرتے اور ان کے ساتھ باتیں کرتے تو حضرت حفصہ رضی اللہ تعالیٰ عنہا نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے کہا : آج رات تم میرے اونٹ پر کیوں نہیں سوار ہو جا تیں ۔ اور میں تمھا رے اونٹ پر سوار ہو جا تی ہوں ، پھر تم بھی دیکھو اور میں بھی دیکھتی ہوں ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : کیوں نہیں !پھر حضرت عائشہ رضی اللہ تعالیٰ عنہا حضرت حفصہ رضی اللہ تعالیٰ عنہا کے اونٹ پر سوار ہو گئیں اور حضرت حفصہ رضی اللہ تعالیٰ عنہا حضرت عائشہ رضی اللہ تعالیٰ عنہا کے اونٹ پر سوار ہو گئیں ۔ رسول اللہ صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ تعالیٰ عنہا کے اونٹ کے پاس آئے تو اس پر حضرت حفصہ رضی اللہ تعالیٰ عنہا ( سوار ) تھیں آپ صلی اللہ علیہ وسلم نے سلام کیا اور ان کے ساتھ چلتے رہے حتی کہ منزل پر اتر گئے ، حضرت عائشہ رضی اللہ تعالیٰ عنہا نے آپ صلی اللہ علیہ وسلم کو اپنے پاس نہیں پا یا تو انھیں سخت رشک آیا ، جب سب لوگ اترے تو حضرت عائشہ رضی اللہ تعالیٰ عنہا اپنے پاؤں اذخر ( کی گھاس ) میں مار مارکر کہنے لگیں : یارب! مجھ پر کو ئی بچھو یا سانپ مسلط کردے جو مجھے ڈس لے وہ تیرے رسول ہیں اور میں انھیں کچھ کہہ بھی نہیں سکتی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 6299,
			"arabicnumber": "2446.01",
			"text": "سلیمان بن بلال نے عبد اللہ بن عبد الرحمٰن سے ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فر ما تے ہو ئے سنا ، \" عورتوں پر عائشہ کی فضیلت ایسی ہے جیسی کھا نوں پر ثرید کی فضیلت ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 6300,
			"arabicnumber": "2446.02",
			"text": "اسماعیل بن جعفر اور عبد العزیز بن محمد دونوں نے عبد اللہ بن عبدالرحمٰن سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند حدیث روایت کی ۔ ان دونوں کی حدیث ( کی سند ) میں یہ الفاظ نہیں \" میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا \" اور اسماعیل کی حدیث میں یہ الفا ظ ہیں : \" انھوں نے انس بن مالک سے سنا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 6301,
			"arabicnumber": "2447.01",
			"text": "عبد الرحیم بن سلیمان اور یعلیٰ بن عبید نے زکریا سے حدیث بیان کی ، انھوں نےس ( عامر ) شعبی سے ، انھوں نے ابو سلمہ سے انھوں نےحضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے ان ( ابو سلمہ ) کو بتا یا کہ نبی صلی اللہ علیہ وسلم نے ان سے فر مایا : \" جبرا ئیل تم کو سلام کہتے ہیں ۔ \" کہا : تو میں نے ( جواب میں ) کہا : وعليه السلام ورحمة الله \" اور ان پر بھی سلامتی ہو اور اللہ کی رحمت ہو",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 6302,
			"arabicnumber": "2447.02",
			"text": "۔ ( ابو بکر کو فی ) ملائی نے کہا : ہمیں زکریا بن ابی زائد ہ نے حدیث بیان کی ۔ انھوں نے کہا : میں عامر ( شعبی ) کو یہ کہتے ہو ئے سنا : مجھے ابو سلمہ بن عبد الرحمٰن نے حدیث بیان کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے انھیں حدیث سنائی کہ رسول اللہ صلی اللہ علیہ وسلم نے ان سے فر ما یا ، ان دونوں کی حدیث کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 6303,
			"arabicnumber": "2447.03",
			"text": "اسباط بن محمد نے زکریا سے اسی سند کے ساتھ اسی کے مانند خبر دی",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 6304,
			"arabicnumber": "2447.04",
			"text": "زہری نے کہا : مجھے ابو سلمہ بن عبد الرحمٰن نے حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اے عائش رضی اللہ تعالیٰ عنہا !یہ جبرا ئیل علیہ السلام ہیں تمھیں سلام کہہ رہے ہیں ۔ \" میں نے کہا : ( وعليه السلام ورحمة الله ) ( اور ان پر بھی سلامتی ہو اور اللہ کی رحمت ہو! ) ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : آپ وہ کچھ دیکھتے تھے جو میں نہیں دیکھتی تھی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 6305,
			"arabicnumber": "2448.01",
			"text": "عیسیٰ بن یونس نے کہا : ہمیں ہشام بن عروہ نے اپنے بھائی عبداللہ بن عروہ سے حدیث بیان کی ، انھوں نے عروہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : ہیں کہ گیارہ عورتیں بیٹھیں اور ان سب نے یہ اقرار اور عہد کیا کہ اپنے اپنے خاوندوں کی کوئی بات نہ چھپائیں گی ۔ پہلی عورت نے کہا کہ میرا خاوند گویا دبلے اونٹ کا گوشت ہے ، جو ایک دشوار گزار پہاڑ کی چوٹی پر رکھا ہو ۔ نہ تو وہاں تک صاف راستہ ہے کہ کوئی چڑھ جائے اور نہ وہ گوشت موٹا ہے کہ لایا جائے ۔ دوسری عورت نے کہا کہ میں اپنے خاوند کی خبر نہیں پھیلا سکتی میں ڈرتی ہوں کہ اگر بیان کروں تو پورا بیان نہ کر سکوں گی کیونکہ اس میں ظاہری و باطنی عیوب بہت زیادہ ہیں ۔ ( اور بعض نے یہ معنی کئے ہیں کہ میں ڈرتی ہوں کہ اگر بیان کروں گی تو اس کو چھوڑ دوں گی ۔ یعنی وہ خفا ہو کر مجھے طلاق دے گا اور اس کو چھوڑنا پڑے گا ) ۔ تیسری عورت نے کہا کہ میرا خاوند لمبا قد اور احمق ہے ، اگر میں اس کی برائی بیان کروں تو مجھے طلاق دیدے گا اور جو چپ رہوں تو اسی طرح معلق رہوں گی ( یعنی نہ نکاح کے مزے اٹھاؤں گی نہ بالکل محروم رہوں گی ) ۔ چوتھی نے کہا کہ میرا خاوند تو ایسا ہے جیسے تہامہ ( حجاز اور مکہ ) کی رات ۔ نہ گرم ہے نہ سرد ہے ( یعنی معتدل المزاج ہے ) نہ ڈر ہے نہ رنج ہے ( یہ اس کی تعریف کی یعنی اس کے اخلاق عمدہ ہیں اور نہ وہ میری صحبت سے ملول ہوتا ہے ) ۔ پانچویں عورت نے کہا کہ میرا خاوند جب گھر میں آتا ہے تو چیتا ہے ( یعنی پڑ کر سو جاتا ہے اور کسی کو نہیں ستاتا ) اور جب باہر نکلتا ہے تو شیر ہے ۔ اور جو مال اسباب گھر میں چھوڑ جاتا ہے اس کو نہیں پوچھتا ۔ چھٹی عورت نے کہا کہ میرا خاوند اگر کھاتا ہے تو سب ختم کر دیتا ہے اور پیتا ہے تو تلچھٹ تک نہیں چھوڑتا اور لیٹتا ہے تو بدن لپیٹ لیتا ہے اور مجھ پر اپنا ہاتھ نہیں ڈالتا کہ میرا دکھ درد پہچانے ( یہ بھی ہجو ہے یعنی سوا کھانے پینے کے بیل کی طرح اور کوئی کام کا نہیں ، عورت کی خبر تک نہیں لیتا ) ۔ ساتویں عورت نے کہا کہ میرا خاوند نامرد ہے یا شریر نہایت احمق ہے کہ کلام کرنا نہیں جانتا ، سب دنیا بھر کے عیب اس میں موجود ہیں ۔ ایسا ظالم ہے کہ تیرا سر پھوڑے یا ہاتھ توڑے یا سر اور ہاتھ دونوں مروڑے ۔ آٹھویں عورت نے کہا کہ میرا خاوند بو میں زرنب ہے ( زرنب ایک خوشبودار گھاس ہے ) اور چھونے میں نرم جیسے خرگوش ( یہ تعریف ہے یعنی اس کا ظاہر اور باطن دونوں اچھے ہیں ) ۔ نویں عورت نے کہا کہ میرا خاوند اونچے محل والا ، لمبے پرتلے والا ( یعنی قد آور ) اور بڑی راکھ والا ( یعنی سخی ہے ) اس کا باورچی خانہ ہمیشہ گرم رہتا ہے تو راکھ بہت نکلتی ہے اس کا گھر قوم کے مل بیٹھ کر مشورہ کرنے کی جگہ ( ڈیرہ وغیرہ ) ( یعنی سردار اور صاحب الرائے ہے ) ۔ دسویں عورت نے کہا کہ میرے خاوند کا نام مالک ہے ۔ اور مالک کیا خوب ہے ۔ مالک میری اس تعریف سے افضل ہے ۔ اس کے اونٹوں کے بہت سے شترخانے ہیں اور کم تر چراگاہیں ہیں ( یعنی ضیافت میں اس کے یہاں اونٹ بہت ذبح ہوا کرتے ہیں ، اس سبب سے شترخانوں سے جنگل میں کم چرنے جاتے ہیں ) جب اونٹ باجے کی آواز سنتے ہیں تو اپنے ذبح ہونے کا یقین کر لیتے ہیں ( ضیافت میں راگ اور باجے کا معمول تھا ، اس سبب سے باجے کی آواز سن کر اونٹوں کو اپنے ذبح ہونے کا یقین ہو جاتا تھا ) ۔ گیارھویں عورت نے کہا کہ میرے خاوند کا نام ابوذرع ہے سو واہ کیا خوب ابوذرع ہے ۔ اس نے زیور سے میرے دونوں کان جھلائے اور چربی سے میرے دونوں بازو بھرے ( یعنی مجھے موٹا کیا اور مجھے بہت خوش کیا ) ، سو میری جان بہت چین میں رہی مجھے اس نے بھیڑ بکری والوں میں پایا جو پہاڑ کے کنارے رہتے تھے ، پس اس نے مجھے گھوڑے ، اونٹ ، کھیت اور ڈھیریوں / خرمن کا مالک کر دیا ( یعنی میں نہایت ذلیل اور محتاج تھی ، اس نے مجھے باعزت اور مالدار کر دیا ) ۔ میں اس کی بات کرتی ہوں تو وہ مجھے برا نہیں کہتا ۔ سوتی ہوں تو فجر کر دیتی ہوں ( یعنی کچھ کام نہیں کرنا پڑتا ) اور پیتی ہوں تو سیراب ہو جاتی ہوں ۔ اور ابوزرع کی ماں ، پس ابوزرع کی ماں بھی کیا خوب ہے ۔ اس کی بڑی بڑی گٹھڑیاں اور کشادہ گھر ہیں ۔ ابوزرع کا بیٹا ، پس ابوزرع کا بیٹا بھی کیا خوب ہے ۔ اس کی خواب گاہ جیسے تلوار کا میان ( یعنی نازنین بدن ہے ) ، اس کو ( بکری ) حلوان کا ہاتھ آسودہ ( سیر ) کر دیتا ہے ( یعنی کم خور ہے ) ۔ ابوزرع کی بیٹی ، پس ابوزرع کی بیٹی بھی کیا خوب ہے ۔ اپنے والدین کی تابعدار اور اپنے لباس کو بھرنے والی ( یعنی موٹی ہے ) اور اپنی سوتن کی رشک ( یعنی اپنے خاوند کی پیاری ہے ، اس لئے اس کی سوتن اس سے جلتی ہے ) ۔ اور ابوزرع کی لونڈی ، ابوزرع کی لونڈی بھی کیا خوب ہے ۔ ہماری بات ظاہر کر کے مشہور نہیں کرتی اور ہمارا کھانا اٹھا کر نہیں لیجاتی اور ہمارا گھر کچرے سے آلودہ نہیں رکھتی ۔ ابوزرع باہر نکلا جب کہ مشکوں میں دودھ ( گھی نکالنے ) کے لئے بلوایا جا رہا تھا ۔ پس وہ ایک عورت سے ملا ، جس کے ساتھ اس کے دو لڑکے تھے جیسے دو چیتے اس کی گود میں دو اناروں سے کھیلتے ہوں ۔ پس ابوزرع نے مجھے طلاق دی اور اس عورت سے نکاح کر لیا ۔ پھر میں نے اس کے بعد ایک سردار مرد سے نکاح کیا جو ایک عمدہ گھوڑے کا سوار اور نیزہ باز ہے ۔ اس نے مجھے چوپائے جانور بہت زیادہ دئیے اور اس نے مجھے ہر ایک مویشی سے جوڑا جوڑا دیا اور اس نے مجھ سے کہا کہ اے ام زرع! خود بھی کھا اور اپنے لوگوں کو بھی کھلا ۔ پس اگر میں وہ چیزیں جمع کروں جو مجھے دوسرے شوہر نے دیں ، تو وہ ابوزرع کے چھوٹے برتن کے برابر بھی نہ پہنچیں ( یعنی دوسرے خاوند کا احسان پہلے خاوند کے احسان سے نہایت کم ہے ) ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا کہ میں تیرے لئے ایسا ہوں جیسے ابوزرع ام زرع کے لئے تھا ۔ ( لیکن نہ تجھے طلاق دی ہے اور نہ دوں گا ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 6306,
			"arabicnumber": "2448.02",
			"text": "سعید بن سلمہ نے یہ حدیث ہشام بن عروہ سے اسی سند کے ساتھ بیان کی ، مگر ( ساتویں کے خاوندکے متعلق ) شک کے بغیر : \" عاجز اور ماندہ ہے عقل پر حماقت کی تہیں لگی ہو ئی ہیں \" کہا : اور ( دسویں کے خاوند کے متعلق ) کہا : ( اس کی اونٹنیاں ) چراگا ہوں میں کم بھیجی جا تی ہیں ( خدام باڑے میں چارہ مہیا کرتے ہیں ۔ ) اور ( ابو زرع کی بیٹی کےبارے میں ) کہا : اس کی اوڑھنے کی چادر خالی لگتی ہے ( اس کا پیٹ بڑھا ہوا نہیں ہے جبکہ ملء كسائهاسے مراد ہے کہ جسم کے باقی حصے لباس کو بھر دیتے ہیں ) قبیلے کی بہترین عورت ہے اور ( اپنی خوبصورتی اور وقار کی بناپر ) سوکن کے لیے نیزے کا زخم ( دردوتکلیف کا سبب ) ہے اور ( خادمہ کے بارے میں اس طرح ) کہا : \" وہ ہمارا کھا نا ضائع نہیں کرتی ۔ \" اور ( \" وَأَعْطَانِي مِنْ كُلِّ رَائِحَةٍ زَوْجًا \" کے بجائے ) وأعطاني من كل ذابحةٍ زوجاً ، ( اور مجھے ہر اعلیٰ درجے کی خوشبو دار چیز میں سے دگنا دگنا دیا ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 6307,
			"arabicnumber": "2449.01",
			"text": "لیث بن سعد نے کہا : ہمیں عبد اللہ بن عبید اللہ بن ابی ملیکہ قرشی تیمی نے حدیث بیان کی کہ حضرت مسوربن مخرمہ رضی اللہ تعالیٰ عنہ نے انھیں حدیث سنائی ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے منبر پر یہ سنا ، آپ فر ما رہت تھے : \" بنو ہشام بن مغیرہ نےمجھ سے اجازت چا ہی ہے کہ وہ اپنی بیٹی کی شادی علی بن ابی طالب سے کردیں ، میں انھیں اس کی اجازت نہیں دیتا ، پھر میں انھیں اس کی اجازت نہیں دیتا ، پھر میں انھیں اس کی اجازت نہیں دیتا ، الایہ کہ ابن ابی طالب پسند کرے تو میری بیٹی کو طلا ق دے دے اور ان کی بیٹی سے شادی کر لے کیونکہ میری بیٹی میرے جسم کا حصہ ہے جو چیز اسے پریشان کرے وہ مجھے پریشان کرتی ہے ۔ جو چیز اس کو ایذا دے وہ مجھے ایذا دیتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 6308,
			"arabicnumber": "2449.02",
			"text": "عمرو نے ابن ابی ملیکہ سے ، انھوں نے حضرت مسور بن مخرمہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" فاطمہ رضی اللہ تعالیٰ عنہا میرے جسم کا ایک ٹکڑا ہے جو چیز اس کو ایذا دے وہ مجھے ایذا دیتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 6309,
			"arabicnumber": "2449.03",
			"text": "محمد بن عمرو بن حلحلہ دؤلی نے کہا : ابن شہاب نے انھیں حدیث بیان کی ، انھیں علی بن حسین ( زین العابدین رضی اللہ تعالیٰ عنہ ) نے حدیث بیان کی کہ حضرت حسین بن علی رضی اللہ تعالیٰ عنہ کی شہادت کے بعد جب وہ یزید بن معاویہ کے ہاں سے مدینہ منورہ آئے تو مسور بن مخرمہ رضی اللہ تعالیٰ عنہ ان سے ملے اور کہا : آپ کو مجھ سے کو ئی بھی کا م ہو تو مجھے حکم کیجیے ۔ ( حضرت علی بن حسین نے ) کہا : میں نے ان سے کہا : نہیں ( کو ئی کا م نہیں ) حضرت مسور رضی اللہ تعالیٰ عنہ نے کہا : کیا آپ صلی اللہ علیہ وسلم کی تلوار ( حفاظت کے لیے ) مجھے عطا کریں گے ، کیونکہ مجھے خدشہ ہے کہ یہ لو گ اس ( تلوار ) کے معاملے میں آپ پرغالب آنے کی کو شش کریں گے اور اللہ کی قسم !اگر آپ نے یہ تلوار مجھے دے دی تو کو ئی اس تک نہیں پہنچ سکے گا یہاں تک کہ میری جا ن اپنی منزل پر پہنچ جا ئے ۔ ( مجھے یا د ہے کہ ) جب حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ نے حضرت فاطمہ رضی اللہ تعالیٰ عنہا کے ہو تے ہو ئے ابوجہل کی بیٹی کو نکا ح کا پیغام دیا تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم اپنے منبرپر لوگوں کو خطبہ دے رہے تھے اور میں ان دنوں بلوغت کو پہنچ چکا تھا آپ صلی اللہ علیہ وسلم نے فرما یا : \" فاطمہ مجھ سے ہے ( میرے جسم کا ٹکڑا ہے ) اور مجھے اندیشہ ہے کہ اسے دین کے معاملے میں آزمائش میں ڈالا جا ئے گا ۔ کہا : پھر آپ صلی اللہ علیہ وسلم نے بنو عبد شمس میں سے اپنے داماد ( حضرت ابو العاص بن ربیع رضی اللہ تعالیٰ عنہ ) کا ذکر فر ما یا اور اس کی اپنے ساتھ اس قرابت داری کی تعریف فرمائی اور اچھی طرح تعریف فر ما ئی ۔ آپ نے فر ما یا : \" اس نے میرے ساتھ بات کی تو سچ کہا ۔ میرے ساتھ وعدہ کیا تو پورا کیااور میں کسی حلال کا م کو حرام قرار نہیں دیتا اور کسی حرام کو حلال نہیں کرتا اور لیکن اللہ کی قسم!اللہ کے رسول کی بیٹی اور اللہ کے دشمن کی بیٹی ایک جگہ ( ایک خاوندکے نکا ح میں ) اکٹھی نہیں ہو ں گی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 6310,
			"arabicnumber": "2449.04",
			"text": "شعیب نے زہری سے روایت کی ، انھوں نے کہا : مجھے علی بن حسین ( زین العابدین ) نے خبر دی کہ مسور بن مخرمہ رضی اللہ تعالیٰ عنہ نے انھیں بتا یا کہ حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ نے ابو جہل کی بیٹی کے لیے نکا ح کا پیغام دیا : جبکہ نبی صلی اللہ علیہ وسلم کی بیٹی حضرت فاطمہ رضی اللہ تعالیٰ عنہا ان کے پاس ( نکاح میں ) تھیں تو جب حضرت فاطمہ رضی اللہ تعالیٰ عنہا نے یہ بات سنی تو وہ نبی صلی اللہ علیہ وسلم کے پاس آئیں تو آپ سے کہا : آپ کی قوم ( بنو ہاشم ) کے لو گ یہ کہتے ہیں کہ آپ کو اپنی بیٹیوں کے لیے غصہ نہیں آتا اور یہ علی رضی اللہ تعالیٰ عنہ ہیں جو ابو جہل کی بیٹی سے نکا ح کرنے والے ہیں ۔ حضرت مسور رضی اللہ تعالیٰ عنہ نے کہا : تو آپ صلی اللہ علیہ وسلم ( خطبہ دینے کے لیے ) کھڑے ہو ئے جب آپ نے شہادت کے الفاظ ادا کیے تو میں نے سنا ، پھر آپ نے فر ما یا : \" اس کے بعد!میں نے ابو العاص بن ربیع کو رشتہ دیا تو اس نے میرے ساتھ بات کی تو سچی بات کی ، بے شک فاطمہ بنت محمد صلی اللہ علیہ وسلم میری جان کا ایک حصہ ہے ۔ مجھے یہ بہت برا لگتا ہے کہ لو گ اسے آزمائش میں ڈالیں ۔ اور بات یہ ہے کہ اللہ کی قسم!اللہ کے رسول کی بیٹی اور اللہ کے دشمن کی بیٹی ایک شخص کے نکا ح میں اکٹھی نہیں ہو ں گی ۔ \" ( حضرت مسور رضی اللہ تعالیٰ عنہ نے ) کہا : تو حضرت علی رضی اللہ تعالیٰ عنہ نے نکا ح کا ارادہ ترک کر دیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 6311,
			"arabicnumber": "2449.05",
			"text": "نعمان بن راشد نے زہری سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 6312,
			"arabicnumber": "2450.01",
			"text": "عروہ بن زبیر نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے انھیں حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنی صاحبزادی حضرت فاطمہ رضی اللہ تعالیٰ عنہا کو بلا یا اور ان کو راز داری سے ( سر گوشی کرتے ہو ئے ) کو ئی بات کہی تو حضرت فاطمہ روپڑیں ۔ آپ صلی اللہ علیہ وسلم نے پھر ان کو رازداری سے کو ئی بات کہی تو وہ ہنسنے لگیں ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : میں نے حضرت فاطمہ رضی اللہ تعالیٰ عنہا سے کہا : یہ کیا بات تھی جو رسول اللہ صلی اللہ علیہ وسلم نے آپ کو راز داری سے کہی اور آپ روپڑیں ، پھر دوبارہ رازداری سے بات کی تو ہنس دیں ۔ حضرت فاطمہ رضی اللہ تعالیٰ عنہا نے کہا : آپ صلی اللہ علیہ وسلم نے میرے کا ن میں بات کی اور اپنی موت کی خبر دی تو میں روپڑی ، پھر دوسری بار میرے کان میں بات کی اور مجھے بتا یا کہ ان کے گھر والوں میں سے پہلی میں ہو ں گی جو ان سے جا ملوں گی تو میں ہنس دی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 6313,
			"arabicnumber": "2450.02",
			"text": "ابو عوانہ نے فراس سے ، انھوں نے عامر سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : ہم نبی صلی اللہ علیہ وسلم کی سب ازواج آپ کے پاس موجود تھیں ، ان میں سے کو ئی ( وہاں سے ) غیر حاضر نہیں ہوئی تھی ، اتنے میں حضرت فاطمہ رضی اللہ تعالیٰ عنہا چلتی ہو ئی آئیں ان کی چال رسول اللہ صلی اللہ علیہ وسلم کی چال سے ذرہ برابر مختلف نہ تھی ۔ جب آپ نے انھیں دیکھا تو ان کو خوش آمدید کہا اور فر ما یا : \" میری بیٹی کو خوش آمدید ! \" پھر انہیں اپنی دائیں یا بائیں جانب بٹھا یا ، پھر رازی داری سے ان کے ساتھ بات کی تو وہ شدت سے رونے لگیں ۔ جب آپ نے ان کی شدید نے قراری دیکھی تو آپ نے دوبارہ ان کے کا ن میں کو ئی بات کہی تو ہنس پڑیں ۔ ( بعد میں ) میں نے ان سے کہا : رسول اللہ صلی اللہ علیہ وسلم نے اپنی ازواج کو چھوڑ کر خاص طور پر آپ سے راز داری کی بات کی ، آپ روئیں ( کیوں ؟ ) جب رسول اللہ صلی اللہ علیہ وسلم ( اس جگہ سے ) تشریف لے گئے تو میں نے ان سے پو چھا : رسول اللہ صلی اللہ علیہ وسلم نے آپ سے کیا کہا : ؟ انھوں نے کہا : میں ایسی نہیں کہ رسول اللہ صلی اللہ علیہ وسلم کا راز فاش کردوں ، پھر جب رسول اللہ صلی اللہ علیہ وسلم کا انتقال ہو گیا تو میں نے ان سے کہا : میرا آپ پر جو حق ہے میں اس کی بنا پر اصرار کرتی ہوں ( اور یہ اصرار جاری رہے گا ) الایہ کہ آپ مجھے بتا ئیں کہ آپ سے رسول اللہ صلی اللہ علیہ وسلم نے کیا کہا تھا؟انھوں نےکہا : اب ( اگر آپ پوچھتی ہیں ) تو ہاں ، پہلی بار جب آپ نے سرگوشی کی تو مجھے بتایا : \" جبریل علیہ السلام آپ کے ساتھ سال میں ایک یا دو مرتبہ قرآن کادور کیا کرتے تھے اور ابھی انھوں نے ایک ساتھ دوبارہ دور کیا ہے اور مجھے اس کے سوا کچھ نظر نہیں آتا کہ اجل ( مقررہ وقت ) قریب آگیا ہے ، اس لئے تم اللہ کا تقویٰ اختیار کرتے ہوئے صبرکرنا ، میں تمھارے لیے بہترین پیش رو ہوں گا ۔ \" ( حضرت فاطمہ رضی اللہ تعالیٰ عنہا نے ) کہا : اس پر میں اس طرح روئی جیسا آپ نے دیکھا ، پھر جب آپ صلی اللہ علیہ وسلم نے میری شدید بے قراری دیکھی تو دوسری بار میرے کان میں بات کی اور فرمایا : \" فاطمہ!کیا تم اس پرراضی نہیں ہوکہ تم ایماندار عورتوں کی سردار بنو یا ( فرمایا : ) اس امت کی عورتوں کی سردار بنو؟ \" کہا : تو اس پر میں اس طرح سے ہنس پڑی جیسے آپ نے دیکھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 6314,
			"arabicnumber": "2450.03",
			"text": "زکریا نے فراس سے ، انھوں نے عامر سے ، انھوں نے مسروق سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی سب ازواج مطہرات رضی اللہ عنہن آپ صلی اللہ علیہ وسلم کے پاس تھیں ( آپ صلی اللہ علیہ وسلم کی بیماری میں ) ، کوئی بیوی ایسی نہ تھیں جو پاس نہ ہو کہ اتنے میں سیدہ فاطمۃالزہراء رضی اللہ عنہا آئیں اور وہ بالکل اسی طرح چلتی تھیں جس طرح رسول اللہ صلی اللہ علیہ وسلم چلتے تھے ۔ آپ صلی اللہ علیہ وسلم نے جب انہیں دیکھا تو مرحبا کہا اور فرمایا کہ مرحبا میری بیٹی ۔ پھر ان کو اپنے دائیں طرف یا بائیں طرف بٹھایا اور ان کے کان میں آہستہ سے کچھ فرمایا تو وہ بہت روئیں ۔ جب آپ صلی اللہ علیہ وسلم نے ان کا یہ حال دیکھا تو دوبارہ ان کے کان میں کچھ فرمایا تو وہ ہنسیں ۔ میں نے ان سے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے خاص تم سے راز کی باتیں کیں ، پھر تم روتی ہو ۔ جب آپ صلی اللہ علیہ وسلم کھڑے ہوئے تو میں نے ان سے پوچھا کہ تم سے رسول اللہ صلی اللہ علیہ وسلم نے کیا فرمایا؟ انہوں نے کہا کہ میں آپ صلی اللہ علیہ وسلم کا راز فاش کرنے والی نہیں ہوں ۔ جب آپ صلی اللہ علیہ وسلم کی وفات ہو گئی تو میں نے ان کو قسم دی اس حق کی جو میرا ان پر تھا اور کہا کہ مجھ سے بیان کرو جو رسول اللہ صلی اللہ علیہ وسلم نے تم سے فرمایا تھا ، تو انہوں نے کہا کہ اب البتہ میں بیان کروں گی ۔ پہلی مرتبہ آپ صلی اللہ علیہ وسلم نے میرے کان میں یہ فرمایا کہ جبرائیل علیہ السلام ہر سال ایک بار یا دو بار مجھ سے قرآن کا دور کرتے تھے اور اس سال انہوں نے دوبار دور کیا ، اور میں خیال کرتا ہوں کہ میرا ( دنیا سے جانے کا ) وقت قریب آ گیا ہے ، پس اللہ سے ڈرتی رہ اور صبر کر ، میں تیرا بہت اچھا منتظر ہوں ۔ یہ سن کر میں رونے لگی جیسے تم نے دیکھا تھا ۔ جب آپ صلی اللہ علیہ وسلم نے میرا رونا دیکھا تو دوبارہ مجھ سے سرگوشی کی اور فرمایا کہ اے فاطمہ! تو اس بات سے راضی نہیں ہے کہ تو مومنوں کی عورتوں کی یا اس امت کی عورتوں کی سردار ہو؟ یہ سن کر میں ہنسی جیسے کہ تم نے دیکھا تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 6315,
			"arabicnumber": "2451",
			"text": "معتمر بن سلیمان نے ہمیں حدیث بیان کی ، کہا : میں نے اپنے والد سے سنا ، کہا : ہمیں ابو عثمان نے حضرت سلمان فارسی رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ اگر ہو سکے تو سب سے پہلے بازار میں مت جا اور نہ سب کے بعد وہاں سے نکل ، کیونکہ بازار شیطان کا میدان جنگ ہے اور وہیں وہ اپنا جھنڈا گاڑتا ہے ۔ ( ابو عثمان نہدی نے ) کہا : اور مجھے خبر دی گئی کہ جبرائیل علیہ السلام رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور آپ صلی اللہ علیہ وسلم کے پاس ام المؤمنین ام سلمہ رضی اللہ عنہا تھیں ۔ جبرائیل علیہ السلام آپ صلی اللہ علیہ وسلم سے باتیں کرنے لگے ، پھر کھڑے ہوئے ( یعنی چلے گئے ) تو رسول اللہ صلی اللہ علیہ وسلم نے ان سے پوچھا کہ یہ کون شخص تھے؟ انہوں نے کہا کہ دحیہ کلبی تھے ۔ ام المؤمنین ام سلمہ رضی اللہ عنہا نے کہا کہ اللہ کی قسم ہم تو انہیں دحیہ کلبی ہی سمجھے ، یہاں تک کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کا خطبہ سنا ، آپ صلی اللہ علیہ وسلم ہماری خبر بیان کرتے تھے ۔ میں ( راوی حدیث ) نے کہا کہ میں نے ابوعثمان سے پوچھا کہ یہ حدیث آپ نے کس سے سنی؟ تو انہوں نے فرمایا کہ سیدنا اسامہ بن زید رضی اللہ عنہ سے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 6316,
			"arabicnumber": "2452",
			"text": "عائشہ بنت طلحہ نے ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" تم میں سب سے جلدی میرے ساتھ آملنے والی ( میری وہ اہلیہ ہوگی جو ) تم میں سب سے لمبے ہاتھوں والی ہے ۔ \"\" انھوں نے کہا : ہم لمبائی ناپا کرتی تھیں کہ کس کے ہاتھ لمبے ہیں ۔ انھوں نے کہا : اصل میں زینب ہم سب سے زیادہ لمبے ہاتھوں والی تھیں کیونکہ وہ ا پنے ہاتھوں سے کام کرتیں اور ( اس کی اجرت ) صدقہ کرتی تھیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 6317,
			"arabicnumber": "2453",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم حضرت ام ایمن رضی اللہ تعالیٰ عنہا کے پاس تشریف لے گئے ، میں بھی آ پ کے ساتھ گیا ، انھوں نے آپ کے ہاتھ میں ایک برتن دیا جس میں مشروب تھا ۔ کہا : تو مجھے معلوم انھوں نے اچانک روزے کی حالت میں آپ صلی اللہ علیہ وسلم کو ( وہ مشروب ) پکڑا دیا تھا یا آپ اسے پینا نہیں چاہتے تھے ، ( آپ نے پینے میں تردد فرمایا ) تو وہ آپ کے سامنے زور زور سے بولنے اور غصے کا اظہار کرنے لگیں ( جس طرح ایک ماں کرتی ہے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 6318,
			"arabicnumber": "2454",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : کہ سیدنا ابوبکر رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کی وفات کے بعد سیدنا عمر رضی اللہ عنہ سے کہا کہ ہمارے ساتھ ام ایمن کی ملاقات کے لئے چلو ہم اس سے ملیں گے جیسے رسول اللہ صلی اللہ علیہ وسلم ان سے ملنے کو جایا کرتے تھے ۔ جب ہم ان کے پاس پہنچے تو وہ رونے لگیں ۔ دونوں ساتھیوں نے کہا کہ تم کیوں روتی ہو؟ اللہ جل جلالہ کے پاس اپنے رسول صلی اللہ علیہ وسلم کے لئے جو سامان ہے وہ رسول اللہ صلی اللہ علیہ وسلم کے لئے بہتر ہے ۔ ام ایمن رضی اللہ عنہا نے کہا کہ میں اس لئے نہیں روتی کہ یہ بات نہیں جانتی بلکہ اس وجہ سے روتی ہوں کہ اب آسمان سے وحی کا آنا بند ہو گیا ۔ ام ایمن کے اس کہنے سے سیدنا ابوبکر اور سیدنا عمر رضی اللہ عنہ کو بھی رونا آیا پس وہ بھی ان کے ساتھ رونے لگے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 6319,
			"arabicnumber": "2455",
			"text": "اسحاق بن عبداللہ نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم ازواج مطہرات اور حضرت ام سلیم رضی اللہ تعالیٰ عنہا کے سوا اور کسی عورت کے گھر نہیں جاتے تھے ۔ آپ صلی اللہ علیہ وسلم حضرت ام سلیم رضی اللہ تعالیٰ عنہا کے ہاں تشریف لے جاتے تھے ، اس کے متعلق آپ سے بات کی گئی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے اس پر رحم آتا ہے ، اس کا بھائی میرے ساتھ ( لڑتا ہوا ) شہید ہوا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 6320,
			"arabicnumber": "2456",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں جنت میں گیا ، وہاں میں نے ( کسی کے چلنے کی ) آہٹ پائی تو میں نے پوچھا کہ کون ہے؟ لوگوں نے کہا کہ غمیصا بنت ملحان ( ام سلیم کا نام غمیصا یا رمیصا تھا ) انس بن مالک کی والدہ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 6321,
			"arabicnumber": "2457",
			"text": "محمد بن منکدر نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" مجھے جنت دکھائی گئی ، میں نے وہاں ابو طلحہ کی بیوی ( ام سلیم رضی اللہ تعالیٰ عنہا ) کودیکھا ، پھر میں نے اپنے آگے کسی کے چلنے کی آہٹ سنی ، تو وہ بلال تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 6322,
			"arabicnumber": "2144.04",
			"text": "بہز نے کہا : ہمیں سلیمان بن مغیرہ نے ثابت سے حدیث بیان کی ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ سیدنا ابوطلحہ رضی اللہ عنہ کا ایک بیٹا جو سیدہ ام سلیم رضی اللہ عنہا کے بطن سے تھا ، فوت ہو گیا ۔ انہوں نے اپنے گھر والوں سے کہا کہ جب تک میں خود نہ کہوں ابوطلحہ کو ان کے بیٹے کی خبر نہ کرنا ۔ آخر سیدنا ابوطلحہ رضی اللہ عنہ آئے تو سیدہ ام سلیم شام کا کھانا سامنے لائیں ۔ انہوں نے کھایا اور پیا پھر ام سلیم رضی اللہ عنہا نے ان کے لئے اچھی طرح بناؤ اور سنگھار کیا یہاں تک کہ انہوں نے ان سے جماع کیا ۔ جب ام سلیم نے دیکھا کہ وہ سیر ہو چکے اور ان کے ساتھ صحبت بھی کر چکے تو اس وقت انہوں نے کہا کہ اے ابوطلحہ! اگر کچھ لوگ اپنی چیز کسی گھر والوں کو مانگے پر دیں ، پھر اپنی چیز مانگیں تو کیا گھر والے اس کو روک سکتے ہیں؟ سیدنا ابوطلحہ رضی اللہ عنہ نے کہا کہ نہیں روک سکتے ۔ سیدہ ام سلیم رضی اللہ عنہا نے کہا کہ اپنے بیٹے کے عوض اللہ تعالیٰ سے ثواب کی امید رکھو ( کیونکہ بیٹا تو فوت ہو چکا تھا ) ۔ یہ سن کر ابوطلحہ غصے ہوئے اور کہنے لگے کہ تم نے مجھے چھوڑے رکھا یہاں تک کہ میں تمہارے ساتھ آلودہ ہوا ( یعنی جماع کیا ) تو اب مجھے بیٹے کے متعلق خبر دے رہی ہو ۔ وہ گئے اور رسول اللہ صلی اللہ علیہ وسلم کے پاس جا کر آپ صلی اللہ علیہ وسلم کو خبر کی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ تمہاری گزری ہوئی رات میں تمہیں برکت دے ۔ ام سلیم رضی اللہ عنہا حاملہ ہو گئیں ۔ کہتے ہیں رسول اللہ صلی اللہ علیہ وسلم سفر میں تھے ام سلیم بھی آپ صلی اللہ علیہ وسلم کے ساتھ تھیں اور آپ صلی اللہ علیہ وسلم جب سفر سے مدینہ میں تشریف لاتے تو رات کو مدینہ میں داخل نہ ہوتے جب لوگ مدینہ کے قریب پہنچے تو ام سلیم کو درد زہ شروع ہوا اور ابوطلحہ ان کے پاس ٹھہرے رہے اور رسول اللہ صلی اللہ علیہ وسلم تشریف لے گئے ۔ ابوطلحہ کہتے ہیں کہ اے پروردگار! تو جانتا ہے کہ مجھے یہ بات پسند ہے کہ جب تیرا رسول صلی اللہ علیہ وسلم نکلے تو ساتھ میں بھی نکلوں اور جب مدینہ میں واپس داخل ہو تو میں بھی ساتھ داخل ہوں ، لیکن تو جانتا ہے میں جس وجہ سے رک گیا ہوں ۔ ام سلیم نے کہا کہ اے ابوطلحہ! اب میرے ویسا درد نہیں ہے جیسے پہلے تھا تو چلو ۔ ہم چلے جب دونوں مدینہ میں آئے تو پھر ام سلیم کو درد شروع ہوا اور انہوں نے ایک لڑکے کو جنم دیا ۔ میری ماں نے کہا کہ اے انس! اس کو کوئی اس وقت تک دودھ نہ پلائے جب تک تو صبح کو اس کو رسول اللہ صلی اللہ علیہ وسلم کے پاس نہ لے جائے ۔ جب صبح ہوئی تو میں نے بچہ کو اٹھایا اور رسول اللہ صلی اللہ علیہ وسلم کے پاس لایا میں آپ کے پاس پہنچا تو دیکھا کہ آپ صلی اللہ علیہ وسلم کے ہاتھ میں اونٹوں کے داغنے کا آلہ ہے ۔ آپ صلی اللہ علیہ وسلم نے جب مجھے دیکھا تو فرمایا کہ شاید ام سلیم نے لڑکے کو جنم دیا ہے؟ میں نے کہا کہ ہاں ۔ آپ صلی اللہ علیہ وسلم نے وہ آلہ ہاتھ مبارک سے رکھ دیا اور میں بچہ کو لا کر آپ صلی اللہ علیہ وسلم کی گود میں بٹھا دیا ۔ آپ صلی اللہ علیہ وسلم نے عجوہ کھجور مدینہ کی منگوائی اور اپنے منہ مبارک میں چبائی ، جب وہ گھل گئی تو بچہ کے منہ میں ڈال دی بچہ اس کو چوسنے لگا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ دیکھو انصار کو کھجور سے کیسی محبت ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے اس کے منہ پر ہاتھ پھیرا اور اس کا نام عبداللہ رکھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 6323,
			"arabicnumber": "2144.05",
			"text": "عمرو بن عاص نے کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی ، انھوں نے کہا : ہمیں ثابت نے حدیث سنائی ، انھوں نے کہا : مجھے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث سنائی ، کہا : ابوطلحہ رضی اللہ تعالیٰ عنہ کا ایک بچہ فوت ہوگیا ، اور اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 6324,
			"arabicnumber": "2458",
			"text": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے بلال سے صبح کی نماز کے بعد فرمایا کہ اے بلال! مجھ سے وہ عمل بیان کر جو تو نے اسلام میں کیا ہے اور جس کے فائدے کی تجھے بہت امید ہے ، کیونکہ میں نے آج کی رات تیری جوتیوں کی آواز اپنے سامنے جنت میں سنی ہے ۔ سیدنا بلال رضی اللہ عنہ نے کہا کہ میں نے اسلام میں کوئی عمل ایسا نہیں کیا جس کے نفع کی امید بہت ہو ۔ سوا اس کے کہ رات یا دن میں کسی بھی وقت جب پورا وضو کرتا ہوں تو اس وضو سے نماز پڑھتا ہوں جتنی کہ اللہ تعالیٰ نے میری قسمت میں لکھی ہوتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 6325,
			"arabicnumber": "2459",
			"text": "حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : جب یہ آیت نازل ہو ئی : \" جو لوگ ایمان لا ئے اور نیک اعمال کیے ان پر انھوں نے کھا یا پیا اس میں کو ئی گناہ نہیں جبکہ وہ تقویٰ پر تھے اور ایمان لے آئے تھے \" آیت کے آخر تک ۔ ( تو ) رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فر ما یا : \" مجھے بتا یا گیا ہے کہ تم بھی انھی میں سے ہو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 6326,
			"arabicnumber": "2460.01",
			"text": "ابو زائدہ نے ابو اسحٰق سے ، انھوں نے اسود بن یزید سے ، انھوں نے حضرت موسی ( اشعری ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں اور میرا بھا ئی یمن سے آئے تو کچھ عرصہ ہم حضرت ابن مسعود رضی اللہ تعالیٰ عنہ اور ان کی والدہ کو رسول اللہ صلی اللہ علیہ وسلم کے گھر بکثرت آنے جانے اور آپ کے ساتھ لگے رہنے کی وجہ سے ، رسول اللہ صلی اللہ علیہ وسلم کے اہل بیت میں سے سمجھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 6327,
			"arabicnumber": "2460.02",
			"text": "یو سف نے ابو اسحاق سے روایت کی کہ انھوں نے اسود کو یہ کہتے ہوئے سنا ، میں نے حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے : میں اور میرا بھائی یمن سے آئے ، پھر اسی کے مانند بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 6328,
			"arabicnumber": "2460.03",
			"text": "سفیان نے ابو اسحٰق سے ، انھوں نے اسود سے ، انھوں نے حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضرہوا اور میں یہ سمجھتا تھا کہ حضرت عبد اللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ اہل بیت میں سے ہیں یا انھوں نے اسی طرح ( کے الفا ظ میں ) بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 6329,
			"arabicnumber": "2461.01",
			"text": "ابو اسحٰق سے روایت ہے انھوں نے کہا : میں نے ابو حوص سے سنا ، انھوں نے کہا : جس وقت حضرت ابن مسعود رضی اللہ تعالیٰ عنہ کا انتقال ہوا میں نے اس وقت حضرت ابو موسیٰ اور حضرت مسعود رضی اللہ تعالیٰ عنہ کے ہاں حاضری دی تو ان میں سے ایک نے دوسرے سے پو چھا : کیا آپ سمجھتے ہیں کہ وہ اپنے بعد کو ئی ایسا شخص چھوڑ گئے ہیں جو ان جیسا ہو ؟انھوں نے جواب دیا : جب آپ نے یہ بات کہہ دی تو حقیقت یہ ہے کہ انھیں اس وقت ( رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ) حاضری کی اجا زت ہو تی تھی ، جب ہمیں روک لیا جا تاتھا ، اور وہ اس وقت بھی حاضر رہتے تھےجب ہم مو جو دنہ ہو تے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 6330,
			"arabicnumber": "2461.02",
			"text": "قطبہ بن عبدالعزیز نے اعمش سے ، انھوں نے مالک بن حارث سے ، انھوں نے ابو احوص سے روایت کی ، کہا : ہم حضرت عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ کے چند ساتھیوں ( شاگردوں ) کے ہمراہ حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ کے گھر میں تھے ۔ وہ سب ایک مصحف ( قرآن مجید کا نسخہ ) دیکھ رہے تھے ، اس اثناءمیں حضرت عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ اٹھ کھڑے ہوئے تو حضرت ابو مسعود رضی اللہ تعالیٰ عنہ نے کہا : میں نہیں جانتا کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے بعد اس شخص سے ، جو ( ابھی ) اٹھا ہے ، زیادہ اللہ کے نازل کردہ قرآن کو جاننے والا کوئی اور آدمی چھوڑا ہو! حضرت ابوموسیٰ رضی اللہ عنہ نے کہا کہ اگر آپ نے یہ کہا ہے تو ( اس کی وجہ یہ ہے کہ ) یہ اس وقت حاضر ر ہتے جب ہم موجود نہ ہوتے اورا نھیں ( اس وقت بھی ) حاضری کی اجازت دی جاتی جب ہمیں اجازت نہ ہوتی تھی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 6331,
			"arabicnumber": "2461.03",
			"text": "ابو عبیدہ نے اعمش سے ، انھوں نے زید بن وہب سے روایت کی ، کہا : میں حضرت حذیفہ اورابو موسیٰ رضوان اللہ عنھم اجمعین کے ساتھ بیٹھا ہوا تھا ، اور ( یہی ) حدیث بیان کی ۔ قطبہ کی حدیث مکمل اور زیادہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 6332,
			"arabicnumber": "2462",
			"text": "شقیق نے حضرت عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے پڑھا : \"\" ”اور جو کوئی چیز چھپا رکھے گا ، وہ اس کو قیامت کے دن لائے گا“ ( سورۃ : آل عمران : 161 ) پھر کہا کہ تم مجھے کس شخص کی قرآت کی طرح قرآن پڑھنے کا حکم کرتے ہو؟ میں نے تو رسول اللہ صلی اللہ علیہ وسلم کے سامنے ستر سے زیادہ سورتیں پڑھیں اور رسول اللہ صلی اللہ علیہ وسلم کے اصحاب یہ جانتے ہیں کہ میں ان سب میں اللہ کی کتاب کو زیادہ جانتا ہوں اور اگر میں جانتا کہ کوئی مجھ سے زیادہ اللہ کی کتاب کو جانتا ہے تو میں اس شخص کی طرف سفر اختیار کرتا ۔ شفیق نے کہا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے اصحاب کے حلقوں میں بیٹھا ہوں ، میں نے کسی کو سیدنا عبداللہ رضی اللہ عنہ کی اس بات کو رد کرتے یا ان پر عیب لگاتے نہیں سنا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 6333,
			"arabicnumber": "2463",
			"text": "مسروق نے حضرت عبداللہ ( بن مسعود ) رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : اس ذات کی قسم جس کے سواکوئی معبود نہیں!کتاب اللہ کی کوئی صورت نہیں مگر میں اسکے متعلق جانتاہوں کہ وہ کب نازل ہوئی ، اور کتاب اللہ کی کوئی آیت نہیں مگر مجھے علم ہے کہ کس کے بارے میں نازل ہوئی ، اور اگر مجھے یہ معلوم ہوکہ کوئی شخص مجھ سے زیادہ کتاب اللہ کو جاننے والاہے ۔ اور اونٹ اس تک پہنچ سکتے ہیں تو میں ( اونٹوں پر سفر کرکے ) اس کے پاس جاؤں ( اور قرآن کا علم حاصل کروں ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 6334,
			"arabicnumber": "2464.01",
			"text": "ابو بکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے کہا : ہمیں وکیع نے حدیث بیان کی ، کہا : ہمیں اعمش نے ( ابو وائل ) شقیق سے حدیث بیان کی ، انھوں نے مسروق سے روایت کی ، کہا : ہم حضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہ کے پاس جاتے تھے اور ان کے ساتھ ( علمی ) گفتگو کیاکرتے تھے ۔ اور ابن نمیر نے کہا : ان کے پاس ( گفتگو کیا کرتے تھے ) چنانچہ ایک دن ہم نے ( ان کے سامنے ) حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کا ذکر کیا تو انھوں نےکہا : تم نے مجھ سے اس شخص کا ذکر کیا ہے کہ میں رسول اللہ صلی اللہ علیہ وسلم سے ایک بات سننے کے بعد سے مسلسل اس سے محبت کرتا ہوں ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" قرآن چار آدمیوں سے سیکھو : ابن ام عبد ( حضرت ابن مسعود ) رضی اللہ تعالیٰ عنہ سے ۔ آپ نے ابتداء ان سے کی ۔ معاذ بن جبل رضی اللہ تعالیٰ عنہ ، ابن ابی کعب رضی اللہ تعالیٰ عنہ ، اور ابو حذیفہ رضی اللہ تعالیٰ عنہ کےآزاد کردہ غلام سالم سے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 6335,
			"arabicnumber": "2464.02",
			"text": "قتیبہ بن سعید ، زہیر بن حرب اور عثمان بن ابی شیبہ نے کہا : ہمیں جریر نے اعمش سے حدیث بیان کی ، انھوں نے ابو وائل ( شقیق ) سے ، انھوں نے مسروق سے روایت کی ، مسروق کہتے ہیں کہ ہم سیدنا عبداللہ بن عمرو رضی اللہ عنہما کے پاس تھے کہ ہم نے سیدنا عبداللہ بن مسعود رضی اللہ عنہما کا ذکر کیا تو انہوں نے کہا کہ تم نے ایک ایسے شخص کا ذکر کیا جس سے میں ( اس وقت سے ) محبت کرتا ہوں جب سے میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث سنی ہے ۔ میں نے سنا آپ صلی اللہ علیہ وسلم فرماتے تھے کہ تم قرآن چار آدمیوں سے سیکھو ۔ ایک ام عبد کے بیٹے ( یعنی سیدنا عبداللہ بن مسعود ) سے اور آپ صلی اللہ علیہ وسلم نے ان ہی سے شروع کیا اور ابی بن کعب سے اور سالم مولیٰ ابوحذیفہ سے اور معاذ بن جبل رضی اللہ عنہما سے ۔ اور زہیر بن حرب نے ( حضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہ کی طرف سے ) جو ایک لفظ بیان نہیں کیا وہ ہے : جو آپ صلی اللہ علیہ وسلم نے فرمائی تھی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 6336,
			"arabicnumber": "2464.03",
			"text": "ابو بکر بن ابی شیبہ اور ابو کریب نے کہا : ہمیں ابو معاویہ نے اعمش سے جریر اور وکیع کی سند کے ساتھ حدیث بیان کی ۔ ابو معاویہ سے ابو بکر کی روایت میں انھوں نے معاذ رضی اللہ تعالیٰ عنہ کو ابی رضی اللہ تعالیٰ عنہ سے مقدم رکھا اورابو کریب کی روایت میں ابی ( بن کعب رضی اللہ تعالیٰ عنہ ) معاذ رضی اللہ تعالیٰ عنہ سے پہلے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 6337,
			"arabicnumber": "2464.04",
			"text": "ابن ابی عدی اور محمد بن جعفر دونوں نے شعبہ سے ، انھوں نے اعمش سے انھی کی سندکے ساتھ روایت کی ، شعبہ سے روایت کرتے ہوئے ان دونوں نے چاروں کی ترتیب میں اختلاف کیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 6338,
			"arabicnumber": "2464.05",
			"text": "ابراہیم نے مسروق سے روایت کی ، کہا : لوگوں نےحضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہ کے سامنے حضرت ابن مسعود رضی اللہ تعالیٰ عنہ کا ذکر کیا تو انھوں نے کہا : وہ ایسے ہیں جن سے میں رسول اللہ صلی اللہ علیہ وسلم سے ( ایک بات ) سننے کے بعد سے مسلسل محبت کرتا آیا ہوں ، آپ نے فرمایا تھا؛ \" چارآدمیوں سے قرآن پڑھنا سیکھو : ابن مسعود رضی اللہ تعالیٰ عنہ ، ابوحذیفہ رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام سالم رضی اللہ تعالیٰ عنہ ، ابی بن کعب رضی اللہ تعالیٰ عنہ اور معاذ بن جبل رضی اللہ تعالیٰ عنہ سے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 6339,
			"arabicnumber": "2464.06",
			"text": "ہمیں عبیداللہ بن معاذ نے حدیث سنائی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں شعبہ نے اسی سند کےساتھ حدیث سنائی اور کچھ مزید بیان کیا ، شعبہ نے کہا : آپ نے ان دونوں کے نام سے ابتداء کی ، مجھے یاد نہیں کی ان دونوں میں سے کس کا نام پہلے لیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 6340,
			"arabicnumber": "2465.01",
			"text": "شعبہ نے قتادہ سے روایت کی ، کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم کےعہد میں چاراشخاص نے قرآن مجید جمع کیا اور وہ سب کے سب انصار میں سے تھے : حضرت معاذ بن جبل رضی اللہ تعالیٰ عنہ ، حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ ، حضرت زید بن ثابت رضی اللہ تعالیٰ عنہ اور حضرت ابو زید رضی اللہ تعالیٰ عنہ ۔ قتادہ نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے پوچھا : ابو زید کون؟فرمایا : وہ میرے ایک چچا ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 6341,
			"arabicnumber": "2465.02",
			"text": "ہمام نے کہا : قتادہ نے ہمیں حدیث سنائی ، کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد میں قرآن کس نے جمع کیا تھا؟انھوں نے کہا : چار آدمیوں نے اور وہ چاروں انصار میں سے تھے : حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ ، حضرت معاذ بن جبل رضی اللہ تعالیٰ عنہ ، حضرت زید بن ثابت رضی اللہ تعالیٰ عنہ ، اور انصار کے ایک شخص جن کی کنیت ابو زید رضی اللہ تعالیٰ عنہ تھی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 6342,
			"arabicnumber": "799.04",
			"text": "ہمام نے کہا : ہمیں قتادہ نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابی رضی اللہ تعالیٰ عنہ سے فرمایا؛ \" اللہ عزوجل نے مجھے حکم دیا ہے کہ میں تمھارے سامنے قرآن مجید پڑھوں ۔ \" حضرت ابی رضی اللہ تعالیٰ عنہ نے کہا : کیا اللہ تعالیٰ نے آپ سے میرا نام لے کرکہا؟آپ نے فرمایا : \" اللہ تعالیٰ نے میرے سامنے تمھارا نام لیا ۔ \" اس پر حضرت ابی رضی اللہ تعالیٰ عنہ پر گریہ طاری ہوگیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 6343,
			"arabicnumber": "799.05",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے قتادہ سے سنا ، وہ حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کررہے تھے ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم ن حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ سے فرمایا : \" اللہ تعالیٰ نے مجھے حکم دیا ہے کہ میں تمھارے سامنے ( قرآن مجید کی یہ سورت ) : ﴿لَمْ يَكُنِ الَّذِينَ كَفَرُوا﴾ ( البینہ 1 : 98 ) تلاوت کروں ۔ ( حضرت ابی رضی اللہ تعالیٰ عنہ نے ) کہا : اور اللہ تعالیٰ نے میرا نام لیا ہے؟آپ نے فرمایا : \" ہاں ۔ \" تو وہ ( حضرت ابی رضی اللہ تعالیٰ عنہ ) رونے لگے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 6344,
			"arabicnumber": "799.06",
			"text": "خالد بن حارث نے کہا : ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابی رضی اللہ تعالیٰ عنہ سے فرمایا ، اسی کے مانند ( جو پچھلی روایات میں ہے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 6345,
			"arabicnumber": "2466.01",
			"text": "ابو زبیر نے بتایا کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئےسنا : رسول اللہ صلی اللہ علیہ وسلم نے ، جب حضرت سعد بن معاذ رضی اللہ تعالیٰ عنہ کا جنازہ لوگوں کے سامنے رکھا ہوا تھا ، فرمایا : \" ان کی ( موت کی ) وجہ سے رحمان کا عرش جنبش میں آگیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 6346,
			"arabicnumber": "2466.02",
			"text": "ابو سفیان نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" سعد بن معاذ کی موت کی وجہ سے رحمٰن کا عرش جنبش میں آگیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 6347,
			"arabicnumber": "2467",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا جبکہ ان کے جنازے کی چار پائی رکھی ہوئی تھی ۔ ان کی مراد حضرت سعد رضی اللہ تعالیٰ عنہ سے تھی ۔ فرمایا : \" اس کی وجہ سے رحمان کا عرش جنبش میں آگیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 6348,
			"arabicnumber": "2468.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے ابو اسحاق سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت براء رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم کو ریشم کا ایک حلہ ہدیہ کیاگیا تو آپ کے صحابہ رضوان اللہ عنھم اجمعین اس کوچھونے اوراس کی گدازی پر تعجب کرنے لگے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس حلے کی گدازی پر تعجب کرتے ہو ، جنت میں سعد بن معاذ کے رومال اس سے بہت زیادہ اچھے اور زیادہ ملائم ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 6349,
			"arabicnumber": "2468.02",
			"text": "احمد بن عبدہ ضبی نے کہا : ہمیں ابو داود نے حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث سنائی ، کہا : مجھے اسحاق نے خبر دی ، انھوں نے کہا : میں نے براء بن عازب رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم کے پاس ر یشم کا کپڑا لایاگیا ، اور ( باقی ) حدیث بیان کی ، پھر ابن عبدہ نے کہا : ہمیں ابو داود نے خبر دی ، کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : مجھے قتادہ نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی سے اسی طرح یابالکل اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 6350,
			"arabicnumber": "2468.03",
			"text": "امیہ بن خالد نے کہا : ہمیں شعبہ نے یہ حدیث دونوں سندوں سے ابو داود کی روایت کی طرح بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 6351,
			"arabicnumber": "2469.01",
			"text": "شیبان نے قتادہ سے روایت کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم کو سندس ( باریک ریشم ) کا ایک جبہ ہدیہ کیاگیا ، حالانکہ آپ ریشم ( پہننے ) سے منع فرماتے تھے ، لوگوں کو اس ( کی خوبصورتی ) سے تعجب ہوا ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کےہاتھ میں محمد کی جان ہے!جنت میں سعد بن معاذ کے رومال اس سے زیادہ اچھے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 6352,
			"arabicnumber": "2469.02",
			"text": "عمر بن عامر نے قتادہ سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ دومۃ الجندل کے ( بادشاہ ) اکیدرنے رسول اللہ صلی اللہ علیہ وسلم کو ایک حلہ ہدیہ کیا ، پھر اسی کے مانند بیان کیا ، البتہ اس میں یہ ذکر نہیں کیا : \" حالانکہ آپ صلی اللہ علیہ وسلم ریشم سے منع فرماتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 6353,
			"arabicnumber": "2470",
			"text": "ثابت نے ہمیں حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہ رسول اللہ صلی اللہ علیہ وسلم نے احد کے دن تلوار پکڑی اور فرمایا کہ یہ مجھ سے کون لیتا ہے؟ لوگوں نے ہاتھ پھیلائے اور ہر ایک کہتا تھا کہ میں لوں گا میں لوں گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کا حق کون ادا کرے گا؟ یہ سنتے ہی لوگ پیچھے ہٹے ( کیونکہ احد کے دن کافروں کا غلبہ تھا ) سیدنا سماک بن خرشہ ابودجانہ رضی اللہ عنہ نے کہا کہ میں اس کا حق ادا کروں گا ۔ پھر انہوں نے اس کو لے لیا اور مشرکوں کے سر اس تلوار سے چیرے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 6354,
			"arabicnumber": "2471.01",
			"text": "سفیان بن عیینہ نے کہا : میں نے ابن منکدر کو یہ کہتے ہوئے سنا : میں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سےسنا ، کہہ رہے تھے : جب احد کی جنگ ہوئی تو میرے والد کو کپڑے سے ڈھانپ کر لایاگیا ، ان کا مثلہ کیاگیا تھا ( ان کے چہرے تک کے اعضاء کاٹ دیے گئے تھے ) میں نے چاہا کہ میں کپڑا اٹھاؤں ( اوردیکھوں ) تو میری قوم کے لوگوں نے مجھے روک دیا ، میں نے پھر کپڑا اٹھانا چاہا تو میری قوم نے مجھے روک دیا ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے آکر کپڑا اٹھایا ، یا آپ صلی اللہ علیہ وسلم نے حکم دیا تو کپڑا اٹھایا گیا تو ( اس وقت ) ایک رونے والی یا چیخنے والی کی آواز آئی ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" یہ کون ہے؟ \" تو لوگوں نے بتایا : عمرو کی بیٹی ( شہید ہونے والے عبداللہ کی بہن ) ہے یا ( کہا : ) عمرو کی بہن ( شہید کی پھوپھی ) ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ کیوں روتی ہے؟ان ( کے جنازے ) کو اٹھائے جانے تک فرشتوں نے اپنے پروں سے ان پر سایہ کیا ہواہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 6355,
			"arabicnumber": "2471.02",
			"text": "شعبہ نے محمد بن منکدر سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ میرا باپ احد کے دن شہید ہوا تو میں اس کے منہ سے کپڑا اٹھاتا تھا اور روتا تھا ۔ لوگ مجھے منع کرتے تھے اور رسول اللہ صلی اللہ علیہ وسلم منع نہ کرتے تھے ۔ اور عمرو کی بیٹی فاطمہ ( یعنی میری پھوپھی ) وہ بھی اس پر رو رہی تھی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تو روئے یا نہ روئے ، تمہارے اسے اٹھانے تک فرشتے اس پر اپنے پروں کا سایہ کئے ہوئے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 6356,
			"arabicnumber": "2471.03",
			"text": "ابن جریج اور معمر دونوں نے محمد بن منکدر سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے یہی حدیث بیان کی ، مگر ابن جریج کی حدیث میں فرشتوں اور رونے والی کے رونے کا ذکر نہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 6357,
			"arabicnumber": "2471.04",
			"text": "عبدالکریم نے محمد بن منکدر سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : اُحد کے دن میرے والد کو اس طرح لایاگیا کہ ان کی ناک اور ان ک کان کاٹ دیے گئے تھے ، انھیں لا کررسول اللہ صلی اللہ علیہ وسلم کے سامنے ر کھ دیا گیا ، پھر ان سب کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 6358,
			"arabicnumber": "2472",
			"text": "حضرت ابو برزہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم اپنی ایک جنگ میں تھے ، اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کو ( فتح کے ساتھ ) مال غنیمت دیا ۔ آپ صلی اللہ علیہ وسلم نے اپنے لوگوں سے فرمایا کہ تم میں سے کوئی غائب تو نہیں ہے؟ لوگوں نے عرض کیا کہ ہاں فلاں فلاں فلاں شخص غائب ہیں ۔ پھر آپ صلی اللہ علیہ وسلم نے پوچھا کہ کوئی اور تو غائب نہیں ہے؟ لوگوں نے کہا کہ فلاں فلاں شخص غائب ہیں ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اور تو کوئی غائب نہیں ہے؟ لوگوں نے عرض کیا کہ کوئی نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ میں جلیبیب رضی اللہ عنہ کو نہیں دیکھتا ۔ لوگوں نے ان کو مردوں میں ڈھونڈا تو ان کی لاش سات لاشوں کے پاس پائی گئی جن کو سیدنا جلیبیب نے مارا تھا ۔ وہ سات کو مار کر شہید ہو گئے ۔ رسول اللہ صلی اللہ علیہ وسلم ان کے پاس آئے اور وہاں کھڑے ہو کر پھر فرمایا کہ اس نے سات آدمیوں کو مارا ، اس کے بعد خود مارا گیا ۔ یہ مجھ سے ہے اور میں اس سے ہوں ۔ پھر آپ صلی اللہ علیہ وسلم نے اس کو اپنے دونوں ہاتھوں پر رکھا اور صرف آپ صلی اللہ علیہ وسلم کے ہاتھ ہی اس کی چارپائی تھے ۔ اس کے بعد قبر کھدوا کر اس میں رکھ دیا ۔ اور راوی نے غسل کا بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 6359,
			"arabicnumber": "2473.01",
			"text": "ہداب بن خالد ازدی نے کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی ، کہا : ہمیں حمید بن ہلال نے عبداللہ بن صامت سے خبر دی ، انھوں نے کہا ، کہ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ میں ، میرا بھائی انیس اور ہماری ماں تینوں اپنی قوم غفار میں سے نکلے جو حرام مہینے کو بھی حلال سمجھتے تھے ۔ پس ہم اپنے ایک ماموں کے پاس اترے ۔ اس نے ہماری خاطر کی اور ہمارے ساتھ نیکی کی تو اس کی قوم نے ہم سے حسد کیا اور ( ہمارے ماموں سے ) کہنے لگے کہ جب تو اپنے گھر سے باہر نکلتا ہے تو انیس تیری بی بی کے ساتھ زنا کرتا ہے ۔ وہ ہمارے پاس آیا اور اس نے یہ بات ( حماقت سے ) مشہور کر دی ۔ میں نے کہا کہ تو نے ہمارے ساتھ جو احسان کیا تھا وہ بھی خراب ہو گیا ہے ، اب ہم تیرے ساتھ نہیں رہ سکتے ۔ آخر ہم اپنے اونٹوں کے پاس گئے اور اپنا اسباب لادا اور ہمارے ماموں نے اپنا کپڑا اوڑھ کر رونا شروع کر دیا ۔ ہم چلے ، یہاں تک کہ مکہ کے سامنے اترے ۔ انیس نے ہمارے اونٹوں کے ساتھ اتنے ہی اور کی شرط لگائی ۔ پھر دونوں کاہن کے پاس گئے تو کاہن نے انیس کو کہا کہ یہ بہتر ہے ۔ پس انیس ہمارے پاس سارے اونٹ اور اتنے ہی اور اونٹ لایا ۔ ابوذر نے کہا کہ اے میرے بھائی کے بیٹے! میں نے رسول اللہ صلی اللہ علیہ وسلم کی ملاقات سے پہلے تین برس پہلے نماز پڑھی ہے ۔ میں نے کہا کہ کس کے لئے پڑھتے تھے؟ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ اللہ تعالیٰ کے لئے ۔ میں نے کہا کہ کدھر منہ کرتے تھے؟ انہوں نے کہا کہ ادھر منہ کرتا تھا جدھر اللہ تعالیٰ میرا منہ کر دیتا تھا ۔ میں رات کے آخر حصہ میں عشاء کی نماز پڑھتا اور سورج طلوع ہونے تک کمبل کی طرح پڑ رہتا تھا ۔ انیس نے کہا کہ مجھے مکہ میں کام ہے ، تم یہاں رہو میں جاتا ہوں ۔ وہ گیا اور اس نے آنے میں دیر کی ۔ پھر آیا تو میں نے کہا کہ تو نے کیا کیا؟ وہ بولا کہ میں مکہ میں ایک شخص سے ملا جو تیرے دین پر ہے اور وہ کہتا ہے کہ اللہ تعالیٰ نے اس کو بھیجا ہے ۔ میں نے کہا کہ لوگ اسے کیا کہتے ہیں؟ اس نے کہا کہ لوگ اس کو شاعر ، کاہن اور جادوگر کہتے ہیں ۔ اور انیس خود بھی شاعر تھا ۔ اس نے کہا کہ میں نے کاہنوں کی بات سنی ہے لیکن جو کلام یہ شخص پڑھتا ہے وہ کاہنوں کا کلام نہیں ہے اور میں نے اس کا کلام شعر کے تمام بحروں پر رکھا تو وہ کسی کی زبان پر میرے بعد شعر کی طرح نہ جڑے گا ۔ اللہ کی قسم وہ سچا ہے اور لوگ جھوٹے ہیں ۔ میں نے کہا کہ تم یہاں رہو میں اس شخص کو جا کر دیکھتا ہوں ۔ پھر میں مکہ میں آیا تو میں نے ایک ناتواں شخص کو مکہ والوں میں سے چھانٹا ( اس لئے کہ طاقتور شخص شاید مجھے کوئی تکلیف پہنچائے ) ، اور اس سے پوچھا کہ وہ شخص کہاں ہے جس کو تم صابی ( بےدین ) کہتے ہو؟ اس نے میری طرف اشارہ کیا اور کہا کہ یہ صابی ہے ( جب تو صابی کا پوچھتا ہے ) یہ سن کر تمام وادی والوں نے ڈھیلے اور ہڈیاں لے کر مجھ پر حملہ کر دیا ، یہاں تک کہ میں بیہوش ہو کر گر پڑا ۔ جب میں ہوش میں آ کر اٹھا تو کیا دیکھتا ہوں کہ گویا میں لال بت ہوں ( یعنی سر سے پیر تک خون سے سرخ ہوں ) ۔ پھر میں زمزم کے پاس آیا اور میں نے سب خون دھویا اور زمزم کا پانی پیا ۔ پس اے میرے بھتیجے! میں وہاں تیس راتیں یا تیس دن رہا اور میرے پاس سوائے زمزم کے پانی کے کوئی کھانا نہ تھا ( جب بھوک لگتی تو میں اسی کو پیتا ) ۔ پھر میں موٹا ہو گیا یہاں تک کہ میرے پیٹ کی بٹیں ( موٹاپے سے ) جھک گئیں اور میں نے اپنے کلیجہ میں بھوک کی ناتوانی نہیں پائی ۔ ایک بار مکہ والے چاندنی رات میں سو گئے کہ اس وقت بیت اللہ کا طواف کوئی نہ کرتا تھا ، صرف دو عورتیں اساف اور نائلہ کو پکار رہی تھیں ( اساف اور نائلہ مکہ میں دو بت تھے اساف مرد تھا اور نائلہ عورت تھی اور کفار کا یہ اعتقاد تھا کہ ان دونوں نے وہاں زنا کیا تھا ، اس وجہ سے مسخ ہو کر بت ہو گئے تھے ) ، وہ طواف کرتی کرتی میرے سامنے آئیں ۔ میں نے کہا کہ ایک کا نکاح دوسرے سے کر دو ( یعنی اساف کا نائلہ سے ) ۔ یہ سن کر بھی وہ اپنی بات سے باز نہ آئیں ۔ پھر میں نے صاف کہہ دیا کہ ان کے فلاں میں لکڑی ( یعنی یہ فخش اساف اور نائلہ کی پرستش کی وجہ سے ) اور میں نے کنایہ نہ کیا ( یعنی کنایہ اشارہ میں میں نے گالی نہیں دی بلکہ ان مردود عورتوں کو غصہ دلانے کے لئے اساف اور نائلہ کو کھلم کھلا گالی دی ، جو اللہ تعالیٰ کے گھر میں اللہ کو چھوڑ کر اساف اور نائلہ کو پکارتی تھیں ) یہ سن کر وہ دونوں عورتیں چلاتی اور کہتی ہوئی چلیں کہ کاش اس وقت ہمارے لوگوں میں سے کوئی ہوتا ( جو اس شخص کو بے ادبی کی سزا دیتا ) ۔ راہ میں ان عورتوں کو رسول اللہ صلی اللہ علیہ وسلم اور سیدنا ابوبکر رضی اللہ عنہ ملے اور وہ پہاڑ سے اتر رہے تھے ۔ انہوں نے عورتوں سے پوچھا کہ کیا ہوا؟ وہ بولیں کہ ایک صابی آیا ہے جو کعبہ کے پردوں میں چھپا ہوا ہے ۔ انہوں نے کہا کہ اس صابی نے کیا کہا؟ وہ بولیں کہ ایسی بات بولا جس سے منہ بھر جاتا ہے ( یعنی اس کو زبان سے نہیں نکال سکتیں ) ۔ اور رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، یہاں تک حجراسود کو بوسہ دیا اور اپنے ساتھی کے ساتھ طواف کیا اور نماز پڑھی ۔ جب نماز پڑھ چکے تو سیدنا ابوذر رضی اللہ عنہ نے کہا کہ اول میں نے ہی سلام کی سنت ادا کی اور کہا کہ السلام علیکم یا رسول اللہ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ وعلیک ورحمۃ اللہ ۔ پھر پوچھا کہ تو کون ہے؟ میں نے کہا کہ غفار کا ایک شخص ہوں ۔ آپ صلی اللہ علیہ وسلم نے ہاتھ جھکایا اور اپنی انگلیاں پیشانی پر رکھیں ( جیسے کوئی ذکر کرتا ہے ) میں نے اپنے دل میں کہا کہ شاید آپ صلی اللہ علیہ وسلم کو یہ کہنا برا معلوم ہوا کہ میں ( قبیلہ ) غفار میں سے ہوں ۔ میں آپ صلی اللہ علیہ وسلم کا ہاتھ پکڑنے کو لپکا لیکن آپ صلی اللہ علیہ وسلم کے ساتھی ( سیدنا ابوبکر رضی اللہ عنہ ) نے جو مجھ سے زیادہ آپ صلی اللہ علیہ وسلم کا حال جانتے تھے مجھے روکا ، پھر آپ صلی اللہ علیہ وسلم نے سر اٹھایا اور فرمایا کہ تو یہاں کب آیا؟ میں نے عرض کیا میں یہاں تیس رات یا دن سے ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تجھے کھانا کون کھلاتا ہے؟ میں نے کہا کہ کھانا وغیرہ کچھ نہیں سوائے زمزم کے پانی کے ۔ پھر میں موٹا ہو گیا یہاں تک کہ میرے پیٹ کے بٹ مڑ گئے اور میں اپنے کلیجہ میں بھوک کی ناتوانی نہیں پاتا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ زمزم کا پانی برکت والا ہے اور وہ کھانا بھی ہے اور کھانے کی طرح پیٹ بھر دیتا ہے ۔ سیدنا ابوبکر رضی اللہ عنہ نے کہا کہ یا رسول اللہ! آج کی رات اس کو کھلانے کی اجازت مجھے دیجئے ۔ پھر رسول اللہ صلی اللہ علیہ وسلم چلے اور سیدنا ابوبکر رضی اللہ عنہ بھی میں بھی ان دونوں کے ساتھ چلا ۔ سیدنا ابوبکر رضی اللہ عنہ نے ایک دروازہ کھولا اور اس میں سے طائف کی سوکھی ہوئی کشمش نکالیں ، یہ پہلا کھانا تھا جو میں نے مکہ میں کھایا ۔ پھر میں رہا جب تک کہ رہا ، اس کے بعد رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ مجھے ایک کھجور والی زمین دکھلائی گئی ہے میں سمجھتا ہوں کہ وہ زمین یثرب کے سوا کوئی اور نہیں ہے ۔ ( یثرب مدینہ کا نام تھا ) ، پس تو میری طرف سے اپنی قوم کو دین کی دعوت دے ، شاید اللہ تعالیٰ ان کو تیری وجہ سے نفع دے اور تجھے ثواب دے ۔ میں انیس کے پاس آیا تو اس نے پوچھا کہ تو نے کیا کیا؟ میں نے کہا کہ میں اسلام لایا اور میں نے آپ صلی اللہ علیہ وسلم کی نبوت کی تصدیق کی ۔ وہ بولا کہ تمہارے دین سے مجھے بھی نفرت نہیں ہے میں بھی اسلام لایا اور میں نے آپ صلی اللہ علیہ وسلم کی نبوت کی تصدیق کی ۔ پھر ہم دونوں اپنی ماں کے پاس آئے وہ بولی کہ مجھے بھی تم دونوں کے دین سے نفرت نہیں ہے میں بھی اسلام لائی اور میں نے تصدیق کی ۔ پھر ہم نے اونٹوں پر اسباب لادا ، یہاں تک کہ ہم اپنی قوم غفار میں پہنچے ۔ آدھی قوم تو مسلمان ہو گئی اور ان کا امام ایماء بن رحضہ غفاری تھا وہ ان کا سردار بھی تھا ۔ اور آدھی قوم نے یہ کہا کہ جب رسول اللہ صلی اللہ علیہ وسلم مدینہ میں تشریف لائیں گے تو ہم مسلمان ہوں گے ، پھر رسول اللہ صلی اللہ علیہ وسلم مدینہ میں تشریف لائے اور آدھی قوم جو باقی تھی وہ بھی مسلمان ہو گئی اور ( قبیلہ ) اسلم کے لوگ آئے اور انہوں نے کہا کہ یا رسول اللہ! ہم بھی اپنے غفاری بھائیوں کی طرح مسلمان ہوتے ہیں تو وہ بھی مسلمان ہو گئے تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ غفار کو اللہ نے بخش دیا اور اسلم کو اللہ تعالیٰ نے بچا دیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 6360,
			"arabicnumber": "2473.02",
			"text": "ہمیں نضر بن شمیل نے خبر دی ، کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی ، کہا : ہمیں حمید بن ہلال نے اسی سند کے ساتھ روایت کی اورابو زر رضی اللہ تعالیٰ عنہ کے قول : ۔ ۔ ۔ میں نے کہا : اب میری طرف سے تو ( سب کام ) سنبھال تاکہ میں جاؤں اور دیکھوں ۔ کے بعد مزید یہ کہا : اس نے کہا : ہاں اور اہل مکہ سے محتاط رہنا کیونکہہ وہ ان ( رسول اللہ صلی اللہ علیہ وسلم ) سے نفرت کرنے لگے ہیں اور بُری طرح پیش آتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 6361,
			"arabicnumber": "2473.03",
			"text": "ابن عون نے حمید بن ہلال سے ، انھوں نے عبداللہ بن صامت سے روایت کی ، کہا : حضرت ابوزر رضی اللہ تعالیٰ عنہ نےکہا : بھتیجے!میں نے نبی کریم صلی اللہ علیہ وسلم کی بعثت سے دو سال پہلے نماز پڑھی ہے ، کہا : میں نے پوچھا : آپ کس طرف رخ کیاکرتے تھے؟انھوں نے کہا : جس طرح اللہ تعالیٰ میرا رخ کردیتاتھا؟پھر ( ابن عون نے ) سلیمان بن مغیرہ کی حدیث کی طرح حدیث بیان کی اور حدیث میں یہ کہا : \" ان دونوں کا آپس میں مقابلہ کاہنوں میں سے ایک آدمی کے سامنے ہوا اور میرا بھائی انیس ( اشعار میں مسلسل ) اس ( کاہن ) کی مدح کرتا رہا یہاں تک کہ اس شخص پر غالب آگیا تو ہم نے اس کا گلہ بھی لے لیا اور اسے اپنے گلے میں شامل کرلیا ۔ انھوں نے اپنی حدیث میں یہ بھی کہا : ( ابوزر رضی اللہ تعالیٰ عنہ نے ) کہا : تو رسول اللہ صلی اللہ علیہ وسلم تشریف لے آئے ، بیت اللہ کاطواف کیا اور مقام ابراہیم کے پیچھے دو رکعتیں ادا کیں ۔ کہا : تو میں آپ کی خدمت میں حاضر ہوا اور میں پہلا شخص ہوں جس نے آپ کو اسلامی طریقے سے سلام کیا ۔ تو کہا : میں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !آپ پر سلامتی ہو!آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" اورتم پر بھی سلامتی ہو!تم کون ہو؟اور ان کی حدیث میں یہ بھی ہے : آپ نے پوچھا : \" تم کتنے دنوں سے یہاں ہو؟ \" کہا : میں نے عرض کی : پندرہ دن سے ، اور اس میں یہ ( بھی ) ہے کہ کہا : ابو بکر رضی اللہ تعالیٰ عنہ نے کہا : اس کی آج رات کی میزبانی بطور تحفہ مجھے عطا کردیجئے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 6362,
			"arabicnumber": "2474",
			"text": "ابو جمرہ نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ جب سیدنا ابوذر رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم کے مکہ میں مبعوث ہونے کی خبر پہنچی تو انہوں نے اپنے بھائی سے کہا کہ سوار ہو کر اس وادی کو جا اور اس شخص کو دیکھ کر آ جو کہتا ہے مجھے آسمان سے خبر آتی ہے ، ان کی بات سن پھر میرے پاس آ ۔ وہ روانہ ہوا ، یہاں تک کہ مکہ میں آیا اور آپ صلی اللہ علیہ وسلم کا کلام سنا ، پھر سیدنا ابوذر رضی اللہ عنہ کے پاس لوٹ کر گیا اور بولا کہ میں نے اس شخص کو دیکھا ، وہ اچھی خصلتوں کا حکم کرتا ہے اور ایک کلام سناتا ہے جو شعر نہیں ہے ۔ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ مجھے اس سے تسلی نہیں ہوئی ۔ پھر انہوں نے خود زادراہ لیا اور پانی کی ایک مشک لی یہاں تک کہ مکہ میں آئے اور مسجدالحرام میں داخل ہوئے ۔ وہاں رسول اللہ صلی اللہ علیہ وسلم کو ڈھونڈا اور وہ آپ صلی اللہ علیہ وسلم کو پہچانتے نہ تھے اور انہوں نے پوچھنا بھی مناسب نہ جانا ، یہاں تک کہ رات ہو گئی اور وہ لیٹ رہے ۔ سیدنا علی رضی اللہ عنہ نے ان کو دیکھا اور پہچانا کہ کوئی مسافر ہے پھر ان کے پیچھے گئے لیکن کسی نے دوسرے سے بات نہیں کی یہاں تک کہ صبح ہو گئی ۔ پھر وہ اپنا توشہ اور مشک مسجد میں اٹھا لائے اور سارا دن وہاں رہے اور رسول اللہ صلی اللہ علیہ وسلم کو شام تک نہ دیکھا ۔ پھر وہ اپنے سونے کی جگہ میں چلے گئے ۔ وہاں سے سیدنا علی رضی اللہ عنہ گزرے اور کہا کہ ابھی وہ وقت نہیں آیا کہ اس شخص کو اپنا ٹھکانہ معلوم ہو ۔ پھر ان کو کھڑا کیا اور ان کو ساتھ لے گئے لیکن کسی نے دوسرے سے بات نہ کی ۔ پھر تیسرے دن بھی ایسا ہی ہوا ۔ اور سیدنا علی رضی اللہ عنہ نے ان کو اپنے ساتھ کھڑا کیا ، پھر کہا کہ تم مجھ سے وہ بات کیوں نہیں کہتے جس کے لئے تم اس شہر میں آئے ہو؟ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ اگر تم مجھ سے عہد اور وعدہ کرتے ہو کہ راہ بتلاؤ گے تو میں بتاتا ہوں ۔ سیدنا علی رضی اللہ عنہ نے وعدہ کیا تو انہوں نے بتایا ۔ سیدنا علی رضی اللہ عنہ نے کہا کہ وہ شخص سچے ہیں اور وہ بیشک اللہ تعالیٰ کے رسول ہیں اور تم صبح کو میرے ساتھ چلنا ، اگر میں کوئی خوف کی بات دیکھوں گا جس میں تمہاری جان کا ڈر ہو تو میں کھڑا ہو جاؤں گا جیسے کوئی پانی بہاتا ہے ( یعنی پیشاب کا بہانہ کروں گا ) اور اگر چلا جاؤں تو تم بھی میرے پیچھے پیچھے چلے آنا ۔ جہاں میں گھسوں وہاں تم بھی گھس آنا ۔ سیدنا ابوذر رضی اللہ عنہ نے ایسا ہی کیا اور ان کے پیچھے پیچھے چلے یہاں تک کہ سیدنا علی رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے اور سیدنا ابوذر رضی اللہ عنہ بھی ان کے ساتھ پہنچے ۔ پھر سیدنا ابوذر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کی باتیں سنیں اور اسی جگہ مسلمان ہوئے اور رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اپنی قوم کے پاس جا اور ان کو دین کی خبر کر یہاں تک کہ میرا حکم تجھے پہنچے ۔ سیدنا ابوذر رضی اللہ عنہ نے کہا کہ قسم اس کی جس کے ہاتھ میں میری جان ہے کہ میں تو یہ بات ( یعنی دین قبول کرنے کی ) مکہ والوں کو پکار کر سنا دوں گا ۔ پھر سیدنا ابوذر رضی اللہ عنہ نکل کر مسجد میں آئے اور چلا کر بولے کہ ”میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں ہے اور محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول ہیں“ ۔ لوگوں نے ان پر حملہ کیا اور ان کو مارتے مارتے لٹا دیا ۔ سیدنا عباس رضی اللہ عنہ وہاں آئے اور سیدنا ابوذر رضی اللہ عنہ پر جھکے اور لوگوں سے کہا کہ تمہای خرابی ہو ، تم نہیں جانتے کہ یہ شخص ( قوم ) غفار کا ہے اور تمہارا سوداگری کا راستہ شام کی طرف ( قوم ) غفار کے ملک پر سے ہے ( تو وہ تمہاری تجارت بند کر دیں گے ) ۔ پھر سیدنا ابوذر رضی اللہ عنہ کو ان لوگوں سے چھڑا لیا ۔ سیدنا ابوذر رضی اللہ عنہ نے دوسرے دن پھر ویسا ہی کیا اور لوگ دوڑے اور مارا اور سیدنا عباس رضی اللہ عنہ آئے اور انہیں چھڑا لیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 6363,
			"arabicnumber": "2475.01",
			"text": "یحییٰ بن یحییٰ تمیمی اور عبد الحمید بن بیان واسطی نے خالد بن عبد اللہ سے ، انھوں نے بیان سے روایت کی ، کہا : میں نے قیس بن ابی حازم رضی اللہ تعالیٰ عنہ کو یہ کہتے ہو ئے سنا ، حضرت جریر بن عبد اللہ رضی اللہ تعالیٰ عنہ نے کہا : میں نے جب سے اسلام قبول کیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے مجھے کبھی اپنے حجرے سے باہر نہیں روکا اور آپ نے جب بھی مجھے دیکھا آپ ہنس دیے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 6364,
			"arabicnumber": "2475.02",
			"text": "بو بکربن ابی شیبہ نے کہا : ہمیں وکیع اور ابو اسامہ نے اسماعیل سے حدیث بیان کی ، نیز ابن نمیر نے کہا : ہمیں عبد اللہ بن ادریس نے حدیث بیان کی ، کہا : ہمیں اسماعیل نے قیس سے حدیث بیان کی ، انھوں نے حضرت جریر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : جب سے میں اسلام لا یا ہوں رسول اللہ صلی اللہ علیہ وسلم نے مجھے کبھی گھر سے باہر نہیں رو کا اور آپ نے کبھی مجھے نہیں مگر آپ ہمیشہ میرے سامنے مسکرا ئے ہیں ۔ ابن نمیر نے ابن ادریس سے اپنی روایت میں مزید یہ کہا : میں نے آپ سے شکا یت کی کہ میں گھوڑےپر جم کر نہیں بیٹھ سکتا تو آپ نے میرے سینے پر اپنا ہاتھ مارا اور فر ما یا : \" اے اللہ!اسے ثبات ( مضبوطی ) عطا کر اور اسے ہدایت پہنچانے والاہدایت پا نے والابنا دے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 6365,
			"arabicnumber": "2476.01",
			"text": "عبد الحمید بن بیان نے کہا : ہمیں خ رحمۃ اللہ علیہ الد نے بیان سے خبر دی ، انھوں نے قیس سے ، انھوں نے حضرت جریر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : زمانہ جاہلیت میں ایک عبادت گاہ تھی جس کو ذوالخلصہ کہتے تھے اور اس کو کعبہ یمانیہ اور کعبہ شامیہ بھی کہا جا تا تھا رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرما یا : \" کیا تم مجھے ذوالخلصہ کعبہ یمانیہ اور کعبہ شامیہ کی اذیت سے راحت دلا ؤ گے؟ \" تو میں قبیلہ احمس کے ڈیڑھ سو جوانوں کے ساتھ اس کی طرف گیا ۔ ہم نے اس بت خانے کو تو ڑ دیا اور جن لو گوں کو وہاں پا یا ان سب کو قتل کر دیا پھر میں آپ کی خدمت میں حاضر ہوا اور آپ کو خبر سنائی تو آپ نے ہمارے لیے اور ( پورے ) قبیلہ احمس کے لیے دعا فر ما ئی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 6366,
			"arabicnumber": "2476.02",
			"text": "جریر نے اسماعیل بن ابی خالد سے انھوں نے قیس بن ابی حازم سے ، انھوں نے حضرت جریر بن عبد اللہ بجلی رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فر ما یا : \" جریر!کیا تم مجھے ذوالخلصہ سے راحت نہیں دلا ؤ گے؟ \" یہ خثعم کا بت خانہ تھا جسے کعبہ یمانیہ بھی کہا جا تا تھا ۔ حضرت جریر رضی اللہ تعالیٰ عنہ نے کہا : پھر میں ڈیڑھ سو گھڑسوار لے کر اس کی طرف روانہ ہوا اور میں گھوڑے پر جم کر نہیں بیٹھ سکتا تھا ، میں نے رسول اللہ صلی اللہ علیہ وسلم سے یہ بات عرض کی تو آپ نے میرے سینے پر اپنا مبارک ہاتھ مارا اور دعا فر ما یا : \" اے اللہ !اس کو ( گھوڑے پر ) جماد ے اور اسے ہدایت پہنچانے والا ہدایت پانے والا بنادے ۔ \" ( قیس بن ابی حازم نے ) کہا؛ پھر وہ روانہ ہو ئے اور اس بت خانے کو آگ لگا کر جلا دیا ، پھر حضرت جریر رضی اللہ تعالیٰ عنہ نے ایک شخص کو رسول اللہ صلی اللہ علیہ وسلم کے پاس خوشخبری دینے کے لیے روانہ کیا ۔ اس کی کنیت ابوار طاۃ تھی وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ سے عرض کی ، میں آپ کے پاس اسی وقت حاضر ہوا ہوں جب ہم نے اس ( بت خانے ) کو خارش زدہ اونٹ کی طرح ( دیکھنے میں مکروہ ٹوٹا پھوٹا ) کر چھوڑا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے قبیلہ احمس کے سواروں اور پیا دوں کے لیے پانچ مرتبہ برکت کی دعا فر ما ئی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 6367,
			"arabicnumber": "2476.03",
			"text": "وکیع عبد اللہ بن نمیر ، سفیان ، مروان فرازی اور ابو اسامہ سب نے اسماعیل سے اسی سند کے ساتھ روایت کی ، اور مروان کی حدیث میں کہا : تو حضرت جریر رضی اللہ تعالیٰ عنہ کی طرف سے خوش خبری دینے والے ابو ارطاۃ حصین بن ربیعہ رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کو خوش خبری دینے والے کے لیے آئے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 6368,
			"arabicnumber": "2477",
			"text": "زہیر بن حرب اور ابو بکر بن نضر نے کہا : ہمیں ہاشم بن قاسم نے حدیث بیان کی ، کہا : ہمیں ورقا ء بن عمر یشکری نے حدیث سنائی ، انھوں نے کہا : میں نے عبید اللہ بن ابی یزید رضی اللہ تعالیٰ عنہ کو حضرت عبد اللہ بن عباس رضی اللہ تعالیٰ عنہ سے روایت کرتے ہو ئے سنا ، رسول اللہ صلی اللہ علیہ وسلم باہر ( انسانوں سے ) خالی علاقے میں تشریف لے گئے میں نے ( اس دورا ن میں ) آپ کے لیے وضوکا پا نی رکھ دیا ۔ جب آپ آئے تو آپ نے پو چھا : \" یہ پانی کس نے رکھا ہے ۔ ؟ ۔ ۔ ۔ زہیر کی روایت میں ہے ۔ لوگوں نے کہا : اور ابوبکر کی روایت میں ہے ۔ میں نے کہا ۔ ۔ ۔ ابن عباس رضی اللہ تعالیٰ عنہ نے ۔ آپ نے فر ما یا : \" اے اللہ !اسے دین کا گہرا فہم عطا کر ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 6369,
			"arabicnumber": "2478",
			"text": "نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے خواب میں دیکھا کہ میرے ہاتھ میں باریک ریشم کا ایک ٹکڑا ہے اور جنت میں کو ئی بھی جگہ جہاں میں جا نا چاہ رہا ہوں ، وہ مجھے اڑا کر وہاں لے جا تا ہے ۔ کہا : میں نے یہ خواب حضرت حفصہ رضی اللہ تعالیٰ عنہا کو بتا یا حضرت حفصہ رضی اللہ تعالیٰ عنہا نے نبی صلی اللہ علیہ وسلم سے بیان کیا تو نبی صلی اللہ علیہ وسلم نے فر ما یا : \" میں عبد اللہ ( ابن عمر ) کو ایک نیک آدمی دیکھتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 6370,
			"arabicnumber": "2479.01",
			"text": "زہری نے سالم سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کی حیات مبارکہ میں جو شخص کو ئی خواب دیکھتا تو وہ اس کو رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کرتا ، میری بھی آرزوتھی کہ میں بھی کو ئی خواب دیکھوں اور اس کو رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کروں ۔ میں ایک غیر شادی شدہ نو جوان تھا اور رسول اللہ صلی اللہ علیہ وسلم کے زمانےمیں مسجد میں سویا کرتا تھا ، میں نے خواب میں دیکھا کہ جیسے دوفرشتوں نے مجھے پکڑا اور جہنم کی طرف لے گئے ۔ میں نے دیکھا کہ دوزخ کے کنارے پر کنویں کی منڈیر کی طرح تہ در تہ منڈیر بنی ہو ئی ہے اور اس کے دو ستون ہیں جس طرح کنویں کے ستون ہو تے ہیں اور اس کے اندر لو گ ہیں جن کو میں پہچانتا ہوں تو میں نے کہنا شروع کر دیا ۔ میں آگ سے اللہ کی پناہ میں آتا ہوں ، میں آگ سے اللہ کی پناہ میں آتا ہوں آگ سے اللہ کی پناہ میں آتا ہوں ۔ کہا : تو ان دونوں فرشتوں سے ایک اور فرشتہ آکر ملا ، اس نے مجھ سے کہا : تم مت ڈرو ۔ میں نے یہ خواب حضرت حفصہ رضی اللہ تعالیٰ عنہا سے بیان کیا ، حضرت حفصہ رسول اللہ صلی اللہ علیہ وسلم سے بیان کیا تو نبی صلی اللہ علیہ وسلم نے فر ما یا : \" عبد اللہ خوب آدمی ہے! اگر یہ رات کو اٹھ کر نماز پڑھا کرے ۔ \" سالم نے کہا : اس کے بعد حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ رات کو بہت کم سوتے تھے ۔ ( زیادہ وقت نماز پڑھتے تھے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 6371,
			"arabicnumber": "2479.02",
			"text": "عبید اللہ بن عمر نے نافع سے ، انھوں نے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں را ت کو مسجد میں سوتا تھا ( اس وقت ) میرے اہل وعیال نہ تھے میں نے خواب میں دیکھا کہ جیسے مجھے ایک کنویں کی طرف لے جا یا گیا ہے پھر انھوں نے نبی صلی اللہ علیہ وسلم سے اسی حدیث کےہم معنی بیان کیا جو زہری نے سالم سے اور انھوں نے اپنے والد ( عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 6372,
			"arabicnumber": "2480.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث سنائی ، انھوں نے کہا : میں نے قتادہ سے سنا ، وہ حضرت انس رضی اللہ تعالیٰ عنہ سے حدیث بیان کررہے تھے ، انھوں نے حضرت ام سلیم رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !انس آپ کا خادم ہے آپ اس کے لیے اللہ سے دعا کیجئے تو آپ نے کہا : : \" اے اللہ !اس کے مال اور اولاد کو زیادہ کر اور اس کو جو کچھ تو نے عطا کیا ہے ، اس میں برکت عطافر ما",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 6373,
			"arabicnumber": "2480.02",
			"text": "ابو داود نے کہا : ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، میں نے حضرت انس رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا ، حضرت ام سلیم رضی اللہ تعالیٰ عنہا نے عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !انس آپ کا خادم ہے ، پھر اسی طرح بیان کیا ( جس طرح پچھلی حدیث میں ہے)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 6374,
			"arabicnumber": "2480.03",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے ہشام بن زید سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ کو اسی طرح کہتے ہوئے سنا ( جس طرح پچھلی حدیث میں ہے)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 6375,
			"arabicnumber": "2481.01",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم ہمارے ہاں تشریف لا ئے ، اس وقت گھر میں صرف میں میری والدہ اور میری خالہ ام حرا م رضی اللہ تعالیٰ عنہا تھیں ، میری والدہ نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! انس آپ کا چھوٹاسا خادم ہے آپ اس کے لیے اللہ سے دعا کیجئے ۔ آپ نے میرے لیے ہر بھلا ئی کی دعا کی ، آپ نے میرے لیے جو دعاکی اس کے آخر میں آپ نے فر ما یا : \" اے اللہ !اس کے مال اور اولاد کو زیادہ کر اور اس کو برکت عطافر ما",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 6376,
			"arabicnumber": "2481.02",
			"text": "اسحٰق نے کہا : مجھے حضرت انس رضی اللہ تعالیٰ عنہ نے حدیث سنائی کہا : میری والدہ ام انس رضی اللہ تعالیٰ عنہا مجھے لے کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آئیں ، انھوں نے اپنی آدھی اوڑھنی سے میری کمر پر چادر باندھ دی تھی اور اوڑھنی میرے شانوں پر ڈال دی تھی ۔ انھوں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! یہ انیس ( انس کی تصغیر ) ہے میرا بیٹا ہے ، میں اسے آپ کے پاس لا ئی ہوں تا کہ یہ آپ کی خدمت کرے ، آپ اس کے لیےاللہ سے دعاکریں تو آپ نے فر ما یا : \" اے اللہ !اس کے مال اور اولاد کو زیادہ کر ۔ حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : اللہ کی قسم!میرا مال بہت زیادہ ہے اور آج میری اولاداور اولاد کی اولاد کی گنتی سو کے لگ بھگ ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 6377,
			"arabicnumber": "2481.03",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم ( ہمارے گھر کے قریب سے ) گزرے میری والدہ ام سلیم رضی اللہ تعالیٰ عنہا نے آپ کی آواز سنی انھوں نے کہا : یا رسول اللہ صلی اللہ علیہ وسلم ! میرے ماں باپ آپ پر قربان !یہ انیس ہے اس کے لیے دعا فر مائیے پھر رسول اللہ صلی اللہ علیہ وسلم نے میرے لیے تین دعائیں کیں ۔ جن میں سے دو دعاؤں ( کی قبولیت ) کو میں نے دیکھ لیا اور تیسری ( کی قبولیت ) کے متعلق آخرت میں امید رکھتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 6378,
			"arabicnumber": "2482.01",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہا : رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لا ئے اس وقت میں لڑکوں کے ساتھ کھیل رہا تھا کہا : آپ نے ہم سب کو سلام کیا اور مجھے کسی کام کے لیے بھیج دیا تو میں اپنی والد ہ کے پاس تا خیر سے پہنچا ، جب میں آیا تو والدہ نے پو چھا : تمھیں دیر کیوں ہوئی ۔ ؟میں نے کہا : مجھے رسول اللہ صلی اللہ علیہ وسلم نے کسی کا م سے بھیجا تھا ۔ انھوں نے پو چھا : آپ کا وہ کام کیا تھا؟ میں نے کہا : وہ ایک راز ہے ۔ میری والدہ نے کہا : تم رسول اللہ صلی اللہ علیہ وسلم کا راز کسی پر افشانہ کرنا ۔ حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : اللہ کی قسم! ثابت !اگر میں وہ راز کسی کو بتاتاتو تمہیں ( جو رسول اللہ صلی اللہ علیہ وسلم کی حدیث کے طلبگار ہو ) ضرور بتا تا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 6379,
			"arabicnumber": "2482.02",
			"text": "معتمر بن سلیمان نے کہا : میں نے اپنے والد سے سنا ، وہ حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کر رہے تھے ۔ ( کہ حضرت انس رضی اللہ تعالیٰ عنہ ) نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ایک راز میں مجھے شریک کیا ۔ میں نے اب تک وہ راز کسی کو نہیں بتا یا میری والد ہ حضرت ام سلیم رضی اللہ تعالیٰ عنہا نے اس کے متعلق پو چھا ، میں نے وہ راز ان کو بھی نہیں بتا یا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 6380,
			"arabicnumber": "2383",
			"text": "عامر بن سعد نے کہا : میں نے اپنے والد کو یہ کہتے ہو ئے سنا ، میں نے حضرت عبد اللہ بن سلام رضی اللہ تعالیٰ عنہ کے علاوہ کسی زندہ چلتے پھرتے شخص کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے یہ نہیں سنا ، بلا شبہ وہ جنت میں جا ئے گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 6381,
			"arabicnumber": "2484.01",
			"text": "معاذ بن معاذ نے کہا : ہمیں عبداللہ بن عون نے محمد بن سیرین سے حدیث بیان کی ، انھوں نے قیس بن عباد سے روایت کی ، کہا : میں مدینہ منورہ میں کچھ لوگوں کےساتھ تھا جن میں نبی کریم صلی اللہ علیہ وسلم کے بعض صحابہ رضوان اللہ عنھم اجمعین بھی تھے ، پھر ایک شخص آیا جس کے چہرے پر خشوع کا اثر ( نظر آتا ) تھا ، لوگوں میں سے ایک نے کہا : یہ اہل جنت میں سے ایک آدمی ہے ۔ اس آدمی نے دو رکعت نماز پڑھی جن میں اختصار کیا پھر چلاگیا ۔ میں بھی اس کے پیچھے گیا ، پھر وہ اپنے گھر میں داخل ہوگیا ، میں بھی ( اجازت ) لے کر اندر گیا ، پھر ہم نے آپس میں باتیں کیں ۔ جب وہ کچھ میرے ساتھ مانوس ہوگئے تو میں نے ان سے کہا : جب آپ ( کچھ دیر ) پہلے مسجد میں آئے تھے تو آپ کے متعلق ایک شخص نے اس طرح کہاتھا ۔ انھوں نے کہا : سبحان اللہ!کسی شخص کے لئے مناسب نہیں کہ وہ کوئی بات کہے جس کا اسے پوری طرح علم نہیں اورمیں تمھیں بتاتا ہوں کہ یہ کیونکر ہوا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ایک خواب دیکھا اور وہ خواب آپ کے سامنے بیان کیا ۔ میں نے اپنے آپ کو ایک باغ میں دیکھا ۔ انھوں نے اس باغ کی وسعت ، اس کے پودوں اور اس کی شادابی کے بارے میں بتایا ۔ باغ کے وسط میں لوہے کا ایک ستون تھا ، اس کا نیچے کا حصہ زمین کے اندر تھا اور اسکے اوپر کا حصہ آسمان میں تھا ، اس کے اوپر کی جانب ایک حلقہ تھا ، مجھ سے کہا گیا : اس پرچڑھو ۔ میں نے کہا؛میں اس پر نہیں چڑھ سکتا ، پھر ایک منصف آیا ۔ ابن عون نے کہا : منصف ( سے مراد ) خادم ہےاس نے میرے پیچھے سے میرے کپڑے تھام لیے اور انھوں ( عبداللہ بن سلام رضی اللہ تعالیٰ عنہ ) نے واضح کیا کہ اس نے اپنے ہاتھ سے انھیں پیچھے سےاوپر اٹھایا تو میں اوپر چڑھ گیا یہاں تک کہ میں ستون کی چوٹی پر پہنچ گیا اور حلقے کو پکڑ لیا تو مجھ سےکہا گیا : اس کو مضبوطی سے پکڑ رکھو اور وہ میرے ہاتھ ہی میں تھا کہ میں جاگ گیا ۔ میں نے یہ ( خواب ) رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" وہ باغ اسلام ہے ۔ اور وہ ستون اسلام کا ستون ہے اور وہ حلقہ ( ایمان کا ) مضبوط حلقہ ہے اور تم موت تک اسلام پر رہو گے ۔ \"\" ( قیس بن عباد نے ) کہا : اور وہ شخص عبداللہ بن سلام رضی اللہ تعالیٰ عنہ تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 6382,
			"arabicnumber": "2484.02",
			"text": "قرہ بن خالد نے ہمیں محمد بن سیرین سے حدیث سنائی انھوں نے کہا : قیس بن عباد نے کہا : میں ایک مجلس میں بیٹھا تھا جس میں حضرت سعد بن مالک اور حضرت ابن عمر رضی اللہ تعالیٰ عنہ بھی موجودتھے اتنے میں حضرت عبد اللہ بن سلام رضی اللہ تعالیٰ عنہ وہاں سے گزرے تو لو گوں نے کہا : یہ اہل جنت میں سے ایک شخص ہے میں اٹھا اور ان سے کہا : آپ کے متعلق لو گ اس اس طرح کہہ رہے تھے ، انھوں نے کہا : سبحان اللہ !انھیں زیبا نہیں کہ وہ ایسی بات کہیں جس کا انھیں ( پوری طرح ) علم نہ ہو ۔ میں نے ( خواب میں ) دیکھا کہ ایک ستون جو ایک سر سبز باغ کے اندر لا کر اس میں نصب کیا گیا تھا ۔ اس کی چوٹی پر ایک حلقہ تھا اور اس کے نیچے ایک منصف تھا ۔ اور منصف خدمت گا ر ہو تا ہے ۔ مجھ سے کہا : گیا : اس پر چڑھ جاؤ میں اس پر چڑھ گیا یہاں تک کہ حلقے کو پکڑ لیا ، پھر میں نے یہ خواب رسول اللہ صلی اللہ علیہ وسلم کے سامنے بیان کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : عبد اللہ کی مو ت آئے گی تو اس نے عروہ ثقیٰ ( ایمان کا مضبوط حلقہ ) تھا م رکھا ہو گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 6383,
			"arabicnumber": "2484.03",
			"text": "خرشہ بن حر سے روایت ہے ، انھوں نے کہا : میں مدینہ منورہ کی مسجد کے اندر ایک حلقے میں بیٹھا ہوا تھا ، کہا : اس میں خوبصورت ہیت والے ایک حسین وجمیل بزرگ بھی موجود تھے ۔ وہ عبداللہ بن سلام رضی اللہ تعالیٰ عنہ تھے ، کہا : انھوں نے ان لوگوں کو خوبصورت احادیث سنانی شروع کردیں ، کہا : جب وہ کھڑے ہوئے تو لوگوں نے کہا کہ جس کو ایک جنتی کا دیکھنا اچھا معلوم ہو ، وہ اس کو دیکھے ۔ میں نے ( اپنے دل میں ) کہا کہ اللہ کی قسم میں ان کے ساتھ جاؤں گا اور ان کا گھر دیکھوں گا ۔ پھر میں ان کے پیچھے ہوا ، وہ چلے ، یہاں تک کہ قریب ہوا کہ وہ شہر سے باہر نکل جائیں ، پھر وہ اپنے مکان میں گئے تو میں نے بھی اندر آنے کی اجازت چاہی ۔ انہوں نے اجازت دی ، پھر پوچھا کہ اے میرے بھتیجے! تجھے کیا کام ہے؟ میں نے کہا کہ جب آپ کھڑے ہوئے تو میں نے لوگوں کو سنا کہ جس کو ایک جنتی کا دیکھنا اچھا لگے ، وہ ان کو دیکھے تو مجھے آپ کے ساتھ رہنا اچھا معلوم ہوا ۔ انہوں نے کہا کہ جنت والوں کو اللہ تعالیٰ جانتا ہے اور میں تجھ سے لوگوں کے یہ کہنے کی وجہ بیان کرتا ہوں ۔ میں ایک دفعہ سو رہا تھا کہ خواب میں ایک شخص آیا اور اس نے کہا کہ کھڑا ہو ۔ پھر اس نے میرا ہاتھ پکڑا ، میں اس کے ساتھ چلا ، مجھے بائیں طرف کچھ راہیں ملیں تو میں نے ان میں جانا چاہا تو وہ بولا کہ ان میں مت جا ، یہ بائیں طرف والوں ( یعنی کافروں ) کی راہیں ہیں ۔ پھر دائیں طرف کی راہیں ملیں تو وہ شخص بولا کہ ان راہوں میں جا ۔ پس وہ مجھے ایک پہاڑ کے پاس لے آیا اور بولا کہ اس پر چڑھ ۔ میں نے اوپر چڑھنا چاہا تو پیٹھ کے بل گرا ۔ کئی بار میں نے چڑھنے کا قصد کیا لیکن ہر بار گرا ۔ پھر وہ مجھے لے چلا ، یہاں تک کہ ایک ستون ملا جس کی چوٹی آسمان میں تھی اور تہہ زمین میں ، اس کے اوپر ایک حلقہ تھا ۔ مجھ سے اس شخص نے کہا کہ اس ستون کے اوپر چڑھ جا ۔ میں نے کہا کہ میں اس پر کیسے چڑھوں کہ اس کا سرا تو آسمان میں ہے ۔ آخر اس شخص نے میرا ہاتھ پکڑا اور مجھے اچھال دیا اور میں نے دیکھا کہ میں اس حلقہ کو پکڑے ہوئے لٹک رہا ہوں ۔ پھر اس شخص نے ستون کو مارا تو وہ گر پڑا اور میں صبح تک اسی حلقہ میں لٹکتا رہا ( اس وجہ سے کہ اترنے کا کوئی ذریعہ نہیں رہا ) ۔ کہتے ہیں پس میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس آ کر اپنا خواب بیان کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو راہیں تو نے بائیں طرف دیکھیں ، وہ بائیں طرف والوں کی راہیں ہیں اور جو راہیں دائیں طرف دیکھیں ، وہ دائیں طرف والوں کی راہیں ہیں ۔ اور وہ پہاڑ شہیدوں کا مقام ہے ، تو وہاں تک نہ پہنچ سکے گا اور ستون ، اسلام کا ستون ہے اور حلقہ ، اسلام کا حلقہ ہے اور تو مرتے دم تک اسلام پر قائم رہے گا ۔ ( اور جب اسلام پر خاتمہ ہو تو جنت کا یقین ہے ، اس وجہ سے لوگ مجھے جنتی کہتے ہیں)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 6384,
			"arabicnumber": "2485.01",
			"text": "سفیان بن عیینہ نے زہری سے ، انھوں نے سعید ( بن مسیب ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہ سیدنا عمر بن خطاب رضی اللہ عنہ سیدنا حسان رضی اللہ عنہ کے پاس سے گزرے اور وہ مسجد میں شعر پڑھ رہے تھے ( معلوم ہوا کہ اشعار جو اسلام کی تعریف اور کافروں کی برائی یا جہاد کی ترغیب میں ہو مسجد میں پڑھنا درست ہے ) ۔ سیدنا عمر رضی اللہ عنہ نے ان کی طرف ( غصہ سے ) دیکھا ۔ سیدنا حسان رضی اللہ عنہ نے کہا کہ میں تو مسجد میں ( اس وقت بھی ) شعر پڑھتا تھا جب تم سے بہتر شخص ( یعنی نبی کریم صلی اللہ علیہ وسلم ) موجود تھے ۔ پھر سیدنا ابوہریرہ رضی اللہ عنہ کی طرف دیکھا اور کہا کہ میں تمہیں اللہ کی قسم دیتا ہوں کہ تم نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے؟ آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اے حسان! میری طرف سے جواب دے ، اے اللہ اس کی روح القدس ( جبرائیل علیہ السلام ) سے مدد کر ۔ سیدنا ابوہریرہ رضی اللہ عنہ نے کہا ہاں میں نے سنا ہے یا اللہ تو جانتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 6385,
			"arabicnumber": "2485.02",
			"text": "معمر نے زہری سے ، انھوں نے ابن مسیب سے روایت کی کہ حضرت حسان رضی اللہ تعالیٰ عنہ نے ایک حلقے میں کہا جس میں ابوہریرہ رضی اللہ تعالیٰ عنہ موجود تھے : ابوہریرہ رضی اللہ تعالیٰ عنہ !میں آپ کو اللہ کی قسم دیتا ہوں ، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا؟اس کے بعد اس کے مانند یوں بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 6386,
			"arabicnumber": "2485.03",
			"text": "زہری نے کہا : مجھے ابو سلمہ بن عبدالرحمان نے بتایا کہ انھوں نے حضرت حسان بن ثابت انصاری رضی اللہ تعالیٰ عنہ سے سنا ، وہ حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے گواہی طلب کررہے تھے ، ( کہہ رہے تھے : ) میں تمھارے سامنے اللہ کا نام لیتا ہوں! کیاتم نے نبی کریم صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سناتھا ۔ \" حسان!اللہ کےرسول صلی اللہ علیہ وسلم کی طرف سے جواب دو ۔ اےاللہ!روح القدس کے ذریعے سے اس کی تائید فرما! \" ؟ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 6387,
			"arabicnumber": "2486.01",
			"text": "معاذ نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت براء بن عاذب رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو حضرت حسان بن ثابت رضی اللہ تعالیٰ عنہ سے یہ فرماتے ہوئے سنا : \" ان ( کافروں ) کی ہجو کرو ، یا ( فرمایا : ) ہجو میں ان کا مقابلہ کرو جبرائیل تمھارے ساتھ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 6388,
			"arabicnumber": "2486.02",
			"text": "محمد بن جعفر غندر اور عبدا الرحمان ( بن مہدی ) دونوں نے شعبہ سے اسی سندک سا تھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 6389,
			"arabicnumber": "2487.01",
			"text": "ابو اسامہ نے ہشام ( بن عروہ ) سے ، انھوں نے اپنے والد سے روایت کی کہ حضرت حسان بن ثابت رضی اللہ تعالیٰ عنہ ان لوگوں میں سے تھے جنھوں نے ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا کے متعلق بہت کچھ کہا تھا ( تہمت لگانے والوں کے ساتھ شامل ہوگئے تھے ) ، میں نے ان کو برا بھلا کہا توحضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : بھتیجے!ان کو کچھ نہ کہو ، کیونکہ وہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے کافروں کو جواب دیتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 6390,
			"arabicnumber": "2487.02",
			"text": "عبدہ نے ہشام سے اسی سند کے ساتھ حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 6391,
			"arabicnumber": "2488.01",
			"text": "محمد بن جعفر نے شعبہ سے ، انھوں نے سلیمان سے ، انھوں نے ابو ضحیٰ سے ، انھوں نے مسروق سے روایت کی کہا : کہ میں ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کے پاس گیا تو ان کے پاس سیدنا حسان بن ثابت رضی اللہ عنہ بیٹھے اپنی غزل میں سے ایک شعر سنا رہے تھے جو چند بیتوں کی انہوں نے کہی تھی ۔ وہ شعر یہ ہے کہ : ”پاک ہیں اور عقل والی ان پہ کچھ تہمت نہیں ۔ صبح کو اٹھتی ہیں بھوکی غافلوں کے گوشت سے“ ( یعنی کسی کی غیبت نہیں کرتیں کیونکہ غیبت کرنا گویا اس کا گوشت کھانا ہے ) ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے سیدنا حسان رضی اللہ عنہ سے کہا کہ لیکن تو ایسا نہیں ہے ( یعنی تو لوگوں کی غیبت کرتا ہے ) ۔ مسروق نے کہا کہ میں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا سے کہا کہ آپ حسان رضی اللہ عنہ کو اپنے پاس کیوں آنے دیتی ہو حالانکہ اللہ تعالیٰ نے ان کی شان میں فرمایا ہے کہ ”وہ شخص جس نے ان میں سے بڑی بات ( یعنی ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا پر تہمت لگانے ) کا بیڑا اٹھایا اس کے واسطے بڑا عذاب ہے ۔ ( حسان بن ثابت رضی اللہ عنہ ان لوگوں میں شریک تھے جنہوں نے ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا پر تہمت لگائی تھی ۔ پھر آپ صلی اللہ علیہ وسلم نے ان کو حد لگائی ) ام المؤمنین عائشہ رضی اللہ عنہا نے کہا کہ اس سے زیادہ عذاب کیا ہو گا کہ وہ نابینا ہو گیا ہے اور کہا کہ وہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے کافروں کی جوابدہی کرتا تھا یا ہجو کرتا تھا ۔ ( اس لئے اس کو اپنے پاس آنے کی اجازت دیتی ہوں ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 6392,
			"arabicnumber": "2488.02",
			"text": "ابن ابی عدی نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی اورکہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : حضرت حسان بن ثابت رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے مدافعت کرتے تھے ، انھوں نے ( حضرت عائشہ رضی اللہ تعالیٰ عنہا کی مدح والاحصہ ) \" وہ پاکیزہ ہیں ، عقل مند ہیں \" بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 6393,
			"arabicnumber": "2489.01",
			"text": "یحییٰ بن زکریا نے ہمیں ہشام بن عروہ سے خبر دی ، انھوں نے اپنے والد سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ حضرت حسان رضی اللہ تعالیٰ عنہ نے عرض کی : اللہ کےرسول صلی اللہ علیہ وسلم !مجھے ابو سفیان ( مغیرہ بن حارث بن عبدالمطلب ) کی ہجو کرنے کی اجازت دیجئے ، آپ نے فرمایا : \"\" اس کے ساتھ میری جو قرابت ہے اس کا کیا ہوگا؟ \"\" حضرت حسان رضی اللہ تعالیٰ عنہ نےکہا : اس ذات کی قسم جس نے آپ کو عزت عطا فرمائی!میں آپ کو ان میں سے اس طرح باہرنکال لوں گا جس طرح خمیر سے بال کو نکال لیا جاتاہے ، پھر حضرت حسان رضی اللہ تعالیٰ عنہ نے یہ قصیدہ کہا : اور آل ہاشم میں سے عظمت ومجد کی چوٹی پر وہ ہیں جو بنت مخزوم ( فاطمہ بنت عمرو بن عابد بن عمران بن مخزوم ) کی اولاد ہیں ( ابو طالب ، عبداللہ اور زبیر ) اورتیرا باپ تو غلام ( کنیز کا بیٹا ) تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 6394,
			"arabicnumber": "2489.02",
			"text": "عبدہ نے ہشام بن عروہ سے اسی سند کے ساتھ حدیث بیان کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : حسان بن ثابت رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے مشرکین کی ہجو کرنے کی اجازت مانگی ۔ اور ( عبدہ نے ) ابو سفیان کا ذکر نہیں کیا اور ۔ ۔ ۔ خمیر کے بجائے ۔ گندھا ہوا آٹا کہا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 6395,
			"arabicnumber": "2490",
			"text": "ابو سلمہ بن عبدالرحمان نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" قریش کی ہجو کرو کیونکہ ہجو ان کو تیروں کی بوچھاڑ سے زیادہ ناگوار ہے ۔ پھر آپ صلی اللہ علیہ وسلم نے ایک شخص کو سیدنا ابن رواحہ رضی اللہ عنہ کے پاس بھیجا اور فرمایا کہ قریش کی ہجو کرو ۔ انہوں نے ہجو کی لیکن آپ صلی اللہ علیہ وسلم کو پسند نہ آئی ۔ پھر سیدنا کعب بن مالک رضی اللہ عنہ کے پاس بھیجا ۔ پھر سیدنا حسان بن ثابت رضی اللہ عنہ کے پاس بھیجا ۔ جب سیدنا حسان آپ صلی اللہ علیہ وسلم کے پاس آئے تو انہوں نے کہا کہ تم پر وہ وقت آ گیا کہ تم نے اس شیر کو بلا بھیجا جو اپنی دم سے مارتا ہے ( یعنی اپنی زبان سے لوگوں کو قتل کرتا ہے گویا میدان فصاحت اور شعر گوئی کے شیر ہیں ) ۔ پھر اپنی زبان باہر نکالی اور اس کو ہلانے لگے اور عرض کیا کہ قسم اس کی جس نے آپ صلی اللہ علیہ وسلم کو سچا پیغمبر کر کے بھیجا ہے میں کافروں کو اپنی زبان سے اس طرح پھاڑ ڈالوں گا جیسے چمڑے کو پھاڑ ڈالتے ہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے حسان! جلدی مت کر! کیونکہ ابوبکر رضی اللہ عنہ قریش کے نسب کو بخوبی جانتے ہیں اور میرا بھی نسب قریش ہی ہیں ، تو وہ میرا نسب تجھے علیحدہ کر دیں گے ۔ پھر حسان سیدنا ابوبکر رضی اللہ عنہ کے پاس آئے ، پھر اس کے بعد لوٹے اور عرض کیا کہ یا رسول اللہ! سیدنا ابوبکر رضی اللہ عنہ نے آپ صلی اللہ علیہ وسلم کا نسب مجھ سے بیان کر دیا ہے ، قسم اس کی جس نے آپ صلی اللہ علیہ وسلم کو سچا پیغمبر کر کے بھیجا ، میں آپ صلی اللہ علیہ وسلم کو قریش میں سے ایسا نکال لوں گا جیسے بال آٹے میں سے نکال لیا جاتا ہے ۔ ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا کہتی ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم حسان سے فرماتے تھے کہ روح القدس ہمیشہ تیری مدد کرتے رہیں گے جب تک تو اللہ اور اس کے رسول کی طرف سے جواب دیتا رہے گا ۔ اور ام المؤمنین عائشہ صدیقہ رضی اللہ عنہا نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ حسان نے قریش کی ہجو کی تو مومنوں کے دلوں کو شفاء دی اور کافروں کی عزتوں کو تباہ کر دیا ۔ حسان نے کہا کہ تو نے محمد صلی اللہ علیہ وسلم کی برائی کی تو میں نے اس کا جواب دیا اور اللہ تعالیٰ اس کا بدلہ دے گا ۔ تو نے محمد صلی اللہ علیہ وسلم کی برائی کی جو نیک اور پرہیزگار ہیں ، اللہ تعالیٰ کے رسول صلی اللہ علیہ وسلم ہیں اور وفاداری ان کی خصلت ہے ۔ میرے باپ دادا اور میری آبرو محمد صلی اللہ علیہ وسلم کی آبرو بچانے کے لئے قربان ہیں ۔ اگر کداء ( مکہ کے دروازہ پر گھاٹی ) کے دونوں جانب سے غبار اڑتا ہو نہ دیکھو تو میں اپنی جان کو کھوؤں ۔ ایسی اونٹنیاں جو باگوں پر زور کریں گی اور اپنی قوت اور طاقت سے اوپر چڑھتی ہوئیں ، ان کے کندھوں پر وہ برچھے ہیں جو باریک ہیں یا خون کی پیاسی ہیں اور ہمارے گھوڑے دوڑتے ہوئے آئیں گے ، ان کے منہ عورتیں اپنے دوپٹوں سے پونچھتی ہیں ۔ اگر تم ہم سے نہ بولو تو ہم عمرہ کر لیں گے اور فتح ہو جائے گی اور پردہ اٹھ جائے گا ۔ نہیں تو اس دن کی مار کے لئے صبر کرو جس دن اللہ تعالیٰ جس کو چاہے گا عزت دے گا ۔ اور اللہ تعالیٰ نے فرمایا کہ میں نے ایک لشکر تیار کیا ہے جو انصار کا لشکر ہے ، جس کا کھیل کافروں سے مقابلہ کرنا ہے ۔ اور اللہ تعالیٰ نے فرمایا کہ میں نے ایک بندہ بھیجا جو سچ کہتا ہے اس کی بات میں کچھ شبہہ نہیں ہے ۔ ہم تو ہر روز ایک نہ ایک تیاری میں ہیں ، گالی گلوچ ہے کافروں سے یا لڑائی ہے یا کافروں کی ہجو ہے ۔ تم میں سے جو کوئی اللہ کے رسول صلی اللہ علیہ وسلم کی ہجو کرے اور ان کی تعریف کرے یا مدد کرے وہ سب برابر ہیں ۔ اور ( روح القدس ) جبریل علیہ السلام کو اللہ کی طرف سے ہم میں بھیجاگیا ہے اور روح القدس کا ( کائنات میں ) کوئی مد مقابل نہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 6396,
			"arabicnumber": "2491",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : کہ میں اپنی والدہ کو اسلام کی طرف بلاتا تھا اور وہ مشرک تھی ۔ ایک دن میں نے اس کو مسلمان ہونے کو کہا تو اس نے رسول اللہ صلی اللہ علیہ وسلم کے حق میں وہ بات سنائی جو مجھے ناگوار گزری ۔ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس روتا ہوا آیا اور عرض کیا کہ میں اپنی والدہ کو اسلام کی طرف بلاتا تھا وہ نہ مانتی تھی ، آج اس نے آپ صلی اللہ علیہ وسلم کے حق میں مجھے وہ بات سنائی جو مجھے ناگوار ہے تو آپ صلی اللہ علیہ وسلم اللہ تعالیٰ سے دعا کیجئے کہ وہ ابوہریرہ کی ماں کو ہدایت دیدے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! ابوہریرہ کی ماں کو ہدایت کر دے ۔ میں رسول اللہ صلی اللہ علیہ وسلم کی دعا سے خوش ہو کر نکلا ۔ جب گھر پر آیا اور دروازہ پر پہنچا تو وہ بند تھا ۔ میری ماں نے میرے پاؤں کی آواز سنی ۔ اور بولی کہ ذرا ٹھہرا رہ ۔ میں نے پانی کے گرنے کی آواز سنی غرض میری ماں نے غسل کیا اور اپنا کرتہ پہن کر جلدی سے اوڑھنی اوڑھی ، پھر دروازہ کھولا اور بولی کہ اے ابوہریرہ! ”میں گواہی دیتی ہوں کہ اللہ کے سوا کوئی معبود برحق نہیں ہے اور میں گواہی دیتی ہوں کہ محمد صلی اللہ علیہ وسلم اللہ کے بندے اور اس کے رسول ہیں“ ۔ سیدنا ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس خوشی سے روتا ہوا آیا اور عرض کیا کہ یا رسول اللہ! خوش ہو جائیے اللہ تعالیٰ نے آپ صلی اللہ علیہ وسلم کی دعا قبول کی اور ابوہریرہ کی ماں کو ہدایت کی تو آپ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کی تعریف اور اس کی صفت کی اور بہتر بات کہی ۔ میں نے عرض کیا کہ یا رسول اللہ! اللہ عزوجل سے دعا کیجئے کہ میری اور میری ماں کی محبت مسلمانوں کے دلوں میں ڈال دے ۔ اور ان کی محبت ہمارے دلوں میں ڈال دے ۔ تب رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! اپنے بندوں کی یعنی ابوہریرہ اور ان کی ماں کی محبت اپنے مومن بندوں کے دلوں میں ڈال دے اور مومنوں کی محبت ان کے دلوں میں ڈال دے ۔ پھر کوئی مومن ایسا پیدا نہیں ہوا جس نے میرے بارے میں سنایا مجھے دیکھا ہواور میرےساتھ محبت نہ کی ہو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 6397,
			"arabicnumber": "2492.01",
			"text": "سفیان بن عیینہ نے زہری سے ، انھوں نے اعرج سےروایت کی ، کہا : میں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : تم یہ سمجھتے ہو کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بہت زیادہ احادیث بیان کرتاہے ، اللہ ہی کے پاس پیشی ہونی ہے ۔ میں ایک مسکین آدمی تھا ، پیٹ بھرجانے پر اللہ کے رسول صلی اللہ علیہ وسلم کی خدمت میں لگا رہتاتھا ۔ مہاجروں کو بازار میں گہما گہمی مشغول رکھتی تھی اور انصار کو اپنے مال ( مویشی ) وغیرہ کی نگہداشت مشغول رکھتی تھی ، تو ( جب ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کون اپنا کپڑا پھیلائے گا ، پھر جو چیز بھی اس نے مجھ سے سنی اسے ہرگز نہیں بھولے گا ۔ \" تو میں نے اپنا کپڑا پھیلا دیا ، یہاں تک کہ آپ نے اپنی بات مکمل کی تو میں نے وہ ( کپڑا سمیٹ کر ) اپنے ساتھ لگا لیا ، پھر میں نے آپ صلی اللہ علیہ وسلم سے جو کچھ سنا اس میں سے کوئی چیز کبھی نہ بھولا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 6398,
			"arabicnumber": "2492.02",
			"text": "مالک بن انس اور معمر نے زہری سے ، انھوں نے اعرج سے اور انھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے یہ حدیث روایت کی ، مگر مالک کی حدیث ابو ہریرہ رضی اللہ تعالیٰ عنہ کی بات پر ختم ہو گئی ۔ انھوں نے اپنی حدیث میں نبی صلی اللہ علیہ وسلم سے روایت کردہ یہ بات : \" کون اپنا کپڑا پھیلا ئےگا : \" آخر تک بیان نہیں کی ،",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 6399,
			"arabicnumber": "2493",
			"text": "یو نس نے ابن شہاب سے روایت کی عروہ بن زبیر نے انھیں حدیث بیان کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا : کیا تمھیں ابوہریرہ رضی اللہ تعالیٰ عنہ ( ایسا کرتے ہوئے ) اچھے نہیں لگتے کہ وہ آئے میرے حجرے کے ساتھ بیٹھ گئےاور رسول اللہ صلی اللہ علیہ وسلم سے احادیث بیان کرنے لگے وہ مجھے ( یہ ) احادیث سنا رہے تھے ۔ میں نفل پڑھ رہی تھی تو وہ میرے نوافل ختم کرنے سے پہلے اٹھ گئے ۔ اگر میں ( نوافل ختم کرنے کے بعد ) انھیں مو جو د پا تی تو میں ان کو جواب میں یہ کہتی کہ رسول اللہ صلی اللہ علیہ وسلم تم لوگوں کی طرح تسلسل سے ایک کے بعد دوسری بات ارشاد نہیں فر ما تےتھے ۔ ابن شہاب نے بیان کیا : حضرت سعید بن مسیب نے روایت کیا کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : لو گ کہتے ہیں ۔ ابو ہریرہ رضی اللہ تعالیٰ عنہ بہت احادیث بیان کرتے ہیں اور پیشی اللہ کے سامنے ہو نی ہے نیز وہ کہتے ہیں ، کیا وجہ ہے کہ مہاجرین اور انصار ابو ہریرہ رضی اللہ تعالیٰ عنہ کی طرح احادیث بیان نہیں کرتے ؟ میں تم کو اس کے بارے میں بتا تا ہوں ۔ میرے انصاری بھا ئیوں کو ان کی زمینوں کاکام مشغول رکھتا تھا اور میرے مہاجر بھا ئیوں کو بازار کی خریدو فروخت مصروف رکھتی تھی اور میں پیٹ بھرنے پر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ لگا رہتا تھا ، جب دوسرے لو گ غائب ہو تے تو میں حاضر رہتا تھا اور جن باتوں کو وہ بھول جا تے تھے میں ان کو یا د رکھتا تھا ۔ ایک دن رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" تم میں سے کو ن شخص اپنا کپڑا بچھائے گا ۔ تا کہ میری یہ بات ( حدیث ) سنے پھر اس ( کپڑے ) کو اپنے سینے سے لگا لے تو اس نے جو کچھ سنا ہو گا اس میں سے کو ئی چیز نہیں بھولے گا ۔ \"\" میں نے ایک چادر جو میرے کندھوں پر تھی پھیلا دی یہاں تک کہ آپ اپنی بات سے فارغ ہوئے تو میں نے اس چادر کو اپنے سینے کے ساتھ اکٹھا کر لیا تو اس دن کے بعد کبھی کو ئی ایسی چیز نہیں بھولا جو آپ نے مجھ سے بیان فر ما ئی ۔ اگر دو آیتیں نہ ہو تیں ، جو اللہ نے اپنی کتاب میں نازل فر ما ئی ہیں تو میں کبھی کوئی چیز بیان نہ کرتا ( وہ آیتیں یہ ہیں ) \"\" وہ لو گ جو ہماری اتاری ہو ئی کھلی باتوں اور ہدایت کو چھپا تے ہیں ۔ ۔ ۔ دونوں آیتوں کے آخر تک ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 6400,
			"arabicnumber": "2492.03",
			"text": "شعیب نے زہری سے روایت کی ، انھوں نے کہا : مجھے سعید بن مسیب اور ابو سلمہ بن عبد الرحمٰن نے بتا یا کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نےکہا : تم لو گ یہ کہتے ہو کہ ابو ہریرہ رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بہت احادیث بیان کرتا ہے ۔ آگے ان کی حدیث کی طرح ( بیان کیا ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 6401,
			"arabicnumber": "2494.01",
			"text": "ابو بکر بن ابی شیبہ ، عمرو ناقد ، زہیر بن حرب ، اسحاق بن ابراہیم اور ابن ابی عمر نے ہمیں حدیث بیان کی ، الفاظ عمرو کے ہیں ۔ اسحاق نے کہا : ہمیں خبر دی ، دوسروں نے کہا : ہمیں سفیان بن عیینہ نے عمرو ( بن دینار ) سے حدیث بیان کی ، انھوں نے حسن بن محمد سے روایت کی ، انھوں نے کہا : مجھے عبیداللہ بن ابی رافع نے جو حضرت علی رضی اللہ تعالیٰ عنہ کے کاتب تھے ، خبر دی ، انھوں نے کہا : میں نے حضرت علی رضی اللہ تعالیٰ عنہ کو یہ فرماتے ہوئے سنا : کہ ہمیں یعنی رسول اللہ صلی اللہ علیہ وسلم نے مجھے ، سیدنا زبیر رضی اللہ عنہ اور سیدنا مقداد رضی اللہ عنہ کو روضہ خاخ مقام پر بھیجا اور فرمایا کہ جاؤ اور وہاں تمہیں ایک عورت اونٹ پر سوار ملے گی ، اس کے پاس ایک خط ہے وہ اس سے لے کر آؤ ۔ ہم گھوڑے دوڑاتے ہوئے چلے اچانک وہ عورت ہمیں ملی تو ہم نے اس سے کہا کہ خط نکال ۔ وہ بولی کہ میرے پاس تو کوئی خط نہیں ہے ۔ ہم نے کہا کہ خط نکال یا اپنے کپڑے اتار ۔ پس اس نے وہ خط اپنے جوڑے سے نکالا ۔ ہم وہ خط رسول اللہ صلی اللہ علیہ وسلم کے پاس لے کر آئے ، اس میں لکھا تھا حاطب بن ابی بلتعہ کی طرف سے مکہ کے بعض مشرکین کے نام ( اور اس میں ) رسول اللہ صلی اللہ علیہ وسلم کی بعض باتوں کا ذکر تھا ( ایک روایت میں ہے کہ حاطب نے اس میں رسول اللہ صلی اللہ علیہ وسلم کی تیاری اور فوج کی آمادگی اور مکہ کی روانگی سے کافروں کو مطلع کیا تھا ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے حاطب! تو نے یہ کیا کیا؟ وہ بولے کہ یا رسول اللہ! آپ جلدی نہ فرمائیے ۔ میں قریش سے ملا ہوا ایک شخص تھا یعنی ان کا حلیف تھا اور قریش میں سے نہ تھا اور آپ صلی اللہ علیہ وسلم کے مہاجرین جو ہیں ان کے رشتہ دار قریش میں بہت ہیں جن کی وجہ سے ان کے گھربار کا بچاؤ ہوتا ہے تو میں نے یہ چاہا کہ میرا ناتا تو قریش سے نہیں ہے ، میں بھی ان کا کوئی کام ایسا کر دوں جس سے میرے اہل و عیال والوں کا بچاؤ کریں گے اور میں نے یہ کام اس وجہ سے نہیں کیا کہ میں کافر ہو گیا ہوں یا مرتد ہو گیا ہوں اور نہ مسلمان ہونے کے بعد کفر سے خوش ہو کر کیا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ حاطب نے سچ کہا ۔ سیدنا عمر رضی اللہ عنہ نے کہ کہ یا رسول اللہ! آپ چھوڑئیے میں اس منافق کی گردن ماروں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ تو بدر کی لڑائی میں شریک تھا اور تو نہیں جانتا کہ اللہ تعالیٰ نے بدر والوں کو جھانکا اور فرمایا کہ تم جو اعمال چاہو کرو ( بشرطیکہ کفر تک نہ پہنچیں ) میں نے تمہیں بخش دیا ۔ تب اللہ تعالیٰ نے یہ آیت اتاری کہ ”اے ایمان والو! میرے اور اپنے دشمنوں کو دوست مت بناؤ“ ۔ ( سورۃ : الممتحنہ : 1 ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 6402,
			"arabicnumber": "2494.02",
			"text": "ابو عبد الرحمٰن سلمی نے حضرت علی رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھے ، حضرت ابو مرثد غنوی اور زبیر بن عوام رضی اللہ تعالیٰ عنہ کو روانہ کیا ہم سب گھوڑوں پر سوار تھے آپ نے فر ما یا : \" تم خاخ کے باغ کی طرف روانہ ہو جاؤ ، وہاں ایک مشرک عورت ہو گئی ، اس کے پاس مشرکین کے نام حاطب کا ایک خط ہو گا ۔ \" آگے عبید اللہ بن ابی رافع کی حضرت علی رضی اللہ تعالیٰ عنہ سے مروی حدیث کے ہم معنی بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 6403,
			"arabicnumber": "2495",
			"text": "حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت حاطب رضی اللہ تعالیٰ عنہ کا ایک غلام رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور حضرت حاطب رضی اللہ تعالیٰ عنہ کی ( کسی بات کی ) شکایت کرتے ہو ئے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !حاطب ضرور دوزخ میں جا ئے گا تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم جھوٹ کہتے ہو ۔ وہ دوزخ میں داخل نہیں ہو گا ۔ کیونکہ وہ بدر اور حدیبیہ میں شر یک ہوا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 6404,
			"arabicnumber": "2496",
			"text": "ابو زبیر نے خبر دی کہا : انھوں نے جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے ۔ مجھےام مبشر رضی اللہ تعالیٰ عنہا نے خبر دی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو حضرت حفصہ رضی اللہ تعالیٰ عنہا کے ہاں یہ فرما تے ہو ئے سنا ، \" ان شاء اللہ اصحاب شجرہ ( درخت والوں ) میں سے کو ئی ایک بھی جس نے اس کے نیچے بیعت کی تھی جہنم میں داخل نہ ہو گا ۔ وہ ( حضرت حفصہ رضی اللہ تعالیٰ عنہا ) کہنے لگیں ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! کیوں نہیں ! ( داخل تو ہوں گے ۔ ) آپ صلی اللہ علیہ وسلم نے انھیں جھڑک دیا تو حضرت حفصہ رضی اللہ تعالیٰ عنہا نے آیت پڑھی : \" تم میں سے کو ئی نہیں مگر اس پر وارد ہو نے والاہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ( اس کے بعد ) اللہ تعا لیٰ نے یہ ( بھی ) فرمایا ہے ۔ پھر ہم تقویٰ اختیار کرنے والوں کو ( جہنم میں گرنے سے ) بچا لیں گے اور ظالموں کو اسی میں گھٹنوں کے بل پڑا رہنے دیں گے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 6405,
			"arabicnumber": "2497",
			"text": "ابو بردہ نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا اور آپ نے مکہ اور مدینہ کے درمیان جعرانہ میں پڑاؤ کیا ہوا تھا ۔ حضرت بلال رضی اللہ تعالیٰ عنہ بھی آپ کے ساتھ تھے ۔ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک بدو شخص آیا ، اس نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !آپ نے مجھ سے جو وعدہ کیا تھا اسے پورا نہیں کریں گے؟ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" خوش ہو جاؤ ۔ \" ( میں نے وعدہ کیا ہے تو پورا کروں گا ۔ ) اس بدو نے آپ صلی اللہ علیہ وسلم سے کہا : آپ مجھ سے بہت دفعہ \" خوش ہو جاؤ ۔ \" کہہ چکے ہیں تو رسول اللہ صلی اللہ علیہ وسلم غصے جیسی کیفیت میں ابو موسیٰ اور بلال رضی اللہ تعالیٰ عنہ کی طرف متوجہ ہو ئے اور فرما یا : \" اس شخص نے میری بشارت کو مسترد کر دیا ہے اب تم دونوں میری بشارت کو قبول کرلو ۔ \" ان دونوں نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم !ہم نے قبول کی ، پھر رسول اللہ صلی اللہ علیہ وسلم نے پانی کا ایک پیالہ منگوایا آپ نے اس پیالے میں اپنے ہاتھ اور اپنا چہرہ دھویا اور اس میں اپنے دہن مبارک کا پانی ڈالا پھر فر ما یا : \" تم دونوں اسے پی لو اور اس کو اپنے اپنے چہرے اور سینے پر مل لو اور خوش ہو جاؤ ۔ \" ان دونوں نے پیا لہ لے لیا اور جس طرح رسول اللہ صلی اللہ علیہ وسلم نے ان کو حکم دیا تھا اسی طرح کیا تو حضرت ام سلمہ رضی اللہ تعالیٰ عنہا نے پردے کے پیچھے سے ان کو آواز دے کر کہا : جو تمھا رے برتن میں ہے اس میں سے کچھ اپنی ماں کے لیے بھی بچا لو ، تو انھوں نے اس میں سے کچھ ان کے لیے بھی بچا لیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 6406,
			"arabicnumber": "2498",
			"text": "برید نے ابو بردہ سے اور انھوں نے اپنے والد ( حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : کہ جب رسول اللہ صلی اللہ علیہ وسلم حنین کی لڑائی سے فارغ ہوئے تو سیدنا ابوعامر رضی اللہ عنہ کو لشکر دے کر اوطاس پر بھیجا تو ان کا مقابلہ درید بن الصمہ سے ہوا ۔ پس درید بن الصمہ قتل کر دیا گیا اور اس کے ساتھ والوں کو اللہ تعالیٰ نے شکست سے ہمکنار کر دیا ۔ سیدنا ابوموسیٰ رضی اللہ عنہ نے کہا کہ مجھے بھی رسول اللہ صلی اللہ علیہ وسلم نے سیدنا ابوعامر رضی اللہ عنہ کے ساتھ بھیجا تھا ۔ پھر بنی جشم کے ایک شخص کا ایک تیر سیدنا ابوعامر رضی اللہ عنہ کو گھٹنے میں لگا اور وہ ان کے گھٹنے میں جم گیا ۔ میں ان کے پاس گیا اور پوچھا کہ اے چچا! تمہیں یہ تیر کس نے مارا؟ انہوں نے کہا کہ اس شخص نے مجھے قتل کیا اور اسی شخص نے مجھے تیر مارا ہے ۔ سیدنا ابوموسیٰ رضی اللہ عنہ نے کہا کہ میں نے اس شخص کا پیچھا کیا اور اس سے جا ملا ۔ اس نے جب مجھے دیکھا تو پیٹھ موڑ کر بھاگ کھڑا ہو ۔ میں اس کے پیچھے ہوا اور میں نے کہنا شروع کیا کہ اے بےحیاء ! کیا تو عرب نہیں ہے؟ ٹھہرتا نہیں ہے؟ پس وہ رک گیا ۔ پھر میرا اس کا مقابلہ ہوا ، اس نے بھی وار کیا اور میں نے بھی وار کیا ، آخر میں نے اس کو تلوار سے مار ڈالا ۔ پھر لوٹ کر ابوعامر رضی اللہ عنہ کے پاس آیا اور کہا کہ اللہ نے تمہارے قاتل کو قتل کروا دیا ۔ ابوعامر رضی اللہ عنہ نے کہا کہ اب یہ تیر نکال لے میں نے اس کو نکالا تو تیر کی جگہ سے پانی نکلا ( خون نہ نکلا شاید وہ تیر زہر آلود تھا ) ۔ ابوعامر نے کہا کہ اے میرے بھتیجے! تو رسول اللہ صلی اللہ علیہ وسلم کے پاس جا کر میری طرف سے سلام کہہ اور یہ کہنا کہ ابوعامر کی بخشش کی دعا کیجئے ۔ سیدنا ابوموسیٰ رضی اللہ عنہ نے کہا کہ ابوعامر رضی اللہ عنہ نے مجھے لوگوں کا سردار کر دیا اور وہ تھوڑی دیر زندہ رہے ، پھر فوت ہو گئے ۔ جب میں لوٹ کر رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو آپ صلی اللہ علیہ وسلم ایک کوٹھڑی میں بان کے ایک پلنگ پر تھے جس پر فرش تھا اور بان کا نشان آپ صلی اللہ علیہ وسلم کی پیٹھ اور پہلوؤں پر بن گیا تھا ۔ میں نے کہا کہ ابوعامر نے آپ صلی اللہ علیہ وسلم سے یہ درخواست کی تھی کہ میرے لئے دعا کیجئے ۔ پس رسول اللہ صلی اللہ علیہ وسلم نے پانی منگوایا کر وضو کیا ، پھر دونوں ہاتھ اٹھائے اور فرمایا کہ اے اللہ! عبید ابوعامر کو بخش دے ( عبید بن سلیم ان کا نام تھا ) یہاں تک کہ میں نے آپ صلی اللہ علیہ وسلم کی دونوں بغلوں کی سفیدی دیکھی ۔ پھر فرمایا کہ اے اللہ! ابوعامر کو قیامت کے دن بہت سے لوگوں کا سردار کرنا ۔ میں نے عرض کیا کہ یا رسول اللہ! اور میرے لئے بھی بخشش کی دعا فرمائیے تو آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے اللہ! عبداللہ بن قیس کے گناہ بھی بخش دے اور قیامت کے دن اس کو عزت کے مکان میں لے جا ۔ ابوبردہ رضی اللہ عنہ نے کہا کہ ایک دعا ابوعامر کے لئے کی اور ایک دعا ابوموسیٰ کے لئے کی ۔ رضی اللہ عنہما ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 6407,
			"arabicnumber": "2499",
			"text": "ابو بردہ نے حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اشعری رفقاء جب رات کے وقت گھروں میں داخل ہو تے ہیں تو میں ان کے قرآن مجید پڑھنے کی آواز کو پہچان لیتا ہوں اور رات کو ان کے قرآن پڑھنے کی آواز سے ان کے گھروں کو بھی پہچان لیتا ہوں ، چاہے دن میں ان کے اپنے گھروں میں آنے کے وقت میں نے ان کے گھروں کو نہ دیکھا ہو ۔ ان میں سے ایک حکیم ( حکمت و دانائی والاشخص ) ہے جب وہ گھڑسواروں ۔ ۔ ۔ یا آپ صلی اللہ علیہ وسلم نے فر ما یا : دشمنوں ۔ ۔ ۔ سے ملا قات کرتا ہے تو ان سے کہتا ہے ۔ میرے ساتھی تمھیں حکم دے رہے ہیں کہ تم ان کا انتظار کرو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 6408,
			"arabicnumber": "2500",
			"text": "ابو بردہ نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : اشعر ی لوگ جب جہاد میں رسد کی کمی کا شکار ہو جا ئیں یا مدینہ میں ان کے اہل وعیال کا کھا نا کم پڑ جائے تو ان کے پاس جو کچھ بچا ہو اسے ایک کپڑے میں اکٹھا کر لیتے ہیں ، پھر ایک ہی برتن سے اس کو آپس میں برابر تقسیم کر لیتے ہیں ۔ وہ مجھ سے ہیں اور میں ان سے ہوں ۔ ( وہ میرے قریب ہیں اور میں ان سے قربت رکھتا ہوں ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 6409,
			"arabicnumber": "2501",
			"text": "عکرمہ نے کہا : ہمیں ابو زمیل نے حدیث بیان کی ، انھوں نے کہا : مجھے حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، کہا : مسلمان نہ حضرت ابو سفیان رضی اللہ تعالیٰ عنہ سے بات کرتے تھے نہ ان کے ساتھ بیٹھتے اٹھتے تھے ۔ اس پر انھوں نے نبی صلی اللہ علیہ وسلم سے عرض کی : اللہ کے نبی صلی اللہ علیہ وسلم !آپ مجھے تین چیزیں عطا فر ما دیجیے ۔ ( تین چیزوں کے بارے میں میری درخواست قبول فرما لیجیے ۔ ) آپ نے جواب دیا : \" ہاں ۔ \" کہا میری بیٹی ام حبیبہ رضی اللہ تعالیٰ عنہا عرب کی سب سے زیادہ حسین و جمیل خاتون ہے میں اسے آپ کی زوجیت میں دیتا ہوں ۔ آپ نے فر مایا : \" ہاں ۔ \" کہا : اور معاویہ ( میرابیٹا ) آپ اسے اپنے پاس حاضر رہنے والا کا تب بنا دیجیے ۔ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" ہاں ۔ \" پھر کہا : آپ مجھے کسی دستے کا امیر ( بھی ) مقرر فرمائیں تا کہ جس طرح میں مسلمانوں کے خلاف لڑتا تھا اسی طرح کافروں کے خلا ف بھی جنگ کروں ۔ آپ نے فرمایا : \" ہاں ۔ \" ابو زمیل نے کہا : اگر انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ان باتوں کا مطالبہ نہ کیا ہو تا تو آپ ( از خود ) انھیں یہ سب کچھ عطا نہ فر ما تے کیونکہ آپ سے کبھی کو ئی چیز نہیں مانگی جا تی تھی مگر آپ ( اس کے جواب میں ) \" ہاں \" کہتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 6411,
			"arabicnumber": "2503",
			"text": "کہا : ( تو ایسا ہوا کہ حضرت جعفر رضی اللہ تعالیٰ عنہ کی بیوی ) اسماء بن عمیس رضی اللہ تعالیٰ عنہا وہ ان لوگوں میں سے تھیں جو ہمارے ساتھ آئے تھے ۔ ملنے کے لئے ام المومنین حضت حفصہ رضی اللہ تعالیٰ عنہا کے پا س گئیں ۔ ہی بھی نجاشی کی طرف ہجرت کرنے والوں کے ساتھ ہجرت کرکے گئی تھیں ۔ سیدنا عمر رضی اللہ عنہ ام المؤمنین حفصہ رضی اللہ عنہا کے پاس آئے اور سیدہ اسماء بنت عمیس رضی اللہ عنہا ان کے پاس موجود تھیں ۔ سیدنا عمر رضی اللہ عنہ نے اسماء رضی اللہ عنہا کو دیکھ کر پوچھا کہ یہ کون ہے؟ ام المؤمنین حفصہ رضی اللہ عنہا نے جواب دیا کہ یہ اسماء بنت عمیس ہے ۔ تو انہوں نے کہا کہ جو حبش کے ملک میں گئی تھیں اور اب سمندر کا سفر کر کے آئی ہیں؟ اسماء رضی اللہ عنہا بولیں جی ہاں میں وہی ہوں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ ہم ہجرت میں تم سے سبقت لے گئے ، لہٰذا رسول اللہ صلی اللہ علیہ وسلم پر تم سے زیادہ ہمارا حق ہے ۔ یہ سن کر انہیں غصہ آ گیا اور کہنے لگیں ”اے عمر! اللہ کی قسم ہرگز نہیں ، تم نے جھوٹ کہا ۔ تم تو رسول اللہ صلی اللہ علیہ وسلم کے پاس موجود تھے ، تم میں سے بھوکے کو کھانا کھلاتے اور تمہارے جاہل کو نصیحت کرتے تھے اور ہم ایک دور دراز دشمنوں کی زمین حبشہ میں تھے ، اور ہماری یہ سب تکالیف اللہ اور اس کے رسول صلی اللہ علیہ وسلم کی راہ میں تھیں ۔ اللہ کی قسم! مجھ پر اس وقت تک کھانا پینا حرام ہے جب تک رسول اللہ صلی اللہ علیہ وسلم سے تمہاری بات کا ذکر نہ کر لوں اور ہم کو ایذا دی جاتی تھی اور ہمیں ہر وقت خوف رہتا تھا ۔ عنقریب میں نبی کریم صلی اللہ علیہ وسلم سے ذکر کروں گی ، ان سے پوچھوں گی اور اللہ کی قسم نہ میں جھوٹ بولوں گی ، نہ میں کجروی کروں گی اور نہ میں اس سے زیادہ کہوں گی“ ۔ جب نبی کریم صلی اللہ علیہ وسلم تشریف لائے تو سیدہ اسماء رضی اللہ عنہا نے عرض کیا کہ یا نبی اللہ صلی اللہ علیہ وسلم ! عمر رضی اللہ عنہ نے اس اس طرح کہا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم سے زیادہ کسی کا حق نہیں ہے ۔ کیونکہ عمر ( رضی اللہ عنہ ) اور ان کے ساتھیوں کی ایک ہجرت ہے اور تم کشتی والوں کی تو دو ہجرتیں ہوئیں ( ایک مکہ سے حبش کو اور دوسری حبش سے مدینہ طیبہ کو ) ۔ سیدہ اسماء رضی اللہ عنہا نے کہا کہ میں نے سیدنا ابوموسیٰ اور کشتی والوں کو دیکھا کہ وہ گروہ در گروہ میرے پاس آتے اور اس حدیث کو سنتے تھے ۔ اور دنیا میں کوئی چیز ان کو رسول اللہ صلی اللہ علیہ وسلم کے اس فرمان سے زیادہ خوشی کی نہ تھی نہ اتنی بڑی تھی ۔ سیدنا ابوبردہ رضی اللہ تعالیٰ عنہ نے کہا کہ سیدہ اسماء رضی اللہ تعالیٰ عنہا نے کہا کہ میں نے ابوموسیٰ رضی اللہ تعالیٰ عنہ کو دیکھا کہ وہ مجھ سے اس حدیث کو ( خوشی کے لئے ) باربار سننا چاہتے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 6412,
			"arabicnumber": "2504",
			"text": "معاویہ بن قرہ نے عائذ بن عمرو رضی اللہ تعالیٰ عنہ سے روایت کی کہ ابوسفیان رضی اللہ تعالیٰ عنہ چند اور لوگوں کی موجودگی میں حضرت سلیمان ، حضرت صہیب اور حضرت بلال رضوان اللہ عنھم اجمعین کے پاس سے گزرے تو انھوں نے کہا : اللہ کی قسم! اللہ کی تلواریں اللہ کے دشمن کی گردن میں اپنی جگہ تک نہیں پہنچیں ۔ کہا : اس پر ابوبکر رضی اللہ تعالیٰ عنہ نے فر ما یا : تم لوگ قریش کے شیخ اور سردار کے متعلق یہ کہتے ہو ۔ پھر حضرت ابو بکر رضی اللہ تعالیٰ عنہ نبی صلی اللہ علیہ وسلم کے پاس آئے اور آپ کو یہ بات بتا ئی تو آپ نے فر ما یا : \" ابو بکر رضی اللہ تعالیٰ عنہ ! شاید تم نے ان کو ناراض کر دیا ہے ۔ اگر تم نے ان کو ناراض کر دیا ہے تو اپنے رب کو ناراض کر دیا ہے ۔ حضرت ابو بکر رضی اللہ تعالیٰ عنہ ان کے پاس آئے اور کہا : میرے بھائیو! کیا میں نے تم کو ناراض کردیا؟ انھوں نے کہا : نہیں بھا ئی ! اللہ آپ کی مغفرت فر ما ئے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 6413,
			"arabicnumber": "2505",
			"text": "عمرو ( بن دینار ) نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : یہ آیت ہمارے بارے میں نازل ہو ئی \" جب تم میں سے دوجماعتوں نے پیچھے ہٹنے کا ارادہ کیا اور اللہ ان دونوں کا مدد گا ر تھا \" یہ آیت بنوسلمہ اور بنو حارثہ کے متعلق نازل ہو ئی ( اس کے اندر ) اللہ کے اس فر ما ن : \" اللہ ان دونوں ( جماعتوں ) کا مددگار تھا \" کی بنا پر ہمیں یہ بات پسند نہیں کہ یہ آیت نال نہ ہو ئی ہوتی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 6416,
			"arabicnumber": "2507",
			"text": "عکرمہ بن عمار نے کہا : ہمیں اسحٰق بن عبد اللہ بن ابی طلحہ نے حدیث بیان کی ، کہا : حضرت انس رضی اللہ تعالیٰ عنہ نے ان سے حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم نے انصار کے لیے مغفرت کی دعاکی ۔ ( اسحاق نے ) کہا : میرا خیال ہے کہ انھوں ( انس رضی اللہ تعالیٰ عنہ ) نے کہا : \" اور انصارکی اولاد دوں اور انصارکے ساتھ نسبت رکھنے والوںکی بھی ( مغفرت فرما ۔ ) \" مجھے اس کے بارےمیں کو ئی شک نہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 6417,
			"arabicnumber": "2508",
			"text": "عبد العزیز بن صہیب نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے ( انصارکے ) کچھ بچوں اور عورتوں کو شادی سے آتے ہو ئے دیکھا ، نبی صلی اللہ علیہ وسلم سیدھے کھڑے ہو گئے ۔ اور فرما یا : \" میرا اللہ! ( گواہ ہے ) تم ان لوگوں میں سے ہو جو مجھے سب سے زیادہ محبوب ہیں ۔ میرا اللہ ! ( گواہ ہے ) تم ان لوگوں میں سے ہوجو مجھے سب سے زیادہ محبوب ہیں ۔ \" آپ کی مراد انصار سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 6418,
			"arabicnumber": "2509.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے ہشام بن زید سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا : انصار میں سے ایک عورت رسول اللہ صلی اللہ علیہ وسلم کے پاس آئی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے علیحدگی میں اس کی بات سنی اور تین بار فر ما یا : \" اس ذات کی قسم جس کے ہاتھ میں میرے جان ہے! تم لو گ سب سے زیادہ پیارےہو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 6419,
			"arabicnumber": "2509.02",
			"text": "خالد بن حارث اور ابن ادریس نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی ،",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 6420,
			"arabicnumber": "2510",
			"text": "ہمیں شعبہ نے حدیث سنائی ، کہا : میں نے قتادہ سے سنا ، وہ حجرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کر رہے تھےکہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" انصار میرا پوٹا ہیں ( جہاں پرندوں کی غذا محفوظ رہتی ہے ) اور میرا قیمتی چیزیں رکھنے کا صندوق ( اثاثہ ) ہیں ۔ لو گ پڑھتے جا ئیں گے اور یہ کم ہو تے جائیں گے ۔ ان میں سے جواچھا کام کرے اسے قبول کرو اور جو غلط کرے اس سے در گزر کرو ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 6421,
			"arabicnumber": "2511.01",
			"text": "محمد بن جعفر نے کہا : شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے قتادہ سے سنا ، حضرت انس رضی اللہ تعالیٰ عنہ سے حدیث بیان کر رہے تھے ۔ انھوں نے حضرت ابو اُسید رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : : \" \" انصار کے گھرانوں میں سے بہترین بنو نجا ر ہیں پھر بنو عبدالاشہل ہیں ، پھر بنو حارث بن خزرج ہیں پھر بنوساعدہ ہیں اور انصار کے تمام گھرانوں میں خیرہے ۔ \" حضرت سعد ( بن عبادہ ) رضی اللہ تعالیٰ عنہ نے کہا : میرا خیال ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ( اور لوگوں کو ) ہم پر فضیلت دی ہے تو ان سے کہاگیا ۔ آپ کو بھی بہت لو گوں پر فضیلت دی ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 6422,
			"arabicnumber": "2511.02",
			"text": "ابو داؤد نے کہا : ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا ، وہ حضرت ابو اسید انصاری رضی اللہ تعالیٰ عنہ سے حدیث روایت کر رہے تھے ، اور وہ نبی صلی اللہ علیہ وسلم سے ، اسی ( گزشتہ ) روایت کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 6423,
			"arabicnumber": "2511.03",
			"text": "یحییٰ بن سعید نے حضرت انس رضی اللہ تعالیٰ عنہ سے اسی کے مانند روایت کی مگر انھوں نے حضرت سعد رضی اللہ تعالیٰ عنہ کی بات بیان نہیں کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 6424,
			"arabicnumber": "2511.04",
			"text": "ابرا ہیم بن محمد بن طلحہ سے روایت ہے کہا : میں نے حضرت ابواُسید رضی اللہ تعالیٰ عنہ کو ( ولید ) ابن عتبہ ( بن ابی سفیان ) کے ہاں خطبہ دیتے ہو ئے سنا ۔ انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" انصار کے گھرانوں میں سے بہترین گھرانہ بنو نجار کا گھرا نہ ہے اور بنوعبد الا شہل کا گھرا نہ ہے اور بنوحارث بن خزرج کا گھرا نہ ہے اوربنوساعدہ کا گھرا نہ ہے ۔ \" اللہ کی قسم! اگرمیں ( ابو اسید ) ان میں سے کسی کو خود ترجیح دیتا تو اپنے خاندان ( بنوساعدہ ) کو ترجیح دیتا ۔ ( لیکن میں انے اسی ترتیب سے بیان کیا جس ترتیب سے رسول اللہ صلی اللہ علیہ وسلم نے ارشاد فرما یا تھا ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 6425,
			"arabicnumber": "2511.05",
			"text": "ابو زناد نے کہا : ابو سلمہ نے گواہی دی کہ انھوں نے حضرت ابواسید انصاری رضی اللہ تعالیٰ عنہ کو یہ گو اہی دیتے ہو ئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" انصار کے گھرانوں میں سے بہترین بنو نجارہیں پھر بنوعبد الا شہل پھر بنوحارث بن خزرج پھر بنو ساعدہ کا گھرا نوں میں خیر ہے ۔ ابو سلمہ نے کہا : حضرت ابو اسید نے کہا : کیا رسول اللہ صلی اللہ علیہ وسلم کے بارے میں مجھ پر تہمت لگا ئی جا رہی ہے؟ اگر میں جھوٹا ہو تا تو اپنی قوم بنوساعدہ کا نام پہلے لیتا ۔ ( انھوں نے کہا : ) سیہ بات حضرت سعد بن عبادہ رضی اللہ تعالیٰ عنہ تک پہنچی تو ان کو رنج ہوا اور انھوں نے کہا : ہم کو پیچھے کر دیا گیا ہم چاروں خاندانوں کے آخر میں آگئے ، میرے گدھے پر زین کسور ، میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں جاؤں گا تو ان کے بھتیجے سہل رضی اللہ تعالیٰ عنہ نے ان سے بات کی ، کہا آپ اس لیے جا رہے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کی بات کو رد کردیں؟ رسول اللہ صلی اللہ علیہ وسلم زیادہ جا نتے ہیں ۔ کیا آپ کے لیے یہ کافی نہیں کہ آپ چار میں سے چوتھے ہوں ( خیرو برکت میں شامل ہوں؟ ) تو وہ باز آئے اور کہا : اللہ اور اس کا رسول زیادہ جا ننے والے ہیں ۔ اور گدھے ( کی زین کھول دینے ) کے بارے میں حکم دیا تو وہ کھول دی گئی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 6426,
			"arabicnumber": "2511.06",
			"text": "یحییٰ بن ابی کثیر نے کہا : مجھے ابو سلمہ نے حدیث بیان کی ، انھیں حضرت ابو اسید انصاری رضی اللہ تعالیٰ عنہ نے حدیث سنائی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \" انصار میں سے یا ( فر ما یا : ) انصار کے گھرانوں میں سے بہترین ۔ ۔ ۔ \" ( آگے انصار کے ) گھرا نوں کے بارے میں ان سب ( راویوں ) کی حدیث کے مانند ہے ۔ انھوں نے حضرت سعد بن عبادہ رضی اللہ تعالیٰ عنہ کا واقعہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 6427,
			"arabicnumber": "2512",
			"text": "ابو سلمہ اور عبید اللہ بن عبد اللہ بن عتبہ بن مسعود نے کہا : کہ ان دونوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا ، رسول اللہ صلی اللہ علیہ وسلم نے جب آپ مسلمانوں کی ایک بڑی مجلس میں تھے فرما یا : \" میں تم کو انصار کا بہترین گھرا نہ بتاؤں؟ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : جی ہاں اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! آپ نے فر ما یا : \" بنو عبدالاشہل ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کون ہیں ؟فرما یا : \" بنو نجا ر ۔ ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کو ن ہیں؟فر ما یا : \" پھر بنو حارث بن خزرج ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کو ن ؟فر ما یا : \" پھر بنو ساعدہ ۔ \" صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر کون ہیں ؟فر ما یا : \" پھر انصار کے تمام گھرا نوں میں خیر ہے ۔ \" جب رسول اللہ صلی اللہ علیہ وسلم نے ان کے گھرانےکا نا م لیا تو حضرت سعد بن عبادہ رضی اللہ تعالیٰ عنہ غصے میں کھڑے ہو گئے اور کہا : کیا ہم چاروں میں سے آخری ہیں ؟انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے بات کرنی چا ہی تو ان کی قوم کے لوگوں نے کہا : بیٹھ جاؤ کیا تم اس پر راضی نہیں ہو کہ رسول اللہ صلی اللہ علیہ وسلم نے تمھا رے گھرا نے کا نام ان چار گھرانوں میں لیا ہے جن کا آپ نے نام لیا ہے ۔ حالانکہ جن گھرانوں کو آپ نے چھوڑ دیا اور ان کا نام نہیں لیا ، ان کی تعداد ان سے زیادہ ہے جن کا نام لیا ۔ پھر حضرت سعد بن عبادہ رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم سے بات کرنے سے رک گئے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 6428,
			"arabicnumber": "2513",
			"text": "نصر بن علی جہضمی ، محمد بن مثنیٰ اور ابن بشار نے ابن عرعرہ سے روایت کی ۔ الفاظ جہضمی کے ہیں ۔ انھوں نے کہا : مجھے عرعرہ نے حدیث بیان کی ، انھوں نے کہا : ہمیں شعبہ نے یو نس بن عبید سے حدیث بیان کی ، انھوں نے ثابت بنانی سے ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں حضرت جریر بن عبد اللہ بجلی رضی اللہ تعالیٰ عنہ کے ساتھ سفر کے لیے نکلا ، وہ ( اس سفر میں ) میری خدمت کرتے تھے ، میں نے ان سے کہا : ایسا نہ کریں ، انھوں نے کہا کہ میں نے ( جب ) انصار کو دیکھا کہ وہ نبی صلی اللہ علیہ وسلم کے ساتھ ( خدمت و تواضع ) کا سلوک کرتے ہیں تو میں نے قسم کھا ئی کہ میں جب بھی کسی انصاری کے ساتھ ہوں گا تو اس کی خدمت کروں گا ۔ ابن مثنیٰ اور ابن بشار نے اپنی اپنی حدیث میں مزید یہ بیان کیا ، ( ابن مثنیٰ نے کہا ) حضرت جریر رضی اللہ تعالیٰ عنہ حضرت انس رضی اللہ تعالیٰ عنہ سے بڑے تھے ابن بشار نے کہا : حضرت انس رضی اللہ تعالیٰ عنہ سے عمر میں زیادہ تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 6429,
			"arabicnumber": "2514.01",
			"text": "حضرت ابو ذر رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" غفار ، اللہ ان کی مغفرت کرے اور اسلم ، اللہ انھیں سلامت رکھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 6430,
			"arabicnumber": "2514.02",
			"text": "عبد الرحمٰن بن مہدی نے کہا : ہمیں شعبہ نے ابو عمران جونی سے حدیث بیان کی ، انھوں نے عبد اللہ بن صامت سے ، انھوں نے حضرت ابو ذر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سےفرمایا : \" اپنی قوم کے پاس جاؤاور ( ان سے ) کہو کہ رسول اللہ صلی اللہ علیہ وسلم نےفرما یا ہے ۔ \" اسلم کو اللہ تعا لیٰ سلامت رکھے ۔ \" اورغفار کی اللہ تعالیٰ مغفرت فرمائے",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 6431,
			"arabicnumber": "2514.03",
			"text": "ابو داؤد نے کہا : ہمیں شعبہ نے یہ حدیث اسی سند سے بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 6432,
			"arabicnumber": "2515",
			"text": "محمد ( بن سیرین ) محمد بن زیاد اور اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، نیز ابن جریج اور معقل نے ابو زبیر سے انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، سب نے کہا : نبی صلی اللہ علیہ وسلم سے روایت ہےکہ آپ نے فرمایا : \" اسلم کو اللہ تعالیٰ سلامتی عطاکرے ۔ \" اورغفار کی اللہ تعالیٰ مغفرت فرمائے",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 6433,
			"arabicnumber": "2516",
			"text": "خثیم بن عراک نے اپنے والد سے ، انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : اسلم کو اللہ تعا لیٰ نےسلامتی عطا کی ۔ \" اورغفار کی اللہ تعالیٰ نے مغفرت فرمادی ، یہ میں نے نہیں کہا ، اللہ تعا لیٰ نے فرما یا ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 6434,
			"arabicnumber": "2517",
			"text": "حنظلہ بن علی نے حضرت خفاف بن ایماء غفاری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے نماز میں دعا کرتےہو ئے فرما یا : اے اللہ !بنو لحیان ، رعل ، ذکوان اور عصیہ پر لعنت فر ما جنھوں نے اللہ اور رسول اللہ صلی اللہ علیہ وسلم کی نافرمانی کی ، اورغفار کی اللہ مغفرت فر ما ئے اسلم کو اللہ سلامتی عطا کرے",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 6435,
			"arabicnumber": "2518.01",
			"text": "عبد اللہ بن دینار سے روایت ہے کہ انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" غفار کی اللہ نے مغفرت فرمائی اور اسلم کو اللہ سلامتی عطا کیاور عصیہ نے اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کی نافر ما نی کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 6436,
			"arabicnumber": "2518.02",
			"text": "عبید اللہ ، اسامہ اور ابو صالح سب نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سےانھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی صالح اور اسامہ کی حدیث میں ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے یہ بات منبر پر ارشاد فر ما ئی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 6437,
			"arabicnumber": "2518.03",
			"text": "ابو سلمہ نے کہا : مجھے حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرما تے ہو ئے سنا ، ان سب ( سابقہ حدیث کے راویوں ) کی حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کردہ حدیث کے مانند",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 6438,
			"arabicnumber": "2519",
			"text": "حضرت ابو ایوب رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" انصار مزینہ ، جہینہ ، غفار ، اشجع اور جو بھی بنو عبد اللہ میں سے ہیں ( ان کے علاقے میں رہنے والے ) باقی لوگوں کو چھوڑ کر میرے اپنے مدد گار ہیں اور اللہ اور اس کا رسول ان کے مددگار ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 6439,
			"arabicnumber": "2520.01",
			"text": "سفیان ( بن سعید ) نے سعد بن ابرا ہیم سے ، انھوں نے عبد الرحمان بن ہر مز اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" قریش ، انصار مزینہ جہینہ ، اسلم ، غفار اور اشجع ( میرے ) مدد گار ہیں اور ان کا اللہ اور رسول اللہ صلی اللہ علیہ وسلم کے سوا کو ئی اور مددگار نہیں ہے ۔ ( انھیں خالصتاً اللہ اور اس کے رسول اللہ صلی اللہ علیہ وسلم کی حمایت حاصل ہے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 6440,
			"arabicnumber": "2520.02",
			"text": "عبید اللہ بن معاذ کے والد نے کہا : ہمیں شعبہ نے سعد بن ابرا ہیم سے اسی سند کے ساتھ اسی کے مانند روایت کی ، مگر اس حدیث میں یہ ہے کہ سعد نے ان میں سے بعض قبائل کے بارے میں کہا : \" میرے علم کے مطابق ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 6441,
			"arabicnumber": "2521.01",
			"text": "سعد بن ابرا ہیم سے روایت ہے ، کہا : میں نے ابو سلمہ سے سنا ، وہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور نبی صلی اللہ علیہ وسلم سے روایت کر رہے تھے کہ آپ صلی اللہ علیہ وسلم نے فرمایا : اسلم ، غفاراور مزینہ اور جو لوگ جہینہ سے ہیں یاآپ نے جہینہ فرما یا ، بنو تمیم اور بنو عامر اور دو باہمی حلیفوں اسد اور غطفان سے بہتر ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 6442,
			"arabicnumber": "2521.02",
			"text": "ابو زناد اور صالح نے اعرج سے ، انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اس ذات کی قسم جس کے ہاتھ میں محمد صلی اللہ علیہ وسلم کی جا ن ہے! یقیناً غفار ، اسلم مزینہ اورجو لوگ جہینہ سے ہیں یا آپ نے فرمایا : \" جہینہ اور جو لو گ مزینہ سے ہیں ( خود آکر اسلام قبول کرنے کی بنا پر ) قیامت کے دن اللہ کے نزدیک اسد طے اور غطفان سے بہتر ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 6443,
			"arabicnumber": "2521.03",
			"text": "ایوب نے محمد ( بن سیرین ) سے ، انھوں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرما یا : \" اسلم ، غفار اور مزینہ کے کچھ گھرا نے اور جہینہ یا جہینہ کے کچھ گھرا نے اور مزینہ ، اللہ کے نزدیک ۔ کہا : میرا خیال ہے ( محمد بن سیرین نے ) کہا ۔ ۔ قیامت کے دن اسد ، غطفان ، ہوازن اور تمیم سے ( جنھوں نے خود آکر اسلام قبول نہ کیا ) بہتر ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 6444,
			"arabicnumber": "2522.01",
			"text": "ابو بکربن ابی شیبہ نے ہمیں حدیث بیان کی ، کہا : ہمیں غندر نے شعبہ سے حدیث بیان کی ، اسی طرح محمد بن مثنیٰ اور ابن بشار نے حدیث بیان کی ، دونوں نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے محمد بن ابی یعقوب سے حدیث بیان کی ، کہا : میں نے عبدالرحمان بن ابی بکرہ سے سنا ، وہ اپنے والد سے حدیث بیان کررہے تھے ۔ کہ حضرت اقرع بن حابس ( تمیمی ) رضی اللہ تعالیٰ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے اور کہا : آپ سے حاجیوں کا سامان چرا نے والے ( قبائل ) اسلم اور غفار اور مزینہ اور میرا خیال ہے جہینہ ( کابھی نام لیا ) ۔ ۔ ۔ محمد ( بن یعقوب ) ہیں جنھیں شک ہوا ۔ نے بیعت کر لی ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تمھا را کیا خیال ہے کہ اگر اسلم اور غفار اور مزینہ اور میرا خیال ہے ( آپ نے فرما یا ) جہینہ بنو تمیم ، بنو عامر بنو اسد اور غطفان سے بہتر ہوں تو کیا یہ ( قبیلے لوگوں کی نظر میں مرتبے کے اعتبار سے ) ناکام ہو جا ئیں گے ، خسارے میں رہیں گے؟ \" اس نے کہا : جی ہاں ۔ آپ نے فرما یا : \" مجھے اس ذات کی قسم جس کے ہاتھ میں میری جان ہے! وہ ان سے بہت بہتر ہیں ۔ \" ابن ابی شیبہ کی حدیث میں : \" محمد ( بن یعقوب ) ہیں جنھیں شک ہوا ۔ \" ( کے الفاظ ) نہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 6445,
			"arabicnumber": "2522.02",
			"text": "عبد الصمد نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث سنائی کہا : مجھے بنو تمیم کے سردار محمد بن عبد اللہ بن ابی یعقوب ضبی نے اسی سند کے ساتھ اسی کے مانند حدیث سنائی اور انھوں نے صرف جہینہ کہا : ۔ \" میرا خیال ہے \" ( کاجملہ ) نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 6446,
			"arabicnumber": "2522.03",
			"text": "نصر بن علی جہضمی کے والد نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے ابو بشر سے ، انھوں نے عبد الرحمان بن ابی بکرہ سے انھوں نے اپنے والد سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی کہ آپ صلی اللہ علیہ وسلم نے فر مایا : \" \" اسلم ، غفار مزینہ اور جہینہ بنو تمیم ، بنو عامر اور دو حلیف قبیلوں بنو اسد اور بنو غطفان سے بہتر ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 6447,
			"arabicnumber": "2522.04",
			"text": "عبد الصمد اور شبابہ بن سوار نے کہا : ہمیں شعبہ نے ابوبشر سے اسی سند کے ساتھ حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 6448,
			"arabicnumber": "2522.05",
			"text": "ابو بکر بن ابی شیبہ اور کریب نے ۔ ۔ ۔ اور الفاظ ابو بکر کے ہیں ۔ ۔ ۔ حدیث بیان کی ، دونوں نے کہا : ہمیں وکیع نے سفیان سے حدیث بیان کی ، انھوں نے عبد الملک بن عمیر سے ، انھوں نے عبد الرحمٰن بن ابی بکرہ سے انھوں نے اپنے والد سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" تم لوگ کیا سمجھتے ہو اگر جہینہ ، اسلم اور غفار بنو تمیم ، بنو عبد اللہ بن غطفان اور عامر بن صعصہ سے بہتر ہوں ۔ \" اور ( پوچھتے ہو ئے ) آپ نے آواز بلند کی تو صحابہ کرام رضوان اللہ عنھم اجمعین نے کہا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! پھر وہ ( لوگوں کے نزدیک اپنی عزت بڑھانے میں ) ناکام ہوں گے اورکم مرتبہ ہو جائیں گے ۔ آپ نے فرما یا : \" بے شک وہ ان سے بہتر ہیں ۔ \" ابو کریب کی روایت میں ہے : \" تم کیا سمجھتے ہو اگر جہینہ اور مزینہ اور اسلم اور غفار \" ( مزینہ کے نام کا اضافہ ہے جس طرح متعدد دوسری روایات میں بھی مزینہ کا نا م شامل ہے)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 6449,
			"arabicnumber": "2523",
			"text": "عدی بن حاتم سے روایت ہے ، کہا : میں حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کے پاس آیا تو انھوں نے مجھ سے کہا : سب سے پہلا صدقہ ( باقاعدہ وصول شدہ زکاۃ ) جس نے رسول اللہ صلی اللہ علیہ وسلم اور آپ کے صحا بہ کرام رضوان اللہ عنھم اجمعین کے چہروں کو روشن کر دیا تھا بنو طے کا صدقہ تھا ، جس کو آپ ( عدی رضی اللہ تعالیٰ عنہ ) رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں لے کر آئے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 6450,
			"arabicnumber": "2524",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : حضرت طفیل ( بن عمرو دوسی ) رضی اللہ تعالیٰ عنہ اور ان کے ساتھی آئے اور آکر عرض کی : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ( ہمارے قبیلے ) دوس نے کفر کیا اور ( اسلام لا نے سے ) انکا ر کیا ، آپ ان کے خلا ف دعا کیجیے! ( بعض لوگوں کی طرف سے ) کہا گیا ۔ کہ اب دوس ہلا ک ہو گئے ۔ ( لیکن ) آپ نے ( دعا کرتے ہو ئے ) فر ما یا : \" اے اللہ !دوس کو ہدایت دےاور ان کو ( یہاں ) لےآ ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 6451,
			"arabicnumber": "2525.01",
			"text": "حارث نے ابو زرعہ سے روایت کی ، انھوں نے کہا : حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : میں بنو تمیم کے ساتھ تین باتوں کی وجہ سے جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنیں محبت کرتا آرہا ہوں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرما تے ہو ئے سنا ، یہ میری امت میں سے دجال کے خلا ف زیادہ سخت ہوں گے ۔ کہا : اور ان لوگوں کے صدقات ( زکاۃ کے اموال ) آئے تو نبی صلی اللہ علیہ وسلم نےفرمایا : \" یہ ہماری اپنی قوم کے صدقات ہیں ۔ کہا : ان میں سے جنگ میں پکڑی ہو ئی ایک باندی حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس تھی ۔ آپ نے ان سے فرما یا : \" اسے آزاد کردو ۔ یہ حضرت اسماعیل علیہ السلام کی اولا د میں سے ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 6452,
			"arabicnumber": "2525.02",
			"text": "عمارہ نے ابو زرعہ سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : تین باتوں کے بعد جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنیں ، میں بنو تمیم سے مسلسل محبت کرتا آرہا ہوں ، پھر اسی ( سابقہ حدیث ) کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 6453,
			"arabicnumber": "2525.03",
			"text": "۔ شعبی نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : تین صفات ہیں جو میں نے بنوتمیم کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے سنیں اس کے بعد سے میں ان سے محبت کرتا ہوں اور ( آگے ) اسی معنی میں حدیث بیان کی ، البتہ ( شعبی نے ) یہ کہا : \" وہ ( مستقبل میں ہو نے والی ) بڑی جنگوں کے دوران میں لڑنے میں سب لوگوں سے زیادہ سخت ہوں گے ۔ \" اور انھوں نے دجال کا ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 6454,
			"arabicnumber": "2526.01",
			"text": "ابن شہاب نے کہا : مجھے سعید بن مسیب نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : تم لوگوں کو کانوں کی طرح پاؤ گے ۔ پس جو جاہلیت میں بہتر تھے وہ اسلام میں بھی بہتر ہیں جب دین میں سمجھدار ہو جائیں اور تم بہتر اس کو پاؤ گے جو مسلمان ہونے سے پہلے اسلام سے بہت نفرت رکھتا ہو ( یعنی جو کفر میں مضبوط تھا وہ اسلام لانے کے بعد اسلام میں بھی ایسا ہی مضبوط ہو گا جیسے سیدنا عمر اور سیدنا خالد بن ولید رضی اللہ عنہما وغیرہ یا یہ مراد ہے کہ جو خلافت سے نفرت رکھے اسی کی خلافت عمدہ ہو گی ) ۔ اور تم سب سے برا اس کو پاؤ گے جو دو روّیہ ہو کہ ان کے پاس ایک منہ لے کر آئے اور ان کے پاس دوسرا منہ لے کر جائے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 6455,
			"arabicnumber": "2526.02",
			"text": "ابو زرعہ اور اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم لوگوں کو معدنیات کی کانوں کی طرح پاؤگے ۔ ۔ ۔ \" ( آگے اسی طرح ہے ) جس طرح زہری کی حدیث ہے ، البتہ ابو زرعہ اور اعرج کی روایت میں ہے : \" تم اس ( دین کے ) معاملے میں سب لوگوں سے بہتر انھیں پاؤگے جو اس ( دین ) میں داخل ہونے سے پہلے سب لوگوں سے بڑھ کر اس کو ناپسند کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 6456,
			"arabicnumber": "2527.01",
			"text": "ابن ابی عمر نے کہا : ہمیں سفیان بن عیینہ نے ابو زناد سے حدیث بیان کی ، انھوں نے اعرج سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی اور ابن طاوس نے اپنے والد سے اور انھوں نے حضرت ابو ہریرۃ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ان عورتوں میں سے بہترین جو اونٹوں پر سوار ہوتی ہیں ۔ ان دونوں ( اعرج اورطاؤس ) میں سے ایک نے کہا : قریش کی نیک عورتیں ہیں اور دوسرے نے کہا : قریش کی عورتیں ہیں ۔ جو یتیم بچے کی کم عمری میں اس پر سب سے زیادہ مہربان ہوتی ہیں اور اپنے شوہر کے مال کی سب سے زیادہ حفاظت کرنے والی ہوتی ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 6457,
			"arabicnumber": "2527.02",
			"text": "عمرو ناقد نےکہا : ہمیں سفیان نے ابو زناد سے حدیث بیان کی ، انھوں نے اعرض سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی جو اسے رسول اللہ صلی اللہ علیہ وسلم تک پہنچاتے تھے ( آپ سے روایت کرتے تھے ۔ ) اس ( سابقہ روایت ) کے مانند ، اور ابن طاوس نے اپنے والد سے روایت کی جو اسے نبی کریم صلی اللہ علیہ وسلم تک پہنچاتے تھے ، مگر انھوں نے اس طرح کہا : \" وہ ا پنے بچے کی اس کی کم سنی میں سب سے زیادہ نگہداشت کرنے والی ہوتی ہیں ۔ \" انھوں نے \" یتیم ( پر ) \" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 6458,
			"arabicnumber": "2527.03",
			"text": "یونس نے ابن شہاب سے روایت کی ، انھوں نے کہا : مجھے سعید بن مسیب نے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ سے سنا ، آپ نے فرمایا : \"\" قریش کی عورتیں اونٹوں پر سواری کرنے والی تمام عورتوں میں سب سے اچھی ہیں ، بچے پر سب سے بڑھ کر مہربان ہیں اور اپنے خاوند کے لئے اس کے مال کی سب سے زیادہ حفاظت کرنے والی ہیں ۔ \"\" ( سعیدبن مسیب نے ) کہا : ابو ہریرہ رضی اللہ تعالیٰ عنہ اس کے بعد کہا کر تے تھے : مریم بنت عمران علیہ السلام اونٹ پر کبھی سوار نہیں ہوئیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 6459,
			"arabicnumber": "2527.04",
			"text": "معمر نے زہری سے ، انھوں نے ابن مسیب سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم نے حضرت ام ہانی بنت ابی طالب رضی اللہ تعالیٰ عنہ کو نکاح کا پیغام بھجوایا ، انھوں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !اب میں بوڑھی ہوگئی ہوں اور میرےبہت سے بچے ہیں ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( اونٹوں پر ) سوار ہونے والی عورتوں میں سے بہترین \" پھر یونس کی حدیث کی طرح بیان کیا مگر یوں کیا : \" اس کی کم سنی میں بچے پر سب سے زیادہ مہربان ہوتی ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 6460,
			"arabicnumber": "2527.05",
			"text": "معمر نے ابن طاوس سے اورانھوں نے اپنے والد سے روایت کی ، نیز معمر نے ہمام بن منبہ سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اونٹوں پر سفر کرنے والی عورتوں میں سے بہترین ، قریش کی نیک عورتیں ہیں جو بچے پر اس کی کم سنی میں زیادہ شفقت کرنے و الی ہوتی ہیں اور اپنے خاوند کے مال کی زیادہ حفاظت کرتی ہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 6461,
			"arabicnumber": "2527.06",
			"text": "سہیل ( بن ابی صالح ) نے اپنے والد سے ، انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے معمر کی حدیث کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 6462,
			"arabicnumber": "2528",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابوعبیدہ بن جراح اور حضرت ابو طلحہ رضی اللہ تعالیٰ عنہ کو ایک دوسرے کا بھائی بنایا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 6463,
			"arabicnumber": "2529.01",
			"text": "حفص بن غیاث نے کہا : ہمیں عاصم احول نے حدیث بیان کی ، انھوں نے کہا : حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے پوچھا گیا : کیا آپ تک یہ بات پہنچی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" اسلام میں حلیف بننا بنانا ( جائز ) نہیں \" ؟حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ان کے مکان میں قریش اور انصار کو ایک دوسرے کا حلیف بنایا تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 6464,
			"arabicnumber": "2529.02",
			"text": "عبدہ بن سلیمان نے عاصم سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے مدینہ میں میرے گھر میں قریش اور انصار کو ایک دوسرے کا حلیف بنایا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 6465,
			"arabicnumber": "2530",
			"text": "سعد بن ابراہیم نے ا پنے والد سے ، انھوں نے حضرت جبیربن مطعم رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" اسلام میں ایک دوسرے کو حلیف بنانے کی ضرورت نہیں ، جو شخص کا جاہلیت میں جو حلف تھا ، اسلام نے اس کی مضبوطی میں اور اضافہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 6466,
			"arabicnumber": "2531",
			"text": "سعید بن ابی بردہ نے ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے ، انھوں نے ا پنے والد ( ابوموسیٰ اشعری رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : ہم نے مغرب کی نماز رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پڑھی ، پھر ہم نے کہا کہ اگر ہم بیٹھے رہیں یہاں تک کہ عشاء آپ صلی اللہ علیہ وسلم کے ساتھ پڑھیں تو بہتر ہو گا ۔ پھر ہم بیٹھے رہے اور آپ صلی اللہ علیہ وسلم باہر تشریف لائے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم یہیں بیٹھے رہے ہو؟ ہم نے عرض کیا کہ جی ہاں یا رسول اللہ! ہم نے آپ صلی اللہ علیہ وسلم کے ساتھ نماز مغرب پڑھی ، پھر ہم نے کہا کہ اگر ہم بیٹھے رہیں یہاں تک کہ عشاء کی نماز بھی آپ صلی اللہ علیہ وسلم کے ساتھ پڑھیں تو بہتر ہو گا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم نے اچھا کیا یا ٹھیک کیا ۔ پھر آپ صلی اللہ علیہ وسلم نے اپنا سر آسمان کی طرف اٹھایا اور آپ صلی اللہ علیہ وسلم اکثر اپنا سر آسمان کی طرف اٹھایا کرتے تھے ، پھر فرمایا کہ ستارے آسمان کے بچاؤ ہیں ، جب ستارے مٹ جائیں گے تو آسمان پر بھی جس بات کا وعدہ ہے وہ آ جائے گی ( یعنی قیامت آ جائے گی اور آسمان بھی پھٹ کر خراب ہو جائے گا ) ۔ اور میں اپنے اصحاب کا بچاؤ ہوں ۔ جب میں چلا جاؤں گا تو میرے اصحاب پر بھی وہ وقت آ جائے گا جس کا وعدہ ہے ( یعنی فتنہ اور فساد اور لڑائیاں ) ۔ اور میرے اصحاب میری امت کے بچاؤ ہیں ۔ جب اصحاب چلے جائیں گے تو میری امت پر وہ وقت آ جائے گا جس کا وعدہ ہے ( یعنی اختلاف و انتشار وغیرہ ) ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 6467,
			"arabicnumber": "2532.01",
			"text": "عمرو ( بن دینار ) نے حضرت جابر ( بن عبداللہ رضی اللہ تعالیٰ عنہ ) سے سنا ، وہ حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ سے خبر دیتے تھے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نےفرمایا : \" ایک زمانہ آئے گا کہ آدمیوں کے جھنڈ جہاد کریں گے تو ان سے پوچھیں گے کہ کوئی تم میں سے وہ شخص ہے جس نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ہو؟ تو وہ لوگ کہیں گے کہ ہاں! تو ان کی فتح ہو جائے گی ۔ پھر لوگوں کے گروہ جہاد کریں گے تو ان سے پوچھیں گے کہ تم میں سے کوئی وہ ہے جس نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی کو دیکھا ہو ( یعنی تابعین میں سے کوئی ہے؟ ) لوگ کہیں کے کہ ہاں! پھر ان کی فتح ہو جائے گی ۔ پھر آدمیوں کے لشکر جہاد کریں گے تو ان سے پوچھا جائے گا کہ تم میں سے کوئی وہ ہے جس نے صحابی کے دیکھنے والے کو دیکھا ہو ( یعنی تبع تابعین میں سے ) ؟ تو لوگ کہیں گے کہ ہاں ۔ پھر لوگوں کے گروہ جہاد کریں گے تو پوچھیں گے کہ کیا تم میں کوئی ایسا آدمی ہے جس نے اتباع تابعین کو دیکھا ہو؟",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 6468,
			"arabicnumber": "2532.02",
			"text": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ کو یقین تھا ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" لوگوں پر ایسا زمانہ آئے گا کہ ان میں سے کوئی لشکر بھیجاجائے گا تو لوگ کہیں گے : دیکھو ، کیا تم میں رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں سے کوئی فرد ہے؟تو ایک شخص مل جائے گا ، چنانچہ اس کی وجہ سے انھیں فتح مل جائے گی ، پھر ایک اور لشکر بھیجا جائے گا تو لوگ ( آپس میں ) کہیں گے : کیا ان میں کوئی ایسا شخص ہے جس نے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کو دیکھا ہو؟تو انھیں اس ( شخص ) کی بنا پر فتح حاصل ہوجائےگی ، پھر تیسرا لشکر بھیجاجائے گا تو کہا جائے گا : دیکھو ، کیا ان میں کوئی ایسا دیکھتے ہو جس نے نبی کریم صلی اللہ علیہ وسلم کے صحابہ کو دیکھنے والوں کو دیکھا ہو؟پھر چوتھا لشکر بھیجاجائے گاتو کہا جائے گا : دیکھو ، کیا ان میں کوئی ایسا شخص دیکھتے ہو جس نے کسی ایسے آدمی کو دیکھا ہو جس نے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ کو دیکھنے والوں میں سے کسی کو دیکھا ہو؟تو وہ آدمی مل جائے گا اور اس کی وجہ سے انھیں فتح مل جائے گی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 6469,
			"arabicnumber": "2533.01",
			"text": "قتیبہ بن سعید اور ہناد بن سری نے کہا : ہمیں ابواحوص نے منصور سے حدیث بیان کی ، انھوں نے ابراہیم بن یزید سے ، انھوں نے عبیدہ سلیمانی سے ، انھوں نے حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میر ی امت میں سے بہترین اس دور کے لوگ ہیں جو میرے ساتھ ہیں ( صحابہ ) ، پھر وہ ہیں جو ان کےساتھ ( کے دور میں ) ہوں گے ( تابعین ) ، پھر وہ جوان کے ساتھ ( کے دور میں ) ہوں گے ( تبع تابعین ) ، پھر ایسے لوگ آئیں گے کہ ان کی گواہی ان کی قسم سے پہلے ہوگی ۔ اور ان کی قسم ان کی گواہی سے پہلے ہوگی ۔ \" ہناد نے اپنی حدیث میں قرن ( دور ) کا ذکر نہیں کیا ۔ اور قتیبہ نے کہا : \" پھر ایسی اقوام آئیں گی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 6470,
			"arabicnumber": "2533.02",
			"text": "جریر نے منصور سے ، انھوں نے ابراہیم سے ، انھوں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا گیا : لوگوں میں سب سے بہتر کون ہیں؟آپ نے فرمایا : \"\" میرے دور کے لوگ پھر وہ جو ان کے ساتھ ( کے دور میں ) ہوں گے ، پھر وہ جو ان کے ساتھ ہوں گے ، پھر ایک ایسی قوم آئے گی کہ ان کی شہادت ان کی قسم سے جلدی ہوگی اور ان کی قسم انکی شہادت سے جلدی ہوگی ۔ \"\" ابراہیم ( نخعی ) نے کہا : جس وقت ہم کم عمر تھے ( تو بڑی عمرکے ) لوگ ہمیں قسم کھانے اور شہادت دینے سے منع کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 6471,
			"arabicnumber": "2533.03",
			"text": "شعبہ اور سفیان دونوں نے منصور سے ابو احوص اور جریر کی سند کے ساتھ انھی دونوں کی حدیث کے ہم معنی حدیث روایت کی ، دونوں کی حدیث میں \" رسول اللہ صلی اللہ علیہ وسلم سے سوال کیاگیا \" ( کے الفاظ ) نہیں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 6472,
			"arabicnumber": "2533.04",
			"text": "ابن عون نے ابراہیم سے ، انھوں نے عبیدہ سے ، انھوں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا؛ \" لوگوں میں سے بہترین میرے دور کے لوگ ( صحابہ رضوان اللہ عنھم اجمعین ) ہیں ، پھر وہ جو ان کے ساتھ ( کے دورکے ) ہوں گے ( تابعین رحمۃ اللہ علیہ ) ، پھر وہ جوان کے ساتھ ( کے دور کے ) ہوں گے ( تبع تابعین ۔ ) \" ( عبیدہ سلیمانی نے کہا : ) مجھے یاد نہیں ( کہ حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ نے ) تیسری بار کہا یاچوتھی بار : \" پھر ان کے جانشین ایسے لوگ ہوں گے کہ ان میں سے کسی ایک کی گواہی قسم سے پہلے ہوگی اوراور اس کی قسم اس کی گواہی سے پہلے ہوگی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 6473,
			"arabicnumber": "2534.01",
			"text": "ہشیم نے ابو بشر سے ، انھوں نے عبداللہ بن شقیق سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میری امت کے بہترین لوگ اس زمانے کے ہیں جن میں میری بعثت ہوئی ہے ، پھر وہ لوگ ہیں جو ان کے ساتھ ( کے دور کے ) ہیں ۔ \" اللہ ہی خوب جانتا ہے کہ آپ نے تیسرے زمانے کا ذکر کیاتھا یا نہیں ، فرمایا؛ \" پھر ایک ایسی قوم آئے گی جو موٹا ہونا پسند کریں گے ، وہ شہادت طلب کیے جانے سے پہلے شہادت دیں گے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 6474,
			"arabicnumber": "2534.02",
			"text": "شعبہ اور ابو عوانہ دونوں نے ابو بشر سے اسی سند کے ساتھ اسی کے مانند روایت کی ، مگر شعبہ کی حدیث میں ہے : ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : میں نہیں جانتا ( کہ آپ نے ) دوبار ( کہا ) یا تین بار ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 6475,
			"arabicnumber": "2535.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے ابو جمرہ سے سنا ، انھوں نےکہا : مجھے زہدم بن مضرب نے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ سے سنا ، وہ حدیث بیان کررہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سب سے اچھے میرے دور کے لوگ ہیں ، پھر وہ جو ان کے ساتھ ہیں ۔ پھر وہ جو ان کے ساتھ ہیں ، پھر وہ لوگ جو ان کے ساتھ ہیں ، \" حضرت عمران رضی اللہ تعالیٰ عنہ نے کہا : مجھے یاد نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے دور کے بعد دوبار فرمایا یا تین بار؟ ( پھر آپ نے فرمایا : ) \" پھر ان کے بعد وہ لوگ ہوں گے کہ وہ گواہی دیں گے جبکہ ان سے گواہی مطلوب نہیں ہوگی اورخیانت کریں جبکہ ان کو امانت دار نہیں بنایا جائے گا ( جس مال کی ذمہ داری ان کے پاس نہیں ہوگی اس میں بھی خیانت کے راستے نکالیں گے ) ، وہ نذر مانیں گے لیکن اپنی نذریں پوری نہیں کریں گے اور ان میں موٹاپا ظاہر ہوجائے گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 6476,
			"arabicnumber": "2535.02",
			"text": "یحییٰ بن سعید ، بہز اور شبابہ سب نے شعبہ سے اسی سند کے ساتھ حدیث بیان کی اور ان سب کی حدیث میں ہے ( حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ نے ) کہا : مجھے یاد نہیں کہ آپ صلی اللہ علیہ وسلم نے اپنے زمانے کےبعد دو زمانوں کا ذکر کیا یا تین کا ، شبابہ کی حدیث میں ہے کہ ( ابو جمرہ نے ) کہا : میں نے زہدم بن مضرب سےسنا ، وہ گھوڑے پرسوارہوکرمیرے پاس ایک کام کے لئے آئے تھے ، انھوں نے مجھے حدیث سنائی کہ انھوں نے حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ سے سنا ، نیز یحییٰ ( بن سعید ) اورشبابہ کی حدیث میں ہے : \" وہ نذریں مانیں گے لیکن وفا نہیں کریں گے ۔ \" اور بہز کی حدیث میں اسی طرح ہے جس طرح ابن جعفر کی حدیث میں ہے : \" وہ ( اپنی نذریں ) پوری نہیں کریں گے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 6477,
			"arabicnumber": "2535.03",
			"text": "ابو عوانہ اور ہشام دونوں نے قتادہ سے ، انھوں نے زرارہ بن اوفیٰ سے ، انھوں نے حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے یہ حدیث ( ان الفاظ میں ) روایت کی : \" اس امت کے بہترین لوگ اس دور کے ہیں جس میں مجھے ان میں بھیجاگیا ہے ، پھر وہ جوان کےساتھ ( کے دور میں ) ہوں گے ۔ \" ۔ ۔ ۔ ابو عوانہ کی حدیث میں مزید یہ ہے کہ ( حضرت عمران رضی اللہ تعالیٰ عنہ نے ) کہا : اللہ زیادہ جاننے والا ہے کہ آپ صلی اللہ علیہ وسلم نے تیسرے ( دور ) کا ذکر کیا یا نہیں ، جس طرح حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ سےزہدم کی روایت کردہ حدیث ہے ۔ اور قتادہ سے ہشام کی روایت کردہ حدیث میں یہ الفاظ زائد ہیں : \" وہ قسمیں کھائیں گے جبکہ ان سے قسم کھانے کا مطالبہ نہیں کیا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 6478,
			"arabicnumber": "2536",
			"text": "عبداللہ بہی نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا کہ کون سے لوگ سب سے بہتر ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس دور میں جس میں ہوں ، پھر دوسرے ( دورکے ) ، پھر تیسرے ( دور کے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 6479,
			"arabicnumber": "2537.01",
			"text": "معمر نے زہری سے روایت کی ، انھوں نے کہا : مجھے سالم بن عبداللہ اور ابو بکر بن سلیمان نے بتا یا کہ عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : نبی صلی اللہ علیہ وسلم نے اپنی حیات مبا رکہ کے آخری حصے میں ایک را ت ہمیں عشاء کی نما ز پڑھا ئی ، جب آپ صلی اللہ علیہ وسلم نے سلا م پھیرا تو کھڑے ہو گئے تو فرما یا : \" کیا تم لوگوں نے اپنی اس را ت کو دیکھا ہے؟ ( اسے یا د رکھو ) بلا شبہ اس رات سے سو سال کے بعد جو لو گ ( اس را ت میں ) روئے زمین پر مو جودہیں ان میں سے کو ئی بھی باقی نہیں ہو گا ۔ \" حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : ( بعض ) لو گ رسول اللہ صلی اللہ علیہ وسلم کے فر ما ن کے متعلق غلط فہمیوں میں مبتلا ہوئے ہیں جو اس میں سو سال کے حوالے سے مختلف باتیں کر رہے ہیں ( کہ سو سال بعد زندگی کا خاتمہ ہو جا ئے گا ۔ ) رسول اللہ صلی اللہ علیہ وسلم نے یہ فرما یا تھا ۔ \" آج جو لوگ روئےزمین پر مو جو د ہیں ان میں سے کو ئی باقی نہیں ہو گا ۔ \" آپ کا مقصود یہ تھا کہ اس قرن ( اس دور میں رہنے والے لوگوں ) کا خاتمہ ہو جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 6480,
			"arabicnumber": "2537.02",
			"text": "شعیب اور عبد الرحمٰن بن خالد بن مسافر دونوں نے زہری سے معمر کی سند کے ساتھ انھی کی حدیث کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 6481,
			"arabicnumber": "2538.01",
			"text": "حجاج بن محمد نے کہا : ابن جریج نے کہا : مجھے ابو زبیر نے بتا یا ، انھوں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سناکہ میں نے نبی صلی اللہ علیہ وسلم کو اپنی وفات سے ایک مہینہ قبل یہ فر ما تے ہو ئے سنا : \" تم مجھ سے قیامت کے بارے میں سوال کرتے ہو ؟اس کا علم صرف اور صرف اللہ تعالیٰ کے پاس ہے ( البتہ اس بات پر ) میں اللہ کی قسم کھا تا ہوں کہ اس وقت کو ئی زندہ نفس موجود نہیں جس پر سوسال پورے ہوں ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 6482,
			"arabicnumber": "2538.02",
			"text": "ابن جریج نے اسی سند کے ساتھ ہمیں خبر دی اور اس بات کا ذکر نہیں کیا کہ ( آپ نے ) اپنی وفات سے ایک ماہ قبل ( یہ ارشاد فرمایا تھا ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 6483,
			"arabicnumber": "2538.03",
			"text": "معتمر بن سلیمان نے کہا : میں نے اپنے والد سے سنا ، کہا : ابو نضرہ نے ہمیں حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے ، انھوں نے نبی صلی اللہ علیہ وسلم سے حدیث بیان کی ، انھوں نے کہا : آپ نے اپنی وفات سے ایک مہینہ یا قریباًاتنا عرصہ پہلے فرما یا : \" آج کو ئی ایسا سانس لیتا ہوا انسان موجود نہیں کہ اس پر سوسال گزریں تو وہ اس دن بھی زندہ ہو ۔ اور لوگوں کو پانی پلا نے والے عبدالرحمان ( بن آدم ) سے روایت ہے انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔ عبدالرحمان نے اس کا مفہوم بتا یا اور کہا : عمر کی کمی ( مراد ہے)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 6484,
			"arabicnumber": "2538.04",
			"text": "یزید بن ہارون نے کہا : ہمیں سلیمان تیمی نے دونوں سندوں سے اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 6485,
			"arabicnumber": "2539",
			"text": "ابو نضر ہ نے حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : جب نبی صلی اللہ علیہ وسلم غزوہ تبوک سے واپس آئے تو اس کے بعد لوگوں نے آپ سے قیامت کے بارے میں سوال کیا رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" سو سال نہیں گزریں گے ۔ کہ آج زمین پر سانس لیتا ہوا کو ئی شخص موجود ہو ۔ \" ( اس سے پہلے یہ سب ختم ہو جا ئیں گے ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 6486,
			"arabicnumber": "2538.05",
			"text": "حصین نے سالم سے ، انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم نے فرما یا : \" ( آج ) سانس لیتا ہوا شخص سو سال ( کی مدت ) تک نہیں پہنچےگا ۔ \" سالم نے کہا : ہم نے ان ( حضرت جابر رضی اللہ تعالیٰ عنہ ) کے سامنے اس کے بارے میں گفتگو کی اس سے مراد ہر وہ شخص ہے جو اس وقت پیدا ہو چکا تھا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 6487,
			"arabicnumber": "2540",
			"text": "ابو معاویہ نے اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے صحابہ کرام رضوان اللہ عنھم اجمعین کو برا مت کہو ، میرے صحابہ کرام رضوان اللہ عنھم اجمعین کہو ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ !اگر تم میں سے کو ئی شخص اُحد پہا ڑ جتنا سونا بھی خرچ کرے تو وہ ( صحابہ کرام رضوان اللہ عنھم اجمعین ) میں سے کسی ایک کے دیے ہو ئے مد بلکہ اس کے آدھے کے برابر بھی ( اجر ) نہیں پاسکتا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 6488,
			"arabicnumber": "2541.01",
			"text": "جریر نے اعمش سے ، انھوں نے ابو صالح سے ، انھوں نے حضرت ابو سعید ( خدری ) رضی اللہ تعالیٰ عنہ سے روایت کی کہ حضرت خالد بن ولید اور عبدالرحمان بن عوف رضی اللہ تعالیٰ عنہ کے درمیان کو ئی مناقشہ تھا ، حضرت خالد رضی اللہ تعالیٰ عنہ نے ان کو برا کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" میرے صحابہ کرام رضوان اللہ عنھم اجمعین میں سے کسی کو برا نہ کہو ، کیونکہ تم میں سے کسی شخص نے اگر اُحدپہاڑ کے برابرسونا بھی خرچ کیاتو وہ ان میں سے کسی کے دیے ہو ئے ایک مدکے برابر بلکہ اس کے آدھے کے برابر بھی ( اجر ) نہیں پاسکتا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 6489,
			"arabicnumber": "2541.02",
			"text": "وکیع اور شعبہ نے اعمش سے جریر اور ابو معاویہ کی سند کے ساتھ ان دونوں کی حدیث کے مانند روایت کی ، لیکن شعبہ اور وکیع کی حدیث میں عبدالرحمٰن بن عوف اور خالد بن ولید رضی اللہ تعالیٰ عنہ کا تذکرہ نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 6490,
			"arabicnumber": "2542.01",
			"text": "سلیمان بن مغیرہ نے کہا : مجھے سعید جریری نے ابو نضرہ سے حدیث بیان کی ، انھوں نے اُسیر بن جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ اہل کوفہ ایک وفد میں حضرت عمر فاروق رضی اللہ تعالیٰ عنہ کے پاس آئے ، ان میں ایک ایسا آدمی بھی تھا جو حضرت اویس رضی اللہ تعالیٰ عنہ کا ٹھٹا اڑاتا تھا ، حضرت عمر رضی اللہ تعالیٰ عنہ نے پوچھا : یہاں قرن کے رہنے والوں میں سے کوئی ہے؟وہ شخص ( آگے ) آگیاتوحضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" تمھارے پاس یمن سے ایک شخص آئے گا ، اس کا نام اویس ہوگا ، یمن میں اس کی والدہ کےسوا کوئی نہیں جسے وہ چھوڑ کرآئے ۔ اس ( کے جسم ) پرسفید ( برص کے ) نشان ہیں ۔ اس نے اللہ سے دعا کی تو اللہ نے ایک دینار یا درہم کے برابر چھوڑ کر باقی سارا نشان ہٹادیا ، وہ تم میں سے جس کو ملے ( وہ اس سے درخواست کرےکہ ) وہ تم لوگوں کےلیے مغفرت کی دعاکرے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 6491,
			"arabicnumber": "2542.02",
			"text": "حماد بن سلمہ نے سعید جریری سے اسی سند کےساتھ حدیث بیان کی ، کہا : سیدنا عمر بن خطاب رضی اللہ عنہ سے روایت ہے کہا : کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ تابعین میں ایک بہترین شخص ہے جس کو اویس کہتے ہیں ، اس کی ایک ماں ہے ( یعنی رشتہ داروں میں سے صرف ماں زندہ ہو گی ) اور اس کو ایک سفیدی ہو گی ۔ تم اس سے کہنا کہ تمہارے لئے دعا کرے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 6492,
			"arabicnumber": "2542.03",
			"text": "زرارہ بن اوفیٰ نے اُسیر بن جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ سیدنا عمر بن خطاب رضی اللہ عنہ کے پاس جب یمن سے مدد کے لوگ آتے ( یعنی وہ لوگ جو ہر ملک سے اسلام کے لشکر کی مدد کے لئے جہاد کرنے کو آتے ہیں ) تو وہ ان سے پوچھتے کہ تم میں اویس بن عامر بھی کوئی شخص ہے؟ یہاں تک کہ سیدنا عمر رضی اللہ عنہ خود اویس کے پاس آئے اور پوچھا کہ تمہارا نام اویس بن عامر ہے؟ انہوں نے کہا کہ ہاں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ تم مراد قبیلہ کی شاخ قرن سے ہو؟ انہوں نے کہا کہ ہاں ۔ انہوں نے پوچھا کہ تمہیں برص تھا وہ اچھا ہو گیا مگر درہم برابر باقی ہے؟ انہوں نے کہا کہ ہاں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ تمہاری ماں ہے؟ انہوں نے کہا کہ ہاں ۔ تب سیدنا عمر رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ تمہارے پاس اویس بن عامر یمن والوں کی کمکی فوج کے ساتھ آئے گا ، وہ قبیلہ مراد سے ہے جو قرن کی شاخ ہے ۔ اس کو برص تھا وہ اچھا ہو گیا مگر درہم باقی ہے ۔ اس کی ایک ماں ہے ۔ اس کا یہ حال ہے کہ اگر اللہ کے بھروسے پر قسم کھا بیٹھے تو اللہ تعالیٰ اس کو سچا کرے ۔ پھر اگر تجھ سے ہو سکے تو اس سے اپنے لئے دعا کرانا ۔ تو میرے لئے دعا کرو ۔ پس اویس نے سیدنا عمر رضی اللہ عنہ کے لئے بخشش کی دعا کی ۔ تو سیدنا عمر رضی اللہ عنہ نے کہا کہ تم کہاں جانا چاہتے ہو؟ انہوں نے کہا کہ کوفہ میں ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ میں تمہیں کوفہ کے حاکم کے نام ایک خط لکھ دوں؟ انہوں نے کہا کہ مجھے خاکساروں میں رہنا اچھا معلوم ہوتا ہے ۔ جب دوسرا سال آیا تو ایک شخص نے کوفہ کے رئیسوں میں سے حج کیا ۔ وہ سیدنا عمر رضی اللہ عنہ سے ملا تو سیدنا عمر رضی اللہ عنہ نے اس سے اویس کا حال پوچھا تو وہ بولا کہ میں نے اویس کو اس حال میں چھوڑا کہ ان کے گھر میں اسباب کم تھا اور ( خرچ سے ) تنگ تھے ۔ سیدنا عمر رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اویس بن عامر تمہارے پاس یمن والوں کے امدادی لشکر کے ساتھ آئے گا ، وہ مراد قبیلہ کی شاخ قرن میں سے ہے ۔ اس کو برص تھا وہ اچھا ہو گیا صرف درہم کے برابر باقی ہے ۔ اس کی ایک ماں ہے جس کے ساتھ وہ نیکی کرتا ہے ۔ اگر وہ اللہ پر قسم کھا بیٹھے تو اللہ تعالیٰ اس کو سچا کرے ۔ پھر اگر تجھ سے ہو سکے کہ وہ تیرے لئے دعا کرے تو اس سے دعا کرانا ۔ وہ شخص یہ سن کر اویس کے پاس آیا اور کہنے لگا کہ میرے لئے دعا کرو ۔ اویس نے کہا کہ تو ابھی نیک سفر کر کے آ رہا ہے ( یعنی حج سے ) میرے لئے دعا کر ۔ پھر وہ شخص بولا کہ میرے لئے دعا کر ۔ اویس نے یہی جواب دیا پھر پوچھا کہ تو سیدنا عمر رضی اللہ عنہ سے ملا؟ وہ شخص بولا کہ ہاں ملا ۔ اویس نے اس کے لئے دعا کی ۔ اس وقت لوگ اویس کا درجہ سمجھے ۔ وہ وہاں سے سیدھے چلے ۔ اسیر نے کہا کہ میں نے ان کو ان کا لباس ایک چادر پہنائی جب کوئی آدمی ان کو دیکھتا تو کہتا کہ اویس کے پاس یہ چادر کہاں سے آئی ہے؟ ( وہ ایسے تھے کہ ایک مناسب چادر بھی ان کے پاس ہونا باعث تعجب تھا ۔)",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 6493,
			"arabicnumber": "2543.01",
			"text": "ابن وہب نے کہا : ہمیں حرملہ بن عمران تحبیی نے عبدالرحمٰن بن شماسہ مہری سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت ابوذر رضی اللہ تعالیٰ عنہ سے سنا ، کہتے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" تم عنقریب ایک زمین کو فتح کرو گےجس میں قیراط کا نام لیا جاتا ہوگا ( یہ ان کے چھوٹے سکے کا نام ہوگا ) تم اس سرزمین کے رہنے والوں کے ساتھ اچھا سلوک کرنے کی بات سن رکھو ، کیونکہ ان کا ( ہم پر ) حق بھی ہے اور رشتہ بھی ، پھر جب تم دو انسانوں کو ایک اینٹ کی جگہ کے لئے قتال پر آمادہ دیکھو تو وہاں سے چلے آنا ۔ \"\" ( حرملہ بن عمران نے ) کہا : تو ( عبدالرحمان بن شماسہ ) حضرت شرجیل بن حسنہ رضی اللہ تعالیٰ عنہ کے دو بیٹوں ربیعہ اور عبدالرحمان کے قریب سے گزرے ، وہ ایک اینٹ کی جگہ پر جھگڑ رہے تھے تو وہ وہاں ( مصر ) سے نکل آئے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 6494,
			"arabicnumber": "2543.02",
			"text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ ، وَعُبَيْدُ اللهِ بْنُ سَعِيدٍ ، قَالَا : حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ ، حَدَّثَنَا أَبِي ، سَمِعْتُ حَرْمَلَةَ الْمِصْرِيَّ ، يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ ، عَنْ أَبِي بَصْرَةَ ، عَنْ أَبِي ذَرٍّ ، قَالَ : قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : «إِنَّكُمْ سَتَفْتَحُونَ مِصْرَ وَهِيَ أَرْضٌ يُسَمَّى فِيهَا الْقِيرَاطُ ، فَإِذَا فَتَحْتُمُوهَا فَأَحْسِنُوا إِلَى أَهْلِهَا ، فَإِنَّ لَهُمْ ذِمَّةً وَرَحِمًا» أَوْ قَالَ «ذِمَّةً وَصِهْرًا ، فَإِذَا رَأَيْتَ رَجُلَيْنِ يَخْتَصِمَانِ فِيهَا فِي مَوْضِعِ لَبِنَةٍ ، فَاخْرُجْ مِنْهَا» قَالَ : فَرَأَيْتُ عَبْدَ الرَّحْمَنِ بْنَ شُرَحْبِيلَ بْنِ حَسَنَةَ ، وَأَخَاهُ رَبِيعَةَ يَخْتَصِمَانِ فِي مَوْضِعِ لَبِنَةٍ فَخَرَجْتُ مِنْهَا",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 6495,
			"arabicnumber": "2544",
			"text": "جابر بن عمرو راسبی نے کہا : میں نے حضرت ابو برزہ رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو قبائل عرب میں سے ایک قبیلے کے پاس بھیجا تو ان لوگوں نے ان کو گالیاں دیں اور مارا ، وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور آپ کوخبر دی تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم اہل عمان کے پاس جاتے تو وہ تمھیں گالیاں دیتے نہ مارتے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 6496,
			"arabicnumber": "2545",
			"text": "ہمیں اسود بن شیبان نے ابو نوافل سے خبردی ، کہا : میں نے حضرت عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ ( کے جسد خاکی ) کو شہر کی گھاٹی میں ( کھجور کے ایک تنے سے لٹکا ہوا ) دیکھا ، کہا : تو قریش اور دوسرے لوگوں نے وہاں سے گزرنا شروع کردیا ، یہاں تک کہ حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ وہاں سے گزرے تو وہ ان ( ابن زبیر رضی اللہ تعالیٰ عنہ ) کے پاس کھڑے ہوگئے ، اور ( انھیں مخاطب کرتے ہوئے ) کہا : ابو خبیب!آپ پر سلام! ابو خبیب!آپ پر سلام! ابو خبیب!آپ پر سلام!اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ گواہ ہے کہ میں آپ کو اس سے روکتا تھا ، اللہ کی قسم!آپ ، جتنا مجھے علم ہے بہت روزے رکھنے والے ، بہت قیام کرنے والے ، بہت صلہ رحمی کرنے و الے تھے ۔ اللہ کی قسم!وہ امت جس میں آپ سب سے بُرے ( قرار دیے گئے ) ہوں ، وہ امت تو پوری کی پوری بہترین ہوگی ( جبکہ اس میں تو بڑے بڑے ظالم ، قاتل اور مجرم موجود ہیں ۔ آپ کسی طور پر اس سلوک کے مستحق نہ تھے ۔ ) پھر عبداللہ بن عمر رضی اللہ تعالیٰ عنہ وہاں سے چلے گئے ۔ حجاج کو عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے وہاں کھڑے ہونے کی خبر پہنچی تو اس نے کارندے بھیجے ، ان ( کے جسدخاکی ) کو کھجور کے تنے سے اتارا گیا اور انھیں جاہلی دور کی یہود کی قبروں میں پھینک دیا گیا ، پھر اس نے ( ابن زبیر رضی اللہ تعالیٰ عنہ کی والدہ ) حضرت اسماء بنت ابی بکر رضی اللہ تعالیٰ عنہا کے پاس کارندہ بھیجا ۔ انھوں نے اس کے پاس جانے سے انکار کردیا ۔ اس نے دوبارہ قاصد بھیجا کہ یا تو تم میرے پاس آؤ گی یا پھر میں تمھارے پاس ان لوگوں کو بھیجو ں گا جو تمھیں تمھارے بالوں سے پکڑ کر گھسیٹتے ہوئے لے آئیں گے ۔ حضرت اسماء رضی اللہ تعالیٰ عنہا نے پھر انکار کردیا اورفرمایا : میں ہرگز تیرے پاس نہ آؤں گی یہاں تک کہ تو میرے پاس ایسے شخص کو بھیجے جو مجھے میرے بالوں سے پکڑ کر گھسیٹتے ہوئے لےجائے ۔ کہا : توحجاج کہنے لگا : مجھے میرے جوتے دکھاؤ ، اس نے جوتے پہنے اور اکڑتا ہوا تیزی سے چل پڑا ، یہاں تک کہ ان کے ہاں پہنچا اور کہا : تم نے مجھے دیکھا کہ میں نے اللہ کے دشمن کے ساتھ کیا کیا؟انھوں نے جواب دیا : میں نے تمھیں دیکھا ہے کہ تم نے اس پر اس کی دنیا تباہ کردی جبکہ اس نے تمھاری آخرت برباد کردی ، مجھے یہ بات پہنچی ہے کہ تو اسے دو پیٹیوں والی کا بیٹا ( ابن ذات النطاقین ) کہتا ہے ۔ ہاں ، اللہ کی قسم!میں دو پیٹیوں والی ہوں ۔ ایک پیٹی کے ساتھ میں رسول اللہ صلی اللہ علیہ وسلم اور ابو بکر رضی اللہ تعالیٰ عنہ کا کھانا سواری کے جانور پر باندھتی تھی اور دوسری پیٹی وہ ہے جس سے کوئی عورت مستغنی نہیں ہوسکتی ( سب کو لباس کے لیے اس کی ضرورت ہوتی ہے ۔ ) اور سنو!رسول اللہ صلی اللہ علیہ وسلم نے ہمیں بتایا تھا کہ بنو ثقیف میں ایک بہت بڑا کذاب ہوگا اور ایک بہت بڑا سفاک ہوگا ۔ کذاب ( مختار ثقفی ) کو تو ہم نے دیکھ لیا اور رہا سفاک تو میں نہیں سمجھتی کہ تیرے علاوہ کوئی اورہوگا ، کہا : تو وہ وہاں سے اٹھ کھڑا ہوا اور انھیں کوئی جواب نہ دے سکا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 6497,
			"arabicnumber": "2546.01",
			"text": "یزید بن اصم جزری نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" اگر دین ثریا پر ہوتا تب بھی فارس کا کوئی شخص ۔ ۔ ۔ یا آپ نے فرمایا ۔ ۔ ۔ فرزندان فارس میں سے کوئی شخص اس تک پہنچتا اور اسے حاصل کرلیتا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 6498,
			"arabicnumber": "2546.02",
			"text": "ابو غیث نے حضرت ابو ہریر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : جب نبی کریم صلی اللہ علیہ وسلم پر جمعہ نازل ہوئی اور آپ نے یہ پڑھا : ﴿ وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا﴾ \"\" ان میں اور بھی لوگ ہیں جو اب تک آکر ان سے نہیں ملے ہیں ۔ \"\" ( الجمعۃ 62 : 3 ) تو ایک نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !وہ کون لوگ ہیں؟نبی کریم صلی اللہ علیہ وسلم نے اس کا کوئی جواب نہ دیا ، حتیٰ کہ اس نے آپ سے ایک یا دو یا تین بار سوال کیا ، کہا : اس وقت ہم میں حضرت سلمان فارسی رضی اللہ تعالیٰ عنہ بھی موجود تھے ، نبی کریم صلی اللہ علیہ وسلم نے حضرت سلمان رضی اللہ تعالیٰ عنہ پر ہاتھ رکھا ، پھر فرمایا؛ \"\" اگر ایمان ثریا کے قریب بھی ہوتا تو ان میں سے کچھ لوگ اس کو حاصل کرلیتے ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 6499,
			"arabicnumber": "2547",
			"text": "سالم نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم لوگوں کو ایسے سواونٹوں کی مثل پاؤ گے کہ آدمی ان میں سے ایک بھی سواری کے لائق نہیں پاتا ۔",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 328
			}
		}
	]
}