{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"47": "The Book of Knowledge"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6775,
			"arabicnumber": "2665",
			"text": "قاسم بن محمد نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ( یہ آیات ) تلاوت فرمائیں : \" وہی ہے جس نے آپ پر کتاب نازل فرمائی ، اس میں سے محکم ( معنی میں واضح ) آیتیں ہیں ، وہی اصل کتاب ہیں اور دوسری متشابہ آیات ہیں ، پھر وہ لوگ جن کے دلوں میں کجی ہے ، وہ فتنے کی تلاش میں ان آیتوں کے پیچھے پڑے رہتے ہیں جو ان ( آیات قرآنی ) میں سے متشابہ ہیں ۔ ان ( متشابہ آیات ) کا حقیقی معنی اللہ اور ان لوگوں کے علاوہ اور کوئی نہیں جانتا جو علم میں راسخ ہیں ۔ وہ ( یہی ) کہتے ہیں : ہم ان ( آیات ) پر ایمان لائے ، سب ( آیتیں ) ہمارے رب کی طرف سے ہیں اور دانائی رکھنے والوں کے سوا کوئی ( ان سے ) نصیحت حاصل نہیں کرتا ۔ \" ( حضرت عائشہ رضی اللہ عنہا نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم ایسے لوگوں کو دیکھو جو قرآن میں سے متشابہ ( آیات ) کے پیچھے پڑتے ہیں ، تو یہی لوگ ہیں جن کا اللہ نے ( سابقہ آیات میں ) ذکر کیا ہے ، لہذا ان سے بچ کر رہو ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6776,
			"arabicnumber": "2666",
			"text": "حماد بن زید نے کہا : ہمیں ابوعمران جونی نے حدیث بیان کی ، انہوں نے کہا : عبداللہ بن رباح انصاری نے میری طرف لکھ بھیجا کہ حضرت عبداللہ بن عمرو رضی اللہ عنہ نے کہا : میں ایک روز دن چڑھے ( مسجد میں ) رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا تو اتنے میں آپ صلی اللہ علیہ وسلم نے دو آدمیوں کی آوازیں سنیں جو ایک آیت کے بارے میں ( ایک دوسرے سے ) اختلاف کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نکل کر ہمارے سامنے تشریف لائے ۔ آپ کے چہرہ مبارک پر غصہ ( صاف ) پہچانا جا رہا تھا تو آپ نے فرمایا : \" جو لوگ تم سے پہلے تھے وہ کتاب اللہ کے بارے میں اختلاف کرنے سے ہلاک ہو گئے ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6777,
			"arabicnumber": "2667.01",
			"text": "ابو قُدامہ حارث بن عبید نے ابوعمران سے ، انہوں نے حضرت جندب بن عبداللہ بجلی رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس وقت تک قرآن پڑھتے رہو جب تک تمہارے دل اس پر ایک دوسرے کے ساتھ موافقت کرتے رہیں ( قرآن کے معانی تمہارے دل پر واضح ہوتے جا رہے ہوں ) جب تم اس میں اختلاف کرنے لگو تو اٹھ جاؤ ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6778,
			"arabicnumber": "2667.02",
			"text": "ہمام نے کہا : ہمیں ابوعمران نے حضرت جندب بن عبداللہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم اس پر ایک دوسرے کے ساتھ موافقت اور مطابقت کرتے رہیں ، چنانچہ جب تمہارا اختلاف شروع ہو جائے تو اٹھ جاؤ ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6779,
			"arabicnumber": "2667.03",
			"text": "ابان نے کہا : ہمیں ابوعمران نے حدیث سنائی ، کہا : ہم کوفہ میں ( رہنے والے ) نوجوان لڑکے تھے جب حضرت جندب رضی اللہ عنہ نے ہمیں ( نصیحت کرتے ہوئے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( اس وقت تک ) قرآن پڑھو ۔ \" جیسے ان دونوں ( ابوقدامہ حارث بن عبید اور ہمام ) کی حدیث ہے ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6780,
			"arabicnumber": "2668",
			"text": "حضرت عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کے نزدیک سب سے بڑھ کر بغض کے قابل وہ شخص ہے جو سخت جھگڑالو ہو ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6781,
			"arabicnumber": "2669.01",
			"text": "حفص بن میسرہ نے کہا : مجھے زید بن اسلم نے عطاء بن یسار سے حدیث بیان کی ، انہوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم ضرور ان لوگوں کے طریقوں پر بالشت بر بالشت اور ہاتھ بر ہاتھ چلتے جاؤ گے جو تم سے پہلے تھے ( بعینہ ان کے طریقے اختیار کرو گے ، ان سے ذرہ برابر آگے پیچھے نہ ہو گے ) حتی کہ اگر وہ سانڈے کے بل میں گھسے تو تم بھی ان کے پیچھے گھسو گے ۔ \" ہم نے عرض کی : اللہ کے رسول! کیا یہود اور نصاریٰ ( کے پیچھے چلیں گے؟ ) آپ نے فرمایا : \" تو ( اور ) کن کے؟",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6782,
			"arabicnumber": "2669.02",
			"text": "مجھے میرے بہت سے ساتھیوں نے سعید بن ابی مریم سے حدیث بیان کی ، انہوں نے کہا : ہمیں ابوغسان محمد بن مطرف نے زید بن اسلم سے اسی سند کے ساتھ اسی کے مانند خبر دی ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6783,
			"arabicnumber": "2669.03",
			"text": "محمد بن یحییٰ نے کہا : ہمیں ابن ابی مریم نے حدیث بیان کی ، کہا : ہمیں ابوغسان نے حدیث بیان کی ، کہا : مجھے زید بن اسلم نے عطاء بن یسار سے حدیث بیان کی ، پھر اسی طرح حدیث سنائی ( جس طرح حفص بن میسرہ کی روایت ہے ۔)",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6784,
			"arabicnumber": "2670",
			"text": "احنف بن قیس نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" غلو میں گہرے اترنے والے ہلاک ہو گئے ۔ \" آپ نے تین بار یہ بات ارشاد فرمائی ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6785,
			"arabicnumber": "2671.01",
			"text": "ابوتیاح نے ہمیں حدیث بیان کی ، کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت کی علامات میں سے یہ ( بھی ) ہیں کہ علم اٹھ جائے گا ، جہالت جاگزیں ہو جائے گی ، شراب پی جانے لگے گی اور زنا کھل کر ہونے لگے گا ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6786,
			"arabicnumber": "2671.02",
			"text": "شعبہ نے کہا : میں نے قتادہ کو حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا ، انہوں نے کہا : کیا میں تمہیں رسول اللہ صلی اللہ علیہ وسلم سے سنی ہوئی ایک حدیث بیان نہ کروں؟ یہ حدیث میرے بعد تم کو کوئی ایسا شخص نہیں بیان کرے گا جس نے وہ آپ صلی اللہ علیہ وسلم سے ( براہ راست ) سنی ہو : \" قیامت کی نشانیوں میں سے ہے کہ علم اٹھ جائے گا ، جہالت نمایاں ہو جائے گی ، زنا پھیل جائے گا ، شراب پی جانے لگی گی ، مرد رخصت ہو جائیں گے اور عورتیں باقی رہ جائیں گی یہاں تک کہ پچاس عورتوں کے معاملات کا نگران ایک رہ جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6787,
			"arabicnumber": "2671.03",
			"text": "محمد بن بشر ، عبدہ اور ابواسامہ ، ان سب نے سعید بن ابی عروبہ سے روایت کی ، انہوں نے قتادہ سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ابن بشر اور عبدہ کی حدیث میں ہے : میرے بعد یہ حدیث تمہیں کوئی نہیں سنائے گا ۔ میں نے ( خود ) رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ، پھر اسی ( شعبہ کی حدیث ) کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6788,
			"arabicnumber": "2672.01",
			"text": "وکیع اور عبداللہ بن نمیر نے کہا : ہمیں اعمش نے ابووائل سے حدیث بیان کی ، کہا : میں حضرت عبداللہ بن مسعود اور حضرت ابوموسی رضی اللہ عنہ کے پاس بیٹھا ہوا تھا ، ان دونوں نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت سے کچھ عرصہ پہلے وہ ایام ہوں گے جن میں علم اٹھ جائے گا ، جہل طاری ہو جائے گا اور ان دنوں ہرج کی کثرت ہو جائے گی اور ہرج ( سے مراد ) لوگوں کا قتل ہے ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6789,
			"arabicnumber": "2672.02",
			"text": "سفیان اور زائدہ نے ( سلیمان ) اعمش سے اور انہوں نے ( ابووائل ) شقیق سے روایت کی ، انہوں نے کہا : میں عبداللہ ( بن مسعود ) اور ابوموسیٰ رضی اللہ عنہ کے پاس بیٹھا ہوا تھا ، وہ دونوں احادیث بیان کر رہے تھے تو دونوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، وکیع اور ابن نمیر کی حدیث کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6790,
			"arabicnumber": "2672.03",
			"text": "ابومعاویہ نے اعمش سے ، انہوں نے شقیق سے ، انہوں نے ابوموسیٰ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6791,
			"arabicnumber": "2672.04",
			"text": "جریر نے اعمش سے ، انہوں نے ابووائل سے روایت کی ، کہا : میں حضرت عبداللہ بن مسعود اور حضرت ابوموسیٰ رضی اللہ عنہ کے ساتھ بیٹھا ہوا تھا ، وہ دونوں احادیث بیان کر رہے تھے تو حضرت ابوموسیٰ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اسی ( سابقہ حدیث ) کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6793,
			"arabicnumber": "157.05",
			"text": "شعیب نے زہری سے روایت کی ، انہوں نے کہا : مجھے حمید بن عبدالرحمٰن زہری نے حدیث بیان کی کہ حضرت ابوہریرہ رضی اللہ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" زمانہ باہم قریب ہو جائے گا اور علم کم ہو جائے گا ۔ \" پھر اسی کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6794,
			"arabicnumber": "157.06",
			"text": "معمر نے زہری سے ، انہوں نے سعید ( بن مسیب ) سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" زمانہ باہم قریب ہو جائے گا اور علم اٹھا لیا جائے گا ۔ \" پھر ان دونوں ( یونس اور شعیب ) کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6795,
			"arabicnumber": "157.08",
			"text": "علاء کے والد عبدالرحمٰن ، سالم ، ہمام بن منبہ اور ابویونس سب نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم سے روایت ہے ، جس طرح زہری نے حمید سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی مگر انہوں نے یہ بیان نہیں کیا : \" اور ( دلوں میں ) بخل اور حرص ڈال دیا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6796,
			"arabicnumber": "2673.01",
			"text": "جریر نے ہشام بن عروہ سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا : میں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ کو کہتے ہوئے سنا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے : \" اللہ تعالیٰ علم کو لوگوں سے چھینتے ہوئے نہیں اٹھائے گا بلکہ وہ علماء کو اٹھا کر علم کو اٹھا لے گا حتی کہ جب وہ ( لوگوں میں ) کسی عالم کو ( باقی ) نہیں چھوڑے گا تو لوگ ( دین کے معاملات میں بھی ) جاہلوں کو اپنے سربراہ بنا لیں گے ۔ ان سے ( دین کے بارے میں ) سوال کیے جائیں گے تو وہ علم کے بغیر فتوے دیں گے ، اس طرح خود بھی گمراہ ہوں گے اور دوسروں کو بھی گمراہ کریں گے ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6797,
			"arabicnumber": "2673.02",
			"text": "حماد بن زید ، عباد بن عباد ، ابومعاویہ ، وکیع ، ابن ادریس ، ابواسامہ ، ابن نمیر ، عبدہ ، سفیان ( بن عیینہ ) ، یحییٰ بن سعید ، عمر بن علی اور شعبہ بن حجاج ، سب نے ہشام بن عروہ سے ، انہوں نے اپنے والد سے ، انہوں نے عبداللہ بن عمرو رضی اللہ عنہ سے اور انہوں نے نبی اکرم صلی اللہ علیہ وسلم سے جریر کی روایت کردہ حدیث کے مطابق روایت کی اور عمر بن علی کی حدیث میں مزید یہ ہے : پھر میں ایک سال بعد حضرت عبداللہ بن عمرو رضی اللہ عنہ سے ملا اور ان سے سوال کیا تو انہوں نے وہ حدیث مجھے دوبارہ اسی طرح سنائی جیسے ( پہلے ) بیان کی تھی ۔ کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6798,
			"arabicnumber": "2673.03",
			"text": "جعفر نے عمر بن حکم سے ، انہوں نے عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ہشام بن عروہ کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6799,
			"arabicnumber": "2673.04",
			"text": "عبداللہ بن وہب نے کہا : مجھے ابوشُریح نے حدیث بیان کی کہ انہیں ابواسود نے عروہ بن زبیر سے حدیث بیان کی ، انہوں نے کہا : حضرت عائشہ رضی اللہ عنہا نے مجھ سے فرمایا : بھانجے! مجھے خبر ملی ہے کہ عبداللہ بن عمر رضی اللہ عنہ ہمارے ہاں ( مدینہ ) سے گزر کر حج پر جانے والے ہیں ۔ تم ان سے ملو اور ان سے سوال کرو ۔ انہوں نے نبی صلی اللہ علیہ وسلم سے بڑا علم حاصل کر کے محفوظ کر رکھا ہے ۔ ( عروہ نے ) کہا : میں ان سے ملا اور بہت سی چیزوں کے بارے میں ، جو وہ رسول اللہ صلی اللہ علیہ وسلم سے بیان کرتے تھے ، ان سے پوچھا ۔ عروہ نے کہا : انہوں نے جو کچھ بیان کیا اس میں یہ بھی تھا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ علم کو لوگوں سے یک لخت چھین نہیں لے گا بلکہ وہ علماء کو اٹھا لے گا اور ان کے ساتھ علم کو بھی اٹھا لے گا ۔ اور لوگوں میں جاہل سربراہوں کو باقی چھوڑ دے گا جو علم کے بغیر لوگوں کو فتوے دیں گے ، اس طرح خود بھی گمراہ ہوں گے اور ( لوگوں کو بھی ) گمراہ کریں گے ۔ \"\" عروہ نے کہا : جب میں نے حضرت عائشہ رضی اللہ عنہا کو یہ حدیث سنائی تو انہوں نے اسے ایک بہت بڑی بات سمجھا اور اس کو غیر معروف ( ناقابل قبول ) قرار دیا ۔ اور فرمایا : کیا انہوں نے تمہیں بتایا تھا کہ انہوں نے ( خود ) رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا ، آپ نے یہ بات کہی تھی؟ عروہ نے کہا : یہاں تک کہ جب اگلا سال ہوا تو انہوں ( حضرت عائشہ رضی اللہ عنہا ) نے ان سے کہا : ( عبداللہ ) بن عمرو رضی اللہ عنہ آ گئے ہیں ، ان سے ملو ، ان کے ساتھ بات چیت کا آغاز کرو ، یہاں تک کہ ان سے اسی حدیث کے بارے میں پوچھو جو انہوں نے علم کے حوالے سے تمہیں بیان کی تھی ۔ ( عروہ نے ) کہا : میں ان سے ملا اور ان سے سوال کیا تو انہوں نے وہ حدیث میرے سامنے ( بالکل ) اسی طرح بیان کر دی جس طرح پہلی بار بیان کی تھی ۔ عروہ نے کہا : جب میں نے حضرت عائشہ رضی اللہ عنہا کو یہ بات بتائی تو انہوں نے فرمایا : میں سمجھتی ہوں کہ انہوں نے سچ کہا ، میں دیکھ رہی ہوں کہ انہوں نے اس میں نہ کوئی چیز بڑھائی ہے نہ کم کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6800,
			"arabicnumber": "1017.05",
			"text": "سیدنا جریر بن عبداللہ سے روایت ہے کہ کچھ دیہاتی لوگ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے وہ کمبل پہنے ہوئے تھے۔ آپ صلی اللہ علیہ وسلم نے ان کا برا حال دیکھا اور ان کی محتاجی دریافت کی تو لوگوں کو رغبت دلائی صدقہ دینے کی۔ لوگوں نے صدقہ دینے میں دیر کی یہاں تک کہ اس بات کا رنج آپ صلی اللہ علیہ وسلم کے چہرے پر معلوم ہوا، پھر ایک انصاری شخص ایک تھیلی روپیوں کی لے کر آیا، پھر دوسرا آیا یہاں تک کہ تار بندھ گیا (صدقے اور خیرات کا)، آپ صلی اللہ علیہ وسلم کے چہرے پر خوشی معلوم ہونے لگی، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: ”جو شخص اسلام میں اچھی بات نکالے (یعنی عمدہ بات کو جاری کرے جو شریعت کی رو سے ثواب ہے) پھر لوگ اس کے بعد اس پر عمل کریں تو اس کو اتنا ثواب ہو گا جتنا سب عمل کرنے والوں کو ہو گا اور عمل کرنے والوں کے ثواب میں کچھ کمی نہ ہو گی اور جو اسلام میں بری بات نکالے (مثلاً بدعت یا گناہ کی بات) اور لوگ اس کے بعد اس پر عمل کریں تو تمام عمل کرنے والوں کے برابر گناہ اس پر لکھا جائے گا اور عمل کرنے والوں کا گناہ کچھ کم نہ ہو گا۔“",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6801,
			"arabicnumber": "1017.06",
			"text": "جریر ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌نبی ‌اكرم ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌خطبہ ‌پڑھا ‌اور ‌لوگوں ‌كو ‌ترغیب ‌دی ‌صدقہ ‌دینے ‌كی ‌پھر ‌بیان ‌كیا ‌اسی ‌طرح ‌جیسے ‌اوپر ‌گزرا",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6802,
			"arabicnumber": "1017.07",
			"text": "محمد بن ابی اسماعیل نے کہا : ہمیں عبدالرحمٰن بن ہلال عبسی نے حدیث بیان کی ، انہوں نے کہا : حضرت جریر بن عبداللہ رضی اللہ عنہ نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو بندہ بھی کسی نیک کام کا آغاز کرے جس پر اس کے بعد عمل کیا جائے ۔ \" پھر پوری حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6803,
			"arabicnumber": "1017.08",
			"text": "عبدالملک بن عمیر اور عون بن ابی الجحیفہ نے مُنذِر بن جریر سے ، انہوں نے اپنے والد ( جریر بن عبداللہ رضی اللہ عنہ ) سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6804,
			"arabicnumber": "2674",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے ہدایت کی دعوت دی اسے اس ہدایت کی پیروی کرنے والوں کے اجر کے برابر اجر ملے گا اور ان کے اجر میں کوئی کمی نہیں ہو گی اور جس شخص نے کسی گمراہی کی دعوت دی ، اس پر اس کی پیروی کرنے والوں کے برابر گناہ ( کا بوجھ ) ہو گا اور ان کے گناہوں میں کوئی کمی نہیں ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 47,
				"hadith": 30
			}
		}
	]
}