{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"48": "The Book Pertaining to the Remembrance of Allah, Supplication, Repentance and Seeking Forgiveness "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6805,
			"arabicnumber": "2675.01",
			"text": "جریر نے اعمش سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل فرماتا ہے : میرے بارے میں میرا بندہ جو گمان کرتا ہے میں ( اس کو پورا کرنے کے لیے ) اس کے پاس ہوتا ہوں ۔ جب وہ مجھے یاد کرتا ہے تو میں اس کے ساتھ ہوتا ہوں ۔ اگر وہ مجھے اپنے دل میں یاد کرتا ہے تو میں اسے دل میں یاد کرتا ہوں اور اگر وہ مجھے ( بھری ) مجلس میں یاد کرتا ہے تو میں ان کی مجلس سے اچھی مجلس میں اسے یاد کرتا ہوں ، اگر وہ ایک بالشت میرے قریب آتا ہے تو میں ایک ہاتھ اس کے قریب جاتا ہوں اور اگر وہ ایک ہاتھ میر قریب آتا ہے تو میں دونوں ہاتھوں کی پوری لمبارئی کے برابر اس کے قریب آتا ہوں ، اگر وہ میرے پاس چلتا ہوا آتا ہے تو میں دوڑتا ہوا اس کے پاس جاتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6806,
			"arabicnumber": "2675.02",
			"text": "ابومعاویہ نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ، اور انہوں نے یہ بیان نہیں کیا کہ \" اگر وہ ایک ہاتھ میرے قریب آتا ہے تو میں دونوں ہاتھوں کی پوری لمبائی کے برابر اس کے قریب آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6807,
			"arabicnumber": "2675.03",
			"text": "ہمیں معمر نے ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ احادیث ابوہریرہ رضی اللہ عنہ نے ہمیں رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انہوں نے متعدد احادیث بیان کیں ، ان میں سے ایک یہ تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے کہا : \" اللہ تعالیٰ نے فرمایا : \" جب بندہ ایک بالشت ( بڑھ کر ) میرے پاس آتا ہے تو میں ایک ہاتھ ( بڑھ کر ) اس کے پاس جاتا ہوں اور جب وہ ایک ہاتھ ( بڑھ کر ) میرے پاس آتا ہے تو میں دونوں ہاتھوں کی لمبائی کے برابر ( بڑھ کر ) اس کے پاس جاتا ہوں اور اگر وہ دونوں ہاتھوں کی لمبائی کے برابر بڑھ کر میرے پاس آتا ہے تو میں اس کے پاس پہنچ جاتا ہوں ، اس سے زیادہ تیزی سے آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6808,
			"arabicnumber": "2676",
			"text": "(حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم مکہ کے ایک راستے پر چلے جا رہے تھے کہ آپ کا ایک پہاڑ کے قریب سے گزر ہوا جس کو جمدان کہا جاتا ہے ، آپ نے فرمایا : \" چلتے رہو ، یہ جُمدان ہے ۔ مفردون 0لوگوں سے الگ ہو کر تنہا ہو جانے والے ) بازی لے گئے ۔ \" لوگوں نے پوچھا : اللہ کے رسول! مفردون سے کیا مراد ہے؟ فرمایا : \" کثرت سے اللہ کو یاد کرنے والے ( مرد ) اور اللہ کو یاد کرنے والی ( عورتیں ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6809,
			"arabicnumber": "2677.01",
			"text": "عمرو ناقد ، زُہیر بن حرب اور ابن ابی عمر نے ہمیں سفیان سے حدیث بیان کی ۔ ۔ الفاظ عمرو کے ہیں ۔ ۔ انہوں نے کہا : ہمیں سفیان بن عیینہ نے ابوزناد سے حدیث بیان کی ، انہوں نے اعرج سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کے ننانوے نام ہیں ، جس نے ان کی حفاظت کی وہ جنت میں داخل ہو جائے گا اور اللہ وتر ( طاق ) ہے ، وتر کو پسند کرتا ہے ۔ \" اور ابن ابی عمر کی روایت میں ہے : \" جس نے ان کو شمار کیا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6810,
			"arabicnumber": "2677.02",
			"text": "معمر نے ہمیں ایوب سے خبر دی ، انہوں نے ابن سیرین سے ، انہوں نے ابوہریرہ رضی اللہ عنہ سے ، نیز ( ایوب نے ) ہمام بن منبہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ تعالیٰ کے ننانوے ، ایک کم سو نام ہیں ، جس نے ان ( سب ) کو شمار کیا وہ جنت میں داخل ہو گا ۔ \"\" اور ہمام نے ابوہریرہ رضی اللہ عنہ سے مزید یہ بیان کیا \"\" بےشک وہ ( اللہ ) طاق ہے ، طاق ہی کو پسند کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6811,
			"arabicnumber": "2678",
			"text": "عبدالعزیز بن صُہیب نے حضرت انس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تک تم میں سے کوئی شخص دعا کرے تو قطعیت کے ساتھ ( اصرار کرتے ہوئے ) دعا کرے اور یہ نہ کہے : اے اللہ! اگر تو چاہے تو مجھے دے دے ، کیونکہ اللہ کو مجبور کرنے والا کوئی نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6812,
			"arabicnumber": "2679.01",
			"text": "علاء کے والد ( عبدالرحمٰن ) نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص دعا کرے تو یہ نہ کہے : اے اللہ! اگر تو چاہے تو مجھے بخش دے ، بلکہ وہ پختگی اور اصرار سے سوال کرے اور بڑی رغبت کا اظہار کرے ، کیونکہ دینے کے لیے اللہ تعالیٰ کے لیے کوئی چیز بڑی نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6813,
			"arabicnumber": "2679.02",
			"text": "عطاء بن میناء نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص اس طرح نہ کہے : اے اللہ! اگر تو چاہے تو مجھے بخش دے ، اے اللہ! اگر تو چاہے تو مجھ پر رحم فرما ۔ وہ دعا میں پختگی اور قطعیت سے کام لے کیونکہ اللہ جو چاہے وہی کرتا ہے ، کوئی نہیں جو اسے مجبور کر سکے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6814,
			"arabicnumber": "2680.01",
			"text": "عبدالعزیز نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص کسی نقصان ( مصیبت ) کی وجہ سے ، جو اس پر نازل ہو ، موت کی تمنا نہ کرے ۔ اگر اسنے لامحالہ موت مانگنی بھی ہو تو یوں کہے : اے اللہ! مجھے اس وقت تک زندہ رکھ جب تک زندگی میرے لیے بہتر ہو اور مجھے وفات دے جب موت میرے لیے بہتر ہو ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6815,
			"arabicnumber": "2680.02",
			"text": "ثابت نے حضرت انس رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، مگر انہوں نے کہا : \" کسی نقصان کی وجہ سے جو اسے پہنچے ۔ \" ( نازل ہو نہیں کہا ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6816,
			"arabicnumber": "2680.03",
			"text": "عاصم نے ہمیں نضر بن انس سے حدیث بیان کی کہ حضرت انس رضی اللہ عنہ ان دنوں زندہ تھے ۔ ( نضر نے ) کہا : انس رضی اللہ عنہ نے کہا : اگر نبی صلی اللہ علیہ وسلم نے فرمایا نہ ہوتا : \" تم میں سے کوئی شخص موت کی تمنا نہ کرے \" تو میں موت کی تمنا کرتا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6817,
			"arabicnumber": "2681.01",
			"text": "عبداللہ بن ادریس نے اسماعیل بن ابی خالد سے ، انہوں نے قیس بن ابی حازم سے روایت کی کہ انہوں نے کہا : ہم حضرت خباب رضی اللہ عنہ کے پاس گئے ، اس وقت ان کے پیٹ پر ( علاج کے لئے ) سات جگہ ( تپتی ہوئی دھات سے ) داغ لگائے گئے تھے ۔ انہوں نے کہا : اگر یہ نہ ہوتا کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں موت کی دعا سے منع فرمایا تھا ، تو میں اس ( موت ) کی دعا کرتا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6818,
			"arabicnumber": "2681.02",
			"text": "سفیان بن عیینہ ، جریر بن عبدالحمید ، وکیع ، عبداللہ بن نمیر ، معتمر بن سلیمان اور ابواسامہ سب نے اسماعیل سے اسی سند کے ساتھ ( یہی ) روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6819,
			"arabicnumber": "2682",
			"text": "معمر نے ہمیں ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ احادیث ہمیں ابوہریرہ رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، انہوں نے کئی احادیث بیان کیں ، ان میں سے یہ ( بھی ) تھی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص ہرگز موت کی تمنا نہ کرے ، نہ موت آنے سے پہلے اس کے لیے دعا کرے کیونکہ جب تم میں سے کوئی شخص مر گیا تو اس کا عمل منقطع ہو گیا ( مزید عمل کی مہلت ختم ہو گئی ) اور مومن کی عمر اس کی بھلائی ہی میں اضافہ کرتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 6820,
			"arabicnumber": "2683.01",
			"text": "ہمام نے کہا : ہمیں قتادہ نے انس بن مالک رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے حضرت عبادہ بن صامت رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملنے کو محبوب رکھے ، اللہ اس سے ملنے کو محبوب رکھتا ہے اور جو اللہ سے ملنے کو ناپسند کرے ، اللہ بھی اس سے ملنے کو ناپسند کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 6821,
			"arabicnumber": "2683.02",
			"text": "شعبہ نے قتادہ سے روایت کی ، انہوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ کو حضرت عبادہ بن صامت رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا ، انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 6822,
			"arabicnumber": "2684.01",
			"text": "خالد بن حارث بجیمی نے کہا : ہمیں سعید نے قتادہ سے حدیث بیان کی ، انہوں نے زُرارہ سے ، انہوں نے سعد بن ہشام سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملاقات کو پسند کرے ، اللہ اس سے ملاقات کو پسند فرماتا ہے اور جو شخص اللہ سے ملاقات کو ناپسند کرے ، اللہ اس سے ملاقات کو ناپسند کرتا ہے ۔ \" میں نے کہا : اللہ کے نبی! کیا اس سے موت کی ناپسندیدگی مراد ہے؟ ہم میں سے ہر شخص ( طبعا ) موت کو ناپسند کرتا ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ بات نہیں ہے ، لیکن جب مومن کو اللہ کی رحمت ، اس کی رضامندی اور جنت کی بشارت دی جاتی ہے تو وہ اللہ سے ملاقات کو پسند کرتا ہے اور کافر کو جب اللہ کے عذاب اور اس کی ناراضی کی خبر دی جاتی ہے تو وہ اللہ سے ملاقات کو ناپسند کرتا ہے اور اللہ بھی اس ( ناشکرے اور متکبر ) سے ملاقات کو ناپسند کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 6823,
			"arabicnumber": "2684.02",
			"text": "محمد بن بکر نے کہا : ہمیں سعید نے قتادہ سے اسی سند کے ساتھ حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 6824,
			"arabicnumber": "2684.03",
			"text": "علی بن مسہر نے زکریا سے ، انہوں نے شعبی سے ، انہوں نے شریح بن بانی سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملاقات کو پسند کرتا ہے ، اللہ اس سے ملاقات کو پسند کرتا ہے اور جو شخص اللہ سے ملاقات کو ناپسند کرتا ہے ، اللہ بھی اس سے ملاقات کو ناپسند کرتا ہے اور موت اللہ کی ملاقات سے پہلے ہے ۔ \" ( ملاقات کا معاملہ اس کے بعد آئے گا ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 6825,
			"arabicnumber": "2684.04",
			"text": "عیسیٰ بن یونس نے کہا : ہمیں زکریا نے عامر ( شعبی ) سے حدیث بیان کی ، انہوں نے کہا : مجھے شُریح بن بانی نے حدیث بیان کی کہ حضرت عائشہ رضی اللہ عنہا نے انہیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اسی ( گزشتہ روایت ) کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 6826,
			"arabicnumber": "2685.01",
			"text": "عبثر نے مطرف سے ، انہوں نے عامر سے ، انہوں نے شریح بن ہانی سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملاقات کو پسند کرے ، اللہ اس سے ملاقات کو پسند کرتا ہے اور جو اللہ سے ملاقات کو ناپسند کرے ، اللہ اس سے ملاقات کو ناپسند کرتا ہے ۔ ( شریح بن ہانی نے ) کہا : میں حضرت عائشہ رضی اللہ عنہا کے پاس حاضر ہوا اور عرض کی : ام المومنین! میں نے حضرت ابوہریرہ رضی اللہ عنہ کو رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث بیان کرتے ہوئے سنا ، اگر وہ اسی طرح ہے ( جس طرح وہ بیان کرتے ہیں ) تو ہم ہلاک ہو گئے ۔ تو انہوں ( عائشہ رضی اللہ عنہا ) نے فرمایا : ہلاک ہونے والا واقعی وہی ہے جو رسول اللہ صلی اللہ علیہ وسلم کے قول سے ہلاک ہوا ، ( بتاؤ ) وہ کیا حدیث ہے؟ ( میں نے عرض کی : ) انہوں نے کہا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص اللہ سے ملاقات کو پسند کرتا ہے اللہ بھی اس سے ملاقات کو پسند کرتا ہے اور جو شخص اللہ سے ملاقات کو ناپسند کرتا ہے ، اللہ بھی اس سے ملاقات کو ناپسند کرتا ہے \" اور ہم میں ایسا کوئی نہیں جو موت کو ناپسند نہ کرتا ہو ، تو حضرت عائشہ رضی اللہ عنہا نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے یہی فرمایا تھا ، لیکن ( مفہوم کے اعتبار سے ) جس طرف تم گئے ہو وہ بات اس طرح نہیں بلکہ ( وہ اس طرح ہے کہ ) جب نگاہ اوپر کی طرف اٹھ جاتی ہے اور سینے میں سانس اکھڑ رہی ہوتی ہے اور جلد پر رونگٹے کھڑے ہو جاتے ہیں اور انگلیاں ٹیڑھی ہو کر اکڑ جاتی ہیں تو اس وقت جو اللہ سے ملنے کو پسند کرتا ہے ، اللہ بھی اس سے ملنا پسند کرتا ہے اور جو ( اس وقت ) اللہ سے ملاقات کو ناپسند کرتا ہے ، اللہ بھی اس سے ملنا ناپسند کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 6827,
			"arabicnumber": "2685.02",
			"text": "جریر نے مطرف سے اسی سند کے ساتھ عبثر کی حدیث کے مانند خبر دی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 6828,
			"arabicnumber": "2686",
			"text": "حضرت ابوموسیٰ اشعری رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" جو شخص اللہ سے ملاقات کو پسند کرے ، اللہ بھی اس سے ملاقات کو پسند کرتا ہے اور جو شخص اللہ سے ملاقات کو ناپسند کرے ، اللہ بھی اس سے ملنے کو ناپسند کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 6829,
			"arabicnumber": "2675.04",
			"text": "یزید بن اصم نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ فرماتا ہے : میرا بندہ میرے بارے میں جو گمان کرتا ہے ، میں ( اس کو پورا کرنے کے لیے ) اس کے پاس ہوتا ہوں اور جب وہ مجھے پکارتا ہے تو میں اس کے ساتھ ہوتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 6830,
			"arabicnumber": "2675.05",
			"text": "یحییٰ بن سعید اور ابن ابی عدی نے سلیمان تیمی سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" اللہ عزوجل فرماتا ہے : جب میرا بندہ ایک بالشت میرے قریب آتا ہے تو میں ایک ہاتھ اس کے قریب آتا ہوں اور جب وہ ایک ہاتھ میرے قریب آتا ہے تو میں دونوں ہاتھوں کی لمبائی کے برابر اس کے قریب آتا ہوں اور جب وہ چل کر میرے پاس آتا ہے تو میں دوڑ کر اس کے پاس جاتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 6831,
			"arabicnumber": "2675.06",
			"text": "معتمر نے اپنے والد ( سلیمان تیمی ) سے اسی سند کے ساتھ حدیث بیان کی اور \" جب وہ چل کر میرے پاس آتا ہے تو میں دوڑ کر اس کے پاس جاتا ہوں \" ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 6832,
			"arabicnumber": "2675.07",
			"text": "ابوصالح نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ عزوجل فرماتا ہے : میرا بندہ میرے بارے میں جو گمان کرتا ہے تو میں ( اس کو پورا کرنے کے لیے ) اس کے پاس ہوتا ہوں اور جب وہ مجھے یاد کرتا ہے تو میں اس کے ساتھ ہوتا ہوں ، اگر وہ مجھے اپنے دل میں یاد کرتا ہے تو میں اسے اپنے دل میں یاد کرتا ہوں ۔ اگر وہ مجھے کسی مجلس میں یاد کرتا ہے تو میں ان لوگوں کی مجلس سے بہتر مجلس میں اس کو یاد کرتا ہوں اور اگر وہ ایک بالشت میرے قریب ہوتا ہے تو میں ایک ہاتھ اس کے قریب ہو جاتا ہوں ، اگر وہ ایک ہاتھ میرے قریب ہوتا ہے تو میں پھیلے ہوئے دونوں ہاتھوں کی لمبائی جتنا ( فاصلہ ) اس کے قریب ہو جاتا ہوں اور اگر وہ چل کر میری طرف آتا ہے تو میں دوڑ کر اس کے پاس آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 6833,
			"arabicnumber": "2687.01",
			"text": "وکیع نے کہا : ہمیں اعمش نے معرور بن سوید سے حدیث بیان کی ، انہوں نے حضرت ابوزر رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اللہ عزوجل فرماتا ہے : جو شخص ایک نیکی لے کر آتا ہے ، اسے اس جیسی دس ملتی ہیں اور میں بڑھا ( بھی ) دیتا ہوں اور جو شخص برائی لے کر آتا ہے تو اس کا بدلہ اس جیسی ایک برائی ہے یا ( چاہوں تو ) معاف کر دیتا ہوں ، جو ایک بالشت میرے قریب ہوتا ہے تو میں ایک ہاتھ اس کے قریب ہو جاتا ہوں اور جو ایک ہاتھ میرے قریب ہوتا ہے تو میں دو ہاتھوں کےپھیلاؤ جتنا اس کے قریب ہو جاتا ہوں اور جو میرے پاس چلتا ہوا آتا ہے ، میں اس کے پاس دوڑتا ہوا جاتا ہوں اور جو مجھ سے پوری زمین کی وسعت بھر گناہوں کے ساتھ ملاقات کرتا ہے ( اور ) میرے ساتھ کسی چیز کو شریک نہیں ٹھہراتا ، میں اتنی ہی مغفرت کے ساتھ اس سے ملاقات کرتا ہوں ۔ \"\" ( امام مسلم کے شاگرد ) ابراہیم نے کہا : ہم سے حسب بن بشر نے ، ان کو وکیع نے یہی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 6834,
			"arabicnumber": "2687.02",
			"text": "ابومعاویہ نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت بیان کی ، مگر انہوں نے کہا : \" اس کے لیے اس جیسی دس نیکیاں ملتی ہیں ، یا میں ( اس سے بھی ) زیادہ دیتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 6835,
			"arabicnumber": "2688.01",
			"text": "محمد بن ابوعدی نے حمید سے ، انہوں نے ثابت سے اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے مسلمانوں میں سے ایک ایسے شخص کی عیادت کی جو لاغر ہو کر چوزے کی طرح ہو گیا تھا ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : \" کیا تم اللہ تعالیٰ سے کسی چیز کی دعا کرتے تھے یا اس سے کچھ مانگتے تھے؟ \" اس نے کہا : جی ہاں ، میں کہتا تھا : اے اللہ! تو مجھے آخرت میں جو سزا دینے والا ہے ابھی دنیا ہی میں دے دے ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ پاک ہے! تم میں اس کی طاقت نہیں ہے ۔ ۔ یا ( فرمایا : ) تم اس کی استطاعت نہیں رکھتے ۔ تم نے یہ کیوں نہ کہا : اے اللہ! ہمیں دنیا میں بھی اچھائی عطا فرما اور آخرت میں بھی اچھائی عطا فرما اور ہمیں آگ کے عذاب سے بچا لے ۔ \" پھر آپ صلی اللہ علیہ وسلم کے لیے اللہ سے دعا فرمائی تو اس نے اس شخص کو شفا عطا فرما دی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 6836,
			"arabicnumber": "2688.02",
			"text": "خالد بن حارث نے کہا : ہمیں حمید نے اسی سند کے ساتھ دعا کے ان الفاظ تک حدیث بیان کی : \" ہمیں دوزخ کے عذاب سے بچا \" اور اس سے اضافی بات بیان نہیں کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 6837,
			"arabicnumber": "2688.03",
			"text": "حماد نے کہا : ثابت نے ہمیں حضرت انس رضی اللہ عنہ سے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم اپنے صحابہ میں سے ایک شخص کی عیادت کے لیے تشریف لےگئے ، وہ چوزے کی طرح ( لاغر ) ہو گیا تھا ، اس کے بعد حمید کی حدیث کے ہم معنی ہے ، مگر انہوں نے اس طرح کہا : \" تم میں اللہ کا عذاب برداشت کرنے کی طاقت نہیں \" انہوں نے یہ بیان نہیں کیا کہ آپ صلی اللہ علیہ وسلم نے اس کے لیے اللہ سے دعا کی تو اس نے اس شخص کو شفا عطا فرما دی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 6838,
			"arabicnumber": "2688.04",
			"text": "قتادہ نے انس رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 6839,
			"arabicnumber": "2689",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" اللہ تبارک و تعالیٰ کے کچھ فرشتے ہیں جو ( اللہ کی زمین میں ) چکر لگاتے رہتے ہیں ، وہ اللہ کے ذکر کی مجلسیں تلاش کرتے ہیں ، جب وہ کوئی ایسی مجلس پاتے ہیں جس میں ( اللہ کا ) ذکر ہوتا ہے تو ان کے ساتھ بیٹھ جاتے ہیں ، وہ ایک دوسرے کو اپنے پروں سے اس طرح ڈھانپ لیتے ہیں کہ اپنے اور دنیا کے آسمان کے درمیان ( کی وسعت کو ) بھر دیتے ہیں ۔ جب ( مجلس میں شریک ہونے والے ) لوگ منتشر ہو جاتے ہیں تو یہ ( فرشتے ) بھی اوپر کی طرف جاتے ہیں اور آسمان پر چلے جاتے ہیں ، کہا : تو اللہ عزوجل ان سے پوچھتا ہے ، حالانکہ وہ ان کے بارے میں سب سے زیادہ جاننے والا ہے : تم کہاں سے آئے ہو؟ وہ کہتے ہیں : ہم زمین میں ( رہنے والے ) تیرے بندوں کی طرف سے ( ہو کر ) آئے ہیں جو تیری پاکیزگی بیان کر رہے تھے ، تیزی بڑائی کہہ رہے تھے اور صرف اور صرف تیرے ہی معبود ہونے کا اقرار کر رہے تھے اور تیری حمد و ثنا کر رہے تھے اور تجھی سے مانگ رہے تھے ، فرمایا : وہ مجھ سے کیا مانگ رہے تھے؟ انہوں نے کہا : وہ آپ سے آپ کی جنت مانگ رہے تھے ۔ فرمایا : کیا انہوں نے میری جنت دیکھی ہے؟ انہوں نے کہا : پروردگار! ( انہوں نے ) نہیں ( دیکھی ) ، فرمایا : اگر انہوں نے میری جنت دیکھی ہوتی کیا ہوتا! ( کس الحاح و زاری سے مانگتے! ) وہ کہتے ہیں : اور وہ تیری پناہ مانگ رہے تھے ، فرمایا : وہ کس چیز سے میری پناہ مانگ رہے تھے؟ انہوں نے کہا : تیری آگ ( جہنم ) سے ، اے رب! فرمایا : کیا انہوں نے میری آگ ( جہنم ) دیکھی ہے؟ انہوں نے کہا : اے رب! نہیں ( دیکھی ) ، فرمایا : اگر وہ میری جہنم دیکھ لیتے تو ( ان کا کیا حال ہوتا! ) وہ کہتے ہیں : وہ تجھ سے گناہوں کی بخشش مانگ رہے تھے ، تو وہ فرماتا ہے : میں نے ان کے گناہ بخش دیے اور انہوں نے جو مانگا میں نے انہیں عطا کر دیا اور انہوں نے جس سے پناہ مانگی میں نے انہیں پناہ دے دی ۔ ( رسول اللہ صلی اللہ علیہ وسلم نے ) فرمایا : وہ ( فرشتے ) کہتے ہیں : پروردگار! ان میں فلاں شخص بھی موجود تھا ، سخت گناہ گار بندہ ، وہاں سے گزرتے ہوئے ان کے ساتھ بیٹھ گیا تھا ۔ ( آپ صلی اللہ علیہ وسلم نے ) فرمایا : تو اللہ ارشاد فرماتا ہے : میں نے اس کو بھی بخش دیا ۔ یہ ایسے لوگ ہیں کہ ان کی وجہ سے ان کے ساتھ بیٹھ جانے والا بھی محروم نہیں رہتا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 6840,
			"arabicnumber": "2690.01",
			"text": "عبدالعزیز بن صہیب نے کہا : قتادہ نے حضرت انس رضی اللہ عنہ سے پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم کون سی دعا کثرت سے مانگا کرتے تھے؟ حضرت انس رضی اللہ عنہ نے کہا : آپ صلی اللہ علیہ وسلم کثرت سے جو دعا مانگا کرتے تھے وہ یہ تھی کہ آپ کہے : \"\" اے اللہ! ہمیں دنیا میں بھی اچھائی عطا فرما ، آخرت میں بھی اچھائی عطا فرما اور ہمیں آگ کے عذاب سے محفوظ رکھ ۔ \"\" کہا : حضرت انس رضی اللہ عنہ جب کوئی ایک دعا مانگنا چاہتے تو یہی دعا مانگتے اور جب بڑی دعا مانگنا چاہتے تو اس میں یہ دعا بھی مانگتے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 6841,
			"arabicnumber": "2690.02",
			"text": "ثابت نے حضرت انس رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم ( دعا فرماتے ہوئے یہ ) کہا کرتے تھے : \" اے ہمارے رب! ہمیں دنیا میں بھی اچھائی عطا فرما اور آخرت میں بھی اچھائی عطا فرما اور ہمیں دوزخ کے عذاب سے بچا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 6842,
			"arabicnumber": "2691",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص دن میں سو مرتبہ : \" لا اله الا لله وحده لا شريك له له الملك وله لحمد وهو على كل شيء قدير \" اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا ہے ، اس کا کوئی شریک نہیں ، ساری بادشاہت اسی کی ہے ، حمد صرف اسی کو سزاوار ہے اور وہی ہر چیز پر قادر ہے \" کہے اس شخص کو دس غلام آزاد کرنے کے برابر اجر ملتا ہے ، اس کے لیے سو نیکیاں لکھی جاتی ہیں ، اس کے سو گناہ مٹا دیے جاتے ہیں اور یہ کلمات شام تک پورا دن شیطان سے اس کی حفاظت کا ذریعہ بن جاتے ہیں اور کوئی شخص اس سے زیادہ افضل عمل نہیں کر سکتا ، سوائے اس شخص کے جو اس سے بھی زیادہ مرتبہ یہی عمل کرے اور جس شخص نے ایک دن میں سو مرتبہ \" سبحان الله وبحمده \" کہا تو اس کے تمام گناہ معاف کر دیے جاتے ہیں ، چاہے وہ سمندر کے جھاگ کے برابر ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 6843,
			"arabicnumber": "2692",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : کوئی شخص جب صبح کرے اور جب شام کرے تو سو بار \" سبحان الله وبحمده \" کہے تو قیامت کے روز کوئی شخص اس سے بہتر عمل لے کر نہیں آئے گا ، سوائے اس کے جو اتنی بار ( یہ کلمات ) کہے یا اس سے زیادہ بار کہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 6846,
			"arabicnumber": "2694",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دو کلمے ہیں جو زبان پر ہلکے ہیں اور میزان میں بھاری ہیں اور اللہ کو بہت محبوب ہیں : \" سبحان الله وبحمده سبحان العظيم \" اللہ ہر اس چیز سے پاک ہے جو اس کے شایان شان نہیں اور سب حمد اسی کو سزاوار ہے ، اللہ ہر اس چیز سے پاک ہے جو اس کے شایان شان نہیں اور عظمت کی ہر صفت سے متصف ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 6847,
			"arabicnumber": "2695",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ بات کہ میں \" سبحان الله والحمدلله ولا اله الا لله والله اكبر \" کہوں ، مجھے ان تمام چیزوں سے زیادہ محبوب ہے جن پر سورج طلوع ہوتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 6848,
			"arabicnumber": "2696",
			"text": "ابوبکر بن ابی شیبہ نے ہمیں حدیث بیان کی ، کہا : ہمیں علی بن مسہر اور ابن نمیر نے موسیٰ جہنی سے حدیث بیان کی ، اور ہمیں محمد بن عبداللہ بن نمیر نے بھی یہی حدیث بیان کی ۔ ۔ الفاظ انہی کے ہیں ۔ ۔ انہوں نے کہا : ہمیں میرے والد نے حدیث بیان کی ، انہوں نے کہا : ہمیں موسی جہنی نے معصب بن سعد سے حدیث بیان کی ، انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا : ایک اعرابی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : مجھے کچھ کلمات سکھائیے جنہیں میں ( بطور ذکر ) کہا کروں ۔ آپ نے فرمایا : \"\" یہ کہا کرو : \"\" لا اله الا لله وحده لا شريك له الله اكبر كبيرا والحمدلله كثيرا وسبحان الله رب العالمين لا حول ولا قوة الا بالله العزيز الحكيم \"\" \"\" اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا ہے ، اس کا کوئی شریک نہیں ، اللہ بڑائی میں سب سے بڑا ہے اور بے حد و حساب تعریف اللہ کی ہے ، اللہ ہر اس چیز سے پاک ہے جو اس کے شایان شان نہیں ، وہ سارے جہانوں کا پالنے والا ہے ، کسی میں برائی سے بچنے کی طاقت اور نیکی کرنے کی قوت نہیں مگر صرف اور صرف اللہ کی دی ہوئی جو سب پر غالب ہے ، بڑی حکمت والا ہے ۔ \"\" اس شخص نے کہا : یہ کلمات تو میرے رب کے لیے ہیں ، میرے لیے کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" یہ کہو : \"\" اللهم اغفرلى وارحمنى واهدنى وارزقنى \"\" اے اللہ! مجھے بخش دے ، مجھ پر رحم فرما ، مجھے ہدایت دے اور مجھے رزق عطا فرما ۔ \"\" موسیٰ نے کہا : جہاں تک \"\" عافنى \"\" مجھے عافیت عطا کر \"\" کا تعلق ہے تو اس کے بارے میں مجھے تھوڑا سا وہم ہے اور مجھے یقین نہیں ہے ، اور ابن ابی شیبہ نے اپنی حدیث میں موسیٰ کا یہ قول نقل نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 6849,
			"arabicnumber": "2697.01",
			"text": "عبدالواحد بن زیاد نے کہا : ہمیں ابو مالک اشجعی نے اپنے والد ( طارق بن اشیم اشجعی رضی اللہ عنہ ) سے حدیث بیان کی ، کہا : جو شخص اسلام قبول کرتا ، رسول اللہ صلی اللہ علیہ وسلم اس کو ان کلمات کی تعلیم دیتے تھے : \" اللهم اغفرلى وارحمنى واهدنى وارزقنى \" \" اللہ! مجھے بخش دے ، مجھ پر رحم فرما ، مجھے ہدایت دے اور مجھے رزق عطا فرما ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 6850,
			"arabicnumber": "2697.02",
			"text": "ابومعاویہ نے کہا؛ ہمیں ابومالک اشجعی نے اپنے والد سے حدیث بیان کی ، کہا : جب کوئی شخص مسلمان ہوتا تو نبی صلی اللہ علیہ وسلم اس کو نماز سکھاتے ، پھر اس کو حکم دیتے کہ ان کلمات کے ساتھ دعا کیا کرے : اللهم اغفرلى وارحمنى واهدنى وعافنى وارزقنى",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 6851,
			"arabicnumber": "2697.03",
			"text": "یزید بن ہارون نے کہا : ابومالک نے ہمیں اپنے والد سے خبر دی کہ انہوں نے نبی صلی اللہ علیہ وسلم سے سنا ، ( اس وقت ) ان کے پاس ایک شخص نے حاضر ہو کر عرض کی : اللہ کے رسول! جب میں اپنے رب سے مانگوں تو کیا کہا کروں؟ آپ نے فرمایا : \" تم کہو : \" اللهم اغفرلى وارحمنى وعافنى وارزقنى \" ساتھ ہی اپنے انگوٹھے کے سوا ( ایک ایک کر کے ) ساری انگلیاں بند کرتے گئے ( اور فرمایا : ) \" یہ کلمات تمہارے لیے تمہاری دنیا اور آخرت دونوں جمع کر دیں گے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 6852,
			"arabicnumber": "2698",
			"text": "معصب بن سعد سے روایت ہے ، انہوں نے کہا : مجھے میرے والد ( سعد بن ابی وقاص رضی اللہ عنہ ) نے حدیث سنائی ، انہوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر تھے کہ آپ نے فرمایا : \" کیا تم میں سے کوئی شخص اس بات سے عاجز ہے کہ ہر روز ایک ہزار نیکیاں کمائے؟ \" آپ کے ساتھ بیٹھے ہوئے لوگوں میں سے ایک نے پوچھا ہم میں سے کوئی شخص ایک ہزار نیکیاں کس طرح کما سکتا ہے؟ آپ نے فرمایا : \" وہ سو بار سبحان الله کہے ۔ اس کے لیے ہزار نیکیاں لکھ دی جائیں گی اور اس کے سو گناہ مٹا دئیے جائیں گے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 6853,
			"arabicnumber": "2699.01",
			"text": "ابومعاویہ نے اعمش سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے کسی مسلمان کی دنیاوی تکلیفوں میں سے کوئی تکلیف دور کی ، اللہ تعالیٰ اس کی قیامت کی تکلیفوں میں سے کوئی تکلیف دور کرے گا اور جس شخص نے کسی تنگ دست کے لیے آسانی کی ، اللہ تعالیٰ اس کے لیے دنیا اور آخرت میں آسانی کرے گا اور جس نے کسی مسلمان کی پردہ پوشی کی ، اللہ تعالیٰ دنیا اور آخرت میں اس کی پردہ پشی کرے گا اور اللہ تعالیٰ اس وقت تک بندے کی مدد میں لگا رہتا ہے جب تک بندہ اپنے بھائی کی مدد میں لگا رہتا ہے اور جو شخص اس راستے پر چلتا ہے جس میں وہ علم حاصل کرنا چاہتا ہے تو اللہ تعالیٰ اس کے ذریعے سے اس کے لیے جنت کا راستہ آسان کر دیتا ہے ، اللہ کے گھروں میں سے کسی گھر میں لوگوں کا کوئی گروہ اکٹھا نہیں ہوتا ، وہ قرآن کی تلاوت کرتے ہیں اور اس کا درس و تدریس کرتے ہیں مگر ان پر سکینت ( اطمینان و سکون قلب ) کا نزول ہوتا ہے اور ( اللہ کی ) رحمت ان کو ڈھانپ لیتی ہے اور فرشتے ان کو اپنے گھیرے میں لے لیتے ہیں اور اللہ تعالیٰ اپنے مقربین میں جو اس کے پاس ہوتے ہیں ان کا ذکر کرتا ہے اور جس کے عمل نے اسے ( خیر کے حصول میں ) پیچھے رکھا ، اس کا نسب اسے تیز نہیں کر سکتا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 6854,
			"arabicnumber": "2699.02",
			"text": "عبداللہ بن نمیر اور ابواسامہ نے کہا : ہمیں اعمش نے حدیث بیان کی ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جس طرح ابومعاویہ کی حدیث ہے ، مگر ابواسامہ کی حدیث میں تنگدست کے لیے آسانی کرنے کا ذکر نہیں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 6857,
			"arabicnumber": "2701",
			"text": "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے ، کہا : حضرت معاویہ رضی اللہ عنہ نکل کر مسجد میں ایک حلقے ( والوں ) کے پاس سے گزرے ، انہوں نے کہا : تمہیں کس چیز نے یہاں بٹھا رکھا ہے؟ انہوں نے کہا : ہم اللہ کا ذکر کرنے کے لیے بیٹھے ہیں ۔ انہوں نے کہا : کیا اللہ کو گواہ بنا کر کہتے ہو کہ تمہیں اس کے علاوہ اور کسی غرض نے نہیں بٹھایا؟ انہوں نے کہا : اللہ کی قسم! ہم اس کے علاوہ اور کسی وجہ سے نہیں بیٹھے ، انہوں نے کہا؛ دیکھو ، میں نے تم پر کسی تہمت کی وجہ سے قسم نہیں دی ۔ رسول اللہ صلی اللہ علیہ وسلم کے سامنے میری حیثیت کا کوئی شخص ایسا نہیں جو حدیث بیان کرنے میں مجھ سے کم ہو ، ( اس کے باوجود اپنے یقینی علم کی بنا پر میں تمہارے سامنے یہ حدیث بیان کر رہا ہوں کہ ) رسول اللہ صلی اللہ علیہ وسلم نکل کر اپنے ساتھیوں کے ایک حلقے کے قریب تشریف لائے اور فرمایا : \" تم کس غرض سے بیٹھے ہو؟ \" انہوں نے کہا : ہم بیٹھے اللہ کا ذکر کر رہے ہیں اور اس بات پر اس کی حمد کر رہے ہیں کہ اس نے اسلام کی طرف ہماری رہنمائی کی ، اس کے ذریعے سے ہم پر احسان کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم اللہ کو گواہ بنا کر کہتے ہو کہ تم صرف اسی غرض سے بیٹھے ہو؟ \" انہوں نے کہا : اللہ کی قسم! ہم اس کے سوا اور کسی غرض سے نہیں بیٹھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے تم پر کسی تہمت کی وجہ سے تمہیں قسم نہیں دی ، بلکہ میرے پاس جبریل آئے اور مجھے بتایا کہ اللہ تعالیٰ تمہارے ذریعے سے فرشتوں کے سامنے فخر کا اظہار فرما رہا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 6858,
			"arabicnumber": "2702.01",
			"text": "ثابت نے ابو بُردہ سے اور انہوں نے حضرت اغرمزنی رضی اللہ عنہ سے ، جنہیں شرفِ صحبت حاصل تھا ، روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : میرے دل پر غبار سا چھا جاتا ہے تو میں ( اس کیفیت کے ازالے کے لیے ) ایک دن میں سو بار اللہ سے استغفار کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 6859,
			"arabicnumber": "2702.02",
			"text": "غندر نے شعبہ سے ، انہوں نے عمرہ بن مُرہ سے اور انہوں نے ابوبُردہ سے روایت کی ، انہوں نے کہا : میں نے حضرت اغر رضی اللہ عنہ سے سنا ۔ ۔ اور وہ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں سے تھے ۔ ۔ وہ حضرت ابن عمر رضی اللہ عنہ سے روایت کرتے تھے ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" لوگو! اللہ کی طرف توبہ کیا کرو کیونکہ میں اللہ سے ۔ ۔ ایک دن میں ۔ ۔ سو بار توبہ کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 6860,
			"arabicnumber": "2702.03",
			"text": "عبیداللہ کے والد معاذ ، ابوداؤد اور عبدالرحمٰن بن مہدی نے شعبہ سے اسی سند سے ( یہی ) روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 6861,
			"arabicnumber": "2703",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے سورج کے مغرب سے طلوع ہونے سے پہلے توبہ کر لی ، اللہ تعالیٰ اس کی توبہ کو قبول فرما لے گا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 6862,
			"arabicnumber": "2704.01",
			"text": "محمد بن فضیل اور ابومعاویہ نے عاصم سے ، انہوں نے ابوعثمان سے اور انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ، کہا : ایک سفر میں ہم نبی صلی اللہ علیہ وسلم کے ساتھ تھے کہ لوگ بلند آواز کے ساتھ اللہ اکبر کہنے لگے ، نبی صلی اللہ علیہ وسلم نے فرمایا : \" اے لوگو! اپنی جانوں پر نرمی کرو ، تم نہ کسی بہرے کو پکار رہے ہو ، نہ غائب کو ، تم اس کو پکار رہے ہو جو ہر وقت خوب سننے والا ہے ، قریب ہے اور تمہارے ساتھ ہے ۔ \" اس وقت میں آپ کے پیچھے تھا اور یہ کہہ رہا تھا : \" لا حول ولا قوة الا بالله \" \" گناہوں سے بچنے اور نیکی کی قوت صرف اور صرف اللہ سے ملتی ہے ۔ \" تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" عبدالہ بن قیس! کیا میں تمہیں جنت کے خزانوں میں سے ایک خزانے کا پتہ نہ بتاؤں؟ \" میں نے کہا : کیوں نہیں ، اللہ کے رسول! آپ نے فرمایا : \" لا حول ولا قوة الا بالله \" کہا کرو ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 6863,
			"arabicnumber": "2704.02",
			"text": "حفص بن غیاث نے عاصم سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 6864,
			"arabicnumber": "2704.03",
			"text": "یزید بن زُریع نے کہا : ہمیں ( سلیمان ) تیمی نے ابوعثمان سے حدیث بیان کی ، انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی کہ وہ لوگ ( صحابہ کرام رضی اللہ عنہم ) رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے اور وہ ایک گھاٹی پر چڑھ رہے تھے ، کہا : ایک آدمی جب بھی اونچائی پر چڑھتا زور سے پکارنا شروع کر دیتا : \" لا اله الا لله والله اكبر \" ( ابوموسیٰ رضی اللہ عنہ نے ) کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \" تم لوگ کسی بہرے کو یا اسے جو غائب ہو ، نہیں پکار رہے ۔ \" کہا : پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" ابوموسیٰ! یا ( فرمایا : ) عبداللہ بن قیس! کیا تمہیں ایسا کلمہ نہ بتاؤں جو جنت کے خزانے میں سے ہے؟ \" میں نے عرض کی ، اللہ کے رسول! وہ کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" لا حول ولا قوة الا بالله \" ( گناہوں سے بچنے کی ) کوئی کوشش اور ( نیکی کرنے کی ) کوئی قوت اللہ کے سوا کسی سے حاصل نہیں ہوتی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 6865,
			"arabicnumber": "2704.04",
			"text": "معتمر نے اپنے والد ( سلیمان تیمی ) سے روایت کی ، انہوں نے کہا : ہمیں ابوعثمان نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ، کہا : ایک بار رسول اللہ صلی اللہ علیہ وسلم پھر اسی ( سابقہ حدیث ) کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 6866,
			"arabicnumber": "2704.05",
			"text": "ایوب نے ابوعثمان سے اور انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ، کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں تھے ، پھر عاصم کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 6867,
			"arabicnumber": "2704.06",
			"text": "خالد حذاء نے ابوعثمان سے اور انہوں نے حضرت ابوموسیٰ رضی اللہ عنہ سے روایت کی ، کہا : ہم ایک غزوے میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے ، پھر اس حدیث کو بیان کیا اور اس میں کہا : ( آپ صلی اللہ علیہ وسلم نے فرمایا : ) \" تم جس کو پکار رہے ہو وہ تم میں سے کسی کی اونٹنی کی گردن کی نسبت بھی اس کے زیادہ قریب ہے ۔ \" اور ان ( خالد حذاء ) کی حدیث میں \" لا حول ولا قوة الا بالله \" کا ذکر نہیں ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 6868,
			"arabicnumber": "2704.07",
			"text": "عثمان بن غیاث نے کہا : ہمیں ابوعثمان نے حضرت ابوموسی اشعری رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ نے مجھ سے فرمایا : \" کیا میں تمہیں جنت کے خزانوں میں سے ایک کلمہ نہ بتاؤں؟ \" ۔ ۔ یا فرمایا : ۔ ۔ \" جنت کے خزانوں میں سے ایک خزانے کا پتہ نہ بتاؤں؟ \" میں نے عرض کی : کیوں نہیں ( ضرور بتائیں ) ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" لا حول ولا قوة الا بالله",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 6869,
			"arabicnumber": "2705.01",
			"text": "ابو بکر رضی اﷲ عنہ سے روایت ہے انہوں نے رسول اﷲ ﷺ سے عرض کیا یارسول اﷲ ﷺ مجھے ایک دعا سکھلائیے جس کو میں پڑھا کروں اپنی نماز میں آپ نے فرمایا یہ کہا کر یااﷲ میں نے اپنے نفس پر بڑا ظلم کیا ہے یا بہت ظلم کیا ہے اور گناہوں کو کوئی نہیں بخشتا سوا تیرے تو بخش دے مجھے اپنے پاس کی بخشش سے اور رحم کر مجھ پر تو بخشنے والا مہربان ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 6870,
			"arabicnumber": "2705.02",
			"text": "عبداللہ بن وہب نے ہمیں خبر دی ، کہا : ہمیں ایک آدمی نے جس کا انہوں نے نام لیا اور عمرو بن حارث نے یزید بن ابی حبیب سے خبر دی اور انہوں نے ابوالخیر سے روایت کی ، انہوں نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ عنہ سے سنا ، وہ کہتے تھے : حضرت ابوبکر صدیق رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے عرض کی : اللہ کے رسول! آپ مجھے ایک ایسی دعا سکھائیے جس کو میں اپنی نماز میں بھی مانگا کروں اور اپنے گھر میں بھی مانگا کروں ۔ ۔ پھر لیث کی حدیث کے مانند بیان کیا ۔ مگر انہوں نے ( بغیر شک کے ) \" ظلما كثيرا \" ( بہت ظلم کیا ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 6871,
			"arabicnumber": "589.02",
			"text": "ابن نمیر نے کہا : ہمیں ہشام نے اپنے والد ( عروہ ) سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم ( اللہ تعالیٰ سے ) یہ دعائیں مانگا کرتے تھے : \" اے اللہ! میں تیری پناہ میں آتا ہوں آگ کے فتنے سے اور آگ کے عذاب سے اور غنا کی آزمائش کے شر سے اور فقر کی آزمائش کے شر سے اور میں تیری پناہ میں آتا ہوں جھوٹے مسیح کے فتنے کی برائی سے ۔ اے اللہ! میری خطائیں برف اور اولوں ( کے پانی ) سے دھودے ، اور میرے دل کو خطاؤں سے اس طرح صاف ستھرا کر دے جس طرح تو سفید کپڑے کو میل سے صاف کرتا ہے اور میرے اور میری خطاؤں کے درمیان اتنا فاصلہ ڈال دے جتنا فاصلہ تو نے مشرق اور مغرب کے درمیان ڈالا ہے ۔ اے اللہ! میں سستی ، عاجز کر دینے والے بڑھاپے ، گناہ اور قرج ( کے غلبے ) سے تیری پناہ میں آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 6872,
			"arabicnumber": "589.03",
			"text": "ابومعاویہ اور وکیع نے ہمیں ہشام سے اسی سند کے ساتھ حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 6873,
			"arabicnumber": "2706.01",
			"text": "ابن علیہ نے کہا : ہمیں سلیمان تیمی نے خبر دی ، انہوں نے کہا : ہمیں حضرت انس بن مالک رضی اللہ عنہ نے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم یہ دعا فرمایا کرتے تھے : \" اے اللہ! میں عاجز ہونے ، سستی ، بزدلی ، بڑھاپے اور بخل سے تیری پناہ میں آتا ہوں اور میں قبر کے عذاب اور زندگی اور موت کی آزمائشوں سے تیری پناہ میں آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 6874,
			"arabicnumber": "2706.02",
			"text": "یزید بن زریع اور معتمر دونوں نے تیمی سے ، انہوں نے حضرت انس رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، البتہ یزید کی حدیث میں آپ صلی اللہ علیہ وسلم کا قول : \" اور زندگی اور موت کی آزمائشوں سے ( میں تیزی پناہ میں آتا ہوں ) \" مذکور نہیں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 6875,
			"arabicnumber": "2706.03",
			"text": "ابن مبارک نے سلیمان تیمی سے ، انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے کئی اشیاء سے ، جن کا انہوں نے ذکر کیا اور بخل سے اللہ کی پناہ طلب کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 6876,
			"arabicnumber": "2706.04",
			"text": "شعیب بن حبحاب نے حضرت انس رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم یہ دعائیں مانگا کرتے تھے : \" اے اللہ! میں بخل ، سستی ، ذلیل ترین عمر ، قبر کے عذاب اور زندگی اور موت کی آزمائشوں سے تیری پناہ میں آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 6877,
			"arabicnumber": "2707",
			"text": "عمرو ناقد اور زُہیر بن حرب نے مجھے حدیث بیان کی ، انہوں نے کہا : ہمیں سفیان بن عیینہ نے حدیث بیان کی ، انہوں نے کہا : مجھے سُمی نے ابوصالح سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم انسان کے حق میں برا ثابت ہونے والے فیصلے ، بدبختی کے آ لینے ، اپنی تکلیف پر دشمنوں کے خوش ہونے اور عاجز کر دینے والی آزمائش سے پناہ مانگا کرتے تھے ۔ عمرو نے اپنی حدیث ( کی سند ) میں کہا : سفیان نے کہا : مجھے شک ہے کہ ( شاید ) میں نے ان باتوں میں سے کوئی ایک بات بڑھا دی ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 6878,
			"arabicnumber": "2708.01",
			"text": "لیث نے یزید بن ابی حبیب سے اور انہون نے حارث بن یعقوب سے روایت کی کہ یعقوب بن عبداللہ نے انہیں حدیث سنائی ، انہوں نے بسر بن سعید کو یہ کہتے ہوئے سنا ، میں نے سعد بن ابی وقاص رضی اللہ عنہ کو کہتے ہوئے سنا ، کہا : میں نے حضرت خولہ بنت حکیم سلمیہ سے سنا ، وہ کہتی تھیں : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جو شخص کسی ( بھی ) منزل پر اترا اور اس نے یہ کلمات کہے : میں اللہ ( سے اس ) کے مکمل ترین کلمات کی پناہ طلب کرتا ہوں ہر اس چیز کے شر سے جو اس نے پیدا کی ، تو اس شخص کو اس منزل سے چلے جانے تک کوئی چیز نقصان نہیں پہنچائے گی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 6880,
			"arabicnumber": "2709.01",
			"text": "یعقوب نے کہا : قعقاع بن حکیم نے ذوان سے ، انہوں نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ انہوں نے کہا : ایک شخص نبی صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کی : اللہ کے رسول! مجھے اس بچھو سے کتنی شدید تکلیف پہنچی جس نے کل رات مجھے کاٹ لیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم نے جب رات کی تھی ، یہ ( کلمات ) کہہ دیتے : میں ہر اس چیز کے شر سے جسے اللہ نے پیدا کیا ، اس کے کامل ترین کلمات کی پناہ میں آتا ہوں تو وہ ( بچھو ) تمہیں کوئی نقصان نہ پہنچاتا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 6881,
			"arabicnumber": "2709.02",
			"text": "لیث نے یزید بن ابی حبیب سے ، انہوں نے جعفر سے ، انہوں نے یعقوب سے روایت کی ، انہوں نے ان کو بتایا کہ غطفان کے آزاد کردہ غلام ابوصالح نے انہیں بتایا ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، کہتے تھے ایک شخص نے کہا : اللہ کے رسول! مجھے بچھو نے کاٹ لیا ۔ ( آگے ) ابن وہب کی حدیث کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 6882,
			"arabicnumber": "2710.01",
			"text": "منصور نے سعد بن عبیدہ سے روایت کی ، انہوں نے کہا : مجھے حضرت براء بن عازب رضی اللہ عنہ نے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب تم اپنے بستر پر جانے لگو تو اپنی نماز کے وضو کی طرح وضو کرو ، پھر اپنی دائیں کروٹ لیٹو ، پھر یہ کہو : \"\" اے اللہ! میں نے اپنا چہرہ تیرے سپرد کر دیا اور اپنا معاملہ تیرے حوالے کر دیا اور اپنی کمر تیرے سہارے پر ٹکا دی ، یہ سب سے امید اور تیرے خوف کے ساتھ کیا ۔ تیرے سوا تجھ سے نہ کہیں پناہ مل سکتی ہے ، نہ نجات حاصل ہو سکتی ہے ۔ میں تیری کتاب پر ایمان لایا جو تو نے نازل کی اور تیرے نبی پر ایمان لایا جسے تو نے مبعوث کیا ۔ ان کلمات کو تم ( اپنی زبان سے ادا ہونے والے ) آخری کلمات بنا لو ( ان کے بعد اور کچھ نہ بولو ) تو اس رات اگر تمہیں موت آ گئی تو فطرت پر موت آئے گی ۔ \"\" ( حضرت براء بن عازب رضی اللہ عنہ نے ) کہا : میں نے ان کلمات کو یاد کرنے کے لیے انہیں دہرایا تو کہا : \"\" میں تیرے رسول پر ایمان لایا جسے تو نے بھیجا \"\" تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" ( یوں ) کہو : میں تیرے نبی پر ایمان لایا جسے تو نے بھیجا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 6883,
			"arabicnumber": "2710.02",
			"text": "حُصین بن سعد بن عبیدہ سے ، انہوں نے حضرت براء بن عازب رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے یہ حدیث روایت کی ، مگر منصور نے زیادہ مکمل حدیث بیان کی اور حصین کی حدیث میں یہ اضافہ کیا : \" اگر یہ ( کہنے والا ) صبح کرے گا تو خیر حاصل کرے گا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 6884,
			"arabicnumber": "2710.03",
			"text": "محمد بن مثنیٰ نے ابوداود سے اور ابن بشار نے عبدالرحمٰن اور ابوداود دونوں سے روایت کی ، دونوں نے کہا : ہمیں شعبہ نے عمروہ بن مرہ سے حدیث سنائی ، انہوں نے کہا : میں نے سعد بن عبیدہ سے سنا ، وہ حضرت براء بن عازب رضی اللہ عنہ سے روایت کر رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو حکم دیا کہ جب وہ رات کو اپنی خواب گاہ میں جانے لگے تو ( دعا کرتے ہوئے ) یہ کہے : \" اے اللہ! میں نے اپنی جان تیرے سپرد کر دی اور اپنا چہرہ تیری طرف متوجہ کر لیا اور اپنی کمر تیرے سہارے پر ٹکا دی اور اپنا معاملہ تیرے حوالے کر دیا ، یہ سب تجھی سے امید کرتے ہوئے اور تجھی سے ڈرتے ہوئے کیا ۔ تجھ سے خوف تیرے سوا نہ پناہ کی کوئی جگہ ہے نہ نجات کی ۔ میں تیری کتاب پر ایمان لایا جو تو نے نازل کی اور تیرے رسول پر ایمان لایا جسے تو نے بھیجا ، پھر اگر ( اس رات ) اسے موت آ گئی تو فطرت پر موت آئے گی ۔ \" ابن بشار نے اپنی حدیث میں : \" رات کے وقت \" ( بستر پر جانے لگے ) کے الفاظ نہیں کہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 6885,
			"arabicnumber": "2710.04",
			"text": "ابو احوص نے ابواسحٰق سے اور انہوں نے حضرت براء بن عازب رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا : \" اے فلاں! جب تم اپنے بستر پر لیٹنے لگو ۔ ۔ ۔ \" اس کے بعد عمرو بن مرہ کی حدیث کے مانند ہے ۔ ( مگر ابو احوص نے منصور کی روایت کی طرح ) یہ الفاظ کہے : \" ( اور میں ایمان لایا ) تیرے نبی پر جسے تو نے بھیجا ، پھر اگر تم اس رات مر گئے تو ( عین ) فطرت پر مرو گے اور اگر تم نے ( زندہ حالت میں ) صبح کر لی تو خیر ( و بھلائی ) حاصل کرو گے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 6886,
			"arabicnumber": "2710.05",
			"text": "شعبہ نے ابواسحٰق سے روایت کی کہ انہوں نے حضرت براء بن عازب رضی اللہ عنہ کو کہتے ہوئے سنا : رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو حکم دیا ، اسی کے مانند ، اور انہوں نے \" اگر تم نے ( زندہ حالت میں ) صبح کی تو خیر حاصل کرو گے \" کے الفاظ بیان نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 6887,
			"arabicnumber": "2711",
			"text": "حضرت براء بن عازب رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم جب بستر پر تشریف لے جاتے تو یہ دعا کرتے : \" اے اللہ! میں تیرے نام سے جیتا ہوں اور تیرے نام سے وفات پاؤں گا \" اور جب بیدار ہوتے تو فرماتے : \" اللہ کی حمد ہے جس نے ہمیں وفات دینے کے بعد زندہ کر دیا اور اسی کی طرف ( قیامت کے روز ) زندہ ہو کر جاتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 6888,
			"arabicnumber": "2712",
			"text": "عقبہ بن مُکرم اور ابوبکر بن نافع نے کہا : ہمیں غندر نے حدیث بیان کی ، انہوں نے کہا : ہمیں شعبہ نے خالد سے حدیث سنائی ، انہوں نے کہا : میں نے عبداللہ بن حارث کو حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کرتے ہوئے سنا ، انہوں نے ایک شخص سے کہا کہ جب وہ اپنے بستر پر جائے تو یہ دعا کرے : \"\" اے اللہ! میری جان کو تو نے پیدا کیا اور تو ہی اس کو موت دے گا ، اس جان کی موت بھی اور زندگی بھی تیرے ہی لیے ہے ، اگر تو اس کو زندہ رکھے تو اس کی حفاظت فرمانا اور اگر تو اس کو موت دے تو اس کی مغفرت کرنا ، اے اللہ! میں تجھ سے عافیت مانگتا ہوں ۔ \"\" ایک شخص نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے پوچھا : کیا آپ نے یہ حدیث حضرت عمر رضی اللہ عنہ سے سنی ہے؟ انہوں نے کہا : ان سے جو حضرت عمر سے زیادہ افضل ہیں ( میں نے یہ حدیث ) رسول اللہ صلی اللہ علیہ وسلم سے ( سنی ہے ۔ ) ابن نافع نے اپنی روایت میں کہا : عبداللہ بن حارث سے روایت ہے ، یہ نہیں کہا : میں نے سنا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 6889,
			"arabicnumber": "2713.01",
			"text": "جریر نے سہیل سے روایت کی ، انہوں نے کہا : ( میرے والد ) ابوصالح ہمیں حکم دیا کرتے تھے کہ جب ہم میں سے کوئی شخص سونے کا ارادہ کرے تو بستر پر دائیں کروٹ لیٹے ، پھر دعا کرے : اے اللہ! اے آسمانوں کے رب اور زمین کے رب اور عرش عظیم کے رب ، اے ہمارے رب اور ہر چیز کے رب ، دانے اور گٹھلیوں کو چیر ( کر پودے اور درخت اگا ) دینے والے! تورات ، انجیل اور فرقان کو نازل کرنے والے! میں ہر اس چیز کے شر سے تیری پناہ میں آتا ہوں جس کی پیشانی تیرے قبضے میں ہے ، اے اللہ! تو ہی اول ہے ، تجھ سے پہلے کوئی شے نہیں ، اے اللہ! تو ہی آخر ہے ، تیرے بعد کوئی شے نہیں ہے ، تو ہی ظاہر ہے ، تیرے اوپر کوئی شے نہیں ہے ، تو ہی باطن ہے ، تجھ سے پیچھے کوئی شے نہیں ہے ، ہماری طرف سے ( ہمارا ) قرض ادا کر اور ہمیں فقر سے غنا عطا فرما ۔ وہ اس حدیث کو ابوہریرہ رضی اللہ عنہ سے اور وہ ( آگے ) اسے رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 6890,
			"arabicnumber": "2713.02",
			"text": "خالد طحان نے سہیل سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم ہمیں یہ حکم دیا کرتے تھے کہ جب ہم اپنے بستروں پر لیٹیں تو یہ دعا کریں ، جریر کی حدیث کے مانند ( اور خالد طحان نے \" ہر اس چیز کے شر سے \" کے بجائے ) کہا : \" ہر اس جاندار کے شر سے ( تیری پناہ چاہتا ہوں ) جسے تو نے اس کی پیشانی سے پکڑا ہوا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 6891,
			"arabicnumber": "2713.03",
			"text": "اعمش نے ابوصالح سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : حضرت فاطمہ رضی اللہ عنہا نبی صلی اللہ علیہ وسلم کے پاس ایک خادم مانگنے کے لیے آئیں تو آپ صلی اللہ علیہ وسلم نے ( جواب میں ) ان سے کہا : \" ( بیٹی! ) تم کہا کرو : اے اللہ! ساتوں آسمانوں کے رب! \" جس طرح سہیل نے اپنے والد ( ابوصالح ) سے روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 6892,
			"arabicnumber": "2714.01",
			"text": "انس بن عیاض نے کہا : ہمیں عبیداللہ نے حدیث بیان کی ، انہوں نے کہا : مجھے سعید بن ابی سعید مقبری نے اپنے والد سے حدیث بیان کی ، انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص اپنے بستر پر لیٹنا چاہے تو اپنے تہبند کا اندرونی حصہ لے کر اس سے اپنے بستر کو جھاڑے ، پھر بسم اللہ کہے کیونکہ وہ نہیں جانتا کہ اس ( کے اٹھ جانے ) کے بعد اس کے بستر پر ( مخلوقات میں سے ) کون آیا؟ پھر جب لیٹنا چاہے تو اپنی دائیں کروٹ لیٹے اور کہے : \" میرے پروردگار! تو ( ہر نا شایان بات سے ) پاک ہے ، میں نے تیرے ( حکم ) سے اپنا پہلو ( بستر پر ) رکھا اور تیرے ہی حک سے اسے اٹھاؤں گا اگر تو نے میری روح کو ( اپنے پاس ) روک لیا تو اس کی مغفرت کر دینا اور اگر تو نے اسے ( واپس ) بھیج دیا تو اس کی اسی طرح حفاظت فرمانا جس طرح تو اپنے نیک بندوں کی حفاظت فرماتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 6893,
			"arabicnumber": "2714.02",
			"text": "عبدہ نے عبیداللہ بن عمر سے اسی سند کے ساتھ یہی حدیث روایت کی اور کہا : \" پھر وہ یہ ہے : تیرے نام سے اے پروردگار! میں نے اپنا پہلو ٹکایا ، اگر تو نے میری جان کو زندہ کیا تو اس پر رحمت فرمانا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 6894,
			"arabicnumber": "2715",
			"text": "حضرت انس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب بستر پر جاتے تو فرماتے : \" اللہ تعالیٰ کی حمد ہے جس نے ہمیں کھلایا ، پلایا ، ( ہر طرح سے ) کافی ہوا اور ہمیں ٹھکانا دیا ۔ کتنے لوگ ہیں جن کا نہ کوئی کفایت کرنے والا ہے نہ ٹھکانہ دینے والا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 6895,
			"arabicnumber": "2716.01",
			"text": "منصور نے ہلال سے اور انہوں نے فروہ بن نوفل اشجعی سے روایت کی ، کہا : میں نے ام المومنین حضرت عائشہ رضی اللہ عنہا سے سوال کیا کہ رسول اللہ صلی اللہ علیہ وسلم اللہ تعالیٰ سے کیا دعائیں کیا کرتے تھے؟ حضرت عائشہ رضی اللہ عنہا نے کہا : آپ صلی اللہ علیہ وسلم دعا کیا کرتے تھے : \" اے اللہ! جو میں نے کیا اس کے شر سے اور جو میں نے نہیں کیا ، اس کے شر سے تیری پناہ میں آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 6896,
			"arabicnumber": "2716.02",
			"text": "عبداللہ بن ادریس نے حصین سے ، انہوں نے ہلال سے اور انہوں نے فروہ بن نوفل سے روایت کی ، کہا : میں نے حضرت عائشہ رضی اللہ عنہا سے سوال کیا کہ رسول اللہ صلی اللہ علیہ وسلم کیا دعا فرمایا کرتے تھے؟ حضرت عائشہ رضی اللہ عنہا نے کہا : آپ یہ دعا فرمایا کرتے تھے : \" اے اللہ! میں نے جو کام کیے ہیں ، ان کے شر سے اور جو کام میں نے نہیں کیے ، ان کے شر سے تیری پناہ چاہتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 6897,
			"arabicnumber": "2716.03",
			"text": "ابن ابی عدی اور محمد بن جعفر دونوں نے شعبہ سے اور انہوں نے حصین سے اسی سند کے ساتھ اسی کے مانند روایت کی ، مگر محمد بن جعفر کی حدیث میں ( وشر ما لم اعمل کے بجائے ) و من شر ما لم اعمل ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 6898,
			"arabicnumber": "2716.04",
			"text": "عبدہ بن ابولبابہ نے ہلال بن سیاف سے ، انہوں نے فروہ بن نوفل سے اور انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی کہ نبی صلی اللہ علیہ وسلم اپنی دعا میں فرماتے تھے : \" اے اللہ! میں ان کاموں کے شر سے جو میں نے کیے اور ان کے شر سے جو نہیں کیے ، تیری پناہ میں آتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 6899,
			"arabicnumber": "2717",
			"text": "حضرت ابن عباس رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ( دعا کرتے ہوئے ) فرمایا کرتے تھے : \" اے اللہ! میں تیرے لیے فرمانبردار ہو گیا ، تیرے ساتھ ایمان لایا ، تجھ پر بھروسہ کیا ، تیری طرف رجوع کیا اور تیری مدد سے ( کفر کے ساتھ ) مخاصمت کی ۔ اے اللہ! میں اس بات سے تیری عزت کی پناہ لیتا ہوں ۔ ۔ تیرے سوا کوئی معبود نہیں ۔ ۔ کہ تو مجھے سیدھی راہ سے ہٹا دے ۔ ۔ تو ہی ہمیشہ زندہ رہنے والا ہے جس کو موت نہیں آ سکتی اور جن و انس سب مر جائیں گے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 6900,
			"arabicnumber": "2718",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم جب کسی سفر میں ہوتے اور سحر کے وقت اٹھتے تو فرماتے : \" ( ہماری طرف سے ) اللہ کی حمد اور اس کے انعام کی خوبصورتی ( کے اعتراف ) کا سننے والا یہ بات دوسروں کو بھی سنا دے ۔ اے ہمارے رب! ہمارے ساتھ رہ ، ہم پر احسان کر ، میں آگ سے اللہ کی پناہ مانگتے ہوئے یہ دعا کر رہا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 6901,
			"arabicnumber": "2719.01",
			"text": "معاذ عنبری نے کہا : ہمیں شعبہ نے ابواسحٰق سے حدیث بیان کی ، انہوں نے ابوبردہ بن ابوموسیٰ اشعری سے ، انہوں نے اپنے والد حضرت ابوموسیٰ اشعری رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ یہ دعا فرمایا کرتے تھے : \" اے اللہ! میری خطاء میری لا علمی ، اپنے ( کسی ) معاملے میں میرا حد سے آگے یا پیچھے رہ جانا اور وہ سب کچھ جو میری نسبت تو زیادہ جانتا ہے سب معاف فرما دے ۔ اے اللہ! میرے وہ سب کام جو ( تجھے پسند نہ آئے ہوں ) میں نے سنجیدگی سے کیے ہوں یا مزاحا کیے ہوں ، بھول چوک کر کیے ہوں یا جان بوجھ کر کیے ہوں اور یہ سب مجھ سے ہوئے ہوں ، ان کو بخش دے ۔ اے اللہ! میری وہ باتیں ( جو تجھے پسند نہیں آئیں ) بخش دے جو میں نے پہلے کیں یا جو میں نے بعد میں کیں ، اکیلے میں کیں یا جو میں نے سب کے سامنے کیں اور جنہیں تو مجھ سے زیادہ جاننے والا ہے ، تو ہی ( جسے چاہے اپنی رحمت کی طرف ) آگے بڑھانے والا ہے اور تو ہی پیچھے کرنے والا ہے اور تو ہر چیز پر قادر ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 6902,
			"arabicnumber": "2719.02",
			"text": "عبدالملک بن صباح مسمعی نے کہا : ہمیں شعبہ نے اسی سند سے ( یہی ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 6903,
			"arabicnumber": "2720",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم فرمایا کرتے تھے : \" اے اللہ! میرے دین کو درست کر دے ، جو میرے ( دین و دنیا کے ) ہر کام کے تحفظ کا ذریعہ ہے اور میری دنیا کو درست کر دے جس میں میری گزران ہے اور میری آخرت کو درست کر دے جس میں میرا ( اپنی منزل کی طرف ) لوٹنا ہے اور میری زندگی کو میرے لیے ہر بھلائی میں اضافے کا سبب بنا دے اور میری وفات کو میرے لیے ہر شر سے راحت بنا دے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 6904,
			"arabicnumber": "2721.01",
			"text": "محمد بن مثنیٰ اور محمد بن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث بیان کی ، انہوں نے کہا : ہمیں شعبہ نے ابواسحٰق سے حدیث سنائی ، انہوں نے ابواحوص سے ، انہوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم فرمایا کرتے تھے : \" اے اللہ! میں تجھ سے ہدایت ، تقویٰ ، پاک دامنی ، اور ( دل کا ) غنا مانگتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 6905,
			"arabicnumber": "2721.02",
			"text": "محمد بن مثنیٰ اور ابن بشار نے کہا : ہمیں عبدالرحمٰن نے سفیان سے حدیث بیان کی ، انہوں نے ابواسحاق سے اسی سند کے ساتھ اسی کے مانند روایت کی ، البتہ ابن مثنیٰ نے اپنی روایت میں ( عفاف کی بجائے ) \" عفت \" کا لفظ کہا ۔ ( مفہوم ایک ہی ہے ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 6906,
			"arabicnumber": "2722",
			"text": "عبداللہ بن حارث اور ابو عثمان نہدی نے حضرت زید بن ارقم رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : میں تمہیں اسی طرح بتاتا ہوں جس طرح رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا ، آپ فرماتے تھے : \" اے اللہ! میں تجھ سے تیری پناہ میں آتا ہوں ، عاجز ہو جانے ، سستی ، بزدلی ، بخل ، سخت بڑھاپے اور قبر کے عذاب سے ۔ اے اللہ! میرے دل کو تقویٰ دے ، اس کو پاکیزہ کر دے ، تو ہی اس ( دل ) کو سب سے بہتر پاک کرنے والا ہے ، تو ہی اس کا رکھوالا اور اس کا مددگار ہے ۔ اے اللہ! میں تجھ سے ایسے علم سے تیری پناہ مانگتا ہوں جو کوئی فائدہ نہ دے اور ایسے دل سے جو ( تیرے آگے ) جھک کر مطمئن نہ ہوتا ہو اور ایسے من سے جو سیر نہ ہو اور ایسی دعا سے جسے شرف قبولیت نصیب نہ ہو ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 6907,
			"arabicnumber": "2723.01",
			"text": "عبدالواحد بن زیاد نے حسن بن عبداللہ سے روایت کی ، انہوں نے کہا : ہمیں ابراہیم بن سعد نخعی نے حدیث بیان کی ، انہوں نے کہا : ہمیں عبدالرحمٰن بن یزید نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے حدیث بیان کی ، انہوں نے کہا : جب شام ہوتی تو رسول اللہ صلی اللہ علیہ وسلم یہ دعا کرتے تھے : \"\" ہم نے شام کی اور سارا ملک ( شام کے وقت بھی ) اللہ کا ہوا ، سب شکر اور تعریف اللہ کے لیے ہے ، اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا ( مالک ، معبود ) ہے ، اس کا کوئی شریک نہیں ۔ \"\" حسن ( بن عبیداللہ ) نے کہا : مجھے زید نے حدیث بیان کی ، انہوں نے اس ( دعا ) میں ( یہ حصہ ) ابراہیم ( نخعی ) سے ( سن کر ) حفظ کہا : \"\" اسی کی بادشاہی اور اسی کے لیے ہر طرح کی تعریف ہے اور وہ ہر چیز پر پوری طرح قادر ہے ۔ اے اللہ! میں تجھ سے اس رات کی بھلائی مانگتا ہوں اور تجھ سے اس رات کی اور اس کے بعد ( کے ہر لمحے ) کی برائی سے پناہ طلب کرتا ہوں ، اے اللہ! میں کسل مندی اور بڑھاپے کی خرابی سے تیری پناہ میں آتا ہوں ، اے اللہ! میں تیری پناہ مانگتا ہوں جہنم میں کسی بھی قسم کے عذاب سے اور قبر میں کسی بھی قسم کے عذاب سے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 6908,
			"arabicnumber": "2723.02",
			"text": "جریر نے حسن بن عبیداللہ سے ، انہوں نے ابراہیم بن سوید سے ، انہوں نے عبدالرحمٰن بن یزید سے اور انہوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کی ، انہوں نے کہا : اللہ کے نبی صلی اللہ علیہ وسلم جب شام کرتے تو ( دعا کرتے ہوئے ) فرماتے : \" ہم اور سارا ملک شام کے وقت بھی اللہ کا ہوا ، سب حمد اللہ کے لیے ہے ، اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا ہے ، اس کا کوئی شریک نہیں ۔ \" ( حسن بن عبیداللہ نے ) کہا : میں دیکھتا ہوں کہ انہوں ( ابراہیم نخعی ) نے ان کلمات میں یہ بھی کہا : \" ساری بادشاہت اسی کی ہے ، ( ہر نعمت پر ) ساری تعریف بھی اسی کو سزاوار ہے ، وہی ہر چیز پر پوری قدرت رکھنے والا ہے ۔ اے میرے پروردگار! جو کچھ اس رات میں ہے اور جو اس کے بعد ہے ، میں تجھ سے اس کی بھلائی کا طلبگار ہوں اور جو کچھ اس رات میں ہے اور جو اس کے بعد ہے اس کی برائی سے میں تیری پناہ میں آتا ہوں ۔ اے میرے پروردگار! میں تیری پناہ چاہتا ہوں کسل مندی سے اور بڑھاپے کی خرابی سے ۔ اے میرے پروردگار! میں تجھ سے پناہ مانگتا ہوں جہنم میں کسی بھی قسم کے عذاب سے اور قبر میں کسی بھی قسم کے عذاب سے ۔ \" اور جب آپ صلی اللہ علیہ وسلم صبح کرتے تو ( بالکل اسی طرح ) فرماتے : ہم اور ساری بادشاہت اور اختیار صبح کو ( بھی ) اللہ کے ہوئے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 6909,
			"arabicnumber": "2723.03",
			"text": "زائدہ نے حسن بن عبیداللہ سے ، انہوں نے ابراہیم بن سُوید سے ، انہوں نے عبدالرحمٰن بن یزید سے اور انہوں نے حضرت عبداللہ بن مسعود رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم شام کے وقت ( دعا کرتے ہوئے یہ ) فرمایا کرتے تھے : \"\" ہم نے اور سارے ملک نے اللہ کے ( حکم و فرمان کی پابندی کے ) لیے شام کی ۔ سب تعریف اللہ کے لیے ہے ، اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا ہے ، اس کا کوئی شریک نہیں ۔ اے اللہ! میں تجھ سے اس رات کی اور اس میں موجود ہر بھلائی کا سوال کرتا ہوں اور میں تجھ سے اس رات کے اور اس میں موجود ہر شر سے پناہ کا طلبگار ہوں ۔ اے اللہ! میں تیری پناہ مانگتا ہوں ، سستی طاری ہو جانے سے اور عمر ( کے حد سے ) بڑھ جانے سے اور بڑھاپے کی خرابی سے اور دنیا کے ہر فتنے اور قبر کے عذاب سے ۔ \"\" حسن بن عبیداللہ نے کہا : زبید نے مجھے ابراہیم بن سوید ( نخعی ) سے ، انہوں نے عبدالرحمان بن یزید سے ، انہوں نے حضرت عبداللہ ( بن مسعود رضی اللہ عنہ ) سے روایت کرتے ہوئے مزید یہ بتایا کہ آپ صلی اللہ علیہ وسلم ( جب شام کرتے تو ) یہ فرماتے : \"\" اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا ہے ، اس کا کوئی شریک نہیں ، ساری بادشاہت اسی کی ہے ، سب تعریف اسی کو سزاوار ہے اور وہی ہر چیز پر قادر ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 6910,
			"arabicnumber": "2724",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ( دعا کرتے ہوئے یہ ) فرمایا کرتے تھے : \" اکیلے اللہ کے سوا کوئی عبادت کے لائق نہیں ، اس نے اپنے لشکر کو عزت دی ، اپنے بندے کی نصرت کی ، اکیلا وہ تمام جماعتوں پر غالب آیا ، ( وہی آخر ہے ) اس کے بعد کچھ نہیں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 6911,
			"arabicnumber": "2725.01",
			"text": "ابوکریب محمد بن علاء نے ہمیں حدیث بیان کی ، انہوں نے کہا : ہمیں ( عبداللہ ) بن ادریس نے حدیث بیان کی ، انہوں نے کہا : میں عاصم بن کلیب سے سنا ، انہوں نے ابوبردہ سے اور انہوں نے حضرت علی رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" ( دعا کرتے ہوئے یہ ) کہو : اے اللہ! مجھے ہدایت دے اور مجھے سیدھے راستے پر چلا ، اور ( اے علی! ) ہدایت ( کا نام لیتے ہوئے اس ) سے صحیح راستے پر چلنے کو ذہن میں رکھو اور سیدھا رہنے سے تیری جیسی سدھائی مراد کو ( مانگتے ہوئے ہدایت اور صواب کا کمال طلب کرو ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 6912,
			"arabicnumber": "2725.02",
			"text": "ابن نمیر نے کہا : ہمیں عبداللہ بن ادریس نے حدیث بیان کی ، انہوں نے کہا : ہمیں عاصم بن کلیب نے اسی سند کے ساتھ خبر دی ( کہ حضرت علی رضی اللہ عنہ نے ) کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" ( اے علی! یہ ) کہو : اے اللہ! میں تجھ سے ہدایت اور راستی کا سوال کرتا ہوں ۔ \" پھر اسی کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 6913,
			"arabicnumber": "2726.01",
			"text": "کُریب نے حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے حضرت جویریہ رضی اللہ عنہا سے روایت کی کہ نبی صلی اللہ علیہ وسلم صبح کی نماز پڑھنے کے بعد صبح سویرے ان کے ہاں سے باہر تشریف لے گئے ، اس وقت وہ اپنی نماز پڑھنے والی جگہ میں تھیں ، پھر دن چڑھنے کے بعد آپ صلی اللہ علیہ وسلم ان کے پاس واپس تشریف لائے تو وہ ( اسی طرح ) بیٹھی ہوئی تھیں ۔ آپ نے فرمایا : \" تم اب تک اسی حالت میں بیٹھی ہوئی ہو جس پر میں تمہیں چھوڑ کر گیا تھا؟ \" انہوں نے عرض کی : جی ہاں ، نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" تمہارے ( ہاں سے جانے کے ) بعد میں نے چار کلمے تین بار کہے ہیں ، اگر ان کو ان کے ساتھ تولا جائے جو تم نے آج کے دن اب تک کہا ہے تو یہ ان سے وزن میں بڑھ جائیں : \" سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته \" پاکیزگی ہے اللہ کی اور اس کی تعریف کے ساتھ ، جتنی اس کی مخلوق کی گنتی ہے اور جتنی اس کو پسند ہے اور جتنا اس کے عرش کا وزن اور جتنی اس کے کلمات کی سیاہی ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 6914,
			"arabicnumber": "2726.02",
			"text": "ابورشدین نے حضرت ابن عباس رضی اللہ عنہ سے اور انہوں نے حضرت جویریہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : صبح کی نماز کے وقت یا صبح کی نماز کے بعد رسول اللہ صلی اللہ علیہ وسلم گزرتے ہوئے ان کے ہاں تشریف لائے ۔ ۔ پھر اس ( پچھلی حدیث ) کے مطابق بیان کیا ۔ ۔ مگر انہوں نے ( اپنے کلموں کو اس طرح ) بیان کیا : \" میں اللہ کی تسبیح بیان کرتا ہوں جتنی اس کی مخلوقات کی گنتی ہے ، میں اللہ کی تسبیح بیان کرتا ہوں جتنی اس کی رضا ہے ، میں اللہ کی تسبیح بیان کرتا ہوں جتنا اس کے عرش کا وزن ہے ، میں اللہ کی تسبیح کرتا ہوں جتنی اس کے کلمات کی سیاہی ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 6915,
			"arabicnumber": "2727.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے حکم سے حدیث بیان کی ، انہوں نے کہا : میں نے ابن ابی لیلی سے سنا ، انہوں نے کہا : ہمیں حضرت علی رضی اللہ عنہ نے حدیث بیان کی کہ حضرت فاطمہ رضی اللہ عنہا کو چکی پیسنے سے جو زحمت برداشت کرنی پڑی اس کی وجہ سے ان کے ہاتھوں میں تکلیف ہوئی ۔ رسول اللہ صلی اللہ علیہ وسلم کے پاس کچھ قیدی آئے ۔ آپ کی طرف گئیں ، لیکن آپ صلی اللہ علیہ وسلم کو ( گھر میں ) نہ پایا ۔ حضرت عائشہ رضی اللہ عنہا سے ملیں اور انہیں ( اپنی تکلیف کے بارے میں ) بتایا ۔ جب نبی صلی اللہ علیہ وسلم تشریف لائے تو حضرت عائشہ رضی اللہ عنہا نے آپ کو ان ( حضرت فاطمہ رضی اللہ عنہا ) کے اپنے پاس آنے کے بارے میں بتایا تو رسول اللہ صلی اللہ علیہ وسلم ہمارے ہان تشریف لائے ۔ ۔ اس وقت ہم اپنے اپنے بستروں میں جا چکے تھے ، ہم کھڑے ہونے لگے تو نبی صلی اللہ علیہ وسلم نے فرمایا : \" دونوں اپنی اپنی جگہ پر رہو ۔ \" آپ ہم دونوں کے درمیان ( والی جگہ پر ) بیٹھ گئے حتی کہ میں نے آپ کے قدم مبارک کی ٹھڈک اپنے سینے پر محسوس کی ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم دونوں نے مجھ سے مانگا ہے میں تمہیں اس سے بہتر بات نہ سکھلاؤں؟ جب تم دونوں اپنے اپنے بستروں میں جاؤ تو چونتیس بار اللہ اکبر کہو ، تینتیس بار سبحان اللہ کہو اور تینتیس بار الحمدللہ کہو ، یہ ( عمل ) تم دونوں کے لیے ایک خادم ( مل جانے ) سے بہتر ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 6916,
			"arabicnumber": "2727.02",
			"text": "وکیع ، معاذ اور ابن ابی عدی سب نے شعبہ سے اسی سند کے ساتھ روایت کی اور معاذ کی حدیث میں ہے : \" جب تم دونوں رات کے وقت اپنے بستر میں چلے جاؤ ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 6917,
			"arabicnumber": "2727.03",
			"text": "عبیداللہ بن ابی یزید اور عطاء بن ابی رباح نے مجاہد سے ، انہوں نے ابن ابی لیلیٰ سے ، انہوں نے حضرت علی رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے اسی طرح حدیث بیان کی جس طرح حکم نے ابن ابی لیلیٰ سے روایت کی ۔ انہوں نے حدیث میں مزید یہ بیان کیا کہ حضرت علی رضی اللہ عنہ نے کہا : میں نے جب سے رسول اللہ صلی اللہ علیہ وسلم سے یہ بات سنی میں نے کبھی اسے ترک نہیں کیا ۔ ان سے پوچھا کیا : جنگ صفین کی رات بھی نہیں چھوڑا؟ انہوں نے جواب دیا : جنگ صفین کی رات بھی ( اسے نہیں چھوڑا ۔ ) عطاء نے جو حدیث مجاہد سے اور انہوں نے ابن ابی لیلیٰ سے روایت کی ، انہوں ( ابن ابی لیلیٰ ) نے کہا : میں نے ان ( حضرت علی رضی اللہ عنہ ) سے عرض کی : صفین کی رات بھی نہ چھوڑا؟",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 6920,
			"arabicnumber": "2729",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" جب تم مرغ کی بانگ سنو تو اللہ تعالیٰ سے اس کے فضل کا سوال کرو ، کیونکہ ( اس وقت ) اس نے ایک فرشتے کو دیکھا ہے اور جب تم گدھے کی آواز سنو تو شیطان سے اللہ کی پناہ مانگو کیونکہ اس نے شیطان کو دیکھا ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 6921,
			"arabicnumber": "2730.01",
			"text": "معاذ بن ہشام نے کہا : مجھے میرے والد نے قتادہ سے حدیث بیان کی ، انہوں نے ابوعالیہ سے اور انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم کرب کے وقت یہ دعا کیا کرتے تھے : \" اللہ کے سوا کوئی عبادت کے لائق نہیں جو سب سے عظیم ہے ، سب سے زیادہ حلم والا ہے ۔ اللہ کے سوا کوئی عبادت کے لائق نہیں جو عرش عظیم کا مالک ہے ۔ اللہ کے سوا کوئی عبادت کے لائق نہیں جو آسمانوں کا مالک ، زمینوں کا مالک اور عزت والے عرش کا مالک ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 6922,
			"arabicnumber": "2730.02",
			"text": "وکیع نے ہشام سے اسی سند کے ساتھ حدیث بیان کی ، لیکن معاذ بن ہشام کی حدیث زیادہ مکمل ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 6923,
			"arabicnumber": "2730.03",
			"text": "ہمیں سعید بن ابی عروبہ نے قتادہ سے روایت کی ، ابوعالیہ ریاحی نے انہیں حضرت ابن عباس رضی اللہ عنہ سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم کرب کے وقت ان الفاظ سے دعا فرماتے تھے ، پھر وہی کلمات ذکر کیے جو معاذ بن ہشام نے اپنے والد سے اور انہوں نے قتادہ سے روایت کیے ، مگر انہوں نے ( \" رب السماوات و رب الارض \" کے بجائے ) \" رب السماوات والارض \" کہا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 6924,
			"arabicnumber": "2730.04",
			"text": "(حماد بن سلمہ نے کہا : مجھے یوسف بن عبداللہ بن حارث نے ابوعالیہ سے خبر دی ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم کو جب کوئی سخت مشکل اور تکلیف دہ معاملہ درپیش ہوتا تو آپ فرماتے ، پھر اسی طرح بیان کیا جس طرح معاذ نے اپنے والد سے حدیث بیان کی ہے اور ان کلمات کے ساتھ \" لا اله الا لله العظيم الحليم \" کے بعد ) \" لا اله الا لله رب العرش الكريم \" مزید بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 6925,
			"arabicnumber": "2731.01",
			"text": "وہیب نے کہا : ہمیں سعید جریری نے ابو عبداللہ جسری سے حدیث بیان کی ، انہوں نے ابن صامت سے اور انہوں نے حضرت ابوذر رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا گیا : ( اللہ کے ذکر کے لیے ) کون سا کلمہ افضل ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" جسے اللہ نے اپنے فرشتوں کے لیے یا ( ان سمیت ) اپنے تمام بندوں کے لیے منتخب فرمایا ہے : سبحان الله وبحمده \" میں ( ہر نعمت کے لیے ) اللہ کی حمد کے ساتھ ہر ناشایان چیز سے اس کی پاکیزگی بیان کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 6926,
			"arabicnumber": "2731.02",
			"text": "شعبہ نے جریر سے ، انہوں نے ابوعبداللہ جسری سے جو عنزہ قبیلے سے تھے ، انہوں نے عبداللہ بن صامت سے اور انہوں نے حضرت ابوذر رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمہیں وہ کلمہ نہ بتاؤں جو اللہ تعالیٰ کو سب سے زیادہ محبوب ہے؟ \" میں نے کہا : اللہ کے رسول! مجھے وہ کلمہ بتائیے جو اللہ تعالیٰ کو سب سے زیادہ محبوب ہے ، تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ کو سب سےزیادہ محبوب کلمہ سبحان الله وبحمده ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 6927,
			"arabicnumber": "2732.01",
			"text": "فضیل نے طلحہ بن عبیداللہ بن کریز سے ، انہوں نے ام درداء سے اور انہوں نے حضرت ام درداء رضی اللہ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی مسلمان بندہ نہیں جو اپنے بھائی کی پیٹھ پیچھے اس کے لیے دعا کرے ، مگر ایک فرشتہ ( ہے جو ) کہتا ہے : تمہیں بھی اس کے مانند ملے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 6928,
			"arabicnumber": "2732.02",
			"text": "موسیٰ بن سروان معلم نے ہمیں حدیث بیان کی ، کہا : مجھے طلحہ بن عبیداللہ بن کریز نے حدیث بیان کی ، کہا : مجھے حضرت ام درداء رضی اللہ عنہا نے حدیث بیان کی ، کہا : میرے آقا ( خاوند ) نے مجھ سے بیان کیا کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" جس شخص نے اپنے بھائی کے لیے اس کی پیٹھ پیچھے دعا کی تو جو فرشتہ اس کے ساتھ مقرر ہے وہ کہتا ہے : آمین اور تمہیں بھی اسی کے مانند عطا ہو ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 6930,
			"arabicnumber": "2732.03",
			"text": "(صفوان نے ) کہا : میں بازار کی طرف نکلا تو حضرت ابودرداء رضی اللہ عنہ سے بھی میری ملاقات ہوئی ، انہوں نے بھی نبی صلی اللہ علیہ وسلم سے روایت کرتے ہوئے مجھ سے وہی کچھ کہا ( جو ان کی بیوی حضرت ام درداء رضی اللہ عنہا نے کہا تھا ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 6931,
			"arabicnumber": "2732.04",
			"text": "یزید بن ہارون نے عبدالملک بن ابی سلیمان سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ، اور کہا : صفوان بن عبداللہ بن صفوان سے روایت ہے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 6932,
			"arabicnumber": "2734.01",
			"text": "ابواسامہ اور محمد بن بشر نے زکریا بن ابی زائدہ سے ، انہوں نے سعید بن ابی بُردہ سے اور انہوں نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : اللہ تعالیٰ اس بات پر ( اپنے ) بندے سے راضی ہوتا ہے کہ وہ ایک کھانا کھائے اور اس پر اللہ کی حمد کرے یا پینے کی کوئی چیز ( پانی ، دودھ وغیرہ ) پیے اور اس پر اللہ کی حمد کرے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 6933,
			"arabicnumber": "2734.02",
			"text": "اسحٰق بن یوسف ازرق نے کہا : ہمیں زکریا بن ابی زائدہ نے سعید بن ابی بُردہ سے حدیث بیان کی ، انہوں نے انس بن مالک رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، ( آگے ) اسی کے مانند ( ہے ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 6934,
			"arabicnumber": "2735.01",
			"text": "امام مالک نے ابن شہاب سے ، انہوں نے ابن ازہر کے آزاد کردہ غلام ابوعبید سے اور انہوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی شخص کی دعا اس وقت تک قبول ہوتی ہے جب تک وہ جلد بازی کرتے ہوئے یہ نہیں کہتا : میں نے دعا کی ، لیکن میرے حق میں قبول نہیں ہوتی ۔ ۔ یا نہیں ہوئی ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 6935,
			"arabicnumber": "2735.02",
			"text": "عقیل بن خالد نے ابن شہاب سے روایت کی ، انہوں نے کہا : مجھے عبدالرحمٰن بن عوف رضی اللہ عنہ کے آزاد کردہ غلام ابوعبید نے حدیث بیان کی ۔ ۔ اور وہ قراء اور اہل فقہ میں سے ہیں ۔ ۔ انہوں نے کہا : میں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کسی بھی شخص کی دعا قبول ہوتی ہے جب تک وہ جلد بازی نہ کرے اور یہ ( نہ ) کہے : میں نے اپنے رب سے دعا کی تو اس نے مجھے میری دعا کا جواب نہیں دیا ( میری دعا قبول نہیں کی ۔)",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 6936,
			"arabicnumber": "2735.03",
			"text": "ابوادریس خولانی نے حضرت ابوہریرہ رضی اللہ عنہ سے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" جب تک کوئی بندہ گناہ یا قطع رحمی کی دعا نہ کرے اور قبولیت کے معاملے میں جلد بازی نہ کرے ، اس کی دعا قبول ہوتی رہتی ہے ۔ \" عرض کی گئی : اللہ کے رسول! جلد بازی کرنا کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ کہے : میں نے دعا کی اور میں نے دعا کی اور مجھے نظر نہیں آتا کہ وہ میرے حق میں قبول کرے گا ، پھر اس مرحلے میں ( مایوس ہو کر ) تھک جائے اور دعا کرنا چھوڑ دے ۔",
			"grades": [],
			"reference": {
				"book": 48,
				"hadith": 127
			}
		}
	]
}