{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"49": "The Book of Heart-Melting Traditions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6937,
			"arabicnumber": "2736",
			"text": "حماد بن سلمہ ، معاذ بن معاذ ، عنبری ، معتمر ، جریر اور یزید بن زُریع نے کہا : ہمیں سلیمان تیمی نے ابوعثمان سے حدیث بیان کی ، انہوں نے حضرت اسامہ بن زید رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں جنت کے دروازے پر کھڑا ہوا تو زیادہ تر لوگ جو اس میں داخل ہوئے ، مسکین تھے اور میں نے دیکھا کہ مال و متاع والے ( جنتی ) باہر روکے ہوئے تھے ، سوائے ( مالدار ) دوزخیوں کے ، انہیں جہنم میں ڈالنے کا حکم ( فورا ہی ) صادر کر دیا گیا تھا ۔ اور میں جہنم کے دروازے پر کھڑا ہوا تو دیکھا کہ اس میں داخل ہونے والی بیشتر عورتیں تھیں ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 6938,
			"arabicnumber": "2737.01",
			"text": "اسماعیل بن ابراہیم نے ایوب سے ، انہوں نے ابورجاء عطاروی سے روایت کی ، انہوں نے کہا : میں نے حضرت ابن عباس رضی اللہ عنہ کو بیان کرتے ہوئے سنا کہ حضرت محمد صلی اللہ علیہ وسلم نے فرمایا : \" میں نے جنت کے اندر جھانک کر دیکھا تو میں نے اہل جنت میں اکثریت فقراء کی دیکھی اور میں نے دوزخ میں جھانک کر دیکھا تو میں نے دوزخ میں اکثریت عورتوں کی دیکھی ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 6939,
			"arabicnumber": "2737.02",
			"text": "(عبدالوہاب ) ثقفی نے بتایا : ایوب نے ہمیں اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 6940,
			"arabicnumber": "2737.03",
			"text": "ابو اشہب نے ہمیں حدیث بیان کی ، کہا : ہمیں ابو رجاء نے حضرت ابن عباس رضی اللہ عنہ سے حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم نے آگ ( جہنم ) میں جھانک کر دیکھا ۔ پھر ایوب کی حدیث کے مانند ذکر کیا ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 6941,
			"arabicnumber": "2737.04",
			"text": "سعید بن ابی عروبہ سے روایت ہے ، انہوں نے ابورجاء سے سنا ، انہوں نے حضرت ابن عباس رضی اللہ عنہ سے روایت کی ، انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، پھر اسی کے مانند ذکر کیا ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6942,
			"arabicnumber": "2738.01",
			"text": "معاذ نے کہا : ہمیں شعبہ نے ابوتیاح سے حدیث بیان کی ، انہوں نے کہا : مطرف بن عبداللہ کی دو بیویاں تھیں ، وہ ایک بیوی کے پاس سے آئے تو دوسری نے کہا : تم فلاں عورت ( دوسری بیوی کا نام لیا ) کے پاس سے آئے ہو؟ انہوں نے کہا : میں حضرت عمران بن حصین رضی اللہ عنہ کے پاس سے ( بھی ہو کر ) آیا ہوں اور انہوں نے ہمیں یہ حدیث بیان کی ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جنت میں رہنے والوں میں سب سے کم تعداد عورتوں کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 6943,
			"arabicnumber": "2738.02",
			"text": "ہمیں محمد بن جعفر نے حدیث بیان کی ، کہا : ہمیں شعبہ نے ابوتیاح سے حدیث سنائی ، کہا : میں نے مطرف کو حدیث بیان کرتے ہوئے سنا کہ ان کی دو بیویاں تھیں ( آگے ) معاذ کی حدیث کے ہم معنی ( روایت کی ۔)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 6944,
			"arabicnumber": "2739",
			"text": "حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم کی دعاؤں میں سے ایک یہ تھی : \" اے اللہ! میں تیری پناہ چاہتا ہوں تیری نعمت کے زوال سے ، تیری عافیت کے ہٹ جانے سے ، تیری ناگہانی سزا سے اور تیری ہر طرح کی ناراضی سے ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 6945,
			"arabicnumber": "2740",
			"text": "سعید بن منصور نے کہا : ہمیں سفیان اور معتمر بن سلیمان نے سلیمان تیمی سے حدیث بیان کی ، انہوں نے ابوعثمان نہدی سے اور انہوں نے حضرت اسامہ بن زید رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے اپنے بعد کوئی آزمائش نہیں چھوڑی جو مردوں کے لیے عورتوں ( کی آزمائش ) سے بڑھ کر نقصان پہنچانے والی ہو ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 6946,
			"arabicnumber": "2741.01",
			"text": "عبیداللہ بن معاذ عنبری ، سعید بن سعید اور محمد بن عبدالاعلیٰ نے ہمیں معتمر سے حدیث بیان کی ۔ ابن معاذ نے کہا : ہمیں معتمر بن سلیمان نے حدیث بیان کی ، انہوں نے کہا : میرے والد نے کہا : ہمیں ابوعثمان نے حضرت اسامہ بن زید اور حضرت سعید بن زید رضی اللہ عنہ سے روایت کی ، ان دونوں نے رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں اپنے بعد لوگوں میں کوئی ایسا فتنہ چھوڑ کر نہیں جا رہا جو مردوں کے لیے عورتوں سے بڑھ کر نقصان پہنچانے والا ہو ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 6947,
			"arabicnumber": "2741.02",
			"text": "ابوخالد احمر ، ہشیم اور جریر سب نے سلیمان تیمی سے ، اسی سند کے ساتھ ، اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 6948,
			"arabicnumber": "2742",
			"text": "محمد بن مثنیٰ اور محمد بن بشار نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں محمد بن جعفر نے حدیث سنائی ، انہوں نے کہا : ہمیں شعبہ نے ابوسلمہ سے حدیث بیان کی ، انہوں نے کہا : میں نے ابونضرہ سے سنا ، وہ حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کر رہے تھے ، انہوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" بلاشبہ دنیا بہت میٹھی اور ہری بھری ہے اور اللہ تعالیٰ اس میں تمہیں ( تم سے پہلے والوں کا ) جانشیں بنانے والا ہے ، پھر وہ دیکھے گا کہ تم کیسے عمل کرتے ہو ، لہذا تم دنیا ( میں کھو جانے سے ) بچتے رہنا اور عورتوں ( کے فتنے میں مبتلا ہونے سے ) بچ کر رہنا ، اس لیے کہ بنی اسرائیل میں سب سے پہلا فتنہ عورتوں ( کے معاملے ) میں تھا ۔ \"\" اور بشار کی حدیث میں ہے : \"\" تاکہ وہ دیکھے کہ تم کس طرح عمل کرتے ہو ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 6949,
			"arabicnumber": "2743.01",
			"text": "انس بن عیاض ابو ضمرہ نے موسیٰ بن عقبہ سے ، انہوں نے نافع سے ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے اور انہوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ۔ آپ نے فرمایا : \"\" تین آدمی پیدال چلے جا رہے تھے کہ انہیں بارش نے آ لیا ، انہوں نے پہاڑ میں ایک غار کی پناہ لی ، تو ( اچانک ) ان کے گار کے منہ پر پہاڑ سے ایک چٹان آ گری اور ان کے اوپر آ کر انہیں ڈھانک دیا ، انہوں نے ایک دوسرے سے کہا : تم اپنے ان نیک اعمال پر نظر ڈالو جو تم نے ( صرف اور صرف ) اللہ کے لیے کیے ہوں اور ان کے وسیلے سے اللہ تعالیٰ سے دعا کرو ، شاید وہ اس بندش اور قید سے تمہیں آزاد کر دے ۔ اس پر ان میں سے ایک نے کہا ، اے اللہ! میرے انتہائی بوڑھے والدین ، بیوی اور چھوٹے چھوٹے بچے ہیں جن کی میں نگہداشت کرتا ہوں ۔ جب شام کو میں اپنے جانور ( چرانے کے بعد انہیں ) ان کے پاس واپس آتا ، ان کا دودھ دوہتا تو آغاز اپنے والدین سے کرتا اور اپنے بچوں سے پہلے انہیں پلاتا تھا ۔ ایک دن ( مویشیوں کے چرنے کے قابل ) درختوں کی تلاش مجھے بہت دور لے گئی ، میں رات سے پہلے گھر نہ پہنچ سکا ۔ میں نے انہیں پایا کہ وہ دونوں سو چکے ہیں ۔ میں جس طرح 0ہر روز ) دودھ نکالا کرتا تھا نکالا اور وہ ڈوبا ہوا دودھ لے کر ان کے سرہانے کھڑا ہو گیا ۔ مجھے یہ بھی ناپسند تھا کہ ان کو نیند سے جگاؤں اور یہ بھی گوارا نہ تھا کہ ان سے پہلے بچوں کو پلاؤں ، بچے بھوک کی شدت سے بلکتے ہوئے میرے قدموں میں لوٹ پوٹ ہو رہے تھے ، میں اسی حال میں ( کھڑا ) رہا اور وہ بھی اسی حالت میں رہے یہاں تک کہ صبح طلوع ہو گئی ۔ ( اے اللہ! ) اگر تو جانتا ہے کہ میں نے یہ صرف تیری رضا کے لیے کیا ہے تو اس ( غار کے بند منہ ) میں اتنا سوراخ کر دے کہ ہم آسمان کو دیکھ لیں ۔ اللہ نے اس میں ایک سوراخ کر دیا کہ وہ آسمان کو دیکھنے لگے ۔ اور دوسرا ( ساتھی ) کہنے لگا : اے اللہ! میری ایک چچا زاد تھی ، میں اس سے وہی شدید محبت کرتا تھا جو ایک مرد عورت سے کرتا ہے ۔ میں نے اس سے اپنے لیے ( خود ) اسی کو مانگا ۔ اس نے اس وقت تک ( میری بات ماننے سے ) انکار کر دیا ، یہاں تک کہ میں اسے ( سونے کے ) سو دینار لا کر دوں ۔ میں انہیں حاصل کرنے میں لگ گیا یہاں تک کہ سو دینار اکٹھے کر لیے ، پھر جب میں ان کے دونوں قدموں کے درمیان پہنچا تو وہ کہنے لگی : اللہ کے بندے! اللہ سے ڈر اور حق ( نکاح ) کے بغیر مہر ( بکارت ) نہ توڑ ۔ تو ( تیرا نام سن کر ) میں اس سے ( الگ ہو کر ) کھڑا ہو گیا ۔ اگر تو جانتا ہے کہ میں نے یہ تجھے راضی کرنے کے لیے کیا تھا تو اس میں ( اور زیادہ ) سوراخ کر دے ( اللہ نے ) ان کے لیے ( اور زیادہ ) سوراخ کر دیا ۔ اور تیسرے نے ( دعا کرتے ہوئے ) کہا : اے اللہ! میں نے ایک مزدور کو چاولوں کے ایک فرق ( تین صاع ، تقریبا ساڑھے سات کلو گرام ) کی اجرت کے عوض کام پر لگایا ۔ جب اس نے اپنا کام پورا کر لیا تو کہا : میرا حق ( اجرت ) ادا کرو ۔ میں نے اسے اس کا فرق ( تین صاع چاول ) پیش کیا ۔ وہ ( اسے کم قرار دیتے ہوئے ) اس کو چھوڑ کر چلا گیا ۔ میں مسلسل اس ( تین صاع چاولوں ) کو کاشت کرنے لگا ، یہاں تک کہ میں نے اس ( کی آمدنی ) سے گائے ( کے بہت سے ریوڑ ) اور ان کو چرانے والے ( غلام ) اکٹھے کر لیے ۔ پھر ( مدت بعد ) وہ میرے پاس ( واپس ) آیا اور کہا : اللہ سے ڈرو ، میرے حق میں مجھ پر ظلم نہ کرو ۔ میں نے کہا : ان گایوں ( کے ریوڑوں ) اور انہیں چرانے والے ( غلاموں ) کی طرف جاؤ اور انہیں لے لو ۔ اس نے کہا : اللہ سے ڈرو! میرے ساتھ مذاق تو نہ کرو ۔ میں نے کہا : میں مذاق نہیں کر رہا ، یہ سب گائیں اور ان کو چرانے والے ( غلام ) لے جاؤ ، وہ انہیں لے کر چلا گیا ۔ اگر تو جانتا ہے کہ میں نے یہ صرف تجھے راضی کرنے کے لیے کیا تھا تو جو حصہ باقی رہ گیا ہے ، اسے بھی کھول دے ۔ اللہ نے باقی حصہ بھی کھول دیا ( اور وہ آزاد ہو کر غار سے باہر نکل آئے ۔)",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 6950,
			"arabicnumber": "2743.02",
			"text": "موسیٰ بن عقبہ ، عبیداللہ ، فُضیل ، رقبہ بن مسقلہ اور صالح بن کیسان سب نے نافع سے ، انہوں نے ابن عمر رضی اللہ عنہ سے اور انہوں نے نبی صلی اللہ علیہ وسلم سے ابوضمرہ کی موسیٰ بن عقبہ سے روایت کردہ حدیث کے ہم معنی روایت کی اور انہوں نے ان کی حدیث میں ( پیدل چلے جا رہے تھے کے ساتھ ) \" اور وہ پیدل چلتے ہوئے نکلے \" کے الفاظ بڑھائے اورعبیداللہ کی روایت کو چھوڑ کر صالح کی حدیث میں \" وہ مل کر پیدل چلے \" کے الفاظ ہیں جبکہ ان ( عبیداللہ ) کی حدیث میں \" اور وہ نکلے \" کا لفظ ہے اور انہوں نے اس کے بعد ( پیدل چلتے ہوئے وغیرہ ) کا کچھ ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 6951,
			"arabicnumber": "2743.03",
			"text": "سالم بن عبداللہ ( بن عمر ) نے مجھے خبر دی کہ حضرت عبداللہ بن عمر رضی اللہ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" تم سے پہلے لوگوں میں سے تین شخص ( کسی غرض سے ) روانہ ہوئے ، حتی کہ رات گزارنے کی ضرورت انہیں ایک غار کی پناہ گاہ میں لے آئی \" پھر انہوں نے ابن عمر رضی اللہ عنہ سے نافع کی روایت کے مطابق واقعہ بیان کیا مگر کہا : \" اے اللہ! میرے انتہائی بوڑھے والدین تھے ، میں رات کے وقت ان دونوں سے پہلے نہ گھر والوں کو دودھ پلاتا تھا ، نہ مال کو ( اپنی ملکیت کے غلاموں یا مویشیوں کے ان بچوں کو جن کی اپنی مائیں نہ تھیں ) دودھ پلاتا تھا ۔ \" اور ( یہ بھی ) کہا : \" ( میری عم زاد ) مجھ سے دور رہی یہاں تک کہ ایک قحط سالی کا شکار ہو گئی ، وہ میرے پاس آئی تو میں نے اسے ( سو کے بجائے جو اس نے مانگے تھے ) ایک سو بیس دینار دیے ۔ \" اور ( تیسرے شخص کے واقعے میں ) اس نے کہا : \" میں نے اس کی اجرت کو ( کاشتکاری اور تجارت کے ذریعے ) خوب بار آور بنایا ، یہاں تک کہ ایسا کرنے سے مال مویشی بہت بڑھ گئے اور پھیل گئے ۔ \" اور آخر میں کہا : \" تو وہ چلتے ہوئے غار سے باہر آ گئے ۔",
			"grades": [],
			"reference": {
				"book": 49,
				"hadith": 15
			}
		}
	]
}