{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1161,
			"arabicnumber": "520.01",
			"text": "ابو کامل جحدری نے کہا : ہمیں عبد الواحد نے اعمش سے حدیث بیان کی ، نیز ابو بکر بن ابی شیبہ اور ابو کریب نے کہا : ہمیں ابو معاویہ نے اعمش سے حدیث سنائی ، انہوں نے حضرت ابراہیم تیمی سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : میں نے عرض کی : اے اللہ کے رسول! کون سی مسجد جو زمین میں بنائی گئی پہلی ہے؟ آپ نے فرمایا : ’’ مسجد حرام ۔ ‘ ‘ میں نے پوچھا : پھر کون سی؟ فرمایا : ’’مسجد اقصیٰ ۔ ‘ ‘ میں نے ( پھر ) پوچھا : دونوں ( کی تعمیر ) کے مابین کتنا زمانہ تھا؟ آپ نے فرمایا : ’’چالیس برس ۔ اور جہاں بھی تمہارے لیے نماز کا وقت ہو جائے ، نماز پڑھ لو ، وہی ( جگہ ) مسجد ہے ۔ ‘ ‘ ابو کامل کی حدیث میں ہے : ’’ پھر جہاں بھی تمہاری نماز کا وقت ہو جائے ، اسے پڑھ لو ، بلاشبہ وہی جگہ مسجد ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1162,
			"arabicnumber": "520.02",
			"text": "علی بن مسہر نے کہا : ہمیں اعمش نے ابراہیم بن یزید تیمی سے حدیث سنائی ، کہا : میں مسجد کے باہر کھلی جگہ ( صحن ) میں اپنے والد کو قرآن مجید سنایا کرتا تھا ، جب میں ( آیت ) سجدہ کی تلاوت کرتا تو وہ سجدہ کر لیتے ۔ میں نے ان سے پوچھا : ابا جان! کیا آپ راستے ہی میں سجدہ کر لیتے ہیں؟ انہوں نے جواب دیا : میں نے ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہوئے سنا وہ بیان کر رہے تھے کہ میں نے رسول اللہﷺ سے روئے زمین پر سب سے پہلی بنائی جانے والی مسجد کے بارے میں پوچھا تو آپ ﷺ نے فرمایا : ’’ مسجد حرام ۔ ‘ ‘ میں نے عرض کی : پھر کون سی؟ آپ نے فرمایا ، ’’ مسجد اقصیٰ ۔ ‘ ‘ میں نے پوچھا : دونوں ( کی تعمیر ) کے درمیان کتنا عرصہ تھا؟ آپ نے فرمایا : ’’ چالیس سال ، پھر ساری زمین ( ہی ) تمہارے لیے مسجد ہے ، جہاں بھی تمہاری نماز کا وقت آ جائے وہیں نماز پڑھ لو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1163,
			"arabicnumber": "521.01",
			"text": "یحییٰ بن یحییٰ نے بیان کیا کہ ہمیں ہشیم نے سیا ر سے خبر دی ، انہوں نے یزید الفقیر سے اور انہوں نے حضرت جابر بن عبد اللہ انصاری رضی اللہ عنہما سے روایت کی ، کہا : رسول اللہﷺ نے فرمایا : ’’ مجھے پانچ چیزیں عطا کی گئی ہیں جو مجھ سے پہلے کسی کو نہیں دی گئیں : ہر نبی خاص اپنی قوم ہی کی طرف بھیجا جاتا تھا اور مجھے ہر سرخ وسیاہ کی طرف بھیجا گیا ، میرے لیے اموال غنیمت حلال قرار دیے گئے ، مجھ سے پہلے وہ کسی کے لیے حلال نہیں کیے گئے ۔ میرے لیے زمین کو پاک کرنے والی اور سجدہ گاہ بنایا گیا ، لہٰذا جس شخص کے لیے نماز کا وقت ہو جائے وہ جہاں بھی ہو ، وہیں نماز پڑھ لے ، اور مہینہ بھر کی مسافت سے دشمنوں پر طاری ہو جانے والے رعب سے میری نصرت کی گئی اور مجھے شفاعت ( کا منصب ) عطا کیا گیا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1164,
			"arabicnumber": "521.02",
			"text": "۔ ابو بکر بن ابی شیبہ نے ہشیم سے اسی سابقہ سند سے روایت کی کہ رسول اللہﷺ نے فمرایا : ..... پھر اسی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1165,
			"arabicnumber": "522.01",
			"text": "حذیفہ ‌رضی ‌اللہ ‌عنہ ‌سے ‌روایت ‌ہے ‌كہ ‌رسول ‌اللہ ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌نے ‌فرمایا ‌ہم ‌لوگوں ‌كو ‌اور ‌لوگوں ‌پر ‌فضیلت ‌ملی ‌تین ‌باتوں ‌كی ‌وجہ ‌سے ‌ہماری ‌صفیں ‌فرشتوں ‌كی ‌صفوں ‌كی ‌طرح ‌كی ‌گئی ‌اور ‌ہمارے ‌لیے ‌ساری ‌زمین ‌نماز ‌كی ‌جگہ ‌ہے ‌اور ‌زمین ‌كی ‌خاك ‌ہم ‌كو ‌پاك ‌كرنے ‌والی ‌ہے ‌جب ‌پانی ‌نہ ‌ملے ‌اور ‌ایك ‌بات ‌اور ‌بیان ‌كی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1166,
			"arabicnumber": "522.02",
			"text": "۔ ابن ابی زائد نے ( ابو مالک ) سعد بن طارق ( اشجعی ) سے روایت کی ، کہا : مجھے ربعی بن حراش نے حضرت حذیفہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی ، کہا : رسول اللہﷺ نے فرمایا ......... آگے سابقہ حدیث کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1167,
			"arabicnumber": "523.01",
			"text": "عبد الرحمان بن یعقوب نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہﷺ نے فرمایا : ’’ مجھے دوسرے انبیاء پر چھ چیزوں کے ذریعے سے فضیلت دی گئی ہے : مجھے جامع کلمات عطا کیے گئے ہیں ، ( دشمنوں پر ) رعب ودبدے کے ذریعے سے میری مدد کی گئی ہے ، میرے لیے اموال غنیمت حلال کر دیے گئے ہیں ، زمین میرے لیے پاک کرنے اور مسجد قرار دی گئی ہے ، مجھے تمام مخلوق کی طرف ( رسول بنا کر ) بھیجا گیا ہے اور میرے ذریعے سے ( نبوت کو مکمل کر کے ) انبیاء ختم کر دیے گئے ہیں",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1168,
			"arabicnumber": "523.02",
			"text": "۔ یونس نے ابن شہاب سے ، انہوں نے سعید بن مسیب سے اور انہوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہﷺ نے فرمایا : ’’ مجھے جامع کلمات دے کر بھیجا گیا ہے اور رعب کے ذریعے میری نصرت کی گئی ہے ، میں نیند کے عالم میں تھا کہ زمین کے خزانوں کی کنجیاں میرے پاس لا کر میرے ہاتھوں میں رکھ دی گئیں ۔ ‘ ‘ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : رسول اللہ ﷺ تو ( اپنے رب کے پاس ) جا چکے ہیں اور تم ان ( خزانوں ) کو کھود کر نکال رہے ہو",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1169,
			"arabicnumber": "523.03",
			"text": "۔ زبیدی نے ( ابن شہاب ) زہری سے روایت کی ، انہوں نے کہا : مجھے سعید بن مسیب اور ابو سلمہ بن عبد الرحمٰن نے خبر دی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں نے رسول اللہﷺ سے سنا ، آپ فرما رہا تھے .... ( بقیہ ) یونس کی حدیث کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1170,
			"arabicnumber": "523.04",
			"text": "معمر نے زہری سے ، انہوں نے ابن مسیب اور ابو سلمہ ( بن عبد الرحمن ) سے ، انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انہوں نے نبی ﷺ سے اسی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1171,
			"arabicnumber": "523.05",
			"text": "۔ ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کردہ غلام ابو یونس سے روایت ہے ۔ انہوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی ، انہوں نے رسول اللہﷺ سے روایت کی کہ آپ نے فرمایا : ’’ دشمن پر رعب طاری کر کے میرے مدد کی گئی ، مجھے جامع کلمات سے نوازا گیا اور میں نیند کے عالم میں تھا کہ زمین کے خزانوں کی کنجیاں میرے پاس لائی گئیں اور انہیں میرے ہاتھوں میں دے دیا گیا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1172,
			"arabicnumber": "523.06",
			"text": "ہمام بن منبہ سے روایت ہے ، کہا : یہ احادیث ہیں جو حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے رسول اللہﷺ سے ہمیں بیان کی ، انہوں نے متعدد احادیث بیان کیں ، ان میں سے یہ ( بھی ) تھی کہ رسول اللہﷺ نے فرمایا : ’’رعب کے ذریعے میری مدد کی گئی ہے اور مجھے جامع کلمات عنایت کیے گئے ہیں",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1173,
			"arabicnumber": "524.01",
			"text": "۔ عبد الوارث بن سعید نے ہمیں ابو تیاح صبعی سے خبر دی ، انہوں نے کہا : ہمیں حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حدیث سنائی کہ رسول اللہﷺ مدینہ تشریف لائے تو مدینہ کے بالائی حصے میں اس قبیلے میں فروکش ہوئے جنہیں بنو عمرو بن عوف کہا جاتا تھا اور وہاں چودہ راتیں قیام فرمایا ، پھر آپ نے بنو نجار کے سرداروں کی طرف پیغام بھیجا تو وہ لوگ ( پورے اہتمام سے ) تلواریں لٹکائے ہوئے حاضر ہوئے ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : گویا میں رسول اللہﷺ کو آپ کی سواری پر دیکھ رہا ہوں ، ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ آپ کے پیچھے سوار ہیں اور بنو نجار کے لوگ آپ کے ارد گرد ہیں یہاں تک کہ آپ نے سواری کا پالان ابو ایوب ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آنگن میں ڈال دیا ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ( اس وقت تک ) رسول اللہﷺ کو جہاں بھی نماز کا وقت ہو جاتا آپ وہیں نماز ادا کر لیتے تھے ۔ آپ بکریوں کے باڑے میں بھی نماز پڑھ لیتے تھے ۔ پھر آپﷺ کو مسجد بنانے کا حکم دیا گیا ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : چنانچہ آپ نے بنو نجار کے لوگوں کی طرف پیغام بھیجا ، وہ حاضر ہو گئے ۔ آپ نے فرمایا : ’’ اے بنی نجار! مجھ سے اپنے اس باغ کی قیمت طے کرو ۔ ‘ ‘ انہوں نے جواب دیا : نہیں ، اللہ کی قسم! ہم اس کی قیمت صرف اللہ تعالیٰ سے مانگتے ہیں ۔ انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اس جگہ وہی کچھ تھا جو میں تمہیں بتا رہا ہوں ، اس میں کجھوروں کے کچھ درخت ، مشرکوں کی چند قبریں اور ویرانہ تھا ، چنانچہ رسول اللہﷺ نے حکم دیا ، کجھوریں کاٹ دی گئیں ، مشرکوں کی قبریں اکھیڑی گئیں اور ویرانے کو ہموار کر دیا گیا ، اور لوگوں نے کجھوروں ( کے تنوں ) کو ایک قطار میں قبلے کی جانب گاڑ دیا اور دروازے کے ( طور پر ) دونوں جانب پتھر لگا دیے گئے ۔ ( انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : اور لوگ ( صحابہ ) رجزیہ اشعار پڑھ رہے تھے اور رسول اللہﷺ ان کے ساتھ تھے ، وہ کہتے تھے : اے اللہ! بے شک آخرت کی بھلائی کے سوا کوئی بھلائی نہیں ، اس لیے تو انصار اور مہاجرین کی نصرت فرما ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1174,
			"arabicnumber": "524.02",
			"text": "معاذ عنبری نے کہا : ہمیں شعبہ نے حدیث سنائی ، انہوں نے کہا : مجھے ابوتیاح نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی کہ رسول اللہﷺ مسجد بنانے سے پہلے بکریوں کے باڑے میں نماز پڑھ لیا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1175,
			"arabicnumber": "524.03",
			"text": "۔ ( معاذ کے بجائے ) خالد ، یعنی ابن حارث نے روایت کی ، کہا : ہمیں شعبہ نے ابو تیاح سے حدیث سنائی ، انہوں نے کہا : میں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ فرما رہے تھے کہ رسول اللہ ﷺ .... ( آگے ) سابقہ حدیث کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1176,
			"arabicnumber": "525.01",
			"text": "ابو احوص نے ابو اسحاق سے اور انہوں نے حضرت براء بن عازب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : میں نے نبی ﷺ کے ساتھ سولہ ماہ تک بیت المقدس کی طرف ( رخ کر کے ) نماز پڑھی یہاں تک کہ سورہ بقرۃ کی آیت : ’’اور تم جہاں کہیں بھی ہو اپنے رخ کعبہ کی طرف کرو ۔ ‘ ‘ اتری ۔ یہ آیت اس وقت اتری جب نبی ﷺ نماز پڑھ چکے تھے ۔ لوگوں میں سے ایک آدمی ( یہ حکم سن ) چلا تو انصار کے کچھ لوگوں کے پاس سے گزرا ، وہ ( مسجد بنی حارثہ میں ، جس کا نام اس واقعے کے بعد مسجد قبلتین پڑ گیا ) نماز پڑھ رہے تھے ، اس نے انہیں یہ ( حکم ) بتایا تو انہوں نے ( اثنائے نماز ہی میں ) اپنے چہرے بیت اللہ کی طرف کر لیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1177,
			"arabicnumber": "525.02",
			"text": "سفیان ( ثوری ) سے روایت ہے ، کہا : مجھے ابو اسحاق نے حدیث سنائی ، کہا : میں نے حضرت براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے : ہم نے رسول اللہ ﷺ کے ساتھ سولہ یا سترہ ماہ بیت المقدس کی طرف رخ کر کے نماز پڑھی ، پھر ہمارا رخ کعبہ کی طرف پھیر دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1178,
			"arabicnumber": "526.01",
			"text": "۔ عبد العزیز بن مسلم اورمالک بن انس نے اپنی اپنی سندوں سے عبد اللہ بن دینار سے روایت کی ، انہوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انہوں نے کہا : لوگ قباء میں صبح کی نماز پڑھ رہے تھے ، اسی اثناء میں ان کے پاس آنے والا ایک شخص ( عباد بن بشر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) آیا اور اس نے کہا : بلاشبہ رات ( گزشتہ دن کے آخری حصے میں ) رسول اللہ ﷺ پر قرآن اترا ۔ اور آپ کو حکم دیا گیا کہ آپ کعبہ کی طرف رخ کریں ، لہٰذا تم لوگ بھی اس کی طرف رخ کر لو ۔ ان کے رخ شام کی طرف تھے تو ( اسی وقت ) وہ سب کعبہ کی طرف گھوم گئے ۔ 1179 ۔ موسیٰ بن عقبہ نے نافع اور عبد اللہ بن دینار سے اور انہوں نے حضرت ابن عمر رضی اللہ عنہما سے روایت کی ، انہوں نے کہا : لوگ صبح کی نماز پڑھ رہے تھے ، ان کے پاس ایک آدمی آیا .... باقی حدیث امام مالک کی ( سابقہ ) روایت کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1179,
			"arabicnumber": "526.02",
			"text": "حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ رسول اللہ ﷺ بیت المقدس کی طرف منہ کر کے نماز پڑھا کرتے تھے ، پھر یہ آیت : ’’ ہم آپ کا چہرہ آسمان کی طرف پھرتا ہوا دیکھ رہے ہیں ، ہم ضرور آپ کا رخ اس قبلے کی طرف پھیر دیں گے جسے آپ پسند کرتے ہیں ، لہٰذا آپ اپنا چہرہ مسجد حرام کی طرف پھیر لیجئے ۔ ‘ ‘ بنو سلمہ کا ایک آدمی ( عباد بن بشر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) گزرا ، ( اس وقت ) لوگ ( مسجد قباء میں ) صبح کی نماز میں رکوع کر رہے تھے اور ایک رکعت اس سے پہلے پڑھ چکے تھے ، اس نے آواز دی : سنو! قبلہ تبدیل کیا جا چکا ہے ۔ چنانچہ وہ جس حالت میں تھے اسی میں ( رکوع ہی کے عالم میں ) قبلے کی طرف پھر گئے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1180,
			"arabicnumber": "527",
			"text": "حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ رسول اللہ ﷺ بیت المقدس کی طرف منہ کر کے نماز پڑھا کرتے تھے ، پھر یہ آیت : ’’ ہم آپ کا چہرہ آسمان کی طرف پھرتا ہوا دیکھ رہے ہیں ، ہم ضرور آپ کا رخ اس قبلے کی طرف پھیر دیں گے جسے آپ پسند کرتے ہیں ، لہٰذا آپ اپنا چہرہ مسجد حرام کی طرف پھیر لیجئے ۔ ‘ ‘ بنو سلمہ کا ایک آدمی ( عباد بن بشر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) گزرا ، ( اس وقت ) لوگ ( مسجد قباء میں ) صبح کی نماز میں رکوع کر رہے تھے اور ایک رکعت اس سے پہلے پڑھ چکے تھے ، اس نے آواز دی : سنو! قبلہ تبدیل کیا جا چکا ہے ۔ چنانچہ وہ جس حالت میں تھے اسی میں ( رکوع ہی کے عالم میں ) قبلے کی طرف پھر گئے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1181,
			"arabicnumber": "528.01",
			"text": "۔ یحییٰ بن سعید قطان نے حدیث بیان کی ، کہا : ہمیں ہشام نے حدیث سنائی ، کہا : مجھے میرے والد ( عروہ ) نے حضرت عائشہ رضی اللہ عنہا سے خبر دی کہ ام حبیبہ اور ام سلمہ رضی اللہ عنہما نے رسول اللہ ﷺ کے سامنے اس گرجے کا تذکرہ ، جو انہوں نے حبشہ میں دیکھا تھا اور اس میں تصویریں آویزاں تھیں ، کہا : ’’بلاشبہ وہ لوگ ( قدیم سے ایسے ہی تھے کہ ) جب ان میں کوئی نیک آدمی فوت ہو جاتا تو وہ اس کی قبر پر مسجد بنا دیتے اور اس میں یہ تصویریں بنا دیتے ۔ یہ لوگ قیامت کے روز اللہ عزوجل کے نزدیک بدترین مخلوق ہوں گے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1182,
			"arabicnumber": "528.02",
			"text": "۔ وکیع نے کہا : ہمیں ہشام بن عروہ نے اپنے والد عروہ کے حوالے سے حضرت عائشہ رضی اللہ عنہا سے حدیث روایت کی کہ آپ کے مرض الموت میں لوگوں نے آپ کے سامنے آپس میں بات چیت کی تو ام سلمہ اور ام حبیبہ رضی اللہ عنہما نے ایک گرجے کا ذکر کیا ..... پھر اسی کے مانند بیان کیا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1183,
			"arabicnumber": "528.03",
			"text": "۔ ( یحییٰ اور وکیع کے بجائے ) ابو معاویہ نے کہا : ہمیں ہشام نے اپنے والد سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے حدیث سنائی ، انہوں نے کہا : ازواج نبی ﷺ نے ایک کنیسے کا ذکر کیا جو انہوں نے حبشہ کی سرزمین میں دیکھا تھا ، اسے ( کنیسۂ ) ماریہ کہا جاتا تھا .... ( آگے ) ان ( پہلے راویوں ) کی حدیث کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1184,
			"arabicnumber": "529",
			"text": "۔ ابوبکر ابی شیبہ او رعمرو ناقد نے کہا : ہم سے ہاشم بن قاسم نے حدیث بیان کی ، انہوں نے کہا : ہمیں شیبان نے ہلال بن ابی حمید سے حدیث سنائی ، انہوں نے عروہ بن زبیر سے ، انہوں نے حضرت عائشہ رضی اللہ عنہا سے روایت کی ، انہوں نے کہا : رسول اللہ ﷺ نے اپنی اس بیماری میں جس سے آپ اٹھ نہ سکے ( جاں بر نہ ہوئے ) فرمایا : ’’ اللہ تعالیٰ یہود اور نصاریٰ پر لعنت کرے! انہوں نے اپنے انبیاء کی قبروں کو مسجدیں بنا لیا ۔ ‘ ‘ حضرت عائشہ رضی اللہ عنہا نے ) کہا : اس لیے اگر یہ اندیشہ نہ ہوتا تو آپ کی قبر کو ظاہر رکھا جاتا لیکن یہ ڈر تھا کہ اسے مسجد بنا لیا جائے گا ۔ ( اس لیے اللہ کی مشیت سے وہ حجرہ مبارکہ میں بنائی گئی ۔ ) ابن ابی شیبہ کی روایت میں فلو لا کی جگہ ولو لا ( اور اگر ) کے الفاظ ہیں اور اس سے پہلے قالت ( انہوں نے کہا ) کا لفظ نہیں کہا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1185,
			"arabicnumber": "530.01",
			"text": "سعید بن مسیب نے حدیث بیان کی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : رسول اللہﷺ نے فرمایا : ’’ اللہ یہود کو ہلاک کرے! انہوں نے اپنے انبیاء کی قبروں کو سجدہ گاہ بنا لیا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1186,
			"arabicnumber": "530.02",
			"text": "(سعید کے بجائے ) یزید بن اصم نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت بیان کی کہ رسول اللہ ﷺ نے فرمایا : ’’ اللہ یہود ونصاریٰ پر لعنت کرے! انہوں نے اپنے انبیاء کی قبروں کو مسجدیں بنا لیا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1187,
			"arabicnumber": "531",
			"text": "۔ عبید اللہ بن عبد اللہ ( بن مسعود ) نے خبر دی کہ حضرت عائشہ اور حضرت عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ دونوں نے کہا کہ جب رسول اللہ ﷺ پر ( وفات کے لمحے ) طاری ہوئے تو آپ اپنی ایک چادر اپنےچہرے پر ڈالتے تھے اور جب جی گھبراتا تو اسے چہرے سے ہٹا لیتے تھے ، آپ اسی حالت میں تھے کہ آپ نے فرمایا : ’’ یہود ونصاریٰ پر اللہ کی لعنت ہو! انہوں نے اپنے انبیاء کی قبروں کو مساجد بنا لیا ۔ ‘ ‘ آپ ان جیسا عمل کرنے سے ڈرا رہے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1188,
			"arabicnumber": "532",
			"text": "۔ حضرت جندب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں نے نبیﷺ کو آپ کی وفات سے پانچ دن پہلے یہ کہتے ہوئے سنا : ’’ میں اللہ تعالیٰ کے حضور اس چیز سے براءت کا اظہار کرتا ہوں کہ تم میں سے کوئی میرا خلیل ہو کیونکہ اللہ تعالیٰ نے مجھے اپنا خلیل بنا لیا ہے ، جس طرح اس نے ابراہیم علیہ السلام ‌ ‌ کو اپنا خلیل بنایا تھا ، اگر میں اپنی امت میں سے کسی کو اپنا خلیل بناتا تو ابو بکر کو خلیل بناتا ، خبردار! تم سے پہلے لوگ اپنے انبیاء اور نیک لوگوں کی قبروں کو سجدہ گاہیں بنا لیا کرتے تھے ، خبردار! تم قبروں کو سجدہ گاہیں نہ بنانا ، میں تم کو اس سے روکتا ہوں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1189,
			"arabicnumber": "533.01",
			"text": "۔ ہارون بن سعید ایلی اور احمد بن عیسیٰ دونوں نے ہمیں حدیث بیان کی ۔ ( کہا : ) ہم سے ابن وہب نے حدیث بیان کی ، انہوں نے کہا : مجھے عمرو نے خبر دی کہ بکیر نے ان سے حدیث بیان کی ، انہیں عاصم بن عمر بن قتادہ نے حدیث بیان کی کہ انہوں نے عبید اللہ خولانی سے سنا ، وہ بیان کر رہے تھے کہ انہوں نے حضرت عثمان بن عفان ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو ، جب رسول اللہ ﷺ کی مسجد کی نئے سے سے تعمیر کے وقت لوگوں نے ان کے بارے میں باتیں کیں ، یہ کہتے سنا : تم نے بہت بتایں کی ہیں ، حالانکہ میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا تھا : ’’جس نے اللہ کے لیے مسجد بنائی ‘ ‘ بکیر نے کہا : میرا خیال ہے ، انہوں نے یہ کہا : ’’ اس سے وہ اللہ تعالیٰ کی رضا اور خوشنودی چاہتا ہے تو اللہ اس کے لیے جنت میں گھر بنائے گا ۔ ‘ ‘ احمد بن عیسیٰ نے اپنی روایت میں مثله في الجنة ’’جنت میں اس جیسا ( گھر ) ‘ ‘ کہا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1190,
			"arabicnumber": "533.02",
			"text": "حضرت محمود بن لبید ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ حضرت عثمان بن عفان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مسجد نبوی کو نئے سرے سے تعمیر کرنا چاہا تو لوگوں نے اسے پسند نہ کیا ، ان کی خواہش تھی کہ وہ اسے اس کی حالت پر رہنے دیں ، اس پر حضرت عثمان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ جس شخص نے اللہ کی خاطر کوئی مسجد بنائی ، اللہ اس کے لیے جنت میں اس جیسا ( گھر ) تعمیر کر ے گا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1191,
			"arabicnumber": "534.01",
			"text": "ابو معاویہ نے ہمیں اعمش سے حدیث بیان کی ، انہوں نے ابراہیم سے اور انہوں نے اسود اور علقمہ سے روایت کی ، ان دونوں نے کہا : ہم عبد اللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے گھر ان کی خدمت میں حاضر ہوئے تو وہ پوچھنے لگے : جو ( حکمران اور ان کے ساتھ تاخیر سے نماز پڑھنے والے ان کے پیروکار ) تم سے پیچھے ہیں ، انہوں نے نماز پڑھ لی ہے؟ ہم نے عرض کی : نہیں ۔ انہوں نے کہا : اٹھو اور نماز پڑھو ۔ انہوں نے ہمیں اذان اور اقامت کہنے کا حکم نہ دیا ہم ان کے پیچھے کھڑے ہونے لگے تو انہوں نے ہمارے ہاتھ پکڑ کر ایک کو اپنے دائیں اور دوسرے کو اپنے بائیں طرف کر دیا ۔ جب انہوں نے رکوع کیا تو ہم نے اپنے ہاتھ اپنے گھٹنوں پر رکھے ، انہوں نے ہمارے ہاتھوں پر ہلکا سا مارا اور اپنی دونوں ہتھیلیوں کو جوڑ کر اپنی دونوں رانوں کے درمیان رکھ لیا ۔ انہوں نے جب نماز پڑھ لی تو کہا : یقیناً آیندہ تمہارے ایسے حکمران ہوں گے جو نمازوں کو ان کے اوقات سے مؤخر کر یں گے اور ان کے اوقات کو مرنے والوں کو آخری جھلملاہٹ کی طرح تنگ کر دیں گے ۔ جب تم ان کو دیکھو کہ انہوں نے یہ ( کام شروع ) کر لیا ہے تو تم ( ہر ) نماز اس وقت کے پر پڑھ لینا اور ان کے ساتھ اپنی نماز کو نفل بنا لینا ۔ اور جب تم تین آدمی ہو تو اکٹھے کھڑے ہو کر نماز پڑھو اور جب تم تین زیادہ ہو تو تم میں سے ایک امام بن جائے اور جب تم میں سے کوئی رکوع کرے تو اپنے بازو اپنی رانوں پر پھیلا دے اور جھکے اور اپنی ہتھیلیاں جوڑ لے ، ( ایسا لگتا ہے ) جیسے میں ( اب بھی ) رسول اللہ ﷺ کی ( ایک دوسری میں ) پیوستہ انگلیوں کو دیکھ رہا ہوں ۔ اور ( انگلیاں پیوست کر کے ) انہیں دکھائیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1192,
			"arabicnumber": "534.02",
			"text": "یہ ‌روایت ‌بھی ‌ایك ‌دوسری ‌سند ‌سے ‌اسی ‌طرح ‌مروی ‌ہے ‌سوا‎ئے ‌ان ‌الفاظ ‌كے ‌وَهُوَ رَاكِعٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1193,
			"arabicnumber": "534.03",
			"text": "۔ ( اعمش ےکے بجائے ) منصور ابراھیم سے اور انھوں نے علقمہ اور اسود سے روایت کی کہ وہ دونوں حضرت عبد اللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کے ہاں حاضر ہوئے تو انھوں نے پوچھا : جو تمہارے پیچھے ہیں انھوں نے نماز پڑھ لی ؟دونوں نے کہا : جی ہاں ۔ پھر وہ دونوں کے درمیان کھڑے ہوئے ‘ ان میں سےایک کو اپنی دائیں طرف اور دوسرے کو اپنی بائیں طرف ( کھڑا ) کیا پھر ہم نےرکوع کیاتو ہم اپنے ہاتھ اپنے گٹھنوں پر رکھے ‘ انھو ں نے ہمارے ہاتھوں پر ( ہلکا سا ) مارا ‘ پھر اپنے دونوں ہاتھ جوڑ لیے اور ان کو اپنی رانوں کے درمیان رکھا ‘ جب نماز پڑھ چکے تو کہا : رسول اللہ ﷺ نے اسی طرح کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1194,
			"arabicnumber": "535.01",
			"text": "میں غالباً ابراھیم نخعی سے نیچے کسی راوی کو وہم ہوا ہے ۔ اسی لیے امام مسلم ‌رضی ‌اللہ ‌عنہ ‌ ‌ مفصل اور صحیح روایت کو پہلے لائے ہیں ۔ بعض شارحین نے اسے متعدد واقعات پر بھی محمول کیا ہے ۔ واللہ اعلم بالصواب",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1195,
			"arabicnumber": "535.02",
			"text": "ابو عوانہ نے ابو یعفور سے اور انھوں نے مصعب بن سعد سے روایت کی ‘ انھوں نے کہا : میں نےاپنے والد ( سعد بن ابی وقاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کے پہلو میں نماز پڑھی اور اپنے دونوں ہاتھ اپنے گٹھنوں کے درمیان رکھے تو مجھے میرے والد نے کہا : اپنی دونوں ہتھیلیاں اپنے گٹھنوں پر رکھو ۔ انھوں ( مصعب ) نے کہا : میں نے دوبارہ یہی کام کیا تو انہوں میرے ہاتھوں پر مارا اور کہا : ہمیں اس سے روک دیا گیا تھا اور حکم دیا گیا تھا کہ ہم ہتھیلیاں گٹھنوں پر ٹکائیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1196,
			"arabicnumber": "535.03",
			"text": "ابو احوص اورسفیان نے ابو یعفور سے مذکورہ بالاسند کے ساتھ’’ہمیں روک دیا گیا ‘ ‘ تک حدیث بیان کی ہے ‘ ان دونوں نے اس کے بعد والا جملہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1197,
			"arabicnumber": "535.04",
			"text": "وکیع نے اسماعیل بن ابی خالد سے ‘ انھوں نے زبیر بن عدی سے اور انھوں نے مصعب بن سعد سے روایت کی ‘ کہا : میں نے رکوع کیا اور اپنے ہاتھوں کو اس طرح کر لیا ‘ یعنی ان کو جوڑکر اپنی رانوں کے درمیان رکھ لیا تو میرے والد نے مجھ سے کہا : ہم اسی طرح کیا کرتے تھے ‘ پھر ہمیں گھنٹوں ( پرہاتھ رکھنے ) کا حکم دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1198,
			"arabicnumber": "536",
			"text": "حضرت طاوس بیان کرتے ہیں کہ ہم نے ابن عباس رضی اللہ عنھماسےدونوں پیروں پربیٹھنے کے بارے میں پو چھا تو انھوں نے جواب دیا : یہ سنت ہے ۔ ہم نے ان سے عرض کی : ہمارا تو خیال ہے کہ یہ انسان ( یا اگر را کی زیرکے ساتھ رجل پڑھا جائے تو پاؤں ) پرزیاتی ہے ۔ ابن عباسﷺنے کہا : ( نہیں ) بلکہ یہ تمہارے بنی ﷺکی سنت ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1199,
			"arabicnumber": "537.01",
			"text": "ہم سے ابو جعفرمحمد بن صباح اور ابو بکر بن ابی شیبہ نے حدیث بیان کی ۔ حدیث کے لفظوں میں بھی دونوں ایک دوسرے کے قریب ہیں ۔ دونوں نے کہا : ہم سے اسماعیل بن ابراہیم نے حدیث بیان کی ‘ انھوں نے حجاج صوّاف سے انھوں نے یحییٰ بن ابی کثیر سے ‘ انھوں نے ہلال بن ابی میمونہ سے ‘ انھوں نے عطاء بن یسار سے اور انھوں نے حضرت معاویہ بن ابی حکم سلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی انھوں نے کہا : میں رسول اللہ ﷺ کے ساتھ نماز پڑ ھ رہاتھا کہ لوگوں میں سے ایک آدمی کو چھینک آئی تو میں نے کہا : یرحمک اللہ’’اللہ تجھ پر رحم کرے ۔ ‘ ‘ لوگوں نے مجھے گھورنا شروع کر دیا ۔ میں نے ( دل میں ) کہا : میری ماں مجھے گم پائے ‘ تم سب کو کیا ہو گیا؟ کہ مجھے گھور رہے ہو پھروہ اپنے ہاتھ اپنی رانوں پر مارنے لگے ۔ جب میں نے انھیں دیکھا کہ وہ مجھے چپ کرا رہے ہیں ( تو مجھے عجیب لگا ) لیکن میں خاموش رہا ‘ جب رسو ل اللہ نماز سے فارغ ہوئے ‘ میرے ماں باپ آپ پرقربان !میں نے آپ سےپہلے اور آپکے بعدآپ سے بہتر کوئی معلم ( سکھانےوالا ) نہیں دیکھا!اللہ کی قسم !نہ تو آپنے مجھے ڈانٹا ‘ نہ مجھے مارا اور نہ مجھے برا بھلا کہا ۔ آپنے فرمایا : ’’یہ نماز ہے اس میں کسی قسم کی گفتگو روانہیں ہے ‘ یہ تو بس تسبیح و تکبیر اور قرآن کی تلاوت ہے ۔ ‘ ‘ یا جیسے رسو ل اللہ ﷺنے فرمایا ۔ میں نے عرض کی اے اللہ کے رسول اللہ !ابھی تھوڑا عرصہ پہلے جاہلیت میں تھا ‘ اور اللہ نے اسلام سے نوازدیا ہے ‘ ہم میں سے کچھ لوگ ہیں جو کاہنوں ( پیش گوئی کرنے والے ) کے پاس جاتے ہیں ۔ آپنے فرمایا : ’’تم ان کے پاس نہ جانا ۔ ‘ ‘ میں نے عرض کی : ہم میں سے کچھ لوگ ایسے ہیں جو بدشگونی لیتےہیں ۔ آپن فرمایا : ’’یہ ایسی بات ہے جو وہ اپنے دلوں میں پاتے ہیں ( ایک طرح کا وہم ہے ) یہ ( وہم ) انھیں ( ان کے ) کسی کام سے نہ روکے ۔ ‘ ‘ ( محمد ) ابن صباح نے روایت کی : ’’یہ تمہیں کسی صورت ( اپنے کاموں سے ) نہ رزکے ۔ ‘ ‘ میں نے عرض کی : ہم میں سے کچھ لوگ لکیریں کھینچھنے ہیں ۔ ‘ ‘ آپنے فرمایا : ’’سابقہ انبیاء میں سے ایک بنی لکیریں کھینچا کرتے تھے تو جس کی لکیریں ان کے موافق ہو جائیں وہ تو صحیح ہو سکتی ہیں ‘ ‘ ( لیکن اب اس کا جاننا مشکل ہے ۔ ) ( معاویہ بن حکم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : میری ایک لونڈی تھی جو احد اور جوانیہ کے اطراف میں میری بکریا چراتی تھی ‘ ایک دن میں اس طرف جاانکلاتو بھیڑیا اس کی بکری لے جا چکا تھا ۔ میں بھی بنی آدم میں سے ایک آدمی ہوں ‘ مجھے بھی اسی طرح افسوس ہوتا ہے جس طرح ان کو ہوتا ہے ( مجھے صبر کرناچاہیے تھا ) لیکن میں نے اسے زور سے ایک تھپڑجڑدیا اس کے بعد رسول اللہﷺکی خدمت میں حاضر ہو اآپنے میری اس حرکت کو میرے لیے بڑی ( غلط ) حرکت قرار دیا ۔ میں نے عرض کی : اے اللہ کے رسول !کیا میں اسے آزادنہ کردوں؟آپ نےفرمایا : ’’اسے میرےپاس لے آؤ ۔ ‘ ‘ میں اسے لےکر آپ کےپاس حاضر ہوا ، آپ نےاس سے پوچھا : ’’اللہ کہا ں ہے؟ ‘ ‘ اس نےکہا : آسمان میں ۔ آپ نےپوچھا : ’’میں کون ہوں؟ ‘ ‘ اس نےکہا : آپ اللہ کےرسول ہیں ۔ تو آپ نے فرمایا : ’’اسے آزاد کردو ، یہ مومنہ ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1200,
			"arabicnumber": "537.02",
			"text": "اوزاعی نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ اسی کے ہم معنی حدیث بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1201,
			"arabicnumber": "538.01",
			"text": "ابن فضیل نے ہمیں حدیث بیان کی ، کہا : ہمیں اعمش نے ابراہیم سے حدیث سنائی ، انھوں نے علقمہ سے اور انھوں نے حضرت عبدااللہ ( بن مسعود ) رضی اللہ تعالی عنہ سے روایت کی ، انھوں نے کہا : ہم رسول اللہ ﷺ کو ، جب آب نماز میں ہوتے تھے سلام کہا کرتے تھے اور آپ ہمار ے سلام کا جواب دیتے تھے جب ہم نجاشی کے ہاں سے واپس آئے ، ہم نے آپ کو ( نماز میں ) سلام کہا تو آپ نے ہمیں جواب نہ دیا ۔ ہم نے عرض کی : اے اللہ کے رسول ! ہم نماز میں آپ کو سلام کہا کرتے تھے اور آ پ ہمیں جواب دیا کرتے تھے ۔ آپ نے فرمایا : ’’ نماز میں ( اس کی اپنی ) مشغولیت ہوتی ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1202,
			"arabicnumber": "538.02",
			"text": "اعمش سے ( ابن فضیل کے بجائے ) ہریم بن سفیان نے مذکورہ بالا سند کے ساتھ اسی کے مثل حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1203,
			"arabicnumber": "539.01",
			"text": "ہشیم نے اسماعیل بن ابی خالد سے ، انھوں نے حارث بن شبیل سے ، انھوں نے ابوعمر و شیبانی سے اور انھوں نے حضرت زید بن ارقم ‌رضی ‌اللہ ‌عنہ ‌ ‌ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم نماز میں بات چیت کر لیا کرتے تھے ، ایک آدمی نماز میں اپنے ساتھی سے گفتگو کرلیتا تھا یہاں تک کہ یہ آیت اتری ، ( وقوم للہ قنتین ) ’’ اللہ کے حضور انتہائی خشوع و خضوع کے عالم میں کھٹرے ہو’’ تو ہمیں خاموش رہنے کاحاکم دیا گیا ہمیں گفتگوکرنے سے روک دیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1204,
			"arabicnumber": "539.02",
			"text": "(ہشیم کے بجائے ) عبداللہ بن نمیر ، وکیع اور عیسیٰ بن یونس نے اسماعیل بن ابی خالد سے اسی سند کے ساتھ اسی طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1205,
			"arabicnumber": "540.01",
			"text": "قتیبہ بن سیعد اور محمد بن رمح نے اپنی اپنی سند کے ساتھ لیث ( بن سعد ) سے حدیث بیان کی ، انھوں نے ابوزبیر سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہما سے روایت کی کہ انھوں نے کہا : رسول اللہ ﷺ نے مجھے کسی ضرورت ے لیے بیھجا ، پھر میں آپ کو آ کر ملا ، آپ سفر میں تھے قتیبہ نے کہا : آپ نے نماز پڑھ رہے تھے میں نے آپ کو سلام کہا ، آ پ نے مجھے اشارہ فرمایا ۔ جب آپ نماز سے فارغ ہوئے تو مجھے بلوایا اور فرمایا : ‘ ‘ ابھی تم نے سلام کہا جبکہ میں نماز پڑھ رہا تھا ۔ ’’ اور اس وقت ( ساری پر نماز پڑھتے ہوئے ) آپ کا رخ مشرق کی طرف تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1206,
			"arabicnumber": "540.02",
			"text": "زہیر نے کہا : مجھے ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے حدیث سنائی ، انھوں نے کہا : رسول اللہ ﷺ نے مجھے کا کے لیے بھیجا اور آپ بنو مصطلق کی طرف جا رہے تھے ، میں واپسی پر آپ کے پاس آیا تو آٖپ اونٹ پر نماز پڑھ رہے تھے ، میں نے آپ سے بات کی تو آپ نے مجھے ہاتھ سے اس طرح اشا رہ کیا ۔ زہیر نے اپنے ہاتھ سے اشارہ کر کے دکھایا ۔ میں نے دوبارہ بات کی تو مجھے اس طرح ( اشارے سے کچھ ) کہا ۔ زہیر نے بھی اپنے ہاتھ سے زمین کی طرف اشارہ کیا ۔ اور میں سن رہا تھا کہ آپ قراءت فرما رہے ہیں ، آپ ( رکوع و سجود کے لیے ) سر سے اشارہ فرماتے تھے ، جب آپ فارغ ہو ئے تو پوچھا ‘ ‘ جس کا م کے لیے میں بھیجا تھا تم نے ( اس کے بارے میں ) کیا کیا ؟ مجھے تم سے گفتگو کرنے سے اس کے سوا کسی چیز نے نہیں روکا کہ میں نماز پڑھ رہا تھا ۔ ’’ زہیر نے کہا : ابو زبیر کعبہ کی طرف رخ کر کے بیٹھے ہوئے تھے ، ابو زبیر نےبنو مصطلق کی طرف اشارہ کیا اور انھوں ( ابوزبیر ) نے ہاتھ سے قبلے کی دوسری سمت کی طرف اشارہ کیا ( سواری پر نماز کے دوران میں آپ کا رخ کعبہ کی طرف نہیں تھا ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1207,
			"arabicnumber": "540.03",
			"text": "حماد بن زید نے کثیر ( بن شنظیر ) سے ، انھوں نے عطاء سے اور انھوں حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم نبی ﷺ کے ہمراہ سفر میں تھے ، آپ نے مجھے کسی کام سے بھیجا ، میں واپس آبا تو اپنی سواری پر نماز پڑھ رہے تھے اور آپ کا رخ قبلے کی بجائے دوسری طرف تھا ، میں نے آپ کو سلام کہا تو آپ نے مجھے سلام کا جواب نہ دیا ، جب آپ نے سلام پھیر لیا تو فرمایا : ‘ ‘ تمھارے سلام کا جواب دینے سے مجھے صرف اس بات نے روکا کہ میں نماز پڑھ رہا تھا ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1208,
			"arabicnumber": "540.04",
			"text": "عبدالوارث بن سعید نے کہا : ہمیں کثر بن شنظیر نے حدیث سنائی ، انھوں نے عطاء سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ ﷺ نے مجھے کسی کام کی غرض سے بھیجا .........آگے حماد بن زید کی حدیث کے ہم معنی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1209,
			"arabicnumber": "541.01",
			"text": "اسحاق بن ابراہیم اور اسحاق بن منصور نے کہا : ہمیں نضر بن شمیل نے خبر دی ، انھوں نے کہا : ہمیں شعبہ نے خبر دی ، انھوں نے کہا : ہمیں شعبہ نے خبر دی ، انھوں نے کہا : ہمیں محمد نے ، جو ابن زیاد ہے ، حدیث سنائی ، انھوں نے کہا ، میں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ ﷺ نے فرمایا : ‘ ‘ گزشتہ رات ایک سرکش جن مجھ پر حملے کرنے لگا تا کہ میری نماز توڑ دے ۔ اللہ تعالیٰ نے اسے میرے قابو میں کر دیا تو میں نے زور سے اس کا گلا گھونٹا اور یہ ارادہ کیا کہ اسے مسجد کے ستونوں میں سے کسی ستون کے ساتھ باندھ دوں تاکہ صبح کو تم سب دیکھ سکو ، پھر مجھے اپنے بھائی سلیمان علیہ السلام کا یہ قول یاد آگیا : ‘ ‘ اے میرے رب! مجھے بخش دے اور مجھے ایسی حکومت دے جو میرے بعد کسی کے لائق نہ ہو ’’ ( تو میں نے اسے چھوڑ دیا ) اور اللہ نے اس ( جن ) کو رسوا کر کے لوٹا دیا ۔ ’’ ابن منصور نے کہا : شعبہ نے محمد بن زیاد سے روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1210,
			"arabicnumber": "541.02",
			"text": "محمد بن بشار نے کہا : ہمیں محمد بن جعفر نے حدیث سنائی ۔ اور ابو بکر بن ابی شیبہ نے کہا : ہمیں شبابہ نے حدیث سنائی ، ان دونوں ( ابن جعفر اور شبابہ ) نے شعبہ سے اسی سند کے ساتھ حدیث روایت کی ۔ ابن جعفر کی روایت میں ‘ ‘ میں نے اس کا گلا گھونٹا ’’ کے الفاظ نہیں جبکہ ابن ابی شبیہ نے اپنی روایت میں کہا : ‘ ‘ میں نے اسے پیچھے دھکا دیا ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1211,
			"arabicnumber": "542",
			"text": "حضرت ابو درداء رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : رسول اللہ ﷺ قیام ( کی حالت ) میں تھے کہ ہم نے آپ کو یہ کہتے ہوئے سنا : ‘ ‘ میں تجھ سے اللہ کی پنا میں آتا ہوں ۔ ’’ پھر آپ نے فرمایا : ‘ ‘ میں تجھ پر اللہ کی لعنت بھیجتا ہوں ۔ ’’ آپ نے یہ تین بار کہا اور آپ نے اپنا ہاتھ بڑھایا ، گویا کہ آپ کسی چیز کو پکڑ رہے ہیں ، جب آپ نماز سے فارغ ہوئے تو ہم نے پوچھا : اے اللہ کے رسول ! ہم نے آب کو نماز میں کچھ کہتے سنا ہے جو اس سے پہلے آب کو کبھی کہتے نہیں سنا اور ہم نے آپ کو دیکھا کہ آپ نے اپنا ہاتھ ( آگے ) بڑھایا ۔ آب نے فرمایا ‘ ‘ اللہ دشمن ابلیس آگ کا ایک شعلہ لے کر آیا تھا تا کہ اسے میرے چہرے پر ڈال دے ، میں نے تین دفعہ اعوذ باللہ منک ‘ ‘ میں تجھ سے اللہ کی پنا ہ مانگتا ہوں’’ کہا ، پھر میں نے تین بار کہا : میں تجھ پر اللہ کی کامل لعنت بھیجتا ہوں ۔ وہ پھر بھی پیچھے نہ ہٹا تو میں نے اسے پکڑ نے کا ارادہ کر لیا ۔ اللہ کی قسم ! اگر ہمارے بھائی سلیمان علیہ السلام کی دعا نہ ہوتی تو وہ صبح تک بندھا رہتا اور مدینہ والوں کے بچے اس کے ساتھ کھیلتے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1212,
			"arabicnumber": "543.01",
			"text": "عبداللہ بن مسلمہ بن مسلمہ بن قعنب اور قتیبہ بن سعید نے کہا : ہمیں امام مالک نے حدیث سنائی ۔ دوسری سند میں یحیٰی بن یحییٰ نے کہا : میں نے امام مالک سے کہا : کہا آپ کو عامر بن عبداللہ بن زبیر نے عمر و بن سلیم زرقی سے اور انھوں نے حضرت ابو قتادہ رضی اللہ تعالیٰ عنہ سے روایت کرتے ہوئے یہ حدیث سنائی تھی کہ رسول اللہ ﷺ اپنی صاحبزادی زینب اور ابو العاص بن ربیع رضی اللہ تعالی عنہما کی بیٹی امامہ رضی اللہ تعالیٰ عنہا کو اٹھا کر نماز پڑھ لیتے تھے ، جب آپ کھڑے ہوتے تو اسے اٹھا لیتے اور جب سجدہ کرتے تو اسے ( زمین پر ) بٹھا دیتے تھے ؟ یحیٰی نے کہا : امام مالک نے جواب دیا : ہاں ( یہ روایت مجھے سنائی تھی ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1213,
			"arabicnumber": "543.02",
			"text": "عثمان بن ابی سلیمان اور ابن عجلان دونوں نے عامر بن عبداللہ بن زبیر کو عمرو سلیم زرقی سے حدیث بیان کرتے ہوئے سنا ، انھوں نے حضرت ابو قتادہ انصاری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا میں نے نبی اکرم ﷺ کو دیکھا ۔ آپ لوگوں کی امات کر رہے تھے ، اور ابو العاص رضی اللہ تعالیٰ عنہ کی بیٹی امامہ رضی اللہ تعالیٰ عنہا جو نبی اکرم ﷺ کی صاحبزادی زینب رضی اللہ عنہا کی بیٹی تھیں ، آپ کے کندے پر تھیں ، جب آپ رکوع میں جاتے تو انھیں کندھے سے اتار دیتے اور جب سجدے سے اٹھتے تو پھر سے انھیں اٹھا لیتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1214,
			"arabicnumber": "543.03",
			"text": "بکیر ( بن عبداللہ ) نے عمرو بن سلیم زرقی سے روایت کی ، انھوں نے کہا : میں نے حضرت ابو قتادہ انصاری رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : میں نے رسول اللہ ﷺ کو دیکھا ، آپ لوگوں کو نماز پڑھا رہے تھے اور ابو العاص رضی اللہ تعالیٰ عنہ کی بیٹی امامہ رضی اللہ تعالیٰ عنہا آپ کی گردن پر تھیں ، جب آپ سجدہ کرتے تو انھیں اتار دیتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1215,
			"arabicnumber": "543.04",
			"text": "سعید مقبری نے عمر و بن سلیم زرقی سے روایت کی ، انھوں نے حضرت ابو قتادہ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا : ہم مسجد میں بیٹھے ہوئے تھے کہ اسی اثنا میں رسول اللہ ﷺ ( گھر سے ) نکل کر ہمارے پاس تشریف لائے ...... ( آگے ) مذکورہ بالا روایوں کی حدیث کے مانند حدیث بیان کی ، مگر انھوں ( سعید مقبری ) نے یہ بیان نہیں کیا کہ اس نما میں آپ لوگوں کی امامت فرمائی تھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1216,
			"arabicnumber": "544.01",
			"text": "عبدالعزیز بن ابی حازم نے اپنے والد سے خبر دی کہ کچھ لوگ حضرت سہل بن سعد رضی اللہ تعالیٰ عنہ کی خدمت میں حاضر ہوئے اور انھوں نے منبر نبوی کے بارے میں میں بخث کی تھی کہ وہ کس لکڑی سے بنا ہے ؟ انھوں ( سہل رضی اللہ تعالیٰ عنہ ) نے کہا : ہاں! اللہ کی قسم ! میں اچھی طرح جانتا ہوں کہ وہ کس لکڑی ہے اور اسے کس نے بنایا تھا ۔ رسول اللہ ﷺ جب پہلے دن اس پر بیٹھے تھے ، میں نے آپ کو دیکھا تھا ۔ میں ( ابو حازم ) نے کہا : ابو عباس ! پھر تو ( آپ ) ہمیں ( اس کی ) تفصیل بتائیے ۔ انھوں نے کہا : رسول اللہ ﷺ نے ایک عورت کی طرف پیغام بھیجا ۔ ابو حازم نے کہا : وہ اس دن اس کا نام بھی بتارے تھے اور کہا ۔ ‘ ‘ اپنے بڑھئی غلام کو دیکھو ( اور کہو ) وہ میرے لیے لکڑیا ں ( جوڑکر منبر ) بنا دے تا کہ میں اس پر سے لوگوں سے گفتگو کیا کروں ۔ تو اس نے یہ تین سٹرھیاں بنائیں ، پھر رسول للہ ﷺنے اس کے بارے میں حکم دیا اور اسے اس جگہ رکھ دیا گیا اور یہ مدینہ کے جنگل کے درخت جھاؤ ( کی لکڑی ) سے بنا تھا ۔ میں نے رسول اللہ ﷺ کو دیکھا ، آپ اس پر کھڑے ہوئے اور تکبیر کہی ، لوگوں نے بھی آپ کے پیچھے تکبیر کہی جبکہ آپ منبر ہی پر تھے ، پھر آپ ( نے رکوع سے سر اٹھایا ) اٹھے اور الٹے پاؤں نیچے اترے اور منبر کی جڑ میں ( جہاں وہ رکھا ہوا تھا ) سجدہ کیا ، پھر دوبارہ وہی کیا ( منبر پر کھڑے ہو گئے ) حتی کہ نماز پوری کر کے فارغ ہوئے ، پھر لوگوں کی طرف متوجہ ہوئے اور فرمایا : ‘ ‘ لوگو! میں نے یہ کام اس لیے کیا ہےتاکہ تم ( مجھے دیکھتے ہوئے ) میری پیروی کرو اور میری نماز سیکھ لو ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1217,
			"arabicnumber": "544.02",
			"text": "یعقوب بن عبدالرحمن بن محمد بن عبداللہ بن عبد ، قار ی قرشی نے کہا : مجھے ابو حازم نے حدیث سنائی کہ کچھ لوگ حضرت سہل بن سعد ساعدی رضی اللہ تعالیٰ عنہ کے پاس آئے ، نیز سفیان بن عیینہ نے ابو حازم سے حدیث سنائی کہ لوگ سہل بن سعد رضی اللہ تعالیٰ عنہ کے پاس آئے اور ان سے پوچھا : نبی اکرم ﷺ کا منبر کس ( لکڑی ) سے ( بنا ہوا ) ہے ....... ( آگے ) ابن ابی حازم کی روایت کی حدیث کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1218,
			"arabicnumber": "545",
			"text": "حکم بن موسیٰ قنطری نے کہا : ہمیں عبداللہ بن مبارک نے حدیث سنائی ، نیز ابو بکر ابن ابی شیبہ نے کہا : ہمیں ابو خالد اور ابو اسامہ نے حدیث سنائی ، ان سب نے ہشام سے ، انھوں نے محمد ( بن سیرین ) سے ، انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی ﷺ سے روایت کی کہ آپ نے س بات سے منع فرمایا کہ کوئی آدمی پہلو پر ہاتھ رکھے ہوئے نماز پڑھے ۔ امام مسلم کے استاد ابو بکر کی روایت میں ( نبی ﷺ کے بجائے ) ‘ ‘ رسول اللہ ﷺ نے منع فرمایا ’’ کے الفاظ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1219,
			"arabicnumber": "546.01",
			"text": "ہمیں وکیع نے حدیث سنائی ، کہا : ہمیں ہشام دستوائی نے حدیث سنائی ، انھوں نے یحییٰ بن ابی کثیر سے ، انھوں نے ابو سلمہ سے اور انھوں نے حضرت معیقیب رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم ﷺ نے مسجد میں ہاتھ سے کنکریاں صاف کرنے کا تذکروہ کیا اور فرمایا : ‘ ‘ اگر تمھارے لیے اسے کیے بغیر چارہ نہ ہو تو ایک بار ( کر لو ۔ ) ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1223,
			"arabicnumber": "547.01",
			"text": "امام مالک نے نافع سے اور انھوں حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ ﷺ نے ( مسجد کی ) قبلے والی دیوار ( کی سمت ) میں بلغم ملا تھوک لگا ہو ا دیکھا تو اسے کھرچ دیا ، پھر لوگوں کی طرف متوجہ ہو کر فرمایا : ‘ ‘ جب تم میں سے کوئی نماز میں ہو تو اپنے سامنے نہ تھوکے کیونکہ جب وہ وہ نماز پڑھتا ہے تو اللہ اس کے سامنے ہوتا ہے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1224,
			"arabicnumber": "547.02",
			"text": "عبید اللہ ، لیث بن سعد ، ایوب ، ضحاک بن عثمان اور موسیٰ بن عقبہ سب نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم ﷺ سے روایت کی کہ آپ ﷺ نے مسجد کے قبلے ( کی سمت ) میں بلغم دیکھا ۔ سوائے ضحاک کے کہ ان کی روایت میں ( مسجد کے قبلے کے بجائے ) ‘ ‘ قبلے ( کی سمت ) میں ’’ کے الفاظ ہیں ..... ( آگے ) امام مالک کی حدیث کے ہم معنی روایت ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1225,
			"arabicnumber": "548.01",
			"text": "سفیان بن عیینہ نے زہری سے ، انھوں نے حمید بن عبدالرحمن سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی ﷺ نے مسجد کے قبلے ( کی سمت ) میں بلغم دیکھا تو آپ نے اسے ایک کنکر کے ذریعے سے کھر چ ڈالا ، پھر آپ نے اس بات سے منع فرمایا کہ کوئی شخص اپنے دائیں یا سامنے تھوکے ، البتہ وہ ( اگر کچی زمین یا ریت پر نماز پڑ ھ رہا ہے تو ) اپنی بائیں جانب یا بائیں پاؤں کے نیچے تھوک سکتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1226,
			"arabicnumber": "548.02",
			"text": "(سفیان کے بجائے ) یونس اور ابراہیم نے ابن شہاب سے ، انھوں نے حمید بن عبدالرحمن سے روایت کی کہ حضرت ابو ہریرہ اور ابو سعید رضی اللہ تعالیٰ عنہما دونوں نے انھیں خبر دی کہ رسول اللہ ﷺ نے بلغم ملا تھوک دیکھا ........ ( ٖآگے ) ابن عینہ کی حدیث کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1227,
			"arabicnumber": "549",
			"text": "حضرت عائشہ رضی اللہ تعالی عنہا سے روایت ہے کہ نبی اکرم ﷺ نے قبلے کی دیوار پر تھوک یا رینٹ یا بلغم دیکھا تو کھرچ ڈالا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1228,
			"arabicnumber": "550.01",
			"text": "ابن علیہ نے ہمیں حدیث بیان کی ، انھوں قاسم بن مہران سے ، انھوں نے ابو رافع سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے مسجد کے قبلے ( کی سمت ) میں بلغم دیکھا تو لوگوں کی طرف متوجہ ہوئے اور فرمایا : ’’ تم میں سے کسی ایک کو کیا ( ہو جاتا ) ہے ، وہ اپنے رب کی طرف منہ کر کے کھڑا ہوتا ہے ، پھر اپنے سامنے بلغم پھینک دیتا ہے ؟ کیا تم میں سے کسی کو یہ پسند ہے کہ اس کی طرف رخ کیا جائے ، اس کے منہ کے سامنے تھوک دیا جائے ؟ چنانچہ جب تم میں سے کوئی شخص کھنگار پھینکنا چاہے تو وہ اپنی جائیں جانب قدم کے نیچے پھینکے ، اگر اس کی گنجائش نہ پائے تو ایسے کر لے ۔ ‘ ‘ قاسم نے اس ک وضاحت میں اپنے کپڑے میں تھوکا ، پھر اس کے ایک حصے کو دوسرے پر رگڑ دیا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1229,
			"arabicnumber": "550.02",
			"text": "(ابن علیہ کے بجائے ) عبدالوارث ، ہشیم اورشعبہ نے قاسم بن مہران سے حدیث بیان کی ۔ انھوں نے ابو رافع سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انھوں نے نبی ﷺ سے ابن علیہ کی حدیث کی طرح ( روایت بیان کی ۔ ) ہشیم کی حدیث میں یہ اضافہ کیا : ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : جیسے میں دیکھ رہا ہوں کہ رسول اللہ ﷺ کپڑے کا ایک حصہ دوسرے پر لوٹا ( رگڑ ) رہے ہیں ۔ ( اس طرح مسجد میں گندگی نہیں پھیلتی اور کپڑے کو باہر لے جا کر دھویا جاسکتا ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1230,
			"arabicnumber": "551",
			"text": "حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، کہا : رسول اللہ ﷺ نے فرمایا : ’’جب تم میں سے کوئی نماز میں ہوتا ہے تو وہ اپنے رب سے راز و نیاز کرتا ہے ، اس لیے وہ نہ اپنے سامنے تھوکے نہ ہی دائیں طرف ، البتہ بائیں طرف پاؤں کے نیچے ( تھوک لے ۔ ) ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1231,
			"arabicnumber": "552.01",
			"text": "ابو عوانہ نے قتادہ سے اور انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’مسجد میں تھوکنا ایک گنا ہ ہے اور اس کا کفارہ یہ ہے کہ ( اگر فرش کچا ہےتو ) اسے دفن کر دیا جائے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1232,
			"arabicnumber": "552.02",
			"text": "(ابو عوانہ کے بجائے ) شعبہ نے کہا : میں نے قتادہ سے مسجد میں تھوکنے کے بارے میں پوچھا تو انھوں نے کہا : میں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے کہ میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ مسجد میں تھوکنا ایک گنا ہ ہے اور اس کا کفارہ اسے دفن کرنا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1233,
			"arabicnumber": "553",
			"text": "حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے نبی اکرم ﷺ سے روایت کی ، آپ نے فرمایا : ’’ میرے سامنے میری امت کے اچھے اور برے اعمال پیش کیے گئے ، میں نے اس کے اچھے اعمال میں راستے سے تکلیف دہ چیز ہٹانے کو دیکھا ، اس کے برے اعمال میں بلغم کو پا یا جو مسجد میں ہوتا ہے اور اسے دفن نہیں کیا جاتا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1234,
			"arabicnumber": "554.01",
			"text": "کہمس نے یزید بن عبداللہ بن شخیر سے ، انھوں نے اپنے والد سےروایت کی ، انھوں نےکہا : میں نے رسول اللہ ﷺ کے ساتھ ( آپ کی اقتدا میں ) نماز ادا کی ، میں نے آپ کو دیکھا کہ آپ نے ( گلے سے ) بلغم نکالا اور ( چونکہ پاؤں کے نیچے ریت تھی اس لیے ) اسے اپنے جوتے سے مسل دیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1235,
			"arabicnumber": "554.02",
			"text": "جریری نے ابو علاء یزید بن عبداللہ بن شخیر سے اور انھوں نے اپنے والد سے روایت کی کہ انھوں نے رسول اللہ ﷺ کی معیت میں نماز پڑھی ۔ کہا : آپ نے گلے سے بلغم نکالا اور اسے اپنے بائیں جوتے سے مسل ڈالا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1236,
			"arabicnumber": "555.01",
			"text": "بشر بن مفضل نے ہمیں ابو مسلمہ سعید بن یزید سے خبر دی ، انھوں نے کہا : میں نے انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا : کیا رسول اللہ ﷺ جوتے پہن کر نماز پڑھتے تھے ؟ انھوں نے جواب دیا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1237,
			"arabicnumber": "555.02",
			"text": "(بشر کے بجائے ) عباد بن عوام نے کہا : ہمیں ابو مسلمہ سعید بن یزید نے حدیث سنائی ، انھوں نے کہا : میں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سوال کیا ..... ( آگے ) پہلی روایت کی طرح ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1238,
			"arabicnumber": "556.01",
			"text": "سفیان بن عیینہ نے ہمیں حدیث بیان کی ، انھوں نے زہری سے ، انھوں نعروہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی اکرم ﷺ نے بیل بوٹوں والی ایک منقش چادر میں نماز پڑھی اور فرمایا : ’’ اس کے بیل بوٹوں نے مجھے مشغول کر دیا تھا ، اسے ابو جہم کے پاس لے جاؤ اور ( اس کے بدلے ) مجھے انبجانی چادر لا دو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1239,
			"arabicnumber": "556.02",
			"text": "یونس نے ابن شہاب ( زہری ) سے خبر دی ، انھوں نے کہا : مجھے عروہ بن زبیر نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے خبر دی ، انھوں نے کہا : رسول اللہ ﷺ ایک بیل بوٹوں والی منقش چادر پر نماز پڑھنے کے لیے کھڑے ہوئے تو اس کے نقش و نگار پر آپ کی نظر پڑی ، جب آپ اپنی نماز سے فارغ ہوئے تو فرمایا : ’’یہ منقش چادر ابو جہم بن حذیفہ کے پاس لے جاؤ اور مجھے اس کی ( سادہ ) انبجانی چادر لادو کیونکہ اس نے ابھی میر نماز سے میری توجہ ہٹا دی تھی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1240,
			"arabicnumber": "556.03",
			"text": "(ابن شہاب زہری کے بجائے ) ہشام نے اپنے والد عروہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالی عنہا سے روایت کی کہ نبی اکرم ﷺ کے پاس ایک منقش چادر تھی جس پر بیل بوٹے بنے ہوئے تھے ، نماز میں آپ کا خیال اس کی طرف چلا جاتا تھا ، آپ نے وہ ابو جہم کو دے دی اور اس کی ( بیل بوٹوں کے بغیر سادہ ) انبجانی چادر اس سے لے لی ۔ ( یہ چادر آذر بیجان کے ایک شہر انبجان کی طرف منسوب تھی ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1241,
			"arabicnumber": "557.01",
			"text": "سفیان بن عیینہ نے زہری سے ، انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی اکرم ﷺ سے روایت کی ، آپ نے فرمایا : ’’ جب رات کا کھا نا آ جائے اور نماز کے لیے تکبیر ( بھی ) کہہ دی جائے تو پہلے کھانا کھا لو",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1242,
			"arabicnumber": "557.02",
			"text": "عمرو ( بن حارث ) نے ابن شہاب ( زہری ) سے خبر دی ، انھوں نے کہا : مجھے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حدیث بیان کی کہ رسول اللہ ﷺ نے فرمایا : ’’جب رات کا کھانا پیش کر دیا جائے اور نماز کا ( بھی ) وقت ہو جائے تو مغرب کی نماز پڑھنے سے پہلے کھانے کی ابتدا کرو اور ( نماز کے لیے ) اپنا رات کا کھانا چھوڑ نے میں عجلت نہ کرو ۔ ‘ ‘ ( اس زمانے میں رات کا کھانا مغرب کے قریب ہی کھا یا جاتا تھا ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1243,
			"arabicnumber": "558",
			"text": "ابن نمیر ، حفص اور وکیع نے ہشام سے ، انھوں نے اپنے والد سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کے واسطے سے نبی ﷺ سے اسی طرح روایت کی جس طرح ابن عیینہ نے زہر ی سے اور انھوں نےحضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1244,
			"arabicnumber": "559.01",
			"text": "سیدنا عبداللہ بن عمر ؓ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا : ” جب تم میں سے کسی کے سامنے شام کا کھانا رکھا جائے ادھر نماز کھڑی ہو تو پہلے کھانا کھا لے اور نماز کے لئے جلدی نہ کرے جب تک کھانے سے فارغ نہ ہو ۔ “",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1245,
			"arabicnumber": "559.02",
			"text": "موسیٰ بن عقبہ ، ابن جریج اور ایوب سب نے نافع سے ، انھوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے مذکورہ بالا روایت کی طرح روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1246,
			"arabicnumber": "560.01",
			"text": "حاتم بن اسماعیل نے ( ابو حزرہ ) یعقوب بن مجاہد سے ، انھوں ابن ابی عتیق ( عبداللہ بن محمد بن عبدالرحمان بن ابی بکر صدیق ) سے روایت کی ، کہا : میں نے اور قاسم ( بن محمد بن ابی بکر صدیق ) نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس ( بیٹھے ہوئے ) گفتگو کی ۔ قاسم زبان کی شدید غلطیاں کرنے والے انسان تھے ، وہ ایک کنیز کے بیٹے تھے ، حضرت عائشہ رضی اللہ تعالی عنہا نے اس سے کہا : کیا بات ہے تم میرے اس بھتیجے کی طرح کیوں گفتگو نہیں کرتے ؟ ہا ں ، میں جانتی ہوں ( تم میں ) یہ بات کہاں سے آئی ہے ، اس کو اس کی ماں نے ادب ( گفتگو کا طریقہ ) سکھایا اورتمھیں تمھاری ماں نے سکھایا ۔ اس پر قاسم ناراض ہو گئے اور ان کے خلاف دل میں غصہ کیا ، پھر جب انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا کا دسترخوان آتے دیکھا تو اٹھ کھڑے ہوئے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے پوچھا : کہاں جاتے ہو؟ انھوں نے کہا : میں نماز پڑھنے لگا ہوں ۔ عائشہ رضی اللہ تعالیٰ عنہا نے کہا : بیٹھ جاؤ ۔ انھوں نے کہا : میں نے نماز پڑھنی ہے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : بیٹھ جاؤ ، دھوکےباز! میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’کھانا سامنے آجائے تو نماز نہیں ۔ اور نہ وہ ( شخص نماز پڑھے ) جس پر پیشاب پاخانہ کی ضرورت غالب آرہی ہو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1247,
			"arabicnumber": "560.02",
			"text": "اسماعیل بن جعفر نے کہا : مجھے ابو حزرہ القاص ( یققوب بن مجاہد ) نے عبداللہ بن ابی عتیق سے خبر دی ، انھوں نے حضرت عائشہ رضی اللہ تعالی عنہا سے اور انھوں نے نبی ﷺ سے اسی کے مانند روایت کی اور حدیث میں قاسم کا واقعہ بیان نہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1248,
			"arabicnumber": "561.01",
			"text": "محمد بن مثنیٰ اور زہیر بن حرب دونوں نے کہا : یحییٰ قطان نے ہمیں عبیداللہ سے حدیث بیان کی ، انھوں نے کہا : مجھے نافع نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی کہ رسول اللہ ﷺ نے غزوؤ خیبر کے موقع پر فرمایا : ’’جس نے اس پودے ۔ آپ کی مراد لہسن تھا ۔ میں سے کچھ کھایا ہو وہ مسجدوں میں ہرگز نہ آئے ۔ ‘ ‘ زہیر نے صرف غزوہ کہا ، خیبر کا نام نہیں لیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1249,
			"arabicnumber": "561.02",
			"text": "عبداللہ بن نمیر نے کہا : ہم سے عبید اللہ نے حدیث بیان کی ، انھوں نے نافع سے اور انھوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسو ل اللہ ﷺ نے فرمایا : ’’جس نے اس ترکاری میں سے کچھ کھایا ہو وہ ہماری مسجدوں کے قریب نہ آئے یہاں تک کہ اس کی بوچلی جائے ۔ ‘ ‘ آپ کی مراد لہسن سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1250,
			"arabicnumber": "562",
			"text": "عبدالعزیز سے ، جو صہیب کے بیٹے ہیں ، روایت ہے کہ حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے لہسن کے بارے میں پوچھا گیا تو انھوں نے جواب دیا : رسول اللہ ﷺ نے فرمایا : ’’جس نے اس پودے میں سے کچھ کھایا ہو وہ ہرگز ہمارے قریب نہ آئے اور نہ ہمارے ساتھ نماز پڑھے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1252,
			"arabicnumber": "563",
			"text": "ابو زبیر نے حضرت جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے پیاز اور گندنا کھا نے سے منع فرمایا ۔ سو ( ایک مرتبہ ) ہم ضرورت سے مجبور ہو گئے اور انھیں کھا لیا تو آپ نے فرمایا : ’’جس نے اس بدبودار سبزی میں سے کچھ کھایا ہو وہ ہرگز ہماری مسجد کے قریب نہ آئے ، فرشتے بھی یقیناً اس چیز سے تکلیف محسوس کرتے ہیں جس سے انسان تکلیف محسوس کرتے ہیں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1253,
			"arabicnumber": "564.01",
			"text": "ابو طاہر اور حرملہ نے کہا : ہمیں ابن وہب نے خبر دی ، کہا : مجھے یونس نے ابن شہاب سے خبر دی ، انھوں نے کہا : مجھے عطاء بن ابی رباح نے حدیث بیان کی کہ حضرت جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا ۔ حرملہ کی روایت میں ہے ، ان ( جابر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کو یقین تھا ۔ کہ رسول اللہ ﷺ نے فرمایا : ’’جس نے لہسن یا پیاز کھایا وہ ہم سے دور رہے یا ہماری مسجدوں سے دور رہے اور اپنے گھر بیٹھے ۔ ‘ ‘ اور ایسا ہو ا کہ ( ایک دفعہ ) آپ کے پاس ایک ہانڈی لائی گئی جس میں کچھ سبز ترکاریاں تھیں ، آپ نے ان سے کچھ بو محسوس کی تو ان کے متعلق پوچھا ۔ آپ کو ان ترکاریوں کے بارے میں بتایا گیا جو اس میں ( ڈالی گئی ) تھیں تو آپ نے اسے ، اپنے ساتھیوں میں سے ایک کے پاس لے جانے کو کہا ۔ جب اس نے بھی اسے دیکھ کر ( آپ کی ناپسندیدگی کی بنا پر ) اس کو ناپسند کیا تو آپ نے فرمایا : ’’تم کھا لو کیونکہ میں ان سے سرگوشی کرتا ہوں جن سے تم سرگوشی نہیں کرتےہو ۔ ‘ ‘ ( اس سے فرشتے مراد ہیں ۔ صحیح ابن خزیمہ اور صحیح ابن حبان کی روایت میں اس بات کی صراحت موجود ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1254,
			"arabicnumber": "564.02",
			"text": "یحییٰ بن سعید نے ابن جریج سے حدیث بیان کی ، انھوں کہا : مجھے عطاء نے حضرت جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی کہ نبی اکرم ﷺ نے فرمایا : ’’ جس نے یہ ترکاری لہسن کھا یا ۔ ‘ ‘ اور ایک دفعہ فرمایا : ’’ جس نے پیاز ، لہسن اور گندنا کھایا ۔ تو وہ ہر گز ہماری مسجد کے قریب نہ آئے کیونکہ فرشتے ( بھی ) ان چیزوں سے اذیت محسوس کرتے ہیں جس جن سے آدم کے بیٹے اذیت محسوس کرتےہیں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1255,
			"arabicnumber": "564.04",
			"text": "محمد بن بکر اور عبدالرزاق نے ( دو مختلف سندوں سے روایت کرتے ہوئے ) کہا : ہمیں ابن جریج نے اسی ( سابقہ ) سند کے ساتھ خبر دی کہ رسول اللہ ﷺ نے فرمایا : ’’جس نے اس پودے ۔ آپ کی مراد لہسن سے تھی ۔ میں سے کچھ کھایا ہو وہ ہماری مسجد میں ہمارے پاس نہ آئے ۔ ‘ ‘ اور انھوں ( ابن جریج ) نے پیاز اور گندنے کا ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1256,
			"arabicnumber": "565",
			"text": "حضرت ابو سعید ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھون نے کہا : ہم خیبر کی فتح سے فارغ نہیں ہوئے تھے کہ ہم ، رسول اللہ ﷺ کے ساتھی ، اس ترکاری ۔ لہسن ۔ پر جا پڑے ، لوگ بھوکے تھے اورہم نے اسے خوب اچھی طرح کھایا ، پھر ہم مسجد کی طرف گئے تو رسول اللہ ﷺ نے بومحسوس کی ۔ آپ نے فرمایا : ’’جس نے اس بدبودار پودے میں سے کچھ کھایا ہے وہ مسجد میں ہمارے قر یب نہ آئے ۔ ‘ ‘ اس پر لوگ کہنے لگے : ( لہسن ) حرام ہو گیا ، حرام ہو گیا ۔ یہ بات نبی ﷺ تک پہنچی تو آپ نے فرمایا : ’’ اے لوگو! ایسی چیز کو حرام کرنا میرے ہاتھ میں نہیں جسے اللہ نے میرے لیے حلال کر دیا ہے لیکن یہ ایسا پودا ہے جس کی بو مجھے ناپسند ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1257,
			"arabicnumber": "566",
			"text": "حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ رسول اللہ ﷺ اور آپ کے صحابہ ( ایک دفعہ ) پیاز کے ایک کھیت کے پاس سے گزرے ۔ ان میں سے کچھ لوگ اترے اور اس میں سے کچھ کھا لیا ، اور دوسروں نے نہ کھایا ۔ ہم آپ کے پاس گئے تو آپ نے ان لوگوں کو ( قریب ) بلا لیا جنھوں نے پیاز نہیں کھا یا تھا اور دوسرے ( جنھوں نے پیاز کھایا تھا ) انھیں پیچھے کر دیا یہاں تک کہ اس کی بو ختم ہو گئی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1258,
			"arabicnumber": "567.01",
			"text": "ہشام نےکہا : ہم سے قتادہ نے حدیث بیان کی ، انھوں نے سالم بن ابی جعد سے اور انھوں نے حضرت معد ان بن ابی طلحہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جمعے کے دن خطبہ دیا اور نبی اکرم ﷺ اور ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا تذکرہ کیا ، کہا : میں نے خواب دیکھا ہے ، جیسے ایک مرغ نے مجھے تین ٹھونگیں ماری ہیں اور اس کو میں اپنی موت قریب آنے کے سوا اور کچھ نہیں سمجھتا ۔ اور کچھ قبائل مجھ سے مطالبہ کر رہے ہیں کہ میں کسی کو اپنا جانشین بنادو ں ۔ بلا شبہ اللہ تعالیٰ اپنے دین کو ضائع نہیں ہونے دے گا ، نہ اپنی خلافت کو اور نہ اس شریعت کو جس کے ساتھ اس نے اپنے نبی ﷺ کو مبعوث فرمایا ۔ اگر مجھے جلد موت آجائے تو خلافت ان چھ حضرات کے باہیم مشورے سے طے ہو گی جن سے رسول اللہ ﷺ اپنی وفات کے وقت خوش تھے ۔ اور میں جانتا ہوں کہ کچھ لوگ جن کو میں نے اسلام کی خاطر اپنے اس ہاتھ سے مارا ہے ، وہ اس امر ( خلافت ) پر اعتراض کریں گے ، اگر وہ ایسا کریں گے تو وہ اللہ کے دشمن ، کافر اور گمراہ ہوں گے ، پھر میں اپنے بعد جو ( حل طلب ) چیزیں چھوڑ کر جارہا ر ہوں ان میں سے میرے نزدیک کلالہ کی وراثت کےمسئلے سے بڑھ کر کوئی مسئلہ زیادہ اہم نہیں ۔ میں نے رسول اللہ ﷺ سے کسی مسئلے کے بارے میں اتنی دفعہ رجوع نہیں کیا جتنی دفعہ کلالہ کے بارے میں کیا اور آپ نے ( بھی ) میرے ساتھ کسی مسئلے میں اس قدر سختی نہیں برتی جتنی میرے ساتھ آپ نے اس مسئلے میں سختی کی حتیٰ کہ آپ نے انگلی میرے سینے میں چبھو کر فرمایا : ’’اے عمر ! کیا گرمی کے موسم میں اترنے والی آیت تمھارے لیے کافی نہیں جو سورۃ نساء کے آخر میں ہے ؟ ‘ ‘ میں اگر زندہ رہا تو میں اس مسئلے ( کلالہ ) کے بارے میں ایسا فیصلہ کروں گا کہ ( ہر انسان ) جو قرآن پڑھتا ہے یا نہیں پڑھتا ہے اس کے مطابق فیصلہ کر سکے گا ، پھر آپ نے فرمایا : اے اللہ ! میں شہروں کے گورنرون کے بارے میں تجھے گواہ بناتا ہوں کہ میں نے لوگوں پر انھیں صرف اس لیے مقرر کر کے بھیجا کہ وہ ان سے انصاف کریں اور لوگوں کو ان کے دین اور ان کے نبی ﷺ کی سنت کی تعلیم دیں اور ان کے اموال فے ان میں تقسیم کریں اور اگر لوگوں کے معاملات میں انھیں کوئی مشکل پیش آئے تو اسے میرے سامنے پیش کریں ۔ پھر اے لوگو! تم دو پودے کھا تے ہو ، میں انھیں ( بو کے اعتبار سے ) برے پودے ہی سمجھتا ہوں ، یہ پیاز اور لہسن ہیں ۔ میں نے رسول اللہ ﷺ کو دیکھا ، جب مسجد میں آپ کو کسی آدمی سے ان کی بوآتی تو آپ اسے بقیع کی طرف نکال دینے کا حکم صادر فرماتے ، لہذا جو شخص انھیں کھانا چاہتا ہے وہ انھیں پکاکر ان کی بو مار دے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1259,
			"arabicnumber": "567.02",
			"text": "سعید بن ابی عروبہ اور شعبہ نے قتادہ سے اسی سند کے ساتھی اسی کے مانند روایت کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1260,
			"arabicnumber": "568.01",
			"text": "ابن وہب نےہمیں حدیث سنائی ، انھوں نے حیوہ سے ، انھوں نے محمد بن عبدالرحمن سے ، انھوں نے شدادبن ہاد کے آزاد کردہ غلام ابو عبداللہ سے روایت کی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے : رسول اللہ ﷺ نے فرمایا : ’’جوشخص کسی آدمی کو مسجد میں کسی گم شدہ جانور کے بارے میں اعلان کرتے ہوئے سنے تو وہ کہے : اللہ تمھارا جانور تمھیں نہ لوٹائے کیونکہ مسجدیں اس کام کے لیے نہیں بنائی گئیں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1261,
			"arabicnumber": "568.02",
			"text": "(ابن وہب کے بجائے ) مقری نے حیوہ سے باقی ماندہ اسی سند کےساتھ اسی کے مانند حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1262,
			"arabicnumber": "569.01",
			"text": "سفیان ثوری نے ہمیں خبر دی ، انھوں نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے اور انھوں نے اپنے والد ( بریدہ بن حصیب اسلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی کہ ایک آدمی نے مسجد میں اعلان کیا اور کہا : جو سرخ اونٹ ( کی نشاندہی ) کے لیے آواز دے گا ۔ تو نبی ﷺ فرمانے لگے : ’’تجھے ( تیرا اونٹ ) نہ ملے ، مسجدیں صرف انھی کاموں کے لیے بنائی گئی ہیں جن کے لیے انھیں بنایا گیا ۔ ‘ ‘ ( یعنی عبادت اور اللہ کے ذکر کے لیے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1263,
			"arabicnumber": "569.02",
			"text": "ابو سنان نے علقمہ بن مرثد سے ، انھوں نے سلیمان بن بریدہ سے اور انھوں نےاپنے والد سے روایت کی کہ ( ایک بار ) جب نبی ﷺ نے نمازپڑھائی تو ایک آدمی نے کھڑے ہو کر کہا : جو سرخ اونٹ ( کی نشاندہی ) کے لیے آواز دے گل ۔ تو نبی اکرم ﷺ نے فرمایا : ’’تم ( اپنا اونٹ ) نہ پاؤ ، مساجد صرف انھی کاموں کے لیے بنائی گئی ہیں جن کے لیے انھیں بنایا گیا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1264,
			"arabicnumber": "569.03",
			"text": "محمد بن شیبہ نے علقمہ بن مرثد سے ، انھوں نے ( سلیمان ) بن بریدہ سے اور انھوں نے اپنے والد سے روایت کی کہ جب نبی اکرم ﷺ صبح کی نماز پڑھ چکے تو ایک بدوی آیا اور مسجد کے دروازے سے اپنا سر اندر کیا ......پھر ان دونوں کی حدیث کی طرح بیان کیا ۔ امام مسلم ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : محمد بن شیبہ سے مراد ابو نعامہ شیبہ بن نعامہ ہے جس سے مسعر ، ہشیم ، جریر اور دوسرے کوفی راویوں نے روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1265,
			"arabicnumber": "389.06",
			"text": "امام مالک نے ابن شہاب ( زہری ) سے ، انھوں نے ابوسلمہ بن عبدالرحمن سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’بلا شبہ تم میں سے کوئی جب نماز پڑھنے کے لیے کھڑا ہوتا ہے تو شیطان آکر اسے التباس ( شبہ ) میں ڈالتا ہے حتی کہ وہ نہیں جانتا کہ اس نے کتنی ( رکعتیں ) پڑھی ہیں ۔ تم میں سے کوئی جب یہ ( کیفیت ) پائے تووہ ( آخری تشہد میں ) بیٹھے ہوئے دو سجدے کر لے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1266,
			"arabicnumber": "389.07",
			"text": "سفیان بن عیینہ اور لیث بن سعد نے زہری سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1267,
			"arabicnumber": "389.08",
			"text": "یحییٰ بن ابی کثیر سے روایت ہے ، کہا : ہمیں ابو سلمہ بن عبدالرحمن نے حدیث سنائی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے انھیں حدیث بیان کی کہ رسول اللہ ﷺ نے فرمایا : ’’جب اذان کہی جاتی ہے تو شیطان پیٹھ پھیر کر بھاگتا ہے گوزمار رہا ہوتا ہے تاکہ اذان ( کی آواز ) نہ سنے ۔ جب اذان ختم ہو جاتی ہے تو ( واپس ) آتا ہے ، پھر جب نماز کے لیےتکبیر کہی جاتی ہے تو پیٹھ پھیر کر بھاگ جاتا ہے ، جب تکبیر ختم ہو جاتی ہے تو آجاتا ہے تاکہ انسان اور اس کے دل کے درمیان خیال آرائی شروع کروائے ، وہ کہتا ہے : فلاں بات یاد کرو ، فلاں چیز یاد کرو ۔ وہ چیزیں ( اسے یاد کراتا ہے ) جو اسے یاد نہیں ہوتیں حتی کہ وہ شخص یوں ہو جاتا ہے کہ اسے یا د نہیں رہتا اس نے کتنی رکعتیں پڑھی ہیں ، چنانچہ جب تم میں سے کسی کو یاد نہ رہے کہ اس نے کتنی رکعتیں پڑھی ہیں تو وہ ( تشہد میں ) بیٹھے بیٹھے دو سجدے کر لے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1268,
			"arabicnumber": "389.09",
			"text": "عبدالرحمن اعرج نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نےفرمایا : ’’جب نماز کے لیے تکبیر کہی جاتی ہے تو شیطان پیٹھ پھیر کر گوز مارتا ہوا بھاگتا ہے ...... ‘ ‘ آگے اوپر کی روایت کی طرح ذکر کیا اور یہ اضافہ کیا : ’’اسے رغبت اور امید دلاتا ہے اور اسے اس کی ایسی ضرورتیں یاد دلاتا ہے جو اسے یاد نہیں ہوتیں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1269,
			"arabicnumber": "570.01",
			"text": "مالک نے ابن شہاب سے ، انھوں نے عبدالرحمن اعرج سے اور انھوں نے حضرت عبداللہ بن بحسینہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے ہمیں کسی ایک نماز کی دو رکعتیں پڑھائیں ، پھر ( تیسری کے لیے ) کھڑے ہو گئے اور ( درمیان کے تشہد کے لیے ) نہ بیٹھے تو لوگ بھی آپ کے ساتھ کھڑے ہو گئے ، جب آپ نے نماز پوری کر لی اور ہم آپ کے سلام کے انتظار مین تھے توآپ نے تکبیر کہی اور بیٹھے بیٹھے سلام سے پہلے دو سجدے کیے ، پھر سلام پھیر دیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1270,
			"arabicnumber": "570.02",
			"text": "لیث نے ابن شہاب سے ، انھوں نےاعرج سے اور انھوں نے حضرت عبداللہ بن بحسینہ اسدی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، جو بنو بعدالمطلب کے حلیف تھے ، روایت کی کہ رسول اللہ ﷺ ظہر کی نماز میں ، جب آپ کو ( دوسری رکعت کےبعد ) بیٹھنا تھا ، کھڑے ہوگئے ، پھر جب آپ نے اپنی نماز مکمل کر لی تو آپ نے بیٹھے بیٹھے ہر سجدے کے لیے تکبیر کہتےہوئے سلام سے پہلے دو سجدے کیے ، اور لوگوں نے بھی ( تشہد کے لیے ) بیٹھے کی جگہ ، جو آپ بھول گئے تھے ، آپ کے ساتھ د و سجدے کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1271,
			"arabicnumber": "570.03",
			"text": "(ابن شہاب کے بجائے ) یحییٰ بن سعید نے عبدالرحمن اعرج سے اور انھوں نے حضرت عبداللہ بن مالک ابن بحسینہ ازدی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ دو رکعتوں کےبعد جہاں نماز میں آپ کا بیٹھنے کا ارادہ تھا ، ( وہاں ) کھڑے ہو گئے ، آپ نے اپنی نماز جاری رکھی ۔ پھر جب نماز کے آخرمیں پہنچے تو سلا م سے پہلے سجدے کیے ، اس کے بعد سلام پھیرا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1272,
			"arabicnumber": "571.01",
			"text": "سلیمان بن بلال نے زید بن اسلم سے ، انھوں نے عطاء بن یسار سے اور انھوں نے حضرت ابو سعید خدری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’جب تم میں سے کسی کو اپنی نماز میں شک ہو جائے اور اسے معلوم نہ ہو کہ اس نے کتنی رکعتیں پڑھ لی ہیں ؟ تین یا چار ؟ تو وہ شک کو چھوڑ دے اور جتنی رکعتوں پر اسے یقین ہے ان پر بنیاد رکھے ( تین یقینی ہیں تو چوتھی پڑھ لے ) پھر سلام سے پہلے دو سجدے کر لے ، اگر اس نے پانچ رکعتیں پڑھ لی ہیں تو یہ سجدے اس کی نماز کو جفت ( چھ رکعتیں ) کر دیں گے ارو اگر اس نے چار کی تکمیل کر لی تھی تو یہ سجدے شیطان کی ذلت و رسوائی کا باعث ہوں گے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1273,
			"arabicnumber": "571.02",
			"text": "داؤد بن قیس نے زید بن اسلم سے اسی سند کے ساتھ روایت کی اور اس کے معنی کے مطابق یہ کہا : وہ ’’ ( نمازی ) سلام پھیرنے سے پہلے دو سجدے کر لے ۔ ‘ ‘ جس طرح سلیمان بن بلال نے کہا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1274,
			"arabicnumber": "572.01",
			"text": "جریر نے ہمیں حدیث بیان کی ، انھوں نے منصور سے ، انھوں نے ابراہیم سے اور انھوں نے علقمہ سے روایت کی ، کہا : حضرت عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا : رسول اللہ ﷺ نے ہمیں نماز پڑھائی ۔ ابراہیم نے کہا : آپ نے اس میں زیادتی یا کمی کر دی ۔ پھر جب آپ نے سلام پھرا تو آپ سے عرض کی گئی : اے اللہ کے رسول ! کیانماز میں کوئی نئی چیز ( تبدیلی ) آگئی ہے ؟ آپ نے پوچھا : ’’وہ کیا ؟ ‘ ‘ صحابہ نے عرض کی : آپ نے اتنی اتنی رکعتیں پڑھائی ہیں ۔ ( راوی نے کہا : ) آپ نے اپنے پاؤں موڑے ، قبلہ کی طرف رخ کیا اور دو سجدے کیے ، پھر سلام پھیرا ، پھر آپ نے ہماری طرف رخ کیا اور فرمایا : ’’اگر نماز میں کوئی نئی بات ہوتی تو میں تمھیں بتا دیتا ، لیکن میں ایک انسان ہوں ، جس طرح تم بھولتے ہومیں بھی بھول جاتا ہوں ، اس لیے جب میں بھول جاؤں تو مجھے یاد دلا دیا کرو اور جب تم میں سے کسی کو اپنی نماز کے بارے میں شک ہو جائے تو وہ صحیح کی جستجو کرے اور ا س کے مطابق ( نماز کی ) تکمیل کرے ، پھر ( سہو کے ) دو سجدے کر لے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1275,
			"arabicnumber": "572.02",
			"text": "ابن بشر اور وکیع دونوں نے مسعر سے اور انھوں نے منصور سے اسی سند کے ساتھ حدیث بیان کی ابن بشر کی روایت مین ہے : ’’وہ غور کرے کہ اس میں سے صحت کے قریب ترکیا ہے ؟ ‘ ‘ اور وکیع کی روایت میں ہے : ’’ وہ صحیح ( صورت کو یاد رکرنے ) کی جستجو کرے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1276,
			"arabicnumber": "572.03",
			"text": "وہیب بن خالد نے کہا : ہمیں منصور نے اسی سند کےس اتھ حدیث بیان کی ۔ منصور نے کہا : ’’وہ غور کرے کہ اس میں صحت کے قریب تر کیا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1277,
			"arabicnumber": "572.04",
			"text": "سفیان نے منصور سے مذکورہ سند کے ساتھ یہی حدیث بیان کی اور کہا : ’’وہ صحیح کی جستجو کرے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1278,
			"arabicnumber": "572.05",
			"text": "شعبہ نے منصور سے اسی سند کے ساتھ یہی حدیث بیان کی اور کہا : ’’ اس میں جو صحیح کے قریب تر ہے اس کی جستجو کرے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1279,
			"arabicnumber": "572.06",
			"text": "فضیل بن عیاض نے منصور سے اسی سند کے ساتھ خبر دی اور کہا : ’’وہ اس کی جستجو کرے جسے وہ صحیح سمجھتا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1280,
			"arabicnumber": "572.07",
			"text": "عبدالعزیز بن عبد الصمد نے منصور سے ان سب راویوں کی سند کے ساتھ یہی حدیث بیان کی اور کہا : ’’وہ صحیح کی جستجو کرے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1281,
			"arabicnumber": "572.08",
			"text": "حکم نے ابراہیم سے ، انھوں نے علقمہ سے اور انھوں نے حضرت عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی کہ نبی کریم ﷺنے ظہر کی نماز ( میں ) پانچ رکعات پڑھا دیں ، جب آپ نے سلام پھیر ا تو آپ سے عرض کی گئی : کیا نماز میں اضافہ کر دیا گیا ہے ؟ آپ نے فرمایا : ’’ وہ کیا ہے ؟ ‘ ‘ صحابہ نے کہا : آپ نے پانچ رکعات پڑھی ہیں ۔ توآپ نے دو سجدے کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1282,
			"arabicnumber": "572.09",
			"text": "ابن نمیر نے ہمیں حدیث بیان کی ، کہا : ہمیں ابن ادریس نے حسن بن عبید اللہ سے حدیث بیان کی ، انھوں نے ابراہیم ( بن سوید ) سے اور انھوں نے علقمہ سے روایت کی کہ آپ ﷺ نے انھیں پانچ رکعات پڑھائیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1283,
			"arabicnumber": "572.10",
			"text": "عثمان بن ابی شیبہ نے ہمیں حدیث بیان کی ۔ لفظ انھی کے ہیں ۔ انھوں نے کہا : ہمیں جریر نے حسن بن عبیداللہ سے حدیث بیان کی ، انھوں نے ابراہیم بن سوید سے روایت کی ، کہا : ہمیں علقمہ نے ظہر کی پانچ رکعتیں پڑھا دیں ۔ جب انھوں نے سلام پھیرا تو لوگوں نے کہا : ابو شبل! آپ نے پانچ رکعتیں پڑھائی ہیں ۔ انھوں نے کہا : بالکل نہیں ، میں نے ایسا نہیں کیا ۔ لوگوں نے کہا : کیوں نہیں ! ( آپ نے ایسا ہی کیا ہے ۔ ) ابراہیم نے کہا : میں لوگوں کے کنارے ( والے حصے ) میں تھا اور بچہ تھا ، میں نے کہا : ہاں !آپ نے پانچ رکعتیں پڑھی ہیں ۔ انھوں نے مجھ سے کہا : ایک آنکھ والے ! تو بھی یہی کہتا ہے ؟ میں نے کہا : جی ہاں ! تو وہ مڑے اور دو سجدے کیے ، پھر سلام پھیرا ، پھر کہا : عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ( بن مسعود ) نے کہا : رسول اللہ ﷺ نے ہمیں پانچ رکعتیں پڑھا دیں ، جب آپ مڑے تو لوگوں نے آپس میں کھسر پھسر شروع کر دی ۔ آپ نے پوچھا : ’’ تمھیں کیا ہوا ہے ؟ ‘ ‘ انھوں نے کہا : اے اللہ کے رسول ! کیا نماز میں اضافہ کر دیا گیا ہے ؟آپ نے فرمایا : ’’ نہیں ۔ ‘ ‘ لوگوں نے کہا : آپ نے پانچ رکعتیں پڑھائی ہیں ۔ تو آپ پلٹے ، پھر دو سجدے کیے ، پھر سلام پھیرا ، پھر فرمایا : ’’ میں تمھاری ہی طرح کا انسان ہوں ، میں ( بھی ) بھول جاتا ہوں جس طرح تم لوگ بھول جاتے ہو ۔ ‘ ‘ ابن نمیر نے اپنی روایت میں یہ اضافہ کیا : ’’جب تم میں سے کوئی بھول جائے تو وہ دو سجدے کر لے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1284,
			"arabicnumber": "572.11",
			"text": "عبدالرحمن بن اسود نے اپنے والد سے ، انھوں نےحضرت عبداللہ ( بن مسعود ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : رسول اللہ ﷺ نے ہمیں پانچ رکعتیں پڑھا دیں تو ہم نے عرض کی : اے اللہ کے رسول ! کیا نماز میں اضافہ کر دیا گیا ہے ؟ آپ نے فرمایا : ’’ وہ کیا ؟ ‘ ‘ صحابہ نے کہا : آپ نے پانچ رکعات پڑھائی ہیں ۔ آپ نے فرمایا : ’’ میں تمھاری طرح انسان ہوں ، میں بھی اسی طرح یا د رکھتا ہوں ، جس طرح تم یاد رکھتے ہو اور میں ( بھی ) اسی طرح بھو ل جاتا ہوں ، جس طرح تم بھول جاتے ہو ۔ ‘ ‘ پھر آپ نے سہو کے دو سجدے کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1285,
			"arabicnumber": "572.12",
			"text": "(علی ) بن مسہر نے اعمش سے ، انھوں نے ابراہیم سے ، انھوں نے علقمہ سے اور انھوں نے حضر عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : رسول اللہ ﷺ نے نماز پڑھائی اور اس میں کچھ اضافہ کر دیا ۔ ابراہیم نے کہا کہ یہاں وہم مجھے ہوا ہے ، علقمہ کو نہیں ۔ عرض کی گئی : اللہ کے رسول ! کیا نماز مین اضافہ کر دیا گیا ہے ؟ آپ نے فرمایا : ’’ میں تمھاری طرح انسان ہی ہوں ، میں بھی بھولتا ہوں ، جیسے تم بھولتے ہو ، اس لیے جب تم میں سے کوئی بھول جائے تو وہ بیٹھے بیٹھے دو سجدے کر لے ۔ ‘ ‘ پھر رسول اللہ ﷺ نے رخ ( قبلہ کی طرف ) پھیرا اور دو سجدے کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1286,
			"arabicnumber": "572.13",
			"text": "حفص اور ابو معاویہ نے اعمش سے باقی ماندہ اس سند کے ساتھ حضرت عبداللہ ( بن مسعود ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : نبی ﷺ نے سلام اور گفتگو کےبعد سہو کے دو سجدے کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1287,
			"arabicnumber": "572.14",
			"text": "زائدہ نے سلیمان ( اعمش ) سے باقی ماندہ اسی سند کے ساتھ حضرت عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : ہم رسول اللہ ﷺ کے ساتھ نماز پڑھی ، آپ نے زیادہ پڑھا دی تھی یا کم ۔ ابراہیم نے کہا : اللہ کی قسم ! یہ ( وہم ) میری طرف سے ہے ۔ عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تو ہم نے عرض کی : اے اللہ کے رسول ! کیانماز میں کوئی نیا حکم آگیا ہے ؟ آپ نے فرمایا : ’’ نہیں ‘ ‘ تو ہم نے آپ کو جو آپ نے کیا تھا اس سے آگا ہ کیا تو آپ نے فرمایا : ’’ جب آدمی زیادتی یا کمی کر لے تو دو سجدے کر ے ۔ ‘ ‘ ( عبداللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : اس کے بعد آپ نے دو سجدے کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1288,
			"arabicnumber": "573.01",
			"text": "سفیان بن عیینہ نے کہا : ہم سے ایوب نے حدیث بیان کی ، انھوں نے کہا : میں نے محمد بن سیرین سے سنا ، وہ کہہ رہے تھے : میں نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے : ہمیں رسول اللہ ﷺ نے دوپہر کے بعد کی ایک نماز ظہر یا عصر پڑھائی اور دو رکعتوں کے بعد سلام پھیر دیا ، پھر قبلے کی سمت ( گڑے ہوئے ) کجھور کے ایک تنےکے پاس آئے اور غصے کی کیفیت میں اس سے ٹیک لگا لی ۔ لوگوں میں ابو بکر و عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ موجود ( بھی ) تھے ، انھوں نے آپ کی ہیبت کی بنا پر گفتگو نہ کی جبکہ جلد باز لوگ ( نماز پڑھتے ہی ) نکل گئے ، اور کہنے لگے : نماز میں کمی ہو گئی ہے ۔ تو ذوالیدین ( نامی شخص ) کھڑا ہوا اور کہا : اے اللہ کے رسول ! کیا نماز مختصر کر دی گئی ہے یا آپ بھول گئے ہیں ؟ نبی اکرم ﷺ نے دائیں اور بائیں دیکھ کر پوچھا : ’’ ذوالیدین کیا کہہ رہا ہے ؟ ‘ ‘ لوگوں نے کہا : سچ کہہ رہا ہے ، آپ نے دو رکعتیں ہی پڑھی ہیں ۔ چنانچہ آپ نے دو رکعتیں ( مزید ) پڑھیں اور سلام پھیر دیا ، پھر اللہ اکبر کہا اور سجدہ کیا ، بھر اللہ اکبر کہا اور سر اٹھایا ، پھر اللہ اکبر کہا اور سجد ہ کیا ، پھر اللہ اکبر کہا اور سر اٹھایا ۔ ( محمد بن سیرین نے ) کہا : عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے حوالے سے مجھے بتایا گیا کہ انھوں نے کہا : اور سلام پھیرا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1289,
			"arabicnumber": "573.02",
			"text": "(سفیان کے بجائے ) حماد نے ہمیں حدیث بیان کی ( کہا : ) ہمیں ایوب نے محمد بن سیرین سے حدیث سنائی ، انھوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : رسول اللہ ﷺ نے ہمیں دو پہر کے بعد کی دو نمازو ں میں سے ایک نماز پڑھائی ......آگے سفیان ( بن عیینہ ) کے ہم معنی حدیث ( سنائی ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1290,
			"arabicnumber": "573.03",
			"text": "ابن ابی احمد کے آزاد کردہ غلام ابو سفیان سے روایت ہے کہ اس نے کہا : میں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہو ئے سنا کہ رسول اللہ ﷺ نے ہمیں عصر کی نماز پڑھائی اور دو رکعتوں میں سلام پھیر دیا ۔ ذوالیدین ( نامی شخص ) کھڑا ہوا اور کہا : اے اللہ کے رسول ! نماز کم کر دی گئی ہے یا آپ بھول گئے ہیں ؟ رسول اللہ ﷺ نے فرمایا : ’’ ایسا کوئی کام نہیں ہوا ۔ ‘ ‘ اس نے عرض کی : اے اللہ کے رسول ! کوئی ایک کام تو ہوا ہے ۔ تب رسول اللہ ﷺ لوگوں کی طرف متوجہ ہوئے اور پوچھا : ’’ کیا ذوالیدین نے سچ کہا؟ ‘ ‘ انھوں کہا : جی ہاں ! اے اللہ کے رسول ! تو رسول اللہ ﷺ نے جو نماز رہ گئی تھی پوری کی ، پھر بیٹھے بیٹھے سلام پھیرنے کے بعد دو سجدے کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": "573.04",
			"text": "علی بن مبارک نے ہمیں حدیث بیان کی ، کہا : ہمیں یحییٰ نے حدیث بیان کی ، انھوں نے کہا : ہمیں ابو سلمہ نےحدیث سنائی ، کہا : ہمیں حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےحدیث بیان کی کہ رسول اللہ ﷺ نے ظہر کی دور کعتیں پڑھائیں ، پھر سلام پھیر دیا تو بنو سلیم کا ایک آدمی آپ کے قریب آیا اور عرض یک : اے اللہ کے رسول ! نماز کم کر دی گئی ہے یا آپ بھول گئے ہیں ؟.......اور آگے ( سابقہ ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": "573.05",
			"text": "شیبان نےیحییٰ سے ، انھوں نے ابو سلمہ سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : میں نبی اکر ﷺ کے ساتھ ( اقتدا میں ) ظہر کی نماز پڑھ رہا تھا کہ رسول اللہ ﷺ نے دو رکعتوں پر سلام پھیر دیا ، اس پر بنی سلیم کا ایک آدمی کھڑا ہوا .......آگے ( مذکورہ بالا ) حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": "574.01",
			"text": "اسماعیل بن ابراہیم نے خالد ( حذاء ) سے ، انھوں نے ابو قلابہ سے ، انھوں نے ابو مہلب سے اور انھوں نے حضرت عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نےعصر کی نماز پڑھائی اور تین رکعات پر سلام پھیر دیا ، پھر اپنے گھر تشریف لے گئے تو ایک آدمی جسے خرباق کہا جاتا تھا اور اس کے ہاتھ لمبے تھے ، وہ آپ کی خدمت میں حاضر ہواا ور آپ سے عرض کی : اے اللہ کے رسول ! پھر آپ ﷺ سے جو ( سہو ) ہوا تھا اس کا آپ کے سامنے تذکرہ کیا ، آپ غصے کی حالت میں ، چادر گھسیٹتے ہوئے نکلے حتی کہ لوگوں کے پا س آ پہنچے اور پوچھا : ’’ کیا یہ سچ کہہ رہا ہے ؟ ‘ ‘ لوگوں نے کہا : جی ہاں ! توآپ نے ایک رکعت پڑھائی ، پھر سلام پھیرا ، پھر سہو کے دو سجدے کیے ، پھر سلام پھیرا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": "574.02",
			"text": "عبدالوہاب تقفی نے خالد حذاء سے باقی ماندہ اسی سند کے ساتھ حضرت عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا کہ رسول اللہ ﷺ نے عصر کی تیسری رکعت میں سلام پھیر دیا ، پھر اٹھ کر اپنے حجرے میں داخل ہو گئے ، ایک ( لمبے ) چوڑے ہاتھوں والا آدمی کھڑا ہوا اور عرض کی : اے اللہ کے رسول ! کیا نماز کم کر دی گئی ہے ؟ پھر آپ غصے کے عالم میں نکلے اور چھوڑی ہوئی رکعت پڑھائی ، پھر سلام پھیر دیا ، پھر سہو کے دو سجدے کیے ، پھر سلام پھیرا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": "575.01",
			"text": "یحییٰ بن سعید قطان نے عبیداللہ سے حدیث بیان کی ، انھوں نے کہا : مجھے نافع نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی کہ نبی کریم ﷺ قرآن مجید کی تلاوت فرمایا کرتےتھے ۔ آپ اس سورت کی تلاوت فرماتے جس میں سجدہ ہوتا اور سجدہ کرتے تو ہم ( سب ) بھی آپ کے ساتھ سجدہ کرتے ، حتی کہ ہم میں سے بعض کو پیشانی رکھنے کے لیے بھی جگہ نہ ملتی تھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": "575.02",
			"text": "محمد بن بشر نے حدیث بیان کی ، کہا : ہمیں عبیداللہ نےنافع سے حدیث بیان کی اور انھوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھو ں نے کہا : بسا اوقات رسول اللہ ﷺ قرآن پڑھتے ہوئے سجدے ( والی آیت ) سے گزرتے تو ہمارے ساتھ سجدہ کرتے ، آپ کے پاس ہماری بھیٹر لگ جاتی حتی کہ ہم میں سے بعض کو سجدہ کرنے کےلیے جگہ نہ ملیتی ( یہ سجدہ ) نماز کے علاوہ ہوتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": "576",
			"text": "حضرت عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے نبی اکرم ﷺ سے روایت کی کہ آپ آپ ﷺ نے سورۃ نجم کی تلاوت کی اور اس میں سجدہ کیا اور آپ کے ساتھ جتنے لوگ تھے سب نے سجدہ کیا ، مگر ایک بوڑھے ( امیہ بن خلف ) نے کنکریوں یا مٹی کی ایک مٹھی بھر کر اپنی پیشانی سے لگا لی اور کہا : میرے لیے یہی کافی ہے ۔ عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا : میں نےبعد میں دیکھا ، اسے کفر کی حالمت میں قتل کیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": "577",
			"text": "عطاء بن یسار نے ( اپنے شاگرد ابن قسیط کو ) بتایا کہ انھوں نے امام کے ساتھ ( قرآن کی کسی سورت کی ) قراءت کرنے کے بارے میں حضرت زید بن ثابت ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سوال کیا ؟ انھوں نے کہا : امام کے ساتھ ( فاتحہ کے سوا ) کچھ نہ پڑھے اور کہا : انھوں ( زید ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے رسول اللہ ﷺ کے سامنے ( والنجم اذا ھویٰ ) پڑھی تو آپ نے سجدہ نہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": "578.01",
			"text": "اسود بن سفیان کے آزاد کردہ غلام عبداللہ بن یزید نے ابو سلمہ بن عبدالرحمن سے روایت کی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ان کے سامنے سورۃ ( اذاالسمآ ء النشقت ) پڑھی اور ا س میں سجدہ کیا ، پھر جب سلام پھیرا تو انھیں بتایا کہ رسول اللہ ﷺ نے اس سورت میں سجدہ کیا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": "578.02",
			"text": "یحییٰ بن ابی کثیر نے ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی کریم ﷺ سے اسی کی مانند روایت کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": "578.03",
			"text": "عطاء بن میناء نے حضرت ابو ھریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ‘ انھوں نے کہا : ہم نے نبی ﷺکے ساتھ ( اذا السّماء انشقت ) اور ( اقرا باسم ربّک ) میں سجدہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": "578.04",
			"text": "صفوان بن سلیم نے بنو مخزوم کے آزاد کردہ غلام عبد الرحمٰن اعرج سے روایت کی ‘ انھوں نے حصرت ابو ھریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ‘ انھوں نے کہا کہ رسول اللہ ﷺ نے ( اذا اسّماء انشقّت ) اور ( اقراباسم ربّک ) میں سجدہ کیا ۔ صفوان بن سلیم نے بنو مخزوم کے آزاد کردہ غلام عبد الرحمٰن اعرج سے روایت کی ‘ انھوں نے حصرت ابو ھریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ‘ انھوں نے کہا کہ رسول اللہ ﷺ نے ( اذا اسّماء انشقّت ) اور ( اقراباسم ربّک ) میں سجدہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": "578.05",
			"text": "۔ عبید اللہ بن ابی جعفر نے عبد الرحمٰن اعرج سے ‘ انھوں نے حصرت ابوھریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے رسو ل اللہﷺسے اسی کے مانند بیان کیا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": "578.06",
			"text": "عبید اللہ بن معاذ غنبری ارو محمد بن عبد الاعلیٰ نے کہا : ہمیں معتمر نے اپنے والد ( سلیمان تیمی ) سے حدیث سنائی ‘ انھوں نے بکر ( بن عبد اللہ مزنی ) سے اور انھوں نے ابو رافع سے روایت کی ‘ انھوں نے کہا : میں نے حضرت ابوھریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ عشاء کی نماز پڑھی تو انھوں نے ( اذا السّماء انشقّت ) کی تلاوت کی اور اس میں سجدہ کیا ۔ میں نے پوچھا : یہ سجدہ کیسا ہے ؟انھوں نے جواب دیا : میں نے اس میں ابوالقاسم ( محمد رسو ل اللہ ﷺ ) کے پیچھے سجدہ کیا ‘ اس لیے میں اس میں ہمیشہ سحدہ کرتا رہوں گا یہاں تک کہ آپ ( ﷺ ) سے جا ملوں ۔ ( محمد ) بن عبد الاعلیٰ نے کہا : میں بھی ہمیشہ یہ سجدہ کرتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": "578.07",
			"text": "عیسیٰ بن یونس ‘ یزید بن زریع اور سلیم بن اخضر سب نے ( سلیمان ) تیمی سے سابقہ سند کے ساتھ روایت کی لیکن انھوں نے خلف ابی القاسم ﷺ ( ابوالقاسم ﷺکے پیچھے ) کے الفاظ نہیں کہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": "578.08",
			"text": "شعبہ نے عطاء بن ابی میمونہ سے انھوں نے ابو رافع سے روایت کی ‘ کہا : میں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو دیکھا ‘ وہ ( اذا السّماء انشقّت ) میں سجدہ کرتے تھے ۔ میں نے پوچھا : آپ اس میں سجدہ کرتے ہیں؟انھوں نے کہا : ہاں!میں نے اپنے خلیلﷺکو اس سجدہ کرتے دیکھا ‘ اس لیے میں ہمیشہ اس میں سجدہ کرتا رہو ں گا حتی کہ ان سے جا ملوں ۔ شعبہ نے کہا : میں نے ( عطاء سے ) پوچھا : ( خلیل سے مراد ) نبی اکرم ﷺہیں ؟انھوں نے کہا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": "579.01",
			"text": "عثمان بن حکم نے کہا : عامر بن عبد اللہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اپنے والد سے روایت کرتے ہوئے مجھے حدیث سنائی ‘ انھوں نے کہا : رسول اللہﷺجب نماز میں بیٹھتے تو اپنا بایاں پاؤں اپنی ران اور اپنی پنڈلی کے درمیان کر لیتے اور اپنا دایاں پاؤ ں بچھا لیتے اور اپنا بایاں ہاتھ اپنے بائیں گٹھنے پر اور اپنا دایا ں ہاتھ اپنی دائیں ران پر رکھ لیتے اور اپنی انگلی سے اشارہ کر لیتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": "579.02",
			"text": "۔ ابن عجلان نے عامر بن عبد اللہ بن زبیرسے اور انھوں نے اپنے والد سے روایت کی ‘ انھوں نے کہا : رسول اللہ ﷺجب ( نماز میں ) بیٹھ کر دعا کرتے تو اپنا دایاں ہاتھ اپنی دائیں ران پراور اپنا بایاں ہاتھ اپنی بائیں ران پر رکھتے اور اپنی شہادت کی انگلی سے اشارہ کرتے اوراپنا انگوٹھا اپنی د رمیانی انگلی پررکھتےاور بائیں گٹھنے کو اپنی بائیں ہتھیلی کے اندر لےلیتے ( پکڑلیتے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": "580.01",
			"text": "عبید اللہ بن عمر نے نافع سے اور انھوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ نبیﷺجب نماز میں بیٹھتے تو اپنے دونوں ہاتھ اپنے دونوں گٹھنوں پر رکھ لیتے اور انگوٹھے سے ملنے والی دائیں ہاتھ کی انگلی ( شہادت کی انگلی ) اٹھا کر اس سے دعا کرتے اور اس حالت میں آپکا بایاں ہاتھ آپکے بائیں گٹھنے پرہوتا ‘ اسے ( آپ ) اس ( گٹھنے ) پر پھیلا ئے ہوتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": "580.02",
			"text": "ایوب نے نافع سے اور انھوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہﷺجب تشہد میں بیٹھتےتو اپنا بایاں ہاتھ اپنے بائیں گٹھنے پررکھتےاوراپنا دایاں ہاتھ اپنے دائیں گٹھنے پر رکھتے اور انگلیوں سے تریپن ( 53 ) کی گرا بناتے اور انگشت شہادت سے اشارہ کرتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": "580.03",
			"text": "امام مالک نے مسلم بن ابی مریم سے اور انھوں نے علی بن عبد الرحمان معادی سے روایت کی کہ انھوں نے کہا : مجھے عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے دیکھا کہ میں نماز کے دوران ( بے خیالی کے عالم میں نیچے پڑی ہوئی ) کنکریوں سے کھیل رہاتھا ۔ جب انھوں نے سلام پھیرا تو مجھےے منع کیا اورکہا : ویسے کرو جس طرح رسول اللہﷺکیا کرتے تھے ۔ میں نے پوچھا : رسول اللہ ﷺکیا کرتے تھے ؟انھوں نے بتایا : جب آپﷺنماز میں بیٹھنے تو ا پنی دائیں ہتھیلی اپنی دائیں ران پر رکھتے اور سب انگلیوں کو بند کر لیتے اور انگوٹھے کے ساتھ والی انگلی سے اشارہ کرتے اور اپنی بائیں ہتھیلی کو اپنی بائیں ران پررکھتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": "580.04",
			"text": "ابن ابی عمر نے کہا : ہمیں سفیان نے مسلم بن ابی مریم سے حدیث سنائی ‘ انھوں نے علی بن عبد الرحمان معادی سے روایت کی ئ انھوں نے کہا : میں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ کھڑے ہو کر نماز پڑھی ...پھر سفیان نے مالک کی حدیث کی طرح حدیث بیان کی اور ( سفیان کے شاگرد ابن ابی عمر نے ) یہ اضافہ کیا کہ سفیان نے کہا : یحییٰ بن سعید نے ہمیں یہ حدیث مسلم ( بن ابی مریم ) سے بیان کی تھی ‘ پھر مسلم ( بن ابی مریم ) نے خود مجھے یہ حدیث سنائی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": "581.01",
			"text": "زہیر بن حرب نے کہا : ہمیں یحییٰ بن سعید نے شعبہ سے حدیث بیان کی ‘ انھوں نے حکم اور منصور سے ‘ انھوں نے مجاہد سے اور انھوں نے ابو معمر سے روایت کی کہ ایک حاکم جو مکہ میں تھا دو طرف سلام پھیرتا تھا ۔ حضرت عبد اللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا : وہ کہا سے اس سنت سے وابستہ ہوا ہے ؟ حکم نے اپنی حدیث میں کہا : ( عبداللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا رسول اللہﷺایسے ہی کیا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": "581.02",
			"text": "احمد بن حنبل نے کہا : ہمیں یحییٰ بن سعید نے شعبہ سے حدیث سنائی ‘ انھوں نے مجاہد سے ‘ انھوں نے ابو معمر سے اور انھوں نے حضرت عبد اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ۔ شعبہ نے کہا ۔ حکم نے ایک بار یہ روایت مرفوع بیان کی ۔ کہ ایک حاکم یا ایک آدمی نے دو طرف سلام پھیراتو عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا : اس نے یہ ( سنت ) کہا سے اپنا لی ہے ؟ گویا اس دور کے حاکموں نے ایسی سنتیں بھی ترک کی ہوئی تھیں ۔ جس نے اہتمام کیا صحابہ نے اسے سراہا ۔ محدثین کی کاوشوں سے یہ سب سنتیں زندہ ہوئیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": "582",
			"text": "عامر بن سعد نے اپنے وال ( سعد بن ابی وقاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی ‘ انھوں نے کہا : میں رسول اللہﷺ کو اپنی دائیں اور بائیں جانب سلام پھیرتے دیکھا کرتا تھاٰحتی کہ میں آپ کے رخسار وں کی سفیدی دیکھتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": "583.01",
			"text": "زہیر بن حرب نے کہا : ہمیں سفیان بن عیینہ نے عمرو ( بن دینار ) سے حدیث سنائی ‘ انھوں نے کہا : مجھے ابو معبد نے ابن عباس رضی اللہ عنھما سے اس بات کی خبر دی ‘ بعد میں ( بھول جانے کی وجہ سے ) اس سے انکار کر دیا ‘ انھوں ( ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا کہ ہمیں رسول اللہ کی نماز ختم ہونے کا پتہ تکبیر سے چلتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": "583.02",
			"text": "ابن ابی عمر نے کہا : ہمیں سفیان بن عیینہ نے عمروبن دینار سے حدیث سنائی ‘ انھوں نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے مولی ٰ ابو معبد کو ابن عباس کے حوالے سے بتاتے ہوئے سنا ‘ انھوں ( ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نے کہا : ہمیں رسول اللہ ﷺ کی نماز ختم ہو جانے کا پتہ اللہ اکبر ہی سے لگتا تھا ۔ عمرو نےت کہا : میں نے اس روایت کا ( بعد میں ) ابو معبد کے سامنے ذکر کیا تو انھوں نے اس سے انکار کیا اور کہا : میں نے تمہیں یہ حدیث نہیں سنائی ۔ عمرو نے کہا : حالانکہ انھوں نے اس سے پہلے مجھے یہ بات بتائی تھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": "583.03",
			"text": "ابن جریج نے کہا : مجھے عمرو بن دینار نے بتایا کہ ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کردہ ےغلام ابو معبد نے انھیں بتایا کہ حضرت عبد اللہ بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے انھیں خبر دی کہ جب لوگ فرض نماز سے سلام پھیرتے تو اس کے بعد بلند آواز سے ذکر کرنا نبی اکرمﷺ کے دور میں ( رائج ) تھا اور ابو معبد ) نے کہا : ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : جب لوگ سلام پھیرتے تو مجھے اس بات کا علم اسی ( بلندآواز کے ساتھ کیے گئے ذکر ) سے ہوتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": "584",
			"text": "عروہ بن زبیر نے حدیث بیان کی کہ حضرت عائشہ رضی اللہ عنہانے کہا : رسول اللہ ﷺ میرے ہاں تشریف لائے جبکہ میرے پاس ایک یہودی عورت موجود تھی اور وہ کہہ رہی تھی : کیا تمہیں پتہ ہے کہ قبر و ں میں تمہارا امتحان ہوگا ؟عائشہ رضی اللہ عنہا کہتی ہیں : اس پر رسول اللہ ﷺ خوفزدہ ہو گئے اور فرمایا : ’’یہودی کی آزمائش ہو گی ۔ ‘ ‘ حضرت عائشہ رضی اللہ عنہا نے بتلایا : کچھ دن گزرنے کے بعد رسو اللہ ﷺ نے فرمایا : ’’کیا تمہیں پتہ چلا مجھے وحی کی گئی ہے کہ تم قبرو ں میں آزمائے جاؤ گے؟ ‘ ‘ حضرت عائشہ رضی اللہ عنہا نے کہا : میں نے اس کے بعد رسو ل اللہﷺ کو سنا ‘ آپ عذاب قبر سے پناہ مانگتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": "585",
			"text": "حضرت ابو ھریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ میں نے ( یہودی عورت والے ) اس ( واقعے ) کے بعد آپﷺ سے سنا ‘ آپ قبر کے عذاب سے پناہ مانگتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": "586.01",
			"text": "ابو وائل ( شقیق بن سلمہ ) نے مسروق سے اور انھوں نے حضرت عائشہ ؓ سے روایت کی ، انھوں نے کہا : مدینہ کے یہودیوں کی بوڑھی عورتوں میں سے دو بوڑھیاں میرے گھر آئیں اور انھوں نے کہا : قبروں والوں کو ان کی قبروں میں عذاب دیا جاتا ہے ۔ میں نے ان دونوں کو جھٹلایا اور ان کی تصدیق کےلیے ہاں تک کہنا گوارانہ کیا ، وہ چلی گئیں اور رسول اللہ ﷺ میرے پاس تشریف لائے تو میں نے آپ سے کہا : اے اللہ کے رسول ! میرے پاس مدینہ کی بوڑھی یہودی عورتوں میں سے دو بوڑھیاں آئی تھیں ، ان کا خیا ل تھا کہ قبر والوں کو ان کی قبروں میں عذاب دیا جاتا ہے ۔ آپ نے ( کچھ دن گزر نے کے بعد ) فرمایا : ’’ان دونوں نے سچ کہا تھا ۔ ( قبروں میں ) ان ( کافروں ، گنا گاروں ) کو ایسا عذاب ہوتا ہے کہ اسے مویشی بھی سنتے ہیں ۔ ‘ ‘ اس کے بعد میں نے آپ کو دیکھا آپ ہر نماز میں قبر کے عذاب سے پناہ مانگتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": "586.02",
			"text": "(ابو وائل کے بجائے ) اشعث کے والد ( ابو شعثاء سلیم محاربی ) نے مسروق سے اور انھوں نے حضرت عائشہ ؓ سے مذکورہ بالا حدیث روایت کی ۔ اور اس میں یہ ہے کہ حضرت عائشہ ؓ نے کہا : آپ نے اس کے بعد جو نماز بھی پڑھی میں نے آپ سے سناکہ آپ اس میں قبر کے عذاب سے پناہ مانگتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": "587",
			"text": "حضرت عائشہ ؓ نے کہا کہ میں نے رسول اللہ ﷺ کو اپنی نماز میں ، دجال کے فتنے سے پناہ مانگتے سنا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": "588.01",
			"text": "وکیع نے کہا : ہمیں اوزاعی نے حسان بن عطیہ سے حدیث سنائی ، انھوں نے محمد بن ابی عائشہ سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، نیز ( اوزاعی نے ) یحییٰ بن ابی کثیر سے ، انھوں نے ابو سلمہ سے اور انھون نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : روسول اللہ ﷺ نے فرمایا : ’’جب تم میں سے کوئی تشہد پڑھ لے تو چار چیزوں سے اللہ کی پناہ طلب کرے ۔ ’’اے اللہ ! میں جہنم کے عذاب سے اور قبر کے عذاب سے اور زندگی اور موت میں آزمائش سے اور مسیح دجال کے فتنے کے شر سے تیری پناہ میں آتا ہوں",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": "589",
			"text": "نبی کریم ﷺ کی زوجہ حضرت عائشہ ؓ نے خبر دی کہ نبی اکرم ﷺ نماز میں ( یہ ) دعا مانگتے تھے : اے اللہ ! میں قبر کے عذاب سے تیری پنا ہ چاہتا ہوں اور مسیح دجال کے فتنے سے تیری پناہ کا طالب ہوں ، میں زندگی اور موت کے فتنے سے تیری پناہ مانگتا ہوں ، اے اللہ ! میں گناہ اور قرض ( میں پھنس جانے سے تیری پناہ چاہتا ہوں ۔ ‘ ‘ ) حضرت عائشہ ؓ نے کہا : کسی کہنے والے نے کہا : اللہ رسول ﷺ آپ قرض سے کس قدر پناہ مانگتے ہیں ! آپ ﷺ نے فرمایا : ”جب آدمی مقروض ہو جائے تو بات کرتا ہے تو جھوٹ بولتا ہے اور وعدہ کرتا ہے تو اس کی خلاف ورزی کرتا ہے ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": "588.02",
			"text": "ولید بن مسلم نےکہا : مجھے اوزاعی نے حدیث سنائی ، انہوں نے کہا : ہمیں حسان بن عطیہ نےحدیث سنائی ، کہا : مجھے محمد بن ابی عائشہ نے حدیث سنائی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہوئے سنا کہ رسول اللہ ﷺ نے فرمایا : ’’ جب تم میں سے کوئی آخر ی تشہد سے فارغ ہو جائے تو چار چیزوں سے اللہ تعالیٰ کی پناہ طلب کرے : جہنم کے عذاب سے ، قبر کے عذاب سے زندگی اور موت کی آزمائش سے اور مسیح دجال کے شر سے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": "588.03",
			"text": "ہقل بن زیاد اور عیسیٰ بن یونس دونوں نے اوزاعی کی مذکورہ سند سے یہی حدیث روایت کی ، ا س میں ہے ، آپ نے فرمایا : ’’جب تم میں سے کوئی تشہد سے فارغ ہو ۔ ۔ ۔ ۔ ۔ ‘ ‘ انھوں نے الآخر ( آخری تشہد ) کے الفاظ نہیں کہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": "588.04",
			"text": "ہشام نے یحییٰ سے اور انھوں نے ابو سلمہ سے روایت کی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے : اللہ کے نبی ﷺ نے دعا کی : ’’اے اللہ ! میں قبر کے عذاب سے تیری پناہ میں آتا ہوں اور آگ کے عذاب سے اور زندگی اور موت کی آزمائش سے اور مسیح دجال کے شر سے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": "588.05",
			"text": "عمرو ( بن دینار ) نے طاؤس سے روایت کی ، انھوں نے کہا : میں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے کہ رسول اللہ ﷺ نے فرمایا : ’’اللہ کے عذاب سے اللہ کی پناہ طلب کرو ، قبر کے عذاب سے اللہ کی پناہ مانگوں ، مسیح دجال کے فتنے سے اللہ کی پناہ طلب کرو اور زندگی اور موت کے فتنے سے اللہ کی پناہ مانگو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": "588.06",
			"text": "طاوس کے بیٹے ( عبداللہ ) نے اپنے والد طاوس سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے اسی کی ماند روایت یک",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": "588.07",
			"text": "اعرج نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے اسی کی مانند روایت کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": "590",
			"text": "طاوس نے حضرت ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ ان ( سب صحابہ ) کو اس دعا کی تعلیم اسی طرح دیتے تھے جس طرح انھیں قرآن مجید کی کسی سورت کی تعلیم دیتے تھے ۔ آپ فرماتے تھے : ’’سب کہو : اے اللہ ! ہم جہنم کے عذاب سے تیری پناہ مانگتے ہیں اور میں قبر کے عذاب سے تیری پناہ مانگتا ہوں اور مسیح دجال کے فتنے سے تیری پناہ مانگتا ہوں اور زندگی اور موت کے فتنے سے تیری پناہ مانگتا ہوں ۔ ‘ ‘ امام مسلم  نے کہا مجھے یہ بات پہنچی کہ طاوس نے اپنے بیٹے سے پوچھا : کیا تم نے اپنی نماز میں یہ دعا مانگی ہے ؟ اس نے جواب دیا : نہیں ۔ اس پرطاوس نے کہا : دوبارہ نماز پرھو کیونکہ انھوں نے ( حدیث میں مذکور ) یہ دعا تین یا چار صحابہ سے روایت کی یا جیسے انھوں نے کہا ۔ ( یعنی جتنے صحابہ سے انھوں نے کہا ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": "591",
			"text": "ولید نے اوزاعی سے ، انہوں نے ابو عمار ۔ ان کا نام شداد بن عبداللہ ہے ۔ سے ، انھوں نے ابو اسماء سے اور انھوں نے حضرت ثوبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ جب اپنی نماز سے فارغ ہوتے تو تین دفعہ استغفار کرتےاور اس کے بعد کہتے : اللہم انت السلام و منك السلام ، تباركت ذاالجلال والاكرام ’’ اے اللہ ! تو ہی سلام ہے اور سلامتی تیری ہی طرف سے ہے ، تو صاحب رفعت و برکت ہے ، اے جلال والے اور عزت بخشنے والے ! ‘ ‘ ولید نے کہا : میں نے اوزاعی سے پوچھا : استغفار کیسے کیا جائے ؟ انھوں نے کہا : استغفر اللہ ، استغفر اللہ کہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": "592.01",
			"text": "ابو بکر بن ابی شبیہ اور ابن نمیر نے حدیث بیان کی ، کہا ہمیں ابو معاویہ نے عاصم سے حدیث سنائی ، انھوں نے عبداللہ بن حارث سے اور انھوں نے حضرت عائشہ رضی اللہ عنہم سے روایت کی ، کہا رسول اللہ ﷺ سلام پھیرنے کے بعد صرف یہ ذکر پڑھنے تک ہی ( قبلہ رخ ) بیٹھتے : اللہم ! انت السلام ومنک السلام تبارکت ذاالجلال والاکرام ’’اے اللہ ! تو ہی سلام ہے اور سلامتی تیری ہی طرف سے ہے ، تو صاحب رفعت وبرکت ہے ، اے جلال والے اور عزت بخشنے والے ! ‘ ‘ ابن نمیر کی روایت میں : یا ذالجلال والاکرام ( یا کے اضافے کے ساتھ ) ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": "592.02",
			"text": "ابو خالد احمر نے عاصم سے اسی سند کے ساتھ یہی حدیث بیان کی اور یا ذالجلال والاکرام ( یا کے اضافے کے ساتھ ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": "592.03",
			"text": "شعبہ نے عاصم اور خالد سے روایت کرتے ہوئے عبداللہ بن حارث سے حدیث بیان کی ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہم سے اور انھوں نے نبی ﷺ سے اسی کے مانند روایت کی ، مگر وہ ( شعبہ یا کے اضافے کے ساتھ ) یا ذاالجلال والاکرام کہا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1338,
			"arabicnumber": "593.01",
			"text": "منصور نے مسیّب بن رافع سے ، انھوں نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے مولیٰ وراد سے روایت کی ، انھوں نے کہا : حضرت مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ( ان کے مطالبے پر ) معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو لکھ کر بھیجا کہ جب رسول اللہ ﷺ نماز سے فارغ ہو کر سلام پھیرتے تو فرماتے : ’’ ایک اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ یکتا ہے ، اس کا کوئی شریک نہیں ، حکومت اور فرمانروائی اسی کی ہے ، وہی شکرو ستائش کا حقدار ہے اور ہر چیز پر قدرت رکھنے والا ہے ۔ اے اللہ ! جو کچھ تو کسی کودے اسے کوئی روک سکنے والا نہیں اورجس چیز کو تو روک لے کوئی اسے دے سکنے والا نہیں اور تیرے سامنے کسی شان والے کو اس کی شان کوئی فاعدہ نہیں دے سکتی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": "593.02",
			"text": "ابوبکر بن ابی شیبہ ، ابو کریب اور احمد بن سنان نے ہمیں حدیث بیان کی ، ان سب نے کہا : ہمیں ابو معاویہ نے اعمش سےحدیث سنائی ، انھوں نے مسیب بن رافع سے ، انھون نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے مولیٰ وراد سے ، انھوں نےحضرت مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے اسی طرح روایت بیا ن کی ۔ ابو بکر اور ابو کریب نے اپنی روایت میں : ( وراد نے ) کہا : مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے یہ بات مجھے لکھوائی اور میں نے یہ بات حضرت معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف لکھ بھیجی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": "593.03",
			"text": "ابن عون نے ابو سعید سے ، انھوں نے ورّاد سے ۔ جو مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کےکاتب تھے ۔ روایت کی ، کہا : معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےمغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی طرف لکھا ( مسئلہ دریافت کیا ) ۔ ۔ ۔ ۔ ۔ ۔ ( آگے ) منصور اور اعمش کی حدیث کے مطابق ( ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": "593.04",
			"text": "سفیان نے کہا : ہمیں عبدہ بن ابی لبابہ اور عبدالملک بن عمیر نے حدیث سنائی ، انھوں نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے کاتب ورّاد سے سنا ، وہ کہتے تھے : حضرت معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو خط لکھا کہ مجھے کوئی ایسی چیز لکھ\tبھیجیں جو آپ نے رسول اللہ ﷺ سے سنی ہو ، تو انھوں نے لکھ بھیجا کہ میں نے رسول اللہ ﷺ سے سنا ، جب آپ نماز ختم کر لیتے تو فرماتے : لاإله إلا الله وحده لاشريك له ، له مالملك ولاه الحمد ، وهو علي كل شيء قدير ، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذالجد منك الجد ’’ اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا اور یکتا ہے ، اس کا کوئی شریک نہیں ، حکومت اور فرمانروائی اسی کی ہے ، وہی شکرو ستائش کا حقدار ہے اور وہی ہر چیز پر قدرت رکھنے والا ہے ۔ اے اللہ ! جو کچھ تو کسی کو دینا چاہے اسے کوئی روک سکنے والا نہیں اور تیرے سامنے کسی شان والے کو اس کی شان کوئی فائدہ نہیں دے سکتی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": "593.05",
			"text": "سفیان نے کہا : ہمیں عبدہ بن ابی لبابہ اور عبدالملک بن عمیر نے حدیث سنائی ، انھوں نے مغیرہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے کاتب ورّاد سے سنا ، وہ کہتے تھے : حضرت معاویہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مغیرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو خط لکھا کہ مجھے کوئی ایسی چیز لکھ\tبھیجیں جو آپ نے رسول اللہ ﷺ سے سنی ہو ، تو انھوں نے لکھ بھیجا کہ میں نے رسول اللہ ﷺ سے سنا ، جب آپ نماز ختم کر لیتے تو فرماتے : لاإله إلا الله وحده لاشريك له ، له مالملك ولاه الحمد ، وهو علي كل شيء قدير ، اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذالجد منك الجد ’’ اللہ کے سوا کوئی عبادت کے لائق نہیں ، وہ اکیلا اور یکتا ہے ، اس کا کوئی شریک نہیں ، حکومت اور فرمانروائی اسی کی ہے ، وہی شکرو ستائش کا حقدار ہے اور وہی ہر چیز پر قدرت رکھنے والا ہے ۔ اے اللہ ! جو کچھ تو کسی کو دینا چاہے اسے کوئی روک سکنے والا نہیں اور تیرے سامنے کسی شان والے کو اس کی شان کوئی فائدہ نہیں دے سکتی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": "594.01",
			"text": "محمد کے والد عبداللہ بن نمیر نے کہا : ہمیں ہشام نے ابو زبیر سے حدیث سنائی ، کہا : ( عبداللہ ) زبیر رضی اللہ عنہما سلام پھیر کر ہر نماز کے بعد یہ کلمات کہتے تھے : ’’ ایک اللہ کے سوا کوئی عبادت کے لائق نہیں ، اس کا کوئی شریک نہیں ، حکومت اور فرمانروائی اسی کی ہے اور وہی شکر و ستائش کا حقدار ہے اور وہی ہر چیز پر قادر ہے ۔ گناہوں سے بچنے کی توفیق اور نیکی کرنے کی قوت اللہ ہی سے ( ملتی ) ہے ، اس کے سوا کوئی الہ و معبود نہیں ۔ ہم اس کےسوا کسی کی بندگی نہیں کرتے ، ہر طرح کی نعمت اور سارا فضل و کرم اسی کا ہے ، خوبصورت تعریف کا سزا وار بھی وہی ہے ، اللہ کے سوا کوئی معبود نہیں ، ہم اس کے لیے دین میں اخلاص رکھنے والے ہیں ، چاہے کافر اس کو ( کتنا ہی ) نا پسند کریں ۔ ‘ ‘ اور کہا کہ رسو ل اللہ ﷺ ہر نماز کے بعد بلند آواز سے لا الہ الا اللہ والے یہ کلمات کہا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": "594.02",
			"text": "عبدہ بن سلیمان نے ہشام بن عروہ سے اور انھوں نے اپنے خاندان کے مولیٰ ابو زبیر سے روایت کی کہ حضرت عبداللہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ہر نماز کے بعد بلند آواز سے پڑھتے تھے ( آگے ) ابن نمیر کی روایت کے مانند ہے اور انھوں نے اپنی حدیث کے آخر میں کہا : پھر ابن زبیر کہتےکہ رسول اللہ ﷺہر نماز کے بعد ان ( کلمات ) کو بلند آواز سے کہتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": "594.03",
			"text": "(ہشام کے بجائے ) حجاج بن ابی عثمان نے مجھے حدیث بیان کی ، کہا : مجھ سے ابو زبیر نے حدیث بیان کی کہا : میں نے عبداللہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ اس منبر پر خطبہ دے رہے تھے اور کہہ رہے تھے کہ رسول اللہ ﷺ نماز یا نمازوں کے آخر میں سلام پھیرنے کے بعد کہا کرتے تھے ۔ ۔ ۔ ۔ ۔ ۔ ۔ ( آگے ) ہشام بن عروہ کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": "594.05",
			"text": "موسیٰ بن عقبہ سے روایت ہے کہ ابو زبیر مکی نے انھیں حدیث سنائی کہ انھوں نے عبداللہ بن زبیر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، جب وہ نماز کے بعد سلام پھیرتے تو کہتے ۔ ۔ ۔ ( بقیہ روایت ) ان دونوں ( ہشام اور حجاج ) کی ( مذکورہ بالا ) روایت کے مانند ہے ، اور آخر میں کہا : وہ اسے رسو ل اللہ ﷺ سے بیان کیا کرتے تھے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": "595.01",
			"text": "عاصم بن نضر تیمی نے کہا : ہمین معتمر نے حدیث سنائی ، کہا : ہمین عبیداللہ نے حدیث سنائی نیز ( ایک اور سند سے ) قتیبہ بن سعید نے کہا : ہمیں لیث نے ابن عجلان سے حدیث سنائی ، ان دونوں ( عبیداللہ اور ابن عجلان ) نے سًمَیّ سے ، انھوں نے ابو صالح سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ۔ ۔ یہ قتیبہ کی روایت کردہ حدیث ہے ۔ کہ کچھ تنگدست مہاجر رسو ل اللہ ﷺ کی خدمت میں حاضر ہوئے اور گزارش کی : بلند درجے اور دائمی نعمت تو زیادہ مال والے لوگ لے گئے ! آپ نے پوچھا : ’’ وہ کیسے ؟ ‘ ‘ انھوں نے کہا : وہ اسی طرح نمازیں پڑھتے ہیں جس طرح ہم پڑھتے ہیں ، وہ اسی طرح روزے رکھتے ہیں جیسے ہم رکھتے ہیں اور وہ صدقہ کرتے ہیں جبکہ ہم صدقہ نہیں کر سکتے ، وہ ( بندھے ہوؤں اور غلاموں کو ) آزاد کرتے ہیں جبکہ ہم آزاد نہیں کر سکتے تو رسو ل اللہ ﷺ نے فرمایا ’’تو کیا پھر میں تمھیں اسی چیز نہ سکھاؤں جس سے تم ان لوگوں کو پالو گے جو تم سے سبقت لے گے ہیں اور اس کے ذریعے سے ان سے بھی سبقت لے جاؤ گے جو تم سے بعد ( آنے والے ) ہیں ؟ اور تم سے وہی افضل ہو گا جو تمھاری طرح عمل کرے گا ۔ ‘ ‘ انھوں نے کہا : کیوں نہیں اے اللہ کے رسول ! ( ضرور بتائیں ۔ ) آپ نے فرمایا : ’’تم ہر نماز کے بعد تینتیس مرتبہ تسبیح : تکبیر اور تحمید ( سبحان اللہ : اللہ اکبر ، اور الحمد اللہ ) کا ورد کیا کرو ‘ ‘ ابو صالح نےکہا : فقرائے مہاجرین دوبارہ رسو ل اللہ ﷺ کے پاس حاضر ہوئے اور کہنے لگے : ہمارے مالدار بھائیوں نے بھی جو ہم کرتے ہیں اس کے بارے میں سن لیا ہے اور اسی طرح عمل کرنا شروع کر دیا ہے ( وہ بھی تسبیح ، تکبیر اور تحمید کرنے لگے ہیں ۔ ) تو رسول اللہ ﷺ نے فرمایا : ’’ یہ اللہ کا فضل ہے جسے چاہے عنایت فرمادے ۔ ‘ ‘ قتیبہ کے علاوہ لیث سے ابن عجلان کے حوالے سے دیگر روایت کرنے والوں نے یہ اضافہ کیا کہ سمی نے کہا : میں نے یہ حدیث اپنے گھر کے ایک فرد کو سنائی تو انھوں نے کہا : تمھیں وہم ہوا ہے ، انھوں ( ابو صالح ) نے تو کہا تھا : ’’تینتیس مرتبہ سبحان اللہ کہو ، تینتیس بار الحمد اللہ کہو اور تینتیس بار اللہ اکبر کہو ۔ ‘ ‘ میں دوبارہ ابو صالح کی خدمت میں حاضر ہوا اور انھیں یہ بتا یا تو انھوں نے میرا ہاتھ پکڑ کر کہا : اللہ اکبر ، سبحان اللہ اور الحمد اللہ ، اللہ اکبر ، سبحان اللہ اور الحمد اللہ ( اس طرح کہو ) کہ سب کی تعداد تینتیس ہو جائے ۔ ابن عجلان نے کہا : میں نے یہ حدیث رجاء بن حیوہ کو سنائی تو انھوں نے مجھے ابو صالح کے واسطے سے ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے ، انھوں نے رسول اللہ ﷺ سے ( روایت کرتے ہوئے ) اسی کی مانند حدیث سنائی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": "595.02",
			"text": "امیہ بسطام عیشی نے مجھے حدیث سنائی ، کہا : ہمیں یزید بن زریع نےحدیث سنائی ، کہا ہمیں روح نے سہیل سے حدیث سنائی انھون نے اپنے والد ( ابو صالح سے ) سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھون نے رسو اللہ ﷺ سے روایت کی کہ لوگوں نے کہا : اے اللہ کے رسول ! بلند مراتب اور دائمی نعمتیں تو زیادہ مال والے لوگ لے گئے ۔ ۔ ۔ جس طرح لیث سےقتیبہ کی بیان کی ہوئی حدیث ہے ، مگر انھوں نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی حدیث میں ابو صالح کا یہ قول داخل کر دیا ہے کہ پھر فقراء مہاجرین لوٹ کر آئے ، حدیث کے آخر تک ۔ اور حدیث میں اس بات کا اضافہ کیا : سہیل کہتے تھے : ( ہر کلمہ ) گیارہ گیارہ دفعہ اور یہ سب ملا کر تینتیس بار ۔ ( یہ سہیل کا اپنا فہم تھا ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": "596.01",
			"text": "مالک بن مغول نے ہمیں خبر دی ، کہا : میں نے حکم بن عتیبہ سے سنا ، وہ عبدالرحمن بن ابی لیلیٰ سے حدیث بیان کررہے تھے ، انھوں نے حضرت کعب بن عجرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے رسو ل اللہ سے روایت کی ، آپ نے فرمایا : ’’ ( نماز کے یا ) ایک دوسرے کے پیچھے کہے جانے والے ایسے کلمات ہیں کہ ہرفرض نماز کے بعد انھیں کہنے والا ۔ ۔ یا ان کو ادا کرنے والا ۔ کبھی نامراد و ناکام نہیں رہتا ، تینتیس بار سبحان اللہ ، تینتیس بار الحمد اللہ اورچونتیس با ر اللہ اکبر ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": "597.01",
			"text": "خالد بن عبداللہ نے ہمیں سہیل سے خبر دی ، انھوں نے ابو عبید مذحجی سے روایت کی ۔ امام مسلم رحمۃ اللہ نے کہا : ابو عبید سلیمان بن عبدالملک کے مولیٰ تھے ۔ انھوں نے عطاء بن یزید لیثی سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے رسو ل اللہ ﷺ سے روایت کی : ’’جس نے ہر نماز کے بعد تینتیس مرتبہ سبحان اللہ تینتیس دفعہ الحمد اللہ اور تینتیس بار اللہ اکبر کہا ، یہ ننانوے ہو گے اور سو پورا کرنے کے لیے لا الہ الا اللہ وحد ہ لا شریک لہ ، لہ الملک ولاہ الحمد ، وہو علی کل شیء قدیر ‘ ‘ کیا اس کے گناہ معاف کر دیے جائیں گے ، چاہے وہ سمندر کے جھاگ کے برابر ہوں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": "597.02",
			"text": "اسماعیل بن زکریا نے سہیل سے ، انھوں نے ابو عبید سے ، انھوں نے عطاء سے اور انھوں نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا رسول اللہﷺ نے فرمایا ، آگے ( مذکورہ بالا روایت ) کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": "599",
			"text": "حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ فرماتے ہیں کہ رسول اللہ ﷺ جب دوسری رکعت سے اٹھتے تو ( الحمد اللہ رب العٰلمین ) سے قراءت کا آغاز کر دیتے ( کچھ دیر ) خاموشی اختیار نہ فرماتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": "600",
			"text": "حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ ایک آدمی آیا اور صف میں شریک ہوا جبکہ اس کی سانس چڑھی ہوئی تھی ، اس نے کہا : الحمد اللہ حمد کثیر طیبا مبارکا فیہ ’’ تمام حمد اللہ ہی کے لیے ہے ، حمد بہت زیادہ ‘ پاک اور برکت والی حمد ۔ ‘ ‘ جب رسو ل اللہ ﷺ نےنماز پوری کرلی تو آپ نے پوچھا ’’تم میں سے یہ کلمات کہنے والا کون تھا ؟ ‘ ‘ سب لوگوں نے ہونٹ بند رکھے ۔ آپ نے دوبارہ پوچھا ’’تم میں یہ کلمات کہنے والا کون تھا؟ اس نے کوئی ممنوع بات نہیں کہی ۔ ‘ ‘ تب ایک شخص نے کہا : میں اس حالت میں آیا کہ میری سانس پھولی ہوئی تھی تو میں نے اس عالم میں یہ کلمات کہے ۔ آپ نے فرمایا : میں نے بارہ فرشتوں کو دیکھا جو ( اس میں ) ایک دوسرے سے سبقت لے جانے کی کوشش کر رہے تھے کہ کون اسے اوپر لے جاتا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": "601",
			"text": "حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھون نے کہا : ایک دفعہ ہم رسول اللہ ﷺ کے ساتھ نماز پڑھ رہے تھے کہ لوگوں میں سے ایک آدمی نے کہا : اللہ اکبر کبیرا ، والحمد للہ کثیرا ، وسبحان اللہ بکرۃ واصیلا ’’اللہ سب سے بڑا ہے بہت بڑا ، اور تمام تعریف اللہ کے لیے ہے بہت زیادہ اور تسبیح اللہ ہی کے لیے ہے ، صبح و شام ۔ ‘ ‘ رسول اللہ ﷺ نے پوچھا : ’’فلاں فلاں کلمہ کہنے والا کون ہے ؟ لوگوں میں سے ایک آدمی نے کہا : اللہ کےرسول ! میں ہوں آپ نے فرمایا ’’مجھے ان پر بہت حیرت ہوئی ، ان کے لیے آسمان کے دروازے کھول دیے گئے ۔ ‘ ‘ ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں نے جب سے آپ سے یہ بات سنی ، اس کےبعد سے ان کلمات کو کبھی ترک نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": "602.01",
			"text": "مختلف سندوں سے سعید بن مسیب اور ابو سلمہ بن عبدالرحمن نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا ’’جب نمازکھڑی ہو جائے تو اس کے لیے دوڑتے ہوئے نہ آؤ ، ( بلکہ اس طرح ) چلتے ہوئے آؤ کہ تم پر سکون طاری ہو ۔ ( نماز کا ) جو حصہ پالو اسے پڑھ لو اور جو رہ جائے اسے پورا کر لو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": "602.02",
			"text": "(سعید بن مسیب اور ابو سلمہ کے بجائے ) عبدالرحمان بن یعقوب نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’جب نماز کی تکبیر کہہ دی جائے تو تم اس کےلیے بھاگتے ہوئے مت آؤ ، اس طرح آؤ کہ تم پر سکون ہو ، ( نماز کا ) جتنا حصہ پالو ، پڑھ لو اور جو رہ جائے اسے پورا کر لو کیونکہ جب کوئی شخص نماز کا ارادہ کرکے آتا ہےتو وہ نماز ( ہی ) میں ہوتا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": "602.03",
			"text": "ہمام بن منبہ نے کہا : یہ احادیث ہیں جو ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے رسو ل اللہ ﷺ سے ( سن کر ) ہمیں سنائیں ، انھوں نے متعدد احادیث ذکر کیں ، ان مین سے یہ بھی تھی کہ رسول اللہ ﷺ نے فرمایا : ’’جب نماز کے لیے بلاوا دیا جائے تو اس کے لیے چلتے ہوئے آؤ ، اور تم پر سکون ( طاری ) ہو ، جو ( نماز کا حصہ ) مل جائے ، وہ پڑھ لو اور جو رہ جائے اسے مکمل کر لو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": "602.04",
			"text": "محمد بن سیرین نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ’’جب نماز کے لیے اقامت کہہ دی جائے تو تم میں سے کوئی شخص اس کی طرف بھاگ کر نہ آئے بلکہ اس طرح چل کر آئے کہ اس پر سکون وقار طار ی ہو ، جتنی ( نماز ) پا لو ، پڑھ لو اور جو تمھارے ( پہنچنے ) سے پہلے گزر چکی اسے پورکر لو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": "603.01",
			"text": "معاویہ بن سلام نے یحییٰ بن ابی کثیر سے روایت کی کہا : عبداللہ بن ابی قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مجھے خبر دی کہ ان کے والد نے انھیں بتایا ، کہا : ہم ( ایک بار ) جب رسو ل اللہ ﷺ کے ساتھ نماز پڑھ رہے تھے تو آپ نے ( جلدی چلنے ، دوڑ کر پہنچنے کی ) ملی جلی آواز یں سنیں ، آپ نے ( نماز کے بعد ) پوچھا : ’’تمھیں کیا ہوا ( تھا ؟ ) ‘ ‘ لوگوں نے جواب دیا ہم نے نماز کے لے جلید کی ۔ آپ نے فرمایا : ’’ایسے نہ کیا کرو ، جب تم نماز کے لیے آؤ تو سکون و اطمینان محلوظ رکھو ، ( نماز کاحصہ ) جو تمھیں مل جائے ، پڑھ لو ارو جو گز ر جائے اسے پورا کر لو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": "603.02",
			"text": "(معاویہ کے بجائے ) شبیان نے ( یحییٰ سے ) اسی سند کے ساتھ یہی روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": "605.01",
			"text": "یونس نے ابن شہاب ( زہری ) سے خبر دی ، انھوں نے کہا : مجھے ابو سلمہ عبدالرحمن بن عوف نے خبر دی ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہتے تھے ، ( رسول اللہ ﷺ کے زمانے میں ) اقامت کہی گئی ، ہم اپنی طرف رسول اللہ کے آنے سے پہلے ہی کھڑے ہو گئے اور اپنے مصلے پر کھڑے ہو گئے آپ نے اللہ اکبر نہیں کہا تھا کہ آپ کو ( کچھ ) یاد آگیا ، اس پر آپ واپس پلٹ گئے اور ہمیں فرمایا : ’’اپنی جگہ پر رہو ۔ ‘ ‘ ہم آپ کے انتظار میں کھڑے رہے یہاں تک کہ آب تشریف لے آئے ، آب غسل کیے ہوئے تھے اور آب کے سر سے پانی کے قطرے ٹپک رہے تھے ، پھر آپ نے اللہ اکبر کہا اور ہمیں نماز پڑھائی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": "605.02",
			"text": "زہیر بن حرب نے بیان کیا کہ ہمیں ولید بن مسلم نے حدیث سنائی ، ( کہا ) : ابو عمرو ، یعنی اوزاعی نے حدیث سنائی ، کہا : ہمیں زہری نے ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کرتے ہوئے حدیث سنائی کہا : نماز کی اقامت کہہ دی گئی ، لوگوں نے اپنی صفیں باندھ لیں اور رسول اللہ ﷺ تشریف لا کر اپنی جگہ پر کھڑے ہو گئے پھر آپ نے لوگوں کو ہاتھ کے اشارے سے فرمایا : ’’اپنی جگہ پر رہو ۔ ‘ ‘ اور خود ( مسجد سے ) باہر نکل گئے ، پھر ( آئے تو ) آپ غسل فرما چکے تھے اور آپ کے سر سے پانی ٹپک رہا تھا ، پھر آپ نے انھیں نماز پڑھائی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": "605.03",
			"text": "ابراہیم بن موسیٰ نےمجھے حدیث بیان کی ، کہا ہمیں ولید بن مسلم نےباقی ماندہ اسی سند کے ساتھ خبر دی کہ رسول اللہ ﷺ کے لیے اقامت کہی جاتی تو اس سے پہلے کہ نبی اکرم ﷺ ( اپنی جگہ پر ) کھڑے ہوں لوگ صفوں میں اپنی اپنی جگہ لے لیتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": "606",
			"text": "حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے فرمایا ، جب سورج ڈھل جاتا تو بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ ظہر کی اذان کہتے اور رسول اللہ ﷺ کے نکلنے تک تکبیر نہ کہتے ۔ جب آپ حجرے سے نکلتے تو آپ کو دیکھ کر اقامت کہتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": "607.01",
			"text": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالک کے سامنے ابن شہاب زہری سے روایت کردہ حدیث پڑھی انھوں نے ابو سلمہ بن عبدالرحمن سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ نبی اکرم ﷺ نے فرمایا : ’’ جس نے نماز کی ایک رکعت پالی ، یقینا اس نے نماز پالی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": "607.02",
			"text": "(امام مالک کے بجائے ) یونس نے ابن شہاب زہری سے ، انھوں نے ابو سلمہ بن عبدالرحمن سےاور انھوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’ جس نے امام کے ساتھ نماز کی ایک رکعت پالی ، اس نے نماز پالی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": "607.03",
			"text": "سفیان بن عیینہ ، معمر ، اوزاعی ، یونس اور عبید اللہ سب نے زہری سے روایت کی ، انھوں نے ابو سلمہ بن عبدالرحمن سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نبی ﷺ سے یحییٰ کی امام مالک سے مذکورہ بالا روایت کی طرح حدیث بیان کی اور ان میں سے کسی کی حدیث میں مع الامام ( امام کے ساتھ ) کے الفاظ نہیں ہیں ۔ اور عبید اللہ کی حدیث میں ہے : ’’تو یقینا اس نے مکمل نماز پالی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": "608.01",
			"text": "امام مالک نےزید بن اسلم سے روایت کی ، انھیں عطاء بن یسار ، بسربن سعید اور اعرج نے حدیث بیان کی ، ان سب نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’ جس نے سورج نکلنے سے پہلے صبح کی ایک رکعت پالی تو یقینا اس نے صبح ( کی نماز ) پالی اورجس نے سورج کے غروب ہونے پہلے عصر کی ایک رکعت پالی تو یقینا اس نے عصر ( کی نماز ) پالی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": "608.02",
			"text": "حضرت عائشہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا : رسول اللہ ﷺ نے فرمایا : ’’ جس نے سورج کے غروب ہونے سے پہلے عصر کی نماز کا ایک سجدہ پالیا سورج کے نکلنے سے پہلے صبح کی نماز کا تو یقینا اس نے اس نماز کو پالیا ۔ ‘ ‘ ( ان شہاب نے کہا : ) سجدے سے مراد رکعت ہی ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": "609",
			"text": "معمر نے زہری سے ، انھوں نے ابو سلمہ سے ، اور انھوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اسی طرح روایت کی جس طرح امام مالک نے زید بن اسلم سے روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": "608.03",
			"text": "عبداللہ بن مبارک نے معمر سے ، انھوں نے ابن طاوس سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت ( عبداللہ ) بن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ’’ جس نے سورج کے غروب ہونے سے پہلے عصر کی نماز میں سے ایک رکعت پالی تو یقینا اس نے ( نماز ) پالی اور جس نے سورج نکلنے سے پہلے فجر کی ایک رکعت پالی تو یقینا اس نے ( نماز ) پالی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": "608.04",
			"text": "معتمر نے کہا : میں نے معمر سے سنا ۔ ۔ ۔ ۔ ۔ ۔ آگے اسی سند سے ( روایت کی ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": "610.01",
			"text": "لیث نے ابن شہاب سے روایت کی کہ ایک دن عمر بن عبدالعزیز نےعصر کی نمازمیں کچھ تاخیر کردی تو عروہ نے ان سے کہا : بات یوں ہے کہ جبریل ‌رضی ‌اللہ ‌عنہ ‌ ‌ نازل ہوئے اور امام بن کر رسول اللہ ﷺ کو نماز پڑھائی ۔ تو عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ان سے کہا : اے عروہ ! جان لیں ( سمجھ لیں ) آپ کیا کہہ رہے ہیں ! انھوں نے کہا : میں نے بشیر بن ابی مسعود سے سنا ، وہ کہتے تھے : میں نے ابو مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، انھوں نے کہا ، میں نے رسول اللہ ﷺ سے سنا ، آپ نے فرما رہے تھے : ’’جبرئیل اترے اور انھوں نے ( نمازمیں ) میری امامت کی ، میں نے ان کے ساتھ نماز پڑھی ، پھر میں نے ان کے ساتھ نماز پڑھی ، پھر ان کے ساتھ نماز پڑھی ، پھر ان کے ساتھ نماز پڑھی ، پھر ان کے ساتھ نماز پڑھی ۔ ‘ ‘ وہ اپنی انگلیوں سے پانچ نمازیں شمار کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": "610.02",
			"text": "امام مالک نے ابن شہاب زہری سے روایت کی کہ ایک دن عمر بن عبدالعزیز نے نماز میں تاخیر کر دی تو عروہ بن زبیر ان کے پاس آئے اور انھیں بتایا کہ مغیر ہ بن شعبہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ایک دن نماز دیر سے پڑھی اس وقت وہ کوفہ میں تھے ابو مسعود انصاری رحمۃ اللہ علیہ ان کے پاس آئے اور کہا : مغیرہ !یہ کیا ہے ؟ کیا آپ کو پتہ نہیں کہ جبریل ‌علیہ ‌السلام ‌ اترے تھے ، انھوں نے نماز پڑھائی تو رسول اللہ ﷺ نے ( ان کے ساتھ ) نماز پڑھی ، پھر انھوں نے نماز پڑھی تو رسول اللہ ﷺ نے نماز پڑھی ، پھر انوں نے نماز پڑھی اور رسول اللہ ﷺ نے ( ان کے ساتھ ) نماز پڑھی ، پھر انھوں نے نماز پڑھی تو رسو ل اللہ ﷺ نے ( ان کے ساتھ ) نماز پڑھی ، پھر ( جبرئیل نے ) کہا : مجھے اس کا حکم دیا گیا ہے ۔ تو عمر نے عروہ سے کہا : عروہ ! دیکھ لو ، کیا کہہ رہے ہو ؟ کیا جبرئیل نے خود ( آکر ) رسول ) اللہ ﷺ کے لیے ( ہر ) نماز کا وقت متعین کیا تھا ؟ تو عروہ نے کہا بشر بن ابی مسعود اپنے والد سے ایسے ہی بیان کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": "611.01",
			"text": "زہر ی سے امام مالک کی سابقہ سند ہی سے روایت ہے کہ عروہ نے کہاے : مجھے نبی اکرم ﷺ کی زوجہ حضرت عائشہ رضی اللہ تعالٰی عنہا نے بتایا کہ رسول اللہ ﷺ عصر کی نماز ( اس وقت ) پڑھتے کہ دھوپ ان کے حجرے میں ہوتی ، ( حجرے میں سے ) دھوپ باہر نکلنے سے پہلے ۔ ( مغربی دیوار کا سایہ حجرے کے دروازے تک نہ پہنچا ہوتا ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": "611.02",
			"text": "ابوبکر بن ابی شبیہ اور عمرو ناقد نے حدیث سنائی ، عمرو نے کہا : سفیان نے ہمیں زہری سے حدیث سنائی ، انھوں نے عروہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی اکرم ﷺ عصر کی نماز پڑھتے تھے اور سورج میرےحجرے میں چمک رہا ہوتا تھا ، ابھی ( صحن کے مشرق حصے میں ) سایہ نہ پھیلاہوتا تھا ۔ ابو بکر نے ( معنی کے وضاحت کرتے ہوئے ) کہا : ابھی ( مشرق کی طرف ) سایہ ظاہر نہ ہوا ہوتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": "611.03",
			"text": "یونس ابن شہاب سے روایت کی ، کہا مجھے عروہ بن زبیر نے بتایا کہ مجھے نبی اکرم ﷺ کی زوجہ حضرت عائشہ نے خبر دی کہ رسو ل اللہ ﷺ عصر کی نماز اس وقت پڑھتے تھے جبکہ دھوپ ان کےحجرے میں ہوتی ( مشرق کی طرف پھیلتا ) سایہ ان کے حجرے میں نہ پھیلا ہوتا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": "611.04",
			"text": "ہشام نے اپنے والد عروہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسو ل اللہ ﷺ عصر کی نماز پڑھتے اور دھوپ میرے حجرے میں پڑ رہی ہوتی تھی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": "612.01",
			"text": "معاذ بن ہشام نے ہمیں اپنے والد سے حدیث بیان کی انھوں نے قتادہ سے ، انھوں نے ابو ایوب سے اور انھوں نے حضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہا سےروایت کی کہ نبی اکرمﷺ نے فرمایا : ’’جب تم فجر کی نماز پڑھو تو سورج کاپہلا کنارہ نمودار ہونے تک اس کا وقت ہے ، پھر جب تم ظہر پڑھو تو عصر ہونے تک اس کا وقت ہے اور جب تم عصر پڑھو تو سورج کے زرد ہونے تک اس کا وقت ہے اور جب تم مغرب پڑھو تو شفق ( سرخی ) کے ختم ہونے تک اس کا وقت ہے اور جب تم عشاء پڑھو تو آدھی رات ہونے تک اس کا وقت ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1386,
			"arabicnumber": "612.02",
			"text": "معاذ عنبری نے کہا : ہمیں شعب نے قتادہ سے ، انھوں نے ابو ایوب سے حدیث سنائی ۔ ابو ایوب کا نام یحییٰ بن مالک ازدی ہے ۔ ان کو مراغی بھی کہا جاتا ہے اور مراغ قبیلہ ازدہی کی ایک شاخ ہے ۔ انھوں نے حضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہا سے اور انھوں نے نبی اکرم ﷺ سے روایت کی کہ آپ ﷺ نے فرمایا ’’ظہر کا وقت تب تک ہےجب تک عصر کا وقت شروع نہ ہو ، اور عصر کا وقت ہے جب تک سورج زرد نہ ہو ، اور مغرب کا وقت ہے جب تک شفق غروب نہ ہو ، اور عشاء کا وقت آدھی رات تک ہے اور فجر کا وقت ہے جب تک سورج طلوع نہ ہو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1387,
			"arabicnumber": "612.03",
			"text": "ابو عامر عقدی اور یحییٰ بن ابی بکیر نے شعب سے اسی سند کے ساتھی یہی حدیث بیان کی ۔ ان دونوں کی روایت میں ، شعبہ نے کہا : انھوں ( قتادہ ) نے ایک بار اس حدیث کو مرفوع بیان کیا اور دوبار مرفوع بیان نہیں کیا ۔ ( مرفوع وہ ہے جس کی سند رسو ل اللہ ﷺ تک پہنچے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1388,
			"arabicnumber": "612.04",
			"text": "ہمام نے ہمیں حدیث بیان کی ( کہا ) : ہمیں قتادہ نے اوب ایوب سے حدیث سنائی ، انھوں نے حضرت عبداللہ بن عمرو ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا ’’ ظہر کا وقت ( شروع ہوتا ہے ) جب سورج ڈھل جائے اور آدمی کا سایہ اس کے قد کے برابر ہو ( جانے تک ) ، جب تک عصر کا وقت نہیں ہو جاتا ( رہتا ہے ) اور عصر کا وقت ( ہے ) جب تک سورج زرد نہ ہو جائے اور مغر بکا وقت ( ہے ) جب تک سرغی غائب نے ہو جائے اور عشاء کی نماز کا وقت رات کے پہلے نصف تک ہے اور صبح کی نماز کا وقت طلوع فجر سے اس وقت تک ( ہے ) جب تک سورج طلوع نہیں ہوتا ، جب سورج طلوع ہو نے لگے تو نماز سے رک جاؤ کیونکہ وہ شیطان کے دو سینگوں کے درمیان نکلتا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1389,
			"arabicnumber": "612.05",
			"text": "حجاج نے جو حجاج اسلمی کے بیٹے ہیں ، قتادہ سے ، انھوں نے ابو ایوب سے اور انھوں نے حضرت عبداللہ بن عمرو بن عاص ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، انھوں نے کہا کہ رسول اللہ ﷺ سے نمازوںکے اوقات کے بارے میں پوچھا گیا تو آپ نے فرمایا : فجر کی نماز کا وقت اس وقت تک ہےجب تک سورج کا پہلا کنارہ نہ نکلے ، اور ظہر کا وقت ہے جب سورج آسمان کی درمیان سے مغرب کی طرف ڈھل جائے یہاں تک کہ عصر کا وقت ہو جائے اور عصر کی نماز کا وقت ہے جب تک سورج زرد نہ ہو جائے اور اس کا ( غروب ہونے والا ) پہلا کنارہ ڈوبنے لگے ، اور مغرب کی نماز کا وقت تب ہے جب سورج غروب ہو جائےجو سرخی غائب ہونے تک رہتا ہے اور عشاء کی نماز کا وقت آدھی رات تک ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1390,
			"arabicnumber": "612.06",
			"text": "عبداللہ بن یحییٰ بن ابی کثیر نے کہا : میں نے اپنے والد کو یہ کہتے سنا : علم جسم کی راحت سے حاصل نہیں ہوسکتا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1391,
			"arabicnumber": "613.01",
			"text": "سیدنا بریدہ ؓ نے کہا : کہ نبی ﷺ سے ایک شخص نے نماز کا وقت پوچھا تو آپ ﷺ نے فرمایا : ” تم دو روز ہمارے ساتھ نماز پڑھو “ ۔ پھر جب آفتاب ڈھل گیا سیدنا بلال ؓ کو حکم دیا ، انہوں نے اذان دی ، پھر حکم دیا ، انہوں نے اقامت کہی ، پھر عصر پڑھی اور سورج بلند تھا سفید صاف پھر حکم دیا تو اقامت کہی مغرب کی جب آفتاب ڈوب گیا ، پھر حکم دیا تو اقامت کہی عشاء کی جب شفق ڈوب گئی ، پھر حکم دیا اقامت کہی فجر کی جب فجر طلوع ہوئی ، پھر جب دوسرا دن ہوا ، حکم کیا تو ظہر ٹھنڈے وقت پڑھی اور بہت ٹھنڈے وقت پڑھی اور عصر پڑھی اور سورج بلند تھا مگر روز اول سے ذرا تاخیر کی اور مغرب پڑھی شفق ڈوبنے سے پہلے اور عشاء پڑھائی تہائی رات کے بعد اور فجر پڑھی جب خوب روشنی ہو گئی ۔ پھر فرمایا : ” وہ سائل کہاں ہے جو نماز کا وقت پوچھتا تھا ؟ “ ، اس نے کہا : اے اللہ کے رسول ! میں حاضر ہوں ۔ آپ ﷺ نے فرمایا : ” یہ جو دونوں وقت تم نے دیکھا ان کے بیچ میں تمہاری نماز کا وقت ہے ۔ “",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1392,
			"arabicnumber": "613.02",
			"text": "حرمی بن عمارہ نے کہا : ہمیں شعبہ نے علقمہ بن مرثد سے حدیث سنائی ، انھوں نےسلیمان بن بریدہ سے اور انھوں نے اپنے والد سے روایت کی کہ ایک آدمی نبی اکرم ﷺ کی خدمت میں حاضر ہوا اور آپ سے نمازوں کے اوقات کے بارے میں سوال کیا آب نے فرمایا’’نمازوں میں ہمارے ساتھ موجود رہو ۔ ‘ ‘ پھر آپ نے بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دیا تو انھوں نے اندھیرے میں اذان کہی ، جب فجر طلوع ہوئی آب نے صبح کی نماز پڑھائی ، پھر جب سورج آسمان کے درمیان سے ڈھلا تو آپ نے انھیں ظہر کا حکم دیا ، پھر جب سورج ( ابھی ) اونچا تھا ، آپ نے انھیں عصر کا حکم دیا ، پھر جب سورج غروب ہوگیا تو آب نے انھیں مغرب کا حکم دیا ، پھر جب شفق نیچے چلی گئی تو انھوں نے صبح کو روشن ہونے دیا ( پھر فجر ادا کی ) ، پھر انھیں ظہر کا حکم دیا تو انھون نے اسے ٹھنڈا ہونے دیا ، پھر انھیں عصر کا حکم دیا جبکہ سورج ابھی سفید اور صاف تھا ، اس میں زردی کی کوئی آمیزش نہ تھی ، پہر انھیں شفق گر ( کر غائب ہو ) جانے سے قبل مغرب کے بارے میں حکم دیا ، پھر تہائی رات یا رات کا کچھ حصہ گزر جانے کے بعد انھیں عشاء کے بارے میں حکم دیا ۔ حرمی کو شک ہو ا ۔ پھر جب صبح ہوئی تو آپ نے پوچھا ۔ سائل کہاں ہے؟ جو تم نے دیکھا ، ان کے درمیان ( نمازوں کا ) وقت ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1393,
			"arabicnumber": "614.01",
			"text": "محمد بن عبداللہ بن نمیر نے ہمیں حدیث سنائی ( کہا : ) میرے والد نے ہمیں حدیث بیان کی کہا : ہمیں بدر بن عثمان نے حدیث سنائی ، کہا : ہمیں ابو بکر بن ابی موسیٰ نے اپنے والد سے حدیث سنائی ، انھوں نے رسول اللہ ﷺ سے روایت کی کہ آپ کے پاس ایک سائل نمازوں کے اوقات پوچھنے کے لیے حاضر ہوا تو آپ نے اسے ( زبانی ) کچھ جواب نہ دیا ۔ کہا : جب فجر کی پو پھوٹی تو آپ نے فجر کی نماز پڑھائی جبکہ لوگ ( اندھیرے کی وجہ سے ) ایک دوسرے کو پہچان نہیں پارہے تھے ، پھر جب سورج ڈھلا تو آپ نے انہیں ( بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو ) حکم دیا اور انھون نے ظہر کی اقامت کہی جبکہ سورج ابھی بلند تھا ، پھر جب سورج نیچے چلا گیا تو آپ نے انھیں حکم دیا تو انھوں نے مغرب کے اقامت کہی ، پھر جب شفق غائب ہوئی تو آپ نے انھیں حکم دیا تو انھوں عشاء کی اقامت کہی ، پھر اگلے دن فجر میں تاخیر کی ، یہاں تک کہ اس وقت سے فارغ ہوئے جب کہنے والا کہے ، سورج نکل آیا ہے یا نکلنے کو ہے ، پھر ظہر کو مؤخر کیا حتی کہ گزشتہ کل کی عصر کے قریب کا وقت ہو گیا ، پھر عصر کو مؤخر کیا کہ جب سلام پھیرا تو کہنے والا کہے : آفتاب میں سرخی آگئی ہے ، پھر مغرب کو مؤخر کیا حتی کہ شفق غروب ہونے کے قریب ہوئی ، پھر عشاء کو مؤخر کیا حتی کہ رات کی پہلی تہائی ہوگئی پھر صبح ہوئی تو آپ نے سائل کو بلوایا اور فرمایا : ’’ ( نماز کا ) وقت ان دونوں ( وقتوں ) کے درمیان ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1394,
			"arabicnumber": "614.02",
			"text": "وکیع نےبدر بن عثمان سے روایت کی ، انھون نے ابو بکر بن ابی موسیٰ سےسن کر یہ حدیث بیان کی ، انہون نے اپنے والد سے روایت کی کہ ایک سائل نبی اکرم ﷺ کے پاس حاضر ہوا اور آپ سے نمازوں کے اوقات کے بارے میں سوال کیا ۔ ۔ ۔ ۔ ۔ ( آگے ) ابن نمبر کی روایت کی طرح ہے ، سوائے اس کے کہ انھوں نے کہا : دوسرے دن آپ نے مغرب کی نماز شفق غائب ہونے سے پہلے پڑھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1395,
			"arabicnumber": "615.01",
			"text": "لیث نے ابن شہاب سے ، انھوں نے ( سعید ) بن مسیب اور ابو سلمہ بن عبدالرحمن سے اور انھوں حضرت ابو ہریرہ ﷺ سے روایت کی ، انھوں نے کہا : رسول لللہ ﷺنے فرمایا : ’’ جب گرمی شدید ہو جائے تو نماز ٹھنڈے وقت میں پڑھوکونکہ گرمی کی شدت دوزخ کی لپٹوں ( گرمی کے پھیلاؤ ) میں سے ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1396,
			"arabicnumber": "615.02",
			"text": "یونس نے بتایا ، انھیں ابن شہاب نے خبر دی ، انھوں نے کہا : مجھے ابو سلمہ اور سعید بن مسیب نے بتایا کہ ان کے دونون نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہوئے سنا کہ رسو ل اللہ ﷺ نے فرمایا ۔ ۔ ۔ بالکل اسی طرح ( جیسے سابقہ حدیث میں ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1397,
			"arabicnumber": "615.03",
			"text": "عمرو ( بن حارث بن یعقوب انصاری ) نے خبر دی کہ بکیر ( بن عبداللہ مخزومی ) نے انھیں بسر بن سعید اور سلیمان اغرّ سے حدیث سنائی اورانھوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسو ل اللہ ﷺ نے فرمایا : ’’جب گرم دن ہو تو نماز ٹھنڈے وقت میں ( پڑھو ) کیونکہ گرمی کی شدت دوزخ کی لپٹوں میں سے ہے ۔ ‘ ‘ عمرو نے کہا : اور مجھے ابو یونس نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےحدیث سنائی کہ رسول اللہ ﷺ نے فرمایا : ’’نماز کو ٹھنڈے وقت تک موخر کرو کیونکہ گرمی کی سختی جہنم کی گرمی کے پھیلاؤ ( لپٹوں ) میں سے ہے ۔ ‘ ‘ عمرو نے کہا : مجھے ابن شہاب نے بھی ( سعید ) بن مسیب اور ابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کرتے ہوئے اسی طرح اوپر ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1398,
			"arabicnumber": "615.04",
			"text": "علاء نے اپنے والد ( عبدالرحمان بن یعقوب ) سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’یہ گرمی آتش دوزخ کی لپٹوں میں سے ہے ، اس لیے نماز ٹھنڈے وقت میں پڑھو",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1399,
			"arabicnumber": "615.05",
			"text": "ہمام بن منبہ نے کہا : یہ وہ احادیث ہیں جو حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے رسول اللہ ﷺسے بیان کیں ، پھر انھوں نے کئی احادیث بیان کیں ، ان میں سے ( ایک ) یہ : اور رسول اللہ ﷺ نے فرمایا : ’’نمازوں میں گرمی سے بچنے کے لیے ( وقت ) ٹھنڈا ہونے دو کیونکہ گرمی کی شدت جہنم کی لپٹوں میں سے ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": "616",
			"text": "حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا رسول اللہ ﷺ کا مؤذن ظہر کے اذان دینے لگا تو آپ نے فرمایا : ’’ ( وقت کو ) ٹھنڈا ہونے دو ، ٹھنڈا ہونے دو ۔ ‘ ‘ یا فرمایا : انتظار کرو ، انتظار کر و ‘ ‘ ۔ اور فرمایا : ’’ بلاشبہ گرمی کی شدت جہنم کی لپٹوں میں سے ہے ، اس لیے جب گرمی شدید ہو جائے تو نماز ٹھنڈے وقت تک مؤخر کرو ۔ ‘ ‘ ابوذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا قول ہے : ( نماز میں اتنی تاخیر کی گئی ) حتی کہ ہم نے ٹیلوں کا سایہ دیکھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": "617.01",
			"text": "ابن شہاب سے روایت ہے ، کہا : مجھ سے ابو سلمہ بن عبدالرحمن نے حدیث نے حدیث بیان کی کہ انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو یہ کہتے ہوئے سنا : رسو ل اللہ ﷺ نے فرمایا : ’’آگ نےاپنے رب کے حضور شکایت کی اور کہا : اے میرے رب ! میرا ایک حصہ دوسرے کو کھارہا ہے ۔ تو اللہ نے اسے دو سانس لینے کی اجازت عطا کردی : ایک سانس سردی میں اور ایک سانس گرمی ، گرمی اور سردی کے موسم میں جو تم شدید ترسین گرمی اور شدید ترسین سردی محسوس کرتے ہو تو یہ وہی ( چیز ) ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": "617.02",
			"text": "اسود بن سفیان کے آزاد کردہ غلام عبداللہ بن یزید نے ابو سلمہ بن عبدالرحمن اور محمد بن عبدالرحمن بن ثوبان سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسو ل اللہ ﷺ نے فرمایا : ’’جب گرمی ہو تو نماز ٹھنڈے وقت تک مؤخر کر کے پڑھوکیونکہ گرمی کی شدت جہنم کی لپٹ سے ہوتی ہے ۔ ‘ ‘ اور آپ ﷺ نے یہ ( یہ بھی ذکر فرمایا : ) ’’جہنم کی ) آگ نے اپنے رب کےحضور شکایت کی تو اللہ نےاسے سال میں دو سانس لینے کی اجازت دی : ایک سانس سردی مین اور ایک سانس گرمی میں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": "617.03",
			"text": "محمد بن ابراہیم نےابو سلمہ سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے رسول اللہ ﷺسے روایت کی ، آپ نے فرمایا : ’’آگ نے عرض کی : اے میرے رب ! میرا ایک حصہ دوسرے کو کھا رہا ہے ، مجھے سانس لینے کی اجازت مرحمت فرما ۔ تو ( اللہ نے ) اسے دو سانس لینے کی اجازت دی : ایک سانس سردی میں اور ایک سانس گرمی میں ۔ تم جو سردی یا ٹھنڈک کی شدت پاتے ہو ، وہ جہنم کی سانس سے ہے اور جو تم حرارت یا گرمی کی شدت پاتے ہو تو وہ ( بھی ) جہنم کی سانس سے ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": "618",
			"text": "حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ نبی اکرم ﷺ ظہر کی نماز اس وقت پڑھتے تھے جب سورج ڈھلتا تھا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": "619.01",
			"text": "ابو احوص سلام بن سلیم نے ہمیں حدیث سنائی ، انھوں نے ابو اسحاق سے ، انھوں نے سعید بن وہب سے اور انھوں حضرت خباب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : ہم نے رسول اللہ ﷺ سے شدید گرم ریت پر نماز ادا کرنے کی شکایت کی تو آپ نے ہماری شکایت کا ازالہ نہ فرمایا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": "619.02",
			"text": "زہیر نے کہا : ہمیں ابو اسحاق نے سعید بن وہب سے حدیث سنائی اور انھوں نے حضرت خباب ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ہم رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور آپ سے ریت کی گرمی کی شکایت کی تو آپ نے ہماری شکایت کا ازالہ نہ فرمایا ۔ زہیر نے کہا : میں نے ابو اسحاق سے پوچھا : کیا ظہر کے بارے میں ( شکایت کی ؟ ) انھوں نے جواب دیا : ہاں ۔ میں نےکہا : کیا اس کو جلد ی پڑھنے ( کی مشقت ) کے بارے میں ؟ انھوں نے جواب دیا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": "620",
			"text": "حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ ہم گرمی کی شدت میں رسول اللہ ﷺ کے ساتھ نماز پڑھتے تھے ، جب ہم میں سے کوئی اپنی پیشانی زمین پر نہ رکھ سکتا تو اپنا کپڑا پھیلا کر اس پر سجدہ کر لیتا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": "621.01",
			"text": "قتیبہ بن سعید اور محمد بن رمح نے کہا : لیث نے ہمیں ابن شہاب سے روایت کی ، انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ انھوں نے ان کو بتایا کہ رسول اللہ ﷺ عصرکی نماز ( ایسے وقت میں ) پڑھتے تھے جب سورج بلند اور زندہ ( روشنی میں کمی کے بغیر ) ہوتا تھا ، عوالی کی طرف جانے والا ( عصر پڑھ کر ) چلتا اور عوالی ( مدینہ کے بالائی حصے کی بستیوں میں ) پہنچتا تو سورج ابھی بلند ہوتا تھا ۔ یہ بستیاں مدینہ سے دو تا آٹھ میل کی میل کی مسافت پر تھیں ۔ قتیبہ نے ( اپنی حدیث میں ) عوالی پہنچنے کا ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": "621.02",
			"text": "عمرو نے ابن شہاب سے ، انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ عصر کی نماز پڑھتے تھے ۔ ۔ ۔ ( آگے ) بالکل ( اوپرکی روایت ) کے مطابق ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": "621.03",
			"text": "امام مالک نے ابن شہاب سے ، انھوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ہم عصر کی نماز پڑھتے تھے ، پھر جانے والا قباء جاتا ، ان لوگوں کے پاس پہنچتا اور سورج ابھی اونچا ہوتا ۔ ( قباء مدینہ سے دو میل کی مسافت پر ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": "621.04",
			"text": "اسحاق بن عبداللہ بن ابی طلحہ نے حضرت اسن بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ، کہا ہم عصر کی نماز پڑھتے ، پھر ایک انسان بنو عمرو بن عوف کے محلے ( قباء میں ) جاتا تو انھیں عصر کی نماز پڑھتے ہوئے پاتا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": "622",
			"text": "علاء بن عبدالرحمان سے روایت ہے کہ وہ نماز ظہر سے فارغ ہو کر حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ہاں بصرہ میں ان کے گھر حاضر ہوئے ، ان کا گھر مسجد کے پہلو میں تھا ، جب ہم ان کی خدمت میں پہنچے تو انھوں نے پوچھا : کیا تم لوگوں نے عصر کی نماز پڑھ لی ہے ؟ ہم نے ان سے عرض کی : ہم تو ابھی ظہر کی نماز پڑھ کر لوٹے ہیں ۔ انھوں نے فرمایا : تو عصر پڑھ لو ۔ ہم نے اٹھ کر ( عصر کی ) نماز پڑھ لی ، جب ہم فارغ ہوئے تو انھوں نےکہا : میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا ’’ یہ منافق کی نماز ہے ، وہ بیٹھا ہوا سورج کو دیکھتا رہتا ہے یہاں تک کہ ( جب وہ زرد پڑ کر ) شیطان کے دو سنگوں کے درمیان چلا جاتا ہے تو کھڑا ہو کر اس ( نماز ) کی چار ٹھونگیں مار دیتا ہے اور اس میں اللہ کو بہت ہی کم یاد کرتا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": "623",
			"text": "حضرت ابو اامامہ بن سہل ‌رضی ‌اللہ ‌عنہ ‌ ‌ بیان کرتے ہیں : ہم نے عمر بن عبدالعزیز رحمۃ اللہ علیہ کے ساتھ ظہر کی نماز پڑھی ، پھر ہم باہر نکلے اور انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی خدمت میں حاضر ہوئے تو ہم نے انھیں حاصر کی نماز پڑھتے ہوئے پایا ، میں نے پوچھا : چچا جان! یہ کون سی نماز ہےجو آپ نے پڑھی ہے ؟ انھوں نے جواب دیا : عصر کی ہے ، اور یہی رسول اللہ ﷺ کی نماز ہے جو ہم آپ کے ساتھ پڑھا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": "624",
			"text": "عمرو بن سواد عامری ، محمد بن سلمہ مرادی اور احم د بن عیسیٰ نےہمیں حدیث بیان کی ۔ اس سب کے الفاظ ملتے جلتے ہیں ۔ عمرو نے کیا : ہمیں خبر دی اور باقی دونوں نے کہا : ہمیں حدیث سنائی ابن وہب نے ، کہا : مجھے عمرو بن حارث نے یزید بن ابی حبیب سے خبر دی کہ موسیٰ بن سعد انصاری نےانھیں حدیث بیان کی ، انھوں نے حفص بن عبید اللہ سے اورانھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے ہمیں عصر کی نماز پڑھا ئی تو جب آپ فارغ ہوئے ، آپ کے پاس بنو سلمہ کا ایک آدمی آیا اور کہا : اللہ کے رسول ! ہم اپنا اونٹ نحر کرنے کا اردہ رکھتے ہیں ۔ اور ہم چاہتے ہیں آپ بھی اس موقع پر موجود ہوں ۔ آپ نے فرمایا : ’’ اچھا ۔ ‘ ‘ آپ نکل پڑے ، ہم بھی آپ کے ساتھ چل پڑے ، ہم نے دیکھا ، اونٹ ابھی ذبح نہیں کیا گیا تھا ، اسے ذبح کیا گیا ، پھر اس کا گوشت کاٹا گیا ، پھر اس میں سے کچھ پکایا گیا ، پھر ہم نے سورج غروب ہونے سے پہلے ( اسے ) کھا لیا ۔ مرادی کا قول ہے کہ ہمیں یہ حدیث ابن وہب نے ابن لہیعہ اورعمروبن حارث دونوں سے روایت کرتے ہوئے سنائی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": "625.01",
			"text": "ہمیں ولید بن مسلم نےحدیث سنائی ، کہا : اوزاعی نےہمیں حدیث بیان کی ، انھوں نے ابو نجاشی سے روایت کی ، انھوں نے کہا : میں نےحضرت رافع بن خدیج ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، کہہ رہے تھے : ہم رسول اللہ ﷺ کے ساتھ نماز عصر پڑھتے ، پھر اونٹ ذبح کیا جاتا ، اس کے دس حصے کیے جاتے ، پھر ہم اسے پکاتے اور سورج کےغروب ہونے سے پہلے ہم اچھی طرح پکا ہوا گوشت کھا لیتے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": "625.02",
			"text": "اسحاق بن ابراہیم نے کہا : ہمیں عیسیٰ بن یونس اور شعیب بن اسحاق دمشقی نے خبر دی ، ان دونوں نے کہا : ہمیں اوزاعی نے اسی سند کے ساتھ یہی حدیث بیان کی ، البتہ انھوں ( اسحاق ) نے کہا : ہم رسول اللہ ﷺ کےعہدمیں عصر کے بعد اونٹ ذبح کرتےتھے ، نہیں کہا : ہم آپ کے ساتھ نماز پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": "626.01",
			"text": "نافع نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ کہ رسول اللہ ﷺ نے فرمایا : ’’جس شخص کی نماز عصر رہ گئی تو گیا اس کے اہل وعیال اور اس کا مال تباہ وبرباد ہو گئے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": "626.02",
			"text": "ابو بکر بن ابی شبیہ اور عمرو الناقد نے کہا : ہمیں سفیان نے زہر سے ، انھوں نے سالم سے اور انھوں نے اپنے والد ( ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے حدیث بیان کی ۔ عمرو نے کہا : ( ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) اس حدیث کی سند کو ( رسول اللہ ﷺ تک ) پہنچاتے تھے ۔ ابو بکر نے کہا : ( انھوں نے ) اس حدیث کو مرفوعا بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": "626.03",
			"text": "عمرو بن حارث نے ابن شہاب سے ، انھوں نے سالم بن عبداللہ سے اور انھوں نے اپنے والد سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’جس شخص کی عصر کی نماز رہ گئی تو گویا اس کے ہل وعیال اور اسکا مال بتاہ و برباد ہو گئے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": "627.01",
			"text": "ابوسامہ نے ہمیں حدیث سنائی ، انھوں نے ہشام سے ، انھوں نے محمد سے انھوں نے عبیدہ سے اور انھوں نےحضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہﷺ نے غزوہ احزاب کےدن فرمایا : ’’اللہ تعالٰی ان ( مشرکین ) کی قبروں اور گھروں کو آگ سے بھر دے ، جس طرح انھوں نے ہمیں درمیانی نماز ( عصر ) سے روکا اور ( جنگ میں ) مشغول کیے رکھا حتی کہ سورج غروب ہو گیا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": "627.02",
			"text": "یحیی بن سعید نے اور معتمر بن سلیمان نے ہشام سے یہ حدیث ( باقی ماندہ ) اسی سند کے ساتھ روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": "627.03",
			"text": "شعبہ نے کہے : ہمیں قتادہ سے سنا ، وہ ابو حسان سے حدیث بیان کررہےتھے ، انھوں نے عبیدہ سے اور انھوں حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہا : رسول اللہ ﷺ نے جنگ احزاب کے دن فرمایا : ’’ان لوگوں نے ہمیں درمیانی نماز سے مشغول کیے رکھا حتی کہ سورج غروب ہو گیا ‘ اللہ تعالیٰ ان کی قبروں کو اور گھروں کو یا ( فرمایا : ) ان کے پیٹوں کو آگ سے بھر دے ۔ ’’گھروں یا پیٹوں کے بارےمیں شعبہ کو شک ہوا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": "627.04",
			"text": "سعید نے قتادہ سے اسی سند کے ساتھ مذکورہ بالا روایت بیان کی اور انھوں نے بغیر شک کے بیوتہم و قبورہم ( ان کے گھروں اور قبروں کو ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": "627.05",
			"text": "یحییٰ بن جزار نے حضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے غزوہ احزاب کے موقع پر جب آپ خندق کی گزر گاہوں میں سے کسی گزر گا ہ پر تشریف فرما تھے ، فرمایا : انھوں نے ہمیں درمیانی نما ( عصر ) سے مشغول کر دیا حتی کہ سورج ڈوب گیا ، اللہ تعالیٰ ان کی قبروں اور گھروں کو یا فرمایا : ان کی قبروں او ر پیٹوں کو آگ سے بھر دے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": "627.06",
			"text": "شتیر بن شکل نےحضرت علی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی ، کہا : رسول اللہ ﷺ نےاحزاب کے دن فرمایا : ’’انھوں نے ہمیں درمیانی نماز ( یعنی ) عصر کی نماز سے مشغول رکھا ، اللہ تعالیٰ ان کے گھروں اور قبروں کو آگ سے بھر دے ۔ ‘ ‘ پھر آپ نے اسے رات کے دونوں نمازوں مغرب اور عشاء کے درمیان پڑھا ۔ ( مغرب کا وقت جارہا تھا اس لیے آخری وقت میں پہلے مغرب پڑھی ، پھر عصر کی قضا پڑھی ، پھر عشاء پڑھی ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": "628",
			"text": "حضرت عبداللہ ( بن مسعود ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا : مشرکوں نے ( جنگ میں مشغول رکھ کر ) رسو ل اللہ ﷺ کو عصر کی نمازسے روکے رکھا یہاں تک کہ سورج سرخ یا زرد ہو گیا تو رسول اللہ ﷺ نے فرمایا : ’’انھوں نےہمیں درمیانی نماز ، عصر کی نماز سے مشغول رکھا ، اللہ تعالیٰ ان کے پیٹوں اور قبروں میں آگ بھر دے ۔ ‘ ‘ یا فرمایا : ’’ اللہ تعالیٰ ان کے پیٹوں اور قبروں کو آگ سے بھر دے ۔ ‘ ‘ ( ملأ کی جگہ حشا کا لظف ارشاد فرمایا ، مفہوم دونوں کا ایک ہی ہے ۔ ) فائدہ : نبی کریم ﷺ کی نظرمیں نماز عصرکی اہمیت کس قدر تھی ، ان احادیث سے اس کا بخوبی اندازہ لگایا جا سکتا ہے ۔ نیز یہ کہ آپ ﷺ نے طائف میں سنگ باری برداشت کی لیکن بد دعا نہ دی ، احد میں جسم مبارک زخمی ہوا ، دندان مبارک شہید ہوئے ، ستر صحابہ کرام ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جام شہادت نوش کیا جن میں آپ کے چچا سید الشہداء سیدنا حمزہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی تھے لیکن بد دعا نہ دی ۔ جنگ خندق میں ناز عصرفوت ہو گئی تو کافروں کو بد دعا دی ۔ ہر مسلمان کو چاہیے کہ وہ نفع و نقصان کا یہی معیار پیش نظر رکھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": "629",
			"text": "حضرت عائشہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے آزاد کردہ غلام ابو یونس سے روایت ہے ، کہا حضرت عائشہ رضی اللہ تعالیٰ عنہا نے مجھے حکم دیا کہ ان کے لیے قرآن مجید لکھوں فرمایا : جب تم اس آیت پر پہنچوں ( حفظو علی الصلوت والصلوۃ الوسطی ) تو مجھے بتانا چنانچہ جب میں آیت پر پہنچا تو انھیں آگاہ کیا ، انھوں نے مجھے لکھوایا : حافظ علی الصلوت والصلاۃ الوسطی وصلاۃ العصر ، قوموا اللہ قانتین ’’ نمازوں کی حفاظت کرو اور ( خاص کر ) درمیانی نماز کی ، یعنی نماز عصر کی اور اللہ کے حضور عاجزانہ قیام کرو ۔ ‘ ‘ حضرت عائشہ رضی اللہ تعالیٰ عنہانے فرمایا : میں نے اسے رسول اللہ ﷺ سےایسے ہی سنا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": "631.01",
			"text": "معاذ بن ہشام نے حدیث بیان کی ، کہا : ہمیں میرے والد نے یحییٰ بن ابی کثیر سے حدیث سنائی ، انھوں نے کہا : ہمیں ابو سلمہ بن عبدالرحمن نےحضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہا سے روایت کرتے ہوئے حدیث بیان کی کہ خندق کے روز حضرت عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ کفار قریش کو برا بھلا کہنے لگے اور عرض کی : اے اللہ کےرسول ! اللہ کی قسم ! میں عصر کی نماز نہیں پڑھ سکا تھا یہاں تک کہ سورج غروب ہونے کو آگیا ۔ تو رسول اللہ ﷺ نے فرمایا : ’’ اللہ کی قسم ! میں نے ( بھی ) نہیں پڑھی ۔ ‘ ‘ پھر ہم ( وادی ) بطحان میں اترے ، رسول اللہ ﷺ نے وضول کیا اور ہم نے بھی وضو کیا ، پھر رسول اللہ ﷺ نے سورج کے غروب ہو جانے کے بعد عصرکی نماز پڑھی ، پھر اس کے بعد مغرب کی نماز ادا کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": "631.02",
			"text": "علی بن مبارک نے یحییٰ بن ابی کثیر سے اسی سند کے ساتھ اسی کی مانند حدیث بیان کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": "632.01",
			"text": "ابو زناد نے اعراج سے ، انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’رات کے فرشتے اور دن کے فرشتے ایک دوسرے کے پیچھے تمھارے درمیان آتے ہیں اور فجر کی نماز اور عصری نماز کے وقت وہ اکٹھے ہو جاتے ہیں ، پھر جنھوں نے تمھارے درمیان رات گزاری ہوتی ہے وہ اوپر چلے جاتےہیں ، ان سے ان کا رب پوچھتا ہے ، حالانکہ وہ ان سے زیادہ جانتا ہے : تم میرے بندوں کو کس حال میں چھوڑ کر آئے ہو ؟ وہ جواب دیتےہیں : ہم انھیں ( اس حالت میں ) چھوڑ کر آئے ہیں کہ وہ نماز پڑھ رہے تھے اور ہم ان کے پاس ( کل عصر کے وقت ) اس حالت میں پہنچے تھے کہ وہ نماز پڑھ رہے تھے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": "632.02",
			"text": "ہمام بن منبہ نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی اکرمﷺ سے روایت کی ، آپ نے فرمایا : ’’فرشتے ایک دوسرے کے پیچھے تمھار ے پاس آتے ہیں ۔ ‘ ‘ ( اس حدیث میں ملائکہ کا لفظ یتعاقبون سے پہلے ہے ۔ ) ۔ ۔ ۔ ۔ ۔ ( باقی روایت ) ابو زناد کی روایت کے مانند ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": "633.01",
			"text": "زہیر بن حرب نے کہا : ہمیں مروان بن معاویہ فزاری نے حدیث سنائی ، انھوں کہا : ہمیں اسماعیل بن ابی خالد نے خبر دی ، انھوں نے کہا : ہمیں قیس بن ابی حازم نے حدیث سنائی ، انھوں نے کہا : میں نے حضرت جریر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہے رہے تھے : ہم رسول اللہ ﷺ کی خدمت میں بیٹھے ہوئے تھے کہ آپ نے چودھویں رات کے چاند کی طرف نظر کی اور فرمایا : ’’سنو! تم لوگ اپنے رب کو اس طرح دیکھوں گے ، جس طرح اس پورے چاند کو دیکھ رہےہو ، اس کے دیکھنے میں تم بھیٹر نہ لگا ؤ گے ، اگر تم یہ کر سکو کہ سورج نکلنے سے پہلے کی اور سورج غروب ہونے سے پہلے کی نماز میں ( مصروفیت ، سستی وغیرہ سے ) مغلوب نہ ہو ( تو تمہیں یہ نعمت عظمیٰ مل جائے گئی ۔ ) ‘ ‘ آپ کی مراد عصر اور فجر کی نماز سے تھی ، پھر جرییر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے یہ آیت پڑھی ( وسبح بحمد ربک قبل طلوع الشمس وقبل غروبہا ) اور اپنے رب کی حمد کی تسبیح بیان کرو ، سورج کے نکلنے سے پہلے اور اس کے غروب ہونے سے پہلے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": "633.02",
			"text": "ابو بکر بن ابی شیبہ نےعبداللہ بن نمیر ، ابو اسامہ اور وکیع سے باقی ماندہ اسی سند کے ساتھ روایت کی ، اس میں ہے : سنو ! تم لوگ یقینا اپنے رب کے سامنے پیش کیے جاؤ گے اور اس کو اسی طرح دیکھوں گے ، جس طرح اس پور ے چا ند کو دیکھتے ہو ۔ ‘ ‘ پھر روای نے ( ثم قراء جریر کے بجائے ) ثم قراء ( پھر انھوں پڑھا ) کہا اور جریر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کا نام نہیں لیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": "634.01",
			"text": "(اسماعیل ) ابن ابی خالد ، مسعر اور بختری بن مختار نےیہ روایت ابو بکر بن عمارہ بن رویبہ سے سنی ، انھوں نے اپنے والد ( حضرت عمارہ بن رویبہ ثقفی ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ ﷺ کویہ فرماتے ہوئے سنا : ’’ وہ شخص ہرگز آگ میں داخل نہیں ہو گا جو سورج نکلنے اور اس کے غروب ہونے سے پہلے نماز پڑھتا ہے ۔ ‘ ‘ یعنی فجر اور عصر کی نمازیں ۔ اس پر بصرہ کے ایک آدمی نے ان سے کہا : کیا آپ نے یہ روایت رسول للہ ﷺ سے سنی تھی ؟ انھوں نے کہا : ہا ں ۔ اس آدمی نے کہا : میں شہادت دیتا ہوں کہ میں نے بھی یہ روایت رسول اللہ ﷺ سے سنی ۔ میرے دونوں کانوں نے اسے سنا اور میرے دل نے اسے یاد رکھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": "634.02",
			"text": "عبدالملک بن عمیر نے حضرت عمارۃ بن رویبہ کے بیٹے سے اور انھوں نے اپنے والد سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ’’ جو انسان سورج نکلنے اور اس کے غروب ہونے سے پہلے نماز پڑھتا ہے وہ آگ میں داخل نہیں ہو گا ۔ ‘ ‘ اور ان کے پاس بصرہ کا ایک باشندہ بھی موجود تھا ، اس نے پوچھا : کیا آپ نے یہ حدیث براہ راست نبی اکرم ﷺ سے سنی ؟ تو انھوں نے کہا : ہاں ، اور میں اس کی شہادت دیتا ہوں ۔ اس آدمی نے کہا : اور میں بھی شہادت دیتا ہوں کہ میں نے اسی جگہ ان کو یہ فرماتے ہوئے سنا جہاں آپ نے ان سے سنا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": "635.01",
			"text": "ہدّاب بن خالد ازدی نے کہا : ہمیں ہمام بن یحییٰ نے حدیث سنائی ، کہا : مجھے ابو جمرہ ضبعی نے ابوبکر ( بن ابی موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے حدیث سنائی اور انھوں نے اپنے والد سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ’’جس نے دو ٹھنڈے وقتوں کی نمازیں ادا کیں ، وہ جنت میں داخل ہو گا ۔ ‘ ‘ ( دن کا ٹھنڈا وقت عصر کا اور رات کا سب سے ٹھنڈا وقت فجر کا ہوتا ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": "635.02",
			"text": "بشر بن سریّ اور عمر و بن عاصم دونوں نے کہا : ہم سے ہمام نے اسی سند کے ساتھ حدیث بیان کی اور انھوں نے ابوبکر کا نسب بیان کیا اور کہا : ابن ابی موسیٰ",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": "636",
			"text": "حضرت سلمہ بن اکوع ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ رسول اللہﷺ مغرب کی نماز اس وقت پڑھتے جب سورج غروب ہوتا اور پردے کی اوٹ میں چلا جاتا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": "637.01",
			"text": "ولید بن مسلم نے کہا : ہم سے اوزاعی نے حدیث بیان کی ، کہا : ہم سے ابو نجاشی نے حدیث بیان کی ، کہا : میں نے حضرت رافع بن خدیج ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، کہہ رہے تھے : ہم رسول اللہ ﷺ کے ساتھ مغرب کی نماز پڑھتے تو ہم میں سے کوئی شخص لوٹتا اور وہ اپنے تیر کے گرنے کی جگہیں دیکھ سکتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": "637.02",
			"text": "شعیب بن اسحاق دمشقی نے اوزاعی سے سابقہ سند کےساتھ رافع بن خدیج ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےحدیث بیان کی ، کہا : ہم مغرب کی نماز ادا کر تے ۔ ۔ ۔ ( آگے ) پچھلی حدیث کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": "638.01",
			"text": "عمرو بن سوّاد عامری اور حرملہ بن یحییٰ دونوں نے کہا : ہمیں ابن وہب نے خبر دی ، انھوں نے کہا : مجھے یونس نےخبر دی کہ انھیں ابن شہاب نے خبر دی ، کہا : مجھے عروہ بن زبیر نے خبر دی کہ نبی اکرم ﷺ کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : ایک رات رسول اللہ ﷺ نے عشاء کی نماز خوب اندھیرا ہونے تک مؤخر فرمائی اور اسی نماز کو عتمہ ( گہری تاریکی کے وقت کی نماز ) کہا جاتا تھا ۔ رسول اللہﷺ ( اس وقت تک ) گھر سے نہ نکلے یہاں تک کہ حضرت عمربن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : ( مسجد میں آنے والی ) عورتیں اور بچے سو گئے ہیں ۔ اس پر رسول اللہ ﷺ باہر تشریف لائے اور نکل کر مسجد کے حاضرین سے فرمایا : ’’اہل زمین میں سے تمھارے سوا اس نماز کا اور کوئی بھی انتظار نہیں کررہا ‘ ‘ اور یہ لوگوں میں ( مدینہ سے باہر ) اسلام پھیلنے سے پہلے کی بات ہے ۔ حرملہ نے اپنی روایت میں اضافہ کیا کہ ابن شہاب نے کہا : مجھے بتایا گیا کہ رسول اللہ ﷺ نے فرمایا : ’’تمھارے لیے مناسب نہ تھا کہ تم اللہ کے رسول ﷺ سے نماز کے لیے اصرار کرتے ۔ ‘ ‘ یہ تب ہوا جب عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بلند آواز سے پکارا ۔ ( انھوں نے غالباً یہ سمجھا کہ آپ ﷺ بھول گئے ہیں یا سو گئے ہیں)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": "638.02",
			"text": "عقیل نے ابن شہاب سے اسی سنج کے ساتھ مذکورہ بالا روایت بیان کی لیکن اس میں زہر ی کا قول : وذکرلی ( مجھے بتایا گیا ) اور اس کے بعد کا حصہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": "638.03",
			"text": "محمد بن بکر ، حجاج بن محمد اور عبدالرزاق ۔ سب کے الفاظ باہم ملتے جلتے ہیں ۔ سب نے کہا : ابن جریج سے روایت ہے ، انھوں نے کہا : مجھے مغیرہ بن حکیم نے ام کلثوم بنت ابی بکر سے خبر دی کہ انھوں نے انھیں ( مغیرہ کو ) حضرت عائشہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کرتے ہوئے خبر دی ، انھوں نے کہا : ایک رات نبی اکرم ﷺ ےعشاء کی نماز میں دیر کر دی یہاں تک کہ رات کا بڑا حصہ گزر گیا اور اہل مسجد سو گئے ، پھر آپ باہر تشریف لے گئے ، نماز پڑھائی اور فرمایا : ’’ اگر ( مجھے ) یہ ( ڈر ) نہ ہوتا کہ میں اپنی امت کو مشقت میں ڈالوں گا تو یہی اس کا ( بہترین ) وقت ہے ۔ ‘ ‘ اور عبدالرزاق کی حدیث میں ہے : ’’ اگریہ ( ڈر ) نہ ہوتا کہ یہ میری امت کے لیے مشقت کا سبب بنے گا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": "639.01",
			"text": "حکم نےنافع سے اور انھوں نے حضرت عبداللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ایک رات ہم عشاء کی آخری نماز کے لیے رسول اللہ ﷺ کا انتظار کرتے رہے ، جب رات کا تہائی حصہ گزر گیا یا اس کے ( بھی ) بعد آپ تشریف لائے ، ہمیں معلوم نہیں کہ آپ کو گھر والوں ( کے معاملے ) میں کسی چیز نے مشغول رکھا تھا یا کوئی اور بات بھی ، جب آپ باہر آئے تو فرمایا : ’’بلا شبہ تم ایسی نماز کا انتظار کررہے ہو جسکا تمھارے سوا کسی اور دین کے پیرو کار انتظار نہیں کر رہے ، اور اگر مجھے یہ ڈر نہ ہوتا کہ یہ میری امت کے لیے گراں ہو گا تو میں انھیں اسی گھڑی میں ( یہ ) نماز پڑھایا کرتا ۔ ‘ ‘ پھر آپ نے مؤذن کو حکم دیا ، اس نے اقامت کہی اور آب نے نماز پڑھائی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": "639.02",
			"text": "ہمیں ابن جریج نے خبر دی ، کہا : مجھے نافع نے خبر دی ، انھوں نے کہا : ہم سے حضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے حدیث بیان کی کہ ایک رات رسول اللہ ﷺ ( کسی بنا پر ) اس ( عشاء کی نماز ) سے مشغول ہو گئے ، آپ نے اسے مؤخر کر دیا یہاں تک کہ ہم مسجد میں سو گئے ، پھر بیدار ہوئے ، پھر سو گئے ، پھر بیدار ہوئے ، پھر آپ ( گھر سے ) نکل کر ہمارے پاس تشریف لائے اور فرمایا : ’’آج رات تمھارے سوا اہل زمین میں سے کوئی نہیں جو نماز کا انتظار کر رہا ہو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": "640.01",
			"text": "ثابت سے روایت ہےکہ انھوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے رسول اللہ ﷺ یک مہر ( یا انگوٹھی ) کے بارے میں پوچھا تو ( حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ایک رات رسول اللہ ﷺ نے عشاء کی نماز آدھی رات تک مؤخر کی یا آدھی رات گزرنےکو تھی ، پھر آپ تشریف لائے اور فرمایا : ’’بلاشبہ ( دوسرے ) لوگوں نے نماز پڑھ لی اور سوچکے ، اور تم ہو کہ نماز ہی میں ہو جب تک نماز کے انتظار میں بیٹھے ہو ۔ ‘ ‘ حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : جیسے میں ( اب بھی ) آپ کی چاندی سے بنی انگوٹھی کی چمک دیکھ رہا ہوں اور انھوں نے بائیں ہاتھ کی انگلی اٹھاتے ہوئے چھوٹی انگلی سے ( اشارہ کیاکہ انگوٹھی اس میں تھی ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": "640.02",
			"text": "ابوزید سعید بن ربیع نے ہمیں حدیث بیان کی ، کہا : ہمیں قرہ بن خالد نے قتادہ سےحدیث سنائی ، انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : ہم نے ایک رات رسول اللہ ﷺ کا انتظار کیا حتی کہ آدھی رات کے قریب ( کا وقت ) ہوگیا ، پھر آپ آئے اور نماز پڑھائی ۔ پھر آپ نے ہمارے طرف رخ فرمایا ، ایسا لگتا ہے کہ میں ( اب بھی ) آپ کی انگوٹھی کی چمک دیکھ رہا ہوں ، وہ آپ کے ہاتھ میں تھی ، چاندی کی بنی ہوئی تھی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": "640.03",
			"text": "عبیداللہ بن عبدالمجید حنفی نے قرہ سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی اور یہ بیان نہ کیا : ’’پھر آپ نے ہمار ی طرف رخ فرمایا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": "641",
			"text": "حضرت ابو موسیٰ اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا : میں اور میرے ( وہ ) ساتھ ۔ جو میرے ساتھ بڑی کشتی میں ( حبشہ سے واپس ) آئے تھے ۔ بطحان کے نشیبی میدان میں اترے ہوئے تھے ، رسول اللہ ﷺ مدینہ میں تھے اور ہر رات ان میں سے ایک جماعت باری باری عشاء کی نمازمیں رسول اللہ ﷺ کی خدمت میں حاضر ہوتی تھی ۔ ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ نے کہا کہ مجھے اور میرے ساتھیوں کو رسول اللہ ﷺ کے ساتھ یوں اتفاق پیش آیا کہ آپ اپنے کسی معاملے میں ( اتنے ) مشغول ہو گئے کہ آپ نے نماز کو مؤخر کر دیا حتی کہ آدھی رات ہو گئی ۔ اس کے بعد رسول اللہ ﷺ تشریف لائے اور لوگوں کو نماز پڑھائی ۔ جب آپ نے ناز مکمل کر لی تو ان لوگوں سے جو آپ کے سامنے حاضر تھے ، فرمایا : ’’ذرا ٹھہر و میں تمھیں بتاتا ہوں اور تم خوش ہو جاؤ یہ تم پر اللہ تعالیٰ کی ایک نعمت ہے کہ لوگوں میں اس وقت ، تمھارے سوا ، کوئی بھی نماز نہیں پڑھ رہا ۔ ‘ ‘ یا آپ نے فرمایا : ’’اس وقت تمھارے سوا کسی نے نماز نہیں پڑھی ۔ ‘ ‘ ہمیں یاد نہیں کہ آپ ﷺ نے کون سا جملہ کہا تھا ۔ ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ نے بتایا : ہم رسول اللہ ﷺ کی بات سن کر خوش خوش واپس آئے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": "642",
			"text": "ابن جریج نے ہمیں خبر دی ، کہا : میں نے عطاء سے پوچھا : آپ کے نزدیک کون سی گھڑی زیادہ پسندیدہ ہے کہ میں اس میں عشاء کی نماز ، جسے لوگ عتمہ کہتے ہیں ، امام کے ساتھ یا انفرادی طور پر پڑھوں ؟ انھوں نے جواب دیا : میں نے ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کویہ فرماتے ہوئےسنا : ایک رات نبی ﷺ نے عشاء کی نماز میں دیر کر دی حتی کہ لوگ سوئے ، پھر بیدار ہوئے ، پھر سوئے اور بیدار ہوئے تو حضرت عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ کھڑے ہوئے اور بلند آواز سے کہا : نماز ! عطاء نے کہا : ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : تو نبی اکرمﷺ نکلے ، ایسا لگتا ہے کہ میں اب بھی آپ کو دیکھ رہا ہوں ، آپ کے سر مبارک سے قطرہ قطرہ پانی ٹپک رہا تھا اور ( بالوں میں سے پانی نکالنے کے لیے ) آپ نے اپنا ہاتھ سر کے آدھے حصے پر رکھا ہوا تھا ، آپ ﷺ نے فرمایا : ’’اگر یہ بات نہ ہوتی کہ میری امت کےلیے مشقت ہو گی تو میں انھیں حکم دیتا کہ وہ اس نماز کو اسی وقت پڑھا کریں ۔ ‘ ‘ ( ابن جریج نے ) کہا : میں نے عطاء سے اچھی طرح چوچھا کہ ابن عباس ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے انھیں کس طرح بتایا کہ نبی ﷺ نے اپنا ہاتھ کس انداز سے اپنے سر پر رکھا تھا ؟ تو عطاء نے میرے سامنے اپنی انگلیاں کسی قدر کھولیں ، پھر اپنی انگلیوں کے کنارے سر کی ایک جانب رکھے ، پھر ان کو دباتے ہوئے اسطرح ان کو سر پر پھیرا یہا ں تک کہ ان کا انگوٹھا کان کے اس کنارے کو چھونے لگا جو چہرے کے قریب ہوتا ہے ، پھر کنپٹی اور داڑھی کے کنارے کو ( چھوا ) بس اس طرح کیا نہ ( دباؤ میں ) کمی کی نہ کسی چیز کو پکڑا ( اور نچوڑا ۔ ) میں نے عطاء سے پوچھا : آب کو کیا بتایا گیا کہ اس رات نبی اکرم ﷺ نے کتنی تخیر کی ؟ انھوں نے کہا : مجھے معلوم نہیں ۔ عطاء نے کہا : میرے نزدیک زیادہ پسندیدہ یہی ہےکہ میں امام ہوں یا اکیلا ، یہ نماز تاخیر سے پڑھوں ، جس طرح نبی اکرم ﷺ نے اس رات پڑھی تھی ۔ اگر یہ بات تمھارے لیے انفرادی طور پر با جماعت کی صورت میں لوگوں کےلیے جب تم ان کے امام ہو ، دشواری کا باعث ہو تو اس کو درمیان وقت میں پڑھو ، نہ جلد ی اور نہ مؤخر کرکے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": "643.01",
			"text": "ابواحوص نے سماک سے ، انھوں نے حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ، کہا : رسول اللہ ﷺ رات کی دوسری نماز تاخیر سے پڑھتے تھے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": "643.02",
			"text": "قتیبہ بن سعید اور ابو کامل جحدری نے کہا : ہمیں ابو عوانہ نے سماک سے حدیث سنائی ، انھوں نے حضرت جابر بن سمرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نمازیں تمھاری طرح ( اوقات میں ) پڑھتے تھے ، البتہ عشاء مؤخر کرکے تمھاری نماز سے کچھ دیر بعد پڑھتے تھے اور نماز میں تخفیف کرتےتھے ۔ اور ابو کامل کی روایت میں ( یخف فی الصلاۃ کے بجائے ) ’’یخفف کے الفاظ ہیں ۔ ( مفہوم ایک ہی ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 1455,
			"arabicnumber": "644.01",
			"text": "زہیر نے کہا : ہم سے سفیان بن عینہ نے ابو لبید سے ، انھوں نے ابو سلمہ سے اورانھوں نے حضرت عبداللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا : ’’تمھاری نماز کے نام پر تمھارے گنوار لوگ غالب نہ آجائیں ، خبردار !یہ عشاء ہے ، وہ اونٹنیوں کا دودھ دوہنے کی وجہ سے اندھیرا کر دیتے ہیں ( اور اندھیرے ( عتمہ ) کی بنا پر اس وقت پڑھی جانے والی نماز کو صلاۃ العتمہ ، یعنی اندھیرے کی نماز کہتےہیں",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 1456,
			"arabicnumber": "644.02",
			"text": "وکیع نے سفیان سے باقی ماندہ سابقہ سند کے ساتھ حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ’’تمھاری صلاۃ عشاء کے نام پر بدوتم پر غالب نہ آجائیں کیونکہ اللہ کی کتاب میں ا س کا نام عشاء ہے : اور بدو اونٹنیوں کا دودھ دوہنے میں اندھیرا کر دیتے ہیں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 1457,
			"arabicnumber": "645.01",
			"text": "سفیان بین عیینہ نے زہری سے ، انھوں نے عروہ سےاور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ مومن عورتیں صبح کی نماز نبی اکرم ﷺ کے ساتھ پڑھتی تھیں ، پھر اپنی چادریں اوڑھے ہوئے واپس آتیں اور ( اندھیرے کی وجہ سے ) کوئی انھیں پہچان نہیں سکتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 1458,
			"arabicnumber": "645.02",
			"text": "یونس نے ابن شہاب سے باقی ماندہ سابقہ سند کے ساتھ نبی اکرم ﷺ کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نےکہا : کچھ مومن عورتیں فجر کی نماز میں اپنی چادریں اوڑھے ہوئے رسول اللہ ﷺ کے ساتھ شریک ہوتی تھیں ، پھر وہ اپنے گھروں کو لوٹتیں تو رسول اللہ ﷺ کے اندھیرے میں نماز پڑھنے کی بنا پر وپہچانی نہ جا سکتی تھیں",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 1459,
			"arabicnumber": "645.03",
			"text": "نصر بن علی جہضمی اور اسحاق بن موسیٰ انصاری نے کہا : ہمیں معن نے مالک سے حدیث بیان کی ، انھوں نے یحییٰ بن سعید سے ، انھوں نے عمرہ سے اور انھوں نے حضرت عائشہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : ایسا تھا کہ رسول اللہ ﷺ صبح کی نماز پڑھتے تو عورتیں اپنی چادریں اوڑھے ہوئے گھروں کو لوٹتیں ، ( اور ) اندھیرےکی وجہ سے پہچانی نہیں جاتی تھیں ۔ انصاری کی روایت میں ( متلفعات کے بجائے ) متلففات ( چادروں میں لپٹی ہوئی ) کے الفاظ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 1460,
			"arabicnumber": "646.01",
			"text": "محمد بن جعفر غندر نے ہمیں حدیث بیان کی ، کہا : ہمیں شعبہ نے حدیث سنائی ، انھوں نے سعد بن ابراہیم سے اور انھوں نے محمد بن عمرو بن حسن بن علی ( بن ابی طالب ) ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : جب حجاج مدینہ منورہ آیا ( اور تاخیر سے نمازیں پڑھنے لگا ) تو ہم نے ( نماز کےاوقات کے بارے میں ) جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا ، انھوں نے بتایا کہ رسول اللہ ﷺ ظہر کی نما دوپہر کو ( زوال کے فورا بعد ) پڑھتے تھے اور عصر ایسے وقت میں پڑھتے تھے کہ سورج بالکل صاف ( اور روشن ہوتا ) تھا اور مغرب کی نماز سورج غروب ہوتے ہی پڑھتے اور عشاء کی نماز کو کبھی مؤخر کرتے اور کبھی جلدی ادا کرتے ، جب آپ دیکھتے کہ لوگ جمع ہو گے ہیں تو جلدی پڑھ لیتے ارو جب انھیں دیکھتے کہ دیر کر دی ہے تو تاخیر کر دیتے ۔ اور صبح ( کی نماز ) یہ لوگ ۔ ۔ یا کہا : نبی ﷺ اندھیرے میں پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 1461,
			"arabicnumber": "646.02",
			"text": "معاذ عنبری نے شعبہ سے باقی ماندہ اسی سند کے ساتھ روایت کی کہ حجاج نمازوں میں تاخیر کر دیتا تھا تو ہم نے جابر بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا ۔ ۔ ۔ ( آگے ) غندر کی روایت کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 1462,
			"arabicnumber": "647.01",
			"text": "خالد بن حارث نے ہمیں حدیث سنائی ، کہا : شعبہ نے ہمیں حدیث بیان کی ، کہا : مجھے سیار بن سلامہ نے خبر دی ، کہا : میں نے سنا کہ میرے والد ، حضرت ابو برزہ اسلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے رسول اللہ ﷺ کی نماز کے بارے میں پوچھ رہے تھے ۔ ( شعبہ نے ) کہا : میں نے پوچھا : کیا آپ نے خود انھیں سنا ؟ انھوں نے کہا : ( اسی طرح ) جیسے میں ابھی تمھیں سن رہا ہوں ، کہا : میں نے سنا ، میرے والد ان سے رسول اللہ ﷺ کی نماز کے بارے میں سوال کر رہے تھے ، انھوں نے بتایا کہ آپ اس ، یعنی عشاء کی نماز کو کچھ ( تقریباً ) آدھی رات تک مؤخر کرنے میں مضائقہ نہ سمجھتے تھے اور اس نماز سے پہلے سونے اور اس کے بات چیت کرنے کو نا پسند فرماتے تھے ۔ شعبہ نے کہا : میں بعد ازاں ( دوبارہ ) ان سے ملاتو میں نے ان سے ( پھر ) پوچھا تو انھوں ( سیار ) نے کہا : آپ ظہر کی نماز سورج ڈھلنے کے وقت پڑھتے تھے اور عصر ایسے وقت میں پڑھتے کہ انسان نماز پڑھ کر مدینہ کے دور ترین حصے تک پہنچ جاتا اور سورج ( اسی طرح ) زندہ ( روشن اور گرم ) ہوتا تھا اور انھوں نے کہا : مغرب کے لیے میں نہیں جانتا ، انھوں نے کون سا وقت بتایا تھا ۔ ( شعبہ نے ) کہا : میں اس کے بعد ( پھر ) سیار سے ملا اور ان سے پوچھا تو انھوں نے بتایا : ( آپ ﷺ ) صبح کی نماز ایسے وقت میں پڑھتے کہ انسان سلام پھیرتا اور اپنے ساتھ بیٹھے ہوئے انسان کے چہرے کو ، جسے وہ جانتا ہوتا ، دیکھتا تو اسے پہچان لیتا اور آپ اس ( نماز ) میں ساٹھ سے سو تک آیتیں تلاوت فرماتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 1463,
			"arabicnumber": "647.02",
			"text": "معاذ عنبری نے شعبہ سے حدیث بیان کی اور انھوں نے سیار بن سلامہ سے روایت کی کہ میں نے ابو برزہ کو کہتے ہوئے سنا ، رسول اللہ عشاء کی نماز میں کچھ ( یعنی ) آدھی رات تک تا خیر کی پروانہ کرتے تھے اور اس سے پہلے سونے اور اس کے بعد گفتگو کرنے کو پسند نہیں فرماتے تھے ۔ شعبہ نے کہا : پھر میں انھیں دوبارہ ملاتو انھوں نے کہا : یا تہائی رات تک ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 1464,
			"arabicnumber": "647.03",
			"text": "(شعبہ کے بجائے ) حماد بن سلمہ نے ابو منہال ( سیار بن سلامہ ) سے روایت کی ، کہا : میں نے ابو برزہ اسلمی ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےسنا ، کہتے تھےکہ رسول اللہ ﷺ عشاء کو تہائی رات تک مؤخر کر دیتے تھے اور اس سے پہلے سونے اور بعد میں گفتگو کرنے کو ناپسند فرماتے تھے اور صبح کی نماز میں سو سے لے کر ساٹھ تک آیتیں تلاوت فرماتے اور ایسے وقت میں سلام پھیرتے تھے جب ہم ایک دوسرے کے چہرے کو پہچان سکتے تھے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 1465,
			"arabicnumber": "648.01",
			"text": "خلف بن ہشام ، ابوربیع زہرانی اور ابو کامل جحدری نے حدیث بیان کی کی ، کہا ہمیں حماد بن زید نے حدیث سنائی ، انھوں نے ابو عمران جونی سے ، انھوں نے عبداللہ بن صامت سے اور انھوں نے حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے مجھے فرمایا : ’’تمھارا کیا حال ہوگا جب تم پر ایسے لوگ حکمران ہوں گے جو نماز کو اس کے وقت سے مؤخر کریں گے یا نماز کو اس کے وقت سے ختم کردیں گے ؟ ‘ ‘ میں نے عرض کیگ تو آپ مجھے ( اس کے بارے میں ) کیا حکم دیتے ہیں ؟ آپ نے فرمایا : ’’تم اپنے وقت پر نماز پڑھ لینا اگر تمھیں ان کے ساتھ ( بھی ) نماز مل جائے تو پڑھ لینا ، وہ تمھارے لیے نفل ہو جائے گی ۔ ‘ ‘ خلف نےعن وقتھا ( اس کے وقت سے ) کے الفاظ بیان نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 1466,
			"arabicnumber": "648.02",
			"text": "جعفر بن سلیمان نے ابو عمران جونس سے اسی سند کے ساتھ حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے مجھ سے کہا : ’’ابو ذر! میرے بعد ایسے حکمران آئیں گے جو نماز کو ماردیں گے ( ان کا وقت ختم کردیں گے ) تو تم نماز کو اس کے وقت پر پڑھ لینا ، اگر تم نے نماز وقت پرپڑھ لی تو ( ان کے ساتھ ادا کی گئی دوسری نماز ) تمھارے لیے نفل ہو جائے گی ورنہ تم نے اپنی نماز تو بچا ہی لی ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 1467,
			"arabicnumber": "648.03",
			"text": "شعبہ نے ابو عمران سے باقی ماندہ سابقہ سند کے ساتھ حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : میرے خلیل نے مجھے حکم دیا تھا کہ میں سنوں اور فرمانبرداری کروں ، چاہے کٹے ہوئے بازوں والا غلام ( ہی حکمران ) ہو اور یہ کہ میں نماز وقت پر پڑھوں ( آپ ﷺ نے فرمایا : ) ’’پھر اگر تم لوگوں کو اس حالت میں پاؤ کہ انھوں نے نماز پڑھ لی ہے تو تم اپنی نماز بچا چکے ہو ( وقت پر پہلے پڑھ چکے ہو ) ، اور اگر ( انھوں نے نہیں پڑھی اور تم ان کے ساتھ شریک ہوئے ) تو تمھاری یہ نماز نفل ہو گی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 1468,
			"arabicnumber": "648.04",
			"text": "بدیل سے روایت ہے ، انھوں نے کہا : میں نے ابو عالیہ سے سنا ، وہ عبداللہ بن صامت سے اور وہ حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کر رہے تھے ، کہا : رسول اللہ ﷺ نے فرمایا اور میری ران پر ہاتھ مارا : ’’تمھارا کیاحال ہو گا جب تم ایسے لوگوں میں اپنی بقیہ زندگی گزار رہے ہو گے جو نماز کو اس کے وقت سے مؤخر کردیں گے ؟ ‘ ‘ ( عبداللہ بن صامت نے ) کہا : انھوں نے کہا : آپ کیا حکم دیتے ہیں ؟فرمایا : ’’تم نماز کواس کے وقت پر ادا کرلینا ، اور اپنی ضرورت کے لیے چلے جانا ، پھر اگر نماز کی اقامت کہی گئی اور تم مسجد میں ہوئے تو ( دوبارہ ) پڑھ لینا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 1469,
			"arabicnumber": "648.05",
			"text": "ایوب نے ابو عالیہ برّاء سے روایت کی ، کہا : ابن زیاد نے نماز میں تاخیر کر دی تو میرے پاس عبداللہ بن صامت تشریف لے آئے ، میں نے ان کے لیے کرسی رکھوا دی ، وہ اس پر بیٹھ گئے ، میں نے ان کے سامنے ابن زیاد کی حرکت کا تذکرہ کیا تواس پر انھوں نے اپنا ( نچلا ) ہونٹ دانتوں میں دبایا اور میری ران پر ہاتھ مار کر کہا : جس طرح تم نے مجھ سے پوچھا ہے ، اسی طرح میں نے ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا تھا ، انھوں نے بھی اسی طرح میری ران پر ہاتھ مارا تھا جس طرح میں نے تمھاری ران پر ہاتھ مارا ہے اور کہا : میں نے رسول اللہ ﷺ سے پوچھا تھا جس طرح تم نے مجھ سے پوچھا ہے تو آپ ﷺ نے میری ران پر ہاتھ مارا جس طرح میں نے تمھاری ران پر ہاتھ مارا ہے اور فرمایا : ’’تم نماز بروقت ادا کرلینا ، پھر اگرتمھیں ان کے ساتھ نماز پڑھنی پڑھ تو ( پھر سے ) نماز پڑھ لینا اور یہ نہ کہنا : میں نے نماز پڑھ لی ہے اس لیے اب نہیں پڑھوں گا ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 1470,
			"arabicnumber": "648.06",
			"text": "ابو نعامہ نے عبداللہ بن صامت سےاور انھوں نے حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : آپ ﷺ نے فرمایا : ’’تم لوگوں کا کیا حال ہو گا ‘ ‘ یا فرمایا : ’’تمھاری کیفیت کیا ہو گی جب تم ایسے لوگوں میں رہ جاؤ گے جو نماز کو اس کے وقت سے مؤخر کریں گے ؟ تم وقت پر نماز پڑھ لینا ، پھر اگر ( تمھاری موجودگی میں ) نماز کی اقامت ہو تو تم ان کے ساتھ ( بھی ) پڑھ لینا کیونکہ یہ نیکی میں اضافہ ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 1471,
			"arabicnumber": "648.07",
			"text": "مطر نے ابو عالیہ بّراء سے روایت کی ، کہا : میں نے عبداللہ بن صامت سے پوچھا کہ ہم جمعہ کے دن حکمرانوں کی اقتدا میں نماز پڑھتے ہیں اور وہ نماز کو مؤخر کر دیتے ہیں ۔ تو انھوں نے زور سے میری ران پر ہاتھ مارا جس سے مجھے تکلیف محسوس ہوئی اور کہا : میں نے اس کے بارےمیں ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے پوچھا تو انھوں نے ( بھی ) میری ران پر ہاتھ مارا تھا اور کہا تھا : میں نے اس کے بارے میں رسول اللہ ﷺ سے سوال کیا تھا تو آپ نے فرمایا : ’’نماز اس کے وقت پر ادا رکر لو ، پھر ان ( حکمرانوں ) کے ساتھ اپنی نماز کو نفل بنالو ۔ ‘ ‘ کہا : عبداللہ نے کہا : مجھے بتایا گیا کہ نبی اکرم ﷺ نے ( بھی ) ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی ران پر ہاتھ مارا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 1472,
			"arabicnumber": "649.01",
			"text": "مالک نےابن شہاب ( زہری ) سے ، انھوں نے سعید بن مسیب سے اور انھوں نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت یک کہ رسول اللہ ﷺ نے فرمایا : ’’ باجماعت نماز تمھارے اکیلے کی نماز سے پچیس گنا ہ افضل ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 1473,
			"arabicnumber": "649.02",
			"text": "عبدالاعلی نے معمر سے ، انھوں نے زہری سے ، اسی سند کے ساتھ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے روایت کی ، آپ نے فرمایا : ’’ سب کے ساتھ مل کر نماز پڑھنا اکیلے انسان کی نماز سے پچیس درجے افضل ہے ۔ ’’آپ نے فرمایا : ’’رات کے فرشتے اور دن کے فرشتے فجر کی نماز میں جمع ہوتے ہیں ۔ ‘ ‘ ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تم چاہو تو یہ آیت پڑھ لو ( جو اس بات کی تصدیق کرتی ہے ) : ’’ اور فجر کے وقت قرآن پڑھنا بلاشبہ فجر کی قراءت میں حاضری دی جاتی ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 1474,
			"arabicnumber": "649.03",
			"text": "شعیب نے زہری سے روایت کی ، کہا : مجھے سعیداور ابو سلمہ نے خبر دی کہ حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : میں نے نبی ﷺ سے سنا ، آپ فرما رہے تھے ۔ ۔ ۔ ۔ آگے معمر سے عبدالاعلیٰ کی ( مذکورہ بالا ) حدیث کی ‌رضی ‌اللہ ‌عنہ ‌ ‌ طرح ہے ، اس کے سوا کہ انھوں نے ( درجے کی بجائے ) ’’پچیس جز ‘ ‘ کہا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 1475,
			"arabicnumber": "649.04",
			"text": "سلمان اغر نے حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ’’باجماعت نماز اکیلے کی پچیس نمازوں کے برابر ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 1476,
			"arabicnumber": "649.05",
			"text": "عمر بن عطاء بن ابی خوار نے خبر دی کہ میں نے نافع بن جبیر بن مطعم کے پاس بیٹھا ہوا تھا کہ اس اثنا میں ہمارے پاس سے جہنیوں کے آزاد کردہ غلام زید بن زبان کے بہنوئی ابو عبداللہ گزرے ، نافع نے انھیں بلایا ( اور حدیث سنا نے کو کہا ۔ ) انھوں نے کہا : میں نے ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو کہتے ہوئے سنا : رسول اللہ ﷺ نے فرمایا : ’’امام کے ساتھ ( پڑھی گئی ) نماز ایسی پچیس نمازوں سے افضل ہے جو انسان اکیلے پڑھتا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 1477,
			"arabicnumber": "650.01",
			"text": "مالک نے نافع سے اورانھوں نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺنے فرمایا : ’’با جماعت نماز پڑھنا اکیلے کی نماز سے ستائیس درجے افضل ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 1478,
			"arabicnumber": "650.02",
			"text": "یحییٰ نے عبید اللہ سے حدیث بیان کی ، کہا : مجھے نافع نے حضرت ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے خبر دی ، انھوں نے نبی اکرم ﷺ سے روایت کی کہ آپ نے فرمایا : ’’آدمی کی جماعت کے ساتھ نماز اسکی اکیلے پڑھی گئی ستائیس نمازوں سے بڑھ کر ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 1479,
			"arabicnumber": "650.03",
			"text": "ابو بکر بن ابی شیبہ نےہمیں حدیث سنائی ، کہا : ہمیں ابو اسامہ اور ( محمد بن عبداللہ ) ابن نمیر نے حدیث سنائی ، نیز ابن نمیر نے ( کہا : ) ہمیں میرے والد نے حدیث سنائی ، ان دونوں ) ( ابو اسامہ اور ابن نمیر ) نے کہا : ہمیں عبیداللہ نے اسی سندکے ساتھ یہی حدیث بیان کی ۔ ابن نمیر نے اپنےوالد سے روایت کردہ حدیث میں بضعا و عشرین ( بیس سے زائد ) کے الفاظ روایت کیے اور ابوبکر بن ابی شبیہ نے اپنی روایت میں ستائیس درجے کہا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 1480,
			"arabicnumber": "650.04",
			"text": "ضحاک نے نافع سے ، انھوں نے ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی اکرم ﷺ سے روایت کی ، فرمایا : ’’بیس سے زائد ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 1481,
			"arabicnumber": "651.01",
			"text": "اعرج نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺنے کچھ لوگوں کو ایک نماز میں غیر حاضر پایا تو فرمایا : ’’میں نے ( یہا ں تک ) سوچا کہ کسی آدمی کو لوگوں کی امامت کرانے کا حکم دو ں ، پھر دوسری طرف سے ان لوگوں کی طرف جاؤں جو نماز سے پیچھے رہتےہیں اور ان کے بار ے میں ( اپنے کارندوں کو ) حکم دوں کہ لکڑیوں کے گٹھوں سے آگ بھڑکا کر ان کے گھروں کو ان پر جلا دیں ۔ ان میں سے اگرکسی کو یقین ہو کہ نماز میں حاضری سے اسے فربہ ( گوشت سے بھر ہوئی ) ہڈی ملے گی تو وہ اس میں ضرور حاضر ہو جائے گا ۔ ‘ ‘ آپ ﷺ کی مراد عشاء کی نماز سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 1482,
			"arabicnumber": "651.02",
			"text": "ابو صالح نےحضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ’’منافقوں کے لیے سب سے بھاری نماز عشاء اور فجر کی نماز ہے ، اگر ان لوگوں کو پتہ چل جائے ، جو ان میں ( خیرو برکت ) ہے تو چاہے انھیں گھٹنوں کے بل چل کر آنا پڑے ، ضرور آئیں ۔ اور میں نے سوچاتھا کہ نماز کی اقامت کا حکم دو ں ، پھر کسی شخص کو کہوں وہ لوگوں کو جماعت کرائے ، پھر میں کچھ اشخاص کو ساتھ لے کر ، جن کے پاس لکڑیوں کے گٹھے ہوں ، ان لوگوں کی طرف جاؤں جو نماز میں حاضر نہیں ہوتے ، پھر ان کے گھروں کو ان پر آگ سے جلا دو ں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 1483,
			"arabicnumber": "651.03",
			"text": "ہمام بن منبہ سے روایت ہے ، کہا : یہ احادیث ہیں جو ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےہمیں رسول اللہ سے روایت کیں ، پھر انھوں نے متعدد احادیث بیان کیں ، ان میں سے یہ بھی تھی کہ رسول اللہ نے فرمایا : ’’میں نے ارادہ کیا تھا کہ اپنے جوانوں کو حکم دوں کہ وہ میری خاطر لکڑی کے گٹھے تیار کریں ، پھر کسی آدمی کو حکم دوں وہ لوگوں کو نماز پڑھائے ، پھر گھروں کو ان کے ( بے نماز ) باسیوں سمیت جلا دیا جائے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 1484,
			"arabicnumber": "651.04",
			"text": "یزید بن اصم نے ابو ہریرہ ﷺ سے اور انھوں نے نبی اکرم ﷺ سے اسی کی طرح حدیث روایت کی ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 1485,
			"arabicnumber": "652",
			"text": "حضرت عبداللہ بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ نبی ﷺ نے ان لوگوں سے جو جمعے سے پیچھے رہ جاتے ہیں ، فرمایا : ’’میں نے ارادہ کیا کہ کسی آدمی کو حکم دو ں وہ لوگوں کو نماز پڑھائے ، پھر ان لوگوں کے گھروں کو ان پر ( اس سمیت ) جلادوں جو جمعے سے پیچھے رہتے ہیں",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 1486,
			"arabicnumber": "653",
			"text": "حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ، انھوں نے کہا : نبی اکرم ﷺ کی خدمت میں اکی نابینا آدمی حاضر ہوا اور عرض کی : اے اللہ کےرسول ! میرے پاس کوئی لانے والا نہیں جو ( ہاتھ سے پکڑ کر ) مجھے مسجد میں لے آئے ۔ اس نے رسول اللہ ﷺ سے درخواست کی کہ اسے اجازت دی جائے کہ وہ اپنے گھر میں نماز پڑھ لے ۔ آپ نے اسے اجازت دے دی ، جب وہ واپس ہو ا تو آپ ﷺ نے اسے بلایا اور فرمایا : ’’کیا تم نماز کا بلاوا ( اذان ) سنتے ہو؟ ‘ ‘ اس نے عرض کی : جی ہاں ۔ آپ نے فرمایا : ’’تو اس پر لبیک کہو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 1487,
			"arabicnumber": "654.01",
			"text": "عبد الملک بن عمیر نے ابو احوص سے روایت کی ، کہا : حضرت عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) نےکہا : ساتھیوں سمیت میں نےخود کو دیکھا کہ نماز سے کوئی شخص پیچھے نہ رہتا ، سوائے منافق کے ، جس کا نفاق معلوم ہوتا یا سوائے بیمار کے اور ( بسا اوقات ) بیمار بھی دو آدمیوں کے سہائے سے چلتا آ جاتا یہاں تک کہ نماز میں شامل ہو جاتا ۔ انھوں نے کہا : رسول اللہ ﷺ نےہمیں ہدایت کے طریقوں کی تعلیم دی اور ہدایت کے طریقوں میں سے ایسی مسجد میں نماز پڑھنا بھی ہے جس میں اذان دی جاتی ہو ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 1488,
			"arabicnumber": "654.02",
			"text": "علی بن اقمر نے ابو احوص سے اور انھوں نے حضرت عبداللہ ( بن مسعود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) سے روایت کی ، کہا : جو یہ چاہے کہ کل ( قیامت کے دن ) اللہ تعالیٰ سے مسلمان کی حیثیت سے ملے تو وہ جہاں سے ان ( نمازوں ) کے لیے بلایا جائے ، ان نمازوں کی حفاظت کرے ( وہاں مساجد میں جا کر صحیح طرح سے انھیں ادا کرے ) کیونکہ اللہ تعالیٰ نے تمھائے نبی ﷺ کے لے ہدایت کے طریقے مقرر فرما دیے ہیں اور یہ ( مساجد میں باجماعت نماز یں ) بھی انھی طریقوں میں سے ہیں ۔ کیونکہ اگر تم نمازیں اپنے گھروں میں پڑھو گے ، جیسے یہ جماعت سے پیچھے رہنے والا ، اپنے گھر میں پڑھتا ہےتو تم اپنے نبی کی راہ چھوڑ دو گے اور اگر تم اپنے نبی کی راہ کو چھوڑ دو گے تو گمراہ ہو جاؤ گے ۔ کوئی آدمی جو پاکیز گی حاصل کرتا ہے ( وضوکرتا ہے ) اور اچھی طرح وضو کرتا ہے ، پھر ان مساجد میں سے کسی مسجد کا رخ کرتا ہے تو اللہ تعالیٰ اس کے ہر قدم کے بدلے ، جو وہ اٹھاتا ہے ، ایک نیکی لکھتا ہے ، اور اس کے سبب اس کا ایک درجہ بلند فرماتا ہے اور اس کا ایک گناہ کم کر دیتا ہے ، اور میں نے دیکھا کہ ہم میں سے کوئی ( بھی ) جماعت سے پیچھے نہ رہتا تھا ، سوائے ایسے منافق کے جس کا نفاق سب کو معلوم ہوتا ( بلکہ بسا اوقات ایسا ہوتا کہ ) ایک آدمی کو اس طرح لایا جاتا کہ اسے دو آ دمیوں کے درمیان سہارا دیا گیا ہوتا ، حتی کہ صف میں لاکھڑا کیا جاتا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 1489,
			"arabicnumber": "655.01",
			"text": "ابراہیم بن مہاجر نے ابو شعثاء سے روایت کی ، کہا : ہم مسجد میں حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ساتھ بیٹھے ہوئے تھے کہ مؤذن نے اذان کہی ، ایک آدمی مسجدسے اٹھ کر چل پڑا ، حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےمسلسل اس پر نظر رکھی حتی کہ وہ مسجد سے نکل گیا ، حضرت ابو ہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : یہ شخص ، یقینا اس نے ابو القاسم ﷺ کی نافرمانی کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 1490,
			"arabicnumber": "655.02",
			"text": "اشعث بن ابی شعثاء محاربی نے اپنے والد سے روایت کی ، کہا : میں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا : انھوں نے ایک شخص کو اذان کے بعد مسجد میں سے چل کر باہر نکلتے دیکھتا تو فرمایا : یہ شخص ، بلاشبہ اس نے ابو القاسم ﷺ کی نافرمانی کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 1491,
			"arabicnumber": "656.01",
			"text": "عبدالواحد بن زیاد نے ہمیں حدیث سنائی ، کہا : ہم سے عثمان بن حکیم نے حدیث بیان کی ، کہا : ہمیں عبدالرحمان بن ابی عمرہ نے حدیث سنائی ، کہا : حضرت عثمان بن عفان ‌رضی ‌اللہ ‌عنہ ‌ ‌ مغر ب کی نماز کے بعد مسجد میں تشریف لائے اور اکیلے بیٹھ گئے ، میں بھی ان کے پاس بیٹھ گیا ، وہ کہنے لگے : بھتیجے ! میں نے رسول اللہ ﷺ کو فرماتے ہوئے سنا : ’’ جس نے عشاء کی نماز باجماعت ادا کی تو گویا اس نے آدھی رات کا قیام کیا اور جس نےصبح کی نماز ( بھی ) جماعت کے ساتھ پڑھی تو گویا اس نے ساری رات نماز پڑھی ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 1492,
			"arabicnumber": "656.02",
			"text": "سفیان نے ابو سہل عثمان بن حکیم سے اسی سند کے ساتھ اسی طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 1493,
			"arabicnumber": "657.01",
			"text": "بشر ، یعنی ابن مفضل نے ہمیں حدیث سنائی ، انھوں نے خالد سے اور انھوں نے انس بن سیرین سے روایت کی ، کہا : میں نے حضرت جندب بن عبداللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے سنا ، وہ کہہ رہے تھے : رسول اللہ ﷺ نے فرمایا : ’’جس شخص نے صبح کی نماز پڑھی و ہ اللہ تعالیٰ کی ذمہ داری ( امان ) میں ہے ۔ تو ایسانہ ہو کہ ( ایسے شخص کو کسی طرح نقصان پہنچانے کی بناپر ) اللہ تعالیٰ تم ( میں سے کسی شخص ) سے اپنے ذمے کے بارے میں کسی چیز کا مطالبہ کرے ، پھر وہ اسے پکڑ لے ، پھر اسے اوندھے منہ جہنم میں ڈال دے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 1494,
			"arabicnumber": "657.02",
			"text": "اسماعیل نے خالد سے او ر انھوں نے انس بن سیرین سے روایت کی ، کہا : میں نے جندب ( بن عبداللہ ) قسری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےسنا ، وہ کہتے تھے کہ رسول اللہ ﷺ نے فرمایا : ’’ جس نے صبح کی نماز ادا کی ، وہ اللہ کے ذمے میں آگیا ، ( دعا ہے ) اللہ تم سے اپنے ذمے کے حوالے سے کوئی مطالبہ نہ کرے کیونکہ جس سے وہ اپنے ذمے میں سے کسی چیز کا مطالبہ کر لے ، اسے پالیتا ہے ، پھر اسے اوندھے منہ جہنم کی آگ میں ڈال دیتا ہے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 1495,
			"arabicnumber": "657.03",
			"text": "یہی روایت حسن بصری نے جندب بن سفیان کے حوالے سے نبی ﷺ سے روایت کی ( لیکن آخری فقرہ ) فیکبہ فی نار جہنم ( اس کو جہنم میں اوندھے منہ پھینک دیتا ہے ) بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 1496,
			"arabicnumber": "33.03",
			"text": "یونس نے ابن شہاب سےروایت کی کہ محمود بن ربیع انصاری ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ان سے بیان کیاکہ حضرت عتبان بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے جو ان صحابہ کرام میں سے تھے جو انصار میں سے جنگ بدر میں شریک ہوئے تھے ، ( بیان کیا ) کہ وہ رسول اللہ ﷺ کی خدمت میں حاضر ہو ئے اور عرض کی : اے اللہ کے رسول ! میری نظر خراب ہو گئی ہے ، میں اپنی قوم کو نماز پڑھتا ہوں اور جب بارشیں ہوتی ہیں تو میرے اور ان کےدرمیان والی وادی میں سیلاب آجاتا ہے ، اس کی وجہ سے میں ان کی مسجد میں نہیں پہنچ سکتا کہ میں انھیں نماز پڑھاؤں تو اے اللہ کے رسول! میں چاہتا ہوں کہ آپ ( میرگھر ) تشریف لائیں اور نماز پڑھنے کی کسی ایک جگہ پر نماز پڑھیں تاکہ میں اس جگہ کو ( مستقل طور پر ) جائے نماز بنالوں ۔ کہا : آپ ﷺ نے فرمایا : ’’ ان شاء اللہ میں ایسا کروں گا ۔ ‘ ‘ عتبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تو صبح کے وقت دن چڑھتے ہی آپ ﷺ اور ابوبکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ تشریف لائے ، رسول اللہ ﷺ نے ( اندر آنے کی ) اجازت طلب فرمائی ، میں نے تشریف آوری کا کہا ، آپ آ کر بیٹھے نہیں یہاں تک کہ گھر کے اندر ( کے حصے میں ) داخل ہوئے ، پھر پوچھا : ’’تم اپنے گھر میں کس جگہ چاہتے ہو کہ میں ( وہاں ) نماز پڑھوں ؟ ‘ ‘ میں نے گھر کے ایک کونے کی طرف اشارہ کیا تو رسول اللہ ﷺ نے کھڑے ہو کر تکبیر ( تحریمہ ) کہی اور ہم آپ کے پیچھے کھڑے ہو گئے ، آپ نے دورکعتیں ادا فرمائیں ، پھر سلام پھیر دیا ۔ اس کے بعد ہم نے آپ کو خزیر ( گوشت کے چھوٹے ٹکڑوں سے بنے ہوئے کھا نے ) کے لیے روک لیا جو ہم نے آپ کے لیے تیار کیا تھا ۔ ( عتبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ( آپ کی آمد کا سن کر ) اردگرد سے محلے کے لوگ آگئے حتی کہ گھر میں خاصی تعدا د میں لوگ اکٹھے ہو گئے ۔ ان میں سے ایک بات کرنے والے نے کہا : مالک بن دخشن کہاں ہے ؟ ان میں سے کسی نے کہا : وہ تو منافق ہے ، اللہ اور اس کے رسول سے محبت نہیں رکھتا ۔ تو رسول اللہ ﷺ نے فرمایا : ’’ اس کے بارے میں ایسا نہ کہو ، کیا تمھیں معلوم نہیں کہ اس نے اللہ کی رضا حاصل کرنے کے لیے لاالہ الاللہ کہا ہے ؟ ‘ ‘ ( عتبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : تو لوگوں نے کہا : اللہ اور اس سکے رسول ہی زیادہ جاننے والے ہیں ۔ اس ( الزام لگانے والے ) نےکہا : ہم تو اس کی وجہ اور اس کی خیر خواہی منافقوں ہی کے لے دیکھتے ہیں ۔ تو رسول اللہ ﷺنے فرمایا : ’’بے شک اللہ تعالیٰ نے اسے شخص کو آگ پر حرام قرار دیا ہے جو لاالہ الا اللہ کہتا ہے اور اس کے ذریعے سے اللہ کی رضا کا طلب گار ہے ۔ ‘ ‘ ابن شہاب نے کہا : میں نے ( بعد میں ) حصین بن محمد انصاری سے ، جو بنو سالم سے تعلق رکھتے ہیں ان کے سرداروں میں سے ہیں ، محمود بن ربیع ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی اس حدیث کے بارے میں پوچھا تو انھوں نے اس میں ان ( محمود ‌رضی ‌اللہ ‌عنہ ‌ ‌ ) کی تصدیق کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 1497,
			"arabicnumber": "33.04",
			"text": "معمر نے زہر ی سے روایت کی ، کہا : مجھے محمود بن ربیع ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے عتبان بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی ، کہا : میں رسول اللہ ﷺ کے پاس حاضر ہوا ۔ ۔ ۔ ۔ ۔ پھر یونس کی حدیث کے ہم معنی حدیث بیان کی ، البتہ یہ کہا : تو ایک آدمی نے کہا : مالک بن دخشن یا دخیشن کہاں ہے ؟ اور حدیث میں یہ اضافہ کیا : محمود ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہاں : میں نے یہ حدیث چند لوگوں کو ، جن میں ابو ایوب انصاری ‌رضی ‌اللہ ‌عنہ ‌ ‌ بھی موجود تھے ، سنائی تو انھوں نے کہا : میں نہیں سمجھتا کہ جو بات تم بیان کرتے ہو رسول اللہ ﷺ نے فرمائی ہو ۔ اس پر میں نے ( دل میں ) قسم کھائی کہ اگر میں عتبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے ہاں دوبارہ گیا تو ان سے ( اس کے بارے میں ضرور ) پوچھوں گا ۔ تو میں دوبارہ ان کے پاس آیا ، میں نے دیکھا کہ وہ بہت بوڑھے ہو چکے ہیں ، ان کی بینائی ختم ہو چکی تھی لیکن وہ ( اب بھی ) اپنی قوم کے امام تھے ۔ میں ان کے پہلو میں بیٹھ گیا اور ان سے اس حدیث کے بارے میں پوچھا تو انھوں نے مجھے بالکل اسی طرح ( ساری ) حدیث سنائی جس طرح پہلے سنائی تھی ۔ زہری نے کہا : اس واقعے کے بعد بہت سے فرائض اور دیگر امور ( احکام ) نازل ہوئے اور ہماری نظر میں معاملہ انھی پر تمام ہوا ، لہذا جو انسان چاہتا ہےکہ ( عتبان ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی حدیث کے ظاہری مفہوم سے ) دھو کا نہ کھائے ، وہ دھوکا کھا نے سے بچے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 1498,
			"arabicnumber": "33.05",
			"text": "اوزاعی سے روایت ہے ، کہا : مجھے زہری نے حضرت محمود بن ربیع ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے حدیث سنائی ، کہا : مجھے رسول اللہ ﷺ کا وہ کلی کرنا اچھی طرح یا د ہے جو آپ نے ہمارے گھر میں ایک ڈول سے ( پانی لے کر ) کی تھی ( اور اس کا پانی میر منہ پر ڈالا تھا ) ۔ محمود ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا کہ مجھے عتبان بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا کہ میں نے عرض کی : اے اللہ کے رسول! میری نظر میں خرابی پیداہو گئی ہےغاور اس بات تک حدیث بیان کی کہ آپ ﷺ نے دو رکعات نماز پڑھائی اور یہ کہ ہم نے رسول اللہ ﷺ کو جشیشہ ( خزیر سے ملتے جلتے کھانے ) کے لیے روک لیا جو ہم نے آپ کے لیے بنایا تھا ۔ انھوں ( اوزاعی ) نےاس کے بعد یونس اور معمر والا اضافہ بیان نہیں کیا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 1499,
			"arabicnumber": "658",
			"text": "اسحاق بن عبداللہ بن ابی طلحہ نےحضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ ان کی نانی ملیکہ رضی اللہ تعالیٰ عنہا نے رسول اللہ ﷺ کوکھانے پر بلایا جو انھوں نے تیار کیا تھا ۔ آپ ﷺ نے اس میں سے ( کچھ ) تناول کیا ، پھر فرمایا : ’’کھڑے ہو جاؤ میں تمھاری ( برکت کی ) خاطر نماز پڑھوں ۔ ‘ ‘ انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میں کھڑا ہوا اور اپنی ایک چٹائی کی طرف بڑھا جو لمبا عرصہ استعمال ہونےکی وجہ سے کالی ہو چکی تھی ، میں نے ( اسےصاف کرنے کےلیے ) اس پر پانی بہایا تو رسول اللہ ﷺ اس پر کھڑے ہوئے ، میں اور ( وہاں موجود ایک ) یتیم بچے نے آپ کے پیچھے صف بنائی ، بوڑھی خاتون ہمارے پیچھے ( کھڑی ) ہوگئیں ۔ رسول اللہ ﷺ نے ہمارے ( حصول برکت کے ) لیے دو رکعت نماز پڑھی ، پھر تشریف لے گئے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 1500,
			"arabicnumber": "659",
			"text": "ابو التیاح نےحضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ تمام انسانوں میں سب سے زیادہ خوبصورت اخلاق کے مالک تھے ۔ بسا اوقات آپ ہمارے گھر میں ہوتے اور نماز کا وقت ہو جاتا ، پھر آپ اس چٹائی کے بارے میں حکم دیتے جو آپ کے نیچے ہوتی ، اسے جھاڑا جاتا ، پھر اس پر پانی چھڑکا جاتا ، پھر آپ امامت فرماتے اور ہم آپ کے پیچھے کھڑے ہوتے اور آپ ہمیں نماز پڑھاتے ۔ کہا : ان کی چٹائی کجھور کے پتوں کی ہوتی تھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": "660.01",
			"text": "حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےروایت کی ، کہا : نبی ﷺ ہمارے ہاں تشریف لائے وہاں میرے ، میری والدہ اور میری خالہ ام حرام کے سوا کوئی نہ تھا ، آپ نے فرمایا : ‘ ‘ کھڑے ہو جاؤ میں تمھیں نماز پڑھا دوں ۔ ٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗٗ’ ( فرض ) نماز کے وقت کے بغیر ، آپ نے ہمیں نماز پڑھائی ۔ ایک آدمی نے ثابت سے پوچھا : آپ ﷺنے انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو اپنی کس جانب کھڑا کیا تھا؟ انھوں نے کہا : آپ ﷺ نے انہیں اپنے دائیں ہاتھ کھڑا کیا تھا ۔ پھر آپ نے ہمارے ، سب گھر والوں کے لئے دنیا اور آخرت کی تمام بھلائیوں کی دعا فرمائی ، اس کے بعد میری ماں کہنے لگی : اللہ کے رسول! ( یہ ) آپ کا چھوٹا سا خدمت گزار ہے ، اللہ سے اس کے لئے ( خصوصی ) دعا کریں ۔ کہا : آپ نے میرے لئےہر بھلائی کی دعا کی اور میرے لئے آپ نے جو دعا کی اس کے آخر میں یہ تھا ، آپ نے فرمایا : ‘ ‘ اے اللہ!اس کا مال اور اس کی اولاد زیادہ کر اور اس کے لئے ان میں برکت ڈال دے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": "660.02",
			"text": "معاذ عنبری نے کہا : ہمیں شعبہ نے عبداللہ بن مختار سے حدیث سنائی ، انھوں نے موسیٰ بن انس سے سنا ، وہ حضرت انس بن مالک رضی اللہ عنہ سے حدیث بیان کر رہے تھے کہ رسول اللہ ﷺنے انھیں اور ان کی والدہ یا ان کی خالہ کو نماز پڑھائی ، کہا : آپ نے مجھے اپنی دائیں جانب اور عورت کو ہمارے پیچھے کھڑا کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": "660.03",
			"text": "محمد بن جعفر اور عبدالرحمان بن مہدی نے شعبہ سے اسی سند کے ساتھ یہی حریث بیان کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": "513.02",
			"text": "عبداللہ بن شداد سے روایت ہے ، کہا : مجھے نبیﷺ کی زوجہ حضرت میمونہ رضی اللہ عنہا نے حدیث بیان کی ، فرمایا : ٰ رسول اللہ ﷺ نماز پڑھتے اور میں آپ کے سامنے ہوتی اور اکثر ایسا ہوتا کہ جب آپ سجدہ کرتے تو آپ کا کپڑا مجھے لگتا اور آپ ( کھجور کے پتوں اور دھاگوں سے بنی ہوئی ) ایک جائے نماز پر نماز پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": "661",
			"text": "حضرت جابر رضی اللہ عنہ سے روایت ہے ، کہا : ہمیں حضرت ابو سعید خرری رضی اللہ عنہ نے حدیث سنائی کہ وہ رسول اللہ ﷺ کے ہاں حاضر ہوئے تو دیکھا کہ آپ ایک چٹائی پر نماز پڑھ رہے ہیں ، اسی پر سجدہ کر رہے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": "649.06",
			"text": "ابو معاویہ نے اعمش سے حدیث بیان کی ، انھوں نے ابو صالح سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ‘ ‘ آدمی کی باجماعت ( ادا کی گئی ) نماز اس کی گھر میں یا بازار میں پڑھی ہوئی نماز کی نسبت بیس سے زیادہ درجے بڑھ کر ہے اور وہ یوں کہ جب ان میں سے کوئی وضو کرتا ہے اور اچھی طرح وضو کرتا ہے ، پھر مسجد آتا ہے ، اسے نماز ہی نے اٹھایا ہے اور نماز کے علاوہ کچھ نہیں چاہتا ۔ تو وہ کوئی قدم نہیں اٹھاتا مگر اس کے سبب سے اس کا درجہ بلند کر دیا جاتا ہے اور اس کا ایک گناہ مٹا دیا جاتا ہے ، یہاں تک کہ مسجد میں داخل ہو جاتا ہے ، پھر جب مسجد میں داخل ہو جاتا ہے تو جب تک نماز اسے روکے رکھتی ہے وہ نماز ہی میں ہوتا ہے ( اس کے انتظار کا وقت نماز میں شمار ہوتا ہے ) اور تم میں سے کوئی شخص جب تک اس جگہ رہتا ہے جہاں اس نے نماز پڑھی ہے تو فرشتے اس کے حق میں دعا کرتے رہتے ہیں ۔ وہ کہتے ہیں : ‘ ‘ اے اللہ اس پر رحم فرما !اے اللہ ! اس کی توبہ قبول فرما! جب تک وہ اس جگہ ( پر کسی کو ) تکلیف نہیں پہنچاتا اور جب تک وہ اس جگہ بے وضو نہیں ہوتا ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": "649.07",
			"text": "عبثر ‌رضی ‌اللہ ‌عنہ ‌ ‌ ، اسماعیل بن زکریا اور شعبہ ، سب نے اعمش کی اسی سند کے ساتھ اس کے ہم معنی روایت بیان کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": "649.08",
			"text": "ابن سیرین نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ ﷺنے فرمایا : ‘ ‘ تم میں سے کوئی شخص جب تک اپنی ( نماز پڑھنے کی ) جگہ پر بیٹھا رہتا ہے ، فرشتے اس کے حق میں دعا کرتے رہتے ہیں ، کہتے ہیں : اے اللہ! اسے بخش دے! اے اللہ اس پر رحم فرما! جب تک وہ بے وضو نہیں ہوتا ، نیز جب تک تم میں سے کسی شخض کو نماز روکے رکھتی ہے ، وہ نماز ہی میں ہوتا ہے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": "649.09",
			"text": "ابو رافع نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ‘ ‘ بندہ مسلسل نماز ہی میں ہوتا ہے جب تک وہ نماز کی جگہ پر نماز کے انتظار میں رہتا ہے اور فرشتے کہتے رہتے ہیں : اے اللہ! اسے معاف فرما!اے اللہ!اس پررحم فرما! یہاں تک کہ وہ چلا جاتا ہے یا بے وضو ہو جاتا ہے ۔ ‘ ‘ ( ابو رافع کہتے ہیں : ) میں نے ابوہریرہ رضی اللہ عنہ سے پوچھا : يحدث كا مطلب کیا ہے؟ انھوں نے کہا : آواز کے بغیر یا آواز کے ساتھ ہوا خارج کر دے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": "649.10",
			"text": "ابو زناد نے اعرج سے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ‘ ‘ جب تک تم میں سے کسی کو نماز روکے رکھتی ہے وہ مسلسل نماز میں ہوتا ہے ، اسے گھر کی طرف لوٹنے سے نماز کے علاوہ اور کسی چیز نے نہیں روکا ہوتا ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": "649.11",
			"text": "ابن شہاب نے ( عبدالرحمان ) بن ہرمز ( اعرج ) سے اور انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ‘ ‘ تم میں سے کوئی شخص جتنی دیر نماز کے انتظار میں بیٹھا ہے نماز ہی میں رہتا ہے جب تک بے وضو نہ ہو جائے ۔ فرشتے اس کے لئے دعا کرتے رہتے : اے اللہ ! اسے معاف فرما! اے اللہ!اس پؓر رحم فرما ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": "649.12",
			"text": "ہمام بن منبہ نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ رضی اللہ عنہ سے اور انھوں نے نبی ﷺ سے اسی کے مطابق روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": "662",
			"text": "عبداللہ بن براداشعری اور ابو کریب دونوں نے کہا : ہم سے ابو اسامہ نے برید سے حدیث بیان کی ، انھوں نے ابوبردہ سے اور انھوں نے حضرت ابو موسیٰ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ‘ ‘ نماز میں سب سے زیادہ ثواب اس کا ہے جو اس کے لیے زیادہ دور سے چل کر آتا ہے ۔ پھر ( اس کے بعد ) جو ان میں سے سب سے زیادہ دور سے چل کر آتا ہے ۔ اور جوآدمی نماز کا انتظار کرتا ہے تاکہ اسے امام کے ساتھ ادا کرے ، اجر میں اس سے بہت بڑھ کر ہے جو نماز پڑھتا ہے ، پھر سو جاتا ہے ۔ ’’ ابو کریب کی روایت میں ہے : ‘ ‘ یہاں تک کہ وہ اسے امام کے ساتھ جماعت میں ادا کرے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": "663.01",
			"text": "عبثر نے ہمیں خبر دی ، انھوں نے سلیمان تیمی سے ، انھوں نے ابوعثمان نہدی سے اور انھوں نے حضرت ابی بن کعب رضی اللہ عنہ سے روایت کی ، کہا : ایک آدمی تھا ، میرے علم میں کوئی اور آدمی اس کی نسبت مسجد سے زیادہ فاصلے پر نہیں رہتا تھا اور اس کی کوئی نماز نہیں چوکتی تھی ، اس سے کہا گیا-یا میں نے ( اس سے ) کہا- : اگر آپ گدھا خرید لیں کہ ( رات کی ) تاریکی اور ( دوپہر کی ) گرمی میں آپ اس پر سوار ہو جایا کریں ۔ اس نے جواب دیا : مجھے یہ بات پسند نہیں ہے کہ میرا گھر مسجد کے پڑوس میں ہو ، میں چاہتا ہوں میرا مسجد تک چل کر جانا اور جب میں گھر والوں کی طرف لوٹوں تو میرا لٹنا میرے لئے لکھا جائے ۔ تو رسول اللہ ﷺ نے فرمایا : ‘ ‘ اللہ تعالیٰ نے یہ سب کچھ تمھارے لئے اکٹھا کر دیا ہے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": "663.02",
			"text": "عتمر بن سلیمان اور جریر دونوں نے تیمی سے اسی سند کے ساتھ اسی کے مطابق روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": "663.03",
			"text": "عباد بن عباد نے ہمیں حدیث سنائی ، کہا : ہمیں عاصم نے ابو عثمان سے حدیث سنائی ، کہا : انصار میں ایک آدمی تھا ، اس کا گھر ، مدینہ میں سب سے دور ( واقع ) تھا اور اس کی کوئی نماز رسول اللہ ﷺ کی اقتدا میں پڑھنے سے چوکتی نہیں تھی ، ہم نے اس کے لئے ہمدردی محسوس کی تو میں نے اسے کہا : جناب ! اگر آپ ایک گدھا خرید لیں جو آپ کو گرمی اور زمین کے ( زہریلے ) کیڑوں سے بچائے ( تو کتنا اچھا ہو! ) اس نے کہا : مکر اللہ کی قسم! جھے یہ نہیں کہ میرا گھر ( خیمے کی طرح ) کنابوں کے ذریعے سے محمد ﷺ کے گھر سے بندھا ہوا ہو ۔ مجھے اس کی یہ بات بہت گراں گزری حتی کہ میں اسی کیقیت میں نبی اکرم ﷺ کی خدمت میں حاضر ہوا اور آپ کو اس بات کی خبر دی ۔ آپ نے اسے بلوایا تو اس نے آپ کو بھی وہی جواب دیا اور آپ کو بتایا کہ وہ آنے جانے پر اجر کی امید رکھتا ہے ۔ تو نبی ‌رضی ‌اللہ ‌عنہ ‌ ‌ ﷺ نے فرمایا : ‘ ‘ تمھیں یقینا وہی اجر ملے گا جسے تم حاصل کرنا چاہتے ہو ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": "663.04",
			"text": "ابن عینیہ اور وکیع نے اپنے والد کے حوالے سے عاصم سے اسی سند کے ساتھ اسی طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": "664",
			"text": "ابوزبیر نے ہمیں حدیث سنائی ، کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے سنا ، کہا : ہمارے گھر مسجد سے دور واقع تھے ، ہم نے چاہا کہ ہم اپنے گھروں کو فروخت کر کے مسجد کے قریب آجائیں تو رسول اللہ ﷺ نے ہمیں روک دیا اور فرمایا : ‘ ‘ تمھارے لئے ہر قدم کے بدلے میں ایک درجہ ہے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 1519,
			"arabicnumber": "665.01",
			"text": "جریری نے ابونضرہ سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہا سے روایت کی ، کہا : ( رسول اللہ ﷺ کی ) مسجد کے ارد گرد کی جگہیں خالی ہوئیں تو ( ان کے قبیلے ) بنو سلمہ کے لوگوں نے ارادہ کیا کہ مسجد کے قریب منتقل ہو جائیں ، رسول اللہ ﷺ کو یہ بات پہنچی تو آپ نے ان سے کہا : ’’مجھے خبر پہنچی ہے کہ تم مسجد کے قریب منتقل ہونا چاہتے ہو ۔ ‘ ‘ انھوں نے عرض کی : جی ہاں ، اے اللہ کے رسول! ہم یہی چاہتے ہیں ۔ تو آپ نے فرمایا : ‘ ‘ بنو سلمہ! اپنے گھروں میں رہو ، تمھارے قدموں کے نشان لکھے جاتے ہیں ، ( پھر فرمایا : ) اپنے گھروں ہی میں رہو ، تمھارے قدموں کے نشان لکھے جاتے ہیں ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": "665.02",
			"text": "کہمس نے ابو نضرہ سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہا سے روایت کی ، کہا : بنو سلمہ نے مسجد کے قریب منتقل ہونے کا ارادہ کیا ، کہا : اور ( مسجد کے قریب ) جگہیں ( بھی ) خالی تھیں ۔ نبی اکرم ﷺ کو یہ خبر پہنچی تو آپ نے فرمایا : ‘ ‘ اے بنو سلمہ!اپنے گھروں میں رہو ، تمھارے قدموں کے نشان لکھے جاتے ہیں ۔ ’’ تو انھوں نے کہا : ( اس کے بعد ) ہمیں یہ بات اچھی ( بھی ) نہ لگتی کہ ہم منتقل ہو چکے ہو تے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": "666",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ سے روایت ہے ، کہا : رسول اللہ ﷺ نے فرمایا : ‘ ‘ جس نے اپنے گھر میں وضو کیا ، پھر اللہ کے گھروں میں سے اس کے کسی گھر کی طرف چل کر گیا تاکہ اللہ کے فرضوں میں سے ایک فریضے کو ادا کرے تو اس کے دونوں قدم ( یہ کرتے ہیں کہ ) ان میں سے ایک گناہ نٹاتا ہے اور دوسرا درجہ بلند کرتا ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": "667",
			"text": "لیث اور بکر دونوں نے ہاد سے ، انھوں نے محمد بن ابراہیم سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے روایت کی کہ رسول اللہ ﷺ نے فرمایا-اور بکر کی روایت میں ہے کہ انھوں ( ابوہریرہ رضی اللہ عنہ ) نے رسول اللہ ﷺ سے سنا ، آ پ نے فرمایا- ‘ ‘ تم کیا سمجھتے ہو اگر تم میں سے کسی کے گھر کے سامنے نہر ہو جس سے وہ ہر روز پانچ مرتبہ نہاتا ہو ، کیا اس ( کے جسم ) کا کوئی میا کچیل باقی رہ جائے گا؟’’ صحابہ نے عرض کی : اس کا کوئی میل کچیل باقی نہیں رہے گا ۔ آپ نے فرمایا یہی پانچ نمازوں کی مثال ہے ، اللہ تعالیٰ ان کے ذریعے سے گناہوں کو صاف کر دیتا ہے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": "668",
			"text": "اعمش نے ابو سفیان ( طلحہ بن نافع ) سے ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ ﷺ نے فرمایا : ‘ ‘ پانچ نمازوں کی مثال تم میں سے کسی ایک کے دروازے پر چلتی ہویئ بہت بڑی نہر کی سی ہے ، وہ اس میں سے روزانہ پانچ دفعہ غسل کرتا ہو ۔ ’’ ( اعمش نے ابوسفیان کی بجائے حسن کے حوالے سے روایت کرتے ہوئے ) کہا : حسن نے کہا : یہ غسل اس کے جسم پر کوئی میل کچیل نہیں چھوڑے گا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": "669",
			"text": "حضرت ابوہریرہ رضی اللہ عنہ نے نبی ﷺ سے روایت کی : ‘ ‘ جو شخص دن کے پہلے حصے میں یا دن کے دوسرے حصے میں مسجد کی طرف گیا اللہ تعالیٰ ( ہر دفعہ آنے پر ) اس کے لئے جنت میں میزبانی کا انتظام فرماتا ہے ، جب بھی وہ ( آئے ) صبح کو آئے یا شام کو آئے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": "670.01",
			"text": "ابو حثیمہ نے سماک بن حرب سے روایت کرتے ہوئے خبر دی ، کہا : میں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے کہا : کیا آپ رسول اللہ ﷺ کے ساتھ مجالس میں شریک ہوتے تھے؟ کہا : ہاں! بہت ۔ آپ جس جگہ صبح یا دن کے ابتدائی حصے کی نماز ادا فرماتے ، سورج طلوع ہونے تک وہاں سے نہ اٹھتے ۔ جب سورج طلوع ہو جاتا تو اٹھ کھڑے ہوتے ، لوگ دور جاہلیت میں کیے کاموں کے متعلق باتیں کرتے اور ہنستے تھے اور آپ ( بھی ان کی باتیں سن کر ) مسکراتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": "670.02",
			"text": "سفیان اور زکریا دونوں نے سماک سے اور انھوں نے حضرت جابر بن سمرہ رضی اللہ عنہ سے روایت کی کہ نبی ﷺ جب فجر پڑھتے تھے تو اپنی نماز کی جگہ پر بیٹھے رہتے حتی کہ سورج اچھی طرح نکل آتا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": "670.03",
			"text": "ابواحوص اور شعبہ دونوں نے سماک سے اسی سند کے ساتھ یہی روایت بیان کی لیکن حسنا ‘ ‘ اچھی طرح’’ ( سورج نکل آتا ) نہیں کہا",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 1528,
			"arabicnumber": "671",
			"text": "حضرت ابوہریرہ رضی اللہ عنہٗ سے روایت ہے کہ رسول اللہ ﷺ نے فرمایا : ‘شہروں ‌میں ‌پیاری ‌جگہ ‌اللہ ‌كے ‌نزدیك ‌مسجدیں ‌ہیں ‌ ‌اور ‌ ‘ اللہ کے نزدیک ( انسانی ) آبادیوں کا سب سے ناپسندیدہ حصہ ان کے بازار ہیں ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": "672.01",
			"text": "ابوعوانہ نے ہمیں قتادہ سے حدیث سنائی ، انھوں نے ابو نضرہ سے اور انھوں نے حضرت ابوسعید خدری رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ‘ ‘ جب ( نماز پڑھنے والے ) تین ہوں تو ان میں سے ایک ان کی امامت کرائے اور ان میں سے امامت کا زیادہ حقدار وہ ہے جو ان میں سے زیادہ ( قرآن ) پڑھا ہو ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": "672.02",
			"text": "شعبہ ، سعید بن ابی عروبہ اور معاذ ( بن ہشام ) نے اپنے والد کے واسطے سے ، سب نے قتادہ سے اپنے اپنے شاگردوں کی اسی سند کے ساتھ اس کے مانند روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": "672.03",
			"text": "(قتادہ کے بجائے ) جریدی نے ابو نضرہ سے ، انھوں نے حضرت ابوسعید رضی اللہ عنہ سے اور انھوں نے نبی ﷺ سے اسی طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": "673.01",
			"text": "ابوبکر بن ابی شیبہ اور ابوسعید اشج نے ابو خالد احمر سے ، انھوں نے اوس بن ضمعج سے اور انھوں نے حضرت ابو مسعود انصاری رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ ﷺ نے فرمایا : ‘ ‘ لوگوں کی امامت وہ کرائے جو ان میں سے کتاب اللہ کو زیادہ پڑھنے والا ہو ، اگر پڑھنے میں برابر ہو ں تو وہ جو ان میں سے سنت کا زیادہ عالم ہو ، اگر وہ سنت ( کے علم ) میں بھی برابر ہوں تو وہ جس نے ان سب کی نسبت پہلے ہجرت کی ہو ، اگر وہ ہجرت میں برابر ہوں تو وہ جو اسلام قبول کرنے میں سبقت رکھتا ہو ۔ کوئی انسان وہاں دوسرے انسان کی امامت نہ کرے جہاں اس ( دوسرے ) کا اختیار ہو اور اس کے گھر میں اس کی قابل احترام نشست پر اس کی اجازت کے بغیر کوئی نہ بیٹھے ۔ ’’ ( ابوسعید ) اشج نے اپنی روایت میں ’’اسلام قبول کرنے میں’’ ( سبقت ) کے بجائے ’’عمر میں’’ ( سبقت ) رکھتا ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": "673.02",
			"text": "ابو معاویہ ، جریر ، ابن فضیل اور سفیان سب نے اعمش سے اسی سند کے ساتھ اسی مانند روایت بیان کی ہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": "673.03",
			"text": "شعبہ نے اسماعیل بن رجاء سے روایت کی ، کہا : میں نے اوس بن ضمعج سے سنا ، کہتے تھے : میں نے حضرت ابو مسعود رضی اللہ عنہ سے سنا ، وہ کہتے تھے : رسول اللہ ﷺ نے ہم سے کہا : ‘ ‘ قوم کی امامت وہ کرے جو اللہ کی کتاب کو زیادہ پڑھنے والا اور پڑھنے میں دوسروں سے زیادہ قدیم ہو ، اگر ان سب کا پڑھنا ایک سا ہو تو وہ امامت کرے جو ہجرت میں قدیم تر ہو ، اگر ہجرت میں سب برابر ہوں تو وہ امامت کرے جو ان سب سے عمر میں بڑا ہو اور تم کسی شخص کے گھر اور اس کے دائرہ اختیار میں اس کے امام نہ ہی اس کے گھر میں اس کی قابل احترام نشست پر بیٹھو ، ہاں اس صورت میں کہ وہ تمھیں ( اس بات کی ) اجازت دے-یا ( فرمایا : ) اس کی اجازت سے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": "674.01",
			"text": "اسماعیل بن ابراہیم ( ابن علیہ ) نے ہمیں حدیث بیان کی ، کہا : ہم سے ایوب نے ابو قلابہ سے حدیث بیان کی ، انھوں نے مالک بن حویرث رضی اللہ عنہ سے روایت کی ، کہا : ہم رسول اللہ ﷺ کی خدمت میں حاضر ہوئے اور ہم سب نوجوان اور ہم عمر تھے ، ہم نے آپ کے پاس بیس راتیں قیام کیا ۔ اللہ کے رسول ﷺ بہت مہربان اور نرم دل تھے ، آپ نے خیال فرمایا کہ ہمیں گھر والوں کے پاس جانے کا اشتیاق ہو گا ، آپ نے ہم سے ہمارے ان گھر والوں کے بارے میں سوال کیا جنھیں ہم چھوڑ آئے تھے ، ہم نے آپ کو بتایا تو آپ نے فرمایا : ‘ ‘ اپنے گھر والوں کے پاس لوٹ جاؤ ، انھی کے درمیان رہو ، انھیں تعلیم دو اور انھیں ( اچھائی پر چلنے کا ) حکم دو ، چنانچہ جب نماز کا وقت آئے تو ایک آدمی تم سب کے لئے اذان کہے ، پھر تم میں سے ( جو عمر میں ) سب سے بڑا ہو وہ تمھاری امامت کرے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": "674.02",
			"text": "حماد نے ایوب سے اسی سند کے ساتھ یہ حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 1537,
			"arabicnumber": "674.03",
			"text": "اور یہی حدیث ہمیں ابن ابی عمر نے سنائی ، کہا : عبدالوہاب نے بھی ایوب سے ہمیں حدیث بیان کی ، کہا : مجھ سے ابو قلابہ نے بیان کیا ، کہا : ہمیں ابو سلیمان مالک بن حویرث رضی اللہ عنہ نے حدیث سنائی ، کہا : میں کچھ لوگوں ( کی معیت ) میں رسول اللہ ﷺ کے پاس حاضر ہوا ، ہم تقریبا ہم عمر نوجوان تھے......آگے دونوں ( حماد اور عبدالوہاب ) نے ابن علیہ کی حدیث کی طرح حدیث بیان کی ۔ عبدالوہاب ثقفی نے خالد حذاء سے ، انھوں نے ابو قلابہ سے اور انھوں نے حضرت مالک بن حویرث رضی اللہ عنہ سے روایت کی ، کہا : میں اور میرا ساتھی نبی ﷺ کی خدمت میں حاضر ہوئے ، جب ہم نے آپ کے ہاں سے واپسی کا ارادہ کیا تو آپ نے ہم سے فرمایا : ‘ ‘ جب نماز ( کا وقت ) آئے تو اذان کہو ، پھر اقامت کہو اور تم دونوں میں جو بڑا ہو وہ تمھاری امامت کر لے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 1538,
			"arabicnumber": "674.04",
			"text": "عبدالوہاب ثقفی نے خالد حذاء سے ، انھوں نے ابو قلابہ سے اور انھوں نے حضرت مالک بن حویرث رضی اللہ عنہ سے روایت کی ، کہا : میں اور میرا ساتھی نبی ﷺ کی خدمت میں حاضر ہوئے ، جب ہم نے آپ کے ہاں سے واپسی کا ارادہ کیا تو آپ نے ہم سے فرمایا : ‘ ‘ جب نماز ( کا وقت ) آئے تو اذان کہو ، پھر اقامت کہو اور تم دونوں میں جو بڑا ہو وہ تمھاری امامت کر لے ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 1539,
			"arabicnumber": "674.05",
			"text": "حفص بن غیاث نے خالد حذاء سے اسی سند کے ساتھ روایت کی اور ( اپنی روایت میں ) یہ اضافہ کیا کہ حذاء نے کہا : دونوں قراءت میں ایک جیسے تھے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 372
			}
		},
		{
			"hadithnumber": 1540,
			"arabicnumber": "675.01",
			"text": "یونس بن یزید نے ابن شہاب سے روایت کرتے ہوئے خبر دی ، کہا : مجھے سعید بن مسیب اور ابو سلمہ بن عبدالرحمان بن عوف نے بتایا کہ ان دونوں نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ رسول اللہ ﷺ جب نماز فجر کی قراءت سے فارغ ہوتے اور ( رکوع میں جانے کے لیے ) تکبیر کہتے تو سر اٹھانے کے بعد سمع اللہ لمن حمدہ ربنا ولک الحمد ( اللہ نے سن لیا جس نے اس کی حمد کی ، اے ہمارے رب! اور ٰحمدتیرے ہی لیے ہے ) کہتے ، پھر حالت قیام ہی میں آپ فرماتے : ‘ ‘ اے اللہ!ولید بن ولید ، سلمہ بن ہشام ، عیاش بن ابی ربیعہ اور مومنوں میں سے ان لوگوں کو جنھیں ( کافروں نے ) کمزور پایا ، نجات عطا فرما ۔ اے اللہ!قبیلہ مضر پر اپنے روندنے کو سخت کر ، ان پر اپنے اس مؤاخذے کو یوسف علیہ السلام کے زمانے کے قحط کی طرح کر د ۔ اے اللہ! الحیان ، رعل ، ذکوان اور عصیہ پر ، جنھوں نے اللہ اور اس کے رسول کی نافرمانی کی ، لعنت نازل کر ۔ ’’پھر ہم تک یہ بات پہنچی کہ اس کے بعد جب آپ پر یہ آیت اتری : ‘ ‘ آپ کا اس معاملے سے کوئی سروکار نہیں ، ( اللہ تعالیٰ ) چاہے ان کو توبہ کا موقع عطا کرے ، چاہے ان کو عذاب دے کہ و ہ یقینا ظلم کرنے والے ہیں’’ تو آپ نے یہ دعا چھوڑ دی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 1541,
			"arabicnumber": "675.02",
			"text": "ابن عینیہ نے زہری سے ، انھوں نے سعید بن مسیب سے ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے اور انھوں نے نبی ﷺ سے ان الفاظ تک روایت کی : ‘ ‘ اس سختی کو ان پر یوسف علیہ السلام کے زمانے کے قحط کی طرح کر دے’’ جو اس کے بعد ہے اسے بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 1542,
			"arabicnumber": "675.03",
			"text": "ہمیں اوزاعی نے یحییٰ بن ابی کثیر سے حدیث سنائی ، انھوں نے ابو سلمہ سے روایت کی کہ حضرت ابوہریرہ رضی اللہ عنہ نے انھیں حدیث بیان کی کہ نبی ﷺ نے ایک مہینے تک رکوع کے بعد قنوت ( عاجزی سے دعا ) کی ، جب آپ سمع اللہ لمن حمدہ کہہ لیتے ( تو ) اپنی قنوت میں یہ ( الفاظ ) کہتے : اے اللہ! ولید بن ولیدکو نجات دے ، اے اللہ عیاش بن ابی ربیعہ کو نجات دے ، اے اللہ کمزور سمجھے جانے والے ( دوسرے ) مومنوں کو نجات عطا کر ، اے اللہ ! ان پر اپنے روندنے کو سخت تر کر اور اسے ان پر ، یوسف علیہ السلام کے ( زمانے کے ) قحط کے مانند کر دے ۔ ’’ مسجدوں اور نماز کی جگہوں کے احکام ابوہریرہ رضی اللہ عنہ نے کہا : پھر میں نے رسول اللہ ﷺ کو دیکھا کہ آپ نے یہ دعا چھوڑ دی ، میں نے ( ساتھیوں سے ) کہا : میں دیکھتا ہوں کہ رسول اللہ ﷺ نے یہ دعا چھوڑ دی ہے ۔ کہا : ( جواب میں ) مجھ سے کہا گیا ، تم انھیں دیکھتے نہیں ، ( جن کے لیے دعا ہوئی تھی ) وہ سب آچکے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 1543,
			"arabicnumber": "675.04",
			"text": "کہ حضرت ابوہریرہ رضی اللہ عنہ نے انھیں خبر دی کہ ( ایک روز ) رسول اللہ ﷺ عشاء کی نماز پڑھ رہے تھے ، جب آپ نے فرمایا : سمع اللہ لمن حمدہ تو سجدے میں جانے سے پہلے آپ نے ( دعا مانگتے ہوئے ) فرمایا : ‘ ‘ اے اللہ عیاش بن ابی ربیعہ کو نجات عطا فرما ۔ ’’ کے الفاظ تک اوزاعی کی روایت کردہ حدیث کی طرح حدیث بیان کی ، بعد کے الفاظ بیان نہیں کیےاوزاعی کے بجائے ) شیبان نے یحییٰ سے ، انھوں نے ابوسلمہ سے روایت کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 1544,
			"arabicnumber": "676",
			"text": "ابو سلمہ بن عبدالرحمان نے حضرت ابوہریرہ رضی اللہ عنہ کو یہ کہتے ہوئے سنا : اللہ کی قسم! ضرور رسول اللہ ﷺ کی نماز کو تم لوگوں کے بہت قریب کروں گا ، اس کے بعد حضرت ابوہریرہ رضی اللہ عنہ ظہر ، عشاء اور صبح کی نماز میں قنوت کرتے اور مسلمانوں کے حق میں ‌رضی ‌اللہ ‌عنہ ‌ ‌ دعا کرتے اور کافروں پر لعنت بھیجتے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 1545,
			"arabicnumber": "677.01",
			"text": "اسحاق بن عبداللہ بن ابی طلحہ نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی ، کہا : رسول اللہ ﷺ نے ان لوگوں کے خلاف کنھوں نے بئر معونہ والوں کو قتل کیا تھا ، تیس ( دن تک ) صبح ( کی نمازوں ) میں بدعا کی ۔ آپ نے رعل ، ذکوان ، لحیان اور عصیہ کے خلاف ، جنھوں نے اللہ اور اس کے رسول کی نافرمانی کی ، بد دعا کی ۔ انس رضی اللہ عنہ نے کہا : اللہ نے ان لوگوں کے متعلق جو بئر معونہ پر قتل ہوئے ، قرآن ( کا کچھ حصہ ) نازل فرمایا جو بعد میں منسوخ ہو نے تک ہم پڑھتے رہے ( اس میں شہداء کا پیغام تھا ) کہ ہماری قوم کو بتا دیں کہ ہم اپنے رب سے جا ملے ہیں ، وہ ہم سے راضی ہو گیا ہے اور ہم اس سے راضی ہیں ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 378
			}
		},
		{
			"hadithnumber": 1546,
			"arabicnumber": "677.02",
			"text": "محمد ( بن سیرین ) سے روایت ہے ، کہا : میں نے حضرت انس بن مالک رضی اللہ عنہ سے پوچھا : کیا رسول اللہ ﷺ نے ( کبھی ) صبح کی نماز میں قنو ت کی تھی؟ کہا : ہاں ، رکوع سے تھوڑی دیر بعد ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 379
			}
		},
		{
			"hadithnumber": 1547,
			"arabicnumber": "677.03",
			"text": "ابو مجلز نے حضرت انس رضی اللہ عنہ سے روایت کو کہ رسول اللہ ﷺ نے ایک مہینے تک صبح کی نماز میں رکوع کے بعد قنوت کی ، آپ رعل اور ذکوان کے خلاف بددعا فرماتے تھے اور کہتے تھے : ‘ ‘ عصیہ نے اللہ اور اس کے رسول کی نافرمانی کی ۔ ’’",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 380
			}
		},
		{
			"hadithnumber": 1548,
			"arabicnumber": "677.04",
			"text": "انس بن سیرین نے حضرت انس بن مالک رضی اللہ عنہ سے روایت کی کہ رسول اللہ ﷺ نے ایک مہینے تک نماز فجر میں رکوع کے بعد قنوت کی ، آپ بنو عصیہ کے خلاف بددعا کرتے رہے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 381
			}
		},
		{
			"hadithnumber": 1549,
			"arabicnumber": "677.05",
			"text": "ابو معاویہ نے عاصم سے اور انھوں نے حضرت انس رضی اللہ عنہ سے روایت کی ، کہا : میں نے ان ( انس رضی اللہ عنہ ) سے قنو ت کے بارے میں پوچھا : رکوع سے پہلے ہے یا رکوع کے بعد؟ تو انھوں نے کہا : رکوع سے پہلے ۔ کہا : میں نے عرض کی : بہت سے لوگ سمجھتے ہیں کہ رسول اللہ ﷺ نے رکوع کے بعد قنوت کی ۔ تو انھوں نے کہا : رسول اللہ ﷺ نے ایک مہینے کی ، ان لوگوں کو خلاف بددعا فرماتے رہے جنھوں نے آپ کے صحابہ میں سے کچھ لوگوں کو قتل کیا تھا جنھیں قراء ( قرآن پڑھنے والے ) کہا جاتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 382
			}
		},
		{
			"hadithnumber": 1550,
			"arabicnumber": "677.06",
			"text": "سفیان نے عاصم سے روایت کی ، کہا : میں نے انس رضی اللہ عنہ کو کہتے سنا ، میں نے رسول اللہ ﷺ کو نہیں دیکھا کہ آپ کو کسی اور جنگ پر اتنا غم محسوس ہوا ہو جتنا ان ستر ( ساتھیوں ) پر ہوا جو بئر معونہ کے واقعے کے روز شہید کیے گئے ، انھیں قراء کہا جاتا تھا ، آپ ایک مہینے تک ان کے قالوں کے خلاف بد دعا کرتے رہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 383
			}
		},
		{
			"hadithnumber": 1551,
			"arabicnumber": "677.07",
			"text": "حفص ، ابن فضیل اور مروان سب نے عاصم سے ، انھوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی اکرم ﷺ سے یہی حدیث روایت کی ، ان میں سے بعض نے بعض سے کچھ زیادہ روایت کیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 384
			}
		},
		{
			"hadithnumber": 1552,
			"arabicnumber": "677.08",
			"text": "شعبہ نے قتادہ سے اور انھوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ نبی ﷺ نے ایک مہینے تک قنوت کی ، آپ رعل ، ذکوان اور عصیہ پر لعنت بھیجتے تھے جنھوں نے اللہ اور اس کے رسول ﷺ کی معصیت کی تھی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 385
			}
		},
		{
			"hadithnumber": 1553,
			"arabicnumber": "677.09",
			"text": "موسیٰ بن انس نے ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺ سے اس طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 386
			}
		},
		{
			"hadithnumber": 1554,
			"arabicnumber": "677.10",
			"text": "ہشام نے قتادہ کے حوالے سے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ نے ایک مہینے تک عرب کے قبائل میں سے کچھ قبیلوں کے خلاف بددعا کرتے ہوئے قنوت کی ، پھر چھوڑ دی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 387
			}
		},
		{
			"hadithnumber": 1555,
			"arabicnumber": "678.01",
			"text": "شعبہ نے عمروہ بن مرہ سے روایت کی ، کہا : میں نے ابن ابی لیلی ٰ سے سنا ، کہا : ہمیں حضرت براء بن عازب رضی اللہ عنہا نے حدیث سنائی کہ رسول اللہ ﷺ فجر اور مغرب ( کی نمازوں ) مین قنوت کیا کرتے تھے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 388
			}
		},
		{
			"hadithnumber": 1556,
			"arabicnumber": "678.02",
			"text": "سفیان نے عمرو بن مرہ سے ، انھوں نے عبدالرحمن بن ابی لیلیٰ سے اور انھوں نےحضرت براء ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نےفجر اور مغرب ( کی نمازوں ) میں قنوت کی",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 389
			}
		},
		{
			"hadithnumber": 1557,
			"arabicnumber": "679.01",
			"text": "عمران بن ابی انس نے حنظلہ بن علی سے اور انھوں نے خفاف بن ایما ء غفاری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا : رسول اللہ ﷺ نے نماز میں ( دعا کرتے ہوئے ) کہا : ’’ اے اللہ ! بنو لحیان : رعل ، ذکوان اور عصیہ پر لعنت بھیج جنھوں نے اللہ اور اس کے رسول ﷺ کی نافرمانی کی ۔ غفار کی اللہ مغفرت کر ے اور اسلم کو اللہ سلامتی عطا فرمائے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 390
			}
		},
		{
			"hadithnumber": 1558,
			"arabicnumber": "679.02",
			"text": "حارث بن خفاف سے روایت ہے ، انھوں نے کہا : حضرت خفاف بن ایما ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : رسول اللہ ﷺ نے رکوع کیا ، پھر سر اٹھا کر فرمایا : غفار کی اللہ مغفرت کرے ، اسلم کو اللہ سلامتی عطا کرے ۔ اور عصیہ نے اللہ اور اس کے رسول کی نافرمانی کی ۔ اے اللہ ! بنو لحیان پر لعنت بھیج اور رعل اور ذکوان پر لعنت بھیج ۔ ‘ ‘ پھر آپ سجدے میں چلے گئے ۔ خفاف ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : کافروں پر اسی کے سبب سے لعنت کی گئی ۔ ( لعنت کا طریقہ اختیار کیا گیا ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 391
			}
		},
		{
			"hadithnumber": 1559,
			"arabicnumber": "679.03",
			"text": "(عمران کے بجائے ) عبدالرحمان بن حرملہ نے حنظلہ بن علی بن اسقع سے اور انھوں نے حضرت خفاف بن ایماء ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اسی کے مانند روایت کی ، سوائے اس کے کہ انھوں نے ’’کافروں پر اسی کے سبب لعنت کی گئی ‘ ‘ کے الفاظ نہیں کہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 392
			}
		},
		{
			"hadithnumber": 1560,
			"arabicnumber": "680.01",
			"text": "یونس نے ابن شہاب کے حوالے سے خبردی ، انھوں نے سعید بن مسیب سے اور انھوں نے حضرت ابوہریرہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی کہ رسول اللہ ﷺ جب جنگ خیبر سے واپس ہوئے تو رات بھر چلتے رہے یہاں تک کہ جب آپ کو نیند نے آلیا ، آپ نے ( سواری سے ) اتر کر پڑاؤ کیا اور بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے کہا : ’’ہمارے لیے رات کا پہرہ دو ( نظر رکھو کہ کب صبح ہوتی ہے ؟ ) ‘ ‘ بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے مقدور بھر نماز پڑھی ، رسول اللہ ﷺ اور آپ کے صحابہ سو گئے ۔ جب فجر قریب ہوئی تو بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ( مطلع ) فجر کی طرف رخ کرتے ہوئے اپنی سواری کے ساتھ ٹیک لگائی ، جب وہ ٹیک لگائے ہوئے تھے تو ان پر نیند غالب آگئی ، چنانچہ رسول اللہ ﷺ بیدار ہوئے نہ بلال اور نہی ہی ان کے صحابہ میں سے کوئی بیدار ہوا یہاں تک کہ ان پر دھوپ پڑنے لگی ، سب سے پہلے رسول اللہ ﷺ بیدار ہوئے اور گھبرا گئے ۔ فرمانے لگے : ’’اے بلال! ‘ ‘ تو بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : میری جان کو بھی اسی نے قبضے میں لیا تھا جس نے ۔ میرے ماں باپ آپ پر قربان اے اللہ کے رسول ! ---آپ کی جان کو قبضے میں لے لیا تھا ۔ آپ ﷺ نے فرمایا : ’’سواریاں آگے بڑھاؤ ۔ ‘ ‘ وہ اپنی سواریوں کو لے کر کچھ آگے بڑھے ، پھر رسول اللہ ﷺ نے وضو کیا اور بلال ‌رضی ‌اللہ ‌عنہ ‌ ‌ کو حکم دیا ، انھوں نے نماز کی اقامت کہی ، پھر آپ نے ان کو صبح کی نماز پڑھائی ، جب نماز ختم کی تو فرمایا : ’’ جو شخص نماز ( پڑھنا ) بھول جائے تو جب اسے یاد آئے اسے پڑھے ، اللہ تعالیٰ نے فرمایا : ’’ میری یاد کے وقت نماز قائم کرو ۔ ‘ ‘ یونس نے کہا : ابن شہاب سے ’’للذکرٰی ‘ ‘ ( یاد کرنے کےلیے ) پڑھتے تھے",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 393
			}
		},
		{
			"hadithnumber": 1561,
			"arabicnumber": "680.02",
			"text": "ابوہریرہ رضی اﷲ عنہ نے کہا کہ ایک شب ہم آخر رات میں نبی ﷺ کے ساتھ اترے اور نہ جاگے یہاں تک کہ سورج نکل آیا تب نبی ﷺ نے فرمایا کہ ہر شخص اونٹ کی نکیل پکڑے کہ یہ مکان ہے شیطان کا ۔ پھر ہم نے ایسا ہی کیا ( یعنی اس میدان سے باہر ہوگئے ) ۔ پھر پانی منگایا اور وضو کیا اور دو رکعت نماز پڑھی ۔ اور یعقوب نے سجدہ کی بجائے صلی کہا پھر نماز کی تکبیر ہوئی اور صبح کی فرض نماز ادا کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 394
			}
		},
		{
			"hadithnumber": 1562,
			"arabicnumber": "681",
			"text": "ثابت نے عبداللہ بن رباح سے اور انھوں نے حضرت ابو قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےر وایت کی ، کہا : رسول اللہ ﷺ نے ہمیں خطاب فرمایا اور کہا : ’’تم اپنی ( پوری ) شام اور ( پوری ) رات چلتے رہو گے تو ان شاء اللہ کل تک پانی پر پہنچ جاؤ گے ۔ ‘ ‘ لوگ چل پڑے ، کوئی مڑ کر دوسرے کی طرف دیکھتا بھی نہ تھا ۔ ابو قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اسی عالم میں رسول اللہ ﷺچلتے رہے یہاں تک کہ رات آدھی گزر گئی ، میں آپ کے پہلو میں چل رہا تھا ، کہا : تو رسول اللہ ﷺ کو اونگھ آگئی اور آپ سواری سے ایک طرف جھک گئے ، میں آپ کے پاس آیا اور آپ کو جگائے بغیر آپ کو سہارا دیا حتی کہ آپ اپنی سواری پر سیدھے ہو گئے ، پھر آپ چلتے رہے یہا ں تک کہ رات کا بیشتر حصہ گزر گیا ، آپ ( پھر ) سواری پر ( ایک طرف ) جھکے ، کہا : میں نے آپ کو جگائے بغیر آپ کو سہارا دیا یہاں تک کہ آپ اپنی سواری پر سیدھے ہو گئے ، کہا : پھر چلتے رہے حتی کہ سحری کا آخری وقت تھا تو آپ ( پھر ) جھکے ، یہ جھکنا پہلے دونزں بار کے جھکنے سے زیادہ تھا ، قریب تھا کہ آپ اونٹ سے گر پڑتے ، میں آپ کے پاس آیا اور آپ کو سہارا دیاتو آپ نے اپنا سر مبارک اٹھایا اور فرمایا : ’’یہ کون ہے ؟ ‘ ‘ میں نے عرض کی : ابو قتادہ ہوں ۔ فرمایا : ’’تم کب سے میرے ساتھ اس طرح چل رہے ہو؟ ‘ ‘ میں نے عرض کی : میں رات ہی سے اس طرح سفر کر رہا ہوں ۔ فرمایا : ’’ اللہ اسی طرح تمھاری حفاظت کرے جس طر ح تم نے اس کے نبی کی حفاظت کی ۔ ‘ ‘ پھر فرمایا : ’’ کیا تم دیکھ رہے ہو ( کہ ) ہم لوگوں سے اوجھل ہیں ؟ ‘ ‘ پھر پوچھا : ’’تمھیں کوئی ( اور ) نظر آر ہا ہے ؟ ‘ ‘ میں نے عرض کی : یہ ایک سوار ہے ۔ پھر عرض کی : یہ ایک اور سوار ہے حتی کہ ہم اکٹھے ہوئے تو سات سوار تھے ، کہا : رسول اللہ ﷺ راستے سے ایک طرف ہٹے ، پھر سر ( نیچے ) رکھ دیا ( اور لیٹ گئے ) پھر فرمایا : ’’ ہمارے لیے ہماری نماز کا خیال رکھنا ۔ ‘ ‘ پھر جو سب سے پہلے جاگے وہ رسول اللہ ﷺ ہی تھے ، سورج آپ کی پشت پر ( چمک رہا ) تھا ، کہا : ہم سخت تشویش کے عالم میں کھڑے ہوئے ، پھر آپ نے فرمایا : ’’سوار ہوجاؤ ۔ ‘ ‘ ہم سوار ہوئے اور ( آگے ) چل پڑے حتی کہ جب سورج بلند ہو گیا تو آپ اترے ، پھر آپ نے وضو کا برتن مانگا جو میرے ساتھ تھا ، اسی میں کچھ پانی تھا ، کہا : پھر آپ نے اس سے ( مکمل ) وضو کے مقابلے میں کچھ ہلکا وضو کیا ، اور ا س میں کچھ پانی بچ بھی گیا ، پھر آپ نے ( مجھے ) ابو قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے فرمایا : ’’ ہمارے لیے اپنے وضو کا برتن محفوظ رکھنا ، اس کی ایک خبر ہو گی ۔ ‘ ‘ پھر بلال ر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے نماز کے لیے اذان کہی ، رسول اللہ ﷺ نے دو رکعتیں پڑھیں ، پھر آپ نے اسی طرح جس طرح روز کرتے تھے صبح کی نماز پڑھائی ، کہا : اور رسول اللہ ﷺ سوار ہو گئے ہم بھی آپ کی معیت میں سوار ہو گئے ، کہا : ہم میں سے کچھ لوگ ایک دوسرے سے کھسر پھر کرنے لگے کہ ہم نے نماز میں جو کوتاہی کی ہے اس کا کفارہ کیا ہے ؟ اس پر آپ نے فرمایا : ’’ کیا تمھارے لیے میر ے عمل میں نمونہ نہیں ؟ ‘ ‘ پھر آپ نے فرمایا : ’’ سمجھ لو ! نیند ( آجانے ) میں ( کسی کی ) کوئی کوتاہی نہیں ۔ ‘ ‘ کوتاہی اس کی ہے جس نے ( جاگنے کے بعد ) دوسری نماز کا وقت آجانے تک نماز نہیں پڑھی ، جو اس طرح ( نیند ) کرے تو جب اس کے لیے جاگے تو یہ نماز پڑھ لے ، پھر جب دوسرا دن آئے تو اسے وقت پر ادا کرے ۔ ‘ ‘ پھر فرمایا : ’’تم کیا دیکھتے ہو ( دوسرے ) لوگوں نےکیا کیا ؟ ‘ ‘ کہا : پھر آپ نے فرمایا : ’’لوگوں نے صبح کی تو اپنے نبی کو گم پایا ۔ ابو بکر اور عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اللہ کے رسول ﷺ تمھارے پیچھے ہیں ، وہ ایسے نہیں کہ تمھیں پیچھے چھوڑ دیں ۔ ( دوسرے ) لوگوں نے کہا : بے شک رسول اللہ ﷺ تم سے آگے ہیں ۔ اگر وہ ابو بکر اور عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی ا ‌رضی ‌اللہ ‌عنہ ‌ ‌ اعت کریں تو صحیح راستے پر چلیں گے ۔ ‘ ‘ کیا : تو ہم لوگوں تک ( اس وقت ) پہنچ پائے جب دن چڑھ آیا تھا اور ہر شے تپ گئی تھی اور وہ کہہ رہے تھے : اے اللہ کے رسول ! ہم پیا سے مر گئے ۔ تو آپ نے فرمایا : ’’ تم پر کوئی ہلاکت نہیں آئی ۔ ‘ ‘ پھر فرمایا : ’’میرا چھوٹا پیالہ میرے پاس آنے دو ۔ ‘ ‘ کہا : پھر وضو کے پانی والا برتن منگوایا ، رسول اللہ ﷺ ( اس سے پیالے میں ) انڈیلتے گئے اور ابو قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ لوگوں کو پلاتے گئے ، زیاد دیر نہ گزری تھ کہ لوگوں نے وضو کے برتن کیں جو ( تھوڑا سا پانی ) تھا ، دیکھ لیا ، اس بر جھرمٹ بناکر اکٹھے ہو گے تو رسول اللہ ﷺ نے فرمایا : ’’ اچھا طریقہ اختیار کرو ، تم میں سے ہر ایک اچھی طرح پیاس بجھا لے گا ۔ ‘ ‘ کہا : لوگوں نے ایسا ہی کیا ، رسول اللہ ﷺ پانی ( پیالے میں ) انڈیلتے گئے اور میں لوگوں کو پلاتا گیا یہاں تک کہ میرے اور رسول اللہ ﷺ کے سوا اور کوئی نہ بچا ، کہا : رسول اللہ ﷺ نے پھر پانی ڈالا اور مجھ سے فرمایا : ’’ پیو ۔ ‘ ‘ میں نے عرض کی : اے اللہ کے رسول ! جب تک آپ نہیں پی لیں گے میں نہیں پیوں گا ۔ فرمایا : ’’ قوم کو پانی پلانے والا ان سب سے آخر میں پیتا ہے ۔ ‘ ‘ کہا : تب میں نے پی لیا اور رسول اللہ ﷺ نے بھی نوش فرمایا ، کہا : اس کے بعد لوگ اس حالت میں ( اگلے ) پانی پر پہنچے کہ سب ( نے اپنے ) برتن پانی سے بھرے ہوئے تھے اور ( خوب ) سیراب تھے ۔ ( ثابت نے ) کہا ، عبداللہ بن رباح نے کہا : میں یہ حدیث جامع مسجد میں سب لوگوں کو سناؤں گا ۔ تب عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : اے جوان ! خیال رکھنا کہ تم کس طرح حدیث بیان کرتے ہو ، اس رات میں بھی قافلے کے سواروں میں سے ایک تھا ۔ کہا : میں نے عرض کی : آپ اس حدیث کو زیادہ جاننے والے ہیں ۔ تو انھوں نے پوچھا : تم کس قبیلے سے ہو ؟ میں میں نے کہا انصار سے ۔ فرمایا : حدیث بیان کرو تم اپنی احادیث سے زیادہ آگاہ ہو ( انصار میں سے ابو قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے اس سارے واقعے کا سب سے زیادہ اور باریکی سے مشاہدہ کیا تھا بلکہ و ہ اس سارے واقعے میں رسول اللہ ﷺ کے ساتھ ساتھ تھے ، آگے ان سے سننے والے عبداللہ بن رباح بھی انصار میں سے تھے ۔ ) کہا : میں نے لوگوں کو حدیث سنائی تو عمران ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : اس رات میں میں بھی موجود تھا اور مین نہیں سمجھتاکہ اسے کسی نے اس طرح یا در کھا جس طرح تم نے اسے یا درکھا ہے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 395
			}
		},
		{
			"hadithnumber": 1563,
			"arabicnumber": "682.01",
			"text": "سلم بن زریر عطاری نے کہا : میں نے ابو رجاء عطاری سے سنا ‘ وہ حضرت عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کر رہے تھے ‘ کہا : میں نبی ﷺ کے ایک میں آپﷺ کے ہمراہ تھا ‘ ہم اس رات چلتے رہے حتی کہ جب صبح قریب آئی تو ہم ( تھکاوٹ کے سبب ) اتر پڑے ‘ ہم پر ( نینج میں ڈوبی ) آنکھیں غالب آگئیں یہاں تک کہ سورج چمکنے لگا ۔ ہم میں جو سب سے پہلے بیدار ہوئے وہ حضرت ابو بکر ‌رضی ‌اللہ ‌عنہ ‌ ‌ تھے ۔ جب نبیﷺ سو جاتے تو ہم آپ ﷺ کو جگایا نہیں کرتے تھے حتی کہ آپ ﷺ خود بیدار ہو جاتے ‘ پھر عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ جاگے ‘ وہ اللہ کے نبی ﷺ کے قریب کھڑے ہو گے اور اللہ اکبر پکارنے لگے اور ( اس ) تکبیر میں آواز اونچی کرنے لگے یہاں تک کہ رسول اللہ ﷺ بھی جاگ گئے ‘ جب آپﷺنے سر اٹھایا اور دیکھا کہ سورج چمک رہا ہےتو فرمایا : ’ ( آگے ) چلو ۔ آپ ﷺ ہمیں لے کر چلے یہاں تک کہ سورج ( روشن ) ہو کر سفید ہو گیا ‘ آپ اتر ے ‘ ہمیں صبح کی نماز پڑھائی ۔ لوگوں میں سے ایک آدمی الگ ہو گیا اور اس نے ہمارے ساتھ نماز نہ پڑھی ‘ جب سلام پھیرا تو رسول اللہ ﷺ نے اس سے کہا : ’’فلاں!تم نے ہمارے ساتھ نماز کیوں نہیں پڑھی ؟ ‘ ‘ اس نے کہا : اے اللہ کے نبی !مجھےےجنابت لاحق ہوگی ہے ۔ آپﷺنے اسے حکم دیا ۔ اس نے مٹی سے تیمم کیا اور نماز پڑھی ‘ پھرآپﷺنے مجھےےچند سواروں سمیت پانی کی تلاش میں جلدی اپنے آگے روانہ کیا ‘ ہم سخت پیاسے تھے ‘ جب ہم چل رہے تھے تو ہمیں ایک عورت ملی جس نے اپنے پاؤں دو مشکوں کے درمیان لٹکارکھےے تھے ( بقڑی مشکوں سمیت پاؤں لٹکائے ‘ اونٹ پر سوار تھی ) ‘ ہم نے اس سے پوچھا : پانی کہا ں ہے ؟کہنے لگی : افسوس !تمہارے لیے پانی نہیں ہے ۔ ہم نے پوچھا : تمہارے گھر اور پانی کے دریمان کتنا فاصلہ ہے ؟اس نے کہا : ایک دن اور رات کی مسافت ہے ۔ ہم نے کہا : اللہ کے رسول ﷺ کے پاس چلو ۔ کہنے لگی : اللہ کا رسول کیا ہوتا ہے ؟ہم نے اسے اس کے معاملے میں ( فیصلےکا ) کچھاختیار نہ دیا حتی کہ اسے لے آئےاس کے ساتھ ہم رسول اللہ ﷺکے سامنے حاضر ہوئے ‘ آپنے اس سے پوچھا تو اس نے آپکو اسی طرح بتایا جس طرح ہمیں بتایا تھا ‘ اور آپ کو یہ بھی بتایا کہ وہ یتیم بچوں والی ہے ‘ اس کے ( زیر کفالت ) بہت سے یتیم بچے ہیں ۔ آپ نے اس کی پانی ڈھونے والی اونٹنی کے بارے میں حکم دیا ‘ اسے بھٹا دیا گیا اور آپ نے کلی کر کے مسکوں کے اوپر کے دونوں سوراخوں میں پانی ڈالا ‘ پھر آپ نے اس کی اونٹنی کوکھرا کیا تو ہم سب نے اور ہم چالیس ( شدید ) پیاسے افراد تھے ( ان مشکوں سے ) پانی پیا یہاں تک کہ ہم سیراب ہو گے اور ےہمارے پاس جتنی مشکیں اور پانی کے برتن تھے سب بھر لیے اور اپنے ساتھی کو غسل بھی کرا یا ‘ التبہ ہم نےکسی اونٹ کو پانی نہ پیلایا اور وہ یعنی دونوں مشکیں پانی ( کی مقدار زیادہ ہو جانے کے سبب ) پھٹنے والی ہو گیئں ‘ پھر آپ نے فرمایا : ’’تمہارےپاس جو کچھ ہے ‘ لے آؤ ۔ ‘ ‘ ہم نے ٹکڑے اور کھجوریں اکٹھی کیں ‘ اس کے لیے ایک تھیلی کا منہ بند کر دیا گیا تو آپ نےاس سے کہا : ’’جاؤ اور یہ خوراک اپنے بچوں کو کھلا ؤ اور جان لو !ہم نے تمہارے پانی میں کمی نہیں ۔ ‘ ‘ جب وہ اپنے گھر والوں کے پاس پہنچی تو کہا : میں انسانوں کے سب سے بڑے ساحر سے مل کر آئی ہوں یا پھر جس طرحکہ وہ خود کو سمجھتا ہے ‘ وہ نبی ہے ‘ اور اس کا معملہ اس اس کرح سے ہے ۔ پھر ( آخر کار ) اللہ نے اس عورت کے سبب سے لوگوں سے کٹی ہوئی اس آبادی کو ہدایت عطا کر دی ‘ وہ مسلمان ہوگی اور ( باقی ) لوگ بھی مسلمان ہو گے ۔ ( یہ پچھلے واقعے سے ملتا جلتا ایک اور واقعہ ہے ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 396
			}
		},
		{
			"hadithnumber": 1564,
			"arabicnumber": "682.02",
			"text": "عوف بن ابی جمیلہ اعرابی نے ابو رجاء عطاری سے ‘ انھوں نے حضرت عمران بن حصین ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ‘ کہا : ہم ایک سفر کے دوران میں رسول اللہ ﷺ کے ہمراہ تھے ‘ ہم ایک رات چلے ‘ جب رات کا آخری حصہ آیا ‘ صبح سے ٹھوڑی دیر پہلے ہم اس طرح پڑکر سو گئے کہ اس سے زیادہ میٹھی نیند ایک مسافر کے لیے اور کوئی نہیں ہو سکتی ‘ ہمیں سورج کی حرارت ہی نے جگایا ....پھر سلم بن زریر کی حدیث کی طرح حدیث سنائی اور کچھ کمی بیشی بھی اور ( اپنی روایت کردہ ) حدیث میں انھوں نے کہا : جب عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ جاگے اور لوگوں کی صورت حال دیکھی ‘ اور وہ بلند آواز آدمی تھے تو انھوں نے اونچی آواز سے اللہ اکبر کہا حتی کہ رسول اللہ ﷺ ان کے اونچے اللہ اکبرکہنے سے جاگ گئے ‘ جب اللہ کے رسول ﷺجاگ گئے تو لوگوں نے اپنے اس معاملے کی شکایت کی تو آپﷺ نے فرمایا : ’’کوئی ( بڑا ) نقصان نہیں ہوا ‘ ( آگئے ) چلو ۔ ‘ ‘ ......آگے وہی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 397
			}
		},
		{
			"hadithnumber": 1565,
			"arabicnumber": "683",
			"text": "حضرت ابو قتادہ ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے ‘ کہا : رسول اللہ ﷺجب سفر میں ہوتے اور رات ( کے آخری حصے ) میں آرام کے لیے لیٹے تو دائیں پہلو پر لیٹتے اور جب صبح سے ذرا پہلو پر لیٹتے تو اپنی کہنی کھڑی کر لیتے اور سر ہتھیلی پر ٹکا لیتے ۔ ( تاکہ زیادہ گہری نیند نہ آئے ۔ اس حدیث کے الفاظ بھی اس بات کی تائید کرتے ہیں کہ اوپر بیان کیے گئے دو الگ الگواقعے ہیں ۔)",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 398
			}
		},
		{
			"hadithnumber": 1566,
			"arabicnumber": "684.01",
			"text": "ہمام نے ہمیں حدیث سنائی ‘ کہا : ہمیں قتادہ نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ کے حوالے سے حدیث سنائی کہ رسول اللہﷺ نے فرمایا : ’’جو شخص کوئی نماز بھول جائے تو جیسے ہی وہ اسے یاد آئے ‘ وہ نماز پڑھ لے ‘ اس نماز کا اس کے علاوہ اور کوئی کفارہ نہیں ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 399
			}
		},
		{
			"hadithnumber": 1567,
			"arabicnumber": "684.02",
			"text": "ابو عوانہ نے قتادہ سے ‘ انھوں نے حضرت انس ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے اور انھوں نے نبی ﷺسے یہ ( یہی حدیث ) روایت کی ‘ البتہ انھوں نے ’’اس کے علاوہ اس کا اور کوئی کفارہ نہیں ‘ ‘ کے الفاظ روایت نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 400
			}
		},
		{
			"hadithnumber": 1568,
			"arabicnumber": "684.03",
			"text": "سعید نے قتادہ سے اور انھوں نے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سےحدیث سنائی ‘ کہا : اللہ کے نبی ﷺ نے فرمایا : ‘ ‘ جو شخص کوئی نماز بھول گیا یا اسے ادا کرتے وقت سوتا رہ گیا تو اس ( نماز ) کا کفارہ یہی ہے کہ جب اسے یاد آئے وہ اس نماز کو پڑھ لے ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 401
			}
		},
		{
			"hadithnumber": 1569,
			"arabicnumber": "684.04",
			"text": "مثنیٰ نے قتادہ کے حوالے سے حضرت انس بن مالک ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ‘ کہا : رسول اللہ ﷺنے فرمایا : ’’جب تم میں سے کوئی نماز ( پڑھنے کے وقت اس ) سے سویا رہے یا اس سے غافل ہو جائے تو جب اسے یاد آئےوہ ( نماز ) پڑھ لے ‘ بے شک اللہ تعالیٰ نے ( خود ) ارشاد فرمایا ہے : اور میر ییاد کے وقت نماز قائم کرو ۔ ‘ ‘",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 402
			}
		}
	]
}