{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"51": "Characteristics of The Hypocrites And Rulings Concerning Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7024,
			"arabicnumber": "2772",
			"text": "ہمیں زہیر بن معاویہ نے حدیث بیان کی ، انہوں نے کہا : ہمیں ابواسحٰق نے حدیث بیان کی ، انہوں نے حضرت زید بن ارقم رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک سفر میں نکلے ، اس میں لوگوں کو بہت تکلیف پہنچی تو عبداللہ بن ابی نے اپنے ساتھیوں سے کہا : جو لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ہیں ، جب تک آپ صلی اللہ علیہ وسلم سے الگ نہ ہو جائیں ، ان پر کچھ خرچ نہ کرو ( مہاجرین سے تعاون بند کر دو ۔ ) زہیر نے کہا : اور یہ اس کی قراءت ہے جس نے حوله کو زیر کے ساتھ من حوله پڑھا ۔ اور اس نے ( یہ بھی ) کہا : اگر ہم مدینہ کو لوٹ گئے تو جو عزت والے ہیں وہ وہاں سے ذلت والوں کو نکال دیں گے ۔ ( زید بن ارقم رضی اللہ عنہ نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوا اور آپ کو یہ بات بتا دی ، آپ نے عبداللہ بن اُبی کو بلوایا اور اس سے ( اس بات کے متعلق ) پوچھا ، اس نے بہت پکی قسم کھائی کہ اس نے ایسا نہیں کہا اور کہا : زید نے رسول اللہ صلی اللہ علیہ وسلم سے جھوٹ بولا ہے ۔ ( حضرت زید رضی اللہ عنہ نے ) کہا : میرے دل کو ان لوگوں کی اس بات سے بہت تکلیف پہنچی ، حتی کہ اللہ تعالیٰ نے میری تصدیق میں یہ آیت نازل کی : \"\" جب آپ کے پاس منافقین آتے ہیں \"\" پھر نبی صلی اللہ علیہ وسلم نے ان کے استغفار کے لیے ان کو بلوایا تو انہوں نے ( تمسخر سے ) اپنے سر ٹیڑھے کر لیے ۔ \"\" اور ( اس آیت میں ) اللہ تعالیٰ کے قول : \"\" گویا وہ سہارے سے کھڑے ہوئے شہتیر ہیں \"\" ( سے مراد ) حضرت زید رضی اللہ عنہ نے کہا : ( یہ ہے کہ ) یہ لوگ ( جسمانی اعتبار سے سیدھے ، لمبے اور دیکھنے میں ) بہت خوبصورت تھے ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7025,
			"arabicnumber": "2773.01",
			"text": "سفیان بن عیینہ نے عمرو ( بن دینار ) سے روایت کی ، انہوں نے حضرت جابر رضی اللہ عنہ کو یہ بیان کرتے ہوئے سنا : نبی صلی اللہ علیہ وسلم عبداللہ بن ابی کی قبر پر تشریف لائے ، اس کو قبر سے نکال کر اپنے گھٹنوں پر رکھا ، اس پر اپنا لعاب مبارک چھڑکا اور اسے اپنی قمیص پہنچائی ، ( ایسا کیوں کیا؟ ) اللہ زیادہ جاننے والا ہے ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7026,
			"arabicnumber": "2773.02",
			"text": "ابن جریج نے کہا : مجھے عمرو بن دینار نے خبر دی ، کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ عنہ کو بیان کرتے ہوئے سنا : نبی صلی اللہ علیہ وسلم عبداللہ بن ابی کے پاس اس کو اس کے گڑھے میں داخل کر دیے جانے کے بعد آئے ، پھر سفیان کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7027,
			"arabicnumber": "2774.01",
			"text": "ابواسامہ نے کہا : ہمیں عبیداللہ بن عمر نے نافع سے حدیث بیان کی ، انہوں نے حضرت عبداللہ بن عمر رضی اللہ عنہ سے روایت کی ، کہا : جب عبداللہ بن ابی ابن سلول مر گیا تو اس کے بیٹے عبداللہ بن عبداللہ رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کے پاس آئے ، اور آپ سے سوال کیا کہ آپ اپنی قمیص اس کو عطا فرمائیں ، جس میں وہ اپنے باپ کو کفن دیں تو آپ نے ( وہ قمیص ) ان کو عطا کی ، پھر آپ صلی اللہ علیہ وسلم سے درخواست کی کہ آپ اس کی نماز جنازہ پڑھیں ، چنانچہ رسول اللہ صلی اللہ علیہ وسلم اس پر نماز جنازہ پڑھنے کے لیے کھڑے ہوئے تو حضرت عمر رضی اللہ عنہ کھڑے ہو گئے اور ( التجا کرنے کے لیے ) رسول اللہ صلی اللہ علیہ وسلم کے کپڑے ( کے ایک کنارے ) کو پکڑ لیا اور کہا : اللہ کے رسول! کیا آپ اس کی نماز جنازہ پڑھائیں گے ، حالانکہ اللہ تعالیٰ نے آپ کو اس کی نماز جنازہ پڑھنے سے منع فرمایا ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے مجھے اختیار دیا ہے ، اس نے فرمایا ہے : \" آپ ان کے لیے استغفار کریں یا استغفار نہ کریں ، خواہ آپ ان کے لیے ستر مرتبہ استغفار کریں \" اور میں ستر مرتبہ سے زیادہ استغفار کروں گا ۔ \" ( عمر رضی اللہ عنہ نے ) کہا : یقینا وہ منافق ہے ، ( مگر ) رسول اللہ صلی اللہ علیہ وسلم نے اس کی نماز جنازہ پڑھا دی ، اس پر اللہ عزوجل نے ( واضح حکم ) نازل فرمایا : \" اور ان ( منافقین ) میں سے جو شخص مر جائے آپ کبھی اس کی نماز جنازہ نہ پڑھیں اور نہ اس کی قبر پر کھڑے ہوں ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7028,
			"arabicnumber": "2774.02",
			"text": "یحییٰ قطان نے عبیداللہ ( بن عمر بن حفص ) سے اسی سند کے ساتھ اسی طرح حدیث بیان کی اور مزید یہ کہا : چنانچہ آپ صلی اللہ علیہ وسلم نے ان پر نماز جنازہ ترک کر دی ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7029,
			"arabicnumber": "2775.01",
			"text": "محمد بن ابی عمر مکی نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے منصور سے حدیث بیان کی ، انہوں نے مجاہد سے ، انہوں نے ابومعمر سے اور انہوں نے حضرت ابن مسعود رضی اللہ عنہ سے روایت کی ، کہا : تین آدمی بیت اللہ کے پاس اکٹھے ہوئے ، ( ان میں سے ) دو قریشی تھے اور ایک ثقفی تھا ، یا دو ثقفی تھے اور ایک قریشی تھا ، ان کے دلوں کا فہم کم تھا ، ان کے پیٹوں کی چربی بہت تھی ۔ ان میں سے ایک نے کہا : کیا تم سمجھتے ہو کہ جو کچھ ہم کہتے ہیں ، اللہ سنتا ہے؟ دوسرے نے کہا : اگر ہم اونچی آواز سے بات کریں تو سنتا ہے اور آہستہ بات کریں تو نہیں سنتا ۔ تیسرے نے کہا : اگر ہم اونچا بولیں تو وہ سنتا ہے تو پھر ہم آہستہ بولیں تو بھی سنتا ہے ۔ اس پر اللہ عزوجل نے ( یہ آیتیں ) نازل فرمائیں : \" تم اس لیے ( اپنی باتیں ) نہیں چھپا رہے تھے کہ تمہارے خلاف تمہارے کان گواہی دیں گے اور نہ تمہاری آنکھیں اور نہ تمہاری کھالیں ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7030,
			"arabicnumber": "2775.02",
			"text": "ابوبکر بن خلاد باہلی نے مجھے حدیث بیان کی ، کہا : ہمیں یحییٰ بن سعید نے حدیث بیان کی ، کہا : ہمیں سفیان نے حدیث بیان کی ، کہا : مجھے سلیمان نے عمارہ بن عمیر سے حدیث بیان کی ، انہوں نے وہب بن ربیعہ سے اور انہوں نے عبداللہ رضی اللہ عنہ سے روایت کی ، نیز ہمیں یحییٰ نے حدیث بیان کی ، کہا : ہمیں سفیان نے حدیث سنائی ، کہا : مجھے منصور نے مجاہد سے حدیث بیان کی ، انہوں نے ابومعمر سے اور انہوں نے عبداللہ رضی اللہ عنہ سے اسی طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7031,
			"arabicnumber": "2776.01",
			"text": "معاذ عنبری نے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انہوں نے کہا : میں نے عبداللہ بن یزید کو حضرت زید بن ثابت رضی اللہ عنہ سے حدیث بیان کرتے ہوئے سنا کہ نبی صلی اللہ علیہ وسلم ( جنگ کے لئے ) اُحد کی جانب روانہ ہوئے ۔ جو لوگ آپ کے ساتھ تھے ان میں سے کچھ واپس آ گئے ۔ رسول اللہ صلی اللہ علیہ وسلم کے صحابہ ان کے بارے میں دو حصوں میں تقسیم ہو گئے ۔ بعض نے کہا : ہم انہیں قتل کر دیں اور بعض نے کہا : نہیں ۔ تو ( یہ آیت ) نازل ہوئی : \" تمہیں کیا ہو گیا ہے کہ منافقین کے بارے میں تم وہ دو گروہ بن گئے ہو ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7032,
			"arabicnumber": "2776.02",
			"text": "یحییٰ بن سعید اور غندر دونوں نے شعبہ سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7033,
			"arabicnumber": "2777",
			"text": "حضرت ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کے عہد میں کچھ منافقین ایسے تھے کہ جب نبی صلی اللہ علیہ وسلم کسی جنگ کے لئے تشریف لے جاتے تو وہ پیچھے رہ جاتے اور رسول اللہ صلی اللہ علیہ وسلم کی مخالفت میں اپنے پیچھے رہ جانے پر خوش ہوتے ، اور جب نبی صلی اللہ علیہ وسلم واپس آتے تو آپ کے سامنے عذر بیان کرتے اور قسمیں کھاتے اور چاہتے کہ لوگ ان کاموں پر ان کی تعریف کریں جو انہوں نے نہیں کیے تھے ، اس پر یہ ( آیت نازل ) ہوئی : \" ان لوگوں کے متعلق گمان نہ کرو جو اپنے کیے پر خوش ہوتے ہیں اور یہ پسند کرتے ہیں کہ اس کام پر ان کی تعریف کی جائے جو انہوں نے نہیں کیا ، ان کے متعلق یہ گمان بھی نہ کرو کہ وہ عذاب سے بچنے والے مقام پر ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7034,
			"arabicnumber": "2778",
			"text": "ابن جریج سے روایت ہے ، انہوں نے کہا : مجھے ابن ابی ملیکہ نے بتایا ، انہیں حمید بن عبدالرحمن بن عوف نے خبر دی کہ مروان نے اپنے دربان سے کہا : \" رافع! حضرت ابن عباس رضی اللہ عنہ کے پاس جاؤ اور کہو کہ اگر یہ بات ہے کہ ہم میں سے ہر شخص جو اپنے کیے پر خوش ہوتا ہے اور ہر ایک جو یہ پسند کرتا ہے کہ جو اس نے نہیں کیا ، اس پر اس کی تعریف کی جائے ، اس کو عذاب ہو گا تو ہم سب ہی ضرور عذاب میں ڈالے جائیں گے ۔ تو حضرت ابن عباس رضی اللہ عنہ نے فرمایا : تم لوگوں کا اس آیت سے کیا تعلق ( بنتا ) ہے؟ یہ آیت اہل کتاب کے بارے میں اتری تھی ، پھر حضرت ابن عباس رضی اللہ عنہ نے ( اس سے پہلی ) یہ آیت پڑھی : \" اور جب اللہ نے ان لوگوں کا ، جنہیں کتاب دی گئی تھی ، عہد لیا کہ تم اسے لوگوں کے سامنے کھول کر بیان کرو گے اور اس کو چھپاؤ گے نہیں ۔ \" پھر ابن عباس رضی اللہ عنہ نے ( اس کے بعد والی ) آیت تلاوت فرمائی : \" ان لوگوں کے بارے میں گمان نہ کرو جو اپنے کیے پر خوش ہوتے ہیں اور پسند کرتے ہیں کہ اس کام پر ان کی تعریف کی جائے جو انہوں نے نہیں کیا ۔ \" اور حضرت ابن عباس رضی اللہ عنہ نے فرمایا : نبی صلی اللہ علیہ وسلم نے ان سے ( ان کی کتاب میں لکھی ہوئی ) کسی چیز کے بارے میں پوچھا تو انہوں نے آپ سے وہ چیز چھپا لی اور ( اس کے بجائے ) ایک دوسری بات بتا دی اور وہ اس طرح نکلے کہ انہوں نے آپ صلی اللہ علیہ وسلم کے سامنے یہ ظاہر کیا کہ آپ صلی اللہ علیہ وسلم نے ان سے جو پوچھا تھا ، انہوں نے آپ صلی اللہ علیہ وسلم کو وہی بتا دیا ہے اور اس بات پر انہوں نے آپ صلی اللہ علیہ وسلم سے تعریف بھی بٹورنی چاہی اور جو بات آپ نے ان سے پوچھی وہ بات چھپا کر انہوں نے جو کچھ لیا تھا اس پر ( اپنے دلوں میں ) خوش بھی ہوئے ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7035,
			"arabicnumber": "2779.01",
			"text": "اسود بن عامر نے کہا : ہمیں شعبہ بن حجاج نے قتادہ سے حدیث بیان کی ، انہوں نے ابونضرہ سے اور انہوں نے قیس ( بن عباد ) سے روایت کی ، انہوں نے کہا : میں نے حضرت عمار رضی اللہ عنہ سے کہا : آپ نے اپنے اس کام پر غور کیا جو آپ نے حضرت علی رضی اللہ عنہ کے معاملے میں کیا ہے ( ان کا بھرپور ساتھ دیا ہےاور ان کے مخالفین سے جنگ تک کی ہے ) یہ آپ کے اپنے غوروفکر سے اختیار کی ہوئی آپ کی رائے تھی یا ایسی چیز تھی جس کی ذمہ داری رسول اللہ صلی اللہ علیہ وسلم نے آپ لوگوں کے سپرد کی تھی؟ انہوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے کوئی ایسی ذمہ داری ہمارے سپرد نہیں کی جو انہوں نے تمام لوگوں کے سپرد نہ کی ہو لیکن حضرت حذیفہ رضی اللہ عنہ نے مجھے نبی صلی اللہ علیہ وسلم سے خبر دی ، کہا : نبی صلی اللہ علیہ وسلم نے فرمایا : \" میرے ساتھیوں میں سے بارہ افراد منافق ہیں ، ان میں سے آٹھ ایسے ہیں جو جنت میں داخل نہیں ہوں گے یہاں تک کہ اونٹ سوئی کے ناکے میں داخل ہو جائے ( کبھی داخل نہیں ہوں گے ) ، ان میں آٹھ ایسے ہیں ( کہ ان کے شر سے نجات کے لیے ان کے کندھوں کے درمیان ظاہر ہونے والا سرخ ) پھوڑا تمہاری نجات کے لیے تمہیں کفایت کرے گا ۔ اور چار ۔ \" ( آگے کا حصہ ) مجھے ( اسود بن عامر کو ) یاد نہیں کہ شعبہ نے ان ( چار ) کے بارے میں کیا کہا تھا ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7036,
			"arabicnumber": "2779.02",
			"text": "محمد بن جعفر ( غندر ) نے کہا؛ ہمیں شعبہ نے قتادہ سے حدیث بیان کی ، انہوں نے ابونضرہ سے اور انہوں نے قیس بن عباد سے روایت کی ، انہوں نے کہا : ہم لوگوں نے حضرت عمار رضی اللہ عنہ سے کہا : آپ ( حضرت علی رضی اللہ عنہ کی حمایت میں ) اپنی جنگ کو کیسے دیکھتے ہیں ، کیا یہ ایک رائے ہے جو آپ نے غوروفکر سے اختیار کی ہے؟ تو رائے غلط بھی ہو سکتی ہے اور صحیح بھی ، یا کوئی ذمہ داری ہے جو رسول اللہ صلی اللہ علیہ وسلم نے ہمیں کوئی ایسی ( خصوصی ) ذمہ داری نہیں دی تھی جو تمام لوگوں کے سپرد نہ کی ہو اور کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" بےشک میری امت میں ۔ ۔ ۔ \"\" شعبہ نے کہا : اور میں سمجھتا ہوں کہ انہوں نے کہا تھا : مجھے حذیفہ رضی اللہ عنہ نے ( یہ ) حدیث سنائی ۔ اور غندر نے کہا : مجھے لگتا ہے کہ انہوں نے کہا : \"\" میری امت میں بارہ منافق ہیں ، وہ جنت میں داخل نہ ہوں گے اور نہ اس کی خوشبو پائیں گے ، جب تک کہ اونٹ سوئی کے ناکے میں داخل نہ ہو جائے ۔ ان میں سے آٹھ ایسے ہیں ( کہ ان کے شر سے بچاؤ کے لیے ) تمہاری کفایت ایک ایسا پھوڑا کرے گا جو آگ کے جلتے ہوئے دیے کی طرح ( اوپر سے سرک ) ہو گا ، ان کے کندھوں میں طاہر ہو گا یہاں تک کہ ان کے سینوں سے نکل آئے گا ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7037,
			"arabicnumber": "2779.03",
			"text": "ولید بن جمیع نے کہا : ہمیں ابوطفیل رضی اللہ عنہ نے حدیث بیان کی ، انہوں نے کہا : عقبہ والوں میں سے ایک شخص اور حضرت حذیفہ رضی اللہ عنہ کے درمیان ( اس طرح کا ) جھگڑا ہو گیا جس طرح لوگوں کے درمیان ہو جاتا ہے ۔ ( گفتگو کے دوران میں ) انہوں نے ( اس شخص سے ) کہا : میں تمہیں اللہ کی قسم دے کر پوچھتا ہوں کہ عقبہ والوں کی تعداد کتنی تھی؟ ( حضرت ابوطفیل رضی اللہ عنہ نے ) کہا : لوگوں نے اس سے کہا : جب وہ آپ سے پوچھ رہے ہیں تو انہیں بتاؤ ۔ ( پھر حضرت حذیفہ رضی اللہ عنہ نے خود ہی جواب دیتے ہوئے ) کہا : ہمیں بتایا جاتا تھا کہ وہ چودہ لوگ تھے اور اگر تم بھی ان میں شامل تھے تو وہ کل پندرہ لوگ تھے اور میں گواہی دیتا ہوں کہ ان میں سے بارہ دنیا کی زندگی میں بھی اللہ اور اس کے رسول صلی اللہ علیہ وسلم کے خلاف جنگ میں تھے اور ( آخرت میں بھی ) جب گواہ کھڑے ہوں گے ۔ اور آپ صلی اللہ علیہ وسلم نے ان تین لوگوں کا عذر قبول فرما لیا تھا جنہوں نے کہا تھا کہ ہم نے رسول اللہ صلی اللہ علیہ وسلم کے اعلان کرنے والے کا اعلان نہیں سنا تھا اور اس بات سے بھی بے خبر تھے کہ ان لوگوں کا ارادہ کیا ہے جبکہ آپ صلی اللہ علیہ وسلم اس وقت حرہ میں تھے ، آپ چل پڑے اور فرمایا : \" پانی کم ہے ، اس لیے مجھ سے پہلے وہاں کوئی نہ پہنچے ۔ \" چنانچہ آپ صلی اللہ علیہ وسلم نے ( وہاں پہنچ کر ) دیکھا کہ کچھ لوگ آپ سے پہلے وہاں پہنچ گئے ہیں تو آپ نے اس روز ان پر لعنت کی ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7038,
			"arabicnumber": "2780.01",
			"text": "معاذ عنبری نے کہا : ہمیں قروہ بن خالد نے ابو زبیر سے حدیث بیان کی ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سےروایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" کون ہے جو اس گھاٹی ( یعنی ) مرار کی گھاٹی پرچڑھے گا!بے شک اس کے گناہ بھی اسی طرح جھڑ جائیں گے جس طرح بنی اسرائیل کے گناہ جھڑ گئے تھے ۔ \"\" ( حضرت جابر رضی اللہ تعالیٰ عنہ نے ) کہا : تو سب سے پہلے جو اس گھاٹی پر چڑھے وہ ہمارے بنو خزرج کے گھوڑ ے تھے ، پھر لوگوں کا تانتابندھ گیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تم سب وہ ہو جن کے گناہ بخش دیئے گئے ، سوائے سرخ اونٹ والے شخص کے ۔ \"\" ہم اس کے پاس آئے اور ( اس سے ) کہا : آؤ رسول اللہ صلی اللہ علیہ وسلم تمہارے لئے بھی استغفار فرمائیں ۔ اس نے کہا : اللہ کی قسم!اگر میں اپنی گم شدہ چیز پالوں تو یہ بات مجھے اس کی نسبت زیادہ پسند ہے کہ تمہارا صاحب میرے لئے مغفرت کی دعا کرے ۔ ( حضرت جابر رضی اللہ تعالیٰ عنہ نے ) کہا : وہ آدمی اس وقت اپنی سے کم شدہ چیز کو ڈھونڈنے کے لئے آوازیں لگارہا تھا ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7039,
			"arabicnumber": "2780.02",
			"text": "یحییٰ بن حبیب حارثی نے ہمیں یہی حدیث بیان کی ، کہا : ہمیں خالد بن حارث نےحدیث بیان کی ، کہا : ہمیں قرہ نے حدیث بیان کی ، انھوں نے کہا : ہمیں ابو زبیر نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کون ہےجو مراد مرار یا مرار کی گھاٹی پر چڑھے گا ۔ \" ( آگے ) معاذ عنبری کی حدیث کے مانند ، البتہ ( اس حدیث میں ) انھوں نے کہا : اور وہ ایک اعرابی تھا جو اپنی گم شدہ چیز ڈھونڈنے کے لئے اعلان کرنے کے لئے آیا تھا ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7040,
			"arabicnumber": "2781",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : ہم بنو نجار میں سے ایک شخص تھا ، اس نے سورہ بقرہ اور سورہ آل عمران پڑھی ( یاد کی ) ہوئی تھی اور وہ رسول اللہ صلی اللہ علیہ وسلم کے لئے کتابت کیا کرتا تھا ، وہ بھاگ کر چلا گیا اور اہل کتاب کے ساتھ شامل ہوگیا ، انھوں نے اس کو بہت اونچا اٹھایا اور کہا : یہ ہے جو محمد ( صلی اللہ علیہ وسلم ) کے لئے کتابت کرتا تھا وہ اس کے آنے سے بہت خوش ہوئے ، تھوڑے ہی دن گزرے کہ اللہ تعالیٰ نے ان کے بیچ میں ( ہوتے ہوئے ) اس کی گردن توڑ دی ۔ انھوں نے اس کے لیے قبر کھودی اور اسے دفن کردیا ۔ صبح ہوئی تو زمین نے اسے اپنی سطح کے ا وپر پھینک دیا تھا ۔ انھوں نے دوبارہ وہی کیا ، اس کی قبر کھودی اور اسے دفن کردیا ۔ پھر صبح ہوئی تو زمین نے اسے باہر پھینک دیا تھا ، انھوں نے پھر ( تیسری بار ) اسی طرح کیا ، اس کے لئے قبر کھودی اور اسے دفن کردیا ، صبح کو زمین نے اسے باہر پھینک دیا ہواتھا تو انھوں نے اسے اسی طرح پھینکا ہوا چھوڑ دیا ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7041,
			"arabicnumber": "2782",
			"text": "حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم ایک سفر سے و اپس آئے ، جب آپ صلی اللہ علیہ وسلم مدینہ منورہ کے قریب تھے تو اتنے زور کی آندھی چلی کہ قریب تھا وہ سوار کو بھی ( ریت میں ) دفن کردے گی ۔ تو وہ ( جابر رضی اللہ تعالیٰ عنہ ) یقین سے کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" یہ آندھی کسی منافق کی موت کے لئے بھیجی گئی ہے \" جب آ پ مدینہ منورہ تشریف لے آئے تو منافقوں میں سے ایک بہت بڑا منافق مرچکا تھا ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7042,
			"arabicnumber": "2783",
			"text": "ایاس ( بن سلمہ بن اکوع ) نے ہمیں حدیث بیان کی ، کہا : مجھے میرے والد نے حدیث بیان کی ، انھوں نے کہا : ہم نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ایک شخص کی ، جسے بخار چڑھا ہوا تھا ، عیادت کی ، کہا : میں نے اس ( کےجسم ) پر اپنا ہاتھ رکھا تو میں نے کہا : اللہ کی قسم! میں نے آج کی طرح کسی شخص کو نہیں دیکھا جو اس سے زیادہ تپ رہا ہو ، تو اللہ کے نبی صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمھیں قیامت کے دن اس سے بھی زیادہ تپتے ہوؤں کے بارے میں نہ بتاؤں؟یہ دونوں شخص جو ( اونٹوں پر ) سوار ہیں ، اپنے منہ دوسری طرف کیے ہوئے ہیں ۔ \" ( آپ نے یہ بات ) دو آدمیوں کے بارے میں ( فرمائی ) جو اس وقت ( ظاہر طور ) آپ کے ساتھیوں میں ( شمار ہوتے ) تھے ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7043,
			"arabicnumber": "2784.01",
			"text": "عبیداللہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" منافق کی مثال اس بکری کی طرح ہے جو بکریوں کے دو ریوڑوں کے درمیان ممیاتی ہوئی بھاگی پھرتی ہے کبھی بھاگ کر اس ریوڑ میں جاتی ہے اور کبھی اس طرف جاتی ہے ( کسی بھی ایک ریوڑ کا حصہ نہیں ہوتی ۔)",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7044,
			"arabicnumber": "2784.02",
			"text": "موسیٰ بن عقبہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ، مگر انھوں نے کہا : \" پلٹ کر ایک باراس ( ریوڑ ) میں آتی ہے اور دوسری بار اس میں ۔",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 21
			}
		}
	]
}