{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7235,
			"arabicnumber": "2880.01",
			"text": "عمرو ناقد نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان بن عینیہ نے زہری سے حدیث بیان کی ، انھوں ن ے عروہ سے ، انھوں نے زینب بنت ام سلمہ رضی اللہ تعالیٰ عنہا سے ، انھوں نے حضرت ام حبیبہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے حضرت زینب بنت جحش رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم اپنی نیند سے بیدار ہوئے جبکہ آپ فرمارہے تھے : \"\" اللہ کے سواکوئی سچا معبود نہیں ، عرب اس شر کی وجہ سے ہلاک ہوگئے جو قریب آپہنچا ہے ۔ آج یاجوج ماجوج کی دیوار میں سے اس قدر جگہ کھل گئی ہے ۔ \"\" اور سفیان نے اپنے ہاتھ سے دس کا اشارہ بنایا ۔ ( حضرت زینب رضی اللہ تعالیٰ عنہا نے ) کہا : میں نے عرض کی : ہم میں نیک لوگ موجود ہوں گے ، پھر بھی ہم ہلاک ہوجائیں گے؟فرمایا؛ \"\" ہاں جب شر اور گندگی زیادہ ہوجائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7236,
			"arabicnumber": "2880.02",
			"text": "ابو بکر بن ابی شیبہ ، سعید بن عمرو اشعشی ، زہیر بن حرب اور ابن ابی عمر نے ہمیں حدیث بیان کی ، انھوں نے کہا : ہمیں سفیان نے زہری سے اسی سند کے ساتھ حدیث بیان کی اور انھوں نے سفیان سے بیان کردہ روایت کی سند میں مزید کہا : زینب بنت ابو سلمہ رضی اللہ تعالیٰ عنہا نے حبیبہ سے ، انھوں نے ام حبیبہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے زینب بنت جحش رضی اللہ تعالیٰ عنہا سے روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7237,
			"arabicnumber": "2880.03",
			"text": "یونس نے ابن شہاب سے روایت کی ، کہا : مجھے عروہ بن زبیر نے بتایا کہ انھیں زینب بنت ابو سلمہ رضی اللہ تعالیٰ عنہا نے خبر دی کہ حضرت ام حبیبہ رضی اللہ تعالیٰ عنہا بنت ابی سفیان رضی اللہ تعالیٰ عنہ نے ان سے بیان کیا کہ نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت زینب بنت جحش رضی اللہ تعالیٰ عنہا نے کہا ۔ ایک دن رسول اللہ صلی اللہ علیہ وسلم گھبراہٹ کے عالم میں سرخ چہرے کے ساتھ ( خواب گاہ سے ) نکلے ۔ آپ فرمارہے تھے : \"\" اللہ کے سوا کوئی سچا معبود نہیں عرب اسی شر کی وجہ سے ہلاک ہوگئے جو اب قریب آپہنچا ہے ۔ آج یاجوج ماجوج کی دیوار اس قدر کھل گئی ہے ۔ \"\" اور آپ نے شہادت کی انگلی اور انگوٹھے کو ملا کر حلقہ بنایا ۔ ( حضرت زینب رضی اللہ تعالیٰ عنہا نے ) کہا : تو میں نے عرض کی ہم میں نیک لوگ موجود ہوں ، یا پھر بھی ہم ہلاک ہوجائیں گے \"\" آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" ہاں ، جب شر اورگندگی زیادہ ہوجائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7238,
			"arabicnumber": "2880.04",
			"text": "عقیل بن خالد اور صالح دونوں نے ابن شہاب ( زہری ) سے یونس کی زہری سے حدیث کے مطابق اور اسی کی سند سے بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7239,
			"arabicnumber": "2881",
			"text": "احمد بن اسحاق نے کہا : ہمیں وہیب نے حدیث بیان کی ، انھوں نے کہا : ہمیں عبداللہ بن طاوس نے ا پنے والد سے حدیث بیان کی ، انھوں نے حضرت ابو ہریر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" آج یاجوج ماجوج کی دیوار اتنی کھل گئی ہے ۔ \" وہیب نے اپنی انگلی سے نوے کا نشان بنایا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7240,
			"arabicnumber": "2882.01",
			"text": "جریر نے عبدالعزیز بن رفیع سے اور انھوں نے عبداللہ بن قبطیہ سے روایت کی ، انھوں نے کہا : حارث بن ابی ربیعہ ، عبداللہ بن صفوان اور میں بھی ان کے ساتھ تھا ۔ ہم ام المومنین حضرت ام سلمہ رضی اللہ تعالیٰ عنہا کی خدمت میں حاضر ہوئے ، ان دونوں نے اُن سے اس لشکر کےمتعلق سوال کیا جس کو زمین میں دھنسا دیاجائے گا ، یہ حضرت عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ ( کی خلافت ) کا زمانہ تھا ۔ ( ام المومنین رضی اللہ تعالیٰ عنہا نے ٓ ) نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" ایک پناہ لینے والا بیت اللہ میں پناہ لے گا ، اس کی طرف ایک لشکر بھیجاجائےگا ، جب وہ لوگ زمین کے بنجر ہموارحصے میں ہوں گے تو ان کو زمین میں دھنسا دیا جائے گا ۔ \"\" میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !جو مجبور ان کے ساتھ ( شامل ) ہوگا اس کا کیا بنے گا؟آپ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" اسے بھی ان کے ساتھ دھنسا دیا جائے گاالبتہ قیامت کے دن اس کو اس کی نیت کے مطابق اٹھایا جائے گا ۔ \"\" اور ابو جعفر نے کہا : یہ مدینہ ( کے قریب ) کا چٹیل حصہ ہوگا ( جہاں ان کو دھنسا یا جائے گا ۔)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7241,
			"arabicnumber": "2882.02",
			"text": "عبدالعزیز بن رفیع نے ہمیں اسی سند کےساتھ حدیث بیان کی اور ان کی حدیث میں ہے : ( ابن قبطیہ نے ) کہا : تو میں ابو جعفر سے ملا ، میں نے کہا : انھوں ( ام المومنین رضی اللہ تعالیٰ عنہا ) نے تو زمین کا ایک چٹیل میدان کہا تھا ۔ توابو جعفر نے کہا : ہرگز نہیں ، اللہ کی قسم! وہ مدینہ کا چٹیل حصہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7242,
			"arabicnumber": "2883.01",
			"text": "امیہ بن صفوان سے روایت ہے ، انھوں نے اپنے داداعبداللہ بن صفوان کو کہتے ہوئے سنا کہ مجھے حضرت حفصہ رضی اللہ تعالیٰ عنہا نے بیان کیا اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" ایک لشکر ( اللہ کے ) اس گھر کے خلاف جنگ کرنے کے لئے اس کا رخ کرےگا یہاں تک کہ جب وہ زمین کے چٹیل حصے میں ہوں گے تو ان کے درمیان والے حصے کو ( زمین میں ) دھنسا دیا جائے گا ان میں سے ایک علیحدہ رہ جانے والے شخص کےسوا ، جو ان کے بارے میں خبر دے گا اور کوئی ( زندہ ) باقی نہیں بچے گا ۔ \"\" تو ایک شخص نے ( ان کی بات سن کر ) کہا : میں تمہارے بارے میں گواہی دیتا ہوں کہ تم نے حضرت حفصہ رضی اللہ تعالیٰ عنہا پر جھوٹ نہیں باندھا اور میں ( یہ بھی ) گواہی دیتاہوں کہ حضرت حفصہ رضی اللہ تعالیٰ عنہا نے نبی کریم صلی اللہ علیہ وسلم کے بارے میں جھوٹ نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7243,
			"arabicnumber": "2883.02",
			"text": "عبیداللہ بن عمرو نے کہا : ہمی زید بن ابی اُنیسہ نے عبدالملک عامری سے خبر دی ، انھوں نے یوسف بن مالک سے روایت کی ، کہا : مجھے عبداللہ بن صفوان نے ام المومنین رضی اللہ تعالیٰ عنہا سے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ایک قوم اس گھر ۔ ۔ ۔ یعنی کعبہ ۔ ۔ ۔ میں پناہ لے گی ، ا ن کے پاس نہ اپنا دفاع کرنے کےلیے کوئی ذریعہ ہوگا ، نہ عدوی قوت ہوگی اور نہ سامان جنگ ہی ہوگا ، ان کی طرف ایک لشکر روانہ کیا جائے گا ۔ یہاں تک کہ جب وہ ( لشکر کے ) لوگ زمین کے ایک چٹیل حصے میں ہوں گے تو ان کو ( زمین میں ) دھنسا دیا جائےگا ۔ \"\" یوسف ( بن مابک ) نے کہا : ان دونوں اہل شام مکہ کی طرف بڑھے آرہے تھے ، تو عبداللہ بن صفوان نے کہا : دیکھو ، اللہ کی قسم!یہ وہ لشکر نہیں ہے ۔ زید ( بن ابی انیسہ ) نے کہا : اور مجھے عبدالملک عامری نے عبدالرحمان بن سابط سے ، انھوں نے حارث بن ابی ربیعہ سے ، انھوں نے ام المومنین رضی اللہ تعالیٰ عنہا سے ، یوسف بن مابک کی حدیث کے مانند روایت کی ، مگر انھوں نے اس میں اس لشکر کی بات نہیں کی جس کا عبداللہ بن صفوان نے ذکر کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7244,
			"arabicnumber": "2884",
			"text": "عبداللہ بن زبیر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے نیند کے دوران ( اضطراب کے عالم ) میں اپنے ہاتھ کو حرکت دی تو ہم نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم ! آپ نے نیند میں کچھ ایسا کیا جو پہلےآپ نہیں کیا کر تے تھے تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ عجیب بات ہے کہ ( آخری زمانےمیں ) میری امت میں سے کچ لوگ بیت اللہ کی پناہ لینے والے قریش کے ایک آدمی کے خلاف ( کاروائی کرنے کے لیے ) بیت اللہ کا رخ کریں گے یہاں تک کہ جب وہ چٹیل میدان حصے میں ہوں گے تو انھیں ( زمین میں ) دھنسا دیا جائے گا ۔ \" ہم نے عرض کی ، اللہ کے رسول صلی اللہ علیہ وسلم ! راستہ تو ہرطرح کے لوگوں کے لیے ہوتا ہے ۔ آپ نے فرمایا : \" ہاں ، ان میں سے کوئی اپنی مہم سے آگاہ ہوگا ، کوئی مجبور اور کوئی مسافر ہوگا ۔ وہ سب اکھٹے ہلاک ہوں گے اور ( قیامت کے روز ) واپسی کے مختلف راستوں پر نکلیں گے اللہ انھیں ان کی نیتوں کے مطابق اٹھائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7245,
			"arabicnumber": "2885.01",
			"text": "سفیان بن عینیہ نے زہری سے ، انھوں نے عروہ سے اور انھوں نے حضرت اسامہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم مدینہ منورہ کے قلعوں میں سے ایک قلعے ( اونچی محفوظ عمارت ) پر چڑھے ، پھر فرمایا : \" کیا تم ( بھی ) دیکھتے ہو جو میں دیکھ رہا ہوں؟میں تمہارے گھروں میں فتنوں کے واقع ہونے کے مقامات بارش ٹپکنے کے نشانات کی طرح ( بکثرت اور واضح ) دیکھ رہا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7246,
			"arabicnumber": "2885.02",
			"text": "معمر نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7247,
			"arabicnumber": "2886.01",
			"text": "ابن مسیب اور ابو سلمہ بن عبدالرحمان نے حدیث بیان کی کہ حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" عنقریب فتنے ہوں گے ، ان میں بیٹھا رہنے والا کھڑے رہنے والے سے بہتر ہوگا اور ان میں کھڑا ہونے والا چلنے و الے سے بہتر ہوگااور ان میں چلنے والا دوڑنے والے سے بہتر ہوگا جو ان کی طرف جھانکے گا بھی وہ اسے اوندھا کردیں گے اور جس کو ان ( کے دوران ) میں کوئی پناہ گاہ مل جائے وہ اس کی پناہ حاصل کرلے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7248,
			"arabicnumber": "2886.02",
			"text": "ابو بکر بن عبدالرحمان نے عبدالرحمان بن مطیع بن اسودسے ، انھوں نے نوفل بن معاویہ سے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کی اسی حدیث کے مانند حدیث بیان کی ، البتہ ابو بکر نے مزید کہا ہے : \" نمازوں میں ایک نماز ایسی ہے جس کی وہ ( نماز ) فوت ہوگئی تو گویا اس کا اہل اور مال ( سب کچھ ) تباہ ہوگیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7249,
			"arabicnumber": "2886.03",
			"text": "ابراہیم بن سعد کے والد نے ابو سلمہ سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا ہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" ایسا فتنہ ( برپا ہوگا ) جس میں سونے والا جاگنے والےسے بہتر ہوگا اور اس میں جاگنے والے سے بہتر ہوگا اور اس میں جاگنے والا ( اٹھ ) کھڑے ہو جانے والے سے بہتر ہوگا اور اس میں کھڑا ہوجانے والا دوڑنے والے سےبہتر ہوگا جس کو بچنے کی جگہ یاکوئی پناہ گاہ مل جائے تو وہ ( اس کی ) پناہ حاصل کرے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7250,
			"arabicnumber": "2887.01",
			"text": "حمادبن زید نے کہا : ہمیں عثمان الشحام نے حدیث بیان کی ، انھوں نے کہا : میں اور فرقد سبخی مسلم بن ابی بکرہ کے ہاں گئے ، وہ اپنی زمین میں تھے ہم ان کے ہاں اندر داخل ہوئے اور کہا : کیا آپ نے اپنےوالد کو فتنوں کے بارے میں کوئی حدیث بیان کرتے ہوئے سنا؟انھوں نے کہا : ہاں ، میں نے ( اپنے والد ) حضرت ابو بکرۃ رضی اللہ تعالیٰ عنہ وحدیث بیان کرتے ہوئے سنا ، انھوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم ! نے فرمایا : \" عنقریب فتنے برپا ہوں گے سن لو!پھر ( اور ) فتنے برپا ہوں گے ، ان ( کےدوران ) میں بیٹھا رہنے و الا چلے والے سے بہتر ہوگا ، اور ان میں چلنے والا دوڑنے والے سے بہتر ہوگایاد رکھو!جب وہ نازل ہوگا یا واقع ہوں گے تو جس کے ( پاس ) اونٹ ہوں وہ اپنے اونٹوں کے پاس چلا جائے ، جس کے پاس بکریاں ہوں وہ بکریوں کے پاس چلاجائے اور جس کی زمین وہ زمین میں چلاجائے ۔ \" ( حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے ) کہا : تو ایک شخص نے عرض کی اللہ کے رسول صلی اللہ علیہ وسلم !اس کےبارے میں کیا خیال ہے جس کے پاس یہ اونٹ ہوں ، نہ بکریاں ، نہ زمین؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" وہ اپنی تلوار لے ، اس کی دھار کو پتھر سے کوٹے ( کندکردے ) اورپھر اگر بچ سکےتو بچ نکلے!اے اللہ!کیا میں نے ( حق ) پہنچا دیا؟اے اللہ! کیا میں نے ( حق ) پہنچا دیا ۔ اے اللہ! کیا میں نے پہنچا دیا ۔ کہا : تو ایک شخص نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !اگر مجھے مجبور کردیا جائے اور لے جاکر ایک صف میں یا ایک فریق کے ساتھ کھڑا کردیاجائے اور کوئی آدمی مجھے اپنی تلوار کا نشانہ بنادے یا کوئی تیر آئے اور مجھے مار ڈالے تو؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( اگر تم نے وار نہ کیا ہوا ) تو وہ اپنے اور تمہارے گناہ سمیٹ لے جائے گا اور اہل جہنم میں سے ہوجائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7251,
			"arabicnumber": "2887.02",
			"text": "وکیع اور ا بن ابی عدی نے عثمان شحام سے اسی سند کے ساتھ ابن عدی کی حدیث کو حماد کی حدیث کے مانند آخر تک بیان کیا اور وکیع کی حدیث اس بات پر ختم ہوگئی؛ \" اگر وہ بچ سکے ( تو بچ جائے ۔ ) \" اور بعد والا حصہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7252,
			"arabicnumber": "2888.01",
			"text": "ابو کامل فضیل بن حسین جحدری نے مجھے حدیث بیان کی کہا : ہمیں حماد بن زید نے ایوب اور یونس سے حدیث بیان کی انھوں نے احنف بن قیس سے روایت کی ، انھوں نے کہا : میں ( گھر سے ) اس شخص ( حضرت علی رضی اللہ تعالیٰ عنہ کے ساتھ شامل ہونے ) کے ارادے سے نکلا تو مجھے حضرت ابو بکر رضی اللہ تعالیٰ عنہ ملے ۔ انھوں نے پوچھا : احنف! کہاں کاارداہ ہے؟کہا : میں نے کہ میں رسول اللہ صلی اللہ علیہ وسلم کے عم زادیعنی حضرت علی رضی اللہ تعالیٰ عنہ کی نصرت کرنا چاہتا ہوں ۔ کہا تو انھوں نے مجھ سے کہا : احنف !لوٹ جاؤ کیونکہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سناتھا آپ فرمارہے تھے \" جب دومسلمان اپنی اپنی تلواروں کے ساتھ آمنے سامنے آجائیں تو قاتل اور مقتول دونوں ( جہنم کی ) آگ میں ہوں گے ۔ \" کہا : تو میں نے عرض کی ۔ یا کہاگیا ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم !یہ تو قاتل ہوا ( لیکن ) مقتول کا یہ حال کیوں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس نے ( بھی ) اپنے ساتھی کو قتل کرنے کا ارداہ کر لیاتھا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7253,
			"arabicnumber": "2888.02",
			"text": "احمد بن عبدہ نصحی نے ہمیں یہی حدیث بیان کی انھوں نے کہا : ہمیں حماد نے ایوب یونس اور معلی بن زیادہ سے حدیث بیان کی ، انھوں نے حسن سے انھو ں نے حسن سے انھوں نے احنف بن قیس سے اور انھوں نےحضرت ابوبکر رضی اللہ تعالیٰ عنہ سے روایت کی کہا رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب وہ مسلمان اپنی اپنی تلواروں سے باہم ٹکرائیں تو قاتل اور مقتول دونوں آگ میں ہو ں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7254,
			"arabicnumber": "2888.03",
			"text": "معمر نے ہمیں ایوب سے اسی سند کے ساتھ حماد سے ابو کامل کی حدیث کی طرح آخر تک بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7255,
			"arabicnumber": "2888.04",
			"text": "ربعی بن حراش نے حضرت ابو بکرہ رضی اللہ تعالیٰ عنہ سے اورانھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا \" جب وہ مسلمانوں میں سے ایک نے اپنے بھائی پر اسلحہ کشی کی تو وہ دونوں جہنم کے کنارے پر ہیں پھر جب ان میں سے ایک نے ( موقع پاتے ) دوسرے کو قتل کردیا تو دونوں اکٹھے جہنم میں داخل ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7257,
			"arabicnumber": "157.10",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہو گی یہاں تک کہ بہت زیادہ ہرج ( جانوں کی تباہی ) ہوجائے گی؟انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے پوچھا : اللہ کے رسول اللہ صلی اللہ علیہ وسلم ! ہرج ( تباہی ) کیا ہو گی؟فرمایا : \" قتل ، قتل ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7258,
			"arabicnumber": "2889.01",
			"text": "ایوب نے ابو قلابہ سے انھوں نے ابو اسماء سے اور انھوں نے حضرت ثوبان رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بے شک اللہ تعالیٰ نے میرے لیے زمین کو لپیٹ دیا اور میں نے اس کے مشارق و مغارب کو دیکھ لیا اور جہاں تک یہ زمین میرے لیے لپیٹی گئی عنقریب میری امت کی حکومت وہاں تک پہنچے گی اور مجھے سرخ اور سفید دونوں خزانے ( سونے اور چاندی کے ذخائر ) دیے گئے اور میں نے اپنے رب سے اپنی امت کے لیے یہ سوال کیا کہ وہ اس کو عام قحط سالی سے ہلاک نہ کرے اور ان کے علاوہ سے ان پر کوئی دشمن مسلط نہ کرے جو مجموعی طور پر ان سب ( کی جانوں ) کورواکر لے ۔ بے شک میرے رب نے فرمایا : \" اے محمد صلی اللہ علیہ وسلم !جب میں کو ئی فیصلہ کردوں تو وہ رد نہیں ہوتا ۔ بلاشبہ میں نے آپ کی امت کے لیے آپ کو یہ بات عطا کردی ہے کہ ان کو عام قحط سالی سے ہلاک نہیں کروں گا اور ان پر ان کے علاوہ سے کسی اور دشمن کو مسلط نہ کروں گاجو ان سب ( کی جانوں ) کورواقراردے لے ۔ چاہے ان کے خلاف ان کے اطراف والے ۔ یا کہا : ان کے اطراف والوں کے اندر سے ہوں اکٹھے کیوں نہ ہوں جائیں ۔ یہاں تک کہ یہ ( خود ) ایک دوسرے کو ہلاک کریں گے ۔ اور ایک دوسرے کو قیدی بنائیں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7259,
			"arabicnumber": "2889.02",
			"text": "قتادہ نے ابوقلابہ سے انھوں نے ابو اسماء یحییٰ سے اور انھوں نے حضرت ثوبان رضی اللہ تعالیٰ عنہ سے روایت کی کہ اللہ کے نبی صلی اللہ علیہ وسلم نے فرمایا : \" بے شک اللہ تعالیٰ نے زمین کو میرے لیے لپیٹ دیا حتیٰ کہ میں نے اس کےمشارق کو مغارب کو دیکھ لیا اور اس نے مجھے سرخ اور سفید وہ خزانے عطا فرمائے ۔ \" اس کے بعد ابو قلابہ سے ایوب کی روایت کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7260,
			"arabicnumber": "2890.01",
			"text": "عبد اللہ بن نمیر نے کہا : ہمیں عثمان بن حکیم نے حدیث بیان کی ، کہا : مجھے عامر بن سعد نے اپنے والد ( سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ ایک دن رسول اللہ صلی اللہ علیہ وسلم ( مدینہ کے ) بالائی علاقے سے تشریف لائے یہاں تک کہ جب آپ بنو معاویہ کی مسجد کے قریب سے گزرے تو آپ اس میں داخل ہوئے اور وہ رکعتیں ادا فرمائیں ۔ ہم نے بھی آپ کے ساتھ نماز پڑھی اور آپ نے اپنے رب سے بہت لمبی دعا کی پھر آپ نے ہماری طرف رخ کیا تو فرمایا : \" میں نے اپنے رب سے تین ( چیزیں ) مانگیں ۔ اس نے وہ مجھے عطا فرمادیں اور ایک مجھ سے روک لی ۔ میں نے اپنے رب سے یہ مانگا کہ وہ میری ( پوری ) امت کو قحط سالی سے ہلاک نہ کرے تو اس نے مجھے یہ چیز عطا فرمادی اور میں نے اس سے مانگا کہ وہ میری امت کو غرق کر کے ہلاک نہ کرے تو اس نے یہ ( بھی ) مجھے عطافرمادی اور میں نے اس سے یہ سوال کیا کہ ان کی آپس میں جنگ نہ ہو تو اس نے یہ ( بات ) مجھ سے روک لی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7261,
			"arabicnumber": "2890.02",
			"text": "مروان بن معاویہ نے کہا : ہمیں عثمان بن حکیم نے حدیث بیان کی ، کہا : مجھے عامر بن سعد نے اپنے والد ( سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ ) سے خبر دی کہ وہ رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ صحابہ کرام رضوان اللہ عنھم اجمعین کی ایک جماعت کے ساتھ آئے اور آپ بنو معاویہ کی مسجد کے قریب سے گزرے ۔ ( آگے ) ابن نمیرکی حدیث کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7262,
			"arabicnumber": "2891.01",
			"text": "یونس نے مجھے ابن شہاب سے خبردی کہ ابو ادریس خولانی کہا کرتے تھے کہ حضرت حذیفہ بن یمان رضی اللہ تعالیٰ عنہ نے بیان کیا : اللہ کی قسم!میں اب سے لے کر قیامت تک وقوع پذیر ہونے والے تمام فتنوں کے بارے میں باقی سب لوگوں کی نسبت زیادہ جانتاہوں ۔ اور ( انھیں بیان کرنےمیں ) میرے لیے اس کے سوا اور کوئی ( مانع ) نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ان میں سے کوئی چیز راز کے طورپر مجھے بتائی تھی جو آپ نے میرے علاوہ کسی اور کو نہیں بتائی تھی ۔ ( ایسی باتیں میں کبھی بیان نہیں کروں گا ) البتہ رسول اللہ صلی اللہ علیہ وسلم نے ایک مجلس میں جہاں میں مو جود تھا فتنوں کو شمار کر رہے تھے : \" ان میں سے تین ( فتنے ) ایسے ہیں جو تقریباً کسی چیزکو باقی نہیں چھوڑیں گے اور ان میں سے کچھ فتنے ایسے ہیں جو موسم گرما کی آندھیوں کی طرح ہیں ان میں کچھ چھوٹے ہیں اور کچھ بڑے ہیں ۔ \" حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے کہا : میرے سوا وہ سب لوگ ( جو اس مجلس میں موجود تھے ) رخصت ہوگئے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7263,
			"arabicnumber": "2891.02",
			"text": "جریر نے اعمش سے انھوں نے شقیق سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : ایک بار رسول اللہ صلی اللہ علیہ وسلم ہمارے سامنے کھڑے ہوئے اور آپ نے اپنے کھڑے ہونے کے اس وقت سے لے کر قیامت تک ہونے والی کوئی ( اہم ) بات نہ چھوڑی مگر اسے بیان فرمادیا جس نے اس ( بیان ) کو یاد رکھا اس نے اسے یاد رکھا اور جس نے اسے بھلادیا اس نے اسے بھلادیا ۔ وہ سب کچھ میرے ان ساتھیوں کے علم میں آیا پھر ان میں سے کوئی چیز پیش آتی ہے جو میں بھول چکا ہوتا ہوں تو جب اسے دیکھتا ہوں تو وہ مجھے یاد آجاتی ہے بالکل اسی طرح جیسے انسان کسی غائب ہو جانے والے شخص کا چہرہ یاد رکھتا ہے جب اسے دیکھتا ہے تو پہچان لیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7264,
			"arabicnumber": "2891.03",
			"text": "سفیان نے اعمش سے اسی سند کے ساتھ ان ( حذیفہ رضی اللہ تعالیٰ عنہ ) کے اس قول تک : \" اور جس نے اسے بھلادیا اس نے اسے بھلادیا \" روایت کی اور اس کے بعد کا حصہ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7265,
			"arabicnumber": "2891.04",
			"text": "محمد بن جعفر غندرنے کہا : ہمیں شعبہ نے عدی بن ثابت سے حدیث بیان کی ، انھوں نے عبد اللہ بن یزید سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے قیامت قائم ہونے تک جو کچھ ہونے والا ہے اس کی مجھے خبر دی اور ان میں سے کوئی چیز نہیں مگر میں نے آپ سے اس کے بارے میں سوال کیا البتہ میں نے آپ سے یہ سوال نہیں کیا کہ اہل مدینہ کو مدینہ سے کون سی چیز باہر نکالے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 7266,
			"arabicnumber": "2891.05",
			"text": "وہب بن جریر نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 7267,
			"arabicnumber": "2892",
			"text": "علباء بن احمر نے کہا : حضرت ابو زید عمرو بن اخطب رضی اللہ تعالیٰ عنہ نے مجھے بیان کیا کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں فجر کی نماز پڑھائی اور منبر پر رونق افروز ہوئے تو ہمیں خطبہ دیا یہاں تک کہ ظہر کی نماز کا وقت ہو گیا آپ ( منبرسے ) اترے ہمیں نماز پڑھائی پھر دوبارہ منبر پر رونق افروز ہوئے اور ( آگے ) خطبہ ارشاد فرمایا : یہاں تک کہ عصر کی نماز کا وقت ہوگیا پھر آپ اترے نماز پڑھائی اور پھر منبر پر تشریف لے گئے اور خطبہ دیا یہاں تک کہ سورج غروب ہو گیا ۔ آپ نے جو کچھ ہوا اور جو ہونے والاتھا ( سب ) ہمیں بتادیا ہم میں سے زیادہ جاننے والا وہی ہے جو یا دواشت میں دوسروں سے بڑھ کر ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 7268,
			"arabicnumber": "144.04",
			"text": "ابو معاویہ نے کہا : ہمیں اعمش نے ( ابو وائل ) شقیق سے حدیث بیان کی انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم حضرت عمر رضی اللہ تعالیٰ عنہ کے پاس بیٹھے ہوئے تھے کہ انھوں نے کہا : فتنے کے متعلق رسول اللہ صلی اللہ علیہ وسلم کا ارشاد جس طرح آپ نے خود فرمایا تھا تم میں سے کسی کو یاد ہے؟ ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے عرض کی : مجھے ۔ ( حضرت عمر رضی اللہ تعالیٰ عنہ نے ) کہا : تم بہت جرات مند ہو ۔ ( یہ بتاؤ کہ ) آپ صلی اللہ علیہ وسلم نے کس طرح ارشاد فرمایاتھا؟میں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا آپ فرما رہے تھے ۔ انسان اپنے گھروالوں اپنےمال اپنی جان اور اپنے ہمسائے کے بارے میں جس فتنے میں مبتلا ہوتاہے تو روزہ نماز ، صدقہ ، نیکی کا حکم کرنا اور برائی سے منع کرنا اس کا کفارہ بن جاتے ہیں ۔ تو حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : میری مراد اس سے نہیں میری مراد تواس ( فتنے ) سے ہے جو سمندر کی موجوں کی طرح امڈکرآتا ہے ۔ حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے کہا : امیر المؤمنین!آپ کو اس فتنے سے کیا ( خطرہ ) ہے؟آپ کے اور اس فتنے کے درمیان ایک بنددروازہ ہے ۔ انھوں نے کہا : وہ دروازہ توڑاجائے گا یا کھولا جا ئے گا؟کہا : میں نے جواب دیا نہیں بلکہ توڑاجائےگا ۔ ( حضرت عمر رضی اللہ تعالیٰ عنہ نے ) کہا : پھر اس بات کی زیادہ توقع ہے کہ وہ ( دروازہ دوبارہ ) کبھی بند نہیں کیا جا سکے گا ۔ ( شقیق نے ) کہا : ہم نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے پوچھا کیا حضرت عمر رضی اللہ تعالیٰ عنہ جانتے تھے کہ دروازہ کون ہے؟انھوں نے کہا : ہاں اسی طرح جیسے وہ یہ بات جانتے تھے کہ صبح کے بعد رات ہے میں نے ان کو ایک حدیث بیان کی تھی وہ کوئی اٹکل بچو بات نہ تھی ۔ کہا : پھر ہم اس بات سے ڈرگئے کہ حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے پوچھیں وہ دروازہ کون تھا؟ ہم نے مسروق سے کہا : آپ ان ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ ) سے پوچھیں انھوں نے پوچھا تو ( حضرت حذیفہ رضی اللہ تعالیٰ عنہ نے ) کہا : ( وہ دروازہ ) حضرت عمر رضی اللہ تعالیٰ عنہ ( تھے)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 7269,
			"arabicnumber": "144.05",
			"text": "وکیع جریر عیسیٰ بن یونس اور یحییٰ بن عیسیٰ سب نے اعمش سے اسی سند کے ساتھ ابو معاویہ کی حدیث کی طرح حدیث بیان کی اور شقیق سے اعمش اور ان سے عیسیٰ کی حدیث میں یہ ( جملہ ) ہے کہا : میں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 7270,
			"arabicnumber": "144.06",
			"text": "ابن ابی عمر نے ہمیں حدیث بیان کی ، کہا : ہمیں سفیان نے جامع بن ابی راشد سے اور اعمش نے ابو وائل ( شقیق ) سے حدیث بیان کی ، انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : کون ہے جو ہمیں فتنے کے بارے میں حدیث بیان کرے گا؟اور ( پھر ) ا ن سب کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 7271,
			"arabicnumber": "2893",
			"text": "محمد ( بن سیرین ) سے روایت ہے انھوں نے کہا : حضرت جندب رضی اللہ تعالیٰ عنہ نے کہا : میں جرعہ کے دن وہاں آیا تو ( وہاں ) ایک شخص بیٹھا ہوا تھا ۔ میں نے کہا : آج یہاں بہت خونریزی ہو گی ۔ اس شخص نے کہا : اللہ کی قسم!ہر گز نہیں ہو گی ۔ میں نے کہا : اللہ کی قسم!ضرورہو گی اس نے کہا : واللہ !ہر گز نہیں ہو گی ، میں نے کہا واللہ!ضرورہوگی اس نے کہا : واللہ!ہرگز نہیں ہو گی ، یہ اللہ کے رسول اللہ صلی اللہ علیہ وسلم کی حدیث ہے جو آپ نے مجھے ارشاد فرمائی تھی ۔ میں نے جواب میں کہا : آج تم میرے لیے آج کے بد ترین ساتھی ( ثابت ہوئے ) ہو ۔ تم مجھ سے سن رہے ہو کہ میں تمھاری مخالفت کرر ہا ہوں اور تم نے جو رسول اللہ صلی اللہ علیہ وسلم سے سناہےا س کی بنا پر مجھے روکتے نہیں؟پھر میں نے کہا : یہ غصہ کیسا؟چنانچہ میں ( ٹھیک طرح سے ) ان کی طرف متوجہ ہوا اور ان کے بارے میں پوچھا تو وہ آدمی حضرت حذیفہ رضی اللہ تعالیٰ عنہ تھے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 7272,
			"arabicnumber": "2894.01",
			"text": "یعقوب بن عبد الرحمٰن القاری نے ہمیں سہیل سے حدیث بیان کی ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت نہیں آئے گی ۔ یہاں تک کہ دریائے فرات سونے کے ایک پہاڑ کو ظاہر کرے گا ۔ اس پر ( لڑتے ہوئے ) ہر سو میں سے ننانوے لوگ مارے جائیں گے اور ان ( لڑنے والوں ) میں سے ہر کوئی کہے گا ۔ شاید میں ہی بچ جاؤں گا ۔ ( اور سارے سونے کا مالک بن جاؤں گا ۔)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 7273,
			"arabicnumber": "2894.02",
			"text": "روح نے سہیل سے اسی سند کے ساتھ اسی کے مطابق حدیث بیان کی اور مزید کہا : تو میرے والد نے کہا : اگر تم اس پہاڑ کو دیکھ لو تو اس کے قریب بھی مت جانا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 7274,
			"arabicnumber": "2894.03",
			"text": "حفص بن عاصم نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عنقریب دریائے فرات سونے کے ایک خزانے کو ظاہر کردےگا جو شخص وہاں موجودہو تو وہ اس میں سے کچھ بھی نہ لے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 7275,
			"arabicnumber": "2894.04",
			"text": "عبد الرحمٰن اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عنقریب دریائے فرات سونے کے ایک پہاڑ کو ظاہر کردےگا ۔ جو شخص وہاں موجود ہووہ اس میں سے کچھ نہ لے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 7276,
			"arabicnumber": "2895",
			"text": "ابو کامل فضیل بن حسین اور ابو معن رقاشی نے ہمیں حدیث بیان کی ۔ الفاظ ابومعن کے ہیں ۔ دونوں نے کہا : ہمیں خالد بن حارث نے حدیث بیان کی ، کہا : ہمیں عبد الحمید بن جعفر نے حدیث بیان کی ، انھوں نے کہا : مجھے میرے والد نے سلیمان بن یسار سے خبردی ، انھوں نے عبد اللہ بن حارث بن نوفل سے روایت کی ، انھوں نے کہا : میں حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ کے ساتھ کھڑا تھا تو انھوں نےکہا : دنیا کی طلب میں لوگوں کی گردنیں مسلسل ایک دوسرے سے مختلف ( اور باہمی جھگڑے اور عداوتیں جاری ) رہیں گی ۔ میں نے کہا : ہاں ( بالکل ایسے ہی ہو گا ) انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \"\" ( وہ و قت ) قریب ہے کہ دریائےفرات سونے کے ایک پہاڑ کو ظاہر کرے گا ۔ جب لوگ اس کے بارے میں سنیں گے تو اس کی طرف چل نکلیں گے ۔ جو لوگ اس ( پہاڑ ) کے قریب ہوں گےوہ کہیں گے ۔ اگر ہم نے ( دوسرے ) لوگوں کو اس میں سے ( سونا ) لےجانے کی اجازت دے دی تو وہ سب کا سب لے جائیں گے کہا : وہ اس پر جنگ آزماہوں کے تو ہر سو میں سے ننانوے قتل ہو جائیں گے ۔ ابو کامل نے اپنی حدیث میں ( اس طرح ) کہا : انھوں نے کہا : میں اور حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ قلعہ حسان کے سائے میں ٹھہرے ہوئے تھے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 7277,
			"arabicnumber": "2896",
			"text": "ابو صالح نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( میں دیکھ رہا ہوں کہ ) عراق نے اپنے درہم اور قفیر کو روک لیا ہے اور شام نے اپنا مدی اور دینار روک لیاہے اور مصر نے اپنا اردب اور دینار روک لیا ہے اور تم وہیں پہنچ گئے ہو جہاں سے تمھارا آغاز تھا اور تم وہیں پہنچ گئے ہو جہاں سے تمھارا آغاز تھا ۔ اور تم وہیں پہنچ گئےہو ۔ جہاں تمھارا آغاز تھا ۔ اس پر ابو ہریرہ رضی اللہ تعالیٰ عنہ کا گوشت اور خون گواہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 7278,
			"arabicnumber": "2897",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہو گی ، یہاں تک کہ رومی ( عیسائی ) اعماق ( شام میں حلب اور انطاکیہ کے درمیان ایک پر فضا علاقہ جو دابق شہر سے متصل واقع ہے ) یا دابق میں اتریں گے ۔ ان کے ساتھ مقابلے کے لیے ( دمشق ) شہر سے ( یامدینہ سے ) اس وقت روئے زمین کے بہترین لوگوں کا ایک لشکر روانہ ہو گا جب وہ ( دشمن کے سامنے ) صف آراءہوں گے تو رومی ( عیسائی ) کہیں گے تم ہمارے اور ان لوگوں کے درمیان سے ہٹ جاؤ جنھوں نے ہمارے لوگوں کو قیدی بنایا ہوا ہے ہم ان سے لڑیں گے تو مسلمان کہیں گے ۔ اللہ کی قسم!نہیں ہم تمھارے اور اپنے بھائیوں کے درمیان سے نہیں ہٹیں گے ۔ چنانچہ وہ ان ( عیسائیوں ) سے جنگ کریں گے ۔ ان ( مسلمانوں ) میں سے ایک تہائی شکست تسلیم کر لیں گے اللہ ان کی توبہ کبھی قبول نہیں فرمائے گا اور ایک تہائی قتل کر دیے جائیں گے ۔ وہ اللہ کے نزدیک افضل ترین شہداء ہوں گے اور ایک تہائی فتح حاصل کریں گے ۔ وہ کبھی فتنے میں مبتلا نہیں ہوں گے ۔ ( ہمیشہ ثابت قدم رہیں گے ) اور قسطنطنیہ کو ( دوبارہ ) فتح کریں گے ۔ ( پھر ) جب وہ غنیمتیں تقسیم کر رہے ہوں گے اور اپنے ہتھیار انھوں نے زیتون کے درختوں سے لٹکائے ہوئے ہوں گے تو شیطان ان کے درمیان چیخ کر اعلان کرے گا ۔ مسیح ( دجال ) تمھارےپیچھے تمھارے گھر والوں تک پہنچ چکا ہے وہ نکل پڑیں گے مگر یہ جھوٹ ہو گا ۔ جب وہ شام ( دمشق ) پہنچیں گے ۔ تووہ نمودار ہو جا ئے گا ۔ اس دوران میں جب وہ جنگ کے لیے تیاری کررہے ہوں گے ۔ صفیں سیدھی کر رہے ہوں گے تو نماز کے لیے اقامت کہی جائے گی اس وقت حضرت عیسیٰ بن مریم علیہ السلام اتریں گے تو ان کا رخ کریں گے پھر جب اللہ کا دشمن ( دجال ) ان کو دیکھے گاتو اس طرح پگھلےگا جس طرح نمک پانی میں پگھلتا ہے اگر وہ ( حضرت عیسیٰ علیہ السلام ) اسے چھوڑ بھی دیں تو وہ پگھل کر ہلاک ہوجائے گا لیکن اللہ تعالیٰ اسے ان ( حضرت عیسیٰ علیہ السلام ) کے ہاتھ سے قتل کرائے گااور لوگوں کو ان کے ہتھیارپر اس کا خون دکھائےگا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 7279,
			"arabicnumber": "2898.01",
			"text": "موسیٰ بن علی نے اپنے والد سے روایت کی انھوں نے کہا : حضرت مستورد قرشی رضی اللہ تعالیٰ عنہ نے حضرت عمرو بن عاص رضی اللہ تعالیٰ عنہ کے سامنے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" قیامت آئے گی تورومی ( عیسائی ) لوگوں میں سب سے زیادہ ہوں گے ۔ : \" حضرت عمرو رضی اللہ تعالیٰ عنہ نے ان سے کہا : دیکھ لوتم کیا کہہ رہے ہو ۔ انھوں نے کہا : میں وہی کہہ رہا ہوں جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سناہے ۔ ( حضرت عمرو رضی اللہ تعالیٰ عنہ نے ) کہا : اگر تم نے یہ کہا ہے تو ان میں چار خصلتیں ہیں وہ آزمائش کے وقت سب لوگوں سے زیادہ برد بار ہیں اور مصیبت کے بعد سب لوگوں کی نسبت جلد اس سے سنبھلتے ہیں اور پیچھے ہٹنے کے بعد سب لوگوں کی نسبت جلد دوبارہ حملہ کرتے ہیں اور مسکینوں یتیموں اور کمزوروں کے لیے سب لوگوں کی نسبت بہتر ہیں اور پانچویں خصلت بہت اچھی اور خوبصورت ہے وہ سب لوگوں سے بڑھ کر بادشاہوں کے ظلم کو روکنے والے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 7280,
			"arabicnumber": "2898.02",
			"text": "عبد الکریم بن حارث نے ابو شریح کو حدیث بیان کی کہ حضرت مستوردقرشی رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" قیامت آئے گی تورومی ( عیسائی ) لوگوں میں سب سے زیادہ ہوں گے ۔ \" کہا : حضرت عمرو بن عاص رضی اللہ تعالیٰ عنہ کو یہ خبر پہنچی تو انھوں نے ان سے کہا : یہ کیسی احادیث ہیں جو تمھاری طرف سے بیان کی جارہی ہیں ۔ کہ تم ان کو رسول اللہ صلی اللہ علیہ وسلم سے بیان کرتے ہو؟حضرت مستورد قرشی رضی اللہ تعالیٰ عنہ نے کہا : میں نے وہی کچھ کہا جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : ( مستورد رضی اللہ تعالیٰ عنہ نے ) کہا کہ حضرت عمرو رضی اللہ تعالیٰ عنہ نے کہا : اگر تم یہ کہہ رہے ہو ( توسنو! ) یقیناًوہ آزمائش کے وقت سب لوگوں سے بڑھ کر بردبار ہیں مصیبت پیش آنے پر سب لوگوں سے زیادہ سخت جان ہیں اور اپنے مسکینوں اور کمزوروں کے حق میں سب لوگوں کی نسبت بہترہیں ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 7281,
			"arabicnumber": "2899.01",
			"text": "ابو بکر بن ابی شیبہ اور علی بن حجر نے ہمیں حدیث بیان کی ، دونوں نے ابن علیہ سے روایت کی ۔ اور الفاظ ابن حجرکےہیں ۔ کہا : ہمیں اسماعیل بن ابراہیم نے ایوب سے حدیث بیان کی ، انھوں نے حمید بن بلال سے ، انھوں نےابو قتادہ عدوی سے اور انھوں نے یسیر بن جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہا : ایک مرتبہ کوفہ میں سرخ آندھی آئی تو ایک شخص آیا اس کا تکیہ کلام ہی یہ تھا ۔ عبد اللہ بن مسعود !قیامت آگئی ہے ۔ وہ ( عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ ) نیک لگائے ہوئے تھے ( یہ بات سنتے ہی ) اٹھ کر بیٹھ گئے ، پھر کہنے لگے ۔ قیامت نہیں آئے گی ۔ یہاں تک کہ نہ میراث کی تقسیم ہو گی نہ غنیمت حاصل ہونے کی خوشی پھر انھوں نے اس طرح ہاتھ سے اشارہ کیا اور اس کا رخ شام کی طرف کیا اور کہا : دشمن ( غیر مسلم ) اہل اسلام کے خلاف اکٹھے ہو جا ئیں گے اور اہل اسلام ان کے ( مقابلے کے ) لیے اکٹھے ہو جا ئیں گے ۔ میں نے کہا : آپ کی مراد رومیوں ( عیسائیوں ) سے ہے؟انھوں نے کہا : ہاں پھر کہا : تمھاری اس جنگ کے زمانے میں بہت زیادہ پلٹ پلٹ کر حملے ہوں گے ۔ مسلمان موت کی شرط قبول کرنے والے دستے آگے بھیجیں کے کہ وہ غلبہ حاصل کیے بغیر واپس نہیں ہوں گے ( وہیں اپنی جانیں دے دیں گے ۔ ) پھر وہ سب جنگ کریں گے ۔ حتیٰ کہ رات درمیان میں حائل ہو جائے گی ۔ یہ لو گ بھی واپس ہوجائیں گے اور وہ بھی ۔ دونوں ( میں سےکسی ) کوغلبہ حاصل نہیں ہو گا ۔ اور ( موت کی ) شرط پرجانے والے سب ختم ہو جا ئیں گے ۔ پھر مسلمان موت کی شرط پر ( جانے والے دوسرے ) دستےکو آکے کریں گے کہ وہ غالب آئے بغیر واپس نہیں آئیں گےپھر ( دونوں فریق ) جنگ کریں گے ۔ یہاں تک کہ ان کے درمیان رات حائل ہو جائے گی ۔ یہ بھی واپس ہو جا ئیں اور وہ بھی کوئی بھی غالب نہیں ( آیا ) ہو گااورموت کی شرط پر جانے والے ختم ہوجائیں گے ۔ پھر مسلمان موت کے طلبگاروں کادستہ آگے کریں گے ۔ اور شام تک جنگ کریں گے ، پھر یہ بھی واپس ہو جا ئیں گے اور وہ بھی کوئی بھی غالب نہیں ( آیا ) ہو گا اور موت کے طلبگار ختم ہو جا ئیں گے ۔ جب چوتھا دن ہو گا تو باقی تمام اہل اسلام ان کے خلاف انھیں کے ، اللہ تعالیٰ ( جنگ کے ) چکرکوان ( کافروں ) کے خلاف کردے گا ۔ وہ سخت خونریزجنگ کریں گے ۔ انھوں نے یا تویہ الفاظ کہے ۔ اس کی مثال نہیں دیکھی جائے گی ۔ یہاں تک کہ پرندہ ان کے پہلوؤں سے گزرے گاوہ ان سے جونہی گزرےگامرکز جائے گا ۔ ( ہوابھی اتنی زہریلی ہو جا ئےگی ۔ ) ایک باپ کی اولاد اپنی گنتی کرے گی ، جو سوتھے ، تو ان میں سے ایک کے سواکوئی نہ بچا ہوگا ۔ ( اب ) وہ کس غنیمت پر خوش ہوں گے ۔ اور کیسا ورثہ ( کن وارثوں میں ) تقسیم کریں گے ۔ وہ اسی حالت میں ہوں گے کہ ایک ( نئی ) مصیبت کے بارے میں سنیں گے ۔ جو اس سے بھی بڑی ہوگی ۔ ان تک یہ زوردار پکار پہنچےگی ۔ کہ دجال ان کے پیچھے ان کے بال بچوں تک پہنچ گیا ہے ۔ ان کے ہاتھوں میں جو ہوگا ۔ سب کچھ پھینک دیں گے اور تیزی سے آئیں گے اور دس جاسوس شہسوار آگے بھیجیں گے ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میں ان کے اور ان کے آباء کے نام اور ان کےگھوڑوں ( سواریوں ) کے رنگ تک پہچانتا ہوں ۔ وہ اسوقت روئے زمین پر بہترین شہسوار ہوں گے ۔ یا ( فرمایا : ) روئے زمین کے بہترین شہسواروں میں سے ہوں گے ۔ \"\" ابن ابی شیبہ نے ا پنی روایت میں ( یسیر کے بجائے ) کہا : اسیر بن جابر سے مروی ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7282,
			"arabicnumber": "2899.02",
			"text": "حماد بن زید نے ایوب سے ، انھوں نے حمید بن ہلال سے ، انھوں نے ابو قتادہ سے اور انھوں نے یسیرین جابر سے روایت کی ، کہا : میں حضرت ابن مسعود رضی اللہ تعالیٰ عنہ کے پاس تھا کہ سرخ آندھی آئی ، پھر اسی کے مطابق حدیث بیان کی ، البتہ ابن علیہ کی روایت مکمل اورسیر حاصل ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7283,
			"arabicnumber": "2899.03",
			"text": "شیبان بن فروخ نے کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی ، کہا : ہمیں حمید بن ہلال نے ابو قتادہ سے حدیث بیان کی ، انھوں نے اسیر بن جابرسے روایت کی ، کہا : ہم حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کے گھر میں تھے جبکہ گھر بھرا ہوا تھا ۔ کہا : اس وقت کوفہ میں سرخ آندھی چلی ، پھر ابن علیہ کی حدیث کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7284,
			"arabicnumber": "2900",
			"text": "عبدالملک بن عمیر نے جابر بن سمرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے حضرت نافع بن عتبہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم ایک جہاد میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے تو آپ صلی اللہ علیہ وسلم کے پاس کچھ لوگ مغرب کی طرف سے آئے جو اون کے کپڑے پہنے ہوئے تھے ۔ وہ رسول اللہ صلی اللہ علیہ وسلم سے ایک ٹیلے کے پاس آ کر ملے ۔ وہ لوگ کھڑے تھے اور آپ صلی اللہ علیہ وسلم بیٹھے ہوئے تھے ۔ میرے دل نے کہا کہ تو چل اور ان لوگوں اور آپ صلی اللہ علیہ وسلم کے درمیان میں جا کر کھڑا ہو ، ایسا نہ ہو کہ یہ لوگ فریب سے آپ صلی اللہ علیہ وسلم کو مار ڈالیں ۔ پھر میرے دل نے کہا کہ شاید آپ صلی اللہ علیہ وسلم چپکے سے کچھ باتیں ان سے کرتے ہوں ( اور میرا جانا آپ صلی اللہ علیہ وسلم کو ناگوار گزرے ) ۔ پھر میں گیا اور ان لوگوں کے اور آپ صلی اللہ علیہ وسلم کے درمیان میں کھڑا ہو گیا ۔ پس میں نے اس وقت آپ صلی اللہ علیہ وسلم سے چار باتیں یاد کیں ، جن کو میں اپنے ہاتھ پر گنتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم پہلے تو عرب کے جزیرہ میں ( کافروں سے ) جہاد کرو گے ، اللہ تعالیٰ اس کو فتح کر دے گا ۔ پھر فارس ( ایران ) سے جہاد کرو گے ، اللہ تعالیٰ اس پر بھی فتح کر دے گا پھر نصاریٰ سے لڑو گے روم والوں سے ، اللہ تعالیٰ روم کو بھی فتح کر دے گا ۔ پھر دجال سے لڑو گے اور اللہ تعالیٰ اس کو بھی فتح کر دے گا ( یہ حدیث آپ صلی اللہ علیہ وسلم کا بڑا معجزہ ہے ) ۔ نافع نے کہا کہ اے جابر بن سمرہ رضی اللہ تعالیٰ عنہ ! ہم سمجھتے ہیں کہ دجال روم فتح ہونے کے بعد ہی نکلے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7285,
			"arabicnumber": "2901.01",
			"text": "سفیان بن عینیہ نے فرات قزازسے ، انھوں نے ابوطفیل رضی اللہ تعالیٰ عنہ سے اور انھوں نےحضرت حذیفہ بن اسید غفاری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے پاس آئے اور ہم باتیں کر رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم کیا باتیں کر رہے ہو؟ ہم نے کہا کہ قیامت کا ذکر کرتے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ قیامت قائم نہ ہو گی جب تک کہ دس نشانیاں اس سے پہلے نہیں دیکھ لو گے ۔ پھر ذکر کیا دھوئیں کا ، دجال کا ، زمین کے جانور کا ، سورج کے مغرب سے نکلنے کا ، عیسیٰ علیہ السلام کے اترنے کا ، یاجوج ماجوج کے نکلنے کا ، تین جگہ خسف کا یعنی زمین کا دھنسنا ایک مشرق میں ، دوسرے مغرب میں ، تیسرے جزیرہ عرب میں ۔ اور ان سب نشانیوں کے بعد ایک آگ پیدا ہو گی جو یمن سے نکلے گی اور لوگوں کو ہانکتی ہوئی ان کے ( میدان ) محشر کی طرف لے جائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7286,
			"arabicnumber": "2901.02",
			"text": "عبیداللہ بن معاذ عنبری نے ہمیں حدیث بیان کی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں شعبہ نےفرات قزاز سے حدیث بیان کی ، انھوں نے ابو طفیل سے ، انھوں نے حضرت ابو سریحہ حذیفہ بن اسید رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی کریم صلی اللہ علیہ وسلم بالا خانے میں تھے اور ہم آپ صلی اللہ علیہ وسلم سے نیچے کی طرف بیٹھے ہوئے تھے ، آپ صلی اللہ علیہ وسلم نے ہماری طرف جھانک کر دیکھا اور فرمایا : \"\" تم کس بات کا ذکر کررہے ہو؟ \"\" ہم نے عرض کی قیامت کا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" جب تک دس نشانیاں ظاہر نہیں ہوں گی ، قیامت نہیں آئے گی : مشرق میں زمین کا دھنسنا ، مغرب میں زمین کا دھنسنا اور جزیرہ عرب میں زمین کا دھنسنا ، دھواں ، دجال ، زمین کا چوپایہ ، یاجوج ماجوج ، مغرب سے سورج کا طلوع ہونا اورایک آگ جو عدن کے آخری کنارے سے نکلے گی اور لوگوں کو ہانکے گی ۔ \"\" شعبہ نے کہا : عبدالعزیز بن رفیع نے مجھے بھی ابو طفیل سے اور انھوں نے ابوسریحہ رضی اللہ تعالیٰ عنہ سے اسی کےمانند روایت کی ، نبی کریم صلی اللہ علیہ وسلم کا ذکر نہیں کیا ( موقوف حدیث بیان کی ) اور ( مجھے حدیث سنانے والے فرات اور عبدالعزیز ) دونوں میں سے ایک نے دسویں ( نشانی ) کے بارے میں کہا : عیسیٰ بن مریم علیہ السلام کانزول اور دوسرے نے کہا : ایک ہوا ( آندھی ) ہوگی جو لوگوں کو سمندر میں پھینکے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7287,
			"arabicnumber": "2901.03",
			"text": "محمد بن جعفر نےکہا : ہمیں شعبہ نے فرات سے حدیث بیان کی ، انھوں نے کہا : میں نے ابو طفیل رضی اللہ تعالیٰ عنہ کو حضرت ابو سریحۃ رضی اللہ تعالیٰ عنہ سے حدیث بیان کر تے ہوئے سنا : انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم بالا خانے میں تھے اوراہم اس کے نیچے باتیں کررہے تھے ، اور ( آگے ) اسی کے مانند حدیث بیان کی ۔ شعبہ نے کہا : اور میرا خیال ہے ( کہ فرات نے ) کہا : وہ جب قیام کے لئے رکیں گے تو وہ ( آگ ) بھی ان کے ساتھ رک جائے گی اور جب وہ دوپہر کو آرام کریں گے تو وہ بھی ان کے ساتھ سکون پذیر ہوجائے گی ۔ شعبہ نےکہا : مجھے کسی شخص نے ابو طفیل رضی اللہ تعالیٰ عنہ سے اور انھوں نے حضر ت ابو سریحۃ رضی اللہ تعالیٰ عنہ سے یہی حدیث بیان کی اور اسے مرفوع بیان نہیں کیا ۔ کہا : ان دونوں ( کسی شخص اورفرات قزاز ) میں سے ایک نے کہا : \"\" عیسیٰ بن مریم علیہ السلام کا نزول \"\" اور ددسرے نے کہا : \"\" ہواجو انھیں سمندر میں لاڈالے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7288,
			"arabicnumber": "2901.04",
			"text": "محمد بن مثنیٰ نے بھی ہمیں یہی ( حدیث ) بیان کی ، کہا : ابو نعمان حکم بن عبداللہ عجلی نے ہمیں حدیث بیان کی ، کہا : شعبہ نے ہمیں فرات سے حدیث بیان کی ، انھوں نے کہا : میں نے ابو طفیل رضی اللہ تعالیٰ عنہ سے سنا ، وہ حضرت ابوسریحہ رضی اللہ تعالیٰ عنہ سے روایت کررہے تھے ، کہا : ہم باتیں کررہے تھے تو رسول اللہ صلی اللہ علیہ وسلم نے اوپر سے جھانک کرہمیں دیکھا ، ( اس کے بعد ) معاذ اور ابن جعفر کی حدیث ہے ۔ ابن مثنیٰ نے کہا : ہمیں ابو نعمان حکیم بن عبداللہ نے حدیث بیان کی ، کہا : ہمیں شعبہ نے عبدالعزیز بن رفیع سے حدیث بیان کی ، انھوں نے ابو طفیل رضی اللہ تعالیٰ عنہ سے ، انھوں نے حضرت ابو سریحہ رضی اللہ تعالیٰ عنہ سے اسی طرح روایت کی ، کہا : دسویں ( علامت ) حضرت عیسیٰ بن مریم علیہ السلام کا نزول ہے ۔ شعبہ نے کہا : عبدالعزیز نےاسے مر فوع بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7289,
			"arabicnumber": "2902",
			"text": "یونس اور عقیل بن خالد نے ابن شہاب سے روایت کی ، انھوں نے کہا : ابن مسیب نے کہا : مجھے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" قیامت اس وقت تک قائم نہ ہوگی یہاں تک کہ ارض حجاز سے ایک آگ نکلے گی جو ( شام کے شہر ) بصری میں اونٹوں کی گردنوں کو روشن کردے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7290,
			"arabicnumber": "2903",
			"text": "اسود بن عامر نے ہمیں حدیث بیان کی ، کہا : ہمیں زہیر نے سہیل بن ابی صالح سے حدیث سنائی ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" ( مدینہ منورہ کے ) گھر اباب یایہاب ( کے مقام تک ) پہنچ جائیں گے ۔ \"\" زبیر نے کہا : میں نے سہیل سے پوچھا : یہ جگہ مدینہ سے کتنے فاصلے پر ہے؟انھوں نے کہا : اتنے اتنے میل ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7291,
			"arabicnumber": "2904",
			"text": "حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قحط یہ نہیں ہے کہ تم پر بارش نہ ہو بلکہ قحط یہ ہے کہ بارش ہو ، پھر بارش ہو لیکن زمین کوئی چیز نہ اُگائے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7292,
			"arabicnumber": "2905.01",
			"text": "لیث نے ہمیں نافع سے خبر دی ، انھوں نے حضرت عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سناجبکہ آپ مشرق کارخ کیے ہوئے فرمارہے تھے : \" سنو! فتنہ یہاں ہوکا ، سنو!یہاں ہوکا جہاں سے شیطان کا سینگ نمودار ہوتاہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7293,
			"arabicnumber": "2905.02",
			"text": "عبیداللہ بن عمر قواریری ، محمد بن مثنیٰ اور عبیداللہ بن سعید نے ہمیں حدیث بیان کی ، ان سب نے یحییٰ ( بن سعید ) قطان سے روایت کی ، قواریری نے کہا : مجھے یحییٰ بن سعید نے عبیداللہ بن عمر سے حدیث بیان کی ، انھوں نے کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم حضرت حفصہ رضی اللہ تعالیٰ عنہا کے دروازے کے پاس کھڑے ہاتھ سے مشرق کی طرف اشارہ کرتے ہوئے فرمارہے تھے : \"\" فتنہ اس سمت میں ہوگا جہاں سے شیطان کا سینگ نمودار ہوتا ہے ۔ \"\" یہ بات آپ نے دو یاتین بار ارشاد فرمائی ۔ عبیداللہ بن سعید نے اپنی روایت میں کہا : رسول اللہ صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ تعالیٰ عنہا کے دروازے کے پاس کھڑے تھے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7294,
			"arabicnumber": "2905.03",
			"text": "ابن شہاب نے سالم بن عبداللہ سے اور انھوں نے اپنے والد سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جبکہ آپ نے مشرق کی طرف ر خ کیا ہوا تھا : \" یاد رکھو! فتنہ یہاں ہے ، یاد رکھو! فتنہ یہا ہے ، یاد رکھو! فتنہ یہاں ہے جہاں سے شیطان کا سینگ نمودار ہوتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7295,
			"arabicnumber": "2905.04",
			"text": "عکرمہ بن عمار نے سالم سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم حضرت عائشہ رضی اللہ تعالیٰ عنہا کے گھر سے باہر تشریف لائے اور فرمایا : \" کفر کاسر ادھر سے ظاہر ہوگا جہاں سے شیطان کا سینگ نمودار ہوتاہے ۔ \" آپ کی مراد مشرق ( کی سمت ) سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7296,
			"arabicnumber": "2905.05",
			"text": "حنظلہ نے کہا : میں نے سالم سے سنا ، وہ کہتے ہیں : میں نے حضر ت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہتے ہیں : میں نے رسول اللہ صلی اللہ علیہ وسلم کو مشرق کی طرف ہاتھ سے اشارہ کرکے فرماتے ہوئے سنا : \" یاد رکھو!فتنہ اس طرف سے ہے ۔ \" یاد رکھو!فتنہ اسی طرف سے ہے ۔ تین بار ( فرمایا ) \" جہاں سے شیطان کا سینگ طلو ع ہوتا ہے ۔ \" آپ کی مراد مشرق ( کی سمت ) سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7297,
			"arabicnumber": "2905.06",
			"text": "عبداللہ بن عمر بن ابان ، واصل بن عبدالاعلیٰ اور احمد بن عمر وکیعی نے ہمیں حدیث بیان کی ، الفاظ ابن ابان کے ہیں ۔ انھوں نے کہا : ہمیں ابن فضیل نے اپنے والد سے حدیث بیان کی ، انھوں نے کہا : میں نے سالم بن عبداللہ بن عمرسے سنا ، کہہ رہے تھے : \" اے عراق والو! میں تم سے چھوٹے گناہ نہیں پوچھتا نہ اس کو پوچھتا ہوں جو کبیرہ گناہ کرتا ہو میں نے اپنے والد سیدنا عبداللہ بن عمر رضی اللہ عنہما سے سنا ، وہ کہتے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ صلی اللہ علیہ وسلم فرماتے تھے کہ فتنہ ادھر سے آئے گا اور آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے مشرق کی طرف اشارہ کیا ، جہاں شیطان کے دونوں سینگ نکلتے ہیں ۔ اور تم ایک دوسرے کی گردن مارتے ہو ( حالانکہ مومن کی گردن مارنا کتنا بڑا گناہ ہے ) اور موسیٰ علیہ السلام فرعون کی قوم کا ایک شخص غلطی سے مار بیٹھے تھے ( نہ بہ نیت قتل کیونکہ گھونسے سے آدمی نہیں مرتا ) ، تو اس پر اللہ تعالیٰ نے فرمایا کہ ”تو نے ایک خون کیا ، پھر ہم نے تجھے غم سے نجات دی اور تجھ کو آزمایا جیسا آزمایا تھا“ ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7298,
			"arabicnumber": "2906",
			"text": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے ، کیا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" قیامت نہیں آئے گی یہاں تک کہ دوس کی عورتوں کے سرین ، ذوالخلصہ کے ارد گرد ( دوران طواف ) منکیں گے ۔ \"\" وہ ( ذوالخلصہ ) تبالہ میں ایک بت تھا ، جاہلی دور میں قبیلہ دوس اس کی پوجا کیاکرتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7299,
			"arabicnumber": "2907.01",
			"text": "خالد بن حارث نے ہمیں حدیث بیان کی ، کہا : ہمیں عبدالحمید بن جعفر نے اسود بن علاء سے حدیث بیان کی ، انھوں نے ابو سلمہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم نے فرمایا کہ رات اور دن اس وقت تک ختم نہ ہوں گے جب تک لات اور عزیٰ ( جاہلیت کے بت ) پھر نہ پوجے جائیں گے ۔ میں نے عرض کیا کہ یا رسول اللہ! میں تو سمجھتی تھی کہ جب اللہ تعالیٰ نے یہ آیت اتاری ”اللہ وہ ہے جس نے اپنے رسول صلی اللہ علیہ وسلم کو ہدایت اور سچا دین دے کر بھیجا تاکہ اس کو سب دینوں پر غالب کرے اگرچہ مشرک لوگ برا مانیں“کہ یہ وعدہ پورا ہونے والا ہے ( اور اسلام کے سوا اور کوئی دین غالب نہ رہے گا ) ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب تک اللہ تعالیٰ کو منظور ہو گا ، ایسا ہی ہو گا ۔ پھر اللہ تعالیٰ ایک پاکیزہ ہوا بھیجے گا کہ جس سے ہر مومن مر جائے گا ، یہاں تک کہ ہر وہ شخص بھی جس کے دل میں دانے کے برابر بھی ایمان ہے اور وہ لوگ باقی رہ جائیں گے جن میں بھلائی نہیں ہو گی ۔ پھر وہ لوگ اپنے ( مشرک ) باپ دادا کے دین پر لوٹ جائیں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7300,
			"arabicnumber": "2907.02",
			"text": "ابو بکر حنفی نے کہا : ہمیں عبدالحمید بن جعفر نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7303,
			"arabicnumber": "2908.01",
			"text": "ابن ابی عمر مکی نے ہمیں یہ حدیث بیان کی ، کہا : ہمیں مروان نے یزید سے ۔ اور وہ ابن کیسان ہے ۔ حدیث بیان کی ، انھوں نے ابو حازم سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے!لوگوں پر ایک ایسا زمانے آئے گا کہ قاتل کو پتہ نہیں ہوگا کہ اس نے کیوں قتل کیا اور نہ مقتول کو پتہ ہوگا کہ اسے کس بات پر قتل کیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7304,
			"arabicnumber": "2908.02",
			"text": "عبداللہ بن عمر بن ابان اور واصل بن عبدالاعلیٰ نے ہمیں حدیث بیان کی ، دونوں نے کہا : ہمیں محمد بن فضیل نے ابو اسماعیل اسلمی سے حدیث بیان کی ، انھوں نے ابو حازم سے اور انھوں نے حضرت ابوہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس ذات کی قسم جس کے ہاتھ میں میری جان ہے!دنیا ختم نہیں ہوگی یہاں تک کہ لوگوں پر ایسا دن آجائے جس میں قاتل کو یہ معلوم نہ ہو کہ اس نے کیوں قتل کیا اور مقتول کو یہ پتہ نہ ہو کہ اسے کیوں قتل کیا گیا ۔ \"\" عرض کی گئی یہ کیسے ہوگا؟آپ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" اندھا دھند خونریزی ہوگی ، قاتل اور مقتول دونوں ( جہنم کی ) آگ میں جائیں گے ۔ \"\" ابن ابان کی روایت میں ( اس طرح ) ہے : کہا : وہ یزید بن کیسان ہے ( جس کے بارے میں کہا گیا ہے ) ابو اسماعیل سے روایت ہے ( اس کا پورا نام ابو اسماعیل یزید بن کیسان ہے ) انھوں نے ( اس کی نسبت ) \"\" اسلمی \"\" کا ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7305,
			"arabicnumber": "2909.01",
			"text": "زیاد بن سعد نے زہری سے اور انھوں نے سعید ( بن مسیب ) سے روایت کی ، انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا کہ نبی کریم صلی اللہ علیہ وسلم سے روایت ہے : \" کعبہ وحبشہ سے ( تعلق رکھنے والا ) وہ چھوٹی چھوٹی پنڈلیوں والا شخص گرائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7306,
			"arabicnumber": "2909.02",
			"text": "یونس نے ابن شہاب سے انھوں نے ابن مسیب سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وہ چھوٹی چھوٹی پنڈلیوں والا حبشی کعبہ کو گرائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7307,
			"arabicnumber": "2909.03",
			"text": "قتیبہ بن سعید نے ہمیں عبد العزیزدراوری سے روایت کی ، انھوں نے ثور بن زید سے انھوں نے ابو الغیث سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" حبشہ کا دو چھوٹی چھوٹی پنڈلیوں والا شخص اللہ عزوجل کے گھر کو گرائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7308,
			"arabicnumber": "2910",
			"text": "قتیبہ بن سعید نے اسی سند سے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہو گی یہاں تک کہ قحطان کا ایک شخص لوگوں کو اپنی لاٹھی سے ہانکے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7309,
			"arabicnumber": "2911",
			"text": "عبد الکبیر بن عبد الجبار ابو بکرحنفی نے ہمیں حدیث بیان کی ، کہا : ہمیں عبد الحمید بن جعفر نے حدیث بیان کی ، کہا : میں نے عمر بن حکم کو حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے ہوئے سنا ، انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" دن اور رات کا سلسلہ منقطع نہیں ہوگا ۔ یہاں تک کہ ایک شخص بادشاہ بنے گا ۔ جسے جہجاہ کہا جائے گا ۔ \" امام مسلم رحمۃ اللہ علیہ نے ( عبدالکبیر کے حوالےسے ) کہا : یہ چاربھائی ہیں ۔ شریک عبید اللہ عمیراور عبدالکبیریہ عبدالمجید کے بیٹےہیں ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7310,
			"arabicnumber": "2912.01",
			"text": "سفیان نے زہری سے ، انھوں نے سعید ( بن مسیب ) سے اور انھوں نےحضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہو گی یہاں تک کہ تم ایک ایسی قوم سے جنگ کروگے ۔ جن کے چہرے کوٹی ہوئی ڈھالوں کی طرح ہو ں گے ۔ اور قیامت قائم نہیں ہوگی ۔ یہاں تک کہ تم ایسی قوم سے جنگ کروگے جن کے جوتے بالوں ( اون ) کے ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7311,
			"arabicnumber": "2912.02",
			"text": "یونس نے ابن شہاب سے روایت کی ، انھوں نے کہا : مجھے سعید بن مسیب نے بتایا کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہوگی ۔ یہاں تک کہ تم ایک ایسی امت سے جنگ کروگے جو بالوں کے جوتے پہنتے ہوں گے اور ان کے چہرے کوٹی ہوئی ڈھالوں کی طرح ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7312,
			"arabicnumber": "2912.03",
			"text": "اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے اس ( کی سند ) کونبی صلی اللہ علیہ وسلم تک پہنچایا آپ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہوگی ۔ یہاں تک کہ تم اس قوم سے جنگ کروگے جن کے جوتے بالوں کے ہوں گے اور قیامت قائم نہیں ہو گی یہاں تک کہ تم چھوٹی آنکھوں اور چھوٹی ناک والی قوم سے جنگ کرو گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7313,
			"arabicnumber": "2912.04",
			"text": "سہیل کے والد ( ابو صالح ) نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت قائم نہیں ہوگی ۔ یہاں تک کہ مسلمان ترکوں سے جنگ کریں گے یہ ایسی قوم ہے جن کے چہرے کوٹی ہوئی ڈھالوں کی طرح ہوں گے ۔ یہ لوگ بالوں کا لباس پہنتے ہوں گے ۔ بالوں ( کےجوتوں ) میں چلتے ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7314,
			"arabicnumber": "2912.05",
			"text": "قیس بن ابی حازم نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت سےپہلے تم ایسی قوم سے جنگ کروگے ۔ جن کے جوتے بالوں کے ہوں گے ۔ ان کے چہرے کوٹی ہوئی ڈھالوں کی طرح ہوں گےوہ سرخ چہروں اور چھوٹی آنکھوں والے ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7315,
			"arabicnumber": "2913.01",
			"text": "اسماعیل بن ابراہیم نے ہمیں جریری سے حدیث بیان کی اور انھوں نے ابو نضرہ ہے روایت کی کہا : ہم حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ کے پاس تھے کہ انھوں نے کہا : وہ وقت قریب ہے کہ اہل عراق کے پاس کوئی قفیر ( پیمانہ ) آئے گانہ درہم ۔ ہم نے پوچھا کہاں سے؟انھوں نےکہا : عجم سے ۔ وہ اس کو روک لیں گے ۔ پھر کہا : عنقریب اہل شام کے پاس کوئی دینار آئے گا نہ مدی ( پیمانہ ) ہم نے پوچھا : کہاں سے؟انھوں نےکہا : روم کی جانب سے پھر تھوڑی دیر خاموش رہنے کے بعد کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میری امت کے آخر ( کے دور ) میں ایک خلیفہ ہو گا جولپیں بھر بھرکے مال دے گا اور اس کی گنتی نہیں کرے گا ۔ \" ( جریری نے ) کہا : میں نے ابو نضرہ اور ابو العلاءسے پوچھا : کیا آپ سمجھتے ہیں کہ یہ عمر بن عبدالعزیزہیں؟تو دونوں نے کہا : نہیں ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 7316,
			"arabicnumber": "2913.02",
			"text": "عبد الوہاب نے کہا : ہمیں سعید جریرینے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7317,
			"arabicnumber": "2914.01",
			"text": "نصر بن علی جہضمی نے ہمیں حدیث بیان کی کہا : ہمیں بشر بن مفضل نے حدیث بیان کی نیز ہمیں علی بن حجر سعدی نے حدیث بیان کی ، کہا : ہمیں اسماعیل بن علیہ نے حدیث بیان کی دونوں ( بشربن مفضل اور ابن علیہ ) نے سعید بن یز ید سے انھوں نے ابو نضرہ سے اور انھوں نے حضرت ابوسعید ( خدری رضی اللہ تعالیٰ عنہ ) سےروایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تمھارے خلفاءمیں سے ایک خلیفہ ہو گا جولپیں بھر بھرکر مال دے گا اور اس کو شمارنہیں کرےگا ۔ اور ( علی ) بن حجرکی روایت میں يَحْثُو الْمَالَ کے بجائےيحثي المال ہے ( معنی ایک ہی ہے ) ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7318,
			"arabicnumber": "2914",
			"text": "عبد الصمد بن عبد الوارث نے ہمیں حدیث بیان کی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں داؤد نے ابو نضرہ سے حدیث بیان کی ، انھوں نے حضرت ابوسعید اور حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، دونوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" آخری زمانے میں ایک خلیفہ ہو گا جو مال تقسیم کرے گااور اس کو شمار نہیں کرے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7320,
			"arabicnumber": "2915.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے ابو مسلمہ سے حدیث بیان کی ، انھوں نے کہا : میں نے ابو نضرہ سے سنا ، وہ حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے روایت کر رہے تھے انھوں نے کہا : ایک ایسے شخص نے مجھے بتایا جو مجھ سے بہتر ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جب آپ نے خندق کھودنے کا آغاز کیاتو عمار رضی اللہ تعالیٰ عنہ سے ایک بات ارشاد فرمائی ، آپ ان کے سر پر ہاتھ پھیرنے اور فرمانے لگے ۔ سمیہ کے بیٹے کی مصیبت !تمھیں ایک باغی گروہ قتل کرے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7321,
			"arabicnumber": "2915.02",
			"text": "اور خالد بن حارث اور نضر بن شمیل دونوں نے شعبہ سے روایت کی ، انھوں نے ابو مسلمہ سے اسی سند کے ساتھ اسی طرح روایت کی ، البتہ نضر کی حدیث میں ہے ۔ مجھے مجھ بہتر شخص ابو قتادہ رضی اللہ تعالیٰ عنہ نے خبردی ۔ اور خالد بن حارث کی حدیث میں ہے کہ انھوں نے کہا : میراخیال ہے ان کی مراد ابو قتادہ رضی اللہ تعالیٰ عنہ سے تھی ۔ اور خالد کی حدیث میں ہے کہ آپ صلی اللہ علیہ وسلم فرمانے لگے ۔ \" افسوس! \" یا فرمایا \" وائےافسوس ابن سمیہ پر",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7322,
			"arabicnumber": "2916.01",
			"text": "محمد بن جعفر غندرنے کہا : ہمیں شعبہ نے حدیث بیان کی ، کہا : میں نے خالد حذا کو سعید بن ابو الحسن سے حدیث روایت کرتے ہوئے سنا ، انھوں نے اپنی والدہ سے اور انھوں نے حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے حضرت عمار رضی اللہ تعالیٰ عنہ سے فرمایا : \" تمھیں ایک باغی گروہ قتل کرے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7323,
			"arabicnumber": "2916.02",
			"text": "عبد الصمد بن الوارث نے کہا : ہمیں شعبہ نے حدیث بیان کی کہا : ہمیں خالد حذاء نے سعید بن ابی حسن اور حسن سے حدیث بیان کی ان دونوں نے اپنی والدہ سے ، انھوں نے حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7324,
			"arabicnumber": "2916.03",
			"text": "ابن عون نے حسن سے انھوں نے اپنی والدہ سے اور انھوں نے حضرت ام سلمہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" عمار کو ایک باغی گروہ قتل کرے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7326,
			"arabicnumber": "2917",
			"text": "ابو داؤدنے کہا : ہمیں شعبہ نے اسی سند کے ساتھ اسی کے ہم معنی روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7327,
			"arabicnumber": "2918.01",
			"text": "سفیان نے زہری سے ، انھوں نے سعید بن مسیب سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کسریٰ مرگیا تو اس نے بعد کوئی کسری نہیں ہوگا اور جب قیصر مرجائے گا تو اس کے بعد ( شام میں ) کوئی قیصہ نہیں ہوکا ، اس ذات کی قسم جس کے ہاتھ میں میری جان ہے !ان دونوں کے خزانوں کو اللہ کی راہ میں خرچ کیا جائےگا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7328,
			"arabicnumber": "2918.02",
			"text": "یونس اور معمر دونوں نے زہری سے سفیان کی سند کے ساتھ اسی کی حدیث کے ہم معنی روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7344,
			"arabicnumber": "2924.01",
			"text": "جریر نےاعمش سے ، انھوں نے ابو وائل سے اور انھوں نے حضرت عبداللہ ( ابن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ہم چند لڑکوں کے پاس سے گزرے ، ان میں ابن صیاد بھی تھا ، سب بچے بھاگ گئے اور ابن صیاد بیٹھ گیا ، تو ایسا لگا کہ رسول اللہ صلی اللہ علیہ وسلم نے اس بات کو ناپسند کیا ہے ، نبی کریم صلی اللہ علیہ وسلم نے اس سے فرمایا : \" تیرے ہاتھ خاک آلودہوں!کیا تو گواہی دیتا ہے کہ میں اللہ کا رسول ہوں؟ \" اس نے کہا : نہیں ۔ بلکہ کیا آپ گواہی دیتے ہیں کہ میں اللہ کا رسول ہوں؟ \" حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !مجھے اجازت دیجئے کہ میں اس کو قتل کردوں ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر یہ وہی ہے جو تمہارا گمان ہے تو تم اس کو قتل نہیں کرسکوگے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 7345,
			"arabicnumber": "2924.02",
			"text": "ابو معاویہ نے ہمیں خبر دی ، کہا : ہمیں اعمش نے شقیق سے حدیث بیان کی ۔ انھوں نے حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : ہم نبی کریم صلی اللہ علیہ وسلم کے ساتھ چل رہے تھے کہ ہم ابن صیاد کے پاس سے گزرے ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : \" میں تمہارے لیے ( دل میں ) ایک بات چھپائی ہے ۔ \" وہ دُخَ ہے ۔ آ پ صلی اللہ علیہ وسلم نےفرمایا : \" دور دفع ہوجا!تو اپنی حیثیت سے کبھی نہیں بڑھ سکےگا ۔ \" حضرت عمر رضی اللہ تعالیٰ عنہ نےکہا : اللہ کے رسول صلی اللہ علیہ وسلم !مجھے اجازت دیں تو میں اس کی گردن مار دوں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اسے چھوڑ دو ، اگر یہ وہی ہے جس کا تمھیں خوف ہے تو تم اس کو قتل نہیں کرسکوگے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 7346,
			"arabicnumber": "2925",
			"text": "حریری نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : مدینہ کے ایک راستے میں رسول اللہ صلی اللہ علیہ وسلم حضرت ابو بکر رضی اللہ تعالیٰ عنہ اور حضرت عمر رضی اللہ تعالیٰ عنہ کی اس ( ابن صیاد ) سے ملاقات ہوئی ، رسول اللہ صلی اللہ علیہ وسلم نے اس سے فرمایا : \" کیا تو یہ گواہی دیتا ہے کہ میں اللہ کا رسول ہوں؟ \" اس نے کہا : کیا آپ گواہی دیتے ہیں کہ میں اللہ کا رسول ہوں؟رسول اللہ صلی اللہ علیہ وسلم نے فر مایا؛ \" میں اللہ پر ، اس کےفرشتوں پر اور اس کی کتابوں پر ایمان لایا ہوں ، تجھے کیا نظر آتا ہے؟ \" اس نے کہا : مجھے پانی پر ایک تخت نظر آتا ہے تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم سمندر پر ابلیس کا تخت دیکھ رہے ہو ، تجھے اور کیا نظر آتا ہے؟ \" اس نے کہا : میں دو سچوں اور ایک جھوٹے کویا دو جھوٹوں اور ایک سچے کو د یکھتا ہوں ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ( اس کا معاملہ خود ) اس کے سامنے گڈ مڈ کردیاگیا ہے ۔ اسے چھوڑ د و ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 7347,
			"arabicnumber": "2926",
			"text": "معتمر کے والد ( سلیمان ) نے کہا : ہمیں ابو نضرہ نے حضر ت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، کہا کہ اللہ کے نبی کریم صلی اللہ علیہ وسلم کی ابن صائد سے ملاقات ہوئی اورآپ صلی اللہ علیہ وسلم کے ساتھ ابو بکر رضی اللہ تعالیٰ عنہ اور حضرت عمر رضی اللہ تعالیٰ عنہ تھے اور ابن صائد ( دوسرے ) لڑکوں کے ساتھ تھا ، پھر جریری کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 7348,
			"arabicnumber": "2927.01",
			"text": "داود نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : مکہ کی طرف جاتے ہوئے ( راستے میں ) میرا اور ابن صیاد کاساتھ ہوگیا ۔ اس نے مجھ سے کہا : میں کچھ ایسے لوگوں سے ملا ہوں جو سمجھتے ہیں کہ میں دجال ہوں ، کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے نہیں سناتھا : \" اس کے بچے نہیں ہوں گے \" ؟کہا : میں نے کہا : کیوں نہیں ! ( سناتھا ۔ ) اس نے کہا : میرے بچے ہوئے ہیں ۔ کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو کہتے ہوئے نہیں سنا تھا : \" وہ ( دجال ) مدینہ میں داخل ہوگا اور نہ مکہ میں \" ؟میں نے کہا : کیوں نہیں!اس نے کہا : میں مدینہ کے اندر پیدا ہوا ۔ اور اب مکہ کی طرف جارہا ہوں ۔ انھوں نے کہا : پھر اپنی بات کے آخر میں اس نے مجھ سے کہا : دیکھیں !اللہ کی قسم!میں اس ( دجال ) کی جائے پیدائش ، اس کے رہنے کی جگہ اور وہ کہاں ہے سب جانتا ہوں ۔ ( اس طرح ) اس نے ( اپنی حیثیت کے بارے میں ) مجھے الجھا دیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 7349,
			"arabicnumber": "2927.02",
			"text": "معتمر کے والد ( سلیمان ) ابونضرہ سے اور وہ حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے ہیں ، کہا : مجھ سے ابن صائد نے ایک بات کہی تو مجھے اس کے سامنے شرمندگی محسوس ہوئی ۔ ( اس نے کہا : ) اس بات پر میں اور لوگوں کو معذور سمجھتا ہوں ، مکر اے اصحاب محمد! آپ لوگوں کا میرے ساتھ کیامعاملہ ہے\t؟ \"\" کیا اللہ کے نبی کریم صلی اللہ علیہ وسلم نے یہ نہیں فرمایا تھا : \"\" دجال یہودی ہوگا ۔ \"\" اور میں مسلمان ہوچکا ہوں ۔ کہا : \"\" وہ لاولد ہوگا ۔ \"\" جبکہ میری اولاد ہوئی ہے اورآپ صلی اللہ علیہ وسلم نے فرمایا تھا : \"\" اللہ نے مکہ ( میں داخلہ ) اس پر حرام کردیا ہے ۔ \"\" اور میں حج کرچکا ہوں ۔ ( حضرت ابو سعید رضی اللہ تعالیٰ عنہ نے ) کہا : وہ ( ابن صائد ) مسلسل ایسی باتیں کرتا رہا جن سے امکان تھا کہ اس کی بات میرے دل میں بیٹھ جاتی ، کہا : پھر وہ کہنے لگا : اللہ کی قسم! اس وقت میں یہ بات جانتا ہوں کہ وہ کہاں ہے میں اس کے ماں باپ کو بھی جانتا ہوں ۔ کہااس سے پوچھا گیا کہ کیا تمھیں یہ بات ا چھی لگےگی کہ تمھی وہ ( دجال ) آدمی ہو؟اس نے کہا ، اگر مجھ کو اس کی پیش کش کی جائے تو میں اسے ناپسند نہیں کروں گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 7350,
			"arabicnumber": "2927.03",
			"text": "جریری نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : کہ ہم حج یا عمرہ کو نکلے اور ہمارے ساتھ ابن صائد بھی تھا ۔ ایک منزل میں ہم اترے ، لوگ ادھر ادھر چلے گئے اور میں اور ابن صائد دونوں رہ گئے ۔ مجھے اس وجہ سے اس سے سخت وحشت ہوئی کہ لوگ اس کے بارے میں جو کہا کرتے تھے ( کہ دجال ہے ) ابن صائد اپنا اسباب لے کر آیا اور میرے اسباب کے ساتھ رکھ دیا ( مجھے اور زیادہ وحشت ہوئی ) میں نے کہا کہ گرمی بہت ہے اگر تو اپنا اسباب اس درخت کے نیچے رکھے تو بہتر ہے ۔ اس نے ایسا ہی کیا ۔ پھر ہمیں بکریاں دکھلائی دیں ۔ ابن صائد گیا اور دودھ لے کر آیا اور کہنے لگا کہ ابوسعید! دودھ پی ۔ میں نے کہا کہ گرمی بہت ہے اور دودھ گرم ہے اور دودھ نہ پینے کی اس کے سوا کوئی وجہ نہ تھی کہ مجھے اس کے ہاتھ سے پینا برا معلوم ہوا ۔ ابن صائد نے کہا کہ اے ابوسعید! میں نے قصد کیا ہے کہ ایک رسی لوں اور درخت میں لٹکا کر اپنے آپ کو پھانسی دے لوں ان باتوں کی وجہ سے جو لوگ میرے حق میں کہتے ہیں ۔ اے ابوسعید! رسول اللہ صلی اللہ علیہ وسلم کی حدیث اتنی کس سے پوشیدہ ہے جتنی تم انصار کے لوگوں سے پوشیدہ ہے ۔ کیا تم سب لوگوں سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی حدیث کو نہیں جانتے؟ کیا آپ صلی اللہ علیہ وسلم نے نہیں فرمایا کہ دجال کافر ہو گا اور میں تو مسلمان ہوں ۔ آپ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ دجال لاولد ہو گا اور میری اولاد مدینہ میں موجود ہے ۔ کیا آپ صلی اللہ علیہ وسلم نے یہ نہیں فرمایا کہ دجال مدینہ میں اور مکہ میں نہ جائے گا اور میں مدینہ سے آ رہا ہوں اور مکہ کو جا رہا ہوں؟ سیدنا ابوسعید رضی اللہ عنہ نے کہا کہ ( اس کی ایسی باتوں کی وجہ سے ) قریب تھا کہ میں اس کا طرفدار بن جاؤں ( اور لوگوں کا اس کے بارے میں کہنا غلط سمجھوں ) کہ پھر کہنے لگا البتہ اللہ کی قسم! میں دجال کو پہچانتا ہوں اور اس کے پیدائش کا مقام جانتا ہوں اور یہ بھی جانتا ہوں کہ اب وہ کہاں ہے ۔ کہا : میں نے اس سے کہا : باقی سارا دن تیرے لئے تباہی اور ہلاکت ہو! ( تیرا اس سے اتنا قرب کیسے ہوا؟)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 7351,
			"arabicnumber": "2928.01",
			"text": "ابومسلمہ نے ابو نضر ہ سے اور انھوں نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ابن صائد سے فرمایا : \" جنت کی مٹی کیسی ہے؟ \" اس نے کہا : اے ابو القاسم ( صلی اللہ علیہ وسلم ) !باریک سفید ، کستوری ( جیسی ) ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تو نے سچ کہا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 7352,
			"arabicnumber": "2928.02",
			"text": "جریری نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے روایت کی کہ ابن صیاد نے نبی کریم صلی اللہ علیہ وسلم سے جنت کی مٹی کے متعلق سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" باریک سفید ، خالص کستوری ( کی طرح ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 7353,
			"arabicnumber": "2929",
			"text": "محمد بن منکدرسے روایت ہے ، کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ کو دیکھا ، وہ اللہ کی قسم کھاکر کہہ رہے تھے کہ ابن صائد دجال ہے ۔ میں نے کہا : آپ ( اس بات پر ) اللہ کی قسم کھا رہے ہیں؟انھوں نے کہا : میں نے نبی کریم صلی اللہ علیہ وسلم کے پاس حضرت عمر رضی اللہ تعالیٰ عنہ کو اس بات پر قسم کھاتے ہوئے دیکھا تھا اور نبی کریم صلی اللہ علیہ وسلم نے اس پر انکار نہیں فرمایا تھا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 7356,
			"arabicnumber": "169.04",
			"text": "سالم نے کہا : حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : پھر رسول اللہ صلی اللہ علیہ وسلم لوگوں میں ( خطبہ دینے کے لیے ) کھڑے ہوئے اور اللہ تعالیٰ کی ایسی تعریف کی جس کا وہ اہل ہے ، پھر آپ نے دجال کاذکر کیا اور فرمایا : \"\" میں تمھیں اس سےخبردار کررہا ہوں ، اور ہر نبی نے ا پنی قوم کو اس سے خبر دار کیا ہے ، بے شک حضرت نوح علیہ السلام نے بھی اپنی قوم کو اس سے خبر دار کیا ، لیکن میں تمھیں اس کے متعلق ایک ایسی بات بتاتاہوں جو کسی نبی نے اپنی قوم کو نہیں بتائی ، اچھی طرح جان لو کہ وہ کانا ہےاور اللہ تبارک وتعالیٰ کانا نہیں ہے ۔ \"\" ابن شہاب نے کہا : مجھے عمر بن ثابت انصاری نے رسول اللہ صلی اللہ علیہ وسلم کے ایک صحابی سے ( روایت کرتے ہوئے ) خبر دی کہ آپ صلی اللہ علیہ وسلم نے جس روز لوگوں کو دجال کے بارے میں خبر دار کیا توفرمایا : \"\" اس کی دونوں آنکھوں کے درمیان لکھا ہوا ہے : \"\" کافر \"\" ہر وہ آدمی جو اس کے عمل کو ناپسند کرے گا اسے پڑھ لے گا یا ( فرمایا : ) ہر مومن اسے پڑھ لے گا ۔ \"\" اور آ پ صلی اللہ علیہ وسلم نے فرمایا کہ اس بات کو اچھی طرح جان لو کہ تم میں سے کوئی بھی مرنے تک اپنے رب وعزوجل کو ہرگز نہیں دیکھ سکے گا ۔ \"\" ( جبکہ دجال کو سب لوگ دیکھ رہے ہوں گے ۔)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 7357,
			"arabicnumber": "2930.02",
			"text": "صالح نے ابن شہاب سےروایت کی ، انھوں نے کہا : مجھے سالم بن عبداللہ نے بتایا کہ حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم ا پنے صحابہ رضوان اللہ عنھم اجمعین کی جماعت کے ساتھ جس میں حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ بھی تھے ، تشریف لے گئے ، یہاں تک کہ آپ صلی اللہ علیہ وسلم نے ابن صیاد کو دیکھا ۔ وہ اس وقت بلوغت کی عمر کوپہنچنے کے قریب ایک لڑکا تھا ، وہ بنو معاویہ کے مکانوں کے پاس لڑکوں کے ساتھ کھیل رہاتھا ۔ اور عمر بن ثابت کی حدیث کے اختتام تک یونس کی حدیث کے مانند بیان کیا ۔ اور یعقوب سے روایت کردہ حدیث میں کہا : ابی ( ابن کعب رضی اللہ تعالیٰ عنہ ) نے آپ صلی اللہ علیہ وسلم کے فرمان : \" اگر وہ اسے چھوڑ دیتی تو واضح کردیتا ۔ \" کے بارے میں کہا ، اگر اس کی ماں اسے چھوڑ دیتی تو ا پنا معاملہ وہ واضح کردیتا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 7358,
			"arabicnumber": "2930.03",
			"text": "عبد بن حمید اور سلمہ بن ثویب دونوں نے ہمیں عبدالرزاق سے حدیث بیان کی ، ( انھوں نے کہا : ) ہمیں معمر نے زہری سے خبر دی ا ، انھوں نے سالم سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم اپنے صحابہ رضوان اللہ عنھم اجمعین میں سے چند لوگوں کے ساتھ ، جن میں حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ بھی تھے ، ابن صیاد کے قریب سے گزرے ، وہ اس وقت لڑکاتھا اور بنومقالہ کے مکانوں کے قریب لڑکوں کے ساتھ کھیل رہا تھا ۔ ( آگے ) جس طرح یونس اور صالح کی حدیث ہے مگر عبد حمید نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ کی حدیث میں نبی کریم صلی اللہ علیہ وسلم کے حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ کے ساتھ کھجوروں کے باغ میں جانے کا ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 7359,
			"arabicnumber": "2932.01",
			"text": "ایوب نے نافع سے روایت کی کہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے ایک راستے میں ابن صیاد سے ملے ۔ حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے اس سے کوئی ایسی بات کہی جس نے اسے غصہ دلادیا تو وہ اتنا پھول گیا کہ اس نے ( پوری ) گلی کوبھر دیا ، پھر حضرت ابن عمر رضی اللہ تعالیٰ عنہ حضرت حفصہ رضی اللہ تعالیٰ عنہا کے پاس گئے ان کو یہ خبر مل چکی تھی ، انھوں نے ان سے فرمایا ، اللہ تعالیٰ تم پر رحم فرمائے!تم ابن صیاد سے کیاچاہتے تھے؟کیا تمھیں معلوم نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" دجال غصہ آجانے کی وجہ سے ہی ( اپنی حقیقی صورت میں ) برآمد ہوگا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 7360,
			"arabicnumber": "2932.02",
			"text": "ابن عون نے ہمیں نافع سے حدیث بیان کی ، کہا : نافع کہاکرتے تھے کہ ابن صیاد ۔ ( اسکے بارے میں ) حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : ۔ میں اس سے دوبارہ ملاہوں ۔ ایک بار ملا تو میں نے لوگوں سے کہا کہ تم کہتے تھے کہ ابن صیاد دجال ہے؟ ۔ انہوں نے کہا کہ نہیں اللہ کی قسم ۔ میں نے کہا کہ اللہ کی قسم! تم نے مجھے جھوٹا کیا ۔ تم میں سے بعض لوگوں نے مجھ سے بیان کیا کہ وہ نہیں مرے گا ، یہاں تک کہ تم سب میں زیادہ مالدار اور صاحب اولاد ہو گا ، تو وہ آج کے دن ایسا ہی ہے ۔ وہ کہتے ہیں پھر ابن صیاد نے ہم سے باتیں کیں ۔ پھر میں ابن صیاد سے جدا ہوا ۔ کہتے ہیں کہ جب دوبارہ ملا تو اس کی آنکھ پھولی ہوئی تھی ۔ میں نے کہا کہ یہ تیری آنکھ کب سے ایسے ہے جو میں دیکھ رہا ہوں؟ وہ بولا کہ مجھے معلوم نہیں ۔ میں نے کہا کہ آنکھ تیرے سر میں ہے اور تجھے معلوم نہیں؟ وہ بولا کہ اگر اللہ چاہے تو تیری اس لکڑی میں آنکھ پیدا کر دے ۔ پھر ایسی آواز نکالی جیسے گدھا زور سے کرتا ہے ۔ انھوں نے کہا : میرےساتھیوں میں سے ایک سمجھتا ہے کہ میرے پاس جو ڈنڈا تھا میں نے اسے اس کے ساتھ اتنا مارا کہ وہ ڈنڈا ٹوٹ گیا لیکن میں ، واللہ!مجھے کچھ پتہ نہ چلا ۔ نافع نے کہا کہ سیدنا عبداللہ بن عمر ام المؤمنین ( حفصہ رضی اللہ عنہا ) کے پاس گئے اور ان سے یہ حال بیان کیا تو انہوں نے کہا کہ ابن صیاد سے تیرا کیا کام تھا؟ کیا تو نہیں جانتا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ اول چیز جو دجال کو لوگوں پر بھیجے گی ، وہ اس کا غصہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 7361,
			"arabicnumber": "169.05",
			"text": "عبید اللہ نے ہمیں نافع سے حدیث بیان کی ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے لوگوں کے سامنے دجال کا ذکر کیا تو آپ نے فرمایا : \" اللہ تبارک وتعالیٰ کانانہیں ہے سن رکھو!بلاشبہ مسیح دجال داہنی آنکھ سے کاناہے ۔ اس کی آنکھ اس طرح ہے جیسے ابھراہواانگورکادانہ ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 7362,
			"arabicnumber": "169.06",
			"text": "ایوب اور موسیٰ بن عقبہ دونوں نے نافع سے انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 7363,
			"arabicnumber": "2933.01",
			"text": "شعبہ نے ہمیں قتادہ سے حدیث بیان کی انھوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کوئی نبی نہیں ( گزرا مگر اس نے اپنی امت کوکانے کذاب سے ڈرایا ہے ۔ یاد رکھو ، وہ کا نا ہے جبکہ تمھارا عزت اور جلال والا رب کانا نہیں اس ( دجال ) کی دونوں آنکھوں کے درمیان \" ک ف ر \" لکھا ہوا ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 7364,
			"arabicnumber": "2933.02",
			"text": "ہشام نے قتادہ سے روایت کی ، انھوں نے کہا : حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ نبی صلی اللہ علیہ وسلم نے فرمایا : \" دجال کی دونوں آنکھوں کے درمیان ک ف ریعنی کافر لکھا ہوا ہو گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 7365,
			"arabicnumber": "2933.03",
			"text": "شعیب بن جنحاب نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دجال بے نورآنکھ والاہے اور اس کی دونوں آنکھوں کے درمیان لکھا ہوا ہےکافر ۔ \" پھر آپ صلی اللہ علیہ وسلم نے اس کے ہجے کیے ۔ ک ف ر ۔ \" اس کو ہر مسلمان پڑھ لے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 7366,
			"arabicnumber": "2934.01",
			"text": "شقیق نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دجال کی بائیں آنکھ ( بھی ) عیب دار ہوگی اور بال گھنے گچھے دارہوں گے اس کے ہمراہ ایک جنت ہوگی اور ایک دوزخ ہوگی ۔ اس کی دوزخ ( حقیقت میں ) جنت ہو گی اور اس کی جنت اصل میں دوزخ ہو گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 7367,
			"arabicnumber": "2934.02",
			"text": "ابو مالک اشجعی نے ربعی بن حراش سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جوکچھ دجال کے ساتھ ہو گا اسے میں خود اس کی نسبت بھی زیادہ اچھی طرح جانتاہوں ۔ اس کے ساتھ دوچلتے ہوئے دریا ہوں گے ۔ دونوں میں سے ایک بظاہر سفید رنگ کاپانی ہوگا اور دوسرا بظاہربھڑکتی ہوئی آگ ہوگی ۔ اگر کوئی شخص اس کو پالے تو اس دریا کی طرف آئے جسے وہ آگ ( کی طرح ) دیکھ رہا ہے اور اپنی آنکھ بند کرے ۔ پھر اپنا سر جھکا ئے اور اس میں سے پیے تو وہ ٹھنڈا پانی ہو گا ۔ اور دجال بے نور آنکھ والا ہے اس کے اوپر موٹاناخونہ ( گوشت کاٹکڑا جو آنکھ میں پیدا ہوجاتاہے ) ہوگا ۔ اس کی دونوں آنکھوں کے درمیان لکھا ہو گا ۔ : کافر ۔ اسےہر مومن لکھنے ( پڑھنے ) والاہویا نہ لکھنے ( پڑھنے ) والاپڑھ لے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 7369,
			"arabicnumber": "2935.01",
			"text": "حضرت ابو مسعود رضی اللہ تعالیٰ عنہ نے کہا : میں نے بھی یہ حدیث رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 7370,
			"arabicnumber": "2935.02",
			"text": "شعیب بن صفوان نے ہمیں عبد الملک بن عمیرسے انھوں نے ربعی بن حراش سے انھوں نے عقبہ بن عمرو ابو مسعود انصاری رضی اللہ تعالیٰ عنہ سے روایت کی ، ( ربعی نے ) کہا : میں ان ( عقبہ بن عمرو رضی اللہ تعالیٰ عنہ ) کے ہمراہ حضرت حذیفہ بن یمان رضی اللہ تعالیٰ عنہ کے پاس گیا عقبہ رضی اللہ تعالیٰ عنہ نے ان سے کہا : آپ نے دجال کے متعلق رسول اللہ صلی اللہ علیہ وسلم سے جو حدیث سنی ہے وہ مجھے بیان کریے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" دجال نکلے گااس کے ساتھ پانی ہوگا اور آگ ہوگی ۔ جو لوگوں کو پانی نظر آرہا ہو گا ( وہ ) آگ ہوگی ۔ اور جو لوگوں کو نظر آرہی ہو گی ۔ وہ ٹھنڈا میٹھا پانی ہو گا تم میں سے جو شخص اس کو پائے وہ اس میں کودجائے جو اسے آگ نظر آرہی ہو ۔ بلاشبہ وہ میٹھا پاکیزہ پانی ہو گا ۔ حضرت عقبہ رضی اللہ تعالیٰ عنہ نے ۔ حضرت حذیفہ رضی اللہ تعالیٰ عنہ کی تصدیق کرتے ہوئے کہا ۔ اور میں نے ( بھی ) یہ حدیث سنی تھی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 7372,
			"arabicnumber": "2936",
			"text": "ابو سلمہ سے روایت ہے انھوں نے کہا : میں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا : کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا میں تمھیں دجال کے متعلق ایسی بات نہ بتاؤں جو کسی نبی نے اپنی امت کو نہیں بتائی ۔ وہ یقینی طور پر کانا ہو گا ۔ اس کے ساتھ جنت اور جہنم کے مانند ( وہ جگہیں سامنے ) آئیں گی ۔ جس کے بارے میں وہ ہے ۔ کہ جنت ہے وہ ( اصل میں ) جہنم ہوگی ۔ میں نے اسی طرح تمھیں اس سے خبر دار کر دیا ہے ۔ جس طرح حضرت نوح علیہ السلام نے اس کے بارے میں اپنی قوم کو خبردار کیاتھا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 7373,
			"arabicnumber": "2937.01",
			"text": "ابو خیثمہ زہیر بن حراب اور محمد بن مہران رازی نے مجھے حدیث بیان کی ۔ الفاظ رازی کے ہیں ۔ کہا : ہمیں ولید بن مسلم نے حدیث بیان کی ، انھوں نے کہا : ہمیں عبد الرحمٰن بن یزید بن جابر نے یحییٰ بن جابرقاضی حمص سے انھوں نے عبدالرحمٰن بن جبیر بن نفیر ہے ۔ انھوں نےاپنے والد جبیر بن نفیرسے اور انھوں نے حضرت نواس بن سمعان رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک صبح دجال کا ذکر کیا ۔ آپ نے اس ( کے ذکر کے دوران ) میں کبھی آواز دھیمی کی کبھی اونچی کی ۔ یہاں تک کہ ہمیں ایسے لگا جیسے وہ کھجوروں کے جھنڈمیں موجود ہے ۔ جب شام کو ہم آپ کے پاس ( دوبارہ ) آئے تو آپ نے ہم میں اس ( شدید تاثر ) کو بھانپ لیا ۔ آپ نے ہم سے پوچھا \" تم لوگوں کو کیا ہواہے؟ \" ہم نے عرض کی اللہ کے کے رسول اللہ صلی اللہ علیہ وسلم !صبح کے وقت آپ نے دجال کا ذکر فرمایاتو آپ کی آوازمیں ( ایسا ) اتارچڑھاؤتھا کہ ہم نے سمجھاکہ وہ کھجوروں کے جھنڈ میں موجود ہے ۔ اس پر آپ صلی اللہ علیہ وسلم نے ارشاد فرمایا : \" مجھے تم لوگوں ( حاضرین ) پر دجال کے علاوہ دیگر ( جہنم کی طرف بلانے والوں ) کا زیادہ خوف ہےاگر وہ نکلتا ہے اور میں تمھارے درمیان موجود ہوں تو تمھاری طرف سے اس کے خلاف ( اس کی تکذیب کے لیے ) دلائل دینے والا میں ہوں گااور اگر وہ نکلا اور میں موجودنہ ہوا تو ہر آدمی اپنی طرف سے حجت قائم کرنے والاخود ہو گا اور اللہ ہر مسلمان پر میرا خلیفہ ( خود نگہبان ) ہوگا ۔ وہ گچھے دار بالوں والاایک جوان شخص ہے اس کی ایک آنکھ بے نور ہے ۔ میں ایک طرح سے اس کو عبد العزیٰ بن قطن سے تشبیہ دیتا ہوں تم میں سے جو اسے پائے تو اس کے سامنے سورہ کہف کی ابتدائی آیات پڑھے وہ عراق اور شام کے درمیان ایک رستے سے نکل کر آئے گا ۔ وہ دائیں طرف بھی تباہی مچانے والا ہو گا اور بائیں طرف بھی ۔ اے اللہ کے بندو!تم ثابت قدم رہنا ۔ \" ہم نے عرض ۔ اللہ کے رسول اللہ صلی اللہ علیہ وسلم !زمین میں اس کی سرعت رفتار کیا ہو گی؟آپ نے فرمایا : \" بادل کی طرح جس کے پیچھے ہوا ہو ۔ وہ ایک قوم کے پاس آئے گا انھیں دعوت دے گا وہ اس پر ایمان لائیں گے اور اس کی باتیں مانیں گے ۔ تو وہ آسمان ( کے بادل ) کو حکم دے گا ۔ وہ بارش برسائے گا اور وہ زمین کو حکم دے گا تو وہ فصلیں اگائےگی ۔ شام کے اوقات میں ان کے جانور ( چراگاہوں سے ) واپس آئیں گے تو ان کے کوہان سب سے زیادہ اونچےاور تھن انتہائی زیادہ بھرے ہوئے اور کوکھیں پھیلی ہوئی ہوں گی ۔ پھر ایک ( اور ) قوم کے پاس آئے گا اور انھیں ( بھی ) دعوت دے گا ۔ وہ اس کی بات ٹھکرادیں گے ۔ وہ انھیں چھوڑ کر چلا جائے گا تووہ قحط کا شکار ہو جائیں گے ۔ ان کے مال مویشی میں سے کوئی چیز ان کےہاتھ میں نہیں ہوگی ۔ وہ ( دجال ) بنجر زمین میں سے گزرے گا تو اس سے کہےگا اپنے خزانے نکال تو اس ( بنجر زمین ) کے خزانے اس طرح ( نکل کر ) اس کے پیچھےلگ جائیں گے ۔ جس طرح شہد کی مکھیوں کی رانیاں ہیں پھر وہ ایک بھر پور جوان کو بلائے گا اور اسے تلوار ۔ مار کر ( یکبارگی ) دوحصوں میں تقسیم کردے گا جیسے نشانہ بنایا جانے والا ہدف ( یکدم ٹکڑے ہوگیا ) ہو ۔ پھر وہ اسے بلائے گا تو وہ ( زندہ ہوکر دیکھتےہوئے چہرے کے ساتھ ہنستا ہوا آئے گا ۔ وہ ( دجال ) اسی عالم میں ہو گا جب اللہ تعالیٰ مسیح بن مریم علیہ السلام کو معبوث فرمادے گا ۔ وہ دمشق کے حصے میں ایک سفید مینار کے قریب دوکیسری کپڑوں میں دوفرشتوں کے کندھوں پر ہاتھ رکھے ہوئے اتریں گے ۔ جب وہ اپنا سر جھکا ئیں گے تو قطرے گریں گے ۔ اور سر اٹھائیں گے تو اس سے چمکتے موتیوں کی طرح پانی کی بوندیں گریں گی ۔ کسی کافر کے لیے جو آپ کی سانس کی خوشبو پائے گا مرنے کے سوا کوئی چارہ نہیں ہو گا ۔ اس کی سانس ( کی خوشبو ) وہاں تک پہنچے گی جہاں تک ان کی نظر جائے گی ۔ آپ علیہ السلام اسے ڈھونڈیں گے تو اسے لُد ( Lyudia ) کےدروازے پر پائیں گے اور اسے قتل کر دیں گے ۔ پھر عیسیٰ بن مریم علیہ السلام کے پاس وہ لوگ آئیں گے جنھیں اللہ نے اس ( دجال کےدام میں آنے ) سے محفوظ رکھا ہو گاتووہ اپنے ہاتھ ان کے چہروں پر پھیریں گے ۔ اور انھیں جنت میں ان کے درجات کی خبردیں گے ۔ وہ اسی عالم میں ہوں گے کہ اللہ تعالیٰ عیسیٰ علیہ السلام کی طرف وحی فرمائےگا میں نے اپنے ( پیدا کیے ہوئے ) بندوں کو باہر نکال دیا ہے ان سے جنگ کرنے کی طاقت کسی میں نہیں ۔ آپ میری بندگی کرنے والوں کو اکٹھا کر کے طور کی طرف لے جائیں اور اللہ یاجوج ماجوج کو بھیج دے گا ، وہ ہر اونچی جگہ سے امڈتے ہوئے آئیں گے ۔ ان کے پہلے لوگ ( میٹھے پانی کی بہت بڑی جھیل ) بحیرہ طبریہ سے گزریں گے اور اس میں جو ( پانی ) ہوگا اسے پی جائیں گے پھر آخری لوگ گزریں گے تو کہیں گے ۔ \" کبھی اس ( بحیرہ ) میں ( بھی ) پانی ہوگا ۔ اللہ کے نبی حضرت عیسیٰ علیہ السلام اور ان کے ساتھی محصورہوکر رہ جائیں گے ۔ حتیٰ کہ ان میں سے کسی ایک کے لیے بیل کا سراس سے بہتر ( قیمتی ) ہوگا جتنےآج تمھارے لیے سودینارہیں ۔ اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی گڑ گڑاکر دعائیں کریں گے تو اللہ تعالیٰ ان ( یاجوج ماجوج ) پر ان کی گردنوں میں کپڑوں کا عذاب نازل کر دے گا تو وہ ایک انسان کے مرنے کی طرح ( یکبارگی ) اس کا شکار ہوجائیں گے ۔ پھر اللہ کے نبی عیسیٰ علیہ السلام اور ان کے ساتھی اترکر ( میدانی ) زمین پر آئیں گے تو انھیں زمین میں بالشت بھر بھی جگہ نہیں ملے گی ۔ جوان کی گندگی اور بد بو سے بھری ہوئی نہ ہو ۔ اس پرحضرت عیسیٰ علیہ السلام اور ان کے ساتھی اللہ کے سامنے گڑگڑائیں گے تو اللہ تعالیٰ بختی اونٹوں کے جیسی لمبی گردنوں کی طرح ( کی گردنوں والے ) پرندے بھیجے گا جو انھیں اٹھائیں گے اور جہاں اللہ چاہے گا جاپھینکیں گے ۔ پھر اللہ تعالیٰ ایسی بارش بھیجے گا جس سے کو ئی گھر اینٹوں کا ہو یا اون کا ( خیمہ ) اوٹ مہیا نہیں کر سکے گا ۔ وہ زمین کو دھوکر شیشےکی طرح ( صاف ) کر چھوڑےگی ۔ پھر زمین سے کہاجائے گا ۔ اپنے پھل اگاؤاوراپنی برکت لوٹالاؤ تو اس وقت ایک انار کو پوری جماعت کھائےگی اور اس کے چھلکے سے سایہ حاصل کرے گی اور دودھ میں ( اتنی ) برکت ڈالی جائے گی کہ اونٹنی کا ایک دفعہ کا دودھ لوگوں کی ایک بڑی جماعت کو کافی ہو گا اور گائے کاایک دفعہ کا دودھ لوگوں کے قبیلےکو کافی ہو گا اور بکری کا ایک دفعہ کا دودھ قبیلے کی ایک شاخ کو کافی ہوگا ۔ وہ اسی عالم میں رہ رہے ہوں گے ۔ کہ اللہ تعالیٰ ایک عمدہ ہوا بھیجے گا وہ لوگوں کو ان کی بغلوں کے نیچے سے پکڑے گی ۔ اور ہر مومن اور ہر مسلمان کی روح قبض کر لے گی اور بد ترین لوگ باقی رہ جائیں گے وہ وہ گدھوں کی طرح ( برسرعام ) آپس میں اختلاط کریں گےتو انھی پر قیامت قائم ہوگی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 7374,
			"arabicnumber": "2937.02",
			"text": "علی بن حجر سعدی نے ہمیں حدیث بیان کی کہا : ہمیں عبد اللہ بن عبد الرحمٰن بن یزید بن جابر اور ولید بن مسلم نے حدیث بیان کی ( علی ) ابن حجر نے کہا : ایک کی حدیث دوسرے کی حدیث میں شامل ہو گئی ہے ۔ انھوں نے عبد الرحمان بن یزید بن جابر سے اسی کی سندکے ساتھ جس طرح ہم نے ذکر کیااسی کے مطابق بیان کیا ۔ اور اس جملے کے بعد \" اس میں کبھی پانی تھا \" مزید بیان کیا \" پھر وہ ( آگے ) چلیں گے ) یہاں تک کہ وہ جبل خمرتک پہنچیں گےاور وہ بیت المقدس کا پہاڑ ہے تو جو کوئی بھی زمین میں تھا ہم نے اسے قتل کردیا آؤ!اب اسے قتل کریں جو آسمان میں ہے پھر وہ اپنے تیروں ( جیسے ہتھیاروں ) کو آسمان کی طرف چاہیں گے ۔ تو اللہ تعالیٰ ان کے ہتھیاروں کو خون آلود کرکے انھی کی طرف واپس بھیج دے گا ۔ اور ابن حجر کی روایت میں ہے \" میں نے اپنے ( پیدا کیے ہوئے ) بندوں کو اتاراہے کسی ایک کے پاس بھی ان سے جنگ کرنے کی طاقت نہیں ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 7375,
			"arabicnumber": "2938.01",
			"text": "صالح نے ابن شہاب سے روایت کی کہا : مجھے عبید اللہ بن عبداللہ بن عتبہ نے بتایا کہ حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ نے کہا : ایک دن رسول اللہ صلی اللہ علیہ وسلم نے ہمارے ساتھ دجال کے بارے میں لمبی گفتگو فرمائی ۔ اس میں آپ نے ہمارے سامنے جو بیان کیا اس میں ( یہ بھی ) تھا کہ آپ نے فرمایا : \" وہ آئے گا اس پرمدینہ کے راستے حرام کردیےگئے ہوں گے ۔ وہ مدینہ سے متصل ایک نرم شوریلی زمین تک پہنچے گا اس کے پاس ایک آدمی ( مدینہ سے ) نکل کر جائے گا ۔ جولوگوں میں سے بہترین یا بہترین لوگوں میں سے ایک ہو گا اور اس سے کہے گا ۔ میں گواہی دیتا ہوں کہ تو وہی دجال ہے جس کے بارے میں رسول اللہ صلی اللہ علیہ وسلم نے اپنی گفتگو میں ہمیں بتایا تھا ۔ تودجال ( اپنے ساتھ موجود لوگوں سے ) کہے ) گا تم لوگوں کا کیا خیال ہے کہ اگر میں اس شخص کو قتل کردوں اور پھر اسے زندہ کردوں تو کیا اس معاملے میں تمھیں کوئی شک ( باقی ) رہے گا؟وہ کہیں گے نہیں ۔ وہ اس شخص کو قتل کرے گا اور دوبارہ زندہ کردے گا ۔ جب وہ اس شخص کو زندہ کرے گاتو وہ اس سے کہے گا ۔ اللہ کی قسم!تمھارے بارے میں مجھے اب سے پہلے اس سے زیادہ بصیرت کبھی حاصل نہیں تھی ۔ فرمایا : دجال اسے قتل کرنا چاہے گا لیکن اسے اس شخص پر تسلط حاصل نہیں ہو سکے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 7376,
			"arabicnumber": "2938.02",
			"text": "شعیب نے زہری سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 7377,
			"arabicnumber": "2938.03",
			"text": "ابو وذاک نے حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دجال نکلےگا تو مومنوں میں سے ایک شخص اس کا رخ کرے گااسے اسلحہ بردارمحافظ یعنی دجال کے اسلحہ بردارمحافظ ملیں گے اور اس سے پوچھیں گے ۔ کہا : جانا چاہتے ہو؟وہ کہے گا ۔ میں اس شخص کی طرف جانا چاہتا ہوں جو ( اب ) نمودار ہوا ہے وہ اس سے کہیں گے ۔ کیا تم ہمارے رب پر ایمان نہیں رکھتے ؟وہ کہے گا ، ہمارے رب ( کی ربوبیت اور صفات ) میں کوئی پوشیدگی نہیں وہ ( اس کی بات پر مطمئن نہ ہوتے ہوئے ) کہیں گے ۔ اس کو قتل کردو ۔ پھر وہ ایک دوسرے سے کہیں گے ۔ کیا ہمارے رب نے ہمیں منع نہیں کیا تھا کہ اس ( کے سامنے پیش کرنے ) سےپہلے کسی کو قتل نہ کرو ۔ وہ اسے دجال کے پاس لے جائیں گے ۔ وہ مومن جب اسے دیکھے گا تو کہے گا لوگو!یہ وہی دجال ہے جس کا ذکر رسول اللہ صلی اللہ علیہ وسلم نے فرمایاتھا ۔ فرمایا : تودجال اس کے بارے میں حکم دے گا تو اس ( کے اعضاء ) کو کھینچ کر باندھ دیا جا ئے گا پھر وہ کہے گا ۔ اسے پکڑواور اس کاسر اور منہ توڑ دو ، تو ( مارمارکر ) اس کا پیٹ اور اس کی کمر چوڑی کردی جائے گی ۔ فرمایا : پھر وہ ( دجال ) کہے گا ۔ کیا تم مجھ پر ایمان نہیں لاؤگے؟فرمایا : \" تو وہ کہے گا تم جھوٹے ( بناوٹی ) مسیح ہو ۔ فرمایا : \" پھر اس کے بارے میں حکم دیا جا ئے گا ۔ تو اس کی پیشانی سے اسے آری کے ساتھ چیرا جائے گا ۔ یہاں تک کے اس کے دونوں پاؤں الگ الگ کر دیے جائیں گے ۔ فرمایا : \" پھر دجال دونوں ٹکڑوں کے درمیان چلے گا ۔ پھر اس سےکہے گا ۔ کھڑے ہوجاؤچنانچہ وہ سید ھا کھڑا ہو جا ئے گا ۔ فرمایا : وہ پھر اس سے کہے گا کیا مجھ پر ایمان لاتے ہو؟وہ کہے گا ۔ ( اس سب کچھ سے ) تمھارے بارے میں میری بصیرت میں اضافے کے سوا اور کچھ نہیں ہوا ۔ فرمایا : پھر وہ شخص کہے گا لوگو!یہ ( دجال ) اب میرے بعد لوگوں میں کسی کے ساتھ ایسا نہیں کر سکے گا ۔ فرمایا : دجال اسے ذبح کرنے کے لیے پکڑے گا تو اس کی گردن سے اس کی ہنسلی کی ہڈیوں تک ( کاحصہ ) تانبے کا بنایا جا ئے گا وہ کسی طریقے سے ( اسے ذبح ) نہ کر سکے گا ۔ فرمایا ۔ تو وہ اس کے دونوں پاؤں اور دونوں ہاتھوں سے پکڑ کراسے پھینکےگا ۔ لوگ سمجھیں گےاس ( دجال ) نے اسے آگ میں پھینک دیا ہے جبکہ ( اصل میں وہ ) جنت میں ڈال دیا جائے گا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" شہادت میں رب العالمین کے سامنے یہ شخص سب لوگوں سے بڑا ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 7378,
			"arabicnumber": "2939.01",
			"text": "ابراہیم بن حمید رؤاسی نے اسماعیل بن ابی خالد سے انھوں نےقیس بن ابی حازم سے اور انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نےکہا : کہ نبی صلی اللہ علیہ وسلم سے دجال کے بارے میں جتنا میں نے پوچھا اس سے زیادہ کسی نے نہیں پوچھا ۔ آپ نے فرمایا : \" اس ( کے حوالے ) سے تمھیں کیا بات اتنا تھکا رہی ہے؟ وہ تمھیں نقصان نہیں پہنچائے گا ۔ کہا : میں نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !لوگ کہتے ہیں اس کے ہمراہ کھانے ( کےڈھیر ) اور ( پانی کے ) دریا ہوں گے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کے نزدیک وہ اس سے حقیر تر ہے ( کہ ایسی چیزوں کے ذریعے سے مسلمانوں کو گمراہ کر سکے ،)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 7379,
			"arabicnumber": "2939.02",
			"text": "ہشیم نے اسماعیل سے انھوں نے قیس سے اور انھوں نے حضرت مغیرہ بن شعبہ رضی اللہ تعالیٰ عنہ سے روایت کی کہا : نبی صلی اللہ علیہ وسلم سے دجال کے بارے میں جتنا میں نے پوچھا اس سے زیادہ کسی نے نہیں پوچھا ، آپ نے فرمایا : ’’تمھارے سوال کا ( سبب ) کیا ہے ؟ \" کہا : میں نے عرض کی وہ ( لوگ ) کہتے ہیں اس کے ہمراہ روٹی اور گوشت کے پہاڑ اور پانی کا دریاہوگافرمایا : \" وہ اللہ کے نزدیک اس سے زیادہ حقیرہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 7380,
			"arabicnumber": "2939.03",
			"text": "وکیع ، جریر ، سفیان ، یزید بن ہارون اور ابو اسامہ سب نے اسماعیل سے اسی سند کے ساتھ ابراہیم بن حمید کی طرح روایت کی اور یزید کی حدیث میں مزید یہ ہے کہ آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" میرے بیٹے",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 7381,
			"arabicnumber": "2940.01",
			"text": "معاذ عنبری نے کہا : ہمیں شعبہ نے نعمان بن سالم سے حدیث بیان کی ، انھوں نے کہا : میں نے یعقوببن عاصم بن عروہ بن مسعود ثقفی سے سنا ، وہ کہتے ہیں میں نے حضرت عبد اللہ بن عمرو رضی اللہ تعالیٰ عنہ سے سنا ، ان کے پاس ایک شخص آیا اور کہا : یہ کیا حدیث ہے جو آپ بیان کرتے ہیں ۔ کہ فلاں فلاں بات ہونے تک قیامت قائم ہو جائے گی انھوں نے سبحان اللہ ! ۔ یا ۔ ۔ ۔ لاالہ الااللہ ۔ ۔ ۔ یا ۔ ۔ ۔ اس جیسا کوئی کلمہ کہا : ( اورکہنے لگے ) میں نے پختہ ارادہ کر لیا کہ میں کسی کو کبھی کوئی بات بیان نہیں کروں گا ۔ میں نے یہ کہا تھا تم لوگ تھوڑے عرصے بعد بہت بڑا معاملہ دیکھو گے ۔ بیت اللہ کو جلا دیا جا ئےگا ۔ اور یہ ہوگا پھر کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میری امت میں دجال نمودار ہو گا اور چالیس مجھے یاد نہیں کہ چالیس دن ( فرمائے ) یا چالیس مہینے یا چالیس سال رہے گا تو اللہ تعالیٰ حضرت عیسیٰ علیہ السلام کو بھیج دیں گے ۔ وہ اس طرح ہیں جیسے حضرت عروہ بن مسعود رضی اللہ تعالیٰ عنہ آپ اسے ڈھونڈیں گے اور اسے ہلاک کر دیں گے پھر لوگ سات سال تک اس حالت میں رہیں گے ۔ کہ کوئی سے دو آدمیوں کے درمیان دشمنی تک نہ ہوگی پھر اللہ تعالیٰ شام کی طرف سے ایک ٹھنڈی ہواچلائے گاتو روئے زمین پر ایک بھی ایسا آدمی نہیں رہے گا جس کے دل میں ذرہ برابر بھلائی یا ایمان ہو گا ۔ مگر وہ ہوا اس کی روح قبض کرے گی یہاں تک کہااگر تم میں سے کوئی شخص پہاڑ کے جگرمیں گھس جائے گا تو وہاں بھی وہ ( ہوا ) داخل ہو جا ئے گی ۔ یہاں تک کہ اس کی روح قبض کرلے گی ۔ \" انھوں نے کہا : یہ بات میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی ۔ آپ نے فرمایا : \" پرندوں جیسا ہلکا پن اور درندوں جیسی عقلیں رکھنے والے بد ترین لوگ باقی رہ جائیں گے ۔ نہ اچھائی کو اچھا سمجھیں گے نہ برائی کو برا جانیں گے ۔ شیطان کوئی شکل اختیار کر کے ان کے پاس آئے گا اور کہے گا : \" کیا تم میری بات پر عمل نہیں کروگے؟وہ کہیں گے ۔ تو ہمیں کیا حکم دیتا ہے ۔ ؟وہ انھیں بت پوجنے کا حکم دے گا وہ اسی حالت میں رہیں گے ان کا رزق اترتا ہوگا ان کی معیشت بہت اچھی ہو گی پھر صور پھونکا جائے گا ۔ جو بھی اسے سنے گا وہ گردن کی ایک جانب کو جھکائے گا اور دوسری جانب کو اونچا کرے گا ( گردنیں ٹیڑھی ہو جائیں گی ) سب سے پہلا شخص جواسے سنے گاوہ اپنے اونٹوں کے حوض کی لپائی کر رہا ہوگا ۔ وہ پچھاڑ کھا کر گر جائے گا ۔ اور دوسرے لوگ بھی گر ( کر مر ) جائیں گے ۔ اس کے بعد اللہ تعالیٰ ایک بارش نازل فرمائےگا ۔ جو ایک پھوار کے مانند ہو گی ۔ یا سائے کی طرح ہو گی ۔ شک کرنے والے نعمان ( بن سالم ) ہیں اس سے انسانوں کے جسم اُگ آئیں گے ۔ پھر صور میں دوسری بار پھونک ماری جائے گی ۔ تو وہ سب لوگ کھڑے ہوئے دیکھ رہے ہوں گے ، ( زندہ ہو جا ئیں گے ) پھر کہا جا ئے گا لوگو! اپنے پروردگارکی طرف آؤ !اور ( فرشتوں سے کہا جائے گا ان کولاکھڑا کرو ان سے سوال پوچھے جائیں گے ۔ حکم دیا جا ئےگا ۔ آگ میں بھیجے جانے والوں کو ( اپنی صفوں سے ) باہرنکالو پوچھا جائے گا ۔ کتنوں میں سے ( کتنے؟ ) کہاجائے گا ہر ہزار میں سے نو سو ننانوے ۔ انھوں نے کہا : تویہ وہ دن ہو گا جو بچوں کو بوڑھا کردے گا ۔ اور وہی دن ہو گا جب پنڈلی سے پردہ ہٹا ( کر دیدار جمال کرایا ) جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 7382,
			"arabicnumber": "2940.02",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے نعمان بن سالم سے حدیث بیان کی ، انھوں نے کہا : میں نے یعقوب بن عاصم بن عروہ بن مسعود سے سنا ، انھوں نے کہا : میں نے ایک شخص کو سنا ، اس نے حضرت عبداللہ بن عمرو سے کہا : آپ یہ کہتے ہیں کہ فلاں فلاں ( بات پوری ہوجائے ) پر قیامت قائم ہوجائے گی ۔ حضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہ نے کہا : میں نے یہ ارادہ کرلیا ہے کہ میں تم لوگوں کو کوئی حدیث نہ سناؤں ، میں تو یہ کہاتھا کہ تم تھوڑی مدت کے بعد ایک بڑا معاملہ دیکھو گے تو بیت اللہ کے جلنے کا واقعہ ہوگیا ۔ شعبہ نے یہ الفاظ کہےیا اس سے ملتے جلتے الفاظ کہے ۔ حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" میری امت میں دجال نمودار ہوگا ۔ \"\" اور ( اس کے بعد محمد بن جعفر نے ) معاذ کی حدیث کےمانند حدیث بیان کی اور اپنی حدیث میں کہا : \"\" کوئی ا یک شخص بھی جس نے دل میں ذرہ برابر ایمان ہو ، نہیں بچے کا مگر وہ ( ہوگا ) اس کی روح قبض کرلے گی ۔ \"\" محمد بن جعفر نے کہا : شعبہ نے مجھے یہ حدیث کئی بار سنائی اورمیں نے ( کئی بار ) اسے ان کے سامنے دہرایا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 7383,
			"arabicnumber": "2941.01",
			"text": "محمد بن بشیر نے ابو حیان سے ، انھوں نے ابو زرعہ سے اور انھوں نے حضر ت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک ایسی حدیث سنی ہے جس کو سننے کے بعد میں اسے بھولا نہیں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کوفرماتے ہوئے سنا : \" نمودار ہونے والی سب سے پہلے نشانی مغرب سے سورج کا طلوع ہونا اور دن چڑھے لوگوں کے سامنے زمین کے چوپائے کانکلنا ہے ۔ ان میں سے جو بھی نشانی دوسری سے پہلے ظاہر ہوگی ، دوسری اس کے بعد جلد نمودار ہوجائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 7384,
			"arabicnumber": "2941.02",
			"text": "عبداللہ بن نمیر نے کہا : ہمیں ابو حیان نے ابوزرعہ سے بیان کیا ، کہا : مسلمانوں میں سے تین شخص مدینہ میں مروان بن حکم کے پاس بیٹھے تھے اور اسے قیامت کی نشانیاں بیان کرتے ہوئے سن رہے تھے کہ ان میں سے پہلی دجال کا ظہور ہوگا ، اس پر حضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہ نے کہا : ( تم لوگ یوں سمجھو کہ ) مردان نے کچھ بھی نہیں کہا ( کیونکہ اس کی بات رسول اللہ صلی اللہ علیہ وسلم کے فرمان کے مطابق نہیں ) میں نے رسول اللہ صلی اللہ علیہ وسلم سے ایک حدیث سنی تھی جسے میں بھولا نہیں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ۔ پھر اسی ( سابقہ حدیث ) کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 7385,
			"arabicnumber": "2941.03",
			"text": "سفیان نے ابو حیان سے اور انھوں نے ابو زرعہ سے روایت کی ، انھوں نے کہا : لوگوں نے مردان کی موجودگی میں قیامت کے بارے میں مذاکرہ کیا تو حضرت عبداللہ بن عمرو رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ۔ ( آگے ) ان دونوں کی حدیث کے مانند بیان کیا اور \" دن چڑھنے کے وقت \" کاذ کر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 7386,
			"arabicnumber": "2942.01",
			"text": "ابن بریدہ نے ہمیں حدیث بیان کی ، کہا : مجھے عامر بن شراحیل شعبی نے جن کا تعلق شعب ہمدان سے تھا ، حدیث بیان کی ، انھوں نے ضحاک بن قیس رضی اللہ تعالیٰ عنہ کی ہمشیرہ سید ہ فاطمہ بنت قیس رضی اللہ تعالیٰ عنہ سے سوال کیا ، وہ اولین ہجرت کرنے والوں میں سے تھیں کہ آپ مجھے رسول اللہ صلی اللہ علیہ وسلم کی ایسی حدیث بیان کریں جو آپ نے رسول اللہ صلی اللہ علیہ وسلم سے ( بلاواسطہ ) سنی ہو ۔ وہ بولیں کہ اچھا ، اگر تم یہ چاہتے ہو تو میں بیان کروں گی ۔ انہوں نے کہا کہ ہاں بیان کرو ۔ سیدہ فاطمہ رضی اللہ عنہا نے کہا کہ میں نے ابن مغیرہ سے نکاح کیا اور وہ ان دنوں قریش کے عمدہ جوانوں میں سے تھے ، پھر وہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پہلے ہی جہاد میں شہید ہو گئے ۔ جب میں بیوہ ہو گئی تو مجھے عبدالرحمن بن عوف رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کے صحابہ میں سے چند کے ساتھ آ کر نکاح کا پیغام دیا ۔ اور رسول اللہ صلی اللہ علیہ وسلم نے اپنے مولیٰ اسامہ بن زید رضی اللہ عنہ کے لئے پیغام بھیجا ۔ اور میں رسول اللہ صلی اللہ علیہ وسلم یہ حدیث سن چکی تھی کہ جو شخص مجھ سے محبت رکھے ، اس کو چاہئے کہ اسامہ رضی اللہ عنہ سے بھی محبت رکھے ۔ جب رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے اس بارے میں گفتگو کی تو میں نے کہا کہ میرے کام کا اختیار آپ صلی اللہ علیہ وسلم کو ہے ، آپ صلی اللہ علیہ وسلم جس سے چاہیں نکاح کر دیجئیے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تم ام شریک کے گھر چلی جاؤ اور ام شریک انصار میں ایک مالدار عورت تھی اور اللہ کی راہ میں بہت زیادہ خرچ کرتی تھیں ، اس کے پاس مہمان اترتے تھے ۔ میں نے عرض کیا کہ بہت اچھا ، میں ام شریک کے پاس چلی جاؤں گی ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ ام شریک کے پاس مت جا اس کے پاس مہمان بہت آتے ہیں اور مجھے برا معلوم ہوتا ہے کہ کہیں تیری اوڑھنی گر جائے یا تیری پنڈلیوں پر سے کپڑا ہٹ جائے اور لوگ تیرے بدن میں سے وہ دیکھیں جو تجھے برا لگے گا ۔ تم اپنے چچا کے بیٹے عبداللہ بن عمرو ابن ام مکتوم کے پاس چلی جاؤ اور وہ بنی فہر میں سے ایک شخص تھا اور فہر قریش کی ایک شاخ ہے اور وہ اس قبیلہ میں سے تھا جس میں سے سیدہ فاطمہ رضی اللہ عنہا بھی تھیں ۔ پھر سیدہ فاطمہ نے کہا کہ میں ان کے گھر میں چلی گئی ۔ جب میری عدت گزر گئی تو میں نے پکارنے والے کی آواز سنی اور وہ پکارنے والا رسول اللہ صلی اللہ علیہ وسلم کا منادی تھا ، وہ پکار رہا تھا کہ نماز کے لئے جمع ہو جاؤ ۔ میں بھی مسجد کی طرف نکلی اور میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ۔ میں اس صف میں تھی جس میں عورتیں لوگوں کے پیچھے تھیں ۔ جب آپ صلی اللہ علیہ وسلم نے نماز پڑھ لی تو منبر پر بیٹھے اور آپ صلی اللہ علیہ وسلم ہنس رہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ہر ایک آدمی اپنی نماز کی جگہ پر رہے ۔ پھر فرمایا کہ تم جانتے ہو کہ میں نے تمہیں کیوں اکٹھا کیا ہے؟ صحابہ بولے کہ اللہ اور اس کا رسول صلی اللہ علیہ وسلم خوب جانتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ کی قسم میں نے تمہیں رغبت دلانے یا ڈرانے کے لئے جمع نہیں کیا ، بلکہ اس لئے جمع کیا کہ تمیم داری ایک نصرانی تھا ، وہ آیا اور اس نے بیعت کی اور مسلمان ہوا اور مجھ سے ایک حدیث بیان کی جو اس حدیث کے موافق ہے جو میں تم سے دجال کے بارے میں بیان کیا کرتا تھا ۔ اس نے بیان کیا کہ وہ یعنی تمیم سمندر کے جہاز میں تیس آدمیوں کے ساتھ سوار ہوا جو لخم اور جذام کی قوم میں سے تھے ، پس ان سے ایک مہینہ بھر سمندر کی لہریں کھیلتی رہیں ۔ پھر وہ لوگ سمندر میں ڈوبتے سورج کی طرف ایک جزیرے کے کنارے جا لگے ۔ پس وہ جہاز سے پلوار ( یعنی چھوٹی کشتی ) میں بیٹھے اور جزیرے میں داخل ہو گئے وہاں ان کو ایک جانور ملا جو کہ بھاری دم ، بہت بالوں والا کہ اس کا اگلا پچھلا حصہ بالوں کے ہجوم سے معلوم نہ ہوتا تھا ۔ لوگوں نے اس سے کہا کہ اے کمبخت تو کیا چیز ہے؟ اس نے کہا کہ میں جاسوس ہوں ۔ لوگوں نے کہا کہ جاسوس کیا؟ اس نے کہا کہ اس مرد کے پاس چلو جو دیر میں ہے ، کہ وہ تمہاری خبر کا بہت مشتاق ہے ۔ تمیم رضی اللہ عنہ نے کہا کہ جب اس نے مرد کا نام لیا تو ہم اس جانور سے ڈرے کہ کہیں شیطان نہ ہو ۔ تمیم نے کہا کہ پھر ہم دوڑتے ہوئے ( یعنی جلدی ) دیر میں داخل ہوئے ۔ دیکھا تو وہاں ایک بڑے قد کا آدمی ہے کہ ہم نے اتنا بڑا آدمی اور ویسا سخت جکڑا ہوا کبھی نہیں دیکھا ۔ اس کے دونوں ہاتھ گردن کے ساتھ بندھے ہوئے تھے اور دونوں زانوں سے ٹخنوں تک لوہے سے جکڑا ہوا تھا ۔ ہم نے کہا کہ اے کمبخت! تو کیا چیز ہے؟ اس نے کہا تم میری خبر پر قابو پا گئے ہو ( یعنی میرا حال تو تم کو اب معلوم ہو جائے گا ) ، تم اپنا حال بتاؤ کہ تم کون ہو؟ لوگوں نے کہا کہ ہم عرب لوگ ہیں ، سمندر میں جہاز میں سوار ہوئے تھے ، لیکن جب ہم سوار ہوئے تو سمندر کو جوش میں پایا پھر ایک مہینے کی مدت تک لہر ہم سے کھیلتی رہی ، پھر ہم اس جزیرے میں آ لگے تو چھوٹی کشتی میں بیٹھ کر جزیرے میں داخل ہوئے ، پس ہمیں ایک بھاری دم کا اور بہت بالوں والا جانور ملا ، ہم اس کے بالوں کی کثرت کی وجہ سے اس کا اگلا پچھلا حصہ نہ پہچانتے تھے ۔ ہم نے اس سے کہا کہ اے کمبخت! تو کیا چیز ہے؟ اس نے کہا کہ میں جاسوس ہوں ۔ ہم نے کہا کہ جاسوس کیا؟ اس نے کہا کہ اس مرد کے پاس چلو جو دیر میں ہے اور وہ تمہاری خبر کا بہت مشتاق ہے ۔ پس ہم تیری طرف دوڑتے ہوئے آئے اور ہم اس سے ڈرے کہ کہیں بھوت پریت نہ ہو ۔ پھر اس مرد نے کہا کہ مجھے بیسان کے نخلستان کی خبر دو ۔ ہم نے کہا کہ تو اس کا کون سا حال پوچھتا ہے؟ اس نے کہا کہ میں اس کے نخلستان کے بارے میں پوچھتا ہوں کہ پھلتا ہے؟ ہم نے اس سے کہا کہ ہاں پھلتا ہے ۔ اس نے کہا کہ خبردار رہو عنقریب وہ نہ پھلے گا ۔ اس نے کہا کہ مجھے طبرستان کے دریا کے بارے میں بتلاؤ ۔ ہم نے کہا کہ تو اس دریا کا کون سا حال پوچھتا ہے؟ وہ بولا کہ اس میں پانی ہے؟ لوگوں نے کہا کہ اس میں بہت پانی ہے ۔ اس نے کہا کہ البتہ اس کا پانی عنقریب ختم ہو جائے گا ۔ پھر اس نے کہا کہ مجھے زغر کے چشمے کے بارے میں خبر دو ۔ لوگوں نے کہا کہ اس کا کیا حال پوچھتا ہے؟ اس نے کہا کہ اس چشمہ میں پانی ہے اور وہاں کے لوگ اس پانی سے کھیتی کرتے ہیں؟ ہم نے اس سے کہا کہ ہاں! اس میں بہت پانی ہے اور وہاں کے لوگ اس کے پانی سے کھیتی کرتے ہیں ۔ اس نے کہا کہ مجھے امییّن کے پیغمبر کے بارے میں خبر دو کہ وہ کیا رہے؟ لوگوں نے کہا کہ وہ مکہ سے نکلے ہیں اور مدینہ میں گئے ہیں ۔ اس نے کہا کہ کیا عرب کے لوگ ان سے لڑے؟ ہم نے کہا کہ ہاں ۔ اس نے کہا کہ انہوں نے عربوں کے ساتھ کیا کیا؟ ہم نے کہا کہ وہ اپنے گرد و پیش کے عربوں پر غالب ہوئے اور انہوں نے ان کی اطاعت کی ۔ اس نے کہا کہ یہ بات ہو چکی؟ ہم نے کہا کہ ہاں ۔ اس نے کہا کہ خبردار رہو یہ بات ان کے حق میں بہتر ہے کہ پیغمبر کے تابعدار ہوں ۔ اور البتہ میں تم سے اپنا حال کہتا ہوں کہ میں مسیح ( دجال ) ہوں ۔ اور البتہ وہ زمانہ قریب ہے کہ جب مجھے نکلنے کی اجازت ہو گی ۔ پس میں نکلوں گا اور سیر کروں گا اور کسی بستی کو نہ چھوڑوں گا جہاں چالیس رات کے اندر نہ جاؤں ، سوائے مکہ اور طیبہ کے ، کہ وہاں جانا مجھ پر حرام ہے یعنی منع ہے ۔ جب میں ان دونوں بستیوں میں سے کسی کے اندر جانا چاہوں گا تو میرے آگے ایک فرشتہ بڑھ آئے گا اور اس کے ہاتھ میں ننگی تلوار ہو گی ، وہ مجھے وہاں جانے سے روک دے گا اور البتہ اس کے ہر ایک ناکہ پر فرشتے ہوں گے جو اس کی چوکیداری کریں گے ۔ سیدہ فاطمہ رضی اللہ عنہا نے کہا کہ پھر نبی کریم صلی اللہ علیہ وسلم نے اپنی چھڑی منبر پر مار کر فرمایا کہ طیبہ یہی ہے ، طیبہ یہی ہے ، طیبہ یہی ہے ۔ یعنی طیبہ سے مراد مدینہ منورہ ہے ۔ خبردار رہو! بھلا میں تم کو اس حال کی خبر دے نہیں چکا ہوں؟ تو اصحاب نے کہا کہ ہاں ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مجھے تمیم رضی اللہ عنہ کی بات اچھی لگی جو اس چیز کے موافق ہوئی جو میں نے تم لوگوں سے دجال اور مدینہ اور مکہ کے حال سے فرما دیا تھا ۔ خبردار ہو کہ وہ شام یا یمن کے سمندر میں ہے؟ نہیں بلکہ وہ مشرق کی طرف ہے ، وہ مشرق کی طرف ہے ، وہ مشرق کی طرف ہے ( مشرق کی طرف بحر ہند ہے شاید دجال بحر ہند کے کسی جزیرہ میں ہو ) اور آپ صلی اللہ علیہ وسلم نے مشرق کی طرف اشارہ کیا ۔ سیدہ فاطمہ بنت قیس رضی اللہ عنہا نے کہا کہ یہ حدیث میں نے رسول اللہ صلی اللہ علیہ وسلم سے یاد رکھی ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 7387,
			"arabicnumber": "2942.02",
			"text": "سیار ابو الحکم نے کہا : ہمیں شعبی نے حدیث بیان کی ، کہا : ہمیں شعبی نے حدیث بیان کی ، کہا : ہم حضرت فاطمہ بنت قیس رضی اللہ تعالیٰ عنہ کے ہاں گئے ، انھوں نے ہمیں تازہ کھجوروں کاتحفہ دیا جن کو ابن طاب کی تازہ کھجوریں کہا جاتا تھا اور جو کے ستو پلائے ، میں نے ان سے ا س عورت کے بارے میں پوچھا جس کو تین طلاقیں دی گئی ہوں کہ وہ عدت کہاں گزارے گی؟انھوں نے کہا : مجھے میرے شوہر نے تین طلاقیں دی تھیں تو نبی کریم صلی اللہ علیہ وسلم نے مجھے اجازت دی تھی کہ میں انے گھر والوں کے درمیان عدت گزار لوں ، ( حضرت فاطمہ رضی اللہ تعالیٰ عنہا نے ) کہا : پھر ( عدت کے بعد ) لوگوں میں یہ اعلان کیا گیا کہ نماز کی جماعت ہونے والی ہے ، میں بھی دوسرے لوگوں کے ساتھ نماز کے لئے چل دی ، میں عورتوں کی پہلی صف میں تھی جو مردوں کی آخری صف کے پیچھے تھی ۔ انھوں نے کہا : میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ منبر پرخطبہ دے رہے تھے ، آپ نے فرمایا : \" تمیم داری کے چچا کے بیٹے ( ان کے قبیلے سے تعلق رکھنے والے رشتہ دار ) سمندر ( کے جہاز ) میں سوار ہوئے ۔ \" اسکے بعد ( سیار نے پوری ) حدیث بیان کی اور اس میں مزید کہا کہ ( حضرت فاطمہ رضی اللہ تعالیٰ عنہا نے ) کہا : ایسے لگتا ہے کہ میں نبی کریم صلی اللہ علیہ وسلم کو دیکھ رہی ہوں ، آپ نے اپنے عصا کو زمین کی طرف جھکایا اور فرمایا : \" یہ طیبہ ہے ۔ \" آپ کی مراد مدینہ سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 7388,
			"arabicnumber": "2942.03",
			"text": "غیلان بن جریر نے شعبی سے اور انھوں نے حضرت فاطمہ بنت قیس رضی اللہ تعالیٰ عنہا سے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم کے پاس حضرت تمیم داری رضی اللہ تعالیٰ عنہ آئے اور رسول اللہ صلی اللہ علیہ وسلم کو بتایا کہ وہ سمندر ( کےجہاز ) میں سوار ہوئے تو ان کا جہاز راستے سے ہٹ گیا ، وہ ایک جزیرے میں جا اترے ، وہ اس جزیرے میں نکل کر پانی ڈھونڈنے لگے ، وہاں ایک انسان سے ملاقات ہوئی جو اپنے بال گھسیٹ رہاتھا ، پھر ( پوری ) حدیث بیان کی اور اس میں یہ بھی کہا : پھر اس ( دجال ) نے کہا : اگر مجھے نکلنے کی اجازت دی گئی تو میں طیبہ ( مدینہ ) کے سوا تمام شہروں میں جاؤں گا ، پھر رسول اللہ صلی اللہ علیہ وسلم ان ( حضرت تمیم داری رضی اللہ تعالیٰ عنہ ) کو لوگوں کے سامنے لے گئے اور ( ان کی موجودگی میں ) آپ نے ان ( لوگوں ) کے سامنے ( یہ واقعہ ) بیان کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ طیبہ ہے اور وہ ( شخص ) دجال ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 7389,
			"arabicnumber": "2942.04",
			"text": "ابو زناد نے شعبی سے اور انھوں نےحضرت فاطمہ بنت قیس رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم منبر پر رونق افروز ہوئے اور فرمایا : \" لوگو! مجھے تمیم داری نے یہ بتایا ہے کہ ان کی قوم کے کچھ لوگ اپنے ایک جہاز میں سمندر میں تھے ، وہ جہاز ٹوٹ گیا اوران میں سے کچھ لوگ جہاز کے تختوں میں سے ایک تختے پر سوار ہوگئے اور سمندر میں ایک جزیرے کی طرف جانکلے ۔ \" اور پھر ( آگے باقی ماندہ ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 7390,
			"arabicnumber": "2943.01",
			"text": "ابن عمر واوزاعی نے اسحاق بن عبداللہ بن ابی طلحہ سے روایت کی ، کہا : مجھے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مکہ اور مدینہ کے علاوہ کوئی شہر نہیں مگر دجال! اسے روندے گا ۔ ان ( دو شہروں ) کے راستوں میں سے ہر راستے پر فرشتے صف باندھتے ہوئے پہرہ دے رہے ہوں گے پھر وہ ایک شوریلی زمین میں اترے گا ۔ اس وقت مدینہ تین بارلرز ےگا اور ہر کافر اور منافق اس میں سے نکل کر اس ( دجال ) کے پاس چلا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 7391,
			"arabicnumber": "2943.02",
			"text": "حماد بن سلمہ نے اسحاق بن عبداللہ بن ابی طلحہ سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ اس کے بعد اسی ( سابقہ حدیث کی ) طرح بیان کیا ، مگر اس میں کہا : چنانچہ وہ ( دجال ) جرف کی شوریلی زمین میں آکر اپنا خیمہ لگائے گا اور کہا : ہر منافق مرد اور عورت نکل کر اس کے پاس چلے جائیں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 7392,
			"arabicnumber": "2944",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اصبہان کے یہودیوں میں سے ستر ہزار ( یہودی ) دجال کی پیروی کریں گے ، ان ( کے جسموں ) پر طینسان کی حبائیں ہوں گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 7393,
			"arabicnumber": "2945.01",
			"text": "حجاج بن محمد نے کہا : ابن جریج نے کہا کہ مجھے ابو زبیر نے حدیث بیان کی ، انھوں نے حضر ت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے کہ مجھے ام شریک نے خبر دی کہ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ صلی اللہ علیہ وسلم فرمارہے تھے : \" لوگ دجال سے فرار ہوکر پہاڑوں میں جائیں گے ۔ \" حضرت ام شریک رضی اللہ تعالیٰ عنہا نے کہا : اللہ کےرسول صلی اللہ علیہ وسلم ! اس وقت عرب کہاں ہوں گے؟ ( جو دین کے دفاع میں سینہ سپر ہوجاتے ہیں ۔ ) آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" وہ بہت کم ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 7394,
			"arabicnumber": "2945.02",
			"text": "ابو عاصم نے ابن جریج سے اسی سند کے ساتھ ( یہی ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 7395,
			"arabicnumber": "2946.01",
			"text": "عبدالعزیز بن مختار نے کہا : ہمیں ایوب نے حمید بن ہلال سے حدیث بیان کی ، انھوں نے ایک گروہ سے روایت کی جن میں ابو دہماء اور ابو قتادہ شامل ہیں ، انھوں نے کہا : ہم حضرت ہشام بن عامر رضی اللہ تعالیٰ عنہ کے پاس سے گزر کر حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ کے پاس جایا کر تے تھے ، ایک دن انھوں نے کہا : تم مجھے چھوڑ کر ایسے لوگوں کے پاس جاتے ہوجو مجھ سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہونے والے نہیں تھے اور نہ ان کو مجھ سے زیادہ رسول اللہ صلی اللہ علیہ وسلم کی احادیث کا علم ہے ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سناتھا : \" حضرت آدم علیہ السلام سے لے کر قیامت تک کوئی مخلوق ( فتنہ وفساد میں ) ایسی نہیں جو دجال سے بڑی ہو ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 7396,
			"arabicnumber": "2946.02",
			"text": "عبیداللہ بن عمرو نے ایوب سے ، انھوں نے حمید بن ہلال سے اور انھوں نے اپنی قوم کے تین لوگوں سے روایت کی جن میں ابو قتادہ بھی شامل ہیں کہ ہم ہشام بن عامر رضی اللہ تعالیٰ عنہ کے پاس سے گزر کر حضرت عمران بن حصین رضی اللہ تعالیٰ عنہ کے پا س جاتے تھے ۔ جس طرح عبدالعزیز بن مختار کی روایت ہے مگر انھوں نے کہا؛ \" دجال ( کے فتنے ) سے بڑا کوئی معاملہ ( پیش نہیں آیا ۔)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 7397,
			"arabicnumber": "2947.01",
			"text": "علاء کے والد ( عبدالرحمان ) نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" چھ چیزوں کے ظہور سے پہلے نیک عمل کرنے میں سبقت کرو ۔ سورج کے مغرب سے طلوع ہونے ، دھوئیں ، دجال ، زمین کے چوپائے ، خاص طور پر تم میں سے کسی ایک کو پیش آنے والے معاملے ( بیماری ، عاجز کردینے والا بڑھاپا یا کوئی رکاوٹ ) اور ہر کسی کو پیش آنے والا معاملہ ( مثلا : اجتماعی گمراہی ، فتنے کے زمانے میں قتل عام ، قیامت سے پہلے ۔)",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 7398,
			"arabicnumber": "2947.02",
			"text": "شعبہ نے قتادہ سے ، انھوں نے حسن سے ، انھوں نے زیاد بن ریاح سے ، انھوں نے حضرت ابوہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" چھ چیزوں کے ظہور سے پہلے نیک اعمال میں سبقت کرو : دجال ، دھواں ، زمین کا چوپایہ ، سورج کا مغرب سے طلوع ہونا ، عام لوگوں کے ساتھ پیش آنے والا معاملہ یا خصوصی طور پر تم سے کسی ایک کو پیش آنے والا معاملہ ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 7399,
			"arabicnumber": "2947.03",
			"text": "ہمام نے قتادہ سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 7400,
			"arabicnumber": "2948.01",
			"text": "یحییٰ بن یحییٰ نے ہمیں حدیث بیان کی ، کہا : ہمیں حماد بن زید نے خبردی ، انھوں نے معلی بن زیاد سے ، انھوں نے معاویہ بن قرہ سے ، انھوں نے معقل بن یسار رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ اسی طرح ہمیں قتیبہ بن سعید نے یہی حدیث بیان کی ، انھوں نے کہا ۔ ہمیں حماد نے معلیٰ بن زیاد سے حدیث بیان کی ، انھوں نے اس روایت کو معاویہ بن قرہ کی طرف لوٹایا ، انھوں نے حضرت معقل بن یسار رضی اللہ تعالیٰ عنہ کی طرف اور انھوں نے نبی کریم صلی اللہ علیہ وسلم کی طرف منسوب کرتے ہوئے بیان کیا کہ آ پ نے فرمایا : \" کو طرف پھیلی ہوئی قتل وغارت گری کے دوران میں عبادت ( پر توجہ مرکوز ) کرنا ، میری طرف ہجرت کرنے کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 7401,
			"arabicnumber": "2948.02",
			"text": "یہی حدیث مجھے ابو کامل نے بیان کی ، انھوں نے کہا : ہمیں حماد نے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 7402,
			"arabicnumber": "2949",
			"text": "حضرت عبداللہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) سے روایت ہے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" قیامت صرف بدترین لوگوں پرہی قائم ہوگی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 7403,
			"arabicnumber": "2950",
			"text": "یعقوب نے ابو حازم سے روایت کی ، انھوں نے حضرت سہل رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا ، انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ انگوٹھے کے ساتھ والی ( شہادت کی انگلی ) اور بڑی انگلی کے ساتھ اشارہ کرتے ہوئے فرمارہے تھے؛ \" میں اورقیامت اس طرح ( ساتھ ساتھ ) بھیجے گئے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 7404,
			"arabicnumber": "2951.01",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے قتادہ کو سنا ، کہا : ہمیں حضرت انس بن مالک رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" مجھے اور قیامت کو ان ( شہادت اوربڑی انگلیوں ) کی طرح ( ساتھ ساتھ ) مبعوث کیا گیاہے ۔ \"\" شعبہ نے کہا : اور میں نے قتادہ سے ان کے حدیث بیان کرنے کے دوران میں سنا : جتنی ان میں سے ایک اُنگلی دوسری سے بڑی ہے ( اتنے سے زمانے کا فرق ہے ) مجھے معلوم نہیں یہ ( معنی ) انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے نقل کرتے ہوئے بیان کیا یا خود قتادہ نے بیان کیا",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 7405,
			"arabicnumber": "2951.02",
			"text": "خالد بن حارث نے کہا : ہمیں شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے قتادہ اور ابو تیاح کوحدیث بیان کرتے ہوئے سنا ، ان دونوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا ، وہ حدیث بیان کررہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے اور قیامت کو اس طرح مبعوث کیا گیا ہے ۔ \" اور شعبہ نے اسے بیان کرتے ہوئے اپنی انگشت شہادت اوردرمیانی انگلی کو ملایا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 7406,
			"arabicnumber": "2951.03",
			"text": "معاذ اور محمد بن جعفر نے کہا : ہمیں شعبہ نے ابو تیاح سے حدیث بیان کی ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 7407,
			"arabicnumber": "2951.04",
			"text": "ابن ابی عدی نے شعبہ سے ، انھوں نے حمزہ ضبی اور ابو تیاح سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ان سب کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 7408,
			"arabicnumber": "2951.05",
			"text": "معبد نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہارسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے اور قیامت کو اس طرح بھیجا گیا ہے ۔ کہا : اور آپ صلی اللہ علیہ وسلم نے انگشت شہادت اوردرمیانی انگلی کو اکٹھا کیا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 7409,
			"arabicnumber": "2952",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے کہا : \" اعراب ( بدولوگ ) جب رسول اللہ صلی اللہ علیہ وسلم کے پاس آتے تو آپ سے قیامت کے متعلق سوال کرتے کہ قیامت کب آئے گی؟آپ ان میں سب سے کم عمر انسان کی طرف دیکھ کر فرماتے : \" اگر یہ زندہ رہاتو یہ بوڑھا نہیں ہوا ہوگا کہ تم پر تمہاری ( قیامت کی ) گھڑی آجائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 7410,
			"arabicnumber": "2953.01",
			"text": "ثابت نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم سے سوال کیا : قیامت کب قائم ہوگی؟اور اس کے پاس انصار میں سے ایک لڑکا بیٹھا تھا جسے محمد کہاجاتا تھا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" اگر یہ لڑکا زندہ رہا تو شاید اسے بڑھاپا نہ پہنچے گا کہ ( تمہاری ) قیامت آجائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 7411,
			"arabicnumber": "2953.02",
			"text": "معبد بن ہلال عنزی نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک شخص نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا : قیامت کب قائم ہوگی؟رسول اللہ صلی اللہ علیہ وسلم تھوڑی دیر خاموش رہے ، پھر آپ نے اپنے سامنے بیٹھے اذدشنو ، کے ایک لڑکے کی طرف نظر کی ، پھر فرمایا؛ \"\" اگر یہ لڑکا لمبی عمر پاگیا تو اسے بڑھایا نہیں آیا ہوگا کہ ( تمہاری ) قیامت قائم ہوجائےگی ۔ \"\" ( معبد نے ) کہا : حضرت انس رضی اللہ تعالیٰ عنہ نے کہا : وہ لڑکا اس دن میرا ہم عمر تھا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 7412,
			"arabicnumber": "2953.03",
			"text": "قتادہ نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ( اس وقت ) حضرت مغیرہ بن شعبہ کا ایک لڑکا گزرا جو میرے ہم عمروں میں سے تھا تو نبی کریم صلی اللہ علیہ وسلم نے فرمایا : اگر اس کو مہلت ملی تو اسے بڑھاپا نہیں آیا ہوگا کہ ( تم پر ) قیامت آجائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 7413,
			"arabicnumber": "2954",
			"text": "اعرج نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی اورانھوں نے اس کا سلسلہ رسول اللہ صلی اللہ علیہ وسلم تک پہنچایا کہ آپ صلی اللہ علیہ وسلم نے فرمایا : \" قیامت آئے گی تو ایک آدمی اونٹنی کا دودھ نکال رہا ہوگا وہ برتن اس کے منہ تک نہ پہنچا ہوگا کہ قیامت قائم ہوجائےگی اور دو آدمی کپڑے کا سودا کررہے ہوں گے انھوں نے خریدوفروخت ( مکمل ) نہیں کی ہوگی کہ قیامت قائم ہوجائے گی ، ایک شخص اپنے حوض میں لپائی کررہا ہوگا وہ باہر نہیں نکل پایا ہوگا کہ قیامت قائم ہوجائے گی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 7414,
			"arabicnumber": "2955.01",
			"text": "صالح نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \"\" دو بارصور پھونکنے کے درمیان چالیس کا وقفہ ہوگا ۔ \"\" انھوں ( لوگوں ) نے کہا ۔ ابوہریرۃ رضی اللہ تعالیٰ عنہ چالیس دن؟انھوں نے کہا : میں انکار کرتا ہوں ۔ لوگوں نے کہا : چالیس مہینے؟ انھوں نے کہا : میں انکار کرتا ہوں ۔ لوگوں نے کہا چالیس سال؟ انھوں نے کہا : میں انکار کرتا ہوں ۔ پھر اللہ تعالیٰ آسمان سے پانی نازل فرمائے گا تو لوگ اسی طرح اگیں گے جس طرح سبزہ اگتا ہے ۔ \"\" انھوں نے کہا : \"\" اور انسان کا کوئی حصہ نہیں ، مگر وہ بوسیدہ ہوجائے گا ، سوائےایک ہڈی کے وہ دمچی کی ہڈی کا آخری حصہ ہے قیامت کے دن اسی سے خلقت کی ترکیب مکمل ہوگی ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 7415,
			"arabicnumber": "2955.02",
			"text": "اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایات کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" دمچی کی ہڈی کے آخری سرے کے سوا پورے ابن آدم ( کے جسم ) کو مٹی کھالے گی ۔ اسی سے انسان پیدا کیا گیا اور اسی ( آخری سرے ) سے پھر ( اسے جوڑ کر ) اکھٹا کیا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 7416,
			"arabicnumber": "2955.03",
			"text": "معمر نے ہمام بن منبہ سے حدیث بیان کی ، کہا : یہ احادیث ہمیں حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے رسول اللہ صلی اللہ علیہ وسلم سے بیان کیں ، پھر انھوں نے کئی احادیث ذکر کیں ، ان میں سے ( ایک یہ ) ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" انسان کے جسم میں ایک ہڈی ہے جس کو مٹی کبھی نہ کھا سکے گی ، اسی میں ( سے ) قیامت کے دن اس کوپور ابنایا جائے گا ۔ \" انھوں ( لوگوں ) نے پوچھا : اللہ کے رسول صلی اللہ علیہ وسلم ! وہ کون سے ہڈی ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" وہ دم کی ہڈی کا آخری سراہے ۔",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 177
			}
		}
	]
}