{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"55": "The Book of Zuhd and Softening of Hearts "
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7417,
			"arabicnumber": "2956",
			"text": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دنیا مومن کا قید خانہ اور کافر کی جنت ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7418,
			"arabicnumber": "2957.01",
			"text": "سلیمان بن بلال نے جعفر سے ، انھوں نے اپنے والد سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم ( مدینہ کی ) کسی بالائی جانب سے داخل ہوتے ہوئے بازار سے گزرے ، لوگ آپ کے پہلو میں ( آپ کے ساتھ چل رہے ) تھے ۔ آپ حقیر سے کانوں والے مرے ہوئے میمنے کے پاس سے گزرے ، آپ نے اسے کان سے پکڑ کر اٹھایا ، پھر فرمایا : تم میں سے کون اسے ایک درہم کے عوض لینا پسند کرے گا؟ \" توانھوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے کہا : ہمیں یہ کسی بھی چیز کے عوض لینا پسند نہیں ، ہم اسے لے کر کیا کریں گے؟آپ نے فرمایا : \" ( پھر ) کیا تم پسند کرتے ہو کہ یہ تمھیں مل جائے؟ \" انھوں ( صحابہ رضوان اللہ عنھم اجمعین ) نے عرض کی : اللہ کی قسم!اگر یہ زندہ ہوتاتو تب بھی اس میں عیب تھا ، کیونکہ ( ایک تو ) یہ حقیر سے کانوں والا ہے ( بھلانہیں لگتا ) ۔ پھر جب وہ مرا ہوا ہے تو کس کام کا؟ اس پر آ پ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ کی قسم!جتنا تمہارے نزدیک یہ حقیر ہے اللہ کے نزدیک دنیا اس سے بھی زیادہ حقیر ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7419,
			"arabicnumber": "2957.02",
			"text": "محمد بن مثنیٰ عنزی اور ابراہیم بن محمد بن عروہ سامی نے مجھے حدیث بیان کی ، دونوں نے کہا : ہمیں عبدالوہاب ثقفی نے جعفر ( صادق ) سے حدیث بیان کی ، انھوں نے اپنے والد ( محمد باقر ) سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی البتہ ثقفی کی روایت میں ہے : ( صحابہ رضوان اللہ عنھم اجمعین نے کہا : ) اگریہ زندہ ہوتاتب بھی حقیر سے کانوں والا ہونا اس کاعیب تھا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7420,
			"arabicnumber": "2958.01",
			"text": "ہمام ( بن یحییٰ بن دینار ) نے ہمیں حدیث بیان کی ، کہا : ہمیں قتادہ نے مطرف سے ، انھوں نے اپنے والد ( حضرت عبداللہ بن شخیر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا جبکہ آپ ( سورت ) أَلْهَاكُمُ التَّكَاثُرُتلاوت فرمارہے تھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" ابن آدم کہتا ہے میرا مال ، میرا مال ۔ \" فرمایا \" آدم علیہ السلام کے بیٹے!تیرے مال میں سے تیرے لیے صرف وہی ہے جو تم نے کھا کرفنا کردیا ، یا پہن کر پُرانا کردیا ، یا صدقہ کرکے آگے بھیج دیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7421,
			"arabicnumber": "2958.02",
			"text": "شعبہ ، سعید ( بن ابی عروبہ ) اور ہشام سب نے قتادہ سے ، انھوں نے مطرف سے اور انھوں نے اپنے والد سے روایت کی ، کہا : میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں پہنچا ۔ ( آگے ) ہمام کی حدیث کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7422,
			"arabicnumber": "2959.01",
			"text": "حفص بن میسرو نے علاء ( بن عبدالرحمان ) سے ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرۃء رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بندہ کہتا ہے میرا مال ، میرا مال اس لیے تو اس کے مال سے صر ف تین چیزیں ہیں ۔ جو اس نے کھایا اور فنا کردیا ، جو پہنا اور بوسیدہ کردیا ، یاجو کسی کو دےکر آخرت کے لیے ) ذخیرہ کرلیا ۔ اس کے سوا جو کچھ بھی ہے تو وہ ( بندہ جانے والا اور اس ( مال ) کو لوگوں کے لیے چھوڑنے والا ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7423,
			"arabicnumber": "2959.02",
			"text": "محمد بن جعفر نے کہا مجھے علاء بن عبدالرحمان نے اسی سند کے ساتھ اسی کے مانند بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7424,
			"arabicnumber": "2960",
			"text": "عبداللہ بن ابی بکر نے کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میت کے پیچھے تین چیزیں ہوتی ہیں ان میں سے دو لوٹ آتی ہیں اور ایک ساتھ رہ جاتی ہے اس کے گھر والے ، اس کا مال اور اس کا عمل اس کے پیچھے رہ جا تے ہیں ، گھر والے اور مال لوٹ آ تے ہیں اور عمل ساتھ رہ جاتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7425,
			"arabicnumber": "2961.01",
			"text": "یونس نے ابن شہاب سے ، انھوں نے عروہ بن زبیر سے روایت کی کہ حضرت مسور بن مخرمہ رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ عمرو بن عوف جو بنی عامر کے حلیف تھے ، انھوں نے جنگ بدر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ شرکت کی تھی ، انھیں خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابو عبیدہ بن جراح رضی اللہ تعالیٰ عنہ کو بحرین بھیجا تاکہ وہاں کا جذیہ لے آئیں ، رسول اللہ صلی اللہ علیہ وسلم نے بذات خود اہل بحرین سے صلح کی تھی اور علاء بن حضرمی رضی اللہ تعالیٰ عنہ کو ان پر امیر مقرر کیا تھا ، حضرت ابو عبیدہ رضی اللہ تعالیٰ عنہ بحرین سے مال لے آئے ، انصار نے حضرت ابو عبیدہ رضی اللہ تعالیٰ عنہ کے آنے کی خبر سنی تو وہ سب صبح کی نماز میں رسول اللہ صلی اللہ علیہ وسلم کے پاس پہنچے ، جب رسول اللہ صلی اللہ علیہ وسلم نے نماز ادا کرلی ، واپس ہوئے تو وہ ( صحابہ رضوان اللہ عنھم اجمعین ) آپ صلی اللہ علیہ وسلم کےسامنے ہوئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے جب انھیں دیکھا تو مسکرادیئے ، پھر آپ صلی اللہ علیہ وسلم نے فرمایا : \" میرا خیال ہے کہ تم لوگوں نے سن لیا ہے کہ ابو عبیدہ بحرین سے کچھ لے کر آئے ہیں؟انھوں نے کہا : اللہ کے رسول صلی اللہ علیہ وسلم !آپ نے بجا فرمایا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا؛ \" خوش ہوجاؤ اور اس کی اُمید رکھو جس سے تمھیں خوشی ہوگی ۔ اللہ کی قسم! مجھےتم پرفقر کا خوف نہیں ( کہ تمھیں اس سے نقصان پہنچےگا ) لیکن مجھے تم پر اس بات کا خوف ہے کہ دنیا اسی طرح تم پر کشادہ کردی جائے گی جس طرح تم سے پہلے لوگوں پر کشادہ کردی گئی تھی ۔ پھر تم اس میں ایک دوسرے کا مقابلہ کرو گے جس طرح ان لوگوں نے ایک دوسرے کا مقابلہ کیا اور یہ تمھیں بھی تباہ کردےگی جس طرح اس نے ان کو تباہ کردیا تھا ۔ \" ؎",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7426,
			"arabicnumber": "2961.02",
			"text": "صالح اور شعیب دونوں نے زہری سے یونس کی سند کے ساتھ اس کی حدیث کے مانند روایت کی ، مگر صالح کی حدیث میں ہے : \" اور یہ تمھیں بھی اس طرح لبھائے گی ( دنیا میں مگن اور آخرت سے غافل کردے گی ) جس طرح اس نے ان کو لبھایا تھا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7427,
			"arabicnumber": "2962",
			"text": "عبد اللہ بن عمرو بن عاص رضی اللہ تعالیٰ عنہ سے مولی یزید بن ابوفراس رباح نے حضرت عبداللہ بن عمرو بن عاص رضی اللہ تعالیٰ عنہ سے ، انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے ر وایت کی کہ آپ نے فرمایا : \" جب روم اور فارس فتح ہوجائیں گے تو تم کس طرح کی قوم ہوگے؟ \" حضرت عبدالرحمان بن عوف رضی اللہ تعالیٰ عنہ نے کہا ، ہم وہی بات کریں گے جس کا اللہ نے ہمیں حکم دیا ہے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" یا اس کے برعکس تم ( دنیا کے معاملے میں ) ایک دوسرے سے مقابلہ کروگے ، پھر ایک د وسرے کے حسد کرنے لگوگے ، پھر ایک دوسرے سے منہ موڑ لوگے پھر ایک دوسرے سے بغض میں مبتلا ہوجاؤ گے ۔ پھرمسلمین مہاجرین کے ہاں جاؤگے اور ان میں سے کچھ کو ( حاکم بنا کر ) دوسروں کی گردنوں پر مسلط کردو گے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7428,
			"arabicnumber": "2963.01",
			"text": "ابو زناد نے اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص اس کی طرف دیکھے جسے مال اور جمال میں فضیلت حاصل ہے تو اس کو بھی دیکھے جو اس سے کمتر ہے ، جس پر ( خود ) اسے فضیلت حاصل ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7429,
			"arabicnumber": "2963.02",
			"text": "معمر نے ہمام بن منبہ سے ، انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی ، بالکل ابو زناد کی حدیث کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7430,
			"arabicnumber": "2963.03",
			"text": "جریر ، ابو معاویہ اور وکیع نے اعمش سے ، انھوں نے ابو صالح سے اورانھوں نے حضرت ابوہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اس کی طرف دیکھو جو ( مال ور جمال میں ) تم سے کمتر ہے ، اس کی طرف مت دیکھو جو تم سے فائق ہے ، یہ لائق تر ہے اسکے کہ تم اللہ کی نعمت کو حقیر نہ سمجھو گے ۔ \"\" ابو معاویہ نےکہا : \"\" ( وہ نعمت ) جو تم پر کی گئی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7431,
			"arabicnumber": "2964",
			"text": "اسحاق بن عبداللہ بن ابی طلحہ نےکہا : مجھے عبدالرحمان بن ابی عمرہ نے حدیث بیان کی ، انھیں حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، انھوں نے نبی کریم صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : آپ صلی اللہ علیہ وسلم فرماتے تھے کہ بنی اسرائیل کے لوگوں میں تین آدمی تھے ، ایک کوڑھی سفید داغ والا ، دوسرا گنجا اور تیسرا اندھا ۔ پس اللہ تعالیٰ نے ان کو آزمانا چاہا کہ تو ان کے پاس فرشتہ بھیجا ۔ پس وہ سفید داغ والے کے پاس آیا اور اس نے کہا کہ تجھے کون سی چیز بہت پیاری ہے؟ اس نے کہا کہ اچھا رنگ اچھی کھال اور مجھ سے یہ بیماری دور ہو جائے جس کے سبب سے لوگ مجھ سے نفرت کرتے ہیں ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ فرشتے نے اس پر ہاتھ پھیرا ۔ پس اس کی بدصورتی دور ہو گئی اور اس کو اچھا رنگ اور اچھی کھال دی گئی ۔ فرشتے نے کہا کہ تجھے کون سا مال بہت پسند ہے؟ اس نے کہا کہ اونٹ یا گائے ۔ ( راوی حدیث اسحاق بن عبداللہ کو شک ہے کہ اس نے اونٹ مانگا یا گائے لیکن سفید داغ والے یا گنجے نے ان میں سے ایک نے اونٹ کہا اور دوسرے نے گائے ) ۔ پس اس کو دس مہینے کی گابھن اونٹنی دی اور کہا کہ اللہ تعالیٰ تیرے واسطے اس میں برکت دے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر فرشتہ گنجے کے پاس آیا پس کہا کہ تجھے کون سی چیز بہت پسند ہے؟ اس نے کہا کہ اچھے بال اور یہ بیماری جاتی رہے جس کے سبب سے لوگ مجھ سے نفرت کرتے ہیں ۔ پھر اس نے اس پر ہاتھ پھیرا تو اس کی بیماری دور ہو گئی اور اس کو اچھے بال ملے ۔ فرشتے نے کہا کہ تجھے کون سا مال بہت پسند ہے؟ اس نے کہا کہ گائے ۔ پس اس کو گابھن گائے دے دی گئی ۔ فرشتے نے کہا کہ اللہ تعالیٰ تیرے مال میں برکت دے ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر فرشتہ اندھے کے پاس آیا اور کہا کہ تجھے کون سی چیز بہت پسند ہے؟ اس نے کہا کہ اللہ تعالیٰ آنکھ میں بینائی کر دے تو میں اس کے سبب سے لوگوں کو دیکھوں ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر فرشتے نے اس پر ہاتھ پھیرا تو اللہ نے اس کو بینائی دے دی ۔ فرشتے نے کہا کہ تجھے کون سا مال بہت پسند ہے؟ اس نے کہا کہ بھیڑ بکری ۔ تو اس کو گابھن بکری ملی ۔ پھر ان دونوں ( اونٹنی اور گائے ) اور اس ( بکری ) نے بچے دئیے ۔ پھر ہوتے ہوتے سفید داغ والے کے جنگل بھر اونٹ ہو گئے اور گنجے کے جنگل بھر گائے بیل ہو گئے اور اندھے کے جنگل بھر بکریاں ہو گئیں ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ مدت کے بعد وہی فرشتہ سفید داغ والے کے پاس اس کی پہلی صورت اور شکل میں آیا ، اور کہا کہ میں محتاج آدمی ہوں ، سفر میں میرے تمام اسباب کٹ گئے ( یعنی تدبیریں جاتی رہیں اور مال اور اسباب نہ رہا ) ، پس آج میرے لئے اللہ کی مدد کے سوا اور اس کے بعد تیری مدد کے بغیر منزل پر پہنچنا ممکن نہیں ہے ، میں تجھ سے اس کے نام پر جس نے تجھے ستھرا رنگ اور ستھری کھال دی اور مال اونٹ دئیے ، ایک اونٹ مانگتا ہوں جو میرے سفر میں کام آئے ۔ اس نے کہا کہ مجھ پر لوگوں کے بہت حق ہیں ( یعنی قرضدار ہوں یا گھربار کے خرچ سے زیادہ مال نہیں جو تجھے دوں ) ۔ پھر فرشتہ نے کہا کہ البتہ میں تجھے پہچانتا ہوں بھلا کیا تو محتاج کوڑھی نہ تھا؟ کہ لوگ تجھ سے نفرت کرتے تھے ، پھر اللہ نے اپنے فضل سے تجھے یہ مال دیا ۔ اس نے جواب دیا کہ میں نے تو یہ مال اپنے باپ دادا سے پایا ہے جو کئی پشت سے نقل ہو کر آیا ہے ۔ فرشتے نے کہا کہ اگر تو جھوٹا ہو تو اللہ تجھے ویسا ہی کر ڈالے جیسا تو پہلے تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر فرشتہ گنجے کے پاس اس کی پہلی صورت اور شکل میں آیا اور اس سے ویسا ہی کہا جیسا سفید داغ والے سے کہا تھا اور اس نے بھی وہی جواب دیا جو سفید داغ والے نے دیا تھا ۔ فرشتے نے کہا کہ اگر تو جھوٹا ہو تو اللہ تجھے ویسا ہی کر ڈالے جیسا تو تھا ۔ نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ پھر فرشتہ اندھے کے پاس اس کی پہلی شکل و صورت میں گیا ، اور کہا کہ میں محتاج آدمی ہوں اور مسافر ہوں ، میرے سفر میں میرے سب وسیلے اور تدبیریں کٹ گئیں ، پس مجھے آج منزل پر اللہ کی مدد اور اس کے بعد تیری مدد کے بغیر پہنچنا مشکل ہے ۔ پس میں تجھ سے اس اللہ کے نام پر ، جس نے تجھے بینائی دی ، ایک بکری مانگتا ہوں تاکہ وہ میرے سفر میں کام آئے ۔ اس نے کہا کہ بیشک میں اندھا تھا تو اللہ نے مجھے ( بینائی والی ) آنکھ دی ، تو ان بکریوں میں سے جتنی چاہو لے جاؤ اور جتنی چاہو چھوڑ جاؤ ۔ اللہ کی قسم! آج جو چیز تو اللہ کی راہ میں لے گا ، میں تجھے مشکل میں نہ ڈالوں گا ( یعنی تیرا ہاتھ نہ پکڑوں گا ) ۔ پس فرشتے نے کہا کہ اپنا مال اپنے پاس رکھو ، تم تینوں آدمی صرف آزمائے گئے تھے ۔ پس تجھ سے تو اللہ تعالیٰ راضی ہوا اور تیرے دونوں ساتھیوں سے ناخوش ہوا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7432,
			"arabicnumber": "2965",
			"text": "بکیر بن مسمار نے کہا : مجھے عامر بن سعد نے حدیث بیان کی انھوں نے کہا : حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ اپنے اونٹوں کے پاس تھے کہ ان کےبیٹےعمر ( بن سعد ) ان کے پاس آئے جب حضرت سعد رضی اللہ تعالیٰ عنہ نے انھیں دیکھا تو کہا : میں اس سوار کے شرسے اللہ کی پناہ چاہتا ہوں وہ اترے اور ان ( حضرت سعد رضی اللہ تعالیٰ عنہ ) سے کہا : آپ اپنے اونٹوں اور بکریوں کے پاس رہائش پذیر ہو گئے ہیں اور لوگوں کو چھوڑ دیا ہے کہ وہ سلطنت کے بارے میں باہم لڑرہے ہیں ( آپ کبھی اپناحصہ مانگیں ) حضرت سعد رضی اللہ تعالیٰ عنہ نے ان کے سینے پر ضرب لگائی اور کہا : خاموش رہو!میں نے رسول االلہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سناہے ، \" اللہ تعالیٰ اپنے اس بندے سے محبت رکھتا ہے جو متقی ہو ، غنی ہو ، گم نام ( گوشہ نشیں ) ہو ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7433,
			"arabicnumber": "2966.01",
			"text": "معمر عبد اللہ بن نمیر اور ابن بشر نے کہا : ہمیں اسماعیل بن قیس نے حدیث سنائی ، کہا : میں نے حضرت سعد بن ابی وقاص رضی اللہ تعالیٰ عنہ کو فرماتے ہوئے سنا : اللہ کی قسم !میں عربوں میں سے پہلا شخص ہوں جس نے اللہ کی راہ میں تیرچلایاہم رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ اس طرح جنگیں لڑتے تھے کہ ہمارے پاس کھانے کو خاردار درخت کے پتوں اور اس کیکر ( کےپتوں ) کے سوا کچھ نہیں ہوتا تھا ۔ یہاں تک کہ قم میں سے کوئی بکری کی مینگنیوں کی طرح پاخانہ کرتا تھا پھر اب بنو اسد کے لوگ دین کے معاملے میں میری تادیب کرنے لگےہیں ! ( اگر اب میں دین سے اس قدر نابلد ہو گیا ہوں ) تب تو میں بالکل ناکام ہو گیا اور میرےعمل ضائع ہو گئے ۔ اور ابن نمیر نے اپنی روایت میں \" تب تو \" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7434,
			"arabicnumber": "2966.02",
			"text": "وکیع نے اسماعیل بن ابی خالد سے اسی سند کے ساتھ روایت کی اور کہا : یہاں تک کہ ہم سے ایک بکرے کی ( مینگنیوں کی ) طرح کا پاخانہ کرتا تھا جس میں اور کچھ ( کسی اور کھانے کا کو ئی حصہ جو اسے پاخانہ کی شکل سے ) ملا ہوا نہیں ہو تا تھا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7435,
			"arabicnumber": "2967.01",
			"text": "شیبان بن فروخ نے ہمیں حدیث بیان کی کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی ، کہا : ہمیں حمید بن بلال نے خالد بن عمیر عدوی سے حدیث بیان کی انھوں نے کہا : ایک دن ( حضرت عمر رضی اللہ تعالیٰ عنہ کی طرف سے بصرہ کےعامل ) حضرت عتبہ بن غزوان رضی اللہ تعالیٰ عنہ نے ہمیں خطبہ دیا اور اللہ تعالیٰ کی حمد وثنا کی پھر کہا : حمدو ثنا کے بعد بے شک یہ دنیا خاتمے کے قریب ہو گئی ہے اور اس ( کی مہلت ) میں سے تھوڑا سا حصہ باقی رہ گیا ہے جس طرح برتن کے آخری قطرےہوتے ہیں جنھیں برتن والا انڈیل رہا ہوتا ہے اور تم اس دنیا سے اس گھر کی طرف منتقل ہو رہے ہو جس پر زوال نہیں آئے گا ۔ جو تمھارے پاس ہے اس میں سے بہتر ین متاع کے ساتھ آگے جاؤ ۔ کیونکہ ہمیں بتایا گیا تھا کہ جہنم کے کنارے سے ایک پتھر پھینکا جاتا ہے تو وہ وہ سترسال گرتا رہتا ہے ۔ اس کی تہ تک نہیں پہنچتا ۔ اور اللہ کی قسم!یہ ( جہنم ) پوری طرح بھر جائے گی ۔ کیا تمھیں اس پر تعجب ہے؟اور ہمیں بتا یا گیا کہ جنت کے کواٹروں میں سے دو کواٹروں کے درمیان چالیس سال کی مسافت ہے اور اس پر ایک دن آئے گا جب وہ ازدحام کے سبب تنگ پڑجائے گا اور میں نے دیکھا کہ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( ایمان لانے والے ) سات لوگوں میں سے ساتواں میں تھا ہمارے پاس درختوں کے پتوں کے سوا کھانے کی کو ئی چیز نہیں ہوتی تھی یہاں تک کہ ہماری باچھیں زخمی ہو گئیں ۔ میں نے ایک چادر اٹھائی تو اسے اپنے اور سعد بن مالک رضی اللہ تعالیٰ عنہ کے درمیان دوحصوں میں تقسیم کرلیا آدھی میں نے کمر پر باندھی اور آدھی سعد رضی اللہ تعالیٰ عنہ نے اب ہم میں سے ہر کوئی شہروں میں سے کسی شہر کا امیر بن گیا ہے ۔ میں اس بات سے اللہ کی پناہ میں آتا ہوں کہ میں اپنے دل میں بڑا اور اللہ کے نزدیک چھوٹا ہو جاؤں اور کبھی کوئی نبوت نہیں تھی ۔ مگر ختم ہو گئی ۔ یہاں تک کہ اس کا پچھلا حصہ بادشاہت میں بدل گیا ۔ جلد ہی تمھیں ( اس کا ) پتہ چل جائے گا اور ہمارےبعد کے امیروں کا ( بھی تم لوگ خود ) تجربہ کر لو گے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7436,
			"arabicnumber": "2967.02",
			"text": "اسحٰق بن عمر بن سلیط نے مجھے حدیث بیان کی ، کہا : ہمیں سلیمان بن مغیرہ نے حدیث بیان کی کہا : ہمیں حمید بن بلال نے خالد بن عمیر سے جنھوں نے جاہلیت کا زمانہ دیکھا تھا روایت کی کہا : حضرت عتبہ بن غزوان رضی اللہ تعالیٰ عنہ نے ہمیں خطبہ دیا وہ اس وقت بصرہ کے امیرتھے ۔ ( آگے ) شیبان کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7437,
			"arabicnumber": "2967.03",
			"text": "قرہ بن خالد نے حمید بلال سے اور انھوں نے خالد بن عمیر سے روایت کی ، کہا : میں نے حضرت عتبہ بن غزوان رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے ، میں نے دیکھا میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( ایمان لانے والے ) سات لوگوں میں سے ساتواں شخص تھا خاردار درختوں کے پتوں کے سوا ہمارے پاس کھانے کو کچھ نہیں تھا یہاں تک کہ ہماری باچھیں زخمی ہو گئیں ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 7438,
			"arabicnumber": "2968",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : انھوں نے ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے عرض کی ، اللہ کے رسول اللہ صلی اللہ علیہ وسلم !قیامت کے دن ہم اپنے رب کو دیکھیں گے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" کیا دوپہر کے وقت جب بادل نہ ہوں تمھیں سورج کودیکھنے میں کوئی زحمت ہوتی ہے ۔ ؟ \"\" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : نہیں آپ نے فرمایا : \"\" چودھویں کی رات کو جب بادل نہ ہوں تو کیا تمھیں چاند کو دیکھنے میں کو ئی زحمت ہوتی ہے؟ \"\" انھوں نے ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے کہا : نہیں آپ نے فرمایا : \"\" مجھے اس ذات کی قسم جس کے ہاتھ میں میری جان ہے ۔ !تمھیں اپنے رب کو دیکھنے میں اس سے زیادہ زحمت نہیں ہو گی جتنی زحمت تمھیں ان دونوں کو دیکھنے میں ہو تی ہے ۔ \"\" آپ نے فرمایا : \"\" وہ ( رب ) بندے سے ملا قات فرمائے گا تو کہے گا ۔ اے فلاں !کیا میں نے تمھیں عزت نہ دی تھی ، تمھیں سردار نہ بنایا تھا تمھاری شادی نہ کرائی تھی گھوڑے اور اونٹ تمھارے اختیار میں نہ دیے تھے اور تمھیں ایسا نہیں بنا چھوڑا تھا کہ تم سرداری کرتے تھے اور لوگوں کی آمدنی میں سے چوتھائی حصہ لیتے تھے ؟وہ جواب میں کہے گا ۔ کیوں نہیں ! ( بالکل ایسا ہی تھا ۔ ) تو وہ فرمائے گا ۔ کیا تم سمجھتے تھے کہ تم مجھ سے ملوگے؟ وہ کہے گا ۔ نہیں ۔ تووہ فرمائے گا ۔ آج میں اسی طرح تمھیں بھول جاؤں گا ۔ جس طرح تم مجھے بھول گئے تھے پھر دوسرے سے ملاقات کرے گا ۔ اے فلاں !کیا میں نے تمھیں عز ت اور سیادت سے نہیں نوازا تھا تمھاری شادی نہیں کرائی تھی تمھارے لیے اونٹ اور گھوڑے مسخر نہیں کیے تھے اور تمھیں اس طرح نہیں بنا چھوڑا تھا کہ تم ریاست کے مزے لیتے تھے ۔ اور لوگوں کے مالوں میں سے چوتھا ئی حصہ وصول کرتے تھے ۔ ؟وہ کہے گا کیوں نہیں میرے رب!تو وہ فرمائے گا ۔ تمھیں اس بات کا کوئی گمان بھی تھا کہ تم مجھ سے ملا قات کروگے؟ وہ کہے گا ۔ نہیں تو وہ فرمائے گا اب میں بھی اسی طرح تمھیں بھول جاؤں گا جس طرح تم مجھے بھول گئے تھے ۔ پھر تیسرے سے ملے گا ۔ اس سے بھی وہی فرمائے گا ۔ وہ کہے گا ۔ اے میرے رب !میں تجھ پر تیری کتابوں اور تیرے رسولوں پر ایمان لایا تھا اور نمازیں پڑھی تھیں روزے رکھے تھے اور صدقہ دیا کرتا تھا جتنا اس کے بس میں ہو گا ( اپنی نیکی کی ) تعریف کرے گا ، چنانچہ وہ فرمائے گا ۔ تب تم یہیں ٹھہرو ۔ فرمایا : پھر اس سے کہا جا ئے گا ۔ اب تم تمھارے خلاف اپنا گواہ لائیں گے ۔ وہ دل میں سوچے گا میرے خلاف کون گواہی دے گا ۔ ؟پھر اس کے منہ پر مہر لگادی جا ئے گیاور اس کی ران گوشت اور ہڈیوں سے کہا جائے گا ۔ بولو تو اس کی ران اس کا گوشت اور اس کی ہڈیاں اس کے عمل کے متعلق بتائیں گی ۔ یہ ( اس لیے ) کہا جا ئے گا کہ وہ ( اللہ ) اس کی ذات سے اس کا عذر دور کردے ۔ اور وہ منافق ہو گا اور وہی شخص ہو گا جس پر اللہ تعالیٰ سخت ناراض ہو گا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 7439,
			"arabicnumber": "2969",
			"text": "حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے پاس ( بیٹھے ہوئے ) تھے کہ آپ ہنس پڑے پھر آپ نے پوچھا : \" کیا تمھیں یہ معلوم ہے کہ میں کس بات پر ہنس رہا ہو ں ؟ \" ہم نے عرض کی اللہ اور اس کا رسول اللہ صلی اللہ علیہ وسلم زیادہ جاننے والے ہیں ۔ آپ نے فرمایا : \" مجھے بندے کی اپنے رب کے ساتھ کی کئی بات پر ہنسی آتی ہے وہ کہے گا ۔ اے میرے رب!کیا تونے مجھے ظلم سے پناہ نہیں دی؟آپ صلی اللہ علیہ وسلم نے کہا : وہ فرمائے گا ۔ کیوں نہیں !فرمایا بندہ کہے گا میں اپنے خلاف اپنی طرف کے گواہ کے سوا اور کسی ( کی گواہی ) کو جائز قرار نہیں دیتا ۔ تو وہ فرمائے گا آج تم اپنے خلاف بطور گواہ خود کافی ہواور کراماً کا تبین بھی گواہ ہیں چنانچہ اس کے منہ پر مہرلگادی جائے گی ۔ اور اس کے ( اپنے ) اعضاء سے کہا جائے گا ۔ بولو ، فرمایا : تو وہ اس کے اعمال کے بارے میں بتائیں گے پھر اسے اور ( اس کے اعمال کے بارے میں بتائیں گے پھر اسے اور ( اس کے اعضاء کے ) بولنے کو اکیلا چھوڑ دیا جا ئے گا ۔ فرمایا : تو ( ان کی گواہی سن کر ) وہ کہے گا دورہوجاؤ ، میں تمھاری طرف سے ( دوسروں کے ساتھ ) لڑا کرتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 7440,
			"arabicnumber": "1055.02",
			"text": "ابو زرعہ نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے ( دعا کرتے ہوئے ) فرمایا : \" اے اللہ !محمد ( صلی اللہ علیہ وسلم ) کے گھروالوں کے رزق کو زندگی برقرار رکھنے جتنا کردے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 7441,
			"arabicnumber": "1055.03",
			"text": "ابو بکر بن ابی شیبہ عمروناقد زہیر بن حرب اور ابو کریب نے کہا : ہمیں وکیع نے حدیث بیان کی کہا : ہمیں اعمش نے عمار ہ بن قعقاع سے حدیث بیان کی انھوں نے ابو زرعہ سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے دعا کی : اے اللہ !آل محمد کا رزق زندگی برقرار رکھنے جتنا کردے ۔ \"\" اور عمرو کی روایت میں ہے : \"\" اے اللہ! ( آل محمدکو زندگی برقرار رکھنے جتنا ) رزق دے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 7442,
			"arabicnumber": "1055.04",
			"text": "ابو اسامہ نے کہا : میں نے اعمش سے سنا انھوں نے عمارہ بن قعقاع سے اسی سند کے ساتھ روایت کی اور کہا : \" بقدرکفایت ( کردے ۔)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 7443,
			"arabicnumber": "2970.01",
			"text": "منصور نے ابراہیم سے انھوں نے اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : محمد صلی اللہ علیہ وسلم کے گھر والوں نے جب سے آپ مدینہ آئے آپ کی وفات تک کبھی تین راتیں مسلسل گندم کی روٹی سیرہو کرنہیں کھائی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 7444,
			"arabicnumber": "2970.02",
			"text": "اعمش نے ابراہیم سے انھوں نے اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہا : رسول اللہ نے کبھی متواتر تین دن سیر ہو کر گندم کی روٹی نہیں کھائی یہاں تک کہ آپ اپنی راہ پر روانہ ہو گئے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 7445,
			"arabicnumber": "2970.03",
			"text": "عبد الرحمان بن یزید نے ہمیں اسود سے حدیث بیان کی انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نےکہا : محمد صلی اللہ علیہ وسلم کے گھر والوں نے کبھی دودن متواتر جوکی روٹی پیٹ بھر کر نہیں کھائی یہاں تک کہ رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 7446,
			"arabicnumber": "2970.04",
			"text": "عابس نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہا : رسول اللہ صلی اللہ علیہ وسلم کے گھر والوں نے تین دن سے زیادہ کبھی سیر ہو کر گندم کی روٹی نہیں کھا ئی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 7464,
			"arabicnumber": "2980.01",
			"text": "عبد اللہ بن دینار نے حضرت عبد اللہ بن عمرو رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے اصحاب حجرکے متعلق فرمایا : \" ان عذاب دیے گئے لوگوں کے ہاں ( ان کے گھروں میں داخل نہ ہو نا مگر اس صورت میں کہ تم ( اللہ کےغضب کے ڈرسے ) رورہے ہو ۔ اگر تم رو نہیں رہے ہوتو ان کے ہاں داخل نہ ہونا ایسا نہ ہو کہ تم پر بھی وہی عذاب آجا ئے جو ان پر آیاتھا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 7465,
			"arabicnumber": "2980.02",
			"text": "سالم بن عبد اللہ نے کہا کہ حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ حجر ( قوم ثمود کی اجڑی ہوئی بستی ) کے پاس سے گزرے تو رسول اللہ صلی اللہ علیہ وسلم نے ہم سے فرمایا : \" جن لوگوں نے اپنے آپ پر ظلم کیا ہے ان کی رہائش گا ہوں میں داخل نہ ہونا مگر اس طرح کہ تم رورہے ہو ۔ ڈرہے کہ تمھیں بھی وہی عذاب نہ آئےجس نے انھیں آلیا تھا \" پھر آپ نے زور سے سواری کو ہانکا رفتار تیز کی یہاں تک کہ اس جگہ کو پیچھے چھوڑ دیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 7466,
			"arabicnumber": "2981.01",
			"text": "شعیب بن اسحٰق نے کہا : ہمیں عبید اللہ نے نافع سے خبر دی انھیں حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ ( سفر کرنے والے لوگ سرزمین ثمود حجر میں اتر گئے اور وہاں کے کنوؤں سے پانی حاصل کیا اور اس کے ساتھ آٹا ( بھی ) گوندھ لیا ۔ رسول اللہ صلی اللہ علیہ وسلم نے انھیں حکم دیاکہ انھوں نے جو پانی بھراہے وہ بہادیں اورگندھا ہوا آٹا اونٹوں کو کھلا دیں اور ان سے کہا : کہ وہ اس کنویں سے پانی حاصل کریں جہاں ( حضرت صالح رضی اللہ تعالیٰ عنہ کی ) اونٹنی پانی پینے کے لیے آیا کرتی تھی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 7467,
			"arabicnumber": "2981.02",
			"text": "انس بن عیاض نے کہا : مجھے عبید اللہ نے اسی سند کے ساتھ اسی کے مانند روایت کی ، مگر انھوں نے ( الفاظ کی تبدیلی سے ) کہا : فاستقوا من بئارها واعتجنوا به ( معنی میں کوئی فرق نہیں ۔)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 7468,
			"arabicnumber": "2982",
			"text": "عبد اللہ بن مسلمہ بن قعنب نے ہمیں حدیث بیان کی ، کہا : ہمیں امام مالک رحمۃ اللہ علیہ نے ثور بن زید سے حدیث بیان کی ، انھوں نے ابو غیث سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" بیوہ اورمسکین کے لیے محنت کرنے والا اللہ کی راہ میں جہاد کرنے والے کی طرح ہے ۔ اور میرا ( عبد اللہ بن مسلمہ کا ) خیال ہے کہ انھوں ( مالک رحمۃ اللہ علیہ ) نے کہا : وہ ( اللہ کے سامنے ) اس قیام کرنے والے کی طرح ہے جو وقفہ کرتا ہے نہ تھکتا ہے اور اس روزے دار کی طرح ہے جو روزہ نہیں چھوڑتا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 7469,
			"arabicnumber": "2983",
			"text": "اسحٰق بن عیسیٰ نے کہا : ہمیں امام مالک رحمۃ اللہ علیہ نےثور بن یزید سے حدیث بیان کی انھوں نے کہا : میں نے ابو غیث کو حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے ہوئے سنا انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یتیم کی پرورش کرنے والا اس کا اپنا ( رشتہ دار ) ہو یا غیر ہو میں اور وہ جنت میں اس طرح ہوں گے ۔ \" پھر امام مالک رحمۃ اللہ علیہ نے انگشت شہادت اور درمیان انگلی ( کو ملاکر اس ) کے ساتھ اشارہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 7470,
			"arabicnumber": "533.03",
			"text": "ہارون بن سعید ایلی اور احمد بن عیسیٰ نے مجھے حدیث بیان کی ، دونوں نے کہا : ہمیں ( عبد اللہ ) ابن وہب نے حدیث بیان کی ، کہا : مجھے عمرو بن حارث نے بتایا کہ بکیر نے انھیں حدیث بیان کی ، انھیں عاصم بن عمربن قتادہ نے حدیث بیان کی کہ انھوں نے عبید اللہ خولانی کو بیان کرتے ہوئے سناکہ کہ انھوں نے حضرت عثمان بن عفان رضی اللہ تعالیٰ عنہ سے جب رسول اللہ صلی اللہ علیہ وسلم کی مسجد کی تعمیر ( نو ) کے وقت لوگوں نے ان کو باتیں کیں سنا ( وہ کہہ رہے تھے ) تم لوگوں نے بہت باتیں کی ہیں جبکہ میں نے رسول اللہ صلی اللہ علیہ وسلم کوفرماتے ہوئے سناتھا : \" جس نے مسجد کی تعمیر کی ۔ بکیر نے کہا : میراخیال ہے کہ انھوں ( عاصم ) نے یہ جملہ بھی کہا : ۔ اس سے وہ اللہ کی رضا چاہتا ہے تو اللہ اس کے لیے جنت میں اس جیسا ( گھر ) بنائے گا ۔ اور ہارون کی روایت میں ہے : \" اللہ تعالیٰ اس کے لیے جنت میں گھر بنائے گا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 7471,
			"arabicnumber": "533.04",
			"text": "ضحاک بن مخلد نے ہمیں حدیث بیان کی ، کہا : ہمیں عبد الحمید بن جعفر نے خبر دی کہا : ہمیں میرے والد نے محمود بن لبید سے حدیث بیان کی کہ حضرت عثمان بن عفان رضی اللہ تعالیٰ عنہ نے مسجد بنانے کا ارداہ کیا تو لوگوں نے اس کو ناپسند کیا ۔ وہ چاہتے تھے کہ اس ( مسجد ) کو اس کی اصل حالت پر رہنے دیا جائے تو انھوں ( عثمان رضی اللہ تعالیٰ عنہ ) نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" جس نے اللہ کے لیے مسجد بنائی اللہ تعالیٰ اس کے لیے جنت میں اس کے مانند گھر بنائے گا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 7472,
			"arabicnumber": "533.05",
			"text": "ابو بکر حنفی اور عبدالملک بن صباح دونوں نے عبد الحمید بن جعفر سے اسی سند کے ساتھ خبر دی مگر ان دونوں کی حدیث میں ہے ۔ \" اللہ اس کے لیے جنت میں گھربنائے گا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 7473,
			"arabicnumber": "2984.01",
			"text": "یزید بن ہارون نے ہمیں حدیث بیان کی ، کہا : ہمیں عبد العزیز بن ابو سلمہ نے وہب بن کیسان سے خبر دی انھوں نے عبید بن عمیر لیثی سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور نھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" ایک دفعہ ایک شخص زمین میں ایک صحرائی ٹکڑے پر کھڑاتھا ۔ اس نے ایک بادل میں آوازسنی : \" فلاں کے باغ کو سیراب کرو ۔ \" وہ بادل ایک جانب بنا اور ایک پتھریلی زمین میں اپناپانی انڈیل دیا ۔ پانی کے بہاؤوالی ندیوں میں سے ایک ندی نے وہ ساراپانی اپنے اندر لے لیا ۔ وہ شخص پانی کے پیچھے پیچھے چل پڑا تو وہاں ایک آدمی اپنے باغ میں کھڑا اپنے کدال سے پانی کا رخ ( اپنے باغ کی طرف ) پھیررہا ہے ۔ اس نے اس سے کہا : اللہ کےبندے !تمھارا نام کیا ہے؟اس نے کہا : فلاں وہی نام جو اس نے بادل میں سنا تھا ۔ اس ( آدمی ) نے اس سے کہا : اللہ کے بندے!تم نے مجھ سے میرانام کیوں پوچھا ہے؟اس نے کہا : میں نے اس بادل میں جس کا یہ پانی ہے ( کسی کو ) یہ کہتے سناتھا ۔ فلاں کے باغ کو سیراب کرو تمھارا نام لیا تھا ۔ تم اس میں کیا کرتے ہو ۔ \" اس نے جواب دیا تم نے یہ بات کہہ دی ہے تو میں ( تمھیں بتادیتا ہوں ) اس باغ سے جو کچھ حاصل ہوتا ہےمیں اس پر نظر ڈال کر اس کا ایک تہائی حصہ صدقہ کردیتا ہوں ایک تہائی میں اور میرے گھروالے کھاتے ہیں ۔ اور ایک تہائی اسی ( باغ کی دیکھ بھال ) میں لگادیتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 7474,
			"arabicnumber": "2984.02",
			"text": "ابو داود نے ہمیں خبر دی ہمیں عبد العزیز بن ابی سلمہ نے حدیث بیان کی انھوں نےکہا : ہمیں وہب بن کیسان نے اسی سند کے ساتھ حدیث بیان کی مگر انھوں نے ( اس طرح ) کہا : اس کا ایک تہائی مسکینوں سوال کرنے والوں اور مسافر کے لیے مختص کردیتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 7475,
			"arabicnumber": "2985",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے ارشاد فرمایا کہ شریک بنائے جانے والوں میں سب سے زیادہ میں شراکت سے مستغنی ہوں ۔ جس شخص نے بھی کوئی عمل کیا اور اس میں میرے ساتھ کسی اور کوشریک کیا تو میں اسے اس کے شرک کے ساتھ اکیلاچھوڑدیتا ہوں ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 7476,
			"arabicnumber": "2986",
			"text": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص ( اپناعمل لوگوں کو ) سناتا ہے اللہ اس کے بارے میں ( ہونے والا فیصلہ ) لوگوں کو سنائے گا ( اور اسے رسواکرے گا ) اور جو ( لوگوں کو ) دکھاتا پھرتا ہے اللہ تعالیٰ اس کے بارے میں لوگوں کو دکھا دے گا ۔ ( کہ اس کا انجام کیا ہوا)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 7477,
			"arabicnumber": "2987.01",
			"text": "وکیع نے سفیان سے اور انھوں نے سلمہ بن کُہیل روایت کی ۔ انھوں نے کہا : میں نے حضرت جندب علقی رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص ( لوگوں کو ) سناتاہے اللہ تعالیٰ اس کے بارے میں ( سب کو ) سنوائےگا اور جو ( اپناعمل ) لوگوں کو دکھاتا ہے اللہ تعالیٰ اس کے بارے میں لوگوں کو دکھائےگا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 7478,
			"arabicnumber": "2987.02",
			"text": "ملائی نے کہا : ہمیں سفیان نے اسی سند کے ساتھ حدیث کی ، اور مزید کہا : اور میں ( سلمہ بن کُہیل ) نے ( اس حدیث میں ) ان کے سواکسی کو ( صراحت سے ) یہ کہتے ہوئے نہیں سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 7479,
			"arabicnumber": "2987.03",
			"text": "سعید بن عمر واشعشی نے کہا : ہمیں سفیان نے ولید بن حرب ۔ سعیدنے کہا : میراخیال ہے انھوں ( سفیان ) نے کہا : ( ولید ) ابن حارث بن ابی موسیٰ ۔ سے روایت کی انھوں نے کہا : میں نے سلمہ بن کُہیل سے سنا انھوں نے کہا : میں نے حضرت جندب رضی اللہ تعالیٰ عنہ کے علاوہ اور کسی کو یہ کہتے ہوئے نہیں سنا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سناہے ، وہ کہتے ہیں ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا ( آگے ) جس طرح ( سفیان ) چوری کی حدیث ( 7478 ) میں ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 7480,
			"arabicnumber": "2987.04",
			"text": "اور یہی حدیث ہمیں ابن ابی عمر نے بیان کی کہا : ہمیں سفیان نے حدیث بیان کی کہا : ہمیں سچے امانتدار شخص ولید بن حرب نے اسی سند کے ساتھ روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 7481,
			"arabicnumber": "2988.01",
			"text": "بکر بن مضر نے ابن باد سے انھوں نے محمد بن ابرا ہیم سے انھوں نے عیسیٰ بن طلحہ سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" ( بعض اوقات ) بندہ کوئی کلمہ کہہ دیتا ہے جس کی وجہ سے دوزخ میں اس سے بھی زیادہ دور اتر جاتا ہےجتنی دوری مشرق اور مغرب کے درمیان ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 7482,
			"arabicnumber": "2988.02",
			"text": "عبد العزیز دراوردی نے یزید بن رضی اللہ تعالیٰ عنہ سے انھو ں نے محمد بن ابرا ہیم سے انھوں نے عیسیٰ بن طلحہ سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بندہ کوئی ایسا کلمہ کہہ دیتا ہے کہ اس کو واضح طور پر پتہ نہیں ہو تا کہ اس میں کیا ہے ، اس کی وجہ سے وہ دوزخ میں اس سے زیادہ دور جاگرتا ہے جتنی دوری مشرق اور مغرب کے درمیان ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 7483,
			"arabicnumber": "2989.01",
			"text": "ابو معاویہ نے کہا : ہمیں اعمش نے شقیق سے حدیث بیان کی ، انھوں نے حضرت اسامہ بن یزید رضی اللہ تعالیٰ عنہ سے روایت کی کہا : کہ ان سے کہاگیا : تم کیوں حضرت عثمان رضی اللہ تعالیٰ عنہ کے پاس جاکر بات نہیں کرتے ؟ ( کہ وہ لوگوں کی مخالفت کا ازالہ کریں ) تو انھوں نے کہا : کیا تم سمجھتے ہو کہ میں تمھیں نہیں سنواتا تو میں ان سے بات نہیں کرتا؟اللہ کی قسم!میں نے ان سے بات کی جو میرے اور ان کے درمیان تھی اس کے بغیرکہ میں کسی ایسی بات کا آغاز کروں جس میں سب سے پہلے دروازہ کھولنے والا میں بنوں ۔ میں کسی سے جو مجھ پر امیر ہویہ نہیں کہتا کہ وہ سب انسانوں میں سے بہتر ہے ۔ اس بات کے بعد جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی ، آپ فرما رہے تھے ۔ \" قیامت کے دن ایک آدمی کو لایا جائے گا اور آگ میں پھینک دیا جا ئے گا ، اس کے پیٹ کی انتڑیاں باہر نکل پڑیں گی ۔ وہ ان کے گرد اس طرح چکر لگائے گا جس طرح گدھا چکی کے گرد لگاتا ہے ۔ اہل جہنم اس کے پاس جمع ہو جا ئیں گے اور اس سے کہیں گے فلاں!تمھاراے ساتھ کیاہوا؟کیا تو نیکیوں کی تلقین اور برائیوں سے منع نہیں کیا کرتا تھا؟ وہ کہے گا ایسا ہی تھا ، میں نیکیوں کا حکم دیتا تھا خود ( نیکی کے کام ) نہیں کرتا تھا اور برائیوں سے روکتا تھا اور خود ان کا ارتکاب کرتاتھا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 7484,
			"arabicnumber": "2989.02",
			"text": "جریر نے اعمش سے اور انھوں نے ابو وائل سے روایت کی کہا : ہم حضرت اسامہ بن زید رضی اللہ تعالیٰ عنہ کے پاس تھے کہ ایک آدمی نے کہا : آپ کو کیا چیز اس سے مانع ہے کہ آپ حضرت عثمان رضی اللہ تعالیٰ عنہ کے پاس جائیں اور جووہ کررہے ہیں اس کے بارے میں ان سے بات کریں؟اس کے بعد اسی ( سابقہ حدیث ) کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 7485,
			"arabicnumber": "2990",
			"text": "سالم نے کہا : میں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا ، کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔ \" میری تمام امت کو ( گناہوں پر ) معافی ملے گی ۔ سوائے ان لوگوں کے جو ( اپنے گناہوں کا ) اعلان کرنے والے ہیں ۔ اعلان میں یہ ہے کہ بندہ رات کو ایک کام کرے پھر صبح ہو تو اللہ نے اس کا پردہرکھا ہوا ہو اور وہ خود کہے اے فلاں !میں نے پچھلی رات ایسا ایساکام کیا حالانکہ اس نے رات گزاردی اس کے رب نے اس پر پردہ ڈالے رکھا اور وہ صبح کرتا ہے تو وہ اپنے رب کا ڈالا ہوا پردہ خود اتاردیتا ہے ۔ \" زہیر نے ( اجهاریعنی اعلان کے بجائے ) وَإِنَّ مِنَ الْحِجَارَةِ ( یہ بڑی بے حیائی کی بات ہے ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 7486,
			"arabicnumber": "2991.01",
			"text": "حفص بن غیاث نے سلیمان تیمی سے اور انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم کے پاس دو آدمیوں کو چھینک آئی تو آپ نے ایک آدمی کو چھینک کی دعانہ دی ۔ آپ نے جس کو چھینک کی دعانہ دی تھی اس نے کہا : فلاں کو چھینک آئی تو آپ نے اس پر اسے دعادی اور مجھے چھینک آئی تو آپ نے مجھے اس پر دعا نہ دی آپ صلی اللہ علیہ وسلم نے فرمایا : \" اس نے الحمد اللہ کہا تھا اور تم نے الحمداللہ نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 7487,
			"arabicnumber": "2991.02",
			"text": "ابو خالد احمر نے سلیمان تیمی سے ‘ انہوں نے حضرت انس ؓ سے اور انہوں نے نبیﷺ سے اسی کے مطابق روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 7488,
			"arabicnumber": "2992",
			"text": "ابو بردہ سے روایت ہے کہا : میں ( اپنے والد ) حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ کے پاس گیا وہ اس وقت حضرت فضل بن عباس رضی اللہ تعالیٰ عنہ کی بیٹی کے گھر تھے ۔ مجھے چھینک آئی تو انھوں نے جواب میں دعانہیں دی اور اس ( فضل رضی اللہ تعالیٰ عنہ کی بیٹی ) کو چھینک آئی تو اس کو انھوں نے جواب میں دعا دی میں اپنی والدہ کے پاس گیا اور انھیں بتا یا جب وہ ( میرے والد ) ان ( میری والدہ ) کے پاس آئے تو انھوں نے کہا : تمھارے پاس میرے بیٹے کو چھینک آئی تو تم نے جواب میں دعا نہیں دی ۔ اور ان ( فضل بن عباس رضی اللہ تعالیٰ عنہ کی بیٹی ) کو چھینک آئی تو تم نے جواب میں دعا دی ۔ انھوں نے کہا : تمھارے بیٹے کو چھینک آئی تو اس نے الحمد اللہ نہیں کہا : اس لیےمیں نے جواب نہیں دیا اس ( خاتون ) کو چھینک آئی تو انھوں نے الحمد اللہ کہا : اس لیے میں نےان کو جواب میں دعا دی ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا : آپ فرماتے تھے : \" جب تم میں سےکسی کو چھینک آئے اور وہ الحمد اللہ کہے تو اس کو جواب میں دعا دواور اگر وہ الحمد اللہ نہ کہے تو دعا نہ دو ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 7489,
			"arabicnumber": "2993",
			"text": "ایاس بن سلمہ بن اکوع نے مجھے حدیث بیان کی کہ ان کے والد نے ان سے حدیث بیان کی ، انھوں نے نبی صلی اللہ علیہ وسلم سے سنا : آپ کے پاس ایک شخص کو چھینک آئی تو آپ نے اسے دعا دی يَرْحَمُكَ اللَّهُ اللہ تم پر رحم فرمائے ۔ \" اسے دوسری چھینک آئی تو آپ نے فرمایا \" اس شخص کو زکام ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 7490,
			"arabicnumber": "2994",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جما ئی شیطان کی طرف سے ہے لہٰذاتم میں سے جب کسی شخص کو جمائی آئے تو وہ جہاں تک اس کو روک سکے روکے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 7491,
			"arabicnumber": "2995.01",
			"text": "بشر بن مفضل نے کہا : ہمیں سہیل بن ابی صالح نے حدیث بیان کی انھوں نے کہا : میں نے ابو سعید خدری رضی اللہ تعالیٰ عنہ کے بیٹے ( عبدالرحمان ) سے سنا وہ میرے والد کو اپنے والد سے حدیث بیان کر رہے تھے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی شخص کو جمائی آئے تو وہ اپنے منہ پر ہاتھ رکھ کر اس کو روکے کیونکہ ( ایسا نہ کرنے سے ) شیطان اندر داخل ہو تا ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 7492,
			"arabicnumber": "2995.02",
			"text": "عبد العزیز نے سہیل سے انھوں نے عبد الرحمان بن ابی سعید سے اور انھوں نے اپنے والد سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی کوجمائی آئے تو وہ اسے اپنے ہاتھ سے روکے کیونکہ شیطان اندر داخل ہوتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 7493,
			"arabicnumber": "2995.03",
			"text": "سفیان نے سہیل بن ابی صالح سے انھوں نے حضرت ابوسعید خدری رضی اللہ تعالیٰ عنہ کے بیٹے سے اور انھوں نے اپنے والد سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کسی شخص کو نماز میں جمائی آئے تو وہ جتنا اس کے بس میں ہواس کو روکے کیونکہ شیطان اندر داخل ہوتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 7494,
			"arabicnumber": "2995.04",
			"text": "جریر نے سہیل سے ، انھوں نے اپنے والد اور حضرت ابوسعید رضی اللہ تعالیٰ عنہ کے بیٹے سے ، انھوں نے حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ ( آگے ) بشراور عبدالعزیز کی حدیث کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 7495,
			"arabicnumber": "2996",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" فرشتوں کو نور سے پیدا کیا گیا ہے اور جنوں کو آگ کے شعلے سے اورآدم علیہ السلام کو اس ( مادے ) سے پیدا کیا گیا ہے جس کو تمہارے لئے جان کیا گیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 7496,
			"arabicnumber": "2997.01",
			"text": "اسحاق بن ابراہیم ، محمد بن مثنیٰ عنزی اور محمد بن عبداللہ رزی نے ہمیں ثقفی سے حدیث بیان کی ، الفاظ ابن مثنیٰ کے ہیں ۔ کہا : ہمیں عبدالوہاب نے حدیث بیان کی ، کہا : ہمیں خالد نے محمد بن سیرین سے حدیث بیان کی ، انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" بنی اسرائیل کی ایک امت گم ہوگئی تھی ، معلوم نہیں کہ وہ کہاں ہے اور مجھے اس کے سوا اور کوئی بات نظر نہیں آئی کہ وہ لوگ ( یہی ) چوہے ہیں ۔ ( انھوں نے مسخ ہوکریہ شکل اختیار کرلی ہے ) تم دیکھتے نہیں کہ جب ان کے سامنے اونٹنی کا دودھ رکھا جائے تو ( بنی اسرائیل کی طرح ) وہ اس کو نہیں پیتے ۔ اگر ان کے لئے بکری کا دودھ رکھا جائے تو وہ اسے پی لیتے ہیں ۔ \"\" حضرت ابو ہریرۃ نے کہا : میں نے یہ حدیث کعب ( احبار ) کو سنائی تو انھوں نے کہا : کیا تم نے رسول اللہ صلی اللہ علیہ وسلم سے سناتھا؟میں نے کہا : انھوں نے باربار یہی کہا تو میں نے کہا : ( نہیں تو ) کیا میں تورات پڑھتا ہوں ( کہ وہاں سے بیان کروں گا؟ ) اسحاق نے اپنی روایت میں کہا : \"\" ہم نہیں جانتے ان کا کیابنا؟",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 7497,
			"arabicnumber": "2997.02",
			"text": "ہشام نے محمد ( بن سیرین ) سے اور انھوں نے حضرت ابوہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : چوہیا مسخ شدہ ہے اور اس کی دلیل یہ ہے کہ اس کے سامنے بکری کا دودھ رکھا جائے تو یہ پی لیتی ہے اور اس کے سامنے اونٹنی کا دودھ رکھا جائے تو یہ اس کو منہ تک نہیں لگاتی ۔ \" تو کعب ( احبار ) نے ان سے کہا : آپ نے یہ بات رسول اللہ صلی اللہ علیہ وسلم سے سنی تھی؟حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے کہا : تو کیا مجھ پرتورات نازل ہوئی تھی؟",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 7500,
			"arabicnumber": "2999",
			"text": "حضرت صہیب رضی اللہ تعالیٰ عنہ سے روایت ہے ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مومن کا معاملہ عجیب ہے ۔ اس کا ہرمعاملہ اس کے لیے بھلائی کا ہے ۔ اور یہ بات مومن کے سوا کسی اور کومیسر نہیں ۔ اسے خوشی اور خوشحالی ملے توشکر کرتا ہے ۔ اور یہ اس کے لیے اچھا ہوتا ہے اور اگر اسے کوئی نقصان پہنچے تو ( اللہ کی رضا کے لیے ) صبر کر تا ہے ، یہ ( ابھی ) اس کے لیے بھلائی ہوتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 7501,
			"arabicnumber": "3000.01",
			"text": "یزید بن زریع نے خالد حذاء سے ، انھوں نے عبدالرحمان بن ابی بکرہ سے اور انھوں نے اپنے والد سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم کے سامنے ایک آدمی نے دوسرے آدمی کی تعریف کی ، کہا : تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم پر افسوس ہے!تم نے اپنے ساتھ کی گردن کاٹ دی ، اپنے ساتھی کی گردن کاٹ دی ۔ \" کئی بار کہا : ( پھر فرمایا : ) تم میں سے کسی شخص نے لامحالہ اپنے ساتھی کی تعریف کرنی ہوتو اس طرح کہے : میں فلاں کو ایسا سمجھتا ہوں ، اصلیت کو جاننے والا اللہ ہے ۔ اورمیں اللہ ( کے علم ) کے مقابلے میں کسی کی خوبی بیان نہیں کررہا ، میں اسے ( ایسا ) سمجھتا ہوں ۔ اگر وہ واقعی اس خوبی کو جانتا ہے ( تو کہے! ) ۔ وہ اس طرح ( کی خوبی رکھتا ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 7502,
			"arabicnumber": "3000.02",
			"text": "محمد بن جعفر غندر نے کہا : ہمیں شعبہ نے خالد حذاء سے ، حدیث بیان کی ، انھوں نے عبدالرحمان بن ابی بکرہ سے ، انھوں نے ا پنے والد سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم کے سامنے ایک آدمی کا ذکر ہوا تو ایک شخص کہنے لگا؛اللہ کے رسول صلی اللہ علیہ وسلم !کوئی آدمی رسول اللہ صلی اللہ علیہ وسلم کے بعد فلاں فلاں بات میں اس ( آدمی ) سے افضل نہیں ۔ رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" تم پر افسوس!تم نے اپنے ساتھی کی گر دن کاٹ دی ۔ \" آپ بار بار یہ کہتے رہے ، پھر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اگر تم میں سے کسی نے لا محالہ اپنے بھائی کی تعریف کرنی ہوتو اس طرح کہے : میں سمجھتا ہوں فلاں ( اس طرح ہے ) اگر وہ واقعی اس کو ایسا سمجھتا ہو ( پھر کہے ) اور میں اللہ ( کے علم ) کے مقابلے میں کسی کی خوبی بیان نہیں کرتا ( جس سے یہ ثابت ہوکہ میں نعوذباللہ ، اللہ کے علم کو جھٹلارہا ہوں ۔)",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 7503,
			"arabicnumber": "3000.03",
			"text": "ہاشم بن قاسم اور شبابہ بن سوار دونوں نے شعبہ سے اسی سند کے ساتھ یزید بن زریع کی حدیث کے مانند بیان کیا ، ان دونوں کی روایتوں میں یہ نہیں کہ ا س شخص نے کہا : \" رسول اللہ صلی اللہ علیہ وسلم کے بعد کوئی شخص اس ( آدمی ) سے افضل نہیں ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 7504,
			"arabicnumber": "3001",
			"text": "حضرت ابو موسیٰ ‌رضی ‌اللہ ‌عنہ ‌ سے روایت ہے ، کہا : نبی کریم صلی اللہ علیہ وسلم نے ایک شخص کو سنا ، وہ کسی آدمی کی تعریف کررہا تھا ، تعریف میں اسے بہت بڑھا چڑھا رہا تھا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم لوگوں نے اس کو ہلاک کرڈالا یا ( فرمایا : ) تم لوگوں نے اس آدمی کی کمرتوڑ دی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 7505,
			"arabicnumber": "3002.01",
			"text": "ابو معمر سے روایت ہے کہ ایک شخص کھڑاہوا امراء میں سے کسی امیر کی تعریف کرنے لگا توحضرت مقداد رضی اللہ تعالیٰ عنہ اس شخص پر مٹی ڈالنے لگے ، اور کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں یہ حکم دیاتھا کہ ہم مدح سراؤں کے منہ میں مٹی ڈالیں ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 7506,
			"arabicnumber": "3002.02",
			"text": "شعبہ نے منصور سے ، انھوں نے ابراہیم ( بن یزید نخعی ) سے ، انھوں نے ہمام بن حارث سے روایت کی کہ ایک شخص حضرت عثمان رضی اللہ تعالیٰ عنہ کی تعریف کرنے لگا تو حضرت مقدار رضی اللہ تعالیٰ عنہ نے اس کا رخ کیا ، اپنے گھٹنوں پر بیٹھے ، وہ بھاری بھرکم ( جسم کے مالک ) تھے اور اس آدمی کے چہرے پر کنکریاں پھینکنے لگے ۔ حضرت عثمان رضی اللہ تعالیٰ عنہ نے ان سے کہا : آپ کیا کررہے ہیں؟انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" جب تم مدح سراؤں کو دیکھو تو ان کے چہروں میں مٹی ڈالو ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 7507,
			"arabicnumber": "3002.03",
			"text": "سفیان ثوری نے منصور اور اعمش سے ، انھوں نے ابراہیم سے ، انھوں نے ہمام سے ، انھوں نے حضرت مقداد رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی ( حدیث ) کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 7508,
			"arabicnumber": "3003",
			"text": "نافع سے روایت ہے ، حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے ان سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" میں نے خواب میں دیکھا کہ میں مسواک کررہا ہوں ، دو آدمیوں نے مجھے اپنی اپنی جانب کھینچا ، ان میں سے ایک دوسرے سے بڑا تھا ، میں نے مسواک چھوٹے کو پکڑا دی تو مجھ سے کہا گیا : بڑے کو دیں ، چنانچہ میں نے وہ بڑے کے حوالے کردی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 7509,
			"arabicnumber": "2493.02",
			"text": "ہشام نے اپنے والد ( عروہ ) سے روایت کی ، انھوں نے کہا : حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ احادیث بیان کررہے تھے اور آواز لگارہے تھے : اے حجرے کے مالک!سنیے ، اے حجرے کے مالک!سنیے ، اس وقت حضرت عائشہ رضی اللہ تعالیٰ عنہا ( اندر ) نماز پڑھ رہی تھیں ۔ انھوں نے جب نماز مکمل کی تو عروہ سے کہا : تم نے ابھی اسے اور اس کی کہی ہوئی بات نہیں سنی؟نبی کریم صلی اللہ علیہ وسلم ( ایک وقت میں ) ایک بات ( حدیث ) ارشاد فرماتے تھے ، اگر کوئی گننے والا اسے گنتا تو گن سکتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 7510,
			"arabicnumber": "3004",
			"text": "ہداب بن خالد ازدی نے کہا : ہمیں ہمام نے زید بن اسلم سے حدیث بیان کی ، انھوں نے عطاء بن یسار سے اور انھوں نے حضرت ابو سعیدخدری رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مجھ سے ( سنی ہوئی باتیں ) مت لکھو ، جس نے قرآن مجید ( کے ساتھ اس کے علاوہ میری کوئی بات ( حدیث ) لکھی وہ اس کو مٹا دے ، البتہ میری حدیث ( یاد رکھ کرآگے ) بیان کرو ، اس میں کوئی حرج نہیں ، اور جس نے مجھ پر ۔ ہمام نے کہا : میرا خیال ہے کہ انھوں ( زید بن اسلم ) نے کہا : جان بوجھ کر جھوٹ باندھاوہ ا پنا ٹھکانا جہنم میں بنالے ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 7511,
			"arabicnumber": "3005",
			"text": "سیدنا صہیب رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : تم سے پہلے لوگوں میں ایک بادشاہ تھا اور اس کا ایک جادوگر تھا ۔ جب وہ جادوگر بوڑھا ہو گیا تو بادشاہ سے بولا کہ میں بوڑھا ہو گیا ہوں ، میرے پاس کوئی لڑکا بھیج کہ میں اس کو جادو سکھلاؤں ۔ بادشاہ نے اس کے پاس ایک لڑکا بھیجا ، وہ اس کو جادو سکھلاتا تھا ۔ اس لڑکے کی آمدورفت کی راہ میں ایک راہب تھا ( عیسائی درویش یعنی پادری تارک الدنیا ) ، وہ لڑکا اس کے پاس بیٹھا اور اس کا کلام سنا تو اسے اس کی باتیں اچھی لگیں ۔ اب جادوگر کے پاس جاتا تو راہب کی طرف سے ہو کر نکلتا اور اس کے پاس بیٹھتا ، پھر جب جادوگر کے پاس جاتا تو جادوگر اس کو ( دیر سے آنے کی وجہ سے ) مارتا ۔ آخر لڑکے نے جادوگر کے مارنے کا راہب سے گلہ کیا تو راہب نے کہا کہ جب تو جادوگر سے ڈرے ، تو یہ کہہ دیا کر کہ میرے گھر والوں نے مجھ کو روک رکھا تھا اور جب تو اپنے گھر والوں سے ڈرے ، تو کہہ دیا کر کہ جادوگر نے مجھے روک رکھا تھا ۔ اسی حالت میں وہ لڑکا رہا کہ اچانک ایک بڑے درندے پر گزرا کہ جس نے لوگوں کو آمدورفت سے روک رکھا تھا ۔ لڑکے نے کہا کہ آج میں معلوم کرتا ہوں کہ جادوگر افضل ہے یا راہب افضل ہے ۔ اس نے ایک پتھر لیا اور کہا کہ الٰہی اگر راہب کا طریقہ تجھے جادوگر کے طریقے سے زیادہ پسند ہو ، تو اس جانور کو قتل کر تاکہ لوگ گزر جائیں ۔ پھر اس کو پتھر سے مارا تو وہ جانور مر گیا اور لوگ گزرنے لگے ۔ پھر وہ لڑکا راہب کے پاس آیا اس سے یہ حال کہا تو وہ بولا کہ بیٹا تو مجھ سے بڑھ گیا ہے ، یقیناً تیرا رتبہ یہاں تک پہنچا جو میں دیکھتا ہوں اور تو عنقریب آزمایا جائے گا ۔ پھر اگر تو آزمایا جائے تو میرا نام نہ بتلانا ۔ اس لڑکے کا یہ حال تھا کہ اندھے اور کوڑھی کو اچھا کرتا اور ہر قسم کی بیماری کا علاج کرتا تھا ۔ یہ حال جب بادشاہ کے مصاحب جو کہ اندھا ہو گیا تھا سنا تو اس لڑکے کے پاس بہت سے تحفے لایا اور کہنے لگا کہ یہ سب مال تیرا ہے اگر تو مجھے اچھا کر دے ۔ لڑکے نے کہا کہ میں کسی کو اچھا نہیں کرتا ، اچھا کرنا تو اللہ تعالیٰ کا کام ہے ، اگر تو اللہ پر ایمان لائے تو میں اللہ سے دعا کروں گا تو وہ تجھے اچھا کر دے گا ۔ وہ وزیر اللہ پر ایمان لایا تو اللہ نے اس کو اچھا کر دیا ۔ وہ بادشاہ کے پاس گیا اور اس کے پاس بیٹھا جیسا کہ بیٹھا کرتا تھا ۔ بادشاہ نے کہا کہ تیری آنکھ کس نے روشن کی؟ وزیر بولا کہ میرے مالک نے ۔ بادشاہ نے کہا کہ میرے سوا تیرا مالک کون ہے؟ وزیر نے کہا کہ میرا اور تیرا مالک اللہ ہے ۔ بادشاہ نے اس کو پکڑا اور عذاب شروع کیا ، یہاں تک کہ اس نے لڑکے کا نام لے لیا ۔ وہ لڑکا بلایا گیا ۔ بادشاہ نے اس سے کہا کہ اے بیٹا تو جادو میں اس درجہ پر پہنچا کہ اندھے اور کوڑھی کو اچھا کرتا ہے اور بڑے بڑے کام کرتا ہے؟ وہ بولا کہ میں تو کسی کو اچھا نہیں کرتا بلکہ اللہ اچھا کرتا ہے ۔ بادشاہ نے اس کو پکڑا اور مارتا رہا ، یہاں تک کہ اس نے راہب کا نام بتلایا ۔ راہب پکڑ لیا گیا ۔ اس سے کہا گیا کہ اپنے دین سے پھر جا ۔ اس کے نہ ماننے پر بادشاہ نے ایک آرہ منگوایا اور راہب کی مانگ پر رکھ کر اس کو چیر ڈالا ، یہاں تک کہ دو ٹکڑے ہو کر گر پڑا ۔ پھر وہ وزیر بلایا گیا ، اس سے کہا گیا کہ تو اپنے دین سے پھر جا ، اس نے بھی نہ مانا اس کی مانگ پر بھی آرہ رکھا گیا اور چیر ڈالا یہاں تک کہ دو ٹکڑے ہو کر گر پڑا ۔ پھر وہ لڑکا بلایا گیا ، اس سے کہا کہ اپنے دین سے پلٹ جا ، اس نے بھی نہ انکار کیا ۔ نے اس کو اپنے چند ساتھیوں کے حوالے کیا اور کہا کہ اس کو فلاں پہاڑ پر لے جا کر چوٹی پر چڑھاؤ ، جب تم چوٹی پر پہنچو تو اس لڑکے سے پوچھو ، اگر وہ اپنے دین سے پھر جائے تو خیر ، نہیں تو اس کو دھکیل دو ۔ وہ اس کو لے گئے اور پہاڑ پر چڑھایا ۔ لڑکے نے دعا کی کہ الٰہی جس طرح تو چاہے مجھے ان کے شر سے بچا ۔ پہاڑ ہلا اور وہ لوگ گر پڑے ۔ وہ لڑکا بادشاہ کے پاس چلا آیا ۔ بادشاہ نے پوچھا کہ تیرے ساتھی کہاں گئے؟ اس نے کہا کہ اللہ نے مجھے ان کے شر سے بچا لیا ۔ پھر بادشاہ نے اس کو اپنے چند ساتھیوں کے حوالے کیا اور کہا کہ اس کو ایک کشتی میں دریا کے اندر لے جاؤ ، اگر اپنے دین سے پھر جائے تو خیر ، ورنہ اس کو دریا میں دھکیل دینا ۔ وہ لوگ اس کو لے گئے ۔ لڑکے نے کہا کہ الٰہی! تو مجھے جس طرح چاہے ان کے شر سے بچا لے ۔ وہ کشتی اوندھی ہو گئی اور لڑکے کے سوا سب ساتھی ڈوب گئے اور لڑکا زندہ بچ کر بادشاہ کے پاس آ گیا ۔ بادشاہ نے اس سے پوچھا کہ تیرے ساتھی کہاں گئے؟ وہ بولا کہ اللہ تعالیٰ نے مجھے ان کے شر سے بچا لیا ۔ پھر لڑکے نے بادشاہ سے کہا کہ تو مجھے اس وقت تک نہ مار سکے گا ، جب تک کہ جو طریقہ میں بتلاؤں وہ نہ کرے ۔ بادشاہ نے کہا کہ وہ کیا؟ اس نے کہا کہ تو سب لوگوں کو ایک میدان میں جمع کر کے مجھے ایک لکڑی پر سولی دے ، پھر میرے ترکش سے ایک تیر لے کر کمان کے اندر رکھ ، پھر کہہ کہ اس اللہ کے نام سے مارتا ہوں جو اس لڑکے کا مالک ہے ۔ پھر تیر مار ۔ اگر تو ایسا کرے گا تو مجھے قتل کرے گا ۔ بادشاہ نے سب لوگوں کو ایک میدان میں جمع کیا ، اس لڑکے کو درخت کے تنے پر لٹکایا ، پھر اس کے ترکش میں سے ایک تیر لیا اور تیر کو کمان کے اندر رکھ کر یہ کہتے ہوئے مارا کہ اللہ کے نام سے مارتا ہوں جو اس لڑکے کا مالک ہے ۔ وہ تیر لڑکے کی کنپٹی پر لگا ۔ اس نے اپنا ہاتھ تیر کے مقام پر رکھا اور مر گیا ۔ لوگوں نے یہ حال دیکھ کر کہا کہ ہم تو اس لڑکے کے مالک پر ایمان لائے ، ہم اس لڑکے کے مالک پر ایمان لائے ، ہم اس لڑکے کے مالک پر ایمان لائے ۔ کسی نے بادشاہ سے کہا کہ اللہ کی قسم! جس سے تو ڈرتا تھا وہی ہوا یعنی لوگ ایمان لے آئے ۔ بادشاہ نے راستوں کے نالوں پر خندقیں کھودنے کا حکم دیا ۔ پھر خندقیں کھودی گئیں اور ان میں خوب آگ بھڑکائی گئی اور کہا کہ جو شخص اس دین سے ( یعنی لڑکے کے دین سے ) نہ پھرے ، اسے ان خندقوں میں دھکیل دو ، یا اس سے کہا جائے کہ ان خندقوں میں گرے ۔ لوگوں نے ایسا ہی کیا ، یہاں تک کہ ایک عورت آئی جس کے ساتھ اس کا بچہ بھی تھا ، اس عورت نےآگ میں گرنے سے تردد کیا تو بچے نے کہا کہ اے ماں! صبر کر تو سچے دین پر ہے",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 7520,
			"arabicnumber": "3014",
			"text": "اور لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے بھوک کی شکایت کی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" عنقریب اللہ تعالیٰ تمھیں کھانا دے گا ۔ \" پھر ہم سمندر کے کنارے پہنچے ، سمندر نے جوش مارا ( ایک لہر سی آئی ) اور اس نے ایک سمندری جانور ( باہر ) پھینک دیا ، ہم نے سمندر کے کنارے پر آگ جلائی اور اس ( کے گوشت ) کو پکایا ، بھونا ، کھایا اور یہ سیر ہوگئے ( حضرت جابر نے کہا : میں اور فلاں اور فلاں ، انھوں نے پانچ آدمی گئے اس کی آنکھ کے گوشے مین گھس گئے تو کوئی ہمیں دیکھ نہیں سکتا تھا حتیٰ کہ ہم باہر نکل آئے اور ہم نے اس کی پسلیوں میں سے ایک پسلی ( ایک جانب ایک بڑا کانٹا ) لےکر اس کو کمان کی ہیت میں کھڑا کردیا ، پھر قافلے میں سب سے بڑے ( قد کے ) آدمی کو بلایا اور قافلے میں سب سے بڑے اونٹ کو اور قافلے کے سب سے بڑے پالان کو منگوایا ، شخص سر جھکا ئے بغیر اس پسلی کے نیچے داخل ہوگیا ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 7521,
			"arabicnumber": "2009.03",
			"text": "ابو اسحاق نے ہمیں حدیث بیان کی ، کہا : میں نے حضرت براء بن عازب رضی اللہ تعالیٰ عنہ کو بیان کرتے ہوئے سنا : حضرت ابو بکرصدیق رضی اللہ تعالیٰ عنہ میرے والد کے پاس ان کے گھر آئے اور ان سے ایک کجاوہ خریدا ، پھر ( میرے والد ) عازب رضی اللہ تعالیٰ عنہ سے کہنے لگے : اپنے بیٹے کو میرے ساتھ بھیج دیں ، وہ اس ( کجاوے ) کو میرے ساتھ اٹھا کر میرے گھر پہنچادے ۔ میرے والد نے مجھ سے کہا : اسے تم اٹھا لو تو میں نے اسے اٹھا لیا اور میرے والد اس کی قیمت لینے کے ہے ان کے ساتھ نکل پڑے ۔ میرے والد نے ان سے کہا : ابو بکر!مجھے یہ بتائیں کہ جس رات آپ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( ہجرت کے لیے ) نکلے تو آپ دونوں نے کیا کیا؟انھوں نے کہا : ہاں ہم پوری رات چلتے ر ہے حتیٰ کہ دوپہر کا و قت ہوگیا اور ( دھوپ کی شدت سے ) راستہ خالی ہوگیا ، اس میں کوئی بھی نہیں چل رہا تھا ، اچانک ایک لمبی چٹان ہمارے سامنے بلند ہوئی ، اس کا سایہ بھی تھا ، اس پر ابھی دھوپ نہیں آئی تھی ۔ ہم اس کے پاس ( سواریوں سے ) اتر گئے ۔ میں چٹان کے پاس آیا ، ایک جگہ اپنے ہاتھ سے سنواری تاکہ رسول اللہ صلی اللہ علیہ وسلم اس کے سائے میں سوجائیں ، پھر میں نے آپ کے لیے اس جگہ پر ایک نرم کھال بچھادی ، پھر عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !سوجائیے اور میں آپ کے اردگرد ( کے علاقے ) کی تلاشی لیتا ہوں ( اور نگہبانی کرتا ہوں ) آ پ سو گئے ، میں چاروں طرف نگرانی کرنے لگا تو میں نے دیکھا ایک چرواہا اپنی بکریاں لیے چنان کی طرف آرہاتھا ۔ وہ بھی اس کے پاس اسی طرح ( آرام ) کرنا چاہتا تھا جس طرح ہم چاہتے تھے ۔ میں اس سے ملا اور اس سے پوچھا : لڑکے !تم کس کے ( غلام ) ہو؟اس نے کہا : مدینہ کے ایک شخص کا ۔ میں نے کہا : کیا تمھاری بکریوں ( کے تھنوں ) میں دودھ ہے؟اس نے کہا : ہاں ۔ میں نے کہا : کیا تم میرے لیے دودھ نکالو گے؟اس نے کہا : ہاں ۔ اس نے ایک بکری کو پکڑا تو میں نے اس سے کہا : تھنوں سے بال ، مٹی اور تنکے جھاڑ لو ۔ ( ابو اسحاق نے ) کہا : تھنوں سے بال مٹی اور تنکے جھاڑ لو ۔ ( ابو اسحاق نے ) کہا : میں نے حضرت براء رضی اللہ تعالیٰ عنہ کو دیکھا وہ اپنا ایک ہاتھ دوسرے پر مار کر جھاڑ رہے تھے ، چنانچہ اس نے میرے لیے لکڑی کے ایک پیالے میں تھوڑا سا دودھ نکال دیا ( حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے ) کہا : میرے ہمراہ چمڑے کا ایک برتن ( بھی ) تھا ، میں اس میں رسول اللہ صلی اللہ علیہ وسلم کے لیے پانی بھر کر رکھتا تھا تاکہ آپ نوش فرمائیں اور وضو کریں ۔ میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا اور مجھے یہ بات پسند نہ تھی کہ آپ کو جگاؤں ، لیکن میں پہنچا تو آپ جاگ چکے تھے ۔ میں نے دودھ پر کچھ پانی ڈالا ، یہاں تک کہ اس کے نیچے کا حصہ بھی ٹھنڈا ہوگیاتو میں نے عرض کی : اللہ کے رسول صلی اللہ علیہ وسلم !یہ دودھ نوش فرمالیں ۔ آپ نے نوش فرمایا ، یہاں تک کہ میں راضی ہوگیا ۔ پھر آپ نے فرمایا : \" کیا چلنے کاوقت نہیں آیا؟ \" میں نے عرض کی : کیوں نہیں!کہا : پھر سورج ڈھل جانے کے بعد ہم روان ہوگئے اور سراقہ بن مالک ہمارے پیچھے آگیا ، جبکہ ہم ایک سخت زمین میں ( چل رہے ) تھے ۔ میں نے عرض کی : ہمیں لیا گیا ہے ، آپ نے فرمایا : \" غم نہ کرو اللہ ہمارے ساتھ ہے ۔ \" پھر رسول اللہ صلی اللہ علیہ وسلم نے اس کے خلاف دعا کی تو اس کے گھوڑے کی ٹانگیں پیٹ تک زمین میں دھنس گئیں ۔ میرا خیال ہے ۔ اس نے کہا : مجھے پتہ چل گیا ہے تم دونوں نے میرے خلاف دعا کی ہے ۔ میرے حق میں دعا کرو ۔ ( میری طرف سے ) تمہارے لیے اللہ ضامن ہے کہ میں ڈھونڈنے والوں کو تمہاری طرف سے لوٹاؤں گا ۔ آپ صلی اللہ علیہ وسلم نے اس کے لیے دعا کی تو وہ بچ گیا ، پھر وہ لوٹ گیا ۔ جس ( پچھاڑنے والے ) کو ملتا اس سے یہ کہتا : میں ( تلاش کرچکا ہوں ) تمہاری طرف سے بھی کفایت کرتا ہوں ، وہ اس طرف نہیں ہیں وہ جس کسی کو بھی ملتا اسے لوٹا دیتا ۔ ( حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے ) کہا : انھوں نے ہمارے ساتھ وفا کی ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 7522,
			"arabicnumber": "2009.04",
			"text": "زہیر بن حرب نے مجھے یہی حدیث عثمان بن عمر سے بیان کی ، نیز ہمیں اسحاق بن ابراہیم نے یہی حدیث بیان کی ، کہا : ہمیں نضر بن شمیل نے خبر دی ، ان دونوں ( عثمان اور نضر ) نے اسرائیل سے روایت کی ، انھوں نے ابو اسحاق سے روایت کی ، انھوں نے حضرت براء بن عازب رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے میرے والد سے تیرہ درہم میں ایک کجاوا خریدا ۔ پھر زہیر کی ابو اسحاق سے روایت کردہ حدیث کے مانند حدیث بیان کی اور اپنی حدیث میں انھوں نے کہا : عثمان بن عمر کی روایت میں ہے ، جب وہ ( سراقہ رضی اللہ تعالیٰ عنہ ) قریب آئے تو رسول اللہ صلی اللہ علیہ وسلم نے ان کے خلاف دعا کی ، ان کے گھوڑے کی ٹانگیں پیٹ تک زمین میں دھنس گئیں ۔ وہ اچھل کر اس سے اترے اور کہا : اے محمد صلی اللہ علیہ وسلم ! مجھے یہ پتہ چل گیا ہے کہ یہ آپ کا کا م ہے ۔ آپ اللہ سے دعا کریں کہ وہ مجھے اس مشکل سے ، میں جس میں پھنس گیا ہوں ، چھٹکارہ عطا کردے اور آپ کی طرف سے یہ بات میرے ذمے ہوئی کہ میرے پیچھے جو بھی ( آپ کا تعاقب کررہا ) ہے میں اس کی آنکھوں کو ( آپ کی طرف ) دیکھنے سے روک دوں گا اور یہ میرا ترکش ہے ، اس میں سے ایک تیر نکال لیں ، آپ فلاں مقام پر میرے اونٹوں اور میرے غلاموں کے پاس سے گزریں گے ، ان میں سے جس کی ضرورت ہو اسے لے لیں ۔ آپ نے فرمایا : \" مجھے تمہارے اونٹوں کی ضرورت نہیں ۔ \" چنانچہ ہم رات کے وقت مدینہ ( کے قریب ) پہنچے ۔ لوگوں نے اس کے بارے میں تنازع کیا کہ رسول اللہ صلی اللہ علیہ وسلم کس کے ہاں اتریں گے ( مہمان بنیں گے ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں ( اپنے د ادا ) عبدالمطلب کے ننھیال بنو نجار کا مہمان بن کر ان کی عزت افزائی کروں گا ۔ \" مرد ، عورتیں گھروں کے اوپر چڑھ گئے اور غلام اور نوکر چاکر راستوں میں بکھر گئے ۔ وہ پکار پکار کر کہہ رہے تھے : اے محمد صلی اللہ علیہ وسلم !اے اللہ کے رسول صلی اللہ علیہ وسلم ! ( مرحبا ) اے محمد صلی اللہ علیہ وسلم !اے اللہ کے رسول صلی اللہ علیہ وسلم ! ( مرحبا ) ۔",
			"grades": [],
			"reference": {
				"book": 55,
				"hadith": 96
			}
		}
	]
}