{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"6": "The Book of Prayer - Travellers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1570,
			"arabicnumber": "685.01",
			"text": "صالح بن کیسان نے عروہ بن زبیر سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا ، سفر اور حضر ( مقیم ہونے کی حالت ) میں نماز دو دور رکعت فرض کی گئی تھی ، پھر سفر کی نماز ( پہلی حالت پر ) قائم رکھی گئی اور حضر کی نماز میں اضافہ کردیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1571,
			"arabicnumber": "685.02",
			"text": "یونس نے ابن شہاب سے روایت کی ، انھوں نے کہا ، مجھے عروہ بن زبیر نے حدیث بیان کی ، کہ نبی اکرم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ صدیقہ رضی اللہ تعالیٰ عنہا نے کہا : جب اللہ تعالیٰ نےنماز فرض کی تو وہ دو رکعت فرض کی ، پھر حضر کی صورت میں اسے مکمل کردیا اور سفر کی نماز کو پہلے فریضے پر قائم رکھاگیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1572,
			"arabicnumber": "685.03",
			"text": "ابن عینیہ نے زہری سے انھوں نے عروہ سے اور انھوں نے حضرت عائشہ صدیقہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ ابتدا میں نماز دو رکعت فرض کی گئی ، پھر سفر کی نماز ، ( اسی حالت میں ) برقرار رکھی گئی اور حضر کی نماز مکمل کردی گئی ۔ امام زہری نے کہا : میں نے عروہ سے پوچھا حضرت عائشہ رضی اللہ تعالیٰ عنہا کا موقف کیا ہے ۔ وہ سفر میں پوری نماز ( کیوں ) پڑھتی تھیں؟انھوں نے کہا : انھوں نے اس کا ایک مفہوم لے لیا ہے جس طرح عثمان رضی اللہ تعالیٰ عنہ نے لیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1573,
			"arabicnumber": "686.01",
			"text": "عبداللہ بن ادریس نے ابن جریج سے ، انھوں نے ابن ابی عمار سے ، انھوں نے عبداللہ بن بابیہ سے اور انھوں نے یعلیٰ بن امیہ رضی اللہ تعالیٰ عنہ سے روایت کی : کہا : میں نے حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ سے عرض کی ( کہ اللہ تعالیٰ کا فرمان ہے ) \" اگر تمھیں خوف ہو کہ کافر تمھیں فتنے میں ڈال دیں گے تو تم پر کوئی حرج نہیں ہے کہ تم نماز قصر کرلو \" اب تو لوگ امن میں ہیں ( پھر قصر کیوں کرتے ہیں؟تو انھوں نے جواب دیا مجھے بھی اس بات پر تعجب ہو ا تھا جس پر تمھیں تعجب ہوا ہے ۔ تو میں نے رسول اللہ صلی اللہ علیہ وسلم سے اس کے بارے میں سوا ل کیا تھا ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" ( یہ ) صدقہ ( رعایت ) ہے جو اللہ تعالیٰ نے تم پر کیا ہے اس لئے تم اس کا صدقہ قبول کرو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1574,
			"arabicnumber": "686.02",
			"text": "یحییٰ نے ابن جریج سے سابقہ سند کے ساتھ حضرت یعلیٰ بن امیہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا! میں نے حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ سے عرض کی ۔ ۔ ۔ ( بقیہ روایت ) ابن ادریس کی حدیث کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1575,
			"arabicnumber": "687.01",
			"text": "ابو عوانہ نے بکیر بن اخنس سے ، انھوں نے مجاہد سے ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : اللہ تعالیٰ نے تمھارے نبی صلی اللہ علیہ وسلم کی زبان سے نماز فرض کی ، حضر ( جب مقیم ہوں ) میں چار رکعتیں ، سفر میں دو رکعتیں اور خوف ( جنگ ) میں ( امام کے ساتھ ) ایک رکعت ( پھر اس کی امامت کے بغیر ایک رکعت ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1576,
			"arabicnumber": "687.02",
			"text": "ایوب بن عائد طائی نے بکیر بن اخنس سے ، انھوں نے م مجاہد سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، کہا!بے شک اللہ تعالیٰ نے تمھارے نبی صلی اللہ علیہ وسلم کی زبان سے نماز فرض کی ، مسافر پردو رکعتیں ، مقیم پر چار اور ( جنگ کے ) خوف کے عالم میں ( امام کی اقتداء میں ) ایک رکعت ( اور اقتدا کے بغیر ایک رکعت ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1577,
			"arabicnumber": "688.01",
			"text": "شعبہ نے کہا : میں نے قتادہ سے سنا ، وہ موسیٰ بن سلمہ ہذلی ( بصری ) سے حدیث بیان کررہے تھے ۔ کہا : میں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے پوچھا : جب میں مکہ میں ہوں اور امام کے ساتھ نماز نہ پڑھوں تو پھر کیسے نماز پڑھوں؟تو انھوں نے جواب دیا : دو رکعتیں ، ( یہی ) ابو القاسم صلی اللہ علیہ وسلم کی سنت ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1578,
			"arabicnumber": "688.02",
			"text": "(شعبہ کی بجائے ) سعید بن ابی عروبہ اور معاذ بن ہشام نے اپنے والد کے واسطے سے قتادہ سے ، اسی مذکورہ سند کےساتھ اسی طرح ( حدیث بیان کی ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1579,
			"arabicnumber": "689.01",
			"text": "عیسیٰ بن حضص بن عاصم بن عمر بن خطاب رضی اللہ تعالیٰ عنہ نے اپنے والد ( حفص ) سے روایت کی ، انھوں نے کہا : میں نے مکہ کے راستے میں حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے ساتھ سفر کیا ، انھوں نے ہمیں ظہر کی نماز دو رکعتیں پڑھائی ، پھر وہ اور ہم آگے بڑھے اور اپنی قیام گاہ پر آئے اور بیٹھ گئے ، ہم بھی ان کے ساتھ بیٹھ گئے ۔ پھر اچانک ان کی توجہ اس طرف ہوئی جہاں انھوں نے نماز پڑھی تھی ، انھوں نے ( وہاں ) لوگوں کو قیام کی حالت میں دیکھاانھوں نےپوچھا ، یہ لوگ کیا کررہے ہیں؟میں نے کہا : سنتیں پڑھ رہے ہیں ۔ انھوں نے کہا : اگر مجھے سنتیں پڑھنی ہوتیں تو میں نماز ( بھی ) پوری کرتا ( قصر نہ کرتا ) بھتیجے!میں سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ رہا آپ نے دو رکعت سے زائد نماز نہ پڑھی یہاں تک کہ اللہ تعالیٰ نے آپ کو اپنے پاس بلا لیا اور میں حضرت ابو بکر رضی اللہ تعالیٰ عنہ کے ہمرا ہ رہا انھوں نے بھی دو رکعت سے زائد نماز نہ پڑھی یہاں تک کہ اللہ تعالیٰ نے انھیں بھی بلا لیا ، اور میں حضرت عمر رضی اللہ تعالیٰ عنہ کے ہمراہ رہا ، انھوں نے بھی دورکعت نما ز سے زائد نہ پڑھی ۔ یہاں تک کہ اللہ تعالیٰ نے انھیں بھی بلا لیا ۔ پھر میں عثمان رضی اللہ تعالیٰ عنہ کے ساتھ رہا انہوں نے بھی دو سے زائد رکعتیں نہیں پڑھیں ، یہا ں تک کہ اللہ نے انھیں بلا لیا اور اللہ تعالیٰ کا فرمان ہے : \" بے شک تمہارے لئے رسول اللہ صلی اللہ علیہ وسلم ( کے عمل ) میں بہترین نمونہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1580,
			"arabicnumber": "689.02",
			"text": "عمر بن محمد نے حفص بن عاصم سے روایت کی ، کہا : میں بیمار ہواتو ( عبداللہ ) بن عمر رضی اللہ تعالیٰ عنہ میر عیادت کرنے آئےکہا : میں نے ان سے سفر میں سنتیں پڑھنے کے بارے میں سوال کیا ۔ انھوں نے کہا : میں سفر کے دوران رسول اللہ صلی اللہ علیہ وسلم کے ہمرا رہا ہوں ۔ میں نے دیکھا کہ آپ سنتیں پڑھتے ہوں ، اور اگر مجھے سنتیں پڑھنی ہوتیں تو میں نماز ہی پوری پڑھتا ۔ اللہ تعالیٰ نے فرمایا ہے : \" بے شک تمہارے لئے رسول اللہ صلی اللہ علیہ وسلم ( کے عمل ) میں بہترین نمونہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1581,
			"arabicnumber": "690.01",
			"text": "ابو قلابہ نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینہ میں ظہر کی چار رکعات پڑھیں اور ذوالحلیفہ میں عصر کی دو رکعتیں پڑھیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1582,
			"arabicnumber": "690.02",
			"text": "محمد بن منکدر اور ابراہیم بن میسرہ دونوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا کہہ رہے تھے : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ میں ظہر کی چار رکعات پڑھیں اور آ پ کے ساتھ ذوالحلیفہ میں عصر کی دو رکعتیں پڑھیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1583,
			"arabicnumber": "691",
			"text": "شعبہ نے یحییٰ بن یزید ہنائی سے روایت کی ، کہا : کہا میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے نماز قصر کرنے کے بارے میں پوچھا توانھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب تین میل یا تین فرسخ کی مسافت پر نکلتے ۔ مسافت کے بارے میں شک کرنے والے شعبہ ہیں ۔ تو دو رکعت نماز پڑھتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1584,
			"arabicnumber": "692.01",
			"text": "عبدالرحمان بن مہدی ، نے حدیث بیان کی کہا : ہمیں شعبہ نے یزید بن خمیر سے حدیث سنائی ۔ انہوں نے حبیب بن عبید سے انھوں نے جبیر بن نفیر سے روایت کی ، انھوں نے کہا : می شرجیل بن سمط ( الکندی ) کی معیت میں ایک بستی کو گیا جو سترہ یا اٹھارہ میل کے فاصلے پر تھی تو انھوں نے دو رکعت نماز پڑھی ، میں نے ان سے پوچھا ، انھوں نے جواب دیا : میں نے حضرت عمر رضی اللہ تعالیٰ عنہ کو ذوالحلیفہ میں دو رکعت پڑھتے دیکھا ہے ، تو میں نے ان ( حضرت عمر رضی اللہ تعالیٰ عنہ ) سے پوچھا ، انھوں نے جواب دیا : میں اسی طرح کرتا ہوں جس طرح میں نے رسول اللہ صلی اللہ علیہ وسلم کو کرتے دیکھا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1585,
			"arabicnumber": "692.02",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے اسی سند کے ساتھ یہ حدیث بیان کی اور کہا : ابن سمط سے روایت ہے اور انھوں نے شرجیل کا نام لیا اور کہا : وہ حمص کی دومین نامی جگہ پر پہنچے جو اٹھارہ میل کے فاصلے پر تھی ( اور وہاں نماز قصر پڑھی ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1586,
			"arabicnumber": "693.01",
			"text": "ہشیم نے یحییٰ بن ابی اسحاق سے ، انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مدینہ سے مکہ جانے کے لئے نکلے تو آپ دو رکعت نماز پڑھتے رہے یہاں تک کہ مدینہ واپس پہنچ گئے ۔ راوی نے حضرت انس رضی اللہ تعالیٰ عنہ سے پوچھا : آپ مکہ کتنا عرصہ ٹھرے؟انھوں نے جواب دیا : دس دن ( آپ صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر مکہ آکر خود مکہ ، منیٰ ، عرفات اور مزدلفۃ مختلف مقامات پردس دن گزارے ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1587,
			"arabicnumber": "693.02",
			"text": "ابو عوانہ اور ( اسماعیل ) ابن علیہ نے یحییٰ بن ابی اسحاق سے انھو ں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے ہشیم کی حدیث کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1588,
			"arabicnumber": "693.03",
			"text": "شعبہ نے کہا : مجھے یحییٰ بن ابی اسحاق نے حدیث سنائی ، کہا : میں نےحضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے سنا ، وہ بیان کرتے تھے کہ ہم حج کے لئے مدینہ سے چلے ۔ ۔ ۔ پھر مذکورہ بالا روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1589,
			"arabicnumber": "693.04",
			"text": "(سفیان ) ثوری نے یحییٰ بن ابی اسحاق سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے اسی سابقہ حدیث کے مانند حدیث وروایت کی اور ( اس میں ) حج کاتذکرہ نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1590,
			"arabicnumber": "694.01",
			"text": "عمرو بن حارث نے ابن شہاب سے ، انھوں نے سالم بن عبداللہ ( بن عمر ) سے ، انھوں نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے اور ا نھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے منیٰ اور دوسری جگہوں ، یعنی اس کے نواح میں اور ( آپ صلی اللہ علیہ وسلم کے بعد ) حضرت ابو بکر اورحضرت عمر رضی اللہ تعالیٰ عنہ نے مسافر کی نماز ، یعنی دو رکعتیں پڑھیں ۔ اورعثمان رضی اللہ تعالیٰ عنہ نے بھی اپنی خلافت کے ابتدائی سالوں میں دو رکعتیں پڑھیں ، بعد میں پوری چار پڑھنے لگے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1591,
			"arabicnumber": "694.02",
			"text": "اوزاعی اور معمر نے ( اپنی اپنی سند سے روایت کرتے ہوئے ) زہری سے باقی ماندہ اسی سند کے ساتھ یہی حدیث روایت کی ، انھوں نے \" منیٰ میں \" کہا اور \" دوسری جگہوں \" کے الفاظ نہیں کہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1592,
			"arabicnumber": "694.03",
			"text": "ابو اسامہ نے کہا : ہمیں عبیداللہ بن عمر نے نافع سے حدیث سنائی ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم نے منیٰ میں دو رکعتیں پڑھیں ، آپ کے بعد حضرت ابو بکر رضی اللہ تعالیٰ عنہ نے اور حضرت ابو بکر رضی اللہ تعالیٰ عنہ کے بعد حضرت عمر رضی اللہ تعالیٰ عنہ نے اور حضرت عثمان رضی اللہ تعالیٰ عنہ نے اپنی خلافت کے ابتدائی سالوں میں ( دورکعتیں پڑھیں ) پھر عثمان رضی اللہ تعالیٰ عنہ نے اس کے بعد چار رکعتیں پڑھیں ۔ اس لئے حضرت ابن عمر رضی اللہ تعالیٰ عنہ جب امام کے ساتھ نماز پڑھتے تو چار رکعات پڑھتے اور جب اکیلے پڑھتے تو وہ رکعتیں پڑھتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1593,
			"arabicnumber": "694.04",
			"text": "یحییٰ قطان ، ابن ابی زائدہ اور عقبہ بن خالد نے عبیداللہ سے اسی سند کے ساتھ اسی طرح روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1594,
			"arabicnumber": "694.05",
			"text": "عبیداللہ بن معاذ نے حدیث بیان کی ، کہا : میرے والد نے ہمیں حدیث سنائی ، کہا : ہمیں شعبہ نے خبیب بن عبدالرحمان سے حدیث سنائی ، انھوں نے حفص بن عاصم سے سنا ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : نبی صلی اللہ علیہ وسلم ابو بکر ، عمر ، اور عثمان ، رضوان اللہ عنھم اجمعین نے ( پہلے ) آٹھ سال یا کہا : چھ سال ۔ ۔ ۔ منیٰ میں مسافر والی نماز پڑھی ۔ حفص نے کہا : ابن عمر رضی اللہ تعالیٰ عنہ منیٰ میں دو رکعت نماز پڑھتے تھے ۔ پھر اپنے بستر پر آجاتے تھے ۔ میں نے کہا : چچا جان! اگر آپ فرض نماز کے بعددوسنتیں بھی پڑھ لیا کریں! تو انھوں نے کہا : اگر میں ایسا کروں تو ( گویا ) پوری نماز پڑھوں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1595,
			"arabicnumber": "694.06",
			"text": "خالد بن حارث اور عبدالصمد نے کہا : ہمیں شعبہ نے ( باقی ماندہ ) اسی سند کے ساتھ یہی روایت بیان کی لیکن ان دونوں نے اس حدیث میں \" منیٰ میں \" کے الفاظ نہیں کہے لیکن دونوں نے یہ کہا : \" آپ نے سفر میں نماز پڑھی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1596,
			"arabicnumber": "695.01",
			"text": "عبدالواحد نے اعمش سے حدیث بیان کی ، کہا : ہمیں ابراہیم نے حدیث سنائی ، کہا : میں نے عبدالرحمان بن یزید سے سنا ، کہہ رہے تھے : حضرت عثمان رضی اللہ تعالیٰ عنہ نے ہمیں منیٰ میں چار رکعات پڑھائیں ، یہ بات عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کو بتائی گئی تو انھوں نے انا للہ وانا الیہ راجعون پڑھا پھر کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعات نما ز پڑھی ، ابو بکر رضی اللہ تعالیٰ عنہ کے ساتھ منیٰ میں دو رکعات نماز پڑھی ۔ اور عمر بن خطاب رضی اللہ تعالیٰ عنہ کےساتھ منیٰ میں دو رکعات نماز پڑھی ، کاش! میرے نصیب میں چار رکعات کے بدلے شرف قبولیت حاصل کرنے والی دو رکعتیں ہوں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1597,
			"arabicnumber": "695.02",
			"text": "ابو معاویہ ، جریر اور عیسیٰ سب نے ( مختلف سندوں سے روایت کرتے ہوئے ) اعمش سے اسی سند کے ساتھ اسی طرح حدیث بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1598,
			"arabicnumber": "696.01",
			"text": "ابو احوص نے ابو اسحاق سے اور انھوں نے حضرت حارثہ بن وہب رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ منیٰ میں دو رکعات نماز پڑھی ، ( جب ) لوگ سب سے زیادہ امن میں اور کثیر تعداد میں تھے ۔ ( یہ اللہ کی رخصت کو قبول کرنے کا معاملہ تھا ، خوف ، بدامنی یا جنگ کا معاملہ نہ تھا ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": "696.02",
			"text": "زہیر نے حدیث بیان کی ، کہا : ہمیں ابو اسحاق نے حدیث سنائی ، کہا ، مجھ سے حارثہ بن وہب خزاعی رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہا : میں نے منیٰ میں رسول اللہ صلی اللہ علیہ وسلم کی اقتداء میں نماز پڑھی جبکہ لوگ ( تعداد میں ) جتنے زیادہ ہوسکتے تھے ( موجود تھے ) آپ نے حجۃ الوداع کے موقع پر دو رکعت نماز پڑھائی ۔ امام مسلم ؒ نے کہا : حارثہ بن وہب خزاعی رضی اللہ تعالیٰ عنہ ماں ( ملیکہ بنت جرول الخزاعیہ ) کی طرف سے عبیداللہ بن عمر بن خطاب رضی اللہ تعالیٰ عنہ کے بھائی تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": "697.01",
			"text": "امام مالک نے نافع سے روایت کی کہ ابن عمر رضی اللہ تعالیٰ عنہ نے سردی اور ہوا والی ایک رات اذان کہی اور اس کے آخر میں کہا : ( أَلَا صَلُّوا فِي الرِّحَالِ ) سنو! ( اپنے ) ٹھکانوں میں نماز پڑھ لو ۔ \" پھر کہا کہ جب رات سرد اور بارش والی ہوتی تو رسول اللہ صلی اللہ علیہ وسلم موذن کو حکم دیتے کہ وہ کہے ( أَلَا صَلُّوا فِي الرِّحَالِ ) سنو! ( اپنے ) ٹھکانوں پر نماز پڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": "697.02",
			"text": "(محمد بن عبداللہ بن نمیر نے حدیث بیان کی ، کہا : مجھے میرے والد نے حدیث سنائی ، کہا : ہمیں عبیداللہ نے حدیث سنائی ، کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ انھوں نے سردی ، ہوا اور بارش و الی ایک رات میں اذان دی اور اذان کے آخر میں کہا : \" سنو! اپنے ٹھکانوں میں نماز پڑھ لو ، سنو! ٹھکانوں میں نماز پڑھو ، \" پھر کہا : جب سفر میں رات سرد یا بارش والی ہوتی تو رسول اللہ صلی اللہ علیہ وسلم موذن کو یہ کہنے کا حکم دیتے \" أَلَا صَلُّوا فِي الرِّحَالِکُم ) \" سنو!اپنی قیام گاہوں میں نماز پڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": "697.03",
			"text": "ابو اسامہ نے کہا : ہمیں عبیداللہ نے نافع سے حدیث سنائی ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے ر وایت کی کہ انھوں نے ( مکہ سے چھ میل کے فاصلے پر واقع ) بضَجنانَ پہاڑ پر اذان کہی ۔ ۔ ۔ پھر اوپر والی حدیث کے مانند بیان کیا اور ( ابو اسامہ نے ) کہا : \" أَلَا صَلُّوا فِي الرِّحَالِکُم \" اور انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ کے دوبارہ \" أَلَا صَلُّوا فِي الرِّحَالِ \" کہنے کا ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": "698",
			"text": "حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا : ایک سفر میں ہم رسول اللہ صلی اللہ علیہ وسلم کے ہمراہ نکلے تو بارش ہوگئی ، آپ صلی اللہ علیہ وسلم نے فرمایا ، \" تم میں سے جو چاہے اپنی قیام گاہ میں نماز پڑھ لے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": "699.01",
			"text": "اسماعیل ( ابن علیہ ) نے ( ابن ابی سفیان ) الزیادی کے ساتھی عبدالحمید سے ، انھوں نے عبداللہ بن حارث سے اور انھوں نے حضرت عبداللہ بن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے ایک بارش والے دن اپنے موذن سے فرمایا : جب تم اشهد ان لا اله الا الله اشهد ان محمد ا رسول الله کہہ چکو تو حيي علي الصلوة نہ کہنا ( بلکہ ) صَلُّوا فِي بُيُوتِكُمْ ( اپنے گھروں میں نماز پڑھو ) کہنا ۔ کہا : لوگوں نے گویا اس کو ایک غیر معروف کام سمجھا تو ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : کیاتم اس پر تعجب کررہے ہو؟ یہ کام انھوں نے کیا جو مجھ سے بہت زیادہ بہترتھے ۔ جمعہ پڑھنالازم ہے اور مجھے برا معلوم ہوا کہ میں تمھیں تنگی میں مبتلا کروں اور تم کیچڑاور پھسلن میں چل کر آؤ ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": "699.02",
			"text": "ابو کامل جحدری نے کہا : ہمیں حماد ، یعنی ابن زید نے عبدالحمید سے حدیث بیان کی ، انھوں نے کہا : میں نے عبداللہ بن حارث سے سنا ، انھوں نے کہا : حضرت عبداللہ بن عباس رضی اللہ تعالیٰ عنہ نے ایک پھسلن والے دن ہمارے سامنے خطبہ دیا ۔ ۔ ۔ آگے ابن علیہ کی حدیث کےہم معنی روایت بیان کی ، لیکن جمعے کا نام نہیں لیا ، اور کہا : یہ کام اس شخصیت نے کیا ہے جو مجھ سے بہت زیادہ بہتر تھے ، یعنی نبی اکرم صلی اللہ علیہ وسلم نے ( یہ کام کیا ہے ) ابو کامل نے کہا : حماد نے ہم سے یہ حدیث ( عبدالحمید کی بجائے ) عاصم سے ، انھوں نے عبداللہ بن حارث سے اسی طرح روایت کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": "699.03",
			"text": "ابو ربیع عتکی زہرانی نے کہا : ہمیں حماد یعنی ابن زید نے حدیث سنائی ، کہا : ہمیں ایوب اور عاصم احول نے اس سند کےساتھ حدیث سنائی ، البتہ انھوں ( ابو ربیع ) نے اپنی حدیث میں یعنی النبي صلی اللہ علیہ وسلم کے الفاظ ذکر نہیں کیے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": "699.04",
			"text": "شعبہ نے کہا : ہمیں عبدالحمید صاحب الزیادی نے حدیث سنائی ، کہا : میں نے عبداللہ بن حارث سے سنا ، انھوں نے کہا ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ کے موذن نے جمعے کے روز بارش والے دن اذان دی ۔ ۔ ۔ پھر ابن علیہ کی حدیث کی طرح بیان کیا ، اورکہا : میں نے اس بات کو ناپسند کیا کہ تم پھسلن میں چل کرآؤ ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": "699.05",
			"text": "شعبہ اور معمر دونوں نے ( اپنی اپنی سند سے روایت کرتے ہوئے ) عاصم احول سے اور انھوں نے عبداللہ بن حارث سے روایت کی کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے اپنے موذن کو حکم دیا ۔ معمر کی روایت میں ہے : جمعے کے روز بارش کے دن ۔ ۔ ۔ ( آگے ) سابقہ راویوں کی روایت کی طرح ہے ۔ اور معمر کی حدیث میں یہ بھی ہے : یہ کام انھوں نے کیا جو مجھ سے بہت زیادہ بہتر ہیں ، یعنی نبی اکرم صلی اللہ علیہ وسلم نے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": "699.06",
			"text": "وہیب نے کہا : ہمیں ایوب نے عبداللہ بن حارث سے حدیث بیان کی ۔ وہیب نے کہا : ایوب نے یہ حدیث عبداللہ بن حارث سے نہیں سنی ۔ ( جبکہ ابن حجر ؒ کی تحقیق ہ کہ وہیب کہ بات درست نہیں بلکہ ایوب نے یہ حدیث سنی ہے ) انھوں نے کہا : ابن عباس رضی اللہ تعالیٰ عنہ نے جمعے کے روز بارش کے دن اپنے موذن کو حکم دیا ۔ ۔ ۔ ( آگے اسی طرح ہے ) جس طرح دوسرے راویوں نے بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": "700.01",
			"text": "محمد بن عبداللہ بن نمیر نے حدیث بیان کی ، کہا : ہمیں میرے والد نے حدیث بیان کی ، کہا : ہمیں عبیداللہ نے نافع سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم ( سفر میں سواری پر ) اپنی نفل نماز پڑھتے تھے آپ کی اونٹنی جس طرف بھی آپ کو لئے ہوئے رخ کرلیتی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": "700.02",
			"text": "ابو خالد احمر نے عبیداللہ سے انھوں نے نافع سے اور انھوں نے ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم اپنی سواری پر نماز پڑھتے تھے ۔ وہ چاہے آپ کو لئے ہوئے جس طرف بھی رخ کرلیتی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": "700.03",
			"text": "یحییٰ بن سعید نے عبدالملک بن ابی سلیمان سے روایت کی ، کہا : ہمیں سعید بن جبیر نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم جب مکہ سے مدینہ کی طرف آرہے ہوتے ، اپنی سواری پر نماز پڑھتے تھے ، جس طرف بھی آپ کا رخ ہوجاتا ۔ کہا : اسی کے بارے میں یہ آیت اتری : \" سو جس طرف تم رخ کرو ، وہیں اللہ کا چہرہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": "700.04",
			"text": "ابن مبارک ، ابن ابی زائدہ اور ابن نمیر نے اپنے والد کے حوالے سے ، سب نے عبدالملک سے اسی سند کے ساتھ یہ حدیث روایت کی اور ان میں سے ابن مبارک اور ابن ابی زائدہ کی روایت میں ہے کہ پھر حضرت ابن عمر رضی اللہ تعالیٰ عنہ نےآیت تلاوت کی ( فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللہِہہہ ) \" تم جس طرف بھی رخ کرو وہیں اللہ کا چہرہ ہے \" اور کہا : یہ اسی کے بارے میں اتری ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": "700.05",
			"text": "عمرو بن یحییٰ مازنی نے سعید بن یسار سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا میں نے رسول اللہ صلی اللہ علیہ وسلم کو گدھے پر نمازپڑھتے دیکھا جبکہ آپ نے خیبر کا رخ کیا ہوا تھا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": "700.06",
			"text": "ابو بکر بن عمر بن عبدالرحمان ، بن عبداللہ بن عمر بن خطاب رضی اللہ تعالیٰ عنہ نے سعید بن یسار سے روایت کی کہ انھوں نے کہا : میں مکہ کے راستے میں حضرت ابن عمر رضی اللہ تعالیٰ عنہ کے ساتھ سفر کررہا تھا ۔ پھر جب مجھے صبح ہوجانے کا اندیشہ ہوا تو میں سواری سے اترا اور وتر پڑھے ، پھر میں ان سے جا ملا تو حضرت ابن عمر رضی اللہ تعالیٰ عنہ نے مجھ سے پوچھا : تم کہاں ( رہ گئے ) تھے؟میں نے ان سے کہا : مجھے فجر ہوجانے کا اندیشہ ہوا ، اس لئے میں نے اتر کروترپڑھے ۔ تو حضرت عبداللہ رضی اللہ تعالیٰ عنہ نے کہا : کیا تمہارے لئے رسول اللہ صلی اللہ علیہ وسلم کے عمل میں نمونہ نہیں ہے؟میں نے کہا : کیوں نہیں ، اللہ کی قسم ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم اونٹ پر وتر پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": "700.07",
			"text": "امام مالکؒ نے عبداللہ بن دینار سے اور انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم اپنی سواری پر نماز پڑھتے تھے وہ آپ کو لئے ہوئے جدھر کا بھی رخ کرلیتی ۔ عبداللہ بن دینار نے کہا : حضرت ابن عمر رضی اللہ تعالیٰ عنہ بھی یہی کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": "700.08",
			"text": "ابن ہاد نے عبداللہ بن دینا ر سے اور انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم اپنی سواری پر وتر ادا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": "700.09",
			"text": "سالم بن عبداللہ نے اپنے والد ( عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم اپنی سواری پر نفل پڑھتے جدھر بھی آپ کا رخ ہوجاتا اور اسی پر وتر بھی پڑھتے ، البتہ آپ فرض نماز اس پر نہیں پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": "701",
			"text": "حضرت عبداللہ بن عامر بن ربیعہ رضی اللہ تعالیٰ عنہ نے خبر دی کہ انھیں ان کے والد نے بتایا کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، آپ سفر میں رات کے وقت سواری پر نفل پڑھتے تھے جدھر کا بھی وہ رخ کرلیتی تھی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": "702",
			"text": "ہمام نے کہا : ہمیں انس بن سیرین نے حدیث بیان کی کہ جب حضرت انس بن مالک رضی اللہ تعالیٰ عنہ شام سے آئے تو ہم نے ان کا استقبال کیا ، ہم عین التمر کے مقام پر جا کر ان سے ملے تو میں نے انھیں دیکھا ، وہ گدھے پر نماز پڑھ رہے تھے اور ان کا رخ اس طرف تھا ۔ ہمام نے قبلے کی بائیں طرف اشارہ کیا ۔ تو میں ( انس بن سیرین ) نے ان سے کہا : میں نے آپ کو قبلے کی بائیں طرف نماز پڑھتے دیکھا ہے انھوں نے کہا : اگر میں نے رسول اللہ صلی اللہ علیہ وسلم کو ایسا کرتے ہوئے نہ دیکھا ہوتا تو میں ( کبھی ) ایسا نہ کرتا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": "703.01",
			"text": "امام مالک ؒ نے نافع سے اور ا نھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم کو جب چلنے کی جلدی ہوتی تو مغرب اور عشاء کی نمازیں جمع کرلیتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": "703.02",
			"text": "عبیداللہ سے روایت ہےکہا : مجھے نافع نے خبردی کہ حضرت عمر رضی اللہ تعالیٰ عنہ کو جب ( سفر کے لئے ) جلدی چلنا ہوتا تو شفق ( سورج کی سرخی ) غائب ہونے کے بعد ( یعنی عشاء کاوقت شروع ہونے کے بعد ) مغرب اور عشاء کو جمع کرکے پڑھتے تھے اور بتاتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کو جب جلد چلنا ہوتا تو آپ صلی اللہ علیہ وسلم مغرب اور عشاء کو جمع کرلیتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 1623,
			"arabicnumber": "703.03",
			"text": "سفیان نے ( ابن شہاب ) زہری سے ، انھوں نے سالم سے اور انھوں نے اپنے والد ( ابن عمر رضی اللہ تعالیٰ عنہ رضی اللہ تعالیٰ عنہ سے ر وایت کی کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا ، جب آپ کو چلنے کی جلدی ہوتی تو آپ مغرب اور عشاء کو جمع کرلیتے تھے ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 1624,
			"arabicnumber": "703.04",
			"text": "یونس نے ابن شہاب سے روایت کی ، کہا : مجھےسالم بن عبداللہ نے خبر دی کہ ان کے والد نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا جب آپ نے سفر میں جلد چلنا ہوتا تو مغرب کی نماز کو موخر کردیتے حتیٰ کہ اسے اور عشاء کی نماز کو جمع کرکرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 1625,
			"arabicnumber": "704.01",
			"text": "مفضل بن فضالہ نے عقیل سے ، انھوں نے ابن شہاب سے اور انھوں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب سورج ڈھلنے سے پہلے کوچ کرتے تو ظہر کو اس وقت تک موخر فرماتے کہ عصر کا وقت ہوجاتا ، پھر آپ ( سواری سے ) اترتے ، دونوں نمازوں کوجمع کرتے ، اور اگر آپ کے کوچ کرنے سے پہلے سورج ڈھل جاتا تو ظہر پڑھ کر سوار ہوتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 1626,
			"arabicnumber": "704.02",
			"text": "لیس بن سعد نے عقیل بن خالد سے باقی ماندہ اسی سند کے ساتھ روایت کی کہ ر سول اللہ صلی اللہ علیہ وسلم سفر میں جب دو نمازوں کو جمع کرنا چاہتے توظہر کو موخر کرتے حتیٰ کہ عصر کا اول وقت ہوجاتا ، پھر آپ دونوں نمازوں کو جمع کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 1627,
			"arabicnumber": "704.03",
			"text": "جابر بن اسماعیل نے بھی عقیل بن خالد سے باقی ماندہ اسی سند کے ساتھ روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم کو جب سفر میں جلدی ہوتی تو ظہر کو عصر کے اول وقت تک موخر کردیتے ، پھر دونوں کو جمع کرلیتے اور مغرب کو موخر کرتے اور عشاء کے ساتھ اکٹھا کرکے پڑھتے جب شفق غائب ہوجاتی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 1628,
			"arabicnumber": "705.01",
			"text": "امام مالک ؒ نے ابو زبیر سے ، انھوں نے سعید بن جبیر سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ظہر اور عصر کو اکھٹا پڑھا اور مغرب اور عشاء کو اکھٹا پڑھا کسی خوف اور سفر کے بغیر ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 1629,
			"arabicnumber": "705.02",
			"text": "زہیر نے کہا : ہمیں ابو زبیر نے سعید بن جبیر سے حدیث سنائی ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ظہر اور عصر کو مدینہ میں کسی خوف اور سفر کے بغیر جمع کرکے پڑھا ۔ ابوزبیر نے کہا : میں نے ( ابن عباس رضی اللہ تعالیٰ عنہ کے شاگرد ) سعید سے پوچھا : آپ صلی اللہ علیہ وسلم ؤ نے ایسا کیوں کیاتھا؟انھوں نےجواب دیا : میں بھی حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے سوا ل کیاتھا جیسے تم نے مجھ سے سوال کیا ہے تو انھوں نے کہا : آپ نے چاہا کہ اپنی امت کےکسی فرد کو تنگی اور دشواری میں نہ ڈالیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 1630,
			"arabicnumber": "705.03",
			"text": "قزہ بن خالد نے کہا : ہمیں ابو زبیر نے حدیث بیا ن کی ، کہا : ہمیں سعید بن جبیر نے حدیث سنائی ، انھوں نے کہا : ہمیں حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے حدیث بیا ن کی کہ رسول اللہ صلی اللہ علیہ وسلم نے غزوہ تبوک کے دوران ایک سفر میں نمازوں کو جمع کیا ، ظہراورعصر کو اکھٹا پڑھا اور مغرب اور عشاء کو اکھٹا پڑھا ۔ سعید نے کہا میں نے ابن عباس رضی اللہ تعالیٰ عنہ سے پوچھا : آپ صلی اللہ علیہ وسلم نے ایسا کیوں کیا تھا؟انھوں نے کہا : آپ نے چاہا اپنی امت کو حرج ( اور تنگی ) میں نہ ڈالیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 1631,
			"arabicnumber": "706.01",
			"text": "زہیر نے کہا : ہمیں ابو زبیر نے ابو طفیل عامر سے حدیث سنائی اور انھوں نے حضرت معاذ رضی اللہ تعالیٰ عنہ سے روایت کی کہ ہم غزوہ تبوک میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے تو ( اس دوران میں ) آپ ظہر اور عصر اکھٹی پڑھتے رہے اور مغرب اور عشاء کو جمع کرتے رہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 1632,
			"arabicnumber": "706.02",
			"text": "قرہ بن خالد نے کہا : ہمیں ابو زبیر نے حدیث بیا ن کی ، کہا : ہمیں عامر بن واثلہ ابو طفیل نے حدیث بیا ن کی ، کہا : ہمیں حضرت معاذ بن جبل رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے غزوہ تبوک میں ظہر ، عصر کو اور مغرب ، عشاء کو جمع کیا ۔ ( عامر بن واثلہ نے ) کہا : میں نے ( حضرت معاذ رضی اللہ تعالیٰ عنہ سے ) پوچھا : آپ نے ایسا کیوں کیا؟تو انھوں نے کہا : آپ نے چاہا کہ اپنی امت کو دشواری میں نہ ڈالیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 1633,
			"arabicnumber": "705.04",
			"text": "ابو معاویہ اور وکیع دونوں نے اعمش سے روایت کی ، انھوں نے حبیب بن ثابت سے انھوں نے سعید بن جبیر سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ظہر ، عصر اور مغرب ، عشاء کو مدینہ میں کسی خوف اور بارش کے بغیر جمع کیا ۔ وکیع کی روایت میں ہے ( سعید نے ) کہا : میں نے ابن عباس رضی اللہ تعالیٰ عنہ سے پوچھا : آپ صلی اللہ علیہ وسلم نے ایسا کیوں کیا؟ انھوں نے کہا : تاکہ اپنی امت کو دشواری میں مبتلا نہ کریں اور ابو معاویہ کی حدیث میں ہے ابن عباس رضی اللہ تعالیٰ عنہ سے پوچھا گیا : آپ صلی اللہ علیہ وسلم نے کہا چاہتے ہوئے ایسا کیا؟انھوں نے کہا : آپ نے چاہا اپنی امت کو دشواری میں نہ ڈالیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 1634,
			"arabicnumber": "705.05",
			"text": "سفیان بن عینیہ نے عمرو بن دینار سے انھوں نے ( ابوشعشاء ) جابر بن زید سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے نبی اکرم صلی اللہ علیہ وسلم کے ساتھ آٹھ رکعات ( ظہر اورعصر ) اکھٹی اور سات رکعات ( مغرب اور عشاء ) اکھٹی پڑھیں ۔ ( عمرو نے کہا ) میں نے ابو شعشاء ( جابر بن زید ) سے کہا کہ میرا خیال ہے آپ نے ظہر کو موخر کیا اور عصر جلدی پڑھی اور مغرب کو موخر کیا اور عشاء میں جلدی کی ۔ انھوں نے کہا : میرا بھی یہی خیال ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 1635,
			"arabicnumber": "705.06",
			"text": "حماد بن زید نے عمرو بن دینار سے انھوں نے جابر بن زید سے اور انھوں نے حضرت ا بن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے مدینہ میں سات رکعات اور آٹھ رکعات نماز پڑھی ۔ یعنی ظہر ، عصر ، مغرب اور عشاء ( ملا کرپڑھیں ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 1636,
			"arabicnumber": "705.07",
			"text": "زبیر بن خریت نے عبداللہ بن شفیق سے روایت کی انھوں نے کہا : ایک دن حضرت ابن عباس رضی اللہ تعالیٰ عنہ عصر کے بعد ہمیں خطاب کرنے لگے حتیٰ کہ سورج غروب ہوگیا اور ستارے نمودار ہوگئے اور لوگ کہنے لگے : نماز ، نماز! پھر ان کے پاس بنو تمیم کا ایک آدمی آیا جو نہ تھکتا تھا اور نہ باز آرہاتھا نماز ، نماز کہے جارہاتھا ، حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا تیری ماں نہ ہو!تو مجھے سنت سکھا رہا ہے؟پھر کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا آپ نے ظہر وعصر کو اور مغرب وعشاء کو جمع کیا ۔ عبداللہ بن شفیق نے کہا : تو اس سے میرے دل میں کچھ کھٹکنے لگا ، چنانچہ میں حضر ت ابو ہریرۃ رضی اللہ تعالیٰ عنہ کی خدمت میں حاضر ہوا اور ان سے پوچھا تو ا نھوں نے ان ( ابن عباس رضی اللہ تعالیٰ عنہ ) کے قول کی تصدیق کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 1637,
			"arabicnumber": "705.08",
			"text": "عمران بن خدیرنے عبداللہ بن شقیق عقیلی سے روایت کی ، انھوں نے کہا : ایک شخص نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے کہا : نماز! آپ خاموش رہے اس نے پھر کہا : نماز! آپ پھر چپ رہے ، اس نے پھر کہا : نماز! تو آپ ( کچھ دیر ) چپ رہے ، پھر فرمایا : تیری ماں نہ ہو! کیاتو ہمیں نماز کی تعلیم دیتا ہے؟ہم رسول اللہ صلی اللہ علیہ وسلم کے دور میں دو نمازیں جمع کرلیاکرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 1638,
			"arabicnumber": "707.01",
			"text": "ابو معاویہ اور وکیع نے اعمش سے ، انھوں نے عمارہ سے ، انھوں نے اسود سے اور انھوں نے حضرت عبداللہ رضی اللہ تعالیٰ عنہ ( بن مسعود ) سے روایت کی ، کہا : تم میں سے کوئی شخص اپنی ذات میں سے شیطان کاحصہ نہ رکھے ( وہم اور وسوسے کا شکار نہ ہو ) یہ خیال نہ کرے کہ اس پر لازم ہے کہ وہ نماز سےدائیں کے علاوہ کسی اور جانب سے رخ نہ موڑے ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو اکثر دیکھا تھا ، آپ بائیں جانب سے رخ مبارک موڑتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 1639,
			"arabicnumber": "707.02",
			"text": "جریراور عیسیٰ بن یونس نے اسی سند کے ساتھ سابقہ حدیث کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 1640,
			"arabicnumber": "708.01",
			"text": "ابو عوانہ نے ( اسماعیل بن عبدالرحمان ) سدی سے روایت کہ ، انھوں نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے پوچھا : جب میں نماز پڑھ لوں تو اپنارخ کیسے موڑوں ، اپنی دائیں طرف یا اپنی بائیں طرف سے؟انھوں نے کہا : میں نے تو رسول اللہ صلی اللہ علیہ وسلم کو زیادہ تردائیں طرف سے رخ پھیرتے دیکھا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 1641,
			"arabicnumber": "708.02",
			"text": "سفیان بن عینیہ نے سدی سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم اپنی دائیں طرف سے رخ پھیراکرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 1642,
			"arabicnumber": "709.01",
			"text": "ا بن ابی زائدہ نے مسعر سے ، انھوں نے ثابت بن عبید سے انھوں نے حضرت براء رضی اللہ تعالیٰ عنہ کے بیٹے ( عبید ) سے اور انھوں نے حضرت براء رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا کہ جب ہم رسول اللہ صلی اللہ علیہ وسلم کے پیچھے نماز پڑھتے تو پسند کرتے تھے کہ ہم آپ کی دائیں طرف ہوں ، آپ ہماری طرف رخ فرمائیں ۔ ( براء رضی اللہ تعالیٰ عنہ نے ) کہا : میں نے ( ایسے ہی ایک موقع پر ) آپ کو یہ فرماتے ہوئےسنا : \" اے میرےرب ! تو جب اپنے بندوں کو اٹھائے گا یا جمع کرے گا اس دن مجھے اپنے عذاب سے بچانا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 1643,
			"arabicnumber": "709.02",
			"text": "وکیع نے مسعر سے اسی سند کے ساتھ یہ حدیث بیان کی اور ا نھوں نےيُقْبِلُ عَلَيْنَا بِوَجْهِهِ ( آپ ہماری طرف رخ فرمائیں ) کے الفاظ ذکر نہیں کئے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 1644,
			"arabicnumber": "710.01",
			"text": "شعبہ نے ورقاء سے انھوں نے عمرو بن دینار سے ، انھوں نے عطاء بن یسار سے ، انہوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فرمایا ، \" جب نماز کے لئے اقامت ہوجائے تو فرض نماز کے سوا کوئی نماز نہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 1645,
			"arabicnumber": "710.02",
			"text": "(شعبہ کی بجائے ) شبابہ نے ورقاء سے یہی روایت اسی سند کے ساتھ بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 1646,
			"arabicnumber": "710.03",
			"text": "روح نے کہا : ہمیں زکریا بن اسحاق نے حدیث سنائی ، انھوں نے کہا ، ہمیں عمرو بن دینار نے حدیث سنائی ، انہوں نے کہا : میں نے عطاء بن یسار سے سنا وہ کہہ رہے تھے : حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" جب نماز کے لئے اقامت کہی جائے تو فرض نماز کے سوا کوئی نماز نہیں ہوتی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 1647,
			"arabicnumber": "710.04",
			"text": "(روح کی بجائے ) عبدالرزاق نے خبر دی کہ ہمیں زکریا بن اسحاق نے اسی سند کے ساتھ اسی طرح خبر دی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 1649,
			"arabicnumber": "711.01",
			"text": "عبداللہ بن مسلمہ قعنبی نے ہمیں حدیث بیان کی ، کہا ہمیں ابراہیم بن سعد نے اپنے والد سے حدیث سنائی ۔ انھوں نے حفص بن عاصم سے اور ا نھوں نے عبداللہ بن مالک ابن بحینہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم ایک شخص کے پاس سے گزرے جو نماز پڑھ رہاتھا جب صبح کی نماز کے لئے اقامت کہی جاچکی تھی آپ نے کسی چیز کے بارے میں اس سے گفتگو فرمائی ہم نہ جان سکے کہ وہ کیا تھی جب ہم نماز سے فارغ ہوئے تو ہم نے اسے گھیرلیا ہم پوچھ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے تم سے کیا کہا؟اس نے بتایا : آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \"\" لگتا ہے کہ تم میں سے کوئی صبح کی چار رکعات پڑھنے لگے گا ۔ \"\" قعنبی نے کہا : عبداللہ بن مالک ابن بحینہ نے رضی اللہ تعالیٰ عنہ نے اپنے والد سے روایت کی ۔ ابو الحسین مسلم ؒ ( مولف کتاب ) نے کہا : قعنبی کا اس حدیث میں \"\" عَنْ أَبِيهِ \"\" ( والد سے روایت کی ) کہنا درست نہیں ۔ ( عبداللہ کے والد صحابی مالک صحابی تو ہیں لیکن ان سے کوئی حدیث مروی نہیں)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 1650,
			"arabicnumber": "711.02",
			"text": "ابو عوانہ نے سعد بن ابراہیم سے ، انہوں نے حفص بن عاصم سے ، اورانہوں نے حضرت ( عبداللہ ) ابن بحینہ رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : صبح کی نماز کی اقامت ( شروع ) ہوئی تو رسول اللہ صلی اللہ علیہ وسلم نے ایک شخص کو نماز پڑھتے دیکھا جبکہ موذن اقامت کہہ رہا ہے تو آپ نے فرمایا : \" کیا تم صبح کی چار رکعتیں پڑھو گے؟",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 1651,
			"arabicnumber": "712",
			"text": "حضرت عبداللہ بن سرجس ( المزنی حلیف بنی مخزوم رضی اللہ تعالیٰ عنہ ) سے روایت ہے ، انھوں نے کہا : ایک آدمی مسجد میں آیا جبکہ رسول اللہ صلی اللہ علیہ وسلم صبح کی نماز پڑھا رہے تھے ، اس نے مسجد کے ایک کونے میں دو رکعتیں پڑھیں ، پھر رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز میں شریک ہوگیا ، جب ر سول اللہ صلی اللہ علیہ وسلم نے سلام پھیرا تو فرمایا : \" اے فلاں! تو نے دو نمازوں میں سے کون سی نماز کو شمار کیا ہے؟اپنی اس نماز کو جو تم نے اکیلے پڑھی ہے یا اس کو جو ہمارے ساتھ پڑھی ہے؟",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 1652,
			"arabicnumber": "713.01",
			"text": "(یحییٰ بن یحییٰ نے کہا : ہمیں سلمان بن بلال نے ربعیہ بن عبدالرحمان سے خبر دی ، انھوں نے عبدالملک بن سعید سے ، اور انھوں نے حضرت ابو حمید رضی اللہ تعالیٰ عنہ ۔ یا حضرت ابو اسید رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا \"\" جب تم میں سے کوئی شخص مسجد میں داخل ہوتو کہے \"\" اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ \"\" اے اللہ! میرے لئے اپنی رحمت کے دروازے کھول دے ۔ اور جب مسجد سے نکلے تو کہے \"\" اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ \"\" اے اللہ! میں تجھ سے تیرے فضل کا سوال کرتاہوں ۔ \"\" امام مسلم ؒ نے کہا : میں نے یحییٰ بن یحییٰ س سنا ، وہ کہتے تھے ، میں نے یہ حدیث سلیمان بن بلال کی کتاب سے لکھی ہے ، انھوں نے کہا : مجھے یہ خبر پہنچی ہے ۔ کہ یحییٰ حمانی شک کے بغیر ) \"\" وأبي أسيداور ابو اسید \"\" سے کہتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 1653,
			"arabicnumber": "713.02",
			"text": "(سلیمان بن بلال کے بجائے ) عمارہ بن غزیہ نے ربیعہ بن ابی عبدالرحمان سے روایت کی ، انھوں نے عبدالملک بن سعید بن سوید انصاری سے ۔ انھوں نے حضرت ابو حمید ۔ ۔ ۔ یا حضرت ابو اسید رضی اللہ تعالیٰ عنہ سے اور ا نھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 1654,
			"arabicnumber": "714.01",
			"text": "عامر بن عبداللہ بن زبیر نے عمرو بن سلیم زرقی سے اور انھوں نے حضرت ابو قتادہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص مسجد میں داخل ہوتو بیٹھنے سے پہلے دو رکعت نماز پڑھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 1655,
			"arabicnumber": "714.02",
			"text": "محمد بن یحییٰ بن حبان نے عمرو بن سلیم بن خلدہ انصاری سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے صحابی حضرت ابو قتادہ رضی اللہ تعالیٰ عنہ سے ر وایت کی ، کہا : میں مسجد میں داخل ہوا جبکہ رسول اللہ صلی اللہ علیہ وسلم لوگوں کے درمیان تشریف فرما تھے کہا : تو میں بھی بیٹھ گیا ، اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تمھیں بیٹھنے سے پہلے دو رکعات نماز پڑھنے سے کس چیز نے روکا ہے؟ \" میں نے عرض کی : اےا للہ کے رسول صلی اللہ علیہ وسلم !میں نے آپ کو بیٹھتے دیکھا ہے اور لوگ بھی بیٹھے تھے ( اس لئے میں بھی بیٹھ گیا ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص مسجد میں آئے تو دو رکعت نماز پڑھےبغير نہ بیٹھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 1656,
			"arabicnumber": "715.01",
			"text": "سفیان بن محارب بن وثار سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میرا نبی اکرم صلی اللہ علیہ وسلم کے ذمے قرض تھا ، آپ نے اسے ادا کیا اور مجھے زائد رقم دی اور جب میں آپ کی مسجد میں داخل ہوا تو آپ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" دو رکعت نماز ادا کرلو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 1657,
			"arabicnumber": "715.02",
			"text": "شعبہ نے محارب سے روایت کی ، انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے ایک اونٹ خریدا ، جب آپ صلی اللہ علیہ وسلم مدینہ پہنچے تو آپ صلی اللہ علیہ وسلم نے مجھے حکم دیا کہ میں مسجد میں آؤں ، اور دو رکعتیں پڑھوں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 1658,
			"arabicnumber": "715.03",
			"text": "وہب بن کیسان نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں ایک غزوے میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلا ، میرے اونٹ نے مجھے دیر کرادی اور تھک گیا ۔ رسول اللہ صلی اللہ علیہ وسلم مجھ سے پہلے مدینہ میں آگئے اور میں اگلے دن پہنچا ، میں مسجد میں آیا تو میں نے آپ صلی اللہ علیہ وسلم کو مسجد کے دروازے پر پایا ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" تم اب اس وقت تک پہنچے ہو؟ \" میں نے کہا : جی ہاں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اپنا اونٹ چھوڑ دو اور مسجد میں داخل ہوکر دو رکعتیں پڑھو ۔ \" میں مسجد میں داخل ہوا ، نماز پڑھی ، پر واپس ( آپ صلی اللہ علیہ وسلم کے پاس ) آیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 1659,
			"arabicnumber": "716",
			"text": "حضرت کعب بن مالک رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم دن میں چاشت کے وقت کے سوا ( کسی اور وقت ) سفر سے واپس تشریف نہ لاتے ، پھر جب تشریف لاتے تو مسجد جاتے ، اس میں دو رکعتیں ادا کرتے ، پھر ( کچھ دیر ) وہیں تشریف رکھتے ( تاکہ گھر والوں کو آپ صلی اللہ علیہ وسلم کی آمد کا علم ہوجائے ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 1660,
			"arabicnumber": "717.01",
			"text": "سعید جزیری نے عبداللہ بن شقیق سے روایت کی ، انھوں نےکہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے پوچھا : کیا نبی اکرم صلی اللہ علیہ وسلم چاشت کی نماز پڑھتے تھے؟انھوں نے کہا : نہیں ، الا یہ کہ باہر ( سفر ) سے واپس آئے ہوں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 1661,
			"arabicnumber": "717.02",
			"text": "کیمس بن حسن قیسی نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے پوچھا : کیانبی اکرم صلی اللہ علیہ وسلم چاشت کی نماز پڑھا کرتے تھے؟ انھوں نے جواب دیا : نہیں الا یہ کہ سفر سے واپس آئے ہوں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 1662,
			"arabicnumber": "718",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے ، انھوں نے کہا : میں نے کبھی ر سول اللہ صلی اللہ علیہ وسلم کو ( گھر میں قیام کے دوران میں ) چاشت کے نفل پڑھتے نہیں دیکھا ، جبکہ میں چاشت کی نماز پڑھتی ہوں ۔ یہ بات یقینی ہے کہ رسول اللہ صلی اللہ علیہ وسلم کسی کام کو کرنا پسند فرماتے تھے ۔ لیکن اس ڈر سے کہ لوگ ( بھی آپ کو دیکھ کر ) وہ کام کریں گےاور ( ان کی د لچسپی کی بناء پر ) وہ کام ان پر فرض کردیا جائے گا ، آپ صلی اللہ علیہ وسلم اس کام کو چھوڑ دیتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 1663,
			"arabicnumber": "719.01",
			"text": "عبدالوارث نے کہا : ہمیں یزید رشک نے حدیث سنائی ، انھوں نے کہا ، مجھے معاذہ نے حدیث سنائی ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سوال کیا کہ رسول اللہ صلی اللہ علیہ وسلم چاشت کی نماز کتنی ( رکعتیں ) پڑھتے تھے؟انھوں نے جواب دیا چار رکعتیں اور جس قدر زیادہ پڑھنا چاہتے ( پڑھ لیتے ) ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 1664,
			"arabicnumber": "719.02",
			"text": "شعبہ نے یزید سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی اور یزید نے ( ماشاء کے بجائے ) ماشاء اللہ ( جتنی اللہ چاہتا ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 1665,
			"arabicnumber": "719.03",
			"text": "سعید نے کہا : قتادہ نے ہمیں حدیث بیان کی کہ معاذہ عدویہ نے ان ( حدیث سننے والوں ) کو حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث سنائی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم چاشت کی نماز چار رکعتیں پڑھتے تھے ۔ اور اللہ تعالیٰ جس قدر چاہتا زیادہ ( بھی ) پڑھ لیتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 1666,
			"arabicnumber": "719.04",
			"text": "معاذ بن ہشام نے روایت کی ، کہا : مجھے میرے والد نے قتادہ سے اسی سند کےساتھ یہی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 1667,
			"arabicnumber": "336.04",
			"text": "محمد بن مثنیٰ اور ابن بشار نے ہمیں حدیث بیان کی ، کہا : ہمیں محمد بن جعفر نے حدیث سنائی ، کہا : ہمیں شعبہ نے عمرو بن مرہ سے انھوں نے عبدالرحمان بن ابی لیلیٰ سے حدیث سنائی ، انھوں نے کہا : مجھے ام ہانی رضی اللہ تعالیٰ عنہا کے سوا کسی نے یہ نہیں بتایا کہ اس نے نبی اکرم صلی اللہ علیہ وسلم کو چاشت کی نماز پڑھتے دیکھا ۔ انھوں نے بتایا کہ فتح مکہ کے دن نبی اکرم صلی اللہ علیہ وسلم ان کے گھر میں تشریف لائے اور آپ نے آٹھ رکعتیں پڑھیں ، میں نے آپ کو کبھی اس سے ہلکی نمازپڑھتے نہیں دیکھا ، ہاں آپ رکوع اور سجود مکمل طریقے سے کررہے تھے ۔ ابن بشار نے اپنی روایات میں قط ( کبھی ) کا لفظ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 1668,
			"arabicnumber": "336.05",
			"text": "حرملہ بن یحیٰٰ اور محمد بن سلمہ مرادی دونوں نے مجھے حدیث بیان کی ، کہا : ہمیں عبداللہ بن وہب نے خبر دی ، انھوں نے کہا : مجھے یونس نے ابن شہاب سے خبر دی ، کہا : مجھے عبداللہ بن حارث کے بیٹے نے حدیث سنائی کہ ان کے والد عبداللہ بن حارث بن نوفل نے کہا : میں نے ( سب سے ) پوچھا اور میری یہ شدید خواہش تھی کہ مجھے کوئی ایک شخص مل جائے جو مجھے بتائے کہ رسول اللہ صلی اللہ علیہ وسلم نے چاشت کی نماز پڑھی ہے ۔ مجھے ام ہانی بنت ابی طالب رضی اللہ تعالیٰ عنہا کے سوا کوئی نہ ملا جو مجھے یہ بتاتا ۔ انھوں نے مجھے خبر دی کہ فتح مکہ کے دن رسول اللہ صلی اللہ علیہ وسلم دن بلند ہونے کے بعد تشریف لائے ، ایک کپڑا لا کر آپ کو پردہ مہیا کیاگیا ، آپ نے غسل فرمایا ، پھر آپ کھڑ اہوئے اور آٹھ رکعتیں پڑھیں ۔ میں نہیں جانتی کہ ان میں آپ کا قیام ( نسبتاً ) زیادہ لمبا تھا یا آپ کا رکوع یا آپ کا سجود یہ سب ( ارکان ) قریب قریب تھے اور انھوں نے ( ام ہانی رضی اللہ تعالیٰ عنہا ) نے بتایا ، میں نے ا س سے پہلے اور اس کے بعد آپ کو نہیں دیکھا کہ آپ نے یہ نماز پڑھی ہو ۔ ( محمد بن مسلمہ ) مرادی نے اپنی روایت میں \"\" یونس سے روایت ہے \"\" کہا ۔ \"\" مجھے یونس نے خبر دی \"\" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 1669,
			"arabicnumber": "336.06",
			"text": "ابو نضر سے روایت ہے کہ ام ہانی بنت ابی طالب رضی اللہ تعالیٰ عنہا کو یہ کہتے ہوئے سنا کہ میں فتح مکہ کے سال رسول اللہ صلی اللہ علیہ وسلم کی طرف گئی تو میں نے آپ صلی اللہ علیہ وسلم کو نہاتے ہوئے پایا جبکہ آپ کی بیٹی فاطمہ رضی اللہ تعالیٰ عنہا آپ کو کپڑے سےچھپائے ہوئے تھیں ( آگے پردہ کیا ہوا تھا ) میں نے سلام عرض کیا ، آپ صلی اللہ علیہ وسلم نے پوچھا یہ کون ہے؟میں نے کہا : ام ہانی بنت ابی طالب ہوں ۔ آپ نے فرمایا : \" ام ہانی کو خوش آمدید! \" جب آپ نہانے سے فارغ ہوئے تو کھڑے ہوئے اور صرف ایک کپڑے میں لپٹے ہوئے آٹھ رکعتیں پڑھیں ، جب آپ نماز سے فارغ ہوگئے تو میں نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم میرا ماں جایا بھائی علی بن ابی طالب رضی اللہ تعالیٰ عنہ چاہتا ہے کہ ایک ایسے آدمی کو قتل کردے جسے میں نے پناہ دے چکی ہوں ۔ یعنی ہبیرہ کا بیٹا ، فلاں ، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : امی ہانی! جس کو تم نے پناہ دی اسے ہم نے بھی پناہ دی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 1670,
			"arabicnumber": "336.07",
			"text": "جعفر بن محمد ؒ کے والد محمد باقرؒ نے عقیل کے آزاد کردہ غلام ابو مرہ سے اور انھوں نے حضرت ام ہانی رضی اللہ تعالیٰ عنہا سے روایت کی کہ فتح مکہ کے سال رسول اللہ صلی اللہ علیہ وسلم نے ان کے گھر میں ایک کپڑے میں جس کے دونوں کنارے ایک دوسرے کی مخالف جانب ڈالے گئے تھے ، آٹھ رکعتیں پڑھیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 1671,
			"arabicnumber": "720",
			"text": "حضرت ابو زر رضی اللہ تعالیٰ عنہ نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" صبح کو تم میں سے ہر ایک شخص کے ہر جوڑ پر ایک صدقہ ہوتا ہے ۔ پس ہر ایک تسبیح ( ایک دفعہ \" سبحا ن الله \" کہنا ) صدقہ ہے ۔ ہر ایک تمحید ( الحمد لله کہنا ) ) صدقہ ہے ، ہر ایک تہلیل ( لااله الا الله کہنا ) صدقہ ہے ہرہر ایک تکبیر ( الله اكبرکہنا ) بھی صدقہ ہے ۔ ( کسی کو ) نیکی کی تلقین کرنا صدقہ ہے اور ( کسی کو ) برائی سے روکنا بھی صدقہ ہے ۔ اور ان تمام امور کی جگہ دو رکعتیں جو انسان چاشت کے وقت پڑھتا ہے کفایت کرتی ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 1672,
			"arabicnumber": "721.01",
			"text": "ابو تیاح نے کہا : ہمیں ابو عثمان نہدی نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے حدیث سنائی ، انھوں نے کہا : مجھے میر ےخلیل صلی اللہ علیہ وسلم نے تین چیزوں کی تلقین فرمائی ، ہر ماہ تین روزے رکھنے کی ، چاشت کی دورکعتوں کی اور اس بات کی کہ سونے سے پہلے وتر پڑھ لیا کروں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 1673,
			"arabicnumber": "721.02",
			"text": "عباس ، جریری ، اور ابو شمرضبعی ، دونوں نے کہا : ہم نے ابو عثمان نہدی سے سنا ، وہ حضرت ابوہریرۃ رضی اللہ تعالیٰ عنہ سے حدیث بیان کررہے تھے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی سابقہ حدیث کی مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 1674,
			"arabicnumber": "721.03",
			"text": "ابو رافع الصائغ نے کہا : میں نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ سے سنا ، انھوں نے کہا ، مجھے میرے خلیل ابو القاسم صلی اللہ علیہ وسلم نے تین باتوں کی تلقین فرمائی ۔ ۔ ۔ آگے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے ابو عثمان نہدی کی حدیث کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 1675,
			"arabicnumber": "722",
			"text": "حضرت ابو درداء رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : میرےحبیب صلی اللہ علیہ وسلم نے مجھے تین باتوں کی تلقین فرمائی ہے ، جب تک میں زندہ رہوں گا ان کو کبھی ترک نہیں کروں گا ، ہر ماہ تین دنوں کے روزے ، چاشت کی نماز اور یہ کہ جب تک وتر نہ پڑھ لوں نہ سوؤں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 1676,
			"arabicnumber": "723.01",
			"text": "امام مالک ؒ نے نافع سے اور انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ ام المومنین حضرت حفصہ رضی اللہ تعالیٰ عنہا نے انھیں بتایاکہ جب موذن صبح کی اذان کہہ کر خاموش ہوجاتا اور صبح ظاہر ہوجاتی تو رسول اللہ صلی اللہ علیہ وسلم نماز کی اقامت سے پہلے دو مختصر رکعتیں پڑھتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 1677,
			"arabicnumber": "723.02",
			"text": "لیث بن سعد ، عبیداللہ اور ایوب سب نے نافع سے اسی سند کے ساتھ اسی طرح روایت بیان کی ہے جس طرح امام مالک ؒ نے کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 1678,
			"arabicnumber": "723.03",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے زید بن محمد سے حدیث سنائی ، انھوں نے کہا : میں نے نافع سے سنا ، وہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے تھے اور وہ حضرت حفصہ رضی اللہ تعالیٰ عنہا سے روایت بیان کررہے تھے حضرت حفصہ رضی اللہ تعالیٰ عنہا نے کہا : جب فجر طلوع ہوجاتی تو رسول اللہ صلی اللہ علیہ وسلم دو مختصر رکعتوں کے سوا کوئی نماز نہ پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 1679,
			"arabicnumber": "723.04",
			"text": "(محمد بن جعفر کی بجائے ) نضر نے ہمیں خبر دی ، کہا : شعبہ نے اسی سند کے ساتھ اسی سابقہ حدیث کی مانند حدیث بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 1680,
			"arabicnumber": "723.05",
			"text": "سالم نے اپنے والد ( عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا : حضرت حفصہ رضی اللہ تعالیٰ عنہا نے مجھے خبر دی کہ نبی اکرم صلی اللہ علیہ وسلم کے سامنے جب فجر روشن ہوجاتی تو آپ دو رکعتیں نماز پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 1681,
			"arabicnumber": "724.01",
			"text": "عبدہ بن سلیمان نے کہا : ہمیں ہشام بن عروہ نے اپنے والد کے حوالے سے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم اذان سنتے تو فجر کی دو رکعتیں پڑھتے اور ان میں تخفیف کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 1682,
			"arabicnumber": "724.02",
			"text": "علی بن مسہر ، ابو اسامہ ، عبداللہ بن نمیر ، اور وکیع سب نے ہشام سے اسی سند کے ساتھ یہی حدیث روایت کی ، البتہ ابو اسامہ کی روایت میں ( جب اذان سننے کی بجائے ) \" جب فجر طلوع ہوتی \" کے الفاظ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 1683,
			"arabicnumber": "724.03",
			"text": "ابو سلمہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم صبح کی نماز کی اذان اور اقامت کے درمیان دو رکعتیں پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 1684,
			"arabicnumber": "724.04",
			"text": "یحییٰ بن سعید نے کہا : مجھے محمد بن عبدالرحمان نے بتایا کہ انھوں نے عمرہ کوحضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کرتے ہوئے سنا وہ کہا کرتی تھیں کہ رسول اللہ صلی اللہ علیہ وسلم صبح کی ( سنت ) دورکعتیں پڑھتے اور ان کو اتنا ہلکا پڑھتے کہ میں ( دل میں ) کہتی تھی : کیا آپ نے ان میں فاتحہ بھی پڑھی ہے یا نہیں؟ ( آپ صلی اللہ علیہ وسلم عموما فاتحہ بھی بہت ٹھر ٹھر کر پڑھتے تھے ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 1685,
			"arabicnumber": "724.05",
			"text": "شعبہ نے محمد بن عبدالرحمان انصاری سے روایت کی ۔ انھوں نے عمرہ بنت عبدالرحمان سے سنا ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا جب فجر طلوع ہوجاتی تو رسول اللہ صلی اللہ علیہ وسلم دو رکعتیں ادا کرتے ۔ ( دل میں ) کہتی کیا آ پ صلی اللہ علیہ وسلم ان میں فاتحہ پڑھتے ہیں؟",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 1686,
			"arabicnumber": "724.06",
			"text": "یحییٰ بن سعید نے ابن جریج سے روایت کی ، انھوں نے کہا : مجھے عطاء بن عبید بن عمیر سے حدیث سنائی اور ا نھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سےروایت کی کہ نبی کریم صلی اللہ علیہ وسلم نوافل میں سے کسی اور ( نماز ) کی اتنی زیادہ پاسداری نہیں کرتے تھے جتنی آپ صبح سے پہلے کی دو رکعتوں کی کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 1687,
			"arabicnumber": "724.07",
			"text": "حفص نے ابن جریج سے باقی ماندہ اسی سند کے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو کسی بھی نفل ( کی ادائیگی ) کے لئے اسقدر جلدی کرتے نہیں دیکھاجتنی جلدی آپ نماز فجر سے پہلے کی دو رکعتوں کے لئے کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 1688,
			"arabicnumber": "725.01",
			"text": "ابو عوانہ نے قتادہ سے ، انھوں نے زرارہ بن اوفیٰ سے ، انھوں نے سعد بن ہشام سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے اور ا نھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" فجر کی دو رکعتیں دنیا اور جو کچھ دنیا میں ہے ، اس سے بہتر ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 1689,
			"arabicnumber": "725.02",
			"text": "معتمر کے والد سلیمان بن طرخان نے قتادہ سے اسی سند کے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے طلوع فجر کے وقت کی دورکعتوں کے بارے میں فرمایا : \" وہ دو ( رکعتیں ) مجھے ساری دنیا سے زیادہ پسند ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 1690,
			"arabicnumber": "726",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فجر کی دو رکعتوں میں ( قُلْ يَا أَيُّهَا الْكَافِرُ‌ونَ ) اور ( قُلْ هُوَ اللہ أَحَدٌ ) تلاوت کیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 1691,
			"arabicnumber": "727.01",
			"text": "مروان بن معاویہ فزاری نے عثمان بن حکیم انصاری سے حدیث بیان کی ، انھوں نے کہا : مجھے سعید بن یسار نے بتایا کہ انھیں حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے خبردی کہ رسول اللہ صلی اللہ علیہ وسلم فجر کی دو رکعتوں میں سے پہلی میں ( قرآن مجید سے آیت ) ( قُولُوا آمَنَّا بِاللَّـهِ وَمَا أُنزِلَ إِلَيْنَا ) ( والاحصہ ) پڑھتے جو سورہ بقرہ کی آیت ہے اور دوسری میں ( آل عمران کی آیت ) ( آمَنَّا بِاللہ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ ) ( والا حصہ ) پڑھتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 1692,
			"arabicnumber": "727.02",
			"text": "ابو خالد احمر نے عثمان بن حکیم سے ، انھوں نے سعید بن یسار سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم فجر کی دو رکعتوں میں ( قرآن مجید میں سے ) ( قُولُوا آمَنَّا بِاللَّـهِ وَمَا أُنزِلَ إِلَيْنَا ) ( والا حصہ ) اور جو سورہ آل عمران میں ہے ( تَعَالَوْا إِلَىٰ كَلِمَةٍ سَوَاءٍ بَيْنَنَا وَبَيْنَكُمْ ) ( والاحصہ ) پڑھا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 1693,
			"arabicnumber": "727.03",
			"text": "عیسی بن یونس نے عثمان بن حکیم سے اسی سندکے ساتھ مروان فزاری کی حدیث کی طرح حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 1694,
			"arabicnumber": "728.01",
			"text": "ابو خالد سلیمان بن حیان نے داود بن ابی سند سے حدیث بیان کی ، انہوں نے نعمان بن سالم سے اور انھوں نے عمرہ بن اوس سے روایت کی ، انھوں نے کہا : مجھے عنبسہ بن ابی سفیان نے اپنے مرض الموت میں ایک ایسی حدیث سنائی جس سے انتہائی خوشی حاصل ہوتی ہے ، کہا : میں نے ام حبیبہ رضی اللہ تعالیٰ عنہا سے سنا وہ کہتی تھیں : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا \"\" جس نے ایک دن اور ایک رات میں بارہ رکعات ادا کیں اس کے لئے ان کے بدلے جنت میں ایک گھر بنا دیاجاتا ہے ۔ \"\" ام حبیبہ رضی اللہ تعالیٰ عنہا نے کہا : جب سے میں نے ان کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے سنا ، میں نے انھیں کبھی ترک نہیں کیا ۔ عنبسہ نے کہا : جب سے میں نے ان کے بارے میں حضرت ام حبیبہ رضی اللہ تعالیٰ عنہا سے سنا ، میں نے انھیں کبھی ترک نہیں کیا ۔ عمرو بن اوس نے کہا : جب سے میں نے ان کے بارے میں عنبسہ سے سنا ، میں نے انھیں کبھی ترک نہیں کیا ۔ نعمان بن سالم نے کہا : جب سے میں نے عمرو بن اوس سے ان کے بارے میں سنا ، میں نے انھیں کبھی ترک نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 1695,
			"arabicnumber": "728.02",
			"text": "بشر بن مفضل نے کہا : ہمیں داود نے نعمان بن سالم سے اسی سندکے ساتھ یہ حدیث بیان کی ، \" جس نے ایک دن میں بارہ رکعات نوافل پڑے اس کے لئے جنت میں گھر بنایا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 1696,
			"arabicnumber": "728.03",
			"text": "محمد بن جعفر نے کہا : ہمیں شعبہ نے نعمان بن سالم سے حدیث سنائی ، انھوں نے عمرو بن اوس سے انھوں نے عنبسہ بن ابی سفیان سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم کی زوجہ محترمہ ام حبیبہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے سنا آ پ صلی اللہ علیہ وسلم فرمارہے تھے : ”کوئی ایسا مسلمان بندہ نہیں جو ہر روز اللہ کے لئے فرائض کے علاوہ بارہ رکعات سنتیں ادا کرتا ہے مگر اللہ اس کے لئے جنت میں ایک گھر بنا دیتا ہے ۔ یا اس کے لئے جنت میں ایک گھر بنا دیاجاتا ہے ۔ ام حبیبہ رضی اللہ تعالیٰ عنہا نے کہا : میں اب تک انھیں مسلسل اداکرتے آرہی ہوں ۔ عمرو نے کہا : میں اب تک ان کو ہمیشہ ادا کر تا آرہاہوں ۔ نعمان نے بھی اس کے مطابق کہا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 1697,
			"arabicnumber": "728.04",
			"text": "بہز نے شعبہ سے باقی ماندہ سابقہ سندکے ساتھ حضرت ام حبیبہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس بھی مسلمان بندے نے اہتمام کے ساتھ مکمل وضو کیا ، پھر اللہ کی رضا کی خاطر ہر روز ( نفل ) نماز پڑھی ۔ ۔ ۔ \" اور اسی کے مطابق روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 1698,
			"arabicnumber": "729",
			"text": "حضرت ابن عمر سے رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ظہر سے پہےلے دورکعتیں پڑھیں اور اس کے بعد دو رکعتیں اور مغرب کے بعد دورکعتیں اور عشاء کے بعد دورکعتیں اور جمعے کے بعد دو رکعتیں ادا کیں ۔ جہاں تک مغرب ، عشاء اور جمعے ( کی سنتوں ) کا تعلق ہے ، وہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ آپ کے گھر میں پڑھیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 1699,
			"arabicnumber": "730.01",
			"text": "خالد نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا ، میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی نفل نماز کے بارے میں سوال کیا؟تو انھوں نے جوابدیا : آپ میرے گھر میں ظہر سے پہلے چار رکعت پڑھتے ، پھر ( گھر سے ) نکلتے اور لوگوں کو نماز پڑھاتے ، پھر گھر واپس آتے اور دو رکعتیں ادا فرماتے ۔ اور آپ لوگوں کو مغرب کی نماز پڑھاتے پھر گھر آتے اور دو رکعت نماز پڑھتے ، اور لوگوں کو عشاء کی نماز پڑھاتے اور میرے گھر آتے اور دو رکعتیں پڑھتے ، ان میں وتر شامل ہوتے ، اور طویل رات کھڑے ہوکر اور طویل ر ات بیٹھ کر نماز ادا کرتے اور جب کھڑے ہوکر قراءت کرتے تو رکوع اور سجدہ بھی کھڑے ہوکر کرتے اور جب بیٹھ کر قراءت کرتے تو رکوع اور سجدہ بھی بیٹھ کر کرتے اور جب فجر طلوع ہوتی تو دو رکعتیں پڑھتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 1700,
			"arabicnumber": "730.02",
			"text": "حماد نے بدیل اورایوب سے روایت کی ، انھوں نے عبداللہ بن شقیق سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم رات کو لمبا وقت نماز پڑھتے رہتے ، پس جب آپ کھڑے ہوکر نماز پڑھتے تو کھڑے کھڑے رکوع کرتے اور جب بیٹھ کر نماز پڑھتے تو بیٹھے ہوئے رکوع کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 1701,
			"arabicnumber": "730.03",
			"text": "شعبہ نے بدیل سے حدیث سنائی انھوں نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا : میں فارس ( ایران ) میں بیمار تھا ، اس لئے بیٹھ کر نماز پڑھتا تھا ۔ میں نے اس کے بارے میں حضرت عائشہ رضی اللہ تعالیٰ عنہا رضی اللہ تعالیٰ عنہ سے پوچھا تو انھوں نے جواب دیا : رسول اللہ صلی اللہ علیہ وسلم رات کو لمباوقت کھڑے ہوکر نماز پڑھتے تھے ۔ ۔ ۔ اس کے بعد ( اسی طرح ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 1702,
			"arabicnumber": "730.04",
			"text": "حمید نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہ سے رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز کے بارے میں سوا ل کیاتو ا نھوں نے جواب دیا : آپ رات کو لمبا وقت کھڑے ہوکر نماز پڑھتے اور رات کو لمبا وقت بیٹھ کر نماز پڑھتے اور جب آپ کھڑے ہوکر قراءت کرتے تو کھڑے کھڑے رکوع کرتے اور جب بیٹھ کر قراءت کرتے تو بیٹھے بیٹھے رکوع کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 1703,
			"arabicnumber": "730.05",
			"text": "محمد بن سیرین نے عبداللہ بن شقیق عقیلی سے روایت کی ، انھوں نے کہا : ہم لوگوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا س رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں پوچھا تو انھوں نے کہا آپ کثرت سے کھڑ ے ہوکراور بیٹھ کر نماز پڑھتے تھے ۔ جب آپ کھڑے ہوکر نماز کا آغازفرماتے تو کھڑے کھڑے رکوع کرتے اور جب آپ بیٹھے ہوئے نماز کا آغاز کرتے تو بیٹھے ہوئے رکوع کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 1704,
			"arabicnumber": "731.01",
			"text": "ہشام بن عروہ سے روایت ہے ، کہا : مجھے میرے والد نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے خبر دی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو نہیں دیکھا تھا کہ آپ نے رات کی نماز کے کسی حصے میں بیٹھ کر قراءت کی ہو یہاں تک کہ جب آپ کی عمر زیادہ ہوگئی تو آپ بیٹھ کر قراءت کرتے اور جب سورت کی تیس یا چالیس آیتیں ر ہ جاتیں تو کھڑے ہوکر انھیں پڑھتے پھر رکوع کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 1705,
			"arabicnumber": "731.02",
			"text": "ابو سلمہ بن عبدالرحمان نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر ( بھی ) نماز پڑھتے تھے ، آپ بیٹھے ہوئے قراءت فرماتے جب آپ کی قراءت سے اتنا حصہ بچ جاتا جتنی تیس یا چالیس آیتیں ہوتی ہیں تو آپ کھڑ ے ہوجاتے اور کھڑے ہوئے ان کی قراءت فرماتے پھر رکوع کرتے پھر سجدہ کرتے ، پھر دوسری رکعت میں ایسا ہی کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 1706,
			"arabicnumber": "731.03",
			"text": "عمرہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم بیٹھے ہوئے قراءت فرماتے ، پس جب رکوع کرناچاہتے تو اتنی دیر کے لئے کھڑے ہوجاتے جتنی دیر میں ایک انسان چالیس آیتیں پڑھ لیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 1707,
			"arabicnumber": "731.04",
			"text": "علقمہ بن وقاص سے روایت ہے ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے پوچھا : جب رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر دو رکعتیں پڑھتے تو کیا کرتے تھے؟انھوں نے جواب دیا : آپ ان میں قراءت کرتے رہتے ، جب رکوع کرنے کا ارادہ کرتے تو کھڑے ہوجاتے پھر ر کوع کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 1708,
			"arabicnumber": "732.01",
			"text": "سعید بن جریری نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے کہا : کیا رسول اللہ صلی اللہ علیہ وسلم بیٹھ کر نماز پڑھ لیتے تھے؟انہوں نے کہا : ہاں ، جب لوگوں ( کے معاملات کی دیکھ بھال اورفکر مندی ) نے آپ کو بوڑھا کردیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 1709,
			"arabicnumber": "732.02",
			"text": "کہمس نے عبداللہ بن شقیق سے روایت کی ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے کہا ۔ ۔ ۔ پھر نبی کریم صلی اللہ علیہ وسلم سے اسی طرح روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 1710,
			"arabicnumber": "732.03",
			"text": "ابو سلمہ بن عبدالرحمان نے خبر دی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے انھیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم کا انتقال نہیں ہوا یہاں تک کہ آپ کی نماز کا بہت سا حصہ بیٹھے ہوئے ہوتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 1711,
			"arabicnumber": "732.04",
			"text": "عبداللہ بن عروہ کے والد عروہ بن زبیر نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا : جب رسول اللہ صلی اللہ علیہ وسلم کا بدن زرا بڑھ گیا اور آپ بھاری ہوگئے تو آپ کی نماز کا زیادہ تر حصہ بیٹھے ہوئے ( ادا ) ہوتا تھا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 1712,
			"arabicnumber": "733.01",
			"text": "۔ امام مالک نے ابن شہاب سے ، انھوں نے سائب بن یزید سے ، انھوں نے مطلب بن ابی وداعہ سہمی سے اور انھوں نے حضرت حفصہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو نفل نماز بیٹھ کر کبھی نہ پڑھتے دیکھاتھا حتیٰ کہ آپ صلی اللہ علیہ وسلم کی وفات سے ایک سال پہلے کا زمانہ ہوا تو آپ نفل نماز بیٹھ کر پڑھنےلگے ۔ آپ سورت کی قراءت کرتے تو اسے ٹھہر ٹھہر کر پڑھتے حتیٰ کہ وہ طویل ترین سورت سے بھی لمبی ہوجاتی ۔ ( یعنی بیٹھ کر لیکن اور بھی زیادہ لمبی نماز پڑھتے)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 1713,
			"arabicnumber": "733.02",
			"text": "یونس اور معمر دونوں نے زہری سے اسی سند کے ساتھ اس کے مانند روایت کی ، البتہ ان دونوں ( یونس اور معمر ) نے ایک یا دو سال کہا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 1714,
			"arabicnumber": "734",
			"text": "حضرت جابربن سمرہ رضی اللہ تعالیٰ عنہ نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کی وفات نہ ہوئی یہاں تک کہ آپ ( رات کو ) بیٹھ کر نماز پڑھنے لگے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 1715,
			"arabicnumber": "735.01",
			"text": "جریر نے مجھے حدیث سنائی ، انھوں نے منصور سے ، انھوں نے ہلال بن یساف سے ، انھوں نے ابو یحییٰ سے اور انھوں نے حضرت عبداللہ بن عمرو ( بن حوص ) رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : مجھے بتایا گیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" بیٹھ کر آدمی کی نماز ( اجر میں ) آدھی نماز ہے ۔ \" انھوں نے کہا : ایک بار میں آپ کے پاس آیا اور میں نے آپ کو بیٹھ کر نماز پڑھتے ہوئے پایا تو میں نے اپنا ہاتھ آپ کے سر مبارک پر لگایا ۔ آپ نے ہوچھا : \" اے عبداللہ بن عمرو رضی اللہ تعالیٰ عنہ تمھیں کیا ہوا؟ میں نے عرض کی ، اے اللہ کے رسول صلی اللہ علیہ وسلم مجھے بتایا گیا کہ آپ نے فرمایا ہے \" بیٹھ کر آدمی کی نماز آدھی نماز کے برابر ہے ۔ \" جب کہ آپ بیٹھ کر نماز پڑھ رہے ہیں ۔ آپ نے فرمایا : \" ہاں ایسا ہی ہے لیکن میں تم میں سے کسی ایک طرح کا نہیں ہوں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 1716,
			"arabicnumber": "735.02",
			"text": "شعبہ اور سفیان دونوں نے منصور سے اسی سابقہ سند کے ساتھ حدیث بیان کی ، البتہ شعبہ کی روایت میں ہے : \" ابو یحییٰ الاعرج سے روایت ہے \" ( انھوں نے ابو یحییٰ کے ساتھ ان کے لقب الاعرج کا بھی ذکر کیا ہے)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 1717,
			"arabicnumber": "736.01",
			"text": "مالک نے ابن شہاب سے ، انھوں نے عروہ سے ، اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم رات کوگیارہ رکعت پڑھتے تھے ، ان میں سے ایک کے ذریعے وتر ادا فرماتے ، جب آپ اس ( ایک رکعت ) سے فارغ ہوجاتے تو آپ اپنے دائیں پہلو کے بل لیٹ جاتے یہاں تک کہ آپ کے پاس موذن آجاتا تو آپ دو ( نسبتاً ) ہلکی رکعتیں پڑھتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 1720,
			"arabicnumber": "737.01",
			"text": "عبداللہ بن نمیر نے ہمیں حدیث بیان کی اور کہا : ہمیں اپنے ہشام نے اپنے والد ( عروہ ) سے حدیث سنائی اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم رات کو تیرہ رکعتیں پڑھتے تھے ، ان میں سے پانچ رکعتوں کے ذریعے وتر ( ادا ) کرتے تھے ، ان میں آخری رکعت کے علاوہ کسی میں بھی تشہد کے لئے نہ بیٹھتے تھے ۔ ( بعض راتوں میں آپ صلی اللہ علیہ وسلم کا یہ معمول ہوتا)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 1721,
			"arabicnumber": "737.02",
			"text": "عبدہ بن سلیمان ، وکیع اور ابو اسامہ سب نے ہشام سے اسی سند کے ساتھ ( یہ ) روایت بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 1722,
			"arabicnumber": "737.03",
			"text": "عروہ بن مالک نے عروہ سے روایت کی کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے انھیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم فجر کی دو رکعتوں سمیت تیرہ ر کعتیں پڑھا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 1723,
			"arabicnumber": "738.01",
			"text": "سعید بن ابی سعید مقبری نے ابو سلمہ بن عبدالرحمان سے روایت کی کہ انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے پوچھا : رمضان میں رسول اللہ صلی اللہ علیہ وسلم کی نماز کیسے ہوتی تھی؟انھوں نے جواب دیا : رسول اللہ صلی اللہ علیہ وسلم رمضان اور اس کے علاوہ ( دوسرے مہینوں ) میں ( فجر سے پہلے ) گیارہ رکعتوں سے زائد نہیں پڑھتے تھے ، چار رکعتیں پڑھتے ، ان کی خوبصورتی اور ان کی طوالت کے بارے میں مت پوچھو ، پھر چار رکعتیں پڑھتے ، ان کے حسن اور طوالت کے بارے میں نہ پوچھو ، پھرتین رکعتیں پڑھتے ۔ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے کہا میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !کیا آپ وتر پڑھنے سے پہلے سوجاتے ہیں؟تو آپ نے فرمایا : اے عائشہ!میری آنکھیں سوتی ہیں اور میرا دل نہیں سوتا ۔ \" ( وہ بدستور اللہ کے ذکر میں مشغول ر ہتا ہے)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 1724,
			"arabicnumber": "738.02",
			"text": "ہشام نے یحییٰ سے اور انھوں نے ابو سلمہ سے ر وایت کی ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کے بارے میں سوا ل کیا تو انھوں نے کہا آپ تیرہ رکعتیں پڑھتے تھے ، آٹھ رکعتیں پڑھتے پھر ( ایک رکعت سے ) وتر ادا فرماتے ، پھر بیٹھے ہوئے دو رکعتیں پڑھتے ، پھر جب رکوع کرنا چاہتے تو اٹھ کھڑے ہوتے اور رکوع کرتے ، پھر صبح کی نماز کی اذان اور اقامت کے درمیان دو رکعتیں پڑھتے ۔ ( کبھی آپ صلی اللہ علیہ وسلم کی تہجد اور وتر کی ترتیب یہ بن جاتی تھی)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 1725,
			"arabicnumber": "738.03",
			"text": "شیبان اور معاویہ بن سلام نے یحییٰ بن ابی کثیر سے روایت کی ، انھوں نے کہا : مجھے ابو سلمہ نے بتایا کہ انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کی نمازکے بارے میں پوچھا ۔ ۔ ۔ آگے سابقہ حدیث کی طرح ہے ، البتہ ان دونوں کی روایت میں ہے : \" آپ صلی اللہ علیہ وسلم کھڑے ہوکر نو رکعتیں پڑھتے تھے وتر انھی میں ادا کرتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 1726,
			"arabicnumber": "738.04",
			"text": "عبداللہ بن ابی لبید سے روایت ہے کہ انھوں نے ابو سلمہ سے سنا ، انھوں نے کہا : میں حضرت عائشہ رضی اللہ تعالیٰ عنہا کی خدمت میں حاضر ہوا اور کہا : اے میری ماں!مجھے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں بتایئے ۔ تو انھوں نے کہا : رمضان اور غیر رمضان میں رات کے وقت آپ کی نماز تیرہ رکعتیں تھی ، ان میں فجر کی ( سنت ) دو کعتیں بھی شامل تھیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 1727,
			"arabicnumber": "738.05",
			"text": "قاسم بن محمد سے روایت ہے ، انھوں نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے سنا ، فرمارہی تھی : رسول اللہ صلی اللہ علیہ وسلم کی رات کی نماز دس رکعتیں تھی اور آپ ایک رکعت وتر ادا کرتے ، پھر فجر کی ( سنتیں ) دو رکعت پڑھتے ۔ اس طرح یہ تیرہ رکعتیں ہوئیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 1728,
			"arabicnumber": "739",
			"text": "ابو خثیمہ ( زہیر بن معاویہ ) نے ابو اسحاق سے خبر دی ، کہا : میں نے اسود بن یزید سے اس حدیث کے بارے میں پوچھا جو ان سے حضرت عائشہ رضی اللہ تعالیٰ عنہا نے رسول اللہ صلی اللہ علیہ وسلم کی نماز کے بارے میں بیان کی تھی ۔ انھوں ( عائشہ رضی اللہ تعالیٰ عنہا ) نے کہا : رسول اللہ صلی اللہ علیہ وسلم رات کے پہلے حصے میں سوجاتے اور آخری حصے کو زندہ کرتے ( اللہ کے سامنے قیام فرماتے ہوئے جاگتے ) پھر اگر اپنے گھر والوں سےکوئی ضرورت ہوتی تو اپنی ضرورت پوری کرتے اور سوجاتے ، پھر جب پہلی اذان کا وقت ہوتا تو عائشہ رضی اللہ تعالیٰ عنہا نے کہا : آپ اچھل کر کھڑے ہوجاتے ( راوی نے کہا : ) اللہ کی قسم!عائشہ رضی اللہ تعالیٰ عنہا نے وثب کہا ، قام ( کھڑے ہوتے ) نہیں کہا ۔ پھر اپنے اوپر پانی بہاتے ، اللہ کی قسم! انھوں نے اغتسل ( نہاتے ) نہیں کہا : \" اپنے اوپر پانی بہاتے \" میں جانتا ہوں ان کی مراد کیا تھی ۔ ( یعنی زیادہ مقدار میں پانی بہاتے ) اور اگر آپ جنبی نہ ہوتے تو جس طرح آدمی نماز کے لئے وضو کرتا ہے ، اسی طرح وضو فرماتے ، پھر دو رکعتیں ( سنت فجر ) ادا فرماتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 1729,
			"arabicnumber": "740",
			"text": "عمار بن زریق نے ابو اسحاق سے ، انھوں نے اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : رسول اللہ صلی اللہ علیہ وسلم ر ات کو نماز پڑھتے حتیٰ کہ ان کی نماز کا آخری حصہ وتر ہوتا ۔ ( اکثر آپ صلی اللہ علیہ وسلم کا معمول یہی تھا)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 1730,
			"arabicnumber": "741",
			"text": "مسروق نے کہا : میں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے رسول اللہ صلی اللہ علیہ وسلم کے عمل کے بارے میں پوچھا تو انھوں نے کہا : آپ کو ہمیشہ کیا جانے والا عمل پسند تھا ۔ میں نے کہا : آپ کس و قت نماز پڑھتے تھے؟تو انہو ں نے کہا : جب آپ مرغ کی آواز سنتے تو کھڑے ہوجاتے اور نماز پڑھتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": "742",
			"text": "ابو سلمہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے ر وایت کی ، انھوں نے کہا : سحر کے آخری حصے ( جب طلوع فجر سے بالکل پہلے سحر اپنی انتہا پر ہوتی ہے ) نے میرے گھر میں یا میرے پاس ، رسول اللہ صلی اللہ علیہ وسلم کو سوئے ہوئے ہی پایا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": "743.01",
			"text": "ابو نضر نے ابو سلمہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، کہا : نبی اکرم صلی اللہ علیہ وسلم جب فجر کی سنتیں پڑھ لیتے تو اگر میں جاگتی ہوتی میرے ساتھ گفتگو فرماتے ، ورنہ لیٹ جاتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": "743.02",
			"text": "ابن ابی عتاب نے ابو سلمہ سے ، انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": "744.01",
			"text": "عروہ بن زبیر نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم رات کو نماز پڑھتے رہتے ، جب وتر پڑھنے لگتے تو فرماتے : \" عائشہ ! اٹھو اور وتر پڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": "744.02",
			"text": "قاسم بن محمد نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم رات کو اپنی نماز پڑھتے اور وہ ( عائشہ رضی اللہ تعالیٰ عنہا ) آپ کے سامنے لیٹی ہوتی تھیں ، جب آپ کے وتر باقی رہ جاتے تو آپ انھیں جگا دیتے اور وہ وتر پڑھ لیتیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": "745.01",
			"text": "مسلم ( بن صبیح ) نے مسروق سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے رات کے ہر حصے میں وتر ( یارات ) کی نماز پڑھی ، ( لیکن عموماً ) آپ کے وتر سحری کے وقت تک پہنچتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": "745.02",
			"text": "یحییٰ بن وثاب نے مسروق سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے رات کے ہر حصے میں وتر ( رات ) کی نماز پڑھی ، رات کے ابتدائی حصے میں بھی ، درمیان میں بھی اور آخر میں بھی ، آپ کے وتر ( کے اوقات ) سحری تک جاتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": "745.03",
			"text": "ابو ضحیٰ نے مسروق سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے رات کےہرحصے میں وتر پڑھے ہیں ، ( لیکن عموماً ) آپ کے وتر رات کے آخری حصے تک چلتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": "746.01",
			"text": "ابن ابی عدی نے سعید ( ابن ابی عروبہ ) سے ، انھوں نے قتادہ سے اور انھوں نے زرارہ سے روایت کی کہ ( حضرت انس رضی اللہ تعالیٰ عنہ کے قریبی عزیز ) سعد بن ہشام بن عامر نے ارادہ کیا کہ اللہ تعالیٰ کی راہ میں جنگ ( جہاد ) کریں ، وہ مدینہ منورہ آگئے اور وہاں ا پنی ایک جائیداد فروخت کرنی چاہی تاکہ اس سے ہتھیار اور گھوڑے مہیا کریں اور موت آنے تک رومیوں کے خلاف جہاد کریں ، چنانچہ جب مدینہ آئے تو اہل مدینہ میں سے کچھ لوگوں سے ملے ، انھوں نے اس کو اس ارادے سے روکا اور ان کو بتایا کہ چھ افراد کے ایک گروہ نے نبی اکرم صلی اللہ علیہ وسلم کی حیات مبارکہ میں ایسا کرنے کاارادہ کیاتھا تو نبی اکرم صلی اللہ علیہ وسلم نے انہیں روک دیا تھا ۔ آپ نے فرمایا تھا : \"\" کیا میرے طرز عمل میں تمھارے لئے نمونہ نہیں ہیں؟ \"\" چنانچہ جب ان لوگوں نے انھیں یہ بات بتائی تو انھوں نے اپنی بیوی سے رجوع کرلیا جبکہ وہ اسے طلاق دے چکے تھے ، اور اس سے رجو ع کے لئے گواہ بنائے ۔ پھر حضرت ابن عباس رضی اللہ تعالیٰ عنہ کی خدمت میں حاضر ہوکر ان سے رسول اللہ صلی اللہ علیہ وسلم کے وتر ( بشمول قیام اللیل ) کے بارے میں سوال کیا تو حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : کیا میں تمھیں اس ہستی سے آگاہ نہ کروں ۔ جو روئے زمین کے تمام لوگوں کی نسبت ر سول اللہ صلی اللہ علیہ وسلم کے وتر کو زیادہ جاننے والی ہے؟سعد نے کہا : وہ کون ہیں؟انھوں نےکہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا ان کے پاس جاؤ اور پوچھو ، پھر ( دوبارہ ) میرے پاس آنا اور ان کا جواب مجھے بھی آکر بتانا ، ( سعدنے کہا : ) میں ان کی طرف چل پڑا اور ( پہلے ) حکیم بن افلح کے پاس آیا اور انھیں اپنے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس چلنے کو کہا تو انھوں نے کہا : میں ان کے پاس نہیں جاؤں گا کیونکہ میں نے انھیں ( آپس میں لڑنے والی ) ان دو جماعتوں کے بارے میں کچھ بھی کہنے سے روکا تھا ۔ تو وہ ان دونوں کے بارے میں اسی طریقے پر چلتے رہنے کے سوا اور کچھ نہ مانیں ۔ ( سعد نے ) کہا : تو میں نے انھیں قسم دی تو وہ آگئے ، پس ہم حضرت عائشہ رضی اللہ تعالیٰ عنہا کی طرف چل پڑے ، اور ان سے حاضری کی اجازت طلب کی ، انھوں نے اجازت مرحمت فرمادی اور ہم ان کے گھر ( دروازے ) میں داخل ہوئے ، انھوں نے کہا : کیا حکیم ہو؟انہوں نے اسے پہچان لیا ، اس نے کہا : جی ہاں ۔ تو انھوں نے کہا : تمہارے ساتھ کون ہے؟اس نے کہا : سعد بن ہشام ۔ انھوں نے پوچھا : ہشام کون؟ اس نے کہا : عامر رضی اللہ تعالیٰ عنہ ( بن امیہ انصاری ) کے بیتے ۔ تو انہوں نے ان کے لئے رحمت کی دعا کی اور کلمات خیر کہے ۔ قتادہ نے کہا : وہ ( عامر رضی اللہ تعالیٰ عنہ ) غزوہ احد میں شہید ہوگئے تھے ۔ میں نے کہا : ام المومنین! مجھے رسول اللہ صلی اللہ علیہ وسلم کے خلق مبارک کے بارے میں بتایئے ۔ انھوں نے کہا : کیاتم قرآن نہیں پڑھتے؟میں نے عرض کی : کیوں نہیں !انھوں نے کہا : اللہ کے نبی صلی اللہ علیہ وسلم کا اخلاق قرآن ہی تھا ( آپ کی سیرت وکردار قرآن کا عملی نمونہ تھی ) کہا : اس پر میں نے یہ چاہا کہ اٹھ ( کر چلا ) جاؤں اور موت تک کسی سے کچھ نہ پوچھوں ، پھر اچانک زہن میں آیا تو میں نے کہامجھے رسول اللہ صلی اللہ علیہ وسلم کے ( رات کے ) قیام کے بارے میں بتائیں ، تو انھوں نے کہا : کیا تم ( يَا أَيُّهَا الْمُزَّمِّلُ ) نہیں پڑ ھتے؟ میں نے عرض کی کیوں نہیں!انھوں نے کہا : اللہ تعالیٰ نے اس سورت کے آغاز میں رات کا قیام فرض قرار دیا تو نبی کریم صلی اللہ علیہ وسلم اور آپ کے ساتھیوں نے سال بھر قیام کیا اور اللہ تعالیٰ نے اس سورت کی آخری آیات بارہ ماہ تک آسمان پر روکے رکھیں یہاں تک کہ اللہ تعالیٰ نے اس سورت کے آخر میں تخفیف کا حکم نازل فرمایاتو رات کا قیام فرض ہونے کے بعد نفل ( میں تبدیل ) ہوگیا ۔ سعد نے کہا : میں نے عرض کی : اے ام المومنین ! مجھے رسول اللہ صلی اللہ علیہ وسلم کے وتر کے بارے میں بتایئے ۔ تو انھوں نے کہا : ہم آپ صلی اللہ علیہ وسلم کے لئے آپ کی مسواک اور آپ کے وضو کا پانی تیار کرکے رکھتے تھے اللہ تعالیٰ رات کو جب چاہتا ، آپ کو بیدار کردیتا تو آپ مسواک کرتے ، وضو کرتے اور پھر نو رکعتیں پڑھتے ، ان میں آپ آٹھویں کے علاوہ کسی رکعت میں نہ بیٹھتے ، پھر اللہ کا ذکر کرتے ، اس کی حمد بیان کرتے اور دعا فرماتے ، پھر سلام پھیرے بغیر کھڑے ہوجاتے ، پھر کھڑے ہوکرنویں رکعت پڑھتے ، پھر بیٹھتے اللہ کا ذکر اور حمد کرتے اور اس سے دعا کرتے ، پھر سلام پھیرتے جو ہمیں سناتے جو ہمیں سناتے پھر سلام ے بعد بیٹھ کر دو رکعتیں پڑھتے ، تو میرے بیٹے! یہ گیارہ رکعتیں ہوگئیں ۔ پھر جب رسول اللہ صلی اللہ علیہ وسلم کی عمر مبارک بڑھی اور ( جسم پر کسی حد تک ) گوشت چڑھ گیا ( جسم مبارک بھاری ہوگیا ) تو آپ سات وتر پڑھنے لگ گئے اور دو رکعتوں میں وہی کرتے جو پہلے کرتے تھے ( بیٹھ کر پڑھتے ) تو بیٹا!یہ نو رکعتیں ہوگئیں اور اللہ کے نبی صلی اللہ علیہ وسلم جب کوئی نماز پڑھتے تو آپ پسند کرتے کہ اس پرقائم رہیں اور جب نیند یا بیماری غالب آجاتی اور رات کا قیام نہ کرسکتے تو آپ دن کو بارہ رکعتیں پڑھ لیتے ۔ میں نہیں جانتی کہ اللہ کے نبی کریم صلی اللہ علیہ وسلم نے بھی پورا قرآن ایک رات میں پڑھا ہو اور نہ ہی آپ نے کسی رات صبح تک نماز پڑھی اور نہ رمضان کے سوا کبھی پورے مہینے کے روزے رکھے ۔ ( سعد نے ) کہا : پھر میں ابن عباس رضی اللہ تعالیٰ عنہ کی طرف گیا اور انھیں ان ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) کی حدیث سنائی تو انھوں نے کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نے سچ کہا ، اگر میں ان کے قریب ہوتا یا ان کے گھر جاتا ہوتا تو ان کے پاس جاتا تاکہ وہ مجھے یہ حدیث رو برو سناتیں ۔ ( سعد نے ) کہا : میں نےکہا : اگر مجھے علم ہوتا ہے کہ آپ ان کے ہاں حاضر نہیں ہوتے تو میں آپ کو ان کی حدیث نہ سناتا ( یہ سعد بالآخر سرزمین ہند میں شہید ہوئے)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": "746.02",
			"text": "(۔ معاذ بن ہشام نے قتادہ سے انھوں نے زراہ بن اوفیٰ سے اور انھوں نے سعد بن ہشام سے روایت کی کہ انھوں نے بیوی کو طلاق دے دی ، پھر مدینہ کی طرف روانہ ہوئے تاکہ اپنی جائیداد فروخت کریں ۔ ۔ ۔ آگے اسی سابقہ حدیث کی ) طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": "746.03",
			"text": "محمد بن بشر نے کہا : ہمیں سعید بن ابی عروبہ نے حدیث سنائی ، کہا : ہم سے قتادہ نے حدیث بیا ن کی ، انھوں نے زراہ بن اوفیٰ سے اور انھوں نے سعد بن ہشام سے رویت کی کہ انھوں نے کہا : میں حضرت عبداللہ ابن عباس رضی اللہ تعالیٰ عنہ کےپاس گیا اور ان سے وتر کےبارے میں سوال کیا ۔ ۔ ( اس کے بعد ) انھوں نے اپنے پورے قصے سمیت حدیث بیان کی اور اس میں کہا : انھوں ( حضرت عائشہ رضی اللہ تعالیٰ عنہا ) نے کہا : کون ہشام؟میں نے عرض کی : عامر رضی اللہ تعالیٰ عنہ کے بیٹے ۔ انھوں نے کہا : عامر بہت اچھے انسان تھے اُحد کے دن شہید ہوئے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": "746.04",
			"text": "معمر نے قتادہ سے اور انھوں نے زراہ بن اوفیٰ سے روایت کی کہ سعد بن ہشام ان کے پڑوسی تھے ، انھوں نے ان کو بتایا کہ انھوں نے اپنی بیوی کو طلاق دے دی ۔ ۔ آگے سعید ( بن ابی عروبہ ) کے ہم معنیٰ حدیث بیان کی ۔ اس میں ہے ، ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : کون ہشام؟عرض کی : عامر رضی اللہ تعالیٰ عنہ کے بیٹے ۔ انھوں نے کہا : وہ اچھے انسان تھے غزوہ احد میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( لڑتےہوئے ) تھے شہید ہوئے ، نیز اس ( روایت ) میں ہے کہ ( سعدکے بجائے ) حکیم بن افلح نے کہا : اگر میں جانتا کہ آپ ان کے پاس حاضر نہیں ہوتے تو میں آپ کو ان کی حدیث نہ بتاتا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": "746.05",
			"text": "ابوعوانہ نے قتادہ سے ، انھوں نے زراہ بن اوفیٰ سے ، انھوں نے سعد بن ہشام سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم جب آپ کی رات کی نماز بیماری یا کسی اور وجہ سے رہ جاتی تو دن کو بارہ رکعتیں پڑھ لیتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": "746.06",
			"text": "شعبہ نے قتادہ سے اسی سند کے ساتھ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب کوئی کام کرتے تو اس کو برقراررکھتے اور جب آپ رات سوتے رہ جاتے یا بیمار ہوجاتے تو آپ دن کو بارہ رکعتیں پڑھ لیتے ۔ ( حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ) کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو ( کبھی ) نہیں دیکھا کہ آپ نے ساری رات صبح تک نماز پڑھی ہواور نہ ( کبھی ) آپ نے رمضان کے سوا مسلسل مہینے بھر کے روزے رکھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": "747",
			"text": "عبدالرحمان بن عبدالقاری سے روایت ہے ، کہا : میں نے عمر بن خطاب رضی اللہ تعالیٰ عنہ سے سنا ، کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس کسی کا حزب ( قرآن کا 1/7 ) حصہ جو عموما ایک رات میں تہجد کے دوران میں پڑھا جاتا تھا ) یا اس کا کچھ حصہ سوتے رہ جانے کی وجہ سے رہ گیا اور اس نے اسے نماز فجر اور نمازظہر کے درمیان پڑھ لیا تو اس کے حق میں یہ لکھا جائےگا ، جیسے اس نے رات ہی کو اسے پڑھا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": "748.01",
			"text": "ایوب نے قاسم شیبانی سے روایت کی کہ حضرت زید بن ارقم رضی اللہ تعالیٰ عنہ نے کچھ لوگوں کو چاشت کے وقت نماز پڑھتے دیکھاتو کہا : ہاں یہ لوگ اچھی طرح جانتے ہیں کہ نماز اس وقت کی بجائے ایک اور وقت میں پڑھنا افضل ہے ۔ بے شک رسول اللہ صلی اللہ علیہ وسلم نے فرمایا \" اوابین ( اطاعت گزار ، توبہ کرنے والے اور اللہ تعالیٰ کی طرف رجوع کرنے والےلوگوں ) کی نماز اس وقت ہوتی ہے ۔ ، جب ( گرمی سے ) اونٹ کے دودھ چھڑائے جانے والے بچوں کے پاؤں جلنے لگتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 1747,
			"arabicnumber": "748.02",
			"text": "ہشام بن ابی عبداللہ نے کہا : ہمیں قاسم شیبانی نے حضرت زید بن ارقم رضی اللہ تعالیٰ عنہ سے حدیث بیا ن کی ، انھوں نے کہا : ر سول اللہ صلی اللہ علیہ وسلم اہل قباء کے پاس تشریف لائے ، وہ لوگ ( اس وقت ) نماز پڑھ رہے تھےتوآ پ نے فرمایا : \" اوابین کی نماز اونٹ کے دودھ چھڑانے جانے والے بچوں کے پاؤ ں جلنے کے وقت ( پر ہوتی ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 1748,
			"arabicnumber": "749.01",
			"text": "نافع اور عبداللہ بن دینار نے حضرت ا بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے رات کی نماز کے بارے میں سوال کیا تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" رات کی نمازدو رکعتیں ہیں ، جب تم میں سے کسی کو صبح ہونے کا اندیشہ ہو تو وہ ایک رکعت پڑھ لے ، یہ اس کی پڑھی ہوئی ( تمام ) نماز کو وتر ( طاق ) بنادے گی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 1749,
			"arabicnumber": "749.02",
			"text": "سفیان نے زہری سے ، انھوں نے سالم سے اور انھوں نے اپنے والد ( عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ ایک آدمی نے نبی اکرم صلی اللہ علیہ وسلم سے رات کی نماز کے بارے میں سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" دو دو رکعتیں ۔ اور جب تمھیں صبح ہونے کا اندیشہ ہو تو ایک رکعت وترپڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 178
			}
		},
		{
			"hadithnumber": 1750,
			"arabicnumber": "749.03",
			"text": "عمرو نے کہا ابن شہاب نے اس سے بیان کہ اسے سالم بن عبداللہ بن عمر اور حمید بن عبدالرحمان بن عوف دونوں نے عبداللہ بن عمر بن خطاب رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ انھوں نے کہا : ایک آدمی کھڑا ہوا اور کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !رات کی نماز کیسے ہے؟رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" رات کی نماز دو دو رکعت ہے اور جب تمھیں صبح ہونے کا خطرہ ہوتو ایک ایک رکعت ( پڑھ کر انھیں ) وتر کرلو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 179
			}
		},
		{
			"hadithnumber": 1751,
			"arabicnumber": "749.04",
			"text": "ابو ربیع زہرانی نے کہا : ہمیں حماد نے حدیث سنائی کہا : ہمیں ایوب اور بدیل نے عبداللہ بن شقیق سے حدیث بیان کی ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک آدمی نے نبی اکرم صلی اللہ علیہ وسلم سے پوچھا ، اور میں آپ کے اور پوچھنے والے کے درمیان میں تھا ، اس نے کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !رات کی نماز کیسے ہوتی ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" دو دو رکعتیں ، پھر جب تمھیں صبح ہونے کا اندیشہ ہو توا یک رکعت پڑھ لو اور وتر کو ا پنی نماز کا آخری حصہ بناؤ ۔ \" پھر سال کے بعد ایک آدمی نے آپ سے پوچھا ، میں رسول اللہ صلی اللہ علیہ وسلم کے قریب اسی جگہ ( درمیان میں ) تھا اور مجھے معلوم نہیں وہ پہلے والا آدمی تھا یا کوئی اور ، اسے بھی آپ نے اسی طرح جواب دیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 180
			}
		},
		{
			"hadithnumber": 1752,
			"arabicnumber": "749.05",
			"text": "ابو کامل نے کہا : ہمیں حماد نے حدیث سنائی ، کہا : ہمیں ایوب ، بدیل اور عمران بن حدیر نے عبداللہ بن شقیق سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، نیز ( دوسری سند سے ) محمد بن عبید غبری نے کہا : ہمیں حماد نے حدیث سنائی ، کہا : ہم سے ایوب اور زبیر بن خریت نے عبداللہ بن شقیق سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ ایک آدمی نے نبی کریم صلی اللہ علیہ وسلم سے سوال کیا ۔ ۔ ۔ پھر دونوں ( ابو کامل اور محمد بن عبید ) نے اوپر والی ر وایت بیان کی مگر ان دونوں کی روایت میں \" ایک آدمی نے آپ سے ایک سال گزرنے کابعد پوچھا \" اور اس کے بعد کا حصہ مروی نہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 181
			}
		},
		{
			"hadithnumber": 1753,
			"arabicnumber": "750",
			"text": "حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا : \" وتر پڑھنے میں صبح سے سبقت کرو ۔ \" ( صبح ہونے سے پہلے پہلے وتر پڑھ لو ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 182
			}
		},
		{
			"hadithnumber": 1754,
			"arabicnumber": "751.01",
			"text": "لیث نے نافع سے روایت کی کہ حضرت ابن عمر رضی اللہ تعالیٰ عنہا رضی اللہ تعالیٰ عنہ نے کہا : جوشخص ر ات کو نماز پڑھے ، وہ وتر کو اپنی نماز کا آخری حصہ بنائے کیونکہ رسول اللہ صلی اللہ علیہ وسلم اسی کا حکم دیتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 183
			}
		},
		{
			"hadithnumber": 1755,
			"arabicnumber": "751.02",
			"text": "عبیداللہ نے نافع سے ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور ا نھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" رات کے وقت وتر کو اپنی نماز کا آخری حصہ بناؤ ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 184
			}
		},
		{
			"hadithnumber": 1756,
			"arabicnumber": "751.03",
			"text": "ابن جریج نے کہا : مجھے نافع نے بتایا کہ حضرت ابن عمر رضی اللہ تعالیٰ عنہ کہاکرتے تھے : جو شخص ر ات کو نماز پڑھے وہ صبح سے پہلے نماز کا آخری حصہ وتر کوبنائے ، رسول اللہ صلی اللہ علیہ وسلم ان ( اپنے ساتھیوں ) کو یہی حکم دیاکرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 185
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": "752.01",
			"text": "ابو تیاح نے کہا : مجھے ابو مجلز نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے حدیث سنائی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" وتر رات کے آخری حصے کی ایک رکعت ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 186
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": "752.02",
			"text": "شعبہ نے قتادہ سے ، انھوں نے مجلز سے روایت کی ، انھوں نے کہا : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، وہ نبی اکرم صلی اللہ علیہ وسلم سے حدیث بیان کرتے تھے کہ آپ نے فرمایا : \" وتر رات کے آخری حصے کی ایک رکعت ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 187
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": "753",
			"text": "ہمام نے کہا : ہمیں قتادہ نے ابو مجلز سے حدیث بیان کی ، انھوں نے کہا : میں نےحضرت ابن عباس رضی اللہ تعالیٰ عنہ سے وتر کے بارے میں سوال کیا تو انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ، آپ فرما رہے تھے ۔ \" ( وتر ) رات کے آخری حصے کی ایک رکعت ہے ۔ \" اور میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے پوچھا تو انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا : \" ( وتر ) رات کے آخر کی ایک رکعت ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 188
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": "749.06",
			"text": "ابو کریب اور ہارون بن عبداللہ نے کہا : ہمیں ابو اسامہ نے ولید بن کثیر سے حدیث سنائی ، انھوں نے کہا : مجھے عبیداللہ بن عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے حدیث سنائی کہ حضرت عمر رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ ایک آدمی نے جب رسول اللہ صلی اللہ علیہ وسلم مسجد میں تھے آپ کو آواز دی اور کہا : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں رات کی نماز کو وتر ( طاق ) کیسے بناؤں؟رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو ( رات ) کی نماز پڑھے وہ دو دو رکعت پڑھے ، پھر وہ اگر محسوس کرے کہ صبح ہورہی ہےتو ایک رکعت پڑھ لے ، یہ ( ایک رکعت ) اس کی ساری نماز کو وتر ( طاق ) بنا دے گی ۔ \"\" ابو کریب نے عبیداللہ بن عبداللہ کہا ، ( آگے ) ابن عمر رضی اللہ تعالیٰ عنہ نے کہا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 189
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": "749.07",
			"text": "خلف بن ہشام اور ابوکامل نے کہا : ہمیں حماد بن زیدنے انس بن سیرن سے حدیث سنائی ، انھوں نے کہا میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے عرض کی : صبح کی نماز سے پہلے کی دو رکعتوں کے بارے میں آپ کی کیا رائے ہے ، کیا میں ان میں طویل قراءت کرسکتا ہوں؟انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم رات کو دو دو رکعت پڑھتے تھے اور ایک رکعت سے اس کو وتر بناتے ، میں نے کہا : میں آپ سے اس کے بارے میں نہیں پوچھ رہا ۔ انھوں نے کہا : تم ایک بوجھل آدمی ہو ( اپنی سوچ کو ترجیح دیتے ہو ) کیا مجھے موقع نہ دو گے کہ میں تمہارے لئے بات کو مکمل کروں؟رسول اللہ صلی اللہ علیہ وسلم رات کو دو دو رکعت پڑھتے تھے اور ایک وتر پڑھتے اور صبح ( کی نماز ) سے پہلے ( مختصر سی ) دو رکعتیں پڑھتے ، گویا کہ اذان ( اقامت ) آ پ کے کانوں میں ( سنائی دے رہی ) ہے ۔ خلف نے اپنی حدیث میں \"\" صبح سے پہلے کی دو رکعتوں کے بارے میں آپ کی رائے کیا ہے؟کہا اور انھوں نے \"\" صلاۃ \"\" کا لفظ بیان نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 190
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": "749.08",
			"text": "شعبہ نے انس بن سیرین سے روایت کی ، انھوں نے کہا : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے پوچھا ۔ ۔ ۔ پھر مذکورہ بالا حدیث کی طرح حدیث بیان کی اور اس میں یہ اضافہ کیا : رات کے آخری حصے میں ایک رکعت وتر پڑھتے ۔ اس میں ہے ( اور میرے دوبارہ سوا ل پر ) کہا : بس ، بس ، تم ایک بوجھل آدمی ہو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 191
			}
		},
		{
			"hadithnumber": 1763,
			"arabicnumber": "749.09",
			"text": "عقبہ بن حریث نے کہا : میں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے سنا ، وہ حدیث بیان کررہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" رات کی نماز دو رکعت ہے اور جب تم دیکھو کہ صبح آیا چاہتی ہے تو ایک رکعت سے ( اپنی نماز کو ) وتر کرو ۔ \" ابن عمر رضی اللہ تعالیٰ عنہ سے عرض کی گئی : مثنیٰ ، مثنیٰ ، کا کیا مفہوم ہے؟انھوں نے کہا : یہ کہ تم ہر دو رکعتوں ( کے آخر ) میں سلام پھیرو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 192
			}
		},
		{
			"hadithnumber": 1764,
			"arabicnumber": "754.01",
			"text": "معمرنے یحییٰ بن ابی کثیر سے ، انھوں نے ابو نضرہ سے اور انھوں نے حضرت ابو سعید رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" صبح سے پہلے پہلے وتر پڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 193
			}
		},
		{
			"hadithnumber": 1765,
			"arabicnumber": "754.02",
			"text": "شیبان نے یحییٰ ( بن ابی کثیر ) سے روایت کی ، انھوں نے کہا : ابو نضرۃ عوقی نے مجھے بتایا کہ حضرت ابو سعید رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ انھوں ( صحابہ ) نے نبی اکرم صلی اللہ علیہ وسلم سے وتر کے بارے میں سوال کیا تو آپ صلی اللہ علیہ وسلم نے فرمایا : \" صبح ہونے سے پہلے وتر پڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 194
			}
		},
		{
			"hadithnumber": 1766,
			"arabicnumber": "755.01",
			"text": "حفص اور ابو معاویہ نے اعمش سے حدیث سنائی ، انھوں نے ابو سفیان سے اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جسے ڈر ہو کہ وہ رات کے آخری حصے میں نہیں اٹھ سکے گا ، وہ رات کے شروع میں وتر پڑھ لے ۔ اور جسے امید ہو کہ وہ رات کے آخر میں اٹھ جائے گا ، وہ رات کے آخر میں وتر پڑھے کیونکہ رات کے آخری حصے کی نماز کا مشاہدہ کیا جاتا ہے اور یہ افضل ہے ۔ \"\" ابومعاویہ نے ( مشهوده کی بجائے ) محضورة ( اس میں حاضری دی جاتی ہے ) کہا ۔ ( مفہوم ایک ہی ہے)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 195
			}
		},
		{
			"hadithnumber": 1767,
			"arabicnumber": "755.02",
			"text": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرمارہے تھے : \" تم میں سے جسے یہ خدشہ ہوکہ وہ رات کے آخر میں نہیں اٹھ سکے گا تو وہ وتر پڑھ لے ، پھر سوجائے اور جسے رات کو اٹھ جانے کا یقین ہو ، وہ رات کے آخرمیں وتر پڑھے کیونکہ رات کے آخری حصے میں قراءت کے وقت حاضری دی جاتی ہے اور یہ بہتر ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 196
			}
		},
		{
			"hadithnumber": 1768,
			"arabicnumber": "756.01",
			"text": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے ر وایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قیام کا لمبا ہونا بہترین نماز ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 197
			}
		},
		{
			"hadithnumber": 1769,
			"arabicnumber": "756.02",
			"text": "ابو بکر بن ابی شیبہ اور ابو کریب دونوں نے کہا : ہمیں ابو معاویہ نے حدیث بیان کی ، انھوں نے کہا : ہمیں اعمش نے ابو سفیان سے حدیث سنائی اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم سے پوچھاگیا : کون سی نمازافضل ہے؟آپ نے فرمایا : \"\" قیام کا لمبا ہونا ۔ \"\" ابو بکر بن ابی شیبہ نے کہا : ابومعاویہ نے ہمیں اعمش سے حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 198
			}
		},
		{
			"hadithnumber": 1770,
			"arabicnumber": "757.01",
			"text": "ابو سفیان سے روایت ہے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ فرماتے تھے : \" رات میں ایک گھڑی ایسی ہے ۔ جو مسلمان بندہ بھی اس کو پالیتا ہے ۔ اس میں وہ دنیا وآخرت کی کسی بھی خیر اور بھلائی کا سوال کرتا ہےتو اللہ اسے وہ ( بھلائی ) ضرور عطا فرمادیتا ہے ۔ اور یہ گھڑی ہر رات میں ہوتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 199
			}
		},
		{
			"hadithnumber": 1771,
			"arabicnumber": "757.02",
			"text": "ابو زبیر رضی اللہ تعالیٰ عنہ نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" رات میں ایک ایسی گھڑی ہے جو مسلمان بھی اسے پالیتا ہے اور اس میں اللہ سے کسی بھی خیر کا سوال کرتا ہے تو وہ اسے وہ ( بھلائی ) عطا فرمادیتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 200
			}
		},
		{
			"hadithnumber": 1772,
			"arabicnumber": "758.01",
			"text": "ابن شہاب نے ابو عبداللہ اغز اور ابو سلمہ بن عبدالرحمان سے ، انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ ر سول اللہ صلی اللہ علیہ وسلم نے فرمایا : برکت اور رفعت کا مالک ہمارا رب ، ہر رات کو جب رات کا آخری تہائی حصہ باقی رہ جاتا ہے ، ( تو ) دنیا کے آ سمان پر نزول فرماتا ہے اور کہتا ہے : کون مجھے پکارتا ہے کہ میں اس کی پکار کو سنوں؟کون مجھ سے مانگتا ہ ے کہ میں اس کو دوں ، اور کون مجھ سے بخشش طلب کرتاہے کہ میں اسے بخش دوں؟",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 201
			}
		},
		{
			"hadithnumber": 1773,
			"arabicnumber": "758.02",
			"text": "سہیل کے والد ابو صالح نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فرمایا : \" اللہ تعالیٰ ہر رات کو ، جب رات کا پہلا تہائی حصہ گزر جاتا ہے ، دنیا کے آسمان پر نزول فرماتا ہے اور کہتا ہے : میں بادشاہ ہوں ، صرف میں بادشاہ ہوں ، کون ہے جو مجھے پکارتا ہے ہے کہ میں اس کی پکار کو سنوں؟کو ن ہے جو مجھ سے مانگتا ہے کہ میں اسے دوں؟کون ہے جو مجھ سے مغفرت طلب کرتا ہے کہ میں اسے معاف کروں؟وہ یہی اعلان فرماتا رہتا ہے حتیٰ کہ صبح چمک اٹھتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 202
			}
		},
		{
			"hadithnumber": 1774,
			"arabicnumber": "758.03",
			"text": "ابو بن سلمہ عبدالرحمان نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے حدیث بیا ن کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب رات کا آدھا یا دو تہائی حصہ گزر جاتا ہے توا للہ تبارک وتعا لیٰ آسمان دنیا پر نزول فرماتا ہے اور کہتا ہے : کیا کوئی مانگنے والا ہے کہ اسے دیاجائے؟کیا کوئی د عا کرنے والا ہے کہ اس کی دعا قبول کیجائے؟کیاکوئی بخشش کا طلبگار ہے کہ اسے بخشا جائے حتیٰ کہ صبح پھوٹ پڑتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 203
			}
		},
		{
			"hadithnumber": 1775,
			"arabicnumber": "758.04",
			"text": "محاضر ابومورع نے کہا : ہم سے سعد بن سعید ( بن قیس انصاری ) نے حدیث بیان کی ، انھوں نے کہا : مجھے ابن مرجانہ نے خبر دی ، انوں نے کہامیں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" آدھی رات یا رات کی آخری تہائی کے وقت اللہ تعالیٰ آسمان دنیا پر نزول فرماتا ہے اور کہتا ہے : کون مجھ سے دعا کرے گا کہ میں اس کی دعا قبول کروں ۔ یامجھ سے سوال کرے میں اسے عطا کرو؟پھر فرماتا ہے : کون اس ( ذات ) کو قرض دےگا جو نہ محتاج ہے اور نہ حق مارنے والی ہے ( اللہ تعالیٰ کو ) ؟ \"\" امام مسلمؒ نے کہا : ابن مرجانہ سے مراد سعید بن عبداللہ ( ابو العثمان المدنی ) ہیں اور مرجانہ ان کی والدہ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 204
			}
		},
		{
			"hadithnumber": 1776,
			"arabicnumber": "758.05",
			"text": "سلیمان بن بلال نے سعد بن سعید سے اسی سند کے ساتھ روایت کی اور اس میں یہ اضافہ ہے : \" پھراللہ تعالیٰ اپنے دونوں ہاتھ پھیلاتا ہے اور فرماتا ہے ۔ : کون اسکو قرض دے گا جو نہ محتاج ہے اور نہ ہی ظالم ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 205
			}
		},
		{
			"hadithnumber": 1777,
			"arabicnumber": "758.06",
			"text": "منصور نے ابو اسحاق سے اور انھوں نے اغر ابو مسلم سے روایت کی ، وہ حضرت ابو سعید اور حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کرتے ہیں ۔ دونوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ ( بندوں کو آرام کی ) مہلت دیتاہے حتیٰ کہ جب رات کا پہلا تہائی حصہ گزر جاتاہے تو وہ آسمان دنیا پر نزول فرماتا ہے اور کہتا ہے : کیا کوئی مغفرت کا طلب گار ہے؟کیا کوئی توبہ کرنے والا ہے؟کیاکوئی مانگنے والاہے؟کیاکوئی پکارنے والا ہے؟حتیٰ کہ فجر پھوٹ پڑتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 206
			}
		},
		{
			"hadithnumber": 1779,
			"arabicnumber": "759.01",
			"text": "حمید بن عبدالرحمان نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ ر سول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص کے ایمان ( کی حالت میں ) اور اجر طلب کرتے ہوئے رمضان کا قیام کیا اس کے گزشتہ تمام گناہ معاف کردیئے گئے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 207
			}
		},
		{
			"hadithnumber": 1780,
			"arabicnumber": "759.02",
			"text": "امام زہری نے ابو سلمہ ( بن عبدالرحمان ) سے اور انھوں نے ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا رسول اللہ صلی اللہ علیہ وسلم لازم ٹھہرائے بغیر رمضان کے قیام کی ترغیب دیتے تھے ، آپ فرماتے : \" جس نے رمضان کا قیام ایمان ( کی حالت میں ) اوراجر طلب کرتے ہوئے کیا ، اس کے گزشتہ گناہ بخش دیئے جائیں گے ۔ \" رسول اللہ صلی اللہ علیہ وسلم کی وفات تک معاملہ یہی رہا ، پھر ابو بکر رضی اللہ تعالیٰ عنہ کی خلافت اور عمر رضی اللہ تعالیٰ عنہ کی خلافت کے ابتدائی دور میں بھی معاملہ اسی طرح رہا ( ترغیب دی جاتی رہی ، اجتماعی طور پر اہتمام نہیں کیاگیا)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 208
			}
		},
		{
			"hadithnumber": 1781,
			"arabicnumber": "760.01",
			"text": "حییٰ بن ابی کثیر نے کہا : ہمیں سلمہ بن عبدالرحمان نے حدیث بیان کی ۔ کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے انھیں حدیث سنائی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس نے رمضان کے روزے ایمان ( کی حالت میں ) اور ثواب کے لئے رکھے ، اس کے گزشتہ سب گناہ معاف کردیئے جائیں گے اور جس نے لیلۃ القدر کا قیام ایمان کے ساتھ اور ثواب کے لئے کیا تو اس کے گزشتہ سارے گناہ معاف کردیئے جائیں گے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 209
			}
		},
		{
			"hadithnumber": 1782,
			"arabicnumber": "760.02",
			"text": "اعرج نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور ا نھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" جو شخص لیلۃ القدر کا قیام کرے گا اور اس کو پالے گا ۔ میرا خیال ہے آپ نے فرمایا ۔ ایمان کے عالم میں اور احتساب کے لئے ، اسے بخش دیا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 210
			}
		},
		{
			"hadithnumber": 1783,
			"arabicnumber": "761.01",
			"text": "امام مالکؒ نے ابن شہاب سے روایت کی ، انھوں نے عروہ سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک رات مسجد میں نماز پڑھی تو کچھ اور لوگوں نے ( بھی ) آپ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ، پھر آپ نے اس سے اگلی ر ات نماز پڑھی تو لوگوں ( کی تعداد ) میں اضافہ ہوگیا ، پھر تیسری یا چوتھی رات لوگ جمع ہوئے تو رسول اللہ صلی اللہ علیہ وسلم نکل کر ان کے پاس تشریف نہ لائے ۔ جب صبح ہوئی تو آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو تم نے کیا میں نے دیکھا ، مجھے تمہارے پاس آنے سے اس کے سوا کسی چیز نے نہیں روکا کہ مجھے ڈر ہوا کہ کہیں یہ ( نماز ) تم پر فرض نہ ہوجائے ۔ \"\" ( عروہ یا ان کے بعد کے کسی راوی نے ) کہا : اور یہ رمضان میں ہوا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 211
			}
		},
		{
			"hadithnumber": 1784,
			"arabicnumber": "761.02",
			"text": "یونس بن یزید نے ابن شہاب سے خبر دی ، انھوں نے کہا : مجھے عروہ بن زبیر نے بتایا کہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے انھیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم رات کے وسط میں ( گھر سے ) نکلے اور مسجد میں نماز پڑھی ، کچھ لوگوں نے ( بھی ) آپ کی نماز کے ساتھ نماز ادا کی ، صبح کو لوگوں نے اس بارے میں بات چیت کی ، چنانچہ ( دوسری رات ) لوگ پہلے سے زیادہ جمع ہوگئے ، رسول اللہ صلی اللہ علیہ وسلم د وسری رات بھی باہر تشریف لائے اور لوگوں نے آپ کی نماز کے ساتھ ( اقتداء میں ) نماز پڑھی ، صبح اس کا تذکرہ کرتے رہے ، تیسری رات مسجد میں آنے والے اور زیادہ ہوگئے آپ باہر تشریف لائے اور لوگوں نے آپ کی نماز کے ساتھ نماز پڑھی ، جب چوتھی رات ہوئی تو مسجد نمازیوں کے لئے تنگ ہوگئی ، اور رسول اللہ صلی اللہ علیہ وسلم نکل کر ان کے پاس تشریف نہ لائے حتیٰ کہ آپ صبح کی نماز کے لئے تشریف لائے ۔ جب صبح کی نماز پوری کرلی تو لوگوں کی طرف متوجہ ہوئے ، پھر شہادتین پڑھ کر ( یہ خطبے کا حصہ ہیں ) فرمایا : \" اما بعد! واقعہ یہ ہے کہ آج رات تمہارا حال مجھ سے مخفی نہ تھا لیکن مجھے خدشہ ہوا کہ رات کی نماز تم پر فرض نہ کردی جائے پر تم اس ( کی ادائیگی ) سے عاجز رہو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 212
			}
		},
		{
			"hadithnumber": 1785,
			"arabicnumber": "762.01",
			"text": "اوزاعی نے کہا : مجھ سے عبدہ ( بن ابی لبابہ ) نے زر ( بن جیش ) سے حدیث بیان کی ، انھوں نے کہا : میں نے ابی ابن کعب رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے جب کہ ان سے کہاگیا کہ حضرت عبداللہ بن مسعود کہتے ہیں : جس نے سال بھر قیام کیا اس نے شب قدر کو پالیا تو ابی رضی اللہ تعالیٰ عنہ نے کہا : اس اللہ کی قسم جس کے سوا کوئی معبود نہیں!وہ رات ر مضان میں ہے ۔ ۔ ۔ وہ بغیر کسی استثناء کے حلف اٹھاتے تھے ۔ ۔ ۔ اور اللہ کی قسم! میں خوب جانتا ہوں کہ وہ رات کون سی ہے ، یہ وہی رات ہے جس میں قیام کا ہمیں رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا تھا ، یہ ستائیسویں صبح کی رات ہے اور ا س کی علامت یہ ہے کہ اس دن کی صبح کو سورج سفید طلوع ہوتا ہے ، اس کی کوئی شعاع نہیں ہوتی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 213
			}
		},
		{
			"hadithnumber": 1786,
			"arabicnumber": "762.02",
			"text": "محمد بن جعفر نے کہا : ہم سے شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے عبدہ بن ابی لبابہ کو زرین حبیش سے حدیث بیان کرتے ہوئے سنا ، انھوں نے حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ سے روایت کی ، ( زرنے ) کہا : حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ نے لیلۃ القدر کے بارے میں کہا : اللہ کی قسم!میں اس کے بارے میں جانتا ہوں اور میرا غالب گمان ہے کہ یہ وہی رات ہے جس کے قیام کا ہمیں رسول اللہ صلی اللہ علیہ وسلم نے حکم دیا تھا ، یہ ستائیسویں رات ہے ۔ شعبہ نے \"\" یہ وہی رات ہے جس کے قیام کا ہمیں رسول اللہ صلی اللہ علیہ وسلم نے ہمیں حکم دیا تھا \"\" فقرے کے بارے میں شک کیا ، انھوں نے کہا : مجھے یہ روایت میرے ساتھی نے ان ( عبدہ بن ابی لبابہ کے حوالے ) سے سنائی تھی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 214
			}
		},
		{
			"hadithnumber": 1787,
			"arabicnumber": "762.03",
			"text": "۔ ( عبیداللہ کے والد ) معاذ نے کہا : ہم سے شعبہ نے اسی سند کے ساتھ سابقہ روایت کی مانند حدیث بیان کی لیکن اس میں انما شك شعبة ( شعبہ نے اس کے بارے میں شک کیا ) اور اس کے بعد کی عبارت بیان نہیں کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 215
			}
		},
		{
			"hadithnumber": 1788,
			"arabicnumber": "763.01",
			"text": "سلمہ بن کہیل نے کریب سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے ایک رات اپنی خالہ حضرت میمونہ رضی اللہ تعالیٰ عنہا کے ہاں گزاری ، نبی اکرم صلی اللہ علیہ وسلم رات کو اٹھے اور اپنی ضرورت ( کی جگہ ) آئے ، پھر اپنا چہرہ اور دونوں ہاتھ دھوئے ، پھر سو گئے پھر اٹھے اور مشکیزے کے پاس آئے اور اس کا بندھن کھولا ، پھر دو ( طرح کے ) وضو ( بہت ہلکا وضو اور بہت زیادہ وضو ) کے درمیان کا وضو کیا اور ( پانی ) زیادہ ( استعمال ) نہیں کیا اور ( وضو ) اچھی طرح کیا ، پھر اٹھے اور نماز شروع کی تو میں اٹھا اور میں نے انگڑائی لی ، اس ڈر سے کہ آپ یہ نہ سمجھیں کہ میں آپ ( کے حالات جاننے ) کی خاطر جاگ رہا تھا ، پھر میں نے وضو کیا ، پھر آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور نماز پڑھی ۔ تو میں آپ کی دائیں جانب کھڑا ہوگیا ، آپ نے میرا ہاتھ پکڑا اور مجھے گھما کر اپنی دائیں جانب ( کھڑا ) کرلیا ۔ رسول اللہ صلی اللہ علیہ وسلم کی تیرہ رکعت رات کی نماز مکمل ہوئی ، پھر آپ لیٹ گئے اور سو گئے حتیٰ کہ آپ کی سانس لینے کی آواز آنے لگی ، آپ جب سوتے تھے تو آواز آتی تھی ۔ ، پھر آپ صلی اللہ علیہ وسلم کے پاس حضرت بلال رضی اللہ تعالیٰ عنہ آئے ، اور آپ صلی اللہ علیہ وسلم کو نماز کی اطلاع دی ، آپ نے نماز پڑھی ( سنت فجر ادا کیں ) اور وضو نہ کیا اور آپ کی دعا میں تھا : \"\" اےللہ! میرے دل میں نور ڈال دے اور میری آنکھوں میں اور میرے کانوں میں نور بھردے اورمیری دائیں طرف نور کردے اور میری بائیں طرف نور کردے اور میرے نیچے نور کردے اور میرے آگے اور میرے پیچھے نور کردے اور میرے لئے نور کو عظیم کردے ۔ \"\" ( ابن عباس رضی اللہ تعالیٰ عنہ کے شاگرد ) کریب نے بتایا کہ ( ان کے علاوہ مزید ) سات ( چیزوں کے بارے میں دعا مانگی جن ) کا تعلق جسم کے صندوق ( پسلیوں اور اردگرد کے حصے ) سے ہے ، میر ی ملاقات حضرت عباس رضی اللہ تعالیٰ عنہ کے بیٹے سے ہوئی تو انھوں نے مجھے ان کے بارے میں بتایا ، انھوں نے بتایا کہ میرے پٹھوں ، میرے گوشت ، میرےخون ، میرے بالوں اور میری کھال ( کو نور کردے ) ، دو اور بھی چیزیں بتائیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 216
			}
		},
		{
			"hadithnumber": 1789,
			"arabicnumber": "763.02",
			"text": "امام مالک نے مخرمہ بن سلیمان سے اور انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ کے مولیٰ کریب سے روایت کی کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ انھوں نے ایک رات ام المومنین میمونہ رضی اللہ تعالیٰ عنہا کے ہاں گزاری جو ان کی خالہ تھیں ، تو میں سرہانے ( بستر ) کے عرض میں لیٹا اور رسول اللہ صلی اللہ علیہ وسلم اور آپ کی اہلیہ اس ( بستر ) کے طول ( لمبائی ) میں لیٹے ، رسول اللہ صلی اللہ علیہ وسلم سو گئے یہاں تک کہ رات آدھی ہوئی ۔ یا اس سے تھوڑا پہلے یا تھوڑا بعد کا وقت ہوا تو رسول اللہ صلی اللہ علیہ وسلم بیدا ر ہوگئے اور اپنے ہاتھ کے ساتھ اپنے چہرے سے نیند زائل کرنے لگے ، ( چہرے پر ہاتھ پھیرا ) پھر آپ نے سورہ آل عمران کی آخری دس آیات تلاوت فرمائیں ، پھر آپ اٹھ کرایک لٹکے ہوے مشکیزے کے پاس گئے اور اس سے وضو کیا اور اچھی طرح وضو کیا ، پھر کھڑے ہوئے اور نماز پڑھنے لگے ۔ ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : \"\" میں اٹھا اور میں نے بھی وہی کیا جو رسول اللہ صلی اللہ علیہ وسلم نے کیاتھا ۔ پھر جا کر آپ کے پہلو میں کھڑ ہوگیااس پررسول اللہ صلی اللہ علیہ وسلم نے اپنا دائیاں ہاتھ میرے سر پر رکھا اور میرے دائیں کان کو پکڑ کر ( آہستہ سے ) مروڑنے لگے ۔ پھر آپ نے دو رکعت نماز پڑھی ۔ پھر دورکعتیں ، پھر دورکعتیں ، پھر دورکعتیں ، پھر دورکعتیں ، پھر دورکعتیں پڑھیں ۔ پھر وتر پڑھا ، پھر آپ لیٹ گئے حتیٰ کہ موذن آپ کے پاس آیا تو آ پ کھڑے ہوئے اور دو ہلکی رکعتیں پڑھیں ، پھر تشریف لئے گئے اور صبح کی نماز ادا کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 217
			}
		},
		{
			"hadithnumber": 1790,
			"arabicnumber": "763.03",
			"text": "عیاض بن عبداللہ فہری نے مخرمہ بن سلیمان سے اسی سند کے ساتھ یہی روایت بیان کی اور یہ اضافہ کیا : پھر آپ نے پانی کے ایک پرانے مشکیزے کا رخ کیا ، پھر مسواک کی اور وضو کیا اور اچھی طرح وضو کیا ، لیکن پانی بہت ہی کم بہایا ، پھر مجھے ہلایا اور میں کھڑا ہوگیا ۔ ۔ ۔ باقی ساری حدیث مالک کی حدیث کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 218
			}
		},
		{
			"hadithnumber": 1791,
			"arabicnumber": "763.04",
			"text": "عمرو نے عبدربہ بن سعید سے ، انھوں نے مخرمہ بن سلیمان سے ، انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ کے مولیٰ کریب سے اور انھوں نےحضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے کہا : میں نبی اکرم صلی اللہ علیہ وسلم کی زوجہ حضرت میمونہ رضی اللہ تعالیٰ عنہا کے ہاں سویا اور اس رات رسول اللہ صلی اللہ علیہ وسلم انھیں کے پاس تھے ۔ رسول اللہ صلی اللہ علیہ وسلم نے وضو کیا ، پھر کھڑے ہوئے اور نماز پڑھنے لگے ، میں آپ کی بائیں طرف کھڑا ہوگیا تو آپ نے مجھے پکڑ کر اپنی دائیں جانب کرلیا ۔ اس رات آپ نے تیرہ رکعتیں پڑھیں ۔ پھر رسول اللہ صلی اللہ علیہ وسلم سو گئے حتیٰ کہ آپ ( کے سانسوں ) کی آواز آنے لگی ، جب آپ سوتے تو سانس لینے کی آوازآتی تھی ۔ پھر آپ کے پاس موذن آیا تو آپ باہر تشریف لے گئے اور نماز ادا کی ، آپ نے ( ازسرنو ) وضو نہیں کیا ۔ عمرو نے کہا میں نے یہ حدیث بکیر بن اشج کو سنائی تو انھوں نے کہا : کریب نے مجھے یہی حدیث سنائی تھی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 219
			}
		},
		{
			"hadithnumber": 1792,
			"arabicnumber": "763.05",
			"text": "ضحاک نے مخرمہ بن سلیمان سے ، انھوں نے کریب مولیٰ ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے ایک رات اپنی خالہ میمونہ بنت حارث رضی اللہ تعالیٰ عنہا کے ہاں بسر کی ، میں نے ان سے عرض کی ۔ جب رسول اللہ صلی اللہ علیہ وسلم اٹھیں تو آ پ مجھے بھی بیدار کردیں ۔ رسول اللہ صلی اللہ علیہ وسلم نماز کے لئے کھڑے ہوئے تو میں آپ کی بائیں جانب کھڑا ہوگیا ۔ آپ نے میرا ہاتھ پکڑا اور مجھے اپنی دائیں طرف میں کردیا ، جب مجھے جھپکی آنے لگتی تو آپ میرے کان کی لو پکڑ لیتے ، آپ نے گیارہ رکعتیں پڑھیں ، پھر آپ نے کمر اور پنڈلیوں کے گرد کپڑا لپیٹ کر اسے سہارا بنا لیا ( اور سوگئے ) یہاں تک کہ میں آپ کے سونے کی حالت میں آپ کے سانس لینے کی آوازسن رہاتھا ۔ تو جب آپ کے سامنے صبح ظاہر ہوئی تو آپ نے ہلکی دو رکعتیں پڑھیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 220
			}
		},
		{
			"hadithnumber": 1793,
			"arabicnumber": "763.06",
			"text": "سفیان بن عمرو بن دینار سے ، انھوں نے کریب مولیٰ ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے اپنی خالہ میمونہ رضی اللہ تعالیٰ عنہا کے ہاں رات بسر کی ۔ رسول اللہ صلی اللہ علیہ وسلم را ت کے وقت اٹھے ، پھر آپ نے لٹکی ہوئی مشک سے ہلکا وضوکیا ( کریب نے ) کہا : انھوں ( ابن عباس رضی اللہ تعالیٰ عنہ ) نے آپ کے وضو کی کیفیت بیان کی اور وضو کو ہلکا اور کم کرتے رہے ، ابن عباس رضی اللہ تعالیٰ عنہ نے کہا : میں اٹھا اور وہی کیا جو نبی اکرم صلی اللہ علیہ وسلم نے کیا ۔ پھر آکر میں آپ صلی اللہ علیہ وسلم کی بائیں طرف کھڑا ہوگیا ، آپ نے مجھے اپنے پیچھے کیا ( اور گھما کر ) اپنی دائیں جانب کرلیا ۔ پھر آپ نے نماز پڑھی ۔ پھر لیٹ کر سوگئے حتیٰ کہ آوا ز سے سانس لینے لگے ۔ پھر بلال رضی اللہ تعالیٰ عنہ آئے اور آپ کو نماز کی اطلاع دی ، آپ باہر تشریف لے گئے اور صبح کی نماز ادا فرمائی اور ( نیا ) وضو نہ کیا ۔ سفیان نے کہا : یہ ( نیند کے باوجود وضو کی ضرورت نہ ہونا ) نبی اکرم صلی اللہ علیہ وسلم کا خاصہ تھا کیونکہ ہم تک یہ بات پہنچی ہے کہ آپ کی آنکھیں سوتی تھیں دل نہیں سوتاتھا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 221
			}
		},
		{
			"hadithnumber": 1794,
			"arabicnumber": "763.07",
			"text": "محمد بن جعفر ( غندر ) نے کہا : ہم سے شعبہ نے سلمہ سے حدیث بیان کی ، انھوں نے کریب سے اور ا نھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے اپنی خالہ میمونہ کے ہاں رات گزاری ، میں نے ( وہاں رہ کر ) مشاہدہ کیا کے رسول اللہ صلی اللہ علیہ وسلم کیسے نماز پڑھتے ہیں ۔ کہا : آپ اٹھے ، پیشاب کیا ، پھر اپنا چہرہ اور ہتھیلیاں دھوئیں ۔ پھر سوگئے ۔ آپ ( کچھ دیر بعد ) پھر اٹھے ، مشکیزے کے پاس گئے اور اس کابندھن کھولا ، پھر لگن یا پیالے میں پانی انڈیلا اور اس کو اپنے ہاتھ سے جھکایا ، پھر دو وضووں کے درمیا کاخوبصورت وضو کیا ( وضو نہ بہت ہلکا کیا اور نہ اس میں مبالغہ کیا لیکن اچھی طرح کیا ) ، پھر اٹھ کر نماز پڑھنے لگے ، میں آپ کے پہلو میں کھٹرا ہوگیا ، آپ کی بائیں جانب کھٹرا ہوا ۔ کہا : تو آپ نے مجھے پکڑ کراپنی دائیں جانب کردیا ، اور رسول اللہ صلی اللہ علیہ وسلم کی تیرہ رکعت نماز مکمل ہوئی ، پھر آپ سوگئے حتیٰ کہ سانسوں کی آواز آنے لگی اور جب آپ سوجاتے تو ہم آپ کے سونے کوآپ کے سانس کی آواز سے پہچانتے ، پھر آپ نماز کے لئے باہر تشریف لائے اور نماز ادا کی ۔ اور آپ اپنی نماز یا اپنے سجدے میں یہ دعا مانگنے لگے : \" اے اللہ!میرے دل میں نور پیدا کر اور میرے کانوں میں نور پیدا کر اور میری آنکھوں میں نور پیدا کر اور میرے دائیں نور بنا اور میرے بائیں نور پیدا فرما اور میرے آگے اور میرے پیچھے نو ر کر اور میرے اوپر نور کر اور میرے لئے نور بنا ۔ ۔ ۔ یا فرمایا : \" مجھے نور بنا ۔ ۔ ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 222
			}
		},
		{
			"hadithnumber": 1795,
			"arabicnumber": "763.08",
			"text": "نضر بن شمیل نے کہا : ہمیں شعبہ نے خبر دی ، کہا : ہمیں سلمہ بن کبیل نے بکیر سے حدیث سنائی ، انھوں نے کریب سے اور انھوں نے حضرت ابن عبا س رضی اللہ تعالیٰ عنہ سے روایت کی ۔ سلمہ نے کہا : میں کریب کو ملا تو انھوں نے کہا : حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے فرمایا : میں اپنی خالہ میمونہ کے ہاں تھا ، تو رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ۔ ۔ ۔ پھر انھوں نے غندر ( محمد بن جعفر ) کی حدیث ( 1794 ) کی طرح بیان کیا اور کہا : \"\" اور مجھے سراپا نور کردے \"\" اور انھوں نے ( کسی بات میں ) شک کا اظہار نہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 223
			}
		},
		{
			"hadithnumber": 1796,
			"arabicnumber": "763.09",
			"text": "۔ سعید بن مسروق نے سلمہ بن کہیل سے ، انھوں نے ابو رشدین ( کریب ) مولیٰ ابن عباس رضی اللہ تعالیٰ عنہ سے اور ا نھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں نے اپنی خالہ میمونہ رضی اللہ تعالیٰ عنہا کے ہاں رات گزاری ، پھر حدیث بیان کی لیکن اس میں چہرے اور ہتھیلیاں دھونے کاذکر نہیں ہے ، ہاں ، یہ کہا : پھر آپ مشک کے پاس آئے ، اس کا بندھن کھولا ، اور دو وضووں کے درمیان کا وضوکیا پھر بستر پر آئے اور سو گئے پھر آپ دوبارہ اٹھے اورمشک کے پاس آئے ، اس کابندھن کھولا ، پھر دوبارہ وضو کیاجو ( صحیح معنی میں ) وضوتھا اور کہا : \" میرا نور عظیم کردے \" اور یہ ہدایت نہیں کیا کہ مجھے سراپا نور کردے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 224
			}
		},
		{
			"hadithnumber": 1797,
			"arabicnumber": "763.10",
			"text": "عقیل بن خالد سے روایت ہے کہ سلمہ بن کہیل نے ان ( عقیل ) سے حدیث بیان کی کہ کریب نے ان ( سلمہ ) سے حدیث بیان کی کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے ایک رات رسو ل اللہ صلی اللہ علیہ وسلم کے پاس گزاری ، انھوں ( ابن عباس رضی اللہ تعالیٰ عنہ ) نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم اٹھ کر مشکیزے کے پاس گئے اور اس میں سے پانی انڈیلا اور وضو کیا اور آپ نے نہ پانی زیادہ استعمال کیا نہ وضو میں کوئی کمی کی ۔ ۔ ۔ اور پوری حدیث بیا ن کی اور اس میں یہ بھی ہے کہ آپ نے اس رات انیس کلمات پر مشتمل دعا کی ۔ ( تمام الفاظ جمع کریں تو انیس بنتے ہیں ) سلمہ نے کہا : کریب نے وہ کلمات مجھے بتائے تھے اور میں ان میں سے بارہ کلمات کو یاد رکھ سکا اور باقی بھول گیا ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" اے اللہ ! میرے دل میں نور پیدا فرمااور میری زبان میں نور پیدا فرما اور میرے کان میں نور پیدا فرما اور میری آنکھ میں نور پیدا فرما اور میرے اوپر نور کردے اور میرے نیچے نور کردے اور میرے دائیں نور کردے اور میرے بائیں نور کردے او ر میرے آگے نور کردے اور میرے پیچھے نور کردے اور میرے اندر نور کردے اور میرے نور کو عظیم کردے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 1798,
			"arabicnumber": "763.11",
			"text": "شریک بن ابی نمر نے کریب سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں ایک رات حضرت میمونہ رضی اللہ تعالیٰ عنہا کے گھر سویا ، جبکہ نبی کریم صلی اللہ علیہ وسلم ان کے ہاں تھے تاکہ میں دیکھوں کہ رات کو رسول اللہ صلی اللہ علیہ وسلم کی نماز کی کیفیت کیا ہے ، رسول اللہ صلی اللہ علیہ وسلم نے کچھ وقت ا پنے گھر والوں کے ساتھ گفتگو فرمائی ، پھر آپ سوگئے ۔ ۔ ۔ آگے پوری حدیث بیان کی اور میں یہ بھی تھا کہ پھر آپ صلی اللہ علیہ وسلم اٹھے ، وضو کیا اور مسواک کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 1799,
			"arabicnumber": "763.12",
			"text": "حبیب بن ابی ثابت نے محمد بن علی بن عبداللہ بن عباس رضی اللہ تعالیٰ عنہ سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت عبداللہ بن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ وہ ( ایک رات ) رسول اللہ صلی اللہ علیہ وسلم کے ہاں سوئے تو ( رات کو ) آپ صلی اللہ علیہ وسلم جاگے ، مسواک کی اور وضو فرمایا اور آپ ( اس وقت ) یہ آیا مبارکہ پڑھ رہے تھے : \" یقیناً آسمانوں اور زمین کی تخلیق میں اور دن رات کی آمد ورفت میں خالص عقل رکھنے والوں کے لئے نشانیاں ہیں ۔ \" یہ آیات تلاوت فرمائیں حتیٰ کہ سورت ختم کی ، پھر آپ صلی اللہ علیہ وسلم کھڑے ہوئے اور دو ر کعتیں پڑھیں ، ان میں بہت طویل قیام ، رکوع اور سجدے کیے ، پھر واپس پلٹے اور سوگئے یہاں تک کہ آپ کے سانس آواز سنائی دینے لگی ، پھر آپ نے سا طرح تین دفعہ کیا ، چھ رکعتیں پڑھیں ، ہر دفعہ آپ مسواک کرتے ، وضوفرماتےاور ان آیات کو تلاوت فرماتے ، پھر آپ نے تین وتر پڑھے ، پھر موذن نے اذان دی تو آپ نماز کے لئے باہر تشریف لے گئے اور آپ یہ دعا کررہے تھے : \" اے اللہ ! میرے دل میں نور کردے اور میری زبان میں نور کردے اور میری سماعت میں نور کردے اور میری آنکھ میں نور کردے اور میرے پیچھے نور کردے اور میرے آگے نور کردے اور میرے اوپر نور کردے اور میرے نیچے نورکردے ، اے اللہ! مجھے نور عنائیت فرما ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 1800,
			"arabicnumber": "763.13",
			"text": "ابن جریج نے کہا ، مجھے عطاء نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے خبر دی ، انھوں نے کہا : میں نے ایک رات اپنی خالہ میمونہ رضی اللہ تعالیٰ عنہا کے پاس بسر کی تو رسول اللہ صلی اللہ علیہ وسلم رات کی نفل نماز پڑھنے کے لئے جاگے ۔ نبی کریم صلی اللہ علیہ وسلم اٹھ کرمشک کی طرف گئے اور وضو فرمایا ، پھر کھڑے ہوکر نماز پڑھی ، جب میں یہ آپ کو یہ کرتے دیکھا تو میں بھی اٹھا اور میں نے بھی مشک سے وضوکیا ، ( جب رسول اللہ صلی اللہ علیہ وسلم وضو کرتے رہے ، ابن عباس رضی اللہ تعالیٰ عنہ جاگنے کے بعد غور سے انھیں دیکھتے رہے تاکہ آپ کی اتباع کرسکیں ) پھر میں آپ کے بائیں پہلو میں کھڑا ہوگیا تو آپ نے اپنی پشت کے پیچھے سے میراہاتھ پکڑا ، ااسی طرح پیچھے سے مجھے دائیں جانب ٹھیک کرکے کھڑا کیا ۔ ( عطا ء نے کہا : ) میں نے پوچھا : کیا یہ نفل نماز میں ہوا تھا؟انھوں نے کہا : ہاں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 1801,
			"arabicnumber": "763.14",
			"text": "قیس بن سعد ، عطاء سے حدیث بیان کرتے ہیں ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : حضرت عباس رضی اللہ تعالیٰ عنہ نے مجھے نبی کریم صلی اللہ علیہ وسلم کے پاس بھیجا آپ صلی اللہ علیہ وسلم میری خالہ میمونہ رضی اللہ تعالیٰ عنہا کے گھر میں تھے تو وہ رات میں نے آپ کے ساتھ گزاری ، آپ رات کو اٹھ کر نماز پڑھنے لگےاور میں آپ کے بائیں طرف کھڑا ہوگیا تو آپ نے مجھے اپنی پشت کے پیچھے سے پکڑا اور اپنی دائیں جانب کرلیا ( اس حدیث میں مذید یہ تفصیل سامنے آئی کہ ابن عباس رضی اللہ تعالیٰ عنہ کو ان کے والد نے بھیجاتھا)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 1802,
			"arabicnumber": "763.15",
			"text": "عبدالملک نے عطاء سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : میں نے اپنی خالہ میمونہ رضی اللہ تعالیٰ عنہا کے ہاں رات گزاری ۔ ۔ ۔ آگے ابن جریج اور قیس بن سعد کی روایت کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 1803,
			"arabicnumber": "764",
			"text": "ابو بکر بن ابی شیبہ ابن مثنیٰ ، اور ابن بشار نے غندر ، شعبہ اور ابوجمرہ کی سند سے حدیث بیان کی کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ فرماتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم رات کوتیرہ رکعتیں پڑھاکرتے تھے ( یہی رات کی رکعتوں کی زیادہ سے زیادہ تعداد ہے جس میں دو خفیف رکعتیں شامل ہیں ۔ آپ صلی اللہ علیہ وسلم کا معمول گیارہ کاتھا جس طرح حضرت عائشہ رضی اللہ تعالیٰ عنہا نے فرمایا ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 1804,
			"arabicnumber": "765",
			"text": "حضرت زید بن خالد جہنی رضی اللہ تعالیٰ عنہ سے روایت ہے ۔ کہ انھوں نے ( دل میں ) کہا : میں آج رات رسول اللہ صلی اللہ علیہ وسلم کی نماز کا ( گہری نظر سے ) مشاہدہ کروں گا ، تو ( میں نے دیکھا کہ ) آپ نے دو ہلکی رکعتیں پڑھیں ، پھر دو انتہائی لمبی رکعتیں بہت ہی زیادہ لمبی رکعتیں اداکیں ، پھر دو رکعتیں پڑھیں ۔ جو ( ان طویل ترین ) رکعتوں سے ہلکی تھیں ، پھر دو رکعتیں پڑھیں جو اپنے سے پہلے کی دو رکعتوں سے ہلکی تھیں ، پھر دو رکعتیں پڑھیں جو ا پنے سے پہلے کی دو رکعتوں سے کم تر تھیں ، پھر دو رکعتیں پڑھیں جو اپنے سے پہلی والی رکعتوں سے کم تھیں ، پھر وتر پڑھا تو یہ تیرہ رکعتیں ہوئیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 1805,
			"arabicnumber": "766",
			"text": "حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : میں ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھا ، ہم پانی کے ایک گھاٹ پر پہنچے تو آپ نے فرمایا : \" جابر!کیا تم سواری کو پلانے کے لئے گھاٹ پر نہیں اتروں گے؟ \" میں نے کہا : کیوں نہیں!رسول اللہ صلی اللہ علیہ وسلم ( بھی ) گھاٹ پر اترے اور میں بھی اترا ، پھر آپ ضرورت کے لئے تشریف لے گئے اور میں نے آپ کے لئے وضو کا پانی رکھ دیا ، آپ واپس آئے اور وضو فرمایا ، پھر آپ کھڑ ے ہوئے اور ایک کپڑے میں نماز پڑھی جس کے دونوں کنارے آپ نے مخالف سمتوں میں ڈال رکھے تھے ( دائیں کنارے کو بائیں کندھے پر اور بائیں کنارے کو دائیں کندھے پر ڈالا ) میں آپ کے پیچھے کھڑا ہوگیا تو آپ نے میرے کان سے پکڑ کر مجھے اپنی دائیں طرف کرلیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 1806,
			"arabicnumber": "767",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت ہے ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب رات کو نماز پڑھنے کےلئے اٹھتے ، اپنی نماز کا آغاز دو ہلکی رکعتوں سے فرماتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 1807,
			"arabicnumber": "768",
			"text": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" جب تم میں سے کوئی رات کو ( نماز کے لئے ) اٹھے تو وہ اپنی نماز کا آغاز دو ہلکی رکعتوں سے کرے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 1808,
			"arabicnumber": "769.01",
			"text": "امام مالک ؒ نے ابو زہیر سے ، انھوں نے طاؤس سے اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم جب رات کی آ خری تہائی میں نماز کے لئے اٹھتے تو فرماتے : \" اے اللہ ! تمام تعریف تیرے ہی لئے ہے ، تو آسمانوں اور زمین کا نور ہے اور تیرے ہی لئے حمد ہے تو آسمانوں اور زمین کو قائم رکھنے والا ہے اور تیرے ہی لئے حمد ہےتو آسمانوں اور زمین کا اور جو کچھ ان میں ہے تو پالنے والا ہے ۔ اور توبرحق ہے اور تیرا وعدہ سچا ہے اور تیرا قول اٹل ہے اور تیرے ساتھ ملاقات قطعی ہے اور جنت حق ہے اور جہنم حق ہے اور قیامت حق ہے ۔ اے اللہ میں نے اپنے آپ کو تیرے سپرد کردیا اور میں تجھ پر ایمان لایا اور میں نے تجھ پر توکل اور بھروسہ کیا اور تیری طرف رجوع کیا اور تیر ی توفیق سے ( تیرے منکروں سے ) جھگڑا کیا اور تیرے ہی حضور فیصلہ لایا ( تجھے ہی حاکم تسلیم کیا ) تو بخش دے وہ گناہ جو میں نے پہلے کیے اور جو بعد میں کئے اور جو چھپ کرکئے اور جو ظاہرا کیے تو ہی میرا معبود ہے تیرے سوا کوئی معبود نہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 1809,
			"arabicnumber": "769.02",
			"text": "سفیان اور ابن جریج دونوں نے سلیمان ا حول سے ، انھوں نے طاؤس سے ، انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی ۔ ابن جریج اور امام مالک ؒ کی ( گزشتہ ) حدیث کے الفاظ ایک جیسے ہیں ، دو جملوں کے سوا کوئی اختلاف نہیں ، ابن جریج نے قيام کے بجائے قيم کہا ( معنی ایک ہیں ) اور واسررت کی جگہ وما اسررت کہا ۔ ( سفیان ) ابن عینیہ کی حدیث میں کچھ اضافہ ہے ، وہ متعدد جملوں میں امام مالکؒ اور ابن جریج سے اختلاف کرتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 1810,
			"arabicnumber": "769.03",
			"text": "قیس بن سعد نے طاؤس سے ، انھوں نے ابن عباس رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے یہی حدیث روایت کی ۔ ( اس حدیث کے راوی عمران القصیر کے ) الفاظ ان ( امام مالک ، سفیان ، ابن جریج ) کے الفاظ سے ملتے جلتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 1811,
			"arabicnumber": "770",
			"text": "ابو سلمہ بن عبدالرحمان نے کہا : میں نے ام المومنین حضرت عائشہ رضی اللہ تعالیٰ عنہا سے پوچھا : نبی اکرم صلی اللہ علیہ وسلم جب رات کو نماز کے لئے اٹھتے تھے تو کس چیز کے ساتھ نماز کا آغاز کرتے تھے؟انھوں نے جواب دیا : جب آپ رات کو اٹھتے تو نماز کا آ غاز ( اس دعا سے ) کرتے : \" اے اللہ! جبرائیل ، میکائیل اور اسرافیل کے رب!آسمانوں اور زمین کو پیدا فرمانے والے!پوشیدہ اور ظاہر کو جاننے والے!تیرے بندے جن باتوں میں اختلاف کرتے تھے تو ہی ان کے درمیان فیصلہ فرمائےگا ۔ ، جن باتوں میں اختلاف کیا گیا ہے تو ہی ا پنے حکم سے مجھے ان میں سے جو حق ہے اس پر چلا ، بے شک تو ہی جسے چاہے سیدھی راہ پر چلاتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 1812,
			"arabicnumber": "771.01",
			"text": "یوسف ماجثون نے کہا : مجھ سے میرے والد ( یعقوب بن ابی سلمہ ماجثون ) نے عبدالرحمان اعرج سے حدیث بیان کی ، انھوں نے عبیداللہ بن ابی رافع سے ، انھوں نے حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ سے اور انھوں نےرسول اللہ صلی اللہ علیہ وسلم سے ر وایت کی کہ جب رسول اللہ صلی اللہ علیہ وسلم نماز کے لئے کھڑ ے ہوتے تھے تو فرماتے : \"\" میں نے اپنا رخ اس ذات کی طرف کردیا ہے ۔ جس نے آسمانوں اور زمین کو پیدا فرمایا ، ہر طرف سے یکسو ہوکر ، اور میں اس کے ساتھ شریک ٹھہرانے والوں میں سے نہیں ، میری نماز اور میری ہر ( بدنی ومالی ) عبادت اور میرا جینا اور میرا مرنا اللہ کے لئے ہے جو کائنات کا رب ہے ، اس کا کوئی شریک نہیں اور اسی کا مجھے حکم ملا ہے اور میں فرمانبرداری کرونے والوں میں سے ہوں ۔ اے اللہ ! تو ہی بادشاہ ہے تیرے سوا کوئی بندگی کے لائق نہیں ، تو میرا رب ہے میں تیرا بندہ ہوں اور میں نے اپنے اوپر ظلم کیا ہے اور اپنے گناہ کا اعتراف کیا ہے ، اس لئے میرے سارے گناہ بخش دے کیونکہ گناہوں کو بخشنے والا تیرے سوا کوئی نہیں ، اور میری بہترین اخلاق کی طرف راہنمائی فرما ، تیرے سوا بہترین اخلاق کی راہ پر چلانے والا کوئی نہیں ، اور برے اخلاق مجھ سے ہٹا دے ، تیرے سوا برے اخلاق کو مجھ سے دور کرنے والا کوئی نہیں ، میں تیرے حضور حاضر ہوں اور دونوں جہانوں کی سعادتیں تجھ سے ہیں ہر طرح کی بھلائی تیر ے ہاتھ میں ہے اور برائی کا تیر ی طرف کوئی گزر نہیں ہے میں تیرے ہی سہارے ہوں ، اور تیری ہی طرف میرا رخ ہے ، تو برکت والا رفعت والا اور بلندی والا ہے میں تجھ سے بخشش مانگتا ہوں اور تیرے حضور توبہ کر تا ہوں ۔ \"\" اور جب آپ رکوع کرتے تو فرماتے : \"\" اے اللہ ! میں تیرے سامنے جھکا ہوا ہوں اور میں تجھ ہی پر ایمان لایاہوں ، اپنے آپ کو تیرے ہی سپرد کر دیا ہے ، میرے کان اور میری آنکھیں اور میرا مغز اور میری ہڈیاں اور میری رگیں اور میرے پٹھے تیرے ہی حضور جھکے ہوئے ہیں ۔ \"\" اور جب رکوع سے اٹھتے تو کہتے : \"\" اے اللہ! ہمارے رب ، تیرے ہی لئے حمد ہے جس سے آ سمانوں اور زمین کی وسعتیں بھر جائیں اور اس کے بعد جو تو چاہے اس کی وسعتیں بھر جائیں ۔ \"\" اور جب آپ سجدہ کرتے تو کہتے : \"\" اے اللہ!میں نے تیرے ہی حضور سجدہ کیااور تجھ ہی پر ایمان لایا اور ا پنے آپ کو تیرے ہی حوالے کیا ، میرا چہرہ اس ذات کے سامنے سجدہ ریز ہے جس نےاسے پیدا کیا ، اس کی صورت گری کی اور اس کے کان اور اس کی آنکھیں تراشیں ، برکت والاہے اللہ جو بہترین خالق ہے ۔ \"\" پھر تشہد اور سلام کے درمیان میں یہ دعا پڑھتے ۔ \"\" اے اللہ ! بخش دے جو خطائیں میں نے پہلے کیں یا بعد میں کیں اور چھپا کر کہیں یا علانیہ کیں اور جو بھی زیادتی میں نے کی اور جس کا مجھ سے زیادہ تمھیں علم ہے ( اطاعت اور خیر میں ) تو ہی آگے کرنے والا ہے اور تو ہی پیچھے کرنے والا ہے اور تیرے سوا کوئی عبادت کا حقدار نہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 1813,
			"arabicnumber": "771.02",
			"text": "عبدالعزیز بن عبداللہ بن ابی سلمہ نے اپنے چچا الماجثون ( یعقوب ) بن ابی سلمہ سے اور انھوں نے ( عبدالرحمان ) اعرج سے اسی سند کے ساتھ یہی حدیث بیان کی اور کہا : رسول اللہ صلی اللہ علیہ وسلم جب نماز کا آغاز فرماتے تو اللہ اکبر کہتے ، پھر د عا پڑھتے : وجهت وجهيي اس میں ( کے بجائے ) \" انا من المسلمين \" اور میں اطاعت وفرمانبرداری میں اولین ( مقام پر فائز ) ہوں \" کے الفاظ ہیں اور کہا : جب آپ رکوع سے اپنا سر اٹھاتے تو \" سمع الله لمن حمده ربنا ولك الحمد \" کہتے اورصوره ( اس کی صورت گری کی ) کے بعد \" فاحسن صوره \" ( اس کو بہترین شکل وصورت عنایت فرمائی ) کے الفاظ کہے اور کہا جب سلام پھیرتے تو کہتے : \" اللهم اغفرلي ما قدمت \" اے اللہ! بخش دے جو میں نے پہلے کیا ۔ \" حدیث کے آخر تک اور انھوں نے \" تشہد اور سلام پھیرنے کے درمیان \" کے الفاظ نہیں کہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 1814,
			"arabicnumber": "772",
			"text": "عبداللہ بن نمیر ، ابو معاویہ اور جریر سب نے اعمش سے ، انھوں نے سعد بن عبیدہ سے ، انھوں نے مستورد بن احنف سے ، انھوں نے صلہ بن زفر سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، ۔ انھوں نے کہا : ایک رات میں نبی اکرم صلی اللہ علیہ وسلم کے ساتھ نماز پڑھی ، آپ نے سورہ بقرہ کا آغاز فرمایا ، میں نے ( دل میں ) کہا : آپ سو آیات پڑھ کر رکوع فرمائیں گے مگر آپ آگے بڑھ گئے میں نے کہا : آپ اسے ( پوری ) رکعت میں پڑھیں گے ، آپ آگے پڑھتے گئے ، میں نے سوچا ، اسے پڑھ کر رکوع کریں گے مگر آپ نے سورہ نساءشروع کردی ، آپ نے وہ پوری پڑھی ، پھر آپ نے آل عمران شروع کردی ، اس کو پورا پڑھا ، آپ ٹھر ٹھر کر قرائت فرماتے رہے جب ایسی آیت سے گزرتے جس میں تسبیح ہے توسبحان اللہ کہتے اور جب سوال ( کرنے والی آیت ) سے گزرتے ( پڑھتے ) تو سوا ل کرتے اور جب پناہ مانگنے والی آیت سے گزرتے تو ۔ ( اللہ سے ) پناہ مانگتے ، پھر آپ نے ر کوع فرمایا اور سبحان ربي العظيم کہنے لگے ، آپ کا رکوع ( تقریباً ) آپ کے قیام جتنا تھا ۔ پھر آپ نے \"\" سمع الله لمن حمده \"\" کہا : پھر آپ لمبی دیر کھڑے رہے ، تقریباً اتنی دیر جتنی دیر رکوع کیا تھا ، پھر سجدہ کیا اور \"\" سبحان ربي الاعلي \"\" کہنے لگے اور آپ کا سجدہ ( بھی ) آپ کے قیام کے قریب تھا ۔ جریر کی روایت میں یہ اضافہ ہےکہ آپ نے کہا : ( سمع الله لمن حمده ربنا لك الحمد \"\" ) یعنی ربنا لك الحمدکا اضافہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 1815,
			"arabicnumber": "773.01",
			"text": "جریر نے اعمش سے اور انھوں نے ابووائل سے روایت کی ۔ انھوں نے کہا : حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نمازپڑھی آپ نے اتنی لمبی نماز پڑھی کہ میں نے ایک ناپسندیدہ کام کا ارادہ کر لیا ۔ کہا : تو ان سے پوچھا گیا آپ نے کس بات کا ارادہ کیا تھا؟ انھوں نے کہا : میں نے ارادہ کیا کہ بیٹھ جاؤں اور آپ کو ( اکیلے ہی قیام کی حالت میں ) چھوڑدوں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 1816,
			"arabicnumber": "773.02",
			"text": "علی بن مسہر نے اعمش سے اسی سند کے ساتھ اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 1817,
			"arabicnumber": "774",
			"text": "حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کے سامنے ایک ایسے آدمی کا ذکر کیا گیا جو رات نھر سویا رہا یہاں تک کہ صبح ہو گئی آپ نے فر ما یا : وہ ( ایسا ) شخص ہے کہ شیطان نے اس کے کان میں ۔ \" یا فر ما یا : \" اس کے دونوں کا نوں میں پیشاب کر دیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 245
			}
		},
		{
			"hadithnumber": 1818,
			"arabicnumber": "775",
			"text": "حضرت علی بن ابی طالب رضی اللہ تعالیٰ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے رات کے وقت انھیں اور فاطمہ رضی اللہ تعالیٰ عنہا کو جگایا اور فر ما یا : \" کیا تم لوگ نماز نہیں پڑھو گے؟ میں نےکہا : اے اللہ کے رسول !ہماری جانیں اللہ کے ہاتھ میں ہیں جب وہ ہمیں اٹھانا چاہتا ہے اٹھا دیتا ہے جب میں نے آپ سے یہ کہا تو آپ واپس چلے گئے پھر میں نے آپ کو سنا کہ آپ واپس پلٹتے ہو ئے اپنی ران پر ہاتھ مارتے تھے اور کہتے ( آیتکا ایک ٹکڑاپڑھتے ) تھے : \" انسان سب سے بڑھ کر جھگڑا کرنے والا ہے ( جدل ( جھگڑا ) یہ تھی کہ جگا ئے جا نے پر ممنون ہو نے اور نماز پڑھنے کی بجا ئے عذر پیش کیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 246
			}
		},
		{
			"hadithnumber": 1819,
			"arabicnumber": "776",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے یہ فرمان نبی صلی اللہ علیہ وسلم کی طرف منسوب کیا آپ نے فر ما یا : \" جب تم میں سے کو ئی سوجا تا ہے تو شیطان اس کے سر کے پچھلے حصے پر تین گرہیں لگاتا ہے ہر گرہ پر تھپکی دیتا ہے کہ تم پر ایک بہت لمبی رات ( کا سونا لا زم ) ہے جب انسان بیدار ہو کر اللہ تعا لیٰ کا ذکر کرتا ہے تو ایک گرہ کھل جا تی ہے اور جب وہ وضو کرتا ہے اس سے دو گرہ کھل جا تی ہے پھر جب نماز پڑھتا ہے ساری گرہیں کھل جاتی ہیں اور وہ چاق چوبند ہشاش بشاش پاک طبیعت ( کےساتھ ) صبح کرتا ہے ورنہ ( جاگ کر عبادت نہیں کرتا تو ) صبح کو گندے دل کے ساتھ اور سست اٹھتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 247
			}
		},
		{
			"hadithnumber": 1820,
			"arabicnumber": "777.01",
			"text": "عبیداللہ نے کہا : مجھے نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے بیان کیا انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فر ما یا : \" کچھ نمازیں گھر میں پڑھا کرو اور ان ( گھروں ) کو قبریں نہ بناؤ ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 248
			}
		},
		{
			"hadithnumber": 1821,
			"arabicnumber": "777.02",
			"text": "ایوب نے نافع سے انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ، آپ نے فر ما یا : گھروں میں ( نفل ) نمازیں پڑھوں اور انھیں قبریں نہ بناؤ ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 249
			}
		},
		{
			"hadithnumber": 1822,
			"arabicnumber": "778",
			"text": "حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جب تم میں سے کو ئی اپنی مسجد میں نماز ( باجماعت ) ادا کر لے تو اپنی نماز میں سے اپنے گھر کے لیے بھی کچھ حصہ رکھے کیونکہ اللہ اس کے گھر میں اس کے نماز پڑھنے کی وجہ سے خیروبھلا ئی رکھے گا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 250
			}
		},
		{
			"hadithnumber": 1823,
			"arabicnumber": "779",
			"text": "حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اس گھر کی مثال جس میں اللہ کا ذکر کیا جا تا ہے اور اس گھر کی مثال جس میں اللہ کو یاد نہیں کیا جا تا زندہ اور مردہ جیسی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 251
			}
		},
		{
			"hadithnumber": 1824,
			"arabicnumber": "780",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" اپنے گھروں کو قبرستان نہ بنا ؤ شیطان اس گھر سے بھا گتا ہے جس میں سورہ بقرہ پڑھی جاتی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 252
			}
		},
		{
			"hadithnumber": 1825,
			"arabicnumber": "781.01",
			"text": "عبد اللہ سعید نے کہا : عمر بن عبید اللہ رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام سالم ابو نضرنے ہمیں بسربن سعید سے حدیث بیان کی اور انھوں نے حضرت زید بن ثابت رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے چٹائی کا ایک چھوٹا سا حجرہ بنوایا اور رسول اللہ صلی اللہ علیہ وسلم ( گھر سے ) باہر آکر اس میں نماز پڑھنے لگے لو گ اس ( حجرے ) تک آپ کے پیچھے پیچھے آئے اور آکر آپ کی اقتدامیں نماز پڑھنے لگے ، پھر ایک اور رات لو گ آئے اور ( حجرےکے ) پاس آگئے جبکہ رسول اللہ صلی اللہ علیہ وسلم نے ان کے پاس آنے میں تا خیر کر دی ۔ کہا : آپ ان کے پاس تشریف نہ لا ئےصحابہ کرام رضوان اللہ عنھم اجمعین نے اپنی آوازیں بلند کیں ( تاکہ آپ آوازیں سن کر تشریف لے آئیں ) اور دروازے پر چھوٹی چھوٹی کنکریاں ماریں تو رسول اللہ صلی اللہ علیہ وسلم غصے کی حالت میں ان کی طرف تشریف لا ئے اور ان سے فر ما یا : تم مسلسل یہ عمل کرتے رہے حتیٰ کہ مجھے خیال ہوا کہ یہ نماز تم پر لازم قراردے دی جا ئے گی ، اس لیے تم اپنے گھروں میں نماز پڑھا کرو کیونکہ انسان کی فرض نماز کے سوا وہی بہتر ہےجو گھر میں پڑھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 253
			}
		},
		{
			"hadithnumber": 1826,
			"arabicnumber": "781.02",
			"text": "موسیٰ بن عقبہ نے ہمیں حدیث بیان کی ، کہا : میں نے ابو نضرسے سنا انھوں نے بسر بن سعید سے اور انھوں نے حضرت زید بن ثابت رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم نے مسجد میں چٹائی سے ایک حجرہ بنوایا اور آپ نے اس میں چند راتیں نماز پڑھی حتیٰ کہ آپ کے پاس لو گ جمع ہو گئے ۔ ۔ ۔ پھر مذکورہ بالا روایت بیان کی اور اس میں یہ اضافہ کیا کہ ( آپ صلی اللہ علیہ وسلم نے فر ما یا : ) \" اگر تم پر نماز فرض کر دی گئی تو تم ( سب ) اس کی پابندی نہیں کر سکو گے ۔ \" ( یہ حجرہ اعتکاف کے لیے تھا ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 1827,
			"arabicnumber": "782.01",
			"text": "سعید بن ابی نے ابو سلمہ ( نم عبد الرحمان بن عوف ) سے انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم کی ایک چٹائی تھی آپ رات کو اس سے حجرہ بنا لیتے اور اس میں نماز پڑھتے تو لوگوں نے بھی آپ کی اقتدا میں نماز پڑھنی شروع کر دی آپ دن کے وقت اسے بچھا لیتے تھے ایک رات لو گ کثرت کے ساتھ جمع ہو گئے تو آپ نے فر ما یا : \" لوگو !اتنے اعمال کی پابندی کرو جتنے اعمال کی تم میں طاقت ہے کیونکہ ( اس وقت تک ) اللہ تعا لیٰ ( اجرو ثواب دینے سے رضی اللہ تعالیٰ عنہ نہیں اکتاتا حتیٰ کہ تم خود اکتا جاؤ اور یقیناًاللہ کے نزدیک زیادہ محبوب عمل وہی ہے جس پر ہمیشگی اختیار کی جا ئے چاہے وہ کمہو ۔ اور رسول اللہ صلی اللہ علیہ وسلم کے گھر والے جب کو ئی عمل کرتے تو اسے ہمیشہ بر قرار رکھتے ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 1828,
			"arabicnumber": "782.02",
			"text": "سعد بن ابرا ہیم سے روایت ہے کہ انھوں نے ابو سلمہ سے سنا ، وہ حضرت عائشہ رضی اللہ تعالیٰ عنہا سے حدیث بیان کرتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم سے پوچھا گیا : اللہ تعا لیٰ کو کو ن سا عمل زیادہ پسند ہے؟ آپ نے فر ما یا : \" جسے ہمیشہ کیا جا ئے اگر چہ کم ہو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 1829,
			"arabicnumber": "783.01",
			"text": "علقمہ سے روایت ہے کہا میں نے ام المومنین !عائشہ رضی اللہ تعالیٰ عنہا سے سوال کیا اور کہا ام المومنین !رسول اللہ صلی اللہ علیہ وسلم کے عمل کی کیفیت کیا تھی؟کیا آپ ( کسی خاص عمل کے لیے ) کچھ ایام مخصوص فر ما لیتے تھے؟انھوں نے فر ما یا : نہیں آپ کا عمل دائمی ہو تا تھا اور تم میں سے کو ن اس قدر استطاعت رکھتا ہے جتنی استطاعت رسول اللہ صلی اللہ علیہ وسلم میں تھی ؟",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 1830,
			"arabicnumber": "783.02",
			"text": "قاسم بن محمد نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روا یت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" اللہ تعا لیٰ کے ہاں محبوب ترین کا م وہ ہے جس پر ہمیشہ عمل کیا جا ئے اگرچہ وہ قلیل ہو ۔ ( قاسم بن محمد نے ) کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا جب کو ئی عمل کرتیں تو اس کو لازم کر لیتی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 1831,
			"arabicnumber": "784.01",
			"text": "ابوبکر بن ابی شیبہ نے کہا : ہمیں ابن علیہ نے حدیث سنائی ، نیز زہیر بن حرب نے کہا : ہمیں اسماعیل نے حدیث سنائی ، ان دونوں ( ابن علیہ اوراسماعیل ) نے عبدالعزیز بن صہیب سے اور انھوں نے حضرت انس رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم مسجد میں داخل ہوئے اور ( دیکھا کہ ) دو ستونوں کے درمیان ایک رسی لٹکی ہوئی ہے ۔ آپ صلی اللہ علیہ وسلم نے پوچھا : \" یہ کیا ہے؟صحابہ رضوان اللہ عنھم اجمعین کرام نے عرض کی : حضرت زینب رضی اللہ تعالیٰ عنہا کی رسی ہے ، وہ نماز پڑھتی رہتی ہیں ، جب سست پڑتی ہیں یا تھک جاتی ہیں تو اس کو پکڑ لیتی ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اسے کھول دو ، ہرشخص نماز پڑھے جب تک ہشاش بشاش رہے ، جب سست پڑ جائے یا تھک جائے تو بیٹھ جائے ۔ \" زہیر کی روایت میں ( قعد کی بجائے ) \" فليقعد \" ہے ۔ یعنی ماضی کی بجائے امر کا صیغہ استعمال کیا ، مفہوم ایک ہی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 1832,
			"arabicnumber": "784.02",
			"text": "عبدالوارث نے عبدالعزیز ( بن صہیب ) سے ، انھوں نے حضرت انس رضی اللہ تعالیٰ عنہا سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 1833,
			"arabicnumber": "785.01",
			"text": "ابن شہاب نے کہا : مجھے عروہ بن زبیر نے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا نے ا نھیں بتایا کہ حولا بنت تویت بن حبیب بن اسد بن عبدالعزیٰ اس عالم میں ان کے قریب سے گزری جب رسول اللہ صلی اللہ علیہ وسلم ان کے پاس تھے ، کہا : میں نے عرض کی : یہ حولا بنت تویت ہیں اور لوگوں کا خیال ہے کہ یہ رات بھر نہیں سوتیں رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : ( کیا رات بھر نہیں سوتی!اتنا عمل اپنا ؤ جتنے کی تم طاقت رکھتے ہو ۔ اللہ کی قسم!اللہ نہیں اکتائے گا یہاں تک کہ تم اکتا جاؤ ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 1834,
			"arabicnumber": "785.02",
			"text": "ابو اسامہ اور یحییٰٰ بن سعید نے ہشام بن عروہ سے روایت کی ، انھوں نے کہا : مجھے میرے والد نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کرتے ہوئے خبر دی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم میرے پاس تشریف لائے اور میرے پاس ایک خاتون موجود تھیں ، آپ نے پوچھا : \"\" یہ کون ہے؟ \"\" میں نے کہا : یہ ایسی عورت ہے جو رات بھر نہیں سوتی ، نماز پڑھتی رہتی ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \"\" اتنا عمل کرو جتنا تمہارے بس میں ہو ، اللہ کی قسم !اللہ نہیں اکتائے گا یہاں تک کہ تم ہی عمل سے اکتا جاؤ ۔ \"\" اللہ کے ہاں دین کا وہی عمل پسند ہے جس پر عمل کرنے والا ہمیشگی کرے ۔ ابو اسامہ کی روایت میں ہے ، یہ بنو اسد کی عورت تھی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 1835,
			"arabicnumber": "786",
			"text": "حضرت عائشہ رضی اللہ تعالیٰ عنہا سے رویت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نےفرمایا : \" جب تم میں سے کوئی شخص نماز میں اونگھنے لگے تو وہ سوجائے حتیٰ کہ نیند جاتی رہے کیونکہ جب تم میں سے کوئی شخص اونگھ کی حالت میں نماز پڑھتاہے تو وہ ممکن ہے وہ استغفار کرنے چلے لیکن ( اس کی بجائے ) اپنے آپ کو برا بھلا کہنے لگے ،",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 1836,
			"arabicnumber": "787",
			"text": "ہمام بن منبہ نے کہا : یہ احادیث ہیں جو ابوہریرۃ رضی اللہ تعالیٰ عنہ نے ہمیں محمد رسول اللہ صلی اللہ علیہ وسلم کے واسطے بیان کی ہیں ، پھر ان میں سے کچھ احادیث ذکر کیں ، ان میں سے یہ بھی تھیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی شخص رات کو قیام کرے اور اس کی زبان پر قراءت مشکل ہوجائے اور اسے پتہ نہ چلے کہ وہ کیا کہہ رہا ہے تو اسے لیٹ جانا چاہیے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 1837,
			"arabicnumber": "788.01",
			"text": "ابواسامہ نے ہشام سے انھوں نے اپنے والد ( عروہ ) سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ نبی صلی اللہ علیہ وسلم نے ایک آدمی کی قراءت سنی جو وہ رات کو کر رہا تھا تو فر ما یا : \" اللہ اس پر رحم فر ما ئے !اس نے مجھے فلاں آیت یاد دلا دی جس کی تلاوت فلاں سورت میں چھوڑ چکا تھا",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 1838,
			"arabicnumber": "788.02",
			"text": "عبد ہ اور ابو معاویہ نے ہشام سے انھوں نے اپنے والد ( عروہ ) سے اور انھوں نے حضڑت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی انھوں نے کہا نبی صلی اللہ علیہ وسلم مسجد میں ایک آدمی کی قراءت سن رہے تھے تو آپ نے فر ما یا : \" اللہ اس پر رحم فر ما ئے ! اس نے مجھے ایک آیت یاد دلا دی ہے جو مجھے بھلا دی گئی تھی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 1839,
			"arabicnumber": "789.01",
			"text": "امام مالک نے نافع کے واسطے سے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا \" صاحب قرآن ( قرآن حفظ کرنے والے ) کی مثال پاؤں بندھے اونٹوں ( کے چرواہے ) کی مانند ہے اگر اس نے ان کی نگہداشت کی تو وہ انھیں قابو میں رکھے گا اور اگر انھیں چھوڑ دے گا تو وہ چلے جا ئیں گے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 1840,
			"arabicnumber": "789.02",
			"text": "عبید اللہ ایوب اور موسیٰ بن عقبہ سب نے ( جن تک سندوں کے مختلف سلسلے پہنچے ) نافع سے انھوں نے حضڑت ابن عمر رضی اللہ تعالیٰ عنہ سے مالک کی حدیث کے ہم معنی روایت بیان کی اور موسیٰ بن عقبہ کی روایت میں یہ اضافہ ہے : \" جب صاحب قرآن قیام کرے گا اور رات دن اس کی قراءت کرے گا تو وہ اسے یاد رکھے گا اور جب اس ( کی قراءت ) کے ساتھ قیام نہیں کرے گا تو وہ اسے بھول جا ئے گا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 1841,
			"arabicnumber": "790.01",
			"text": "منصور نے ابو وائل ( شفیق بن سلمہ ) سے اور انھوں نے حضڑت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کسی بھی انسان کے لیے انتہائی ناز یبا بات ہے کہ وہ کہے ۔ میں فلاں فلاں آیت بھول گیا ہوں بلکہ وہ بھوادیا گیا ہے قرآن کو یاد کرتے رہو کیونکہ وہ لو گوں کے سینوں سے دور بھاگنے میں رسیوں سمیت بھا گ جا نے والے اونٹوں سے بھی بڑھ کر ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 1842,
			"arabicnumber": "790.02",
			"text": "اعمش نے شفیق بن سلمہ سے روا یت کی انھوں نے کہا ۔ حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ کہا ان مصاحف ۔ ۔ اور کبھی کہا : قرآن ۔ ۔ کے ساتھ تجدید عہد کرتے رہا کرو کیونکہ وہ انسانوں کے سینوں سے بھا گ جا نے میں اپنے پاؤں کی رسیوں سے نکل بھاگنے والے اونٹوں سے بھی بڑھ کر ہے کہا : اور رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا ہے ۔ \" تم میں سے کسی کو یہ نہیں کہنا چا ہیے کہ میں فلا ں فلا ں آیت بھول گیا ہوں بلکہ اسے بھلوا دیا گیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 1843,
			"arabicnumber": "790.03",
			"text": "عبدہ بن ابی لبابہ نے شفیق بن سلمہ سے روایت کی انھوں نے کہا : میں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہو ئے سنا : \" کسی آدمی کے لیے یہ بہت بری بات ہے کہ وہ کہے میں فلا ں فلاں سورت بھول گیا یا فلا ں فلاں آیت بھول گیا بلکہ اسے بھلوا دیا گیا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 1844,
			"arabicnumber": "791",
			"text": "عبد اللہ بن براد اشعری اور ابو کریب نے کہا ہمیں ابو اسامہ نے برید سے انھوں نے ابو بردہ سے انھوں نے حضرت ابو موسیٰ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے حدیث بیان کی آپ صلی اللہ علیہ وسلم نے فر ما یا : \" قرآن کی نگہداشت کرو اس ذات کی قسم جس کے ہاتھ میں محمد ( صلی اللہ علیہ وسلم ) کی جا ن ہے ! یہ بھا گنے میں پاؤں بندھے اونٹؤں سے بڑھ کر ہے ۔ اس حدیث کے الفاظ ابن براد ( کی روایت ) کے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 1845,
			"arabicnumber": "792.01",
			"text": "سفیان بن عیینہ نے زہری سے انھوں نے ابو سلمہ سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی وہ اس ( فر ما ن ) کو نبی صلی اللہ علیہ وسلم تک پہنچا تے تھے آپ صلی اللہ علیہ وسلم نے فر ما یا : \" اللہ تعا لیٰ نے ( کبھی ) کسی چیز پر اس قدر کان نہیں دھرا ( توجہ سے نہیں سنا ) جتنا کسی خوش آواز نبی ( کی آواز ) پر کان دھرا جس نے خوش الحانی سے قراءت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 1846,
			"arabicnumber": "792.02",
			"text": "یونس اور عمر ( بن حارث ) دونوں نے ابن شہاب سے اسی سند کے ساتھ یہ روایت کی اس میں ) ما اذن لنبي کے بجا ئے ) كما ياذن لنبي ( جس طرح ایک نبی کے لیے کان دھرتا ہے جو خوش الحانی سے قراءت کررہا ہو ۔ ) کے الفاظ ہیں",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 1847,
			"arabicnumber": "792.03",
			"text": "عبد العزیز بن محمد نے کہا : یزید بن ہاد نے ہمیں محمد بن ابرا ہیم سے حدیث بیان کی انھوں نے ابو سلمہ سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے ہوئے سنا : اللہ تعا لیٰ نے ( کبھی ) کسی چیز پر اس طرح کان نہیں دھرا جس طرح کسی خوش آواز نبی ( کی قراءت ) پر جب وہ بلند آواز کے ساتھ خوش الحانی سے قراءت کرے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 1848,
			"arabicnumber": "793.01",
			"text": "عمر بن مالک اور حیوہ بن شریح نے ابن ہاد سے اسی سند کے ساتھ بالکل اس جیسی روا یت بیان کی اور انھوں نے ( ان رسول الله ) ( بے شک رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا ) کہا اور سَمِعَ ( اس نے سنا ) کا لفظ نہیں بولا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 1849,
			"arabicnumber": "793.02",
			"text": "حییٰ بن ابی کثیرؒ نے ابو سلمہ سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر مایا : اللہ تعا لیٰ نے ( کبھی ) کسی چیز پر اس طرح کا ن نہیں دھرا جیسے وہ نبی صلی اللہ علیہ وسلم ( کی آواز ) پر کا ن دھرتا ہے جو بلند آواز کے ساتھ خوش الحانی سے قراءت کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 1850,
			"arabicnumber": "793.03",
			"text": "یحییٰ بن ایوب قتیبہ بن سعید اور ابن حجر نے کہا : ہمیں اسماعیل بن جعفر نے محمد بن عمرو سے حدیث بیان کی انھوں نے ابو سلمہ سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے یحییٰ بن ابی کثیر کی حدیث کی طرح روا یت بیان کی مگر ابن ایوب نے اپنی روا یت میں ( كاذنه کے بجا ئے ) كاذنه ( جس طرح وہ اجازت دیتا ہے ) کہا ۔ اس ( طرح ما اذن الله کا معنی ہو گا اللہ تعا لیٰ نے ( بار یابی کی اجازت نہیں دی ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 1851,
			"arabicnumber": "793.04",
			"text": "حضرت برید رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" عبد اللہ بن قیس ۔ ۔ یا اشعری ۔ ۔ ۔ کو آل داودکی بنسریوں ( خوبصورت آوازوں ) میں سے ایک بنسری ( خوبصورت آواز ) عطاکی گئی ہے",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 1852,
			"arabicnumber": "793.05",
			"text": "(حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روا یت ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فر ما یا ) : کیا ہی خوب ہو تا ) کاش! تم مجھے دیکھتے جب گزشتہ رات میں بڑے انہماک سے تمھاری قراءت سن رہا تھا تمھیں آل داؤدکی خوبصورت آوازوں میں سے ایک خوبصورت آوازدی گئی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 1853,
			"arabicnumber": "794.01",
			"text": "عبداللہ بن ادریس اور وکیع نے شعبہ سے اور انھوں نے معاویہ بن قرہ سے روایت کی ، انھوں نے کہا : میں نے عبداللہ بن مغفل مزنی رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : نبی اکرم صلی اللہ علیہ وسلم نے فتح مکہ والے سال اپنے سفر میں اپنی سواری پر سورہ فتح کی تلاوت فرمائی اور اپنی قراءت میں آواز کو دہرایا ۔ معاویہ نے کہا : اگر مجھے یہ اندیشہ نہ ہوتا کہ لوگ میرے گرد جمع ہوجائیں گے تو میں تمھیں آپ صلی اللہ علیہ وسلم جیسی قراء ت سناتا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 1854,
			"arabicnumber": "794.02",
			"text": "محمد بن جعفر نے کہا : شعبہ نے ہمیں معاویہ بن قرہ سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت عبداللہ بن مغفل سے سنا ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فتح مکہ کے دن اپنی اونٹنی پر ( سوار ) سورہ فتح پڑھتے ہوئے دیکھا ۔ ( معاویہ بن قرہ نے ) کہا : حضرت ابن مغفل رضی اللہ تعالیٰ عنہ نےقراءت کی اور اس میں ترجیع کی ، معاویہ نے کہا : اگر مجھے لوگوں ( کے اکھٹے ہوجانے ) کا اندیشہ نہ ہوتا تو میں تمھارے لئے ( قراءت کا ) وہی ( طریقہ اختیار ) کرتا جو حضرت ابن مغفل رضی اللہ تعالیٰ عنہ نے نبی اکرم صلی اللہ علیہ وسلم کے حوالے سے بیان کیا تھا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 1855,
			"arabicnumber": "794.03",
			"text": "خالد بن حارث اور معاذ نے کہا : شعبہ نے ہمیں اسی سند کے ساتھ اسی طرح کی حدیث بیان کی ، خالد بن حارث کی روایت میں ہے کہ آپ صلی اللہ علیہ وسلم ( سورہ فتح تلاوت کرتے ہوئے اپنی ) سواری پر سفر کررہے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 1856,
			"arabicnumber": "795.01",
			"text": "ابو خثیمہ نے ابو اسحاق سے اور انھوں نے حضرت بر اء رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ایک آدمی سورہ کہف کی تلاوت کررہاتھا اور اس کے پاس ہی دو رسیوں میں بندھا ہواگھوڑا ( موجود ) تھا ۔ تو اسے ایک بدلی نے ڈھانپ لیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 1857,
			"arabicnumber": "795.02",
			"text": "محمد بن جعفر نے کہا : ہم سے شعبہ نے ابو اسحاق سے حدیث بیان کی ۔ انھوں نے کہا : میں نے حضرت براء رضی اللہ تعالیٰ عنہ سے سنا وہ کہہ رہے تھے : ایک آدمی نے سورہ کہف کی قراءت کی ۔ گھرمیں ( اس وقت ) ایک چوپا یہ بھی تھا ۔ وہ بدکنے لگا اس شخص نے دیکھا کہ جا نور کے اوپر دھندیا بدلی تھی جو اس پر چھائی ہو ئی ہے تو اس نے یہ واقعہ نبی اکرم صلی اللہ علیہ وسلم کو بتایا آپ نے فر ما یا : اے شخص ! پڑھا کرو یہ تو سکینت تھی جو قراءت کے وقت اتری ( یا قرآن کی خاطر نازل ہو ئی ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 1858,
			"arabicnumber": "795.03",
			"text": "عبد الرحمٰن بن مہدی اور داؤد نے کہا : ہمیں شعبہ نے ابو اسحاق سے حدیث بیان کی انھوں نے کہا : میں نے حضرت براء رضی اللہ تعالیٰ عنہ کو کہتے ہو ئے سنا ۔ ۔ ۔ آگے دونوں ( عبد الرحمٰن بن مہدی اور ابوداؤد ) نے سابقہ حدیث کے مانند ذکر کیا ۔ البتہ اتنا فرق ہے کہ انھوں نے ( تنفر \" وہ بدکنے لگا \" کے بجا ئے ) تنقز ( وہ اچھلنے لگا ) کہا",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 286
			}
		},
		{
			"hadithnumber": 1859,
			"arabicnumber": "796",
			"text": "حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ نے حدیث بیان کی کہ حجرت اسید بن حضیر رضی اللہ تعالیٰ عنہ ایک رات اپنے باڑے میں قراءت کر رہے تھے کہ اچانک ان کا گھوڑا بدکنے لگا انھوں نے پھر پڑھا وہ دوبارہ بدکا پھر پڑھا وہ پھر بدکا ۔ اسید رضی اللہ تعالیٰ عنہ نے کہا : مجھے خوف پیدا ہوا کہ وہ ( میرے بیٹے ) یحییٰ کو روند ڈالے گا میں اٹھ کر اس کے پاس گیا تو اچانک چھتری جیسی کو ئی چیز میرے سر پر تھی اس میں کچھ چراغوں جیسا تھا وہ فضا میں بلند ہو گئی حتیٰ کہ مجھے نظر آنا بند ہو گئی کہا : میں صبح کو رسول اللہ صلی اللہ علیہ وسلم کے پاس گیا اور عرض کی : اے اللہ کے رسول !اس اثنا میں کہ کل میں آدھی رات کے وقت اپنے باڑے میں قراءت کر رہا تھا کہ اچانک میرا گھوڑا بدکنے لگا ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ابن حضیر!پڑھتے رہتے ۔ \" میں نے عرض کی : میں پڑھتا رہا پھر اس نے دوبارہ اچھل کود کی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ابن حضیر! پڑھتے رہتے ۔ میں نے کہا : میں نے قراءت جاری رکھی اس نے کچھ بدک کر چکر لگانے شروع کر دیے ۔ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ابن حضیر! پڑھتے رہتے ۔ میں نے کہا : پھر میں نے چھوڑ دیا ۔ ( میرا بیٹا ) یحییٰ اس کے قریب تھا میں ڈر گیا کہ وہ اسے روند دے گا ۔ تو میں چھتری جیسی چیز دیکھی اس میں چراغوں کی طرح کی چیزیں تھیں وہ فضا میں بلند ہو ئی حتیٰ کہ مجھے نظر آنی بند ہو گئی اس پر رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" وہ فرشتے تھے جو تمھاری قراءت سن رہے تھے اور اگر تم پڑھتے رہتے تو لوگ صبح کو دیکھ لیتے وہ ان سے اوجھل نہ ہوتے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 287
			}
		},
		{
			"hadithnumber": 1860,
			"arabicnumber": "797.01",
			"text": "(ابو عوانہ نے قتادہ سے انھوں نے حضرت انس ) سے انھوں نے حضرت ابو موسیٰ اشعری رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : اس مومن کی مثال جو قرآن مجید کی تلاوت کرتا ہے نارنگی کی سی ہے اس کی خوشبوبھی عمدہ ہے اور اس کا ذائقہ ( بھی خوشگوار ہے اور اس مومن کی مثال جو قرآن مجید کی تلاوت نہیں کرتا کھجور کی سی ہے اس کی خوشبو نہیں ہو تی جبکہ اس کا ذائقہ شیریں ہے اور اس منافق کی مثال جو قرآن کی تلاوت کرتا نیاز بو جیسی ہے اس کی خوشبوعمدہ ہے اور ذائقہ کڑوا ہے اور اس منافق کی مثال جو قرآن نہیں پڑھتا اندر ائن ( تمے ) کی طرح ہے جس کی خوشبو بھی نہیں ہو تی اور اس کا ذائقہ ( بھی سخت ) کڑوا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 288
			}
		},
		{
			"hadithnumber": 1861,
			"arabicnumber": "797.02",
			"text": "ہمام اور شعبہ نے قتادہ سے اسی سند کے ساتھ اسی کی طرح حدیث روایت کی ۔ اس میں یہ فرق ہے کہ ہمام کی روایت میں منا فق کی جگہ فاجر ( بدکردار ) کا لفظ ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 289
			}
		},
		{
			"hadithnumber": 1862,
			"arabicnumber": "798.01",
			"text": "ابو عوانہ نے قتادہؒ سے روایت کی ، انھوں نے زراہ بن اوفیٰ ( عامری ) سے ، انھوں نےسعد بن ہشام سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" قرآن مجید کا مہر قرآن لکھنے والے انتہائی معزز اور اللہ تعالیٰ کے فرمانبردار فرشتوں کے ساتھ ہوگا اور جو انسان قرآن مجیدپڑھتاہے اور ہکلاتا ہے ۔ اور وہ ( پڑھنا ) اس کے لئے مشقت کا باعث ہے ، اس کے لئے دو اجر ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 290
			}
		},
		{
			"hadithnumber": 1863,
			"arabicnumber": "798.02",
			"text": "ابن ابی عدی نے سعید سے روایت کی ، وکیع نے ہشام دستوائی سے روایت کی ، ان دونوں نے قتادہ سے اسی سند کے ساتھ حدیث بیان کی البتہ وکیع کی حدیث میں یہ الفاظ ہیں : \" جو اسے پڑھتا ہے اور وہ اس پر گراں ہوتا ہے ، اس کے لئے دو اجر ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 291
			}
		},
		{
			"hadithnumber": 1864,
			"arabicnumber": "799.01",
			"text": "ہمام نےکہا : ہم سے قتادہ نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے حدیث بیان کی کہ رسول اللہ صلی اللہ علیہ وسلم نے حضرت ابی رضی اللہ تعالیٰ عنہ سے فرمایا : \" اللہ تعالیٰ نے مجھے حکم دیا ہے کہ میں تمھارے سامنے قراءت کروں ۔ \" انھوں نےکہا : کیا اللہ تعالیٰ نے آپ کے سامنے میرا نام لیا؟ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے میرے سامنے تمہارا نام لیا ۔ \" تو حضرت ابی رضی اللہ تعالیٰ عنہ رونے لگے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 292
			}
		},
		{
			"hadithnumber": 1865,
			"arabicnumber": "799.02",
			"text": "محمد بن جعفر نے کہا : ہم سے شعبہ نے حدیث بیان کی ، انھوں نے کہا : میں نے قتادہ کو حضرت انس رضی اللہ تعالیٰ عنہ سے حدیث بیان کرتے سنا ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ابی بن کعب رضی اللہ تعالیٰ عنہ سے فرمایا : \" اللہ تعالیٰ نے حکم دیا ہے کہ میں تمہارے سامنےلَمْ يَكُنِ الَّذِينَ كَفَرُ‌وا کی قراءت کروں ۔ \" انھوں نے کہا : اور ( اللہ تعالیٰ نے ) آپ کے سامنے میرا نام لیا ہے؟آپ نے فرمایا : \" ہاں ۔ \" ( انس رضی اللہ تعالیٰ عنہ نے ) کہا : تو وہ رودیئے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 293
			}
		},
		{
			"hadithnumber": 1866,
			"arabicnumber": "799.03",
			"text": "خالد بن حارث نے کہا : شعبہ نے ہمیں قتادہ کے حوالے سے حدیث بیان کی ، انھوں نے کہا : میں نے حضرت انس رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے ابی رضی اللہ تعالیٰ عنہ سے کہا ۔ ۔ ۔ ( آگے سابقہ حدیث ) کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 294
			}
		},
		{
			"hadithnumber": 1867,
			"arabicnumber": "800.01",
			"text": "حفص بن غیاث نے اعمش سے روایت کی ، انھوں نے ابراہیم سے ، انھوں عبیدہ ( سلمانی ) سےاور انھوں نے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" میرے سامنے قرآن مجید کی قراءت کرو ۔ \" انھوں نے کہا : میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! کیا میں آپ کو سناؤں ، جبکہ آپ پر ہی تو ( قرآن مجید ) نازل ہوا ہے؟آپ نے فرمایا : \" میری خواہش ہے کہ میں اسےکسی دوسرے سے سنوں ۔ \" تو میں نے سورہ نساء کی قراءت شروع کی ، جب میں اس آیت پر پہنچا : فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلَاءِ شَهِيدًا \" اس وقت کیا حال ہوگا ، جب ہم ہر امت میں سے ایک گواہ لائیں گے اور آپ کو ان پر گواہ بنا کرلائیں گے ۔ \" تو میں نے اپنا سر اٹھایا ، یا میرے پہلو میں موجود آدمی نے مجھے ٹھوکا دیا تو میں نے اپنا سر اٹھایا ، میں نے دیکھا کہ آپ صلی اللہ علیہ وسلم کے آنسو بہہ رہے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 295
			}
		},
		{
			"hadithnumber": 1868,
			"arabicnumber": "800.02",
			"text": "ہناد بن سری اور منجانب بن حارث تمیمی نے علی بن مسہر سے روایت کی ، انھوں نے اعمش سے اسی سندکے ساتھ روایت کی ، ہناد نے اپنی روایت میں یہ اضافہ کیا : رسول اللہ صلی اللہ علیہ وسلم نے ، جب آپ منبر پر تشریف فرماتھے ، مجھ سے کہا : \" مجھے قرآن سناؤ",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 296
			}
		},
		{
			"hadithnumber": 1869,
			"arabicnumber": "800.03",
			"text": "مسعر نے عمرو بن مرہ سے اور انھوں نے ابراہیم سے روایت کی ، انھوں نے کہا : نبی اکرم صلی اللہ علیہ وسلم نے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے کہا : \"\" مجھے قرآن مجید سناؤ ۔ \"\" انھوں نے کہا : کیا میں آپ کو سناؤں جبکہ ( قرآن ) اترا ہی آپ پر ہے؟آپ نے فرمایا : \"\" مجھے اچھا لگتاہے کہ میں اسے کسی دوسرے سے سنوں ۔ \"\" ( ابراہیم ) نے کہا : انھوں نے آپ کے سامنے سورہ نساء ابتداء سے اس آیت تک سنائی : فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَىٰ هَـٰؤُلَاءِ شَهِيدًا \"\" اس وقت کیا حال ہوگا ، جب ہم ہر امت میں سے ایک گواہ لائیں گے اور آپ کو ان پر گواہ بنا کرلائیں گے ۔ \"\" تو آپ صلی اللہ علیہ وسلم ( اس آیت پر ) رو پڑے ۔ مسعر نے ایک دوسری سند سے عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کا یہ قول نقل کیا کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \"\" میں ان پر اس وقت تک گواہ تھا جب تک میں ان میں رہا ۔ \"\" مسعر کو شک ہے ۔ ما دمت فيهم کہایا ما كنت فيهم ( جب تک میں ان میں تھا ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 297
			}
		},
		{
			"hadithnumber": 1870,
			"arabicnumber": "801.01",
			"text": "جریر نے اعمش سے ، انھوں نے ابراہیم سے ، انھوں نے علقمہ سے اور انھوں نے حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : \"\" میں حمص میں تھا تو کچھ لوگوں نے مجھے کہا : ہمیں قرآن مجید سنائیں تو میں نے انھیں سورہ یوسف سنائی ۔ لوگوں میں سے ایک آدمی نے کہا : اللہ کی قسم! یہ اس طرح نہیں اتری تھی ۔ میں نے کہا : تجھ پر افسوس ، اللہ کی قسم!میں نے یہ سورت رسول اللہ صلی اللہ علیہ وسلم کو سنائی تھی تو آ پ نے مجھ سے فرمایا : \"\" تو نے خوب قراءت کی ۔ \"\" اسی اثنا میں کہ میں اس سے گفتگو کررہا تھا تو میں نے اس ( کے منہ ) سے شراب کی بو محسوس کی ، میں نے کہا : تو شراب بھی پیتا ہے اور کتاب اللہ کی تکذیب بھی کرتا ہے؟تو یہاں سے نہیں جاسکتا حتیٰ کہ میں تجھے کوڑے لگاؤں ، پھر میں نے اسے حد کے طور پر کوڑے لگائے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 298
			}
		},
		{
			"hadithnumber": 1871,
			"arabicnumber": "801.02",
			"text": "عیسیٰ بن یونس اور ابو معاویہ نے اعمش سے اسی سند کے ساتھ ر وایت کی لیکن ابومعاویہ کی روایت میں فقال لي احسنت ( آپ نے مجھے فرمایا : \" تو نے بہت اچھا پڑھا \" ) کے الفاظ نہیں ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 299
			}
		},
		{
			"hadithnumber": 1872,
			"arabicnumber": "802",
			"text": "حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \" کیا تم میں سے کوئی شخص یہ پسند کرتا ہے کہ جب وہ ( باہر سے ) اپنے گھر واپس آئے تو اس میں تین بڑی فربہ حاملہ اونٹنیاں موجود پائے؟ \" ہم نے عرض کی : جی ہاں!آپ نے فرمایا : \" تین آیات جنھیں تم میں سے کوئی شخص اپنی نماز میں پڑھتا ہے ۔ وہ اس کے لئے تین بھاری بھرکم اور موٹی تازی حاملہ اونٹنیوں سے بہتر ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 300
			}
		},
		{
			"hadithnumber": 1873,
			"arabicnumber": "803",
			"text": "حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا کہ رسول اللہ صلی اللہ علیہ وسلم گھر سےنکل کر تشریف لائے ۔ ہم صفہ ( چبوترے ) پر مووجودتھے ، آپ نے فرمایا : \" تم میں سے کون پسند کرتا ہے کہ روزانہ صبح بطحان یا عقیق ( کی وادی ) میں جائے اور وہاں سے بغیر کسی گناہ اور قطع رحمی کے دو بڑے بڑے کوہانوں والی اونٹنیاں لائے؟ \" ہم نے عرض کی ، اے اللہ کے رسول صلی اللہ علیہ وسلم ! ہم سب کو یہ بات پسندہے آپ نے فرمایا : \" پھر تم میں سے صبح کوئی شخص مسجد میں کیوں نہیں جاتا کہ وہ اللہ کی کتاب کی دو آیتیں سیکھے یا ان کی قراءت کرے تو یہ اس کے لئے دو اونٹنیوں ( کے حصول ) سے بہتر ہے اور یہ تین آیات تین اونٹنیوں سے بہتر اور چار آیتیں اس کے لئے چار سے بہتر ہیں اور ( آیتوں کی تعداد جو بھی ہو ) اونٹوں کی اتنی تعداد سے بہتر ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 301
			}
		},
		{
			"hadithnumber": 1874,
			"arabicnumber": "804.01",
			"text": "ابو توبہ ربیع بن نافع نے بیان کیا کہ ہم سے معاویہ ، یعنی ابن اسلام نے حدیث بیان کی ، انھوں نے زید سے روایت کی کہ انھوں نے ابو سلام سے سنا ، وہ کہتے تھے : مجھ سے حضرت ابو امامہ باہلی رضی اللہ تعالیٰ عنہ نے حدیث بیان کی ، انھوں کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کویہ فرماتے ہوئے سنا : \"\" قرآن پڑھا کرو کیونکہ وہ قیامت کے دن اصحاب قرآن ( حفظ وقراءت اور عمل کرنے والوں ) کا سفارشی بن کر آئےگا ۔ دو روشن چمکتی ہوئی سورتیں : البقرہ اور آل عمران پڑھا کرو کیونکہ وہ قیامت کے دن اس طرح آئیں گی جیسے وہ دو بادل یا دو سائبان ہوں یا جیسے وہ ایک سیدھ میں اڑتے پرندوں کی وہ ڈاریں ہوں ، وہ اپنی صحبت میں ( پڑھنے اور عمل کرنے ) والوں کی طرف سے دفاع کریں گی ۔ سورہ بقرہ پڑھا کرو کیونکہ اسے حاصل کرنا باعث برکت اور اسے ترک کرناباعث حسرت ہے اور باطل پرست اس کی طاقت نہیں رکھتے ۔ \"\" معاویہ نے کہا : مجھے یہ خبر پہنچی ہے کہ باطل پرستوں سے ساحر ( جادوگر ) مراد ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 302
			}
		},
		{
			"hadithnumber": 1875,
			"arabicnumber": "804.02",
			"text": "یحییٰ بن حسان نے کہا : معاویہ بن سلام نے ہمیں اسی سند کے ساتھ اسی طرح حدیث بیان کی لیکن انہوں نے دونوں جگہوں پراوكانهما ( یا جیسے وہ ) کی جگہ \" وكانهما \" ( اور جیسے وہ ) کہا اور معاویہ کا قول ہے کہ \" مجھے یہ خبرپہنچی \" ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 303
			}
		},
		{
			"hadithnumber": 1876,
			"arabicnumber": "805",
			"text": "حضرت نواس بن سمعان کلابی رضی اللہ تعالیٰ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئے سنا : \" قیامت کے دن قرآن اور قرآن والے ایسے لوگوں کو لایا جائے گا جو اس پر عمل کرتے تھے ، سورہ بقرہ اورسورہ آل عمران اس کے آگے آگے ہوں گی ۔ \" رسول اللہ صلی اللہ علیہ وسلم نے ان سورتوں کے لئے تین مثالیں دیں جن کو ( سننے کے بعد ) میں ( آج تک ) نہیں بھولا ، آپ نے فرمایا : \" جیسے وہ دو بادل ہیں یا دو کالے سائبان ہیں جن کے درمیان روشنی ہے جیسے وہ ایک سیدھ میں اڑنے والے پرندوں کی دو ٹولیاں ہیں ، وہ ا پنے صاحب ( صحبت میں رہنے والے ) کی طرف سے مدافعت کریں گی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 304
			}
		},
		{
			"hadithnumber": 1877,
			"arabicnumber": "806",
			"text": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ سےروایت ہے کہ جبرئیل علیہ السلام نبی اکرم صلی اللہ علیہ وسلم کے پاس بیٹھے ہوئے تھے کہ اچانک انھوں نے اوپر سے ایسی آواز سنی جیسی دروازہ کھلنے کی ہوتی ہے تو انھوں نے اپنا سر اوپر اٹھایا اور کہا : آسمان کا یہ دروازہ آج ہی کھولا گیا ہے ، آج سے پہلے کبھی نہیں کھولا گیا ، اس سے ایک فرشتہ اترا تو انھوں نے کہا : یہ ایک فرشتہ آسمان سے اترا ہے یہ آج سے پہلے کبھی نہیں اترا ، اس فرشتے نے سلام کیا اور ( آپ صلی اللہ علیہ وسلم سے ) کہا : آپ کو دو نور ملنے کی خوشخبری ہو جو آپ سے پہلے کسی نبی کو نہیں دیئے گئے : ( ایک ) فاتحہ الکتاب ( سورہ فاتحہ ) اور ( دوسری ) سورہ بقرہ کی آخری آیات ۔ آپ ان دونوں میں سے کوئی جملہ بھی نہیں پڑھیں گے مگر وہ آپ کو عطا کردیا جائے گا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 305
			}
		},
		{
			"hadithnumber": 1878,
			"arabicnumber": "807.01",
			"text": "زہیر نے کہا : ہم سے منصور نے حدیث بیان کی ، انھوں نے ابراہیم سے اور انھوں نے عبدالرحما بن یزید سے ر وایت کی ، انھوں نے کہا : میں بیت اللہ کے پاس حضرت ابو مسعود رضی اللہ تعالیٰ عنہ سے ملا تو میں نے کہا : مجھے آپ کے حوالے سے سورہ بقرہ کی دو آیتوں کے بارے میں حدیث پہنچی ہے ۔ تو انھوں نے کہا : ہاں ، رسول اللہ صلی اللہ علیہ وسلم نے فرمایا تھا : \" سورہ بقرہ کی آخری دو آیتیں ، جو شخص رات میں انھیں پڑھے گا وہ اس کے لئے کافی ہوں گی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 306
			}
		},
		{
			"hadithnumber": 1879,
			"arabicnumber": "807.02",
			"text": "جریر اور شعبہ دونوں نے منصور سے اسی سند کے ساتھ یہی ر وایت بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 307
			}
		},
		{
			"hadithnumber": 1880,
			"arabicnumber": "808.01",
			"text": "علی بن مسہر نے اعمش سے روایت کی ، انھوں نے ابراہیم سے ، انھوں نے عبدالرحمان بن یزید سے ، انھوں نے علقمہ بن قیس سے اور انھوں نے حضرت ابو مسعود انصاری رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جس نے رات کے وقت سورہ بقرہ کی یہ آخری دو آیات پڑھیں ، وہ اس کے لئے کافی ہوں گی ۔ \"\" عبدالرحمان نے کہا : میں خود ابومسعود رضی اللہ تعالیٰ عنہ کو ملا ، وہ بیت اللہ کا طواف کررہے تھے ، میں نے ان سے پوچھا تو انھوں نے مجھے یہ روایت ( براہ راست ) نبی اکرم صلی اللہ علیہ وسلم سے سنائی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 308
			}
		},
		{
			"hadithnumber": 1881,
			"arabicnumber": "808.02",
			"text": "عیسیٰ بن یونس اور عبداللہ بن نمیر نے اعمش سے باقی ماندہ اسی سند کےساتھ اسی کے مانند روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 309
			}
		},
		{
			"hadithnumber": 1882,
			"arabicnumber": "808.03",
			"text": "حفص اور ابو معاویہ نے بھی اعمش سے باقی ماندہ سابقہ سند کے ساتھ اسی کے مانند ر وایت بیان کی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 310
			}
		},
		{
			"hadithnumber": 1883,
			"arabicnumber": "809.01",
			"text": "معاذ بن ہشام نے اپنے والد سے حدیث بیان کی ، انھوں نے قتادہ سے ، انھوں نے سالم بن ابی جعد غطفانی سے ، انھوں نے معدان بن ابی طلحہ یعمری سے اور انھوں نے حضرت ابو درداء رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا : \" جس ( مسلمان ) نے سورہ کہف کی پہلی دس آیات حفظ کرلیں ، اسے دجال کے فتنے سے محفوظ کرلیا گیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 311
			}
		},
		{
			"hadithnumber": 1884,
			"arabicnumber": "809.02",
			"text": "شعبہ اور ہمام نے قتادہ سے اسی سند کے ساتھ روایت کی ۔ اس میں شعبہ نے سورہ کہف کی آخری ( دس ) آیات کہا ہے جبکہ ہمام نے ابتدائی ( دس ) آیات کہا ہے جس طرح ہشام کی روایت ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 312
			}
		},
		{
			"hadithnumber": 1885,
			"arabicnumber": "810",
			"text": "حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اے ابو منذر!کیا تم جانتے ہو کتاب اللہ کی کونسی آیت ، جو تمھارے پاس ہے ، سب سے عظیم ہے؟ \" کہا : میں نے عرض کی : اللہ اوراس کے رسول صلی اللہ علیہ وسلم زیادہ جانتے ہیں ۔ آپ نے ( دوبارہ ) فرمایا : \" اے ابو منذر! کیا تم جانتے ہو اللہ کی کتاب کی کونسی آیت جو تمہارے پاس ہے ، سب سے عظمت والی ہے؟ \" کہا : میں نے عرض کیاللَّهُ لَا إِلہ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ کہا : تو آپ نے میرے سینے پر ہاتھ مارا اور فرمایا : اللہ کی قسم !ابو منذر! تمھیں یہ علم مبارک ہو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 313
			}
		},
		{
			"hadithnumber": 1886,
			"arabicnumber": "811.01",
			"text": "شعبہ نے قتادہ سے ، انہوں نے سالم بن ابی جعد سے ، انہوں نے معدان بن ابی طلحہ سے ، انھوں نے حضرت ابو درداء رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تم میں سے کوئی شخص اتنا بھی نہیں کرسکتا کہ ایک رات میں تہائی قرآن کی تلاوت کرلے؟ \" انھوں ( صحابہ کرام رضوان اللہ عنھم اجمعین ) نے عرض کی : ( کوئی شخص ) تہائی قرآن کی تلاوت کیسے کرسکتاہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : قُلْ هُوَ اللَّهُ أَحَدٌ ایک تہائی قرآن کے برابر ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 314
			}
		},
		{
			"hadithnumber": 1887,
			"arabicnumber": "811.02",
			"text": "سعید بن ابی عروبہ اور ابان عطار نے قتادہ سے اسی سابقہ سند کے ساتھ روایت کی ، ان دونوں ( سعید اور ابان ) کی حدیث میں رسول اللہ صلی اللہ علیہ وسلم کا یہ فرمان ہے ، آپ صلی اللہ علیہ وسلم نے فرمایا : \" اللہ تعالیٰ نے قرآن مجید کے تین اجزاء ( حصے ) کئے ہیں اور قُلْ هُوَ اللَّهُ أَحَدٌ کو قرآن کے اجزاء میں سے ایک جز قرار دیاہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 315
			}
		},
		{
			"hadithnumber": 1888,
			"arabicnumber": "812.01",
			"text": "یزید بن کیسان نے کہا : ہمیں ابو حازم نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے حدیث سنائی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اکھٹے ہوجاؤ!میں تمھارے سامنے ایک تہائی قرآن مجید پڑھوں گا ۔ \" جنھوں نے جمع ہونا تھا وہ جمع ہوگئے پھر نبی اکرم صلی اللہ علیہ وسلم باہر تشریف لائے اور آپ صلی اللہ علیہ وسلم نے سورہ قُلْ هُوَ اللَّهُ أَحَدٌ کی قراءت فرمائی ، پھر گھر میں چلے گئے تو ہم میں سے ایک سے دوسرے نے کہا : مجھے لگتاہے آپ کے پاس شاید آسمان سے کوئی اہم خبرآئی ہے ۔ جو آپ کو اندر لے گئی ہے ۔ پھر نبی اکرم صلی اللہ علیہ وسلم ( دوبارہ ) باہر تشریف لائے اور فرمایا : \" میں نے تم سے کہا تھا نا کہ میں تمھیں تہائی قرآن سناؤں گا ، جان لو یہ کہ ( سورت ) قرآن کے تیسرے حصے کے برابر ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 316
			}
		},
		{
			"hadithnumber": 1889,
			"arabicnumber": "812.02",
			"text": "ابواسماعیل بشیر نے ابو حازم سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم باہر نکل کر ہمارے پاس تشریف لائے اور فرمایا : \" میں تمھارے سامنے تہائی قرآن کی قراءت کرتا ہوں ۔ \" پھر آپ صلی اللہ علیہ وسلم نے قُلْ هُوَ اللَّهُ أَحَدٌ ﴿ اللَّهُ الصَّمَدُ پڑھا یہاں تک کہ اسے ( سورت ) کو ختم کردیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 317
			}
		},
		{
			"hadithnumber": 1890,
			"arabicnumber": "813",
			"text": "عمرہ بنت عبدالرحمان نے ، اور وہ رسول اللہ صلی اللہ علیہ وسلم کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا کی پرورش میں تھیں ، حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک آدمی کو ایک مہم کا امیر بنا کر روانہ فرمایا ، وہ اپنے ساتھیوں کی نماز میں قراءت کرتا اور ( اس کا ) اختتام قُلْ هُوَ اللَّهُ أَحَدٌ سے کرتا تھا ۔ جب وہ لوگ واپس آئے تو انھوں نے اس بات کا تذکرہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے کیا ۔ آپ نے فرمایا : \" اسے پوچھو ، وہ ایسا کس لئے کرتا تھا؟ \" صحابہ کرام نے پوچھا تو اس نے جواب دیا : اس لئے کہ یہ رحمٰن ( جل وعلا ) کی صفت ہے ، اس لئے مجھے اس بات سے محبت ہے کہ میں اس کی قراءت کروں ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اسے بتادو! اللہ بھی اس سے محبت کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 318
			}
		},
		{
			"hadithnumber": 1891,
			"arabicnumber": "814.01",
			"text": "بیان ( بن بشر ) نے قیس بن ابی حازم سے اور انھوں نے حضرت عقبہ بن عامر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" کیا تمھیں معلوم نہیں کہ جو آیتیں آج مجھ پر نازل کی گئی ہیں ان جیسی ( آیتیں ) کبھی دیکھی تک نہیں گئیں؟ \" قُلْ أَعُوذُ بِرَ‌بِّ الْفَلَقِ اور قُلْ أَعُوذُ بِرَ‌بِّ النَّاسِ ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 319
			}
		},
		{
			"hadithnumber": 1892,
			"arabicnumber": "814.02",
			"text": "محمد بن عبداللہ بن نمیر نے بیان کیا ، کہا : میرے والد نے ہمیں حدیث بیان کی ، کہا : مجھ سے اسماعیل نے حدیث بیان کی ، انھوں نے قیس سے اور انھوں نے عقبہ بن عامر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" مجھ پر ایسی آیتیں اتاری گئی ہیں کہ ان جیسی ( آیتیں ) کبھی دیکھی تک نہیں گئیں ۔ ( یعنی ) معوذ تین ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 320
			}
		},
		{
			"hadithnumber": 1893,
			"arabicnumber": "814.03",
			"text": "۔ وکیع اور ابو اسامہ نے اسماعیل سے اسی سند کے سات اسی طرح روایت بیان کی ، البتہ ابو اسامہ نے عقبہ بن عامر جہنی رضی اللہ تعالیٰ عنہ سے جو روایت کی ، اس میں ہے ، عقبہ بن عامر جہنی رضی اللہ تعالیٰ عنہ سے روایت ہے اور وہ محمد صلی اللہ علیہ وسلم کے بلند مرتبہ ساتھیوں میں سے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 321
			}
		},
		{
			"hadithnumber": 1894,
			"arabicnumber": "815.01",
			"text": "سفیان بن عینیہ نے حدیث بیان کی ، کہا : ہمیں ( ابن شہاب ) زہری نے سالم سے حدیث بیان کی ، انھوں نے اپنے والد ( عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ نے فرمایا : \" دو چیزوں ( خوبیوں ) کے سوا کسی اور چیز میں حسد ( رشک ) کی گنجائش نہیں : ایک وہ آدمی جسے اللہ تعالیٰ نے قرآن کی نعمت عنایت فرمائی ، پھر وہ دن اور رات کی گھڑیوں میں اس کے ساتھ قیام کرتا ہے ۔ اور دوسرا وہ شخص جسے اللہ نے مال ودولت سے نوازا اور وہ دن اور رات کے اوقات میں اسے ( اللہ کی راہ میں ) خرچ کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 322
			}
		},
		{
			"hadithnumber": 1895,
			"arabicnumber": "815.02",
			"text": "یونس نے ابن شہاب ( زہری ) سے روایت کی ، انھوں نے کہا : مجھے سالم بن عبداللہ بن عمر رضی اللہ تعالیٰ عنہ نے اپنے والد سے حدیث سنائی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دو چیزوں کے علاوہ کسی چیز میں حسد ( رشک ) نہیں : ایک اس شخص سے متعلق جسے اللہ تعالیٰ نے یہ کتاب عنایت فرمائی اور اس نے دن رات کی گھڑیوں میں اس کے ساتھ قیام کیا اور دوسرا وہ شخص جسے اللہ تعالیٰ نے مال سے نوازا اور اس نے دن رات کے اوقات میں اسے صدقہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 323
			}
		},
		{
			"hadithnumber": 1896,
			"arabicnumber": "816",
			"text": "حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" دو باتوں کے سوا کسی چیز میں حسد ( رشک ) نہیں کیا جاسکتا : ایک وہ آدمی جسے اللہ تعالیٰ نے مال دیا پھر اسے اس پر مسلط کردیا کہ وہ اس مال کو حق کی راہ میں بے دریغ لٹائے ۔ دوسرا وہ انسان جسے اللہ تعالیٰ نے حکمت ( دانائی ) عطا کی اور وہ اس کے مطابق ( اپنے اور دوسروں کے ) معاملات طے کر تا ہے اور اس کی تعلیم دیتاہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 324
			}
		},
		{
			"hadithnumber": 1897,
			"arabicnumber": "817.01",
			"text": "ابراہیم بن سعد نے ابن شہاب ( زہری ) سے اور انھوں نے عامر بن واثلہ سے روایت کی کہ نافع بن عبدالحارث ( مدینہ اور مکہ کے راستے پر ایک منزل ) عسفان آکر حضرت عمر رضی اللہ تعالیٰ عنہ سے ملے ، ( وہ استقبال کے لئے آئے ) اور حضرت عمر رضی اللہ تعالیٰ عنہ انھیں مکہ کا عامل بنایا کرتے تھے ، انھوں ( حضرت عمر رضی اللہ تعالیٰ عنہ ) نے ان سے پوچھا کہ آپ نے اہل وادی ، یعنی مکہ کے لوگوں پر ( بطور نائب ) کسے مقرر کیا؟نافع نے جواب دیا : ابن ابزیٰ کو ۔ انھوں نے پوچھا ابن ابزیٰ کون ہے؟کہنے لگے : ہمارے آزاد کردہ غلاموں میں سے ایک ہے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نےکہا : تم نے ان پر ایک آزاد کردہ غلام کو اپنا جانشن بنا ڈالا؟تو ( نافع نے ) جواب دیا : و ہ اللہ عزوجل کی کتاب کو پڑھنے والا ہے اور فرائض کا عالم ہے ۔ عمر رضی اللہ تعالیٰ عنہ نے کہا : ( ہاں واقعی ) تمہارے نبی صلی اللہ علیہ وسلم نے فرمایا تھا ۔ اللہ تعالیٰ اس کتاب ( قرآن ) کے ذریعے بہت سے لوگوں کو اونچا کردیتا ہے اور بہتوں کو اس کے ذریعے سے نیچا گراتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 325
			}
		},
		{
			"hadithnumber": 1898,
			"arabicnumber": "817.02",
			"text": "شعیب نے زہری سے خبر دی ، انھوں نے کہا : مجھے عامر بن واثلہ لیثی نے حدیث بیان کی کہ نافع بن عبدالحارث خزاعی نے عسفان ( کے مقام ) پر حضرت عمر رضی اللہ تعالیٰ عنہ سے ملاقات کی ۔ ۔ ۔ ( آگے ) زہری سے ابراہیم بن سعد کی روایت کی طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 326
			}
		},
		{
			"hadithnumber": 1899,
			"arabicnumber": "818.01",
			"text": "مالک نے ابن شہاب سے ، انھوں نے عروہ بن زبیر سے انھوں نے عبدالرحمان بن عبدالقاری سے روایت کی ، انھوں نے کہا : میں نے حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : میں نے ہشام بن حکیم بن حزام کو سورہ فرقان اس سے مختلف ( صورت میں ) پڑھتے سنا جس طرح میں پڑھتا تھا ۔ ، حالانکہ مجھے ( خود ) رسول اللہ صلی اللہ علیہ وسلم نے یہ سورت پڑھائی تھی ، قریب تھا کہ میں اس سے جھگڑا کرنے میں جلد بازی سے کام لیتا لیکن میں نے اس کو مہلت دی حتیٰ کہ وہ نماز سے فارغ ہوگیا ، پھر میں نے اسے گلے کی چادر سے اسے باندھا اور کھینچ کر رسول اللہ صلی اللہ علیہ وسلم کے پا س لے آیا اور آپ صلی اللہ علیہ وسلم سے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !میں نے اس کو اس طرح سورہ فرقان پڑھتے ہوئےسنا ہے جو اس سے مختلف ہے جس طرح آپ صلی اللہ علیہ وسلم نے مجھے وہ سورت پڑھائی تھی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" اسے چھوڑ دو ( اور اسے مخاطت ہوکر فرمایا : ) پڑھو ۔ \" تو اس نے اسی طرح پڑھا جس طرح میں نے اسے پڑھتے ہوئے سنا تھا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" یہ سورت اسی طرح نازل ہوئی ہے ۔ \" پھر مجھ سے کہا : \" تم پڑھو ۔ \" میں نے پڑھا تو ( اس پر بھی ) آپ صلی اللہ علیہ وسلم نے فرمایا : \" یہ سورت اسی طرح اتری تھی ۔ بلاشبہ یہ قرآن سات حروف پر نازل کیا گیا ہے ۔ پس ان میں سے جو تمھارے لئے آسان ہواسی کے مطابق پڑھو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 327
			}
		},
		{
			"hadithnumber": 1900,
			"arabicnumber": "818.02",
			"text": "یونس نے ابن شہاب سے روایت کی ، انھوں نے کہا : مجھے عروہ بن زبیر نے بتایا کہ مسود بن مخرمہ اور عبدالرحمان بن عبدالقاری نے بتایا کہ ان دونوں حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کو یہ کہتے ہوئے سنا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کی حیات مبارکہ میں ہشام بن حکیم کو سورہ فرقان پڑھتے سنا ۔ ۔ ۔ آگے اسی کے مانند حدیث سنائی اور یہ اضافہ کیا کہ قریب تھا کہ میں اس پر نماز پر ہی پل پڑوں ، میں نے بڑی مشکل سے صبر کیا یہاں تک کہ اس نے سلام پھیرا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 328
			}
		},
		{
			"hadithnumber": 1901,
			"arabicnumber": "818.03",
			"text": "معمر نے زہری سے یونس کی روایت کی طرح اسی کی سند کے ساتھ روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 329
			}
		},
		{
			"hadithnumber": 1902,
			"arabicnumber": "819.01",
			"text": "یونس نے ابن شہاب سے روایت کی ، انھوں نے کہا : مجھ سے عبیداللہ بن عبداللہ بن عتبہ نے حدیث بیان کی کہ حضرت ابن عباس رضی اللہ تعالیٰ عنہ نے ان سے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جبرئیل علیہ السلام نے مجھے ایک حرف پر ( قرآن ) پڑھایا ، میں نے ان سے مراجعت کی ، پھر میں زیادہ کا تقاضا کرتا رہا اور وہ میرے لئے حروف میں اضافہ کرتے گئے یہاں تک کہ سات حرفوں تک پہنچ گئے ۔ \"\" ابن شہاب نے کہا : مجھے خبر پہنچی کہ پڑھنے کی یہ سات صورتیں ( سات حروف ) ایسے معاملے میں ہوتیں جو ( حقیقتاً اور معناً ) ایک ہی رہتا ، ( ان کی وجہ سے ) حلال وحرام کے اعتبار سے کوئی اختلاف نہ ہوتا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 330
			}
		},
		{
			"hadithnumber": 1903,
			"arabicnumber": "819.02",
			"text": "ہمیں معمر نے زہری سے اسی سند کے ساتھ خبر دی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 331
			}
		},
		{
			"hadithnumber": 1904,
			"arabicnumber": "820.01",
			"text": "عبداللہ بن نمیر نے کہا : اسماعیل بن ابی خالد نے ہمیں حدیث بیان کی ، انھوں نے عبداللہ بن عیسیٰ بن عبدالرحمان بن ابی یعلیٰ سے ، انھوں نے اپنے دادا ( عبدالرحمان ) سے اور انھوں نے حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں مسجد میں تھا کہ ایک آدمی داخل ہوا ، نماز پڑھنے لگا اور اس نے جس طرح قراءت کی اس کو میں نے اس کے سامنے ناقابل مقبول قرار دے دیا ۔ پھر ایک اور آدمی آیا ، پھر ایک اور آدمی آیا ، اس نے ایسی قراءت کی جو اس کے ساتھی ( پہلے آدمی ) کی قراءت سے مختلف تھی ، جب ہم نماز سے فارغ ہوئے تو ہم سب رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے ، میں نے عرض کی کہ اس شخص نے ایسی قراءت کی جو میں نے اس کے سامنے رد کردی اور دوسرا آیا تو اس نے اپنے ساتھی سے بھی الگ قراءت کی ۔ تو رسول اللہ صلی اللہ علیہ وسلم نے انھیں حکم دیا ، ان دونوں نے قراءت کی ۔ نبی اکرم صلی اللہ علیہ وسلم نے ان دونوں کے انداز کی تحسین فرمائی تو میرے دل میں آپ کی تکذیب ( جھٹلانے ) کا داعیہ اس زور سے ڈالا گیا جتنا اس وقت بھی نہ تھا جب میں جاہلیت میں تھا ۔ جب رسول اللہ صلی اللہ علیہ وسلم نے مجھ پر طاری ہونے والی اس کیفیت کو دیکھا تو میرے سینے میں مارا جس سے میں پسینہ پسینہ ہوگیا ، جیسے میں ڈر کے عالم میں اللہ کو دیکھ رہا ہوں ، آ پ صلی اللہ علیہ وسلم نے مجھ سے فرمایا : \" میرے پاس حکم بھیجا گیا کہ میں قرآن ایک حرف ( قراءت کی ایک صورت ) پر پڑھوں ۔ تو میں نے جواباً درخواست کی کہ میری امت پر آسانی فرمائیں ۔ تو میرے پاس دوبارہ جواب بھیجا کہ میں اسے دو حرفوں پر پڑھوں ۔ میں نے پھر عرض کی کہ میری امت کے لئے آسانی فرمائیں ۔ تو میرئے پاس تیسری بار جواب بھیجا کہ اسے سات حروف پر پڑھیے ، نیز آپ کے لئے ہر جواب کے بدلے جو میں نے دیا ایک دعا ہے جو آپ مجھ سے مانگیں ۔ میں نے عرض کی : اے میرے اللہ!میری امت کو بخش دے ۔ اور تیسری دعا میں نے اس دن کے لئے موخر کرلی ہے جس دن تمام مخلوق حتیٰ کہ ابراہیم علیہ السلام بھی میری طرف راغب ہوں گے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 332
			}
		},
		{
			"hadithnumber": 1905,
			"arabicnumber": "820.02",
			"text": "محمد بن بشر نے اسماعیل بن ابی خالد سے اسی سند کے ساتھ روایت کی کہ حضرت ابی ابن کعب رضی اللہ تعالیٰ عنہ نے بتایا کہ میں اس مسجد میں بیٹھا ہوا تھا کہ ایک آدمی داخل ہوا اور نماز پڑھی ، اس نے اس طرح قراءت کی ۔ ۔ ۔ ( آگے ) عبداللہ بن نمیر کی طرح حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 333
			}
		},
		{
			"hadithnumber": 1906,
			"arabicnumber": "821.01",
			"text": "محمد بن جعفر غندر نے شعبہ سے روایت کی ، انھوں نے حکم سے ، انھوں نے مجاہد سے ، انھوں نے ابن ابی لیلیٰ سے اور انھوں نے حضرت ابی بن کعب رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم بنو غفار کے اضاۃ ( بارانی تالاب ) کے پاس تشریف فرما تھے ۔ کہا : آپ کے پاس جبرئیل ؑ آئے اور کہا : اللہ تعالیٰ نے آپ کو حکم دیا ہے کہ آپ کی امت ایک حرف ( قراءت کی صورت ) پر قرآن پڑھے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں اللہ تعالیٰ سے اس کا عفو ( درگزر ) اور اس کی مغفرت چاہتاہوں میری امت اس کی طاقت نہیں رکھتی ۔ \" پھر وہ جبرئیل علیہ السلام دوبارہ آپ کے پاس آئے ۔ اور کہا کہ اللہ تعالیٰ حکم دیتا ہے کہ آپ کی امت دو حرفوں پرقرآن پڑھے ۔ آپ صلی اللہ علیہ وسلم نے کہا : \" میں اللہ تعالیٰ سے اس کا عفو اور بخشش مانگتا ہوں ، میری امت اس کی طاقت نہیں رکھتی ۔ پھر وہ جبرئیل علیہ السلام تیسری بار آپ کے پاس آئے ۔ اور کہا کہ اللہ تعالیٰ حکم دیتا ہے کہ آپ کی امت تین حرفوں پرقرآن پڑھے ۔ آپ صلی اللہ علیہ وسلم نے کہا : \" میں اللہ تعالیٰ سے اس کا عفو اور بخشش مانگتا ہوں ، میری امت اس کی طاقت نہیں رکھتی ۔ پھر وہ جبرئیل علیہ السلام چوتھی مرتبہ آپ کے پاس آئے ۔ اور کہا کہ اللہ تعالیٰ حکم دیتا ہے کہ آپ کی امت سات حرفوں پرقرآن پڑھے ۔ وہ جس حرف پر بھی پڑھیں گے ٹھیک پڑھیں گے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 334
			}
		},
		{
			"hadithnumber": 1907,
			"arabicnumber": "821.02",
			"text": "معاذ عنبری نےشعبہ سے اسی سند کے ساتھ اسی کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 335
			}
		},
		{
			"hadithnumber": 1908,
			"arabicnumber": "822.01",
			"text": "ابو بکر بن ابی شیبہ اور ابن نمیر نے وکیع سے ، انھوں نے اعمش سے اور انھوں نے ابو وائل سے روایت کی ، انھوں نے کہا : ا یک آدمی جو نہیک بن سنان کہلاتا تھا ۔ حضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کے پاس آیا اور کہا : ابو عبدالرحمان! آپ اس کلمے کو کیسےپڑھتے ہیں؟آپ اسے الف کے ساتھ مِّن مَّاءٍ غَيْرِ‌آسِنٍ سمجھتے ہیں ۔ یا پھر یاء کے ساتھ ص مِّن مَّاءٍ غَيْرِ‌ياسِنٍ ؟تو عبداللہ رضی اللہ تعالیٰ عنہ نے اس سے پوچھا : تم نے اس لفظ کے سواتمام قرآن مجید یادکرلیاہے؟اس نے کہا : میں ( تمام ) مفصل سورتیں ایک رکعت میں پڑھتاہوں ۔ اس پر حضرت عبداللہ رضی اللہ تعالیٰ عنہ نے فرمایا : شعر کی سی تیز رفتاری کےساتھ پڑھتے ہو؟کچھ لوگ قرآن مجید پڑھتے ہیں وہ ان کے گلوں سے نیچے نہیں اترتا ، لیکن جب وہ دل میں پہنچتا اور اس میں راسخ ہوتاہے تو نفع دیتا ہے ۔ نماز میں افضل رکوع اور سجدے ہیں اور میں ان ایک جیسی سورتوں کو جانتا ہوں جن کو رسول اللہ صلی اللہ علیہ وسلم ملایا کر تے تھے ، دو دو ( ملا کر ) ایک رکعت میں پڑھتے تھے ، پھر عبداللہ اٹھ کرچلے گئے ، اس پر علقمہ بھی ان کے پیچھے اندر چلے گئے ، پھر واپس آئے اور کہا : مجھے انھوں نے وہ سورتیں بتادی ہیں ۔ ابن نمیر نے اپنی روایت میں کہا : بنو بجیلہ کا ایک شخص حضرت عبداللہ رضی اللہ تعالیٰ عنہ ( بن مسعود ) کے پاس آیا ، انھوں نے \"\" نہیک بن سنان \"\" نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 336
			}
		},
		{
			"hadithnumber": 1909,
			"arabicnumber": "822.02",
			"text": "ابو معاویہ نے اعمش سے ، انھوں نے ابو وائل سے روایت کی ، انھوں نے کہا : حضرت عبداللہ کے پاس ایک آدمی آیا جسے نہیک بن سنان کہا جاتا تھا ۔ ۔ ۔ ( آگے ) وکیع کی روایت کے مانند ہے ، مگر انھوں نے کہا : علقمہ حضرت عبداللہ رضی اللہ تعالیٰ عنہ کے پاس ( گھر کے اندر ) حاضری دینے آئے تو ہم نے ان سے کہا : حضرت عبداللہ رضی اللہ تعالیٰ عنہ سے ان باہم ملتی جلتی سورتوں کے بارے میں پوچھیں جو ر سول اللہ صلی اللہ علیہ وسلم ایک رکعت میں پڑھتے تھے ۔ وہ ان کے پاس اندر چلے گئے اور ان سورتوں کے بارے میں ان سے پوچھا ، پھر ہمارے پاس تشریف لائے اوربتایا ، وہ حضرت عبداللہ رضی اللہ تعالیٰ عنہ ( کے مصحف ) کی ترتیب کے مطابق مفصل بیس سورتیں ہیں ( جنھیں آپ صلی اللہ علیہ وسلم ) دس رکعتوں میں ( پڑھتے تھے ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 337
			}
		},
		{
			"hadithnumber": 1910,
			"arabicnumber": "822.03",
			"text": "عیسیٰ بن یونس نے کہا : اعمش نے ہم سے اپنی اسی سند کے ساتھ ان دونوں ( وکیع اور ابو معاویہ ) کی حدیث کی طرح بیان کی ۔ اس میں ہے انھوں ( عبداللہ رضی اللہ تعالیٰ عنہ ) نے کہا : میں ان ایک جیسی سورتوں کو جانتا ہوں جو رسول اللہ صلی اللہ علیہ وسلم دو دو ملا کر ایک رکعت میں پڑھتے تھے ، بیس سورتیں دس رکعتوں میں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 338
			}
		},
		{
			"hadithnumber": 1911,
			"arabicnumber": "822.04",
			"text": "مہدی بن میمون نے کہا : واصل حدب نے ہمیں ابو وائل سے حدیث بیان کی ، انھوں نے کہا : ایک دن ہم صبح کی نماز پڑھنے کے بعدحضرت عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کی خدمت میں حاضر ہوئے ، ہم نے دروازے سے ( انھیں ) سلام عرض کیا ، انھوں نے ہمیں اندر آنے کی اجازت دی ، ہم کچھ دیر دروازے پر رکے رہے ، اتنے میں ایک بچی نکلی اور کہنے لگی : کیا آپ لوگ اندر نہیں آئیں گے؟ ہم اندر چلے گئے اور وہ بیٹھے تسبیحات پڑھ رہے تھے ، انھوں نے پوچھا : جب آپ لوگوں کو اجازت دے دی گئی تو پھر آنے میں کیارکاوٹ تھی؟ہم نے عرض کی : نہیں ( رکاوٹ نہیں تھی ) ، البتہ ہم نے سوچا ( کہ شاید ) گھر کے بعض افراد سوئے ہوئے ہوں ۔ انھوں نے فرمایا : تم نے ابن ام عبد کے گھر والوں کے متعلق غفلت کا گمان کیا؟ پھر دوبارہ تسبحات میں مشغول ہوگئے حتیٰ کہ انھوں نے محسوس کیا کہ سورج نکل آیا ہوگا تو فرمایا : اے بچی!دیکھو تو! کیا سورج نکل آیا ہے؟اس نے دیکھا ، ابھی سورج نہیں نکلا تھا ، وہ پھر تسبیح کی طرف متوجہ ہوگئے حتیٰ کہ پھر جب انھوں نے محسوس کیا کہ سورج طلوع ہوگیا ہے تو کہا اے لڑکی!دیکھو کیاسورج طلوع ہوگیا ہے اس نے د یکھا تو سورج طلوع ہوچکا تھا ، انھوں نے فرمایا : اللہ کی حمد جس نے ہمیں یہ دن لوٹا دیا ۔ مہدی نے کہا : میرے خیال میں انھوں نے یہ بھی کہا ۔ ۔ ۔ اور ہمارے گناہوں کی پاداش میں ہمیں ہلاک نہیں کیا ۔ لوگوں میں سے ایک آدمی نے کہا : میں نے کل رات تمام مفصل سورتوں کی تلاوت کی ، اس پر عبداللہ رضی اللہ تعالیٰ عنہ نے کہا : تیزی سے ، جس طرح شعر تیز پڑھے جاتے ہیں؟ہم نے باہم ملا کر پڑھی جانے والی سورتوں کی سماعت کی ہے ۔ اور مجھے وہ دو دو سورتیں یاد ہیں جنھیں رسول اللہ صلی اللہ علیہ وسلم پڑھا کرتے تھےمفصل میں سے اٹھارہ سورتیں اور دوسورتیں حمٰ والی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 339
			}
		},
		{
			"hadithnumber": 1912,
			"arabicnumber": "822.05",
			"text": "منصور نے ( ابووائل ) شقیق سے روایت کی ، انھوں نے کہا : بنو بجیلہ میں سے ایک آدمی جسے نہیک بن سنان کہا جاتاتھا ۔ حضرت عبداللہ رضی اللہ تعالیٰ عنہ کے پاس آیا اور کہنے لگا : میں ( تمام ) مفصل سورتیں ایک رکعت میں پڑھتا ہوں ۔ حضرت عبداللہ رضی اللہ تعالیٰ عنہ نے فرمایا : تیزی سے جیسے شعر تیزی سے پڑھے جاتے ہیں؟مجھے وہ باہم ملتی جلتی سورتیں معلوم ہیں جنھیں رسول اللہ صلی اللہ علیہ وسلم ایک ایک رکعت میں دو دو کرکے پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 340
			}
		},
		{
			"hadithnumber": 1913,
			"arabicnumber": "822.06",
			"text": "عمرو بن مرہ سے روایت ہے ۔ انھوں نے ابو وائل سے سنا وہ حدیث بیان کر رہے تھے کہ ایک آدمی حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ کے پاس آیا اور کہا : میں نے آج رات ( تمام ) مفصل سورتیں ایک رکعت میں پڑھی ہیں تو عبد اللہ رضی اللہ تعالیٰ عنہ نے فر ما یا : اس تیز رفتاری سے جس طرح شعر پڑھے جاتے ہیں؟ ( پھر ) عبد اللہ رضی اللہ تعالیٰ عنہ نے فر ما یا : میں وہ نظائر ( ایک جیسی سورتیں ) پہچا نتا ہوں جن کو رسول اللہ صلی اللہ علیہ وسلم ملا کر پڑھا کرتے تھے انھوں نے مفصل سورتوں میں سے بیس سورتیں بتا ئیں جنھیں رسول اللہ صلی اللہ علیہ وسلم دو دوملا کر ایک رکعت میں پڑھتے تھے ۔ ( ان سورتوں کی تفصیل کے لیے دیکھیے سنن ابی داؤد شھر رمضان باب تخریب القرآن 1396)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 341
			}
		},
		{
			"hadithnumber": 1914,
			"arabicnumber": "823.01",
			"text": "زہیر نے کہا : ہم سے ابو اسحاق نے حدیث بیان کی ، انھوں نے کہا : میں نے ایک آدمی کو دیکھا اس نے اسود بن یزید ( سبیعی کوفی ) سے جبکہ وہ مسجد میں قرآن کی تعلیم دے رہے تھے ۔ سوال کیا : تم اس ( آیت ) کو کیسے پڑھتے ہو ؟دال پڑھتے یا ذال ؟ انھوں نے جواب دیا : دال پڑھتا ہوں ۔ میں نے عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے سنا وہ بتا رہے تھے ۔ کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فَهَلْ مِن مُّدَّكِرٍ‌ دال کے ساتھ پڑھتے سنا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 342
			}
		},
		{
			"hadithnumber": 1915,
			"arabicnumber": "823.02",
			"text": "شعبہ نے ابو اسحاق سے انھوں نے اسود سے انھوں نے حضرت عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روا یت کی کہ آ پ صلی اللہ علیہ وسلم اس کلمے مُّدَّكِرٍ‌ پڑھتے تھے ( یعنی دال کے ساتھ)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 343
			}
		},
		{
			"hadithnumber": 1916,
			"arabicnumber": "824.01",
			"text": "اعمش نے ابرا ہیم سے اور انھوں نے علقمہ ( بن قیس کوفی ) سے روایت کی انھوں نے کہا : ہم شام آئے تو ہمارے پاس حضرت ابو دارداء رضی اللہ تعالیٰ عنہ تشریف لا ئے اور انھوں نے پو چھا : کیا تم میں سے کو ئی ایسا ہے جو عبداللہ بن مسعود رضی اللہ تعالیٰ عنہ کی قراءت کے مطابق پڑھتا ہو ؟میں نے عرض کی : جی ہاں میں ( پڑھتا ہوں ) انھوں نے پو چھا : تم نے عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ کو یہ آیت وَاللَّيْلِ إِذَا يَغْشَىٰ کسی طرح پڑھتے سناہے ۔ ( میں نے ) کہا : میں نے انھیںوَاللَّيْلِ إِذَا يَغْشَىٰ و الذَّكَرَ‌وَالْأُنثَىٰ پڑھتے سنا ۔ انھوں نے کہا : اور میں نے بھی اللہ کی قسم !رسول اللہ صلی اللہ علیہ وسلم کو ایسے ہی پڑھتے سنا لیکن یہ لو گ چا ہتے ہیں کہ میں وَمَا خَلَقَ الذَّكَرَ‌وَالْأُنثَىٰ پڑھوں میں ان کے پیچھے نہیں چلوں گا ۔ ( ابن مسعود اور ابودرداء رضی اللہ تعالیٰ عنہ غالباًقراءت کی اس دوسری صورت سے آگاہ نہ ہو سکے جو رسول اللہ صلی اللہ علیہ وسلم ہی نے سکھا ئی تھی ۔)",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 344
			}
		},
		{
			"hadithnumber": 1917,
			"arabicnumber": "824.02",
			"text": "مغیرہ نے ابرا ہیم سے روا یت کی ، انھوں نے کہا : علقم ہشام آئے اور ایک مسجد میں داخل ہو ئے اس میں نماز پڑھی ، پھر لو گو ں کے ایک حلقے میں جا کر بیٹھ گئے اتنے میں ایک صاحب آئے تو مجھے ان کے ( ارد گرد ) لو گوں کے اکٹھا ہو نے اور ( انکی وجہ سے ) ایک خاص ہیئت اختیار کر لینے کا پتہ چل گیا ( اس سے معلوم ہو تا تھا کہ وہ خاص شخصیت ہیں ) ( علقمہ نے کہا : وہ میرے پہلو میں بیٹھ گئے ۔ پھر فر ما یا : عبد اللہ رضی اللہ تعالیٰ عنہ ( بن مسعود رضی اللہ تعالیٰ عنہ ) جس طرح پڑھا کرتے تھے کیا تمھیں وہ یاد ہے؟ اس کے بعد اسی ( پہلی حدیث کی ) طرح بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 345
			}
		},
		{
			"hadithnumber": 1918,
			"arabicnumber": "824.03",
			"text": "اسماعیل بن ابرا ہیم ( ابن علیہ ) نے داودبن ابی ہند سے انھوں نے شعبی سے اور انھوں نے علقمہ سے روا یت کی ، انھوں نے کہا : میں نے حضرت ابو درداء رضی اللہ تعالیٰ عنہ سے ملا انھوں نے مجھ سے پو چھا : تم کہاں سے ہو؟ میں نے کہا : اہل عراق سے انھوں نے پو چھا : ان کے کو ن سے لو گو ں میں سے؟ میں نے کہا : اہل کو فہ سے انھوں نے پوچھا : کیاتم ( قرآن مجید ) عبد اللہ بن مسعود رضی اللہ تعالیٰ عنہ کی قراءت کے مطا بق پڑھتے ہو؟میں نے کہا : جی ہاں انھوں نے کہا : وَاللَّيْلِ إِذَا يَغْشَىٰ پڑھو ۔ میں نے پڑھا وَاللَّيْلِ إِذَا يَغْشَىٰ ﴿<http : //tanzil.net/>﴾ وَالنَّهَارِ‌إِذَا تَجَلَّىٰ ﴿<http : //tanzil.net/>﴾ وَ الذَّكَرَ‌وَالْأُنثَىٰ کہا : وہ ہنس پڑے پھر فر ما یا : میں نے اسی طرح رسول اللہ صلی اللہ علیہ وسلم کو پڑھتے سنا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 346
			}
		},
		{
			"hadithnumber": 1919,
			"arabicnumber": "824.04",
			"text": "عبد الاعلیٰ نے کہا : ہم سے داودنے عامر ( شعبی ) سے اور انھوں نے علقمہ سے روا یت کی ، انھوں نے کہا : میں شام آیا اور حضرت ابو درداء رضی اللہ تعالیٰ عنہ سے ملا ۔ ۔ ۔ ۔ آگے ابن علیہ ( اسماعیل بن ابرا ہیم ) کی ( مذکورہ با لا ) حدیث کی طرح بیا ن کیا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 347
			}
		},
		{
			"hadithnumber": 1920,
			"arabicnumber": "825",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے نماز عصر کے بعد سورج غروب ہو نے تک نماز پڑھنے سے منع فر ما یا ۔ اور صبح کے بعد سورج طلوع ہو نے تک نماز سے منع فر ما یا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 348
			}
		},
		{
			"hadithnumber": 1921,
			"arabicnumber": "826.01",
			"text": "منصور نے قتادہ سے روا یت کی انھوں نے کہا : ہمیں ابو عالیہ نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے خبر دی انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کے ایک سے زیادہ ساتھیوں سے سنا ہے ان میں عمر بن خطاب رضی اللہ تعالیٰ عنہ بھی شامل ہیں اور وہ مجھے ان میں سب سے زیادہ محبوب تھے کہ رسول اللہ صلی اللہ علیہ وسلم نے نماز فجر کے بعد سورج طلوع ہو نے تک اور عصر کے بعد سورج غروب ہو نے تک نماز پڑھنے سے منع فر ما یا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 349
			}
		},
		{
			"hadithnumber": 1922,
			"arabicnumber": "826.02",
			"text": "شعبہ سعید اور معاذ بن ہشام نے اپنے والد کے واسطے سے قتادہ سے اسی سند کے ساتھ یہ روا یت بیان کی ، البتہ سعید اور ہشام کی حدیث میں ( نماز فجر کے بعد سورج طلوع ہو نے تک کے بجا ئے ) \" صبح کے بعد سورج چمکنے تک \" کے الفاظ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 350
			}
		},
		{
			"hadithnumber": 1923,
			"arabicnumber": "827",
			"text": "عطاء بن یزید لیثی نے خبر دی کہ انھوں نے ابو سعید خدری رضی اللہ تعالیٰ عنہ کو کہتے ہوئے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" نماز عصر کے بعد کوئی نماز نہیں یہاں تک کہ سورج غروب ہوجائے اور نماز فجر کے بعد کوئی نماز نہیں یہاں تک کہ سورج طلوع ہوجائے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 351
			}
		},
		{
			"hadithnumber": 1924,
			"arabicnumber": "828.01",
			"text": "نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے کوئی شخص ( جان بوجھ کر ) طلوع شمس اور غروب شمس کے وقت کا قصد کرکے ان اوقات میں نماز نہ پڑھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 352
			}
		},
		{
			"hadithnumber": 1925,
			"arabicnumber": "828.02",
			"text": "ہشام کے والد عروہ نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اپنی نماز کے لئے جان بوجھ کر نہ سورج کے طلوع ہونے کا قصد کرو اور نہ اس کے غروب ہونے کا کیونکہ سورج شیطان کے دو سینگوں کے ساتھ طلوع ہوتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 353
			}
		},
		{
			"hadithnumber": 1926,
			"arabicnumber": "829",
			"text": "حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب سورج کا کنارہ نمودار ہوجائے تو نماز موخر کردو حتیٰ کہ وہ ( سورج ) نکل آئے ( بلند ہوجائے ) اور جب سورج کا کنارہ غروب ہوجائے تو نماز موخر کردو حتیٰ کہ وہ ( سورج ) پوری طرح غائب ہوجائے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 354
			}
		},
		{
			"hadithnumber": 1927,
			"arabicnumber": "830.01",
			"text": "لیث نے خیر بن نعیم حضرمی سے روایت کی ، انھوں نے عبداللہ بن ہبیرہ سے ، انھوں نے ابو تمیم جیشانی سے اور انھوں نے ابو بصرہ رضی اللہ تعالیٰ عنہ غفاری سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں مخمص نامی جگہ میں عصر کی نماز پڑھائی اور فرمایا \" یہ نماز تم سے پہلے لوگوں کو دی گئی ( ان پر فرض کی گئی ) تو انھوں نے اسے ضائع کردیا ، اس لئے جو بھی اس کی حفاظت کرے گا اسے اس کا دوگنا اجر ملے گا اور ا س کے بعد کوئی نماز نہیں یہاں تک کہ ( اس کا ) شاہد طلوع ہوجائے ۔ \" شاہد ( سے مراد ) ستارہ ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 355
			}
		},
		{
			"hadithnumber": 1928,
			"arabicnumber": "830.02",
			"text": "یزید بن ابی حبیب نے خیر بن نعیم حضرمی سے ، انھوں نے عبداللہ بن ہبیرہ سبائی سے ۔ ۔ ۔ اور وہ ثقہ تھے ۔ انھوں نے ابو تمیم جیشانی سے اور انھوں نے ابو بصرہ غفار ی سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ہمیں عصر کی نماز پڑھائی ۔ ۔ ۔ آگے سابقہ حدیث کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 356
			}
		},
		{
			"hadithnumber": 1929,
			"arabicnumber": "831",
			"text": "حضرت عقبہ بن عامر جہنی رضی اللہ تعالیٰ عنہ کہتے تھے کہ تین ا وقات ہیں ، رسول اللہ صلی اللہ علیہ وسلم ہمیں روکتے تھے کہ ہم ان میں نماز پڑھیں یا ان میں اپنے مردوں کو قبروں میں اتاریں : جب سورج چمکتا ہوا طلوع ہورہا ہو یہاں تک کہ وہ بلند ہوجائے اور جب دوپہر کو ٹھہرنے والا ( سایہ ) ٹھہر جاتا ہے حتیٰ کہ سورج ( آگے کو ) جھک جائے اور جب سورج غروب ہونے کے لئے جھکتا ہے یہاں تک کہ وہ ( پوری طرح ) غروب ہوجائے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 357
			}
		},
		{
			"hadithnumber": 1930,
			"arabicnumber": "832",
			"text": "ابو عمار شداد بن عبداللہ اور یحییٰ بن ابی کثیر نے ابو امامہ سے روایت کی ۔ ۔ ۔ عکرمہ نے کہا : شداد ابو امامہ اور واثلہ رضی اللہ تعالیٰ عنہ سے مل چکا ہے ، وہ شام کے سفر میں حضرت انس رضی اللہ تعالیٰ عنہ کے ساتھ رہااور ان کی فضیلت اور خوبی کی تعریف کی ۔ حضرت ابو امامہ رضی اللہ تعالیٰ عنہ سے روایت ہے ، انھوں نے کہا : عمرو بن عبسہ سلمی رضی اللہ تعالیٰ عنہ نےکہا : میں جب اپنے جاہلیت کے دور میں تھا تو ( یہ بات ) سمجھتا تھا کہ لوگ گمراہ ہیں اور جب وہ بتوں کی عبادت کرتے ہیں تو کسی ( سچی ) چیز ( دین ) پر نہیں ، پھر میں نے مکہ کے ایک آدمی کے بارے میں سنا کہ وہ بہت سی باتوں کی خبر دیتا ہے ، میں اپنی سواری پر بیٹھا اور ان کے پاس آگیا ، اس زمانے میں رسول اللہ صلی اللہ علیہ وسلم چھپے ہوئے تھے ، آپ کی قوم ( کے لوگ ) آپ کے خلاف دلیر ، اور جری تھے ۔ میں ایک لطیف تدبیر اختیار کرکے مکہ میں آپ کی خدمت میں حاضر ہوااور آپ سے پوچھا آپ کیا ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" میں نبی ہوں ۔ \" پھر میں نے پوچھا : \" نبی کیا ہوتا ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" مجھے اللہ نے بھیجا ہے ۔ \" میں نے کہا : آپ کو کیا ( پیغام ) دے کر بھیجا ہے؟آپ نے فرمایا : \" اللہ تعالیٰ مجھے صلہ رحمی ، بتوں کو توڑنے ، اللہ تعالیٰ کو ایک قرار دینے ، اور اس کے ساتھ کسی چیز کو شریک نہ ٹھہرانے ( کاپیغام ) دے کر بھیجا ہے ۔ \" میں نے آپ سے پوچھا : آپ کے ساتھ اس ( دین ) پر اور کون ہے؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" ایک آزاد اور ایک غلام ۔ \" ۔ ۔ ۔ کہا : آپ صلی اللہ علیہ وسلم کے ساتھ اس وقت ایمان لانے والوں میں سے ابو بکر اور بلال رضوان اللہ عنھم اجمعین تھے ۔ میں نے کہا : میں بھی آپ کا متبع ہوں ۔ فرمایا : \" تم اپنے آج کل کے حالات میں ایسا کرنے کی استطاعت نہیں رکھتے ۔ کیا تم میرا اور لوگوں کا حال نہیں دیکھتے؟لیکن ( ان حالات میں ) تم اپنے گھر کی طرف لوٹ جاؤ اور جب میرے بارے میں سنو کہ میں غالب آگیا ہوں تو میرے پاس آجانا ۔ \" کہا : تو میں اپنے گھر والوں کے پاس لوٹ گیا ۔ او ( بعد ازاں ) رسول اللہ صلی اللہ علیہ وسلم مدینہ تشریف لے گئے میں اپنے گھر ہی میں تھا ، جب آپ صلی اللہ علیہ وسلم مدینہ تشریف لائے ۔ تو میں بھی خبریں لینے اور لوگوں سے آپ کے حالات پوچھنے میں لگ گیا ۔ حتیٰ کہ میرے پاس اہل یثرب ( مدینہ والوں ) میں سے کچھ لوگ آئے تو میں نے پوچھا : یہ شخص جو مدینہ میں آیا ہے اس نے کیا کچھ کیا ہے؟انھوں نے کہا : لوگ تیزی سے ان ( کے دین ) کی طرف بڑھ رہے ہیں ، آپ کی قوم نے آپ کو قتل کرنا چاہا تھا لیکن وہ ایسا نہ کرسکے ۔ اس پر میں مدینہ آیا اور آپ کی خدمت میں حاضر ہوا اور عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم ! کیا آپ مجھے پہچانتے ہیں؟آپ نے فرمایا : \" ہاں تم وہی ہو ناں جو مجھ سے مکہ میں ملے تھے؟ \" کہا : تو میں نے عرض کی : جی ہاں ، اور پھر پوچھا : اے اللہ کے نبی! مجھے وہ ( سب ) بتایئے جو اللہ نے آپ کوسکھایا ہے اور میں اس سے ناواقف ہوں ، مجھے نماز کے بارے میں بتایئے ۔ آپ نے فرمایا : \" صبح کی نماز پڑھو اور پھر نمازسے رک جاؤ حتیٰ کہ سورج نکل کر بلند ہوجائے کیونکہ وہ جب طلوع ہوتا ہے تو شیطان ( اپنے سینگوں کو آگے کرکے یوں دیکھاتا ہے جیسے وہ اُس ) کے دو سینگوں کےدرمیان طلوع ہوتا ہے اور اس وقت کافر اس ( سورج ) کو سجدہ کرتے ہیں ، اس کے بعد نماز پڑھو کیونکہ نماز کا مشاہدہ ہوتاہے اور اس میں ( فرشتے ) حاضر ہوتے ہیں یہاں تک کہ جب نیزے کا سایہ اس کے ساتھ لگ جائے ( سورج بالکل سر پر آجائے ) تو پھر نماز سے رک جاؤ کیونکہ اس وقت جہنم کو ایندھن سے بھر کو بھڑکایاجاتا ہے ، پھر جب سایہ آئے جائے ( سورج ڈھل جائے ) تو نمازپڑھو کیونکہ نماز کا مشاہدہ کیاجاتا ہے اور اس میں حاضری دی جاتی ہے حتیٰ کہ تم عصر سے فارغ ہوجاؤ ، پھر نماز سے رک جاؤ یہاں تک کہ سورج ( پوری طرح ) غروب ہوجائے کیونکہ وہ شیطان کے دو سینگوں میں غروب ہوتا ہے اور اس وقت کافر اس کے سامنے سجدہ کرتے ہیں ۔ \" کہا : پھر میں نے پوچھا : اے اللہ کے نبی صلی اللہ علیہ وسلم ! تو وضو؟مجھے اس کے بارے میں بھی بتایئے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" تم میں سے جوشخص بھی وضو کے لئے پانی اپنے قریب کرتاہے ۔ پھر کلی کرتاہے اور ناک میں پانی کھینچ کر اسے جھاڑتاہے تو اس سے اس کے چہرے ، منہ ، اور ناک کے نتھنوں کے گناہ جھڑ جاتے ہیں ، پھر جب وہ اللہ کے حکم کےمطابق اپنے چہرے کو دھوتا ہے تو لازماً اس کے چہرے کےگناہ بھی پانی کے ساتھ اس کی داڑھی کے کناروں سے گر جاتے ہیں ، پھر وہ اپنے دونوں ہاتھوں کو کہنیوں ( کے اوپر ) تک دھوتا ہے ۔ تو لازماً اس کے ہاتھوں کےگناہ پانی کے ساتھ اس کے پوروں سے گرجاتے ہیں ، پھر وہ سر کا مسح کرتاہے تو اس کے سر کے گناہ پانی کے ساتھ اس کے بالوں کے اطراف سے زائل ہوجاتے ہیں ، پھر وہ ٹخنوں ( کے اوپر ) تک اپنے دونوں قدم دھوتا ہے ۔ تو اس کے دونوں پاؤں کے گناہ پانی کے ساتھ اس کے پوروں سے گر جاتے ہیں ، پھر اگر وہ کھڑا ہوانماز پڑھی اور اللہ کے شایان شان اس کی حمد وثنا اور بزرگی بیان کی اور اپنا دل اللہ کے لئے ( ہر قسم کے دوسرے خیالات وتصورات سے ) خالی کرلیا تو وہ اپنے گناہوں سے اس طرح نکلتا ہے جس طرح اس وقت تھا جس دن اس کی ماں نے اسے ( ہر قسم کے گناہوں سے پاک ) جنا تھا ۔ \" حضرت عمرو بن عبسہ رضی اللہ تعالیٰ عنہ نے یہ حدیث رسول اللہ صلی اللہ علیہ وسلم کے ( ایک اور ) صحابی حضرت ابو امامہ رضی اللہ تعالیٰ عنہ کو سنائی تو ابو امامہ رضی اللہ تعالیٰ عنہ نے ان سے کہا : اے عمرو بن عبسہ رضی اللہ تعالیٰ عنہ !دیکھ لوتم کیا کہہ رہے ہو ۔ ایک ہی جگہ اس آدمی کو اتناکچھ عطا کردیا جاتا ہے! اس پر عمرو رضی اللہ تعالیٰ عنہ نے کہا : اے ابو امامہ رضی اللہ تعالیٰ عنہ !میری عمر بڑھ گئی ہے میری ہڈیاں نرم ہوگئیں ہیں اور میری موت کا وقت بھی قریب آچکا ہے اور مجھے کوئی ضرورت نہیں کہ اللہ پر جھوٹ بولوں ۔ اور اس کے رسول صلی اللہ علیہ وسلم پر جھوٹ بولوں ۔ اگر میں نے اس حدیث کو رسول اللہ صلی اللہ علیہ وسلم سے ایک ، دو ، تین ۔ ۔ ۔ حتیٰ کہ انھوں نے سات بار شمار کیا ۔ ۔ ۔ بار نہ سنا ہوتا تو میں اس حدیث کو کبھی بیان نہ کرتا بلکہ میں نے تو اسے آپ صلی اللہ علیہ وسلم سے اس سے بھی زیادہ بارسنا ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 358
			}
		},
		{
			"hadithnumber": 1931,
			"arabicnumber": "833.01",
			"text": "وہیب نے کہا : ہم سے عبداللہ بن طاوس نے حدیث بیان کی ، انھوں نے اپنے والد ( طاوس ) سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : حضرت عمر رضی اللہ تعالیٰ عنہ کو وہم لاحق ہوا ہے ( کہ وہ ہر صورت عصر کے بعد نماز پڑھنے کو قابل سزا سمجھتے ہیں ) رسول اللہ صلی اللہ علیہ وسلم نے تو اس بات سے منع فرمایا ہے کہ سورج کے طلوع یا اس کے غروب کے وقت نماز پڑھنے کا قصد کیا جائے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 359
			}
		},
		{
			"hadithnumber": 1932,
			"arabicnumber": "833.02",
			"text": "معمر نے باقی ماندہ سابقہ سند کے ساتھ طاوس کے بیٹے سے ، انھوں نے اپنے والد سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے عصر کے بعد دو رکعت پڑھنی کبھی نہیں چھوڑ ی تھی کہا : حضرت عائشہ رضی اللہ تعالیٰ عنہا نےکہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" نماز کے لئے تم جان بوجھ کر سورج کے طلوع اور اس کے غروب ہونے کا قصد نہ کرو کہ اس وقت نماز پڑھو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 360
			}
		},
		{
			"hadithnumber": 1933,
			"arabicnumber": "834",
			"text": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ کے آزاد کردہ غلام کریب سے روایت ہے کہ عبداللہ بن عباس رضی اللہ تعالیٰ عنہ ، عبدالرحمان بن ازہر ، مسور بن مخرمہ رضی اللہ تعالیٰ عنہ انھیں نبی اکرم صلی اللہ علیہ وسلم کی زوجہ حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس بھیجا اور کہا کہ ہم سب کی طرف سے انھیں سلام عرض کرنا اور ان سے عصر کے بعد کی دو رکعت کے بارے میں پوچھنا اور کہنا کہ ہمیں خبر ملی ہے کہ آ پ یہ ( دو رکعتیں ) پڑھتی ہیں ۔ جبکہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے ہم تک یہ خبر پہنچی ہے کہ آپ صلی اللہ علیہ وسلم نے ان سے روکا ہے ۔ ابن عباس رضی اللہ تعالیٰ عنہ نے کہا کہ میں تو حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ کے ساتھ مل کر لوگوں کو ان سے روکا کرتا تھا ۔ کریب نے کہا : میں حضرت عائشہ رضی اللہ تعالیٰ عنہا کی خدمت میں حاضر ہوا اور ان حضرات نے جو پیغام د ے کر مجھے بھیجا تھا میں نے ان تک پہنچایا ۔ انھوں نے جواب دیا ام سلمہ رضی اللہ تعالیٰ عنہا سے پوچھو ۔ میں نکل کر ان حضرات کے پاس لوٹا اور انھیں ان کے جواب سے آگاہ کیا ۔ ان حضرات نے مجھے وہی پیغام دے کر حضرت اسلمہ رضی اللہ تعالیٰ عنہا کی طرف بھیج دیا جس طرح حضرت عائشہ رضی اللہ تعالیٰ عنہا کے پاس بھیجاتھا ، اس پر ام سلمہ رضی اللہ تعالیٰ عنہا نے جواب دیا ۔ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا تھا کہ آپ ان دو رکعتوں سے روکتے تھے ، پھر میں نے آپ صلی اللہ علیہ وسلم کو یہ دو رکعتیں پڑھتے ہوئے دیکھا ، ہاں ، آپ نے جب یہ دو رکعتیں پڑھیں تھیں اس وقت آپ عصر کی نماز پڑھ چکے تھے ، پھر ( عصر پڑھ کر ) آپ ( میرے گھر میں ) داخل ہوئے جبکہ میرے پاس انصار کے قبیلے بنو حرام کے قبیلے کی کچھ عورتیں موجودتھیں ، آ پ نے یہ دو رکعتیں ادا ( کرنی شروع ) کیں تو میں نے آپ کے پاس خادمہ بھیجی اور ( اس سے ) کہا : آپ صلی اللہ علیہ وسلم کی ایک جانب جا کر کھڑی ہوجاؤ اور آپ صلی اللہ علیہ وسلم سے عرض کرو کہ اے اللہ کے رسول صلی اللہ علیہ وسلم !ام سلمہ رضی اللہ تعالیٰ عنہا کہتی ہیں : میں آپ سے سنتی رہی ہوں کہ آپ ( عصر کے بعد ) ان دو رکعتوں سے منع فرماتے تھے اور اب میں آپ کو پڑھتے ہوئےدیکھ رہی ہوں؟اگر آپ صلی اللہ علیہ وسلم ہاتھ سے اشارہ فرمائیں تو پیچھے ہٹ ( کرکھڑی ہو ) جانا ۔ اس لڑکی نے ایسے ہی کیا ، آپ نے ہاتھ سے اشارہ فرمایا ، وہ آپ سے پیچھے ہٹ ( کر کھڑی ہو ) گئی ، جب آپ صلی اللہ علیہ وسلم نے سلام پھیراتو فرمایا : \" اے ابو امیہ ( حذیفہ بن مغیرہ مخزومی ) کی بیٹی!تم نے عصر کے بعد کی دورکعتوں کے بارے میں پوچھا ہے ، تو ( معاملہ یہ ہے کہ ) بنو عبدالقیس کے کچھ افراد اپنی قوم کے اسلام ( لانے کی اطلاع ) کے ساتھ میرے پاس آئے ، اور انھوں نے مجھے ظہر کی بعد کی دورکعتوں سے مشغول کردیا ، یہ وہی دو رکعتیں ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 361
			}
		},
		{
			"hadithnumber": 1934,
			"arabicnumber": "835.01",
			"text": "یحییٰ بن ایوب ، قتیبہ ، اور علی بن حجر نے اسماعیل بن جعفر سے حدیث بیان کی ، ابن ایوب نے کہا : ہمیں اسماعیل نے حدیث سنائی ، کہا مجھے محمد بن ابی حرملہ نے خبر دی ، انھوں نےکہا ، مجھے ابو سلمہ نے خبر دی کہ انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے ان دو ر کعتوں کے بارے میں پوچھا جو رسول اللہ صلی اللہ علیہ وسلم عصر کے بعد پڑھتے تھے ۔ انھوں نےکہا : آپ صلی اللہ علیہ وسلم یہ دو رکعتیں ( ظہر کے بعد ) عصر سے پہلے پڑھتے تھے ، پھر ایک دن ان کے پڑھنے سے مشغول ہوگئے یا انھیں بھول گئے تو آپ صلی اللہ علیہ وسلم نے وہ عصر کے بعد پڑھیں ، پھر آپ صلی اللہ علیہ وسلم نے انھیں قائم رکھا کیونکہ جب آپ صلی اللہ علیہ وسلم کوئی نماز ( ایک دفعہ ) پڑھ لیتے تو اسے قائم رکھتے تھے ۔ یحییٰ بن ایوب نے کہا : اسماعیل نے کہا ( اثبتها اسے قائم رکھتے تھے ) سے مراد ہے : آپ اس پر ہمیشہ عمل فرماتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 362
			}
		},
		{
			"hadithnumber": 1935,
			"arabicnumber": "835.02",
			"text": "عروہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے فرمایا : رسول اللہ صلی اللہ علیہ وسلم نے میرے ہاں عصر کے بعد دو رکعتیں کبھی نہیں چھوڑیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 363
			}
		},
		{
			"hadithnumber": 1936,
			"arabicnumber": "835.03",
			"text": "عبدالرحمان بن اسود نے اپنے والد اسود سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : دو نمازیں ہیں ، رسول اللہ صلی اللہ علیہ وسلم نے میرے گھر میں انھیں رازداری سے اور اعلانیہ کبھی ترک نہیں کیا : دو رکعتیں فجر سے پہلے اور دو رکعتیں عصر کے بعد ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 364
			}
		},
		{
			"hadithnumber": 1937,
			"arabicnumber": "835.04",
			"text": "ابو اسحاق نے اسود اور مسروق سے روایت کی ، ان دونوں نے کہا : ہم حضرت عائشہ رضی اللہ تعالیٰ عنہا کے بارے میں گواہی دیتے ہیں کہ انھوں نے کہا : کوئی دن جس میں رسول اللہ صلی اللہ علیہ وسلم میرے پاس ہوتے تھے ایسا نہ تھا کہ آپ صلی اللہ علیہ وسلم نے یہ دو رکعتیں نہ پڑھی ہوں ۔ ان کی مراد عصر کے بعد کی دو رکعتوں سے تھی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 365
			}
		},
		{
			"hadithnumber": 1938,
			"arabicnumber": "836",
			"text": "مختار بن فلفل سے روایت ہے ، انھوں نے کہا : میں نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے عصر کے بعد نفل نماز پڑھنے کے بارے میں پوچھا تو انھوں نے کہا : حضرت عمر رضی اللہ تعالیٰ عنہ عصر کے بعد نماز پڑھنے پر ہاتھوں پر مارتے تھے اور نبی اکرم صلی اللہ علیہ وسلم کےدور میں ہم سورج کے غروب ہوجانے کے بعد نماز مغرب سے پہلے دو رکعتیں پڑھتے تھے ۔ تو میں نے ان سے پوچھا : کیا رسول اللہ صلی اللہ علیہ وسلم نے یہ دو رکعتیں پڑھیں؟انھوں نے کہا : آپ ہمیں پڑھتا دیکھتے تھے آپ نے نہ ہمیں حکم دیا اور نہ روکا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 366
			}
		},
		{
			"hadithnumber": 1939,
			"arabicnumber": "837",
			"text": "عبدالعزیز بن صہیب نے حضرت انس بن مالک رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : ہم مدینے میں ہوتے تھے ، جب موذن مغرب کی اذان دیتا و لوگ ستونوں کی طرح لپکتے تھے اور وہ دو رکعتیں پڑھتے تھے حتیٰ کہ ایک مسافر مسجد میں آتا تو ان رکعتوں کو پڑھنے والوں کی کثرت دیکھ کر یہ سمجھتا کہ مغرب کی نماز ہوچکی ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 367
			}
		},
		{
			"hadithnumber": 1940,
			"arabicnumber": "838.01",
			"text": "کہمس نےکہا : ہم سے عبداللہ بن بریدہ نے حضرت عبداللہ بن مغفل مزنی رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا؛ \" ہر دو اذانوں ( اذان اور تکبیر ) کے درمیان نماز ہے ۔ \" آپ صلی اللہ علیہ وسلم نے تین دفعہ فرمایا ( اور ) تیسری دفعہ فرمایا : \" اس کے لئے جو چاہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 368
			}
		},
		{
			"hadithnumber": 1941,
			"arabicnumber": "838.02",
			"text": "جریری نے عبداللہ بن بریرہ سے ، انھوں نے حضرت عبداللہ بن مغفل رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے اسی کی مثل روایت کی ، مگرانھوں نے کہا کہ آپ صلی اللہ علیہ وسلم نے چوتھی مرتبہ فرمایا؛ \" اس کے لئے جو چاہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 369
			}
		},
		{
			"hadithnumber": 1942,
			"arabicnumber": "839.01",
			"text": "معمر نے زہری سے ، انھوں نے سالم سے اور انھوں نےحضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے نماز خوف پڑھائی ، دو گروہوں میں سے ایک کو ایک رکعت پڑھائی اور دوسرا گروہ دشمن کے سامنے کھڑا ہواتھا ، پھر یہ ( آپ کے ساتھ نماز پڑھنے والے ) پلٹ گئے اور اپنے ساتھیوں کی جگہ دشمن کی طرف رخ کرکے جاکھڑے ہوئے اور وہ لوگ آگئے ۔ پھر نبی اکرم صلی اللہ علیہ وسلم نے انھیں بھی ایک رکعت پڑھائی اور اس کے بعد نبی اکرم صلی اللہ علیہ وسلم نے سلام پھیر دیا پھر ( آپ کے بعد ) انہوں نے بھی اپنی رکعت مکمل کرلی اور انھوں نے بھی دوسری رکعت مکمل کرلی ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 370
			}
		},
		{
			"hadithnumber": 1943,
			"arabicnumber": "839.02",
			"text": "فلیح نے زہری سے ، انھوں نے سالم بن عبداللہ بن عمر سے اور انھوں نے ا پنے والد سے روایت کی کہ وہ رسول اللہ صلی اللہ علیہ وسلم سے صلاۃ الخوف ( کاطریقہ ) بیان کرتے اور فرماتے : میں نے آپ صلی اللہ علیہ وسلم کے ساتھ یہ نماز پڑھی ۔ ۔ ۔ ( آگے ) اسی کے ہم معنی حدیث ہے ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 371
			}
		},
		{
			"hadithnumber": 1944,
			"arabicnumber": "839.03",
			"text": "نافع نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے ا پنے جنگ کے ایام میں سے ایک دن نماز خوف پڑھائی ، ایک گروہ آپ صلی اللہ علیہ وسلم کے ساتھ نماز کے لئے کھڑہوگیا ۔ اور دوسرا دشمن کے بالمقابل ۔ آپ صلی اللہ علیہ وسلم نے ساتھ کھڑے ہونے والوں کو ایک رکعت پڑھا دی ، پھر یہ لوگ ( دشمن کے مقابلےمیں ) چلے گئے اور دوسرے آگئے ، آپ صلی اللہ علیہ وسلم نے انھیں بھی ایک رکعت پڑھا دی ، پھر ان دونوں گروہوں نے ( یکے بعد دیگرے ) ایک ایک رکعت اداکرلی ۔ ( نافع ) نے کہا : ابن عمر رضی اللہ تعالیٰ عنہ نے کہا : اگر خوف اس سے زیادہ ہو ( اور صف بندی ممکن نہ ہو ) تو سواری پر یا کھڑے کھڑے اشاارہ کرو اور نماز پڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 372
			}
		},
		{
			"hadithnumber": 1945,
			"arabicnumber": "840.01",
			"text": "عطاء نے حضرت جابر بن عبداللہ انصاری رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز خوف میں شریک ہوا ، آپ صلی اللہ علیہ وسلم نے ہماری دو صفیں بنائیں ، ایک صف رسول اللہ صلی اللہ علیہ وسلم کے پیچھے تھی ( اوردوسری ان کے پیچھے ) اور دشمن ہمارے اور قبلے کے درمیان تھا ، نبی اکرم صلی اللہ علیہ وسلم نے تکبیر ( تحریمہ ) کہی اور ہم سب نے بھی تکبیر کہی ، پھر آپ صلی اللہ علیہ وسلم نے رکوع کیا اور ہم سب نے رکوع کیا ، پھر آپ صلی اللہ علیہ وسلم نے رکوع سے اپنا سر اٹھایا اور ہم سب نے سراٹھایا ، پھر آپ صلی اللہ علیہ وسلم سجدے کے لئے جھک گئے اور آپ صلی اللہ علیہ وسلم سے متصل صف نے بھی سجدہ کیا اور پچھلی صف دشمن کے مد مقابل کھڑی رہی ، جب آپ صلی اللہ علیہ وسلم نے دو سجدے کے کرلیے ۔ اور آپ صلی اللہ علیہ وسلم سے متصل صف ( سجدے کرکے آپ صلی اللہ علیہ وسلم کے ساتھ ) کھڑی ہوگئی تو پچھلی صف سجدے کے لئے نیچے ہوئی اور پھر کھڑی ہوگئی ، اس کے بعد پچھلی صف آگے آگئی اور اگلی صف پیچھے چلی گئی ، پھر جب آپ صلی اللہ علیہ وسلم نے رکوع کیا تو ہم سب نے رکوع کیا ۔ پھر آپ نے رکوع سے اپنا سر اٹھایا اور ہم سب نے بھی سراٹھایا ، پھر آپ صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم سے متصل صف جو پہلی رکعت میں پیچھے تھی ، سجدے کے لئے نیچے چلی گئی اور پچھلی صف دشمن کے مقابلے میں کھڑی رہی ، جب نبی اکرم صلی اللہ علیہ وسلم اور آپ صلی اللہ علیہ وسلم سے متصل صف نے سجدہ کرلیا تو پچھلی صف سجدے کے لئے جھکی ۔ انھوں نے سجدے کیے ۔ پھر نبی اکرم صلی اللہ علیہ وسلم نے سلام پھیرا اور ہم سب نے بھی سلام پھیردیا ۔ حضرت جابر رضی اللہ تعالیٰ عنہ نے بتایا : جس طرح تمہارےمحافظ ( آجکل ) اپنے امیروں کی حفاظت کے لئے کرتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 373
			}
		},
		{
			"hadithnumber": 1946,
			"arabicnumber": "840.02",
			"text": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا؛ہم نے رسول اللہ صلی اللہ علیہ وسلم کی معیت میں جہینہ قبیلے کے لوگوں سے جنگ لڑی ، انھوں نے ہمارے ساتھ بڑی شدیدجنگ کی جب ہم نے ظہر کی نماز پڑھی تو مشرکوں نے کہا : اگر ہم ان پر یکبارگی حملہ کریں تو ان کو کاٹ کررکھ دیں ۔ جبرئیل علیہ السلام نے رسول اللہ صلی اللہ علیہ وسلم کو اس بات سے آگاہ کردیا اوررسول اللہ صلی اللہ علیہ وسلم نے ہمیں بتایا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : ان لوگوں نے کہا ہے کہ ابھی ان کی ایک ایسی نماز کا وقت آنےوالاہے جو ان کو ان کی اولاد سے بھی زیادہ پیاری ہے ۔ جب عصرکا وقت آیا ، آپ صلی اللہ علیہ وسلم نے ہماری دو صفیں بنائیں جبکہ مشرک ہمارے اور ہمارے قبیلے کے درمیان تھے ۔ کہا : تو رسول اللہ صلی اللہ علیہ وسلم نے تکبیر تحریمہ کہی اور ہم نے بھی تکبیر کہی ، آپ صلی اللہ علیہ وسلم نے رکوع کیا اور ہم نے بھی رکوع کیا ، پھرآپ صلی اللہ علیہ وسلم نے سجدہ کیا اورآپ صلی اللہ علیہ وسلم کے ساتھ پہلی صف نے بھی سجدہ کیا ۔ جب یہ حضرات کھڑے ہوگئے تو دوسر ی صف والوں نے سجدے کیے ، پھر پہلی صف پیچھے چلی گئی اور دوسری آگے بڑھ گئی اور پہلی صف کی جگہ کھڑی ہوگئی ۔ پھر رسول اللہ صلی اللہ علیہ وسلم نے تکبیر کہی اور ہم نے بھی تکبیرکہی اور آپ صلی اللہ علیہ وسلم نے رکوع کیا اور ہم نے بھی رکوع کیا ۔ پھر آپ صلی اللہ علیہ وسلم نے سجدہ کیا اور آپ صلی اللہ علیہ وسلم کے ساتھ ( موجودہ ) پہلی صف نے سجدہ کیا اور دوسری کھڑی رہی ۔ پھر جب دوسری صف نے سجدے کرلیے اور اس کے بعد سب بیٹھ گئے تو آپ صلی اللہ علیہ وسلم نے سب کے ساتھ سلام پھیرا ۔ ابو زبیر نے کہا : پھر حضرت جابر رضی اللہ تعالیٰ عنہ نے خصوصی طور پر فرمایا : جس طرح تمہارے یہ امیر نماز پڑھتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 374
			}
		},
		{
			"hadithnumber": 1947,
			"arabicnumber": "841",
			"text": "عبدالرحمان بن قاسم نے اپنے والد سے ، انھوں نے صالح بن خوات بن جبیرسے اور انھوں نے حضرت سہل بن ابی حثمہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے اپنے ساتھیوں کو نماز خوف پڑھائی اور انھیں اپنے پیچھے دو صفوں میں کھڑا کیا اور اپنے ساتھ ( کی صف ) والوں کوایک رکعت پڑھائی ۔ پھر آپ کھڑے ہوگئے اور کھڑے ہی رہے یہاں تک کہ ان سے پیچھے والوں نے ایک رکعت پڑھ لی ، پھر یہ آگے آگے اور جو ان سے آگے تھے پیچھے چلے گئے ۔ پھر آپ صلی اللہ علیہ وسلم نے انھیں ایک رکعت پڑھائی ۔ پھر آپ بیٹھ گئے حتیٰ کہ جو پیچھے چلے گئے تھے انھوں نے ( بھی ایک اور ) رکعت پڑھ لی ، پھر آپ صلی اللہ علیہ وسلم نے سلام پھیرا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 375
			}
		},
		{
			"hadithnumber": 1948,
			"arabicnumber": "842",
			"text": "یزید بن رومان نے صالح بن خوات سےاور انھوں نے اس شخص سے نقل کیا جس نے غزوہ ذات الرقاع میں رسول اللہ صلی اللہ علیہ وسلم کی معیت میں نمازخوف پڑھی تھی ۔ کہ ایک گروہ نے آپ صلی اللہ علیہ وسلم کے ساتھ صف بنائی اور دوسرا گروہ دشمن کے رو برو تھا ، آپ صلی اللہ علیہ وسلم نے اپنے ساتھ والوں کو ایک رکعت پڑھائی ، پھر آپ صلی اللہ علیہ وسلم کھڑے رہے اور انھوں نے اپنے طور پر ( دوسری رکعت پڑھ کر ) نماز مکمل کرلی اور ( سلام پھیر کر ) چلے گئے اور دشمن کے سامنے صف بند ہوگئے اور دوسرا گروہ آگیا ، آپ صلی اللہ علیہ وسلم نے جو رکعت رہتی تھی ۔ ان کو پڑھا دی پھر بیٹھے رہے اور ان لوگوں نے اپنے طور پر ( رکعت پڑھ کر ) نماز مکمل کرلی تو آپ صلی اللہ علیہ وسلم نے ان کے ساتھ سلام پھیرا ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 376
			}
		},
		{
			"hadithnumber": 1949,
			"arabicnumber": "843.01",
			"text": "۔ ابان بن یزید نے کہا : ہم سے یحییٰ ابن کثیر نے ابو سلمہ ( بن عبدالرحمان ) سے حدیث بیان کی اور انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ ( جہاد پر ) آئے ۔ حتیٰ کہ جب ہم ذات الرقاع ( نامی پہاڑ ) تک پہنچے ۔ کہا : ہماری عادت تھی کہ جب ہم کسی گھنے سائے والے درخت تک پہنچے تو اسے رسول اللہ صلی اللہ علیہ وسلم کے لئے چھوڑ دیتے ، کہا : ایک مشرک آیا جبکہ رسول اللہ صلی اللہ علیہ وسلم کی تلوار درخت پر لٹکی ہوئی تھی ، اس نے رسول اللہ صلی اللہ علیہ وسلم کی تلوارپکڑ لی ، اسے میان سے نکالا اور رسول اللہ صلی اللہ علیہ وسلم سے کہنے لگا : کیا آپ مجھ سے ڈ رتے ہیں؟آپ صلی اللہ علیہ وسلم نے فرمایا : \" نہیں ۔ \" اس نے کہا : تو پھر آپ کومجھ سے کون بچائے گا؟آپ صلی اللہ علیہ وسلم نےفرمایا : \" اللہ تعالیٰ مجھے تم سےمحفوظ فرمائے گا ۔ \" رسول اللہ صلی اللہ علیہ وسلم کے ساتھیوں نے اسے دھمکایا تو اس نے تلوار میان میں ڈال لی اور اسے لٹکایا ۔ اس کے بعد نماز کے لئے اذان کہی گئی ، آپ صلی اللہ علیہ وسلم نے ایک گروہ کو دو رکعت نماز پڑھائی ، پھر وہ گروہ پیچھے چلا گیااس کے بعد آپ صلی اللہ علیہ وسلم نے دوسرے گروہ کو دو رکعتیں پڑھائیں ۔ کہا اس طرح رسول اللہ صلی اللہ علیہ وسلم کی چار رکعتیں ہوئیں اور لوگوں کی دو دو رکعتیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 377
			}
		},
		{
			"hadithnumber": 1950,
			"arabicnumber": "843.02",
			"text": "معاویہ بن سلام نے کہا : مجھے یحییٰ ( بن ا بی کثیر ) نے خبردی ، انھوں نے کہا : مجھے ابو سلمہ بن عبدالرحمان نے خبر دی کہ انھیں جابر رضی اللہ تعالیٰ عنہ نے بتایا کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز خوف پڑھی ، رسول اللہ صلی اللہ علیہ وسلم نے ایک گروہ کودو رکعتیں پڑھائیں ، پھر دوسرے گروہ کو دو ر کعتیں پڑھائیں ، اس طرح رسول اللہ صلی اللہ علیہ وسلم نے چار ر کعتیں پڑھیں اور ہر گروہ کو دو دو رکعتیں پڑھائیں ۔",
			"grades": [],
			"reference": {
				"book": 6,
				"hadith": 378
			}
		}
	]
}