{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"7": "The Book of Prayer - Friday"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1951,
			"arabicnumber": "844.01",
			"text": "نافع نے حضرت عبداللہ ( بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نےکہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئےسنا : \" جب تم میں سے کوئی شخص جمعے کےلئے آنے کاارادہ کرے تو وہ غسل کرے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 1952,
			"arabicnumber": "844.02",
			"text": "لیث نے ابن شہاب سے ، انھوں نے عبداللہ بن عبداللہ بن عمیر سے ، انھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے روایت کی کہ آپ صلی اللہ علیہ وسلم نے منبر پر کھڑے ہوئے فرمایا : \" تم میں سے جو جمعے کے لئے آئے غسل کرے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 1953,
			"arabicnumber": "844.03",
			"text": "ابن جریج نے کہا : ابن شہاب نے عبداللہ بن عمر رضی اللہ تعالیٰ عنہ کے دونوں بیٹوں سالم اورعبداللہ سے خبر دی ، انھوں نے حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اس ( سابقہ حدیث ) کے مانندروایت کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 1954,
			"arabicnumber": "844.04",
			"text": "یونس نے ابن شہاب سے ، انھوں نے سالم بن عبداللہ سے اورانھوں نے اپنے والد سے روایت کی ، انھوں نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئےسنا ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 1955,
			"arabicnumber": "845.01",
			"text": "حضرت عبداللہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ جمعے کے دن لوگوں کوخطاب فرمارہےتھے ( کہ اسی اثناء میں ) رسول اللہ صلی اللہ علیہ وسلم کے صحابہ رضوان اللہ عنھم اجمعین میں سے ایک شخص داخل ہوا ، حضرت عمر رضی اللہ تعالیٰ عنہ نے انھیں آوازدی : ( آنےکی ) یہ کون سی گھڑی ہے؟انھوں نے کہا : میں آج مصروف ہوگیا ، گھر لوٹتے ہیں میں نے اذان سنی اور صرف وضو کیا ( اورحاضر ہوگیاہوں ) حضرت عمر رضی اللہ تعالیٰ عنہ نے کہا : اور وہ بھی ( صرف ) وضو؟حالانکہ آپ کو معلوم ہے کہ رسول اللہ صلی اللہ علیہ وسلم غسل کرنے کاحکم دیتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 1956,
			"arabicnumber": "845.02",
			"text": "حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : ( ایک بار ) حضرت عمر بن خطاب رضی اللہ تعالیٰ عنہ جمعے کے دن لوگوں کو خطبہ ارشادفرمارہے تھے کہ اسی دوران میں حضرت عثمان بن عفان رضی اللہ تعالیٰ عنہ مسجد میں داخل ہوئے ۔ حضرت عمر رضی اللہ تعالیٰ عنہ نے ان پر تعریف کی ( اعتراض کیا ) اور کہا : لوگوں کو کیا ہوا کہ اذان کےبعد دیر لگاتے ہیں؟حضرت عثمان رضی اللہ تعالیٰ عنہ نے کہا : اے امیر المومنین رضی اللہ تعالیٰ عنہ !میں نے اذان سننے پر اس سے زیادہ کچھ نہیں کیا کہ وضو کیا ہے اورحاضر ہوگیاہوں ، اس پر عمر رضی اللہ تعالیٰ عنہ نے کہا اور وہ بھی ( صرف ) وضو؟ کیا تم لوگوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے نہیں سنا : \" جب تم میں سے کوئی جمعے کے لئے آئے تو وہ غسل کرے؟",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 1957,
			"arabicnumber": "846.01",
			"text": "حضرت ابو سعید خدری رضی اللہ تعالیٰ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جمعے کے دن ہر بالغ شخص پر غسل کرنا واجب ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 1958,
			"arabicnumber": "847.01",
			"text": "عروہ بن زبیر نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : جمعے کے لیے لو گ اپنے گھروں سے اور عوالی سے باری باری آتے تھے وہ اونی عبائیں پہنے ہو تے تھے اور ( راستے میں ) ان پر گردو غبار بھی پڑتا تھا جس کی وجہ سے ان سے بو پھوٹتی تھی ان میں سے ایک انسان رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور اس وقت آپ صلی اللہ علیہ وسلم میرے ہاں تشریف فر ما تھے تو رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" کیا ہی اچھا ہو کہ تم لو گ اس دن کے لیے صاف ستھرے ہو جا یا کرو ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 1959,
			"arabicnumber": "847.02",
			"text": "عمرہ نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی ، انھوں نے کہا : لو گ کا م کا ج والے تھے ان کے نوکر چاکر نہ ہو تے تھے وہ ایسے تھے کہ ان سے بو آتی تھی تو ان سے کہا گیا : کیا ہی اچھا ہو کہ تم جمعے کے دن نہا لیا کرو ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 1960,
			"arabicnumber": "846.02",
			"text": "سعید بن ابی بلال اور بکیر بن اشج نے ابو بکر بن منکد ر سے حدیث بیان کی ، انھوں نے عمرو بن سلیم سے انھوں نے عبد الرحمٰن بن ابی سعید خدری رضی اللہ تعالیٰ عنہ سے اور انھوں نے اپنے والد ( حضڑت ابو سعید رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \"\" جمعے کے دن غسل کرنا ہر بالگ شخص پر واجب ہے اور مسواک کرنا بھی اور ( ہر شخص ) اپنی استطاعت کے مطا بق خوشبو استعمال کرے ۔ \"\" البتہ بکیر نے ( سند میں ) عبد الرحمان کا ذکر نہیں کیا اورخوشبوکے بارے میں کہا : \"\" چاہے وہ عورت کی خوشبو کیوں نہ ہو ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 1961,
			"arabicnumber": "848.01",
			"text": "روح بن عباوہ اور عبد الرزاق نے ابن جریج سے حدیث بیان کی انھوں نے کہا مجھے ابراہیم بن میسر ہ نے طاوس سے خبر دی اور انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے جمعے کے دن غسل کرنے کے بارے میں نبی صلی اللہ علیہ وسلم کا فر ما ن بیان کیا ۔ طاوس نے کہا : میں نے ابن عباس رضی اللہ تعالیٰ عنہ سے پو چھا : اگر اس کے گھر والوں کے پاس موجود ہو تو وہ خوشبو تیل بھی استعمال کر سکتا ہے ؟انھوں نے ( جواب میں ) کہا : میں یہ بات نہیں جا نتا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 1962,
			"arabicnumber": "848.02",
			"text": "محمد بن بکر اور ضحاک بن مخلددونوں نے بن جریج سے اسی سند کے ساتھ ( سابقہ ) حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 1963,
			"arabicnumber": "849",
			"text": "طاوس نے حضڑت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی آپ نے فر ما یا : ہر مسلمان پر اللہ تعا لیٰ کا حق ہے کہ وہ ہر سات دنوں میں ( کم سے کم ) ایک بار نہائے اپنا سر اور اپنا جسم دھوئے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 1964,
			"arabicnumber": "850.01",
			"text": "ابو صالح سمنان نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جس نے جمعے کے دن غسل جنابت ( جیسا غسل ) کیا پھر مسجد ) چلا گیا تو اس نے گو یا ایک اونٹ قربان کیا اور جودوسری گھڑی میں گیا تو گو یا اس نے گا ئے قربان کی اور جو تیسری گھڑی میں گیا گو یا اس نے سینگوں والا ایک مینڈھا قربان کیا اور جو چوتھی گھڑی میں گیا اس نے گو یا ایک مرغ اللہ کے تقرب کے لیے پیش کیا اور جو پانچویں گھڑی میں گیا اس نے گو یا ایک انڈا تقرب کے لیے پیش کیا اس کے بعد جب امام آجا تا ہے تو فرشتے ذکر ( عبادتاور امور خیر کی یاد دہانی ) سنتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 1965,
			"arabicnumber": "851.01",
			"text": "قتیبہ بن سعید اور محمد بن رمح بن مہاجر نے حدیث بیان کی ، ابن رمح نے کہا : ہمیں لیث نے عقیل بن خالد سے خبر دی انھوں نے بن شہاب سے روایت کی انھوں نے کہا مجھے سعید بن مسیب نے خبر دی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے انھیں بتایا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" جمعے کے دن جب امام خطبہ دے رہا ہو ( اس وقت ) اگر تم نے اپنے ساتھی سے کہا : خاموش رہو تو تم نے فضول گو ئی کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 1966,
			"arabicnumber": "851.02",
			"text": "عبد الملک بن شعیب بن لیث نے کہا : مجھ سے میرے والد شعیب نے میرے دادالیث سے حدیث بیان کی انھوں نے کہا : مجھ سے عقیل بن خالد نے ابن شہاب سے انھوں نے عمربن عبد العزیز سے انھوں نے عبد اللہ بن ابرا ہیم بن قارظ سے روایت کی نیز انھوں نے ( ابن شہاب زہری ) نے ابن مسیب سے بھی روا یت کی ان دو نوں ( عمربن عبد العزیز اور سعید بن مسیب ) نے ان ( بن شہاب سے حدیث بیان کی کہ حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو فر ما تے سنا ۔ ۔ ۔ ( آگے اسی سند حدیث ) کے مانند ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 1967,
			"arabicnumber": "851.03",
			"text": "ابن جریج نے کہا : ابن شہاب نے مجھے اس حدیث کی دونوں سندوں کے ساتھ اس حدیث میں اسی کے مانند خبردی البتہ ابن جریج نے ( عبد اللہ بن ابرا ہیم بن قارظ کے بجا ئے ) ابرا ہیم بن عبد اللہ بن قارظ کہا ہے ۔ ( امام مسلم نے نا م کی درستی کے لیے یہ سند بیان کی)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 1968,
			"arabicnumber": "851.04",
			"text": "ابو زناد نے عرج سے انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی آپ صلی اللہ علیہ وسلم نے فر ما یا : \"\" جمعے کے دن جب امام خطبہ دے رہا ہو ( اس وقت ) اگر تم نے اپنے ساتھی سے کہا : خا مو ش رہو تو تم نے ( خود ) شور مچا یا ۔ \"\" ابو زناد نے کہا : یہ ( فقد لغيت ) ابو ہریرہ رضی اللہ تعالیٰ عنہ ( کے قبیلے ) کی لغت ہے جبکہ ( عام مروج لغت ) ( فقد لغوت ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 1969,
			"arabicnumber": "852.01",
			"text": "یحییٰ بن یحییٰ اور قتیبہ بن سعید نے مالک بن انس انھوں نے ابو زناد سے انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعے کا ذکر کرتے ہو ئے فر ما یا : \"\" اس میں ایک گھڑی ہے اس ( گھڑی ) کی موافقت کرتے ہو ئے کو ئی مسلمان بندہ نماز پڑھتے ہو ئے اللہ تعا لیٰ سے جو کچھ بھی مانگتا ہے اللہ تعا لیٰ اسے عطا کر دیتا ہے ۔ قتیبہ نے اپنی روایت میں اضافہ کیا : آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ سے اشارا فر ما کر اس گھڑی کے قلیل ہو نے کو واضح کیا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 1970,
			"arabicnumber": "852.02",
			"text": "ایوب نے محمد سے انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : ابو القاسم صلی اللہ علیہ وسلم نے فر ما یا : \" بیشک جمعے کے دن میں ایک گھڑی ہے کوئی مسلمان بھی کھڑا نماز پڑھتے ہو ئے اس کی موافقت کر لیتا ( اسے پالیتا ) ہے ( اور ) اللہ تعا لیٰ سے کسی خیر کا سوال کرتا ہے تو اللہ تعا لیٰ اسے وہی ( خیر ) عطا کر دیتا ہے ۔ اور آپ صلی اللہ علیہ وسلم نے ہا تھ سے اس کے قلیل اور کم ہو نے کو بیان کیا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 1971,
			"arabicnumber": "852.03",
			"text": "ابن عون نے محمد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا ابو القاسم صلی اللہ علیہ وسلم نے فر ما یا ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے ما نند ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 1972,
			"arabicnumber": "852.04",
			"text": "سلمہ بن علقمہ نے محمد سے اورانھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا : ابو القاسم صلی اللہ علیہ وسلم نے فر ما یا ۔ ۔ ۔ ( آگے ) اسی ( سابقہ حدیث ) کے مانند ہے",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 1973,
			"arabicnumber": "852.05",
			"text": "محمد بن زیاد نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ۔ آپ نے فر ما یا \" جمعے کے دن میں ایک گھڑی ایسی ہے کہ کو ئی مسلمان اللہ تعا لیٰ سے کسی خیر کا سوال کرتے ہو ئے اس کی موافقت نہیں کرتا مگر اللہ تعا لیٰ اسے وہی خیر عطا کر دیتا ہے \" فر ما یا یہ ایک چھوٹی سی گھڑی ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 1974,
			"arabicnumber": "852.06",
			"text": "ہمام بن منبہ نے حضڑت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی صلی اللہ علیہ وسلم سے روایت کی لیکن انھوں نے ( وهي ساعة خفيفة ) ( وہ ایک چھوٹی سی گھڑی ہے ) نہیں کہا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 1975,
			"arabicnumber": "853",
			"text": "ابو بردہ بن ابی مو سیٰ اشعری رضی اللہ تعالیٰ عنہ سے روا یت ہے کہا : مجھ سے حضرت عبد اللہ بن عمر رضی اللہ تعالیٰ عنہ نے کہا : کیا تم نے اپنے والد کو جمعے کی گھڑی کے بارے میں رسول اللہ صلی اللہ علیہ وسلم سے حدیث بیان کرتے ہو ئے سنا ہے ؟کہ کہا : میں نے کہا : جی ہاں میں نے انھیں یہ کہتے سنا ہے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ فر ما رہے تھے : \" یہ امام کے بیٹھنے سے لے کر نماز مکمل ہو نے تک ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 1976,
			"arabicnumber": "854.01",
			"text": "ابن شہاب نے کہا : مجھے عبد الرحمٰن اعرج نے خبر دی انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ کو کہتے سنا کہ رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" بہترین دن جس پر سورج طلوع ہو تا ہے جمعے کا دن ہے اسی دن آدم ؑپیدا کیے گئے اور اسی دن جنت میں داخل کیے گئے اور اسی دن اس سے نکا لے گئے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 1977,
			"arabicnumber": "854.02",
			"text": "ابو زناد نے اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے رو یت کی کہ نبی کریم صلی اللہ علیہ وسلم نے فر ما یا : بہترین دن جس میں سورج نکلتا ہے جمعے کا ہے اسی دن آدم ؑکو پیدا کیا گیا تھا اور اسی دن انھیں جنت میں داخل کیا گیا اور اسی میں انھیں اس سے نکا لا گیا ( خلا فت ارضی سونپی گئی ) اور قیامت بھی جمعے کے دن ہی بر پاہو گی ۔ \" صالح مومنوں کے لیے یہ انعام عظیم حا صل کرنے کا دن ہو گا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 1978,
			"arabicnumber": "855.01",
			"text": "عمر و ناقد نے کہا : ہمیں سفیان بن عیینہ نے ابو زناد سے حدیث سنا ئی انھوں نے اعرج سے اور انھوں نے حجرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم سب سے آخری ہیں اور قیامت کے دن سب سے پہلے ہو ں گے یہ اس کے باوجود ہے کہ ہر امت کو کتاب ہم سے پہلے دی گئی اور ہمیں ( ہماری کتاب ) ان کے بعد دی گئی پھر یہ دن جسے اللہ تعالیٰ نے ہمارے لئے لکھ دیا تھا اللہ تعا لیٰ نے اس کے لیے ہماری رہنما ئی فر ما ئی لو گ اس معاملے میں ہمارے بعد ہیں یہود کل ( جمعے سے اگلا دن یعنی ہفتہ منا ئیں گے ) اور نصاریٰ پرسوں ( ہفتےسے اگلا دن اتوار کا منا ئیں گے ۔)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 1979,
			"arabicnumber": "855.02",
			"text": "ابن ابی عمر نے کہا : ہمیں سفیان نے ابو زناد سے حدیث سنا ئی انھوں نے اعرج سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روا یت کی نیز ( سفیان نے عبد اللہ ) بن طاوس سے انھوں نے اپنے والد ( طاوس بن کیسان ) سے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم سب کے بعد آنے والے ہیں اور قیامت کے دن ہم سب سے پہلے ہو ں گے ۔ ۔ ۔ \" اسی ( مذکورہ با لا حدیث ) کے مانند ہے",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 1980,
			"arabicnumber": "855.03",
			"text": "ابو صالح نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : \" ہم آخری ہیں ( پھر بھی ) قیامت کے دن پہلے ہو ں گے اور ہم ہی پہلے جنت میں داخل ہوں گے البتہ انھیں ( انکی ) کتاب ہم سب سے پہلے دی گئی اور ہمیں ( ہماری کتاب ) ان کے بعد دی گئی انھوں نے ( آپس میں ) اختلا ف کیا اور اللہ تعا لیٰ نے ہماری اس حق کی طرف رہنما ئی فر ما ئی جس میں انھوں نے اختلا ف کیا تھا یہ ( جمعہ ) ان کا وہی دن تھا جس کے بارے میں انھوں نے اختلا ف کیا اللہ تعا لیٰ نے ہمیں اس کی طرف رہنما ئی کردی ۔ ۔ ۔ راوی نے کہا : جمعے کا دن مرادہے ۔ ۔ آج کا دن ہمارا ہے اور کل کا دن یہودیوں کا ہے اس سے اگلا دن عیسائیوں کا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 1981,
			"arabicnumber": "855.04",
			"text": "وہب بن منبہ کے بھا ئی ہمام بن منبہ نے کہا : یہ حدیث ہے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے ہمیں محمد رسول اللہ صلی اللہ علیہ وسلم سے بیان کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فر ما یا : ہم آخری ہیں ( مگر ) قیامت کے دن سبقت لے جا نے والے ہو ں گے اس کے باوجود کہ ان کے بعد دی گئی اور یہ ( جمعہ ) ان کا وہی دن ہے جو ان پر فرض کیا گیا تھا اور وہ اس کے بارے میں اختلاف میں پڑگئے پھر اللہ تعا لیٰ نے اس کے بارے میں ہماری رہنمائی فر ما ئی اس لیے وہ لو گ اس ( عبادت کے دن کے ) معاملے میں ہم سے پیچھے ہیں یہود ( اپنا دن ) کل منا ئیں گے اور عیسا ئی پر سوں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 1982,
			"arabicnumber": "856.01",
			"text": "ابو کریب اور واصل بن عبدالاعلیٰ نے کہا : ہم سے ابن فضیل نے ابومالک اشجعی ( سعد بن طارق ) سے حدیث بیان کی ، انھوں نے ابو حازم سے اورانھوں نے ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، نیز انھوں ( ابو مالک ) نے ربعی بن حراش سے اور انھوں نے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے روایت کی ، ان دونوں ( صحابیوں ) نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" جو لوگ ہم سے پہلے تھے اللہ تعالیٰ نے انھیں جمعہ کی راہ سے ہٹادیا ، اس لئے یہود کے لئے ہفتے کا دن ہوگیا اور نصاریٰ کے لئے اتوار کا دن ۔ پھراللہ تعالیٰ نے ہمیں ( اس دنیا میں لایا ) اور جمعے کے دن کی طرف ہماری راہنمائی فرمادی ۔ اس نے جمعہ پھر ہفتہ پھر اتوار رکھا ( جس طرح وہ عبادت کے دنوں میں ہم سے پیچھے ہیں ) اسی طرح قیامت کے دن بھی ہم سے پیچھے ہوں گے ۔ اہل دنیا میں سے ہم سب کے بعد ہیں اور قیامت کےدن سب سے پہلے ہوں گے ۔ جن کا فیصلہ ( باقی ) مخلوقات سے پہلے کردیا جائے گا ۔ \"\" واصل کی روایت میں ( المقضي لهم کی جگہ ) المقضي بينهم ( جن کے درمیان فیصلہ ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 1983,
			"arabicnumber": "856.02",
			"text": "ابن ابی زائدہ نے ( ابومالک ) سعد بن طارق سے خبر دی ، انھوں نے کہا : ربعی بن حراش نے مجھے حضرت حذیفہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نےکہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" ہماری راہنمائی جمعے کی طرف کی گئی اور جو لوگ ہم سے پہلے تھے ان کو اللہ تعالیٰ نے ا س سےدوسری راہ پر لگادیا ۔ ۔ ۔ \" آگے ابن فضیل کے ہم معنی حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 1984,
			"arabicnumber": "850.02",
			"text": "ابوعبداللہ اغر نے خبر دی کہ انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : رسول اللہ صلی اللہ علیہ وسلم نے فرمایاجب جمعے کا دن ہوتا ہے تو مسجد کے دروازوں میں سے ہر دروازے پر فرشتے ہوتے ہیں جو ( آنے والوں کی ترتیب کے مطابق ( پہلے پھر پہلے کا نام لکھتے ہیں ، اور جب امام ( منبر پر ) بیٹھ جاتا ہے تو وہ ( ناموں والے ) صحیفے لپیٹ دیتے ہیں اورآکرذکر ( خطبہ ) سنتے ہیں ۔ اور گرمی میں ( پہلے ) آنے والے کی مثال اس انسان جیسی ہے جو اونٹ قربان کرتا ہےپھر ( جو آیا ) گویا وہ گائے قربان کردیتا ہے ۔ پھر ( جو آیا ) گویا وہ مینڈھا قربان کردیتاہے ، پھر ( جو آیا ) گویا وہ تقرب کے لئے مرغی پیش کرتاہے پھر ( جو آیا ) گویا وہ تقریب کے لئے انڈا پیش کرتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 1985,
			"arabicnumber": "850.03",
			"text": "سعید ( بن مسیب ) نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے اسی ( سابقہ حدیث ) کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 1986,
			"arabicnumber": "850.04",
			"text": "سہیل کے والد ابو صالح سمان نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" مسجد کے دروازوں میں سے ہر ایک دروازے پر ایک فرشتہ ہوتاہے جو پہلے پھر پہلے آنے والے کا نام لکھتا ہے ۔ آپ نے اونٹ کی قربانی کی مثال دی ، پھر بتدریج کم کرتے گئے یہاں تک کہ ( آخر میں ) انڈے جیسے چھوٹے ( صدقے ) کی مثال دی ۔ پھر جب امام منبر پر بیٹھ جاتا ہے تو ( اندراج کے ) صحیفے لپیٹ دیئے جاتے ہیں اور ( فرشتے ) ذکر ونصیحت ( سننے ) کے لئے حاضر ہوجاتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 1987,
			"arabicnumber": "857.01",
			"text": "سہیل نے اپنے والد ( ابو صالح ) سے ، انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے روایت کہ آپ نے فرمایا : \" جس نے غسل کیا ، پھر جمعے کے لئے حاضر ہوا ، پھر اس کے مقدر میں جتنی ( نفل ) نماز تھی پڑھی ، پھر خاموشی سے ( خطبہ ) سنتا رہا حتیٰ کہ خطیب اپنے خطبے سے فارغ ہوگیا ، پھر اس کے ساتھ نماز پڑھی ، اس کے اس جمعے سے لے کر ایک اور ( پچھلے یا اگلے ) جمعے تک کے گناہ بخش دیے جاتے ہیں اور مزید تین دنوں کے بھی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 1988,
			"arabicnumber": "857.02",
			"text": "اعمش نے ابو صالح سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جس شخص نے وضو کیا اوراچھی طرح وضو کیا ، پھر جمعے کے لئے آیا ، غور کے ساتھ خاموشی سے خطبہ سنا ، اس کے جمعے سے لے کر جمعے تک گناہ معاف کردئیے جاتے ہیں ۔ اورتین دن زائد کے بھی ۔ اور جو ( بلاوجہ ) کنکریوں کو ہاتھ لگاتا رہا ( ان سے کھیلتا رہا ) ، اس نے لغو اورفضول کام کیا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 1989,
			"arabicnumber": "858.01",
			"text": "حسن بن عیاش نے جعفر بن محمد سے ، انھوں نے اپنے والد ( محمد ) سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتے تھے ، پھر واپس آتے ، پھر اپنے پانی لانے والے اونٹوں کو آرام کا وقت دیتے ، حسن نےکہا : میں نے جعفر سے کہا : یہ ( نماز ) کس وقت ہوتی؟انھوں نے کہا : سورج کے ڈھلنے کے وقت ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 1990,
			"arabicnumber": "858.02",
			"text": "قاسم بن زکریا نے کہا : ہمیں خالد بن مخلد نے حدیث بیان کی ، نیز عبداللہ بن عبدالرحمان دارمی نے کہا : ہمیں یحییٰ بن حسان نے حدیث بیان کی ، ان دونوں ( خالد اوریحییٰ ) نے کہا : ہمیں سلیمان بن بلال نے جعفر سےحدیث بیا ن کی ، انھوں نےاپنے والد ( محمد ) سے روایت کی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے پوچھا : رسول اللہ صلی اللہ علیہ وسلم کس وقت جمعہ پڑھتے تھے؟انھوں نے کہا : آپ جمعہ پڑھاتے ، پھر ہم اونٹوں کے پاس جاتے ، پھر انہیں آرام کا وقت دیتے ۔ عبداللہ نے اپنی روایت میں یہ اضافہ کیا : جس وقت سورج ڈھل جاتا ۔ ( جمال سے مراد ) تواضح ، یعنی پانی لانے والے اونٹ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 1991,
			"arabicnumber": "859",
			"text": "عبداللہ بن مسلمہ بن قعنب ، یحییٰ بن یحییٰ اور علی بن حجر میں سے یحییٰ نے کہا : ہمیں خبر دی اور دوسرے دونوں نے کہا : ہم سے حدیث بیا ن کی عبدالعزیز بن ابی حازم نے اپنے والد ابوحازم سے ، انھوں نے حضرت سہیل رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم جمعہ کے بعد ہی قیلولہ کرتے اور کھانا کھاتے تھے ۔ ( علی ) ابن حجر نے اضافہ کیا : رسول اللہ صلی اللہ علیہ وسلم کے عہد مبارک میں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 1992,
			"arabicnumber": "860.01",
			"text": "وکیع نے یعلیٰ بن حارث محاربی سے روایت کی ، انھوں نے ایاس بن سلمہ بن اکوع سے اور انھوں نے اپنے والد ( حضرت سلمہ بن اکوع رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نے کہا : جب سورج ڈھلتا ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے ، پھر ہم سایہ تلاش کرتے ہوئے لوٹتے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 1993,
			"arabicnumber": "860.02",
			"text": "ہشام بن عبدالملک نے یعلیٰ بن حارث سے باقی ماندہ اسی سند کے ساتھ روایت کی ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ جمعہ پڑھتے پھر لوٹتے تو ہمیں دیواروں کا اتنا بھی سایہ نہ ملتا کہ ہم ( سورج سے ) اس کی اوٹ لے سکیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 1994,
			"arabicnumber": "861",
			"text": "حضرت ابن عمر رضی اللہ تعالیٰ عنہ سے روایت ہے انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن کھڑے ہوکر خطبہ ارشاد فرماتے ، پھر ( تھوڑی دیر ) بیٹھ جاتے ، پھر کھڑے ہوجاتے ۔ کہا : جس طرح آجکل ( خطبہ دینے والے ) کرتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 1995,
			"arabicnumber": "862.01",
			"text": "ابو احوص نے سماک سے اور انھوں نے حضرت جابر بن سمرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : نبی کریم صلی اللہ علیہ وسلم کے دو خطبے ہوتے تھے جن کے درمیان آپ بیٹھتے تھے ۔ آپ قرآن پڑھتے اور لوگوں کو نصیحت اور تذکیر فرماتے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 1996,
			"arabicnumber": "862.02",
			"text": "ابو خثیمہ نے سماک سے روایت کی ، انھوں نے کہا : حضرت جابر بن سمرۃ رضی اللہ تعالیٰ عنہ نے مجھے خبر دی کہ رسول اللہ صلی اللہ علیہ وسلم کھڑے ہوکر خطبہ دیتے تھے ، پھر بیٹھ جاتے ، پھر کھڑے ہوتے اور کھڑے ہوکر خطبہ دیتے ، اس لئے جس نے تمھیں یہ بتایا کہ آپ بیٹھ کر خطبہ دیتے تھے ، اس نے جھوٹ بولا ۔ اللہ کی قسم! میں نے آپ کے ساتھ دو ہزار سے زائد نمازیں پڑھی ہیں ۔ ( جن میں بہت سے جمعے بھی آئے اور آپ صلی اللہ علیہ وسلم نے تمام خطبے کھڑے ہوکر دیے ۔)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 1997,
			"arabicnumber": "863.01",
			"text": "جریر نے حصین بن عبدالرحمان سے روایت کی ، انھوں نے سالم بن ابی جعد سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی کریم صلی اللہ علیہ وسلم جمعے کےی دن کھڑے ہوکر خطبہ دے رہے تھے کہ شام سے ایک تجارتی قافلہ آگیا ، لوگوں نے اس کا رخ کرلیا حتیٰ کہ پیچھے بارہ آدمیوں کے سوا کوئی نہ بچا تویہ آیت نازل کی گئی جو سورہ جمعہ میں ہے : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں اور آپ کو کھڑا چھوڑ جاتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 1998,
			"arabicnumber": "863.02",
			"text": "عبداللہ بن ادریس نے حصین سے اسی سند کے ساتھ روایت کی ، کہا : ( جب تجارتی قافلہ آیاتو ) رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے ۔ یہ نہیں کہا : کھڑے ہوئے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 1999,
			"arabicnumber": "863.03",
			"text": "خالد طحان نے حصین سے روایت کی ، انھوں نے سالم اور ابو سفیان سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہم جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم کے ساتھ تھے کہ ایک چھوٹا سا بازار ( سامان بیچنے والوں کا قافلہ ) آگیا تو لوگ اس کی طرف نکل گئے اور ( صرف ) بارہ آدمیوں کے سوا کوئی نہ بچا ، میں بھی ان میں تھا ، کہا : اس پر اللہ تعالیٰ نے یہ آیت اتاری : \" اور جب وہ تجارت یاکوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں اور آ پ کو کھڑا چھوڑ دیتے ہیں \" آیت کے آخر تک ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2000,
			"arabicnumber": "863.04",
			"text": "ہشیم نے کہا : ہمیں حصین نے ابو سفیان اور سالم بن ابی جعد سے خبر دی ، انھوں نے حضرت جابربن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے بیان کیا ، ایک بار جب نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن کھڑے ہوئے ( خطبہ دے رہے ) تھے کہ ایک تجارتی قافلہ مدینہ آگیا ، رسول اللہ صلی اللہ علیہ وسلم کے ساتھی اس کی طرف لپک پڑے حتیٰ کہ آپ کے ساتھ بارہ آدمیوں کے سوا کوئی نہ بچا ۔ ان میں ابو بکر اور عمر رضی اللہ تعالیٰ عنہ بھی موجود تھے ۔ کہا : تو ( اس پر ) یہ آیت اتری : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو اس کی طرف ٹوٹ پڑتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2001,
			"arabicnumber": "864",
			"text": "حضرت کعب بن عجرہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ وہ مسجد میں آئے ، دیکھاکہ ( اموی والی ) عبدالرحمان بن ام حکیم بیٹھ کر خطبہ دے رہا ہے ، انھوں نے فرمایا : اس خبیث کودیکھو ، بیٹھ کر خطبہ دے رہا ہے ، جبکہ اللہ تعالیٰ کا فرمان ہے : \" اور جب وہ تجارت یا کوئی مشغلہ دیکھتے ہیں تو ادھر ٹوٹ پڑتے ہیں اور آپ کوکھڑا چھوڑ جاتے ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2002,
			"arabicnumber": "865",
			"text": "حکم بن مینا ء نے حدیث بیان کی کہا : حضرت عبد اللہ بن عمر اور حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ نے انھیں حدیث بیان کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ اپنے منبر کی لکڑیوں پر ( کھڑے ہو ئے ) فر ما رہے تھے \" لو گوں کے گروہ ہر صورت جمعہ چھوڑ دینے سے باز آجا ئیں یا اللہ تعا لیٰ ان کے دلوں پر مہر لگا دے گا پھر وہ غا فلوں میں سے ہو جا ئیں گے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2003,
			"arabicnumber": "866.01",
			"text": "ابوا حوص نے سما ک بن حرب سے اور انھوں نے حضرت جا بربن سمرہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : میں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نماز پڑھتا تھا آپ کی نماز ( طوالت میں ) متوسط ہو تی تھی اور آپ کا خطبہ بھی متوسط ہو تا تھا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2004,
			"arabicnumber": "866.02",
			"text": "ابو بکر بن ابی شیبہ اور ابن نمیر نے کہا : ہمیں محمد بن بشر نے حدیث بیان کی ، ہمیں زکریا نے حدیث بیان کی کہا : مجھ سے سماک بن حرب نے حضرت جا بر بن سمرہ رضی اللہ تعالیٰ عنہ سے حدیث بیان کی ، انھوں نے کہا : میں نماز یں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ پڑھتا تھا تو آپ کی نماز در میانی ہو تی تھی اور آپ کا خطبہ بھی درمیانہ ہو تا تھا ابو بکر بن ابی شیبہ کی روا یت میں ( زکریا نے کہا : ( حدثني سماك بن حرب ) \" مجھے سماک بن حرب نے حدیث بیان کی \" کے بجائے ) زكريا نےمجھے سماک سے روایت کی \" کے الفا ظ ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2005,
			"arabicnumber": "867.01",
			"text": "عبد الوہاب بن عبد المجید ( ثقفی ) نے جعفر ( صادق ) بن محمد ( باقر ) سے روایت کی انھوں نے اپنے والد سے اور انھوں نے حضرت جابر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم جب خطبہ دیتے تو آپ کی آنکھیں سرخ ہو جا تیں ، آواز بلند ہو جا تی اور جلال کی کیفیت طاری ہو جا تی تھی حتیٰ کہ ایسا لگتا جیسے آپ کسی لشکر سے ڈرا رہے ہیں فر ما رہے ہیں کہ وہ ( لشکر ) صبح یا شام ( تک ) تمھیں آلے گا اور فر ما تے \" میں اور قیامت اس طرح بھیجے گئے ہیں \" اور آپ اپنی انگشت شہادت اور درمیانی انگلی کو ملا کر دکھا تے اور فر ما تے ۔ \" ( حمدو صلاۃ ) کے بعد بلا شبہ بہترین حدیث ( کلام ) اللہ کی کتاب ہے اور زندگی کا بہترین طریقہ محمد صلی اللہ علیہ وسلم کا طریقہ زندگی ہے اور ( دین میں ) بد ترین کا وہ ہیں جو خود نکا لے گئے ہوں اور ہر نیا نکا لا ہوا کا م گمراہی ہے پھر فر ما تے : \" میں ہر مو من کے ساتھ خود اس کی نسبت زیادہ محبت اور شفقت رکھنے والا ہوں جو کو ئی ( مومن اپنے بعد ) مال چھوڑ گیا تو وہ اس کے اہل و عیال ( وارثوں ) کا ہے اور جو مومن قرض یا بے سہارا اہل و عیال چھوڑ گیا تو ( اس قرض کو ) میری طرف لو ٹا یا جا ئے ( اور اس کے کنبے کی پرورش ) میرے ذمے ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2006,
			"arabicnumber": "867.02",
			"text": "سلیمان بن بلال نے کہا : مجھ سے جعفر بن محمد نے اپنے نے اپنے والد سے روایت کی انھوں نے کہا : میں نے حضرت جا بر بن عبد اللہ رضی اللہ تعالیٰ عنہ سے سنا وہ کہتے تھے جمعے کے دن نبی اکرم صلی اللہ علیہ وسلم کا خطبہ اس طرح ہوتا تھاکہ آپ اللہ تعا لیٰ کی حمد و ثناء بیان کرتے پھر اس کے بعد آپ ( اپنی بات ارشاد فر ما تے اور آپ کی اواز بہت بلند ہو تی ۔ ۔ ۔ پھر اس ( سابقہ حدیث ) کے مانند حدیث بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2007,
			"arabicnumber": "867.03",
			"text": "سفیان نے جعفر سے انھوں نے اپنے والد ( محمد باقر ) سے اور انھوں نے حضرت جا بر رضی اللہ تعالیٰ عنہ سے روایت کی انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم لو گوں کو ( اس طرح ) خطبہ دیتے پہلے اللہ کی شان کے مطابق اس کی حمد و ثنا ء بیان کرتے پھر فر ما تے ۔ \" جسے اللہ سیدھی راہ پر چلا ئے اسے کو ئی گمراہ نہیں کر سکتا اور جسے وہ سیدھی راہ سے ہٹا دے اسے کو ئی ہدایت نہیں دے سکتا اور بہترین بات ( حدیث ) اللہ کی کتاب ہے ۔ ۔ ۔ \" آگے ( عبد الوہاب بن عبد المجید ) ثقفی کی حدیث ( 2005 ) کے ما نند ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2008,
			"arabicnumber": "868",
			"text": "حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت ہے کہ ضمادمکہ آیا ، وہ ( قبیلہ ) از دشنوء سے تھا اور آسیب کا دم کیا کرتا تھا ( جسے لوگ ریح کہتے تھے ، یعنی ایسی ہوا جو نظرنہیں آتی ، اثر کرتی ہے ) اس نے مکہ کے بے وقوفوں کو یہ کہتے سنا کہ محمد ( صلی اللہ علیہ وسلم ) کو جنون ہوگیا ہے ( نعوذ باللہ ) اس نے کہا : اگر میں اس آدمی کو دیکھ لوں تو شاید اللہ تعالیٰ اسے میرے ہاتھوں شفا بخش دے ۔ کہا : وہ آپ سے ملا اور کہنے لگا : اے محمد صلی اللہ علیہ وسلم !میں اس نظر نہ آنے والی بیماری ( ریح ) کو زائل کرنے کے لئے دم کرتا ہوں اور اللہ تعالیٰ جسے چاہتا ہے میرے ہاتھوں شفا بخشتا ہے تو آپ کیا چاہتے ہیں ( کہ میں دم کروں؟ ) رسول اللہ صلی اللہ علیہ وسلم نے ( جواب میں ) کہا : \" ان الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل فلا هادي له واشهد ان لا اله الا الله وحده لا شريك له وان محمدا عبده ورسوله اما بعد \" یقیناً تمام حمد اللہ کے لیے ہے ، ہم اسی کی حمد کرتے ہیں اور اسی سے مدد مانگتے ہیں ، جس کو اللہ سیدھی راہ پرچلائے ، اسے کوئی گمراہ نہیں کرسکتا اور جسے وہ گمراہ چھوڑ دے ، اسے کوئی راہ راست پر نہیں لاسکتا اور میں گواہی دیتا ہوں کہ اللہ کے سواکوئی سچا معبود نہیں ، وہی اکیلا ( معبود ) ہے ، ا س کا کوئی شریک نہیں اور بلاشبہ محمد ( صلی اللہ علیہ وسلم ) اس کا بندہ اور اس کا رسول ہے ، اس کے بعد! \" کہا : وہ بول اٹھا : اپنے یہ کلمات مجھے دوبارہ سنائیں ۔ رسول اللہ صلی اللہ علیہ وسلم نے تین مرتبہ یہ کلمات اس کے سامنے دہرائے ۔ اس پر اس نے کہا : میں نے کاہنوں ، جادوگروں اور شاعروں ( سب ) کے قول سنے ہیں ، میں نے آپ کے ان کلمات جیسا کوئی کلمہ ( کبھی ) نہیں سنا ، یہ تو بحر ( بلاغت ) کہ تہ تک پہنچ گئے ہیں اور کہنے لگا : ہاتھ بڑھایئے!میں آپ کے ساتھ اسلام پر بیعت کرتا ہوں ۔ کہا : تو اس نے آپ کی بیعت کرلی ۔ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" اور تیری ( طرف سے تیری ) قوم ( کے اسلام ) پر بھی ( تیری بیعت لیتاہوں ) \" اس نے کہا : اپنی قوم ( کے اسلام ) پر بھی ( بیعت کرتاہوں ) اس کے بعد آپ نے ایک سریہ ( چھوٹا لشکر ) بھیجا ، وہ ان کی قوم کے پاس سے گزرے تو امیر لشکر نے لشکر سے پوچھا : کیا تم نے ان لوگوں سے کوئی چیز لی ہے؟تو لوگوں میں سے ایک شخص نے کہا : میں نے ان سے ایک لوٹا لیا ہے اس نے کہا : اسے واپس کردو کیونکہ یہ ( کوئی اور نہیں بلکہ ) ضماد رضی اللہ تعالیٰ عنہ کی قوم ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2009,
			"arabicnumber": "869",
			"text": "ابو وائل نے کہا : ہمارے سامنے حضرت عمار رضی اللہ تعالیٰ عنہ نے خطبہ دیا ۔ انتہائی مختصر اورانتہائی بلیغ ( بات کی ) جب وہ منبر سے اترے تو ہم نے کہا : ابویقظان! آپ نے انتہائی پر تاثیر اور انتہائی مختصر خطبہ دیاہے ، کاش! آپ سانس کچھ لمبی کرلیتے ( زیادہ دیر بات کرلیتے ) انھوں نے فرمایا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے : \" انسان کی نماز کا طویل ہونا اوراس کے خطبے کاچھوٹا ہونا اس کی سمجھداری کی علامت ہے ، اس لئے نماز لمبی کرو اور خطبہ چھوٹا دو ، اوراس میں کوئی شبہ نہیں کہ کوئی بیان جادو ( کی طرح ) ہوتا ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2010,
			"arabicnumber": "870",
			"text": "ابو بکر بن ابی شیبہ اور محمد بن عبداللہ بن نمیر نے کہا : ہمیں وکیع نے سفیان سے حدیث بیان کی ، انھوں نے عبدالعزیز بن رفیع سے ، انھوں نے تمیم بن طرفہ سے اور انھوں نے حضرت عدی بن حاتم رضی اللہ تعالیٰ عنہ سے روایت کی کہ ایک شخص نے رسول اللہ صلی اللہ علیہ وسلم کے سامنے خطبہ دیا اور ( اس میں ) کہا : جو اللہ اور اس کے رسو ل کی اطاعت کرتاہے اس نے رشدوہدایت پالی اور جو ان دونوں کی نافرمانی کرتاہے وہ بھٹک گیا ۔ اس پر رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \"\" تو بُرا خطیب ہے ، ( فقرے کے پہلے حصے کی طرح ) یوں کہو ، جس نے اللہ کی اور اس کے ر سول کی نافرمانی کی ( وہ گمراہ ہوا ۔ ) \"\" ابن نمیر کی ر وایت میں غوي ( واہ کے نیچے زیر ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2011,
			"arabicnumber": "871",
			"text": "صفوان کے والد حضرت یعلیٰ بن امیہ رضی اللہ تعالیٰ عنہ سے روایت ہے کہ انھوں نے نبی کریم صلی اللہ علیہ وسلم سے سنا ، آپ منبر پر پڑھ رہے تھے : وَنَادَوْا يَا مَالِكُ \" اور وہ پکاریں گے : اے مالک! \" ( الزخرف 77 : 43)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2012,
			"arabicnumber": "872.01",
			"text": "سلیمان بن بلال نے یحییٰ بن سعید سے روایت کی ، انھوں نے عمرہ بنت عبدالرحمان ( بن سعد بن زرارہ انصاریہ ) سے ، انھوں نے کہا : ( ماں کی طرف سے ) اپنی بہن کی طرف سے روایت کی ، انھوں نے کہا : میں نے سورہ ق ۚ وَالْقُرْ‌آنِ الْمَجِيدِ جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم کی زبان مبارک سے سن کریاد کی ۔ آپ اسے ہر جمعے منبر پر پڑھ کر سنایا ( اور سمجھایا ) کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2013,
			"arabicnumber": "872.02",
			"text": "یحییٰ بن ایوب نے یحییٰ بن سعید سے ، انھوں نے عمرہ سے اور انھوں نے اپنی بہن سے جو عمر میں ان سے بڑی تھیں ، روایت کی ۔ ۔ ۔ سلیمان بن بلال کی حدیث کے مانند ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2014,
			"arabicnumber": "873.01",
			"text": "عبداللہ بن محمد بن معن نے حارثہ بن نعمان کی بیٹی ( ام ہشام ) سے روایت کی ، انھوں نے کہا : میں نے سورہ ق ( کسی اور سے نہیں براہ راست ) رسول اللہ صلی اللہ علیہ وسلم کی زبان سے سن کر یاد کی ، آپ ہر جمعے میں اسےپڑھ کر خطاب فرماتے تھے ۔ انھوں نے کہا : ہمارا اور رسول اللہ صلی اللہ علیہ وسلم کا تندور ایک ہی تھا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2015,
			"arabicnumber": "873.02",
			"text": "یحییٰ بن عبداللہ بن عبدالرحمان بن سعد نے زرارہ نے ام ہشام بنت حارثہ بن نعمان رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : ہمارا اور رسول اللہ صلی اللہ علیہ وسلم کا تندور دو یا ایک سال سے کچھ زیادہ عرصہ ایک ہی رہا اور میں نے سورہ ق ۚ وَالْقُرْ‌آنِ الْمَجِيدِ ( کسی اور سے نہیں بلکہ ) رسول اللہ صلی اللہ علیہ وسلم کی زبان سے سن کر یاد کی ، آپ ہر جمعے کے دن جب لوگوں کو خطبہ دیتے تو اسے منبر پر پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2016,
			"arabicnumber": "873.03",
			"text": "عبداللہ بن ادریس نے حصین سے اور انھوں نے حضرت عمارہ بن رویبہ ( ثقفی ) رضی اللہ تعالیٰ عنہ سے روایت کی ، کہا : انھوں نے بشر بن مروان ( بن حکم ، عامل مدینہ ) کو منبر پر ( تقریر کے دوران ) دونوں ہاتھ بلند کرتے دیکھا تو کہا : اللہ تعالیٰ ان دونوں ہاتھوں کو بگاڑے ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو دیکھا کہ آپ اپنے ہاتھ سے اس سےزیادہ اشارہ نہیں کرتے تھے اور اپنی انگشت شہادت سے اشارہ کیا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2017,
			"arabicnumber": "874",
			"text": "ابو عوانہ نے حصین بن عبدالرحمان سے روایت کی ، انھوں نے کہا : میں نے جمعے کے دن بشر بن مروان کو دونوں ہاتھ اٹھاتے ہوئے دیکھا تو اس پر عمارہ بن رویبہ رضی اللہ تعالیٰ عنہ نے کہا ۔ ۔ ۔ اس کے بعد اس ( مذکورہ بالا روایت ) کے ہم معنی روایت بیان کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2018,
			"arabicnumber": "875.01",
			"text": "حماد بن زید نے عمرو بن دینار سے اور انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : اسی اثناء میں جب جمعے کے دن رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے ایک آدمی ( مسجد میں ) آیا تو نبی کریم صلی اللہ علیہ وسلم نے اس سے پوچھا : \" اے فلاں ( نام لیا ) !کیا تو نے نماز پڑھ لی ہے؟ \" اس نے کہا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اور اٹھو اور نماز پڑھو ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2019,
			"arabicnumber": "875.02",
			"text": "ایوب نے عمرو ( بن دینار ) سے ، انھوں نے حضرت جابر رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم سے حماد کی طرح روایت کی ، اور انھوں ( ایوب ) نے بھی اس میں دو رکعت کا ذکر نہیں کیا ( البتہ اگلی روایت میں سفیان نے کیا ہے ۔)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2020,
			"arabicnumber": "875.03",
			"text": "قتیبہ بن سعید اور اسحاق بن ابراہیم میں سے قتیبہ نے کہا : ہمیں حدیث سنائی اور اسحاق نے کہا : ہمیں خبر دی سفیان نے عمرو سے ، انھوں نے جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سےسنا ، وہ کہہ رہے تھے : ایک آدمی مسجد میں داخل ہوا جب رسول اللہ صلی اللہ علیہ وسلم جمعے کے دن خطبہ دےرہے تھے ۔ تو آپ نے پوچھا : \" کیا تم نے نماز پڑھ لی؟ \" اس نے کہا : نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا : \" اٹھو اور دو رکعتیں پڑھ لو ۔ \" قتیبہ کی حدیث میں ( فصل ركعتين کے بجائے ) صل ركعتين ( دو رکعتیں پڑھو ) ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2021,
			"arabicnumber": "875.04",
			"text": "ابن جریج نے کہا : ہمیں عمرو بن دینار نے خبر دی کہ انھوں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا ، وہ کہہ رہے تھے : ایک آدمی آیا جب کہ نبی اکرم صلی اللہ علیہ وسلم منبر پر تھے ، جمعے کے دن خطبہ ارشاد فرمارہے تھے تو آپ نے اس سے پوچھا : \" کیا تم نے دو رکعتیں پڑھ لی ہیں؟ \" اس نے کہا : نہیں ۔ آپ نے فرمایا : \" پڑھ لو ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2022,
			"arabicnumber": "875.05",
			"text": "شعبہ نے عمرو ( بن دینار ) سے روایت کی ، انھوں نے کہا : میں نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے سنا کہ نبی اکرم صلی اللہ علیہ وسلم نے خطبے میں فرمایا : \" جب تم میں سے کوئی شخص جمعے کے دن آئے جبکہ امام ( گھر سے ) نکل ( کر ) آچکا ہے تو وہ دو رکعت پڑھ لے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2023,
			"arabicnumber": "875.06",
			"text": "ابو زبیر نے حضرت جابر رضی اللہ تعالیٰ عنہ سے روایت کی کہ سلیک غطفانی رضی اللہ تعالیٰ عنہ جمعے کے دن آئے جبکہ رسول اللہ صلی اللہ علیہ وسلم منبر پر بیٹھے ہوئے تھے تو سلیک نماز پڑھنے سے پہلے ہی بیٹھ گئے ۔ رسول اللہ صلی اللہ علیہ وسلم نے ان سے کہا : \" کیا تم نے دو رکعتیں پڑھ لی ہیں؟ \" انھوں نے کہا : نہیں ۔ آپ نے فرمایا : \" اٹھو اور دو ر کعتیں پڑھو ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2024,
			"arabicnumber": "875.07",
			"text": "ابو سفیان ( طلحہ بن نافع واسطی ) نے حضرت جابر بن عبداللہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نےکہا : سلیک غطفانی رضی اللہ تعالیٰ عنہ جمعے کے دن ( اس وقت ) آئے جب رسول اللہ صلی اللہ علیہ وسلم خطبہ دے رہے تھے تو وہ بیٹھ گئے ۔ آپ نے ان سے کہا : \" اے سلیک!ا ٹھ کر دو رکعتیں پڑھو اور ان میں سے اختصار برتو ۔ \" اس کے بعد آپ صلی اللہ علیہ وسلم نے فرمایا! \" جب تم میں سے کوئی جمعے کےدن آئے جبکہ امام خطبہ دے رہا ہو تو وہ دو رکعتیں پڑھے اور ان میں اختصار کرے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2025,
			"arabicnumber": "876",
			"text": "حضرت ابو رفاعہ ( تمیم بن اُسید عدوی رضی اللہ تعالیٰ عنہ ) نے کہا کہ میں نبی صلی اللہ علیہ وسلم کے پاس ( اس وقت ) پہنچا جبکہ آپ خطبہ دے رہے تھے ، میں نے عرض کی : اے اللہ کے رسول صلی اللہ علیہ وسلم !ایک پردیسی آدمی ہے اپنے دین کے بارے میں پوچھنے آیا ہے اسے معلوم نہیں کہ ا س کادین کیا ہے کہا : تو رسول اللہ صلی اللہ علیہ وسلم میری طرف متوجہ ہوئے اور اپنا خطبہ چھوڑا ، یہاں تک کہ میرے پاس پہنچ گئے ۔ ایک کرسی لائی گئی میرے خیال میں اس کے پائے لوہے کے تھے ، کہا : تو رسول اللہ صلی اللہ علیہ وسلم اس پر بیٹھ گئے اور اللہ تعالیٰ نے جو کچھ آپ کو سکھایا تھا اس میں سے مجھے سکھانے لگے پھر اپنے خطبے کے لئے بڑھے اور اس کا آخری حصہ مکمل فرمایا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2026,
			"arabicnumber": "877.01",
			"text": "سلیمان جو ہلال ( تمیمی ) کے بیٹے ہیں ، انھوں نے جعفر ( صادق ) سے ، انھوں نے اپنے والد سے اور انھوں نے ابو رافع ( مولیٰ رسول اللہ صلی اللہ علیہ وسلم کے بیٹے عبیداللہ ) سے ر وایت کی ، انھوں نے کہا : مروان نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ کو مدینہ میں اپنا جانشین مقرر کیا اور خود مکہ چلا گیا ۔ حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے ہمیں جمعے کی نماز پڑھائی اور ( پہلی رکعت میں ) سورہ جمعہ پڑھنے کے بعد دوسری رکعت میں إِذَا جَاءَكَ الْمُنَافِقُونَ پڑھی اور کہا : جب ابو ہریرۃ رضی اللہ تعالیٰ عنہ جمعے کی نماز سے فارغ ہوئے تو میں ان کے پاس جاپہنچا اور ان سے کہا : آپ نے وہ دو سورتیں پڑھی ہیں جو علی ابن طالب رضی اللہ تعالیٰ عنہ کوفہ میں پڑھا کرتے تھے ۔ ابو ہریرۃ رضی اللہ تعالیٰ عنہ نے کہا : میں نے رسول اللہ صلی اللہ علیہ وسلم کو جمعے کے دن یہ سورتیں پڑھتے ہوئے سنا ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2027,
			"arabicnumber": "877.02",
			"text": "حاتم بن اسماعیل اور عبدالعزیز دراوردی دونوں نے ( اپنی اپنی سندکے ساتھ ) جعفر سے روایت کی ، انھوں نے اپنے والد سے اور انھوں نے عبیداللہ بن ابی رافع سے روایت کی ، انھوں نے کہا : مروان رضی اللہ تعالیٰ عنہ نے حضرت ابوہریرہ رضی اللہ تعالیٰ عنہ کو قائم مقام گورنر بنایا ۔ ۔ ۔ آگے اسی کے مانندہے ، سوائے اس کے کہ حاتم کی روایت ( ان الفاظ ) میں ہے : انھوں نے پہلی رکعت میں سورہ جمعہ پڑھی اور دوسری رکعت میں إِذَا جَاءَكَ الْمُنَافِقُونَ ۔ عبدالعزیز کی روایت سلیمان بن بلال کی ( سابقہ ) ر وایت کی طرح ہے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2028,
			"arabicnumber": "878.01",
			"text": "(جریر نے ابراہیم بن محمد بن منتشر سے ، انھوں نے اپنے والد سے ، انھوں نے حضرت نعمان بن بشیر کے آزاد کردہ غلام حبیب بن سالم سے اور انھوں نے حضرت نعمان بن بشیر رضی اللہ تعالیٰ عنہ سےروایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم عیدین اور جمعے میں سَبِّحِ اسْمَ رَ‌بِّكَ الْأَعْلَى اور ) هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ پڑھتے ۔ کہا : اور اگر عید اور جمعہ ایک ہی دن اکھٹے ہوجاتے تو آپ یہی دو سورتیں دونوں نمازوں میں پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2029,
			"arabicnumber": "878.02",
			"text": "ابو عوانہ نے ابراہیم بن محمد بن منتشر سے اسی سند کے ساتھ ( اسی کے مانند ) ر وایت کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2030,
			"arabicnumber": "878.03",
			"text": "عبیداللہ بن عبداللہ نے کہا : ضحاک بن قیس نے حضرت نعمان بن بشیر رضی اللہ تعالیٰ عنہ کوخط لکھ کر پوچھا کہ رسول اللہ صلی اللہ علیہ وسلم نے جمعے کے دن سورہ جمعہ کے علاوہ ( اور ) کون سی سورت پڑھی؟انھوں نے جواب دیا : آپ صلی اللہ علیہ وسلم هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ پڑھا کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2031,
			"arabicnumber": "879.01",
			"text": "عبدہ بن سلیمان نے سفیان سے روایت کی ، انھوں نے مخول بن راشد سے ، انھوں نے مسلم البطین سے ، انہوں نے سعید بن جبیر سے اورانھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن فجر کی نماز میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ السجدہ اور هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ‌ پڑھتے تھے ۔ آپ صلی اللہ علیہ وسلم جمعے کی نماز میں سورہ جمعہ اورسورہ منافقون پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2032,
			"arabicnumber": "879.02",
			"text": "عبداللہ بن نمیر اور وکیع دونوں نے سفیان سے اسی سند کے ساتھ اسی ( سابقہ حدیث ) کے مانند روایت کی ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2033,
			"arabicnumber": "879.03",
			"text": "شعبہ نے مخول سے اسی سندکے ساتھ دونوں نمازوں کے بارے میں اسی ( سابقہ حدیث ) کے مانند روایت کی جس طرح سفیان نے ( اپنی روایت میں ) کہا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2034,
			"arabicnumber": "880.01",
			"text": "سفیان نے سعد بن ابراہیم سے ، انہوں نے عبدالرحمان اعرج سے ، انھوں نے ابوہریرۃ رضی اللہ تعالیٰ عنہ سے اور انھوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی کہ آپ جمعے کے دن فجر کی نماز میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ اور هَلْ أَتَىٰ عَلَى الْإِنسَانِ پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2035,
			"arabicnumber": "880.02",
			"text": "۔ ابراہیم بن سعد نے اپنے والد ( سعد بن ابراہیم ) سے ، انھوں نے عبدالرحمان اعرج سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم جمعے کے دن صبح کی نماز کی پہلی رکعت میں الم ﴿﴾ تَنزِيلُ الْكِتَابِ اور دوسری رکعت میں هَلْ أَتَىٰ عَلَى الْإِنسَانِ حِينٌ مِّنَ الدَّهْرِ‌لَمْ يَكُن شَيْئًا مَّذْكُورً‌ا پڑھتے تھے ۔ ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2036,
			"arabicnumber": "881.01",
			"text": "۔ خالد بن عبداللہ نے سہیل سے ، انھوں نے اپنے والد ( ابوصالح ) سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم میں سے کوئی جمعہ پڑھ چکے تو اس کے بعد چار رکعتیں پڑھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2037,
			"arabicnumber": "881.02",
			"text": "ابوبکر بن ابی شیبہ اور عمرو الناقد نے کہا : ہمیں عبداللہ بن ادریس نے سہیل سے حدیث سنائی ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرہ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نے فرمایا : \" جب تم جمعے کے بعد نماز پڑھو تو چار رکعتیں پڑھو \" عمرو نے اپنی روایت میں اضافہ کیا ، ابن ادریس نے کہا سہیل نے کہا : اگر تمھیں کسی چیز کی وجہ سے جلدی ہو تو دو رکعتیں مسجد میں پڑھ لو اور دو رکعتیں و اپس جا کر ( گھر میں ) پڑ ھ لو ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2038,
			"arabicnumber": "881.03",
			"text": "جریر اور سفیان نے سہیل سے ، انھوں نے اپنے والد سے اور انھوں نے حضرت ابو ہریرۃ رضی اللہ تعالیٰ عنہ سے روایت کی ، انھوں نے کہا : رسول اللہ صلی اللہ علیہ وسلم نےفرمایا : \"\" تم میں سے جو شخص جمعے کے بعد نماز پڑھے توچار رکعتیں پڑھے ۔ \"\" جریر کی حدیث میں \"\" منكم \"\" ( تم میں سے ) کے الفاظ نہیں ہیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2039,
			"arabicnumber": "882.01",
			"text": "لیث نے نافع سے اورانھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ جب وہ جمعہ پڑھ لیتے تو واپس جاتے اور اپنے گھر میں دو ر رکعتیں پڑھتے ۔ پھر انھوں ( ابن عمر رضی اللہ تعالیٰ عنہ ) نے بتایا کہ رسول اللہ صلی اللہ علیہ وسلم ایسا ہی کرتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2040,
			"arabicnumber": "882.02",
			"text": "یحییٰ بن یحییٰ نے کہا : میں نے امام مالکؒ پر ( حدیث کی ) قراءت کی ، انھوں نے نافع سے اورانھوں نے حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ سے روایت کی کہ انھوں نے رسول اللہ صلی اللہ علیہ وسلم کی نفل نماز کو بیان کیا اورکہا کہ آپ جمعے کے بعد کوئی ( نفل ) نماز نہ پڑھے حتیٰ کہ واپس تشریف لے جاتے پھر ا پنے گھر میں د و رکعتیں پڑھتے تھے ۔ یحییٰ بن یحییٰ نے کہا : میرا خیال ہے کہ میں نے ( امام مالکؒ کے سامنے ) \" فيصلي \" پڑھا تھا یا یقین ہے ( کہ یہی پڑھاتھا)",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2041,
			"arabicnumber": "882.03",
			"text": "سالم نے اپنے والد ( حضرت عبداللہ بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی کہ نبی اکرم صلی اللہ علیہ وسلم جمعے کےبعددو ر کعتیں پڑھتے تھے ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2042,
			"arabicnumber": "883.01",
			"text": "غندر نے ابن جریج سے روایت کی ، انھوں نے کہا : مجھے عمر بن عطاء بن ابی خوار نے بتایا کہ نافع بن جبیر نے انھیں نمر کے بھانجے سائب کے پاس بھیجے ان سے اس چیز کے بارے میں پوچھنے کے لئے جو حضرت معاویہ رضی اللہ تعالیٰ عنہ نے ان کی نماز میں دیکھی تھی ۔ سائب نے کہا : ہاں ، میں نے مقصورہ ( مسجد کے حجرے ) میں ان کے ساتھ جمعہ پڑھا تھا ۔ اور جب امام نے سلام پھیرا تو میں اپنی جگہ پر کھڑا ہوگیا اور نماز پڑھی ۔ جب معاویہ رضی اللہ تعالیٰ عنہ اندرداخل ہوئے تو مجھے بلوایا اور کہا : جو کام تم نے کیا ہے آئندہ نہ کرنا ۔ جب تم جمعہ پڑھ لو تو اسے کسی دوسری نماز سے نہ ملانا یہاں تک کہ گفتگو کرلو یا اس جگہ سے نکل جاؤ کیونکہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں اس بات کا حکم دیاتھا کہ ہم کسی نماز کو دوسری نماز سے نہ ملائیں حتیٰ کہ ہم گفتگو کرلیں یا ( اس جگہ سے ) نکل جائیں ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2043,
			"arabicnumber": "883.02",
			"text": "حجاج بن محمد نے کہا : ابن جریج نے کہا : مجھے عمر بن عطاء نے بتایا کہ نافع بن جبیر نے انھیں نمر کے بھانجے سائب بن یزید کے پاس بھیجا ۔ ۔ ۔ آگے سابقہ حدیث کے کی مانند بیان کیا ۔ مگر ( اس روایت میں ) یہ ہے کہ سائب نے کہا : جب انھوں نے سلام پھیرا تو میں اپنی جگہ کھڑا ہوگیا ۔ انھوں نے ( سلام پھیرا کہا ) امام کا ذکر نہیں کیا ۔",
			"grades": [],
			"reference": {
				"book": 7,
				"hadith": 93
			}
		}
	]
}