{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"3": "The Book of Menstruation and Istihadah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 348,
			"arabicnumber": 348,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 349,
			"arabicnumber": 349,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: görmeye başladığınız zaman namazı bırakın bitince gusledin.) (Buhârî, Hayz: 9; İbn Mâce, Tahara: 115)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 350,
			"arabicnumber": 350,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 351,
			"arabicnumber": 351,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Ümmü Habibe binti Cahş, Rasûlüllah (sallallahü aleyhi ve sellem)’den fetva isteyerek şöyle dedi: Allah’ın Rasûlü! Benden hayız günlerim dışında kan geliyor ne yapmalıyım?) Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: damardan gelen bir kandır guslet ve namazlarını kıl.) Bundan sonra Ümmü Habibe her namaz için yıkanırdı. (Buhârî, Hayz: 26; Tirmizî, Tahara: 96)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 353,
			"arabicnumber": 353,
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 354,
			"arabicnumber": 354,
			"text": "Ümmü Seleme (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: kadın, Peygamber (sallallahü aleyhi ve sellem)’e: devamlı kan geliyor ve temizlenemiyorum, namazları bırakayım mı?) diye sormuştu da; Rasûlüllah (sallallahü aleyhi ve sellem) ona şöyle buyurmuştu: namazları bırakma fakat hayız gördüğün gün ve geceler miktarınca namazı bırak sonra guslet, kan gelecek yerleri sıkıca bağla ve namazlarını kıl.) (İbn Mâce, Tahara: 116; Müslim, Hayz: 14)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 355,
			"arabicnumber": 355,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 356,
			"arabicnumber": 356,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre; Abdurrahman b. Avf’ın karısı Ümmü Habibe binti Cahş’tan özür kanı geliyordu ve hiç temizlenemiyordu. Bu durum, Rasûlüllah (sallallahü aleyhi ve sellem)’e arz edildi. O da şöyle buyurdu: kan hayız kanı değildir. Rahimden gelen birikmiş bir kandır. Normal zamanlardaki hayız günlerini saysın o kadar gün namazlarını terk etsin sonraki günlerde ise her namaz için gusletsin.) (Buhârî, Hayz: 27; Tirmizî, Tahara: 96)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 357,
			"arabicnumber": 357,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, Cahş’ın kızı yedi yıl boyunca kendisinden kan gelmişti. Rasûlüllah (sallallahü aleyhi ve sellem)’e durumu sordu da Peygamber (sallallahü aleyhi ve sellem): hayız kanı değildir damardan gelen bir kandır. Hayız süresi kadar günlerde namazı terk etmesini sonra gusletmesini ve her namaz için gusletmesini emretti.) (Buhârî, Hayz: 27; Tirmizî, Tahara: 96)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 358,
			"arabicnumber": 358,
			"text": "Urve (radıyallahü anh)’den rivâyete göre, Fatıma binti ebi Hubeyş’in haber verdiğine göre, kendisi: Rasûlüllah (sallallahü aleyhi ve sellem)’e kendisinden devamlı kan geldiğinden şikayet etti. Rasûlüllah (sallallahü aleyhi ve sellem) de ona: damardan gelen bir kandır. Hayız süresi kadar bekle namaz kılma, temizlik süresi gelince gusül abdesti al sonra temizlik ve hayız süreleri arasında namazlarını kıl.) (Buhârî, Hayz: 27; Tirmizî, Tahara: 96)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 359,
			"arabicnumber": 359,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Fatıma binti ebi Hubeyş, Rasûlüllah (sallallahü aleyhi ve sellem)’e geldi ve şöyle dedi: kan gelen ve asla temizlenemeyen bir kadınım, bu durumda namazları terk edebilir miyim?) Rasûlüllah (sallallahü aleyhi ve sellem) ise:“O damardan gelen bir kandır hayız kanı değildir. Hayız günün başladığında namazını bırak hayız bitip kan kesilince namazlarını kıl.) (Buhârî, Hayz: 27; Tirmizî, Tahara: 96)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 360,
			"arabicnumber": 360,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, Rasûlüllah (sallallahü aleyhi ve sellem) zamanında devamlı kan gelen bir kadına; Peygamber (sallallahü aleyhi ve sellem) şöyle dedi: damardan devamlı akan bir kandır, böylece öğle namazını geciktirip ikindiyle birlikte bir gusül abdestiyle kılmasını, akşam namazını geciktirip yatsıyla beraber yine tek gusül abdestiyle kılmasını, sabah namazı için de tek gusül yaparak kılmasını emretti.) (Buhârî, Hayz: 27; Tirmizî, Tahara: 96)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 361,
			"arabicnumber": 361,
			"text": "Zeyneb binti cahş (radıyallahü anh) tan rivâyete göre, şöyle demiştir: Peygamber (sallallahü aleyhi ve sellem)’e: özür kanı geliyor ne yapmalıyım?) dedim şöyle buyurdular: günlerinde namazlarını terkedip oturursun sonra gusleder öğleyi geciktirip ikindiyle birlikte kılarsın. Sonra tekrar gusleder akşam namazını geciktirip yatsıyla beraber kılarsın. Sabah namazını ise tek bir gusülle kılarsın.) (Tirmizî, Tahara: 96)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 362,
			"arabicnumber": 362,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 363,
			"arabicnumber": 363,
			"text": "Fatıma binti ebi Hubeyş (radıyallahü anha)’den özür kanı geliyordu. Rasûlüllah (sallallahü aleyhi ve sellem) ona: kanı bilindiği gibi siyahımsı bir kandır, o süre içinde namaz kılmayı bırak. O günler dışında gelen kan özür kanı olup o günlerde abdest alarak namaz kılabilirsin.) (İbn Mâce, Tahara: 115; Buhârî, Hayz: 21)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 364,
			"arabicnumber": 364,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Fatıma binti ebi Hubeyş’ten özür kanı gelmekteydi, bu durumu Rasûlüllah (sallallahü aleyhi ve sellem)’e sormuştu da Rasûlüllah (sallallahü aleyhi ve sellem) şöyle cevap vermişti: damardan gelen bir kandır hayız kanı değildir. Hayız günlerinde namazı bırak hayız bitince gusledip kanı yıkayın ve namazınızı kılın çünkü o gelen kan hayız kanı olmayıp damardan gelen bir kandır.) Rasûlüllah (sallallahü aleyhi ve sellem)’e: mı?) denildi. Cevaben buyurdular ki: hiç şüphe yok.) (İbn Mâce, Tahara: 115; Buhârî, Hayz: 21)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 365,
			"arabicnumber": 365,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "-"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 366,
			"arabicnumber": 366,
			"text": "Yine Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Fatıma binti ebi Hubeyş, Rasûlüllah (sallallahü aleyhi ve sellem)’e gelerek: devamlı kan geliyor namazları bırakabilir miyim?) dedi. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem) şöyle buyurdu: kan damardan gelen bir kandır hayız kanı değildir. Hayzın başladığında namaz kılmayı bırak bittiğinde ise guslet, kanı temizle ve namazını kıl.) (İbn Mâce, Tahara: 115; Buhârî, Hayz: 21)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 367,
			"arabicnumber": 367,
			"text": "Yine Âişe (radıyallahü anha)’dan aktarıldığına göre, Fatıma binti ebi Hubeyş şöyle demiştir: Allah’ın Rasûlü! Ben hiç temizlenemiyorum bu yüzden namazlarımı terk edebilir miyim?) dedi. Rasûlüllah (sallallahü aleyhi ve sellem)’de şöyle buyurdu: damardan gelen bir kandır. Namazlarını bırakma.) Hadisin Ravisi Halid hocama okuduğum hadiste şu ilave vardı: hayız kanı değildir, hayzın başladığında namazı bırak bittiğinde ise yıkan ve kanı temizleyerek namazını kıl.) (İbn Mâce, Tahara: 115; Buhârî, Hayz: 21)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 368,
			"arabicnumber": 368,
			"text": "Muhammed (radıyallahü anh)’ten rivâyete göre, şöyle demiştir: Ümmü Atıyye şöyle demiştir: hayız kanı dışında sarı ve bulanık akıntı diye bir şey bilmezdik.) (Buhârî, Hayz: 21; Dârimi, Tahara: 94)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 369,
			"arabicnumber": 369,
			"text": "Enes (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Yahudiler hayız gören kadınlarla birlikte yiyip içmezler ve evlerinde bile birlikte olmazlardı. Bu durumu Rasûlüllah (sallallahü aleyhi ve sellem)’e sordular da, bunun üzerine Allah, Bakara sûresi 222. ayetini indirdi. (Sana kadınların ay halleri hakkında soruyorlar. De ki: O bir sıkıntı, kirlilik, ve rahatsızlık halidir. Bu yüzden ay hali sırasında kadınların kadınlıklarından yararlanmayın, uzak durun ve onlar temizleninceye kadar kendileriyle cinsel ilişkide bulunmayın. Temizlendiklerinde ise Allah’ın buyurduğu şekilde onlara yaklaşın. Doğrusu Allah, pişmanlıkla kendisine yönelenleri ve tertemiz olanları sever.) Sonra, Rasûlüllah (sallallahü aleyhi ve sellem); Müslümanların hayız gören hanımlarıyla yiyip içmelerini ve evlerde birlikte kalmalarını ve cinsel ilişki dışında her şeyi yapmalarını emretti. Bunun üzerine Yahudiler: Rasûlü, bize aykırı davranmadık hiçbir şey bırakmadı) dediler. b. Hudayr ve Abbad b. Bişr, kalkıp bunu Rasûlüllah (sallallahü aleyhi ve sellem)’e bildirdiler ve: günlerinde hanımlarımızla cinsel ilişkide bulunacak mıyız?) dediler. Rasûlüllah (sallallahü aleyhi ve sellem), bu söz üzerine bir anda değişti, öyle ki kızdığını zannettik. Useyd b. hudayr ve Abbad b. Bişr kalkıp gittiler. Bu arada Rasûlüllah (sallallahü aleyhi ve sellem)’e hediye olarak süt getirilmişti. Onların arkasından adam gönderip çağırdı ve onlara süt içirdi. Böylece Rasûlüllah (sallallahü aleyhi ve sellem)’in onlara kızmadığı anlaşılmış oldu. (Buhârî, Hayz: 1; Müslim, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 370,
			"arabicnumber": 370,
			"text": "İbn Abbâs (radıyallahü anh)’den rivâyete göre: Hayız günlerinde hanımıyla cinsel ilişki kuran kimseye, Rasûlüllah (sallallahü aleyhi ve sellem): veya yarım dinar tasadduk etsin) buyurdu. (Tirmizî, Tahara: 103; Ebû Dâvûd, Tahara: 106)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 371,
			"arabicnumber": 371,
			"text": "Ümmü Seleme (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte yatıyordum, aybaşı oldum yavaşça Rasûlüllah (sallallahü aleyhi ve sellem)’in yanından ayrılıp hayız elbisemi giydim. Rasûlüllah (sallallahü aleyhi ve sellem): (Aybaşı mı) oldun?) buyurdu. Ben de: dedim. Beni çağırdı ve bir yatakta birlikte yattık. (Buhârî, Hayz: 22; Müslim, Hayz: 2)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 372,
			"arabicnumber": 372,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle diyor: Ben ve Rasûlüllah (sallallahü aleyhi ve sellem), hayızlı günlerimde birlikte bir yatakta yatardık. Benden kendisine bir şey bulaşırsa sadece bulaşan yeri yıkar ve öylece namazlarını kılardı. Sonra yatağına döner ve yine benden bir şeyler bulaşırsa aynı şekilde sadece bulaşan yeri yıkar ve öylece sabah namazını kılardı. (Müslim, Hayz: 3; İbn Mâce, Tahara: 125)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 373,
			"arabicnumber": 373,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), biz hanımlarından biri hayız gördüğünde hayız elbisesini giymesini emreder ve onunla birlikte bir yatakta yatardı. (Müslim, Hayz: 3; Tirmizî, Tahara: 99)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 374,
			"arabicnumber": 374,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Bizden biri hayız olduğu zaman Rasûlüllah (sallallahü aleyhi ve sellem), hayız elbisesini giymesini emreder sonra da onunla birlikte yatardı. (Müslim, Hayz: 3; İbn Mâce, Tahara: 99)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 375,
			"arabicnumber": 375,
			"text": "Cümey’ b. Umeyr (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Annem ve teyzemle birlikte Âişe’nin yanına girdik. Annem ve teyzem; Âişe’ye: Sizden biriniz hayız olduğunda Rasûlüllah (sallallahü aleyhi ve sellem) ne yapardı diye sordular o da dedi ki: biri hayz olduğunda Rasûlüllah (sallallahü aleyhi ve sellem), özel hayz elbisesi giymemizi emreder ve bizi kollarına alıp göğsüne basardı.) (Müslim, Hayz: 3; İbn Mâce, Tahara: 99)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 376,
			"arabicnumber": 376,
			"text": "Meymune (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem), hayız gören hanımlarıyla uylukları ve dizlerinin yarısına kadar örten bir elbise olduğu halde onlarla bir yatakta yatar ve beraber olurdu. (Buhârî, Hayz: 6; Müslim, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 377,
			"arabicnumber": 377,
			"text": "Şureyh (radıyallahü anh), babasından naklederek şöyle diyor: Âişe’ye: gören kadın kocası ile yemek yiyebilir mi?) diye sordum: Âişe (radıyallahü anha): Rasûlüllah (sallallahü aleyhi ve sellem) beni çağırır, hayızlı olduğum halde Onunla yemek yerdim. Et parçasını alır bana verir bende ondan ısırırdım sonra sofraya bırakırdım Rasûlüllah (sallallahü aleyhi ve sellem), o et parçasını alır benim ısırdığım yerden yerdi. İçecek bir şeyler ister, bana verir o içmeden ben içerdim ve kabı bırakırdım. Rasûlüllah (sallallahü aleyhi ve sellem) de o kabı alır benim içtiğim ve ağzıma aldığım yerden içerdi.) (Müslim, Hayz: 3; İbn Mâce, Tahara: 125)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 378,
			"arabicnumber": 378,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: sallallahü aleyhi ve sellem), hayızlı olduğum zamanlarda bile benim içtiğim kabın ağzıma aldığım yerinden içerdi ve benim artığımı da içerdi, hayızlı olduğum halde!) (İbn Mâce, Tahara: 125; Müslim, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 379,
			"arabicnumber": 379,
			"text": "Mıkdam b. Şüreyh (radıyallahü anh), babasından naklediyor ve diyor ki: Âişe’den işittim şöyle diyordu: hayızlı olduğum zamanlarda Rasûlüllah (sallallahü aleyhi ve sellem) bana bir kapla içecek getirir bende ondan içerdim, kabı kendisine verince benim içtiğim bölgeyi araştırır O da oradan içerdi.) (İbn Mâce, Tahara: 125; Müslim, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 380,
			"arabicnumber": 380,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: olduğum günlerde su içtiğim kabı Rasûlüllah (sallallahü aleyhi ve sellem)’e verirdim o da benim içtiğim yerden içerdi. Yine hayızlı iken yediğim et parçasını sofraya bırakınca o eti alır, benim ısırdığım yerden yerdi.) (İbn Mâce, Tahara: 115; Müslim, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 381,
			"arabicnumber": 381,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 382,
			"arabicnumber": 382,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 383,
			"arabicnumber": 383,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 384,
			"arabicnumber": 384,
			"text": "Ebû Hüreyre (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ile birlikte Mescidde idik, Rasûlüllah (sallallahü aleyhi ve sellem): Âişe elbisemi getir) demişti. Âişe’de: kılmıyorum yani hayızlıyım) demişti. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): elinde değil ya, getir) buyurdular. (Ebû Dâvûd, Tahara: 104; Müslim, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 385,
			"arabicnumber": 385,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 386,
			"arabicnumber": 386,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: sallallahü aleyhi ve sellem) itikafa girdiği mescidden başını bana uzatır bende hayızlı olduğum halde O’nun başını tarardım.) (Müslim, Hayz: 3; Buhârî, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 387,
			"arabicnumber": 387,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: sallallahü aleyhi ve sellem), başını bana uzatır ben de hayızlı olduğum halde O’nun başını itikafta olduğu halde yıkardım.) (Müslim, Hayz: 3; Buhârî, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 388,
			"arabicnumber": 388,
			"text": "Âişe (radıyallahü anha)’dan rivâyete göre: sallallahü aleyhi ve sellem), mescidde itikafta iken başını bana çıkarır ben de hayızlı olduğum halde O’nun başını yıkardım.) (Müslim, Hayz: 3; Buhârî, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 389,
			"arabicnumber": 389,
			"text": "Yine Âişe (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: olduğum zamanlarda bile Rasûlüllah (sallallahü aleyhi ve sellem)’in saçını tarardım.) (Müslim, Hayz: 3; Buhârî, Hayz: 3)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 390,
			"arabicnumber": 390,
			"text": "Hafsa (radıyallahü anha)’dan rivâyete göre, şöyle demiştir: Ümmü Atıyye, Rasûlüllah (sallallahü aleyhi ve sellem)’i hatırladıkça: Anam sana kurban olsun) derdi. Ben de: sallallahü aleyhi ve sellem)’in şöyle buyurduğunu işitin mi?) dedim. O da: dedi. (Babam Anam Sana kurban olsun) dedi; Rasûlüllah (sallallahü aleyhi ve sellem)’in şöyle buyurduğunu aktardı: çağına gelen genç kızlar, hayız gören kadınlar, yaşlı kadınlar hayırlı toplantılar da ve Müslümanların davetlerinde bulunsunlar. Hayızlı kadınlar mescidlere girmesin ve uzakta dursunlar.) (Buhârî, Hayz: 24; İbn Mâce, İkametü’s Salat: 165)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 391,
			"arabicnumber": 391,
			"text": "Âişe (radıyallahü anha) anlatıyor: Rasûlüllah (sallallahü aleyhi ve sellem)’e; Safiye binti Huyey hayız oldu dedim. Rasûlüllah (sallallahü aleyhi ve sellem) de: halde bizi geciktirecek, sizinle Kâbe’yi tavaf etmemiş miydi?) buyurdu. Bende: tavaf etti) dedim. Bunun üzerine Rasûlüllah (sallallahü aleyhi ve sellem): ise yola çıkın) buyurdular. (Buhârî, Hayz: 28; Tirmizî, Hac: 98)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 392,
			"arabicnumber": 392,
			"text": "Esma binti Umeys (radıyallahü anha) anlatıyor: Zülhuleyfe denilen yerde aybaşı olmuştum. Rasûlüllah (sallallahü aleyhi ve sellem), Ebû Bekir’e: ona gusletsin ve telbiye getirsin) buyurdu. (Ebû Dâvûd, Menasik: 10; Müslim, Hac: 16)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 393,
			"arabicnumber": 393,
			"text": "Semure (radıyallahü anh)’den rivâyete göre, şöyle demiştir: Rasûlüllah (sallallahü aleyhi ve sellem) ile beraber hayızlı iken vefat eden Ümmü Ka’b’ın cenaze namazını kıldık. Rasûlüllah (sallallahü aleyhi ve sellem) cemaatin ortasında idi veya cenazenin ortasına durmuş idi. (Buhârî, Hayz: 30)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 394,
			"arabicnumber": 394,
			"text": "Esma binti Ebû Bekir (radıyallahü anha)’dan: Münzir b. Fatıma kucağımda iken bir kadın elbiseye bulaşan hayız kanı hakkında fetva istedi: Rasûlüllah (sallallahü aleyhi ve sellem)’de: çitile, temizle ve namazını kıl) buyurdu. (Ebû Dâvûd, Tahara: 132; Buhârî, Hayz: 10)",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 395,
			"arabicnumber": 395,
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 48
			}
		}
	]
}