{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "রেওয়ায়ত ৩. উমর ইবন খাত্তাব (রাঃ), উসমান ইবন আফফান (রাঃ), যায়দ ইবন সাবিত (রাঃ) দাদাকে মৃতের ভাই-বোনের সহিত এক-তৃতীয়াংশ হিস্যা দিতেন। মালিক (রহঃ) বলেনঃ আমাদের নিকট সর্বসম্মতিক্রমে নির্ধারিত মাসআলা এই যে, মৃতের পিতা জীবিত থাকিলে দাদা মাহরুম হইয়া যায় কিন্তু মৃতের ছেলে কিংবা নাতি বিদ্যমান থাকিলে দাদা যবিল ফুরূয হিসাবে ষষ্ঠাংশ পাইবে। যদি মৃতের ছেলে কিংবা নাতি না থাকে এবং সহোদর ভাই-বোন কিংবা বিমাতা ভাই-বোন না থাকে, তবে যবিল ফুরূয থাকিলে তাহাদের হিস্যা দিয়া যদি ষষ্ঠাংশ কিংবা ততোধিক মাল অবশিষ্ট থাকে তবে তাহা দাদা পাইবে। আর যদি ষষ্ঠাংশের চেয়ে কম মাল থাকে তবে ষষ্ঠাংশ দাদার জন্য অংশ হিসাবে নির্দিষ্ট হইবে। মালিক (রহঃ) বলেনঃ যদি মৃতের দাদা এবং সহোদর ভাই-বোনদের সহিত কোন যবল ফুরূয থাকে, তবে যবীল ফুরূযের হিস্যা দিয়া যাহা কিছু অবশিষ্ট থাকিবে ইহাতে নিম্নলিখিত অবস্থায় যাহা উত্তম হয় তাহাই কার্যকরী করা হইবে। (১) অবশিষ্ট মালের এক-তৃতীয়াংশ দাদাকে দেওয়া হইবে। (২) দাদাকে মৃতের ভাই ধার্য করিয়া এক ভাইয়ের সমান হিস্যা দেওয়া যাইবে। (৩) পূর্ণ মালের ষষ্ঠাংশ দাদাকে দেওয়ার পর যদি মাল অবশিষ্ট থাকিয়া যায় তবে তাহা ভাই-বোনদেরকে বোনের দ্বিগুণ ভাইকে বন্টন করিয়া দেওয়া হইবে। কিন্তু আর একটি উদাহরণে বণ্টন অন্যরূপে হইবে। উদাহরণটি হইল এইঃ এক মহিলা মৃত্যুবরণ করিয়াছে তাহার স্বামী, মাতা, সহোদরা ভগ্নী ও দাদা আছে, তাহার সম্পদের অর্ধেক পাইবে স্বামী, এক-তৃতীয়াংশ মাতা, ষষ্ঠাংশ দাদা আর সহোদরা ভগ্নী অর্ধেক। অতঃপর দাদার ষষ্ঠাংশ ও বোনের অর্ধেক একত্রিত করা হইবে, উহাকে এইভাবে বন্টন করা হইবে যে, দাদা পাইবে দুই-তৃতীয়াংশ ও বোন পাইবে এক-তৃতীয়াংশ। (এই মাসআলাটি আওলের একটি উদাহরণ।) মালিক (রহঃ) বলেনঃ যদি মৃত ব্যক্তির দাদার সঙ্গে তাহার বিমাতা ভাইও থাকে তবে সে সহোদর ভাইয়ের মতো গ্রাহ্য হইবে। যদি সহোদরের সঙ্গে বিমাতা ভাই-বোনও থাকে, তবে বিমাতা ভাই শুধু ভাইদের গণনায় ধরা হইবে এবং দাদার হিস্যা কম করিয়া দিবে স্বয়ং কোন অংশ পাইবে না। হ্যাঁ, যদি সহোদর ভাইদের সঙ্গে বৈপিত্রেয় ভাইও থাকে, তবে তাহারা ভাইদের শামিলে গণ্য হইয়া দাদার হিস্যায় কম করিতে পারিবে না। কেননা যদি দাদা থাকে এবং শুধু বৈপিত্রেয় ভাই থাকে তবে দাদা পূর্ণ মাল পাইবে এবং বৈপিত্রেয় ভাই মাহরূম হইয়া যাইবে। যেই অবস্থায় দাদার সঙ্গে সহোদর ভাই এবং বৈমাত্রেয় ভাইবোনও থাকে তখন দাদার হিস্যা দেওয়ার পর যাহা অবশিষ্ট থাকে তাহা সহোদর ভাই-বোনদেরই হিস্যা হইবে, বৈমাত্রেয় ভাই কিছুই পাইবে না। হ্যাঁ, যদি সহোদর মাত্র এক বোন হয় এবং বাকী সকল বিমাতা ভাই-বোন হয় তবে বিমাতাদের কারণে সহোদর বোন দাদার হিস্যা কম করিয়া দিবে এবং এই সহোদর বোন অর্ধেক অংশ পূর্ণ পাইবে। তবুও যদি কিছু মাল অবশিষ্ট থাকিয়া যায় তবে বিমাতা ভাই-বোনগণ নিজ নিজ হিস্যা ভাইয়েরা বোনদের দ্বিগুণ হিসাবে পাইবে। আর যদি অবশিষ্ট না থাকে তবে বিমাতা ভাই-বোনগণ মাহরাম হইয়া যাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1076
			}
		}
	]
}