{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "রেওয়ায়ত ১১. মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, উমর ইবন আবদুল আযীয (রহঃ) তাহার খিলাফতকালে জনৈক কর্মকর্তার নিকট এই মর্মে পত্র লিখিলেন যে, বিবাহ প্রদানকারী তিনি পিতা হউক বা অন্য কেহ স্বামীর নিকট হইতে কোন প্রকার উপঢৌকন বা সম্মানীর শর্ত করিয়া থাকিলে স্ত্রী দাবি করিলে সে উহা পাইবে। মালিক (রহঃ) সেই মহিলা সম্পর্কে বলেন, যে মহিলাকে তাহার পিতা বিবাহ দিয়াছে এবং কন্যার মোহরানাতে কন্যার পিতা নিজের জন্য কিছু উপঢৌকনের শর্ত করিয়াছে। তবে যেই সব শর্তে বিবাহ সংঘটিত হইয়াছে, সেই সব প্রাপ্য হইবে কন্যার, যদি সে দাবি করে। আর যদি তাহার স্বামী সহবাসের পূর্বে তাহাকে তালাক দেয় তবে শর্তকৃত উপঢৌকন হইতে স্বামী অর্ধেক পাইবে। মালিক (রহঃ) বলেনঃ যে ব্যক্তি তাহার অপ্রাপ্ত বয়স্ক পুত্রকে বিবাহ দেয়, যে পুত্র কোন সম্পদের মালিক নয়। বিবাহ অনুষ্ঠানে যদি সে পুত্র সম্পদের মালিক না থাকে তবে মহর ওয়াজিব হইবে তাহার পিতার উপর। আর যদি পুত্র সম্পদের মালিক থাকে তবে পিতা স্বয়ং মহর-এর দায়িত্ব গ্রহণ না করিয়া থাকে তবে পুত্রের সম্পদ হইতে মহর আদায় করিতে হইবে। কেননা পুত্র পিতার কর্তৃত্বাধীন থাকিলে এবং পুত্র অপ্রাপ্ত বয়স্ক হইলে এই বিবাহ পুত্রের জন্য অপরিহার্য হইবে। মালিক (রহঃ) বলেনঃ কোন ব্যক্তি সহবাসের পূর্বে তাহার কুমারী স্ত্রীকে তালাক দিল। কন্যার পিতা তাহার কন্যার অর্ধেক মহর মাফ করিয়া দিল। কন্যার পিতা যে পরিমাণ মহর মাফ করিয়া দিল সে পরিমাণ মহর না দেওয়া স্বামীর জন্য বৈধ হইবে। মালিক (রহঃ) বলেনঃ উপরিউক্ত মাস'আলার দলীল এই যে, আল্লাহ তা'আলা কুরআনুল করীমে ইরশাদ করিয়াছেন ‏(‏إِلاَّ أَنْ يَعْفُونَ‏) “যদি না স্ত্রী মাফ করিয়া দেয়।” ইহাতে ঐ সকল স্ত্রীলোকের কথা বলা হইয়াছে যাহাঁদের সহিত তাহাদের স্বামীগণ সহবাস করিয়াছে। (‏أَوْ يَعْفُوَ الَّذِي بِيَدِهِ عُقْدَةُ النِّكَاحِ‏) অথবা যাহার হাতে বিবাহ বন্ধন রহিয়াছে সে মাফ করিয়া দেয়।[1] আয়াতে উল্লিখিত “যাহার হাতে বিবাহ বন্ধন রহিয়াছে” দ্বারা উদ্দেশ্য হইতেছে, কুমারী কন্যার পিতা এবং ক্রীতদাসীর মালিক যাহাদের হাতে বিবাহ বন্ধনের অধিকার রহিয়াছে।” মালিক (রহঃ) বলেনঃ এই বিষয়ে আমি এইরূপ শুনিয়াছি এবং আমাদের মদীনাবাসীর আমলও অনুরূপ। মালিক (রহঃ) বলেনঃ ইহুদী অথবা খ্রিস্টান মহিলা ইহুদী অথবা খ্রিস্টান স্বামীর বিবাহ বন্ধনে থাকিলে এবং ইহুদী অথবা খ্রিস্টান মহিলা স্বামীর সহিত সহবাসের পূর্বে মুসলিম হইলে তবে মহর তাহদের প্রাপ্য হইবে না । মালিক (রহঃ) বলেনঃ দীনার-এর এক-চতুর্থাংশের কম পরিমাণ মহর-এর বিনিময়ে মহিলাকে বিবাহ দেওয়া আমি বৈধ মনে করি না। এই পরিমাণই হইতেছে সর্বনিম্ন পরিমাণ, যাহাতে চোরের হাত কাটা হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1101
			}
		}
	]
}