{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1175,
			"arabicnumber": 1175,
			"text": "রেওয়ায়ত ২২. যে ব্যক্তি তাহার চার পত্নীর সহিত একবাক্যে যিহার করিয়াছে, সে ব্যক্তি সম্পর্কে উরওয়া ইবন যুবায়র (রহঃ) বলিয়াছেনঃ সেই ব্যক্তিকে একটি মাত্র কাফফারা দিতে হইবে। মালিক (রহঃ) রবি'আ ইবন আবদুর রহমান (রহঃ) হইতে অনুরূপ রেওয়ায়ত করিয়াছেন। মালিক (রহঃ) বলেন, এই ব্যাপারে আমাদের সিদ্ধান্তও অনুরূপ। মালিক (রহঃ) বলেনঃ আল্লাহ্ তা'আলা তাহার কিতাবে যিহারের কাফফারা সম্পর্কে ইরশাদ করিয়াছেন যে, স্ত্রীকে স্পর্শ করার পূর্বে সে একটি ক্রীতদাস আযাদ করবে। যে ইহার সামর্থ রাখে না, সে স্ত্রীকে স্পর্শ করার পূর্বে একাধারে দুই মাস রোযা পালন করবে। আর যে ব্যক্তি ইহারও ক্ষমতা রাখে না সে ষাটজন মিসকীনকে আহার করাইবে। মালিক (রহঃ) বলেনঃ যে ব্যক্তি একাধিক মজলিসে স্ত্রীর সহিত যিহার করিয়াছে, সে ব্যক্তির উপর কেবলমাত্র একটি কাফফারা দেওয়া ওয়াজিব হইবে। যদিও সে যিহার করিয়া কাফফারা দিয়াছে এবং কাফফারা দেওয়ার পর পুনরায় যিহার করিয়াছে তবে তাহার উপর (পুনরায়) কাফফারা জরুরী হইবে। মালিক (রহঃ) বলেনঃ যে স্ত্রীর সহিত যিহার করিয়াছে এবং কাফফারা দেওয়ার পূর্বে স্ত্রীকে স্পর্শ করিয়াছে, সে ব্যক্তির উপর একটি মাত্র কাফফারা ওয়াজিব হইবে। কাফফারা না দেওয়া পর্যন্ত স্ত্রী হইতে বিরত থাকিবে এবং আল্লাহর নিকট ক্ষমা চাহিবে। মালিক (রহঃ) বলেনঃ ইহাই সর্বোত্তম যাহা আমি শুনিয়াছি। মালিক (রহঃ) বলেনঃ যিহারের ব্যাপারে মাহরম (যাহাদের সহিত বিবাহ হারাম এমন নিকট আত্মীয়) সে দুধপান বা বংশগত যেভাবে হউক না কেন সবাই এক সমান। মালিক (রহঃ) আল্লাহর বাণী উদ্ধৃত করিয়া বলেনঃ “যাহারা নিজেদের স্ত্রীগণের সহিত যিহার করে, অতঃপর যাহা তাহারা বলিয়াছে উহা হইতে প্রত্যাবর্তন করে।” ইহার তফসীর হইতেছে এই— কোন ব্যক্তি তাহার স্ত্রীর সহিত যিহার করিয়াছে। অতঃপর তাহার স্ত্রীকে রাখা এবং তাহার সহিত সংগত হওয়ার সংকল্প করিয়াছে, সে যদি তাহার স্ত্রীকে রাখা সংগত হওয়ার সংকল্প করে তবে তাহার উপর কাফফারা ওয়াজিব হইবে। আর যদি সে স্ত্রীকে তালাক দেয় এবং যিহার করার পর তাহাকে রাখা এবং সংগত হওয়ার সংকল্প না করে তবে তাহার উপর কাফফারা ওয়াজিব হইবে না। মালিক (রহঃ) বলেনঃ যদি ইহার পর সে স্ত্রীকে পুনরায় বিবাহ করে তবে যিহারের কাফফারা না দেওয়া পর্যন্ত উহার সহিত মিলিত হইবে না। মালিক (রহঃ) বলেনঃ যে ব্যক্তি দাসীর সহিত যিহার করিয়াছে সে যদি উহার সহিত সহবাস করিতে করে তবে সহবাসের পূর্বে তাহাকে যিহারের কাফফারা দিতে হইবে। মালিক (রহঃ) বলেনঃ কোন ব্যক্তির প্রতি যিহারে ঈলা শামিল করা হইবে না। কিন্তু সেই লোক যদি স্ত্রীর ক্ষতি সাধনকারী হয়; যিহার হইতে ফিরিবার ইচ্ছা তাহার না থাকে তবে উহা স্বতন্ত্র ব্যাপার।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1175
			}
		}
	]
}