{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1189,
			"arabicnumber": 1189,
			"text": "রেওয়ায়ত ৩৫. আবদুল্লাহ্ ইবন উমর (রাঃ) হইতে বর্ণিত, রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের যুগে এক ব্যক্তি তাহার স্ত্রীর প্রতি লিআন করিয়াছে এবং ছেলের নসবকে অস্বীকার করিয়াছে। অতঃপর রাসূলুল্লাহ্ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহদের উভয়কে পৃথক করিয়া দিয়াছেন এবং স্ত্রীকে ছেলেটি প্রদান করিয়াছেন। মালিক (রহঃ) বলেনঃ আল্লহ তা'আলা ইরশাদ করিয়াছেনঃ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ وَلَمْ يَكُن لَّهُمْ شُهَدَاءُ إِلَّا أَنفُسُهُمْ فَشَهَادَةُ أَحَدِهِمْ أَرْبَعُ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الصَّادِقِينَ وَالْخَامِسَةُ أَنَّ لَعْنَتَ اللَّهِ عَلَيْهِ إِن كَانَ مِنَ الْكَاذِبِينَ وَيَدْرَأُ عَنْهَا الْعَذَابَ أَن تَشْهَدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنَ الْكَاذِبِينَ وَالْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِن كَانَ مِنَ الصَّادِقِينَ অর্থঃ এবং যাহারা নিজদিগের স্ত্রীর প্রতি অপবাদ আরোপ করে অথচ নিজেরা ব্যতীত তাহাদিগের কোন সাক্ষী নাই, তাহাদিগের প্রত্যেকের সাক্ষ্য এই হইবে যে, সে আল্লাহর নামে চারিবার শপথ করিয়া বলিবে যে, সে অবশ্যই সত্যবাদী এবং পঞ্চমবারে বলিবে, সে মিথ্যাবাদী হইলে তাহার উপর নামিয়া আসিবে আল্লাহর লা'নত। তবে স্ত্রীর শাস্তি রহিত হইবে যদি সে চারিবার আল্লাহর নামে শপথ করিয়া সাক্ষ্য দেয় যে, তাহার স্বামীই মিথ্যাবাদী এবং পঞ্চমবারে বলে, ‘তাহার স্বামী সত্যবাদী হইলে তাহার নিজের উপর নামিয়া আসিবে আল্লাহর গযব’। মালিক (রহঃ) বলেন, আমাদের নিকট বিধান হইল এই, লি'আনকারী তাহারা পরস্পর বিবাহ বন্ধনে আবদ্ধ হইবে না, যদি স্বামী মিথ্যাবাদী প্রমাণিত হয়, তবে তাহাকে শাস্তি (হদ্দ প্রয়োগ) দেওয়া হইবে এবং ছেলেকে তাহার সহিত যুক্ত করা হইবে। স্ত্রী সেই স্বামীর নিকট আর কখনো ফিরিয়া যাইবে না। মালিক (রহঃ) বলেন, আমাদের নিকট ইহাই নিয়ম যাহাতে কোন প্রকার মতানৈক্য বা সন্দেহ নাই। মালিক (রহঃ) বলেনঃ কোন ব্যক্তি যদি স্ত্রীকে বায়েন তালাক দেয় যাহাতে স্ত্রীর দিকে তাহার রুজু করার অধিকার থাকে না, তারপর স্ত্রীর গর্ভ অস্বীকার করে, তবে তাহাকে লি'আন করিতে হইবে। যদি স্ত্রী অন্তঃসত্ত্ব হয় এবং স্ত্রীর গর্ভধারণ সেই ব্যক্তির পক্ষ হইতে হওয়ারই সম্ভাবনা অধিক থাকে এবং স্ত্রীও উহার দাবি করে। অবশ্য যদি তালাকের পর এইরূপ দীর্ঘ সময় অতিবাহিত না হয় যাহাতে স্বামী হইতে গর্ভধারণের সন্দেহ সৃষ্টি হয়। যাহাতে এই গর্ভধারণ উক্ত স্বামী দ্বারা হইয়াছে বলিয়া অনুমান করা যায় না। আমাদের নিকট ইহাই হুকুম আর ইহাই আমি বিজ্ঞ আলিমদের নিকট হইতে শুনিয়াছি। মালিক (রহঃ) বলেনঃ তখন কোন ব্যক্তি নিজের স্ত্রীর প্রতি ব্যভিচারের অপবাদ আরোপ করিল। তিন তালাক দেওয়ার পর স্ত্রী যখন অন্তঃসত্ত্বা অথচ সে ব্যক্তি এই গর্ভধারণ তাহার পক্ষ হইতে হইয়াছে বলিয়া স্বীকারও করে, তারপর সে ধারণা করে যে, সে স্ত্রীকে তালাক দেওয়ার পূর্বে যিনা করিতে দেখিয়াছে, তবে তাহাকে শাস্তি দেওয়া হইবে (অর্থাৎ তাহার উপর ইসলামী বিধানমতে হদ্দ জারি করা হইবে) সে লি’আন করিবে না। আর যদি তিন তালাক দেওয়ার পর সেই স্ত্রীর গর্ভধারণ (তাহার পক্ষ হইতে হওয়ার ব্যাপার) সে অস্বীকার করে সে লিআন করিবে। মালিক (রহঃ) বলেনঃ আমি এরূপই শুনিয়াছি। মালিক (রহঃ) বলেনঃ যিনার অপবাদারোপ করা এবং লিআন-এর ব্যাপারে ক্রীতদাস ও স্বাধীন ব্যক্তির হুকুম একই। অর্থাৎ এই দুই ব্যাপারে ক্রীতদাসের হুকুমত আযাদ ব্যক্তির মতো। কিন্তু নিজের ক্রীতদাসীর প্রতি অপবাদ দিলে মনিবের উপর হদ জারি হইবে না অর্থাৎ মনিবকে শাস্তি দেওয়া হইবে না। মালিক (রহঃ) বলেনঃ মুসলিম ক্রীতদাসী, খ্রীস্টান ও ইহুদী স্বাধীন স্ত্রীলোক স্বাধীন মুসলিম স্বামীর প্রতি লি'আন করিবে, যদি সেই মুসলিম ইহাদের কাহাকেও বিবাহ করে এবং তাহার সহিত সহবাস করিয়া থাকে। কারণ আল্লাহ কুরআনুল করীমে ইরশাদ করিয়াছেনঃ وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ “যাহারা স্ত্রীগণের প্রতি অপবাদ দেয়”। উপরিউক্ত মহিলাগণও স্ত্রীর অন্তর্ভুক্ত। (তাই উহাদিগের প্রতি অপবাদ আরোপ করিলে লি’আন করিতে হইবে।) মালিক (রহঃ) বলেনঃ আমাদের নিকট ইহাই সিদ্ধান্ত। মালিক (রহঃ) বলেনঃ কোন মুসলিম আযাদ নারীকে অথবা মুসলিম ক্রীতদাসীকে অথবা আযাদ খ্রীস্টান অথবা ইহুদী নারীকে কোন ক্রীতদাস বিবাহ করিলে সে স্ত্রীর সহিত লি'আন করিতে পারবে। মালিক (রহঃ) বলেনঃ যে ব্যক্তি নিজের স্ত্রীর সহিত লি'আন করিয়াছে, অতঃপর সে উহা হইতে ফিরিয়া আসে (রুজু করে) এবং মিথ্যা বলিয়াছে বলিয়া স্বীকার করে, একবার অথবা দুইবার কসম খাওয়ার পর পঞ্চমবারের লা'নত উচ্চারণ না করা পর্যন্ত। সে যদি লি'আন সমাপ্ত করার পূর্বে রুজু করে তবে তাহাকে হদ্দ লাগানো (শান্তি দেওয়া) হইবে এবং তাহদের উভয়ের মধ্যে বিচ্ছেদ ঘটানো হইবে না। মালিক (রহঃ) বলেনঃ যে ব্যক্তি স্ত্রীকে তালাক দিয়াছে। অতঃপর তিন মাস অতিবাহিত হইবার পর স্ত্রী বলিলঃ আমি অন্তঃসত্ত্বা। মালিক (রহঃ) বলেন, এমতাবস্থায় তাহার স্বামী গর্ভ ধারণের স্বীকৃতি প্রদান না করিলে তবে লি‘আন করিবে। মালিক (রহঃ) বলেনঃ ক্রীতদাসী স্ত্রীর সহিত তাহার স্বামী লি’আন করিয়াছে, অতঃপর সে ক্রীতদাসীকে খরিদ করিয়াছে, তবে সে মালিক হইলেও ইহার সহিত সহবাস করিতে পারিবে না। কারণ নিয়ম হইতেছে, পরস্পর লি'আনকারী কখনও একে অপরের প্রতি প্রত্যাবর্তন (রুজু) করিতে পারে না। মালিক (রহঃ) বলেনঃ কোন ব্যক্তি স্ত্রীর সহিত সংগত হওয়ার পূর্বে স্ত্রীর সহিত লি'আন করিলে তবে সে মহরের অর্ধেক পাইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1189
			}
		}
	]
}