{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"29": "Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1237,
			"arabicnumber": 1237,
			"text": "রেওয়ায়ত ৭৮. মালিক (রহঃ) হইতে বর্ণিত, আবদুর রহমান ইবন যায়দ ইবন খাত্তাব (রাঃ)-এর উম্মে ওয়ালাদ-কে সাবিতুল আহনাফ (রহঃ) বিবাহ করিলেন। সাবিত বলেনঃ আবদুল্লাহ ইবন আবদুর রহমান ইবন যায়দ ইবন খাত্তাব (রাঃ) আমাকে ডাকিয়া পাঠাইলেন, আমি তাহার নিকট আসিলাম এবং তাহার সমীপে প্রবেশ করিয়া দেখিলাম, সেখানে কয়েকটি চাবুক ও দুইটি লৌহ শিকল (আর তাহার নিকটে রহিয়াছে) উপবিষ্ট তাহার দুইজন ক্রীতদাস। তারপর আমাকে বলিলেন, তুমি স্ত্রীকে তালাক দাও, নতুবা আল্লাহর কসম, আমি তোমাকে এইরূপ এইরূপ করিব (অর্থাৎ চাবুক মারিব ও শিকল পরাইব)। সাবিত বলিলেনঃ (চাপ দেখিয়া) আমি বলিলাম, এই স্ত্রীকে তালাক এক হাজার বার। তারপর সাবিত বলেন- আমি তাহার নিকট হইতে প্রস্থান করিলাম। মক্কার পথে আমি আবদুল্লাহ ইবন উমর (রাঃ)-এর সাক্ষাত পাইলাম, আমি তাহাকে আমার ব্যাপার অবহিত করিলাম। (শুনিয়া) আবদুল্লাহ ইবন উমর (রাঃ) রাগান্বিত হইলেন এবং বলিলেনঃ ইহা (কোন) তালাক নহে, তোমার স্ত্রী তোমার জন্য হারাম হয় নাই। তুমি তোমার স্ত্রী গ্রহণ কর, আমার মনে (কিন্তু) শান্তি আসিল না। তাই আমি আবদুল্লাহ ইবন যুবায়র (রাঃ)-এর নিকট হাযির হইলাম। তিনি ছিলেন তখন মক্কার শাসনকর্তা। আমি তাহাকে বিষয়টি অবহিত করিলাম এবং আবদুল্লাহ ইবন উমর (রাঃ) যাহা বলিয়াছেন তাহাও জানাইলাম। (ঘটনা শ্রবণ করিয়া) আবদুল্লাহ ইবন যুবায়র (রাঃ) আমাকে বলিলেনঃ তোমার স্ত্রী তোমার জন্য হারাম হয় নাই, তুমি তাহার দিকে রুজু কর। তিনি জাবির ইবন আসওয়াদ যুহরী তৎকালীন মদীনার গভর্নরকে নির্দেশ দিয়া লিখিলেন, আবদুল্লাহ ইবন আবদুর রহমানকে শাস্তি দাও এবং সাবিতের স্ত্রীর সহিত তাহার মিলনের পথে বাধা অপসারিত কর। সাবিত বলেনঃ তখন আমি মদীনাতে যাই। অতঃপর আবদুল্লাহ ইবন উমর (রাঃ)-এর পত্নী সফিয়্যা তাহার স্বামীর জ্ঞাতসারে আমার স্ত্রীকে সজ্জিত করিয়া আমার নিকট প্রেরণ করিলেন। অতঃপর আমি আবদুল্লাহ ইবন উমর (রাঃ)-কে ওয়ালীমার যিয়াফতে আমন্ত্রণ জানাইলাম। তিনি উহা গ্রহণ করেন এবং ওয়ালীমায় যোগদান করেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 1237
			}
		}
	]
}