{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "রেওয়ায়ত ৪. আবদুল্লাহ ইবন উমর (রাঃ) তাহার এক দাস বিক্রয় করিলেন বারাআত এর শর্তে আটশত দিরহাম মূল্যে। অতঃপর ক্রেতা বলিলেন, আবদুল্লাহ ইবন উমর (রাঃ)-এর গোলামের মধ্যে একটি রোগ রহিয়াছে, আপনি আমার নিকট উহা চিহ্নিত করেন নাই। তারপর তাহারা উভয়ের বিবাদ লইয়া উপস্থিত হইলেন উসমান ইবন আফফান (রাঃ)-এর নিকট। ক্রেতা ব্যক্তি বলিলেন, তিনি আমার নিকট গোলাম বিক্রয় করিলেন অথচ উহার রহিয়াছে একটি রোগ যাহার কথা তিনি আমার নিকট বলেন নাই। আবদুল্লাহু বলিলেনঃ আমি গোলাম বিক্রয় করিয়াছি বারাআত (দায়িত্বমুক্ত থাকা)-এর শর্তে। উসমান (রাঃ) ফয়সালা দিলেন, আবদুল্লাহ্ ইবন উমর (রাঃ) শপথ করিয়া বলিবে-ক্রেতার নিকট তিনি যে গোলাম বিক্রয় করিয়াছেন উহার মধ্যে কোন রোগ আছে বলিয়া তিনি জানিতেন না। আবদুল্লাহ্ (রাঃ) এইরূপ শপথ করিতে অস্বীকৃতি জানাইলেন এবং গোলাম তিনি ফেরত গ্রহণ করিলেন। অতঃপর উক্ত গোলাম সুস্থ হইয়া গেল। তারপর আবদুল্লাহ্ (রাঃ) উহাকে দেড় হাজার দিরহাম মূল্যে বিক্রয় করিলেন। মালিক (রহঃ) বলেনঃ আমাদের নিকট সর্বসম্মত ফয়সালা হইল এই, যে ব্যক্তি কোন দাসী ক্রয় করিল এবং তাহার দ্বারা উহা অন্তঃসত্ত্বা হইল, অথবা দাস ক্রয় কলিয়া উহাকে আযাদ করিল এবং এই জাতীয় যে কোন প্রকার ক্ষমতা পরিচালনা বা কার্য সম্পাদন করে যাহাতে সেই দাসী বা দাসকে আর ফেরত দেওয়া চলে না। অতঃপর (এই মর্মে) প্রমাণ উপস্থিত হইয়াছে যে, বিক্রেতার কাছে থাকা কালে উহার মধ্যে খুঁত ছিল অথবা খুঁত প্রকাশিত হইয়াছে বিক্রেতার স্বীকারোক্তির দ্বারা কিংবা অন্য কোন উপায়ে, [এইরূপ হইয়া থাকিলে] তবে খুঁতসহ বিক্রয়ের দিন সেই দাস অথবা দাসীর কত মূল্য হইতে পারে তাহা নির্ণয় করা হইবে, তারপর ক্রটি মুক্তাবস্থায় উহার যাহা মূল্য হইবে এবং খুঁত অবস্থায় যাহা উহার মূল্য হইতে পারে এভদুভয়ের মধ্যবর্তী ব্যবধানিক মূল্যের অর্থটি ক্রেতাকে ফেরত দিবে। মালিক (রহঃ) বলেনঃ আমাদের কাছে সর্বসম্মত ফয়সালা এই, সেই ব্যক্তি সম্বন্ধে যে ব্যক্তি কোন ক্রীতদাস ক্রয় করিয়াছে। অতঃপর উহা হইতে এমন কোন খুঁত প্রকাশ পাইয়াছে, যে খুঁত প্রকাশ পাওয়ার দরুন যাহাতে উহাকে বিক্রেতার নিকট ফেরত দেওয়া যাইতে পারে। কিন্তু ক্রেতার নিকট (থাকাবস্থায়) অন্য নূতন খুঁত সৃষ্টি হইয়াছে। যদি নব্যসৃষ্ট খুঁত যাহা ক্রেতার নিকট পয়দা হইয়াছে উহা নষ্টকারী হয় যেমন (কোন অংশ) কর্তন করা কিংবা কানা হওয়া অথবা এই জাতীয় নষ্টকারক খুঁতসমূহ হইতে অন্য কোন খুঁত। তবে দুই বিষয়ের যে কোন উত্তম বিষয়কে গ্রহণ করার ইখতিয়ার ক্রেতার থাকিবে। যদি দাসের ক্রটিসহ যেই দিন উহাকে ক্রয় করিয়াছে সেই দিন যাহা মূল্য হইতে পারে এবং নিখুঁতাবস্থায় উহার যাহা মূল্য হয় উভয়ের মধ্যবর্তী ব্যবধানিক মূল্য তাহা হইতে বাদ দেওয়াকে তিনি পছন্দ করেন তবে (যেই পরিমাণ) অর্থ উহা হইতে বাদ দেওয়া হইবে অথবা সে যদি পছন্দ করে তবে ক্রীতদাসের যেই পরিমাণ ক্ষতি তাহার কাছে থাকিতে হইয়াছে উহার খেসারত প্রদান করিবে, অতঃপর গোলাম ফেরত দেওয়া হইবে (তিনি ইচ্ছা করিলে এইরূপ করা যাইবে)। আর যদি ক্রীতদাস ক্রেতার নিকট মারা যায় তবে ক্রয়ের দিন দোষ মুক্তাবস্থায় উহার মূল্য একশত দীনার থাকে, আর দোষসহ উহার মূল্য ক্রয়ের দিন আশি দীনার হয়, তবে ক্রেতার উপর হইতে উভয় মূল্যের মধ্যে ব্যবধানিক মূল্য বাদ দেওয়া হইবে। মূল্য ধার্য করা হইবে ক্রয়ের দিনেরই। মালিক (রহঃ) বলেনঃ যে ব্যক্তি কোন দাসীকে উহাতে খুঁত পাওয়ার কারণে ফেরত দেয় (অথচ) সে উহার সহিত সহবাস করিয়াছে। তবে দাসী যদি কুমারী হয় তবে (সহবাস করাতে) যতটুকু উহার মূল্য হইতে কমিয়াছে ততটুকু মূল্য তাহাকে আদায় করিতে হইবে আর যদি দাসী কুমারী না হয়, তবে উহার সহিত সঙ্গম করাতে ক্রেতাকে কিছু দিতে হইবে না, কারণ সে উহার জামিনস্বরূপ ছিল। মালিক (রহঃ) বলেনঃ আমাদের নিকট ইহা সর্বসম্মত সিদ্ধান্ত যে, যে ব্যক্তি কোন দাস বা দাসীকে অথবা কোন প্রাণীকে বিক্রয় করিয়াছে বারাআতের শর্তে সে আহলে-মীরাস হউক বা আহিলে-মীরাস স্ব্যতীত অন্য কেহ হউক, তবে সে বিক্রীত বস্তুতে যেকোন প্রকার দোষ পাওয়া যায় উহার দায়-দায়িত্ব হইতে মুক্ত হইয়া গিয়াছে। কিন্তু যদি কোন দোষ জ্ঞাত থাকা সত্ত্বেও গোপন করিয়া থাকে তবে তাহার দায়িত্ব মুক্তির শর্ত করা কোন কাজে লাগিবে না এবং তাহার বিক্রীত বস্তু তাহার দিকে ফিরাইয়া দেওয়া হইবে। মালিক (রহঃ) বলেনঃ যেই দাসীকে দুইজন দাসীর বিনিময়ে বিক্রয় করা হইয়াছে, অতঃপর দাসীদ্বয়ের একজনের মধ্যে এমন দোষ পাওয়া গিয়াছে যাহাসহ মালিকের নিকট ফেরত দেওয়া চলে। তবে সেই দাসীর মূল্য নির্ণয় করা হইবে যেই ক্রীতদাসীকে দুই দাসীর বিনিময়ে বিক্রয় করা হইয়াছিল। তারপর দেখিতে হইবে উহার মূল্য কত। অতঃপর দাসীদ্বয়ের মূল্য নির্ণয় করিতে হইবে যাহাদের একজনের মধ্যে দোষ পাওয়া গিয়াছে। উভয়ে সুস্থ ও নিখুঁত থাকিলে কি মূল্য দাসীদ্বয়ের হইতে পারে তাহা নির্ণন করিবে। অতঃপর যেই দাসীকে এতদুভয়ের বিনিময়ে বিক্রি করা হইয়াছিল উহার মূল্যকে উভয দাসীর মধ্যে উহাদের মূল্য অনুযায়ী বন্টন করিয়া দিবে, যেন দাসীদ্বয়ের প্রত্যেকের উপর স্ব স্ব হিসসা বর্তিত হয়। নিখুঁত ও উত্তমার অংশে উহার মূল্য এবং অপর ক্রটিযুক্ত অংশে তাহার মূল্য বর্তিত হইবে। তারপর লক্ষ্য করা হইবে ক্রটিযুক্ত দাসীর দিকে এবং যেই পরিমাণ মূল্য উহার অংশে নির্ধারিত হইল তাহা বিক্রেতা কর্তৃক ক্রেতাকে ফেরত দিতে হইবে। যেই দিন ক্রেতা দাসীদ্বয়কে নিজ দখলে আনিয়াছে উভয়ের সেই দিনের মূল্য নির্ণয় করিবে। মালিক (রহঃ) বলেনঃ যে ব্যক্তি দাস ক্রয় করিল অতঃপর উহাকে ইজারাতে কাজে লাগাইল, বড় ইজারাতে কিংবা কর মারফতে। তারপর সেই দাসে খুঁত পাওয়া গেল, যে খুঁতের কারণে উহাকে বিক্রেতার নিকট ফেরত দেওয়া যায়। (এইরূপ অবস্থা হইলে) তবে সেই দাসকে খুঁতসহ ফেরত দিবে, ইজারা (লব্ধ অর্থ) ও কর (মারফত আদায়কৃত বস্তু) তাহার (ক্রেতার) প্রাপ্য হইবে। অনুরূপ মতই পোষণ করিতেন আমাদের (পবিত্র) শহরের (মদীনার) উলামা সম্প্রদায়। ইহা এইজন্য যে, (যেমন) এক ব্যক্তি একটি দাস খরিদ করিল। সে দাস তাহার (ক্রেতার) উদ্দেশ্যে একটি গৃহ নিৰ্মাণ করিল। যে গৃহের নির্মাণ খরচ গোলামের মূল্য অপেক্ষা কয়েক গুণ বেশি হইবে, অতঃপর সেই দাসের কোন দোষ পাওয়া গেল যে দোষের কারণে উহাকে বিক্রেতার নিকট ফেরত দেওয়া চলে। (এইরূপ পরিস্থিতির উদ্ভব হইলে) তবে উহাকে (বিক্রেতার নিকট) ফেরত দিবে এবং গোলামের শ্রমের কারণে ক্রেতার উপর কোন মজুরী হিসাব করা হইবে না। অনুরূপ দাসের ইজারালব্ধ অর্থ ক্রেতা পাইবে যদি অন্যের নিকট উহাকে ইজারা দিয়া থাকে কারণ ক্রেতাই উহার জামিন। মালিক (রহঃ) বলেন, ইহাই আমাদের সিদ্ধান্ত। মালিক (রহঃ) বলেনঃ আমাদের নিকট মাসআলা এই, এক ব্যক্তি এক দফাতে একসঙ্গে কয়েক জন দাসকে বিক্রয় করিয়াছে। অতঃপর সেইসব দাসের মধ্যে একজন পাওয়া গিয়াছে চোরাইকৃত দাস কিংবা উহাদের এক জনের মধ্যে খুঁত পাওয়া গিয়াছে। মালিক (রহঃ) বলেন, এমতাবস্থায় দেখিতে হইবে- চোরাইকৃত দাস কিংবা যাহার মধ্যে খুঁত পাওয়া গিয়াছে সেই দাস যদি বিক্রীত দাসের মধ্যে শ্রেষ্ঠ হয় অথবা অধিক মূল্যের হয় এবং ক্রেতা উহার প্রতি আকৃষ্ট হইয়া সবাইকে ক্রয় করিয়াছে, উহাতে রহিয়াছে শ্রেষ্ঠত্ব ও গুণ, সাধারণ লোকের ধারণায়, তবে এইরূপ বিক্রয় সম্পূর্ণ রদ করিয়া দেওয়া হইবে। মালিক (রহঃ) বলেন, চোরাইকৃত গোলাম কিংবা যাহার মধ্যে দোষ পাওয়া গিয়াছে মামুলী ধরনের (বড় রকমের কোন দোষ নহে), আর দাসত্বের মধ্যে সেই গোলাম অতি শ্ৰেষ্ঠও নহে এবং উহার উদ্দেশ্যে সবাইকে ক্রয়ও করা হয় নাই। আর লোক-দৃষ্টিতে উহার বিশেষ কোন গুণও নাই। তবে ক্ৰটিযুক্ত কিংবা চোরাইকৃত সেই ক্রীতদাসকেই বিক্রেতার নিকট ফেরত দেওয়া হইবে; ক্রীতদাসদিগকে যেই মূল্যে খরিদ করা হইয়াছে, হারাহারিভাবে এই দাসের যাহা মূল্য হইবে সেই মূল্য অনুপাতে (অর্থ বাদ দিয়া)।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1293
			}
		}
	]
}