{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "রেওয়ায়ত ৩৯. মালিক ইবন আওস ইন হাদাসান নাসরী (রহঃ) হইতে বর্ণিত, তিনি একশত দীনারের পরিবর্তে দিরহাম সন্ধান করিলেন। তিনি বলেনঃ (ইহা শুনিয়া) তালহা ইবন উবায়দুল্লাহ (রাঃ) আমাকে ডাকিলেন। আমরা উভয়ে এই বিষয়ে পরস্পর কথাবার্তা বলিলাম, (এমনকি) তিনি আমার নিকট হইতে দীনার গ্রহণ করিলেন, উহার পরিবর্তে দিরহাম দেওয়ার জন্য এবং দীনার হাতে লইয়া উহাকে উলট-পালট করিতে লাগিলেন। অতঃপর বলিলেন-(অপেক্ষা করুন) আমার খাজাঞ্চী গারাঃ হইতে আসুক। উমর ইবন খাত্তাব (রাঃ) ইহা শুনিতেছিলেন, তিনি বলিলেন, না, (এইরূপ করিও না) আল্লাহর কসম! তুমি তাহা [তালহা (রহঃ)] হইতে পৃথক হইও না যাবত তাহার নিকট হইতে দিরহাম গ্রহণ না কর। তারপর বলিলেন— রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিয়াছেন, চাঁদির বিনিময়ে স্বর্ণ (গ্রহণ করা সুদের অন্তর্ভুক্ত) অবশ্য যদি উভয়ে নগদ আদান-প্রদান করে। গমের বিনিময়ে গম (ক্রয়-বিক্রয় সুদের অন্তর্ভুক্ত হইবে) কিন্তু যদি নগদ আদান-প্রদান করে। খুর্মার পরিবর্তে খুর্মা (ক্রয়-বিক্রয় সুদ হইবে) অবশ্য যদি নগদ আদান-প্রদান করে। যবের বিনিময়ে যব (ক্রয়-বিক্রয় সুদে গণ্য হইবে), কিন্তু নগদ আদান-প্রদান করে। লবণের বিনিময়ে লবণ (ক্রয়-বিক্রয় সুদ হইবে)। অবশ্য যদি উতয়ে নগদ আদান-প্রদান করে (তবে বৈধ হইবে)। মালিক (রহঃ) বলেনঃ এক ব্যক্তি দীনারকে বদলাইল দিরহাম দ্বারা, অতঃপর সে উহাকে একটি খোটা (দোষযুক্ত) দিরহাম পাইল, যখন সেই দিরহাম ফেরত দিল তখন দীনারের বদলানোর ব্যাপারটি ভঙ্গ হইয়া গেল। (এখন তাহার কর্তব্য হইল) সে চাঁদি ফেরত দিবে (চাঁদির মালিককে) এবং তাহার নিকট হইতে নিজের দীনার ফেরত গ্রহণ করিবে। ইহার ব্যাখ্যা হইতেছে এই, রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়াসাল্লাম বলিয়াছেন, চাঁদির বিনিময়ে স্বর্ণ (গ্রহণ করা) সুদ হইবে, অবশ্য (বৈধ হইবে) যদি নগদ আদান-প্রদান করে। উমর ইবন খাত্তাব (রাঃ) বলিয়াছেনঃ যদি (অপর পক্ষ) গৃহে প্রবেশ করা পর্যন্ত তোমার নিকট সময় চায়, তবে তুমি তাহাকে সময় দিও না। বদলানো দিরহাম হইতে দিরহামওয়ালার নিকট হইতে আলাদা হওয়ার পর এক দিরহামও যদি রদ করা হয় তবে ইহা ঋণ বা পরবর্তী বস্তুর মতো হইবে। এই জন্যই ইহা অবৈধ হইয়াছে এবং বিনিময়ে ব্যবসা ভঙ্গ হইয়া গিয়াছে। উমর ইবন খাত্তাব (রাঃ) ইচ্ছা করিয়াছেন যে, স্বর্ণ, চাঁদি ও খাদ্যশস্য এইসবের মধ্যে ধারের বিনিময়ে নগদ যেন বিক্রয় করা না হয়। কারণ এইসবের মধ্যে বিলম্ব ও সময় দান বৈধ নহে; এক জাতের বস্তু হউক কিংবা বিভিন্ন জাতের বস্তু হউক।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1327
			}
		}
	]
}