{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "রেওয়ায়ত ৪০. ইয়াযিদ ইবন আবদিল্লাহ ইবন কুসাইত (রহঃ) হইতে বর্ণিত, তিনি সাঈদ ইবন মুসায়্যাব (রহঃ)-কে স্বর্ণের বিনিময়ে স্বর্ণের মুরাতালা করিতে দেখিয়াছেন। তিনি দাঁড়িপাল্লার এক হাতে স্বর্ণ ঢালিতেন, তাহার সহিত মুরাতালাকারী অপর পক্ষ তাহার স্বর্ণ ঢালিতেন পাল্লার অপর হাতে। পাল্লার কাটা বরাবর হইলে (পাল্লার এক হাত হইতে) তিনি গ্রহণ করিতেন এবং (অপর হাত হইতে) সাথীকে দিতেন। মালিক (রহঃ) বলেনঃ আমাদের নিকট মাসআলা এই, ওজন করিয়া স্বর্ণের বিনিময়ে স্বর্ণ এবং চাঁদির বিনিময়ে চাঁদি বিক্রয় করাতে কোন দোষ নাই। যদিও বা নগদ দশ দীনারের বিনিময়ে এগার দীনার গ্রহণ করা হয়। উভয় স্বর্ণের ওজন সমপরিমাণ হইলে। মুদ্রার বিনিময়ে মুদ্রা (ওজন করিয়া বিক্রয় করা বৈধ) সংখ্যায় যদিও বাড়তি হয়। এই ব্যাপারে দিরহামও দীনারের মতো। মালিক (রহঃ) বলেনঃ যে ব্যক্তি স্বর্ণের বিনিময়ে স্বর্ণের মুরাতালা করিয়াছে কিংবা চাঁদির বিনিময়ে চাঁদির মুরাতালা করিয়াছে, উভয় স্বর্ণের মধ্যে একটিতে এক মিসকাল (স্বর্ণ) বাড়তি রহিয়াছে, অতঃপর তাহার সাথী (যাহার অংশের স্বর্ণ ওজনে কম) চাঁদি অথবা অন্য বস্তুর দ্বারা উহার মূল্য আদায় করিল। তবে সে (বর্ধিত স্বর্ণের মালিক) এই মূল্য কবুল করিবে না। কারণ ইহা ভাল নহে এবং ইহা সুদের উসীলা মাত্র। কারণ (অতিরিক্ত) এক মিসকাল যদি উহার মূল্য আদায় করিয়া গ্রহণ করা তাহার জন্য জায়েয হয়, তবে সে যেন এই এক মিসকাল স্বর্ণ পৃথকভাবে (নূতন) খরিদ করিল। এইরূপে এক মিসকালকে উহার মূল্য আদায় করিয়া কয়েকবার গ্রহণ করা হইল। এইভাবে সেও তাহার সার্থীর মধ্যে বিক্রয়কে জায়েয করার জন্য (ইহা করা হইল)। মালিক (রহঃ) বলেনঃ যদি সেই ব্যক্তি যে বর্ধিত এক মিসকাল বিক্রয় করিল সেই মিসকাল বিক্রয় করে পৃথকভাবে, যার সহিত অন্য কিছু না থাকে তাহা হইলে (ক্রেতা) বিক্রয়কে হালাল করিবার উদ্দেশ্যে যেই মূল্যে সে উহা ক্রয় করিয়াছে সেই মূল্য ব্যতীত অন্য কোন মূল্যে সে উহা ক্রয় করিবে না, ইহা হইতেছে হারামকে হালাল করার একটি পন্থা বটে। আর ইহা নিষিদ্ধ। মালিক (রহঃ) বলেনঃ এক ব্যক্তি অন্য এক ব্যক্তির সহিত মুরাতালা করিতেছে এবং উহাকে খাঁটি ও উন্নতমানের স্বর্ণ দিতেছে, তৎসঙ্গে দিতেছে কতকটা কৃত্রিম সোনা। ইহার বদলে তাহার সাথী হইতে সে লইতেছে কুফী মাধ্যমিক মানের সোনা। যে কুকী-স্বর্ণ লোকের নিকট অপছন্দীয়। এবং তাহারা উভয়ে উহা বেচা-কেনা করিতেছে সমান সমান ওজনে। এইরূপ বেচা-কেনা জায়েয হইবে না। মালিক (রহঃ) বলেনঃ ইহা মাকরুহ হওয়ার বিশ্লেষণ এই, বিশুদ্ধ স্বর্ণওয়ালা তাহার বিশুদ্ধ স্বর্ণের অতিরিক্ত মূল্য আদায় করিয়াছে যে কতকটা নিম্নমানের স্বর্ণ উহার সহিত মিশ্রিত করিয়াছে তাহাতে। তাহার সাথী (কুফী স্বর্ণ ওয়ালা)-র স্বর্ণের তুলনায় তাহার স্বর্ণের মান উচ্চ না হইত, তবে তাহার সাথী কুফী-স্বর্ণের বিনিময়ে তাহার নিম্নমানের স্বর্ণের সহিত মুরাতালা করিত না। ইহার দৃষ্টান্ত সেই ব্যক্তির মতো যেই ব্যক্তি তিন সা’ আজওয়াহ্ খুর্মা ক্রয় করার ইচ্ছা করিল দুই সা’ এবং দুই মুদ কাবীস খুর্মার বিনিময়ে। তাহাকে যখন বলা হইল, ইহা জায়েয নহে। তখন বিক্রয় বৈধ করার জন্য দুই সা’ কাবীস খুর্মার সাথে এক সা’ নিকৃষ্ট খুর্মা মিলাইয়া দিল। ইহা জায়েয হইবে না। কারণ আজওয়া খুর্মাওয়ালা এক সা’ নিকৃষ্ট খুর্মার বিনিময়ে এক সা’ আজওয়া খুর্মা দিতে রাজী হইবে না। তবুও তিনি (এইখানে) কাবীসের শ্রেষ্ঠত্বের জন্য প্রদান করিলেন। কিংবা ইহার (দৃষ্টান্ত) এই যে, একজন লোক আর একজন লোককে বলিল, আপনি আমার নিকট তিন সা’ গম বিক্রয় করুন আড়াই সা’ শামী গমের বিনিময়ে। সে লোক বলিল, ইহা বৈধ নহে। কিন্তু (বৈধ হইবে) যদি (ওজনে) সমান সমান হয়। তখন দুই সা’ শামী (সিরীয়) গমের সাথে এক সা’ যব মিলান হইল। উদ্দেশ্য ইহার দ্বারা উভয়ের মধ্যকার বিক্রয় বৈধ করা। ইহা জায়েয হইবে না। কারণ এক সা’ যবের বিনিময়ে এক সা’ গম সে উহাকে কখনো দিবে না, যদি পৃথকভাবে এক সা বিক্রয় করা হয়। (এইখানে) সে এইজন্য দিয়াছে যে, তাহা সাধারণ গমের তুলনায় শামী গম শ্রেষ্ঠ। ইহা বৈধ নহে। নিম্নমানের স্বর্ণের বেলায় আমরা যেইরূপ বর্ণনা করিয়াছি, ইহাও সেইরূপ বৈধ নহে। মালিক (রহঃ) বলেনঃ সর্বপ্রকার স্বর্ণ চাঁদি এবং সব খাদ্যদ্রব্য যেই সব বস্তু বরাবর ছাড়া ক্রয়-বিক্রয় নিষিদ্ধ। সেই সবের উৎকৃষ্ট প্রকারের পছন্দীয় বস্তুর সহিত অপছন্দীয় রদ্দী প্রকারের বস্তু মিলিত করা যাহাতে ক্রয়-বিক্রয় জায়েয করার উদ্দেশ্যে এবং অবৈধ ও নিষিদ্ধ ব্যাপারকে হালাল করার মতলবে। যেমন নিকৃষ্ট বস্তুকে উৎকৃষ্ট বস্তুর সহিত মিশ্রিত করা হইল। ইহার দ্বারা সে উৎকৃষ্টের সঙ্গে নিকৃষ্ট মিশ্রয়কারী যে উৎকৃষ্ট মাল বিক্রয় করিতেছে উহার উৎকৃষ্টতার (অতিরিক্ত) মূল্য উত্তল করিয়া লইতেছে। তাই তিনি এমন নিকৃষ্ট বস্তু (অপর পক্ষকে) দিতেছে। যদি উহাকে আলাদা বিক্রয় করে তাহার অপর পক্ষ উহাকে গ্রহণ করিবে না এবং এই দিকে খেয়ালও করিবে না। এখন সে উহা গ্রহণ করিতেছে এই (নিকৃষ্ট মানের) মালের সহিত যে (উৎকৃষ্ট মানের) মাল সে পাইতেছে উহার আকর্ষণে। কারণ তাহার মালের তুলনায় তাহার সাথীর মাল উৎকৃষ্ট, কাজেই স্বর্ণ বা চাঁদি কিংবা খাদ্যদ্রব্যে কোনটিতেই অন্য কোন (নিকৃষ্ট) বস্তু মিশ্রিত করা জায়েয হইবে না; তবে যদি রদ্দী খাদ্যদ্রব্যের মালিক উহাকে অন্য (উত্তম) খাদ্যদ্রব্যের বিনিময়ে বিক্রয় করিতে চাহে তবে পৃথকভাবে উহা বিক্রয় করিবে এবং উহার সহিত (উৎকৃষ্ট) অন্য কোন দ্রব্য মিশ্ৰিত করিবে না, এইরূপ করিলে তবে ইহাতে কোন দোষ নাই, যদি এইরূপ (পৃথকভাবে বিক্রয়) হইয়া থাকে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1328
			}
		}
	]
}