{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "রেওয়ায়ত ৫৩. মালিক (রহঃ) বলেনঃ তাহার নিকট রেওয়ায়ত পৌছিয়াছে যে, কাসেম ইবন মুহাম্মদ (রহঃ) এবং ইবন মুয়াইকীব দাওসী (রহঃ) হইতেও অনুরূপ রেওয়ায়ত বর্ণিত হইয়াছে। মালিক (রহঃ) বলেনঃ আমাদের নিকটও হুকুম অনুরূপ। মালিক (রহঃ) বলেনঃ আমাদের নিকট সর্বসম্মত মাসআলা হইল, গমের বিনিময়ে গম, খুর্মার বিনিময়ে খুর্মা, খুর্মার বিনিময়ে গম, কিশমিশের বিনিময়ে খুর্মা এবং যাবতীয় খাদ্যশস্য নগদ ছাড়া বিক্রয় করা বৈধ হইবে না, (উল্লেখিত বস্তুর) কোন একটিতে যদি মেয়াদ প্রবেশ করে অর্থাৎ ধারে বিক্রয় করা হয় তবে ইহা বৈধ হইবে না (বরং) ইহা হারাম হইবে। (অনুরূপ) ব্যঞ্জনে ব্যবহৃত যাবতীয় বস্তুকেও নগদ ছাড়া বিক্রয় করা যাইবে না। মালিক (রহঃ) বলেনঃ খাদ্যদ্রব্য ব্যঞ্জনসমূহ হইতে কোন খাদ্যদ্রব্য কিংবা ব্যঞ্জনকে যদি উহা এক জাতীয় হয় তবে একের বিনিময়ে দুইটি বিক্রয় করা যাইবে না এবং এক মুদ্‌ গমের বিনিময়ে বিক্রয় করা যাইবে না। (অনুরূপ) এক মুদ্‌ খুর্মা বিক্রয় করা যাইবে না দুই মুদ খুর্মার বিনিময়ে, আর এক মুদ্‌ কিশমিশকে দুই মুদ্‌ কিশমিশের বিনিময়ে বিক্রয় করা যাইবে না। (উপরে বর্ণিত বস্তুসমূহের) সদৃশ যাবতীয় শস্য ও ব্যঞ্জনাদি যদি এক জাতীয় হয় (উহাকেও) (অনুরূপ)-বিক্রয় করা যাইবে না, নগদ বিক্রি হইলেও। কারণ ইহা হইতেছে চাঁদির বিনিময়ে চাঁদির, স্বর্ণের বিনিময়ে স্বর্ণ বিক্রয় করার মতো, এইসব ব্যাপারে কমবেশ করা জায়েয নহে, একমাত্র সমান সমান ও নগদ হইলেই ইহা হালাল হইবে। মালিক (রহঃ) বলেনঃ পরিমাপ পাত্র দ্বারা মাপা হয় কিংবা ওজন করিয়া দেওয়া হয় এইরূপ খাদ্য কিংবা পানীয় দ্রব্যের মধ্যে পার্থক্য পাওয়া গেলে এবং (জাতের) এই পার্থক্য প্রকাশ্য হইলে, তবে নগদ বিক্রয় হইলে উহার একটির বিনিময়ে দুইটি গ্রহণ করাতে কোন দোষ নাই। আর দুই সা গমের পরিবর্তে এক সা খুর্মা এবং দুই সা’ কিশমিশের বিনিময়ে এক সা খুর্ম এবং দুই সা’ ঘি-এর বিনিময়ে এক সা’ গম লওয়াতে কোন দোষ নাই। এই সবের মধ্য হইতে পরস্পর দুই জাতের দুইটি বস্তু উভয়ে পরস্পর ভিন্ন জাতের হইলে তবে সেই জাতীয় বস্তু হইতে একের বিনিময়ে দুই কিংবা ততোধিক নগদ বিক্রয় করাতে কোন দোষ নাই। কিন্তু ধারে হইলে ইহা বৈধ হইবে না। মালিক (রহঃ) বলেনঃ গমের স্তুপের বিনিময়ে গমের স্তুপ (ক্রয় করা) হালাল হইবে না, খুর্মার স্তুপের বিনিময়ে গমের স্তুপ নগদ ক্রয় করাতে কোন দোষ নাই। কারণ খেজুরের বিনিময়ে গম অনুমানে ক্রয় করাতে কোন দোষ নাই। মালিক (রহঃ) বলেনঃ যে কোন খাদ্যদ্রব্য ও ব্যঞ্জনের জাত পরস্পর বিরোধী হইলে এবং পার্থক্য স্পষ্ট হইলে তবে (সেইরূপ দ্রব্যের) এক অংশকে আর এক অংশের বিনিময়ে আন্দাজে (কিন্তু) নগদে ক্রয় করাতে কোন দোষ নাই, যদি উহাতে মেয়াদ (ধারে বিক্রয়) প্রবেশ করে তবে সেই বিক্রয়ে মঙ্গল নাই। ইহা আন্দাজে ক্রয় করা (এইরূপ) যেমন ইহার কিছু অংশকে চাঁদি বা স্বর্ণের বিনিময়ে অনুমানে বিক্রয় করা। মালিক (রহঃ) বলেনঃ যে ব্যক্তি খাদ্যশস্যের স্তুপ করিয়াছে এবং উহার পরিমাপ কার্য সম্পাদন করিয়াছে, অতঃপর উহাকে অনুমানে বিক্রয় করিয়াছে এবং ক্রেতার নিকট উহার পরিমাপ গোপন করিয়াছে। ইহা জায়েয হইবে না। তারপর ক্রেতা যদি ফেরত দিতে ইচ্ছা করে, তবে এই খাদ্যশস্য বিক্রেতাকে ফেরত দিবে, কেননা, বিক্রেতা তাহার নিকট উহার পরিমাপ গোপন করিয়াছে, (এইভাবে) সে ক্রেতাকে ধোঁকা দিয়াছে। অনুরূপ খাদ্যদ্রব্য হউক বা অন্য কিছু বিক্রেতা যে বস্তুর পরিমাপ ও সংখ্যা জানে অতঃপর উহাকে (ক্রেতার কাছে) আন্দাজে বিক্রয় করে, (অথচ) ক্রেতা উহা অবগত নহে, তবে ক্রেতা ইচ্ছা করিলে উক্ত বস্তু বিক্রেতার নিকট ফেরত দিবে। এইরূপ বিক্রয় হইতে আহলে ইলম (উলামা) সর্বদা নিষেধ করিতেন। মালিক (রহঃ) বলেনঃ দুই রুটির বিনিময়ে এক রুটি, ছোট রুটির বিনিময়ে বড় রুটি, যাহার একটি অপরটি হইতে বড়, গ্রহণ করা জায়েয নহে। তবে যদি উভয়ে সমান সমান হইবে বলিয়া প্রবল ধারণা হয় তবে ওজন করা না হইলেও ইহাতে কোন দোষ নাই। মালিক (রহঃ) বলেনঃ দুই মুদ পনিরের বিনিময়ে এক মুদ পনির এবং এক মুদ দুধ গ্রহণ করা জায়েয নহে। ইহা এইরূপ যেইরূপ আমরা পূর্বে বর্ণনা করিয়াছি; খেজুরের ব্যাপারে যাহার তিন সা’ আজওয়ার বিনিময়ে বিক্রয় করা হইয়াছে দুই সা’ কাবীস আর এক সা’ রদ্দী খেজুর। যখন তাহাদের একজন অপর জনকে বলিল তিন সা’ আজওয়ার বিনিময়ে দুই সা’ কাবীস বিক্রয় করা জায়েয নহে তখন তিনি ইহা (আর এক সা’ রদ্দী খেজুর মিশাইবার কাজ) করিলেন বিক্রি শুদ্ধ করার জন্য। দুধওয়ালা পনিরের সঙ্গে দুধ মিশাইয়াছে। ইহা এই জন্য যে, তাহার সাথীর পনিরের তুলনায় তাহার পনীরের বাড়তিটুকু উশুল করিবে। মালিক (রহঃ) বলেনঃ গমের বিনিময়ে আটা সমান সমান হইলে কোন দোষ নাই। আর যদি অর্ধ মুদ আটা এবং অর্ধ মুদ গম একত্র করিয়া উহাকে এক মুদ গমের বিনিময়ে বিক্রয় করা হয় তবে ইহা যেইরূপ আমরা পূর্বে বর্ণনা করিয়াছি সেইরূপ হইবে। ইহা জায়েয হইবে না। কারণ সে গমের সহিত আটা মিশাইয়া উৎকৃষ্ট গমের বাড়তিটুকু (শ্রেষ্ঠত্বের মূল্য) আদায় করিল। কাজেই ইহা জায়েয হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1342
			}
		}
	]
}