{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "রেওয়ায়ত ৮৭. মালিক (রহঃ) বলেনঃ এক ব্যক্তি বিভিন্ন জাতের বস্ত্র বিক্রয় করিতেছে, তথা হইতে কয়েকটি বস্ত্র উহাদের চিহ্ন উল্লেখ করিয়া বাদ দিয়া দিল যদি সেই বর্ণিত চিহ্নের বস্ত্র অন্যান্য বস্ত্র হইতে পছন্দ করার শর্ত করিয়া থাকে তবে উহাতে কোন দোষ নাই, আর যদি ঐভাবে পছন্দ করিয়া নির্ধারিত বস্ত্ৰ হইতে বস্ত্র লওয়ার বিক্রেতা শর্ত না করিয়া থাকে, ইস্তিসনার শর্ত করার সময়, তবে আমি মনে করি যে, ক্রেতা যেই বস্ত্র ক্রয় করিয়াছে উহর সংখ্যাতে বিক্রেতা শরীক থাকিবে। কারণ অনেক সময় এইরূপ হয় যে, দুইটি বস্ত্রের (رقم)[1] নিশন বা চিহ্ন এক কিন্তু উহাদের মূল্যের মধ্যে তফাৎ রহিয়াছে। মালিক (রহঃ) বলেনঃ খাদ্যদ্রব্য ইত্যাদিতে শরীকানা, তাওলিয়া ও ইকালাতে আমাদের মতে কোন দোষ নাই; উহা আয়ত্তে আনুক কিংবা না আনুক। যদি শরীকানার মূলধন নগদ হয় এবং উহাতে অতিরিক্ত কিছু না থাকে পূর্ণ মূল্য হইতে কমানো না হয় ও মূল্য পরিশোধে বিলম্ব না করাকে যদি শরীকানাতে মূল্য বৃদ্ধি বা মূল্য কমানো কিংবা বিলম্ব করা বিক্রেত বা ক্রেতার পক্ষ হইতে, তবে উহা নূতনরূপে বেচাকেনা বলিয়া গণ্য হইবে। যেই আহকাম বেচাকেনাকে হালাল করে ইহাকেও সেই বিধান হালাল করিবে, আর যে আহকাম ক্রয়-বিক্রয়কে হারাম করে সেই বিধান ইহাকেও হারাম করিবে। ইহা প্রকৃতপক্ষে অংশীদারিত্ব ও তাওলিয়া কিংবা ইকালা নহে। মালিক (রহঃ) বলেনঃ যে ব্যক্তি (যেমন খালিদ) পণ্য ক্রয় করে; (বকর হইতে) বস্ত্র বা ক্রীতদাস (অথবা অন্য কোন পণ্য) এবং নিশ্চিতরূপে ক্রয় করে (কোন শর্ত উহাতে না থাকে) অতঃপর জনৈক ব্যক্তি (যেমন মাইমুনা) উক্ত পণ্যে তাহাকে শরীক করার অনুরোধ জানাইল। সে (খালিদ) উহাকে (মায়মুনাকে) অংশীদারিত্ব প্রদান করিল এবং তাহারা উভয়ে পণ্যের মালিককে মূল্য নগদ পরিশোধ করিল। অতঃপর পণ্যে এমন কোন কারণ উদ্ভব হইল যাহাতে উভয়ের মালিকানা হইতে পণ্য বাহির হইয়া গেল। তবে যে তাহাকে শরীক করিয়াছিল সেই ব্যক্তি (খালিদ) হইতে যাহাকে পণ্যে শরীক কয় হইয়াছিল সে (অর্থাৎ মায়মুনা) মূল্য ফেরত লইবে এবং যে পণ্য বিক্রয় করিয়াছে তাহার নিকট (খালিদের নিকট) মূল্য দাবি করিবে। তবে যে ব্যক্তি শরীক করিয়াছে সে (খালিদ) যাহাকে শরীক করিয়াছে তাহার নিকট (মায়মুনার নিকট) (প্রথম) বিক্রয়ের সময় এবং প্রথম বিক্রেতার বেচাকেনার সময়, বেচাকেনার মজলিশ পরিবর্তিত হওয়ার পূর্বে যদি এই মর্মে শর্তারোপ করিয়া থাকে, “আপনার দায়িত্ব যাহার নিকট হইতে আপনি ক্রয় করিলেন তাহার উপর।” পক্ষান্তরে যদি ক্রয়-বিক্রয়ের মজলিশ বদল হয় এবং প্রথম বিক্রেতা (অর্থাৎ বকর) মৃত্যুবরণ করে, তবে ক্রেতা ব্যক্তির (অর্থাৎ খালিদের) শর্ত বাতিল বলিয়া গণ্য হইবে এবং যাবতীয় দায়িত্ব তাহার উপরই ন্যস্ত থাকিবে। মালিক (রহঃ) বলেনঃ এক ব্যক্তি অপর ব্যক্তিকে বলিল-আপনি এই পণ্য ক্রয় করুন আপনার ও আমার মধ্যে শরীকানায়। আর আমার অংশের মূল্য আপনি নগদ পরিশোধ করুন, আমি আপনার অংশেরও বিক্রয়ের দায়িত্ব গ্রহণ করিরাম, ইহা জায়েয নহে। যখন সে বলিল, আমার পক্ষ হইতে আপনি নগদ মূল্য পরিশোধ করুন আমি আপনার অংশের পণ্য বিক্রয় করিয়া দিব। ইহা হইতেছে ঋণ (سلف) যাহা সে উহাকে সলফস্বরূপ প্রদান করিল এই শর্তে যে, সে এই পণ্য তাহার জন্য বিক্রয় করিয়া দিবে। যদি সেই পণ্য নষ্ট হইয়া যায় অথবা হারাইয়া যায় তবে নগদ মূল্য পরিশোধকারী তাহার শরীক হইতে সেই মূল্য নগদ উশুল করিবে, ইহাই (অতিরিক্ত) মুনাফা আকর্ষণকারী সলফ বা ঋণ (যাহা হারাম)।মালিক (রহঃ) বলেনঃ যদি কোন ব্যক্তি কোন পণ্য ক্রয় করিয়াছে এবং উক্ত ক্রয় তাহার জন্য ওয়াজিব হইয়াছে (অর্থাৎ বাধ্যতামূলক হইয়াছে) তারপর অন্য এক ব্যক্তি বলিল, আমাকে এই পণ্যের অর্ধেকের মধ্যে শরীক কর। আমি উহা পূর্ণ বিক্রয় করিয়া দিব, উহা হালাল হইবে। ইহাতে কোন দোষ নাই। ইহার ব্যাখ্যা এই—ইহা একটি নূতন ক্রয়-বিক্রয় বিক্রেতা উহার নিকট অর্ধেক পণ্য এই শর্তে বিক্রয় করিয়াছে যে, ক্রেতা তাহার অংশের বাকী অর্ধেক পণ্য বিক্রয় করিয়া দিবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1371
			}
		}
	]
}