{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"35": "Pre-emption in Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1397,
			"arabicnumber": 1397,
			"text": "রেওয়ায়ত ৩. মালিক (রহঃ) বলেনঃ সুলায়মান ইবন ইয়াসার (রহঃ) হইতেও এইরূপ বর্ণিত আছে। মালিক (রহঃ) বলেনঃ যদি কোন ব্যক্তি কয়েকজন একযোগে মালিক এমন কোন জমির এক অংশ কোন জন্তু অথবা গোলামের পরিবর্তে কিংবা এই ধরনের কোন মালের (যেমন জিনিসপত্র) পরিবর্তে খরিদ করে, অতঃপর শরীকদার নিজ শুফ’আ নেওয়ার জন্য আসে কিন্তু এই সময়ে ঐ গোলাম অথবা দাসী মারা গিয়া থাকে এবং তাহাদের মূল্য কত ছিল কেহ জানে না। কিন্তু খরিদ্দার বলে যে, তাহার মূল্য একশত দীনার ছিল এবং শুফ’আ দাবিদার পঞ্চাশ দীনার বলে, তবে খরিদ্দার হইতে এই ব্যাপারে কসম (শপথ) গ্রহণ করা হইবে যে, উহার মূল্য একশত দীনার ছিল। তাহার পর শুফ’আ দাবিদারের ইচ্ছা হইলে উহা গ্রহণও করিতে পারে অথবা দাবি ছাড়িয়াও দিতে পারবে। কিন্তু যদি শুফআর দাবিদার তাহার দাবির সপক্ষে প্রমাণ করে যে, উক্ত দাস দাসীর মূল্য খরিদ্দার যাহা বলে তাহা হইতে কম ছিল, তবে তাহার কথা মানিতে হইবে। মালিক (রহঃ) বলেনঃ যদি কেহ একযোগে কয়েক ব্যক্তি মালিক এমন ঘর অথবা জমির নিজ অংশ দান করিয়া দেয় কিন্তু যাহাকে দান করা হইয়াছে সে দানকারীকে তাহার মূল্য দিয়া দেয়, তবে শুফআর দাবি করার অধিকার শরীকদারদের থাকিবে এবং গ্রহীতাকে টাকা-পয়সা ফেরত দিয়া তাহা লইবার ইখতিয়ার শরীকদারদের থাকিবে, দীনার অথবা দিরহাম যাহা দিয়া হউক মূল্য শোধ করিবে। মালিক (রহঃ) বলেন যে, যদি কেহ তাহার সঙ্গে অন্যেরাও মালিক এমন ঘর অথবা জমি হেবা (দান) করে এবং এখনও কোন বিনিময় গ্রহণ করে নাই এবং বিনিময় তলবও করে নাই, এমন সময় শরীকদার যদি চাহে যে, উহার বিনিময় দিয়া দখল করিবে তবে উহার বিনিময় প্রদান না করিয়া দখল করা জায়েয হইবে না। যদি বিনিময় দিয়া দেয় তবে উহা শুফ’আ দাবিকারীর জন্য বৈধ হইবে এই শর্তে যে, পূর্ণ মূল্য সে দিয়া দিবে ও দখল লইবে। মালিক (রহঃ) বলেনঃ যে কেহ যদি শরীকী জমির এক ভাগ বাকী খরিদ করে, অতঃপর শরীকদারদের কেহ যদি শুফআর দাবি করে যদি সে ধনী হয় তবে ঐ মূল্যেই এবং ঐ ওয়াদা অনুযায়ী নিবে, আর যদি দরিদ্র হয় যে, ঐ মূল্য ওয়াদা অনুযায়ী দিতে পারিবে না তবে কোন একজন নির্ভরযোগ্য মানুষ, যে খরিদ্দারের সমতুল্য, জামিন হইলে লইতে পারিবে। মালিক (রহঃ) বলেন যে, শুফ'আর দাবিদার যদি জমির বেচাকেনার সময় অনুপস্থিত থাকে তবে তাহার শুফ'আর অধিকার বাতিল হইবে না, যদিও সে অনেক দিন গায়েব থাকে। আর গায়েব থাকার কোন সীমা আমাদের নিকট নাই যে, এতদিন গায়েব থাকিলে শুফ'আর অধিকার থাকিবে না। মালিক (রহঃ) বলেনঃ এক ব্যক্তির কয়েকজন সন্তান কোন জমির ওয়ারিসসূত্রে মালিক হইল, তাহার পর তাহাদের কাহারও সন্তান জন্ম হওয়ার পর সে মারা গেল এবং তাহার এক সন্তান মৃত পিতার প্রাপ্য অংশ বিক্রয় করিতে চাহে, তবে বিক্রেতার ভাই তাহার চাচার চাইতে শুফ'আর অধিকার বেশি রাখে। মালিক (রহঃ) বলেন যে, আমাদের নিকটও হুকুম অনুরূপ। মালিক (রহঃ) বলেনঃ যদি শুফআর শরীকদারদের মধ্যে কয়েকজন দাবি করে তবে বিক্রীত সম্পদ হইতে প্রত্যেকে হিস্যা অনুযায়ী লইবে। যদি কম হয় কমই নেবে আর বেশি হইলে বেশিই নেবে। ইহা তখনই করিবে যখন তাহাদের মধ্যে ঝগড়া বাঁধে, অথবা একজন তাহার সঙ্গীর নিকট হইতে তাহার হিস্যা খরিদ করিয়া কোন শরীকদারকে বলিবে যে, আমি আমার হিস্যা পরিমাণ শুফ’আ লইব। অতঃপর খরিদ্দার বলিবে যে, তুমি যদি চাহ তবে সবটুকুরই শুফ’আ লইয়া যাও, আমি তোমাকে সবই দিয়া দিতেছি। কিংবা শুফআর দাবিও পরিহার কর। এই অবস্থায় শুক'আর দাবিদারের উচিত পূর্ণ হিস্যা খরিদ্দার হইতে খরিদ করিয়া লওয়া অথবা শুফ'আর দাবি পরিত্যাগ করা। যদি পূর্ণ নিতে চায় তবে সে বেশি হকদার, অন্যথায় সে হকদার হইবে না। মালিক (রহঃ) বলেনঃ এক ব্যক্তি কিছু জমি খরিদ করিল, অতঃপর উহা আবাদ করিল ও উহাতে ঘর নির্মাণ করিল অথবা কূপ খনন করিল। তাহার পর এক ব্যক্তি আসিয়া হক দাবি করিল এবং শুফআর মাধ্যমে উহা নেওয়ার ইচ্ছা করিল, তবে তাহার শুফ’আ দাবির কোন অধিকার নাই যতক্ষণ বানানো ঘর অথবা কূপ খননের মূল্য আদায় না করে। যদি উহার মূল্য আদায় করিয়া দেয় তবে তাহার শুফআর দাবি গ্রাহ্য হইবে। অন্যথায় তাহার কোন শুফ'আর দাবি চলিবে না। মালিক (রহঃ) বলেনঃ এক ব্যক্তি শরীকের ঘর অথবা জমি বিক্রয় করিয়া জানিতে পারিল যে, শুফআর দাবিদার শুফ’আ দাবি করবে। তাই ক্রেতা মূল্যের ব্যাপারে মিথ্যার আশ্রয় লইতে চাহিল এবং বিক্রেতাও তাহাই করিল। তাহাতে শুফ'আর দাবিদারের শুফ’আ নষ্ট হইবে না। এই ব্যাপারে শুফ'আর দাবিদারই শুফআর অধিকারী, যে মূল্যে বিক্রয় করিয়াছে তাহা আদায় করার পর। মালিক (রহঃ) বলেনঃ যদি কেহ শরীকী ঘর অথবা জমির এক অংশ ও ১টি জন্তু এবং কিছু জিনিসপত্র একই বৈঠকে আফদে (দাম) খরিদ করে, অতঃপর শুফ’আ দাবিকারীর শুফ’আ দাবি করে, শুধু ঘরে অথবা জমিতে, কিন্তু খরিদ্দার বলে যে, আমি যাহা খরিদ করিয়াছি সকলই নিয়া যাও, কারণ আমি সবই খরিদ করিয়াছি। তখন শুফআর দাবিদার জমি ও ঘরেরই শুফ'আ লইবে, তাহার হিস্যা যতদূর আসে। তখন ঐ পূর্বের মূল্যের হিসাবে প্রত্যেকটি জিনিসের মূল্য ধরিতে হইবে পৃথকভাবে। অতঃপর শুফ'আ লইয়া যাইবে ঐ খরিদকৃত আসল দামের হিসাবে, যাহা হয় তাহা দিয়া। জন্তু ও জিনিসপত্র কোনটাই নেবে না, কিন্তু সে যদি ইচ্ছা করিয়া সবগুলি লইয়া যায় তবে উহাও জায়েয। মালিক (রহঃ) বলেনঃ শরীকী জমির এক অংশ কেহ বিক্রয় করিল, অতঃপর যাহাদের শুফ'আর অধিকার আছে তাহদের কেহ খরিদ্দারের পক্ষে দাবি প্রত্যাখ্যান করিল কিন্তু তাহাদের আর কেহ তাহা দাবি করিয়া বসিল, এই অবস্থায় খরিদ্দারের পূর্ণ অংশ তাহার নিতে হইবে। ইহা হইবে না যে, সে তাহার ভাগের অংশই নিবে এবং বাকী অংশ ছাড়িয়া দিবে। মালিক (রহঃ) বলেনঃ যদি অনেকেই মালিক এমন একটি ঘরের কোন এক শরীক তাহার অংশ বিক্রয় করিল। একজন শরীকদার ছাড়া আর সকলেই অনুপস্থিত। অতঃপর সেই উপস্থিত শরীকদারকে এই মর্মে জিজ্ঞাসা করা হইবে যে, শুফ'আর দাবিতে আপনি ইহা লইয়া যান অথবা ছাড়িয়া দেন; সে বলিল, আমি আমার অংশ নিতেছি, এবং শরীকদারদের অংশ ছাড়িয়া দিতেছি, তাহারা হাযির হওয়ার পর যদি তাহাদের অংশ তাহারা নেয় তবে তো ভাল, না হয় আমি সবটুকু লইব। এই পন্থা জায়েয নহে, হয়ত সে পূর্ণ হিস্যা নেবে, না হয় পূর্ণ দাবি ছাড়িয়া দেবে। অতঃপর যদি অন্যান্য শরীকদার আসে তবে তাহার নিকট হইতে তাহারা অংশ লইবে অথবা ছাড়িয়া দেবে। আর উক্ত ব্যক্তি যদি তাহা গ্রহণই না করে তবে তাহার আর শুফ'আরর অধিকার থাকিবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1397
			}
		}
	]
}