{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"35": "Pre-emption in Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "রেওয়ায়ত ৪. উসমান ইবন আফফান (রাঃ) বলেন যে, জমির সীমানা নির্ধারিত হইয়া গেলে তখন আর উহাতে শুফ'আ চলে না এবং কূপের মধ্যেও শুফ’আ চলে না, আর চলিবে না নর খেজুর গাছেও। মালিক (রহঃ) বলেন যে, আমাদের নিকট এই হুকুমই গ্রহণযোগ্য। মালিক (রহঃ) বলেনঃ পথের মধ্যে শুফ'আ চলিবে না, তাহা বন্টনের যোগ্য হউক অথবা বন্টনের যোগ্য নাই হউক। মালিক (রহঃ) বলেনঃ আমাদের কাছে ঘরের বারান্দায়ও শুফ'আ চলিবে না, তাহা বন্টনের উপযোগী হউক বা না হউক। মালিক (রহঃ) বলেন, যদি কেহ অনেকে মালিক এমন কোন জমির কোন অংশ খেয়ারের শর্তে খরিদ করে এবং বিক্রেতার শরীকদারগণ ইচ্ছা করিল যে, তাহাদের শরীকদার যাহা বিক্রয় করিয়াছে তাহা শুফআর মাধ্যমে লইয়া লইবে, খরিদ্দারের ইখতিয়ার পূর্ণ হইবার পূর্বে এইরূপ ক্ষেত্রে তাহদের জন্য শুফ'আ জায়েয হইবে না। যতক্ষণ খরিদ্দারের খরিদ পাকাপোক্ত না হয়, অতঃপর যদি তাহার খরিদ পাকাপোক্ত হয় তবেই তাহাদের জন্য শুফ’আ জায়েয হইবে। মালিক (রহঃ) বলেনঃ যদি এক ব্যক্তি একটি জমি খরিদ করিয়া অনেক দিন পর্যন্ত নিজ দখলে রাখে। অতঃপর এক ব্যক্তি আসিয়া তার মীরাসের দাবি করিয়া শুফ'আর অধিকার দাবি করিল। যদি তাহার মীরাসের হক প্রমাণিত হয় তবে তাহার জন্য শুফআর দাবি থাকিবে। এই সময় যাহা উৎপন্ন হইয়াছে তাহা খরিদ্দারের থাকিবে, যে দিন হইতে দ্বিতীয় জনের হক প্রতিষ্ঠিত হয় সেই দিন পর্যন্ত। কেননা যদি জমি বন্যায় নষ্ট হইয়া যাইত তবে সে তাহারই অধীনে থাকিত। আর যদি অনেক দিন চলিয়া যায় অথবা সাক্ষী কিংবা বিক্রেতা ও ক্রেতা মরিয়া যায় অথবা তাহারা জীবিতই, কিন্তু বেচাকেনার মূল্য অনেক দিন অতিবাহিত হওয়ার কারণে ভুলিয়া গিয়াছে এই অবস্থায় তাহার শুফ’আ চলিবে না। কিন্তু তাহার (মীরাসের) হক পাইবে যাহা প্রমাণিত হয়। আর যদি ব্যাপার অন্য রকম হয় যেমন বেশি দিন অতিবাহিত হয় নাই কিন্তু বিক্রেতা বিক্রয়কে এইজন্য গোপন করিতেছে যেন প্রতিবেশী শুফ'আর দাবি না করিতে পারে; তবে আসল জমির দাম যাচাই করিয়া দেখিতে হইবে, তাহার দাম কত। অতঃপর জমি যদি আরো বাড়িয়া থাকে - যেমন ঘরবাড়ি বাগ-বাগিচা তবে তাহার মূল্য আদায় করিয়া প্রতিবেশী শুফ'আর দাবিতে লইয়া লইবে। মালিক (রহঃ) বলেনঃ জীবিতদের সম্পত্তির নয়, মৃত ব্যক্তিদের সম্পত্তিতেও শুফ’আ চলিবে। কিন্তু যদি অংশীদাররা অংশ বন্টন করিয়া নেয় এবং বিক্রয় করিয়া ফেলে তবে আর শুফ'আ চলিবে না। মালিক (রহঃ) বলেনঃ আমার মতে গোলাম, বাদী, উট, গরু, বকরী ও জীব-জন্তুতে এবং কাপড়-চোপড় ও কূপে যাহার আশেপাশে জমি নাই শুফআর দাবি চলিবে না, কেননা শুফ’আ তো ঐখানেই হইয়া থাকে যেখানে সীমানা নির্ধারিত করা যায়। সুতরাং যেখানে ভাগবাটোয়ারা চলে না সেখানে শুফ আও চলিবে না। মালিক (রহঃ) বলেনঃ যদি কেহ এমন জমি খরিদ করে যেখানে মানুষের শুফ’আর অধিকার চলে, তবে তাহার উচিত সে যেন সমস্ত প্রতিবেশীকে বিচারকের নিকট লইয়া যায় এবং বলে যে, হয়তো তোমরা লইয়া যাও অথবা শুফ'আর দাবি পরিত্যাগ কর। আর সে যদি সকল প্রতিবেশীকে লইয়া যায় নাই কিন্তু বেচাকেনার বিষয় (সময় মতো) সকল প্রতিবেশীই খবর পাইয়াছিল এবং এতদসত্ত্বেও অনেক দিন পর্যন্ত শুফআর দাবি করে নাই, অতঃপর শুফ'আর দাবি করিলে তাহাদের দাবি অগ্রাহ্য হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1398
			}
		}
	]
}