{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1467,
			"arabicnumber": 1467,
			"text": "রেওয়ায়ত ৫. মালিক (রহঃ) ইবন শিহাব (রহঃ)-কে বলিতে শুনিয়াছেন, ইহা প্রচলিত সুন্নাত (নিয়ম) যে, ক্রীতদাস আযাদ হইলে মাল তাহার পশ্চাদগামী হইবে। মালিক (রহঃ) বলেনঃ আরও স্পষ্ট করিয়া এই দৃষ্টান্তটি বলা যায় যে, ক্রীতদাস আযাদ হইলে তাহার মালও তাহার সাথে থাকিবে, কারণ মুকাতাব (যাহাকে মালের বিনিময়ে আযাদী প্রদানের প্রতিশ্রুতি দেওয়া হইয়াছে)-কে (মালের বিনিময়ে) আযাদীর প্রতিশ্রুতি দেওয়া হইলে তবে শর্ত না করিলেও মাল তাহারই থাকিবে। ইহা এইজন্য যে, কিতাবতের কার্য পূর্ণতা লাভ করিলে (অর্থাৎ অর্থ আদায় করিলে) উহা হুবহু স্বত্বাধিকার (ولاء) এর চুক্তির মতো গণ্য হইবে, যেমন ক্রীতদাসকে আযাদ করিয়া দিলে সে স্বত্বাধিকার লাভ করে তদ্রুপ বদলে কিতাবত (আযাদীর জন্য নির্ধারিত অর্থ) আদায় করিলে ক্রীতদাস (مكاتب) আযাদ হইয়া যায় এবং তাহার সম্পদের স্বত্বাধিকারী সে নিজেই হইবে। আর ক্রীতদাস ও মুকাতাব-এর সম্পদ তাহদের সন্তান-সন্ততির মতো নহে, কারণ তাহাদের সন্তানগণ তাহাদেরই মতো (কর্তাগণ উহাদের মালিক বটে) উহারা তাহাদের সম্পদের মতো নহে অর্থাৎ সম্পদের মতো ক্রীতদাস ও মুকাতাব দাস সন্তানদের মালিক হইবে না। কারণ নিয়ম এই, যেই নিয়মে কোন দ্বিমত নাই অর্থাৎ ক্রীতদাস আযাদ হইলে তাহার মাল তাহার পশ্চাদানুসরণ করিবে, কিন্তু সন্তান তাহার পশ্চাদগামী হইবে না। আর মুকাতাব-এর সহিত যখন কিতাবত করা হয়, তখন তাহার মালও তাহার পশ্চাদানুসরণ করিবে, কিন্তু তাহার সন্তান তাহার পশ্চাদগামী হইবে না। মালিক (রহঃ) বলেনঃ যাহা ইহাকে আরও স্পষ্ট করে তাহা হইল, ক্রীতদাস ও মুকাতাব তাহারা উভয়ে দেউলিয়া হইলে তাহাদের সম্পদ ও তাহাদের উম্মে ওয়ালাদগণকে গ্রহণ করা হইবে কিন্তু তাহাদের সন্তানগণকে বিনিময়ে গ্রহণ করা হইবে না। কারণ সন্তান তাহদের মাল নহে। মালিক (রহঃ) বলেনঃ আর একটি নজীর ইহাকে স্পষ্ট করিয়া তোলে। তাহা হইল, যদি ক্রীতদাসকে এই শর্তে বিক্রয় করা হয় যে তাহার মাল ক্রেতা পাইবে, তবে ক্রীতদাসের সন্তান মালের অন্তর্ভুক্ত হইবে না। মালিক (রহঃ) বলেনঃ আরও যে নজীর ইহাকে স্পষ্ট করে তাহা হইল এই যে, ক্রীতদাস কাহাকেও জখম করিলে, ক্রীতদাস ও উহার মাল বিনিময়ে লওয়া হইবে, কিন্তু (বিনিময়ে) সন্তানকে গ্রহণ করা হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1467
			}
		}
	]
}