{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"38": "Setting Free and Wala'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1484,
			"arabicnumber": 1484,
			"text": "রেওয়ায়ত ২১. রবী'আ ইবন আবদির রহমান (রহঃ) হইতে বর্ণিত, যুবাইর ইবনুল আওয়াম (রাঃ) জনৈক ক্রীতদাসকে খরিদ করিয়া উহাকে আযাদ করিয়াছিলেন। সেই ক্রীতদাসের কয়েকটি ছেলে ছিল আযাদ স্ত্রীর ঔরসের। যুবাইর (রাঃ) যখন উহাকে আযাদ করিলেন তখন তিনি বলিলেন, ইহারা আমার মাওয়ালী। [موالى আযাদী প্রদান সূত্রে ইহাদের উপর আমার অভিভাবকত্ব উত্তরাধিকার প্রতিষ্ঠিত হইয়াছে -তাই ইহারা এখন আমার অধীনস্থ ও অধিকারভুক্ত। অন্যদিকে এই সন্তানদের জননীকে যাহারা আযাদ করিয়াছিলেন। তাহারা বলিলেনঃ ইহারা আমাদের অধিকারভুক্ত (موالى)]। অতঃপর তাহারা বিবাদ লইয়া উসমান ইবন আফফান (রাঃ)-এর নিকট গেলেন। উসমান (রাঃ) উহাদের অভিভাবকত্ব- এর ফয়সালা দিলেন যুবাইরের পক্ষে। মালিক (রহঃ)-এর নিকট রেওয়ায়ত পৌছিয়াছে যে, সাঈদ ইবন মুসায়্যাব (রহঃ)-কে প্রশ্ন করা হইল জনৈক ক্রীতদাসী সম্বন্ধে, যাহার কয়েকটি ছেলে রহিয়াছে আযাদ স্ত্রীর ঔরসে। উহাদের স্বত্বাধিকার কাহার জন্য হইবে। সাঈদ বললেন, যদি আযাদী না পাওয়া অবস্থায় উহাদের পিতার মৃত্যু হয় তবে উহাদেৱ অভিভাবকত্ব হইবে তাহাদের মাতার মাওলাদের (আযাদী দাতার) জন্য। মালিক (রহঃ) বলেনঃ তদ্রূপ অনারব মুসলিম লি'আনকারী (লি'আনকারী অধ্যায়) স্ত্রীলোকের সন্তান ও তাহার (সন্তানের মাতা) মাওলার দিকে সম্পর্কিত হইবে। তাই মাতার কর্তারা এই ছেলের মাওলা হইবে। যদি সে মারা যায় তবে তাহারা উহার মীরাস লাভ করিবে। সে কোন অপরাধ করিলে তাহারা উহার পক্ষ হইতে খেসারত বা ক্ষতিপূরণ দিবে। আর উহার পিতা যদি উহার নসব স্বীকার করিয়া লয় তবে উহাকে পিতার দিকে সম্পর্কিত করা হইবে। এবং উহার স্বত্বাধিকার তাহার পিতার অভিভাবকত্ব (موالى) লাভ করিবে। তাহার মীরাসও উহাদের জন্য হইবে, আর তাহার অপরাধের খেসারতও হইবে উহাদের উপর এবং (স্বীকারোক্তির পর) ছেলের পিতাকে (অপবাদের শাস্তিতে) বেত্ৰাঘাত করা হইবে। মালিক (রহঃ) বলেনঃ তদ্রূপ আরব লি'আনকারী স্ত্রীলোকের স্বামী যে স্ত্রীকে সন্তানের ব্যাপারে অপবাদ দিয়াছে সে যদি উহার ছেলের নসব (জন্মসূত্র) স্বীকার করে তবে সে ছেলে ঐ রূপ মর্যাদাই লাভ করিবে। কিন্তু (পার্থক্য এই থাকিবে যে,) এই ছেলের মাতা ও ভগ্নীদের মীরাস বরাদের পর অবশিষ্ট মীরাস যদি তাহার পিতার সহিত সে যুক্ত না হয় তবে সাধারণ মুসলিমদের জন্য নির্ধারিত হইবে। পক্ষান্তরে লি'আনকারী স্ত্রীলোকের ছেলের মীরাস তাহার অর্থাৎ মাতার মাওলারা লাভ করিবে পিতা কর্তৃক ছেলের নসব স্বীকার করার পূর্ব পর্যন্ত। কারণ এই ছেলের নসব (জন্মসূত্র) নাই, ফলে তাহার কোন আসাবা অর্থাৎ মীরাস লাভ করে এমন কোন আত্মীয়-স্বজন নাই। আর যদি নসব প্রমাণিত হয় তবে তাহার মীরাস আসাবাগণ হইবে । মালিক (রহঃ) বলেনঃ আমাদের নিকট ইজমাঈ (اجماعى) সর্বজনগৃহীত যাহাতে কোন ইখতিলাফ নাই— মাসয়ালা হইল এই, ক্রীতদাসের পুত্ৰগণ আযাদ স্ত্রীর ঔরসের হইলেও ক্রীতদাসের পিতা আযাদ হইলে, তবে পুত্রদের বড় বাপ অৰ্থাৎ দাদা স্বীয় ছেলের এমন পুত্রদের (নাতির) যাহারা আযাদ এবং আযাদ মাতার গর্ভে যাহাদের জন্ম, তাহাদের মীরাস লাভ করিবে, যতদিন পিতা ক্রীতদাস থাকে ততদিন। যদি তাহাদের পিতা আযাদ হইয়া যায় তবে পিতার মাওলাগণ অভিভাবকত্ব লাভ করিবে। আর যদি ক্রীতদাস থাকিতেই তাহার মৃত্যু হয় তবে মীরাস অধিকার (ولاء) দাদার জন্য থাকিবে। আর যদি ক্রীতদাস পিতার আযাদ দুই পুত্র থাকে এবং উহাদের একজন মারা যায় তাহাদের পিতা গোলাম থাকা অবস্থায় তবে পুত্রের বড় বাপ-দাদা মীরাস ও অভিভাবকত্ব (ولاء) দুইটিই লাভ করিবে। মালিক (রহঃ) বলেনঃ অন্তঃসত্ত্ব অবস্থায় যে ক্রীতদাসীকে আযাদ করা হইল এবং তাহার স্বামী তখনও (অন্যের) দাস। অতঃপর সন্তান প্রসবের পূর্বে অথবা পরে তাহার স্বামীকে আযাদ করা হয় তবে পেটে যাহা ছিল উহার অর্থাৎ সন্তানের অভিভাবকত্ব যে তাহার জননীকে আযাদ করিয়াছে সে-ই লাভ করিবে। কারণ এই সন্তান তাহার মাতাকে আযাদী দেওয়ার পূর্বের, ফলে দাসত্ব তাহাকে স্পর্শ করিয়াছে। সে ঐ সন্তানতুল্য মর্যাদার অধিকারী নহে যাহাকে তাহার জননী গর্ভে ধারণ করিয়াছে আযাদী লাভের পরে। কারণ আযাদী লাভের পর জননী সেই সন্তান গর্ভে ধারণ করিয়াছে। সেই সন্তানের পিতা তাহার অভিভাবকত্ব প্রাপ্ত হইবে, যদি পিতাকে আযাদ করা হইয়া থাকে। মালিক (রহঃ) বলেনঃ যে ক্রীতদাস গোলাম আযাদ করার জন্য তাহার কর্তার অনুমতি প্রার্থনা করিয়াছে, কর্তা তাহাকে অনুমতি দিয়াছে তবে আযাদীপ্রাপ্ত ক্রীতদাসের অভিভাবকত্ব এই ক্রীতদাসের কর্তা লাভ করিবে, এই (আযাদীপ্রাপ্ত) ক্রীতদাসের অভিভাবকত্ব ও উত্তরাধিকার তাহার কর্তা যে তাহাকে আযাদ করিয়াছে সে পাইবে না, যদিও সে (পরে) আযাদী লাভ করিয়া থাকে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 1484
			}
		}
	]
}