{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"39": "The Mukatab"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1495,
			"arabicnumber": 1495,
			"text": "রেওয়ায়ত ৯. মালিক (রহঃ) বলেনঃ তিনি রবী'আ ইবন আবি 'আবদির রহমান এবং আরও কিছু আলিমকে বলিতে শুনিয়াছেন, ফারাফিসা ইবন উমাইর আল হানাফী (রহঃ)-এর একজন মুকাতাব ছিল। সে “বদলে কিতাবাতের” সম্পূর্ণ অর্থ যাহা তাহার জিম্মায় রহিয়াছে, তাহা এক সঙ্গে তাহার নিকট পেশ করিল। ফারাফিসা উহা গ্রহণ করিতে অস্বীকার করিল। মুকাতাব আমীরে মদীনা মারওয়ান ইবন হাকামের নিকট উপস্থিত হইল এবং বিষয়টি তাহাকে জানাইল। মারওয়ান ফারাফিসা ইবন উমাইরকে ডাকিয়া পাঠাইলেন। তিনি উপস্থিত হইলে তাহাকে উহা গ্রহণ করার কথা বলিলেন, কিন্তু ফারাফিসা অস্বীকার করিল, মারওয়ান সেই মাল মুকাতাব হইতে গ্রহণ করিয়া বায়তুলমালে রাখার নির্দেশ দিলেন; এবং (সাথে সাথে) মুকাতাবকে বলিয়া দিলেন: যাও, তুমি আযাদ হইয়া গিয়াছ। ফারাফিসা ইহা লক্ষ্য করিয়া মাল (নিজে) গ্রহণ করিল। মালিক (রহঃ) বলেনঃ আমাদের নিকট ইহার মীমাংসা এই — মুকাতাব যদি তাহার জিম্মার সব কিস্তি উহার (নির্দিষ্ট সময়ের পূর্বে) আদায় করিয়া দেয় ইহা তাহার জন্য জায়েয হইবে, তাহার কর্তার পক্ষে ইহা অস্বীকার করিবার অধিকার নাই। ইহা এইজন্য যে, কর্তা ইহার দ্বারা মুকাতাবকে সর্বপ্রকার শর্ত অথবা খেদমত অথবা সফর হইতে অব্যাহতি প্রদান করিতেছে। কারণ সামান্য দাসত্ব বহাল থাকিলেও কোন ব্যক্তির আযাদী পূর্ণ হয় না এবং (এমতাবস্থায়) উহার ব্যক্তিমর্যাদা পূর্ণতা লাভ করে না, আর উহার সাক্ষ্যও বৈধ হয় না, উহার জন্য মীরাস ওয়াজিব হয় না এবং এই জাতীয় আরও অন্যান্য আহকাম যাহা মুকাতাব সম্পর্কে রহিয়াছে। পক্ষান্তরে (ইহার পর) মুকাতাবের কর্তা কর্তৃক মুকাতাবের উপর কোন শর্ত আরোপ করা এবং আযাদীর পর কোন খেদমত গ্রহণ করা সঙ্গত নহে। মালিক (রহঃ) বলেনঃ যে মুকাতাব গুরুতর অসুস্থ হইয়াছে সে তাহার যাবতীয় কিস্তি একত্রে কর্তাকে দিবার ইচ্ছা করিল, যেন তাহার আযাদ উত্তরাধিকারিগণ তাহার মীরাস লাভ করে এবং তাহার কোন সন্তান কিতাবাতে তাহার সঙ্গে শামিল নাই। মালিক (রহঃ) বলেনঃ ইহা তাহার জন্য জায়েয হইবে। কেননা ইহার দ্বারা তাহার ব্যক্তিমর্যাদা পূর্ণত্ব লাভ করিবে এবং তাহার সাক্ষ্য জায়েয হইবে, আর তাহার উপর লোকের যে সকল ঋণ রহিয়াছে সেই সকল ঋণের স্বীকারোক্তি করাও জায়েয হইবে এবং তাহার পক্ষে ওসীয়ত করাও জায়েয হইবে তাহার কর্তার পক্ষে ইহা অস্বীকার করার অধিকার নাই “যেমন সে ইহা বলে যে, তাহার মাল বাচাইবার প্রচেষ্টা করিয়াছে।”",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 1495
			}
		}
	]
}