{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"3": "Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 152,
			"arabicnumber": 152,
			"text": "রেওয়ায়ত ৭. সাহল ইবন সা’আদ সায়েদী (রাঃ) বর্ণনা করিয়াছেনঃ দুইটি মুহূর্ত এইরূপ আছে সেই সময় অসমানের দরওয়াজা খোলা হয় এবং সেই মুহূর্তদ্বয়ে প্রার্থনাকারীর প্রার্থনা কুচিৎ ফেরত দেওয়া হয়; নামাযের আযানের মুহুর্ত এবং আল্লাহর পথে জিহাদের কাতার ঠিক করার মুহুর্ত। ইয়াহইয়া (রহঃ) বলিয়াছেনঃ মালিক (রহঃ)-কে প্রশ্ন করা হইলঃ জুম'আর দিন সময়ের পূর্বে আযান দেওয়া যায় কি? তিনি উত্তর দিলেনঃ না, যায় না। সূর্য পশ্চিম দিকে ঝুঁকিবার পরই আযানের সময় হয়। ইয়াহইয়া (রহঃ) বর্ণনা করিয়াছেন- মালিক (রহঃ)-কে জিজ্ঞাসা করা হইল আযান ও ইকামত-এর (বাক্যগুলি) দুই দুইবার বলা সম্পর্কে এবং ইকামতের সময় মানুষের কোন সময় দাঁড়াইতে হইবে সেই সম্পর্কে। তিনি উত্তর দিলেনঃ আযান ও ইকামতের বিষয় আমি লোকজনকে যে পর্যায়ে পাইয়াছি উহার চাইতে অধিক কিছু আমার নিকট পৌছে নাই। ইকামত অবশ্য দুই দুইবার বলিতে নাই। আমাদের শহরের (মদীনা) বিজ্ঞ আলিমগণ এই মতই পোষণ করিতেন। ইকামতের সময় দাঁড়াইবার সম্পর্কে সুনির্দিষ্ট কোন সীমা আমি জ্ঞাত নই। তবে আমার মতে উহা অনেকটা লোকের শক্তি-সামর্থ্যের উপর নির্ভর করে। কারণ সব লোক এক রকমের নয়; তাহাদের মধ্যে সবল ও দুর্বল সকল প্রকারের লোকই থাকে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ)-কে প্রশ্ন করা হইলঃ যাহারা প্রবাসী নহে বরং মুকীম (স্বদেশে বা বিদেশে শরীয়তসম্মত স্থায়ী বসবাসকারী) তাহারা ফরয নামায জামাত সহকারে আযান ছাড়া শুধু ইকামত বলিয়া পড়িতে চাহিলে-এই বিষয়ে আপনার মত কি? তিনি বলিলেনঃ কেবল ইকামত বলিলেও চলিবে। কেননা আযান ওয়াজিব হয় সেই সব মসজিদের জন্য যেসব মসজিদে জামাত অনুষ্ঠিত হয় এবং লোকজনকে নামাযের জন্য আহবান করা হয়। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মুয়াযযিন কর্তৃক ইমামকে সালাম দেওয়া, নামাযের জন্য তাহাকে আহবান করা এবং সর্বপ্রথম কোন আমীরের প্রতি এইরূপ করা হইয়াছিল- এই বিষয়ে মালিক (রহঃ)-কে জিজ্ঞাসা করা হইলে তিনি বলিলেনঃ এইরূপ সালাম দেওয়ার রীতি প্রথম যুগে ছিল বলিয়া আমি অবগত নই। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মুয়াযযিন আযান দিয়া অপেক্ষা করিল, কিন্তু নামায পড়িতে কেউ আসিল না। অতএব, সে ইকামত বলিয়া একা একাই নামায পড়িল। নামায সমাপ্ত হইলে কিছু লোক আসিল। এক্ষণে সে কি পুনরায় আগন্তুকদের সঙ্গে নামায পড়িবে? মালিক (রহঃ)-এর নিকট এই বিষয়ে প্রশ্ন করা হইলে তিনি বলিলেনঃ না, পরে যাহারা আসিবে তাহারা পৃথক পৃথকভাবে নামায পড়িবে। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ) জিজ্ঞাসিত হইলেনঃ মুয়াৰ্যযিন আযান দিবার পর নফল নামায শুরু করিল। লোকজন আসিয়া অন্যের দ্বারা ইকামত বলাইয়া জামাতসহকারে নামায পড়িতে ইচ্ছা করিল, এইরূপ করা চলে কি? তিনি উত্তর দিলেন, যায়, ইহা বৈধ। ইকামত বলার ব্যাপারে মুয়াযযিন এবং অন্য ব্যক্তি এক সমান। ইয়াহইয়া (রহঃ) হইতে বর্ণিত, মালিক (রহঃ) বলিয়াছেনঃ ফজরের আযান প্রায়ই সুবহে-সাদিক-এর আগে দেওয়া হইত। কিন্তু অন্যসব নামাযের আযান আমাদের মতে সময় হওয়ার পর ছাড়া দেওয়া হইত না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		}
	]
}