{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "রেওয়ায়ত ৩৫. ইয়াহইয়া ইবন সাঈদ (রহঃ) হইতে বর্ণিত, তিনি বলেন, আবু বকর ইবন মুহাম্মদ ইবন আমর ইবন হাযম এক নিবাতী ব্যক্তিকে গ্রেফতার করিল, যে লোহার আংটি চুরি করিয়াছে। তাহাকে হাত কাটিতে ধরিয়া রাখিল। উমরা বিনতে আবদুর রহমান (রাঃ) তাহার উমাইয়া নামক মুক্ত দাসীকে আবু বকর (রাঃ)-এর নিকট পাঠাইলেন। আবু বকর (রাঃ) বলিলেনঃ আমি কয়েকজন লোকের মধ্যে উপবিষ্ট ছিলাম। ইত্যবসরে ঐ দাসী আমার নিকট আসিয়া বলিতে লাগিল, আপনার খালা উমরা বলিয়াছেন, ভাগনে তুমি অল্প কিছু মালের জন্য একজন গ্রাম্য লোককে আটকাইয়া রাখিয়াছ আর তাহার হাত কাটিতে চাহিতেছ? আমি বলিলাম, হ্যাঁ। সে বলিল, উমরা বলিয়াছেন যে, এক-চতুর্থাংশ দীনারের বিনিময়েই হাত কাটা হইয়া থাকে। অতঃপর আমি তাহাকে ছাড়িয়া দিলাম। মালিক (রহঃ) বলেন, যদি কোন দাস এইরূপ কোন অন্যায় স্বীকার করে, যাহাতে তাহার উপর হাদ্দ জারি হয় অথবা শাস্তি বর্তায় যাহা তাহার দৈহিক ক্ষতি সাধন করে, (যথাঃ হাত কাটা যায়), তবে তাহা বৈধ। তাহাকে এই দোষারোপ করা হইবে না যে, সে তাহার প্রভুর অনিষ্ট সাধনের নিমিত্ত এই ধরনের অপরাধ স্বীকার করিয়াছে, প্রকৃতপক্ষে সে উহা করে নাই। মালিক (রহঃ) বলেন, কোন দাস যদি এইরূপ কোন অন্যায় স্বীকার করে যাহার জন্য তাহার প্রভুকে ক্ষতিগ্রস্ত হইতে হয় এইভাবে যে, প্রভুকে তাহার ক্ষতিপূরণ দিতে হয়, তবে তাহার এই স্বীকারোক্তি বৈধ ধরা যাইবে না। মালিক (রহঃ) বলেন, যদি কোন শ্রমিক অথবা অন্য কোন ব্যক্তি যে এমন সব লোকের মধ্যে থাকে, যাহাদের সে খিদমত করে সে তাহাদের কোন বস্তু চুরি করিলে হাত কাটা যাইবে না। কেননা সে খেয়ানতকারীর মতো হইল। আর খেয়ানতকারী ব্যক্তির হাত কাটা হয় না। মালিক (রহঃ) বলেনঃ যদি কেহ কাহারও কোন দ্রব্য চাহিয়া নেয়, অতঃপর তাহা অস্বীকার করে, তবে তাহার হাত কাটা হইবে না। ইহার উদাহরণ এইরূপঃ যেমন কেহ কাহারও নিকট হইতে ঋণ লইয়া তাহা অস্বীকার করিল তখন তাহার হাত কাটা হইবে না। মালিক (রহঃ) বলেনঃ আমাদের নিকট ইহা একটি সর্বসম্মত বিধান যে, যদি চোর ঘরে ঢুকিয়া মাল একত্র করিয়া নেয় কিন্তু উহা ঘর হইতে বাহির করিল না, তাহা হইলে তাহার হাত কাটা হইবে না। ইহার উদাহরণ এইরূপঃ যেমন কাহারও সম্মুখে পান করিবার জন্য মদ রাখা আছে, কিন্তু সে এখনও উহা পান করে নাই; এমতাবস্থায় তাহাকে মদ্য পানের শাস্তি দেওয়া হইবে না। উহার উদাহরণ এইরূপও হইতে পারে, যেমন কেহ কোন স্ত্রীলোকের নিকট সহবাস করিতে উপবেশন করিল, কিন্তু তাহার লজ্জাস্থানে স্বীয় লজ্জাস্থান প্রবেশ করায় নাই, এমতাবস্থায় তাহার উপর ব্যভিচারের শাস্তি বর্তিবে না। মালিক (রহঃ) বলেনঃ আমাদের নিকট একটি সর্বসম্মত বিধান এই যে, ছিনাইয়া লইলে হাত কাটা হইবে না, যদিও ঐ দ্রব্যের মূল্য এক দীনারের চতুর্থাংশ বা তাহার চাইতে অধিক হয়।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1536
			}
		}
	]
}