{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1563,
			"arabicnumber": 1563,
			"text": "রেওয়ায়ত ৬. সাঈদ ইবন মুসায়্যাব (রহঃ) হইতে বর্ণিত আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম গর্ভস্থ সন্তান হত্যার ব্যাপারে একটি দাস অথবা দাসী দিয়াত দেওয়ার আদেশ করিয়াছেন। যাহার উপর দিয়াতের আদেশ হইয়াছে সে বলিলঃ আমি এই সন্তানের রক্তপণ কিরূপে আদায় করিব, যে খায় নাই, পান করে নাই, কথা বলে নাই, না ক্ৰন্দন করিয়াছে। এইরূপ সন্তানের তো খুন মাফ করা হইয়া থাকে। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলিলেনঃ লোকটি তো (কাহিন) যাদুকরের ভাই। রবী'আ ইবন আবী আবিদের রহমান বলিতেন, দাস বা দাসীর মূল্য যাহা গর্ভস্থ শিশুর জন্য দেওয়া হয় পঞ্চাশ দীনার অথবা ছয় শত দিরহাম হওয়া উচিত, আর স্বাধীন মুসলিমের স্ত্রীর দিয়াত পাঁচ শত দীনার বা ছয় হাজার দিরহাম। মালিক (রহঃ) বলেন, স্বাধীনা রমণীর গর্ভস্থ বাচ্চার দিয়াত স্ত্রীলোকের দিয়াতের দশমাংশ আর উহা পঞ্চাশ দীনার বা ছয় শত দিরহাম। গর্ভস্থ বাচ্চার দিয়াত ঐ সময় দেওয়া অনিবার্য হয় যখন বাচ্চা মরিয়া পেট হইতে বাহির হইয়া পড়ে। আমি ইহাতে কাহাকেও ইখতিলাফ করিতে দেখি নাই। যদি বাচ্চা পেট হইতে জীবিত বাহির হইয়া মারা যায় তবে পূর্ণ দিয়াত দিতে হইবে। মালিক (রহঃ) বলেন, গর্ভস্থ সন্তানের ক্ৰন্দন দ্বারা বুঝা যাইবে যে, সে জীবিত না মৃত। যদি ক্ৰন্দন করিয়া মরিয়া যায় তবে পূর্ণ দিয়াত দেওয়া অনিবার্য হইবে। দাসীর পেটের সন্তানের বেলায় দাসীর মূল্যের দশমাংশ দিয়াত দিতে হইবে। মালিক (রহঃ) বলেন, যদি গর্ভবতী স্ত্রী কোন পুরুষ অথবা স্ত্রীলোককে হত্যা করে, তবে তাহার সন্তান প্রসবের পূর্বে তাহার হইতে কিসাস লওয়া হইবে না। যদি গর্ভবতী স্ত্রীলোককে কেহ হত্যা করে, ইচ্ছাকৃতই হউক বা ভুলক্রমেই হউক, তাহার গর্ভস্থ সন্তানের দিয়াত অনিবার্য হইবে না, বরং যদি তাহাকে ইচ্ছাকৃত হত্যা করা হইয়া থাকে, তবে হত্যাকারীকে হত্যা করা হইবে আর যদি ভুলক্রমে হত্যা করা হইয়া থাকে, তবে দিয়াত দিতে হইবে। মালিক (রহঃ)-কে প্রশ্ন করা হইয়াছিল, যদি কেহ ইহুদী বা খৃস্টান স্ত্রীলোকের গর্ভস্থ বাচ্চাকে হত্যা করিয়া বাহির করিয়া দেয় উহার হুকুম কি? তিনি উত্তর দিলেন, তাহার মাতার দিয়াতের এক দশমাংশ অংশ দিতে হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1563
			}
		}
	]
}