{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"43": "Blood-Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1578,
			"arabicnumber": 1578,
			"text": "সাঈদ ইবন মুসায়্যাব (রহঃ) ও সুলায়মান ইবন ইয়াসার (রহঃ) হইতে বর্ণিত, তাহারা উভয়ে বলিতেন, দাসের ক্ষতে তাহার মূল্যের বিশ ভাগের একভাগ অংশ হইবে। মালিক (রহঃ) বলেন, মারওয়ান ইবন হাকাম ঐ ব্যক্তিকে, যে কোন দাসকে ক্ষত করিয়া দিত, আদেশ করিতেন যে, এই ক্ষতের দরুন তাহার মূল্যের যতটুকু কম পড়িল তাহাকে উহা দিতে হইবে। মালিক (রহঃ) বলেনঃ আমাদেন নিকট সিদ্ধান্ত এই যে, দাসের ক্ষতে তাহার মূল্যের বিশ ভাগের এক ভাগ আর যে ক্ষতের দরুন হাঁড় স্থানচ্যুত হয় উহাতে তাহার মূল্যের দশ ভাগের একভাগ ও বিশ ভাগের একভাগ আর মাসুমায়[1] ও জাইফার প্রতিটার জন্য তাহার মূল্যের ত্রিশ ভাগের একভাগ দিতে হইবে। উহা ব্যতীত প্রতি প্রকার ক্ষত করার জন্য তাহার মূল্যে ক্ষতের যে ক্ষতি হইবে তাহা আদায় করিতে হইবে। যখন দাস সুস্থ হইয়া যাইবে, তখন দেখিতে হইবে ক্ষতের পূর্বে কি মূল্য ছিল এবং ক্ষতের জন্য কত কম হইল, উহা দিতে হইবে। মালিক (রহঃ) বলেন, যদি কেহ দাসের হাত-পা ভাঙ্গিয়া ফেলে, পরে সে ভাল হইয়া যায়, তবে কোন ক্ষতিপূরণ দিতে হইবে না। হ্যাঁ, যদি কোন ক্রটি থাকিয়া যায় তবে ক্ষতিপূরণ দিতে হইবে। মালিক (রহঃ) বলেন, দাস ও দাসীর ব্যাপারে স্বাধীনদের মতো কিসাস দিতে হইবে। যদি দাস ইচ্ছাকৃতভাবে কোন দাসীকে হত্যা করে, তবে দাসকেও কিসাসে হত্যা করিতে হইবে। যদি ক্ষত করিয়া দেয় তদ্রুপ ক্ষত তাহারও করা হইবে। যদি এক দাস অন্য কোন দাসকে ইচ্ছাকৃতভাবে মারিয়া ফেলে, তবে নিহতের প্রভুর ইচ্ছার উপর নির্ভর করিবে, হয় হত্যাকারীকে হত্যা করিবে অথবা দিয়াত অর্থাৎ গোলামের মূল্য লইয়া লইবে। অনুরূপভাবে হত্যাকারীর প্রভুর ইচ্ছার উপর নির্ভর করিবে, হয় নিহত ব্যক্তির মূল্য আদায় করিবে এবং হত্যাকারীকে নিজের নিকট থাকিতে দিবে অথবা নিহতের প্রভু দিয়াতের উপর রায়ী হইয়া হত্যাকারীকে লইয়া লইবে, তাহা হইলে তাহাকে হত্যা করিবে না।মালিক (রহঃ) বলেন, যদি কোন মুসলিম দাস কোন ইহুদী অথবা খ্রিষ্টানকে যখম করিয়া ফেলে তবে দাসের প্রভু ইচ্ছা করিলে দিয়াত দিয়া দিবে বা ঐ দাস বিনিময়ে দিয়া দিবে এবং দাসকে বিক্রয় করিয়া তাহার ক্ষতিপূরণ গ্রহণ করিবে। কিন্তু ঐ মুসলিম গোলামকে অমুসলিমের নিকট থাকিতে দেওয়া হইবে না।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 1578
			}
		}
	]
}