{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"45": "Madina"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "রেওয়ায়ত ২২. আবদুল্লাহ ইবন আব্বাস (রাঃ) হইতে বর্ণিত, উমর ইবনে খাত্তাব (রাঃ) শাম দেশের দিকে যাত্রা করিলেন। যখন তিনি সুরগ নামক স্থানে পৌছিলেন তখন বড় বড় সেনাপতি তাহার সহিত মিলিত হইলেন, যেমন আবূ উবায়দা ইবনুল জাররাহ ও তাহার সঙ্গিগণ। ঐ সেনাপতিগণ বলিলেন, আজকাল শাম দেশে মহামারী বিস্তার লাভ করিয়াছে। ইবন আব্বাস বলিলেন, নেতৃস্থানীয় মুহাজিরদেরকে ডাকিয়া আন যাহারা প্রথমে হিজরত করিয়াছেন। উমর ইবন খাত্তাব (রাঃ) বলিলেন তাহাদিগকে ডাকিয়া আনা হইল। উমর (রাঃ) তাহাদের সহিত শাম দেশের মহামারী সম্বন্ধে পরামর্শ করিলেন। তাহাদের কেহ মন্তব্য করিলেন, আপনি কাজের জন্য বাহির হইয়াছেন এখন প্রত্যাবর্তন করা সমীচীন হইবে না। কেহ বলিলেন, আপনার সহিত অন্যান্য লোকও রহিয়াছে আর রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সাহাবীও রহিয়াছেন। তাহাদিগকে এই মহামারীতে লইয়া যাওয়া যুক্তিযুক্ত হইবে না। উমর (রাঃ) তাহাদিগকে বিদায় দিলেন। অতঃপর বলিলেন, যাও আনসারদেরকে ডাকিয়া আন! অতঃপর ইবনে আব্বাস আনসারদেরকে ডাকিয়া আনিলেন। উমর (রাঃ) তাহদের সহিত পরামর্শ করিলেন। তাহারাও মুহাজিরদের মতো মত প্রকাশ করিলেন। উমর (রাঃ) তাহাদিগকেও বিদায় দিলেন। অতঃপর বলিলেন, যাও কুরাইশ সর্দারদিগকে ডাকিয়া আন। যাহারা মক্কা বিজয়ের পর হিজরত করিয়াছেন, আমি কুরাইশের বয়োবৃদ্ধদের ডাকিয়া আনিলাম। তাহদের দুইজনের মধ্যেও কোন মতবিরোধ হইল না, বরং সকলেই এক বাক্যে বলিলেন, আমাদের মতে আপনার ফিরিয়া যাওয়াই যুক্তিযুক্ত মনে হইতেছে। লোকদেরকে মহামারিতে লইয়া যাওয়া সমীচীন মনে হইতেছে না। অতঃপর উমর (রাঃ) ঘোষণা করিয়া দিলেন, সকাল বেলায় আমরা ফিরিয়া যাইব । সকাল বেলা সকলেই সওয়ার হইয় তাহার সহিত সাক্ষাৎ করিতে আসিল। সে সময় আবূ উবায়দা (রহঃ) বলিলেন, কি হইল, আল্লাহর তকদীর (নির্ধারিত বিধান) হইতে পলাইয়া যাইতেছ? উমর (রাঃ) বলিলেন, যদি এই কথা অন্য কেহ বলিত। হ্যাঁ, আমরা আল্লাহর তকদীর হইতে আল্লাহর তকদীরের প্রতি পলায়ন করিতেছি। যদি তোমার নিকট উট থাকে আর তুমি দুই দিক ঘেরাও করা মাঠে লইয়া যাও, যাহার একদিক শস্য শ্যামল থাকে আর অন্যদিক শুষ্ক ও খালি থাকে। যদি তুমি উটকে শ্যামল দিকে চরাও তখনও তুমি উহা আল্লাহর তকদীরেই উহাকে চরাইলে আর যদি শুষ্ক ভূমিতে চরাও তবুও আল্লাহর তকদীরেই চরাইলে। এই সময়ে আবদুর রহমান ইবনে আউফ (রাঃ) আসিয়া পড়িলেন। তিনি কোথাও কোন কাজে গিয়াছিলেন। তিনি বলিলেন, আমার এই ব্যাপারে জানা আছে। আমি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে বলিতে শুনিয়াছি যদি তুমি কোন স্থানে মহামারীর কথা শুনিতে পাও তবে তথায় গমন করিও না। আর যদি কোন স্থানে মহামারী ছড়াইয়া পড়ে আর তুমি সেখানে থাক তবে তথা হইতে পলাইও না। ইবনে আব্বাস বলিলেন, ইহা শুনিয়া উমর (রাঃ) আল্লাহর প্রশংসা করিলেন এবং তথা হইতে প্রত্যাবর্তন করিলেন।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1618
			}
		}
	]
}