{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"54": "General Subjects"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1795,
			"arabicnumber": 1795,
			"text": "রেওয়ায়ত ৩৩. হিশামের আযাদকৃত গোলাম আবু সায়েব (রাঃ) হইতে বর্ণিত, তিনি বলেন, আমি আবূ সাঈদ খুদরী (রাঃ)-এর নিকট গেলাম। তিনি নামায পড়িতেছিলেন। আমি তাহার নামায হইতে অবসর হইবার অপেক্ষায় বসিয়া রহিলাম। তিনি যখন নামায শেষ করিলেন তখন আমি তাহার ঘরের চৌকির নিচে সরসর শুনিতে পাইলাম। আমি তাকাইয়া দেখিলাম যে, উহা একটি সর্প। আমি উহাকে মারিতে উদ্যত হইলাম। আবু সাঈদ (রাঃ) আমাকে ইশারা করিলেন যে বস (অর্থাৎ মারিও না)। অতঃপর তিনি (আমার দিকে) ফিরিয়া ঘরের একটি কামরার দিকে ইশারা করিয়া বলিলেন, ঐ ঘরটি দেখিতেছ ? আমি বলিলাম, হ্যাঁ। তিনি বলিলেন, সেই ঘরে জনৈক যুবক বাস করিত, নূতন বিবাহ করিয়াছিল। সে রাসূলুল্লাহ্ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের সঙ্গে পরিখা যুদ্ধে গমন করিয়াছিল। ইহার পর হঠাৎ এক সময় সে রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট আসিয়া বলিল, ইয়া রাসূলাল্লাহু! আমাকে একটু অনুমতি দান করুন, আমি আমার পরিবারের সঙ্গে একটু কথা বলিয়া আসি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাহাকে অনুমতি দান করিলেন এবং বলিলেন, যুদ্ধাস্ত্র সঙ্গে রাখ। কেননা বনু কুরায়যার আশঙ্কা রহিয়াছে (বনু কুরায়যা সেই ইহুদী গোত্র, যাহারা পরিখা যুদ্ধের সময় ওয়াদা ভঙ্গ করিয়া মক্কাবাসীদের সঙ্গে মিলিয়া মুসলিমদের বিরুদ্ধে যুদ্ধে অবতীর্ণ হইয়াছিল)। যুবকটি অস্ত্রসহ রওয়ানা হইয়া গেল। ঘরে পৌছিয়া সে তাহার স্ত্রীকে ঘরের দুই দরজার মধ্যবর্তী স্থানে দগুায়মান দেখিতে পাইল। স্ত্রীকে এই অবস্থায় দেখিয়া সে ক্রোধান্বিত হইল এবং বর্শা দিয়া স্ত্রীকে হত্যা করিতে উদ্যত হইল। স্ত্রী বলিল, (আমাকে মারিতে এত) তাড়াহুড়া করিও না, বরং আগে ঘরের ভিতরে যাইয়া দেখ। অতঃপর সে ঘরের ভিতরে গিয়া দেখিল যে, কুগুলী পাকাইয়া একটি সর্প তাহার বিছানায় বসিয়া আছে। সে বর্শা দিয়া সপটিকে গাথিয়া ফেলিল এবং বর্শাটিকে ঘরে দাড় করাইয়া রাখিয়া দিয়া নিজে বাহির হইয়া আসিল। সপটি বর্শার ফলায় পেচাইতেছিল, আর তখনই যুবকটি মারা গেল। তবে ইহা জানা যায় নাই যে, যুবকটি আগে মারা গেল, না-সর্পটি। রাসূলুল্লাহ সাল্লাল্লাহু আলায়হি ওয়া সাল্লামের নিকট উক্ত ঘটনা বিবৃত করা হইলে পরে তিনি বলিলেন, মদীনায় জ্বিন ইসলাম গ্রহণ করিয়াছে। অতএব তোমরা যদি সৰ্প দেখ তবে তিনদিন পর্যন্ত তাহাকে সতর্ক কর। তারপরেও যদি তাহাকে দেখ, তবে তাহাকে হত্যা কর। কেননা সে শয়তান।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 54,
				"hadith": 1795
			}
		}
	]
}