{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"12": "The Eclipse Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 446,
			"arabicnumber": 446,
			"text": "রেওয়ায়ত ২. আবদুল্লাহ ইবনে আব্বাস (রাঃ) বলেনঃ একবার সূর্যগ্রহণ হইল, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম নামায পড়িলেন এবং তিনি তাহার নামাযে দীর্ঘক্ষণ দাঁড়াইলেন। রাবী বলেনঃ সূরা বাকারা পাঠ করার কাছাকাছি সময় (দাঁড়াইলেন)। তিনি বলেন, অতঃপর লম্বা রুকূ করিলেন। তারপর মাথা উঠাইলেন এবং দীর্ঘক্ষণ দাঁড়াইলেন কিন্তু প্রথম দাঁড়ানো অপেক্ষ কম। তারপর লম্বা রুকূ করিলেন, প্রথম রুকু অপেক্ষা কম। অতঃপর তিনি সিজদা করিলেন। তারপর দীর্ঘক্ষণ দাঁড়াইলেন কিন্তু পূর্বের দাঁড়ানো অপেক্ষা কম। তারপর রুকূ করিলেন, দীর্ঘ রুকূ কিন্তু পূর্বের রুকু অপেক্ষা কম। আবার মাথা তুলিলেন এবং দীর্ঘক্ষণ দাঁড়াইলেন, কিন্তু পূর্বের দাঁড়ানো অপেক্ষা কম, তারপর দীর্ঘ রুকূ করিলেন, তবে পূর্বের রুকু অপেক্ষা কম, তারপর সিজদা করিলেন। ইহার পর নামায সমাপ্ত করিলেন। আর ততক্ষণে সূর্য দীপ্যমান ও উজ্জ্বল হইয়া গিয়াছে। তারপর তিনি বলিলেনঃ সূর্য ও চন্দ্র আল্লাহর নিদর্শনসমূহের মধ্যে দুইটি নিদর্শন, কোন লোকের মৃত্যু অথবা জন্মের কারণে ইহার গ্রহণ হয় না। যখন তোমরা উহা দেখিতে পাও, তখন সকলে আল্লাহকে স্মরণ করিও। সাহাবীগণ বলিলেনঃ হে আল্লাহর রাসূল! এই জায়গায় আপনাকে আমরা কোন কিছু গ্রহণ করিতে দেখিতে পাইলাম, আবার আপনাকে পিছনে সরিতে দেখিলাম (ইহার তাৎপর্য বুঝাইয়া দিন)। উত্তরে তিনি বলিলেনঃ আমি বেহেশত দেখিতে পাইলাম এবং তথা হইতে একটি আঙ্গুরের ছড়া গ্রহণ করিতে চাহিয়াছিলাম, আমি উহা গ্রহণ করিলে পৃথিবী কায়েম থাকা পর্যন্ত তোমরা উহা হইতে আহার করিতে পারিতে। আর আমি দোযখকেও দেখিতে পাইলাম, যাহার যত ভয়ঙ্কর দৃশ্য আমি কখনও দেখি নাই। আর আমি দেখিতে পাইলাম যে, উহার অধিকাংশ অধিবাসীই নারী। সাহাবীগণ জিজ্ঞাসা করিলেনঃ ইহার কারণ কি? হে আল্লাহর রসূল! তিনি বলিলেনঃ তাহাদের কুফরীর কারণে। প্রশ্ন করা হইলঃ তাহারা কি আল্লাহ্ তা'আলার সাথে কুফরী করিয়া থাকে। তিনি বললেনঃ (না, বরং) স্বামীর অকৃতজ্ঞতা প্রকাশ করিয়া থাকে এবং ইহসান অস্বীকার করিয়া বসে। তুমি যদি তাহাদের কাহারও সাথে যুগ যুগ ধরিয়া ইহসান করিতে থাক, অতঃপর সে যদি কোন একদিন তোমার নিকট হইতে তাহার অপছন্দনীয় কিছু দেখে, তবে বলিবে, আমি কোন মঙ্গল তোমার নিকট হইতে লাভ করি নাই।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 446
			}
		}
	]
}