{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "রেওয়ায়ত ৩৪. ইবন শিহাব (রহঃ) বলেন, খেজুরের যাকাতে জো’রুর, মুসরানুলফার ও আজক ইবন খুবায়ক (এক ধরনের অতি নিকৃষ্ট খেজুর) গ্রহণ করা যাইবে না। তিনি বললেনঃ ইহা বকরীর যাকাতের মত। নিকৃষ্ট ধরনের বকরী গণনায় শামিল হয় বটে কিন্তু যাকাতে গ্রহণ করা যায় না। এই ক্ষেত্রেও নিকৃষ্ট ধরনের খেজুর পরিমাণের বেলায় শামিল করা হইবে বটে কিন্তু যাকাত গ্রহণ করা যাইবে না। মালিক (রহঃ) বলেনঃ ইহা বকরীর যাকাত সদৃশ। বকরীর বাচ্চা গণনায় শামিল হয় কিন্তু যাকাতে গ্রহণ করা যায় না। অনেক ক্ষেত্রে কোন দ্রব্য বেশি ভাল হওয়ার কারণেও যাকাতে গ্রহণ করা যায় না। যেমন বুরদী (উত্তম) জাতীয় খেজুর। মোট কথা, বেশি ভাল বা অতি নিকৃষ্ট উভয় ধরনের দ্রব্যই যাকাতে গ্রহণ করা যায় না, বরং মধ্যম ধরনের জিনিসই কেবল গ্রহণ করা যায়। মালিক (রহঃ) বলেন, খেজুর ও আঙ্গুর ব্যতীত অন্য কোন ফলের বেলায় খারস বা বৃক্ষস্থ ফলের পরিমাণ অনুমান করিয়া তদানুযায়ী যাকাতের পরিমাণ নির্ধারণ করা যাইবে না। খেজুর ও আঙ্গুর প্রায় পরিপক্ক হইয়া উঠিলে এবং বিক্রয় করা যায় এমন অবস্থায় পৌছিলে উহাতে অনুমান করা যায়, কারণ খেজুর ও আঙ্গুর উভয় ধরনের ফল কাঁচা অশুষ্ক অবস্থায়ও খাওয়া যায়। সুতরাং পাকা ও শুষ্ক হওয়া পর্যন্ত অপেক্ষা করা হইলে ইহাতে মানুষের অসুবিধার সৃষ্টি হইবে। অতএব সাধারণ মানুষের সুবিধার প্রতি লক্ষ করিয়া বৃক্ষস্থ খেজুর ও আঙ্গুরের পরিমাণ অনুমান করার পর মালিককে তাহার কলের অধিকার সহ ছাড়িয়া দেওয়া হইবে। যেভাবে মনে করে সে উহা ভোগ করবে এবং পরে পূর্বের অনুমানকৃত পরিমাণানুসারে যাকাত প্ৰদান করবে। মালিক (রহঃ) বলেন, যে সমস্ত ফল কাঁচা ভক্ষণ করা হয় না, বরং কর্তনের পর বিশেষ প্রক্রিয়ায় ভক্ষণ করা হয়, যেমন- ধান, গম ইত্যাদি যাবতীয় শস্যের বেলায় ক্ষেতে শস্য রাখিয়া ক্ষেত্রস্থ শস্যের পরিমাণ অনুমান করিয়া নির্ণয় করিবার পর যাকাত নির্ধারণ করা যাইবে না। শস্য কর্তনের পর মাড়ানো এবং পরিষ্কার করা হইলে উহাতে যাকাত আদায় করিতে হয়। যাকাত ধার্য করার মত না হওয়া পর্যন্ত উহা মালিকের হাতে আমানত হিসাবে থাকে। মালিক (রহঃ) বলেনঃ উক্ত বিষয়ে আমাদের মধ্যে কোন মতানৈক্য নাই। মালিক (রহঃ) বলেন, আমাদের নিকট সর্বসম্মত মাস’আলা হইল, ফল প্রায় পরিপক্ক অবস্থায় যখন বিক্রয়ের উপযুক্ত হইবে তখন উহাতে অনুমান করিয়া বৃক্ষস্থ ফলের পরিমাণ নির্ণয় করা হইবে এবং কর্তনের পর উহার যাকাতের পরিমাণ অনুসারে বিশুদ্ধ খেজুর লওয়া হইবে। অনুমান করিয়া পরিমাণ নির্ধারণের পর কোন প্রাকৃতিক দুর্যোগের দরুন যদি বৃক্ষস্থ সমস্ত খেজুর বিনষ্ট হইয়া যায়, তবে আর উহাতে যাকাত ধার্য হইবে না। বিনষ্ট হওয়ার পরও যদি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওসাল্লাম এর ব্যবহৃত হয়ে পাঁচ আছক (ষাট ছা’) পরিমাণ খেজুর অবশিষ্ট থাকে তবে ইহাতে যাকাত ধার্য হইবে, আর যতটুকু পরিমাণ বিনষ্ট হইয়া গিয়াছে উহাতে যাকাত ধার্য হইবে না। মালিক (রহঃ) বলেনঃ আজুরের বেলায়ও উক্ত হুকুম প্রযোজ্য হইবে। মালিক (রহঃ) বলেনঃ বিভিন্ন স্থানে যদি কাহারও জায়গীর বা অংশ থাকে আর সবগুলিকে একত্র করিলে যাকাত পরিমাণ হয় তবে আলাদা আলাদাভাবে যাকাত পরিমাণ না হইলেও উহাতে যাকাত ধার্য করা হইবে।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 609
			}
		}
	]
}