{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"text": "রেওয়ায়ত ৪৫. মালিক (রহঃ) বলেন, আমি জানিতে পারিয়াছি যে, উমর ইবন আবদুল আযীয (রহঃ) তাহার কর্মচারীদের নিকট একই মর্মে চিঠি লিখিয়াছেন যে, জিযয়া প্রদানকারীদের মধ্যে যাহারা ইসলাম ধর্ম গ্রহণ করিবে তাহদের জিযয়া মওকুফ হইয়া যাইবে। মালিক (রহঃ) বলেনঃ প্রচলিত সুন্নত হইল, অমুসলিম আহলে কিতাব নারী ও শিশুদের উপর জিযয়া ধার্য হইবে না। যুবকদের নিকট হইতেই কেবল জিযয়া আদায় করা হইবে। মালিক (রহঃ) বললেনঃ যিম্মী ও অগ্নিপূজকদের খেজুর বা আঙ্গুরের বাগান, কৃষিক্ষেত্র এবং পশুসমূহ হইতে যাকাত গ্রহণ করা হইবে না। কারণ সম্পদ পবিত্রকরণ উদ্দেশ্যে এবং মুসলিম দরিদ্র ব্যক্তিগণকে প্রদানের জন্য যাকাত শুধু মুসলিমদের উপর ধার্য হয়। জিযয়া অমুসলিম বাসিন্দাদেরকে অধঃস্থ দেখাইবার জন্য কেবল তাহাদের উপর ধার্য করা হইয়াছে। সুতরাং যতদিন তাহারা সন্ধিকৃত এলাকায় বসবাস করিবে, তাহাদের উপর জিযয়া ব্যতীত আর কিছুই ধার্য হইবে না। তবে মুসলিম অধুষিত অঞ্চলে তাহারা ব্যবসার উদ্দেশ্যে আসা-যাওয়া করিলে তাহাদের ব্যবসায়ের মাল হইতে এক-দশমাংশ আদায় করা হইবে। কারণ স্বীয় অঞ্চলে বসবাস করার এবং শক্ৰ হইতে রক্ষা করার ভিত্তিতেই তাহাদের উপর জিযয়া ধার্য করা হইয়াছিল। সুতরাং স্বীয় অঞ্চলের বাহিরে গিয়া ব্যবসায়ে লিপ্ত হইলে ব্যবসায়ের মাল হইতে এক-দশমাংশ আদায় করা হইবে। যেমন মিসরে বসবাসকারী অমুসলিম বাসিন্দা সিরিয়ায়, সিরিয়ার যিম্মী ইরাকে, ইরাকের যিম্মী অধিবাসী মদিনায় ব্যবসা করিতে গেলে তাহার ব্যবসায়ের মালে এক-দশমাংশ কর ধার্য করা হইবে। আহলে কিতাব এবং অগ্নি-উপাসক (অর্থাৎ অমুসলিম যিম্মী) বাসিন্দাদের পশুপাল, ফল এবং কৃষিক্ষেত্রে কোনরূপ যাকাত ধার্য করা যাইবে না। এমনিভাবে অমুসলিম যিম্মী নাগরিকদিগকে তাহাদের পৈতৃক ধর্মে প্রতিষ্ঠিত থাকিতে দেওয়া হইবে এবং তাহদের ধর্মীয় বিষয়ে কোনরূপ হস্তক্ষেপ করা যাইবে না। কিন্তু দারুল ইসলামে যতবার তাহারা ব্যবসা করিতে আসিবে তাহাদের নিকট হইতে ততবার এক-দশমাংশ কর আদায় করা হইবে। অর্থাৎ বাণিজ্য উদ্দেশ্যে বৎসরে কয়েকবার আসিলে প্রত্যেকবারই উক্ত কর দিবে। কারণ তাহাদের ব্যবসায়ের মধ্যে কর ধার্য করা যাইবে না বলিয়া কোনরূপ চুক্তি তাহাদের সঙ্গে হয় নাই। আমাদের শহরবাসী (মদীনাবাসী) আলিমগণকে উক্তরূপ আমল করিতে আমি দেখিয়াছি।",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 619
			}
		}
	]
}