{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"22": "The Book of Musaqah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3962,
			"arabicnumber": "1551.01",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْهَا مِنْ ثَمَرٍ أَوْ زَرْعٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 3963,
			"arabicnumber": "1551.02",
			"text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا عَلِيٌّ، - وَهُوَ ابْنُ مُسْهِرٍ - أَخْبَرَنَا عُبَيْدُ، اللَّهِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ أَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ فَكَانَ يُعْطِي أَزْوَاجَهُ كَلَّ سَنَةٍ مِائَةَ وَسْقٍ ثَمَانِينَ وَسْقًا مِنْ تَمْرٍ وَعِشْرِينَ وَسْقًا مِنْ شَعِيرٍ فَلَمَّا وَلِيَ عُمَرُ قَسَمَ خَيْبَرَ خَيَّرَ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم أَنْ يُقْطِعَ لَهُنَّ الأَرْضَ وَالْمَاءَ أَوْ يَضْمَنَ لَهُنَّ الأَوْسَاقَ كُلَّ عَامٍ فَاخْتَلَفْنَ فَمِنْهُنَّ مَنِ اخْتَارَ الأَرْضَ وَالْمَاءَ وَمِنْهُنَّ مَنِ اخْتَارَ الأَوْسَاقَ كُلَّ عَامٍ فَكَانَتْ عَائِشَةُ وَحَفْصَةُ مِمَّنِ اخْتَارَتَا الأَرْضَ وَالْمَاءَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3964,
			"arabicnumber": "1551.03",
			"text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنِي نَافِعٌ، عَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا خَرَجَ مِنْهَا مِنْ زَرْعٍ أَوْ ثَمَرٍ ‏.‏ وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِ عَلِيِّ بْنِ مُسْهِرٍ وَلَمْ يَذْكُرْ فَكَانَتْ عَائِشَةُ وَحَفْصَةُ مِمَّنِ اخْتَارَتَا الأَرْضَ وَالْمَاءَ وَقَالَ خَيَّرَ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم أَنْ يُقْطِعَ لَهُنَّ الأَرْضَ وَلَمْ يَذْكُرِ الْمَاءَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 3965,
			"arabicnumber": "1551.04",
			"text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ اللَّيْثِيُّ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ لَمَّا افْتُتِحَتْ خَيْبَرُ سَأَلَتْ يَهُودُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يُقِرَّهُمْ فِيهَا عَلَى أَنْ يَعْمَلُوا عَلَى نِصْفِ مَا خَرَجَ مِنْهَا مِنَ الثَّمَرِ وَالزَّرْعِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أُقِرُّكُمْ فِيهَا عَلَى ذَلِكَ مَا شِئْنَا ‏\"‏ ‏.‏ ثُمَّ سَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ نُمَيْرٍ وَابْنِ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ وَزَادَ فِيهِ وَكَانَ الثَّمَرُ يُقْسَمُ عَلَى السُّهْمَانِ مِنْ نِصْفِ خَيْبَرَ فَيَأْخُذُ رَسُولُ اللَّهِ صلى الله عليه وسلم الْخُمُسَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3966,
			"arabicnumber": "1551.05",
			"text": "وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ نَافِعٍ، عَنْ عَبْدِ، اللَّهِ بْنِ عُمَرَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ وَلِرَسُولِ اللَّهِ صلى الله عليه وسلم شَطْرُ ثَمَرِهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 3967,
			"arabicnumber": "1551.06",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَإِسْحَاقُ بْنُ مَنْصُورٍ، - وَاللَّفْظُ لاِبْنِ رَافِعٍ - قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، بْنَ الْخَطَّابِ أَجْلَى الْيَهُودَ وَالنَّصَارَى مِنْ أَرْضِ الْحِجَازِ وَأَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا ظَهَرَ عَلَى خَيْبَرَ أَرَادَ إِخْرَاجَ الْيَهُودِ مِنْهَا وَكَانَتِ الأَرْضُ حِينَ ظُهِرَ عَلَيْهَا لِلَّهِ وَلِرَسُولِهِ وَلِلْمُسْلِمِينَ فَأَرَادَ إِخْرَاجَ الْيَهُودِ مِنْهَا فَسَأَلَتِ الْيَهُودُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يُقِرَّهُمْ بِهَا عَلَى أَنْ يَكْفُوا عَمَلَهَا وَلَهُمْ نِصْفُ الثَّمَرِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ نُقِرُّكُمْ بِهَا عَلَى ذَلِكَ مَا شِئْنَا ‏\"‏ ‏.‏ فَقَرُّوا بِهَا حَتَّى أَجْلاَهُمْ عُمَرُ إِلَى تَيْمَاءَ وَأَرِيحَاءَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 3968,
			"arabicnumber": "1552.01",
			"text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا إِلاَّ كَانَ مَا أُكِلَ مِنْهُ لَهُ صَدَقَةٌ وَمَا سُرِقَ مِنْهُ لَهُ صَدَقَةٌ وَمَا أَكَلَ السَّبُعُ مِنْهُ فَهُوَ لَهُ صَدَقَةٌ وَمَا أَكَلَتِ الطَّيْرُ فَهُوَ لَهُ صَدَقَةً وَلاَ يَرْزَؤُهُ أَحَدٌ إِلاَّ كَانَ لَهُ صَدَقَةٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 3969,
			"arabicnumber": "1552.02",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَى أُمِّ مُبَشِّرٍ الأَنْصَارِيَّةِ فِي نَخْلٍ لَهَا فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم ‏\"‏ مَنْ غَرَسَ هَذَا النَّخْلَ أَمُسْلِمٌ أَمْ كَافِرٌ ‏\"‏ ‏.‏ فَقَالَتْ بَلْ مُسْلِمٌ ‏.‏ فَقَالَ ‏\"‏ لاَ يَغْرِسُ مُسْلِمٌ غَرْسًا وَلاَ يَزْرَعُ زَرْعًا فَيَأْكُلَ مِنْهُ إِنْسَانٌ وَلاَ دَابَّةٌ وَلاَ شَىْءٌ إِلاَّ كَانَتْ لَهُ صَدَقَةٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 3970,
			"arabicnumber": "1552.03",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي خَلَفٍ، قَالاَ حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ يَغْرِسُ رَجُلٌ مُسْلِمٌ غَرْسًا وَلاَ زَرْعًا فَيَأْكُلَ مِنْهُ سَبُعٌ أَوْ طَائِرٌ أَوْ شَىْءٌ إِلاَّ كَانَ لَهُ فِيهِ أَجْرٌ ‏\"‏ ‏.‏ وَقَالَ ابْنُ أَبِي خَلَفٍ طَائِرٌ شَىْءٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 3971,
			"arabicnumber": "1552.04",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدِ بْنِ إِبْرَاهِيمَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ دَخَلَ النَّبِيُّ صلى الله عليه وسلم عَلَى أُمِّ مَعْبَدٍ حَائِطًا فَقَالَ ‏\"‏ يَا أُمَّ مَعْبَدٍ مَنْ غَرَسَ هَذَا النَّخْلَ أَمُسْلِمٌ أَمْ كَافِرٌ ‏\"‏ ‏.‏ فَقَالَتْ بَلْ مُسْلِمٌ ‏.‏ قَالَ ‏\"‏ فَلاَ يَغْرِسُ الْمُسْلِمُ غَرْسًا فَيَأْكُلَ مِنْهُ إِنْسَانٌ وَلاَ دَابَّةٌ وَلاَ طَيْرٌ إِلاَّ كَانَ لَهُ صَدَقَةً إِلَى يَوْمِ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 3972,
			"arabicnumber": "1552.05",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَإِسْحَاقُ، بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ فُضَيْلٍ، كُلُّ هَؤُلاَءِ عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، ‏.‏ زَادَ عَمْرٌو فِي رِوَايَتِهِ عَنْ عَمَّارٍ، وَأَبُو كُرَيْبٍ فِي رِوَايَتِهِ عَنْ أَبِي مُعَاوِيَةَ، فَقَالاَ عَنْ أُمِّ مُبَشِّرٍ، وَفَى رِوَايَةِ ابْنِ فُضَيْلٍ عَنِ امْرَأَةِ، زَيْدِ بْنِ حَارِثَةَ وَفِي رِوَايَةِ إِسْحَاقَ عَنْ أَبِي مُعَاوِيَةَ، قَالَ رُبَّمَا قَالَ عَنْ أُمِّ مُبَشِّرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَرُبَّمَا لَمْ يَقُلْ وَكُلُّهُمْ قَالُوا عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِ حَدِيثِ عَطَاءٍ وَأَبِي الزُّبَيْرِ وَعَمْرِو بْنِ دِينَارٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 3973,
			"arabicnumber": "1553.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَا مِنْ مُسْلِمٍ يَغْرِسُ غَرْسًا أَوْ يَزْرَعُ زَرْعًا فَيَأْكُلُ مِنْهُ طَيْرٌ أَوْ إِنْسَانٌ أَوْ بَهِيمَةٌ إِلاَّ كَانَ لَهُ بِهِ صَدَقَةٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 3974,
			"arabicnumber": "1553.02",
			"text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، حَدَّثَنَا قَتَادَةُ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم دَخَلَ نَخْلاً لأُمِّ مُبَشِّرٍ - امْرَأَةٍ مِنَ الأَنْصَارِ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ غَرَسَ هَذَا النَّخْلَ أَمُسْلِمٌ أَمْ كَافِرٌ ‏\"‏ ‏.‏ قَالُوا مُسْلِمٌ ‏.‏ بِنَحْوِ حَدِيثِهِمْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 3975,
			"arabicnumber": "1554.01",
			"text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا ‏\"‏‏.‏ ح. وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا أَبُو ضَمْرَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَوْ بِعْتَ مِنْ أَخِيكَ ثَمَرًا فَأَصَابَتْهُ جَائِحَةٌ فَلاَ يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 3976,
			"arabicnumber": "1554.02",
			"text": "وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 3977,
			"arabicnumber": "1555.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ ثَمَرِ النَّخْلِ حَتَّى تَزْهُوَ ‏.‏ فَقُلْنَا لأَنَسٍ مَا زَهْوُهَا قَالَ تَحْمَرُّ وَتَصْفَرُّ ‏.‏ أَرَأَيْتَكَ إِنْ مَنَعَ اللَّهُ الثَّمَرَةَ بِمَ تَسْتَحِلُّ مَالَ أَخِيكَ",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 3978,
			"arabicnumber": "1555.02",
			"text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكٌ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَنَسِ، بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الثَّمَرَةِ حَتَّى تُزْهِيَ قَالُوا وَمَا تُزْهِيَ قَالَ تَحْمَرُّ ‏.‏ فَقَالَ إِذَا مَنَعَ اللَّهُ الثَّمَرَةَ فَبِمَ تَسْتَحِلُّ مَالَ أَخِيكَ",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 3979,
			"arabicnumber": "1555.03",
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنْ لَمْ يُثْمِرْهَا اللَّهُ فَبِمَ يَسْتَحِلُّ أَحَدُكُمْ مَالَ أَخِيهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 3980,
			"arabicnumber": "1554.03",
			"text": "حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ، وَإِبْرَاهِيمُ بْنُ دِينَارٍ، وَعَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ، - وَاللَّفْظُ لِبِشْرٍ - قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ حُمَيْدٍ الأَعْرَجِ، عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ، عَنْ جَابِرٍ، أَنَّوسلم أَمَرَ بِوَضْعِ الْجَوَائِحِ ‏.‏ قَالَ أَبُو إِسْحَاقَ - وَهْوَ صَاحِبُ مُسْلِمٍ - حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ عَنْ سُفْيَانَ بِهَذَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 3981,
			"arabicnumber": "1556.01",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ بُكَيْرٍ، عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي، سَعِيدٍ الْخُدْرِيِّ قَالَ أُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ تَصَدَّقُوا عَلَيْهِ ‏\"‏ ‏.‏ فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِغُرَمَائِهِ ‏\"‏ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلاَّ ذَلِكَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 3982,
			"arabicnumber": "1556.02",
			"text": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الأَعْلَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 3983,
			"arabicnumber": "1557",
			"text": "وَحَدَّثَنِي غَيْرُ، وَاحِدٍ، مِنْ أَصْحَابِنَا قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ، - وَهُوَ ابْنُ بِلاَلٍ - عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي الرِّجَالِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أُمَّهُ، عَمْرَةَ بِنْتَ عَبْدِ الرَّحْمَنِ قَالَتْ سَمِعْتُ عَائِشَةَ، تَقُولُ سَمِعَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَوْتَ خُصُومٍ بِالْبَابِ عَالِيَةً أَصْوَاتُهُمَا وَإِذَا أَحَدُهُمَا يَسْتَوْضِعُ الآخَرَ وَيَسْتَرْفِقُهُ فِي شَىْءٍ وَهُوَ يَقُولُ وَاللَّهِ لاَ أَفْعَلُ ‏.‏ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهِمَا فَقَالَ ‏ \"‏ أَيْنَ الْمُتَأَلِّي عَلَى اللَّهِ لاَ يَفْعَلُ الْمَعْرُوفَ ‏\"‏ ‏.‏ قَالَ أَنَا يَا رَسُولَ اللَّهِ فَلَهُ أَىُّ ذَلِكَ أَحَبَّ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 3984,
			"arabicnumber": "1558.01",
			"text": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ، أَخْبَرَهُ عَنْ أَبِيهِ، أَنَّهُ تَقَاضَى ابْنَ أَبِي حَدْرَدٍ دَيْنًا كَانَ لَهُ عَلَيْهِ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَارْتَفَعَتْ أَصْوَاتُهُمَا حَتَّى سَمِعَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي بَيْتِهِ فَخَرَجَ إِلَيْهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى كَشَفَ سِجْفَ حُجْرَتِهِ وَنَادَى كَعْبَ بْنَ مَالِكٍ فَقَالَ ‏\"‏ يَا كَعْبُ ‏\"‏ ‏.‏ فَقَالَ لَبَّيْكَ يَا رَسُولَ اللَّهِ ‏.‏ فَأَشَارَ إِلَيْهِ بِيَدِهِ أَنْ ضَعِ الشَّطْرَ مِنْ دَيْنِكَ ‏.‏ قَالَ كَعْبٌ قَدْ فَعَلْتُ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُمْ فَاقْضِهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 3985,
			"arabicnumber": "1558.02",
			"text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ،لا عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، أَنَّ كَعْبَ بْنَ مَالِكٍ، أَخْبَرَهُ أَنَّهُ، تَقَاضَى دَيْنًا لَهُ عَلَى ابْنِ أَبِي حَدْرَدٍ بِمِثْلِ حَدِيثِ ابْنِ وَهْبٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 3986,
			"arabicnumber": "1558.03",
			"text": "قَالَ مُسْلِمٌ وَرَوَى اللَّيْثُ بْنُ سَعْدٍ، حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ، هُرْمُزَ عَنْ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ كَعْبِ بْنِ مَالِكٍ، أَنَّهُ كَانَ لَهُ مَالٌ عَلَى عَبْدِ اللَّهِ بْنِ أَبِي حَدْرَدٍ الأَسْلَمِيِّ فَلَقِيَهُ فَلَزِمَهُ فَتَكَلَّمَا حَتَّى ارْتَفَعَتْ أَصْوَاتُهُمَا فَمَرَّ بِهِمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ يَا كَعْبُ ‏\"‏ ‏.‏ فَأَشَارَ بِيَدِهِ كَأَنَّهُ يَقُولُ النِّصْفَ فَأَخَذَ نِصْفًا مِمَّا عَلَيْهِ وَتَرَكَ نِصْفًا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 3987,
			"arabicnumber": "1559.01",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، أَخْبَرَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخْبَرَهُ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم - أَوْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ - ‏ \"‏ مَنْ أَدْرَكَ مَالَهُ بِعَيْنِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ - أَوْ إِنْسَانٍ قَدْ أَفْلَسَ - فَهُوَ أَحَقُّ بِهِ مِنْ غَيْرِهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 3988,
			"arabicnumber": "1559.02",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، جَمِيعًا عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ، وَيَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، قَالاَ حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ زَيْدٍ - ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، وَيَحْيَى بْنُ سَعِيدٍ، وَحَفْصُ بْنُ غِيَاثٍ، كُلُّ هَؤُلاَءِ عَنْ يَحْيَى بْنِ سَعِيدٍ، فِي هَذَا الإِسْنَادِ ‏.‏ بِمَعْنَى حَدِيثِ زُهَيْرٍ وَقَالَ ابْنُ رُمْحٍ مِنْ بَيْنِهِمْ فِي رِوَايَتِهِ أَيُّمَا امْرِئٍ فُلِّسَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 3989,
			"arabicnumber": "1559.03",
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا هِشَامُ بْنُ سُلَيْمَانَ، - وَهُوَ ابْنُ عِكْرِمَةَ بْنِ خَالِدٍ الْمَخْزُومِيُّ - عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي ابْنُ أَبِي حُسَيْنٍ، أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، أَخْبَرَهُ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ حَدَّثَهُ عَنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَدِيثِ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي الرَّجُلِ الَّذِي يُعْدِمُ إِذَا وُجِدَ عِنْدَهُ الْمَتَاعُ وَلَمْ يُفَرِّقْهُ ‏ \"‏ أَنَّهُ لِصَاحِبِهِ الَّذِي بَاعَهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 3990,
			"arabicnumber": "1559.04",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ بَشِيرِ بْنِ نَهِيكٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَفْلَسَ الرَّجُلُ فَوَجَدَ الرَّجُلُ مَتَاعَهُ بِعَيْنِهِ فَهُوَ أَحَقُّ بِهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 3991,
			"arabicnumber": "1559.05",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا سَعِيدٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، أَيْضًا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي كِلاَهُمَا، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ وَقَالاَ ‏ \"‏ فَهُوَ أَحَقُّ بِهِ مِنَ الْغُرَمَاءِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 3992,
			"arabicnumber": "1559.06",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا أَبُو سَلَمَةَ، الْخُزَاعِيُّ - قَالَ حَجَّاجٌ مَنْصُورُ بْنُ سَلَمَةَ - أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ خُثَيْمِ بْنِ عِرَاكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا أَفْلَسَ الرَّجُلُ فَوَجَدَ الرَّجُلُ عِنْدَهُ سِلْعَتَهُ بِعَيْنِهَا فَهُوَ أَحَقُّ بِهَا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 3993,
			"arabicnumber": "1560.01",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ رِبْعِيِّ بْنِ، حِرَاشٍ أَنَّ حُذَيْفَةَ، حَدَّثَهُمْ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَلَقَّتِ الْمَلاَئِكَةُ رُوحَ رَجُلٍ مِمَّنْ كَانَ قَبْلَكُمْ فَقَالُوا أَعَمِلْتَ مِنَ الْخَيْرِ شَيْئًا قَالَ لاَ ‏.‏ قَالُوا تَذَكَّرْ ‏.‏ قَالَ كُنْتُ أُدَايِنُ النَّاسَ فَآمُرُ فِتْيَانِي أَنْ يُنْظِرُوا الْمُعْسِرَ وَيَتَجَوَّزُوا عَنِ الْمُوسِرِ - قَالَ - قَالَ اللَّهُ عَزَّ وَجَلَّ تَجَوَّزُوا عَنْهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 3994,
			"arabicnumber": "1560.02",
			"text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لاِبْنِ حُجْرٍ - قَالاَ حَدَّثَنَا جَرِيرٌ، عَنِ الْمُغِيرَةِ، عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، قَالَ اجْتَمَعَ حُذَيْفَةُ وَأَبُو مَسْعُودٍ فَقَالَ حُذَيْفَةُ ‏ \"‏ رَجُلٌ لَقِيَ رَبَّهُ فَقَالَ مَا عَمِلْتَ قَالَ مَا عَمِلْتُ مِنَ الْخَيْرِ إِلاَّ أَنِّي كُنْتُ رَجُلاً ذَا مَالٍ فَكُنْتُ أُطَالِبُ بِهِ النَّاسَ فَكُنْتُ أَقْبَلُ الْمَيْسُورَ وَأَتَجَاوَزُ عَنِ الْمَعْسُورِ ‏.‏ فَقَالَ تَجَاوَزُوا عَنْ عَبْدِي ‏\"‏ ‏.‏ قَالَ أَبُو مَسْعُودٍ هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 3995,
			"arabicnumber": "1560.03",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ، عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ‏ \"‏ أَنَّ رَجُلاً مَاتَ فَدَخَلَ الْجَنَّةَ فَقِيلَ لَهُ مَا كُنْتَ تَعْمَلُ قَالَ فَإِمَّا ذَكَرَ وَإِمَّا ذُكِّرَ ‏.‏ فَقَالَ إِنِّي كُنْتُ أُبَايِعُ النَّاسَ فَكُنْتُ أُنْظِرُ الْمُعْسِرَ وَأَتَجَوَّزُ فِي السِّكَّةِ أَوْ فِي النَّقْدِ ‏.‏ فَغُفِرَ لَهُ ‏\"‏ ‏.‏ فَقَالَ أَبُو مَسْعُودٍ وَأَنَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 3996,
			"arabicnumber": "1560.04",
			"text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ سَعْدِ بْنِ طَارِقٍ، عَنْ رِبْعِيِّ، بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ، قَالَ ‏ \"‏ أُتِيَ اللَّهُ بِعَبْدٍ مِنْ عِبَادِهِ آتَاهُ اللَّهُ مَالاً فَقَالَ لَهُ مَاذَا عَمِلْتَ فِي الدُّنْيَا - قَالَ وَلاَ يَكْتُمُونَ اللَّهَ حَدِيثًا - قَالَ يَا رَبِّ آتَيْتَنِي مَالَكَ فَكُنْتُ أُبَايِعُ النَّاسَ وَكَانَ مِنْ خُلُقِي الْجَوَازُ فَكُنْتُ أَتَيَسَّرُ عَلَى الْمُوسِرِ وَأُنْظِرُ الْمُعْسِرَ ‏.‏ فَقَالَ اللَّهُ أَنَا أَحَقُّ بِذَا مِنْكَ تَجَاوَزُوا عَنْ عَبْدِي ‏\"‏ ‏.‏ فَقَالَ عُقْبَةُ بْنُ عَامِرٍ الْجُهَنِيُّ وَأَبُو مَسْعُودٍ الأَنْصَارِيُّ هَكَذَا سَمِعْنَاهُ مِنْ فِي رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 3997,
			"arabicnumber": "1561",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ حُوسِبَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ فَلَمْ يُوجَدْ لَهُ مِنَ الْخَيْرِ شَىْءٌ إِلاَّ أَنَّهُ كَانَ يُخَالِطُ النَّاسَ وَكَانَ مُوسِرًا فَكَانَ يَأْمُرُ غِلْمَانَهُ أَنْ يَتَجَاوَزُوا عَنِ الْمُعْسِرِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ نَحْنُ أَحَقُّ بِذَلِكَ مِنْهُ تَجَاوَزُوا عَنْهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 3998,
			"arabicnumber": "1562.01",
			"text": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، وَمُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، - قَالَ مَنْصُورٌ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنِ الزُّهْرِيِّ، وَقَالَ ابْنُ جَعْفَرٍ، أَخْبَرَنَا إِبْرَاهِيمُ، وَهُوَ ابْنُ سَعْدٍ عَنِ ابْنِ، شِهَابٍ عَنِ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ كَانَ رَجُلٌ يُدَايِنُ النَّاسَ فَكَانَ يَقُولُ لِفَتَاهُ إِذَا أَتَيْتَ مُعْسِرًا فَتَجَاوَزْ عَنْهُ لَعَلَّ اللَّهَ يَتَجَاوَزُ عَنَّا ‏.‏ فَلَقِيَ اللَّهَ فَتَجَاوَزَ عَنْهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 3999,
			"arabicnumber": "1562.02",
			"text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏.‏ بِمِثْلِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 4000,
			"arabicnumber": "1563.01",
			"text": "حَدَّثَنَا أَبُو الْهَيْثَمِ، خَالِدُ بْنُ خِدَاشِ بْنِ عَجْلاَنَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، أَنَّ أَبَا قَتَادَةَ، طَلَبَ غَرِيمًا لَهُ فَتَوَارَى عَنْهُ ثُمَّ وَجَدَهُ فَقَالَ إِنِّي مُعْسِرٌ ‏.‏ فَقَالَ آللَّهِ قَالَ آللَّهِ ‏.‏ قَالَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ سَرَّهُ أَنْ يُنْجِيَهُ اللَّهُ مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ فَلْيُنَفِّسْ عَنْ مُعْسِرٍ أَوْ يَضَعْ عَنْهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 4001,
			"arabicnumber": "1563.02",
			"text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 4002,
			"arabicnumber": "1564.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ‏.‏ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 4003,
			"arabicnumber": "1564.02",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالاَ جَمِيعًا حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 4004,
			"arabicnumber": "1565.01",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، أَخْبَرَنَا وَكِيعٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ فَضْلِ الْمَاءِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 4005,
			"arabicnumber": "1565.02",
			"text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ ضِرَابِ الْجَمَلِ وَعَنْ بَيْعِ الْمَاءِ وَالأَرْضِ لِتُحْرَثَ ‏.‏ فَعَنْ ذَلِكَ نَهَى النَّبِيُّ صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 4006,
			"arabicnumber": "1566.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، كِلاَهُمَا عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلأُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 4007,
			"arabicnumber": "1566.02",
			"text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، - وَاللَّفْظُ لِحَرْمَلَةَ - أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَمْنَعُوا فَضْلَ الْمَاءِ لِتَمْنَعُوا بِهِ الْكَلأَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 4008,
			"arabicnumber": "1566.03",
			"text": "وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي زِيَادُ بْنُ سَعْدٍ، أَنَّ هِلاَلَ بْنَ أُسَامَةَ، أَخْبَرَهُ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يُبَاعُ فَضْلُ الْمَاءِ لِيُبَاعَ بِهِ الْكَلأُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 4009,
			"arabicnumber": "1567.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي بَكْرِ بْنِ، عَبْدِ الرَّحْمَنِ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 4010,
			"arabicnumber": "1567.02",
			"text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ، بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏ وَفِي حَدِيثِ اللَّيْثِ مِنْ رِوَايَةِ ابْنِ رُمْحٍ أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 4011,
			"arabicnumber": "1568.01",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ مُحَمَّدِ بْنِ يُوسُفَ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يُحَدِّثُ عَنْ رَافِعِ بْنِ خَدِيجٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ وَثَمَنُ الْكَلْبِ وَكَسْبُ الْحَجَّامِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 4012,
			"arabicnumber": "1568.02",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى، بْنِ أَبِي كَثِيرٍ حَدَّثَنِي إِبْرَاهِيمُ بْنُ قَارِظٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ ثَمَنُ الْكَلْبِ خَبِيثٌ وَمَهْرُ الْبَغِيِّ خَبِيثٌ وَكَسْبُ الْحَجَّامِ خَبِيثٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 4013,
			"arabicnumber": "1568.03",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ يَحْيَى بْنِ أَبِي، كَثِيرٍ بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 4014,
			"arabicnumber": "1568.04",
			"text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى، بْنِ أَبِي كَثِيرٍ حَدَّثَنِي إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ، عَنِ السَّائِبِ بْنِ يَزِيدَ، حَدَّثَنَا رَافِعُ بْنُ خَدِيجٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 4015,
			"arabicnumber": "1569",
			"text": "حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ سَأَلْتُ جَابِرًا عَنْ ثَمَنِ الْكَلْبِ، وَالسِّنَّوْرِ، قَالَ زَجَرَ النَّبِيُّ صلى الله عليه وسلم عَنْ ذَلِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 4016,
			"arabicnumber": "1570.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 4017,
			"arabicnumber": "1570.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلِ الْكِلاَبِ فَأَرْسَلَ فِي أَقْطَارِ الْمَدِينَةِ أَنْ تُقْتَلَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 4018,
			"arabicnumber": "1570.03",
			"text": "وَحَدَّثَنِي حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ الْمُفَضَّلِ - حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ أُمَيَّةَ - عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِقَتْلِ الْكِلاَبِ فَنَنْبَعِثُ فِي الْمَدِينَةِ وَأَطْرَافِهَا فَلاَ نَدَعُ كَلْبًا إِلاَّ قَتَلْنَاهُ حَتَّى إِنَّا لَنَقْتُلُ كَلْبَ الْمُرَيَّةِ مِنْ أَهْلِ الْبَادِيَةِ يَتْبَعُهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 4019,
			"arabicnumber": "1571",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْكِلاَبِ إِلاَّ كَلْبَ صَيْدٍ أَوْ كَلْبَ غَنَمٍ أَوْ مَاشِيَةٍ ‏.‏ فَقِيلَ لاِبْنِ عُمَرَ إِنَّ أَبَا هُرَيْرَةَ يَقُولُ أَوْ كَلْبَ زَرْعٍ ‏.‏ فَقَالَ ابْنُ عُمَرَ إِنَّ لأَبِي هُرَيْرَةَ زَرْعًا",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 4020,
			"arabicnumber": "1572",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلِ الْكِلاَبِ حَتَّى إِنَّ الْمَرْأَةَ تَقْدَمُ مِنَ الْبَادِيَةِ بِكَلْبِهَا فَنَقْتُلُهُ ثُمَّ نَهَى النَّبِيُّ صلى الله عليه وسلم عَنْ قَتْلِهَا وَقَالَ ‏ \"‏ عَلَيْكُمْ بِالأَسْوَدِ الْبَهِيمِ ذِي النُّقْطَتَيْنِ فَإِنَّهُ شَيْطَانٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 4021,
			"arabicnumber": "1573.01",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، سَمِعَ مُطَرِّفَ، بْنَ عَبْدِ اللَّهِ عَنِ ابْنِ الْمُغَفَّلِ، قَالَ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَتْلِ الْكِلاَبِ ثُمَّ قَالَ ‏ \"‏ مَا بَالُهُمْ وَبَالُ الْكِلاَبِ ‏\"‏ ‏.‏ ثُمَّ رَخَّصَ فِي كَلْبِ الصَّيْدِ وَكَلْبِ الْغَنَمِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 4022,
			"arabicnumber": "1573.02",
			"text": "وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ، حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، كُلُّهُمْ عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ ‏.‏ وَقَالَ ابْنُ حَاتِمٍ فِي حَدِيثِهِ عَنْ يَحْيَى، وَرَخَّصَ، فِي كَلْبِ الْغَنَمِ وَالصَّيْدِ وَالزَّرْعِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 4023,
			"arabicnumber": "1574.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ ضَارِي نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 4024,
			"arabicnumber": "1574.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 4025,
			"arabicnumber": "1574.03",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ - قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهْوَ ابْنُ جَعْفَرٍ - عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ ضَارِيَةٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 4026,
			"arabicnumber": "1574.04",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ مُحَمَّدٍ، - وَهُوَ ابْنُ أَبِي حَرْمَلَةَ - عَنْ سَالِمِ بْنِ عَبْدِ، اللَّهِ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ كَلْبَ صَيْدٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ عَبْدُ اللَّهِ وَقَالَ أَبُو هُرَيْرَةَ ‏\"‏ أَوْ كَلْبَ حَرْثٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 4027,
			"arabicnumber": "1574.05",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اقْتَنَى كَلْبًا إِلاَّ كَلْبَ ضَارٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطَانِ ‏\"‏ ‏.‏ قَالَ سَالِمٌ وَكَانَ أَبُو هُرَيْرَةَ يَقُولُ ‏\"‏ أَوْ كَلْبَ حَرْثٍ ‏\"‏ ‏.‏ وَكَانَ صَاحِبَ حَرْثٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 4028,
			"arabicnumber": "1574.06",
			"text": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، أَخْبَرَنَا عُمَرُ بْنُ حَمْزَةَ بْنِ عَبْدِ، اللَّهِ بْنِ عُمَرَ حَدَّثَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَيُّمَا أَهْلِ دَارٍ اتَّخَذُوا كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ كَلْبَ صَائِدٍ نَقَصَ مِنْ عَمَلِهِمْ كُلَّ يَوْمٍ قِيرَاطَانِ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 4029,
			"arabicnumber": "1574.07",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي الْحَكَمِ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اتَّخَذَ كَلْبًا إِلاَّ كَلْبَ زَرْعٍ أَوْ غَنَمٍ أَوْ صَيْدٍ يَنْقُصُ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 4030,
			"arabicnumber": "1575.01",
			"text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ، شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَنِ اقْتَنَى كَلْبًا لَيْسَ بِكَلْبِ صَيْدٍ وَلاَ مَاشِيَةٍ وَلاَ أَرْضٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ قِيرَاطَانِ كُلَّ يَوْمٍ ‏\"‏ ‏.‏ وَلَيْسَ فِي حَدِيثِ أَبِي الطَّاهِرِ ‏\"‏ وَلاَ أَرْضٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 4031,
			"arabicnumber": "1575.02",
			"text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اتَّخَذَ كَلْبًا إِلاَّ كَلْبَ مَاشِيَةٍ أَوْ صَيْدٍ أَوْ زَرْعٍ انْتَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ الزُّهْرِيُّ فَذُكِرَ لاِبْنِ عُمَرَ قَوْلُ أَبِي هُرَيْرَةَ فَقَالَ يَرْحَمُ اللَّهُ أَبَا هُرَيْرَةَ كَانَ صَاحِبَ زَرْعٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 4032,
			"arabicnumber": "1575.03",
			"text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَمْسَكَ كَلْبًا فَإِنَّهُ يَنْقُصُ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ إِلاَّ كَلْبَ حَرْثٍ أَوْ مَاشِيَةٍ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 4033,
			"arabicnumber": "1575.04",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا شُعَيْبُ بْنُ إِسْحَاقَ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنِي أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 4034,
			"arabicnumber": "1575.05",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 4035,
			"arabicnumber": "1575.06",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - عَنْ إِسْمَاعِيلَ، بْنِ سُمَيْعٍ حَدَّثَنَا أَبُو رَزِينٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ اتَّخَذَ كَلْبًا لَيْسَ بِكَلْبِ صَيْدٍ وَلاَ غَنَمٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 4036,
			"arabicnumber": "1576.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، أَنَّ السَّائِبَ، بْنَ يَزِيدَ أَخْبَرَهُ أَنَّهُ، سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ، - وَهُوَ رَجُلٌ مِنْ شَنُوءَةَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنِ اقْتَنَى كَلْبًا لاَ يُغْنِي عَنْهُ زَرْعًا وَلاَ ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ ‏\"‏ ‏.‏ قَالَ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ إِي وَرَبِّ هَذَا الْمَسْجِدِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 4037,
			"arabicnumber": "1576.02",
			"text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، عَنْ يَزِيدَ بْنِ، خُصَيْفَةَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ، أَنَّهُ وَفَدَ عَلَيْهِمْ سُفْيَانُ بْنُ أَبِي زُهَيْرٍ الشَّنَئِيُّ فَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 4038,
			"arabicnumber": "1577.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ عَنْ كَسْبِ الْحَجَّامِ، فَقَالَ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَجَمَهُ أَبُو طَيْبَةَ فَأَمَرَ لَهُ بِصَاعَيْنِ مِنْ طَعَامٍ وَكَلَّمَ أَهْلَهُ فَوَضَعُوا عَنْهُ مِنْ خَرَاجِهِ وَقَالَ ‏ \"‏ إِنَّ أَفْضَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ أَوْ هُوَ مِنْ أَمْثَلِ دَوَائِكُمْ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 4039,
			"arabicnumber": "1577.02",
			"text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي الْفَزَارِيَّ - عَنْ حُمَيْدٍ، قَالَ سُئِلَ أَنَسٌ عَنْ كَسْبِ الْحَجَّامِ، فَذَكَرَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏ \"‏ إِنَّ أَفْضَلَ مَا تَدَاوَيْتُمْ بِهِ الْحِجَامَةُ وَالْقُسْطُ الْبَحْرِيُّ وَلاَ تُعَذِّبُوا صِبْيَانَكُمْ بِالْغَمْزِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 4040,
			"arabicnumber": "1577.03",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ دَعَا النَّبِيُّ صلى الله عليه وسلم غُلاَمًا لَنَا حَجَّامًا فَحَجَمَهُ فَأَمَرَ لَهُ بِصَاعٍ أَوْ مُدٍّ أَوْ مُدَّيْنِ وَكَلَّمَ فِيهِ فَخُفِّفَ عَنْ ضَرِيبَتِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 4041,
			"arabicnumber": "1202.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، كِلاَهُمَا عَنْ وُهَيْبٍ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 4042,
			"arabicnumber": "1202.03",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لِعَبْدٍ - قَالاَ أَخْبَرَنَا عَبْدُ، الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَجَمَ النَّبِيَّ صلى الله عليه وسلم عَبْدٌ لِبَنِي بَيَاضَةَ فَأَعْطَاهُ النَّبِيُّ صلى الله عليه وسلم أَجْرَهُ وَكَلَّمَ سَيِّدَهُ فَخَفَّفَ عَنْهُ مِنْ ضَرِيبَتِهِ وَلَوْ كَانَ سُحْتًا لَمْ يُعْطِهِ النَّبِيُّ صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 4043,
			"arabicnumber": "1578",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى أَبُو هَمَّامٍ، حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَخْطُبُ بِالْمَدِينَةِ قَالَ ‏\"‏ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ تَعَالَى يُعَرِّضُ بِالْخَمْرِ وَلَعَلَّ اللَّهَ سَيُنْزِلُ فِيهَا أَمْرًا فَمَنْ كَانَ عِنْدَهُ مِنْهَا شَىْءٌ فَلْيَبِعْهُ وَلْيَنْتَفِعْ بِهِ ‏\"‏ ‏.‏ قَالَ فَمَا لَبِثْنَا إِلاَّ يَسِيرًا حَتَّى قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ اللَّهَ تَعَالَى حَرَّمَ الْخَمْرَ فَمَنْ أَدْرَكَتْهُ هَذِهِ الآيَةُ وَعِنْدَهُ مِنْهَا شَىْءٌ فَلاَ يَشْرَبْ وَلاَ يَبِعْ ‏\"‏ ‏.‏ قَالَ فَاسْتَقْبَلَ النَّاسُ بِمَا كَانَ عِنْدَهُ مِنْهَا فِي طَرِيقِ الْمَدِينَةِ فَسَفَكُوهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 4044,
			"arabicnumber": "1579.01",
			"text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ، بْنِ وَعْلَةَ - رَجُلٌ مِنْ أَهْلِ مِصْرَ - أَنَّهُ جَاءَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ ح . وَحَدَّثَنَا أَبُو الطَّاهِرِ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، وَغَيْرُهُ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ السَّبَإِيِّ، - مِنْ أَهْلِ مِصْرَ - أَنَّهُ سَأَلَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ عَمَّا يُعْصَرُ مِنْ الْعِنَبِ فَقَالَ ابْنُ عَبَّاسٍ إِنَّ رَجُلًا أَهْدَى لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاوِيَةَ خَمْرٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ عَلِمْتَ أَنَّ اللَّهَ قَدْ حَرَّمَهَا قَالَ لَا فَسَارَّ إِنْسَانًا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَ سَارَرْتَهُ فَقَالَ أَمَرْتُهُ بِبَيْعِهَا فَقَالَ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا قَالَ فَفَتَحَ الْمَزَادَةَ حَتَّى ذَهَبَ مَا فِيهَا",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 4045,
			"arabicnumber": "1579.02",
			"text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ، سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 4046,
			"arabicnumber": "1580.01",
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ زُهَيْرٌ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتِ الآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاقْتَرَأَهُنَّ عَلَى النَّاسِ ثُمَّ نَهَى عَنِ التِّجَارَةِ فِي الْخَمْرِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 4047,
			"arabicnumber": "1580.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا أُنْزِلَتِ الآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي الرِّبَا - قَالَتْ - خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْمَسْجِدِ فَحَرَّمَ التِّجَارَةَ فِي الْخَمْرِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 4048,
			"arabicnumber": "1581.01",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءِ بْنِ أَبِي، رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ ‏\"‏ إِنَّ اللَّهَ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالأَصْنَامِ ‏\"‏ ‏.‏ فَقِيلَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ وَيُدْهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ فَقَالَ ‏\"‏ لاَ هُوَ حَرَامٌ ‏\"‏ ‏.‏ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ ‏\"‏ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمْ شُحُومَهَا أَجْمَلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ ‏\"‏‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 4049,
			"arabicnumber": "1581.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عَبْدِ الْحَمِيدِ، بْنِ جَعْفَرٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا الضَّحَّاكُ - يَعْنِي أَبَا عَاصِمٍ - عَنْ عَبْدِ الْحَمِيدِ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ قَالَ كَتَبَ إِلَىَّ عَطَاءٌ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ بِمِثْلِ حَدِيثِ اللَّيْثِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 4050,
			"arabicnumber": "1582.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَلَغَ عُمَرَ أَنَّ سَمُرَةَ، بَاعَ خَمْرًا فَقَالَ قَاتَلَ اللَّهُ سَمُرَةَ أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لَعَنَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فَجَمَلُوهَا فَبَاعُوهَا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 4051,
			"arabicnumber": "1582.02",
			"text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، - يَعْنِي ابْنَ الْقَاسِمِ - عَنْ عَمْرِو بْنِ دِينَارٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 4052,
			"arabicnumber": "1583.01",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ قَاتَلَ اللَّهُ الْيَهُودَ حَرَّمَ اللَّهُ عَلَيْهِمُ الشُّحُومَ فَبَاعُوهَا وَأَكَلُوا أَثْمَانَهَا‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 4053,
			"arabicnumber": "1583.02",
			"text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ قَاتَلَ اللَّهُ الْيَهُودَ حُرِّمَ عَلَيْهِمُ الشَّحْمُ فَبَاعُوهُ وَأَكَلُوا ثَمَنَهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 4054,
			"arabicnumber": "1584.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهَا عَلَى بَعْضٍ وَلاَ تَبِيعُوا مِنْهَا غَائِبًا بِنَاجِزٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 4055,
			"arabicnumber": "1584.02",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ نَافِعٍ، أَنَّ ابْنَ عُمَرَ، قَالَ لَهُ رَجُلٌ مِنْ بَنِي لَيْثٍ إِنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ يَأْثُرُ هَذَا عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي رِوَايَةِ قُتَيْبَةَ فَذَهَبَ عَبْدُ اللَّهِ وَنَافِعٌ مَعَهُ ‏.‏ وَفِي حَدِيثِ ابْنِ رُمْحٍ قَالَ نَافِعٌ فَذَهَبَ عَبْدُ اللَّهِ وَأَنَا مَعَهُ وَاللَّيْثِيُّ حَتَّى دَخَلَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ فَقَالَ إِنَّ هَذَا أَخْبَرَنِي أَنَّكَ تُخْبِرُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ بَيْعِ الْوَرِقِ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَعَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ إِلاَّ مِثْلاً بِمِثْلٍ ‏.‏ فَأَشَارَ أَبُو سَعِيدٍ بِإِصْبَعَيْهِ إِلَى عَيْنَيْهِ وَأُذُنَيْهِ فَقَالَ أَبْصَرَتْ عَيْنَاىَ وَسَمِعَتْ أُذُنَاىَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ وَلاَ تَبِيعُوا الْوَرِقَ بِالْوَرِقِ إِلاَّ مِثْلاً بِمِثْلٍ وَلاَ تُشِفُّوا بَعْضَهُ عَلَى بَعْضٍ وَلاَ تَبِيعُوا شَيْئًا غَائِبًا مِنْهُ بِنَاجِزٍ إِلاَّ يَدًا بِيَدٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 4056,
			"arabicnumber": "1584.03",
			"text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ، أَبِي عَدِيٍّ عَنِ ابْنِ عَوْنٍ، كُلُّهُمْ عَنْ نَافِعٍ، ‏.‏ بِنَحْوِ حَدِيثِ اللَّيْثِ عَنْ نَافِعٍ، عَنْ أَبِي سَعِيدٍ، الْخُدْرِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 4057,
			"arabicnumber": "1584.04",
			"text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ وَلاَ الْوَرِقَ بِالْوَرِقِ إِلاَّ وَزْنًا بِوَزْنٍ مِثْلاً بِمِثْلٍ سَوَاءً بِسَوَاءٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 4058,
			"arabicnumber": "1585",
			"text": "حَدَّثَنَا أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالُوا حَدَّثَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ، يَقُولُ إِنَّهُ سَمِعَ مَالِكَ بْنَ، أَبِي عَامِرٍ يُحَدِّثُ عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ تَبِيعُوا الدِّينَارَ بِالدِّينَارَيْنِ وَلاَ الدِّرْهَمَ بِالدِّرْهَمَيْنِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 4059,
			"arabicnumber": "1586.01",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ مَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ، أَنَّهُ قَالَ أَقْبَلْتُ أَقُولُ مَنْ يَصْطَرِفُ الدَّرَاهِمَ فَقَالَ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ وَهُوَ عِنْدَ عُمَرَ بْنِ الْخَطَّابِ أَرِنَا ذَهَبَكَ ثُمَّ ائْتِنَا إِذَا جَاءَ خَادِمُنَا نُعْطِكَ وَرِقَكَ ‏.‏ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ كَلاَّ وَاللَّهِ لَتُعْطِيَنَّهُ وَرِقَهُ أَوْ لَتَرُدَّنَّ إِلَيْهِ ذَهَبَهُ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الْوَرِقُ بِالذَّهَبِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلاَّ هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلاَّ هَاءَ وَهَاءَ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 4060,
			"arabicnumber": "1586.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ، عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 4061,
			"arabicnumber": "1587.01",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، قَالَ كُنْتُ بِالشَّامِ فِي حَلْقَةٍ فِيهَا مُسْلِمُ بْنُ يَسَارٍ فَجَاءَ أَبُو الأَشْعَثِ قَالَ قَالُوا أَبُو الأَشْعَثِ أَبُو الأَشْعَثِ ‏.‏ فَجَلَسَ فَقُلْتُ لَهُ حَدِّثْ أَخَانَا حَدِيثَ عُبَادَةَ بْنِ الصَّامِتِ ‏.‏ قَالَ نَعَمْ غَزَوْنَا غَزَاةً وَعَلَى النَّاسِ مُعَاوِيَةُ فَغَنِمْنَا غَنَائِمَ كَثِيرَةً فَكَانَ فِيمَا غَنِمْنَا آنِيَةٌ مِنْ فِضَّةٍ فَأَمَرَ مُعَاوِيَةُ رَجُلاً أَنْ يَبِيعَهَا فِي أَعْطِيَاتِ النَّاسِ فَتَسَارَعَ النَّاسُ فِي ذَلِكَ فَبَلَغَ عُبَادَةَ بْنَ الصَّامِتِ فَقَامَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْ بَيْعِ الذَّهَبِ بِالذَّهَبِ وَالْفِضَّةِ بِالْفِضَّةِ وَالْبُرِّ بِالْبُرِّ وَالشَّعِيرِ بِالشَّعِيرِ وَالتَّمْرِ بِالتَّمْرِ وَالْمِلْحِ بِالْمِلْحِ إِلاَّ سَوَاءً بِسَوَاءٍ عَيْنًا بِعَيْنٍ فَمَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى ‏.‏ فَرَدَّ النَّاسُ مَا أَخَذُوا فَبَلَغَ ذَلِكَ مُعَاوِيَةَ فَقَامَ خَطِيبًا فَقَالَ أَلاَ مَا بَالُ رِجَالٍ يَتَحَدَّثُونَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَحَادِيثَ قَدْ كُنَّا نَشْهَدُهُ وَنَصْحَبُهُ فَلَمْ نَسْمَعْهَا مِنْهُ ‏.‏ فَقَامَ عُبَادَةُ بْنُ الصَّامِتِ فَأَعَادَ الْقِصَّةَ ثُمَّ قَالَ لَنُحَدِّثَنَّ بِمَا سَمِعْنَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَإِنْ كَرِهَ مُعَاوِيَةُ - أَوْ قَالَ وَإِنْ رَغِمَ - مَا أُبَالِي أَنْ لاَ أَصْحَبَهُ فِي جُنْدِهِ لَيْلَةً سَوْدَاءَ ‏.‏ قَالَ حَمَّادٌ هَذَا أَوْ نَحْوَهُ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 4062,
			"arabicnumber": "1587.02",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ عَبْدِ الْوَهَّابِ الثَّقَفِيِّ، عَنْ أَيُّوبَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 4063,
			"arabicnumber": "1587.03",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ خَالِدٍ، الْحَذَّاءِ عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الأَشْعَثِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ بِالذَّهَبِ وَالْفِضَّةُ بِالْفِضَّةِ وَالْبُرُّ بِالْبُرِّ وَالشَّعِيرُ بِالشَّعِيرِ وَالتَّمْرُ بِالتَّمْرِ وَالْمِلْحُ بِالْمِلْحِ مِثْلاً بِمِثْلٍ سَوَاءً بِسَوَاءٍ يَدًا بِيَدٍ فَإِذَا اخْتَلَفَتْ هَذِهِ الأَصْنَافُ فَبِيعُوا كَيْفَ شِئْتُمْ إِذَا كَانَ يَدًا بِيَدٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 4064,
			"arabicnumber": "1584.05",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ الْعَبْدِيُّ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ بِالذَّهَبِ وَالْفِضَّةُ بِالْفِضَّةِ وَالْبُرُّ بِالْبُرِّ وَالشَّعِيرُ بِالشَّعِيرِ وَالتَّمْرُ بِالتَّمْرِ وَالْمِلْحُ بِالْمِلْحِ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ فَمَنْ زَادَ أَوِ اسْتَزَادَ فَقَدْ أَرْبَى الآخِذُ وَالْمُعْطِي فِيهِ سَوَاءٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 4065,
			"arabicnumber": "1584.06",
			"text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا سُلَيْمَانُ الرَّبَعِيُّ، حَدَّثَنَا أَبُو الْمُتَوَكِّلِ النَّاجِيُّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ بِالذَّهَبِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏ فَذَكَرَ بِمِثْلِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 4066,
			"arabicnumber": "1588.01",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَوَاصِلُ بْنُ عَبْدِ الأَعْلَى قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ التَّمْرُ بِالتَّمْرِ وَالْحِنْطَةُ بِالْحِنْطَةِ وَالشَّعِيرُ بِالشَّعِيرِ وَالْمِلْحُ بِالْمِلْحِ مِثْلاً بِمِثْلٍ يَدًا بِيَدٍ فَمَنْ زَادَ أَوِ اسْتَزَادَ فَقَدْ أَرْبَى إِلاَّ مَا اخْتَلَفَتْ أَلْوَانُهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 4067,
			"arabicnumber": "1588.02",
			"text": "وَحَدَّثَنِيهِ أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ فُضَيْلِ بْنِ غَزْوَانَ، بِهَذَا الإِسْنَادِ ‏.‏ وَلَمْ يَذْكُرْ ‏ \"‏ يَدًا بِيَدٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 4068,
			"arabicnumber": "1588.03",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَوَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنِ ابْنِ أَبِي نُعْمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ مِثْلاً بِمِثْلٍ وَالْفِضَّةُ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ مِثْلاً بِمِثْلٍ فَمَنْ زَادَ أَوِ اسْتَزَادَ فَهُوَ رِبًا‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 4069,
			"arabicnumber": "1588.04",
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ مُوسَى، بْنِ أَبِي تَمِيمٍ عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ الدِّينَارُ بِالدِّينَارِ لاَ فَضْلَ بَيْنَهُمَا وَالدِّرْهَمُ بِالدِّرْهَمِ لاَ فَضْلَ بَيْنَهُمَا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 4070,
			"arabicnumber": "1588.05",
			"text": "حَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ سَمِعْتُ مَالِكَ بْنَ أَنَسٍ، يَقُولُ حَدَّثَنِي مُوسَى بْنُ أَبِي تَمِيمٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 4071,
			"arabicnumber": "1589.01",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ أَبِي، الْمِنْهَالِ قَالَ بَاعَ شَرِيكٌ لِي وَرِقًا بِنَسِيئَةٍ إِلَى الْمَوْسِمِ أَوْ إِلَى الْحَجِّ فَجَاءَ إِلَىَّ فَأَخْبَرَنِي فَقُلْتُ هَذَا أَمْرٌ لاَ يَصْلُحُ ‏.‏ قَالَ قَدْ بِعْتُهُ فِي السُّوقِ فَلَمْ يُنْكِرْ ذَلِكَ عَلَىَّ أَحَدٌ ‏.‏ فَأَتَيْتُ الْبَرَاءَ بْنَ عَازِبٍ فَسَأَلْتُهُ فَقَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَنَحْنُ نَبِيعُ هَذَا الْبَيْعَ فَقَالَ ‏ \"‏ مَا كَانَ يَدًا بِيَدٍ فَلاَ بَأْسَ بِهِ وَمَا كَانَ نَسِيئَةً فَهُوَ رِبًا ‏\"‏ ‏.‏ وَائْتِ زَيْدَ بْنَ أَرْقَمَ فَإِنَّهُ أَعْظَمُ تِجَارَةً مِنِّي ‏.‏ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ مِثْلَ ذَلِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 4072,
			"arabicnumber": "1589.02",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حَبِيبٍ، أَنَّهُ سَمِعَ أَبَا الْمِنْهَالِ، يَقُولُ سَأَلْتُ الْبَرَاءَ بْنَ عَازِبٍ عَنِ الصَّرْفِ، فَقَالَ سَلْ زَيْدَ بْنَ أَرْقَمَ فَهُوَ أَعْلَمُ ‏.‏ فَسَأَلْتُ زَيْدًا فَقَالَ سَلِ الْبَرَاءَ فَإِنَّهُ أَعْلَمُ ثُمَّ قَالاَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ بَيْعِ الْوَرِقِ بِالذَّهَبِ دَيْنًا",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 4073,
			"arabicnumber": "1590.01",
			"text": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْفِضَّةِ بِالْفِضَّةِ وَالذَّهَبِ بِالذَّهَبِ إِلاَّ سَوَاءً بِسَوَاءٍ وَأَمَرَنَا أَنْ نَشْتَرِيَ الْفِضَّةَ بِالذَّهَبِ كَيْفَ شِئْنَا وَنَشْتَرِيَ الذَّهَبَ بِالْفِضَّةِ كَيْفَ شِئْنَا ‏.‏ قَالَ فَسَأَلَهُ رَجُلٌ فَقَالَ يَدًا بِيَدٍ فَقَالَ هَكَذَا سَمِعْتُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 4074,
			"arabicnumber": "1590.02",
			"text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ، حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى، - وَهُوَ ابْنُ أَبِي كَثِيرٍ - عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ، أَخْبَرَهُ أَنَّ أَبَا بَكْرَةَ قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 4075,
			"arabicnumber": "1591.01",
			"text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلاَنِيُّ أَنَّهُ سَمِعَ عُلَىَّ بْنَ رَبَاحٍ اللَّخْمِيَّ، يَقُولُ سَمِعْتُ فَضَالَةَ بْنَ عُبَيْدٍ الأَنْصَارِيَّ، يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ بِخَيْبَرَ بِقِلاَدَةٍ فِيهَا خَرَزٌ وَذَهَبٌ وَهِيَ مِنَ الْمَغَانِمِ تُبَاعُ فَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالذَّهَبِ الَّذِي فِي الْقِلاَدَةِ فَنُزِعَ وَحْدَهُ ثُمَّ قَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الذَّهَبُ بِالذَّهَبِ وَزْنًا بِوَزْنٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 4076,
			"arabicnumber": "1591.02",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ أَبِي شُجَاعٍ، سَعِيدِ بْنِ يَزِيدَ عَنْ خَالِدِ بْنِ، أَبِي عِمْرَانَ عَنْ حَنَشٍ الصَّنْعَانِيِّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ اشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلاَدَةً بِاثْنَىْ عَشَرَ دِينَارًا فِيهَا ذَهَبٌ وَخَرَزٌ فَفَصَّلْتُهَا فَوَجَدْتُ فِيهَا أَكْثَرَ مِنِ اثْنَىْ عَشَرَ دِينَارًا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ تُبَاعُ حَتَّى تُفَصَّلَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 4077,
			"arabicnumber": "1591.03",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ مُبَارَكٍ، عَنْ سَعِيدِ بْنِ، يَزِيدَ بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 4078,
			"arabicnumber": "1591.04",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ أَبِي جَعْفَرٍ، عَنِ الْجُلاَحِ أَبِي كَثِيرٍ، حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ، عَنْ فَضَالَةَ بْنِ عُبَيْدٍ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ خَيْبَرَ نُبَايِعُ الْيَهُودَ الْوُقِيَّةَ الذَّهَبَ بِالدِّينَارَيْنِ وَالثَّلاَثَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلاَّ وَزْنًا بِوَزْنٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 4079,
			"arabicnumber": "1591.05",
			"text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ الْمَعَافِرِيِّ، وَعَمْرِو، بْنِ الْحَارِثِ وَغَيْرِهِمَا أَنَّ عَامِرَ بْنَ يَحْيَى الْمَعَافِرِيَّ، أَخْبَرَهُمْ عَنْ حَنَشٍ، أَنَّهُ قَالَ كُنَّا مَعَ فَضَالَةَ بْنِ عُبَيْدٍ فِي غَزْوَةٍ فَطَارَتْ لِي وَلأَصْحَابِي قِلاَدَةٌ فِيهَا ذَهَبٌ وَوَرِقٌ وَجَوْهَرٌ فَأَرَدْتُ أَنْ أَشْتَرِيَهَا فَسَأَلْتُ فَضَالَةَ بْنَ عُبَيْدٍ فَقَالَ انْزِعْ ذَهَبَهَا فَاجْعَلْهُ فِي كِفَّةٍ وَاجْعَلْ ذَهَبَكَ فِي كِفَّةٍ ثُمَّ لاَ تَأْخُذَنَّ إِلاَّ مِثْلاً بِمِثْلٍ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلاَ يَأْخُذَنَّ إِلاَّ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 4080,
			"arabicnumber": "1592",
			"text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ أَنَّ بُسْرَ بْنَ سَعِيدٍ حَدَّثَهُ عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُ أَرْسَلَ غُلاَمَهُ بِصَاعِ قَمْحٍ فَقَالَ بِعْهُ ثُمَّ اشْتَرِ بِهِ شَعِيرًا ‏.‏ فَذَهَبَ الْغُلاَمُ فَأَخَذَ صَاعًا وَزِيَادَةَ بَعْضِ صَاعٍ فَلَمَّا جَاءَ مَعْمَرًا أَخْبَرَهُ بِذَلِكَ فَقَالَ لَهُ مَعْمَرٌ لِمَ فَعَلْتَ ذَلِكَ انْطَلِقْ فَرُدَّهُ وَلاَ تَأْخُذَنَّ إِلاَّ مِثْلاً بِمِثْلٍ فَإِنِّي كُنْتُ أَسْمَعُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الطَّعَامُ بِالطَّعَامِ مِثْلاً بِمِثْلٍ ‏\"‏ ‏.‏ قَالَ وَكَانَ طَعَامُنَا يَوْمَئِذٍ الشَّعِيرَ ‏.‏ قِيلَ لَهُ فَإِنَّهُ لَيْسَ بِمِثْلِهِ قَالَ إِنِّي أَخَافُ أَنْ يُضَارِعَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 4081,
			"arabicnumber": "1593.01",
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ، يُحَدِّثُ أَنَّ أَبَا هُرَيْرَةَ، وَأَبَا سَعِيدٍ حَدَّثَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ أَخَا بَنِي عَدِيٍّ الأَنْصَارِيَّ فَاسْتَعْمَلَهُ عَلَى خَيْبَرَ فَقَدِمَ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏ ‏.‏ قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَشْتَرِي الصَّاعَ بِالصَّاعَيْنِ مِنَ الْجَمْعِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لاَ تَفْعَلُوا وَلَكِنْ مِثْلاً بِمِثْلٍ أَوْ بِيعُوا هَذَا وَاشْتَرُوا بِثَمَنِهِ مِنْ هَذَا وَكَذَلِكَ الْمِيزَانُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 4082,
			"arabicnumber": "1593.02",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلِ بْنِ عَبْدِ، الرَّحْمَنِ بْنِ عَوْفٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى خَيْبَرَ فَجَاءَهُ بِتَمْرٍ جَنِيبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَكُلُّ تَمْرِ خَيْبَرَ هَكَذَا ‏\"‏ ‏.‏ فَقَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِنَّا لَنَأْخُذُ الصَّاعَ مِنْ هَذَا بِالصَّاعَيْنِ وَالصَّاعَيْنِ بِالثَّلاَثَةِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ فَلاَ تَفْعَلْ بِعِ الْجَمْعَ بِالدَّرَاهِمِ ثُمَّ ابْتَعْ بِالدَّرَاهِمِ جَنِيبًا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 4083,
			"arabicnumber": "1594.01",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَحْيَى بْنُ صَالِحٍ الْوُحَاظِيُّ، حَدَّثَنَا مُعَاوِيَةُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، - وَاللَّفْظُ لَهُمَا - جَمِيعًا عَنْ يَحْيَى بْنِ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمٍ - أَخْبَرَنِي يَحْيَى، - وَهُوَ ابْنُ أَبِي كَثِيرٍ - قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَبْدِ الْغَافِرِ، يَقُولُ سَمِعْتُ أَبَا سَعِيدٍ، يَقُولُ جَاءَ بِلاَلٌ بِتَمْرٍ بَرْنِيٍّ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مِنْ أَيْنَ هَذَا ‏\"‏ ‏.‏ فَقَالَ بِلاَلٌ تَمْرٌ كَانَ عِنْدَنَا رَدِيءٌ فَبِعْتُ مِنْهُ صَاعَيْنِ بِصَاعٍ لِمَطْعَمِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ فَقَالَ رَسُولُ اللَّهِ عِنْدَ ذَلِكَ ‏\"‏ أَوَّهْ عَيْنُ الرِّبَا لاَ تَفْعَلْ وَلَكِنْ إِذَا أَرَدْتَ أَنْ تَشْتَرِيَ التَّمْرَ فَبِعْهُ بِبَيْعٍ آخَرَ ثُمَّ اشْتَرِ بِهِ ‏\"‏ ‏.‏ لَمْ يَذْكُرِ ابْنُ سَهْلٍ فِي حَدِيثِهِ عِنْدَ ذَلِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 4084,
			"arabicnumber": "1594.02",
			"text": "وَحَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي قَزَعَةَ، الْبَاهِلِيِّ عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَمْرٍ فَقَالَ ‏\"‏ مَا هَذَا التَّمْرُ مِنْ تَمْرِنَا ‏\"‏ ‏.‏ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ بِعْنَا تَمْرَنَا صَاعَيْنِ بِصَاعٍ مِنْ هَذَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَذَا الرِّبَا فَرُدُّوهُ ثُمَّ بِيعُوا تَمْرَنَا وَاشْتَرُوا لَنَا مِنْ هَذَا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 4085,
			"arabicnumber": "1595",
			"text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ كُنَّا نُرْزَقُ تَمْرَ الْجَمْعِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ الْخِلْطُ مِنَ التَّمْرِ فَكُنَّا نَبِيعُ صَاعَيْنِ بِصَاعٍ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏ \"‏ لاَ صَاعَىْ تَمْرٍ بِصَاعٍ وَلاَ صَاعَىْ حِنْطَةٍ بِصَاعٍ وَلاَ دِرْهَمَ بِدِرْهَمَيْنِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 4086,
			"arabicnumber": "1594.03",
			"text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي، نَضْرَةَ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَقَالَ أَيَدًا بِيَدٍ قُلْتُ نَعَمْ ‏.‏ قَالَ فَلاَ بَأْسَ بِهِ ‏.‏ فَأَخْبَرْتُ أَبَا سَعِيدٍ فَقُلْتُ إِنِّي سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الصَّرْفِ فَقَالَ أَيَدًا بِيَدٍ قُلْتُ نَعَمْ ‏.‏ قَالَ فَلاَ بَأْسَ بِهِ ‏.‏ قَالَ أَوَقَالَ ذَلِكَ إِنَّا سَنَكْتُبُ إِلَيْهِ فَلاَ يُفْتِيكُمُوهُ قَالَ فَوَاللَّهِ لَقَدْ جَاءَ بَعْضُ فِتْيَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم بِتَمْرٍ فَأَنْكَرَهُ فَقَالَ ‏\"‏ كَأَنَّ هَذَا لَيْسَ مِنْ تَمْرِ أَرْضِنَا ‏\"‏ ‏.‏ قَالَ كَانَ فِي تَمْرِ أَرْضِنَا - أَوْ فِي تَمْرِنَا - الْعَامَ بَعْضُ الشَّىْءِ فَأَخَذْتُ هَذَا وَزِدْتُ بَعْضَ الزِّيَادَةِ ‏.‏ فَقَالَ ‏\"‏ أَضْعَفْتَ أَرْبَيْتَ لاَ تَقْرَبَنَّ هَذَا إِذَا رَابَكَ مِنْ تَمْرِكَ شَىْءٌ فَبِعْهُ ثُمَّ اشْتَرِ الَّذِي تُرِيدُ مِنَ التَّمْرِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 4087,
			"arabicnumber": "1594.04",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الأَعْلَى، أَخْبَرَنَا دَاوُدُ، عَنْ أَبِي نَضْرَةَ، قَالَ سَأَلْتُ ابْنَ عُمَرَ وَابْنَ عَبَّاسٍ عَنِ الصَّرْفِ، فَلَمْ يَرَيَا بِهِ بَأْسًا فَإِنِّي لَقَاعِدٌ عِنْدَ أَبِي سَعِيدٍ الْخُدْرِيِّ فَسَأَلْتُهُ عَنِ الصَّرْفِ فَقَالَ مَا زَادَ فَهُوَ رِبًا ‏.‏ فَأَنْكَرْتُ ذَلِكَ لِقَوْلِهِمَا فَقَالَ لاَ أُحَدِّثُكَ إِلاَّ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم جَاءَهُ صَاحِبُ نَخْلِهِ بِصَاعٍ مِنْ تَمْرٍ طَيِّبٍ وَكَانَ تَمْرُ النَّبِيِّ صلى الله عليه وسلم هَذَا اللَّوْنَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَنَّى لَكَ هَذَا ‏\"‏ ‏.‏ قَالَ انْطَلَقْتُ بِصَاعَيْنِ فَاشْتَرَيْتُ بِهِ هَذَا الصَّاعَ فَإِنَّ سِعْرَ هَذَا فِي السُّوقِ كَذَا وَسِعْرَ هَذَا كَذَا ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَيْلَكَ أَرْبَيْتَ إِذَا أَرَدْتَ ذَلِكَ فَبِعْ تَمْرَكَ بِسِلْعَةٍ ثُمَّ اشْتَرِ بِسِلْعَتِكَ أَىَّ تَمْرٍ شِئْتَ ‏\"‏ ‏.‏ قَالَ أَبُو سَعِيدٍ فَالتَّمْرُ بِالتَّمْرِ أَحَقُّ أَنْ يَكُونَ رِبًا أَمِ الْفِ��َّةُ بِالْفِضَّةِ قَالَ فَأَتَيْتُ ابْنَ عُمَرَ بَعْدُ فَنَهَانِي وَلَمْ آتِ ابْنَ عَبَّاسٍ - قَالَ - فَحَدَّثَنِي أَبُو الصَّهْبَاءِ أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ عَنْهُ بِمَكَّةَ فَكَرِهَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 4088,
			"arabicnumber": "1596.01",
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ بْنِ، عُيَيْنَةَ - وَاللَّفْظُ لاِبْنِ عَبَّادٍ - قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ الدِّينَارُ بِالدِّينَارِ وَالدِّرْهَمُ بِالدِّرْهَمِ مِثْلاً بِمِثْلٍ مَنْ زَادَ أَوِ ازْدَادَ فَقَدْ أَرْبَى ‏.‏ فَقُلْتُ لَهُ إِنَّ ابْنَ عَبَّاسٍ يَقُولُ غَيْرَ هَذَا ‏.‏ فَقَالَ لَقَدْ لَقِيتُ ابْنَ عَبَّاسٍ فَقُلْتُ أَرَأَيْتَ هَذَا الَّذِي تَقُولُ أَشَىْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَوْ وَجَدْتَهُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلَمْ أَجِدْهُ فِي كِتَابِ اللَّهِ وَلَكِنْ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ الرِّبَا فِي النَّسِيئَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 4089,
			"arabicnumber": "1596.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِعَمْرٍو - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُبَيْدِ، اللَّهِ بْنِ أَبِي يَزِيدَ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّمَا الرِّبَا فِي النَّسِيئَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 4090,
			"arabicnumber": "1596.03",
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، قَالاَ حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ رِبًا فِيمَا كَانَ يَدًا بِيَدٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 4091,
			"arabicnumber": "1596.04",
			"text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا هِقْلٌ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي، رَبَاحٍ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، لَقِيَ ابْنَ عَبَّاسٍ فَقَالَ لَهُ أَرَأَيْتَ قَوْلَكَ فِي الصَّرْفِ أَشَيْئًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَمْ شَيْئًا وَجَدْتَهُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ ابْنُ عَبَّاسٍ كَلاَّ لاَ أَقُولُ أَمَّا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَنْتُمْ أَعْلَمُ بِهِ وَأَمَّا كِتَابُ اللَّهِ فَلاَ أَعْلَمُهُ وَلَكِنْ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ أَلاَ إِنَّمَا الرِّبَا فِي النَّسِيئَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 4092,
			"arabicnumber": "1597",
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، قَالَ سَأَلَ شِبَاكٌ إِبْرَاهِيمَ فَحَدَّثَنَا عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم آكِلَ الرِّبَا وَمُؤْكِلَهُ ‏.‏ قَالَ قُلْتُ وَكَاتِبَهُ وَشَاهِدَيْهِ قَالَ إِنَّمَا نُحَدِّثُ بِمَا سَمِعْنَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 4093,
			"arabicnumber": "1598",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالُوا حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ لَعَنَ رَسُولُ اللَّهِ صلى الله عليه وسلم آكِلَ الرِّبَا وَمُوكِلَهُ وَكَاتِبَهُ وَشَاهِدَيْهِ وَقَالَ هُمْ سَوَاءٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 4094,
			"arabicnumber": "1599.01",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ الْهَمْدَانِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ وَأَهْوَى النُّعْمَانُ بِإِصْبَعَيْهِ إِلَى أُذُنَيْهِ ‏ \"‏ إِنَّ الْحَلاَلَ بَيِّنٌ وَإِنَّ الْحَرَامَ بَيِّنٌ وَبَيْنَهُمَا مُشْتَبِهَاتٌ لاَ يَعْلَمُهُنَّ كَثِيرٌ مِنَ النَّاسِ فَمَنِ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ أَلاَ وَإِنَّ لِكُلِّ مَلِكٍ حِمًى أَلاَ وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ أَلاَ وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ أَلاَ وَهِيَ الْقَلْبُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 4095,
			"arabicnumber": "1599.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالاَ حَدَّثَنَا زَكَرِيَّاءُ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 4096,
			"arabicnumber": "1599.03",
			"text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، وَأَبِي، فَرْوَةَ الْهَمْدَانِيِّ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنِ ابْنِ عَجْلاَنَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدٍ، كُلُّهُمْ عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ غَيْرَ أَنَّ حَدِيثَ زَكَرِيَّاءَ أَتَمُّ مِنْ حَدِيثِهِمْ وَأَكْثَرُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 4097,
			"arabicnumber": "1599.04",
			"text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ، بْنُ يَزِيدَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلاَلٍ، عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ، عَنْ عَامِرٍ الشَّعْبِيِّ، أَنَّهُ سَمِعَ نُعْمَانَ بْنَ بَشِيرِ بْنِ سَعْدٍ، صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَخْطُبُ النَّاسَ بِحِمْصَ وَهُوَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ الْحَلاَلُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ ‏\"‏ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ زَكَرِيَّاءَ عَنِ الشَّعْبِيِّ إِلَى قَوْلِهِ ‏\"‏ يُوشِكُ أَنْ يَقَعَ فِيهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 4098,
			"arabicnumber": "715.13",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّهُ كَانَ يَسِيرُ عَلَى جَمَلٍ لَهُ قَدْ أَعْيَا فَأَرَادَ أَنْ يُسَيِّبَهُ قَالَ فَلَحِقَنِي النَّبِيُّ صلى الله عليه وسلم فَدَعَا لِي وَضَرَبَهُ فَسَارَ سَيْرًا لَمْ يَسِرْ مِثْلَهُ قَالَ ‏\"‏ بِعْنِيهِ بِوُقِيَّةٍ ‏\"‏ ‏.‏ قُلْتُ لاَ ‏.‏ ثُمَّ قَالَ ‏\"‏ بِعْنِيهِ ‏\"‏ ‏.‏ فَبِعْتُهُ بِوُقِيَّةٍ وَاسْتَثْنَيْتُ عَلَيْهِ حُمْلاَنَهُ إِلَى أَهْلِي فَلَمَّا بَلَغْتُ أَتَيْتُهُ بِالْجَمَلِ فَنَقَدَنِي ثَمَنَهُ ثُمَّ رَجَعْتُ فَأَرْسَلَ فِي أَثَرِي فَقَالَ ‏\"‏ أَتُرَانِي مَاكَسْتُكَ لآخُذَ جَمَلَكَ خُذْ جَمَلَكَ وَدَرَاهِمَكَ فَهُوَ لَكَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 4099,
			"arabicnumber": "715.14",
			"text": "وَحَدَّثَنَاهُ عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنْ زَكَرِيَّاءَ، عَنْ عَامِرٍ، حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 4100,
			"arabicnumber": "715.15",
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعُثْمَانَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَتَلاَحَقَ بِي وَتَحْتِي نَاضِحٌ لِي قَدْ أَعْيَا وَلاَ يَكَادُ يَسِيرُ قَالَ فَقَالَ لِي ‏\"‏ مَا لِبَعِيرِكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ عَلِيلٌ - قَالَ - فَتَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَزَجَرَهُ وَدَعَا لَهُ فَمَازَالَ بَيْنَ يَدَىِ الإِبِلِ قُدَّامَهَا يَسِيرُ ‏.‏ قَالَ فَقَالَ لِي ‏\"‏ كَيْفَ تَرَى بَعِيرَكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ بِخَيْرٍ قَدْ أَصَابَتْهُ بَرَكَتُكَ ‏.‏ قَالَ ‏\"‏ أَفَتَبِيعُنِيهِ ‏\"‏ ‏.‏ فَاسْتَحْيَيْتُ وَلَمْ يَكُنْ لَنَا نَاضِحٌ غَيْرُهُ قَالَ فَقُلْتُ نَعَمْ ‏.‏ فَبِعْتُهُ إِيَّاهُ عَلَى أَنَّ لِي فَقَارَ ظَهْرِهِ حَتَّى أَبْلُغَ الْمَدِينَةَ - قَالَ - فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ إِنِّي عَرُوسٌ فَاسْتَأْذَنْتُهُ فَأَذِنَ لِي فَتَقَدَّمْتُ النَّاسَ إِلَى الْمَدِينَةِ حَتَّى انْتَهَيْتُ فَلَقِيَنِي خَالِي فَسَأَلَنِي عَنِ الْبَعِيرِ فَأَخْبَرْتُهُ بِمَا صَنَعْتُ فِيهِ فَلاَمَنِي فِيهِ - قَالَ - وَقَدْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ لِي حِينَ اسْتَأْذَنْتُهُ ‏\"‏ مَا تَزَوَّجْتَ أَبِكْرًا أَمْ ثَيِّبًا ‏\"‏ ‏.‏ فَقُلْتُ لَهُ تَزَوَّجْتُ ثَيِّبًا ‏.‏ قَالَ ‏\"‏ أَفَلاَ تَزَوَّجْتَ بِكْرًا تُلاَعِبُكَ وَتُلاَعِبُهَا ‏\"‏ ‏.‏ فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ تُوُفِّيَ وَالِدِي - أَوِ اسْتُشْهِدَ - وَلِي أَخَوَاتٌ صِغَارٌ فَكَرِهْتُ أَنْ أَتَزَوَّجَ إِلَيْهِنَّ مِثْلَهُنَّ فَلاَ تُؤَدِّبُهُنَّ وَلاَ تَقُومُ عَلَيْهِنَّ فَتَزَوَّجْتُ ثَيِّبًا لِتَقُومَ عَلَيْهِنَّ وَتُؤَدِّبَهُنَّ - قَالَ - فَلَمَّا قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ غَدَوْتُ إِلَيْهِ بِالْبَعِيرِ فَأَعْطَانِي ثَمَنَهُ وَرَدَّهُ عَلَىَّ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 4101,
			"arabicnumber": "715.16",
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ جَابِرٍ، قَالَ أَقْبَلْنَا مِنْ مَكَّةَ إِلَى الْمَدِينَةِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَاعْتَلَّ جَمَلِي ‏.‏ وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ وَفِيهِ ثُمَّ قَالَ لِي ‏\"‏ بِعْنِي جَمَلَكَ هَذَا ‏\"‏ ‏.‏ قَالَ قُلْتُ لاَ بَلْ هُوَ لَكَ ‏.‏ قَالَ ‏\"‏ لاَ بَلْ بِعْنِيهِ ‏\"‏ ‏.‏ قَالَ قُلْتُ لاَ بَلْ هُوَ لَكَ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ لاَ بَلْ بِعْنِيهِ ‏\"‏ ‏.‏ قَالَ قُلْتُ فَإِنَّ لِرَجُلٍ عَلَىَّ أُوقِيَّةَ ذَهَبٍ فَهُوَ لَكَ بِهَا ‏.‏ قَالَ ‏\"‏ قَدْ أَخَذْتُهُ فَتَبَلَّغْ عَلَيْهِ إِلَى الْمَدِينَةِ ‏\"‏ ‏.‏ قَالَ فَلَمَّا قَدِمْتُ الْمَدِينَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِبِلاَلٍ ‏\"‏ أَعْطِهِ أُوقِيَّةً مِنْ ذَهَبٍ وَزِدْهُ ‏\"‏ ‏.‏ قَالَ فَأَعْطَانِي أُوقِيَّةً مِنْ ذَهَبٍ وَزَادَنِي قِيرَاطًا - قَالَ - فَقُلْتُ لاَ تُفَارِقُنِي زِيَادَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - فَكَانَ فِي كِيسٍ لِي فَأَخَذَهُ أَهْلُ الشَّامِ يَوْمَ الْحَرَّةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 4102,
			"arabicnumber": "715.17",
			"text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ أَبِي، نَضْرَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ فَتَخَلَّفَ نَاضِحِي ‏.‏ وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ فَنَخَسَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ لِي ‏\"‏ ارْكَبْ بِاسْمِ اللَّهِ ‏\"‏ ‏.‏ وَزَادَ أَيْضًا قَالَ فَمَا زَالَ يَزِيدُنِي وَيَقُولُ ‏\"‏ وَاللَّهُ يَغْفِرُ لَكَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 4103,
			"arabicnumber": "715.18",
			"text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ لَمَّا أَتَى عَلَىَّ النَّبِيُّ صلى الله عليه وسلم وَقَدْ أَعْيَا بَعِيرِي - قَالَ - فَنَخَسَهُ فَوَثَبَ - فَكُنْتُ بَعْدَ ذَلِكَ أَحْبِسُ خِطَامَهُ لأَسْمَعَ حَدِيثَهُ فَمَا أَقْدِرُ عَلَيْهِ فَلَحِقَنِي النَّبِيُّ صلى الله عليه وسلم فَقَالَ ‏\"‏ بِعْنِيهِ ‏\"‏ ‏.‏ فَبِعْتُهُ مِنْهُ بِخَمْسِ أَوَاقٍ - قَالَ - قُلْتُ عَلَى أَنَّ لِي ظَهْرَهُ إِلَى الْمَدِينَةِ ‏.‏ قَالَ ‏\"‏ وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ ‏\"‏ ‏.‏ قَالَ فَلَمَّا قَدِمْتُ الْمَدِينَةَ أَتَيْتُهُ بِهِ فَزَادَنِي وُقِيَّةً ثُمَّ وَهَبَهُ لِي ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 4104,
			"arabicnumber": "715.19",
			"text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، حَدَّثَنَا بَشِيرُ بْنُ عُقْبَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ سَافَرْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ - أَظُنُّهُ قَالَ غَازِيًا - وَاقْتَصَّ الْحَدِيثَ وَزَادَ فِيهِ قَالَ ‏\"‏ يَا جَابِرُ أَتَوَفَّيْتَ الثَّمَنَ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ قَالَ ‏\"‏ لَكَ الثَّمَنُ وَلَكَ الْجَمَلُ لَكَ الثَّمَنُ وَلَكَ الْجَمَلُ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 4105,
			"arabicnumber": "715.20",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ اشْتَرَى مِنِّي رَسُولُ اللَّهِ صلى الله عليه وسلم بَعِيرًا بِوُقِيَّتَيْنِ وَدِرْهَمٍ أَوْ دِرْهَمَيْنِ - قَاَلَ - فَلَمَّا قَدِمَ صِرَارًا أَمَرَ بِبَقَرَةٍ فَذُبِحَتْ فَأَكَلُوا مِنْهَا فَلَمَّا قَدِمَ الْمَدِينَةَ أَمَرَنِي أَنْ آتِيَ الْمَسْجِدَ فَأُصَلِّيَ رَكْعَتَيْنِ وَوَزَنَ لِي ثَمَنَ الْبَعِيرِ فَأَرْجَحَ لِي ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 4106,
			"arabicnumber": "715.21",
			"text": "حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنَا مُحَارِبٌ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذِهِ الْقِصَّةِ غَيْرَ أَنَّهُ قَالَ فَاشْتَرَاهُ مِنِّي بِثَمَنٍ قَدْ سَمَّاهُ ‏.‏ وَلَمْ يَذْكُرِ الْوُقِيَّتَيْنِ وَالدِّرْهَمَ وَالدِّرْهَمَيْنِ ‏.‏ وَقَالَ أَمَرَ بِبَقَرَةٍ فَنُحِرَتْ ثُمَّ قَسَمَ لَحْمَهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 4107,
			"arabicnumber": "715.22",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لَهُ ‏ \"‏ قَدْ أَخَذْتُ جَمَلَكَ بِأَرْبَعَةِ دَنَانِيرَ وَلَكَ ظَهْرُهُ إِلَى الْمَدِينَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 4108,
			"arabicnumber": "1600.01",
			"text": "حَدَّثَنَا أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ مَالِكِ بْنِ، أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي رَافِعٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَسْلَفَ مِنْ رَجُلٍ بَكْرًا فَقَدِمَتْ عَلَيْهِ إِبِلٌ مِنْ إِبِلِ الصَّدَقَةِ فَأَمَرَ أَبَا رَافِعٍ أَنْ يَقْضِيَ الرَّجُلَ بَكْرَهُ فَرَجَعَ إِلَيْهِ أَبُو رَافِعٍ فَقَالَ لَمْ أَجِدْ فِيهَا إِلاَّ خِيَارًا رَبَاعِيًا ‏.‏ فَقَالَ ‏ \"‏ أَعْطِهِ إِيَّاهُ إِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 4109,
			"arabicnumber": "1600.02",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، سَمِعْتُ زَيْدَ بْنَ أَسْلَمَ، أَخْبَرَنَا عَطَاءُ بْنُ يَسَارٍ، عَنْ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ اسْتَسْلَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَكْرًا ‏.‏ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏ \"‏ فَإِنَّ خَيْرَ عِبَادِ اللَّهِ أَحْسَنُهُمْ قَضَاءً ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 4110,
			"arabicnumber": "1601.01",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارِ بْنِ عُثْمَانَ الْعَبْدِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ لِرَجُلٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حَقٌّ فَأَغْلَظَ لَهُ فَهَمَّ بِهِ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ إِنَّ لِصَاحِبِ الْحَقِّ مَقَالاً - فَقَالَ لَهُمُ - اشْتَرُوا لَهُ سِنًّا فَأَعْطُوهُ إِيَّاهُ ‏\"‏ ‏.‏ فَقَالُوا إِنَّا لاَ نَجِدُ إِلاَّ سِنًّا هُوَ خَيْرٌ مِنْ سِنِّهِ ‏.‏ قَالَ ‏\"‏ فَاشْتَرُوهُ فَأَعْطُوهُ إِيَّاهُ فَإِنَّ مِنْ خَيْرِكُمْ - أَوْ خَيْرَكُمْ - أَحْسَنُكُمْ قَضَاءً ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 4111,
			"arabicnumber": "1601.02",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ صَالِحٍ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، قَالَ اسْتَقْرَضَ رَسُولُ اللَّهِ صلى الله عليه وسلم سِنًّا فَأَعْطَى سِنًّا فَوْقَهُ وَقَالَ ‏ \"‏ خِيَارُكُمْ مَحَاسِنُكُمْ قَضَاءً ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 4112,
			"arabicnumber": "1601.03",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ يَتَقَاضَى رَسُولَ اللَّهِ صلى الله عليه وسلم بَعِيرًا فَقَالَ ‏ \"‏ أَعْطُوهُ سِنًّا فَوْقَ سِنِّهِ - وَقَالَ - خَيْرُكُمْ أَحْسَنُكُمْ قَضَاءً ‏\"‏ ‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 4113,
			"arabicnumber": "1602",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَابْنُ، رُمْحٍ قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنِيهِ قُتَيْبَةُ، بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ جَاءَ عَبْدٌ فَبَايَعَ النَّبِيَّ صلى الله عليه وسلم عَلَى الْهِجْرَةِ وَلَمْ يَشْعُرْ أَنَّهُ عَبْدٌ فَجَاءَ سَيِّدُهُ يُرِيدُهُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ بِعْنِيهِ ‏\"‏ ‏.‏ فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ ثُمَّ لَمْ يُبَايِعْ أَحَدًا بَعْدُ حَتَّى يَسْأَلَهُ ‏\"‏ أَعَبْدٌ هُوَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 4114,
			"arabicnumber": "1603.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَهُودِيٍّ طَعَامًا بِنَسِيئَةٍ فَأَعْطَاهُ دِرْعًا لَهُ رَهْنًا ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 4115,
			"arabicnumber": "1603.02",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى بْنُ، يُونُسَ عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَهُودِيٍّ طَعَامًا وَرَهَنَهُ دِرْعًا مِنْ حَدِيدٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 4116,
			"arabicnumber": "1603.03",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ، زِيَادٍ عَنِ الأَعْمَشِ، قَالَ ذَكَرْنَا الرَّهْنَ فِي السَّلَمِ عِنْدَ إِبْرَاهِيمَ النَّخَعِيِّ فَقَالَ حَدَّثَنَا الأَسْوَدُ بْنُ يَزِيدَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ وَرَهَنَهُ دِرْعًا لَهُ مِنْ حَدِيدٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 4117,
			"arabicnumber": "1603.04",
			"text": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، قَالَ حَدَّثَنِي الأَسْوَدُ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ‏.‏ وَلَمْ يَذْكُرْ مِنْ حَدِيدٍ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 4118,
			"arabicnumber": "1604.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَمْرٌو النَّاقِدُ، - وَاللَّفْظُ لِيَحْيَى قَالَ عَمْرٌو حَدَّثَنَا وَقَالَ يَحْيَى - أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ أَبِي الْمِنْهَالِ عَنِ ابْنِ عَبَّاسٍ قَالَ قَدِمَ النَّبِيُّ صلى الله عليه وسلم الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي الثِّمَارِ السَّنَةَ وَالسَّنَتَيْنِ فَقَالَ ‏ \"‏ مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 157
			}
		},
		{
			"hadithnumber": 4119,
			"arabicnumber": "1604.02",
			"text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنِ ابْنِ أَبِي نَجِيحٍ، حَدَّثَنِي عَبْدُ اللَّهِ، بْنُ كَثِيرٍ عَنْ أَبِي الْمِنْهَالِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ يُسْلِفُونَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ أَسْلَفَ فَلاَ يُسْلِفْ إِلاَّ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 158
			}
		},
		{
			"hadithnumber": 4120,
			"arabicnumber": "1604.03",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْمَاعِيلُ بْنُ سَالِمٍ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ ابْنِ أَبِي نَجِيحٍ، بِهَذَا الإِسْنَادِ ‏.‏ مِثْلَ حَدِيثِ عَبْدِ الْوَارِثِ ‏.‏ وَلَمْ يَذْكُرْ ‏ \"‏ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 159
			}
		},
		{
			"hadithnumber": 4121,
			"arabicnumber": "1604.04",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، كِلاَهُمَا عَنْ سُفْيَانَ، عَنِ ابْنِ أَبِي نَجِيحٍ، بِإِسْنَادِهِمْ مِثْلَ حَدِيثِ ابْنِ عُيَيْنَةَ يَذْكُرُ فِيهِ ‏ \"‏ إِلَى أَجَلٍ مَعْلُومٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 160
			}
		},
		{
			"hadithnumber": 4122,
			"arabicnumber": "1605.01",
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - قَالَ كَانَ سَعِيدُ بْنُ الْمُسَيَّبِ يُحَدِّثُ أَنَّ مَعْمَرًا، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنِ احْتَكَرَ فَهُوَ خَاطِئٌ ‏\"‏ ‏.‏ فَقِيلَ لِسَعِيدٍ فَإِنَّكَ تَحْتَكِرُ قَالَ سَعِيدٌ إِنَّ مَعْمَرًا الَّذِي كَانَ يُحَدِّثُ هَذَا الْحَدِيثَ كَانَ يَحْتَكِرُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 161
			}
		},
		{
			"hadithnumber": 4123,
			"arabicnumber": "1605.02",
			"text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَحْتَكِرُ إِلاَّ خَاطِئٌ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 162
			}
		},
		{
			"hadithnumber": 4124,
			"arabicnumber": "1605.03",
			"text": "قَالَ إِبْرَاهِيمُ قَالَ مُسْلِمٌ وَحَدَّثَنِي بَعْضُ، أَصْحَابِنَا عَنْ عَمْرِو بْنِ عَوْنٍ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ مَعْمَرِ، بْنِ أَبِي مَعْمَرٍ أَحَدِ بَنِي عَدِيِّ بْنِ كَعْبٍ قَالَ قَالَ رَسُولُ اللَّهِ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ عَنْ يَحْيَى ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 163
			}
		},
		{
			"hadithnumber": 4125,
			"arabicnumber": "1606",
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو صَفْوَانَ الأُمَوِيُّ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، بْنُ يَحْيَى قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، كِلاَهُمَا عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ الْمُسَيَّبِ، أَنَّسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْحَلِفُ مَنْفَقَةٌ لِلسِّلْعَةِ مَمْحَقَةٌ لِلرِّبْحِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 164
			}
		},
		{
			"hadithnumber": 4126,
			"arabicnumber": "1607",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مَعْبَدِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ أَبِي قَتَادَةَ الأَنْصَارِيِّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِيَّاكُمْ وَكَثْرَةَ الْحَلِفِ فِي الْبَيْعِ فَإِنَّهُ يُنَفِّقُ ثُمَّ يَمْحَقُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 165
			}
		},
		{
			"hadithnumber": 4127,
			"arabicnumber": "1608.01",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ كَانَ لَهُ شَرِيكٌ فِي رَبْعَةٍ أَوْ نَخْلٍ فَلَيْسَ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ فَإِنْ رَضِيَ أَخَذَ وَإِنْ كَرِهَ تَرَكَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 166
			}
		},
		{
			"hadithnumber": 4128,
			"arabicnumber": "1608.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم بِالشُّفْعَةِ فِي كُلِّ شِرْكَةٍ لَمْ تُقْسَمْ رَبْعَةٍ أَوْ حَائِطٍ ‏.‏ لاَ يَحِلُّ لَهُ أَنْ يَبِيعَ حَتَّى يُؤْذِنَ شَرِيكَهُ فَإِنْ شَاءَ أَخَذَ وَإِنْ شَاءَ تَرَكَ فَإِذَا بَاعَ وَلَمْ يُؤْذِنْهُ فَهْوَ أَحَقُّ بِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 167
			}
		},
		{
			"hadithnumber": 4129,
			"arabicnumber": "1608.03",
			"text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنِ ابْنِ جُرَيْجٍ، أَنَّ أَبَا الزُّبَيْرِ، أَخْبَرَهُ أَنَّهُ، سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ الشُّفْعَةُ فِي كُلِّ شِرْكٍ فِي أَرْضٍ أَوْ رَبْعٍ أَوْ حَائِطٍ لاَ يَصْلُحُ أَنْ يَبِيعَ حَتَّى يَعْرِضَ عَلَى شَرِيكِهِ فَيَأْخُذَ أَوْ يَدَعَ فَإِنْ أَبَى فَشَرِيكُهُ أَحَقُّ بِهِ حَتَّى يُؤْذِنَهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 168
			}
		},
		{
			"hadithnumber": 4130,
			"arabicnumber": "1609.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَمْنَعْ أَحَدُكُمْ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ ‏\"‏ ‏.‏ قَالَ ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ مَا لِي أَرَاكُمْ عَنْهَا مُعْرِضِينَ وَاللَّهِ لأَرْمِيَنَّ بِهَا بَيْنَ أَكْتَافِكُمْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 169
			}
		},
		{
			"hadithnumber": 4131,
			"arabicnumber": "1609.02",
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، بْنُ يَحْيَى قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ، الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 170
			}
		},
		{
			"hadithnumber": 4132,
			"arabicnumber": "1610.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبَّاسِ بْنِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اقْتَطَعَ شِبْرًا مِنَ الأَرْضِ ظُلْمًا طَوَّقَهُ اللَّهُ إِيَّاهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 171
			}
		},
		{
			"hadithnumber": 4133,
			"arabicnumber": "1610.02",
			"text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّحَدَّثَهُ عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ، أَنَّ أَرْوَى، خَاصَمَتْهُ فِي بَعْضِ دَارِهِ فَقَالَ دَعُوهَا وَإِيَّاهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ أَخَذَ شِبْرًا مِنَ الأَرْضِ بِغَيْرِ حَقِّهِ طُوِّقَهُ فِي سَبْعِ أَرَضِينَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ اللَّهُمَّ إِنْ كَانَتْ كَاذِبَةً فَأَعْمِ بَصَرَهَا وَاجْعَلْ قَبْرَهَا فِي دَارِهَا ‏.‏ قَالَ فَرَأَيْتُهَا عَمْيَاءَ تَلْتَمِسُ الْجُدُرَ تَقُولُ أَصَابَتْنِي دَعْوَةُ سَعِيدِ بْنِ زَيْدٍ ‏.‏ فَبَيْنَمَا هِيَ تَمْشِي فِي الدَّارِ مَرَّتْ عَلَى بِئْرٍ فِي الدَّارِ فَوَقَعَتْ فِيهَا فَكَانَتْ قَبْرَهَا‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 172
			}
		},
		{
			"hadithnumber": 4134,
			"arabicnumber": "1610.03",
			"text": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ أَرْوَى بِنْتَ أُوَيْسٍ، ادَّعَتْ عَلَى سَعِيدِ بْنِ زَيْدٍ أَنَّهُ أَخَذَ شَيْئًا مِنْ أَرْضِهَا فَخَاصَمَتْهُ إِلَى مَرْوَانَ بْنِ الْحَكَمِ ‏.‏ فَقَالَ سَعِيدٌ أَنَا كُنْتُ آخُذُ مِنْ أَرْضِهَا شَيْئًا بَعْدَ الَّذِي سَمِعْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ وَمَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ أَخَذَ شِبْرًا مِنَ الأَرْضِ ظُلْمًا طُوِّقَهُ إِلَى سَبْعِ أَرَضِينَ ‏\"‏ ‏.‏ فَقَالَ لَهُ مَرْوَانُ لاَ أَسْأَلُكَ بَيِّنَةً بَعْدَ هَذَا ‏.‏ فَقَالَ اللَّهُمَّ إِنْ كَانَتْ كَاذِبَةً فَعَمِّ بَصَرَهَا وَاقْتُلْهَا فِي أَرْضِهَا ‏.‏ قَالَ فَمَا مَاتَتْ حَتَّى ذَهَبَ بَصَرُهَا ثُمَّ بَيْنَا هِيَ تَمْشِي فِي أَرْضِهَا إِذْ وَقَعَتْ فِي حُفْرَةٍ فَمَاتَتْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 173
			}
		},
		{
			"hadithnumber": 4135,
			"arabicnumber": "1610.04",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ زَيْدٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مَنْ أَخَذَ شِبْرًا مِنَ الأَرْضِ ظُلْمًا فَإِنَّهُ يُطَوَّقُهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 174
			}
		},
		{
			"hadithnumber": 4136,
			"arabicnumber": "1611",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ يَأْخُذُ أَحَدٌ شِبْرًا مِنَ الأَرْضِ بِغَيْرِ حَقِّهِ إِلاَّ طَوَّقَهُ اللَّهُ إِلَى سَبْعِ أَرَضِينَ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 175
			}
		},
		{
			"hadithnumber": 4137,
			"arabicnumber": "1612.01",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، - يَعْنِي ابْنَ عَبْدِ الْوَارِثِ - حَدَّثَنَا حَرْبٌ، - وَهُوَ ابْنُ شَدَّادٍ - حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ أَبِي كَثِيرٍ - عَنْ مُحَمَّدِ بْنِ، إِبْرَاهِيمَ أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ وَكَانَ، بَيْنَهُ وَبَيْنَ قَوْمِهِ خُصُومَةٌ فِي أَرْضٍ وَأَنَّهُ دَخَلَ عَلَى عَائِشَةَ فَذَكَرَ ذَلِكَ لَهَا فَقَالَتْ يَا أَبَا سَلَمَةَ اجْتَنِبِ الأَرْضَ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ ظَلَمَ قِيدَ شِبْرٍ مِنَ الأَرْضِ طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 176
			}
		},
		{
			"hadithnumber": 4138,
			"arabicnumber": "1612.02",
			"text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا حَبَّانُ بْنُ هِلاَلٍ، أَخْبَرَنَا أَبَانٌ، حَدَّثَنَا يَحْيَى، أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ، حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ أَنَّهُ، دَخَلَ عَلَى عَائِشَةَ فَذَكَرَ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 177
			}
		},
		{
			"hadithnumber": 4139,
			"arabicnumber": "1613",
			"text": "حَدَّثَنِي أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِذَا اخْتَلَفْتُمْ فِي الطَّرِيقِ جُعِلَ عَرْضُهُ سَبْعَ أَذْرُعٍ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 22,
				"hadith": 178
			}
		}
	]
}