{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"3": "The Book of Menstruation"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 679,
			"arabicnumber": "293.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَأْتَزِرُ بِإِزَارٍ ثُمَّ يُبَاشِرُهَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 680,
			"arabicnumber": "293.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الشَّيْبَانِيِّ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، أَخْبَرَنَا أَبُو إِسْحَاقَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَمَرَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ تَأْتَزِرَ فِي فَوْرِ حَيْضَتِهَا ثُمَّ يُبَاشِرُهَا ‏.‏ قَالَتْ وَأَيُّكُمْ يَمْلِكُ إِرْبَهُ كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْلِكُ إِرْبَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 681,
			"arabicnumber": "294",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ مَيْمُونَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُبَاشِرُ نِسَاءَهُ فَوْقَ الإِزَارِ وَهُنَّ حُيَّضٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 682,
			"arabicnumber": "295",
			"text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ مَخْرَمَةَ، ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ مَيْمُونَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَضْطَجِعُ مَعِي وَأَنَا حَائِضٌ وَبَيْنِي وَبَيْنَهُ ثَوْبٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 683,
			"arabicnumber": "296",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْ، بَيْنَمَا أَنَا مُضْطَجِعَةٌ، مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي الْخَمِيلَةِ إِذْ حِضْتُ فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حَيْضَتِي فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَنُفِسْتِ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ ‏.‏ فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ ‏.‏ قَالَتْ وَكَانَتْ هِيَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَغْتَسِلاَنِ فِي الإِنَاءِ الْوَاحِدِ مِنَ الْجَنَابَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 684,
			"arabicnumber": "297.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا اعْتَكَفَ يُدْنِي إِلَىَّ رَأْسَهُ فَأُرَجِّلُهُ وَكَانَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةِ الإِنْسَانِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 685,
			"arabicnumber": "297.02",
			"text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، قَالَ أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنْ كُنْتُ لأَدْخُلُ الْبَيْتَ لِلْحَاجَةِ وَالْمَرِيضُ فِيهِ فَمَا أَسْأَلُ عَنْهُ إِلاَّ وَأَنَا مَارَّةٌ وَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُدْخِلُ عَلَىَّ رَأْسَهُ وَهُوَ فِي الْمَسْجِدِ فَأُرَجِّلُهُ وَكَانَ لاَ يَدْخُلُ الْبَيْتَ إِلاَّ لِحَاجَةٍ إِذَا كَانَ مُعْتَكِفًا ‏.‏ وَقَالَ ابْنُ رُمْحٍ إِذَا كَانُوا مُعْتَكِفِينَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 686,
			"arabicnumber": "297.03",
			"text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُخْرِجُ إِلَىَّ رَأْسَهُ مِنَ الْمَسْجِدِ وَهُوَ مُجَاوِرٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 687,
			"arabicnumber": "297.04",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ هِشَامٍ، أَخْبَرَنَا عُرْوَةُ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُدْنِي إِلَىَّ رَأْسَهُ وَأَنَا فِي حُجْرَتِي فَأُرَجِّلُ رَأْسَهُ وَأَنَا حَائِضٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 688,
			"arabicnumber": "297.05",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْسِلُ رَأْسَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَنَا حَائِضٌ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 689,
			"arabicnumber": "298.01",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَاوِلِينِي الْخُمْرَةَ مِنَ الْمَسْجِدِ ‏\"‏ ‏.‏ قَالَتْ فَقُلْتُ إِنِّي حَائِضٌ ‏.‏ فَقَالَ ‏\"‏ إِنَّ حَيْضَتَكِ لَيْسَتْ فِي يَدِكِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 690,
			"arabicnumber": "298.02",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ حَجَّاجٍ، وَابْنِ أَبِي غَنِيَّةَ، عَنْ ثَابِتِ بْنِ عُبَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ أُنَاوِلَهُ الْخُمْرَةَ مِنَ الْمَسْجِدِ ‏.‏ فَقُلْتُ إِنِّي حَائِضٌ ‏.‏ فَقَالَ ‏ \"‏ تَنَاوَلِيهَا فَإِنَّ الْحَيْضَةَ لَيْسَتْ فِي يَدِكِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 691,
			"arabicnumber": "299",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كَامِلٍ وَمُحَمَّدُ بْنُ حَاتِمٍ كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، - قَالَ زُهَيْرٌ حَدَّثَنَا يَحْيَى، - عَنْ يَزِيدَ بْنِ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ فَقَالَ ‏\"‏ يَا عَائِشَةُ نَاوِلِينِي الثَّوْبَ ‏\"‏ ‏.‏ فَقَالَتْ إِنِّي حَائِضٌ ‏.‏ فَقَالَ ‏\"‏ إِنَّ حَيْضَتَكِ لَيْسَتْ فِي يَدِكِ ‏\"‏ فَنَاوَلَتْهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 692,
			"arabicnumber": "300",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، وَسُفْيَانَ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَشْرَبُ وَأَنَا حَائِضٌ، ثُمَّ أُنَاوِلُهُ النَّبِيَّ صلى الله عليه وسلم فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ فَيَشْرَبُ وَأَتَعَرَّقُ الْعَرْقَ وَأَنَا حَائِضٌ ثُمَّ أُنَاوِلُهُ النَّبِيَّ صلى الله عليه وسلم فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ ‏.‏ وَلَمْ يَذْكُرْ زُهَيْرٌ فَيَشْرَبُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 693,
			"arabicnumber": "301",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَكِّيُّ، عَنْ مَنْصُورٍ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَّكِئُ فِي حِجْرِي وَأَنَا حَائِضٌ فَيَقْرَأُ الْقُرْآنَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 694,
			"arabicnumber": "302",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ الْيَهُودَ، كَانُوا إِذَا حَاضَتِ الْمَرْأَةُ فِيهِمْ لَمْ يُؤَاكِلُوهَا وَلَمْ يُجَامِعُوهُنَّ فِي الْبُيُوتِ فَسَأَلَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم النَّبِيَّ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏ وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ‏}‏ إِلَى آخِرِ الآيَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ اصْنَعُوا كُلَّ شَىْءٍ إِلاَّ النِّكَاحَ ‏\"‏ ‏.‏ فَبَلَغَ ذَلِكَ الْيَهُودَ فَقَالُوا مَا يُرِيدُ هَذَا الرَّجُلُ أَنْ يَدَعَ مِنْ أَمْرِنَا شَيْئًا إِلاَّ خَالَفَنَا فِيهِ فَجَاءَ أُسَيْدُ بْنُ حُضَيْرٍ وَعَبَّادُ بْنُ بِشْرٍ فَقَالاَ يَا رَسُولَ اللَّهِ إِنَّ الْيَهُودَ تَقُولُ كَذَا وَكَذَا ‏.‏ فَلاَ نُجَامِعُهُنَّ فَتَغَيَّرَ وَجْهُ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى ظَنَنَّا أَنْ قَدْ وَجَدَ عَلَيْهِمَا فَخَرَجَا فَاسْتَقْبَلَهُمَا هَدِيَّةٌ مِنْ لَبَنٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَرْسَلَ فِي آثَارِهِمَا فَسَقَاهُمَا فَعَرَفَا أَنْ لَمْ يَجِدْ عَلَيْهِمَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 695,
			"arabicnumber": "303.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ وَهُشَيْمٌ عَنِ الأَعْمَشِ، عَنْ مُنْذِرِ بْنِ يَعْلَى، - وَيُكْنَى أَبَا يَعْلَى - عَنِ ابْنِ الْحَنَفِيَّةِ، عَنْ عَلِيٍّ، قَالَ كُنْتُ رَجُلاً مَذَّاءً وَكُنْتُ أَسْتَحْيِي أَنْ أَسْأَلَ النَّبِيَّ صلى الله عليه وسلم لِمَكَانِ ابْنَتِهِ فَأَمَرْتُ الْمِقْدَادَ بْنَ الأَسْوَدِ فَسَأَلَهُ فَقَالَ ‏ \"‏ يَغْسِلُ ذَكَرَهُ وَيَتَوَضَّأُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 696,
			"arabicnumber": "303.02",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي سُلَيْمَانُ، قَالَ سَمِعْتُ مُنْذِرًا، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ عَلِيٍّ، أَنَّهُ قَالَ اسْتَحْيَيْتُ أَنْ أَسْأَلَ، النَّبِيَّ صلى الله عليه وسلم عَنِ الْمَذْىِ مِنْ أَجْلِ فَاطِمَةَ فَأَمَرْتُ الْمِقْدَادَ فَسَأَلَهُ فَقَالَ ‏ \"‏ مِنْهُ الْوُضُوءُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 697,
			"arabicnumber": "303.03",
			"text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍ أَرْسَلْنَا الْمِقْدَادَ بْنَ الأَسْوَدِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ عَنِ الْمَذْىِ يَخْرُجُ مِنَ الإِنْسَانِ كَيْفَ يَفْعَلُ بِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَوَضَّأْ وَانْضَحْ فَرْجَكَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 698,
			"arabicnumber": "304",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَامَ مِنَ اللَّيْلِ فَقَضَى حَاجَتَهُ ثُمَّ غَسَلَ وَجْهَهُ وَيَدَيْهِ ثُمَّ نَامَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 699,
			"arabicnumber": "305.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَمُحَمَّدُ بْنُ رُمْحٍ، قَالاَ أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ قَبْلَ أَنْ يَنَامَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 700,
			"arabicnumber": "305.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، وَوَكِيعٌ، وَغُنْدَرٌ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا كَانَ جُنُبًا فَأَرَادَ أَنْ يَأْكُلَ أَوْ يَنَامَ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 701,
			"arabicnumber": "305.03",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ قَالَ ابْنُ الْمُثَنَّى فِي حَدِيثِهِ حَدَّثَنَا الْحَكَمُ، سَمِعْتُ إِبْرَاهِيمَ، يُحَدِّثُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 702,
			"arabicnumber": "306.01",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ - وَاللَّفْظُ لَهُمَا - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي وَقَالَ أَبُو بَكْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، - قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، قَالَ يَا رَسُولَ اللَّهِ أَيَرْقُدُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ ‏ \"‏ نَعَمْ إِذَا تَوَضَّأَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 703,
			"arabicnumber": "306.02",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، أَنَّ عُمَرَ، اسْتَفْتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ هَلْ يَنَامُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ ‏ \"‏ نَعَمْ لِيَتَوَضَّأْ ثُمَّ لْيَنَمْ حَتَّى يَغْتَسِلَ إِذَا شَاءَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 704,
			"arabicnumber": "306.03",
			"text": "وَحَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ ذَكَرَ عُمَرُ بْنُ الْخَطَّابِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ تُصِيبُهُ جَنَابَةٌ مِنَ اللَّيْلِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 705,
			"arabicnumber": "307.01",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنْ وِتْرِ، رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ الْحَدِيثَ قُلْتُ كَيْفَ كَانَ يَصْنَعُ فِي الْجَنَابَةِ أَكَانَ يَغْتَسِلُ قَبْلَ أَنْ يَنَامَ أَمْ يَنَامُ قَبْلَ أَنْ يَغْتَسِلَ قَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ رُبَّمَا اغْتَسَلَ فَنَامَ وَرُبَّمَا تَوَضَّأَ فَنَامَ ‏.‏ قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الأَمْرِ سَعَةً ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 706,
			"arabicnumber": "307.02",
			"text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ح وَحَدَّثَنِيهِ هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، جَمِيعًا عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 707,
			"arabicnumber": "308",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، ح وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، كُلُّهُمْ عَنْ عَاصِمٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَتَى أَحَدُكُمْ أَهْلَهُ ثُمَّ أَرَادَ أَنْ يَعُودَ فَلْيَتَوَضَّأْ ‏\"‏ ‏.‏ زَادَ أَبُو بَكْرٍ فِي حَدِيثِهِ بَيْنَهُمَا وُضُوءًا وَقَالَ ثُمَّ أَرَادَ أَنْ يُعَاوِدَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 708,
			"arabicnumber": "309",
			"text": "وَحَدَّثَنَا الْحَسَنُ بْنُ أَحْمَدَ بْنِ أَبِي شُعَيْبٍ الْحَرَّانِيُّ، حَدَّثَنَا مِسْكِينٌ، - يَعْنِي ابْنَ بُكَيْرٍ الْحَذَّاءَ - عَنْ شُعْبَةَ، عَنْ هِشَامِ بْنِ زَيْدٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَطُوفُ عَلَى نِسَائِهِ بِغُسْلٍ وَاحِدٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 709,
			"arabicnumber": "310",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْحَنَفِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، قَالَ قَالَ إِسْحَاقُ بْنُ أَبِي طَلْحَةَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ جَاءَتْ أُمُّ سُلَيْمٍ - وَهِيَ جَدَّةُ إِسْحَاقَ - إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ لَهُ وَعَائِشَةُ عِنْدَهُ يَا رَسُولَ اللَّهِ الْمَرْأَةُ تَرَى مَا يَرَى الرَّجُلُ فِي الْمَنَامِ فَتَرَى مِنْ نَفْسِهَا مَا يَرَى الرَّجُلُ مِنْ نَفْسِهِ ‏.‏ فَقَالَتْ عَائِشَةُ يَا أُمَّ سُلَيْمٍ فَضَحْتِ النِّسَاءَ تَرِبَتْ يَمِينُكِ ‏.‏ فَقَالَ لِعَائِشَةَ ‏ \"‏ بَلْ أَنْتِ فَتَرِبَتْ يَمِينُكِ نَعَمْ فَلْتَغْتَسِلْ يَا أُمَّ سُلَيْمٍ إِذَا رَأَتْ ذَاكِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 710,
			"arabicnumber": "311",
			"text": "حَدَّثَنَا عَبَّاسُ بْنُ الْوَلِيدِ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، أَنَّ أَنَسَ بْنَ مَالِكٍ، حَدَّثَهُمْ أَنَّ أُمَّ سُلَيْمٍ حَدَّثَتْ أَنَّهَا، سَأَلَتْ نَبِيَّ اللَّهِ صلى الله عليه وسلم عَنِ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِذَا رَأَتْ ذَلِكِ الْمَرْأَةُ فَلْتَغْتَسِلْ ‏\"‏ ‏.‏ فَقَالَتْ أُمُّ سُلَيْمٍ وَاسْتَحْيَيْتُ مِنْ ذَلِكَ قَالَتْ وَهَلْ يَكُونُ هَذَا فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ فَمِنْ أَيْنَ يَكُونُ الشَّبَهُ إِنَّ مَاءَ الرَّجُلِ غَلِيظٌ أَبْيَضُ وَمَاءَ الْمَرْأَةِ رَقِيقٌ أَصْفَرُ فَمِنْ أَيِّهِمَا عَلاَ أَوْ سَبَقَ يَكُونُ مِنْهُ الشَّبَهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 711,
			"arabicnumber": "312",
			"text": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا صَالِحُ بْنُ عُمَرَ، حَدَّثَنَا أَبُو مَالِكٍ الأَشْجَعِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ سَأَلَتِ امْرَأَةٌ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ فِي مَنَامِهِ فَقَالَ ‏ \"‏ إِذَا كَانَ مِنْهَا مَا يَكُونُ مِنَ الرَّجُلِ فَلْتَغْتَسِلْ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 712,
			"arabicnumber": "313.01",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ جَاءَتْ أُمُّ سُلَيْمٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لاَ يَسْتَحْيِي مِنَ الْحَقِّ فَهَلْ عَلَى الْمَرْأَةِ مِنْ غُسْلٍ إِذَا احْتَلَمَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ نَعَمْ إِذَا رَأَتِ الْمَاءَ ‏\"‏ ‏.‏ فَقَالَتْ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ وَتَحْتَلِمُ الْمَرْأَةُ فَقَالَ ‏\"‏ تَرِبَتْ يَدَاكِ فَبِمَ يُشْبِهُهَا وَلَدُهَا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 713,
			"arabicnumber": "313.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الإِسْنَادِ مِثْلَ مَعْنَاهُ وَزَادَ قَالَتْ قُلْتُ فَضَحْتِ النِّسَاءَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 714,
			"arabicnumber": "314.01",
			"text": "وَحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ أُمَّ سُلَيْمٍ أُمَّ بَنِي أَبِي طَلْحَةَ دَخَلَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ بِمَعْنَى حَدِيثِ هِشَامٍ غَيْرَ أَنَّ فِيهِ قَالَ قَالَتْ عَائِشَةُ فَقُلْتُ لَهَا أُفٍّ لَكِ أَتَرَى الْمَرْأَةُ ذَلِكِ",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 715,
			"arabicnumber": "314.02",
			"text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، وَسَهْلُ بْنُ عُثْمَانَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالَ سَهْلٌ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ أَبِيهِ، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ مُسَافِعِ بْنِ عَبْدِ اللَّهِ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، قَالَتْ لِرَسُولِ اللَّهِ صلى الله عليه وسلم هَلْ تَغْتَسِلُ الْمَرْأَةُ إِذَا احْتَلَمَتْ وَأَبْصَرَتِ الْمَاءَ فَقَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ فَقَالَتْ لَهَا عَائِشَةُ تَرِبَتْ يَدَاكِ وَأُلَّتْ ‏.‏ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ دَعِيهَا وَهَلْ يَكُونُ الشَّبَهُ إِلاَّ مِنْ قِبَلِ ذَلِكِ إِذَا عَلاَ مَاؤُهَا مَاءَ الرَّجُلِ أَشْبَهَ الْوَلَدُ أَخْوَالَهُ وَإِذَا عَلاَ مَاءُ الرَّجُلِ مَاءَهَا أَشْبَهَ أَعْمَامَهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 716,
			"arabicnumber": "315.01",
			"text": "حَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَبُو تَوْبَةَ، - وَهُوَ الرَّبِيعُ بْنُ نَافِعٍ - حَدَّثَنَا مُعَاوِيَةُ، - يَعْنِي ابْنَ سَلاَّمٍ - عَنْ زَيْدٍ، - يَعْنِي أَخَاهُ - أَنَّهُ سَمِعَ أَبَا سَلاَّمٍ، قَالَ حَدَّثَنِي أَبُو أَسْمَاءَ الرَّحَبِيُّ، أَنَّ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حَدَّثَهُ قَالَ كُنْتُ قَائِمًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَاءَ حَبْرٌ مِنْ أَحْبَارِ الْيَهُودِ فَقَالَ السَّلاَمُ عَلَيْكَ يَا مُحَمَّدُ ‏.‏ فَدَفَعْتُهُ دَفْعَةً كَادَ يُصْرَعُ مِنْهَا فَقَالَ لِمَ تَدْفَعُنِي فَقُلْتُ أَلاَ تَقُولُ يَا رَسُولَ اللَّهِ ‏.‏ فَقَالَ الْيَهُودِيُّ إِنَّمَا نَدْعُوهُ بِاسْمِهِ الَّذِي سَمَّاهُ بِهِ أَهْلُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّ اسْمِي مُحَمَّدٌ الَّذِي سَمَّانِي بِهِ أَهْلِي ‏\"‏ ‏.‏ فَقَالَ الْيَهُودِيُّ جِئْتُ أَسْأَلُكَ ‏.‏ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَيَنْفَعُكَ شَىْءٌ إِنْ حَدَّثْتُكَ ‏\"‏ ‏.‏ قَالَ أَسْمَعُ بِأُذُنَىَّ فَنَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِعُودٍ مَعَهُ ‏.‏ فَقَالَ ‏\"‏ سَلْ ‏\"‏ ‏.‏ فَقَالَ الْيَهُودِيُّ أَيْنَ يَكُونُ النَّاسُ يَوْمَ تُبَدَّلُ الأَرْضُ غَيْرَ الأَرْضِ وَالسَّمَوَاتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هُمْ فِي الظُّلْمَةِ دُونَ الْجِسْرِ ‏\"‏ ‏.‏ قَالَ فَمَنْ أَوَّلُ النَّاسِ إِجَازَةً قَالَ ‏\"‏ فُقَرَاءُ الْمُهَاجِرِينَ ‏\"‏ ‏.‏ قَالَ الْيَهُودِيُّ فَمَا تُحْفَتُهُمْ حِينَ يَدْخُلُونَ الْجَنَّةَ قَالَ ‏\"‏ زِيَادَةُ كَبِدِ النُّونِ ‏\"‏ قَالَ فَمَا غِذَاؤُهُمْ عَلَى إِثْرِهَا قَالَ ‏\"‏ يُنْحَرُ لَهُمْ ثَوْرُ الْجَنَّةِ الَّذِي كَانَ يَأْكُلُ مِنْ أَطْرَافِهَا ‏\"‏ ‏.‏ قَالَ فَمَا شَرَابُهُمْ عَلَيْهِ قَالَ ‏\"‏ مِنْ عَيْنٍ فِيهَا تُسَمَّى سَلْسَبِيلاً ‏\"‏ ‏.‏ قَالَ صَدَقْتَ ‏.‏ قَالَ وَجِئْتُ أَسْأَلُكَ عَنْ شَىْءٍ لاَ يَعْلَمُهُ أَحَدٌ مِنْ أَهْلِ الأَرْضِ إِلاَّ نَبِيٌّ أَوْ رَجُلٌ أَوْ رَجُلاَنِ ‏.‏ قَالَ ‏\"‏ يَنْفَعُكَ إِنْ حَدَّثْتُكَ ‏\"‏ ‏.‏ قَالَ أَسْمَعُ بِأُذُنَىَّ ‏.‏ قَالَ جِئْتُ أَسْأَلُكَ عَنِ الْوَلَدِ قَالَ ‏\"‏ مَاءُ الرَّجُلِ أَبْيَضُ وَمَاءُ الْمَرْأَةِ أَصْفَرُ فَإِذَا اجْتَمَعَا فَعَلاَ مَنِيُّ الرَّجُلِ مَنِيَّ الْمَرْأَةِ أَذْكَرَا بِإِذْنِ اللَّهِ وَإِذَا عَلاَ مَنِيُّ الْمَرْأَةِ مَنِيَّ الرَّجُلِ آنَثَا بِإِذْنِ اللَّهِ ‏\"‏ ‏.‏ قَالَ الْيَهُودِيُّ لَقَدْ صَدَقْتَ وَإِنَّكَ لَنَبِيٌّ ثُمَّ انْصَرَفَ فَذَهَبَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَقَدْ سَأَلَنِي هَذَا عَنِ الَّذِي سَأَلَنِي عَنْهُ وَمَا لِي عِلْمٌ بِشَىْءٍ مِنْهُ حَتَّى أَتَانِيَ اللَّهُ بِهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 717,
			"arabicnumber": "315.02",
			"text": "وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ، فِي هَذَا الإِسْنَادِ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ كُنْتُ قَاعِدًا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَقَالَ زَائِدَةُ كَبِدِ النُّونِ ‏.‏ وَقَالَ أَذْكَرَ وَآنَثَ ‏.‏ وَلَمْ يَقُلْ أَذْكَرَا وَآنَثَا ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 718,
			"arabicnumber": "316.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ يَبْدَأُ فَيَغْسِلُ يَدَيْهِ ثُمَّ يُفْرِغُ بِيَمِينِهِ عَلَى شِمَالِهِ فَيَغْسِلُ فَرْجَهُ ثُمَّ يَتَوَضَّأُ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ يَأْخُذُ الْمَاءَ فَيُدْخِلُ أَصَابِعَهُ فِي أُصُولِ الشَّعْرِ حَتَّى إِذَا رَأَى أَنْ قَدِ اسْتَبْرَأَ حَفَنَ عَلَى رَأْسِهِ ثَلاَثَ حَفَنَاتٍ ثُمَّ أَفَاضَ عَلَى سَائِرِ جَسَدِهِ ثُمَّ غَسَلَ رِجْلَيْهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 719,
			"arabicnumber": "316.02",
			"text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، كُلُّهُمْ عَنْ هِشَامٍ، فِي هَذَا الإِسْنَادِ وَلَيْسَ فِي حَدِيثِهِمْ غَسْلُ الرِّجْلَيْنِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 720,
			"arabicnumber": "316.03",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اغْتَسَلَ مِنَ الْجَنَابَةِ فَبَدَأَ فَغَسَلَ كَفَّيْهِ ثَلاَثًا ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ أَبِي مُعَاوِيَةَ وَلَمْ يَذْكُرْ غَسْلَ الرِّجْلَيْنِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 721,
			"arabicnumber": "316.04",
			"text": "وَحَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ قَبْلَ أَنْ يُدْخِلَ يَدَهُ فِي الإِنَاءِ ثُمَّ تَوَضَّأَ مِثْلَ وُضُوئِهِ لِلصَّلاَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 722,
			"arabicnumber": "317.01",
			"text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنِي عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ حَدَّثَتْنِي خَالَتِي، مَيْمُونَةُ قَالَتْ أَدْنَيْتُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم غُسْلَهُ مِنَ الْجَنَابَةِ فَغَسَلَ كَفَّيْهِ مَرَّتَيْنِ أَوْ ثَلاَثًا ثُمَّ أَدْخَلَ يَدَهُ فِي الإِنَاءِ ثُمَّ أَفْرَغَ بِهِ عَلَى فَرْجِهِ وَغَسَلَهُ بِشِمَالِهِ ثُمَّ ضَرَبَ بِشِمَالِهِ الأَرْضَ فَدَلَكَهَا دَلْكًا شَدِيدًا ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلاَةِ ثُمَّ أَفْرَغَ عَلَى رَأْسِهِ ثَلاَثَ حَفَنَاتٍ مِلْءَ كَفِّهِ ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ ثُمَّ تَنَحَّى عَنْ مَقَامِهِ ذَلِكَ فَغَسَلَ رِجْلَيْهِ ثُمَّ أَتَيْتُهُ بِالْمِنْدِيلِ فَرَدَّهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 723,
			"arabicnumber": "317.02",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَالأَشَجُّ وَإِسْحَاقُ كُلُّهُمْ عَنْ وَكِيعٍ، ح وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ‏.‏ وَلَيْسَ فِي حَدِيثِهِمَا إِفْرَاغُ ثَلاَثِ حَفَنَاتٍ عَلَى الرَّأْسِ وَفِي حَدِيثِ وَكِيعٍ وَصْفُ الْوُضُوءِ كُلِّهِ يَذْكُرُ الْمَضْمَضَةَ وَالاِسْتِنْشَاقَ فِيهِ وَلَيْسَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ ذِكْرُ الْمِنْدِيلِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 724,
			"arabicnumber": "317.03",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ الأَعْمَشِ، عَنْ سَالِمٍ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أُتِيَ بِمِنْدِيلٍ فَلَمْ يَمَسَّهُ وَجَعَلَ يَقُولُ بِالْمَاءِ هَكَذَا يَعْنِي يَنْفُضُهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 725,
			"arabicnumber": "318",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنِي أَبُو عَاصِمٍ، عَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ دَعَا بِشَىْءٍ نَحْوَ الْحِلاَبِ فَأَخَذَ بِكَفِّهِ بَدَأَ بِشِقِّ رَأْسِهِ الأَيْمَنِ ثُمَّ الأَيْسَرِ ثُمَّ أَخَذَ بِكَفَّيْهِ فَقَالَ بِهِمَا عَلَى رَأْسِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 726,
			"arabicnumber": "319.01",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَغْتَسِلُ مِنْ إِنَاءٍ هُوَ الْفَرَقُ مِنَ الْجَنَابَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 727,
			"arabicnumber": "319.02",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالُوا حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْتَسِلُ فِي الْقَدَحِ وَهُوَ الْفَرَقُ وَكُنْتُ أَغْتَسِلُ أَنَا وَهُوَ فِي الإِنَاءِ الْوَاحِدِ ‏.‏ وَفِي حَدِيثِ سُفْيَانَ مِنْ إِنَاءٍ وَاحِدٍ ‏.‏ قَالَ قُتَيْبَةُ قَالَ سُفْيَانُ وَالْفَرَقُ ثَلاَثَةُ آصُعٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 728,
			"arabicnumber": "320",
			"text": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ دَخَلْتُ عَلَى عَائِشَةَ أَنَا وَأَخُوهَا، مِنَ الرَّضَاعَةِ فَسَأَلَهَا عَنْ غُسْلِ النَّبِيِّ، صلى الله عليه وسلم مِنَ الْجَنَابَةِ فَدَعَتْ بِإِنَاءٍ قَدْرِ الصَّاعِ فَاغْتَسَلَتْ وَبَيْنَنَا وَبَيْنَهَا سِتْرٌ وَأَفْرَغَتْ عَلَى رَأْسِهَا ثَلاَثًا ‏.‏ قَالَ وَكَانَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم يَأْخُذْنَ مِنْ رُءُوسِهِنَّ حَتَّى تَكُونَ كَالْوَفْرَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 729,
			"arabicnumber": "321.01",
			"text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ قَالَتْ عَائِشَةُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ بَدَأَ بِيَمِينِهِ فَصَبَّ عَلَيْهَا مِنَ الْمَاءِ فَغَسَلَهَا ثُمَّ صَبَّ الْمَاءَ عَلَى الأَذَى الَّذِي بِهِ بِيَمِينِهِ وَغَسَلَ عَنْهُ بِشِمَالِهِ حَتَّى إِذَا فَرَغَ مِنْ ذَلِكَ صَبَّ عَلَى رَأْسِهِ ‏.‏ قَالَتْ عَائِشَةُ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ وَنَحْنُ جُنُبَانِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 730,
			"arabicnumber": "321.02",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ، عَنْ عِرَاكٍ، عَنْ حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، - وَكَانَتْ تَحْتَ الْمُنْذِرِ بْنِ الزُّبَيْرِ - أَنَّ عَائِشَةَ، أَخْبَرَتْهَا أَنَّهَا، كَانَتْ تَغْتَسِلُ هِيَ وَالنَّبِيُّ صلى الله عليه وسلم فِي إِنَاءٍ وَاحِدٍ يَسَعُ ثَلاَثَةَ أَمْدَادٍ أَوْ قَرِيبًا مِنْ ذَلِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 731,
			"arabicnumber": "321.03",
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، قَالَ حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ تَخْتَلِفُ أَيْدِينَا فِيهِ مِنَ الْجَنَابَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 732,
			"arabicnumber": "321.04",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ مُعَاذَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ، صلى الله عليه وسلم مِنْ إِنَاءٍ - بَيْنِي وَبَيْنَهُ - وَاحِدٍ فَيُبَادِرُنِي حَتَّى أَقُولَ دَعْ لِي دَعْ لِي ‏.‏ قَالَتْ وَهُمَا جُنُبَانِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 733,
			"arabicnumber": "322",
			"text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي الشَّعْثَاءِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَخْبَرَتْنِي مَيْمُونَةُ، أَنَّهَا كَانَتْ تَغْتَسِلُ هِيَ وَالنَّبِيُّ صلى الله عليه وسلم فِي إِنَاءٍ وَاحِدٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 734,
			"arabicnumber": "323",
			"text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ حَاتِمٍ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ ابْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ أَكْبَرُ عِلْمِي وَالَّذِي يَخْطُرُ عَلَى بَالِي أَنَّ أَبَا الشَّعْثَاءِ أَخْبَرَنِي أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَغْتَسِلُ بِفَضْلِ مَيْمُونَةَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 735,
			"arabicnumber": "324",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ، حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْ، كَانَتْ هِيَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَغْتَسِلاَنِ فِي الإِنَاءِ الْوَاحِدِ مِنَ الْجَنَابَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 736,
			"arabicnumber": "325.01",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَبْرٍ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْتَسِلُ بِخَمْسِ مَكَاكِيكَ وَيَتَوَضَّأُ بِمَكُّوكٍ ‏.‏ وَقَالَ ابْنُ الْمُثَنَّى بِخَمْسِ مَكَاكِيَّ ‏.‏ وَقَالَ ابْنُ مُعَاذٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ وَلَمْ يَذْكُرِ ابْنَ جَبْرٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 737,
			"arabicnumber": "325.02",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنِ ابْنِ جَبْرٍ، عَنْ أَنَسِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَتَوَضَّأُ بِالْمُدِّ وَيَغْتَسِلُ بِالصَّاعِ إِلَى خَمْسَةِ أَمْدَادٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 738,
			"arabicnumber": "326.01",
			"text": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، وَعَمْرُو بْنُ عَلِيٍّ، كِلاَهُمَا عَنْ بِشْرِ بْنِ الْمُفَضَّلِ، - قَالَ أَبُو كَامِلٍ حَدَّثَنَا بِشْرٌ، - حَدَّثَنَا أَبُو رَيْحَانَةَ، عَنْ سَفِينَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُغَسِّلُهُ الصَّاعُ مِنَ الْمَاءِ مِنَ الْجَنَابَةِ وَيُوَضِّؤُهُ الْمُدُّ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 739,
			"arabicnumber": "326.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ عُلَيَّةَ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَبِي رَيْحَانَةَ، عَنْ سَفِينَةَ، - قَالَ أَبُو بَكْرٍ - صَاحِبُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَغْتَسِلُ بِالصَّاعِ وَيَتَطَهَّرُ بِالْمُدِّ ‏.‏ وَفِي حَدِيثِ ابْنِ حُجْرٍ أَوْ قَالَ وَيُطَهِّرُهُ الْمُدُّ ‏.‏ وَقَالَ وَقَدْ كَانَ كَبِرَ وَمَا كُنْتُ أَثِقُ بِحَدِيثِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 740,
			"arabicnumber": "327.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَبِي إِسْحَاقَ، عَنْ سُلَيْمَانَ بْنِ صُرَدٍ، عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ تَمَارَوْا فِي الْغُسْلِ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ بَعْضُ الْقَوْمِ أَمَّا أَنَا فَإِنِّي أَغْسِلُ رَأْسِي كَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَمَّا أَنَا فَإِنِّي أُفِيضُ عَلَى رَأْسِي ثَلاَثَ أَكُفٍّ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 741,
			"arabicnumber": "327.02",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ سُلَيْمَانَ بْنِ صُرَدٍ، عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ ذُكِرَ عِنْدَهُ الْغُسْلُ مِنَ الْجَنَابَةِ فَقَالَ ‏ \"‏ أَمَّا أَنَا فَأُفْرِغُ عَلَى رَأْسِي ثَلاَثًا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 742,
			"arabicnumber": "328",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْمَاعِيلُ بْنُ سَالِمٍ، قَالاَ أَخْبَرَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ وَفْدَ، ثَقِيفٍ سَأَلُوا النَّبِيَّ صلى الله عليه وسلم فَقَالُوا إِنَّ أَرْضَنَا أَرْضٌ بَارِدَةٌ فَكَيْفَ بِالْغُسْلِ فَقَالَ ‏ \"‏ أَمَّا أَنَا فَأُفْرِغُ عَلَى رَأْسِي ثَلاَثًا ‏\"‏ ‏.‏ قَالَ ابْنُ سَالِمٍ فِي رِوَايَتِهِ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو بِشْرٍ وَقَالَ إِنَّ وَفْدَ ثَقِيفٍ قَالُوا يَا رَسُولَ اللَّهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 743,
			"arabicnumber": "329",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي الثَّقَفِيَّ - حَدَّثَنَا جَعْفَرٌ، عَنْ أَبِيهِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اغْتَسَلَ مِنْ جَنَابَةٍ صَبَّ عَلَى رَأْسِهِ ثَلاَثَ حَفَنَاتٍ مِنْ مَاءٍ ‏.‏ فَقَالَ لَهُ الْحَسَنُ بْنُ مُحَمَّدٍ إِنَّ شَعْرِي كَثِيرٌ ‏.‏ قَالَ جَابِرٌ فَقُلْتُ لَهُ يَا ابْنَ أَخِي كَانَ شَعْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَكْثَرَ مِنْ شَعْرِكَ وَأَطْيَبَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 744,
			"arabicnumber": "330.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، قَالَ إِسْحَاقُ أَخْبَرَنَا سُفْيَانُ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ، مَوْلَى أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَشُدُّ ضَفْرَ رَأْسِي فَأَنْقُضُهُ لِغُسْلِ الْجَنَابَةِ قَالَ ‏ \"‏ لاَ إِنَّمَا يَكْفِيكِ أَنْ تَحْثِي عَلَى رَأْسِكِ ثَلاَثَ حَثَيَاتٍ ثُمَّ تُفِيضِينَ عَلَيْكِ الْمَاءَ فَتَطْهُرِينَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 745,
			"arabicnumber": "330.02",
			"text": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، قَالاَ أَخْبَرَنَا الثَّوْرِيُّ، عَنْ أَيُّوبَ بْنِ مُوسَى، فِي هَذَا الإِسْنَادِ وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ فَأَنْقُضُهُ لِلْحَيْضَةِ وَالْجَنَابَةِ فَقَالَ ‏ \"‏ لاَ ‏\"‏ ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ ابْنِ عُيَيْنَةَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 746,
			"arabicnumber": "330.03",
			"text": "وَحَدَّثَنِيهِ أَحْمَدُ الدَّارِمِيُّ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - عَنْ رَوْحِ بْنِ الْقَاسِمِ، حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى، بِهَذَا الإِسْنَادِ وَقَالَ أَفَأَحُلُّهُ فَأَغْسِلُهُ مِنَ الْجَنَابَةِ ‏.‏ وَلَمْ يَذْكُرِ الْحَيْضَةَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 747,
			"arabicnumber": "331",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ حُجْرٍ جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ يَحْيَى أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، قَالَ بَلَغَ عَائِشَةَ أَنَّ عَبْدَ، اللَّهِ بْنَ عَمْرٍو يَأْمُرُ النِّسَاءَ إِذَا اغْتَسَلْنَ أَنْ يَنْقُضْنَ رُءُوسَهُنَّ فَقَالَتْ يَا عَجَبًا لاِبْنِ عَمْرٍو هَذَا يَأْمُرُ النِّسَاءَ إِذَا اغْتَسَلْنَ أَنْ يَنْقُضْنَ رُءُوسَهُنَّ أَفَلاَ يَأْمُرُهُنَّ أَنْ يَحْلِقْنَ رُءُوسَهُنَّ لَقَدْ كُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ إِنَاءٍ وَاحِدٍ وَلاَ أَزِيدُ عَلَى أَنْ أُفْرِغَ عَلَى رَأْسِي ثَلاَثَ إِفْرَاغَاتٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 748,
			"arabicnumber": "332.01",
			"text": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ مَنْصُورٍ ابْنِ صَفِيَّةَ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ سَأَلَتِ امْرَأَةٌ النَّبِيَّ صلى الله عليه وسلم كَيْفَ تَغْتَسِلُ مِنْ حَيْضَتِهَا قَالَ فَذَكَرَتْ أَنَّهُ عَلَّمَهَا كَيْفَ تَغْتَسِلُ ثُمَّ تَأْخُذُ فِرْصَةً مِنْ مِسْكٍ فَتَطَهَّرُ بِهَا ‏.‏ قَالَتْ كَيْفَ أَتَطَهَّرُ بِهَا قَالَ ‏ \"‏ تَطَهَّرِي بِهَا ‏.‏ سُبْحَانَ اللَّهِ ‏\"‏ ‏.‏ وَاسْتَتَرَ - وَأَشَارَ لَنَا سُفْيَانُ بْنُ عُيَيْنَةَ بِيَدِهِ عَلَى وَجْهِهِ - قَالَ قَالَتْ عَائِشَةُ وَاجْتَذَبْتُهَا إِلَىَّ وَعَرَفْتُ مَا أَرَادَ النَّبِيُّ صلى الله عليه وسلم فَقُلْتُ تَتَبَّعِي بِهَا أَثَرَ الدَّمِ ‏.‏ وَقَالَ ابْنُ أَبِي عُمَرَ فِي رِوَايَتِهِ فَقُلْتُ تَتَبَّعِي بِهَا آثَارَ الدَّمِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 749,
			"arabicnumber": "332.02",
			"text": "وَحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مَنْصُورٌ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، أَنَّ امْرَأَةً، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم كَيْفَ أَغْتَسِلُ عِنْدَ الطُّهْرِ فَقَالَ ‏ \"‏ خُذِي فِرْصَةً مُمَسَّكَةً فَتَوَضَّئِي بِهَا ‏\"‏ ‏.‏ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ سُفْيَانَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 750,
			"arabicnumber": "332.03",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِبْرَاهِيمَ بْنِ الْمُهَاجِرِ، قَالَ سَمِعْتُ صَفِيَّةَ، تُحَدِّثُ عَنْ عَائِشَةَ، أَنَّ أَسْمَاءَ، سَأَلَتِ النَّبِيَّ صلى الله عليه وسلم عَنْ غُسْلِ الْمَحِيضِ فَقَالَ ‏\"‏ تَأْخُذُ إِحْدَاكُنَّ مَاءَهَا وَسِدْرَتَهَا فَتَطَهَّرُ فَتُحْسِنُ الطُّهُورَ ثُمَّ تَصُبُّ عَلَى رَأْسِهَا فَتَدْلُكُهُ دَلْكًا شَدِيدًا حَتَّى تَبْلُغَ شُئُونَ رَأْسِهَا ثُمَّ تَصُبُّ عَلَيْهَا الْمَاءَ ‏.‏ ثُمَّ تَأْخُذُ فِرْصَةً مُمَسَّكَةً فَتَطَهَّرُ بِهَا ‏\"‏ ‏.‏ فَقَالَتْ أَسْمَاءُ وَكَيْفَ تَطَهَّرُ بِهَا فَقَالَ ‏\"‏ سُبْحَانَ اللَّهِ تَطَهَّرِينَ بِهَا ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ كَأَنَّهَا تُخْفِي ذَلِكَ تَتَبَّعِينَ أَثَرَ الدَّمِ ‏.‏ وَسَأَلَتْهُ عَنْ غُسْلِ الْجَنَابَةِ فَقَالَ ‏\"‏ تَأْخُذُ مَاءً فَتَطَهَّرُ فَتُحْسِنُ الطُّهُورَ - أَوْ تُبْلِغُ الطُّهُورَ - ثُمَّ تَصُبُّ عَلَى رَأْسِهَا فَتَدْلُكُهُ حَتَّى تَبْلُغَ شُئُونَ رَأْسِهَا ثُمَّ تُفِيضُ عَلَيْهَا الْمَاءَ ‏\"‏ ‏.‏ فَقَالَتْ عَائِشَةُ نِعْمَ النِّسَاءُ نِسَاءُ الأَنْصَارِ لَمْ يَكُنْ يَمْنَعُهُنَّ الْحَيَاءُ أَنْ يَتَفَقَّهْنَ فِي الدِّينِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 751,
			"arabicnumber": "332.04",
			"text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، فِي هَذَا الإِسْنَادِ نَحْوَهُ وَقَالَ قَالَ ‏ \"‏ سُبْحَانَ اللَّهِ تَطَهَّرِي بِهَا ‏\"‏ ‏.‏ وَاسْتَتَرَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 752,
			"arabicnumber": "332.05",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنْ أَبِي الأَحْوَصِ، عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَتْ أَسْمَاءُ بِنْتُ شَكَلٍ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ كَيْفَ تَغْتَسِلُ إِحْدَانَا إِذَا طَهُرَتْ مِنَ الْحَيْضِ وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فِيهِ غُسْلَ الْجَنَابَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 753,
			"arabicnumber": "333.01",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلاَ أَطْهُرُ أَفَأَدَعُ الصَّلاَةَ فَقَالَ ‏ \"‏ لاَ إِنَّمَا ذَلِكِ عِرْقٌ وَلَيْسَ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلاَةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 754,
			"arabicnumber": "333.02",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، بِمِثْلِ حَدِيثِ وَكِيعٍ وَإِسْنَادِهِ ‏.‏ وَفِي حَدِيثِ قُتَيْبَةَ عَنْ جَرِيرٍ جَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشِ بْنِ عَبْدِ الْمُطَّلِبِ بْنِ أَسَدٍ وَهِيَ امْرَأَةٌ مِنَّا ‏.‏ قَالَ وَفِي حَدِيثِ حَمَّادِ بْنِ زَيْدٍ زِيَادَةُ حَرْفٍ تَرَكْنَا ذِكْرَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 755,
			"arabicnumber": "334.01",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتِ اسْتَفْتَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ إِنِّي أُسْتَحَاضُ ‏.‏ فَقَالَ ‏ \"‏ إِنَّمَا ذَلِكِ عِرْقٌ فَاغْتَسِلِي ثُمَّ صَلِّي ‏\"‏ ‏.‏ فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلاَةٍ ‏.‏ قَالَ اللَّيْثُ بْنُ سَعْدٍ لَمْ يَذْكُرِ ابْنُ شِهَابٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ أَنْ تَغْتَسِلَ عِنْدَ كُلِّ صَلاَةٍ وَلَكِنَّهُ شَىْءٌ فَعَلَتْهُ هِيَ ‏.‏ وَقَالَ ابْنُ رُمْحٍ فِي رِوَايَتِهِ ابْنَةُ جَحْشٍ وَلَمْ يَذْكُرْ أُمَّ حَبِيبَةَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 756,
			"arabicnumber": "334.02",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ - خَتَنَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَتَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ - اسْتُحِيضَتْ سَبْعَ سِنِينَ فَاسْتَفْتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ هَذِهِ لَيْسَتْ بِالْحَيْضَةِ وَلَكِنَّ هَذَا عِرْقٌ فَاغْتَسِلِي وَصَلِّي ‏\"‏ ‏.‏ قَالَتْ عَائِشَةُ فَكَانَتْ تَغْتَسِلُ فِي مِرْكَنٍ فِي حُجْرَةِ أُخْتِهَا زَيْنَبَ بِنْتِ جَحْشٍ حَتَّى تَعْلُوَ حُمْرَةُ الدَّمِ الْمَاءَ ‏.‏ قَالَ ابْنُ شِهَابٍ فَحَدَّثْتُ بِذَلِكَ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ فَقَالَ يَرْحَمُ اللَّهُ هِنْدًا لَوْ سَمِعَتْ بِهَذِهِ الْفُتْيَا وَاللَّهِ إِنْ كَانَتْ لَتَبْكِي لأَنَّهَا كَانَتْ لاَ تُصَلِّي ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 757,
			"arabicnumber": "334.03",
			"text": "وَحَدَّثَنِي أَبُو عِمْرَانَ، مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ أَخْبَرَنَا إِبْرَاهِيمُ، - يَعْنِي ابْنَ سَعْدٍ - عَنِ ابْنِ شِهَابٍ، عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ جَاءَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَكَانَتِ اسْتُحِيضَتْ سَبْعَ سِنِينَ بِمِثْلِ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ إِلَى قَوْلِهِ تَعْلُوَ حُمْرَةُ الدَّمِ الْمَاءَ ‏.‏ وَلَمْ يَذْكُرْ مَا بَعْدَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 758,
			"arabicnumber": "334.04",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ ابْنَةَ جَحْشٍ، كَانَتْ تُسْتَحَاضُ سَبْعَ سِنِينَ بِنَحْوِ حَدِيثِهِمْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 759,
			"arabicnumber": "334.05",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيِبٍ، عَنْ جَعْفَرٍ، عَنْ عِرَاكٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ إِنَّ أُمَّ حَبِيبَةَ سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الدَّمِ فَقَالَتْ عَائِشَةُ رَأَيْتُ مِرْكَنَهَا مَلآنَ دَمًا فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ امْكُثِي قَدْرَ مَا كَانَتْ تَحْبِسُكِ حَيْضَتُكِ ثُمَّ اغْتَسِلِي وَصَلِّي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 760,
			"arabicnumber": "334.06",
			"text": "حَدَّثَنِي مُوسَى بْنُ قُرَيْشٍ التَّمِيمِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ بَكْرِ بْنِ مُضَرَ، حَدَّثَنِي أَبِي، حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ إِنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ الَّتِي كَانَتْ تَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ شَكَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم الدَّمَ فَقَالَ لَهَا ‏ \"‏ امْكُثِي قَدْرَ مَا كَانَتْ تَحْبِسُكِ حَيْضَتُكِ ثُمَّ اغْتَسِلِي ‏\"‏ ‏.‏ فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلاَةٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 761,
			"arabicnumber": "335.01",
			"text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ مُعَاذَةَ، ح وَحَدَّثَنَا حَمَّادٌ، عَنْ يَزِيدَ الرِّشْكِ، عَنْ مُعَاذَةَ، أَنَّ امْرَأَةً، سَأَلَتْ عَائِشَةَ فَقَالَتْ أَتَقْضِي إِحْدَانَا الصَّلاَةَ أَيَّامَ مَحِيضِهَا فَقَالَتْ عَائِشَةُ أَحَرُورِيَّةٌ أَنْتِ قَدْ كَانَتْ إِحْدَانَا تَحِيضُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ لاَ تُؤْمَرُ بِقَضَاءٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 762,
			"arabicnumber": "335.02",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَزِيدَ، قَالَ سَمِعْتُ مُعَاذَةَ، أَنَّهَا سَأَلَتْ عَائِشَةَ أَتَقْضِي الْحَائِضُ الصَّلاَةَ فَقَالَتْ عَائِشَةُ أَحَرُورِيَّةٌ أَنْتِ قَدْ كُنَّ نِسَاءُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَحِضْنَ أَفَأَمَرَهُنَّ أَنْ يَجْزِينَ قَالَ مُحَمَّدُ بْنُ جَعْفَرٍ تَعْنِي يَقْضِينَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 763,
			"arabicnumber": "335.03",
			"text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ عَاصِمٍ، عَنْ مُعَاذَةَ، قَالَتْ سَأَلْتُ عَائِشَةَ فَقُلْتُ مَا بَالُ الْحَائِضِ تَقْضِي الصَّوْمَ وَلاَ تَقْضِي الصَّلاَةَ فَقَالَتْ أَحَرُورِيَّةٌ أَنْتِ قُلْتُ لَسْتُ بِحَرُورِيَّةٍ وَلَكِنِّي أَسْأَلُ ‏.‏ قَالَتْ كَانَ يُصِيبُنَا ذَلِكَ فَنُؤْمَرُ بِقَضَاءِ الصَّوْمِ وَلاَ نُؤْمَرُ بِقَضَاءِ الصَّلاَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 764,
			"arabicnumber": "336.01",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي النَّضْرِ، أَنَّ أَبَا مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ، تَقُولُ ذَهَبْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ فَوَجَدْتُهُ يَغْتَسِلُ ‏.‏ وَفَاطِمَةُ ابْنَتُهُ تَسْتُرُهُ بِثَوْبٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 765,
			"arabicnumber": "336.02",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، أَنَّ أَبَا مُرَّةَ، مَوْلَى عَقِيلٍ حَدَّثَهُ أَنَّ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ حَدَّثَتْهُ أَنَّهُ، لَمَّا كَانَ عَامُ الْفَتْحِ أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ بِأَعْلَى مَكَّةَ ‏.‏ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى غُسْلِهِ فَسَتَرَتْ عَلَيْهِ فَاطِمَةُ ثُمَّ أَخَذَ ثَوْبَهُ فَالْتَحَفَ بِهِ ثُمَّ صَلَّى ثَمَانَ رَكَعَاتٍ سُبْحَةَ الضُّحَى ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 766,
			"arabicnumber": "336.03",
			"text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، بِهَذَا الإِسْنَادِ وَقَالَ فَسَتَرَتْهُ ابْنَتُهُ فَاطِمَةُ بِثَوْبِهِ فَلَمَّا اغْتَسَلَ أَخَذَهُ فَالْتَحَفَ بِهِ ثُمَّ قَامَ فَصَلَّى ثَمَانَ سَجَدَاتٍ وَذَلِكَ ضُحًى ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 767,
			"arabicnumber": "337",
			"text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا مُوسَى الْقَارِئُ، حَدَّثَنَا زَائِدَةُ، عَنِ الأَعْمَشِ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، عَنْ مَيْمُونَةَ، قَالَتْ وَضَعْتُ لِلنَّبِيِّ صلى الله عليه وسلم مَاءً وَسَتَرْتُهُ فَاغْتَسَلَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 768,
			"arabicnumber": "338.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ لاَ يَنْظُرُ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ وَلاَ الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ وَلاَ يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي ثَوْبٍ وَاحِدٍ وَلاَ تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي الثَّوْبِ الْوَاحِدِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 769,
			"arabicnumber": "338.02",
			"text": "وَحَدَّثَنِيهِ هَارُونُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ بْنُ عُثْمَانَ، بِهَذَا الإِسْنَادِ وَقَالاَ - مَكَانَ عَوْرَةِ - عُرْيَةِ الرَّجُلِ وَعُرْيَةِ الْمَرْأَةِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 770,
			"arabicnumber": "339",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَانَتْ بَنُو إِسْرَائِيلَ يَغْتَسِلُونَ عُرَاةً يَنْظُرُ بَعْضُهُمْ إِلَى سَوْأَةِ بَعْضٍ وَكَانَ مُوسَى - عَلَيْهِ السَّلاَمُ - يَغْتَسِلُ وَحْدَهُ فَقَالُوا وَاللَّهِ مَا يَمْنَعُ مُوسَى أَنْ يَغْتَسِلَ مَعَنَا إِلاَّ أَنَّهُ آدَرُ - قَالَ - فَذَهَبَ مَرَّةً يَغْتَسِلُ فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ فَفَرَّ الْحَجَرُ بِثَوْبِهِ - قَالَ - فَجَمَحَ مُوسَى بِإِثْرِهِ يَقُولُ ثَوْبِي حَجَرُ ثَوْبِي حَجَرُ ‏.‏ حَتَّى نَظَرَتْ بَنُو إِسْرَائِيلَ إِلَى سَوْأَةِ مُوسَى قَالُوا وَاللَّهِ مَا بِمُوسَى مِنْ بَأْسٍ ‏.‏ فَقَامَ الْحَجَرُ حَتَّى نُظِرَ إِلَيْهِ - قَالَ - فَأَخَذَ ثَوْبَهُ فَطَفِقَ بِالْحَجَرِ ضَرْبًا ‏\"‏ ‏.‏ قَالَ أَبُو هُرَيْرَةَ وَاللَّهِ إِنَّهُ بِالْحَجَرِ نَدَبٌ سِتَّةٌ أَوْ سَبْعَةٌ ضَرْبُ مُوسَى بِالْحَجَرِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 771,
			"arabicnumber": "340.01",
			"text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، جَمِيعًا عَنْ مُحَمَّدِ بْنِ بَكْرٍ، قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَاللَّفْظُ، لَهُمَا - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ لَمَّا بُنِيَتِ الْكَعْبَةُ ذَهَبَ النَّبِيُّ صلى الله عليه وسلم وَعَبَّاسٌ يَنْقُلاَنِ حِجَارَةً فَقَالَ الْعَبَّاسُ لِلنَّبِيِّ صلى الله عليه وسلم اجْعَلْ إِزَارَكَ عَلَى عَاتِقِكَ مِنَ الْحِجَارَةِ ‏.‏ فَفَعَلَ فَخَرَّ إِلَى الأَرْضِ وَطَمَحَتْ عَيْنَاهُ إِلَى السَّمَاءِ ثُمَّ قَامَ فَقَالَ ‏ \"‏ إِزَارِي إِزَارِي ‏\"‏ ‏.‏ فَشَدَّ عَلَيْهِ إِزَارَهُ ‏.‏ قَالَ ابْنُ رَافِعٍ فِي رِوَايَتِهِ عَلَى رَقَبَتِكَ ‏.‏ وَلَمْ يَقُلْ عَلَى عَاتِقِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 772,
			"arabicnumber": "340.02",
			"text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَنْقُلُ مَعَهُمُ الْحِجَارَةَ لِلْكَعْبَةِ وَعَلَيْهِ إِزَارُهُ فَقَالَ لَهُ الْعَبَّاسُ عَمُّهُ يَا ابْنَ أَخِي لَوْ حَلَلْتَ إِزَارَكَ فَجَعَلْتَهُ عَلَى مَنْكِبِكَ دُونَ الْحِجَارَةِ - قَالَ - فَحَلَّهُ فَجَعَلَهُ عَلَى مَنْكِبِهِ فَسَقَطَ مَغْشِيًّا عَلَيْهِ - قَالَ - فَمَا رُؤِيَ بَعْدَ ذَلِكَ الْيَوْمِ عُرْيَانًا ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 773,
			"arabicnumber": "341",
			"text": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى الأُمَوِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمِ بْنِ عَبَّادِ بْنِ حُنَيْفٍ الأَنْصَارِيُّ، أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ أَقْبَلْتُ بِحَجَرٍ أَحْمِلُهُ ثَقِيلٍ وَعَلَىَّ إِزَارٌ خَفِيفٌ - قَالَ - فَانْحَلَّ إِزَارِي وَمَعِيَ الْحَجَرُ لَمْ أَسْتَطِعْ أَنْ أَضَعَهُ حَتَّى بَلَغْتُ بِهِ إِلَى مَوْضِعِهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ارْجِعْ إِلَى ثَوْبِكَ فَخُذْهُ وَلاَ تَمْشُوا عُرَاةً ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 774,
			"arabicnumber": "342",
			"text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، وَعَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، قَالاَ حَدَّثَنَا مَهْدِيٌّ، - وَهُوَ ابْنُ مَيْمُونٍ - حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، عَنِ الْحَسَنِ بْنِ سَعْدٍ، مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ أَرْدَفَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ خَلْفَهُ فَأَسَرَّ إِلَىَّ حَدِيثًا لاَ أُحَدِّثُ بِهِ أَحَدًا مِنَ النَّاسِ وَكَانَ أَحَبَّ مَا اسْتَتَرَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم لِحَاجَتِهِ هَدَفٌ أَوْ حَائِشُ نَخْلٍ ‏.‏ قَالَ ابْنُ أَسْمَاءَ فِي حَدِيثِهِ يَعْنِي حَائِطَ نَخْلٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 775,
			"arabicnumber": "343.01",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ - قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ شَرِيكٍ، - يَعْنِي ابْنَ أَبِي نَمِرٍ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنْ أَبِيهِ، قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الاِثْنَيْنِ إِلَى قُبَاءٍ حَتَّى إِذَا كُنَّا فِي بَنِي سَالِمٍ وَقَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى بَابِ عِتْبَانَ فَصَرَخَ بِهِ فَخَرَجَ يَجُرُّ إِزَارَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَعْجَلْنَا الرَّجُلَ ‏\"‏ ‏.‏ فَقَالَ عِتْبَانُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ الرَّجُلَ يُعْجَلُ عَنِ امْرَأَتِهِ وَلَمْ يُمْنِ مَاذَا عَلَيْهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا الْمَاءُ مِنَ الْمَاءِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 776,
			"arabicnumber": "343.02",
			"text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ ‏ \"‏ إِنَّمَا الْمَاءُ مِنَ الْمَاءِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 777,
			"arabicnumber": "344",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا الْمُعْتَمِرُ، حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو الْعَلاَءِ بْنُ الشِّخِّيرِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْسَخُ حَدِيثُهُ بَعْضُهُ بَعْضًا كَمَا يَنْسَخُ الْقُرْآنُ بَعْضُهُ بَعْضًا ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 778,
			"arabicnumber": "345",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ ذَكْوَانَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى رَجُلٍ مِنَ الأَنْصَارِ فَأَرْسَلَ إِلَيْهِ فَخَرَجَ وَرَأْسُهُ يَقْطُرُ فَقَالَ ‏\"‏ لَعَلَّنَا أَعْجَلْنَاكَ ‏\"‏ ‏.‏ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ إِذَا أُعْجِلْتَ أَوْ أَقْحَطْتَ فَلاَ غُسْلَ عَلَيْكَ وَعَلَيْكَ الْوُضُوءُ ‏\"‏ ‏.‏ وَقَالَ ابْنُ بَشَّارٍ ‏\"‏ إِذَا أُعْجِلْتَ أَوْ أُقْحِطْتَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 779,
			"arabicnumber": "346.01",
			"text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ أَبِي أَيُّوبَ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الرَّجُلِ يُصِيبُ مِنَ الْمَرْأَةِ ثُمَّ يُكْسِلُ فَقَالَ ‏ \"‏ يَغْسِلُ مَا أَصَابَهُ مِنَ الْمَرْأَةِ ثُمَّ يَتَوَضَّأُ وَيُصَلِّي ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 780,
			"arabicnumber": "346.02",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، حَدَّثَنِي أَبِي، عَنِ الْمَلِيِّ، عَنِ الْمَلِيِّ، - يَعْنِي بِقَوْلِهِ الْمَلِيِّ عَنِ الْمَلِيِّ أَبُو أَيُّوبَ، - عَنْ أُبَىِّ بْنِ كَعْبٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ فِي الرَّجُلِ يَأْتِي أَهْلَهُ ثُمَّ لاَ يُنْزِلُ قَالَ ‏ \"‏ يَغْسِلُ ذَكَرَهُ وَيَتَوَضَّأُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 781,
			"arabicnumber": "347.01",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، ح وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، - وَاللَّفْظُ لَهُ - حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنِ الْحُسَيْنِ بْنِ ذَكْوَانَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، أَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّهُ، سَأَلَ عُثْمَانَ بْنَ عَفَّانَ قَالَ قُلْتُ أَرَأَيْتَ إِذَا جَامَعَ الرَّجُلُ امْرَأَتَهُ وَلَمْ يُمْنِ قَالَ عُثْمَانُ ‏ \"‏ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ وَيَغْسِلُ ذَكَرَهُ ‏\"‏ ‏.‏ قَالَ عُثْمَانُ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 782,
			"arabicnumber": "347.02",
			"text": "وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنِ الْحُسَيْنِ، قَالَ يَحْيَى وَأَخْبَرَنِي أَبُو سَلَمَةَ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ أَخْبَرَهُ أَنَّهُ، سَمِعَ ذَلِكَ، مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 783,
			"arabicnumber": "348.01",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو غَسَّانَ الْمِسْمَعِيُّ ح وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالُوا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، وَمَطَرٍ، عَنِ الْحَسَنِ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الأَرْبَعِ ثُمَّ جَهَدَهَا فَقَدْ وَجَبَ عَلَيْهِ الْغُسْلُ ‏\"‏ ‏.‏ وَفِي حَدِيثِ مَطَرٍ ‏\"‏ وَإِنْ لَمْ يُنْزِلْ ‏\"‏ ‏.‏ قَالَ زُهَيْرٌ مِنْ بَيْنِهِمْ ‏\"‏ بَيْنَ أَشْعُبِهَا الأَرْبَعِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 784,
			"arabicnumber": "348.02",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ شُعْبَةَ ‏\"‏ ثُمَّ اجْتَهَدَ ‏\"‏ وَلَمْ يَقُلْ ‏\"‏ وَإِنْ لَمْ يُنْزِلْ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 785,
			"arabicnumber": "349",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَنْصَارِيُّ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، - وَهَذَا حَدِيثُهُ - حَدَّثَنَا هِشَامٌ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، قَالَ - وَلاَ أَعْلَمُهُ إِلاَّ عَنْ أَبِي بُرْدَةَ، - عَنْ أَبِي مُوسَى، قَالَ اخْتَلَفَ فِي ذَلِكَ رَهْطٌ مِنَ الْمُهَاجِرِينَ وَالأَنْصَارِ فَقَالَ الأَنْصَارِيُّونَ لاَ يَجِبُ الْغُسْلُ إِلاَّ مِنَ الدَّفْقِ أَوْ مِنَ الْمَاءِ ‏.‏ وَقَالَ الْمُهَاجِرُونَ بَلْ إِذَا خَالَطَ فَقَدْ وَجَبَ الْغُسْلُ ‏.‏ قَالَ قَالَ أَبُو مُوسَى فَأَنَا أَشْفِيكُمْ مِنْ ذَلِكَ ‏.‏ فَقُمْتُ فَاسْتَأْذَنْتُ عَلَى عَائِشَةَ فَأُذِنَ لِي فَقُلْتُ لَهَا يَا أُمَّاهْ - أَوْ يَا أُمَّ الْمُؤْمِنِينَ - إِنِّي أُرِيدُ أَنْ أَسْأَلَكِ عَنْ شَىْءٍ وَإِنِّي أَسْتَحْيِيكِ ‏.‏ فَقَالَتْ لاَ تَسْتَحْيِي أَنْ تَسْأَلَنِي عَمَّا كُنْتَ سَائِلاً عَنْهُ أُمَّكَ الَّتِي وَلَدَتْكَ فَإِنَّمَا أَنَا أُمُّكَ ‏.‏ قُلْتُ فَمَا يُوجِبُ الْغُسْلَ قَالَتْ عَلَى الْخَبِيرِ سَقَطْتَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الأَرْبَعِ وَمَسَّ الْخِتَانُ الْخِتَانَ فَقَدْ وَجَبَ الْغُسْلُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 786,
			"arabicnumber": "350",
			"text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ كُلْثُومٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ إِنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الرَّجُلِ يُجَامِعُ أَهْلَهُ ثُمَّ يُكْسِلُ هَلْ عَلَيْهِمَا الْغُسْلُ وَعَائِشَةُ جَالِسَةٌ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنِّي لأَفْعَلُ ذَلِكَ أَنَا وَهَذِهِ ثُمَّ نَغْتَسِلُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 787,
			"arabicnumber": "351",
			"text": "وَحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، أَنَّ خَارِجَةَ بْنَ زَيْدٍ الأَنْصَارِيَّ، أَخْبَرَهُ أَنَّ أَبَاهُ زَيْدَ بْنَ ثَابِتٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ الْوُضُوءُ مِمَّا مَسَّتِ النَّارُ ‏\"‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 788,
			"arabicnumber": "352",
			"text": "قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُمَرُ بْنُ عَبْدِ الْعَزِيزِ، أَنَّ عَبْدَ اللَّهِ بْنَ إِبْرَاهِيمَ بْنِ قَارِظٍ، أَخْبَرَهُ أَنَّهُ، وَجَدَ أَبَا هُرَيْرَةَ يَتَوَضَّأُ عَلَى الْمَسْجِدِ فَقَالَ إِنَّمَا أَتَوَضَّأُ مِنْ أَثْوَارِ أَقِطٍ أَكَلْتُهَا لأَنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ تَوَضَّئُوا مِمَّا مَسَّتِ النَّارُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 789,
			"arabicnumber": "353",
			"text": "قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ خَالِدِ بْنِ عَمْرِو بْنِ عُثْمَانَ، وَأَنَا أُحَدِّثُهُ، هَذَا الْحَدِيثَ ‏.‏ أَنَّهُ سَأَلَ عُرْوَةَ بْنَ الزُّبَيْرِ عَنِ الْوُضُوءِ، مِمَّا مَسَّتِ النَّارُ فَقَالَ عُرْوَةُ سَمِعْتُ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ تَوَضَّئُوا مِمَّا مَسَّتِ النَّارُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 790,
			"arabicnumber": "354.01",
			"text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَكَلَ كَتِفَ شَاةٍ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 791,
			"arabicnumber": "354.02",
			"text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، أَخْبَرَنِي وَهْبُ بْنُ كَيْسَانَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، ح وَحَدَّثَنِي الزُّهْرِيُّ، عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنِ ابْنِ عَبَّاسٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَلِيٍّ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عَرْقًا - أَوْ لَحْمًا - ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ وَلَمْ يَمَسَّ مَاءً ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 792,
			"arabicnumber": "355.01",
			"text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا الزُّهْرِيُّ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، أَنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفٍ يَأْكُلُ مِنْهَا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 793,
			"arabicnumber": "355.02",
			"text": "حَدَّثَنِي أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ، عَنْ أَبِيهِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فَأَكَلَ مِنْهَا فَدُعِيَ إِلَى الصَّلاَةِ فَقَامَ وَطَرَحَ السِّكِّينَ وَصَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏ قَالَ ابْنُ شِهَابٍ وَحَدَّثَنِي عَلِيُّ بْنُ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِذَلِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 795,
			"arabicnumber": "356.01",
			"text": "قَالَ عَمْرٌو وَحَدَّثَنِي بُكَيْرُ بْنُ الأَشَجِّ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم أَكَلَ عِنْدَهَا كَتِفًا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 796,
			"arabicnumber": "356.02",
			"text": "قَالَ عَمْرٌو حَدَّثَنِي جَعْفَرُ بْنُ رَبِيعَةَ، عَنْ يَعْقُوبَ بْنِ الأَشَجِّ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم بِذَلِكَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 797,
			"arabicnumber": "357",
			"text": "قَالَ عَمْرٌو حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، عَنْ أَبِي غَطَفَانَ، عَنْ أَبِي رَافِعٍ، قَالَ أَشْهَدُ لَكُنْتُ أَشْوِي لِرَسُولِ اللَّهِ صلى الله عليه وسلم بَطْنَ الشَّاةِ ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 798,
			"arabicnumber": "358.01",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم شَرِبَ لَبَنًا ثُمَّ دَعَا بِمَاءٍ فَتَمَضْمَضَ وَقَالَ ‏ \"‏ إِنَّ لَهُ دَسَمًا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 799,
			"arabicnumber": "358.02",
			"text": "وَحَدَّثَنِي أَحْمَدُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ وَهْبٍ، وَأَخْبَرَنِي عَمْرٌو، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ الأَوْزَاعِيِّ، ح وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي يُونُسُ، كُلُّهُمْ عَنِ ابْنِ شِهَابٍ، بِإِسْنَادِ عُقَيْلٍ عَنِ الزُّهْرِيِّ، مِثْلَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 800,
			"arabicnumber": "359.01",
			"text": "وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم جَمَعَ عَلَيْهِ ثِيَابَهُ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ فَأُتِيَ بِهَدِيَّةٍ خُبْزٍ وَلَحْمٍ فَأَكَلَ ثَلاَثَ لُقَمٍ ثُمَّ صَلَّى بِالنَّاسِ وَمَا مَسَّ مَاءً ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 801,
			"arabicnumber": "359.02",
			"text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ، قَالَ كُنْتُ مَعَ ابْنِ عَبَّاسٍ ‏.‏ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ حَلْحَلَةَ وَفِيهِ أَنَّ ابْنَ عَبَّاسٍ، شَهِدَ ذَلِكَ مِنَ النَّبِيِّ صلى الله عليه وسلم ‏.‏ وَقَالَ صَلَّى وَلَمَ يَقُلْ بِالنَّاسِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 802,
			"arabicnumber": "360.01",
			"text": "حَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَأَتَوَضَّأُ مِنْ لُحُومِ الْغَنَمِ قَالَ ‏\"‏ إِنْ شِئْتَ فَتَوَضَّأْ وَإِنْ شِئْتَ فَلاَ تَوَضَّأْ ‏\"‏ ‏.‏ قَالَ أَتَوَضَّأُ مِنْ لُحُومِ الإِبِلِ قَالَ ‏\"‏ نَعَمْ فَتَوَضَّأْ مِنْ لُحُومِ الإِبِلِ ‏\"‏ ‏.‏ قَالَ أُصَلِّي فِي مَرَابِضِ الْغَنَمِ قَالَ ‏\"‏ نَعَمْ ‏\"‏ ‏.‏ قَالَ أُصَلِّي فِي مَبَارِكِ الإِبِلِ قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 803,
			"arabicnumber": "360.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، عَنْ سِمَاكٍ، ح وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، وَأَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، كُلُّهُمْ عَنْ جَعْفَرِ بْنِ أَبِي ثَوْرٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ أَبِي كَامِلٍ عَنْ أَبِي عَوَانَةَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 804,
			"arabicnumber": "361",
			"text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، وَعَبَّادِ بْنِ تَمِيمٍ، عَنْ عَمِّهِ، شُكِيَ إِلَى النَّبِيِّ صلى الله عليه وسلم الرَّجُلُ يُخَيَّلُ إِلَيْهِ أَنَّهُ يَجِدُ الشَّىْءَ فِي الصَّلاَةِ قَالَ ‏ \"‏ لاَ يَنْصَرِفُ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ وَزُهَيْرُ بْنُ حَرْبٍ فِي رِوَايَتِهِمَا هُوَ عَبْدُ اللَّهِ بْنُ زَيْدٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 805,
			"arabicnumber": "362",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا وَجَدَ أَحَدُكُمْ فِي بَطْنِهِ شَيْئًا فَأَشْكَلَ عَلَيْهِ أَخَرَجَ مِنْهُ شَىْءٌ أَمْ لاَ فَلاَ يَخْرُجَنَّ مِنَ الْمَسْجِدِ حَتَّى يَسْمَعَ صَوْتًا أَوْ يَجِدَ رِيحًا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 806,
			"arabicnumber": "363.01",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ تُصُدِّقَ عَلَى مَوْلاَةٍ لِمَيْمُونَةَ بِشَاةٍ فَمَاتَتْ فَمَرَّ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَلاَّ أَخَذْتُمْ إِهَابَهَا فَدَبَغْتُمُوهُ فَانْتَفَعْتُمْ بِهِ ‏\"‏ ‏.‏ فَقَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏ ‏.‏ قَالَ أَبُو بَكْرٍ وَابْنُ أَبِي عُمَرَ فِي حَدِيثِهِمَا عَنْ مَيْمُونَةَ رضى الله عنها ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 807,
			"arabicnumber": "363.02",
			"text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَجَدَ شَاةً مَيْتَةً أُعْطِيَتْهَا مَوْلاَةٌ لِمَيْمُونَةَ مِنَ الصَّدَقَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ هَلاَّ انْتَفَعْتُمْ بِجِلْدِهَا ‏\"‏ ‏.‏ قَالُوا إِنَّهَا مَيْتَةٌ ‏.‏ فَقَالَ ‏\"‏ إِنَّمَا حَرُمَ أَكْلُهَا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 808,
			"arabicnumber": "363.03",
			"text": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ بِنَحْوِ رِوَايَةِ يُونُسَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 129
			}
		},
		{
			"hadithnumber": 809,
			"arabicnumber": "363.04",
			"text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِشَاةٍ مَطْرُوحَةٍ أُعْطِيَتْهَا مَوْلاَةٌ لِمَيْمُونَةَ مِنَ الصَّدَقَةِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ أَلاَّ أَخَذُوا إِهَابَهَا فَدَبَغُوهُ فَانْتَفَعُوا بِهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 130
			}
		},
		{
			"hadithnumber": 810,
			"arabicnumber": "364",
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَخْبَرَنِي عَطَاءٌ، مُنْذُ حِينٍ قَالَ أَخْبَرَنِي ابْنُ عَبَّاسٍ، أَنَّ مَيْمُونَةَ، أَخْبَرَتْهُ أَنَّ دَاجِنَةً كَانَتْ لِبَعْضِ نِسَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَاتَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلاَّ أَخَذْتُمْ إِهَابَهَا فَاسْتَمْتَعْتُمْ بِهِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 131
			}
		},
		{
			"hadithnumber": 811,
			"arabicnumber": "365",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِشَاةٍ لِمَوْلاَةٍ لِمَيْمُونَةَ فَقَالَ ‏ \"‏ أَلاَّ انْتَفَعْتُمْ بِإِهَابِهَا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 132
			}
		},
		{
			"hadithnumber": 812,
			"arabicnumber": "366.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ وَعْلَةَ، أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا دُبِغَ الإِهَابُ فَقَدْ طَهُرَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 133
			}
		},
		{
			"hadithnumber": 813,
			"arabicnumber": "366.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالاَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ وَكِيعٍ، عَنْ سُفْيَانَ، كُلُّهُمْ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ يَعْنِي حَدِيثَ يَحْيَى بْنِ يَحْيَى ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 134
			}
		},
		{
			"hadithnumber": 814,
			"arabicnumber": "366.03",
			"text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَقَالَ ابْنُ مَنْصُورٍ، أَخْبَرَنَا عَمْرُو بْنُ الرَّبِيعِ، أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ أَبَا الْخَيْرِ، حَدَّثَهُ قَالَ رَأَيْتُ عَلَى ابْنِ وَعْلَةَ السَّبَئِيِّ فَرْوًا فَمَسِسْتُهُ فَقَالَ مَا لَكَ تَمَسُّهُ قَدْ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قُلْتُ إِنَّا نَكُونُ بِالْمَغْرِبِ وَمَعَنَا الْبَرْبَرُ وَالْمَجُوسُ نُؤْتَى بِالْكَبْشِ قَدْ ذَبَحُوهُ وَنَحْنُ لاَ نَأْكُلُ ذَبَائِحَهُمْ وَيَأْتُونَا بِالسِّقَاءِ يَجْعَلُونَ فِيهِ الْوَدَكَ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ قَدْ سَأَلْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ ‏ \"‏ دِبَاغُهُ طَهُورُهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 135
			}
		},
		{
			"hadithnumber": 815,
			"arabicnumber": "366.04",
			"text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ عَنْ عَمْرِو بْنِ الرَّبِيعِ، أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ أَبِي الْخَيْرِ، حَدَّثَهُ قَالَ حَدَّثَنِي ابْنُ وَعْلَةَ السَّبَئِيُّ، قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قُلْتُ إِنَّا نَكُونُ بِالْمَغْرِبِ فَيَأْتِينَا الْمَجُوسُ بِالأَسْقِيَةِ فِيهَا الْمَاءُ وَالْوَدَكُ فَقَالَ اشْرَبْ ‏.‏ فَقُلْتُ أَرَأْىٌ تَرَاهُ فَقَالَ ابْنُ عَبَّاسٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ دِبَاغُهُ طَهُورُهُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 136
			}
		},
		{
			"hadithnumber": 816,
			"arabicnumber": "367.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ - أَوْ بِذَاتِ الْجَيْشِ - انْقَطَعَ عِقْدٌ لِي فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ وَأَقَامَ النَّاسُ مَعَهُ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ فَقَالُوا أَلاَ تَرَى إِلَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَبِالنَّاسِ مَعَهُ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ ‏.‏ فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ وَلَيْسُوا عَلَى مَاءٍ وَلَيْسَ مَعَهُمْ مَاءٌ ‏.‏ قَالَتْ فَعَاتَبَنِي أَبُو بَكْرٍ وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ وَجَعَلَ يَطْعُنُ بِيَدِهِ فِي خَاصِرَتِي فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي فَنَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى أَصْبَحَ عَلَى غَيْرِ مَاءٍ فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ فَتَيَمَّمُوا ‏.‏ فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ - وَهُوَ أَحَدُ النُّقَبَاءِ - مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ ‏.‏ فَقَالَتْ عَائِشَةُ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ فَوَجَدْنَا الْعِقْدَ تَحْتَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 137
			}
		},
		{
			"hadithnumber": 817,
			"arabicnumber": "367.02",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، بِشْرٍ عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا اسْتَعَارَتْ مِنْ أَسْمَاءَ قِلاَدَةً فَهَلَكَتْ فَأَرْسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نَاسًا مِنْ أَصْحَابِهِ فِي طَلَبِهَا فَأَدْرَكَتْهُمُ الصَّلاَةُ فَصَلَّوْا بِغَيْرِ وُضُوءٍ فَلَمَّا أَتَوُا النَّبِيَّ صلى الله عليه وسلم شَكَوْا ذَلِكَ إِلَيْهِ فَنَزَلَتْ آيَةُ التَّيَمُّمِ ‏.‏ فَقَالَ أُسَيْدُ بْنُ حُضَيْرٍ جَزَاكِ اللَّهُ خَيْرًا فَوَاللَّهِ مَا نَزَلَ بِكِ أَمْرٌ قَطُّ إِلاَّ جَعَلَ اللَّهُ لَكِ مِنْهُ مَخْرَجًا وَجَعَلَ لِلْمُسْلِمِينَ فِيهِ بَرَكَةً ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 138
			}
		},
		{
			"hadithnumber": 818,
			"arabicnumber": "368.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، قَالَ كُنْتُ جَالِسًا مَعَ عَبْدِ اللَّهِ وَأَبِي مُوسَى فَقَالَ أَبُو مُوسَى يَا أَبَا عَبْدِ الرَّحْمَنِ أَرَأَيْتَ لَوْ أَنَّ رَجُلاً أَجْنَبَ فَلَمْ يَجِدِ الْمَاءَ شَهْرًا كَيْفَ يَصْنَعُ بِالصَّلاَةِ فَقَالَ عَبْدُ اللَّهِ لاَ يَتَيَمَّمُ وَإِنْ لَمْ يَجِدِ الْمَاءَ شَهْرًا ‏.‏ فَقَالَ أَبُو مُوسَى فَكَيْفَ بِهَذِهِ الآيَةِ فِي سُورَةِ الْمَائِدَةِ ‏{‏ فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا صَعِيدًا طَيِّبًا‏}‏ فَقَالَ عَبْدُ اللَّهِ لَوْ رُخِّصَ لَهُمْ فِي هَذِهِ الآيَةِ - لأَوْشَكَ إِذَا بَرَدَ عَلَيْهِمُ الْمَاءُ أَنْ يَتَيَمَّمُوا بِالصَّعِيدِ ‏.‏ فَقَالَ أَبُو مُوسَى لِعَبْدِ اللَّهِ أَلَمْ تَسْمَعْ قَوْلَ عَمَّارٍ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَاجَةٍ فَأَجْنَبْتُ فَلَمْ أَجِدِ الْمَاءَ فَتَمَرَّغْتُ فِي الصَّعِيدِ كَمَا تَمَرَّغُ الدَّابَّةُ ثُمَّ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ‏\"‏ إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَقُولَ بِيَدَيْكَ هَكَذَا ‏\"‏ ‏.‏ ثُمَّ ضَرَبَ بِيَدَيْهِ الأَرْضَ ضَرْبَةً وَاحِدَةً ثُمَّ مَسَحَ الشِّمَالَ عَلَى الْيَمِينِ وَظَاهِرَ كَفَّيْهِ وَوَجْهَهُ ‏.‏ فَقَالَ عَبْدُ اللَّهِ أَوَلَمْ تَرَ عُمَرَ لَمْ يَقْنَعْ بِقَوْلِ عَمَّارٍ",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 139
			}
		},
		{
			"hadithnumber": 819,
			"arabicnumber": "368.02",
			"text": "وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، قَالَ قَالَ أَبُو مُوسَى لِعَبْدِ اللَّهِ وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ أَبِي مُعَاوِيَةَ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَقُولَ هَكَذَا ‏\"‏ ‏.‏ وَضَرَبَ بِيَدَيْهِ إِلَى الأَرْضِ فَنَفَضَ يَدَيْهِ فَمَسَحَ وَجْهَهُ وَكَفَّيْهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 140
			}
		},
		{
			"hadithnumber": 820,
			"arabicnumber": "368.03",
			"text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمٍ الْعَبْدِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ الْقَطَّانَ - عَنْ شُعْبَةَ، قَالَ حَدَّثَنِي الْحَكَمُ، عَنْ ذَرٍّ، عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى عُمَرَ فَقَالَ إِنِّي أَجْنَبْتُ فَلَمْ أَجِدْ مَاءً ‏.‏ فَقَالَ لاَ تُصَلِّ ‏.‏ فَقَالَ عَمَّارٌ أَمَا تَذْكُرُ يَا أَمِيرَ الْمُؤْمِنِينَ إِذْ أَنَا وَأَنْتَ فِي سَرِيَّةٍ فَأَجْنَبْنَا فَلَمْ نَجِدْ مَاءً فَأَمَّا أَنْتَ فَلَمْ تُصَلِّ وَأَمَّا أَنَا فَتَمَعَّكْتُ فِي التُّرَابِ وَصَلَّيْتُ ‏.‏ فَقَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ إِنَّمَا كَانَ يَكْفِيكَ أَنْ تَضْرِبَ بِيَدَيْكَ الأَرْضَ ثُمَّ تَنْفُخَ ثُمَّ تَمْسَحَ بِهِمَا وَجْهَكَ وَكَفَّيْكَ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ اتَّقِ اللَّهَ يَا عَمَّارُ ‏.‏ قَالَ إِنْ شِئْتَ لَمْ أُحَدِّثْ بِهِ ‏.‏ قَالَ الْحَكَمُ وَحَدَّثَنِيهِ ابْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ مِثْلَ حَدِيثِ ذَرٍّ قَالَ وَحَدَّثَنِي سَلَمَةُ عَنْ ذَرٍّ فِي هَذَا الإِسْنَادِ الَّذِي ذَكَرَ الْحَكَمُ فَقَالَ عُمَرُ نُوَلِّيكَ مَا تَوَلَّيْتَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 141
			}
		},
		{
			"hadithnumber": 821,
			"arabicnumber": "368.04",
			"text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَخْبَرَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ ذَرًّا، عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، قَالَ قَالَ الْحَكَمُ وَقَدْ سَمِعْتُهُ مِنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى عُمَرَ فَقَالَ إِنِّي أَجْنَبْتُ فَلَمْ أَجِدْ مَاءً ‏.‏ وَسَاقَ الْحَدِيثَ وَزَادَ فِيهِ قَالَ عَمَّارٌ يَا أَمِيرَ الْمُؤْمِنِينَ إِنْ شِئْتَ لِمَا جَعَلَ اللَّهُ عَلَىَّ مِنْ حَقِّكَ لاَ أُحَدِّثُ بِهِ أَحَدًا وَلَمْ يَذْكُرْ حَدَّثَنِي سَلَمَةُ عَنْ ذَرٍّ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 142
			}
		},
		{
			"hadithnumber": 822,
			"arabicnumber": "369",
			"text": "قَالَ مُسْلِمٌ وَرَوَى اللَّيْثُ بْنُ سَعْدٍ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ، عَنْ عُمَيْرٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّهُ سَمِعَهُ يَقُولُ أَقْبَلْتُ أَنَا وَعَبْدُ الرَّحْمَنِ بْنُ يَسَارٍ، مَوْلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم حَتَّى دَخَلْنَا عَلَى أَبِي الْجَهْمِ بْنِ الْحَارِثِ بْنِ الصِّمَّةِ الأَنْصَارِيِّ فَقَالَ أَبُو الْجَهْمِ أَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نَحْوِ بِئْرِ جَمَلٍ فَلَقِيَهُ رَجُلٌ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهِ حَتَّى أَقْبَلَ عَلَى الْجِدَارِ فَمَسَحَ وَجْهَهُ وَيَدَيْهِ ثُمَّ رَدَّ عَلَيْهِ السَّلاَمَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 143
			}
		},
		{
			"hadithnumber": 823,
			"arabicnumber": "370",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَجُلاً، مَرَّ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَبُولُ فَسَلَّمَ فَلَمْ يَرُدَّ عَلَيْهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 144
			}
		},
		{
			"hadithnumber": 824,
			"arabicnumber": "371",
			"text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - قَالَ حُمَيْدٌ حَدَّثَنَا ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ حُمَيْدٍ الطَّوِيلِ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ لَقِيَهُ النَّبِيُّ صلى الله عليه وسلم فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ وَهُوَ جُنُبٌ فَانْسَلَّ فَذَهَبَ فَاغْتَسَلَ فَتَفَقَّدَهُ النَّبِيُّ صلى الله عليه وسلم فَلَمَّا جَاءَهُ قَالَ ‏\"‏ أَيْنَ كُنْتَ يَا أَبَا هُرَيْرَةَ ‏\"‏ ‏.‏ قَالَ يَا رَسُولَ اللَّهِ لَقِيتَنِي وَأَنَا جُنُبٌ فَكَرِهْتُ أَنْ أُجَالِسَكَ حَتَّى أَغْتَسِلَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ سُبْحَانَ اللَّهِ إِنَّ الْمُؤْمِنَ لاَ يَنْجُسُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 145
			}
		},
		{
			"hadithnumber": 825,
			"arabicnumber": "372",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ وَاصِلٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَقِيَهُ وَهُوَ جُنُبٌ فَحَادَ عَنْهُ فَاغْتَسَلَ ثُمَّ جَاءَ فَقَالَ كُنْتُ جُنُبًا ‏.‏ قَالَ ‏ \"‏ إِنَّ الْمُسْلِمَ لاَ يَنْجُسُ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 146
			}
		},
		{
			"hadithnumber": 826,
			"arabicnumber": "373",
			"text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَإِبْرَاهِيمُ بْنُ مُوسَى قَالاَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ أَبِيهِ، عَنْ خَالِدِ بْنِ سَلَمَةَ، عَنِ الْبَهِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَذْكُرُ اللَّهَ عَلَى كُلِّ أَحْيَانِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 147
			}
		},
		{
			"hadithnumber": 827,
			"arabicnumber": "374.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، وَقَالَ أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ مِنَ الْخَلاَءِ فَأُتِيَ بِطَعَامٍ فَذَكَرُوا لَهُ الْوُضُوءَ فَقَالَ ‏ \"‏ أُرِيدُ أَنْ أُصَلِّيَ فَأَتَوَضَّأَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 148
			}
		},
		{
			"hadithnumber": 828,
			"arabicnumber": "374.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ، سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ كُنَّا عِنْدَ النَّبِيِّ صلى الله عليه وسلم فَجَاءَ مِنَ الْغَائِطِ وَأُتِيَ بِطَعَامٍ فَقِيلَ لَهُ أَلاَ تَوَضَّأُ فَقَالَ ‏ \"‏ لِمَ أَأُصَلِّي فَأَتَوَضَّأَ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 149
			}
		},
		{
			"hadithnumber": 829,
			"arabicnumber": "374.03",
			"text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ، مَوْلَى آلِ السَّائِبِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، قَالَ ذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْغَائِطِ فَلَمَّا جَاءَ قُدِّمَ لَهُ طَعَامٌ فَقِيلَ يَا رَسُولَ اللَّهِ أَلاَ تَوَضَّأُ ‏.‏ قَالَ ‏ \"‏ لِمَ أَلِلصَّلاَةِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 150
			}
		},
		{
			"hadithnumber": 830,
			"arabicnumber": "374.04",
			"text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَبَّادِ بْنِ جَبَلَةَ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ حُوَيْرِثٍ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، يَقُولُ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى حَاجَتَهُ مِنَ الْخَلاَءِ فَقُرِّبَ إِلَيْهِ طَعَامٌ فَأَكَلَ وَلَمْ يَمَسَّ مَاءً ‏.‏ قَالَ وَزَادَنِي عَمْرُو بْنُ دِينَارٍ عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ أَنَّ النَّبِيَّ صلى الله عليه وسلم قِيلَ لَهُ إِنَّكَ لَمْ تَوَضَّأْ قَالَ ‏ \"‏ مَا أَرَدْتُ صَلاَةً فَأَتَوَضَّأَ ‏\"‏ ‏.‏ وَزَعَمَ عَمْرٌو أَنَّهُ سَمِعَ مِنْ سَعِيدِ بْنِ الْحُوَيْرِثِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 151
			}
		},
		{
			"hadithnumber": 831,
			"arabicnumber": "375.01",
			"text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، وَقَالَ، يَحْيَى أَيْضًا أَخْبَرَنَا هُشَيْمٌ، كِلاَهُمَا عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، عَنْ أَنَسٍ، - فِي حَدِيثِ حَمَّادٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا دَخَلَ الْخَلاَءَ وَفِي حَدِيثِ هُشَيْمٍ - أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا دَخَلَ الْكَنِيفَ قَالَ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 152
			}
		},
		{
			"hadithnumber": 832,
			"arabicnumber": "375.02",
			"text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ، بِهَذَا الإِسْنَادِ وَقَالَ ‏ \"‏ أَعُوذُ بِاللَّهِ مِنَ الْخُبْثِ وَالْخَبَائِثِ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 153
			}
		},
		{
			"hadithnumber": 833,
			"arabicnumber": "376.01",
			"text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، ح وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، كِلاَهُمَا عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ أُقِيمَتِ الصَّلاَةُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم نَجِيٌّ لِرَجُلٍ - وَفِي حَدِيثِ عَبْدِ الْوَارِثِ وَنَبِيُّ اللَّهِ صلى الله عليه وسلم يُنَاجِي الرَّجُلَ - فَمَا قَامَ إِلَى الصَّلاَةِ حَتَّى نَامَ الْقَوْمُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 154
			}
		},
		{
			"hadithnumber": 834,
			"arabicnumber": "376.02",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، قَالَ أُقِيمَتِ الصَّلاَةُ وَالنَّبِيُّ صلى الله عليه وسلم يُنَاجِي رَجُلاً فَلَمْ يَزَلْ يُنَاجِيهِ حَتَّى نَامَ أَصْحَابُهُ ثُمَّ جَاءَ فَصَلَّى بِهِمْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 155
			}
		},
		{
			"hadithnumber": 835,
			"arabicnumber": "376.03",
			"text": "وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - وَهُوَ ابْنُ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَنَامُونَ ثُمَّ يُصَلُّونَ وَلاَ يَتَوَضَّئُونَ قَالَ قُلْتُ سَمِعْتَهُ مِنْ أَنَسٍ قَالَ إِي وَاللَّهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 156
			}
		},
		{
			"hadithnumber": 836,
			"arabicnumber": "376.04",
			"text": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّهُ قَالَ أُقِيمَتْ صَلاَةُ الْعِشَاءِ فَقَالَ رَجُلٌ لِي حَاجَةٌ ‏.‏ فَقَامَ النَّبِيُّ صلى الله عليه وسلم يُنَاجِيهِ حَتَّى نَامَ الْقَوْمُ - أَوْ بَعْضُ الْقَوْمِ - ثُمَّ صَلَّوْا ‏.‏",
			"grades": [],
			"reference": {
				"book": 3,
				"hadith": 157
			}
		}
	]
}