{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"51": "Characteristics of The Hypocrites And Rulings Concerning Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7024,
			"arabicnumber": "2772",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا أَبُو إِسْحَاقَ، أَنَّهُ سَمِعَ زَيْدَ بْنَ أَرْقَمَ، يَقُولُ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ أَصَابَ النَّاسَ فِيهِ شِدَّةٌ فَقَالَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ لأَصْحَابِهِ لاَ تُنْفِقُوا عَلَى مَنْ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى يَنْفَضُّوا مِنْ حَوْلِهِ ‏.‏ قَالَ زُهَيْرٌ وَهِيَ قِرَاءَةُ مَنْ خَفَضَ حَوْلَهُ ‏.‏ وَقَالَ لَئِنْ رَجَعْنَا إِلَى الْمَدِينَةِ لَيُخْرِجَنَّ الأَعَزُّ مِنْهَا الأَذَلَّ - قَالَ - فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرْتُهُ بِذَلِكَ فَأَرْسَلَ إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَسَأَلَهُ فَاجْتَهَدَ يَمِينَهُ مَا فَعَلَ فَقَالَ كَذَبَ زَيْدٌ رَسُولَ اللَّهِ صلى الله عليه وسلم - قَالَ - فَوَقَعَ فِي نَفْسِي مِمَّا قَالُوهُ شِدَّةٌ حَتَّى أَنْزَلَ اللَّهُ تَصْدِيقِي ‏{‏ إِذَا جَاءَكَ الْمُنَافِقُونَ‏}‏ قَالَ ثُمَّ دَعَاهُمُ النَّبِيُّ صلى الله عليه وسلم لِيَسْتَغْفِرَ لَهُمْ - قَالَ - فَلَوَّوْا رُءُوسَهُمْ ‏.‏ وَقَوْلُهُ ‏{‏ كَأَنَّهُمْ خُشُبٌ مُسَنَّدَةٌ‏}‏ وَقَالَ كَانُوا رِجَالاً أَجْمَلَ شَىْءٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 7025,
			"arabicnumber": "2773.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ ابْنُ عَبْدَةَ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، أَنَّهُ سَمِعَ جَابِرًا، يَقُولُ أَتَى النَّبِيُّ صلى الله عليه وسلم قَبْرَ عَبْدِ اللَّهِ بْنِ أُبَىٍّ فَأَخْرَجَهُ مِنْ قَبْرِهِ فَوَضَعَهُ عَلَى رُكْبَتَيْهِ وَنَفَثَ عَلَيْهِ مِنْ رِيقِهِ وَأَلْبَسَهُ قَمِيصَهُ فَاللَّهُ أَعْلَمُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 7026,
			"arabicnumber": "2773.02",
			"text": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ جَاءَ النَّبِيُّ صلى الله عليه وسلم إِلَى عَبْدِ اللَّهِ بْنِ أُبَىٍّ بَعْدَ مَا أُدْخِلَ حُفْرَتَهُ ‏.‏ فَذَكَرَ بِمِثْلِ حَدِيثِ سُفْيَانَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 7027,
			"arabicnumber": "2774.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لَمَّا تُوُفِّيَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ جَاءَ ابْنُهُ عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلَهُ أَنْ يُعْطِيَهُ قَمِيصَهُ يُكَفِّنُ فِيهِ أَبَاهُ فَأَعْطَاهُ ثُمَّ سَأَلَهُ أَنْ يُصَلِّيَ عَلَيْهِ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِيُصَلِّيَ عَلَيْهِ فَقَامَ عُمَرُ فَأَخَذَ بِثَوْبِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَتُصَلِّي عَلَيْهِ وَقَدْ نَهَاكَ اللَّهُ أَنْ تُصَلِّيَ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ إِنَّمَا خَيَّرَنِي اللَّهُ فَقَالَ اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً وَسَأَزِيدُهُ عَلَى سَبْعِينَ ‏\"‏ ‏.‏ قَالَ إِنَّهُ مُنَافِقٌ ‏.‏ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلاَ تُصَلِّ عَلَى أَحَدٍ مِنْهُمْ مَاتَ أَبَدًا وَلاَ تَقُمْ عَلَى قَبْرِهِ‏}‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 7028,
			"arabicnumber": "2774.02",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ نَحْوَهُ وَزَادَ قَالَ فَتَرَكَ الصَّلاَةَ عَلَيْهِمْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 7029,
			"arabicnumber": "2775.01",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي، مَعْمَرٍ عَنِ ابْنِ مَسْعُودٍ، قَالَ اجْتَمَعَ عِنْدَ الْبَيْتِ ثَلاَثَةُ نَفَرٍ قُرَشِيَّانِ وَثَقَفِيٌّ أَوْ ثَقَفِيَّانِ وَقُرَشِيٌّ قَلِيلٌ فِقْهُ قُلُوبِهِمْ كَثِيرٌ شَحْمُ بُطُونِهِمْ فَقَالَ أَحَدُهُمْ أَتَرَوْنَ اللَّهَ يَسْمَعُ مَا نَقُولُ وَقَالَ الآخَرُ يَسْمَعُ إِنْ جَهَرْنَا وَلاَ يَسْمَعُ إِنْ أَخْفَيْنَا وَقَالَ الآخَرُ إِنْ كَانَ يَسْمَعُ إِذَا جَهَرْنَا فَهُوَ يَسْمَعُ إِذَا أَخْفَيْنَا ‏.‏ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَمَا كُنْتُمْ تَسْتَتِرُونَ أَنْ يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلاَ أَبْصَارُكُمْ وَلاَ جُلُودُكُمْ‏}‏ الآيَةَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7030,
			"arabicnumber": "2775.02",
			"text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي سُلَيْمَانُ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ وَهْبِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ اللَّهِ، ح وَقَالَ حَدَّثَنَا يَحْيَى، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي مَنْصُورٌ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ، بِنَحْوِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 7031,
			"arabicnumber": "2776.01",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، - وَهُوَ ابْنُ ثَابِتٍ - قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ، يُحَدِّثُ عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ إِلَى أُحُدٍ فَرَجَعَ نَاسٌ مِمَّنْ كَانَ مَعَهُ فَكَانَ أَصْحَابُ النَّبِيِّ صلى الله عليه وسلم فِيهِمْ فِرْقَتَيْنِ قَالَ بَعْضُهُمْ نَقْتُلُهُمْ ‏.‏ وَقَالَ بَعْضُهُمْ لاَ ‏.‏ فَنَزَلَتْ ‏{‏ فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ‏}‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 7032,
			"arabicnumber": "2776.02",
			"text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 7033,
			"arabicnumber": "2777",
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَمُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، قَالاَ حَدَّثَنَا ابْنُ أَبِي، مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ، الْخُدْرِيِّ أَنَّ رِجَالاً، مِنَ الْمُنَافِقِينَ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم كَانُوا إِذَا خَرَجَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْغَزْوِ تَخَلَّفُوا عَنْهُ وَفَرِحُوا بِمَقْعَدِهِمْ خِلاَفَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا قَدِمَ النَّبِيُّ صلى الله عليه وسلم اعْتَذَرُوا إِلَيْهِ وَحَلَفُوا وَأَحَبُّوا أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَنَزَلَتْ ‏{‏ لاَ تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا فَلاَ تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِنَ الْعَذَابِ‏}‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 7034,
			"arabicnumber": "2778",
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا حَجَّاجُ، بْنُ مُحَمَّدٍ عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَخْبَرَهُ أَنَّ مَرْوَانَ قَالَ اذْهَبْ يَا رَافِعُ - لِبَوَّابِهِ - إِلَى ابْنِ عَبَّاسٍ فَقُلْ لَئِنْ كَانَ كُلُّ امْرِئٍ مِنَّا فَرِحَ بِمَا أَتَى وَأَحَبَّ أَنْ يُحْمَدَ بِمَا لَمْ يَفْعَلْ مُعَذَّبًا لَنُعَذَّبَنَّ أَجْمَعُونَ ‏.‏ فَقَالَ ابْنُ عَبَّاسٍ مَا لَكُمْ وَلِهَذِهِ الآيَةِ إِنَّمَا أُنْزِلَتْ هَذِهِ الآيَةُ فِي أَهْلِ الْكِتَابِ ‏.‏ ثُمَّ تَلاَ ابْنُ عَبَّاسٍ ‏{‏ وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلاَ تَكْتُمُونَهُ‏}‏ هَذِهِ الآيَةَ وَتَلاَ ابْنُ عَبَّاسٍ ‏{‏ لاَ تَحْسَبَنَّ الَّذِينَ يَفْرَحُونَ بِمَا أَتَوْا وَيُحِبُّونَ أَنْ يُحْمَدُوا بِمَا لَمْ يَفْعَلُوا‏}‏ وَقَالَ ابْنُ عَبَّاسٍ سَأَلَهُمُ النَّبِيُّ صلى الله عليه وسلم عَنْ شَىْءٍ فَكَتَمُوهُ إِيَّاهُ وَأَخْبَرُوهُ بِغَيْرِهِ فَخَرَجُوا قَدْ أَرَوْهُ أَنْ قَدْ أَخْبَرُوهُ بِمَا سَأَلَهُمْ عَنْهُ وَاسْتَحْمَدُوا بِذَلِكَ إِلَيْهِ وَفَرِحُوا بِمَا أَتَوْا مِنْ كِتْمَانِهِمْ إِيَّاهُ مَا سَأَلَهُمْ عَنْهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 7035,
			"arabicnumber": "2779.01",
			"text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ قَيْسٍ، قَالَ قُلْتُ لِعَمَّارٍ أَرَأَيْتُمْ صَنِيعَكُمْ هَذَا الَّذِي صَنَعْتُمْ فِي أَمْرِ عَلِيٍّ أَرَأْيًا رَأَيْتُمُوهُ أَوْ شَيْئًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ كَافَّةً وَلَكِنْ حُذَيْفَةُ أَخْبَرَنِي عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ فِي أَصْحَابِي اثْنَا عَشَرَ مُنَافِقًا فِيهِمْ ثَمَانِيَةٌ لاَ يَدْخُلُونَ الْجَنَّةَ حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ مِنْهُمْ تَكْفِيكَهُمُ الدُّبَيْلَةُ وَأَرْبَعَةٌ ‏\"‏ ‏.‏ لَمْ أَحْفَظْ مَا قَالَ شُعْبَةُ فِيهِمْ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 7036,
			"arabicnumber": "2779.02",
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ قَيْسِ بْنِ عُبَادٍ، قَالَ قُلْنَا لِعَمَّارٍ أَرَأَيْتَ قِتَالَكُمْ أَرَأْيًا رَأَيْتُمُوهُ فَإِنَّ الرَّأْىَ يُخْطِئُ وَيُصِيبُ أَوْ عَهْدًا عَهِدَهُ إِلَيْكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ مَا عَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ كَافَّةً ‏.‏ وَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ إِنَّ فِي أُمَّتِي ‏\"‏ ‏.‏ قَالَ شُعْبَةُ وَأَحْسِبُهُ قَالَ حَدَّثَنِي حُذَيْفَةُ ‏.‏ وَقَالَ غُنْدَرٌ أُرَاهُ قَالَ ‏\"‏ فِي أُمَّتِي اثْنَا عَشَرَ مُنَافِقًا لاَ يَدْخُلُونَ الْجَنَّةَ وَلاَ يَجِدُونَ رِيحَهَا حَتَّى يَلِجَ الْجَمَلُ فِي سَمِّ الْخِيَاطِ ثَمَانِيَةٌ مِنْهُمْ تَكْفِيكَهُمُ الدُّبَيْلَةُ سِرَاجٌ مِنَ النَّارِ يَظْهَرُ فِي أَكْتَافِهِمْ حَتَّى يَنْجُمَ مِنْ صُدُورِهِمْ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 7037,
			"arabicnumber": "2779.03",
			"text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَبُو أَحْمَدَ الْكُوفِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ جُمَيْعٍ، حَدَّثَنَا أَبُو الطُّفَيْلِ، قَالَ كَانَ بَيْنَ رَجُلٍ مِنْ أَهْلِ الْعَقَبَةِ وَبَيْنَ حُذَيْفَةَ بَعْضُ مَا يَكُونُ بَيْنَ النَّاسِ فَقَالَ أَنْشُدُكَ بِاللَّهِ كَمْ كَانَ أَصْحَابُ الْعَقَبَةِ قَالَ فَقَالَ لَهُ الْقَوْمُ أَخْبِرْهُ إِذْ سَأَلَكَ قَالَ كُنَّا نُخْبَرُ أَنَّهُمْ أَرْبَعَةَ عَشَرَ فَإِنْ كُنْتَ مِنْهُمْ فَقَدْ كَانَ الْقَوْمُ خَمْسَةَ عَشَرَ وَأَشْهَدُ بِاللَّهِ أَنَّ اثْنَىْ عَشَرَ مِنْهُمْ حَرْبٌ لِلَّهِ وَلِرَسُولِهِ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ يَقُومُ الأَشْهَادُ وَعَذَرَ ثَلاَثَةً قَالُوا مَا سَمِعْنَا مُنَادِيَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ عَلِمْنَا بِمَا أَرَادَ الْقَوْمُ ‏.‏ وَقَدْ كَانَ فِي حَرَّةٍ فَمَشَى فَقَالَ ‏ \"‏ إِنَّ الْمَاءَ قَلِيلٌ فَلاَ يَسْبِقُنِي إِلَيْهِ أَحَدٌ ‏\"‏ ‏.‏ فَوَجَدَ قَوْمًا قَدْ سَبَقُوهُ فَلَعَنَهُمْ يَوْمَئِذٍ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 7038,
			"arabicnumber": "2780.01",
			"text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ يَصْعَدُ الثَّنِيَّةَ ثَنِيَّةَ الْمُرَارِ فَإِنَّهُ يُحَطُّ عَنْهُ مَا حُطَّ عَنْ بَنِي إِسْرَائِيلَ ‏\"‏ ‏.‏ قَالَ فَكَانَ أَوَّلَ مَنْ صَعِدَهَا خَيْلُنَا خَيْلُ بَنِي الْخَزْرَجِ ثُمَّ تَتَامَّ النَّاسُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَكُلُّكُمْ مَغْفُورٌ لَهُ إِلاَّ صَاحِبَ الْجَمَلِ الأَحْمَرِ ‏\"‏ ‏.‏ فَأَتَيْنَاهُ فَقُلْنَا لَهُ تَعَالَ يَسْتَغْفِرْ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ وَاللَّهِ لأَنْ أَجِدَ ضَالَّتِي أَحَبُّ إِلَىَّ مِنْ أَنْ يَسْتَغْفِرَ لِي صَاحِبُكُمْ ‏.‏ قَالَ وَكَانَ رَجُلٌ يَنْشُدُ ضَالَّةً لَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 7039,
			"arabicnumber": "2780.02",
			"text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، حَدَّثَنَا قُرَّةُ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ يَصْعَدُ ثَنِيَّةَ الْمُرَارِ أَوِ الْمَرَارِ ‏\"‏ ‏.‏ بِمِثْلِ حَدِيثِ مُعَاذٍ غَيْرَ أَنَّهُ قَالَ وَإِذَا هُوَ أَعْرَابِيٌّ جَاءَ يَنْشُدُ ضَالَّةً لَهُ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 7040,
			"arabicnumber": "2781",
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا سُلَيْمَانُ، - وَهُوَ ابْنُ الْمُغِيرَةِ - عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ مِنَّا رَجُلٌ مِنْ بَنِي النَّجَّارِ قَدْ قَرَأَ الْبَقَرَةَ وَآلَ عِمْرَانَ وَكَانَ يَكْتُبُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَانْطَلَقَ هَارِبًا حَتَّى لَحِقَ بِأَهْلِ الْكِتَابِ - قَالَ - فَرَفَعُوهُ قَالُوا هَذَا قَدْ كَانَ يَكْتُبُ لِمُحَمَّدٍ فَأُعْجِبُوا بِهِ فَمَا لَبِثَ أَنْ قَصَمَ اللَّهُ عُنُقَهُ فِيهِمْ فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتِ الأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتِ الأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا ثُمَّ عَادُوا فَحَفَرُوا لَهُ فَوَارَوْهُ فَأَصْبَحَتِ الأَرْضُ قَدْ نَبَذَتْهُ عَلَى وَجْهِهَا فَتَرَكُوهُ مَنْبُوذًا ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 7041,
			"arabicnumber": "2782",
			"text": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدِمَ مِنْ سَفَرٍ فَلَمَّا كَانَ قُرْبَ الْمَدِينَةِ هَاجَتْ رِيحٌ شَدِيدَةٌ تَكَادُ أَنْ تَدْفِنَ الرَّاكِبَ فَزَعَمَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ بُعِثَتْ هَذِهِ الرِّيحُ لِمَوْتِ مُنَافِقٍ ‏\"‏ ‏.‏ فَلَمَّا قَدِمَ الْمَدِينَةَ فَإِذَا مُنَافِقٌ عَظِيمٌ مِنَ الْمُنَافِقِينَ قَدْ مَاتَ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 7042,
			"arabicnumber": "2783",
			"text": "حَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا أَبُو مُحَمَّدٍ النَّضْرُ بْنُ مُحَمَّدِ بْنِ، مُوسَى الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ، حَدَّثَنَا إِيَاسٌ، حَدَّثَنِي أَبِي قَالَ، عُدْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلاً مَوْعُوكًا - قَالَ - فَوَضَعْتُ يَدِي عَلَيْهِ فَقُلْتُ وَاللَّهِ مَا رَأَيْتُ كَالْيَوْمِ رَجُلاً أَشَدَّ حَرًّا ‏.‏ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ‏ \"‏ أَلاَ أُخْبِرُكُمْ بِأَشَدَّ حَرًّا مِنْهُ يَوْمَ الْقِيَامَةِ هَذَيْنِكَ الرَّجُلَيْنِ الرَّاكِبَيْنِ الْمُقَفِّيَيْنِ ‏\"‏ ‏.‏ لِرَجُلَيْنِ حِينَئِذٍ مِنْ أَصْحَابِهِ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 7043,
			"arabicnumber": "2784.01",
			"text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالاَ حَدَّثَنَا عُبَيْدُ اللَّهِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي الثَّقَفِيَّ - حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ الْمُنَافِقِ كَمَثَلِ الشَّاةِ الْعَائِرَةِ بَيْنَ الْغَنَمَيْنِ تَعِيرُ إِلَى هَذِهِ مَرَّةً وَإِلَى هَذِهِ مَرَّةً ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 7044,
			"arabicnumber": "2784.02",
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ ‏ \"‏ تَكِرُّ فِي هَذِهِ مَرَّةً وَفِي هَذِهِ مَرَّةً ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 51,
				"hadith": 21
			}
		}
	]
}