{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُفْيَانَ الأُبُلِّيُّ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ أَبُو حَبِيبٍ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا عَمْرُو بْنُ مَالِكٍ، عَنْ أَبِي الْجَوْزَاءِ، قَالَ حَدَّثَنِي رَجُلٌ، كَانَتْ لَهُ صُحْبَةٌ يُرَوْنَ أَنَّهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ائْتِنِي غَدًا أَحْبُوكَ وَأُثِيبُكَ وَأُعْطِيكَ ‏\"‏ ‏.‏ حَتَّى ظَنَنْتُ أَنَّهُ يُعْطِينِي عَطِيَّةً قَالَ ‏\"‏ إِذَا زَالَ النَّهَارُ فَقُمْ فَصَلِّ أَرْبَعَ رَكَعَاتٍ ‏\"‏ ‏.‏ فَذَكَرَ نَحْوَهُ قَالَ ‏\"‏ تَرْفَعُ رَأْسَكَ - يَعْنِي مِنَ السَّجْدَةِ الثَّانِيَةِ - فَاسْتَوِ جَالِسًا وَلاَ تَقُمْ حَتَّى تُسَبِّحَ عَشْرًا وَتَحْمَدَ عَشْرًا وَتُكَبِّرَ عَشْرًا وَتُهَلِّلَ عَشْرًا ثُمَّ تَصْنَعُ ذَلِكَ فِي الأَرْبَعِ رَكَعَاتٍ ‏\"‏ ‏.‏ قَالَ ‏\"‏ فَإِنَّكَ لَوْ كُنْتَ أَعْظَمَ أَهْلِ الأَرْضِ ذَنْبًا غُفِرَ لَكَ بِذَلِكَ ‏\"‏ ‏.‏ قُلْتُ فَإِنْ لَمْ أَسْتَطِعْ أَنْ أُصَلِّيَهَا تِلْكَ السَّاعَةَ قَالَ ‏\"‏ صَلِّهَا مِنَ اللَّيْلِ وَالنَّهَارِ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ حَبَّانُ بْنُ هِلاَلٍ خَالُ هِلاَلٍ الرَّائِيِّ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ الْمُسْتَمِرُّ بْنُ الرَّيَّانِ عَنْ أَبِي الْجَوْزَاءِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو مَوْقُوفًا وَرَوَاهُ رَوْحُ بْنُ الْمُسَيَّبِ وَجَعْفَرُ بْنُ سُلَيْمَانَ عَنْ عَمْرِو بْنِ مَالِكٍ النُّكْرِيِّ عَنْ أَبِي الْجَوْزَاءِ عَنِ ابْنِ عَبَّاسٍ قَوْلُهُ وَقَالَ فِي حَدِيثِ رَوْحٍ فَقَالَ حَدِيثُ النَّبِيِّ صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 49
			}
		}
	]
}