{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 142,
			"arabicnumber": 142,
			"text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، - فِي آخَرِينَ - قَالُوا حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنْ إِسْمَاعِيلَ بْنِ كَثِيرٍ، عَنْ عَاصِمِ بْنِ لَقِيطِ بْنِ صَبْرَةَ، عَنْ أَبِيهِ، لَقِيطِ بْنِ صَبْرَةَ قَالَ كُنْتُ وَافِدَ بَنِي الْمُنْتَفِقِ - أَوْ فِي وَفْدِ بَنِي الْمُنْتَفِقِ - إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَلَمَّا قَدِمْنَا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمْ نُصَادِفْهُ فِي مَنْزِلِهِ وَصَادَفْنَا عَائِشَةَ أُمَّ الْمُؤْمِنِينَ قَالَ فَأَمَرَتْ لَنَا بِخَزِيرَةٍ فَصُنِعَتْ لَنَا قَالَ وَأُتِينَا بِقِنَاعٍ - وَلَمْ يَقُلْ قُتَيْبَةُ الْقِنَاعَ وَالْقِنَاعُ الطَّبَقُ فِيهِ تَمْرٌ - ثُمَّ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ هَلْ أَصَبْتُمْ شَيْئًا أَوْ أُمِرَ لَكُمْ بِشَىْءٍ ‏\"‏ ‏.‏ قَالَ قُلْنَا نَعَمْ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ فَبَيْنَا نَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم جُلُوسٌ إِذْ دَفَعَ الرَّاعِي غَنَمَهُ إِلَى الْمُرَاحِ وَمَعَهُ سَخْلَةٌ تَيْعَرُ فَقَالَ ‏\"‏ مَا وَلَّدْتَ يَا فُلاَنُ ‏\"‏ ‏.‏ قَالَ بَهْمَةً ‏.‏ قَالَ فَاذْبَحْ لَنَا مَكَانَهَا شَاةً ‏.‏ ثُمَّ قَالَ لاَ تَحْسِبَنَّ - وَلَمْ يَقُلْ لاَ تَحْسَبَنَّ - أَنَّا مِنْ أَجْلِكَ ذَبَحْنَاهَا لَنَا غَنَمٌ مِائَةٌ لاَ نُرِيدُ أَنْ تَزِيدَ فَإِذَا وَلَّدَ الرَّاعِي بَهْمَةً ذَبَحْنَا مَكَانَهَا شَاةً ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي امْرَأَةً وَإِنَّ فِي لِسَانِهَا شَيْئًا يَعْنِي الْبَذَاءَ ‏.‏ قَالَ ‏\"‏ فَطَلِّقْهَا إِذًا ‏\"‏ ‏.‏ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لَهَا صُحْبَةً وَلِي مِنْهَا وَلَدٌ ‏.‏ قَالَ ‏\"‏ فَمُرْهَا - يَقُولُ عِظْهَا - فَإِنْ يَكُ فِيهَا خَيْرٌ فَسَتَفْعَلُ وَلاَ تَضْرِبْ ظَعِينَتَكَ كَضَرْبِكَ أُمَيَّتَكَ ‏\"‏ ‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي عَنِ الْوُضُوءِ ‏.‏ قَالَ ‏\"‏ أَسْبِغِ الْوُضُوءَ وَخَلِّلْ بَيْنَ الأَصَابِعِ وَبَالِغْ فِي الاِسْتِنْشَاقِ إِلاَّ أَنْ تَكُونَ صَائِمًا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 142
			}
		}
	]
}