{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"8": "Prayer (Kitab Al-Salat): Detailed Injunctions about Witr"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامِ بْنِ عَمْرٍو الْفَزَارِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي آخِرِ وِتْرِهِ ‏ \"‏ اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لاَ أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ ‏\"‏ ‏.‏ قَالَ أَبُو دَاوُدَ هِشَامٌ أَقْدَمُ شَيْخٍ لِحَمَّادٍ وَبَلَغَنِي عَنْ يَحْيَى بْنِ مَعِينٍ أَنَّهُ قَالَ لَمْ يَرْوِ عَنْهُ غَيْرُ حَمَّادِ بْنِ سَلَمَةَ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى عِيسَى بْنُ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَىِّ بْنِ كَعْبٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَنَتَ - يَعْنِي فِي الْوِتْرِ - قَبْلَ الرُّكُوعِ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَى عِيسَى بْنُ يُونُسَ هَذَا الْحَدِيثَ أَيْضًا عَنْ فِطْرِ بْنِ خَلِيفَةَ عَنْ زُبَيْدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَىٍّ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ وَرُوِيَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ مِسْعَرٍ عَنْ زُبَيْدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَىِّ بْنِ كَعْبٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَنَتَ فِي الْوِتْرِ قَبْلَ الرُّكُوعِ ‏.‏ قَالَ أَبُو دَاوُدَ حَدِيثُ سَعِيدٍ عَنْ قَتَادَةَ رَوَاهُ يَزِيدُ بْنُ زُرَيْعٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنِ النَّبِيِّ صلى الله عليه وسلم لَمْ يَذْكُرِ الْقُنُوتَ وَلاَ ذَكَرَ أُبَيًّا وَكَذَلِكَ رَوَاهُ عَبْدُ الأَعْلَى وَمُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ وَسَمَاعُهُ بِالْكُوفَةِ مَعَ عِيسَى بْنِ يُونُسَ وَلَمْ يَذْكُرُوا الْقُنُوتَ وَقَدْ رَوَاهُ أَيْضًا هِشَامٌ الدَّسْتَوَائِيُّ وَشُعْبَةُ عَنْ قَتَادَةَ وَلَمْ يَذْكُرَا الْقُنُوتَ وَحَدِيثُ زُبَيْدٍ رَوَاهُ سُلَيْمَانُ الأَعْمَشُ وَشُعْبَةُ وَعَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ وَجَرِيرُ بْنُ حَازِمٍ كُلُّهُمْ عَنْ زُبَيْدٍ لَمْ يَذْكُرْ أَحَدٌ مِنْهُمُ الْقُنُوتَ إِلاَّ مَا رُوِيَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ مِسْعَرٍ عَنْ زُبَيْدٍ فَإِنَّهُ قَالَ فِي حَدِيثِهِ إِنَّهُ قَنَتَ قَبْلَ الرُّكُوعِ ‏.‏ قَالَ أَبُو دَاوُدَ وَلَيْسَ هُوَ بِالْمَشْهُورِ مِنْ حَدِيثِ حَفْصٍ نَخَافُ أَنْ يَكُونَ عَنْ حَفْصٍ عَنْ غَيْرِ مِسْعَرٍ ‏.‏ قَالَ أَبُو دَاوُدَ وَيُرْوَى أَنَّ أُبَيًّا كَانَ يَقْنُتُ فِي النِّصْفِ مِنْ شَهْرِ رَمَضَانَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 12
			}
		}
	]
}