{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ إِبْرَاهِيمَ - حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي خُصَيْفُ بْنُ عَبْدِ الرَّحْمَنِ الْجَزَرِيُّ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ يَا أَبَا الْعَبَّاسِ عَجِبْتُ لاِخْتِلاَفِ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي إِهْلاَلِ رَسُولِ اللَّهِ صلى الله عليه وسلم حِينَ أَوْجَبَ ‏.‏ فَقَالَ إِنِّي لأَعْلَمُ النَّاسِ بِذَلِكَ إِنَّهَا إِنَّمَا كَانَتْ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم حَجَّةٌ وَاحِدَةٌ فَمِنْ هُنَاكَ اخْتَلَفُوا خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَاجًّا فَلَمَّا صَلَّى فِي مَسْجِدِهِ بِذِي الْحُلَيْفَةِ رَكْعَتَيْهِ أَوْجَبَ فِي مَجْلِسِهِ فَأَهَلَّ بِالْحَجِّ حِينَ فَرَغَ مِنْ رَكْعَتَيْهِ فَسَمِعَ ذَلِكَ مِنْهُ أَقْوَامٌ فَحَفِظْتُهُ عَنْهُ ثُمَّ رَكِبَ فَلَمَّا اسْتَقَلَّتْ بِهِ نَاقَتُهُ أَهَلَّ وَأَدْرَكَ ذَلِكَ مِنْهُ أَقْوَامٌ وَذَلِكَ أَنَّ النَّاسَ إِنَّمَا كَانُوا يَأْتُونَ أَرْسَالاً فَسَمِعُوهُ حِينَ اسْتَقَلَّتْ بِهِ نَاقَتُهُ يُهِلُّ فَقَالُوا إِنَّمَا أَهَلَّ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ اسْتَقَلَّتْ بِهِ نَاقَتُهُ ثُمَّ مَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمَّا عَلاَ عَلَى شَرَفِ الْبَيْدَاءِ أَهَلَّ وَأَدْرَكَ ذَلِكَ مِنْهُ أَقْوَامٌ فَقَالُوا إِنَّمَا أَهَلَّ حِينَ عَلاَ عَلَى شَرَفِ الْبَيْدَاءِ وَايْمُ اللَّهِ لَقَدْ أَوْجَبَ فِي مُصَلاَّهُ وَأَهَلَّ حِينَ اسْتَقَلَّتْ بِهِ نَاقَتُهُ وَأَهَلَّ حِينَ عَلاَ عَلَى شَرَفِ الْبَيْدَاءِ ‏.‏ قَالَ سَعِيدٌ فَمَنْ أَخَذَ بِقَوْلِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَهَلَّ فِي مُصَلاَّهُ إِذَا فَرَغَ مِنْ رَكْعَتَيْهِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		}
	]
}