{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، - الْمَعْنَى - قَالاَ حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، - قَالَ ابْنُ الْعَلاَءِ ابْنِ عَلْقَمَةَ بْنِ عَيَّاشٍ - عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ سَلَمَةَ بْنِ صَخْرٍ، - قَالَ ابْنُ الْعَلاَءِ الْبَيَاضِيِّ - قَالَ كُنْتُ امْرَأً أُصِيبُ مِنَ النِّسَاءِ مَا لاَ يُصِيبُ غَيْرِي فَلَمَّا دَخَلَ شَهْرُ رَمَضَانَ خِفْتُ أَنْ أُصِيبَ مِنَ امْرَأَتِي شَيْئًا يُتَابَعُ بِي حَتَّى أُصْبِحَ فَظَاهَرْتُ مِنْهَا حَتَّى يَنْسَلِخَ شَهْرُ رَمَضَانَ فَبَيْنَمَا هِيَ تَخْدُمُنِي ذَاتَ لَيْلَةٍ إِذْ تَكَشَّفَ لِي مِنْهَا شَىْءٌ فَلَمْ أَلْبَثْ أَنْ نَزَوْتُ عَلَيْهَا فَلَمَّا أَصْبَحْتُ خَرَجْتُ إِلَى قَوْمِي فَأَخْبَرْتُهُمُ الْخَبَرَ وَقُلْتُ امْشُوا مَعِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ قَالُوا لاَ وَاللَّهِ ‏.‏ فَانْطَلَقْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَأَخْبَرْتُهُ فَقَالَ ‏\"‏ أَنْتَ بِذَاكَ يَا سَلَمَةُ ‏\"‏ ‏.‏ قُلْتُ أَنَا بِذَاكَ يَا رَسُولَ اللَّهِ مَرَّتَيْنِ وَأَنَا صَابِرٌ لأَمْرِ اللَّهِ فَاحْكُمْ فِيَّ مَا أَرَاكَ اللَّهُ قَالَ ‏\"‏ حَرِّرْ رَقَبَةً ‏\"‏ ‏.‏ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَمْلِكُ رَقَبَةً غَيْرَهَا وَضَرَبْتُ صَفْحَةَ رَقَبَتِي قَالَ ‏\"‏ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ ‏\"‏ ‏.‏ قَالَ وَهَلْ أُصِبْتُ الَّذِي أُصِبْتُ إِلاَّ مِنَ الصِّيَامِ قَالَ ‏\"‏ فَأَطْعِمْ وَسْقًا مِنْ تَمْرٍ بَيْنَ سِتِّينَ مِسْكِينًا ‏\"‏ ‏.‏ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ بِتْنَا وَحْشَيْنِ مَا لَنَا طَعَامٌ قَالَ ‏\"‏ فَانْطَلِقْ إِلَى صَاحِبِ صَدَقَةِ بَنِي زُرَيْقٍ فَلْيَدْفَعْهَا إِلَيْكَ فَأَطْعِمْ سِتِّينَ مِسْكِينًا وَسْقًا مِنْ تَمْرٍ وَكُلْ أَنْتَ وَعِيَالُكَ بَقِيَّتَهَا ‏\"‏ ‏.‏ فَرَجَعْتُ إِلَى قَوْمِي فَقُلْتُ وَجَدْتُ عِنْدَكُمُ الضِّيقَ وَسُوءَ الرَّأْىِ وَوَجَدْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم السَّعَةَ وَحُسْنَ الرَّأْىِ وَقَدْ أَمَرَنِي - أَوْ أَمَرَ لِي - بِصَدَقَتِكُمْ زَادَ ابْنُ الْعَلاَءِ قَالَ ابْنُ إِدْرِيسَ بَيَاضَةُ بَطْنٌ مِنْ بَنِي زُرَيْقٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		}
	]
}