{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2612,
			"arabicnumber": 2612,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الأَنْبَارِيُّ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا بَعَثَ أَمِيرًا عَلَى سَرِيَّةٍ أَوْ جَيْشٍ أَوْصَاهُ بِتَقْوَى اللَّهِ فِي خَاصَّةِ نَفْسِهِ وَبِمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ خَيْرًا وَقَالَ ‏ \"‏ إِذَا لَقِيتَ عَدُوَّكَ مِنَ الْمُشْرِكِينَ فَادْعُهُمْ إِلَى إِحْدَى ثَلاَثِ خِصَالٍ أَوْ خِلاَلٍ فَأَيَّتُهَا أَجَابُوكَ إِلَيْهَا فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمُ ادْعُهُمْ إِلَى الإِسْلاَمِ فَإِنْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى التَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ الْمُهَاجِرِينَ وَأَعْلِمْهُمْ أَنَّهُمْ إِنْ فَعَلُوا ذَلِكَ أَنَّ لَهُمْ مَا لِلْمُهَاجِرِينَ وَأَنَّ عَلَيْهِمْ مَا عَلَى الْمُهَاجِرِينَ فَإِنْ أَبَوْا وَاخْتَارُوا دَارَهُمْ فَأَعْلِمْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ الْمُسْلِمِينَ يُجْرَى عَلَيْهِمْ حُكْمُ اللَّهِ الَّذِي يَجْرِي عَلَى الْمُؤْمِنِينَ وَلاَ يَكُونُ لَهُمْ فِي الْفَىْءِ وَالْغَنِيمَةِ نَصِيبٌ إِلاَّ أَنْ يُجَاهِدُوا مَعَ الْمُسْلِمِينَ فَإِنْ هُمْ أَبَوْا فَادْعُهُمْ إِلَى إِعْطَاءِ الْجِزْيَةِ فَإِنْ أَجَابُوا فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ فَإِنْ أَبَوْا فَاسْتَعِنْ بِاللَّهِ تَعَالَى وَقَاتِلْهُمْ وَإِذَا حَاصَرْتَ أَهْلَ حِصْنٍ فَأَرَادُوكَ أَنْ تُنْزِلَهُمْ عَلَى حُكْمِ اللَّهِ تَعَالَى فَلاَ تُنْزِلْهُمْ فَإِنَّكُمْ لاَ تَدْرُونَ مَا يَحْكُمُ اللَّهُ فِيهِمْ وَلَكِنْ أَنْزِلُوهُمْ عَلَى حُكْمِكُمْ ثُمَّ اقْضُوا فِيهِمْ بَعْدُ مَا شِئْتُمْ ‏\"‏ ‏.‏ قَالَ سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ عَلْقَمَةُ فَذَكَرْتُ هَذَا الْحَدِيثَ لِمُقَاتِلِ بْنِ حَيَّانَ فَقَالَ حَدَّثَنِي مُسْلِمٌ - قَالَ أَبُو دَاوُدَ هُوَ ابْنُ هَيْصَمٍ - عَنِ النُّعْمَانِ بْنِ مُقَرِّنٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ حَدِيثِ سُلَيْمَانَ بْنِ بُرَيْدَةَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 136
			}
		}
	]
}