{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2650,
			"arabicnumber": 2650,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، حَدَّثَهُ حَسَنُ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، أَخْبَرَهُ عُبَيْدُ اللَّهِ بْنُ أَبِي رَافِعٍ، - وَكَانَ كَاتِبًا لِعَلِيِّ بْنِ أَبِي طَالِبٍ - قَالَ سَمِعْتُ عَلِيًّا، عَلَيْهِ السَّلاَمُ يَقُولُ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم أَنَا وَالزُّبَيْرَ وَالْمِقْدَادَ فَقَالَ ‏\"‏ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ خَاخٍ فَإِنَّ بِهَا ظَعِينَةً مَعَهَا كِتَابٌ فَخُذُوهُ مِنْهَا فَانْطَلَقْنَا تَتَعَادَى بِنَا خَيْلُنَا حَتَّى أَتَيْنَا الرَّوْضَةَ فَإِذَا نَحْنُ بِالظَّعِينَةِ فَقُلْنَا هَلُمِّي الْكِتَابَ ‏.‏ فَقَالَتْ مَا عِنْدِي مِنْ كِتَابٍ ‏.‏ فَقُلْتُ لَتُخْرِجِنَّ الْكِتَابَ أَوْ لَنُلْقِيَنَّ الثِّيَابَ ‏.‏ فَأَخْرَجَتْهُ مِنْ عِقَاصِهَا فَأَتَيْنَا بِهِ النَّبِيَّ صلى الله عليه وسلم فَإِذَا هُوَ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى نَاسٍ مِنَ الْمُشْرِكِينَ يُخْبِرُهُمْ بِبَعْضِ أَمْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَا هَذَا يَا حَاطِبُ ‏\"‏ ‏.‏ فَقَالَ يَا رَسُولَ اللَّهِ لاَ تَعْجَلْ عَلَىَّ فَإِنِّي كُنْتُ امْرَأً مُلْصَقًا فِي قُرَيْشٍ وَلَمْ أَكُنْ مِنْ أَنْفُسِهَا وَإِنَّ قُرَيْشًا لَهُمْ بِهَا قَرَابَاتٌ يَحْمُونَ بِهَا أَهْلِيهِمْ بِمَكَّةَ فَأَحْبَبْتُ إِذْ فَاتَنِي ذَلِكَ أَنْ أَتَّخِذَ فِيهِمْ يَدًا يَحْمُونَ قَرَابَتِي بِهَا وَاللَّهِ يَا رَسُولَ اللَّهِ مَا كَانَ بِي مِنْ كُفْرٍ وَلاَ ارْتِدَادٍ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ صَدَقَكُمْ ‏\"‏ ‏.‏ فَقَالَ عُمَرُ دَعْنِي أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قَدْ شَهِدَ بَدْرًا وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ عَلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 174
			}
		}
	]
}