{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2719,
			"arabicnumber": 2719,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ، قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ حَدَّثَنِي صَفْوَانُ بْنُ عَمْرٍو، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ الأَشْجَعِيِّ، قَالَ خَرَجْتُ مَعَ زَيْدِ بْنِ حَارِثَةَ فِي غَزْوَةِ مُؤْتَةَ فَرَافَقَنِي مَدَدِيٌّ مِنْ أَهْلِ الْيَمَنِ لَيْسَ مَعَهُ غَيْرُ سَيْفِهِ فَنَحَرَ رَجُلٌ مِنَ الْمُسْلِمِينَ جَزُورًا فَسَأَلَهُ الْمَدَدِيُّ طَائِفَةً مِنْ جِلْدِهِ فَأَعْطَاهُ إِيَّاهُ فَاتَّخَذَهُ كَهَيْئَةِ الدَّرَقِ وَمَضَيْنَا فَلَقِينَا جُمُوعَ الرُّومِ وَفِيهِمْ رَجُلٌ عَلَى فَرَسٍ لَهُ أَشْقَرَ عَلَيْهِ سَرْجٌ مُذْهَبٌ وَسِلاَحٌ مُذْهَبٌ فَجَعَلَ الرُّومِيُّ يُغْرِي بِالْمُسْلِمِينَ فَقَعَدَ لَهُ الْمَدَدِيُّ خَلْفَ صَخْرَةٍ فَمَرَّ بِهِ الرُّومِيُّ فَعَرْقَبَ فَرَسَهُ فَخَرَّ وَعَلاَهُ فَقَتَلَهُ وَحَازَ فَرَسَهُ وَسِلاَحَهُ فَلَمَّا فَتَحَ اللَّهُ عَزَّ وَجَلَّ لِلْمُسْلِمِينَ بَعَثَ إِلَيْهِ خَالِدُ بْنُ الْوَلِيدِ فَأَخَذَ مِنَ السَّلَبِ قَالَ عَوْفٌ فَأَتَيْتُهُ فَقُلْتُ يَا خَالِدُ أَمَا عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالسَّلَبِ لِلْقَاتِلِ قَالَ بَلَى وَلَكِنِّي اسْتَكْثَرْتُهُ ‏.‏ قُلْتُ لَتَرُدَّنَّهُ عَلَيْهِ أَوْ لأُعَرِّفَنَّكَهَا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَبَى أَنْ يَرُدَّ عَلَيْهِ قَالَ عَوْفٌ فَاجْتَمَعْنَا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَصَصْتُ عَلَيْهِ قِصَّةَ الْمَدَدِيِّ وَمَا فَعَلَ خَالِدٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا خَالِدُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ ‏\"‏ قَالَ يَا رَسُولَ اللَّهِ اسْتَكْثَرْتُهُ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ يَا خَالِدُ رُدَّ عَلَيْهِ مَا أَخَذْتَ مِنْهُ ‏\"‏ ‏.‏ قَالَ عَوْفٌ فَقُلْتُ لَهُ دُونَكَ يَا خَالِدُ أَلَمْ أَفِ لَكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَمَا ذَلِكَ ‏\"‏ فَأَخْبَرْتُهُ قَالَ فَغَضِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏\"‏ يَا خَالِدُ لاَ تَرُدَّ عَلَيْهِ هَلْ أَنْتُمْ تَارِكُونَ لِي أُمَرَائِي لَكُمْ صِفْوَةُ أَمْرِهِمْ وَعَلَيْهِمْ كَدَرُهُ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 243
			}
		}
	]
}