{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2934,
			"arabicnumber": 2934,
			"text": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا غَالِبٌ الْقَطَّانُ، عَنْ رَجُلٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّهُمْ كَانُوا عَلَى مَنْهَلٍ مِنَ الْمَنَاهِلِ فَلَمَّا بَلَغَهُمُ الإِسْلاَمُ جَعَلَ صَاحِبُ الْمَاءِ لِقَوْمِهِ مِائَةً مِنَ الإِبِلِ عَلَى أَنْ يُسْلِمُوا فَأَسْلَمُوا وَقَسَمَ الإِبِلَ بَيْنَهُمْ وَبَدَا لَهُ أَنْ يَرْتَجِعَهَا مِنْهُمْ فَأَرْسَلَ ابْنَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ لَهُ ائْتِ النَّبِيَّ صلى الله عليه وسلم فَقُلْ لَهُ إِنَّ أَبِي يُقْرِئُكَ السَّلاَمَ وَإِنَّهُ جَعَلَ لِقَوْمِهِ مِائَةً مِنَ الإِبِلِ عَلَى أَنْ يُسْلِمُوا فَأَسْلَمُوا وَقَسَمَ الإِبِلَ بَيْنَهُمْ وَبَدَا لَهُ أَنْ يَرْتَجِعَهَا مِنْهُمْ أَفَهُوَ أَحَقُّ بِهَا أَمْ هُمْ فَإِنْ قَالَ لَكَ نَعَمْ أَوْ لاَ فَقُلْ لَهُ إِنَّ أَبِي شَيْخٌ كَبِيرٌ وَهُوَ عَرِيفُ الْمَاءِ وَإِنَّهُ يَسْأَلُكَ أَنْ تَجْعَلَ لِيَ الْعِرَافَةَ بَعْدَهُ ‏.‏ فَأَتَاهُ فَقَالَ إِنَّ أَبِي يُقْرِئُكَ السَّلاَمَ ‏.‏ فَقَالَ ‏\"‏ وَعَلَيْكَ وَعَلَى أَبِيكَ السَّلاَمُ ‏\"‏ ‏.‏ فَقَالَ إِنَّ أَبِي جَعَلَ لِقَوْمِهِ مِائَةً مِنَ الإِبِلِ عَلَى أَنْ يُسْلِمُوا فَأَسْلَمُوا وَحَسُنَ إِسْلاَمُهُمْ ثُمَّ بَدَا لَهُ أَنْ يَرْتَجِعَهَا مِنْهُمْ أَفَهُوَ أَحَقُّ بِهَا أَمْ هُمْ فَقَالَ ‏\"‏ إِنْ بَدَا لَهُ أَنْ يُسْلِمَهَا لَهُمْ فَلْيُسْلِمْهَا وَإِنْ بَدَا لَهُ أَنْ يَرْتَجِعَهَا فَهُوَ أَحَقُّ بِهَا مِنْهُمْ فَإِنْ هُمْ أَسْلَمُوا فَلَهُمْ إِسْلاَمُهُمْ وَإِنْ لَمْ يُسْلِمُوا قُوتِلُوا عَلَى الإِسْلاَمِ ‏\"‏ ‏.‏ فَقَالَ إِنَّ أَبِي شَيْخٌ كَبِيرٌ وَهُوَ عَرِيفُ الْمَاءِ وَإِنَّهُ يَسْأَلُكَ أَنْ تَجْعَلَ لِيَ الْعِرَافَةَ بَعْدَهُ ‏.‏ فَقَالَ ‏\"‏ إِنَّ الْعِرَافَةَ حَقٌّ وَلاَ بُدَّ لِلنَّاسِ مِنَ الْعُرَفَاءِ وَلَكِنَّ الْعُرَفَاءَ فِي النَّارِ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 7
			}
		}
	]
}