{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2985,
			"arabicnumber": 2985,
			"text": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ، حَدَّثَنَا عَنْبَسَةُ، حَدَّثَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْحَارِثِ بْنِ نَوْفَلٍ الْهَاشِمِيُّ، أَنَّ عَبْدَ الْمُطَّلِبِ بْنَ رَبِيعَةَ بْنِ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ، أَخْبَرَهُ أَنَّ أَبَاهُ رَبِيعَةَ بْنَ الْحَارِثِ وَعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ قَالاَ لِعَبْدِ الْمُطَّلِبِ بْنِ رَبِيعَةَ وَلِلْفَضْلِ بْنِ عَبَّاسٍ ائْتِيَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُولاَ لَهُ يَا رَسُولَ اللَّهِ قَدْ بَلَغْنَا مِنَ السِّنِّ مَا تَرَى وَأَحْبَبْنَا أَنْ نَتَزَوَّجَ وَأَنْتَ يَا رَسُولَ اللَّهِ أَبَرُّ النَّاسِ وَأَوْصَلُهُمْ وَلَيْسَ عِنْدَ أَبَوَيْنَا مَا يُصْدِقَانِ عَنَّا فَاسْتَعْمِلْنَا يَا رَسُولَ اللَّهِ عَلَى الصَّدَقَاتِ فَلْنُؤَدِّ إِلَيْكَ مَا يُؤَدِّي الْعُمَّالُ وَلْنُصِبْ مَا كَانَ فِيهَا مِنْ مِرْفَقٍ ‏.‏ قَالَ فَأَتَى إِلَيْنَا عَلِيُّ بْنُ أَبِي طَالِبٍ وَنَحْنُ عَلَى تِلْكَ الْحَالِ فَقَالَ لَنَا إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ لاَ وَاللَّهِ لاَ نَسْتَعْمِلُ مِنْكُمْ أَحَدًا عَلَى الصَّدَقَةِ ‏\"‏ ‏.‏ فَقَالَ لَهُ رَبِيعَةُ هَذَا مِنْ أَمْرِكَ قَدْ نِلْتَ صِهْرَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمْ نَحْسُدْكَ عَلَيْهِ ‏.‏ فَأَلْقَى عَلِيٌّ رِدَاءَهُ ثُمَّ اضْطَجَعَ عَلَيْهِ فَقَالَ أَنَا أَبُو حَسَنٍ الْقَرْمُ وَاللَّهِ لاَ أَرِيمُ حَتَّى يَرْجِعَ إِلَيْكُمَا ابْنَاكُمَا بِجَوَابِ مَا بَعَثْتُمَا بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ عَبْدُ الْمُطَّلِبِ فَانْطَلَقْتُ أَنَا وَالْفَضْلُ إِلَى بَابِ حُجْرَةِ النَّبِيِّ صلى الله عليه وسلم حَتَّى نُوَافِقَ صَلاَةَ الظُّهْرِ قَدْ قَامَتْ فَصَلَّيْنَا مَعَ النَّاسِ ثُمَّ أَسْرَعْتُ أَنَا وَالْفَضْلُ إِلَى بَابِ حُجْرَةِ النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَوْمَئِذٍ عِنْدَ زَيْنَبَ بِنْتِ جَحْشٍ فَقُمْنَا بِالْبَابِ حَتَّى أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَخَذَ بِأُذُنِي وَأُذُنِ الْفَضْلِ ثُمَّ قَالَ أَخْرِجَا مَا تُصَرِّرَانِ ثُمَّ دَخَلَ فَأَذِنَ لِي وَلِلْفَضْلِ فَدَخَلْنَا فَتَوَاكَلْنَا الْكَلاَمَ قَلِيلاً ثُمَّ كَلَّمْتُهُ أَوْ كَلَّمَهُ الْفَضْلُ - قَدْ شَكَّ فِي ذَلِكَ عَبْدُ اللَّهِ - قَالَ كَلَّمَهُ بِالأَمْرِ الَّذِي أَمَرَنَا بِهِ أَبَوَانَا فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم سَاعَةً وَرَفَعَ بَصَرَهُ قِبَلَ سَقْفِ الْبَيْتِ حَتَّى طَالَ عَلَيْنَا أَنَّهُ لاَ يَرْجِعُ إِلَيْنَا شَيْئًا حَتَّى رَأَيْنَا زَيْنَبَ تَلْمَعُ مِنْ وَرَاءِ الْحِجَابِ بِيَدِهَا تُرِيدُ أَنْ لاَ تَعْجَلاَ وَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي أَمْرِنَا ثُمَّ خَفَّضَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَأْسَهُ فَقَالَ لَنَا ‏\"‏ إِنَّ هَذِهِ الصَّدَقَةَ إِنَّمَا هِيَ أَوْسَاخُ النَّاسِ وَإِنَّهَا لاَ تَحِلُّ لِمُحَمَّدٍ وَلاَ لآلِ مُحَمَّدٍ ادْعُوا لِي نَوْفَلَ بْنَ الْحَارِثِ ‏\"‏ ‏.‏ فَدُعِيَ لَهُ نَوْفَلُ بْنُ الْحَارِثِ فَقَالَ ‏\"‏ يَا نَوْفَلُ أَنْكِحْ عَبْدَ الْمُطَّلِبِ ‏\"‏ ‏.‏ فَأَنْكَحَنِي نَوْفَلٌ ثُمَّ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ادْعُوا لِي مَحْمِيَةَ بْنَ جَزْءٍ ‏\"‏ ‏.‏ وَهُوَ رَجُلٌ مِنْ بَنِي زُبَيْدٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَهُ عَلَى الأَخْمَاسِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِمَحْمِيَةَ ‏\"‏ أَنْكِحِ الْفَضْلَ ‏\"‏ ‏.‏ فَأَنْكَحَهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ قُمْ فَأَصْدِقْ عَنْهُمَا مِنَ الْخُمُسِ كَذَا وَكَذَا ‏\"‏ ‏.‏ لَمْ يُسَمِّهِ لِي عَبْدُ اللَّهِ بْنُ الْحَارِثِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 58
			}
		}
	]
}