{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3004,
			"arabicnumber": 3004,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَنَّ كُفَّارَ قُرَيْشٍ كَتَبُوا إِلَى ابْنِ أُبَىٍّ وَمَنْ كَانَ يَعْبُدُ مَعَهُ الأَوْثَانَ مِنَ الأَوْسِ وَالْخَزْرَجِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ بِالْمَدِينَةِ قَبْلَ وَقْعَةِ بَدْرٍ إِنَّكُمْ آوَيْتُمْ صَاحِبَنَا وَإِنَّا نُقْسِمُ بِاللَّهِ لَتُقَاتِلُنَّهُ أَوْ لَتُخْرِجُنَّهُ أَوْ لَنَسِيرَنَّ إِلَيْكُمْ بِأَجْمَعِنَا حَتَّى نَقْتُلَ مُقَاتِلَتَكُمْ وَنَسْتَبِيحَ نِسَاءَكُمْ ‏.‏ فَلَمَّا بَلَغَ ذَلِكَ عَبْدَ اللَّهِ بْنَ أُبَىٍّ وَمَنْ كَانَ مَعَهُ مِنْ عَبَدَةِ الأَوْثَانِ اجْتَمَعُوا لِقِتَالِ النَّبِيِّ صلى الله عليه وسلم فَلَمَّا بَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم لَقِيَهُمْ فَقَالَ ‏\"‏ لَقَدْ بَلَغَ وَعِيدُ قُرَيْشٍ مِنْكُمُ الْمَبَالِغَ مَا كَانَتْ تَكِيدُكُمْ بِأَكْثَرَ مِمَّا تُرِيدُونَ أَنْ تَكِيدُوا بِهِ أَنْفُسَكُمْ تُرِيدُونَ أَنْ تُقَاتِلُوا أَبْنَاءَكُمْ وَإِخْوَانَكُمْ ‏\"‏ ‏.‏ فَلَمَّا سَمِعُوا ذَلِكَ مِنَ النَّبِيِّ صلى الله عليه وسلم تَفَرَّقُوا فَبَلَغَ ذَلِكَ كُفَّارَ قُرَيْشٍ فَكَتَبَتْ كُفَّارُ قُرَيْشٍ بَعْدَ وَقْعَةِ بَدْرٍ إِلَى الْيَهُودِ إِنَّكُمْ أَهْلُ الْحَلْقَةِ وَالْحُصُونِ وَإِنَّكُمْ لَتُقَاتِلُنَّ صَاحِبَنَا أَوْ لَنَفْعَلَنَّ كَذَا وَكَذَا وَلاَ يَحُولُ بَيْنَنَا وَبَيْنَ خَدَمِ نِسَائِكُمْ شَىْءٌ - وَهِيَ الْخَلاَخِيلُ - فَلَمَّا بَلَغَ كِتَابُهُمُ النَّبِيَّ صلى الله عليه وسلم أَجْمَعَتْ بَنُو النَّضِيرِ بِالْغَدْرِ فَأَرْسَلُوا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم اخْرُجْ إِلَيْنَا فِي ثَلاَثِينَ رَجُلاً مِنْ أَصْحَابِكَ وَلْيَخْرُجْ مِنَّا ثَلاَثُونَ حَبْرًا حَتَّى نَلْتَقِيَ بِمَكَانِ الْمَنْصَفِ فَيَسْمَعُوا مِنْكَ ‏.‏ فَإِنْ صَدَّقُوكَ وَآمَنُوا بِكَ آمَنَّا بِكَ فَقَصَّ خَبَرَهُمْ فَلَمَّا كَانَ الْغَدُ غَدَا عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِالْكَتَائِبِ فَحَصَرَهُمْ فَقَالَ لَهُمْ ‏\"‏ إِنَّكُمْ وَاللَّهِ لاَ تَأْمَنُونَ عِنْدِي إِلاَّ بِعَهْدٍ تُعَاهِدُونِي عَلَيْهِ ‏\"‏ ‏.‏ فَأَبَوْا أَنْ يُعْطُوهُ عَهْدًا فَقَاتَلَهُمْ يَوْمَهُمْ ذَلِكَ ثُمَّ غَدَا الْغَدُ عَلَى بَنِي قُرَيْظَةَ بِالْكَتَائِبِ وَتَرَكَ بَنِي النَّضِيرِ وَدَعَاهُمْ إِلَى أَنْ يُعَاهِدُوهُ فَعَاهَدُوهُ فَانْصَرَفَ عَنْهُمْ وَغَدَا عَلَى بَنِي النَّضِيرِ بِالْكَتَائِبِ فَقَاتَلَهُمْ حَتَّى نَزَلُوا عَلَى الْجَلاَءِ فَجَلَتْ بَنُو النَّضِيرِ وَاحْتَمَلُوا مَا أَقَلَّتِ الإِبِلُ مِنْ أَمْتِعَتِهِمْ وَأَبْوَابِ بُيُوتِهِمْ وَخَشَبِهَا فَكَانَ نَخْلُ بَنِي النَّضِيرِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم خَاصَّةً أَعْطَاهُ اللَّهُ إِيَّاهَا وَخَصَّهُ بِهَا فَقَالَ ‏{‏ وَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلاَ رِكَابٍ ‏}‏ يَقُولُ بِغَيْرِ قِتَالٍ فَأَعْطَى النَّبِيُّ صلى الله عليه وسلم أَكْثَرَهَا لِلْمُهَاجِرِينَ وَقَسَمَهَا بَيْنَهُمْ وَقَسَمَ مِنْهَا لِرَجُلَيْنِ مِنَ الأَنْصَارِ وَكَانَا ذَوِي حَاجَةٍ لَمْ يَقْسِمْ لأَحَدٍ مِنَ الأَنْصَارِ غَيْرَهُمَا وَبَقِيَ مِنْهَا صَدَقَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّتِي فِي أَيْدِي بَنِي فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 77
			}
		}
	]
}