{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3055,
			"arabicnumber": 3055,
			"text": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ، حَدَّثَنَا مُعَاوِيَةُ، - يَعْنِي ابْنَ سَلاَّمٍ - عَنْ زَيْدٍ، أَنَّهُ سَمِعَ أَبَا سَلاَّمٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ الْهَوْزَنِيُّ، قَالَ لَقِيتُ بِلاَلاً مُؤَذِّنَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِحَلَبَ فَقُلْتُ يَا بِلاَلُ حَدِّثْنِي كَيْفَ كَانَتْ نَفَقَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ مَا كَانَ لَهُ شَىْءٌ كُنْتُ أَنَا الَّذِي أَلِي ذَلِكَ مِنْهُ مُنْذُ بَعَثَهُ اللَّهُ إِلَى أَنْ تُوُفِّيَ وَكَانَ إِذَا أَتَاهُ الإِنْسَانُ مُسْلِمًا فَرَآهُ عَارِيًا يَأْمُرُنِي فَأَنْطَلِقُ فَأَسْتَقْرِضُ فَأَشْتَرِي لَهُ الْبُرْدَةَ فَأَكْسُوهُ وَأُطْعِمُهُ حَتَّى اعْتَرَضَنِي رَجُلٌ مِنَ الْمُشْرِكِينَ فَقَالَ يَا بِلاَلُ إِنَّ عِنْدِي سَعَةً فَلاَ تَسْتَقْرِضْ مِنْ أَحَدٍ إِلاَّ مِنِّي فَفَعَلْتُ فَلَمَّا أَنْ كَانَ ذَاتَ يَوْمٍ تَوَضَّأْتُ ثُمَّ قُمْتُ لأُؤَذِّنَ بِالصَّلاَةِ فَإِذَا الْمُشْرِكُ قَدْ أَقْبَلَ فِي عِصَابَةٍ مِنَ التُّجَّارِ فَلَمَّا أَنْ رَآنِي قَالَ يَا حَبَشِيُّ ‏.‏ قُلْتُ يَا لَبَّاهُ ‏.‏ فَتَجَهَّمَنِي وَقَالَ لِي قَوْلاً غَلِيظًا وَقَالَ لِي أَتَدْرِي كَمْ بَيْنَكَ وَبَيْنَ الشَّهْرِ قَالَ قُلْتُ قَرِيبٌ ‏.‏ قَالَ إِنَّمَا بَيْنَكَ وَبَيْنَهُ أَرْبَعٌ فَآخُذُكَ بِالَّذِي عَلَيْكَ فَأَرُدُّكَ تَرْعَى الْغَنَمَ كَمَا كُنْتَ قَبْلَ ذَلِكَ فَأَخَذَ فِي نَفْسِي مَا يَأْخُذُ فِي أَنْفُسِ النَّاسِ حَتَّى إِذَا صَلَّيْتُ الْعَتَمَةَ رَجَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أَهْلِهِ فَاسْتَأْذَنْتُ عَلَيْهِ فَأَذِنَ لِي فَقُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي إِنَّ الْمُشْرِكَ الَّذِي كُنْتُ أَتَدَيَّنُ مِنْهُ قَالَ لِي كَذَا وَكَذَا وَلَيْسَ عِنْدَكَ مَا تَقْضِي عَنِّي وَلاَ عِنْدِي وَهُوَ فَاضِحِي فَأْذَنْ لِي أَنْ آبِقَ إِلَى بَعْضِ هَؤُلاَءِ الأَحْيَاءِ الَّذِينَ قَدْ أَسْلَمُوا حَتَّى يَرْزُقَ اللَّهُ رَسُولَهُ صلى الله عليه وسلم مَا يَقْضِي عَنِّي فَخَرَجْتُ حَتَّى إِذَا أَتَيْتُ مَنْزِلِي فَجَعَلْتُ سَيْفِي وَجِرَابِي وَنَعْلِي وَمِجَنِّي عِنْدَ رَأْسِي حَتَّى إِذَا انْشَقَّ عَمُودُ الصُّبْحِ الأَوَّلِ أَرَدْتُ أَنْ أَنْطَلِقَ فَإِذَا إِنْسَانٌ يَسْعَى يَدْعُو يَا بِلاَلُ أَجِبْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَانْطَلَقْتُ حَتَّى أَتَيْتُهُ فَإِذَا أَرْبَعُ رَكَائِبَ مُنَاخَاتٍ عَلَيْهِنَّ أَحْمَالُهُنَّ فَاسْتَأْذَنْتُ فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَبْشِرْ فَقَدْ جَاءَكَ اللَّهُ بِقَضَائِكَ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ أَلَمْ تَرَ الرَّكَائِبَ الْمُنَاخَاتِ الأَرْبَعَ ‏\"‏ ‏.‏ فَقُلْتُ بَلَى ‏.‏ فَقَالَ ‏\"‏ إِنَّ لَكَ رِقَابَهُنَّ وَمَا عَلَيْهِنَّ فَإِنَّ عَلَيْهِنَّ كِسْوَةً وَطَعَامًا أَهْدَاهُنَّ إِلَىَّ عَظِيمُ فَدَكَ فَاقْبِضْهُنَّ وَاقْضِ دَيْنَكَ ‏\"‏ ‏.‏ فَفَعَلْتُ فَذَكَرَ الْحَدِيثَ ثُمَّ انْطَلَقْتُ إِلَى الْمَسْجِدِ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَاعِدٌ فِي الْمَسْجِدِ فَسَلَّمْتُ عَلَيْهِ فَقَالَ ‏\"‏ مَا فَعَلَ مَا قِبَلَكَ ‏\"‏ ‏.‏ قُلْتُ قَدْ قَضَى اللَّهُ كُلَّ شَىْءٍ كَانَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمْ يَبْقَ شَىْءٌ ‏.‏ قَالَ ‏\"‏ أَفَضَلَ شَىْءٌ ‏\"‏ ‏.‏ قُلْتُ نَعَمْ قَالَ ‏\"‏ انْظُرْ أَنْ تُرِيحَنِي مِنْهُ فَإِنِّي لَسْتُ بِدَاخِلٍ عَلَى أَحَدٍ مِنْ أَهْلِي حَتَّى تُرِيحَنِي مِنْهُ ‏\"‏ ‏.‏ فَلَمَّا صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم الْعَتَمَةَ دَعَانِي فَقَالَ ‏\"‏ مَا فَعَلَ الَّذِي قِبَلَكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ هُوَ مَعِي لَمْ يَأْتِنَا أَحَدٌ ‏.‏ فَبَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْمَسْجِدِ وَقَصَّ الْحَدِيثَ حَتَّى إِذَا صَلَّى الْعَتَمَةَ - يَعْنِي مِنَ الْغَدِ - دَعَانِي قَالَ ‏\"‏ مَا فَعَلَ الَّذِي قِبَلَكَ ‏\"‏ ‏.‏ قَالَ قُلْتُ قَدْ أَرَاحَكَ اللَّهُ مِنْهُ يَا رَسُولَ اللَّهِ ‏.‏ فَكَبَّرَ وَحَمِدَ اللَّهَ شَفَقًا مِنْ أَنْ يُدْرِكَهُ الْمَوْتُ وَعِنْدَهُ ذَلِكَ ثُمَّ اتَّبَعْتُهُ حَتَّى إِذَا جَاءَ أَزْوَاجَهُ فَسَلَّمَ عَلَى امْرَأَةٍ امْرَأَةٍ حَتَّى أَتَى مَبِيتَهُ فَهَذَا الَّذِي سَأَلْتَنِي عَنْهُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 128
			}
		}
	]
}