{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 320,
			"arabicnumber": 320,
			"text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، وَمُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ، - فِي آخَرِينَ - قَالُوا حَدَّثَنَا يَعْقُوبُ، أَخْبَرَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، عَنْ عَمَّارِ بْنِ يَاسِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم عَرَّسَ بِأُولاَتِ الْجَيْشِ وَمَعَهُ عَائِشَةُ فَانْقَطَعَ عِقْدٌ لَهَا مِنْ جَزْعِ ظَفَارِ فَحَبَسَ النَّاسَ ابْتِغَاءُ عِقْدِهَا ذَلِكَ حَتَّى أَضَاءَ الْفَجْرُ وَلَيْسَ مَعَ النَّاسِ مَاءٌ فَتَغَيَّظَ عَلَيْهَا أَبُو بَكْرٍ وَقَالَ حَبَسْتِ النَّاسَ وَلَيْسَ مَعَهُمْ مَاءٌ فَأَنْزَلَ اللَّهُ تَعَالَى عَلَى رَسُولِهِ صلى الله عليه وسلم رُخْصَةَ التَّطَهُّرِ بِالصَّعِيدِ الطَّيِّبِ فَقَامَ الْمُسْلِمُونَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَضَرَبُوا بِأَيْدِيهِمْ إِلَى الأَرْضِ ثُمَّ رَفَعُوا أَيْدِيَهُمْ وَلَمْ يَقْبِضُوا مِنَ التُّرَابِ شَيْئًا فَمَسَحُوا بِهَا وُجُوهَهُمْ وَأَيْدِيَهُمْ إِلَى الْمَنَاكِبِ وَمِنْ بُطُونِ أَيْدِيهِمْ إِلَى الآبَاطِ ‏.‏ زَادَ ابْنُ يَحْيَى فِي حَدِيثِهِ قَالَ ابْنُ شِهَابٍ فِي حَدِيثِهِ وَلاَ يَعْتَبِرُ بِهَذَا النَّاسُ ‏.‏ قَالَ أَبُو دَاوُدَ وَكَذَلِكَ رَوَاهُ ابْنُ إِسْحَاقَ قَالَ فِيهِ عَنِ ابْنِ عَبَّاسٍ وَذَكَرَ ضَرْبَتَيْنِ كَمَا ذَكَرَ يُونُسُ وَرَوَاهُ مَعْمَرٌ عَنِ الزُّهْرِيِّ ضَرْبَتَيْنِ وَقَالَ مَالِكٌ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَمَّارٍ وَكَذَلِكَ قَالَ أَبُو أُوَيْسٍ عَنِ الزُّهْرِيِّ وَشَكَّ فِيهِ ابْنُ عُيَيْنَةَ قَالَ مَرَّةً عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ أَوْ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ وَمَرَّةً قَالَ عَنْ أَبِيهِ وَمَرَّةً قَالَ عَنِ ابْنِ عَبَّاسٍ اضْطَرَبَ ابْنُ عُيَيْنَةَ فِيهِ وَفِي سَمَاعِهِ مِنَ الزُّهْرِيِّ وَلَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ فِي هَذَا الْحَدِيثِ الضَّرْبَتَيْنِ إِلاَّ مَنْ سَمَّيْتُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 320
			}
		}
	]
}