{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"23": "Commercial Transactions (Kitab Al-Buyu)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3394,
			"arabicnumber": 3394,
			"text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي اللَّيْثِ، حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ ابْنَ عُمَرَ، كَانَ يُكْرِي أَرْضَهُ حَتَّى بَلَغَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ الأَنْصَارِيَّ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَنْهَى عَنْ كِرَاءِ الأَرْضِ فَلَقِيَهُ عَبْدُ اللَّهِ فَقَالَ يَا ابْنَ خَدِيجٍ مَاذَا تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي كِرَاءِ الأَرْضِ قَالَ رَافِعٌ لِعَبْدِ اللَّهِ بْنِ عُمَرَ سَمِعْتُ عَمَّىَّ وَكَانَا قَدْ شَهِدَا بَدْرًا يُحَدِّثَانِ أَهْلَ الدَّارِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ كِرَاءِ الأَرْضِ ‏.‏ قَالَ عَبْدُ اللَّهِ وَاللَّهِ لَقَدْ كُنْتُ أَعْلَمُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ الأَرْضَ تُكْرَى ‏.‏ ثُمَّ خَشِيَ عَبْدُ اللَّهِ أَنْ يَكُونَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْدَثَ فِي ذَلِكَ شَيْئًا لَمْ يَكُنْ عَلِمَهُ فَتَرَكَ كِرَاءَ الأَرْضِ ‏.‏ قَالَ أَبُو دَاوُدَ رَوَاهُ أَيُّوبُ وَعُبَيْدُ اللَّهِ وَكَثِيرُ بْنُ فَرْقَدٍ وَمَالِكٌ عَنْ نَافِعٍ عَنْ رَافِعٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَرَوَاهُ الأَوْزَاعِيُّ عَنْ حَفْصِ بْنِ عِنَانٍ عَنْ نَافِعٍ عَنْ رَافِعٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَكَذَلِكَ رَوَاهُ زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنِ الْحَكَمِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّهُ أَتَى رَافِعًا فَقَالَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ نَعَمْ ‏.‏ وَكَذَا قَالَ عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ أَبِي النَّجَاشِيِّ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ النَّبِيَّ عَلَيْهِ السَّلاَمُ ‏.‏ وَرَوَاهُ الأَوْزَاعِيُّ عَنْ أَبِي النَّجَاشِيِّ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ عَمِّهِ ظُهَيْرِ بْنِ رَافِعٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏.‏ قَالَ أَبُو دَاوُدَ أَبُو النَّجَاشِيِّ عَطَاءُ بْنُ صُهَيْبٍ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 69
			}
		}
	]
}