{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"39": "Battles (Kitab Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ حُسَيْنًا الْمُعَلِّمَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ، حَدَّثَنَا عَامِرُ بْنُ شَرَاحِيلَ الشَّعْبِيُّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ سَمِعْتُ مُنَادِيَ، رَسُولِ اللَّهِ صلى الله عليه وسلم يُنَادِي أَنَّ الصَّلاَةَ جَامِعَةٌ ‏.‏ فَخَرَجْتُ فَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم الصَّلاَةَ جَلَسَ عَلَى الْمِنْبَرِ وَهُوَ يَضْحَكُ قَالَ ‏\"‏ لِيَلْزَمْ كُلُّ إِنْسَانٍ مُصَلاَّهُ ‏\"‏ ‏.‏ ثُمَّ قَالَ ‏\"‏ هَلْ تَدْرُونَ لِمَ جَمَعْتُكُمْ ‏\"‏ ‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ ‏.‏ قَالَ ‏\"‏ إِنِّي مَا جَمَعْتُكُمْ لِرَهْبَةٍ وَلاَ رَغْبَةٍ وَلَكِنْ جَمَعْتُكُمْ أَنَّ تَمِيمًا الدَّارِيَّ كَانَ رَجُلاً نَصْرَانِيًّا فَجَاءَ فَبَايَعَ وَأَسْلَمَ وَحَدَّثَنِي حَدِيثًا وَافَقَ الَّذِي حَدَّثْتُكُمْ عَنِ الدَّجَّالِ حَدَّثَنِي أَنَّهُ رَكِبَ فِي سَفِينَةٍ بَحْرِيَّةٍ مَعَ ثَلاَثِينَ رَجُلاً مِنْ لَخْمٍ وَجُذَامٍ فَلَعِبَ بِهِمُ الْمَوْجُ شَهْرًا فِي الْبَحْرِ وَأَرْفَئُوا إِلَى جَزِيرَةٍ حِينَ مَغْرِبِ الشَّمْسِ فَجَلَسُوا فِي أَقْرَبِ السَّفِينَةِ فَدَخَلُوا الْجَزِيرَةَ فَلَقِيَتْهُمْ دَابَّةٌ أَهْلَبُ كَثِيرَةُ الشَّعْرِ قَالُوا وَيْلَكِ مَا أَنْتِ قَالَتْ أَنَا الْجَسَّاسَةُ انْطَلِقُوا إِلَى هَذَا الرَّجُلِ فِي هَذَا الدَّيْرِ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالأَشْوَاقِ ‏.‏ قَالَ لَمَّا سَمَّتْ لَنَا رَجُلاً فَرِقْنَا مِنْهَا أَنْ تَكُونَ شَيْطَانَةً فَانْطَلَقْنَا سِرَاعًا حَتَّى دَخَلْنَا الدَّيْرَ فَإِذَا فِيهِ أَعْظَمُ إِنْسَانٍ رَأَيْنَاهُ قَطُّ خَلْقًا وَأَشَدُّهُ وَثَاقًا مَجْمُوعَةٌ يَدَاهُ إِلَى عُنُقِهِ ‏\"‏ ‏.‏ فَذَكَرَ الْحَدِيثَ وَسَأَلَهُمْ عَنْ نَخْلِ بَيْسَانَ وَعَنْ عَيْنِ زُغَرَ وَعَنِ النَّبِيِّ الأُمِّيِّ قَالَ إِنِّي أَنَا الْمَسِيحُ وَإِنَّهُ يُوشِكُ أَنْ يُؤْذَنَ لِي فِي الْخُرُوجِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ وَإِنَّهُ فِي بَحْرِ الشَّامِ أَوْ بَحْرِ الْيَمَنِ لاَ بَلْ مِنْ قِبَلِ الْمَشْرِقِ مَا هُوَ ‏\"‏ ‏.‏ مَرَّتَيْنِ وَأَوْمَأَ بِيَدِهِ قِبَلَ الْمَشْرِقِ قَالَتْ حَفِظْتُ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ وَسَاقَ الْحَدِيثَ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 36
			}
		}
	]
}