{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4428,
			"arabicnumber": 4428,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الصَّامِتِ ابْنَ عَمِّ أَبِي هُرَيْرَةَ، أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ جَاءَ الأَسْلَمِيُّ إِلَى نَبِيِّ اللَّهِ صلى الله عليه وسلم فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ أَصَابَ امْرَأَةً حَرَامًا أَرْبَعَ مَرَّاتٍ كُلُّ ذَلِكَ يُعْرِضُ عَنْهُ النَّبِيُّ صلى الله عليه وسلم فَأَقْبَلَ فِي الْخَامِسَةِ فَقَالَ ‏\"‏ أَنِكْتَهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ حَتَّى غَابَ ذَلِكَ مِنْكَ فِي ذَلِكَ مِنْهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ كَمَا يَغِيبُ الْمِرْوَدُ فِي الْمُكْحُلَةِ وَالرِّشَاءُ فِي الْبِئْرِ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ قَالَ ‏\"‏ فَهَلْ تَدْرِي مَا الزِّنَا ‏\"‏ ‏.‏ قَالَ نَعَمْ أَتَيْتُ مِنْهَا حَرَامًا مَا يَأْتِي الرَّجُلُ مِنِ امْرَأَتِهِ حَلاَلاً ‏.‏ قَالَ ‏\"‏ فَمَا تُرِيدُ بِهَذَا الْقَوْلِ ‏\"‏ ‏.‏ قَالَ أُرِيدُ أَنْ تُطَهِّرَنِي ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ فَسَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلَيْنِ مِنْ أَصْحَابِهِ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ انْظُرْ إِلَى هَذَا الَّذِي سَتَرَ اللَّهُ عَلَيْهِ فَلَمْ تَدَعْهُ نَفْسُهُ حَتَّى رُجِمَ رَجْمَ الْكَلْبِ ‏.‏ فَسَكَتَ عَنْهُمَا ثُمَّ سَارَ سَاعَةً حَتَّى مَرَّ بِجِيفَةِ حِمَارٍ شَائِلٍ بِرِجْلِهِ فَقَالَ ‏\"‏ أَيْنَ فُلاَنٌ وَفُلاَنٌ ‏\"‏ ‏.‏ فَقَالاَ نَحْنُ ذَانِ يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ انْزِلاَ فَكُلاَ مِنْ جِيفَةِ هَذَا الْحِمَارِ ‏\"‏ ‏.‏ فَقَالاَ يَا نَبِيَّ اللَّهِ مَنْ يَأْكُلُ مِنْ هَذَا قَالَ ‏\"‏ فَمَا نِلْتُمَا مِنْ عِرْضِ أَخِيكُمَا آنِفًا أَشَدُّ مِنْ أَكْلٍ مِنْهُ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُ الآنَ لَفِي أَنْهَارِ الْجَنَّةِ يَنْقَمِسُ فِيهَا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 78
			}
		}
	]
}