{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4435,
			"arabicnumber": 4435,
			"text": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ دَاوُدَ بْنِ صُبَيْحٍ، قَالَ عَبْدَةُ أَخْبَرَنَا حَرَمِيُّ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُلاَثَةَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، أَنَّ خَالِدَ بْنَ اللَّجْلاَجِ، حَدَّثَهُ أَنَّ اللَّجْلاَجَ أَبَاهُ أَخْبَرَهُ أَنَّهُ، كَانَ قَاعِدًا يَعْتَمِلُ فِي السُّوقِ فَمَرَّتِ امْرَأَةٌ تَحْمِلُ صَبِيًّا فَثَارَ النَّاسُ مَعَهَا وَثُرْتُ فِيمَنْ ثَارَ فَانْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَقُولُ ‏\"‏ مَنْ أَبُو هَذَا مَعَكِ ‏\"‏ ‏.‏ فَسَكَتَتْ فَقَالَ شَابٌّ حَذْوَهَا أَنَا أَبُوهُ يَا رَسُولَ اللَّهِ ‏.‏ فَأَقْبَلَ عَلَيْهَا فَقَالَ ‏\"‏ مَنْ أَبُو هَذَا مَعَكِ ‏\"‏ ‏.‏ قَالَ الْفَتَى أَنَا أَبُوهُ يَا رَسُولَ اللَّهِ ‏.‏ فَنَظَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى بَعْضِ مَنْ حَوْلَهُ يَسْأَلُهُمْ عَنْهُ فَقَالُوا مَا عَلِمْنَا إِلاَّ خَيْرًا ‏.‏ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أَحْصَنْتَ ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏ فَأَمَرَ بِهِ فَرُجِمَ ‏.‏ قَالَ فَخَرَجْنَا بِهِ فَحَفَرْنَا لَهُ حَتَّى أَمْكَنَّا ثُمَّ رَمَيْنَاهُ بِالْحِجَارَةِ حَتَّى هَدَأَ فَجَاءَ رَجُلٌ يَسْأَلُ عَنِ الْمَرْجُومِ فَانْطَلَقْنَا بِهِ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْنَا هَذَا جَاءَ يَسْأَلُ عَنِ الْخَبِيثِ ‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ لَهُوَ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ ‏\"‏ ‏.‏ فَإِذَا هُوَ أَبُوهُ فَأَعَنَّاهُ عَلَى غُسْلِهِ وَتَكْفِينِهِ وَدَفْنِهِ وَمَا أَدْرِي قَالَ وَالصَّلاَةِ عَلَيْهِ أَمْ لاَ ‏.‏ وَهَذَا حَدِيثُ عَبْدَةَ وَهُوَ أَتَمُّ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 85
			}
		}
	]
}