{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4611,
			"arabicnumber": 4611,
			"text": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ، حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا إِدْرِيسَ الْخَوْلاَنِيَّ، عَائِذَ اللَّهِ أَخْبَرَهُ أَنَّ يَزِيدَ بْنَ عُمَيْرَةَ وَكَانَ مِنْ أَصْحَابِ مُعَاذِ بْنِ جَبَلٍ أَخْبَرَهُ قَالَ كَانَ لاَ يَجْلِسُ مَجْلِسًا لِلذِّكْرِ حِينَ يَجْلِسُ إِلاَّ قَالَ اللَّهُ حَكَمٌ قِسْطٌ هَلَكَ الْمُرْتَابُونَ فَقَالَ مُعَاذُ بْنُ جَبَلٍ يَوْمًا إِنَّ مِنْ وَرَائِكُمْ فِتَنًا يَكْثُرُ فِيهَا الْمَالُ وَيُفْتَحُ فِيهَا الْقُرْآنُ حَتَّى يَأْخُذَهُ الْمُؤْمِنُ وَالْمُنَافِقُ وَالرَّجُلُ وَالْمَرْأَةُ وَالصَّغِيرُ وَالْكَبِيرُ وَالْعَبْدُ وَالْحُرُّ فَيُوشِكُ قَائِلٌ أَنْ يَقُولَ مَا لِلنَّاسِ لاَ يَتَّبِعُونِي وَقَدْ قَرَأْتُ الْقُرْآنَ مَا هُمْ بِمُتَّبِعِيَّ حَتَّى أَبْتَدِعَ لَهُمْ غَيْرَهُ فَإِيَّاكُمْ وَمَا ابْتُدِعَ فَإِنَّ مَا ابْتُدِعَ ضَلاَلَةٌ وَأُحَذِّرُكُمْ زَيْغَةَ الْحَكِيمِ فَإِنَّ الشَّيْطَانَ قَدْ يَقُولُ كَلِمَةَ الضَّلاَلَةِ عَلَى لِسَانِ الْحَكِيمِ وَقَدْ يَقُولُ الْمُنَافِقُ كَلِمَةَ الْحَقِّ ‏.‏ قَالَ قُلْتُ لِمُعَاذٍ مَا يُدْرِينِي رَحِمَكَ اللَّهُ أَنَّ الْحَكِيمَ قَدْ يَقُولُ كَلِمَةَ الضَّلاَلَةِ وَأَنَّ الْمُنَافِقَ قَدْ يَقُولُ كَلِمَةَ الْحَقِّ قَالَ بَلَى اجْتَنِبْ مِنْ كَلاَمِ الْحَكِيمِ الْمُشْتَهِرَاتِ الَّتِي يُقَالُ لَهَا مَا هَذِهِ وَلاَ يُثْنِيَنَّكَ ذَلِكَ عَنْهُ فَإِنَّهُ لَعَلَّهُ أَنْ يُرَاجِعَ وَتَلَقَّ الْحَقَّ إِذَا سَمِعْتَهُ فَإِنَّ عَلَى الْحَقِّ نُورًا ‏.‏ قَالَ أَبُو دَاوُدَ قَالَ مَعْمَرٌ عَنِ الزُّهْرِيِّ فِي هَذَا وَلاَ يُنْئِيَنَّكَ ذَلِكَ عَنْهُ مَكَانَ يُثْنِيَنَّكَ ‏.‏ وَقَالَ صَالِحُ بْنُ كَيْسَانَ عَنِ الزُّهْرِيِّ فِي هَذَا الْمُشَبَّهَاتِ مَكَانَ الْمُشْتَهِرَاتِ وَقَالَ لاَ يُثْنِيَنَّكَ كَمَا قَالَ عُقَيْلٌ ‏.‏ وَقَالَ ابْنُ إِسْحَاقَ عَنِ الزُّهْرِيِّ قَالَ بَلَى مَا تَشَابَهَ عَلَيْكَ مِنْ قَوْلِ الْحَكِيمِ حَتَّى تَقُولَ مَا أَرَادَ بِهَذِهِ الْكَلِمَةِ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad Mauquf"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 16
			}
		}
	]
}