{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4768,
			"arabicnumber": 4768,
			"text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، قَالَ أَخْبَرَنِي زَيْدُ بْنُ وَهْبٍ الْجُهَنِيُّ، ‏:‏ أَنَّهُ كَانَ فِي الْجَيْشِ الَّذِينَ كَانُوا مَعَ عَلِيٍّ عَلَيْهِ السَّلاَمُ الَّذِينَ سَارُوا إِلَى الْخَوَارِجِ فَقَالَ عَلِيٌّ عَلَيْهِ السَّلاَمُ ‏:‏ أَيُّهَا النَّاسُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏:‏ ‏ \"‏ يَخْرُجُ قَوْمٌ مِنْ أُمَّتِي يَقْرَءُونَ الْقُرْآنَ لَيْسَتْ قِرَاءَتُكُمْ إِلَى قِرَاءَتِهِمْ شَيْئًا وَلاَ صَلاَتُكُمْ إِلَى صَلاَتِهِمْ شَيْئًا وَلاَ صِيَامُكُمْ إِلَى صِيَامِهِمْ شَيْئًا، يَقْرَءُونَ الْقُرْآنَ يَحْسَبُونَ أَنَّهُ لَهُمْ وَهُوَ عَلَيْهِمْ، لاَ تُجَاوِزُ صَلاَتُهُمْ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ، لَوْ يَعْلَمُ الْجَيْشُ الَّذِينَ يُصِيبُونَهُمْ مَا قُضِيَ لَهُمْ عَلَى لِسَانِ نَبِيِّهِمْ صلى الله عليه وسلم لَنَكَلُوا عَلَى الْعَمَلِ، وَآيَةُ ذَلِكَ أَنَّ فِيهِمْ رَجُلاً لَهُ عَضُدٌ وَلَيْسَتْ لَهُ ذِرَاعٌ، عَلَى عَضُدِهِ مِثْلُ حَلَمَةِ الثَّدْىِ عَلَيْهِ شَعَرَاتٌ بِيضٌ ‏\"‏ ‏.‏ أَفَتَذْهَبُونَ إِلَى مُعَاوِيَةَ وَأَهْلِ الشَّامِ وَتَتْرُكُونَ هَؤُلاَءِ يَخْلُفُونَكُمْ فِي ذَرَارِيِّكُمْ وَأَمْوَالِكُمْ وَاللَّهِ إِنِّي لأَرْجُو أَنْ يَكُونُوا هَؤُلاَءِ الْقَوْمَ، فَإِنَّهُمْ قَدْ سَفَكُوا الدَّمَ الْحَرَامَ، وَأَغَارُوا فِي سَرْحِ النَّاسِ فَسِيرُوا عَلَى اسْمِ اللَّهِ ‏.‏ قَالَ ‏:‏ سَلَمَةُ بْنُ كُهَيْلٍ ‏:‏ فَنَزَّلَنِي زَيْدُ بْنُ وَهْبٍ مَنْزِلاً مَنْزِلاً حَتَّى مَرَّ بِنَا عَلَى قَنْطَرَةٍ قَالَ فَلَمَّا الْتَقَيْنَا وَعَلَى الْخَوَارِجِ عَبْدُ اللَّهِ بْنُ وَهْبٍ الرَّاسِبِيُّ فَقَالَ لَهُمْ ‏:‏ أَلْقُوا الرِّمَاحَ وَسُلُّوا السُّيُوفَ مِنْ جُفُونِهَا، فَإِنِّي أَخَافُ أَنْ يُنَاشِدُوكُمْ كَمَا نَاشَدُوكُمْ يَوْمَ حَرُورَاءَ قَالَ ‏:‏ فَوَحَّشُوا بِرِمَاحِهِمْ وَاسْتَلُّوا السُّيُوفَ وَشَجَرَهُمُ النَّاسُ بِرِمَاحِهِمْ - قَالَ - وَقَتَلُوا بَعْضَهُمْ عَلَى بَعْضِهِمْ ‏.‏ قَالَ ‏:‏ وَمَا أُصِيبَ مِنَ النَّاسِ يَوْمَئِذٍ إِلاَّ رَجُلاَنِ فَقَالَ عَلِيٌّ عَلَيْهِ السَّلاَمُ ‏:‏ الْتَمِسُوا فِيهِمُ الْمُخْدَجَ فَلَمْ يَجِدُوا قَالَ ‏:‏ فَقَامَ عَلِيٌّ رضى الله عنه بِنَفْسِهِ حَتَّى أَتَى نَاسًا قَدْ قُتِلَ بَعْضُهُمْ عَلَى بَعْضٍ فَقَالَ ‏:‏ أَخْرِجُوهُمْ فَوَجَدُوهُ مِمَّا يَلِي الأَرْضَ فَكَبَّرَ وَقَالَ ‏:‏ صَدَقَ اللَّهُ وَبَلَّغَ رَسُولُهُ ‏.‏ فَقَامَ إِلَيْهِ عَبِيدَةُ السَّلْمَانِيُّ فَقَالَ ‏:‏ يَا أَمِيرَ الْمُؤْمِنِينَ وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ لَقَدْ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ ‏:‏ إِي وَاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ حَتَّى اسْتَحْلَفَهُ ثَلاَثًا وَهُوَ يَحْلِفُ ‏.‏",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 173
			}
		}
	]
}