{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "حدثني يحيى، عن مالك، عن الثقة، عنده عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن بيع العربان ‏.‏ قال مالك: وذلك فيما نرى - والله أعلم - أن يشتري الرجل العبد، أو الوليدة. أو يتكارى الدابة. ثم يقول للذي اشترى منه، أو تكارى منه: أعطيك دينارا، أو درهما، أو أكثر من ذلك، أو أقل. على أني إن أخذت السلعة، أو ركبت ما تكاريت منك، فالذي أعطيتك هو من ثمن السلعة. أو من كراء الدابة، وإن تركت ابتياع السلعة، أو كراء الدابة، فما أعطيتك لك باطل بغير شيء. قال مالك: والأمر عندنا، أنه لا بأس بأن يبتاع العبد التاجر الفصيح، بالأعبد من الحبشة، أو من جنس من الأجناس، ليسوا مثله في الفصاحة، ولا في التجارة، والنفاذ، والمعرفة. لا بأس بهذا، أن يشتري منه العبد بالعبدين، أو بالأعبد إلى أجل معلوم. إذا اختلف، فبان اختلافه .فإن أشبه بعض ذلك بعضا، حتى يتقارب، فلا تأخذن منه اثنين بواحد، إلى أجل. وإن اختلفت أجناسهم. قال مالك: ولا بأس بأن تبيع ما اشتريت من ذلك، قبل أن تستوفيه. إذا انتقدت ثمنه من غير صاحبه الذي اشتريته منه. قال مالك: لا ينبغي أن يستثنى جنين في بطن أمه، إذا بيعت. لأن ذلك غرر. لا يدرى أذكر هو أم (1) أنثى أو حسن (2) أو قبيح، أو ناقص، أو تام، أو حي أو ميت؟. وذلك يضع من ثمنها. قال مالك، في الرجل يبتاع العبد، أو الوليدة، بمائة دينار إلى أجل. ثم يندم البائع. فيسأل المبتاع أن يقيله بعشرة دنانير، يدفعها إليه نقدا. أو إلى أجل. ويمحو عنه المائة دينار التي له. قال مالك: لا بأس بذلك. وإن ندم المبتاع، فسأل البائع أن يقيله في الجارية، أو العبد، ويزيده عشرة دنانير نقدا، أو إلى أجل أبعد من الأجل الذي اشترى إليه العبد، أو الوليدة. فإن ذلك لا ينبغي. وإنما كره ذلك؛ لأن البائع كأنه باع منه مائة دينار له، إلى سنة قبل أن تحل، بجارية، وبعشرة دنانير نقدا. أو إلى أجل أبعد من السنة. فدخل في ذلك بيع الذهب بالذهب إلى أجل. قال مالك، في الرجل يبيع من الرجل الجارية بمائة دينار إلى أجل، ثم يشتريها بأكثر من ذلك الثمن الذي باعها به إلى أبعد من ذلك الأجل، الذي باعها إليه: إن ذلك لا يصلح. وتفسير ما كره من ذلك، أن يبيع الرجل الجارية إلى أجل. ثم يبتاعها إلى أجل أبعد منه. يبيعها بثلاثين دينارا إلى شهر، ثم يبتاعها بستين دينارا، إلى سنة، أو إلى نصف سنة. فصار، إن رجعت إليه سلعته بعينها، وأعطاه صاحبه ثلاثين دينارا، إلى شهر؛ بستين دينارا، إلى سنة، أو إلى نصف سنة. فهذا لا ينبغي",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1290
			}
		}
	]
}