{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم نهى عن المزابنة والمحاقلة والمزابنة اشتراء الثمر بالتمر والمحاقلة اشتراء الزرع بالحنطة واستكراء الأرض بالحنطة ‏.‏ قال ابن شهاب فسألت سعيد بن المسيب عن استكراء الأرض بالذهب والورق فقال لا بأس بذلك ‏.‏ قال مالك نهى رسول الله صلى الله عليه وسلم عن المزابنة وتفسير المزابنة أن كل شىء من الجزاف الذي لا يعلم كيله ولا وزنه ولا عدده ابتيع بشىء مسمى من الكيل أو الوزن أو العدد وذلك أن يقول الرجل للرجل يكون له الطعام المصبر الذي لا يعلم كيله من الحنطة أو التمر أو ما أشبه ذلك من الأطعمة أو يكون للرجل السلعة من الحنطة أو النوى أو القضب أو العصفر أو الكرسف أو الكتان أو القز أو ما أشبه ذلك من السلع لا يعلم كيل شىء من ذلك ولا وزنه ولا عدده فيقول الرجل لرب تلك السلعة كل سلعتك هذه أو مر من يكيلها أو زن من ذلك ما يوزن أو عد من ذلك ما كان يعد فما نقص عن كيل كذا وكذا صاعا - لتسمية يسميها - أو وزن كذا وكذا رطلا أو عدد كذا وكذا فما نقص من ذلك فعلى غرمه لك حتى أوفيك تلك التسمية فما زاد على تلك التسمية فهو لي أضمن ما نقص من ذلك على أن يكون لي ما زاد ‏.‏ فليس ذلك بيعا ولكنه المخاطرة والغرر والقمار يدخل هذا لأنه لم يشتر منه شيئا بشىء أخرجه ولكنه ضمن له ما سمي من ذلك الكيل أو الوزن أو العدد على أن يكون له ما زاد على ذلك فإن نقصت تلك السلعة عن تلك التسمية أخذ من مال صاحبه ما نقص بغير ثمن ولا هبة طيبة بها نفسه فهذا يشبه القمار وما كان مثل هذا من الأشياء فذلك يدخله ‏.‏ قال مالك ومن ذلك أيضا أن يقول الرجل للرجل له الثوب أضمن لك من ثوبك هذا كذا وكذا ظهارة قلنسوة قدر كل ظهارة كذا وكذا - لشىء يسميه - فما نقص من ذلك فعلى غرمه حتى أوفيك وما زاد فلي ‏.‏ أو أن يقول الرجل للرجل أضمن لك من ثيابك هذي كذا وكذا قميصا ذرع كل قميص كذا وكذا فما نقص من ذلك فعلى غرمه وما زاد على ذلك فلي ‏.‏ أو أن يقول الرجل للرجل له الجلود من جلود البقر أو الإبل أقطع جلودك هذه نعالا على إمام يريه إياه ‏.‏ فما نقص من مائة زوج فعلى غرمه وما زاد فهو لي بما ضمنت لك ‏.‏ ومما يشبه ذلك أن يقول الرجل للرجل عنده حب البان اعصر حبك هذا فما نقص من كذا وكذا رطلا فعلى أن أعطيكه وما زاد فهو لي ‏.‏ فهذا كله وما أشبهه من الأشياء أو ضارعه من المزابنة التي لا تصلح ولا تجوز ‏.‏ وكذلك - أيضا - إذا قال الرجل للرجل له الخبط أو النوى أو الكرسف أو الكتان أو القضب أو العصفر أبتاع منك هذا الخبط بكذا وكذا صاعا من خبط يخبط مثل خبطه أو هذا النوى بكذا وكذا صاعا من نوى مثله وفي العصفر والكرسف والكتان والقضب مثل ذلك ‏.‏ فهذا كله يرجع إلى ما وصفنا من المزابنة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1315
			}
		}
	]
}