{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "حدثني يحيى، عن مالك، عن يزيد بن عبد الله بن قسيط، أنه رأى سعيد بن المسيب يراطل الذهب بالذهب فيفرغ ذهبه في كفة الميزان ويفرغ صاحبه الذي يراطله ذهبه في كفة الميزان الأخرى فإذا اعتدل لسان الميزان أخذ وأعطى ‏.‏ قال مالك الأمر عندنا في بيع الذهب بالذهب والورق بالورق مراطلة أنه لا بأس بذلك أن يأخذ أحد عشر دينارا بعشرة دنانير يدا بيد إذا كان وزن الذهبين سواء عينا بعين وإن تفاضل العدد والدراهم أيضا في ذلك بمنزلة الدنانير ‏.‏ قال مالك من راطل ذهبا بذهب أو ورقا بورق فكان بين الذهبين فضل مثقال فأعطى صاحبه قيمته من الورق أو من غيرها فلا يأخذه فإن ذلك قبيح وذريعة إلى الربا لأنه إذا جاز له أن يأخذ المثقال بقيمته حتى كأنه اشتراه على حدته جاز له أن يأخذ المثقال بقيمته مرارا لأن يجيز ذلك البيع بينه وبين صاحبه ‏.‏ قال مالك ولو أنه باعه ذلك المثقال مفردا ليس معه غيره لم يأخذه بعشر الثمن الذي أخذه به لأن يجوز له البيع فذلك الذريعة إلى إحلال الحرام والأمر المنهي عنه ‏.‏ قال مالك في الرجل يراطل الرجل ويعطيه الذهب العتق الجياد ويجعل معها تبرا ذهبا غير جيدة ويأخذ من صاحبه ذهبا كوفية مقطعة وتلك الكوفية مكروهة عند الناس فيتبايعان ذلك مثلا بمثل إن ذلك لا يصلح ‏.‏ قال مالك وتفسير ما كره من ذلك أن صاحب الذهب الجياد أخذ فضل عيون ذهبه في التبر الذي طرح مع ذهبه ولولا فضل ذهبه على ذهب صاحبه لم يراطله صاحبه بتبره ذلك إلى ذهبه الكوفية فامتنع وإنما مثل ذلك كمثل رجل أراد أن يبتاع ثلاثة أصوع من تمر عجوة بصاعين ومد من تمر كبيس فقيل له هذا لا يصلح ‏.‏ فجعل صاعين من كبيس وصاعا من حشف يريد أن يجيز بذلك بيعه فذلك لا يصلح لأنه لم يكن صاحب العجوة ليعطيه صاعا من العجوة بصاع من حشف ولكنه إنما أعطاه ذلك لفضل الكبيس أو أن يقول الرجل للرجل بعني ثلاثة أصوع من البيضاء بصاعين ونصف من حنطة شامية فيقول هذا لا يصلح إلا مثلا بمثل ‏.‏ فيجعل صاعين من حنطة شامية وصاعا من شعير يريد أن يجيز بذلك البيع فيما بينهما فهذا لا يصلح لأنه لم يكن ليعطيه بصاع من شعير صاعا من حنطة بيضاء لو كان ذلك الصاع مفردا وإنما أعطاه إياه لفضل الشامية على البيضاء فهذا لا يصلح وهو مثل ما وصفنا من التبر ‏.‏ قال مالك فكل شىء من الذهب والورق والطعام كله الذي لا ينبغي أن يباع إلا مثلا بمثل فلا ينبغي أن يجعل مع الصنف الجيد من المرغوب فيه الشىء الرديء المسخوط ليجاز البيع وليستحل بذلك ما نهي عنه من الأمر الذي لا يصلح إذا جعل ذلك مع الصنف المرغوب فيه وإنما يريد صاحب ذلك أن يدرك بذلك فضل جودة ما يبيع فيعطي الشىء الذي لو أعطاه وحده لم يقبله صاحبه ولم يهمم بذلك وإنما يقبله من أجل الذي يأخذ معه لفضل سلعة صاحبه على سلعته فلا ينبغي لشىء من الذهب والورق والطعام أن يدخله شىء من هذه الصفة فإن أراد صاحب الطعام الرديء أن يبيعه بغيره فليبعه على حدته ولا يجعل مع ذلك شيئا فلا بأس به إذا كان كذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1328
			}
		}
	]
}