{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أنه قال لا بأس بأن يسلف الرجل الرجل في الطعام الموصوف بسعر معلوم إلى أجل مسمى ما لم يكن في زرع لم يبد صلاحه أو تمر لم يبد صلاحه ‏.‏ قال مالك الأمر عندنا فيمن سلف في طعام بسعر معلوم إلى أجل مسمى فحل الأجل فلم يجد المبتاع عند البائع وفاء مما ابتاع منه فأقاله فإنه لا ينبغي له أن يأخذ منه إلا ورقه أو ذهبه أو الثمن الذي دفع إليه بعينه وإنه لا يشتري منه بذلك الثمن شيئا حتى يقبضه منه وذلك أنه إذا أخذ غير الثمن الذي دفع إليه أو صرفه في سلعة غير الطعام الذي ابتاع منه فهو بيع الطعام قبل أن يستوفى ‏.‏ قال مالك وقد نهى رسول الله صلى الله عليه وسلم عن بيع الطعام قبل أن يستوفى ‏.‏ قال مالك فإن ندم المشتري فقال للبائع أقلني وأنظرك بالثمن الذي دفعت إليك ‏.‏ فإن ذلك لا يصلح وأهل العلم ينهون عنه وذلك أنه لما حل الطعام للمشتري على البائع أخر عنه حقه على أن يقيله فكان ذلك بيع الطعام إلى أجل قبل أن يستوفى ‏.‏ قال مالك وتفسير ذلك أن المشتري حين حل الأجل وكره الطعام أخذ به دينارا إلى أجل وليس ذلك بالإقالة وإنما الإقالة ما لم يزدد فيه البائع ولا المشتري فإذا وقعت فيه الزيادة بنسيئة إلى أجل أو بشىء يزداده أحدهما على صاحبه أو بشىء ينتفع به أحدهما فإن ذلك ليس بالإقالة وإنما تصير الإقالة إذا فعلا ذلك بيعا وإنما أرخص في الإقالة والشرك والتولية ما لم يدخل شيئا من ذلك زيادة أو نقصان أو نظرة فإن دخل ذلك زيادة أو نقصان أو نظرة صار بيعا يحله ما يحل البيع ويحرمه ما يحرم البيع ‏.‏ قال مالك من سلف في حنطة شامية فلا بأس أن يأخذ محمولة بعد محل الأجل ‏.‏ قال مالك وكذلك من سلف في صنف من الأصناف فلا بأس أن يأخذ خيرا مما سلف فيه أو أدنى بعد محل الأجل وتفسير ذلك أن يسلف الرجل في حنطة محمولة فلا بأس أن يأخذ شعيرا أو شامية وإن سلف في تمر عجوة فلا بأس أن يأخذ صيحانيا أو جمعا وإن سلف في زبيب أحمر فلا بأس أن يأخذ أسود إذا كان ذلك كله بعد محل الأجل إذا كانت مكيلة ذلك سواء بمثل كيل ما سلف فيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1339
			}
		}
	]
}