{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "وحدثني عن مالك، أنه بلغه أن محمد بن سيرين، كان يقول لا تبيعوا الحب في سنبله حتى يبيض ‏.‏ قال مالك من اشترى طعاما بسعر معلوم إلى أجل مسمى فلما حل الأجل قال الذي عليه الطعام لصاحبه ليس عندي طعام فبعني الطعام الذي لك على إلى أجل ‏.‏ فيقول صاحب الطعام هذا لا يصلح لأنه قد نهى رسول الله صلى الله عليه وسلم عن بيع الطعام حتى يستوفى ‏.‏ فيقول الذي عليه الطعام لغريمه فبعني طعاما إلى أجل حتى أقضيكه ‏.‏ فهذا لا يصلح لأنه إنما يعطيه طعاما ثم يرده إليه ‏.‏ فيصير الذهب الذي أعطاه ثمن الذي كان له عليه ويصير الطعام الذي أعطاه محللا فيما بينهما ويكون ذلك إذا فعلاه بيع الطعام قبل أن يستوفى ‏.‏ قال مالك في رجل له على رجل طعام ابتاعه منه ولغريمه على رجل طعام مثل ذلك الطعام فقال الذي عليه الطعام لغريمه أحيلك على غريم لي عليه مثل الطعام الذي لك على بطعامك الذي لك على ‏.‏ قال مالك إن كان الذي عليه الطعام إنما هو طعام ابتاعه فأراد أن يحيل غريمه بطعام ابتاعه فإن ذلك لا يصلح وذلك بيع الطعام قبل أن يستوفى فإن كان الطعام سلفا حالا فلا بأس أن يحيل به غريمه لأن ذلك ليس ببيع ولا يحل بيع الطعام قبل أن يستوفى لنهى رسول الله صلى الله عليه وسلم عن ذلك غير أن أهل العلم قد اجتمعوا على أنه لا بأس بالشرك والتولية والإقالة في الطعام وغيره ‏.‏ قال مالك وذلك أن أهل العلم أنزلوه على وجه المعروف ولم ينزلوه على وجه البيع وذلك مثل الرجل يسلف الدراهم النقص فيقضى دراهم وازنة فيها فضل فيحل له ذلك ويجوز ولو اشترى منه دراهم نقصا بوازنة لم يحل ذلك ولو اشترط عليه حين أسلفه وازنة وإنما أعطاه نقصا لم يحل له ذلك ‏.‏ قال مالك ومما يشبه ذلك أن رسول الله صلى الله عليه وسلم نهى عن بيع المزابنة وأرخص في بيع العرايا بخرصها من التمر وإنما فرق بين ذلك أن بيع المزابنة بيع على وجه المكايسة والتجارة وأن بيع العرايا على وجه المعروف لا مكايسة فيه ‏.‏ قال مالك ولا ينبغي أن يشتري رجل طعاما بربع أو ثلث أو كسر من درهم على أن يعطى بذلك طعاما إلى أجل ولا بأس أن يبتاع الرجل طعاما بكسر من درهم إلى أجل ثم يعطى درهما ويأخذ بما بقي له من درهمه سلعة من السلع لأنه أعطى الكسر الذي عليه فضة وأخذ ببقية درهمه سلعة فهذا لا بأس به ‏.‏ قال مالك ولا بأس أن يضع الرجل عند الرجل درهما ثم يأخذ منه بربع أو بثلث أو بكسر معلوم سلعة معلومة فإذا لم يكن في ذلك سعر معلوم وقال الرجل آخذ منك بسعر كل يوم فهذا لا يحل لأنه غرر يقل مرة ويكثر مرة ولم يفترقا على بيع معلوم ‏.‏ قال مالك ومن باع طعاما جزافا ولم يستثن منه شيئا ثم بدا له أن يشتري منه شيئا فإنه لا يصلح له أن يشتري منه شيئا إلا ما كان يجوز له أن يستثني منه وذلك الثلث فما دونه فإن زاد على الثلث صار ذلك إلى المزابنة وإلى ما يكره فلا ينبغي له أن يشتري منه شيئا إلا ما كان يجوز له أن يستثني منه ولا يجوز له أن يستثني منه إلا الثلث فما دونه وهذا الأمر الذي لا اختلاف فيه عندنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1344
			}
		}
	]
}