{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"35": "Pre-emption in Property"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1398,
			"arabicnumber": 1398,
			"text": "قال يحيى قال مالك عن محمد بن عمارة، عن أبي بكر بن حزم، أن عثمان بن عفان، قال إذا وقعت الحدود في الأرض فلا شفعة فيها ولا شفعة في بئر ولا في فحل النخل ‏.‏ قال مالك وعلى هذا الأمر عندنا ‏.‏ قال مالك ولا شفعة في طريق صلح القسم فيها أو لم يصلح ‏.‏ قال مالك والأمر عندنا أنه لا شفعة في عرصة دار صلح القسم فيها أو لم يصلح ‏.‏ قال مالك في رجل اشترى شقصا من أرض مشتركة على أنه فيها بالخيار فأراد شركاء البائع أن يأخذوا ما باع شريكهم بالشفعة قبل أن يختار المشتري إن ذلك لا يكون لهم حتى يأخذ المشتري ويثبت له البيع فإذا وجب له البيع فلهم الشفعة ‏.‏ وقال مالك في الرجل يشتري أرضا فتمكث في يديه حينا ثم يأتي رجل فيدرك فيها حقا بميراث إن له الشفعة إن ثبت حقه وإن ما أغلت الأرض من غلة فهي للمشتري الأول إلى يوم يثبت حق الآخر لأنه قد كان ضمنها لو هلك ما كان فيها من غراس أو ذهب به سيل ‏.‏ قال فإن طال الزمان أو هلك الشهود أو مات البائع أو المشتري أو هما حيان فنسي أصل البيع والاشتراء لطول الزمان فإن الشفعة تنقطع ويأخذ حقه الذي ثبت له وإن كان أمره على غير هذا الوجه في حداثة العهد وقربه وأنه يرى أن البائع غيب الثمن وأخفاه ليقطع بذلك حق صاحب الشفعة قومت الأرض على قدر ما يرى أنه ثمنها فيصير ثمنها إلى ذلك ثم ينظر إلى ما زاد في الأرض من بناء أو غراس أو عمارة فيكون على ما يكون عليه من ابتاع الأرض بثمن معلوم ثم بنى فيها وغرس ثم أخذها صاحب الشفعة بعد ذلك ‏.‏ قال مالك والشفعة ثابتة في مال الميت كما هي في مال الحى فإن خشي أهل الميت أن ينكسر مال الميت قسموه ثم باعوه فليس عليهم فيه شفعة ‏.‏ قال مالك ولا شفعة عندنا في عبد ولا وليدة ولا بعير ولا بقرة ولا شاة ولا في شىء من الحيوان ولا في ثوب ولا في بئر ليس لها بياض إنما الشفعة فيما يصلح أنه ينقسم وتقع فيه الحدود من الأرض فأما ما لا يصلح فيه القسم فلا شفعة فيه ‏.‏ قال مالك ومن اشترى أرضا فيها شفعة لناس حضور فليرفعهم إلى السلطان فإما أن يستحقوا وإما أن يسلم له السلطان فإن تركهم فلم يرفع أمرهم إلى السلطان وقد علموا باشترائه فتركوا ذلك حتى طال زمانه ثم جاءوا يطلبون شفعتهم فلا أرى ذلك لهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 35,
				"hadith": 1398
			}
		}
	]
}