{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"19": "I'tikaf in Ramadan"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 692,
			"arabicnumber": 692,
			"text": "وحدثني عن مالك، أنه سأل ابن شهاب عن الرجل، يعتكف هل يدخل لحاجته تحت سقف فقال نعم لا بأس بذلك ‏.‏ قال مالك الأمر عندنا الذي لا اختلاف فيه أنه لا يكره الاعتكاف في كل مسجد يجمع فيه ولا أراه كره الاعتكاف في المساجد التي لا يجمع فيها إلا كراهية أن يخرج المعتكف من مسجده الذي اعتكف فيه إلى الجمعة أو يدعها فإن كان مسجدا لا يجمع فيه الجمعة ولا يجب على صاحبه إتيان الجمعة في مسجد سواه فإني لا أرى بأسا بالاعتكاف فيه لأن الله تبارك وتعالى قال ‏{‏وأنتم عاكفون في المساجد‏}‏ فعم الله المساجد كلها ولم يخص شيئا منها ‏.‏ قال مالك فمن هنالك جاز له أن يعتكف في المساجد التي لا يجمع فيها الجمعة إذا كان لا يجب عليه أن يخرج منه إلى المسجد الذي تجمع فيه الجمعة ‏.‏ قال مالك ولا يبيت المعتكف إلا في المسجد الذي اعتكف فيه إلا أن يكون خباؤه في رحبة من رحاب المسجد ولم أسمع أن المعتكف يضرب بناء يبيت فيه إلا في المسجد أو في رحبة من رحاب المسجد ومما يدل على أنه لا يبيت إلا في المسجد قول عائشة كان رسول الله صلى الله عليه وسلم إذا اعتكف لا يدخل البيت إلا لحاجة الإنسان ‏.‏ ولا يعتكف فوق ظهر المسجد ولا في المنار يعني الصومعة ‏.‏ وقال مالك يدخل المعتكف المكان الذي يريد أن يعتكف فيه قبل غروب الشمس من الليلة التي يريد أن يعتكف فيها حتى يستقبل باعتكافه أول الليلة التي يريد أن يعتكف فيها والمعتكف مشتغل باعتكافه لا يعرض لغيره مما يشتغل به من التجارات أو غيرها ولا بأس بأن يأمر المعتكف ببعض حاجته بضيعته ومصلحة أهله وأن يأمر ببيع ماله أو بشىء لا يشغله في نفسه فلا بأس بذلك إذا كان خفيفا أن يأمر بذلك من يكفيه إياه ‏.‏ قال مالك لم أسمع أحدا من أهل العلم يذكر في الاعتكاف شرطا وإنما الاعتكاف عمل من الأعمال مثل الصلاة والصيام والحج وما أشبه ذلك من الأعمال ما كان من ذلك فريضة أو نافلة فمن دخل في شىء من ذلك فإنما يعمل بما مضى من السنة وليس له أن يحدث في ذلك غير ما مضى عليه المسلمون لا من شرط يشترطه ولا يبتدعه وقد اعتكف رسول الله صلى الله عليه وسلم وعرف المسلمون سنة الاعتكاف ‏.‏ قال مالك والاعتكاف والجوار سواء والاعتكاف للقروي والبدوي سواء ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 692
			}
		}
	]
}