{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"20": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "أخبرنا محمد بن بشار، قال حدثنا يحيى بن سعيد، عن سعيد، عن قتادة، عن زرارة، عن سعد بن هشام، أنه لقي ابن عباس فسأله عن الوتر، فقال ألا أنبئك بأعلم أهل الأرض بوتر رسول الله صلى الله عليه وسلم قال نعم ‏.‏ قال عائشة ائتها فسلها ثم ارجع إلى فأخبرني بردها عليك فأتيت على حكيم بن أفلح فاستلحقته إليها فقال ما أنا بقاربها إني نهيتها أن تقول في هاتين الشيعتين شيئا فأبت فيها إلا مضيا ‏.‏ فأقسمت عليه فجاء معي فدخل عليها فقالت لحكيم من هذا معك قلت سعد بن هشام ‏.‏ قالت من هشام قلت ابن عامر ‏.‏ فترحمت عليه وقالت نعم المرء كان عامرا ‏.‏ قال يا أم المؤمنين أنبئيني عن خلق رسول الله صلى الله عليه وسلم ‏.‏ قالت أليس تقرأ القرآن قال قلت بلى ‏.‏ قالت فإن خلق نبي الله صلى الله عليه وسلم القرآن ‏.‏ فهممت أن أقوم فبدا لي قيام رسول الله صلى الله عليه وسلم فقال يا أم المؤمنين أنبئيني عن قيام نبي الله صلى الله عليه وسلم ‏.‏ قالت أليس تقرأ هذه السورة ‏{‏ يا أيها المزمل ‏}‏ قلت بلى ‏.‏ قالت فإن الله عز وجل افترض قيام الليل في أول هذه السورة فقام نبي الله صلى الله عليه وسلم وأصحابه حولا حتى انتفخت أقدامهم وأمسك الله عز وجل خاتمتها اثنى عشر شهرا ثم أنزل الله عز وجل التخفيف في آخر هذه السورة فصار قيام الليل تطوعا بعد أن كان فريضة فهممت أن أقوم فبدا لي وتر رسول الله صلى الله عليه وسلم فقلت يا أم المؤمنين أنبئيني عن وتر رسول الله صلى الله عليه وسلم ‏.‏ قالت كنا نعد له سواكه وطهوره فيبعثه الله عز وجل لما شاء أن يبعثه من الليل فيتسوك ويتوضأ ويصلي ثماني ركعات لا يجلس فيهن إلا عند الثامنة يجلس فيذكر الله عز وجل ويدعو ثم يسلم تسليما يسمعنا ثم يصلي ركعتين وهو جالس بعد ما يسلم ثم يصلي ركعة فتلك إحدى عشرة ركعة يا بنى فلما أسن رسول الله صلى الله عليه وسلم وأخذ اللحم أوتر بسبع وصلى ركعتين وهو جالس بعد ما سلم فتلك تسع ركعات يا بنى وكان رسول الله صلى الله عليه وسلم إذا صلى صلاة أحب أن يدوم عليها وكان إذا شغله عن قيام الليل نوم أو مرض أو وجع صلى من النهار اثنتى عشرة ركعة ولا أعلم أن نبي الله صلى الله عليه وسلم قرأ القرآن كله في ليلة ولا قام ليلة كاملة حتى الصباح ولا صام شهرا كاملا غير رمضان فأتيت ابن عباس فحدثته بحديثها فقال صدقت أما أني لو كنت أدخل عليها لأتيتها حتى تشافهني مشافهة ‏.‏ قال أبو عبد الرحمن كذا وقع في كتابي ولا أدري ممن الخطأ في موضع وتره عليه السلام ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 4
			}
		}
	]
}