{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"23": "The Book of Zakah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2447,
			"arabicnumber": 2447,
			"text": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا المظفر بن مدرك أبو كامل، قال حدثنا حماد بن سلمة، قال أخذت هذا الكتاب من ثمامة بن عبد الله بن أنس بن مالك عن أنس بن مالك أن أبا بكر كتب لهم إن هذه فرائض الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين التي أمر الله عز وجل بها رسوله صلى الله عليه وسلم فمن سئلها من المسلمين على وجهها فليعط ومن سئل فوق ذلك فلا يعط فيما دون خمس وعشرين من الإبل في كل خمس ذود شاة فإذا بلغت خمسا وعشرين ففيها بنت مخاض إلى خمس وثلاثين فإن لم تكن بنت مخاض فابن لبون ذكر فإذا بلغت ستا وثلاثين ففيها بنت لبون إلى خمس وأربعين فإذا بلغت ستة وأربعين ففيها حقة طروقة الفحل إلى ستين فإذا بلغت إحدى وستين ففيها جذعة إلى خمس وسبعين فإذا بلغت ستا وسبعين ففيها بنتا لبون إلى تسعين فإذا بلغت إحدى وتسعين ففيها حقتان طروقتا الفحل إلى عشرين ومائة فإذا زادت على عشرين ومائة ففي كل أربعين بنت لبون وفي كل خمسين حقة فإذا تباين أسنان الإبل في فرائض الصدقات فمن بلغت عنده صدقة الجذعة وليست عنده جذعة وعنده حقة فإنها تقبل منه الحقة ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة الحقة وليست عنده حقة وعنده جذعة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين إن استيسرتا له ومن بلغت عنده صدقة الحقة وليست عنده وعنده بنت لبون فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة ابنة لبون وليست عنده إلا حقة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة ابنة لبون وليست عنده بنت لبون وعنده بنت مخاض فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة ابنة مخاض وليس عنده إلا ابن لبون ذكر فإنه يقبل منه وليس معه شىء ومن لم يكن عنده إلا أربع من الإبل فليس فيها شىء إلا أن يشاء ربها وفي صدقة الغنم في سائمتها إذا كانت أربعين ففيها شاة إلى عشرين ومائة فإذا زادت واحدة ففيها شاتان إلى مائتين فإذا زادت واحدة ففيها ثلاث شياه إلى ثلاثمائة فإذا زادت ففي كل مائة شاة ولا يؤخذ في الصدقة هرمة ولا ذات عوار ولا تيس الغنم إلا أن يشاء المصدق ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية فإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها شىء إلا أن يشاء ربها وفي الرقة ربع العشر فإن لم تكن إلا تسعين ومائة درهم فليس فيها شىء إلا أن يشاء ربها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 13
			}
		}
	]
}