{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"38": "The Book of Distribution of Al-Fay'"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4147,
			"arabicnumber": 4147,
			"text": "أخبرنا عمرو بن يحيى بن الحارث، قال أنبأنا محبوب، قال أنبأنا أبو إسحاق، عن شريك، عن خصيف، عن مجاهد، قال الخمس الذي لله وللرسول كان للنبي صلى الله عليه وسلم وقرابته لا يأكلون من الصدقة شيئا فكان للنبي صلى الله عليه وسلم خمس الخمس ولذي قرابته خمس الخمس ولليتامى مثل ذلك وللمساكين مثل ذلك ولابن السبيل مثل ذلك ‏.‏ قال أبو عبد الرحمن قال الله جل ثناؤه ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل ‏}‏ وقوله عز وجل لله ابتداء كلام لأن الأشياء كلها لله عز وجل ولعله إنما استفتح الكلام في الفىء والخمس بذكر نفسه لأنها أشرف الكسب ولم ينسب الصدقة إلى نفسه عز وجل لأنها أوساخ الناس والله تعالى أعلم وقد قيل يؤخذ من الغنيمة شىء فيجعل في الكعبة وهو السهم الذي لله عز وجل وسهم النبي صلى الله عليه وسلم إلى الإمام يشتري الكراع منه والسلاح ويعطي منه من رأى ممن رأى فيه غناء ومنفعة لأهل الإسلام ومن أهل الحديث والعلم والفقه والقرآن وسهم لذي القربى وهم بنو هاشم وبنو المطلب بينهم الغني منهم والفقير وقد قيل إنه للفقير منهم دون الغني كاليتامى وابن السبيل وهو أشبه القولين بالصواب عندي والله تعالى أعلم والصغير والكبير والذكر والأنثى سواء لأن الله عز وجل جعل ذلك لهم وقسمه رسول الله صلى الله عليه وسلم فيهم وليس في الحديث أنه فضل بعضهم على بعض ولا خلاف نعلمه بين العلماء في رجل لو أوصى بثلثه لبني فلان أنه بينهم وأن الذكر والأنثى فيه سواء إذا كانوا يحصون فهكذا كل شىء صير لبني فلان أنه بينهم بالسوية إلا أن يبين ذلك الآمر به والله ولي التوفيق وسهم لليتامى من المسلمين وسهم للمساكين من المسلمين وسهم لابن السبيل من المسلمين ولا يعطى أحد منهم سهم مسكين وسهم ابن السبيل وقيل له خذ أيهما شئت والأربعة أخماس يقسمها الإمام بين من حضر القتال من المسلمين البالغين ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 15
			}
		}
	]
}