{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"5": "The Book of Salah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 450,
			"arabicnumber": 450,
			"text": "أخبرنا عمرو بن هشام، قال حدثنا مخلد، عن سعيد بن عبد العزيز، قال حدثنا يزيد بن أبي مالك، قال حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتيت بدابة فوق الحمار ودون البغل خطوها عند منتهى طرفها فركبت ومعي جبريل عليه السلام فسرت فقال انزل فصل ‏.‏ ففعلت فقال أتدري أين صليت صليت بطيبة وإليها المهاجر ثم قال انزل فصل ‏.‏ فصليت فقال أتدري أين صليت صليت بطور سيناء حيث كلم الله عز وجل موسى عليه السلام ثم قال انزل فصل ‏.‏ فنزلت فصليت فقال أتدري أين صليت صليت ببيت لحم حيث ولد عيسى عليه السلام ‏.‏ ثم دخلت بيت المقدس فجمع لي الأنبياء عليهم السلام فقدمني جبريل حتى أممتهم ثم صعد بي إلى السماء الدنيا فإذا فيها آدم عليه السلام ثم صعد بي إلى السماء الثانية فإذا فيها ابنا الخالة عيسى ويحيى عليهما السلام ثم صعد بي إلى السماء الثالثة فإذا فيها يوسف عليه السلام ثم صعد بي إلى السماء الرابعة فإذا فيها هارون عليه السلام ثم صعد بي إلى السماء الخامسة فإذا فيها إدريس عليه السلام ثم صعد بي إلى السماء السادسة فإذا فيها موسى عليه السلام ثم صعد بي إلى السماء السابعة فإذا فيها إبراهيم عليه السلام ثم صعد بي فوق سبع سموات فأتينا سدرة المنتهى فغشيتني ضبابة فخررت ساجدا فقيل لي إني يوم خلقت السموات والأرض فرضت عليك وعلى أمتك خمسين صلاة فقم بها أنت وأمتك ‏.‏ فرجعت إلى إبراهيم فلم يسألني عن شىء ثم أتيت على موسى فقال كم فرض الله عليك وعلى أمتك قلت خمسين صلاة ‏.‏ قال فإنك لا تستطيع أن تقوم بها أنت ولا أمتك فارجع إلى ربك فاسأله التخفيف ‏.‏ فرجعت إلى ربي فخفف عني عشرا ثم أتيت موسى فأمرني بالرجوع فرجعت فخفف عني عشرا ثم ردت إلى خمس صلوات ‏.‏ قال فارجع إلى ربك فاسأله التخفيف فإنه فرض على بني إسرائيل صلاتين فما قاموا بهما ‏.‏ فرجعت إلى ربي عز وجل فسألته التخفيف فقال إني يوم خلقت السموات والأرض فرضت عليك وعلى أمتك خمسين صلاة فخمس بخمسين فقم بها أنت وأمتك ‏.‏ فعرفت أنها من الله تبارك وتعالى صرى فرجعت إلى موسى عليه السلام فقال ارجع فعرفت أنها من الله صرى - أى حتم - فلم أرجع ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Munqar"
				},
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 3
			}
		}
	]
}