{
	"metadata": {
		"name": "Sunan an Nasai",
		"section": {
			"7": "The Book of the Adhan (The Call to Prayer)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 632,
			"arabicnumber": 632,
			"text": "أخبرنا إبراهيم بن الحسن، ويوسف بن سعيد، - واللفظ له - قالا حدثنا حجاج، عن ابن جريج، قال حدثني عبد العزيز بن عبد الملك بن أبي محذورة، أن عبد الله بن محيريز، أخبره - وكان، يتيما في حجر أبي محذورة حتى جهزه إلى الشام - قال قلت لأبي محذورة إني خارج إلى الشام وأخشى أن أسأل عن تأذينك فأخبرني أن أبا محذورة قال له خرجت في نفر فكنا ببعض طريق حنين مقفل رسول الله صلى الله عليه وسلم من حنين فلقينا رسول الله صلى الله عليه وسلم في بعض الطريق فأذن مؤذن رسول الله صلى الله عليه وسلم بالصلاة عند رسول الله صلى الله عليه وسلم فسمعنا صوت المؤذن ونحن عنه متنكبون فظللنا نحكيه ونهزأ به فسمع رسول الله صلى الله عليه وسلم الصوت فأرسل إلينا حتى وقفنا بين يديه فقال رسول الله صلى الله عليه وسلم ‏\"‏ أيكم الذي سمعت صوته قد ارتفع ‏\"‏ ‏.‏ فأشار القوم إلى وصدقوا فأرسلهم كلهم وحبسني فقال ‏\"‏ قم فأذن بالصلاة ‏\"‏ ‏.‏ فقمت فألقى على رسول الله صلى الله عليه وسلم التأذين هو بنفسه قال ‏\"‏ قل الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ‏\"‏ ‏.‏ ثم قال ‏\"‏ ارجع فامدد صوتك ‏\"‏ ‏.‏ ثم قال ‏\"‏ قل أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ ثم دعاني حين قضيت التأذين فأعطاني صرة فيها شىء من فضة فقلت يا رسول الله مرني بالتأذين بمكة ‏.‏ فقال ‏\"‏ قد أمرتك به ‏\"‏ ‏.‏ فقدمت على عتاب بن أسيد عامل رسول الله صلى الله عليه وسلم بمكة فأذنت معه بالصلاة عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Abu Ghuddah",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 7
			}
		}
	]
}