{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"31": "Chapters On Wala' And Gifts"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2125,
			"arabicnumber": 2125,
			"text": "Telah menceritakan kepada kami [Bundar]; telah menceritakan kepada kami ['Abdurrahman bin Mahdi]; telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] bahwasanya; Ia ingin membeli Barirah, namun majikannya mempersyaratkan Al Wala` (kepemilikan tetap terhadap mereka), maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perwalian (hak milik) itu adalah bagi yang membayar, atau bagi waliyun ni'mah (yang merdekakan).\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Ibnu Umar dan Abu Hurairah. Dan ini adalah hadits Hasan Shahih. Dan menurut Ahlul Ilmi, hadits ini diamalkan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": 2126,
			"text": "Telah menceritakan kepada kami [Ibnu Abu 'Umar]; telah menceritakan kepada kami [Sufyan bin 'Uyainah]; telah menceritakan kepada kami ['Abdullah bin Dinar] dia mendengar ['Abdullah bin 'Umar] bahwasanya Rasulullah shallallahu 'alaihi wasallam melarang penjualan Al Wala` (kepemilikan) dan juga menghibahkannya. Abu Isa berkata; Ini adalah hadits Hasan Shahih, kami tidak mengetahuinya kecuali dari haditsnya Abdullah bin Dinar dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam bahwasanya, beliau melarang penjualan Al Wala` atau pun menghibahkannya. Hadits ini juga telah diriwayatkan oleh [Syu'bah], [Sufyan Ats Tsauri] dan [Malik bin Anas] dari [Abdullah bin Dinar]. Dan diriwayatkan pula dari Syu'bah, ia berkata, \"Sungguh, aku berkeinginan bahwa Abdullah bin Dinar ketika meriwayatkan hadits ini untuk mengizinkan kepadaku agar aku mencium kepalanya. [Yahya bin Sulaim] juga meriwayatkan hadits ini dari [Ubaidullah bin Umar], dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, namun di dalamnya terdapat Wahm. Yang shahih adalah dari Ubaidullah bin Umar dari Abdullah bin Dinar dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam. Dan seperti ini pula yang diriwayatkan oleh lebih dari satu perawi dari Ubaidullah bin Umar. Abu Isa berkata; Abdullah bin Umar bersendirian dalam meriwayatkan hadits ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": 2127,
			"text": "Telah menceritakan kepada kami [Hannad]; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim At Taimi] dari [bapaknya] dia berkata; [Ali] pernah menyampaikan khuthbah kepada kami seraya berkata, \"Barangsiapa yang menyangka, bahwa kami memiliki sesuatu yang kami baca kecuali Kitabullah (Al Qur`an) dan di dalam Shahifah ini gigi unta, atau pun sesuatu dari batu-batu, maka sungguh ia telah berdusta.\" Dan di dalam khuthbahnya, ia juga berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kota Madinah adalah haram (suci), yakni daerah antara 'Air dan Tsaur. Maka barangsiapa yang berbuat kejahatan di dalamnya, atau berniat hendak melakukan kejahatan di dalamnya, niscaya laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa atasnya. Allah tidak akan menerima darinya, baik itu amalan wajib atau pun amalan sunnahnya. Dan barangisapa yang bernasab kepada selain bapaknya, atau berwali kepada selain walinya, maka laknat Allah, para Malaikat dan laknat seluruh manusia akan tertimpa atasnya, tidak akan diterima lagi darinya, baik itu amalan wajib atau pun amalan sunnahnya. Dzimmah kaum muslimin adalah satu. Dan akan lebih tinggi lagi, orang-orang yang paling rendah dari mereka.\" Abu Isa berkata; Sebagian mereka meriwayatkan dari [Al A'masy] dari [Ibrahim At Tamimi], dari [Al Harits bin Suwaid], dari [Ali] dengan hadits semisalnya. Abu Isa berkata; Ini adalah hadits hasan shahih. Dan telah pula diriwayatkan lebih dari satu jalur dari Ali dari Nabi shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": 2128,
			"text": "Telah menceritakan kepada kami ['Abdul Jabbar bin Al 'Ala bin 'Abdul Jabbar Al 'Aththar] dan [Sa'id bin 'Abdurrahman Al Makhzumi] mereka berdua berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dia berkata; Ada seorang laki-laki Bani Fararah datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya isteri telah melahirkan seorang anak yang hitam.\" Maka Nabi shallallahu 'alaihi wasallam bertanya: \"Apakah kamu memiliki beberapa ekor unta?\" Laki-laki itu menjawab, \"Ya.\" Beliau bertanya lagi: \"Lalu apa sajakah warna-warna kulitnya?\" Laki-laki itu menjawab, \"Merah.\" Beliau bertanya lagi: \"Apakah diantaranya ada yang berwarna hijau?\" laki-laki itu menjawab, \"Ya.\" Beliau bertanya lagi: \"Lantas darimana warna itu datang?\" Laki-laki itu pun menjawab, \"Mungkin saja dari akar yang ia cabut.\" Akhirnya beliau pun bersabda: \"Maka demikian pula halnya dengan ini, mungkin saja dari akar yang ia cabut.\" Abu Isa berkata; Ini adalah hadits hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": 2129,
			"text": "Telah menceritakan kepada kami [Qutaibah]; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah] bahwasanya Nabi shallallahu 'alaihi wasallam pernah menemuinya dalam keadaan senang dengan wajah yang berseri-seri seraya bersabda: \"Apakah kamu tidak memperhatikan bahwa tadi Mujazziz melihat ke arah Zaid bin Haritsah dan Usamah bin Zaid?\" Beliau berkata lagi, \"Sesungguhnya kaki ini, sebagiannya bersal dari sebagian yang lain.\" Abu Isa berkata; Ini adalah hadits hasan shahih. Ibnu Uyainah telah meriwayatkan hadits ini dari Az Zuhri dari Urwah dari 'Aisyah, dan ia menambahkan di dalamnya; \"Tidakkah kamu perhatikan, bahwa Mujazziz melewati Zaid bin Haritsah dan Usamah bin Zaid yang keduanya telah menutupi kepalanya, sementara kaki-kakitnya terlihat?\" kemudian beliau bersabda: \"Sesungguhnya kaki-kaki ini, sebagiannya berasal dari sebagian yang lain.\" Dan seperti ini pula, [Sa'id bin Abdurrahman] dan yang lainnya meriwayatkan hadits ini dari [Sufyan bin Uyainah] dari [Zuhri] dari [Urwah] dari [Aisyah]. Dan hadits ini adalah hasan shahih. Sebagian Ulama telah berdalih dengan hadits ini, yakni terkait dengan perintah untuk menegakkan perkara Al Qafah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": 2130,
			"text": "Telah menceritakan kepada kami [Azhar bin Marwan Al Bashri]; telah menceritakan kepada kami [Muhammad bin Sawa']; telah menceritakan kepada kami [Abu Ma'syar] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Hendaknya kalian saling memberikan hadiah, karena hadiah dapat menghilangkan sifat benci dalam dada, dan janganlah seseorang meremehkan pemberian tetangganya walaupun hanya secuil kaki kambing.\" Abu Isa berkata; Hadits ini gharib bila ditinjau dari jalur sanad ini. Adapun Abu Mi'syar namanya adalah Najih, yakni bekas budaknya Bani Hasyim, dan sebagian ahli ilmu telah membicarakannya dari sisi hafalannya",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": 2131,
			"text": "Telah menceritakan kepada kami [Ahmad bin Mani']; telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq]; telah menceritakan kepada kami [Husain Al Mukattab] dari ['Amr bin Syu'aib] dari [Thawus] dari [Ibnu 'Umar] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpaan orang yang memberikan suatu pemberian lalu mengambilnya kembali adalah seperti seekor anjing yang makan hingga kekenyangan dan memuntahkannya, lalu ia kembali memakannya.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Ibnu Abbas dan Abdullah bin Amru",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": 2132,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basysyar]; telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Husain Al Mu'allim] dari ['Amr bin Syu'aib]; telah menceritakan kepadaku [Thawus] dari [Ibnu 'Umar] dan [Ibnu Abbas] - keduanya memarfukkan hadits ini- ia berkata, \"Tidak halal bagi seseorang untuk memberikan pemberian kemudian ia menariknya kembali. Kecuali bagi seorang bapak terhadap apa yang diberikannya pada anaknya. Dan perumpamaan seorang yang memberikan pemberian, lalu ia menariknya kembali, adalah seperti seekor kambing yang makan hingga kekenyangan dan muntah, lalu memakan muntahannya kembali.\" Abu Isa berkata; Ini adalah hadits Hasan Shahih. Asy Syafi'i berkata, \"Tidak halal, bagi seorang yang telah menghibahkan sesuatu, lalu ia menariknya kembali. Kecuali bagi seorang bapak, maka ia boleh mengambil kembali apa yang telah diberikannya pada anaknya.\" Kemudian ia berdalik dengan hadits ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 9
			}
		}
	]
}