{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"44": "Chapters on Parables"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2859,
			"arabicnumber": 2859,
			"text": "Telah menceritakan kepada kami [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Baqiyah bin Al Walid] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair] dari [An Nawwas bin Sam'an Al Kilabi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah membuat perumpamaan jalan yang lurus, di atas dua tepi jalan ada dua tembok, pada keduanya ada beberapa pintu terbuka, pintu-pintu itu bertirai dan disetiap penghujung jalan ada penyeru yang meyeru manusia dan penyeru yang menyeru di atasnya Dan Allah menyeru menuju negeri keselamatan, memberi petunjuk kepada siapa saja yang Ia kehendaki menuju jalan yang lurus. QS Yunus; 25 Pintu-pintu yang ada di sisi jalan adalah batasan-batasan Allah, karenanya janganlah ada seorang pun yang jatuh di batasan-batasan Allah hingga tirai terbuka, sementara yang menyeru dari atasnya adalah penyeru Rabbnya.\" Abu Isa berkata; Hadits ini hasan gharib. Ia berkata; Aku mendengar Abdullah bin Abdurrahman berkata; Aku mendengar Zakariya bin Adi berkata; Abu Ishaq Al Fazari berkata; \"Ambillah hadits yang disampaikan oleh para perawi tsiqah yang masih ada, dan jangan mengambil hadits yang disampaikan Isma'il bin Ayyasy, baik dari para perawi tsiqah atau bukan tsiqah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2860,
			"arabicnumber": 2860,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] bahwa [Jabir bin Abdullah Al Anshari] berkata; \"Pada suatu hari, Rasulullah shallallahu 'alaihi wasallam keluar menemui kami, beliau bersabda: \"Sesungguhnya aku bermimpi seakan-akan Jibril berada di sisi kepalaku, sedangkan Mika'il berada di sisi kakiku, salah satu dari keduanya berkata kepada yang lain; \"Buatlah perumpamaan baginya, \" dia berkata; \"Dengarkanlah pasti telingamu mendengar dan fahamilah pasti hatimu memahami, perumpamaanmu dengan ummatmu seperti seorang raja yang hendak membuat istana, dan didalamnya dibangun rumah, setelah membangun rumah, dia menyiapkan jamuan makan dalam rumah tersebut, lalu dia menyuruh seorang utusan untuk mengundang rakyat agar menghadiri jamuannya, di antara mereka ada yang memenuhi undangan utusan tadi dan di antara mereka ada yang meninggalkannya, Allah sebagai rajanya, istana sebagai Islamnya, rumah sebagai surganya dan engkau wahai Muhammad adalah sebagai seorang utusannya, barangsiapa yang memenuhi undanganmu berarti dia masuk Islam, dan barangsiapa masuk Islam, berarti akan masuk surga dan barangsiapa masuk surga, berarti dia memakan apa yang ada di dalamnya.\" Hadits ini telah diriwayatkan dari beberapa jalur dari Nabi shallallahu 'alaihi wasallam dengan sanad yang lebih kuat dari sanad hadits ini. Abu Isa berkata; Hadits ini mursal, karena Sa'id bin Abu Hilal tidak bertemu dengan Jabir bin Abdullah. Dan dalam bab ini, ada juga hadits dari Ibnu Mas'ud",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2861,
			"arabicnumber": 2861,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Ja'far bin Maymun] dari [Abu Tamimah Al Hujaimi] dari [Abu Utsman] dari [Ibnu Mas'ud] ia berkata; \"Seusai Rasulullah shallallahu 'alaihi wasallam shalat isya, beliau keluar sambil memegang tangan Abdullah bin Mas'ud, ketika sampai di suatu lembah makkah, beliau mendudukkannya kemudian membuat garis lingkaran di sekitarnya lalu bersabda: \"Janganlah kamu meninggalkan garismu, karena akan datang kepadamu beberapa orang dan janganlah kamu mengajak bicara kepada mereka, karena sesungguhnya mereka tidak mengajak bicara denganmu, \" Ibnu Mas'ud berkata; lalu Rasulullah shallallahu 'alaihi wasallam berlalu ke tempat yang beliau tuju, ketika aku sedang duduk di garisku, tiba-tiba datanglah kepadaku beberapa orang, seakan-akan mereka adalah orang-orang hitam India yang rambut dan tubuh mereka tidak terlihat, tapi tidak memakai kain penutup, mereka menghampiriku namun tidak bisa melewati garis, setelah itu mereka kembali kepada Rasulullah shallallahu 'alaihi wasallam, sampai ketika di akhir malam, Rasulullah shallallahu 'alaihi wasallam mendatangiku, sementara saya dalam keadaan duduk, lalu beliau bersabda: \"Sejak tadi malam aku tidak tidur, \" kemudian beliau masuk ke dalam garis bersamaku dan menjadikan pahaku untuk bantalnya lalu beliau tertidur. Jika Rasulullah shallallahu 'alaihi wasallam tidur, maka tarikan nafasnya terdengar. Ketika aku sedang duduk sementara Rasulullah shallallahu 'alaihi wasallam berbantalkan pahaku, tiba-tiba saya melihat beberapa orang dengan mengenakan pakaian serba putih, hanya Allah yang tahu akan keindahan mereka, mereka menghampiriku, sedangkan sebagian dari mereka duduk di sisi kepala Rasulullah shallallahu 'alaihi wasallam dan sebagian yang lainnya di sisi kaki beliau, lalu mereka berkata kepada sesamanya: \"Kita tidak pernah sama sekali melihat seorang hamba yang diberi sebagaimana yang diberikan kepada Nabi ini, sungguh kedua matanya tertidur sementara hatinya terjaga, buatlah oleh kalian permisalan untuknya, permisalannya seperti seorang tuan yang membangun istana, kemudian membuat jamuan makan, setelah itu ia mengundang orang-orang untuk menghadiri jamuan makan dan minumnya, barangsiapa memenuhi undangannya maka dia makan dan minum jamuan makanan dan minumannya, dan barangsiapa tidak memenuhi undangannya, maka dia akan memberinya sanksi, atau dia berkata; maka dia akan menyiksanya.\" kemudian mereka pergi, ketika itu Rasulullah shallallahu 'alaihi wasallam terjaga dari tidurnya, lalu beliau bertanya: \"Apakah kamu mendengar apa yang mereka katakan dan apakah kamu tahu siapa mereka?\" Aku menjawab; \"Allah dan RasulNya yang lebih tahu, \" beliau bersabda: \"Mereka adalah para Malaikat, kemudian apakah kamu tahu apa permisalan yang mereka buat?\" aku menjawab; \"Allah dan Rasul-Nya yang lebih tahu, \" beliau bersabda: \"Permisalan yang mereka buat adalah Allah yang Maha pemurah dan Maha Tinggi telah membangum surga dan menyeru hamba-hambaNya menuju surga, barangsiapa menjawab seruanNya, dia masuk surga dan barangsiapa tidak menjawabnya, Dia akan memberinya sanksi atau menyiksanya.\" Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini, Abu Tamimah adalah Al Juhani, namanya adalah Tharif bin Mujalid, Abu Utsman An Nahdi namanya adalah Abdurrahman bin Mull. Hadits [Sulaiman At Taimi] telah meriwayatkan hadits ini darinya [Mu'tamir] dan dia adalah Sulaiman bin Tharkhan, bukan Taimi namun dia pernah singgah di Bani Taim sehingga dia dinisbahkan kepadanya. Ali berkata bahwa Yahya bin Sa'id berkata; \"Aku tidak pernah melihat orang yang lebih takut kepada Allah melebihi Sulaiman At Taimi",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2862,
			"arabicnumber": 2862,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Muhammad bin Sinan] telah menceritakan kepada kami [Sulaim bin Hayyan Bashri] telah menceritakan kepada kami [Sa'id bin Mina`] dari [Jabir bin Abdullah] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perumpamaanku dengan para nabi sebelumku seperti seseorang yang membangun rumah, lalu ia menyelesaikan dan memperindahnya kecuali satu tempat batu bata yang kurang, lalu orang-orang memasukinya dan mereka terkesima karenanya, mereka berkata; \"Andai bukan karena satu tempat batu bata.\" Abu Isa berkata; Dalam hal ini, ada hadits serupa dari Ubay bin Ka'ab dan Abu Hurairah. Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2863,
			"arabicnumber": 2863,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban bin Yazid] telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Zaid bin Sallam] bahwa [Abu Sallam] telah menceritakan kepadanya bahwa [Al Harits Al Asy'ari] telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memerintahkan lima kalimat kepada Yahya bin Zakariya agar diamalkan dan memerintahkan Bani Israil supaya mengamalkannya, dan sesungguhnya ia hampir saja memperlambatnya. Isa berkata; \"Sesungguhnya Allah memerintahkan lima kalimat padamu agar kamu amalkan dan agar Bani Israil kamu perintahkan untuk mengamalkannya, perintahlah mereka atau aku yang memerintah mereka.\" Yahya menjawab; \"Aku khawatir bila kamu mendahuluiku menyampaikannya, aku akan dibenamkan atau disiksa.\" Isa kemudian mengumpulkan manusia di Baitul Maqdis, masjid penuh sesak hingga ke teras, Isa berkata; \"Sesungguhnya Allah memerintahkanku lima kalimat agar aku amalkan dan aku perintahkan kalian untuk mengamalkannya, pertama; sembahlah Allah dan jangan menyekutukanNya dengan sesuatu pun, sesungguhnya perumpamaan orang yang menyekutukan Allah sama seperti seseorang membeli budak dengan uang emas atau perak lalu ia berkata; Ini rumahku dan ini pekerjaanku, bekerjalah dan tunaikan untukku. Tapi budak itu malah bekerja dan menunaikan untuk orang lain, siapa di antara kalian yang mau budaknya seperti itu? Sesungguhnya Allah memerintahkan shalat pada kalian, bila kalian shalat, maka janganlah menoleh, karena Allah menghadapkankan wajah-Nya ke wajah hambaNya saat shalat, selama ia tidak menoleh. Aku memerintahkan kalian puasa, dan perumpamaannya seperti seseorang berada di tengah-tengah sekelompok orang, ia membawa kantong berisi minyak kesturi, kalian semua kagum atau semerbak baunya mengagumkan, seseungguhnya bau (mulut) orang yang berpuasa lebih harum bagi Allah melebihi minyak kesturi, aku juga memerintahkan kalian bersedekah, perumpamaannya seperti seseorang yang ditawan musuh, mereka membelenggu tangannya ke leher, mereka lalu memajukannya untuk ditebas lehernya, kemudian ia berkata; \"Aku menebusnya dari kalian dengan yang sedikit dan yang banyak, \" lalu tawanan tersebut menebus dirinya dari mereka. Aku memerintahkan kalian untuk mengingat Allah, sesungguhnya perumpamaannya seperti seseorang yang dikejar musuh dengan cepat, hingga ketika tiba di benteng yang kokoh, ia menjaga dirinya dari mereka, demikian halnya hamba, ia tidak menjaga diri dari setan kecuali dengan mengingat Allah.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Dan aku memerintahkan lima hal pada kalian yang diperintahkan Allah padaku, yaitu; mendengar, taat, jihad, hijrah dan jama'ah, sebab barangsiapa meninggalkan jama'ah barang sejengkal, maka ia telah melepas tali Islam dari lehernya, kecuali jika ia kembali. Dan barangsiapa menyerukan seruan jahiliyah, maka ia termasuk bangkai neraka jahanam.\" Seseorang bertanya; \"Wahai Rasulullah, meski ia shalat dan puasa?\" Beliau menjawab: \"Meski ia shalat dan puasa, oleh karena itu, serukanlah seruan Allah yang menyebut kalian sebagai kaum muslimin, mu`minin dan hamba-hamba Allah.\" Abu Isa berkata; Hadits ini hasan shahih gharib. Abu Isa berkata; Muhammad bin Isam'il Al Harits Al Asy'ari pernah bertemu Nabi shallallahu 'alaihi wasallam dan ia memiliki hadits lain selain hadits ini. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Dawud Ath Thayalisi] telah menceritakan kepada kami [Aban bin Yazid] dari [Yahya bin Abu Katsir] dari [Zaid bin Sallam] dari [Abu Sallam] dari [Al Harits Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam seperti di atas dengan maksud yang sama.\" Abu Isa berkata; Hadits ini hasan shahih gharib, dan Abu Sallam Al Habasyi namanya adalah Mamthur. [Ali bin Al Mubarak] telah meriwayatkan hadits ini dari [Yahya bin Abu Katsir]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2864,
			"arabicnumber": 2864,
			"grades": [
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2865,
			"arabicnumber": 2865,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] dari [Abu Musa Al Asy'ari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang mu`min yang membaca al-Qur`an seperti buah utrujah, baunya harum dan rasanya enak, sedangkan perumpamaan orang mu`min yang tidak membaca al-Qur`an seperti buah kurma, tidak ada baunya namun rasanya manis, dan perumpamaan orang munafik yang membaca al-Qur`an seperti raihanah (sejenis tanaman), harum baunya tapi pahit rasanya dan perumpamaan munafik yang yang tidak membaca al-Qur`an seperti brotowali, baunya busuk dan rasanya pahit.\" Abu Isa berkata; Hadits ini hasan shahih dan [Syu'bah] juga meriwayatkannya dari [Qatadah]",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2866,
			"arabicnumber": 2866,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] dan yang lain, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang mu`min seperti tanaman, angin senantiasa menerpanya (ke kiri dan ke kanan) dan orang mu`min itu akan senantiasa tertimpa musibah, sedangkan perumpamaan orang munafik seperti pohon padi, tidaklah ia bergerak hingga di ketam.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2867,
			"arabicnumber": 2867,
			"text": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] telah menceritakan kepada kami [Ma'nu] telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di antara pepohonan ada suatu pohon yang daunnya tidak berguguran, itu seperti seorang mu`min, beritahukanlah kepadaku pohon apa itu?\" Abdullah berkata; Orang-orang mengira pohon tersebut adalah pohon yang tumbuh dipadang pasir, sementara aku mengiranya pohon kurma. Nabi shallallahu 'alaihi wasallam bersabda: \"Ia adalah pohon kurma\" akan tetapi aku malu mengatakannya.\" Abdullah berkata; \"Lalu aku beritahukan kepada Umar apa yang aku kira, maka Umar berkata; \"Sungguh bila kamu mengatakannya itu lebih aku sukai daripada aku memiliki ini dan ini.\" Abu Isa berkata; Hadits ini hasan. Dalam hal ini ada hadits serupa dari Abu Hurairah radliallahu 'anhu",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2868,
			"arabicnumber": 2868,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana menurut kalian bila di pintu salah seorang dari kalian ada sungai, lalu ia mandi lima kali setiap harinya, masihkan ada kotoran yang tersisa?\" mereka menjawab; \"Tidak akan ada kotorannya tersisa sedikit pun.\" Beliau bersabda: \"Itu seperti shalat lima waktu, dengannya Allah akan menghapus kesalahan-kesalahannya.\" Dalam hal ini, ada hadits serupa dari Jabir. Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Bakr bin Mudlar Al Qurasy] dari [Ibnu Al Had] seperti hadits di atas",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2869,
			"arabicnumber": 2869,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Yahya Al Abah] dari [Tsabit Al Bunani] dari [Anas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan ummatku seperti hujan, tidak diketahui (apakah) yang baik pada permulannya ataukah akhirnya.\" Abu Isa berkata; Dalam hal ini, ada hadits serupa dari 'Ammar, Abdullah bin 'Amru dan Ibnu Umar. Abu Isa berkata; Hadits ini hasan gharib melalui sanad ini. ia berkata; Dan diriwayatkan dari Abdurrahman bin Mahdi bahwa dia menguatkan (hadits) Hammad bin Yahya Al Abah, ia berkata; \"Dia termasuk salah satu dari guru kami",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2870,
			"arabicnumber": 2870,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Khallad bin Yahya] telah menceritakan kepada kami [Basyir bin Al Muhajir] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Ayahnya] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Tahukah kalian apakah ini dan apakah ini?\" -beliau sambil melempar dua batu kerikil, - para sahabat menjawab; \"Allah dan Rasul-Nya yang lebih tahu, \" beliau bersabda: \"Yang ini seperti cita-cita dan yang ini seperti ajal.\" Abu Isa berkata; Dari jalur ini, hadits ini hasan gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2871,
			"arabicnumber": 2871,
			"text": "Telah menceritakan kepada kami [Ishaq bin Musa] telah menceritakan kepada kami [Ma'nu] telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ajal kalian seperti yang telah berlalu dari umat-umat sebelumnya, sama seperti waktu antara shalat ashar hingga terbenamnya matahari, sesungguhnya perumpamaan kalian dan perumpamaan Yahudi dan Nasrani seperti seseorang mempekerjakan beberapa pekerja, orang itu berkata; \"Siapa yang bekerja untukku hingga pertengahan siang, akan mendapatkan satu qirath satu qirath.\" Maka orang Yahudi bekerja untuk mendapatkan satu qirath satu qirath, lalu orang itu berkata; \"Siapa yang bekerja untukku dari pertengahan siang hingga shalat ashar akan mendapatkan satu qirath satu qirat.\" Orang Nasrani bekerja untuk mendapatkan satu qirath satu qirath. Selanjutnya kalian bekerja mulai dari shalat ashar hingga matahari terbenam dengan mendapatkan dua qirath dua qirath. Maka Yahudi dan Nasrani marah, mereka berkata; Kami kerja lebih banyak tapi imbalannya sedikit. Orang itu bertanya: \"Apakah aku menzhalimi hak kalian sedikit pun?\" Mereka menjawab; \"Tidak.\" orang itu berkata; \"Itulah karuniaku, aku memberikannya kepada siapa saja yang aku kehendaki.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2872,
			"arabicnumber": 2872,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] dan yang lain, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya manusia itu seperti seratus unta, hampir saja seseorang tidak menemukan satu pun yang berangkat (yang layak untuk ditunggangi).\" Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dengan sanad dan maksud yang sama. Dan beliau bersabda: \"Tidak ada satu pun yang berangkat, atau bersabda: \"Tidak ada kecuali satu pun yang berangkat",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2873,
			"arabicnumber": 2873,
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2874,
			"arabicnumber": 2874,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perumpamaanku dan perumpamaan ummatku seperti seseorang yang menyalakan api kemudian lalat dan kupu-kupu jatuh di api itu, dan aku memegangi ikatan kain kalian, sementara kalian tetap memasukinya.\" Abu Isa berkata; hadits ini hasan shahih dan hadits ini juga diriwayatkan melalui sanad yang lain",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 44,
				"hadith": 17
			}
		}
	]
}