{
	"metadata": {
		"name": "Jami At Tirmidhi",
		"section": {
			"45": "Chapters on The Virtues of the Qur'an"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2875,
			"arabicnumber": 2875,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam pergi menemui Ubay bin Ka'ab, maka Rasulullah shallallahu 'alaihi wasallam memanggil: \"Hai Ubay!\" sementara dirinya tengah mengerjakan shalat, ia menoleh namun tidak menjawab beliau, dan Ubai tetap melanjutkan shalatnya, ia lalu mempercepat shalatnya dan langsung menghampiri Rasulullah shallallahu 'alaihi wasallam, Ubay mengucapkan; \"ASSALAAMU'ALAIKUM, wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"WA 'ALAIKASSALAAM, apa yang menghalangimu, wahai Ubay untuk menjawabku saat aku memanggilmu?\" Ubay menjawab; \"Wahai Rasulullah, aku tadi sedang mengerjakan shalat. Beliau bertanya: \"Apa kau tidak menemukan di antara yang diwahyukan Allah kepadaku agar kalian memenuhi panggilan Allah dan RasulNya bila menyeru kalian untuk sesuatu yang menghidupkan kalian?\" Ubay menjawab; \"Benar, aku tidak akan mengulangi, insya Allah.\" Beliau bersabda: \"Maukah aku ajarkan kepadamu satu surat yang tidak diturunkan di Taurat, Injil dan Zabur, dan dalam al-Qur`an juga tidak ada yang sepertinya?\" Ubay menjawab; \"Tentu, wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana kamu membaca saat shalat?\" Perawi berkata; \"Maka Ubay membaca ummul al-Qur`an (Al Fatehah). Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah diturunkan di Taurat, Injil, Zabur dan dalam al-Qur`an seperti itu, sesungguhnya ia adalah tujuh (ayat) yang diulang-ulang dan al-Qur`an yang agung yang diberikan padaku.\" Abu Isa berkata; Hadits ini hasan shahih. Dalam hal ini, ada hadits serupa dari Anas bin Malik dan Abu Sa'id bin Al Mu'alla",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2876,
			"arabicnumber": 2876,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Hulwani] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Sa'id Al Maqburi] dari [Atha`] bekas budak milik Abu Ahmad dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutus rombongan para sahabat dalam jumlah banyak, beliau meminta kepada mereka untuk membaca, beliau meminta setiap orang dari mereka untuk membacakan apa yang dia hafal dari Al Qur`an, beliau datang kepada seseorang yang paling muda umurnya di antara mereka dan bertanya: \"Apa yang kamu hafal dari Al Qur`an wahai Fulan?\" dia menjawab; \"Saya hafal ini dan ini dan surat Al Baqarah, \" beliau bertanya: \"Apakah kamu hafal surat Al Baqarah?\" dia menjawab; \"Ya, \" beliau bersabda kepadanya: \"Pergilah dan kamu yang jadi imam bagi mereka, \" Seseorang yang paling terkemuka di antara mereka berkata; \"Demi Allah wahai Rasulullah, tidak ada yang menghalangiku untuk mempelajari surat Al Baqarah selain karena aku takut tidak dapat mengamalkannya, \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pelajarilah Al Qur`an dan bacalah, karena perumpamaan Al Qur`an bagi orang yang mempelajarinya kemudian membacanya seperti kantong yang penuh dengan minyak wangi, dimana wanginya semerbak ke setiap tempat, dan perumpamaan orang yang mempelajarinya kemudian tidur (tidak mengamalkannya) padahal Al Qur`an ada di hatinya seperti kantong yang berisi minyak wangi namun terikat.\" Abu Isa berkata; Hadits ini hasan, [Laits bin Sa'ad] telah meriwayatkannya dari [Sa'id Al Maqburi] dari [Atha`] budak milik Abu Ahmad, dari Nabi shallallahu 'alaihi wasallam secara mursal, dan di dalam hadits tersebut, tidak disebutkan dari Abu Hurairah. Telah menceritakan kepada kami [Qutaibah] dari [Laits] kemudian dia menyebutkan hadits",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2877,
			"arabicnumber": 2877,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menjadikan rumah-rumah kalian seperti kuburan, sesungguhnya syetan tidak memasuki rumah yang dibacakan didalamnya surat Al Baqarah.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2878,
			"arabicnumber": 2878,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Husain Al Ju'fi] dari [Za`idah] dari [Hakim bin Jubair] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap sesuatu memiliki puncak, dan puncaknya Al Qur`an adalah surat Al Baqarah, di dalamnya terdapat ayat yang merupakan tuannya ayat-ayat dalam Al Qur`an yaitu ayat kursi.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits Hakim bin Jubair, sementara Syu'bah mempermasalahkan tentang Hakim bin Jubair dan melemahkannya",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2879,
			"arabicnumber": 2879,
			"text": "Telah menceritakan kepada kami [Yahya bin Al Mughirah Abu Salamah Al Makhzumi Al Madani] telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Abdurrahman bin Abu Bakar Al Mulaiki] dari [Zurarah bin Mush'ab] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca HAA MIIM (dalam surat) Al Mu`min sampai ayat ILAIHIL MASHIIR dan membaca ayat kursi pada waktu pagi, maka ia akan di jaga hingga tiba waktu sore, dan barangsiapa membaca keduanya pada waktu sore maka ia akan dijaga hingga tiba waktu pagi.\" Abu Isa berkata; Hadits ini gharib, sebagian ahli ilmu telah membicarakan tentang Abdurrahman bin Abu Bakar bin Abu Mulaikah Al Mulaiki dari sisi hafalannya, Zurarah bin Mush'ab adalah Ibnu Abdurrahman bin 'Auf, kakek Abu Mush'ab Al Madani",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2880,
			"arabicnumber": 2880,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Laila] dari saudaranya yaitu [Isa] dari [Abdurrahman bin Abu Laila] dari [Abu Ayyub Al Anshari] ia memiliki rak berisi kurma, ada hantu datang dan mengambilnya, lalu ia mengadukan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pergilah, bila kau melihatnya, ucapkanlah BISMILLAAH, turutilah Rasulullah.\" lalu Abu Ayyub Al Anshari menangkapnya, hantu itu bersumpah tidak akan kembali. Akhirnya Abu Ayyub melepasnya lalu ia menemui Nabi shallallahu 'alaihi wasallam, beliau bertanya: \"Apa yang dilakukan tawananmu?\" Abu Ayyub menjawab: \"Ia bersumpah tidak akan kembali.\" Beliau bersabda: \"Ia dusta, memang ia terbiasa berdusta.\" Abdurrahman berkata; Abu Ayyub lalu menangkap yang kedua kalinya, hantu itu pun bersumpah untuk tidak kembali lagi, lantas Abu Ayyub melepasnya. Setelah itu Abu Ayyub datang menemui Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apa yang di lakukan tawananmu?\" Abu Ayyub menjawab; \"Dia bersumpah untuk tidak kembali.\" Beliau bersabda: \"Dia dusta, memang ia terbiasa berdusta.\" Setelah itu Abu Ayyub menangkapnya lagi, lalu berkata; \"Aku tidak akan melepaskanmu sampai aku membawamu ke Nabi shallallahu 'alaihi wasallam.\" Hantu itu berkata; \"Aku ingatkan padamu tentang sesuatu, yaitu ayat kursi, bacalah ayat kursi di rumahmu, niscaya setan tidak akan mendekatimu dan tidak juga yang lainnya.\" Abu Ayyub pun menemui Nabi shallallahu 'alaihi wasallam, beliau bertanya: \"Apa yang dilakukan tawananmu?\" Abdurrahman berkata; lalu Abu Ayyub memberitahukan apa yang diucapkan hantu itu, maka beliau bersabda: \"Ia benar walaupun sebenarnya ia pendusta.\" Abu Isa berkata; Hadits ini hasan gharib. Dalam hal ini, ada hadits serupa dari Ubay bin Ka'ab",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2881,
			"arabicnumber": 2881,
			"text": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari [Mandhur bin Al Mu'tamir] dari [Ibrahim bin Yazid] dari [Abdurrahman bin Yazid] dari [Abu Mas'ud Al Anshari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca dua ayat terakhir dari surat Al Baqarah pada malam hari, maka keduanya akan mencukupinya.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2882,
			"arabicnumber": 2882,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Asy'ats bin Abdurrahman Al Jarmi] dari [Abu Qilabah] dari [Abu Al Asy'ats Al Jarmi] dari [Nu'man bin Basyir] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya Allah telah menulis kitab (Al Qur`an) sejak dua ribu tahun sebelum menciptakan langit dan bumi, Allah menurunkan dua ayat darinya sebagai penutup surat Al Baqarah, tidaklah keduanya dibaca dalam rumah selama tiga malam setan akan mendekatinya.\" Abu Isa berkata; Hadits ini hasan gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2883,
			"arabicnumber": 2883,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Hisyam bin Isma'il Abu Abdul Malik Al Athar] telah mengabarkan kepada kami [Muhammad bin Syu'aib] telah menceritakan kepada kami [Ibrahim bin Sulaiman] dari [Al Walid bin Abdurrahman] dari [Jubair bin Nufair] dari [Nawwas bin Sam'an] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Al Qur`an akan datang pada hari Qiyamat bersama pemiliknya yang mengamalkannya di dunia, didahului oleh surat Al Baqarah dan Ali Imran, \" Nawwas berkata; Rasulullah shallallahu 'alaihi wasallam membuat perumpamaan untuk keduanya (surat Al Baqarah dan Ali Imran) dengan tiga perumpamaan yang aku tidak akan melupakan selamanya, beliau bersabda: \"Keduanya akan datang seperti dua awan, yang di antara keduanya ada cahaya, atau keduanya seperti dua awan tebal, atau keduanya seperti sekawanan burung yang membentangkan sayapnya, lalu keduanya berhujah untuk pemiliknya.\" Dan dalam bab ini, ada hadits dari Buraidah dan Abu Umamah. Abu Isa berkata; Dari jalur ini, hadits ini gharib, adapun makna hadits ini menurut ahli ilmu adalah akan datang pahala membacanya seperti ini, sebagian ahli ilmu menafsirkan hadits ini dan yang hadits serupa bahwa pahala membaca Al Qur`an akan datang, dan dalam hadits An Nawwas dari Nabi shallallahu 'alaihi wasallam ada dalil yang menunjukkan atas apa yang mereka tafsirkan, dimana Nabi shallallahu 'alaihi wasallam bersabda: \"Dan para pemiliknya yang mengamalkannya di dunia.\" Hadits ini menunjukkan pahala amal akan datang",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2884,
			"arabicnumber": 2884,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] ia berkata; telah menceritakan kepada kami [Al Humaidi] telah menceritakan kepada kami [Sufyan bin 'Uyainah] tentang penafsiran hadits Abdulah bin Mas'ud, ia berkata; \"Tidaklah Allah menciptakan langit dan bumi yang lebih agung melebihi ayat kursi.\" Sufyan berkata; \"Karena ayat kursi adalah kalam Allah dan kalam Allah lebih agung dari ciptaan Allah seperti langit dan bumi",
			"grades": [
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2885,
			"arabicnumber": 2885,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] telah memberitakan kepada kami [Syu'bah] dari [Abu Ishaq] ia berkata; Aku mendengar [Al Bara` bin 'Azib] berkata; \"Ketika seseorang membaca surat Al Kahfi, tiba-tiba ia melihat binatang tunggangannya menghentakkan kedua kakinya, kemudian ia memandang (keatas), ternyata seperti awan atau mendung. Lalu ia menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal itu kepada beliau. Lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Itu adalah ketenangan yang turun bersama al-Qur`an atau turun atas al-Qur`an.\" Dalam hal ini, ada hadits serupa dari Usaid bin Hudlair. Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2886,
			"arabicnumber": 2886,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Salim bin Abu Al Ja'd] dari [Ma'dan bin Abu Thalhah] dari [Abu Ad Darda`] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membaca tiga ayat permulaan surat Al Kahfi, maka ia akan terjaga dari fitnah Dajjal.\" Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku] dari [Qatadah] dengan sanad dan maksud yang sama. Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Shadh"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2887,
			"arabicnumber": 2887,
			"text": "Telah menceritakan kepada kami [Qutaibah] dan [Sufyan bin Waki'] keduanya berkata; telah menceritakan kepada kami [Humaid bin Abdurrahman Ar Ru`asi] dari [Al Hasan bin Shalih] dari [Harun Abu Muhammad] dari [Muqatil bin Hayyan] dari [Qatadah] dari [Anas] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap sesuatu memiliki hati, dan hatinya Al Qur`an adalah surat Yasin, barangsiapa membaca surat Yasin, maka Allah akan mencatat baginya seperti membaca seluruh Al Qur`an sepuluh kali atas balasan bacaannya.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits Humaid bin Abdurrahman. Sedangkan di Bashrah, orang-orang tidak mengetahuinya dari hadits Qatadah kecuali dari jalur ini. Harun Abu Muhammad adalah seorang syaikh yang majhul (tidak diketahui). Telah menceritakan kepada kami [Abu Musa bin Muhammad Al Mutsanna] telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi] telah menceritakan kepada kami [Qutaibah] dari [Humaid bin Abdurrahman] dengan hadits ini. Dan dalam bab ini, ada hadits dari Abu Bakar Ash Shiddiq, namun tidak sah dari sisi sanadnya, karena sanadnya lemah. Dan dalam bab ini, ada juga hadits dari Abu Hurairah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2888,
			"arabicnumber": 2888,
			"text": "Telah menceritakan kepada kami [Sufyan bin Waqi'] telah menceritakan kepada kami [Zaid bin Hubab] dari [Umar bin Abu Khats'am] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca HAA MIIM (surat) Ad Dukhan pada malam hari, maka tujuh puluh ribu malaikat akan memohonkan ampunan untuknya di pagi harinya.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur ini, sebab Umar bin Abu Khats'am dilemahkan, Muhammad berkata; \"Dia adalah munkarul hadits (Sering meriwayatkan hadits munkar)",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Mawdu"
				},
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2889,
			"arabicnumber": 2889,
			"text": "Telah menceritakan kepada kami [Nashr bin Abdurrahman Al Kufi] telah menceritakan kepada kami [Zaid bin Hubab] dari [Hisyam Abu Al Miqdam] dari [Al Hasan] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca HAA MIIM (surat) Ad Dukhan pada malam jum'at, maka (dosa-dosanya) akan diampuni.\" Abu Isa berkata; Hadits ini hanya kami ketahui dari jalur ini. Hisyam Abu Al Miqdam dilemahkan dan Al Hasan tidak pernah mendengar dari Abu Hurairah. Demikian yang dikatakan Ayyub, Yunus bin Ubaid dan Ali bin Zaid",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2890,
			"arabicnumber": 2890,
			"text": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] telah menceritakan kepada kami [Yahya bin 'Amru bin Malik An Nukri] dari [Ayahnya] dari [Abul Jauza`] dari [Ibnu Abbas] ia berkata; \"Sebagian sahabat Nabi shallallahu 'alaihi wasallam membuat kemah di atas pemakaman, ternyata ia tidak mengira jika berada di pemakaman, tiba-tiba ada seseorang membaca surat TABAARAKAL LADZII BIYADIHIL MULKU (Maha Suci Allah yang di tangan-Nyalah segala kerajaan) \". sampai selesai, kemudian dia datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah sesungguhnya, aku membuat kemahku di atas kuburan dan saya tidak mengira jika tempat tersebut adalah kuburan, kemudian ada seseorang membaca surat TABARAK (surat) Al Mulk sampai selesai, \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia adalah penghalang, dia adalah penyelamat yang menyelamatkannya dari siksa kubur.\" Abu Isa berkata; Dari jalur ini, hadits ini hasan gharib. Dan dalam bab ini, ada hadits dari Abu Hurairah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2891,
			"arabicnumber": 2891,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abbas Al Jusyami] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya ada satu surat dalam Al Qur`an yang terdiri dari tiga puluh ayat, dan dapat memberikan syafa'at kepada seseorang hingga dia diampuni, yaitu surat TABAARAKAL LADZII BIYADIHIL MULKU.\" Abu Isa berkata; Hadits ini hasan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2892,
			"arabicnumber": 2892,
			"text": "Telah menceritakan kepada kami [Huraim bin Mis'ar At Turmudzi] telah menceritakan kepada kami [Al Fadll bin Iyadl] dari [Laits] dari [Abu Az Zubair] dari [Jabir] bahwa; \"Tidaklah Nabi shallallahu 'alaihi wasallam tidur hingga beliau membaca ALIF LAAM MIIM TANZIL dan TABAARAKALLADZI BIYADILIL MULK.\" Abu Isa berkata; Hadits ini diriwayatkan oleh beberapa perawi dari Laits bin Abu Sulaim seperti ini, dan diriwayatkan pula oleh [Mughirah bin Muslim] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti ini. [Zuhair] meriwayatkan, katanya; \"Aku bertanya kepada Abu Zubair; \"Apakah kamu mendengar dari Jabir?\" Ia pun menyebut hadits ini. [Abu Az Zubair] mengatakan; Hanya [Shafwan atau Ibnu Shafwan] yang mengabarkannya kepadaku. Sepertinya Zuhair mengingkari hadits ini dari Abu Az Zubair dari Jabir. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Al Ahwash] dari [Laits] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas. Perawi berkata; telah menceritakan kepada kami Huraim bin Mis'ar telah menceritakan kepada kami Fudlail dari Laits dari Thawus ia berkata; \"Keduanya melebihi setiap surat dalam al-Qur`an dengan tujuhpuluh kebaikan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Maqtu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2893,
			"arabicnumber": 2893,
			"text": "Telah menceritakan kepada kami [Muhammad bin Musa Al Harasyi Al Bashri] telah menceritakan kepada kami [Al Hasan bin Salm bin Shalih Al Ijli] telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas bin Malik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca \"IDZA ZULZILAT\" maka akan digantikan baginya dengan separuh Al Qur`an, barangsiapa membaca \"QUL YAA AYYUHAL KAAFIRUUN\" maka akan di gantikan baginya dengan seperempat Al Qur`an dan barangsiapa membaca \"QUL HUWALLAAHU AHAD\" maka akan disamakan baginya dengan sepertiga Al Qur`an.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits syaikh ini, yaitu Al Hasan bin Salm. Dan dalam bab ini, ada juga hadits dari Ibnu Abbas",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2894,
			"arabicnumber": 2894,
			"text": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yaman bin Al Mughirah Al Anazi] telah mengabarkan kepada kami [Atha`] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Surat) IDZA ZULZILAT sama seperti separuh Al Qur`an, QUL HUWALLAAHU AHAD sama seperti sepertiga Al Qur`an dan QUL YAA AYYUHAL KAAFIRUUN sama seperti seperempat Al Qur`an.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits Yaman bin Al Mughirah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2895,
			"arabicnumber": 2895,
			"text": "Telah menceritakan kepada kami ['Uqbah bin Mukram Al Ammi Al Bashri] telah menceritakan kepadaku [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Salamah bin Wardan] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bertanya kepada salah seorang sahabat beliau: \"Apakah kamu sudah menikah hai fulan?\" ia menjawab; \"Belum, demi Allah wahai Rasulullah, aku tidak memiliki sesuatu untuk aku pakai menikah.\" Rasulullah bertanya: \"Bukankah kamu punya (hafalan) QUL HUWALLAHU AHAD?\" Ia menjawab; \"Betul.\" Beliau bersabda: \"Sepertiga al-Qur'an.\" Beliau bertanya: \"Bukankah kau punya (hafalan) IDZAA JAA`A NASHRULLAAHI WAL FATH?\" ia menjawab; \"Benar.\" Beliau bersabda: \"Seperempat al-Qur'an.\" Beliau bertanya: \"Bukankah kamu punya (hafalan) QUL YAA`AYYUHAL KAAFIRUUN?\" ia menjawab; \"Benar.\" Beliau bersabda: \"Seperempat al-Qur'an.\" Beliau bertanya: \"Bukankah kau punya (hafalan) IDZAA ZULZILATIL ARDLU?\" ia menjawab; \"Benar.\" Beliau bersabda: \"Seperempat al-Qur'an.\" Beliau bersabda: \"Menikahlah.\" Abu Isa berkata; Hadits ini hasan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2896,
			"arabicnumber": 2896,
			"text": "Telah menceritakan kepada kami [Qutaibah] dan [Muhammad bin Basyar] keduanya berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Za'idah] dari [Manshur] dari [Hilal bin Yasaf] dari [Rabi' bin Khutsaim] dari ['Amru bin Maimun] dari [Abdurrahman bin Abu Laila] dari [istrinya Abu Ayyub] dari [Abu Ayyub] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah salah seorang dari kalian mampu membaca sepertiga Al Qur`an dalam waktu semalam, barangsiapa membaca ALAAHUL WAAHIDUSH SHAMAD (Surat Al Ikhlas) berarti dia membaca sepertiga Al Qur`an.\" Dan dalam bab ini, ada hadits dari Abu Darda`, Abu Sa'id, Qatadah bin Nu'man, Abu Hurairah, Anas, Ibnu Umar dan Abu Mas'ud. Abu Isa berkata; Hadits ini hasan, dan kami tidak mengetahui seorang pun meriwayatkan hadits ini yang lebih baik dari riwayatnya Za`idah, dan riwayatnya disempurnakan pula oleh [Isra`il] dan [Al Fudlail bin Iyadl]. Syu'bah dan yang lainnya juga telah meriwayatkan hadits ini dari orang-orang tsiqah dari Manshur, namun mereka sedikit bertentangan dalam hadits ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2897,
			"arabicnumber": 2897,
			"text": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Ishaq bin Sulaiman] dari [Malik bin Anas] dari ['Ubaidullah bin Abdurrahman] dari [Ibnu Hunain] bekas budak milik keluarga Zaid bin Al Khaththab atau budak Zaid bin Al Khaththab, dari [Abu Hurairah] ia berkata; \"Saya pulang dari perjalanan bersama Nabi shallallahu 'alaihi wasallam, lalu beliau mendengar seseorang membaca QUL HUWALLAAHU AHAD ALAAHUSH SHAMAD, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wajib.\" Aku bertanya; \"Wajib apa?\" Beliau menjawab: \"(mendapatkan) Surga.\" Abu Isa berkata; Hadits ini hasan gharib, kami hanya mengetahuinya dari hadits Malik bin Anas. Ibnu Hunain adalah 'Ubaid bin Hunain",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2898,
			"arabicnumber": 2898,
			"text": "Telah menceritakan kepada kami [Muhammad bin Marzuq Al Bashri] telah menceritakan kepada kami [Hatim bin Maymun Abu Sahl] dari [Tsabit Al Bunani] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa membaca QUL HUWALLAAHU AHAD setiap hari seratus kali, niscaya dosa-dosanya selama lima puluh tahun akan terhapus, kecuali jika dia mempunyai hutang, \" Dan dengan sanad ini pula, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa beranjak tidur ke tempat tidurnya, kemudian miring ke sebelah kanannya sambil membaca QUL HUWALLAAHU AHAD sebanyak seratus kali, maka pada hari kiyamat, Rabb Tabaraka wa Ta'ala akan berkata kepadanya: \"Wahai hamba-Ku, masuklah surga di sebelah kananmu.\" Abu Isa berkata; Hadits ini gharib dari hadits Tsabit dari Anas, Dan hadits ini telah diriwayatkan juga dari jalur yang lain dari Tsabit",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2899,
			"arabicnumber": 2899,
			"text": "Telah menceritakan kepada kami [Al Abbas Ad Duri] telah menceritakan kepada kami [Khalid bin Mukhlad] telah menceritakan kepada kami [Sulaiman bin Bilal] telah menceritakan kepada kami [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"QUL HUWALLAAHU AHAD menyamai sepertiga al-Qur'an.\" Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2900,
			"arabicnumber": 2900,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Yazid bin Kaisan] telah menceritakan kepada kami [Abu Hazim] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berkumpullah, aku akan membacakan sepertiga al-Qur'an pada kalian.\" Abu Hurairah mengatakan; \"Orang-orang pun berkumpul, lalu Nabiyullah keluar, lalu beliau membaca QUL HUWALLAAHU AHAD, setelah itu beliau masuk. Maka sebagaian orang berkata pada yang lain; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku akan membacakan seperti al-Qur'an pada kalian, \" dan menurutku, ini adalah kabar dari langit. Setelah itu Nabiyullah keluar sambil bersabda: \"Aku tadi bersabda bahwa aku akan membaca sepertiga al-Qur'an untuk kalian, ingat, sesungguhnya ia menyamai sepertiga al-Qur'an.\" Abu Isa berkata; Hadits ini hasan shahih gharib melalui jalur ini. Abu Hatim Al Asyja'i namanya adalah Salman",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2901,
			"arabicnumber": 2901,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Isma'il bin Abu Uwais] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Ubaidullah bin Umar] dari [Tsabit Al Bunanni] dari [Anas bin Malik] ia berkata; \"Seorang sahabat Anshar mengimami mereka di Masjid Quba`, setiap kali mengawali untuk membaca surat (setelah al fatihah -pent) dalam shalat, ia selalu memulainya dengan membaca QUL HUWALLAHU AHAD hingga selesai, lalu ia melanjutkan dengan surat yang lain, dan ia selalu melakukannya di setiap rakaat. Lantas para sahabatnya berbicara padanya, kata mereka; \"Kamu membaca surat itu lalu menurutmu itu tidak mencukupimu, hingga kamu melanjutkannya dengan surat yang lain, bacalah surat tersebut atau tinggalkan lalu bacalah surat yang lain!.\" Sahabat Anshar itu berkata; \"Aku tidak akan meninggalkannya, bila kalian ingin aku menjadi imam kalian dengan membacanya, maka aku akan melakukannya dan bila kalian tidak suka, aku akan meninggalkan kalian.\" Sementara mereka menilainya sebagai orang yang paling mulia di antara mereka, maka mereka tidak ingin diimami oleh orang lain. Saat Nabi shallallahu 'alaihi wasallam mendatangi mereka, mereka memberitahukan masalah itu, lalu beliau bersabda: \"Hai fulan, apa yang menghalangimu untuk melakukan yang diperintahkan teman-temanmu dan apa yang mendorongmu membaca surat itu disetiap rakaat?\" ia menjawab; \"Wahai Rasulullah, sesungguhnya aku menyukainya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya mencintainya akan memasukkanmu ke dalam surga.\" Abu Isa berkata; Hadits ini hasan gharib, shahih dari jalur ini dari hadits 'Ubaidullah bin Umar dari Tsabit. [Mubarak bin Fadlalah] meriwayatkan dari [Tsabit] dari [Anas] bahwa seseorang berkata; \"Wahai Rasulullah, sesungguhnya aku menyukai surat ini, yaitu QUL HUWALLAAHU AHAD.\" Beliau bersabda: \"Sesungguhnya mencintainya akan memasukkanmu ke dalam surga.\" Telah menceritakan kepada kami [Abu Dawud Sulaiman bin Al Asy'ats] seperti itu, telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Mubarak bin Fadlalah] seperti ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2902,
			"arabicnumber": 2902,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Isma'il bin Abu Khalid] telah mengabarkan kepadaku [Qais bin Abu Hazim] dari ['Uqbah bin Amir Al Juhani] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Allah menurunkan beberapa ayat yang belum pernah ditemukan bandingannya, yaitu; QUL A'UUDZU BIRABBIN NAAS hingga akhir surat dan QUL A'UUDZU BIRABBIL FALAQ hingga akhir surat.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2903,
			"arabicnumber": 2903,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Yazid bin Abu Habib] dari [Ali bin Rabah] dari ['Uqbah bin Amir] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kepadaku agar aku membaca AL MU'AWWIDZATAIN (surat Al Falaq dan An Naas) setiap selesai shalat.\" Abu Isa berkata; Hadits ini hasan gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2904,
			"arabicnumber": 2904,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] telah menceritakan kepada kami [Syu'bah] dan [Hisyam] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang membaca al Qur'an dan ia mahir membacanya, maka ia akan bersama golongan orang-orang mulia lagi baik sedangkan orang yang membacanya -Hisyam berkata; dengan susah, sementara Syu'bah mengatakan; dengan berat- maka ia akan mendapat dua pahala.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2905,
			"arabicnumber": 2905,
			"text": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Hafs bin Sulaiman] dari [Katsir bin Zadzan] dari ['Ashim bin Dlamrah] dari [Ali bin Abu Thalib] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca Al Qur`an kemudian dia menghafalnya dan menghalalkan apa yang dihalalkan Al Qur`an serta mengharamkan apa yang diharamkan Al Qur`an, niscaya dengannya Allah akan memasukkannya ke dalam surga dan dapat memberi syafa'at kepada sepuluh keluarganya yang wajib masuk neraka.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur ini, padahal sanadnya tidak shahih, Hafs bin Sulaiman telah dilemahkan dalam masalah hadits",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Very Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2906,
			"arabicnumber": 2906,
			"text": "Telah menceritakan kepada kami [Abdu bin Humaid] telah menceritakan kepada kami [Husain bin Ali Al Ju'fi] ia berkata; Aku mendengar [Hamzah Az Zayyat] dari [Abu Al Mukhtar Ath Tha`i] dari [Ibnu Akhi Al Harits Al A'war] dari [Al Harits] ia berkata; \"Aku pernah lewat masjid, sedangkan orang-orang tengah larut dalam pembicaraan yang bathil, lalu aku menemui [Ali], aku berkata; \"Wahai Amirul Mukminin, apa anda tidak melihat orang-orang tengah larut dalam pembicaraan yang bathil (dengan mengabaikan membaca Al Qur'an -pent)?, \" Ali bertanya; \"Apakah mereka telah melakukannya?\" Aku menjawab; \"Ya.\" Ali berkata; \"Ingatlah, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ingatlah, sesungguhnya akan terjadi fitnah.\" Lalu aku bertanya; \"Bagaimana solusinya wahai Rasulullah?\" beliau menjawab: \"Kitab Allah, di dalamnya ada kisah tentang peristiwa sebelum kalian, dan setelah kalian, hukum perkara diantara kalian, ia adalah (firman) yang memisahkan (antara yang hak dan yang bathil), bukan senda gurau, barangsiapa meninggalkannya karena bersikap sombong, maka Allah akan membinasakannya, dan barangsiapa mencari petunjuk pada selainnya, maka Allah akan menyesatkannya, ia adalah tali Allah yang kokoh, ia adalah peringatan yang bijaksana, ia adalah jalan yang lurus, dengannya keinginan-keinginan tidak akan menyimpang dan dengannya lisan-lisan tidak akan samar, ulama tidak pernah puas darinya, tidak usang meski sering diulang-ulang dan keajaiban-keajaibannya tidak kunjung habis, ia juga yang menyebabkan jin-jin tidak berhenti mendengarnya hingga mereka berkata; \"Sesungguhnya kami telah mendengarkan Al Qur`an yang menakjubkan, (yang) memberi petunjuk kapada jalan yang benar, lalu kami beriman kepadanya.\" (Al-Jinn: 1-2), barangsiapa berkata dengannya, maka ia benar, barangsiapa mengamalkannya, maka ia diberi pahala, barangsiapa memutuskan perkara dengannya, maka ia adil dan barangsiapa menyeru kepadanya, maka ia diberi petunjuk menuju jalan yang lurus, ambillah ia untukmu, wahai A'war.\" Abu Isa berkata; Hadits ini gharib, kami hanya mengetahuinya dari jalur ini, sanadnya majhul (tidak diketahui) dan Al Harits diperbincangkan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2907,
			"arabicnumber": 2907,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] telah memberitakan kepada kami [Syu'bah] telah mengabarkan kepadaku ['Alqamah bin Martsad] ia berkata; Aku mendengar [Sa'd bin 'Ubaidah] bercerita dari [Abu Abdurrahman] dari [Utsman bin Affan] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kalian adalah yang mempelajari al-Qur'an dan mengajarkannya.\" Abu Abdurrahman berkata; \"Itulah yang membuatku duduk ditempat dudukku ini.\" Abu Abdurrahman masih tetap mengajar al-Qur'an dimasa Utsman hingga masa Al Hajjaj bin Yusuf.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2908,
			"arabicnumber": 2908,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Bisyr bin As Suri] telah menceritakan kepada kami [Sufyan] dari ['Alqamah bin Martsad] dari [Abu Abdurrahman As Sulami] dari [Utsman bin Affan] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kalian atau seutama-utama kalian adalah yang belajar al Qur'an dan mengajarkannya.\" Abu Isa berkata; Hadits ini hasan shahih. Seperti itulah [Abdurrahman bin Mahdi] dan lainnya meriwayatkan dari [Sufyan Ats Tsauri] dari ['Alqamah bin Martsad] dari [Abu Abdurrahman] dari [Utsman] dari Nabi shallallahu 'alaihi wasallam. Sufyan tidak menyebutkan; \"Dari Sa'd bin 'Ubaidah. [Yahya bin Sa'id Al Qaththan] meriwayatkan hadits ini dari [Sufyan] dan [Syu'bah] dari ['Alqamah bin Martsad] dari [Sa'd bin 'Ubaidah] dari [Abu Abdurrahman] dari [Utsman] dari Nabi shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Muhammad bin Basyar] seperti itu, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dan [Syu'bah]. Muhammad bin Basyar berkata; Seperti itu yang disebutkan Yahya bin Sa'id dari Sufyan dan Syu'bah bukan hanya sekali, dari 'Alqmah bin Martsad dari Sa'ad bin 'Ubaidah dari Abu Abdurrahman dari Utsman dari Nabi shallallahu 'alaihi wasallam. Muhammad bin Basyar dan sahabat-sahabat Sufyan tidak menyebutkan; \"Dari Sufyan dari Sa'ad bin 'Ubaidah.\" Muhammad bin Basyar berkata; \"Itu lebih shahih.\" Abu Isa berkata; \"Syu'bah menambahkan Sa'ad bin Ubaidah dalam sanadnya hadits ini, sepertinya hadits Sufyan lebih shahih.\" Ali bin Abdullah berkata; Yahya bin Abu Sa'id berkata; Menurutku, tidak ada seorang pun yang menyamai Syu'bah, namun apabila Sufyan berbeda pandangan dengannya, aku mengambil perkataan Sufyan.\" Abu Isa berkata; Aku mendengar Abu 'Ammar meriwayatkan dari Waki', ia berkata; Syu'bah berkata; Sufyan lebih hafal dariku, dan hadits yang diceritakan padaku oleh Sufyan dari seseorang, lalu aku tanyakan padanya melainkan aku temukan seperti yang ia ceritakan kepadaku. Dalam hal ini ada hadits serupa dari Ali dan Sa'd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2909,
			"arabicnumber": 2909,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] dari [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'd] dari [Ali bin Abu Thalib] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kalian adalah yang mempelajari al-Qur'an dan mengajarkannya.\" Abu Isa berkata; Hadits ini tidak kami ketahui dari hadits Ali dari Nabi shallallahu 'alaihi wasallam kecuali dari hadits Abdurrahman bin Ishaq",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2910,
			"arabicnumber": 2910,
			"text": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Bakar Al Hanafi] telah menceritakan kepada kami [Adl dlahhak bin Utsman] dari [Ayyub bin Musa] ia berkata; Aku mendengar [Muhammad bin Ka'ab Al Quradli] berkata; Aku mendengar [Abdullah bin Mas'ud] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca satu huruf dari Kitabullah (Al Qur`an), maka baginya satu pahala kebaikan dan satu pahala kebaikan akan dilipat gandakan menjadi sepuluh kali, aku tidak mengatakan ALIF LAAM MIIM itu satu huruf, akan tetapi ALIF satu huruf, LAAM satu huruf dan MIIM satu huruf.\" Selain jalur ini, hadits ini juga diriwayatkan dari beberapa jalur dari sahabat Ibnu Mas'ud. Abul Ahwas telah meriwayatkan hadits ini dari Ibnu Mas'ud, sebagian perawi merafa'kannya (menyambungkannya sampai kepada Nabi) dan sebaian yang lainnya mewaqafkannya dari sahabat Ibnu Mas'ud. Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini, aku telah mendengar Qutaibah berkata; telah sampai berita kepadaku bahwa Muhammad bin Ka'ab Al Quradli dilahirkan pada masa Nabi shallallahu 'alaihi wasallam masih hidup, dan Muhammad bin Ka'ab di juluki dengan Abu Hamzah",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2911,
			"arabicnumber": 2911,
			"text": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Abu An Nadlr] telah menceritakan kepada kami [Bakr bin Khunais] dari [Laits bin Abu Sulaim] dari [Zaid bin Arthah] dari [Abu Umamah] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Allah tidak mengizinkan seorang hamba pun dalam suatu hal yang lebih baik dari shalat dua rakaat yang ia lakukan, sesungguhnya kebaikan itu dibiarkan di atas kepala hamba selama ia berada dalam shalatnya dan tidaklah seorang hamba mendekatkan diri kepada Allah dapat menyamai sesuatu yang keluar darinya (dari Al Qur'an).\" Abu An Nadl berkata; Maksud beliau adalah al Qur'an. Abu Isa berkata; Hadits ini gharib, kami hanya mengetahuinya dari jalur ini. Bakr bin Khunais diperbincangkan oleh Ibnu Al Mubarak dan meninggalkannya di akhir hayatnya. Hadits ini juga diriwayatkan dari Zaid bin Arthah dari Jubair bin Nufair dari Nabi shallallahu 'alaihi wasallam secara mursal. Telah menceritakan kepada kami [Ishaq bin Manshur] seperti itu, telah menceritakan kepada kami [Abdurahman bin Mahdi] dari [Mu'awiyah] dari [Al Ala` bin Al Harits] dari [Zaid bin Arthah] dari [Jubair bin Nufair] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kalian tidak akan kembali kepada Allah dengan membawa seuatu yang lebih baik dari apa yang keluar darinya.\" maksud beliau al-Qur'an",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2912,
			"arabicnumber": 2912,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2913,
			"arabicnumber": 2913,
			"text": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Jarir] dari [Qabus bin Abu Dlabyan] dari [Ayahnya] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang di dalam dirinya tidak ada sedikit pun al-Qur'an ibarat rumah yang runtuh.\" Abu Isa berkata; Hadits ini hasan shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2914,
			"arabicnumber": 2914,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud Al Hafari] dan [Abu Nu'aim] dari [Sufyan] dari ['Ashim bin Abu Najud] dari [Zirr] dari [Abdullah bin 'Amru] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Kelak akan dikatakan kepada ahli Al Qur`an; Bacalah dan naiklah, kemudian bacalah dengan tartil sebagaimana kamu membacanya ketika di dunia, karena sesungguhnya tempatmu ada pada akhir ayat yang kamu baca.\" Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Bundar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari ['Ashim] dengan sanad dan maksud yang sama",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2915,
			"arabicnumber": 2915,
			"text": "Telah menceritakan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [Abdushshamad bin Abdul Warits] telah mengabarkan kepada kami [Syu'bah] dari ['Ashim] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Pada hari kiyamat, Al Qur`an akan datang kemudian berkata; \"Wahai Rabb berilah dia pakaian, \" maka dipakaikanlah kepadanya mahkota kemuliaan, kemudian Al Qur`an berkata lagi; \"Wahai Rabb, tambahkanlah kepadanya, \" maka dipakaikan kepadanya pakaian kemuliaan, kemudian berkata lagi; \"Wahai Rabb ridlailah dia, \" akhirnya dia pun diridlai, kemudian dikatakan kepada ahli Al Qur`an; \"Bacalah dan naiklah, niscaya akan ditambahkan kepadamu satu pahala kebaikan pada setiap ayat.\" Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari ['Ashim bin Bahdalah] dari [Abu Shalih] dari [Abu Hurairah] dengan hadits yang semakna, namun dia tidak merafa'kannya. Abu Isa berkata; Hadits ini lebih shahih dari hadits Abdusshamad dari Syu'bah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2916,
			"arabicnumber": 2916,
			"text": "Telah menceritakan kepada kami [Abdul Wahab bin Al Hakam Al Warrak Al Baghdadi] telah menceritakan kepada kami [Abdul Majid bin Abdul Aziz] dari [Ibnu Juraij] dari [Al Muthallib bin Hanthab] dari [Anas bin Malik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pahala-pahala ummatku ditampakkan kepadaku, hingga pahala seseorang yang membuang debu dari masjid, dan ditampakkan kepadaku dosa-dosa ummatku, maka tidak aku lihat dosa yang lebih besar dari satu surat atau satu ayat yang diberikan kepada seseorang kemudian dia melupakannya.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur ini. Perawi berkata; Aku menyebutkan hadits ini kepada Muhammad bin Isma'il, namun dia tidak mengetahuinya bahkan menganggap hadits ini gharib (sendirian), Muhammad berkata; Aku tidak mengetahui kalau Al Muthallib bin Abdullah pernah mendengar dari salah seorang sahabat Nabi shallallahu 'alaihi wasallam, selain perkataannya, telah menceritakan kepadaku orang yang menyaksikan khutbah Nabi shallallahu 'alaihi wasallam.\" Perawi juga berkata; Aku mendengar Abdullah bin Abdurrahman berkata; \"Kami tidak mengetahui kalau Abdul Muthallib pernah mendengar dari salah seorang sahabat Nabi shallallahu 'alaihi wasallam.\" Abdullah berkata; Ali bin Al Madini mengingkari Al Muthallib bila dia pernah mendengar dari Anas",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il Al Washiti] telah menceritakan kepada kami [Waqi'] telah menceritakan kepada kami [Abu Farwah Yazid bin Sinan] dari [Abu Al Mubarak] dari [Shuhaib] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak beriman kepada Al Qur`an orang yang menghalalkan apa yang diharamkan Al Qur`an.\" Abu Isa berkata; Hadits ini sanadnya tidak kuat, karena riwayat Waqi' tidak seperti itu. Muhammad berkata; Abu Farwah Yazid bin Sinan Ar Rahawi haditsnya tidak apa-apa kecuali yang diriwayatkan anaknya, Muhammad, karena anaknya telah meriwayatkan hadits-hadits munkar darinya. Abu Isa berkata; [Muhammad bin Yazid bin Sinan] telah meriwayatkan hadits ini dari [Ayahnya] kemudian dia menambahkan dalam sanadnya: Dari [Mujahid] dari [Sa'id bin Al Musayyib] dari [Shuhaib], padahal tidak ada yang menguatkan riwayat Muhammad bin Yazid, karena dia perawi yang lemah, sedangkan Abu Al Mubarak adalah seorang lelaki yang tidak diketahui",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2919,
			"arabicnumber": 2919,
			"text": "Telah menceritakan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Katsir bin Murrah Al Hadlrami] dari ['Uqbah bin Amir] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seseorang yang membaca al-Qur'an dengan suara keras seperti orang yang menampak-nampakkan sedekah, sedangkan orang yang membaca al-Qur'an dengan suara lirih, seperti orang yang bersedekah dengan sembunyi-sembunyi.\" Abu Isa berkata; Hadits ini hasan gharib. Makna hadits ini adalah; \"Orang yang membaca al-Qur'an dengan suara lirih lebih baik dari yang membaca dengan suara keras, karena sedekah sembunyi-sembunyi itu lebih baik dari sedekah dengan terang-terangan menurut para ulama. Sedangkan menurut ulama mengenai makna hadits ini adalah agar seseorang terhindar dari sifat ujub, karena orang yang melakukan amalan dengan sembunyi-sembunyi itu tidak dikhawatirkan ujub seperti bila dilakukan secara terang-terangan",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2920,
			"arabicnumber": 2920,
			"text": "",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2921,
			"arabicnumber": 2921,
			"text": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Baqiyyah bin Al Walid] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Abdullah bin Abu Bilal] dari [Irbadl bin Sariyah] ia menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam membaca surat-surat Al Musabbihaat sebelum tidur, kemudian beliau bersabda: \"Sesungguhnya pada surat-surat tersebut terdapat ayat yang lebih baik dari seribu ayat.\" Abu Isa berkata; Hadits ini hasan gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Hasan"
				},
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2922,
			"arabicnumber": 2922,
			"text": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Ahmad Az Zubairi] telah menceritakan kepada kami [Khalid bin Thaman Abu Al Ala` Al Khaffaf] telah menceritakan kepadaku [Nafi' bin Abu Nafi'] dari [Ma'qil bin Yasar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membaca tiga kali di pagi hari, A'UUDZU BILLAAHI MINASY SYAITHAANIR RAJIIM kemudian membaca tiga ayat terakhir surat Al Hasyr, maka dengannya Allah akan menugaskan tujuhpuluh ribu malikat untuk mendoakannya hingga sore hari dan bila ia meninggal pada hari itu, ia mati dalam keadaan syahid dan barangsiapa mengucapkannya di sore hati, kedudukannya sama seperti itu.\" Abu Isa berkata; Hadits ini gharib, kami hanya mengetahuinya melalui sanad ini",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2923,
			"arabicnumber": 2923,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Abdullah bin 'Ubaidullah bin Abu Malikah] dari [Ya'la bin Mamlak] bahwa ia pernah bertanya kepada [Ummu Salamah istri Nabi] shallallahu 'alaihi wasallam, tentang bacaan dan shalatnya Nabi shallallahu 'alaihi wasallam, Ummu Salamah menjawab; \"Apa urusan kalian dengan shalat beliau?, beliau shalat lalu tidur seukuran lamanya beliau shalat, setelah itu beliau shalat seukuran lamanya beliau tidur, kemudian beliau tidur seukuran lamanya beliau shalat hingga shubuh.\" Lalu Ummu Salamah menyebut bacaan beliau, ternyata ia menyebut bacaan yang dijelaskan satu huruf demi satu huruf.\" Abu Isa berkata; Hadits ini hasan shahih gharib, kami hanya mengetahuinya dari hadits Laits bin Sa'ad dari Ibnu Abu Mulaikah dari Ya'la bin Mamlak dari Ummu Salamah. [Ibnu Juraij] meriwayatkan hadits ini dari [Ibnu Abu Malikah] dari [Ummu Salamah] bahwa Nabi shallallahu 'alaihi wasallam memotong-motong bacaan beliau, sedangkan hadits Laits lebih shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2924,
			"arabicnumber": 2924,
			"text": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Muawiyah bin Shalih] dari [Abdullah bin Abu Qais] seorang penduduk Bashrah, ia berkata; Aku bertanya kepada ['Aisyah] tentang shalat witir Rasulullah shallallahu 'alaihi wasallam; \"Bagaimana beliau shalat witir, apakah di permulaan malam atau di akhirnya?\" 'Aisyah menjawab; \"Semua itu pernah beliau lakukan, kadang beliau shalat witir di awal malam dan kadang shalat witir di akhirnya.\" Aku berkata; \"Segala puji bagi Allah yang memberikan keleluasaan dalam masalah ini, lalu aku bertanya; \"Bagaimana bacaan beliau? Apakah beliau membaca lirih atau dengan suara keras?\" 'Aisyah menjawab; \"Semua itu juga pernah beliau lakukan, kadang beliau membaca lirih dan kadang dengan suara keras.\" Aku berkata; \"Segala puji bagi Allah yang memberikan keleluasaan dalam masalah ini.\" Aku bertanya lagi; \"Bagaimana yang beliau lakukan ketika jinabat? Apakah beliau mandi sebelum tidur atau tidur sebelum mandi?\" 'Aisyah menjawab; \"Semua itu juga pernah beliau lakukan, kadang beliau mandi lalu tidur dan kadang wudlu lalu tidur.\" Aku menjawab; \"Segala puji bagi Allah yang memberikan keleluasaan dalam masalah ini.\" Abu Isa berkata; Melalui jalur ini, hadits ini hasan gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2925,
			"arabicnumber": 2925,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] ia berkata; telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Israil] telah menceritakan kepada kami [Utsman bin Al Mughirah] dari [Salim bin Abu Al Ja'd] dari [Jabir] ia berkata; Nabi shallallahu 'alaihi wasallam menempatkan diri beliau di Mauqif, lalu bersabda: \"Adakah seseorang yang hendak membawaku ke kaumnya?, karena Quraisy melarangku menyampaikan firman Rabbku.\" Abu Isa berkata; Hadits ini gharib shahih",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Sahih"
				},
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2926,
			"arabicnumber": 2926,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Syihab bin 'Abbad Al 'Abdi] telah menceritakan kepada kami [Muhammad bin Al Hasan bin Abu Yazid Al Hamdani] dari ['Amru bin Qais] dari ['Athiyyah] dari [Abu Sa'id] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb Azza wa Jalla berfirman; \"Barangsiapa disibukkan oleh Al Qur`an dan berdzikir kepadaku untuk memohon kepadaKu, maka Aku akan memberikan kepadanya sesuatu yang terbaik dari yang Aku berikan kepada orang-orang yang memohon, \" dan kelebihan kalamullah (Al Qur`an) dari seluruh kalam adalah seperti kelebihan Allah dari seluruh makhlukNya.\" Abu Isa berkata; Hadits ini hasan gharib",
			"grades": [
				{
					"name": "Ahmad Muhammad Shakir",
					"grade": "Daif"
				},
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Bashar Awad Maarouf",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 52
			}
		}
	]
}