{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"1": "The Times of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1,
			"arabicnumber": 1,
			"text": "قال حدثني يحيى بن يحيى الليثي، عن مالك بن أنس، عن ابن شهاب، أن عمر بن عبد العزيز، أخر الصلاة يوما فدخل عليه عروة بن الزبير فأخبره أن المغيرة بن شعبة أخر الصلاة يوما وهو بالكوفة فدخل عليه أبو مسعود الأنصاري فقال ما هذا يا مغيرة أليس قد علمت أن جبريل نزل فصلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم قال ‏ \"‏ بهذا أمرت ‏\"‏ ‏.‏ فقال عمر بن عبد العزيز اعلم ما تحدث به يا عروة أو إن جبريل هو الذي أقام لرسول الله صلى الله عليه وسلم وقت الصلاة قال عروة كذلك كان بشير بن أبي مسعود الأنصاري يحدث عن أبيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2,
			"arabicnumber": 2,
			"text": "قال عروة ولقد حدثتني عائشة زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان يصلي العصر والشمس في حجرتها قبل أن تظهر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 3,
			"arabicnumber": 3,
			"text": "وحدثني يحيى، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، أنه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن وقت صلاة الصبح قال فسكت عنه رسول الله صلى الله عليه وسلم حتى إذا كان من الغد صلى الصبح حين طلع الفجر ثم صلى الصبح من الغد بعد أن أسفر ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ قال ها أنا ذا يا رسول الله ‏.‏ فقال ‏\"‏ ما بين هذين وقت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 4,
			"arabicnumber": 4,
			"text": "وحدثني يحيى، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء متلفعات بمروطهن ما يعرفن من الغلس ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 5,
			"arabicnumber": 5,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، كلهم يحدثونه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أدرك ركعة من الصبح قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 6,
			"arabicnumber": 6,
			"text": "وحدثني عن مالك، عن نافع، مولى عبد الله بن عمر أن عمر بن الخطاب، كتب إلى عماله إن أهم أمركم عندي الصلاة فمن حفظها وحافظ عليها حفظ دينه ومن ضيعها فهو لما سواها أضيع ‏.‏ ثم كتب أن صلوا الظهر إذا كان الفىء ذراعا إلى أن يكون ظل أحدكم مثله والعصر والشمس مرتفعة بيضاء نقية قدر ما يسير الراكب فرسخين أو ثلاثة قبل غروب الشمس والمغرب إذا غربت الشمس والعشاء إذا غاب الشفق إلى ثلث الليل فمن نام فلا نامت عينه فمن نام فلا نامت عينه فمن نام فلا نامت عينه والصبح والنجوم بادية مشتبكة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 7,
			"arabicnumber": 7,
			"text": "وحدثني عن مالك، عن عمه أبي سهيل، عن أبيه، أن عمر بن الخطاب، كتب إلى أبي موسى أن صل الظهر، إذا زاغت الشمس والعصر والشمس بيضاء نقية قبل أن يدخلها صفرة والمغرب إذا غربت الشمس وأخر العشاء ما لم تنم وصل الصبح والنجوم بادية مشتبكة واقرأ فيها بسورتين طويلتين من المفصل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 8,
			"arabicnumber": 8,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، أن عمر بن الخطاب، كتب إلى أبي موسى الأشعري أن صل العصر، والشمس، بيضاء نقية قدر ما يسير الراكب ثلاثة فراسخ وأن صل العشاء ما بينك وبين ثلث الليل فإن أخرت فإلى شطر الليل ولا تكن من الغافلين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 9,
			"arabicnumber": 9,
			"text": "وحدثني عن مالك، عن يزيد بن زياد، عن عبد الله بن رافع، مولى أم سلمة زوج النبي صلى الله عليه وسلم أنه سأل أبا هريرة عن وقت الصلاة فقال أبو هريرة أنا أخبرك صل الظهر إذا كان ظلك مثلك والعصر إذا كان ظلك مثليك والمغرب إذا غربت الشمس والعشاء ما بينك وبين ثلث الليل وصل الصبح بغبش ‏.‏ يعني الغلس ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 10,
			"arabicnumber": 10,
			"text": "وحدثني عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه قال كنا نصلي العصر ثم يخرج الإنسان إلى بني عمرو بن عوف فيجدهم يصلون العصر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 11,
			"arabicnumber": 11,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن أنس بن مالك، أنه قال كنا نصلي العصر ثم يذهب الذاهب إلى قباء فيأتيهم والشمس مرتفعة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 12,
			"arabicnumber": 12,
			"text": "وحدثني عن مالك، عن ربيعة بن أبي عبد الرحمن، عن القاسم بن محمد، أنه قال ما أدركت الناس إلا وهم يصلون الظهر بعشي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 13,
			"arabicnumber": 13,
			"text": "حدثني يحيى، عن مالك، عن عمه أبي سهيل بن مالك، عن أبيه، أنه قال كنت أرى طنفسة لعقيل بن أبي طالب يوم الجمعة تطرح إلى جدار المسجد الغربي فإذا غشي الطنفسة كلها ظل الجدار خرج عمر بن الخطاب وصلى الجمعة - قال مالك والد أبي سهيل - ثم نرجع بعد صلاة الجمعة فنقيل قائلة الضحاء ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 14,
			"arabicnumber": 14,
			"text": "وحدثني عن مالك، عن عمرو بن يحيى المازني، عن ابن أبي سليط، أن عثمان بن عفان، صلى الجمعة بالمدينة وصلى العصر بملل ‏.‏ قال مالك وذلك للتهجير وسرعة السير ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 15,
			"arabicnumber": 15,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أدرك ركعة من الصلاة فقد أدرك الصلاة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 16,
			"arabicnumber": 16,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر بن الخطاب، كان يقول إذا فاتتك الركعة فقد فاتتك السجدة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 17,
			"arabicnumber": 17,
			"text": "وحدثني عن مالك، أنه بلغه أن عبد الله بن عمر، وزيد بن ثابت، كانا يقولان من أدرك الركعة فقد أدرك السجدة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 18,
			"arabicnumber": 18,
			"text": "وحدثني يحيى، عن مالك، أنه بلغه أن أبا هريرة، كان يقول من أدرك الركعة فقد أدرك السجدة ومن فاته قراءة أم القرآن فقد فاته خير كثير ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 19,
			"arabicnumber": 19,
			"text": "حدثني يحيى، عن مالك، عن نافع، أن عبد الله بن عمر، كان يقول دلوك الشمس ميلها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 20,
			"arabicnumber": 20,
			"text": "وحدثني عن مالك، عن داود بن الحصين، قال أخبرني مخبر، أن عبد الله بن عباس، كان يقول دلوك الشمس إذا فاء الفىء وغسق الليل اجتماع الليل وظلمته ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 21,
			"arabicnumber": 21,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الذي تفوته صلاة العصر كأنما وتر أهله وماله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 22,
			"arabicnumber": 22,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن عمر بن الخطاب، انصرف من صلاة العصر فلقي رجلا لم يشهد العصر فقال عمر ما حبسك عن صلاة العصر فذكر له الرجل عذرا فقال عمر طففت ‏.‏ قال يحيى قال مالك ويقال لكل شىء وفاء وتطفيف ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 23,
			"arabicnumber": 23,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه كان يقول إن المصلي ليصلي الصلاة وما فاته وقتها ولما فاته من وقتها أعظم - أو أفضل - من أهله وماله ‏.‏ قال يحيى قال مالك من أدرك الوقت وهو في سفر فأخر الصلاة ساهيا أو ناسيا حتى قدم على أهله أنه إن كان قدم على أهله وهو في الوقت فليصل صلاة المقيم وإن كان قد قدم وقد ذهب الوقت فليصل صلاة المسافر لأنه إنما يقضي مثل الذي كان عليه ‏.‏ قال مالك وهذا الأمر هو الذي أدركت عليه الناس وأهل العلم ببلدنا ‏.‏ وقال مالك الشفق الحمرة التي في المغرب فإذا ذهبت الحمرة فقد وجبت صلاة العشاء وخرجت من وقت المغرب ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 24,
			"arabicnumber": 24,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، أغمي عليه فذهب عقله فلم يقض الصلاة ‏.‏ قال مالك وذلك فيما نرى - والله أعلم - أن الوقت قد ذهب فأما من أفاق في الوقت فإنه يصلي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 25,
			"arabicnumber": 25,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم حين قفل من خيبر أسرى حتى إذا كان من آخر الليل عرس وقال لبلال ‏\"‏ اكلألنا الصبح ‏\"‏ ‏.‏ ونام رسول الله صلى الله عليه وسلم وأصحابه وكلأ بلال ما قدر له ثم استند إلى راحلته وهو مقابل الفجر فغلبته عيناه فلم يستيقظ رسول الله صلى الله عليه وسلم ولا بلال ولا أحد من الركب حتى ضربتهم الشمس ففزع رسول الله صلى الله عليه وسلم فقال بلال يا رسول الله أخذ بنفسي الذي أخذ بنفسك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقتادوا ‏\"‏ ‏.‏ فبعثوا رواحلهم واقتادوا شيئا ثم أمر رسول الله صلى الله عليه وسلم بلالا فأقام الصلاة فصلى بهم رسول الله صلى الله عليه وسلم الصبح ثم قال حين قضى الصلاة ‏\"‏ من نسي الصلاة فليصلها إذا ذكرها فإن الله تبارك وتعالى يقول في كتابه ‏{‏أقم الصلاة لذكري ‏}‏ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 26,
			"arabicnumber": 26,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، أنه قال عرس رسول الله صلى الله عليه وسلم ليلة بطريق مكة ووكل بلالا أن يوقظهم للصلاة فرقد بلال ورقدوا حتى استيقظوا وقد طلعت عليهم الشمس فاستيقظ القوم وقد فزعوا فأمرهم رسول الله صلى الله عليه وسلم أن يركبوا حتى يخرجوا من ذلك الوادي وقال ‏\"‏ إن هذا واد به شيطان ‏\"‏ ‏.‏ فركبوا حتى خرجوا من ذلك الوادي ثم أمرهم رسول الله صلى الله عليه وسلم أن ينزلوا وأن يتوضئوا وأمر بلالا أن ينادي بالصلاة أو يقيم فصلى رسول الله صلى الله عليه وسلم بالناس ثم انصرف إليهم وقد رأى من فزعهم فقال ‏\"‏ يا أيها الناس إن الله قبض أرواحنا ولو شاء لردها إلينا في حين غير هذا فإذا رقد أحدكم عن الصلاة أو نسيها ثم فزع إليها فليصلها كما كان يصليها في وقتها ‏\"‏ ‏.‏ ثم التفت رسول الله صلى الله عليه وسلم إلى أبي بكر فقال ‏\"‏ إن الشيطان أتى بلالا وهو قائم يصلي فأضجعه فلم يزل يهدئه كما يهدأ الصبي حتى نام ‏\"‏ ‏.‏ ثم دعا رسول الله صلى الله عليه وسلم بلالا فأخبر بلال رسول الله صلى الله عليه وسلم مثل الذي أخبر رسول الله صلى الله عليه وسلم أبا بكر فقال أبو بكر أشهد أنك رسول الله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 27,
			"arabicnumber": 27,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن شدة الحر من فيح جهنم فإذا اشتد الحر فأبردوا عن الصلاة ‏\"‏ ‏.‏ وقال ‏\"‏ اشتكت النار إلى ربها فقالت يا رب أكل بعضي بعضا ‏.‏ فأذن لها بنفسين في كل عام نفس في الشتاء ونفس في الصيف ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 28,
			"arabicnumber": 28,
			"text": "وحدثنا مالك، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، وعن محمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا اشتد الحر فأبردوا عن الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏ وذكر ‏\"‏ أن النار اشتكت إلى ربها فأذن لها في كل عام بنفسين نفس في الشتاء ونفس في الصيف ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 29,
			"arabicnumber": 29,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا اشتد الحر فأبردوا عن الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 30,
			"arabicnumber": 30,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أكل من هذه الشجرة فلا يقرب مساجدنا يؤذينا بريح الثوم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 31,
			"arabicnumber": 31,
			"text": "وحدثني عن مالك، عن عبد الرحمن بن المجبر، أنه كان يرى سالم بن عبد الله إذا رأى الإنسان يغطي فاه وهو يصلي جبذ الثوب عن فيه جبذا شديدا حتى ينزعه عن فيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 31
			}
		}
	]
}