{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"11": "The Fear Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 441,
			"arabicnumber": 441,
			"text": "حدثني يحيى، عن مالك، عن يزيد بن رومان، عن صالح بن خوات، عمن صلى مع رسول الله صلى الله عليه وسلم يوم ذات الرقاع صلاة الخوف أن طائفة صفت معه وصفت طائفة وجاه العدو فصلى بالتي معه ركعة ثم ثبت قائما وأتموا لأنفسهم ثم انصرفوا فصفوا وجاه العدو وجاءت الطائفة الأخرى فصلى بهم الركعة التي بقيت من صلاته ثم ثبت جالسا وأتموا لأنفسهم ثم سلم بهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 441
			}
		},
		{
			"hadithnumber": 442,
			"arabicnumber": 442,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن القاسم بن محمد، عن صالح بن خوات، أن سهل بن أبي حثمة، حدثه أن صلاة الخوف أن يقوم الإمام ومعه طائفة من أصحابه وطائفة مواجهة العدو فيركع الإمام ركعة ويسجد بالذين معه ثم يقوم فإذا استوى قائما ثبت وأتموا لأنفسهم الركعة الباقية ثم يسلمون وينصرفون والإمام قائم فيكونون وجاه العدو ثم يقبل الآخرون الذين لم يصلوا فيكبرون وراء الإمام فيركع بهم الركعة ويسجد ثم يسلم فيقومون فيركعون لأنفسهم الركعة الباقية ثم يسلمون ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 442
			}
		},
		{
			"hadithnumber": 443,
			"arabicnumber": 443,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان إذا سئل عن صلاة الخوف، قال يتقدم الإمام وطائفة من الناس فيصلي بهم الإمام ركعة وتكون طائفة منهم بينه وبين العدو لم يصلوا فإذا صلى الذين معه ركعة استأخروا مكان الذين لم يصلوا ولا يسلمون ويتقدم الذين لم يصلوا فيصلون معه ركعة ثم ينصرف الإمام وقد صلى ركعتين فتقوم كل واحدة من الطائفتين فيصلون لأنفسهم ركعة ركعة بعد أن ينصرف الإمام فيكون كل واحدة من الطائفتين قد صلوا ركعتين فإن كان خوفا هو أشد من ذلك صلوا رجالا قياما على أقدامهم أو ركبانا مستقبلي القبلة أو غير مستقبليها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 443
			}
		},
		{
			"hadithnumber": 444,
			"arabicnumber": 444,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه قال ما صلى رسول الله صلى الله عليه وسلم الظهر والعصر يوم الخندق حتى غابت الشمس ‏.‏ قال مالك وحديث القاسم بن محمد عن صالح بن خوات أحب ما سمعت إلى في صلاة الخوف ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 444
			}
		}
	]
}