{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"16": "Burials"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 520,
			"arabicnumber": 520,
			"text": "حدثني يحيى، عن مالك، عن جعفر بن محمد، عن أبيه، أن رسول الله صلى الله عليه وسلم غسل في قميص ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 520
			}
		},
		{
			"hadithnumber": 521,
			"arabicnumber": 521,
			"text": "وحدثني عن مالك، عن أيوب بن أبي تميمة السختياني، عن محمد بن سيرين، عن أم عطية الأنصارية، قالت دخل علينا رسول الله صلى الله عليه وسلم حين توفيت ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر واجعلن في الآخرة كافورا أو شيئا من كافور فإذا فرغتن فآذنني ‏\"‏ ‏.‏ قالت فلما فرغنا آذناه فأعطانا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏ تعني بحقوه إزاره ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 521
			}
		},
		{
			"hadithnumber": 522,
			"arabicnumber": 522,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 522
			}
		},
		{
			"hadithnumber": 523,
			"arabicnumber": 523,
			"text": "حدثني يحيى، عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كفن في ثلاثة أثواب بيض سحولية ليس فيها قميص ولا عمامة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 523
			}
		},
		{
			"hadithnumber": 524,
			"arabicnumber": 524,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن رسول الله صلى الله عليه وسلم كفن في ثلاثة أثواب بيض سحولية ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 524
			}
		},
		{
			"hadithnumber": 525,
			"arabicnumber": 525,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه قال بلغني أن أبا بكر الصديق، قال لعائشة وهو مريض في كم كفن رسول الله صلى الله عليه وسلم فقالت في ثلاثة أثواب بيض سحولية ‏.‏ فقال أبو بكر خذوا هذا الثوب - لثوب عليه قد أصابه مشق أو زعفران - فاغسلوه ثم كفنوني فيه مع ثوبين آخرين ‏.‏ فقالت عائشة وما هذا فقال أبو بكر الحى أحوج إلى الجديد من الميت وإنما هذا للمهلة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 525
			}
		},
		{
			"hadithnumber": 526,
			"arabicnumber": 526,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن بن عوف، عن عبد الله بن عمرو بن العاص، أنه قال الميت يقمص ويؤزر ويلف في الثوب الثالث فإن لم يكن إلا ثوب واحد كفن فيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 526
			}
		},
		{
			"hadithnumber": 527,
			"arabicnumber": 527,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، أن رسول الله صلى الله عليه وسلم وأبا بكر وعمر كانوا يمشون أمام الجنازة والخلفاء هلم جرا وعبد الله بن عمر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 527
			}
		},
		{
			"hadithnumber": 528,
			"arabicnumber": 528,
			"text": "وحدثني عن مالك، عن محمد بن المنكدر، عن ربيعة بن عبد الله بن الهدير، أنه أخبره أنه، رأى عمر بن الخطاب يقدم الناس أمام الجنازة في جنازة زينب بنت جحش ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 528
			}
		},
		{
			"hadithnumber": 529,
			"arabicnumber": 529,
			"text": "وحدثني يحيى، عن مالك، عن هشام بن عروة، قال ما رأيت أبي قط في جنازة إلا أمامها - قال - ثم يأتي البقيع فيجلس حتى يمروا عليه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 529
			}
		},
		{
			"hadithnumber": 530,
			"arabicnumber": 530,
			"text": "وحدثني عن مالك، عن ابن شهاب، أنه قال المشى خلف الجنازة من خطإ السنة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 530
			}
		},
		{
			"hadithnumber": 531,
			"arabicnumber": 531,
			"text": "حدثني يحيى، عن مالك، عن هشام بن عروة، عن أسماء بنت أبي بكر، أنها قالت لأهلها أجمروا ثيابي إذا مت ثم حنطوني ولا تذروا على كفني حناطا ولا تتبعوني بنار ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 531
			}
		},
		{
			"hadithnumber": 532,
			"arabicnumber": 532,
			"text": "وحدثني عن مالك، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، أنه نهى أن يتبع، بعد موته بنار ‏.‏ قال يحيى سمعت مالكا يكره ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 532
			}
		},
		{
			"hadithnumber": 533,
			"arabicnumber": 533,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نعى النجاشي للناس في اليوم الذي مات فيه وخرج بهم إلى المصلى فصف بهم وكبر أربع تكبيرات ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 533
			}
		},
		{
			"hadithnumber": 534,
			"arabicnumber": 534,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن أبي أمامة بن سهل بن حنيف، أنه أخبره أن مسكينة مرضت فأخبر رسول الله صلى الله عليه وسلم - بمرضها وكان رسول الله صلى الله عليه وسلم يعود المساكين ويسأل عنهم - فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ماتت فآذنوني بها ‏\"‏ ‏.‏ فخرج بجنازتها ليلا فكرهوا أن يوقظوا رسول الله صلى الله عليه وسلم فلما أصبح رسول الله صلى الله عليه وسلم أخبر بالذي كان من شأنها فقال ‏\"‏ ألم آمركم أن تؤذنوني بها ‏\"‏ ‏.‏ فقالوا يا رسول الله كرهنا أن نخرجك ليلا ونوقظك ‏.‏ فخرج رسول الله صلى الله عليه وسلم حتى صف بالناس على قبرها وكبر أربع تكبيرات ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 534
			}
		},
		{
			"hadithnumber": 535,
			"arabicnumber": 535,
			"text": "وحدثني عن مالك، أنه سأل ابن شهاب عن الرجل، يدرك بعض التكبير على الجنازة ويفوته بعضه فقال يقضي ما فاته من ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 535
			}
		},
		{
			"hadithnumber": 536,
			"arabicnumber": 536,
			"text": "حدثني يحيى، عن مالك، عن سعيد بن أبي سعيد المقبري، عن أبيه، أنه سأل أبا هريرة كيف تصلي على الجنازة فقال أبو هريرة أنا لعمر الله، أخبرك أتبعها، من أهلها فإذا وضعت كبرت وحمدت الله وصليت على نبيه ثم أقول اللهم إنه عبدك وابن عبدك وابن أمتك كان يشهد أن لا إله إلا أنت وأن محمدا عبدك ورسولك وأنت أعلم به اللهم إن كان محسنا فزد في إحسانه وإن كان مسيئا فتجاوز عن سيئاته اللهم لا تحرمنا أجره ولا تفتنا بعده ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 536
			}
		},
		{
			"hadithnumber": 537,
			"arabicnumber": 537,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه قال سمعت سعيد بن المسيب، يقول صليت وراء أبي هريرة على صبي لم يعمل خطيئة قط فسمعته يقول اللهم أعذه من عذاب القبر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 537
			}
		},
		{
			"hadithnumber": 538,
			"arabicnumber": 538,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان لا يقرأ في الصلاة على الجنازة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 538
			}
		},
		{
			"hadithnumber": 539,
			"arabicnumber": 539,
			"text": "وحدثني يحيى، عن مالك، عن محمد بن أبي حرملة، مولى عبد الرحمن بن أبي سفيان بن حويطب أن زينب بنت أبي سلمة، توفيت - وطارق أمير المدينة - فأتي بجنازتها بعد صلاة الصبح فوضعت بالبقيع ‏.‏ قال وكان طارق يغلس بالصبح ‏.‏ قال ابن أبي حرملة فسمعت عبد الله بن عمر يقول لأهلها إما أن تصلوا على جنازتكم الآن وإما أن تتركوها حتى ترتفع الشمس ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 539
			}
		},
		{
			"hadithnumber": 540,
			"arabicnumber": 540,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، قال يصلى على الجنازة بعد العصر وبعد الصبح إذا صليتا لوقتهما ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 540
			}
		},
		{
			"hadithnumber": 541,
			"arabicnumber": 541,
			"text": "حدثني يحيى، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله عن عائشة، زوج النبي صلى الله عليه وسلم أنها أمرت أن يمر عليها بسعد بن أبي وقاص في المسجد حين مات لتدعو له فأنكر ذلك الناس عليها فقالت عائشة ما أسرع الناس ما صلى رسول الله صلى الله عليه وسلم على سهيل ابن بيضاء إلا في المسجد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 541
			}
		},
		{
			"hadithnumber": 542,
			"arabicnumber": 542,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أنه قال صلي على عمر بن الخطاب في المسجد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 542
			}
		},
		{
			"hadithnumber": 543,
			"arabicnumber": 543,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عثمان بن عفان، وعبد الله بن عمر، وأبا، هريرة كانوا يصلون على الجنائز بالمدينة الرجال والنساء فيجعلون الرجال مما يلي الإمام والنساء مما يلي القبلة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 543
			}
		},
		{
			"hadithnumber": 544,
			"arabicnumber": 544,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان إذا صلى على الجنائز يسلم حتى يسمع من يليه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 544
			}
		},
		{
			"hadithnumber": 545,
			"arabicnumber": 545,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان يقول لا يصلي الرجل على الجنازة إلا وهو طاهر ‏.‏ قال يحيى سمعت مالكا يقول لم أر أحدا من أهل العلم يكره أن يصلى على ولد الزنا وأمه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 545
			}
		},
		{
			"hadithnumber": 546,
			"arabicnumber": 546,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن رسول الله صلى الله عليه وسلم توفي يوم الاثنين ودفن يوم الثلاثاء وصلى الناس عليه أفذاذا لا يؤمهم أحد ‏.‏ فقال ناس يدفن عند المنبر ‏.‏ وقال آخرون يدفن بالبقيع ‏.‏ فجاء أبو بكر الصديق فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ ما دفن نبي قط إلا في مكانه الذي توفي فيه ‏\"‏ ‏.‏ فحفر له فيه فلما كان عند غسله أرادوا نزع قميصه فسمعوا صوتا يقول لا تنزعوا القميص فلم ينزع القميص وغسل وهو عليه صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 546
			}
		},
		{
			"hadithnumber": 547,
			"arabicnumber": 547,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، أنه قال كان بالمدينة رجلان أحدهما يلحد والآخر لا يلحد فقالوا أيهما جاء أول عمل عمله ‏.‏ فجاء الذي يلحد فلحد لرسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 547
			}
		},
		{
			"hadithnumber": 548,
			"arabicnumber": 548,
			"text": "وحدثني عن مالك، أنه بلغه أن أم سلمة، زوج النبي صلى الله عليه وسلم كانت تقول ما صدقت بموت النبي صلى الله عليه وسلم حتى سمعت وقع الكرازين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 548
			}
		},
		{
			"hadithnumber": 549,
			"arabicnumber": 549,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن عائشة، زوج النبي صلى الله عليه وسلم قالت رأيت ثلاثة أقمار سقطن في حجرتي فقصصت رؤياى على أبي بكر الصديق قالت فلما توفي رسول الله صلى الله عليه وسلم ودفن في بيتها قال لها أبو بكر هذا أحد أقمارك وهو خيرها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 549
			}
		},
		{
			"hadithnumber": 550,
			"arabicnumber": 550,
			"text": "وحدثني عن مالك، عن غير، واحد، ممن يثق به أن سعد بن أبي وقاص وسعيد بن زيد بن عمرو بن نفيل توفيا بالعقيق وحملا إلى المدينة ودفنا بها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 550
			}
		},
		{
			"hadithnumber": 551,
			"arabicnumber": 551,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، أنه قال ما أحب أن أدفن، بالبقيع لأن أدفن بغيره أحب إلى من أن أدفن به إنما هو أحد رجلين إما ظالم فلا أحب أن أدفن معه وإما صالح فلا أحب أن تنبش لي عظامه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 551
			}
		},
		{
			"hadithnumber": 552,
			"arabicnumber": 552,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، عن واقد بن عمرو بن سعد بن معاذ، عن نافع بن جبير بن مطعم، عن مسعود بن الحكم، عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم كان يقوم في الجنائز ثم جلس بعد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 552
			}
		},
		{
			"hadithnumber": 553,
			"arabicnumber": 553,
			"text": "وحدثني عن مالك، أنه بلغه أن علي بن أبي طالب، كان يتوسد القبور ويضطجع عليها ‏.‏ قال مالك وإنما نهي عن القعود على القبور فيما نرى للمذاهب ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 553
			}
		},
		{
			"hadithnumber": 554,
			"arabicnumber": 554,
			"text": "وحدثني عن مالك، عن أبي بكر بن عثمان بن سهل بن حنيف، أنه سمع أبا أمامة بن سهل بن حنيف، يقول كنا نشهد الجنائز فما يجلس آخر الناس حتى يؤذنوا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 554
			}
		},
		{
			"hadithnumber": 555,
			"arabicnumber": 555,
			"text": "حدثني يحيى، عن مالك، عن عبد الله بن عبد الله بن جابر بن عتيك، عن عتيك بن الحارث، - وهو جد عبد الله بن عبد الله بن جابر أبو أمه - أنه أخبره أن جابر بن عتيك أخبره أن رسول الله صلى الله عليه وسلم جاء يعود عبد الله بن ثابت فوجده قد غلب عليه فصاح به فلم يجبه فاسترجع رسول الله صلى الله عليه وسلم وقال ‏\"‏ غلبنا عليك يا أبا الربيع ‏\"‏ ‏.‏ فصاح النسوة وبكين فجعل جابر يسكتهن ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعهن فإذا وجب فلا تبكين باكية ‏\"‏ ‏.‏ قالوا يا رسول الله وما الوجوب قال ‏\"‏ إذا مات ‏\"‏ ‏.‏ فقالت ابنته والله إن كنت لأرجو أن تكون شهيدا فإنك كنت قد قضيت جهازك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله قد أوقع أجره على قدر نيته وما تعدون الشهادة ‏\"‏ ‏.‏ قالوا القتل في سبيل الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الشهداء سبعة سوى القتل في سبيل الله المطعون شهيد والغرق شهيد وصاحب ذات الجنب شهيد والمبطون شهيد والحرق شهيد والذي يموت تحت الهدم شهيد والمرأة تموت بجمع شهيد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 555
			}
		},
		{
			"hadithnumber": 556,
			"arabicnumber": 556,
			"text": "وحدثني عن مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرة بنت عبد الرحمن، أنها أخبرته أنها، سمعت عائشة أم المؤمنين، تقول وذكر لها أن عبد الله بن عمر يقول إن الميت ليعذب ببكاء الحى ‏.‏ فقالت عائشة يغفر الله لأبي عبد الرحمن أما إنه لم يكذب ولكنه نسي أو أخطأ إنما مر رسول الله صلى الله عليه وسلم بيهودية يبكي عليها أهلها فقال ‏ \"‏ إنكم لتبكون عليها وإنها لتعذب في قبرها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 556
			}
		},
		{
			"hadithnumber": 557,
			"arabicnumber": 557,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يموت لأحد من المسلمين ثلاثة من الولد فتمسه النار إلا تحلة القسم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 557
			}
		},
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "وحدثني عن مالك، عن محمد بن أبي بكر بن عمرو بن حزم، عن أبيه، عن أبي النضر السلمي، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يموت لأحد من المسلمين ثلاثة من الولد فيحتسبهم إلا كانوا جنة من النار ‏\"‏ ‏.‏ فقالت امرأة عند رسول الله صلى الله عليه وسلم يا رسول الله أو اثنان قال ‏\"‏ أو اثنان ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 558
			}
		},
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "وحدثني عن مالك، أنه بلغه عن أبي الحباب، سعيد بن يسار عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما يزال المؤمن يصاب في ولده وحامته حتى يلقى الله وليست له خطيئة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 559
			}
		},
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "حدثني يحيى، عن مالك، عن عبد الرحمن بن القاسم بن محمد بن أبي بكر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليعز المسلمين في مصائبهم المصيبة بي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 560
			}
		},
		{
			"hadithnumber": 561,
			"arabicnumber": 561,
			"text": "وحدثني عن مالك، عن ربيعة بن أبي عبد الرحمن، عن أم سلمة، زوج النبي صلى الله عليه وسلم، أن رسول الله صلى الله عليه وسلم قال من أصابته مصيبة فقال كما أمر الله (إنا لله وإنا إليه راجعون) اللهم أجرني في مصيبتي وأعقبني خيرا منها إلا فعل الله ذلك به قالت أم سلمة فلما توفي أبو سلمة قلت ذلك ثم قلت ومن خير من أبي سلمة فأعقبها الله رسوله صلى الله عليه وسلم فتزوجها",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 561
			}
		},
		{
			"hadithnumber": 562,
			"arabicnumber": 562,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن القاسم بن محمد، أنه قال هلكت امرأة لي فأتاني محمد بن كعب القرظي يعزيني بها فقال إنه كان في بني إسرائيل رجل فقيه عالم عابد مجتهد وكانت له امرأة - وكان بها معجبا ولها محبا - فماتت فوجد عليها وجدا شديدا ولقي عليها أسفا حتى خلا في بيت وغلق على نفسه واحتجب من الناس فلم يكن يدخل عليه أحد وإن امرأة سمعت به فجاءته فقالت إن لي إليه حاجة أستفتيه فيها ليس يجزيني فيها إلا مشافهته فذهب الناس ولزمت بابه وقالت ما لي منه بد ‏.‏ فقال له قائل إن ها هنا امرأة أرادت أن تستفتيك وقالت إن أردت إلا مشافهته وقد ذهب الناس وهي لا تفارق الباب ‏.‏ فقال ائذنوا لها ‏.‏ فدخلت عليه فقالت إني جئتك أستفتيك في أمر ‏.‏ قال وما هو قالت إني استعرت من جارة لي حليا فكنت ألبسه وأعيره زمانا ثم إنهم أرسلوا إلى فيه أفأؤديه إليهم فقال نعم والله ‏.‏ فقالت إنه قد مكث عندي زمانا ‏.‏ فقال ذلك أحق لردك إياه إليهم حين أعاروكيه زمانا ‏.‏ فقالت أى يرحمك الله أفتأسف على ما أعارك الله ثم أخذه منك وهو أحق به منك فأبصر ما كان فيه ونفعه الله بقولها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 562
			}
		},
		{
			"hadithnumber": 563,
			"arabicnumber": 563,
			"text": "حدثني يحيى، عن مالك، عن أبي الرجال، محمد بن عبد الرحمن عن أمه، عمرة بنت عبد الرحمن أنه سمعها تقول، لعن رسول الله صلى الله عليه وسلم المختفي والمختفية يعني نباش القبور ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 563
			}
		},
		{
			"hadithnumber": 564,
			"arabicnumber": 564,
			"text": "وحدثني عن مالك، أنه بلغه أن عائشة، زوج النبي صلى الله عليه وسلم كانت تقول كسر عظم المسلم ميتا ككسره وهو حى ‏.‏ تعني في الإثم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 564
			}
		},
		{
			"hadithnumber": 565,
			"arabicnumber": 565,
			"text": "حدثني يحيى، عن مالك، عن هشام بن عروة، عن عباد بن عبد الله بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أنها سمعت رسول الله صلى الله عليه وسلم قبل أن يموت وهو مستند إلى صدرها وأصغت إليه يقول ‏ \"‏ اللهم اغفر لي وارحمني وألحقني بالرفيق الأعلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 565
			}
		},
		{
			"hadithnumber": 566,
			"arabicnumber": 566,
			"text": "وحدثني عن مالك، أنه بلغه أن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من نبي يموت حتى يخير ‏\"‏ ‏.‏ قالت فسمعته يقول ‏\"‏ اللهم الرفيق الأعلى ‏\"‏ ‏.‏ فعرفت أنه ذاهب ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 566
			}
		},
		{
			"hadithnumber": 567,
			"arabicnumber": 567,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، قال إن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إن أحدكم إذا مات عرض عليه مقعده بالغداة والعشي إن كان من أهل الجنة فمن أهل الجنة وإن كان من أهل النار فمن أهل النار يقال له هذا مقعدك حتى يبعثك الله إلى يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 567
			}
		},
		{
			"hadithnumber": 568,
			"arabicnumber": 568,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ كل ابن آدم تأكله الأرض إلا عجب الذنب منه خلق وفيه يركب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 568
			}
		},
		{
			"hadithnumber": 569,
			"arabicnumber": 569,
			"text": "وحدثني عن مالك عن ابن شهاب عن عبد الرحمن بن كعب بن مالك الأنصاري أنه أخبره أن أباه كعب بن مالك كان يحدث أن رسول الله صلى الله عليه وسلم قال إنما نسمة المؤمن طير يعلق في شجر الجنة حتى يرجعه الله إلى جسده يوم يبعثه",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 569
			}
		},
		{
			"hadithnumber": 570,
			"arabicnumber": 570,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال الله تبارك وتعالى إذا أحب عبدي لقائي أحببت لقاءه وإذا كره لقائي كرهت لقاءه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 570
			}
		},
		{
			"hadithnumber": 571,
			"arabicnumber": 571,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ قال رجل لم يعمل حسنة قط لأهله إذا مات فحرقوه ثم اذروا نصفه في البر ونصفه في البحر فوالله لئن قدر الله عليه ليعذبنه عذابا لا يعذبه أحدا من العالمين ‏.‏ فلما مات الرجل فعلوا ما أمرهم به فأمر الله البر فجمع ما فيه وأمر البحر فجمع ما فيه ثم قال لم فعلت هذا قال من خشيتك يا رب وأنت أعلم ‏.‏ قال فغفر له ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 571
			}
		},
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ كل مولود يولد على الفطرة فأبواه يهودانه أو ينصرانه، كما تناتج الإبل من بهيمة جمعاء هل تحس فيها من جدعاء ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله أرأيت الذي يموت وهو صغير قال ‏:‏ ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 572
			}
		},
		{
			"hadithnumber": 573,
			"arabicnumber": 573,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏ \"‏ لا تقوم الساعة حتى يمر الرجل بقبر الرجل فيقول يا ليتني مكانه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 573
			}
		},
		{
			"hadithnumber": 574,
			"arabicnumber": 574,
			"text": "وحدثني عن مالك، عن محمد بن عمرو بن حلحلة الديلي، عن معبد بن كعب بن مالك، عن أبي قتادة بن ربعي، أنه كان يحدث ‏:‏ أن رسول الله صلى الله عليه وسلم مر عليه بجنازة فقال ‏:‏ ‏\"‏ مستريح ومستراح منه ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله ما المستريح والمستراح منه قال ‏:‏ ‏\"‏ العبد المؤمن يستريح من نصب الدنيا وأذاها إلى رحمة الله، والعبد الفاجر يستريح منه العباد والبلاد والشجر والدواب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 574
			}
		},
		{
			"hadithnumber": 575,
			"arabicnumber": 575,
			"text": "وحدثني عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أنه قال ‏:‏ قال رسول الله صلى الله عليه وسلم لما مات عثمان بن مظعون ومر بجنازته ‏:‏ ‏ \"‏ ذهبت ولم تلبس منها بشىء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 575
			}
		},
		{
			"hadithnumber": 576,
			"arabicnumber": 576,
			"text": "وحدثني مالك، عن علقمة بن أبي علقمة، عن أمه، أنها قالت سمعت عائشة، زوج النبي صلى الله عليه وسلم تقول ‏:‏ قام رسول الله صلى الله عليه وسلم ذات ليلة فلبس ثيابه ثم خرج - قالت - فأمرت جاريتي بريرة تتبعه، فتبعته حتى جاء البقيع، فوقف في أدناه ما شاء الله أن يقف، ثم انصرف فسبقته بريرة فأخبرتني، فلم أذكر له شيئا حتى أصبح ثم ذكرت ذلك له فقال ‏:‏ ‏ \"‏ إني بعثت إلى أهل البقيع لأصلي عليهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 576
			}
		},
		{
			"hadithnumber": 577,
			"arabicnumber": 577,
			"text": "وحدثني عن مالك، عن نافع، أن أبا هريرة، قال ‏:‏ أسرعوا بجنائزكم، فإنما هو خير تقدمونه إليه أو شر تضعونه عن رقابكم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 16,
				"hadith": 577
			}
		}
	]
}