{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"17": "Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 578,
			"arabicnumber": 578,
			"text": "حدثني عن مالك، عن عمرو بن يحيى المازني، عن أبيه، أنه قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ ليس فيما دون خمس ذود صدقة، وليس فيما دون خمس أواق صدقة، وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 578
			}
		},
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "وحدثني عن مالك، عن محمد بن عبد الله بن عبد الرحمن بن أبي صعصعة الأنصاري، ثم المازني عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏ \"‏ ليس فيما دون خمسة أوسق من التمر صدقة، وليس فيما دون خمس أواقي من الورق صدقة، وليس فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 579
			}
		},
		{
			"hadithnumber": 580,
			"arabicnumber": 580,
			"text": "وحدثني عن مالك، أنه بلغه ‏:‏ أن عمر بن عبد العزيز، كتب إلى عامله على دمشق في الصدقة ‏:‏ إنما الصدقة في الحرث والعين والماشية ‏.‏ قال مالك ‏:‏ ولا تكون الصدقة إلا في ثلاثة أشياء ‏:‏ في الحرث والعين والماشية ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 580
			}
		},
		{
			"hadithnumber": 581,
			"arabicnumber": 581,
			"text": "حدثني يحيى، عن مالك، عن محمد بن عقبة، مولى الزبير ‏:‏ أنه سأل القاسم بن محمد عن مكاتب، له قاطعه بمال عظيم هل عليه فيه زكاة فقال القاسم ‏:‏ إن أبا بكر الصديق لم يكن يأخذ من مال زكاة حتى يحول عليه الحول ‏.‏ قال القاسم بن محمد ‏:‏ وكان أبو بكر إذا أعطى الناس أعطياتهم يسأل الرجل هل عندك من مال وجبت عليك فيه الزكاة فإذا قال ‏:‏ نعم، أخذ من عطائه زكاة ذلك المال، وإن قال ‏:‏ لا، أسلم إليه عطاءه ولم يأخذ منه شيئا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 581
			}
		},
		{
			"hadithnumber": 582,
			"arabicnumber": 582,
			"text": "وحدثني عن مالك، عن عمر بن حسين، عن عائشة بنت قدامة، عن أبيها، أنه قال ‏:‏ كنت إذا جئت عثمان بن عفان أقبض عطائي سألني ‏:‏ هل عندك من مال وجبت عليك فيه الزكاة قال فإن قلت ‏:‏ نعم أخذ من عطائي زكاة ذلك المال، وإن قلت ‏:‏ لا، دفع إلى عطائي ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 582
			}
		},
		{
			"hadithnumber": 583,
			"arabicnumber": 583,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان يقول ‏:‏ لا تجب في مال زكاة حتى يحول عليه الحول ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 583
			}
		},
		{
			"hadithnumber": 584,
			"arabicnumber": 584,
			"text": "وحدثني عن مالك، عن ابن شهاب، أنه قال ‏:‏ أول من أخذ من الأعطية الزكاة معاوية بن أبي سفيان ‏.‏ قال مالك ‏:‏ السنة التي لا اختلاف فيها عندنا أن الزكاة تجب في عشرين دينارا عينا كما تجب في مائتى درهم ‏.‏ قال مالك ‏:‏ ليس في عشرين دينارا ناقصة بينة النقصان زكاة، فإن زادت حتى تبلغ بزيادتها عشرين دينارا وازنة ففيها الزكاة، وليس فيما دون عشرين دينارا عينا الزكاة، وليس في مائتى درهم ناقصة بينة النقصان زكاة، فإن زادت حتى تبلغ بزيادتها مائتى درهم وافية ففيها الزكاة، فإن كانت تجوز بجواز الوازنة رأيت فيها الزكاة دنانير كانت أو دراهم ‏.‏ قال مالك في رجل كانت عنده ستون ومائة درهم وازنة وصرف الدراهم ببلده ثمانية دراهم بدينار ‏:‏ أنها لا تجب فيها الزكاة، وإنما تجب الزكاة في عشرين دينارا عينا أو مائتى درهم ‏.‏ قال مالك في رجل كانت له خمسة دنانير من فائدة أو غيرها، فتجر فيها فلم يأت الحول حتى بلغت ما تجب فيه الزكاة ‏:‏ أنه يزكيها وإن لم تتم إلا قبل أن يحول عليها الحول بيوم واحد، أو بعد ما يحول عليها الحول بيوم واحد، ثم لا زكاة فيها حتى يحول عليها الحول من يوم زكيت ‏.‏ وقال مالك في رجل كانت له عشرة دنانير فتجر فيها فحال عليها الحول وقد بلغت عشرين دينارا ‏:‏ أنه يزكيها مكانها ولا ينتظر بها أن يحول عليها الحول من يوم بلغت ما تجب فيه الزكاة لأن الحول قد حال عليها وهي عنده عشرون ثم لا زكاة فيها حتى يحول عليها الحول من يوم زكيت قال مالك الأمر المجتمع عليه عندنا في إجارة العبيد وخراجهم وكراء المساكين وكتابة المكاتب أنه لا تجب في شيء من ذلك الزكاة قل ذلك أو كثر حتى يحول عليه الحول من يوم يقبضه صاحبه. وقال مالك في الذهب والورق يكون بين الشركاء إن من بلغت حصته منهم عشرين دينارا عينا أو مائتي درهم فعليه فيها الزكاة ومن نقصت حصته عما تجب فيه الزكاة فلا زكاة عليه وإن بلغت حصصهم جميعا ما تجب فيه الزكاة وكان بعضهم في ذلك أفضل نصيبا من بعض أخذ من كل إنسان منهم بقدر حصته إذا كان في حصة كل إنسان منهم ما تجب فيه الزكاة وذلك أن رسول الله صلى الله عليه وسلم قال ليس فيما دون خمس أواق من الورق صدقة قال مالك وهذا أحب ما سمعت إلي في ذلك قال مالك وإذا كانت لرجل ذهب أو ورق متفرقة بأيدي أناس شتى فإنه ينبغي له أن يحصيها جميعا ثم يخرج ما وجب عليه من زكاتها كلها قال مالك ومن أفاد ذهبا أو ورقا إنه لا زكاة عليه فيها حتى يحول عليها الحول من يوم أفادها",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 584
			}
		},
		{
			"hadithnumber": 585,
			"arabicnumber": 585,
			"text": "حدثني يحيى، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن غير، واحد، أن رسول الله صلى الله عليه وسلم قطع لبلال بن الحارث المزني معادن القبلية - وهي من ناحية الفرع - فتلك المعادن لا يؤخذ منها إلى اليوم إلا الزكاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 585
			}
		},
		{
			"hadithnumber": 586,
			"arabicnumber": 586,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، وعن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ في الركاز الخمس ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 586
			}
		},
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "حدثني يحيى، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، أن عائشة، زوج النبي صلى الله عليه وسلم كانت تلي بنات أخيها يتامى في حجرها لهن الحلى فلا تخرج من حليهن الزكاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 587
			}
		},
		{
			"hadithnumber": 588,
			"arabicnumber": 588,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان يحلي بناته وجواريه الذهب ثم لا يخرج من حليهن الزكاة ‏.‏ قال مالك من كان عنده تبر أو حلى من ذهب أو فضة لا ينتفع به للبس فإن عليه فيه الزكاة في كل عام يوزن فيؤخذ ربع عشره إلا أن ينقص من وزن عشرين دينارا عينا أو مائتى درهم فإن نقص من ذلك فليس فيه زكاة وإنما تكون فيه الزكاة إذا كان إنما يمسكه لغير اللبس فأما التبر والحلي المكسور الذي يريد أهله إصلاحه ولبسه فإنما هو بمنزلة المتاع الذي يكون عند أهله فليس على أهله فيه زكاة ‏.‏ قال مالك ليس في اللؤلؤ ولا في المسك ولا العنبر زكاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 588
			}
		},
		{
			"hadithnumber": 589,
			"arabicnumber": 589,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عمر بن الخطاب، قال اتجروا في أموال اليتامى لا تأكلها الزكاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 589
			}
		},
		{
			"hadithnumber": 590,
			"arabicnumber": 590,
			"text": "وحدثني عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، أنه قال كانت عائشة تليني وأخا لي يتيمين في حجرها فكانت تخرج من أموالنا الزكاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 590
			}
		},
		{
			"hadithnumber": 591,
			"arabicnumber": 591,
			"text": "وحدثني عن مالك، أنه بلغه أن عائشة، زوج النبي صلى الله عليه وسلم كانت تعطي أموال اليتامى الذين في حجرها من يتجر لهم فيها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 591
			}
		},
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه اشترى لبني أخيه - يتامى في حجره - مالا فبيع ذلك المال بعد بمال كثير ‏.‏ قال مالك لا بأس بالتجارة في أموال اليتامى لهم إذا كان الولي مأذونا فلا أرى عليه ضمانا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 592
			}
		},
		{
			"hadithnumber": 593,
			"arabicnumber": 593,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن السائب بن يزيد، أن عثمان بن عفان، كان يقول هذا شهر زكاتكم فمن كان عليه دين فليؤد دينه حتى تحصل أموالكم فتؤدون منه الزكاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 593
			}
		},
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "وحدثني عن مالك، عن أيوب بن أبي تميمة السختياني، أن عمر بن عبد العزيز، كتب في مال قبضه بعض الولاة ظلما يأمر برده إلى أهله ويؤخذ زكاته لما مضى من السنين ثم عقب بعد ذلك بكتاب أن لا يؤخذ منه إلا زكاة واحدة فإنه كان ضمارا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 594
			}
		},
		{
			"hadithnumber": 595,
			"arabicnumber": 595,
			"text": "وحدثني عن مالك، عن يزيد بن خصيفة، أنه سأل سليمان بن يسار عن رجل، له مال وعليه دين مثله أعليه زكاة فقال لا ‏.‏ قال مالك الأمر الذي لا اختلاف فيه عندنا في الدين أن صاحبه لا يزكيه حتى يقبضه وإن أقام عند الذي هو عليه سنين ذوات عدد ثم قبضه صاحبه لم تجب عليه إلا زكاة واحدة فإن قبض منه شيئا لا تجب فيه الزكاة فإنه إن كان له مال سوى الذي قبض تجب فيه الزكاة فإنه يزكى مع ما قبض من دينه ذلك ‏.‏ قال وإن لم يكن له ناض غير الذي اقتضى من دينه وكان الذي اقتضى من دينه لا تجب فيه الزكاة فلا زكاة عليه فيه ولكن ليحفظ عدد ما اقتضى فإن اقتضى بعد ذلك عدد ما تتم به الزكاة مع ما قبض قبل ذلك فعليه فيه الزكاة ‏.‏ قال فإن كان قد استهلك ما اقتضى أولا أو لم يستهلكه فالزكاة واجبة عليه مع ما اقتضى من دينه فإذا بلغ ما اقتضى عشرين دينارا عينا أو مائتى درهم فعليه فيه الزكاة ثم ما اقتضى بعد ذلك من قليل أو كثير فعليه الزكاة بحسب ذلك ‏.‏ قال مالك والدليل على الدين يغيب أعواما ثم يقتضى فلا يكون فيه إلا زكاة واحدة أن العروض تكون عند الرجل للتجارة أعواما ثم يبيعها فليس عليه في أثمانها إلا زكاة واحدة وذلك أنه ليس على صاحب الدين أو العروض أن يخرج زكاة ذلك الدين أو العروض من مال سواه وإنما يخرج زكاة كل شىء منه ولا يخرج الزكاة من شىء عن شىء غيره ‏.‏ قال مالك الأمر عندنا في الرجل يكون عليه دين وعنده من العروض ما فيه وفاء لما عليه من الدين ويكون عنده من الناض سوى ذلك ما تجب فيه الزكاة فإنه يزكي ما بيده من ناض تجب فيه الزكاة وإن لم يكن عنده من العروض والنقد إلا وفاء دينه فلا زكاة عليه حتى يكون عنده من الناض فضل عن دينه ما تجب فيه الزكاة فعليه أن يزكيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 595
			}
		},
		{
			"hadithnumber": 596,
			"arabicnumber": 596,
			"text": "حدثني عن مالك، عن يحيى بن سعيد، عن زريق بن حيان، - وكان زريق على جواز مصر في زمان الوليد وسليمان وعمر بن عبد العزيز - فذكر أن عمر بن عبد العزيز كتب إليه أن انظر من مر بك من المسلمين فخذ مما ظهر من أموالهم مما يديرون من التجارات من كل أربعين دينارا دينارا فما نقص فبحساب ذلك حتى يبلغ عشرين دينارا فإن نقصت ثلث دينار فدعها ولا تأخذ منها شيئا ومن مر بك من أهل الذمة فخذ مما يديرون من التجارات من كل عشرين دينارا دينارا فما نقص فبحساب ذلك حتى يبلغ عشرة دنانير فإن نقصت ثلث دينار فدعها ولا تأخذ منها شيئا واكتب لهم بما تأخذ منهم كتابا إلى مثله من الحول ‏.‏ قال مالك الأمر عندنا فيما يدار من العروض للتجارات أن الرجل إذا صدق ماله ثم اشترى به عرضا بزا أو رقيقا أو ما أشبه ذلك ثم باعه قبل أن يحول عليه الحول فإنه لا يؤدي من ذلك المال زكاة حتى يحول عليه الحول من يوم صدقه وأنه إن لم يبع ذلك العرض سنين لم يجب عليه في شىء من ذلك العرض زكاة وإن طال زمانه فإذا باعه فليس فيه إلا زكاة واحدة ‏.‏ قال مالك الأمر عندنا في الرجل يشتري بالذهب أو الورق حنطة أو تمرا أو غيرهما للتجارة ثم يمسكها حتى يحول عليها الحول ثم يبيعها أن عليه فيها الزكاة حين يبيعها إذا بلغ ثمنها ما تجب فيه الزكاة وليس ذلك مثل الحصاد يحصده الرجل من أرضه ولا مثل الجداد ‏.‏ قال مالك وما كان من مال عند رجل يديره للتجارة ولا ينض لصاحبه منه شىء تجب عليه فيه الزكاة فإنه يجعل له شهرا من السنة يقوم فيه ما كان عنده من عرض للتجارة ويحصي فيه ما كان عنده من نقد أو عين فإذا بلغ ذلك كله ما تجب فيه الزكاة فإنه يزكيه ‏.‏ وقال مالك ومن تجر من المسلمين ومن لم يتجر سواء ليس عليهم إلا صدقة واحدة في كل عام تجروا فيه أو لم يتجروا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 596
			}
		},
		{
			"hadithnumber": 597,
			"arabicnumber": 597,
			"text": "حدثني يحيى، عن مالك، عن عبد الله بن دينار، أنه قال سمعت عبد الله بن عمر، وهو يسأل عن الكنز، ما هو فقال هو المال الذي لا تؤدى منه الزكاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 597
			}
		},
		{
			"hadithnumber": 598,
			"arabicnumber": 598,
			"text": "وحدثني عن مالك، عن عبد الله بن دينار، عن أبي صالح السمان، عن أبي هريرة، أنه كان يقول من كان عنده مال لم يؤد زكاته مثل له يوم القيامة شجاعا أقرع له زبيبتان يطلبه حتى يمكنه يقول أنا كنزك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 598
			}
		},
		{
			"hadithnumber": 599,
			"arabicnumber": 599,
			"text": "حدثني يحيى، عن مالك، أنه قرأ كتاب عمر بن الخطاب في الصدقة قال فوجدت فيه بسم الله الرحمن الرحيم كتاب الصدقة في أربع وعشرين من الإبل فدونها الغنم في كل خمس شاة وفيما فوق ذلك إلى خمس وثلاثين ابنة مخاض فإن لم تكن ابنة مخاض فابن لبون ذكر وفيما فوق ذلك إلى خمس وأربعين بنت لبون وفيما فوق ذلك إلى ستين حقة طروقة الفحل وفيما فوق ذلك إلى خمس وسبعين جذعة وفيما فوق ذلك إلى تسعين ابنتا لبون وفيما فوق ذلك إلى عشرين ومائة حقتان طروقتا الفحل فما زاد على ذلك من الإبل ففي كل أربعين بنت لبون وفي كل خمسين حقة وفي سائمة الغنم إذا بلغت أربعين إلى عشرين ومائة شاة وفيما فوق ذلك إلى مائتين شاتان وفيما فوق ذلك إلى ثلاثمائة ثلاث شياه فما زاد على ذلك ففي كل مائة شاة ولا يخرج في الصدقة تيس ولا هرمة ولا ذات عوار إلا ما شاء المصدق ولا يجمع بين مفترق ولا يفرق بين مجتمع خشية الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية وفي الرقة إذا بلغت خمس أواق ربع العشر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 599
			}
		},
		{
			"hadithnumber": 600,
			"arabicnumber": 600,
			"text": "حدثني يحيى، عن مالك، عن حميد بن قيس المكي، عن طاوس اليماني، أن معاذ بن جبل الأنصاري، أخذ من ثلاثين بقرة تبيعا ومن أربعين بقرة مسنة وأتي بما دون ذلك فأبى أن يأخذ منه شيئا وقال لم أسمع من رسول الله صلى الله عليه وسلم فيه شيئا حتى ألقاه فأسأله ‏.‏ فتوفي رسول الله صلى الله عليه وسلم قبل أن يقدم معاذ بن جبل ‏.‏ قال يحيى قال مالك أحسن ما سمعت فيمن كانت له غنم على راعيين مفترقين أو على رعاء مفترقين في بلدان شتى أن ذلك يجمع كله على صاحبه فيؤدي منه صدقته ومثل ذلك الرجل يكون له الذهب أو الورق متفرقة في أيدي ناس شتى أنه ينبغي له أن يجمعها فيخرج منها ما وجب عليه في ذلك من زكاتها ‏.‏ وقال يحيى قال مالك في الرجل يكون له الضأن والمعز أنها تجمع عليه في الصدقة فإن كان فيها ما تجب فيه الصدقة صدقت وقال إنما هي غنم كلها وفي كتاب عمر بن الخطاب وفي سائمة الغنم إذا بلغت أربعين شاة شاة ‏.‏ قال مالك فإن كانت الضأن هي أكثر من المعز ولم يجب على ربها إلا شاة واحدة أخذ المصدق تلك الشاة التي وجبت على رب المال من الضأن وإن كانت المعز أكثر من الضأن أخذ منها فإن استوى الضأن والمعز أخذ الشاة من أيتهما شاء ‏.‏ قال يحيى قال مالك وكذلك الإبل العراب والبخت يجمعان على ربهما في الصدقة ‏.‏ وقال إنما هي إبل كلها فإن كانت العراب هي أكثر من البخت ولم يجب على ربها إلا بعير واحد فليأخذ من العراب صدقتها فإن كانت البخت أكثر فليأخذ منها فإن استوت فليأخذ من أيتهما شاء ‏.‏ قال مالك وكذلك البقر والجواميس تجمع في الصدقة على ربها ‏.‏ وقال إنما هي بقر كلها فإن كانت البقر هي أكثر من الجواميس ولا تجب على ربها إلا بقرة واحدة فليأخذ من البقر صدقتهما وإن كانت الجواميس أكثر فليأخذ منها فإن استوت فليأخذ من أيتهما شاء فإذا وجبت في ذلك الصدقة صدق الصنفان جميعا ‏.‏ قال يحيى قال مالك من أفاد ماشية من إبل أو بقر أو غنم فلا صدقة عليه فيها حتى يحول عليها الحول من يوم أفادها إلا أن يكون له قبلها نصاب ماشية والنصاب ما تجب فيه الصدقة إما خمس ذود من الإبل وإما ثلاثون بقرة وإما أربعون شاة فإذا كان للرجل خمس ذود من الإبل أو ثلاثون بقرة أو أربعون شاة ثم أفاد إليها إبلا أو بقرا أو غنما باشتراء أو هبة أو ميراث فإنه يصدقها مع ماشيته حين يصدقها وإن لم يحل على الفائدة الحول وإن كان ما أفاد من الماشية إلى ماشيته قد صدقت قبل أن يشتريها بيوم واحد أو قبل أن يرثها بيوم واحد فإنه يصدقها مع ماشيته حين يصدق ماشيته ‏.‏ قال يحيى قال مالك وإنما مثل ذلك مثل الورق يزكيها الرجل ثم يشتري بها من رجل آخر عرضا وقد وجبت عليه في عرضه ذلك إذا باعه الصدقة فيخرج الرجل الآخر صدقتها هذا اليوم ويكون الآخر قد صدقها من الغد ‏.‏ قال مالك في رجل كانت له غنم لا تجب فيها الصدقة فاشترى إليها غنما كثيرة تجب في دونها الصدقة أو ورثها أنه لا تجب عليه في الغنم كلها الصدقة حتى يحول عليها الحول من يوم أفادها باشتراء أو ميراث وذلك أن كل ما كان عند الرجل من ماشية لا تجب فيها الصدقة من إبل أو بقر أو غنم فليس يعد ذلك نصاب مال حتى يكون في كل صنف منها ما تجب فيه الصدقة فذلك النصاب الذي يصدق معه ما أفاد إليه صاحبه من قليل أو كثير من الماشية ‏.‏ قال مالك ولو كانت لرجل إبل أو بقر أو غنم تجب في كل صنف منها الصدقة ثم أفاد إليها بعيرا أو بقرة أو شاة صدقها مع ماشيته حين يصدقها ‏.‏ قال يحيى قال مالك وهذا أحب ما سمعت إلى في هذا ‏.‏ قال مالك في الفريضة تجب على الرجل فلا توجد عنده أنها إن كانت ابنة مخاض فلم توجد أخذ مكانها ابن لبون ذكر وإن كانت بنت لبون أو حقة أو جذعة ولم يكن عنده كان على رب الإبل أن يبتاعها له حتى يأتيه بها ولا أحب أن يعطيه قيمتها ‏.‏ وقال مالك في الإبل النواضح والبقر السواني وبقر الحرث إني أرى أن يؤخذ من ذلك كله إذا وجبت فيه الصدقة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 600
			}
		},
		{
			"hadithnumber": 601,
			"arabicnumber": 601,
			"text": "حدثني يحيى، عن مالك، عن ثور بن زيد الديلي، عن ابن لعبد الله بن سفيان الثقفي، عن جده، سفيان بن عبد الله أن عمر بن الخطاب، بعثه مصدقا فكان يعد على الناس بالسخل فقالوا أتعد علينا بالسخل ولا تأخذ منه شيئا ‏.‏ فلما قدم على عمر بن الخطاب ذكر له ذلك فقال عمر نعم تعد عليهم بالسخلة يحملها الراعي ولا تأخذها ولا تأخذ الأكولة ولا الربى ولا الماخض ولا فحل الغنم وتأخذ الجذعة والثنية وذلك عدل بين غذاء الغنم وخياره ‏.‏ قال مالك والسخلة الصغيرة حين تنتج ‏.‏ والربى التي قد وضعت فهي تربي ولدها ‏.‏ والماخض هي الحامل ‏.‏ والأكولة هي شاة اللحم التي تسمن لتؤكل ‏.‏ وقال مالك في الرجل تكون له الغنم لا تجب فيها الصدقة فتوالد قبل أن يأتيها المصدق بيوم واحد فتبلغ ما تجب فيه الصدقة بولادتها قال مالك إذا بلغت الغنم بأولادها ما تجب فيه الصدقة فعليه فيها الصدقة وذلك أن ولادة الغنم منها وذلك مخالف لما أفيد منها باشتراء أو هبة أو ميراث ومثل ذلك العرض لا يبلغ ثمنه ما تجب فيه الصدقة ثم يبيعه صاحبه فيبلغ بربحه ما تجب فيه الصدقة فيصدق ربحه مع رأس المال ولو كان ربحه فائدة أو ميراثا لم تجب فيه الصدقة حتى يحول عليه الحول من يوم أفاده أو ورثه ‏.‏ قال مالك فغذاء الغنم منها كما ربح المال منه غير أن ذلك يختلف في وجه آخر أنه إذا كان للرجل من الذهب أو الورق ما تجب فيه الزكاة ثم أفاد إليه مالا ترك ماله الذي أفاد فلم يزكه مع ماله الأول حين يزكيه حتى يحول على الفائدة الحول من يوم أفادها ولو كانت لرجل غنم أو بقر أو إبل تجب في كل صنف منها الصدقة ثم أفاد إليها بعيرا أو بقرة أو شاة صدقها مع صنف ما أفاد من ذلك حين يصدقه إذا كان عنده من ذلك الصنف الذي أفاد نصاب ماشية ‏.‏ قال مالك وهذا أحسن ما سمعت في ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 601
			}
		},
		{
			"hadithnumber": 602,
			"arabicnumber": 602,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن القاسم بن محمد، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت مر على عمر بن الخطاب بغنم من الصدقة فرأى فيها شاة حافلا ذات ضرع عظيم فقال عمر ما هذه الشاة فقالوا شاة من الصدقة ‏.‏ فقال عمر ما أعطى هذه أهلها وهم طائعون لا تفتنوا الناس لا تأخذوا حزرات المسلمين نكبوا عن الطعام ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 602
			}
		},
		{
			"hadithnumber": 603,
			"arabicnumber": 603,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، أنه قال أخبرني رجلان، من أشجع أن محمد بن مسلمة الأنصاري، كان يأتيهم مصدقا فيقول لرب المال أخرج إلى صدقة مالك ‏.‏ فلا يقود إليه شاة فيها وفاء من حقه إلا قبلها ‏.‏ قال مالك السنة عندنا - والذي أدركت عليه أهل العلم ببلدنا - أنه لا يضيق على المسلمين في زكاتهم وأن يقبل منهم ما دفعوا من أموالهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 603
			}
		},
		{
			"hadithnumber": 604,
			"arabicnumber": 604,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تحل الصدقة لغني إلا لخمسة لغاز في سبيل الله أو لعامل عليها أو لغارم أو لرجل اشتراها بماله أو لرجل له جار مسكين فتصدق على المسكين فأهدى المسكين للغني ‏\"‏ ‏.‏ قال مالك الأمر عندنا في قسم الصدقات أن ذلك لا يكون إلا على وجه الاجتهاد من الوالي فأى الأصناف كانت فيه الحاجة والعدد أوثر ذلك الصنف بقدر ما يرى الوالي وعسى أن ينتقل ذلك إلى الصنف الآخر بعد عام أو عامين أو أعوام فيؤثر أهل الحاجة والعدد حيثما كان ذلك وعلى هذا أدركت من أرضى من أهل العلم ‏.‏ قال مالك وليس للعامل على الصدقات فريضة مسماة إلا على قدر ما يرى الإمام ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 604
			}
		},
		{
			"hadithnumber": 605,
			"arabicnumber": 605,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن أبا بكر الصديق، قال لو منعوني عقالا لجاهدتهم عليه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 605
			}
		},
		{
			"hadithnumber": 606,
			"arabicnumber": 606,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، أنه قال شرب عمر بن الخطاب لبنا فأعجبه فسأل الذي سقاه من أين هذا اللبن فأخبره أنه ورد على ماء - قد سماه - فإذا نعم من نعم الصدقة وهم يسقون فحلبوا لي من ألبانها فجعلته في سقائي فهو هذا ‏.‏ فأدخل عمر بن الخطاب يده فاستقاءه ‏.‏ قال مالك الأمر عندنا أن كل من منع فريضة من فرائض الله عز وجل فلم يستطع المسلمون أخذها كان حقا عليهم جهاده حتى يأخذوها منه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 606
			}
		},
		{
			"hadithnumber": 607,
			"arabicnumber": 607,
			"text": "وحدثني عن مالك، أنه بلغه أن عاملا، لعمر بن عبد العزيز كتب إليه يذكر أن رجلا منع زكاة ماله فكتب إليه عمر أن دعه ولا تأخذ منه زكاة مع المسلمين قال فبلغ ذلك الرجل فاشتد عليه وأدى بعد ذلك زكاة ماله فكتب عامل عمر إليه يذكر له ذلك فكتب إليه عمر أن خذها منه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 607
			}
		},
		{
			"hadithnumber": 608,
			"arabicnumber": 608,
			"text": "حدثني يحيى، عن مالك، عن الثقة، عنده عن سليمان بن يسار، وعن بسر بن سعيد، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ فيما سقت السماء والعيون والبعل العشر وفيما سقي بالنضح نصف العشر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 608
			}
		},
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "وحدثني عن مالك، عن زياد بن سعد، عن ابن شهاب، أنه قال لا يؤخذ في صدقة النخل الجعرور ولا مصران الفارة ولا عذق ابن حبيق ‏.‏ قال وهو يعد على صاحب المال ولا يؤخذ منه في الصدقة ‏.‏ قال مالك وإنما مثل ذلك الغنم تعد على صاحبها بسخالها والسخل لا يؤخذ منه في الصدقة وقد يكون في الأموال ثمار لا تؤخذ الصدقة منها من ذلك البردي وما أشبهه لا يؤخذ من أدناه كما لا يؤخذ من خياره ‏.‏ قال وإنما تؤخذ الصدقة من أوساط المال ‏.‏ قال مالك الأمر المجتمع عليه عندنا أنه لا يخرص من الثمار إلا النخيل والأعناب فإن ذلك يخرص حين يبدو صلاحه ويحل بيعه وذلك أن ثمر النخيل والأعناب يؤكل رطبا وعنبا فيخرص على أهله للتوسعة على الناس ولئلا يكون على أحد في ذلك ضيق فيخرص ذلك عليهم ثم يخلى بينهم وبينه يأكلونه كيف شاءوا ثم يؤدون منه الزكاة على ما خرص عليهم ‏.‏ قال مالك فأما ما لا يؤكل رطبا وإنما يؤكل بعد حصاده من الحبوب كلها فإنه لا يخرص وإنما على أهلها فيها إذا حصدوها ودقوها وطيبوها وخلصت حبا فإنما على أهلها فيها الأمانة يؤدون زكاتها إذا بلغ ذلك ما تجب فيه الزكاة وهذا الأمر الذي لا اختلاف فيه عندنا ‏.‏ قال مالك الأمر المجتمع عليه عندنا أن النخل يخرص على أهلها وثمرها في رءوسها إذا طاب وحل بيعه ويؤخذ منه صدقته تمرا عند الجداد فإن أصابت الثمرة جائحة بعد أن تخرص على أهلها وقبل أن تجذ فأحاطت الجائحة بالثمر كله فليس عليهم صدقة فإن بقي من الثمر شىء يبلغ خمسة أوسق فصاعدا بصاع النبي صلى الله عليه وسلم أخذ منهم زكاته وليس عليهم فيما أصابت الجائحة زكاة وكذلك العمل في الكرم أيضا وإذا كان لرجل قطع أموال متفرقة أو اشتراك في أموال متفرقة لا يبلغ مال كل شريك أو قطعه ما تجب فيه الزكاة وكانت إذا جمع بعض ذلك إلى بعض يبلغ ما تجب فيه الزكاة فإنه يجمعها ويؤدي زكاتها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 609
			}
		},
		{
			"hadithnumber": 610,
			"arabicnumber": 610,
			"text": "حدثني يحيى، عن مالك، أنه سأل ابن شهاب عن الزيتون، فقال فيه العشر ‏.‏ قال مالك وإنما يؤخذ من الزيتون العشر بعد أن يعصر ويبلغ زيتونه خمسة أوسق فما لم يبلغ زيتونه خمسة أوسق فلا زكاة فيه والزيتون بمنزلة النخيل ما كان منه سقته السماء والعيون أو كان بعلا ففيه العشر وما كان يسقى بالنضح ففيه نصف العشر ولا يخرص شىء من الزيتون في شجره ‏.‏ والسنة عندنا في الحبوب التي يدخرها الناس ويأكلونها أنه يؤخذ مما سقته السماء من ذلك وما سقته العيون وما كان بعلا العشر وما سقي بالنضح نصف العشر إذا بلغ ذلك خمسة أوسق بالصاع الأول صاع النبي صلى الله عليه وسلم وما زاد على خمسة أوسق ففيه الزكاة بحساب ذلك ‏.‏ قال مالك والحبوب التي فيها الزكاة الحنطة والشعير والسلت والذرة والدخن والأرز والعدس والجلبان واللوبيا والجلجلان وما أشبه ذلك من الحبوب التي تصير طعاما فالزكاة تؤخذ منها بعد أن تحصد وتصير حبا ‏.‏ قال والناس مصدقون في ذلك ويقبل منهم في ذلك ما دفعوا ‏.‏ وسئل مالك متى يخرج من الزيتون العشر أو نصفه أقبل النفقة أم بعدها فقال لا ينظر إلى النفقة ولكن يسأل عنه أهله كما يسأل أهل الطعام عن الطعام ويصدقون بما قالوا فمن رفع من زيتونه خمسة أوسق فصاعدا أخذ من زيته العشر بعد أن يعصر ومن لم يرفع من زيتونه خمسة أوسق لم تجب عليه في زيته الزكاة ‏.‏ قال مالك ومن باع زرعه وقد صلح ويبس في أكمامه فعليه زكاته وليس على الذي اشتراه زكاة ولا يصلح بيع الزرع حتى ييبس في أكمامه ويستغني عن الماء ‏.‏ قال مالك في قول الله تعالى ‏{‏وآتوا حقه يوم حصاده ‏}‏ أن ذلك الزكاة وقد سمعت من يقول ذلك ‏.‏ قال مالك ومن باع أصل حائطه أو أرضه وفي ذلك زرع أو ثمر لم يبد صلاحه فزكاة ذلك على المبتاع وإن كان قد طاب وحل بيعه فزكاة ذلك على البائع إلا أن يشترطها على المبتاع ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 610
			}
		},
		{
			"hadithnumber": 611,
			"arabicnumber": 611,
			"text": "حدثني يحيى، عن مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ليس على المسلم في عبده ولا في فرسه صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 611
			}
		},
		{
			"hadithnumber": 612,
			"arabicnumber": 612,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن سليمان بن يسار، أن أهل الشام، قالوا لأبي عبيدة بن الجراح خذ من خيلنا ورقيقنا صدقة ‏.‏ فأبى ثم كتب إلى عمر بن الخطاب فأبى عمر ثم كلموه أيضا فكتب إلى عمر فكتب إليه عمر إن أحبوا فخذها منهم وارددها عليهم وارزق رقيقهم ‏.‏ قال مالك معنى قوله رحمه الله وارددها عليهم يقول على فقرائهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 612
			}
		},
		{
			"hadithnumber": 613,
			"arabicnumber": 613,
			"text": "وحدثني عن مالك، عن عبد الله بن أبي بكر بن عمرو بن حزم، أنه قال جاء كتاب من عمر بن عبد العزيز إلى أبي وهو بمنى أن لا يأخذ من العسل ولا من الخيل صدقة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 613
			}
		},
		{
			"hadithnumber": 614,
			"arabicnumber": 614,
			"text": "وحدثني عن مالك، عن عبد الله بن دينار، أنه قال سألت سعيد بن المسيب عن صدقة البراذين، فقال وهل في الخيل من صدقة",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 614
			}
		},
		{
			"hadithnumber": 615,
			"arabicnumber": 615,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، قال بلغني أن رسول الله صلى الله عليه وسلم أخذ الجزية من مجوس البحرين وأن عمر بن الخطاب أخذها من مجوس فارس وأن عثمان بن عفان أخذها من البربر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 615
			}
		},
		{
			"hadithnumber": 616,
			"arabicnumber": 616,
			"text": "وحدثني عن مالك، عن جعفر بن محمد بن علي، عن أبيه، أن عمر بن الخطاب، ذكر المجوس فقال ما أدري كيف أصنع في أمرهم فقال عبد الرحمن بن عوف أشهد لسمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ سنوا بهم سنة أهل الكتاب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 616
			}
		},
		{
			"hadithnumber": 617,
			"arabicnumber": 617,
			"text": "وحدثني عن مالك، عن نافع، عن أسلم، مولى عمر بن الخطاب أن عمر بن الخطاب، ضرب الجزية على أهل الذهب أربعة دنانير وعلى أهل الورق أربعين درهما مع ذلك أرزاق المسلمين وضيافة ثلاثة أيام ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 617
			}
		},
		{
			"hadithnumber": 618,
			"arabicnumber": 618,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، عن أبيه، أنه قال لعمر بن الخطاب إن في الظهر ناقة عمياء ‏.‏ فقال عمر ادفعها إلى أهل بيت ينتفعون بها ‏.‏ قال فقلت وهي عمياء فقال عمر يقطرونها بالإبل ‏.‏ قال فقلت كيف تأكل من الأرض قال فقال عمر أمن نعم الجزية هي أم من نعم الصدقة فقلت بل من نعم الجزية ‏.‏ فقال عمر أردتم - والله - أكلها ‏.‏ فقلت إن عليها وسم الجزية ‏.‏ فأمر بها عمر فنحرت وكان عنده صحاف تسع فلا تكون فاكهة ولا طريفة إلا جعل منها في تلك الصحاف فبعث بها إلى أزواج النبي صلى الله عليه وسلم ويكون الذي يبعث به إلى حفصة ابنته من آخر ذلك فإن كان فيه نقصان كان في حظ حفصة - قال - فجعل في تلك الصحاف من لحم تلك الجزور فبعث به إلى أزواج النبي صلى الله عليه وسلم وأمر بما بقي من لحم تلك الجزور فصنع فدعا عليه المهاجرين والأنصار ‏.‏ قال مالك لا أرى أن تؤخذ النعم من أهل الجزية إلا في جزيتهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 618
			}
		},
		{
			"hadithnumber": 619,
			"arabicnumber": 619,
			"text": "وحدثني عن مالك، أنه بلغه أن عمر بن عبد العزيز، كتب إلى عماله أن يضعوا الجزية عمن أسلم من أهل الجزية حين يسلمون ‏.‏ قال مالك مضت السنة أن لا جزية على نساء أهل الكتاب ولا على صبيانهم وأن الجزية لا تؤخذ إلا من الرجال الذين قد بلغوا الحلم وليس على أهل الذمة ولا على المجوس في نخيلهم ولا كرومهم ولا زروعهم ولا مواشيهم صدقة لأن الصدقة إنما وضعت على المسلمين تطهيرا لهم وردا على فقرائهم ووضعت الجزية على أهل الكتاب صغارا لهم فهم ما كانوا ببلدهم الذين صالحوا عليه ليس عليهم شىء سوى الجزية في شىء من أموالهم إلا أن يتجروا في بلاد المسلمين ويختلفوا فيها فيؤخذ منهم العشر فيما يديرون من التجارات وذلك أنهم إنما وضعت عليهم الجزية وصالحوا عليها على أن يقروا ببلادهم ويقاتل عنهم عدوهم فمن خرج منهم من بلاده إلى غيرها يتجر إليها فعليه العشر من تجر منهم من أهل مصر إلى الشام ومن أهل الشام إلى العراق ومن أهل العراق إلى المدينة أو اليمن أو ما أشبه هذا من البلاد فعليه العشر ولا صدقة على أهل الكتاب ولا المجوس في شىء من أموالهم ولا من مواشيهم ولا ثمارهم ولا زروعهم مضت بذلك السنة ويقرون على دينهم ويكونون على ما كانوا عليه وإن اختلفوا في العام الواحد مرارا في بلاد المسلمين فعليهم كلما اختلفوا العشر لأن ذلك ليس مما صالحوا عليه ولا مما شرط لهم وهذا الذي أدركت عليه أهل العلم ببلدنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 619
			}
		},
		{
			"hadithnumber": 620,
			"arabicnumber": 620,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن عمر بن الخطاب، كان يأخذ من النبط من الحنطة والزيت نصف العشر يريد بذلك أن يكثر الحمل إلى المدينة ويأخذ من القطنية العشر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 620
			}
		},
		{
			"hadithnumber": 621,
			"arabicnumber": 621,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن السائب بن يزيد، أنه قال كنت غلاما عاملا مع عبد الله بن عتبة بن مسعود على سوق المدينة في زمان عمر بن الخطاب فكنا نأخذ من النبط العشر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 621
			}
		},
		{
			"hadithnumber": 622,
			"arabicnumber": 622,
			"text": "وحدثني عن مالك، أنه سأل ابن شهاب على أى وجه كان يأخذ عمر بن الخطاب من النبط العشر فقال ابن شهاب كان ذلك يؤخذ منهم في الجاهلية فألزمهم ذلك عمر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 622
			}
		},
		{
			"hadithnumber": 623,
			"arabicnumber": 623,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، عن أبيه، أنه قال سمعت عمر بن الخطاب، وهو يقول حملت على فرس عتيق في سبيل الله - وكان الرجل الذي هو عنده قد أضاعه - فأردت أن أشتريه منه وظننت أنه بائعه برخص فسألت عن ذلك رسول الله صلى الله عليه وسلم فقال ‏ \"‏ لا تشتره وإن أعطاكه بدرهم واحد فإن العائد في صدقته كالكلب يعود في قيئه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 623
			}
		},
		{
			"hadithnumber": 624,
			"arabicnumber": 624,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أن عمر بن الخطاب، حمل على فرس في سبيل الله فأراد أن يبتاعه فسأل عن ذلك رسول الله صلى الله عليه وسلم فقال ‏ \"‏ لا تبتعه ولا تعد في صدقتك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 624
			}
		},
		{
			"hadithnumber": 625,
			"arabicnumber": 625,
			"text": "حدثني يحيى، عن مالك، عن نافع، أن عبد الله بن عمر، كان يخرج زكاة الفطر عن غلمانه الذين، بوادي القرى وبخيبر ‏.‏ وحدثني عن مالك، أن أحسن، ما سمعت فيما، يجب على الرجل من زكاة الفطر أن الرجل يؤدي ذلك عن كل من يضمن نفقته ولا بد له من أن ينفق عليه والرجل يؤدي عن مكاتبه ومدبره ورقيقه كلهم غائبهم وشاهدهم من كان منهم مسلما ومن كان منهم لتجارة أو لغير تجارة ومن لم يكن منهم مسلما فلا زكاة عليه فيه ‏.‏ قال مالك في العبد الآبق إن سيده إن علم مكانه أو لم يعلم وكانت غيبته قريبة فهو يرجو حياته ورجعته فإني أرى أن يزكي عنه وإن كان إباقه قد طال ويئس منه فلا أرى أن يزكي عنه ‏.‏ قال مالك تجب زكاة الفطر على أهل البادية كما تجب على أهل القرى وذلك أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر من رمضان على الناس على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 625
			}
		},
		{
			"hadithnumber": 626,
			"arabicnumber": 626,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر من رمضان على الناس صاعا من تمر أو صاعا من شعير على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 626
			}
		},
		{
			"hadithnumber": 627,
			"arabicnumber": 627,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، عن عياض بن عبد الله بن سعد بن أبي سرح العامري، أنه سمع أبا سعيد الخدري، يقول كنا نخرج زكاة الفطر صاعا من طعام أو صاعا من شعير أو صاعا من تمر أو صاعا من أقط أو صاعا من زبيب وذلك بصاع النبي صلى الله عليه وسلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 627
			}
		},
		{
			"hadithnumber": 628,
			"arabicnumber": 628,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان لا يخرج في زكاة الفطر إلا التمر إلا مرة واحدة فإنه أخرج شعيرا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 628
			}
		},
		{
			"hadithnumber": 629,
			"arabicnumber": 629,
			"text": "حدثني يحيى، عن مالك، عن نافع، أن عبد الله بن عمر، كان يبعث بزكاة الفطر إلى الذي تجمع عنده قبل الفطر بيومين أو ثلاثة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 17,
				"hadith": 629
			}
		}
	]
}