{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"21": "Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 959,
			"arabicnumber": 959,
			"text": "حدثني يحيى، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ مثل المجاهد في سبيل الله كمثل الصائم القائم الدائم الذي لا يفتر من صلاة ولا صيام حتى يرجع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 959
			}
		},
		{
			"hadithnumber": 960,
			"arabicnumber": 960,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ تكفل الله لمن جاهد في سبيله - لا يخرجه من بيته إلا الجهاد في سبيله وتصديق كلماته - أن يدخله الجنة أو يرده إلى مسكنه الذي خرج منه مع ما نال من أجر أو غنيمة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 960
			}
		},
		{
			"hadithnumber": 961,
			"arabicnumber": 961,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخيل لرجل أجر ولرجل ستر وعلى رجل وزر فأما الذي هي له أجر فرجل ربطها في سبيل الله فأطال لها في مرج أو روضة فما أصابت في طيلها ذلك من المرج أو الروضة كان له حسنات ولو أنها قطعت طيلها ذلك فاستنت شرفا أو شرفين كانت آثارها وأرواثها حسنات له ولو أنها مرت بنهر فشربت منه ولم يرد أن يسقي به كان ذلك له حسنات فهي له أجر ورجل ربطها تغنيا وتعففا ولم ينس حق الله في رقابها ولا في ظهورها فهي لذلك ستر ورجل ربطها فخرا ورياء ونواء لأهل الإسلام فهي على ذلك وزر ‏\"‏ ‏.‏ وسئل رسول الله صلى الله عليه وسلم عن الحمر فقال ‏\"‏ لم ينزل على فيها شىء إلا هذه الآية الجامعة الفاذة ‏{‏فمن يعمل مثقال ذرة خيرا يره ومن يعمل مثقال ذرة شرا يره ‏}‏‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 961
			}
		},
		{
			"hadithnumber": 962,
			"arabicnumber": 962,
			"text": "وحدثني عن عبد الله بن عبد الرحمن بن معمر الأنصاري، عن عطاء بن يسار، أنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ ألا أخبركم بخير الناس منزلا رجل آخذ بعنان فرسه يجاهد في سبيل الله ألا أخبركم بخير الناس منزلا بعده رجل معتزل في غنيمته يقيم الصلاة ويؤتي الزكاة ويعبد الله لا يشرك به شيئا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 962
			}
		},
		{
			"hadithnumber": 963,
			"arabicnumber": 963,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، قال أخبرني عبادة بن الوليد بن عبادة بن الصامت، عن أبيه، عن جده، قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في اليسر والعسر والمنشط والمكره وأن لا ننازع الأمر أهله وأن نقول أو نقوم بالحق حيثما كنا لا نخاف في الله لومة لائم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 963
			}
		},
		{
			"hadithnumber": 964,
			"arabicnumber": 964,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، قال كتب أبو عبيدة بن الجراح إلى عمر بن الخطاب يذكر له جموعا من الروم وما يتخوف منهم فكتب إليه عمر بن الخطاب أما بعد فإنه مهما ينزل بعبد مؤمن من منزل شدة يجعل الله بعده فرجا وإنه لن يغلب عسر يسرين وأن الله تعالى يقول في كتابه ‏{‏يا أيها الذين آمنوا اصبروا وصابروا ورابطوا واتقوا الله لعلكم تفلحون ‏}‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 964
			}
		},
		{
			"hadithnumber": 965,
			"arabicnumber": 965,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أنه قال نهى رسول الله صلى الله عليه وسلم أن يسافر بالقرآن إلى أرض العدو ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 965
			}
		},
		{
			"hadithnumber": 966,
			"arabicnumber": 966,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن ابن لكعب بن مالك، - قال حسبت أنه قال عن عبد الرحمن بن كعب، أنه - قال نهى رسول الله صلى الله عليه وسلم الذين قتلوا ابن أبي الحقيق عن قتل النساء والولدان - قال - فكان رجل منهم يقول برحت بنا امرأة ابن أبي الحقيق بالصياح فأرفع السيف عليها ثم أذكر نهى رسول الله صلى الله عليه وسلم فأكف ولولا ذلك استرحنا منها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 966
			}
		},
		{
			"hadithnumber": 967,
			"arabicnumber": 967,
			"text": "وحدثني عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم رأى في بعض مغازيه امرأة مقتولة فأنكر ذلك ونهى عن قتل النساء والصبيان ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 967
			}
		},
		{
			"hadithnumber": 968,
			"arabicnumber": 968,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن أبا بكر الصديق، بعث جيوشا إلى الشام فخرج يمشي مع يزيد بن أبي سفيان - وكان أمير ربع من تلك الأرباع - فزعموا أن يزيد قال لأبي بكر إما أن تركب وإما أن أنزل ‏.‏ فقال أبو بكر ما أنت بنازل وما أنا براكب إني أحتسب خطاى هذه في سبيل الله ثم قال له إنك ستجد قوما زعموا أنهم حبسوا أنفسهم لله فذرهم وما زعموا أنهم حبسوا أنفسهم له وستجد قوما فحصوا عن أوساط رءوسهم من الشعر فاضرب ما فحصوا عنه بالسيف وإني موصيك بعشر لا تقتلن امرأة ولا صبيا ولا كبيرا هرما ولا تقطعن شجرا مثمرا ولا تخربن عامرا ولا تعقرن شاة ولا بعيرا إلا لمأكلة ولا تحرقن نحلا ولا تفرقنه ولا تغلل ولا تجبن ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 968
			}
		},
		{
			"hadithnumber": 969,
			"arabicnumber": 969,
			"text": "وحدثني عن مالك، أنه بلغه أن عمر بن عبد العزيز، كتب إلى عامل من عماله أنه بلغنا أن رسول الله صلى الله عليه وسلم كان إذا بعث سرية يقول لهم ‏ \"‏ اغزوا باسم الله في سبيل الله تقاتلون من كفر بالله لا تغلوا ولا تغدروا ولا تمثلوا ولا تقتلوا وليدا وقل ذلك لجيوشك وسراياك إن شاء الله والسلام عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 969
			}
		},
		{
			"hadithnumber": 970,
			"arabicnumber": 970,
			"text": "حدثني يحيى، عن مالك، عن رجل، من أهل الكوفة أن عمر بن الخطاب، كتب إلى عامل جيش كان بعثه إنه بلغني أن رجالا منكم يطلبون العلج حتى إذا أسند في الجبل وامتنع قال رجل مطرس - يقول لا تخف - فإذا أدركه قتله وإني والذي نفسي بيده لا أعلم مكان واحد فعل ذلك إلا ضربت عنقه ‏.‏ قال يحيى سمعت مالكا يقول ليس هذا الحديث بالمجتمع عليه وليس عليه العمل ‏.‏ وسئل مالك عن الإشارة بالأمان أهي بمنزلة الكلام فقال نعم وإني أرى أن يتقدم إلى الجيوش أن لا تقتلوا أحدا أشاروا إليه بالأمان لأن الإشارة عندي بمنزلة الكلام وإنه بلغني أن عبد الله بن عباس قال ما ختر قوم بالعهد إلا سلط الله عليهم العدو ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 970
			}
		},
		{
			"hadithnumber": 971,
			"arabicnumber": 971,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أنه كان إذا أعطى شيئا في سبيل الله يقول لصاحبه إذا بلغت وادي القرى فشأنك به ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 971
			}
		},
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن سعيد بن المسيب، كان يقول إذا أعطي الرجل الشىء في الغزو فيبلغ به رأس مغزاته فهو له ‏.‏ وسئل مالك عن رجل أوجب على نفسه الغزو فتجهز حتى إذا أراد أن يخرج منعه أبواه أو أحدهما فقال لا يكابرهما ولكن يؤخر ذلك إلى عام آخر فأما الجهاز فإني أرى أن يرفعه حتى يخرج به فإن خشي أن يفسد باعه وأمسك ثمنه حتى يشتري به ما يصلحه للغزو فإن كان موسرا يجد مثل جهازه إذا خرج فليصنع بجهازه ما شاء ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 972
			}
		},
		{
			"hadithnumber": 973,
			"arabicnumber": 973,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم بعث سرية فيها عبد الله بن عمر قبل نجد فغنموا إبلا كثيرة فكان سهمانهم اثنى عشر بعيرا أو أحد عشر بعيرا ونفلوا بعيرا بعيرا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 973
			}
		},
		{
			"hadithnumber": 974,
			"arabicnumber": 974,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه سمع سعيد بن المسيب، يقول كان الناس في الغزو إذا اقتسموا غنائمهم يعدلون البعير بعشر شياه ‏.‏ قال مالك في الأجير في الغزو إنه إن كان شهد القتال وكان مع الناس عند القتال وكان حرا فله سهمه وإن لم يفعل ذلك فلا سهم له وأرى أن لا يقسم إلا لمن شهد القتال من الأحرار ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 974
			}
		},
		{
			"hadithnumber": 975,
			"arabicnumber": 975,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عبدا، لعبد الله بن عمر أبق وأن فرسا له عار فأصابهما المشركون ثم غنمهما المسلمون فردا على عبد الله بن عمر وذلك قبل أن تصيبهما المقاسم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 975
			}
		},
		{
			"hadithnumber": 976,
			"arabicnumber": 976,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، عن عمر بن كثير بن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة بن ربعي، أنه قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين فلما التقينا كانت للمسلمين جولة - قال - فرأيت رجلا من المشركين قد علا رجلا من المسلمين - قال - فاستدرت له حتى أتيته من ورائه فضربته بالسيف على حبل عاتقه فأقبل على فضمني ضمة وجدت منها ريح الموت ثم أدركه الموت فأرسلني - قال - فلقيت عمر بن الخطاب فقلت ما بال الناس فقال أمر الله ‏.‏ ثم إن الناس رجعوا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏ ‏.‏ قال فقمت ثم قلت من يشهد لي ثم جلست ‏.‏ ثم قال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏ ‏.‏ قال فقمت ثم قلت من يشهد لي ثم جلست ثم قال ذلك الثالثة فقمت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لك يا أبا قتادة ‏\"‏ ‏.‏ قال فاقتصصت عليه القصة ‏.‏ فقال رجل من القوم صدق يا رسول الله وسلب ذلك القتيل عندي فأرضه عنه يا رسول الله ‏.‏ فقال أبو بكر لا هاء الله إذا لا يعمد إلى أسد من أسد الله يقاتل عن الله ورسوله فيعطيك سلبه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدق فأعطه إياه ‏\"‏ ‏.‏ فأعطانيه فبعت الدرع فاشتريت به مخرفا في بني سلمة فإنه لأول مال تأثلته في الإسلام ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 976
			}
		},
		{
			"hadithnumber": 977,
			"arabicnumber": 977,
			"text": "وحدثني مالك، عن ابن شهاب، عن القاسم بن محمد، أنه قال سمعت رجلا، يسأل عبد الله بن عباس عن الأنفال، فقال ابن عباس الفرس من النفل والسلب من النفل ‏.‏ قال ثم عاد الرجل لمسألته فقال ابن عباس ذلك أيضا ثم قال الرجل الأنفال التي قال الله في كتابه ما هي قال القاسم فلم يزل يسأله حتى كاد أن يحرجه ثم قال ابن عباس أتدرون ما مثل هذا مثل صبيغ الذي ضربه عمر بن الخطاب ‏.‏ قال وسئل مالك عمن قتل قتيلا من العدو أيكون له سلبه بغير إذن الإمام قال لا يكون ذلك لأحد بغير إذن الإمام ولا يكون ذلك من الإمام إلا على وجه الاجتهاد ولم يبلغني أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من قتل قتيلا فله سلبه ‏\"‏ ‏.‏ إلا يوم حنين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 977
			}
		},
		{
			"hadithnumber": 978,
			"arabicnumber": 978,
			"text": "حدثني يحيى، عن مالك، عن أبي الزناد، عن سعيد بن المسيب، أنه قال كان الناس يعطون النفل من الخمس ‏.‏ قال مالك وذلك أحسن ما سمعت إلى في ذلك ‏.‏ وسئل مالك عن النفل هل يكون في أول مغنم قال ذلك على وجه الاجتهاد من الإمام وليس عندنا في ذلك أمر معروف موثوق إلا اجتهاد السلطان ولم يبلغني أن رسول الله صلى الله عليه وسلم نفل في مغازيه كلها وقد بلغني أنه نفل في بعضها يوم حنين وإنما ذلك على وجه الاجتهاد من الإمام في أول مغنم وفيما بعده ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 978
			}
		},
		{
			"hadithnumber": 979,
			"arabicnumber": 979,
			"text": "حدثني يحيى، عن مالك، أنه قال بلغني أن عمر بن عبد العزيز، كان يقول للفرس سهمان وللرجل سهم ‏.‏ قال مالك ولم أزل أسمع ذلك ‏.‏ وسئل مالك عن رجل يحضر بأفراس كثيرة فهل يقسم لها كلها فقال لم أسمع بذلك ولا أرى أن يقسم إلا لفرس واحد الذي يقاتل عليه ‏.‏ قال مالك لا أرى البراذين والهجن إلا من الخيل لأن الله تبارك وتعالى قال في كتابه ‏{‏والخيل والبغال والحمير لتركبوها وزينة‏}‏ وقال عز وجل ‏{‏وأعدوا لهم ما استطعتم من قوة ومن رباط الخيل ترهبون به عدو الله وعدوكم‏}‏ فأنا أرى البراذين والهجن من الخيل إذا أجازها الوالي وقد قال سعيد بن المسيب وسئل عن البراذين هل فيها من صدقة فقال وهل في الخيل من صدقة",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 979
			}
		},
		{
			"hadithnumber": 980,
			"arabicnumber": 980,
			"text": "حدثني يحيى، عن مالك، عن عبد ربه بن سعيد، عن عمرو بن شعيب، أن رسول الله صلى الله عليه وسلم حين صدر من حنين وهو يريد الجعرانة سأله الناس حتى دنت به ناقته من شجرة فتشبكت بردائه حتى نزعته عن ظهره فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوا على ردائي أتخافون أن لا أقسم بينكم ما أفاء الله عليكم والذي نفسي بيده لو أفاء الله عليكم مثل سمر تهامة نعما لقسمته بينكم ثم لا تجدوني بخيلا ولا جبانا ولا كذابا ‏\"‏ ‏.‏ فلما نزل رسول الله صلى الله عليه وسلم قام في الناس فقال ‏\"‏ أدوا الخياط والمخيط فإن الغلول عار ونار وشنار على أهله يوم القيامة ‏\"‏ ‏.‏ قال ثم تناول من الأرض وبرة من بعير أو شيئا ثم قال ‏\"‏ والذي نفسي بيده ما لي مما أفاء الله عليكم ولا مثل هذه إلا الخمس والخمس مردود عليكم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 980
			}
		},
		{
			"hadithnumber": 981,
			"arabicnumber": 981,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، أن زيد بن خالد الجهني، قال توفي رجل يوم حنين وإنهم ذكروه لرسول الله صلى الله عليه وسلم فزعم زيد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلوا على صاحبكم ‏\"‏ ‏.‏ فتغيرت وجوه الناس لذلك فزعم زيد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن صاحبكم قد غل في سبيل الله ‏\"‏ ‏.‏ قال ففتحنا متاعه فوجدنا خرزات من خرز يهود ما تساوين درهمين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 981
			}
		},
		{
			"hadithnumber": 982,
			"arabicnumber": 982,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن عبد الله بن المغيرة بن أبي بردة الكناني، أنه بلغه أن رسول الله صلى الله عليه وسلم أتى الناس في قبائلهم يدعو لهم وأنه ترك قبيلة من القبائل - قال - وإن القبيلة وجدوا في بردعة رجل منهم عقد جزع غلولا فأتاهم رسول الله صلى الله عليه وسلم فكبر عليهم كما يكبر على الميت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 982
			}
		},
		{
			"hadithnumber": 983,
			"arabicnumber": 983,
			"text": "وحدثني عن مالك، عن ثور بن زيد الديلي، عن أبي الغيث، سالم مولى ابن مطيع عن أبي هريرة، قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين فلم نغنم ذهبا ولا ورقا إلا الأموال الثياب والمتاع - قال - فأهدى رفاعة بن زيد لرسول الله صلى الله عليه وسلم غلاما أسود يقال له مدعم فوجه رسول الله صلى الله عليه وسلم إلى وادي القرى حتى إذا كنا بوادي القرى بينما مدعم يحط رحل رسول الله صلى الله عليه وسلم إذ جاءه سهم عائر فأصابه فقتله فقال الناس هنيئا له الجنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفسي بيده إن الشملة التي أخذ يوم حنين من المغانم لم تصبها المقاسم لتشتعل عليه نارا ‏\"‏ ‏.‏ قال فلما سمع الناس ذلك جاء رجل بشراك أو شراكين إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك أو شراكان من نار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 983
			}
		},
		{
			"hadithnumber": 984,
			"arabicnumber": 984,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه بلغه عن عبد الله بن عباس، أنه قال ما ظهر الغلول في قوم قط إلا ألقي في قلوبهم الرعب ولا فشا الزنا في قوم قط إلا كثر فيهم الموت ولا نقص قوم المكيال والميزان إلا قطع عنهم الرزق ولا حكم قوم بغير الحق إلا فشا فيهم الدم ولا ختر قوم بالعهد إلا سلط الله عليهم العدو ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 984
			}
		},
		{
			"hadithnumber": 985,
			"arabicnumber": 985,
			"text": "حدثني يحيى، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ والذي نفسي بيده لوددت أني أقاتل في سبيل الله فأقتل ثم أحيا فأقتل ثم أحيا فأقتل ‏\"‏ ‏.‏ فكان أبو هريرة يقول ثلاثا أشهد بالله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 985
			}
		},
		{
			"hadithnumber": 986,
			"arabicnumber": 986,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يضحك الله إلى رجلين يقتل أحدهما الآخر كلاهما يدخل الجنة يقاتل هذا في سبيل الله فيقتل ثم يتوب الله على القاتل فيقاتل فيستشهد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 986
			}
		},
		{
			"hadithnumber": 987,
			"arabicnumber": 987,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ والذي نفسي بيده لا يكلم أحد في سبيل الله - والله أعلم بمن يكلم في سبيله - إلا جاء يوم القيامة وجرحه يثعب دما اللون لون دم والريح ريح المسك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 987
			}
		},
		{
			"hadithnumber": 988,
			"arabicnumber": 988,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، أن عمر بن الخطاب، كان يقول اللهم لا تجعل قتلي بيد رجل صلى لك سجدة واحدة يحاجني بها عندك يوم القيامة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 988
			}
		},
		{
			"hadithnumber": 989,
			"arabicnumber": 989,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سعيد بن أبي سعيد المقبري، عن عبد الله بن أبي قتادة، عن أبيه، أنه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن قتلت في سبيل الله صابرا محتسبا مقبلا غير مدبر أيكفر الله عني خطاياى فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ فلما أدبر الرجل ناداه رسول الله صلى الله عليه وسلم أو أمر به فنودي له فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كيف قلت ‏\"‏ ‏.‏ فأعاد عليه قوله فقال له النبي صلى الله عليه وسلم ‏\"‏ نعم إلا الدين كذلك قال لي جبريل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 989
			}
		},
		{
			"hadithnumber": 990,
			"arabicnumber": 990,
			"text": "وحدثني عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أنه بلغه أن رسول الله صلى الله عليه وسلم قال لشهداء أحد ‏\"‏ هؤلاء أشهد عليهم ‏\"‏ ‏.‏ فقال أبو بكر الصديق ألسنا يا رسول الله بإخوانهم أسلمنا كما أسلموا وجاهدنا كما جاهدوا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بلى ولكن لا أدري ما تحدثون بعدي ‏\"‏ ‏.‏ فبكى أبو بكر ثم بكى ثم قال أئنا لكائنون بعدك",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 990
			}
		},
		{
			"hadithnumber": 991,
			"arabicnumber": 991,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، قال كان رسول الله صلى الله عليه وسلم جالسا وقبر يحفر بالمدينة فاطلع رجل في القبر فقال بئس مضجع المؤمن ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بئس ما قلت ‏\"‏ ‏.‏ فقال الرجل إني لم أرد هذا يا رسول الله إنما أردت القتل في سبيل الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا مثل للقتل في سبيل الله ما على الأرض بقعة هي أحب إلى أن يكون قبري بها منها ‏\"‏ ‏.‏ ثلاث مرات يعني المدينة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 991
			}
		},
		{
			"hadithnumber": 992,
			"arabicnumber": 992,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، أن عمر بن الخطاب، كان يقول اللهم إني أسألك شهادة في سبيلك ووفاة ببلد رسولك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 992
			}
		},
		{
			"hadithnumber": 993,
			"arabicnumber": 993,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن عمر بن الخطاب، قال كرم المؤمن تقواه ودينه حسبه ومروءته خلقه والجرأة والجبن غرائز يضعها الله حيث شاء فالجبان يفر عن أبيه وأمه والجريء يقاتل عما لا يؤوب به إلى رحله والقتل حتف من الحتوف والشهيد من احتسب نفسه على الله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 993
			}
		},
		{
			"hadithnumber": 994,
			"arabicnumber": 994,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 994
			}
		},
		{
			"hadithnumber": 995,
			"arabicnumber": 995,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، أن عمر بن الخطاب، كان يحمل في العام الواحد على أربعين ألف بعير يحمل الرجل إلى الشام على بعير ويحمل الرجلين إلى العراق على بعير فجاءه رجل من أهل العراق فقال احملني وسحيما ‏.‏ فقال له عمر بن الخطاب نشدتك الله أسحيم زق قال له نعم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 995
			}
		},
		{
			"hadithnumber": 996,
			"arabicnumber": 996,
			"text": "حدثني يحيى، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا ذهب إلى قباء يدخل على أم حرام بنت ملحان فتطعمه وكانت أم حرام تحت عبادة بن الصامت فدخل عليها رسول الله صلى الله عليه وسلم يوما فأطعمته وجلست تفلي في رأسه فنام رسول الله صلى الله عليه",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 996
			}
		},
		{
			"hadithnumber": 997,
			"arabicnumber": 997,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لولا أن أشق على أمتي لأحببت أن لا أتخلف عن سرية تخرج في سبيل الله ولكني لا أجد ما أحملهم عليه ولا يجدون ما يتحملون عليه فيخرجون ويشق عليهم أن يتخلفوا بعدي فوددت أني أقاتل في سبيل الله فأقتل ثم أحيا فأقتل ثم أحيا فأقتل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 997
			}
		},
		{
			"hadithnumber": 998,
			"arabicnumber": 998,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، قال لما كان يوم أحد قال رسول الله صلى الله عليه وسلم ‏ \"‏ من يأتيني بخبر سعد بن الربيع الأنصاري ‏\"‏ ‏.‏ فقال رجل أنا يا رسول الله ‏.‏ فذهب الرجل يطوف بين القتلى فقال له سعد بن الربيع ما شأنك فقال له الرجل بعثني إليك رسول الله صلى الله عليه وسلم لآتيه بخبرك ‏.‏ قال فاذهب إليه فأقرئه مني السلام وأخبره أني قد طعنت اثنتى عشرة طعنة وأني قد أنفذت مقاتلي وأخبر قومك أنه لا عذر لهم عند الله إن قتل رسول الله صلى الله عليه وسلم وواحد منهم حى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 998
			}
		},
		{
			"hadithnumber": 999,
			"arabicnumber": 999,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن رسول الله صلى الله عليه وسلم رغب في الجهاد وذكر الجنة ورجل من الأنصار يأكل تمرات في يده فقال إني لحريص على الدنيا إن جلست حتى أفرغ منهن ‏.‏ فرمى ما في يده فحمل بسيفه فقاتل حتى قتل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 999
			}
		},
		{
			"hadithnumber": 1000,
			"arabicnumber": 1000,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن معاذ بن جبل، أنه قال الغزو غزوان فغزو تنفق فيه الكريمة ويياسر فيه الشريك ويطاع فيه ذو الأمر ويجتنب فيه الفساد فذلك الغزو خير كله وغزو لا تنفق فيه الكريمة ولا يياسر فيه الشريك ولا يطاع فيه ذو الأمر ولا يجتنب فيه الفساد فذلك الغزو لا يرجع صاحبه كفافا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1000
			}
		},
		{
			"hadithnumber": 1001,
			"arabicnumber": 1001,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الخيل في نواصيها الخير إلى يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1001
			}
		},
		{
			"hadithnumber": 1002,
			"arabicnumber": 1002,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم سابق بين الخيل التي قد أضمرت من الحفياء وكان أمدها ثنية الوداع وسابق بين الخيل التي لم تضمر من الثنية إلى مسجد بني زريق وأن عبد الله بن عمر كان ممن سابق بها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1002
			}
		},
		{
			"hadithnumber": 1003,
			"arabicnumber": 1003,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه سمع سعيد بن المسيب، يقول ليس برهان الخيل بأس إذا دخل فيها محلل فإن سبق أخذ السبق وإن سبق لم يكن عليه شىء ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1003
			}
		},
		{
			"hadithnumber": 1004,
			"arabicnumber": 1004,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن رسول الله صلى الله عليه وسلم رئي وهو يمسح وجه فرسه بردائه فسئل عن ذلك فقال ‏ \"‏ إني عوتبت الليلة في الخيل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1004
			}
		},
		{
			"hadithnumber": 1005,
			"arabicnumber": 1005,
			"text": "وحدثني عن مالك، عن حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم حين خرج إلى خيبر أتاها ليلا وكان إذا أتى قوما بليل لم يغر حتى يصبح فخرجت يهود بمساحيهم ومكاتلهم فلما رأوه قالوا محمد والله محمد والخميس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ الله أكبر خربت خيبر إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1005
			}
		},
		{
			"hadithnumber": 1006,
			"arabicnumber": 1006,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن بن عوف، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله نودي في الجنة يا عبد الله هذا خير فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ فقال أبو بكر الصديق يا رسول الله ما على من يدعى من هذه الأبواب من ضرورة فهل يدعى أحد من هذه الأبواب كلها قال ‏\"‏ نعم وأرجو أن تكون منهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1006
			}
		},
		{
			"hadithnumber": 1007,
			"arabicnumber": 1007,
			"text": "حدثني يحيى، عن مالك، عن عبد الرحمن بن أبي صعصعة، أنه بلغه أن عمرو بن الجموح، وعبد الله بن عمرو الأنصاريين، ثم السلميين كانا قد حفر السيل قبرهما وكان قبرهما مما يلي السيل وكانا في قبر واحد وهما ممن استشهد يوم أحد فحفر عنهما ليغيرا من مكانهما فوجدا لم يتغيرا كأنهما ماتا بالأمس وكان أحدهما قد جرح فوضع يده على جرحه فدفن وهو كذلك فأميطت يده عن جرحه ثم أرسلت فرجعت كما كانت وكان بين أحد وبين يوم حفر عنهما ست وأربعون سنة ‏.‏ قال مالك لا بأس أن يدفن الرجلان والثلاثة في قبر واحد من ضرورة ويجعل الأكبر مما يلي القبلة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1007
			}
		},
		{
			"hadithnumber": 1008,
			"arabicnumber": 1008,
			"text": "حدثني عن مالك، عن ربيعة بن أبي عبد الرحمن، أنه قال قدم على أبي بكر الصديق مال من البحرين فقال من كان له عند رسول الله صلى الله عليه وسلم وأى أو عدة فليأتني فجاءه جابر بن عبد الله فحفن له ثلاث حفنات ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 1008
			}
		}
	]
}