{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"27": "Fara'id"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1074,
			"arabicnumber": 1074,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، أنه بلغه أن معاوية بن أبي سفيان، كتب إلى زيد بن ثابت يسأله عن الجد، فكتب إليه زيد بن ثابت إنك كتبت إلى تسألني عن الجد، والله، أعلم وذلك مما لم يكن يقضي فيه إلا الأمراء - يعني الخلفاء - وقد حضرت الخليفتين قبلك يعطيانه النصف مع الأخ الواحد والثلث مع الاثنين فإن كثرت الإخوة لم ينقصوه من الثلث ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1074
			}
		},
		{
			"hadithnumber": 1075,
			"arabicnumber": 1075,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن قبيصة بن ذؤيب، أن عمر بن الخطاب، فرض للجد الذي يفرض الناس له اليوم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1075
			}
		},
		{
			"hadithnumber": 1076,
			"arabicnumber": 1076,
			"text": "وحدثني عن مالك، أنه بلغه عن سليمان بن يسار، أنه قال فرض عمر بن الخطاب وعثمان بن عفان وزيد بن ثابت للجد مع الإخوة الثلث ‏.‏ قال مالك والأمر المجتمع عليه عندنا والذي أدركت عليه أهل العلم ببلدنا أن الجد أبا الأب لا يرث مع الأب دنيا شيئا وهو يفرض له مع الولد الذكر ومع ابن الابن الذكر السدس فريضة وهو فيما سوى ذلك ما لم يترك المتوفى أخا أو أختا لأبيه يبدأ بأحد إن شركه بفريضة مسماة فيعطون فرائضهم فإن فضل من المال السدس فما فوقه فرض للجد السدس فريضة ‏.‏ قال مالك والجد والإخوة للأب والأم إذا شركهم أحد بفريضة مسماة يبدأ بمن شركهم من أهل الفرائض فيعطون فرائضهم فما بقي بعد ذلك للجد والإخوة من شىء فإنه ينظر أى ذلك أفضل لحظ الجد أعطيه الثلث مما بقي له وللإخوة أو يكون بمنزلة رجل من الإخوة فيما يحصل له ولهم يقاسمهم بمثل حصة أحدهم أو السدس من رأس المال كله أى ذلك كان أفضل لحظ الجد أعطيه الجد وكان ما بقي بعد ذلك للإخوة للأب والأم للذكر مثل حظ الأنثيين إلا في فريضة واحدة تكون قسمتهم فيها على غير ذلك وتلك الفريضة امرأة توفيت وتركت زوجها وأمها وأختها لأمها وأبيها وجدها فللزوج النصف وللأم الثلث وللجد السدس وللأخت للأم والأب النصف ثم يجمع سدس الجد ونصف الأخت فيقسم أثلاثا للذكر مثل حظ الأنثيين فيكون للجد ثلثاه وللأخت ثلثه ‏.‏ قال مالك وميراث الإخوة للأب مع الجد إذا لم يكن معهم إخوة لأب وأم كميراث الإخوة للأب والأم سواء ذكرهم كذكرهم وأنثاهم كأنثاهم فإذا اجتمع الإخوة للأب والأم والإخوة للأب فإن الإخوة للأب والأم يعادون الجد بإخوتهم لأبيهم فيمنعونه بهم كثرة الميراث بعددهم ولا يعادونه بالإخوة للأم لأنه لو لم يكن مع الجد غيرهم لم يرثوا معه شيئا وكان المال كله للجد فما حصل للإخوة من بعد حظ الجد فإنه يكون للإخوة من الأب والأم دون الإخوة للأب ولا يكون للإخوة للأب معهم شىء إلا أن يكون الإخوة للأب والأم امرأة واحدة فإن كانت امرأة واحدة فإنها تعاد الجد بإخوتها لأبيها ما كانوا فما حصل لهم ولها من شىء كان لها دونهم ما بينها وبين أن تستكمل فريضتها وفريضتها النصف من رأس المال كله فإن كان فيما يحاز لها ولإخوتها لأبيها فضل عن نصف رأس المال كله فهو لإخوتها لأبيها للذكر مثل حظ الأنثيين فإن لم يفضل شىء فلا شىء لهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1076
			}
		},
		{
			"hadithnumber": 1077,
			"arabicnumber": 1077,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن عثمان بن إسحاق بن خرشة، عن قبيصة بن ذؤيب، أنه قال جاءت الجدة إلى أبي بكر الصديق تسأله ميراثها فقال لها أبو بكر ما لك في كتاب الله شىء وما علمت لك في سنة رسول الله صلى الله عليه وسلم شيئا فارجعي حتى أسأل الناس فسأل الناس ‏.‏ فقال المغيرة بن شعبة حضرت رسول الله صلى الله عليه وسلم أعطاها السدس ‏.‏ فقال أبو بكر هل معك غيرك فقام محمد بن مسلمة الأنصاري فقال مثل ما قال المغيرة فأنفذه لها أبو بكر الصديق ثم جاءت الجدة الأخرى إلى عمر بن الخطاب تسأله ميراثها فقال لها ما لك في كتاب الله شىء وما كان القضاء الذي قضي به إلا لغيرك وما أنا بزائد في الفرائض شيئا ولكنه ذلك السدس فإن اجتمعتما فهو بينكما وأيتكما خلت به فهو لها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1077
			}
		},
		{
			"hadithnumber": 1078,
			"arabicnumber": 1078,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن القاسم بن محمد، أنه قال أتت الجدتان إلى أبي بكر الصديق فأراد أن يجعل السدس، للتي من قبل الأم فقال له رجل من الأنصار أما إنك تترك التي لو ماتت وهو حى كان إياها يرث فجعل أبو بكر السدس بينهما ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1078
			}
		},
		{
			"hadithnumber": 1079,
			"arabicnumber": 1079,
			"text": "وحدثني عن مالك، عن عبد ربه بن سعيد، أن أبا بكر بن عبد الرحمن بن الحارث بن هشام، كان لا يفرض إلا للجدتين ‏.‏ قال مالك الأمر المجتمع عليه عندنا الذي لا اختلاف فيه والذي أدركت عليه أهل العلم ببلدنا أن الجدة أم الأم لا ترث مع الأم دنيا شيئا وهي فيما سوى ذلك يفرض لها السدس فريضة وأن الجدة أم الأب لا ترث مع الأم ولا مع الأب شيئا وهي فيما سوى ذلك يفرض لها السدس فريضة فإذا اجتمعت الجدتان أم الأب وأم الأم وليس للمتوفى دونهما أب ولا أم ‏.‏ قال مالك فإني سمعت أن أم الأم إن كانت أقعدهما كان لها السدس دون أم الأب وإن كانت أم الأب أقعدهما أو كانتا في القعدد من المتوفى بمنزلة سواء فإن السدس بينهما نصفان ‏.‏ قال مالك ولا ميراث لأحد من الجدات إلا للجدتين لأنه بلغني أن رسول الله صلى الله عليه وسلم ورث الجدة ثم سأل أبو بكر عن ذلك حتى أتاه الثبت عن رسول الله صلى الله عليه وسلم أنه ورث الجدة فأنفذه لها ثم أتت الجدة الأخرى إلى عمر بن الخطاب فقال لها ما أنا بزائد في الفرائض شيئا فإن اجتمعتما فهو بينكما وأيتكما خلت به فهو لها ‏.‏ قال مالك ثم لم نعلم أحدا ورث غير جدتين منذ كان الإسلام إلى اليوم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1079
			}
		},
		{
			"hadithnumber": 1080,
			"arabicnumber": 1080,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، أن عمر بن الخطاب، سأل رسول الله صلى الله عليه وسلم عن الكلالة فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ يكفيك من ذلك الآية التي أنزلت في الصيف آخر سورة النساء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1080
			}
		},
		{
			"hadithnumber": 1081,
			"arabicnumber": 1081,
			"text": "حدثني يحيى، عن مالك، عن محمد بن أبي بكر بن محمد بن عمرو بن حزم، عن عبد الرحمن بن حنظلة الزرقي، أنه أخبره عن مولى، لقريش كان قديما يقال له ابن مرسى أنه قال كنت جالسا عند عمر بن الخطاب فلما صلى الظهر قال يا يرفا هلم ذلك الكتاب - لكتاب كتبه في شأن العمة - فنسأل عنها ونستخبر فيها ‏.‏ فأتاه به يرفا فدعا بتور أو قدح فيه ماء فمحا ذلك الكتاب فيه ثم قال لو رضيك الله وارثة أقرك لو رضيك الله أقرك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1081
			}
		},
		{
			"hadithnumber": 1082,
			"arabicnumber": 1082,
			"text": "وحدثني عن مالك، عن محمد بن أبي بكر بن حزم، أنه سمع أباه، كثيرا يقول كان عمر بن الخطاب يقول عجبا للعمة تورث ولا ترث ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1082
			}
		},
		{
			"hadithnumber": 1083,
			"arabicnumber": 1083,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن علي بن حسين بن علي، عن عمر بن عثمان بن عفان، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يرث المسلم الكافر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1083
			}
		},
		{
			"hadithnumber": 1084,
			"arabicnumber": 1084,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن علي بن حسين بن علي بن أبي طالب، أنه أخبره إنما، ورث أبا طالب عقيل وطالب ولم يرثه علي - قال - فلذلك تركنا نصيبنا من الشعب ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1084
			}
		},
		{
			"hadithnumber": 1085,
			"arabicnumber": 1085,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سليمان بن يسار، أن محمد بن الأشعث، أخبره أن عمة له يهودية أو نصرانية توفيت وأن محمد بن الأشعث ذكر ذلك لعمر بن الخطاب وقال له من يرثها فقال له عمر بن الخطاب يرثها أهل دينها ‏.‏ ثم أتى عثمان بن عفان فسأله عن ذلك فقال له عثمان أتراني نسيت ما قال لك عمر بن الخطاب يرثها أهل دينها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1085
			}
		},
		{
			"hadithnumber": 1086,
			"arabicnumber": 1086,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن إسماعيل بن أبي حكيم، أن نصرانيا، أعتقه عمر بن عبد العزيز هلك - قال إسماعيل - فأمرني عمر بن عبد العزيز أن أجعل ماله في بيت المال ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1086
			}
		},
		{
			"hadithnumber": 1087,
			"arabicnumber": 1087,
			"text": "وحدثني عن مالك، عن الثقة، عنده أنه سمع سعيد بن المسيب، يقول أبى عمر بن الخطاب أن يورث، أحدا من الأعاجم إلا أحدا ولد في العرب ‏.‏ قال مالك وإن جاءت امرأة حامل من أرض العدو فوضعته في أرض العرب فهو ولدها يرثها إن ماتت وترثه إن مات ميراثها في كتاب الله ‏.‏ قال مالك الأمر المجتمع عليه عندنا والسنة التي لا اختلاف فيها والذي أدركت عليه أهل العلم ببلدنا أنه لا يرث المسلم الكافر بقرابة ولا ولاء ولا رحم ولا يحجب أحدا عن ميراثه ‏.‏ قال مالك وكذلك كل من لا يرث إذا لم يكن دونه وارث فإنه لا يحجب أحدا عن ميراثه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1087
			}
		},
		{
			"hadithnumber": 1088,
			"arabicnumber": 1088,
			"text": "حدثني يحيى، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن غير، واحد، من علمائهم ‏.‏ أنه لم يتوارث من قتل يوم الجمل ويوم صفين ويوم الحرة ثم كان يوم قديد فلم يورث أحد منهم من صاحبه شيئا إلا من علم أنه قتل قبل صاحبه ‏.‏ قال مالك وذلك الأمر الذي لا اختلاف فيه ولا شك عند أحد من أهل العلم ببلدنا وكذلك العمل في كل متوارثين هلكا بغرق أو قتل أو غير ذلك من الموت إذا لم يعلم أيهما مات قبل صاحبه لم يرث أحد منهما من صاحبه شيئا وكان ميراثهما لمن بقي من ورثتهما يرث كل واحد منهما ورثته من الأحياء ‏.‏ وقال مالك لا ينبغي أن يرث أحد أحدا بالشك ولا يرث أحد أحدا إلا باليقين من العلم والشهداء وذلك أن الرجل يهلك هو ومولاه الذي أعتقه أبوه فيقول بنو الرجل العربي قد ورثه أبونا فليس ذلك لهم أن يرثوه بغير علم ولا شهادة إنه مات قبله وإنما يرثه أولى الناس به من الأحياء ‏.‏ قال مالك ومن ذلك أيضا الأخوان للأب والأم يموتان ولأحدهما ولد والآخر لا ولد له ولهما أخ لأبيهما فلا يعلم أيهما مات قبل صاحبه فميراث الذي لا ولد له لأخيه لأبيه وليس لبني أخيه لأبيه وأمه شىء ‏.‏ قال مالك ومن ذلك أيضا أن تهلك العمة وابن أخيها أو ابنة الأخ وعمها فلا يعلم أيهما مات قبل فإن لم يعلم أيهما مات قبل لم يرث العم من ابنة أخيه شيئا ولا يرث ابن الأخ من عمته شيئا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1088
			}
		},
		{
			"hadithnumber": 1089,
			"arabicnumber": 1089,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عروة بن الزبير، كان يقول في ولد الملاعنة وولد الزنا إنه إذا مات ورثته أمه حقها في كتاب الله عز وجل وإخوته لأمه حقوقهم ويرث البقية موالي أمه إن كانت مولاة وإن كانت عربية ورثت حقها وورث إخوته لأمه حقوقهم وكان ما بقي للمسلمين ‏.‏ قال مالك وبلغني عن سليمان بن يسار، مثل ذلك ‏.‏ قال مالك وعلى ذلك أدركت أهل العلم ببلدنا ‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 27,
				"hadith": 1089
			}
		}
	]
}