{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"28": "Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1091,
			"arabicnumber": 1091,
			"text": "حدثني يحيى، عن مالك، عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يخطب أحدكم على خطبة أخيه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1091
			}
		},
		{
			"hadithnumber": 1092,
			"arabicnumber": 1092,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يخطب أحدكم على خطبة أخيه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1092
			}
		},
		{
			"hadithnumber": 1093,
			"arabicnumber": 1093,
			"text": "وحدثني عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، أنه كان يقول في قول الله تبارك وتعالى ‏{‏ولا جناح عليكم فيما عرضتم به من خطبة النساء أو أكننتم في أنفسكم علم الله أنكم ستذكرونهن ولكن لا تواعدوهن سرا إلا أن تقولوا قولا معروفا‏}‏ أن يقول الرجل للمرأة وهي في عدتها من وفاة زوجها إنك على لكريمة وإني فيك لراغب وإن الله لسائق إليك خيرا ورزقا ونحو هذا من القول ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1093
			}
		},
		{
			"hadithnumber": 1094,
			"arabicnumber": 1094,
			"text": "حدثني مالك، عن عبد الله بن الفضل، عن نافع بن جبير بن مطعم، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الأيم أحق بنفسها من وليها والبكر تستأذن في نفسها وإذنها صماتها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1094
			}
		},
		{
			"hadithnumber": 1095,
			"arabicnumber": 1095,
			"text": "وحدثني عن مالك، أنه بلغه عن سعيد بن المسيب، أنه قال قال عمر بن الخطاب لا تنكح المرأة إلا بإذن وليها أو ذي الرأى من أهلها أو السلطان ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1095
			}
		},
		{
			"hadithnumber": 1096,
			"arabicnumber": 1096,
			"text": "وحدثني عن مالك، أنه بلغه أن القاسم بن محمد، وسالم بن عبد الله، كانا ينكحان بناتهما الأبكار ولا يستأمرانهن ‏.‏ قال مالك وذلك الأمر عندنا في نكاح الأبكار ‏.‏ قال مالك وليس للبكر جواز في مالها حتى تدخل بيتها ويعرف من حالها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1096
			}
		},
		{
			"hadithnumber": 1097,
			"arabicnumber": 1097,
			"text": "وحدثني عن مالك، أنه بلغه أن القاسم بن محمد، وسالم بن عبد الله، وسليمان بن يسار، كانوا يقولون في البكر يزوجها أبوها بغير إذنها إن ذلك لازم لها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1097
			}
		},
		{
			"hadithnumber": 1098,
			"arabicnumber": 1098,
			"text": "حدثني يحيى، عن مالك، عن أبي حازم بن دينار، عن سهل بن سعد الساعدي، ‏.‏ أن رسول الله صلى الله عليه وسلم جاءته امرأة فقالت يا رسول الله إني قد وهبت نفسي لك فقامت قياما طويلا فقام رجل فقال يا رسول الله زوجنيها إن لم تكن لك بها حاجة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل عندك من شىء تصدقها إياه ‏\"‏ ‏.‏ فقال ما عندي إلا إزاري هذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أعطيتها إياه جلست لا إزار لك فالتمس شيئا ‏\"‏ ‏.‏ فقال ما أجد شيئا ‏.‏ قال ‏\"‏ التمس ولو خاتما من حديد ‏\"‏ ‏.‏ فالتمس فلم يجد شيئا ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ هل معك من القرآن شىء ‏\"‏ ‏.‏ فقال نعم معي سورة كذا وسورة كذا ‏.‏ لسور سماها ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ قد أنكحتكها بما معك من القرآن ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1098
			}
		},
		{
			"hadithnumber": 1099,
			"arabicnumber": 1099,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه قال قال عمر بن الخطاب أيما رجل تزوج امرأة وبها جنون أو جذام أو برص فمسها فلها صداقها كاملا وذلك لزوجها غرم على وليها ‏.‏ قال مالك وإنما يكون ذلك غرما على وليها لزوجها إذا كان وليها الذي أنكحها هو أبوها أو أخوها أو من يرى أنه يعلم ذلك منها فأما إذا كان وليها الذي أنكحها ابن عم أو مولى أو من العشيرة ممن يرى أنه لا يعلم ذلك منها فليس عليه غرم وترد تلك المرأة ما أخذته من صداقها ويترك لها قدر ما تستحل به ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1099
			}
		},
		{
			"hadithnumber": 1100,
			"arabicnumber": 1100,
			"text": "وحدثني عن مالك، عن نافع، أن ابنة عبيد الله بن عمر، - وأمها بنت زيد بن الخطاب - كانت تحت ابن لعبد الله بن عمر فمات ولم يدخل بها ولم يسم لها صداقا فابتغت أمها صداقها فقال عبد الله بن عمر ليس لها صداق ولو كان لها صداق لم نمسكه ولم نظلمها ‏.‏ فأبت أمها أن تقبل ذلك فجعلوا بينهم زيد بن ثابت فقضى أن لا صداق لها ولها الميراث ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1100
			}
		},
		{
			"hadithnumber": 1101,
			"arabicnumber": 1101,
			"text": "وحدثني عن مالك، أنه بلغه أن عمر بن عبد العزيز، كتب في خلافته إلى بعض عماله أن كل ما اشترط المنكح - من كان أبا أو غيره - من حباء أو كرامة فهو للمرأة إن ابتغته ‏.‏ قال مالك في المرأة ينكحها أبوها ويشترط في صداقها الحباء يحبى به إن ما كان من شرط يقع به النكاح فهو لابنته إن ابتغته وإن فارقها زوجها قبل أن يدخل بها فلزوجها شطر الحباء الذي وقع به النكاح ‏.‏ قال مالك في الرجل يزوج ابنه صغيرا لا مال له إن الصداق على أبيه إذا كان الغلام يوم تزوج لا مال له وإن كان للغلام مال فالصداق في مال الغلام إلا أن يسمي الأب أن الصداق عليه وذلك النكاح ثابت على الابن إذا كان صغيرا وكان في ولاية أبيه ‏.‏ قال مالك في طلاق الرجل امرأته قبل أن يدخل بها وهي بكر فيعفو أبوها عن نصف الصداق إن ذلك جائز لزوجها من أبيها فيما وضع عنه ‏.‏ قال مالك وذلك أن الله تبارك وتعالى قال في كتابه ‏{‏إلا أن يعفون‏}‏ فهن النساء اللاتي قد دخل بهن ‏{‏أو يعفو الذي بيده عقدة النكاح‏}‏ فهو الأب في ابنته البكر والسيد في أمته ‏.‏ قال مالك وهذا الذي سمعت في ذلك والذي عليه الأمر عندنا ‏.‏ قال مالك في اليهودية أو النصرانية تحت اليهودي أو النصراني فتسلم قبل أن يدخل بها أنه لا صداق لها ‏.‏ قال مالك لا أرى أن تنكح المرأة بأقل من ربع دينار وذلك أدنى ما يجب فيه القطع ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1101
			}
		},
		{
			"hadithnumber": 1102,
			"arabicnumber": 1102,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أن عمر بن الخطاب، قضى في المرأة إذا تزوجها الرجل أنه إذا أرخيت الستور فقد وجب الصداق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1102
			}
		},
		{
			"hadithnumber": 1103,
			"arabicnumber": 1103,
			"text": "وحدثني عن مالك، عن ابن شهاب، أن زيد بن ثابت، كان يقول إذا دخل الرجل بامرأته فأرخيت عليهما الستور فقد وجب الصداق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1103
			}
		},
		{
			"hadithnumber": 1104,
			"arabicnumber": 1104,
			"text": "وحدثني عن مالك، أنه بلغه أن سعيد بن المسيب، كان يقول إذا دخل الرجل بالمرأة في بيتها صدق الرجل عليها وإذا دخلت عليه في بيته صدقت عليه ‏.‏ قال مالك أرى ذلك في المسيس إذا دخل عليها في بيتها فقالت قد مسني وقال لم أمسها صدق عليها فإن دخلت عليه في بيته فقال لم أمسها وقالت قد مسني صدقت عليه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1104
			}
		},
		{
			"hadithnumber": 1105,
			"arabicnumber": 1105,
			"text": "حدثني يحيى، عن مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن عبد الملك بن أبي بكر بن عبد الرحمن بن الحارث بن هشام المخزومي، عن أبيه، أن رسول الله صلى الله عليه وسلم حين تزوج أم سلمة وأصبحت عنده قال لها ‏ \"‏ ليس بك على أهلك هوان إن شئت سبعت عندك وسبعت عندهن وإن شئت ثلثت عندك ودرت ‏\"‏ ‏.‏ فقالت ثلث ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1105
			}
		},
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "وحدثني عن مالك، عن حميد الطويل، عن أنس بن مالك، أنه كان يقول للبكر سبع وللثيب ثلاث ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1106
			}
		},
		{
			"hadithnumber": 1107,
			"arabicnumber": 1107,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن سعيد بن المسيب، سئل عن المرأة، تشترط على زوجها أنه لا يخرج بها من بلدها فقال سعيد بن المسيب يخرج بها إن شاء ‏.‏ قال مالك فالأمر عندنا ذلك أنه إذا شرط الرجل للمرأة وإن كان ذلك عند عقدة النكاح أن لا أنكح عليك ولا أتسرر إن ذلك ليس بشىء إلا أن يكون في ذلك يمين بطلاق أو عتاقة فيجب ذلك عليه ويلزمه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1107
			}
		},
		{
			"hadithnumber": 1108,
			"arabicnumber": 1108,
			"text": "حدثني يحيى، عن مالك، عن المسور بن رفاعة القرظي، عن الزبير بن عبد الرحمن بن الزبير، أن رفاعة بن سموال، طلق امرأته تميمة بنت وهب في عهد رسول الله صلى الله عليه وسلم ثلاثا فنكحت عبد الرحمن بن الزبير فاعترض عنها فلم يستطع أن يمسها ففارقها فأراد رفاعة أن ينكحها - وهو زوجها الأول الذي كان طلقها - فذكر ذلك لرسول الله صلى الله عليه وسلم فنهاه عن تزويجها وقال ‏ \"‏ لا تحل لك حتى تذوق العسيلة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1108
			}
		},
		{
			"hadithnumber": 1109,
			"arabicnumber": 1109,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن القاسم بن محمد، عن عائشة، زوج النبي صلى الله عليه وسلم أنها سئلت عن رجل طلق امرأته البتة فتزوجها بعده رجل آخر فطلقها قبل أن يمسها هل يصلح لزوجها الأول أن يتزوجها فقالت عائشة لا حتى يذوق عسيلتها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1109
			}
		},
		{
			"hadithnumber": 1110,
			"arabicnumber": 1110,
			"text": "وحدثني عن مالك، أنه بلغه أن القاسم بن محمد، سئل عن رجل، طلق امرأته البتة ثم تزوجها بعده رجل آخر فمات عنها قبل أن يمسها هل يحل لزوجها الأول أن يراجعها فقال القاسم بن محمد لا يحل لزوجها الأول أن يراجعها ‏.‏ قال مالك في المحلل إنه لا يقيم على نكاحه ذلك حتى يستقبل نكاحا جديدا فإن أصابها في ذلك فلها مهرها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1110
			}
		},
		{
			"hadithnumber": 1111,
			"arabicnumber": 1111,
			"text": "وحدثني يحيى، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يجمع بين المرأة وعمتها ولا بين المرأة وخالتها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1111
			}
		},
		{
			"hadithnumber": 1112,
			"arabicnumber": 1112,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه كان يقول ينهى أن تنكح المرأة على عمتها أو على خالتها وأن يطأ الرجل وليدة وفي بطنها جنين لغيره ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1112
			}
		},
		{
			"hadithnumber": 1113,
			"arabicnumber": 1113,
			"text": "وحدثني يحيى، عن مالك، عن يحيى بن سعيد، أنه قال سئل زيد بن ثابت عن رجل، تزوج امرأة ثم فارقها قبل أن يصيبها هل تحل له أمها فقال زيد بن ثابت لا الأم مبهمة ليس فيها شرط وإنما الشرط في الربائب ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1113
			}
		},
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "وحدثني عن مالك، عن غير، واحد، أن عبد الله بن مسعود، استفتي وهو بالكوفة عن نكاح الأم، بعد الابنة إذا لم تكن الابنة مست فأرخص في ذلك ثم إن ابن مسعود قدم المدينة فسأل عن ذلك فأخبر أنه ليس كما قال وإنما الشرط في الربائب فرجع ابن مسعود إلى الكوفة فلم يصل إلى منزله حتى أتى الرجل الذي أفتاه بذلك فأمره أن يفارق امرأته ‏.‏ قال مالك في الرجل تكون تحته المرأة ثم ينكح أمها فيصيبها إنها تحرم عليه امرأته ويفارقهما جميعا ويحرمان عليه أبدا إذا كان قد أصاب الأم فإن لم يصب الأم لم تحرم عليه امرأته وفارق الأم ‏.‏ وقال مالك في الرجل يتزوج المرأة ثم ينكح أمها فيصيبها إنه لا تحل له أمها أبدا ولا تحل لأبيه ولا لابنه ولا تحل له ابنتها وتحرم عليه امرأته ‏.‏ قال مالك فأما الزنا فإنه لا يحرم شيئا من ذلك لأن الله تبارك وتعالى قال ‏{‏وأمهات نسائكم‏}‏ فإنما حرم ما كان تزويجا ولم يذكر تحريم الزنا فكل تزويج كان على وجه الحلال يصيب صاحبه امرأته فهو بمنزلة التزويج الحلال فهذا الذي سمعت والذي عليه أمر الناس عندنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1114
			}
		},
		{
			"hadithnumber": 1115,
			"arabicnumber": 1115,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الشغار والشغار أن يزوج الرجل ابنته على أن يزوجه الآخر ابنته ليس بينهما صداق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1115
			}
		},
		{
			"hadithnumber": 1116,
			"arabicnumber": 1116,
			"text": "وحدثني عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد بن جارية الأنصاري عن خنساء بنت خدام الأنصارية، أن أباها، زوجها وهي ثيب فكرهت ذلك فأتت رسول الله صلى الله عليه وسلم فرد نكاحه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1116
			}
		},
		{
			"hadithnumber": 1117,
			"arabicnumber": 1117,
			"text": "وحدثني عن مالك، عن أبي الزبير المكي، أن عمر بن الخطاب، أتي بنكاح لم يشهد عليه إلا رجل وامرأة فقال هذا نكاح السر ولا أجيزه ولو كنت تقدمت فيه لرجمت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1117
			}
		},
		{
			"hadithnumber": 1118,
			"arabicnumber": 1118,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن سعيد بن المسيب، وعن سليمان بن يسار، أن طليحة الأسدية، كانت تحت رشيد الثقفي فطلقها فنكحت في عدتها فضربها عمر بن الخطاب وضرب زوجها بالمخفقة ضربات وفرق بينهما ثم قال عمر بن الخطاب أيما امرأة نكحت في عدتها فإن كان زوجها الذي تزوجها لم يدخل بها فرق بينهما ثم اعتدت بقية عدتها من زوجها الأول ثم كان الآخر خاطبا من الخطاب وإن كان دخل بها فرق بينهما ثم اعتدت بقية عدتها من الأول ثم اعتدت من الآخر ثم لا يجتمعان أبدا ‏.‏ قال",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1118
			}
		},
		{
			"hadithnumber": 1119,
			"arabicnumber": 1119,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عبد الله بن عباس، وعبد الله بن عمر، سئلا عن رجل، كانت تحته امرأة حرة فأراد أن ينكح عليها أمة فكرها أن يجمع بينهما ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1119
			}
		},
		{
			"hadithnumber": 1120,
			"arabicnumber": 1120,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه كان يقول لا تنكح الأمة على الحرة إلا أن تشاء الحرة فإن طاعت الحرة فلها الثلثان من القسم ‏.‏ قال مالك ولا ينبغي لحر أن يتزوج أمة وهو يجد طولا لحرة ولا يتزوج أمة إذا لم يجد طولا لحرة إلا أن يخشى العنت وذلك أن الله تبارك وتعالى قال في كتابه ‏{‏ومن لم يستطع منكم طولا أن ينكح المحصنات المؤمنات فمما ملكت أيمانكم من فتياتكم المؤمنات‏}‏ وقال ‏{‏ذلك لمن خشي العنت منكم‏}‏ قال مالك والعنت هو الزنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1120
			}
		},
		{
			"hadithnumber": 1121,
			"arabicnumber": 1121,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن أبي عبد الرحمن، عن زيد بن ثابت، أنه كان يقول في الرجل يطلق الأمة ثلاثا ثم يشتريها إنها لا تحل له حتى تنكح زوجا غيره ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1121
			}
		},
		{
			"hadithnumber": 1122,
			"arabicnumber": 1122,
			"text": "وحدثني عن مالك، أنه بلغه أن سعيد بن المسيب، وسليمان بن يسار، سئلا عن رجل، زوج عبدا له جارية فطلقها العبد البتة ثم وهبها سيدها له هل تحل له بملك اليمين فقالا لا تحل له حتى تنكح زوجا غيره ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1122
			}
		},
		{
			"hadithnumber": 1123,
			"arabicnumber": 1123,
			"text": "وحدثني عن مالك، أنه سأل ابن شهاب عن رجل، كانت تحته أمة مملوكة فاشتراها وقد كان طلقها واحدة فقال تحل له بملك يمينه ما لم يبت طلاقها فإن بت طلاقها فلا تحل له بملك يمينه حتى تنكح زوجا غيره ‏.‏ قال مالك في الرجل ينكح الأمة فتلد منه ثم يبتاعها إنها لا تكون أم ولد له بذلك الولد الذي ولدت منه وهي لغيره حتى تلد منه وهي في ملكه بعد ابتياعه إياها ‏.‏ قال مالك وإن اشتراها وهي حامل منه ثم وضعت عنده كانت أم ولده بذلك الحمل فيما نرى والله أعلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1123
			}
		},
		{
			"hadithnumber": 1124,
			"arabicnumber": 1124,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبيه، أن عمر بن الخطاب، سئل عن المرأة، وابنتها، من ملك اليمين توطأ إحداهما بعد الأخرى فقال عمر ما أحب أن أخبرهما جميعا ‏.‏ ونهى عن ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1124
			}
		},
		{
			"hadithnumber": 1125,
			"arabicnumber": 1125,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن قبيصة بن ذؤيب، أن رجلا، سأل عثمان بن عفان عن الأختين، من ملك اليمين هل يجمع بينهما فقال عثمان أحلتهما آية وحرمتهما آية فأما أنا فلا أحب أن أصنع ذلك ‏.‏ قال فخرج من عنده فلقي رجلا من أصحاب رسول الله صلى الله عليه وسلم فسأله عن ذلك فقال لو كان لي من الأمر شىء ثم وجدت أحدا فعل ذلك لجعلته نكالا ‏.‏ قال ابن شهاب أراه علي بن أبي طالب ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1125
			}
		},
		{
			"hadithnumber": 1126,
			"arabicnumber": 1126,
			"text": "وحدثني عن مالك، أنه بلغه عن الزبير بن العوام، مثل ذلك ‏.‏ قال مالك في الأمة تكون عند الرجل فيصيبها ثم يريد أن يصيب أختها إنها لا تحل له حتى يحرم عليه فرج أختها بنكاح أو عتاقة أو كتابة أو ما أشبه ذلك يزوجها عبده أو غير عبده ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1126
			}
		},
		{
			"hadithnumber": 1127,
			"arabicnumber": 1127,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عمر بن الخطاب، وهب لابنه جارية فقال لا تمسها فإني قد كشفتها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1127
			}
		},
		{
			"hadithnumber": 1128,
			"arabicnumber": 1128,
			"text": "وحدثني عن مالك، عن عبد الرحمن بن المجبر، أنه قال وهب سالم بن عبد الله لابنه جارية قال لا تقربها فإني قد أردتها فلم أنشط إليها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1128
			}
		},
		{
			"hadithnumber": 1129,
			"arabicnumber": 1129,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أن أبا نهشل بن الأسود، قال للقاسم بن محمد إني رأيت جارية لي منكشفا عنها وهي في القمر فجلست منها مجلس الرجل من امرأته فقالت إني حائض فقمت فلم أقربها بعد أفأهبها لابني يطؤها فنهاه القاسم عن ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1129
			}
		},
		{
			"hadithnumber": 1130,
			"arabicnumber": 1130,
			"text": "وحدثني عن مالك، عن إبراهيم بن أبي عبلة، عن عبد الملك بن مروان، أنه وهب لصاحب له جارية ثم سأله عنها فقال قد هممت أن أهبها لابني فيفعل بها كذا وكذا ‏.‏ فقال عبد الملك لمروان كان أورع منك وهب لابنه جارية ثم قال لا تقربها فإني قد رأيت ساقها منكشفة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1130
			}
		},
		{
			"hadithnumber": 1131,
			"arabicnumber": 1131,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، أنه قال المحصنات من النساء هن أولات الأزواج ويرجع ذلك إلى أن الله حرم الزنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1131
			}
		},
		{
			"hadithnumber": 1132,
			"arabicnumber": 1132,
			"text": "وحدثني عن مالك، عن ابن شهاب، وبلغه، عن القاسم بن محمد، أنهما كانا يقولان إذا نكح الحر الأمة فمسها فقد أحصنته ‏.‏ قال مالك وكل من أدركت كان يقول ذلك تحصن الأمة الحر إذا نكحها فمسها فقد أحصنته ‏.‏ قال مالك يحصن العبد الحرة إذا مسها بنكاح ولا تحصن الحرة العبد إلا أن يعتق وهو زوجها فيمسها بعد عتقه فإن فارقها قبل أن يعتق فليس بمحصن حتى يتزوج بعد عتقه ويمس امرأته ‏.‏ قال مالك والأمة إذا كانت تحت الحر ثم فارقها قبل أن تعتق فإنه لا يحصنها نكاحه إياها وهي أمة حتى تنكح بعد عتقها ويصيبها زوجها فذلك إحصانها والأمة إذا كانت تحت الحر فتعتق وهي تحته قبل أن يفارقها فإنه يحصنها إذا عتقت وهي عنده إذا هو أصابها بعد أن تعتق ‏.‏ وقال مالك والحرة النصرانية واليهودية والأمة المسلمة يحصن الحر المسلم إذا نكح إحداهن فأصابها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1132
			}
		},
		{
			"hadithnumber": 1133,
			"arabicnumber": 1133,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي بن أبي طالب عن أبيهما، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم نهى عن متعة النساء يوم خيبر وعن أكل لحوم الحمر الإنسية ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1133
			}
		},
		{
			"hadithnumber": 1134,
			"arabicnumber": 1134,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن عروة بن الزبير، أن خولة بنت حكيم، دخلت على عمر بن الخطاب فقالت إن ربيعة بن أمية استمتع بامرأة فحملت منه ‏.‏ فخرج عمر بن الخطاب فزعا يجر رداءه فقال هذه المتعة ولو كنت تقدمت فيها لرجمت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1134
			}
		},
		{
			"hadithnumber": 1135,
			"arabicnumber": 1135,
			"text": "حدثني يحيى، عن مالك، أنه سمع ربيعة بن أبي عبد الرحمن، يقول ينكح العبد أربع نسوة ‏.‏ قال مالك وهذا أحسن ما سمعت في ذلك ‏.‏ قال مالك والعبد مخالف للمحلل إن أذن له سيده ثبت نكاحه وإن لم يأذن له سيده فرق بينهما والمحلل يفرق بينهما على كل حال إذا أريد بالنكاح التحليل ‏.‏ قال مالك في العبد إذا ملكته امرأته أو الزوج يملك امرأته إن ملك كل واحد منهما صاحبه يكون فسخا بغير طلاق وإن تراجعا بنكاح بعد لم تكن تلك الفرقة طلاقا ‏.‏ قال مالك والعبد إذا أعتقته امرأته إذا ملكته وهي في عدة منه لم يتراجعا إلا بنكاح جديد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1135
			}
		},
		{
			"hadithnumber": 1136,
			"arabicnumber": 1136,
			"text": "حدثني مالك، عن ابن شهاب، أنه بلغه أن نساء، كن في عهد رسول الله صلى الله عليه وسلم يسلمن بأرضهن وهن غير مهاجرات وأزواجهن حين أسلمن كفار منهن بنت الوليد بن المغيرة ‏.‏ وكانت تحت صفوان بن أمية فأسلمت يوم الفتح وهرب زوجها صفوان بن أمية من الإسلام فبعث إليه رسول الله صلى الله عليه وسلم ابن عمه وهب بن عمير برداء رسول الله صلى الله عليه وسلم أمانا لصفوان بن أمية ودعاه رسول الله صلى الله عليه وسلم إلى الإسلام وأن يقدم عليه فإن رضي أمرا قبله وإلا سيره شهرين فلما قدم صفوان على رسول الله صلى الله عليه وسلم بردائه ناداه على رءوس الناس فقال يا محمد إن هذا وهب بن عمير جاءني بردائك وزعم أنك دعوتني إلى القدوم عليك فإن رضيت أمرا قبلته وإلا سيرتني شهرين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ انزل أبا وهب ‏\"‏ ‏.‏ فقال لا والله لا أنزل حتى تبين لي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بل لك تسير أربعة أشهر ‏\"‏ ‏.‏ فخرج رسول الله صلى الله عليه وسلم قبل هوازن بحنين ‏.‏ فأرسل إلى صفوان بن أمية يستعيره أداة وسلاحا عنده فقال صفوان أطوعا أم كرها فقال ‏\"‏ بل طوعا ‏\"‏ ‏.‏ فأعاره الأداة والسلاح التي عنده ثم خرج صفوان مع رسول الله صلى الله عليه وسلم وهو كافر فشهد حنينا والطائف وهو كافر وامرأته مسلمة ولم يفرق رسول الله صلى الله عليه وسلم بينه وبين امرأته حتى أسلم صفوان واستقرت عنده امرأته بذلك النكاح ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1136
			}
		},
		{
			"hadithnumber": 1137,
			"arabicnumber": 1137,
			"text": "وحدثني عن مالك، عن ابن شهاب، أنه قال كان بين إسلام صفوان وبين إسلام امرأته نحو من شهر ‏.‏ قال ابن شهاب ولم يبلغنا أن امرأة هاجرت إلى الله ورسوله وزوجها كافر مقيم بدار الكفر إلا فرقت هجرتها بينها وبين زوجها إلا أن يقدم زوجها مهاجرا قبل أن تنقضي عدتها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1137
			}
		},
		{
			"hadithnumber": 1138,
			"arabicnumber": 1138,
			"text": "وحدثني عن مالك، عن ابن شهاب، أن أم حكيم بنت الحارث بن هشام، وكانت، تحت عكرمة بن أبي جهل فأسلمت يوم الفتح وهرب زوجها عكرمة بن أبي جهل من الإسلام حتى قدم اليمن فارتحلت أم حكيم حتى قدمت عليه باليمن فدعته إلى الإسلام فأسلم وقدم على رسول الله صلى الله عليه وسلم عام الفتح فلما رآه رسول الله صلى الله عليه وسلم وثب إليه فرحا وما عليه رداء حتى بايعه فثبتا على نكاحهما ذلك ‏.‏ قال مالك وإذا أسلم الرجل قبل امرأته وقعت الفرقة بينهما إذا عرض عليها الإسلام فلم تسلم لأن الله تبارك وتعالى يقول في كتابه ‏{‏ولا تمسكوا بعصم الكوافر‏}‏‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1138
			}
		},
		{
			"hadithnumber": 1139,
			"arabicnumber": 1139,
			"text": "وحدثني يحيى، عن مالك، عن حميد الطويل، عن أنس بن مالك، أن عبد الرحمن بن عوف، جاء إلى رسول الله صلى الله عليه وسلم وبه أثر صفرة فسأله رسول الله صلى الله عليه وسلم فأخبره أنه تزوج فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كم سقت إليها ‏\"‏ ‏.‏ فقال زنة نواة من ذهب ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1139
			}
		},
		{
			"hadithnumber": 1140,
			"arabicnumber": 1140,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه قال لقد بلغني أن رسول الله صلى الله عليه وسلم كان يولم بالوليمة ما فيها خبز ولا لحم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1140
			}
		},
		{
			"hadithnumber": 1141,
			"arabicnumber": 1141,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا دعي أحدكم إلى وليمة فليأتها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1141
			}
		},
		{
			"hadithnumber": 1142,
			"arabicnumber": 1142,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن الأعرج، عن أبي هريرة، أنه كان يقول شر الطعام طعام الوليمة يدعى لها الأغنياء ويترك المساكين ومن لم يأت الدعوة فقد عصى الله ورسوله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1142
			}
		},
		{
			"hadithnumber": 1143,
			"arabicnumber": 1143,
			"text": "وحدثني عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول إن خياطا دعا رسول الله صلى الله عليه وسلم لطعام صنعه ‏.‏ قال أنس فذهبت مع رسول الله صلى الله عليه وسلم إلى ذلك الطعام فقرب إليه خبزا من شعير ومرقا فيه دباء ‏.‏ قال أنس فرأيت رسول الله صلى الله عليه وسلم يتتبع الدباء من حول القصعة فلم أزل أحب الدباء بعد ذلك اليوم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1143
			}
		},
		{
			"hadithnumber": 1144,
			"arabicnumber": 1144,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا تزوج أحدكم المرأة أو اشترى الجارية فليأخذ بناصيتها وليدع بالبركة وإذا اشترى البعير فليأخذ بذروة سنامه وليستعذ بالله من الشيطان ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1144
			}
		},
		{
			"hadithnumber": 1145,
			"arabicnumber": 1145,
			"text": "وحدثني عن مالك، عن أبي الزبير المكي، أن رجلا، خطب إلى رجل أخته فذكر أنها قد كانت أحدثت فبلغ ذلك عمر بن الخطاب فضربه - أو كاد يضربه - ثم قال ما لك وللخبر",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1145
			}
		},
		{
			"hadithnumber": 1146,
			"arabicnumber": 1146,
			"text": "وحدثني عن مالك، عن ربيعة بن أبي عبد الرحمن، أن القاسم بن محمد، وعروة بن الزبير، كانا يقولان في الرجل يكون عنده أربع نسوة فيطلق إحداهن البتة أنه يتزوج إن شاء ولا ينتظر أن تنقضي عدتها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1146
			}
		},
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "وحدثني عن مالك، عن ربيعة بن أبي عبد الرحمن، أن القاسم بن محمد، وعروة بن الزبير، أفتيا الوليد بن عبد الملك عام قدم المدينة بذلك غير أن القاسم بن محمد قال طلقها في مجالس شتى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1147
			}
		},
		{
			"hadithnumber": 1148,
			"arabicnumber": 1148,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه قال ثلاث ليس فيهن لعب النكاح والطلاق والعتق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1148
			}
		},
		{
			"hadithnumber": 1149,
			"arabicnumber": 1149,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن رافع بن خديج، أنه تزوج بنت محمد بن مسلمة الأنصاري فكانت عنده حتى كبرت فتزوج عليها فتاة شابة فآثر الشابة عليها فناشدته الطلاق فطلقها واحدة ثم أمهلها حتى إذا كادت تحل راجعها ثم عاد فآثر الشابة فناشدته الطلاق فطلقها واحدة ثم راجعها ثم عاد فآثر الشابة فناشدته الطلاق فقال ما شئت إنما بقيت واحدة فإن شئت استقررت على ما ترين من الأثرة وإن شئت فارقتك ‏.‏ قالت بل أستقر على الأثرة ‏.‏ فأمسكها على ذلك ولم ير رافع عليه إثما حين قرت عنده على الأثرة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 28,
				"hadith": 1149
			}
		}
	]
}