{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"31": "Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1290,
			"arabicnumber": 1290,
			"text": "حدثني يحيى، عن مالك، عن الثقة، عنده عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن بيع العربان ‏.‏ قال مالك: وذلك فيما نرى - والله أعلم - أن يشتري الرجل العبد، أو الوليدة. أو يتكارى الدابة. ثم يقول للذي اشترى منه، أو تكارى منه: أعطيك دينارا، أو درهما، أو أكثر من ذلك، أو أقل. على أني إن أخذت السلعة، أو ركبت ما تكاريت منك، فالذي أعطيتك هو من ثمن السلعة. أو من كراء الدابة، وإن تركت ابتياع السلعة، أو كراء الدابة، فما أعطيتك لك باطل بغير شيء. قال مالك: والأمر عندنا، أنه لا بأس بأن يبتاع العبد التاجر الفصيح، بالأعبد من الحبشة، أو من جنس من الأجناس، ليسوا مثله في الفصاحة، ولا في التجارة، والنفاذ، والمعرفة. لا بأس بهذا، أن يشتري منه العبد بالعبدين، أو بالأعبد إلى أجل معلوم. إذا اختلف، فبان اختلافه .فإن أشبه بعض ذلك بعضا، حتى يتقارب، فلا تأخذن منه اثنين بواحد، إلى أجل. وإن اختلفت أجناسهم. قال مالك: ولا بأس بأن تبيع ما اشتريت من ذلك، قبل أن تستوفيه. إذا انتقدت ثمنه من غير صاحبه الذي اشتريته منه. قال مالك: لا ينبغي أن يستثنى جنين في بطن أمه، إذا بيعت. لأن ذلك غرر. لا يدرى أذكر هو أم (1) أنثى أو حسن (2) أو قبيح، أو ناقص، أو تام، أو حي أو ميت؟. وذلك يضع من ثمنها. قال مالك، في الرجل يبتاع العبد، أو الوليدة، بمائة دينار إلى أجل. ثم يندم البائع. فيسأل المبتاع أن يقيله بعشرة دنانير، يدفعها إليه نقدا. أو إلى أجل. ويمحو عنه المائة دينار التي له. قال مالك: لا بأس بذلك. وإن ندم المبتاع، فسأل البائع أن يقيله في الجارية، أو العبد، ويزيده عشرة دنانير نقدا، أو إلى أجل أبعد من الأجل الذي اشترى إليه العبد، أو الوليدة. فإن ذلك لا ينبغي. وإنما كره ذلك؛ لأن البائع كأنه باع منه مائة دينار له، إلى سنة قبل أن تحل، بجارية، وبعشرة دنانير نقدا. أو إلى أجل أبعد من السنة. فدخل في ذلك بيع الذهب بالذهب إلى أجل. قال مالك، في الرجل يبيع من الرجل الجارية بمائة دينار إلى أجل، ثم يشتريها بأكثر من ذلك الثمن الذي باعها به إلى أبعد من ذلك الأجل، الذي باعها إليه: إن ذلك لا يصلح. وتفسير ما كره من ذلك، أن يبيع الرجل الجارية إلى أجل. ثم يبتاعها إلى أجل أبعد منه. يبيعها بثلاثين دينارا إلى شهر، ثم يبتاعها بستين دينارا، إلى سنة، أو إلى نصف سنة. فصار، إن رجعت إليه سلعته بعينها، وأعطاه صاحبه ثلاثين دينارا، إلى شهر؛ بستين دينارا، إلى سنة، أو إلى نصف سنة. فهذا لا ينبغي",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1290
			}
		},
		{
			"hadithnumber": 1291,
			"arabicnumber": 1291,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن عمر بن الخطاب، قال من باع عبدا وله مال فماله للبائع إلا أن يشترطه المبتاع ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1291
			}
		},
		{
			"hadithnumber": 1292,
			"arabicnumber": 1292,
			"text": "حدثني يحيى، عن مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، أن أبان بن عثمان، وهشام بن إسماعيل، كانا يذكران في خطبتهما عهدة الرقيق في الأيام الثلاثة من حين يشترى العبد أو الوليدة وعهدة السنة ‏.‏ قال مالك ما أصاب العبد أو الوليدة في الأيام الثلاثة من حين يشتريان حتى تنقضي الأيام الثلاثة فهو من البائع وإن عهدة السنة من الجنون والجذام والبرص فإذا مضت السنة فقد برئ البائع من العهدة كلها ‏.‏ قال مالك ومن باع عبدا أو وليدة من أهل الميراث أو غيرهم بالبراءة فقد برئ من كل عيب ولا عهدة عليه إلا أن يكون علم عيبا فكتمه فإن كان علم عيبا فكتمه لم تنفعه البراءة وكان ذلك البيع مردودا ولا عهدة عندنا إلا في الرقيق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1292
			}
		},
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، عن سالم بن عبد الله، أن عبد الله بن عمر، باع غلاما له بثمانمائة درهم وباعه بالبراءة فقال الذي ابتاعه لعبد الله بن عمر بالغلام داء لم تسمه لي ‏.‏ فاختصما إلى عثمان بن عفان ‏.‏ فقال الرجل باعني عبدا وبه داء لم يسمه ‏.‏ وقال عبد الله بعته بالبراءة ‏.‏ فقضى عثمان بن عفان على عبد الله بن عمر أن يحلف له لقد باعه العبد وما به داء يعلمه فأبى عبد الله أن يحلف وارتجع العبد فصح عنده فباعه عبد الله بعد ذلك بألف وخمسمائة درهم ‏.‏ قال مالك الأمر المجتمع عليه عندنا أن كل من ابتاع وليدة فحملت أو عبدا فأعتقه وكل أمر دخله الفوت حتى لا يستطاع رده فقامت البينة إنه قد كان به عيب عند الذي باعه أو علم ذلك باعتراف من البائع أو غيره فإن العبد أو الوليدة يقوم وبه العيب الذي كان به يوم اشتراه فيرد من الثمن قدر ما بين قيمته صحيحا وقيمته وبه ذلك العيب ‏.‏ قال مالك الأمر المجتمع عليه عندنا في الرجل يشتري العبد ثم يظهر منه على عيب يرده منه وقد حدث به عند المشتري عيب آخر إنه إذا كان العيب الذي حدث به مفسدا مثل القطع أو العور أو ما أشبه ذلك من العيوب المفسدة فإن الذي اشترى العبد بخير النظرين إن أحب أن يوضع عنه من ثمن العبد بقدر العيب الذي كان بالعبد يوم اشتراه وضع عنه وإن أحب أن يغرم قدر ما أصاب العبد من العيب عنده ثم يرد العبد فذلك له وإن مات العبد عند الذي اشتراه أقيم العبد وبه العيب الذي كان به يوم اشتراه فينظر كم ثمنه فإن كانت قيمة العبد يوم اشتراه بغير عيب مائة دينار وقيمته يوم اشتراه وبه العيب ثمانون دينارا وضع عن المشتري ما بين القيمتين وإنما تكون القيمة يوم اشتري العبد ‏.‏ قال مالك الأمر المجتمع عليه عندنا أن من رد وليدة من عيب وجده بها وكان قد أصابها أنها إن كانت بكرا فعليه ما نقص من ثمنها وإن كانت ثيبا فليس عليه في إصابته إياها شىء لأنه كان ضامنا لها ‏.‏ قال مالك الأمر المجتمع عليه عندنا فيمن باع عبدا أو وليدة أو حيوانا بالبراءة من أهل الميراث أو غيرهم فقد برئ من كل عيب فيما باع إلا أن يكون علم في ذلك عيبا فكتمه فإن كان علم عيبا فكتمه لم تنفعه تبرئته وكان ما باع مردودا عليه ‏.‏ قال مالك في الجارية تباع بالجاريتين ثم يوجد بإحدى الجاريتين عيب ترد منه قال تقام الجارية التي كانت قيمة الجاريتين فينظر كم ثمنها ثم تقام الجاريتان بغير العيب الذي وجد بإحداهما تقامان صحيحتين سالمتين ثم يقسم ثمن الجارية التي بيعت بالجاريتين عليهما بقدر ثمنهما حتى يقع على كل واحدة منهما حصتها من ذلك على المرتفعة بقدر ارتفاعها وعلى الأخرى بقدرها ثم ينظر إلى التي بها العيب فيرد بقدر الذي وقع عليها من تلك الحصة إن كانت كثيرة أو قليلة وإنما تكون قيمة الجاريتين عليه يوم قبضهما ‏.‏ قال مالك في الرجل يشتري العبد فيؤاجره بالإجارة العظيمة أو الغلة القليلة ثم يجد به عيبا يرد منه إنه يرده بذلك العيب وتكون له إجارته وغلته وهذا الأمر الذي كانت عليه الجماعة ببلدنا وذلك لو أن رجلا ابتاع عبدا فبنى له دارا قيمة بنائها ثمن العبد أضعافا ثم وجد به عيبا يرد منه رده ولا يحسب للعبد عليه إجارة فيما عمل له فكذلك تكون له إجارته إذا آجره من غيره لأنه ضامن له وهذا الأمر عندنا ‏.‏ قال مالك الأمر عندنا فيمن ابتاع رقيقا في صفقة واحدة فوجد في ذلك الرقيق عبدا مسروقا أو وجد بعبد منهم عيبا أنه ينظر فيما وجد مسروقا أو وجد به عيبا فإن كان هو وجه ذلك الرقيق أو أكثره ثمنا أو من أجله اشترى وهو الذي فيه الفضل فيما يرى الناس كان ذلك البيع مردودا كله وإن كان الذي وجد مسروقا أو وجد به العيب من ذلك الرقيق في الشىء اليسير منه ليس هو وجه ذلك الرقيق ولا من أجله اشتري ولا فيه الفضل فيما يرى الناس رد ذلك الذي وجد به العيب أو وجد مسروقا بعينه بقدر قيمته من الثمن الذي اشترى به أولئك الرقيق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1293
			}
		},
		{
			"hadithnumber": 1294,
			"arabicnumber": 1294,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، أن عبيد الله بن عبد الله بن عتبة بن مسعود، أخبره أن عبد الله بن مسعود ابتاع جارية من امرأته زينب الثقفية واشترطت عليه أنك إن بعتها فهي لي بالثمن الذي تبيعها به فسأل عبد الله بن مسعود عن ذلك عمر بن الخطاب فقال عمر بن الخطاب لا تقربها وفيها شرط لأحد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1294
			}
		},
		{
			"hadithnumber": 1295,
			"arabicnumber": 1295,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أنه كان يقول لا يطأ الرجل وليدة إلا وليدة إن شاء باعها وإن شاء وهبها وإن شاء أمسكها وإن شاء صنع بها ما شاء ‏.‏ قال مالك فيمن اشترى جارية على شرط أن لا يبيعها أو لا يهبها أو ما أشبه ذلك من الشروط فإنه لا ينبغي للمشتري أن يطأها وذلك أنه لا يجوز له أن يبيعها ولا يهبها فإذا كان لا يملك ذلك منها فلم يملكها ملكا تاما لأنه قد استثني عليه فيها ما ملكه بيد غيره فإذا دخل هذا الشرط لم يصلح وكان بيعا مكروها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1295
			}
		},
		{
			"hadithnumber": 1296,
			"arabicnumber": 1296,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، أن عبد الله بن عامر، أهدى لعثمان بن عفان جارية ولها زوج ابتاعها بالبصرة فقال عثمان لا أقربها حتى يفارقها زوجها ‏.‏ فأرضى ابن عامر زوجها ففارقها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1296
			}
		},
		{
			"hadithnumber": 1297,
			"arabicnumber": 1297,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، أن عبد الرحمن بن عوف، ابتاع وليدة فوجدها ذات زوج فردها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1297
			}
		},
		{
			"hadithnumber": 1298,
			"arabicnumber": 1298,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من باع نخلا قد أبرت فثمرها للبائع إلا أن يشترط المبتاع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1298
			}
		},
		{
			"hadithnumber": 1299,
			"arabicnumber": 1299,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمار حتى يبدو صلاحها نهى البائع والمشتري ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1299
			}
		},
		{
			"hadithnumber": 1300,
			"arabicnumber": 1300,
			"text": "وحدثني عن مالك، عن حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمار حتى تزهي ‏.‏ فقيل له يا رسول الله وما تزهي فقال ‏\"‏ حين تحمر ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت إذا منع الله الثمرة فبم يأخذ أحدكم مال أخيه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1300
			}
		},
		{
			"hadithnumber": 1301,
			"arabicnumber": 1301,
			"text": "وحدثني عن مالك، عن أبي الرجال، محمد بن عبد الرحمن بن حارثة عن أمه، عمرة بنت عبد الرحمن أن رسول الله صلى الله عليه وسلم نهى عن بيع الثمار حتى تنجو من العاهة ‏.‏ قال مالك وبيع الثمار قبل أن يبدو صلاحها من بيع الغرر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1301
			}
		},
		{
			"hadithnumber": 1302,
			"arabicnumber": 1302,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن خارجة بن زيد بن ثابت، عن زيد بن ثابت، أنه كان لا يبيع ثماره حتى تطلع الثريا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1302
			}
		},
		{
			"hadithnumber": 1303,
			"arabicnumber": 1303,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم أرخص لصاحب العرية أن يبيعها بخرصها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1303
			}
		},
		{
			"hadithnumber": 1304,
			"arabicnumber": 1304,
			"text": "وحدثني عن مالك، عن داود بن الحصين، عن أبي سفيان، مولى ابن أبي أحمد عن أبي هريرة، أن رسول الله صلى الله عليه وسلم أرخص في بيع العرايا بخرصها فيما دون خمسة أوسق أو في خمسة أوسق ‏.‏ يشك داود قال خمسة أوسق أو دون خمسة أوسق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1304
			}
		},
		{
			"hadithnumber": 1305,
			"arabicnumber": 1305,
			"text": "حدثني يحيى، عن مالك، عن أبي الرجال، محمد بن عبد الرحمن عن أمه، عمرة بنت عبد الرحمن أنه سمعها تقول، ابتاع رجل ثمر حائط في زمان رسول الله صلى الله عليه وسلم فعالجه وقام فيه حتى تبين له النقصان فسأل رب الحائط أن يضع له أو أن يقيله فحلف أن لا يفعل فذهبت أم المشتري إلى رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال رسول الله صلى الله عليه وسلم ‏ \"‏ تألى أن لا يفعل خيرا ‏\"‏ ‏.‏ فسمع بذلك رب الحائط فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله هو له ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1305
			}
		},
		{
			"hadithnumber": 1306,
			"arabicnumber": 1306,
			"text": "وحدثني عن مالك، أنه بلغه أن عمر بن عبد العزيز، قضى بوضع الجائحة ‏.‏ قال مالك وعلى ذلك الأمر عندنا ‏.‏ قال مالك والجائحة التي توضع عن المشتري الثلث فصاعدا ولا يكون ما دون ذلك جائحة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1306
			}
		},
		{
			"hadithnumber": 1307,
			"arabicnumber": 1307,
			"text": "حدثني يحيى، عن مالك، عن ربيعة بن أبي عبد الرحمن، أن القاسم بن محمد، كان يبيع ثمر حائطه ويستثني منه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1307
			}
		},
		{
			"hadithnumber": 1308,
			"arabicnumber": 1308,
			"text": "وحدثني عن مالك، عن عبد الله بن أبي بكر، أن جده، محمد بن عمرو بن حزم باع ثمر حائط له يقال له الأفراق بأربعة آلاف درهم واستثنى منه بثمانمائة درهم تمرا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1308
			}
		},
		{
			"hadithnumber": 1309,
			"arabicnumber": 1309,
			"text": "وحدثني عن مالك، عن أبي الرجال، محمد بن عبد الرحمن بن حارثة أن أمه، عمرة بنت عبد الرحمن كانت تبيع ثمارها وتستثني منها ‏.‏ قال مالك الأمر المجتمع عليه عندنا أن الرجل إذا باع ثمر حائطه أن له أن يستثني من ثمر حائطه ما بينه وبين ثلث الثمر لا يجاوز ذلك وما كان دون الثلث فلا بأس بذلك ‏.‏ قال مالك فأما الرجل يبيع ثمر حائطه ويستثني من ثمر حائطه ثمر نخلة أو نخلات يختارها ويسمي عددها فلا أرى بذلك بأسا لأن رب الحائط إنما استثنى شيئا من ثمر حائط نفسه وإنما ذلك شىء احتبسه من حائطه وأمسكه لم يبعه وباع من حائطه ما سوى ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1309
			}
		},
		{
			"hadithnumber": 1310,
			"arabicnumber": 1310,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التمر بالتمر مثلا بمثل ‏\"‏ ‏.‏ فقيل له إن عاملك على خيبر يأخذ الصاع بالصاعين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ادعوه لي ‏\"‏ ‏.‏ فدعي له فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتأخذ الصاع بالصاعين ‏\"‏ ‏.‏ فقال يا رسول الله لا يبيعونني الجنيب بالجمع صاعا بصاع ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ بع الجمع بالدراهم ثم ابتع بالدراهم جنيبا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1310
			}
		},
		{
			"hadithnumber": 1311,
			"arabicnumber": 1311,
			"text": "وحدثني عن مالك، عن عبد الحميد بن سهيل بن عبد الرحمن بن عوف، عن سعيد بن المسيب، عن أبي سعيد الخدري، وعن أبي هريرة، أن رسول الله صلى الله عليه وسلم استعمل رجلا على خيبر فجاءه بتمر جنيب فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏ ‏.‏ فقال لا والله يا رسول الله إنا لنأخذ الصاع من هذا بالصاعين والصاعين بالثلاثة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعل بع الجمع بالدراهم ثم ابتع بالدراهم جنيبا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1311
			}
		},
		{
			"hadithnumber": 1312,
			"arabicnumber": 1312,
			"text": "وحدثني عن مالك، عن عبد الله بن يزيد، أن زيدا أبا عياش، أخبره أنه، سأل سعد بن أبي وقاص عن البيضاء، بالسلت فقال له سعد أيتهما أفضل قال البيضاء ‏.‏ فنهاه عن ذلك ‏.‏ وقال سعد سمعت رسول الله صلى الله عليه وسلم يسأل عن اشتراء التمر بالرطب فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أينقص الرطب إذا يبس ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ فنهى عن ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1312
			}
		},
		{
			"hadithnumber": 1313,
			"arabicnumber": 1313,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن المزابنة والمزابنة بيع الثمر بالتمر كيلا وبيع الكرم بالزبيب كيلا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1313
			}
		},
		{
			"hadithnumber": 1314,
			"arabicnumber": 1314,
			"text": "وحدثني عن مالك، عن داود بن الحصين، عن أبي سفيان، مولى ابن أبي أحمد عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم نهى عن المزابنة والمحاقلة والمزابنة اشتراء الثمر بالتمر في رءوس النخل والمحاقلة كراء الأرض بالحنطة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1314
			}
		},
		{
			"hadithnumber": 1315,
			"arabicnumber": 1315,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم نهى عن المزابنة والمحاقلة والمزابنة اشتراء الثمر بالتمر والمحاقلة اشتراء الزرع بالحنطة واستكراء الأرض بالحنطة ‏.‏ قال ابن شهاب فسألت سعيد بن المسيب عن استكراء الأرض بالذهب والورق فقال لا بأس بذلك ‏.‏ قال مالك نهى رسول الله صلى الله عليه وسلم عن المزابنة وتفسير المزابنة أن كل شىء من الجزاف الذي لا يعلم كيله ولا وزنه ولا عدده ابتيع بشىء مسمى من الكيل أو الوزن أو العدد وذلك أن يقول الرجل للرجل يكون له الطعام المصبر الذي لا يعلم كيله من الحنطة أو التمر أو ما أشبه ذلك من الأطعمة أو يكون للرجل السلعة من الحنطة أو النوى أو القضب أو العصفر أو الكرسف أو الكتان أو القز أو ما أشبه ذلك من السلع لا يعلم كيل شىء من ذلك ولا وزنه ولا عدده فيقول الرجل لرب تلك السلعة كل سلعتك هذه أو مر من يكيلها أو زن من ذلك ما يوزن أو عد من ذلك ما كان يعد فما نقص عن كيل كذا وكذا صاعا - لتسمية يسميها - أو وزن كذا وكذا رطلا أو عدد كذا وكذا فما نقص من ذلك فعلى غرمه لك حتى أوفيك تلك التسمية فما زاد على تلك التسمية فهو لي أضمن ما نقص من ذلك على أن يكون لي ما زاد ‏.‏ فليس ذلك بيعا ولكنه المخاطرة والغرر والقمار يدخل هذا لأنه لم يشتر منه شيئا بشىء أخرجه ولكنه ضمن له ما سمي من ذلك الكيل أو الوزن أو العدد على أن يكون له ما زاد على ذلك فإن نقصت تلك السلعة عن تلك التسمية أخذ من مال صاحبه ما نقص بغير ثمن ولا هبة طيبة بها نفسه فهذا يشبه القمار وما كان مثل هذا من الأشياء فذلك يدخله ‏.‏ قال مالك ومن ذلك أيضا أن يقول الرجل للرجل له الثوب أضمن لك من ثوبك هذا كذا وكذا ظهارة قلنسوة قدر كل ظهارة كذا وكذا - لشىء يسميه - فما نقص من ذلك فعلى غرمه حتى أوفيك وما زاد فلي ‏.‏ أو أن يقول الرجل للرجل أضمن لك من ثيابك هذي كذا وكذا قميصا ذرع كل قميص كذا وكذا فما نقص من ذلك فعلى غرمه وما زاد على ذلك فلي ‏.‏ أو أن يقول الرجل للرجل له الجلود من جلود البقر أو الإبل أقطع جلودك هذه نعالا على إمام يريه إياه ‏.‏ فما نقص من مائة زوج فعلى غرمه وما زاد فهو لي بما ضمنت لك ‏.‏ ومما يشبه ذلك أن يقول الرجل للرجل عنده حب البان اعصر حبك هذا فما نقص من كذا وكذا رطلا فعلى أن أعطيكه وما زاد فهو لي ‏.‏ فهذا كله وما أشبهه من الأشياء أو ضارعه من المزابنة التي لا تصلح ولا تجوز ‏.‏ وكذلك - أيضا - إذا قال الرجل للرجل له الخبط أو النوى أو الكرسف أو الكتان أو القضب أو العصفر أبتاع منك هذا الخبط بكذا وكذا صاعا من خبط يخبط مثل خبطه أو هذا النوى بكذا وكذا صاعا من نوى مثله وفي العصفر والكرسف والكتان والقضب مثل ذلك ‏.‏ فهذا كله يرجع إلى ما وصفنا من المزابنة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1315
			}
		},
		{
			"hadithnumber": 1316,
			"arabicnumber": 1316,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، أنه قال أمر رسول الله صلى الله عليه وسلم السعدين أن يبيعا آنية من المغانم من ذهب أو فضة فباعا كل ثلاثة بأربعة عينا أو كل أربعة بثلاثة عينا فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ أربيتما فردا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1316
			}
		},
		{
			"hadithnumber": 1317,
			"arabicnumber": 1317,
			"text": "وحدثني عن مالك، عن موسى بن أبي تميم، عن أبي الحباب، سعيد بن يسار عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ الدينار بالدينار والدرهم بالدرهم لا فضل بينهما ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1317
			}
		},
		{
			"hadithnumber": 1318,
			"arabicnumber": 1318,
			"text": "وحدثني عن مالك، عن نافع، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تبيعوا الذهب بالذهب إلا مثلا بمثل ولا تشفوا بعضها على بعض ولا تبيعوا الورق بالورق إلا مثلا بمثل ولا تشفوا بعضها على بعض ولا تبيعوا منها شيئا غائبا بناجز ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1318
			}
		},
		{
			"hadithnumber": 1319,
			"arabicnumber": 1319,
			"text": "وحدثني عن مالك، عن حميد بن قيس المكي، عن مجاهد، أنه قال كنت مع عبد الله بن عمر فجاءه صائغ فقال له يا أبا عبد الرحمن إني أصوغ الذهب ثم أبيع الشىء من ذلك بأكثر من وزنه فأستفضل من ذلك قدر عمل يدي ‏.‏ فنهاه عبد الله عن ذلك فجعل الصائغ يردد عليه المسألة وعبد الله ينهاه حتى انتهى إلى باب المسجد أو إلى دابة يريد أن يركبها ثم قال عبد الله بن عمر الدينار بالدينار والدرهم بالدرهم لا فضل بينهما هذا عهد نبينا إلينا وعهدنا إليكم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1319
			}
		},
		{
			"hadithnumber": 1320,
			"arabicnumber": 1320,
			"text": "وحدثني عن مالك، أنه بلغه عن جده، مالك بن أبي عامر أن عثمان بن عفان، قال قال لي رسول الله صلى الله عليه وسلم ‏ \"‏ لا تبيعوا الدينار بالدينارين ولا الدرهم بالدرهمين ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1320
			}
		},
		{
			"hadithnumber": 1321,
			"arabicnumber": 1321,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، أن معاوية بن أبي سفيان، باع سقاية من ذهب أو ورق بأكثر من وزنها فقال أبو الدرداء سمعت رسول الله صلى الله عليه وسلم ينهى عن مثل هذا إلا مثلا بمثل ‏.‏ فقال له معاوية ما أرى بمثل هذا بأسا ‏.‏ فقال أبو الدرداء من يعذرني من معاوية أنا أخبره عن رسول الله صلى الله عليه وسلم ويخبرني عن رأيه لا أساكنك بأرض أنت بها ‏.‏ ثم قدم أبو الدرداء على عمر بن الخطاب فذكر ذلك له فكتب عمر بن الخطاب إلى معاوية أن لا تبيع ذلك إلا مثلا بمثل وزنا بوزن ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1321
			}
		},
		{
			"hadithnumber": 1322,
			"arabicnumber": 1322,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أن عمر بن الخطاب، قال لا تبيعوا الذهب بالذهب إلا مثلا بمثل ولا تشفوا بعضها على بعض ولا تبيعوا الورق بالورق إلا مثلا بمثل ولا تشفوا بعضها على بعض ولا تبيعوا الورق بالذهب أحدهما غائب والآخر ناجز وإن استنظرك إلى أن يلج بيته فلا تنظره إني أخاف عليكم الرماء والرماء هو الربا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1322
			}
		},
		{
			"hadithnumber": 1323,
			"arabicnumber": 1323,
			"text": "وحدثني عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن عمر بن الخطاب، قال لا تبيعوا الذهب بالذهب إلا مثلا بمثل ولا تشفوا بعضها على بعض ولا تبيعوا الورق بالورق إلا مثلا بمثل ولا تشفوا بعضها على بعض ولا تبيعوا شيئا منها غائبا بناجز ‏.‏ وإن استنظرك إلى أن يلج بيته فلا تنظره إني أخاف عليكم الرماء والرماء هو الربا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1323
			}
		},
		{
			"hadithnumber": 1324,
			"arabicnumber": 1324,
			"text": "وحدثني عن مالك، أنه بلغه عن القاسم بن محمد، أنه قال قال عمر بن الخطاب الدينار بالدينار والدرهم بالدرهم والصاع بالصاع ولا يباع كالئ بناجز ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1324
			}
		},
		{
			"hadithnumber": 1325,
			"arabicnumber": 1325,
			"text": "وحدثني عن مالك، عن أبي الزناد، أنه سمع سعيد بن المسيب، يقول لا ربا إلا في ذهب أو فضة أو ما يكال أو يوزن بما يؤكل أو يشرب ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1325
			}
		},
		{
			"hadithnumber": 1326,
			"arabicnumber": 1326,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه سمع سعيد بن المسيب، يقول قطع الذهب والورق من الفساد في الأرض ‏.‏ قال مالك ولا بأس أن يشتري الرجل الذهب بالفضة والفضة بالذهب جزافا إذا كان تبرا أو حليا قد صيغ فأما الدراهم المعدودة والدنانير المعدودة فلا ينبغي لأحد أن يشتري ذلك جزافا حتى يعلم ويعد فإن اشتري ذلك جزافا فإنما يراد به الغرر حين يترك عده ويشترى جزافا وليس هذا من بيوع المسلمين فأما ما كان يوزن من التبر والحلى فلا بأس أن يباع ذلك جزافا وإنما ابتياع ذلك جزافا كهيئة الحنطة والتمر ونحوهما من الأطعمة التي تباع جزافا ومثلها يكال فليس بابتياع ذلك جزافا بأس ‏.‏ قال مالك من اشترى مصحفا أو سيفا أو خاتما وفي شىء من ذلك ذهب أو فضة بدنانير أو دراهم فإن ما اشتري من ذلك وفيه الذهب بدنانير فإنه ينظر إلى قيمته فإن كانت قيمة ذلك الثلثين وقيمة ما فيه من الذهب الثلث فذلك جائز لا بأس به إذا كان ذلك يدا بيد ولا يكون فيه تأخير وما اشتري من ذلك بالورق مما فيه الورق نظر إلى قيمته فإن كان قيمة ذلك الثلثين وقيمة ما فيه من الورق الثلث فذلك جائز لا بأس به إذا كان ذلك يدا بيد ولم يزل ذلك من أمر الناس عندنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1326
			}
		},
		{
			"hadithnumber": 1327,
			"arabicnumber": 1327,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن مالك بن أوس بن الحدثان النصري، أنه التمس صرفا بمائة دينار قال فدعاني طلحة بن عبيد الله فتراوضنا حتى اصطرف مني وأخذ الذهب يقلبها في يده ثم قال حتى يأتيني خازني من الغابة ‏.‏ وعمر بن الخطاب يسمع ‏.‏ فقال عمر والله لا تفارقه حتى تأخذ منه - ثم قال - قال رسول الله صلى الله عليه وسلم ‏ \"‏ الذهب بالورق ربا إلا هاء وهاء والبر بالبر ربا إلا هاء وهاء والتمر بالتمر ربا إلا هاء وهاء والشعير بالشعير ربا إلا هاء وهاء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1327
			}
		},
		{
			"hadithnumber": 1328,
			"arabicnumber": 1328,
			"text": "حدثني يحيى، عن مالك، عن يزيد بن عبد الله بن قسيط، أنه رأى سعيد بن المسيب يراطل الذهب بالذهب فيفرغ ذهبه في كفة الميزان ويفرغ صاحبه الذي يراطله ذهبه في كفة الميزان الأخرى فإذا اعتدل لسان الميزان أخذ وأعطى ‏.‏ قال مالك الأمر عندنا في بيع الذهب بالذهب والورق بالورق مراطلة أنه لا بأس بذلك أن يأخذ أحد عشر دينارا بعشرة دنانير يدا بيد إذا كان وزن الذهبين سواء عينا بعين وإن تفاضل العدد والدراهم أيضا في ذلك بمنزلة الدنانير ‏.‏ قال مالك من راطل ذهبا بذهب أو ورقا بورق فكان بين الذهبين فضل مثقال فأعطى صاحبه قيمته من الورق أو من غيرها فلا يأخذه فإن ذلك قبيح وذريعة إلى الربا لأنه إذا جاز له أن يأخذ المثقال بقيمته حتى كأنه اشتراه على حدته جاز له أن يأخذ المثقال بقيمته مرارا لأن يجيز ذلك البيع بينه وبين صاحبه ‏.‏ قال مالك ولو أنه باعه ذلك المثقال مفردا ليس معه غيره لم يأخذه بعشر الثمن الذي أخذه به لأن يجوز له البيع فذلك الذريعة إلى إحلال الحرام والأمر المنهي عنه ‏.‏ قال مالك في الرجل يراطل الرجل ويعطيه الذهب العتق الجياد ويجعل معها تبرا ذهبا غير جيدة ويأخذ من صاحبه ذهبا كوفية مقطعة وتلك الكوفية مكروهة عند الناس فيتبايعان ذلك مثلا بمثل إن ذلك لا يصلح ‏.‏ قال مالك وتفسير ما كره من ذلك أن صاحب الذهب الجياد أخذ فضل عيون ذهبه في التبر الذي طرح مع ذهبه ولولا فضل ذهبه على ذهب صاحبه لم يراطله صاحبه بتبره ذلك إلى ذهبه الكوفية فامتنع وإنما مثل ذلك كمثل رجل أراد أن يبتاع ثلاثة أصوع من تمر عجوة بصاعين ومد من تمر كبيس فقيل له هذا لا يصلح ‏.‏ فجعل صاعين من كبيس وصاعا من حشف يريد أن يجيز بذلك بيعه فذلك لا يصلح لأنه لم يكن صاحب العجوة ليعطيه صاعا من العجوة بصاع من حشف ولكنه إنما أعطاه ذلك لفضل الكبيس أو أن يقول الرجل للرجل بعني ثلاثة أصوع من البيضاء بصاعين ونصف من حنطة شامية فيقول هذا لا يصلح إلا مثلا بمثل ‏.‏ فيجعل صاعين من حنطة شامية وصاعا من شعير يريد أن يجيز بذلك البيع فيما بينهما فهذا لا يصلح لأنه لم يكن ليعطيه بصاع من شعير صاعا من حنطة بيضاء لو كان ذلك الصاع مفردا وإنما أعطاه إياه لفضل الشامية على البيضاء فهذا لا يصلح وهو مثل ما وصفنا من التبر ‏.‏ قال مالك فكل شىء من الذهب والورق والطعام كله الذي لا ينبغي أن يباع إلا مثلا بمثل فلا ينبغي أن يجعل مع الصنف الجيد من المرغوب فيه الشىء الرديء المسخوط ليجاز البيع وليستحل بذلك ما نهي عنه من الأمر الذي لا يصلح إذا جعل ذلك مع الصنف المرغوب فيه وإنما يريد صاحب ذلك أن يدرك بذلك فضل جودة ما يبيع فيعطي الشىء الذي لو أعطاه وحده لم يقبله صاحبه ولم يهمم بذلك وإنما يقبله من أجل الذي يأخذ معه لفضل سلعة صاحبه على سلعته فلا ينبغي لشىء من الذهب والورق والطعام أن يدخله شىء من هذه الصفة فإن أراد صاحب الطعام الرديء أن يبيعه بغيره فليبعه على حدته ولا يجعل مع ذلك شيئا فلا بأس به إذا كان كذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1328
			}
		},
		{
			"hadithnumber": 1329,
			"arabicnumber": 1329,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من ابتاع طعاما فلا يبعه حتى يستوفيه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1329
			}
		},
		{
			"hadithnumber": 1330,
			"arabicnumber": 1330,
			"text": "وحدثني عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من ابتاع طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1330
			}
		},
		{
			"hadithnumber": 1331,
			"arabicnumber": 1331,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أنه قال كنا في زمان رسول الله صلى الله عليه وسلم نبتاع الطعام فيبعث علينا من يأمرنا بانتقاله من المكان الذي ابتعناه فيه إلى مكان سواه قبل أن نبيعه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1331
			}
		},
		{
			"hadithnumber": 1332,
			"arabicnumber": 1332,
			"text": "وحدثني عن مالك، عن نافع، ‏.‏ أن حكيم بن حزام، ابتاع طعاما أمر به عمر بن الخطاب للناس فباع حكيم الطعام قبل أن يستوفيه فبلغ ذلك عمر بن الخطاب فرده عليه وقال لا تبع طعاما ابتعته حتى تستوفيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1332
			}
		},
		{
			"hadithnumber": 1333,
			"arabicnumber": 1333,
			"text": "وحدثني عن مالك، أنه بلغه ‏.‏ أن صكوكا، خرجت للناس في زمان مروان بن الحكم من طعام الجار فتبايع الناس تلك الصكوك بينهم قبل أن يستوفوها فدخل زيد بن ثابت ورجل من أصحاب رسول الله صلى الله عليه وسلم على مروان بن الحكم فقالا أتحل بيع الربا يا مروان ‏.‏ فقال أعوذ بالله وما ذاك فقالا هذه الصكوك تبايعها الناس ثم باعوها قبل أن يستوفوها فبعث مروان الحرس يتبعونها ينزعونها من أيدي الناس ويردونها إلى أهلها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1333
			}
		},
		{
			"hadithnumber": 1334,
			"arabicnumber": 1334,
			"text": "وحدثني عن مالك، أنه بلغه أن رجلا، أراد أن يبتاع طعاما من رجل إلى أجل فذهب به الرجل الذي يريد أن يبيعه الطعام إلى السوق فجعل يريه الصبر ويقول له من أيها تحب أن أبتاع لك فقال المبتاع أتبيعني ما ليس عندك فأتيا عبد الله بن عمر فذكرا ذلك له فقال عبد الله بن عمر للمبتاع لا تبتع منه ما ليس عنده ‏.‏ وقال للبائع لا تبع ما ليس عندك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1334
			}
		},
		{
			"hadithnumber": 1335,
			"arabicnumber": 1335,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه سمع جميل بن عبد الرحمن المؤذن، يقول لسعيد بن المسيب إني رجل أبتاع من الأرزاق التي تعطى الناس بالجار ما شاء الله ثم أريد أن أبيع الطعام المضمون على إلى أجل ‏.‏ فقال له سعيد أتريد أن توفيهم من تلك الأرزاق التي ابتعت فقال نعم ‏.‏ فنهاه عن ذلك ‏.‏ قال مالك الأمر المجتمع عليه عندنا الذي لا اختلاف فيه أنه من اشترى طعاما برا أو شعيرا أو سلتا أو ذرة أو دخنا أو شيئا من الحبوب القطنية أو شيئا مما يشبه القطنية مما تجب فيه الزكاة أو شيئا من الأدم كلها الزيت والسمن والعسل والخل والجبن والشبرق واللبن وما أشبه ذلك من الأدم فإن المبتاع لا يبيع شيئا من ذلك حتى يقبضه ويستوفيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1335
			}
		},
		{
			"hadithnumber": 1336,
			"arabicnumber": 1336,
			"text": "حدثني يحيى، عن مالك، عن أبي الزناد، أنه سمع سعيد بن المسيب، وسليمان بن يسار، ينهيان أن يبيع الرجل، حنطة بذهب إلى أجل ثم يشتري بالذهب تمرا قبل أن يقبض الذهب",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1336
			}
		},
		{
			"hadithnumber": 1337,
			"arabicnumber": 1337,
			"text": "وحدثني عن مالك، عن كثير بن فرقد، ‏.‏ أنه سأل أبا بكر بن محمد بن عمرو بن حزم عن الرجل، يبيع الطعام من الرجل بذهب إلى أجل ثم يشتري بالذهب تمرا قبل أن يقبض الذهب فكره ذلك ونهى عنه ‏.‏ وحدثني عن مالك، عن ابن شهاب، بمثل ذلك ‏.‏ قال مالك وإنما نهى سعيد بن المسيب وسليمان بن يسار وأبو بكر بن محمد بن عمرو بن حزم وابن شهاب عن أن لا يبيع الرجل حنطة بذهب ثم يشتري الرجل بالذهب تمرا قبل أن يقبض الذهب من بيعه الذي اشترى منه الحنطة فأما أن يشتري بالذهب التي باع بها الحنطة إلى أجل تمرا من غير بائعه الذي باع منه الحنطة قبل أن يقبض الذهب ويحيل الذي اشترى منه التمر على غريمه الذي باع منه الحنطة بالذهب التي له عليه في ثمن التمر فلا بأس بذلك ‏.‏ قال مالك وقد سألت عن ذلك غير واحد من أهل العلم فلم يروا به بأسا ‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1337
			}
		},
		{
			"hadithnumber": 1339,
			"arabicnumber": 1339,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أنه قال لا بأس بأن يسلف الرجل الرجل في الطعام الموصوف بسعر معلوم إلى أجل مسمى ما لم يكن في زرع لم يبد صلاحه أو تمر لم يبد صلاحه ‏.‏ قال مالك الأمر عندنا فيمن سلف في طعام بسعر معلوم إلى أجل مسمى فحل الأجل فلم يجد المبتاع عند البائع وفاء مما ابتاع منه فأقاله فإنه لا ينبغي له أن يأخذ منه إلا ورقه أو ذهبه أو الثمن الذي دفع إليه بعينه وإنه لا يشتري منه بذلك الثمن شيئا حتى يقبضه منه وذلك أنه إذا أخذ غير الثمن الذي دفع إليه أو صرفه في سلعة غير الطعام الذي ابتاع منه فهو بيع الطعام قبل أن يستوفى ‏.‏ قال مالك وقد نهى رسول الله صلى الله عليه وسلم عن بيع الطعام قبل أن يستوفى ‏.‏ قال مالك فإن ندم المشتري فقال للبائع أقلني وأنظرك بالثمن الذي دفعت إليك ‏.‏ فإن ذلك لا يصلح وأهل العلم ينهون عنه وذلك أنه لما حل الطعام للمشتري على البائع أخر عنه حقه على أن يقيله فكان ذلك بيع الطعام إلى أجل قبل أن يستوفى ‏.‏ قال مالك وتفسير ذلك أن المشتري حين حل الأجل وكره الطعام أخذ به دينارا إلى أجل وليس ذلك بالإقالة وإنما الإقالة ما لم يزدد فيه البائع ولا المشتري فإذا وقعت فيه الزيادة بنسيئة إلى أجل أو بشىء يزداده أحدهما على صاحبه أو بشىء ينتفع به أحدهما فإن ذلك ليس بالإقالة وإنما تصير الإقالة إذا فعلا ذلك بيعا وإنما أرخص في الإقالة والشرك والتولية ما لم يدخل شيئا من ذلك زيادة أو نقصان أو نظرة فإن دخل ذلك زيادة أو نقصان أو نظرة صار بيعا يحله ما يحل البيع ويحرمه ما يحرم البيع ‏.‏ قال مالك من سلف في حنطة شامية فلا بأس أن يأخذ محمولة بعد محل الأجل ‏.‏ قال مالك وكذلك من سلف في صنف من الأصناف فلا بأس أن يأخذ خيرا مما سلف فيه أو أدنى بعد محل الأجل وتفسير ذلك أن يسلف الرجل في حنطة محمولة فلا بأس أن يأخذ شعيرا أو شامية وإن سلف في تمر عجوة فلا بأس أن يأخذ صيحانيا أو جمعا وإن سلف في زبيب أحمر فلا بأس أن يأخذ أسود إذا كان ذلك كله بعد محل الأجل إذا كانت مكيلة ذلك سواء بمثل كيل ما سلف فيه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1339
			}
		},
		{
			"hadithnumber": 1340,
			"arabicnumber": 1340,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن سليمان بن يسار، قال فني علف حمار سعد بن أبي وقاص فقال لغلامه خذ من حنطة أهلك فابتع بها شعيرا ولا تأخذ إلا مثله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1340
			}
		},
		{
			"hadithnumber": 1341,
			"arabicnumber": 1341,
			"text": "وحدثني عن مالك، عن نافع، عن سليمان بن يسار، أنه أخبره أن عبد الرحمن بن الأسود بن عبد يغوث فني علف دابته فقال لغلامه خذ من حنطة أهلك طعاما فابتع بها شعيرا ولا تأخذ إلا مثله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1341
			}
		},
		{
			"hadithnumber": 1342,
			"arabicnumber": 1342,
			"text": "وحدثني عن مالك، أنه بلغه عن القاسم بن محمد، عن ابن معيقيب الدوسي، مثل ذلك ‏.‏ قال مالك وهو الأمر عندنا ‏.‏ قال مالك الأمر المجتمع عليه عندنا أن لا تباع الحنطة بالحنطة ولا التمر بالتمر ولا الحنطة بالتمر ولا التمر بالزبيب ولا الحنطة بالزبيب ولا شىء من الطعام كله إلا يدا بيد فإن دخل شيئا من ذلك الأجل لم يصلح وكان حراما ولا شىء من الأدم كلها إلا يدا بيد ‏.‏ قال مالك ولا يباع شىء من الطعام والأدم إذا كان من صنف واحد اثنان بواحد فلا يباع مد حنطة بمدى حنطة ولا مد تمر بمدى تمر ولا مد زبيب بمدى زبيب ولا ما أشبه ذلك من الحبوب والأدم كلها إذا كان من صنف واحد وإن كان يدا بيد إنما ذلك بمنزلة الورق بالورق والذهب بالذهب لا يحل في شىء من ذلك الفضل ولا يحل إلا مثلا بمثل يدا بيد ‏.‏ قال مالك وإذا اختلف ما يكال أو يوزن مما يؤكل أو يشرب فبان اختلافه فلا بأس أن يؤخذ منه اثنان بواحد يدا بيد ولا بأس أن يؤخذ صاع من تمر بصاعين من حنطة وصاع من تمر بصاعين من زبيب وصاع من حنطة بصاعين من سمن فإذا كان الصنفان من هذا مختلفين فلا بأس باثنين منه بواحد أو أكثر من ذلك يدا بيد فإن دخل ذلك الأجل فلا يحل ‏.‏ قال مالك ولا تحل صبرة الحنطة بصبرة الحنطة ولا بأس بصبرة الحنطة بصبرة التمر يدا بيد وذلك أنه لا بأس أن يشترى الحنطة بالتمر جزافا ‏.‏ قال مالك وكل ما اختلف من الطعام والأدم فبان اختلافه فلا بأس أن يشترى بعضه ببعض جزافا يدا بيد فإن دخله الأجل فلا خير فيه وإنما اشتراء ذلك جزافا كاشتراء بعض ذلك بالذهب والورق جزافا ‏.‏ قال مالك وذلك أنك تشتري الحنطة بالورق جزافا والتمر بالذهب جزافا فهذا حلال لا بأس به ‏.‏ قال مالك ومن صبر صبرة طعام وقد علم كيلها ثم باعها جزافا وكتم المشتري كيلها فإن ذلك لا يصلح فإن أحب المشتري أن يرد ذلك الطعام على البائع رده بما كتمه كيله وغره وكذلك كل ما علم البائع كيله وعدده من الطعام وغيره ثم باعه جزافا ولم يعلم المشتري ذلك فإن المشتري إن أحب أن يرد ذلك على البائع رده ولم يزل أهل العلم ينهون عن ذلك ‏.‏ قال مالك ولا خير في الخبز قرص بقرصين ولا عظيم بصغير إذا كان بعض ذلك أكبر من بعض فأما إذا كان يتحرى أن يكون مثلا بمثل فلا بأس به وإن لم يوزن ‏.‏ قال مالك لا يصلح مد زبد ومد لبن بمدى زبد وهو مثل الذي وصفنا من التمر الذي يباع صاعين من كبيس وصاعا من حشف بثلاثة أصوع من عجوة حين قال لصاحبه إن صاعين من كبيس بثلاثة أصوع من العجوة لا يصلح ‏.‏ ففعل ذلك ليجيز بيعه وإنما جعل صاحب اللبن اللبن مع زبده ليأخذ فضل زبده على زبد صاحبه حين أدخل معه اللبن ‏.‏ قال مالك والدقيق بالحنطة مثلا بمثل لا بأس به وذلك لأنه أخلص الدقيق فباعه بالحنطة مثلا بمثل ولو جعل نصف المد من دقيق ونصفه من حنطة فباع ذلك بمد من حنطة كان ذلك مثل الذي وصفنا لا يصلح لأنه إنما أراد أن يأخذ فضل حنطته الجيدة حتى جعل معها الدقيق فهذا لا يصلح ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1342
			}
		},
		{
			"hadithnumber": 1343,
			"arabicnumber": 1343,
			"text": "حدثني يحيى، عن مالك، عن محمد بن عبد الله بن أبي مريم، أنه سأل سعيد بن المسيب فقال إني رجل أبتاع الطعام يكون من الصكوك بالجار فربما ابتعت منه بدينار ونصف درهم فأعطى بالنصف طعاما ‏.‏ فقال سعيد لا ولكن أعط أنت درهما وخذ بقيته طعاما ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1343
			}
		},
		{
			"hadithnumber": 1344,
			"arabicnumber": 1344,
			"text": "وحدثني عن مالك، أنه بلغه أن محمد بن سيرين، كان يقول لا تبيعوا الحب في سنبله حتى يبيض ‏.‏ قال مالك من اشترى طعاما بسعر معلوم إلى أجل مسمى فلما حل الأجل قال الذي عليه الطعام لصاحبه ليس عندي طعام فبعني الطعام الذي لك على إلى أجل ‏.‏ فيقول صاحب الطعام هذا لا يصلح لأنه قد نهى رسول الله صلى الله عليه وسلم عن بيع الطعام حتى يستوفى ‏.‏ فيقول الذي عليه الطعام لغريمه فبعني طعاما إلى أجل حتى أقضيكه ‏.‏ فهذا لا يصلح لأنه إنما يعطيه طعاما ثم يرده إليه ‏.‏ فيصير الذهب الذي أعطاه ثمن الذي كان له عليه ويصير الطعام الذي أعطاه محللا فيما بينهما ويكون ذلك إذا فعلاه بيع الطعام قبل أن يستوفى ‏.‏ قال مالك في رجل له على رجل طعام ابتاعه منه ولغريمه على رجل طعام مثل ذلك الطعام فقال الذي عليه الطعام لغريمه أحيلك على غريم لي عليه مثل الطعام الذي لك على بطعامك الذي لك على ‏.‏ قال مالك إن كان الذي عليه الطعام إنما هو طعام ابتاعه فأراد أن يحيل غريمه بطعام ابتاعه فإن ذلك لا يصلح وذلك بيع الطعام قبل أن يستوفى فإن كان الطعام سلفا حالا فلا بأس أن يحيل به غريمه لأن ذلك ليس ببيع ولا يحل بيع الطعام قبل أن يستوفى لنهى رسول الله صلى الله عليه وسلم عن ذلك غير أن أهل العلم قد اجتمعوا على أنه لا بأس بالشرك والتولية والإقالة في الطعام وغيره ‏.‏ قال مالك وذلك أن أهل العلم أنزلوه على وجه المعروف ولم ينزلوه على وجه البيع وذلك مثل الرجل يسلف الدراهم النقص فيقضى دراهم وازنة فيها فضل فيحل له ذلك ويجوز ولو اشترى منه دراهم نقصا بوازنة لم يحل ذلك ولو اشترط عليه حين أسلفه وازنة وإنما أعطاه نقصا لم يحل له ذلك ‏.‏ قال مالك ومما يشبه ذلك أن رسول الله صلى الله عليه وسلم نهى عن بيع المزابنة وأرخص في بيع العرايا بخرصها من التمر وإنما فرق بين ذلك أن بيع المزابنة بيع على وجه المكايسة والتجارة وأن بيع العرايا على وجه المعروف لا مكايسة فيه ‏.‏ قال مالك ولا ينبغي أن يشتري رجل طعاما بربع أو ثلث أو كسر من درهم على أن يعطى بذلك طعاما إلى أجل ولا بأس أن يبتاع الرجل طعاما بكسر من درهم إلى أجل ثم يعطى درهما ويأخذ بما بقي له من درهمه سلعة من السلع لأنه أعطى الكسر الذي عليه فضة وأخذ ببقية درهمه سلعة فهذا لا بأس به ‏.‏ قال مالك ولا بأس أن يضع الرجل عند الرجل درهما ثم يأخذ منه بربع أو بثلث أو بكسر معلوم سلعة معلومة فإذا لم يكن في ذلك سعر معلوم وقال الرجل آخذ منك بسعر كل يوم فهذا لا يحل لأنه غرر يقل مرة ويكثر مرة ولم يفترقا على بيع معلوم ‏.‏ قال مالك ومن باع طعاما جزافا ولم يستثن منه شيئا ثم بدا له أن يشتري منه شيئا فإنه لا يصلح له أن يشتري منه شيئا إلا ما كان يجوز له أن يستثني منه وذلك الثلث فما دونه فإن زاد على الثلث صار ذلك إلى المزابنة وإلى ما يكره فلا ينبغي له أن يشتري منه شيئا إلا ما كان يجوز له أن يستثني منه ولا يجوز له أن يستثني منه إلا الثلث فما دونه وهذا الأمر الذي لا اختلاف فيه عندنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1344
			}
		},
		{
			"hadithnumber": 1345,
			"arabicnumber": 1345,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عمر بن الخطاب، قال لا حكرة في سوقنا لا يعمد رجال بأيديهم فضول من أذهاب إلى رزق من رزق الله نزل بساحتنا فيحتكرونه علينا ولكن أيما جالب جلب على عمود كبده في الشتاء والصيف فذلك ضيف عمر فليبع كيف شاء الله وليمسك كيف شاء الله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1345
			}
		},
		{
			"hadithnumber": 1346,
			"arabicnumber": 1346,
			"text": "وحدثني عن مالك، عن يونس بن يوسف، عن سعيد بن المسيب، أن عمر بن الخطاب، مر بحاطب بن أبي بلتعة وهو يبيع زبيبا له بالسوق فقال له عمر بن الخطاب إما أن تزيد في السعر وإما أن ترفع من سوقنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1346
			}
		},
		{
			"hadithnumber": 1347,
			"arabicnumber": 1347,
			"text": "وحدثني عن مالك، أنه بلغه أن عثمان بن عفان، كان ينهى عن الحكرة، ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1347
			}
		},
		{
			"hadithnumber": 1348,
			"arabicnumber": 1348,
			"text": "حدثني يحيى، عن مالك، عن صالح بن كيسان، عن حسن بن محمد بن علي بن أبي طالب، أن علي بن أبي طالب، باع جملا له يدعى عصيفيرا بعشرين بعيرا إلى أجل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1348
			}
		},
		{
			"hadithnumber": 1349,
			"arabicnumber": 1349,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، اشترى راحلة بأربعة أبعرة مضمونة عليه يوفيها صاحبها بالربذة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1349
			}
		},
		{
			"hadithnumber": 1350,
			"arabicnumber": 1350,
			"text": "وحدثني عن مالك، أنه سأل ابن شهاب عن بيع الحيوان، اثنين بواحد إلى أجل فقال لا بأس بذلك ‏.‏ قال مالك الأمر المجتمع عليه عندنا أنه لا بأس بالجمل بالجمل مثله وزيادة دراهم يدا بيد ولا بأس بالجمل بالجمل مثله وزيادة دراهم الجمل بالجمل يدا بيد والدراهم إلى أجل ‏.‏ قال ولا خير في الجمل بالجمل مثله وزيادة دراهم الدراهم نقدا والجمل إلى أجل وإن أخرت الجمل والدراهم لا خير في ذلك أيضا ‏.‏ قال مالك ولا بأس أن يبتاع البعير النجيب بالبعيرين أو بالأبعرة من الحمولة من ماشية الإبل وإن كانت من نعم واحدة فلا بأس أن يشترى منها اثنان بواحد إلى أجل إذا اختلفت فبان اختلافها وإن أشبه بعضها بعضا واختلفت أجناسها أو لم تختلف فلا يؤخذ منها اثنان بواحد إلى أجل ‏.‏ قال مالك وتفسير ما كره من ذلك أن يؤخذ البعير بالبعيرين ليس بينهما تفاضل في نجابة ولا رحلة فإذا كان هذا على ما وصفت لك فلا يشترى منه اثنان بواحد إلى أجل ولا بأس أن تبيع ما اشتريت منها قبل أن تستوفيه من غير الذي اشتريته منه إذا انتقدت ثمنه ‏.‏ قال مالك ومن سلف في شىء من الحيوان إلى أجل مسمى فوصفه وحلاه ونقد ثمنه فذلك جائز وهو لازم للبائع والمبتاع على ما وصفا وحليا ولم يزل ذلك من عمل الناس الجائز بينهم والذي لم يزل عليه أهل العلم ببلدنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1350
			}
		},
		{
			"hadithnumber": 1351,
			"arabicnumber": 1351,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن بيع حبل الحبلة ‏.‏ وكان بيعا يتبايعه أهل الجاهلية كان الرجل يبتاع الجزور إلى أن تنتج الناقة ‏.‏ ثم تنتج التي في بطنها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1351
			}
		},
		{
			"hadithnumber": 1352,
			"arabicnumber": 1352,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن سعيد بن المسيب، أنه قال لا ربا في الحيوان وإنما نهي من الحيوان عن ثلاثة عن المضامين والملاقيح وحبل الحبلة ‏.‏ والمضامين بيع ما في بطون إناث الإبل والملاقيح بيع ما في ظهور الجمال ‏.‏ قال مالك لا ينبغي أن يشتري أحد شيئا من الحيوان بعينه إذا كان غائبا عنه وإن كان قد رآه ورضيه على أن ينقد ثمنه لا قريبا ولا بعيدا ‏.‏ قال مالك وإنما كره ذلك لأن البائع ينتفع بالثمن ولا يدرى هل توجد تلك السلعة على ما رآها المبتاع أم لا فلذلك كره ذلك ولا بأس به إذا كان مضمونا موصوفا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1352
			}
		},
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، عن سعيد بن المسيب، أن رسول الله",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1353
			}
		},
		{
			"hadithnumber": 1354,
			"arabicnumber": 1354,
			"text": "وحدثني عن مالك، عن داود بن الحصين، أنه سمع سعيد بن المسيب، يقول من ميسر أهل الجاهلية بيع الحيوان باللحم بالشاة والشاتين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1354
			}
		},
		{
			"hadithnumber": 1355,
			"arabicnumber": 1355,
			"text": "وحدثني عن مالك، عن أبي الزناد، عن سعيد بن المسيب، أنه كان يقول نهي عن بيع الحيوان، باللحم ‏.‏ قال أبو الزناد فقلت لسعيد بن المسيب أرأيت رجلا اشترى شارفا بعشرة شياه فقال سعيد إن كان اشتراها لينحرها فلا خير في ذلك ‏.‏ قال أبو الزناد وكل من أدركت من الناس ينهون عن بيع الحيوان باللحم ‏.‏ قال أبو الزناد وكان ذلك يكتب في عهود العمال في زمان أبان بن عثمان وهشام بن إسماعيل ينهون عن ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1355
			}
		},
		{
			"hadithnumber": 1356,
			"arabicnumber": 1356,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي مسعود الأنصاري، أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏ يعني بمهر البغي ما تعطاه المرأة على الزنا وحلوان الكاهن رشوته وما يعطى على أن يتكهن ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1356
			}
		},
		{
			"hadithnumber": 1357,
			"arabicnumber": 1357,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن رسول الله صلى الله عليه وسلم نهى عن بيع وسلف ‏.‏ قال مالك وتفسير ذلك أن يقول الرجل للرجل آخذ سلعتك بكذا وكذا على أن تسلفني كذا وكذا ‏.‏ فإن عقدا بيعهما على هذا فهو غير جائز فإن ترك الذي اشترط السلف ما اشترط منه كان ذلك البيع جائزا ‏.‏ قال مالك ولا بأس أن يشترى الثوب من الكتان أو الشطوي أو القصبي بالأثواب من الإتريبي أو القسي أو الزيقة أو الثوب الهروي أو المروي بالملاحف اليمانية والشقائق وما أشبه ذلك الواحد بالاثنين أو الثلاثة يدا بيد أو إلى أجل وإن كان من صنف واحد فإن دخل ذلك نسيئة فلا خير فيه ‏.‏ قال مالك ولا يصلح حتى يختلف فيبين اختلافه فإذا أشبه بعض ذلك بعضا وإن اختلفت أسماؤه فلا يأخذ منه اثنين بواحد إلى أجل وذلك أن يأخذ الثوبين من الهروي بالثوب من المروي أو القوهي إلى أجل أو يأخذ الثوبين من الفرقبي بالثوب من الشطوي فإذا كانت هذه الأجناس على هذه الصفة فلا يشترى منها اثنان بواحد إلى أجل ‏.‏ قال مالك ولا بأس أن تبيع ما اشتريت منها قبل أن تستوفيه من غير صاحبه الذي اشتريته منه إذا انتقدت ثمنه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1357
			}
		},
		{
			"hadithnumber": 1358,
			"arabicnumber": 1358,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، عن القاسم بن محمد، أنه قال سمعت عبد الله بن عباس، ورجل، يسأله عن رجل، سلف في سبائب فأراد بيعها قبل أن يقبضها فقال ابن عباس تلك الورق بالورق ‏.‏ وكره ذلك ‏.‏ قال مالك وذلك فيما نرى والله أعلم أنه أراد أن يبيعها من صاحبها الذي اشتراها منه بأكثر من الثمن الذي ابتاعها به ولو أنه باعها من غير الذي اشتراها منه لم يكن بذلك بأس ‏.‏ قال مالك الأمر المجتمع عليه عندنا فيمن سلف في رقيق أو ماشية أو عروض فإذا كان كل شىء من ذلك موصوفا فسلف فيه إلى أجل فحل الأجل فإن المشتري لا يبيع شيئا من ذلك من الذي اشتراه منه بأكثر من الثمن الذي سلفه فيه قبل أن يقبض ما سلفه فيه وذلك أنه إذا فعله فهو الربا صار المشتري إن أعطى الذي باعه دنانير أو دراهم فانتفع بها فلما حلت عليه السلعة ولم يقبضها المشتري باعها من صاحبها بأكثر مما سلفه فيها فصار أن رد إليه ما سلفه وزاده من عنده ‏.‏ قال مالك من سلف ذهبا أو ورقا في حيوان أو عروض إذا كان موصوفا إلى أجل مسمى ثم حل الأجل فإنه لا بأس أن يبيع المشتري تلك السلعة من البائع قبل أن يحل الأجل أو بعد ما يحل بعرض من العروض يعجله ولا يؤخره بالغا ما بلغ ذلك العرض إلا الطعام فإنه لا يحل أن يبيعه حتى يقبضه وللمشتري أن يبيع تلك السلعة من غير صاحبه الذي ابتاعها منه بذهب أو ورق أو عرض من العروض يقبض ذلك ولا يؤخره لأنه إذا أخر ذلك قبح ودخله ما يكره من الكالئ بالكالئ والكالئ بالكالئ أن يبيع الرجل دينا له على رجل بدين على رجل آخر ‏.‏ قال مالك ومن سلف في سلعة إلى أجل وتلك السلعة مما لا يؤكل ولا يشرب فإن المشتري يبيعها ممن شاء بنقد أو عرض قبل أن يستوفيها من غير صاحبها الذي اشتراها منه ولا ينبغي له أن يبيعها من الذي ابتاعها منه إلا بعرض يقبضه ولا يؤخره ‏.‏ قال مالك وإن كانت السلعة لم تحل فلا بأس بأن يبيعها من صاحبها بعرض مخالف لها بين خلافه يقبضه ولا يؤخره ‏.‏ قال مالك فيمن سلف دنانير أو دراهم في أربعة أثواب موصوفة إلى أجل فلما حل الأجل تقاضى صاحبها فلم يجدها عنده ووجد عنده ثيابا دونها من صنفها فقال له الذي عليه الأثواب أعطيك بها ثمانية أثواب من ثيابي هذه ‏.‏ إنه لا بأس بذلك إذا أخذ تلك الأثواب التي يعطيه قبل أن يفترقا فإن دخل ذلك الأجل فإنه لا يصلح وإن كان ذلك قبل محل الأجل فإنه لا يصلح أيضا إلا أن يبيعه ثيابا ليست من صنف الثياب التي سلفه فيها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1358
			}
		},
		{
			"hadithnumber": 1359,
			"arabicnumber": 1359,
			"text": "حدثني يحيى، عن مالك، أنه بلغه ‏.‏ أن رسول الله صلى الله عليه وسلم نهى عن بيعتين في بيعة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1359
			}
		},
		{
			"hadithnumber": 1360,
			"arabicnumber": 1360,
			"text": "وحدثني عن مالك، أنه بلغه أن رجلا، قال لرجل ابتع لي هذا البعير بنقد حتى أبتاعه منك إلى أجل فسئل عن ذلك عبد الله بن عمر فكرهه ونهى عنه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1360
			}
		},
		{
			"hadithnumber": 1361,
			"arabicnumber": 1361,
			"text": "وحدثني مالك، أنه بلغه أن القاسم بن محمد، سئل عن رجل، اشترى سلعة بعشرة دنانير نقدا أو بخمسة عشر دينارا إلى أجل فكره ذلك ونهى عنه ‏.‏ قال مالك في رجل ابتاع سلعة من رجل بعشرة دنانير نقدا أو بخمسة عشر دينارا إلى أجل قد وجبت للمشتري بأحد الثمنين إنه لا ينبغي ذلك لأنه إن أخر العشرة كانت خمسة عشر إلى أجل وإن نقد العشرة كان إنما اشترى بها الخمسة عشر التي إلى أجل ‏.‏ قال مالك في رجل اشترى من رجل سلعة بدينار نقدا أو بشاة موصوفة إلى أجل قد وجب عليه بأحد الثمنين إن ذلك مكروه لا ينبغي لأن رسول الله صلى الله عليه وسلم قد نهى عن بيعتين في بيعة وهذا من بيعتين في بيعة ‏.‏ قال مالك في رجل قال لرجل أشتري منك هذه العجوة خمسة عشر صاعا أو الصيحاني عشرة أصوع أو الحنطة المحمولة خمسة عشر صاعا أو الشامية عشرة أصوع بدينار قد وجبت لي إحداهما إن ذلك مكروه لا يحل وذلك أنه قد أوجب له عشرة أصوع صيحانيا فهو يدعها ويأخذ خمسة عشر صاعا من العجوة أو تجب عليه خمسة عشر صاعا من الحنطة المحمولة فيدعها ويأخذ عشرة أصوع من الشامية فهذا أيضا مكروه لا يحل وهو أيضا يشبه ما نهي عنه من بيعتين في بيعة وهو أيضا مما نهي عنه أن يباع من صنف واحد من الطعام اثنان بواحد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1361
			}
		},
		{
			"hadithnumber": 1362,
			"arabicnumber": 1362,
			"text": "حدثني يحيى، عن مالك، عن أبي حازم بن دينار، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم نهى عن بيع الغرر ‏.‏ قال مالك ومن الغرر والمخاطرة أن يعمد الرجل قد ضلت دابته أو أبق غلامه وثمن الشىء من ذلك خمسون دينارا فيقول رجل أنا آخذه منك بعشرين دينارا ‏.‏ فإن وجده المبتاع ذهب من البائع ثلاثون دينارا وإن لم يجده ذهب البائع من المبتاع بعشرين دينارا ‏.‏ قال مالك وفي ذلك عيب آخر إن تلك الضالة إن وجدت لم يدر أزادت أم نقصت أم ما حدث بها من العيوب فهذا أعظم المخاطرة ‏.‏ قال مالك والأمر عندنا أن من المخاطرة والغرر اشتراء ما في بطون الإناث من النساء والدواب لأنه لا يدرى أيخرج أم لا يخرج فإن خرج لم يدر أيكون حسنا أم قبيحا أم تاما أم ناقصا أم ذكرا أم أنثى وذلك كله يتفاضل إن كان على كذا فقيمته كذا وإن كان على كذا فقيمته كذا ‏.‏ قال مالك ولا ينبغي بيع الإناث واستثناء ما في بطونها وذلك أن يقول الرجل للرجل ثمن شاتي الغزيرة ثلاثة دنانير فهي لك بدينارين ولي ما في بطنها ‏.‏ فهذا مكروه لأنه غرر ومخاطرة ‏.‏ قال مالك ولا يحل بيع الزيتون بالزيت ولا الجلجلان بدهن الجلجلان ولا الزبد بالسمن لأن المزابنة تدخله ولأن الذي يشتري الحب وما أشبهه بشىء مسمى مما يخرج منه لا يدري أيخرج منه أقل من ذلك أو أكثر فهذا غرر ومخاطرة ‏.‏ قال مالك ومن ذلك أيضا اشتراء حب البان بالسليخة فذلك غرر لأن الذي يخرج من حب البان هو السليخة ولا بأس بحب البان بالبان المطيب لأن البان المطيب قد طيب ونش وتحول عن حال السليخة ‏.‏ قال مالك في رجل باع سلعة من رجل على أنه لا نقصان على المبتاع إن ذلك بيع غير جائز وهو من المخاطرة وتفسير ذلك أنه كأنه استأجره بربح إن كان في تلك السلعة وإن باع برأس المال أو بنقصان فلا شىء له وذهب عناؤه باطلا فهذا لا يصلح وللمبتاع في هذا أجرة بمقدار ما عالج من ذلك وما كان في تلك السلعة من نقصان أو ربح فهو للبائع وعليه وإنما يكون ذلك إذا فاتت السلعة وبيعت ‏.‏ فإن لم تفت فسخ البيع بينهما ‏.‏ قال مالك فأما أن يبيع رجل من رجل سلعة يبت بيعها ثم يندم المشتري فيقول للبائع ضع عني فيأبى البائع ويقول بع فلا نقصان عليك ‏.‏ فهذا لا بأس به لأنه ليس من المخاطرة وإنما هو شىء وضعه له وليس على ذلك عقدا بيعهما وذلك الذي عليه الأمر عندنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1362
			}
		},
		{
			"hadithnumber": 1363,
			"arabicnumber": 1363,
			"text": "حدثنا يحيى، عن مالك، عن محمد بن يحيى بن حبان، وعن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن الملامسة والمنابذة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1363
			}
		},
		{
			"hadithnumber": 1364,
			"arabicnumber": 1364,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ المتبايعان كل واحد منهما بالخيار على صاحبه ما لم يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1364
			}
		},
		{
			"hadithnumber": 1365,
			"arabicnumber": 1365,
			"text": "وحدثني مالك، أنه بلغه أن عبد الله بن مسعود، كان يحدث أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما بيعين تبايعا فالقول ما قال البائع أو يترادان ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1365
			}
		},
		{
			"hadithnumber": 1366,
			"arabicnumber": 1366,
			"text": "حدثني يحيى، عن مالك، عن أبي الزناد، عن بسر بن سعيد، عن عبيد أبي صالح، مولى السفاح أنه قال بعت بزا لي من أهل دار نخلة إلى أجل ثم أردت الخروج إلى الكوفة فعرضوا على أن أضع عنهم بعض الثمن وينقدوني فسألت عن ذلك زيد بن ثابت فقال لا آمرك أن تأكل هذا ولا توكله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1366
			}
		},
		{
			"hadithnumber": 1367,
			"arabicnumber": 1367,
			"text": "وحدثني عن مالك، عن عثمان بن حفص بن خلدة، عن ابن شهاب، عن سالم بن عبد الله، عن عبد الله بن عمر، أنه سئل عن الرجل، يكون له الدين على الرجل إلى أجل فيضع عنه صاحب الحق ويعجله الآخر فكره ذلك عبد الله بن عمر ونهى عنه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1367
			}
		},
		{
			"hadithnumber": 1368,
			"arabicnumber": 1368,
			"text": "وحدثني مالك، عن زيد بن أسلم، أنه قال كان الربا في الجاهلية أن يكون للرجل على الرجل الحق إلى أجل فإذا حل الأجل قال أتقضي أم تربي فإن قضى أخذ وإلا زاده في حقه وأخر عنه في الأجل ‏.‏ قال مالك والأمر المكروه الذي لا اختلاف فيه عندنا أن يكون للرجل على الرجل الدين إلى أجل فيضع عنه الطالب ويعجله المطلوب وذلك عندنا بمنزلة الذي يؤخر دينه بعد محله عن غريمه ويزيده الغريم في حقه قال فهذا الربا بعينه لا شك فيه ‏.‏ قال مالك في الرجل يكون له على الرجل مائة دينار إلى أجل فإذا حلت قال له الذي عليه الدين بعني سلعة يكون ثمنها مائة دينار نقدا بمائة وخمسين إلى أجل هذا بيع لا يصلح ولم يزل أهل العلم ينهون عنه ‏.‏ قال مالك وإنما كره ذلك لأنه إنما يعطيه ثمن ما باعه بعينه ويؤخر عنه المائة الأولى إلى الأجل الذي ذكر له آخر مرة ويزداد عليه خمسين دينارا في تأخيره عنه فهذا مكروه ولا يصلح وهو أيضا يشبه حديث زيد بن أسلم في بيع أهل الجاهلية إنهم كانوا إذا حلت ديونهم قالوا للذي عليه الدين إما أن تقضي وإما أن تربي ‏.‏ فإن قضى أخذوا وإلا زادوهم في حقوقهم وزادوهم في الأجل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1368
			}
		},
		{
			"hadithnumber": 1369,
			"arabicnumber": 1369,
			"text": "حدثنا يحيى، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ مطل الغني ظلم وإذا أتبع أحدكم على مليء فليتبع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1369
			}
		},
		{
			"hadithnumber": 1370,
			"arabicnumber": 1370,
			"text": "وحدثني مالك، عن موسى بن ميسرة، أنه سمع رجلا، يسأل سعيد بن المسيب فقال إني رجل أبيع بالدين ‏.‏ فقال سعيد لا تبع إلا ما آويت إلى رحلك ‏.‏ قال مالك في الذي يشتري السلعة من الرجل على أن يوفيه تلك السلعة إلى أجل مسمى إما لسوق يرجو نفاقها فيه وإما لحاجة في ذلك الزمان الذي اشترط عليه ثم يخلفه البائع عن ذلك الأجل فيريد المشتري رد تلك السلعة على البائع إن ذلك ليس للمشتري وإن البيع لازم له وإن البائع لو جاء بتلك السلعة قبل محل الأجل لم يكره المشتري على أخذها ‏.‏ قال مالك في الذي يشتري الطعام فيكتاله ثم يأتيه من يشتريه منه فيخبر الذي يأتيه أنه قد اكتاله لنفسه واستوفاه فيريد المبتاع أن يصدقه ويأخذه بكيله إن ما بيع على هذه الصفة بنقد فلا بأس به وما بيع على هذه الصفة إلى أجل فإنه مكروه حتى يكتاله المشتري الآخر لنفسه وإنما كره الذي إلى أجل لأنه ذريعة إلى الربا وتخوف أن يدار ذلك على هذا الوجه بغير كيل ولا وزن فإن كان إلى أجل فهو مكروه ولا اختلاف فيه عندنا ‏.‏ قال مالك لا ينبغي أن يشترى دين على رجل غائب ولا حاضر إلا بإقرار من الذي عليه الدين ولا على ميت وإن علم الذي ترك الميت وذلك أن اشتراء ذلك غرر لا يدرى أيتم أم لا يتم ‏.‏ قال وتفسير ما كره من ذلك أنه إذا اشترى دينا على غائب أو ميت أنه لا يدرى ما يلحق الميت من الدين الذي لم يعلم به فإن لحق الميت دين ذهب الثمن الذي أعطى المبتاع باطلا ‏.‏ قال مالك وفي ذلك أيضا عيب آخر أنه اشترى شيئا ليس بمضمون له وإن لم يتم ذهب ثمنه باطلا فهذا غرر لا يصلح ‏.‏ قال مالك وإنما فرق بين أن لا يبيع الرجل إلا ما عنده وأن يسلف الرجل في شىء ليس عنده أصله أن صاحب العينة إنما يحمل ذهبه التي يريد أن يبتاع بها فيقول هذه عشرة دنانير فما تريد أن أشتري لك بها فكأنه يبيع عشرة دنانير نقدا بخمسة عشر دينارا إلى أجل فلهذا كره هذا وإنما تلك الدخلة والدلسة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1370
			}
		},
		{
			"hadithnumber": 1371,
			"arabicnumber": 1371,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما رجل باع متاعا فأفلس الذي ابتاعه منه ولم يقبض الذي باعه من ثمنه شيئا فوجده بعينه فهو أحق به وإن مات الذي ابتاعه فصاحب المتاع فيه أسوة الغرماء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1371
			}
		},
		{
			"hadithnumber": 1372,
			"arabicnumber": 1372,
			"text": "وحدثني مالك، عن يحيى بن سعيد، عن أبي بكر بن محمد بن عمرو بن حزم، عن عمر بن عبد العزيز، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما رجل أفلس فأدرك الرجل ماله بعينه فهو أحق به من غيره ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1372
			}
		},
		{
			"hadithnumber": 1373,
			"arabicnumber": 1373,
			"text": "حدثني يحيى، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي رافع، مولى رسول الله صلى الله عليه وسلم أنه قال استسلف رسول الله صلى الله عليه وسلم بكرا فجاءته إبل من الصدقة قال أبو رافع فأمرني رسول الله صلى الله عليه وسلم أن أقضي الرجل بكره فقلت لم أجد في الإبل إلا جملا خيارا رباعيا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أعطه إياه فإن خيار الناس أحسنهم قضاء ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1373
			}
		},
		{
			"hadithnumber": 1374,
			"arabicnumber": 1374,
			"text": "وحدثني مالك، عن حميد بن قيس المكي، عن مجاهد، أنه قال استسلف عبد الله بن عمر من رجل دراهم ثم قضاه دراهم خيرا منها فقال الرجل يا أبا عبد الرحمن هذه خير من دراهمي التي أسلفتك ‏.‏ فقال عبد الله بن عمر قد علمت ولكن نفسي بذلك طيبة ‏.‏ قال مالك لا بأس بأن يقبض من أسلف شيئا من الذهب أو الورق أو الطعام أو الحيوان ممن أسلفه ذلك أفضل مما أسلفه إذا لم يكن ذلك على شرط منهما أو عادة فإن كان ذلك على شرط أو وأى أو عادة فذلك مكروه ولا خير فيه ‏.‏ قال وذلك أن رسول الله صلى الله عليه وسلم قضى جملا رباعيا خيارا مكان بكر استسلفه وأن عبد الله بن عمر استسلف دراهم فقضى خيرا منها فإن كان ذلك على طيب نفس من المستسلف ولم يكن ذلك على شرط ولا وأى ولا عادة كان ذلك حلالا لا بأس به ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1374
			}
		},
		{
			"hadithnumber": 1375,
			"arabicnumber": 1375,
			"text": "حدثني يحيى، عن مالك، أنه بلغه أن عمر بن الخطاب، قال في رجل أسلف رجلا طعاما على أن يعطيه إياه في بلد آخر فكره ذلك عمر بن الخطاب وقال فأين الحمل يعني حملانه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1375
			}
		},
		{
			"hadithnumber": 1376,
			"arabicnumber": 1376,
			"text": "وحدثني مالك، أنه بلغه أن رجلا، أتى عبد الله بن عمر فقال يا أبا عبد الرحمن إني أسلفت رجلا سلفا واشترطت عليه أفضل مما أسلفته ‏.‏ فقال عبد الله بن عمر فذلك الربا ‏.‏ قال فكيف تأمرني يا أبا عبد الرحمن فقال عبد الله السلف على ثلاثة وجوه سلف تسلفه تريد به وجه الله فلك وجه الله وسلف تسلفه تريد به وجه صاحبك فلك وجه صاحبك وسلف تسلفه لتأخذ خبيثا بطيب فذلك الربا ‏.‏ قال فكيف تأمرني يا أبا عبد الرحمن قال أرى أن تشق الصحيفة فإن أعطاك مثل الذي أسلفته قبلته وإن أعطاك دون الذي أسلفته فأخذته أجرت وإن أعطاك أفضل مما أسلفته طيبة به نفسه فذلك شكر شكره لك ولك أجر ما أنظرته ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1376
			}
		},
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "وحدثني مالك، عن نافع، أنه سمع عبد الله بن عمر، يقول من أسلف سلفا فلا يشترط إلا قضاءه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1377
			}
		},
		{
			"hadithnumber": 1378,
			"arabicnumber": 1378,
			"text": "وحدثني مالك، أنه بلغه أن عبد الله بن مسعود، كان يقول من أسلف سلفا فلا يشترط أفضل منه وإن كانت قبضة من علف فهو ربا ‏.‏ قال مالك الأمر المجتمع عليه عندنا أن من استسلف شيئا من الحيوان بصفة وتحلية معلومة فإنه لا بأس بذلك وعليه أن يرد مثله إلا ما كان من الولائد فإنه يخاف في ذلك الذريعة إلى إحلال ما لا يحل فلا يصلح وتفسير ما كره من ذلك أن يستسلف الرجل الجارية فيصيبها ما بدا له ثم يردها إلى صاحبها بعينها فذلك لا يصلح ولا يحل ولم يزل أهل العلم ينهون عنه ولا يرخصون فيه لأحد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1378
			}
		},
		{
			"hadithnumber": 1379,
			"arabicnumber": 1379,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يبع بعضكم على بيع بعض ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1379
			}
		},
		{
			"hadithnumber": 1380,
			"arabicnumber": 1380,
			"text": "وحدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا تلقوا الركبان للبيع ولا يبع بعضكم على بيع بعض ولا تناجشوا ولا يبع حاضر لباد ولا تصروا الإبل والغنم فمن ابتاعها بعد ذلك فهو بخير النظرين بعد أن يحلبها إن رضيها أمسكها وإن سخطها ردها وصاعا من تمر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1380
			}
		},
		{
			"hadithnumber": 1381,
			"arabicnumber": 1381,
			"text": "قال مالك عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن النجش ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1381
			}
		},
		{
			"hadithnumber": 1382,
			"arabicnumber": 1382,
			"text": "حدثني يحيى، عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، ذكر لرسول الله صلى الله عليه وسلم أنه يخدع في البيوع فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إذا بايعت فقل لا خلابة ‏\"‏ ‏.‏ قال فكان الرجل إذا بايع يقول لا خلابة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1382
			}
		},
		{
			"hadithnumber": 1383,
			"arabicnumber": 1383,
			"text": "وحدثني مالك، عن يحيى بن سعيد، أنه سمع سعيد بن المسيب، يقول إذا جئت أرضا يوفون المكيال والميزان فأطل المقام بها وإذا جئت أرضا ينقصون المكيال والميزان فأقلل المقام بها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1383
			}
		},
		{
			"hadithnumber": 1384,
			"arabicnumber": 1384,
			"text": "وحدثني مالك، عن يحيى بن سعيد، أنه سمع محمد بن المنكدر، يقول أحب الله عبدا سمحا إن باع سمحا إن ابتاع سمحا إن قضى سمحا إن اقتضى ‏.‏ قال مالك في الرجل يشتري الإبل أو الغنم أو البز أو الرقيق أو شيئا من العروض جزافا إنه لا يكون الجزاف في شىء مما يعد عدا ‏.‏ قال مالك في الرجل يعطي الرجل السلعة يبيعها له وقد قومها صاحبها قيمة فقال إن بعتها بهذا الثمن الذي أمرتك به فلك دينار - أو شىء يسميه له يتراضيان عليه - وإن لم تبعها فليس لك شىء إنه لا بأس بذلك إذا سمى ثمنا يبيعها به وسمى أجرا معلوما إذا باع أخذه وإن لم يبع فلا شىء له ‏.‏ قال مالك ومثل ذلك أن يقول الرجل للرجل إن قدرت على غلامي الآبق أو جئت بجملي الشارد فلك كذا ‏.‏ فهذا من باب الجعل وليس من باب الإجارة ولو كان من باب الإجارة لم يصلح ‏.‏ قال مالك فأما الرجل يعطى السلعة فيقال له بعها ولك كذا وكذا في كل دينار ‏.‏ لشىء يسميه فإن ذلك لا يصلح لأنه كلما نقص دينار من ثمن السلعة نقص من حقه الذي سمى له فهذا غرر لا يدري كم جعل له ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1384
			}
		},
		{
			"hadithnumber": 1385,
			"arabicnumber": 1385,
			"text": "وحدثني مالك، عن ابن شهاب، أنه سأله عن الرجل، يتكارى الدابة ثم يكريها بأكثر مما تكاراها به فقال لا بأس بذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 1385
			}
		}
	]
}