{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"36": "Judgements"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1399,
			"arabicnumber": 1399,
			"text": "حدثنا يحيى، عن مالك، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إنما أنا بشر وإنكم تختصمون إلى فلعل بعضكم أن يكون ألحن بحجته من بعض فأقضي له على نحو ما أسمع منه فمن قضيت له بشىء من حق أخيه فلا يأخذن منه شيئا فإنما أقطع له قطعة من النار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1399
			}
		},
		{
			"hadithnumber": 1400,
			"arabicnumber": 1400,
			"text": "وحدثني مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أن عمر بن الخطاب، اختصم إليه مسلم ويهودي فرأى عمر أن الحق لليهودي فقضى له فقال له اليهودي والله لقد قضيت بالحق ‏.‏ فضربه عمر بن الخطاب بالدرة ثم قال وما يدريك فقال له اليهودي إنا نجد أنه ليس قاض يقضي بالحق إلا كان عن يمينه ملك وعن شماله ملك يسددانه ويوفقانه للحق مادام مع الحق فإذا ترك الحق عرجا وتركاه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1400
			}
		},
		{
			"hadithnumber": 1401,
			"arabicnumber": 1401,
			"text": "حدثنا يحيى، عن مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عبد الله بن عمرو بن عثمان، عن أبي عمرة الأنصاري، عن زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ألا أخبركم بخير الشهداء الذي يأتي بشهادته قبل أن يسألها أو يخبر بشهادته قبل أن يسألها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1401
			}
		},
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "وحدثني مالك، عن ربيعة بن أبي عبد الرحمن، أنه قال قدم على عمر بن الخطاب رجل من أهل العراق فقال لقد جئتك لأمر ما له رأس ولا ذنب ‏.‏ فقال عمر ما هو قال شهادات الزور ظهرت بأرضنا ‏.‏ فقال عمر أوقد كان ذلك قال نعم ‏.‏ فقال عمر والله لا يؤسر رجل في الإسلام بغير العدول ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1402
			}
		},
		{
			"hadithnumber": 1403,
			"arabicnumber": 1403,
			"text": "وحدثني مالك، أنه بلغه أن عمر بن الخطاب، قال لا تجوز شهادة خصم ولا ظنين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1403
			}
		},
		{
			"hadithnumber": 1404,
			"arabicnumber": 1404,
			"text": "قال يحيى عن مالك، أنه بلغه عن سليمان بن يسار، وغيره، أنهم سئلوا عن رجل، جلد الحد أتجوز شهادته فقالوا نعم إذا ظهرت منه التوبة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1404
			}
		},
		{
			"hadithnumber": 1405,
			"arabicnumber": 1405,
			"text": "وحدثني مالك، أنه سمع ابن شهاب، يسأل عن ذلك، فقال مثل ما قال سليمان بن يسار ‏.‏ قال مالك وذلك الأمر عندنا وذلك لقول الله تبارك وتعالى ‏{‏والذين يرمون المحصنات ثم لم يأتوا بأربعة شهداء فاجلدوهم ثمانين جلدة ولا تقبلوا لهم شهادة أبدا وأولئك هم الفاسقون * إلا الذين تابوا من بعد ذلك وأصلحوا فإن الله غفور رحيم‏}‏‏.‏ قال مالك فالأمر الذي لا اختلاف فيه عندنا أن الذي يجلد الحد ثم تاب وأصلح تجوز شهادته وهو أحب ما سمعت إلى في ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1405
			}
		},
		{
			"hadithnumber": 1406,
			"arabicnumber": 1406,
			"text": "قال يحيى قال مالك عن جعفر بن محمد، عن أبيه، أن رسول الله صلى الله عليه وسلم قضى باليمين مع الشاهد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1406
			}
		},
		{
			"hadithnumber": 1407,
			"arabicnumber": 1407,
			"text": "وعن مالك، عن أبي الزناد، أن عمر بن عبد العزيز، كتب إلى عبد الحميد بن عبد الرحمن بن زيد بن الخطاب وهو عامل على الكوفة أن اقض باليمين مع الشاهد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1407
			}
		},
		{
			"hadithnumber": 1408,
			"arabicnumber": 1408,
			"text": "وحدثني مالك، أنه بلغه أن أبا سلمة بن عبد الرحمن، وسليمان بن يسار، سئلا هل يقضى باليمين مع الشاهد فقالا نعم ‏.‏ قال مالك مضت السنة في القضاء باليمين مع الشاهد الواحد يحلف صاحب الحق مع شاهده ويستحق حقه فإن نكل وأبى أن يحلف أحلف المطلوب فإن حلف سقط عنه ذلك الحق وإن أبى أن يحلف ثبت عليه الحق لصاحبه ‏.‏ قال مالك وإنما يكون ذلك في الأموال خاصة ولا يقع ذلك في شىء من الحدود ولا في نكاح ولا في طلاق ولا في عتاقة ولا في سرقة ولا في فرية فإن قال قائل فإن العتاقة من الأموال ‏.‏ فقد أخطأ ليس ذلك على ما قال ولو كان ذلك على ما قال لحلف العبد مع شاهده إذا جاء بشاهد أن سيده أعتقه وأن العبد إذا جاء بشاهد على مال من الأموال ادعاه حلف مع شاهده واستحق حقه كما يحلف الحر ‏.‏ قال مالك فالسنة عندنا أن العبد إذا جاء بشاهد على عتاقته استحلف سيده ما أعتقه وبطل ذلك عنه ‏.‏ قال مالك وكذلك السنة عندنا أيضا في الطلاق إذا جاءت المرأة بشاهد أن زوجها طلقها أحلف زوجها ما طلقها فإذا حلف لم يقع عليه الطلاق ‏.‏ قال مالك فسنة الطلاق والعتاقة في الشاهد الواحد واحدة إنما يكون اليمين على زوج المرأة وعلى سيد العبد وإنما العتاقة حد من الحدود لا تجوز فيها شهادة النساء لأنه إذا عتق العبد ثبتت حرمته ووقعت له الحدود ووقعت عليه وإن زنى وقد أحصن رجم وإن قتل العبد قتل به وثبت له الميراث بينه وبين من يوارثه فإن احتج محتج فقال لو أن رجلا أعتق عبده وجاء رجل يطلب سيد العبد بدين له عليه فشهد له على حقه ذلك رجل وامرأتان فإن ذلك يثبت الحق على سيد العبد حتى ترد به عتاقته إذا لم يكن لسيد العبد مال غير العبد يريد أن يجيز بذلك شهادة النساء في العتاقة فإن ذلك ليس على ما قال وإنما مثل ذلك الرجل يعتق عبده ثم يأتي طالب الحق على سيده بشاهد واحد فيحلف مع شاهده ثم يستحق حقه وترد بذلك عتاقة العبد أو يأتي الرجل قد كانت بينه وبين سيد العبد مخالطة وملابسة فيزعم أن له على سيد العبد مالا فيقال لسيد العبد احلف ما عليك ما ادعى فإن نكل وأبى أن يحلف حلف صاحب الحق وثبت حقه على سيد العبد فيكون ذلك يرد عتاقة العبد إذا ثبت المال على سيده ‏.‏ قال وكذلك أيضا الرجل ينكح الأمة فتكون امرأته فيأتي سيد الأمة إلى الرجل الذي تزوجها فيقول ابتعت مني جاريتي فلانة أنت وفلان بكذا وكذا دينارا ‏.‏ فينكر ذلك زوج الأمة فيأتي سيد الأمة برجل وامرأتين فيشهدون على ما قال فيثبت بيعه ويحق حقه وتحرم الأمة على زوجها ويكون ذلك فراقا بينهما وشهادة النساء لا تجوز في الطلاق ‏.‏ قال مالك ومن ذلك أيضا الرجل يفتري على الرجل الحر فيقع عليه الحد فيأتي رجل وامرأتان فيشهدون أن الذي افتري عليه عبد مملوك فيضع ذلك الحد عن المفتري بعد أن وقع عليه وشهادة النساء لا تجوز في الفرية ‏.‏ قال مالك ومما يشبه ذلك أيضا مما يفترق فيه القضاء وما مضى من السنة أن المرأتين يشهدان على استهلال الصبي فيجب بذلك ميراثه حتى يرث ويكون ماله لمن يرثه إن مات الصبي وليس مع المرأتين اللتين شهدتا رجل ولا يمين وقد يكون ذلك في الأموال العظام من الذهب والورق والرباع والحوائط والرقيق وما سوى ذلك من الأموال ولو شهدت امرأتان على درهم واحد أو أقل من ذلك أو أكثر لم تقطع شهادتهما شيئا ولم تجز إلا أن يكون معهما شاهد أو يمين ‏.‏ قال مالك ومن الناس من يقول لا تكون اليمين مع الشاهد الواحد ‏.‏ ويحتج بقول الله تبارك وتعالى وقوله الحق ‏{‏واستشهدوا شهيدين من رجالكم فإن لم يكونا رجلين فرجل وامرأتان ممن ترضون من الشهداء‏}‏ يقول فإن لم يأت برجل وامرأتين فلا شىء له ولا يحلف مع شاهده ‏.‏ قال مالك فمن الحجة على من قال ذلك القول أن يقال له أرأيت لو أن رجلا ادعى على رجل مالا أليس يحلف المطلوب ما ذلك الحق عليه فإن حلف بطل ذلك عنه وإن نكل عن اليمين حلف صاحب الحق إن حقه لحق ‏.‏ وثبت حقه على صاحبه فهذا ما لا اختلاف فيه عند أحد من الناس ولا ببلد من البلدان فبأى شىء أخذ هذا أو في أى موضع من كتاب الله وجده فإن أقر بهذا فليقرر باليمين مع الشاهد وإن لم يكن ذلك في كتاب الله عز وجل وأنه ليكفي من ذلك ما مضى من السنة ولكن المرء قد يحب أن يعرف وجه الصواب وموقع الحجة ففي هذا بيان ما أشكل من ذلك إن شاء الله تعالى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1408
			}
		},
		{
			"hadithnumber": 1409,
			"arabicnumber": 1409,
			"text": "قال يحيى قال مالك عن جميل بن عبد الرحمن المؤذن، أنه كان يحضر عمر بن عبد العزيز وهو يقضي بين الناس فإذا جاءه الرجل يدعي على الرجل حقا نظر فإن كانت بينهما مخالطة أو ملابسة أحلف الذي ادعي عليه وإن لم يكن شىء من ذلك لم يحلفه ‏.‏ قال مالك وعلى ذلك الأمر عندنا أنه من ادعى على رجل بدعوى نظر فإن كانت بينهما مخالطة أو ملابسة أحلف المدعى عليه فإن حلف بطل ذلك الحق عنه وإن أبى أن يحلف ورد اليمين على المدعي فحلف طالب الحق أخذ حقه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1409
			}
		},
		{
			"hadithnumber": 1410,
			"arabicnumber": 1410,
			"text": "قال يحيى قال مالك عن هشام بن عروة، أن عبد الله بن الزبير، كان يقضي بشهادة الصبيان فيما بينهم من الجراح ‏.‏ قال مالك الأمر المجتمع عليه عندنا أن شهادة الصبيان تجوز فيما بينهم من الجراح ولا تجوز على غيرهم وإنما تجوز شهادتهم فيما بينهم من الجراح وحدها لا تجوز في غير ذلك إذا كان ذلك قبل أن يتفرقوا أو يخببوا أو يعلموا فإن افترقوا فلا شهادة لهم إلا أن يكونوا قد أشهدوا العدول على شهادتهم قبل أن يفترقوا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1410
			}
		},
		{
			"hadithnumber": 1411,
			"arabicnumber": 1411,
			"text": "قال يحيى حدثنا مالك، عن هاشم بن هاشم بن عتبة بن أبي وقاص، عن عبد الله بن نسطاس، عن جابر بن عبد الله الأنصاري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من حلف على منبري آثما تبوأ مقعده من النار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1411
			}
		},
		{
			"hadithnumber": 1412,
			"arabicnumber": 1412,
			"text": "وحدثني مالك، عن العلاء بن عبد الرحمن، عن معبد بن كعب السلمي، عن أخيه عبد الله بن كعب بن مالك الأنصاري، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتطع حق امرئ مسلم بيمينه حرم الله عليه الجنة وأوجب له النار ‏\"‏ ‏.‏ قالوا وإن كان شيئا يسيرا يا رسول الله قال ‏\"‏ وإن كان قضيبا من أراك وإن كان قضيبا من أراك وإن كان قضيبا من أراك ‏\"‏ ‏.‏ قالها ثلاث مرات ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1412
			}
		},
		{
			"hadithnumber": 1413,
			"arabicnumber": 1413,
			"text": "قال يحيى قال مالك عن داود بن الحصين، أنه سمع أبا غطفان بن طريف المري، يقول اختصم زيد بن ثابت الأنصاري وابن مطيع في دار كانت بينهما إلى مروان بن الحكم وهو أمير على المدينة فقضى مروان على زيد بن ثابت باليمين على المنبر ‏.‏ فقال زيد بن ثابت أحلف له مكاني ‏.‏ قال فقال مروان لا والله إلا عند مقاطع الحقوق ‏.‏ قال فجعل زيد بن ثابت يحلف أن حقه لحق ‏.‏ ويأبى أن يحلف على المنبر - قال - فجعل مروان بن الحكم يعجب من ذلك ‏.‏ قال مالك لا أرى أن يحلف أحد على المنبر على أقل من ربع دينار وذلك ثلاثة دراهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1413
			}
		},
		{
			"hadithnumber": 1414,
			"arabicnumber": 1414,
			"text": "قال يحيى حدثنا مالك، عن ابن شهاب، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يغلق الرهن ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1414
			}
		},
		{
			"hadithnumber": 1415,
			"arabicnumber": 1415,
			"text": "حدثني مالك، عن ابن شهاب، أن عبد الملك بن مروان، قضى في امرأة أصيبت مستكرهة بصداقها على من فعل ذلك بها ‏.‏ قال يحيى سمعت مالكا يقول الأمر عندنا في الرجل يغتصب المرأة بكرا كانت أو ثيبا إنها إن كانت حرة فعليه صداق مثلها وإن كانت أمة فعليه ما نقص من ثمنها والعقوبة في ذلك على المغتصب ولا عقوبة على المغتصبة في ذلك كله وإن كان المغتصب عبدا فذلك على سيده إلا أن يشاء أن يسلمه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1415
			}
		},
		{
			"hadithnumber": 1416,
			"arabicnumber": 1416,
			"text": "حدثنا يحيى، عن مالك، عن زيد بن أسلم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غير دينه فاضربوا عنقه ‏\"‏ ‏.‏ ومعنى قول النبي صلى الله عليه وسلم فيما نرى - والله أعلم - ‏\"‏ من غير دينه فاضربوا عنقه ‏\"‏ ‏.‏ أنه من خرج من الإسلام إلى غيره مثل الزنادقة وأشباههم فإن أولئك إذا ظهر عليهم قتلوا ولم يستتابوا لأنه لا تعرف توبتهم وأنهم كانوا يسرون الكفر ويعلنون الإسلام فلا أرى أن يستتاب هؤلاء ولا يقبل منهم قولهم وأما من خرج من الإسلام إلى غيره وأظهر ذلك فإنه يستتاب فإن تاب وإلا قتل وذلك لو أن قوما كانوا على ذلك رأيت أن يدعوا إلى الإسلام ويستتابوا فإن تابوا قبل ذلك منهم وإن لم يتوبوا قتلوا ولم يعن بذلك فيما نرى والله أعلم من خرج من اليهودية إلى النصرانية ولا من النصرانية إلى اليهودية ولا من يغير دينه من أهل الأديان كلها إلا الإسلام فمن خرج من الإسلام إلى غيره وأظهر ذلك فذلك الذي عني به والله أعلم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1416
			}
		},
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "وحدثني مالك، عن عبد الرحمن بن محمد بن عبد الله بن عبد القاري، عن أبيه، أنه قال قدم على عمر بن الخطاب رجل من قبل أبي موسى الأشعري فسأله عن الناس، فأخبره ثم، قال له عمر هل كان فيكم من مغربة خبر فقال نعم رجل كفر بعد إسلامه ‏.‏ قال فما فعلتم به قال قربناه فضربنا عنقه ‏.‏ فقال عمر أفلا حبستموه ثلاثا وأطعمتموه كل يوم رغيفا واستتبتموه لعله يتوب ويراجع أمر الله ثم قال عمر اللهم إني لم أحضر ولم آمر ولم أرض إذ بلغني ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1417
			}
		},
		{
			"hadithnumber": 1418,
			"arabicnumber": 1418,
			"text": "حدثنا يحيى، عن مالك، عن سهيل بن أبي صالح السمان، عن أبيه، عن أبي هريرة، أن سعد بن عبادة، قال لرسول الله صلى الله عليه وسلم أرأيت إن وجدت مع امرأتي رجلا أأمهله حتى آتي بأربعة شهداء فقال رسول الله صلى الله عليه وسلم ‏ \"‏ نعم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1418
			}
		},
		{
			"hadithnumber": 1419,
			"arabicnumber": 1419,
			"text": "وحدثني مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أن رجلا، من أهل الشام - يقال له ابن خيبري - وجد مع امرأته رجلا فقتله أو قتلهما معا فأشكل على معاوية بن أبي سفيان القضاء فيه فكتب إلى أبي موسى الأشعري يسأل له علي بن أبي طالب عن ذلك فسأل أبو موسى عن ذلك علي بن أبي طالب فقال له علي إن هذا الشىء ما هو بأرضي عزمت عليك لتخبرني ‏.‏ فقال له أبو موسى كتب إلى معاوية بن أبي سفيان أن أسألك عن ذلك ‏.‏ فقال علي أنا أبو حسن إن لم يأت بأربعة شهداء فليعط برمته ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1419
			}
		},
		{
			"hadithnumber": 1420,
			"arabicnumber": 1420,
			"text": "قال يحيى قال مالك عن ابن شهاب، عن سنين أبي جميلة، رجل من بني سليم أنه وجد منبوذا في زمان عمر بن الخطاب قال فجئت به إلى عمر بن الخطاب فقال ما حملك على أخذ هذه النسمة فقال وجدتها ضائعة فأخذتها ‏.‏ فقال له عريفه يا أمير المؤمنين إنه رجل صالح ‏.‏ فقال له عمر أكذلك قال نعم ‏.‏ فقال عمر بن الخطاب اذهب فهو حر ولك ولاؤه وعلينا نفقته ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1420
			}
		},
		{
			"hadithnumber": 1421,
			"arabicnumber": 1421,
			"text": "قال يحيى عن مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان عتبة بن أبي وقاص عهد إلى أخيه سعد بن أبي وقاص أن ابن وليدة زمعة مني فاقبضه إليك ‏.‏ قالت فلما كان عام الفتح أخذه سعد وقال ابن أخي قد كان عهد إلى فيه ‏.‏ فقام إليه عبد بن زمعة فقال أخي وابن وليدة أبي ولد على فراشه ‏.‏ فتساوقا إلى رسول الله صلى الله عليه وسلم فقال سعد يا رسول الله ابن أخي قد كان عهد إلى فيه ‏.‏ وقال عبد بن زمعة أخي وابن وليدة أبي ولد على فراشه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو لك يا عبد بن زمعة ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ الولد للفراش وللعاهر الحجر ‏\"‏ ‏.‏ ثم قال لسودة بنت زمعة ‏\"‏ احتجبي منه ‏\"‏ ‏.‏ لما رأى من شبهه بعتبة بن أبي وقاص قالت فما رآها حتى لقي الله عز وجل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1421
			}
		},
		{
			"hadithnumber": 1422,
			"arabicnumber": 1422,
			"text": "وحدثني مالك، عن يزيد بن عبد الله بن الهادي، عن محمد بن إبراهيم بن الحارث التيمي، عن سليمان بن يسار، عن عبد الله بن أبي أمية، أن امرأة، هلك عنها زوجها فاعتدت أربعة أشهر وعشرا ثم تزوجت حين حلت فمكثت عند زوجها أربعة أشهر ونصف شهر ثم ولدت ولدا تاما فجاء زوجها إلى عمر بن الخطاب فذكر ذلك له فدعا عمر نسوة من نساء الجاهلية قدماء فسألهن عن ذلك فقالت امرأة منهن أنا أخبرك عن هذه المرأة هلك عنها زوجها حين حملت منه فأهريقت عليه الدماء فحش ولدها في بطنها فلما أصابها زوجها الذي نكحها وأصاب الولد الماء تحرك الولد في بطنها وكبر ‏.‏ فصدقها عمر بن الخطاب وفرق بينهما وقال عمر أما إنه لم يبلغني عنكما إلا خير وألحق الولد بالأول ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1422
			}
		},
		{
			"hadithnumber": 1423,
			"arabicnumber": 1423,
			"text": "وحدثني مالك، عن يحيى بن سعيد، عن سليمان بن يسار، أن عمر بن الخطاب، كان يليط أولاد الجاهلية بمن ادعاهم في الإسلام فأتى رجلان كلاهما يدعي ولد امرأة فدعا عمر بن الخطاب قائفا فنظر إليهما فقال القائف لقد اشتركا فيه فضربه عمر بن الخطاب بالدرة ثم دعا المرأة فقال أخبريني خبرك فقالت كان هذا - لأحد الرجلين - يأتيني ‏.‏ وهي في إبل لأهلها فلا يفارقها حتى يظن وتظن أنه قد استمر بها حبل ثم انصرف عنها فأهريقت عليه دماء ثم خلف عليها هذا - تعني الآخر - فلا أدري من أيهما هو قال فكبر القائف فقال عمر للغلام وال أيهما شئت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1423
			}
		},
		{
			"hadithnumber": 1424,
			"arabicnumber": 1424,
			"text": "وحدثني مالك، أنه بلغه أن عمر بن الخطاب، أو عثمان بن عفان قضى أحدهما في امرأة غرت رجلا بنفسها وذكرت أنها حرة فتزوجها فولدت له أولادا فقضى أن يفدي ولده بمثلهم ‏.‏ قال يحيى سمعت مالكا يقول والقيمة أعدل في هذا إن شاء الله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1424
			}
		},
		{
			"hadithnumber": 1425,
			"arabicnumber": 1425,
			"text": "قال يحيى قال مالك عن ابن شهاب، عن سالم بن عبد الله بن عمر، عن أبيه، أن عمر بن الخطاب، قال ما بال رجال يطئون ولائدهم ثم يعزلوهن لا تأتيني وليدة يعترف سيدها أن قد ألم بها إلا ألحقت به ولدها فاعزلوا بعد أو اتركوا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1425
			}
		},
		{
			"hadithnumber": 1426,
			"arabicnumber": 1426,
			"text": "وحدثني مالك، عن نافع، عن صفية بنت أبي عبيد، أنها أخبرته أن عمر بن الخطاب قال ما بال رجال يطئون ولائدهم ثم يدعوهن يخرجن لا تأتيني وليدة يعترف سيدها أن قد ألم بها إلا قد ألحقت به ولدها فأرسلوهن بعد أو أمسكوهن ‏.‏ قال يحيى سمعت مالكا يقول الأمر عندنا في أم الولد إذا جنت جناية ضمن سيدها ما بينها وبين قيمتها وليس له أن يسلمها وليس عليه أن يحمل من جنايتها أكثر من قيمتها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1426
			}
		},
		{
			"hadithnumber": 1427,
			"arabicnumber": 1427,
			"text": "حدثني يحيى، عن مالك، عن هشام بن عروة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أحيا أرضا ميتة فهي له وليس لعرق ظالم حق ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1427
			}
		},
		{
			"hadithnumber": 1428,
			"arabicnumber": 1428,
			"text": "وحدثني مالك، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن عمر بن الخطاب، قال من أحيا أرضا ميتة فهي له ‏.‏ قال مالك وعلى ذلك الأمر عندنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1428
			}
		},
		{
			"hadithnumber": 1429,
			"arabicnumber": 1429,
			"text": "حدثني يحيى، عن مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، أنه بلغه أن رسول الله صلى الله عليه وسلم قال في سيل مهزور ومذينب ‏ \"‏ يمسك حتى الكعبين ثم يرسل الأعلى على الأسفل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1429
			}
		},
		{
			"hadithnumber": 1430,
			"arabicnumber": 1430,
			"text": "وحدثني مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يمنع فضل الماء ليمنع به الكلأ ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1430
			}
		},
		{
			"hadithnumber": 1431,
			"arabicnumber": 1431,
			"text": "وحدثني مالك، عن أبي الرجال، محمد بن عبد الرحمن عن أمه، عمرة بنت عبد الرحمن أنها أخبرته أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يمنع نقع بئر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1431
			}
		},
		{
			"hadithnumber": 1432,
			"arabicnumber": 1432,
			"text": "حدثني يحيى، عن مالك، عن عمرو بن يحيى المازني، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا ضرر ولا ضرار ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1432
			}
		},
		{
			"hadithnumber": 1433,
			"arabicnumber": 1433,
			"text": "وحدثني مالك، عن ابن شهاب، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يمنع أحدكم جاره خشبة يغرزها فى جداره ‏\"‏ ‏.‏ ثم يقول أبو هريرة ما لي أراكم عنها معرضين والله لأرمين بها بين أكتافكم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1433
			}
		},
		{
			"hadithnumber": 1434,
			"arabicnumber": 1434,
			"text": "وحدثني مالك، عن عمرو بن يحيى المازني، عن أبيه، أن الضحاك بن خليفة، ساق خليجا له من العريض فأراد أن يمر به في أرض محمد بن مسلمة فأبى محمد ‏.‏ فقال له الضحاك لم تمنعني وهو لك منفعة تشرب به أولا وآخرا ولا يضرك ‏.‏ فأبى محمد فكلم فيه الضحاك عمر بن الخطاب فدعا عمر بن الخطاب محمد بن مسلمة فأمره أن يخلي سبيله فقال محمد لا ‏.‏ فقال عمر لم تمنع أخاك ما ينفعه وهو لك نافع تسقي به أولا وآخرا وهو لا يضرك ‏.‏ فقال محمد لا والله ‏.‏ فقال عمر والله ليمرن به ولو على بطنك ‏.‏ فأمره عمر أن يمر به ففعل الضحاك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1434
			}
		},
		{
			"hadithnumber": 1435,
			"arabicnumber": 1435,
			"text": "وحدثني مالك، عن عمرو بن يحيى المازني، عن أبيه، أنه قال كان في حائط جده ربيع لعبد الرحمن بن عوف فأراد عبد الرحمن بن عوف أن يحوله إلى ناحية من الحائط هي أقرب إلى أرضه فمنعه صاحب الحائط فكلم عبد الرحمن بن عوف عمر بن الخطاب في ذلك فقضى لعبد الرحمن بن عوف بتحويله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1435
			}
		},
		{
			"hadithnumber": 1436,
			"arabicnumber": 1436,
			"text": "حدثني يحيى، عن مالك، عن ثور بن زيد الديلي، أنه قال بلغني أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما دار أو أرض قسمت في الجاهلية فهي على قسم الجاهلية وأيما دار أو أرض أدركها الإسلام ولم تقسم فهي على قسم الإسلام ‏\"‏ ‏.‏ قال يحيى سمعت مالكا يقول فيمن هلك وترك أموالا بالعالية والسافلة إن البعل لا يقسم مع النضح إلا أن يرضى أهله بذلك وإن البعل يقسم مع العين إذا كان يشبهها وأن الأموال إذا كانت بأرض واحدة الذي بينهما متقارب أنه يقام كل مال منها ثم يقسم بينهم والمساكن والدور بهذه المنزلة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1436
			}
		},
		{
			"hadithnumber": 1437,
			"arabicnumber": 1437,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن حرام بن سعد بن محيصة، أن ناقة، للبراء بن عازب دخلت حائط رجل فأفسدت فيه فقضى رسول الله صلى الله عليه وسلم أن على أهل الحوائط حفظها بالنهار وأن ما أفسدت المواشي بالليل ضامن على أهلها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1437
			}
		},
		{
			"hadithnumber": 1438,
			"arabicnumber": 1438,
			"text": "وحدثني مالك، عن هشام بن عروة، عن أبيه، عن يحيى بن عبد الرحمن بن حاطب، أن رقيقا، لحاطب سرقوا ناقة لرجل من مزينة فانتحروها فرفع ذلك إلى عمر بن الخطاب فأمر عمر كثير بن الصلت أن يقطع أيديهم ثم قال عمر أراك تجيعهم ‏.‏ ثم قال عمر والله لأغرمنك غرما يشق عليك ثم قال للمزني كم ثمن ناقتك فقال المزني قد كنت والله أمنعها من أربعمائة درهم ‏.‏ فقال عمر أعطه ثمانمائة درهم ‏.‏ قال يحيى سمعت مالكا يقول وليس على هذا العمل عندنا في تضعيف القيمة ولكن مضى أمر الناس عندنا على أنه إنما يغرم الرجل قيمة البعير أو الدابة يوم يأخذها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1438
			}
		},
		{
			"hadithnumber": 1439,
			"arabicnumber": 1439,
			"text": "حدثنا يحيى، عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن بن عوف، وعن محمد بن النعمان بن بشير، أنهما حدثاه عن النعمان بن بشير، أنه قال إن أباه بشيرا أتى به إلى رسول الله صلى الله عليه وسلم فقال إني نحلت ابني هذا غلاما كان لي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أكل ولدك نحلته مثل هذا ‏\"‏ ‏.‏ فقال لا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فارتجعه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1439
			}
		},
		{
			"hadithnumber": 1440,
			"arabicnumber": 1440,
			"text": "وحدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت إن أبا بكر الصديق كان نحلها جاد عشرين وسقا من ماله بالغابة فلما حضرته الوفاة قال والله يا بنية ما من الناس أحد أحب إلى غنى بعدي منك ولا أعز على فقرا بعدي منك وإني كنت نحلتك جاد عشرين وسقا فلو كنت جددتيه واحتزتيه كان لك وإنما هو اليوم مال وارث وإنما هما أخواك وأختاك فاقتسموه على كتاب الله ‏.‏ قالت عائشة فقلت يا أبت والله لو كان كذا وكذا لتركته إنما هي أسماء فمن الأخرى فقال أبو بكر ذو بطن بنت خارجة ‏.‏ أراها جارية ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1440
			}
		},
		{
			"hadithnumber": 1441,
			"arabicnumber": 1441,
			"text": "وحدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، أن عمر بن الخطاب، قال ما بال رجال ينحلون أبناءهم نحلا ثم يمسكونها فإن مات ابن أحدهم قال مالي بيدي لم أعطه أحدا ‏.‏ وإن مات هو قال هو لابني قد كنت أعطيته إياه ‏.‏ من نحل نحلة فلم يحزها الذي نحلها - حتى يكون إن مات لورثته - فهي باطل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1441
			}
		},
		{
			"hadithnumber": 1442,
			"arabicnumber": 1442,
			"text": "حدثني مالك، عن داود بن الحصين، عن أبي غطفان بن طريف المري، أن عمر بن الخطاب، قال من وهب هبة لصلة رحم أو على وجه صدقة فإنه لا يرجع فيها ومن وهب هبة يرى أنه إنما أراد بها الثواب فهو على هبته يرجع فيها إذا لم يرض منها ‏.‏ قال يحيى سمعت مالكا يقول الأمر المجتمع عليه عندنا أن الهبة إذا تغيرت عند الموهوب له للثواب بزيادة أو نقصان فإن على الموهوب له أن يعطي صاحبها قيمتها يوم قبضها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1442
			}
		},
		{
			"hadithnumber": 1443,
			"arabicnumber": 1443,
			"text": "حدثني مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، عن جابر بن عبد الله الأنصاري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ أيما رجل أعمر عمرى له ولعقبه فإنها للذي يعطاها لا ترجع إلى الذي أعطاها أبدا ‏\"‏ ‏.‏ لأنه أعطى عطاء وقعت فيه المواريث ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1443
			}
		},
		{
			"hadithnumber": 1444,
			"arabicnumber": 1444,
			"text": "وحدثني مالك، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، أنه سمع مكحولا الدمشقي، يسأل القاسم بن محمد عن العمرى، وما يقول الناس فيها فقال القاسم بن محمد ما أدركت الناس إلا وهم على شروطهم في أموالهم وفيما أعطوا ‏.‏ قال يحيى سمعت مالكا يقول وعلى ذلك الأمر عندنا أن العمرى ترجع إلى الذي أعمرها إذا لم يقل هي لك ولعقبك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1444
			}
		},
		{
			"hadithnumber": 1445,
			"arabicnumber": 1445,
			"text": "وحدثني مالك، عن نافع، ‏.‏ أن عبد الله بن عمر، ورث من حفصة بنت عمر دارها قال وكانت حفصة قد أسكنت بنت زيد بن الخطاب ما عاشت فلما توفيت بنت زيد قبض عبد الله بن عمر المسكن ورأى أنه له ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1445
			}
		},
		{
			"hadithnumber": 1446,
			"arabicnumber": 1446,
			"text": "حدثني مالك، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أنه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن اللقطة ‏.‏ فقال ‏\"‏ اعرف عفاصها ووكاءها ثم عرفها سنة فإن جاء صاحبها وإلا فشأنك بها ‏\"‏ ‏.‏ قال فضالة الغنم يا رسول الله قال ‏\"‏ هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ قال فضالة الإبل قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها ترد الماء وتأكل الشجر حتى يلقاها ربها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1446
			}
		},
		{
			"hadithnumber": 1447,
			"arabicnumber": 1447,
			"text": "وحدثني مالك، عن أيوب بن موسى، عن معاوية بن عبد الله بن بدر الجهني، أن أباه، أخبره أنه، نزل منزل قوم بطريق الشام فوجد صرة فيها ثمانون دينارا فذكرها لعمر بن الخطاب فقال له عمر عرفها على أبواب المساجد واذكرها لكل من يأتي من الشأم سنة فإذا مضت السنة فشأنك بها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1447
			}
		},
		{
			"hadithnumber": 1448,
			"arabicnumber": 1448,
			"text": "وحدثني مالك، عن نافع، أن رجلا، وجد لقطة فجاء إلى عبد الله بن عمر فقال له إني وجدت لقطة فماذا ترى فيها فقال له عبد الله بن عمر عرفها ‏.‏ قال قد فعلت ‏.‏ قال زد ‏.‏ قال قد فعلت ‏.‏ فقال عبد الله لا آمرك أن تأكلها ولو شئت لم تأخذها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1448
			}
		},
		{
			"hadithnumber": 1449,
			"arabicnumber": 1449,
			"text": "وحدثني مالك، عن يحيى بن سعيد، عن سليمان بن يسار، أن ثابت بن الضحاك الأنصاري، أخبره ‏.‏ أنه، وجد بعيرا بالحرة فعقله ثم ذكره لعمر بن الخطاب فأمره عمر أن يعرفه ثلاث مرات فقال له ثابت إنه قد شغلني عن ضيعتي ‏.‏ فقال له عمر أرسله حيث وجدته ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1449
			}
		},
		{
			"hadithnumber": 1450,
			"arabicnumber": 1450,
			"text": "وحدثني مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أن عمر بن الخطاب، قال وهو مسند ظهره إلى الكعبة من أخذ ضالة فهو ضال ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1450
			}
		},
		{
			"hadithnumber": 1451,
			"arabicnumber": 1451,
			"text": "وحدثني مالك، أنه سمع ابن شهاب، يقول كانت ضوال الإبل في زمان عمر بن الخطاب إبلا مؤبلة تناتج لا يمسها أحد حتى إذا كان زمان عثمان بن عفان أمر بتعريفها ثم تباع فإذا جاء صاحبها أعطي ثمنها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1451
			}
		},
		{
			"hadithnumber": 1452,
			"arabicnumber": 1452,
			"text": "حدثني مالك، عن سعيد بن عمرو بن شرحبيل بن سعيد بن سعد بن عبادة، عن أبيه، عن جده، أنه قال خرج سعد بن عبادة مع رسول الله صلى الله عليه وسلم في بعض مغازيه فحضرت أمه الوفاة بالمدينة فقيل لها أوصي ‏.‏ فقالت فيم أوصي إنما المال مال سعد ‏.‏ فتوفيت قبل أن يقدم سعد فلما قدم سعد بن عبادة ذكر ذلك له فقال سعد",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1452
			}
		},
		{
			"hadithnumber": 1453,
			"arabicnumber": 1453,
			"text": "وحدثني مالك، عن هشام بن عروة، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم أن رجلا قال لرسول الله صلى الله عليه وسلم إن أمي افتلتت نفسها وأراها لو تكلمت تصدقت أفأتصدق عنها فقال رسول الله صلى الله عليه وسلم ‏ \"‏ نعم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1453
			}
		},
		{
			"hadithnumber": 1454,
			"arabicnumber": 1454,
			"text": "وحدثني مالك، أنه بلغه أن رجلا، من الأنصار من بني الحارث بن الخزرج تصدق على أبويه بصدقة فهلكا فورث ابنهما المال وهو نخل فسأل عن ذلك رسول الله صلى الله عليه وسلم فقال ‏ \"‏ قد أجرت في صدقتك وخذها بميراثك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 1454
			}
		}
	]
}