{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"41": "Hudud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1500,
			"arabicnumber": 1500,
			"text": "حدثنا مالك، عن نافع، عن عبد الله بن عمر، أنه قال جاءت اليهود إلى رسول الله صلى الله عليه وسلم فذكروا له أن رجلا منهم وامرأة زنيا فقال لهم رسول الله صلى الله عليه وسلم ‏ \"‏ ما تجدون في التوراة في شأن الرجم ‏\"‏ ‏.‏ فقالوا نفضحهم ويجلدون ‏.‏ فقال عبد الله بن سلام كذبتم إن فيها الرجم ‏.‏ فأتوا بالتوراة فنشروها فوضع أحدهم يده على آية الرجم ثم قرأ ما قبلها وما بعدها فقال له عبد الله بن سلام ارفع يدك فرفع يده فإذا فيها آية الرجم فقالوا صدق يا محمد فيها آية الرجم ‏.‏ فأمر بهما رسول الله صلى الله عليه وسلم فرجما ‏.‏ فقال عبد الله بن عمر فرأيت الرجل يحني على المرأة يقيها الحجارة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1500
			}
		},
		{
			"hadithnumber": 1501,
			"arabicnumber": 1501,
			"text": "حدثني مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أن رجلا، من أسلم جاء إلى أبي بكر الصديق فقال له إن الأخر زنا ‏.‏ فقال له أبو بكر هل ذكرت هذا لأحد غيري فقال لا ‏.‏ فقال أبو بكر فتب إلى الله واستتر بستر الله فإن الله يقبل التوبة عن عباده ‏.‏ فلم تقرره نفسه حتى أتى عمر بن الخطاب فقال له مثل ما قال لأبي بكر فقال له عمر مثل ما قال له أبو بكر فلم تقرره نفسه حتى جاء إلى رسول الله صلى الله عليه وسلم فقال له إن الأخر زنا فقال سعيد فأعرض عنه رسول الله صلى الله عليه وسلم ثلاث مرات كل ذلك يعرض عنه رسول الله صلى الله عليه وسلم حتى إذا أكثر عليه بعث رسول الله صلى الله عليه وسلم إلى أهله فقال ‏\"‏ أيشتكي أم به جنة ‏\"‏ ‏.‏ فقالوا يا رسول الله والله إنه لصحيح ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبكر أم ثيب ‏\"‏ ‏.‏ فقالوا بل ثيب يا رسول الله ‏.‏ فأمر به رسول الله صلى الله عليه وسلم فرجم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1501
			}
		},
		{
			"hadithnumber": 1502,
			"arabicnumber": 1502,
			"text": "حدثني مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه قال بلغني أن رسول الله صلى الله عليه وسلم قال لرجل من أسلم يقال له هزال ‏ \"‏ يا هزال لو سترته بردائك لكان خيرا لك ‏\"‏ ‏.‏ قال يحيى بن سعيد فحدثت بهذا الحديث في مجلس فيه يزيد بن نعيم بن هزال الأسلمي فقال يزيد هزال جدي وهذا الحديث حق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1502
			}
		},
		{
			"hadithnumber": 1503,
			"arabicnumber": 1503,
			"text": "حدثني مالك، عن ابن شهاب، أنه أخبره ‏.‏ أن رجلا اعترف على نفسه بالزنا على عهد رسول الله صلى الله عليه وسلم وشهد على نفسه أربع مرات فأمر به رسول الله صلى الله عليه وسلم فرجم ‏.‏ قال ابن شهاب فمن أجل ذلك يؤخذ الرجل باعترافه على نفسه",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1503
			}
		},
		{
			"hadithnumber": 1504,
			"arabicnumber": 1504,
			"text": "حدثني مالك، عن يعقوب بن زيد بن طلحة، عن أبيه، زيد بن طلحة عن عبد الله بن أبي مليكة، أنه أخبره أن امرأة جاءت إلى رسول الله صلى الله عليه وسلم فأخبرته أنها زنت وهي حامل فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ اذهبي حتى تضعي ‏\"‏ ‏.‏ فلما وضعت جاءته فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ اذهبي حتى ترضعيه ‏\"‏ ‏.‏ فلما أرضعته جاءته فقال ‏\"‏ اذهبي فاستودعيه ‏\"‏ ‏.‏ قال فاستودعته ثم جاءت فأمر بها فرجمت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1504
			}
		},
		{
			"hadithnumber": 1505,
			"arabicnumber": 1505,
			"text": "حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد الجهني، أنهما أخبراه أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما يا رسول الله اقض بيننا بكتاب الله وقال الآخر وهو أفقههما أجل يا رسول الله فاقض بيننا بكتاب الله وائذن لي أن أتكلم ‏.‏ قال ‏\"‏ تكلم ‏\"‏ ‏.‏ فقال إن ابني كان عسيفا على هذا فزنا بامرأته فأخبرني أن على ابني الرجم فافتديت منه بمائة شاة وبجارية لي ثم إني سألت أهل العلم فأخبروني أن ما على ابني جلد مائة وتغريب عام وأخبروني أنما الرجم على امرأته ‏.‏ فقال رسول الله ‏\"‏ أما والذي نفسي بيده لأقضين بينكما بكتاب الله أما غنمك وجاريتك فرد عليك ‏\"‏ ‏.‏ وجلد ابنه مائة وغربه عاما وأمر أنيسا الأسلمي أن يأتي امرأة الآخر فإن اعترفت رجمها فاعترفت فرجمها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1505
			}
		},
		{
			"hadithnumber": 1506,
			"arabicnumber": 1506,
			"text": "حدثني مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن سعد بن عبادة، قال لرسول الله صلى الله عليه وسلم أرأيت لو أني وجدت مع امرأتي رجلا أأمهله حتى آتي بأربعة شهداء فقال رسول الله صلى الله عليه وسلم ‏ \"‏ نعم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1506
			}
		},
		{
			"hadithnumber": 1507,
			"arabicnumber": 1507,
			"text": "حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن عبد الله بن عباس، أنه قال سمعت عمر بن الخطاب، يقول الرجم في كتاب الله حق على من زنى من الرجال والنساء إذا أحصن إذا قامت البينة أو كان الحبل أو الاعتراف ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1507
			}
		},
		{
			"hadithnumber": 1508,
			"arabicnumber": 1508,
			"text": "حدثني مالك، عن يحيى بن سعيد، عن سليمان بن يسار، عن أبي واقد الليثي، أن عمر بن الخطاب، أتاه رجل وهو بالشام فذكر له أنه وجد مع امرأته رجلا فبعث عمر بن الخطاب أبا واقد الليثي إلى امرأته يسألها عن ذلك فأتاها وعندها نسوة حولها فذكر لها الذي قال زوجها لعمر بن الخطاب وأخبرها أنها لا تؤخذ بقوله وجعل يلقنها أشباه ذلك لتنزع فأبت أن تنزع وتمت على الاعتراف فأمر بها عمر فرجمت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1508
			}
		},
		{
			"hadithnumber": 1509,
			"arabicnumber": 1509,
			"text": "حدثني مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه سمعه يقول لما صدر عمر بن الخطاب من منى أناخ بالأبطح ثم كوم كومة بطحاء ثم طرح عليها رداءه واستلقى ثم مد يديه إلى السماء فقال اللهم كبرت سني وضعفت قوتي وانتشرت رعيتي ‏.‏ فاقبضني إليك غير مضيع ولا مفرط ‏.‏ ثم قدم المدينة فخطب الناس فقال أيها الناس قد سنت لكم السنن وفرضت لكم الفرائض وتركتم على الواضحة إلا أن تضلوا بالناس يمينا وشمالا وضرب بإحدى يديه على الأخرى ثم قال إياكم أن تهلكوا عن آية الرجم أن يقول قائل لا نجد حدين في كتاب الله فقد رجم رسول الله صلى الله عليه وسلم ورجمنا والذي نفسي بيده لولا أن يقول الناس زاد عمر بن الخطاب في كتاب الله تعالى ‏.‏ لكتبتها الشيخ والشيخة فارجموهما البتة ‏.‏ فإنا قد قرأناها ‏.‏ قال مالك قال يحيى بن سعيد قال سعيد بن المسيب فما انسلخ ذو الحجة حتى قتل عمر رحمه الله ‏.‏ قال يحيى سمعت مالكا يقول قوله الشيخ والشيخة يعني الثيب والثيبة فارجموهما البتة ‏.‏ حدثني مالك أنه سأل ابن شهاب عن الذي يعمل عمل قوم لوط فقال ابن شهاب عليه الرجم أحصن أو لم يحصن ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1509
			}
		},
		{
			"hadithnumber": 1510,
			"arabicnumber": 1510,
			"text": "وحدثني مالك، أنه بلغه أن عثمان بن عفان، أتي بامرأة قد ولدت في ستة أشهر فأمر بها أن ترجم فقال علي بن أبي طالب ليس ذلك عليها إن الله تبارك وتعالى يقول في كتابه ‏{‏وحمله وفصاله ثلاثون شهرا‏}‏ وقال ‏{‏والوالدات يرضعن أولادهن حولين كاملين لمن أراد أن يتم الرضاعة‏}‏ فالحمل يكون ستة أشهر فلا رجم عليها ‏.‏ فبعث عثمان بن عفان في أثرها فوجدها قد رجمت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1510
			}
		},
		{
			"hadithnumber": 1511,
			"arabicnumber": 1511,
			"text": "حدثني مالك، عن زيد بن أسلم، أن رجلا، اعترف على نفسه بالزنا على عهد رسول الله صلى الله عليه وسلم فدعا له رسول الله صلى الله عليه وسلم بسوط فأتي بسوط مكسور فقال ‏\"‏ فوق هذا ‏\"‏ ‏.‏ فأتي بسوط جديد لم تقطع ثمرته فقال ‏\"‏ دون هذا ‏\"‏ ‏.‏ فأتي بسوط قد ركب به ولان فأمر به رسول الله صلى الله عليه وسلم فجلد ثم قال ‏\"‏ أيها الناس قد آن لكم أن تنتهوا عن حدود الله من أصاب من هذه القاذورات شيئا فليستتر بستر الله فإنه من يبدي لنا صفحته نقم عليه كتاب الله ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1511
			}
		},
		{
			"hadithnumber": 1512,
			"arabicnumber": 1512,
			"text": "حدثني مالك، عن نافع، أن صفية بنت أبي عبيد، أخبرته أن أبا بكر الصديق أتي برجل قد وقع على جارية بكر فأحبلها ثم اعترف على نفسه بالزنا ولم يكن أحصن فأمر به أبو بكر فجلد الحد ثم نفي إلى فدك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1512
			}
		},
		{
			"hadithnumber": 1513,
			"arabicnumber": 1513,
			"text": "حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن الأمة إذا زنت ولم تحصن فقال ‏ \"‏ إن زنت فاجلدوها ثم إن زنت فاجلدوها ثم إن زنت فاجلدوها ثم بيعوها ولو بضفير ‏\"‏ ‏.‏ قال ابن شهاب لا أدري أبعد الثالثة أو الرابعة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1513
			}
		},
		{
			"hadithnumber": 1514,
			"arabicnumber": 1514,
			"text": "حدثني مالك، عن نافع، أن عبدا، كان يقوم على رقيق الخمس وأنه استكره جارية من ذلك الرقيق فوقع بها فجلده عمر بن الخطاب ونفاه ولم يجلد الوليدة لأنه استكرهها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1514
			}
		},
		{
			"hadithnumber": 1515,
			"arabicnumber": 1515,
			"text": "حدثني مالك، عن يحيى بن سعيد، أن سليمان بن يسار، أخبره أن عبد الله بن عياش بن أبي ربيعة المخزومي قال أمرني عمر بن الخطاب في فتية من قريش فجلدنا ولائد من ولائد الإمارة خمسين خمسين في الزنا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1515
			}
		},
		{
			"hadithnumber": 1516,
			"arabicnumber": 1516,
			"text": "حدثني مالك، عن أبي الزناد، أنه قال جلد عمر بن عبد العزيز عبدا في فرية ثمانين ‏.‏ قال أبو الزناد فسألت عبد الله بن عامر بن ربيعة عن ذلك فقال أدركت عمر بن الخطاب وعثمان بن عفان والخلفاء هلم جرا فما رأيت أحدا جلد عبدا في فرية أكثر من أربعين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1516
			}
		},
		{
			"hadithnumber": 1517,
			"arabicnumber": 1517,
			"text": "حدثني مالك، عن زريق بن حكيم الأيلي، أن رجلا، يقال له مصباح استعان ابنا له فكأنه استبطأه فلما جاءه قال له يا زان ‏.‏ قال زريق فاستعداني عليه فلما أردت أن أجلده قال ابنه والله لئن جلدته لأبوأن على نفسي بالزنا ‏.‏ فلما قال ذلك أشكل على أمره فكتبت فيه إلى عمر بن عبد العزيز - وهو الوالي يومئذ - أذكر له ذلك فكتب إلى عمر أن أجز عفوه ‏.‏ قال زريق وكتبت إلى عمر بن عبد العزيز أيضا أرأيت رجلا افتري عليه أو على أبويه وقد هلكا أو أحدهما ‏.‏ قال فكتب إلى عمر إن عفا فأجز عفوه في نفسه وإن افتري على أبويه وقد هلكا أو أحدهما فخذ له بكتاب الله إلا أن يريد سترا ‏.‏ قال يحيى سمعت مالكا يقول وذلك أن يكون الرجل المفترى عليه يخاف إن كشف ذلك منه أن تقوم عليه بينة فإذا كان على ما وصفت فعفا جاز عفوه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1517
			}
		},
		{
			"hadithnumber": 1518,
			"arabicnumber": 1518,
			"text": "حدثني مالك، عن هشام بن عروة، عن أبيه، أنه قال في رجل قذف قوما جماعة أنه ليس عليه إلا حد واحد ‏.‏ قال مالك وإن تفرقوا فليس عليه إلا حد واحد ‏.‏ حدثني مالك، عن أبي الرجال، محمد بن عبد الرحمن بن حارثة بن النعمان الأنصاري ثم من بني النجار عن أمه، عمرة بنت عبد الرحمن أن رجلين، استبا في زمان عمر بن الخطاب فقال أحدهما للآخر والله ما أبي بزان ولا أمي بزانية ‏.‏ فاستشار في ذلك عمر بن الخطاب فقال قائل مدح أباه وأمه وقال آخرون قد كان لأبيه وأمه مدح غير هذا نرى أن تجلده الحد ‏.‏ فجلده عمر الحد ثمانين ‏.‏ قال مالك لا حد عندنا إلا في نفى أو قذف أو تعريض يرى أن قائله إنما أراد بذلك نفيا أو قذفا فعلى من قال ذلك الحد تاما ‏.‏ قال مالك الأمر عندنا أنه إذا نفى رجل رجلا من أبيه فإن عليه الحد وإن كانت أم الذي نفي مملوكة فإن عليه الحد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1518
			}
		},
		{
			"hadithnumber": 1520,
			"arabicnumber": 1520,
			"text": "حدثني مالك، عن ربيعة بن أبي عبد الرحمن، أن عمر بن الخطاب، قال لرجل خرج بجارية لامرأته معه في سفر فأصابها فغارت امرأته ‏.‏ فذكرت ذلك لعمر بن الخطاب فسأله عن ذلك فقال وهبتها لي ‏.‏ فقال عمر لتأتيني بالبينة أو لأرمينك بالحجارة ‏.‏ قال فاعترفت امرأته أنها وهبتها له ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1520
			}
		},
		{
			"hadithnumber": 1521,
			"arabicnumber": 1521,
			"text": "حدثني مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قطع في مجن ثمنه ثلاثة دراهم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1521
			}
		},
		{
			"hadithnumber": 1522,
			"arabicnumber": 1522,
			"text": "وحدثني عن مالك، عن عبد الله بن عبد الرحمن بن أبي حسين المكي، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا قطع في ثمر معلق ولا في حريسة جبل ‏\"‏ فإذا آواه المراح أو الجرين فالقطع فيما يبلغ ثمن المجن ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1522
			}
		},
		{
			"hadithnumber": 1523,
			"arabicnumber": 1523,
			"text": "وحدثني عن مالك، عن عبد الله بن أبي بكر، عن أبيه، عن عمرة بنت عبد الرحمن، أن سارقا، سرق في زمان عثمان أترجة فأمر بها عثمان بن عفان أن تقوم فقومت بثلاثة دراهم من صرف اثنى عشر درهما بدينار فقطع عثمان يده ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1523
			}
		},
		{
			"hadithnumber": 1524,
			"arabicnumber": 1524,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت ما طال على وما نسيت ‏ \"‏ القطع في ربع دينار فصاعدا ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1524
			}
		},
		{
			"hadithnumber": 1525,
			"arabicnumber": 1525,
			"text": "وحدثني عن مالك، عن عبد الله بن أبي بكر بن حزم، عن عمرة بنت عبد الرحمن، أنها قالت خرجت عائشة زوج النبي صلى الله عليه وسلم إلى مكة ومعها مولاتان لها ومعها غلام لبني عبد الله بن أبي بكر الصديق فبعثت مع المولاتين ببرد مرجل قد خيط عليه خرقة خضراء قالت فأخذ الغلام البرد ففتق عنه فاستخرجه وجعل مكانه لبدا أو فروة وخاط عليه فلما قدمت المولاتان المدينة دفعتا ذلك إلى أهله فلما فتقوا عنه وجدوا فيه اللبد ولم يجدوا البرد فكلموا المرأتين فكلمتا عائشة زوج النبي صلى الله عليه وسلم أو كتبتا إليها واتهمتا العبد فسئل العبد عن ذلك فاعترف فأمرت به عائشة زوج النبي صلى الله عليه وسلم فقطعت يده وقالت عائشة القطع في ربع دينار فصاعدا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1525
			}
		},
		{
			"hadithnumber": 1526,
			"arabicnumber": 1526,
			"text": "حدثني عن مالك، عن نافع، أن عبدا، لعبد الله بن عمر سرق وهو آبق فأرسل به عبد الله بن عمر إلى سعيد بن العاص - وهو أمير المدينة - ليقطع يده فأبى سعيد أن يقطع يده وقال لا تقطع يد الآبق السارق إذا سرق ‏.‏ فقال له عبد الله بن عمر في أى كتاب الله وجدت هذا ثم أمر به عبد الله بن عمر فقطعت يده ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1526
			}
		},
		{
			"hadithnumber": 1527,
			"arabicnumber": 1527,
			"text": "وحدثني عن مالك، عن زريق بن حكيم، أنه أخبره أنه، أخذ عبدا آبقا قد سرق قال فأشكل على أمره - قال - فكتبت فيه إلى عمر بن عبد العزيز أسأله عن ذلك وهو الوالي يومئذ - قال - فأخبرته أنني كنت أسمع أن العبد الآبق إذا سرق وهو آبق لم تقطع يده - قال - فكتب إلى عمر بن عبد العزيز نقيض كتابي يقول كتبت إلى أنك كنت تسمع أن العبد الآبق إذا سرق لم تقطع يده وأن الله تبارك وتعالى يقول في كتابه ‏{‏والسارق والسارقة فاقطعوا أيديهما جزاء بما كسبا نكالا من الله والله عزيز حكيم‏}‏ ‏.‏ فإن بلغت سرقته ربع دينار فصاعدا فاقطع يده ‏.‏ وحدثني عن مالك، أنه بلغه أن القاسم بن محمد، وسالم بن عبد الله، وعروة بن الزبير، كانوا يقولون إذا سرق العبد الآبق ما يجب فيه القطع قطع ‏.‏ قال مالك وذلك الأمر الذي لا اختلاف فيه عندنا أن العبد الآبق إذا سرق ما يجب فيه القطع قطع ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1527
			}
		},
		{
			"hadithnumber": 1529,
			"arabicnumber": 1529,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن صفوان بن عبد الله بن صفوان، أن صفوان بن أمية، قيل له إنه من لم يهاجر هلك ‏.‏ فقدم صفوان بن أمية المدينة فنام في المسجد وتوسد رداءه فجاء سارق فأخذ رداءه فأخذ صفوان السارق فجاء به إلى رسول الله صلى الله عليه وسلم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أسرقت رداء هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمر به رسول الله صلى الله عليه وسلم أن تقطع يده فقال له صفوان إني لم أرد هذا يا رسول الله هو عليه صدقة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا قبل أن تأتيني به ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1529
			}
		},
		{
			"hadithnumber": 1530,
			"arabicnumber": 1530,
			"text": "وحدثني عن مالك، عن ربيعة بن أبي عبد الرحمن، أن الزبير بن العوام، لقي رجلا قد أخذ سارقا وهو يريد أن يذهب به إلى السلطان فشفع له الزبير ليرسله فقال لا حتى أبلغ به السلطان ‏.‏ فقال الزبير إذا بلغت به السلطان فلعن الله الشافع والمشفع ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1530
			}
		},
		{
			"hadithnumber": 1531,
			"arabicnumber": 1531,
			"text": "حدثني يحيى، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، أن رجلا، من أهل اليمن أقطع اليد والرجل قدم فنزل على أبي بكر الصديق فشكا إليه أن عامل اليمن قد ظلمه فكان يصلي من الليل فيقول أبو بكر وأبيك ما ليلك بليل سارق ‏.‏ ثم إنهم فقدوا عقدا لأسماء بنت عميس امرأة أبي بكر الصديق فجعل الرجل يطوف معهم ويقول اللهم عليك بمن بيت أهل هذا البيت الصالح ‏.‏ فوجدوا الحلي عند صائغ زعم أن الأقطع جاءه به فاعترف به الأقطع أو شهد عليه به فأمر به أبو بكر الصديق فقطعت يده اليسرى وقال أبو بكر والله لدعاؤه على نفسه أشد عندي عليه من سرقته ‏.‏ قال يحيى قال مالك الأمر عندنا في الذي يسرق مرارا ثم يستعدى عليه إنه ليس عليه إلا أن تقطع يده لجميع من سرق منه إذا لم يكن أقيم عليه الحد فإن كان قد أقيم عليه الحد قبل ذلك ثم سرق ما يجب فيه القطع قطع أيضا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1531
			}
		},
		{
			"hadithnumber": 1532,
			"arabicnumber": 1532,
			"text": "وحدثني عن مالك، أن أبا الزناد، أخبره أن عاملا لعمر بن عبد العزيز أخذ ناسا في حرابة ولم يقتلوا أحدا فأراد أن يقطع أيديهم أو يقتل فكتب إلى عمر بن عبد العزيز في ذلك فكتب إليه عمر بن عبد العزيز لو أخذت بأيسر ذلك ‏.‏ قال يحيى وسمعت مالكا يقول الأمر عندنا في الذي يسرق أمتعة الناس التي تكون موضوعة بالأسواق محرزة قد أحرزها أهلها في أوعيتهم وضموا بعضها إلى بعض إنه من سرق من ذلك شيئا من حرزه فبلغ قيمته ما يجب فيه القطع فإن عليه القطع كان صاحب المتاع عند متاعه أو لم يكن ليلا ذلك أو نهارا ‏.‏ قال مالك في الذي يسرق ما يجب عليه فيه القطع ثم يوجد معه ما سرق فيرد إلى صاحبه إنه تقطع يده ‏.‏ قال مالك فإن قال قائل كيف تقطع يده وقد أخذ المتاع منه ودفع إلى صاحبه فإنما هو بمنزلة الشارب يوجد منه ريح الشراب المسكر وليس به سكر فيجلد الحد ‏.‏ قال وإنما يجلد الحد في المسكر إذا شربه وإن لم يسكره وذلك أنه إنما شربه ليسكره فكذلك تقطع يد السارق في السرقة التي أخذت منه ولو لم ينتفع بها ورجعت إلى صاحبها وإنما سرقها حين سرقها ليذهب بها ‏.‏ قال مالك في القوم يأتون إلى البيت فيسرقون منه جميعا فيخرجون بالعدل يحملونه جميعا أو الصندوق أو الخشبة أو بالمكتل أو ما أشبه ذلك مما يحمله القوم جميعا إنهم إذا أخرجوا ذلك من حرزه وهم يحملونه جميعا فبلغ ثمن ما خرجوا به من ذلك ما يجب فيه القطع - وذلك ثلاثة دراهم فصاعدا - فعليهم القطع جميعا ‏.‏ قال وإن خرج كل واحد منهم بمتاع على حدته فمن خرج منهم بما تبلغ قيمته ثلاثة دراهم فصاعدا فعليه القطع ومن لم يخرج منهم بما تبلغ قيمته ثلاثة دراهم فلا قطع عليه ‏.‏ قال يحيى قال مالك الأمر عندنا أنه إذا كانت دار رجل مغلقة عليه ليس معه فيها غيره فإنه لا يجب على من سرق منها شيئا القطع حتى يخرج به من الدار كلها وذلك أن الدار كلها هي حرزه فإن كان معه في الدار ساكن غيره وكان كل إنسان منهم يغلق عليه بابه وكانت حرزا لهم جميعا فمن سرق من بيوت تلك الدار شيئا يجب فيه القطع فخرج به إلى الدار فقد أخرجه من حرزه إلى غير حرزه ووجب عليه فيه القطع ‏.‏ قال مالك والأمر عندنا في العبد يسرق من متاع سيده أنه إن كان ليس من خدمه ولا ممن يأمن على بيته ثم دخل سرا فسرق من متاع سيده ما يجب فيه القطع فلا قطع عليه وكذلك الأمة إذا سرقت من متاع سيدها لا قطع عليها ‏.‏ وقال في العبد لا يكون من خدمه ولا ممن يأمن على بيته فدخل سرا فسرق من متاع امرأة سيده ما يجب فيه القطع إنه تقطع يده ‏.‏ قال وكذلك أمة المرأة إذا كانت ليست بخادم لها ولا لزوجها ولا ممن تأمن على بيتها فدخلت سرا فسرقت من متاع سيدتها ما يجب فيه القطع فلا قطع عليها ‏.‏ قال مالك وكذلك أمة المرأة التي لا تكون من خدمها ولا ممن تأمن على بيتها فدخلت سرا فسرقت من متاع زوج سيدتها ما يجب فيه القطع أنها تقطع يدها ‏.‏ قال مالك وكذلك الرجل يسرق من متاع امرأته أو المرأة تسرق من متاع زوجها ما يجب فيه القطع إن كان الذي سرق كل واحد منهما من متاع صاحبه في بيت سوى البيت الذي يغلقان عليهما وكان في حرز سوى البيت الذي هما فيه فإن من سرق منهما من متاع صاحبه ما يجب فيه القطع فعليه القطع فيه ‏.‏ قال مالك في الصبي الصغير والأعجمي الذي لا يفصح أنهما إذا سرقا من حرزهما أو غلقهما فعلى من سرقهما القطع وإن خرجا من حرزهما وغلقهما فليس على من سرقهما قطع ‏.‏ قال وإنما هما بمنزلة حريسة الجبل والثمر المعلق ‏.‏ قال مالك والأمر عندنا في الذي ينبش القبور أنه إذا بلغ ما أخرج من القبر ما يجب فيه القطع فعليه فيه القطع ‏.‏ وقال مالك وذلك أن القبر حرز لما فيه كما أن البيوت حرز لما فيها ‏.‏ قال ولا يجب عليه القطع حتى يخرج به من القبر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1532
			}
		},
		{
			"hadithnumber": 1533,
			"arabicnumber": 1533,
			"text": "وحدثني يحيى، عن مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، أن عبدا، سرق وديا من حائط رجل فغرسه في حائط سيده فخرج صاحب الودي يلتمس وديه فوجده فاستعدى على العبد مروان بن الحكم فسجن مروان العبد وأراد قطع يده فانطلق سيد العبد إلى رافع بن خديج فسأله عن ذلك فأخبره أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ والكثر الجمار ‏.‏ فقال الرجل فإن مروان بن الحكم أخذ غلاما لي وهو يريد قطعه وأنا أحب أن تمشي معي إليه فتخبره بالذي سمعت من رسول الله صلى الله عليه وسلم ‏.‏ فمشى معه رافع إلى مروان بن الحكم فقال أخذت غلاما لهذا فقال نعم ‏.‏ فقال فما أنت صانع به قال أردت قطع يده ‏.‏ فقال له رافع سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ فأمر مروان بالعبد فأرسل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1533
			}
		},
		{
			"hadithnumber": 1534,
			"arabicnumber": 1534,
			"text": "حدثني عن مالك، عن ابن شهاب، عن السائب بن يزيد، أن عبد الله بن عمرو بن الحضرمي، جاء بغلام له إلى عمر بن الخطاب فقال له اقطع يد غلامي هذا فإنه سرق ‏.‏ فقال له عمر ماذا سرق فقال سرق مرآة لامرأتي ثمنها ستون درهما ‏.‏ فقال عمر أرسله فليس عليه قطع خادمكم سرق متاعكم ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1534
			}
		},
		{
			"hadithnumber": 1535,
			"arabicnumber": 1535,
			"text": "وحدثني عن مالك، عن ابن شهاب، أن مروان بن الحكم، أتي بإنسان قد اختلس متاعا فأراد قطع يده فأرسل إلى زيد بن ثابت يسأله عن ذلك فقال زيد بن ثابت ليس في الخلسة قطع ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1535
			}
		},
		{
			"hadithnumber": 1536,
			"arabicnumber": 1536,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه قال أخبرني أبو بكر بن محمد بن عمرو بن حزم، أنه أخذ نبطيا قد سرق خواتم من حديد فحبسه ليقطع يده فأرسلت إليه عمرة بنت عبد الرحمن مولاة لها يقال لها أمية قال أبو بكر فجاءتني وأنا بين ظهرانى الناس فقالت تقول لك خالتك عمرة يا ابن أختي أخذت نبطيا في شىء يسير ذكر لي فأردت قطع يده قلت نعم ‏.‏ قالت فإن عمرة تقول لك لا قطع إلا في ربع دينار فصاعدا ‏.‏ قال أبو بكر فأرسلت النبطي ‏.‏ قال مالك والأمر المجتمع عليه عندنا في اعتراف العبيد أنه من اعترف منهم على نفسه بشىء يقع الحد والعقوبة فيه في جسده ‏.‏ فإن اعترافه جائز عليه ولا يتهم أن يوقع على نفسه هذا ‏.‏ قال مالك وأما من اعترف منهم بأمر يكون غرما على سيده فإن اعترافه غير جائز على سيده ‏.‏ قال مالك ليس على الأجير ولا على الرجل يكونان مع القوم يخدمانهم إن سرقاهم قطع لأن حالهما ليست بحال السارق وإنما حالهما حال الخائن وليس على الخائن قطع ‏.‏ قال مالك في الذي يستعير العارية فيجحدها إنه ليس عليه قطع وإنما مثل ذلك مثل رجل كان له على رجل دين فجحده ذلك فليس عليه فيما جحده قطع ‏.‏ قال مالك الأمر المجتمع عليه عندنا في السارق يوجد في البيت قد جمع المتاع ولم يخرج به إنه ليس عليه قطع وإنما مثل ذلك كمثل رجل وضع بين يديه خمرا ليشربها فلم يفعل فليس عليه حد ومثل ذلك رجل جلس من امرأة مجلسا وهو يريد أن يصيبها حراما فلم يفعل ولم يبلغ ذلك منها فليس عليه أيضا في ذلك حد ‏.‏ قال مالك الأمر المجتمع عليه عندنا أنه ليس في الخلسة قطع بلغ ثمنها ما يقطع فيه أو لم يبلغ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 1536
			}
		}
	]
}