{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"45": "Madina"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1598,
			"arabicnumber": 1598,
			"text": "وحدثني يحيى بن يحيى، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة الأنصاري، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ اللهم بارك لهم في مكيالهم وبارك لهم في صاعهم ومدهم ‏\"‏ ‏.‏ يعني أهل المدينة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1598
			}
		},
		{
			"hadithnumber": 1599,
			"arabicnumber": 1599,
			"text": "وحدثني يحيى، عن مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أنه قال كان الناس إذا رأوا أول الثمر جاءوا به إلى رسول الله صلى الله عليه وسلم فإذا أخذه رسول الله صلى الله عليه وسلم قال ‏ \"‏ اللهم بارك لنا في ثمرنا وبارك لنا في مدينتنا وبارك لنا في صاعنا وبارك لنا في مدنا اللهم إن إبراهيم عبدك وخليلك ونبيك وإني عبدك ونبيك وإنه دعاك لمكة وإني أدعوك للمدينة بمثل ما دعاك به لمكة ومثله معه ‏\"‏ ‏.‏ ثم يدعو أصغر وليد يراه فيعطيه ذلك الثمر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1599
			}
		},
		{
			"hadithnumber": 1600,
			"arabicnumber": 1600,
			"text": "حدثني يحيى، عن مالك، عن قطن بن وهب بن عمير بن الأجدع، أن يحنس، مولى الزبير بن العوام أخبره أنه، كان جالسا عند عبد الله بن عمر في الفتنة فأتته مولاة له تسلم عليه فقالت إني أردت الخروج يا أبا عبد الرحمن اشتد علينا الزمان ‏.‏ فقال لها عبد الله بن عمر اقعدي لكع فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ لا يصبر على لأوائها وشدتها أحد إلا كنت له شفيعا أو شهيدا يوم القيامة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1600
			}
		},
		{
			"hadithnumber": 1601,
			"arabicnumber": 1601,
			"text": "وحدثني يحيى، عن مالك، عن محمد بن المنكدر، عن جابر بن عبد الله، أن أعرابيا، بايع رسول الله صلى الله عليه وسلم على الإسلام فأصاب الأعرابي وعك بالمدينة فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله أقلني بيعتي ‏.‏ فأبى رسول الله صلى الله عليه وسلم ثم جاءه فقال أقلني بيعتي ‏.‏ فأبى ثم جاءه فقال أقلني بيعتي ‏.‏ فأبى فخرج الأعرابي فقال رسول الله صلى الله عليه وسلم ‏ \"‏ إنما المدينة كالكير تنفي خبثها وينصع طيبها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1601
			}
		},
		{
			"hadithnumber": 1602,
			"arabicnumber": 1602,
			"text": "وحدثني مالك، عن يحيى بن سعيد، أنه قال سمعت أبا الحباب، سعيد بن يسار يقول سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ أمرت بقرية تأكل القرى يقولون يثرب ‏.‏ وهي المدينة تنفي الناس كما ينفي الكير خبث الحديد ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1602
			}
		},
		{
			"hadithnumber": 1603,
			"arabicnumber": 1603,
			"text": "وحدثني مالك، عن هشام بن عروة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ لا يخرج أحد من المدينة رغبة عنها إلا أبدلها الله خيرا منه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1603
			}
		},
		{
			"hadithnumber": 1604,
			"arabicnumber": 1604,
			"text": "وحدثني مالك، عن هشام بن عروة، عن أبيه، عن عبد الله بن الزبير، عن سفيان بن أبي زهير، أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ تفتح اليمن فيأتي قوم يبسون فيتحملون بأهليهم ومن أطاعهم والمدينة خير لهم لو كانوا يعلمون وتفتح الشام فيأتي قوم يبسون فيتحملون بأهليهم ومن أطاعهم والمدينة خير لهم لو كانوا يعلمون وتفتح العراق فيأتي قوم يبسون فيتحملون بأهليهم ومن أطاعهم والمدينة خير لهم لو كانوا يعلمون ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1604
			}
		},
		{
			"hadithnumber": 1605,
			"arabicnumber": 1605,
			"text": "وحدثني يحيى، عن مالك، عن ابن حماس، عن عمه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لتتركن المدينة على أحسن ما كانت حتى يدخل الكلب أو الذئب فيغذي على بعض سواري المسجد أو على المنبر ‏\"‏ ‏.‏ فقالوا يا رسول الله فلمن تكون الثمار ذلك الزمان قال ‏\"‏ للعوافي الطير والسباع ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1605
			}
		},
		{
			"hadithnumber": 1606,
			"arabicnumber": 1606,
			"text": "وحدثني مالك، أنه بلغه أن عمر بن عبد العزيز، حين خرج من المدينة التفت إليها فبكى ثم قال يا مزاحم أتخشى أن نكون ممن نفت المدينة",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1606
			}
		},
		{
			"hadithnumber": 1607,
			"arabicnumber": 1607,
			"text": "حدثني يحيى، عن مالك، عن عمرو، مولى المطلب عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم طلع له أحد فقال ‏ \"‏ هذا جبل يحبنا ونحبه اللهم إن إبراهيم حرم مكة وأنا أحرم ما بين لابتيها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1607
			}
		},
		{
			"hadithnumber": 1608,
			"arabicnumber": 1608,
			"text": "وحدثني مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أنه كان يقول لو رأيت الظباء بالمدينة ترتع ما ذعرتها قال رسول الله صلى الله عليه وسلم ‏ \"‏ ما بين لابتيها حرام ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1608
			}
		},
		{
			"hadithnumber": 1609,
			"arabicnumber": 1609,
			"text": "وحدثني مالك، عن يونس بن يوسف، عن عطاء بن يسار، عن أبي أيوب الأنصاري، أنه وجد غلمانا قد ألجئوا ثعلبا إلى زاوية فطردهم عنه ‏.‏ قال مالك لا أعلم إلا أنه قال أفي حرم رسول الله صلى الله عليه وسلم يصنع هذا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1609
			}
		},
		{
			"hadithnumber": 1610,
			"arabicnumber": 1610,
			"text": "وحدثني يحيى، عن مالك، عن رجل، قال دخل على زيد بن ثابت وأنا بالأسواف، قد اصطدت نهسا فأخذه من يدي فأرسله ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1610
			}
		},
		{
			"hadithnumber": 1611,
			"arabicnumber": 1611,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين، أنها قالت لما قدم رسول الله صلى الله عليه وسلم المدينة وعك أبو بكر وبلال - قالت - فدخلت عليهما فقلت يا أبت كيف تجدك ويا بلال كيف تجدك قالت فكان أبو بكر إذا أخذته الحمى يقول كل امرئ مصبح في أهله والموت أدنى من شراك نعله وكان بلال إذا أقلع عنه يرفع عقيرته فيقول ألا ليت شعري هل أبيتن ليلة بواد وحولي إذخر وجليل وهل أردن يوما مياه مجنة وهل يبدون لي شامة وطفيل قالت عائشة فجئت رسول الله صلى الله عليه وسلم فأخبرته فقال ‏ \"‏ اللهم حبب إلينا المدينة كحبنا مكة أو أشد وصححها وبارك لنا في صاعها ومدها وانقل حماها فاجعلها بالجحفة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1611
			}
		},
		{
			"hadithnumber": 1612,
			"arabicnumber": 1612,
			"text": "قال مالك وحدثني يحيى بن سعيد، أن عائشة، قالت وكان عامر بن فهيرة يقول قد رأيت الموت قبل ذوقه إن الجبان حتفه من فوقه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1612
			}
		},
		{
			"hadithnumber": 1613,
			"arabicnumber": 1613,
			"text": "وحدثني عن مالك، عن نعيم بن عبد الله المجمر، عن أبي هريرة، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ على أنقاب المدينة ملائكة لا يدخلها الطاعون ولا الدجال",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1613
			}
		},
		{
			"hadithnumber": 1614,
			"arabicnumber": 1614,
			"text": "وحدثني عن مالك، عن إسماعيل بن أبي حكيم، أنه سمع عمر بن عبد العزيز، يقول كان من آخر ما تكلم به رسول الله صلى الله عليه وسلم أن قال ‏ \"‏ قاتل الله اليهود والنصارى اتخذوا قبور أنبيائهم مساجد لا يبقين دينان بأرض العرب ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1614
			}
		},
		{
			"hadithnumber": 1615,
			"arabicnumber": 1615,
			"text": "وحدثني عن مالك، عن ابن شهاب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجتمع دينان في جزيرة العرب ‏\"‏ ‏.‏ قال مالك قال ابن شهاب ففحص عن ذلك عمر بن الخطاب حتى أتاه الثلج واليقين أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجتمع دينان في جزيرة العرب ‏\"‏ فأجلى يهود خيبر ‏.‏ قال مالك وقد أجلى عمر بن الخطاب يهود نجران وفدك فأما يهود خيبر فخرجوا منها ليس لهم من الثمر ولا من الأرض شىء وأما يهود فدك فكان لهم نصف الثمر ونصف الأرض لأن رسول الله صلى الله عليه وسلم كان صالحهم على نصف الثمر ونصف الأرض فأقام لهم عمر نصف الثمر ونصف الأرض قيمة من ذهب وورق وإبل وحبال وأقتاب ثم أعطاهم القيمة وأجلاهم منها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1615
			}
		},
		{
			"hadithnumber": 1616,
			"arabicnumber": 1616,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، أن رسول الله صلى الله عليه وسلم طلع له أحد فقال ‏ \"‏ هذا جبل يحبنا ونحبه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1616
			}
		},
		{
			"hadithnumber": 1617,
			"arabicnumber": 1617,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، أن أسلم، مولى عمر بن الخطاب أخبره أنه، زار عبد الله بن عياش المخزومي فرأى عنده نبيذا وهو بطريق مكة فقال له أسلم إن هذا الشراب يحبه عمر بن الخطاب فحمل عبد الله بن عياش قدحا عظيما فجاء به إلى عمر بن الخطاب فوضعه في يديه فقربه عمر إلى فيه ثم رفع رأسه فقال عمر إن هذا لشراب طيب فشرب منه ثم ناوله رجلا عن يمينه ‏.‏ فلما أدبر عبد الله ناداه عمر بن الخطاب فقال أأنت القائل لمكة خير من المدينة فقال عبد الله فقلت هي حرم الله وأمنه وفيها بيته ‏.‏ فقال عمر لا أقول في بيت الله ولا في حرمه شيئا ‏.‏ ثم قال عمر أأنت القائل لمكة خير من المدينة قال فقلت هي حرم الله وأمنه وفيها بيته ‏.‏ فقال عمر لا أقول في حرم الله ولا في بيته شيئا ثم انصرف ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1617
			}
		},
		{
			"hadithnumber": 1618,
			"arabicnumber": 1618,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب، عن عبد الله بن عبد الله بن الحارث بن نوفل، عن عبد الله بن عباس، أن عمر بن الخطاب، خرج إلى الشام حتى إذا كان بسرغ لقيه أمراء الأجناد أبو عبيدة بن الجراح وأصحابه فأخبروه أن الوبأ قد وقع بأرض الشام قال ابن عباس فقال عمر بن الخطاب ادع لي المهاجرين الأولين ‏.‏ فدعاهم فاستشارهم وأخبرهم أن الوبأ قد وقع بالشام فاختلفوا فقال بعضهم قد خرجت لأمر ولا نرى أن ترجع عنه ‏.‏ وقال بعضهم معك بقية الناس وأصحاب رسول الله صلى الله عليه وسلم ولا نرى أن تقدمهم على هذا الوبإ ‏.‏ فقال عمر ارتفعوا عني ‏.‏ ثم قال ادع لي الأنصار فدعوتهم فاستشارهم فسلكوا سبيل المهاجرين واختلفوا كاختلافهم فقال ارتفعوا عني ‏.‏ ثم قال ادع لي من كان ها هنا من مشيخة قريش من مهاجرة الفتح ‏.‏ فدعوتهم فلم يختلف عليه منهم اثنان فقالوا نرى أن ترجع بالناس ولا تقدمهم على هذا الوبإ فنادى عمر في الناس إني مصبح على ظهر فأصبحوا عليه ‏.‏ فقال أبو عبيدة أفرارا من قدر الله فقال عمر لو غيرك قالها يا أبا عبيدة نعم نفر من قدر الله إلى قدر الله أرأيت لو كان لك إبل فهبطت واديا له عدوتان إحداهما مخصبة والأخرى جدبة أليس إن رعيت الخصبة رعيتها بقدر الله وإن رعيت الجدبة رعيتها بقدر الله فجاء عبد الرحمن بن عوف - وكان غائبا في بعض حاجته - فقال إن عندي من هذا علما سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ إذا سمعتم به بأرض فلا تقدموا عليه وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏ ‏.‏ قال فحمد الله عمر ثم انصرف ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1618
			}
		},
		{
			"hadithnumber": 1619,
			"arabicnumber": 1619,
			"text": "وحدثني عن مالك، عن محمد بن المنكدر، وعن سالم أبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، أنه سمعه يسأل، أسامة بن زيد ما سمعت من، رسول الله صلى الله عليه وسلم في الطاعون فقال أسامة قال رسول الله صلى الله عليه وسلم ‏ \"‏ الطاعون رجز أرسل على طائفة من بني إسرائيل أو على من كان قبلكم فإذا سمعتم به بأرض فلا تدخلوا عليه وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏ ‏.‏ قال مالك قال أبو النضر لا يخرجكم إلا فرار منه ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1619
			}
		},
		{
			"hadithnumber": 1620,
			"arabicnumber": 1620,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن عبد الله بن عامر بن ربيعة، أن عمر بن الخطاب، خرج إلى الشام فلما جاء سرغ بلغه أن الوبأ قد وقع بالشام فأخبره عبد الرحمن بن عوف أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا سمعتم به بأرض فلا تقدموا عليه وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏ ‏.‏ فرجع عمر بن الخطاب من سرغ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1620
			}
		},
		{
			"hadithnumber": 1621,
			"arabicnumber": 1621,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عمر بن الخطاب، إنما رجع بالناس من سرغ عن حديث عبد الرحمن بن عوف، ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1621
			}
		},
		{
			"hadithnumber": 1622,
			"arabicnumber": 1622,
			"text": "وحدثني عن مالك، أنه قال بلغني أن عمر بن الخطاب، قال لبيت بركبة أحب إلى من عشرة أبيات بالشام ‏.‏ قال مالك يريد لطول الأعمار والبقاء ولشدة الوبإ بالشام ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 45,
				"hadith": 1622
			}
		}
	]
}