{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"5": "Jumu'a"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 225,
			"arabicnumber": 225,
			"text": "حدثني يحيى، عن مالك، عن سمى، مولى أبي بكر بن عبد الرحمن عن أبي صالح السمان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح في الساعة الأولى فكأنما قرب بدنة ومن راح في الساعة الثانية فكأنما قرب بقرة ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن ومن راح في الساعة الرابعة فكأنما قرب دجاجة ومن راح في الساعة الخامسة فكأنما قرب بيضة فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 225
			}
		},
		{
			"hadithnumber": 226,
			"arabicnumber": 226,
			"text": "وحدثني عن مالك، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، أنه كان يقول غسل يوم الجمعة واجب على كل محتلم كغسل الجنابة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 226
			}
		},
		{
			"hadithnumber": 227,
			"arabicnumber": 227,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن سالم بن عبد الله، أنه قال دخل رجل من أصحاب رسول الله صلى الله عليه وسلم المسجد يوم الجمعة وعمر بن الخطاب يخطب فقال عمر أية ساعة هذه فقال يا أمير المؤمنين انقلبت من السوق فسمعت النداء فما زدت على أن توضأت ‏.‏ فقال عمر والوضوء أيضا وقد علمت أن رسول الله صلى الله عليه وسلم كان يأمر بالغسل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 227
			}
		},
		{
			"hadithnumber": 228,
			"arabicnumber": 228,
			"text": "وحدثني عن مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 228
			}
		},
		{
			"hadithnumber": 229,
			"arabicnumber": 229,
			"text": "وحدثني عن مالك، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا جاء أحدكم الجمعة فليغتسل ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 229
			}
		},
		{
			"hadithnumber": 230,
			"arabicnumber": 230,
			"text": "حدثني يحيى، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا قلت لصاحبك أنصت والإمام يخطب يوم الجمعة فقد لغوت ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 230
			}
		},
		{
			"hadithnumber": 231,
			"arabicnumber": 231,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن ثعلبة بن أبي مالك القرظي، أنه أخبره أنهم، كانوا في زمان عمر بن الخطاب يصلون يوم الجمعة حتى يخرج عمر فإذا خرج عمر وجلس على المنبر وأذن المؤذنون - قال ثعلبة - جلسنا نتحدث فإذا سكت المؤذنون وقام عمر يخطب أنصتنا فلم يتكلم منا أحد ‏.‏ قال ابن شهاب فخروج الإمام يقطع الصلاة وكلامه يقطع الكلام ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 231
			}
		},
		{
			"hadithnumber": 232,
			"arabicnumber": 232,
			"text": "وحدثني عن مالك، عن أبي النضر، مولى عمر بن عبيد الله عن مالك بن أبي عامر، أن عثمان بن عفان، كان يقول في خطبته قلما يدع ذلك إذا خطب إذا قام الإمام يخطب يوم الجمعة فاستمعوا وأنصتوا فإن للمنصت الذي لا يسمع من الحظ مثل ما للمنصت السامع فإذا قامت الصلاة فاعدلوا الصفوف وحاذوا بالمناكب فإن اعتدال الصفوف من تمام الصلاة ‏.‏ ثم لا يكبر حتى يأتيه رجال قد وكلهم بتسوية الصفوف فيخبرونه أن قد استوت فيكبر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 232
			}
		},
		{
			"hadithnumber": 233,
			"arabicnumber": 233,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، رأى رجلين يتحدثان والإمام يخطب يوم الجمعة فحصبهما أن اصمتا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 233
			}
		},
		{
			"hadithnumber": 234,
			"arabicnumber": 234,
			"text": "وحدثني عن مالك، أنه بلغه أن رجلا، عطس يوم الجمعة والإمام يخطب فشمته إنسان إلى جنبه فسأل عن ذلك سعيد بن المسيب فنهاه عن ذلك وقال لا تعد ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 234
			}
		},
		{
			"hadithnumber": 235,
			"arabicnumber": 235,
			"text": "وحدثني عن مالك، أنه سأل ابن شهاب عن الكلام، يوم الجمعة إذا نزل الإمام عن المنبر، قبل أن يكبر، ‏.‏ فقال ابن شهاب لا بأس بذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 235
			}
		},
		{
			"hadithnumber": 236,
			"arabicnumber": 236,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، أنه كان يقول من أدرك من صلاة الجمعة ركعة فليصل إليها أخرى ‏.‏ قال ابن شهاب وهي السنة ‏.‏ قال مالك وعلى ذلك أدركت أهل العلم ببلدنا وذلك أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ من أدرك من الصلاة ركعة فقد أدرك الصلاة ‏\"‏ ‏.‏ قال مالك في الذي يصيبه زحام يوم الجمعة فيركع ولا يقدر على أن يسجد حتى يقوم الإمام أو يفرغ الإمام من صلاته إنه إن قدر على أن يسجد إن كان قد ركع فليسجد إذا قام الناس وإن لم يقدر على أن يسجد حتى يفرغ الإمام من صلاته فإنه أحب إلى أن يبتدئ صلاته ظهرا أربعا ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 236
			}
		},
		{
			"hadithnumber": 237,
			"arabicnumber": 237,
			"text": "حدثني يحيى، عن مالك، أنه سأل ابن شهاب عن قول الله، عز وجل ‏{‏يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله‏}‏ فقال ابن شهاب كان عمر بن الخطاب يقرؤها إذا نودي للصلاة من يوم الجمعة فامضوا إلى ذكر الله ‏.‏ قال مالك وإنما السعى في كتاب الله العمل والفعل يقول الله تبارك وتعالى ‏{‏وإذا تولى سعى في الأرض‏}‏ وقال تعالى ‏{‏وأما من جاءك يسعى وهو يخشى‏}‏ وقال ‏{‏ثم أدبر يسعى‏}‏ وقال ‏{‏إن سعيكم لشتى‏}‏ قال مالك فليس السعى الذي ذكر الله في كتابه بالسعى على الأقدام ولا الاشتداد وإنما عنى العمل والفعل ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 237
			}
		},
		{
			"hadithnumber": 238,
			"arabicnumber": 238,
			"text": "حدثني يحيى، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم ذكر يوم الجمعة فقال ‏ \"‏ فيه ساعة لا يوافقها عبد مسلم وهو قائم يصلي يسأل الله شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ وأشار رسول الله صلى الله عليه وسلم بيده يقللها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 238
			}
		},
		{
			"hadithnumber": 239,
			"arabicnumber": 239,
			"text": "وحدثني عن مالك، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم بن الحارث التيمي، عن أبي سلمة بن عبد الرحمن بن عوف، عن أبي هريرة، أنه قال خرجت إلى الطور فلقيت كعب الأحبار فجلست معه فحدثني عن التوراة وحدثته عن رسول الله صلى الله عليه وسلم فكان فيما حدثته أن قلت قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت عليه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط من الجنة وفيه تيب عليه وفيه مات وفيه تقوم الساعة وما من دابة إلا وهي مصيخة يوم الجمعة من حين تصبح حتى تطلع الشمس شفقا من الساعة إلا الجن والإنس وفيه ساعة لا يصادفها عبد مسلم وهو يصلي يسأل الله شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ قال كعب ذلك في كل سنة يوم ‏.‏ فقلت بل في كل جمعة ‏.‏ فقرأ كعب التوراة فقال صدق رسول الله صلى الله عليه وسلم ‏.‏ قال أبو هريرة فلقيت بصرة بن أبي بصرة الغفاري فقال من أين أقبلت فقلت من الطور ‏.‏ فقال لو أدركتك قبل أن تخرج إليه ما خرجت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تعمل المطي إلا إلى ثلاثة مساجد إلى المسجد الحرام وإلى مسجدي هذا وإلى مسجد إيلياء أو بيت المقدس ‏\"‏ ‏.‏ يشك ‏.‏ قال أبو هريرة ثم لقيت عبد الله بن سلام فحدثته بمجلسي مع كعب الأحبار وما حدثته به في يوم الجمعة فقلت قال كعب ذلك في كل سنة يوم ‏.‏ قال قال عبد الله بن سلام كذب كعب ‏.‏ فقلت ثم قرأ كعب التوراة فقال بل هي في كل جمعة ‏.‏ فقال عبد الله بن سلام صدق كعب ‏.‏ ثم قال عبد الله بن سلام قد علمت أية ساعة هي ‏.‏ قال أبو هريرة فقلت له أخبرني بها ولا تضن على ‏.‏ فقال عبد الله بن سلام هي آخر ساعة في يوم الجمعة ‏.‏ قال أبو هريرة فقلت وكيف تكون آخر ساعة في يوم الجمعة وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يصادفها عبد مسلم وهو يصلي ‏\"‏ ‏.‏ وتلك الساعة ساعة لا يصلى فيها فقال عبد الله بن سلام ألم يقل رسول الله صلى الله عليه وسلم ‏\"‏ من جلس مجلسا ينتظر الصلاة فهو في صلاة حتى يصلي ‏\"‏ ‏.‏ قال أبو هريرة فقلت بلى ‏.‏ قال فهو ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 239
			}
		},
		{
			"hadithnumber": 240,
			"arabicnumber": 240,
			"text": "حدثني يحيى، عن مالك، عن يحيى بن سعيد، أنه بلغه أن رسول الله قال ‏ \"‏ ما على أحدكم لو اتخذ ثوبين لجمعته سوى ثوبى مهنته ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 240
			}
		},
		{
			"hadithnumber": 241,
			"arabicnumber": 241,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان لا يروح إلى الجمعة إلا ادهن وتطيب إلا أن يكون حراما ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 241
			}
		},
		{
			"hadithnumber": 242,
			"arabicnumber": 242,
			"text": "حدثني عن مالك، عن عبد الله بن أبي بكر بن حزم، عمن حدثه عن أبي هريرة، أنه كان يقول لأن يصلي أحدكم بظهر الحرة خير له من أن يقعد حتى إذا قام الإمام يخطب جاء يتخطى رقاب الناس يوم الجمعة ‏.‏ قال مالك السنة عندنا أن يستقبل الناس الإمام يوم الجمعة إذا أراد أن يخطب من كان منهم يلي القبلة وغيرها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 242
			}
		},
		{
			"hadithnumber": 243,
			"arabicnumber": 243,
			"text": "حدثني يحيى، عن مالك، عن ضمرة بن سعيد المازني، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن الضحاك بن قيس، سأل النعمان بن بشير ماذا كان يقرأ به رسول الله صلى الله عليه وسلم يوم الجمعة على إثر سورة الجمعة قال كان يقرأ ‏{‏هل أتاك حديث الغاشية‏}‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 243
			}
		},
		{
			"hadithnumber": 244,
			"arabicnumber": 244,
			"text": "وحدثني عن مالك، عن صفوان بن سليم، - قال مالك لا أدري أعن النبي صلى الله عليه وسلم أم لا - أنه قال ‏ \"‏ من ترك الجمعة ثلاث مرات من غير عذر ولا علة طبع الله على قلبه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 244
			}
		},
		{
			"hadithnumber": 245,
			"arabicnumber": 245,
			"text": "وحدثني عن مالك، عن جعفر بن محمد، عن أبيه، أن رسول الله صلى الله عليه وسلم خطب خطبتين يوم الجمعة وجلس بينهما ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 245
			}
		}
	]
}