{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"51": "Hair"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1730,
			"arabicnumber": 1730,
			"text": "وحدثني عن مالك، عن أبي بكر بن نافع، عن أبيه، نافع عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم أمر بإحفاء الشوارب وإعفاء اللحى ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1730
			}
		},
		{
			"hadithnumber": 1731,
			"arabicnumber": 1731,
			"text": "وحدثني عن مالك، عن ابن شهاب، عن حميد بن عبد الرحمن بن عوف، أنه سمع معاوية بن أبي سفيان، عام حج وهو على المنبر وتناول قصة من شعر كانت في يد حرسي يقول يا أهل المدينة أين علماؤكم سمعت رسول الله صلى الله عليه وسلم ينهى عن مثل هذه ويقول ‏ \"‏ إنما هلكت بنو إسرائيل حين اتخذ هذه نساؤهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1731
			}
		},
		{
			"hadithnumber": 1732,
			"arabicnumber": 1732,
			"text": "وحدثني عن مالك، عن زياد بن سعد، عن ابن شهاب، أنه سمعه يقول سدل رسول الله صلى الله عليه وسلم ناصيته ما شاء الله ثم فرق بعد ذلك ‏.‏ قال مالك ليس على الرجل ينظر إلى شعر امرأة ابنه أو شعر أم امرأته بأس ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1732
			}
		},
		{
			"hadithnumber": 1733,
			"arabicnumber": 1733,
			"text": "وحدثني عن مالك، عن نافع، عن عبد الله بن عمر، أنه كان يكره الإخصاء ويقول فيه تمام الخلق ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1733
			}
		},
		{
			"hadithnumber": 1734,
			"arabicnumber": 1734,
			"text": "وحدثني عن مالك، عن صفوان بن سليم، أنه بلغه أن النبي صلى الله عليه وسلم قال ‏ \"‏ أنا وكافل اليتيم له أو لغيره في الجنة كهاتين إذا اتقى ‏\"‏ ‏.‏ وأشار بإصبعيه الوسطى والتي تلي الإبهام ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1734
			}
		},
		{
			"hadithnumber": 1735,
			"arabicnumber": 1735,
			"text": "حدثني عن مالك، عن يحيى بن سعيد، أن أبا قتادة الأنصاري، قال لرسول الله صلى الله عليه وسلم إن لي جمة أفأرجلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم وأكرمها ‏\"‏ فكان أبو قتادة ربما دهنها في اليوم مرتين لما قال له رسول الله صلى الله عليه وسلم ‏\"‏ وأكرمها ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1735
			}
		},
		{
			"hadithnumber": 1736,
			"arabicnumber": 1736,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، أن عطاء بن يسار، أخبره قال كان رسول الله صلى الله عليه وسلم في المسجد فدخل رجل ثائر الرأس واللحية فأشار إليه رسول الله صلى الله عليه وسلم بيده أن اخرج كأنه يعني إصلاح شعر رأسه ولحيته ففعل الرجل ثم رجع فقال رسول الله صلى الله عليه وسلم ‏ \"‏ أليس هذا خيرا من أن يأتي أحدكم ثائر الرأس كأنه شيطان ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1736
			}
		},
		{
			"hadithnumber": 1737,
			"arabicnumber": 1737,
			"text": "حدثني عن مالك، عن يحيى بن سعيد، قال أخبرني محمد بن إبراهيم التيمي، عن أبي سلمة بن عبد الرحمن، أن عبد الرحمن بن الأسود بن عبد يغوث، قال وكان جليسا لهم وكان أبيض اللحية والرأس - قال - فغدا عليهم ذات يوم وقد حمرهما - قال - فقال له القوم هذا أحسن فقال إن أمي عائشة زوج النبي صلى الله عليه وسلم أرسلت إلى البارحة جاريتها نخيلة فأقسمت على لأصبغن وأخبرتني أن أبا بكر الصديق كان يصبغ ‏.‏ قال يحيى سمعت مالكا يقول في صبغ الشعر بالسواد لم أسمع في ذلك شيئا معلوما وغير ذلك من الصبغ أحب إلى ‏.‏ قال وترك الصبغ كله واسع إن شاء الله ليس على الناس فيه ضيق ‏.‏ قال وسمعت مالكا يقول في هذا الحديث بيان أن رسول الله صلى الله عليه وسلم لم يصبغ ولو صبغ رسول الله صلى الله عليه وسلم لأرسلت بذلك عائشة إلى عبد الرحمن بن الأسود ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1737
			}
		},
		{
			"hadithnumber": 1738,
			"arabicnumber": 1738,
			"text": "حدثني عن مالك، عن يحيى بن سعيد، قال بلغني أن خالد بن الوليد، قال لرسول الله صلى الله عليه وسلم إني أروع في منامي ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏ \"‏ قل أعوذ بكلمات الله التامة من غضبه وعقابه وشر عباده ومن همزات الشياطين وأن يحضرون ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1738
			}
		},
		{
			"hadithnumber": 1739,
			"arabicnumber": 1739,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه قال أسري برسول الله صلى الله عليه وسلم فرأى عفريتا من الجن يطلبه بشعلة من نار كلما التفت رسول الله صلى الله عليه وسلم رآه فقال له جبريل أفلا أعلمك كلمات تقولهن إذا قلتهن طفئت شعلته وخر لفيه فقال رسول الله صلى الله عليه وسلم ‏ \"‏ بلى ‏\"‏ فقال جبريل فقل أعوذ بوجه الله الكريم وبكلمات الله التامات اللاتي لا يجاوزهن بر ولا فاجر من شر ما ينزل من السماء وشر ما يعرج فيها وشر ما ذرأ في الأرض وشر ما يخرج منها ومن فتن الليل والنهار ومن طوارق الليل والنهار إلا طارقا يطرق بخير يا رحمن ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Hasan Lighairihi"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1739
			}
		},
		{
			"hadithnumber": 1740,
			"arabicnumber": 1740,
			"text": "وحدثني مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رجلا، من أسلم قال ما نمت هذه الليلة ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ من أى شىء ‏\"‏ ‏.‏ فقال لدغتني عقرب ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنك لو قلت حين أمسيت أعوذ بكلمات الله التامات من شر ما خلق ‏.‏ لم تضرك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1740
			}
		},
		{
			"hadithnumber": 1741,
			"arabicnumber": 1741,
			"text": "وحدثني عن مالك، عن سمى، مولى أبي بكر عن القعقاع بن حكيم، أن كعب الأحبار، قال لولا كلمات أقولهن لجعلتني يهود حمارا ‏.‏ فقيل له وما هن فقال أعوذ بوجه الله العظيم الذي ليس شىء أعظم منه وبكلمات الله التامات التي لا يجاوزهن بر ولا فاجر وبأسماء الله الحسنى كلها ما علمت منها وما لم أعلم من شر ما خلق وبرأ وذرأ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1741
			}
		},
		{
			"hadithnumber": 1742,
			"arabicnumber": 1742,
			"text": "وحدثني عن مالك، عن عبد الله بن عبد الرحمن بن معمر، عن أبي الحباب، سعيد بن يسار عن أبي هريرة، أنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن الله تبارك وتعالى يقول يوم القيامة أين المتحابون لجلالي اليوم أظلهم في ظلي يوم لا ظل إلا ظلي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1742
			}
		},
		{
			"hadithnumber": 1743,
			"arabicnumber": 1743,
			"text": "وحدثني عن مالك، عن خبيب بن عبد الرحمن الأنصاري، عن حفص بن عاصم، عن أبي سعيد الخدري، أو عن أبي هريرة، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سبعة يظلهم الله في ظله يوم لا ظل إلا ظله إمام عادل وشاب نشأ في عبادة الله",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1743
			}
		},
		{
			"hadithnumber": 1744,
			"arabicnumber": 1744,
			"text": "وحدثني عن مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا أحب الله العبد قال لجبريل قد أحببت فلانا فأحبه ‏.‏ فيحبه جبريل ثم ينادي في أهل السماء إن الله قد أحب فلانا فأحبوه ‏.‏ فيحبه أهل السماء ثم يوضع له القبول في الأرض ‏.‏ وإذا أبغض الله العبد ‏\"‏ ‏.‏ قال مالك لا أحسبه إلا أنه قال في البغض مثل ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1744
			}
		},
		{
			"hadithnumber": 1745,
			"arabicnumber": 1745,
			"text": "وحدثني عن مالك، عن أبي حازم بن دينار، عن أبي إدريس الخولاني، أنه قال دخلت مسجد دمشق فإذا فتى شاب براق الثنايا وإذا الناس معه إذا اختلفوا في شىء أسندوا إليه وصدروا عن قوله فسألت عنه فقيل هذا معاذ بن جبل ‏.‏ فلما كان الغد هجرت فوجدته قد سبقني بالتهجير ووجدته يصلي - قال - فانتظرته حتى قضى صلاته ثم جئته من قبل وجهه فسلمت عليه ثم قلت والله إني لأحبك لله ‏.‏ فقال آلله فقلت آلله ‏.‏ فقال آلله فقلت آلله ‏.‏ فقال آلله فقلت آلله ‏.‏ قال فأخذ بحبوة ردائي فجبذني إليه وقال أبشر فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ قال الله تبارك وتعالى وجبت محبتي للمتحابين في والمتجالسين في والمتزاورين في والمتباذلين في ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1745
			}
		},
		{
			"hadithnumber": 1746,
			"arabicnumber": 1746,
			"text": "وحدثني عن مالك، أنه بلغه عن عبد الله بن عباس، أنه كان يقول القصد والتؤدة وحسن السمت جزء من خمسة وعشرين جزءا من النبوة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 51,
				"hadith": 1746
			}
		}
	]
}