{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"53": "Greetings"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1756,
			"arabicnumber": 1756,
			"text": "حدثني عن مالك، عن زيد بن أسلم، أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ يسلم الراكب على الماشي وإذا سلم من القوم واحد أجزأ عنهم ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1756
			}
		},
		{
			"hadithnumber": 1757,
			"arabicnumber": 1757,
			"text": "وحدثني عن مالك، عن وهب بن كيسان، عن محمد بن عمرو بن عطاء، أنه قال كنت جالسا عند عبد الله بن عباس فدخل عليه رجل من أهل اليمن فقال السلام عليكم ورحمة الله وبركاته ‏.‏ ثم زاد شيئا مع ذلك أيضا ‏.‏ قال ابن عباس وهو يومئذ قد ذهب بصره من هذا قالوا هذا اليماني الذي يغشاك ‏.‏ فعرفوه إياه ‏.‏ قال فقال ابن عباس إن السلام انتهى إلى البركة ‏.‏ قال يحيى سئل مالك هل يسلم على المرأة فقال أما المتجالة فلا أكره ذلك وأما الشابة فلا أحب ذلك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1757
			}
		},
		{
			"hadithnumber": 1758,
			"arabicnumber": 1758,
			"text": "حدثني عن مالك، عن عبد الله بن دينار، عن عبد الله بن عمر، أنه قال قال رسول الله صلى الله عليه وسلم ‏ \"‏ إن اليهود إذا سلم عليكم أحدهم فإنما يقول السام عليكم ‏.‏ فقل عليك ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1758
			}
		},
		{
			"hadithnumber": 1759,
			"arabicnumber": 1759,
			"text": "حدثني عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أبي مرة، مولى عقيل بن أبي طالب عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه إذ أقبل نفر ثلاثة فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد فلما وقفا على مجلس رسول الله صلى الله عليه وسلم سلما فأما أحدهما فرأى فرجة في الحلقة فجلس فيها وأما الآخر فجلس خلفهم وأما الثالث فأدبر ذاهبا فلما فرغ رسول الله صلى الله عليه وسلم قال ‏ \"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله فآواه الله وأما الآخر فاستحيا فاستحيا الله منه وأما الآخر فأعرض فأعرض الله عنه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1759
			}
		},
		{
			"hadithnumber": 1760,
			"arabicnumber": 1760,
			"text": "وحدثني عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه سمع عمر بن الخطاب، وسلم، عليه رجل فرد عليه السلام ثم سأل عمر الرجل كيف أنت فقال أحمد إليك الله ‏.‏ فقال عمر ذلك الذي أردت منك ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1760
			}
		},
		{
			"hadithnumber": 1761,
			"arabicnumber": 1761,
			"text": "وحدثني عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن الطفيل بن أبى بن كعب، أخبره أنه، كان يأتي عبد الله بن عمر فيغدو معه إلى السوق قال فإذا غدونا إلى السوق لم يمر عبد الله بن عمر على سقاط ولا صاحب بيعة ولا مسكين ولا أحد إلا سلم عليه - قال الطفيل - فجئت عبد الله بن عمر يوما فاستتبعني إلى السوق فقلت له وما تصنع في السوق وأنت لا تقف على البيع ولا تسأل عن السلع ولا تسوم بها ولا تجلس في مجالس السوق قال وأقول اجلس بنا ها هنا نتحدث ‏.‏ قال فقال لي عبد الله بن عمر يا أبا بطن - وكان الطفيل ذا بطن - إنما نغدو من أجل السلام نسلم",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1761
			}
		},
		{
			"hadithnumber": 1762,
			"arabicnumber": 1762,
			"text": "",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 53,
				"hadith": 1762
			}
		}
	]
}