{
	"metadata": {
		"name": "Muwatta Malik",
		"section": {
			"7": "Tahajjud"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 254,
			"arabicnumber": 254,
			"text": "حدثني يحيى، عن مالك، عن محمد بن المنكدر، عن سعيد بن جبير، عن رجل، عنده رضا أنه أخبره أن عائشة زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ ما من امرئ تكون له صلاة بليل يغلبه عليها نوم إلا كتب الله له أجر صلاته وكان نومه عليه صدقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 254
			}
		},
		{
			"hadithnumber": 255,
			"arabicnumber": 255,
			"text": "وحدثني عن مالك، عن أبي النضر، مولى عمر بن عبيد الله عن أبي سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كنت أنام بين يدى رسول الله صلى الله عليه وسلم ورجلاى في قبلته فإذا سجد غمزني فقبضت رجلى فإذا قام بسطتهما ‏.‏ قالت والبيوت يومئذ ليس فيها مصابيح ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 255
			}
		},
		{
			"hadithnumber": 256,
			"arabicnumber": 256,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال ‏ \"‏ إذا نعس أحدكم في صلاته فليرقد حتى يذهب عنه النوم فإن أحدكم إذا صلى وهو ناعس لا يدري لعله يذهب يستغفر فيسب نفسه ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 256
			}
		},
		{
			"hadithnumber": 257,
			"arabicnumber": 257,
			"text": "وحدثني عن مالك، عن إسماعيل بن أبي حكيم، أنه بلغه أن رسول الله صلى الله عليه وسلم سمع امرأة من الليل تصلي فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ فقيل له هذه الحولاء بنت تويت لا تنام الليل ‏.‏ فكره ذلك رسول الله صلى الله عليه وسلم حتى عرفت الكراهية في وجهه ثم قال ‏\"‏ إن الله تبارك وتعالى لا يمل حتى تملوا اكلفوا من العمل ما لكم به طاقة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 257
			}
		},
		{
			"hadithnumber": 258,
			"arabicnumber": 258,
			"text": "وحدثني عن مالك، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب، كان يصلي من الليل ما شاء الله حتى إذا كان من آخر الليل أيقظ أهله للصلاة يقول لهم الصلاة الصلاة ثم يتلو هذه الآية ‏{‏وأمر أهلك بالصلاة واصطبر عليها لا نسألك رزقا نحن نرزقك والعاقبة للتقوى‏}‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 258
			}
		},
		{
			"hadithnumber": 259,
			"arabicnumber": 259,
			"text": "وحدثني عن مالك، أنه بلغه أن سعيد بن المسيب، كان يقول يكره النوم قبل العشاء والحديث بعدها ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 259
			}
		},
		{
			"hadithnumber": 260,
			"arabicnumber": 260,
			"text": "وحدثني عن مالك، أنه بلغه أن عبد الله بن عمر، كان يقول صلاة الليل والنهار مثنى مثنى يسلم من كل ركعتين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 260
			}
		},
		{
			"hadithnumber": 261,
			"arabicnumber": 261,
			"text": "حدثني يحيى، عن مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم ‏.‏ أن رسول الله صلى الله عليه وسلم كان يصلي من الليل إحدى عشرة ركعة يوتر منها بواحدة فإذا فرغ اضطجع على شقه الأيمن ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 261
			}
		},
		{
			"hadithnumber": 262,
			"arabicnumber": 262,
			"text": "وحدثني عن مالك، عن سعيد بن أبي سعيد المقبري، عن أبي سلمة بن عبد الرحمن بن عوف، أنه سأل عائشة زوج النبي صلى الله عليه وسلم كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان فقالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا في غيره على إحدى عشرة ركعة يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي ثلاثا فقالت عائشة فقلت يا رسول الله أتنام قبل أن توتر فقال ‏ \"‏ يا عائشة إن عينى تنامان ولا ينام قلبي ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 262
			}
		},
		{
			"hadithnumber": 263,
			"arabicnumber": 263,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين، قالت كان رسول الله صلى الله عليه وسلم يصلي بالليل ثلاث عشرة ركعة ثم يصلي إذا سمع النداء بالصبح ركعتين خفيفتين ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 263
			}
		},
		{
			"hadithnumber": 264,
			"arabicnumber": 264,
			"text": "وحدثني عن مالك، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس أن عبد الله بن عباس، أخبره أنه، بات ليلة عند ميمونة زوج النبي صلى الله عليه وسلم - وهي خالته - قال فاضطجعت في عرض الوسادة واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها فنام رسول الله صلى الله عليه وسلم حتى إذا انتصف الليل - أو قبله بقليل أو بعده بقليل - استيقظ رسول الله صلى الله عليه وسلم فجلس يمسح النوم عن وجهه بيده ثم قرأ العشر الآيات الخواتم من سورة آل عمران ثم قام إلى شن معلق فتوضأ منه فأحسن وضوءه ثم قام يصلي - قال ابن عباس - فقمت فصنعت مثل ما صنع ثم ذهبت فقمت إلى جنبه فوضع رسول الله صلى الله عليه وسلم يده اليمنى على رأسي وأخذ بأذني اليمنى يفتلها فصلى ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم ركعتين ثم أوتر ثم اضطجع حتى أتاه المؤذن فصلى ركعتين خفيفتين ثم خرج فصلى الصبح ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 264
			}
		},
		{
			"hadithnumber": 265,
			"arabicnumber": 265,
			"text": "وحدثني عن مالك، عن عبد الله بن أبي بكر، عن أبيه، أن عبد الله بن قيس بن مخرمة، أخبره عن زيد بن خالد الجهني، أنه قال لأرمقن الليلة صلاة رسول الله صلى الله عليه وسلم - قال - فتوسدت عتبته - أو فسطاطه - فقام رسول الله صلى الله عليه وسلم فصلى ركعتين طويلتين طويلتين طويلتين ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم أوتر فتلك ثلاث عشرة ركعة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 265
			}
		},
		{
			"hadithnumber": 266,
			"arabicnumber": 266,
			"text": "حدثني يحيى، عن مالك، عن نافع، وعبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏ \"‏ صلاة الليل مثنى مثنى فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 266
			}
		},
		{
			"hadithnumber": 267,
			"arabicnumber": 267,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن ابن محيريز، أن رجلا، من بني كنانة يدعى المخدجي سمع رجلا، بالشام يكنى أبا محمد يقول إن الوتر واجب ‏.‏ فقال المخدجي فرحت إلى عبادة بن الصامت فاعترضت له وهو رائح إلى المسجد فأخبرته بالذي قال أبو محمد فقال عبادة كذب أبو محمد سمعت رسول الله صلى الله عليه وسلم يقول ‏ \"‏ خمس صلوات كتبهن الله عز وجل على العباد فمن جاء بهن لم يضيع منهن شيئا استخفافا بحقهن كان له عند الله عهد أن يدخله الجنة ومن لم يأت بهن فليس له عند الله عهد إن شاء عذبه وإن شاء أدخله الجنة ‏\"‏ ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 267
			}
		},
		{
			"hadithnumber": 268,
			"arabicnumber": 268,
			"text": "وحدثني عن مالك، عن أبي بكر بن عمر، عن سعيد بن يسار، قال كنت أسير مع عبد الله بن عمر بطريق مكة - قال سعيد - فلما خشيت الصبح نزلت فأوترت ثم أدركته فقال لي عبد الله بن عمر أين كنت فقلت له خشيت الصبح فنزلت فأوترت ‏.‏ فقال عبد الله أليس لك في رسول الله أسوة ‏.‏ فقلت بلى والله ‏.‏ فقال إن رسول الله صلى الله عليه وسلم كان يوتر على البعير ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 268
			}
		},
		{
			"hadithnumber": 269,
			"arabicnumber": 269,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، عن سعيد بن المسيب، أنه قال كان أبو بكر الصديق إذا أراد أن يأتي، فراشه أوتر وكان عمر بن الخطاب يوتر آخر الليل قال سعيد بن المسيب فأما أنا فإذا جئت فراشي أوترت ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 269
			}
		},
		{
			"hadithnumber": 270,
			"arabicnumber": 270,
			"text": "وحدثني عن مالك، أنه بلغه أن رجلا، سأل عبد الله بن عمر عن الوتر أواجب هو فقال عبد الله بن عمر قد أوتر رسول الله صلى الله عليه وسلم وأوتر المسلمون ‏.‏ فجعل الرجل يردد عليه وعبد الله بن عمر يقول أوتر رسول الله صلى الله عليه وسلم وأوتر المسلمون ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 270
			}
		},
		{
			"hadithnumber": 271,
			"arabicnumber": 271,
			"text": "وحدثني عن مالك، أنه بلغه أن عائشة، زوج النبي صلى الله عليه وسلم كانت تقول من خشي أن ينام حتى يصبح فليوتر قبل أن ينام ومن رجا أن يستيقظ آخر الليل فليؤخر وتره ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 271
			}
		},
		{
			"hadithnumber": 272,
			"arabicnumber": 272,
			"text": "وحدثني عن مالك، عن نافع، أنه قال كنت مع عبد الله بن عمر بمكة والسماء مغيمة فخشي عبد الله الصبح فأوتر بواحدة ثم انكشف الغيم فرأى أن عليه ليلا فشفع بواحدة ثم صلى بعد ذلك ركعتين ركعتين فلما خشي الصبح أوتر بواحدة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 272
			}
		},
		{
			"hadithnumber": 273,
			"arabicnumber": 273,
			"text": "وحدثني عن مالك، عن نافع، أن عبد الله بن عمر، كان يسلم بين الركعتين والركعة في الوتر حتى يأمر ببعض حاجته ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 273
			}
		},
		{
			"hadithnumber": 274,
			"arabicnumber": 274,
			"text": "وحدثني عن مالك، عن ابن شهاب، أن سعد بن أبي وقاص، كان يوتر بعد العتمة بواحدة ‏.‏ قال مالك وليس على هذا العمل عندنا ولكن أدنى الوتر ثلاث ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 274
			}
		},
		{
			"hadithnumber": 275,
			"arabicnumber": 275,
			"text": "وحدثني عن مالك، عن عبد الله بن دينار، أن عبد الله بن عمر، كان يقول صلاةالمغرب وتر صلاة النهار ‏.‏ قال مالك من أوتر أول الليل ثم نام ثم قام فبدا له أن يصلي فليصل مثنى مثنى فهو أحب ما سمعت إلى ‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 275
			}
		},
		{
			"hadithnumber": 276,
			"arabicnumber": 276,
			"text": "حدثني يحيى، عن مالك، عن عبد الكريم بن أبي المخارق البصري، عن سعيد بن جبير، أن عبد الله بن عباس، رقد ثم استيقظ فقال لخادمه انظر ما صنع الناس ‏.‏ وهو يومئذ قد ذهب بصره ‏.‏ فذهب الخادم ثم رجع فقال قد انصرف الناس من الصبح ‏.‏ فقام عبد الله بن عباس فأوتر ثم صلى الصبح ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 276
			}
		},
		{
			"hadithnumber": 277,
			"arabicnumber": 277,
			"text": "وحدثني عن مالك، أنه بلغه أن عبد الله بن عباس، وعبادة بن الصامت، والقاسم بن محمد، وعبد الله بن عامر بن ربيعة، قد أوتروا بعد الفجر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 277
			}
		},
		{
			"hadithnumber": 278,
			"arabicnumber": 278,
			"text": "وحدثني عن مالك، عن هشام بن عروة، عن أبيه، أن عبد الله بن مسعود، قال ما أبالي لو أقيمت صلاة الصبح وأنا أوتر، ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 278
			}
		},
		{
			"hadithnumber": 279,
			"arabicnumber": 279,
			"text": "وحدثني عن مالك، عن يحيى بن سعيد، أنه قال كان عبادة بن الصامت يؤم قوما فخرج يوما إلى الصبح فأقام المؤذن صلاة الصبح فأسكته عبادة حتى أوتر ثم صلى بهم الصبح ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Daif"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 279
			}
		},
		{
			"hadithnumber": 280,
			"arabicnumber": 280,
			"text": "وحدثني عن مالك، عن عبد الرحمن بن القاسم، أنه قال سمعت عبد الله بن عامر بن ربيعة، يقول إني لأوتر وأنا أسمع الإقامة، أو بعد الفجر ‏.‏ يشك عبد الرحمن أى ذلك قال ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 280
			}
		},
		{
			"hadithnumber": 281,
			"arabicnumber": 281,
			"text": "وحدثني مالك، عن عبد الرحمن بن القاسم، أنه سمع أباه القاسم بن محمد، يقول إني لأوتر بعد الفجر ‏.‏ قال مالك وإنما يوتر بعد الفجر من نام عن الوتر ولا ينبغي لأحد أن يتعمد ذلك حتى يضع وتره بعد الفجر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 281
			}
		},
		{
			"hadithnumber": 282,
			"arabicnumber": 282,
			"text": "حدثني يحيى، عن مالك، عن نافع، عن عبد الله بن عمر، أن حفصة، زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن عن الأذان لصلاة الصبح صلى ركعتين خفيفتين قبل أن تقام الصلاة ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 282
			}
		},
		{
			"hadithnumber": 283,
			"arabicnumber": 283,
			"text": "وحدثني مالك، عن يحيى بن سعيد، أن عائشة، زوج النبي صلى الله عليه وسلم قالت إن كان رسول الله صلى الله عليه وسلم ليخفف ركعتى الفجر حتى إني لأقول أقرأ بأم القرآن أم لا",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 283
			}
		},
		{
			"hadithnumber": 284,
			"arabicnumber": 284,
			"text": "وحدثني عن مالك، عن شريك بن عبد الله بن أبي نمر، عن أبي سلمة بن عبد الرحمن، أنه قال سمع قوم الإقامة، فقاموا يصلون فخرج عليهم رسول الله صلى الله عليه وسلم فقال ‏ \"‏ أصلاتان معا أصلاتان معا ‏\"‏ ‏.‏ وذلك في صلاة الصبح في الركعتين اللتين قبل الصبح ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Sahih Lighairihi"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 284
			}
		},
		{
			"hadithnumber": 285,
			"arabicnumber": 285,
			"text": "وحدثني عن مالك، أنه بلغه أن عبد الله بن عمر، فاتته ركعتا الفجر فقضاهما بعد أن طلعت الشمس ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Mauquf Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 285
			}
		},
		{
			"hadithnumber": 286,
			"arabicnumber": 286,
			"text": "وحدثني عن مالك، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، أنه صنع مثل الذي صنع ابن عمر ‏.‏",
			"grades": [
				{
					"name": "Salim al-Hilali",
					"grade": "Maqtu Sahih"
				}
			],
			"reference": {
				"book": 7,
				"hadith": 286
			}
		}
	]
}