{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1051,
			"arabicnumber": 1051,
			"text": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Isa] telah menceritakan kepada kami [Abdurrahman bin Yazid bin Jabir] dia berkata; telah menceritakan kepadaku ['Atha` Al Khurasani] dari [bekas budak isterinya Ummu Ustman] dia berkata; aku mendengar [Ali radliallahu 'anhu] berkata ketika di atas mimbar di Kufah: \"Apabila datang hari jum'at, maka setan akan berpagi-pagi dengan membawa benderanya menuju pasar-pasar sambil menaburkan rintangan atau penghalang-penghalang sehingga mereka mengakhirkan shalat jum'at, sementara para Malaikat berpagi-pagi dan duduk di pintu-pintu masjid mencacat manusia berdasarkan tingkatan mereka yang lebih awal dan orang yang berikutnya sampai Imam keluar, maka apabila seseorang duduk diam untuk mendengar dan memperhatikan serta tidak lalai, maka baginya dua bagian pahala, dan barangsiapa yang menjauh (dari imam), tidak mendengar dan diam serta tidak lalai maka baginya satu bagian dari pahala, dan barangsiapa duduk mendekat (kepada imam) kemudian duduk untuk mendengarkan dan memperhatikan, namun dirinya lalai dan tidak biasa diam, maka baginya satu bagian dari dosa, dan barangsiapa berkata kepada temannya \"diamlah\" pada waktu (khutbah) jum'at, maka ia telah lalai (bebuat sia-sia), dan barangsiapa lalai, maka ia tidak mendapatkan bagian dari Jum'atnya.\" Di akhir dari hadits tersebut, Ali berkata; \"saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda seperti itu.\" Abu Daud mengatakan; \"di riwayatkan pula oleh [Al Walid bin Muslim] dari [Ibnu Jabir] dia berkata dengan redaksi lafadz \"bir rabaa`is (rintangan).\" Dan berkata pula bekas budak istrinya yaitu Ummu Utsman bin 'Atha` seperti itu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 662
			}
		}
	]
}