{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"3": "The Book Of The Prayer For Rain (Kitab al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1173,
			"arabicnumber": 1173,
			"text": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Khalid bin Nizar] telah menceritakan kepadaku [Al Qasim bin Mabrur] dari [Yunus] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] dia berkata; \"Orang-orang mengadu kepada Rasulullah shallallahu 'alaihi wasallam tentang musim kemarau yang panjang, maka beliau memerintahkan untuk meletakkan mimbar di tempat shalat (tanah lapang), lalu beliau berjanji kepada orang-orang untuk bertemu pada suatu hari yang telah di tentukan.\" Aisyah berkata; \"Maka Rasulullah shallallahu 'alaihi wasallam keluar ketika matahari mulai terlihat, lalu beliau duduk di mimbar, beliau shallallahu 'alaihi wasallam bertakbir dan memuji Allah Azza Wa Jalla, lalu bersabda: \"Sesungguhnya kalian mengadu kepadaku tentang kegersangan negeri kalian dan keterlambatan turunnya hujan dari musimnya, padahal Allah Azza Wa Jalla telah memerintahkan kalian agar kalian memohon kepadanya, dan berjanji akan mengabulkan do'a kalian, kemudian beliau mengucapkan: \"Segala puji bagi Allah, Rabb semesta alam, Maha Pemurah lagi Maha Penyayang. Dzat yang menguasai hari Pembalasan. (AlFatihah: 2-4). Tidak ada ilah yang berhak disembah kecuali Dia, Dia melakukan apa saja yang dikehendaki. Ya Allah, Engkau adalah Allah, tidak ada tuhan ilah yang berhak disembah kecuali Engkau, Maha kaya sementara kami yang membutuhkan, maka turunkanlah hujan kepada kami dan jadikanlah apa yang telah Engkau turunkan kekuatan bagi kami dan sebagai bekal di hari yang di tetapkan.\" kemudian beliau mengangkat kedua tangannya, dan senantiasa mengangkat kedua tangannya hingga terlihat putih ketiak beliau, kemudian beliau membalikkan punggungnya membelakangi orang-orang dan merubah posisi selendangnya, sedangkan beliau masih mengangkat kedua tangannya. Kemudian beliau menghadap ke orang-orang, lalu beliau turun dari mimbar dan shalat dua raka'at. Seketika itu Allah mendatangkan awan yang di sertai dengan gemuruh dan kilat, Maka turunlah hujan dengan izin Allah, beliau tidak kembali menuju masjid sampai air bah mengalir (di sekitarnya), ketika beliau melihat orang-orang berdesak-desakan mencari tempat berteduh, beliau tersenyum hingga terlihat gigi gerahamnya, lalu bersabda: \"Aku bersaksi bahwa Allah adalah Maha kuasa atas segala sesuatu dan aku adalah hamba dan rasul-Nya.\" Abu Daud berkata; \"Ini adalah hadits gharib, tapi sanadnya bagus, penduduk Madinah mambaca \"Malikiyaumid-din\" dan hadits ini juga menjadi argumentasi mereka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 13
			}
		}
	]
}