{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"3": "The Book Of The Prayer For Rain (Kitab al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1174,
			"arabicnumber": 1174,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik], dan [Yunus bin 'Ubaid] dari [Tsabit] dari [Anas] dia berkata; \"Penduduk Madinah pernah di timpa bencana kekeringan pada masa Rasulullah shallallahu 'alaihi wasallam, ketika beliau tengah menyampaikan khutbah Jum'at, tiba-tiba seorang laki-laki berdiri seraya berkata; \"Wahai Rasulullah, telah binasa kuda dan kambing, oleh karena itu, berdo'alah kepada Allah agar menurunkan hujan kepada kami.\" Lalu beliau merenggangkan kedua tangannya dan berdo'a.\" Anas berkata; \"Saat itu, langit sangat cerah laksana kaca, lalu angin bertiaup yang membawa awan yang menggumpal, setelah itu langit menurunkan hujan, lalu kami keluar mencebur ke air hujan, sehingga kami tiba di rumah kami, dan hujan senantiasa turun hingga jum'at berikutnya, maka laki-laki itu atau laki-laki lain berdiri sambil berkata; \"Wahai Rasulullah, rumah-rumah kami (hampir) roboh (karena hujan kebat), oleh karena itu, berdo'alah kepada Allah agar hujan di hentikan!.\" Maka Rasulullah shallallahu 'alaihi wasallam tersenyum kemudian bersabda: \"Turunkanlah hujan ini di sekeliling kami, dan jangan sampai ia membawa petaka bagi kami.\" Lalu aku melihat awan tersebut terputus-putus di sekitar Madinah, seolah-olah bagaikan Mahkota (maksudnya hujan turun menyebar di seluruh Madinah).\" Telah menceritakan kepada kami [Isa bin Hammad] telah mengabarkan kepada kami [Al Laits] dari [Sa'id Al Maqburi] dari [Syarik bin Abdullah bin Abu Namir] bahwa dia mendengar [Anas] berkata; …\" kemudian dia menyebutkan sebagaimana hadits Abdul Aziz katanya; \"Maka Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya sejajar dengan wajah beliau seraya mengucapkan: \"Ya Allah turunkanlah hujan kepada kami…\" kemudian dia melanjutkan hadits seperti di atas",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 14
			}
		}
	]
}