{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"3": "The Book Of The Prayer For Rain (Kitab al-Istisqa')"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1180,
			"arabicnumber": 1180,
			"text": "Telah menceritakan kepada kami [Ibnu As Sarh] telah mengabarkan kepada kami [Ibnu Wahb]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah istri Nabi shallallahu 'alaihi wasallam] dia berkata; \"Pernah terjadi gerhana matahari ketika Rasulullah shallallahu 'alaihi wasallam masih hidup, maka Rasulullah shallallahu 'alaihi wasallam keluar menuju masjid, kemudian beliau berdiri dan bertakbir, dan orang-orang juga ikut berbaris di belakang beliau, kemudian Rasulullah shallallahu 'alaihi wasallam memanjangkan bacaannya, lalu beliau bertakbir, kemudian ruku' hingga lama, setelah itu beliau mengangkat kepala (i'tidal) sambil membaca; 'samiallahu liman hamidah, rabbanaa walakal hamdu. ' Kemudian beliau berdiri dan memanjangkan bacaannya (Al Fatihah dan surat Al Qur'an), namun agak pendek dari bacaan yang pertama. Kemudian beliau bertakbir dan ruku' hingga lama, namun ia lebih pendek daripada ruku' yang pertama, lalu beliau mengucapkan 'sami'allahu liman hamidah, rabbanaa walakal hamdu', kemudian ia mengerjakan seperti itu pada raka'at kedua, maka sempurnalah empat kali ruku' dan empat kali sujud. Dan ternyata matahari telah terang kembali sebelum beliau beranjak pergi.\" Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah] telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab] dia berkata; [Katsir bin 'Abbas] pernah bercerita bahwa [Abdullah bin 'Abbas] pernah bercerita bahwa Rasulullah shallallahu 'alaihi wasallam shalat gerhana matahari…\" kemudian Perawi menyebutkan seperti hadits 'Urwah dari Aisyah dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau shalat dua raka'at, dan di setiap raka'at, beliau mengerjakan dua kali ruku",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		}
	]
}