{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"4": "Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1242,
			"arabicnumber": 1242,
			"text": "Abu Daud berkata; telah menceritakan kepada kami ['Ubaidullah bin Sa'd] katanya; telah menceritakan kepadaku [pamanku] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] telah menceritakan kepada kami [Muhammad bin Ja'far bin Az Zubair] bahwa ['Urwah bin Zubair] telah menceritakan kepadanya, bahwa [Aisyah] pernah menceritakan kepadanya dengan kisah seperti ini, kata Asiyah; 'Rasulullah shallallahu 'alaihi wasallam bertakbir, begitu juga dengan kelompok yang shalat bersama beliau ikut bertakbir, kemudian beliau ruku, mereka juga ruku', lalu beliau sujud, mereka juga ikut sujud, lalu beliau mengangkat kepala (duduk di antara dua sujud), lalu mereka ikut bangkit, namun Rasulullah shallallahu 'alaihi wasallam masih tetap duduk, sementara mereka mengerjakan sujud kedua sendiri-sendiri. Kemudian mereka berdiri dan berjalan mundur pelan-pelan sehingga berdiri di belakang mereka (kelompok kedua), dan kelompok kedua datang, lalu mereka berdiri di belakang Rasulullah shallallahu 'alaihi wasallam, mereka bertakbir dan ruku' sendiri-sendiri, setelah ruku', Rasulullah shallallahu 'alaihi wasallam sujud, maka mereka juga sujud bersama beliau. kemudian Rasulullah shallallahu 'alaihi wasallam berdiri, sedangkan mereka mengerjakan sujud kedua sendiri-sendiri, setelah itu kedua kelompok tersebut berdiri semua, mengerjakan shalat bersama dengan Rasulullah shallallahu 'alaihi wasallam. beliau ruku', lalu mereka juga ikut ruku', beliau sujud mereka juga sujud. Lalu beliau kembali duduk, terus sujud lagi yang kedua, maka mereka juga ikut sujud bersama beliau secepatnya dan sangat cepat tanpa mengurangi kesempurnaan (sujud), setelah itu Rasulullah shallallahu 'alaihi wasallam salam dan mereka juga ikut salam bersama beliau.\" Rasulullah shallallahu 'alaihi wasallam berdiri dalam semua shalat yang di sertai oleh semua jama'ah shalat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 45
			}
		}
	]
}