{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"4": "Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1245,
			"arabicnumber": 1245,
			"text": "Telah menceritakan kepada kami [Imran bin Maisarah] telah menceritakan kepada kami [Ibnu Fudlail] telah menceritakan kepada kami [Khushaif] dari [Abu 'Ubaidah] dari [Abdullah bin Mas'ud] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan shalat khauf bersama kami, lalu sekelompok mereka berbaris di belakang Rasulullah shallallahu 'alaihi wasallam, sedangkan kelompok yang lain berjaga-jaga menghadapi musuh, maka Rasulullah shallallahu 'alaihi wasallam shalat dengan kelompok pertama satu raka'at, kemudian kelompok kedua datang dan menempati tempat kelompok pertama, sedangkan kelompok pertama bergantian berjaga menghadapi musuh, lalu Nabi shallallahu 'alaihi wasallam shalat dengan kelompok kedua satu raka'at, kemudian beliau salam, sementara kelompok yang shalat bersama beliau berdiri dan menyempurnakan satu raka'at sendiri-sendiri, kemudian mereka salam. Setelah itu mereka kembali dan menempati posisi kelompok yang menghadapi musuh, sedangkan kelompok pertama kembali (ke shaf shalat), kemudian mereka (menyempurnakan) shalat satu raka'at (yang tersisa) sendiri-sendiri, kemudian mereka salam.\" Telah menceritakan kepada kami [Tamim bin Al Muntashir] telah mengabarkan kepada kami [Ishaq yaitu Ibnu Yusuf] dari [Syarik] dari [Khushaif] dengan sanad dan maksud yang sama, katanya; \"Kemudian Nabi shallallahu 'alaihi wasallam bertakbir, dan kedua kelompok juga ikut bertakbir bersama beliau.\" Abu Daud mengatakan; \"Di riwayatkan pula oleh [Ats Tsauri] dengan makna seperti ini, dari [Khushaif], dan Abdurrahman bin Samurah juga mengerjakan cara shalat seperti ini, kecuali kelompok yang shalat satu raka'at, kemudian salam, lalu mereka bergantian menempati tempat sahabatnya yang lain (kelompok kedua), kemudian mereka (kelompok kedua) datang lalu shalat sendiri-sendiri satu raka'at, kemudian mereka kembali ke tempat mereka dan menyempurnakan shalat satu raka'at sendiri-sendiri.\" Abu Daud berkata; telah menceritakan kepada kami hadits seperti itu Muslim bin Ibrahim telah menceritakan kepada kami Abdusshamad bin Habib dia berkata; telah mengabarkan kepadaku ayahku bahwa mereka pernah berperang bersama Abdurrahman bin Samurah di daerah Kabul, kemudian dia mengerjakan shalat khauf bersama kami",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 48
			}
		}
	]
}