{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1273,
			"arabicnumber": 1273,
			"text": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Bukair bin Al Asyaj] dari [Kuraib] bekas budak Ibnu Abbas, bahwa Abdullah bin Abbas dan Abdurrahman bin Azhar serta Al Miswar bin Al Mahramah pernah mengutusnya untuk menemui Aisyah isteri Nabi shallallahu 'alaihi wasallam, mereka berkata; \"Sampaikanlah salam kami kepada Aisyah dan tanyakan kepadanya tentang shalat (sunnah) setelah Ashar, dan katakan pula kepadanya bahwa kami pernah di beritahukan bahwa anda pernah mengerjakan dua raka'at setelah Ashar padahal Rasulullah shallallahu 'alaihi wasallam telah melarangnya.\" Lalu aku pergi menemui Aisyah dan menyampaikan pesan mereka kepadanya, lalu Aisyah berkata; \"Tanyakanlah kepada Ummu Salamah!.\" Maka aku keluar dan kembali menemui mereka dan menyampaikan apa yang di katakan Aisyah. Mereka mengembalikanku untuk menemui Ummu Salamah dengan berpesan seperti yang di pesankan kepadaku ketika pergi ke rumah Aisyah. Maka [Ummu Salamah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang dua raka'at setelah Ashar, kemudian aku melihat beliau mengerjakan dua raka'at tersebut, ketika beliau melaksanakannya, yaitu beliau mengerjakan dulu shalat Ashar, lalu beliau masuk, sementara di rumahku ada beberapa wanita Anshar dari Bani Haram. Lalu beliau mengerjakan dua raka'at tersebut, setelah itu aku menyuruh seorang pelayan wanita untuk menemui beliau, kataku; \"Berdirilah di samping beliau dan tanyakan kepadanya; [Ummu Salamah] berkata; \"Wahai Rasulullah, aku pernah mendengar anda telah melarang dua raka'at ini, namun aku melihat justru anda melaksanakannya.\" Beliau memberi isyarat dengan tangannya, karena itu beliau mundur. Setelah selesai shalat, beliau bersabda: \"wahai putri Abu Umayyah, kamu tanyakan dua raka'at setelah Ashar? Sesungguhnya telah datang beberapa orang kepadaku dari kaum Abdul Qais, sementara mereka baru masuk Islam. Karena itu, mereka membuatku sibuk untuk mengerjakan dua raka'at setelah Dluhur, maka dua raka'at (Dluhur) adalah ini",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 24
			}
		}
	]
}