{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"5": "Prayer (Kitab Al-Salat): Voluntary Prayers"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1353,
			"arabicnumber": 1353,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dari [Habib bin Abu Tsabit]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Hushain] dari [Habib bin Abu Tsabit] dari [Muhammad bin Ali bin Abdullah bin 'Abbas] dari [ayahnya] dari [Ibnu Abbas] bahwa dia pernah tidur di samping Nabi shallallahu 'alaihi wasallam, maka dia melihat beliau bangun (malam) lalu bersiwak dan berwudlu', lalu beliau mengucapkan; \"Sesungguhnya dalam penciptaan langit dan bumi…\" hingga akhir ayat, setelah itu mengerjakan shalat dua raka'at, dalam dua raka'at tersebut, beliau panjangkan berdirinya, ruku'nya dan sujudnya. Selesai shalat beliau tidur hingga mendengkur. Beliau kerjakan hal itu hingga tiga kali, yaitu enam raka'at. setiap kali hendak shalat, beliau bersiwak lalu berwudlu dan membaca beberapa ayat. Kemudian beliau shalat witir tiga raka'at. Setelah itu Mu'adzin datang, lalu beliau keluar untuk mengerjakan shalat (subuh).\" Ibnu 'Isa mengatakan; \"…kemudian beliau mengerjakan witir, lalu datanglah Bilal untuk mengumandangkan adzan shalat ketika fajar telah terbit, kemudian beliau mengerjakan dua raka'at (sunnah) fajar. Setelah itu beliau keluar untuk mengerjakan shalat -lalu hadits keduanya sepakat pada kalimat- sambil mengucapkan: \"Allahummaj'al fii qalbii nuuran, waj'al fii lisaani nuuran, waj'al fii basharii nuuran, waj'al khalfii nuuran, wa amaami nuuran, waj'al min fauqii nuuran wa min tahtii nuuran, Allahumma wa a'dzim lii nuuran (Ya Allah, jadikanlah dalam hatiku cahaya, jadikanlah dalam lisanku cahaya, jadikanlah dalam pendengaranku cahaya, jadikanlah dalam penglihatanku cahaya, jadikanlah di belakangku cahaya, jadikanlah di depanku cahaya, jadikanlah di atasku cahaya, jadikanlah di bawahku cahaya. Ya Allah, agungkanlah untukku cahaya.\" Telah menceritakan kepada kami [Wahb bin Baqiyah] dari [Khalid] dari [Hushain] seperti hadits di atas, dia berkata; \"Wa a'dzim lii nuuran (dan agungkanlah untukku cahaya).\" Abu Daud berkata; \"Demikian pula yang di katakan [Abu Khalid Ad Dalalani] dari [Habib] dalam permasalahan ini, demikian pula dia berkata dalam hadits ini, [Salamah bin Kuhail] berkata; dari [Abu Risydin] dari [Ibnu Abbas]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 104
			}
		}
	]
}