{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"10": "The Book of Lost and Found Items"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1704,
			"arabicnumber": 1704,
			"text": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Isma'il bin Ja'far], dari [Rabi'ah bin Abu Abdurrahman], dari [Yazid] mantan budak Al Munba'its, dari [Zaid bin Khalid Al Juhani], bahwa seorang laki-laki bertanya kepada Rasulullah shallAllahu wa'alaihi wa sallam mengenai barang temuan, beliau berkata: \"Umumkan satu tahun, kemudian ketahuilah talinya dan kantongnya kemudian nafkahkan kepada dirimu. Apabila pemiliknya datang maka berikan kepadanya.\" Lalu orang tersebut berkata; wahai Rasulullah, bagaimana dengan kambing yang tersesat? Beliau bersabda: \"Ambillah kambing tersebut, sesungguhnya kambing tersebut adalah milikmu atau saudaramu atau milik serigala.\" Ia berkata; wahai Rasulullah, bagaiamana dengan unta yang tersesat? Kemudian Rasulullah shallAllahu wa'alaihi wa sallam marah hingga kedua pipinya atau wajahnya memerah. Beliau berkata: \"Apa urusanmu dengannya? Ia memiliki sepatu, dan kantong air minum hingga pemiliknya mendapatkannya.\" Telah menceritakan kepada Kami [Ibnu As Sarh], telah menceritakan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku [Malik] dengan sanad dan maknanya. Ibnu Wahb menambahkan; kantong air minum, unta tersebut minum air dan memakan pohon. Dan beliau tidak mengatakan: \"Ambillah kambing yang hilang.\" Dan beliau berkata mengenai barang temuan: \"Umumkan selama satu tahun, apabila pemiliknya telah datang maka berikan kepadanya, jika tidak maka urusanmu dengannya.\" Dan beliau tidak menyebutkan nafkahkan kepada dirimu. Abu Daud berkata; [Ats Tsauri] dan [Sulaiman bin Bilal] serta [Hammad bin Salamah] dari [Rabi'ah] seperti itu seperti itu, mereka tidak menyebutkan; \"ambillah barang temuan tersebut",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 4
			}
		}
	]
}