{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1770,
			"arabicnumber": 1770,
			"text": "Telah menceritakan kepada Kami [Muhammad bin Manshur], telah menceritakan kepada Kami [Ya'qub yaitu Ibnu Ibrahim], telah menceritakan kepada Kami [ayahku] dari [Ibnu Ishaq], ia berkata; telah menceritakan kepadaku [Khushaif bin Abdurrahman Al Jazari], dari [Sa'id bin Jubair], ia berkata; aku katakan kepada [Abdullah bin Abbas], wahai Ibnu Abbas, aku heran terhadap perselisihan para sahabat Rasulullah shallAllahu wa'alaihi wa sallam mengenai talbiyah Rasulullah shallAllahu wa'alaihi wa sallam ketika beliau mengharuskan untuk berhaji. Lalu ia berkata; sungguh aku adalah orang yang paling tahu mengenai hal tersebut. Sesungguhnya haji tersebut dilakukan Rasulullah shallAllahu wa'alaihi wa sallam satu kali. Kemudian dari sana mereka berselisih. Rasulullah shallAllahu wa'alaihi wa sallam keluar untuk berhaji, kemudian tatkala beliau telah melakukan shalat dua raka'at di masjidnya di Dzul Hulaifah, beliau mewajibkan haji di majelisnya. Kemudian beliau bertalbiyah untuk melakukan haji ketika telah selesai dari dua raka'at tersebut. Lalu orang-orang mendengar hal tersebut dan aku hafal hal tersebut dari beliau. Kemudian beliau menaiki kendaraannya, lalu ketika untanya telah berada di tempat yang tinggi beliau bertalbiyah, dan hal tersebut didapatkan oleh orang-orang darinya. Sesungguhnya mereka datang bergelombang, lalu mereka mendengar beliau ketika untanya berada di tempat yang tinggi. Mereka berkata; sesungguhnya Rasulullah shallAllahu wa'alaihi wa sallam bertalbiyah ketika untanya berada di tempat yang tinggi. Kemudian Rasulullah berlalu, tatkala beliau telah berada di puncak Al Baida`, demi Allah sungguh beliau telah mewajibkan hajinya di tempat beliau melakukan shalat. Dan beliau bertalbiyah ketika untanya berada di tempat yang tinggi, dan beliau bertalbiyah tatkala berada di puncak Al Baida`. Sa'id berkata; barang siapa yang mengambil ucapan Abdullah bin Abbas maka ia bertalbiyah di tempat ia melakukan shalat apabila telah menyelesaikan shalat dua raka'at",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 50
			}
		}
	]
}