{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1785,
			"arabicnumber": 1785,
			"text": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], Telah menceritakan kepada Kami [Al Laits] dari [Abu Az Zubair] dari [Jabir], ia berkata; Kami datang dalam keadaan bertalbiyah bersama Rasulullah shallAllahu wa'alaihi wa sallam untuk melakukan haji ifrad, sedangkan Aisyah datang dalam keadaan bertalbiyah untuk melakukan umrah hingga setelah ia sampai di Saraf, ia mengalami haid, hingga setalah Kami datang, Kami melakukan thawaf di Ka'bah dan di Shafa serta Marwa. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam memerintahkan Kami agar orang yang tidak membawa hewan kurban melakukan tahallul. Kemudian Kami katakan; tahallul apa? Beliau mengatakan; tahallul secara menyeluruh. Kemudian Kami bercampur dengan para isteri Kami dan memakai minyak wangi, serta memakai pakaian Kami dan antara Kami dan 'Arafah hanya berjarak empat malam. Kemudian Kami bertalbiyah pada hari Tarwiyah. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam menemui Aisyah dan mendapatinya dalam keadaan menangis. Lalu beliau berkata: \"Ada apa denganmu?\" Ia berkata; aku telah mengalami haid, orang-orang telah bertahallul, sementara aku belum bertahallul, dan belum melakukan thawaf di Ka'bah, serta orang-orang sedang pergi untuk melakukan haji sekarang. Kemudian beliau bersabda: \"Sesungguhnya hal ini adalah perkara yang telah Allah tetapkan atas anak-anak wanita Adam, maka mandilah, kemudian bertalbiyahlah untuk melakukan haji.\" Kemudian ia melakukannya dan berwukuf di tempat-tempat wukuf hingga setelah suci ia berthawaf di Ka'bah, serta Shafa dan Marwa. Kemudian beliau berkata: \"Engkau telah bertahallul dari haji dan umrahmu semua.\" Aisyah berkata; wahai Rasulullah, aku mendapati dalam perasaanku bahwa aku belum melakukan thawaf di Ka'bah ketika aku melakukan haji. Beliau bersabda: \"Wahai Abdurrahman, pergilah bersamanya dan umrahkanlah ia dari Tan'im.\" Dan hal tersebut terjadi pada malam hishbah (ketika singgah di Mihshab). Telah menceritakan kepada Kami [Ahmad bin Hanbal], ia berkata; telah menceritakan kepada Kami [Yahya bin Sa'id] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir] berkata; Nabi shallallahu 'alaihi wasallam menemui Aisyah …. -ia menceritakan sebagian kisah ini-, ia menyebutkan perkataan Rasulullah shallAllahu wa'alaihi wa sallam: \"dan bertalbiyahlah untuk melakukan haji, kemudian lakukan haji serta kerjakan apa yang dilakukan orang yang melakukan haji, hanya saja janganlah engkau melakukan thawaf di Ka'bah dan jangan melakukan shalat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 65
			}
		}
	]
}