{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"11": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1921,
			"arabicnumber": 1921,
			"text": "Telah menceritakan kepada Kami [Ahmad bin Abdullah bin Yunus], telah menceritakan kepada Kami [Zuhair]. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Sufyan] dan ini adalah lafazh hadits Zuhair, telah menceritakan kepada Kami [Ibrahim bin 'Uqbah], telah mengabarkan kepadaku [Kuraib] bahwa ia bertanya kepada [Usamah bin Zaid], aku katakan; beritahukan kepadaku apa yang kalian perbuat pada sore hari ketika engkau membonceng Rasulullah shallAllahu wa'alaihi wa sallam!? Ia berkata; Kami datang ke jalan bukit yang padanya orang-orang menderumkan untanya untuk singgah di Al Mu'arras (tempat singgah untuk tidur dan istirahat pada akhir malam). Lalu Rasulullah shallAllahu wa'alaihi wa sallam menderumkan untanya kemudian buang air kecil. -Zuhair tidak mengatakan; beliau menyiramkan air-. Kemudian beliau meminta tempat berwudhu lalu beliau berwudhu, tidak berlebihan sekali. Aku katakan; wahai rasul, Shalat! Beliau mengatakan: \"Shalat di depanmu.\" Usamah berkata; lalu beliau naik unta hingga Kami sampai ke Muzdalifah. Beliau melakukan shalat Maghrib kemudian orang-orang menderumkan unta di tempat-tempat persinggahan mereka, dan mereka tidak bertahallul, hingga beliau mendirikan shalat 'Isya` dan melakukan shalat, kemudian orang-orang bertahallul. - [Muhammad] dalam haditsnya menambahkan; [Kuraib] berkata; apa yang kalian lakukan ketika pagi hari? Ia berkata; Beliau memboncengkan Al Fadhl, sedangkan aku pergi bersama orang-orang Quraisy yang pergi cepat dengan berjalan kaki. Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Yahya bin Adam], telah menceritakan kepada Kami [Sufyan] dari [Abdurrahman bin 'Ayyasy] dari [Zaid bin Ali] dari [ayahnya] dari ['Ubaidullah bin Abu Rafi'] dari [Ali] ia berkata; kemudian beliau memboncengkan Usamah, dan beliau memperlambat jalan untanya sementara orang-orang memukul unta kanan dan kiri, dan beliau tidak menoleh kepada mereka dan berkata: \"Tenanglah wahai manusia.\" Dan beliau bertolak ketika matahari tenggelam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 11,
				"hadith": 201
			}
		}
	]
}