{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2159,
			"arabicnumber": 2159,
			"text": "Telah menceritakan kepada kami [An Nufaili], telah menceritakan kepada kami [Muhammad bin Salamah], dari [Muhammad bin Ishaq], telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Abu Marzuq] dari [Hanasy Ash Shan'ani], dari [Rufaifi' bin Tsabit Al Anshari], ia berkata ketika berkhutbah kepada kami; ketahuilah bahwa aku tidak berbicara kepada kalian kecuali apa yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam. Pada saat perang Hunain beliau berkata: \"Tidak halal bagi orang yang beriman kepada Allah dan Hari Akhir untuk menyiramkan airnya kepada tanaman orang lain -yaitu menggauli wanita-wanita yang sedang hamil\", dan tidak halal bagi seseorang yang beriman kepada Allah dan Hari Akhir untuk menggauli wanita tawanan hingga ia membiarkannya mengalami haid, dan tidaklah halal bagi seseorang yang beriman kepada Allah dan Hari Akhir untuk menjual harta rampasan perang hingga harta tersebut telah dibagikan.\" Telah menceritakan kepada kami [Sa'id bin Manshur], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Ibnu Ishaq], dengan hadits ini. Ia berkata; hingga membiarkannya mengalami satu kali haid. Ia menambahkan kata; satu kali haid. Hal tersebut merupakan suatu kesalahan dari Abu Mu'awiyah, dan hal itu adalah benar dalam hadits Abu Sa'id, ia tambahkan kata: \"Barangsiapa yang beriman kepada Allah dan Hari Akhir, maka janganlah ia mengendarai hewan yang berasal dari harta rampasan perang orang-orang muslim, dan ketika telah menjadi kurus dan lemah maka ia mengembalikannya kepada harta rampasan tersebut. Dan barangsiapa yang beriman kepada Allah dan Hari Akhir maka janganlah ia memakai pakaian yang berasal dari rampasan perang orang-orang muslim, dan ketika telah usang ia mengembalikannya ke dalam rampasan perang tersebut.\" Abu Daud berkata; kata satu kali haid bukanlah sesuatu yang dihafal, hal itu adalah kesalahan dari Abu Mu'awiyah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 114
			}
		}
	]
}