{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2165,
			"arabicnumber": 2165,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Tsabit Al Bunani], dari [Anas bin Malik] bahwa orang-orang Yahudi apabila seorang isteri mengalami haid maka mereka mengeluarkannya dari rumah, dan tidak makan bersamanya, tidak mengajaknya bermusyawarah, dan tidak menggaulinya di rumah. Kemudian Rasulullah shallallahu 'alaihi wasallam ditanya mengenai hal tersebut; kemudian Allah subhanahu wa ta'ala menurunkan ayat: \"Mereka bertanya kepadamu tentang haidh. Katakanlah: \"Haidh itu adalah suatu kotoran.\" Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haidh.\" Hingga akhir ayat. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bergaullah dengan mereka di rumah dan lakukan segala sesuatu selain bersenggama.\" Tidaklah orang ini ingin meninggalkan sesuatu yang berasal dari urusan kita melainkan untuk menyelisihi kita. Kemudian Usaid bin Hudhair serta 'Abbad bin Bisyr datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; Wahai Rasulullah, sesungguhnya orang-orang Yahudi mengatakan demikian dan demikian, tidakkah kita bercampur dengan mereka (para isteri) di saat sedang haid? Maka merah padam wajah Rasulullah shallallahu 'alaihi wasallam hingga kami menyangka beliau telah murka kepada mereka. Kemudian mereka berdua keluar, kemudian mereka berpapasan dengan hadiah susu yang diberikan kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau mengirim seseorang agar mengejar mereka berdua, hingga kami menyangka bahwa beliau tidak murka kepada mereka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 120
			}
		}
	]
}