{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2197,
			"arabicnumber": 2197,
			"text": "Telah menceritakan kepada kami [Humaid bin Mas'adah], telah menceritakan kepada kami [Isma'il], telah mengabarkan kepada kami [Ayyub] dari [Abdullah bin Katsir] dari [Mujahid] ia berkata; aku pernah berada di sisi [Ibnu Abbas], kemudian terdaapat seorang laki-laki yang datang kepadanya. Lalu ia berkata bahwa ia telah mencerai isterinya sebanyak tiga kali. Mujahid berkata; kemudian ia terdiam hingga aku menyangka bahwa ia akan mengembalikan wanita tersebut kepadanya. Kemudian ia berkata; salah seorang diantara kalian pergi lalu melakukan perbuatan orang yang bodoh. Kemudian mengatakan; wahai Ibnu Abbas, wahai Ibnu Abbas! Sesungguhnya Allah telah berfirman: \"Barangsiapa yang bertakwa kepada Allah, maka Dia memberikan baginya jalan keluar.\" Sementara engkau tidak bertakwa kepada Allah, maka aku tidak mendapatkan bagimu jalan keluar. Engkau telah bermaksiat kepada Tuhanmu dan isterimu telah terceraikan sama sekali. Dan sesungguhnya Allah telah berfirman: \"Wahai nabi, apabila kalian menceraikan isteri-isteri kalian maka ceraikanlah mereka pada waktu disambutnya masa 'Iddah mereka.\" Abu Daud berkata; hadits ini diriwayatkan oleh [Humaid Al A'raj] dan yang lainnya dari [Mujahid] dari [Ibnu Abbas] dan telah diriwayatkan oleh [Syu'bah] dari ['Amr bin Murrah] dari [Sa'id bin Jubair] dari [Ibnu Abbas], [Ayyub] dan [Ibnu Juraij], seluruhnya dari [Ikrimah bin Khalid] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dan [Ibnu Juraij] dari [Abdul Hamid bin Rafi'] dari ['Atho`] dari [Ibnu Abbas] dan telah diriwayatkan oleh [Al A'masy] dari [Malik bin Al Harits] dari [Ibnu Abbas] dan [Ibnu Juraij] dari ['Amr bin Dinar] dari [Ibnu Abbas], mereka semua mengatakan mengenai talak tiga kali bahwa ia telah memperbolehkannya. Ia berkata; dan ia telah tercerai sama sekali darimu seperti hadits Isma'il dari Ayyub dari Abdullah bin Katsir. Abu Daud berkata; dan [Hammad bin Zaid] telah meriwayatkan dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] apabila mengucapkan; engkau dicerai tiga kali, dengan satu kali ucapan maka hal tersebut adalah satu satu kali talak. Dan [Isma'il bin Ibrahim] telah meriwayatkan dari [Ayyub] dari [Ikrimah], ini adalah perkataannya, ia tidak menyebutkan Ibnu Abbas dan ia menjadikan perkataan tersebut sebagai perkataan Ikrimah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 23
			}
		}
	]
}