{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2213,
			"arabicnumber": 2213,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], dan [Muhammad bin Al 'Ala`] secara makna, mereka berkata; telah menceritakan kepada kami [Ibnu Idris] dari [Muhammad bin Ishaq] dari [Muhammad bin 'Amr bin 'Atho`]. Ibnu Al 'Ala` bin 'Alqamah bin 'Ayyasy berkata; dari [Sulaiman bin Yasar] dari [Salamah bin Shakhr], ia berkata; Ibnu Al 'Ala` Al Bayadhi berkata; saya dahulu adalah orang yang sering menggauli isteri tidak seperti orang selainku yang menggauli isterinya. Tatkala telah masuk Bulan Ramadhan, saya khawatir menggauli isteriku sehingga hal itu berlanjut hingga pagi hari. Maka aku menzhihar isteriku hingga Bulan Ramadhan berlalu. Ketika pada malam hari ia membantuku tiba-tiba tersingkap sedikit darinya, maka tidak lama kemudian saya menggaulinya. Kemudian tatkala pagi hari saya keluar menuju kepada kaumku dan mengabarkan hal tersebut kepada mereka, dan saya katakan; pergilah kalian bersamaku kepada Rasulullah shallallahu 'alaihi wasallam! Lalu mereka mengatakan; tidak, demi Allah kami tidak akan pergi bersamamu. Maka saya pergi kepada Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Kemudian beliau berkata: \"Wahai Salamah, apakah engkau melakukan hal ini?\" Saya katakan; saya melakukan hal ini -sebanyak dua kali-, dan saya bersabar terhadap terhadap keputusan Allah, maka putuskanlah terhadap diriku apa yang telah Allah perlihatkan kepada dirimu. Beliau bersabda: \"Bebaskan budak.\" Aku katakan; demi Dzat yang mengutusmu dengan kebenaran tidaklah saya memiliki budak selain dirinya. Beliau bersabda: \"Berpuasalah dua bulan berturut-turut!\" Lalu saya katakan; tidaklah saya tertimpa sesuatu yang menimpaku kecuali ketika saya berpuasa. Beliau bersabda: \"Berilah makan satu wasaq kurma enam puluh orang miskin.\" Lalu saya katakan; demi Dzat yang mengutusmu dengan kebenaran, sungguh kami bermalam dalam keadaan tidak memiliki makanan. Beliau berkata: \"Pergilah kepada penjaga Shadaqah Bani Zuraiq, hendaknya ia memberikannya kepadamu dan berilah makan enam puluh orang miskin satu wasaq kurma, dan makanlah sisanya bersama keluargamu.\" Kemudian saya kembali kepada kaumku dan berkata; aku dapatkan di sisi kalian kesempitan serta pendapat yang buruk, dan aku dapatkan di sisi Rasulullah shallallahu 'alaihi wasallam kelapangan dan pendapat yang baik, beliau telah memerintahkan agar aku diberi shadaqah kalian. [Ibnu Al 'Ala`] menambahkan; [Ibnu Idris] Bayadhah berkata; Marga dari Bani Zuraiq",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 39
			}
		}
	]
}