{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2245,
			"arabicnumber": 2245,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] bahwa [Sahl bin Sa'd As Sa'idi] telah mengabarkan kepadanya bahwa 'Uwaimir bin Asyqar Al 'Ajlani telah datang kepada 'Ashim bin 'Adi, ia berkata kepadanya; wahai 'Ashim, bagaimana pendapatmu apabila seorang laki-laki mendapati seorang laki-laki bersama dengan isterinya. Apakah boleh ia membunuhnya hingga orang-orang akan membunuhnya atau bagaimana ia berbuat? Tanyakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam wahai 'Ashim! Kemudian 'Ashim bertanya kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau tidak menyukai masalah-masalah tersebut, dan mencelanya, hingga terasa berat bagi 'Ashim apa yang ia dengar dari Rasulullah shallallahu 'alaihi wasallam. Kemudian tatkala 'Ashim kembali kepada keluarganya datanglah 'Uwaimir kepadanya dan berkata; wahai 'Ashim, apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam kepadamu? Kemudian 'Ashim berkata kepada 'Uwaimir; engkau tidak datang kepadaku dengan kebaikan, sungguh Rasulullah shallallahu 'alaihi wasallam tidak menyukai permasalahan yang aku tanyakan. Kemudian 'Uwaimir berkata; demi Allah, saya tidak akan berhenti hingga menanyakannya kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian 'Uwaimir datang kepada Rasulullah shallallahu 'alaihi wasallam yang sedang berada di tengah orang-orang. Kemudian ia berkata; wahai Rasulullah, bagaimana pendapat anda mengenai seorang laki-laki yang mendapati seorang laki-laki bersama dengan isterinya, apakah ia membunuhnya sehingga orang-orang membunuhnya atau bagaimana ia harus berbuat? Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh telah turun wahyu mengenaimu dan isterimu. Pergi dan bawalah dia.\" [Sahl] berkata; kemudian mereka berdua saling melaknat, dan saya bersama orang-orang yang lain berada di sisi Rasulullah shallallahu 'alaihi wasallam. Kemudian tatkala 'Uwaimir selesai, ia berkata; wahai Rasulullah, saya telah berdusta apabila saya menahannya. Kemudian ia menceraikan isterinya sebanyak tiga kali talak sebelum Rasulullah shallallahu 'alaihi wasallam memerintahkannya. Ibnu Syihab berkata; maka itulah sunah orang-orang yang saling melakukan laknat. Telah menceritakan kepada kami [Abdul 'Aziz bin Yahya], telah menceritakan kepadaku [Muhammad bin Salamah] dari [Muhammad bin Ishaq], telah menceritakan kepadaku [Abbas bin Sahl] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam berkata kepada 'Ashim bin Adi: \"Tahanlah wanita tersebut padamu hingga ia melahirkan!\" telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Sahl bin Sa'd As Sa'idi], ia berkata; aku menyaksikan li'an mereka berdua di sisi Nabi shallallahu 'alaihi wasallam sementara umurku lima belas tahun. Dan ia menyebutkan hadits tersebut, padanya ia mengatakan; kemudian ia keluar dalam keadaan hamil, dan anaknya dinisbatkan kepada ibunya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 71
			}
		}
	]
}