{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2251,
			"arabicnumber": 2251,
			"text": "Telah menceritakan kepada kami [Musaddad], [Wahb bin Bayan], dan [Ahmad bin 'Amr bin As Sarh], serta ['Amr bin Utsman], mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sahl bin Sa'd], ia berkata; Musaddad berkata; aku menyaksikan dua orang yang saling melaknat pada zaman Rasulullah shallallahu 'alaihi wasallam sementara aku adalah orang yang berumur lima belas. Kemudian Rasulullah shallallahu 'alaihi wasallam memisahkan diantara mereka berdua ketika mereka saling melaknat. Dan selesailah hadits Musaddad, sementara yang lain mengatakan; sesungguhnya ia menyaksikan Nabi shallallahu 'alaihi wasallam memisahkan antara kedua orang yang saling melaknat, kemudian orang laki-laki yang saling melakukan laknat berkata; saya berdusta terhadapnya wahai Rasulullah, apabila saya menahannya. Dan sebagian mereka tidak mengatakan; terhadapnya. Abu Daud berkata; tidak ada seorang pun yang menyetujui Ibnu 'Uyainah bahwa beliau memisahkan antara kedua orang yang saling melaknat. Telah menceritakan kepada kami [Sulaiman bin Daud Al 'Ataki], telah menceritakan kepada kami [Fulaih] dari [Az Zuhri] dari [Sahl bin Sa'd] dalam hadits ini; dan wanita tersebut telah hamil, kemudian suaminya mengingkari janin yang ia kandung, dan anak wanita tersebut dinisbatkan kepadanya. Kemudian berlakulah sunah dalam hal warisan, bahwa anak tersebut mewarisinya dan wanita tersebut mewarisi anak itu sesuai yang telah Allah 'azza wajalla tetapkan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 77
			}
		}
	]
}