{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2284,
			"arabicnumber": 2284,
			"text": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abdullah bin Yazid?] mantan budak Al Aswad bin Sufyan dari [Abu Salamah bin Abdurrahman] dari [Fathimah binti Qais] bahwa Abu 'Amr bin Hafsh telah mencerainya sama sekali, sementara Abu 'Amr tidak hadir. Lalu ia mengirimkan wakilnya kepadanya dengan membawa gandum. Maka Fathimah marah kepadanya, kemudian wakil tersebut berkata; demi Allah engkau tidak mempunyai hak sedikitpun atas kami. Kemudian Fathimah datang kepada Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepadanya. Kemudian beliau berkata kepadanya: \"Engkau tidak memiliki hak nafkah atasnya.\" Dan beliau memerintahkannya agar ber'iddah di rumah Ummu Syarik. Kemudian beliau berkata: \"Ia adalah seorang wanita yang sering dikunjungi sahabat-sahabatku. Ber'iddahlah di rumah Ibnu Ummi Maktum. Karena ia adalah orang yang buta. Engkau bisa meletakkan pakainmu dan apabila engkau telah halal maka beritahukan kepadaku!\" Fathimah berkata; kemudian tatkala aku telah halal, aku ceritakan kepada beliau bahwa Mu'awiyah bin Abu Sufyan dan Abu Jahm telah meminangku. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Adapun Abu Jahm, maka ia tidak meletakkan tongkatnya dari pundaknya, adapun Mu'awiyah, maka ia adalah orang yang miskin, tidak memiliki harta. Menikahlah dengan Usamah bin Zaid.\" Fathimah berkata; Lalu aku tidak menyukai hal tersebut, kemudian beliau berkata: \"Menikahlah dengan Usamah bin Zaid.\" Kemudian aku menikah dengannya dan Allah ta'ala menjadikan pada dirinya terdapat kebaikan yang sangat banyak. Dan aku merasa iri kepadanya. Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban bin Yazid? Al 'Aththar], telah menceritakan kepada kami [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] bahwa [Fathimah binti Qais] menceritakan kepadanya bahwa Abu Hafsh bin Al Mughirah telah menceraikannya tiga kali. Dan ia menyebutkan hadits mengenai hal tersebut. Dan Khalid bin Al Walid serta beberapa orang dari Bani Makhzum datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Nabi Allah, sesungguhnya Abu Hafsh bin Al Mughirah telah menceraian isterinya sebanyak tiga kali. dan ia meninggalkan untuknya sedikit nafkah. Kemudian beliau berkata: \"Ia tidak mendapatkan nafkah.\" Dan Abu Salamah menyebutkan hadits tersebut. Dan hadits Malik lebih sempurna. Telah menceritakan kepada kami [Mahmud bin Khalid], telah menceritakan kepada kami [Al Walid], telah menceritakan kepada kami [Abu 'Amr] dari [Yahya] telah menceritakan kepadaku [Abu Salamah], telah menceritakan kepadaku [Fathimah binti Qais] bahwa Abu 'Amr bin Hafsh Al Makhzumi telah mencerainya tiga kali. Dan ia menyebutkan hadits tersebut dan hadits Khalid bin Al Walid. Ia berkata; kemudian Nabi shallallahu 'alaihi wasallam berkata; ia tidak mendapatkan nafkah, dan tempat tinggal. Kemudian Nabi shallallahu 'alaihi wasallam mengirimkan utusan mengatakan; janganlah engkau mendahuluiku mengenai dirimu! Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Isma'il bin Ja'far] dari [Muhammad bin 'Amr] dari [Abu Salamah] dari [Fathimah binti Qais], ia berkata; aku pernah menjadi isteri seorang laki-laki dari Bani Makhzum. Kemudian ia menceraiku sama sekali (untuk selamanya) …. Kemudian ia menyebutkan hadits seperti hadits Malik. Ia berkata padanya; janganlah engkau mendahuluiku terhadap dirimu. Abu Daud berkata; dan demikianlah [Asy Sya'bi] dan [Al Bahi] serta ['Atha`] meriwayatkannya dari [Abdurrahman bin 'Ashim], dan [Abu Bakr bin Abu Al Jahm] seluruh mereka berasal dari [Fathimah binti Qais], bahwa suaminya telah mencerainya tiga kali",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 110
			}
		}
	]
}