{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2300,
			"arabicnumber": 2300,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Sa'd bin Ishaq bin Ka'bin bin 'Ajrah] dari [bibinya yaitu Zainab binti Ka'bin bin 'Ajrah] bahwa [Al Furai'ah binti Malik bin Sinan] yang merupakan saudari Abu Sa'id Al Kudri telah mengabarkan kepadanya bahwa ia datang kepada Rasulullah shallallahu 'alaihi wasallam meminta izin kepada beliau untuk kembali kepada keluarganya di antara Bani Khudrah, karena suaminya keluar mencari beberapa budaknya yang melarikan diri hingga setelah mereka berada di Tharaf Al Qadum ia bertemu dengan mereka lalu mereka membunuhnya. Aku meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk kembali kepada keluargaku, karena ia tidak meninggalkanku ada dalam tempat tinggal yang ia miliki dan tidak memberikan nafkah. Ia berkata; kemudian aku keluar hingga setelah sampai di sebuah ruangan atau di masjid, beliau memanggilku dan memerintahkan agar aku datang. Kemudian aku beliau berkata: \"Apa yang engkau katakan?\" kemudian aku kembali menyebutkan kisah yang telah saya sebutkan, mengenai keadaan suamiku. Ia berkata; lalu beliau berkata: \"Tinggallah di rumahmu hingga selesai masa 'iddahmu.\" Ia berkata; kemudian aku ber'iddah di tempat tersebut selama empat puluh bulan sepuluh hari. Ia berkata; kemudian tatkala Utsman mengirimkan surat kepadaku, ia bertanya mengenai hal tersebut, lalu aku khabarkan kepadanya, lalu ia mengikutinya dan memberikan keputusan dengannya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 126
			}
		}
	]
}