{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"13": "Divorce (Kitab Al-Talaq)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2306,
			"arabicnumber": 2306,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri], telah mengabarkan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab], telah menceritakan kepadaku ['Ubaidullah bin Abdullah bin 'Utbah] bahwa [ayahnya] menulis surat kepada [Umar bin Abdullah bin Al Arqam Az Zuhri] memerintahkan kepadanya agar menemui [Subai'ah binti Al Harits Al Aslamiyyah], kemudian bertanya kepadanya mengenai haditsnya, dan mengenai apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam kepadanya ketika ia meminta fatwa kepada beliau. Kemudian Umar bin Al Khathab bin Abdullah menulis surat kepada Abdullah bin 'Utbah mengabarkan kepadanya bahwa Subai'ah telah mengabarkan kepadanya bahwa ia dahulu adalah isteri Sa'd bin Haulah sementara ia termasuk diantara Bani 'Amir bin Luai, dan ia termasuk diantara orang-orang yang menghadiri perang Badr. Kemudian ia meninggal pada Haji Wada' sementara Subai'ah sedang hamil, dan tidak lama kemudian ia melahirkan kandungannya setelah kematian suaminya. Kemudian tatkala ia telah selesai dari nifasnya maka ia berhias diri untuk orang-orang yang akan meminang. Kemudian Abu As Sanabil bin Ba'kak yang merupakan seorang laki-laki dari Bani Abdu Ad Dar menemuinya dan berkata; ada apa aku melihatmu berhias diri? Kemungkinan engkau ingin menikah. Demi Allah engkau tidak boleh menikah hingga berlalu empat bulan sepuluh hari. Subai'ah berkata; kemudian tatkala ia mengatakan hal tersebut kepadaku maka aku kumpulkan pakaianku pada sore hari kemudian aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya kepadanya mengenai hal tersebut. Lalu beliau memberiku fatwa bahwa aku telah halal ketika telah melahirkan kandunganku dan beliau memerintahkanku untuk menikah apabila aku menginginkan. Ibnu Syihab berkata; saya melihat tidak mengapa ia menikah ketika telah melahirkan, walaupun ia masih kena darah hanya saja ia tidak didekati oleh suaminya hingga ia bersih",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 13,
				"hadith": 132
			}
		}
	]
}