{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"14": "Fasting (Kitab Al-Siyam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2392,
			"arabicnumber": 2392,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Humaid bin Abdurrahman] dari [Abu Hurairah] bahwa seorang laki-laki telah berbuka pada Bulan Ramadhan, kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkannya agar memerdekakan budak atau berpuasa dua bulan berturut-turut atau memberi makan enam puluh orang miskin. Ia berkata; aku tidak mendapatinya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Duduklah!\" Lalu Rasulullah shallallahu 'alaihi wasallam diberi keranjang yang berisi kurma, kemudian beliau berkata; ambillah ini. Dan bersedekahlah dengannya! Kemudian orang tersebut berkata; wahai Rasulullah, tidak ada seorang pun yang lebih membutuhkan daripada diriku. Maka Rasulullah shallallahu 'alaihi wasallam tertawa hingga nampak gigi-gigi taring beliau. Dan beliau berkata kepadanya; \"Makanlah!\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Ibnu Juraij] dari [Az Zuhri] seperti lafazh Malik; bahwa seorang laki-laki telah berbuka… dan padanya ia menyebutkan: \"atau engkau membebaskan budak, atau berpuasa dua bulan berturut-turut atau memberi makan enam orang miskin.\" Telah menceritakan kepada kami [Ja'far bin Musafir], telah menceritakan kepada kami [Ibnu Abu Fudaik], telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah], ia berkata; seorang laki-laki telah datang kepada Nabi shallallahu 'alaihi wasallam, ia telah berbuka pada Bulan Ramadhan dengan hadits ini. Ia berkata; kemudian Rasulullah shallallahu 'alaihi wasallam diberi kerangjang yang berisi kurma seukuran lima belas sha'. Dalam hadits tersebut beliau mengatakan; makanlah engkau dan penghuni rumahmu dan berpuasalah satu hari dan mintalah ampun kepada Allah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 14,
				"hadith": 80
			}
		}
	]
}