{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2654,
			"arabicnumber": 2654,
			"text": "Telah menceritakan kepada kami [Harun bin Abdullah], bahwa [Hasyim bin Al Qasim], dan [Hisyam] telah menceritakan kepada mereka; telah menceritakan kepada kami [Ikrimah], telah menceritakan kepada kami [Iyas bin Salamah], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; aku pernah memerangi Hawazin bersama Rasulullah shallallahu 'alaihi wasallam, kemudian tatkala kami sedang makan pada waktu dhuha dan kebanyakan kami berjalan kaki, serta diantara kami terdapat orang yang lemah tiba-tiba seseorang datang dengan mengendarai unta. Lalu ia melepas tali dari pinggang unta, lalu ia gunakan untuk mengikat untanya. Kemudian ia datang dan makan siang bersama orang-orang. Kemudian tatkala ia melihat orang-orang lemah mereka dan punggung mereka yang lemas, maka ia keluar menuju kepada untanya lalu melepaskannya kemudian menderumkannya. Orang tersebut duduk di atas unta tersebut kemudian keluar dan memukul unta dengan kakinya. Ia diikuti seseorang dari Aslam yang mengendarai unta Abu-Abu yang sama dengan punggung orang-orang tersebut. Ia berkata; kemudian aku keluar mengejarnya, lalu aku mendapatkannya, sementara kepala untaku ada di sisi pantat untanya, kemudian aku maju hingga dapat memegang tali kendali untanya. Lalu aku menderumkannya. Tatkala ia telahmeletakkan lututnya di tanah aku mencabut pedangku lalu menebas kepalanya hingga ia terjatuh. Kemudian aku datang dengan membawa kendaraannya dan apa yang ada di atasnya. Aku menuntunnya, kemudian Rasulullah shallallahu 'alaihi wasallam menyambutku diantara orang-orang. Kemudian ia berkata; siapakah yang membunuh orang tersebut? Mereka berkata; Salamah bin Al Akwa'. Lalu beliau berkata: \"Baginya salabnya semua.\" Harun berkata; ini adalah lafazh Hasyim",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 178
			}
		}
	]
}