{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"15": "Jihad (Kitab Al-Jihad)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2737,
			"arabicnumber": 2737,
			"text": "Telah menceritakan kepada kami [Wahb bin Baqiyyah], ia berkata; telah mengabarkan kepada kami [Khalid] dari [Daud], dari [Ikrimah], dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada saat perang Badr: \"Barangsiapa yang melakukan demikian dan demikian, maka baginya tambahan pemberian demikian dan demikian.\" Kemudian orang-orang yang muda maju sedangkan orang-orang tua menjaga bendera, dan mereka tidak meninggalkannya hingga Allah memenangkan atas mereka. Orang-orang tua berkata; kami adalah adalah penolong kalian, seandainya kalian kalah maka kalian akan bergabung kepada kami, maka janganlah kalian membawa rampasan perang sementara kami tetap di tempat dan tidak mengambilnya. Kemudian para pemuda menolak hal tersebut dan berkata; Rasulullah shallallahu 'alaihi wasallam telah menjadikannya untuk kami. Kemudian Allah menurunkan ayat: \"Mereka menanyakan kepadamu tentang (pembagian) harta rampasan perang. Katakanlah: \"Harta rampasan perang kepunyaan Allah dan Rasul….. hingga firmanNya: \"Sebagaimana Tuhanmu menyuruhmu pergi dan rumahmu dengan kebenaran, padahal sesungguhnya sebagian dari orang-orang yang beriman itu tidak menyukainya.\" Ibnu Abbas berkata berkata; maka hal tersebut menjadi sesuatu yang lebih baik bagi mereka, dan seperti itu juga; maka taatilah aku sesungguhnya aku lebih mengetahui akibat hal ini daripada kalian. Telah menceritakan kepada kami [Ziyad bin Ayyub], telah menceritakan kepada kami [Husyaim], ia berkata; telah mengabarkan kepada kami [Daud bin Abu Hindun], dari [Ikrimah], dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam berkata pada saat perang Badr: \"Barangsiapa yang membunuh satu orang, maka baginya demikian dan demikain. Dan barangsiapa yang menawan tawanan, maka baginya demikian dan demikian.\" Kemudian ia menyebutkan seperti hadits tersebut. Dan hadits Khalid lebih sempurna. Telah menceritakan kepada kami [Harun bin Muhammad bin Bakkar bin Bilal], ia berkata; telah menceritakan kepada kami [Yazid bin Khalid bin Mauhab Al Hamdani], ia berkata; telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Zaidah], ia berkata; telah mengabarkan kepadaku [Daud] dengan hadits ini menggunakan sanadnya. Ia berkata; kemudian Rasulullah shallallahu 'alaihi wasallam membaginya dengan sama. Dan hadits Khalid lebih sempurna",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 15,
				"hadith": 261
			}
		}
	]
}