{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"19": "Shares of Inheritance (Kitab Al-Fara'id)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2917,
			"arabicnumber": 2917,
			"text": "Telah menceritakan kepada kami [Abdullah bin 'Amr bin Abu Al Hajjaj Abu Ma'mar], telah menceritakan kepada kami [Abdul Warits] dari [Husain Al Mu'allim], dari ['Amr bin Syu'aib], dari [ayahnya], dari [kakeknya], bahwa Ri`ab bin Hudzaifah telah menikah dengan seorang wanita kemudian ia melahirkan tiga orang anak. Kemudian ibu mereka meninggal. Kemudian mereka mewarisi tempat tinggalnya dan perwalian mantan budaknya. Dan 'Amr bin Al 'Ash adalah 'ashabah (orang yang mendapat sisa dari pembagian warisan) anak-anak wanita tersebut, kemudian ia mengeluarkan mereka ke Syam, dan mereka meninggal. Kemudian 'Amr bin Al 'Ash datang dan mantan budak wanita tersebut dan meninggalkan harta untuknya. Kemudian para saudara wanita tersebut mempermasalahkannya kepada Umar bin Al Khathab, kemudian [Umar] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang dijaga seorang anak atau orang tua adalah untuk 'ashabahnya, siapapun dia.\" Ia berkata; kemudian Umar menulis untuknya sebuah surat yang berisi persaksian Abdurrahman bin 'Auf, dan Zaid bin Tsabit serta seorang laki-laki yang lain. Kemudian tatkala Abdul Malik ditunjuk menjadi Khalifah mereka memperselisihkannya kepada Hisyam bin Isma'il, atau kepada Isma'il bin Hisyam. Kemudian ia melaporkannya kepada Abdul Malik. Kemudian ia berkata; ini termasuk keputusan yang telah aku lihat. Ia berkata; kemudian Abdul Malik memutuskan untuk kami dengan surat Umar bin Al Khathab, dan kami dalam keputusan tersebut hingga saat ini",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 33
			}
		}
	]
}