{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2963,
			"arabicnumber": 2963,
			"text": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Muhammad bin Yahya bin Faris] secara makna, keduanya berkata; telah menceritakan kepada kami [Bisyr bin Umar Az Zahrani], telah menceritakan kepadaku [Malik bin Anas] dari [Ibnu Syihab] dari [Malik bin Aus bin Al Hadatsan], ia berkata; [Umar] mengirim surat kepadaku ketika siang telah meninggi, kemudian aku datang kepadanya dan aku mendapatinya sedang duduk di atas dipan yang bersentuhan langsung dengan pasir. Kemudian ia berkata ketika aku menemuinya; Wahai Malik, sesungguhnya penghuni beberapa rumah diantara kaummu telah berjalan lemas dan sesungguhnya aku telah memerintahkan agar memberikan sedikit pemberian kepada mereka. Aku katakan; seandainya engkau memerintahkan selainku untuk melakukan hal tersebut maka lebih baik. Kemudian ia berkata; ambillah! Kemudian penjaga Umar datang kepadanya, kemudian penjaga tersebut berkata; wahai Amirul mukminin apakah anda mau menemui [Utsman bin Affan], [Abdurrahman bin 'Auf], [Az Zubair bin Al 'Awwam], dan [Sa'd bin Abu Waqqash]? Ia berkata; ya. kemudian mereka diberi izin maka merekapun masuk. Kemudian penjaganya datang dan berkata; wahai Amirul mukminin apakah anda mau menemui [Al Abbas], dan [Ali]? Ia berkata; ya. kemudian ia memberikan izin kepada mereka, lalu mereka masuk. Al Abbas berkata; wahai amirul mukminin, putuskan antaraku dan antara orang ini, yaitu Ali! Kemudian sebagian orang berata; ya wahai amirul mukminin, putuskan antara keduanya! Dan hentikan mereka dari bertikai. [Malik bin Aus] berkata; aku berfikir bahwa mereka berdua mendatangkan orang-orang tersebut untuk hal tersebut. Kemudian Umar rahimahullah berkata; bersabarlah kalian berdua! Kemudian ia menghadap kepada orang-orang tersebut dan berkata; aku bertanya kepada kalian dengan nama Allah yang dengan seizinnya langit dan bumi berdiri; apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah.\" Mereka berkata; ya. kemudian ia menghadap kepada Ali dan Al Abbas radhiyallallahu 'anhuma dan berkata; aku bertanya kepada kalian dengan nama Allah yang dengan seizinnya langit dan bumi berdiri; apakah kalian mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah.\" Mereka berkata; ya. ia berkata; sesungguhnya Allah telah mengkhususkan Rasulnya shallallahu 'alaihi wasallam dengan kekhususan yang tidak dikhususkan kepada seorangpun diantara manusia. Allah berfirman: \"Dan apa saja harta rampasan (fai-i) yang diberikan Allah kepada RasulNya (dari harta benda) mereka, maka untuk mendapatkan itu kamu tidak mengerahkan seekor kudapun dan (tidak pula) seekor untapun, tetapi Allah yang memberikan kekuasaan kepada RasulNya terhadap apa saja yang dikehendakiNya. Dan Allah Maha Kuasa atas segala sesuatu.\" Dan Allah telah memberikan fai` Bani Nadhir kepada RasulNya. Demi Allah beliau tidak mementingkan diri sendiri atas kalian, dan tidak mengambilnya sendiri tanpa memberikan kepada kalian. Rasulullah shallallahu 'alaihi wasallam mengambil sebagian darinya sebagai nafkah satu tahun, atau nafkahnya dan nafkah keluargannya, dan menjadian sisanya sebagai sedekah. Kemudian ia menghadap kepada orang-orang tersebut dan berkata; aku bertanya kepada kalian dengan nama Allah yang dengan seizinnya langit dan bumi berdiri; apakah kalian mengetahui hal tersebut? Mereka mengatakan; ya. kemudian ia menghadap kepada [Al Abbas] dan [Ali] radliallahu 'anhuma dan berkata; aku bertanya kepada kalian dengan nama Allah yang dengan seizinnya langit dan bumi berdiri; apakah kalian mengetahui hal tersebut? Mereka mengatakan; ya. kemudian tatkala Rasulullah shallallahu 'alaihi wasallam wafat [Abu Bakr] berkata; aku adalah wali Rasulullah shallallahu 'alaihi wasallam kemudian engkau datang bersama orang ini engkau meminta warisanmu dari anak saudaramu, dan orang ini meminta warisan isterinya dari ayahnya. Kemudian Abu Bakr rahimahullah berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami tidak diwarisi, apa yang kami tinggalkan adalah sedekah.\" Allah mengetahui bahwa ia adalah orang yang jujur dan baik, berakal dan mengikuti kebenaran. Kemudian Abu Bakr mengurusinya. Kemudian tatkala Abu Bakr meninggal, aku katakan; aku adalah wali Rasulullah shallallahu 'alaihi wasallam dan wali Abu Bakr, maka aku mengurusnya sesuai dengan kehendak Allah agar aku mengurusnya, kemudian engkau dan orang ini datang dan urusan kalian adalah sama. Kalian berdua memintanya kepadaku. maka aku katakan; apabila kalian menghendaki untuk aku serahkan harta tersebut kepada kalian berdua dengan syarat kalian berjanji dengan perjanjian Allah yaitu agar kalian mengurusnya dengan dengan kepengurusan yang dilakukan Rasulullah shallallahu 'alaihi wasallam. Maka kalian mengambilnya dariku dengan syarat hal tersebut. Kemudian kalian berdua datang kepadaku agar aku memberikan keputusan diantara kalian berdua dengan cara tidak seperti itu. Demi Allah aku tidak akan memutuskan diantara kalian berdua dengan cara tidak seperti itu hingga bangkitnya hari kiamat. Maka apabila kalian berdua tidak mampu maka kembalikanlah kepadaku. Abu Daud berkata; sesungguhnya mereka berdua meminta kepadanya agar ia membagi diantara mereka berdua menjadi dua bagian, bukannya mereka tidak mengetahui bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Kami tidak diwarisi, dan apa yang kami tinggalkan adalah sedekah.\" Sesungguhnya mereka berdua tidak menuntut kecuali kebenaran. Kemudian Umar berkata; aku tidak memberinya nama pembagian, aku membiarkannya sebagaimana adanya. Telah menceritakan kepada kami [Muhammad bin 'ubaid] telah menceritakan kepada kami [Muhammad bin Tsaur] dari [Ma'mar] dari [Az Zuhri] dari [Malik bin Aus] dengan kisah ini. Ia berkata; dan mereka yaitu Ali dan Al Abbas radliallahu 'anhuma berselisih mengenai apa yang Allah berikan kepada RasulNya sebagai fai` dari harta Bani Nadhir. Abu Daud berkata; Umar menghendaki agar tidak diberi nama pembagian",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 36
			}
		}
	]
}