{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2984,
			"arabicnumber": 2984,
			"text": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah?], telah menceritakan kepada kami [Ibnu Numair], telah menceritakan kepada kami [Hasyim bin Al Barid], telah menceritakan kepada kami [Husain bin Maimun], dari [Abdullah bin Abdullah], dari [Abdurrahman bin Abu Laila], ia berkata; saya mendengar [Ali] berkata; aku berkumpul bersama Al 'Abbas, Fathimah, dan Zaid bin Haritsah di sisi Nabi shallallahu 'alaihi wasallam, kemudian aku katakan; wahai Rasulullah, apabila anda memandang perlu untuk anda serahkan kepadaku hak kami dari seperlima yang ada dalam kitab Allah ini dan aku membaginya di masa hidup anda agar tidak ada seorangpun yang menyelisihiku setelahmu, maka lakukanlah! Ali berkata; kemudian beliau melakukan hal tersebut. Kemudian aku membaginya pada masa hidup Rasulullah shallallahu 'alaihi wasallam, kemudian Abu Bakr menyerahkannya kepadaku hingga setelah akhir tahun kekhilafahan Umar radliallahu 'anhu maka sesungguhnya telah datang kepadanya harta yang banyak kemudian ia melepas hak kami kemudian mengirimkan sebagian harta tersebut kepadaku. Lalu aku katakan; pada tahun ini kami tidak butuh kepadanya dan orang-orang muslim membutuhkan kepadanya, maka kembalikan kepada mereka! Kemudian Umar mengembalikan harta tersebut kepada mereka, kemudian tidak ada seorangpun yang mengundangku untuk mengambil harta tersebut setelah Umar. Kemudian aku menemui Ibnu Abbas setelah aku keluar dari sisi Umar, lalu ia berkata; wahai Ali, sungguh pagi ini engkau telah menghalangi kita mengambil sesuatu yang tidak akan dikembalikan kepada kita selamanya. Dan ia adalah laki-laki yang memiliki pemikiran yang baik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 57
			}
		}
	]
}