{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2988,
			"arabicnumber": 2988,
			"text": "Telah menceritakan kepada kami [Yahya bin Khalaf], telah menceritakan kepada kami [Abdul A'la] dari [Sa'id Al Jurairi], dari [Abu Al Ward], dari [Ibnu A'bud], ia berkata; [Ali radliallahu 'anhu] berkata kepadaku; maukah aku ceritakan kepadamu dariku dan Fathimah anak Rasulullah shallallahu 'alaihi wasallam? Ia termasuk keluarga yang paling beliau cintai. Aku katakan; ya. Ia berkata; sesungguhnya ia menarik alat untuk menyiram tanaman hingga membekas di tangannya, ia menyiram menggunakan geriba hingga membekas di lehernya, ia menyapu rumah hingga debu mengotori pakaiannya. Kemudian telah datang kepada Nabi shallallahu 'alaihi wasallam beberapa orang pembantu, lalu aku katakan; seandainya engkau datang kepada ayahmu dan meminta pembantu kepadanya maka hal tersebut adalah lebih baik. Kemudian ia mendapati di sisi beliau terdapat sekelompok orang yang sedang berbincang-bincang. Lalu ia kembali, kemudian keesokan hari beliau datang kepadanya dan berkata: \"Apakah keperluanmu?\" kemudian Fathimah terdiam, lalu aku katakan; aku akan menceritkan kepada anda wahai Rasulullah, ia menarik alat untuk menyirami tanaman hingga membekas pada tangannya, ia menggendong geriba hingga membekas pada lehernya. Kemudian tatkala terdapat beberapa orang pembantu kepada anda maka aku memerintahkannya agar datang kepada anda dan minta pembantu kepada anda yang akan melindungi panas yang ia alami. Beliau berkata: \"Bertakwalah engkau kepada Allah wahai Fathimah, dan tunaikanlah kewajiban Tuhanmu, dan laksanakanlah pekerjaan keluagamu. Kemudian apabila engkau bersiap untuk tidur maka bertasbihlah tiga puluh tiga kali, bertahmidlah tiga puluh tiga kali, dan bertakbirlah tiga puluh empat kali, sehingga berjumlah seratus. Maka hal tersebut lebih baik bagimu daripada seorang pembantu.\" Fathimah berkata; aku ridha kepada Allah dan rasulNya shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri], dari [Ali bin Husain], dengan kisah ini. ia berkata; dan beliau tidak memberikan pembantu kepadanya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 61
			}
		}
	]
}