{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3000,
			"arabicnumber": 3000,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] bahwa [Al Hakam bin Nafi'] telah menceritakan kepada mereka, ia berkata; telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri], dari [Abdurrahman bin Abdullah bin Ka'b bin Malik], dari [ayahnya], dan ia adalah salah satu dari tiga orang yang mendapatkan taubat. Dan dahulu Ka'b bin Al Asyraf mencaci Nabi shallallahu 'alaihi wasallam dan mendorong orang-orang kafir Quraisy untuk menyerang beliau. Dan pada saat Nabi shallallahu 'alaihi wasallam datang ke Madinah, penduduknya adalah campur. Diantara mereka orang-orang muslim, orang-orang musyrik yang menyembah berhala serta orang-orang yahudi. Dan mereka menyakiti Nabi shallallahu 'alaihi wasallam serta para sahabatnya. Kemudian Allah 'azza wajalla memerintahkan NabiNya agar bersabar dan memaafkan. Dan Allah mengirimkan ayat mengenai mereka: \"Dan (juga) kamu sungguh-sungguh akan mendengar dari orang-orang yang diberi kitab sebelum kamu…\" kemudian tatkala Ka'b bin Al Asyraf enggan untuk menghentikan gangguannya kepada Nabi shallallahu 'alaihi wasallam, maka Nabi shallallahu 'alaihi wasallam memerintahkan Sa'd bin Mu'adz agar mengirim beberapa orang yang akan membunuhnya. Kemudian ia mengutus Muhammad bin Maslamah. - dan ia menyebutkan kisah terbunuhnya Ka'b. kemudian tatkala mereka telah membunuhnya maka orang-orang yahudi dan musyrik kaget. Kemudian mereka mendatangi Nabi shallallahu 'alaihi wasallam dan berkata; sahabat kami telah diketuk kemudian dibunuh. Kemudian Nabi shallallahu 'alaihi wasallam menyebutkan kepada mereka sesuatu yang Ka'b ucapkan. Dan Nabi shallallahu 'alaihi wasallam mengajak mereka agar beliau menulis perjanjian yang mereka taati isinya. Nabi shallallahu 'alaihi wasallam menulis antara beliau, dan mereka serta orang-orang muslim sebuah perjanjian dalam kertas",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 73
			}
		}
	]
}