{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3070,
			"arabicnumber": 3070,
			"text": "Telah menceritakan kepada kami [Hafsh bin Umar], dan [Musa bin Isma'il] secara makna adalah satu. Mereka berkata; telah menceritakan kepada kami [Abdullah bin Hassan Al 'Anbari] telah menceritakan kepadaku kedua nenekku yaitu [Shafiyyah] dan [Duhaibah] dua anak wanita 'Ulaibah. Dan mereka berdua adalah dua anak asuh [Qailah binti Makhramah], dan ia adalah nenek ayah mereka berdua, bahwa ia telah mengabarkan kepada mereka berdua, ia berkata; kami datang kepada Rasulullah shallallahu 'alaihi wasallam, kemudian sahabatku yaitu Huraits bin Hassan utusan Bakr bin Wail maju ke depan, kemudian beliau membai'atnya ia dan kaumnya harus berada di atas Islam. Kemudian ia berkata; wahai Rasulullah, tulislah antara kami dan Bani Tamim di Ad Dahna` di Ad Dahna` agar tidak ada seorangpun yang melampauinya kepada kami kecuali orang musafir atau orang yang bertetangga. Kemudian beliau berkata: \"Tuliskan untuknya wahai pembantu, di Ad Dahnah`, bahwa tidak ada menewatinya menuju kepada kami seorang pun diantara mereka kecuali orang y ang bersafar, atau orang yang bertetangga.\" Kemudian tatkala aku melihat beliau memerintahkan agar menuliskan hal tersebut maka aku merasa gelisah, Ad Dahna` adalah negeriku dan tempat tinggalku. Kemudian aku katakan; wahai Rasulullah, sesungguhnya ia tidak meminta kepadamu tanah datarketika ia meminta kepadamu. Sesungguhnya Ad Dahna` ini adalah tempat mengikat unta serta tempat menggembala kambing, sementara para wanita Bani Tamim dan anak-anak mereka di belakang perjanjian tersebut. Kemudian beliau berkata; tahan wahai pelayan. Wanita miskin (yaitu Qailah) itu benar, seorang muslim adalah saudara muslim yang lain, mereka berdua boleh mengambil air dan pohon serta mereka berdua saling tolang menolong melawan pembawa fitnah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 143
			}
		}
	]
}