{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"20": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Abdul Wahhab] telah menceritakan kepada kami [Ayyub] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barang siapa yang menghidupkan lahan yang mati maka lahan tesebut adalah miliknya, tidak ada hak bagi keringat yang zhalim.\" Telah menceritakan kepada kami [Hannad bin As Sari] telah menceritakan kepada kami ['Abdah] dari [Muhammad bin Ishaq] dari [Yahya bin 'Urwah] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Barang siapa yang menghidupkan lahan yang mati maka lahan tesebut adalah miliknya.\" Dan ia menyebutkan sesuatu yang sama dengannya. Ia berkata; sungguh telah telah mengabarkan kepadaku orang yang telah menceritakan kepadaku hadits ini, bahwa dua orang telah memperkarakan kepada Rasulullah shallallahu 'alaihi wasallam. Salah seorang diantara diantara mereka menanam pohon kurma di lahan orang lain. Kemudian beliau memutuskan bahwa orang yang memiliki lahan mendapatkan lahannya dan memerintahkan kepada pemilik pohon kurma agar mengeluarkan pohon kurma dari lahan tersebut. 'Urwah berkata; sungguh aku melihat pohon kurma tersebut akarnya telah ditebang menggunakan kapak. Sesungguhnya pohon kurma tersebut adalah pohon kurma yang sempurna tinggi dan lebatnya. Hingga pohon tersebut telah dikeluarkan darinya. Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi], telah menceritakan kepada kami [Wahb] dari [ayahnya], dari [Ibnu Ishaq] dengan sanad dan maknanya, hanya saja ia mengatakan pada perkataan (di tempat ia menceritakan kepadaku ini); kemudian seorang sahabat Nabi shallallahu 'alaihi wasallam berkata; dan perkiraan kuatku bahwa ia adalah [Abu Sa'id Al Khudri], dan aku melihat seorang laki-laki yang menebang akar pohon kurma",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 147
			}
		}
	]
}