{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"21": "Funerals (Kitab Al-Jana'iz)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3112,
			"arabicnumber": 3112,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Ibrahim bin Sa'd] telah mengabarkan kepada kami [Ibnu Syihab], telah mengabarkan kepadaku ['Amr bin Jariyah Ats Tsaqafi] sekutu Bani Zuhrah, dan ia termasuk diantara sahabat Abu Hurairah, dari [Abu Hurairah], ia berkata; anak-anak Al Harits bin 'Amir bin Naufal telah membeli Khubaib, dan Khubai telah membunuh Al Harits bin 'Amir pada saat perang Badr, dan Khubaib tinggal bersama mereka sebagai tawanan hingga mereka bertekad untuk membunuhnya, kemudian ia meminjam pisau cukur dari anak wanita Al Harits yang akan ia gunakan untuk mencukur bulu kemaluan. Lalu wanita tersebut meminjamkannya kepadanya, kemudian anak wanita tersebut merangkak sementara ia lalai hingga sampai kepada Khubaib. Lalu wanita tersebut mendapati anaknya sendirian berada di atas pangkuan Khubaib sementara pisau cukur ada di tangannya. Maka wanita tersebut sangat terkejut, dan Khubaib mengetahui hal tersebut padanya. Kemudian ia berkata; apakah engkau khawatir aku akan membunuhnya? Aku tidak akan melakukan hal tersebut. Abu Daud berkata; kisah ini diriwayatkan oleh [Syu'aib bin Abu Hamzah], dari [Az Zuhri], ia berkata; telah mengabarkan kepadaku ['Ubaidullah bin 'Iyadh] bahwa [anak wanita Al Harits] telah mengabarkan kepadanya bahwa mereka berkumpul untuk membunuhnya, Khubaib meminjam pisau cukur darinya yang akan ia gunakan untuk mencukur bulu kemaluannya. Lalu wanita tersebut meminjamkannya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		}
	]
}