{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"23": "Commercial Transactions (Kitab Al-Buyu)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3332,
			"arabicnumber": 3332,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah mengabarkan kepada kami [Ibnu Idris], telah mengabarkan kepada kami ['Ashim bin Kulaib], dari [ayahnya] dari [seorang laki-laki anshar], ia berkata; kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam mengantarkan jenazah, kemudian aku melihat Rasulullah shallallahu 'alaihi wasallam berada di atas kubur berwasiat kepada orang yang menggali: \"Perluaslah dari sisi kedua kakinya, perluaslah dari sisi kepalanya.\" Kemudian tatkala kembali, beliau disambut utusan seorang wanita yang mengundang Rasulullah shallallahu 'alaihi wasallam untuk makan, kemudian beliau datang dan makanan pun dihidangkan. Lalu beliau meletakkan tangannya pada makan kemudian orang-orang meletakkan tangan mereka pada makanan, lalu mereka makan. Kemudian orang-orang melihat Rasulullah shallallahu 'alaihi wasallam mengunyah makanan di mulutnya, kemudian beliau berkata: \"Saya dapatkan daging kambing yang diambil tanpa seizin pemiliknya.\" Kemudian wanita tersebut mengirim utusan, ia berkata; wahai Rasulullah, sesungguhnya saya telah mengirim utusan ke Baqi' untuk membelikan kambing, lalu aku tidak mendapatinya. Lalu aku mengirim utusan kepada tetanggaku yang telah membeli kambing agar ia mengirimnya kepadaku dan diganti dengan harganya, namun aku tidak mendapatkanya. Lalu aku mengirim utusan kepada isterinya, kemudian wanita tersebut mengirimkan kambing tersebut kepadaku. Lalu Rasulullah shallallahu 'alaihi wasallam berkata: \"Berilah makan para tawanan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 7
			}
		}
	]
}