{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"23": "Commercial Transactions (Kitab Al-Buyu)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3378,
			"arabicnumber": 3378,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ahmad bin 'Amr bin As Sarh], dan ini adalah lafazhnya. Mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Atha` bin Yazid? Al Laitsi] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam melarang dari dua macam jual beli dan dua pakaian. Adapun dua macam jual beli yaitu mulamasah (jual beli pakaian yang dilakukan oleh dua orang dengan cara menyentuhnya (lams) dari luar tanpa membukanya dan tidak mengetahui apa yang ada di dalamnya) dan munabadzah (seseorang berkata; lemparkan kepadaku apa yang ada padamu dan aku akan melemparkan sesuatu yang ada padaku, dan hal tersebut dianggap sebagai proses jual beli). Adapun dua pakaian adalah isytimal shamma` (melilitkan pakaian yang tidak ada tempat keluar untuk tangan) dan seseorang membungkus dirinya dengan satu kain dan membuka kemaluannya atau tidak ada sesuatupun kain yang menutupi kemaluannya. Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri], dari ['Atha` bin Yazid? Al Laitsi] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini. Ia menambahkan; dan isytimal shama` adalah berselimut dalam satu kain, meletakkan dua ujung kain pada pundaknya sebelah kiri, dan membuka sebelah kanan. Sedangkan munabadzah adalah dengan mengatakan; apabila aku lemparkan kepadamu pakaian ini maka telah sah jual beli. Dan mulamasah adalah menyentuh kain dengan tangannya dan tidak membukanya serta membalikkannya. Apabila ia menyentuhnya maka telah sah jual beli. Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah bin Khalid], telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab], ia berkata; telah mengabarkan kepadaku ['Amir bin Sa'dan bin Abu Waqqash] bahwa [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dengan makna hadits Sufyan dan Abdurrazzaq seluruhnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 53
			}
		}
	]
}