{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 343,
			"arabicnumber": 343,
			"text": "Telah menceritakan kepada kami [Yazdi bin Khalid bin Yazid bin Abdullah bin Mauhib Ar-Ramli Al-Hamdani] -dari jalur lain-. Telah menceritakan kepada kami [Abdul Aziz bin Yahya Al-Harrani] dia berkata; Telah menceritakan kepada kami [Muhammad bin Salamah] -dari jalur lain- Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dan hadits ini Muhammad bin Salamah dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin Abdurrahman], Abu Dawud berkata; berkata Yazid dan Abdul Aziz di dalam hadits riwayatnya; dari Abu Salamah bin Abdurrahman dan [Abu Umamah bin Sahl] dari [Abu Sa'id Al-Khudri] dan [Abu Hurairah] keduanya berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mandi pada hari Jum'at dan memakai pakaian yang paling bagus, serta memakai wangi-wangian kalau dia punya, setelah itu dia mendatangi shalat Jum'at di masjid dan tidak melangkahi leher-leher jama'ah, kemudian mengerjakan shalat yang diperintahkan Allah, lalu dia diam (untuk mendengarkan khutbah) apabila imam telah datang untuk berkhutbah, sampai dia selesai dari shalatnya. Maka shalatnya itu menjadi penebus dosa baginya antara Jum'at itu dengan Jum'at sebelumnya.\" Perawi Hadits ini berkata; Abu Hurairah berkata;... dan ditambah tiga hari..., dan katanya, Sesungguhnya satu kebaikan itu akan dibalas dengan sepuluh kali lipat. Abu Dawud berkata; Hadits Muhammad bin Salamah lebih sempurna, dan Hammad tidak menyebutkan ucapan Abu Hurairah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 343
			}
		}
	]
}