{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 353,
			"arabicnumber": 353,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Amru bin Abi Amru] dari [Ikrimah] bahwasanya beberapa orang dari Iraq datang dan berkata; Wahai [Ibnu Abbas], apakah engkau berpendapat bahwa mandi hari Jum'at itu wajib? Dia menjawab; Tidak, akan tetapi lebih suci dan lebih baik bagi orang yang mandi, dan barangsiapa yang tidak mandi, maka tidak ada kewajiban apa-apa atasnya. Saya akan memberitahukan kepada kalian, bagaimana asal mula diperintahkannya mandi. Pernah kehidupan orang-orang dalam keadaan sulit, mereka memakai kain wol, bekerja berat mengangkat barang, sementara masjid mereka sempit, ketika itu atapnya rendah, karena hanya terbuat dari pelepah kurma. Maka Rasulullah shallallahu 'alaihi wasallam datang pada hari yang bercuaca panas, sedangkan orang-orang berkeringat membasahi pakaiannya yang terbuat dari wol, sehingga angin yang bertiup membawa bau kurang enak meraka, yang menyebabkan mereka satu sama lain merasa terganggu. Setelah Rasulullah shallallahu 'alaihi wasallam mencium bau yang kurang enak itu, beliau bersabda: \"Wahai jama'ah sekalian, apabila datang hari (Jum'at), maka mandilah, dan pakailah minyak dan wangi-wangian yang paling baik sedapatnya.\" Ibnu Abbas berkata; Kemudian Allah memberi kelapangan, mereka memakai pakaian bukan dari wol lagi, juga diberi kecukupan pekerjaan, masjid mereka diperluas, dan bau keringat kurang enak, yang menyebabkan mereka satu sama lain merasa terganggu pun telah hilang",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 353
			}
		}
	]
}