{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"29": "Medicine (Kitab Al-Tibb)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3900,
			"arabicnumber": 3900,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Abu Al Mutawakkil] dari [Abu Sa'id Al Khudri] bahwa beberapa sahabat Nabi shallallahu 'alaihi wasallam pergi dalam suatu perjalanan yang mereka lakukan. Kemudian mereka singgah di sebuah kampung Arab, sebagian penduduk kampung tersebut lalu berkata, \"Sesungguhnya pemimpin kami tersengat, apakah salah seorang di antara kalian memiliki sesuatu yang bermanfaat bagi sahabat kami tersebut?\" Kemudian salah seorang dari para sahabat tersebut menjawab, \"Ya. Demi Allah, sesungguhnya aku akan menjampi, akan tetapi kami telah meminta kalian agar menjamu kami namun kalian menolak untuk menjadikan kami sebagai tamu. Aku tidak akan menjampi hingga kalian memberikan hadiah kepadaku.\" Penduduk kampung tersebut kemudian memberikan hadiah sekumpulan kambing kepadanya, lalu sahabat tersebut datang kepada orang yang tersengat dan membacakan Surat Al Fatihah kepadanya, lalu meniupkan hingga orang tersebut sembuh seolah-olah telah terbebas dari ikatan.\" Abu Sa'id Al Khudri berkata, \"Kemudian mereka memenuhi janjinya untuk memberikan hadiah kepada para sahabat sebagaimana yang mereka janjikan. Kemudian para sahabat berkata, \"Bagilah kambing-kambing tersebut!\" Lalu sahabat yang telah membacakan jampi mengatakan, \"Kalian jangan melakukannya hingga kita datang kepada Rasulullah shallallahu 'alaihi wasallam dan minta pertimbangannya.\" Lalu mereka pergi menemui Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepada beliau. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Dari mana kalian mengetahui bahwa Al Fatihah adalah jampi? Kalian telah berbuat baik, bagilah dan berilah aku bagian bersama kalian",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 29,
				"hadith": 46
			}
		}
	]
}