{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"31": "The Book of Manumission of Slaves"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3929,
			"arabicnumber": 3929,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dan [Qutaibah bin Sa'id] mereka berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] bahwa [Aisyah] radliallahu 'anhuma mengabarkan kepadanya, bahwa Barirah telah datang kepada Aisyah meminta bantuan kepadanya dalam hal perjanjian pembebasan dirinya, sementara ia tidak mampu melunasi sedikitpun dari perjanjain pembebasannya. Kemudian Aisyah berkata kepadanya, \"Kembalilah kepada tuanmu, jika mereka mau aku melunasi pembayaranmu dan perwaliannya untukku, maka aku akan melakukannya.\" Kemudian Barirah menyebutkan hal tersebut kepada tuannya. Namun mereka menolak dan berkata, \"Apabila Aisyah berkehendak untuk mendapatkan pahala dengan membebaskanmu maka silahkan ia melakukan, dan perwalianmu untuk kami.\" Aisyah kemudian menceritakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Maka Rasulullah shallallahu 'alaihi wasallam pun berkata kepadanya: \"Beli dan bebaskanlah dia, sesungguhnya perwalian adalah untuk orang yang telah membebaskan.\" Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri dan bersabda: \"Mengapa orang-orang membuat syarat yang tidak ada dalam kitab Allah! Barangsiapa memberikan syarat yang tidak ada dalam kitab Allah, maka tidak ada hak baginya walaupun ia memberikan syarat sebanyak seratus kali. Syarat Allah lebih berhak dan lebih kuat.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anhuma, ia berkata, \"Barirah telah datang minta bantuan mengenai perjanjian pembebasannya, ia berkata, \"Sesungguhnya aku mengadakan perjanjian pembebasan diriku dengan tuanku seharga sembilan uqiyah, yaitu satu uqiyah untuk setiap tahunnya. Maka bantulah aku!\" Kemudian Aisyah berkata, \"Jika tuanmu ingin aku melunasi pembayaran tersebut, lalu aku bebaskan kamu dan perlianmu juga tetap untukku maka aku akan lakukan.\" Barirah kemudian pergi menemui tuannya…lalu 'Urwah menyebutkan hadits tersebut seperti hadits Az Zuhri. Ia menambahkan pada akhir sabda Nabi shallallahu 'alaihi wasallam: \"Kenapa di antara orang-orang ada seorang laki-laki berkata, 'Bebaskan wahai Fulan, dan perwaliannya milikku' sesungguhnya perwalian adalah milik orang yang membebaskan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 4
			}
		}
	]
}