{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 395,
			"arabicnumber": 395,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Dawud] telah menceritakan kepada kami [Badr bin Utsman] telah menceritakan kepada kami [Abu Bakr bin Abu Musa] dari [Abu Musa] bahwasanya ada seorang penanya bertanya kepada Nabi shallallahu 'alaihi wasallam (tentang waktu shalat), namun beliau tidak menjawab sesuatu pun padanya hingga beliau memerintahkan Bilal untuk mengumandangkan iqamat shalat Fajar tatkala fajar telah merekah. Beliau shalat tatkala seseorang tidak mengetahui (melihat) wajah saudaranya, atau seseorang tidak tahu siapa yang ada di sampingnya. Kemudian beliau memerintahkan Bilal untuk mengumandangkan iqamat shalat Zhuhur tatkala matahari tergelincir, hingga orang mengatakan; apakah telah sampai pertengahan siang, dan dia lebih tahu. Kemudian beliau memerintahkan Bilal untuk mengumandangkan iqamat shalat Ashar sedangkan matahari berwarna putih meninggi. Lalu memerintahkan Bilal untuk mengumandangkan iqamat shalat Maghrib tatkala matahari tenggelam. Dan beliau memerintahkan Bilal untuk mengumandangkan iqamat shalat Isya tatkala sinar merah matahari telah hilang. Tatkala keesokan harinya, beliau shalat Shubuh dan setelah selesai beliau beranjak, lalu kami katakan; Apakah matahari telah terbit? Lalu beliau mendirikan shalat Zhuhur pada waktu Ashar ketika hari sebelumnya, dan shalat Ashar tatkala matahari telah menguning atau dia mengatakan telah sore. Dan shalat Maghrib sebelum tenggelamnya sinar benang merah, serta shalat 'Isya hingga sepertiga malam. Kemudian beliau bertanya: \"Di mana orang yang bertanya tentang waktu shalat? Waktu tersebut adalah di antara kedua waktu ini.\" Abu Dawud berkata; [Sulaiman bin Musa] meriwayatkan dari ['Atha`] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam dalam shalat Maghrib seperti lafazh di atas, dia berkata; kemudian shalat Isya, sebagian mereka mengatakan hingga sepertiga malam, sedangkan yang lainnya mengatakan hingga pertengahan malam. Demikian pula diriwayatkan oleh [Ibnu Buraidah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 5
			}
		}
	]
}