{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"34": "Clothing (Kitab Al-Libas)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4040,
			"arabicnumber": 4040,
			"text": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Umar Ibnul Khaththab melihat kain bersulam sutera di jual depan pintu masjid. Umar lalu berkata, \"Wahai Rasulullah, sekiranya saja engkau membeli kain ini, sehingga engkau bisa memakainya di hari jum'at dan saat menerima utusan jika datang kepadamu.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Hanyasanya yang mengenakan ini adalah orang-orang yang tidak akan mendapatkan bagian di akhirat.\" Setelah itu didatangkan kepada Rasulullah shallallahu 'alaihi wasallam beberapa potong kain sutera, beliau lantas memberikan sepotong darinya kepada Umar Ibnul Khaththab. Umar lalu bertanya, \"Wahai Rasulullah, kenapa engkau berikan ini kepadaku, padahal engkau telah berkata tentang sutera sebagaimana yang engkau katakan!\" Rasulullah shallallahu 'alaihi wasallam kemudian menjawab: \"Aku berikan itu kepadamu bukan untuk engkau pakai.\" Umar Ibnul Khaththab pun mengenakan kain tersebut untuk saudara laki-lakinya yang masih musyrik di Makkah.\" Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dan [Amru Ibnul Harits] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Bapaknya] dengan kisah beriku, ia berkata, \"Dengan kain sutera, \" dan ia menyebutkan dalam hadits tersebut, \"Lalu beliau mengirimkan jubbah (selendang) sutera kepada Umar.\" Beliau kemudian bersabda: \"Juallah ini, dan gunakanlah hasil penjualannya untuk memenuhi kebutuhanmu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 21
			}
		}
	]
}