{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"34": "Clothing (Kitab Al-Libas)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4084,
			"arabicnumber": 4084,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Abu Ghifar] berkata, telah menceritakan kepada kami [Abu Tamimah Al Hujaimi] -dan Abu Tamimah namanya adalah Tharif bin Mujalid- dari [Abu Jurai Jabir bin Sulaim] ia berkata, \"Aku melihat seorang laki-laki yang fikirannya dijadikan sandaran oleh orang banyak, dan ia tidak mengatakan sesuatu kecuali orang-orang akan mengikutinya. Aku lalu bertanya, \"Siapakah dia?\" orang-orang menjawab, \"Ini adalah Rasulullah shallallahu 'alaihi wasallam.\" maka aku pun berkata, 'Wahai Rasulullah, 'Alaika As Salam (semoga keselamatan bersamamu) ' wahai Rasulullah, sebanyak dua kali. Beliau bersabda: \"Jangan engkau ucapkan 'Alaika As Salam', karena 'Alaika As Salam adalah penghormatan dan salam untuk mayit. Tetapi ucapkanlah 'As Salamu 'Alaika'.\" Jabir bin Sulaim berkata, \"Aku lalu bertanya, \"Apakah engkau utusan Allah?\" beliau menjawab: \"Ya, aku adalah utusan Allah, Dzat yang jika engkau tertimpa musibah, lalu engkau berdoa kepada-Nya, maka Dia akan menghilangkannya darimu. Jika kamu tertimpa paceklik, lalu engkau berdoa maka Dia akan menumbuhkan (tanaman) bagi kamu. Jika engkau berada di suatu tempat yang luas hingga kendaraanmu hilang, lalu engkau berdoa kepada-Nya, maka Dia akan mengembalikannya kepadamu.\" Jabir bin Sulaim berkata, \"Lalu aku berkata, \"Berilah kami perjanjian.\" Beliau bersabda: \"Jangan sekali-kali engaku cela orang lain.\" Jabir bin Sulaim berkata, \"Setelah itu aku tidak pernah mencela seorang pun; orang merdeka atau budak, unta atau kambing.\" Beliau bersabda lagi: \"Janganlah engkau remehkan perkara ma'ruf, berbicaralah kepada saudaramu dengan wajah yang penuh senyum dan berseri, sebab itu bagian dari perkara yang ma'ruf. Angkatlah sarungmu hingga setengah betis, jika tidak maka hingga kedua mata kaki. Dan janganlah engkau julurkan sarungmu karena itu bagian dari sifat sombong, sesungguhnya Allah tidak menyukai sifat sombong. Jika ada seseorang yang mencela dan memakimu karena cela yang ia ketahui darimu, maka janganlah engkau balas memaki karena cela yang engkau ketahui padanya, karena hal itu akan memberatkannya (pada hari kiamat)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 65
			}
		}
	]
}