{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"36": "Signet-Rings (Kitab Al-Khatam)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4218,
			"arabicnumber": 4218,
			"text": "Telah menceritakan kepada kami [Nushair bin Faraj] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membuat cincin dari emas, beliau menghadapkan mata cincinnya ke arah telapak tangan, dan beliau memberi ukiran pada cincin itu dengan tulisan 'Muhammad Rasulullah'. Orang-orang lalu ikut membuat cincin dari emas, ketika beliau melihat mereka membuat cincin seperti itu, beliau membuang cincinnya seraya mengatakan: \"Selamanya aku tidak akan memakainya lagi.\" Kemudian beliau membuat cincin dari perak dan memberi ukiran pada cincin tersebut 'Muhammad Rasulullah'. Cincin itu kemudian dipakai oleh Abu Bakar, kemudian Umar, kemudian Utsman hingga akhirnya cincin tersebut jatuh ke dalam sumur Aris.\" Abu Dawud berkata, \"Orang-orang belum berselisih dengan Utsman hingga cincin itu jatuh dari tangannya (ke dalam sumur).\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub bin Musa] dari [Nafi'] dari [Ibnu Umar] tentang hadits ini, dari Nabi shallallahu 'alaihi wasallam, \"Beliau memberi ukiran 'Muhammad Rasulullah', dan beliau bersabda: \"Janganlah seseorang membuat ukiran sebagaimana ukiran yang aku buat ini.\" kemudian ia menyebutkan hadits secara lengkap. Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Abu Ashim] dari [Al Mughirah bin Ziyad] dari [Nafi'] dari [Ibnu Umar] seperti hadits ini, dari Nabi shallallahu 'alaihi wasallam, ia menyebutkan, \"Orang-orang lalu mencari cincin itu namun tidak ketemu. Maka Utsman pun membuat cincin lagi dan memberi ukiran 'Muhammad Rasulullah'.\" Ibnu Umar berkata, \"Utsman lantas memberi setempel dengan cincin tersebut",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 5
			}
		}
	]
}