{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4244,
			"arabicnumber": 4244,
			"text": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Nashr bin Ashim] dari [Subai' bin Khalid] ia berkata, \"Aku pernah datang ke Kufah saat penaklukan kota Tustar tempat yang biasa aku membeli domba. Aku lantas masuk ke sebuah masjid, orang-orang banyak berkumpul, dan ternyata di sana ada seorang lelaki -jika kamu melihat, kamu akan tahu bahwa ia dari wilayah Hijaz; Makkah dan Madinah-. Aku bertanya, \"Siapakah lelaki ini?\" orang-orang memandangiku dengan sorotan tajam, mereka berkata, \"Engkau tidak tahu orang ini! ini adalah [Hudzaifah Ibnul Yaman], seorang sahabat Rasulullah shallallahu 'alaihi wasallam.\" Hudzaifah lalu berkata, \"Orang-orang banyak bertanya Rasulullah shallallahu 'alaihi wasallam tentang kebaikan, sementara aku bertanya beliau tentang keburukan.\" Orang-orang sepontan memperhatikan Hudzaifah dengan pandangan tajam, Hudzaifah melanjutkan, \"Aku tahu apa yang kalian ingkari (cemaskan). Aku pernah bertanya kepada Rasulullah, \"Wahai Rasulullah, apakah setelah kebaikan yang Allah berikan kepada kita ini, akan muncul keburukan setelahnya seperti masa-masa sebelumnya?\" Beliau menjawab: \"Benar.\" Aku bertanya lagi, \"Bagaimana bisa selamat dari hal itu?\" beliau menjawab: \"Dengan pedang.\" Aku bertanya lagi, \"Wahai Rasulullah, lantas apa yang bakal terjadi?\" Beliau menjawab: \"Jika Allah mempunyai Khalifah di muka bumi, lalu ia memukul punggung dan mengambil hartamu, maka taatilah ia. Jika tidak begitu, maka matilah kamu dalam keadaan menggigit akar pohon (tidak taat dan pergi menyepi).\" Aku bertanya lagi, \"Lalu apa yang akan terjadi?\" beliau menjawab: \"Akan muncul dajjal dengan membawa sungai dan api. Siapa yang jatuh ke dalam apinya, maka ia akan mendapatkan pahala dan akan dihapus dosanya. Dan siapa yang jatuh ke dalam sungainya, maka ia akan mendapat dosa dan digugurkan pahalanya.\" Aku bertanya lagi, \"Lalu apa lagi?\" beliau menjawab: \"Kiamat akan datang.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Qatadah] dari [Nashr bin Ashim] dari [Khalid bin Khalid Al Yasykuri] dengan hadits yang sama. Ia (Hudzaifah) berkata, \"Setelah pedang apa lagi?\" beliau menjawab: \"Akan tersisa kotoran mata (keburukan) dan kerisuhan yang berkedok kedamaian.\" Lalu ia menyebutkan hadits selengkapnya.\" Ia (perawai) berkata, \"Qatadah menganalogikan 'kotoran mata' adalah peristiwa riddah (pemurtadan) yang ada di masa Abu Bakar. Dan 'kerisuhan yang berkedok kedamaian' adalah upaya damai yang semu.\" Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] berkata, telah menceritakan kepada kami [Sulaiman] -maksudnya Sulaiman bin Al Mughirah- dari [Humaid] dari [Nashr bin Ashim Al Laitsi] ia berkata, \"Kami pernah mendatangi [Al Yasykuri] dalam sebuah rombongan bani Laits, ia bertanya, \"Siapakah orang-orang itu?\" kami menjawab, \"Mereka adalah orang-orang bani Laits. Kami mendatangimu untuk menanyakan seputar hadits Hudzaifah.. lalu ia menyebutkan hadits tersebut. Hudzaifah berkata, \"Aku bertanya, \"Wahai Rasulullah, apakah setelah kebaikan ini akan ada keburukan?\" beliau menjawab: \"Fitnah dan keburukan.\" Aku bertanya lagi, \"Wahai Rasulullah, apakah setelah keburukan ini akan muncul kebaikan?\" beliau menjawab: \"Wahai Hudzaifah, pelajarilah Al-Qur'an dan ikuti apa yang ada di dalamnya.\" Beliau ulangi kata-kata itu hingga tiga kali. Aku bertanya lagi, \"Wahai Rasulullah, apakah setelah keburukan ini ada kebaikan?\" beliau menjawab: \"Kericuhan berkedok kedamaian, dan kelompok yang diselimuti oleh kekufuran.\" Aku berkata, \"Wahai Rasulullah, maksud kerisuhan berkedok kedamaian itu apa?\" beliau menjawab: \"Jika hati orang-orang tidak lagi sebagaimana fitrahnya.\" Aku bertanya lagi, \"Wahai Rasulullah, apakah setelah kebaikan ini akan muncul keburukan?\" beliau menjawab: \"Fitnahnya orang yang buta dan tuli (dari kebenaran), mereka mempunyai penyeru-penyeru yang berada di pintu neraka. Wahai Hudzaifah, jika engkau mati dalam keadaan menggigit akar pohon (pergi menjauh), maka itu lebih baik dari pada kamu mengikuti mereka.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits] berkata, telah menceritakan kepada kami [Abu At Tayyah] dari [Shakhr bin Badr Al 'Ijli] dari [Subai' bin Khalid] dengan hadits ini, dari [Hudzaifah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika pada hari itu engkau tidak mendapatkan seorang khalifah (yang adil), maka menjauhlah hingga engkau mendapati kematian, meskipun engkau mati dalam keadaan menggigit akar pohon.\" Dan pada penghujung hadits Hudzaifah berkata, \"Aku bertanya, \"Apa yang akan terjadi setelah itu?\" beliau menjawab: \"Andai kala itu ada seorang laki-laki yang mengawinkan kuda, maka ia tidak akan mendapatkan hasil hingga datang kiamat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 5
			}
		}
	]
}