{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"37": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4270,
			"arabicnumber": 4270,
			"text": "Telah menceritakan kepada kami [Muammal Ibnul Fadhl Al Harrani] berkata, telah menceritakan kepada kami [Muhammad bin Syu'aib] dari [Khalid bin Dihqan] ia berkata, \"Saat kami sedang berada dalam peperangan Qastantiniyah di daerah Dzuluqyah, seorang laki-laki terpandang dan paling baik dari penduduk Palestina, orang-orang biasa memanggilnya dengan nama Hani bin Kultsum bin Syarik Al Kinani, datang seraya mengucapkan salam kepada [Abullah bin Abu Zakariya]. Orang yang tahu akan kedudukannya -Hani-. lalu Khalid berkata kepada kami, \"Abdullah bin Abu Zakariya telah menceritakan kepadaku, ia berkata; Aku mendengar [Ummu Darda] berkata, \"Aku mendengar [Abu Darda] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dosa berharap bisa diampuni oleh Allah kecuali seseorang yang meninggal dalam keadaan musyrik, atau seorang mukmin yang membunuh mukmin lainnya dengan sengaja.\" [Hani bin Kultsum] berkata, \"Aku mendengar [Mahmud bin Ar Rabi'] menceritakan dari [Ubadah bin Ash Shamit], Bahwasanya ia pernah mendengarnya menceritakan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membunuh seorang mukmin dengan zhalim, maka Allah tidak akan menerima taubat atau ibadah sunahnya.\" [Khalid] lantas berkata lagi kepada kami; [Ibnu Abu Zakariya] menceritakan kepadaku dari [Ummu Darda], dari [Abu Darda], dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang mukmin akan senantiasa dalam keshalihan selama ia tidak terlumuri darah yang haram (membunuh), jika berlumuran maka ia telah terjerumus dalam kehancuran.\" Hani bin Kultsum juga menceritakan dari Mahmud bin Ar Rabi', dari Ubadah bin Ash Shamit, dari Rasulullah shallallahu 'alaihi wasallam, persis sebagaimana hadits tersebut. Telah menceritakan kepada kami 'Abdurrahman bin Amru dari Muhammad bin Mubarak berkata, telah menceritakan kepada kami Shadaqah bin Khalid atau selainnya, ia berkata; Khalid bin Dihqan berkata; Aku bertanya kepada Yahya bin Yahya Al Ghassani tentang sabda beliau, 'membunuhnya dengan zhalim'? ia menjawab, \"(Yaitu) orang-orang yang saling bunuh dalam fitnah hingga salah seorang dari mereka terbunuh, namun ia melihat bahwa dirinya di atas petunjuk dan tidak meminta ampun kepada Allah -yaitu dari dosa membunuh tersebut-.\" Abu Dawud berkata, \"Maka kata I'tabatha adalah menumpahkan darah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 31
			}
		}
	]
}