{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"38": "The Promised Deliverer (Kitab Al-Mahdi)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4282,
			"arabicnumber": 4282,
			"text": "Telah menceritakan kepada kami [Musaddad] bahwa [Umar bin Ubaid] menceritakan kepada mereka. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al 'Ala] berkata, telah menceritakan kepada kami [Abu Bakr] -maksudnya Abu Bakar bin 'Ayyasy-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepada kami [Ubaidullah bin Musa] berkata, telah mengabarkan kepada kami [Zaidah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepadaku [Ubaidullah bin Musa] dari [Fithr] dengan makna hadits yang sama. Dan semuanya dari [Ashim] dari [Zir] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya dunia ini tidak tersisa kecuali hanya sehari, Zaidah menyebutkan dalam haditsnya, \"maka Allah akan memanjangkan hari itu, \" kemudian mereka bersepakat -dalam menyebutkan lafadz- hingga Allah mengutus seorang laki-laki dariku, atau dari keluargaku; namanya mirip dengan namaku, dan nama bapaknya juga mirip dengan nama bapakku. Dalam hadits Fithr ditambahkan, \"Ia akan memenuhi bumi dengan keadilan, sebagaimana kezhaliman dan kelaliman pernah memenuhinya.\" Dalam hadits riwayat Sufyan beliau mengatakan: \"(Dunia) tidak akan pergi, atau tidak akan hancur hingga seorang laki-laki dari ahli baitku menguasai Arab; namanya seperti namanku.\" Abu Daud berkata; \"lafadz hadits Umar dan Abu Bakar semakna dengan lafadz Abu Sufyan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 38,
				"hadith": 4
			}
		}
	]
}