{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"39": "Battles (Kitab Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4326,
			"arabicnumber": 4326,
			"text": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Utsman bin 'Abdurrahman] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Az Zuhri] dari [Abu Salamah] dari [Fatimah binti Qais] berkata, \"Pada suatu malam pernah Rasulullah shallallahu 'alaihi wasallam mengakhirkan shalat isya` yang akhir, lalu beliau keluar dan bersabda: \"Sesungguhnya yang menghalangiku (untuk segera keluar) adalah kisah yang diceritakan Tamim Ad Dari kepadaku dari seorang laki-laki yang berada di sebuah pulau dari gugusan pulau-pulau. Tamim berkata, \"Saat itu tiba-tiba ada seorang wanita yang berambut panjang.\" Tamim selanjutnya bertanya, \"Siapa kamu?\" Ia menjawab, \"Aku adalah Jasasah. Pergilah kamu ke istana itu.\" Tamim berkata, \"Aku pun mendatanginya, ternyata di sana ada seorang laki-laki berambut panjang yang terikat dengan sebuah rantai. Tingginya menjulang antara langit dan bumi. Aku lalu bertanya, \"Siapa kamu?\" Ia menjawab, \"Aku adalah Dajjal. Apakah telah ada seorang Nabi buta huruf yang diutus?\" Aku menjawab, \"Ya.\" Ia kembali bertanya, \"Apakah orang-orang mentaatinya atau mengingkarinya?\" Aku menjawab, \"Orang-orang mentaatinya.\" Ia berkata, \"Itu yang lebih baik bagi mereka.\" Telah menceritakan kepada kami [Hajjaj bin Abu Ya'qub] berkata, telah menceritakan kepada kami [Abdu Ash Shamad] berkata, telah menceritakan kepada kami [Bapakku] ia berkata; Aku mendengar [Husain Al Mu'allim] berkata, telah menceritakan kepada kami [Abdullah bin Buraidah] berkata, telah menceritakan kepada kami [Amir bin Syurahil Asy Sya'bi] dari [Fatimah binti Qais] ia berkata; Aku mendengar tukang adzan Rasulullah shallallahu 'alaihi wasallam menyeru 'Ash Shalatu Jami'ah (shalatlah berjamaah) ', maka aku keluar dan ikut shalat berjamaah bersama Rasulullah shallallahu 'alaihi wasallam. Ketika Rasulullah shallallahu 'alaihi wasallam selesai dari shalatnya, beliau duduk sambil tertawa, beliau bersabda: \"Hendaklah setiap orang tetap di tempat shalatnya (duduk).\" Kemudian beliau melanjutkan sabdanya: \"Apakah kalian tahu, kenapa aku kumpulkan kalian di sini?\" Para sahabat, \"Allah dan Rasul-Nya lebih tahu.\" Beliau bersabda: \"Aku kumpulkan kalian bukan atas sesuatu yang membuat takut atau senang, namun aku kumpulkan kalian adalah karena Tamim Ad Dari, seorang lelaki Nashrani yang datang dan berbaiat masuk Islam, ia menceritakan kepadaku sebuah kisah yang mirip dengan cerita yang pernah aku ceritakan kepada kalian tentang Dajjal. Ia ceritakan kepadaku bahwasanya ia pernah menaiki sebuah perahu bersama tiga puluh laki-laki dari kaum Lakhm dan Judzam, mereka kemudian diombang-ambingkan oleh ombak selama satu bulan di tengah laut, sampai akhirnya mereka menepi ke sebuah pulau saat matahari terbenam. Mereka lantas duduk di sisi kapal mereka, setelah itu mereka bergegas memasuki pulau tersebut hingga akhirnya bertemu dengan binatang melata besar dan berbulu lebat. Mereka berkata, \"Celaka engkau, siapa kamu ini!\" binatang itu menjawab, \"Aku adalah Jasasah. Temuilah laki-laki yang ada dalam sebuah gua, karena ia sangat berkeinginan untuk mendengar berita dari kalian.\" Tamim berkata, \"Saat ia menyebut laki-laki, maka kami ketakutan jikalau dia adalah setan lalu kami cepat pergi hingga memasuki gua tersebut. Dan ternyata di dalamnya terdapat manusia yang paling besar yang pernah kami lihat, talinya sangat kuat, dan tangannya menyatu dengan leher (terikat dengan rantai).\" Lalu perawi menyebutkan hadits tersebut dengan lengkap. Manusia besar (Dajjal) itu bertanya kepada mereka tentang Nakhl Baisan (nama tempat dekat Yordania), mata air Zughar (nama tempat di Syam) dan seorang Nabi yang buta huruf. Manusia besar itu berkata, \"Aku adalah Al Masih Dajjal, dan hampir-hampir aku mendapat izin untuk segera keluar.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Sesunggunya ia (Dajjal) berada di laut Syam, atau laut Yaman. Bahkan ia akan muncul dari arah timur tempat ia berasal -beliau ucapkan hingga dua kali seraya menunjuk ke arah timur-. Fatimah berkata, \"Aku hafal perkataan ini dari Rasulullah shallallahu 'alaihi wasallam, lalu ia menyebutkan hadits selengkapnya.\" Telah menceritakan kepada kami [Muhammad bin Shadran] berkata, telah menceritakan kepada kami [Al Mu'tamir] berkata, telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Mujalid bin Sa'id] dari [Amir] ia berkata; [Fatimah bin Qais] menceritakan kepadaku bahwa pernah Nabi shallallahu 'alaihi wasallam shalat zhuhur kemudian naik ke atas mimbar, padahal sebelum hari itu beliau tidak penah naik ke atas mimbar tersebut kecuali di hari jum'at. Kemudian beliau menyebutkan kisah ini.\" Abu Dawud berkata, \"Ibnu Shadran adalah orang Bashrah, ia pernah tenggelam di lautan bersama Ibnu Miswar, dan tidak ada yang selamat dari mereka selain dia.\" Telah menceritakan kepada kami [Washil bin Abdul A'la] berkata, telah mengabarkan kepada kami [Ibnu Fudhail] dari [Al Walid bin Abdullah bin Jumai'] dari [Abu Salamah bin 'Abdurrahman] dari [Jabir] ia berkata, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Ketika ada beberapa orang berlayar di lautan, makanan mereka hilang (habis), lalu tampaklah oleh mereka sebuah pulau. Mereka pun menuju pulau tersebut untuk mencari roti, namun mereka dihadang oleh Jasasah.\" Aku (Walid bin Abdullah) lantas bertanya kepada Abu Salamah, \"apa itu Jassasah?\" Ia menjawab, \"Seorang wanita yang rambutnya menutupi kulit dan kepalanya. Wanita itu berkata, \"Dalam istana ini.\" Lalu ia menceritakan haditsnya, dan ia bertanya tentang Nakhl Baisan dan mata air Zughar, ia menjawab; \"Dia adalah Al Masih\", maka Abu Salamah berkata kepadaku; Dalam hadits ini ada beberapa lafadz yang tidak aku hafal. Abu Salamah berkata, \"Jabir bersaksi bahwa laki-laki itu adalah Ibnu Shayyad.\" Aku berkata, \"Tapi Ibnu Shayyad telah mati!\" Jabir menjawab, \"Meskipun ia telah mati.\" Aku bertanya lagi, \"Ia juga telah masuk Islam.\" Jabir berkata, \"Meskipun ia telah masuk Islam.\" Aku bertanya, \"Ia juga telah masuk ke kota Madinah.\" Jabir menjawab, \"Meskipun ia telah masuk kota Madinah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 36
			}
		}
	]
}