{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"39": "Battles (Kitab Al-Malahim)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] berkata, telah menceritakan kepada kami [Yunus bin Rasyid] dari [Ali bin Badzimah] dari [Abu Ubaidah] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kemaksiatan pertama kali yang terjadi pada bani Isra'il adalah ketika seorang laki-laki berjumpa seorang laki-laki lain, ia berkata, \"Wahai saudaraku, bertakwalah kepada Allah, tinggalkan apa yang telah engkau lakukan, karena itu tidak halal untuk kamu lakukan.\" Kemudian keesokan harinya ia berjumpa lagi dengannya, namun perbuatan maksiat yang ia larang (kepada temannya) tidak mencegah dirinya untuk menjadikannya sebagai teman makan dan minum serta duduknya (yakni ikut bersama dalam kemaksiatan), maka ketika mereka melakukan hal itu, Allah menghitamkan hati sebagian mereka karena sebab sebagian yang lain. Kemudian beliau membaca: (Telah dila'nati orang-orang kafir dari Bani Israil dengan lisan Daud dan 'Isa putera Maryam) hingga firmannya: (orang-orang yang fasik) '. Kemudian beliau bersabda; \"Demi Allah hendaklah kalian benar-benar memerintahkan kebaikan, mencegah kemungkaran dan mencabutnya dari tangan orang zhalim lalu mengambalikannya (membelokkannya) kepada kebenaran serta konsisten terhadap kebenaran itu.\", telah menceritakan kepada kami [Khalaf bin Hisyam] telah menceritakan kepada kami [Abu Syihab Al Hannath] dari [Al 'Ala` bin Al Musayyib] dari [Amru bin Murrah] dari [Salim] dari [Abu Ubaidah] dari [Ibnu Mas'ud] dari Nabi shallallahu 'alaihi wasallam seperti hadits tersebut, dengan tambahan redaksi; \"atau (jika tidak) Allah benar-benar akan menutup hati kalian karena (tutupnya) sebagian yang lain, kemudian melaknat kalian sebagaimana telah melaknat mereka (orang-orang bani Israil).\", Abu Daud berkata; [Al Muharibi] telah meriwayatkan hadits ini dari [Al 'Ala` bin Al Musayyib] dari [Abdullah bin Amru bin Murrah] dari [Salim Al Afthas] dari [Abu Ubaidah] dari [Abdullah], dan [Khalid] meriwayatkan hadits ini dari [Al 'Ala`] dari [Amru bin Murrah] dari [Abu Ubaidah]",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 39,
				"hadith": 46
			}
		}
	]
}