{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4361,
			"arabicnumber": 4361,
			"text": "Telah menceritakan kepada kami [Abbad bin Musa Al Khuttali] berkata, telah mengabarkan kepada kami [Isma'il bin Ja'far Al madani] dari [Isra'il] dari [Utsman Asy Syahham] dari [Ikrimah] ia berkata, [Ibnu Abbas] pernah bercerita kepada kami; \"Seorang laki-laki buta mempunyai Ummul Walad (budak wanita yang dijadikan isteri) yang menghina Nabi shallallahu 'alaihi wasallam, dan ia benar-benar telah melakukannya (penghinaan). Laki-laki itu melarang dan mengancamnya namun ia tidak berhenti dan ia terus melarangnya namun wanita itu tidak menggubris. Ibnu Abbas melanjutkan ceritanya, \"Pada suatu malam wanita itu kembali mencela Nabi shallallahu 'alaihi wasallam, maka laki-laki itu mengambil sebuah pisau tajam dan meletakkan di atas perut wanita itu seraya menusuknya. Laki-laki itu membunuhnya, sementara antara kedua kaki wanita tersebut lahir seorang banyi mungil hingga ia pun berlumuran darah. Ketika hari telah pagi, kejadian tersebut disampaikan kepada Nabi shallallahu 'alaihi wasallam. Beliau lantas mengumpulkan orang-orang dan bersabda: \"Aku bersumpah kepada Allah atas seorang laki-laki, ia telah melakukan suatu perbuatan karena aku, ia dalam kebenaran.\" Kemudian laki-laki buta itu melangkah di antara manusia hingga ia duduk di hadapan nabi shallallahu 'alaihi wasallam. Ia lalu berkata, \"Wahai Rasulullah, aku adalah suaminya. Namun ia mencela dan menghinamu, aku telah melarang dan mengancamnya, namun ia tidak berhenti atau menggubrisnya. Darinya aku telah dikaruniakan dua orang anak yang cakep layaknya bintang yang bersinar, wanita itu sangat sayang kepadaku. Namun, tadi malam ia mencela dan menghinamu, lantas aku mengambil pisau tajam, pisau itu aku letakkan di atas perutnya dan aku tusukkan hingga ia mati.\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Ketahuilah, bahwa darah wanita itu adalah sia-sia (halal)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 11
			}
		}
	]
}