{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 438,
			"arabicnumber": 438,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit Al Bunani] dari [Abdullah bin Rabah Al Anshari] telah menceritakan kepada kami [Abu Qatadah] bahwasanya Nabi Shallallahu alaihi wasallam pernah melakukan suatu safar, tiba-tiba beliau menyimpang dari jalan dan aku pun mengikuti beliau. Beliau bersabda: \"Lihatlah (apakah engkau melihat seseorang)?\" Saya berkata; Ada seorang penunggang kuda, dua, dan tiga. Hingga kami berjalan bertujuh. Beliau lalu bersabda: \"Jagalah shalat kita, yakni shalat Fajar. Lalu telinga-telinga mereka tertutupi (tidak mendengar apa-apa karena tertidur pulas), sehingga tidak ada yang membangunkan mereka kecuali panasnya matahari. Mereka berjalan sebentar, kemudian singgah di suatu tempat dan berwudhu. Bilal mengumandangkan adzan, kemudian mereka shalat sunnah dua rakaat sebelum fajar, lalu shalat fajar dan berjalan kembali. Sebagian mereka berkata kepada sebagian yang lain; Kita telah lalai dalam shalat kita. Maka Nabi Shallallahu alaihi wasallam bersabda: \"Tidak ada sikap lalai dalam tidur, sesungguhnya kelalaian itu hanya ada ketika terjaga. Apabila salah seorang di antara kalian lupa shalat, maka shalatlah ketika dia ingat pada waktu yang sama di keesokan harinya. Telah menceritakan kepada kami [Ali bin Nadlr] telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Al Aswad bin Syaiban] telah menceritakan kepada kami [Khalid bin Sumair] dia berkata; [Abdullah bin Rabah Al Anshari] datang kepada kami dari Madinah, orang-orang Anshar menganggapnya sebagai orang yang fakih. Lalu dia menceritakan kepada kami, dia berkata; Telah menceritakan kepadaku [Abu Qatadah Al Anshari], penunggang kuda Rasulullah Shallallahu alaihi wasallam, dia berkata; Rasulullah Shallallahu alaihi wasallam pernah mengutus pasukan para pemimpin (Jaisy Al Umara`) dengan kisah ini. Dia berkata; Tidak ada yang membangunkan kami kecuali matahari yang telah terbit tinggi. Maka kami pun bangun sangat kaget dan takut karena belum shalat. Nabi Shallallahu alaihi wasallam bersabda: \"Pelan-pelanlah.\" Hingga tatkala matahari telah meninggi, Rasulullah Shallallahu alaihi wasallam bersabda: \"Barangsiapa di antara kalian yang mau shalat sunnah dua rakaat fajar silahkan melakukannya.\" lalu Rasulullah Shallallahu alaihi wasallam memerintahkan adzan shalat, lalu beliau shalat mengimami kami. Seusai shalat beliau bersabda: \"Ketahuilah, sesungguhnya kita bersyukur kepada Allah karena tidak sedang berada pada urusan dunia yang menyibukkan kita dari shalat, akan tetapi ruh-ruh kita ada di tangan Allah Azza wa Jalla, Dia membebaskannya kapan Dia mau. Barangsiapa di antara kalian yang mendapatkan shalat shubuh di esok hari, maka qadla`lah ia bersamanya. Telah menceritakan kepada kami [Amr bin Aun] telah mengabarkan kepada kami [Khalid] dari [Hushain] dari [Ibnu Abu Qatadah] dari [Abu Qatadah] dalam hadits ini. Dia menyebutkan; Rasulullah Shallallahu alaihi wasallam bersabda: \"Sesungguhnya Allah menggenggam ruh-ruh kalian sesuai dengan KehendakNya dan melepaskannya sesuai dengan kehendakNya. Bangkit dan kumandangkanlah adzan shalat.\" Maka mereka pun bangkit dan bersuci, hingga tatkala matahari telah meninggi, Nabi Shallallahu alaihi wasallam berdiri dan shalat mengimami para sahabat. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami ['Abtsar] dari [Hushain] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] dari Nabi Shallallahu alaihi wasallam dengan makna yang sama. Dia menyebutkan; Lalu beliau berwudlu tatkala matahari telah meninggi kemudian shalat mengimami mereka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 48
			}
		}
	]
}