{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4394,
			"arabicnumber": 4394,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Amru bin Hammad bin Thalhah] berkata, telah menceritakan kepada kami [Asbath] dari [Simak bin Harb] dari [Humaid bin Ukhti Shafwan] dari [Shafwan bin Umayyah] ia berkata, \"Aku tidur di dalam masjid dengan berselimut kain seharga tiga puluh dirham. Lalu datang seorang laki-laki dan mencuri kain tersebut dariku. laki-laki itu tertangkap dan dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam. Beliau lantas memerintahkan untuk memotong tangannya. Aku mendatangi beliau dan bertanya, \"Apakah engkau akan memotongnya hanya karena tiga puluh dirham? Padahal bisa saja aku jual kain itu dan pembayarannya ditangguhkan?\" Beliau bersabda: \"kenapa hal tersebut tidak kamu lakukan sebelum kamu membawanya kepadaku?\" Abu Dawud berkata, \"Hadits ini juga diriwayatkan oleh [Zaidah] dari [Simak], dari [Ju'aid bin hujair], ia berkata, \" [Shafwan] tidur…\" [Mujahid] dan [Thawus] juga meriwayatkan, bahwasanya Shafwan tertidur, lalu datang seorang pencuri dan mengambil kain dari bahwa kepalanya.\" [Abu Salamah bin 'Abdurrahman] juga meriwayatkan, ia berkata, \"Maling itu mengambilnya dari bawah kepalanya, tetapi Shafwan terbangun dan berteriak sehingga maling itu tertangkap.\" [Az Zuhri] meriwayatkannya dari [Shafwan bin Abdullah], ia berkata, \"Shafwan tidur di masjid, dan ia menjadikan kain selendangnya sebagai bantal. Lalu datang maling mengambil selendangnya tersebut, tetapi maling itu tertangkap dan dibawa ke hadapan Nabi shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 44
			}
		}
	]
}