{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4413,
			"arabicnumber": 4413,
			"text": "Telah menceritakan kepada kami [Amad bin Muhammad bin Tsabit Al Marwazi] berkata, telah menceritakan kepadaku [Ali bin Al Husain] dari [Bapaknya] dari [Yazid bin An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata tentang firman Allah: '(Dan (terhadap) para wanita yang mengerjakan perbuatan keji, hendaklah ada empat orang saksi diantara kamu (yang menyaksikannya). Kemudian apabila mereka telah memberi persaksian, maka kurunglah mereka (wanita-wanita itu) dalam rumah sampai mereka menemui ajalnya, atau sampai Allah memberi jalan lain kepadanya) ' -Qs. An Nisa: 15-. Allah menyebutkan laki-laki setelah perempuan, kemudian Dia menggabungkan keduanya. Allah berfirman: '(Dan terhadap dua orang yang melakukan perbuatan keji di antara kamu, maka berilah hukuman kepada keduanya, kemudian jika keduanya bertaubat dan memperbaiki diri, maka biarkanlah mereka..) ' -Qs. An Nisa: 16-. Ayat ini kemudian dihapus dengan ayat cambuk, Allah berfirman: '(perempuan yang berzina dan laki-laki yang berzina, maka deralah tiap-tiap seorang dari keduanya seratus kali dera…) ' -Qs. An Nuur: 2-. Telah menceritakan kepada kami Ahmad bin Muhammad bin Tsabit berkata, telah menceritakan kepada kami Musa -maksudnya Musa bin Mas'ud- dari Syibl dari Ibnu Abu Najih dari Mujahid ia berkata, \"Kata 'as sabil' maksudnya adalah hukuman had.\" Mujahid berkata, \"Firman Allah 'maka berilah hukuman kepada keduanya', maksudnya adalah pezina yang masih lajang. Sementara firman Allah 'maka kurunglah mereka (wanita-wanita itu) dalam rumah', maksudnya adalah para janda",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 63
			}
		}
	]
}