{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4440,
			"arabicnumber": 4440,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] bahwa [Hisyam Ad Dustuwa`i] dan [Aban bin Yazid] keduanya menceritakan kepada mereka secara makna, dari [Yahya] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] bahwa ada seorang wanita -dalam hadits Aban ia dari Juhainah- datang kepada Nabi shallallahu 'alaihi wasallam dan mengatakan bahwa dirinya telah berzina dan sedang mengandung. Nabi shallallahu 'alaihi wasallam kemudian memanggil walinya, Rasulullah shallallahu 'alaihi wasallam bersabda kepada wali tersebut: \"Perlakukan ia dengan baik, jika ia telah melahirkan, maka bawalah ia kemari.\" Ketika wanita itu telah melahirkan, ia dibawa ke hadapan nabi shallallahu 'alaihi wasallam, beliau pun memerintahkan agar hukuman dilaksanakan. Pakaian wanita itu kemudian dirapatkan (agar auratnya tidak tersingkap), dan beliau kembali memerintahkan agar hukuman segera dilaksanakan, maka ia pun dirajam. Beliau lalu memerintahkan para sahabatnya (untuk menshalatkannya), mereka pun menshalatinya. Umar lantas berkata, \"Wahai Rasulullah, kenapa engkau menshalatinya padahal ia telah berzina!\" beliau bersabda: \"Demi Dzat yang jiwaku ada dalam tangan-Nya, ia telah bertaubat, dan sekiranya taubatnya dibagikan kepada tujuh puluh penduduk Madinah maka akan mencukupi. Apakah engkau menemukan yang lebih utama dari upaya wanita ini, ia datang sendiri dengan kerelaan hati?\". Namun perawi tidak menyebutkan dari Aban dengan lafadz 'Pakaian wanita itu kemudian dirapatkan (agar auratnya tidak tersingkap) '. Telah menceritakan kepada kami [Muhammad Ibnul Wazir Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] ia berkata, \"Pakaian wanita itu kemudian dirapatkan (agar auratnya tidak tersingkap), maksudnya adalah diikat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 90
			}
		}
	]
}