{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4450,
			"arabicnumber": 4450,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] berkata, telah menceritakan kepada kami [laki-laki Muzainah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Anbasah] berkata, telah menceritakan kepada kami [Yunus] ia berkata; [Muhammad bin Muslim] ia berkata; Aku mendengar [seorang laki-laki] Muzainah, orang yang tekun dalam menuntut ilmu dan menghafalnya, keduanya (Ma'mar dan Yunus) lalu sepakat, sementara kami sedang berada di sisi Sa'id Ibnul Musayyab, ia berkata; telah menceritakan kepada kami dari [Abu Hurairah] -dan ini adalah hadits Ma'mar, dan ini lebih lengkap-, ia berkata, \"Seorang laki-laki yahudi berzina dengan seorang wanita. Lalu sebagian mereka berkata kepada sebagian yang lain, \"Mari kita mendatangi Nabi ini (Muhammad shallallahu 'alaihi wasallam), ia adalah seorang Nabi yang diutus dengan membawa kemudahan, jika nanti ia memberi fatwa kepada kita dengan hukuman selain rajam, hendaklah kita terima, lalu kita gunakan sebagai hujah di sisi Allah 'Ini adalah fatwa dari seorang Nabi di antara para Nabi-Mu'.\" Ia (perawi) berkata, \"Mereka akhirnya mendatangi Nabi shallallahu 'alaihi wasallam yang sedang duduk-duduk di masjid bersama para sahabatnya. Mereka mengatakan, \"Wahai Abul Qasim, apa pendapatmu jika laki-laki dan perempuan melakukan perzinaan?\" Beliau tidak memberi mereka jawaban satu kata pun hingga beliau mendatangi mereka di tempat mereka mengaji. Beliau lalu berdiri di depan pintu seraya bersabda: \"Aku bersumpah kepadamu dengan nama Allah yang telah menurunkan Taurat kepada Musa, hukuman apa yang kalian dapati dalam Kitab suci kalian bagi pezina yang telah menikah?\" mereka menjawab, \"Wajahnya dilumuri arang, lalu dinaikkan himar (dengan saling membelakangi), lalu diarak dan didera.\" Seorang pemuda dari mereka terdiam. Maka ketika Nabi shallallahu 'alaihi wasallam melihat pemuda itu diam, beliau menguatkan sumpah kepadanya agar ia memberi jawaban. Ia pun berkata, \"(Ya Allah), jika engkau (Muhammad) bersumpah kepada kami, maka sesungguhnya kami mendapati dalam kitab Taurat adalah hukuman rajam.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Lalu siapa yang pertama kali kalian ringankan dari hukuman Allah (rajam) tersebut? Pemuda itu menjawab, \"Ketika salah seorang kerabat raja kami berbuat zina, maka hukuman rajam itu ditangguhkan. Kemudian ketika ada salah seorang laki-laki dari suatu kaum berbuat zina dan akan ditegakkan hukuman rajam atasnya, kaumnya ikut menghalang-halanginya. Mereka mengatakan, \"Sahabat kami tidak akan dirajam hingga engkau datang dengan sahabat kamu untuk dirajam (bersama-sama). ' Maka mereka semua akhirnya sepakat dengan hukuman ini.\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Aku akan menghukumi sebagaimana yang ada dalam Taurat.\" Beliau lalu memerintahkan (agar keduanya dirajam), maka keduanya pun dirajam.\" Az Zuhri berkata, \"Telah sampai kabar kepada kami bahwa ayat ini turun berkenaan dengan mereka: '(Sesungguhnya Kami telah menurunkan Kitab Taurat di dalamnya (ada) petunjuk dan cahaya (yang menerangi), yang dengan Kitab itu diputuskan perkara orang-orang Yahudi oleh nabi-nabi yang menyerah diri kepada Allah..) ' dan Nabi shallallahu 'alaihi wasallam adalah termasuk dari para Nabi tersebut",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 100
			}
		}
	]
}