{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"40": "Prescribed Punishments (Kitab Al-Hudud)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4478,
			"arabicnumber": 4478,
			"text": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Abu Dhamrah] dari [Yazid Ibnul Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Seorang yang telah minum khamer didatangkan kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Pukullah ia.\" Abu Hurairah berkata, \"Di antara kita ada yang memukul dengan tangan, sandal dan kain. Ketika beliau beranjak pergi, sebagian kami ada yang mengucapkan, \"Semoga Allah menghinakanmu!\" maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Janganlah kalian mengatakan begitu, jangan kalian bantu setan dalam memperdayanya.\" Telah menceritakan kepada kami [Muhammad bin Daud bin Abu Najiyah Al Iskandarani] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yahya bin Ayyub] dan [Haiwah bin Syuraih] dan [Ibnu Lahi'ah] dari [Ibnul Had] dengan sanad dan maknanya. Setelah pemukulan (terhadap peminum khamer), ia menyebutkan dalam haditsnya, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Jelekkanlah ia.\" Maka orang-orang kembali menemui peminum khamer itu dan berkata, \"Kamu tidak bertakwa kepada Allah!\" Ada yang berkata, \"Kamu tidak takut kepada Allah!\" Ada yang berkata, \"Kamu tidak punya malu kepada Rasulullah shallallahu 'alaihi wasallam! ' Kemudian mereka membebaskan orang tersebut. Dan diakhir ucapannya, beliau mengatakan: \"Jangan kalian katakan yang demikian, tetapi ucapkanlah 'Ya Allah ampunilah ia, ya Allah rahmatilah ia'.\" Dan sebagian mereka ada yang menambahkan kalimat dan semisalnya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 40,
				"hadith": 128
			}
		}
	]
}