{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4510,
			"arabicnumber": 4510,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri] berkata, telah menceritakan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata, \" [Jabir bin Abdullah] pernah menceritakan bahwa seorang wanita Yahudi dari penduduk Khaibar menaburi racun pada daging kambing panggang. Kemudian ia menghadiahkan daging itu kepada Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam lantas mengambil lengan kambing tersebut dan memakannya bersama para sahabatnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka semua: \"Angkatlah tangan kalian semuanya (jangan dimakan lagi).\" Rasulullah shallallahu 'alaihi wasallam kemudian mengirim utusan untuk memanggil wanita Yahudi tersebut. Lalu beliau bertanya kepada wanita itu: \"Apakah kamu memberi racun pada daging ini?\" wanita Yahudi itu menjawab, \"Siapa yang memberimu kabar?\" beliau menjawab: \"Yang memberiku kabar adalah apa yang ada di tanganku ini.\" wanita Yahudi itu berkata, \"Benar.\" Beliau bertanya lagi: \"Apa yang kamu inginkan?\" wanita Yahudi itu menjawab, \"Dalam hati aku berkata, 'Jika dia memang seorang Nabi maka dia tidak akan mendapatkan bahaya, tetapi jika bukan seorang Nabi maka kami dapat beristirahat darinya'. Rasulullah shallallahu 'alaihi wasallam lalu memaafkan wanita Yahudi tersebut dan tidak menghukumnya. Para sahabat beliau yang ikut makan daging kambing itu meninggal, sementara Rasulullah shallallahu 'alaihi wasallam membekam pada bagian tengkuknya karena daging yang dimakannya. Lalu beliau dibekam oleh Abu Hind -seorang mantan budak bani Bayadhah dari kaum Anshar- dengan menggunakan tanduk dan pisau tajam.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] berkata, telah menceritakan kepada kami [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah diberi hadiah kambing panggang oleh seorang wanita Yahudi Khaibar, seperti dalam hadits Jabir. Ia (perawi) berkata, \"Bisyr bin Al Bara bin Ma'rur Al Anshari meninggal dunia (karena makan daging kambing), maka Rasulullah mengutus seseorang untuk menjemput wanita Yahudi tersebut. Beliau bersabda: \"Apa yang mendorongmu untuk melakukan itu?\" kemudian disebutkan sebagaimana dalam hadits Jabir. Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan supaya wanita itu dihukum, maka wanita itu pun dibunuh. Namun ia tidak menyebutkan tentang cerita bekam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 17
			}
		}
	]
}