{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"41": "Types of Blood-Wit (Kitab Al-Diyat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4534,
			"arabicnumber": 4534,
			"text": "Telah menceritakan kepada kami [Muhammad bin Dawud bin Sufyan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam mengutus Abu Jahm bin Hudzaifah sebagai penengah dalam persengketaan. Namun ada seorang laki-laki laki-laki yang memutar balikkan fakta hingga Abu jahm memukulnya hingga cidera. Mereka pun mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, kami minta qishsash! ' Rasulullah shallallahu 'alaihi wasallam kemudian berkata, \"Bagi kalian begini dan begini, \" namun mereka tidak rela. Beliau bersabda lagi: \"Bagi kalian begini dan begini, \" namun mereka tidak rela. Beliau bersabda lagi: \"Bagi kalian begini dan begini, ' mereka akhirnya rela. Setelah itu Nabi shallallahu 'alaihi wasallam bersabda: \"Aku akan berpidato di hadapan orang-orang petang nanti dan mengabarkan kepada mereka bahwa kalian telah rela.\" Mereka menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam lalu berpidato: \"Orang-orang bani Laits telah mendatangiku menginginkan qishsas, lalu aku tawarkan kepada mereka begini dan begini hingga mereka rela, maka apakah kalian juga rela?\" Mereka menjawab, \"Tidak.\" Orang-orang Muhajirin ingin menghajar mereka, namun Rasulullah shallallahu 'alaihi wasallam melarang mereka melakukan hal itu, sehingga mereka pun menahan diri. Kemudian beliau memanggil mereka semua dan berpidato lagi: \"Apakah kalian ridha?\" Mereka menjawab, \"Ya.\" Beliau bersabda: \"Aku akan berpidato di hadapan orang-orang untuk mengabarkan kepada mereka bahwa kalian telah ridha.\" Para sahabat menjawab, \"Ya.\" maka Nabi shallallahu 'alaihi wasallam berpidato seraya berkata: \"Apakah kalian ridha?\" Mereka menjawab, \"Ya",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 41,
				"hadith": 41
			}
		}
	]
}