{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4607,
			"arabicnumber": 4607,
			"text": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Tsaur bin Yazid] ia berkata; telah menceritakan kepadaku [Khalid bin Ma'dan] ia berkata; telah menceritakan kepadaku ['Abdurrahman bin Amru As Sulami] dan [Hujr bin Hujr] keduanya berkata, \"Kami mendatangi [Irbadh bin Sariyah], dan ia adalah termasuk seseorang yang turun kepadanya ayat: '(dan tiada (pula dosa) atas orang-orang yang apabila mereka datang kepadamu, suapaya kami memberi mereka kendaraan, lalu kamu berkata, \"Aku tidak memperoleh kendaraan orang yang membawamu) ' -Qs. At Taubah: 92- kami mengucapkan salam kepadanya dan berkata, \"Kami datang kepadamu untuk ziarah, duduk-duduk mendengar sesuatu yang berharga darimu.\" Irbadh berkata, \"Suatu ketika Rasulullah shallallahu 'alaihi wasallam shalat bersama kami, beliau lantas menghadap ke arah kami dan memberikan sebuah nasihat yang sangat menyentuh yang membuat mata menangis dan hati bergetar. Lalu seseorang berkata, \"Wahai Rasulullah, seakan-akan ini adalah nasihat untuk perpisahan! Lalu apa yang engkau washiatkan kepada kami?\" Beliau mengatakan: \"Aku wasiatkan kepada kalian untuk bertakwa kepada Allah, senantiasa taat dan mendengar meskipun yang memerintah adalah seorang budak habsyi yang hitam. Sesungguhnya orang-orang yang hidup setelahku akan melihat perselisihan yang banyak. Maka, hendaklah kalian berpegang dengan sunahku, sunah para khalifah yang lurus dan mendapat petunjuk, berpegang teguhlah dengannya dan gigitlah dengan gigi geraham. Jauhilah oleh kalian perkara-perkara baru (dalam urusan agama), sebab setiap perkara yang baru adalah bid'ah dan setaip bid'ah adalah sesat",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 12
			}
		}
	]
}