{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4723,
			"arabicnumber": 4723,
			"text": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzar] berkata, telah menceritakan kepada kami [Al Walid bin Abu Tsaur] dari [Simak] dari [Abdullah bin Amirah] dari [Al Ahnaf bin Qais] dari [Al Abbas bin Abdul Muthallib] ia berkata, \"Aku pernah berada di wilayah Bathha bersama rombongan yang di dalamnya terdapat Rasulullah shallallahu 'alaihi wasallam. Lalu ada awan yang melintasi mereka, beliau melihat awan itu lalu bersabda: \"Kalian menyebut apa ini?\" para sahabat menjawab, \"Awan.\" Beliau bersabda: \"Dan Al Muzn?\" mereka menjawab, \"Ya, (kami juga menyebutnya) Al Muzn.\" Beliau bersabda: \"Dan Al 'Anan?\" mereka menjawab, \"Ya, dan Al 'Anan.\" -Abu Dawud berkata, \"Aku tidak menghafal lafadz Al 'Anan dengan baik- Beliau lalu bertanya: \"Apakah kalian tahu berapa jarak antara langit dan bumi?\" mereka menjawab, \"Kami tidak tahu.\" Beliau bersabda: \"Sesungguhnya jarak antara keduanya adalah bisa tujuh puluh satu, atau tujuh puluh dua, atau tujuh puluh tiga tahun perjalanan -perawi masih ragu-. kemudian langit yang di atasnya juga seperti itu.\" Hingga beliau menyebutkan tujuh langit. Kemudian setelah langit ketujuh terdapat lautan, jarak antara bawah dan atasnya seperti jarak antara langit dengan langit (yang lain). Kemudian di atasnya terdapat delapan malaikat yang jarak antara telapak kaki dengan lututnya sejauh langit dengan langit yang lainnya. Dan di atas mereka terdapat Arsy, yang antara bagian bawah dengan atasnya sejauh antara langit satu dengan langit yang lainnya. Dan Allah Tabaraka Wa Ta'ala ada di atasnya.\" Telah menceritakan kepada kami [Ahmad bin Abu Suraij] berkata, telah mengabarkan kepada kami ['Abdurrahman bin Abdullah bin Sa'd] dan [Muhammad bin Sa'id] keduanya berkata; telah mengabarkan kepada kami [Amru bin Abu Qais] dari [Simak] dengan sanad dan makna yang sama. Telah menceritakan kepada kami [Ahmad bin Hafsh] ia berkata; telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Simak] dengan sanad yang sama dan makna hadits ini yang panjang",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 128
			}
		}
	]
}