{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"42": "Model Behavior of the Prophet (Kitab Al-Sunnah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4726,
			"arabicnumber": 4726,
			"text": "Telah menceritakan kepada kami [Abdul A'la bin Hammad] dan [Muhammad Ibnul Mutsanna] dan [Muhammad bin Basysyar] dan [Ahmad bin Sa'id Ar Ribathi] mereka berkata; telah menceritakan kepada kami [Wahb bin Jarir] -Ahmad berkata, \"Kami menulisnya dari buku catatannya, dan ini adalah lafadznya.\"- ia berkata; telah menceritakan kepada kami [Bapakku] ia berkata; Aku mendengar [Muhammad bin Ishaq] ia menceritakan dari [Ya'qub bin Utbah] dari [Jubair bin Muhammad bin Jubair bin Muth'im] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Seorang Arab badui mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, jiwa-jiwa telah berat, keluarga telah lemah, harta berkurang, dan binatang ternak telah binasa. Maka mintalah hujan kepada Allah untuk kami, sesungguhnya kami meminta syafaat dengan perantaramu kepada Allah dan dengan perantara Allah kepadamu.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Celaka kamu! Tidakkah kamu tahu apa yang telah kamu ucapkan?\" Rasulullah shallallahu 'alaihi wasallam kemudian bertasbih kepada Allah, dan beliau masih saja bertasbih hingga (kebencian beliau) bisa diketahui dari wajah para sahabatnya. Kemudian beliau bersabda lagi: \"Celaka kamu! Sesungguhnya Allah tidak boleh dijadikan sebagai perantara atas seorang pun dari hamba-Nya, Allah lebih agung dari untuk sekedar dijadikan sebagai wasilah tersebut. Celaka kamu! Tidak tahukah kamu bagaimana Allah itu? Sungguh, Arsy-Nya ada di atas semua langit-Nya seperti ini -lalu isyarat tangannya beliau mengatakan, 'Seperti Kubah, dan Arsy itu berteriak dan menyeru kepada Allah seperti tunggangan berteriak kepada pengendara karena berat-.\" Ibnu Basysyar menyebutkan dalam haditsnya, \"Sesungguhnya Allah berada di atas Arsy, dan Arsy-Nya ada di atas semua langit-Nya…lalu hadits tersebut disebutkan seluruhnya.\" [Abdul A'la], [Ibnul Mutsanna] dan [Ibnu Basysyar] menyebutkan dari [Ya'qub bin Utbah]. Dan [Jubair bin Muhammad bin Jubair] dari [bapaknya], dari [kakeknya]. Dan hadits ini diriwayatkan dengan sanad Ahmad bin Sa'id, dan inilah yang lebih shahih. hal ini telah disepakati oleh sekelompok ulama, seperti [Yahya bin Ma'in] dan [Ali Ibnul Madini]. Sekelompok ulama juga meriwayatkannya dari Ibnu Ishaq, ini menurut keterangan Ahmad. Dan menurut kabar yang sampai kepadaku bahwa riwayat Abdul A'la, Ibnul Mutsanna dan Ibnu Basysyar dari buku yang sama",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 42,
				"hadith": 131
			}
		}
	]
}