{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4829,
			"arabicnumber": 4829,
			"text": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Aban] dari [Qatadah] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Permisalan seorang mukmin yang membaca Al-Qur'an adalah seperti buah Utrujah, baunya harum dan rasanya enak. Permisalan seorang mukmin yang tidak suka membaca Al-Qur'an adalah seperti buah kurma, rasanya enak namun tidak berbau. Permisalah orang jahat yang membaca Al-Qur'an adalah seperti buah raihanah, baunya harum namun rasanya pahit. Permisalan orang jahat yang tidak suka membaca Al-Qur'an adalah seperti buah Hanzhalah, rasanya pahit dan tidak berbau. Dan permisalan kawan yang baik adalah seperti pemakai minyak wangi, jika kamu tidak mendapatkannya maka kamu mendapatkan bau harumnya, Dan permisalan kawan yang buruk adalah seperti tukang besi, jika kamu tidak mendapatkan hitamnya, maka paling tidak kamu akan mendapatkan asapnya.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Mu'adz] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam…seperti hadits yang pertama, hingga pada sabdanya: \"…rasanya pahit.\" Ibnu Mu'adz menambahkan, \"Anas berkata, \"Kami memperbincangkan bahwa permisalan seorang kawan yang baik adalah…. hingga akhir hadits.\" Telah menceritakan kepada kami [Abdullah bin Ash Shabbah Al Aththar] berkata, telah menceritakan kepada kami [Sa'id bin Amir] dari [Syubail bin Azrah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Permisalah seorang kawan yang baik …. lalu ia menyebutkan hadits yang semisal",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 57
			}
		}
	]
}