{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 486,
			"arabicnumber": 486,
			"text": "Telah menceritakan kepada kami [Isa bin Hammad] telah menceritakan kepada kami [Al-Laits] dari [Sa'id Al-Maqburi] dari [Syarik bin Abdullah bin Abi Namr] bahwasanya dia telah mendengar [Anas bin Malik] berkata; Ada seorang laki-laki (musyrik) menunggang onta masuk ke Masjid, kemudian dia menderumkan untanya dan mengikatnya, lalu berkata; Siapakah di antara kalian yang bernama Muhammad? Sementara Rasulullah shallallahu 'alaihi wasallam sedang bersandar di antara para sahabat. Maka kami katakana; Ini, orang putih yang sedang bersandar. Lalu laki-laki tersebut berkata kepada beliau; Wahai Ibnu Abdil Muththalib! Maka Rasulullah shallallahu 'alaihi wasallam menyahut kepadanya: \"Ya, saya mendengarmu.\" Laki-laki itu lantas berkata kepada beliau; Sesungguhnya saya bertanya kepadamu, lalu dia pun menyebutkan hadits itu. Telah menceritakan kepada kami [Muhammad bin Amru] telah menceritakan kepada kami [Salamah] telah menceritakan kepadaku [Muhammad bin Ishaq] telah menceritakan kepadaku [Salamah bin Kuhail] dan [Muhammad bin Al-Walid bin Nuwaifi'] dari [Kuraib] dari [Ibnu Abbas] dia berkata; Bani Sa'd bin Bakr mengutus Dlimam bin Tsa'labah untuk menemui Rasulullah shallallahu 'alaihi wasallam, lalu dia menemui beliau dan menderumkan untanya di depan pintu Masjid dan mengikatnya, kemudian dia masuk. Lalu perawi menyebutkan lafazh semisal dengan di atas. Perawi berkata; Laki-laki itu bertanya; Siapakah di antara kalian yang bernama Ibnu Abdil Muththalib? Maka Rasulullah shallallahu 'alaihi wasallam menyahut: \"Sayalah Ibnu Abdil Muththalib.\" Laki-laki itu berkata; Wahai Ibnu Abdil Muththalib. Kemudian dia menyebutkan hadits itu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 96
			}
		}
	]
}