{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 499,
			"arabicnumber": 499,
			"text": "Telah menceritakan kepada kami [Muhammad bin Manshur Ath-Thusi] telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [Ayahku] dari [Muhammad bin Ishaq] telah menceritakan kepadaku [Muhammad bin Ibrahim bin Al-Harits At-Taimi] dari [Muhammad bin Abdullah bin Zaid bin Abdi Rabbih] dia berkata; Telah menceritakan kepadaku [Ayahku, Abdullah bin Zaid] dia berkata; Sewaktu Rasulullah shallallahu 'alaihi wasallam hendak memerintahkan supaya memakai lonceng yang dipukul untuk mengumpulkan orang-orang yang mengerjakan shalat, ada seorang laki-laki berkeliling bertemu denganku, sedang saya dalam keadaan tidur. Ia membawa lonceng di tangannya, maka saya berkata; Wahai hamba Allah, apakah kamu mau menjual lonceng ini? Dia bertanya; Apa yang akan kamu lakukan dengannya? Saya menjawab; Saya akan pakai untuk memanggil orang-orang mengerjakan shalat. Kata orang itu; Maukah saya tunjukan kepadamu yang lebih baik dari itu? Saya katakan kepadanya; Tentu. Orang itu berkata; Engkau ucapkan; \"Allaahu Akbar Allaahu Akbar, Allaahu Akbar Allaahu Akbar (Allah Maha Besar Allah Maha Besar, Allah Maha Besar Allah Maha Besar), Asyhaduan laa ilaaha Illallah, Asyhaduan laa ilaaha Illallah (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah selain Allah, aku bersaksi bahwa tidak ada tuhan yang berhak disembah selain Allah), Ayshadu anna Muhammadar Rasuulallah, Ayshadu anna Muhammadar Rasuulallah (Aku bersaksi bahwasannya Muhammad adalah utusan Allah, Aku bersaksi bahwasannya Muhammad adalah utusan Allah), Hayya 'alash shalaah, Hayya 'alash shalaah (Marlilah kita shalat, Marlilah kita shalat). Hayya 'alal falah, Hayya 'alal falah (Marilah meraih kemenangan, marilah meraih kemenangan). Allaahu Akbar, Allaahu Akbar (Allah Maha Besar, Allah Maha Besar). Laailaaha illallah (Tiada tuhan yang berhak disembah selain Allah). Abdullah berkata; Kemudian orang itu mundur tidak jauh dariku, lalu berkata; Apabila kamu membaca iqamah shalat, ucapkanlah; Allahu Akbar Allahu Akbar, (Allah Maha Besar Allah Maha Besar). Asyhaduan laa ilaaha Illallah, (Aku bersaksi bahwa tidak ada tuhan yang berhak disembah selain Allah). Ayshadu anna Muhammadar Rasuulallah (Aku bersaksi bahwasannya Muhammad adalah utusan Allah), Hayya 'alash shalaah (Marlilah kita shalat). Hayya 'alal falah (Marilah meraiah kemenangan). Qad qaamatish shalat Qad qaamatish shalat (Sungguh shalat telah mulai didirikan Sungguh shalat telah mulai didirikan). Allahu Akbar Allahu Akbar (Allah Maha Besar, Allah Maha Besar). Laailaaha illallah (Tiada tuhan yang berhak disembah selain Allah). Maka keesokan harinya, saya pergi menemui Rasulallah shallallahu 'alaihi wasallam dan memberitahukan kejadian mimpiku itu, maka beliau bersabda: \"Sesungguhnya mimpimu itu adalah mimpi yang benar Insya Allah. Karena itu berdirilah bersama Bilal dan ajarkan kepadanya mimpimu itu, dan hendaklah dia yang adzan, karena suaranya lebih lantang dari suaramu.\" Maka saya pun berdiri bersama Bilal, lalu saya ajarkan kepadanya bacaan-bacaan itu, sementara dia menyerukan adzan itu. Dia berkata; Kemudian Umar bin Al-Khaththab mendengar seruan adzan itu ketika dia sedang berada di rumahnya, lalu dia keluar sambil menarik pakaiannya dan berkata; Demi Dzat yang mengutusmu dengan al-Haq, wahai Rasulullah, sungguh saya telah bermimpi seperti mimpi Abdullah itu. Maka Rasulallah bersabda: \"Maka segala puji hanya bagi Allah. Abu Dawud berkata; Demikian riwayat [Az-Zuhri] dari [Sa'id bin Al-Musayyib] dari [Abdullah bin Zaid], dan disebutkan oleh [Ibnu Ishaq] dari [Az-Zuhri]; Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar. Dan [Ma'mar] dan [Yunus] dari [Az-Zuhri] menyebutkan; Allahu akbar Allahu akbar, tanpa diulangi dua kali",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 109
			}
		}
	]
}