{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "Telah menceritakan kepada kami [An-Nufaili] telah menceritakan kepada kami [Ibrahim bin Isma'il bin Abdil Malik bin Abi Mahdzurah] dia berkata; Saya telah mendengar [kakekku, Abdul Malik bin Abi Mahdzurah] menyebutkan bahwasanya dia telah mendengar [Abu Mahdzurah] berkata; Rasulullah shallallahu 'alaihi wasallam telah mengajarkan kepadaku cara adzan, huruf demi huruf, yaitu: Allaahu Akbar Allaahu akbar, Allahu Akbar Allaahu Akbar, Asyhadu an laa ilaaha' illallaah, Asyhadu an laa ilaaha' illallaah, Asyhadu Anna Muhammadar Rasuulullah, asyhadu Anna Muhammadar Rasuulullah, Asyhadu an laa ilaaha illallaah, asyhadu an laa ilaaha illallaah, Asyhadu anna Muhammadar Rasuulullah, Asyhadu anna Muhammadar Rasuulullah, Hayya 'alas shalaah, hayya 'alas shalaah, hayya 'alal falaah, hayya 'alal falaah. Kata Abu Mahdzurah; Pada adzan shalat subuh beliau mengucapkan: Asshalaatu khairun minan nauum. Telah menceritakan kepada kami [Muhammad bin Dawud Al-Iskandari] telah menceritakan kepada kami [Ziyad bin Yunus] dari [Nafi' bin Umar Al-Jumahi] dari [Abdul Malik bin Abu Mahdzurah] dia telah mengabarkan kepadanya dari [Abdullah bin Muhairiz Al-Jumahi] dari [Abu Mahdzurah] bahwasanya Rasululah shallallahu 'alaihi wasallam telah mengajarinya adzan, beliau mengucapkan: Allaahu akbar Allaahu akbar, Asyhadu an laa ilaaha illallaah, Asyhadu an laa ilaaha illailaah..., kemudian dia menyebutkan seperti tata cara adzan yang disebutkan dalam hadits Ibnu Juraij dari Abdul Aziz bin Abdul Malik dan maknanya, Abu Dawud berkata; Dan di dalam hadits [Malik bin Dinar] dia berkata; Saya telah bertanya kepada [Ibnu Abi Mahdzurah], saya katakan; Ceritakan kepadaku tata cara adzan [ayahmu] dari Rasulullah shallallahu 'alaihi wasallam. Maka dia menyebutkan; lalu berkata, Allaahu Akbar, Allaahu Akbar saja. Demikian juga hadits [Ja'far bin Sulaiman] dari [Ibnu Abi Mahdzurah] dari [pamannya] dari [kakeknya] hanya saja dia menyebutkan; beliau bersabda: \"Kemudian kamu ulangi dengan mengangkat suaramu, Allahu Akbar Allahu Akbar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Munqar"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 115
			}
		}
	]
}