{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 506,
			"arabicnumber": 506,
			"text": "Telah menceritakan kepada kami [Amru bin Marzuq] telah mengabarkan kepada kami [Syu'bah] dari [Amru bin Murrah] dia berkata; Saya telah mendengar [Ibnu Abi Laila] -dari jalur lainnya- Dan telah menceritakan kepada kami [Ibnu Al-Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Amru bin Murrah] saya telah mendengar [Ibnu Abi Laila] berkata; Pelaksanaan shalat itu telah mengalami tiga kali perubahan. Dia berkata; Telah menceritakan kepada kami [Sahabat sahabat kami], bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh saya sangat senang, sekiranya pelaksanaan shalat kaum Muslimin atau Mukminin dapat dijadikan satu (Jama'ah), sehingga saya mempunyai keinginan yang besar untuk menyebarkan orang orang ke kampung-kampung menyerukan waktu shalat kepada orang banyak. Dan saya mempunyai keinginan besar untuk memerintahkan beberapa orang berdiri di atas bangunan bangunan tinggi menyerukan waktu shalat kepada kaum Muslimin, sehingga mereka memukul atau hampir saja memukul kentongan.\" Dia berkata; Maka datang seorang laki laki dari kaum Anshar, lalu berkata; Wahai Rasulullah, sesungguhnya ketika saya pulang, karena sedemikian besar perhatianku terhadap perhatianmu (tentang cara pelaksanaan shalat), saya melihat seorang laki laki seakan akan memakai dua kain hijau. Lalu orang tersebut berdiri di atas masjid dan mengumandangkan adzan. Kemudian dia duduk sebentar, lalu berdiri lagi mengucapkan yang diucapkan sebelumnya, hanya saja dia mengucapkan (untuk yang kedua kalinya) Qad qaamatis shalaah (sholat telah di kerjakan), seandianya bukan karena takut nanti orang-orang akan mengatakan (saya berdusta), Ibnu Al-Mutsanna menyebutkan; seandainya bukan karena takut nanti kalian akan mengatakan (saya berdusta), tentu saya mengatakan bahwa sungguh saya ketika itu dalam keadaan terjaga, tidak tidur. Maka Rasulullah shallallahu 'alaihi wasallam bersabda, -Ibnu Al-Mutsanna menyebutkan; beliau bersabda: - \"Sungguh Allah telah memperlihatkan kepadamu suatu kebaikan -Sedangkan Amru tidak menyebutkan sabda beliau: Allah telah memperlihatkan kepadamu suatu kebaikan-, maka suruhlah Bilal untuk mengumandangkan adzan itu. Katanya; Lalu Umar berkata; Sungguh saya telah bermimpi seperti yang diimpikannya, tetapi karena saya didahului (untuk melaporkan kepada Rasulullah), maka saya merasa malu. Dan telah menceritakan kepada kami para sahabat kami; Biasanya seseorang jika dia datang (terlambat), bertanya kepada sebagian jama'ah itu, maka beritahukan kepadanya raka'at yang telah lewat (tertinggal). Sedangkan waktu itu, jama'ah yang bersama Rasulullah, ada yang berdiri, ada yang ruku, ada yang duduk, dan ada pula yang shalat bersama Rasulullah. Berkata [Ibnu Al-Mutssanna] berkata [Amru] telah menceritakan kepadaku [Hushain] dari [Ibnu Abi Laila] hingga datang Mu'adz. Berkata [Syu'bah] saya telah mendengarnya dari [Hushain], lalu perawi berkata; Saya tidak melihatnya pada keadaan… hingga ucapan: Demikian, maka lakukanlah itu. Abu Dawud berkata; Kemudian saya kembali pada hadits Amru bin Marzuq dia berkata; Mu'adz datang, kemudian mereka mengisyaratkan kepadanya. Syu'bah berkata; Ini saya dengar dari Hushain, dia berkata; Mu'adz berkata; Saya tidak melihatnya dalam satu kedaan melainkan saya padanya. Mu'adz berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Mu'adz telah menunjukkan satu sunnah kepada kalian, maka lakukanlah yang demikian.\" Dia Ibnu Abi Lailah berkata; Sahabat-sahabat kami telah menceritakan kepada kami, bahwasanya ketika Rasulullah shallallahu 'alaihi wasallam datang ke Madinah, beliau memerintahkan berpuasa tiga hari (tiap bulan), lalu turun perintah puasa pada bulan Ramadhan, sedangkan mereka adalah kaum yang tidak terbiasa berpuasa, sehingga puasa terasa amat berat bagi mereka. Maka mereka yang tidak berpuasa memberi makan orang miskin. Lalu turunlah ayat ini (yang artinya): (Karena itu, barangsiapa di antara kamu hadir (di negeri tempat tinggalnya) pada bulan itu, maka hendaklah dia berpuasa pada bulan itu). (Al-Baqarah: 185). Di dalam ayat ini disebutkan bahwa keringanan itu untuk orang sakit dan musafir. Karena itu, mereka diwajibkan berpuasa. Kata Ibnu Abi Lahi'ah; para sahabat kami telah menceritakan kepada kami, katanya; Kebiasaan saat itu, apabila seseorang memasuki waktu berbuka, lalu tidur sebelum makan, maka dia tidak makan malam itu sampai pagi. Dia berkata; Lalu Umar bin Khaththab datang kepada istrinya hendak mengumpulinya, namun istrinya berkata; Sesungguhnya saya telah tidur sebelum makan (berbuka), namun Umar menyangka bahwa istrinya itu hanya beralasan untuk menghindar darinya, karena itu Umar tetap mengumpulinya. Kemudian datang pula seorang laki laki yang berpuasa dari golongan Anshar, lalu dia hendak makan (berbuka), maka keluarganya berkata; Tunggu, kami akan menghangatkan makanan untukmu, Ialu laki laki itu tidur. Maka ketika pagi harinya, turunlah ayat kepada beliau shallallahu 'alaihi wasallam tentang peristiwa ini, ayat tersebut (artinya): \"Dihalalkan bagi kamu pada malam puasa mengumpuli istri istri kamu\". (QS. Albaqarah 187)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 116
			}
		}
	]
}