{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 507,
			"arabicnumber": 507,
			"text": "Telah menceritakan kepada kami [Muhammad bin Al-Mutsanna] dari [Abu Dawud] Al-Hadits. Dan telah menceritakan kepada kami [Nashr bin Al-Muhajir] telah menceritakan kepada kami [Yazid bin Harun] dari [Al-Mas'udi] dari [Amru bin Murrah] dari [Ibnu Abi Laila] dari [Mu'adz bin Jabbal] dia berkata; Pelaksanaan shalat telah mengalami perubahan tiga kali, dan demikian pula pelaksanaan puasa, kemudian Nashr melanjutkan Hadits ini secara panjang lebar. Sedangkan Ibnu Al-Mutsanna hanya menyebutkan kisah shalat mereka yang menghadap Baitul Maqdis. Dia berkata; Cara pelaksanaan shalat yang ketiga; Bahwasanya Rasulullah shallallahu 'alaihi wasallam ketika datang ke Madinah, beliau mengerjakan shalat menghadap ke Baitul Maqdis selama tiga belas bulan, lalu Allah Ta'ala menurunkan ayat ini (yang artinya), \"Sungguh Kami (sering) melihat mukamu menengadah ke langit, maka sungguh Kami akan memalingkan kamu ke kiblat yang kamu sukai. Palingkanlah mukamu ke arah Masjidil Haram. Dan di mana saja kamu berada, palingkanlah mukamu ke arahnya.\" (Al-Baqarah: 144). Maka Allah Ta'ala memalingkan beliau shallallahu 'alaihi wasallam ke Ka'bah. Sampai di sini hadits riwayat Ibnu Al-Mutsanna. Nashr menyebutkan nama orang yang bermimpi, dia berkata; Maka datang Abdullah bin Zaid, seorang laki laki dari golongan Anshar, dalam haditsnya itu dia berkata; Maka laki laki itu menghadap kiblat seraya mengucapkan; Allaahu Akbar, Allaahu Akbar, Asyhadu an laa ilaaha illallah, Asyhadu an laa ilaaha illallaah, Asyhadu anna Muhammadar Rasuulullah, Asyhadu anna Muhammadar Rasuulullah, Hayya 'alas shalaah hayya 'alash shalaah, hayya 'alal falaah hayya 'alal falaah, Allaahu akbar, Allaahu akbar, Laa ilaaha illallaah. Setelah itu dia berhenti sebentar, lalu berdiri mengucapkan kalimat seperti sebelumnya, hanya saja dia menambahkan setelah mengucapkan; Hayya 'alal falaah, dengan ucapan; Qad Qamatis shalaah, qad qamatis shalaah. Mu'adz bin Jabal berkata; Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ajarkanlah (kalimat adzan itu) kepada Bilal\". Maka Bilal pun mengumandangkan adzan dengan kalimat kalimat itu. Kemudian Nasr bin Muhajir menyebutkan tentang perubahan-perubahan perintah puasa. Muadz bin Jabal berkata; Bahwasanya Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan puasa tiga hari setiap bulan, dan pada hari Asyura', kemudian Allah Ta'ala menurunkan ayat (yang artinya): \"Telah diwajibkan atas kalian berpuasa, sebagaimana telah diwajibkan atas orang orang sebelum kamu..., sampai dengan FirmanNya: (yaitu) memberi makan seorang miskin.\" (Al-Baqarah: 183 184). Karena itu siapa yang hendak berpuasa, silahkan berpuasa, dan siapa yang tidak mau berpuasa dan mau memberi makan seorang miskin setiap harinya, maka telah memadai baginya. Dan inilah salah satu keadaan puasa. Lalu Allah Ta'ala menurunkan ayat (yang artinya): \"Bulan Ramadhan, bulan yang di dalamnya diturunkan (permulaan) Al Quran..., sampai FirmanNya: pada hari hari yang lain.\" (Al-Baqarah: 185). Maka berlakulah ketetapan hukum puasa itu wajib atas orang yang mendapatkan bulan Ramadhan, sedangkan orang yang sedang musafir, wajib mengqadla'nya. Dan ditetapkan pula hukum kewajiban memberi makan orang miskin bagi orang tua berusia lanjut dan orang yang lemah, yang tidak mampu lagi berpuasa. Dan datang pula Shirmah, sedangkan dia telah bekerja sehari penuh. Selanjutnya dia (Nashr) menyebutkan Hadits itu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 117
			}
		}
	]
}