{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5185,
			"arabicnumber": 5185,
			"text": "Telah menceritakan kepada kami [Hisyam Abu Marwan] dan [Muhammad Ibnul Mutsanna] secara makna, [Muhammad Ibnul Mutsanna] berkata; telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] ia berkata; Aku mendengar [Yahya bin Abu Katsir] berkata; telah menceritakan kepadaku [Muhammad bin 'Abdurrahman bin As'ad bin Zurarah] dari [Qais bin Sa'd] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengunjungi kami di rumah milik kami, beliau lalu mengucapkan: \"Assalamu Alaikum wa Rahmatullahi.\" Sa'd lalu menjawab salam tersebut dengan suara lirih.\" Qais berkata, \"Aku bertanya, \"Apakah kamu tidak memberi izin kepada Rasulullah shallallahu 'alaihi wasallam?\" Sa'd menjawab, \"Biarkan Rasulullah shallallahu 'alaihi wasallam memperbanyak salam kepada kami.\" Rasulullah shallallahu 'alaihi wasallam kemudian mengucapkan salam lagi: \"Assalamu Alaikum wa Rahmatullahi.\" Sa'd lalu menjawab salam tersebut dengan suara lirih.\" Kemudian Rasulullah shallallahu 'alaihi wasallam kembali mengucapkan salam: \"Assalamu Alaikum wa Rahmatullahi.\" Selah itu Rasulullah shallallahu 'alaihi wasallam kembali pulang, sementara Sa'd mengikutinya dari belakang. Sa'd berkata, \"Wahai Rasulullah, sesungguhnya aku mendengar salammu, dan aku juga telah menjawab salammu dengan suara yang lirih dengan harapan engkau memperbanyak salam kepada kami.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam bersama Sa'd kembali ke rumah Sa'd. Sa'd kemudian mempersilahkan Rasulullah untuk mandi, maka beliau pun mandi. Lalu ia menyediakan handuk yang telah dicelup dengan minyak Za'faran atau Wars (sejenis tumbuhan), sehingga beliau mengelap tubuhnya dengan handuk tersebut. Setelah itu Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya seraya berdoa: \"Ya Allah, jadikanlah shalawat (kesejahteraan) dan rahmat-Mu tercurah kepada keluarga Sa'd bin Ubadah.\" Perawi berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam menyantap makanan, dan ketika beliau ingin berlalu pergi, Sa'd mendekatkan himar yang telah diberi alas selembar kain kepada Rasulullah shallallahu 'alaihi wasallam. Sa'd berkata, \"Wahai Qais, temanilah Rasulullah shallallahu 'alaihi wasallam.\" Qais berkata, \"Rasulullah shallallahu 'alaihi wasallam kemudian berkata kepadaku: \"Naiklah.\" Aku diam. Kemudian beliau berkata lagi: \"Engkau ikut naik atau engkau tidak usah ikut?\" Qais berkata, \"Maka aku pun memutuskan untuk tidak ikut.\" [Hisyam Abu Marwan] menyebutkan dari [Muhammad bin 'Abdurrahman bin As'ad bin Zurarah]. Abu Dawud berkata, \" [Umar bin Abdul Wahid] dan [Ibnu Sama'ah] meriwayatkannya dari [Al Auza'I] secara mursal. Namun keduanya tidak menyebutkan Qais bin Sa'd",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 413
			}
		}
	]
}