{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5233,
			"arabicnumber": 5233,
			"text": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Ya'la bin Atha] dari [Abu Hammam Abdullah bin Yasar] bahwa [Abu 'Abdurrahman Al Fihri] berkata, \"Aku pernah mengikuti perang Hunanin bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami berjalan di hari yang sangat panas. Kemudian kami singgah di bawah pohon yang ridang, saat matahari telah condong ke arah barat aku segera mengenakan peralatan perangku dan naik ke atas kuda. Setelah itu aku mendatangi Rasulullah shallallahu 'alaihi wasallam di dalam kemahnya. Aku katakan kepada beliau, \"Wahai Rasulullah, Assalamu Alaika wa rahmatullahi wa Barakatuh. Sesungguhnya waktu berangkat telah tiba.\" Beliau menjawab, \"Benar.\" Setelah itu beliau berkata kepada Bilal: \"Wahai Bilal, segeralah bangun.\" Maka Bilal pun bangun dari bawah pohon Samurah, seakan-akan bayangannya seperti bayangan burung. Bilal menjawab, \"Aku penuhi panggilanmu dengan senang hati, dan aku sebagai tebusanmu.\" Rasulullah kemudian bersabda: \"Pasanglah pelana kudaku.\" Bilal lalu mengeluarkan mngeluarkan pelana yang terbuat dari tumpukan rerumputan yang tidak ada bekas keburukan dan kesombongan. Beliau kemudian menaiki tungganyanya dan kami mengikutinya…. lalu ia menyebutkan hadits selengkapnya.\" Abu Dawud berkata, \"Abu 'Abdurrahman Al Fihri tidak mempunyai hadits kecuali hanya ini, dan ini adalah hadits yang bagus; diriwayatkan oleh Hammad bin Salamah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 461
			}
		}
	]
}