{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"43": "General Behavior (Kitab Al-Adab)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5237,
			"arabicnumber": 5237,
			"text": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Utsman bin Hakim] ia berkata; telah mengabarkan kepadaku [Ibrahim bin Muhammad bin Hathib Al Qurasyi] dari [Abu Thalhah Al Asadi] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar rumah, lalu beliau melihat bangunan yang tinggi. Beliau lalu bertanya: \"Apa ini?\" para sahabat menjawab, \"Ini adalah bangunan milik si fulan, seorang laki-laki Anshar.\" Anas berkata, \"Rasulullah shallallahu 'alaihi wasallam diam dan hanya memendam dalam hatinya, hingga ketika pemilik bangunan itu datang dan memberi salam kepada Rasulullah shallallahu 'alaihi wasallam di depan orang-orang beliau berpaling darinya. Beliau melakukan hal itu berulang-ulang hingga laki-laki paham bahwa Rasulullah sedang marah dan menghindar darinya. Maka laki-laki itu pun mengeluh kepada para sahabat Rasulullah. Laki-laki itu berkata, \"Demi Allah, aku telah mengingkari Rasulullah shallallahu 'alaihi wasallam.\" Para sahabat berkata, \"Rasulullah keluar dan melihat bangunan milikmu.\" Anas berkata, \"Lalu laki-laki pulang dan menghancurkan rumahnya hingga rata dengan tanah. Ketika suatu hari Rasulullah shallallahu 'alaihi wasallam keluar dan melihat bangunan tersebut telah hilang, beliau pun bertanya: \"Apa yang terjadi dengan bangunan tersebut?\" para sahabat menjawab, \"Pemilik banguan itu pernah mengeluh kepada kami tentang berpalingnya baginda kepadanya, maka kami pun mengabarkan kepadanya. Lalu ia pulang dan menghancurkan rumah miliknya. Rasulullah bersabda: \"Ketahuilah, sesungguhnya setiap bangunan itu akan membawa bencana bagi pemiliknya, kecuali yang tidak, kecuali yang tidak.\" Maksudnya sesuatu yang memang dibutuhkan",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 43,
				"hadith": 465
			}
		}
	]
}