{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 603,
			"arabicnumber": 603,
			"text": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Muslim dan Ibrahim] dengan makna, dari [Wuhaib] dari [Mush'ab bin Muhammad] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Imam itu dijadikan hanyalah untuk diikuti, apabila dia bertakbir maka bertakbirlah kalian dan janganlah kalian bertakbir hingga dia bertakbir, apabila dia rukuk maka rukuklah kalian dan janganlah kalian rukuk hingga dia rukuk, apabila dia mengucapkan, 'Sami'allaahu liman hamidah' (Allah mendengar kepada orang yang memujiNya), maka ucapkanlah, 'Allahumma Rabbanaa Walakal Hamdu' (Ya Allah, wahai Rabb Kami, segala puji hanya bagiMu). Muslim menyebutkan (dengan lafazh); Walakalhamdu. Apabila dia sujud maka sujudlah kalian dan janganlah kalian sujud hingga dia sujud, apabila dia shalat dengan berdiri maka shalatlah kalian dengan berdiri dan apabila dia shalat dengan duduk maka shalatlah kalian semua dengan duduk.\" Abu Dawud menyebutkan; Allahumma Rabbana Lakalhamdu, telah memahamkan saya sebagian sahabat kami, dari [Sulaiman] telah menceritakan kepada kami [Muhammad bin Adam Al-Mishshishi] telah menceritakan kepada kami [Abu Khalid] dari [Ibnu 'Ajlan] dari [Zaid bin Aslam] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya imam itu dijadikan hanyalah untuk diikuti, \" dengan hadits ini, dan dia menambahkan; Dan apabila dia (imam) membaca (Al Quran) maka diamlah kalian. Abu Dawud berkata; Tambahan ini, yakni, \"Dan apabila dia (imam) membaca (Al Quran) maka diamlah kalian\", tidaklah terhafal, dan kesalahan pada kami dari Abu Khalid",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 213
			}
		}
	]
}