{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 764,
			"arabicnumber": 764,
			"text": "Telah menceritakan kepada kami ['Amru bin Marzuq] telah mengabarkan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari ['Ashim Al 'Anazi] dari [Ibnu Jubair bin Muth'im] dari [ayahnya] bahwa dia melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan shalat, -'Amru mengatakan; Aku tidak tahu shalat apa yang sedang di kerjakan beliau- beliau mengucapkan; \"ALLAHU AKBAR KABIIRA, ALLAHU AKBAR KABIIRA, ALLAHU AKBAR KABIIRAW WAL HAMDU LILLAAHI KATSIRA WAL HAMDU LILLAHI KATSIIRA WAL HAMDU LILLAHI KATSIRA WA SUBHAANALLAHI BUKRATA WA ASHIILA -tiga kali- A'UUDZU BILLAHI MINAS SYAITHAANI MIN NAFKHIHI WA NAFSIHI WA HAMAZIHI (Allah Maha Besar sungguh Maha Besar, Allah Maha Besar sungguh Maha Besar, Allah Maha Besar sungguh Maha Besar, dan segala puji bagi Allah dengan pujian yang banyak, segala puji bagi Allah dengan pujian yang banyak, segala puji bagi Allah dengan pujian yang banyak, dan Maha suci Allah pada pagi hari dan sore -sebanyak tiga kali- Aku berlindung kepada Allah dari godaan syetan, dari nafkh-nya, nafts-nya serta hamz-nya.\" Perawi berkata; nafts adalah syairnya, an-nafkh adalah kesombongannya sedangkan hamznya adalah kegilaan.\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Mis'ar] dari [Mis'ar] dari ['Amru bin Murrah] dari [seorang laki-laki] dari [Nafi' bin Jubair] dari [ayahnya] dia berkata; saya mendengar Nabi shallallahu 'alaihi wasallam mengucapkan dalam shalat sunnahnya…\" kemudian dia menyebutkan hadits yang serupa",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 374
			}
		}
	]
}