{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"1": "Purification (Kitab Al-Taharah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 91,
			"arabicnumber": 91,
			"text": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Ibnu 'Ayyasy] dari [Habib bin Shalih] dari [Yazid bin Syuraih Al Hadlrami] dari [Abu Hayy Al Muadzdzin] dari [Tsauban] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga hal yang tidak boleh seorang pun melakukannya; tidak boleh seorang laki-laki mengimami suatu kaum, kemudian mengkhususkan dirinya dalam berdoa tanpa menyertakan mereka, apabila dia melakukannya berarti dia telah mengkhianati mereka. Janganlah dia melihat ke dalam rumah seseorang sebelum dia minta izin, apabila dia melakukannya berarti dia telah memasukinya. Janganlah dia shalat dalam keadaan menahan buang air hingga dia meringankan dirinya (dengan buang air) terlebih dahulu.\" Telah menceritakan kepada kami [Mahmud bin Khalid As Sulami] telah menceritakan kepada kami [Ahmad bin Ali] telah menceritakan kepada kami [Tsaur] dari [Yazid bin Syuraih Al Hadlrami] dari [Abu Hayy Al Muadzdzin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak boleh bagi seseorang yang beriman kepada Allah dan Hari Akhir untuk shalat dalam keadaan menahan buang air hingga dia meringankan dirinya (dengan buang air) terlebih dahulu\", kemudian dia menyebutkan lafazh semisalnya. Dia menyebutkan (sabda Rasulullah shallallahu 'alaihi wasallam): \"Dan tidak boleh bagi seorang laki-laki yang beriman kepada Allah dan Hari Akhir untuk mengimami suatu kaum kecuali dengan izin mereka, serta tidak boleh dia mengkhususkan dirinya dalam berdoa tanpa mengikut sertakan mereka. Apabila dia melakukannya berarti dia telah mengkhianati mereka.\" Abu Dawud berkata; Hadits ini semuanya dari jalur ahli Syam, tidak ada seorang pun yang ikut meriwayatkannya selain mereka",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 91
			}
		}
	]
}