{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 930,
			"arabicnumber": 930,
			"text": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya], dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin Ibrahim] sedangkan makna haditsnya dari [Hajjaj Ash Shawaf] telah menceritakan kepadaku [Yahya bi Abu Katsir] dari [Hilal bi Abu Maimunah] dari ['Atha` bin Yasar] dari [Mu'awiyah bin Al Hakam As Sulami] dia berkata; saya shalat bersama Rasulullah shallallahu 'alaihi wasallam, lalu ada seseorang yang bersin, maka aku mengucapkan; \"Yarhamukalah (semoga Allah merahmatimu) \" karena itu orang-rang mengalihkan pandangannya kepadaku, maka aku berkata; \"Celaka, kenapa kalian memandang kepadaku?\" kemudian mereka menepukkan tangan ke paha mereka, sehingga aku tahu bahwa mereka bermaksud menyuruh aku diam. Utsman mengatakan; \"ketika aku tahu mereka menyuruhku diam, maka aku pun diam. Kata Mu'awiyah; \"demi ayah dan ibuku, ketika Rasulullah shallallahu 'alaihi wasallam selesai shalat, beliau tidak memukulku dan tidak pula membentakku serta tidak memakiku.\" Kemudian beliau bersabda: \"Sesungguhnya shalat ini, tidak halal di dalamnya bercampur dengan sesuatu perkataan manusia, akan tetapi yang ada hanyalah tasbih, takbir dan membaca Al Qur'an atau sebagaimana sabda Rasulullah shallallahu 'alaihi wasallam.\" Aku berkata; \"Wahai Rasulullah, kami adalah suatu kaum yang baru keluar dari kejahiliyahan, lalu Allah menganugerahkan kepada kami agama Islam, namun di antara kami masih ada yang suka mendatangi para normal.\" Beliau menjawab: \"Janganlah kalian mendatangi mereka.\" Mu'awiyah berkata; kataku; \"Dan di antara kami masih ada yang suka tathayyur (meramal nasib dengan burung dan yang lain).\" Beliau bersabda: \"itu hanya ilustrasi hati saja, karena itu janganlah mereka di halangi oleh hal itu.\" Aku bertanya; \"Di antara kami ada juga beberapa yang meramal nasib dengan membuat garis (tharq).\" Beliau bersabda: \"Ada di antara para Nabi yang memperaktekkan cara itu, maka siapa saja yang garisnya tepat dengan garis nabi itu, tepatlah ia.\" Mu'awiyah berkata; aku berkata; \"Aku memiliki seorang budak perempuan yang menggembalakan beberapa ekor kambingku ke arah Uhud dan Jawaniyah, suatu ketika aku pergi menemuinya, tiba-tiba waktu itu ada seekor serigala yang menerkam dan membawa lari seekor kambingku, sebenarnya aku adalah anak Adam yang memiliki belas kasihan kepada orang lain sebagaimana mereka (orang lain). Akan tetapi aku (tidak mampu lagi menahan diri) dan memukul budak perempuan itu, ternyata kejadian itu terasa berat bagiku, akhirnya aku mengadukannya kepada Rasulullah shallallahu 'alaihi wasallam, lalu aku berkata; \"Tidakkah aku memerdekakannya saja?\" beliau bersabda: \"Bawalah ia kepadaku.\" Mu'awiyah berkata; \"Lalu aku bawa dia menghadap beliau, kemudian beliau bersabda: \"Siapakah saya?\" Budak wanita itu menjawab; \"Anda adalah Rasulullah.\" Beliau bersabda: \"Merdekakanlah dia, karena dia wanita yang beriman",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 541
			}
		}
	]
}