{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 931,
			"arabicnumber": 931,
			"text": "Telah menceritakan kepada kami [Muhammad bin Yunus An Nasa`i] telah menceritakan kepada kami [Abdul Malik bin 'Amru] telah menceritakan kepada kami [Fulaih] dari [Hilal bin Ali] dari ['Atha` bin Yasar] dari [Mu'awiyah bin Al Hakam As Sulami] dia berkata; Ketika aku tiba datang menemui Rasulullah shallallahu 'alaihi wasallam, maka aku tahu beberapa perkara Islam, di antara yang aku ketahui adalah, beliau bersabda kepadaku: \"Apabila kamu bersin, maka ucapkanlah \"Al hamdulillah\" dan apabila seseorang bersin, kemudian ia mengucapkan \"Al hamdulillah\" maka katakanlah \"Yarhamukallah (semoga Allah merahmatimu) \" Mu'awiyah melanjutkan; \"Ketika kami mengerjakan shalat bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba seseorang bersin dan mengucapkan \"Al Hamdulillah\", maka sambil mengeraskan suaraku, aku berkata; \"Yarhamukallah.\" Dengan itu, orang-orang mengalihkan pandangan ke arahku, sehingga aku gugup karenanya, kataku; \"Kenapa kalian memandangku dengan pandangan marah.\" Katanya; \"Bertasbihlah kalian.\" ketika Rasulullah shallallahu 'alaihi wasallam selesai dari shalatnya, beliau bersabda: \"Siapakah yang berbicara tadi?\" di jawab; \"Orang arab badui ini.\" lalu Rasulullah shallallahu 'alaihi wasallam memanggilku dan bersabda: \"Sesungguhnya shalat itu untuk membaca Al Qur'an dan berdzikir kepada Allah Jalla wa 'Azza, apabila kamu sedang shalat, maka kamu harus seperti itu (membaca Al Qur'an dan berdzikir).\" Maka aku belum pernah melihat seorang pengajar yang lebih lembut dari Rasulullah shallallahu 'alaihi wasallam",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 542
			}
		}
	]
}