{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"2": "Prayer (Kitab Al-Salat)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 972,
			"arabicnumber": 972,
			"text": "Telah menceritakan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Abu 'Awanah] dari [Qatadah]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Yunus bin Jubair] dari [Hithan bin Abdullah Ar Raqasyi] dia berkata; \"Abu Musa al Asy'ari shalat bersama kami, ketika dia duduk di akhir shalatnya, tiba-tiba seorang laki-laki dari suatu kaum berteriak, katanya; \"Shalat itu telah di tetapkan dengan amal kebaikan dan zakat.\" Ketika Abu Musa selesai dari shalat, dia menemui kaum tersebut tersebut seraya berkata; \"Siapakah di antara kalian tadi yang berkata demikian dan demikian?\" Hithan melanjutkan; \"Maka kaum tersebut diam menunduk. Abu Musa mengulanginya lagi; \"Siapakah di antara kalian tadi yang berkata demikian dan demikian?\" namun kaum tersebut masih diam menunduk.\" Abu Musa berkata; \"Mungkin kamu wahai Hithan, apakah kamu tadi yang mengatakannya?\" Hithan menjawab; \"Aku tidak mengatakannya, sungguh aku khawatir jika kamu mengecamku karena hal itu.\" Hithan melanjutkan; \"Maka seorang laki-laki dari suatu kaum itu berkata; \"Aku lah yang mengatakan ungkapan tadi, tidaklah aku mengatakannya kecuali untuk maksud baik.\" Maka [Abu Musa] berkata; \"Apakah kamu tahu bagaimanakah seharusnya yang kamu katakan dalam shalat? sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah di hadapan kami, beliau mengajari kami, menjelaskan ajaran kami dan mengajarkan tentang shalat kami, beliau bersabda: 'Apabila kalian hendak mengerjakan shalat, maka luruskanlah shaf kalian, dan hendaklah seseorang salah seorang dari kalian menjadi imam, apabila ia (imam) bertakbir, maka bertakbirlah kalian, apabila ia membaca \"Ghairil maghdluubi 'alaihim walad dllaallin\" maka ucapkanlah \"Amin\" niscaya Allah akan mencintai kalian, apabila ia bertakbir dan ruku', maka bertakbirlah dan ruku'lah kalian, sesungguhnya seorang imam itu ruku' sebelum kalian dan mengangkat (kepala) sebelum kalian.\" Rasulullah shallallahu 'alaihi wasallam melanjutkan: \"Maka (gerakkan kamu) itu harus setelah gerakan imam. Apabila imam membaca; \"Sami'allahu liman hamidah\" maka ucapkanlah; \"Allahumma Rabbanaa walakal hamdu\" Allah akan mendengarkan do'amu, sesungguhnya Allah Ta'ala shallallahu 'alaihi wasallam berfirman melalui lisan Nabi-Nya shallallahu 'alaihi wasallam \"sami'allahu liman hamidah\" apabila imam bertakbir dan sujud, maka bertakbir dan sujudlah kalian, karena sesungguhnya imam sujud sebelum kalian dan mengangkat kepalanya sebelum kalian.\" Rasulullah shallallahu 'alaihi wasallam melanjutkan sabdanya: \"Maka (gerakkan kamu) itu harus setelah gerakan imam, dan apabila imam telah duduk (di raka'at terakhir), maka hendaknya ucapan yang pertama kali di ucapkan oleh kalian adalah; \"Attahiyyatu lillah Asshalawatut-thayyibat Assalamu 'alaika ayyuhannabiyyu warahmatullahi wabarakatuh assalaamu 'alaina wa'ala 'ibadillahis-shalihin Asyhadu alla ilaha illallah wa asyhadu anna muhammadan abduhu warasuluhu\" (Segala penghormatan dan kebaktian yang baik hanya bagi Allah, kesejahteraan, rahmat Allah dan berkah-Nya tetap terlimpah kepadamu wahai Nabi, semoga kesejahteraan atas kami dan hamba-hamba Allah yang Shalih, aku bersaksi tidak ada ilah (yang berhak di sembah) kecuali Allah, dan aku bersaksi bahwa Muhammad adalah Rasulullah).\" (dalam riwayatnya) Ahmad tidak menyebutkan \"wabarakaatuh\" tidak pula menyebutkan \"wa asyhadu\" namun dia hanya menyebutkan; \"wa anna muhammadan\" telah menceritakan kepada kami ['Ashim bin An Nadlr] telah menceritakan kepada kami [Al Mu'tamir] dia berkata; saya mendengar [ayahku], telah menceritakan kepada kami [Qatadah] dari [Abu Ghallab] telah menceritakan kepadanya, dari [Hitthan bin Abdullah Ar Raqasyi] seperti hadits tersebut, ia menambahkan; \"Apabila imam membaca (surat), maka diamlah kalian.\" Dia mengatakan setelah tasyahud setelah \"asyhadu allaa ilaaha illallah\" dia menambahkan; \"…wahdahuu laa syariikalah…\" Abu Daud mengatakan; perkataannya \"Maka diamlah kalian\" redaksi tersebut tidaklah terjaga, tidak ada dalam hadits ini, melainkan dari Sulaiman At Taimi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 583
			}
		}
	]
}