{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1027,
			"arabicnumber": 1027,
			"text": "Ebu Zer' (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Biriniz namaza başladığı zaman, şüphesiz ona rahmet yönelir. Bu nedenle sakın (secde yerindeki) çakıllara el sürmesin.» AÇIKLAMA (1025, 1026 ve 1027): Hadis, namaz içinde cakıl taşlarını ellemenin doğru olmadığına delalet eder. Sindi: Cuma namazı bahsinde; \"ve abesle iştigal eden için sevab yoktur.'' buyurulmuştur. Cuma sevabını gideren bir harekette çirkinlik bulunur. Bilhassa hutbeyi dinlemekten alıkoyarsa şüphesiz yasak bir hareket. sayılır, demiştir. Muaykib (r.a.)'ın hadisini Kütüb-i Sitte sahiplerinin hepsi ve Ahmed rivayet etmişlerdir. Buhari'nin rivayeti mealen şöyledir: \"Secde yerinin toprağını (elile) düzelten adama Resulullah (s.a.v.): ''Eğer (secde edeceğinl yerin toprağını düzeltmeye mecbur olursan, (elini) bir defa sür.\"\" Ebu Davud'un rivayetinde Peygamber (s.a.v.)'in buyruğunun meali şudur: ''Sen namazda iken çakıllara el sürme. Eğer mecburiyetten yapacak olursan çakılları tesviye etmek üzere bir defa el sürmek yeter.\" Buhari ve Ebu Davud'un rivayetinden anlaşıldığı gibi secde yerindeki topragı ve çakıl taşlarını tesviye etmek için namaz içinde secde yerine bir defa el sürmek caizdir, caizliğin sebebi de secde ederken eziyete maruz kalmamaktır. Ebu Zer' (r.a.)'in hadisini Ebu Davud, Tirmizi, Nesai, Ahmed ve İbn-i Hibban da rivayet etmişlerdir. El-Menhel yazarı: Namaza giriş sayesinde kişiye yöneltilen ilahi rahmetin kesintiye uğramaması için secde yerindeki çakıl taşlarını tesviye etmekle (düzeltmek) meşgul olmamak gerekir. Secde yerindeki toprak ve kum da çakıl taşları hükmündedir. Bunları tesviye etmekle meşgul olmak namazdaki huzur ve huşunun kesilmesine, dolayısıyla rahmetin kesilmesine yol açar, demiştir. El-Menhel yazarı daha sonra şöyle der: \"Bu babta rivayet olunan hadisler, namaz içinde, secde yerindeki çakılları, toprağı, kumu ve benzeri şeyleri tesviye etmenin kerahatine ve zaruret halinde bir defa el sürmenin caizliğine delalet eder Bu husustaki alimlerin görüşüne gelince: Ömer, Cabir, Mesrük, İbrahim en-Nehai, Hasan-i Basri ve cumhur'a göre secde yerindeki çakıllara el sürmenin mekruhluğuna hükmetmişlerdir. Malik'ten: Secdeden başını kaldırınca alnına yapışık toprağın yüzüne dökülüp dağılmasıyla eziyete maruz kalacak adamın. secde yerine el sürmesinde bir beis olmadığını söylediği rivayet edilmiştir. EI-Muvatta'da Ebu Ca'fer El-Kari'den rivayet ettiğine göre kendisi şöyle demiştir; Ben Abdullah bin Ömer (r.a.)'i secde için eğildiği zaman alnını koyacağı yerdeki çakıllara hafifçe elini sürerken gördüm. Zahiriye mezhebine mensup alimler, hadislerin zahiri ile hükmederek bir defadan fazla çakıllara el sürmek haramdır, demişlerdir. Abdullah bin Mes'ud, Ebu Hureyre, Huzeyfe ve Ebu Zer' (r.a.). bir defa el sürmeye ruhsat verenlerdendirler. İbn-i Huzeyme, kendi sahihinde rivayet ettiğine göre Cabir (r.a.): Namaz içinde çakıllara el sürrnenin hükmünü Resulullah (s.a.v.)'e sorduk. Buyurdu ki: ''Bir defa. bunu yapmaktan sakınman tümü kara gözlü olan yüz deveden daha hayırlıdır.'' Secde yerindeki çakıllara el sürme yasağının hikmetine gelince. namaz kılana yönelen ilahi rahmettin dönüp başka şeylerle meşgul olmamak ve rahmetten alacağı nasibi kaçırmamaktır. Bazıları demiş ki; Bunun hikmeti secde mahallinde bulunan çakılları basıp toprağa gömmek veya temizlemekle, üzerlerinde secde edilmesinden hoşlanan çakılları mahrum etmemektir. Nitekim İbn-i Ebi Şeybe'nin rivayetine göre Ebu Salih: Secdeye varmak istediğin zaman çakıllara el sürrne. Çünkü her çakıl. üzerinde secde edilmesini sever, demiştir. Bir kısım alimler de : Çakıllara el sürüp secde yerini düzenlemek tevazu'ya aykırıdır. demişlerdir.' HADİSLERDEN ÇIKARILAN HÜKÜMLER : 1- Zaruret olmadıkça. namazda iken secde yerine el sürmek mekruhtur. Abesle iştigaldir. 2- Zaruret halinde bir defa el sürmek caizdir. 3- Namaza durana ilahi rahmet yönelir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 225
			}
		}
	]
}