{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1061,
			"arabicnumber": 1061,
			"text": "Muhammed bin Amr bin Ata' (r.a.)'den; şöyle demiştir: İçlerinde Ebu Katade (r.a.)'in bulunduğu on sahabi'nln bulunduğu bir yerde Ebu Humeyd es-Saidi (r.a.)'den şöyle söylerken işittim : Ebu Humeyd oradaki sahabilere : — Resulullah (Sallallahu Aleyhi ve Sellem)'in namaz kılışını hepinizden daha iyi bilirim, dedi. Sahabiler O'na : — Neden (sen daha iyi bilirsin)? Sen hepimizden daha çok O'nun izini takip etmiş değilsin. Hepimizden önce Onun sohbetinde bulunmuş da değilsin, dediler. Ebu Humeyd (r.a.) : — Hayır, ben Onun kılışını hepinizden daha iyi bilirim, dedi. Sahabiler, Ona: — Öyle ise anlat (bakalım), dediler. Ebu Humeyd (r.a.) : — Resulullah (Sallallahu Aleyhi ve Sellem) namaza kalktığı zaman tekbir alırdı. (Tekbir alırken) ellerini omuzlarının hizasına kadar kaldırarak biraz öyle durdururdu. Sonra okurdu. Sonra tekbir alır ve ellerini omuzlarının hizasına kadar kaldırırdı. Sonra rüku' ederek, avuçlarının içini diz kapaklarının üzerine bırakır, onlara dayanırdı. Başını ne bel hizasından aşağı indirir, ne de yukarı kaldırır, ense ile beli bir hizada tutardı. Sonra: سمع اللَّه لمن حمد [semi’allahu limen hamide] diyerek ellerini omuzları hizasına kadar kaldırırdı. (Omurganın) bütün kemikleri mafsallarında yerleşinceye kadar (ayakta dururdu.) Sonra (secde için) yere inerdi. (Secdede) kollarını yanlarından uzak tutardı. Sonra (secdeden) başını kaldırırdı ve sol ayağını yere yatırarak üstünde otururdu. Secde ettiği zaman her iki ayağının parmaklarını, (uçları kıbleye ve altları yere gelecek şekilde) eğerdi. Sonra (ikinci defa) secde ederdi. Sonra tekbir alarak sol ayağı (nı yere yatırarak) üstünde ve (omurganın) her kemiği yerine dönünceye kadar otururdu. Sonra ayağa kalkardı. Ve ikinci rek'atte bunun mislini yapardı. Sonra ikinci rek'atten (üçüncü rek'ate) kalktığı zaman namaza başlarken yaptığı gibi ellerini omuzlarının hizasına kadar kaldırırdı. Sonra namazının kalan rek'atlerini böylece kılardı. Nihayet ardından selam verilecek secdeyi yaptıktan sonra sol ayağını geri çekerek (= altından sağ tarafına doğru çıkararak) sol yanı üstünde müteverrik olarak otururdu, dedi. Sahabiler: — Doğru söyledin. Resulullah (Sallallahu Aleyhi ve Sellem), anlattığın şekilde namaz kılardı, dediler. Diğer tahric: Buhari, Tirmizi, Ebu Davud. Ahmed, Tahavi, İbn-i Hibban ve Beyhaki de bu hadisi uzun ve kısa metinler halinde rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 259
			}
		}
	]
}