{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1106,
			"arabicnumber": 1106,
			"text": "Cabir bin Semure (r.a.)'den; şöyle demiştir : Nebi (Sallallahu Aleyhi ve Sellem), ayakta hutbe okurdu. Sonra otururdu. Daha sonra ayağa kalkardı, (ikinci hutbede) ayetler okurdu ve Allah'ı anardı. Onun hutbesi ne uzundu ne kısa idi. Cuma namazı da ne uzundu ne de kısaydı. AÇIKLAMA (1103,1104,1105 ve 1106) : İbn-i Ömer (r.a.)'ın hadisini Buhari, Müslim, Tirmizi, Ebu Davud, Nesai, Darekutni ve Beyhaki benzer lafızlarla rivayet etmişlerdir. Bütün rivayetler, efendimizin iki hutbe okuduğuna, hutbeler arasında oturduğuna ve hutbeleri ayakta okuduğuna delalet ederler. Cabir (r.a.)'in hadisini Müslim, Ebu Davud, Nesai ve . Beyhaki de rivayet etmişlerdir. Bazı rivayetlerde lafız farkı var ise de hepsinden Nebi (s.a.v.)'in ayakta iki hutbe okuduğu, hutbeler arasında oturduğu, hutbede ayet okuduğu ve Allah'ı andığı anlaşılır. Amr bin El-Huveyris (r.a.)'ın hadisine başka kitaplarda rastlayamadım. Zevaid türünden sayılmadığına göre Kütüb-i Sitte'nin diğerlerinde bulunması gerekir. Bu hadis de Nebi (s.a.v.)'in minber üzerinde hutbe okuduğuna delalet eder. Bu hadislerin ihtiva ettikleri hususları maddeler halinde aşağıya aldıktan sonra her husus için alimlerin görüşlerini nakledeceğim. 1- Nebi (s.a.v.) cuma namazından önce iki hutbe okurdu. 2- Hutbeleri ayakta okurdu. 3- İki hutbe arasında biraz otururdu. 4- İkinci hutbede Kur'an'dan ayetler okur, Allah'ı anardı. 5- Hutbeleri minber üstünde okurdu. 6- Hutbesi ve namazı mutedil idi. 1-- Cuma namazından önce iki hutbe okumak hususundaki Alimlerin görüşleri: a) Maliki, Şafii ve Hanbeli mezhebIerine göre cuma namazından önce iki hutbenin okunması farzdır ve cuma namazının sıhhati için şarttır. Hutbeler okunmadan kılınacak cuma namazı sahih değildir. Delilleri de Nebi (s.a.v.)'in her cuma günü namazdan önce daima iki hutbe okumuş olduğuna delalet eden sahih hadislerdir. Bir de Buhari ve Ahmed'in rivayet ettikleri efendimizin: ''Beni namaz kılarken gördüğünüz gibi namaz kılınız. hadisidir. Nebi (s.a.v.)'in iki hutbe okumadan bir defa olsun cuma namazı kıldığı sübut bulmuş değildir . Bunların bir delili de; ''Allah'ı anmaya gidiniz,. mealindeki Cuma suresinin 9. ayetidir. Çünkü cuma ezanından sonraki zikir hutbedir, diye bu alimler yorum yapmışlardır. b) Hanefi alimlerine göre bir hutbe kafidir. İkinci hutbe sünnettir. Zeylai: Bir kaç sahabinin tek hutbe okudukları ve kimsenin onlara itiraz etmediği rivayet edilmiştir, der. Evzai, İshak bin Rahuvye, Ebu Sevr, İbnü'l-Münzir ve bir rivayetinde Ahmed'in böyle hükmettiklerini el-Iraki anlatmıştır. 2-- Hutbelerin ayakta okunmasının hükmü; a) Cumhura göre ayakta okumak şarttır. Delilleri bu babda rivayet edilen hadisler ve benzeri hadislerdir. Nevevi: Çünkü hutbe Cuma'nın iki farzından birisidir. Namaz gibi bunda da ayakta durmak gerekir, demiştir. b) Hanefi alimleri ile bir rivayete göre Ahmed, hutbeyi ayakta okumak sünnettir, demişlerdir. Çünkü Nebi (s.a.v.)'in ve Hulefa-i Raşidin'in tatbikatı budur, vacib değildir. Çünkü yalnız tatbikatın bu oluşu vacibliği gerektirmez. Başka delil de yoktur. Nevevi'nin: Çünkü, hutbe Cuma'nın iki farzından birisidir: Namaz gibi bunda da ayakta durmak gerekir, sözüne şöyle cevap verilebilir: Kıbleye doğru durmak namazın şartlarından olduğu halde, hutbenin şartı olmamakla hutbe namaza muhalif olur. Bu nedenle hutbe namazdan çok ezana benzer. 3-- İki hutbe arasında oturmak; a) Cumhur'a göre, oturmak sünnettir, oturmaksızın Cuma hutbeleri sahihtir. b) Şafiiler'e göre hutbeler arasında oturmak şarttır. Onsuz hutbe sahih değildir. Çünkü Nebi (s.a.v.) hutbeleri arasında oturmayı hiç terk etmemiştir. Şafiiler bu gerekçe yanında: صلوا كما رايتمون ي اصل ي hadisini delil göstermişler. El-Ayni, Şafiiler'e cevaben: İbn-i Battal'ın dediğine göre Muğire bin Şu'be (r.a.)'in hutbeler esnasında oturmadığı rivayet olunmııştur. Eğer oturmak şart olsaydı, Muğire (r.a.)'in bunu bilmemesi düşünülemez. Faraza bilmeseydi orada bulunan sahabilerin ve tabiilerin buna müdahale etmemesi düşünülemez, dedikten sonra Ayni sözüne şöyle devam eder: 'İki hutbe arasında oturmak farzdır, diyenin elinde hiç bir delil yoktur. Çünkü söz konusu oturuş hatip için bir dinlenmedir. Hutbe'den bir parça değildir. Hutbe, yapılan konuşmadır. Şafii'den başka bu oturuşun farziyetine hükmetmemiştir. Bu hüküm icmaa muhaliftir ... Şafii'nin, Nebi (s.a.v.)'in sırf daimi tatbikatını gerekçe göstererek iki hutbeyi ve bunlar arasındaki oturmayı farz kılması ve iki hutbeden önce minber üzerinde oturmayı farz saymaması şaşılacak şeydir. Çünkü Nebi (s.a.v.)'in minbere çıktığında oturması sabittir.' 4-- İkinci hutbede Kur'an'dan ayetler okunması: a) Şafii: İki hutbeden birisinde bir ayet okumak farzdır. Kaf suresini okumak müstahabtır, demiştir. Şafii'nin Irak'lı arkadaşları ve Hanbeli'lerden El-Kadı her iki hutbede de ayet okumak gerekir, demişlerdir,. b) Cumhur'a göre, hutbede Kur'an okumak vacip değildir. 5-- Hutbelerin minber üstünde okunması; Hutbenin minber üzerinde okunmasının meşruluğu hususundaki cumhur'un kavline göre hatip, halife olsun başkası olsun farkı yoktur. NEBİ (SALLALLAHU ALEYHİ VE SELLEM)'İN MİNBERİ : EI-Menhel yazarı 'Minber edinmek. babında efendimizin minberini tarif ederken özetle şunu söyler: \"Bütün tarihçilerin sözleri Nebi (s.a.v.)'in minberinin üç basamaklı olduğunu gerektirir. Minberin yüksekliği iki zira', uzunluğu iki zira' ve genişliği bir zira' idi. Birinci ve ikinci basamağın yüksekliği yarımşar zira', üzerinde oturduğu üçüncü basamağın yüksekliği bir zira idi. Bu basamağın uzunluğu ve genişliği de birer zira' idi. Muaviye (r.a.) devrinde Medine valisi olan Mervan zamanına kadar Minber-i Nebevi böyle idi. Nihayet Mervan minberin alt kısmına üç basamak ilave ederek basamak sayısını altıya çıkardı. Olay şöyle cereyan etmiştir: Muaviye (r.a.), minberin söktürülerek Şam'a gönderilmesi için Mervan'a emir vermiş, Mervan da minberi söktürmüş ve Şam'a göndermeyi düşünürken güneş tutulmuş, Medine karanılkta kalmış, gündüz olmasına rağmen yıldızlar görülmüş ve şiddetli bir fırtına kopmuştur. Mervan bunun üzerine Medine cemaatına bir hitabede bulunarak : Ey Medine halkı! Siz Emirü'l-Mü'min'in minberi Şam'a göndermemi istediğini sanıyorsunuz. Halbuki Emir, Nebi (s.a.v.)'in koymuş olduğu minberi değiştirmenin hatalı olduğunu bilir, Emir'in bana emri, Minberi büyütmek ve yükseltmektir, demiş ve bir marangoz çağırtarak Mezkur ilaveyi yaptırmıştır . Nihayet hicri 654 yılında Mescid-i Nebevi'de vuku bulan yangında Mescid ile beraber minber de yandı. Yangın olayından sonra Yemen Meliki Muzaffer 656. yılında yeni minber yaptırmış, yirmi yıl sonra Mısır,. Meliki Zahir Baybars, Muzaffer'in minberini kaldırtarak yeni bir minber yaptırmıştır. Hicri 820. yılında Mısır padişahı Melik Müeyyed yeni bir minber göndermiştir.\" 6. Hutbesi ve namazı mutedil idi. Yani cuma hutbesi, cemaatı yoracak kadar, uzun değildi, meramı ifade etmiyecek kadar kısa da değildi, diğer hutbeleri kadar uzun dnğildi. Keza, cuma namazı da böyleydi. Diğer namazlara göre ne kısa sayılırdı, ne de uzun. Cuma hutbesinin kısa kesilmesine ve cuma namazının uzatılmasına dair Nebi (s.a.v.)'in hadisini Müslim rivayet etmiştir. Meali şöyledir: ''Ammar (r.a.)'den rivayet edildiğine göre kendisi: Ben Resulullah (s.a.v.)'den şöyle buyururken işittim: \"Adamın namazının uzunluğu ve hutbesinin kısahğı onun fıkıh bilgisinin alametidir. Şu halde namazı uzatınız ve hutbeyi kısa kesiniz.\" Müslim'in bu hadisi, babımızda rivayet olunan Cabir (r.a.)'in hadisine muhalif değildir. Çünkü Cabir (r.a.)'in hadisinin manası hutbe ile namazın birbirine denk olması değildir. Maksat Cuma hutbesinin diğer hutbelere nisbeten ve Cuma namazının da diğer namazlara nisbeten mutedil olmalarıdır. Cabir (r.a.)'in 1105 sayılı hadisindeki; \"o biraz otururdu.\" cümlesi ile iki hutbe arasındaki oturuş kasdedilmiş ise bu oturuşun şer'i hükmünü 3. maddede anlattım. Cümlenin böyle yorumlanması muhtemeldir. Ve Cabir (r.a.)'in 1106 nolu hadisine uygun ve benzeri olur. İkinci ihtimal: Mezkur cümle ile minbere çıkarken hutbeye başlamadan önce biraz oturmak manasının ifade edilmesidir. Mezkur cümle bu yoruma da müsaiddir. Nebi (s.a.v.)'in minbere çıkarken biraz oturduğu Buhari, Ebu Davud, Nesai ve başkalarının rivayet ettikleri İbn-i Ömer (r.a.)'in bir hadisi ile sabittir. Bu oturuşun gayesi, bu esnada okunan e:zanın bitmesini beklemektir. Bu oturuş cumhurun kavline göre sünnettir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 304
			}
		}
	]
}