{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1114,
			"arabicnumber": 1114,
			"text": "Ebu Hureyre ve Cabir (r.anhuma)'dan; şöyle söylemişlerdir : Resulullah (Sallallahu Aleyhi ve Sellem) hutbe okurken Süleyk el-Ğatafani (r.a.) geldi. Nebi (Sallallahu Aleyhi ve Sellem) Ona: «Sen gelmeden önce iki rek'at namaz kıldın mı?» diye sordu. Süleyk (r.a.): Hayır, dedi. Nebi (Sallallahu Aleyhi ve Sellem) : — «İki rek'at namaz kıl ve bunları hafif tut» buyurdu. Diğer tahric: Müslim, Ebu Davud, Darekutni ve Beyhaki AÇIKLAMA (1112, 1113, 1114): Cabir (r.a.)'in ilk 1112 nolu hadisini Buhari, Müslim, Ebu Davud, Tirmizi, Darekutni ve Beyhaki de rivayet etmişlerdir. Rivayetlerin bir kısmında Süleyk (r.a.)'in ismi belirtilmemiştir. Bazı rivayetlerde: ''Kalk da namaz kıl.'' ifadesi geçmektedir. Ebu Said (r.a.)'in 1113 nolu hadisini Ebu Davud hariç, Kütüb-i Sitte sahipIeri rivayet etmişlerdir. Cabir (r.a.) ve Yakarıdaki yani Ebu Hureyre (r.a.)'in 1114 nolu hadisini Müslim, Ebu Davud, Darekutni ve Beyhaki de rivayet etmişlerdir. Ebu Davud'un Cabir (r.a.)'den olan bir rivayetinde şu ilave vardır: ''İmam hutbe okurken biriniz (mescide) geldiği zaman iki rek'at namaz kılsın ve bunları hafif tutsun.'' Bu babtaki hadisler, hutbe esnasında mescide girenin iki rek'at \"Tahiyyetü'I-Mescid\" kılmasının meşruluğuna. delalet ederlar. Tirmizi, Ebu Said (r.a.)'in hadisini rivayet ettikten sonra: Bu hadis hasen-sahihtir. İlim ehlinin bazısının uygulaması bu hadis'e göredir. Şafii, Ahmed ve İshak bununla hükmetmişlerdir. Bazı alimler: İmam hutbe okurken mescid'e giren hemen oturur, hutbeyi dinler, namaz kılmaz demişlerdir. Süfyan-ı Sevri ve Kufe ehlinin kavli budur. Birinci kavil daha sahihtir, demiştir. Tchfe müellifi, Nevevi' nin Müslim'in şerhinde şöyle dediğini nakletmiştir: Müslim'in rivayet ettiği bu hadislerin hepsi Şafii, Ahmed, İshak ve hadisçilerin Fıkıhçılarının kavline delildir. Bu zatların kavline göre cuma günü imam hutbe okurken mescide girenin iki rek'at Tahiyyetü'l-Mescid namazı kılması müstahabtır. Kılmadan oturması mekruhtur. Bir an önce hutbeyi dinlemesi için bu namazı hafif tutması müstahabtır. Hasan-i Basri ve diger bazı Mütekaddiminin mezhebinin bu oldugu nakledilmişdir. El-Kadi'nin dediğine göre Malik. El-Leys, Ebu Hanife. Sevri, sahabilerle tabiilerin cumhuru, bu namazı kılmamaya hükmetmişlerdir. Ömer, Osman ve Ali (r.a.)'den bu yolda rivayet vardır. Bu gruptaki alimlerin delili. imamı dinlemek ve susmak hakkındaki delildir. Bunlar, bu babta rivayet edilen hadisleri te'vi! etmişlerdir, demiştir. Tuhfetü'I-Ahvezi yazarı ve EI-Menhel yazarı, her iki grubun delillerini. yorumlarını ve birbirlerine vermiş oldukları cevabıarı çok geniş almışlardır. Netice her ikisi. birinci gruptaki alimlerin görüşünü tercih etmişlerdir. (Yani Tehiyatu'l-Mescid Namazı -Mescid Namazı- İmam Hutbe verirken dahi müstehabtır demişlerdir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Shadh"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 312
			}
		}
	]
}