{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1147,
			"arabicnumber": 1147,
			"text": "Ali (r.a.)'den; şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem), ikamet edileceği zaman iki rek'at kılardı.\" Not: Zayıflığına ittifak edilmiş olan el•Haris bin AbdiIlah el-A'ver bu isnadda bulunduğu için isnadın zayıflığı Zevaid'de bildirilmiştir. AÇIKLAMA (1143, 1144, 1145, 1146, 1147): İbn-i Ömer (r.a.)'in ilk hadisini Nesaide rivayet etmiştir. İkinci hadisin müelliften başka kim tarafından rivayet edildiğini bilemiyorum. ilk hadis, şafak yeri ağardığı zaman Nebi (s.a.v.)'in sabah sünnetini kıldığına delalet eder. İkinci hadis de bu sünneti hafif tuttuğuna delildir. Hadisteki: \"Ezan sesi kulaklarında imiş gibi...'' tabiri, iki rek'ati hafif tuttuğundan kinayedir. Yani namaz çağrısı kulaklarında bulunan kişi, namaza yetişmek için kıldığı namazı hafif tuttuğu gibi, Resulullah (s.a.v.) bu iki rek'atı hafif tutardı. Hafsa (r.anha)'nın hadisini Ebu Davud hariç Kütüb-i Sitte sahipIeri tarafından rivayet edilmiştir. Bu hadis de efendimizin sabah farzından önce kıldığı iki rek'atı hafif tuttuğuna ve farza yakın bir zamanda kıldığına delalet eder. Aişe ve Ali (r.anha)'nın hadislerinin zevaid türünden olduğu Sindi'den anlaşılıyor. Bunlar da bu babta rivayet edildiğine göre Nebi (s.a.v.)'in sabah farzı için mescide çıkmadan önce abdest aldıktan sonra iki rek'at kılıp ondan sonra Mescide gittiğine, keza bu iki rek'atı kamet edileceği zamana yakın kıldığına delalet eder. Mezkur iki rek'at hakkındaki, dört mezhep alimlerinin görüşleri bundan önceki babta anlatılmıştır. Mezkur iki rek'atın hafif tutmasının hikmetine gelince el-Menhel yazarı şöyle der: Kurtubi: Bunda acele edilmesinin hikmeti, sabah farzının ilk vakitte eda edilmesinin sağlanmasıdır, demiştir. Bazıları: Resulullah (s.a.v.) gece namazını hafif tuttuğu iki rek'atla başlattığı gibi gündüz namazınıda hafif bir namazIa başlatmış, ta ki geceyi bol nafilelerle geçirsin ve farzia meşgul olmak için bundan başlasın, demişlerqir.\" Hadisler sabah sünnetinin hafif tutulmasının meşruluğuna delalet ederler. Cumhurun mezhebi de budur",
			"grades": [
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 345
			}
		}
	]
}