{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1187,
			"arabicnumber": 1187,
			"text": "Cabir (r.a.)'den rivayet edildiğine göre, Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Gece uyanamıyacağından korkanlarınız, gece'nin evvelinde vitir namazını kılsın, sonra uyusun. Gece sonunda uyanacağını umanlarınız vitir namazını gece'nin sonunda kılsın. Çünkü gece sonundaki Kur'an okumada melekler hazır olur. Gece sonunda Kur'an okumak efdaldır.» Diğer tahric: Müslim, Tirmizi ve Ahmed AÇIKLAMA (1185, 1186, 1187): Bu hadis, Nebi (s.a.v.)'in gecenin muhtelif zamanlarında vitir namazını kıldığına ve ömrünün sonlarında vitir namazını gecenin sonuna bıraktığına delalet eder. Ömrünün sonunda vitir namazını gecenin sonuna bıraktığı için efdal olanı budur. Bu hadis, gecenin tümünün vitir namazı için vakit olduğuna delalet eder. Lakin cumhur'a göre vitir namazı vaktinin başlangıcı yatsı namazından sonradır. Yani yatsı farzı kılınmadıkça vitir namazı vakti girmiş olmaz. Ebu Hanife'ye göre yatsı vakti olunca vitir namazı vakti olmuş olur. Lakin bile bile vitir namazı yatsı namazından önce kılınamaz. Ali (r.a.)'in hadisi, Aişe (r.anha)'nın hadisine benziyor. Müelliften başka kim tarafından rivayet edildiğini bilemedim. Zevaid türünden olması muhtemeldir. Cabir (r.a.)'in hadisini Müslim, Tirmizi ve Ahmed de rivayet etmişlerdir. Tirmizi'nin rivayetinde hadisin son kısmı şöyledir; ''Çünkü gecenin sonunda Kur'an okuma mahduredir. (= Yani rahmet melekleri hazır bulunup dinlerler). Gece sonundaki kıraet efdaldir ... Müslim'in rivayetinde son cümle şöyledir: ''Çünkü gece sonundaki namaz meşhudedir. (= Yani kılınırken rahmet melekleri hazır bulunup şehadet ederler.) Bu vakitteki namaz efdaldır ... Bu hadis, gecenin sonunda uyanamamaktan korkan kimsenin gece uyumadan önce vitir namazını kılmasını ve gece sonunda uyanacağını ümid edenin vitrini o vakte bırakmasını hükme bağlar. Nevevi, bu hadisin altında şöyle der: 'Gece sonunda uyanacağına güvenen kimsenin vitrini bu vakte tehir etmesinin ve buna güvenemeyenin uyumadan önce kılmasının efdal olduğuna açık delildir. Doğrusu budur. Mutlak olan hadisler buna göre yorumlanma!ıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 385
			}
		}
	]
}