{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1232,
			"arabicnumber": 1232,
			"text": "Aişe (r.anha)'dun; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), vefat ettiği hastalığa tutulduğu zaman (Ebu Muaviye demiştirki: Hastalığı ağırlaştığı zaman) Bilal (r.a.), O'na namaz vaktinin geldiğini haber vermek üzere geldi. Resulullah (Sallallahu Aleyhi ve Sellem): — «Ebu Bekir'e emrimi iletiniz. Cemaata namaz kıldırsın» buyurdu. Biz: — Ya Resulallah! Ebu Bekir cidden yufka yüreklidir. Senin yerine geçtiği vakit ağlar ve bu yüzden (sesini cemaata) işittiremez. Bu nedenle Ömer'e emretsen de o namaz kıldırsa, diye ricada bulunduk. (Efendimiz bu sözümüzden) sonra : — «Ebu Bekir'e emrimi iletiniz. Cemaata namaz kıldırsın. Hakikatan siz, Yusuf (Nebi)'in günündeki kadınlarsınız» buyurdu.\" Aişe (r.anha) demiştir ki: Bunun üzerine biz Ebu Bekir (r.a.)'e emr-i nebevi'yi ilettik. Kendisi de (bu emir üzerine) cemaata namaz kıldırdı. (Ebu Bekir namaza başlayınca) Resulullah (Sallallahu Aleyhi ve Sellem) kendinde bir hafiflik hissetti de iki adam arasında ve onlara dayanarak namaza gitti. Ayakları yerde sürünüyordu. Ebu Bekir (r.a.), O'nun geldiğini hissedince geri çekilmeye davrandı. Nebi (Sallallahu Aleyhi ve Sellem) Ona: — «Yerinden ayrılma» diye işaret etti. Ravi demiştir ki Resulullah (Sallallahu Aleyhi ve Sellem) ileriye geldi. Nihayet O'na yardım eden adamlar, onu Ebu Bekir (r.a.)'in yanına oturttular. Artık Ebu Bekir (r.a.), Nebi (Sallallahu Aleyhi ve Sellem)'e uyuyordu, cemaat da Ebu Bekir (r.a.)'in namazına uyuyorlardı. Diğer tahric: Bu hadisi Buhari, Müslim, Nesai ve Tirmizi müteaddit senedIerle ve muhtelif lafızlarla rivayet etmişlerdir. AÇIKLAMA 1235’te",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 430
			}
		}
	]
}