{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1257,
			"arabicnumber": 1257,
			"text": "Ubade b. es-Samit (r.a.)'den rivayet edildiğine güre; Nebi (Sallallahu Aleyhi ve Sellem), şöyle buyurmuştur: «Bazı işlerle meşgul olup namazı vaktinden geciktiren bir takım emirler olacaktır. (Siz namazınızı vaktinde kılınız ve) onlarla beraber kıldığınız namazınızı nafile yapınız.» Diğer tahric: Bu Hadis'in benzerini Ebu Davud ve Ahmed de rivayet etmişlerdir. AÇIKLAMA (1255, 1256, 1257): Ebu Davud'un rivayetinde efendimizin buyruğundan itibaren metin mealen şöyledir: «Şüphesiz benden sonra başınızda öyle emirler olacak ki bazı şeylerle meşguliyetleri yüzünden namazı vaktinde kılmayacaklar ve nihayet namaz vakti çıkmış olacaktır. O zaman siz namazınızı vaktinde kılınız.» Bir adam: Ya Resulallah onlarla beraber (tekrar) kılayım mı? diye sordu. Efendimiz: «Evet. Eğer dilersen.» buyurdu. Bu babtaki hadislerde geçen: \"Namaz vaktinden\" maksat ihtiyar vaktidir. Sıhhat vakti değildir. Yani namazı geciktirmektir. Tamamen vakti çıkıncaya kadar kılmamak ve kazaya bırakmak değildir. 'Namaz' Kitabının birinci babında 5 vakit namazın fazilet vakti, ihtiyar vakti ve sıhhat vaktinin bulunduğu ve en makbulünün fazilet vaktinde, hiç olmazsa ihtiyar vaktinde namaz kılmanın ve daha sonraya bırakmamanın önemi anlatılmıştır. Nevevi: 'Bu hadislerde geçen te'hirden (geciktirmekten) maksat, namazı büsbütün vaktinden çıkarmak değil, ihtiyar (vaktin ortasındaki serbest) vaktinden sonraya bırakmaktır. Çünkü mütekaddimin (ilk dönem) ve müteahhirin (son dönem) emirlerden nakledilmiş olan durum, bazı emirlerin namazı ihtiyar vaktinden sonraya (vaktin sonuna) bırakmalarıdır. Hiç bir emirin namazı, vaktinden çıkardığı yani kazaya bıraktığı naklolunmamıştır. Şu halde bu hadisleri vuku bulmuş olan duruma uygun yorumlamak gerekir,' demiştir. El-Ayni; bu yoruma itiraz ederek: Fasık halifelerin ve zalim sultanların değil, namazı kazaya bırakmak, büsbütün namazı terkettikleri bir gerçektir, demiştir. Bence Nevevi'nin yorumu uygundur. Çünkü hadislerde, bazı emirlerin namazı vaktinden çıkararak kıldıracakları bildiriliyor ve ferdIerin evlerinde vaktinde namaz kıldıktan sonra onlarla beraber tekrar kılmaları uygun görülüyor. Demek ki hadislerde durumları anlatılan emirler namazı büsbütün bırakanlar değil, geciktirenlerdir. Namazları tamamen vaktinden çıkararak bunları cemaatla beraber ve kaza durumunda kılmayı itiyad haline getirmiş olan emirler bilinmediğine göre tehirden maksat, ihtiyar vaktinden çıkarmak olmalıdır. İmam namazları ihtiyar vaktinden çıkardığı takdirde ferdIerin ihtiyar vaktinde namaz kılmaları ve sonra cemaatla tekrar o namazı kılmalarının hikmeti vaktin faziletini kazanmak, cemaata muhalefet etmemek, Ulu'l-emre karşı gelmemek ve müslümanlar arasında bulunması gerekli birliği zedelememektir. Hadisler, ilk namazın farz yerine geçtiğini ve ikinci kez kılınan namazın nafile hükmünde olduğunu açıkça belirtirler. Cumhurun kavli de budur. Malikiler'in meşhur kavline göre kişi, hangisini kabul buyuracağını Allah Teala'ya bırakarak ikinci defa namaza durur. Hadislerdeki hüküm umumidir. Yani sabah ve ikindi namazı da bu hükme dahildir. Sabah ve ikindi namazlarından sonra namaz kılmanın yasaklığına ait 147. babtaki hadisler, bu babtaki hadislerle hususileştirilmiştir. Yani bu hüküm müstesnadır. Hanefiler, sabah ve ikindi namazı tekrar kılınamaz. 147. babtaki hadisler, tekrar kılmaya manidir, demişlerdir. Onlara göre akşam farzı tekrar kılındığında imam selam verince kişi bir rek'at daha ekler. Çünkü tek rek'atlı nafile yoktur. Malikiler ve Hanbeliler de: Üç rek'atlı nafile olmadığını ve kılınan ikinci namazın nafile olması ihtimalini gerekçe göstererek akşam namazı ikinci kez kılınmaz, demişlerdir . HADİSİ'N FIKIH YÖNÜ : 1. İmam, namazı müstehab vaktinden tehir ettiği zaman, kişilerin fazilet veya ihtiyar vaktinde münferiden namazlarını kılmaları ve cemaat faziletini kazanmak için ikinci kez imamla beraber kılmaları matlubtur. 2. Günah olmayan hususlarda ulu'l-emre itaat etmek matlubtur. Özellikle tefrika ve fitne çıkacak işlerden kaçınmalıdır. 3. Namazlarda fazilet vaktine ve cemaata önem verilmelidir. 4. Namazı ihtiyar vaktinden geciktirmek fena derecesinde kötüdür. 5. Hadisler efendimizin mucizesini ihtiva eder. Çünkü Emeviler devrinden bu zamana kadar geçen sürede bazı meşguliyetler dolayısıyla namazları ihtiyar vaktinden çıkaran birçok emirlere (yöneticilere) rastlanmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 455
			}
		}
	]
}