{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1272,
			"arabicnumber": 1272,
			"text": "(Abdullah) İbn-i Ömer (r.a.)'dan; şöyle demiştir : Resulullah (Sallallahu Aleyhi ve Sellem) Medine'de minber üzerinde yağmur duasını okurken ve henüz minberden inmeden Medine'deki bütün oluklar gürül gürül akarken ben mübarek yüzüne baka baka şairin; وأبيض يستسقى الغمام بوجهه * ثمال اليتامى، عصمة للأرامل sözünü defalarca hatırlamışımdır. Bu söz Ebu Talibe aittir.\" AÇIKLAMA (1269, 1270, 1271, 1272): Ka'b (r.a.)'ın hadisinin benzerini Buhari ve Ebu Davud, Enes (r.a.)'den rivayet etmişlerdir. Buhari ve Ebu Davud'un rivayetine göre: \"Resulullah (s.a.v.) bir Cuma günü minber üzerinde hutbe okurken, bir adam ayakta dikilnek: Ya Resulallah! Hayvanlar helak oldu. Allah'a dua et. Bize yağmur versin, dedi. Bunun üzerine efendimiz ellerini kaldırarak yağmur için dua etti. Hava o esnada tamamen açıktı. Aniden bir rüzgar esti ve bulut görüldü. Biraz sonra toplanan buluttan bardaktan boşanırcasına bol bol yağmur yağmaya başladı. Bir hafta yağmur kesilmedi. Ertesi Cuma namazında yine Efendimiz hutbe okumak için ayağa kalkınca, bir adam ayağa kalkarak: Ya Resulallah evler yıkıldı. Yağmurun kesilmesi için Allah'a dua et, dedi. Resulullah (sallallahu aleyhi ve sellem) tebessüm ettikten sonra: ''Etrafımıza (yağsın). Üzerimize değil.\" dedi. Buluta baktım. Medine şehrinin etrafında halka haline geldi.' O rivayetlerde Nebi (s.a.v.)'in yaptığı duanın metni, burada olduğu gibi zikredilmemiştir. Buhari'nin rivayetinde Nebi (s.a.v.)'in; ''Allah'ım bize yağmur ver, AIlah'ım bize yağmur ver, Allah'ım bize yağmur ver.'' diye dua ettiği ifade edilmiş ve yağmurun kesilmesi için yaptığı dua, buradakinin aynısıdır. İbn-i Abbas (r.a.)'ın hadisi zevaid türündendir. Bu hadisteki duanın benzerini Ebu Davud, Hakim ve Beyhaki, Cabir bin AbdiIIah (r.a.)'den rivayet etmişlerdir. Ebu Hureyre (r.a.)'in hadisinin benzerini Buhari, Müslim ve Ebu Davud, Enes (r.a.)'den rivayet etmişlerdir. Abdullah bin Ömer (r.a.)'in hadisini Buhari de rivayet etmiştir. İbn-i Abbas (r.a.) ve İbn-i Ömer (r.a.)'in hadisleri, Nebi (sallallahu aleyhi ve sellem)'in yağmur talebi için minber üzerinde dua ettiğine delalet ediyorlar. Buhari ve Ebu Davud'un Enes (r.a.)'den rivayet ettikleri hadis ise Cuma hutbesinde yağmur duasının meşruluğuna delalet eder Ebu Hureyre (r.a.)'in hadisi de yağmur için dua ederken Nebi (s.a.v.)'in ellerini koltuk altlarının beyazı görülünceye kadar kaldırdığına delildir. Bu babtaki hadisler, Peygamber (sallallahu aleyhi ve sellem)'in duasının derhal kabul olunduğunu ifade ediyorlar. Yağmur talebi için istiska'nın bir kaç türlü olabildiği, bu konuda rivayet olunan hadislerden anlaşılıyor. El-Menhel yazarı, bu çeşitleri şöyle sıralıyor: İstiska'nın en azı yağmur için dua, etmektir. Ortancası farz namazların arkasında. yağmur için dua etmektir. En mükemmeli, istiska niyetiyle iki rek'at namaz kılmak, iki hutbe okumak ve dua etmektir. Hutbeler namazdan önce veya, sonra olabilir. Çünkü her iki şeklin meşruluğuna delalet eden sahih rivayetler mevcuttur. Malikiler, Şafiiler, Hanbeliler ve alimlerin cumhuru önce namaz, sonra hutbe okumayı tercil1 etmiştir. Buhari ve Ebu Davud'un Enes (r.a.)'den rivayet ettiklerine göre Resulullah (s.a.v.) yağmur duasında ellerini kaldırırken avuçlarının içini yere döndürmüştür. Bunun hikmeti, kuraklık ve sıkıntının bol yağmur ve genişliğe çevrilmesidir. İbn-i Ömer (r.a.)'in hadisinde anılan Ebu Talib'in beyti, Nebi (s.a.v.) hakkında söylediği 110 beyitlik bir medhiyyedendir. K astalani'nin Beyhaki'den naklen beyanına göre Beyhaki, Enes (r.a.)'in şöyle dediğini rivayet etmiştir: \"Bir a'rabi, Nebi (s.a.v.)'e gelerek: Ya Resulallah! Allah'a yemin ederim ki bizim ne inildiyebilecek bir devemiz kaldı, ne de bağırabilecek çocuğumuz, dedi. Bunun üzerine Nebi (s.a.v.) kalkıp ridasını sürükliye sürükliye minbere çıktı ve Allah'tan yardım diledi... (bol bol yağmur gelmeye başlayınca) Nebi (s.a.v.): ''Eğer Ebu Talib hayatta olsaydı çok sevinirdi. Onun şiirini kim okuyabilir?'' buyurdu. Bunun üzerine Ali (r.a.) ayağa kalkıp: ''Ya Resulallah! Bana öyle geliyor ki Sen onun şu sözünü kastediyorsun, dedi ve mezkur beyti arkasındaki üç beyitle birlikte söyledi. \" Bu beyit Ebu Talib tarafından Peygamberimiz üzerinde medhiye olarak yazılmış çok değerli bir kasidedendir. Ebu Talib bu kasideyi Mekke müşriklerinin Peygamber (sallallahu aleyhi ve sellem)'e amansız husumet besledikleri ve inanan bir avuç müslüman'ı Onun çevresinden uzaklaştırmak için insanlık dışı hareketleri reva, gördükleri günlerde kaleme almıştır. Bu beytin manası şöyledir: 'O efendi beyazdır. Mübarek yüzü suyu hürmetine yağmur dilenir. Yetimlere yardımcı ve sığınaktır. Fakir dul kadınlar için güven kaynağıdır.' Şöyle bir soru hatıra gelebilir: Ebu Talib, Peygamber (sallallahu aleyhi ve sellem)'in istiskaya çıktığı zaman'a yetişmemişken Onun mübarek yüzü suyu hürmetine yağmur dileneceğini nereden bilmişti? Bilindiği gibi istiska, hicretten sonra meşru kılınmıştır. Ebu Talib ise hicretten önce Mekke'de ölmüştür. Bu sorunun cevabı şöyledir: İbn-i Asakir'in Celheme bin arfata'dan tahriç ettiğine göre Celheme şöyle söylemiştir: Mekke halkı kuraklIk ve sıkıntı çektiği esnada ben Mekke'ye vardım. Kureyş, Ebu Talib'e baş vurarak: Ya Eba Talib! Mekke çok kuru kaldı. Çoluk çocuklar perişan vaziyette. Gel de yağmur duasında bulun, dediler. Ebu Talib yağmur duasına çıktı. Beraberinde güneş gibi nurlu, gencecik bir erkek çocuğu vardı. (Peygamber Efendimizi, kastediyor.) Bu nurlu çocuğun çevresinde bir kaç çocuk daha vardı. Ebu Talib bu çocuğun kolundan tutup Ka'be'nin yanına vardı ve Onun sırtını Ka'be'ye dayadı. Çocuk dua etmeye başladı. O esnada hava tamamen açık idi. Birden bire şurada burada bıılutlar görülmeye başladı ve sırsıklam edici bir yağmur yağdı. Mekke dereleri sularla taştı. Ebu Talib, bunun hakkında sözkonusu beyt'i söyledi. İbn-i Ömer (r.a.) bu hadiste diyor ki: Peygamber (s.a.v.) Medine de minber üzerinde yağmur duasını edip henüz minberden inmeden bütün oluklar yağmurla dolup taşarken defalarca şairin bu beytini yad ede durdum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 470
			}
		}
	]
}