{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1293,
			"arabicnumber": 1293,
			"text": "Ebu Said-i Hudri (r.a.)'den; şöyle demiştir: Resulullah (Se.llallahu Aleyhi ve Sellem) bayram namazından önce hiç namaz kılmazdı. Bayram namazından sonra evine dönünce iki rekat namaz kılardı. Not: İsnadınm sahih ve ricaIinin sika olduğu Zevaid'de bildirilmiştir. AÇIKLAMA (1291, 1292, 1293): İbn-i Abbas (r.a.)'ın hadisini Kütüb-i Sitte yazarları, Ahmed, Hakim, Darekutni ve Beyhaki de rivayet etmişlerdir. AbduIIah bin Amr (r.a.) ve Ebu Said (r.a.)'ın hadisleri Zevaid türündendir. Bu hadisler, bayram namazına bağlı sünnetlerin bulunmadığına delalet ederler. Bu hususta alimler müttefiktirler. Bayram namazından önce veya sonra nafile namaz kılmanın hükmü hususunda alimler arasında ihtilaf vardır. Ashab-ı kiram ve tabiilerden bir cemaat, bayram namazından önce ve sonra nafile kılmayı mekruh saymışlardır. İbn-i Abbas (r.a.) ve İbn-i Ömer (r.a.) böyle hükmedenlerdendirler. Ashab ve tabiilerden diğer bir cemaat, bayram namazından önce ve sonra nafile kılmanın caizliğine hükmetmişlerdir. Enes, Büreyde bin el-Husayb ve Rafi' bin Hadic bu cemaattandır. Bir cemaat da bayram namazından sonra nafile kılmayı caiz görmüştür. Ebu Mes'ud el-Bedri, Alkame, Nehai, Sevri ve Re'y ehli böyle diyenlerdendirler. EI-Menhel yazarı bu arada her gruba dahil bir çok sahabi ve tabiin'in ismini zikrettikten sonra mezhebIere mensup alimlerin görüşlerini anlatır. Görüşlerin özetleri şöyledir : 1. Hanefiler'e göre musallada bayram namazından önce ve sonra namaz kılmak mekruhtur. Bayram namazından önce evde kılmak da böyledir. Fakat bayram namazından sonra eve dönülünce kılmak mekruh değildir. Delil de İbn-i Mace'nin rivayet ettiği Ebu Said (r.a.)'in 1293 nolu hadisidir. El-Hakim de bu hadisi rivayet etmiş ve sahih saymıştır. El-Hafız, el-Fetih'te bu hadisin hasen olduğunu söylemiştir. 2. Şafiiler'e göre bayram namazından önce ve sonra nafile kılmak bu hadisler gereğince imam için mekruhtur. Fakat cemaat için mekruh değildir. 3. Malikiler'e göre musallada nafile kılmak mekruhtur. Delil de bu hadislerdir. Fakat yağmur gibi bir mazeret dclayısıyla bayram namazı camide kılındığı zaman bayram namazından önce ve sonra nafile kılmak caizdir. Cemaat için hüküm budur. Fakat imam için camide de olsa nafile kılmak mekruhtur. 4. Hanbeliler'e göre de nafile kılmak mekruhtur. Nafile kılmanın mekruhluğuna hükmedenler bu babta rivayet edilen hadisleri ve benzerlerini delil göstermişlerdir. Caizdir diyenler ise bu hadislerde bir yasaklama yoktur. Nebi (s.a.v.)'in kılmamış olması bunun mekruhluğunu gerektirmez, demişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 491
			}
		}
	]
}