{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1377,
			"arabicnumber": 1377,
			"text": "(Abdullah) bin Ömer (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Evlerinizi kabirler yapmayınız.» AÇIKLAMA (1375, 1376, 1377): Asım bin Amr (r.a.)'ın ve Umeyr (r.a.)'ın hadisleri Zevaid türündendir. Ebu Said-i Hudri (r.a.)'ın hadisi de Zevaid türündendir. Ancak Müslim bu hadisi Cabir (r.a.)'den rivayet etmiştir. Müslim'in rivayetinde; --fi mescid-- (Bir Mescidde) ilavesi vardır. Tercemede bu ilaveyi parentez içi ifadeyle işaret ettim. Bu hadiste Nebi (s.a.v.) farzını mescidde kılan'ın sünnetini evinde kılması ve evinin namaz sayesinde hayra kavuşmasını tavsiye eylemiştir. Ahmed bin Hanbel'in Aişe (r.anha)'den rivayet ettiği bir hadiste de Nebi (s.a.v.) şöyle buyurmuştur: \"Evlerinizde (nafile) kılınız. Evlerinizi üzerinize kabirler yapmayınız.» Tirmizi'nin şerhi Tuhfe yazarı hadisi şöyle yorumlar: \"Yani ölüler gibi olmayınız. Onlar evlerinde namaz kılmazlar. Onların evleri kabirlerdir. Hadisi şöyle yorumlayanlar da olmuştur: Evinde namaz kılmayan kimse, kendisini ölüye, evini de kabire benzetmiş olur. Müslim'in rivayet ettiği: «İçinde Allah'ın anıldığı ev ile içinde Allah'ın anılmadığı ev, diri ve ölüye benzerler.» mealindeki hadis bu yorumu te'yid eder. Bazıları: Hadisin manası: 'Ölülerinizi evlerinizde gömmeyiniz.' demektir, diye yorum yapmışlar ise de Hattabi: Bu yorum hiçbirşey değildir. Çünkü Resulullah (s.a.v.) oturduğu evine defnedilmiştir. Peygamberlerin, öldükleri yerlere gömüldükleri rivayetleri de vardır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 575
			}
		}
	]
}