{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "Enes bin Malik (r.a.)'den: şöyle demiştir: Biz bir gün mescidde oturmuş iken bir adam devesine binmiş olarak geldi. Devesini mescid'in bir tarafında çöktürerek bağladıktan sonra mescidde oturanlara: - Muhammed (Sallallahu Aleyhi ve Sellem) hanginizdir? dedi. Resulullah (Sallallahu Aleyhi ve Sellem) mescidde oturanlar arasında yaslanmış vaziyette idi. Enes (Radiyallahu anh) demiştir ki: Oradakiler: - Muhammed (Sallallahu Aleyhi ve Sellem) yaslanan bu beyaz adamdır dediler. Adam O'na: - Ey Abdu'l-Muttalib'in oğlu ! (diye) hitab etti. Nebi (Sallallahu Aleyhi ve Sellem): «Seni dinliyorum» mealinde bir cevap buyurdu. Adam O'na: - Ya Muhammed (Sallallahu Aleyhi ve Sellem) ben sana (bir şeyler) sormak istiyorum ve soru sormakta şiddetli davranacağım. Bana kızma, dedi. Nebi (Sallallahu Aleyhi ve Sellem): «Sormak istediğini sor» buyurdu. Adam O'na: - Senin Rabbin ve sen'den öncekilerin Rabbinin hakkı sana soruyorum. Allah mı seni bütün insanlara Nebi olarak gönderdi ? diye sordu. Resulullah (Sallallahu Aleyhi ve Sellem): «Allah'ım ! Evet» buyurdu. Adam: - Allah hakkı için sana soruyorum. Allah mı sana her gün ve gecede beş namaz kılmanı emretti? Resulullah (Sallallahu Aleyhi ve Sellem): «Allah'ım ! Evet» buyurdu. Adam: - Peki Allah hakkı için sana soruyorum. Allah mı senenin bu ayını (Ramazan ayını) oruçla geçirmeni emretti ? diye sordu. Resulullah (Sallallahu Aleyhi ve Sellem): «Allah'ım ! Evet» buyurdu. Adam: - Peki Allah adıyla sana soruyorum. Bu sadakayı zenginlerimizden alıp fakirlerimize taksim etmeni Allah mı sana emretti ? diye sordu. Resulullah (Sallallahu Aleyhi ve Sellem): «Allah'ım ! Evet» buyurdu. Bundan sonra Adam: - Senin getirdiğin din'e inandım ve ben arkamdaki kavmimin elçisiyim. Beni Sa'd bin Bekr'in kardeşi Dimam bin Sa'lebe'yim dedi. Diğer tahric: Buhari ve Müslim de bunu benzer lafızlarla rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 600
			}
		}
	]
}