{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1402,
			"arabicnumber": 1402,
			"text": "“... Enes bin Mâlik (radıyallahü anh)’den: Şöyle demiştir: Biz bir gün mescidde oturmuş iken bir adam devesine binmiş olarak geldi. Devesini mescidin bir tarafında çökerterek ayağını bağladıktan sonra mescidde oturanlara: Muhammed (sallallahü aleyhi ve sellem) hanginizdir? dedi. Resûlüllah (sallallahü aleyhi ve sellem) mescidde oturanlar arasında yaslanmış vaziyette idi. Enes (radıyallahü anh) demiştir ki: Oradakiler : Muhammed (sallallahü aleyhi ve sellem) yaslanan bu beyaz adamdır, dediler. Adam Ona: Ey Abdülmuttalibin oğlu! (diye) hitâb etti. Peygamber (sallallahü aleyhi ve sellem) : (Seni dinliyorum. ) mealinde bir cevap buyurdu. Adam O'na: Yâ Muhammed (sallallahü aleyhi ve sellem)! Ben sana (bir şeyler) sormak istiyorum ve soru sormakta şiddetli davranacağım. Bana kızma, dedi. Peygamber (sallallahü aleyhi ve sellem) : (Sormak istediğini sor) buyurdu. Adam O'na: Senin Rabb'in ve senden öncekilerin Rabb'inin hakkı için sana soruyorum. Allah mı seni bütün insanlara Peygamber olarak gönderdi? diye sordu. Resûlüllah (sallallahü aleyhi ve sellem) : (Allah'ım! (Sen şahitsin) Evet) buyurdu. Adam: Allah hakkı için sana soruyorum. Allah mı sana hergün ve gecede beş namazı kılmanı emretti? diye sordu. Resûlüllah (sallallahü aleyhi ve sellem) : (Allah'ım! Evet) buyurdu. Adam : Peki, Allah hakkı için sana soruyorum. Allah mı senenin bu ayını (= Ramazana) oruçla geçirmeni emretti? diye sordu. Resûlüllah (sallallahü aleyhi ve sellem) : (Allah'ım! Evet) buyurdu. Adam : Peki, Allah ismiyle sana soruyorum. Bu sadakayı zenginlerimizden alıp fakirlerimize taksim etmeni Allah mı sana emretti? diye sordu. Resûlüllah (sallallahü aleyhi ve sellem) : (Allah'ım! Evet. ) buyurdu. Bundan sonra adam : Senin getirdiğin dine inandım ve ben arkamdaki kavmimin elçisiyim. Ben Beni Sa'd bin Bekr'in kardeşi Dımâm bin Sa'lebe'yim, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 600
			}
		}
	]
}