{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1417,
			"arabicnumber": 1417,
			"text": "Cabir bin Abdillah r.a.'den şöyle demiştir: Resulullah.Sallallahu Aleyhi ve Sellem bir ağacın gövdesine (ravi demiştir ki: veya hurma kütüğüne) ayakta dayanırdı. Sonra bir minber edindi. Ravi demiştir ki: Bunun üzerine hurma kütüğü feryad etti. (Cabir r.a. demiştir ki:) Öyle (feryad etti) ki, Mesciddekiler onun feryadını işittiler. Nihayet Resulullah.Sallallahu Aleyhi ve Sellem kütüğün yanına vararak elini sürdü de (öylece) sustu. Oradakilerin bazıları dediki: «Eğer efendimiz onun yanına varmasaydı kütü kıyamete kadar feryad edecekti.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi sahihtir. İbn-i Adiyy de sıkadır. Nesai bu hadisi Cabir (r.a.)'den başka bir senedIe rivayet etmiştir. AÇIKLAMA (1414, 1415, 1416, 1417): 1414. hadiste Nebi (s.a.v.)'in mescidi çardak şeklinde iken yani mescidin üstü hurma yaprakları ile örtülü ve bağlardaki çardak gibi iken Nebi (s.a.v.)'in bir hurma kütüğüne doğru namaz kılageldiği ve hutbe okurken ona dayandığı bildiriliyor. Mescid-i Nebevi'nin yapılışı ve sonradan yapılan ilaveler hakkında genel bilgi 742 nolu hadisin izahıda var. Minber yapımı için Nebi (s.a.v.)'in arzusunu soran sahabi'nin ismi burada açıklanmamıştır. Ebu Davud'un İbn-i Ömer (r.a.)'den olan bir rivayetinde bu teklifi yapan sahabi'nin Temim-i Dari olduğu belirtilmiştir. Oradaki rivayette iki basamaklı bir minber yapıldığı bildirilmiş ise de üzerinde Nebi (s.a.v.)'in oturduğu üçüncü basamak hesaba katılmamıştır. Burada üç basamak denilirken son basamak hesaba katılmıştır. Böylece rivayetler arasında ihtilM yoktur. Bu hadisin zahirine göre teklifi yapan ve Temim-i Dari olduğu Ebu Davud'un rivayetinden anlaşılan sahabi, minberi yapmıştır. Halbuki 1416 nolu hadisin açıklamasında belirtildiği gibi minberi yaptıran Ensar'dan bir kadındır. Yapan da onun mevlası olan bir marangozdur. Sindi: Rivayetler arasında ihtilaf yoktur. Çünkü minber için ilk teklifi yapanın Temim olması ve sonradan kadının yaptırması mümkündür. Hatta Temim'in konuyu kadına intikal ettirmesi ve böylece müşterek çalışma neticesinde minberin yapılmış olması umulur, demiştir. Hurma Kütüğünün Feryad. Etmesi: Bu olay, bir Cuma günü Mescid-i Nebevi'de ve Cuma namazına katılan mescid dolusu sahabilerin huzurunda cereyan etmiş bir mucizedir. Bu konuda rivayet olunan sahih rivayetlerde bu kütüğün Efendimizin hutbe için minbere çıkmakla ayrılığından dolayı elem ve üzüntü ile feryadlar çıkardığı belirtilmektedir. Bu olayı bu babta rivayet edilen üç hadiste belirtildiği gibi Buhari'nin Cabir (r.a.) ve İbn-i Ömer (r.a.)'den; Ahmed bin Hanbel ile Tirmizi, İbn-i Huzeyme, Taberani, Darimi. Beyhaki ve Nuayın'ın Enes'ten; Ahmed, Ebu Sa'd, Ebu Nuayın, Taberani ve Beyhaki'nin İbn-i Abbas'dan; Ahmed, İbn-i Sa'd, Darimi, Ebu Ya'la, Beğavi ve Müellifin Ubeyy bin Ka'b (r.a.)'den rivayet ettikleri hadisler ve başka hadisler de bu olayı belirtirler. Beyhaki, Subki, Kadı iyaz ve İbn-i Hacer: Hurma kütüğünün feryadı olayını belirten hadis, mütevatirdir, demişlerdir. İbn-i Ebi Hatim'in dediğine göre Şafii: ''Allah Nebiimiz (sallallahu aleyhi ve sellem)'e verdiğini hiç bir Nebie vermemiştir.'' demiştir. İsa{Aleyhisselam)'a ölüleri diriltme mucizesinin verildiğini anlatan Ömer bin Sevade: . Muhammed {s.a.v.) Efendimiz'e hurma kütüğünün feryadı mucizesi verildi. Bu feryadı herkes duydu. Bu mucize ölüleri diriltmekten daha büyüktür', diye Şafii'ye cevap vermiştir. Enes (r.a.)'ın hadisi Zevaid türündendir. Ahmed, İbn-i Huzeyme, Taberani, Darimi, Beyhaki ve Ebu Nuaym da Enes (r.a.)'in hadisini rivayet etmişlerdir. Sehl (r.a.)'ın hadisini Tirmizi hariç Kütüb-i Sitte sahipleri ve Beyhaki rivayet etmişlerdir. Bu hadiste Nebi (s.a.v.)'in minberinin hangi ağaçtan yapıldığı hususunda bir grup arasında münakaşa yapıldığı belirtiliyor. İhtilaf eden cemaattaki zatların isimleri bildirilmemiştir. Bunlar Sehl bin Sa'd (r.a.)'a başvurarak durumu öğrenmek istemişler, O da: Bunu benden daha iyi bilen kimse kalmadı demekle vereceği bilginin kesin ve inandırııcı olduğunu belirtmek istemiş ve minberin Cabe'nin Esl ağacından yapıldığını bildirmiştir. Cabe; Şam istikametinden Medine'ye dokuz mıl mesafede ağaçlık bir yerin adıdır. Minber bu ormancığın Esl ağacından yapılmıştır. Kamus'un tercemesi Okyanus'ta şu bilgi vardır: Tarfa', bir ağaç ismidir. Ki, dört sınıfı olur. Bir sınıfı Esl dedikleridir. Bu ağaç ilgın ağacıdır. Esl, acı ilgın ağacıdır ki, büyüğü, küçüğü, meyvelisi, meyvesizi vardır. Minberi yaptıran kadının Ensar'dan olduğu. Buhari'nin bir rivayetinde belirtilmiş. Fakat ismi verilmemiştir. Adının Fukeyhe bint Ubeyd bin Deylem olduğu söylenmiş, bazıları: Adı Aişe'dir demişlerdir. Kadın'ın hizmetçisi olup minberi yapan marangozun adına gelince; adının Kubeysa el-Mahzumi olduğu söylendiği gibi, Bakum'dur diyenler ve Meymun'dur, diyenler de vardır. Hafız, son kavli seçmiştir. Buhari'nin Cabir (r.a.)'den olan bir rivayetine göre kadın minber yaptırmak için Nebi {Sallallahu Aleyhi ve Sellem)'in müsaadesini istemiştir. Ebu Davud'un Nebi'den olan rivayetinde Nebi (s.a.v.) minber yaptırma işi için kadına haber göndermiştir. Muhtemelen önce kadın, Nebi (s.a.v.)'e teklifte bulunmuş, bilahare Nebi (s.a.v.) ona müsbet cevap vermiştir. Kadın'ın hizmetçisi olan marangoz, minberi yapıp getirmiş ve yerine yerleştirmiştir. EI-Menhel yazarının dediğine göre minberin yüksekliği ve kıble yönünden kuzey yönüne olan uzunluğu ikişer arşın, genişliği de bir arşın idi. İlk iki basamağın yüksekliği yarımşar arşın ve üstünde Nebi (s.a.v.)'in oturduğu son ve üçüncü basamağın yüksekliği bir arşın idi. Son basamağın üst yüzü bir arşın kadar idi. Minberin etrafı beş sırıkla çevrili idi. Bunların birer tanesi minberin sağ ve sol yanlarına çakılı idi. Üç tanesi de minberin kıble tarafına çakılı idi. Nebi (s.a.v.) minber üstünde o üç sırığa dayanırdı. Minberin ilk basamağının iki tarafına ayrıca dikey olarak iki sırık çakılı idi. Minberin yanlarına çakılan sırıklar, dikey sırıklarla bağlantılı idi. Minberin etrafında yedi penceremsi açık yer vardı. Medine valisi Mervan zamanına kadar minber bu vaziyette idi. Muaviye (r.a.) halife iken Nebi (s.a.v.)'in minberının Şam'a gönderilmesi için Mervan'a talimat yazmış, Mervan da minberi yerinden sökmüş ve Muaviye (r.a.)'e göndermek istemiş. Fakat aynı gün güneş tutulmuş. Medine karanlığa boğulmuş, yıldızlar görülmüş ve şiddetli fırtına kopmuş, bunun üzerine Mervan, Medine halkına şöyle bir hitabede bulunmuş: 'Ey Medine halkı! Siz halife'nin Nebi (s.a.v.)'in minberini Şam'a göndermem için emir verdiğini sanıyorsunuz. Halife bunun sakıncalı olduğunu bizden daha iyi bilir. Halife minberi büyütüp yükseltmemi emretmiştir. Mervan bunun üzerine bir marangoz çağırtarak minbere altı basamak ilave etmiştir. Minber, bu şekli ile devam etmiş, nihayet hicretin 654. yılı Mescidin yanması dolayısıyla minber de yanmıştır.' Hadise göre minbel' yerine konduktan sonra Nebi (s.a.v.) minbere çıkarak orada cemaata namaz kıldırmış, kıyam ve rüku'u minberin üstünde yapmış, minber secde etmeye müsait olmadığı için, Nebi (s.a.v.) yüzünü kıbleden döndürmeden gerisin geriye giderek yere inmiş ve secdeyi yerde yapmıştır. Nebi (s.a.v.)'in o gün minber üstünde namaz kıldırmasının hikmeti, tatbikatlı olarak namazın kılınışını cemaata öğretmek olabilir Cabir (r.a.)'in hadisini Buhari ve Nesai de rivayet etmiştir. Bu hadis de Nebi (s.a.v.)'in ilk zamanlarda hurma kütüğüne doğru namaz kıldığı ve hutbede ona dayandığı, sonra minbel' yapılınca mesciddeki cemaatın duyabileceği bir sesle kütüğün feryad ettiği, Nebi (s.a.v.)'in onun yanına giderek elini sürdüğü, böylece kütüğün iniltisinin kesildiği belirtiliyor. Ve bazı sahabilerin: \"Eğer Nebi (s.a.v.) ona varmasaydı kıyamete kadar kütük feryad edecekti.\" dedikleri belirtiliyor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 615
			}
		}
	]
}