{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"6": "Chapters Regarding Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1576,
			"arabicnumber": 1576,
			"text": "Ebu Hureyre (r.e.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), kabirleri ziyaret eden kadınları la'netlemiştir. Diğer tahric: Ahmed, Tirmizi, İbn-i Hibban ve Beyhaki de rivayet etmişlerdir. AÇIKLAMA (1574, 1575, 1576): İlk hadis (1574) Zevaid türündendir. İbn-i Abbas (r.a.)'ın (1575) hadisini Ebu Davud, Nesai ve Hakim de rivayet etmişlerdir. Bu (yani Ebu Hureyre (r.a.)'ın) hadisi Ahmed, Tirmizi, İbn-i Hibban ve Beyhaki de rivayet etmişlerdir. Lanetlemek, Allah'ın rahmetinden kovulmayı dilemektir. Kadınlar. ekseriyetle kabir ziyaretine gittikleri zaman bağırıp çağırırlar, yakalarını yırtarlar, yüzlerini döverler, kocalarının hakkını çiğnerler ve İslami örtünmeye riayet etmeden, hatta süslenerek giderler. Bu olumsuz davranışlarından dolayı, ilahi rahmetten uzak kalmaları yolunda Nebi (s.a.v.)'in bedduasına ma'ruz kalmışlardır. EI-Menhel yazarı bu hadisin açıklaması bahsinde şöyle der: Hadis, kadınların kabir ziyaretine gitmelerinin haramlığına delalet eder. Şafiiler'in, Malikiler'in ve Hanefiler'in bazısı böyle hükmetmişlerdir. Şafiiler'in ekserisi ile Hanefiler'in bir kısmı, bu hadisi delil göstererek, kadınların kabir ziyaretini mekruh görmüşlerdir; Hanbeliler'in mezhebinin meşhur kavli de budur. Haram olmadığına dair gösterdikleri delil, Ümmü Atiyye (r.anha)'nın (1577 nolu) hadisidir. Hanefiler'in ekserisine göre kadınların ziyareti caizdir. Malikiler'in bir kavli ve Ahmed'in bir rivayeti de böylecIir. Bu guruptaki alimlere göre kadınların ziyaretinin yasaklığı, kabir ziyareti için ruhsat verilmeden önceki zamanda idi. Bilindiği gibi ilk zamanlarda erkeklere de yasaklanmıştı. Bilahere kabir ziyaretine ruhsat verilince; verilen ruhsat, erkeklere mahsus değil, kadınları da kapsar. Bunlara göre ruhsaL veren hadislerdeki zamirler erkeklere ait ise de; erkeklerin kadınlara galip kılınması yoluyla böyle hitab edilmiştir. Aslında hitap, erkeklere münhasır değildir. Hanefiler'in bir delilide İbn-i Abdi'l-Berr'in et-Temhid'de Abdullah bin Ebi Müleyke (r.a.)'den rivayet ettiği şu mealdeki haberdir: \"Aişe (r.anha) bir gün mezarlıktan döndü. Ben Ona: Ey Mu'minlerin annesi! Nereden geliyorsun? diye sordum. Kendisi: Kardeşim Abdurrahman (r.a.)'ın kabrinden geliyorum. dedi. Ben: Resulullah (s.a.v.) kabirlerin ziyaretini men etmemiş miydi? dedim. Kendisi: Evet, Efendimiz kabir ziyaretinden men ediyordu. Sonra ziyaretini emretti.\" El-Menhel yazarı, Hanefiler'in gösterdikleri başka delilleri de zikrettikten sonra: Kadınların ziyaretiyle ilgili hadisler ile diğer hadislerin uzlaştırılması mümkündür Şöyle ki: Ziyaret hakkında verilen izin; örtülü olarak çıkan, ahireti düşünen, kabir halkından ibret alan, bağırıp çağırmayı, yüzünü dövmeyi, yakalarını yırtmayı ve kötü laf etmeyi terkeden kadınlar içindir. Konulan yasak da, anılan uygunsuz davranışlarda bulunan kadınlara mahsustur, demiştir. Nevevi, el-Mühezzeb şerhinde el-Müstezhar sahibinin şöyle dediğini nakletmiştir: Bence eğer kadınların ziyareti, üzüntüyü yenilemek, ağlamak, bağırıp çağırmak ve benzeri olumsuz hareketler için ise haramdır. Kadınların ziyaretini yasaklıyan hadisler, bunlara yorumlanır. Eğer bu gibi olumsuz hareketler için değil de ibret almak için ziyaret etmek isterlerse, bu ziyaret mekruhtur. Ancak iştah çekmek halini yitirmiş bulunan ihtiyar kadınlar için caizdir, denilebilir. Nevevi, bu nakli yaptıktan sonra, bunu benimsediğini ifade ederek: Bununla beraber hadisin zahirini dikkate alarak ziyareti terk etmesi ihtiyatlı olanıdır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 144
			}
		}
	]
}