{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"6": "Chapters Regarding Funerals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1628,
			"arabicnumber": 1628,
			"text": "İbn-i Abbas (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) için mezar kazmak istedikleri zaman Ebu Ubeyde bin el-Cerrah (r.a.)'ın arkasına adam gönderdiler. Kendisi Mekke halkı mezarı gibi şak şeklinde mezar kazıyordu. Ebu Talha (r.a.)'ın arkasına da adam gönderdiler. O da Medine halkı için mezar kazıyordu. Kemdisi mezarı lahid şeklinde kazıyordu. Bunların ikisimede iki haberci göndererek: Allah'ım! Kendi Resulün için hayırlı olanı sen seç, dediler. Ebu Talha (r.a.)'i bulabildiler. O getirildi. Ebu Ubeyde (r.a.) bulunamadı. Bunun üzerine Ebu Talha (r.a.) Resulullah (Sallallahu Aleyhi ve Sellem) için lahit kazdı. İbn-i Abbas (r.a.) demiştir ki: Sahabiler salı günü Nebi (Sallallahu Aleyhi ve Sellem)'in techiz işini bitirince Efendimiz kendi odasında na'şı üzerine konuldu sonra erkek cemaat guruplar halinde Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına girip üzerinde namaz kıldılar. Erkekler bitince sahabiler, kadınları guruplar halinde odaya dahil ettiler. Kadınlar bitince ergenlik çağına gelmeyen çocukları odaya dahil ettiler. Nebi (Sallallahu Aleyhi ve Sellem)'in cenaze namazını cemaate imam olarak hiç kimse kıldırmadı. Müslümanlar Nebi (Sallallahu Aleyhi ve Sellem) için kazılacak mezar yeri hususunda ihtilaf ettiler. Bazıları: Kendi mescidinde defnedilsin. dediler. Bazıları Ashabı yanında defnedilsin dediler. Sonra Ebu Bekir (r.a.): Şüphesiz ben Resulullah (Sallallahu Aleyhi ve Sellem)'den işittim. buyurdu ki: «Ölen her Nebi ancak öldüğü yer'e defnedilmiştir.» İbn-i Abbas (r.a.) demiştir ki: Bundan sonra üzerinde Resulullah (Sallallahu Aleyhi ve Sellem)'in vefat ettiği yatağı kaldırdılar ve Ona mezar kazdılar. Sonra çarşamba günü gece yarısında Efendimiz defnedildi. Onun mezarına Ali bin Ebi Talib, el-Fadl bin Abbas, kardeşi Kusem ve Resulullah (Sallallahu Aleyhi ve Sellem)'in mevlası Şukran (r.anhum) indiler. Ebu Leyla künyeli Evs bin Havli (r.a.) Ali bin Ebi Talib (r.a.)'e : Allah Teala hakkı için Resulullah (Sallallahu Aleyhi ve Sellem)'den bize payımızı vermeni senden diliyorum, dedi. (Kabre inip hizmet etmek istiyordu) Ali (r.a.) Ona: İn diyerek izin verdi. Şukran (r.a.) Resulullah (Sallallahu Aleyhi ve Sellem)'in hayatta iken zaman zaman giydiği bir hırkasını eline almıştı. Onu kabre defnetti. ve: Vallahi bu elbiseyi senden sonra ilalebed hiç kimse giymeyecektir, dedi. Bu hırka Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber defnedildi. Not: Zevaid'de şöyle denilmiştir: Bu hadisin senedinde Hüseyin bin Abdillah bin Ubeydillah bin Abbas el•Haşimi bulunur. Ahmed bin Hanbel, Ali bin el-Medeni ve Nesai. bunu terketmişlerdir. Buhari de: Zındıklıkla itham ediliyor du denildiğini söylemiştir. İbn-i Adiyy, Onu kuvvetli görmüştür. İsnadın kalan ravileri sika zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 6,
				"hadith": 196
			}
		}
	]
}