{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"8": "The Chapters Regarding Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1799,
			"arabicnumber": 1799,
			"text": "Ebu Said-i Hudri (r.a.)den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Beşten az develerde zekat yoktur. Dört devede de hiç bir şey yoktur. Develerin sayısı beşe ulaşınca onun zekatı bir şat olur. Dokuz deveye kadar (böyledir.) Deve sayısı 10a ulaşınca (bundan) on-dörde kadar onun zekatı iki şat olur, develer on beş olunca (bundan) 19'a kadar onun zekatı üç şattır. Develer 2O'ye ulaşınca zekatı dört şattır. Deve sayısı 24'e ulaşıncaya kadar (hüküm budur.) Deve sayısı 25'e ulaşınca (bundan) 35'e kadar, onun zekatı bir bint-i Mahad-dır. Bint-i mahad olmadığı zaman erkek olan bir ibn-i lebun verilir. Bir deve fazlalaşırsa, zekatı bir bint-i lebun olur. Deve sayısı 45e ulaşıncaya kadar (hüküm budur.) Bir deve fazlalaşırsa, zekatı bir hıkka olur. Deve sayısı 60'a ulaşıncaya kadar (hüküm budur.) Bir deve daha olursa zekatı bir cezea olur. Deve sayısı 75'e ulaşıncaya kadar (hüküm budur.) Deve sayısı bir artarsa zekatı iki bint-i lebun olur. Deve sayısı 90'a ulaşıncaya kadar (hüküm budur.) Buna bir deve daha ziyadeleşirse. zekatı iki hıkka olur. Develer 120 adede ulaşıncaya kadar (hüküm budur.) Bundan sonra her elli deve için bir hık.... ve kırk deve için bir bint i lebun (zekat) olur.» Not: Zevaid'de şöyle denmiştir: Bunun senedindeki ravi Muhammed bin Akil hakkında Ahmed ve Hakim: Muhammed bin Akil, Hafs bin Abdillah'tan muteber olmayan iki hadis rivayet etmiştir. demişlerdir. İbn-i Hibban ise: 0, sika'dır, bazen hata etmiştir. Irak'ta on kadar matlup hadis rivayet etmiş, demiştir. Nesai de O'nu sika saymış ve Ebü Abdillah el•Hakim'de: 0, alimlerin seçkinlerindendir, demiştir. İsnadın kalan ravileri Buhari'nin şartı üzerine sika zatlardır. Bu hadisin ilk cümlesini (yani «Beşten az develerde zekat yoktur.» cümlesini Buhari, Müslim ve başkaları (Müellifin Süneninde 1793 numarada geçmiştir.) da rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 17
			}
		}
	]
}