{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"8": "The Chapters Regarding Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1800,
			"arabicnumber": 1800,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre: Ebu Bekir-i Sıddik (r.a.) (kendisini Bahreyn'e zekat amiri olarak gönderdiğinde) O'na şu mektubu vermiştir: Sana verdiğim bu mektup, Allah'ın Resulullah (Sallallahu Aleyhi ve Sellem)'e emrettiği ve Resulullah (Sallallahu Aleyhi ve Sellem)'in müslümanlara farz ettiği (veya takdir ve tayin buyurduğu) zekat farizası (hükümlerini beyan eden bir talimat)dır. Şüphesiz, hayvan zekatları meyanındaki develerin gerekli yaşlarından bir kısmı şöyle olur: Kimin yanındaki develerin zekatı dört yaşım bitirip beş yaşa erişmiş bir dişi deveye ulaşır ve o'nun yanında böyle deve bulunmaz da bir yaş aşağı dişi deve bulunursa, mal sahibinden (zekat olarak bu deve kabul edilir.) Ve mal sahibi yaş farkının telafisi için, yanında varsa iki şat, yoksa yirmi dirhem (gümüş) verir. Kimin yanındaki (develerin) zekatı üç yaşını bitirip dört yaşına basmış bir dişi deveye ulaşır ve onun yanında yalnız iki yaşını bitirip üçüncü yaşa basmış deve varsa, bu deve ondan kabul edilir. Ve mal sahibi (yaş farkına karşılık olarak) bu deve ile beraber, yanında varsa iki şat, yok ise yirmi dirhem (gümüş) verir. Kimin zekatı iki yaşını tamamlayıp üçüncüsüne basmış dişi bir deveye ulaşırsa yanında bu evsafta bir deve bulunmayıp bir yaş büyüğü bulunursa bu deve mal sahibinden kabul edilir ve zekat memuru (yaş farkı telafisi için) ona yirmi dirhem (gümüş) veya iki şat verir. Kimin zekatı iki yaşını tamamlayıp üçüncüsüne basmış bir dişi deveye erişir ve yanında bu vasıflarda deve bulunmayıp, yanında bir yaş küçüğü dişi deve bulunursa mal sahibinden bu deve kabul edilir ve mal sahibi (yaş farkını kapatmak için) bu deve ile beraber 20 dirhem (gümüş) veya İki şat verir. Kimin zekatı bir yaşını tamamlayıp ikinci yaşa giren dişi bir deveye ulaşır da, yanında bu evsafta deve bulunmaz ve yanında bir yaş küçüğü dişi deve bulunursa, ondan o büyük deve kabul edilir. Ve zekat memuru (yaş farkının telafisi için) ona yirmi dirhem (gümüş) vcya iki şat verir. Kimin yanında zekat olarak vermesi gereken iki yaşındaki dişi deve bulunmayıp yanında, iki yaşından üçüncüsüne geçmiş erkek bir deve varsa ondan o deve kabul edilir ve bununla beraber başka bir şey (vermek) yoktur. Diğer tahric: Malik, Şafii, Ahmed, Buhari, Ebu Davud, Darekutni, Hakim ve Beyhaki de bu hadisi rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 8,
				"hadith": 18
			}
		}
	]
}