{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 183,
			"arabicnumber": 183,
			"text": "Safvan bin Muhriz El-Mazini r.a.’den rivayet edildiğine göre şöyle demiştir: Abdullah bin Ömer r.a. bir ara Ka'be’yi tavaf ederken biz de onun beraberinde idik.Aniden bir adam ona çıkıp geldi ve: - Ya İbni Ömer! Resulullah Sallallahu Aleyhi ve Sellem’in Necva (= kıyamet günü Allah ile mu'minler arasında cereyan edecek olan özel görüşme) hakkında buyurduğu (şeyleri) kendisinden sen nasıl işittin? diye sordu. Abdullah İbni Ömer: Ben Resulullah Sallallahu Aleyhi ve Sellem’den şöyle buyurduğunu işittim: « Mu'min (kul), kıyamet günü Rabbine öyle bir derecede yaklaştırılır ki, artık Rabbi onun sırrını mahşer ehlinden saklamış olur. Sonra Rabbi ona bütün günahlarını ikrar ettirir. Rabbi, (ona günahlarını itiraf ettirirken) - Şunu işlediğini sen bilir misin? diye sorar. Mu'min de : - Ya Rabbi! bilirim ,der. Nihayet mu'minin işlediği günahlar hakkındaki itirafları Allah’ın dilediği miktara ulaşınca Allah Teala ona: - ‘‘Şüphesiz ben senin işlediğin günahları dünyada senin için örttüm. Bu gün de senin için o günahlarını mağfiret ediyorum’’ buyurur. Resulullah Sallallahu Aleyhi ve Sellem buyurdu ki: Sonra onun hasenatının sahifesi veya defteri onun sağ eline verilir. Resulullah buyurdu ki: Ama kafir veya münafık ise şahitlerin başları üzerinde nida edilerek şöyle haykırılır: Şunlar Rablerine karşı yalan söyleyenlerdir. Haberiniz olsun. Allah’ın la'neti zalimlerin üzerinedir.» Ravilerden Halid (bin el-Haris) dedi ki hadis metninden: «Şahitlerin başları üzerinden » lafzı münkatı’dır. Bu lafzın dışındaki metnin tamamı mevsul’dur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 183
			}
		}
	]
}