{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 190,
			"arabicnumber": 190,
			"text": "Talha bin Hıraş r.a.’den rivayet edildiğine göre kendisi, Cabir bin Abdillah r.a.’den şöyle söylediğini işittim,demiştir : Abdullah bin Amr bin Haram, Uhud günü şehid edilince, Resulullah Sallallahu Aleyhi ve Sellem bana rastladı ve : ''Ya Cabir! Babana Allah’ın söylediği sözü sana bildirmiyeyim mi?’’ diye sordu. (Müellife hadisi rivayet eden iki raviden) Yahya da hadisinde (yukarıdaki bölüm yerine) şöyle söylemiştir: Resulullah, Cabir’e rastlayınca: '' Ya Cabir! Neden ben seni (kalben) kırgın (ve üzgün) görüyorum? diye sordu. Cabir dedi ki, Ben de: Ya Resulallah! Babam şehid edildi ve çoluk çocuk ile borç bıraktı, diye cevap verdim. Resulullah Sallallahu Aleyhi ve Sellem : '' Ey Cabir! O halde Allah’ın babanı nasıl bir hitab ile karşıladığını sana müjdelemiyeyim mi?'' buyurdu. Cabir de : Buyur ya Resulallah! (Allah’ın babama olan hitabını bildir, müjdele) dedi. Resulullah (bunun üzerine): - Allah hicap (perde) ardından olmaksızın hiç kimse ile kat'iyen konuşmamıştır. Bununla beraber Allah babanla vicahen (perdesiz ve elçisiz) konuştu ve ona şöyle buyurdu: '' Ey (sevgili) kulum! Benden (ikram) iste. (Ne istersen) sana vereyim.'' Baban da: Ya Rabbim! (Arzum şudur:) Beni diriltirsin (dünyaya iade edersin.) Ben de ikinci bir defa senin uğrunda şehid edilirim, dedi. Bunun üzerine Rab Sübhanehu ve Teala : '' İnsanların dünyaya hiç dönmeyecekleri hükmü şüphesiz benim tarafımdan önceden verilmiştir'', buyurdu. Baban : Ya Rabbi! O halde (bizim durumumuzu) arkamda kalanlara tebliğ buyur, dedi. Resulullah s.a.v. buyurdu ki : '' İşte bunun üzerine Allah Teala (meali aşağıda alınan) şu ayeti indirdi> : '' Allah uğrunda öldürülenleri sakın ölüler sanma. Hakikatte onlar Rabları katında dirilerdir, Cennet meyvalarından rızıklanırlar.'' (Al-i İmran, 169) Bu hadis 2800 no da tekrar geçiyor",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 190
			}
		}
	]
}