{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"9": "The Chapters on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1962,
			"arabicnumber": 1962,
			"text": "Sebre (bin Ma'bed (r.a.)'dan; Şöyle demiştir: Biz Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber Veda haccı yolculuğuna çıktık. Sonra sahabiler: Ya Resulallah! Bekarlık bize cidden çetin geldi, dediler. Efendimiz (Sallallahu Aleyhi ve Sellem): «(Nikahlanmasına engel bulunmayan) şu kadınlarla mut'a suretiyle evlenebilirsiniz» buyurdu. Bunun üzerine biz onların yanına vardık. Onlar ancak bizlere kendileri arasına belirli bir süre koyduğumuz takdirde bizlerle evlenmeyi kabul edebileceklerini belirttiler. Bunun üzerine sahabiler bu durumu Nebi (Sallallahu Aleyhi ve Sellem)'e anlattılar. Efendimiz (Sallallahu Aleyhi ve Sellem) : «Onlarla aranıza belirli bir süre koyunuz.» buyurdu. Sonra ben ve bir amcam oğlu çıkıp gittik. (Mehir olmaya elverişli mal olarak) amcam oğlunun beraberinde bir hırka vardı. Benim de yanımda bir hırka vardı. Onun hırkası benimkinden iyi idi. Ben de ondan daha gençtim. Nihayet bir kadının yanına vardık. (Ve evlenme teklifinde bulunduk.) Kadın (benimle evlenmeyi tercih ederek): Bir hırka diğer hırka gibidir, dedi. Bunun üzerine ben (hırkamı mehir vererek) onunla evlendim. Ve o gece onun yanında durdum. Ertesi gün gittim. Resulullah (Sallallahu Aleyhi ve Sellem) Ka'be'nin kapısı ile rüknü arasında ayakta şöyle buyuruyordu: «Ey insanlar! Ben gerçekten mut'a suretiyle evlenmek için sizlere izin vermiştim. Bilmiş olunuz ki: Şüphesiz Allah Teala bunu kıyamet gününe kadar haram kıldı. Artık kimin yanında mut'a suretiyle evlendiği kadınlardan varsa derhal ona yol versin ve onlara mehir olarak verdiğinizden bir şeyi (geri) almayınız.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 118
			}
		}
	]
}