{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"9": "The Chapters on Marriage"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1989,
			"arabicnumber": 1989,
			"text": "Abdullah (bin Mes'ud) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), güzellik için dövme yaptıran, dövünlenen, yüzünün kıllarını yolduran ve ön dişlerini (eğe gibi aletlerle) aralayan ve bu suretle Allah'ın yarattığı tabii güzelliği değiştiren kadınları Ianetlemiştir. Beni Esed kabilesinden Ümmü Yakub isimli bir kadın (İbn-i Mes'ud'un) bu hadisini duyunca İbn-i Mes'ud'a gelerek: Senin böyle böyle söylediğini haber aldım, dedi. İbn-i Mes'ud (r.a.): Söylediğim şey Allah'ın kitabında bulunduğu halde Resulullah (Sallallahu Aleyhi ve Sellem)'in lanetlediği kimseleri niçin ben de lanetlemiyeyim? dedi. Kadın: Ben şüphesiz Allah'ın kitabının tamamını okurum. (Onda) senin dediğin bu hususu bulamadım, dedi. İbn-İ Mes'ud: Eğer sen Kur'an'ı okudu isen şübhesiz dediğim hususu bulmuşsun. Sen: وما آتاكم الرسول فخذوه، وما نهاكم عنه فا نتهوا \"Rasul size ne getirdi ise onu alın, sizi neden nehyetti ise de derhal vazgeçin\"[Haşr 17] ayetini okumadın mı? diye cevap verince, kadın : Evet. (Ben bu ayeti okudum) dedi. Ibn-i Mes'ud: Resulullah (Sallallahu Aleyhi ve Sellem) dediğim şeyi şübhesiz yasakladı. (Bu kere) kadın: Sanırım senin aile ferdlerin (yasaklandığını haber verdiğin şeyi) yaparlar, dedi. İbn-i Mes'ud: Git de bak, dedi. Kadın gidip baktı da aradığını bulamadı. (Sonra döndü ve) bir şey göremedim, dedi. Abdullah (ibn-i Mes'ud) kadına: Eğer benim ailem senin dediğin gibi olmuş olsaydı bizimle yaşıyamazdı (yani onu boşardık), dedi. Diğer tahric: Buhari, Libas: Müslim, Libas: Nesaî, Ziyne: Tirmizî Edep: Ebu Davud, tetreccül (4169)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 9,
				"hadith": 145
			}
		}
	]
}