{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"10": "The Chapters on Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2031,
			"arabicnumber": 2031,
			"text": "Zeyneb bint-i Kâ'b bin Ucra (r.anha)'dan rivayet edildiğine göre; Kocası Ebû Saîd-i Hudrî (r.a.)'ın kız kardeşi Furay'a bint-i Mâlik (r.anha) şöyle demiştir : Kocam, (kaçan) kölelerini aramaya çıktı ve Kadûm tarafında onlara yetişti. Köleler kocamı (orada) öldürdüler. Kocamın ölüm haberi geldi. Ben o sıralarda babamın evine uzak düşen Ensar'ın evlerinin birisinde ikâmet ediyordum. Bunun üzerine ben. Nebi (Sallallahu Aleyhi ve Seliem)'in yanına vararak: Yâ Resûlallah! Kocamın ölüm haberi geldi. Ben babamın evinden ve kardeşlerimin evinden uzak olan bir evdeyim. Kocam ne bana harcanacak bir mal bıraktı, ne mirasçıhk yolu ile sahip olduğum bir mal bıraktı, ne de maliki bulunduğu bir ev bıraktı. Babamın evine ve kardeşlerimin evine taşınmama izin verirseniz şüphesiz bunu çok arzularım ve bazı işlerim yönünden iyi olur, diye müsaade istedim. Efendimiz : «Ditersen (taşınma işini) yap,- buyurdu. Furay'a demiştir İd : Resulullah (Sallallahu Aleyhi ve Sellem)'in dili ile Allah'ın benim için verdiği bu hükme sevinçli olarak Nebi'in huzurundan ayrıldım. Nihayet ben mescidde veya evin sahanlığında iken, Efendimiz beni (geri) çağırarak: «Sen nasıl söyledin?» buyurdu. Furay'a demiştir ki: Ben söylediklerimi tekrar anlattım. Bunun üzerine O, bana: «Yazılı (yâni süresi Kur'an da belirli) iddet süresi tamamlanıncaya kadar, sen kocanın ölüm haberini aldığın evinde dur» buyurdu. Furay'a demiştir ki: Ben o evde dört ay on gün iddet olarak durdum. Diğer tahric: Bu hadisi dört sünen sahibIeri, Malik, Şafii, Ahmed ve Hakim rivayet etmişlerdir. Bazı rivayetlerdeki ifade değişikliği manayı etkilemez",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 16
			}
		}
	]
}