{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"10": "The Chapters on Divorce"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2066,
			"arabicnumber": 2066,
			"text": "Sehl bin Sa'd-i Saidî (r.a.)'daa rivayet edildiğine göre şöyle demiştir: (Aclan oğullarından) Uveymir, (Aclan oğullarının başı olan) Asim bin Adî'ye gelerek: Benim için Resulullah (Sallallahu Aleyhi ve Sellem)'e şu soruyu sor, dedi: (Ya Resûlallah!)ne dersin? Bir kimse, karısının beraberinde bir adamı bulsa (zina ettiklerini muhakkak bilse) ve (zani) adamı öldürse, bu Öldürme nedeni ile kadının kocası kısas olarak öldürülür mü? Yoksa kadının kocası ne yapar? Asim da gidip bu soruyu Resulullah (Sallallahu Aleyhi ve Sellem)'e sordu. Fakat Resulullah (Sallallahu Aleyhi ve Sellem), bu soruları ayıpladı. Sonra Uveymir, Asım'a rastladı ve: Ne yaptın? diye sordu. Asim ona: Sen bana iyi bir iş getirmedin. Ben (senin sorunu) Resulullah (Sallallahu Aleyhi ve Sellem)'e sordum. Ama O, bu soruları ayıpladı (böyle meseleleri sormayı çirkin gördü), dedi. Bunun üzerine Uveymir : — Vallahi ben kendim Resulullah (Sallallahu Aleyhi ve Sellem)'e gidip bu soruyu muhakkak soracağım, dedi ve Resulullah (Sallallahu Aleyhi ve Sellem)'in huzuruna çıktı. Baktı ki kendisi ile karısı hakkında Resul-i Ekrem (Sallallahu Aleyhi ve Sellem)'e Kur'an ayetleri indirilmiş. Bunun üzerine Resul-i Ekrem (Sallallahu Aleyhi ve Seliem), Uveymir ile karısı (Havle) arasında Lian işlemini icra etti. Bu işlemden hemen sonra Uveymir: Ey Allah'ın Resulü! Allah'a yemin ederim ki eğer ben bu kadını götürsem (yani nikahım altında tutarsam) onun aleyhinde yalan söz söylemiş olurum, dedi. Ravi demiştir ki: Ve Resulullah (Sallallahu Aleyhi ve Sellem), Uveymir'e (karısını boşamasını) emretmeden önce kendisi karısından ayrıldı (yani üç talakla boşadı). Artık lanetleşen karı, koca hakkında bu şekil boşama, uyulan bir yol oldu. Sonra Nebi (Sallallahu Aleyhi ve Seliem) (orada bulunanlara): «Bu kadın'a nezaret ediniz. Eğer vücudu siyah, gözlerinin siyahı koyu, kalçaları iri (ve baldırları kaba) bir çocuk getirirse ben Uveymir'in bu kadına zina isnadında gerçekten doğru olduğunu sanırım. Eğer kadın keler nevinden kızılca kurt gibi kızılca bir çocuk getirir (doğurur) ise ben Uveymir'in yalancı olduğunu sanırım» buyurdu. Ravi demiştir ki sonra kadın hoşlanılmayan (Yani zina isnadını doğrulayıcı) surette bir çocuk getirdi.\" Diğer tahric: Bu hadisi, Tirmizi hariç Kütüb-İ Sitte sahibieri ve imamlar da rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 10,
				"hadith": 51
			}
		}
	]
}