{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 213,
			"arabicnumber": 213,
			"text": "Sa’d bin Ebi Vakkas r.a.’den, Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu dediği rivayet olunmuştur: '' Sizin en hayırlılarınız Kur'an’ı öğrenenler ve öğretenlerdir. '' (Ravi) dedi ki ve: (Bana hadisi rivayet eden zat) elimi tuttu ve beni bu oturduğum (Kur'an öğretme) mevkiine oturttu, Kur'an okutuyorum. '' Not: Zevaid de: ‘’Bu hadis’in isnadı zayıftır.’’ Deniyor. AÇIKLAMA (211, 212 ve 213) : Birinci hadisin senedindeki ravilerden Yahya bin SaiD El-Kattan, iki zattan rivayette bulunmuştur: Şu'be'den aldığı rivayette hadisin metni: 'Sizin en hayırlısınız ...' diye başlar. Süfyan'dan aldığı rivayette ise metin: «Sizin en faziletliniz ...•• şeklinde başlar. Bu husus hadisin rivayetinde belirtildiği için biz de parentez içi ifadelerle durumu belirttik. Son hadiste Resulullah s.a.v.'in buyruğu bittikten sonraki sözün hangi raviye ait olduğu belirtilmemiştir. Eldeki İbn-i Maceh «Sünen •• nüshasının dip notunda Muhammed Fuad abdulbaki: Bu sözün ravi Asim bin Behdele'ye ait olması umulur. Çünkü kendisi zamanının Kur'an okuyucularının imamı idi. bölümün manası da şöyle olur: Mus'ab bin Sa'd elimi tutup beni Kur'an öğreticiliği mevkiine oturttu- demiştir. Buhari Fadililu'I-Kur'an kitabının 21'nci babında ilk iki metni yine Osman bin Affan r.a.'den rivayet etmiştir. SenedIerindeki ravilerin bir kısmı buradaki ravilerdir. Hadisler Kur'an-ı Kerim'i öğrenmenin ve öğretmenin faziletini beyan ederek bu ulvi hizmeti ifa eden kimsenin en hayırlı ve faziletli insanlardan olduğunu ifade ediyor. Çünkü böyle bir mu'min hem kendi nefsini hem de başkalarını olgunlaştırır. Kendisi yararlanır, halkı da yararlandırır. Bir soru hatıra gelebilir: Hadislerin zahirine göre Kur'an öğrenimi ve öğretimi ile meşgul olanlar en hayırlı ve en faziletli insanlardır. Bu duruma göre bunlar fıkıh ilminin öğrenim ve öğretimi ile meşgul olanlardan daha mı üstündürler? Cevab: Hayır. Fıkıhçı bir kimse Kurra' olanlardan üstündür. Bu hadislerdeki muhatablar Sahabilerdir. Ashab-ı kiram ise fıkıhçı idiler. Şu halde hadisten alınan netice şudur: Fıkıh bilgisi yanında kıraatla da iştigal eden kimseler daha hayırlı ve faziletlidirler. Buhari'nin şerhi Kastalani bu soru ve cevabı belirttikten sonra şöyle sö.yler: Kur'an öğrenmek ve öğretmekle meşgul olan kimse, cihad eden veya cephede nöbet bekleyen veyahut marufu emredip münkeri men eden kimseler gibi ağır ve tehlikeli yükler altına girenlerden üstün mü? diye sorulsa buna cevaben denilecek ki: Bu hususta ölçü yararlı olmaktır. Hangisi cemiyete daha çok yararlı olursa o daha hayırlıdır. Diğer bir açıdan şunu da belirtelim ki kanaatımca hadislerden kasdedilen mana. Kur'an-ı öğrenmek ve öğretmekle meşgul olan kimsenin en hayırlı ve en faziletli insan olduğunu belirtmek değildir. Gaye böyle bir kimsenin en hayırlı ve en faziletli insanlardan sayıldığını belirtmektir. Hadisler Kur'an öğretimini teşvik eder. İbn-i Ebi Davud'un rivayetine göre Sevri'ye cihad ile Kur'an öğretiminden hangisinin daha sevab olduğu sorulduğunda, Sevri, Kur'an öğretimini tercih etmiştir.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 213
			}
		}
	]
}