{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"12": "The Chapters on Business Transactions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2250,
			"arabicnumber": 2250,
			"text": "Ebu Musa (el-Eş'ari) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) câriye ile çocuğunu ve (köle olan) iki kardeşi biribirinden ayıran kimseye la'net etmiştir. AÇIKLAMA 2248, 2249 VE 2250 : Zevaid türünden olan İbni Mes'ud (r.a.)'m hadisini Ahmed de rivayet etmiştir. Ali {r.a.)'ın hadisini Tirmizi ve Hakim de rivayet etmiştir. Ebu Musa (r.a.)'ın hadisinin Zevaid türünden olduğuna dair bir kayıt bulunmamakla beraber Kütüb-i Sitte'nin diğerlerinde göremedim. El-Münziri'nin bildirdiğine göre Darekutni de rivayet etmiştir. Camiü's-Sağir'de, İbni Mace'den rivayet edilmiştir. Bu itibarla Zevaid türünden olması kuvvetle muhtemeldir. İlk hadise göre, esir alınan aile ferdIerinin hepsinin toplu halde bir kimseye verilmesi gerekir, Resul-i Ekrem (s.a.v.) böylelerini biribirinden ayırmak istemezdi. Hadis metninin açık manası ve yorumu böyledir. Camiü's-Sağir haşiyesinde el-Hafni şöyle der: Yani esirler içinde bir kadın ile çocuğu veya bir erkek ile çocuğu ya da iki kardeş bulunduğu zaman Resul-i Ekrem (s.a.v.) kadını birisine, çocuğunu da başka şahsa vermezdi. Keza erkeği bir şahsa, çocuğunu da başka şahsa vermezdi. Kardeşleri de ayrı ayrı kişilere vermezdi. Resul-i Ekrem (s.a.v.), üstün merhameti dolayısıyla kadınla çocuğunu aynı şahsa, erkekle çocuğunu birlikte bir kişiye ve iki kardeşi de beraberce bir adama verirdi. Ali (r.a.)'ın hadisine göre esir edilen iki kardeşi biribirinden ayırmamalıdır. Bu hadiste geçen \"Gulam\" kelimesi, erginlik çağına yaklaşmış erkek çocuk, oğlan çocuk, köle ve hizmetçi anlamlarına gelir. Burada hangi mananın kasdedildiğine dair bir kayda rastlamadım. Bunların köle olduğu açıktır. Fakat yaş durumlarının ne olduğuna dair bir sarahat yoktur. Ancak, köle manasını ifade eden \"Abd\" kelimesi yerine \"Gulam\" kelimesinin kullanılmış olması nedeniyle bunların gencecik oldukları kuvvetle muhtemeldir. Aşağıda, alimlerin görüşleri beyan edilirken görüleceği üzere, ana ile evlad durumundaki iki esiri biribirinden ayırmamak hükmü, evladın küçük yaşta olması haline tahsis edilmektedir. Evlad büyüdükten sonra anasından ayırmakta bir sakınca görülmemektedir. Durum bu olunca iki kardeşin de küçük yaşta olduğu ihtimali kuvvet kazanır. Hakikatını Allah bilir. Ali'nin sattığı köleyi geri alması için verilen emrin zahirine göre yapılan satış sahih sayılmamıştır. Ebu Musa (r.a.)'ın hadisi de cariye ile çocuğunu ve köle olan kardeşleri biribirinden ayırmanın yasaklığına ve bu hareketin Allah'ın rahmetinden uzak kalmaya sebep olduğuna delalet eder. Resul-i Ekrem (s.a.v.)'in lanet etmesi kişinin Allah'ın rahmetinden uzak kalması için dilekte bulunması demektir. Bunun nasıl bir tehdid olduğu açıktır. ESİR EDİLEN AİLE FERDLERİNİ BİRİBİRİNDEN AYIRMANIN HÜKMÜ HAKKINDAKİ ALİMLERİN GÖRÜŞLERİ: Tuhfe yazarı bu babtaki hadislerin şerhinde şöyle der: \"Burada cariye ile çocuğunu ayırmadan maksat birisini satıp diğerini satmamak veya ikisini ayrı ayrı şahıslara satmak ya da hibe yolu ile bunları ayrı ayrı kimselere vermektir. Esir alınan baba ile çocuğu da aynı hükme tabidir. Hatta biribirine mahrem durumunda olan yakın akrabalar da böyledir. Yani esir alınan aile ferdIerinden biribirine mahrem olanlar bir müslümana verildikten sonra, onun bunları dağıtıp ayrı ayrı şahıslara satması veya hibe etmesi ya da birisini yanında alıkoyup diğerini başkasına vermesi hükmü de aynıdır, yasaktıI\". Şerhü's-Sünne'de: Nene, dede ve babanın hükmü de böyledir, denilmiştir. Şevkani de: Bu babta rivayet edilen hadisler, cariye ile çocuğunu ve kardeşleri biribirinden ayırmanın haramlığına delalet ederler. Cariye ile çocuğunu biribirinden ayırmanın haramlığı husüsunda icma bulunduğu el-Bahir'de İmam Yahya'dan naklen beyan edilmiştir. Bu beyana göre, çocuk, anasına muhtaç olmayacak yaşa geldikten sonra, ayırmak caizdir. Ayırmak haram olduğuna rağmen yapılacak satış sahih mi, yoksa geçersiz mi? Ebu Hanife'ye ve bir kavlinde Şafii'ye göre satiş akdi geçerlidir. Şafii'nin diğer bir kavline göre satış batıl ve geçersizdir. Baba ile çocuğunu ayırmaya gelince, bazı fıkıhçılar bunlan biribirinden ayırmanın haram olmadığına hükmetmişlerdir. EI-Bahir sahibi: Baba anaya kıyas edilir, demiştir. Usül ve furü dışında kalan yakınları biribirinden ayırmanın hükmü ise, Hanefiler'e göre bu da haramdır. Şafii'ye göre haram değildir. Kardeşleri ayırmanın haramlığı buradaki nasslarla sabittir. Fakat diğer yakınları bunlara kıyaslamak tam yerinde değildir. Çünkü aralarında fark vardır. Kardeşleri veya ana ile çocuğu biribirinden ayırmadan doğan güçlük başkadır, diğer yakınları biribirinden ayırmanın güçlüğü bu kadar zor değildir. Şu halde diğer akrabaları bunlara kıyaslamak uygun ve yerinde değildir .. Hadislerin zahirine göre söz konusu ayırma satış yolu ile olsun veya başka yolla olsun hepsinin hükmü birdir. Ancak bunları ayıran kişi istek ve irade dışı ayırırsa bunun bir sakıncası yoktur. MeseIa,: Esirler, gaziler arasında taksim edilirken bazen yakın akrabaları biribirinden ayırmak mecburiyeti hasıl olur, diye bilgi vermiştİr. Söz konusu yakınlar kaç yaşına varınca ayırmak caiz olur? Tuhfe yazan bu hususta da şöyle der: 1. Ebu Hanife'nin arkadaşlanna göre, küçükleri, erginlik çağına varıncaya kadar \"ayırmak caiz değildir. 2. Şafii'ye göre çocuk yedi veya sekiz yaşa varınca ayırmak caiz olur. 3. Malik'e göre çocuk diş çıkarınca ayırmak caiz olur. 4. Ahmed'e göre çocuk büyüyüp erginlik çağına varsa bile ayırmak caiz olmaz. Hanefiler; Küçük yaştaki kardeşleri ayırmak caizdir, Fakat birisi küçük, diğeri büyük yaşta iseler ayırmak caiz değildir, demişlerdir. EI-Gays'ta beyan edildiğine göre, esir akrabalar, erginlik çağına vardıktan sonra, ayrı ayrı kişilere satış, hibe veya başka yollarla verilebilir ve bu hususta icma vardır. Erginlik çağına varanları ayırmanın caizliği için Darekutni ile Hakim'in rivayet ettikleri Ubade bin es-Samit (r.a.)'ın şu mealdeki hadis de delil gösterilmiştir: \"Ana ile çocuğu biribirinden tefrik edilmez. (Ayrı şahıslara satılamaz, hibe edilemez) Bunun üzerine: Ne zamana kadar? diye soruldu. Buna cevaben buyuruldu ki: Erkek çocuk, erginlik çağına varıncaya ve kız çocuk, aybaşı adetini görünceye kadar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 114
			}
		}
	]
}