{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"19": "The Chapters on Manumission (of Slaves)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2521,
			"arabicnumber": 2521,
			"text": "“... Peygamber (sallallahü aleyhi ve sellem)’in zevcesi Âişe (radıyallahü anhâ)’dan rivâyet edildiğine göre : (radıyallahü anhâ), dokuz okka (yani 360 dirhem) ödemek üzere âzadlanması için efendileriyle kitabet akdini yapan mükâtebe bir câriye iken O'na (yani Âişe'ye) geldi (Bu meblâğın ödenmesi hususunda ondan yardım diledi. ) Âişe, Berîre'ye: Eğer efendilerin arzu ederlerse, velâ hakkı (yani sen öldüğün zaman veraset hakkı) bana ait olmak üzere defaten onlara öderim (Yani bu meblâğla seni onlardan satınalırım ve sonra seni âzadlarım), dedi. Râvî demiştir ki : Berire efendilerinin yanına giderek durumu onlara anlattı. Fakat onlar (bu teklifi) kabul etmediler, meğer ki Âişe, Berire'nin velâ hakkını kendilerine şart koşa. Sonra Âişe, bu durumu Peygamber (sallallahü aleyhi ve sellem)'e arz etti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem), (Âişe'ye) : (yani Berireyi onlardan satın al ve sonra âzadla. Çünkü velâ hakkı âzadlayanadır. Onların koştukları şart geçersizdir. ) buyurdu. Râvî demiştir ki: Sonra Peygamber (sallallahü aleyhi ve sellem) kalktı ve (Mescide gidip) halka karşı bir hutbe irâd buyurdu. Allah'a hamd ve sena ettikten sonra şöyle buyurdu : takım adamlara ne oluyor ki, onlar Allah'ın kitabında (Yani hükmünde) olmayan bir takım şartları şart koşuyorlar. Allah'ın kitabında olmayan (ve ona aykırı olan) her şart, yüz adet şart olsa bile o bâtıldır (geçersizdir). Hak olan, Allah'ın kitabıdır ve kuvvetli olan Allah'ın şartıdır. Velâ hakkı da (köleyi - cariyeyi) âzadlayana aittir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 19,
				"hadith": 10
			}
		}
	]
}