{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"20": "The Chapters on Legal Punishments"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2613,
			"arabicnumber": 2613,
			"text": "Safvân bin Ümeyye (bin Halef) (r.a.)'den: Şöyle demiştir: (Bir kere) biz Resulullah (Sallallahu Aleyhi ve Sellem)'in yanında idik. (Bu arada) Amr bin Mürre geldi ve: Yâ Resûlallah! Allah şüphesiz benim kaderimde musibet yazmıştır. Çünkü ben elimle tef çalmaktan başka hiç bir yolla rızıkIanmamı sanmıyorum. Bu nedenle hayâsızlık durumu olmaksızın şarkıcılık etmem için bana izin ver, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) (ona): «Sana izin vermem, (sana) ikram yok ve hoşnutluk da yoktur. Yalan söyledin, ey Allah'ın düşmanı Allah şüphesiz sana helâl ve güzel rızık edilme imkânını vermiştir. Ama sen Allah Azze ve Celle'nin sana helâl kıldığı, rızık yerine Allah'ın sana haram kıldığı rızkı tercih ettin. Eğer bu yasaklama hükmünü daha önce sana iletmiş olsaydım şimdi sana (hak ettiğin) cezayı verirdim. Kalk benim yanımdan ve Allah'a tevbe et. Bilmiş ol ki, bu yasağı duyduktan sonra (bu işi) yaparsan seni fena bir şekilde dövdüreceğim, ibret olarak senin başını (usturayla) traş ettireceğim, seni aile ferdlerinden uzaklaştırıp sürgün edeceğim ve senin (yağmaladığın malını) ganimet olarak Medine gençlerine helâl kılacağım» buyurdu. Râvî demiştir ki: Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem)in bu buyruğundan sonra Amr (bin Mürre) öyle kötü ve rezil bir durumda kalktı ki bunun derecesini ancak Allah bilir. Amr defolup gidince Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu: «Bunlar âsilerdir. Bunlardan kim tevbe etmeden ölürse Allah Azze ve Celle onu kıyamet günü dünyada olduğu gibi muhannes, çıplak ve insanlara karşı bir ince yaprakla olsun örtünmez vaziyette haşredeçektir, ayağa kalktıkça yere yıkılacaktır.»",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 20,
				"hadith": 81
			}
		}
	]
}