{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2638,
			"arabicnumber": 2638,
			"text": "Aîşe (r.anha)'dan; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Ebû Cehm bin Huzeyfe (r.a.)'i zekât tahsildarı olarak (taşraya) gönderdi. Bir adam zekâtı hakkında Ebû Cehm ile münâkaşa ediyor. Bunun üzerine Ebû Cehm onu dövüp başını kırıyor. Sonra adamın yakınları Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resûlallah! Kısas, dediler. Nebi (Sallallahu Aleyhi ve Sellem) (onlara): «Size şu kadar (mal verilsin), buyurdu. Adamlar razı olmadılar. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Ödenecek tazminat mikdarını artırarak) size şu kadar (mal verilsin)» buyurdu. Adamlar razı oldular. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) (adamlara): «Ben (öğleden sonra) halka hitabede bulunacağım ve sizin razı olduğunuzu onlara bildireceğim,» buyurdu. Adamlar: Evet, dediler. Buna binâen Nebi (Sallallahu Aleyhi ve Sellem) bir konuşma yaptı ve: «Şu Leysîler kısas talebinde bulunmak üzere bana baş vurdular. Ben onlara (kısas yerine) şu kadar (tazminat) teklif ettim,» buyurdu. (onlara.dönüp): Razı oldunuz mu? dedi. Adamlar; Hayır, dediler. Bunun üzerine muhacirler onları menetmek istediler. Fakat Nebi (Sallallahu Aleyhi ve Sellem} muhacirlerin vazgeçmelerini emretti. Muhacirler de vazgeçtiler. Sonra Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) onları çağırdı ve kendilerine verilecek mal miktarını artırdı. Sonra (onlara); «Razı oldunuz mu?» buyurdu. Adamlar: Evet, deyince. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem): «Ben halka konuşma yapacağım ve sizin razı olduğunuzu onlara haber vereceğim,» buyurdu. Adamlar; Peki, dediler. Sonra Nebi (Sallallahu Aleyhi ve Sellem) halka konuşma yaptı. Sonra (adamlara): «Razı oldunuz mu?» buyurdu. Adamlar da: Evet, dediler. İbn-i Mâceh dedi ki: Ben, Muhammed bin Yahya'dan şu sözleri işittim: Bu hadîsi yalnız Ma'mer rivayet etti. Kendisinden başka kimselerin bunu rivayet ettiklerini bilmiyorum",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 24
			}
		}
	]
}