{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2677,
			"arabicnumber": 2677,
			"text": "“... Sehl bin Ebî Hasme (radıyallahü anh)’ın kendi kavminin ileri gelen adamlarından rivâyetine göre : bin Sehl (bin Zeyd) ve Muhayyısa (bin Mes'ûd bin Zeyd) (radıyallahü anhüma) başlarına gelen fakirlikten dolayı (bir hurma mevsiminde hurması bol olan) Hayber'e (dostları yanında hurma toplamaya) gittiler. (Ve Hayber'e vardıklarında kendi işlerine bakmak üzere birbirinden ayrıldılar. Bir süre) sonra Muhayyis'a gelinip, Abdullah bin Sehl'in öldürülüp bir kuyuya veya bir pınara atılmış olduğu haberi verildi. Bunun üzerine Muhayyısa Hayber yahûdîlerîne giderek: Allah'a yemin ederim ki onu siz öldürdünüz, deyince yahûdîler: Allah'a and olsun ki onu biz öldürmedik, dediler. Sonra Muhayyısa ordan (Medine'ye) dönüp kavminin yanına varıyor ve durumu onlara anlatıyor. Daha sonra kendisi, ağabeyisi Muhayyısa ve Abdurrahmân bin Sehl kalkıp (Peygamber) (sallallahü aleyhi ve sellem'e) gittiler. (Önce) Muhayyısa söze başladı, (maktul ile beraber) Hayber'de olan kendisi idi. Fakat Resûlüllah (sallallahü aleyhi ve sellem) Muhayyısa'ya yaşça büyüklüğü kasdederek: sözü büyüğe bırak, ilk sözü büyüğe bırak), uyarısında bulundu. Bunun üzerine (Muhayyısa sustu ve ağabeyisi) Huvayyısa olayı anlattı. Ondan sonra da Muhayyısa konuştu. Neticede Resûlüllah (sallallahü aleyhi ve sellem) onlara: yahûdîleri ya (öldürülen) arkadaşınızın diyetini (kan bahasını) öderler, veya onlara (karşı Allah ve Resulü tarafından) bir savaş ilân edilir, ) buyurdu. Sonra Resûlüllah (sallallahü aleyhi ve sellem) bu konu hakkında (Hayber yahûdilerine) yazı yazdırdı. (Bu yazıya cevaben) onlar: yemin ederiz ki onu katiyyen biz öldürmedik, diye yazı gönderdiler. Bu cevab üzerine Resûlüllah (sallallahü aleyhi ve sellem), Huvayyısa. Muhayyısa ve Abdurrahmân'a: cinayetin Hayber yahûdîleri tarafından işlendiğine yemin eder (mi) siniz ve (bu takdirde) arkadaşınızın kan bedeline müstahak olursunuz?) buyurdu. Bunlar: (yanında) bulunmadığımız ve görmediğimiz bir cinayet hakkında nasıl yemin ederiz? dediler. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : halde yahûdîler (bu cinayetten habersiz olduklarına dâir) size yemin ederler, ) buyurdu. Bunlar: müslüman değiller, (nasıl onların yeminlerine itibar ederiz), dediler. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) maktulün diyetini kendi yanından verdi. Resûlüllah (sallallahü aleyhi ve sellem) maktulün yakınlarına yüz adet dişi deve gönderip ta evin içinde onlara teslim ettirdi. Sehl (bin Ebi Hasme) demiştir ki: O sürüden kırmızı bir dişi deve bana tekme attı. \" \". . , Amr bin Şuayb'in dedesi (Abdullah bin Amr bin el-As) (radıyallahü anhüm)’den; Şöyle demiştir : oğullan Huvayyısa ve Muhayyısa ile Sehl'in oğullan Abdullah ve Abdurrahmân (radıyallahü anhüm), Hayber'de yiyecek temini maksadıyla, (Medîne-i Münevvere'den) çıkıp gittiler. (Hayber'de) Abdullah'a zulüm edilip öldürüldü. Sonra durum Resûlüllah (sallallahü aleyhi ve sellem)'e anlatıldı. Resûl-i Ekrem (sallallahü aleyhi ve sellem) (maktulün arkadaşlarına) : (Abdullah'ın Hayber yahûdîleri tarafından öldürüldüğüne) yemin edersiniz ve (kan bedeline) müstahak olursunuz)? buyurdu. Onlar: Yâ Resûlallah yanında bulunmadığımız bir cinayet hakkında nasıl yemin ederiz? dediler. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (Şu halde yahûdiler (yemin etmekle) isnad ettiğiniz suçtan beraet ederler. ) buyurdu. Onlar; Yâ Resûlallah! Yahudiler yemin etmekle beraet edebilince bizi öldürürler, dediler. Râvî demiştir ki: Bunun sonucunda Resûlüllah (sallallahü aleyhi ve sellem) maktulün diyetini kendi yanından verdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 63
			}
		}
	]
}