{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"21": "The Chapters on Blood Money"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2691,
			"arabicnumber": 2691,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den; Şöyle demiştir : (sallallahü aleyhi ve sellem) hayatta iken bir adam (bir müslüman kişiyi) öldürmüştü. Dâva Peygamber (sallallahü aleyhi ve sellem)'e arzedildi. Peygamber (sallallahü aleyhi ve sellem) de katili (kısas edilmek üzere) maktulün velîsine teslim etti. Bunun üzerine katil: Resûlallah Allah'a yemin ederim ki ben maktulü kasden öldürmedim, dedi. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) , maktulün velîsine:(Bilmiş ol ki, katil eğer gerçekten doğru sözlü olup sonra sen onu öldürür isen Cehennem ateşine girersin, ) buyurdu. Hüreyre dedi ki: Bu buyruk üzerine maktulün velîsi katili serbest bıraktı. Ebû Hüreyre dedi ki: Katilin elleri bir enli ve uzun kayışla arkasından bağlı idi. Katil, kayışını çekerek, yederek çıkıp gitti. Bu nedenle kendisine Ze'n-Nis'a ( = kayış sahibi) ismi verildi, \" '..... Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre : adam, velisinin katilini Resûlüllah (sallallahü aleyhi ve sellem)'e getirdi. Peygamber (sallallahü aleyhi ve sellem) (adama) : bağışla, ) buyurdu. Adam bağışlamaktan imtina etti. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) : (kan bahasını) al, ) buyurdu. Adam (bundan da) imtina etti. (Bu kere) Peygamber (sallallahü aleyhi ve sellem) : katili öldür, şüphesiz sen (onu öldürür isen) onun mislisin, ) buyurdu. Enes dedi ki: Sonra adama arkadan yetişildi ve kendisine denildi ki, Resûlüllah (sallallahü aleyhi ve sellem) : öldür. Şüphesiz sen (onu öldürürsen) onun mislisin, ) buyurdu. Adam bunun üzerine katile yol verdi. (radıyallahü anh) dedi ki: Katil, (bağlı bulunduğu ve son anda çözülen) kayışını yederek, ev halkının yanına doğru gider vaziyette görüldü. Enes (radıyallahü anh) dedi ki; maktulün velîsi galiba katili bağlamıştı. şeyhi) Ebû Umeyr dedi ki: İbn-i Şevzeb, Abdurrahman bin el-Kâsım'in şöyle söylediğini rivâyet etti: Peygamber (sallallahü aleyhi ve sellem)’den sonra (yani O'ndan başka) hiç kimse (maktulün velisine) : (Katili Öldür, şüphesiz sen de (onu öldürürsen) onun mislisin) diyemez. Mâceh dedi ki: Bu, Kemlilerin hadîsidir. Yalnız onların yanında bulunur, (onlardan başka hiç kimsenin yanında bulunmaz)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 21,
				"hadith": 77
			}
		}
	]
}