{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "Kabîsa bin Züeyb (r.a.)'den; Şöyle demiştir: (Sahîh) cedde (Yâni ölünün anne annesi) Ebû Bekir es-Sıddîk (r.a.)'a müracaat ederek mîrasçılık hakkını sormuş, Ebû Bekir de kendisine: Allah'ın kitabında senin (nıîrasçılık hakkın) için bir şey yoktur. Resulullah (Sallallahu Aleyhi ve Sellem)'in sünnetinde (hadîsinde) senin (mirasçılık hakkın) için bir şeyin bulunduğunu da bilmiyorum. Bu itibarla ben (durumu) sahâbilere soruncaya kadar sen git, diye cevap vermiş ve sonra (durumu) sahâbilere sormuştur. (Soruşturma neticesinde) el-Müğîre bin Şu'be (r.a.): Resulullah (Sallallahu Aleyhi ve Sellem) ona (yâni sahîh neneye) altıda bir hisse verirken ben O'nun huzurunda bulundum, demiş. Bunun üzerine Ebû Bekir (r.a.) Müğîre'ye: Senin beraberinde başka şâhid, var mı? diye sorunca Muhammed bin Mesleme el-Ensâri (r.a.) ayağa kalkarak, Müğîre bin Şu'be'nin dediğinin mislini söylemiş. Sonra Ebû Bekir o neneye altıda bir miras hissesinin verilmesine hükmetmiştir. Daha sonra baba tarafından olan diğer nene (yâni ölünün baba annesi) Ömer (r.a.)'a başvurarak mîrasçıhk hakkını sormuştur. Ömer de kendisine: Allah'ın kitabında senin (mirasçılık hakkın) için bir şey yoktur. (Nebi (Sallallahu Aleyhi ve Sellem) ve Ebû Bekir (r.a.) devirlerinde) neneye altıda bir miras hissesine dâir verilen hüküm ancak senden başkası (yâni diğer nene) için idi. Ben miras paylarına bir şey ilâve edici de değilim. Ve lâkin (sahîh) nenenin miras hissesi o südüstür (altıda bir nisbetindeki paydır). Artık bu hissede ikiniz içtima ederseniz bu hisse ikiniz arasmdadır (eşit bölüşürsünüz) İkinizden hangisi tek başına bu hisseye mirasçı olursa bu hisse onadır, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		}
	]
}