{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2724,
			"arabicnumber": 2724,
			"text": "“... Kabîsa bin Züeyb (radıyallahü anh)’den; Şöyle demiştir: cedde (Yani ölünün anne annesi) Ebû Bekir es-Sıddîk (radıyallahü anh)'a müracaat ederek mîrasçılık hakkını sormuş, Ebû Bekir de kendisine: kitabında senin (nıîrasçılık hakkın) için bir şey yoktur. Resûlüllah (sallallahü aleyhi ve sellem)'in sünnetinde (hadîsinde) senin (mirasçılık hakkın) için bir şeyin bulunduğunu da bilmiyorum. Bu itibarla ben (durumu) sahâbilere soruncaya kadar sen git, diye cevap vermiş ve sonra (durumu) sahâbilere sormuştur. (Soruşturma neticesinde) el-Müğîre bin Şu'be (radıyallahü anh) : Resûlüllah (sallallahü aleyhi ve sellem) ona (yani sahîh neneye) altıda bir hisse verirken ben O'nun huzurunda bulundum, demiş. Bunun üzerine Ebû Bekir (radıyallahü anh) el-Müğîre'ye: Senin beraberinde başka şâhid, var mı? diye sorunca Muhammed bin Mesleme el-Ensâri (radıyallahü anh) ayağa kalkarak, el-Müğîre bin Şu'be'nin dediğinin mislini söylemiş. Sonra Ebû Bekir o neneye altıda bir miras hissesinin verilmesine hükmetmiştir. sonra baba tarafından olan diğer nene (yani ölünün baba annesi) Ömer (radıyallahü anh)’a başvurarak mîrasçılık hakkını sormuştur. Ömer de kendisine : kitabında senin (mirasçılık hakkın) için bir şey yoktur. (Peygamber (sallallahü aleyhi ve sellem) ve Ebû Bekir (radıyallahü anh) devirlerinde) neneye altıda bir miras hissesine dâir verilen hüküm ancak senden başkası (yani diğer nene) için idi. Ben miras paylarına bir şey ilâve edici de değilim. Ve lâkin (sahîh) nenenin miras hissesi o südüstür (altıda bir nisbetindeki paydır). Artık bu hissede ikiniz içtima ederseniz bu hisse ikiniz arasındadır (eşit bölüşürsünüz) . İkinizden hangisi tek başına bu hisseye mirasçı olursa (yani diğeriniz yok ise) bu hisse onadır, demiştir. \" \". , , (Abdullah) bin Abbâs (radıyallahü anhümâ)'dan; Şöyle demiştir : (sallallahü aleyhi ve sellem) (sahih) neneyi altıda bir hisseye mirasçı kıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 6
			}
		}
	]
}