{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"23": "Chapters on Shares of Inheritance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2746,
			"arabicnumber": 2746,
			"text": "Amr bin Şuayb'in dedesi (İbn-i Amr) (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Nisbet edildiği babasının ölümünden sonra ilhak edilmesi istenen çocuk, babası olduğu söylenen adam'ın ölümünden sonra mirasçılarının ilhak iddiasında bulundukları kimsedir.» Resül-i Ekrem (Sallallahu Aleyhi ve Sellem) (bu konuda) şöyle hükmetti: «Adamın cinsel ilişkide bulunduğu zaman mâliki bulunduğu bir cariyeden doğma kimse, onun adamm çocuğu olduğunu iddia eden (mirasçılar)a katılmış olur. Fakat ilhak iddiasından önce (adamın mirasçıları arasında) taksim edilmiş olan miras malından o kimseye bir şey yoktur. Henüz taksim edilmemiş mirastan yetiştiği mikdardan hissesi kendisinedir. Nisbet edildiği babası (hayatta iken) onu inkâr etmiş (yâni çocuğu olmadığını söylemiş) olduğu zaman, artık (mirasçılar ilhak iddiasında bulunsa bile) o kimse mirasçılara katılmaz (ve adamın çocuğu sayılamaz). Eğer çocuk, adamın (cinsel ilişkide bulunduğu zaman) mâlik olmadığı bir cariyeden veya zina ettiği hür bir kadından olsa, (adamın mirasçıları ilhak iddiasında bulunsa bile) çocuk adamın evlâdından sayılamaz ve çocuğa mirasçı olunamaz. Kendisine nisbet edilen adam, çocuğun kendisinden olduğunu iddia etse bile hüküm böyledir. Çünkü o, bir zina çocuğudur, hür veya câriye olan annesinin mirasçılarına katılır.» (Râvi) Muhammed bin Râşid demiştir ki: Hadisteki \"İlhaktan önce taksim edilen miras\" sözü ile İslâm'dan önce, câhiliyet devrinde mirasçılar arasında taksim edilmiş olan mal kasdedilmiştir.\" Not: Zevaid'de şöyle denilmiştir: Bunun senedi hasendir. Bu hadis sünenin bazı nüshalannda bulunur, bazılarında bulunmaz ve eI-Müzzi bu hadisi anmamıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 23,
				"hadith": 28
			}
		}
	]
}