{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"24": "The Chapters on Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2781,
			"arabicnumber": 2781,
			"text": "“... Muâviye bin Câhime es-Selemî (radıyallahü anh) şöyle demiştir: Resûlüllah (sallallahü aleyhi ve sellem)'in yanına gelerek: Yâ Resûlallah! Allah rızâsını ve âhiret mutluluğunu dileyerek seninle beraber cihâda cidden niyetlenmişimdir.(Yani cihâda çıkmama müsaade et) dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (Bağışlanasın. Annen hayatta mıdır?) buyurdu. Ben: Evet, dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (Geriye dön de annene itâat, iyilik et) buyurdu. Sonra ben Resûl-i Ekrem (sallallahü aleyhi ve sellem)’e diğer taraftan giderek: Yâ Resûlallah! Ben Allah'ın rızâsını ve âhiret mutluluğunu dileyerek seninle beraber cihâd etmeye cidden niyetlenmişimdir, (yani cihâd'a çıkmama müsade et) dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (Bağışlanasın. Annen hayatta mı?) diye sordu. Ben: Evet, Yâ Resûlallah, dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (O halde sen annenin yanına geri dön ve ona itâat et) buyurdu. Sonra ben Resûl-i Ekrem (sallallahü aleyhi ve sellem)'in önüne çıkıp : Yâ Resûlallah! Ben Allah'ın rızâsını ve âhiret mutluluğunu dileyerek seninle beraber savaşa çıkmaya gerçekten niyetlendi idim, demiş. Resûl-i Ekrem (sallallahü aleyhi ve sellem) ; (Vah sana, vah sana. Annen hayatta mı?) diye sordu. Ben: Evet. Yâ Resûlallah, dedim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : (Allah seni yarlığasın. Sen annenin ayağına sarıl. Çünkü cennet oradadır) buyurdu. ... Muâviye bin Câhime es-Selemî (radıyallahü anhümâ)'dar yapılan (diğer bir) rivâyete göre Câhime, Peygamber (sallallahü aleyhi ve sellem)’in yanına gitmiş ve bunun mislini anlatmıştır. Abdillah İbn-i Mâcete dedi ki: Bu Câhime, Huneyn (savaşı) günü Peygamber (sallallahü aleyhi ve sellem)'i ayıplayan Abbâs bin Mirdas es-Selemî'nin oğlu olan Câhime'dir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 29
			}
		}
	]
}