{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"24": "The Chapters on Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "Büreyde (bin el-Husayb) (r.a.)'den; Şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bir seriyye (askerî müfreze) başına bir adamı kumandan olarak tâyin ettiği zaman adama kendi nefsi hakkında Allah'tan sakınmayı ve beraberindeki müslümanlar hakkında hayrı (yâni iyi davranmayı) tavsiye buyurduktan sonra şöyle buyururdu: (Ey mücâhidler) Allah'ın isminden yardım dileyerek, Allah yolunda cihâd ediniz. Allah'ı inkâr edenlerle muharebe ediniz. Savaşınız. Fakat ahdinizi bozmayınız, ganimet malında hiyânet etmeyiniz, düşmanın vücûdundan parça, organ kesmeyiniz ve çocukları öldürmeyiniz. (Ey kumandan!) Müşriklerden olan düşmanlarına vardığın zaman onları şu üç hasletten (seçenekten) birisini seçmeye davet et. Bunlardan hangisine icabet ederlerse sen onlardan kabul et ve onlardan vazgeç. (O üç haslet şunlardır: Birincisi) Sen onları İslâmiyet'e çağır. Eğer müslüman olmaya icabet ederlerse (bunu) onlardan kabul et ve onlara dokunma. Sonra onları kendi yurtlarından Muhacirlerin yurduna (yâni Medine-i Münevvere'ye) göç etmeye çağır ve onlara şu durumu bildir: Eğer bunu yaparlarsa (yâni Medîne-i Münevvere'ye yerleşirlerse) muhacirler için olan (sevab ve ganimet malı gibi) şeyler onlar için de vardır ve (buna karşılık) muhacirler üzerindeki (savaşa gitmek gibi) yükümlülük onların üstünde de vardır. Şayet (Medine-i Münevvere'ye yerleşmekten) imtina ederlerse onlara şu durumu bildir: (Bu takdirde) onlar müslümanların bedevileri gibi olurlar, mu'minlere uygulanan (namaz, zekât, kısas ve diyet gibi) Allah'ın hükmü onlara da tatbik edilir ve müslümanlarla beraber cihâd etmeleri hâli dışında onlara fey' ve ganimet de hiç bir şey (hak) olmaz. Eğer onlar müslümanlık dînine girmekten imtina ederlerse (ikinci haslet olarak) cizye vermeyi onlardan iste. Şayet yaparlarsa, onlardan kabul et ve onlardan vazgeç. Eğer onlar imtina ederlerse (üçüncü haslet olarak muharebe için) onlar aleyhine Allah'tan yardım dile ve onlarla savaş. Sen bir kaleyi muhasara eder ve kale'dekiler senden kendileri için Allah ahdini ve Peygamberinin ahdini isterler ise sakın onlara Allah'ın ahdini ve Peygamberinin ahdini verme. Ve lâkin onlara kendi ahdini, babanın ahdini ve arkadaşlarının ahdini ver. Çünkü şüphesiz sizlerin kendi ahdinizi ve babalarınızın ahdini bozmanız Allah'ın ahdini ve Resulünün ahdini bozmanızdan sizin için ehvendir. Eğer sen bir kale'yi muhasara eder de kale'dekiler Allah'ın hükmüne uymayı senden isterlerse, sakın onlara Allah'ın hükmünü uygulamayı kabullenme ve lâkin onlara kendi hükmünü uygula.. Çünkü sen onlar hakkında Allah'ın hükmüne isabet edip etmiyeceğini şüphesiz bilemezsin. (Ravi) Alkama demiştir ki: Ben bu hadisi Mukatil bin Hayyan'a naklettim. Bunun üzerine Mukatil dedi ki: Müslim bin Heysam bana bunun mislini en-Numan bin Mukarrin (r.a.) aracılığıyla Peygamber (s.a.v.)'den rivayet etti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 106
			}
		}
	]
}