{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"24": "The Chapters on Jihad"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2858,
			"arabicnumber": 2858,
			"text": "“... Büreyde (bin el-Husayb) (radıyallahü anh)’den) Şöyle demiştir : (sallallahü aleyhi ve sellem) bir seriyye (askerî müfreze) başına bir adamı kumandan olarak tâyin ettiği zaman adama kendi nefsi hakkında Allah'tan sakınmayı ve beraberindeki müslümanlar hakkında hayrı (yani iyi davranmayı) tavsiye buyurduktan sonra şöyle buyururdu: mücâhidler) Allah'ın isminden yardım dileyerek, Allah yolunda cihâd ediniz. Allah'ı inkâr edenlerle muharebe ediniz. Savaşınız. Fakat (varsa) ahdinizi bozmayınız, ganimet malında hiyânet etmeyiniz, düşmanın vücûdundan parça, organ kesmeyiniz ve çocukları öldürmeyiniz. kumandan!) Müşriklerden olan düşmanlarına vardığın zaman onları şu üç hasletten (seçenekten) birisini seçmeye davet et. Bunlardan hangisine icabet ederlerse sen onlardan kabul et ve onlardan vazgeç. (O üç haslet şunlardır: (Birincisi) Sen onları İslâmiyet'e çağır. Eğer müslüman olmaya icabet ederlerse (bunu) onlardan kabul et ve onlara dokunma. Sonra onları kendi yurtlarından Muhacirlerin yurduna (yani Medine-i Münevvere'ye) göç etmeye çağır ve onlara şu durumu bildir : Eğer bunu yaparlarsa (yani Medîne-i Münevvere'ye yerleşirlerse) muhacirler için olan (sevab ve ganimet malı gibi) şeyler onlar için de vardır ve (buna karşılık) muhacirler üzerindeki (savaşa gitmek gibi) yükümlülük onların üstünde de vardır. Şayet (Medine-i Münevvere'ye yerleşmekten) imtina ederlerse onlara şu durumu bildir: (Bu takdirde) onlar müslümanların bedevileri gibi olurlar, mü'minlere uygulanan (namaz, zekât, kısas ve diyet gibi) Allah'ın hükmü onlara da tatbik edilir ve müslümanlarla beraber cihâd etmeleri hâli dışında onlara fey' (kâfirlerden savaşsız alınan mal) ve ganimet (kâfirlerden savaşla alman mal) da hiç bir şey (hak) olmaz. Eğer onlar müslümanlık dînine girmekten imtina ederlerse (ikinci haslet olarak) cizye vermeyi onlardan iste. Şayet (cizye denilen vergi ödeme işini) yaparlarsa, onlardan kabul et ve onlardan vazgeç (yani savaşma). Eğer onlar (bundan da) imtina ederlerse (üçüncü haslet olarak muharebe için) onlar aleyhine Allah'tan yardım dile ve onlarla savaş. Sen bir kaleyi muhasara eder ve kale'dekiler senden kendileri için Allah ahdini ve Peygamberinin ahdini isterler ise sakın onlara Allah'ın ahdini ve Peygamberinin ahdini verme. Ve lâkin onlara kendi ahdini, babanın ahdini ve arkadaşlarının ahdini ver. Çünkü şüphesiz sizlerin kendi ahdinizi ve babalarınızın ahdini bozmanız Allah'ın ahdini ve Resulünün ahdini bozmanızdan sizin için ehvendir. Eğer sen bir kale'yi muhasara eder de kale'dekiler Allah'ın hükmüne uymayı (yani ilâhî hükmün kendileri hakkında tatbik edilmesini) senden isterlerse, sakın onlara Allah'ın hükmünü uygulamayı kabullenme ve lâkin onlara kendi hükmünü uygula. (Yani kendi içtihadına göre onlar hakkında hüküm ver). Çünkü sen onlar hakkında (vereceğin hükümde) Allah’ın hükmüne isabet edip etmiyeceğini şüphesiz bilemezsin",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 24,
				"hadith": 106
			}
		}
	]
}