{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2918,
			"arabicnumber": 2918,
			"text": "“... (Abdullah) bin Ömer (radıyallahü anhüma)’dan; Şöyle demiştir : telbiye'yi Resûlüllah (sallallahü aleyhi ve sellem)'in mübarek ağzından aldım (belledim), O şöyle buyuruyordu: Allahümme Lebbeyk, Lebbeyk la şerik'e leke Lebbeyk, İnnel Hamde ve'n-ni'mete leke ve’l-mülk. La şerike lek.) Ömer'in râvîsi) Nâfi demiş ki: İbn-i Ömer (radıyallahü anhümâ), Peygamber (sallallahü aleyhi ve sellem)’in telbiyesine şunu ekliyordu: Lebbeyke, Lebbeyke ve sa'deyke ve’l-hayru fi yedeyke Lebbeyke Ver-rağbâu ileyke ve’l-amel. \" \". Câbir (bin Abdillah) (radıyallahü anhümâ)’dan; Şöyle demiştir : (sallallahü aleyhi ve sellem)'in telbiyesi şöyle idi: Allahümme Lebbeyk Lebbeyk Lâ şerike leke Lebbeyk. İnne'l-hamde ve'n-ni'mete leke ve’l-mülk. Lâ Şerike lek.) \" \". . . Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre: (sallallahü aleyhi ve sellem), telbiyesinde şöyle (de) demiştir: İlâhe'l-hakki Lebbeyk = Senin dâvetine icabet ediyorum, (Ey) hakkın ilâh'ı! Senin emrini yerine getirmeye hazırım.) \" \". . . Sehl bin Sa'd es-Sâidî (radıyallahü anhümâ)'dan rivâyet edildiğine göre; Resûlüllah (sallallahü aleyhi ve sellem) şöyle buyurmuştur : bir mülebbi (lebbeyk zikrini okuyucu) lebbeyke zikrini okuduğu zaman onun sağında ve solunda bulunan taş, ağaç ve kerpiç de lebbeyke zikrini eder. (Resûl-i Ekrem (sallallahü aleyhi ve sellem) doğuya ve batıya işaret ederek) Yer küresi şuradan ve şuradan bitinceye kadar (bulunan bu maddeler lebbeyke zikrini ederler)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 37
			}
		}
	]
}