{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2957,
			"arabicnumber": 2957,
			"text": "“... Humeyd bin Ebî Sevîyye'den; Şöyle demiştir: bin Ebî Rabâh Ka'be'yi tavaf ederken İbn-i Hişâm (radıyallahü anhüm)'ün kendisine şöyle soru sorduğuna ve kendisinin şöyle cevab verdiğine şâhid oldum: İbn-i Hişâm (radıyallahü anhüm) ; Yemânî(nin fazileti) hakkında (bilgi verir misin? diye) sordu. Atâ bin Ebî Rabâh (radıyallahü anh) : Hüreyre (radıyallahü anh), Peygamber (sallallahü aleyhi ve sellem)'in (Rükn-i Irâki'nin fazileti hakkında) şöyle buyurduğunu bana rivâyet etti, dedi: Yemânî yanında 70 melek görevlendirilmiştir. Kim orada; şüphesiz ben senden afıv, dünyada ve âhirette afiyet (selâmet) dilerim. Ey Rabbımız bize dünyâda iyiyi, âhirette de iyiyi ver ve bizi ateşin azabından koru\" diye dua ederse o melekler âmin, derler. )) bin Ebı Rabâh Hacer-i Esved'in bulunduğu köşe'ye ulaşınca İbn-i Hişâm (ona) : Ebâ Muhammed! Şu Hacer-i Esved(in fazileti) hakkında sana ne (bilgi) ulaşmış? diye sordu. Bunun üzerine Atâ: Hüreyre (radıyallahü anh), Resûlüllah (sallallahü aleyhi ve sellem)’den (Hacer-i Esved'in fazileti hakkında) şöyle buyurduğunu işittiğini bana rivâyet etti, dedi: Hacer-i Esved'e yönelirse şüphesiz o kimse Rahman (olan Allah)a yönelmiş (yani O'na bey'at ve ahıd) etmiş olur. ) Hişâm, Atâ bin Ebi Rabâh'a: Ebâ Muhammed! Tavaf(ın fazileti hakkında işittiğin) nedir? dedi. Hüreyre (radıyallahü anh), Resûlüllah (sallallahü aleyhi ve sellem)'den (tavaf hakkında) şöyle buyurduğunu işittiğini bana rivâyet etti, dedi: Ka'be'yi yedi defa tavaf eder ve (tavaf esnasında) :\"Allah'ın her nevî noksanlıklardan pâk ve nezih olduğuna inanırım. Hamd Allah'a mahsustur. Allah'tan başka ilâh yoktur ve Allah (her şeyden) büyüktür. Günahlardan dönüş ve ibâdete güç ancak Allah'ın yardımıyladır\" sözünden başka bir şey (yani dünya ile ilgili bir lâf) konuşmazsa, onun on günahı silinir, onun için on hasene (sevab) yazılır ve bu ibâdet sayesinde onun mertebesi on derece yükselir. Kim de tavaf eder ve tavaf esnasında (dünya ile ilgili) konuşursa, (yalnız) ayakları suya batan kimse gibi onun (yalnız) ayakları rahmete batar, (yani vücûdunun kalan kısmı rahmete batmaz)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 76
			}
		}
	]
}