{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "“... Ca'fer bin Muhammed'in babası (Muhammed bin Ali bin Hüseyin bin Ali bin Ebî Tâlib) (radıyallahü anhüm)’den; Şöyle demiştir: Câbir bin Abdillah (radıyallahü anhümâ)'nın yanına girdik. Yanına vardığımız zaman girenlerin kimler olduğunu (bir bir) sordu. Nihayet sıra bana gelince : Muhammed bin Ali bin Hüseyin'im, dedim. Bunun üzerine elini başıma uzatarak (gömleğimin yakasındaki) üst düğmemi çözdü. Sonra alt düğmemi de çözdü. Daha sonra avucunu iki mememin arasına (göğsümün üstüne) koydu. Ben o zaman genç bir çocuktum. (Bana) : geldin. Dilediğini sor, dedi. Ben de ona (Peygamber (Aleyhi's-salâtü ve's-selâm)'in haccının keyfiyetini) sordum. Kendisi âmâ idi. O sırada namaz vakti geldi. Bunun üzerine bir dokumaya bürünerek (namaza) kalktı. Sarındığı dokuma küçük olduğu için omuzlarına koydukça iki tarafı kendisine doğru geriye dönüyordu. Cübbesi de yanıbaşında askı üstünde (duruyor) idi. Bize namaz kıldırdı. Namazdan sonra ben (kendisine) : Resûlüllah (sallallahü aleyhi ve sellem)’in hac edişini anlat, dedim. Bunun üzerine eliyle dokuz sayısına işaret ederek dedi ki: (sallallahü aleyhi ve sellem) hac etmeden (Medine'de) dokuz yıl durdu. Sonra onuncu yıl Resûlüllah (sallallahü aleyhi ve sellem)’in hacedeceğini halka ilân edilmesini emretti. Bunun üzerine Medine'ye çok insan geldi. Hepsi Resûlüllah (sallallahü aleyhi ve sellem)’e uymak (yani O'nunla beraber hac etmek) ve O'nun yaptığının mislini yapmak istiyordu. Resûlüllah (sallallahü aleyhi ve sellem) (Medine'den yola) çıktı. Biz de O'nunla beraber çıktık. Zü’l-Huleyfe'ye vardık. Esma bint-i Umeys (orada) Muhammed bin Ebi Bekr'i doğurdu ve: Ben ne yapacağım? diye Resûlüllah (sallallahü aleyhi ve sellem)'e haber gönderdi. Peygamber (sallallahü aleyhi ve sellem) (ona) : kanın akmasını engelleyici bir bez sarın ve ihrama gir) buyurdu. Sonra Resûlüllah (sallallahü aleyhi ve sellem) Zü’l-Huleyfe mescidinde namaz kıldı. Sonra Kasvâ (denilen deve) ye bindi. Nihayet devesi O'nu Beydâ (denilen mevki) ye çıkarınca (Câbir demiştir ki) O'nun önünde gözümün görebildiği kadar binekli ve yayaya baktım, O'nun sağında da o kadar insan vardı. Solunda da o miktarda insan bulunurdu ve bir o kadar da arkasında vardı. Resûlüllah (sallallahü aleyhi ve sellem) de aramızda bulunuyordu. Kur'ân (âyetleri) O'na iniyor, mânâlarını da o biliyordu. Artık O, ne yapıyorsa biz de ayni şeyi yapıyorduk. Resûl-i Ekrem, tevhîd'i, (yani Allah'ın birliğini ihtiva eden şu lebbeyk duasını yüksek sesle okudu) : dâvetine çokça icabet ettim. Senin dâvetine mükerrer icabet ettim. Senin ortağın yoktur. Senin dâvetine tekrar icabet ettim. Şüphesiz, hamd ve nimet senindir mülk de senindir. Hiç bir ortağın yoktur. \" ise hâlen yüksek sesle okudukları lebbeyk duasını yüksek sesle okudular. (Yani Peygamber (sallallahü aleyhi ve sellem)'in lebbeyk duasına ilâve yaptılar. ) Resûlüllah (sallallahü aleyhi ve sellem) de onların okuduklarından bir şeyi reddetmedi (yani niçin bu ilâveyi yapıyorsunuz demedi). Resûlüllah (sallallahü aleyhi ve sellem) kendi telbiyesine devam etti. Câbir demiştir ki: Biz hactan başka bir şeye niyet etmiyorduk. Biz umreyi bilmiyorduk (Yani hac ile umrenin birlikte yapılabileceğini veya hac mevsiminde umre yapılabileceğini bilmiyorduk). Nihayet biz O'nunla beraber Ka'be'ye vardığımız zaman rüknü (yani Hacer-i Esved'i) istilâm etti ve Üç tur hızlı, dört tur da normal yürüyüşle tavaf etti. Sonra İbrahim (Aleyhisselâm)'in makamına gidip (Ve İbrahim'in makamından namaz yeri edininiz. ) Bakara, 135 âyetini okudu. Sonra Makamı, kendisiyle Kabe araına aldı (ve makamın arkasında durup iki rekât namaz kıldı). (Râvî Ca'fer demiştir ki:) Babam diyordu ki: O, bu iki rek'at (tavaf namazın) da (Fâtiha'dan sonra) Kâfirûn ve ve İhlas sûrelerini okurdu. (Ben babamın bunu ancak Peygamber (sallallahü aleyhi ve sellem)'den merfû olarak rivâyet ettiğini bilirim. ) —Yani anılan sûreleri okuyan Câbir değil, Peygamber (sallallahü aleyhi ve sellem) olduğu rivâyet olunmuştur— (Câbir rivâyetine devamla şöyle demiştir:) Sonra Peygamber (sallallahü aleyhi ve sellem) Ka'be'ye dönerek rüknü (yani Hacer-i Esved'i) istilâm etti. Sonra (Safa) kapı (sın) dan Safâ'ya çıktı. Nihayet Safâ'ya yaklaşınca; \"Şüphesiz Safâ ile Merve Allah'ın (menâsik) alâmetlerindendir\" âyetini okudu ve: başladığı (Safa tepesi) nden (sa'y'e) başlarız, buyurarak Safâ'dan (sa'y'e) başladı, Ka'be'yi görünceye kadar Safa tepesinin üstüne çıktı. Sonra tekbîr alarak, tehlil ve hamd eyledi ve; başka (ibâdete lâyık) hiç bir ilâh yoktur. O, birdir. Ortağı yoktur. Mülk O'nundur. Hamd da O'nundur. Diriltir ve Öldürür. O, her şeye de kadirdir. Allah'tan başka (tapınmaya lâyık) hiç bir ilâh yoktur. O, birdir. Hiç bir ortağı yoktur. (Peygamber (sallallahü aleyhi ve sellem)'ine verdiği) vaadini yerine getirdi, kuluna zafer verdi ve yalnız başına düşman hiziblerini hezimete uğrattı\" dedi. Bu arada duâ etti ve bu zikir ile duayı üç defa tekrarladı. Sonra Safa tepesinden inip Merve ye doğru yürüdü. İnişi bitip derenin ortasına varınca hızlı yürüdü. Ayakları dereden çıkınca Merve tepesine varıncaya kadar (yine) normal yürümeye devam etti. Safa üstünde yaptığını Merve Üstünde de yaptı. Tavaf (yani yedi tur sa'y'ı) Merve üstünde bitince : aylarında umre etmenin câizliğini şimdi bildiğim gibi başlangıçta bilseydim kurbanlığımı (Mekke'ye) sevketmezdim ve ihramına başladığım haccı umre'ye çevirirdim. Artık sizlerden (hac niyetiyle ihrama girip de) beraberinde kurbanlığı olmayanlar hemen ihramdan çıksın ve haccını umre'ye çevirsin,) buyurdu. Bunun üzerine herkes ihramdan çıkıp saçlarını kısalttılar. Yalnız Peygamber (sallallahü aleyhi ve sellem) ile yanında kurbanlığı bulunanlar ihramdan çıkmadılar. Sonra Sürâka bin Mâlik bin Cü'şüm ayağa kalkarak: Resûlallah! Bu iş (yani hac aylarında umre etmek veya haccı umre'ye çevirmek), bu yılımıza mı mahsus, yoksa ebedî olarak devam edecek mi? diye sordu. Câbir demiştir ki: Bu soru üzerine Resûlüllah (sallallahü aleyhi ve sellem) bir elinin parmaklarını diğer elinin parmaklarına kenetleyerek: şöylece (kenetlenen parmaklarım gibi) hacca dâhil olmuştur. Umre şöylece hacca dâhil olmuştur. Hayır (bu yıla mahsus değildir) . Bilâkis ebedî olarak devam edecektir,) buyurdu. demiştir ki: Ali (radıyallahü anh) Peygamber (sallallahü aleyhi ve sellem)'in develerini (Yemen'den) getirdi. Fâtime (radıyallahü anhâ)'yi da ihramdan çıkanlar meyânında, boyalı elbise giymiş ve gözlerine sürme çekilmiş olarak buldu. Ali (radıyallahü anh) Fâtime'nin ihramdan çıkmasına karşı çıktı. Fâtime: çıkmamı babam bana emretti, dedi. Alî (radıyallahü anh) Irak'ta (halîfe) iken şöyle derdi : üzerine ben Fâtıme'yi bu yaptığı işten dolayı azarlatmak ve Resûlüllah (sallallahü aleyhi ve sellem) 'den naklen anlattığı husus ile onun yaptığı işe karşı çıkmam meselesi hakkında Resûlüllah (sallallahü aleyhi ve sellem)'e fetva sormak üzere Resûlüllah (sallallahü aleyhi ve sellem)'in yanına gittim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) : doğru söylemiş, doğru söylemiş. Sen hacca niyetlenirken ne dedin?) buyurdu. Ben: Resûl'ün (sallallahü aleyhi ve sellem) neye niyetlendiyse, ben de ona niyetlendim, cevâbını verdim. Resûl-i Ekrem (sallallahü aleyhi ve sellem) (bana) : beraberimde kurbanlığım var. (Yani bu nedenle ben ihramdan çıkamam) Sen (de) ihramdan çıkma,) buyurdu. demiştir ki: Alî (radıyallahü anh) in Yemen'den getirdiği kurbanlıklar ile Peygamber (sallallahü aleyhi ve sellem)'in Medine'den getirdiği kurbanlıkların toplamı yüz adetti. Sonra herkes ihramdan çıkıp saçlarını kısalttılar. Yalnız Peygamber (sallallahü aleyhi ve sellem) ile beraberinde kurbanlığı olanlar ihramdan çıkmadılar. Sonra terviye (yani Zilhicce'nin sekizinci) günü olunca ve Minâ'ya doğru hareket edecekleri zaman (ihramdan çıkmış olanlar) hac niyetiyle ihrama girdiler. Resûlüllah (sallallahü aleyhi ve sellem) hayvanına binerek (Minâ'ya) gitti. Resûl-i Ekrem (sallallahü aleyhi ve sellem) (o günün) öğle, ikindi, akşam ve yatsı namazları ile (ertesi günü) sabah namazını Minâ'da kıldı. Sonra güneş doğuncaya kadar biraz bekledi ve kendisi için (Arafat'a yakın olan) Nemire (denilen yer) de kıldan bir çadırın kurulmasını emretti. Sonra Resûlüllah (sallallahü aleyhi ve sellem) (Minâ'dan Nemire'ye) hareket etti. Kureyş kendilerinin câhiliyet devrinde yaptıkları gibi O'nun da Meş'ar-i Haram yanında veya Müzdelife(nin başka bir yerin) de vakfe edeceğinde (yani vakfe Arafat'a gitmiyeceğinde) şüphe etmiyorlardı. Halbuki Resûlüllah (sallallahü aleyhi ve sellem) (Kureyş'in kanaati hilâfına) Müzdelife'yi geçerek Arafat (in yakının) a vardı. Nemire'de kendisi için çadırı kurulmuş olarak buldu ve oraya indi. Nihayet güneş göğün ortasında batıya kayınca (yani öğle vakti girince), Kasvâ (denilen devesi) nin hazırlanmasını emretti. Bunun üzerine kasva'ya semer vuruldu. Resûl-i Ekrem (sallallahü aleyhi ve sellem) binip (Ürene denilen) derenin ortasına vardı. Orada halka bir hutbe okuyarak şöyle buyurdu: (Zilhicce) ayınızda, şu (Mekke) şehrinizde bu (Arefe) gününüz nasıl mukaddes ise (yani bu yer ve zamanda günah işlemek nasıl ağır biçimde haram ise) şüphesiz kanlarınız ve mallarınız da size haramdır (yani birbirinizin kanını akıtmanız ve haksız yere birbirinizin mâlını almanız her yerde ve her zaman şiddetle haramdır. ) Bilmiş olunuz ki câhiliyet devri işlerinden olan her şey bu iki ayağımın altına konulmuştur (yani bâtıldır, işlerliği yoktur). Câhiliyet devrine ait kanlar bâtıldır (yani ne kısası, ne diyeti ne de kefareti vardır). İptal ettiğim kan dâvası (amcam) el Hâris'in oğlu Rebia'nın kan davasıdır. (Maktul Benî Sa'd kabilesinde süt anadaydı, Hüzeyl kabîlesi onu öldürmüştü). —Sahih rivâyete göre öldürülen kişi Rebîanut oğlu İyâs'tı — Câhiliyet döneminin faizi de bâtıldır (yani buna ait işlem geçersizdir). İlk iptal ettiğim faiz bizim faizimiz, (yani amcam) Abbâs bin Abdulmuttalib'in faizidir. Çünkü faizin hepsi bâtıldır. Kadınlar hakkında Allah'tan korkunuz. Çünkü şüphesiz siz onları Allah'ın emâneti (yani iyi davranma ahdi) ile aldınız. Onların ırzlarını Allah'ın kelimesi (yani emri veya nikâh akdi) ile kendinize helâl kıldınız. Yaygılarınıza (yani evlerinize) hoşlanmadığınız kimselere ayak bastırmamaları şüphesiz sizin onlar üzerindeki hakkınızdır. Bunu yaparlarsa (yani mahremi olsun veya olmasın hoşlanmadığınız her hangi bir erkek veya kadının evinize girmesine izin verirlerse), onlara zarar vermeyecek biçimde dövünüz. Maruf bir şekilde (yani hâlinize göre veya normal biçimde) onların nafakasını ve giyeceğini vermek onların sizin üzerinizdeki hakkıdır. Size öyle bir şey bıraktım ki ona sımsıkı sarılırsanız dalâlet'e gitmezsiniz (yani cennet yolundan sapmazsınız. Size bıraktığım şey) Allah'ın kitabıdır. Ben (kıyamet günü) size sorulacağım. Acaba ne diyeceksiniz?) Sahâbîler: şeyleri) tebliğ ettiğine, görevini hakkıyla îfa ettiğine ve (ümmete) nasîhatta bulunduğuna şehâdet ederiz, dediler. Bunun üzerine Resûl-i Ekrem (sallallahü aleyhi ve sellem) şehâdet parmağını semâya kaldırıp sonra halka doğru eğerek üç defa: şâhid ol, Allahım şâhid ol, Allahım şâhid ol,) dedi (Bu hutbeden) sonra Bilâl (radıyallahü anh), ezan okudu. Sonra ikâmet etti. Resûl-i Ekrem (sallallahü aleyhi ve sellem) öğle namazını (iki rekât olarak) kıldırdı. Sonra Bilâl (tekrar) ikâmet etti. Resûl-i Ekrem (sallallahü aleyhi ve sellem) ikindi namazını (da iki rekât olarak) kıldırdı. (Yani öğle ve ikindi farzlarını ard arda Cem-i Takdim şeklinde kıldırdı). Resûl-i Ekrem bu iki namaz arasında başka namaz kılmadı. Bundan sonra Resûlüllah (sallallahü aleyhi ve sellem) (devesine) binerek vakfe yerine (yani Rahmet dağının eteğine) geldi. Devesinin göğsünü kayalara çevirdi. Yayaların yolunu da karşısına aldı ve kıbleye döndü. Akşama kadar orada vakfeye durdu. Nihayet güneşin sarılığı biraz gitti ve güneş tamamen kayboluncaya kadar vakfeye devam etti. Sonra Resûlüllah (sallallahü aleyhi ve sellem) Üsâme bin Zeyd'i terkisine alarak oradan (Müzdelife'ye) hareket etti. Resûl-i Ekrem kasvâ (denilen devesi) nin yularını o derece kasmıştıki neredeyse devenin başı semerin ön kısmındaki deriye değiyordu ve Resûl-i Ekrem (sallallahü aleyhi ve sellem) sağ eliyle işaret ederek : insanlar, sükunetten ayrılmayın, sükûnetten ayrılmayın (yani acele etmeyin)) buyuruyordu. Kum tepeciklerinden birine geldikçe düzlüğe çıkıncaya kadar devesinin dizginini gevşetiyordu. Nihayet Müzdelife'ye vardı. Orada akşam ve yatsı namazlarını bir ezan ve iki ikâmetle kıldırdı. (Yani bu iki namazı Cem-i Tehir şeklinde kıldırdı) Ve bunlar arasında başka namaz kılmadı. Sonra Resûlüllah (sallallahü aleyhi ve sellem), fecir doğuncaya kadar uzandı. Fecir doğunca bir ezan ve bir ikâmetle sabah namazını kıldırdı. Sonra Kasvâ'ya binerek Meş'ari Harâm'a geldi. Bu dağın üstüne çıktı. Orada (kıbleye dönerek) Allah'a hamd etti, tekbîr aldı ve tevhîd'de bulundu (Yani el-Hamdu lillâh Vellahu Ekber ve Lâ ilahe illallah dedi). Ortalık iyice aydınlanıncaya kadar orada vakfe'ye devam etti. Sonra henüz güneş doğmamış iken oradan yola çıktı ve terkisine Fadl bin Abbâs'ı aldı. Fadl, güzel saçlı beyaz tenli ve yakışıklı bir zât idi. Resûlüllah (sallallahü aleyhi ve sellem) yola çıkınca, yanından bir takım kadınlar koşarak geçtiler. Fadl onlara bakmaya başladı. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem), elini diğer taraftan (Fadl'ın yüzüne) koydu. Fadl da yüzünü o taraftan çevirip baktı. Nihayet Resül-i Ekrem (sallallahü aleyhi ve sellem) (Müzdelife ile Minâ arasında bulunan) Muhassir deresine vardı ve (devesini) biraz hızlandırdı. Sonra seni büyük cemre'ye çıkaran orta yola girdi ve nihayet ağacın yanındaki (büyük) cemre'ye vardı (buna Akabe cemresi de denilir). (O cemre'ye) fiske taşı gibi yedi aded çakıl attı. Her çakılı atarken tekbîr alıyordu (yani Allahü Ekber ( diyordu). Taşları derenin ortasından attı. Sonra mezbahaya döndü. 63 deveyi kendi eliyle boğazladı. Sonra (bıçağı) Alî'ye verdi. Ali de (O'nun emriyle) kalan deveyi boğazladı. Resül-i Ekrem (sallallahü aleyhi ve sellem), kurbanlıklarına Alî'yi ortak etti. Sonra, her deveden birer parça etin alınmasını emretti. Bunlar bir çömleğe konularak pişirildi. İkisi de develerin etinden yediler ve et suyundan içtiler. Sonra Resûlüllah (sallallahü aleyhi ve sellem) (ifâda tavafı için Minâ’dan) Ka'be'ye indi. (Tavaftan sonra) öğle namazını Mekke'de kıldı. Daha sonra Zemzem (kuyusu) üzerinde halka suvarmakta olan Abdulmuttalib'in oğullarının yanına vardı ve (onlara) : su) çıkarınız Ey Muttalib oğulları. Su çıkarmanız hususunda halkın size izdiham vermesi korkusu olmasaydı ben de sizinle beraber su çıkarırdım (Yani su çıkarırsam halk bunu menâsikten sanarak izdiham vermekle işinizi engelleyebilir), buyurdu. Sonra onlar kendisine bir kova su sundular. O da bundan içti",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		}
	]
}