{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"25": "Chapters on Hajj Rituals"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3074,
			"arabicnumber": 3074,
			"text": "Ca'fer bin Muhammed'in babası (Muhammed bin Ali bin Hüseyin bin Ali bin Ebî Tâlib) (r.a.)'den; Şöyle demiştir: Biz Câbir bin Abdillah (r.a.)'ın yanına girdik. Yanına vardığımız zaman girenlerin kimler olduğunu (bir bir) sordu. Nihayet sıra bana gelince : Ben Muhammed bin Ali bin Hüseyin'im, dedim. Bunun üzerine elini başıma uzatarak (gömleğimin yakasındaki) üst düğmemi çözdü. Sonra alt düğmemi de çözdü. Daha sonra avucunu iki mememin arasına (göğsümün üstüne) koydu. Ben o zaman genç bir çocuktum. (Bana): Hoş geldin. Dilediğini sor, dedi. Ben de ona (Nebi (Aleyhi's-salâtu ve's-selâm)'ın haccının keyfiyetini) sordum. Kendisi â'mâ idi. O sırada namaz vakti geldi. Bunun üzerine bir dokumaya bürünerek (namaza) kalktı. Sarındığı dokuma küçük olduğu için omuzlarına koydukça iki tarafı kendisine doğru geriye dönüyordu. Cübbesi de yanıbaşında askı üstünde (duruyor) idi. Bize namaz kıldırdı. Namaz'dan sonra ben (kendisine) : Bize Resûlullah (Sallallahu Aleyhi ve Sellem)'in hac edişini anlat, dedim. Bunun üzerine eliyle dokuz sayışma işaret ederek dedi ki: Resûlullah (Sallallahu Aleyhi ve Sellem) hac etmeden (Medine'de) dokuz yıl durdu. Sonra onuncu yıl Resulullah (Sallallahu Aleyhi ve Sellem)'in hacedeceğini halka ilân edilmesini emretti. Bunun üzerine Medine'ye çok insan geldi. Hepsi Resulullah (Sallallahu Aleyhi ve Sellem)*e uymak (yâni O'nunla beraber hac etmek) ve O'nun yaptığının mislini yapmak istiyordu. Resulullah (Sallallahu Aleyhi ve Sellem) (Medine'den yola) çıktı. Biz de O'nunla beraber çıktık. Zü'I-Huleyfe'ye vardık. Esma' bint-i Umeys (orada) Muhammed bin Ebi Bekr'i doğurdu ve: Ben ne yapacağım? diye Resulullah (Sallallahu Aleyhi ve Sellem)'e haber gönderdi. Peygamber (Sallallahu Aleyhi ve Sellem) (ona): «Yıkan, kanın akmasını engelleyici bir bez sarın ve ihrama gir» buyurdu. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) Zü'I-Huleyfe mescidinde namaz kıldı. Sonra Kasvâ'ya bindi. Nihayet devesi O'nu Beydâ (denilen mevki) ye çıkarınca (Câbir demiştir ki) O'nun önünde gözümün görebildiği kadar binekli ve yayaya baktım, O'nun sağında da o Kadar insan vardı. Solunda da o miktarda insan bulunurdu ve bir o kadar da arkasında vardı. Resulullah (Sallallahu Aleyhi ve Sellem) de aramızda bulunuyordu. Kur'ân (âyetleri) O'na iniyor, mânâlarını da o biliyordu. Artık O, ne yapıyorsa biz de ayni şeyi yapıyorduk. Resûl-i Ekrem, tevhîd'i, (yâni Allah'ın tekliğini ihtiva eden şu telbiye'yi yüksek sesle okudu): \"Allahım dâvetine çokça icabet ettim. Senin dâvetine mükerrer icabet ettim. Senin ortağın yoktur. Senin dâvetine tekrar icabet ettim. Şüphesiz, hamd ve ni'met senindir mülk de senindir. Hiç bir ortağın yoktur.\" Halk ise hâlen yüksek sesle okudukları telbiyeyi yüksek sesle okudular. (Yâni Nebi (s.a.v.)'in telbiyesine ilâve yaptılar.) Resulullah (Sallallahu Aleyhi ve Sellem) de onların okuduklarından bir şeyi reddetmedi (yâni niçin bu ilâveyi yapıyorsunuz demedi). Resulullah (Sallallahu Aleyhi ve Sellem) kendi telbiyesine devam etti. Câbir demiştir ki: Biz hac'dan başka bir şeye niyet etmiyorduk. Biz umreyi bilmiyorduk (Yâni hac ile umre'nin birlikte yapılabileceğini veya hac mevsiminde umre yapılabileceğini bilmiyorduk). Nihayet biz O'nunla beraber Ka'be'ye vardığımız zaman rüknü (Hacer-i Esved'i) istilâm etti ve Üç tur hızlı, dört tur da normal yürüyüşle tavaf etti. Sonra Makam-ı İbrahim'e gidip : «Makam-ı İbrahim'den namazgah edinin.» [Bakara 125.] âyetini okudu. Sonra Makam-ı kendisiyle Ka'be arasına aldı (ve makam'ın arkasında durup iki rekât namaz kıldı). (Râvî Ca'fer demiştir ki:) Babam diyordu ki: O, bu iki rek'at (tavaf namazın) da (Fâtiha'dan sonra) Kâfirûn ve İhlas surelerini okurdu. (Ben babamın bunu ancak Nebi (Sallallahu Aleyhi ve Sellem)'den merfû' olarak rivayet ettiğini bilirim.) (Câbir rivayetine devamla şöyle demiştir:) Sonra Nebi (Sallallahu Aleyhi ve Sellem) Ka'be'ye dönerek rüknü (yâni Hacer-i Esved'i) istilâm etti. Sonra (Safa) kapı (sın) dan Safâ'ya çıktı. Nihayet Safâ'ya yaklaşınca; \"Şüphesiz Safâ ile Merve Allah'ın (menâsik) alâmetlerindendir\" [Bakara 158] âyetini okudu ve: Allah'ın başladığından (sa'y'e) başlarız, buyurarak Safâ'dan (sa'y'e) başladı, Ka'be'yi görünceye kadar Safa tepesinin üstüne çıktı. Sonra tekbîr alarak, tehlil ve hamd eyledi ve; \"Allah'tan başka (ibâdete lâyık) hiç bir ilâh yoktur. O, birdir. Ortağı yoktur. Mülk O'nundur. Hamd da O'nundur. Diriltir ve Öldürür. O, her şeye de kadirdir. Allah'tan başka hiç bir ilâh yoktur. O, birdir. Hiç bir ortağı yoktur. (Nebi (Sallallahu Aleyhi ve Sellem)'in (verdiği) vaadini yerine getirdi, kuluna zafer verdi ve yalnız başına düşman birliklerini hezimete uğrattı\" dedi. Bu arada duâ etti ve bu zikir ile duayı üç defa tekrarladı. Sonra Safa tepesinden inip Merve ye doğru yürüdü. İnişi bitip derenin ortasına varınca hızlı yürüdü. Ayakları dereden çıkınca Merve tepesine varıncaya kadar (yine) normal yürümeye devam etti. Safa üstünde yaptığını Merve üstünde de yaptı. Tavaf (yâni yedi tur sa'y'ı) Merve üstünde bitince : Hac aylarında umre etmenin câizliğini şimdi bildiğim gibi başlangıçta bilseydim kurbanlığımı (Mekke'ye) sevketmezdim ve ihramm'a başladığım haccı umre'ye çevirirdim. Artık sizlerden (hac niyetiyle ihrama girip de) beraberinde kurbanlığı olmayanlar hemen ihramdan çıksın ve haccını umre'ye çevirsin, buyurdu. Bunun üzerine herkes ihramdan çıkıp saçlarını kısalttılar. Yalnız Peygamber (Sallallahu Aleyhi ve Sellem) ile yanında kurbanlığı bulunanlar ihramdan çıkmadılar. Sonra Sürâka bin Mâlik bin Cu'şum ayağa kalkarak: Yâ Resûlallah! Bu iş, bu yılımıza mı mahsus, yoksa ebedî olarak devam edecek mi? diye sordu. Câbir demiştir ki: Bu soru üzerine Resulullah (Sallallahu Aleyhi ve Sellem) bir elinin parmaklarını diğer elinin parmaklarına kenetleyerek: Umre şöylece (kenetlenen parmaklarım gibi) hacca dâhil olmuştur. Umre şöylece hacca dâhil olmuştur. Hayır. Bilâkis ebedî olarak devam edecektir, buyurdu. Câbir demiştir ki: Ali (r.a.) Peygamber (Sallallahu Aleyhi ve Sellem)'in develerini (Yemen'den) getirdi. Fâtıma (r.anha)'yı da ihram'dan çıkanlar meyânında, boyalı elbise giymiş ve gözlerine sürme çekilmiş olarak buldu. Ali (r.a.) Fâtima'nın ihramdan çıkmasına karşı çıktı. Fâtime: İhram'dan çıkmamı babam bana emretti, dedi. Alî (r.a.) Irak'ta (halîfe) iken şöyle derdi: Bunun üzerine ben Fâtima'yı bu yaptığı işten dolayı azarlatmak ve Resulullah (Sallallahu Aleyhi ve Sellem)'den naklen anlattığı husus ile onun yaptığı işe karşı çıkmam meselesi hakkında Resulullah (Sallallahu Aleyhi ve Sellem)'e fetva sormak üzere Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına gittim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) : Fâtima doğru söylemiş, doğru söylemiş. Sen hacca niyetlenirken ne dedin? buyurdu. Ben: Allahım! Resûl'ün (Sallallahu Aleyhi ve Sellem) neye niyetlendiyse, ben de ona niyetlendim, cevâbını verdim. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (bana): Benim beraberimde kurbanlığım var. Sen (de) ihramdan çıkma, buyurdu. Câbir demiştir ki: Alî (r.a.)'in Yemen'den getirdiği kurbanlıklar ile Nebi (Sallallahu Aleyhi ve Sellem)'in Medine'den getirdiği kurbanlıkların toplamı yüz adetti. Sonra herkes ihramdan çıkıp saçlarını kısalttılar. Yalnız Nebi (Sallallahu Aleyhi ve Sellem) ile beraberinde kurbanlığı olanlar ihram'dan çıkmadılar. Sonra terviye günü olunca ve Minâ'ya doğru hareket edecekleri zaman (ihram'dan çıkmış olanlar) hac niyetiyle ihram'a girdiler. Resulullah (Sallallahu Aleyhi ve Sellem) hayvanına binerek (Minâ'ya) gitti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) (o günün) öğle, ikindi, akşam ve yatsı namazları ile (ertesi günü) sabah namazını Minâ'da kıldı. Sonra güneş doğuncaya kadar biraz bekledi ve kendisi için (Arafat'a yakın olan) Nemire (denilen yer) de kıldan bir çadırın kurulmasını emretti. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) (Minâ'dan Nemire'ye) hareket etti. Kureyş kendilerinin câhiliyet devrinde yaptıkları gibi O'nun da Meş'ar-i Haram yanında veya Müzdelife(nin başka bir yerin) de vakfe edeceğinde şüphe etmiyorlardı. Halbuki Resulullah (Sallallahu Aleyhi ve Sellem) (Kureyş'in kanaati hilâfına) Müzdelife'yi geçerek Arafat ('ın yakının) a vardı. Nemire'de kendisi için çadırı kurulmuş olarak buldu ve oraya indi. Nihayet güneş göğün ortasında batıya kayınca, Kasvâ'nın hazırlanmasını emretti. Bunun üzerine kasva'ya semer vuruldu. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) binip (Ürene denilen) derenin ortasına vardı. Orada halka bir hutbe okuyarak şöyle buyurdu: Şu ayınızda, şu şehrinizde bu gününüz nasıl mukaddes ise şüphesiz kanlarınız ve mallarınız da size haramdır Bilmiş olunuz ki câhiliyet devri işlerinden olan her şey bu iki ayağımın altına konulmuştur. Câhiliyet devrine ait kanlar bâtıldır. İptal ettiğim kan dâvası el Hâris'in oğlu Rebia'nın kan davasıdır. Câhiliyet döneminin faizi de bâtıldır (yâni islam öncesindeki faiz sözü de geçersizdir). İlk iptal ettiğim faiz bizim faizimiz, Abbâs bin Abdulmuttalib'in faizidir. Çünkü faizin hepsi bâtıldır. Kadınlar hakkında Allah'tan korkunuz. Çünkü şüphesiz siz onları Allah'ın emâneti ile aldınız. Onların ırzlarını Allah'ın kelimesi ile kendinize helâl kıldınız. Yaygılarınıza (yâni evlerinize) hoşlanmadığınız kimselere ayak bastırmamaları şüphesiz sizin onlar üzerindeki hakkınızdır. Bunu yaparlarsa (yâni mahremi olsun veya olmasın hoşlanmadığınız her hangi bir erkek veya kadın'ın evinize girmesine izin verirlerse), onlara zarar vermeyecek biçimde dövünüz. Ma'ruf bir şekilde (yâni hâlinize göre veya normal biçimde) onların nafakasını ve giyeceğini vermek onların sizin üzerinizdeki hakkıdır. Size öyle bir şey bıraktım ki ona sımsıkı sarılırsanız dalâlet'e gitmezsiniz Allah'ın kitabıdır. Ben size sorulacağım. Acaba ne diyeceksiniz? Sahâbîler: (Emrolunduğun şeyleri) tebliğ ettiğine, görevini hakkıyla îfa ettiğine ve (ümmete) nasîhatta bulunduğuna şehâdet ederiz, dediler. Bunun üzerine Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) şehâdet parmağını göğe kaldırıp sonra halka doğru eğerek üç defa: Allahım şâhid ol, Allahım şâhid ol, Allahım şâhid ol, dedi (Bu hutbeden) sonra Bilâl (r.a.), ezan okudu. Sonra ikâmet etti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) öğle namazını kıldırdı. Sonra Bilâl ikâmet etti. Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) ikindi namazını kıldırdı. (Yâni öğle ve ikindi farzlarını ard arda Cem-i Takdim şeklinde kıldırdı). Resûl-i Ekrem bu iki namaz arasında başka namaz kılmadı. Bundan sonra Resulullah (Sallallahu Aleyhi ve Sellem) (devesine) binerek vakfe yerine geldi. Devesinin göğsünü kayalara çevirdi. Yayaların yolunu da karşısına aldı ve kıbleye döndü. Akşam'a kadar orada vakfeye durdu. Nihayet güneşin sarılığı biraz gitti ve güneş tamamen kayboluncaya kadar vakfeye devam etti. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) Usame bin Zeyd'i terkisine alarak oradan (Müzdelife'ye) hareket etti. Resûl-i Ekrem kasvâ'nın yularını o derece kasmıştıki neredeyse devenin başı semerin ön kısmındaki deriye değiyordu ve Resûl-i Ekrem (Sallallahu Aleyhi ve Sellem) sağ eliyle işaret ederek : Ey insanlar, sükunetten ayrılmayın, sükûnetten ayrılmayın buyuruyordu. Kum tepeciklerinden birine geldikçe düzlüğe çıkıncaya kadar devesinin dizginimi gevşetiyordu. Nihayet Müzdelife'ye vardı. Orada akşam ve yatsı namazlarını bir ezan ve iki ikâmetle kıldırdı. Ve bunlar arasında başka namaz kılmadı. Sonra Resulullah (Sallallahu Aleyhi ve Sellem), fecir doğuncaya kadar uzandı. Fecir doğunca bir ezan ve bir ikâmetle sabah namazını kıldırdı. Sonra Kasvâ'ya binerek Meş'ar-i Harâm'a geldi. Bu dağın üstüne çıktı. Orada Allah'a hamd etti, tekbîr aldı ve tevhîd'de bulundu (Yâni el-Hamdu lillâh Vellahu Ekber ve Lâ ilahe illallah dedi). Ortalık iyice aydınlanıncaya kadar orada vakfe'ye devam etti. Sonra henüz güneş doğmamış iken oradan yola çıktı ve terkisine Fadl bin Abbâs'ı aldı. Fadl, güzel saçlı beyaz tenli ve yakışıklı bir zât idi. Resulullah (Sallallahu Aleyhi ve Sellem) yola çıkınca, yanından bir takım kadınlar koşarak geçtiler. Fadl onlara bakmaya başladı. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem), elini diğer taraftan (Fadl'ın yüzüne) koydu. Fadl da yüzünü o taraftan çevirip baktı. Nihayet Resül-i Ekrem (Sallallahu Aleyhi ve Sellem) (Müzde-life ile Minâ arasında bulunan) Muhassir deresine vardı ve (devesini) biraz hızlandırdı. Sonra seni büyük cemre'ye çıkaran orta yola girdi ve nihayet ağacın yanındaki (büyük) cemre'ye vardı (buna Akabe cemresi de denilir). (O cemre'ye) fiske taşı gibi yedi aded çakıl attı. Her çakılı atarken tekbîr alıyordu. Taşları derenin ortasından attı. Sonra mezbahaya döndü. 63 deveyi kendi eliyle boğazladı. Sonra (bıçağı) Alî'ye verdi. Ali de kalan (37) deveyi boğazladı. Resül-i Ekrem (Sallallahu Aleyhi ve Sellem), kurbanlıklarına Alî'yi ortak etti. Sonra, her deveden birer parça etin alınmasını emretti. Bunlar bir çömleğe konularak pişirildi. İkisi de develerin etinden yediler ve et suyundan içtiler. Sonra Resulullah (Sallallahu Aleyhi ve Sellem) (ifâda tavafı için Minâ'dan) Ka'be'ye indi. (Tavaftan sonra) öğle namazını Mekke'de kıldı. Daha sonra Zem-zem (kuyusu) üzerinde halka suvarmakta olan Abdulmuttalib'in oğullarının yanma vardı ve (onlara) : (Kuyudan su) çıkarınız Ey Muttalib oğulları. Su çıkarmanız hususunda halkın size izdiham vermesi korkusu olmasaydı ben de sizinle beraber su çıkarırdım, buyurdu. Sonra onlar kendisine bir kova su sundular. O da bundan içti, BU HADİS’İN MÜSLİM RİVAYETİ VE İZAHAT İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 25,
				"hadith": 193
			}
		}
	]
}