{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"31": "Chapters on Medicine"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3545,
			"arabicnumber": 3545,
			"text": "“... Âişe (radıyallahü anhâ)’dan; Şöyle demiştir: Zürayk Yahûdilerinden Lebîd bin el-A'sam denilen bir Yahudi, (bir kere) Peygamber (sallallahü aleyhi ve sellem)'e sihir yaptı. Peygamber (sallallahü aleyhi ve sellem) bâzı işlere gücü yetmediği halde yapabileceğini sanırdı. Âişe demiştir ki: Nihayet bir gün veya bir gece Resûlüllah (sallallahü aleyhi ve sellem) (bu rahatsızlıktan kurtulmak için) Allah'a üç kez duâ ettikten sonra şöyle buyurdu: Âişe, bilir misin? Allah benim duamı kabul etti. Şöyle ki: Bana iki adam geldi (Cebrail ve Mikâil). Bunlardan biri baş ucumda, diğeri de ayak ucumda oturdu. Baş ucumdaki kişi, ayak ucumdaki kişiye veya ayak ucumdaki kişi baş ucumdaki kişiye: Bu zâtın rahatsızlığı nedir? diye sordu. O da: Sihirlenmiştir, diye cevab verdi. Soran zât: Kim O'na sihir yaptı? diye sordu. O da: Lebîd bin el-A'sam, diye cevab verdi. Soran zât (bu kere) : Sihri hangi şeyde yaptı? diye sordu. O da: Bir tarak, saç ve sakal tarantısı ve erkek hurmanın çiçek kapçığında yaptı, diye cevab verdi. Soran zât: O sihir malzemesi nerededir? diye sordu. O da: Zi Ervân kuyusundadır, dedi.) demiştir ki: Sonra Peygamber (sallallahü aleyhi ve sellem), sahâbilerinden bir kaç zât ile beraber o kuyuya gitti. Oradan geldikten sonra: and olsun ki Yâ Âişe, O kuyunun suyu tıpkı kına karıştırılan su gibi (kırmızı) ve kuyunun çevresindeki hurma ağaçları tıpkı şeytanların başları gibidir (yani ne suyunda ne ağaçlarında hayır var),) buyurdu. demiştir ki; Ben: Yâ Resûlallah! Peki o sihir malzemesini (çıkarıp) yakmadın mı? dedim. Resül-i Ekrem (sallallahü aleyhi ve sellem) : (çıkarıp) yakmadım. Çünkü Allah bana şifâ verdi ve ben onu (çıkarıp) yakmakla sihir şerrinin halk arasında yayılmasından endişelendim), buyurdu. (Âişe demiştir ki: Sonra Peygamber (sallallahü aleyhi ve sellem) 'in emriyle o kuyu kapatıldı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 31,
				"hadith": 110
			}
		}
	]
}