{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"33": "Etiquette"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3719,
			"arabicnumber": 3719,
			"text": "Ümmü Seleme (r.anha)'dan rivayet edildiğine göre şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem)'in vefatından bir yıl önce bir kere Ebû Bekir (r.a.), ticaret maksadıyla Busra'ya gitti. Beraberinde Nuayman ve Harmala oğlu Süveybıt; (r.a.) bulunuyordu. Bu iki zât, Bedir savaşma katılmışlardı. Nuaymân (yolculukta), azık işine nezâret ederdi. Süveybıt da çok şakacı bir adam idi. (Yolculuk esnasında bir ara) Nuaymân'a: Bana yemek ver, dedi. Nuaymân (ise) Ebû Bekir, gelinceye kadar bekle, dedi. Bunun üzerine Süveybıt: (And olsun ki) Ben seni muhakkak hiddetlendireceğim, dedi. Râvi demiştir ki: Sonra bunlar bir kavme uğradılar. Süveybıt o kavme: Benden bir kölemi satın alır (mı) sınız? dedi. Onlar da: Evet, dediler. Süveybıt (bu kere onlara): Benim (size satacağım köle), konuşkan bir köledir ve size: Ben muhakkak hür bir kimseyim, diyecektir. O size böyle söylediği zaman eğer siz onu bırakacak iseniz, kölemi bana karşı bozguncu ettirmeyiniz, dedi. Onlar : Hayır. Bil-akis biz onu senden satın alırız. dediler ve Nuayman'ı Suveybit'ten on sağlam deve ile satın aldılar. Sonra Nuayman'ın yanına vararak boynuna bir sargı veya ip geçirdiler. Nuayman: Şu adam sizlerle cidden alay ediyor ve ben kesinlikle hür olup köle değilim. dedi. Fakat onlar: Senin efendin senin durumunu bize haber verdi. diyerek onu alıp götürdüler. Sonra Ebu Bekir geldi. Orada bulunanlar durumu ona anlattılar. Ravi dediki: Bunun üzerine Ebu Bekir (r.a.) adamların arkasında giderek develerini kendilerine geri verip Nuayman'ı alıp getirdi. Ravi dediki: Sonra Ebu Bekir ve arkadaşları Nebi (Sallallahu Aleyhi ve Sellem)'in yanına vararak ona arzedince bundan dolayı Nebi (Sallallahu Aleyhi ve Sellem) güldü, sahabileri de bir yıl güldüler. Not: Zevaid de: Bu hadis'in isnadındaki Zem'a bin Salih'in başka ravilerce te'yid edilmiş rivayetini Müslim almış, bununla beraber Ahmed, İbn-i Main ve başkaları onu zayıf saymışlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 33,
				"hadith": 63
			}
		}
	]
}