{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 381,
			"arabicnumber": 381,
			"text": "(Abdullah) İbni Ömer r.a.’den şöyle rivayet edilmiştir: Erkekler ve Kadınlar, Resulullah Sallallahu Aleyhi ve Sellem zamanında bir kab'dan abdest alırlardı. Diğer tahric: Ebu Davud, Nesei, Beyhaki ve İbn-i Huzeyme tarafından aynı sözlerle rivayet edilmiştir. AÇIKLAMA : EI-Menhel'de hadisle ilgili olarak şu izah var: ''Resulullah s.a.v. zamanında ... '' tabiri, hadisin hükmen merfu' olduğunu ifade eder. Çünkü Sahabi, bir fiili Resul-i Ekrem'in zamanına isnad edince merfu' hükmünde olur. Hadisin zahirine göre erkekler ile kadınlar bir kabtan aynı zamanda abdest alırlardı. Eğer böyle manalandırılırsa hadis eş durumunda olanlara ve mahremlere ait olur. Çünkü yabancı erkeklerle kadınların bir. kabtan aynı zamanda abdest almaları uzak bir ihtimaldir. İbnü't-Tin'in dediği gibi şayet hadis mahrem olanlara tahsis edilmeyerek genel olarak kabul edilirse hadisden maksad şu olur: ''Erkekler kendi aralarında toplu halde kadınlar da kendi aralarında toplu halde aynı kabtan abdest alırlardı.\" Bu takdirde erkekler ayrı, kadınlar da ayrı olmuş olur. Ebu Davud'un Müsedded'den bir rivayetinde bulunan \"Cemian = toplu halde\" kelimesi de İbnü't-Tin tarafından bu şekilde açıklanmıştır. Erkeklerin ve kadınların ayrı ayrı zamanlarda ama toplu halde aynı kaptan abdest almış olduğu burada anlatılmış oluyor. Bazıları da kadınların örtünmesine ait 'Hicab' emri gelmeden önceki zamanda erkeklerle kadınların bir arada ve aynı zamanda bir kaptan abdest aldıkları bu hadiste ifade edilmiş olabilir, demişler ise de bu yorum pek kabule şayan görülmemiştir. Çünkü bu hal akıldan bile uzaktır. Sindi de bu hadisle ilgili olarak ezcümle şöyle söyler: 'Suyuti, Rafii'den naklen beyan ettiğine göre bu hadis, eş durumunda olan erkek ve kadının bir kabtan beraber abdest aldıklarını, bu durumun Nebi s.a.v. zamanında yoğun olduğunu, Nebi s.a.v.in bu duruma itiraz etmediğini ve değiştirmediğini belirtmek içindir.» EI-Menhel yazarı daha sonra hadisten çıkarılan fıkıh hükmünün şu olduğunu ifade eder: 1. İki ve daha çok kimsenin bir kabtan suyu avuçlayarak (kabın dışında) abdest almaları caizdir. 2. El-Hafız, EI-Fetih'de demiştir ki: Kabtan su avuçlamakla, kabta kalan suyun müsta'mel sayılmayacağı hükmü bu hadisten çıkar. Çünkü onların kabları küçük idi. Nitekim Şafii bu hususu EI-Ümm'ün bir çok yerlerinde açıkça belirtmiştir. 3. Sindi'nin beyanına göre, bazı alimler: 'Bu hadis, kadının abdest artığı ile erkeğin abdest almasının caiz olduğuna delalet eder.' demiştir. Şöyle ki: Erkek ile kadın bir kabtan abdest alınca icabında kadın erkekten önce abdestini tamamlar, dolayısı ile erkek kadın artığı sayıları kabtaki su ile abdest almış sayılır. Eğer bu artik ile erkeğin abdest alması memmi olmuş olsaydı sahabiler bu artıkla abdest almayacaklar idi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 115
			}
		}
	]
}