{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 382,
			"arabicnumber": 382,
			"text": "Ümmü Subyetül-Cüheniyye r.a.’den: Şöyle söylemiştir: ''Tek bir kab'dan abdest alırken bazen benim elim ve Resulullah Sallallahu Aleyhi ve Sellem’in eli gelip giderdi. '' Ebu Abdillah bin Maceh dedi ki: '' Ümmü Subye’nin Kays kızı Halvete olduğunu Muhammed’den işittim,sonra Ebu Zura’ya anlattım.Ebu Zura : Muhammed doğru söyledi, dedi. Diğer tahric: Ebu Davud; Darekutni, Ahmed, Beyhaki, İbn-i Ebi Şeybe, Tabarani ve Tahavi; Buhari de EI-Edebu'l-Müfred'de nakletmiştir. (40) AÇIKLAMA : EI-Menhel yazarı, Ebu Davud'un rivayet ettiği bu hadisi açıklarken ez cümle şunları söyler: Ümmü Subye r.a.'nın maksadı: Resul-i Ekrem (s.a.v.)'in bazen kendisinden önce ve bazen de kendisinden sonra suyu avuçla kabtan aldığını belirtmektedir. Ümmü Subye, Kays kızı Havlete'dir. Resul-i Ekrem'e biat edenlerdendir. Ravileri de Harrabuz'un oğulları Salim ve Nafi'dir. Ebu Davud ve İbn-i Maceh, onun hadislerini almışlardır. Ümmü Subye (r.a.) , Nebi (s.a.v.)'in mahremi veya zevcesi olmadığı halde, Nebi s.a.v. ile aynı kabtan abdest almaları nasıl caiz olur? denmesin, çünkü ikisinin arasında ve su kabı üzerinde bir perdenin gerilmiş olması ve perde arkasında durup sırayla suyu avuçlamış olmaları muhtemeldir. 'Sindi bu ihtimalin yanında ikinci bir ihtimalolarak bu durumun \"HiCAB,. emrindcan önceki zamanda meydana gelmiş olmasıdır, der.' El-Menhel'de daha sonra hadisten çıkarılan şu fıkhi hükümleri anlatılır: 1. Abdestsiz bir kimsenin (temiz olan) eli ile kabtan avucuyla su alması caizdir. 2. Abdestsiz bir kimse (temiz olan) elini kaba batırmakla kabtaki su müstamel sayılmaz /temizleyicidir, taharette kullanılır.) 3. Kabta kalan su ile abdest alınabilir. 4. Biri erkek, diğeri kadın bile olsa iki kişinin tek bir kabtan abdest alması caizdir. (Yabancı erkek ile kadının bir arada bulunup abdest almalarının başka yönlerden yasak olması ayrı bir husustur)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 116
			}
		}
	]
}