{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"34": "Supplication"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3859,
			"arabicnumber": 3859,
			"text": "Aişe (r.anha)'dan şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'in: «Allahım! Benin senin pak, güzel, mubarek ve zatına en sevimli ismin ile şüphesiz senden dilerim, o isim ki onunla çağrıldığın zaman icabet edersin, onunla senden istendiği zaman verirsin, onunla senden, onunla senden rahmet taleb edildiği zaman rahmet eylersin ve sıkıntıdan kurtulmak için onunla senden yardım dilediği zaman sıkıntıdan kurtarırsın.» diye dua ederken sesini işittim. Aişe demiştir ki: Ve Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) bir gün: «Ya Aişe Allah'ın hangi isimle çağrıldığı zaman duayı kabul buyuracağını bana gösterip bildirdiğini bilirmisin?» buyurdu. Aişe demiştir ki: Ben: Ya Resulallah! Babam anam sana feda olsun O İsmi bana öğret, dedim. O: «Ya Aişe O İsmin öğretilmesi sana uygun değildir.» buyurdu. Aişe demiştir ki: Bunun üzerine ben uzaklaşıp bir saat oturdum. Sonra kalktım ve O'nun başını öptüm. Daha sonra: Ya Resulallah! O İsmi bana öğret, diye ricada bulundum. O: «Ya Aişe O İsmin sana öğretmem sana uygun değildir. Çünkü şüphesiz senin O İsimle dünyalık bir şey istemen senin için uygun olmaz.» buyurdu. Aişe demiştir ki: Bunun üzerine ben de kalkıp abdest aldım ve iki rek'at namaz kıldıktan sonra: Allahım! Şüphesiz ben seni Allah, diye çağırırım, er-Rahman diye çağırırım, el-Berr, er-Rahim, diye çağırırım ve seni bildiğim ve bilemediğim Esma-ı Hüsna'nın hepsiyle çağırırım ki beni mağfiret edesin ve bana rahmet edesin, diyerek dua ve dilekte bulundum. Aişe demiştir ki: Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) güldü. Sonra buyurdu ki: «Şüphesiz O İsim senin duada andığın isimler içindedir.» Not: Zevaid'de şöyle denilmiştir: Bunun senedi hakkında konuşulur, RAvi Abdullah bin Ukeym'i, el-Hatib güvenilir kabul ederek sahabller arasında saymıştır. Fakat Nebi (s.a.v.)'den hadis dinlediği sağlıklı bir rivayetle sabit değildir. Ravi Ebu Şeybe'ye gelince; Ben onu ne yeren ne de güvenilir sayan kimseyi görmedim. senedln kalan ravileri güvenilir zatlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 34,
				"hadith": 33
			}
		}
	]
}