{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3930,
			"arabicnumber": 3930,
			"text": "İmran bin Husayn (r.a.)'den; Şöyle demiştir: Nafi bin el-Ezrak (ki haricîlerin Ezrakîler kolunun başıdır) ve arkadaşları gelerek: Sen helak oldun (dinden çıktın) Ya İmran, dediler, İmran: Ben helak olmadım (küfre gitmedim), diye cevab verdi. Onlar : Bil-akis (müslümanlıktan çıktın), dediler. îmran: Beni helak eden şey nedir? diye sordu. Onlar : Allah «Bir fitne (yani Allah'a ortak koşmak) kalmayıp din tamamen Allah'ın (dini olan İslamiyet) olana kadar onlarla savaşınız» (Enfal 39) buyurmuştur. (Yani sen ise bizim safımızda yer alıp haricî olmayanlarla savaşmadın), dediler. İmran: Biz, müşrikleri bertaraf edinceye kadar savaştık ve din tamamiyle Allah'ın oldu (yani Hicaz müşriklerden tamamen temizlendi), Dilerseniz size Resulullah (Sallallahu Aleyhi ve Sellem)'den işittiğim bir hadîsi rivayet edeyim, dedi. Onlar: O hadîsi Resulullah (Sallallahu Aleyhi ve Sellem)'den sen (mi) işittin? diye sordular. İmran: Evet, (ben işittim). Şu olaya şahid oldum, dedi : Resulullah (Sallallahu Aleyhi ve Sellem), müşriklere müslümanlardan bir askerî kuvvet gönderdi. Giden müslüman askerler müşriklere rastlayınca onlarla şiddetli bir savaş yaptılar. Neticede müşrikler mağlûp olarak sutlarını müslüman askerlere verdiler (yani savaşta kırılıp saf dışı edildiler). Sonra benim yakınlarımdan bir adam müşriklerden bîr adama mızrakla hücum ederek yanma varınca müşrik adam: \"Eşhedu en la ilahe illallah = Allah'tan başka hak ilah olmadığına şehadet ederim.\" Ben şüphesiz müslümanım, dedi. Fakat (buna rağmen) yakınım olan adam mızrakla vurup onu öldürdü. Sonra Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına geldi ve : Ya Resulallah! Ben helak oldum (yani büyük bir günah işledim), dedi. Resûl-İ Ekrem (Sallallahu Aleyhi ve Sellem) bir veya iki defa: «İşlediğin (günah) nedir?» buyurdu. Adam da yaptığı işi O'na arzetti. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) adama: (Kelime-i şehadet getirip müslüman olduğunu söylediğine rağmen samimiyetine inanmadın) O halde karnım yarıp da kalbindekini bilmeliydin? buyurdu. Adam: Ya Resûlallah! Karnını yarsaydım kalbindekini bilmiş olur (mu) idim? deyince Resul i Ekrem (Sallallahu Aleyhi ve Sellem): O halde sen ne onun konuştuğu sözünü kabul ettin, ne de kalbindekini bilirsin, buyurdu. İmran dedi ki: Sonra Resulullah (Sallallahu Aleyhi ve Sellem) adam hakkında bir şey söylemedi. Adam da az bir zaman yaşadı. Nihayet öldü. Biz onu defnettik. Ertesi günü sabahı cesedi yer yüzünde görüldü. Halk: Bir düşman bunun cesedini toprağın altından çıkarmış olabilir, dedi. Biz onu (tekrar) defnettik. Sonra gençlerimize mezarı başında nöbet beklemelerini emrettik. Ertesi günü sabahı cesed (yine) yer yüzünde oldu. Bu kere biz: Gençlerimiz uyumuş (bu arada cesed düşman tarafından çıkarılmış) olabilir, dedik ve (tekrar) defnettikten sonra bu defa biz kendimiz onun nöbetini tuttuk. Yine ertesi günü sabahı cesed yer yüzünde oldu. Artık (toprağa gömmekten vazgeçip) cesedi o dağlar arasındaki yollardan birisine attık.' Not: Zevaid'de şöyle denilmiştir: Bu, hasen bir seneddir. Ravi Süzneyfı el-İcll güvenilir saymıştır. Müslim de kendi Sahfh'ine rivayetini almıştır. Ravi Asim da el-Ahven olandır. Müslim kendi Sahih'inde bunun da hadisini rivayet eder. Ve İbn-i Hibban bunu güvenilir zatlar arasına almıştır. Ravi Süveyd bin Saîd hakkında ise İhtilaf vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 3930.2,
			"arabicnumber": 3930.2,
			"text": "İmran bin el-Husayn (r.a.): Resulullah (Sallallahu Aleyhi ve Sellem) bizi bir askeri müfrezede (savaşa) gönderdi. Sonra (savaşın bitiminde) müslümanlardan bir adam müşriklerden bir adam'a hücum etti, diyerek yukardaki hadîsi anlattı ve bu rivayette şunu da ilaveten söyledi: (Biz cenazeyi defnettikten) sonra yer cesedi dışarı attı. Bunun üzerine durum Nebi (Sallallahu Aleyhi ve Sellem)'e arzedildi. O da şöyle buyurdu: Yer, o adam'dan daha şer kimseyi de şüphesiz kabul eder. Lakin Allah, — La ilahe illallah — kelimesinin hürmetinin ta'zîmini size göstermeyi sevdi. Not: Bu, hasen bir seneddir. Çünkü ravi İsmail bin Hafs hakkında ihtllaf vardır. Senedin kalan ravlleri güvenilir zatlardır",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}