{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3952,
			"arabicnumber": 3952,
			"text": "Resulullah (Sallallahu Aleyhi ve Sellem)'in azadlı kolesi Sevban (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur : «Yer benim igin o derece dürülüp toplatıldı ki ben onun doğu taraflarını ve batı taraflanni gördüm. Bana sarı ve beyaz (yani altm ve gümüş) hazineleri de verildi ve bana: Senin (ümmetinin) mülkü senin igin dürülüp toplatılan alanlara kadar (genişliyecek)dir, denildi. Ben, Allah Azze ve Celle'den (su) üç şeyi istedim: Allah'ın ümmetimin başına tümünü helak edecek bir açlık felaketini musallat etmemesini ve ümmetimi fırka fırka yapip (biribiriyle savaşmak ve iç harple) bazasına bazısının azabını tattırmamasını da istedim. (Bu isteklere karşı Allah tarafından) bana: Ben bir hüküm verdigim zaman artık o hükmün infaz edilmemesine mahal yoktur ve ben, senin ümmetin başına onları (tümüyle) helak edecek bir açlik felaketini musallat etmeyeceğim ve dünyanın çevresi arasında bulunan (kafir düşmanlar)ı ümmetin aleyhinde toplamayacağım ki ümmetinin bazısı diğer bazısını yok etsin ve biribirinl öldürsün, buyuruldu. Ümmetimin içine kılıç konulduğu (yani iç savaş. olduğu) zaman artik kıyamet gününe kadar kılıç onlardan kaldırılmayacak (yani iç savaş son bulmayacak)tir. şüphesiz ümmetim için korktuğum şeylerden birisi de sapıtıcı (yani bid'atlere, günahlara çağırıcı) imamlar (yani devlet adamları) dır. ümmetimden bazi kabileler putlara tapacak ve ümmetimden bazı kabileler de müşriklere iltihak edecektir. Kıyamete yakın zamanlarda otuza yakın çok yalancı deccal muhakkak olacak. Deccalların hepsi Nebi olduğunu söyIeyecektir. (Halbuki Nebilerin sonuncusu benim ve benden sonra Nebi yoktur). Allah (Azze ve Celle)'nin emri (ki bütün mu'minlerin toptan vefat etme belirtisi olan bir rüzgardır) gelinceye kadar ümmetimden bir zümre daima hak (yol) üzerinde kahp ilahi yardıma mazhar olacak muhalifleri onlara zarar veremeyecektir.» Ebui'I-Hasan dedi ki: Ebu Abdillah (ibn-i Maceh) bu hadisin rivayetini bitirince: Bu, ne kadar dehşetli bir hadistir, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 27
			}
		}
	]
}