{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3955,
			"arabicnumber": 3955,
			"text": "“... Huzeyfe (bin el-Yeman) (radıyallahü anhüma)’dan; şöyle demiştir: (bir gün halife) Ömer (bin el-Hattab) (radıyallahü anh)'ın yanında oturuyorduk. Ömer (orada bulunan sahabilere) : Resûlüllah (sallallahü aleyhi ve sellem)'in fitne hakkındaki hadisini hafizasında iyice tutuyor? diye sordu. Huzeyfe demişki, bu soru üzerine: (iyi bellemişim), dedim. Ömer (radıyallahü anh) : cidden (hadis bellemeye) cüretkarsın, dedi. (Sonra) Hadis nasıldır? diye sordu. Huzeyfe : Ben, Resûlüllah (sallallahü aleyhi ve sellem)'den: ailesi, evladı ve komşusu yüzünden maruz kaldığı fitneye (günaha); namaz, oruç, sadaka, iyi şeyleri emretmek ve kötü şeyleri menetmek keffaret olur,) buyruğu işittim, dedi. Bunun üzerine (radıyallahü anh) : sormak) istediğim bu (fitne hadisi) değil. Ben ancak denizin dalgalanması gibi dalgalanan fitne (hakkındaki hadisi) kasdediyorum, dedi. Bunun üzerine Huzeyfe (radıyallahü anh) : Mü'minlerin Emiri! O fitne ile senin ne ilişiğin var? şüphesiz seninle o fitne arasında kilitli bir kapı vardır, dedi. Ömer (radıyallahü anh) : kapı kırılacak mı, yoksa açılacak mı? diye sordu. Huzeyfe (radıyallahü anh) : kırılacak, diye cevab verdi. Ömer (radıyallahü anh) : Kırılan kapı (açılan kapıya nazaran) hiç kilitlenemez, dedi. demiştir ki : Biz Huzeyfe'ye : kapının kim olduğunu biliyor muydu? diye sorduk. Huzeyfe (radıyallahü anh) : yarından önce bu gecenin geleceğini bildiği gibi (biliyordu). Ben ona hile yalan yanlış olmayan bir hadis rivâyet ettim, dedi. demiştir ki:) Biz bunun üzerine kapının kim olduğunu Huzeyfe’ye sormaya cesaret edemedik de Mesruk'a: Sen Huzeyfe'ye sor, dedik. Mesruk ona sordu. O da: (Kapı) Ömer'dir, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 30
			}
		}
	]
}