{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3956,
			"arabicnumber": 3956,
			"text": "“... Abdurrahman bin Abd-i Rabbi'l-Ka'be (radıyallahü anh)’den; şöyle demiştir: gün Abdullah bin Amr bin el-As (radıyallahü anhüma) Ka’be'nin gölgesinde oturmuş, başında da halk toplanmış iken ben onun yanına vardım. Abdullah'dan (bu esnada) şunu işittim: Biz bir yolculukta Resûlüllah (sallallahü aleyhi ve sellem)'in beraberinde idik. O, bir ara bir konakta konakladı. Bunun uzerine kimimiz kendi çadırını kuruyor, kimimiz ok atışı yapıyor ve kimimiz otlanan hayvanı ile meşgul oluyordu. Bu sırada Resûl-i Ekrem (sallallahü aleyhi ve sellem)’in çağırıcısı \"Haydin namaza\" diye çağrıda bulundu. Biz de hemen toplandık. Resûlüllah (sallallahü aleyhi ve sellem) ayağa kalkarak bize şu hitabede bulundu: önceki her peygamber üzerine kendi ümmeti için hayır bildiği şeyleri onlara göstermesi ve şer bildiği şeylere karşı uyarıp korkutması şüphesiz bir hak, görev oldu. Sizin bu ümmetinizin afiyeti (yani dine zarar veren şeylerden selamette bulunması) evvelinde kılındı. Bu ümmetinizin son kısmının başına bela ve hoşlanmayacağınız bir takım işler muhakkak gelecektir. Sonra öyle fitneler gelecek ki bazısı diğer bazısını hafifletecek (yani sonra gelen fitne bir önceki fitneden daha şiddetli olacağından öncekini hafif bırakacaktır). Artık mü'min kul, (bir fitne geldiğinde) : işte beni helak eden fitne budur, der. Bir süre sonra o fitne geçer. Bunun arkasında başka bir fitne gelir ve mü'min kul: işte beni helak edici fitne budur, der. Sonra o fitne de açılıp gider. Artik kim cehennem ateşinden uzaklastırılması ve cennete girdirilmesi kendisini sevindiriyorsa Allah'a ve ahiret gününe iman eder halde iken ölümü gelsin ve insanlara, kendisine yapmalarını arzuladığı şeyleri yapsın. Kim bir devlet başkanına bey'at edip ona elini vermiş (yani seçmiş) ve samimiyetle bağlanmış ise artık olanca gücüyle ona itâat etsin. Şayet bundan sonra başka bir devlet başkanı çıkıp gelir de birincisi ile nizaa kalkışırsa (yani isyan çıkarmak isterse) sonradan gelenin boynunu vurunuz.) bin Abd-i Rabbi'l-Ka'be demiştir ki: Bunun üzerine ben başımı topluluğun arasından ileri sokarak (yani Abdullah (radıyallahü anh)'ın yakınına sokularak) : Allah aşkına sana soruyorum, bu hadisi Resûlüllah (sallallahü aleyhi ve sellem)'den sen kendin işittin (mi)? dedim. Abdurrahman demiştir ki: Bunun üzerine Abdullah (radıyallahü anh), eliyle kulaklarına işaret ederek: Bunu kulaklarım işitti, kalbim de belledi, iyice ezberledi, dedi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 31
			}
		}
	]
}