{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3958,
			"arabicnumber": 3958,
			"text": "Ebu Zerr(ri Ğıfari) (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) (bir gün): «Ya Eba Zerr! Evin (yani kabrin) köle kadar pahalanacak derecede çok insanın ölüm vukuati ile halin nasıl olacak?.» buyurdu. Ben: Allah ve Resulunün benim için seçtikleri hal (veya Ebu Zerr dedi ki: Allah ve Resulü en iyi bilendir) olur, dedim. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Sabretmeye çalış,» buyurdu. (Sonra) Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «(Ya Eba Zer!) Mescidine gelip de (açlıktan) yatağına dönmeye gücün yetmeyecek ve (açlıktan) yatağından kalkıp da mescidine gitmeye takatin kalnuyacak derecede insanların başına gelecek açlık ile halin nasıl olacak?.» buyurdu. Ebu Zer demiştir ki: Ben: Allah ve Resulu en iyi bilendir (veya Allah ve Resulünün benim için seçtigi hal olur), diye cevab verdim.. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) : «(O dönemde) iffetli olmaya devam et (yani dilenmekten veya helal olmayan kazançtan kaçın)» buyurduktan sonra: «(Ya Eba Zer!) Hicaretü'z-Zeyt (denilen yer) kan altında kalacak derecede insanların başına gelecek öldürme (fitnesi) ile halin nasıl olacak?» buyurdu. Ben: Allah ve Resulünün benim için seçtiği hal olur, dedim. Sonra Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) : «Kendilerinden olduğun kimselere iltihak et,» buyurdu. Ben: Ya Resulallah! Kılıcımı alıp da bunu yapanları kılıcımla vurmayayım mı? diye sordum. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «O zaman sen bunu yapanlara günahınla ortak olursun. Ve lakin kendi evine gir (kapan,» buyurdu. Ben: Ya Resulallah! Peki eğer benim evime girilirse? diye sordum. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) : «Şayet kılıcın parıltisının seni mağlup etmesinden korkarsan rida'nın kenarını yüzüne at (yani yuzünü ört) ki saldırgan kişi kendi günahı ve seni (oldürmen)in günahı ile dönsün ve boylece cehenem halkından olsun,» buyurdu. Diğer tahric: Ebu Davud ve Nesai de rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 33
			}
		}
	]
}