{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3973,
			"arabicnumber": 3973,
			"text": "“... Muaz bin Cebel (radıyallahü anh)’den; şöyle demiştir: bir yolculukta Peygamber (sallallahü aleyhi ve sellem)’in beraberinde idim. Bir gün yolda seyir halinde iken ben O'nun yakınında bulundum ve: Resûlüllah! Beni cennete dahil edecek ve cehennemden uzaklaştıracak bir amel (hayırlı iş)i bana bildir, diye ricada bulundum. O: cidden büyük bir şey istedin ve şüphesiz o sey, Allah'ın muvaffak kıldığı kimseye kuşkusuz kolaydır: Allah'a kulluk ederek O'na hiç bir şeyi ortak koşmazsın, namazı dosdoğru eda edersin, zekatı ödersin, Ramazan orucunu tutarsın ve Ka'be'yi hac (tavaf) edersin, ) buyurdu. Sonra: et, sana hayır kapılarını gösteriyorum: Oruç (günahlara -azaba karşı) bir kalkandır. Sadaka da suyun ateşi söndürdüğü gibi günah(ın alevin)i söndürür ve adamın gece ortasında namazı (salih mü'minlerin sembolüdür). ) buyurdu. Sonra: . . . . . . ayetini ve devamını; . . . . . . . a varıncaya kadar okudu. şöyledir: \"Onlar (geceleyin namaz kılmak için) yataklarından kalkarlar, korkarak ve ümitvar olarak Rablarına yalvarırlar ve kendilerine verdiğimiz rızıktan hayır yoluna harcarlar. Artık işledikleri salih amellere karşılık onlar için göz aydınlığı olarak saklananı hiç kimse bilemez. \" (Secde: 16, 17) sonra Resûl-i Ekrem (sallallahü aleyhi ve sellem) : ol ki sana işin başını, direğini ve zirvesini haber veriyorum: (O da) cihaddır.) buyurdu. Bundan sonra: anlattığımın hepsine sahib olmanın dönüm noktasını sana haber vermeyeyim mi?) buyurdu. Ben: ver, dedim, Bunun üzerine O, (mübarek) dilini eliyle tuttu ve sonra: (yani dilini) aleyhinde (bulunmaktan) menedeceksin,) buyurdu. Ben: Nebiyyallah! Biz konuştuğumuz şeylerden dolayı gerçekten sorumlu tutulur (mu)yuz? dedim. O: işten gafletine şaşarım Ya Muaz. Dillerinin bildikleri (faydasız sözleri) nden başka bir şey insanları başları aşağı cehenneme düşürür mü?) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 48
			}
		}
	]
}