{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3983,
			"arabicnumber": 3983,
			"text": "İbn-i Ömer (r.a.)'dan rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Mu'min bir yilan deliğinden iki defa sokulmaz.» AÇIKLAMA (3980, 3981, 3982 ve 3983): 3981. nolu hadis mana bakımından 3979. hadis gibidir. Her iki hadis fitneler döneminde halktan uzak durmanın faziletini beyan eder. Ancak bu babın baş kısmında geçen hadislerin izah bölümünde de belirttiğim gibi halkın eziyet ve sıluntılarına sabredEbuen müslümanın halkın arasına girmesi fitneler dönemi dışındaki zamanlarda daha iyidir. Fitneler döneminde ise inzivaya çekilmek ve fitne guruplarından uzak durmak en uygun oianıdır. Bu hadislerde geçen Ledğ: yılanın sokması manasını ifade eder. Cuhr de deliktir. Hattabi'nin beyanına göre bu iki hadisten kasdedilen mana. şöyle olabilir: Övgüye layık mu'min, akıllı ve zeki olup gafil avlanmayan ve ikide bir aldatılmayan mu'mindir. Bir kavle göre bundan maksad mu'minin ahiret işlerinde aldatılma oyununa gelmemesidir. Dünya işlerinde ise bazen temiz duygusu ve saflığı nedeniyle aldatılabilir. Nevevi ve Avnü'l-Mabud yazarının beyanlarına göre bu hadisin buyurulması şu olay dolayısıyladır: Bedir savaşında Nebi (s.a.v.) şair Ebu Gurre'yi esir almıştı. Sonra Resul-i Ekrem (s.a.v.) aleyhinde şiir söylememek ve hicivde bulunmamak kaydı ile Ebu Gurre salıverilmişti. Fakat şair kendi kavmine iltihak ettikten sonra sözünde durmayarak hicivlerine devam etmişti. Uhud savaşında bu şair tekrar esir alındı. Bu kere de serbest bırakılmasını istedi ise de Resul-i Ekrem (s.a.v.) bu isteği reddetti ve bu meyanda anılan hadisi buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 58
			}
		}
	]
}