{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3997,
			"arabicnumber": 3997,
			"text": "Amr bin Avf —ki Amir bin Luey oğullarnın dostu olup Bed!r savaşına Resulullah (Sallallahu Aleyhi ve Sellem)'in maiyyetinde katılmıştı— (r.a.)'den; şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), Bahreyn (ahalisinin ğayri muslimlerinin) cizyesini getirmek üzere Ebu Ubeyde bin el-Cerrah (r.a.)'i oraya gönderdi. Nebi (Sallallahu Aleyhi ve Sellem) savaş etmeksizin Bahreyn ahalisiyle barış akdederek başlarına el-Ala bin el-Hadrami (r.a.)'i vali tayin etmisti. Sonra Ebu Ubeyde Bahreyn'den bir mikdar cizye malını (Medine-i Münevvere'ye) getirdi. Ensar Ebu Ubeyde'nin geldiğini işittiler de Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde sabah namaazını kılmaya birden geliverdiler. Resulullah (Sallallahu Aleyhi ve Sellem) namazi bitirince ayrıldı. Ensar da (o esnada) Ebı Ubeyde'ye karşı çıktılar. Resulullah (Sallallahu Aleyhi ve Sellem) onları görünce gülümsedi. Sonra: «Ebu Ubeyde'nin Bahreynden bir hayli mal getirdiğini işittiğinizi sanıyorum?» buyurdu. Ensar: Evet, Ya Resulallah, dediler. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): «Şa'd olunuz ve sizi sevindirecek ni'metleri (bundan böyle de her zaman) umunuz. Vallahi (bundan sonra) size fakirlik halinin geleceğinden hiç korkmam ve Iakin sizler için korktuğum şey, sizden önceki ümmetlerin önüne dünya (ni'metleri)nin yayıldığı gibi sizin önünüze de yayılması ve onların biribirierini çekemeyip dünyalığı ele geçirmek için yarıştıkları gibi sizlerin de aynı şekilde biribirinize düşmeniz ve nihayet dünyalığın onları helak ettiği gibi sizleri de helak etmesidir.» Diğer tahric: Buhari, Humus kitabının Cizye babında, Müslim, Zühd kitabının birinci babında rivayet etmişlerdir. Nesai'nin de bunu rivayet ettiği Fethü'l-Bari'de belirtilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 72
			}
		}
	]
}