{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4030,
			"arabicnumber": 4030,
			"text": "Ubey bin Ka'b (r.a.)'den rivayet edildiğine göre kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'den rivayetle şöyle demigtir: Resul-i Ekrem (Sallallahu Aleyhi ve Sellem), geceleyin (mi'rac'a) götürüldüğünde güzel bir koku duyarak: Ya Cebrail! Bu güzel koku nedir? diye sormuş. Cebrail (A.S.) de: Bu, maşıta (kadınların saçını iyi tarayıcı kadın), iki oğlu ve kocasının kabrinin kokusudur. Bunun başlangıcı (ve sebebi) şöyle oldu: Hızır (A.S.) lsrail oğrullarının eşrafından idi ve yol güzergahında manastırında oturan bir rahib vardı. Hızır (oradan geçtikçe) rahib önüne çıkıp ona İslamiyeti ögretirdi. Sonra Hızır erginlik çağına varınca babası onu bir kadınla evlendirdi. Hızır da kadın'a (İslamiyet'i) öğretti ve kimseye duyurmaması için kadından söz aldı. Hızır kadınlara yaklaşmazdı. Hızır bir süre sonra kadını boşadı. Aradan bir zaman geçtikten sonra Hızır'ı babası başka bir kadınla evlendirdi. Hıaır bu kadına da (İslamiyet'i) ögreterek (durumu) kimseye haber vermemesi için ondan söz aldı. Sonra bu iki kadından biri sır sakladı. Fakat diğeri Hızır ('ın müslümanlığı ve bu konudaki propagandasın}'ı aleyhinde ifsaatta bulundu (böylece verdigi ahdi de bozmuş oldu). Bunun üzerine Hızır oradan kaçıp nihayet denizdeki bir adaya vardı. (Adada) odun toplayan iki adam karşıdan gelerek Hızır'ı gördüIer. Bunlardan birisi onu gördüğünü kimseye söylemedi. Fakat diğer adam bunu ifşa ederek: Ben Hızır'ı gördüm, dedi. Seninle beraber onu klm gördü? diye soru sorulunca adam: Falan kişi (benimle beraber onu gördü), dedi. Bunun üzerine o kişiye de soruldu. Fakat o kişi Hızır'ı gördüğünü gizledi. Onların dinüide yalan söyleyeni öldürme hükmü de vardı. Bilahare sır saklayan adam, sır saklayan kadınla evlendi. Sonra bu kadın Fir'avn'ın bir kızının saçını tararken tarak aniden düşuverdi. Kadın da: Flr'avn, helak olsun, diye beddua ettt. Kız da gidip babasına haber verdi. Kadının iki oğlu ve kocası vardı. (Bu ailenin müslüman olduğunu sezen) Fir'avn onlara haber göndererek dinlerinden (Fir'avn'ın dinine) dönmeleri için karı ile kocasına ısrarını sürdürdü. Fakat onlar (dinlerini bırakmaktan) imtina ettiler. Nihayet Fir'avn karı kocaya: Ben ikinizi mutlaka öldüreceğim, dedi. Kadın ile kocası (Fir'avn'a): Bizi öldürürsen senin bize bir iyiliğin olmak üzere ikimizi bir kabre defnetmeni istiyoruz, dediler. Fir'avn da (onları öldürüp ikisini aynı kabre gömme işini) yaptı, dedi. Sonra Nebi (Sallallahu Aleyhi ve Sellem) geceleyin (mi'raca) götürülünce güzel bir koku duydu ve (ne olduğunu) Cibril'e sordu. Cibril de (bunu) O'na bildirdi.\" Not: Zevaid'de şöyle denilmiştir: Bunun senedinde Said bin Beşir var. Buhari bu ravi ile ilgili olarak: Bunun hıfz-ı belleme durumu hakkunda konuştular, demiştir. Ebu Hatem de: Bunun doğruluk durumunda olduğunu babamdan ve Ebu Zur'a'dan işittim ve : Rivayeti hüccet-delil olur mu? diye sordum. Babam lie Ebu Zur'a: hayır, dediler, diye bllgi vermiştir. Başkaları ise bunun zayif olduğunu söylemiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif Isnaad"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 105
			}
		}
	]
}