{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 406,
			"arabicnumber": 406,
			"text": "Seleme bin Kays (El-Eşcai) (Radiyallahu anh)'den rivayet edildiğine göre şöyle söylemiştir: Resulullah (Sallallahu Aleyhi ve Sellem) bana buyurdu ki: «Abdest aldığın zaman (burnuna su çektikten sonra) sümkür ve taşla istinca ettiğin zaman taş sayısını tek yap.» AÇIKLAMA : İstinsar. intisar ve nesir aynı manayı ifade ederler. Hepsi buruna çekilmiş suyu sümkürmek suretiyle dışarı almaktır. Tuhfetu'l-Ahvezi. mazmaza ve istinşak babında El-Hafız İbn-i Hacer'den naklen beyan ettiğine göre tarif edilen istinsar da yani buruna çekilen suyun sümkürmek suretiyle dışarı atılmasında elin yardımcı olarak kullanılıp kullanılmaması neticeyi değiştirmez. Fakat İmam Malik. elin yardımcı olarak kullanılmadığı sümkürmek hayvanınkine benzediği gerekçesi ile mekruh saymıştır. Ama meşhur olan bunun mekruh olmamasıdır. El ile sümkürüldüğü zaman müstahab olanı, sol elin kullanılmasıdır. Nesai bunun için özel bir bab açmıştır. Hadisin istinca ile ilgili fıkrasına gelince, yine Tuhfe yazarı şunları söyler: Ebu Hureyre (r.a.)'in rivayetinde fıkra şöyledir: 'Taş ile istinca eden kimse tek yapsın. Kim tek yaparsa iyi etmiş olur. Kim tek yapmazsa (çift yaparsa) mahzur yoktur.’ Bu rivayeti Ahmed, Ebu Davud ve İbn-i Maceh rivayet etmiştir. Hafız, İbn-i Hacer EI-Fetih'te: Bu rivayetteki fazlalığa ait isnad hasendir. Ebu Hanife ve Malik bu rivayeti tutarak istincade muteber olan şey istinca sayısı değildir. Muteber olan, bu işi tek yapmaktır. Şafii, Ahmed ve hadis ehli ise Müslim'in Selman'dan rivayet ettiği şu mealdeki hadisi esas tutmuşlardır . Sizden hiç bir kimse üçten az taşla istinca etmesin. Bunlar temizlemeye riayet etmek kaydı ile en az üç taşın kullanılmasını şart koşmuşlar ve üç taşla gereken temizlik sağlanmadığı takdirde, temizleninceye kadar taş sayısı arttırılır. Ancak taş sayısını tek tutmak müstahabtır. Çünkü bu hadiste 'İstinca eden tek yapsın' emri vardır. Yalnız bu emir vucup için değildir. Zira Selman'ın hadisinde: 'Kim tek yapmazsa sakıncası yoktur buyurulmuştur. Böylece hadisler arasında uyumluluk sağlanır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 140
			}
		}
	]
}