{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"36": "Tribulations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4075,
			"arabicnumber": 4075,
			"text": "“... Nevvas bin Sem'an el-Kilabi (radıyallahü anh)’den; şöyle demiştir: (sallallahü aleyhi ve sellem) bir sabah Deccal'dan söz etti de onun hakkında alçaltma ve yükseltme yaptı, hatta biz onu (Medine-i Münevvere'nin) hurma bahçelerinin kenarında sandık. Sonra akşamleyin Resûlüllah (sallallahü aleyhi ve sellem)'in yanına vardığımız zaman bizde meydana gelen o telaşı anladı ve: nedir, (telaşlısınız)?) diye sordu. Biz de: Resûlüllah! Sabahleyin Deccal'den söz ettin ve onun hakkında öyle alçaltma ve yükseltme yaptın ki biz onu hurma bahçesinin kenarında sandık, dedik. Bunun üzerine O: baskaşı sizin için beni daha çok endişelendiricidir: (Çünkü) ben içinizde iken çıkarsa sizin önünüzde onu ben yenerim, defederim ve şayet ben içinizde değil iken çıkarsa herkes kendi nefsini savunarak onu yenmeye calışır. Allah da her müslüman hakkında benim halifemdir (koruyucu ve yardımcıdır). Deccal çok kıvırcık saçlı bir gençtir. Gözü yerinde duruyor (fakat sakattır). Ben onu Abdu'l-Uzza bin Katan'a benzetir gibiyim. Sizden kim onu görürse, aleyhinde Kehf suresinin ilk ayetlerini okusun (ki fitnesinden emin olsun). O, Şam ile Irak arasında bir yoldan çıkacak ve sağda solda hızla fesad, bozgunculuk çıkaracaktır. Ey Allah'ın kulları (dinde) sebat ediniz,) buyurdu. Biz: Resûlüllah! Onun yeryüzünde kalma süresi ne kadardır? diye sorduk. O: gündür. Bir gün bir yıl gibi. Bir gün bir ay gibi. Bir gün bir Cuma (yani bir hafta) gibi- Diğer günleri sizin günleriniz gibidir, buyurdu.) Biz: Resûlüllah! Peki bir yıl gibi olan günde bize bir günün namazı kafi gelecek (mi)? dedik. O: Her gün(lük namazlar) için normal bir gün miktarını hesaplayınız,) buyurdu. Nevvas demiştir ki: Biz: yeryüzünde sür'ati ne kadardır? dedik. O: (Arkasından rüzgar esen bulut gibidir,) buyurdu ve (buyruğuna devamla) (Deccal bir kavmin yanına vararak onları (kendisini ilah olarak kabul etmeye) davet edecek. Onlar da davetine icabet ederek ona inanacaklar. Bunun üzerine Deccal buluta yağmur yağdırmasını emredecek ve bulut da yağmur yağdıracaktır. Yere bitki vermesini emredecek. Yer de bitki bitirecek ve o kavmin deve sürüsü (ile diğer sağım hayvanları) akşamleyin hörgüçleri alabildiğine uzamış (yani çok semiz), memeleri (sütün bolluğundan) son derece gelişip sarkmış ve böğürleri tamamen dolup şişmiş olarak (mer'adan) yanlarına dönecektir. Deccal daha sonra başka bir kavmin yanına vararak onları da davet edecek. Fakat o kavim onun sözünü reddedecek. O da onların yanından ayrılıp gidecek. Fakat o kavmin başına kıtlık felaketi gelecek ve ellerinde (mal olarak) hiç bir şey kalmayacaktır. Sonra Deccal bir harabeye uğrayacak ve ona: Definelerini çıkar, diye seslenip oradan ayrılacak. Harabenin defineleri de bal arılarının arı beyini izledikleri gibi hemen arkasına düşecektir. Sonra Deccal, gayet genç bir adamı (kendisine inanmaya) davet edecek de (genç davetini reddedince Deccal öfkesinden) onu kılıçla vurup ikiye bölecek, her parçayı bir okun ulaşabileceği hedef mesafesine fırlatacak (yani iki parça arasındaki mesafe bir okun atıldığı yer ile varabileceği hedef mesafesi kadar olacak). Sonra o genci çağıracak. Gene dirilip parlak yüzlü ve gülerek ona yönelecek (yani onunla alay ederek: Senin sapıklığın hakkında şu anda daha bilinçliyim, demek isteyecektir ve Deccal bir daha o gence dokunamayacaktır). Deccal ile halk bu halde iken aniden Allah Îsa (Aleyhisselam)'ı gönderecektir. Îsa (Aleyhisselam), Dımeşk'in doğusundaki beyaz minare yanına boyalı bir takım elbise içinde, ellerini iki meleğin kanatları üzerine koymuş olarak inecektir. Başını (önüne) eğdiği zaman başı (ter) damlatır ve başını havaya kaldırdığı zaman iri inciler gibi (yapılan) gümüş tanecikleri(ne benzeyen berrak ter tanecikleri) başından aşağıya doğru yuvarlanacaktır. Onun nefesinin kokusunu duyan hiç bir kafirin ölmemesi mümkün değildir. Onun nefesi de gözünün görebildiği mesafeye ulaşacaktır. Îsa (Aleyhisselam) gidip Deccal'a nihayet Lûd kapısı yanında yetişecek ve onu öldürecektir. Sonra Allah'ın peygamberi Îsa (Aleyhisselam), Allah'ın (Deccal'den) korumuş olduğu bir kavmin yanına varacak ve yüzlerini meshedecek (yani elini teberrüken yüzlerine sürecek veya onları korku ve sıkıntıdan kurtaracak) ve onlara cennetteki derecelerini anlatacaktır. Onlar bu halde iken aniden Allah, Îsa'ya: Îsa! Ben öyle bir takım kullarımı çıkardım ki onlarla savaşmaya hiç bir kimsenin gücü yetmez. Sen de kullarımı Tur'a götürüp orada toplu halde onları koru, diye vahiy indirecek ve Allah, Ye'cuc ve Me'cuc'u gönderecektir. Bunlar Allah'ın buyurduğu gibi her tepeden hızla sızacaklardır. Bu süratli öncüleri Taberiyye gölüne uğrayacak ve içindeki suyu içecekler (suyu tüketecekler). Sonra geride olanları (O göle) uğrayacaklar ve: Bu gölde muhakkak bir kere su vardı, diyecekler. Allah'ın peygamberi Îsa ve arkadaşları da (Tur dağında) mahsur kalacaklar. Hatta onlardan birine bir öküz kellesi sizden birinize bugünkü yüz altından daha makbul olacaktır. Sonra Allah’ın peygamberi Îsa (Aleyhisselam) ve arkadaşları Allah'a niyaz edecekler. Allah da Ye'cuc ve Me'cuc üzerine boyunlarına Mûsâllat olacak deve kurdu gönderecek. Ve böylece Ye'cuc ve Me'cuc bir kişinin ölmesi gibi bir arada ölmüş olacaklar. Allah'ın nebisi Îsa ve arkadaşları da (Tur dağından) inecekler de yeryüzünde onların laşelerinin kokusu ve kanları ile dolmadık bir karışlık yer bulamayacaklar. Bunun üzerine Îsa (Aleyhisselam) ve arkadaşları (yer yüzünün bunlardan temizlenmesi için) Allah Sübhanehu'ya niyaz edecekler. Allah da boyunları buht (cinsi) develerinin boyunlarına benzeyen bir takım kuşları laşeler üzerine gönderecek ve kuşlar laşeleri taşıyarak Allah'ın dilediği yere atacaklar. Sonra Allah onlara öyle bir yağmur gönderecek ki ne bir kerpiç bina ne de bir çadır (hiçbir seyi) o yağmurdan saklıyamıyacak (koruyamıyacak), yağmur böylece her tarafı yıkayıp ayna gibi parlatacaktır. Sonra yere: Ürününü bitir, bereketini de geri getir, denilecektir. İşte o gün cemaat nardan yiyecekler. O nar (tanesi) onları doyuracak ve onlar onun kabuğu altında gölgeleneceklerdir. Allah süte de öyle bereket verecek ki yeni doğum yapmış. deve kalabalık cemaate yetecek, yeni doğum yapmış inek bir kabileye yetecek ve yeni doğurmuş koyun - keçi akrabalardan oluşan cemaate yetecektir. Sonra onlar bu halde iken Allah onlara güzel bir rüzgar gönderecek, o rüzgar onları koltuk altlarından yakalayarak, müslüman olan herkesin ruhunu alacaktır. Diğer insanlar eşeklerin alenen çiftleştiği gibi herkesin gözü önünde cinsel ilişkilerde bulunup duracaklar. İşte kıyamet bunların başına kopacaktır,) buyurdu",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 36,
				"hadith": 150
			}
		}
	]
}