{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 421,
			"arabicnumber": 421,
			"text": "Ubeyy bin Ka'b (Radiyallahu anh)'den rivayet edildiğine göre Resulullah (Sattallahu Aleyhi ve Sellem) şöyle buyurdu demiştir: «Şüphesiz abdest (vesvesesi) için Velehan denilen bir şeytan vardır. Bunun için su vesvesesinden sakının.» Not: Tirmizi, «Abdestte İsrafın Keraheti» babında, hadisi ayni isnad ile zikretmiş ve garip olup bu isnadın hadisçiler yanında kuvvetli olmadığını, çünkü Harice'den başka kimsenin bunu isnad ettiğini bilmiyoruz. Harice de arkadaşlarımız yanında kuvvetli değildir, hatta İbnü'l-Mübarek onu zayıf görmüştür, der. Bu hadis müteaddit yollarla El-Hasan'dan rivayet edilmiştir. Diğer tahric: Tirmizi, tahare TİRMİZİ HADİSİ İÇİN BURAYA TIKLAYIN AÇIKLAMA : Tirmizi'nin şerhi Tuhfe'de şöyle deniliyor: Zehebi, EI-Mizan'da: Ahmed, Harice'yi zayıf görmüş, İbn-i Main, Harice. sika değil, kezzabtır, demiş, Buhari de İbnü'l-Mübarek ve Veki'in onu terkettiklerini ifade etmiştir' der. Velehan: Sözlükte aşırı aşk ve şiddetli muhabbet dolayısıyla aklın gitmesi ve şaşmaktır. Abdest işinde vesvese eden şeytana bu ismin verilmesinin sebebi, abdest işine vesvese sokmak yolundaki aşırı hırsıdır. Yahut yaptığı vesvese ile insanı öyle bir hayrete sokuyor ki, artık kişi kendisini şaşkın görür, şeytanın nasıl onunla oynadığını anlamaz. Abdest alırken uzvunun ıslanıp ıslanmadığını ve kaç defa yıkadığını bilemez olur. Bundan dolayı da bu isim verilmiştir, denilebilir. Hadisin: ''Su vesvesesinden sakının\" parçası hakkında Tıybi'den naklen Tuhfe'de deniliyor ki: Yani abdest uzuvları ıslandı mı, ıslanmadı mı, bir defa mı, iki defa mı yıkandı, su temiz mi necis mi?, Su kulleteyn var mı, yok mu? diye Velahan adlı şeytan'ın suyla ilgili yapmak istediği bu ve benzeri vesveselerden kaçının. İbnü'l-Melik demiş ki, şeytan su hakkında pek fazla vesvese verdiğinden parçada Velehan vesvesesi, tabiri yerine su vesvesesi, tabiri mübalağayı ifade etmek için kullanılmıştır. İbn-i Hacer de İbnü'l-Melik'in bu görüşünü benmsemiştir. Hadis, abdest alınırken su'da israf etmenin kerahetine delalet eder. Nehir kenarında bile abdest alınırken suda israf etmenin kerahetinde alimler icma etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 155
			}
		}
	]
}