{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 428,
			"arabicnumber": 428,
			"text": "Ebu Hureyre (Radiyallahu anh)'den rivayet edildiğine göre, Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu : Güçlüklere rağmen abdest'i kemal üzere almak ve mescitlere doğru çok adım atmak ve (bir) namazdan sonra da gelecek namazı gözetlemek (beklemek) günahların kefaretidir. AÇIKLAMA : Müslim ve Tirmizi'nin «Abdest İsbağı» babında Ebu Hureyre (r.a.)'den rivayet ettikleri şahid durumundaki hadiste Resul-i Ekrem'e ait kısım burdaki lafızların aynıdır. Sahabi'ye ait lafızlarda manayı etkilemeyen az bir değişiklik vardır. Oradaki hadisin meali şöyledir: \"Ebu Hureyre (r.a.)'den : Şöyle söylemiştir: Resulullah (s.a.v.), (sahabilere) : «Allah'ın, günahları imha ettirdiği ve dereceleri yükselttirdiği şeyleri size göstermiyeyim mi?» buyurdu. Sahabiler: - Göster, Ya ResulalIah! dediler. Resulullah (s.a.v.) : «Güçlüklere rağmen abdesti tam olarak almak, mescidlere doğru çok adım atmak ve (bir) namazdan sonra diğer (bir) namazı beklemektir. İşte sizin ribatınız (= nöbetiniz) budur.'' buyurdu.\" Yukarıya mealini aldığımız Ebu Hureyre'nin hadisindeki Resul-i Ekrem'e aıt buyruğun son cümlesi Ebu Said-i Hudri'nin hadisinde yoktur. Tirmizi'nin şerhi Tuhfe'de Nevevi'den naklen beyan edildiğine göre Kadi İyad, hadisle ilgili olarak şöyle demiştir: 'Günahların imhasından maksad, onları mağfiret etmek (örtmek) tir. Bununla beraber, imha tabiri ile günahları hafeze meleklerin defterinden silmek kasdedilmiş olabilir ki, bu takdirde yine günahların mağfiretine delalet eder.' Derecelel'in yükselmesi de cennetteki makamın yükselmesi demektir. Konuşmanın soru ve cevap şeklinde oluşu, buyurulan hakikatların zihinlerde iyice yerleşmesini sağlar Hadisteki \"Güçlükler ... \" tabiri ile şiddetli soğuk, suyun dokunmasından eziyet duyulan hastalık. su arayıp bulmakta duyulan güçlük, gerektiğinde parayla. hatta pahalı bir fiatla suyu satın almak ve benzeri zorluklar kasdedilmiştir. \"Mescidlere doğru çok adım atmak.'' durumu ise Nevevi'nin beyan ettiği gibi evin mescidlere uzak oluşu ve mescitlere devamlı gitmekle sağlanır. ''Bir namazdan sonra diğer bir namazı beklemek'' parçasından maksad, Tuhfe'de şöyle açıklanıyor: Yani, kişi cemaatle veya tek başına namaz kıldıktan sonra. oturduğu yerde veya evde diğer namaz vaktinin gelişini bekler. fikrini ona bağlar, yahut işiyle meşgul olmakla beraber, kalbini gelecek namaz vaktine bağlar. Ebu'l-Velid EI-Baci ise parçayı, bir vakit namazından sonra oturdugu' yerde diğer namaz vaktini belkemek, şeklinde yorumlamış ve bu durum, zamanları birbirine yakın olan namazıara mahsustur. Diğer namazlar için böyle bir bekleyiş adet olmamıştır, der. Musannıfın rivayetinde bulunmayan, fakat Müslim ile Tirmizi'nin rivayetinde bulunan «İşte sizin ribatınız budur cümlesine gelince; ribat; nöbet yeri ve bir şeye kendini hapsetmek, demektir. Namaz kılmak için camiye gidip orada namaz vaktini bekliyen kimse kendini ibadete hapsetmiş gibidir. Şöyle de denilebilir: Hadiste anılan ibadetlere devam etmek cihad ve serhatte nöbet beklemek gibidir. Bazıları; anılan ibadetler, sahibini günahlardan menettiği için buna ribat denmiştir, derler. Nevevi de parça hakkında: «Yani rağbet edilen ribat budur. Bir kısım ilim adamlarına göre rıbatın en faziletlisi budur. Nasıl ki, cihadın en büyüğü nefisle yapılan cihaddır. Şöyle yorumlamak da mümkündür: Ribat çeşitleri arasında herkes için yapılması ve sevabına kavuşulması mümkün olan ribat işte budur.» Tuhfe'de beyan edildiğine göre Kadi iyad şöyle demiştir: Bu ameller gerçek ribattır. Çünkü şeytanın nefis üzerine yapmak istediği etki yollarını tıkar, şehvani arzuları yener, vesveselere engel olur. Bu ise büyük cihaddır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 162
			}
		}
	]
}