{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4297,
			"arabicnumber": 4297,
			"text": "İbn-i Ömer (r.a.)'dan; Şöyle demiştir: Biz savaşlarının birisinde Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberinde bulunuyorduk. O bir kavme uğrayarak: Bunlar kimdir? diye sordu. O kavim de: Biz müslümanız, dediler. Bir kadın da tandırına yakacak atmakla meşguldü ve beraberinde bir oğlu vardı. Tandırın alevi yükselince kadın çocuğunu uzaklaştırırdı. Sonra kadm Nebi (Sallallahu Aleyhi ve Sellem)'in yanına geldi ve: Sen Allah'ın Resulü (mü)sün? dedi. O da: Evet, buyurdu. (Bunun üzerine) kadın (O'na): Babam, anam sana feda olsun! Allah merhametli olanların en çok merhametlisi değil mi? dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): Evet, (en merhametlisidir), buyurdu. Kadın: Allah, kullarına, annenin çocuğuna şefkatinden daha çok merhametli değil midir? dedi. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): Evet, (daha merhametlidir), buyurdu. Kadın: Peki, anne, çocuğunu ateşe kesinlikle atmaz, dedi. Bunun üzerine Resulullah (Sallallahu Aleyhi ve Sellem) ağlıyarak mübarek başını eğip uzun zaman yere baktı. Sonra mübarek başını kadına doğru kaldırarak: Şüphesiz Allah, hak yoldan sapıp O'na itaat etmeye tenezzül etmeyen ve Tevhîd kelimesini söylemekten imtina eden azgın kulundan başka kullarına azab vermeyecektir, buyurdu. Not: Zevaid'de şöyle denilmiştir: Ravi İsmail bin Yahya'nın zayıflığı sebebiyle İbn-i Ömer (r.a.)'ın bu hadisine ait sened zayıftır. Bu ravinin zayıflığı hususunda ittifak vardır. Sindi de : Ben derim ki bu hadisin aslı Zevaid nevinden değildir. AÇIKLAMA 4300’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Mawdu"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Mawdu"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Mawdu"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 198
			}
		}
	]
}