{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4306,
			"arabicnumber": 4306,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Sellem) bir mezarlığa giderek kabristan (da yatanlar) a şöyle selam verdi: Selam size ey mu'minler topluluğunun diyarında olanlar! Biz de inşaallah Teala, size katılacağız. Sonra Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): (Din) kardeşlerimizi (dünyada) görmüş olmayı çok arzu ederdim, buyurdu. Sahabîler: Ya Resulallah! Biz senin (din) kardeşlerin değil miyiz? dediler. O: Siz benim sahabilerimsiniz. Kardeşlerim de benden sonra gelen (mu'min) lerdir ve ben havuz üstünde öncünüzüm, buyurdu. Sahabîler: Ya Resulallah! Senin ümmetinden olup da henüz (dünyaya) gelmemiş olanları nasıl tanıyacaksın? diye sordular. Söyleyin bakayım, yağız ve doru at sürüsü içinde bir adamın sakar ve sekir atları bulunsa, adam kendi atlarını tanır olmaz mı? diye sordu. Sahabîler: Evet, dediler. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem): İşte onlar da kıyamet günü abdest izinden dolayı yüzleri, kolları ve ayakları nurlu olarak gelirler, buyurduktan sonra: Ben havuz üstünde sizin (ve onların) öncüsüyüm, buyurdu. Daha sonra : Bir takım adamlar kayıp devenin (su'dan) kovulduğu gibi benim havuzumdan muhakkak kovulacaklar. Ben (onlara hitaben) dikkat ediniz, buraya geliniz, diye onları çağıracağım. Fakat : Onlar sen'den sonra muhakkak (dinde) değişiklik yaptılar, denilecek ve onlar geri dönmeye devam edecekler. Ben de hadi uzaklaşın, uzaklaşın diyeceğim, buyurdu. BUHARİ HADİSLERİ VE İZAH İÇİN TIKLA BUHARİ KEVSER SURESİ TEFSİR HADİS VE İZAH İÇİN TIKLA",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 207
			}
		}
	]
}