{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4312,
			"arabicnumber": 4312,
			"text": "Enes bin Malik (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: Mu'minler kıyamet günü toplanarak: Rabbimize bir şefaatçi göndersek de Rabbimiz bizi bu (sıkıntılı) yerimizden rahata kavuştursa, diyecekler (Bunu söylemeleri için Allah tarafından) gönüllerine İlham edilir (veya onlar bu sıkıntıya gereken önemi verirler. — Bu tereddüd ravi Said'e aittir—). Bunun üzerine mu'minler adem (Aleyhisselam)'a varırlar ve (ona) : Sen adem'sin, bütün insanların babasısın, Allah seni eliyle yarattı ve meleklerini sana secde ettirdi. Artık (ne olur) bizim için Rabbin katında şefaat et de bizi şu (sıkıntılı) yerimizden (kurtarıp) rahata kavuştursun, derler. Fakat adem (Aleyhisselam) : Ben sizin dediğiniz (şefaat) makamında değilim (ve adem vaktiyle işlediği hatayı onlara yakınarak anlatarak bundan dolayı haya eder) ve lakin Nuh'a gidiniz. Çünkü O, Allah'ın yer yüzündekilere gönderdiği ilk resul (elçi)dir, der. Bunun Üzerine mu'minler Nuh (Aleyhisselam)'a varırlar. O da: Ben sizin dediğiniz (şefaat) mevkiinde değilim, (ve Nuh, hakkında bilgisi olmayan bir şeyi — ki oğlunun aile ferdlerinden oluşu dolayısıyla tufanda boğulmaması isteğidir— Rabbinden dilediğini anlatır ve bundan dolayı haya eder) ve lakin Halilu'r-Rahman (yani Allah'ın dostu) İbrahîm (Aleyhisselam)'ın yanına gidiniz, der. Sonra mu'minler İbrahîm Nebi'ye varırlar. Fakat O da : Ben sizin dediğiniz şefaat mevkiinde değilim. Ve lakin Allah'ın kendisi ile konuştuğu ve Tevrat'ı verdiği kulu Musa (Aleyhisselam)'a gidiniz, der. O da : Ben orada (yani şefaat makamında) yokum (ve Musa bu arada vaktiyle kısas durumu olmaksızın bir adam'ı öldürdüğünü anlatır) ve lakin siz, Allah'ın kulu, resulü, kelimesi ve ruhu (denilen) İsa (Aleyhisselam)'m yanına gidiniz, der. Bunun üzerine mu'minler İsa'ya varırlar. O da : Ben sizin dediğiniz şefaat makamında yokum ve lakin Muham-med (Sallallahu Aleyhi ve Sellem)'e, Allah'ın kendisinin geçmiş ve gelecek hatalarını bağışladığı (o yüce) kul'a gidiniz, der. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) buyurdu ki: Bunun üzerine mu'minler benim yanıma gelirler. Ben de kalkıp giderim (ravi demiştir ki: Şeyhim: \"Ve mu'minlerden İki saf arasında yürürüm\" buyruk cümlesini el-Hasan'dan naklen anlattı). Ravi demiştir ki sonra Enes (r.a.)'ın hadisine döndü. Resul-i Ekrem (Sallallahu Aleyhi ve Sellem) (sözüne devamla) buyurdu ki : Bunun üzerine ben Rabbimin huzuruna çıkmak için izin isterim. Bana izin verilir. Sonra Rabbimi gördüğüm zaman hemen secdeye kapanının. Allah dilediği sürece beni secde halinde bırakır. Sonra (bana): (Başını) kaldır Ya Muhammed! Ve söyle, işitilirsin; iste, istediğin verilir ve şefaat et, şefaatin kabul olunur, buyurulur. Bunun üzerine ben (başımı secde'den kaldırarak) O'na, Zatının bana öğrettiği bir hamd şekliyle hamdederim. Sonra (genel ve özel) şefaatta bulunurum. Bunun üzerine Rabbim bana bir sınır (ve çerçeve) çizer. Ben de o sınır (yani ölçü) içinde kalanları cennete dahil ederim. Sonra ikinci defa (şefaat için) dönerim ve O'nu görünce secdeye varırım, Allah beni dilediği kadar secdede bırakır. Sonra bana : (Başını) kaldır (ya) Muhammedi Söyle, dinlenirsin iste, istediğin verilir ve şefaat et şefaatin kabul olunur, buyurulur. Bunun üzerine ben de başımı kaldırıp O'na bana öğrettiği bir hamd şekliyle hamdederim. Sonra (tekrar) şefaat ederim. Rabbim benim (şefaat edeceğim kimseler) için bir sınır (ve çerçeve) çizer. Ben de o Ölçü içine girenleri cennete dahil ederim. Sonra üçüncü defa (şefaat etmeye) dönerim ve Rabbimi görünce secdeye kapanırım. Rabbim beni dilediği kadar (secdede) bırakır. Sonra : (Başmı) kaldır (ya) Muhammedi Söyle, işitilirsin; iste, istediğin verilir ve şefaat et, şefaatin kabul olunur, buyurulur. Ben de başımı kaldırıp O'na bana öğrettiği biçimde hamdederim. Sonra şefaat ederim. Allahım (yine) bana bir sınır tayin eder. Ben de onları cennete dahil ederim. Sonra dördüncü kez (Rabbimin huzuruna) dönerek: Ya Rabbî (cehennemde) Kur'an'ın hapsettiği (yani ebedi olarak cehennemde kalmalarına hükmettiği) kişilerden başka hiç kimse kalmadı, diyeceğim. Ravi demiştir ki: Katade bu hadîsin hemen arkasında şöyle dedi : Ve Enes bin Malik (r.a.), Resulullah (Sallallahu Aleyhi ve Sellem)'in şöyle buyurduğunu da bize rivayet etti : Kalbinde bir arpa (tanesi) ağırlığınca hayır (yani iman) bulunduğu halde \"la ilahe illallah = Allah'tan başka ilah yoktur\" diyen herkes cehennemden çıkacaktır. Keza: kalbinde bir buğday (tanesi) ağırlığınca hayır (yani iman) bulunduğu halde \"La ilahe illallah\" diyen herkes cehennemden çıkacaktır. Kalbinde zerre ağırlığı kadar hayır (yani iman) bulunup da \"La ilahe illallah\" diyen herkes de cehennemden çıkacaktır.\" Diğer tahric: Bu hadisi Buhari, Tefsir, Tevhid ve Rikak bölümlerinde ve Müslim İman bölümünde, Nesai de Tefsir bölümünde benzer lafızlarla rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 213
			}
		}
	]
}