{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4336,
			"arabicnumber": 4336,
			"text": "Saîd bin el-Müseyyeb (r.a.)'den rivayet edildiğine göre: Kendisi (bir gün) Ebu Hureyre (r.a.)'a rastlamış ve Ebu Hureyre (r.a.) kendisine: Beni ve seni cennet çarşısında (da) bir araya getirmesini Allah'tan isterim, demiş. (Bunun üze-rinej Sald: Cennet'te çarşı var mı? diye sormuş. Ebu Hureyre (r.a.) (de); Resulullah (Sallallahu Aleyhi ve Sellem) bana şu haberi verdi, demiştir. Cennet halkı cennet'e girdikleri zaman (iyi) amellerinin çokluk derecesine göre makamlarına yerleşirler. Sonra dünya günlerinden Cuma günü kadar bir süre için onlara izin verilerek Allah (Azze ve Celle)'yi ziyaret ederler. Allah onlar için Arş'ını açar ve cennet bahçelerinden bir bahçede onlara görünür. Cennet halkı için nurdan koltuklar, inciden koltuklar, yakuttan koltuklar, zeberced (cevherin) den koltuklar, altından koltuklar ve gümüşten koltuklar konulur. Cennet halkının (makamca) en aşağı olanı (onların içinde den i - adi kimse yoktur) da misk ve kafur yığmları (yani tepecikler) üstünde otururlar. Bunlar koltuklarda oturanların yerlerinin kendilerinin oturdukları yerlerden üstün olduğunu sanmazlar (ki üzülmesinler). Ebu Hureyre demiş ki: Ben: Ya Resulallah! Biz (cennette) Rabbimizi görecek miyiz? dedim. O: Evet (göreceksiniz).Siz güneşi görmek ve (gök) ayı on dördüncü gecesinde (yani dolunay halinde iken) görmek hususunda şüpheye düşer misiniz? diye sordu. Biz: Hayır (şüpheye düşmeyiz, alenen görürüz), dedik. O : İşte böylece Rabbiniz (Azze ve Celle)'yi (Cennette) görmek hususunda da şüpheye düşmiyeceksiniz ve o mecliste bulunan herkesle Allah (Azze ve Celle) (ayrı ayrı) konuşacaktır. Hatta Allah sizden bir adama: Ya Fulan! Şöyle şöyle yaptığın günü hatırlamıyor musun? diyecek (dünyadaki bazı vefasızlıklarını —günahlarını— ona hatırlatacaktır) . Adam da: Ya Rabbil Beni bağışlamadın mı? diyecek. Bunun üzerine Allah : Evet, seni bağışladım. Sen şu mertebene ancak benim mağfiretimin bolluğuyla eriştin, buyuracaktır. İşte cennet halkı böyle (ce Allah'ın cemal ve sohbetiyle müşerref) oldukları sıralarda bir bulut parçası üstten onları kaplıyarak üzerlerine öyle güzel bir koku yağdıracak ki onun kokusu gibi güzel bir şeyi hiç duymamışlar. Sonra Allah (onlara): Sizin için hazırladığım ikram'a kalkıp gidiniz ve arzuladığınızı -canınızın çektiği şeyleri alınız, buyuracaktır. (Nebi s.a.v. buyurdu ki): Bunun üzerine meleklerin kuşattığı bir çarşıya varacağız. Misline gözlerin bakmadığı, kulakların işitmediği ve kalblerden geçmeyen şeyler o çarşıda bulunur. (Nebi s.a.v. buyurdu ki) : O çarşıda hiç bir şey satılmadığı ve satın alınmadığı (yani her şeyin bedava olduğu) halde arzuladığımız şeyler bizim için (köşklerimize) nakledilecektir. Cennet halkı birbirlerini o çarşıda göreceklerdir. Yüksek makam sahibi olan adam gelip kendisinden dun (yani makamca düşük) adama rastlar (Cennet halkı içinde deni - adî kimse yoktur). Makamca düşük olan adam, makamca kendisinden yüksek olan adamın üstündeki elbiseyi beğenir - hoşuna gider. Fakat henüz beğenme işi tamamlanmamış İken kendisinin üstündeki elbise gözünde ondan daha güzel hal alır. Bunun sebebi de cennette hiç bir kimsenin üzülmesine meydan verilmemesidir. Nebi s.a.v.buyurdu ki: Sonra (çarşıdan) konaklarımıza döneceğiz. Zevcelerimiz bizi karşılayarak: Merhaba, hoş geldin. And olsun ki biz'den ayrıldığın vakitteki güzellik ve güzel kokudan daha üstün bir güzellik ve daha güzel koku ile geldin, diyecekler. Biz de diyeceğiz ki: Bu gün biz Cebbar olan Rabbimiz (Azze ve Celle)'nin meclisinde oturduk ve şu gördüğünüz üstün güzellik ve daha güzel koku misli ile dönmemiz bize layıktır, diyeceğiz. Diğer tahric: Tirmizi Ebvabu Sıfati'l-Cenne\" bölümünde \"Cenet çarşısı'' adlı babında rivayet etmiştir. (az farklı) AÇIKLAMA 4337’de",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 237
			}
		}
	]
}