{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"37": "Zuhd"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 4339,
			"arabicnumber": 4339,
			"text": "Abdullah bin Mes'ud (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: Ben cehennemlik olanlardan en son cehennemden çıkan ve cennetlik olanlardan en son cennete giren adam'ı şüphesiz bilirim. (O kişi), cehennemden emekleyerek çıkan bir adamdır, (Allah tarafından) ona: Git de cennet'e gir, denilecek. Bunun üzerine adam cennete gidecek, fakat ona cennet dolu gibi görünecektir. Adam da geri dönerek : Ya Rabbi! Ben cennet'i dolu buldum, diyecek. Allah (da ona): Git cennet'e gir, diyecek. O da cennete varacak. Fakat ona cennet (yine) dolu görünecek ve tekrar geri dönecek. Sonra: Ya Rabbi! Ben cennet'i dolu buldum, diyecektir. Allah Sübhanehu (ona): Git cennet'e gir, buyuracak. O da (tekrar) cennet'e varacak ve (yine) ona cennet dolmuş gibi görünecek. Tekrar dönüp: Ya Rabbi! Cennet şüphesiz doludur, diyecektir. Bunun üzerine Allah (ona): Git de cennete gir. Çünkü şüphesiz (orada) dünya kadar ve dünyanın on misli sanadır, buyuracaktır. Adam da: (Ya Rabbi!) Yegane hükümdar olduğun halde benimle alay mı ediyorsun? diyecektir. Abdullah bin Mes'ud demiştir ki: (Vallahi) ben Resulullah (Sallallahu Aleyhi ve Sellem)'i (bu hadîsin sonunu buyururken) azı dişleri görülecek derecede gülerken gördüm, demiştir. (İbn-i Mes'ud sözüne devamla) Bu adam cennetliklerin mertebece en aşağı olanıdır, söyleniyordu. Diğer tahric: Bu hadisi Buhari \"Tevhid\" ve \"Rıkak\" bölümlerinde, Müslim \"İman\" bölümünde ve Tirmizi \"Cehennem sıfatı\" bölümünde rivayet etmişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 37,
				"hadith": 240
			}
		}
	]
}