{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 439,
			"arabicnumber": 439,
			"text": "(Abdullah) İbn-i Abbas (Radiyallahu anh)'den rivayet edildiğine göre şöyle söylemiştir: Resulullah (Sallallahu Aleyhi ve Sellem), (abdest alırken) kulaklarım mesnetti. Dahiline (=yüze bakan kısmına) şahadet parmaklarını ve zahirine (başa bakan kısmına) baş parmaklarını sürerek kulakların zahirini ve batınını mesnetti. AÇIKLAMA : Hadis, kulakların zahir ve batınını mesh etmenin meşruluğuna delalet eder ve meshin yapılış tarzını bildirir. Tirmizi'nin rivayetinde: İbn-i Abbas (r.a.). Resul-i Ekrem'in kulaklarının zahir ve batınını meshettiğini beyan eder. Tuhfe yazarı burada şu malumatı verir: Kulakların zahiri baş tarafına bakan kulakların dış kısmıdır. Batını ise yüze bakan cephesidir. El-Hafız,' Telhis'te anlattığına göre, İbn-i Hibban da İbn-i Abbas'ın hadisini kendi sahih'inde zikretmiş (O rivayette de burada olduğu gibi meshin yapılış şekli anlatılmıştır.' Ve İbn-i Huzeyme ile İbn-i Mendeh'in bunu sahih gördüklerini beyan etmiştir. El-Hafız bu arada Hadisin Nesai. İbn-i Maceh, El-Hakim ve El-Beyhaki tarafından rivayet edildiğini bildirmiştir. ''Miftahu'l-Hace yazarı da, yukarıda anılan zatlar tarafından Hadis'in rivayet edildiğini belirtirken, Hadis'in lafızlarının buradaki lafızlara yakın olduğunu da bildirir. Daha sonra şöyle der: 'Bu babta rivayet edilen hadisler, kulakların zahir ve batınını meshetmenin meşruluğuna delalet ederler. Ancak kulakların meshi için eller yeniden ıslatılacak mı? yoksa başın meshinden dolayı ellerde bulunan ıslaklıkla yetinilecek mi?' EL-MENHEL'DE BU KONUDAKI GÖRÜŞLER ŞÖYLE ANLATILIYOR Hanefi alimler: Kulakların meshi sünnettir. Başın meshinden dolayı ellerde ıslaklık kalmış ise yeniden eller ıslatılmadan kulaklar meshedilir. Aksi takdirde eller suyla ıslatılarak mesih işi yapılır, demişlerdir. Şafii alimler: Başın meshinden sonra kulakların zahir ve batınını yeni bir suyla meshetmek sünnettir. (Ve üç defa tekrarlanması sünnettir), demişlerdir. Hanefi alimlerin delili Ebu Davud'un ''Peygamber'in abdest sıfatı'' babında rivayet ettiği İbn-i Abbas'ın Hadisindeki şu parçadır: \"Ibn-i Abbas, - Peygamber'in abdestini tarif ederken - kollarını üçer defa yıkadıktan sonra su alarak başını ve kulaklarının zahirIerini ve batınlarını birer defa meshetti.' Şafii'lerin delili ise Beyhaki'nin rivayet eıtigi ve Senedinin sahih olduğunu söylediği AbduIIah bin Zeyd'in hadisinin şu parçasıdır: ResuluIlah - abdest alırken- başının meshi için aldığı sudan başka kulakları için su aldı.'' Malikiler'in cumhüru: Kulakların zahir ve batını meshetmek sünnettir, demişlerdir. Bunlardan İbn-i Mesleme ile El-Ebheri kulakların meshi farzdır, demişlerdir. Kulağın meshi için yeni su almak bazılarına göre sünnet olup bir kısım Maliki'lere göre müstahabtır. Hanbeli'ler ise: Kulakların zahir ve batınını meshetmek vacibtir. Kulağın meshi için yeni su almak da sünnettir, demişlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 173
			}
		}
	]
}