{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 46,
			"arabicnumber": 46,
			"text": "Abudullah İbni Mes'ud r.a.'den, Resulullah s.a.v.’in şöyle buyurduğu mervidir; -Kitap ve sünnetten başka uyulması gerekli üç’üncü bir şey yoktur. Sözlerin en güzeli Allah Teala’nın kelamı ve yolların en güzeli Muhammed s.a.v.’in yolu, siretidir. Dikkat! (sonradan) dinde ihdas edilmek istenen şeylerden sakının. Çünkü şer işlerden biriside ihdas edilen şeylerdir. (Dinde) icad edilen her şey bid'attır. Bid'atlar dalalettir. Dikkat! emel ve arzularınız uzayıp size ecelinizi unutturmasın. Aksi takdirde kalpleriniz katılaşır. Dikkat! Gerçekten gelici olan (ölüm ve ondan sonraki diriliş ve ahiret ahvali gibi) şey(ler) yakındır. Hakikaten gelmiyecek- olmayacak olan şey, uzak sayılır. Dikkat! Şakavetli (bedbaht), ancak o kimsedir ki annesinin karnında iken şaki olur, mes'ud adam da ancak o kimsedir ki başkasından ibret alır. Dikkat! Mu'minle döğüşmek küfür ehlinin ve ona sövmek fasıkların işidir. Müslüman için üç günden fazla süre ile (din) kardeşini bırakması (ona küs durması) helal değildir. Dikkat! Yalancılıktan şiddetle kaçının. Çünkü ne ciddi ne de şaka yollu yalancılık mübah değil, müslümanın şanına yakışmaz. Sakın kimse, yerine getirmiyeceği bir şeyi (küçük yaştaki) çocuğuna (bile) vaad etmesin. Çünkü yalancılık gerçekten fücura (şerre) sürükler. Şer de cehenneme götürür. Doğrulukta muhakkak (insanı) birr’e yöneltir. Birr de cennete götürür. Doğru adam için “O doğrudur doğru söyledi birr’i (islamın hayır saydığı şeyleri) işledi” denir. Yalancı kişi için de “O, yalan söyledi şer işledi” denir. Dikkat! Kul gerçekten yalan söyleye söyleye bu hali kendisine şiar edinir. Nihayet yalancılığı itiyad haline getiren bu idmanlı yalancı, Allah Teala’nın divanında <Kezzab> olarak yazılır.”",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 46
			}
		}
	]
}