{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 505,
			"arabicnumber": 505,
			"text": "Mikdad bin El-Esved (r.a.')den rivayet edildiğine göre kendisi Resulullah (Sallallahu aleyhi ve sellem)'e şunu sormuştur: Adam, hanımına yaklaşır (yani, cinsi münasebet yapmadan oynaşır) ve bunun neticesinde meni çıkmaz (sadece mezi çıkarsa) kişinin ne yapması gerekir? Resulullah (Sallallahu aleyhi ve sellem) şöyle cevap buyurdu: «Biriniz meziyi bulduğu zaman tenasül uzvuna su serpsin. (Ravi dedi ki, yani tenasül uzvunu yıkasın) ve abdest alsın.» Diğer tahric:; Malik, Nesai, Tirmizi, Ebu Davud , Tahavi ve Beyhaki uzun ve kısa metinler halinde. AÇIKLAMA : Ebu Davud'un rivayet ettiği metin mealen şöyledir: «Mikdad bin EI-Esved (r.a.)'den rivayet edildiğine göre Ali bin Ebi Talib r.a. kendisinin Resulullah s.a.v.'e: Adam, hanımına yaklaştığı ve kendisinden mezi çıktığı zamaı} ne yapması gerekir ... sorusunu sormasını istedi ve : Resulullah s.a.v.'in kızı benim yanımdadır. Ben, bu soruyu O'na sormaktan haya ederim, dedi. Mikdad dedi ki: Bunun üzerine Ben Resulullah s.a.v.'e sordum. Şöyle cevap buyurdular: «Biriniz mezi bulduğu zaman, tenasül uzvuna su serpsin (yıkasın) ve namaz için olan normal abdestini alsın.\" BU HADİSTEN ÇIKARILAN FIKHİ HÜKÜMLER : 1)- Kişi, ailesinin yakınlarına karşı edepli davranmalıdır ve utanç verici sözleri onların huzurunda sarfetmemelidir. 2)- Kişi, hanımının akrabaları huzurunda şehvetle ilgili bir şey anlatmamalıdır. 3)- Mezi, abdest almayı gerektirir, Gusül gerektirmez. 4)- Fetvayı başkasının aracılığıyla sormak caizdir. 5)- Kişi, Din ile ilgili hükümleri sormalıdır. 6)- Kendisine soru sorulan zat, bildiği cevabı esirgememelidix:",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 239
			}
		}
	]
}