{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 513,
			"arabicnumber": 513,
			"text": "Abbad bin Temim'in amcası (Abdullah bin Zeyd bin asim) r.a.)'den rivayet edildiğine göre şöyle demiştir: Namazda iken abdesti bozuldu diye şüphelenen kişinin durumu Nebi (Sallallahu aleyhi ve sellem)'e arzedildi. (= Namazın bozulup bozulmadığı soruldu.) Bunun üzerine Nebi (Sallallahu aleyhi ve sellem) buyurdular ki : «Böyle bir kimse koku duymadıkça veya ses işitmedikçe namazdan çıkmasın.» Diğer tahric: Buhari, Müslim. Ebu Davud, Nesai ve Beyhaki AÇIKLAMA : Buhari ve Müsliın'de Peygamber s.a.v.'e adamın durumu arz eden zatın Abbad bin Temim'ın amcası olan Abdullah bin Zeyd bin Asım olduğu belirtilmiştir. Abdillah bin Zeyd'den bu hadisi Abbad bin Temim'in rivayet ettiği sabittir. Ancak Said bin El-Müseyyeb'in de Abdullah'tan rivayet edip etmediği kesinlikle bilinmemektedir. Hafız El-Fetih'te şöyle der: «Abbad» kelimesi, ''Said\" kelimesine atfedilmiştir. Said bin Abdullah'tan hadisi rivayet etmesi muhtemeldir. Bu takdirde hem Said. hem Abbad, Abdullah'tan rivayet etmiş olurlar. İkinci bir ihtimal: AbduIIah'tan yalnız yeğeni olan Abbad rivayet etmiş olup, Said'in şeyhi ise mahfuzdur. (Senedde alınmamıştır.) Bu takdirde sened, Said bakımından mürseldir. EI-Etraf müellifi. birinci ihtimali benimsemiştir. 514 nolu senedde Said bin El-Müseyyeb'in şeyhi olarak Ebu Said-i Hudri'nin gösterilmiş olması ikinci ihtimali te'yid eder. Hadisin manasına gelince: Namaza duran kişi, namaz esnasında yellendi diye bir şüphe duyarsa namazını kesecek mi, yoksa bu şüpheye itibar etmeyerek namaza devam edecek mi? Sahabilerden AbduIIah bin Zeyd bin Asım bu durumu ve buna ait şer'i hükmü Peygamber'e sormak istemiş ve O'ndan şu cevabı almıştır: Hayır. Namazdan çıkmasın. Ancak, yellendiğini kesinlikle bildiği takdirde abdesti bozulmuş olur. Dolayısıyla namazdan çıkmış olur. Yellendiğini kesinlikle bilmesi; bir koku duyması veya ses işitmesiyle mümkündür. Yellendiğinin kesinlik kazanması için koku duymak veya ses işitmek şart değildir. Çünkü kişi, sağır olabilir veya koklama duygusu bozuk olabilir. Hadiste koku duyulması veya ses işitilmesi tabiri. çoğunluk itibarı iledir. Hattabi: 'Resul-i Ekrem (s.a.v.), hadiste ses işitmeyi ve koku duymayı zikretmekle abdestin ancak bunlarla bozulabileceğini namaz esnasında abdestin başka türlü bozulmıyacağını kasdetmemiştir. Soruya uygun olsun diye cevapta bu ifade tarzı tercih edilmiştir. Ön ve arkadan çıkan her şey. yel hükmündedir. Bazen yel çıkar ama ne ses duyulur, ne de koku. Buna rağmen durum kesinlikle bilindiği takdirde abdest bozulmuş olur. Bazen kişi sağır olur ses işitmez. Bazen burnu tıkalı olur koku işitmez ...'' demiştir. Ebu Davud'un abdest bahsinde rivayet ettiği bu hadisin serhinde EI-Menhel yazarı özetle şöyle der: \"Bu hadis, İslam dininin temellerinden ve fıkıh kaidelerinden biridir. Bu kaide şudur ki: «Sabit olan her şeyin devamı asıldır. Aksi sabit olmadıkça o şeyin devamlılığına hükmedilir.» Beliren şüpheler, etki yapamaz. Bu kaideye «İstisbah» derler. Hadiste söz konusu olan mes'ele, bu genel kaidenin kapsamına giren yüzlerce mes'eleden biridir. Şöyle ki; Abdest aldığını kesinlikle bilen kişi, abdestinin bozulduğundan şüphe ederse, abdestinin devamlılığına hükmedilir. Şüphenin namaz içinde veya dışında olması arasında bir fark yoktur. Selef ve haleften olan alimlerin cumhür'unun görüşü budur. Maliki'lerden (İbn-i Nafi' de bu görüşe katılmıştır. Onların delili bu babtaki hadislerdir. Onlara göre hadiste söz konusu edilen şüphe, namaz içinde vuku bulan şüphe türünden ise de, şüphenin namaza bağlanması sorudan doğmadır. Yani soru namaz içindeki şüpheyle ilgili olduğu için, ona uygun olsun diye cevapta namazdan bahsedilmiştir. Maliki'lerin Cumhüruna göre kişi, namaza başlamadan önce abdestinden şüphelenirse, abdesti bozulmuş sayılır. Dolayısıyla abdest almadan namaza duramaz. Şayet kişi, namaza başladıktan sonra şüphelenirse, abdestinin bozulduğunu kesinlikle bilmedikçe namazına devam eder. Namazdan çıktıktan sonra şüphesi zail olursa ona. bir şey yapmak gerekmez. Eğer, namazdan çıktıktan sonra da.şüphesi devam ederse veya abdestinin kesinlikle bozulduğunu hatırlarsa yeniden abdest alır ve kıldığı namazı iyade eder. Maliki'lerin meşhur kavli budur. Onlar hadisin zahirine dayanmışlardır. Yukarıda belirtildiği gibi kesinlikle bilinen bu hususa ait hükmün şüpheyle değişmiyeceğine dair olup, mezkur hadisten alınan genel kaidenin kapsamına giren mes'elelerin bir kısmını Nevevi şöyle anlatmıştır: Aslında tahir olan su, süt, bal, yağ, elbise gibi bir maddenin necis olduğunda tereddüt eden kişi, bu şüpheye itibar etmemeli ve aslında tahir olan o maddenin taharetine hükmetmelidir. Kendisinde beliren şüphe ve necaset ihtimali % 50'den aşağı veya % 50'den yukarı olması neticeyi değiştirmez. Keza boşamada, köleyi azad etmekte veya eşinin aybaşı adetinde tereddüt eden kişi, bu şüphelere iltifat etmeyerek nikahın, kölesinin kölelik halinin ve eşinin temizlik durumunun devamına hükmederek, buna göre hareket eder ve hareketinden dolayı mes'ul değildir. Kişinin söz konusu zannı belli bir sebebe dayanmadıkça hüküm budur. Ama muayyen bir sebebe dayanırsa, mesela necaseti kullanmayı ibadet telakki edenlerin elbisesi, mezbahalarda hayvanları boğazlayanların elbiseleri ve şarap imal edip, buna düşkün olanların giyecekleri hususunda ayrı hükümler vardır. Bazı alimler, zahirle amel ederek bu elbiselerin necis olduklarına hükmetmişlerdir. Bir kısım alimler de, elbiselerin aslında temiz olmalarını dikkate alarak taharetIiklerine hükmetmişlerdir. İkinci görüş daha kuvvetlidir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 247
			}
		}
	]
}