{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 536,
			"arabicnumber": 536,
			"text": "Amr bin Meymun (r.a.)'den rivayet edildiğine göre şöyle söylemiştir : Meni'nin isabet ettiği elbisenin hepsini mi, yoksa meninin dokunduğu yerleri mi yıkayacağımızı Süleyman bin Yesar (r.a.)'e sordum. Süleyman (r.a.) şöyle cevap verdi: Aişe (r.a.a) şöyle söyledi: «Nebi (Sallallahu aleyhi ve sellem)'in elbisesine meni isabet ederdi. Elbisesinden meniyi yıkardı. Sonra o elbise ile namaza çıkardı. Ben de elbisede yıkama eserini o esnada gördüm.» AÇIKLAMA : Kütüb-i Sitte sahiplerinin hepsi bu hadisi rivayet etmişlerdir. Buhari'nin bir rivayetinde ve Müslim'de Süleyman bin Yesar: ''Ben Aişe'ye sordum'' tabiri bulunur. Ebu Davud'un rivayetinde ise Süleyman bin Yesar diyor ki: 'Ben, Aişe'den işittiğini ispatlar ve Bezzar ile Ahmed'i : 'Süleyman bin Yesar; Aişe'den işitmedi, sözünü reddeder. Şafii de EI-Ümm'de başkasından Bezzar ve Ahmed'in sözüne benzer bir şey rivayet etmiştir.' Hadiisn manasına gelince: Buradaki rivayetin zahirine göre Aişe (r.anha) Resul-i Ekrem s.a.v.'in meniyi yıkadığını söylemiştir. Müslim'deki ifade de böyledir, Fakat Buhari ve Ebu Davud'un rivayetinde Hz, Aişe'nin, Peygamber s.a.v.'in elbisedeki meniyi yıkadıgı tashih edilmiştir. Sindi diyor ki : 'Peygamber s.a.v.'in meniyi yıkadıgına dair ifadeden murad, yıkanmasını emretmesi olabilir.' Meninin necasetine hükmeden alimler, bu hadisi delil göstermişlerdir, Çünkü burada ''Meniyi yıkardı.'' tabiri bu işin bir defa degil devamlı sürette yapıldığını gösterir, El-Menhel yazarı bu malumatı verir: ''Ebu Davud'un şerhinde Hattabi'nin şöyle dediği anlatılır: 'Meninin yıkanmasına dair bu hadis elbisedeki meninin ovalanmasıyla yetinildigine dair hadis'e muhalif değildir. Çünkü meniyi yıkamak, temizlik bakımından müstahabtır. Nasıl ki; Balğam ve sümkürüğün dokunduğu elbise de yıkanır. İki hadisin kullanılması mümkün olduğu zaman çelişki arzedecek şekilde yorumlanması caiz değildir,'' Şarih bu naklinden sonra şöyle der: 'Ben derim ki; yıkama ve ovalamaya ait iki hadis arasında bir muhalefet veya çelişkinin bulunduğunu hiç kimse iddia etmemiştir. Bu hadis, meninin necis olduğuna delalet eder. Çünkü yıkanmıştır. Kurumuş meninin de ıslak meniye kıyaslanması gerekirdi. fakat ovalama hadisi ile kuru meni ayrı hüküm almış olur. Biz meniyi yıkamayı sümkürük ve balğamı yıkamaya benzetemeyiz. Çünkü Darekutni, Sünen'inde şöyle bir hadis rivayet etmiştir: \"Ya Ammar! Senin balğamın ve göz yaşların ancak senin kovandaki su durumundadır. Elbise, ancak beş şeyden yıkanır: Bevl. gaita (büyük idrar), meni, kan ve kusmuktur.'' Görüldüğü gibi hadiste meni, gaita ve dem (kan) arasında zikredilir. Eger dense ki: Darekutni: 'Bu hadisi Sabit bin Hammad'dan başkası rivayet etmemiş o da cidden zayıftır' demiştir. Ben derim ki Bezzar, Sabit bin Hammad'ın sika oldugunu söylemiştir. Eğer dense ki; Beyhaki: Ammar'ın hadisi bitıldır. Aslı yoktur. Çünkü onu Sabit bin Hammad, Ali bin Zeyd'den. o da İbn-i Müseyyeb'den o da Ammar'dan rivayet etmiştir. Ali bin Zeyd ile ihticac edilemez, demiştir. Ben derim ki: Ebu Davud, Tirmizi ve Nesai, Ali bin Zeyd'in hadisini rivayet etmişlerdir. İbn-i Main de Ali bin Zeyd'i savunmuştur. El-İcli de: 'Onun rivayetlerinde beis yoktur' demiştir. Hakim eI-Müstedrek'inde O'nun rivayetini almıştır. Tirmizi de: Ali bin Zeyd sadıktır' demiştir.'' HADİSİN FIKIH YÖNÜ : 1. Hadis, meninin necis olduğuna delalet eder. Bu konuda alimler arasındaki ihtilafı, bundan sonraki babta inşaaIlah anlatacağım. 2. Kadının, kocasının elbisesini yıkamak gibi hizmetler yapması caizdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 270
			}
		}
	]
}