{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 558,
			"arabicnumber": 558,
			"text": "Ukbe bin amir el-Cüheni (r.a.)'den rivayet edildiğine göre: Kendisi, Mısır'dan Ömer bin El-Hattab (r.a.)'in yanına gelmiştir. Hz. Ömer (r.a.) Ona: Kaç günden beri sen mestlerini çıkarmamışsın, diye sormuş ? Kendisi: Cuma'dan cuma'ya kadar, diye cevaplamış, Hz. Ömer de: Sünnet'e isabet etmişsin, demiştir. AÇIKLAMA : Birinci hadis, mestler üzerine meshetmenin belirli bir süreye bağlı olmadığına delalet eder. Ancak notta işaret edildiği gibi hadis Alimlerinin ittifakıyla zayıf görülmüştür. Bu hadisi Beyhaki , Hakim ve Tahavi de rivayet etmişlerdir. Ebu Davud da iki senedle rivayet etmiş ve isnadında ihtilaf bulunup, kuvvetli olmadığını belirtmiştir. Sindi, Hadis'in zayıf olduğunu belirttikten sonra şöyle bir yorum yapıldığını ifade eder: \"Sahih hadislerle sabit olan meshetme süresi şartına riayet etmek halinde uzun zaman mestler üzerine mesh yapılabileceği kasdedilmiş olabilir.'' İkinci hadise gelince; Hz. Ömer r.a.'in Ukbe'ye söylediği: 'Sen sünnete isabet ettin' sözünde, bu işin Resul-i Ekrem (s.a.v.)'in sünnetine uygunluğuna dair bir delil yoktur. Çünkü sünnet, bazen Resul-i Ekrem (s.a.v.) tarafından olduğu gibi dört halife'ye ait de olabilir. Nitekim bir hadis de : ''Benim sünnetime ve Hulafa-i Raşidin sünnetine sarılınız'' buyurulmuştur. Hulafa-i Raşidin'den olan Hz. Ömer r.a.'in Ukbe'ye dediği görüşü benimsemiş olabilir. Ve kendi görüşüne sünnet adını vermiş olabilir.' Sindi der ki: 'Bir sahabi yapılan bir işin isabetli oldugunu söylediği zaman, meşhur kavle göre bu söz merfu' hadis yerine geçer. Durum böyle olunca. hadis, mesh'in süresizliğine delalet eder. Fakat şöyle denilebilir: Sahabinin böyle bir tabiri merfu' hadis gibi olsa bile serahaten merfu' olan hadis kuvvetini taşımaz. Dolayısıyla sarahaten merfu' olan hadis buna tercih edilir. Soru ve cevabın meshetme müddetine ait şartına riayet etmekle beraber, uzun süre mestlerin giyilmesi ve üzerine mesh yapılması hakkında cereyan etmiş olması muhtemeldir.\" EI-Menhel yazarı bu hadisle ilgili olarak şöyle der: ''Hz. Ömer r.a.'den yapılan bu rivayete karşı meshin muayyen süre ile sınırlı olduğuna dair, müteaddit hadisler kendisinden rivayet edilmiştir. Bu cümleden olarak: Süveyd b. Cafie'den rivayet edildiğine göre şöyle demiştir: Hz. Ömer r.a. ile rahatça konuşmaya cesaretli olan Benane El-Ca'fiye: 'Mestler üzerine meshetmek durumunu Hz. Ömer r.a.'e sor,\" dedik. Kendisi de sordu, Hz. Ömer r.a.: ''Misafir için üç gün ve mukim için bir gün bir gece meslıetmek caizdir.'' dedi. Zeyd bin Veheb'den de rivayet edildiğine göre şöyle söylemiştir: Mest1er üzerine meshetmek hakkında Hz. Ömer r.a., bize mektup yazarak misafirin uç gün mukim'in bir gün bir gece meshedebileceğini bildirmiştir, dedi. Tahavi şerhi Meani'l-Asar kitabında bu iki eseri rivayet ederek: İşte Ömer r.a., meshin belirli bir süreyle kayıtlı olduğuna dair Resul-i Ekrem s.a.v.'den rivayet olunan sahih hadislere muvafık olarak söylenmiştir, der.'' Bu konu hakkında bir önceki babta geniş malumat verilmiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 292
			}
		}
	]
}