{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 559,
			"arabicnumber": 559,
			"text": "El-Muğire bin Şu'be (radiyallahu anh)'den rivayet edildiğine göre : Resulullah (Sallallahu aleyhi ve sellem) abdest alırken çorapları ve pabuçları üzerine meshetmiştir.\" Not: Ebu Davud : Abdurrahman bin Mehdi, bu hadisi anlatmazdı. Çünkü El-Muğire'den ma'ruf olan rivayet Nebi (s.a.v.)'in mestler üzerine meshetmesidir, demiştir. El-Hafız da: Abdurrahman bin Mehdi ve başka hadis imamları El-Muğire\"nin bu hadisini zayıf saymışlardır, demiştir. Diğer Tahric: Tahavi, Tirmizi, ve Ebu Davud AÇIKLAMA : Tirmizi; hadisin hasen-sahih olduğunu söylemiştir. fakat Ebu Davud notta belirtildiği gibi hadisi zayıf görmüş ve Peygamber (s.a.v.)'in mestler üzerine meshettiğine dair Muğire r.a.'nin rivayeti ma'ruf olduğu için; Abdurrahman bin Mehdi'nin bu hadisi rivayet etmediğini söylemiştir. EI-Menhel yazarı: ''Fıkıhçılar ile hadisçilerin bir kısmı bu hadisi zayıf görmüştür, der. Daha sonra Abdurrahman bin Mehdi'nin söz konusu hadisi rivayet etmemek için gösterilen gerekçenin şu şekilde reddedildiğini nakleder: Peygamber (s.a.v.)'in mestler üzerine mesh ettiğine dair El-Muğire r.a.'in rivayeti bu rivayete muhalif değildir. Çünkü El-Muğire r.a.'in Peygamber (s.a.v.)'in mestler üzerine meshettiğini görünce, bunu rivayet etmesi; başka bir zaman da çoraplar üzerine meshettiğini gördükten sonra bu hali de rivayet etmiş olması muhtemeldir. Beyhaki Çoraplar üzerine mesh'e ait El-Muğire'nin hadisi münkerdir. Süfyan-i Sevri, Abdurrahman bin Mehdi, Ahmed bin Hanbel, Yahya bin Main, Ali bin El-Medeni ve Müslim bin El-Haccac, bunu zayıf görmüşlerdir, demiştir.'' HADİSİN MANASI: Çorap diye terceme ettiğimiz kelime başlıkta ve hadiste 'Cevreb' olarak geçer. Bu kelime ile ilgili olarak EI-Menhel'de şu malümat vardır: ''Cevreb, pamuk veya keten yahut yünden mest şeklinde imal edilir. EI-Lisan yazarı; Ccvreb, ayak sargısıdır, demiştir. Dehlevi de: Cevreb, mesti kir ve ıslaklıktan muhafaza etmek ve soğuktan korunmak için mest üzerine giyilen ve topukları kapatan bir mest çeşididir, demiştir. El-Ayni de: İklimi soğuk olan Şam dolaylarındaki halkın soğuktan korunmak için bükülmüş yüri ipliğinden imal edilen ve topukların yukarısına kadar ayağa giyilen bir giyecektir, demiştir.'' Hadisin: ''Çorapları ve pabuçları üzerine meshetmiştir.'' ifadesinin manası ile ilgili olarak EI-Menhel yazarı şöyle der: ''Yani pabuçları ve çorapları meshetmiştir. Çorapıarın meshi esastır. Ayaklann yıkanmasına bedel olan mesh işi budur. Pabuçlar üzerine, fazilet için meshetmiştir. Pabuç; lügatta ve arapların örfünde; mestten ayrı bir şeydir. İbnü'l-Arabi: (Pabuç olarak tarif ettiğimiz) ''Na'l'' , Peygamberlerin libasıdır. Halkın tıkalarındaki çamur nedeniyle başka ayakkabılar imal etmiştir. Peygamber (s.a.v.)'in na'lında kıl yoktu. Iki adet sınmı vardı. Katade' den rivayet c edildiğine göre kendisi Enes bin Malik'e Peygamber (s.a.v.) 'in na'lının şeklini sormuş. Enes de: İki sınmlı idi, demiştir. İbnü'l-Cevzi: Resul-i Ekrem (s.a.v.)'in Na'lininin iki sınmı vardı. Bir sının ayağın büyük parmağı ile yanındaki parmak arasından, diğeri de orta parmak ile küçük parmağın yanındaki parmak arasından geçirilerek ayak üzerinde bulunan üçüncü sınmla birleştirildi. Şemail-i Tirmizi'nin şerhinde böyle anlatılmıştır, der. Hadis, pabuçlar giyilmiş iken, çoraplar üzerine meshetmenin meşruluğuna delalet eder. Fakat, yalnız patuçların üzerine meshetmenin caizliğine delalet etmez. İbnü'l-Kayyim, Tehzibu's-Sünen'de: Beyhaki demiş ki: Ebu'l-Velid, çorapların meshine ait hadisi şöyle yorumIamıştır: Yani altına deri geçirilmiş olan çoraba meshetmiş. Çoraba ve pabuca ayrı ayrı meshetmemiştir. 'Bence zahir şudur ki: Müstakil pabuçlar altında giyilmiş olan çoraplara meshetmiştir. Metindeki ifade tarzı buna delalet eder. Çorabın altına geçirilmiş olan deriye arapların lügatında \"Na'l\" denmez .. .' Alimler çoraplar üzerine meshetme hususunda ihtilaf etmişlerdir. Hanefi alimleri Ahmed bin Hanbel İshak. bin Rahuye, Sevri ve İbnü'l-Mübarek: Buna meshetmek caizdir, demişlerdir. Çoraplar mücelled yani, her tarafına deri çekilmiş olabilir. Münaal, yani yalnız altına deri çekilmiş olabilir. Sahin yani ayakta durabilen, kalın ve su geçirmiyecek şekilde sık dokunmuş olabilir. Dayanıklığı bakımından mezhebIere göre ayrı bir takım şartlar vardır. (Mesela Hanefi alimlerine göre koşulan şartlardan birisi; üzerinde üç mil kadar yürümeye dayanıklı olmasıdır.) Maliki alimleri: Çoraplar üzerine meshedebilmek için üstüne ve altına deri çekilmiş olması şarttır, demişlerdir. Ebu Hanife sahin olan çoraplar üzerinde meshetmeyi caiz görmezdi. Fakat vefatından üç gün ve bir rivayete göre bir hafta önce hastalığında sahin çorapları üzerine meshederek: Ben halka yasaklamış olduğum şeyi yaptım, demiştir. Şafii alimlerine göre ard-arda üzerinde yürümeye dayanıklı olup, su geçirmeyen mest ve benzeri giyecek üzerine mesh yapılabilir. Her tarafına veya bir kısmına deri cekilmiş olsun olmasın farketmez. Mühim olan, onun sağlamlığı, dayanıklığı ve su geçirmezliğidir.'' Yukarıda belirtilen bütün mezhebIere göre topuklarla beraber ayakları örten giyeceğin dayanıklı olması şart koşulduğu için hadiste geçen cevreb (çorab) ile bildiğimiz ve kullanmakta oldUğumuz yün ve benzeri çoraplar kasdedilmemiştir. Çünkü pabuçsuz olarak üç mil yürümeye bu nevi çorapIarın dayanmadığı veya su geçirdiği bilinmektedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 293
			}
		}
	]
}