{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 560,
			"arabicnumber": 560,
			"text": "Ebu Musa El-Eş'ari (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu aleyhi ve sellem) abdest aldı da çoraplarına ve pabuçlarına meshetti. El-Mualla, kendi rivayetinde dediki: Ben Ebu Musa'nın «... ve pabuçlarına...» dediğini bilirim, başka türlü dediğini bilmem.\" Not: Ebu Davud: Sened muttasıl değildir, dedi. Dahhak'dan ravi İsa bin Sinan'dır. Ahmed, İbn-i Main, Ebu Zur'a, Nesai ve başkaları onu zayıf saymışlardır. Bu sebeple hadis kuvvetli değildir. AÇIKLAMA : Hadis, Beyhaki ve Tahavi tarafından da rivayet edilmiştir. Senedin sonundaki ravi El-Mualla'nın hadis metninin sonunda: 'Ben Ebu Musa El-Eş'ari' nin ancak ''va pabuçlarına .. '' dediğini bilirim.' sözünden maksadı hadisi böyle te'vil edenleri redetmektir. Şöyle ki : Bazı alimler; \" ... Çoraplar ve pabuçları üzerine ... '' ifadesini; '' ...Altına deri geçirilmiş olan çoraplar üzerine ... '' diye te'vil etmişlerdir. Hadisin lafzı bu te'vilden uzaktır. Notta işaret edildiği gibi Ebu Davud hadis senedinin muttasıl olmadığını söylemiştir. EI-Menhel yazarı der ki: 'Çünkü ravi Dahhak bin Abdirrahman'ın Ebu Musa'dan hadis işittiği sabit değildir. Muttasıl hadis senedi her hangi bir ravinin düşmesinden salim olana denir. Yine notta işaret edildiği gibi hadis kuvvetli değildir. Çünkü senedinde bulunan İsa bin Sinan'ın zayıf olduğu Ahmed, İbn-i Main, Ebu Zur'a ve Nesai tarafından ifade edilmiştir. Ebu Hatim : İsa kuvvetli değildir:, demiştir. Beyhaki de; İsa ile ihticac edilmez, demiştir. EI-Menhel yazarı; Yahya bin Main'in İsa'yı sika kabul ettiğini, El-İcli'nin de: İsa zararsızdır, dediğini nakleder. Ebu Davud: 'Ali bin Ebi Talib, İbn-i Mes'ud, Bera' bin Azib, Enes bin Malik, Ebu Ümame, Sehl bin Sa'd ve Amr. bin Hureys (r.a.) çoraplar üzerine meshettikleri ve Ömer bin El-Hattab ile İbn-i Abbas (r.a.)'ın böyle yaptıkları rivayet edilmiştir, der. EI-Menhel yazarı: Konu hakkında geniş nakiller ve bu sahabilere ait eserleri kaydettikten sonra şöyle der: Yukarıdan beri verilen ma'lümattan şu netice alınıyor: Ebu Davud çorap üzerine meshetmenin 9 sahabiden rivayet edildiğini beyan eder. Ahmed bin Hanbel çorap üzerine meshetmeyi caiz görmüştür. Onun dayanağı anılan sahabiler ve açık kıyastır. Çünkü çoraplar ile mestler arasında hükmü değiştirecek kuvvetli bir fark yoktur. Bu görüş, İshak, İbnü'l-Mübarek, Sevri, Said bin Cübeyr, Said bin El-Müseyyeb, İbrahim En-Nehai, Hasan-i Basri ve başkalarından rivayet edilmiştir. Üzerine mesh edilecek çorabın su geçirmemesi, ayakkabısız olarak mesela 3. MİL kadarüzerinde yürümeye dayanıklı ve kalın olması alimlerce şart koşulduğu dikkatten uzak tutulmamalıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 294
			}
		}
	]
}