{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 572,
			"arabicnumber": 572,
			"text": "Ata' bin Ebi Rebah (r.a.)'den rivayet edildiğine göre: Ben İbn-i Abbas (r.a.)'dan şu haberi duydum, demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) hayatta iken bir adam başından yaralanmış sonra ihtilam olup ona gusül yapması gerekir denmiş, kendisi de yıkanarak soğuk algınlığı neticesinde ölmüştür. Olay, Nebi (Sallallahu Aleyhi ve Sellem)'e ulaşmış, bunun üzerine O : «Onu öldürmüşler. Allah onları öldürsün. Cehaletin şifası sormak değil miydi?» buyurmuştur.» Ata': Ve Resulullah (Sallallahu Aleyhi ve Sellem)'in: «Vücudunu yıkayıp, başının yaralı yerini terketmiş olsaydı.» buyurduğu bize ulaşmıştır.» Not: İsnadının münkati' olduğu Zevaid'de bildirilmiştir, AÇIKLAMA : Evzai de bu hadisi Ata' aracılığıyla İbn-i Abbas (r.a.)'tan rivayet etmiş olup, doğrusu da budur. Beyhaki. müteaddit tariklerden rivayet ederek, zayıf olduğunu söylemiştir. Ebu Davud ve Darekutni ise hadisi Ata' aracılığıyla Cabir bin Abdillah El-Ensari'den rivayet etmişler, İbnü's-Seken de bunu sahih görmüştür. Ancak bu senedde Ata'dan münferiden rivayet eden Zübeyr bin Harik adlı ravinin kuvvetli olmadığını Darekutni söylemiştir. Hulalsa sargılar ve cebireler üzerine meshetmek hususunda Resul-i Ekrem (s.a.v.)'den bir şey sabit olmamıştır. Lakin Abdullah İbn-i Ömer (r.anh)'in bütün meshi yaptığı sabittir. HADİSİN MANASINA GELİNCE : Başından yaralı adam, ihtilam olunca, yarayı ıslatmaktan korkmuş, bu nedenle boy abdestini almamak için bir çarenin bulunup bulunmadığını yanındakilere sorarak; su bulunmasına rağmen mazeretim dolayısıyla teyemmüm yapabilir miyim? demek istemiş. Yanındakiler de: Biz, senin için bir ruhsat olduğunu bilmiyoruz, demişlerdir. Çünkü onlar, su bulunmadığı zaman teyemmüm yapılabilir. su varken teyemmüm yapılamaz, itikadında idiler. Hadiste geçen: \"Allah onları öldürsün.'' parçası, bilmeden fetva vermekten ve müslümanlara zarar vermekten kaçındırmak için buyurulmuş olan önleyici bir tehdit mahiyetindedir. Yoksa onların öldürülmesini dilemeK değildır. Hadis, yanlış fetva verme neticesinde doğan zarar ölüm dahi olsa kısas yolu ile fetva verenin öldürülmeyeceğine delalet eder. \"Cehaletin şifası sormak değil midir?'' parçası ile öğrenmek ve bilenlere baş vurmak isteniyor. Resul-i Ekrem (s.a.v.), kesin bilgi olmadan fetva verdiklerinden dolayı onları kınamış ve dinde güçlük olmadığına dair İslami prensibi düşünmeme kusurunu işlediklerinden dolayı onlara beddua etmiştir. Ebu Davud'un rivayetinde Resul-i Ekrem (s.a.v.)'e ait hadis metninde kişinin yapması gerekli olan iş şöyle buyuruluyor: \"Onun teyemmüm etmesi, yarasına bir bez sarması, sonra bezin üstünü meshedip vücudunun kalan kısmmı y!kaması kafi idi.'' Hattabi bu rivayetle ilgili olarak: 'Burada yaralının sağlam vücudunu yıkaması ve teyemmüm etmesi emrediliyor. Yalnız yıkanma veya yalnız teyemmüm kafi görülmüyor. Rey ehline göre kişinin uzuvlarının azı yaralı ise hem yıkanır hem teyemmüm eder. Şayet yaralı' uzuvlar çoğunlukta ise sağlam yerleri yıkamaya gerek yok. Teyemmüm kafidir. Şafii mezhebine göre sağlam kısım çok olsun az olsun yıkanmalıdır.' der. EI-Menhel yazarı şöyle der: \"Hasılı su kullanmayı tehlikeli gören kişi, alimlerin ittifakıyla teyemmüm edebilir. Şayet hastalığının artmasından veya iyileşmesinin gecikmesinden endişelenirse Ebu Hanife ve Malik'e göre teyemmüm etmesi caizdir. Bu haliyle kıldığı namazı bilahere iade etmez. Şafii mezhebinin racih kavli de budur. Her hangj bir uzvunda yara, kırıklık gibi bir şey olup, üzerine cebire çekilmiş ve açılması tehlikeli görülüyorsa Şafii'ye göre; cebire üzerine mesh yapılarak teyemmüm yapılır ve eğer cebireyi abdestli iken koymuşsa, bilahere namazı iade etmez. Ebu Hanife ve Malik'e göre vücudunun bir kısım yaralı olan kişinin bedeninin çoğu sağlam ise orayı. yıkar. Yaraya da mesheder. Şayet çoğu yaralı ise teyemmüm eder. Sağlam yeri yıkaması gerekmez. Ahmed bin Hanbei ise: Kişi sağlam yeri yıkar, yaralı yer için teyemmüm eder, demiştir ..• BU HADİS’İN EBU DAVUD RİVAYETLERİ: 336 – 337",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 306
			}
		}
	]
}