{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 579,
			"arabicnumber": 579,
			"text": "Aişe (r.a.a)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem), cünüplükten (dolayı) guslettikten sonra abdest almazdı. Tahric: Beyhaki, Nesai, Ebu Davud, Tirmizi ve Hakim de bu hadisi az lafız farkıyla rivayet etmişlerdir. AÇIKLAMA : Tirmizi ve Hakim, sahih olduğunu da belirtmişlerdir. Ebu Davud'un rivayetinde Aişe (r.anha) şöyle, der: \"Resulullah (s.a.v.), ğusledcrdi. Ve iki rek'at (sabah farzından önceki sünnet) namaz ile sabah farzını kılardı. ğusülden sonra abdest aldığını bilmem, (veya) sanmam.'' EI-Menhel yazarı şöyle der: ''Cünüplük ğuslünden sonra abdestin meşru olmadığı bu hadisten anlaşılıyor. Tirmizi: Sahabi ve tabiilerden bir kısmının kavli budur, demiştir. İbn-i Ömer r.a.'den rivayet edildiğine göre ResuluHah (s.a.v.)'e; ğusülden sonra abdest alınıp alınmıyacağı sorulduğu zaman O: ''Hangi abdest ğusüldcn daha efdaldır.'' diye cevap vermiştir. El-Hakim bunu rivayet etmiştir. İbn-i Ebi Şeybe'nin İbn-i Ömer r.a.'den rivayet ettiğine göre ğusülden sonra abdest aldığını söyleyen bir adama ibn-i Ömer (r.a.): Hakikatan sen işi derinleştirmişsin, demiştir. Tirmizi'nin Aişe r.anha'dan rivayet ettiğine göre Resulullah (s.a.v.), ğusülden sonra abdest almazdı. Huzeyfe (r.a.)'den rivayet edildiğine göre: Tepesinden ayağına kadar yıkanmak birinize yetmiyor mu ki, abdest alsın? demiştir. Sahabilerden bir cemaat ve onlardan sonra bir çok alim, aynı şeyi söylemişlerdir. Hatta Ebu Bekir bin El-Arabi: Abdestin, ğuslün altına girdiği hususunda alimler arasında ihtilaf yoktur, demiştir. Hadis, sabah farzından önce iki rek'at fecir sünnetinin kılmmasının meşruluğuna ve ğusülden sonra abdest almanın meşru olmadığına delalet eder",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 313
			}
		}
	]
}