{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 587,
			"arabicnumber": 587,
			"text": "Ebu Said(-i Hudri) (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurmuştur: «Biriniz eşine yaklaşır, sonra tekrar yaklaşmak istediği zaman abdest alsın.» AÇIKLAMA : Müslim, Ebu Davud, Nesai, ibn-i Huzeym ve, İbn-i Hibban, Tahavi ve Beyhaki de bu hadisi rivayet etmişlerdir. Tirmizi de rivayet ederek hasen-sahih olduğunu söylemiş, El-Hakim de EI-Müstedrek'te rivayet ederek, sahihliğini bildirmiştir. Hadisteki yaklaşmaktan maksad, cinsi münasebettir. istenen abdest ile şer'i abdest kasdedilmiştir. Çünkü mutlak olarak kullanıldığı zaman böyle anlaşılır.' Ayrıca ibn-i Huzeyme'nin rivayetinde; ''Namaz abdesti gibi abdest alsın.\" buyurulmaktadır. . Hadisteki abdest emri, Zahiriy e mezhebi alimlerine ve Maliki olan ibn-i Habib'e göre vücub içindir. Onlar, hadisin zahirini tutmuşlardır. Fakat Cumhur, emrin müstehablık için olduğunu söylemişlerdir. Çünkü Tahavi'nin Aişe (r.anha)'dan rivay,et ettiğine göre Nebi s.a.v., bazen apdest almadan tekrar yaklaşırdı. Hanefi alimlerinden Ebu Yusuf'a göre söz konusu abdest ne vacibtir ne de menduptur. Hadisteki emir de mubahlık içindir. Bazı alimler de; Hadisteki ''vudu' (abdest)\" kelimesi ile şer'i abdest değil, lüğavi abdest olan avret mahallini. yıkamak anlamı kastedilmiştir, demışlerdir. Hadis, iki cima' arasında abdest alınmasının matlub olduğuna ve ğusletmenin vacib olmadığına delalet eder. BU HADİS’İN EBU DAVUD RİVAYETİ VE İZAH İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 321
			}
		}
	]
}