{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 592,
			"arabicnumber": 592,
			"text": "Cabir bin Abdillah (Radtyallahü d»A«w4/dan şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem)'e t Cünüp, uyuyabilir mi, veya yiyebilir mi, yahut içebilir mi? diye soru soruldu. Resulullah (Sallallahu Aleyhi ve Sellem) dei «Evet, namaz abdesti gibi abdest aldığı zaman (bunları yapabilir.)» buyurdu. AÇIKLAMA : Hz. Aişe (r.anha)'nın hadisini Müslim. Nesai. Ebu Davud ve Beyhaki de rivayet etmişlerdir. Bu hadis bundan sonraki babda gelen Hz. Aişe (r.anha)'nın hadisine muhalif değildir. Orada, Peygamber (s.a.v.)'in yalnız ellerini yıkamakla yetindiği bildiriliyor. Bazen öyle yaparak caizliğini beyan buyuran efendimiz (Sallallahu Aleyhi ve Seııem) çoğunlukla abdest alarak bunun daha efdal olduğunu göstermiştir .. Sindi: . Cabir bin AbdiIIah (r.anh)'ın hadisinde cünüp için sorulduğu bildirilen sorudan maksad, cünübün bu işleri yapmasının uygun ve güzel olup olmadığıdır. Çünkü, cünübün abdest aldıktan sonra böyle yapması menduptur, şart değildir. Nitekim bundan sonra gelen hadisten, cünübün yalnız ellerini yıkamakla yetinmesinin caizliği anlaşılır, der. Hulasa cünüp, ğusletmeden uyuyabilir, yiyebilir, içebiir ve hanımına yaklaşabilir. Nevevi, Müslim'in şerhinde: 'Bu hususta icma' vardır. Keza cünübün bedeni ile terinin temizliğine alimler icma' etmişlerdir.' der. Cünübün anılan işleri yapmadan önce avret mahallini yıkaması ve abdest alması müstehaptır. Nevevi: 'Abdest almadan bu işleri yapmanın rnekruh olduğunu arkadaşlarımız kesinlikle belirtmişlerdir. Hadisler buna delalet eder. Bu abdestin vacib olmadığı hususunda bizce ihtilaf yoktur. Cumhur'un görüşü de budur ... ' demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 326
			}
		}
	]
}