{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 594,
			"arabicnumber": 594,
			"text": "Abdullah bin Seleme (r.a.)'den rivayet edildiğine göre şöyle demiştir : Ben. Ali bin Ebi Talib (r.a.)'ın yanına girdim Buyurdu ki : «Resulullah (Sallallahu Aleyhi ve Sellem) helaya uğrayıp ihtiyacını giderdikten sonra çıkar ve (abdest almadan) bizimle beraber ekmekle et yiyer, Kur'an okurdu. Cünüplükten başka hiç birşey, O'nu Kur'an okumaktan men etmezdi.» AÇIKLAMA : Ahmed, İbn-i Hibban, Ebu Davud, El-Hakim, El-Bezzar. Darekutni. El-Beyhaki, Em-Nesai de bu hadisi tahriç etmişler, Tirmizi, İbnü's-Seken, Abdu'l-Hak ve Bağavi bunun sahih olduğunu söylemişlerdir. Bazı rivayetler daha .uzundur. Tıybi: Et yendikten sonra abdest tazelenmeden ve ağza su alınmadan namaza durmak sahih olduğu gibi. Kur'an okumanın da sahih olduğunu bildirmek için burada et yemek ile Kur'an. okumak bir arada anlatılmış olabilir demiştir. Ravi, Hz. Ali (r.anh)'in; لا يحجبه veya; لا يحجزه dediğinde tereddüd etmiştir. Hangi fiil kullanılmış ise netice değişmez. Her iki fiilin manası men etmektir. Onun için tercemede: ''Onu men etmez.\" diye anlatıldı. Hadis, cünüp adamın Kur'an okumasının caiz olmadığına. delalet eder. Cumhur'un görüşü budur. Delilleri de bu hadis, bundan sonra gelen İbn-i Ömer (r.anh)'in hadisi ve Darekutni'nin Ebu'l-Ğarif El-Hemedani'den rivayetle Hz. Ali r.anh'in şu mealdeki haberidir: ''Cünüp olmadığınız müddetçe Kur'an okuyunuz. Birinize cünüplük isabet ederse Kur'art okumasın. Tek bir harfini de okumasın..'' Cumhurun görüşüne,delalet eden rivayetler çoktur. Bazılarının sahihliğine itiraz edilmiş ise de riyayetler birbirini takviye eder. Malikiler: 'Ayetü'l-Kürsi, ihlas ve Muavvizeteyn gibi az bir parçayı, korunmak ve benzeri maksadlarla okumak caizdir. Fakat uzun parça okumak haramdır. demişlerdir. Şafiiler: Kur'an niyeti ile değil, zikir veya dua niyetiyle az bir şey okumak caizdir, demişlerdir.\"•\" Ahmed bin Hanbel: Cünübün bir ayet mikdarını okumasına ruhsat verilmiştir, der. Ebu Hanife: Bir ayetin bir parçasını okumak caizdir, demiştir. El-Hattabi şöyle der: ''Cünübün Kur'an okuyamıyacağı hükmü, hadisten .çıkarılıyor. Aybaşı adetini gören kadin'da okuyamaz. Çünkü onun abdestsizliği, cünübün abdestsizliğinden daha ağırdir. imam Malik, cünübün bir ayet miktarını okuyabileceğini söylemiştir. Kendisinin: Aybaşı adeti gören kadın Kur'an okuyabilir. Fakat cünüb okuyamaz. Hayz süresi uzayabildiği için kadın okumadığı takdirde, Kur'an'ı unutabilir. Fakat cünüblük süresi uzun değildir, dediği rivayet edilmiştir. İbnü'l-Müseyyeb ve İkrime'nin de, cünübün Kur'an okurnasında beis görmedikleri rivayet edilmiştir. Alimlerin ekserisi, cünübün Kur'an okumasının haram olduğunu söylemişlerdir.'' EI-Menhel yazarı 'Cünübün Kur'an Okuması Babı'ında yukarıdaki bilgileri verdikten sonra, cünübün Kur'an'a dokunmasının cumhura göre haram olduğunu bildirir. Bu arada cumhurun delil olarak gösterdikleri ayet ve hadisleri nakleder. Konunun uzatılmaması için delilleri buraya nakletmekten vazgeçtim. EI-Menhel yazarı daha sonra abdestsiz olarak Kur'an'a ellemenin hükmüne ait fıkıhçıların görüşlerini şöylece nakleder: ''Hanefiler, Şafiiler ve Hanbeliler: 'Kur'an'ı öğreten ve öğrenen dahil hiç kimse abdestsiz olarak Kur'an'a dokumaöaz. Ancak çocuğun, ayetlerin yazılı olduğu levhalan ellemesi zaruret icabı caizdir. Mushaf'ın cildini, sahifelerin yazısız olan kenarlarını, satırlar arasındaki boşlukları ellemesi de haramdır. Keza kılıf içinde veya rahle üzerinde. yahut eşya içerisinde Kur'an'ı taşıması da.haramdır. Ancak, eşyanın taşınması da kasdedildiği takdirde haram değildir.\" demişlerdir. Hanefi ve HanbelI alimlerine göre Mushaf'a yapıak olmayan kılıfı içinde Kur'an'ı abdestsiz olarak taşımak caızdir. Mushaf'ın yangın ve sel gibi bir afetle zayi olması tehlikesi karşısinda, yahut kafirlerin İslam memleketini işgal etmesi halinde, veyahut pis yere atılmış olan Mushaf'ı kurtarmak niyetiyle abdestsizin onu taşıması, hatta cÜnübün taşıması vacibtir. Mushaf'ın korunması ve saygınlığı bunu gerektirir. Eğer abdestsiz veya cünüp kişi, Mushaf'ı kurtarabildiği halde taşımaz da yangın veya selde zayi olmasına yahut kafirlerin istilasına maruz kalmasına göz yumarsa günahkar olur. Şayet pis yerden kaldırmazsa kafir olur. Keza abdestsiz olarak Kur'an ayetini yazmak da haramdır. Beğavi: 'Duvarları ve elbiseleri ayetlerle veya Allah'ın adlarıyla süslemek, yani bu yerlere yazmak mekruhtur. Mushaf'ları yastık gibi kullanmak caiz değildir. Keza dini ilimIere ait kitapları yastık gibi kullanmak caiz değildir. Ancak kaybolmasından korkulduğu takdirde, ona dayanmak caizdir. küçük yaştaki çocuğa ve deliye Kur'an'ı elletmek caiz değildir,' demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 328
			}
		}
	]
}