{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 60,
			"arabicnumber": 60,
			"text": "Ebu Said-i Hudri r.a.’den yapılan rivayete göre kendisi Resulullah Sallallahu Aleyhi ve Sellem’in şöyle buyurduğunu söylemiştir; “Allah Teala, kıyamet günü mu'minleri cehennem ateşinden kurtarınca ve onlar güvenç içine girince birinizin, dünyada iken hakkını almak uğrunda arkadaşı ile yaptığı çekişmeden daha şiddetli bir tarzda mu'minler ateşe atılmış olan (din) kardeşleri için Rableri ile mücadeleye girişirler. Resulullah s.a.v. buyurdu ki ; mu'minler diyecekler ki: “Ey Rabbimiz! Kardeşlerimiz bizlerle namaz kılarlar, beraberimizde oruç tutarlar ve bizimle beraber hac ederlerdi. Sonra sen onları ateşe ithal ettin.” Allah buyuracak ki; “Gidin onlardan tanıdıklarınızı (Cehennemden) çıkarınız” mu'minler, bunun üzerine onlara varacaklar ve yüzlerinden onları tanıyacaklar. Çünkü ateş onların yüzlerini (yaptıkları secde sayesinde) yakmıyacaktır. Onların bir kısmı aşık kemiklerine, bir kısmı da bacaklarına kadar ateş içinde tutuşmuş vaziyettedir. Bunları çıkaracaklar sonra “Ey Rabbimiz! Bize emrettiğiniz adamları (tanıyabildiklerimizi) çıkardık.” Diyecekler. Sonra Allah (Teala) buyuracak ki: “Kalbinde bir dinar ağırlığınca iman olanları çıkarınız. Sonra kalbinde yarım dinar ağırlığınca, onları müteakib de kalblerinde hardal tanesi ağırlığında iman olanları çıkarınız.” Ebu Saidi Hudri dedi ki; Kim bunu doğrulamazsa bu ayeti okusun; ‘‘Şüphe yok ki Allah (Teala) zerre miktarı zulum etmez. Eğer zerre kadar bir iyilik olursa onun ecrini kat kat artırır ve kendi katından da büyük mükafat ihsan eder.’’ (Nisa ,40)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 60
			}
		}
	]
}