{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 603,
			"arabicnumber": 603,
			"text": "Ümmü Seleme (r.anha)'dan rivayet edildiğine göre kendisi şöyle demiştir: Ben Resulullah (Sallallahu Aleyhi ve Sellem)'e: Ya Resulallah l Ben saçımın örgüsünü çok sıkı bağlayan bir kadınım. Cünüblük ğuslü için örgümü çözeyim mi? diye sordum. Resulullah (Sallallahu Aleyhi ve Sellem) buyurdular ki : «Başına üç avuç su atman, sonra vücuduna su dökmen kafidir. Sen bununla temizlenirsin.» veya buyurdu ki : «İşte o zaman sen temizlenmiş olursun.»\" Diğer tahric: Müslim, Nesai, Ebu Davud, Beyhaki ve Tirmizi. AÇIKLAMA : Tirmizi, hadisinin hasen - sahih olduğunu söylemiştir. Ümmü Seleme, sıkı bağladığı peliklerini, cünüblük ğuslü için çözmek mecburiyetinde olup olmadığını sorunca Nebi (s.a.v.), üç avuç suyu başına dökmesinin kafi geldiğini buyurmuştur. Pelikleri çözmenin gerekli olmadığı anlaşılıyor. Üç avuç suyu dökmek şartı kasdedilmemiştir. Gaye, suyun her tarafa ulaşmasıdır. Örgülü saçın iç kısımlarının ıslatılması için çoğu zaman, üç defa su dökmek gerektiği için, hadiste, ''Üç defa'' tabiri kullanılmıştır. Bazen bir defa ile her taraf ıslatılabilir, bazen de üç defadan fazlaya ihtiyaç duyulur. Hattabi: 'Cünüp adamın suya daldığı veya bol suyu vücuduna döktÜgÜ zaman, eliyle vücudunu ovalamasa bile ğuslünün sahih olduğu hadisten anlaşılıyor. Malik bin Enes hariç bütün fıkıhçıların kavli budur. Malik bin Enes'e göre, kişi cünüblükten ğuslettiği zaman elini vücudunun her tarafına sürmedikçe ğusül tam sayılmaz. Keza, kolunu veya ayağını suya taharet niyetiyle batırdığı zaman onu eliyle ovalamadıkça o uzvun tahareti yapılmış olmaz. Hattabi, sözlerine devamla şöyle der: Bir avuç suyla başın her tarafı ıslatıldığı zaman bunun kafi geldiği ve üç defa yıkamanın vacib olmayıp, müstahab olduğu hadisten anlaşılıyor' demiştir. EI-Menhel yazarı, bu konu için açılan babta rivayet olunan mezkur hadisin açıklaması bahsinde şöyle der: ''Hadis, kadının cünüblük ğuslünü yaparken pelikleri çözmek zorunda olmadığına delalet eder. Bu hususta, alimler arasında ihtilaf vardır: 1- Hanefi alimlerine göre; peliklerin dip kısmı ıslanırsa kadın, onu çözmek mecburiyetinde değildir. Fakat erkek, peliklerinin dip kısmına su ulaşsa bile, çözmek mecburiyetindedir. Erkek ile kadın arasındaki ayırımın hikmeti şudur: Pelikleri çözmek kadına güçtür. Saçlarını kesmesi de suçtur. Bunun için pelikleri çözmek yükümlülüğü kalkmıştır. Fakat erkek böyle değildir. ğuslederken mutlaka pelikleri çözmek mecburiyetindedir. Çünkü güçlük yoktur. (Yani saçını da kısaltabilir, peilklerini kesebilir. Delilleri bu ve benzeri hadislerdir. 2- Şafiiler'e göre; Pelik çözülmeden saçların her tarafına su ulaşırsa çözmek vacip değildir. Aksi takdirde vacibtir. Bu hususta erkek ile kadın arasında bir fark yoktur. Aynı şekilde cünüplük, lohusalık ve aybaşı adeti arasında bir fark yoktur. Delilleri ise; 597 - 59B nolu hadislerdir. Bir de: Ümmü Seleme (r.anha)'nın saçları hafifti. Nebi (s.a.v.), saçının her tarafına suyun ulaşacağını bildiği için peliklerini çözmesini emretmemiştir, derler. 3 - Maliki'lere göre; Saç, kıvırcık olup, çok sıkı ise ğusülde çözülmesi vaciptir. Abdestte vacib değildir. Şayet üç veya daha fazla iple örülmüş ise, sıkı olsun olmasın ğusül ve abdestte çözülmesi vacibtir. Eğer bir veya iki iple örülü olup, sıkı ise çözülür, aksi takdirde çözülmesi mecburi değildir. Bu hususta erkekle kadın arasında bir fark yoktur. Keza cünüplük ğuslü ile diğer gusüller arasında bir fark yoktur. Onların delilleri de, Şafiiler'in delil olarak gösterdikleri hadislerdir. 4- Hanbeli alimlerine göre hayz ve nifas ğuslünde pelikleri çözmek vacibtir. Cünüplük ğuslünde ise peliklerin dip kısmına su ulaşırsa peliği çözmek vacib değildir. Bu ayırıma delil olarak da Resul-i Ekrem (s.a.v.)'in hayızdan ğuslünü yapmak isteyen Aişe (r.anha)'ya buyurduğu şu emri göstermişlerdir: ''Başını (saçını) çöz ve tara.'' Hanbeliler: Taramak, örgülü olmayan saçta mümkündür, demişlerdir. Fakat bu delil şöyle reddedilmiştir: Aişe (r.anha)'nın hadisi hac mevsiminde idi. Umre için ihrama girmişti. Sonra Mekke'ye girmeden aybaşı adetini gördü. Bunun üzerine Resul-i Ekrem (s.a.v.) O'na başının peliklerini çözüp taramasını ve yıkanıp, hac için ihrama girmesini emretmişti. Aişe (r.anha) , hayzdan henüz temizlenmemişti. Bu nedenle, onun yaptığı gusül, hayzdan kesilme ğuslü değil, temizlik için yıkanmadır. Dolayısıyla Ümmü Seleme'nin hadisine muarız olamaz.'' HADiSTEN ÇIKARILAN FIKIH HÜKÜMLERİ : 1 - Cünüplük ğuslünde kadın, peliklerini çözmeye mecbur değildir. 2 - Vücudun her tarafının suyla ıslatılması kafidir. Bu husustaki tafsilatı ve pelikleri çözme hususunda alimler arasındaki ihtilafı yukarda verdik",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 337
			}
		}
	]
}