{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 606,
			"arabicnumber": 606,
			"text": "Ebu Said-i Hudri (r.a.h)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem), Ensar'dan bir adam'a uğramış ta kendisini çağırtmış. Adam da, başından su damladığı halde hemen çıkmıştır. Bunun üzerine Nebi (Sallallahu Aleyhi ve Sellem) : — «Galiba sana acele ettirdik» buyurmuştur. Adam da : — Evet, Ya Besulallahl diye cevap vermiş. Resulullah (Sallallahu Aleyhi ve Sellem) : . — «Sana acele ettirilir (de meninin çıkmasına fırsat verilmez) veya meninin çıkmasından tutulursan sana gusül gerekmez de abdest gerekir.» buyurmuştur. Diğer tahric: Buhari ve Müslim de bu hadisi rivayet etmişlerdir. AÇIKLAMA : Buradan ve Müslim' de yapılan rivayetten Nebi (s.a.v.)'in Ensar'dan olan zat'ın evine uğradığı ve onu çağırttığı anlaşılıyor. Müslim'in bir rivayetinde uğranılan Ensari'nin İtban olduğu belirtilmiştir. Bazı rivayetIere göre uğranılan zat'ın adı Salih'tir. Bu duruma göre olay iki yerde olmuştur. Adamın, başından su damlaya damlaya huzura çıkması üzerine durumu fark eden Nebi (s.a.v.) : ''Her hangi bir nedenle meni çıkmazsa yalnız cinsi münasebette bulunulmakla cünüblük halinin olmıyacağını ve dolayısıyla ğusle gerek olmayıp abdest almakla yetinileceğini bildirmiştir.'' Sindi, hadisin (608, 609, 610 ve 611 nolu) hadislerIe mensuh olduğuna Cumhurca hükmedildiğini, hatta müteahhirin alimlerinin bu nesih işinde icma' ettiklerinin söylendiğini nakleder. Sahabi ve tabiinden bir cemaat meni inmedikçe cinsi münasebetle ğusül gerekmez, demiştir. Ebu Eyyub- i Ensari, Ebu Said-i Hudri, İbn-i Mes'ud, Sa'd bin Ebi Vakkas, Ubeyy bin Ka'b, Rafi' bin Hadic ve Zeyd bin Halid (r.anhum) böyle demişlerdir. Tabiilerden de Ata' bin Ebi Rabah, Ebi Seleme ve Süleyman El-A'meş (r.a.) böyle demişlerdir. Zahiriye mezhebine mensub alimlerin görüşü de budur. Delilleri ise . Ebu Said-i Hudri (r.a.)'in mezkur hadisi, Ebu Eyyub-i Ensari (r.a.)'in (607 nolu) hadisi ve bunlara benzeyen Ebu Hureyre (r.a.) ile Osman bin Affan (r.a.)'dan rivayet edilen hadislerdir. Fakat bu hüküm, Hulafa-i Raşidin, Aişe, Abdullah bin Ömer, AbduIlah İbn-i Abbas, AbduIlah bin Mes'ud (r.anhum)'dan ve diğer muhacirlerden rivayet olunan.hadislerle mensuhtur. Bu duruma muttali' olan Osman bin Affan, Ali b Ebi Talib, İbn-i Mes'ud ve İbn-i Abbas (r.anhum)'un ilk fetvalarından rücu' ettikleri İbn-i Hazm tarafından açıklanmıştır. Nevevi de: 'Sahabilerden bir cemaat meni inzal olmadıkça (çıkmadıkça) cima' (cinsi ilişki) ile ğusül icab etmez, demişler ise de, bir kısmı bu fetvadan rücu' etmiş ve diğerlerden sonra, meni gelsin gelmesin cima' ile ğuslün icab ettiği hakkında icma' olmuştur,' der",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 340
			}
		}
	]
}