{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 609,
			"arabicnumber": 609,
			"text": "Ubeyy bin Ka'b (r.a.)'den; şöyle demiştir: O hüküm (= su, meniden dolayı gerekir hükmü) İslamiyetin ilk zamanlarına ait bir ruhsat idi. Sonra, gusül etmekle emrolunduk. Diğer tahric: Beyhaki, Ahmed, Darimi, Ebu Davud ve Tirmizi AÇIKLAMA : Tirmizi'nin lafzı şöyledir: ''Su, meni'den dolayı gerekir, hükmü İslamın başlangıcına mahsus bir ruhsat idi. Sonra bu ruhsat yasaklandı.'' Ebu Davud'un rivayeti ise şöyledir: ''Resulullah (s.a.v.), İslam'ın ilk zamanlarında elbiselerin azlığı nedeniyle, su meni'den dolayı gerekir, hükmünü halk için bir ruhsat kılmıştı. Sonra (meni gelmese bile, cima olunca) ğusletmeyi emretti. Ve o ruhsatı yasakladı.'' Tirmizi bu hadisin hasen-sahih olduğunu ve ilim ehlinin ekserisinin bununla amel ettiğini söylemiştir. İbn-i Huzeyme ve İbn-i Hibban da, bunun sahih olup hüccet olmaya elverişli olduğunu söylemişlerdir. EI-Menhel yazarı 'İksal babı'nda rivayet olunan bu hadisi açıklarken aşağıdaki ma'lumatı veriyor: ''İslamiyetin ilk zamanlarında müslümanların elbiseleri azdı. Sık sık ıslatılması, onun çabuk çürümesine sebebiyet verirdi. Müslümanların çok ğusül yapmaları halinde onlara zarar dokunabilirdi. Bu nedenle meni gelmeden yapılan her duhulün ğuslü icab ettirmesi müslümanların için güçlük ve sıkıntı olabilirdi. Bu nedenle kolaylık olsun diye müslümanlara bu ruhsat verildi. Sonra duhul ile ğuslün gerekliliği hükmü kondu. Hulafa-i Raşidin, Sahabilerin cumhuru ile fıkıhçıların cumhuru, meni gelmese bile mutlak duhul ile ğuslün gerekliliğine hükmetmişlerdir. Nevevi, Müslim'in şerhinde: 'Bilki meni gelmese bile cima' ile ğuslün gerekliliği üzerinde ümmetin tümü ictima etmiştir. Sahabilerden bir grup: Meni gelmedikçe ğusül icab etmez demişse de bilahare bir kısmı bu fetvadan rücu' etmiş ve kalan kısımdan sonra, meni gelmese bile, sırf cima' ile ğuslün gerekliliği üzerinde icma' olmuştur. Cumhur, bu hususta varid olan bir çok hadisi delil göstermişlerdir. Bunların bir kısmı bu babta geçen hadislerdir. (EI-Menhel yazarı, Ebu Davud'un süneninde rivayet olunmayan ve Cumhurun delil gösterdiği Buhari ve Müslim'deki bazı hadisleri de nakleder. Bunlardan birisi 610 nolu Ebu Hureyre (r.a.)'in hadisidir. Cumhur, meni gelmedikçe ğusül gerekmez diyenlerin gösterdikleri delillerin, Ubeyy bin Ka'b (r.a.)'ın bu babtaki hadisi (kitabımızdaki 609 nolu hadisi kasdeder ve Tahavi'nin Yezid bin Ebi Habib'den rivayet ettiği Rifaa (r.a.)'nın şu hadisiyle mensuh olduğunu söylemişlerdir: Rifaa (r.a.) şöyle demiştir: 'Ben, Ömer birı El-Hattab (r.a.)'ın yanında oturuyordum. Aniden bir adam gelerek: Ya Emire'l-Mu'minin! Şu Zeyd bin Sabit, cünüblükten ğusül hakkında kendi re'yi ile halka fetva veriyor, dedi. Bunun üzerine Halife: Bana acele Zeyd'i getirin, dedi. Biraz sonra Zeyd geldi. Halife Zeyd (r.a.)'e: - Nebi (s.a.v.)'in mescidinde senin kendi re'yinle cünüblükten ğusül hakkında halk'a fetva verdiğin haberi bana ulaştı, dedi. Zeyd (r.a.) O'na': - Ya Emire'l-Mu'minin! Vallahi ben kendi re'yimle fetva vermedim. Lakin amcalarımdan bir şey işitmiştim. Onunla hükmettim, diye cevap verdi. Halife ona: - Hangi amcalarından? diye sordu. Zeyd: - Ubeyy bin Ka'b, Ebu Eyyub ve Rifaa bin Rafi (r.a.)'den işittim, dedi. Bunun üzerine Hz. Ömer (r.a.), bana bakarak: Bu genç ne diyor? diye sordu. Ravi Rifa'a bin Rafi' dedi ki: Bu soru üzerine ben halife'ye: - Biz, Resulullah (s.a.v.), zamanında hakikaten bunu yapardık. Sonra ğusletmezdik, dedim. Halife: - Siz; şu yaptığınızı Nebi (s.a.v.)'e sordunuz mu? dedi. Ben: Hayır, dedim. Halife: - O halde sahabileri bana toplayın, dedi. Bunun üzerine toplanan halk; ''Su, ancak meni'den dolayı gerekir.'' hükmünde ittifak ettiler. Yalnız Ali ve Muaz bin Cebel (r.anhuma) tarafından gelen bilgi böyle değildir. Onlar; Sünnet yeri içeri girince ğusül gerekir, dediler. Bunun üzerine ravi: Ey Mu'minlerin Emiri! Bu hususta Resulullah (s.a.v.)'in emrini muhterem zevcelerinden daha iyi bilen hiç bir kimseyi bulamam, dedi. Bundan sonra Halife, Hz. Hafsa (r.anha)'ya haber gönderip sordu. Hz; Hafsa (r.anha): Bu hususta bilgim yok diye cevab gönderdi. Sonra Halife, Hz. Aişe (r.anha)'ya haber gönderdi. Hz. Aişe (r.anha): Sünnet yeri, sünnet yerini geçince ğusül vacib olmuş olur dedi. Bunun üznine Halife hiddetlendi ve ''Vallahi bir kimsenin böyle yapıp ğusletmediği haberini alırsam. o'nu cezalandırırım, dedi.' Cumhurun delil olarak gösterdikleri hadislerden birisi de yine Tahavi'nin Ubeydullah, bin Adiyy bin El-Hiyar (r.a.)'dan rivayet ettiği hadistir ki. bu hadiste de Rifaa'nın anlattığı olay zikredilmiştir. Tahavi: 'İşte, Halife Ömer (r.a.), Resul-i Ekrem (s.a.v.)'in sahabilerinin huzurunda halkı ğusletmeye zorlamış, sahabilerden hiç kimse bu hükme karşı çıkmamıştır' der. HADİSTEN ÇIKARILAN FIKIH HÜKÜMLERİ : 1- Meni gelmese bile cima: ile ğusül vacibtir. 2- Ğuslün, yalnız meni gelmesine tahsisi İslamiyetin ilk zamanlarına ait olup, sonradan neshedilmiştir. 3- Şer'i hükümlerin bir kısmı, diğer bir kısmı ile neshedilir. 4 - Hadis, hadis ile neshedilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 343
			}
		}
	]
}