{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 612,
			"arabicnumber": 612,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Biriniz uykusundan uyanır da ihtilam olduğunu hatırlamadığı halde bir ıslaklık görürse gusletsin. İhtilam olduğunu bilir de ıslakhk görmediği zaman ona gusletmek gerekmez.» Diğer Tahric: Beyhaki, Tirmizi, Ahmed, Darimi, İbn-i Ebi Şeybe ve Ebu Davud AÇIKLAMA : Hadisin hükmünü belirtmeden önce şunu söyleyeyim: Tenasül uzvundan çıkan sidikten başka üç çeşit su var. Bunlardan meni;.normal lezzetle ve sıçrayarak çıkar ıslak iken hamur kokusunu, kuruduktan sonra yumurta kokusunu vermekle tanınır. Mezi ise az şehvet olduğu zaman bile çıkabilen ince, sarımtırak bir sudur. Bazen çıktığının farkına varılmaz da kilotun ıslanması ile çıktığı anlaşılır. Vedi ise genellikle sidikten hemen sonra veya ağır bir yük kaldırıldığı zaman çıkan kalın, beyaz ve bulanık bir sıvıdr. Hadis, Beyhaki, Tirmizi, Ahmed, Darimi, İbn-i Ebi Şeybe ve Ebu Davud tarafından da rivayet edilmiştir. Ebu Davud'un rivayeti şöyledir: \"Aişe (r.anha) demiştir ki: Islaklık bulup da ihtilam olduğunu hatırlamayan adam'ın hükmü Resulullah (s.a.v.)'e soruldu. Resıılullah (s.a.v.) : ''Adam ğusleder (ğusletsin)'' buyurdu. Bu defa ihtilam olup da, ıslaklık bulamayan adamın durumu soruldu. Resulullah (s.a.v.) : ''Ona ğusül gerekmez.,. cevabını buyurdu. Ümmü Süleym: Kadın bunu görebilir. O'na da ğusül gerekir mi? diye sordu. Resulullah (s.a.v.) : ''Kadınlar, erkeklerin kardeşleridir. (Huy, tabiat ve hükümlerde erkekler gibidir,) buyurdu.\" EI-Menhel yazarı bu hadisin açıklaması bahsinde şöyle der: ''Hadisin zahirine göre uykudan kalkan kişi, ıslaklık bulduğu takdirde, o ıslaklık ne olursa-olsun, yani meni, mezi ve vedi'den hangisi olursa olsun ğusül gerekir. İbn-i Abbas, Şa'bi, İbn-i Cübeyr ve Nahai böyle demişlerdir. Tirmizi: Sahabi ve Tabiilerden böyle söyleyen bir kişi değildir, demiştir. Ebu İshak, Ata ve Mücahid: Islaklık, meni olduğu zaman ğusledilir, demişlerdir. Hanefi alimlerine göre kişi ihtilam'ı hatırlar ve ıslaklığın meni veya mezi olduğunu bHirse yahutta meni midir, mezi midir, vedi midir? diye şüphe içinde kalırsa ona ğusletmek gerekir. Şayet vedi olduğuna hükmederse, ğusletmesi gerekmez. Eğer ihtilam olduğunu hatırlamazsa durumuna bakılır. Şayet ıslaklığın vedi olduğuna inanırsa ğusül gerekmez. Meni olduğuna inanırsa ğusletmesi gerekir. Meni mi, mezi mi, vedi mi diye şüphe ederse Ebu Hanife ve Muhammed'e göre yine ğusletmesi gerekir. Ebu Yusuf: 'İhtilam olduğunu hatırlamadıkça ona ğusletmek gerekmez. Asıl olan, kişinin cünüb olmamasıdır. Kesin bilgi olmadıkça ğusül gerekmez. Kıyas da budur' demiştir. Ebu Hanife ve Muhammed (r.a.), ihtiyatlı davranmışlar. Çünkü uyuyan kişi garildir. Meni, hava ile inceleşerek meziye benzeyebilir. İhtiyaten ğusletmesi gerekir, diye ictihad etmişlerdir. \" Şafii alimlerine gelince, uykudan uyanıp ıslaklık gören kişi, meni mi, mezi mi diye şüphe ederse, kanaatine göre hareket eder. Eğer meni olduğu ihtimalini seçerse ğusleder. Mezi olduğu ihtimalini tercih ederse o yeri yıkar ve abdest alır. Tahkik budur ki; eğer meni olduğunu bilirse ihtilam'ı hatırlasın hatırlamasın ğusletmesi gerekir. Şayet ıslaklığın sidik, mezi veya vedi olduğuna inanırsa ğusül gerekmez. Eğer meni mi, diğerleri mi, diye şüphe ederse ihtiyaten ğusletmesi gerekir. Malikiler'e göre: Uykudan uyanıp, elbisesinde veya bedeninde ıslaklık bulan kişi, meni olduğunu bilirse yahut, meni mi başka bir şey mi diye şüphe ederse ğusletmesi vacibtir (şarttır). Şayet meni'den başka bir şey olduğunu bilirse, yahut meni mi, mezi mi, vedi mi diye şüphe ederse ğusletmesi gerekmez. Hanbeliler'e göre; uyuyan veya bayılan kişi uyanıp da, elbisesinde veya vücüdunda bir ıslaklık görürse bakar; Eğer meni olduğu tahakkuk ederse, ihtilam olduğunu hatırlamazsa bile ğusletmesi vacibtir. Islaklığı yıkaması gerekmez. Çünkü meni tahirdir. Eger. mezi olduğu tahakkuk ederse, oraları yıkar ve ona ğusül gerekmei. Şayet meni veya mezi olduğu tahakkuk etmezse ve uyumadan önce hanımıyla oynaşmak, şehvani şeyleri düşünmek veya üşütmek gibi bir şey geçirmemişse ğusletmesi ve ıslaklığın dokunduğu yeri temizlemesi gerekir. Eğer uyumadan önce, anılan bir neden geçmiş ise ğusül gerekmez. O yeri yıkamak gerekir. Çünkü zahire göre o ıslaklık mezidir. Zira uyumadan önce bir sebebi görülmüştür. Eğer bu adam ihtilam olduğunu hatırlarsa ğusül gerekir. Çünkü, çıkan ıslaklık ihtilam sebebine bağlanır. HADİSİN FIKIH YÖNÜ : 1- Uykudan uyanınca bir ıslaklık bulunduğu takdirde, ihtilam hatırlanmasa bile ğusül gerekir. Bu husustaki tafsilat yukarıda.geçti. 2- Şer'i bir hükmü bilmeyen kişi sormalı, bundan çekinmem lidir. 3- Ebu Davud'un rivayetinde belirtildiği gibi erkek nasıl ihtilam oluyorsa kadın da ihtilam olabilir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 346
			}
		}
	]
}