{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 620,
			"arabicnumber": 620,
			"text": "Urve bin Zübeyr (r.a.)'den rivayet edildiğine göre Fatime bint Ebi Hubeyş (r.anha) O'na şunu anlatmıştır: Fatime, Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına gelerek kandan* şikayet etmiştir. Resulullah (Sallallahu Aleyhi ve Sellem) : «Bu (hayız değil), bir damar (dan gelen kan) dır. Bunun için sen bak, mu'tad hayızın zamanı gelince namaz kılma. Senin hayzın zamanı geçince ğuslet, sonra iki hayız arasındaki sürece namaz kıl,» buyurdu. Diğer Tahric: Bu hadisi Nesai, Beyhaki ve Ebu Davud da rivayet etmişlerdir. AÇIKLAMA : İbn-i Hazm'ın dediğine göre: 'Urve bin Zübeyr, Fatime bin Ebi Hubeyş'in zamanına ulaşmış olup, bu olayı kendisinden ve ayrıca Aişe (r.anha)'dan işitmiş olabilir. Bu duruma göre senedde bir inkıta' yoktur. Hadisin manasına gelince; Fatime (r.anha)'nın, adet dışı devam eden kanın dinmemesi üzerine halini Resul-i Ekrem s.a.v.'e arzed€rek, bu haliyle namaz durumunu sorduğu, verilen cevaptan ve bundan sonra gelen hadisten anlaşılıyor. Buradaki rivayette Fatiı e r.anha'nın şahsen Resul-i Ekrem (s.a.v.)'e sorduğuna veya birisinin aracılığıyla sordurduğuna dair bir açıklık yoktur. Beyhaki, Darekutni ve Ebu Davud'un bir rivayetine göre Fatime (r.anha) Nebi'in zevcesi Meymune'nin kardeşi olan Esma r.anha aracılığıyla bu durumu Resul-i Ekrem (s.a.v.l'e sordurmuştur. Nebi (s.a.v.l, bu kanın hayız kanı olmayıp bir hastalık kanı olduğunu bildirerek, hayız zamanı geldiğinde namazı bırakmasını ve hayız süresi bitince ğuslederek namaza başlamasını emretmiştir. Hadiste geçen ''Kar'\" kelimesi hayz müddeti anlamında kullanılmıştır. Bazen iki hayız arasındaki temizlik süresi anlamında kullanılır. EI-Menhel yazarı ''İstihaza'' babında rivayet olunan bu hadis bahsinde: Ömer bin El-Hattab (r.a.) : ''Kar'\" kelimesinin manası hayız süresidir, demiştir. Ebu Hanife ve Malik de kelimeyi böyle yorumlamışlardır. Bu hadiste, kelime bu manada kullanıldığı için hadis, onların hüccetidir. Hattabi: ''Kar'''ın hakiki manası hayız veya temizlik halinin döndüğü zamanıdır. Bu nedenle hayız halinde ''Kar'\" denildiği gibi, temizlik haline de ''Kar'\" denilmiştir. Burada hayız manası kasdedilmiştir,' demiştir. Nebi (s.a.v.l, iki hayız zamanı arasında geçen sürenin temizlik süresi gibi kabul edileceğine işaretle, Fatime (r.anha)'nın namaz kılmasını emretmiştir. Fatime (r.anha)'nın devamlı kan görmeden önce bir aybaşı adetinin bulunduğu ve kendisinin bu adeti hatırladığı, hadisin cevap kısmından anlaşılıyor.'' Eski adeti bulunan müstehaza kadına, mu'tade denir. Mu'tade iken adeti bozularak devamlı kan gören kadının hayız günlerinin hesaplanmasında, alimler arasında ihtilaf vardır. Hanefi alimler ve Ahmed bin HanbeI'e göre mu'tade kadın eski adetini hatırlıyorsa, gördüğü kan'ın kuvvetliliğine ve zayıflığına, yani siyah, kırmızı, sarı ve bulanık renkleri arasında bir ayırım yapılmadan eski adeti dikkate alınacak ve hayız günleri ona göre hesaplanacaktır. Mesela her ayın ilk beş günü hayız gören kadının adeti değişerek bütun ay kan görmeye başlayınca, kan'ın koyuluğuna ve açıklığına ve diğer vasıflarına bakılmaksızın eski adetine göre her ayın ilk beş günü hayız sayılır. Ondan sonra 25 gün istihaza sayılır. Bu görüşü savunan alimler bu hadisi delil göstermişlerdir. Çünkü bu hadiste Fatime (r.anha)'nın, hayız müddetine bakması bu müddet gelince namazını bırakması ve müddet bitiminde ğuslünü yaparak ikinci bir hayız zamanı gelinceye kadar namazına devam etmesi emredilmiştir . Hanefi alimleri ve Ahmed bin HanbeI'in meşhur kavll budur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 354
			}
		}
	]
}