{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 621,
			"arabicnumber": 621,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre şöyle demiştir : Fatime binti Ebi Hubeyş, Resulullah (Sallallahu Aleyhi ve Sellem)'e gelerek: Ya Resulallah! Ben müstehaza bir kadınım. Kan'dan temizlenemiyorum. Namazı terk edeyim mi? diye sordu. Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki: «Hayır! O ancak bir damar kanıdır, hayz değildir. Hayz geldiği zaman namazı bırak ve hayz gittiği zaman kanını yıka ve namaz kıl.» Bu Veki' (rahimehumullah)'in hadisidir.\" Tahric: Bu hadisi Kütüb-i Sitte sahibIerinin hepsi rivayet etmişlerdir. AÇIKLAMA : EI-Menhel yazarı, bu hadisin açıklaması bahsinde şöyle der: ''Fatime binti Ebi Hubeyş (r.anha)'nın Ümmü Seleme (r.anha) aracılığıyla bu soruyu Nebi (s.a.v.)'e intikal ettirdiği bazı rivayetlerde belirtilmiştir. Başka bir rivayete göre Meymune (r.anha)'nın kardeşi olan Esma (r.anha), bu soruda aracılıketmiştir. Buradaki hadisin zahirine göre Fatime (r.anha) şahsen Nebi (s.a.v.)'e sormuştur. Rivayetler arasında bir ihtila! yoktur. Çünkü sorunun tekerrür etmesi muhtemeldir. Şöyle de denilebilir: Fatime (r.anha), sordurmuştur. Ravi, aracıyı zikretmemiştir. Hadisin: ''Hayız geldiği zaman ... \" ve: ''Hayız gittiği zaman.... \" ifadeleri iki şekilde yorumlanabilir: 1- 'Senin hayız günlerin geldiği ... ve gittiği zaman...' buna göre eski adete göre hayız günleri hesaplanacaktır. Hanefi alimlerinin ve Ahmed bin Hanbel'in meşhur görüşü budur. 2 - 'Hayzın belirtisi olan koyu renkli kan geldiği ... ve bu kan bitip hayzın bitim belirtisi olan açık renkli kan gelmeye başladığı.. . Bu takdirde hayız günlerinin hesaplanması, kanın kuvvet ve zaafına dayanır. 'Şafii alimleri ile Malik'in görüşü budur. Yukarıda belirtildiği gibi hayız adetinin başlangıç ve bitimi, eski adete göre hesaplanabildiği gibi, kanın kuvvet ve zaaf vasfına göre de hesaplanabilir. Bu nedenle hadis, mu'tade kadının hayız hesaplaması, adete göredir, diyen alimlerin, veya; adete göre değil de temyize (kanın rengini ayırabilmek) göredir, diyen alimlerin görüşüne müsaittir. (İki taraftan birisinin görüşünü te'yid eder durumda görülmemektedir.) Hadisin: ''Hayız gittiği zaman kanını yıka... '' fıkrası ile kadının ğusletmesi ve kanlı yerini yıkaması kasdedilmiştir. Nitekim Buhari'nin bir rivayetinde: ''Sonra ğuslet ve namaz kı!.'' buyurulmuş, kanlı yerin yıkanması zikredilmemiştir. Bu ihtilaf Hişam'ın arkadaşları arasındadır. Onların bir kısmı, kanı yıkamayı zikretmiş, ğusletmeyi zikretmemiştir. Diğer bir kısmı ğusletmeyi anlatmış, kanı yıkamayı zikretmemiştir. Hepsi sikadır. Hadisleri Buhari ve Müslim' de bulunur. Bu nedenle gerek kanı yıkama ve gerekse ğusletme gereği açık olduğu için, iki gurup rivayetlerinde kısaltma yapmıştır, diye yorum yapılır. HAYIZIN KESİLMESİNİN ALAMETİ : İmam Ebu Hanife ve arkadaşlarının görüşüne göre müstahaza kadının hayız süresinin bitimine alamet, onun eski adeti ve zamanıdır. Adetini unuttuğu takdirde, araştırma yapacak, kuvvetli sanısına göre hareket edecektir. Şayet, kuvvetli bir kanaati yoksa bildiği günlerin en azıyla amel eder. İmam Şafii ve arkadaşlarına göre hayızın bitimi eski adete göre değil, kanının renk değişikliğine göre tesbit edilir. Siyah kan kırmızıdan kuvvetlidir. Kırmızı kan, sarı kandan; sarı kan da bulanık kandan kuvvetlidir. Müstahaza kadının kuvvetli kanı, hayız sayılır. Zayıfı da istihaza kabul edilir. Kanını kuvvetli ve zayıf gören kadına mümeyyize denir. Temyizin geçerliliği için üç şart vardır: 1 - Kuvvetli kan onbeş günden fazla devam etmiyecek. 2 - Kuvvetli kan yirmidört saatten az olmayacak ki, hayız sayılabilsin. 3 - Zayıf kan, onbeş günden az olmayacak. Ta ki, iki hayız arasında bir temizlik süresi sayılabilsin. Malik ve Ahmed'in de bununla hükmettikleri El-Ayni tarafından ifade edilmiştir. El-Ayni daha sonra: 'Bu şartlara uygun olarak görülen kuvvetli kan kesilip, zayıf kan gelmeye başlayınca ve böylece hayız zamanı bitince kadının derhal ğuslünü yapıp namaza başlaması vacibtir. Bundan sonra, namaz veya orucu terketmesi caiz değildir. Müstahaza olan bu kadının hükmü temiz olan kadının hükmü gibidir. İstithare (hayız bitiminden itibaren, üç güne kadar ğusletmek) lüzum yoktur. Şafii'nin hükmü budur. Malik'ten üç rivayet vardır: 1 - Hayız bitiminden itibaren üç gün istithal' yapacak, ondan sonra istihaza başlamış olur. 2 - Kuvvetli kan kesilip, yerine zayıf kan gelmeye başlasa bile kadın, onbeş güne kadar namaz kılmayacak, çünkü hayızın en çok süresi onbeş gündür. 3 - Mezhebimizde olduğu gibidir; demiştir. El-Ayni'nin dediğine göre hayızın en az müddeti, İmam-ı Malik'in mezhebinde yirmidört saattir. Halbuki meşhur mezhebine göre, hayızın en az süresi ibadet bakımından bir lahzadır. İddet bakımından bir gün veya günün bir parçasıdır. HADİSİN FIKIH YÖNÜ : 1. Cahil adam, bilmediği şeyleri alimlere sormalıdır. 2. Gerektiğinde, kadın erkeklerle konuşabilir. (İslami örtünmeye riayet etmek şartıyla) 3. Utanılan hususları sormak caizdir. 4. İhtiyaç zamanı namahrem kadının sesini dinlemek caizdir. 5. Sorulan zat, büyük de olsa sorana cevap vermelidir. 6. Hayız halinde kadın, namazı bırakır. Sonra da kaza etmez. Hariciler müstesna, kimse bu hükme muhalefet etmemiştir. 7. Müstahaza kadın, hayız zamanında namaz kılmaktan men edilmiştir. Bu yasaklama haram kılmak içindir. Yani namaz kılması haram olup, kılsa bile fasittir. Yasaklık bakımından farz namaz ile nafile namaz eşittir. Ka'be'yi tavaf etmek, cenaze namazı, tilavet ve şükür secdeleri, Kur'an'a dokunmak ve camiye gitmek de namaz gibidir. 8. Hayız kanı necistir. Pislikleri gidermek gerekir. 9. Hayız kanı kesilir kesilmez, istithar yapmadan namaz kılmak caizdir.'' İİSTİTHAR: Kadının hayz süresi bittikten sonra, üç gün kadar her gün yıkanmasıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 355
			}
		}
	]
}