{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 627,
			"arabicnumber": 627,
			"text": "Hamne bint-i Cahş (r.anha)'dan rivayet edildiğine göre : Kendisi Resulullah (Sallallahu Aleyhi ve Sellem)'in zamanında müstahaza olmuş ve Resulullah (Sallallahu Aleyhi ve Sellem)'e gelerek : Şüphesiz ben nefret edilen ve çetin bir şekilde istihazaya tutulmuşum, dedi. Nebi (Sallallahu Aleyhi ve Sellem) O na: «Kan çıkan yere pamuk koy» buyurdu. Hamne. Ona: Gerçekten kan çok daha şiddetlidir. Benden çok fazla kan akıyor, dedi. Resulullah (Sallallahu Aleyhi ve Sellem) : «Kan akan yeri gem gibi bir bezle sıkıca bağla ve her ay, Allah'ın (kadınlar için) takdir ettiği altı gün veya yedi gün kendini hayızlı say. Sonra ğuslet ve yirmi üç veya yirmidört gün namaz kıi ve oruç tut. (İstersen) öğle farzını geciktir. İkindi farzını da ilk anda kıl ve iki namaz için bir ğusül yap. Akşam namazını da geciktir. Yatsıya acele et. Bu iki namaz için de bir ğusül yap. Bu son şekil, bence daha sevimlidir.» Diğer tahric: Beyhaki, Darekutni, Ahmed, Tirmizi' ve el-Hakim AÇIKLAMA : Tirmizi ve Ahmed hadis'in sahih olduğunu beyan etmişler. Hadisin metni bazı riv.ayetlerde uzun, bazılarında kısadır. Tirmizi'nin rivayetinde Nebi (s.a.v.)'e ait hadisin son, cevap kısmı mealen şöyledir: \"Ben sana. iki hüküm emredeceğim. Sen, bunlardan hangisini uygularsan sana yeterlidir. Eğer sen ikisini de yapabilirsen, artık sen bilirsin. Sen, bundan sonra altı veya yedi gün kendini hayızlı say. (Hayız süresinin altı veya yedi gün oluşu) Allah'ın ilmindedir. Sonra guslünü yap. Sen kendini hayızdan çıkmış ve temizlenmiş olarak görünce yirmidört veya yirmiüç gece ve gündüz namaz kıl ve oruç tut. Bu sana kafidir. Kadınlar hayız gördüğü ve hayız süresinin bitiminde temizlendikleri gibi sen de böyle yap. Gücün yetersa şöyle de yapabilirsin: Öğle farzını geciktirip ikindi farzını erken kılmak kaydıyla bu iki namaz için bir ğusül yap ve bunları kıl. Sonra, akşam liaımazını geciktir. Yatsı namazına acele et ve ğusledip bunları kıl. Sabah vaktiyle beraber ğuslet ve sabah namazını kıl. Böylece yap ve orucunu tut. Eğer bunu yapabilirsen bence daha çok beğenilir.'' Hamne r.anha'nın, gördüğü şiddetli istihaza kanı dolayısıyla vaki müracaatı üzerine Nebi (s.a.v.), önce pamuk kullanmasını tavsiye etmiş, fakat pamukla dinmesinin mümkün olmadığı söylenince bu defa kuvvetli bir bez ile kan yerinin sıkıca kapatılması emri verilmekle beraber; her ay altı veya yedi gün hayızlı sayılması, emri verilmiştir. Bu emir verilirken \" ... Altı veya yedi gün ... \" buyuruluyor. EI-Menhel yazarı, bu hadisin açıklamasında şöyle der: ''Yani altı veya yedi gün, namazı bırak ve hayızlı kadın şeklinde davran. ''Altı veya yedi gün ... \" tabirine gelince, ravinin tereddüdünden ileri geldiği söylenmiştir. Yani Nebi (s.a.v.) , altı gün mü buyurmuş, yoksa yedi gün mü buyurmuş? Bu hususta ravi şüphelidir. Şöyle de olabilir: Hamne Mu'tade idi. Eski adetinde altı gün mü, yedi gün mü? hayız gördüğünü unutmuş, bunun için Nebi (s.a.v.) Ona araştırıp ictihad yaptıktan sonra kanaatı bu iki sayıdan hangisine gelirse ona göre hayızını hesaplamasını istemiştir. ''Allah'ın ilminde... '' tabiri, bu ihtimali te'yid ediyor. Yani senin hayız sürenin altı veya yedi gün olduğunu Allah bilir, demektir. Bu tabirin muhayyerlik için olduğu da söylenmiştir. Buna göre Hamne serbest bırakılmıştır. Kendisini, dilerse altı gün, dilerse yedi gün hayızlı sayar. ''Yirmi üç gün veya yirmi dört gün ... \" tabirine gelince; bu ifade, çeşitlilik içindir. Yani hayız süresi yedi gün sayılırsa temizlik süresi yirmi üç gün sayılır. Şayet hayız süresi altı gün sayılırsa, temizlik süresi yirmi dört gün sayılır. Hamne'nin ğusletmesi mes'elesine gelince; bu hususta ona iki yol gösterilmiştir. Birincisi, kendisini hayızlı saydığı sürenin bitiminde bir defa ğusledip, namaz ve orucuna başlamasıdır. İkincisi, günde üç defa ğusletmesidir. Her gün sabah namazı için bir ğusül yapar, öğle farzını te'hir eder, ikindi namazı yaklaşınca ğusledip öğle farzını kılar. Biraz sonra ikindi vakti girince geciktirmeden hemen ikindi farzını da kılar. Böylece ikindi farzını toplamış gibi olur. Sonra akşam farzını geciktirir, yatsıya doğru ğusledip akşam farzını kılar. Yatsı vakti girince durmadan hemen yatsı namazını kılar. Her gün belirtilen şekilde üç defa ğusletmesinin daha iyi olduğu hadisin sonunda bildiriliyor. Tirmizi'nin, bu hadis bahsinde verdiği beyana göre İmam Ahmed b. Hanbel r.a. ve İshak b. Rahuye r.a. şöyle demişlerdir: Müstahaza kadın, hayız süresinin geliş ve gidişini anlayabiliyorsa onun hükmü, Fatime bint-i Ebi Hubeyş (r.anha)'nın hadisine göredir. Hayzın gelişi, kan'ın siyahlaşmasıyla; gidişi de, kan renginin sarıya doğru renk değiştirmesiyle bilinir. Eğer, müstahaza kadın bu hale düşmeden önceki hayız zaman ve süresini hatırlıyorsa, ona göre hayzıııı hesaplar. Hayız günlerinde namazı bırakır, süre bitince ğusleder ve her namaz için abdest alır, namaz kılar. Şayet müstahaza kadın, devamlı kan görür, hayız zaman ve süresini bilemez ve hayızın geliş ve gidişini kan rengiyle, tesbit edemezse onun hükmü Hamne bint-i Cahş (r.anha)'nın hadisine göredir, demişlerdir. Tirmizi'nin İmam Ahmed b. Hanbel ve İshak b. Rahuyye'den yaptığı nakil'den anlaşıldığı gibi Hamne, kan rengiyle hayız süresinin geliş ve gidişini bilememiştir. Keza, Hamne'nin istihaza hastalığına tutulmadan önceki zamanına ait, hatırladığı bir hayız adeti de, yokmuş, EI-Menhel yazarı El-Ayni'nin şöyle dediğini nakleder: 'Bu hadisin hükmü Ümmü Seleme r.anha'nın hadis hükmüne ve Aişe (r.anha)'nın hadis hükmüne muhalif'tir'. Hamne, yeni kan görmeye başlayan, renk ile vasıf bakımından gördüğü kanda bir farklılık bulamayan ve devamlı kan gören bir kadındır. Bunun için Resulullah (s.a.v.), onun durumunu kadınları ekseriyetle gördükleri adete döndürmüştür. EI-Menhel yazarı da hlidisin fıkıh yönünü açıklarken: Müstehaza kadın adetini hatırlamazsa ve kanı renklere göre ayıramazsa kadınların hayız ve temizlik hususundaki adetine göre hayız ve temizlik süresini hesaplar, demiştir. ALİMLERİN. ESKİ ADETİNİ UNUTUP KARIŞIK KAN GÖREN MÜSTEHAZA İLE YENİ KAN GÖREN MÜSTEHAZA HAKKINDAKİ GÖRÜŞLERİ 1- İmam Ebu Hanife'ye gore: a) Müstahaza olarak erginlik çağına gelen kadının hayzı şöyle hesaplanır: Her ay'ın ilk on günü hayız sayılır. Sonra ğusleder ve aydan kalan sürece namaz kılar. Her namaz vakti için abdest alır. b) Mu'tade olup eski adetinin zaman ve süresini unutan kadın, araştırıp ictihad eder ve kanaatına göre günlerini tesbit eder. Hayız ve temizlik arasında tereddüt ettiği zaman, her namaz vakti için abdest alır. Şayet hayızda mıdır? Temizlik halinde midir? Hayızlık süresi bitti de temizlik süresine mi geldi diye tereddüt ederse, bu tereddüdü duyduğu zaman, her namaz vakti için ğusleder, gayr-ı müekkede sünnetleri kılmaz, cami'ye girmez ve eşiyle cinsi münasebette bulunmaz. c) Eski adetinin zaman ve süresini unutup, yaptığı araştırma neticesinde hiç bir kanaata varmayan kadın mütehayyire (şaşkın) sayılır. Ne temizliğine. ne de hayzına hükmedilir. Bütün hükümlerde, en ihtiyatlı olanı tutar. Hayızlı kadın gibi namaz dışında Kur'an okumaz, Mushaf'ı ellemez, eşine yaklaşmaz, her namaz vakti için ğusleder, bu ğusül ile farz namazı ve vitir namazını kılar. Namazın sıhhati için gereken en az ayetleri okur. Fatiha ve sure vacib olduğu için, bunları okur, denmiştir. Hac yaptığı zaman ifada tavafını. yapar, çünkü o rükündür. On gün ara verdikten sonra tekrar ifada tavarını yapar, sonra veda tavafını yapar. Çünkü vacibtir. Ramazan orucunu tutar, sonra yirmi beş gün kaza eder. ' 2- İmam Şafii ye göre: a) Yeni kan görmeye başlayıp kanı kesilmemekle müstahaza olan kadın, gayr-i mümeyyize ise, yani kanı hep aynı durumda görüyorsa hayızdaki kadına haram olan namaz vesair şeyleri kanı gördüğü andan itibaren bırakacak, kan onbeş günde veya daha az zamanda kesilirse, kanın tamamı hayız sayılır. Eğer, onbeş günden fazla süre devam ederse, kan gördüğü ilk gün ve gece hayız ve kalan süre ay sonuna kadar temizlik sayılır. Bu nedenle ilk ayın birinci günü hariç, bütün günlerinin namazını kaza edecek ve ilk aydan sonra her ayın ilk günü hayız ve yirmidokuz günü temizlik sayılacak ve ilk günden sonra bütün namazlarını vaktinde eda edecek. b) Yeni kan görmeye başlayıp, kanı kesilmediğinden müstahaza sayılan kadın mümeyyize ise, yani kanı kuvvetli ve zayıf olarak görürse, duruma bakılacak; Eğer kuvvetli kan yirmidört saatten az bir zaman görülürse veya onbeş günden fazla süre devam ederse, yahut zayıf kan onbeş günü doldurmazsa, hüküm aynidir. Yani kan gördüğü ilk yirmi dört saati hayız ve ondan sonraki yirmi dokuz gün temizlik sayılır. İlk günden sonraki günlere ait namazları kaza edecek ve otuz günü dolunca her ayın ilk günü hayız yirmi dokuz günü müstahaza sayılıp, ibadetlerini yapacak. c) Müstahaza kadın, mu'tade ise, yani devamlı kan görmeye başlamadan önce, her ayın belirli günlerinde hayız görmekte ise fakat bu adetin zaman ve süresini unutmuş ise niyet etmenin şart olmadığı hususlarda hayızlı kadın hükmündedir. Niyet edilmesi şart olmayan işler; namaz dışında Kur'an okumak, Mushaf'ı ellemek, mescid'den geçmek, eşine yaklaşmak ve benzeri işlerdir. Boşamak ta ve niyetin şart olduğu namaz, oruç, tavaf ve itikaf gibi ibadetlerde temiz kadın gibidir. Müstahaza olmadan önceki zamanlarda, günün hangi saatinde kanının kesildiğini bilmiyorsa, her farzın vakti girdikten sonra o farz için ğusletmesi gerekir. Eğer eskiden günün hangi saatinde hayız kanının kesildiğini biliyorsa, mesela güneş battığı zaman hayız kanının kesilip ğuslettiğini hatırlıyorsa müstahazalık süresince güneş batınca ğusletmesi gerekir. Bu ğusül ile akşam namazını kılar. Diğer namazlar için yalnız abdest alır. 3- İmam Ahmed bin Hanbel'e göre: a) Müstahazalık haline tutulan kadın, mümeyyize ise, yani mesela kanı siyah ve kırmızı olmak üzere iki renkte görse fakat siyah kan yirmi dört saat'ten eksik veya onbeş günden fazla görüldüğü için, hayız sayılmaya elverişli olmazsa; b) Kadının bilinen. bir adeti yoksa ve mümeyyize de değilse, mesela hep aynı renkte kan görse; Bu iki ihtimalde her ayaltı veya yedi gün namazını vesair işlerini terkederek kendisini hayızlı sayacak. Sürenin altı veya yedi gün oluşunda ve bu sürenin ayın başına mı, ortalarına mı.. sonuna mı tesadüf etmesi hususunda kadının araştırması ve ictihadı esastır. Keza bu hususta kendisinin adetine veya yakını olan kadınların aybaşı adetine hangi zaman ve sürenin daha yakın olduğu hususunda veya hangi süredeki kan'ın hayız kanına daha çok benzediği hususunda kadının kanaati esastır. Bu esaslardan hareketle, kanaatına göre hayız süresi bitiminde ğusledet ve namaza başlar. Dört mezheb imamlarından yalnız Ahmed bin Hanbel'in, anlattığımız bu fetvasını terceme ettiğimiz hadis'e dayandırdığı görülmektedir. Diğer imamlar bu hadisle amel etmemişlerdir. Çünkü seneddeki ravilerden AbdulIah bin Muhammed bin Akil zayıf sayılmıştır. Görüşünü anlatmadığımız Maliki mezhebine gelince; o da şöyledir: 4- Malik'e göre, durumu üçüncü maddede belirtilen müstahaza kadının hayzı onbeş gün kabul edilir. Sonra ğusleder ve namaza başlar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 361
			}
		}
	]
}