{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"0": "The Book of the Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 64,
			"arabicnumber": 64,
			"text": "Ebu Hureyre Radiyallahu anh’den; demiştir ki; Bir gün Resulullah Sallallahu Aleyhi ve Sellem halk(ın yararlanması) için açık bir yere çıkmıştı. Bir adam O’na gelerek; -Ya Resulullah ! İman nedir? Diye sordu. Resulullah (Sallallahu aleyhi ve Sellem); -“İman; Allah’a, Meleklerine, Kitablarına, Nebilerine, Allah’a kavuşmaya inanman, bir de son dirilmeye inanmandır.” Buyurdu. Adam; -Ya Resulullah! İslam nedir? Diye sordu. Resulullah s.a.v. ; - ‘’ İslam; Allah’a ibadet etmen, O’na hiçbir şeyi ortak etmemen farz namazı dostoğru kılman, farz kılınan zekatı eda etmen ve Ramazan orucunu tutmandır.’’ cevabını verdi.Adam; Ya Resulullah! İhsan nedir? dedi. Resulullah s.a.v.; - ‘’ İhsan; Allah’a onu görüyorsun gibi ibadet etmendir. Çünkü sen O’nu görmüyorsun da O, şüphesiz seni görür. ‘’ buyurdu. Adam; Ya Resulullah! Kıyamet ne zaman kopacaktır? sorusunu sordu. Resulullah s.a.v. ; ‘’ Bu hususta sorulan, sorandan daha bilgili değildir. Ve lakin ben sana kıyametin alametlerinden haber vereyim ; Cariye, kendi sahabesini doğurduğu zaman işte kıyametin alametlerinden birisi budur. (Kim oldukları belirsiz) koyun çobanları yüksek bina yapmakta bir diğeri ile yarıştığı zaman işte bu da kıyametin alametlerindendir. Kıyamet'in kopma zamanı Allah’dan başka kimsenin bilmediği beş şeye dahildir.’’ buyurduktan sonra şu ayeti (Lokman suresinin 34. ayeti) okudu; ‘’Şüphesiz ki, kıyamet saatinin bilgisi Allah yanındadır. Yağmuru O yağdırır, rahimlerde ne varsa O bilir. Hiçbir kimse yarın ne kazanacağını bilmez. Hiçbir kimse hangi yerde öleceğini de bilemez. Şüphesiz ki Allah her şeyi hakkıyla bilir, her şeyden haberdardır.’’ BU HADİS’İN BUHARİ’DEKİ RİVAYETİ VE İBN-İ HACER İZAHI İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 0,
				"hadith": 64
			}
		}
	]
}