{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 641,
			"arabicnumber": 641,
			"text": "Aişe (r.anha)'dan rivayet edildiğine göre; Kendisi hayızlı iken (hac için ihrama gireceği zaman). Nebi (Sallallahu Aleyhi ve Sellem) Ona: «Saçları (nın örgüleri) ni çöz ve ğuslet » buyurdu.\" Ravi Ali kendi hadis rivayetinde dedi ki: -Başını çöz...- Not: Bu hadisin isnadındaki ricalin sika olduğu Zevaid'de bildirilmiştir. Sindi: Bu hadis Zevaid kısmından değildir. Bilakis. Buhari, Müslim ve başkalarında da mevcuttur, demiştir ... : AÇIKLAMA : Bu hadisi müellifimize Ebu Bekir bin Ebi Şeybe ve Ali bin Muhammed rivayet etmişlerdir. Ebu Bekir'in rivayetinde hadisin metni: ''Saçlarını çöz ... \" diye başlar. Ali'nin rivayetinde ise; ''başını çöz ... \" diye başlar. İki rivayet arasında mana itibariyle bir fark yoktur. Gaye, saçları tarayabilmek için örgüleri çözmektir. Bu hadis, hayız sonunda vacib olan boy abdesti ile ilgili değildir. Aişe (r.anha)'nın hayız hali devam ediyordu. Hac için ihrama girecekti. Nebi (s.a.v.), hayızlı halinin ihrama girmesine engel olmadığına işaretle temizlik için yıkanmasını ve bu cümleden olarak saçlarını tarayabilmesi için saç örgülerini çözmesini emretmiştir. Buhari, Müslim ve başka hadis kitapıarının ''Hac'' bahsinde bu hadis rivayet edilmiştir. Bu nedenle hayızın sonunda yapılması gerekli ğusle ait bu babta, bu hadisin niçin zikredildiği bilinmiyor. Sindi: ''Bu duruma temas ediyor, hayız'dan dolayı yapılacak ğuslün hükmü dolaylı olarak bu hadisten anlaşıldığı için müellifimiz burada rivayet etmiş, denilebilir,' demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 375
			}
		}
	]
}