{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 647,
			"arabicnumber": 647,
			"text": "Ümmü Atiyye (r.anha)'dan; şöyle demiştir: Biz (Nebi (Sallallahu Aleyhi ve Sellem) zamanında kandaki) sarılığı ve bulanıklığı (namaza mani olması bakımından) hiç bir şey olarak görmezdik. Muhammed bin Yahya dedi ki: Bize Muhammed bin Abdillah Er-Rakkaşi tahdis etti. Bize Vüheyb tahdis etti. O da Eyyub'den, o da Hafsa'dan, o da Ümmü Atiyye'den tahdis ettiğine göre Ümmü Atiyye (r.anha): Biz (Nebi (Sallallahu Aleyhi ve Sellem) zamanında) sarılığı ve bulanıklığı (namaza mani olması bakımından) hiç bir şey saymazdık. Muhammed bin Yahya dedi ki: Bizce bu rivayette Vüheyb için öncelik vardır.\" Diğer tahric: Beyhaki, Ebu Davud ve El-Hakim AÇIKLAMA : El-Hakim: Buhari ve Müslim'in şartları üzerine sahihtir, demiştir. El-İsmaili müstahricinde ve Darekutni de az bir lafız farkıyla rivayet etmişlerdir. Hadis, hayızlı kadının aybaşı adet günleri geçip temizlendikten sonra gördüğü sarılık ve bulanıklığın hayızdan sayılmadığı hakkındadır. Ümmü Atiyye: ''Biz, sarılığı ve bulanıklığı sayınazdık'' derken Nebi (s.a.v.)'in zamanında ve O'nun bilgisi altında bu renkleri hayızdan saymadıklarını anlatmak istemiştir. Kasıt bu olunca hadis merfu' hükmünde sayılır. Buradaki rivayette sarımtırak ve bulanık renklerin hayız süresinin bitiminden sonra olduğuna dair bir kayıt yoksa da Ebu Davud'un rivayetinde; ''Hayız günleri geçtikten sonra ... '' kaydı mevcuttur. EI-Menhel yazarı, bu kayıtla ilgili olarak: 'Kadın, ğusletmemiş olsa bile hayız süresi geçtikten sonra gördüğü sarılığın ve bulanıklığın hayızdan sayılmayacağı kasdedilmiştir. Darimi'nin rivayetinde bulunan; ... ''ğusülden sonra ... '' kaydı., çoğu zamandaki uygulamaya yorumlanır. Çünkü kan kesildikten sonra çoğu zaman kadın, hemen ğuslünü yapar. Hadis, hayız adeti dışında ve temizlik günlerinde görülen rrıezkur renklerin hayızdan sayılmayacağına delalet eder... Dolayısıyla. henüz adet süresi dolmadan görülen bu renklerin hayız'dan şayılacağını ifade eder.' demiştir. El-Menhel yazarı şu bilgiyi verir: ''Hattabi: 'Hayız adeti, kadın temizlendikten sonra görülen sarılık ve bulanıklık hakkında alimler ihtilaf etmişlerdir. 1- Ali (r.a.)'den rivayet edildiğine göre temizlik halinde görülen bu renkler, hayız değildir. Kadın namazını bırakamaz. Abdest alıp namaz'a devam eder. Süfyan-i Sevri ve Evzai'nin kavli de budur. 2- Said bin El-Müseyyeb: kadın, temizlik halinde bu renkleri görünce ğusledip namaz kılar demiştir. Ahmed bin Hanbel'in görüşü de budur. 3- Ebu Hanife: Kadın, hayız adetinden ve kan kesildikten sonra bir iki gün mezkur renkleri gördüğü zaman, hayız günleriyle beraber, toplam on günü geçmedikçe, hepsi hayız sayılır ve bu renkler kesilip, beyaz su görmedikçe temiz sayılmaz, demiştir. 4- Şafii mezhebinin meşhur kavIine göre kadın aybaşı adet kanı kesildikten sonra mezkur renkleri gördüğü zaman hayız günleriyle beraber, toplam süre onbeş günü geçmedikçe hepsi hayızdır.\" demiştir. El-Ayni : 'Arkadaşlanmızın delili Malik ve Muhammed bin El-Hasan'ın kendi Muvatta'larında Aişe (r.anha)'nın mevlası Ümmü Alkame'den rivayet ettikleri şu haberdir: ''Kadınlar, Aişe (r.anha)'ya. üzerinde hayız kanının sarılığı bulunan pamuk parçasını götürerek namaz kılıp kılamayacaklarını ona sorarlardı. Aişe (r.anha) da onlara: 'Acele etmeyiniz. Pamuğu kan yerinden çıkarırken, kireç gibi beyaz oluncaya kadar namaz kılmayın''' diyerek hayızdan temizlenmeyi beklemelerini emrederdi.'' demiştir. Muhammed: Biz bununla hükmederek kadın, kırmızı veya sarı veyahut bulanık renk gördükçe temizlenmez ve bembeyaz; renk görünce temizlenmiş olur, deriz, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 381
			}
		}
	]
}