{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 653,
			"arabicnumber": 653,
			"text": "Nebi (Sallallahu Aleyhi ve Sellem)'in (zevcesi) Meymune (r.anha)'den rivayet edildiğine göre : Kendisi hayızda iken Resulullah (Sallallahu Aleyhi ve Sellem), üzerinde bir futa olduğu halde namaz kıldı. Futan'ın bir kısmı O'nun üzerine bir kısmı da Meymune (r.anha) nın üzerindeydi.\" Tahric: Aişe (r.anha)'nın hadisini Müslim, Nesai ve Ebu Davud da rivayet etmişlerdir. Meymune (r.anha)'nın hadisini ise az lafız farkıyla Buhari, Müslim ve Ebu Davud da rivayet etmişlerdir. AÇIKLAMA : Müslim'in rivayetinde Meymune (r.anha) mealen şöyle demiştir: ''ResuluIlah (s.a.v.) namaz kılıyordu. Ben de hayızlı olarak, O'nun hizasında bulunuyordum. Kendisi secde ettiği zaman bazen elbisesi bana dokunuyordu.'' Hadiste geçen ''Mırt'' kelimesini ''Futa'' olarak terceme ettik. EI-Menhel'de rivayet edildiğine göre ''Mırt'' yün, keten ve başka şeylerden mamul elbisedir. Yalnız yeşil renkli olan elbiseye ''Mırt'' denir, diyenler de olmuştur. Mırt, rida ve izar olabilir. Yani vücudun üst kısmında kullanılan ceket, palto, manto, aba gibi elbise olabildiği gibi bedenin belden aşağısını örten elbise de olabilir. Mırt, erkek ve kadın elbisesi olabilir. Aişe (r.anha)'nın hadisinden anlaşıldığına göre Futa Aişe (r.anha)'ya aitti ve üzerindeydi. Onun bir kısmı namaza duran Nebi (s.a.v.)'in üzerindeydi. Meymune (r.anha)'nın hadisinde ise futa'nın Nebi (s.a.v.)'in üzerinde oldugu ve bir kısmının Meymune (r.anha)'nın üzerine bulunduğu belirtiliyor. HADİSLERİN FIKIH YÖNÜ : 1- Üzerinde kan veya başka necaset görülmedikçe hayızlı kadının elbisesi temizdir. 2- Kişinin, hayızlı hanımının bitişiğinde namaza durması caizdir. 3- Kişinin, bir tarafı hayızlı ailesinin üzerinde bulunan bir elbiseyle namaza durması caizdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 387
			}
		}
	]
}