{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 658,
			"arabicnumber": 658,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre şöyle söylemiştir : Ben, Nebi (Sallallahu Aleyhi ve Sellem)'i gördüm. Hüseyin bin Ali (r.a.)'in mübarek omuzunda taşıyordu. Hüseyin'in tükrüğü de Nebi (Sallallahu Aleyhi ve Sellem)'in üzerine akıyordu.\" Not: Zevaid'de isnadının sahih olup, ricalinin sahih hadis ricali olduğu bildirilmiştir, AÇIKLAMA : Hadisin zahirine göre Hüseyin (r.a.)'in ağzından akan tükrük, Nebi (s.a.v.)'in elbisesi üzerine akmıştır. Eğer necis olsaydı Nebi (s.a.v.) böyle yaptırmazdı. Bu durum, tükrüğün temizliğine delalet eder. İnsanın ağızından akan tükrük, aslında İslam alimlerinin ittifakıyla temizdir. Ağızın içi, başka bir nedenle pislenirse dolayısıyla tükrük de pislenmiş olur ki bu başka bir konudur. El-Fıkıh Ala'l-Mezahibi'l-Arbaa (Dört mezhebin fıkıh...) adlı kitabın 1. cildinin baş kısmında 'Temiz Maddeler, bahsinde şöyle deniliyar: 'Diri olan her şeyin göz yaşı, teri, tükrüğü ve sümkürüğü, mezheblerin beyanı vechiyle temiz sayılır. (Yani namaza mani değildir.) Şafiiler'e göre sayılan maddeler, eti yenen, yenmeyen ve şer'an temiz sayılan hayvanlara ait ise temizdir. Malikiler'e göre uyanıklık veya uyku halinde ağızdan akan tükrük, ittifakla caizdir. Fakat mideden ağıza gelen su necistir. Mide suyu renk veya kokusunun değişikliği ile tanınır. Mesela, akan su sarı olup pis kokuyarsa mideden gelmedir. Eğer kişi buna mübtela ise (kronik olarak geçmeyen rahatsızlığı var ise) kendisine af vardır. Aksi takdirde af yoktur. Hanbeli alimlerine göre, göz yaşı, ter, tükrük ve sümkürük, eti yenen hayvanlara ait ise temizdir. Eti yenmeyip kedi veya ondan küçük ise ve bir necasetten doğma değilse ona ait sayılan maddeler de temizdir. Hanefi alimlerine göre, dirinin ter ve tükrüğü temizlik ve necaset bakımından onun artığı gibidir. Yani artığı temiz olan canlının ter ve tükürüğü temizdir. Artığı necis olanınki ise necistir.' Şafii fıkhına ait Nihayetü'l-Muhtaç adlı kitabın ''Necaset'' babında ağızdan gelen su ile ilgili olarak özetle şöyle deniliyar: 'Uyuyan kişinin ağzından akan su, mideden gelme ise necistir. Bunun bir alameti, suyun sarımtırak ve pis kokulu oluşudur. Şayet mideden gelmiyorsa veya mideden gelme olup olmadığında şüphe edilirse onun temizliğine hükmedilir. Eğer bir şahıs mideden gelme su akmasıyla mübtela ise ondan af vardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 392
			}
		}
	]
}