{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 661,
			"arabicnumber": 661,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem), şöyle buyurdu demiştir: «Kadın, kadın avretine bakmasın. Erkek de, erkek avretine bakmasın.» Diğer tahric: Müslim, Ebu Davud, Tirmizi Nesai AÇIKLAMA : Tirmizi hadisin hasen - garib olduğunu bildirmiştir. Nevevi, bu hadisin açıklaması bahsinde şöyle der: \"Hadis, erkeğin erkek avretine, kadının da kadın avretine bakmasını haram kılmıştır. Erkeğin kadın avretine bakması ve kadının erkek avretine bakması da icma' ile haramdır. Bu haramlık, eş durumunda olmayanlar hakkındadır. Eşlerin ise, tenasül uzvu hariç, birbirlerinin avret mahalline bakmaları caizdir. Tenasül uzvuna bakmak hakkında üç kavil vardır. En sıhhatlı kavle göre iki taraf için de haram değil mekruhtur. İkinci kavle göre her ikisi için haramdır. Üçüncü kavle göre erkeğin bakması haram kadının ki mekruhtur. Cariye ile efendisinin birbirinin avret yerlerine bakmalarına gelince; Eğer cariye neseb süt veya kayınvalide, üvey kız ve oğlun karısı gibi sıhri nedenle kişiye haram durumunda ise, o cariye. efendisine karşı hür kadın gibidir. Mesela adamın cariyesi süt kardeşi ise veya kayınvalidesi ise o kadın, hür olan mahrem akraba gibidir. Yani o kadının avreti efendisi için göbek ile diz kapağı arasıdır,'Şayet cariyenin mezkur yakınlığı yoksa, kendisi ile efendisi, avret bakımından eşler gibidir. Adamın, mahremlerine bakması ve onların kendisine bakması ise, sahih kavle göre göbekten yukarı ve diz kapağından aşağı yerler için caizdir. Birbirlerinin göbek ile diz kapağı arasındaki yerlerine bakmaları caiz değildir. Birbirine yabancı olanların avret sınırına gelince: 1- Erkeğin erkeğe karşı avreti göbekle diz kapağı arasıdır. 2- Kadının kadına karşı avreti keza göbekle diz kapağı arasıdır. Göbek ve diz kapağının avretten sayılıp sayılmaması hakkında üç kavil vardır. En sahih kavle göre, ikisi de avret değildir. İkinci kavle göre ikisi de avrettir Üçüncü kavle göre göbek avrettir, diz kapağı avret değildir. 3- Erkeğin, yabancı kadının her hangi bir yerine bakması haramdır. 4 - Kadının, yabancı erkeğin her hangi bir yerine bakması haramdır. Erkeğin yabancı erkeğin her hangi bir yerine bakması haramdır. Erkeğin yabancı kadına veya kadının yabancı erkeğe bakması şehvetli olsun olmasın hüküm aynıdır. Bazı alimler: Kadının, erkeğin yüzüne şehvetsiz bakması haram değildir, demişlerse de, bu söz tutarlı değildir. Şafii'nin açıkça belirttiğine göre erkeğin parlak yüzlü olup henüz saç sakalı çıkmamış olan gence' bakması, şehvetli olsun olmasın, bir fitne korkusu olsun olmasın haramdır. Şafii'nin delili şudur ki; genç erkek, kadın anlamındadır. Çünkü kadına şehvetle bakıldığı gibi ona da bakılabilir. Güzellik bakımından icabında daha güzel olabilir. Hatta kadınlar hakkında yapılamayan kötülükler, onlar hakkında düşünülebillr. Yukarıda anlattığımız bakmak haramlığı, ihtiyaç olmadığı zamana aittir. Şer'i ihtiyaç bulunduğu zaman bakmak caizdir. Mesela, alış - veriş yaparken, tedavi olunurken, şahitlik yapılırken ve benzeri durumlarda bakmak zarureti vardır. Bu gibi ahvalde şehvetle bakmak haramdır. Çünkü şehvetle bakma zarureti yoktur. Şehvetle bakmak eşler ve cariye efendisi hariç, herkese haramdır. Hatta, kişinin anasına ve kızına şehvetle bakması haramdır .. Halkın çoğunun hamamlarda toplanması ve avret mahallini örtmeye dikkat etmemesi, bir bela halini almıştır. Oraya giden kimsenin gözünü başkasının avret mahalline bakmaktan koruması; avretini de başkasının gözünden koruması vacibtir. Örtünmeye riayet etmeyenleri görünce münasip tavır ve eda ile uyarıda bulunması vacibtir. Bir fitne 'çıkması korkusu olmadıkça, sözü dinlensin dinlenmesin bu gibi durumlara müdahale etmesi vacibtir. DÖRT MEZHEBE GÖRE AVRET MAHALLİ A - NAMAZ İÇİNDEKİ AVRET YERİ HAKKINDAKİ ALİMLERİN GÖRÜŞLERİ : 1- Hanefi alimlerine göre, namaz bakımından erkeğin avreti göbekten diz kapağının altına kadardır. Göbek, avretten değil, fakat diz kapağı ayrettendir. Cariye de erkek gibidir. Ayrıca karnı, sırtı ve yanları da avrettir. Hür kadının avreti ise, bütün bedenidir. Hatta kulaklarından aşağı sarkan saçları da ayrettir. Yalmz yüzü ve bileklere kadar elleri avret değildir. Ayakların üst kısmını da avretten istisna edenler vardır. 2- Şafiiler'e göre, namaz bakımından erkeğin ve cariyenin avreti göbek ile diz kapağı arasıdır. Göbek ve diz kapağı, avretten değildir. Bununla beraber, buralara bitişik avretin tam örtünülebilmesi için göbekten ve diz kapağından birer parçanın örtülmesi gerekir. Hür kadının avreti ise, bütün vücududur. Kulakıarından aşağıya doğru sarkan saç telleri de avrettir. Yalnız yüz ve bileklere kadar eller, avret değildir. 3- Hanbeliler, Şafiiler gibi avret yerlerini tesbit etmişlerdir. Ancak aralarında şu fark var: Hanbeliier'e göre hür kadının yalnız yüzü avret değil, bundan başka ,bütün vücudu avrettir. 4- Malikiler'e göre; Namaz bakımından erkek ve kadın avreti iki kısma ayrılır: Galiz avret, hafif avret. Galiz ve hafif diye adlandırılan avret çeşitlerinin hükmü de ayrıdır. Erkeğin galiz avreti, erkeklik uzvu ve mak'ad halkası ile-yumurtalarıdır. Göbek ile diz kapağı arasında kalan diğer yerler hafif avrettir .. Hür kadının galiz avreti baş, boyun, kollar, gögüs ve göğüsün hizasındaki arkaları ile diz kapağından ayak tırnağına kadar olan yerler hariç, bütün vücududur. Anılan bu yerler de hafif avrettir. Yüz ve bileklere kadar eller avret değildir. Cariyenin hafif avreti, erkeğin hafif avreti gibidir. Yalnız şu fark vardır: Cariye'nin kalçaları, onun hizasındaki yerler ve eteği de galiz ayretten sayılır. Galiz ve hafif ayret yerinin ne kadarının açılmasıyla namazın bozulacağını öğrenmek isteyenler, fıkıh kitabIarına müracaat etsinler. Çünkü geniş izahat ister. B- NAMAZ DIŞINDAKİ AVRET YERİ HAKKlNDAKİ ALİMLERİN GÖRÜŞLERİ : 1- Hanefi mezhebine göre erkeğin yabancı kadına bakması caiz değildir. Ancak, şehvetsiz olarak yüzüne ve bileklere kadar ellerine bakabilir. Eğer şehvetten emin değilse, bir ihtiyaç olmadıkça yüzüne bakması caiz değildir. Hakimin, şahidin, doktorun zaruret durumuna göre, bakmaları caizdir. Erkek, erkeğin göbek ile dizkapağı altına kadar olan yerlerine bakamaz. Göbekten yukarı ve diz kapağından aşağı yerlere bakabilir. Kadın da kadının göbek ile dizkapağı altına kadar olan yerlerine bakamaz. Göbekten yukarı ve diz kapağından aşağı yerlere bakabilir. Kadın, erkeğin göbek ile diz kapağı arasındaki yerine bakamaz. Diğer yerlere şehvetsiz olarak bakabilir. Erkek, zevcesinin ve cariyesinin her tarafına bakabilir. Erkek, mahremi olan kadının yüzüne, başına, göğsüne, dizkapağından aşağısına ve kollarına bakabilir. Fakat arkalarına, karnına ve diz kapağından yukarı kısmına bakamaz. 2 - Şafii mezhebine göre, erkeğin yabancı kadına bakması caiz değildir. Kadının yüzü ve elleri de avrettir. Bakılamaz. Ancak zaruret ve ihtiyaç halinde bakılabilir. Mesela hakim, şahid. evlenmek isteyen kişi ve doktor fıkıh kitabIarında belirtilen şartlar altında ve belirtilen yere bakabilirler. Erkek, erkeğin göbek ile diz kapağı arasındaki yerlerine bakamaz. Diğer yerlerine bakabilir. Kadın da, kadının göbek ile diz kapağı altına kadar olan yerlerine bakamaz. Diğer yerlere bakması caizdir. Kadının yabancı erkeğe bakması caiz değildir. Erkeğin. yabancı kadının yüzüne bakması nasıl haramsa. kadının erkeğin yüzüne bakması da aynı şekilde haramdır. 3- Maliki mezhebine göre erkek, erkeğin göbek ile diz kapağı arasındakı yerlerine bakamaz. Mahrem kadınlar da erkekler gibidir. Yani anne kız ve teyze gibi kadınlar. erkeğin diz kapağı ile göbek arasındaki yerlerine bakamazlar. diğer yerlerine bakabilirler. Yabancı kadın, erkeğin yüzüne, başına kol ve ayaklarına şehvetsiz olarak bakabilir. Şehvet korkusu varsa' bakamaz. Kadının bütün vücudu, yabancı erkekler için avrettir. Yalnız, bir fitne korkusu yoksa yüzüne ve bileklere kadar ellerine bakmak caizdir. Erkeklerin, mahremi olan kadınların, yüz, baş, boyun, kollar ve ayaklarına bakmaları caizdir. Diğer yerlerine bakmaları caiz değildir. 4- Hanbeli mezhebine göre kadının, mahremi olan erkeklere ve kadınlara karşı avreti diz kapağı arasıdır. Kadının yabancı erkeğe karşı avreti, yüz ve bileklere kadar elleri hariç, bütün vücududur. korkusu olduğu taktirde kadının yüz ve elleri de avrettir. Erkeğin erkeğe karşı avreti, göbekle diz kapağı arasıdır. Bütün mezhebIerde, tedavi gibi zaruret halinde avret mahalline lüzumu kadar bakmak caizdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 395
			}
		}
	]
}