{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"1": "The Book of Purification and its Sunnah"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 664,
			"arabicnumber": 664,
			"text": "Ali (r.a.)'den rivayet edildiğine göre şöyle demiştir: Bir adam. Nebi (Sallallahu Aleyhi ve Sellem)'e gelerek: Ben cünüplükten guslettim ve sabah namazını kıldım. Sonra sabahleyin vücudumdan bir tırnak yeri kadarının kuru kaldığını gördüm, dedi Nebi- (Sallallahu Aleyhi ve Sellem) : «Eğer sen, o yerin üzerine elini sürseydin (ve böylece o yerin üzerinden su geçmesini sağlamış olsaydın) sana kafi gelecekti.» buyurmuştur.\" Not: Ravi Muhammed bin Ubeydullah'ın zayıf olması sebebiyle isnadın zayıflığı Zevaid'de belirtilmiştir. AÇIKLAMA : Kütüb-i Hamse'de bulunmayan (yani kütüb-i sitteden sadece İbn-i Mace'nin rivayet ettiği) bu iki hadis ile ilgili olarak Sindi şöyle demiştir: 'İlk hadis, ğuslederken bir uzvun üzerindeki ıslaklık ve suyun, başka bir uzva nakledilmesi ve onun da bu suretle yıkanmasının caizliğine delalet eder. Bu hüküm, Hanefi alimlerinin kavline uygundur. Ğuslederken, kuru kalan yerin meshedilmesinin yeterliliği anlamı, hadisten çıkarılamaz. Bilakis Nebi (s.a.v.)'in Mubarek saçlarını sıkması suretiyle kuru kalan yer üzerinde suyun aktığı hadisten açıkça anlaşılıyor. İkinci hadiste geçen mesh'den maksad, yalnız ıslak elin kuru kalan yere sürülmesi suretiyle ıslatılması değildir. Gaye, ıslak elin sürülmesiyle kuru kalan yer üzerinden suyun kolayca akmasına yardımcı olunmasıdır. Bu nedenle ikinci hadiste de kuru kalan yerin meshedilmesinin kifayet edeceği manası yoktur.' Ğusül abdesti alınırken kuru kalan yerin daha sonra yıkanması ile ilgili, alimlerin görüşünü bundan sonraki bab'ta gelen hadislerin izahında belirteceğiz. İnşaallah! Bab'ın başlığında ve birinci hadisin metninde geçen ''Lum'a'' kelimesinin asıl manası, yeşil sahanın bir bölümüdür. Kuru iken alınan bir parça otun adı oldugu da söylenir. Bir de başka renk içinde bulunan beyazlık veya siyahlık yahut da kırmızıya da lum'a denir. Fıkıhçıların istılahında ise abdest veya ğusülde kuru kalan yere lum'a denir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 1,
				"hadith": 398
			}
		}
	]
}