{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"2": "The Book of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 673,
			"arabicnumber": 673,
			"text": "Cabir bin Semure (r.a.)'den rivayet edildiğine göre şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem) öğle namazını güneş (gök ortasından batıya) kaydığı zaman kılardı. Diğer tahric: Ahmed, Müslim ve Ebu Davud AÇIKLAMA : Ebu Davud'un rivayetinde: \"Güneş gök ortasından zail olunca Bilal öğle ezanını okurdu.'' denilmiştir. İki rivayetin ifade ettiği mana aynıdır. Dahd: Hadiste geçen ve bu mastardan türeme 'Dahat, fi'linin asıl manası kaymaktır. Burada maksat güneşin gök ortasından zail olması ve batıya doğru kaymasıdır. Güneşin kaydığı ve öğle vaktinin girdiğini anlamak için henüz güneş gök ortasına varmadan önce düzgün bir yere bir çubuk dikilir ve gölgesinin ucuna işaret konur. Gölge kısaldıkça henüz güneşin gök ortasına varmadığı anlaşılır. Gölge kısalması durduğu an güneş gök ortasına varmış olur. Bu ana 'İstiva, zamanı denir ve bu andaki gölgeye de 'İstiva, gölgesi denir. Bu andaki gölgenin ucunu işaretlemelidir. Çünkü o gölge ikindi namazı vaktinin hesaplanmasında lazım olur. Durgun olan gölge uzamaya başlayınca Güneş'in gök ortasından batıya doğru kaydığı anlaşılmış olur. İşte o zaman öğle vakti girmiş olur. O çubuğun gölgesi gittikçe uzar. Nihayet istiva gölgesinden başka. çubuğun gölgesi, çubuğun boyu kadar uzayınca öğle namazının vakti sona ermiş olur. Nevevi: Bu hadis, öğle namazını ilk vaktinde kılmanın müstahablığına delalet eder. Şafii ve cumhurun kavli de budur, demiştir. El-Ayni ise: Hadis, öğle namazının, ilk vaktinde kılınmasının müstahablığına delalet etmez. Çünkü hava serinleyinceye kadar öğle namazını geciktirerek kılan kişi de bu hadis gereğince güneşin zevalinden sonra namaz kılmış denilebilir, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 7
			}
		}
	]
}