{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"2": "The Book of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 697,
			"arabicnumber": 697,
			"text": "“... Ebû Hüreyre (radıyallahü anh)’den rivâyet edildiğine göre: (sallallahü aleyhi ve sellem) Hayber savaşından döndüğü zaman gece boyunca yolculuk etmiş, nihayet uykusu gelince gece yansına doğru konaklamış ve Bilâl (radıyallahü anh)'a) için bu geceyi sen koru. ) buyurmuştur. Bunun üzerine Bilâl (radıyallahü anh) kendisi için Allah tarafından takdir edildiği kadar namaz kılmakla meşgul olmuş, Resûlüllah (sallallahü aleyhi ve sellem) ve Ashâbı da uyumuşlardı. Fecir yaklaşınca Bilâl (radıyallahü anh), yüzünü fecre döndürerek bineği olan deveye yaslanmış sonra bineğe yaslanmış halde uykuya dalmış ve Güneş harareti onlara vuruncaya kadar, ne Bilâl (radıyallahü anh) ne de hiç kimse uyanmamış. Onların ilk uyananı Resûlüllah (sallallahü aleyhi ve sellem) olmuştur. Resûlüllah (sallallahü aleyhi ve sellem) uykudan sıçrayarak: (Ey Bilâl!) diye seslenmiş, Bilâl (radıyallahü anh) de : Babam annem sana feda olsun Yâ Resûlallah! Senin nefsini kudretinde tutan (Allah) benim nefsimi de tutmuş, dedi. (sallallahü aleyhi ve sellem) : (n yularlarından tutup arkanızdan) çekiniz, ) buyurmuş, Sahâbîler bineklerini çekerek biraz gitmişler sonra Resûlüllah (sallallahü aleyhi ve sellem) abdest almış ve Bilâl (radıyallahü anh)'a emretmiş, Bilâl (radıyallahü anh) namaz için ikamet etmiş. Peygamber (sallallahü aleyhi ve sellem) onlara sabah namazını kıldırmıştir. Peygamber (sallallahü aleyhi ve sellem) namazı kaza ettikten sonra: bir namazı unutursa onu hatırladığı zaman kılsın. Çünkü Allah Azze ve Celle;= (Beni andığın zaman namaz kıl. ) Tâha sûresi, ayet: 14 buyurmuştur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 31
			}
		}
	]
}