{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"2": "The Book of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 697,
			"arabicnumber": 697,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre: Resulullah (Sallallahu Aleyhi ve Sellem) Hayber savaşından döndüğü zaman gece boyunca yolculuk etmiş, nihayet uykusu gelince gece yarısına doğru konaklamış ve Bilal (r.a.)'a: «Bizim için bu geceyi sen koru.» buyurmuştur. Bunun üzerine Bilal (r.a.) kendisi için Allah tarafından takdir edildiği kadar namaz kılmakla meşgul olmuş, Resulullah (Sallallahu Aleyhi ve Sellem) ve ashabı da uyumuşlardı. Fecir yaklaşınca Bilal (r.a.), yüzünü fecre döndürerek bineği olan deveye yaslanmış sonra bineğe yaslanmış halde uykuya dalmış ve Güneş harareti onlara vuruncaya kadar, ne Bilal (r.a.) ne de hiç kimse uyanmamış. Onların ilk uyananı Resulullah (Sallallahu Aleyhi ve Sellem) olmuştur. Resulullah (Sallallahu Aleyhi ve Sellem) uykudan sıçrayarak: «Ey Bilal!» diye seslenmiş, Bilal (r.a.) de : Babam annem sana feda olsun Ya Resulallah! Senin nefsini kudretinde tutan (Allah) benim nefsimi de tutmuş, dedi. Resulullah (Sallallahu Aleyhi ve Sellem): «Bineklerinizi (n yularlarından tutup arkanızdan) çekiniz,» buyurmuş, Sahabiler bineklerini çekerek biraz gitmişler sonra Resulullah (Sallallahu Aleyhi ve Sellem) abdest almış ve Bilal (r.a.)'a emretmiş, Bilal (r.a.) namaz için ikamet etmiş. Nebi (Sallallahu Aleyhi ve Sellem) onlara sabah namazını kıldırmıştir. Nebi (Sallallahu Aleyhi ve Sellem) namazı kaza ettikten sonra: «Kim bir namazı unutursa onu hatırladığı zaman kılsın. Çünkü Allah Azze ve Celle; «...Beni anmak için namaz kıl» [Ta Ha 14] buyurmuştur.\" Bu savaş hicretin 8. yılı Muharrem ayında vuku bulmuştur. Ravi Yunus) demiştir ki: ibn-i Şihab. ayeti للذكرى olarak okumuştur. Diğer tahric: Müslim, Ebu Davud ve Beyhaki AÇIKLAMA : Hadiste geçen ''Keril'' kelimesi, uyuklamak demektir. Bazıları: Uykudur, demişlerdir. Bir de: Adamın uyku ile uyanıklık arası haline denir, diyenler vardır. Ta'ris: Yolcunun gecenin sonunda istirahat ve uyumak için konaklamasıdır. Cumhur böyle demiştir. Ebu Zeyd'e göre gece veya gündüzün her hangi bir vaktindeki konaklamaya ta'ris denir. Buhari'deki rivayete göre sahabiler konaklama arzusunu Nebi (s.a.v.)'e iletmişler, Nebi (s.a.v.) : ''Uykuda kalıp (sabah namazını) kaçırmanızdan korkarım.'' buyurmuş, Bilal (r.a.): Ben sizleri uyandırırım, demiştir. Nebi (s.a.v.), onlar için önce ihtiyatlı olanı tutmuş, sonra muhtaç olduklarını görünce konaklamalarına izin vermiştir. Nebi (s.a.v.); Bilal (r.a.)'a: ''Bizim için geceyi sen koru.'' emriyle, sabah namazını kaçırmamak için nöbet tutmasını istemiştir. Nebi (s.a.v.)'in uyanırken sıçraması, namazının kaçırılmasından dolayıdır. El-Asili: Müşriklerin müslümanları izlemeleri endişesi ile sıçradığını söylemişse de bu söz tutarsızdır. Çünkü siyer ehlinden hiç kimse böyle bir şey söylememiştir. Nebi (s.a.v.), tam bir zafer ik Hayber savaşından dönmüştü. Hiç bir düşmanın onları izlemesi söz konusu değildi. Nebi (s.a.v.)'in: ''Ya Bilal!'' diye seslenişi şu maksadladır: Yani niçin uyudun da sabah namazının vakti çıktı? İbn-i İshak'ın rivayetinde: ''Bize ne yaptın Ya Bilal?'' buyurmuştur. Buna benzer başka rivayetler de vardır. Bundan maksad Bilal (r.a.)'ın bir daha nefsine güvenmemesi ve benzer iddialardan kaçınmasıdır. Çünkü Buhari'nin rivayetinde geçtiği gibi Bilal (r.a.): Ben sizi uyandırırım, demişti. Sahabiler, Nebi (s.a.v.)'in emriyle binek hayvanlannın yularlarından çekerek az bir zaman yürüdükten sonra durup abdest almışlardır. Kaza namazı için ezan ve kamet edilir mi? Hadisin: ''Bilal (r.a.), sabah namazı için kamet etti.'' parçası, kaza namazı için kamet edilmesinin meşruluğuna delalet eder. Ezandan bahsedilmediğine göre ezan okunmaz. Malik , cedid (yeni-son) kavline göre Şafii ve Evzai böyle demişlerdir. Bundan başka delilleri. Ebu Said-i Hudri (r.a.)'un Hendek günü kaçırılan öğle, ikindi ve akşam namazı kaza edilirken yalnız kamet edildiğine dair hadisidir. Ebu Hanife. Ahmed ve Ebu Sevr'e göre hem ezan okunur, hem kamet edilir. Şafii'nin kadim (ilk) kavli de budur. Ve Şafii'nin arkadaşları bu kavliyle amel etmişlerdir. Bunların delili de bu olayın anlatıldığı Buhari ve Müslim'in rivayetleridir. Çünkü orada: ''Bilal (r.a.) namaz için ezan okudu. Sonra Resulullah (s.a.v.) iki rek'at namaz kıldı. Bundan sonra sabah namazını kıldırdı...'' buyurulmuştur. Süfyan-i Sevri'ye göre kaza namazı için ne ezan okunur ne de kamet edilir. Fakat onun sözü mevcut hadislerle reddedilmiştir. Birkaç namaz bir arada kaza edildiği zaman, Şafii alimleri ve Hanefiler'den Muhammed'e göre yalnız ilk namaz için hem ezan okunur, hem kamet edilir. Ondan sonraki namazlar için yalnız kamet edilir. Ebu Hanife'ye göre ezan da okunabilir. Hadiste anlatılan gün sabah namazı kaza edildikten sonra Nebi (s.a.v.) : ''Kim bir namazı unutursa.:.yani: Veya uykuda kalırsa, demektir, Nitekim 695 nolu Enes (r.a.)'in hadisinde; yine Enes (r.a.)'in Müslim'deki rivayetinde, 698 nolu Ebu Katade hadisinde ve Tirmizi'nin Ebu Katade'den olan rivayetinde: \" ... veya uykuda kalırsa ... '' cümlesi mevcuttur. Ravi burada unutma halini zikretmekle yetinmiş, uyku halini zikretmemiştir. Çünkü taksiratın ve şuurun olmayışı bakımından uyku da unutmak gibidir, UYUYA KALAN VEYA UNUTANIN KAÇIRDIĞI NAMAZI DERHAL KAZA ETMESİ GEREKİR Mİ ? Hadisin: ''Namazı hatırhıdığı zaman kılsın.'' parçası derhal kılınmasının vacibliğine delalet eder. Ebu Hanife, Ebu Yusuf, El-Müzeni ve El-Kerhi böyle demişlerdir. Delilleri bu hadis ve bundan sonra gelen Ebu. Katade hadisi ile daha önce geçen Enes'in hadisleridir. Şafii ve Malik'e göre daha sonra kaza edebilir. Onların delili de bu ve benzeri hadislerdir. Zira hadiste anlatılan gün güneş doğduktan sonra uyanınca Nebi (s.a.v.), sahabilerin o yerden hareket etmelerini emretmiştir. Eğer. derhal kaza edilmesi vacib olsaydı aynı yerde kaza etmeleri emredilecekti. Diğer taraftan mezkur parçada: ''..... hatırladığı zaman kılsın'' buyuruluyor. Hatırlama zamanı geniştir. Hatırladıktan sonra bir müddet ara verilip kılınırsa yine hatırlandığı zaman kılınmış olur.Hatırlandığı ilk anda kılmak müstahabtır. Verilen emir istihbab içindir. KASDEN NAMAZI TERKEDEN'İN KAZA ETMESİ VACİB Mİ ? Kasden namazı terkedenin kaza etmesinin vacibliği hadisten anlaşılıyor. Cumhurun görüşü budur. Cumhura göre bu hadislerde namaz'ın kaza edilmesi, unutmak ve uykuda kalmakla kaydedilmiş ise de, bu kayıtlamadan maksad, bilerek kazaya bırakanın. kaza etmemesi değildir. Anılan özre binaen namazı kazaya bırakan .kişi kaza etmekle mükellef olunca, özürsüz olarak namazı kaçıran kimse kaza etmekle yükümlü tutulmaz mı? Bu hüküm Kur'an-ı Kerim'in ''Baba ve anneye öf deme'' emrine benzer. Baba ve anneye öf demek yasaklanınca bu sözden daha ağır olan sövmek ve dövmek gibi davranışlar haydi haydi yasak kılınmış oluyor. Bilerek namazı kaçıranın, unutarak veya uykuda kalarak kaçırandan farkı şudur ki : Bilerek kaçıran kişi kaza etmekle mükellef olmakla beraber, bununla günahtan kurtulamaz. Bununla beraber kaza etmesi, faydadan hali değildir. Hadisin sonundaki ayete gelince; Bu ayetin sonundaki kelime meşhur kıraate göre للذكرى dir . Bu kıraatın zahirine göre ayet hadis konusu münasip görülmüyor. Çünkü zahirine göre ayetin manası şudur: \"Beni anmak için namaz kıl..\" Bu yoruma benziyen bir kaç yorum şekli rivayet olunmuştur. Bunlardan bir kısmı şunlardır: 1- \"Namaz kıl ki ben seni överek anayım.\" 2- ''Zikir (namaz) vakitlerinde namaz kıl..\" 3- \"Ben, anlatıp emrettiğim için namaz kıl..\" 4- ''İhlaslı olarak beni anmak için namaz kıl.\" Sindi: Ayetin hadisle uygunluğunu sağlamak için bazı alimler ayeti şöyle yorumlamışlardır: ''Ben (im namazım)i hatırladığın vakit namaz kıl.\" veyahut \"Beni hatırladığın (yani namazımı hatırladığın) vakit namaz kıl.\" . Her iki taktirde \"Zikr\" kelimesinin başında cer harfi olan \"lam\" tevkİt içindir. Yani vakit ifade eder. Birinci yorum şekline göre zikir kelimesi ile mütekellim zamiri arasında salat kelimesi mahfuzdur. İkinci yorum şekline göre zikirden maksad namazdır. İbn-i Şihab'ın kıraatına göre ayetin hadisle münasebeti açıktır. Çünkü; ذكرى kelimesi hatırlamak demektir. Başındaki cer harfi tevkit içindır. Ayetin tefsiri şudur: ''Hatırladığın zaman namaz kıl... HADİSİN FIKIH YÖNÜ : 1- İhtiyaç halinde istirahat etmek ve uyumak meşrudur. 2- Önemli işler için nöbet tutturulmalıdır. 3- Nebilik görevine noksanlık getirmeyen beşeri arızaların Nebi (s.a.v.)'de görülmesi mümkündür. 4- Mazeret dolayısıyla va'dini yerine getirmeyenin mazeretini kabul etmek meşrudur. 5- Şeytan yatağı olduğu sanılan yerden başka yere geçmek meşrudur. 6-Kaçırılan namaz kaza edilmelidir. 7- Kaza namazı için kamet edilmelidir. 8- Kaza namazının cemaatle kılınması meşrudur. 9- Alimler. dini hükÜmleri başkalarına öğretmelidirler. 10- Unutulan namaz hatırlandığı zaman kaza edilmeli, keza uykuda kalınarak kazaya kalan namazı uyandıktan sonra kılınmalıdır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 31
			}
		}
	]
}