{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"2": "The Book of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 701,
			"arabicnumber": 701,
			"text": "Ebu Berze el-Eslemi (r.a.)'den rivayet edildiğine göre şöyle demiştir : Resulullah (Sallallahu Aleyhi ve Sellem), yatsı namazını tehir etmeyi müstahab görürdü. Yatsı namazından önce uyumaktan ve yatsı namazından sonra konuşmaktan kerahet ederdi.\" Zevaid de: ‘’Bu hadis’in isnadı sahih, ravileri sikadır’’ deniyor. Tahric: Bu hadisi Kütüb-i Sitte sahipleri kısa ve uzun metinler halinde rivayet etmişlerdir. AÇIKLAMA : Tirmizi, Nebi (s.a.v.)'in yatsı namazından önce uyumaktan ve namazdan sonra konuşmaktan kerahet ettiğine dair Ebu Berze (r.a.) hadisini naklettikten sonra bunun hasen - sahih olduğunu söylemiştir. Oradaki rivayette yatsı namazının tehirinden bahsedilmiyor. Tirmizi, bu arada: İlim ehlinin ekserisi, yatsı namazını kılmadan önce uyumayı mekruh görmüşlerdir. Bazı alimler buna ruhsat vermişlerdir. Abdullah bin El-Mübarek, hadislerin ekserisinin kerahete delalet ettiğini ve bazı alimlerin Ramazan ayına mahsus olmak üzere yatsıdan önce uyumaya ruhsat verdiklerini söylemiştir, der. Ebu Davud'un rivayetinde yatsı namazının geciktirilmesi ile ilgili parça şnyledir ; ''o; yatsı namazını gecenin üçte birine kadar geciktirmeye iltifat etmezdi.\" EI-Menhel yazarı, hadisin açıklamasıyla ilgili olarak şöyle der: ''Nevevi: Yatsı namazını kaçırmak endişesi olmadığı takdirde uykusu fazla gelen kişinin yatsıyı kılmadan uyuması mekruh değildir, demiştir. İbn-i Seyyidin-Nas, Tirmizi şerhinde: Yatsı namazından önce uyumayı mekruh gören alimler, durumu ciddi göstermişlerdir. Ömer, oğlu AbduIlah ve İbn-i Abbas (r.anhum), bu görüşteki alimlerdendirler. Malik de bu yoldan gitmiştir. Ali ve Ebu Musa (r.a.)'nın dahil olduğu bir grup alim, uyumayı caiz görmüşlerdir, Kufelilerin mezhebi de budur. Bazı alimler de: Uyuyan kişinin yanında, kendisini namaz için uyandıracak birisinin bulunması halinde uyumakta kerahet yoktur, demişlerdir. İbn-i Ömer (r.a.)'den bu görüş de rivayet edilmiştir. Tahavi de bu yola gitmiştir. İbnü'l-Arabi: Yatsı vakti çıkmadan önce uyanacağını alışkanlığıyla bilen kişi, veyahut onu uyandıran bir kimse bulunduğu takdirde yatsı namazını kılmadan uyuyabilir, demiştir. Uyumanın kerahetine hükmedenler, bu babtaki hadisi delil göstermişlerdir. Mekruh olmadığına hükmedenler ise Buhari ve başkasının rivayet ettikleri Aişe (r.anha)'nın şu mealdeki hadisini delil göstermişlerdir: ''Nebi (s.a.v.), yatsı namazını geciktirdi. Hatta Ömer (r.a.), O'na seslenerek kadınların ve çocukların uyuduğunu haber verdi. Nebi (s.a.v.) uyuyanlara itiraz etmedi.\" Diğer bir delil de, İbn-i Ömer (r.a.)'in şu mealdeki hadisidir: ''Nebi (s.a.v.), bir gece meşgul olduğundan yatsı namazını geciktirdi. Hatta biz mescidde uyuduk. sonra uyandık. Daha sonra uyuduk. Sonra uyandık. Nebi. (s.a.v.) çıkıp yanımıza geldi. Nebi (s.a.v.) uyuyanlara itiraz etmedi.\" İbn-i Seyyidin-Nas: Ben, Sahabrlerin mescidde namazı beklerken uyuklamalarını yatsı namazından önce nehyedilen uyku şeklinden görmüyorum. O, uyku değil, bir uyuklamadır, demiştir. (Haddim olmayarak şöyle de denilebilir kanaatindeyim: Yatsı namazını kılmadan uyuma yasaklığının sebebi yatsı namazını kaçırma endişesi ise, bu endişe, yatsı namazını cemaatle kılmak için camide toplanmış olan bir cemaat için pek söz konusu olmasa gerek.) Yatsı namazından sonra konuşmaya gelince; Nebi (s.a.v.), yatsı namazı kılındıktan sonra Dünya ile ilgili şeyleri konuşmaktan kerahet ederdi. Fakat yatsı vakti girip de henüz yatsı namazı kılınmamışken, bu tür konuşmadan kerahet etmezdi. Namaz kılındıktan sonra konuşma kerahetinin sebebi, günlük işin sonucunun ibadetle kapanma arzusudur. Çünkü uyku, ölümün kardeşidir. Yatsı namazından sonra konuşmanın kerahetine hükmeden alimler arasında bulunan Said bin El-Müseyyeb: Yatsı namazını kılmadan uyumak, yatsıyı kılıp, arkasında boş laf etmekten bence daha sevimlidir, demiştir. Ömer bin El- Hattab (r.a.) yatsı namazından sonra Dünya ile ilgili konuşmalara dalan halkı döverek: Gecenin ilki konuşmakla ve sonu uykuyla mı? derdi. Sebebi de yatsı namazından sonra konuşmak, uykusuz kalmaya sebebiyet verebilir.. Bu takdirde geç uyuyan kişinin, gece namazını veya sabah namazını kaçırma endişesi doğar. Diğer taraftan gece uykusuz kalmak, gündüz din ve dünya ile ilgili işleri de aksatır. Nevevi: Yatsı namazından sonra Siretü'l-Battal, Antere ve benzeri uydurma hikayeleri okumak haram konuşma türündendir. Ama hayırlı bir iş hakkında konuşmak veya bir mazeret dolayısıyla söz söylemek mekruh değildir, demiştir. El-Hafız da: Bu kerahet, mutlak bir işe ait olmayan konuşmalara mahsustur, demiştir. Yukarıda yapılan nakillerden anlaşılıyor ki, yatsıdan sonra mekruh olan konuşma, yararlı olmayan şeylerle ilgili konuşmadır. Ama ilmi çalışma, salihlerin hikayelerini anlatmak, kişinin çoluk çocuğu ile konuşması, misafirlerle gerekli şeyleri görüşmek ve müslümanların masIahatları hakkında konuşmak mekruh değildir. Çünkü Tirmizi'nin rivayet ettiğine göre, Ömer (r.a.) : Nebi (s.a.v.), müslümanların işleri hakkında Ebu Bekr (r.a.) ile geceleyin görüşürdü. Ben de, Onlarla beraber bulunurdum, demiştir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 35
			}
		}
	]
}