{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"2": "The Book of the Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 704,
			"arabicnumber": 704,
			"text": "(Abdullah) İbn-i Ömer (r.a.)'den rivayet edildiğine göre şöyle demiştir : Ben, Resulullah (Sallallahu Aleyhi ve Sellem)'i şöyle buyururken dinledim : «Araplar (şu) namazınızın adında size galebe etmesinler. Çünkü O(nun adı) 'İşa'dır. Ve araplar, develer sebebiyle (o namazı) gece karanlığına tehir ederek ona Ateme ismini verirler.»\" AÇIKLAMA : Ateme: Gece karanlığıdır. Araplar yatsı namazına Ateme diyorlardı. Bu hadisi Müslim'de Abdullah bin Ömer (r.a.)'den iki senedIe ve biraz lafız farkıyla rivayet etmiştir. Oradaki bir rivayet, mealen şöyledir: ''Araplar şu yatsı namazının ''İşa'' isminde size galebe çalmasınlar. Çünkü O(nun ismi) Allah'ın kitabında İşa'dır. Ve o namaz, develerin sağılması sebebiyle gece karanlığına tehir edilerek. ona ''Ateme ismi verilir.'' Hadisi bu lafızIa El- İsmaili Müstahrec'inde Ebu Mes'ud Razi'den, Ebu Ya'la ile Beyhaki de Abdurrahman bin Avf'tan rivayet etmişlerdir. Buhari, AbduIIah El-Müzeni (r.a.)'den rivayet ettiğine göre Nebi (s.a.v.) şöyle buyurmuştur: ''Araplar akşam namazının Mağrib isminde size galib gelmesinler. Araplar. akşam namazına İşa derler.'' Arapların akşam namazına İşa ismini verdiklerine ait hadisin son cümlesinin ravi AbduIlah El-Müzeni'ye ait olması muhtemeldir. Müellif, Müslim ve yukarıda adları anılan zatların rivayet ettikleri hadisler ile Buhari'deki hadisten anlaşılıyor ki; Araplar akşam namazına ''İşa'' ve yatsı namazına ''Ateme'' diyorlarmış. Bir de Araplar akşam ile yatsı namazının ikisine ''lşaeyn = iki lşa'' derlermiş. Nevevi, Müslim'in şerhinde şöyle der: ''Hadisin manası şudur: 'Araplar, yatsı namazına Ateme ismini verirler. Çünkü araplar, develeri sağmakla meşgul olduklarından dolayı yatsı namazını şiddetli karanlığa tehir ederlerdi. Halbuki AIlah'ın kitabında; ''....ve yatsı namazından sonra ... ''[Nur 58] ayetinde ''İşa'' olarak geçer. Bu sebeple siz Ona İşa demelisiniz. '' Sahih hadislerde yatsı namazının ismi Ateme diye geçmiştir. Nebi (s.a.v.) yatsı namazına bir taraftan Ateme isminin verilmemesini emrediyor; diğer taraftan kendileri bu namaz hakkında ''Ateme'' ismini kullanıyor, diye bir istifham hatıra gelebilir. Buna iki şekilde cevap verilir: 1- Ateme isminin verilmesine ait yasaklama tenzihen kerahet içindir. Tahrim için değildir. Ateme isminin kullanılabileceğini beyan için Nebi (s.a.v.) kullanmıştır. 2- O günkü Araplar yatsı namazına İşa adının verildiğini bilmedikleri ve İşa denilince akşam namazını anladıklarından dolayı bir yanlışlığa meydan verilmemesi için Nebi s.a.v. yatsı namazı hakkında Ateme ismini kullanmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 2,
				"hadith": 38
			}
		}
	]
}