{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 706,
			"arabicnumber": 706,
			"text": "“... Abdullah bin Zeyd (bin Abd-i Rabbih) (radıyallahü anh)’den rivâyet edildiğine göre şöyle demiştir : (sallallahü aleyhi ve sellem) namaza davet için borazanı arzulamış ve çan ittihazını emretmiş ve çan yapılmıştı. Sonra (mezkûr) Abdullah bin Zeyd rüya görmüş ve rüyasını şöyle anlatmıştır : Ben rüyamda üzerinde iki yeşil elbise bulunan bir adam gördüm. Bir çan taşıyordu. Ona: Ey Allah'ın kulu! Şu çanı satar (mı) sın? dedim. Adam: Bununla ne yapacaksın? diye sordu. Ben: Onunla namaza çağırırım, dedim. O: Seni şu çandan daha hayırlı bir şeye delâlet etmiyeyim mi? dedi. Ben : Delâlet edeceğin şey nedir? diye sordum. Adam: Şunu söylersin, dedi : demiştir ki: Abdullah bin Zeyd, bu rüyadan sonra sabahleyin çıkarak Resûlüllah (sallallahü aleyhi ve sellem)'in yanına varmış ve gördüğü rüyayı ona anlatmak üzere: Resûlallah! Ben rüyamda üzerinde iki yeşil elbise bulunan bir adam gördüm. Bir çan taşıyordu.' demiş ve gördüğü rüyayı anlatmıştır. Bunun üzerine Resûlüllah (sallallahü aleyhi ve sellem) sahâbilere : arkadaşınız bir rüya görmüştür. ) buyurduktan sonra (rüya gören Abdullah'a) : ile beraber mescide çık da gördüğün ezan kelimelerini ona öğret. Bilâl da çağırsın. Çünkü Onun sesi, seninkinden daha gürdür. ) buyurdu. Abdullah demiştir ki: Ben Bilâl’le mescide çıkarak Ona ezan kelimelerini öğretmeye başladım. O da o kelimelerle çağırıyordu. Bunun üzerine Ömer bin El Hattab ezan sesini işitince çıkageldi ve : ‘Yâ Resûlallah! Vallahi Abdullah'ın rüyada gördüğünün mislini ben de rüyamda görmüştüm’ dedi. . Ebû Ubeyd demiştir ki ( (Rüya sahibi) Abdullah bin Zeyd El-Ensârî (radıyallahü anh)’in bu rüya hakkında aşağıdaki şiirleri söylediğini Ebû Bekir El-Hakemi bana haber vermiştir. için, celâl ve ikram sahibi Allah'a çokça hamd ederim. bana ezanı Allah'tan bir müjdeci getirdi. Benim yanımda o ne güzel müjdecidir. kelimelerini üç gece üstüste bana getirdi. Her gelişinde öğrendiğimi daha da pekiştirdi",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 1
			}
		}
	]
}