{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 709,
			"arabicnumber": 709,
			"text": "Ebu Mahzure (r.a.)'den rivayet edildiğine göre şöyle demiştir: Nebi (Sallallahu Aleyhi ve Sellem), bana ezanı ondokuz kelime olarak, ikameti de onyedi kelime olarak öğretmiştir. Ezanı İkamet onyedi kelimedir (Ezan şöyledirJ (اللَّه أكبر، اللَّه أكبر، اللَّه أكبر، اللَّه أكبر. Allahu ekber, Allahu ekber, Allahu ekber, Allahu ekber أشهد أن لا أله إلا اللَّه، أشهد أن لا أله إلا اللَّه. Eşhedu en la ilahe illallah, Eşhedu en la ilahe illallah, أشهد أن مُحَمَّداً رسول اللَّه، أشهد أن مُحَمَّداً رسول اللَّه. Eşhedu enne Muhammeden Resulullah, Eşhedu enne Muhammeden Resulullah حي على الصلاة، حي على الصلاة. Hayya ale’s-selah, Hayya ale’s-selah, حي على الفلاح، حي على الفلاح. Hayya ale’l-felah, Hayya ale’l-felah, اللَّه أكبر، اللَّه أكبر. لا إله إلا اللَّه)). Allahu ekber, Allahu ekber, la ilahe illallah (Kamet şöyledir:) (اللَّه أكبر، اللَّه أكبر، اللَّه أكبر، اللَّه أكبر. Allahu ekber, Allahu ekber, Allahu ekber, Allahu ekber أشهد أن لا أله إلا اللَّه، أشهد أن لا أله إلا اللَّه. Eşhedu en la ilahe illallah, Eşhedu en la ilahe illallah, أشهد أن مُحَمَّداً رسول اللَّه، أشهد أن مُحَمَّداً رسول اللَّه. Eşhedu enne Muhammeden Resulullah, Eşhedu enne Muhammeden Resulullah حي على الصلاة، حي على الصلاة. Hayya ale’s-selah, Hayya ale’s-selah, حي على الفلاح، حي على الفلاح. Hayya ale’l-felah, Hayya ale’l-felah, قد قامت الصلاة، قد قامت الصلاة. Ked kametus-salah, ked kametu’s-salah اللَّه أكبر، اللَّه أكبر. لا إله إلا اللَّه)). Allahu ekber, Allahu ekber, la ilahe illallah Tahric: Bu hadisi Ahmed. Nesai. Ebu Davud. Darimi, Darekutni, El-Hakim, Taberani, Şafii ve Beyhaki de rivayet etmişlerdir. Beyhaki bir kaç yönden zayıf olduğu hakkında konuşmuşsa da İbn-i Dakiki'l-İyd onun söylediklerini reddederek hadisin sahih olduğunu söylemiştir. Tirmizi de, hadisi rivayet ederek hasen - sahih olduğunu söylemiştir. AÇIKLAMA : Hadisin manasına gelince: Hadiste geçen kelimeden maksad, cümledir. Yani ezan 19 cümleden ibarettir. Terci'e ait dört cümle de bu sayıya dahildir. Şafii alimleri ve ilim ehlinden bir cemaat ezanın ondokuz cümleden ibaret olduğuna, bu hadise dayanarak hükmetmişlerdir. Ebu Hanife, Sevri ve Ahmed, ezanın 15 cümleden ibaret olduğuna hükmetmişlerdir. Onların delili, AbduIIah bin Zeyd (r.a.)'in (706 nolu) hadisidir. Bu alimler, terci'e ait dört cümleyi saymamışlardır. EI-Menhel yazarı, ezan keyfiyetine ait babta rivayet olunan Ebu Mahzure'nin mezkur hadisini açıklarken özetle şöyle der: ''Ebu Mahzure'nin hadisiyle amel etmek, AbduIlah bin Zeyd'in hadisiyle amel etmeye şu sebeplerden dolayı takdim edilir: 1- Ebu Mahzure'nin hadisi, AbduIlah bin Zeyd'in hadisinden tarih bakımından sonradır. Çünkü Abdullah bin Zeyd'in hadisi Hicretten. sonra Müslümanlar Medine'de.; yerleşince buyurulmuştur. Halbuki Ebu Mahzure'nin hadisi, Hicretin 8. yılına aittir. 2- Ebu Mahzure'nin hadisinde, terci'e ait dört cümle ilavesi vardır. Sika ravinin ilavesi makbuldür. 3- Ebu Mahzure'ye ezanı bizzat Nebi (s.a.v.) telkin buyurmuştur. 4- Mekke ve Medine halkının ameli, Ebu Mahzure'nin hadisine göredir. İmam Malik'e göre, ezan on yedi cümleden ibarettir. Çünkü ona göre ezanın başında iki defa tekbir alınır. Ona göre de terci' vardır. İmam Malik'in delili Müslim'in Ebu Mahzure (r.a.)'den yaptığı rivayettir. O rivayette tekbir iki defa tekrarlanmıştır.'' Kamet'in onyedi cümle olduğu hususuna gelince; EI-Menhel ynzarı bu konuda da şöyle der: ''Hadis, ikamet'e ait cümlelerin çift olduğuna delildir. Yalnız tevhid kelimesi tektir. Ebu Hanife, Sevri ve İbnü'l-Mübarek. bununla hükmetmişler. Delilleri de bu hadistir. Buna göre tekbir cümlesi dört defa, diğer cümleler ikişer ikişer defa tekrarlanır. Tevhid kelimesi bir defa okunur. Malik'e göre kamet on cümledir. Buna göre tekbir cümlesi iki defa tekrarlanır. Diğer cümleler birer defa okunur. Şafii'nin kavl-i kadimi (ilk görüşü) de böyledir. Bu görüşün mesnedi ise Buhari, Müslim ve başkalarının Enes'ten rivayet ettikleri şu mealdeki hadistir: \"Ezanı çift ve kameti tek cümlelerle okumak üzere Bilal (r.a.)'e emredilmiştir.'Bir de Medine halkının uygulamasına dayanılmıştır. Şafii'ye göre kamet 11 cümleden ibarettir. Buna göre tekbir cümlesi ve; Ked kametu's-selah cümlesi ikişer defa tekrarlanır. Diğer cümleler birer defa okunur. Ömer bin El-Hattab, oğlu Abdullah, Enes, Hasan-ı Basri, Zühri, Mekhul. Evzai, Ahmed, İshak, Davud ve İbnü'l-Münzir'in kavli budur. Bunların delili, Buhari'nin Enes (r.a.)'den rivayet ettiği şu mealdeki hadistir:. ''Ezanı çift ve; ''Ked kametu's-selah'' cümlesi, hariç, kameti tek okuması için Bilal (r.a.)'e emredilmiştir.' Bir de İbn-i Ömer (r.a.)'den rivayet olunan ve Enes (r.a.)'in hadisine benzeyen hadis'e istinad etmişlerdir. Enes (r.a.)'in hadisi ve kametin tek cümlelerle okunması ile ilgili tamamlayıcı bilgi 6 nolu ''Kamet'' babında verilecektir. İnşaallah",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 4
			}
		}
	]
}