{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 717,
			"arabicnumber": 717,
			"text": "Ziyad bin el-Haris es-Sudai (r.a.)'den rivayet edildiğine göre şöyle söylemiştir: Ben, bir yolculukta Resulullah (Sallallahu Aleyhi ve Sellem)'in beraberindeydim. Bana emretti. Ben ezan okudum, sonra Bilal (r.a.) ikamet etmek istedi. Resulullah (Sallallahu Aleyhi ve Sellem) : «Suda'nın kardeşi ezan okumuştur. Kim ezan okursa o ikamet eder.» buyurmuştur.*' Diğer tahric: Ahmed, Tirmizi, Ebu Davud ve Beyhaki AÇIKLAMA : İsnadındaki ravilerden El-İfriki (Abdurrahman bin Ziyad)'ın zayıf olduğu Yahya bin Sa'd, El-Kattan ve Ahmed tarafından söylenmiş ise de, Buhari sika olduğunu beyanı ile onun durumunu kuvvetlendirerek mukaribü'l-hadis olduğunu söylemiştir. Tirmizi de: İlim ehlinin ekserisinin uygulaması, ezan okuyan tarafından kamet edilmesidir, demiştir. Sindi: 'Alimlerin bu hadisi kabul ederek uygulamaları hadisi takviye eden nedenlerdendir. Bu sebeple hadis delil olmaya elverişlidir. Onun için Ebu Davud hadisin zayıflığı hakkında bir şey söylememiştir', demiştir. Ebu Davud'un sünenindeki rivayet daha uzundur. Bu rivayet mealen şöyledir: ''Ziyad bin El-Haris es-Sudai'den rivayet edildiğine göre şöyle söylemiştir: Sabah namazı için birinci ezan vakti gelince Nebi (s.a.v.) bana emretti. Ben de ezan okudum. Sonra ben: Ya Resülallah kamet edeyim demeğe başladım. Nebi (s.a.v.) de her söyleyişimde doğu tarafına fecre bakıyordu ve: ''Hayır kamet etme'' buyuruyordu. Nihayet fecir doğunca Nebi (s.a.v.) abdestini bozmaya gitti sonra yanıma dönüp geldi. Bu arada geride kalan sahabiler de yanımızda toplanmış oldular. Hz. Nebi abdest aldıktan sonra Bilal (r.a.) kamet etmek istedi. Nebi (s.a.v.) Ona: ''Südai'nin kardeşi ezan okudu. Kim ezan okursa o kamet eder'' buyurdu. Ziyad dedi ki: Bunun üzerine ben kamet ettim.'' Bu hadisin zahirine göre kim ezan okursa onun kamet etmesi gerekir. Ebu Davud, Ahmed ve Beyhaki'nin rivayet ettikleri Abdulla h bin Zeyd (r.a.)'in hadisine göre: Abdullah, rüyasında ezanı görüp Nebi (s.a.v.)'e gelerek haber verince Nebi s.a.v. Abdullah'ın gördüğÜ ezanı Bilal (r.a.)'a telkin etmesini emretmiş. O da telkin yapmış. Bilal de ezan okumuştur. Sonra Abdullah Nebi (s.a.v.)'e: Ezanı ben rüyamda gördüm, ben okumak isterdim, demiş. Nebi (s.a.v.) de: \"O halde sen kamet et'' buyurmuştur. Bu hadisin zahirine göre bir şahsın ezan okuması ve başkasının kamet etmesi caizdir. Bunun caizliği hususunda alimler ittifak etmişlerdir. Ancak hangisinin daha iyi olduğu hususunda ihtilaf etmişlerdir. Şöyle ki : Ebu Hanife, Malik, Ebu Sevr ve Hicaz ile Kufe halkının ekserisi AbduIIah bin Zeyd (r.a.)'in hadisinin zahirini tutarak: Ezan okuyanın ve başkasının kamet etmesi arasında bir fark. yoktur, demişlerdir. Şafiiler ve Hanbeliler Ziyad bin El-Haris'in hadisini delil göstererek: Ezan okuyanın kamet etmesi evladır, demişlerdir. Bunlar: AbduIlah bin Zeyd (r.a.)'in hadisinde sened ve metin bakımından ihtilaf vardır. Ziyad'ın hadisi sened bakımından Abdullah (r.a.)'ın hadisinden daha sağlamdır. Diğer taraltan AbduIIah'ın hadisi ezan'ın meşru kılındığı hicretin ilk senesi buyurulmuştur. Ziyad'ın hadisi kesinlikle bundan sonradır. Tarih bakımından sonra olan hadisi tutmak evladır,' demişlerdir. En-NeyI yazarı: Ziyad'ın hadisi tarih bakımından AbduIlah'ın hadisinden sonra olmamış olsaydı bile bu hadis Abdullah'a mahsustur denilecekti. Sebebi ise, kendisinin ezan rüyasını görmek meziyetidir, demiştir. Yukarıda beyan edilen husus, ezanın bir kişi tarafından okunması haline mahsustur. Eğer bir kaç kişi beraber ezan okurlarsa duruma bakılır. Şayet aralarından kamet için birisini seçerlerse mesele yoktur. Eğer bunda ittifak edemezlerse aralarında kur'a çekilir. Şayet bir kaç kişi ard arda ezan okurlarsa bakılır, eğer ilk okuyucu görevli müezzin ise veya daimi müezzin yoksa ilk okuyucu kamet eder. Şayet daimi müezzin bulunur da kendisinden önce ezan okuyan olmuşsa en sıhhatli kavle göre daimi müezzin kamet etmelidir. Bütün bu şıklarda kamet etmesi evla olandan başkası kamet edecek olursa, sahih kavle göre onun yaptığı kamet geçerlidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 12
			}
		}
	]
}