{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 725,
			"arabicnumber": 725,
			"text": "Muaviye bin Süfyan (r.a.)'dan şöyle demiştir: Resulullah Sallallahu Aleyhi ve Sellem buyurdular ki : «Müezzinler, kıyamet günü boyunları en uzun olan insanlardır.» AÇIKLAMA : Bu hadisi Müslim de rivayet etmiştir. Nevevi. hadis ile kasdedilen mana hakkında selef ve halef alimlerinin ihtilaf ettiklerini söyleyerek verilen manaları şöyle açıklamıştır: Bazı alimler: 'Bunun manası, müezzinlerin herkesten fazla ilahi rahmete özenmeleridir. Çünkü bir şeye çok özenen kimse onu görebilmek için baynunu uzatır. Bu özeniş ve görebilme gayreti, müezzinlerin görecekleri sevabın çokluğuna delalet eder.' demişlerdir. En-Nadr bin ŞumeyI: 'Kıyamet günü insanlar terler içerisinde boğulurken ter ve keder müezzinlere eziyet vermeyeceğinden kinaye olarak boyunlarının uzunluğu bildirilmiştir, demiştir. Bazıları da hadis müezzinlerin kıyamet günü başkan ve efendi oluşlarından kinayedir. Çünkü araplar, büyük adamları boyun uzunluğuyla vasıflandırırlar, demişlerdir. Hadisin manası, kıyamet günü müezzinlerin etbalarının çok olacağıdır, diyenler olmuştur. İbnü'l-Arabi: Hadisin manası müezzinlerin amellerinin herkesinkinden daha fazla olmasıdır, demiştir. Hadiste geçen ''A'nak'' kelimesi ''Unuk''un çoğuludur. Boyunlar demektir. 'Kadi İyad ve başkasının dediğine göre bazı raviler bu kelimeyi ''İ'nak\" olarak rivayet etmişlerdir. Bu kelimenin manası hızlı gitmektir. Buna göre hadisin manası: 'Kıyamet günü müezzinler herkesten hızlı olarak cennete gireceklerdir' olur. MÜSLİM HADİS’İ VE İZAH İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 20
			}
		}
	]
}