{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"3": "The Book of the Adhan and the Sunnah Regarding It"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 726,
			"arabicnumber": 726,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu, demiştir : «En seçkinleriniz sizin için ezan okusunlar ve Kur'an-ı en çok belleyenleriniz size namaz kıldırsın.» Bu hadisi Ebu Davud da rivayet etmiştir. AÇIKLAMA : Hadiste geçen ''En seçkinleriniz ... \" tabiriyle din işlerinde en çok muhafazakar olanlar kasdedilmiştir. Müezzinler yüksek minarelerin üstüne çıkarak ezan okudukları için cami çevresindeki bir çok evin avlu ve mahrem yerlerini buralarda bulunan namahrem kadınları ve ev halkını görebilirler. Minareden cami çevresindeki evlerin mahrem yerlerine bakmayacak muhafazakar insanların ezan okumakla görevlendirilmeleri burada tavsiye edilmiştir. Müezzinlerin çok dikkatli olmaları gereken diğer bir husus da namaz vakitleridir. Bu vakitlere azami itina gösterebilmeleri ve ihtiyatlı davranarak müslümanların namazlarının ifsadına sebebiyet vermemeleri için takva sahibi ve muhafazakar olmaları öngörülmüştür. Hadisin zahirine göre Kur'an'ı en çok belleyen kişi kendisinden daha alim olan adama tercihen imamlığa liyakatlıdır. El-Menhel yazarının belirttiği gibi Kur'an'ı en çok belleyen'in öncelikle imamlığa liyakatı onun namazIa ilgili şer'i hükümleri bilmek şartına bağlıdır. Bu sahada alim olmadığı takdirde önceliği yoktur. Tercemede: ''Kur'an'ı en çok belleyenleriniz ... '' diye açıkladığı:mız ''Kurra'' kelimesi ''Kari'''in çoğuludur. Kari' : Okuyucu demektir. Burada kasdedilen mana hakkında çeşitli yorumlar mevcuttur. 'El-Menhel yazarı ''İmamlığa en liyakatlı olan'' babında yapılan yorumIarı şöylece sıralamıştır: 1- Kur'an'ı en çok belleyeniniz ... 2- Kur'an'ı en güzel okuyanınız ve hükümlerini en iyi bileniniz ... ikinci yoruma göre ezber'in çokluğu ve azlığı imamlık için bir ölçü değildir. 3- Fıkıh hükümlerini en iyi bileniniz ... Üçüncü yorumu tercih edenler mesned olarak şöyle demişlerdir: Ashab-ı kiram'ın durumları dikkate alındığı zaman onların en kuvvetli fıkıhçılarının Kur'an'ı daha iyi okudukları anlaşılır. O halde en iyi okuyucu tabiriyle en kuvvetli alimler kasdedilmiştir. Bunun içindir ki İbn-i Mes'ud (r.a.) : 'Birimiz Kur'an'dan bir sure bellediği zaman o suredeki helal ve harama ait hükümleri vesair bilgileri iyice kavramadıkça başka bir sure'yi beIlemeye geçmezdi,' demiştir. İbn-i Ömer (r.a.) de: 'ResuluIlah (s.a.v.)'e nazil olan her sure'deki emirleri, yasakları, helal ve haramı mutlaka biliriz,' demiştir. Hadis, Kur'an kıraatıyla meşgul olmanın yüceliğini, Kur'an öğrenimi ve öğretiminin faziletini ve Allah kelamınm azametini biIdirmektedir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 3,
				"hadith": 21
			}
		}
	]
}