{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 740,
			"arabicnumber": 740,
			"text": "İbn-i Abbas (r.a.)'dan rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve 5ellem) şöyie buyurmuştur : «Yahudiler havralarını yükselttikleri ve hristiyanlar kiliselerini yükselttikleri gibi sizlerin de benden sonra mescidlerinizi yükselteceğinizi biliyorum.» Not: Zevaid'de: İsnadı zayıftır. Çünkü senedde Cubare bin El-Muğalis bulunuyor ki o çok yalancıdır. Ebu Davud da bu hadisi başka bir ifade ile ve kendi senediyle İbn-i Abbas (r.a.)'den merfu' olarak rivayet etmiştir, denilmiştir. AÇIKLAMA : Notta belirtildiği gibi Ebu Davud da bu hadisi ibn-i Abbas (r.a.)'den şu lafızla rivayet etmiştir: \"Ben mescidlerin teşyidi ile emrolunmadım. İbn-i Abbas dedi ki: Yahudiler ve hristiyanlar (mabedlerinil yaldızla süs!edikleri gibi sizler de muhakkak süsleyeceksiniz.'' Teşyid: Müellif bu bab'ın başlığında ve Ebu Davud da ibn-i Abbas (r.a.)'in hadisinde bu kelimeyi kulIanmışlardır EI-Menhel yazarının el-Bağavi'den naklen beyan ettiğine göre, mescidlerin teşyidin'den maksad, onları yüksek yapmaktır Teşyid'in sözlük manası, binayı yükseltmek, sağlam yapmak, inşaatında alçı ve kireç gibi malzemeleri kullanmak demektir. Ebu Davud'un rivayet ettiği İbn-i Abbas (r.a.)'in hadisinde: \"Yahudiler ve hristiyanlar ... '' parçası mevkuf yani İbn-i Abbas'ın sözü olarak geçmektedir. İbn-i Hibban'ın rivayeti de böyledir. Bununla beraber merfu' hükmündedir. Çünkü bu gibi sözler, re'ye dayalı olamaz. Zuhrufe: Ebu Davud'un rivayetinde geçen fiilin masdarı olan bu kelimenin asıl manası süslemektir. Zuhruf: Kelimesi ise aslında altın demektir Bilahere altınla yapılan her türlü süslemeye denilmiştir. Nihaye'nin heyanına göre Zuhruf', altınla yapılan nakışlar ve resimlerdir. EI-Menhel yazarı, hadis'in açıklaması ile ilgili olarak aşağıdaki ma'lumatı vermiştir: Yahudiler ve hristiyanlar, kutsal kitabIarını tahrif ederek, bunlarla amel etmeyi bırakınca, mabedlerini altınla süslemeye girişmişlerdir. Hadis ile sanki şöyle uyarı yapılıyor: 'Sizler, amelde ihlası bıraktığınız ve mescidleri yüksek ve süslü yapmakla öğünerek birbirinize karşı iftihar ettiğiniz zaman, sizin haliniz yahudi ve hristiyanların haline dönecektir.' Mescidleri, ilk olarak sahabe devrinin sonlarında el-Velid bin Abdulmelik bin Mervan süslemiş ve ilim ehlinin çoğu, fitne korkusuyla, bunun karşısında susmuştur. el-Ayni: 'İbn-i Abbas (r.a.)'in hadisini delil gösteren arkadaşlarımız; Mescidleri süslemek mekruhtur. Hele vakıf malından masraf yaparak süslemek, caiz değildir. Bu masraf, harcama yapan mütevelli veya başkasından tanzim edilir, demişlerdir. Kişi, kendi malından süslemeyi yapınca niçin kerahet var? diye bir soru akla gelebilir. Bunun sebebi, ya namaz kılan kişinin süslemeye bakarak meşgul olmasıdır ya da parayı yersiz harcamasıdır,' demiştir. İbn-i Reslan: Bu hadis, açık bir mu'cizedir. Zira Nebi s.a.v., kendisinden sonra meydana gelecek olan durumu haber vermiştir Mescidleri süslemek ve bunu iftihar vesilesi yapmak, bugün Mısır, Şam ve Kudüs'te devlet adamları arasında yaygın bir hal almıştır. Buradaki devlet adamları, halkın malını cebren alarak mescidleri ve okulları modern bir şekilde yapmaktadırlar Allah'tan selamet ve afiyet dileriz, demiştir. Eş-Şevkani: Hadis, mescidlerin yüksek ve süslü yapılmasının bid'at olduğuna delalet eder Ebu Hanife'nin buna ruhsat verdiği rivayet olunmuştur, demiştir. el- Bedr bin el-Münir: Halkın evlerini yüksek ve süslü yapınca mescidleri de böyle yapmaları münasiptir. Ta ki mescidler hakir görünmekten korunsun, demiştir Mescidleri yüksek ve süslü yapmayı caiz görenlerin dayanağı, Selef'in böyle yapanlar karşısında susmasıdır. Bunlara göre bid'at-ı hasene sayılır, mescidlere rağbet edilmesini sağlar. Süslemenin, Nebi (s.a.v.)'in emrinden olmadığına, kıyametin alametlerinden sayıldığına ve yasaklanan iffihar çeşidinden olduğuna delalet eden hadisler müvacehesinde anılan dayanağın tutarsızlığı aşikardır Selef'in susması, kabul alameti sayılamaz. Çünkü yukarıda anlatıldığı gibi bu iş, devlet adamlarından başlamıştır. Selef, bir fitne çıkmasın diye susmayı tercih etmiştir. el- Hafız, el-Fetih'de şöyle demiştir: 'Bazı alimler, mescidleri yüksek ve süslü yapmaya ruhsat vermişlerdir\" Ebu Hanife de: Bu iş, mescidlere ta'zim maksadıyla ve hazineden harcama yapmamak şartıyla caizdir, demiştir. Burada bir kaç önemli nokta vardır: 1. Mescidleri süslemek, namaz kılanların kalbini meşgul edecek durumda ise bunun mekruhluğuna alimler ittifak etmişlerdir. 2. Süslemek; övünmek, iftihar etmek, riyakarlık ve gösteriş için ise yine mekruhtur. Hatta değil süslemek, mescidleri böyle bozuk niyetlerle inşa etmek de mekruhtur. 3. Sağlam olsun diye mescid inşaatında alçı, kireç ve benzeri malzemeleri kullanmak mekruh değildir. Bunun delili Osman (r.a.)'ın halife iken Medine'deki Mescid-i Nebevi'yi yıktınp taş ve kireçle inşa etmiş olmasıdır. İbn-i Abbas (r.a.)'ın: \" ... Mescidleri süsleyeceksiniz.'' sözü, süslemenin yasaklığına delil değildir, çünkü mevkuftur. Hükmen merfu' olduğu kabul edilse şöyle yorumlanır: Bundan maksad, namaz kılan kişiyi meşgul eden süslemedir. Veya riya ve gösteriş için yapılan süslemedir. 4. Halktan zorla para alıp mescid yapmak haramdır. 5. Mütevelli ve benzeri kişilerin vakıf malından harcama yaparak, mescidi süslemeleridir. Bu da haramdır. Hiç bir alim, buna ruhsat vermemiştir. Abdullah bin Zübeyr (r.a.), Ka'be'yi yeniden yaparken eskisinden daha fazla yükselterek muhkem yapmıştır. Kendisine muhalefet edenlerin elinde hiç bir delil yoktur. Bütün itirazları Ka'be'nin eskisinden fazla yükseltilmesinden ibaretti. Nitekim İbn-i Zübeyr (r.a.) Kabe'yi yıkarak duvarlarını yenilemek istediği zaman İbn-i Abbas (r.a.) Ka'be duvarlarından eğilmiş olan yerleri tamir etmekle yetinilerek duvarlara bir ilave yapılmamasına taraftar olduğuna işaret ederek İbn-i Zübeyr (r.a.)'e: Senden sonra gelen bir emir'in senin yaptığını değiştirmiyeceğinden emin değilim, demiştir. Halife Harun er-Reşid'in veya el-Mehdi'nin yahut da el-Mansur'un Kabe'yi yıktırarak İbn-i Zübeyr (r.a.)'in yaptırdığı şekilde yenilemesini istedikleri ve İmam Malik'in onları uyararak: Kabe'nin meliklerin oyuncağı haline dönüşmesinden korkarım, demesi üzerine bu işten vaz geçtikleri rivayet olunmuştur. Yukarıdan beri verilen izahtan anlaşıldığı gibi Şevkani'nin ve başkasının bir ayırım yapmadan: mescidIeri yükseltmek ve süslemek yasaktır, sözleri yerinde değildir. HADİSİN FIKlH YÖNÜ : 1. Mescidleri yüksek yapmak meşru değildir. Bundaki tafsilat yukarıda görüldü. 2. Altın, gümüş ve benzeri şeylerle mescidleri süslemek caiz değildir. Bu iş yahudilerin ve hristiyanların işidir. Bu sebeple, bundan uzak durmak gerekir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 6
			}
		}
	]
}