{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 748,
			"arabicnumber": 748,
			"text": "Ahdullah b. Ömer (r.a.)'den rivayet edildiğine göre Resulullah Sallallahu Aleyhi ve Sellem şöyle buyurdu, demiştir : «Mescidde şıi şeyler yapılmamalıdır: Mescid yol edinilemez, orada silah çekilip çıkarılamaz, orada yay'a kiriş bağlanıp salınamaz, orada ok atılamaz, içinden çiğ et geçirilemez, orada had olarak kimse dövülemez, orada hiç kimsenin kısas cezası tatbik edilemez, orası çarşı edinilemez.» Not: Ravi Zeyd bin Cebire'nin zayıflığı üzerinde, alimler ittifak ettikleri için ve İbn-i Abdi'l-Berr onun zayıflığına alimlerin icma' ettiklerini naklettiği için isnadın zayıflığı Zevaid de bildirilmiştir. AÇIKLAMA : Kütüb-i Sitte sahiplerinden yalnız İbn-i Mace'nin rivayet ettiği anlaşılan bu hadiste anılan işlerin mekruhluğu, bab'ın başlığından da anlaşılmaktadır. Hadisin baş kısmında geçen: ''Mescidde şu şeyler ... '' parçasını Camiü's-Sağir şarihi el-Azizi şöyle yorumlar: Yani mescidde şu şeyleri yapmak mekruhtur. Hatta temiz bir madde ile bile olsa mescidin kirletilmesine sebep olan her hareket haramdır. ''Mescid yol edinilemez.'' cümlesinden maksad, mescid'in iki veya daha fazla kapısı bulunduğu takdirde, bir kapı'dan girip diğer kapıdan çıkmak suretiyle bir yol gibi kullanılmamasıdır. \"' ... Orada yay'a kiriş ... '' cümlesinden maksad, orada yay ve kirişle meşgul olup kirişi bağlamak ve salmak suretiyle bunun iyi olup olmadığı denenmemelidir. Çünkü böyle denendiği takdirde ses çıkarır. Şayet namaz'a duran her hangi bir kimsenin dikkatini çekmeyecek olursa, bununla meşgul olmak mekruhtur. Eğer namazdakilerin namazlarını şaşırmalarına sebebiyet verirse bu hareket haram sayılır. Orada ok atılması hükmü de aynıdır. '' ... İçinden çiğ et geçirilemez.'' parçasına gelince; Eğer çiğ et'ten kan damlaması ve mescid döşemesinin necis edilmesi sanılmıyorsa çiğ et geçirmek mekruhtur. Sanılıyorsa yani kuvvetle muhtemelse bu davranış haramdır. Had olarak adam dövmenin ve kısas cezasını uygulamanın yapılmamasının nedeni izahtan varestedir. '' •.. Orası çarşı edinilemez.'' cümlesinden maksad, mescidde alış veriş yapılmamasıdır. MESCİD'DEN GEÇİŞ HAKKINDAKİ ALİMLERİN GÖRÜŞLERİ : 1- Hanefi mezhebine göre bir zaruret olmadıkça mescid'in bir kapısından girip, diğer kapısından çıkmak suretiyle orayı yol gibi kullanmak tahrimen mekruhtur. Eğer bir zaruret nedeniyle geçilirse caizdir. Zaruret yokken geçişi itiyat (alışkanlık) haline getiren kişi fasık olur. Ama günde bir iki defa geçmekle fasık olunmaz. Girerken i'tikafa niyet etmek, fasık sayılmaktan korur. Her gün oradan geçmek durumunda olan kişinin, günde bir defa Tahiyyetü'l-Mescid sünnetini kılması kafidir. 2- Şafii mezhebine göre temiz kişinin ve cünüb adamın mescidden geçmeleri, ihtiyaç olsun olmasın caizdir. Hayızlı kadının mescidi kirletmekten emin olduğu takdirde bile olsa mescidden geçmesi mekruhtur. Kirletmekten emin değilse geçmesi haramdır. 3- Hanbeliler'e göre temiz kişinin ve cünübün mescidden yol gibi geçmeleri mekruhtur. Hayızlı kadın ile lahusa kadının ihtiyaç olmadan geçmeleri, mescidi kirletmekten emin olunması şartı ile mekruhtur. İhtiyaç halinde hepsi için, kerahetsiz caizdir. Yolun kestirme oluşu, ihtiyaçtan sayılır. 4- Malikiler'e göre mescidden geçiş nadir ise caizdir. Eğer sık sık geçiliyorsa bakılır: Şayet mescid yapılmazdan önce orada yol bulunuyorduysa, sonradan yapılan mescid'den geçmek mekrun değildir. Aksi takdirde mekruhtur. Geçen kişi Tahiyyetü'l-Mescid namazını kılmakla muhatab değildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 14
			}
		}
	]
}