{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 750,
			"arabicnumber": 750,
			"text": "Vasile bin el-Eska (r.a.)'den rivayet edildiğine göre Nebi (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Çocuklarınızı, delilerinizi, satın almanızı, satışınızı, münakaşalarınızı, seslerinizi yükseltmeyi, had cezalarınızın infazını mescidlerinizden uzak tutun. Mescidlerinizin kapılarının yakınında abdest alma yerleri ittihaz ediniz. Ve Cum'a günlerinde mescidlerinizi buhurla tütsüleyiniz.» Not: Zevaid'de ravi el-Haris bin Nebha'nın zayıflığı üzerinde ittifak edildiği için isnadının zayıflığı bildirilmiştir. AÇIKLAMA : Hadis, küçük çocukları ve delileri mescidlere sokmanın yasaklığına delalet eder. MezhebIerin bu husustaki görüşleri şöyledir: 1- Hanefi mezhebine göre bunların, mescidi necis etmeleri kuvvetle zannedildiği zaman mescide sokulmaları tahrimen mekruhtur. Aksi takdirde tenzihen mekruhtur. 2- Şafiiler'e göre henüz mümeyyizlik çağına ermemiş olan küçük yaştaki çocukların ve delilerin mescidi kirletmelerinden, içindekilere zarar vermelerinden ve avret yerlerini açmalarından emin olunduğu takdirde mescide sokulmaları caizdir. Mümeyyiz olan çocuğun, mescidi oyuncak haline getirmemesi şartıyla mescide alınması caizdir. Aksi takdirde haramdır. 3- Malikiler'e göre çocuk ve deli'nin mescide alınması, mescidin necis edilmesine sebebiyet verdiği takdirde haramdır. Keza mescidi pislememekle beraber yaramazlık ederlerse, mescide alınmaları haramdır. Mescidi pislemiyecek ve haylazlık etmiyecek veya edince uyarıldığı zaman uslu duracak çocuğun mescide götürülmesi caizdir. 4- Hanbeliler'e göre okutmak gibi bir ihtiyaç için mümeyyiz olmayan çocuğu mescide sokmak mekruh değildir. İhtiyaç olmadan mescide girmesi mekruhtur. Deli'nin hükmü de böyledir. Mescidlerde alış veriş etmenin şer'i hükmü, bundan önceki hadiste açıklandı. Mescidlerde sesleri yükseltmenin yasaklığı bu hadisten anlaşılıyor. Bu da mekruhtur. MezhebIerin konu hakkındaki görüşleri şöyledir: 1- Hanefi mezhebine göre mescidde namaz'a duranları şaşırtacak veya orada uyuyanları uyandıracak şekilde yüksek sesle zikretmek mekruhtur. Böyle bir durum söz konusu değilse kerahet yoktur. Bilakis zikredenin; ibadete karşı hevesinin artması uykuyu defetmesi ve kalbini uyarması gibi bir fayda elde edildiği zaman yüksek sesle zikretmesi daha efdaldır. Zikrin dışındaki sözlere gelince; mübah olmayan sözleri yüksek sesle söylemek tahrimen mekruhtur. Mübah olan sözleri yüksek sesle söylemek, namaz kılan'ın şaşırmasına sebeb olursa mekruhtur. Aksi takdirde keraheti yoktur. Tabii kişi ibadet maksadıyla mescide girmiş ise kerahet yoktur. şayet sırf konuşmak için mescide gırmiş olursa mutlaka mekruhtur. 2- Şafiiler'e göre mescidde yüksek sesle zikretmek, eğer namaz kılan, ders veren, kıraatla meşgul olan veya mütalaa eden birisini şaşırtırsa mekruhtur. Keza uyandırılması sünnet olmayan bir uyuyanı uyandırırsa yine mekruhtur. Aksi takdirde mekruh değildir. Yüksek sesle konuşmaya gelince, hadis diye uydurulduğu hadis alimlerince belirlenmiş sözleri okumak gibi helal olmayan konuşma türünden ise, anılan kişilerden birisini şaşırtsın, şaşırtmasın mutlaka haramdır. Mübah konuşma cinsinden ise bahsi geçen şahısları şaşırtır'sa mekruhtur. Şaşırtmazsa mekruh değildir. 3- Malikiler'e göre zikir ve ihmle bile olsa mescidde sesi yükseltmek mekruhtur. Ancak dört halde hüküm değişir: --- (a)- Müderrisin öğrencilere sesini duyurmak için ihtiyaç duyduğu takdirde sesini yükseltmesinde kerahet yoktur. (b)- Namaz kılanı şaşırtırsa haramdır. (c)- Mekke veya Mina mescidinde yüksek sesle ''Lebbeyk'' duasını okumak mekruh değildir. (d)- Nöbet bekleyenin sesini yükseltmesi mekruh degildir. 4- Hanbeliler'e göre namazdakilerin şaşırmasına sebebiyet verilmemesi halinde mescidde yuksek sesle zikretmek mübahtır. Mübah türünden olan konuşmalar da böyledir. Bunlar namaz kılanları şaşırtırsa mekruhtur. Mübah olmayan sözlerle ses yükseltmek, kimseyi şaşırtsın, şaşırtmasın mutlaka mekruhtur. Had cezalarını mescidlerde infaz etmek ve kılıçları çekip çıkarmak da, gerek bu hadiste ve gerekse 748 nolu İbn-i Ömer (r.a.)'in hadisiyle yasaklanmıştır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Mawdu"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 16
			}
		}
	]
}