{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 759,
			"arabicnumber": 759,
			"text": "Aişe (r.anha)'den rivayet edildiğine,göre şöyle demiştir : Resulullah (Sallallahu Aleyhi ve Sellem) mahallelerde mescidlerin (veya) evlerde namaz yerlerinin ittihaz edilmesini ve temiz tutulup güzel koku sürülmesini emretmiştir.» AÇIKLAMA (757, 758 ve 759): Müellifin ikİ senedIe rivayet ettiği aynı ma'nadaki Aişe (r.anha)'nın hadisini Ebu Davud, İbn-i Hibban, Ahmed ve Tirmizi de rivayet etmişlerdir. Ebu Davud'un, 'Mahallelerde (veya) evlerde mescidlerin ittihazı babı'nda rivayet ettiği Aişe (r.anha)'nın hadisini açıklayan el-Menhel, özetle şu bilgiyi vermiştir: ''Dur: 'Dar'ın çoğuludur. Dar kelimesi bina, arsa ve mahalle anlamlarına gelir. Çünkü araplar, bir kabilenin toplu halde bulunduğu mahalleye Dar adını verirler. Hadisteki Dur kelimesi mahalleler anlamına yorumlandığında hadisteki 'Mesacid' kelimesi ile meseidler anlamı kasdedilmiş olur. Bu takdirde cümlenin manası şöyle olur: 'Resulullah (s.a.v.) mahallelerde mescidleri yapmayı emretmiştir.' Şayet 'Dur' kelimesi: 'Evler' anlamına yorumlanırsa, Mesacid kelimesi ile namaz kılınan yerler kasdedilmiş olur. Yani bu kelime 'Mescid'in çoğulu değil, secde ve namaz yeri anlamını taşıyan 'Mesced'in çoğulu olmuş olur. Buna göre cümlenin manası şudur: 'Restilullah (s.a.v.), evlerde namaz yerlerinin yapılmasını emretmiştir. ' EI-Mirkat sahibi: Birinci yorum tercihe şayandır. Tatbikat. da ona göredir. Nebi (s.a.v.)'in her mahalle halkının kendileri için birer mescid yapmalarını emretmesinin hikmeti, bir mahalle halkının başka mahalledeki mescide gitmelerinin zorluğu veya imkansızlığı ve bu nedenle mescıdde namaz kılmanın ve cemaatın faziletinden mahrum kalınmasıdır. Her mahalle halkının güçlük çekmeden bu faziletleri kazanmaları için kendi mahallelerinde mescid yapmalarını emretmiştir, demiştir. Hattabi, ikinci yorumu anlatmış, birinci şekilde yorum yapıldığını da söylemiştir. Ayni de, Hattabi gibi ikinci yorumu daha açık, görerek şöyle demiştir: 'Bir yer sahibi tarafından vakfedilmedikçe ve halk orada cemaatla namaz kılmadıkça mescid sayılmaz, diyen arkadaşlarımız için bu hadis bir delildir. Eğer yer sahibinin mescid ismini vermesiyle iş tamamlanmış olsaydı, şahısların kendi evlerinden mescid olarak ayırdıkları köşe veya oda, onlarıri mülkü olmaktan çıkmış olacaktı. Şu halde bir yere mescid ismini vermek, o yerin mescid sayılması için yeterli değildir. Bunun için Hidaye sahibi: Eğer kişi evinin içinden bir yeri mescid edinerek halkın oraya girip namaz kılmalarına izin verirse, o yeri satabilir ve ölümü halinde mirasçıların malı olur. Çünkü mescid, içine girilmesine hiç kimsenin mani olamıyacağı bir yerdir. Kişinin, evinden mescid olarak ayırdığı yer, onun mülkü ile çevrili olduğu için oraya kimseyi sokmayabilir. O halde orası mescid hükmüne girmiş değildir, demiştir. Mahallelerde mescidlerin ve evlerde namazgahların yapılmasına ait verilen emir vueub için değil, izin mahiyetindedir. Çünkü bundan gaye uzak mescidlere gitmek meşakkatinden kurtulmalarıdır. Nebi (s.a.v.) mescidlerin temiz tutulmasını emretmekle mescidde bulunması münasib olmayan her şeyden arınmasını, pis kokudan kirlerden korunmasını ve tertemiz muhafazasını istemiştir. Bunun yanında mescidlere güzel kokuların sürülmesini emretmiştir. Çünkü bu yerlerde namaz kılındığı için, camiler gibi hürmet edilmesi gerekir. İbn-i Reslan: 'Mescidlere erkeklerin kullandıkları ve renk izi bırakmayan güzel koku türleri sürülmelidir. Çünkü renk izi namaza duranların dikkatini çekebilir. Mescidlere güzel koku sürülürken en iyisi cemaatın namaz kıldıkları ve secde ettikleri yerlere Sürülmelidir, demiştir. Güzel koku sürmek diye terceme ettiğimiz \"Tatyib' kelimesini, buhurla tütsülemek diye yorumlamak caizdir. Bunun içindir ki İbn-i Hacer: Mescidi buhurla tütsülemenin müstahablığı hadisten anlaşılır. Malik bunu mekruh görmekle muhalefet etmiştir. Halbuki Ömer bin el- Hattab (r.a.) minber üzerinde oturduğu zaman Abdullah (r.a.) mescidi buhurla tütsülerdi. Selefin bir kısmı, mescide za'feran ve güzel koku sürülmesini müstahab saymışlardır. Nebi (s.a.v.)'in de bunu yaptığı rivayet olunmuştur, der. Şa'bi: Mescide güzel koku sürmek sünnettir, demiştir. İbn-i Ebi Şeybe'nin tahric ettiğine göre Abdullah İbn-i Zübeyr, Ka'be'yi yaptığı zaman duvarlarını misk ile sıvamıştır. Hadis, evlerde namazgahların ittihaz edilmesinin meşruluğuna delalet eder, Nebi (s.a.v.)'in, ashabtan İtban bin Malik (r.a.)'in evinin bir köşeşini mescid olarak ittihaz etmesini sağladığı sabittir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 25
			}
		}
	]
}