{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 760,
			"arabicnumber": 760,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre şöyle demiştir : Mescidlerde ilk lamba yakan zat Temim ed-Dari (r.a.)dir.\" Not; Zevaid'de; Hadis mevkuftur. İsnadırıdaki ravilerden Halil bin İyas'ın zayıflığı üzerinde alimler ittifak etmişlerdir, denmiştir. AÇIKLAMA : Kütüb-i Sitte sahibierinden yalnız İbn-i Mace'nin rivayet ettigi anlaşılan bu hadis, mescidlerde ışık yakmanın meşruluğuna kanıttır. Ebu Davud'un 'Mescidlerde lamba yakmak babı'nda rivayet ettiği hadıse göre Nebi (s.a.v.)'in azatlı cariyesi Meymune bin-t Sa'd (r.anha), Nebi (s.a.v.)'den Mescid-i Aksa'da namaz kılmanın hükmünü sormuş. Nebi (s.a.v.) de: \"Oraya gidiniz ve içinde namaz kılıııız. (O bölgedekı şehirler. o sıralarda gayr-i müslimlerin hakimiyetindeydi.) Eger sizler Mescid-i Aksa'ya gidemez ve içinde namaz kılamazsanız kandillerinde yakılacak zeytin yağını gönderiniz.\" buyurmuştur. Ebu Davud'un rivayet ettigi bu hadıs İbn-i Mace tarafından da rivayet edilmiştir. Bahsi geçen iki hadis, mescidIerde lamba, kandil ve benzeri ışıkların yakılmasının meşruluğuna delalet eder. EI-Menhel yazarı, Meymune (r.anha)'nın hadisinden çıkarılan fıkhi hükümleri şöyle sıralamıştır: 1- Mescid-i Aksa'nın fazileti ve orada namaz kılmak için yolculuk edilmesinin meşruluğu anlaşılıyor. 2- Yakılmak üzere mescidlere yakıt göndermek, hatta başka şehirlerdeki mescidIere göndermek meşrudur. 3- Küfür diyarında bulunan mescidlerde namaz kılmak isteyen müslümanların yararlanması için mescidIerin aydınlatılmasında kullanılmak üzere oralara zeytin yağı göndermek meşrudur. Mescidlerin yararına olan başka maddeler de yağ gibidir. 4- Şer'i hükmü bilmeyen kimse, bilenlere sorup öğrenmelidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Very Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Very Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Very Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 26
			}
		}
	]
}