{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 774,
			"arabicnumber": 774,
			"text": "Ebu Hureyre (r.a.)'den rivayet edildiğine göre Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: «Sizden birisi güzelce abdest aldıktan sonra namazdan başka hiç bir maksadla evden çıkmayarak ve sırf namaz kılmak niyetini güderek mescide doğru yürüdüğü zaman, mescide girinceye kadar attığı her adımla Allah onu bir derece yükseltir ve kendisinden bir hata düşürür. Mescide girince de namaz onu alıkoyduğu sürece namaz içinde olmuş olur.» Tahric: Bu hadisi Kütüb-i Sitte sahiplerinin hepsi, birbirine yakın lafızlarla rivayet etmişlerdir Malik, İbn-i Hibban ve Beyhaki de buna yakın lafızlarla rivayet etmişlerelir, AÇIKLAMA : Ebu Davud'un rivayet ettiği metin daha uzundur, Onun rivayet ettigi haelisin baş kısmında, kişinin cemaatla kıldığı namazın, evinde ve çarşısında kıldığı namazdan yirmibeş derece fazla olduğu bildiriliyor, Hadisin son kısmında da: ''Kişi namazı beklerken mescidde kimseye eziyet etmedikçe ve abc\\esti bozulmadıkça melekler onun için dua ederek: 'Allahım ona mağfiret eyle', Allah'ım ona rahmet eyle Allah'ıın onun tevbesini kabul eyle'' derler. ilavesi vardır. Hadisteki, ''....namazdan başkabir maksatıla...'' cümlesinden anlaşılıyor ki; kişi sırf namaz için değil de, namaz kılmak niyetiyle beraber başka mülahazalarla mescide vardığı takdirde, hadiste va'd olunan fazileti kazanamaz, Sırf namaz kılmak maksadıyla mescide giiden kişi, attığı her adım karşılığında hem bir hasene kazanır, hem de bir günahl silinir. Kişi mescide girdikten sonra namaz için beklediği sürece sevab kazanması yönünden namazia meşgul olanın hükmündedir. Yukarıda Ebu Davud'un süneninden naklen beyan ettiğimiz, rivayette belirtildiği gibi kişi orada kimseye söz veya fiil ile eziyet etmeclikçe ve abdesti bozulmadıkça, namazdaymış gibi sevab kazanmış olur. Kimseye eziyet ettiği veya abdesti bozulduğu zaman. namaz\"\" meşgulmüş gibi süregelen sevabı son buiur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 40
			}
		}
	]
}