{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 778,
			"arabicnumber": 778,
			"text": "Ebu Said-i Hudri (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir : «Kim namaza gitmek üzere evinden çıktıktan sonra şu duayı okursa, Allah, rahmetiyle ona yönelir ve yetmiş bin melek, onun günahlarının bağışlanmasını (Allah'tan) diler: 'Allahım! Senden istiyenlerin Senin katındaki hakkı için gerçekten Senden istiyorum. Ve şu yürüyüşüm hakkı için Senden istiyorum. Çünkü ben ne kibirlenmek ne de böbürlenmek için ve ne görsünler diye ne de duysunlar diye (evden) çıkmadım. Ve ben Senin kızmandan sakınmak ve Senin rızanı taleb etmek için çıktım. Bu sebeple Cehennem ateşinden beni korumanı ve günahlarımı örtmeni Senden istiyorum. Şüphesiz Senden başka hiç kimse günahları örtemez.'.» Not: Zevaid'de: Bu hadisin isnadı zayıf raviler zincirinden kuruludur. Atiyye el-Avfi, Fudayl bin Merzuk ve el-Fadl bin el-Muvaffak adlı ravilerin hepsi zayıftır. Lakin İbn-i Huzeyme kendi sahihinde bu hadisi Fudayl bin Merzuk tarikinden rivayet etmiştir. Hadis İbn-i Huzeyme yanında sahihtir, denilmiştir. AÇIKLAMA : Hadiste geçen : Senden isteyenlerin Senin katındaki hakkı için ... \" ve '' ... Şu yürüyüşün hakkı için ... '' cumlelerinde geçen Hak: kelimesi, Allah tarafından kul'a ödenmesi gerekli kazanılmış bir istihkak demek değildir. Çünkü Allah, hiç b(r şeyi yapmaya mecbur değildir. Faili Muhtar'dır. Dilediğini yapar. Tam irade sahibidir. Hiç bir kulun ödenmesi gerekli herhangi ıbir hakkı Allah katında yoktur. Kulun hayat boyunca yaptığı tüm kulluk görevleri ve ibadetleri başarması, Allah'ın inayehyledir. Ve bütün hayır kazandıran işleri Allah'ın kendisine vermiş qlduğu sayısız ni'metlerden mesela bir akıl ni'metine denk gelemez. Bu sebeple hadiste geçen Hak'tan maksad; Allah'ın; dilekte bulunan mu'min kullarına lütuf ve ihsanı ile ve tamamen karşılıksız bir ikram mahiyetinde olmak üzere vereceği va'd buyurduğu fazilettir. Kişi, 'Hak' kelimesini kullanarak dua ederken şunu demek istiyor: Allah'ım! İhtiyacımın giderilmesi ve dileğimin kabulü uğrunda ben Senden dilekte bulunanlar için va'dettiğin yüce katındaki fazilete tevessül ederek Senden dilekte bulunuyorum. 'Hak' kelimesi bu manaya yorumlanınca sakıncalı bir tarafı kalmamakla beraber, bu inceliklere aklı ermeyen kimselerin zihinlerinde yanlış manalara yer verileceği endişesiyle Hanefi alimleri, ''Şunun hakkı için... '' gibi sözlerle dua etmekten kaçınmışlar ve bu tür kelimeleri mutlak kullanmayı kerahetten helli görmemişlerdir)",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 44
			}
		}
	]
}