{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 783,
			"arabicnumber": 783,
			"text": "“... Übey bin Ka'b (radıyallahü anh)’den: demiştir: Ensardan bir adam vardı. Onun evi, Medine'nin (mescidden) en uzak olan eviydi. Bununla beraber, Resûlüllah (sallallahü aleyhi ve sellem) ile beraber namaz kılmayı hiç kaçırmazdı. Ubeyy (radıyallahü anh) demiştir ki: Ben, ona acıdım ve: Yâ Filan! Eğer sen bir merkep satın alsaydın, seni şiddetli sıcaktan korurdu. Ayağına taş değip incinmesinden yüksek tutardı ve yerin zehirli hayvanlarından korurdu, dedim. Adam Vallahi evimin Muhammed (sallallahü aleyhi ve sellem)'in evinin bitişiğinde olmasından hoşlanmam, dedi. Übey demiştir ki: Ben adamın sözünü istiskal ederek alındım. Hatta Peygamber (sallallahü aleyhi ve sellem)’in evine vararak, dediklerini Ona anlattım. Bunun üzerine Peygamber (sallallahü aleyhi ve sellem) adamı çağırtıp ona sordu. Adam da, bana dediğinin mislini Ona zikretti ve (attığı adımların) izinden sevab umduğunu anlattı. Resûlüllah (sallallahü aleyhi ve sellem) de Ona: sana, saklayıp umduğun (sevab) vardır. ) buyurdu. \" \". . . Enes bin Mâlik (radıyallahü anh)’den rivâyet edildiğine göre şöyle tlemişlir: Banî Selime kabilesi, (Peygamber (sallallahü aleyhi ve sellem)'in mescidden uzak kalan) evlerinden çıkarak mescidin yakınına gelmek istediler. Peygamber (sallallahü aleyhi ve sellem), (Medine'yi muhafaza eden bu evleri tahliye etmekle) Medine çevresini boş bırakmalarını arzu buyurmadı. Ve Peygamber (sallallahü aleyhi ve sellem) onlara : Benî Selime! Sizler, (mescide gelip giderken) attığınız adımlarınızın izlerini hesaba katmayacak mısınız?) buyurdu. Bunun üzerine onlar, yerlerine ikamet ettiler. \" ..... (Abdullah) İbn-i Abbâs (radıyallahü anh)'den: Şöyle demiştir: Ensârın evleri mescidden uzaktaydı. Yakına gel-mek istediler. Bunun üzerine; (Ve biz, onların önden gönderdiklerini ve eserlerini yazarız. ) Yasin; 12 âyeti nazil oldu. İbn-i Abbâs demiştir ki: Onlar da (evlerinde) kaldılar",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 49
			}
		}
	]
}