{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"4": "The Book On The Mosques And The Congregations"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 802,
			"arabicnumber": 802,
			"text": "Ebu Saiıl-i Hudri (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) buyurdu ki : «Siz, adamın mescidlere gidip gelmeyi itiyad haline getirdiğini bildiğiniz (veya) gördüğünüz zaman, onun imanlı olduğuna şahitlik ediniz. Allah Teala; -Şüphesiz Allah'ın mescidlerini ancak Allah'a inan edenler imar ederler.' [Tevbe 18] buyurmuştur.» AÇIKLAMA : Bu hadisi Tirmizi de rivayet ederek hasen olduğunu söylemiştir. Ayetteki 'İmaret' kelimesiyle kastedilen mana hususunda alimler iki görüş rivayet etmişlerdir: Bunlardan bir kısmı: İmaretten maksad, ma'lum olan manadır. Yani mescidleri yapmak, binayı sağlamlaştırmak, onarmak, yıkıldığı zaman yeniden yapmaktır. Kafir kişi bundan men edilir. Hatta bir mescid yapılmasını vasiyet etse bu vasiyeti kabul edilmeyecektir, demişlerdir. İkinci kavle göre imaret'ten maksad mescide girmek ve orada oturmaktır. İmaret, iki kavle göre de mu'minin şanıdır. Özellikle mescidleri ibadetIe ve kılınan cemaat namazlarıyla canlandırmak, en büyük manevi imarettir. Mescidlere namaz için gidip gelmeyi alışkanlık haline getirerek sık sık girip çıkan kimsenin bu hali, mu'min olmasının alametidir. Bunun için de hadiste böyle adamın imanlı oluşuna şehadet ediImesi emrediImiştir. Şehadetten maksad, böyle adamın mu'min olduğunu dille söylemek mi yoksa kalben itikad etmek midir? Sindi'nin beyanına göre Tiy i: ''' ... Şehadet ediniz ... \" emrinin manası: Adamın imanlı olduğuna kesinlikle hükmedin. Çünkü şehadet, kalbteki kanaat ve inanca uygun olarak dille kesin söz söylemektir,' demiştir. Sindi: Tıybi'nin yorumu, hadisin sonunda, hadisin hükmünü te'yid mahiyetinde okunan ayette uygun olan yegane yorumdur. Ancak şöyle hir sorun var: Buhari ve Müslim'in rivayet ettikleri bir hadise göre; Sa'd (r.a.) bir adam hakkında: 'Şüphesiz bu adam mu'mindir.' deyince Nebi (s.a.v.) : \"Veya müslümandır.\" buyurmuştur. Bu hadis, kimsenin imanlı olmasına kesinlikle hükmetmenin nehyine delalet eder. Bu soruna şöyle cevap verilebilir: Sa'd (r.a.)'ın hadisinde bahsi geçen adam, mescidlere müdavim değil idi. Bu sebeple onun imanına kesinlikle hükmedilmemesi arzulanmıştır. Mescide müdavim kimsenin ise imanlı olmasına Ebu Said (r.a.)'in hadisi gereğince hükmedilmelidir. Mezkur problem şöyle de çözülebilir: Ebu Said (r.a.)'ın hadisindeki imandan maksad, İslamiyettir, teslim olmaktır. Yani mescidlere devam eden kimsenin müslüman olmasına hükmedilir. Ama içindeki inancın gerçek mahiyetini ancak Allah bilir. Fçıkat bu çözüm şekline şöyle itiraz edilebilir: Kişinin müslümanlığına hükmetmek için mescidlere, devam etmesine ihtiyaç yoktur. Çünkü mescidlere müdavim olsun olmasın: 'Ben Müslümanım' diyen herkesin müslümanlığına hükmedilir. En uygun yorum şekli, hadisteki şehadetten maksadın mescidlere müdavim olan kişinin imanlı olduğuna kanaat edip itikad etmek olduğuna dair olan yorumdur",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 4,
				"hadith": 68
			}
		}
	]
}