{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 815,
			"arabicnumber": 815,
			"text": "Abdullah bin el-Muğaffel'in oğlu (Yezid) (r.a.)'den şöyle demiştir: İslam dinine yeni bir şey sokmak hususunda babamdan daha hassas ve sert bir adamı çok az gördüm. Bir defasında ben namazda; Bismillahirrahmanirrahim diye kıraata başlarken sesimi işitti. Bunun üzerine: Ey oğulcuğum! (Dinde) bir şey ihdas etmekten sakın. Çünkü ben Resulullah (Sallallahu Aleyhi ve Sellem) ile beraber? Ebu Bekir (r.a.) ile beraber; Ömer (r.a.) ile beraber ve Osman (r.a.) ile beraber namaz kıldım. Bunlardan hiç birisinden, kıraata başlarken besmeleyi çektiğini işitmedim. Bunun için sen kıraata başlarken; [elhamdulillahi Rabbil Alemin] diyerek başla, dedi.\" Tahric: Aişe (r.anha)'nın hadisini Müslim ve Ebu Davud uzun metin halinde rivayet etmişlerdir. Enes bin Malik (r.a.)'in hadisini Ahmed. Müslim, Nesai, Darekutni, Ebu Davud, İbn-i Hibban, Taberani, Tahavi ve Tirmizi de rivayet etmişlerdir. Ebu Hureyre (r.a.)'in hadisini müelliften başka, kimsenin rivayet edip etmediğini bilemedim, Hatta belirtildiği gibi Kütüb-i Sitte sahipIerinden yalnız müellifin rivayet ettiği Zevaid'de bildirilmiştir, İSNADI: Abdullah bin Muğaffel (r.a.)'ın hadisini Tirmizi ve Nesai rivayet etmişler; Tirmizi, bunun hasen olduğunu da söylemiştir. Fakat Nevevi, el-Hulasa'da; 'Hadis lafızları bu hadisi zayıf saymışlar ve İbn-i Huzeyme, İbn-i Abdi'l-Berr ve el-Hatib gibi alimler, Tirmizi'nin bunu hasen görmesine itiraz ederek; Senedin dönüm noktası, Abdullah bin Muğaffel (r.a.)'in oğlu üzerindedir. Oysa hali meçhuldür, demişlerdir, der. AÇIKLAMA (812, 813, 814 ve 815): Bu babta geçen hadislere göre Nebi (s.a.v.) ve hadiste anılan sahabiler, namazda Fatiha'ya başlarken besmele ile değil, 'Elhamdu.,,' ile başlamışlardır. Bu hususta alimler arasında görüş ayrlığı vardır.! Şöyle ki : 1- Hanefi alimlerine göre besmele, müstakil bir ayettir. Surelerin' arasını ayırmak ve lwreket. için indirilrniştiı-. Ne Fatiha'dan ne de başka bir sure'den bir parça degildir. Gizli ve açık namazlarda besmeleyi gizli olarak çekmek sünnettir. Sahabilerden Ali, İbn-i Mes'ud, Ammar bin Yasir, Evzai ve Hanbeli alimleri de bu görüştedirler. Bu alimlerin delilleri, bu babta geçen hadislerdir. Bunlara göre cehri namazda kıraata başlarken açıktan besmele çekmek hükmü mensuhtur. 2- Şafiiler'e göre besmele, Fatiha'dan ve Neml suresinden birer ayettir. Kur'an'ın diger surelerinden de birer ayet olup olmadıgı husüsunda Şafii mezhebinin üç kavli vardir: En meşhur ve en sahih kavle göre, besmele her sureden birer ayettir. Şafiiler'e göre namazda Fatiha'ya başlarken, ondan bir ayet olan besmeleyi çekmek farzdır. Fatiha gibi, gizli namazlarda gizli; açık namazlarda açıktan okunur. İbn-i Abbas, İbn-i Zübeyr, İbn-i Ömer, Tavus, Ata, Mekhul ve İbnü'i-Münzir (r.anhum)'un kavli de budur. Bunların delilleri ise İbn-i Huzeyme (r.a.)'in Ümmü Seleme (r.a.)'den rivayet ettigi şu mealdeki hadistir: 'Peygamber (Sallallahu Aelyhi ve Sellem), namazda besmeleyi okudu ve onu bir ayet saydı: İkinci deliııeri, İbn-i Huzeyme'nin İbn-i Abbas (Radiyallahu anh)'dan rivayet ettigi şu mealdeki hadistir: 'İbn-i Abbas (r.a.): وَلَقَدْ آتَيْنَاكَ سَبْعاً مِّنَ الْمَثَانِي [Hicr 87] ayetindeki 'Seb-i Mesani', Fatiha suresi'dir, demiştir.' 'Elhamd...'den itibaren Fatiha suresi altı ayettir. Yedinci ayet nerededir? diye kendisine soru sorulunca: Yedincisi besıneledir, diye cevab vermiştir.' Üçüncü delil. Müsliın'in Enes (r.a.)'den rivayet ettiği şu mealdeki hadistir: 'Peygamber (s.a.v.) bir gün aramızda iken vahiy haletine geçti sonra tebessümle başını kaldırdı. Biz: Ya Resullah! Seni gülümseten nedir? diye sorduk. O: «Bana şimdi bir sure nazil oldu.- buyurdu. ve: .... Kevser suresini 'Bismillah ... 'tan başlayarak okudu.' Dördüncü delilleri, Darekutni'nin Ebu Hureyr e (r.a.)'den merfu' olarak rivayet ettiği şu mealdeki hadistir: ''Elhamd.. .' suresini. okurken 'Bismillah...'ı okuyunuz. 'Bismlllah...' Fatiha'dan bir ayettir.'' Şafii alimleri, bir de şöyle savunmuşlardır: Sahabiler, Beraet suresi hariç, bütün surelerin başında besmeleyi ayetlerin yazılış şekline uygun olarak yazmak üzerinde icma' etmişlerdir. Halbuki cüzi bölümlerini ve surelerin başlığındaki yazıları ayetlere uygun şekilde yazmamışlar, kırmızı ve benzeri renkıerle yazmayı itiyad haline getirmişlerdir. Yani bunların ayetlerden farklı oluşları besbellidir. Eğer besmele, Kur'an'dan olmasaydı, sahabiler, ayetlerin mushaf hattıyla ve farksız olarak yazılmasına müsaade etmiyeceklerdi. Çünkü bu uygunluk, besmelenin Kur'an'dan olduğuna itikad edilmesine halkı sevkedecek. Böylece müslümanların, Kur'an'dan olmayan bir şeyi Kur'an'dan saymakla hataya düşmelerine sebep olmuş olurlar. Sahabiler hakkında böyle bir şey düşünmek caiz değildir. Sahabilerden Ebu Bekir, Osman. İbn-i Abbas, İbn-i Ömer, Übeyy bin Ka'b, Enes, Ebu Said ve Ebu Katade (r.a.); Tabiilerden de Said bin el-Müseyyeb, MekhuI, Ata. İbn-i Sirin , İkrime. Muhammed bin el-Münkedir, Zühri, Ebü Kılabe, el-Leys bin Sa'd, İshak bin Rahuye (r.a.) ve bir çok alim cehri namazlarda besmeleyi açıktan çekmenin müstahablığına hükmetmişlerdir. Ömer (r.a.)'den üç rivayet vardır: Bir rivayete göre cehri namazlarda açıktan çekilir, diğer bir rivayete göre gizli çekilir, üçüncü bir rivayete göre besmeleyi çekmez. EI-Menhel yazarı, besmelenin açıktan çekilmesine dair bir kaç delili daha zikretmiştir. Fakat konu çok uzayacağı endişesiyle buraya almaktan feragat ettim. 3- Maliki alimlerine göre farz namazlarda besmeleyi çekmek mekruhtur. İmam olsun, cemaat olsun, münferid olsun fark etmez. Ne gizli namazda, ne de cehri namazda besmele çekilmez. Nafile namazda çekilebilir. Fakat besmelenin çekilmesini vaclb gören alimlerin görüşlerine aykırı hareket etmekten kaçınmak maksadıyla farz namazda besmeleyi çekmekte kerahet yoktur. Keza besmelesiz kıraatla namaz kılınabileceğine itikad etmek kaydıyla farz namazda besmeleyi çekmekte kerahet yoktur. Malikiler'in delilleri, bu babta geçen hadislerdir. EI-Menhel yazarı, yukarıda anlattığım, mezhebierin görüşlerini naklettikten sonra şöyle der : 'Namazda besmelenin açıktan çekilmesini müstahab gören alimlerin delil olarak gösterdikleri hadisler, kuvvetli değillerse de birbirlerini takviye etmek durumundadırlar. Bu hadislerle, Peygamber (s.a.v.)'in besmeleyi gizli çektiğine dair hadisler arasında bir çelişki söz konusu değildir. Çünkü Peygamber (s.a.v.) bazen açıktan besmele çekerdi, bazen de gizli okurdu. EI-Huda yazarı: Peygamber (s.a.v.) bazen besmeleyi açıktan çekerdi. Ekseriyetle gizli okurdu. Şüphe yok ki eğer Peygamber (s.a.v.)her gün beş defa hazerde ve seferde açıktan besmele çekmiş olsaydı, bu durumun Hulefa-i Raşidin tarafından ve sahabilerin Cumhurunca bilinmemesi mümkün değildir, demiştir. Yukarıdan beri verilen ma'lumat'tan bilmiş oldum ki namazda besmele çekmenin mekruhluğuna ve Kur'an'dan bir ayet olmadığına hükmedenlerin elinde bir mesned yoktur. Peygamber (s.a.v.)'in ve Hulefa-i Raşidin'in; ''Elhamdu lallahi Rabbil Alemin...''i ile kıraata başladıklarına dair bu babtaki hadisler ve benzeri hadislerden maksad, Fatiha suresiyle kıraata başlanmasıdır. Hadisler böyle yorumlanınca, namazda besmelenin çekilmediği manası çıkarılamaz. Bilakis bu yorum şekli, besmelenin çekildiğine delildir. Çünkü Fatiha suresi denilince besmele de sure içinde düşünülür. Darekutni'nin Enes (r.a.)'den rivayet edip sahih olduğunu belirttiği şu mealdeki hadis bu yorumu te'yid eder: 'Peygamber (sallallahu aleyhi ve sellem)'in ve Ebu Bekir. Ömer ile Osman (r.anhum)'un arkalarında namaz kılardık. Bu zatların hepsi cehri namazlarda Fatiha ile kıraata başlarlardı",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 13
			}
		}
	]
}