{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 824,
			"arabicnumber": 824,
			"text": "Abdullah bin Mes'ud (r.a.)'den şöyle demiştir: Resulullah (Sallallahu Aleyhi ve Sellem) Cum'a günü sabah namazın ('ın ilk rek'atın)de: Secde ve (ikinci rek'atinde): İnsan surelerini okurdu. İshak demiştir ki: Amr, bize Abdullah'tan böylece tahdis etti. Bunda şüphem yoktur.\" Not: Bu hadisin isnadının sahih ve ricalinin sika olduğu Zevaid'de bıldirilmiştir. Bu Hadis’i: İbn-i Mace'den başka Kütüb-i Sitte sahiplerinden rivayet eden yoktur, Beyhaki ve Taberani de rivayet etmişlerdir. AÇIKLAMA (821, 822, 823 ve 824) Müteaddit senedlerle ve müteaddit sahabilerden rivayet olunan bu hadisler, Nebi (s.a.v.)'in Cum'a günü sabah namazının ilk rek'atinde Secde suresini ve ikinci rek'atinde , El-İnsan suresini okuduğuna delildirler. Ebu Davud'un, süneninde buradaki başlığa benzer bir ifadeyle açtığı bab'ta rivayet ettiği İbn-i Abbas (r.a.)'ın hadisini açıklayan EI-Menhel yazarı şu bilgiyi verir: «Hadis, Cuma günü sabah namazında bu iki sure'nin okunmasının meşruluğuna delildir. Hadisin zahirine göre Nebi (s.a.v.), Cuma günü sabah namazında daima bu iki sureyi okuyormuş, Taberani'nin İbn-i Mes'ud (r.a.)'dan rivayet ettigi hadisin sonunda İbn-i Mes'ud (r.a.)'ın: ..... \"Nebi (s.a.v.) Cuma günü sabah namazında bu iki sureyi okumayı devam ettirirdi.» cümlesi bunu te'yid eder. Yine hadisin zahirine göre Nebi (s.a.v.) bu iki sure'nin tamamını okurdu: Bazı adamların, Cuma günü sabah namazında anılan surelerin birer parçasını okumaları, hadisin zahirine ters düşer. Nevevi. 'Er-Ravda' adlı kitabında: 'Eğer kişi, içinde secde ayetinin bulunduğu bir iki ayeti sırf tilavet secdesini yapmak maksadıyla okumak isterse, bunun hükmü hakkında arkadaşlarımızın her hangi bir sözüne rastlamadım. Selef alimleri, bu adamın kıraatı hakkında ihtilaf etmişlerdir, Şeyh bin Abdi's-Selam, bunu yapmanın yasaklığına ve namazın bozulmasına sebep olduğuna fetva vermiştir, İbn-i Ebi Şeybe, Ebu'l-Aliye ile Şa'bi'nin secdeyi ihtisar etmenin mekruh olduğunu söylediklerini rivayet etmiştir. Şa'bi şunu da söylemiştir: Alimler namazda secde ayetini okudukları zaman tilavet secdesini etmeden, o ayeti takib eden ayetlere geçmekten hoşlanmazlardı. İbn-i Sirin ve el-Hasan da secde ihtisarını mekruh görmüşlerdir. İbrahim en-Nehai de, alimlerin, secde ihtisarını mekruh gördüklerini nakletmiştir Said bin el-Müseyyeb ve Sehl bin Havşeb'den rivayet edildiğine göre secde ihtisarı, halkın ihdas ettiği bir şeydir. Secde ihtisarı şudur: Secde ayetlerini toplayıp onları okumak ve tilavet secdesini yapmaktır Bir kavle göre secde ihtisarı, Kur'an okuyup secde ayetlerini anlamaktır. Her iki hareket de mekruhtur. Çünkü, selef'ten böyle bir şey varid olmamıştır,' demiştir. Sahabilerden Cuma günü sabah namazında hadiste geçen Secde ve El-İnsan surelerini okuyan zatlar, Ömer bin el-Hattab, İbn-i Abbas, İbn-i Mes'ud, İbn-i Ömer ve İbn-i Zübeyr (r.a.)'dur. Tabiilerden de İbrahim bin Abdirrahman bin Avf'tır. Allah hepsinden razı olsun. MEZHEBLERİN BU KONUDAKİ GÖRÜŞLERİ: 1 Hanefi alimlerine göre, sünnete uymak maksadı olduğu zaman Cuma sabah namazında bu iki sureyi okumak müstahabtır. Ama bu maksad olmaksızın, daima Kur'an'ın belirli bir yerini okumak mekruhtur. Çünkü böyle bir davranış, Kur'an'ın diğer yerlerini terketmeye ve Onun bir kısmını diger bir kısmına tercih etmek zannına yol açar. 2- Şafii'ye ve Ahmed bin HanbeI'e göre mezkur sureleri, Cuma'nın sabah namazında okumak sünnettir. Fakat Hanbeliler'e göre bunu devamlı yapmak mekruhtur. 3- Malikiler'e göre içinde secde ayeti bulunan her hangi bir sureyi kasden farz namazda okumak mekruhtur İbn-i Kasım'ın Malik'ten rivayeti böyledir. Eşheb'in Malik'ten rivayetine göre imam'ın arkasında az bir cemaat bulunup namazı şaşırmalarından korkulmadığı zaman, içinde secde ayeti bulunan bir sureyi farz namazda okumak caizdir. İbn-i Habib ise şöyle bir ayırım yapmıştır: Gizli namazlarda secde ayeti bulunan sure'yi okumak caiz değildir. Çünkü cemaati şaşırtır. Fakat cehri namazlarda caizdir. Çünkü cemaatın şaşırmasından emin olunur. Maliki alimlerinin bahsettikleri şaşırma şudur: İmam, zammi surede secde ayetini okuyunca hemen tilavet secdesine varıp bir defa secde ettikten sonra tekrar ayağa kalkar ve müteakip ayetlerle kıraatına devam eder. Kıraatını tamamlayınca, normal rüku' ve secdeye varır. Secde ayeti dolayısıyla varılan tilavet secdesi, durumdan haberdar olmayan kişileri şaşırtabilir.! El-Fetih yazarı: 'Nebi (s.a.v.)'in, namazda Secde suresini okurken secde ayetine vardıgı zaman hemen tilavet secdesini yaptığına dair herhangi bir açıklamaya, mevcut tariklerde rastlamadım. Yalnız İbn-i Ebi Davud'un eş-Şeria adlı kitabında İbn-i Abbas (r.a.)'dan şöyle bir rivayete rastladım: «Ben Cuma günü sabah namazında Nebi (s.a.v.)'in yanına vardım. İçinde secde ayeti bulunan bir sure okudu da secdc etti.» Bu hadisin isnadında, hali incelenecek ravi vardır. Bir de Taberani'nin M. Sağirinde Ali (r.a.)'den rivayet edilen şu mealdeki bir hadisi gördüm: «Nebi (s.a.v.) sabah namazında ''Secde suresini okuduğunda tilavet secdesi etti.'' Lakin bu hadisin isnaclında zayıflık vardır,' der. Nebi (s.a.v.)'in Cuma'nın sabah namazında mczkur sureleri okumasının hikmeti şudur: Bu iki sure, Cuma günü vuku bulmuş ve vuku bulacak rnühim olaylardan bahseder Çünkü bu ikı sure'de Adem (a.s.)'ın yaradılışı, öldükten sonra dirilme ve kulların mahşer'e sevkinden bahsedilir. Bu olaylar, Cuma günü vuku bulur Cuma günü bu surelerin okunması ile mezkur olaylar, muslümanlara hatırlatılmış olur. Amaç bu olunca. kıraat esnasında tilavet secdesi dolaylı olarak yapılır. Yani sure, tilavet secdesi yapmak içın okunmuş olmaz. El-Huda yazarı Nebi (s.a.v.), Cuma günü sabah namazında ''Secde ve el-İnsan''.. surelerini okurdu. Bir çok cahillerzannediyorlar ki, maksad, o günkü sabah ..... namazla bir secde ilave etmektir Ve o bilgisizler o secdeye Cuma secdesi ismini verirler. Onlardan birisi bu sureyi okumadığı zaman içinde secde ayeti bulunan başka bir sureyi okumaktan hoşlanır. Ta ki tilavet secdesi yapabilsin. Bunun içindir ki cahillerin yanlış anlamalarını önlemek maksadıyla bazı imamlar, Cuma günü sabah namazında Secde suresini devamlı okumayı mekruh görmüşlerdir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 22
			}
		}
	]
}