{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 837,
			"arabicnumber": 837,
			"text": "Ubade bin es-Sanıit (r.a.)'den rivayet edildiğine göre: Nebi (Sallallahu Aleyhi ve Selleın) şöyle buyurdu, demiştir : «Namazda Fatiha (suresini) okumayan'ın hiç bir namazı yoktur.» Diğer tahric: Buhari, ezan; Müslim, salat; Tirmizî, mevakit, tefsir sure; Nesai, iftitah; Ebu Davud, salat, Darimî salat; Muvatta, nida; Ahmed b. Hanbel, II, 285, 290, 460, 487; V, 314, 316, AÇIKLAMA : Ebu Davud'un süneninin \"Namazında Fatiha'yı terkeden habı»nda el-Menhel şöyle der: ''Hadisteki ''Namaz'' kelimesi, lügattaki manası olan duada kullanılmamış olup şer'i manası olan özel ibadette kullanılmıştır. Çünkü Şari-i Hakim ... kelimelerin lügat manalarını anlatmak için degil dini manalarını tanıtmak için gönderilmiştir. Bu nedenle onun sözleri daima ıstılahi manaya yorumlanır. Şu halde hadisin anlamı şudur: ''Namazda Fatiha suresini okumayanın şeriata uygun hiç bir namazı yoktur.. Yani Fatiha suresini okumadan kıldığı namaz, şer'an namaz anlamını taşımaz. Hal böyle olunca: Hadiste «Sıhhatli» veya «Yeterli» yahut \"Mükemmel'' kelimesini takdir ederek meali şöyledir, diye bir yorum'a gerek yoktur . ''... okumayanın (sıhhatlı) hiç bir namazı... '' veya, ''... okumayanın (yeterli) hiç bir..'' yahut, ''... okumayanın (mükemmel) hiç bir... '' Faraza: ''Namaz yoktur'' denemezse, o zaman cümlenin hakiki manasına en yakın olan mecazi manası seçilir. Yani ''SıhhatlI '' veya, Yeterli .. kelimesi takdir edilir. Ve meal şöyle olur: ''Namnazda Fatiha (suresini) okumayanın (sıhhatlı) hiç bir namazı yoktur.'' veya: ''... okumayanın (yeterlil hiç..'' Hadıste \"Mükemmel'' kelimesi takdir edilmekle hakiki manaya en uzak olan mecazi mana alınamaz. Çünkü daha yakın manayı almak mümkündür. Diger taraftan \" ... sıhhatlı (veya) yeterli namaz yoktur.'' denilince ''... mükemmel namaz yoktur '' manası da ifade edilmiş olur. Fakat ''... mükemmel namaz yoktur ..'' denilirse \" ... sıhhatlı namaz yoktur.'' manası ifade edilmiş olamaz. Zira bir namaz mükemmel olmamakla beraber sıhhatlı ve yeterli olabilir. Hadis; yukarıda anlatıldığı gibi namazda Fatiha okumayanın namazının şer'i bir namaz sayllamayacağına ve sahih olmadığına delildir. NAMAZDA FATİHA OKUMAK FARZ MI? 1- İbnü'l-Münzir'in nakline göre Ön er, Osman bin Ebi'l-As, İbn-i Abbas, Ebu Hureyre ve Ebu Said-i Hudri (r.a.) : ''Namazda Fatiha okumak farzdır, onun yerine başka sureler ve ayetler okumak kafi gelmez. Ancak onu okumaya gücü yetmeyenin, başka ayetler okuması caizdir.''demişlerdir, Sahabilerle tabiilerin ve onlardan sonra gelen alimlerin cumhurunun kavli budur, Malik, Şafii ve Ahmed bin Hanbel'in mezhebieri de budur. Şer'i namazın oluşması için Fatiha suresinin okunmasının gerekliligine delalet eden delillerden birisi de Darekutni'nin Ubade bin es-Samit (r.a.)'den rivayet ettiği şu hadistir: ''Namazda Fatiha okumayan adamın kıldığı namaz yeterli değildir.'' Darekutni bunun isnadının sahih oldugunu söylemiştir. Başka bir delil de İbn-i Huzeyme'nin, kendi sahihinde Ebu Hureyre (r.a.)'den rivayet ettiği şu hadistir. ''İçinde Fatiha okunmayan namaz yeterli değildir.'' 2- Hanefi alimlerine göre namazda Fatiha okumak farz değildir. Kur'an-ı Kerim'in her hangi bir ayetini okumak farzdır. Fatiha'yı okumak ise vacibtir. Onlar: Fatiha'nın okunmasının gerekliliği ahad hadisi ile sabittir. 'Ahad' hadisi ile sabit olan bir şey farz olmaz, vacib olur. Onsuz namaz sahihtir. Fakat Fatiha'yı terkeden kişi günah işlemiş olur, demişlerdir. Delilleri ise; .... ''Artık Kur'an'dan kolay geleni okuyun .'' [Müzemmil 20] ayetidir. Hanefi alimleri: Ayet, kolay olanın okunmasının istendiğini kesinlikle belirtiyor. Bunda bir muhayyerlik vardır. Yani namaz kılan kişi serbesttir. Kur'an-ı Kerim'in neresini okumak ona kolay geliyor isa orayı okuyabilir. Eğer Fatiha'yı okumak farz olsaydı, muhayyerlik hükmünün mensuh olması gerekecekti. Halbuki kat'i delil olan mezkur ayet zanni delil olan ahad hadisi ile mensuh olmaz, demişlerdir. Onların bir delili de Buhari ve Müsliın'in Ebu Hureyre (r.a.)'den merfu' olarak rivayet ettikleri ve namazı hatalı kılan zata Nebi (s.a.v.)'in namaz tarifine ait hadisinde şöyle buyurulmuş olan ifadedir: .........''... sonra Kur'an belleyip okuyabildigini oku...'' Bu ayeti delil gösteren Hanefi alimleri: Hürmet bakımından Kur'an'ın bütün sureleri eşittir. Nitekim cünüb adam hiç bir ayetini okuyamaz. Abdestsiz kimse mushafın hiç bir yerini elleyemez, demişlerdir. Onlara göre hadisten maksad, Fatiha okumayanın namazının sahih olmadığı değil, mükemmel olmadığını bildirmektir. CUMHUR'UN HANEFİ ALİMLERİNE CEVABI .........[Müzemmil 20] ayeti farz namazdaki kıraat miktarı hakkında değil, gece namazı hakkındadır. Yani geceleyin kolayınıza gelen namazı kılınız. ''kat'i delil, zanni delil ile mensuh olmaz. Halbuki eğer Fatiha'yı okumak farzdır, dense, ayetle getirilmiş olan muhayyerlik mensuh olur.'' şeklindeki gerekçeye gelince bu da varid değildir. Çünkü nesih durumu yoktur. Itlak ve takyid vardır. Yani ayet mutlaktır. Hadis onu takyid etmiş olur. İbham ve tefsir kabilindendir, demek de mümkündür. Namazını hatalı kılan zat'a Nebi (s.a.v.)'in; emri mücmel olup, Fatiha'nın okunmasını emreden hadislerle açıklanmıştır. Üstelik, Ebu Davud, Ahmed bin Hanbel ve İbn-i Hibban'ın rivayetlerinde Peygamber (s.a.v.)'in o adama: ... \"Sonra Ümmü'l-Kur'an'ı oku'' buyurduğu bildirilmiştir. Kur'an surelerinin hürmet bakımından eşit olması namazda okunmalarının yeterliliği yönünden de eşit olmasını gerektirmez. Kaldı ki Fatiha'nın okunmasının gerekliliği sahih hadislerle sabittir. Hadisteki: ''....namazı yoktur.'' cümlesindeki olumsuzluğun namaz'ın mükemmelliğine ait olmayıp namazın aslına ve sıhhatına ait olduğu hususu yukarıda anlatılmıştır. EI-Menhel yazarı, ''Namazında kıraati terkedenin babı'' nda eumhurun görüşünü ve Hanefi alimlerinin görüşünü yukarıda anlattığım şekilde naklettikten sonra şöyle der: ''Yukarıda verilen malumat'tan bilmiş oldun ki Fatiha suresini okumanın namazın rükünlerinden sayılması ve onsuz kılınan namazın sahih olmaması kavli kuvvetlidir. FATİHA HER REK'ATTE FARZ MI? Namazda Fatiha okumak farzdır, diyen alimler bu hususta ihtilaf etmişlerdir: 1-Şafii, Ahmed bin Hanbel, Evzai, Ebu Sevr, Ali ve Cabir'e göre imam ve tek başına namaz kılanın bütün rek'atlerde Fatiha okumaları farzdır. Maliki alimlerinin sahih kavil de budur. (İmam'a uyan kimse hakkındaki ayrıntılı bilgi bundan sonraki babta verilecektir.) Delilleri: I- Namazını hatalı kılan zata Nebi (s.a.v.), namazı tarif ederken ilk rek'atte yapılacak şeyleri anlattıktan sonra: .... ''Sonra namazının her rek'atinde, onları (anlatılanları) yap.'' buyurmuştur. Bunu Buhari rivayet etmiştir. II- Buhari ve Ahmed'in Malik bin el-Huveyris (r.a.)'den merfu olarak rivayet ettikleri: ........... ''Benim namaz kılışımı gördüğünüz gibi namaz kılınız'' hadisidir. Nebi (s.a.v.)'in her rek'atte Fatiha okuduğu bilinmektedir. III- Müslim'in Ebu Katade (r.a.)'den rivayet ettiği; ''ResululIah (s.a.v.) öğle ve ikindinin ilk iki rek'atlarında Fatiha'yı okurdu ve (Fatiha'dan sonra okuduğu) ayeti zaman zaman bize duyururdu. Son iki rek'atte Fatiha okurdu.'' 2- Hasan-ı Basri, Davud ve İshak'a göre, namazın herhangi bir rek'atinde Fatiha ve ondan sonra Kur'an'dan bir parça okumak vacibin yerine getirilmesi için kafidir. Bir rek'atta Fatiha, başka bir rek'atta da ayetler okumak yine vacibin ifası için yeterli sayılır. Bunların delili de Ubade (r.a.)'ın (837 nolu) hadisidir. Bunlar: 'Hadiste namazda Fatiha okunması emredilmiştir. Bir defa okununca emir yerine getirilmiş olur. Her rek'atte okunması gerekir, diye başka bir delil varsa ona dönülür, demişlerdir. Bu görüşe şöyle cevab verilir: Yukarıda beyan edilen deliller, her rek'atta Fatiha okumanın gerekliliğine delalet ederler. 3- Zeyd bin Ali ve en-Nasır'a göre ilk iki rek'atta Fatiha okumak farzdır. Son iki rek'atta Fatiha yerine başka ayetler okumak veya tesbihat yapmak da caizdir. Ebu Hanife'nin görüşü bu görüşe benzer. Şu farkla ki, Ebu Hanife'ye göre ilk iki rek'atta kıraat farzdır. Fatiha okumak farz değil vacibtir. Yani Fatiha okunmayıp başka sure veya ayetler okunursa farz yerine getirilmiş olur. Sadece vacib terk edilmiş olur. Zeyd bin Ali ve en-Nasır'ın delili: Ali bin Ebi Talib (r.a.)'ın ilk iki rek'atte kıraat ettiğine ve son iki rek'atta tesbihat yaptığına dair rivayet olunan hadistir. Halbuki bu hadis zayıftır. Çünkü el-Harise el-A'ver'in rivayetinden gelmedir. Bu adam hadis hafızları yanında zayıflıkla meşhur bir kezzabtır. Bunların ikinci delili de Hanefi alimlerinin gösterdikleri .....[Müzemmil 20] ayetidir. Bu ayetin delil olup olmayacağı hakkında yukarıda yeterli bilgi verilmiştir. EBU DAVUD HADİSİ VE İZAH’I İÇİN BURAYA TIKLAYIN",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 35
			}
		}
	]
}