{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 838,
			"arabicnumber": 838,
			"text": "Ebü's-Saib (r.a.)'den rivayet edildiğine göre kendisi Ebu Hureyre (r.a.)'den şunu işitmiştir: Resulullah (Sallallahu Aleyhi ve Sellem) : «Kim, içinde Fatiha okumadığı bir namaz kılarsa o namaz noksandır, tamam değildir.» buyurmuştur. Ben: «Ya Eba Hureyre ! Şüphesiz ki ben zaman zaman imamın arkasında olurum.» dedim. Bunun üzerine Ebu Hureyre (r.a.), kolumu tutup bastırdı ve : «Ya Farislit Fatihayı gizli oku.» diye cevap verdi. Diğer tahric: Malik, Ahmed, Müslim. Ebu Davud, Nesai ve Tirmizi AÇIKLAMA : Rivayetlerin çoğunda Fatiha suresinin ayetleri ve ifade ettikleri yüce özelliklere de işaret vardır, Ve hadis metni uzuncadır, EI-Menhel yazarı şöyle der: ''Hadiste 'Salat = Namaz' kelimesi mutlak geçtiği için farz ve nafile bütün namazları kapsar, Darekutni'nin Abdullah bin Amr bin el-As (r.a.)'dan rivayet ettigi: ''Kim farz veya nafile namaz kılarsa içinde Fatiha'yı okusun.\" Hadis bu kapsamayı onaylar. Hadiste geçen: ...\"Ümmü'I-Kitab\" lafzı Fatiha'nın isimlerinden birisidir. Bu lafzın manası: ''Kur'an-ı Kerim'in anası'' demektir. Fatiha'ya bu adın verilmesinin sebebi, Kur'an-ı Kerim'in ana maksadlarının Fatiha'da toplanmış olmasıdır. Şöyle ki; Fatiha'da Allah Teala'ya layıkı vechile hamd ve sena, ilahi emir ve yasağa itaat, uhrevi mükafat ve ceza, dünya ve ahiret halleri, hidayet yolundakilere övgü ve sapıkları zem etmek gibi önemli maksatlar yer almıştır. خداج Hidac: Noksanlıktır. .....''tam değildir.\" lafzı Nebi (s.a.v.)'in buyruğundan olup 'Hidac'ın açıklamasıdır, Ravinin sözü olabilir. Bu takdirde hadise müdrectir (yani sonradan eklenmiştir). Bu hadis, imam, münferid ve imamın arkasında namaz kılana'yı kapsar. Hadis, namazda Fatiha okumak farzdır, diyen cumhur için bir delildir. Bazı alimler: Hadis, içinde Fatiha okunmayan namazın noksan olduğunu bildirmiş, noksanlık ise namazın bozulmasını gerektirmez, demişlerdir. Eğer bu noksanlığın namazın ifsadını gerektirdiğine delalet eden bir alamet ve delil bulunmasaydı, bunların dediği doğru olurdu. Fakat Darekutni'nin rivayet etmiş olduğu ve bir önceki hadisin izahında geçen hadis, bu noksanlıkla kılınan namazın yeterli olmadığını belirtmiştir. İbn-i Abdi'l-Berr: 'Namazda Fatiha okumanın vacib olmadığını söyleyenler, Nebi (s.a.v.)'in ''Noksandır.'' ifadesi Fatiha'sız kılınan namazın caizliğine delalet eder. Ve noksan olan namaz caizdir, demişlerdir. Bu söz hatalıdır. Çünkü noksan olan bir şey tamamlanmış sayılmaz, Namazını tamamlamadan çıkan bir kimsenin yeniden ve tam olarak kılması gerekir, Bu itibarla noksanlığını itiraf ettiği halde, caiz olduğunu iddia edenlerin iddialarını ispatlayıcı delil göstermeleri gerekir', demiştir. (EI-Menhel yazarı el-Baci'den de İbn-i Abdi'l-Berr'in sözüne benzer bir nakil yapmıştır.) Ebu's-Saib: . \"Ben zaman zaman imam'ın arkasında olurum'' sözü ile şunu demek istiyor: 'Ben imama uyduğum zaman Fatiha'yı okuyacak mıyım?' Ebu Hureyre (r.a.), cevabı dikkatle dinlemesini sağlamak maksadıyla Ebu's-Saib'in kolunu tutup bastırmıştı. Ve: \"Ey Farisi! Fatiha'yı gizli oku'' diye cevab vermiştir. İmama uyan kimse, gizli ve açık bil'umum namazlarda Fatiha okur, diyen Şafii için bu hadis delildir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 36
			}
		}
	]
}