{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 842,
			"arabicnumber": 842,
			"text": "Ebu'd-Derda (r.a.)'den rivayet (edildiğine göre bir adam ona (namazda okumanın hükmünü) sorarak : 'İmam okuduğu halde ben (de) okuyacağım (mı)?' demiş. Ebü'd Derda demiştir ki: 'Bir adam, her namazda okumak var mı?' diye Resulullah (Sallallahu Aleyhi ve Sellem)'e (soru) sordu. Resulullah (Sallallahu Aleyhi ve Sellem) de; «Evet! (Her namazda okumak vardır.)» buyurdu. Bunun üzerine kavimden bir zat: '’Bu, vacib oldu.\" dedi.\" AÇIKLAMA : Zevaid yazarı: İsnacldaki Muaviye bin Yahya es-Sadafi zayıf olduğundan isnad zayıftır, demiştir. Fakat Nesai, başka bir senedie rivayet etmiştir. Oradaki metin şöyledir: Kesir bin Mürre el-Hadrami'den rivayet edildiğine göre, kendisi Ebu'd-Derda (r.a.)'den şunu işittim, demiştir: \"Resulullah (s.a.v.)'e: Her namazda kıraat var mı? diye soruldu, Resulullah (s.a.v.): ''Evet!'' buyurdu. (Bunun üzerine) Ensar'dan bir adam: Bu kıraat vacib oldu dedi.. Ebu'd-Derda (r.a.) bunu söyledikten sonra bana döndü. Ben cemaat içinde ona en yakın bir yerde oturmuştum. Şöyle dedi: ''İmam cemaata namaz kıldırdığı zaman onun kıraatı bence hepsi için yeterdir. Ben böyle bilirim.'' Nesai'nin rivayetinden anlaşıldığına göre imarn'ın arkasında namaz kılındığı zaman Ebu'd-Derda (r.a.)'e göre imam'ın kıraatı cemaat için de kafidir. Bu takdire göre Nebi (s.a.v.)'e sorulan soru, imam'ın arkasında kılınan namaza ait değildir, cevabta soruya uygun yorumlanır. Yani imam ve münferid kıraat etmek zorundadır. İmam'ın arkasındaki cemaat için bu zorunluluk yoktur. Müellifin rivayetine göre soru sahibi imam'ın arkasında iken kıraat edip etmeyeceğini Ebu'd-Derda (r.a.)'e sormuş o da Nebi (s.a.v.)'e ''Her namazda kıraat var mı? diye sorulan soruya: Nebi (s.a.v.): ''Evetl'' buyurmuştur. Orada bulunan bir zat da: ''Kıraat vacib oldu.'' demiştir. Bu rivayete göre Ebu'd-Derda (r.a.) imam'a uyan kişinin kıraat etmesinin gerekliliğine hükmetmiş olur. Müellifin isnadının zayıflığını yukarda naklettik. Sindi: ''Bu vacib oldu.'' cümlesinin manası: ''Her namazda kıraat'ın varlığına ait hüküm sabit oldu.\" demektir, der",
			"grades": [
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 40
			}
		}
	]
}