{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 847,
			"arabicnumber": 847,
			"text": "Ebu Musa el-Eş'ari (r.a.)'den rivayet edildiğine göre; Resulullah (Sallallahu Aleyhi ve Sellem) şöyle buyurdu, demiştir: İmam okuduğu zaman, siz susunuz. İmam oturduğu zaman her hangi birinizin ilk zikri teşehhüd olsun.»\" AÇIKLAMA : Müslim, bu hadisi uzun bir metin halinde rivayet etmiştir. Onun rivayetinde: ....''İmam okuduğu zaman susunuz.\" cümlesi yoktur. Müslim; Cerir'in, Süleyman aracılığıyla Katade (r.a.)'den yaptığı rivayette mezkur cümlenin bulunduğunu söylemiştir. Müslim'in arkadaşı Ebu İshak demiştir ki: Ebu'n-Nadr'ın kız kardeşinin oğlu Ebu Bekir, bu hadis hakkında bir söz söyledi. Müslim, Ona: Sen, hıfzı Süleyman'dan daha kuvvetli adam mı istiyorsun? dedi. Ebu Bekir (r.a.), bu sefer Ona şunu sordu: Ebu Hureyre (r.a.)'in hadisine ne dersin? Müslim; Ebu Hureyre (r.a.)'in hadisi sahihtir, dedi. Ebu Hureyre' (r.a.)'in hadisinden maksad; onun, merfu' olarak rivayet ettiği: \"Ve imam okuduğu zaman susunuz.\" hadisidir. Müslim: Bu hadis bence sahihtir, deyince; Ebu Bekir (r.a.) Ona: O halde bunu niçin kitabına almadın? diye sordu. Müslim: Ben, kendimce sahih olan her şeyi buraya koymuş değilim. Ben, buraya ancak ulama'nın ittifak ettikleri hadisleri koydum, dedi. Nevevi, bu hadisin açıklamasını yaparken şöyle der: ''Bilmiş ol ki; 've iza kerea fe ensitu..' ziyadesinin sıhhati hakkında hadis hafızları ihtilaf etmişlerdir. Beyhaki'nin Sünen-i Kebir'de Ebu Davud-i Sicistani'den rivayet ettiğine göre. bu ziyade mahfuz değildir. Keza Beyhaki aynı durumu Yahya bin Main, Ebu Hatim er-Razi, Darekutni ve el-Hafız Ebu Ali en-Nisaburi' den nakletmiştir.' Beyhaki'nin dediğine göre Ebu Ali el-Hafız: Bu lafız mahfuz değildir. Süleyman et-Teymi bu lafzı ilave etmekle Katade (r.a.)'in bütün arkadaşlarına muhalefet etmiştir. Şu lafızların Süleyman'ın ilavesinin zayıflığı üzerinde toplanmış olmaları, Müslim'in bu ilaveyi sahih görmesine tercih edilir. Kaldı ki, Müslim bu ziyadeyi senedli olarak sahihinde rivayet etmemiştir.'' Tirmizi'nin şerhi Tuhfe yazarı da bu ziyade hakkında uzun uzadı konuşmuştur. 'Cehri namazda imam'ın arkasındayken kıraatı terketmek babı'nda verdiği bilgi özetle şöyledir: Hanefi alimlerinin, imamın arkasındayken kıraat yapılmayacağına dair gösterdikleri delillerden birisi de, Ebu Musa el-Eş'ari ve Ebu Hureyre (r.a.)'dan rivayet edilen: 've iza kerea fe ensitu..' hadisidir. Ebu Hureyre (r.a.)'nin hadisini Tirmizi hariç, diğer Kütüb-i Sitte sahipIeri rivayet etmişlerdir. Ebu Musa (r.a.)'ın hadisini de Ahmed ve Müslim tahric etmişlerdir. Anılan iki sahabi'nin rivayet ettikleri hadislerde bulunup, Hanefi alimlerince delil olarak gösterilen mezkur cümle, hadis hafızlarmın ekserisi yanında mahfuz değildir. Mahfuz olduğu teslim edilse bile imam'ın arkasındayken okumanın yasaklığına delil gösterilmesi sıhhatlı değildir. Bunun çok yönden izahı vardır. Bunlardan birisi, mevcud hadisleri uzlaştırmak için bu cümlede emredilen susmak ile Fatiha'dan başka bir şey okumamak istenmiştir, şeklinde yapılan yorumdur. El-Hafız İbn-i Hacer, Fethu'I-Bari'de: 'Cehri naınazlarda imam'a uyan kişi, Fatiha okumaz, diyen Malikiler ve bu görüşteki alimler; 've iza kerea fe ensitu ' hadisini delil göstermişlerdir. Bu hadis sahihtir. Müslim, bu hadisi Ebu Musa el-Eş'ari (r.a.)'den tahric etmiştir. Fakat bu görüş'e delaleti yoktur, Çünkü cemaat, imam okurken, susmayı ve Fatiha'yı okumayı beraber yürütebilir, Şöyle ki: İmam Fatiha'yı okurken cemaat dinler. İmam sekte yapınca cemaat Fatiha okur, Ve imam sure okuyunca cemaat onu dinler, sure'yi okuma, Buhari, Cüz'ul-Kıraat'ta: Eğer bu hadis sahih olsaydı şöyle yorumlanabilirdi: Cehri namazlarda cemaat Fatiha'dan başka bir şey okumaz, imam'ı dinler. İmam sekte yaptığında cemaat'ın fatiha okuması, bu hadise aykırı degildir, demiştir.' der. Ebu Hureyre (r.a.), Peygamber (s.a.v.)'in vefatından sonra, cehri namazlar olsun, gizli namazlar olsun, bütün namazlarda imam'ın arkasındayken kişinin Fatiha okumasına hükmederdi. Üzerinde konuşulan hadisin ravisi de kendisidir",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 45
			}
		}
	]
}