{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 871,
			"arabicnumber": 871,
			"text": "Ali bin Şeyban (r.a.), kavmi tarafından Nebi (Sallallahu Aleyhi ve Sellem)'e elçi olarak gönderilen heyetten idi. Kendisi şöyle demiştir : Biz yola çıktık. Nihayet Resulullah (Sallallahu Aleyhi ve Sellem)'in yanına vardıktan sonra Ona biat ettik. Ve arkasında namaz kıldık. Resulullah (Sallallahu Aleyhi ve Sellem), namazını düzgün kılmayan, yani rüku' ve secde de belini düzgün tutmayan bir adama kulaktan yana göz ucuyla baktı. Nebi (Sallallahu Aleyhi ve Sellem) namazını bitirince: «Ey Müslümanlar cemaati! Rüku' ve secdede belini düzgün tutmayanın namazı yoktur.» buyurdu.\" Not: Zevaid'de: Bu hadisin isnadı sahih olup, ricali sikadır. İbn-i Huzeyme ve İbn-i Hibban, bu hadisi kendi sahihlerinde rivayet etmişlerdir, denilmiştir Diğer tahric: Ahmed, İbn-i Huzeyme ve İbn-i Hibban AÇIKLAMA (869, 870 ve 871): Gerek Ebu Mes'ud (r.a.)'ın hadisinde ve gerekse Ali bin Şeyban (r.a.)'ın hadisinde geçen, bel'in düzgün tutulmasından maksad, rüku' ve secdede bel'in bir süre hareketsiz tutulmasıdır Buna fıkıh lisanında 'Tume'nine'' denilir. EI-MenheI. Tuhfetu'I-Ahvezi ve Sindi, belin düzgün tutulmasını, tume'nine iIe yorumlamışlardır. Şu halde rükü' ve secdede tume'nine yapmayanın,yani en az bir sübhanellah denilecek kadar belini hareketsiz tutmayan kimsenin namazının sahih olmadığına bu babtaki hadisler delalet etmiş oluyor. Bu hususta alimler arasında görüş ayrılığı vardır. Şöyle ki : 1- Şafiiler, Malikiler, Hanbeliler, Davud-i Zahiri ve Hanefiler'den Ebu Yusuf'a gön~ namazda tume'nine farzdır. Onsuz namaz sahih değildir. Cumhürun görüşü de budur. Delilleri de, bu babta rivayet olunan Ebu Mes'ud (r.a.)'in hadisi ile Buhari ve diğerlerinin Ebu Hureyre (r.a.)'den rivayet ettikleri; namazı eksik kılan kişiye Resulullah (s.a.v.)'in namazı tarif ettiğine dair hadis ve buna benzeyen Enes, Rifaa ve Ali bin Şeyban (r.a.)'in hadisleridir. 2- Ebu Hanife ve Muhammed'e göre tume'nine, namazın farzlarından değildir, Rüku' ve secdede vacibtir. Onsuz namaz, günah olmakla beraber sahihtir. Bu iki alimin delili; ''Rüku' edin ve secde edin... '' ayetidir. Derler ki: Arap dilinde rüku' eğilmektir. Sücud da alçalmaktır. Eğilmek ile alçalmanın asgarisi, farzın yerine getirilmesi için kafidir. Rükı' ve secdede tume'nine'nin, yani duraklamanın farz kılınması, Kur'an nassına bir ilave yapmak demektir. Mütevatir delile ahad hadisi ile yapılan ilave muteber değildir. Cumhur, bu iki alime şöyle cevap verir:. Tume'nine Kur'an nassına bir ilave demek değildir. Kur'an'daki rüku' ve secde ile kasdediimiş olan manayı açıklamaktır. Çünkü arap diline göre secde, alnı yere bırakmaktır. Sünnet (hadis), şer'i olan secdenin, tume'nine ile yapılan secde olduğunu beyan etmiştir. Secde'nin vucubunu te'kid etmek üzere mezkur ayetin inişi, bu görüşü te'yid eder. Nebi (s.a.v.) ve beraberindekiler, ayetin inişinden önce de namaz kılarlardı. Ve tume'ninesiz kılmazlardı. Cumhur, bu konuda rivayet olunmuş olan hadislerin tume'ninesiz olarak kılınan namazın sahih olmadığına delalet ettiklerini söyleyerek, tume'ninenin farz olduğuna hükmetmişlerdir Tuhfetü'I-Ahvezi yazarı, 'Rüku' ve secdede belini düzgün tutmayan babı'nda rivayet edilen Ebu Mes'ud (r.a.)'ın hadisini açıkladıktan sonra şöyle der: ''Cumhura göre namazın bütün rükünlerinde tume'nine farzdır. Hak olanı da budur. EI-Hafız: 'Hanefi alimlerinden meşhur olan rivayet, tume'ninenin sünnet oluşudur. Bir çok müellifleri, bunu belirtmiştir. Fakat Tahavi'nin Sözü, Hanefi alimlerine göre tume'nine'nin vacib olduğuna delalet eder, Çünkü Tahavi, rüku' ve secde miktarını söz konusu ettiğinde, rüku'da üç defa 'Sübhane Rabbiye'l-Azim' denileceğine dair Ebu Davud'un ve başkasının rivayet ettiği hadisi zikrederek: Bu duanın okunacağı süre, rüku'un en az süresidir, dedikten sonra şöyle der: Bazı alimler: Rüku' ve secdenin miktarı budur. Daha az süre kafi değildir, demişlerdir. Bir kısım alimler, bunlara muhalefet ederek: Rüku' halinde durduğu ve secde halinde durakladığı zaman, kafidir, demişlerdir. Ebu Hanife, Ebu Yusuf, ve Muhammed'in kavli budur demiştir. Ben derim ki ta'dili erkan ve bütün rükünlerde tume'nine, Ebu Yusuf'a göre farzdır. Ama Ebu Hanife ve Muhammed'e göre kimisi vacibtir, kimisi sünnettir, demiştir. Es-Siaye sahibi, Hanefi alimlerinin kitablarında konu ile ilgili ibareleri naklettikten sonra şöyle der: 'Hulasa rüku' ve secde, alimlerin ittifakıyla iki rükündür. İhtilaf, bunlardaki tume'nine hakkındadır. Şafii ve Ebu Yusuf'a göre tume'nine farzdır. Tahavi'nin nakline göre Ebu Hanife ile Muhamımed'e göre de tarzdır. El-Cürcani'nin tahricine göre Ebu Hanife ile Muhammed, bunun sünnet olduğuna hükmetmişlerdir. El-Kerhi'nin tahricine göre Ebu Hanife ile Muhammed, tume'ninenin vacibliği görüşündedirler. Büyük bir cemaatın Ebu Hanife ile Muhammed'den naklettikleri görüş, bu son görüştür. Hanefi mezhebine ait metinler de bu görüş üzerinde toplanmışlardır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 69
			}
		}
	]
}