{
	"metadata": {
		"name": "Sunan Ibn Majah",
		"section": {
			"5": "Establishing the Prayer and the Sunnah Regarding Them"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 913,
			"arabicnumber": 913,
			"text": "(Abdullah) bin Ömer (r.a.)'den şöyle demiştir : Nebi (Sallallahu Aleyhi ve Sellem) namazda (teşehhüd için) oturduğu zaman ellerini dizlerinin üzerine koyardı ve başparmaktan sonra gelen sağ (şahadet) parmağını kaldırıp onunla dua ederdi. Sol elini de dizi üzerine yayarak koyardı.\" AÇIKLAMA (911, 912, 913): Ebu Davud'un ''Elleri kaldırmak babı\"nda rivayet olunan 912 nodaki Vail (r.a.)'ın uzunca hadisinde şu parça vardır: ''...ve Nebi (s.a.v.) sol elini sol uyluğunun üzerine koydu. Sağ dirseğinin de sağ uyluğuna değmesine mani oldu. (Uzak tuttu.) İki parmağını (serçe parmağı ile ondan sonra gelen parmağı) yumdu. (Beş parmağı ile orta parmağının başlarını birleştirerek) halka yaptı ve ben O'nu şöyle yaparken gördüm. Ravi Bişr baş parmağı ile orta parmağı halka yaptı şehadet parmağı ile de işaret etti.\" EI-Menhel yazarının bildirdiğine göre Ahmed, Nesai, İbn-i Huzeyme ve Buhari de bu hadisi rivayet etmişlerdir. İbn-i Ömer (r.a.)'in hadisini Müslim, Ahmed, Ebu Davud ve Nesai de az lafız farkıyla rivayet etmişlerdir. Nesai'nin bir rivayeti ile Taberani' nin rivayeti buradaki rivayete benzer. EI-Menhel yazarı parmakları yummak, halka yapmak ve parmakla işaret etmek hakkında şu bilgiyi verir: ''Baş parmagın yumulması iki türlü olabilir: Baş parmak şehadet parmağının yanına konulur. Şehadet parmağı açık tutulur. Ve diğer parmaklar yumulur. Bu şekil, arapların bir hesap usü!üne göre 53 sayısını ifade eder. İkinci tür'e göre baş parmak orta parmagın yanına konularak yumulur. Diğer parmaklar da yumulur. Yalnız şehadet parmağı yumulmaz. Bu şekil ise, arapların mezkur hesap usulüne göre 23 sayısını ifade eder. Sağ elin parmakları başka şekillerde de yumulabilir. Örneğin; Baş parmak ile şehadet parmağı salınır, diğer parmaklar yumulur. (Vail bin Hucr (r.a.)'in hadisinde bildirilen tahlik de iki şekilde olabilir; Birisine göre baş parmak ile orta parmağın uçları birleştirilir. Diğer şekle göre orta parmağın ucu baş parmağın iki bogumu ara.sına konulur. Şehadet parmağı ile kıbleye işaret etmek şekli hakkında da ihtilaf vardır; Şöyle ki ; 1- Maliki alimlerine göre şehadet parmağı ile işaret edilir. Ve selam verilinceye kadar sağa sola oynatılır. Bunun hikmeti ise parmak sinirlerinin kalbe bağlı oluşu ve parmağın hareket ettirilmesi ile kalbin uyarılması ve namaz hallerinin hatırlatılmasının sağlanmasıdır. 2- Şafiiler'e göre kelime-i şehadet getirilirken ''İlleIlah'' denildiği zaman kaldırılır ve birinci teşehhüd'den kalkılıncaya, son teşehhüdde selam verilinceye kadar indirilmez. Parmak işareti ile tevhid ve ihlas niyeti edilir. 3- Hanefi alimlerine göre parmak ''La ilahe'' denilince kaldırılır ve ''İlleIlah'' denilince indirilir. (Hanefi alimlerinden Muhammed'e göre sağ elin baş parmağı ile orta parmağı halka edilir, diğer parmaklar yumulur. Ve şehadet parmağı kaldırılarak işaret edilir. Bazılarına göre diğer parmaklar yumulmadan şehadet parmağı ile işaret edilir. Bir kısım alimlere göre ise baş parmak diğer parmaklarına getirilerek şehadet parmağı kaldırılır.) 4- Hanbeliler'e göre ''Allah'' lafzı geçtikçe şehadet parmağı tevhid'e işaret olmak üzere kaldırılır. Ve hareket ettirilmez.'' Numeyr (r.a.)'in hadisinde Nebi (s.a.v.)'in ellerini uylukları üzerine koyduğuna delalet eder. İbn-i Ömer (r.a.)'in hadisine göre ellerini dizleri üzerine koymuştur. İki şekil yapıldığına dair başka rivayetler de vardır. Bu rivayetler arasında bir ihtilaf söz konusu değildir. Her iki şeklin caizliğini bildirmek için Nebi (s.a.v.) gah böyle gah şöyle yapmıştır. Sağ elin parmaklarının ne zaman yumulacağı hususuna gelince, Şafii, Maliki ve Hanbeli mezhebIerine göre teşehhüd'e oturulduğu zaman parmaklar yumulur. Yalnız şehadet parmağı salınır. Hanefi mezhebinin muhtar kavline göre sağ avuç olarak sağ uyluk üzerine konulur. Şehadet parmağı ile işaret edildiği zaman parmaklar yukarda anlatıldıgı gibi yumulur. Vail (r.a.)'ın hadisinde: ''Nebi (s.a.v.) şehadet parmağı ile dua.ederek... '' buyurulmuştur. Sindi diyor ki: Şehadet parmağı ile tevhid'e işaret ediliyor. Tevhid'e işaret ise bir nevi dua sayılır. Çünkü tevhid sayesinde kazanılan ilahi nimetler dua etmekle elde edilen nimetlerden üstündür. HADİSLERİN FIKIH YÖNÜ: 1- Teşehhüd için oturulurken elleri dizler üzerine koymak müstahaptır. 2- Sol avueun açık olarak konulması müstahabtır. 3- Sağ elin şehadet parmağı ile işaret etmek müstahabtır",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Fouad Abd al-Baqi",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan Or Sahih"
				}
			],
			"reference": {
				"book": 5,
				"hadith": 111
			}
		}
	]
}