{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"5": "The Book of Mosques and Places of Prayer"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 1563,
			"arabicnumber": "682.01",
			"text": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا عبيد الله بن عبد المجيد، حدثنا سلم بن زرير العطاردي، قال سمعت أبا رجاء العطاردي، عن عمران بن حصين، قال كنت مع نبي الله صلى الله عليه وسلم في مسير له فأدلجنا ليلتنا حتى إذا كان في وجه الصبح عرسنا فغلبتنا أعيننا حتى بزغت الشمس - قال - فكان أول من استيقظ منا أبو بكر وكنا لا نوقظ نبي الله صلى الله عليه وسلم من منامه إذا نام حتى يستيقظ ثم استيقظ عمر فقام عند نبي الله صلى الله عليه وسلم فجعل يكبر ويرفع صوته بالتكبير حتى استيقظ رسول الله صلى الله عليه وسلم فلما رفع رأسه ورأى الشمس قد بزغت قال ‏\"‏ ارتحلوا ‏\"‏ ‏.‏ فسار بنا حتى إذا ابيضت الشمس نزل فصلى بنا الغداة فاعتزل رجل من القوم لم يصل معنا فلما انصرف قال له رسول الله صلى الله عليه وسلم ‏\"‏ يا فلان ما منعك أن تصلي معنا ‏\"‏ ‏.‏ قال يا نبي الله أصابتني جنابة ‏.‏ فأمره رسول الله صلى الله عليه وسلم فتيمم بالصعيد فصلى ثم عجلني في ركب بين يديه نطلب الماء وقد عطشنا عطشا شديدا ‏.‏ فبينما نحن نسير إذا نحن بامرأة سادلة رجليها بين مزادتين فقلنا لها أين الماء قالت أيهاه أيهاه لا ماء لكم ‏.‏ قلنا فكم بين أهلك وبين الماء ‏.‏ قالت مسيرة يوم وليلة ‏.‏ قلنا انطلقي إلى رسول الله صلى الله عليه وسلم ‏.‏ قالت وما رسول الله فلم نملكها من أمرها شيئا حتى انطلقنا بها فاستقبلنا بها رسول الله صلى الله عليه وسلم فسألها فأخبرته مثل الذي أخبرتنا وأخبرته أنها موتمة لها صبيان أيتام فأمر براويتها فأنيخت فمج في العزلاوين العلياوين ثم بعث براويتها فشربنا ونحن أربعون رجلا عطاش حتى روينا وملأنا كل قربة معنا وإداوة وغسلنا صاحبنا غير أنا لم نسق بعيرا وهي تكاد تنضرج من الماء - يعني المزادتين - ثم قال ‏\"‏ هاتوا ما كان عندكم ‏\"‏ ‏.‏ فجمعنا لها من كسر وتمر وصر لها صرة فقال لها ‏\"‏ اذهبي فأطعمي هذا عيالك واعلمي أنا لم نرزأ من مائك ‏\"‏ ‏.‏ فلما أتت أهلها قالت لقد لقيت أسحر البشر أو إنه لنبي كما زعم كان من أمره ذيت وذيت ‏.‏ فهدى الله ذاك الصرم بتلك المرأة فأسلمت وأسلموا ‏.‏",
			"grades": [],
			"reference": {
				"book": 5,
				"hadith": 396
			}
		}
	]
}