{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"12": "The Book of Zakat"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2290,
			"arabicnumber": "987.01",
			"text": "وحدثني سويد بن سعيد، حدثنا حفص، - يعني ابن ميسرة الصنعاني - عن زيد بن أسلم، أن أبا صالح، ذكوان أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من صاحب ذهب ولا فضة لا يؤدي منها حقها إلا إذا كان يوم القيامة صفحت له صفائح من نار فأحمي عليها في نار جهنم فيكوى بها جنبه وجبينه وظهره كلما بردت أعيدت له في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد فيرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏ قيل يا رسول الله فالإبل قال ‏\"‏ ولا صاحب إبل لا يؤدي منها حقها ومن حقها حلبها يوم وردها إلا إذا كان يوم القيامة بطح لها بقاع قرقر أوفر ما كانت لا يفقد منها فصيلا واحدا تطؤه بأخفافها وتعضه بأفواهها كلما مر عليه أولاها رد عليه أخراها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد فيرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏ قيل يا رسول الله فالبقر والغنم قال ‏\"‏ ولا صاحب بقر ولا غنم لا يؤدي منها حقها إلا إذا كان يوم القيامة بطح لها بقاع قرقر لا يفقد منها شيئا ليس فيها عقصاء ولا جلحاء ولا عضباء تنطحه بقرونها وتطؤه بأظلافها كلما مر عليه أولاها رد عليه أخراها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد فيرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏ قيل يا رسول الله فالخيل قال ‏\"‏ الخيل ثلاثة هي لرجل وزر وهي لرجل ستر وهي لرجل أجر فأما التي هي له وزر فرجل ربطها رياء وفخرا ونواء على أهل الإسلام فهي له وزر وأما التي هي له ستر فرجل ربطها في سبيل الله ثم لم ينس حق الله في ظهورها ولا رقابها فهي له ستر وأما التي هي له أجر فرجل ربطها في سبيل الله لأهل الإسلام في مرج وروضة فما أكلت من ذلك المرج أو الروضة من شىء إلا كتب له عدد ما أكلت حسنات وكتب له عدد أرواثها وأبوالها حسنات ولا تقطع طولها فاستنت شرفا أو شرفين إلا كتب الله له عدد آثارها وأرواثها حسنات ولا مر بها صاحبها على نهر فشربت منه ولا يريد أن يسقيها إلا كتب الله له عدد ما شربت حسنات ‏\"‏ ‏.‏ قيل يا رسول الله فالحمر قال ‏\"‏ ما أنزل على في الحمر شىء إلا هذه الآية الفاذة الجامعة ‏{‏ فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏ ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		}
	]
}