{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 3695,
			"text": "وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن أبي عمر، - وتقاربا في لفظ الحديث - قال ابن أبي عمر حدثنا وقال، إسحاق أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبيد الله بن عبد الله بن أبي ثور، عن ابن عباس، قال لم أزل حريصا أنأسأل عمر عن المرأتين من أزواج النبي صلى الله عليه وسلم اللتين قال الله تعالى ‏{‏إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ حتى حج عمر وحججت معه فلما كنا ببعض الطريق عدل عمر وعدلت معه بالإداوة فتبرز ثم أتاني فسكبت على يديه فتوضأ فقلت يا أمير المؤمنين من المرأتان من أزواج النبي صلى الله عليه وسلم اللتان قال الله عز وجل لهما ‏{‏ إن تتوبا إلى الله فقد صغت قلوبكما‏}‏ قال عمر واعجبا لك يا ابن عباس - قال الزهري كره والله ما سأله عنه ولم يكتمه - قال هي حفصة وعائشة ‏.‏ ثم أخذ يسوق الحديث قال كنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم - قال - وكان منزلي في بني أمية بن زيد بالعوالي فتغضبت يوما على امرأتي فإذا هي تراجعني فأنكرت أن تراجعني ‏.‏ فقالت ما تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ فانطلقت فدخلت على حفصة فقلت أتراجعين رسول الله صلى الله عليه وسلم فقالت نعم ‏.‏ فقلت أتهجره إحداكن اليوم إلى الليل قالت نعم ‏.‏ قلت قد خاب من فعل ذلك منكن وخسر أفتأمن إحداكن أن يغضب الله عليها لغضب رسوله صلى الله عليه وسلم فإذا هي قد هلكت لا تراجعي رسول الله صلى الله عليه وسلم ولا تسأليه شيئا وسليني ما بدا لك ولا يغرنك أن كانت جارتك هي أوسم وأحب إلى رسول الله صلى الله عليه وسلم منك - يريد عائشة - قال وكان لي جار من الأنصار فكنا نتناوب النزول إلى رسول الله صلى الله عليه وسلم فينزل يوما وأنزل يوما فيأتيني بخبر الوحى وغيره وآتيه بمثل ذلك وكنا نتحدث أن غسان تنعل الخيل لتغزونا فنزل صاحبي ثم أتاني عشاء فضرب بابي ثم ناداني فخرجت إليه فقال حدث أمر عظيم ‏.‏ قلت ماذا أجاءت غسان قال لا بل أعظم من ذلك وأطول طلق النبي صلى الله عليه وسلم نساءه ‏.‏ فقلت قد خابت حفصة وخسرت قد كنت أظن هذا كائنا حتى إذا صليت الصبح شددت على ثيابي ثم نزلت فدخلت على حفصة وهى تبكي فقلت أطلقكن رسول الله صلى الله عليه وسلم فقالت لا أدري ها هو ذا معتزل في هذه المشربة ‏.‏ فأتيت غلاما له أسود فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى فقال قد ذكرتك له فصمت فانطلقت حتى انتهيت إلى المنبر فجلست فإذا عنده رهط جلوس يبكي بعضهم فجلست قليلا ثم غلبني ما أجد ثم أتيت الغلام فقلت استأذن لعمر ‏.‏ فدخل ثم خرج إلى ‏.‏ فقال قد ذكرتك له فصمت ‏.‏ فوليت مدبرا فإذا الغلام يدعوني فقال ادخل فقد أذن لك فدخلت فسلمت على رسول الله صلى الله عليه وسلم فإذا هو متكئ على رمل حصير قد أثر في جنبه فقلت أطلقت يا رسول الله نساءك فرفع رأسه إلى وقال ‏\"‏ لا ‏\"‏ ‏.‏ فقلت الله أكبر لو رأيتنا يا رسول الله وكنا معشر قريش قوما نغلب النساء فلما قدمنا المدينة وجدنا قوما تغلبهم نساؤهم فطفق نساؤنا يتعلمن من نسائهم فتغضبت على امرأتي يوما فإذا هي تراجعني فأنكرت أن تراجعني ‏.‏ فقالت ما تنكر أن أراجعك فوالله إن أزواج النبي صلى الله عليه وسلم ليراجعنه وتهجره إحداهن اليوم إلى الليل ‏.‏ فقلت قد خاب من فعل ذلك منهن وخسر أفتأمن إحداهن أن يغضب الله عليها لغضب رسوله صلى الله عليه وسلم فإذا هي قد هلكت فتبسم رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد دخلت على حفصة فقلت لا يغرنك أن كانت جارتك هي أوسم منك وأحب إلى رسول الله صلى الله عليه وسلم منك ‏.‏ فتبسم أخرى فقلت أستأنس يا رسول الله ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ فجلست فرفعت رأسي في البيت فوالله ما رأيت فيه شيئا يرد البصر إلا أهبا ثلاثة فقلت ادع الله يا رسول الله أن يوسع على أمتك فقد وسع على فارس والروم وهم لا يعبدون الله فاستوى جالسا ثم قال ‏\"‏ أفي شك أنت يا ابن الخطاب أولئك قوم عجلت لهم طيباتهم في الحياة الدنيا ‏\"‏ ‏.‏ فقلت استغفر لي يا رسول الله ‏.‏ وكان أقسم أن لا يدخل عليهن شهرا من شدة موجدته عليهن ‏.‏ حتى عاتبه الله عز وجل ‏.‏ قال الزهري فأخبرني عروة، عن عائشة، قالت لما مضى تسع وعشرون ليلة دخل على رسول الله صلى الله عليه وسلم بدأ بي فقلت يا رسول الله إنك أقسمت أن لا تدخل علينا شهرا وإنك دخلت من تسع وعشرين أعدهن ‏.‏ فقال ‏\"‏ إن الشهر تسع وعشرون - ثم قال - يا عائشة إني ذاكر لك أمرا فلا عليك أن لا تعجلي فيه حتى تستأمري أبويك ‏\"‏ ‏.‏ ثم قرأ على الآية ‏{‏ يا أيها النبي قل لأزواجك‏}‏ حتى بلغ ‏{‏ أجرا عظيما‏}‏ قالت عائشة قد علم والله أن أبوى لم يكونا ليأمراني بفراقه قالت فقلت أوفي هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة ‏.‏ قال معمر فأخبرني أيوب أن عائشة قالت لا تخبر نساءك أني اخترتك فقال لها النبي صلى الله عليه وسلم ‏\"‏ إن الله أرسلني مبلغا ولم يرسلني متعنتا ‏\"‏ ‏.‏ قال قتادة صغت قلوبكما مالت قلوبكما‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}