{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 454,
			"arabicnumber": "183.01",
			"text": "وحدثني سويد بن سعيد، قال حدثني حفص بن ميسرة، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن ناسا، في زمن رسول الله صلى الله عليه وسلم قالوا يا رسول الله هل نرى ربنا يوم القيامة قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال ‏\"‏ هل تضارون في رؤية الشمس بالظهيرة صحوا ليس معها سحاب وهل تضارون في رؤية القمر ليلة البدر صحوا ليس فيها سحاب ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ قال ‏\"‏ ما تضارون في رؤية الله تبارك وتعالى يوم القيامة إلا كما تضارون في رؤية أحدهما إذا كان يوم القيامة أذن مؤذن ليتبع كل أمة ما كانت تعبد ‏.‏ فلا يبقى أحد كان يعبد غير الله سبحانه من الأصنام والأنصاب إلا يتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله من بر وفاجر وغبر أهل الكتاب فيدعى اليهود فيقال لهم ما كنتم تعبدون قالوا كنا نعبد عزير ابن الله ‏.‏ فيقال كذبتم ما اتخذ الله من صاحبة ولا ولد فماذا تبغون قالوا عطشنا يا ربنا فاسقنا ‏.‏ فيشار إليهم ألا تردون فيحشرون إلى النار كأنها سراب يحطم بعضها بعضا فيتساقطون في النار ‏.‏ ثم يدعى النصارى فيقال لهم ما كنتم تعبدون قالوا كنا نعبد المسيح ابن الله ‏.‏ فيقال لهم كذبتم ‏.‏ ما اتخذ الله من صاحبة ولا ولد ‏.‏ فيقال لهم ماذا تبغون فيقولون عطشنا يا ربنا فاسقنا ‏.‏ - قال - فيشار إليهم ألا تردون فيحشرون إلى جهنم كأنها سراب يحطم بعضها بعضا فيتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله تعالى من بر وفاجر أتاهم رب العالمين سبحانه وتعالى في أدنى صورة من التي رأوه فيها ‏.‏ قال فما تنتظرون تتبع كل أمة ما كانت تعبد ‏.‏ قالوا يا ربنا فارقنا الناس في الدنيا أفقر ما كنا إليهم ولم نصاحبهم ‏.‏ فيقول أنا ربكم ‏.‏ فيقولون نعوذ بالله منك لا نشرك بالله شيئا - مرتين أو ثلاثا - حتى إن بعضهم ليكاد أن ينقلب ‏.‏ فيقول هل بينكم وبينه آية فتعرفونه بها فيقولون نعم ‏.‏ فيكشف عن ساق فلا يبقى من كان يسجد لله من تلقاء نفسه إلا أذن الله له بالسجود ولا يبقى من كان يسجد اتقاء ورياء إلا جعل الله ظهره طبقة واحدة كلما أراد أن يسجد خر على قفاه ‏.‏ ثم يرفعون رءوسهم وقد تحول في صورته التي رأوه فيها أول مرة فقال أنا ربكم ‏.‏ فيقولون أنت ربنا ‏.‏ ثم يضرب الجسر على جهنم وتحل الشفاعة ويقولون اللهم سلم سلم ‏\"‏ ‏.‏ قيل يا رسول الله وما الجسر قال ‏\"‏ دحض مزلة ‏.‏ فيه خطاطيف وكلاليب وحسك تكون بنجد فيها شويكة يقال لها السعدان فيمر المؤمنون كطرف العين وكالبرق وكالريح وكالطير وكأجاويد الخيل والركاب فناج مسلم ومخدوش مرسل ومكدوس في نار جهنم ‏.‏ حتى إذا خلص المؤمنون من النار فوالذي نفسي بيده ما منكم من أحد بأشد مناشدة لله في استقصاء الحق من المؤمنين لله يوم القيامة لإخوانهم الذين في النار يقولون ربنا كانوا يصومون معنا ويصلون ويحجون ‏.‏ فيقال لهم أخرجوا من عرفتم ‏.‏ فتحرم صورهم على النار فيخرجون خلقا كثيرا قد أخذت النار إلى نصف ساقيه وإلى ركبتيه ثم يقولون ربنا ما بقي فيها أحد ممن أمرتنا به ‏.‏ فيقول ارجعوا فمن وجدتم في قلبه مثقال دينار من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها أحدا ممن أمرتنا ‏.‏ ثم يقول ارجعوا فمن وجدتم في قلبه مثقال نصف دينار من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها ممن أمرتنا أحدا ‏.‏ ثم يقول ارجعوا فمن وجدتم في قلبه مثقال ذرة من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها خيرا ‏\"‏ ‏.‏ وكان أبو سعيد الخدري يقول إن لم تصدقوني بهذا الحديث فاقرءوا إن شئتم ‏{‏ إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما‏}‏ ‏\"‏ فيقول الله عز وجل شفعت الملائكة وشفع النبيون وشفع المؤمنون ولم يبق إلا أرحم الراحمين فيقبض قبضة من النار فيخرج منها قوما لم يعملوا خيرا قط قد عادوا حمما فيلقيهم في نهر في أفواه الجنة يقال له نهر الحياة فيخرجون كما تخرج الحبة في حميل السيل ألا ترونها تكون إلى الحجر أو إلى الشجر ما يكون إلى الشمس أصيفر وأخيضر وما يكون منها إلى الظل يكون أبيض ‏\"‏ ‏.‏ فقالوا يا رسول الله كأنك كنت ترعى بالبادية قال ‏\"‏ فيخرجون كاللؤلؤ في رقابهم الخواتم يعرفهم أهل الجنة هؤلاء عتقاء الله الذين أدخلهم الله الجنة بغير عمل عملوه ولا خير قدموه ثم يقول ادخلوا الجنة فما رأيتموه فهو لكم ‏.‏ فيقولون ربنا أعطيتنا ما لم تعط أحدا من العالمين ‏.‏ فيقول لكم عندي أفضل من هذا فيقولون يا ربنا أى شىء أفضل من هذا ‏.‏ فيقول رضاى فلا أسخط عليكم بعده أبدا ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 359
			}
		}
	]
}