{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"1": "The Book of Faith"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 480,
			"arabicnumber": "194.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واتفقا في سياق الحديث إلا ما يزيد أحدهما من الحرف بعد الحرف - قالا حدثنا محمد بن بشر حدثنا أبو حيان عن أبي زرعة عن أبي هريرة قال أتي رسول الله صلى الله عليه وسلم يوما بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها نهسة فقال ‏ \"‏ أنا سيد الناس يوم القيامة وهل تدرون بم ذاك يجمع الله يوم القيامة الأولين والآخرين في صعيد واحد فيسمعهم الداعي وينفذهم البصر وتدنو الشمس فيبلغ الناس من الغم والكرب ما لا يطيقون وما لا يحتملون فيقول بعض الناس لبعض ألا ترون ما أنتم فيه ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض ائتوا آدم ‏.‏ فيأتون آدم فيقولون يا آدم أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه نهاني عن الشجرة فعصيته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح ‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى الأرض وسماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد كانت لي دعوة دعوت بها على قومي نفسي نفسي اذهبوا إلى إبراهيم صلى الله عليه وسلم ‏.‏ فيأتون إبراهيم فيقولون أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول لهم إبراهيم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولا يغضب بعده مثله ‏.‏ وذكر كذباته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقولون يا موسى أنت رسول الله فضلك الله برسالاته وبتكليمه على الناس اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم موسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قتلت نفسا لم أومر بقتلها نفسي نفسي اذهبوا إلى عيسى صلى الله عليه وسلم ‏.‏ فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمت الناس في المهد وكلمة منه ألقاها إلى مريم وروح منه فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم عيسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله - ولم يذكر له ذنبا - نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتوني فيقولون يا محمد أنت رسول الله وخاتم الأنبياء وغفر الله لك ما تقدم من ذنبك وما تأخر اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فأنطلق فآتي تحت العرش فأقع ساجدا لربي ثم يفتح الله على ويلهمني من محامده وحسن الثناء عليه شيئا لم يفتحه لأحد قبلي ثم يقال يا محمد ارفع رأسك سل تعطه اشفع تشفع ‏.‏ فأرفع رأسي فأقول يا رب أمتي أمتي ‏.‏ فيقال يا محمد أدخل الجنة من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة لكما بين مكة وهجر أو كما بين مكة وبصرى ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 1,
				"hadith": 386
			}
		}
	]
}