{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"36": "The Book of Drinks"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 5362,
			"arabicnumber": "2055.01",
			"text": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا سليمان بن المغيرة، عن ثابت، عن عبد الرحمن بن أبي ليلى، عن المقداد، قال أقبلت أنا وصاحبان، لي وقد ذهبت أسماعنا وأبصارنا من الجهد فجعلنا نعرض أنفسنا على أصحاب رسول الله صلى الله عليه وسلم فليس أحد منهم يقبلنا فأتينا النبي صلى الله عليه وسلم فانطلق بنا إلى أهله فإذا ثلاثة أعنز فقال النبي صلى الله عليه وسلم ‏\"‏ احتلبوا هذا اللبن بيننا ‏\"‏ ‏.‏ قال فكنا نحتلب فيشرب كل إنسان منا نصيبه ونرفع للنبي صلى الله عليه وسلم نصيبه - قال - فيجيء من الليل فيسلم تسليما لا يوقظ نائما ويسمع اليقظان - قال - ثم يأتي المسجد فيصلي ثم يأتي شرابه فيشرب فأتاني الشيطان ذات ليلة وقد شربت نصيبي فقال محمد يأتي الأنصار فيتحفونه ويصيب عندهم ما به حاجة إلى هذه الجرعة فأتيتها فشربتها فلما أن وغلت في بطني وعلمت أنه ليس إليها سبيل - قال - ندمني الشيطان فقال ويحك ما صنعت أشربت شراب محمد فيجيء فلا يجده فيدعو عليك فتهلك فتذهب دنياك وآخرتك ‏.‏ وعلى شملة إذا وضعتها على قدمى خرج رأسي وإذا وضعتها على رأسي خرج قدماى وجعل لا يجيئني النوم وأما صاحباى فناما ولم يصنعا ما صنعت - قال - فجاء النبي صلى الله عليه وسلم فسلم كما كان يسلم ثم أتى المسجد فصلى ثم أتى شرابه فكشف عنه فلم يجد فيه شيئا فرفع رأسه إلى السماء فقلت الآن يدعو على فأهلك ‏.‏ فقال ‏\"‏ اللهم أطعم من أطعمني وأسق من أسقاني ‏\"‏ ‏.‏ قال فعمدت إلى الشملة فشددتها على وأخذت الشفرة فانطلقت إلى الأعنز أيها أسمن فأذبحها لرسول الله صلى الله عليه وسلم فإذا هي حافلة وإذا هن حفل كلهن فعمدت إلى إناء لآل محمد صلى الله عليه وسلم ما كانوا يطمعون أن يحتلبوا فيه - قال - فحلبت فيه حتى علته رغوة فجئت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أشربتم شرابكم الليلة ‏\"‏ ‏.‏ قال قلت يا رسول الله اشرب ‏.‏ فشرب ثم ناولني فقلت يا رسول الله اشرب ‏.‏ فشرب ثم ناولني فلما عرفت أن النبي صلى الله عليه وسلم قد روي وأصبت دعوته ضحكت حتى ألقيت إلى الأرض - قال - فقال النبي صلى الله عليه وسلم ‏\"‏ إحدى سوآتك يا مقداد ‏\"‏ ‏.‏ فقلت يا رسول الله كان من أمري كذا وكذا وفعلت كذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذه إلا رحمة من الله أفلا كنت آذنتني فنوقظ صاحبينا فيصيبان منها ‏\"‏ ‏.‏ قال فقلت والذي بعثك بالحق ما أبالي إذا أصبتها وأصبتها معك من أصابها من الناس ‏.‏",
			"grades": [],
			"reference": {
				"book": 36,
				"hadith": 236
			}
		}
	]
}