{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6214,
			"arabicnumber": "2403.03",
			"text": "حدثنا محمد بن مسكين اليمامي، حدثنا يحيى بن حسان، حدثنا سليمان، - وهو ابن بلال - عن شريك بن أبي نمر، عن سعيد بن المسيب، أخبرني أبو موسى الأشعري، أنه توضأ في بيته ثم خرج فقال لألزمن رسول الله صلى الله عليه وسلم ولأكونن معه يومي هذا ‏.‏ قال فجاء المسجد فسأل عن النبي صلى الله عليه وسلم فقالوا خرج ‏.‏ وجه ها هنا - قال - فخرجت على أثره أسأل عنه حتى دخل بئر أريس - قال - فجلست عند الباب وبابها من جريد حتى قضى رسول الله صلى الله عليه وسلم حاجته وتوضأ فقمت إليه فإذا هو قد جلس على بئر أريس وتوسط قفها وكشف عن ساقيه ودلاهما في البئر - قال - فسلمت عليه ثم انصرفت فجلست عند الباب فقلت لأكونن بواب رسول الله صلى الله عليه وسلم اليوم ‏.‏ فجاء أبو بكر فدفع الباب فقلت من هذا فقال أبو بكر ‏.‏ فقلت على رسلك - قال - ثم ذهبت فقلت يا رسول الله هذا أبو بكر يستأذن فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏ ‏.‏ قال فأقبلت حتى قلت لأبي بكر ادخل ورسول الله صلى الله عليه وسلم يبشرك بالجنة - قال - فدخل أبو بكر فجلس عن يمين رسول الله صلى الله عليه وسلم معه في القف ودلى رجليه في البئر كما صنع النبي صلى الله عليه وسلم وكشف عن ساقيه ثم رجعت فجلست وقد تركت أخي يتوضأ ويلحقني فقلت إن يرد الله بفلان - يريد أخاه - خيرا يأت به ‏.‏ فإذا إنسان يحرك الباب فقلت من هذا فقال عمر بن الخطاب ‏.‏ فقلت على رسلك ‏.‏ ثم جئت إلى رسول الله صلى الله عليه وسلم فسلمت عليه وقلت هذا عمر يستأذن فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏ ‏.‏ فجئت عمر فقلت أذن ويبشرك رسول الله صلى الله عليه وسلم بالجنة - قال - فدخل فجلس مع رسول الله صلى الله عليه وسلم في القف عن يساره ودلى رجليه في البئر ثم رجعت فجلست فقلت إن يرد الله بفلان خيرا - يعني أخاه - يأت به فجاء إنسان فحرك الباب فقلت من هذا فقال عثمان بن عفان ‏.‏ فقلت على رسلك - قال - وجئت النبي صلى الله عليه وسلم فأخبرته فقال ‏\"‏ ائذن له وبشره بالجنة مع بلوى تصيبه ‏\"‏ ‏.‏ قال فجئت فقلت ادخل ويبشرك رسول الله صلى الله عليه وسلم بالجنة مع بلوى تصيبك - قال - فدخل فوجد القف قد ملئ فجلس وجاههم من الشق الآخر ‏.‏ قال شريك فقال سعيد بن المسيب فأولتها قبورهم ‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 44
			}
		}
	]
}