{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"44": "The Book of the Merits of the Companions"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6290,
			"arabicnumber": "2442.01",
			"text": "حدثني الحسن بن علي الحلواني، وأبو بكر بن النضر وعبد بن حميد قال عبد حدثني وقال الآخران، حدثنا يعقوب بن إبراهيم بن سعد، حدثني أبي، عن صالح، عن ابن، شهاب أخبرني محمد بن عبد الرحمن بن الحارث بن هشام، أن عائشة، زوج النبي صلى الله عليه وسلم قالت أرسل أزواج النبي صلى الله عليه وسلم فاطمة بنت رسول الله صلى الله عليه وسلم إلى رسول الله صلى الله عليه وسلم فاستأذنت عليه وهو مضطجع معي في مرطي فأذن لها فقالت يا رسول الله إن أزواجك أرسلنني إليك يسألنك العدل في ابنة أبي قحافة وأنا ساكتة - قالت - فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أى بنية ألست تحبين ما أحب ‏\"‏ ‏.‏ فقالت بلى ‏.‏ قال ‏\"‏ فأحبي هذه ‏\"‏ ‏.‏ قالت فقامت فاطمة حين سمعت ذلك من رسول الله صلى الله عليه وسلم فرجعت إلى أزواج النبي صلى الله عليه وسلم فأخبرتهن بالذي قالت وبالذي قال لها رسول الله صلى الله عليه وسلم فقلن لها ما نراك أغنيت عنا من شىء فارجعي إلى رسول الله صلى الله عليه وسلم فقولي له إن أزواجك ينشدنك العدل في ابنة أبي قحافة ‏.‏ فقالت فاطمة والله لا أكلمه فيها أبدا ‏.‏ قالت عائشة فأرسل أزواج النبي صلى الله عليه وسلم زينب بنت جحش زوج النبي صلى الله عليه وسلم وهي التي كانت تساميني منهن في المنزلة عند رسول الله صلى الله عليه وسلم ولم أر امرأة قط خيرا في الدين من زينب وأتقى لله وأصدق حديثا وأوصل للرحم وأعظم صدقة وأشد ابتذالا لنفسها في العمل الذي تصدق به وتقرب به إلى الله تعالى ما عدا سورة من حد كانت فيها تسرع منها الفيئة قالت فاستأذنت على رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم مع عائشة في مرطها على الحالة التي دخلت فاطمة عليها وهو بها فأذن لها رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن أزواجك أرسلنني إليك يسألنك العدل في ابنة أبي قحافة ‏.‏ قالت ثم وقعت بي فاستطالت على وأنا أرقب رسول الله صلى الله عليه وسلم وأرقب طرفه هل يأذن لي فيها - قالت - فلم تبرح زينب حتى عرفت أن رسول الله صلى الله عليه وسلم لا يكره أن أنتصر - قالت - فلما وقعت بها لم أنشبها حين أنحيت عليها - قالت - فقال رسول الله صلى الله عليه وسلم وتبسم ‏\"‏ إنها ابنة أبي بكر ‏\"‏ ‏.‏",
			"grades": [],
			"reference": {
				"book": 44,
				"hadith": 120
			}
		}
	]
}