{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"0": "Introduction"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 6410,
			"text": "حدثنا عبد الله بن براد الأشعري، ومحمد بن العلاء الهمداني، قالا حدثنا أبو أسامة حدثني بريد، عن أبي بردة، عن أبي موسى، قال بلغنا مخرج رسول الله صلى الله عليه وسلم ونحن باليمن فخرجنا مهاجرين إليه أنا وأخوان لي أنا أصغرهما أحدهما أبو بردة والآخر أبو رهم - إما قال بضعا وإما قال ثلاثة وخمسين أو اثنين وخمسين رجلا من قومي - قال فركبنا سفينة فألقتنا سفينتنا إلى النجاشي بالحبشة فوافقنا جعفر بن أبي طالب وأصحابه عنده فقال جعفر إن رسول الله صلى الله عليه وسلم بعثنا ها هنا وأمرنا بالإقامة فأقيموا معنا ‏.‏ فأقمنا معه حتى قدمنا جميعا - قال - فوافقنا رسول الله صلى الله عليه وسلم حين افتتح خيبر فأسهم لنا - أو قال أعطانا منها - وما قسم لأحد غاب عن فتح خيبر منها شيئا إلا لمن شهد معه إلا لأصحاب سفينتنا مع جعفر وأصحابه قسم لهم معهم - قال - فكان ناس من الناس يقولون لنا - يعني لأهل السفينة - نحن سبقناكم بالهجرة ‏.‏ قال فدخلت أسماء بنت عميس - وهي ممن قدم معنا - على حفصة زوج النبي صلى الله عليه وسلم زائرة وقد كانت هاجرت إلى النجاشي فيمن هاجر إليه فدخل عمر على حفصة وأسماء عندها فقال عمر حين رأى أسماء من هذه قالت أسماء بنت عميس ‏.‏ قال عمر الحبشية هذه البحرية هذه فقالت أسماء نعم ‏.‏ فقال عمر سبقناكم بالهجرة فنحن أحق برسول الله صلى الله عليه وسلم منكم ‏.‏ فغضبت وقالت كلمة كذبت يا عمر كلا والله كنتم مع رسول الله صلى الله عليه وسلم يطعم جائعكم ويعظ جاهلكم وكنا في دار أو في أرض البعداء البغضاء في الحبشة وذلك في الله وفي رسوله وايم الله لا أطعم طعاما ولا أشرب شرابا حتى أذكر ما قلت لرسول الله صلى الله عليه وسلم ونحن كنا نؤذى ونخاف وسأذكر ذلك لرسول الله صلى الله عليه وسلم وأسأله ووالله لا أكذب ولا أزيغ ولا أزيد على ذلك ‏.‏ قال فلما جاء النبي صلى الله عليه وسلم قالت يا نبي الله إن عمر قال كذا وكذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏ ليس بأحق بي منكم وله ولأصحابه هجرة واحدة ولكم أنتم أهل السفينة هجرتان ‏\"‏ ‏.‏ قالت فلقد رأيت أبا موسى وأصحاب السفينة يأتوني أرسالا يسألوني عن هذا الحديث ما من الدنيا شىء هم به أفرح ولا أعظم في أنفسهم مما قال لهم رسول الله صلى الله عليه وسلم ‏.‏ قال أبو بردة فقالت أسماء فلقد رأيت أبا موسى وإنه ليستعيد هذا الحديث مني ‏.‏",
			"grades": [],
			"reference": {
				"book": 0,
				"hadith": 0
			}
		}
	]
}