{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"50": "The Book of Repentance"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7021,
			"arabicnumber": "2770.01",
			"text": "حدثنا حبان بن موسى، أخبرنا عبد الله بن المبارك، أخبرنا يونس بن يزيد، الأيلي ح وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن رافع، وعبد بن حميد، قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، أخبرنا معمر، والسياق، حديث معمر من رواية عبد وابن رافع قال يونس ومعمر جميعا عن الزهري أخبرني سعيد بن المسيب وعروة بن الزبير وعلقمة بن وقاص وعبيد الله بن عبد الله بن عتبة بن مسعود عن حديث عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله مما قالوا وكلهم حدثني طائفة من حديثها وبعضهم كان أوعى لحديثها من بعض وأثبت اقتصاصا وقد وعيت عن كل واحد منهم الحديث الذي حدثني وبعض حديثهم يصدق بعضا ذكروا أن عائشة زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج سفرا أقرع بين نسائه فأيتهن خرج سهمها خرج بها رسول الله صلى الله عليه وسلم معه - قالت عائشة - فأقرع بيننا في غزوة غزاها فخرج فيها سهمي فخرجت مع رسول الله صلى الله عليه وسلم وذلك بعد ما أنزل الحجاب فأنا أحمل في هودجي وأنزل فيه مسيرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوه وقفل ودنونا من المدينة آذن ليلة بالرحيل فقمت حين آذنوا بالرحيل فمشيت حتى جاوزت الجيش فلما قضيت من شأني أقبلت إلى الرحل فلمست صدري فإذا عقدي من جزع ظفار قد انقطع فرجعت فالتمست عقدي فحبسني ابتغاؤه وأقبل الرهط الذين كانوا يرحلون لي فحملوا هودجي فرحلوه على بعيري الذي كنت أركب وهم يحسبون أني فيه - قالت - وكانت النساء إذ ذاك خفافا لم يهبلن ولم يغشهن اللحم إنما يأكلن العلقة من الطعام فلم يستنكر القوم ثقل الهودج حين رحلوه ورفعوه وكنت جارية حديثة السن فبعثوا الجمل وساروا ووجدت عقدي بعد ما استمر الجيش فجئت منازلهم وليس بها داع ولا مجيب فتيممت منزلي الذي كنت فيه وظننت أن القوم سيفقدوني فيرجعون إلى فبينا أنا جالسة في منزلي غلبتني عيني فنمت وكان صفوان بن المعطل السلمي ثم الذكواني قد عرس من وراء الجيش فادلج فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني فعرفني حين رآني وقد كان يراني قبل أن يضرب الحجاب على فاستيقظت باسترجاعه حين عرفني فخمرت وجهي بجلبابي ووالله ما يكلمني كلمة ولا سمعت منه كلمة غير استرجاعه حتى أناخ راحلته فوطئ على يدها فركبتها فانطلق يقود بي الراحلة حتى أتينا الجيش بعد ما نزلوا موغرين في نحر الظهيرة فهلك من هلك في شأني وكان الذي تولى كبره عبد الله بن أبى ابن سلول فقدمنا المدينة فاشتكيت حين قدمنا المدينة شهرا والناس يفيضون في قول أهل الإفك ولا أشعر بشىء من ذلك وهو يريبني في وجعي أني لا أعرف من رسول الله صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أشتكي إنما يدخل رسول الله صلى الله عليه وسلم فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏ ‏.‏ فذاك يريبني ولا أشعر بالشر حتى خرجت بعد ما نقهت وخرجت معي أم مسطح قبل المناصع وهو متبرزنا ولا نخرج إلا ليلا إلى ليل وذلك قبل أن نتخذ الكنف قريبا من بيوتنا وأمرنا أمر العرب الأول في التنزه وكنا نتأذى بالكنف أن نتخذها عند بيوتنا فانطلقت أنا وأم مسطح وهي بنت أبي رهم بن المطلب بن عبد مناف وأمها ابنة صخر بن عامر خالة أبي بكر الصديق وابنها مسطح بن أثاثة بن عباد بن المطلب فأقبلت أنا وبنت أبي رهم قبل بيتي حين فرغنا من شأننا فعثرت أم مسطح في مرطها فقالت تعس مسطح ‏.‏ فقلت لها بئس ما قلت أتسبين رجلا قد شهد بدرا ‏.‏ قالت أى هنتاه أولم تسمعي ما قال قلت وماذا قال قالت فأخبرتني بقول أهل الإفك فازددت مرضا إلى مرضي فلما رجعت إلى بيتي فدخل على رسول الله صلى الله عليه وسلم فسلم ثم قال ‏\"‏ كيف تيكم ‏\"‏ ‏.‏ قلت أتأذن لي أن آتي أبوى قالت وأنا حينئذ أريد أن أتيقن الخبر من قبلهما ‏.‏ فأذن لي رسول الله صلى الله عليه وسلم فجئت أبوى فقلت لأمي يا أمتاه ما يتحدث الناس فقالت يا بنية هوني عليك فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا كثرن عليها - قالت - قلت سبحان الله وقد تحدث الناس بهذا قالت فبكيت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم ثم أصبحت أبكي ودعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى يستشيرهما في فراق أهله - قالت - فأما أسامة بن زيد فأشار على رسول الله صلى الله عليه وسلم بالذي يعلم من براءة أهله وبالذي يعلم في نفسه لهم من الود فقال يا رسول الله هم أهلك ولا نعلم إلا خيرا ‏.‏ وأما علي بن أبي طالب فقال لم يضيق الله عليك والنساء سواها كثير وإن تسأل الجارية تصدقك - قالت - فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ أى بريرة هل رأيت من شىء يريبك من عائشة ‏\"‏ ‏.‏ قالت له بريرة والذي بعثك بالحق إن رأيت عليها أمرا قط أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن عجين أهلها فتأتي الداجن فتأكله - قالت - فقام رسول الله صلى الله عليه وسلم على المنبر فاستعذر من عبد الله بن أبى ابن سلول - قالت - فقال رسول الله صلى الله عليه وسلم وهو على المنبر ‏\"‏ يا معشر المسلمين من يعذرني من رجل قد بلغ أذاه في أهل بيتي فوالله ما علمت على أهلي إلا خيرا ولقد ذكروا رجلا ما علمت عليه إلا خيرا وما كان يدخل على أهلي إلا معي ‏\"‏ ‏.‏ فقام سعد بن معاذ الأنصاري فقال أنا أعذرك منه يا رسول الله إن كان من الأوس ضربنا عنقه وإن كان من إخواننا الخزرج أمرتنا ففعلنا أمرك - قالت - فقام سعد بن عبادة وهو سيد الخزرج وكان رجلا صالحا ولكن اجتهلته الحمية فقال لسعد بن معاذ كذبت لعمر الله لا تقتله ولا تقدر على قتله ‏.‏ فقام أسيد بن حضير وهو ابن عم سعد بن معاذ فقال لسعد بن عبادة كذبت لعمر الله لنقتلنه فإنك منافق تجادل عن المنافقين فثار الحيان الأوس والخزرج حتى هموا أن يقتتلوا ورسول الله صلى الله عليه وسلم قائم على المنبر فلم يزل رسول الله صلى الله عليه وسلم يخفضهم حتى سكتوا وسكت - قالت - وبكيت يومي ذلك لا يرقأ لي دمع ولا أكتحل بنوم ثم بكيت ليلتي المقبلة لا يرقأ لي دمع ولا أكتحل بنوم وأبواى يظنان أن البكاء فالق كبدي فبينما هما جالسان عندي وأنا أبكي استأذنت على امرأة من الأنصار فأذنت لها فجلست تبكي - قالت - فبينا نحن على ذلك دخل علينا رسول الله صلى الله عليه وسلم فسلم ثم جلس - قالت - ولم يجلس عندي منذ قيل لي ما قيل وقد لبث شهرا لا يوحى إليه في شأني بشىء - قالت - فتشهد رسول الله صلى الله عليه وسلم حين جلس ثم قال ‏\"‏ أما بعد يا عائشة فإنه قد بلغني عنك كذا وكذا فإن كنت بريئة فسيبرئك الله وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه فإن العبد إذا اعترف بذنب ثم تاب تاب الله عليه ‏\"‏ ‏.‏ قالت فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة فقلت لأبي أجب عني رسول الله صلى الله عليه وسلم فيما قال ‏.‏ فقال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت لأمي أجيبي عني رسول الله صلى الله عليه وسلم فقالت والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم فقلت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن إني والله لقد عرفت أنكم قد سمعتم بهذا حتى استقر في نفوسكم وصدقتم به فإن قلت لكم إني بريئة والله يعلم أني بريئة لا تصدقوني بذلك ولئن اعترفت لكم بأمر والله يعلم أني بريئة لتصدقونني وإني والله ما أجد لي ولكم مثلا إلا كما قال أبو يوسف فصبر جميل والله المستعان على ما تصفون ‏.‏ قالت ثم تحولت فاضطجعت على فراشي - قالت - وأنا والله حينئذ أعلم أني بريئة وأن الله مبرئي ببراءتي ولكن والله ما كنت أظن أن ينزل في شأني وحى يتلى ولشأني كان أحقر في نفسي من أن يتكلم الله عز وجل في بأمر يتلى ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها قالت فوالله ما رام رسول الله صلى الله عليه وسلم مجلسه ولا خرج من أهل البيت أحد حتى أنزل الله عز وجل على نبيه صلى الله عليه وسلم فأخذه ما كان يأخذه من البرحاء عند الوحى حتى إنه ليتحدر منه مثل الجمان من العرق في اليوم الشات من ثقل القول الذي أنزل عليه - قالت - فلما سري عن رسول الله صلى الله عليه وسلم وهو يضحك فكان أول كلمة تكلم بها أن قال ‏\"‏ أبشري يا عائشة أما الله فقد برأك ‏\"‏ ‏.‏ فقالت لي أمي قومي إليه فقلت والله لا أقوم إليه ولا أحمد إلا الله هو الذي أنزل براءتي - قالت - فأنزل الله عز وجل ‏{‏ إن الذين جاءوا بالإفك عصبة منكم‏}‏ عشر آيات فأنزل الله عز وجل هؤلاء الآيات براءتي - قالت - فقال أبو بكر وكان ينفق على مسطح لقرابته منه وفقره والله لا أنفق عليه شيئا أبدا بعد الذي قال لعائشة ‏.‏ فأنزل الله عز وجل ‏{‏ ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ إلى قوله ‏{‏ ألا تحبون أن يغفر الله لكم‏}‏ قال حبان بن موسى قال عبد الله بن المبارك هذه أرجى آية في كتاب الله ‏.‏ فقال أبو بكر والله إني لأحب أن يغفر الله لي ‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال لا أنزعها منه أبدا ‏.‏ قالت عائشة وكان رسول الله صلى الله عليه وسلم سأل زينب بنت جحش زوج النبي صلى الله عليه وسلم عن أمري ‏\"‏ ما علمت أو ما رأيت ‏\"‏ ‏.‏ فقالت يا رسول الله أحمي سمعي وبصري والله ما علمت إلا خيرا ‏.‏ قالت عائشة وهي التي كانت تساميني من أزواج النبي صلى الله عليه وسلم فعصمها الله بالورع وطفقت أختها حمنة بنت جحش تحارب لها فهلكت فيمن هلك ‏.‏ قال الزهري فهذا ما انتهى إلينا من أمر هؤلاء الرهط ‏.‏ وقال في حديث يونس احتملته الحمية ‏.‏",
			"grades": [],
			"reference": {
				"book": 50,
				"hadith": 65
			}
		}
	]
}