{
	"metadata": {
		"name": "Sahih Muslim",
		"section": {
			"54": "The Book of Tribulations and Portents of the Last Hour"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 7386,
			"arabicnumber": "2942.01",
			"text": "حدثنا عبد الوارث بن عبد الصمد بن عبد الوارث، وحجاج بن الشاعر، كلاهما عن عبد الصمد، - واللفظ لعبد الوارث بن عبد الصمد - حدثنا أبي، عن جدي، عن الحسين، بن ذكوان حدثنا ابن بريدة، حدثني عامر بن شراحيل الشعبي، شعب همدان أنه سأل فاطمة بنت قيس أخت الضحاك بن قيس وكانت من المهاجرات الأول فقال حدثيني حديثا سمعتيه من رسول الله صلى الله عليه وسلم لا تسنديه إلى أحد غيره فقالت لئن شئت لأفعلن فقال لها أجل حدثيني ‏.‏ فقالت نكحت ابن المغيرة وهو من خيار شباب قريش يومئذ فأصيب في أول الجهاد مع رسول الله صلى الله عليه وسلم فلما تأيمت خطبني عبد الرحمن بن عوف في نفر من أصحاب رسول الله صلى الله عليه وسلم وخطبني رسول الله صلى الله عليه وسلم على مولاه أسامة بن زيد وكنت قد حدثت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحبني فليحب أسامة ‏\"‏ ‏.‏ فلما كلمني رسول الله صلى الله عليه وسلم قلت أمري بيدك فأنكحني من شئت فقال ‏\"‏ انتقلي إلى أم شريك ‏\"‏ ‏.‏ وأم شريك امرأة غنية من الأنصار عظيمة النفقة في سبيل الله ينزل عليها الضيفان فقلت سأفعل فقال ‏\"‏ لا تفعلي إن أم شريك امرأة كثيرة الضيفان فإني أكره أن يسقط عنك خمارك أو ينكشف الثوب عن ساقيك فيرى القوم منك بعض ما تكرهين ولكن انتقلي إلى ابن عمك عبد الله بن عمرو ابن أم مكتوم ‏\"‏ ‏.‏ - وهو رجل من بني فهر فهر قريش وهو من البطن الذي هي منه - فانتقلت إليه فلما انقضت عدتي سمعت نداء المنادي منادي رسول الله صلى الله عليه وسلم ينادي الصلاة جامعة ‏.‏ فخرجت إلى المسجد فصليت مع رسول الله صلى الله عليه وسلم فكنت في صف النساء التي تلي ظهور القوم فلما قضى رسول الله صلى الله عليه وسلم صلاته جلس على المنبر وهو يضحك فقال ‏\"‏ ليلزم كل إنسان مصلاه ‏\"‏ ‏.‏ ثم قال ‏\"‏ أتدرون لم جمعتكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ إني والله ما جمعتكم لرغبة ولا لرهبة ولكن جمعتكم لأن تميما الداري كان رجلا نصرانيا فجاء فبايع وأسلم وحدثني حديثا وافق الذي كنت أحدثكم عن مسيح الدجال حدثني أنه ركب في سفينة بحرية مع ثلاثين رجلا من لخم وجذام فلعب بهم الموج شهرا في البحر ثم أرفئوا إلى جزيرة في البحر حتى مغرب الشمس فجلسوا في أقرب السفينة فدخلوا الجزيرة فلقيتهم دابة أهلب كثير الشعر لا يدرون ما قبله من دبره من كثرة الشعر فقالوا ويلك ما أنت فقالت أنا الجساسة ‏.‏ قالوا وما الجساسة قالت أيها القوم انطلقوا إلى هذا الرجل في الدير فإنه إلى خبركم بالأشواق ‏.‏ قال لما سمت لنا رجلا فرقنا منها أن تكون شيطانة - قال - فانطلقنا سراعا حتى دخلنا الدير فإذا فيه أعظم إنسان رأيناه قط خلقا وأشده وثاقا مجموعة يداه إلى عنقه ما بين ركبتيه إلى كعبيه بالحديد قلنا ويلك ما أنت قال قد قدرتم على خبري فأخبروني ما أنتم قالوا نحن أناس من العرب ركبنا في سفينة بحرية فصادفنا البحر حين اغتلم فلعب بنا الموج شهرا ثم أرفأنا إلى جزيرتك هذه فجلسنا في أقربها فدخلنا الجزيرة فلقيتنا دابة أهلب كثير الشعر لا يدرى ما قبله من دبره من كثرة الشعر فقلنا ويلك ما أنت فقالت أنا الجساسة ‏.‏ قلنا وما الجساسة قالت اعمدوا إلى هذا الرجل في الدير فإنه إلى خبركم بالأشواق فأقبلنا إليك سراعا وفزعنا منها ولم نأمن أن تكون شيطانة فقال أخبروني عن نخل بيسان قلنا عن أى شأنها تستخبر قال أسألكم عن نخلها هل يثمر قلنا له نعم ‏.‏ قال أما إنه يوشك أن لا تثمر قال أخبروني عن بحيرة الطبرية ‏.‏ قلنا عن أى شأنها تستخبر قال هل فيها ماء قالوا هي كثيرة الماء ‏.‏ قال أما إن ماءها يوشك أن يذهب ‏.‏ قال أخبروني عن عين زغر ‏.‏ قالوا عن أى شأنها تستخبر قال هل في العين ماء وهل يزرع أهلها بماء العين قلنا له نعم هي كثيرة الماء وأهلها يزرعون من مائها ‏.‏ قال أخبروني عن نبي الأميين ما فعل قالوا قد خرج من مكة ونزل يثرب ‏.‏ قال أقاتله العرب قلنا نعم ‏.‏ قال كيف صنع بهم فأخبرناه أنه قد ظهر على من يليه من العرب وأطاعوه قال لهم قد كان ذلك قلنا نعم ‏.‏ قال أما إن ذاك خير لهم أن يطيعوه وإني مخبركم عني إني أنا المسيح وإني أوشك أن يؤذن لي في الخروج فأخرج فأسير في الأرض فلا أدع قرية إلا هبطتها في أربعين ليلة غير مكة وطيبة فهما محرمتان على كلتاهما كلما أردت أن أدخل واحدة أو واحدا منهما استقبلني ملك بيده السيف صلتا يصدني عنها وإن على كل نقب منها ملائكة يحرسونها قالت قال رسول الله صلى الله عليه وسلم وطعن بمخصرته في المنبر ‏\"‏ هذه طيبة هذه طيبة هذه طيبة ‏\"‏ ‏.‏ يعني المدينة ‏\"‏ ألا هل كنت حدثتكم ذلك ‏\"‏ ‏.‏ فقال الناس نعم ‏\"‏ فإنه أعجبني حديث تميم أنه وافق الذي كنت أحدثكم عنه وعن المدينة ومكة ألا إنه في بحر الشام أو بحر اليمن لا بل من قبل المشرق ما هو من قبل المشرق ما هو من قبل المشرق ما هو ‏\"‏ ‏.‏ وأومأ بيده إلى المشرق ‏.‏ قالت فحفظت هذا من رسول الله صلى الله عليه وسلم ‏.‏",
			"grades": [],
			"reference": {
				"book": 54,
				"hadith": 147
			}
		}
	]
}