{
	"metadata": {
		"name": "Sunan Abu Dawud",
		"section": {
			"12": "Marriage (Kitab Al-Nikah)"
		}
	},
	"hadiths": [
		{
			"hadithnumber": 2046,
			"arabicnumber": 2046,
			"text": "علقمہ کہتے ہیں کہ میں عبداللہ بن مسعود رضی اللہ عنہ کے ساتھ منیٰ میں چل رہا تھا کہ اچانک ان کی ملاقات عثمان رضی اللہ عنہ سے ہو گئی تو وہ ان کو لے کر خلوت میں گئے، جب عبداللہ بن مسعود رضی اللہ عنہ نے محسوس کیا کہ انہیں ( شادی کی ) ضرورت نہیں ہے تو مجھ سے کہا: علقمہ! آ جاؤ ۱؎ تو میں گیا تو عثمان رضی اللہ عنہ ۲؎ نے ان سے کہا: ابوعبدالرحمٰن! کیا ہم آپ کی شادی ایک کنواری لڑکی سے نہ کرا دیں، شاید آپ کی دیرینہ طاقت و نشاط واپس آ جائے۔ عبداللہ بن مسعود رضی اللہ عنہ نے کہا: اگر آپ ایسی بات کہہ رہے ہیں تو میں تو اللہ کے رسول صلی اللہ علیہ وسلم کو فرماتے ہوئے سن چکا ہوں کہ تم میں سے جو شخص نکاح کی طاقت رکھتا ہو اسے نکاح کر لینا چاہیئے کیونکہ یہ نگاہ کو خوب پست رکھنے والی اور شرمگاہ کی خوب حفاظت کرنے والی چیز ہے اور جو تم میں سے اس کے اخراجات کی طاقت نہ رکھتا ہو تو اس پر روزہ ہے، یہ اس کی شہوت کے لیے توڑ ہو گا ۳؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 1
			}
		},
		{
			"hadithnumber": 2047,
			"arabicnumber": 2047,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ارشاد فرمایا: عورتوں سے نکاح چار چیزوں کی بنا پر کیا جاتا ہے: ان کے مال کی وجہ سے، ان کے حسب و نسب کی وجہ سے، ان کی خوبصورتی کی بنا پر، اور ان کی دین داری کے سبب، تم دیندار عورت سے نکاح کر کے کامیاب بن جاؤ، تمہارے ہاتھ خاک آلود ہوں ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 2
			}
		},
		{
			"hadithnumber": 2048,
			"arabicnumber": 2048,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھ سے فرمایا: کیا تم نے شادی کر لی؟ میں نے کہا: ہاں، آپ صلی اللہ علیہ وسلم نے فرمایا: کنواری سے یا غیر کنواری سے؟ میں نے کہا غیر کنواری سے، آپ صلی اللہ علیہ وسلم نے فرمایا: کنواری سے کیوں نہیں کی تم اس سے کھیلتے اور وہ تم سے کھیلتی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 3
			}
		},
		{
			"hadithnumber": 2049,
			"arabicnumber": 2049,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ ایک شخص نبی اکرم صلی اللہ علیہ وسلم کے پاس آ کر کہنے لگا کہ میری عورت کسی ہاتھ لگانے والے کو نہیں روکتی آپ صلی اللہ علیہ وسلم نے فرمایا: اسے اپنے سے جدا کر دو ، اس شخص نے کہا: مجھے ڈر ہے میرا دل اس میں لگا رہے گا، آپ صلی اللہ علیہ وسلم نے فرمایا: تو تم اس سے فائدہ اٹھاؤ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 4
			}
		},
		{
			"hadithnumber": 2050,
			"arabicnumber": 2050,
			"text": "معقل بن یسار رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے پاس ایک شخص آیا اور اس نے عرض کیا: مجھے ایک عورت ملی ہے جو اچھے خاندان والی ہے، خوبصورت ہے لیکن اس سے اولاد نہیں ہوتی تو کیا میں اس سے شادی کر لوں؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں ، پھر وہ آپ کے پاس دوسری بار آیا تو بھی آپ صلی اللہ علیہ وسلم نے اس کو منع فرمایا، پھر تیسری بار آیا تو آپ صلی اللہ علیہ وسلم نے فرمایا: خوب محبت کرنے والی اور خوب جننے والی عورت سے شادی کرو، کیونکہ ( بروز قیامت ) میں تمہاری کثرت کی وجہ سے دوسری امتوں پر فخر کروں گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 5
			}
		},
		{
			"hadithnumber": 2051,
			"arabicnumber": 2051,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما روایت کرتے ہیں کہ مرثد بن ابی مرثد غنوی رضی اللہ عنہ قیدیوں کو مکہ سے اٹھا لایا کرتے تھے، مکہ میں عناق نامی ایک بدکار عورت تھی جو ان کی آشنا تھی، مرثد رضی اللہ عنہ کا بیان ہے کہ میں نبی اکرم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور عرض کیا: اللہ کے رسول! کیا میں عناق سے شادی کر لوں؟ آپ صلی اللہ علیہ وسلم خاموش رہے تو آیت کریمہ«والزانية لا ينكحها إلا زان أو مشرك» نازل ہوئی تو آپ صلی اللہ علیہ وسلم نے مجھے بلایا اور اسے پڑھ کر سنایا اور فرمایا: تم اس سے شادی نہ کرنا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 6
			}
		},
		{
			"hadithnumber": 2052,
			"arabicnumber": 2052,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: کوڑے کھایا ہوا زناکار اپنی جیسی عورت ہی سے شادی کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 7
			}
		},
		{
			"hadithnumber": 2053,
			"arabicnumber": 2053,
			"text": "ابوموسیٰ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اپنی لونڈی کو آزاد کر کے اس سے شادی کر لے تو اس کے لیے دوہرا ثواب ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 8
			}
		},
		{
			"hadithnumber": 2054,
			"arabicnumber": 2054,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے ام المؤمنین صفیہ رضی اللہ عنہا کو آزاد کیا اور ان کی آزادی ہی کو ان کا مہر قرار دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 9
			}
		},
		{
			"hadithnumber": 2055,
			"arabicnumber": 2055,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: دودھ پلانے سے وہ سارے رشتے حرام ہو جاتے ہیں جو پیدائش سے حرام ہوتے ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 10
			}
		},
		{
			"hadithnumber": 2056,
			"arabicnumber": 2056,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ ام المؤمنین ام حبیبہ رضی اللہ عنہا نے عرض کیا: اللہ کے رسول! کیا آپ کو میری بہن ( عزہ ) میں رغبت ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: تو میں کیا کروں ، انہوں نے کہا: آپ ان سے نکاح کر لیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تمہاری بہن سے؟ انہوں نے کہا، ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تم یہ ( سوکن ) پسند کرو گی؟ انہوں نے کہا: میں آپ کی اکیلی بیوی تو ہوں نہیں جتنی عورتیں میرے ساتھ خیر میں شریک ہیں ان سب میں اپنی بہن کا ہونا مجھے زیادہ پسند ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: وہ میرے لیے حلال نہیں ہے کہا: اللہ کی قسم مجھے تو بتایا گیا ہے کہ آپ درہ یا ذرہ بنت ابی سلمہ ( یہ شک زہیر کو ہوا ہے ) کو پیغام دے رہے ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: ام سلمہ کی بیٹی کو؟ کہا: ہاں! آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ کی قسم ( وہ تو میری ربیبہ ہے ) اگر ربیبہ نہ بھی ہوتی تو وہ میرے لیے حلال نہ ہوتی کیونکہ وہ تو میرے رضاعی بھائی کی بیٹی ہے، مجھے اور اس کے باپ کو ثویبہ نے دودھ پلایا ہے لہٰذا تم اپنی بیٹیوں اور بہنوں کو مجھ پر ( نکاح کے لیے ) پیش نہ کیا کرو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 11
			}
		},
		{
			"hadithnumber": 2057,
			"arabicnumber": 2057,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ میرے پاس افلح بن ابوقعیس آئے تو میں نے پردہ کر لیا، انہوں نے کہا: مجھ سے پردہ کر رہی ہو، میں تو تمہارا چچا ہوں؟ میں نے کہا: چچا کس طرح سے؟ انہوں نے کہا کہ تمہیں میرے بھائی کی بیوی نے دودھ پلایا ہے، ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: مجھے عورت نے دودھ پلایا ہے نہ کہ مرد نے، پھر میرے یہاں جب رسول اللہ صلی اللہ علیہ وسلم تشریف لائے تو میں نے سارا واقعہ آپ سے بیان کر دیا، آپ صلی اللہ علیہ وسلم نے فرمایا: وہ تمہارے چچا ہیں، وہ تمہارے پاس آ سکتے ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 12
			}
		},
		{
			"hadithnumber": 2058,
			"arabicnumber": 2058,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا فرماتی ہیں کہ رسول صلی اللہ علیہ وسلم ان کے پاس تشریف لائے، ان کے پاس ایک شخص بیٹھا ہوا تھا، ( حفص کی روایت میں ہے ) آپ صلی اللہ علیہ وسلم کو یہ بات ناگوار گزری، آپ کا چہرہ متغیر ہو گیا ( پھر حفص اور شعبہ دونوں کی روایتیں متفق ہیں ) عائشہ رضی اللہ عنہا نے کہا: اللہ کے رسول یہ تو میرا رضاعی بھائی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: اچھی طرح دیکھ لو کون تمہارے بھائی ہیں؟ کیونکہ رضاعت تو غذا سے ثابت ہوتی ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 13
			}
		},
		{
			"hadithnumber": 2059,
			"arabicnumber": 2059,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے، انہوں نے کہا رضاعت وہی ہے جو ہڈی کو مضبوط کرے اور گوشت بڑھائے، تو ابوموسیٰ اشعری رضی اللہ عنہ نے کہا: اس عالم کی موجودگی میں تم لوگ ہم سے مسئلہ نہ پوچھا کرو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 14
			}
		},
		{
			"hadithnumber": 2060,
			"arabicnumber": 2060,
			"text": "اس سند سے بھی ابن مسعود رضی اللہ عنہ سے اسی مفہوم کی حدیث مرفوعاً مروی ہے لیکن اس میں: «شد العظم» کے بجائے «أنشز العظم» کا لفظ ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 15
			}
		},
		{
			"hadithnumber": 2061,
			"arabicnumber": 2061,
			"text": "ام المؤمنین عائشہ اور ام سلمہ رضی اللہ عنہما سے روایت ہے کہ ابوحذیفہ بن عتبہ بن ربیعہ بن عبدشمس نے سالم کو ( جو کہ ایک انصاری عورت کے غلام تھے ) منہ بولا بیٹا بنا لیا تھا، جس طرح کہ نبی اکرم صلی اللہ علیہ وسلم نے زید رضی اللہ عنہ کو بنایا تھا، اور اپنی بھتیجی ہند بنت ولید بن عتبہ بن ربیعہ سے ان کا نکاح کرا دیا، زمانہ جاہلیت میں منہ بولے بیٹے کو لوگ اپنی طرف منسوب کرتے تھے اور اسے ان کی میراث بھی دی جاتی تھی یہاں تک کہ اللہ تعالیٰ نے اس سلسلہ میں آیت: «ادعوهم لآبائهم» سے «فإخوانكم في الدين ومواليكم» ۱؎ تک نازل فرمائی تو وہ اپنے اصل باپ کی طرف منسوب ہونے لگے، اور جس کے باپ کا علم نہ ہوتا اسے مولیٰ اور دینی بھائی سمجھتے۔ پھر سہلہ بنت سہیل بن عمرو قرشی ثم عامری جو کہ ابوحذیفہ کی بیوی تھیں آئیں اور انہوں نے عرض کیا: اللہ کے رسول! ہم سالم کو اپنا بیٹا سمجھتے تھے، وہ میرے اور ابوحذیفہ کے ساتھ ایک ہی گھر میں رہتے تھے، اور مجھے گھر کے کپڑوں میں کھلا دیکھتے تھے اب اللہ نے منہ بولے بیٹوں کے بارے میں جو حکم نازل فرما دیا ہے وہ آپ کو معلوم ہی ہے لہٰذا اب اس کے بارے میں آپ کا کیا خیال ہے؟ تو نبی اکرم صلی اللہ علیہ وسلم نے ان سے فرمایا: انہیں دودھ پلا دو ، چنانچہ انہوں نے انہیں پانچ گھونٹ دودھ پلا دیا، اور وہ ان کے رضاعی بیٹے ہو گئے، اسی کے پیش نظر ام المؤمنین عائشہ رضی اللہ عنہا اپنی بھانجیوں اور بھتیجیوں کو حکم دیتیں کہ وہ اس شخص کو پانچ گھونٹ دودھ پلا دیں جسے دیکھنا یا اس کے سامنے آنا چاہتی ہوں گرچہ وہ بڑی عمر کا آدمی ہی کیوں نہ ہو پھر وہ ان کے پاس آتا جاتا، لیکن ام المؤمنین ام سلمہ رضی اللہ عنہا اور دیگر ازواج مطہرات نے اس قسم کی رضاعت کا انکار کیا جب تک کہ دودھ پلانا بچپن میں نہ ہو اور انہوں نے ام المؤمنین عائشہ رضی اللہ عنہا سے کہا: اللہ کی قسم ہمیں یہ معلوم نہیں شاید یہ رسول اللہ صلی اللہ علیہ وسلم کی طرف سے صرف سالم کے لیے رخصت رہی ہو نہ کہ دیگر لوگوں کے لیے ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 16
			}
		},
		{
			"hadithnumber": 2062,
			"arabicnumber": 2062,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ اللہ تعالیٰ نے جو چیزیں نازل کی ہیں ان میں «عشر رضعات يحرمن» والی آیت بھی تھی پھر یہ آیت «خمس معلومات يحرمن» والی آیت سے منسوخ ہو گئی، اس کے بعد نبی اکرم صلی اللہ علیہ وسلم کی وفات ہو گئی اور یہ آیتیں پڑھی جا رہی تھیں ( یعنی بعض لوگ پڑھتے تھے پھر وہ بھی متروک ہو گئیں ) ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 17
			}
		},
		{
			"hadithnumber": 2063,
			"arabicnumber": 2063,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ایک یا دو چوس حرمت ثابت نہیں کرتا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 18
			}
		},
		{
			"hadithnumber": 2064,
			"arabicnumber": 2064,
			"text": "حجاج رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! دودھ پلانے کا حق مجھ سے کس طرح ادا ہو گا؟ آپ صلی اللہ علیہ وسلم نے فرمایا: لونڈی یا غلام ( دودھ پلانے والی کو خدمت کے لیے دے دینے ) سے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 19
			}
		},
		{
			"hadithnumber": 2065,
			"arabicnumber": 2065,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پھوپھی کے نکاح میں رہتے ہوئے بھتیجی سے نکاح نہیں کیا جا سکتا، اور نہ بھتیجی کے نکاح میں رہتے ہوئے پھوپھی سے نکاح درست ہے، اسی طرح خالہ کے نکاح میں رہتے ہوئے بھانجی سے نکاح نہیں کیا جا سکتا ہے، اور نہ ہی بھانجی کے نکاح میں رہتے ہوئے خالہ سے نکاح درست ہے، غرض یہ کہ چھوٹی کے رہتے ہوئے بڑی سے اور بڑی کے رہتے ہوئے چھوٹی سے نکاح جائز نہیں ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 20
			}
		},
		{
			"hadithnumber": 2066,
			"arabicnumber": 2066,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے خالہ اور بھانجی اور اسی طرح پھوپھی اور بھتیجی کو بیک وقت نکاح میں رکھنے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 21
			}
		},
		{
			"hadithnumber": 2067,
			"arabicnumber": 2067,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے پھوپھی اور خالہ کو ( نکاح میں ) جمع کرنے، اسی طرح دو خالاؤں اور دو پھوپھیوں کو ( نکاح میں ) جمع کرنے سے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 22
			}
		},
		{
			"hadithnumber": 2068,
			"arabicnumber": 2068,
			"text": "عروہ بن زبیر نے ام المؤمنین عائشہ رضی اللہ عنہا سے اللہ تعالیٰ کے فرمان: «وإن خفتم ألا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء سورة النساء» ۱؎ کے بارے میں دریافت کیا تو ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: بھانجے! اس سے وہ یتیم لڑکی مراد ہے، جو اپنے ایسے ولی کی پرورش میں ہو جس کے مال میں وہ شریک ہو اور اس کی خوبصورتی اور اس کا مال اسے بھلا لگتا ہو اس کی وجہ سے وہ اس سے بغیر مناسب مہر ادا کئے نکاح کرنا چاہتا ہو ( یعنی جتنا مہر اس کو اور کوئی دیتا اتنا بھی نہ دے رہا ہو ) چنانچہ انہیں ان سے نکاح کرنے سے روک دیا گیا، اگر وہ انصاف سے کام لیں اور انہیں اونچے سے اونچا مہر ادا کریں تو نکاح کر سکتے ہیں ورنہ فرمان رسول ہے کہ ان کے علاوہ جو عورتیں انہیں پسند ہوں ان سے نکاح کر لیں۔ عروہ کا بیان ہے کہ ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ لوگوں نے رسول اللہ صلی اللہ علیہ وسلم سے اس آیت کے نزول کے بعد یتیم لڑکیوں کے بارے میں حکم دریافت کیا تو یہ آیت نازل ہوئی: «ويستفتونك في النساء قل الله يفتيكم فيهن وما يتلى عليكم في الكتاب في يتامى النساء اللاتي لا تؤتونهن ما كتب لهن وترغبون أن تنكحوهن» ۲؎ ام المؤمنین عائشہ نے کہا کہ اس آیت میں اللہ تعالیٰ نے جو یہ فرمایا ہے کہ وہ ان پر کتاب میں پڑھی جاتی ہیں اس سے مراد پہلی آیت ہے جس میں اللہ تعالیٰ نے فرمایا ہے: «وإن خفتم أن لا تقسطوا في اليتامى فانكحواء ما طاب لكم من النساء» اور اس دوسری آیت میں اللہ تعالیٰ کے قول: «وترغبون أن تنكحوهن» سے یہی غرض ہے کہ تم میں سے کسی کی پرورش میں کم مال والی کم حسن والی یتیم لڑکی ہو تو وہ اس کے ساتھ نکاح سے بے رغبتی نہ کرے چنانچہ انہیں منع کیا گیا کہ مال اور حسن کی بنا پر یتیم لڑکیوں سے نکاح کی رغبت کریں، ہاں انصاف کی شرط کے ساتھ درست ہے۔ یونس نے کہا کہ ربیعہ نے اللہ کے فرمان: «وإن خفتم أن لا تقسطوا في اليتامى» کا مطلب یہ بتایا ہے کہ اگر تمہیں یتیم لڑکیوں کے بارے میں انصاف نہ کر پانے کا ڈر ہو تو انہیں چھوڑ دو ( کسی اور عورت سے نکاح کر لو ) میں نے تمہارے لیے چار عورتوں سے نکاح جائز کر دیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 23
			}
		},
		{
			"hadithnumber": 2069,
			"arabicnumber": 2069,
			"text": "علی بن حسین کا بیان ہے وہ لوگ حسین بن علی رضی اللہ عنہ کی شہادت کے زمانے میں یزید بن معاویہ کے پاس سے مدینہ آئے تو ان سے مسور بن مخرمہ رضی اللہ عنہ ملے اور کہا: اگر میرے لائق کوئی خدمت ہو تو بتائیے تو میں نے ان سے کہا: نہیں، انہوں نے کہا: کیا آپ مجھے رسول اللہ صلی اللہ علیہ وسلم کی تلوار دے سکتے ہیں؟ کیونکہ مجھے اندیشہ ہے کہ لوگ آپ سے اسے چھین لیں گے، اللہ کی قسم! اگر آپ اسے مجھے دیدیں گے تو اس تک کوئی ہرگز نہیں پہنچ سکے گا جب تک کہ وہ میرے نفس تک نہ پہنچ جائے ۱؎۔ علی بن ابوطالب رضی اللہ عنہ نے فاطمہ رضی اللہ عنہا کے ہوتے ہوئے ابوجہل کی بیٹی ۲؎ کو نکاح کا پیغام دیا تو میں نے اس سلسلے میں رسول اللہ صلی اللہ علیہ وسلم کو اپنے اسی منبر پر خطبہ دیتے ہوئے سنا، اس وقت میں جوان تھا، آپ صلی اللہ علیہ وسلم نے فرمایا: فاطمہ میرا ٹکڑا ہے، مجھے ڈر ہے کہ وہ دین کے معاملہ میں کسی آزمائش سے دو چار نہ ہو جائے ، پھر آپ صلی اللہ علیہ وسلم نے بنی عبد شمس میں سے اپنے ایک داماد کا ذکر فرمایا، اور اس رشتہ دامادی کی خوب تعریف کی، اور فرمایا: جو بات بھی اس نے مجھ سے کی سچ کر دکھائی، اور جو بھی وعدہ کیا پورا کیا، میں کسی حلال کو حرام اور حرام کو حلال قطعاً نہیں کر رہا ہوں لیکن اللہ کی قسم، اللہ کے رسول کی بیٹی اور اللہ کے دشمن کی بیٹی ہرگز ایک جگہ جمع نہیں ہو سکتی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 24
			}
		},
		{
			"hadithnumber": 2070,
			"arabicnumber": 2070,
			"text": "ابن ابی ملیکہ سے یہی حدیث مروی ہے اس میں ہے: تو علی رضی اللہ عنہ نے اس نکاح سے خاموشی اختیار کر لی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 25
			}
		},
		{
			"hadithnumber": 2071,
			"arabicnumber": 2071,
			"text": "مسور بن مخرمہ رضی اللہ عنہما کا بیان ہے کہ انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو منبر پر فرماتے ہوئے سنا: ہشام بن مغیرہ کے بیٹوں نے ۱؎ اپنی بیٹی کا نکاح علی بن ابی طالب سے کرانے کی اجازت مجھ سے مانگی ہے تو میں اجازت نہیں دیتا، میں اجازت نہیں دیتا، میں اجازت نہیں دیتا، ہاں اگر علی ان کی بیٹی سے نکاح کرنا چاہتے ہیں تو میری بیٹی کو طلاق دے دیں، کیونکہ فاطمہ میرا ٹکڑا ہے جو اسے برا لگتا ہے وہ مجھے بھی برا لگتا ہے اور جس چیز سے اسے تکلیف ہوتی ہے مجھے بھی ہوتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 26
			}
		},
		{
			"hadithnumber": 2072,
			"arabicnumber": 2072,
			"text": "ابن شہاب زہری کہتے ہیں کہ ہم عمر بن عبدالعزیز کے پاس تھے تو عورتوں سے نکاح متعہ ۱؎ کا ذکر ہم میں چل پڑا، تو ان میں سے ایک آدمی نے جس کا نام ربیعہ بن سبرہ تھا کہا: میں اس بات کی گواہی دیتا ہوں کہ میرے والد نے بیان کیا ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے حجۃ الوداع کے موقع پر متعہ سے منع کر دیا ہے ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Shadh"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 27
			}
		},
		{
			"hadithnumber": 2073,
			"arabicnumber": 2073,
			"text": "سبرہ بن معبد جہنی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے عورتوں سے نکاح متعہ کو حرام قرار دیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 28
			}
		},
		{
			"hadithnumber": 2074,
			"arabicnumber": 2074,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے نکاح شغار سے منع فرمایا۔ مسدد نے اپنی حدیث میں اتنا اضافہ کیا ہے: میں نے نافع سے پوچھا: شغار ۱؎ کیا ہے؟ انہوں نے کہا آدمی کسی کی بیٹی سے نکاح ( بغیر مہر کے ) کرے، اور اپنی بیٹی کا نکاح اس سے بغیر مہر کے کر دے اسی طرح کسی کی بہن سے ( بغیر مہر کے ) نکاح کرے اور اپنی بہن کا نکاح اس سے بغیر مہر کے کر دے ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 29
			}
		},
		{
			"hadithnumber": 2075,
			"arabicnumber": 2075,
			"text": "ابن اسحاق سے روایت ہے کہ عبدالرحمٰن بن ہرمزاعرج نے مجھ سے بیان کیا کہ عباس بن عبداللہ بن عباس نے اپنی بیٹی کا نکاح عبدالرحمٰن بن حکم سے کر دیا اور عبدالرحمٰن نے اپنی بیٹی کا نکاح عباس سے کر دیا اور ان دونوں میں سے ہر ایک نے دوسرے سے اپنی بیٹی کے شادی کرنے کو اپنی بیوی کا مہر قرار دیا تو معاویہ نے مروان کو ان کے درمیان جدائی کا حکم لکھ کر بھیجا اور اپنے خط میں یہ بھی لکھا کہ یہی وہ نکاح شغار ہے جس سے اللہ کے رسول صلی اللہ علیہ وسلم نے منع فرمایا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 30
			}
		},
		{
			"hadithnumber": 2076,
			"arabicnumber": 2076,
			"text": "علی رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: حلالہ کرنے والے اور کرانے والے دونوں پر اللہ نے لعنت کی ہے۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 31
			}
		},
		{
			"hadithnumber": 2077,
			"arabicnumber": 2077,
			"text": "حارث الاعور رضی اللہ عنہ ایک صحابی رسول سے روایت کرتے ہیں اور کہتے ہیں کہ ہمارا خیال ہے کہ وہ علی رضی اللہ عنہ ہیں جنہوں نے نبی اکرم صلی اللہ علیہ وسلم سے روایت کی ہے آگے راوی نے اسی مفہوم کی حدیث ذکر کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 32
			}
		},
		{
			"hadithnumber": 2078,
			"arabicnumber": 2078,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو غلام اپنے مالک کی اجازت کے بغیر نکاح کر لے وہ زانی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 33
			}
		},
		{
			"hadithnumber": 2079,
			"arabicnumber": 2079,
			"text": "عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب غلام اپنے مالک کی اجازت کے بغیر نکاح کرے تو اس کا نکاح باطل ہے ۔ ابوداؤد کہتے ہیں: یہ حدیث ضعیف، اور موقوف ہے، یہ ابن عمر رضی اللہ عنہما کا قول ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 34
			}
		},
		{
			"hadithnumber": 2080,
			"arabicnumber": 2080,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: آدمی اپنے بھائی کے پیغام پر پیغام نہ بھیجے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 35
			}
		},
		{
			"hadithnumber": 2081,
			"arabicnumber": 2081,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی نہ تو اپنے بھائی کے نکاح کے پیغام پر پیغام دے اور نہ اس کے سودے پر سودا کرے البتہ اس کی اجازت سے درست ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 36
			}
		},
		{
			"hadithnumber": 2082,
			"arabicnumber": 2082,
			"text": "جابر بن عبداللہ رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جب تم میں سے کوئی عورت کو پیغام نکاح دے تو ہو سکے تو وہ اس چیز کو دیکھ لے جو اسے اس سے نکاح کی طرف راغب کر رہی ہے ۱؎ ۔ راوی کا بیان ہے کہ میں نے ایک لڑکی کو پیغام دیا تو میں اسے چھپ چھپ کر دیکھتا تھا یہاں تک کہ میں نے وہ بات دیکھ ہی لی جس نے مجھے اس کے نکاح کی طرف راغب کیا تھا، میں نے اس سے شادی کر لی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 37
			}
		},
		{
			"hadithnumber": 2083,
			"arabicnumber": 2083,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو عورت اپنے ولی کی اجازت کے بغیر نکاح کرے اس کا نکاح باطل ہے ، آپ صلی اللہ علیہ وسلم نے اسے تین بار فرمایا، ( پھر فرمایا ) اگر اس مرد نے ایسی عورت سے جماع کر لیا تو اس جماع کے عوض عورت کے لیے اس کا مہر ہے اور اگر ولی اختلاف کریں ۱؎ تو بادشاہ اس کا ولی ہے جس کا کوئی ولی نہ ہو ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 38
			}
		},
		{
			"hadithnumber": 2084,
			"arabicnumber": 2084,
			"text": "اس سند سے بھی ام المؤمنین عائشہ رضی اللہ عنہا سے اسی مفہوم کی حدیث مرفوعاً مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 39
			}
		},
		{
			"hadithnumber": 2085,
			"arabicnumber": 2085,
			"text": "ابوموسیٰ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ولی کے بغیر نکاح نہیں ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 40
			}
		},
		{
			"hadithnumber": 2086,
			"arabicnumber": 2086,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا سے روایت ہے کہ وہ ابن حجش کے نکاح میں تھیں، ان کا انتقال ہو گیا اور وہ ان لوگوں میں سے تھے جنہوں نے سر زمین حبشہ کی جانب ہجرت کی تھی تو نجاشی (شاہ حبش) نے ان کا نکاح رسول اللہ صلی اللہ علیہ وسلم سے کر دیا، اور وہ انہیں لوگوں کے پاس (ملک حبش ہی میں) تھیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 41
			}
		},
		{
			"hadithnumber": 2087,
			"arabicnumber": 2087,
			"text": "معقل بن یسار کہتے ہیں کہ میری ایک بہن تھی جس کے نکاح کا پیغام میرے پاس آیا، اتنے میں میرے چچا زاد بھائی آ گئے تو میں نے اس کا نکاح ان سے کر دیا، پھر انہوں نے اسے ایک طلاق رجعی دے دی اور اسے چھوڑے رکھا یہاں تک کہ اس کی عدت پوری ہو گئی، پھر جب اس کے لیے میرے پاس ایک اور نکاح کا پیغام آ گیا تو وہی پھر پیغام دینے آ گئے، میں نے کہا: اللہ کی قسم میں کبھی بھی ان سے اس کا نکاح نہیں کروں گا، تو میرے ہی متعلق یہ آیت نازل ہوئی: «وإذا طلقتم النساء فبلغن أجلهن فلا تعضلوهن أن ينكحن أزواجهن» اور جب تم عورتوں کو طلاق دے دو اور ان کی عدت پوری ہو جائے تو تم انہیں اپنے شوہروں سے نکاح کرنے سے مت روکو ( سورۃ البقرہ: ۲۳۲ ) راوی کا بیان ہے کہ میں نے اپنی قسم کا کفارہ ادا کر دیا، اور ان سے اس کا نکاح کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 42
			}
		},
		{
			"hadithnumber": 2088,
			"arabicnumber": 2088,
			"text": "سمرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس عورت کا نکاح دو ولی کر دیں تو وہ اس کی ہو گی جس سے پہلے نکاح ہوا ہے اور جس شخص نے ایک ہی چیز کو دو آدمیوں سے فروخت کر دیا تو وہ اس کی ہے جس سے پہلے بیچی گئی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 43
			}
		},
		{
			"hadithnumber": 2089,
			"arabicnumber": 2089,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے آیت کریمہ: «لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن» تمہارے لیے حلال نہیں کہ تم عورتوں کے بھی زبردستی وارث بن بیٹھو اور نہ ہی تم انہیں نکاح سے اس لیے روک رکھو کہ جو تم نے انہیں دے رکھا ہے اس میں کچھ لے لو ( سورۃ البقرہ: ۱۹ ) کی تفسیر کے سلسلہ میں مروی ہے کہ جب آدمی کا انتقال ہو جاتا تو اس ( آدمی ) کے اولیا یہ سمجھتے تھے کہ اس عورت کے ہم زیادہ حقدار ہیں بہ نسبت اس کے ولی کے، اگر وہ چاہتے تو اس کا نکاح کر دیتے اور اگر نہ چاہتے تو نہیں کرتے، چنانچہ اسی سلسلہ میں یہ آیت نازل ہوئی ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 44
			}
		},
		{
			"hadithnumber": 2090,
			"arabicnumber": 2090,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ آیت کریمہ: «لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن لتذهبوا ببعض ما آتيتموهن إلا أن يأتين بفاحشة مبينة» اور جب تم عورتوں کو طلاق دے دو اور ان کی عدت پوری ہو جائے تو تم انہیں اپنے شوہروں سے نکاح کرنے سے مت روکو ( سورۃ البقرہ: ۲۳۲ ) کے متعلق مروی ہے کہ ایسا ہوتا تھا کہ آدمی اپنی کسی قرابت دار عورت کا وارث ہوتا تو اسے دوسرے سے نکاح سے روکے رکھتا یہاں تک کہ وہ یا تو مر جاتی یا اسے اپنا مہر دے دیتی تو اللہ تعالیٰ نے اس سلسلہ میں حکم نازل فرما کر ایسا کرنے سے منع کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 45
			}
		},
		{
			"hadithnumber": 2091,
			"arabicnumber": 2091,
			"text": "ضحاک سے بھی اسی مفہوم کی حدیث مروی ہے اس میں ہے: تو اللہ تعالیٰ نے اس کی نصیحت فرمائی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 46
			}
		},
		{
			"hadithnumber": 2092,
			"arabicnumber": 2092,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: غیر کنواری عورت کا نکاح نہ کیا جائے جب تک اس سے پوچھ نہ لیا جائے، اور نہ ہی کنواری عورت کا نکاح بغیر اس کی اجازت کے کیا جائے ، لوگوں نے عرض کیا: اللہ کے رسول! اس کی اجازت کیا ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: ( اس کی اجازت یہ ہے کہ ) وہ خاموش رہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 47
			}
		},
		{
			"hadithnumber": 2093,
			"arabicnumber": 2093,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: یتیم لڑکی سے اس کے نکاح کے لیے اجازت لی جائے گی، اگر وہ خاموشی اختیار کرے تو یہی اس کی اجازت ہے اور اگر انکار کر دے تو اس پر زبردستی نہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 48
			}
		},
		{
			"hadithnumber": 2094,
			"arabicnumber": 2094,
			"text": "اس سند سے بھی محمد بن عمرو سے اسی طریق سے یہی حدیث یوں مروی ہے اس میں «فإن بكت أو سكتت» اگر وہ رو پڑے یا چپ رہے یعنی «بكت» ( رو پڑے ) کا اضافہ ہے، ابوداؤد کہتے ہیں «بكت» ( رو پڑے ) کی زیادتی محفوظ نہیں ہے یہ حدیث میں وہم ہے اور یہ وہم ابن ادریس کی طرف سے ہے یا محمد بن علاء کی طرف سے۔ ابوداؤد کہتے ہیں: اسے ابوعمرو ذکوان نے ام المؤمنین عائشہ رضی اللہ عنہا سے روایت کیا ہے اس میں ہے انہوں نے کہا اللہ کے رسول! باکرہ تو بولنے سے شرمائے گی، آپ صلی اللہ علیہ وسلم نے فرمایا: اس کی خاموشی ہی اس کی رضا مندی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Shadh"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Shadh"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 49
			}
		},
		{
			"hadithnumber": 2095,
			"arabicnumber": 2095,
			"text": "عبداللہ بن عمر رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عورتوں سے ان کی بیٹیوں کے بارے میں مشورہ لو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 50
			}
		},
		{
			"hadithnumber": 2096,
			"arabicnumber": 2096,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ ایک کنواری لڑکی نبی اکرم صلی اللہ علیہ وسلم کے پاس آئی اور اس نے عرض کیا کہ اس کے والد نے اس کا نکاح اس کی مرضی کے بغیر کر دیا ہے، نبی اکرم صلی اللہ علیہ وسلم نے اسے اختیار دیا ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 51
			}
		},
		{
			"hadithnumber": 2097,
			"arabicnumber": 2097,
			"text": "اس سند سے عکرمہ سے یہ حدیث مرسلاً مروی ہے ابوداؤد کہتے ہیں: اس روایت میں ابن عباس رضی اللہ عنہما کا ذکر نہیں ہے، اس روایت کا اسی طرح لوگوں کا مرسلاً روایت کرنا ہی معروف ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 52
			}
		},
		{
			"hadithnumber": 2098,
			"arabicnumber": 2098,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ثیبہ ۱؎ اپنے نفس کا اپنے ولی سے زیادہ حقدار ہے اور کنواری لڑکی سے اس کے بارے میں اجازت لی جائے گی اور اس کی خاموشی ہی اس کی اجازت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 53
			}
		},
		{
			"hadithnumber": 2099,
			"arabicnumber": 2099,
			"text": "عبداللہ بن فضل سے بھی اسی طریق سے اسی مفہوم کی حدیث مروی ہے اس میں ہے: آپ صلی اللہ علیہ وسلم نے فرمایا: ثیبہ اپنے نفس کا اپنے ولی سے زیادہ حقدار ہے اور کنواری لڑکی سے اس کا باپ پوچھے گا ۔ ابوداؤد کہتے ہیں: «أبوها» کا لفظ محفوظ نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 54
			}
		},
		{
			"hadithnumber": 2100,
			"arabicnumber": 2100,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ولی کا ثیبہ عورت پر کچھ اختیار نہیں، اور یتیم لڑکی سے پوچھا جائے گا اس کی خاموشی ہی اس کا اقرار ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 55
			}
		},
		{
			"hadithnumber": 2101,
			"arabicnumber": 2101,
			"text": "خنسا بنت خذام انصاریہ رضی اللہ عنہا سے روایت ہے کہ ان کے والد نے ان کا نکاح کر دیا اور وہ ثیبہ تھیں تو انہوں نے اسے ناپسند کیا چنانچہ وہ رسول اللہ صلی اللہ علیہ وسلم کے پاس حاضر ہوئیں اور آپ سے اس کا ذکر کیا تو آپ نے ان کا نکاح رد کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 56
			}
		},
		{
			"hadithnumber": 2102,
			"arabicnumber": 2102,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ ابوہند نے نبی اکرم صلی اللہ علیہ وسلم کی چندیا میں پچھنا لگایا تو آپ نے فرمایا: بنی بیاضہ کے لوگو! ابوہند سے تم ( اپنی بچیوں کی ) شادی کرو اور ( ان کی بچیوں سے شادی کرنے کے لیے ) تم انہیں نکاح کا پیغام دو ۱؎ ، اور فرمایا: تین چیزوں سے تم علاج کرتے ہو اگر ان میں کسی چیز میں خیر ہے تو وہ پچھنا لگانا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 57
			}
		},
		{
			"hadithnumber": 2103,
			"arabicnumber": 2103,
			"text": "سارہ بنت مقسم نے بیان کیا ہے کہ انہوں نے میمونہ بنت کردم رضی اللہ عنہا کو کہتے سنا کہ میں رسول اللہ صلی اللہ علیہ وسلم کے حج میں اپنے والد کے ساتھ نکلی، میرے والد آپ صلی اللہ علیہ وسلم کے قریب پہنچے، آپ اپنی اونٹنی پر سوار تھے تو وہ آپ کے پاس کھڑے ہو گئے، اور آپ کی باتیں سننے لگے، آپ صلی اللہ علیہ وسلم کے پاس معلموں کے درے کی طرح ایک درہ تھا، میں نے بدوؤں نیز دیگر لوگوں کو کہتے ہوئے سنا کہ تھپتھپانے سے بچو، تھپتھپانے سے بچو تھپتھپانے سے بچو ۱؎۔ میرے والد نے آپ صلی اللہ علیہ وسلم سے قریب جا کر آپ کا پیر پکڑ لیا اور آپ کے رسول ہونے کا اقرار کیا، اور آپ صلی اللہ علیہ وسلم کے پاس ٹھہرے رہے اور آپ کی بات کو غور سے سنا، پھر کہا کہ میں لشکر عثران ( یہ جاہلیت کی جنگ ہے ) میں حاضر تھا، ( ابن مثنی کی روایت میں جیش عثران کے بجائے جیش غثران ہے ) تو طارق بن مرقع نے کہا: مجھے اس کے عوض میں نیزہ کون دیتا ہے؟ میں نے پوچھا: اس کا عوض کیا ہو گا؟ کہا: میری جو پہلی بیٹی ہو گی اس کے ساتھ اس کا نکاح کر دوں گا، چنانچہ میں نے اپنا نیزہ اسے دے دیا اور غائب ہو گیا، جب مجھے پتہ چلا کہ اس کی بیٹی ہو گئی اور جوان ہو گئی ہے تو میں اس کے پاس پہنچ گیا اور اس سے کہا کہ میری بیوی کو میرے ساتھ رخصت کرو تو وہ قسم کھا کر کہنے لگا کہ وہ ایسا نہیں کر سکتا، جب تک کہ میں اسے مہر جدید ادا نہ کر دوں اس عہد و پیمان کے علاوہ جو میرے اور اس کے درمیان ہوا تھا، میں نے بھی قسم کھا لی کہ جو میں اسے دے چکا ہوں اس کے علاوہ کوئی اور مہر نہیں دے سکتا، تو رسول اللہ صلی اللہ علیہ وسلم نے پوچھا: اب وہ کن عورتوں کی عمر میں ہے ( یعنی اس کی عمر اس وقت کیا ہے ) ، اس نے کہا: وہ بڑھاپے کو پہنچ گئی ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: میری رائے ہے کہ تم اسے جانے دو ، تو آپ صلی اللہ علیہ وسلم کی اس بات نے مجھے گھبرا دیا میں آپ کی جانب دیکھنے لگا، آپ صلی اللہ علیہ وسلم نے میری جب یہ حالت دیکھی تو فرمایا: ( گھبراؤ مت ) نہ تم گنہگار ہو گے اور نہ ہی تمہارا ساتھی ۲؎ گنہگار ہو گا ۔ ابوداؤد کہتے ہیں: روایت میں وارد لفظ «قتیر» کا مطلب بڑھاپا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 58
			}
		},
		{
			"hadithnumber": 2104,
			"arabicnumber": 2104,
			"text": "ابراہیم بن میسرہ کی روایت ہے کہ ایک عورت جو نہایت سچی تھی، کہتی ہے: میرے والد زمانہ جاہلیت میں ایک غزوہ میں تھے کہ ( تپتی زمین سے ) لوگوں کے پیر جلنے لگے، ایک شخص بولا: کوئی ہے جو مجھے اپنی جوتیاں دیدے؟ اس کے عوض میں پہلی لڑکی جو میرے یہاں ہو گی اس سے اس کا نکاح کر دوں گا، میرے والد نے جوتیاں نکالیں اور اس کے سامنے ڈال دیں، اس کے یہاں ایک لڑکی پیدا ہوئی اور پھر وہ بالغ ہو گئی، پھر اسی جیسا قصہ بیان کیا لیکن اس میں «قتیر» کا واقعہ مذکور نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 59
			}
		},
		{
			"hadithnumber": 2105,
			"arabicnumber": 2105,
			"text": "ابوسلمہ بن عبدالرحمٰن بن عوف الزہری کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا سے نبی اکرم صلی اللہ علیہ وسلم ( کی ازواج مطہرات ) کے مہر کے بارے میں پوچھا تو انہوں نے بتایا کہ بارہ اوقیہ اور ایک نش تھا ۱؎، میں نے کہا: نش کیا ہے؟ فرمایا: آدھا اوقیہ ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 60
			}
		},
		{
			"hadithnumber": 2106,
			"arabicnumber": 2106,
			"text": "ابوعجفاء سلمی کہتے ہیں کہ عمر رضی اللہ عنہ نے، اللہ ان پر رحم کرے، ہمیں خطاب فرمایا اور کہا: خبردار! عورتوں کے مہر بڑھا چڑھا کر مت باندھو اس لیے کہ اگر یہ ( مہر کی زیادتی ) دنیا میں باعث شرف اور اللہ کے یہاں تقویٰ اور پرہیزگاری کا ذریعہ ہوتی تو رسول اللہ صلی اللہ علیہ وسلم اس کے زیادہ حقدار تھے، آپ نے تو اپنی کسی بھی بیوی اور بیٹی کا بارہ اوقیہ ( چار سو اسی درہم ) سے زیادہ مہر نہیں رکھا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 61
			}
		},
		{
			"hadithnumber": 2107,
			"arabicnumber": 2107,
			"text": "ام المؤمنین ام حبیبہ رضی اللہ عنہا سے روایت ہے کہ کہ وہ عبیداللہ بن حجش کے نکاح میں تھیں، حبشہ میں ان کا انتقال ہو گیا تو نجاشی ( شاہ حبشہ ) نے ان کا نکاح رسول اللہ صلی اللہ علیہ وسلم سے کر دیا، اور آپ کی جانب سے انہیں چار ہزار ( درہم ) مہر دے کر شرحبیل بن حسنہ رضی اللہ عنہ کے ہمراہ انہیں آپ صلی اللہ علیہ وسلم کے پاس روانہ کر دیا ۱؎۔ ابوداؤد کہتے ہیں: حسنہ شرحبیل کی والدہ ۲؎ ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 62
			}
		},
		{
			"hadithnumber": 2108,
			"arabicnumber": 2108,
			"text": "ابن شہاب زہری سے روایت ہے کہ نجاشی ( شاہ حبشہ ) نے ام حبیبہ بنت ابی سفیان رضی اللہ عنہما کا نکاح رسول اللہ صلی اللہ علیہ وسلم کے ساتھ چار ہزار درہم کے عوض کر دیا اور یہ بات آپ کو لکھ بھیجی تو آپ نے قبول فرما لیا",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 63
			}
		},
		{
			"hadithnumber": 2109,
			"arabicnumber": 2109,
			"text": "انس رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے عبدالرحمٰن بن عوف رضی اللہ عنہ کے جسم پر زعفران کا اثر دیکھا تو پوچھا: یہ کیا ہے؟ انہوں نے کہا: اللہ کے رسول! میں نے ایک عورت سے شادی کر لی ہے، پوچھا: اسے کتنا مہر دیا ہے؟ جواب دیا: گٹھلی ( نواۃ ۱؎ ) کے برابر سونا، آپ صلی اللہ علیہ وسلم نے فرمایا: ولیمہ کرو چاہے ایک بکری سے ہی کیوں نہ ہو ۲؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 64
			}
		},
		{
			"hadithnumber": 2110,
			"arabicnumber": 2110,
			"text": "جابر بن عبداللہ رضی اللہ عنہما سے روایت ہے کہ کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس نے کسی عورت کو مہر میں مٹھی بھر ستو یا کھجور دیا تو اس نے ( اس عورت کو اپنے لیے ) حلال کر لیا ۔ ابوداؤد کہتے ہیں: اسے عبدالرحمٰن بن مہدی نے صالح بن رومان سے انہوں نے ابوزبیر سے انہوں نے جابر رضی اللہ عنہ سے موقوفاً روایت کیا ہے اور اسے ابوعاصم نے صالح بن رومان سے، صالح نے ابو الزبیر سے، ابو الزبیر نے جابر رضی اللہ عنہ سے روایت کیا ہے اس میں ہے کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے زمانے میں ایک مٹھی اناج دے کر متعہ کرتے تھے ۱؎۔ ابوداؤد کہتے ہیں: اسے ابن جریج نے ابو الزبیر سے انہوں نے جابر سے ابوعاصم کی روایت کے ہم معنی روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 65
			}
		},
		{
			"hadithnumber": 2111,
			"arabicnumber": 2111,
			"text": "سہل بن سعد ساعدی رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں ایک عورت حاضر ہوئی اور اس نے عرض کیا: اللہ کے رسول! میں نے اپنے آپ کو آپ کے لیے ہبہ کر دیا ہے، پھر وہ کافی دیر کھڑی رہی ( اور آپ صلی اللہ علیہ وسلم نے کوئی جواب نہیں دیا ) تو ایک شخص کھڑا ہوا اور کہنے لگا: اللہ کے رسول! اگر آپ کو حاجت نہیں تو اس سے میرا نکاح کرا دیجئیے، آپ صلی اللہ علیہ وسلم نے فرمایا: کیا تمہارے پاس اسے مہر میں ادا کرنے کے لیے کچھ ہے؟ وہ بولا: میرے اس تہبند کے علاوہ میرے پاس کچھ بھی نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر تم اپنا ازار اسے ( مہر میں ) دے دو گے تو تمہارے پاس تو ازار بھی نہیں رہے گا، لہٰذا کوئی اور چیز تلاش کرو ، وہ بولا: اور تو کچھ بھی نہیں ہے، آپ صلی اللہ علیہ وسلم نے فرمایا: تلاش کرو چاہے لوہے کی انگوٹھی ہی کیوں نہ ہو ، تو اس نے تلاش کیا لیکن اسے کچھ نہ ملا تو رسول اللہ صلی اللہ علیہ وسلم نے اس سے پوچھا: کیا تجھے کچھ قرآن یاد ہے؟ کہنے لگا: ہاں فلاں فلاں سورتیں یاد ہیں، ان کا نام لے کر اس نے بتایا تو آپ صلی اللہ علیہ وسلم نے اس سے کہا: جو کچھ تجھے قرآن یاد ہے اسی کے ( یاد کرانے کے ) بدلے میں نے اس کے ساتھ تیرا نکاح کر دیا ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 66
			}
		},
		{
			"hadithnumber": 2112,
			"arabicnumber": 2112,
			"text": "ابوہریرہ رضی اللہ عنہ سے بھی اسی واقعہ کی طرح مروی ہے لیکن اس میں تہبند اور انگوٹھی کا ذکر نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تجھے قرآن میں سے کیا یاد ہے؟ جواب دیا: سورۃ البقرہ یا اس کے بعد والی سورت تو آپ صلی اللہ علیہ وسلم نے فرمایا: جاؤ اسے بیس آیتیں سکھا دو اور وہ تمہاری بیوی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 67
			}
		},
		{
			"hadithnumber": 2113,
			"arabicnumber": 2113,
			"text": "مکحول سے بھی سہل کی روایت کی طرح مروی ہے، مکحول کہتے تھے کہ رسول اللہ صلی اللہ علیہ وسلم کے بعد کسی کے لیے یہ درست نہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 68
			}
		},
		{
			"hadithnumber": 2114,
			"arabicnumber": 2114,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے اس شخص کے بارے میں مروی ہے جس نے کسی عورت سے نکاح کیا اور پھر اس سے ہمبستری کرنے سے پہلے اور اس کا مہر متعین کرنے سے پہلے وہ انتقال کر گیا تو انہوں نے کہا: اس عورت کو پورا مہر ملے گا اور اس پر عدت لازم ہو گی اور اسے میراث سے حصہ ملے گا۔ اس پر معقل بن سنان رضی اللہ عنہ نے کہا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا آپ نے بروع بنت واشق کے سلسلے میں اسی کا فیصلہ فرمایا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 69
			}
		},
		{
			"hadithnumber": 2115,
			"arabicnumber": 2115,
			"text": "اس سند سے بھی عبداللہ سے مروی ہے عثمان نے اسی کے مثل روایت بیان کی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 70
			}
		},
		{
			"hadithnumber": 2116,
			"arabicnumber": 2116,
			"text": "عبداللہ بن عتبہ بن مسعود سے روایت ہے کہ عبداللہ بن مسعود رضی اللہ عنہ کے پاس ایک شخص کا یہی مسئلہ پیش کیا گیا، راوی کا بیان ہے کہ لوگوں کی اس سلسلہ میں مہینہ بھر یا کہا کئی بار آپ کے پاس آمدورفت رہی، انہوں نے کہا: اس سلسلے میں میرا فیصلہ یہی ہے کہ بلا کم و کاست اسے اپنی قوم کی عورتوں کی طرح مہر ملے گا، وہ میراث کی حقدار ہو گی اور اس پر عدت بھی ہو گی، اگر میرا فیصلہ درست ہے تو اللہ تعالیٰ کی جانب سے ہے، اگر غلط ہے تو میری جانب سے اور شیطان کی طرف سے ہے، اللہ اور اللہ کے رسول اس سے بری ہیں، چنانچہ قبیلہ اشجع کے کچھ لوگ جن میں جراح و ابوسنان بھی تھے کھڑے ہوئے اور کہنے لگے: ابن مسعود! ہم گواہ ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہم میں بروع بنت واشق – جن کے شوہر ہلال بن مرہ اشجعی ہیں، کے سلسلہ میں ایسا ہی فیصلہ کیا تھا جو آپ نے کیا ہے، عبداللہ بن مسعود رضی اللہ عنہ کو جب ان کا فیصلہ رسول اللہ صلی اللہ علیہ وسلم کے فیصلہ کے موافق ہو گیا تو بڑی خوشی ہوئی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 71
			}
		},
		{
			"hadithnumber": 2117,
			"arabicnumber": 2117,
			"text": "عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے ایک شخص سے فرمایا: کیا تم اس بات سے راضی ہو کہ میں تمہارا نکاح فلاں عورت سے کر دوں؟ اس نے جواب دیا: ہاں، پھر عورت سے کہا: کیا تم اس بات سے راضی ہو کہ فلاں مرد سے تمہارا نکاح کر دوں؟ اس نے بھی جواب دیا: ہاں، چنانچہ آپ صلی اللہ علیہ وسلم نے ان دونوں کا نکاح کر دیا، اور آدمی نے اس سے صحبت کر لی لیکن نہ تو اس نے مہر متعین کیا اور نہ ہی اسے کوئی چیز دی، یہ شخص غزوہ حدیبیہ میں شریک تھا اور اسی بنا پر اسے خیبر سے حصہ ملتا تھا، جب اس کی وفات کا وقت ہوا تو کہنے لگا کہ رسول اللہ صلی اللہ علیہ وسلم نے فلاں عورت سے میرا نکاح کرایا تھا، لیکن میں نے نہ تو اس کا مہر مقرر کیا اور نہ اسے کچھ دیا، لہٰذا میں تمہیں گواہ بناتا ہوں کہ میں نے اپنا خیبر سے ملنے والا حصہ اس کے مہر میں دے دیا، چنانچہ اس عورت نے وہ حصہ لے کر ایک لاکھ میں فروخت کیا۔ ابوداؤد کہتے ہیں: عمر بن خطاب رضی اللہ عنہ نے حدیث کے شروع میں ان الفاظ کا اضافہ کیا: رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: بہتر نکاح وہ ہے جو سب سے آسان ہو اور ان کی حدیث سب سے زیادہ کامل ہے اور اس میں «إن رسول الله صلی اللہ علیہ وسلم قال للرجل» کے بجائے «قال رسول الله صلی اللہ علیہ وسلم للرجل» ہے پھر راوی نے اسی مفہوم کی حدیث ذکر کی۔ ابوداؤد کہتے ہیں: اندیشہ ہے کہ یہ حدیث الحاقی ہو کیونکہ معاملہ اس کے برعکس ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 72
			}
		},
		{
			"hadithnumber": 2118,
			"arabicnumber": 2118,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ہمیں خطبہ حاجت اس طرح سکھایا: «إن الحمد لله نستعينه ونستغفره ونعوذ به من شرور أنفسنا من يهد الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله» «يا أيها الذين آمنوا اتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا» اے ایمان والو! اس اللہ سے ڈرو جس کے نام پر ایک دوسرے سے مانگتے ہو اور رشتے ناتے توڑنے سے بھی بچو بیشک اللہ تعالیٰ تم پر نگہبان ہے ( سورۃ النساء: ۱ ) «يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون» اے ایمان والو! اللہ سے ڈرو جیسا کہ اس سے ڈرنے کا حق ہے اور مسلمان ہی رہ کر مرو ( سورۃ آل عمران: ۱۰۲ ) ۔ «يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا * يصلح لكم أعمالكم ويغفر لكم ذنوبكم ومن يطع الله ورسوله فقد فاز فوزا عظيما» اے ایمان والو! اللہ سے ڈرو اور نپی تلی بات کہو اللہ تعالیٰ تمہارے کام سنوار دے گا اور تمہارے گناہ معاف کر دے گا اور جو بھی اللہ اور اس کے رسول کی تابعداری کرے گا اس نے بڑی مراد پالی ( سورۃ الاحزاب: ۷۱، ۷۰ ) ، محمد بن سلیمان کی روایت میں «إن» نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 73
			}
		},
		{
			"hadithnumber": 2119,
			"arabicnumber": 2119,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب خطبہ پڑھتے، پھر راوی نے اسی طرح کی حدیث ذکر کی لیکن اس میں «ورسوله» کے بعد یہ الفاظ زائد ہیں: «أرسله بالحق بشيرا ونذيرا بين يدى الساعة من يطع الله ورسوله فقد رشد ومن يعصهما فإنه لا يضر إلا نفسه ولا يضر الله شيئا» اللہ نے آپ کو حق کے ساتھ قیامت سے پہلے خوشخبری دینے والا اور ڈرانے والا بنا کر بھیجا ہے، جو شخص اللہ اور اس کے رسول کی فرمابرداری کرے گا، وہ ہدایت پا چکا، اور جو ان کی نافرمانی کرے گا تو وہ اللہ کا کچھ نہ بگاڑے گا بلکہ اپنے آپ ہی کو نقصان پہنچائے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 74
			}
		},
		{
			"hadithnumber": 2120,
			"arabicnumber": 2120,
			"text": "بنی سلیم کے ایک شخص کہتے ہیں میں نے امامہ بنت عبدالمطلب سے نکاح کے لیے نبی اکرم صلی اللہ علیہ وسلم کے پاس پیغام بھیجا تو آپ نے بغیر خطبہ پڑھے ان سے میرا نکاح کر دیا۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 75
			}
		},
		{
			"hadithnumber": 2121,
			"arabicnumber": 2121,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول صلی اللہ علیہ وسلم نے مجھ سے شادی کی، اس وقت سات سال کی تھی ( سلیمان کی روایت میں ہے: چھ سال کی تھی ) اور آپ صلی اللہ علیہ وسلم میرے پاس آئے ( شب زفاف منائی ) اس وقت میں نو برس کی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 76
			}
		},
		{
			"hadithnumber": 2122,
			"arabicnumber": 2122,
			"text": "ام المؤمنین ام سلمہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے جب ان سے نکاح کیا تو ان کے پاس تین رات رہے، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: تم اسے اپنے خاندان کے لیے بے عزتی مت تصور کرنا، اگر تم چاہو تو میں تمہارے پاس سات رات رہ سکتا ہوں لیکن پھر اپنی اور بیویوں کے پاس بھی سات سات رات رہوں گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 77
			}
		},
		{
			"hadithnumber": 2123,
			"arabicnumber": 2123,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جب رسول اللہ صلی اللہ علیہ وسلم نے صفیہ رضی اللہ عنہا سے نکاح کیا تو ان کے پاس تین رات گزاری، اور وہ ثیبہ تھیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 78
			}
		},
		{
			"hadithnumber": 2124,
			"arabicnumber": 2124,
			"text": "انس بن مالک رضی اللہ عنہ کہتے ہیں کہ جب کوئی ثیبہ کے رہتے ہوئے کنواری سے شادی کرے تو اس کے ساتھ سات رات رہے، اور جب ثیبہ سے شادی کرے تو اس کے پاس تین رات رہے۔ راوی کا بیان ہے کہ اگر میں یہ کہوں کہ انس رضی اللہ عنہ نے اسے مرفوعاً بیان کیا ہے تو سچ ہے لیکن انہوں نے کہا کہ سنت اسی طرح ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 79
			}
		},
		{
			"hadithnumber": 2125,
			"arabicnumber": 2125,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ جب علی رضی اللہ عنہ نے فاطمہ رضی اللہ عنہا سے شادی کی تو رسول اللہ صلی اللہ علیہ وسلم نے اُن سے کہا: اسے کچھ دے دو ، انہوں نے کہا: میرے پاس تو کچھ بھی نہیں، آپ صلی اللہ علیہ وسلم نے پوچھا: تمہاری حطمی زرہ۱؎ کہاں ہے؟ ۲؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 80
			}
		},
		{
			"hadithnumber": 2126,
			"arabicnumber": 2126,
			"text": "محمد بن عبدالرحمٰن بن ثوبان سے روایت ہے وہ نبی اکرم صلی اللہ علیہ وسلم کے اصحاب میں سے ایک شخص سے روایت کرتے ہیں کہ جب علی رضی اللہ عنہ نے رسول اللہ صلی اللہ علیہ وسلم کی صاحبزادی فاطمہ رضی اللہ عنہا سے شادی کی اور ان کے پاس جانے کا ارادہ کیا تو رسول اللہ صلی اللہ علیہ وسلم نے انہیں منع فرما دیا جب تک کہ وہ انہیں کچھ دے نہ دیں تو انہوں نے کہا: اللہ کے رسول! میرے پاس کچھ نہیں ہے، اس پر نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اسے اپنی زرہ ہی دے دو ، چنانچہ انہیں زرہ دے دی، پھر وہ ان کے پاس گئے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 81
			}
		},
		{
			"hadithnumber": 2127,
			"arabicnumber": 2127,
			"text": "اس سند سے ابن عباس رضی اللہ عنہما سے بھی اسی کے مثل مروی ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 82
			}
		},
		{
			"hadithnumber": 2128,
			"arabicnumber": 2128,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے مجھے ایک عورت کو اس کے شوہر کے پاس پہنچا دینے کا حکم دیا قبل اس کے کہ وہ اسے کچھ دے۔ ابوداؤد کہتے ہیں: خیثمہ کا سماع ام المؤمنین عائشہ رضی اللہ عنہا سے نہیں ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 83
			}
		},
		{
			"hadithnumber": 2129,
			"arabicnumber": 2129,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جس عورت نے مہر یا عطیہ یا وعدے پر نکاح کیا تو نکاح سے قبل ملنے والی چیز عورت کی ہو گی اور جو کچھ نکاح کے بعد ملے گا وہ اسی کا ہے جس کو دیا گیا ( انعام وغیرہ ) ، مرد جس چیز کے سبب اپنے اکرام کا مستحق ہے وہ اس کی بیٹی یا بہن ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 84
			}
		},
		{
			"hadithnumber": 2130,
			"arabicnumber": 2130,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم جب کسی شخص کو شادی کی مبارکباد دیتے تو فرماتے: «بارك الله لك وبارك عليك وجمع بينكما في خير» اللہ تعالیٰ تم کو برکت دے اور اس برکت کو قائم و دائم رکھے، اور تم دونوں کو خیر پر جمع کر دے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 85
			}
		},
		{
			"hadithnumber": 2131,
			"arabicnumber": 2131,
			"text": "بصرہ انصاری رضی اللہ عنہ کہتے ہیں کہ میں نے ایک کنواری پردہ نشین عورت سے نکاح کیا، میں اس کے پاس گیا، تو اسے حاملہ پایا تو اس کے متعلق اللہ کے رسول صلی اللہ علیہ وسلم نے ارشاد فرمایا: اس کی شرمگاہ کو حلال کرنے کے عوض تمہیں مہر ادا کرنا پڑے گا، اور ( پیدا ہونے والا ) بچہ تمہارا غلام ہو گا، اور جب وہ بچہ جن دے – ( حسن کی روایت میں ) تو تو اسے کوڑے لگا ( واحد کے صیغہ کے ساتھ ) اور ابن السری کی روایت میں تو تم اسے کوڑے لگاؤ ( جمع کے صیغہ کے ساتھ ) ، یا آپ صلی اللہ علیہ وسلم نے فرمایا: اس پر حد جاری کرو ۔ ابوداؤد کہتے ہیں: اس حدیث کو قتادہ نے سعید بن زید سے انہوں نے ابن مسیب سے روایت کیا ہے نیز اسے یحییٰ ابن ابی کثیر نے یزید بن نعیم سے، انہوں نے سعید بن مسیب سے اور عطاء خراسانی نے سعید بن مسیب سے روایت کیا ہے سبھی لوگوں نے اسے مرسلاً روایت کیا ہے۔ اور یحییٰ ابن ابی کثیر کی روایت میں ہے کہ بصرہ بن اکثم نے ایک عورت سے نکاح کیا اور سبھی لوگوں کی روایت میں ہے: آپ نے لڑکے کو ان کا غلام بنا دیا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 86
			}
		},
		{
			"hadithnumber": 2132,
			"arabicnumber": 2132,
			"text": "سعید بن مسیب سے روایت ہے کہ بصرہ بن اکثم نامی ایک شخص نے ایک عورت سے نکاح کیا پھر راوی نے اسی مفہوم کی روایت نقل کی لیکن اس میں اتنا زیادہ ہے کہ آپ صلی اللہ علیہ وسلم نے ان کے درمیان جدائی کرا دی اور ابن جریج والی روایت زیادہ کامل ہے۔",
			"grades": [
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 87
			}
		},
		{
			"hadithnumber": 2133,
			"arabicnumber": 2133,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جس کے پاس دو بیویاں ہوں اور اس کا میلان ایک کی جانب ہو تو وہ بروز قیامت اس حال میں آئے گا، کہ اس کا ایک دھڑا جھکا ہوا ہو گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 88
			}
		},
		{
			"hadithnumber": 2134,
			"arabicnumber": 2134,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ رسول اللہ صلی اللہ علیہ وسلم ( اپنی بیویوں کی ) باری مقرر فرماتے تھے اور اس میں انصاف سے کام لیتے تھے، پھر یہ دعا فرماتے تھے: اے اللہ! یہ میری تقسیم ان چیزوں میں ہے جو میرے بس میں ہے، رہی وہ بات جو میرے بس سے باہر ہے اور تیرے بس میں ہے ( یعنی دل کا میلان ) تو تو مجھے اس کی وجہ سے ملامت نہ فرمانا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 89
			}
		},
		{
			"hadithnumber": 2135,
			"arabicnumber": 2135,
			"text": "عروہ کہتے ہیں ام المؤمنین عائشہ رضی اللہ عنہا نے کہا: میرے بھانجے! رسول اللہ صلی اللہ علیہ وسلم ہم ازواج مطہرات کے پاس رہنے کی باری میں بعض کو بعض پر فضیلت نہیں دیتے تھے اور ایسا کم ہی ہوتا تھا کہ آپ صلی اللہ علیہ وسلم ہم سب کے پاس نہ آتے ہوں، اور بغیر محبت کے آپ صلی اللہ علیہ وسلم سب کے قریب ہوتے، اس طرح آپ اپنی اس بیوی کے پاس پہنچ جاتے جس کی باری ہوتی اور اس کے ساتھ رات گزارتے، اور سودہ بنت زمعہ رضی اللہ عنہا عمر رسیدہ ہو گئیں اور انہیں اندیشہ ہوا کہ رسول اللہ صلی اللہ علیہ وسلم انہیں الگ کر دیں گے تو کہنے لگیں: اللہ کے رسول! میری باری عائشہ رضی اللہ عنہا کے لیے رہے گی، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے ان کی یہ بات قبول فرما لی، عائشہ رضی اللہ عنہا کہتی تھیں کہ ہم کہتے تھے کہ اللہ تعالیٰ نے اسی سلسلہ میں یا اور اسی جیسی چیزوں کے سلسلے میں آیت کریمہ: «وإن امرأة خافت من بعلها نشوزا» ( سورۃ النساء: ۱۲۸ ) نازل کی: اگر عورت کو اپنے خاوند کی بدمزاجی کا خوف ہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 90
			}
		},
		{
			"hadithnumber": 2136,
			"arabicnumber": 2136,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ آیت کریمہ: «ترجي من تشاء منهن وتؤوي إليك من تشاء» آپ ان میں سے جسے آپ چاہیں دور رکھیں اور جسے آپ چاہیں اپنے پاس رکھیں ( سورۃ الاحزاب: ۵۱ ) نازل ہوئی تو ہم میں سے جس کسی کی باری ہوتی تھی اس سے اللہ کے رسول صلی اللہ علیہ وسلم اجازت لیتے تھے۔ معاذہ کہتی ہیں کہ یہ سن کر میں نے عائشہ رضی اللہ عنہا سے پوچھا: آپ ایسے موقع پر کیا کہتی تھیں؟ کہنے لگیں: میں تو یہ ہی کہتی تھی کہ اگر میرا بس چلے تو میں اپنے اوپر کسی کو ترجیح نہ دوں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 91
			}
		},
		{
			"hadithnumber": 2137,
			"arabicnumber": 2137,
			"text": "ام المؤمنین عائشہ رضی اللہ عنہا سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے مرض الموت کے موقع پر سب بیویوں کو بلا بھیجا، وہ جمع ہوئیں تو فرمایا: اب تم سب کے پاس آنے جانے کی میرے اندر طاقت نہیں، اگر تم اجازت دے دو تو میں عائشہ کے پاس رہوں ، چنانچہ ان سب نے آپ صلی اللہ علیہ وسلم کو اس کی اجازت دے دی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 92
			}
		},
		{
			"hadithnumber": 2138,
			"arabicnumber": 2138,
			"text": "ابن شہاب زہری سے روایت ہے کہ عروہ بن زبیر رضی اللہ عنہ نے ان سے بیان کیا کہ ام المؤمنین عائشہ رضی اللہ عنہا کا بیان ہے کہ رسول اللہ صلی اللہ علیہ وسلم جب کسی سفر کا ارادہ فرماتے تو اپنی بیویوں کے درمیان قرعہ اندازی کرتے تو جس کا نام نکلتا اس کو لے کر سفر کرتے، آپ صلی اللہ علیہ وسلم نے ہر بیوی کے لیے ایک دن رات کی باری بنا رکھی تھی، سوائے سودہ بنت زمعہ رضی اللہ عنہا کے انہوں نے اپنی باری عائشہ رضی اللہ عنہا کو دے رکھی تھی۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 93
			}
		},
		{
			"hadithnumber": 2139,
			"arabicnumber": 2139,
			"text": "عقبہ بن عامر رضی اللہ عنہ سے روایت ہے کہ کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: پورا کئے جانے کی سب سے زیادہ مستحق شرطیں وہ ہیں جن کے ذریعہ تم نے شرمگاہوں کو حلال کیا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 94
			}
		},
		{
			"hadithnumber": 2140,
			"arabicnumber": 2140,
			"text": "قیس بن سعد رضی اللہ عنہ کہتے ہیں کہ میں حیرہ آیا، تو دیکھا کہ لوگ اپنے سردار کو سجدہ کر رہے ہیں تو میں نے کہا: رسول اللہ صلی اللہ علیہ وسلم اس کے زیادہ حقدار ہیں کہ انہیں سجدہ کیا جائے، میں جب آپ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا تو میں نے آپ سے کہا کہ میں حیرہ شہر آیا تو میں نے وہاں لوگوں کو اپنے سردار کے لیے سجدہ کرتے ہوئے دیکھا تو اللہ کے رسول! آپ اس بات کے زیادہ مستحق ہیں کہ ہم آپ کو سجدہ کریں، آپ صلی اللہ علیہ وسلم نے فرمایا: بتاؤ کیا اگر تم میری قبر کے پاس سے گزرو گے، تو اسے بھی سجدہ کرو گے؟ وہ کہتے ہیں: میں نے کہا: نہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: تم ایسا نہ کرنا، اگر میں کسی کو کسی کے لیے سجدہ کرنے کا حکم دیتا تو عورتوں کو حکم دیتا کہ وہ اپنے شوہروں کو سجدہ کریں اس وجہ سے کہ شوہروں کا حق اللہ تعالیٰ نے مقرر کیا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 95
			}
		},
		{
			"hadithnumber": 2141,
			"arabicnumber": 2141,
			"text": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جب آدمی اپنی بیوی کو اپنے بستر پر بلائے اور وہ انکار کرے اور اس کے پاس نہ آئے جس کی وجہ سے شوہر رات بھر ناراض رہے تو فرشتے اس عورت پر صبح تک لعنت کرتے رہتے ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 96
			}
		},
		{
			"hadithnumber": 2142,
			"arabicnumber": 2142,
			"text": "معاویہ بن حیدہ رضی اللہ عنہ کہتے ہیں کہ میں نے عرض کیا: اللہ کے رسول! ہمارے اوپر ہماری بیوی کا کیا حق ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: یہ کہ جب تم کھاؤ تو اسے بھی کھلاؤ، جب پہنو یا کماؤ تو اسے بھی پہناؤ، چہرے پر نہ مارو، برا بھلا نہ کہو، اور گھر کے علاوہ اس سے جدائی ۱؎ اختیار نہ کرو ۔ ابوداؤد کہتے ہیں: «ولا تقبح» کا مطلب یہ ہے کہ تم اسے «قبحك الله» نہ کہو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 97
			}
		},
		{
			"hadithnumber": 2143,
			"arabicnumber": 2143,
			"text": "معاویہ بن حیدہ قشیری رضی اللہ عنہ کہتے کہ میں نے عرض کیا: اللہ کے رسول! ہم اپنی عورتوں کے پاس کدھر سے آئیں، اور کدھر سے نہ آئیں؟ آپ صلی اللہ علیہ ہیں وسلم نے جواب دیا: اپنی کھیتی ۱؎ میں جدھر سے بھی چاہو آؤ، جب خود کھاؤ تو اسے بھی کھلاؤ، اور جب خود پہنو تو اسے بھی پہناؤ، اس کے چہرہ کی برائی نہ کرو، اور نہ ہی اس کو مارو ۔ ابوداؤد کہتے ہیں: شعبہ نے «أطعمها إذا طعمت واكسها إذا اكتسيت» کے بجائے «تطعمها إذا طعمت وتكسوها إذا اكتسيت» روایت کیا ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 98
			}
		},
		{
			"hadithnumber": 2144,
			"arabicnumber": 2144,
			"text": "معاویہ قشیری رضی اللہ عنہ کہتے ہیں کہ میں رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا اور عرض کیا: ہماری عورتوں کے بارے میں آپ کا کیا حکم ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: جو تم خود کھاتے ہو وہی ان کو بھی کھلاؤ، اور جیسا تم پہنتے ہو ویسا ہی ان کو بھی پہناؤ، اور نہ انہیں مارو، اور نہ برا کہو ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 99
			}
		},
		{
			"hadithnumber": 2145,
			"arabicnumber": 2145,
			"text": "ابوحرہ رقاشی اپنے چچا سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: اگر تم ان کی نافرمانی سے ڈرو تو انہیں بستروں میں ( تنہا ) چھوڑ دو ۔ حماد کہتے ہیں: یعنی ان سے صحبت نہ کرو۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 100
			}
		},
		{
			"hadithnumber": 2146,
			"arabicnumber": 2146,
			"text": "ایاس بن عبداللہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اللہ کی بندیوں کو نہ مارو ، چنانچہ عمر رضی اللہ عنہ رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہنے لگے: ( آپ کے اس فرمان کے بعد ) عورتیں اپنے شوہروں پر دلیر ہو گئی ہیں، چنانچہ آپ صلی اللہ علیہ وسلم نے انہیں مارنے اور تادیب کی رخصت دے دی، پھر عورتیں اپنے شوہروں کی شکایتیں لے کر ازواج مطہرات کے پاس پہنچنے لگیں، تو نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: بہت سی عورتیں اپنے شوہروں کی شکایتیں لے کر محمد کے گھر والوں کے پاس پہنچ رہی ہیں، یہ ( مار پیٹ کرنے والے ) لوگ تم میں بہترین لوگ نہیں ہیں ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 101
			}
		},
		{
			"hadithnumber": 2147,
			"arabicnumber": 2147,
			"text": "عمر بن خطاب رضی اللہ عنہ سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: آدمی سے اپنی بیوی کو مارنے کے تعلق سے پوچھ تاچھ نہ ہو گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 102
			}
		},
		{
			"hadithnumber": 2148,
			"arabicnumber": 2148,
			"text": "جریر رضی اللہ عنہ کہتے ہیں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے ( اجنبی عورت پر ) اچانک نظر پڑ جانے کے بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: تم اپنی نظر پھیر لو ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 103
			}
		},
		{
			"hadithnumber": 2149,
			"arabicnumber": 2149,
			"text": "بریدہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے علی رضی اللہ عنہ سے کہا: علی! ( اجنبی عورت پر ) نگاہ پڑنے کے بعد دوبارہ نگاہ نہ ڈالو کیونکہ پہلی نظر تو تمہارے لیے جائز ہے، دوسری جائز نہیں ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 104
			}
		},
		{
			"hadithnumber": 2150,
			"arabicnumber": 2150,
			"text": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: عورت عورت سے بدن نہ چپکائے وہ اپنے شوہر سے اس کے بارے میں اس طرح بیان کرے گویا اس کا شوہر اسے دیکھ رہا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 105
			}
		},
		{
			"hadithnumber": 2151,
			"arabicnumber": 2151,
			"text": "جابر رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے ایک عورت کو دیکھا تو ( اپنی بیوی ) زینب بنت حجش رضی اللہ عنہا کے پاس آئے اور ان سے اپنی ضرورت پوری کی، پھر صحابہ کرام کے پاس گئے اور ان سے عرض کیا: عورت شیطان کی شکل میں نمودار ہوتی ہے ۱؎، تو جس کے ساتھ اس طرح کا واقعہ پیش آئے وہ اپنی بیوی کے پاس آ جائے، کیونکہ یہ اس کے دل میں آنے والے احساسات کو ختم کر دے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 106
			}
		},
		{
			"hadithnumber": 2152,
			"arabicnumber": 2152,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ میں نے ( قرآن میں وارد لفظ ) «لمم» ( چھوٹے گناہ ) کے مشابہ ان اعمال سے زیادہ کسی چیز کو نہیں پایا جو ابوہریرہ رضی اللہ عنہ سے حدیث میں مذکور ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: اللہ تعالیٰ نے زنا کا جتنا حصہ ہر شخص کے لیے لکھ دیا ہے وہ اسے لازمی طور پر پا کر رہے گا، چنانچہ آنکھوں کا زنا ( غیر محرم کو بنظر شہوت ) دیکھنا ہے زبان کا زنا ( غیر محرم سے شہوت کی ) بات کرنی ہے، ( انسان کا ) نفس آرزو اور خواہش کرتا ہے اور شرمگاہ اس کی تصدیق یا تکذیب کرتی ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 107
			}
		},
		{
			"hadithnumber": 2153,
			"arabicnumber": 2153,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ہر انسان کے لیے زنا کا حصہ متعین ہے، ہاتھ زنا کرتے ہیں، ان کا زنا پکڑنا ہے، پیر زنا کرتے ہیں ان کا زنا چلنا ہے، اور منہ زنا کرتا ہے اس کا زنا بوسہ لینا ہے ۱؎ ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 108
			}
		},
		{
			"hadithnumber": 2154,
			"arabicnumber": 2154,
			"text": "اس سند سے بھی ابوہریرہ رضی اللہ عنہ نبی اکرم صلی اللہ علیہ وسلم سے یہ قصہ روایت کرتے ہیں اس میں ہے کہ آپ نے فرمایا: اور کانوں کا زنا سننا ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 109
			}
		},
		{
			"hadithnumber": 2155,
			"arabicnumber": 2155,
			"text": "ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم نے غزوہ حنین کے دن مقام اوطاس کی طرف ایک لشکر روانہ کیا تو وہ لشکر اپنے دشمنوں سے ملے، ان سے جنگ کی، اور جنگ میں ان پر غالب رہے، اور انہیں قیدی عورتیں ہاتھ لگیں، تو ان کے شوہروں کے مشرک ہونے کی وجہ سے بعض صحابہ کرام نے ان سے جماع کرنے میں حرج جانا، تو اللہ تعالیٰ نے اس سلسلہ میں یہ آیت نازل فرمائی: «والمحصنات من النساء إلا ما ملكت أيمانكم» اور ( حرام کی گئیں ) شوہر والی عورتیں مگر وہ جو تمہاری ملکیت میں آ جائیں ( سورۃ النساء: ۲۴ ) تو وہ ان کے لیے حلال ہیں جب ان کی عدت ختم ہو جائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 110
			}
		},
		{
			"hadithnumber": 2156,
			"arabicnumber": 2156,
			"text": "ابو الدرداء رضی اللہ عنہ سے روایت ہے کہ رسول اللہ صلی اللہ علیہ وسلم کسی غزوہ میں تھے کہ آپ کی نظر ایک حاملہ عورت پر پڑی تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”اس کے مالک نے شاید اس سے جماع کیا ہے“، لوگوں نے کہا: ہاں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: ”میں نے ارادہ کیا کہ میں اس پر ایسی لعنت کروں کہ وہ اس کی قبر میں اس کے ساتھ داخل ہو جائے، بھلا کیونکر وہ اپنے لڑکے کو اپنا وارث بنائے گا حالانکہ وہ اس کے لیے حلال نہیں، وہ کیسے اس سے خدمت لے گا حالانکہ وہ اس کے لیے حلال نہیں“۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 111
			}
		},
		{
			"hadithnumber": 2157,
			"arabicnumber": 2157,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے جنگ اوطاس کی قیدی عورتوں کے متعلق فرمایا: ”کسی بھی حاملہ سے وضع حمل سے قبل جماع نہ کیا جائے اسی طرح کسی بھی غیر حاملہ سے جماع نہ کیا جائے، یہاں تک کہ اسے ایک حیض آ جائے“۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih Lighairihi"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 112
			}
		},
		{
			"hadithnumber": 2158,
			"arabicnumber": 2158,
			"text": "حنش صنعانی کہتے ہیں کہ رویفع بن ثابت انصاری ہم میں بحیثیت خطیب کھڑے ہوئے اور کہا: سنو! میں تم سے وہی کہوں گا جو میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا ہے، آپ جنگ حنین کے دن فرما رہے تھے: ”اللہ اور آخرت کے دن پر ایمان لانے والے کسی بھی شخص کے لیے حلال نہیں کہ وہ اپنے سوا کسی اور کی کھیتی کو سیراب کرے“، (آپ صلی اللہ علیہ وسلم کا مطلب حاملہ لونڈی سے جماع کرنا تھا) اور اللہ اور آخرت کے دن پر ایمان لانے والے شخص کے لیے حلال نہیں کہ وہ کسی قیدی لونڈی سے جماع کرے یہاں تک کہ وہ استبراء رحم کر لے، (یعنی یہ جان لے کہ یہ عورت حاملہ نہیں ہے) اللہ اور آخرت کے دن پر ایمان رکھنے والے شخص کے لیے حلال نہیں کہ مال غنیمت کے سامان کو بیچے یہاں تک کہ وہ تقسیم کر دیا جائے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Isnaad Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 113
			}
		},
		{
			"hadithnumber": 2159,
			"arabicnumber": 2159,
			"text": "اس سند سے بھی ابن اسحاق سے یہی حدیث مروی ہے اس میں ہے: یہاں تک کہ وہ ایک حیض کے ذریعہ استبراء رحم کر لے ، اس میں «بحيضة» کا اضافہ ہے، اور یہ ابومعاویہ کا وہم ہے اور یہ ابوسعید رضی اللہ عنہ کی حدیث میں صحیح ہے، اور اس روایت میں یہ بھی اضافہ ہے: اور جو شخص اللہ اور آخرت کے دن پر ایمان رکھتا ہو وہ مسلمانوں کے مال فیٔ کے جانور پر سواری نہ کرے کہ اسے دبلا کر کے واپس دے ، اور جو اللہ اور یوم آخرت پر ایمان رکھتا ہو وہ مسلمانوں کے مال فیٔ کا کپڑا نہ پہنے کہ پرانا کر کے لوٹا دے۔ ابوداؤد کہتے ہیں کہ حیض کا لفظ محفوظ نہیں ہے یہ ابومعاویہ کا وہم ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 114
			}
		},
		{
			"hadithnumber": 2160,
			"arabicnumber": 2160,
			"text": "عبداللہ بن عمرو بن العاص رضی اللہ عنہما کہتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: تم میں سے کوئی جب کسی عورت سے نکاح کرے یا کوئی خادم خریدے تو یہ دعا پڑھے: «اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها ومن شر ما جبلتها عليه» اے اللہ! میں تجھ سے اس کی بھلائی اور اس کی جبلت اور اس کی طبیعت کا خواستگار ہوں، جو خیر و بھلائی تو نے ودیعت کی ہے، اس کے شر اور اس کی جبلت اور طبیعت میں تیری طرف سے ودیعت شر سے تیری پناہ مانگتا ہوں اور جب کوئی اونٹ خریدے تو اس کے کوہان کی چوٹی پکڑ کر یہی دعا پڑھے ۔ ابوداؤد کہتے ہیں: عبداللہ سعید نے اتنا اضافہ کیا ہے کہ پھر اس کی پیشانی پکڑے اور عورت یا خادم میں برکت کی دعا کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 115
			}
		},
		{
			"hadithnumber": 2161,
			"arabicnumber": 2161,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: اگر تم میں سے کوئی اپنی بیوی کے پاس آنے کا ارادہ کرے اور یہ دعا پڑھے: «بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا» اللہ کے نام سے شروع کرتا ہوں اے اللہ ہم کو شیطان سے بچا اور اس مباشرت سے جو اولاد ہو اس کو شیطان کے گزند سے محفوظ رکھ پھر اگر اس مباشرت سے بچہ ہونا قرار پا جائے تو اللہ تعالیٰ اس بچے پر شیطان کا زور نہ چلنے دے گا یا شیطان اسے کبھی نقصان نہ پہنچ اس کے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 116
			}
		},
		{
			"hadithnumber": 2162,
			"arabicnumber": 2162,
			"text": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جو شخص اپنی بیوی کی دبر ( پاخانہ کے مقام ) میں صحبت کرے اس پر لعنت ہے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 117
			}
		},
		{
			"hadithnumber": 2163,
			"arabicnumber": 2163,
			"text": "محمد بن منکدر کہتے ہیں کہ میں نے جابر رضی اللہ عنہ کو یہ کہتے ہوئے سنا کہ یہود کہتے تھے کہ اگر آدمی اپنی بیوی کی شرمگاہ میں پیچھے سے صحبت کرے تو لڑکا بھینگا ہو گا، تو اللہ تعالیٰ نے یہ آیت نازل فرمائی «نساؤكم حرث لكم فأتوا حرثكم أنى شئتم» ( سورۃ البقرہ: ۲۲۳ ) تمہاری عورتیں تمہاری کھیتیاں ہیں تو تم اپنی کھیتیوں میں جدھر سے چاہو آؤ ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 118
			}
		},
		{
			"hadithnumber": 2164,
			"arabicnumber": 2164,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ اللہ ابن عمر رضی اللہ عنہما کو بخشے ان کو «أنى شئتم» کے لفظ سے وہم ہو گیا تھا، اصل واقعہ یوں ہے کہ انصار کے اس بت پرست قبیلے کا یہود ( جو کہ اہل کتاب ہیں کے ) ایک قبیلے کے ساتھ میل جول تھا اور انصار علم میں یہود کو اپنے سے برتر مانتے تھے، اور بہت سے معاملات میں ان کی پیروی کرتے تھے، اہل کتاب کا حال یہ تھا کہ وہ عورتوں سے ایک ہی آسن سے صحبت کرتے تھے، اس میں عورت کے لیے پردہ داری بھی زیادہ رہتی تھی، چنانچہ انصار نے بھی یہودیوں سے یہی طریقہ لے لیا اور قریش کے اس قبیلہ کا حال یہ تھا کہ وہ عورتوں کو طرح طرح سے ننگا کر دیتے تھے اور آگے سے، پیچھے سے، اور چت لٹا کر ہر طرح سے لطف اندوز ہوتے تھے، مہاجرین کی جب مدینہ میں آمد ہوئی تو ان میں سے ایک شخص نے انصار کی ایک عورت سے شادی کی اور اس کے ساتھ وہی طریقہ اختیار کرنے لگا اس پر عورت نے اعتراض کرتے ہوئے کہا کہ ہمارے یہاں تو ایک ہی ( مشہور ) آسن رائج ہے، لہٰذا یا تو اس طرح کرو، ورنہ مجھ سے دور رہو، جب اس بات کا چرچا ہوا تو رسول اللہ صلی اللہ علیہ وسلم کو بھی اس کی خبر لگ گئی چنانچہ اللہ عزوجل نے یہ آیت «نساؤكم حرث لكم فأتوا حرثكم أنى شئتم» نازل فرمائی یعنی آگے سے پیچھے سے، اور چت لٹا کر اس سے مراد لڑکا پیدا ہونے کی جگہ ہے یعنی شرمگاہ میں جماع ہے ۱؎۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Hasan"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Hasan"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Hasan"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 119
			}
		},
		{
			"hadithnumber": 2165,
			"arabicnumber": 2165,
			"text": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ یہودیوں میں جب کوئی عورت حائضہ ہو جاتی تو اسے گھر سے نکال دیتے نہ اس کے ساتھ کھاتے پیتے اور نہ ہی اسے گھر میں رکھتے، رسول اللہ صلی اللہ علیہ وسلم سے اس سلسلہ میں دریافت کیا گیا تو اللہ تعالیٰ نے یہ آیت نازل فرمائی «يسألونك عن المحيض قل هو أذى فاعتزلوا النساء في المحيض» لوگ آپ سے حیض کے متعلق سوال کرتے ہیں تو کہہ دیجئیے کہ وہ گندگی ہے لہٰذا تم حیض کی حالت میں عورتوں سے علیحدہ رہو ( سورۃ البقرہ: ۲۲۲ ) ، چنانچہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ: انہیں گھروں میں رکھو اور جماع کے علاوہ ہر کام کرو ، اس پر یہودیوں نے کہا کہ: یہ شخص تو ہمارے ہر کام کی مخالفت کرتا ہے، چنانچہ اسید بن حضیر اور عباد بن بشر رضی اللہ عنہما رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوئے اور کہنے لگے: اللہ کے رسول! یہودی ایسا ایسا کہہ رہے ہیں، تو کیا ہم ( ان کی مخالفت میں ) عورتوں سے حالت حیض میں جماع نہ کرنے لگیں؟ یہ سن کر اللہ کے رسول صلی اللہ علیہ وسلم کا چہرہ متغیر ہو گیا، یہاں تک کہ ہمیں اپنے اوپر آپ کی ناراضگی کا گمان ہونے لگا چنانچہ دونوں آپ صلی اللہ علیہ وسلم کے پاس سے نکل آئے، اسی اثناء میں آپ کے پاس دودھ کا ہدیہ آ گیا، تو آپ صلی اللہ علیہ وسلم نے انہیں بلوا بھیجا جس سے ہمیں لگا کہ آپ ان سے ناراض نہیں ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 120
			}
		},
		{
			"hadithnumber": 2166,
			"arabicnumber": 2166,
			"text": "خلاس بن عمرو ہجری کہتے ہیں کہ میں نے ام المؤمنین عائشہ رضی اللہ عنہا کو کہتے ہوئے سنا: میں اور رسول اللہ صلی اللہ علیہ وسلم دونوں ایک ہی کپڑے میں رات گزارتے اور میں حالت حیض میں ہوتی، اگر کہیں آپ صلی اللہ علیہ وسلم کو کچھ لگ جاتا تو صرف اس جگہ کو دھو لیتے اس سے آگے نہ بڑھتے، اور کہیں کپڑے میں لگ جاتا تو صرف اتنی ہی جگہ دھو لیتے، اس سے آگے نہ بڑھتے اور اسی کپڑے میں نماز پڑھتے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 121
			}
		},
		{
			"hadithnumber": 2167,
			"arabicnumber": 2167,
			"text": "عبداللہ بن شداد اپنی خالہ میمونہ بنت حارث رضی اللہ عنہا سے روایت کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم اپنی کسی بیوی سے حالت حیض میں مباشرت کرنے کا ارادہ فرماتے تو اسے تہبند باندھنے کا حکم دیتے پھر اس کے ساتھ لیٹ جاتے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 122
			}
		},
		{
			"hadithnumber": 2168,
			"arabicnumber": 2168,
			"text": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ نبی اکرم صلی اللہ علیہ وسلم نے اس شخص کے بارے میں جو اپنی بیوی سے حالت حیض میں صحبت کر بیٹھتا ہے فرمایا: وہ ایک یا آدھا دینار ( بطور کفارہ ) صدقہ ادا کرے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 123
			}
		},
		{
			"hadithnumber": 2169,
			"arabicnumber": 2169,
			"text": "عبداللہ بن عباس رضی اللہ عنہما کہتے ہیں کہ اگر دوران خون صحبت کی تو ایک دینار، اور خون بند ہو جانے پر صحبت کی تو آدھا دینار ( کفارہ ) ہے۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih Muquf"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 124
			}
		},
		{
			"hadithnumber": 2170,
			"arabicnumber": 2170,
			"text": "ابو سعید خدری رضی اللہ عنہ کہتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم کے سامنے عزل ۱؎ کا ذکر کیا گیا تو آپ نے فرمایا: تم میں سے کوئی ایسا کیوں کرتا ہے؟ ( یہ آپ صلی اللہ علیہ وسلم نے نہیں فرمایا کہ وہ ایسا نہ کرے ) ، کیونکہ اللہ تعالیٰ جس نفس کو پیدا کرنا چاہتا ہے تو وہ اسے پیدا کر کے ہی رہے گا ۲؎ ۔ ابوداؤد کہتے ہیں: قزعہ، زیاد کے غلام ہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 125
			}
		},
		{
			"hadithnumber": 2171,
			"arabicnumber": 2171,
			"text": "ابوسعید خدری رضی اللہ عنہ سے روایت ہے کہ ایک شخص نے کہا: اللہ کے رسول! میری ایک لونڈی ہے جس سے میں عزل کرتا ہوں، کیونکہ اس کا حاملہ ہونا مجھے پسند نہیں اور مرد ہونے کے ناطے مجھے شہوت ہوتی ہے، حالانکہ یہود کہتے ہیں کہ عزل زندہ درگور کرنے کی چھوٹی شکل ہے، یہ سن کر آپ صلی اللہ علیہ وسلم نے فرمایا: یہود جھوٹ کہتے ہیں اگر اللہ تعالیٰ کو پیدا کرنا منظور ہو گا، تو تم اسے پھیر نہیں سکتے ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Hasan"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 126
			}
		},
		{
			"hadithnumber": 2172,
			"arabicnumber": 2172,
			"text": "عبداللہ بن محیریز کہتے ہیں کہ مسجد میں داخل ہوا تو میں نے ابو سعید خدری رضی اللہ عنہ کو دیکھا اور ان کے پاس بیٹھ گیا، ان سے عزل کے متعلق سوال کیا، تو آپ نے جواب دیا کہ ہم رسول اللہ صلی اللہ علیہ وسلم کے ہم راہ غزوہ بنی مصطلق میں نکلے تو ہمیں کچھ عربی لونڈیاں ہاتھ لگیں، ہمیں عورتوں کی خواہش ہوئی اور عورتوں سے الگ رہنا ہم پر گراں گزرنے لگا ہم ان لونڈیوں کو فدیہ میں لینا چاہ رہے تھے اس لیے حمل کے ڈر سے ہم ان سے عزل کرنا چاہ رہے تھے، پھر ہم نے اپنے ( جی میں ) کہا کہ رسول اللہ صلی اللہ علیہ وسلم ہمارے درمیان موجود ہیں تو آپ سے اس بارے میں پوچھنے سے پہلے ہم عزل کریں ( تو یہ کیونکر درست ہو گا ) چنانچہ ہم نے آپ سے اس بارے میں پوچھا تو آپ صلی اللہ علیہ وسلم نے فرمایا: یہ نہ کرو تو تمہارا کیا نقصان ہے؟ قیامت تک جو جانیں پیدا ہونے والی ہیں وہ تو ہو کر رہیں گی ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Bukhari And Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 127
			}
		},
		{
			"hadithnumber": 2173,
			"arabicnumber": 2173,
			"text": "جابر رضی اللہ عنہ کہتے ہیں کہ انصار کا ایک آدمی رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا اور اس نے کہا کہ: میری ایک لونڈی ہے جس سے میں صحبت کرتا ہوں اور اس کا حاملہ ہونا مجھے پسند نہیں، تو آپ صلی اللہ علیہ وسلم نے فرمایا: چاہو تو عزل کر لو، جو اس کے مقدر میں ہے وہ تو ہو کر رہے گا ، ایک مدت کے بعد وہ شخص آ کر کہنے لگا، کہ لونڈی حاملہ ہو گئی، آپ صلی اللہ علیہ وسلم نے فرمایا کہ: میں نے تو کہا ہی تھا کہ جو اس کے مقدر میں ہے وہ ہو کر رہے گا ۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Sahih"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Sahih"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Sahih"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Sahih Muslim"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 128
			}
		},
		{
			"hadithnumber": 2174,
			"arabicnumber": 2174,
			"text": "ابونضرہ کہتے ہیں: مجھ سے قبیلہ طفاوہ کے ایک شیخ نے بیان کیا کہ مدینہ میں میں ایک بار ابوہریرہ رضی اللہ عنہ کا مہمان ہوا میں نے صحابہ کرام رضی اللہ عنہم میں کسی کو بھی مہمانوں کے معاملے میں ان سے زیادہ چاق و چوبند اور ان کی خاطر مدارات کرنے والا نہیں دیکھا، ایک مرتبہ کا واقعہ ہے کہ میں ان کے پاس تھا، وہ اپنے تخت پر بیٹھے تھے ان کے ساتھ ایک تھیلی تھی جس میں کنکریاں یا گٹھلیاں تھیں، نیچے ایک کالی کلوٹی لونڈی تھی، آپ رضی اللہ عنہ ان کنکریوں پر تسبیح پڑھ رہے تھے، جب ( پڑھتے پڑھتے ) تھیلی ختم ہو جاتی تو انہیں لونڈی کی طرف ڈال دیتے، اور وہ انہیں دوبارہ تھیلی میں بھر کر دیتی ابوہریرہ رضی اللہ عنہ کہنے لگے: کیا میں تمہیں رسول اللہ صلی اللہ علیہ وسلم کے ساتھ اپنا ایک واقعہ نہ بتاؤں؟ میں نے کہا: کیوں نہیں، ضرور بتائیے، انہوں نے کہا: میں مسجد میں تھا اور بخار میں مبتلا تھا کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے یہاں تک کہ مسجد میں داخل ہوئے اور کہنے لگے: کس نے دوسی جوان ( ابوہریرہ ) کو دیکھا ہے؟ یہ جملہ آپ نے تین بار فرمایا، تو ایک شخص نے کہا: اللہ کے رسول! وہ یہاں مسجد کے کونے میں ہیں، انہیں بخار ہے، چنانچہ آپ صلی اللہ علیہ وسلم تشریف لائے اور اپنا دست مبارک میرے اوپر رکھا، اور مجھ سے بھلی بات کی تو میں اٹھ گیا، اور آپ چل کر اسی جگہ واپس آ گئے، جہاں نماز پڑھاتے تھے، اور لوگوں کی جانب متوجہ ہوئے، آپ صلی اللہ علیہ وسلم کے ساتھ دو صف مردوں اور ایک صف عورتوں کی تھی یا دو صف عورتوں کی اور ایک صف مردوں کی تھی، آپ صلی اللہ علیہ وسلم نے فرمایا: اگر نماز میں شیطان مجھے کچھ بھلا دے تو مرد سبحان اللہ کہیں، اور عورتیں تالی بجائیں ، رسول اللہ صلی اللہ علیہ وسلم نے نماز پڑھائی اور نماز میں کوئی چیز بھولے نہیں اور فرمایا: اپنی جگہوں پر بیٹھے رہو، اپنی جگہوں پر بیٹھے رہو ، پھر آپ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کی حمد و ثنا بیان کی، پھر امابعد کہا اور پہلے مردوں کی جانب متوجہ ہوئے اور فرمایا: کیا تم میں کوئی ایسا ہے جو اپنی بیوی کے پاس آ کر، دروازہ بند کر لیتا ہے اور پردہ ڈال لیتا ہے اور اللہ کے پردے میں چھپ جاتا ہے؟ ، لوگوں نے جواب دیا: ہاں، پھر آپ صلی اللہ علیہ وسلم نے فرمایا: اس کے بعد وہ لوگوں میں بیٹھتا ہے اور کہتا ہے: میں نے ایسا کیا میں نے ایسا کیا ، یہ سن کر لوگ خاموش رہے، مردوں کے بعد آپ صلی اللہ علیہ وسلم عورتوں کی جانب متوجہ ہوئے اور ان سے بھی پوچھا کہ: کیا کوئی تم میں ایسی ہے، جو ایسی باتیں کرتی ہے؟ ، تو وہ بھی خاموش رہیں، لیکن ایک نوجوان عورت اپنے ایک گھٹنے کے بل کھڑی ہو کر اونچی ہو گئی تاکہ آپ صلی اللہ علیہ وسلم اسے دیکھ سکیں اور اس کی باتیں سن سکیں، اس نے کہا: اللہ کے رسول! اس قسم کی گفتگو مرد بھی کرتے ہیں اور عورتیں بھی کرتی ہیں۔ آپ صلی اللہ علیہ وسلم نے فرمایا: جانتے ہو ایسے شخص کی مثال کیسی ہے؟ ، پھر خود ہی فرمایا: اس کی مثال اس شیطان عورت کی سی ہے جو گلی میں کسی شیطان مرد سے ملے، اور اس سے اپنی خواہش پوری کرے، اور لوگ اسے دیکھ رہے ہوں۔ خبردار! مردوں کی خوشبو وہ ہے جس کی بو ظاہر ہو رنگ ظاہر نہ ہو اور خبردار! عورتوں کی خوشبو وہ ہے جس کا رنگ ظاہر ہو بو ظاہر نہ ہو ۔ ابوداؤد کہتے ہیں: مجھے موسیٰ اور مومل کے یہ الفاظ یاد ہیں، آپ صلی اللہ علیہ وسلم نے فرمایا: خبردار! کوئی مرد کسی مرد اور کوئی عورت کسی عورت کے ساتھ ایک بستر میں نہ لیٹے مگر اپنے باپ یا بیٹے کے ساتھ لیٹا جا سکتا ہے ۔ راوی کا بیان ہے کہ بیٹے اور باپ کے علاوہ ایک تیسرے آدمی کا بھی ذکر آپ صلی اللہ علیہ وسلم نے کیا جو میں بھول گیا وہ مسدد والی روایت میں ہے، لیکن جیسا یاد رہنا چاہیئے وہ مجھے یاد نہیں۔",
			"grades": [
				{
					"name": "Al-Albani",
					"grade": "Daif"
				},
				{
					"name": "Muhammad Muhyi Al-Din Abdul Hamid",
					"grade": "Daif"
				},
				{
					"name": "Shuaib Al Arnaut",
					"grade": "Daif"
				},
				{
					"name": "Zubair Ali Zai",
					"grade": "Daif"
				}
			],
			"reference": {
				"book": 12,
				"hadith": 129
			}
		}
	]
}